<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Enrichir la notion de patron par la prise en compte de la structure textuelle - Application &#224; la construction d&#8217;ontologie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Enrichir la notion de patron par la prise en compte de la structure
textuelle - Application &#224; la construction d&#8217;ontologie
</p>
<p>Marion laignelet1 Mouna Kamel2 Nathalie Aussenac-Gilles2
(1) CLLE-ERSS, Universit&#233; de Toulouse 2, 5 all&#233;e A. Machado, 31058 Toulouse Cedex 9
</p>
<p>(2) IRIT, Universit&#233; Paul Sabatier, 118 Route de Narbonne, 31062 Toulouse Cedex 9
marion.laignelet@univ-tlse2.fr, kamel@irit.fr, aussenac@irit.fr
</p>
<p>R&#233;sum&#233;. La projection de patrons lexico-syntaxiques sur corpus est une des mani&#232;res privil&#233;gi&#233;es pour
identifier des relations s&#233;mantiques pr&#233;cises entre &#233;l&#233;ments lexicaux. Dans cet article, nous proposons d&#8217;&#233;tendre
la notion de patron en prenant en compte la s&#233;mantique que v&#233;hiculent les &#233;l&#233;ments de structure d&#8217;un document
(d&#233;finitions, titres, &#233;num&#233;rations) dans l&#8217;identification de relations. Nous avons test&#233; cette hypoth&#232;se dans le cadre
de la construction d&#8217;ontologies &#224; partir de textes fortement structur&#233;s du domaine de la cartographie.
</p>
<p>Abstract. Matching lexico-syntactic patterns on text corpora is one of the favorite ways to identify precise
semantic relations between lexical items. In this paper, we propose to rely on text structure to extend the notion
of pattern and to take into account the semantics that the structure (definitions, titles, item lists) may bear when
identifying semantic relations between concepts. We have checked this hypothesis by building an ontology via
highly structured texts describing spatial, i.e. geographical information.
</p>
<p>Mots-cl&#233;s : Construction d&#8217;ontologie, patron lexico-syntaxique, structure textuelle.
</p>
<p>Keywords: Ontology engineering, lexico-syntactic patterns, textual structure.
</p>
<p>1 Introduction
</p>
<p>La projection de patrons lexico-syntaxiques sur corpus, utilis&#233;e pour l&#8217;extraction d&#8217;informations, s&#8217;applique &#233;ga-
lement sur des corpus sp&#233;cialis&#233;s pour la construction d&#8217;ontologies de domaines : on s&#8217;attend &#224; trouver des traces
linguistiques de concepts et de relations s&#233;mantiques binaires entre ces concepts. Des travaux en linguistique ont
mis en &#233;vidence le r&#244;le de la structure dans l&#8217;interpr&#233;tation d&#8217;un texte (Luc &amp; Virbel, 2001; Pascual &amp; P&#233;ry-
Woodley, 1997; Rebeyrolles et al., 2009). Nous supposons que des informations issues de la structure textuelle
peuvent &#234;tre int&#233;gr&#233;es aux patrons de recherche de relations s&#233;mantiques, en plus des &#233;l&#233;ments lexicaux et syn-
taxiques. Nous avons test&#233; cette hypoth&#232;se dans le cadre de la construction d&#8217;ontologies &#224; partir de textes, en nous
focalisant sur des &#233;l&#233;ments textuels particuli&#232;rement favorables &#224; la recherche de relations ontologiques : les titres,
les zones d&#233;finitoires et les &#233;num&#233;rations. Ces &#233;l&#233;ments permettent non seulement d&#8217;extraire des traces linguis-
tiques pour d&#233;finir des concepts et des relations pertinents pour notre domaine d&#8217;application mais &#233;galement de
r&#233;soudre certaines situations elliptiques, fr&#233;quentes dans nos donn&#233;es.
</p>
<p>Le domaine d&#8217;&#233;tude de nos travaux s&#8217;inscrit dans le traitement automatique de textes structur&#233;s dans lesquels
l&#8217;organisation m&#234;me des &#233;l&#233;ments textuels refl&#232;te celle des concepts du domaine. Dans ces types de textes, la
structure peut &#234;tre explicite comme c&#8217;est le cas avec les versions &#233;lectroniques de th&#233;saurus ou de dictionnaires
(Hearst, 1992) ou inf&#233;rable &#224; partir de leur mise en forme. En ce qui nous concerne, c&#8217;est &#224; partir de la mise
en forme mat&#233;rielle des documents que les diff&#233;rentes classes (ou concepts) du domaine sont nomm&#233;es et mises
en relation les unes avec les autres. On trouve de tels types de textes dans des domaines sp&#233;cifiques, comme la
botanique qui se pr&#234;te naturellement &#224; la repr&#233;sentation de taxinomies : dans les travaux de (Role &amp; Rousse, 2006),
la structure des titres refl&#232;te un d&#233;coupage en genres et en esp&#232;ces et permet d&#8217;initialiser une hi&#233;rarchie de classes
de l&#8217;ontologie.
</p>
<p>Les textes de notre corpus appartiennent au domaine g&#233;ographique 1 : ils d&#233;crivent les objets susceptibles d&#8217;in-
t&#233;grer des bases de donn&#233;es g&#233;ographiques et cartographiques. Dans un premier temps, nous nous int&#233;ressons &#224;
</p>
<p>1. Projet G&#233;onto, http ://geonto.lri.fr/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MARION LAIGNELET, MOUNA KAMEL, NATHALIE AUSSENAC-GILLES
</p>
<p>deux bases, BDTopo et BD Carto. Les documents associ&#233;s constituent ainsi une ressource privil&#233;gi&#233;e, particuli&#232;-
rement bien adapt&#233;e &#224; l&#8217;approche que nous avons d&#233;finie. Ces guides de saisie de bases de donn&#233;es de l&#8217;IGN 2,
appel&#233;s documents de sp&#233;cification, indiquent les types d&#8217;objets pr&#233;d&#233;finis pour d&#233;crire les objets du monde r&#233;el
&#224; saisir dans la base. Cet ensemble constitue un corpus de 23 884 mots (17 069 pour BDCarto et 6 815 pour
BDTopo). Initialement disponibles au format doc, ils utilisent un style et une mise en forme sp&#233;cifique &#224; chaque
type d&#8217;information qui ont &#233;t&#233; manuellement traduits au format xml.
</p>
<p>Apr&#232;s avoir pr&#233;sent&#233; les approches par patrons pour la construction d&#8217;ontologie et montr&#233; l&#8217;int&#233;r&#234;t de la prise en
compte de la structure des documents, nous pr&#233;sentons le principe de fonctionnement de nos patrons ainsi qu&#8217;une
&#233;valuation qualitative des traitements automatiques mis en oeuvre.
</p>
<p>2 Approches par patrons : prendre en compte les &#233;l&#233;ments structurants
</p>
<p>Diff&#233;rentes approches, statistiques ou linguistiques, ont &#233;t&#233; propos&#233;es pour extraire des relations &#224; partir de textes
dans la perspective de construire une ressource terminologique ou ontologique (Maedche, 2002). Ces m&#233;thodes
et les logiciels associ&#233;s assistent plus ou moins l&#8217;identification et la repr&#233;sentation des relations. Elles peuvent
soit localiser des contextes en corpus (Knowledge Rich Context au sens de (Meyer, 2001), soit aider &#224; iden-
tifier les termes en relation et la nature des relations, comme le font Prom&#233;th&#233;e (Morin, 1999) ou Cam&#233;l&#233;on
(Aussenac-Gilles &amp; Jacques, 2008), soit encore, d&#233;finir des concepts et des relations s&#233;mantiques formalis&#233;es
dans des ontologies existantes (Scarlett, (Sabou et al., 2008)).
</p>
<p>Nous nous focalisons sur la question de l&#8217;outillage du rep&#233;rage en corpus d&#8217;indices linguistiques pouvant donner
lieu &#224; la cr&#233;ation de concepts et de leurs relations dans une ontologie en cours de construction. Notre proposition
est de s&#8217;int&#233;resser, en plus des aspects lexicaux et syntaxiques, aux &#233;l&#233;ments structurants d&#8217;un texte traduits en xml
&#224; partir de la mise en forme des documents. Cela permet la prise en compte de situations textuelles diversifi&#233;es ce
qui &#233;tend la port&#233;e des patrons. Nous proposons un travail sur les titres, les d&#233;finitions et les &#233;num&#233;rations car ces
objets b&#233;n&#233;ficient de r&#233;gularit&#233;s syntaxiques et de mise en forme facilitant leur traitement automatique.
</p>
<p>Bien que les relations trouv&#233;es par les patrons soient des relations lexicales, nous les repr&#233;sentons au niveau
conceptuel afin de r&#233;aliser une &#233;valuation sur les r&#233;sultats produits. Nous sommes conscients de gommer ainsi
une phase d&#233;licate de l&#8217;interpr&#233;tation, qui consiste &#224; d&#233;cider si un terme doit &#234;tre associ&#233; &#224; un concept existant ou
donner lieu &#224; la naissance d&#8217;un concept ou d&#8217;une instance de concept. A priori, nous g&#233;n&#233;rons un nouveau concept
syst&#233;matiquement.
</p>
<p>FIGURE 1 &#8211; Types de d&#233;finitions propices &#224; la cr&#233;ation de fragments d&#8217;ontologie
</p>
<p>Une d&#233;finition pose &#171; une &#233;quivalence de sens entre un terme et une p&#233;riphrase structur&#233;e selon la logique des
classes &#187; (EscoubasBenveniste, 2010). Beaucoup &#233;tudi&#233;es en linguistique, les d&#233;finitions sont des objets textuels
au sein desquels des relations s&#233;mantiques entre les mots sont relativement explicites (Cartier, 1998; Condamines
&amp; Rebeyrolles, 2000; Pascual &amp; P&#233;ry-Woodley, 1997) et stables : les principales sont la synonymie, l&#8217;hyp&#233;rony-
mie et la m&#233;ronymie ; les relations sp&#233;cifiques aux domaines d&#8217;application sont la causalit&#233; ou le but (Montiel-
Ponsada et al., 2009; Malais&#233; et al., 2005). De plus, l&#8217;ordre canonique des termes dans les d&#233;finitions explicitent
</p>
<p>2. Institut G&#233;ographique National</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PATRONS DE TEXTE POUR LA CONSTRUCTION D&#8217;ONTOLOGIES
</p>
<p>des relations pr&#233;cises (inclusion d&#8217;un terme, terme superordonn&#233; ou attribut(s) pr&#233;cisant un terme) et facilitent
leur traitement automatique. En effet, les &#233;nonc&#233;s d&#233;finitoires pr&#233;sentent des propri&#233;t&#233;s textuelles suffisamment
stables pour qu&#8217;un rep&#233;rage automatique puisse &#234;tre envisag&#233; dans diff&#233;rents discours (Hearst, 1992; Rebeyrolles
&amp; Tanguy, 2000). La figure 1 exemplifie les fragments d&#8217;ontologie susceptibles d&#8217;&#234;tre extraits &#224; partir de types de
d&#233;finition simples. Contrairement aux travaux de (Malais&#233; et al., 2005), nous ne travaillons pas sur des d&#233;finitions
int&#233;gr&#233;es au flux textuel mais sur des champs xml pr&#233;tagg&#233;s, ce qui facilite naturellement leur traitement.
</p>
<p>L&#8217;&#233;nonc&#233; d&#233;finitoire est souvent elliptique et anaphorique (EscoubasBenveniste, 2010) : le recours &#224; son contexte
discursif et &#224; son environnement textuel permet de l&#8217;interpr&#233;ter correctement. Pour g&#233;rer les situations elliptiques,
nous exploitons les informations pr&#233;sentes dans les titres. Les situations anaphoriques sont plus d&#233;licates &#224; traiter
et leur r&#233;solution, m&#234;me partielle, n&#8217;est pas encore impl&#233;ment&#233;e.
</p>
<p>Les titres explicitent la structure logique du document. Pour (Ho-Dac et al., 2004), l&#8217;embo&#238;tement ou le paral-
l&#233;lisme de titres de sous-sections d&#8217;une section donn&#233;e refl&#232;te des relations de subordination ou de juxtaposition
existant entre ces sections : lorsque les sous-titres pr&#233;sentent la m&#234;me structure discursive ou syntaxique, il est
possible d&#8217;instaurer une relation s&#233;mantique entre le titre et chacun des sous-titres, ou entre les sous-titres (Kamel
&amp; Aussenac-Gilles, 2009). La figure 2 illustre le type de fragment d&#8217;ontologie pouvant &#234;tre g&#233;n&#233;r&#233; &#224; partir d&#8217;un
ensemble de titres. Les travaux de (Role &amp; Rousse, 2006) vont &#233;galement dans ce sens.
</p>
<p>FIGURE 2 &#8211; Exemple de titres propices &#224; la cr&#233;ation de fragments d&#8217;ontologie
</p>
<p>Une &#233;num&#233;ration consiste &#224; &#233;noncer un &#224; un les &#233;l&#233;ments d&#8217;un m&#234;me champ conceptuel, ces &#233;l&#233;ments entretenant
un lien hi&#233;rarchique direct ou indirect avec un &#233;l&#233;ment classifieur (Luc &amp; Virbel, 2001). Sur le plan textuel, cet acte
se traduit par une structure hi&#233;rarchique dite structure &#233;num&#233;rative, compos&#233;e d&#8217;une amorce, d&#8217;une liste d&#8217;items
(introduite par l&#8217;amorce) et &#233;ventuellement d&#8217;une conclusion. (Luc &amp; Virbel, 2001) d&#233;finit comme paradigmatique
une structure &#233;num&#233;rative &#187; au sein de laquelle les items n&#8217;ont aucun lien de d&#233;pendance syntaxique et sont
consid&#233;r&#233;s comme fonctionnellement &#233;quivalents. La figure 3 illustre une &#233;num&#233;ration et la structure hi&#233;rarchique
des concepts ontologiques correspondants.
</p>
<p>FIGURE 3 &#8211; Interpr&#233;tation d&#8217;une structure &#233;num&#233;rative
</p>
<p>3 Proposition de patrons de textes
</p>
<p>Nous appellons &quot;patron de texte&quot; un patron lexico-syntaxique qui int&#232;gre &#224; la fois des &#233;l&#233;ments lexico-syntaxiques
et des &#233;l&#233;ments de structure. Les patrons que nous pr&#233;sentons ont pour but de cr&#233;er des fragments d&#8217;ontologies &#224;
m&#234;me de venir compl&#233;ter et enrichir une ontologie existante. Nous avons d&#233;velopp&#233; trois modules diff&#233;rents : le
premier exploite uniquement des informations de type lexical et syntaxique, le second combine structure, lexique
et syntaxe, enfin le troisi&#232;me exploite uniquement la structure et se rapproche en cela des wrappers (Kushmerick
et al., 1997).
</p>
<p>Approche par patron lexico-syntaxique &#171; classique &#187;
</p>
<p>Un premier module exploite les zones en langage naturel pr&#233;sentes dans les d&#233;finitions. Des patrons lexico-
syntaxiques &#171; classiques &#187; permettent de rechercher des traces linguistiques de relations s&#233;mantiques et de concepts
potentiels. Ici, la relation identifi&#233;e d&#233;pend du marqueur et du contexte d&#8217;interpr&#233;tation. Nous traitons les relations</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MARION LAIGNELET, MOUNA KAMEL, NATHALIE AUSSENAC-GILLES
</p>
<p>d&#8217;hyp&#233;ronymie, de m&#233;ronymie, d&#8217;artefact et de fonction. Ce module a &#233;t&#233; d&#233;velopp&#233; &#224; l&#8217;aide de la plateforme
LinguaStream, sous forme de grammaires locales en Prolog. Les patrons ont &#233;t&#233; enrichis sur la base des travaux
de (Aussenac-Gilles &amp; Jacques, 2008) et des probl&#233;matiques du projet G&#233;onto (par les relations de fonction (sert
&#224;) et d&#8217;artefact (est repr&#233;sent&#233; par)). Au total, ce module rep&#232;re 18 situations de m&#233;ronymie, 48 relations d&#8217;hy-
peronymie, 14 d&#8217;artefact et 82 cas de fonction.
</p>
<p>Combiner structure, lexique et syntaxe : analyse des titres et des d&#233;finitions
</p>
<p>Ces traitements exploitent &#224; la fois les titres, leur forme syntaxique et celle des d&#233;finitions sous la d&#233;pendance du
titre. Nous nous basons sur l&#8217;id&#233;e qu&#8217;il y a une relation s&#233;mantique diff&#233;rente selon la structure syntaxique de la
d&#233;finition. Nous consid&#233;rons deux situations :
</p>
<p>&#8211; un terme-concept est d&#233;fini par un syntagme nominal dont la structure syntaxique est simple, i.e. qui ne com-
prend qu&#8217;un seul nom. Dans ce cas, c&#8217;est une relation s&#233;mantique de type synonymie qui s&#8217;instancie entre les
deux termes.
</p>
<p>Par exemple dans une situation o&#249; le titre est &lt;titre&gt;Cascade &lt;/titre&gt; et la d&#233;finition associ&#233;e est &lt;defini-
tion&gt;Chute d&#8217;eau. &lt;/definition&gt;, une relation de synonymie relie &quot;cascade&quot; et &quot;chute d&#8217;eau&quot;.
</p>
<p>&#8211; un terme-concept est d&#233;fini par un nom/terme auquel sont adjoints des adjectifs/propri&#233;t&#233;s. Dans ce second cas,
une relation hyperonymique s&#8217;&#233;tablit entre les deux termes.
</p>
<p>Par exemple, si le titre est &lt;titre&gt; piste d&#8217;a&#233;rodrome&lt;/titre&gt; et la d&#233;finition &lt;definition&gt;aire situ&#233;e sur un
a&#233;rodrome &lt;/definition&gt;, le fragment d&#8217;ontologie propos&#233; sera : #piste_d&#8217;a&#233;rodrome est-un #aire.
</p>
<p>Le titre sert &#233;galement &#224; g&#233;rer les situations elliptiques dans lesquelles un des &#233;l&#233;ments de la relation (souvent le
sujet) est absent ou incomplet dans la zone de d&#233;finition. Par exemple, si la d&#233;finition est &lt;definition&gt;Permet de
distinguer les cours d&#8217;eau naturels des cours d&#8217;eau artificiels &lt;/definition&gt; alors un syntagme capable de jouer le
r&#244;le de sujet pour le verbe en question est recherch&#233; dans le titre. En l&#8217;occurrence &lt;titre&gt; artificialis&#233;&lt;/titre&gt; est
le sujet de permet de. Au total, ce module rep&#232;re et analyse 359 situations o&#249; les titres et les d&#233;finitions requi&#232;rent
un traitement sp&#233;cifique.
</p>
<p>Traiter la structure : analyse des &#233;num&#233;rations
</p>
<p>Bien que poss&#233;dant des propri&#233;t&#233;s lexico-syntaxiques, typographiques et dispositionnelles diff&#233;rentes des struc-
tures &#233;num&#233;ratives classiques, les &#233;num&#233;rations paradigmatiques de notre corpus en conservent les caract&#233;ristiques
s&#233;mantiques. L&#8217;amorce est marqu&#233;e par certaines des balises de titre (&lt;className&gt;, &lt;attributeName&gt; ou &lt;va-
lueName&gt;), la liste d&#8217;items par les balises &lt;description type=&quot;extensionalDefinition&quot;&gt; ou &lt;enumeratedValues&gt;.
Le lien hi&#233;rarchique entre l&#8217;amorce et les items est traduit par les niveaux d&#8217;imbrication des balises. Par exemple,
le patron ci-dessous rep&#232;re les objets balis&#233;s par &lt;className&gt; comme amorces de l&#8217;&#233;num&#233;ration, les objets ba-
lis&#233;s par &lt;description type=&quot;extensionalDefinition&quot;&gt; comme les items de la liste &#233;tant s&#233;par&#233;s par des caract&#232;res
d&#233;limiteurs. Au total, 228 &#233;num&#233;rations sont exploit&#233;es.
</p>
<p>4 R&#233;sultats et &#233;valuation qualitative
</p>
<p>L&#8217;&#233;valuation des ontologies en termes de performance est un probl&#232;me reconnu et d&#233;licat (Schutz &amp; Buitelaar,
2005). Dans l&#8217;id&#233;al, disposer d&#8217;une ontologie faisant r&#233;f&#233;rence permettrait de fournir une &#233;valuation quantitative
int&#233;ressante. Mais construire ce type d&#8217;ontologie n&#233;cessite un investissement humain co&#251;teux que nous n&#8217;avons
pas pu mettre en place.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PATRONS DE TEXTE POUR LA CONSTRUCTION D&#8217;ONTOLOGIES
</p>
<p>Nous avons proc&#233;d&#233; &#224; une &#233;valuation manuelle qualitative des concepts et des relations s&#233;mantiques extraits &#224;
l&#8217;issue de la deuxi&#232;me &#233;tape. Pour chaque fragment d&#8217;ontologie extrait 3, la pertinence de la relation et des concepts
X et Y renvoy&#233;s par nos modules a &#233;t&#233; &#233;valu&#233;e. Cinq valeurs sont propos&#233;es :
&#8211; la valeur est valide si la relation est jug&#233;e valide ainsi que les deux concepts X et Y reli&#233;s par cette relation,
&#8211; la valeur est inverse si la relation est valide mais est invers&#233;e (relations anti-sym&#233;triques comme l&#8217;hyperonymie
</p>
<p>et la m&#233;ronymie),
&#8211; la valeur est approximative lorsque la relation est valide mais les concepts sont approximatifs (concepts mal
</p>
<p>extrait, pr&#233;sence d&#8217;un pronom ou d&#8217;une situation de co-r&#233;f&#233;rence non resolue),
&#8211; la valeur est incertaine lorsqu&#8217;une expertise particuli&#232;re est requise (n&#233;cessit&#233; de recourir &#224; des experts en
</p>
<p>cartographie),
&#8211; la valeur est fausse quand la relation est erron&#233;e (dans ce cas, les concepts sont &#233;galement souvent non valides).
Les r&#233;sultats de cette &#233;valuation 4 sont indiqu&#233;s dans le tableau suivant. Ils mettent en avant de grandes disparit&#233;s
qualitatives selon les types de relations s&#233;mantiques.
</p>
<p>FIGURE 4 &#8211; Evaluation qualitative des fragments d&#8217;ontologie issus du traitement des titres et des d&#233;finition
</p>
<p>Si d&#8217;un point de vue linguistique, elles sont tout &#224; fait acceptables, les relations d&#8217;artefact et de fonction pr&#233;sentent
le plus fort pourcentage d&#8217;incertitude sur de la connaissance extraite, pour la t&#226;che vis&#233;e. Cette incertitude est li&#233;e
&#224; leur sp&#233;cificit&#233; pour le domaine et au recours n&#233;cessaire &#224; des experts g&#233;ographes pour leur validation effective.
La relation d&#8217;hyperonymie pr&#233;sente des r&#233;sultats acceptables o&#249; presque 70 % des fragments extraits sont corrects
ou approximatifs. (Maynard et al., 2009) constatent &#233;galement, sur leurs donn&#233;es, une situation de surg&#233;n&#233;ration
des patrons d&#8217;hyperonymie. Le traitement actuel de la synonymie n&#8217;est pas convainquant : exploiter la structure
et la syntaxe n&#8217;est pas suffisant pour distinguer l&#8217;hyperonymie de la synonymie. Sur ce point, (Malais&#233; et al.,
2005) constatent le m&#234;me ph&#233;nom&#232;ne qui semble donc aller au del&#224; du genre : &quot;The pattern &quot;N(N) introduced
&quot;hypernymic relation&quot;, as well as &quot;synonymic&quot; or &quot;meronymic&quot; ones [...]&quot;. En revanche, les r&#233;sultats concernant
la m&#233;ronymie et l&#8217;holonymie sont encourageants (moins de 20 % d&#8217;erreur).
</p>
<p>5 Bilan et Perspectives
</p>
<p>Partir des textes pour construire une ontologie n&#8217;est pas une t&#226;che triviale : la non lin&#233;arit&#233; des segments textuels
complexifie l&#8217;extraction de connaissances et leur mise en relation. Nous avons pr&#233;sent&#233; dans cet article une ap-
proche prenant en compte la combinaison d&#8217;informations lexicales, syntaxiques et structurelles dans des patrons.
La prise en compte de ces &#233;l&#233;ments discursifs s&#8217;av&#232;re productive et utile pour la construction et l&#8217;enrichissement
d&#8217;ontologie. Notre d&#233;marche se veut g&#233;n&#233;ralisable &#224; d&#8217;autres textes &#224; condition que leur mise en forme soit expli-
cite et structur&#233;e. Le domaine importe peu, c&#8217;est l&#8217;objectif taxonomique des informations dans les documents qui
doit &#234;tre privil&#233;gi&#233;.
</p>
<p>Cependant, un certain nombre de probl&#232;mes ne sont pas r&#233;solus, notamment &#224; cause de la complexit&#233; des liens de
sens entre les diff&#233;rents objets textuels. Par exemple, le fonctionnement par patron impose un ordre d&#8217;application
des r&#232;gles qui rend d&#233;licat le traitement de certains ph&#233;nom&#232;nes comme les anaphores et les pronominalisations,
ou encore la n&#233;gation. Sur ce dernier point, se pose la question de la gestion des informations n&#233;gatives dans une
ontologie. Par exemple, dans la d&#233;finition de l&#8217;objet r&#233;servoir (&#171; tous les r&#233;servoirs de plus de 10m de haut sont
inclus sauf : les r&#233;servoirs souterrains et les citernes qui sont exclus &#187;), comment les objets r&#233;servoirs souterrains
et citerne doivent-ils &#234;tre organis&#233;s ?
</p>
<p>3. Au total, 441 fragments ont &#233;t&#233; &#233;valu&#233;s : 6 pour la relation d&#8217;artefact, 63 pour la relation de fonction, 291 pour la relation d&#8217;hyperonymie,
48 pour la synonymie et enfin 33 pour la m&#233;ronymie/holonymie.
</p>
<p>4. Effectu&#233;e par Marion Laignelet, l&#8217;une des auteures de ce papier.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MARION LAIGNELET, MOUNA KAMEL, NATHALIE AUSSENAC-GILLES
</p>
<p>R&#233;f&#233;rences
</p>
<p>AUSSENAC-GILLES N. &amp; JACQUES M.-P. (2008). Designing end evaluating patterns for relation acquisition
from texts with cam&#233;l&#233;on. Terminology, 14(1), 45&#8211;73.
CARTIER E. (1998). Analyse automatique des textes : l&#8217;exemple des informations d&#233;finitoires. In Actes Ren-
contre Internationale sur l&#8217;Extraction, le Filtrage et le R&#233;sum&#233; Automatiques, p. 6&#8211;18, Sfax, Tunisie.
</p>
<p>CONDAMINES A. &amp; REBEYROLLES J. (2000). Recent Advances in Computational Terminology, chapter Sear-
ching for and identifying conceptual relationships via a Corpus-based approach to a Terminological Knowledge
Base (CTKB) : Method and Results, p. 127&#8211;148. M.-C. L&#8217;Homme and C. Jacquemin and D. Bourigault.
</p>
<p>ESCOUBASBENVENISTE M.-P. (2010). La d&#233;finition dans le texte &#233;conomique &#233;crit de vulgarisation savante.
In PUBLIFARUM, Ed., Autour de la d&#233;finition, volume 11.
</p>
<p>HEARST M. (1992). Automatic acquisition of hyponyms from large text corpora. In Proccedings of the 14th
International Conference on Computational Linguistics, p. 539&#8211;545.
</p>
<p>HO-DAC L.-M., JACQUES M.-P. &amp; REBEYROLLE J. (2004). Sur la fonction discursive des titres, In S. PO-
RHIEL &amp; K. D., Eds., L&#8217;unit&#233; texte, p. 125&#8211;152. Pleyben.
</p>
<p>KAMEL M. &amp; AUSSENAC-GILLES N. (2009). Utiliser la structure du document dans le processus de construc-
tion d&#8217;ontologies. In 8th Intern. Conference on Terminology and Artificial Inelligence TIA&#8217;09.
</p>
<p>KUSHMERICK N., WELD D. &amp; DOORENBOS B. (1997). Wrapper induction for information extraction. In Proc.
Int. Joint Conf. Artificial Intelligence.
</p>
<p>LUC C. &amp; VIRBEL J. (2001). Le mod&#232;le d&#8217;architecture textuelle : fondements et exp&#233;rimentation. Verbum,
XXIII(1), 104&#8211;123.
MAEDCHE A. (2002). Ontology learning for the Semantic Web, volume 665. Kluwer Academic Publishing.
</p>
<p>MALAIS&#201; V., ZWEIGENBAUM P. &amp; BACHIMONT B. (2005). Detecting semantic relations between terms in
definitions. Terminolgy, 11(1), pp. 21&#8211;53.
MAYNARD D., FUNK A. &amp; PETERS W. (2009). Using lexico-syntactic ontology design patterns for ontology
creation and population. In S. BLOMQVIST, Ed., Proc. of the WS on Ontology Patterns (WOP 2009), volume
516, Washington DC, USA.
</p>
<p>MEYER I. (2001). Recent Advances in Computational Terminology, chapter Extracting Knowledge-rich Contexts
for Terminography : A Conceptual and methodological Framework, p. 279&#8211;302. M.-C. L&#8217;Homme and C. Jac-
quemin and D. Bourigault.
</p>
<p>MONTIELPONSADA E., AGUADODECEA G. &amp; ALAREZDEMON I. (2009). From linguistic pattern to ontology
structures. In Inter. Conference on Terminology and Artificial Intelligence TIA&#8217;09.
</p>
<p>MORIN E. (1999). Acquisition de patrons lexico-syntaxiques caract&#233;ristiques d&#8217;une relation s&#233;mantique. Trai-
tement Automatique des Langues, 40(1), 143&#8211;166.
PASCUAL E. &amp; P&#201;RY-WOODLEY M.-P. (1997). Mod&#233;lisation des d&#233;finitions dans les textes &#224; consignes. In J.
VIRBEL, J.-M. CELLIER &amp; J.-L. NESPOULOUS, Eds., Cognition, discours proc&#233;dural, action. Atelier &quot;Texte
et Communication&#8221; PRESCOT.
</p>
<p>REBEYROLLES J., JACQUES M.-P. &amp; P&#201;RY-WOODLEY M.-P. (2009). Titres et intertitres dans l&#8217;organisation
du discours. Journal of French Language Studies, 19(2), 269&#8211;290.
REBEYROLLES J. &amp; TANGUY L. (2000). Rep&#233;rage automatique de structures linguistiques en corpus : le cas
des &#233;nonc&#233;s d&#233;finitoires. Cahiers de Grammaire, 25, 153&#8211;174.
ROLE F. &amp; ROUSSE G. (2006). Construction incr&#233;mentale d&#8217;une ountologie par analyse du texte et de la structure
du document. Document num&#233;rique, 9(1), 77&#8211;91.
SABOU M., D&#8217;AQUIN M. &amp; MOTTA E. (2008). Scarlet : Semantic relation discovery by harvesting online
ontologies. In European Semantic Web Symposium - Conference - ESWS, p. 854&#8211;858.
</p>
<p>SCHUTZ A. &amp; BUITELAAR P. (2005). Relext : A tool for relation extraction from text in ontology extension.
In SPRINGER, Ed., Proceedings of the 4th International Semantic Web Conference (ISWC), volume 3729, p.
593&#8211;606.</p>

</div></div>
</body></html>