<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>R&#232;gles et paradigmes en morphologie informatique lex&#233;matique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>R&#232;gles et paradigmes en morphologie informatique lex&#233;matique
</p>
<p>Nabil Hathout(1)   Fiammetta Namer(2)
</p>
<p>(1) UMR CLLE-ERSS, Toulouse
(2) UMR ATILF-Universit&#233; Nancy2, Nancy
</p>
<p>nabil.hathout@univ-tlse2.fr, fiammetta.namer@univ-nancy2.fr
</p>
<p>R&#233;sum&#233;.
</p>
<p>Les familles de mots produites par deux analyseurs morphologiques, D&#233;riF (bas&#233; sur des r&#232;gles) et Morphonette (bas&#233;  
sur l'analogie),  appliqu&#233;s &#224; un m&#234;me corpus lexical,  sont compar&#233;es.  Cette comparaison conduit &#224; l'examen de trois  
sous-ensembles :
</p>
<p>-  un sous-ensemble  commun aux deux syst&#232;mes  dont  la  taille  montre  que,  malgr&#233;  leurs  diff&#233;rences,  les  approches 
exp&#233;riment&#233;es par chaque syst&#232;me sont valides et d&#233;crivent en partie la m&#234;me r&#233;alit&#233; morphologique.
</p>
<p>-  un  sous-ensemble  propre  &#224;  D&#233;riF  et  un  autre  &#224;  Morphonette.  Ces  ensembles  (a)  nous  renseignent  sur  les  
caract&#233;ristiques propres &#224; chaque syst&#232;me, et  notamment sur ce que l'autre ne peut pas produire,  (b) ils  mettent en 
&#233;vidence les erreurs d&#8217;un syst&#232;me, en ce qu&#8217;elles n&#8217;apparaissent pas dans l&#8217;autre, (c) ils font appara&#238;tre certaines limites  
de  la  description,  notamment  celles  qui  sont  li&#233;es  aux  objets  et  aux  notions  th&#233;oriques  comme  les  familles 
morphologiques, les bases, l'existence de RCL &#171; transversales &#187; entre les lex&#232;mes qui n'ont pas de relation d'ascendance 
ou de descendance.
</p>
<p>Abstract.
</p>
<p>The word families produced by two morphological analyzers of French, D&#233;riF (rule-based) and Morphonette (analogy-
based), applied on the same lexical corpus have been compared. The comparison led us to examine three classes of  
relations:
</p>
<p>-  one  subset  of  relations  that  are  shared  by  both  systems.  It  shows  that,  despite  their  differences,  the  approaches  
implemented in these systems are valid and describe, to some extent, one and the same morphological reality.
</p>
<p>- one subset of relations specific to D&#233;riF and another one to Morphonette. These sets (a) give us informations on the  
characteristics proper to each system, and especially on what the other system is unable to produce; (b) they highlight  
the errors of one system, in so that they are absent from the results of the other; (c) they reveal some of the limits of the  
description, especially the ones related to theoretical objects and concepts such as morphological family, base or the 
existence of transverse LCR (lexeme construction rules) between lexemes that are not ascendant nor descendant of each  
other.
</p>
<p>Mots-cl&#233;s : morphologie constructionnelle ; analyse automatique ; r&#232;gles ; analogie ; familles 
morphologiques ; comparaison ; synergie
Keywords: Word formation ; automatic analysis ; rules ; analogy ; morphological families ; 
comparison ; synergy.
</p>
<p>1 Introduction
</p>
<p>Cet article pr&#233;sente une comparaison entre deux ressources morphologiques tr&#232;s diff&#233;rentes : l'analyseur D&#233;riF et le 
r&#233;seau morphologique Morphonette. D&#233;riF (Namer, 2009) est un analyseur qui impl&#233;mente des r&#232;gles de construction de  
lex&#232;mes (RCL) &#233;tablies et mises au point manuellement. Leur application est contr&#244;l&#233;e par un ensemble d'exceptions qui  
permettent  de  prendre  en  compte  efficacement  l'ensemble  des  irr&#233;gularit&#233;s  qui  se  sont  accumul&#233;es  au  cours  de  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Hathout et F. Namer
</p>
<p>l'&#233;volution du lexique. Les analyses produites par D&#233;riF indiquent pour chaque mot construit l'op&#233;ration qui a servi &#224; le  
construire et sa base ou ses &#233;l&#233;ments de composition.  Morphonette est  pour sa part  bas&#233; sur  un mod&#232;le relationnel  
paradigmatique du lexique (Hathout,  2009,  2011) dans lequel  les mots  sont  identifi&#233;s  par  leur  famille  et  leur  s&#233;rie  
morphologiques.  Ce  r&#233;seau  est  construit  de  fa&#231;on  totalement  automatique  en  utilisant  une  mesure  de  la  proximit&#233;  
morphologique, l'analogie et trois crit&#232;res qui permettent d'&#233;liminer les paradigmes et les relations les moins s&#251;res.
</p>
<p>Les deux syst&#232;mes sont compar&#233;s sur le m&#234;me corpus : le lexique flexionnel TLFnome1. Les analyses morphologiques 
produites par les deux syst&#232;mes ne sont pas de m&#234;me nature et ne peuvent &#234;tre compar&#233;s directement.  Notamment,  
Morphonette  ne  fournit  pas  de  relation  d&#233;rivationnelle  entre  les  lex&#232;mes,  mais  seulement  les  paradigmes  qui  les 
contiennent. En revanche, les analyses de D&#233;riF sont plus fines et permettent de reconstruire les familles et les s&#233;ries  
morphologiques  des  lex&#232;mes.  Ces  paradigmes  constituent  l'un  des  plans  de  comparaison  possible  pour  les  deux  
syst&#232;mes. Cette comparaison fait clairement appara&#238;tre leurs diff&#233;rences tant d'un point de vue qualitatif que quantitatif  
(cf &#167;2 vs &#167;3). Dans ce premier travail, nous avons limit&#233; la comparaison &#224; un seul type de paradigmes  : les familles 
morphologiques (&#167;4).  Les s&#233;ries  morphologiques seront  trait&#233;es  ult&#233;rieurement.  Les familles  sont  d&#233;crites  de  fa&#231;on  
explicite  dans  Morphonette.  En  revanche,  il  faut  les  reconstruire  &#224;  partir  des  r&#233;sultats  de  D&#233;riF  en  r&#233;alisant  une  
fermeture transitive des relations de d&#233;rivation et de composition en prenant garde &#224; ne pas connecter les compos&#233;s qui  
ne  partagent  aucun &#233;l&#233;ment  de  composition  (&#167;4.1).  La comparaison  des  familles  ainsi  extraites  des  deux syst&#232;mes  
conduit &#224; l'obtention de trois sous-ensembles, d&#233;crits quantitativement (&#167;4.2) et qualitativement (&#167;.4.3) : il s'agit d'un 
sous-ensemble commun, d'un sous-ensemble propre &#224; D&#233;riF et d'un autre propre &#224; Morphonette.
</p>
<p>Les objectifs de ce travail sont multiples : identifier les convergences qui existent entre les deux syst&#232;mes ; analyser les 
r&#233;sultats pour identifier les compromis qui ont &#233;t&#233; r&#233;alis&#233;s dans chaque syst&#232;me et les hypoth&#232;ses et g&#233;n&#233;ralisations sur  
lesquels ils s'appuient ; mettre en &#233;vidence certaines am&#233;liorations dont les syst&#232;mes pourrait profiter mutuellement l'un  
de l'autre ; viser une convergence plus forte ; faire ressortir des questions linguistiques qui n'&#233;mergent que gr&#226;ce &#224; la 
comparaison des syst&#232;mes.
</p>
<p>2 D&#233;riF
</p>
<p>D&#233;riF s&#8217;applique &#224; des mots consid&#233;r&#233;s hors-contexte (non fl&#233;chis). Il met en jeu des r&#232;gles &#233;tablies suivant des crit&#232;res  
linguistiques : l&#8217;analyse propos&#233;e permet de r&#233;unir les ascendants du mot, et la relation qu&#8217;entretient chaque mot avec  
son ou ses ascendants imm&#233;diats : sa base dans le cas d'une conversion ou d'une affixation, ses composants dans le cas 
d'une composition (1). 
L&#8217;analyse est donc tendanciellement orient&#233;e. En cas de d&#233;rivation r&#233;cursive (Spencer, 1988 ; Becker, 1993) comme en 
(2), le syst&#232;me d&#233;cide de la solution la plus motiv&#233;e linguistiquement : la base d&#233;senneiger est pr&#233;f&#233;r&#233;e &#224; enneigement. 
Si plusieurs analyses sont possibles (du fait de l'existence de plusieurs interpr&#233;tations) toutes les solutions sont fournies  
(cf 3a  vs 3b). La logique du syst&#232;me de r&#232;gles a pour vocation de pr&#233;dire le sens morphologiquement construit des 
n&#233;ologismes. Pour cela, les hypoth&#232;ses formul&#233;es vont de la situation la plus particuli&#232;re au cas par d&#233;faut  : celui-ci est 
cens&#233; refl&#233;ter la production n&#233;ologique, illustr&#233;e sous (4) par l'analyse d'un nom inexistant mais possible.
&#201;tant donn&#233; la lexicalisation, l'opacification d&#8217;un certain nombre d&#8217;&#233;l&#233;ments du lexique attest&#233; (stock&#233;s de longue date),  
l&#8217;application des r&#232;gles est soumise &#224; l&#8217;examen du contenu de listes d&#8217;exceptions. Par exemple, l'inscription de pension 
parmi les exceptions &#233;vite au syst&#232;me de l'analyser comme d&#233;verbal de penser (5a), sur le mod&#232;le de pression, d&#233;riv&#233; de 
presser (5b).
(1) enneigement/NOM : (enneigement/NOM, enneiger/VERBE, neige/NOM)
(2) d&#233;senneigement/NOM : (d&#233;senneigement/NOM, d&#233;senneiger/VERBE, enneiger/VERBE, neige/NOM)
(3) r&#233;enneigement/NOM :
</p>
<p>a. (r&#233;enneigement/NOM, enneigement/NOM, enneiger/VERBE, neige/NOM)
b. (r&#233;enneigement/NOM, r&#233;enneiger/VERBE, enneiger/VERBE, neige/NOM)
</p>
<p>(4) a. reschtroumpfement/NOM : &#171; schtroumpfement r&#233;it&#233;r&#233; &#187;
b. reschtroumpfement/NOM : &#171; (Action - r&#233;sultat de l'action) de reschtroumpfer &#187;
</p>
<p>(5) a. pression/NOM : (pression/NOM, presser/VERBE)
b. pension/NOM : (pension/NOM)
</p>
<p>Les informations qui annotent les mots analys&#233;s b&#233;n&#233;ficient des caract&#233;ristiques de D&#233;riF : &#233;tant donn&#233; que le principe 
fondamental est le fruit de l&#8217;information linguistique, il est possible de produire ( i) la paraphrase par laquelle se d&#233;finit 
le mot par rapport &#224; sa base (6) et (ii) les traits traduisant les contraintes impos&#233;es par chaque RCL (7).  Les autres 
</p>
<p>1 Ce lexique a &#233;t&#233; construit &#224; partir de la nomenclature du TLF. Il correspond &#224; la version 1.0 de Morphalou disponible sur le site  
du CNRTL (www.cnrtl.fr/lexiques/morphalou/).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#232;gles et paradigmes en morphologie informatique lex&#233;matique
</p>
<p>r&#233;sultats (p. ex. la liste des ascendants successifs du mot analys&#233;, reli&#233;s chacun &#224; une RCL, comme l'exemple sous (1))  
sont repr&#233;sent&#233;s sous la forme de listes.
</p>
<p>(6) chanteur/NOM : &#171;  (Agent habituel - Auteur exceptionnel - Instrument) de chanter &#187;
(7) a. chanter/VERBE: [ aspect = dynamique, sous_cat = &lt;NPagent, ...&gt; ]
</p>
<p>b. chanteur/NOM: [ concret = oui, comptable = oui]
</p>
<p>3 Morphonette
</p>
<p>Morphonette  est  un  r&#233;seau  lexical  du  fran&#231;ais  bas&#233;  sur  une  conception  relationnelle  et  paradigmatique  de  la  
morphologie. Dans ce lexique, les propri&#233;t&#233;s morphologiques sont d&#233;crites par la position des lex&#232;mes dans le r&#233;seau,  
positions identifi&#233;es par  les paradigmes qui les contiennent.  Par  exemple, la position d'un d&#233;riv&#233; comme  modifiable 
peut  &#234;tre  minimalement  d&#233;crite  par  sa  famille  morphologique  qui  rassemble  les  lex&#232;mes  modifier,  modification, 
modificateur, modificatif, modifiant, modifieur, immodifiable, etc. et par sa s&#233;rie qui contient l'ensemble des d&#233;riv&#233;s en 
-able : aga&#231;able, agitable, chevauchable, d&#233;finissable, diff&#233;renciable, rechargeable, r&#233;conciliable, soutenable, etc. 
</p>
<p>Dans sa version actuelle, Morphonette est construit &#224; partir de TLFnome (Hathout, 2010), qui est &#233;galement le lexique 
de test et de r&#233;f&#233;rence de D&#233;riF. Il est compos&#233; de filaments, c'est-&#224;-dire de triplets (m,p,sp(m)) o&#249; m est une entr&#233;e, p, 
un membre de la famille morphologique de  m et sp(m) la sous-s&#233;rie morphologique de  m relativement &#224;  p. sp(m) est 
l'ensemble des mots du lexique qui se trouvent dans une relation similaire &#224; celle que m entretient avec p. En d'autres 
termes,  u &#8712; sp(m) s'il existe  v tel que  m:p=u:v (i.e.  tels que  m,  p,  u,  v forment une analogie). Par exemple, l'un des 
filaments de modifiable dans Morphonette est :
</p>
<p>(8) (modifiable,  modificateur,{amplifiable,  glorifiable,  identifiable,  justifiable,  clarifiable,  mystifiable,  rectifiable, 
sanctifiable, simplifiable, sp&#233;cifiable, unifiable, v&#233;rifiable})
</p>
<p>Dans ce lexique chaque entr&#233;e a autant de filaments que de membres dans sa famille. Si certains filaments se recouvrent  
en grande partie et devront &#224; termes &#234;tre fusionn&#233;s, d'autres d&#233;crivent des propri&#233;t&#233;s diff&#233;rentes d'un m&#234;me mot. Par  
exemple, gazouillard a dans sa famille le nom gazouillarde (9a) et le verbe gazouiller (9b). Sa sous-s&#233;rie relativement 
au verbe est pr&#233;sent&#233;e en (9b). Elle contient des d&#233;riv&#233;s comme bafouillard ou vasouillard qui peuvent &#234;tre rattach&#233;s 
aux verbes bafouiller ou vasouiller. En revanche sa sous-s&#233;rie relative au nom f&#233;minin  gazouillarde (9a) contient en 
plus les noms pour lesquels il existe un f&#233;minin en /aRd/ comme gaillard, montagnard, trouillard ou savoyard mais pas 
de verbe correspondant. On a ainsi pour ce mot des sous-s&#233;ries distinctes, l'une correspondant &#224; la propri&#233;t&#233; d'&#234;tre un  
nom d&#233;verbal et l'autre &#224; celle d'&#234;tre associ&#233;e &#224; un f&#233;minin en /aRd/.
</p>
<p>(9) a. (gazouillard,  gazouillarde,  {babillard,  becquillard,  b&#233;quillard,  braillard,  douillard,  &#233;grillard,  fripouillard, 
gaillard,  grenouillard,  grognard,  justiciard,  montagnard,  pr&#233;tentiard,  savoyard,  citrouillard,  trouillard, 
vadrouillard, vasouillard})
b. (gazouillard,  gazouiller,  {bafouillard,  douillard,  grenouillard,  citrouillard,  vadrouillard,  vasouillard, 
ventrouillard})
</p>
<p>La construction de Morphonette vise ainsi &#224; d&#233;couvrir certaines des relations morphologiques entre les mots du lexique 
de d&#233;part. Leur identification est r&#233;alis&#233;e par &#233;tapes en r&#233;duisant successivement l'espace de recherche des membres de 
la famille et de la s&#233;rie de chaque mot. Ces &#233;tapes sont :
</p>
<p>(a) la s&#233;lection pour chaque entr&#233;e d'un voisinage constitu&#233; des 100 mots qui sont morphologiquement les plus proches 
de l'entr&#233;e.  Ces voisinages sont d&#233;finis par  une mesure qui rapproche les mots qui partagent  le plus grand nombre  
possible de propri&#233;t&#233;s formelles (n-grammes de lettres ou de phon&#232;mes) les plus sp&#233;cifiques possible (Hathout, 2009). 
La mesure est calcul&#233;e au moyen d'un algorithme de propagation d'activation inspir&#233; des travaux de Gaume (2004).  
Cette mesure est diff&#233;rente de la distance d'&#233;dition de Levenshtein. 
</p>
<p>(b) la d&#233;couverte de l'ensemble des analogies formelles qui s'&#233;tablissent entre les entr&#233;es et les mots de leurs voisinages 
(Lepage, 1998; Stroppa et Yvon, 2006). Afin de r&#233;duire la complexit&#233; de cette exploration, ces analogies sont identifi&#233;es 
sur la base de signatures d'&#233;dition (s&#233;quence d'op&#233;rations d'&#233;dition) calcul&#233;es pour chaque couple (m,  v) o&#249; m est une 
entr&#233;e et v un de ses voisins. Les couples qui partagent les m&#234;mes signatures forment des analogies (Hathout, 2009).
</p>
<p>(c) l'utilisation de trois crit&#232;res pour s&#233;parer les familles des s&#233;ries et pour s&#233;lectionner les paradigmes qui comportent le  
moins d'erreurs possible. Le premier est un crit&#232;re cat&#233;goriel qui permet de s&#233;parer les relations familiales des relations  
s&#233;rielles pour les analogies dont les 4 &#233;l&#233;ments ne sont pas de la m&#234;me cat&#233;gorie. Le deuxi&#232;me est un crit&#232;re portant sur  
la taille des sous-s&#233;ries : deux mots qui appartiennent &#224; la m&#234;me famille morphologique participent normalement &#224; un  
nombre &#233;lev&#233; d'analogies. On &#233;limine par cons&#233;quent les filaments dont la sous-s&#233;rie contient  moins de 10 mots. Le 
troisi&#232;me crit&#232;re porte sur le degr&#233; d'agr&#233;gation des sous-s&#233;ries (Watts et Strogatz, 1998) : les &#233;l&#233;ments qui se trouvent 
dans l'une des sous-s&#233;ries d'un mot donn&#233; ont tendance &#224; appara&#238;tre ensemble dans une des autres sous-s&#233;ries du r&#233;seau.  
On calcule donc pour chaque &#233;l&#233;ment de chaque sous-s&#233;rie un taux d'agr&#233;gation (rapport entre le nombre de triangles et  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Hathout et F. Namer
</p>
<p>le nombre de triples qui contiennent  cet &#233;l&#233;ment et les autres membres de la sous-s&#233;rie) et on &#233;limine ceux dont le 
niveau d'agr&#233;gation est inf&#233;rieur &#224; 0,66.
</p>
<p>Les crit&#232;res utilis&#233;s, ajout&#233;s aux restrictions impos&#233;es lors des deux premi&#232;res &#233;tapes, permettent de disposer d'un r&#233;seau 
tr&#232;s fiable mais, en contre partie, relativement petit.
</p>
<p>4 Comparaison
</p>
<p>4.1 Formatage des r&#233;sultats
</p>
<p>La comparaison de D&#233;riF et de Morphonette est r&#233;alis&#233;e dans un premier temps sur les familles morphologiques. Nous  
envisageons  de  l'&#233;tendre  dans  un  second  temps  aux  s&#233;ries.  Dans  Morphonette,  la  famille  d'un  lex&#232;me  peut  &#234;tre  
directement  r&#233;cup&#233;r&#233;e  de  la  liste  de  ses  filaments.  Dans  le  cas  de  D&#233;riF,  seules  les  relations  entre  un  mot  et  ses  
ascendants sont indiqu&#233;es. Nous avons donc reconstruit des familles en ajoutant des relations transversales entre les  
descendants  de  chaque  mot.  Pour  les  affixations  et  les  conversions,  ces  relations  sont  obtenues  en  calculant  leurs  
fermetures  sym&#233;triques  et  transitives.  En  revanche,  pour  les  compositions,  les  relations  transversales  doivent  &#234;tre  
limit&#233;es aux seuls descendants de chaque lex&#232;me. A l'heure actuelle, les chiffres pr&#233;sent&#233;s ci-dessous n'incluent pas les  
descendants de composants qui ne sont pas des lex&#232;mes, et notamment des formants n&#233;oclassiques (par exemple, la  
relation  qu'entretient  dans  D&#233;riF  h&#233;patique/A et  h&#233;pat/N*=foie n'est  pas  comptabilis&#233;e  ici).  9 582  entr&#233;es  sont 
concern&#233;es par cette restriction.
</p>
<p>4.2 R&#233;sultats quantitatifs
</p>
<p>La comparaison des  deux syst&#232;mes porte sur  les  96 456 entr&#233;es  de TLFnome de cat&#233;gories  nom, verbe,  adjectif  et 
adverbe. Le tableau de gauche ci-dessous donne le nombre d'interpr&#233;tations calcul&#233;es par D&#233;riF pour les entr&#233;es de  
TLFnome. Celui de droite fournit quelques statistiques sur Morphonette. Les diff&#233;rences entre ces tableaux refl&#232;tent  
bien celles qui existent entre les structures des r&#233;sultats que produisent les deux syst&#232;mes.
</p>
<p>D&#233;riF                 Morphonette
Nb interpr&#233;tations 0 1 plusieurs total Entr&#233;es Relations familiales Relations s&#233;rielles
Effectif 60 882 34 722 853 96 456 29 310 96 107 1 160 098
</p>
<p>Nous avons extrait pour chaque entr&#233;e analys&#233;e par D&#233;riF l'ensemble des relations qu'elle a avec ses ascendants (par 
exemple  harmonie et  harmoniser pour  harmonisation).  Ces  relations  sont  ensuite  compl&#233;t&#233;es  par  des  relations 
transversales entre tous les descendants de l'entr&#233;e. On obtient ainsi apr&#232;s sym&#233;trisation 269 710 couples de mots qui 
appartiennent &#224; la m&#234;me famille. Ces couples ont &#233;t&#233; compar&#233;es aux 96 107 relations familiales qui se trouvent dans 
Morphonette. Le tableau suivant pr&#233;sente cette comparaison des relations familiales d'un point de vue quantitatif (D 
repr&#233;sente l'ensemble de celles dans D&#233;riF et M de celles de Morphonette). La taille de l'intersection montre que, malgr&#233; 
leurs diff&#233;rences importantes, les approches exp&#233;riment&#233;es par chaque syst&#232;me sont valides et d&#233;crivent en partie la 
m&#234;me r&#233;alit&#233; morphologique.
</p>
<p>Relations familiales D M D &#8745; M D \ M M \ D
Effectif 269 710 96 107 26 061 189 849 70 046
</p>
<p>4.3 Comparaison qualitative
</p>
<p>L'examen du contenu des trois sous-ensembles nous donne un certain nombre de renseignements sur la qualit&#233;s des 
analyses de chaque syst&#232;me. En particulier,  les sous-ensembles propres &#224; chaque analyseur d&#233;noncent autant ce qui  
manque &#224; l'autre que ce que lui-m&#234;me doit am&#233;liorer. Tout d'abord, le sous-ensemble propre &#224; Morphonette permet de  
d&#233;gager trois grands types de r&#233;sultats, expos&#233;s ci-dessous. 
</p>
<p>D&#233;riF  ne  retrouve  pas  les  ascendants  indirects  (pr&#233;dateur/N,  pr&#233;dation/N)  s&#8217;ils  n&#8217;ont  pas  d'anc&#234;tre  commun : 
&#176;pr&#233;dater/V n'est  pas  attest&#233;  (sur  la  morphologie  paradigmatique,  voir  p.  ex.  Booij,  1997,  2008).  D&#233;riF  est  aussi  
totalement muet en ce qui concerne certaines RCL, ce dont Morphonette sert de r&#233;v&#233;lateur (p. ex. les noms en -euse ou 
les adjectifs en -ant, cf. Anscombre (2000))</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#232;gles et paradigmes en morphologie informatique lex&#233;matique
</p>
<p>Morphonette  r&#233;unit  des  unit&#233;s  de  composition  n&#233;oclassique  qui  partagent  le  composant  d&#233;termin&#233;  (zoophage/N,  
anthropophage/N) ou d&#233;terminant  (zoographe/N,  zoophage/N),  alors  que D&#233;riF ne relie  les compos&#233;s que lorsqu'ils 
mettent en jeu le m&#234;me composant d&#233;termin&#233; (zoographe/N, biographe/N), ou deux composants d&#233;termin&#233;s entretenant 
une  relation  lexicale  sp&#233;cifique :  p.  ex.  synonymie  (zoovore/N,  zoophage/N) ;  sur  la  composition  dite  savante  ou 
n&#233;oclassique en fran&#231;ais, cf. (Dal, 2008), sur son analyse automatique, cf. (Namer, 2007).
Morphonette produit  des  r&#233;sultats instanciant des cas d'analogie formelle s&#233;mantiquement  non valides.  Les familles  
directes calcul&#233;es par  D&#233;riF sont l'un des moyens de d&#233;tecter ces fausses analogies.  Prenons par exemple le couple  
(brasserie/N,  brassi&#232;re/N). Il a &#233;t&#233; forg&#233; sur le m&#234;me mod&#232;le que (poissonnerie/N,  poissonni&#232;re/N). Or l'&#233;quivalence 
formelle  de  (brasserie/N,  brassi&#232;re/N) avec (poissonnerie/N,  poissonni&#232;re/N) est  invalid&#233;e  par  l'absence  d'analogie 
s&#233;mantique  entre  ces  deux  couples,  absence  qui  peut-&#234;tre  identifi&#233;e  automatiquement  par  l'examen  des  familles  
d'ascendants directs de ces quatre noms, calcul&#233;e par D&#233;riF. En effet, dans la paire (poissonnerie/N, poissonni&#232;re/N) les 
familles en jeu pour chaque &#233;l&#233;ment sont (poissonnerie/N, poissonnier/N, poisson/N) et (poissonni&#232;re/N, poissonnier/N, 
poisson/N)  .  Ces deux familles  constituent  une  structure  de la  forme  (XerieN,  XierN,  XN)  et  (Xi&#232;reN,  XierN,  XN) o&#249; 
l'anc&#234;tre commun X est le nom poisson. Cette m&#234;me structure se retrouve avec p. ex. (chocolaterie/N, chocolati&#232;re/N), 
(fauconnerie/N,  fauconni&#232;re/N),  (laiterie/N,  laiti&#232;re/N).  Ces  couples  sont  donc  en  relation  d'analogie  formelle  et 
d'identit&#233;  structurelle  familiale.  En  revanche,  les  familles  directes  associ&#233;es  &#224;  brasserie/N et  brassi&#232;re/N sont 
(brasserie/N, brasser/V, bras/N) et (brassi&#232;re/N, bras/N). Leur structure est doublement diff&#233;rente : la premi&#232;re famille 
fait intervenir un verbe (brasser/V) et la seconde ne comporte que deux membres : (brassi&#232;re/N, bras/N). 
Les couples qui n'apparaissent que dans D&#233;riF peuvent &#234;tre r&#233;partis en plusieurs groupes. Le premier contient 14  572 
couples qui se trouvent dans une relation de conversion nom-adjectif ou adjectif-nom : les filaments dont l'entr&#233;e et le 
membre de la famille ont la m&#234;me forme ont &#233;t&#233; en effet supprim&#233;s de Morphonette. Le second groupe est celui des  
mots pr&#233;fix&#233;s. Ces derniers sont &#233;limin&#233;s de Morphonette par les trois crit&#232;res (cf. &#167;3). La comparaison met ainsi en  
&#233;vidence  l'une  des  lacunes  principales  de  ce  r&#233;seau.  Les  raisons  de  l'absence  de  pr&#233;fixation  dans  les  filaments  de  
Morphonette d&#233;coule : (1) de la tendance de ces relations &#224; &#234;tre isocat&#233;gorielles, (2) du fait du nombre plus faible de 
d&#233;riv&#233;s pr&#233;fix&#233;s que de d&#233;riv&#233;s suffix&#233;s et (3) du fait de la forte dispersion des relations transversales que les pr&#233;fix&#233;s  
entretiennent  avec  les  membres  plus  distants  de  leurs  familles.  Sont  &#233;galement  absentes  de  Morphonette  les  
allomorphies comme dans les couples (abr&#233;geable/A,  abr&#233;ger/V) qui se trouvent &#233;limin&#233;s lors de la deuxi&#232;me &#233;tape, du 
fait du nombre r&#233;duit de couples qui comportent cette variation. Signalons &#233;galement qu'un petit nombre de couples, qui 
ne sont pr&#233;sents que dans D&#233;riF, sont des erreurs comme (l&#233;guer/V,  l&#233;gion/N) ou (lecteur/N,  lion/N) qui ne sont pas 
morphologiquement apparent&#233;s en synchronie.
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; un ensemble de r&#233;sultats encore exploratoires issus d'une comparaison de deux syst&#232;mes d'analyse 
morphologique, appliqu&#233;s au m&#234;me ensemble de donn&#233;es. Nous avons vu que la pr&#233;sence d'un &#233;l&#233;ment, aussi bien que  
son absence, dans un sous-ensemble propre &#224; un syst&#232;me renseigne sur son propre bruit, autant que sur le silence de  
l'autre  syst&#232;me.  &#201;galement,  la  comparaison  permet  de  rapprocher  des  heuristiques  apparemment  tr&#232;s  diff&#233;rentes : 
notamment,  les  listes  d'exception  de  D&#233;riF  constituent  la  formulation  linguistique  &#224;  laquelle  correspond  le  taux 
d&#8217;agr&#233;gation de Morphonette. Outre les conclusions pr&#233;visibles concernant le positionnement de chaque syst&#232;me par 
rapport  &#224;  l'autre,  suivant  diff&#233;rents  crit&#232;res  habituellement  utilis&#233;s  en  TAL  (robustesse,  bruit,  silence,  quantit&#233;  
d'information produite, etc.), cette confrontation aboutit &#224; deux types de r&#233;sultats remarquables, en terme de &#171;  retours &#187; 
sur les hypoth&#232;ses th&#233;oriques fondatrices des deux syst&#232;mes :
</p>
<p>&#8211; D'un point de vue &#233;pist&#233;mologique, l'existence d'une intersection de r&#233;sultats communs &#224; D&#233;riF et &#224; Morphonette  
couvrant  10% des  analyses,  d&#233;montre  que  deux  th&#233;ories  aussi  &#224;  l'oppos&#233;e  l'une  de  l'autre  que  sont  le  courant 
morphologique &#224; base de r&#232;gles orient&#233;es, et l'approche paradigmatique, fond&#233;e sur l'analogie permettent d'aboutir 
pour une partie de leurs r&#233;sultats &#224; des conclusions convergentes. En outre, les r&#233;sultats compl&#233;mentaires &#224; cette  
intersection sont tout aussi pr&#233;cieux que l'est le contenu de celle-ci. En effet, une fois notre syst&#232;me perfectionn&#233;,  
nous pouvons raisonnablement nous attendre &#224; ce que ces r&#233;sultats propre &#224; l'un ou l'autre syst&#232;me constituent une  
d&#233;monstration  empirique  des  limites  de  l'autre  approche :  ni  la  m&#233;thode  &#224;  base  de  r&#232;gles,  ni  celle  fond&#233;e  sur 
l'analogie ne peut se passer de l'autre. 
</p>
<p>&#8211; D'un point de vue de la validit&#233; m&#234;me des hypoth&#232;ses th&#233;oriques, les r&#233;sultats erron&#233;es fournis par Morphonette et 
absents de D&#233;riF r&#233;v&#232;lent des crit&#232;res permettant d'affiner les principes du raisonnement analogique qui associe une  
unit&#233; x1 &#224; une unit&#233; x2 sur le mod&#232;le formel observable entre y1 et y2 : pour v&#233;rifier que la relation s&#233;mantique entre x1 
et x2 est elle aussi analogue &#224; celle qui relie y1 &#224; y2, on se sert de la structure des familles directes de x1, x2, y1 et y2. A 
l'analogie  des formes,  les  r&#233;sultats  obtenus automatiquement  permettent  d'associer  l'analogie des  familles,  pour 
aboutir  finalement  &#224;  des  projections  en  terme  d'analogie  s&#233;mantique.  En  retour,  de  ces  nouvelles  associations 
analogiques on peut d&#233;river de nouvelles r&#232;gles morphologiques, : &#224; l'image du sch&#233;ma XeurN / XionN illustr&#233; au </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Hathout et F. Namer
</p>
<p>&#167;.4.2, ces nouvelles r&#232;gles vont alors alimenter le syst&#232;me constructionnel existant sous forme de relations le plus 
souvent non orient&#233;es et/ou non binaires.  
</p>
<p>Finalement, ces premiers r&#233;sultats laissent &#224; penser que les am&#233;liorations futures de D&#233;riF et Morphonette vont conduire  
&#224; un accroissement de leur intersection et donc &#224; une convergence de plus en plus importante, au fur et &#224; mesure que  
chaque syst&#232;me aura effectu&#233; les ajustements n&#233;cessaires dict&#233;s par l'autre. A terme, nous serons en mesure d'offrir aux 
utilisateurs un lexique qui cumule les qualit&#233;s de chacun des deux syst&#232;mes, et donc des deux raisonnements th&#233;oriques  
sous-jacents, tout en &#233;vitant leurs inconv&#233;nients respectifs. 
Ce lexique va &#234;tre con&#231;u sous la forme d'un r&#233;seau et dont les arcs seront valu&#233;s par les relations s&#233;mantiques (&#224; partir  
des pseudo-d&#233;finitions des mots analys&#233;s engendr&#233;es par D&#233;riF, cf. &#167;.2).  En ce qui concerne les relations indirectes  
valides,  p.  ex.  (poissonnerie/N,  poissonni&#232;re/N)  ou  (pr&#233;dateur/N,  pr&#233;dation/N),  elles  seront  int&#233;gr&#233;es  au  r&#233;seau,  en 
fonction de leur fr&#233;quence, avec leur sens construit indirectement, de mani&#232;re &#224; compl&#233;ter le r&#233;seau par des arcs tiss&#233;s et  
annot&#233;s entre des &#233;l&#233;ments d'une m&#234;me famille lexicale, qui ne sont pas en relation d'ascendance directe.
</p>
<p>R&#233;f&#233;rences
</p>
<p>Anscombre, Jean-Claude. 2000. Un probl&#232;me de s&#233;mantique lexicale: l'interpr&#233;tation active/passive des adjectifs 
verbaux participes en position d'&#233;pith&#232;te. In Le passif - Etudes Romanes 45, ed. Lene Sch&#339;ster, 237-260. 
Copenhagen: Universit&#233; de Copenhagen.
</p>
<p>Becker, Thomas. 1993. Back-formation, cross-formation, and 'bracketing paradoxes' in paradigmatic morphology. 
Yearbook of Morphology 1992:1-27.
</p>
<p>Booij, Geert. 1997. Autonomous morphology and paradigmatic relations Yearbook of Morphology 1996:35-53.
Booij, Geert. 2008. Paradigmatic Morphology. In La raison morphologique. Hommage &#224; la m&#233;moire de Danielle  
</p>
<p>Corbin, ed. Bernard Fradin, 29-38. Amsterdam / Philadelphia: John Benjamins.
Dal, Georgette. 2008. L'analogie dans le domaine du lexique construit : un retour ? 1er Congr&#232;s Mondial de  
</p>
<p>Linguistique Fran&#231;aise, Paris:1575-1587.
</p>
<p>Gaume, Bruno. 2004. Balades al&#233;atoires dans les Petits Mondes Lexicaux. I3. Information - Interaction - Intelligence, 
4(2). 
</p>
<p>Hathout, Nabil. 2009. Acquisition of morphological families and derivational series from a machine readable dictionary. 
In Fabio Montermini, Gilles Boy&#233; et Jesse Tseng, &#233;d., Selected Proceedings of the 6th D&#233;cembrettes:  
Morphology in Bordeaux, Somerville, Mass. : Cascadilla Proceedings Project.
</p>
<p>Hathout, Nabil. 2010. Morphonette: a morphological network of French. Pr&#233;print. http://hal.archives-ouvertes.fr/hal-
00485503/PDF/morphonette-en.pdf
</p>
<p>Hathout, Nabil. 2011. Une approche topologique de la construction des mots : propositions th&#233;oriques et application &#224; la 
pr&#233;fixation en anti-, In Michel Roch&#233;, Gilles Boy&#233;, Nabil Hathout, St&#233;panie Lignon et Marc Pl&#233;nat, Des unit&#233;s  
morphologiques au lexique, pp. 251&#8211;318. Hermes Science-Lavoisier : Paris. 
</p>
<p>Lepage, Yves. 1998. Solving analogies on words: An algorithm. In Proceedings of the 36th Annual Meeting of the  
Association for Computational Linguistics and of the 17th International Conference on Computational  
Linguistics, volume 2, pp. 728&#8211;735, Montr&#233;al. 
</p>
<p>Namer, Fiammetta. 2007. Morphos&#233;mantique pour l'appariement de termes dans le vocabulaire m&#233;dical : approche 
multilingue. Traitement Automatique des Langues 46:157-181.
</p>
<p>Namer, Fiammetta. 2009. Morphologie, Lexique et TAL : l'analyseur D&#233;riF: TIC et Sciences cognitives. London: 
Hermes Sciences Publishing.
</p>
<p>Spencer, Andrew. 1988. Bracketing paradox and the English Lexicon. Language 64:663-682.
</p>
<p>Stroppa, Nicolas et Fran&#231;ois Yvon. 2006. Du quatri&#232;me de proportion comme principe inductif : une proposition et son 
application &#224; l&#8217;apprentissage de la morphologie. Traitement automatique des langues, 47(2):33-59. 
</p>
<p>Watts, Duncan J. et Steven H. Strogatz. 1998. Collective dynamics of `small-world' networks. Nature, 393:440&#8211;442. </p>

</div></div>
</body></html>