<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Libellex : une plateforme multiservices pour la gestion des contenus multilingues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>Libellex : une plateforme multiservices pour la gestion des contenus multilingues
</p>
<p>Fran&#231;ois Brown de Colstoun1, Estelle Delpech1,2, &#201;tienne Monneret1
</p>
<p>(1)  LINGUA ET MACHINA, Laval Technopole, 6 rue L&#233;onard de Vinci, 53001 Laval Cedex
 et c/o Inria, Rocquencourt BP 105, 78 153 Le Chesnay Cedex
</p>
<p>(2) LINA FRE CNRS 2729, 2 rue de la Houssini&#232;re BP 92208, 44322 Nantes Cedex 3
fbc(a)lingua-et-machina.com, ed(a)lingua-et-machina.com, em(a)lingua-et-machina.com
</p>
<p>Cette d&#233;monstration industrielle pr&#233;sente Libellex, un prototype de plateforme multiservices pour la gestion des contenus 
multilingues. Cette plateforme vise &#224; la fois des professionnels de la langue (traducteurs, terminologues) et un public plus 
g&#233;n&#233;ral amen&#233; &#224; communiquer en langue &#233;trang&#232;re dans un contexte professionnel. Libellex assiste ces utilisateurs dans la 
production, la compr&#233;hension et la traduction de documents dans des langues ou des domaines qu'ils ma&#238;trisent bien, 
imparfaitement ou pas du tout. Pour cela, Libellex propose une palette de services exploitant une base de connaissances 
linguistiques  constitu&#233;e  automatiquement  &#224;  partir  de  textes  fournis  par  l'utilisateur.  Ces  services  vont  de  la  simple  
recherche  d'expression  &#224;  la  pr&#233;-traduction  et  la  constitution  automatique  de  terminologies  bilingues.  Le  processus 
d'extraction de connaissances linguistiques s'appuie sur des algorithmes issus des recherches en traduction automatique 
(Gale et Church 1993 ; Lardilleux, 2010), traduction assist&#233;e par ordinateur (Planas, 200), terminologie computationnelle 
(Bourigault, 1994) et exploitation des corpus comparables (Fung, 1997 ; Morin et Daille, 2009).
</p>
<p>Remerciements
</p>
<p>Libellex a &#233;t&#233; en partie financ&#233; par l'ANR (subvention no. ANR-08-CORD-009) et par Os&#233;o (subvention no. A1010034Z). 
Nous remercions &#233;galement Guillaume Pelluau et Mika&#235;l Morardo pour leur participation au d&#233;veloppement de Libellex.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOURIGAULT,  D. (1994).  LEXTER  un  Logiciel  d&#8217;EXtraction  de  TERminologie.  Application  &#224;  l&#8217;extraction  des 
connaissances &#224; partir de textes. Th&#232;se en Math&#233;matiques, Informatique Appliqu&#233;e aux Sciences de l&#8217;Homme. &#201;cole des 
Hautes &#201;tudes en Sciences Sociales.
</p>
<p>FUNG,  P.  (1997). Finding Terminology Translations from Non-parallel  Corpora.  Dans  5th Workshop on Very  Large  
Corpora, Hong Kong, p. 192-202. 
</p>
<p>GALE, W. A., ET K. W. CHURCH. (1993). A program for aligning sentences in bilingual corpora. Computational Linguistics 
19(1): 85-102.
</p>
<p>LARDILLEUX,  A. (2010).  Contribution des basses fr&#233;quences &#224; l&#8217;alignement sous-phrastique multilingue : une approche&#8239;  
diff&#233;rentielle. Th&#232;se en Informatique. Universit&#233; de Caen Basse-normandie.
</p>
<p>MORIN, E., ET B. DAILLE. (2009). Compositionality and lexical alignment of multi-word terms. Dans Language Resources 
and Evaluation (LRE), Multiword expression: hard going or plain sailing, P. Rayson, S. Piao, S. Sharoff, S. Evert, B. 
Villada Moir&#243;n, p. 79&#8211;95.
</p>
<p>PLANAS,  E. (2000).  Multi-level  Similar  Segment  Matching  Algorithm for  Translation  Memories  and  Example-Based 
Machine Translation. Dans Proceedings of the 18th Conference on Computational Linguistics, Saarbr&#252;cken, Germany, p. 
622-627.</p>

</div></div>
</body></html>