<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Syst&#232;me d&#8217;analyse cat&#233;gorielle ACCG : ad&#233;quation au traitement de probl&#232;mes syntaxiques complexes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>Syst&#232;me d&#8217;analyse cat&#233;gorielle ACCG : ad&#233;quation au traitement de probl&#232;mes 
syntaxiques complexes 
</p>
<p>Juyeon Kang, Jean-Pierre Descl&#233;s 
 LaLIC, 28, Rue Serpente, 75006 Paris, France 
</p>
<p>kjuyeon79@yahoo.fr, jean-pierre.descl&#233;s@paris-sorbonne.fr  
 
</p>
<p>Le syst&#232;me cat&#233;goriel, ACCG (Applicative Combinatory Cateogrial Grammar), est con&#231;u pour objectif de produire des 
calculs cat&#233;goriels et d&#8217;engendrer des structures op&#233;rateur/op&#233;rande des phrases du fran&#231;ais et du cor&#233;en. Il s&#8217;agit d&#8217;un 
syst&#232;me motiv&#233; pour l&#8217;analyse de bonne qualit&#233; linguistique pouvant traiter de ph&#233;nom&#232;nes langagiers pr&#233;cis, 
particuli&#232;rement, le syst&#232;me casuel, le double cas, la flexibilit&#233; de l&#8217;ordre des mots dans la langue cor&#233;enne, et la 
coordination, la subordination ainsi que la th&#233;matisation dans les langues fran&#231;aise et cor&#233;enne. Pour cela, nous nous 
sommes bas&#233;s sur la Grammaire Cat&#233;gorielle Combinatoire Applicative (GCCA) (Descl&#233;s et Biskri, 2005 ; Kang et 
Descl&#233;s , 2008 ) qui est sous-jacente &#224; un mod&#232;le mettant en &#339;uvre le calcul fonctionnel des types de Church, les 
combinateurs de la Logique Combinatoire (LC) (Curry et Feys, 1958) et des m&#233;ta-r&#232;gles (deux types de m&#233;ta-r&#232;gles : a/ 
m&#233;ta-r&#232;gles pour contr&#244;ler l&#8217;intervention des combinateurs ; b/ m&#233;ta-r&#232;gles &#171; contextuelles &#187; pour lever l&#8217;ambigu&#239;t&#233; dans 
l&#8217;assignation des types &#224; certaines unit&#233;s polys&#233;miques). Ces m&#233;ta-r&#232;gles contextuelles sont des sortes de r&#232;gles 
contextuelles au sens de J.-P Descl&#233;s (Descl&#233;s, 2006). 
Ce syst&#232;me ACCG (cf. Figure 1) est compos&#233; d&#8217;une interface, d&#8217;un lemmatiseur, de deux dictionnaires des mots typ&#233;s et 
d&#8217;un analyseur cat&#233;goriel : 1) le lemmatiseur que nous avons d&#233;velopp&#233; permet essentiellement de segmenter des phrases 
en entr&#233;e en morph&#232;mes ou en mots, ce qui est une &#233;tape pour une analyse morpho-syntaxique des langues agglutinantes 
comme le cor&#233;en ; 2) les deux dictionnaires pr&#233;alablement d&#233;finis contiennent environ milles unit&#233;s linguistiques 
typ&#233;es pour le cor&#233;en et le fran&#231;ais1 ; 3) l&#8217;analyseur cat&#233;goriel impl&#233;ment&#233; en OCaml. 
 
</p>
<p> 
</p>
<p>Figure 1. Interface de l&#8217;analyseur ACCG 
</p>
<p>Le module &#171; Demo &#187; de l&#8217;ACCG propose des analyses syntaxiques de ph&#233;nom&#232;nes pr&#233;cis tels que le double cas, l&#8217;ordre 
des mots, la coordination, la subordination et la topicalisation.  
Le module &#171; Parser &#187; est une composante essentielle de l&#8217;ACCG en effectuant des analyses syntaxiques. Le lemmatiseur 
et les dictionnaires pr&#233;d&#233;finis interviennent dans ce module. Le processus d&#8217;analyse est le suivant : 1) choisir une langue 
sp&#233;cifique ; 2) entrer une phrase &#224; analyser ; 3) cliquer sur le bouton &#8216;1. Lemmatiser&#8217; si on veut v&#233;rifier le r&#233;sultat de 
lemmatisation ; 4) cliquer sur le bouton &#8216;2. French Parser&#8217; ou &#8216;3. Korean Parser&#8217; pour l&#8217;analyse cat&#233;gorielle de la phrase 
segment&#233;e.  
</p>
<p> 
</p>
<p>BISKRI I., DESCL&#201;S J.-P. (2005). Applicative and Combinatory Categorial Grammar and Subordinate Constructions in French, 
International Journal on Artificial Intelligence Tools, Vol.14, N&#176;1&amp;2, 125-136. 
DESCL&#201;S J.-P. (2006). Contextual Exploration Processing for Discourse Automatic Annotations of Texts. FLAIRS-19 
(International Florida Artificial Intelligence Research Society Conference), 281-284. 
KANG J.Y., DESCL&#201;S J.-P. (2008). Korean Parsing based on the Applicative Combinatory Categorial Grammar. The 22nd 
Pacific Asia Conference on Language, Information and Computation, 215-224.
                                                          
</p>
<p>1
 Ces deux dictionnaires sont chacun construits pour le fran&#231;ais et le cor&#233;en. Ils sont accompagn&#233;s de dictionnaires restreints pour l&#8217;anglais et le 
</p>
<p>japonais : le dictionnaire pour le fran&#231;ais contient une centaine d&#8217;entr&#233;es pour l&#8217;anglais et celui pour le cor&#233;en une centaine d&#8217;entr&#233;es pour le 
japonais, de fa&#231;on &#224; tester la pertinence des analyses linguistiques de probl&#232;mes syntaxiques particuli&#232;rement complexes. </p>

</div></div>
</body></html>