<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un turc m&#233;canique pour les ressources linguistiques : critique de la myriadisation du travail parcellis&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Un turc m&#233;canique pour les ressources linguistiques :
critique de la myriadisation du travail parcellis&#233;
</p>
<p>Beno&#238;t Sagot1 Kar&#235;n Fort2,3 Gilles Adda4 Joseph Mariani4,5 Bernard Lang6
(1) Alpage, INRIA Paris&#8211;Rocquencourt &amp; Universit&#233; Paris 7,
</p>
<p>Rocquencourt, BP 105, 78153 Le Chesnay Cedex, France
(2) INIST-CNRS, 2 all&#233;e de Brabois, 54500 Vandoeuvre-l&#232;s-Nancy, France
</p>
<p>(3) LIPN, Universit&#233; Paris Nord, 99 av J-B Cl&#233;ment, 93430 Villetaneuse, France
(4) LIMSI-CNRS, B&#226;t. 508, rue John von Neumann, Universit&#233; Paris-Sud BP 133, 91403 Orsay Cedex, France
(5) IMMI-CNRS, B&#226;t. 508, rue John von Neumann, Universit&#233; Paris-Sud BP 133, 91403 Orsay Cedex, France
</p>
<p>(6) INRIA Paris&#8211;Rocquencourt, Rocquencourt, BP 105, 78153 Le Chesnay Cedex, France
{benoit.sagot, bernard.lang}@inria.fr, karen.fort@inist.fr, {gilles.adda,joseph.mariani}@limsi.fr
</p>
<p>R&#233;sum&#233;. Cet article est une prise de position concernant les plate-formes de type Amazon Mechanical Turk,
dont l&#8217;utilisation est en plein essor depuis quelques ann&#233;es dans le traitement automatique des langues. Ces plate-
formes de travail en ligne permettent, selon le discours qui pr&#233;vaut dans les articles du domaine, de faire d&#233;velopper
toutes sortes de ressources linguistiques de qualit&#233;, pour un prix imbattable et en un temps tr&#232;s r&#233;duit, par des gens
pour qui il s&#8217;agit d&#8217;un passe-temps. Nous allons ici d&#233;montrer que la situation est loin d&#8217;&#234;tre aussi id&#233;ale, que
ce soit sur le plan de la qualit&#233;, du prix, du statut des travailleurs ou de l&#8217;&#233;thique. Nous rappellerons ensuite les
solutions alternatives d&#233;j&#224; existantes ou propos&#233;es. Notre but est ici double : informer les chercheurs, afin qu&#8217;ils
fassent leur choix en toute connaissance de cause, et proposer des solutions pratiques et organisationnelles pour
am&#233;liorer le d&#233;veloppement de nouvelles ressources linguistiques en limitant les risques de d&#233;rives &#233;thiques et
l&#233;gales, sans que cela se fasse au prix de leur co&#251;t ou de leur qualit&#233;.
</p>
<p>Abstract. This article is a position paper concerning Amazon Mechanical Turk-like systems, the use of
which has been steadily growing in natural language processing in the past few years. According to the mainstream
opinion expressed in the articles of the domain, these online working platforms allow to develop very quickly all
sorts of quality language resources, for a very low price, by people doing that as a hobby. We shall demonstrate
here that the situation is far from being that ideal, be it from the point of view of quality, price, workers&#8217; status or
ethics. We shall then bring back to mind already existing or proposed alternatives. Our goal here is twofold : to
inform researchers, so that they can make their own choices with all the elements of the reflection in mind, and
propose practical and organizational solutions in order to improve new language resources development, while
limiting the risks of ethical and legal issues without letting go price or quality.
</p>
<p>Mots-cl&#233;s : Amazon Mechanical Turk, ressources linguistiques.
Keywords: Amazon Mechanical Turk, language resources.
</p>
<p>1 Introduction
</p>
<p>Le traitement des langues a grandement &#233;volu&#233; au cours des ces vingt derni&#232;res ann&#233;es, tant dans le traitement
de l&#8217;&#233;crit que de la parole. Stimul&#233; par le paradigme de l&#8217;&#233;valuation, le r&#244;le des ressources linguistiques dans
ce d&#233;veloppement a &#233;t&#233; et reste crucial : elles sont &#224; la fois mati&#232;re premi&#232;re, objet d&#8217;&#233;tude et ressource pour
l&#8217;&#233;valuation de syst&#232;mes. Nous proposons ici une critiqued&#8217;un outil nouveau de constitution de ces ressources, le
microworking par le biais du crowdsourcing. Microworking fait r&#233;f&#233;rence au fait que le travail est segment&#233; en
petites t&#226;ches, crowdsourcing au fait que le travail est d&#233;localis&#233; (outsourced) et est effectu&#233; par un grand nombre
de personnes (crowd), pay&#233;es ou non. Nous n&#233;ologiserons crowdsourcing en &#171; myriadisation &#187; et microworking
en &#171; travail parcellis&#233; &#187;, et la conjonction des deux par &#171; myriadisation du travail parcellis&#233; &#187;.
</p>
<p>Nous aborderons en d&#233;tails le cas d&#8217;un syst&#232;me de myriadisation du travail parcellis&#233; (m.t.p. dans la suite) qui
a fait flor&#232;s ces derniers temps, Amazon Mechanical Turk (MTurk), notamment pour sa capacit&#233; &#224; produire des
corpus annot&#233;s &#224; un co&#251;t tr&#232;s faible. Les auteurs de cet article ont contribu&#233;, &#224; des degr&#233;s divers, &#224; la mise en
place du paradigme de l&#8217;&#233;valuation et au d&#233;veloppement de nombreux outils et ressources dans le domaine du</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. SAGOT K. FORT G. ADDA J. MARIANI B. LANG
</p>
<p>traitement du langage. Nous sommes &#224; ce titre conscients de l&#8217;importance du d&#233;veloppement et de la diffusion
de celles-ci et du frein que repr&#233;sente leur co&#251;t, souvent r&#233;dhibitoire. Cependant, nous voulons mettre en avant
le fait que le co&#251;t du d&#233;veloppement est un argument non fond&#233; en ce qui concerne la m.t.p., tout d&#8217;abord parce
qu&#8217;il masque des probl&#232;mes &#233;conomiques complexes, ensuite parce qu&#8217;il met sous le boisseau le probl&#232;me de la
qualit&#233; des ressources ainsi obtenues, enfin parce qu&#8217;il omet la question de l&#8217;&#233;thique et du droit du travail. Nous
aborderons ici l&#8217;ensemble de ces questions, sans pour autant remettre en cause l&#8217;utilit&#233; de la m.t.p., &#224; condition
que son fonctionnement et son utilisation se fassent selon certains principes.
</p>
<p>2 Que sont les syst&#232;mes de myriadisation ?
</p>
<p>Le concept de myriadisation est venu de l&#8217;id&#233;e qu&#8217;un certain nombre de t&#226;ches pouvaient &#234;tre effectu&#233;es par des
utilisateurs d&#8217;Internet, en utilisant les atouts propres &#224; celui-ci, c&#8217;est-&#224;-dire pouvoir acc&#233;der &#224; un grand nombre de
personnes, de mani&#232;re quasi-instantan&#233;e, partout dans le monde. La participation de ces internautes peut &#234;tre b&#233;-
n&#233;vole ou r&#233;tribu&#233;e, suivant les t&#226;ches et les syst&#232;mes. Parmi les syst&#232;mes b&#233;n&#233;voles, nous pouvons citer l&#8217;exemple
fameux de Wikipedia et, parmi ceux avec r&#233;tribution, RentACoder (o&#249; l&#8217;on peut soumettre un projet de program-
mation &#224; une communaut&#233; de programmeurs) ou LiveOps (qui est un centre d&#8217;appels virtuel, les op&#233;rateurs &#233;tant
des internautes). A la suite de ces syst&#232;mes est apparu le concept de Human computing. Dans ce dernier cas, on
ne fait plus appel &#224; des comp&#233;tences particuli&#232;res d&#8217;internautes, mais on utilise deux propri&#233;t&#233;s tr&#232;s &#233;l&#233;mentaires :
&#234;tre un humain et avoir du temps libre. C&#8217;est l&#8217;application des grilles de calcul aux humains : chaque utilisateur, &#224;
la mani&#232;re d&#8217;un processeur, effectue une t&#226;che &#233;l&#233;mentaire en n&#8217;ayant acc&#232;s qu&#8217;&#224; la seule information n&#233;cessaire
pour la mener &#224; bien. Dans ce type de syst&#232;mes, seules des t&#226;ches tr&#232;s simples sont effectu&#233;es par les humains,
soit parce qu&#8217;elles sont intrins&#232;quement simples (par exemple, mettre une &#233;tiquette sur une image), soit parce
que la t&#226;che est d&#233;coupable en micro-t&#226;ches &#233;l&#233;mentaires. Ce sont les syst&#232;mes de myriadisation du travail par-
cellis&#233;, qui sont le c&#339;ur de cet article. Dans ce concept, il y a souvent r&#233;tribution 1, mais celle-ci peut-&#234;tre non
mon&#233;taire, comme dans certains GWAP (Games with a purpose) (von Ahn, 2006; Chamberlain et al., 2008). La
cr&#233;ation d&#8217;Amazon Mechanical Turk en 2005 s&#8217;inscrit dans cette derni&#232;re cat&#233;gorie de syst&#232;mes de m.t.p. avec
r&#233;mun&#233;ration, qui a &#233;t&#233; suivie par un grand nombre d&#8217;autres syst&#232;mes (Biewald, 2010), ceux-ci n&#8217;ayant pas acquis
la m&#234;me importance, en particulier en raison du nombre de personnes inscrites. Comme souvent pour les nou-
veaux usages issus du Web, on ressent &#224; la fois une fascination pour la potentialit&#233; des m.t.p. et une m&#233;fiance en
face de ces pratiques qui ne semblent pas avoir de r&#233;elles consid&#233;rations pour le droit du travail. L&#8217;apparition des
syst&#232;mes de myriadisation pose de nombreux probl&#232;mes, l&#233;gaux, &#233;thiques et philosophiques, abord&#233;s par exemple
dans (Zittrain, 2008). Elle soul&#232;ve d&#8217;importantes questions : qu&#8217;est-ce que le travail ? qu&#8217;est-ce qu&#8217;une r&#233;tribution
juste ? un &#234;tre humain est-il assimilable &#224; un ordinateur ? Ces questions essentielles d&#233;bordent largement &#224; la fois
le cadre d&#8217;un article de conf&#233;rence et nos comp&#233;tences. C&#8217;est pourquoi nous nous limiterons, autant que possible,
aux probl&#232;mes pr&#233;cis que pose l&#8217;introduction de MTurk comme moyen de produire des ressources linguistiques,
car nous jugeons cela &#224; la fois urgent et crucial.
</p>
<p>3 Amazon Mechanical Turk : l&#233;gendes et r&#233;alit&#233;
</p>
<p>Amazon Mechanical Turk (MTurk) permet, selon de nombreux auteurs dont le premier est Snow et al. (2008),
de produire &#224; peu de frais et rapidement des ressources linguistiques de qualit&#233;. Cette d&#233;couverte est d&#8217;une telle
importance pour la communaut&#233; qui manque toujours cruellement de moyens pour d&#233;velopper lesdites ressources,
qu&#8217;elle a entra&#238;n&#233; un important effet de mode. Ce ph&#233;nom&#232;ne est, nous allons le voir, ni totalement justifi&#233;, ni sans
cons&#233;quences pour le d&#233;veloppement futur de telles ressources. Par ailleurs, pour de nombreux chercheurs, les
Turkers 2 utilisent MTurk comme un hobby, il n&#8217;est donc pas scandaleux de tr&#232;s mal les r&#233;mun&#233;rer. Nous allons
voir ici que la situation est loin d&#8217;&#234;tre aussi simplement id&#233;ale.
</p>
<p>1. mais pas toujours, par exemple dans le syst&#232;me reCAPTCHA http://www.google.com/recaptcha/learnmore, o&#249; les
CAPTCHAs proviennent de mots mal reconnus lors de la num&#233;risation de Google books
</p>
<p>2. Il est d&#8217;usage d&#8217;appeler les personnes effectuant des t&#226;ches au sein du &#171; turc m&#233;canique &#187; des Turkers, et celles qui fournissent les t&#226;ches
des Requesters.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MYRIADISATION DU TRAVAIL PARCELLIS&#201;
</p>
<p>Ann&#233;e
</p>
<p>Nb Articles
</p>
<p>1
</p>
<p>2
</p>
<p>3
</p>
<p>4
</p>
<p>5
</p>
<p>6
</p>
<p>2006 2007 2008 2009 2010
</p>
<p>IEEE-ICASSP
Interspeech
MT Summit
EMNLP
LAW
LREC
COLING
ACL
</p>
<p>FIGURE 1 &#8211; &#201;volution de l&#8217;utilisation r&#233;elle de MTurk dans les publications TAL et parole
</p>
<p>3.1 Etat des lieux
</p>
<p>Cr&#233;&#233; en 2005, le syst&#232;me de m.t.p. MTurk est aujourd&#8217;hui de plus en plus utilis&#233; pour la cr&#233;ation ou la validation
de ressources linguistiques pour le TAL (Traitement Automatique des Langues), et la plupart des conf&#233;rences
internationales du domaine ont vu la pr&#233;sentation de projets de recherche utilisant MTurk.
</p>
<p>La figure 1, reprise de (Fort et al., 2011), montre l&#8217;&#233;volution rapide du ph&#233;nom&#232;ne. Elle comptabilise le nombre
de publications dans les principales conf&#233;rences internationales d&#233;crivant des exp&#233;riences utilisant MTurk.
</p>
<p>Afin de compl&#233;ter cette &#233;tude, nous avons &#233;galement r&#233;alis&#233; une recherche plus globale, cette fois dans l&#8217;an-
thologie de l&#8217;ACL. 3 Cette recherche, effectu&#233;e le 5 novembre 2010, a ramen&#233; 124 r&#233;sultats, dont, apr&#232;s filtrage
manuel, 86 papiers utilisant effectivement MTurk (Fort et al., 2011). Ces r&#233;sultats incluent un atelier sp&#233;cialis&#233;,
fournissant 35 des 86 publications, le NAACL-HLT 2010 Workshop on Amazon Mechanical Turk, dont l&#8217;exis-
tence m&#234;me est le signe de l&#8217;importance grandissante de MTurk dans le domaine. Mentionnons enfin que certaines
exp&#233;riences relat&#233;es dans des articles ont utilis&#233; MTurk sans le mentionner explicitement (Fort et al., 2011). Ainsi,
Kevin B. Cohen, co-auteur de l&#8217;article pr&#233;cit&#233;, a remarqu&#233; qu&#8217;un article (Biadsy et al., 2008) dont il avait vu la
pr&#233;sentation en conf&#233;rence, utilisait MTurk et n&#8217;en faisait pas mention. C&#244;t&#233; francophone, nous ne trouvons aucun
article utilisant MTurk dans les actes des pr&#233;c&#233;dents TALN, ni dans les num&#233;ros publi&#233;s &#224; ce jour de la revue TAL.
</p>
<p>3.2 MTurk est un hobby pour les Turkers ?
</p>
<p>Afin de pouvoir efficacement juger de l&#8217;&#233;thique et de la l&#233;galit&#233; de MTurk, il est fondamental de pouvoir qualifier
l&#8217;activit&#233; que m&#232;nent les Turkers lorsqu&#8217;ils effectuent des t&#226;ches dans MTurk. S&#8217;agit-il d&#8217;une activit&#233; b&#233;n&#233;vole,
comme celle effectu&#233;e par les participants &#224; Wikipedia ? Clairement non, lorsque l&#8217;on regarde la page d&#8217;accueil o&#249;
MTurk met directement l&#8217;accent sur l&#8217;argent gagn&#233;. Peut-elle &#234;tre assimil&#233;e &#224; un hobby, la r&#233;tribution &#233;tant alors
assimilable &#224; un bonus ne correspondant pas &#224; un salaire, comme cela est sugg&#233;r&#233; dans quelques articles (Novotney
&amp; Callison-Burch, 2010) ?
</p>
<p>Un certain nombre d&#8217;&#233;tudes (Ross et al., 2009, 2010; Ipeirotis, 2010b), fournissent, gr&#226;ce &#224; des questionnaires
soumis aux Turkers via MTurk, des chiffres d&#233;clar&#233;s sur un certain nombre de facteurs socio-&#233;conomiques (pays,
&#226;ge, revenu, &#233;ducation. . .), sur la fa&#231;on dont ils utilisent MTurk (nombre de t&#226;ches effectu&#233;es par semaine, revenu
acquis, date d&#8217;entr&#233;e dans MTurk . . .) 4 et dont ils qualifient leur activit&#233;. La motivation financi&#232;re (d&#233;clar&#233;e)
est minoritaire chez les Turkers am&#233;ricains (38%), mais majoritaire chez les Turkers indiens (69%). Si 60% des
Turkers pensent que MTurk est un moyen utile de gagner de l&#8217;argent sur leur temps libre, ils ne sont que 30% &#224;
motiver leur participation par l&#8217;int&#233;r&#234;t des t&#226;ches, et 20% (5% des travailleurs indiens) disent l&#8217;utiliser pour tuer
le temps. Enfin, ils sont 20% (30% des Indiens) &#224; dire que MTurk leur est n&#233;cessaire pour vivre, et &#224; peu pr&#232;s le
m&#234;me pourcentage &#224; dire que MTurk constitue leur principale source de revenus.
</p>
<p>3. Association for Computational Linguistics, http://www.aclweb.org/anthology/
4. On pourra se reporter par exemple &#224; (Adda &amp; Mariani, 2010) pour un r&#233;sum&#233; de celles-ci. On y apprend par exemple (Ross et al.,
</p>
<p>2010) que les Turkers en provenance d&#8217;Inde repr&#233;sentaient 5% &#224; la fin de 2008, 36% fin 2009, plus de 50% en mai 2010 selon http:
//blog.crowdflower.com/2010/05/amazon-mechanical-turk-survey/ et, selon (Biewald, 2010) sont responsables de
plus de 60% de l&#8217;activit&#233; dans MTurk.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. SAGOT K. FORT G. ADDA J. MARIANI B. LANG
</p>
<p>Un autre moyen de v&#233;rifier la nature de l&#8217;activit&#233; des Turkers est d&#8217;examiner la nature de la t&#226;che. Certaines
t&#226;ches actuellement propos&#233;es sur MTurk correspondent &#224; de nouveaux usages (par exemple, des exp&#233;riences
artistiques comme http://www.thesheepmarket.com/), mais d&#8217;autres sont effectu&#233;es habituellement par
des employ&#233;s (ce qui peut donc assimiler MTurk &#224; une forme de d&#233;localisation sur le web, pour faire baisser les
co&#251;ts de production), et constituent donc un travail. Tel est le cas des activit&#233;s de transcription ou de traduction,
qui sont (pour ce qui concerne les ressources les plus significatives) produites par des employ&#233;s d&#8217;entit&#233;s comme
le LDC ou ELDA. Pour les 20% des Turkers qui passent plus de 15h par semaine sur MTurk (Adda &amp; Mariani,
2010) et contribuent &#224; hauteur de 80% des t&#226;ches, la dur&#233;e d&#8217;activit&#233; est significative, et est assimilable &#224; un travail.
</p>
<p>Nous ne pouvons pas conclure de mani&#232;re d&#233;finitive sur la nature de l&#8217;activit&#233; de tous les Turkers, car la nature
des t&#226;ches sur MTurk et la motivation des Turkers est composite. Cependant, nous pensons que pour les 20%
des Turkers pour qui MTurk constitue la source principale de revenus, ainsi que pour les t&#226;ches assimilables &#224; un
travail (qui ont 8 chances sur 10 d&#8217;&#234;tre effectu&#233;es par des Turkers travaillant plus de 15 heures par semaine), la
nature de l&#8217;activit&#233; est assimilable &#224; un travail.
</p>
<p>3.3 MTurk permet de r&#233;duire les co&#251;ts ?
</p>
<p>Dans la plupart des articles ayant utilis&#233; MTurk, le faible co&#251;t de d&#233;veloppement de la ressource est mis en avant.
Il est vrai que MTurk permet de proposer des r&#233;tributions si faibles aux Turkers que le co&#251;t en est forc&#233;ment
r&#233;duit, par exemple 0.005$ pour transcrire un segment d&#8217;environ 5 secondes de parole t&#233;l&#233;phonique (Novotney
&amp; Callison-Burch, 2010). Il faut cependant nuancer ces chiffres. Tout d&#8217;abord, le co&#251;t effectif n&#8217;est pas toujours
calcul&#233; avec rigueur. En effet, le temps de d&#233;veloppement de l&#8217;interface et de mise en place des garde-fous est
non nul (Callison-Burch &amp; Dredze, 2010). De m&#234;me, le co&#251;t de validation (Kaisser &amp; Lowe, 2008) ou de d&#233;-
veloppement (Xu &amp; Klakow, 2010) post-MTurk permettant de compenser la mauvaise qualit&#233; des r&#233;sultats (voir
section 3.4) n&#8217;est g&#233;n&#233;ralement pas pr&#233;cis&#233;ment &#233;valu&#233;. Or, ces co&#251;ts suppl&#233;mentaires ne sont jamais pris en
compte dans le calcul final. De plus, certaines t&#226;ches peuvent se r&#233;v&#233;ler plus co&#251;teuses que pr&#233;vues. Ainsi, si l&#8217;on
ne trouve pas de Turkers pour faire la t&#226;che, on peut &#234;tre oblig&#233; d&#8217;augmenter la r&#233;mun&#233;ration, comme Novotney
&amp; Callison-Burch (2010), qui, partant d&#8217;un co&#251;t tr&#232;s bas (5 dollars de l&#8217;heure transcrite), ont &#233;t&#233; oblig&#233;s de le
multiplier par 7 (37 dollars de l&#8217;heure) pour transcrire du cor&#233;en, par manque de Turkers qualifi&#233;s.
</p>
<p>3.4 MTurk permet de produire une qualit&#233; &#233;quivalente ?
</p>
<p>3.4.1 Limitations li&#233;es &#224; la non expertise
</p>
<p>Les Turkers &#233;tant des non experts, le Requester (fournisseur de t&#226;ches) doit d&#233;couper les t&#226;ches complexes en
t&#226;ches plus simples (HIT, Human Intelligence Task), afin de les rendre r&#233;alisables. Ce faisant, le chercheur est
amen&#233; &#224; faire des choix qui peuvent biaiser les r&#233;sultats. Un exemple de ce type de biais est analys&#233; dans (Cook
&amp; Stevenson, 2010), o&#249; les auteurs reconnaissent que le fait de ne proposer qu&#8217;une phrase par type d&#8217;&#233;volution
lexicale (am&#233;lioration ou p&#233;joration) influence le r&#233;sultat.
</p>
<p>Plus grave encore que ces biais potentiels, certains chercheurs ont observ&#233; que, lorsque la complexit&#233; de la t&#226;che
augmente, la qualit&#233; produite sous MTurk est insuffisante. C&#8217;est notamment le cas dans (Bhardwaj et al., 2010), qui
d&#233;montre que, pour leur t&#226;che de d&#233;sambigu&#239;sation lexicale, un petit nombre d&#8217;annotateurs bien form&#233;s produit de
bien meilleurs r&#233;sultats qu&#8217;un grand nombre de Turkers (le nombre &#233;tant suppos&#233; contrebalancer la non expertise).
De ce point de vue, leurs r&#233;sultats contredisent ceux de Snow et al. (2008) dont la t&#226;che &#233;tait semblable mais
beaucoup plus simple.Cette m&#234;me difficult&#233; d&#8217;obtenir une qualit&#233; suffisante sur des t&#226;ches complexes appara&#238;t
dans (Gillick &amp; Liu, 2010), qui d&#233;montre que l&#8217;&#233;valuation par des non experts de syst&#232;mes de r&#233;sum&#233; automatique
est &#171; risqu&#233;e &#187;, les Turkers n&#8217;&#233;tant pas capables d&#8217;obtenir des r&#233;sultats comparables &#224; ceux des experts. On retrouve
ce probl&#232;me de qualit&#233; dans de nombreux articles, dans lesquels les auteurs ont d&#251; faire valider les r&#233;sultats
des Turkers par des sp&#233;cialistes (des &#233;tudiants en th&#232;se pour (Kaisser &amp; Lowe, 2008)) ou leur faire subir un
post-traitement assez lourd (Xu &amp; Klakow, 2010). Enfin, la qualit&#233; du travail des annotateurs non experts varie
consid&#233;rablement (Tratz &amp; Hovy, 2010).
</p>
<p>Il existe &#233;galement un effet &#171; boule de neige &#187; qui tend &#224; surestimer la qualit&#233; signal&#233;e dans les articles : des
chercheurs louent MTurk (Xu &amp; Klakow, 2010), citant des recherches qui ont fait usage de MTurk, mais qui
n&#8217;auraient pas donn&#233; de r&#233;sultats utilisables sans une intervention post&#233;rieure plus ou moins lourde (Kaisser &amp;
Lowe, 2008). On pourrait en conclure que MTurk ne devrait &#234;tre utilis&#233; que pour des t&#226;ches simples, or, outre le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MYRIADISATION DU TRAVAIL PARCELLIS&#201;
</p>
<p>fait que son fonctionnement m&#234;me induit d&#8217;importantes limitations (voir section 3.4.2), il est int&#233;ressant de noter
que dans certains cas simples, des outils de TAL font d&#8217;ores et d&#233;j&#224; mieux que les Turkers (Wais et al., 2010).
</p>
<p>3.4.2 Limitations li&#233;es au fonctionnement m&#234;me de MTurk
</p>
<p>Une premi&#232;re limitation est l&#8217;interface de MTurk. Tratz &amp; Hovy (2010) notent ainsi que les limites de l&#8217;interface
constituent &#171; le premier et le plus important des d&#233;fauts &#187; de MTurk. Les auteurs regrettent par ailleurs l&#8217;impos-
sibilit&#233; d&#8217;avoir la certitude que les Turkers participant &#224; la t&#226;che sont bien de langue maternelle anglaise. Cette
impossibilit&#233; de conna&#238;tre les capacit&#233;s r&#233;elles des Turkers, notamment de conna&#238;tre leur langue maternelle (bien
que leurs adresses IP soient g&#233;olocalisables), est un probl&#232;me bien r&#233;el. S&#8217;il est possible de mettre en place des
tests pr&#233;alables, qui, l&#224; encore, repr&#233;sentent un co&#251;t suppl&#233;mentaire &#224; prendre en compte, il est tr&#232;s facile de
tricher (Callison-Burch &amp; Dredze, 2010). Bien entendu, il est toujours possible de mettre en place des garde-
fous (Callison-Burch &amp; Dredze, 2010; Welinder et al., 2010), mais, encore une fois, cela demande du temps
et repr&#233;sente donc un co&#251;t suppl&#233;mentaire que peu de Requesters sont pr&#234;ts &#224; investir. Ainsi, dans (Xu &amp; Kla-
kow, 2010), les auteurs ont identifi&#233; des spammeurs mais n&#8217;ont pas r&#233;ussi &#224; les &#233;liminer. Pour certaines t&#226;ches, il
peut s&#8217;av&#233;rer difficile de trouver des Turkers ayant les comp&#233;tences n&#233;cessaires en raison de la complexit&#233; de la
t&#226;che (Gillick &amp; Liu, 2010; Lambert et al., 2010), ou de la langue &#224; ma&#238;triser (Novotney &amp; Callison-Burch, 2010).
</p>
<p>Par ailleurs, il ne faut pas n&#233;gliger l&#8217;impact du paiement &#224; la t&#226;che, qui induit comme comportement logique de
placer le nombre de t&#226;ches r&#233;alis&#233;es au-dessus de la qualit&#233; de la r&#233;alisation, et ce, quelle que soit la r&#233;tribution.
Kochhar et al. (2010) sont ainsi arriv&#233;s &#224; la conclusion qu&#8217;il valait mieux payer &#224; l&#8217;heure (avec, bien s&#251;r, des
proc&#233;dures de v&#233;rification et de justification du temps pass&#233;).
</p>
<p>4 Quelques r&#233;flexions sur le statut de MTurk
</p>
<p>4.1 Quel est le statut de l&#8217;activit&#233; dans MTurk ?
</p>
<p>En obscurcissant la relation entre Turkers et Requesters, et entre les Turkers eux-m&#234;mes, MTurk emp&#234;che de fait
la possibilit&#233; de s&#8217;organiser en syndicats, de protester contre d&#8217;&#233;ventuelles pratiques douteuses des Requesters ou
d&#8217;ester en justice. Au-del&#224; des probl&#232;mes de droit du travail, il faut parler des probl&#232;mes des taxes et cotisations
sociales : Amazon consid&#232;re (selon l&#8217;accord de licence de MTurk) que les Turkers sont assimilables &#224; des tra-
vailleurs ind&#233;pendants,et donc qu&#8217;il leur incombe de payer toutes les taxes et charges aff&#233;rant &#224; leur activit&#233;. &#201;tant
donn&#233; la hauteur des r&#233;mun&#233;rations prises individuellement, il est parfaitement hypocrite de penser que cela est
possible. Il est donc fortement probable que les Turkers ne d&#233;clarent pas ces revenus et ne cotisent pas non plus &#224;
une quelconque caisse de retraite ou de s&#233;curit&#233; sociale. Il en va bien entendu de m&#234;me pour les fournisseurs de
travail. Les &#233;tats sont donc priv&#233;s d&#8217;un revenu l&#233;gitime.
</p>
<p>Il faut souligner &#233;galement que la nature de la relation entre les trois partenaires, Turker, Requester et MTurk,
vague pour le droit am&#233;ricain, est encore plus douteuse en regard du droit fran&#231;ais. En effet, selon la l&#233;gislation
fran&#231;aise du travail, en dehors du fait que le travail &#224; la t&#226;che est ill&#233;gal, soit il s&#8217;agit de travail salari&#233;, qui serait, en
l&#8217;occurrence, non d&#233;clar&#233; par l&#8217;employeur, donc ill&#233;gal (article 8200 et suivants du Code du Travail), soit il s&#8217;agit
d&#8217;un rapport de prestation de service, dont le donneur d&#8217;ordre serait MTurk et le prestataire le Turker et, dans ce
cas, le Turker doit &#234;tre enregistr&#233; au registre du commerce (article 8222-1 du Code du Travail).
</p>
<p>4.2 Le mod&#232;le &#233;conomique de MTurk est-il fond&#233; ?
</p>
<p>Comme soulign&#233; dans la partie 2, lorsque l&#8217;on aborde pour la premi&#232;re fois MTurk, on est sid&#233;r&#233; devant les condi-
tions financi&#232;res impos&#233;es aux Turkers, qui am&#232;nent &#224; des r&#233;mun&#233;rations horaires ridiculement basses (inf&#233;rieures
&#224; 2 dollars, soit 1,46 euros (Ross et al., 2009; Ipeirotis, 2010b)). Ce co&#251;t fabuleusement bas correspond-il &#224; une
r&#233;alit&#233; &#233;conomique saine (comme sugg&#233;r&#233; par Marge et al. (2010) et McGraw et al. (2010), qui consid&#232;rent que
cette r&#233;tribution n&#8217;est qu&#8217;une sorte de bonus pour une t&#226;che par ailleurs effectu&#233;e avec plaisir) ?
</p>
<p>Nous l&#8217;avons vu dans la partie 3.2, l&#8217;assertion que les Turkers consid&#232;rent MTurk comme un hobby est fausse, au
moins pour une partie significative d&#8217;entre eux. D&#232;s lors, pourquoi, si cela constitue pour eux un travail, acceptent-
ils un salaire horaire aussi bas ? La loi de l&#8217;offre et la demande n&#8217;est pas suffisante pour l&#8217;expliquer, tout d&#8217;abord</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. SAGOT K. FORT G. ADDA J. MARIANI B. LANG
</p>
<p>parce que le nombre r&#233;el de Turkers n&#8217;est pas si important (Fort et al., 2011), ensuite, parce qu&#8217;il est souvent
difficile de faire ex&#233;cuter des t&#226;ches de grande taille en un temps limit&#233; pour un co&#251;t standard (Ipeirotis, 2010a).
</p>
<p>Un fait peut nous mettre sur la voie d&#8217;une explication cr&#233;dible : beaucoup d&#8217;articles (par exemple (Marge et al.,
2010)) soulignent que la qualit&#233; n&#8217;est pas li&#233;e au co&#251;t associ&#233; &#224; chaque t&#226;che. Cela est d&#251; en particulier &#224; la
pr&#233;sence de spammeurs (c&#8217;est-&#224;-dire de Turkers qui r&#233;pondent au hasard ou en utilisant un syst&#232;me automatique),
attir&#233;s par les t&#226;ches bien r&#233;mun&#233;r&#233;es, et qui sont en grand nombre dans le syst&#232;me MTurk, le syst&#232;me de r&#233;putation
mis en place par Amazon &#233;tant notoirement facile &#224; mettre en d&#233;faut 5. Cela conduit &#224; une situation semblable
au &#171; march&#233; des tacots &#187;, d&#233;crit par le prix Nobel Georges Akerlof (Akerlof, 1970) : l&#8217;acheteur d&#8217;une voiture
d&#8217;occasion prend en compte dans le prix qu&#8217;il offre le risque que le vendeur lui &#171; fourgue &#187; un tacot. Les vendeurs
propri&#233;taires d&#8217;une bonne voiture ne peuvent donc obtenir un bon prix et quittent le syst&#232;me, ce qui accro&#238;t en
retour la d&#233;fiance de l&#8217;acheteur, car cela augmente le risque d&#8217;acheter un tacot. La pr&#233;sence des spammeurs, de par
le laxisme du syst&#232;me mis en &#339;uvre par Amazon, conduit &#224; une stabilisation &#224; un prix tr&#232;s bas, les bons travailleurs
quittant donc le syst&#232;me (70% des Turkers utilisent MTurk depuis moins de 6 mois (Ross et al., 2009)).
</p>
<p>De plus, il est ind&#233;niable qu&#8217;un certain nombre de Turkers utilisent MTurk comme moyen de divertissement :
ceux-ci sont attir&#233;s par les t&#226;ches int&#233;ressantes, quelle que soit leur r&#233;mun&#233;ration. Sur ces t&#226;ches, ils sont en
concurrence avec les Turkers-travailleurs (qui, naturellement, souhaitent &#233;galement faire des t&#226;ches int&#233;ressantes),
ce qui conduit &#233;galement &#224; faire baisser le taux horaire moyen &#171; acceptable &#187;, c&#8217;est-&#224;-dire le taux horaire seuil, en
dessous duquel un travailleur n&#8217;acceptera pas d&#8217;effectuer la t&#226;che.
</p>
<p>Dernier facteur qui tend &#224; faire accepter un taux horaire finalement inacceptable : le travail &#224; la t&#226;che. Un Turker,
fait bien s&#251;r une relation entre la difficult&#233; de la t&#226;che et la r&#233;tribution, mais n&#8217;a pas une id&#233;e claire du salaire
horaire avant de commencer &#224; travailler. De plus, le travail &#224; la t&#226;che induit un comportement que l&#8217;on peut voir
&#233;galement dans des jeux en ligne ou &#224; chaque fois que l&#8217;on effectue une t&#226;che contre une r&#233;tribution absolue :
la personne a tendance &#224; regarder grossir son compteur d&#8217;argent, ou de points, et &#224; se fixer des objectifs absolus,
d&#233;connect&#233;s d&#8217;un quelconque taux horaire : &#171; aujourd&#8217;hui, je reste dans le syst&#232;me, jusqu&#8217;&#224; ce que j&#8217;ai gagn&#233; 5
dollars &#187;. Ce qui n&#8217;est bien s&#251;r pas le meilleur moyen d&#8217;optimiser le taux horaire. Si le travail &#224; la t&#226;che est interdit
en France, c&#8217;est bien pour emp&#234;cher que des travailleurs gagnent moins que le salaire minimum.
</p>
<p>Comme le souligne (Ipeirotis, 2010c), les d&#233;fauts de la plateforme MTurk remettent en cause sa viabilit&#233; &#224; moyen
terme, si elle n&#8217;&#233;volue pas fondamentalement, en particulier sur les probl&#232;mes de r&#233;mun&#233;ration et de syst&#232;mes de
r&#233;putation fiables pour les Turkers et les Requesters.
</p>
<p>4.3 Quelle est la situation par rapport &#224; la propri&#233;t&#233; intellectuelle sur MTurk ?
</p>
<p>Au regard du droit europ&#233;en, la probl&#233;matique de la propri&#233;t&#233; intellectuelle pour des donn&#233;es telles que l&#8217;on peut
en produire via MTurk se pose le plus souvent en termes de protection associ&#233;e aux bases de donn&#233;es, au sens
de la directive europ&#233;enne du 11 mars 1996. Cette directive, qui concerne les ensembles d&#8217;informations de toutes
natures, offre une double protection : (1) par le droit d&#8217;auteur concernant la structure de la base, conditionn&#233; au
fait qu&#8217;il y ait l&#224; une cr&#233;ation originale, et (2) par un droit sp&#233;cifique couvrant le contenu, droit proche de celui
du droit d&#8217;auteur mais conditionn&#233; &#224; la valeur &#233;conomique des donn&#233;es (et non &#224; leur originalit&#233;), au sens o&#249; ces
donn&#233;es doivent avoir &#233;t&#233; obtenues gr&#226;ce &#224; un investissement substantiel du point de vue qualitatif ou quantitatif.
Cette deuxi&#232;me protection est ind&#233;pendante du caract&#232;re public ou non des donn&#233;es, l&#8217;objet de la protection &#233;tant
la base dans son ensemble (c&#8217;est-&#224;-dire l&#8217;assemblage des donn&#233;es).
</p>
<p>Dans le cas de MTurk, les droits semblent devoir &#234;tre la propri&#233;t&#233; du Requester, soit en tant qu&#8217;auteur (pour les
HIT eux-m&#234;mes et ce qu&#8217;ils pourraient contenir, sauf lorsque sont utilis&#233;es des donn&#233;es elles-m&#234;mes soumises &#224;
des droits d&#8217;auteurs propres, comme, par exemple, si l&#8217;on fait transcrire ou traduire des contenus existants), soit
en tant qu&#8217;organisateur de ce qui est une &#339;uvre collective 6 (pour les productions des Turkers).
</p>
<p>Cela dit, il n&#8217;est pas clair, avec MTurk relevant des &#201;tats-Unis et des Requesters et des Turkers relevant souvent
d&#8217;autres pays, qu&#8217;il y ait un droit applicable, la situation ne semblant pas envisag&#233;e dans les trait&#233;s internationaux.
</p>
<p>5. http ://behind-the-enemy-lines.blogspot.com/2010/10/be-top-mechanical-turk-worker-you-need.html
6. L&#8217;&#339;uvre collective est d&#233;finie par l&#8217;article L. 113-2 alin&#233;a 3 du Code de la propri&#233;t&#233; intellectuelle comme &#233;tant une &#339;uvre cr&#233;&#233;e
</p>
<p>sur l&#8217;initiative d&#8217;une personne physique ou morale qui l&#8217;&#233;dite, la publie et la divulgue sous sa direction et son nom et dans laquelle la
contribution personnelle des divers auteurs participant &#224; son &#233;laboration se fond dans l&#8217;ensemble en vue duquel elle est con&#231;ue, sans qu&#8217;il
soit possible d&#8217;attribuer &#224; chacun d&#8217;eux un droit distinct sur l&#8217;ensemble r&#233;alis&#233;. L&#8217;article 113-5 stipule alors que L&#8217;&#339;uvre collective est, sauf
preuve contraire, la propri&#233;t&#233; de la personne physique ou morale sous le nom de laquelle elle est divulgu&#233;e. [. . . ] .</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MYRIADISATION DU TRAVAIL PARCELLIS&#201;
</p>
<p>5 Alternatives existantes ou propos&#233;es
</p>
<p>Comme indiqu&#233; ci-dessus, les objectifs principaux des d&#233;veloppeurs de ressources linguistiques faisant appel
&#224; MTurk sont l&#8217;obtention de r&#233;sultats de bonne qualit&#233;, &#224; un faible co&#251;t et dans un d&#233;lai tr&#232;s bref. Mais ces
objectifs ne sont pas n&#233;cessairement faciles &#224; atteindre avec MTurk, alors que des approches alternatives existent.
Tout d&#8217;abord, bien qu&#8217;une comparaison syst&#233;matique entre MTurk et des algorithmes &#233;tat-de-l&#8217;art impliquant un
&#233;chantillon vari&#233; de t&#226;ches li&#233;es au TAL reste &#224; faire, il semble que certains auteurs aboutissent &#224; la conclusion que
les annotateurs automatiques d&#233;j&#224; disponibles pour certaines t&#226;ches font aussi bien voire mieux que les Turkers
(Wais et al., 2010) : les outils automatiques peuvent faire mieux que les non experts. La r&#233;utilisation intelligente
de ressources existantes peut &#233;galement &#234;tre une alternative simple et peu co&#251;teuse &#224; MTurk. Enfin, MTurk n&#8217;est
qu&#8217;une des nombreuses possibilit&#233;s de m.t.p.
</p>
<p>5.1 Approches non supervis&#233;es et semi-supervis&#233;es pour le d&#233;veloppement de ressources
linguistiques &#224; faible co&#251;t
</p>
<p>La communaut&#233; du TAL s&#8217;int&#233;resse depuis longtemps &#224; des approches dites non supervis&#233;es d&#8217;apprentissage
automatique, pour un large &#233;ventail de t&#226;ches parfois complexes. De la segmentation en mots &#224; l&#8217;analyse syn-
taxique (H&#228;nig, 2010) en passant par l&#8217;annotation morphosyntaxique (Goldwater &amp; Griffiths, 2007), le d&#233;velop-
pement de ressources lexicales (y compris de niveau s&#233;mantique ou pragmatique, cf. (Pak &amp; Paroubek, 2010)) ou la
cat&#233;gorisation de documents, nombreuses sont les t&#226;ches pour lesquelles des techniques existent qui ne n&#233;cessitent
aucune ressource pr&#233;alable. Bien que les r&#233;sultats obtenus soient souvent inf&#233;rieurs aux r&#233;sultats des approches
supervis&#233;es (utilisant un corpus d&#8217;apprentissage) ou symboliques avanc&#233;es (utilisant des ressources symboliques
&#233;galement co&#251;teuses &#224; d&#233;velopper), on peut penser que, pour certaines t&#226;ches, ils ne sont pas inf&#233;rieurs &#224; ce que
l&#8217;on peut attendre de MTurk. C&#8217;est notamment le cas pour des t&#226;ches complexes comme l&#8217;analyse syntaxique.
</p>
<p>Pour am&#233;liorer &#224; faible co&#251;t la qualit&#233; des outils statistiques ainsi d&#233;velopp&#233;s et/ou pour les faire correspondre
&#224; des mod&#232;les pr&#233;existants (par exemple, &#224; un inventaire pr&#233;&#233;tabli de cat&#233;gories dans le cadre de l&#8217;annotation
morphosyntaxique), il n&#8217;est pas forc&#233;ment n&#233;cessaire de recourir &#224; des techniques totalement supervis&#233;es. Une
utilisation optimale d&#8217;un ensemble limit&#233; d&#8217;informations (annotations, ressources externes) peut donner de bons
r&#233;sultats : c&#8217;est le paradigme de l&#8217;apprentissage semi-supervis&#233; (Abney, 2007). Dans le cas du d&#233;veloppement de
ressources linguistiques, on peut identifier deux types (non mutuellement exclusifs) de semi-supervision.
</p>
<p>La premi&#232;re id&#233;e que l&#8217;on peut avoir est d&#8217;entra&#238;ner des mod&#232;les sur les quelques donn&#233;es annot&#233;es, puis d&#8217;an-
noter automatiquement les autres donn&#233;es : on peut alors choisir parmi les donn&#233;es annot&#233;es automatiquement
celles pour lesquelles le mod&#232;le a un niveau de confiance optimal, et les consid&#233;rer comme de nouvelles donn&#233;es
annot&#233;es pour l&#8217;apprentissage d&#8217;un nouveau mod&#232;le, et ainsi de suite : c&#8217;est le self-training, utilis&#233; en TAL depuis
longtemps (Yarowsky, 1995). Cette id&#233;e peut &#234;tre g&#233;n&#233;ralis&#233;e en utilisant deux mod&#232;les les plus diff&#233;rents pos-
sible, et &#224; compl&#233;ter les donn&#233;es d&#8217;apprentissage de l&#8217;un par les annotations automatiques les plus s&#251;res produites
par l&#8217;autre. C&#8217;est le co-training (Blum &amp; Mitchell, 1998), qui cherche &#224; &#233;liminer au maximum les biais sp&#233;ci-
fiques &#224; chaque mod&#232;le par la confrontation &#224; un autre. &#192; ce stade, on reste dans une situation o&#249; une annotation
manuelle peu co&#251;teuse sert de graine pour la construction successive, mais automatis&#233;e, de mod&#232;les qui vont en
s&#8217;am&#233;liorant, jusqu&#8217;&#224; obtenir des performances satisfaisantes. Si l&#8217;on accepte de continuer &#224; annoter des donn&#233;es
manuellement au cours des &#233;tapes de construction successive de mod&#232;les, on peut faire en sorte que soient choi-
sies et pr&#233;sent&#233;es aux annotateurs les donn&#233;es telles que disposer d&#8217;une annotation de r&#233;f&#233;rence pour elles soit de
nature &#224; am&#233;liorer au mieux la qualit&#233; des outils. C&#8217;est l&#8217;id&#233;e au c&#339;ur de l&#8217;active learning (Cohn et al., 1995).
</p>
<p>La deuxi&#232;me id&#233;e, combinable avec la premi&#232;re, consiste &#224; utiliser au mieux des donn&#233;es annot&#233;es d&#8217;une fa-
&#231;on moins compl&#232;te que l&#8217;annotation vis&#233;e. Par exemple, pour l&#8217;annotation morphosyntaxique, on peut disposer
d&#8217;un lexique externe mais pas d&#8217;un corpus d&#8217;apprentissage : projeter le lexique sur le corpus correspond alors
&#224; une annotation ambigu&#235;, qu&#8217;il faut d&#233;sambigu&#239;ser (Smith &amp; Eisner, 2005). Pour le d&#233;veloppement de lexiques
morphologiques, disposer d&#8217;une description formalis&#233;e de la morphologie de la langue permet l&#8217;utilisation de
techniques efficaces de suggestion d&#8217;entr&#233;es lexicales (Sagot, 2005). De m&#234;me, on peut chercher &#224; exploiter un
corpus partiellement parenth&#233;s&#233; pour guider des mod&#232;les d&#8217;analyse syntaxique complets (Watson et al., 2007).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. SAGOT K. FORT G. ADDA J. MARIANI B. LANG
</p>
<p>5.2 R&#233;utilisation de ressources existantes
</p>
<p>Moins co&#251;teux encore, la construction de ressources linguistiques peut se faire en r&#233;utilisant des ressources exis-
tantes. Consid&#233;rons par exemple la t&#226;che de d&#233;tection d&#8217;entit&#233;s nomm&#233;es. Nothman et al. (2008) montrent qu&#8217;il
est possible de transformer Wikipedia en une ressource annot&#233;e en entit&#233;s nomm&#233;es de large couverture et de
tr&#232;s bonne qualit&#233;. De tels corpus ont pourtant &#233;t&#233; construits au moyen de MTurk, notamment sur des corpus non
standard, en particulier m&#233;dicaux (Yetisgen-Yildiz et al., 2010), twitter (Finin et al., 2010), e-mails (Lawson et al.,
2010). Naturellement, ces corpus sont tr&#232;s diff&#233;rents de ce que l&#8217;on peut obtenir au moyen de Wikipedia. Mais la
taille des donn&#233;es extraites, ainsi que les caract&#233;ristiques de Wikipedia en tant que corpus, font que les d&#233;tecteurs
d&#8217;entit&#233;s nomm&#233;es entra&#238;n&#233;s sur un corpus construit &#224; partir de Wikipedia tendent &#224; avoir de tr&#232;s bons r&#233;sultats
lorsqu&#8217;ils sont utilis&#233;s sur d&#8217;autres types de corpus (Balasuriya et al., 2009).
</p>
<p>Il ne s&#8217;agit l&#224; que d&#8217;un exemple, mais nombreuses sont les ressources susceptibles de fournir des donn&#233;es de
toutes natures : Wikipedia 7 et autres projets wiki, notamment wiktionary, corpus (annot&#233;s ou non, oraux ou tex-
tuels) et ressources lexicales (phon&#233;tiques, morphologiques, syntaxiques, s&#233;mantiques), pour peu qu&#8217;elles soient
disponibles pour la communaut&#233;. Il s&#8217;agit ici d&#8217;un autre d&#233;bat, sur lequel nous n&#8217;insisterons donc pas plus avant.
</p>
<p>5.3 D&#233;veloppement collaboratif ou myriadis&#233; de ressources linguistiques au-del&#224; de MTurk
</p>
<p>Toutes les m&#233;thodes alternatives d&#233;crites jusqu&#8217;&#224; pr&#233;sent ont prouv&#233; leur utilit&#233; et leur efficacit&#233;, mais elles re-
qui&#232;rent des comp&#233;tences expertes, ne serait-ce que pour concevoir et d&#233;velopper les outils automatiques, mais
&#233;galement pour effectuer, si besoin est, les t&#226;ches d&#8217;annotation optimis&#233;es. Il existe des m&#233;thodes de d&#233;veloppe-
ment de ressources linguistiques qui ne font pas n&#233;cessairement appel &#224; des experts, sans &#234;tre pour autant touch&#233;es
par tous les probl&#232;mes d&#233;crits pour MTurk. Il s&#8217;agit en particulier des approches collaboratives, des approches lu-
diques mais &#233;galement de certaines plateformes de m.t.p., qui se sont donn&#233;es les moyens d&#8217;en &#233;viter les &#233;cueils.
</p>
<p>Les approches collaboratives de d&#233;veloppement de ressources lexicales reposent sur la strat&#233;gie mise en place
par le projet Wikipedia, les autres projets de la constellation Wikimedia, et d&#8217;autres types de wiki comme les
Semantic Wiki (Freebase, OntoWiki. . .). Diff&#233;rents participants volontaires, experts ou non, enrichissent progres-
sivement une m&#234;me ressource, soit sous forme d&#8217;annotations soit sous forme de bases de donn&#233;es (lexicales,
ontologiques. . .). C&#8217;est une premi&#232;re &#233;tape vers la m.t.p. : ici, le travail n&#8217;est pas parcellis&#233;, et il n&#8217;est que fai-
blement myriadis&#233;. Les annotations des uns sont &#171; contr&#244;l&#233;es &#187; par les autres, et des divergences de vues entre
diff&#233;rents participants se manifestent le plus souvent par des discussions, conduisant &#233;ventuellement &#224; ce que
l&#8217;administrateur tranche et d&#233;cide. C&#8217;est ainsi qu&#8217;un tr&#232;s haut niveau de qualit&#233; peut &#234;tre finalement atteint. Une
des premi&#232;res plateformes wiki d&#233;di&#233;e au d&#233;veloppement d&#8217;une ressource TAL est l&#8217;outil Serengeti, d&#233;velopp&#233;
&#224; l&#8217;Universit&#233; de Bielefeld (St&#252;renberg et al., 2007), &#224; des fins d&#8217;annotation s&#233;mantique des textes. Cet outil est
utilis&#233; actuellement dans le cadre du projet AnaWiki (http://www.anawiki.org).
</p>
<p>Toutefois, ces approches restent plus adapt&#233;es pour le d&#233;veloppement de ressources de taille raisonnable avec une
bonne qualit&#233; (gold standard). Elles sont moins indiqu&#233;es pour le d&#233;veloppement rapide de ressources &#224; grande
&#233;chelle. Une autre strat&#233;gie, qui repose &#233;galement sur le Web, est d&#8217;attirer de grand nombres de non experts au
moyen de jeux en ligne dits ayant un but (en anglais games with a purpose, ou GWAP). Cette id&#233;e, initi&#233;e par (von
Ahn, 2006; von Ahn &amp; Dabbish, 2008) avec le jeu en ligne ESP (http://www.espgame.org/) consiste &#224;
faire &#233;tiqueter des images par des joueurs qui rentrent en comp&#233;tition : ceux-ci re&#231;oivent des cr&#233;dits lorsque leurs
r&#233;ponses co&#239;ncident avec celles d&#8217;autres joueurs 8. ESP a connu un succ&#232;s important en mobilisant 13 500 utilisa-
teurs, cr&#233;ant 1, 3 million d&#8217;&#233;tiquettes dans les premiers mois suivant son apparition sur la Toile. Cette id&#233;e a &#233;t&#233; par
la suite d&#233;clin&#233;e pour divers types de t&#226;ches, y compris en TAL. Des exemples en sont le jeu JeuxDeMots (Lafour-
cade &amp; Joubert, 2008, http://www.lirmm.fr/jeuxdemots), qui vise &#224; collecter des relations entre mots,
et son alter ego PtiClic (ibid., http://www.lirmm.fr/pticlic), qui vise &#224; typer explicitement ces rela-
tions. Le jeu PhraseDetective (Chamberlain et al., 2008, http://www.phrasedetectives.org), quant
&#224; lui, a pour objectif l&#8217;annotation de liens anaphoriques, t&#226;che pourtant r&#233;put&#233;e complexe. L&#8217;id&#233;e est alors que
l&#8217;on peut aussi utiliser le jeu pour former les utilisateurs &#224; la t&#226;che. Phrase Detective comprend ainsi une phase
d&#8217;entra&#238;nement o&#249; l&#8217;on apprend la t&#226;che au nouveau joueur, par le biais de tests de plus en plus durs bas&#233;s sur un
petit ensemble de donn&#233;es venant de corpus existants (annot&#233;s par des experts).
</p>
<p>7. Il faut notamment citer le projet DBpedia (http://dbpedia.org), qui cherche &#224; extraire des informations ontologiques structur&#233;es
&#224; partir de Wikipedia, constituant ainsi une ressource aux potentialit&#233;s multiples et d&#233;j&#224; largement utilis&#233;e.
</p>
<p>8. Diff&#233;rentes proc&#233;dures sont pr&#233;vues pour exclure les utilisateurs malveillants, notamment le contr&#244;le des adresses IP, la v&#233;rification
al&#233;atoires des &#233;tiquetages pour des r&#233;ponses connues, etc. (von Ahn &amp; Dabbish, 2008)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MYRIADISATION DU TRAVAIL PARCELLIS&#201;
</p>
<p>Toutefois, la fronti&#232;re entre jeu de type GWAP et m.t.p. &#224; la MTurk n&#8217;est pas nette. On ne peut pas distinguer
facilement les GWAP, qui seraient plus ludiques, et MTurk, qui serait stricto sensu du travail : m&#234;me contribuer &#224;
Wikipedia est un travail, certes b&#233;n&#233;vole. On ne peut pas non plus distinguer les GWAP de MTurk en tant qu&#8217;ils
ne donneraient lieu &#224; aucune r&#233;compense tangible : certains jeux en ligne sont des GWAP mais proposent des
r&#233;mun&#233;rations non-mon&#233;taires (ainsi, PhraseDetective permet de gagner des bons &#224; d&#233;penser sur le site d&#8217;achat
en ligne Amazon). Enfin, on ne peut pas distinguer la m.t.p. &#224; la MTurk par le caract&#232;re &#171; &#233;thique &#187; des premiers.
Il existe en effet des alternatives &#224; MTurk pour d&#233;velopper des ressources linguistiques dans le paradigme de la
m.t.p., tout en &#233;vitant les &#233;cueils &#233;voqu&#233;s tout au long de cet article.
</p>
<p>Pour le recueil de donn&#233;es langagi&#232;res, en particulier pour les langues peu dot&#233;es, des alternatives &#224; MTurk
semblent &#234;tre plus appropri&#233;es. Ainsi, l&#8217;utilisation d&#8217;applications sur des t&#233;l&#233;phones portables de nouvelle g&#233;-
n&#233;ration est un moyen plus efficace de pouvoir acc&#233;der &#224; toute une population. Hughes et al. (2010) ont ainsi
embauch&#233; des locuteurs locaux et leur ont pr&#234;t&#233; des t&#233;l&#233;phones sur lesquels tournait une application d&#233;di&#233;e. Les
auteurs ont ainsi recueilli 3 000 heures en 17 langues. Un exemple de m.t.p. &#233;thique est Samasource, une ONG qui
utilise ce type de m&#233;thode pour faire effectuer des t&#226;ches 9 &#224; des personnes r&#233;ellement n&#233;cessiteuses form&#233;es et r&#233;-
mun&#233;r&#233;es &#233;quitablement selon des bar&#232;mes d&#233;pendant du pays. Il s&#8217;agit l&#224; d&#8217;une alternative &#233;thique &#224; l&#8217;utilisation
de MTurk qui permet &#233;galement de tirer parti des avantages de la m.t.p.
</p>
<p>5.4 Optimiser le co&#251;t de l&#8217;annotation manuelle : pr&#233;-annotation et interfaces d&#233;di&#233;es
</p>
<p>Ind&#233;pendamment de la fa&#231;on dont on s&#8217;en sert, l&#8217;annotation manuelle par des experts peut &#234;tre consid&#233;rable-
ment acc&#233;l&#233;r&#233;e voire am&#233;lior&#233;e au moyen d&#8217;outils d&#8217;annotation automatique utilis&#233;s comme pr&#233;-annotateurs. Par
exemple, Fort &amp; Sagot (2010) ont d&#233;montr&#233; que, dans le cas de l&#8217;&#233;tiquetage morphosyntaxique, une pr&#233;annotation,
m&#234;me de pi&#232;tre qualit&#233; et donc d&#233;veloppable &#224; faible co&#251;t, permet d&#8217;am&#233;liorer tr&#232;s largement le temps et la qualit&#233;
des annotations manuelles. Ainsi, les auteurs ont montr&#233; que 50 phrases annot&#233;es &#224; la main sans pr&#233;-annotation,
ce qui prend environ 40 minutes 10, permettent de construire un pr&#233;annotateur tel que la vitesse de l&#8217;annotation
manuelle par un expert est quasiment identique &#224; ce que l&#8217;on obtient avec un pr&#233;annotateur de niveau &#233;tat-de-
l&#8217;art, c&#8217;est-&#224;-dire que l&#8217;on peut construire un corpus complet de taille standard (10 000 phrases) en environ 6 000
minutes (100 heures). Des annotateurs experts et co&#251;teux, pour peu que leur travail soit pr&#233;par&#233; puis utilis&#233; de
fa&#231;on optimale, permettent donc le d&#233;veloppement de ressources de tr&#232;s bonne qualit&#233; &#224; un co&#251;t qui reste limit&#233;. &#192;
l&#8217;inverse, sur cette t&#226;che d&#8217;apparence simple, des Turkers seraient bien en peine de suivre correctement un guide
d&#8217;annotation d&#233;taill&#233;, n&#233;cessairement complexe s&#8217;il est linguistiquement s&#233;rieux.
</p>
<p>Par ailleurs, les remarques de Tratz &amp; Hovy (2010) mentionn&#233;es ci-dessus concernant les limitations des interfaces
d&#233;ployables dans MTurk s&#8217;appliquent de mani&#232;re g&#233;n&#233;rale. L&#8217;exp&#233;rience acquise, par exemple, dans le d&#233;velop-
pement de corpus annot&#233;s syntaxiquement ou s&#233;mantiquement montre que la rapidit&#233; et la qualit&#233; l&#8217;annotation, de
quelque nature qu&#8217;elle soit, est fortement influenc&#233;e par l&#8217;interface d&#8217;annotation elle-m&#234;me (cf. par exemple (Erk
et al., 2003)). Il y a donc l&#224; aussi mati&#232;re &#224; acc&#233;l&#233;rer et am&#233;liorer toute &#233;tape d&#8217;annotation manuelle, au point
qu&#8217;une interface adapt&#233;e &#224; une t&#226;che donn&#233;e pourrait permettre de r&#233;duire les co&#251;ts dans des proportions compa-
rables &#224; celles obtenues par l&#8217;utilisation de MTurk, sans en pr&#233;senter les inconv&#233;nients.
</p>
<p>6 Conclusion et perspectives
</p>
<p>MTurk illustre la complexit&#233; et la difficult&#233; d&#8217;appr&#233;hender les relations (commerciales, de travail et autres) dans
les nouveaux modes d&#8217;activit&#233;s sur Internet. Les chercheurs qui ont utilis&#233; MTurk l&#8217;ont fait souvent de bonne foi,
par manque de moyens financiers, pour produire plus de donn&#233;es et les redistribuer &#224; la communaut&#233;. Pour ceux
qui ont eu des doutes sur de possibles probl&#232;mes d&#8217;&#233;thique et de droit du travail, une recherche superficielle les a
convaincus que MTurk est une sorte d&#8217;avatar de Wikipedia, et que les Turkers sont motiv&#233;s surtout par le plaisir
d&#8217;effectuer des t&#226;ches amusantes.
</p>
<p>Nous pensons avoir montr&#233; que MTurk n&#8217;est pas une panac&#233;e et que d&#8217;autres solutions existent aujourd&#8217;hui pour
r&#233;duire les co&#251;ts de construction de ressources linguistiques de qualit&#233;, tout en respectant ceux qui travaillent sur
ces ressources et en tirant un meilleur parti de leurs comp&#233;tences. Car derri&#232;re le d&#233;bat autour de MTurk se trouve
</p>
<p>9. Comme traduire des SMS en cr&#233;ole, lors du tremblement de terre &#224; Ha&#239;ti afin de permettre aux secours internationaux d&#8217;aller &#224; leur
secours, en liaison avec le site CrowdFlower. http://www.samasource.org/haiti/.
</p>
<p>10. Les estimations propos&#233;es dans ce paragraphe, tr&#232;s grossi&#232;res, reposent sur celles de (Fort &amp; Sagot, 2010).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. SAGOT K. FORT G. ADDA J. MARIANI B. LANG
</p>
<p>finalement la question de la consid&#233;ration due aux annotateurs, aux traducteurs, aux sp&#233;cialistes de la transcription.
</p>
<p>Nous aimerions, en conclusion, aller au-del&#224; des faits actuels et mettre l&#8217;accent sur les cons&#233;quences &#224; plus ou
moins long terme de cette &#171; mode &#187;. En effet, sous la pression de ce type de syst&#232;mes &#224; bas co&#251;t, les agences de
moyens pourraient bient&#244;t &#234;tre plus r&#233;ticentes &#224; financer des projets de d&#233;veloppement de ressources linguistiques
&#224; des co&#251;ts &#171; normaux &#187; (ou plut&#244;t r&#233;alistes). Le co&#251;t &#224; la MTurk deviendrait alors une norme de fait et nous
n&#8217;aurions plus le choix de nos m&#233;thodes de d&#233;veloppement.
</p>
<p>Nous avons vu, dans la partie 5.3, qu&#8217;un syst&#232;me de m.t.p. peut permettre de faire produire des t&#226;ches r&#233;mun&#233;r&#233;es
en pr&#233;servant l&#8217;&#233;thique, cela peut m&#234;me &#234;tre une chance pour des personnes qui ne peuvent se trouver sur le
march&#233; du travail, de par leur isolement, leur handicap, etc ; mais cela n&#233;cessite un encadrement l&#233;gal strict afin de
s&#8217;assurer que ce syst&#232;me n&#8217;est pas une remise en cause des droits des travailleurs. On peut penser &#224; moyen terme
au d&#233;veloppement d&#8217;une plateforme m.t.p. op&#233;r&#233;e par les acteurs de recherche au niveau europ&#233;en, et un guide des
bonnes pratiques concernant l&#8217;utilisation des m.t.p., comme cela se fait dans d&#8217;autres secteurs de recherches, par
exemple en sciences sociales. Mais ces solutions risquent de ne pas freiner le d&#233;veloppement actuel de l&#8217;utilisation
de MTurk, au nom du &#8220;pragmatisme&#8221; et de la concurrence avec les &#233;quipes (par exemple) outre-Atlantique ; c&#8217;est
pourquoi nous proposons la cr&#233;ation d&#8217;un label de qualit&#233; et d&#8217;&#233;thique, qui pourrait &#234;tre d&#233;cern&#233; aux ressources
par les associations savantes concern&#233;es, l&#8217;ATALA 11 pour le TAL et l&#8217;AFCP 12 pour la parole. Les questions
d&#8217;&#233;thique sont d&#232;s &#224; pr&#233;sent un crit&#232;re de s&#233;lection pour les projets europ&#233;ens, ce label permettrait de pr&#233;ciser le
statut des ressources comme crit&#232;re de s&#233;lection pour l&#8217;ensemble des agences de moyens, tout en valorisant les
bonnes pratiques de d&#233;veloppement.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; r&#233;alis&#233; en partie dans le cadre du programme Quaero, financ&#233; par OSEO, agence nationale de
valorisation de la recherche, et dans celui du projet ANR EDyLex (ANR-09-CORD-008).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABNEY S. (2007). Semisupervised Learning for Computational Linguistics. Chapman &amp; Hall/CRC, 1&#232;re edition.
ADDA G. &amp; MARIANI J. (2010). Language resources and amazon mechanical turk : legal, ethical and other
issues. In LISLR2010, &#8220;Legal Issues for Sharing Language Resources workshop&#8221;, LREC2010.
AKERLOF G. A. (1970). The market for &#8217;lemons&#8217; : Quality uncertainty and the market mechanism. Quarterly
Journal of Economics, 84(3), 488&#8211;500.
BALASURIYA D., RINGLAND N., NOTHMAN J., MURPHY T. &amp; CURRAN J. R. (2009). Named entity recog-
nition in wikipedia. In People&#8217;s Web &#8217;09 : Proceedings of the 2009 Workshop on The People&#8217;s Web Meets NLP,
p. 10&#8211;18, Morristown, NJ, USA : Association for Computational Linguistics.
BHARDWAJ V., PASSONNEAU R., SALLEB-AOUISSI A. &amp; IDE N. (2010). Anveshan : A tool for analysis of
multiple annotators&#8217; labeling behavior. In Proceedings of The fourth linguistic annotation workshop (LAW IV),
Uppsala, Su&#232;de.
BIADSY F., HIRSCHBERG J. &amp; FILATOVA E. (2008). An unsupervised approach to biography production using
Wikipedia. In Proceedings of ACL 2008, p. 807&#8211;815 : Association for Computational Linguistics.
BIEWALD L. (2010). Better crowdsourcing through automated methods for quality control. SIGIR 2010 Work-
shop on Crowdsourcing for Search Evaluation.
BLUM A. &amp; MITCHELL T. (1998). Combining labeled and unlabeled data with co-training. In COLT : Procee-
dings of the Workshop on Computational Learning Theory : Morgan Kaufmann Publishers.
CALLISON-BURCH C. &amp; DREDZE M. (2010). Creating speech and language data with amazon&#8217;s mechanical
turk. In CSLDAMT &#8217;10 : Proceedings of the NAACL HLT 2010 Workshop on Creating Speech and Language
Data with Amazon&#8217;s Mechanical Turk, Morristown, NJ, USA : Association for Computational Linguistics.
CHAMBERLAIN J., POESIO M. &amp; KRUSCHWITZ U. (2008). Phrase Detectives : a Web-based Collaborative
Annotation Game. In Proceedings of the International Conference on Semantic Systems (I-Semantics&#8217;08), Graz.
</p>
<p>11. http://www.atala.org/
12. http://www.afcp-parole.org/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MYRIADISATION DU TRAVAIL PARCELLIS&#201;
</p>
<p>COHN D. A., GHAHRAMANI Z. &amp; JORDAN M. I. (1995). Active learning with statistical models. In G.
TESAURO, D. TOURETZKY &amp; T. LEEN, Eds., Advances in Neural Information Processing Systems, volume 7,
p. 705&#8211;712 : The MIT Press.
</p>
<p>COOK P. &amp; STEVENSON S. (2010). Automatically identifying changes in the semantic orientation of words.
In N. C. C. CHAIR), K. CHOUKRI, B. MAEGAARD, J. MARIANI, J. ODIJK, S. PIPERIDIS, M. ROSNER &amp;
D. TAPIAS, Eds., Proceedings of the Seventh conference on International Language Resources and Evaluation
(LREC&#8217;10) : European Language Resources Association (ELRA).
</p>
<p>ERK K., KOWALSKI A. &amp; PADO S. (2003). The salsa annotation tool. In D. DUCHIER &amp; G.-J. M. KRUIJFF,
Eds., Proceedings of the Workshop on Prospects and Advances in the Syntax/Semantics Interface, Nancy, France.
</p>
<p>FININ T., MURNANE W., KARANDIKAR A., KELLER N., MARTINEAU J. &amp; DREDZE M. (2010). Annotating
named entities in twitter data with crowdsourcing. In Proceedings of the NAACL HLT 2010 Workshop on Crea-
ting Speech and Language Data with Amazon&#8217;s Mechanical Turk, CSLDAMT &#8217;10, p. 80&#8211;88, Stroudsburg, PA,
USA : Association for Computational Linguistics.
</p>
<p>FORT K., ADDA G. &amp; COHEN K. B. (2011). Amazon mechanical turk : Gold mine or coal mine ? Computatio-
nal Linguistics (editorial), 37(2).
FORT K. &amp; SAGOT B. (2010). Influence of Pre-annotation on POS-tagged Corpus Development. In Proc. of the
Fourth ACL Linguistic Annotation Workshop, Uppsala, Su&#232;de.
</p>
<p>GILLICK D. &amp; LIU Y. (2010). Non-expert evaluation of summarization systems is risky. In Proceedings of
the NAACL HLT 2010 Workshop on Creating Speech and Language Data with Amazon&#8217;s Mechanical Turk,
CSLDAMT &#8217;10, p. 148&#8211;151, Stroudsburg, PA, USA : Association for Computational Linguistics.
</p>
<p>GOLDWATER S. &amp; GRIFFITHS T. (2007). A fully bayesian approach to unsupervised part-of-speech tagging. In
Proceedings of ACL, Prague, R&#233;publique tch&#232;que.
</p>
<p>H&#196;NIG C. (2010). Improvements in unsupervised co-occurrence based parsing. In Proceedings of the Four-
teenth Conference on Computational Natural Language Learning, CoNLL &#8217;10, p. 1&#8211;8, Stroudsburg, PA, USA :
Association for Computational Linguistics.
</p>
<p>HUGHES T., NAKAJIMA K., HA L., VASU A., MORENO P. &amp; LEBEAU M. (2010). Building transcribed speech
corpora quickly and cheaply for many languages. In Proceedings of Interspeech, p. 1914&#8211;1917.
</p>
<p>IPEIROTIS P. (2010a). Analyzing the amazon mechanical turk marketplace. CeDER Working Papers,
http ://hdl.handle.net/2451/29801. CeDER-10-04.
</p>
<p>IPEIROTIS P. (2010b). Demographics of mechanical turk. CeDER Working Papers,
http ://hdl.handle.net/2451/29585. CeDER-10-01.
</p>
<p>IPEIROTIS P. (2010c). A plea to amazon : Fix mechanical turk ! http ://behind-the-enemy-
lines.blogspot.com/2010/10/plea-to-amazon-fix-mechanical-turk.html.
</p>
<p>KAISSER M. &amp; LOWE J. B. (2008). Creating a research collection of question answer sentence pairs with
amazon&#8217;s mechanical turk. In Proceedings of the International Language Resources and Evaluation (LREC-
2008).
</p>
<p>KOCHHAR S., MAZZOCCHI S. &amp; PARITOSH P. (2010). The anatomy of a large-scale human computation
engine. In Proceedings of Human Computation Workshop at the 16th ACM SIKDD Conference on Knowledge
Discovery and Data Mining, KDD 2010, Washington D.C.
</p>
<p>LAFOURCADE M. &amp; JOUBERT A. (2008). JeuxDeMots : un prototype ludique pour l&#8217;&#233;mergence de relations
entre termes. In JADT&#8217;08 : Journ&#233;es internationales d&#8217;Analyse statistiques des Donn&#233;es Textuelles, p. 657&#8211;666.
</p>
<p>LAMBERT B., SINGH R. &amp; RAJ B. (2010). Creating a linguistic plausibility dataset with non-expert annotators.
In Proceedings of Interspeech, p. 1906&#8211;1909.
</p>
<p>LAWSON N., EUSTICE K., PERKOWITZ M. &amp; YETISGEN-YILDIZ M. (2010). Annotating large email datasets
for named entity recognition with mechanical turk. In Proceedings of the NAACL HLT 2010 Workshop on
Creating Speech and Language Data with Amazon&#8217;s Mechanical Turk, CSLDAMT &#8217;10, p. 71&#8211;79, Stroudsburg,
PA, USA : Association for Computational Linguistics.
</p>
<p>MARGE M., BANERJEE S. &amp; RUDNICKY A. I. (2010). Using the amazon mechanical turk for transcription of
spoken language. In IEEE International Conference on Acoustics Speech and Signal Processing (ICASSP), p.
5270&#8211;5273, Dallas, TX.
</p>
<p>MCGRAW I., YING LEE C., HETHERINGTON L., SENEFF S. &amp; GLASS J. (2010). Collecting voices from the
cloud. In Proceedings of the International Language Resources and Evaluation (LREC-2010), p. 1576&#8211;1583.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. SAGOT K. FORT G. ADDA J. MARIANI B. LANG
</p>
<p>NOTHMAN J., CURRAN J. R. &amp; MURPHY T. (2008). Transforming Wikipedia into Named Entity Training
Data. In Proceedings of the Australian Language Technology Workshop, p. 124&#8211;132.
</p>
<p>NOVOTNEY S. &amp; CALLISON-BURCH C. (2010). Cheap, fast and good enough : automatic speech recognition
with non-expert transcription. In Human Language Technologies : The 2010 Annual Conference of the North
American Chapter of the Association for Computational Linguistics, HLT &#8217;10, p. 207&#8211;215, Stroudsburg, PA,
USA : Association for Computational Linguistics.
</p>
<p>PAK A. &amp; PAROUBEK P. (2010). Twitter as a corpus for sentiment analysis and opinion mining. In Proceedings
of the Seventh conference on International Language Resources and Evaluation (LREC&#8217;10), La Valette, Malte :
European Language Resources Association (ELRA).
</p>
<p>ROSS J., IRANI L., SILBERMAN M. S., ZALDIVAR A. &amp; TOMLINSON B. (2010). Who are the crowdworkers ? :
shifting demographics in mechanical turk. In Proceedings of the 28th of the international conference extended
abstracts on Human factors in computing systems, CHI EA &#8217;10, p. 2863&#8211;2872, New York, NY, USA : ACM.
</p>
<p>ROSS J., ZALDIVAR A., IRANI L. &amp; TOMLINSON B. (2009). Who are the turkers ? worker demographics in
amazon mechanical turk. Social Code Report 2009-01, http ://www.ics.uci.edu/ jwross/pubs/SocialCode-2009-
01.pdf.
</p>
<p>SAGOT B. (2005). Automatic acquisition of a Slovak lexicon from a raw corpus. In Lecture Notes in Artificial
Intelligence 3658 ((c) Springer-Verlag), Proceedings of TSD&#8217;05, p. 156&#8211;163, Karlovy Vary, R&#233;publique tch&#232;que.
</p>
<p>SMITH N. &amp; EISNER J. (2005). Contrastive estimation : Training log-linear models on unlabeled data. In
Proceedings of the 43th Annual Meeting of the Association for Computational Linguistics (ACL&#8217;05), p. 354&#8211;362,
nn Arbor, Michigan, USA.
</p>
<p>SNOW R., O&#8217;CONNOR B., JURAFSKY D. &amp; NG. A. Y. (2008). Cheap and fast - but is it good ? evaluating
non-expert annotations for natural language tasks. In Proceedings of EMNLP 2008, p. 254&#8211;263.
</p>
<p>ST&#220;RENBERG M., GOECKE D., DIE-WALD N., CRAMER I. &amp; MEHLER A. (2007). Web-based annotation of
anaphoric relations and lexical chains. In ACL Workshop on Linguistic Annotation Workshop (LAW), Prague,
R&#233;publique tch&#232;que.
</p>
<p>TRATZ S. &amp; HOVY E. (2010). A taxonomy, dataset, and classifier for automatic noun compound interpreta-
tion. In Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics, p. 678&#8211;687,
Uppsala, Su&#232;de : Association for Computational Linguistics.
</p>
<p>VON AHN L. (2006). Games with a purpose. IEEE Computer Magazine, p. 96&#8211;98.
</p>
<p>VON AHN L. &amp; DABBISH L. (2008). General techniques for designing games with a purpose. Communications
of the ACM, p. 58&#8211;67.
</p>
<p>WAIS P., LINGAMNENI S., COOK D., FENNELL J., GOLDENBERG B., LUBAROV D., MARIN D. &amp; SIMONS
H. (2010). Towards building a high-qualityworkforce with mechanical turk. In Proceedings of Computational
Social Science and the Wisdom of Crowds (NIPS).
</p>
<p>WATSON R., BRISCOE T. &amp; CARROLL J. (2007). Semi-supervised training of a statistical parser from unlabeled
partially-bracketed data. In Proceedings of the 10th International Conference on Parsing Technologies, IWPT
&#8217;07, p. 23&#8211;32, Stroudsburg, PA, USA : Association for Computational Linguistics.
</p>
<p>WELINDER P., BRANSON S., BELONGIE S. &amp; PERONA P. (2010). The multidimensional wisdom of crowds.
In Neural Information Processing Systems Conference (NIPS).
</p>
<p>XU F. &amp; KLAKOW D. (2010). Paragraph acquisition and selection for list question using amazon&#8217;s mechanical
turk. In Proceedings of the International Language Resources and Evaluation (LREC-2010), p. 2340&#8211;2345, La
Valette, Malte.
</p>
<p>YAROWSKY D. (1995). Unsupervised word sense disambiguation rivaling supervised methods. In Proceedings
of the 33rd Annual Meeting of the Association for Computational Linguistics, p. 189&#8211;196, Cambridge, MA.
</p>
<p>YETISGEN-YILDIZ M., SOLTI I., XIA F. &amp; HALGRIM S. R. (2010). Preliminary experience with amazon&#8217;s
mechanical turk for annotating medical named entities. In Proceedings of the NAACL HLT 2010 Workshop on
Creating Speech and Language Data with Amazon&#8217;s Mechanical Turk, CSLDAMT &#8217;10, p. 180&#8211;183, Stroudsburg,
PA, USA : Association for Computational Linguistics.
</p>
<p>ZITTRAIN J. (2008). Ubiquitous human computing. Phil. Trans. R. Soc. A 28, 366(1881), 3813&#8211;3821.</p>

</div></div>
</body></html>