<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Calcul de r&#233;seaux phrastiques pour l&#8217;analyse et la navigation textuelle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Calcul de r&#233;seaux phrastiques pour
l&#8217;analyse et la navigation textuelle
</p>
<p>Dominique Legallois1 Peggy Cellier2 Thierry Charnois3
(1) CRISCO Universit&#233; de Caen Basse-Normandie, Campus 1, 14000 Caen
</p>
<p>(2) IRISA-INSA de Rennes, Campus Beaulieu 35042 Rennes cedex
(3) GREYC Universit&#233; de Caen Basse-Normandie, Campus 2, 14000 Caen
</p>
<p>R&#233;sum&#233;. Le travail pr&#233;sente une m&#233;thode de navigation dans les textes, fond&#233;e sur la r&#233;p&#233;tition lexicale.
La m&#233;thode choisie est celle d&#233;velopp&#233;e par le linguiste Hoey. Son application manuelle &#224; des textes de grandeur
cons&#233;quente est probl&#233;matique. Nous proposons dans cet article un processus automatique qui permet d&#8217;analyser
selon cette m&#233;thode des textes de grande taille ; des exp&#233;riences ont &#233;t&#233; men&#233;es appliquant le processus &#224; diff&#233;rents
types de textes (narratif, expositif) et montrant l&#8217;int&#233;r&#234;t de l&#8217;approche.
</p>
<p>Abstract. In this paper, we present an automatic process based on lexical repetition introduced by Hoey.
The application of that kind of approaches on large texts is difficult to do by hand. In the paper, we propose an
automatic process to treat large texts. We have conducted some experiments on different kinds of texts (narrative,
expositive) to show the benefits of the approach.
</p>
<p>Mots-cl&#233;s : R&#233;seau phrastique, Appariement de phrases, Analyse textuelle, Navigation textuelle.
</p>
<p>Keywords: Sentence network, Bonds between sentences, Textual analysis, Textual navigation.
</p>
<p>1 Introduction
</p>
<p>Notre travail propose une analyse des textes, fond&#233;e &#224; la fois sur la &#171; r&#233;duction textuelle &#187; et la r&#233;p&#233;tition lexi-
cale. Nous nous inspirons du mod&#232;le linguistique de Hoey (Hoey, 1991). Par &#171; r&#233;duction &#187;, nous entendons une
m&#233;thode linguistique qui vise &#224; d&#233;terminer dans un texte, quelles sont les phrases les plus pertinentes information-
nellement. L&#8217;ensemble de ces phrases d&#233;lest&#233; des phrases informationnellement marginales, constitue un ensemble
th&#233;oriquement coh&#233;rent. Contrairement aux travaux sur les r&#233;sum&#233;s automatiques, 1 nous d&#233;finissons une m&#233;thode
qui s&#8217;inscrit dans une d&#233;marche exp&#233;rimentale visant, en m&#234;me temps, &#224; mieux comprendre l&#8217;organisation tex-
tuelle et &#224; proposer un mode de navigation. Nous ne connaissons que peu d&#8217;analyses linguistiques proposant une
telle d&#233;marche. Outre Hoey, mentionnons les travaux de Thomas (Thomas, 1999) dont l&#8217;analyse est fond&#233;e sur la
pro&#233;minence s&#233;mantique des propositions, et de Toolan (Toolan, 2009) qui travaille exclusivement sur les textes
narratifs afin de conserver les phrases constituants les n&#339;uds importants de l&#8217;histoire. Le mod&#232;le de Hoey, que
nous avons appliqu&#233; au fran&#231;ais (Legallois, 2004, 2006), ne prend en compte que les textes expositifs (par ex. les
textes scientifiques, philosophiques) et exclut en principe le genre narratif 2. De plus, les appariements de phrases
ayant des lex&#232;mes en commun ne peuvent &#234;tre rep&#233;r&#233;s que sur des textes courts. En effet, l&#8217;application manuelle
de la m&#233;thode sur des textes de plusieurs milliers de lignes est extr&#234;mement probl&#233;matique.
</p>
<p>Dans cet article, nous proposons d&#8217;impl&#233;menter l&#8217;adaptation au fran&#231;ais de la m&#233;thode de Hoey dans un processus
automatis&#233; afin de pouvoir analyser des corpus vari&#233;s en genre et en taille. Cette mise en &#339;uvre informatique per-
met notamment au linguiste d&#8217;observer et de tester l&#8217;application du mod&#232;le en corpus. L&#8217;impl&#233;mentation concerne
uniquement la r&#233;p&#233;tition lexicale au sens strict (i.e., le m&#234;me lemme), qui constitue, d&#8217;apr&#232;s nos observations,
le cas de r&#233;p&#233;tition le plus fr&#233;quent. La r&#233;p&#233;tition par anaphore et la synonymie ne sont pas prises en compte 3.
Toutefois, cette limitation n&#8217;entrave en rien la pertinence du mod&#232;le pour la recherche en linguistique comme les
exp&#233;riences le montrent. Dans la suite de l&#8217;article nous pr&#233;sentons le mod&#232;le linguistique (Section 2). Puis nous
</p>
<p>1. Cf. (Knight &amp; Marcu, 2002) ou les r&#233;cents syst&#232;mes pr&#233;sent&#233;s aux comp&#233;titions TAC 2008-2010 (www.nist.gov/tac/tracks/)
2. Nous verrons plus bas que nous avons fait une entorse &#224; ce principe.
3. Dans l&#8217;&#233;tat actuel des techniques, l&#8217;identification de la r&#233;p&#233;tition par anaphore reste un probl&#232;me non r&#233;solu sur un texte long.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DOMINIQUE LEGALLOIS, PEGGY CELLIER, THIERRY CHARNOIS
</p>
<p>discutons les exp&#233;riences que nous avons men&#233;es sur diff&#233;rents types de textes : narratifs et expositifs (Section3).
</p>
<p>2 Mod&#232;le linguistique
</p>
<p>Dans cette section nous rappelons le mod&#232;le linguistique pr&#233;sent&#233; dans (Legallois, 2006) en donnant quelques
exemples. La m&#233;thode consiste &#224; identifier les phrases d&#8217;un texte qui partagent au moins trois unit&#233;s lexicales,
aussi appel&#233;es lex&#232;mes (par ex. : nom, verbe, adjectif, adverbe). Ce partage est fond&#233; sur le concept de r&#233;p&#233;tition
lexicale : r&#233;p&#233;tition &#224; l&#8217;identique de mots (ch&#244;mage/ch&#244;mage) ou sous une forme &#171; d&#233;riv&#233;e &#187; (travail/travailler),
mais aussi reprise anaphorique, synonymique (meurtre/assassinat), hypo/hyperonymie (v&#233;g&#233;tal/tulipe), relation
&#171; implicative &#187; (conduire/voiture), suite ordonn&#233;e (lundi/mardi/...). Le principe P s&#8217;applique alors :
</p>
<p>P : si une phrase d&#8217;un texte non narratif partage aumoins trois lex&#232;mes avec une ou plusieurs autres phrases
du m&#234;me texte quel que soit l&#8217;empan entre ces phrases &#8211; alors la suite de ces phrases sera coh&#233;rente, c&#8217;est-
&#224;-dire interpr&#233;table dans le contexte d&#233;velopp&#233; par le texte.
</p>
<p>Lorsque deux phrases partagent au moins trois lex&#232;mes, on dit qu&#8217;il y a appariement entre ces phrases. Consid&#233;-
rons un appariement entre deux phrases comme un chemin entre elles. On appelle r&#233;seau phrastique un ensemble
d&#8217;au moins trois phrases tel que quelles que soient deux phrases de ce r&#233;seau, on peut trouver une succession
de chemins menant de l&#8217;une &#224; l&#8217;autre. On appelle hypotexte l&#8217;ensemble des r&#233;seaux phrastiques. Notons que les
phrases marginales, c&#8217;est-&#224;-dire ne participant &#224; aucun appariement, n&#8217;apparaissent pas dans l&#8217;hypotexte. L&#8217;hy-
potexte constitue une r&#233;duction du texte. Nous donnons ci-dessous un exemple de r&#233;seau phrastique trait&#233; dans
(Legallois, 2004) portant sur un article de plus d&#8217;une centaine de phrases 4. La num&#233;rotation correspond &#224; l&#8217;ordre
des phrases dans le texte int&#233;gral ; on voit donc que l&#8217;empan de ce r&#233;seau est tr&#232;s cons&#233;quent :
</p>
<p>[1] &#171; un faisceau de lumi&#232;re envoy&#233; par un projecteur sur la sc&#232;ne obscure d&#8217;un th&#233;&#226;tre1, celui de
l&#8217;inconscient2 &#187; : cette m&#233;taphore3, couramment employ&#233;e pour d&#233;crire la conscience4, d&#233;coule directement
du postulat5 fondateur6 de la psychologie cognitive7.
[30] Pour expliquer les contenus de la conscience4, il faut donc comprendre la pi&#232;ce1 qui se joue au plus
profond de notre inconscient2.
[90] Le mod&#232;le3 initial du &quot;th&#233;&#226;tre1 de la conscience4&quot; postule5, nous l&#8217;avons dit, que cette derni&#232;re est
d&#233;pourvue de toute fonction dans la dynamique de l&#8217;apprentissage implicite.
[99] [Mais] La m&#233;taphore3 de la conscience4, simple spectateur d&#8217;une pi&#232;ce1 dont l&#8217;inconscient4 serait l&#8217;au-
teur et le metteur en sc&#232;ne1, a-t-elle encore lieu d&#8217;&#234;tre ?
[106] La remise en question d&#8217;une vie mentale inconsciente4 s&#8217;oppose en effet non seulement aux prin-
cipes5 fondateurs6 de la psychologie cognitive7, mais, au-del&#224;, &#224; une conception qui est devenue quasi-
universellement accept&#233;e dans le grand public par la banalisation des conceptions d&#8217;inspiration psychanaly-
tique.
</p>
<p>Ce r&#233;seau est tout &#224; fait interpr&#233;table avec quelques &#171; am&#233;nagements &#187; mineurs. En effet, dans l&#8217;exemple certains
mots sont barr&#233;s (par ex. en effet), et d&#8217;autres mis entre crochets (par ex. [Mais]). Il s&#8217;agit d&#8217;une restitution de
certaines formes dont se dispensait pour des raisons normatives, la coh&#233;sion locale du texte initial. Cette restitution
permet en outre de faciliter la lecture des encha&#238;nements phrastiques du r&#233;seau. L&#8217;ensemble des r&#233;seaux pour ce
texte forme donc un hypotexte constitu&#233; de 40% du nombre total des phrases.
</p>
<p>3 Mise en &#339;uvre informatique et r&#233;sultats
</p>
<p>3.1 Textes et outils
</p>
<p>Textes Afin de tester la pertinence de la m&#233;thode et avoir un premier retour sur le mod&#232;le, nous avons choisi
d&#8217;utiliser, pour nos exp&#233;riences, des textes vari&#233;s en genre (2 textes narratifs et 2 textes expositifs), en taille (de
108 phrases pour le plus petit &#224; 6075 phrases pour le plus grand) et d&#8217;&#233;poques diff&#233;rentes (de la fin du 19e si&#232;cle au
d&#233;but du 21e). La table 1 d&#233;taille ces caract&#233;ristiques. Notons que pour les exp&#233;riences, les phrases sont d&#233;crites
par les lex&#232;mes qui les composent. Les gramm&#232;mes, par exemple les pr&#233;positions et articles, ne sont pas conserv&#233;s.
</p>
<p>4. Article de Pierre Perruchet paru dans La Recherche, juillet-aout 2003</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CALCUL DE R&#201;SEAUX PHRASTIQUES POUR L&#8217;ANALYSE ET LA NAVIGATION TEXTUELLE
</p>
<p>Titre Auteur Ann&#233;e Genre Nb de phrases
Le crime, ph&#233;nom&#232;ne normal &#201;mile Durkheim 1894 Epositif 108
Jeunes cherchent place Nicole Bald&#233;-Georgin 2000 Expositif 2713
J&#8217;irai cracher sur vos tombes Boris Vian 1946 Narratif 3030
M&#233;moires de Guerre (Tome 2) G&#233;n&#233;ral de Gaulle 1956 Narratif 6075
</p>
<p>TABLE 1 &#8211; Caract&#233;ristiques des textes utilis&#233;s pour les exp&#233;riences.
</p>
<p>De plus, pour optimiser la d&#233;couverte des appariements, ce ne sont pas les mots eux-m&#234;mes mais leurs lemmes
qui sont utilis&#233;s dans la description des phrases. Nous utilisons le cat&#233;goriseur Cordial pour cette t&#226;che 5.
</p>
<p>Visualisation des r&#233;seaux phrastiques Les r&#233;seaux phrastiques sont des graphes dont les n&#339;uds sont les
phrases du texte et les arcs relient les phrases appari&#233;es. Les arcs sont &#233;tiquet&#233;s par les lex&#232;mes qui sont com-
muns aux phrases. Les r&#233;seaux sont visualis&#233;s dans un outil d&#8217;affichage de graphes d&#233;velopp&#233; en java. Notons que
le calcul des appariements se fait par intersection d&#8217;ensembles de lex&#232;mes qui composent les phrases. Un exemple
est donn&#233; &#224; la figure 1. Sur cet exemple on voit une partie d&#8217;un r&#233;seau phrastique issu du texte Jeunes cherchent
place de Nicole Bald&#233;-Georgin. On y voit les quatre phrases contenant les mots adulte, social et espace. Notons
que les quatres phrases contiennent &#233;galement toutes les mots jeune et &#234;tre. Une analyse textuelle plus d&#233;taill&#233;e
est donn&#233;e &#224; la section 3.2.
</p>
<p>FIGURE 1 &#8211; Visualisation d&#8217;une partie d&#8217;un r&#233;seau phrastique extrait de l&#8217;essai de Nicole Bald&#233;-Georgin.
</p>
<p>Navigation dans les appariements Parfois les r&#233;seaux phrastiques sont tr&#232;s grands rendant leur affichage dif-
ficile &#224; analyser. Afin d&#8217;explorer de larges textes en recherchant les phrases contenant des mots en commun nous
avons utilis&#233; Abilis (Allard et al., 2010), un syst&#232;me d&#8217;information qui s&#8217;appuye sur la th&#233;orie de l&#8217;analyse de
concepts logique (Ferr&#233; &amp; Ridoux, 2004). Ce genre de syst&#232;me permet non seulement de naviguer dans les des-
criptions d&#8217;objets mais aussi d&#8217;&#233;laborer des requ&#234;tes complexes. Dans notre application les objets sont les phrases.
Chaque phrase est d&#233;crite par l&#8217;ensemble des lex&#232;mes qui la constituent. La premi&#232;re fen&#234;tre (en haut) du syst&#232;me
d&#8217;information permet de faire une requ&#234;te et de s&#233;lectionner ainsi toutes les phrases v&#233;rifiant cette requ&#234;te. Dans
l&#8217;exemple de la figure 2 montrant le tome 2 des m&#233;moires du G&#233;n&#233;ral de Gaulle, la requ&#234;te s&#233;lectionne toutes les
phrases contenant le mot juif 6. Le r&#233;sultat de la requ&#234;te (3 phrases) apparait dans la fen&#234;tre droite. La fen&#234;tre de
</p>
<p>5. http://www.synapse-fr.com/Cordial_Analyseur/Presentation_Cordial_Analyseur.htm
6. Dans l&#8217;exemple, la requ&#234;te est tr&#232;s simple. Des requ&#234;tes plus complexes combinant les op&#233;rateurs classiques de logique (et, ou, non)
</p>
<p>peuvent &#234;tre faites, par exemple la requ&#234;te (&#8217;juif&#8217; or &#8217;pers&#233;cution&#8217;) and not &#8217;horreur&#8217; renvoie toutes les phrases conte-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DOMINIQUE LEGALLOIS, PEGGY CELLIER, THIERRY CHARNOIS
</p>
<p>gauche propose d&#8217;autres mots qui apparaissent dans les phrases dans lesquelles juif est employ&#233; (par exemple, les
mots cours et pers&#233;cution). On constate que les trois phrases du texte contenant juif, contiennent &#233;galement toutes
le mot pers&#233;cution (indiqu&#233; par le chiffre entre parenth&#232;ses) et deux d&#8217;entre elles le mot cours utilis&#233; pour indiquer
une expression temporelle.
</p>
<p>FIGURE 2 &#8211; Exemple de navigation dans les phrases des M&#233;moires de guerre du G&#233;n&#233;ral de Gaulle.
</p>
<p>3.2 Analyse des r&#233;sultats
</p>
<p>Analyse quantitative &#192; la table 2, on trouve un r&#233;sum&#233; des informations quantitatives observ&#233;es sur les diff&#233;-
rents textes &#233;tudi&#233;s. Relativement au nombre de phrases, on constate un plus grand nombre d&#8217;appariements chez
de Gaulle et chez Bald&#233;-Georgin que chez Vian. Ceci semble s&#8217;expliquer par plusieurs raisons : Vian poss&#232;de
des phrases plus courtes (en moyenne 5 lex&#232;mes par phrase), donc assez peu candidates aux appariements, et
un vocabulaire plus diversifi&#233;. Au contraire, Bald&#233;-Georgin et de Gaulle se caract&#233;risent respectivement par une
th&#233;matique homog&#232;ne, et par la r&#233;p&#233;tition des situations (par ex. la description des fronts pendant la guerre). Tous
deux, en outre, sont compos&#233;s de phrases relativement longues (en moyenne 10 &#224; 11 lex&#232;mes par phrase). De
plus, quel que soit le genre, on note que tr&#232;s peu de r&#233;seaux phrastiques sont trouv&#233;s. Mais, ces r&#233;seaux sont
de grande taille (relativement au nombre de phrases) pour Bald&#233;-Georgin et de Gaulle, et les hypotextes corres-
pondant couvrent plus de 65% de l&#8217;ensemble des phrases de ces &#339;uvres. Les caract&#233;ristiques textuelles signal&#233;es
pr&#233;c&#233;demment (taille des phrases et homog&#233;n&#233;it&#233; th&#233;matique) expliquent ces ph&#233;nom&#232;nes qui sont accentu&#233;s par
la pr&#233;sence de lex&#232;mes tr&#232;s fr&#233;quents comme &#234;tre, avoir, pouvoir.
</p>
<p>Titre Nb lex&#232;mes/phrase Nb Nb r&#233;seaux % de phrases
(en moy.) appariements phrastiques dans l&#8217;hypotexte
</p>
<p>Le crime, ph&#233;nom&#232;ne normal 10 146 1 58%
Jeunes cherchent place 10 42 053 1 65%
J&#8217;irai cracher sur vos tombes 5 3 191 6 28%
M&#233;moires de Guerre (Tome 2) 11 139 677 1 71%
</p>
<p>TABLE 2 &#8211; R&#233;sum&#233; des r&#233;sultats quantitatifs par texte.
</p>
<p>Premi&#232;re analyse textuelle L&#8217;application du mod&#232;le &#224; l&#8217;essai de Nicole Bald&#233;-Georgin (environ 200 pages),
qui porte sur le malaise des jeunes, nous a permis de mettre en &#233;vidence un r&#233;seau phrastique repr&#233;sentatif de
l&#8217;argumentation de l&#8217;auteur. Nous reportons ci-dessous, en faisant le travail d&#8217;am&#233;nagement mentionn&#233; dans la
section 2, ce r&#233;seau phrastique constitu&#233; de 4 phrases partageant 3 lex&#232;mes (adulte, espace et social) :
</p>
<p>nant le mot &#8217;juif&#8217; ou le mot &#8217;pers&#233;cution&#8217; mais pas le mot &#8217;horreur&#8217;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CALCUL DE R&#201;SEAUX PHRASTIQUES POUR L&#8217;ANALYSE ET LA NAVIGATION TEXTUELLE
</p>
<p>[725] Le jeune adulte1, vivant d&#8217;une mani&#232;re extr&#234;me, l&#8217;absence d&#8217;ancrage dans le social2 pi&#233;g&#233; dans le leurre,
absorb&#233; dans sa fragilit&#233; psychique, t&#233;moignerait, de fa&#231;on marquante, de cet l&#8217;espace3 narcissique moderne,
espace3 nomade, en d&#233;rive, flottant entre l&#8217;&#234;tre et le d&#233;s&#234;tre.
[1911] Le jeune adulte1, pris dans les entraves des processus identificatoires alt&#233;r&#233;s et dans ses d&#233;m&#234;l&#233;s avec
un espace3 social2 o&#249; il est impuissant &#224; se lier et s&#8217;inscrire, en manque d&#8217;une place symbolis&#233;e qui pourrait
l&#8217;articuler, il se laisse alors emporter dans une mouvance &#224; risque, flottant &#224; la d&#233;rive entre le vide et les images.
[2472] Le jeune adulte1 il d&#233;couvre, alors m&#234;me qu&#8217; on lui enjoint de quitter la s&#233;curit&#233; familiale, que l&#8217;espace3
social2 ne lui appartient pas, et qu&#8217;il est, lui, hors circuit &#233;conomique.
[2561] Les p&#244;les identificatoires sont devenus, sous l&#8217;effet des logiques sociales2, flous, inconsistants, inexis-
tants car les espaces3 qui les soustendent et dans lesquels est ins&#233;r&#233; le jeune adulte1 sont des espaces3 par
lesquels il est contenu mais qui ne le font pas &#234;tre.
</p>
<p>On constate ici une chose assez remarquable : l&#8217;appariement &#224; partir de 3 lex&#232;mes permet de d&#233;couvrir des relations
lexicales binaires, mais fortement coh&#233;sives. Par exemple, d&#233;rive et flottant qui apparaissent dans les phrases 725 et
1911 ; mais aussi &#234;tre, nominalis&#233; dans 725 et entrant dans la construction factitive de 2561. Ce petit texte poss&#232;de
sa logique, que l&#8217;on peut r&#233;sumer ainsi : l&#8217;absence d&#8217;ancrage social favorise le narcissisme du jeune et emp&#234;che sa
r&#233;alisation psychique et sociale (725) ; ce rejet de l&#8217;espace social contribue &#224; son enfermement (1911) et &#224; sa prise
de conscience de sa disqualification (sociale, donc, et &#233;conomique). Les processus qui permettent habituellement
le travail de r&#233;alisation psychique et sociale (les p&#244;les identificatoires) ne sont pas &#224; m&#234;me de rendre ind&#233;pendant
et int&#232;gre le jeune adulte. Le texte exprime donc l&#8217;effet sur le devenir des jeunes, d&#8217;une sorte de coercition sociale
qui les am&#232;nerait &#224; fuir vers le narcissisme. D&#8217;un point de vue plus argumentatif, on peut concevoir que 725
constitue une th&#232;se dont 1911 et 2472 sont l&#8217;&#233;laboration (le d&#233;veloppement) et 2561 la cons&#233;quence g&#233;n&#233;rale.
</p>
<p>Deuxi&#232;me analyse textuelle &#192; titre exp&#233;rimental, nous avons appliqu&#233; le mod&#232;le &#224; un texte narratif : le tome 2
(L&#8217;Unit&#233;) des M&#233;moires de Guerre du G&#233;n&#233;ral de Gaulle. La d&#233;marche a &#233;t&#233; fructueuse puisqu&#8217;elle a permis
d&#8217;identifier un ph&#233;nom&#232;ne qui interroge autant l&#8217;analyse de discours que l&#8217;histoire :
</p>
<p>Occurrence 1
[644] Ce dernier [H&#233;riot], ayant renvoy&#233; sa croix de la l&#233;gion d&#8217;honneur, pour marquer sa r&#233;probation de
voir d&#233;corer des &#171; volontaires &#187; combattant les russes, &#233;tait arr&#234;t&#233; peu apr&#232;s, tandis que MM. Paul Reynaud1,
Daladier2, Blum3, Mandel4, le g&#233;n&#233;ral Gamelin5, etc., demeuraient au fond des prisons o&#249; Vichy6 les avait
jet&#233;s au lendemain de son av&#232;nement, sans que la justice les e&#251;t condamn&#233;s, ni m&#234;me normalement incul-
p&#233;s. [645] Au cours de l&#8217;&#233;t&#233;, s&#8217;aggravait la pers&#233;cution des juifs, men&#233;e par un &#171; commissariat &#187; sp&#233;-
cial de concert avec l&#8217;envahisseur. [646] En septembre, comme le Reich exigeait7 de la France une main-
d&#8217;oeuvre8 sans cesse plus nombreuse et que les ouvriers volontaires n&#8217;y suffisaient pas, on proc&#233;dait &#224; une
lev&#233;e obligatoire9 de travailleurs. (p. 301).
Occurrence 2
[1596] Au cours de l&#8217;hiver, redoublait la pers&#233;cution des juifs malgr&#233; l&#8217;indignation publique, les pro-
testations des &#233;v&#234;ques - comme Mgr Sali&#232;ge &#224; Toulouse, le cardinal Gerlier &#224; Lyon - la r&#233;probation du
pasteur Boegner, pr&#233;sident de la f&#233;d&#233;ration protestante de France. [1597] Le 30 janvier 1943, &#233;tait cr&#233;&#233;e la
milice, dont Darnand, d&#233;j&#224; incorpor&#233; dans la police allemande, devenait le secr&#233;taire g&#233;n&#233;ral et qui s&#8217;employait
activement &#224; traquer les patriotes. [1598] Le 16 f&#233;vrier, s&#8217;instituait le service du travail obligatoire9, procurant
au &quot;gouvernement&quot; le moyen de fournir sans limite &#224; l&#8217;ennemi la main-d&#8217;oeuvre8 qu&#8217;il exigeait7. (p. 351).
Occurrence 3
[3079] Pendant la m&#234;me p&#233;riode s&#8217;&#233;talent les honteuses horreurs de la pers&#233;cution juive. [3080] Enfin,
c&#8217;est l&#8217;&#233;poque o&#249; le Reich se fait livrer les prisonniers politiques de Vichy6, notamment : Herriot, Reynaud1,
Daladier2, Blum3, Mandel4, Gamelin5, Jacomet, en arr&#234;te d&#8217;autres comme Albert Sarraut, Fran&#231;ois-Poncet,
le colonel De La Roque, se saisit de hauts fonctionnaires, d&#8217;hommes d&#8217;affaires, d&#8217;officiers g&#233;n&#233;raux et transf&#232;re
en Allemagne ces personnalit&#233;s afin qu&#8217;elles lui servent d&#8217;otages ou, un jour, d&#8217;&#233;l&#233;ments d&#8217;&#233;change (p. 434).
</p>
<p>Le calcul automatique des appariements a permis de d&#233;tecter que les phrases 644 et 3080 sont appari&#233;es, ainsi
que les phrases 646 avec 1598 et 645 avec 1596. En &#233;tudiant ces six phrases en contexte, on observe un r&#233;seau
phrastique avec les phrases 645, 1596 et 3079 (mises en gras) qui contiennent toutes les trois les lex&#232;mes juif
et pers&#233;cution et une expression temporelle. Ces phrases (s&#233;par&#233;es par un empan de 131 pages, &#233;d. La Pl&#233;iade)
constituent les seules r&#233;f&#233;rences de de Gaulle &#224; l&#8217;arrestation en masse des juifs en France. La quasi r&#233;p&#233;tition
des trois phrases est manifeste, tant au niveau lexical que syntaxique ; elle n&#8217;a pourtant jamais &#233;t&#233; per&#231;ue par les</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DOMINIQUE LEGALLOIS, PEGGY CELLIER, THIERRY CHARNOIS
</p>
<p>ex&#233;g&#232;tes de de Gaulle (historiens, sp&#233;cialistes de lexicom&#233;trie, etc.) alors que les M&#233;moires ont &#233;t&#233; et reste un texte
tr&#232;s &#171; fr&#233;quent&#233; &#187;, en raison de son caract&#232;re documentaire et de ses qualit&#233;s litt&#233;raires 7. Cette r&#233;p&#233;tition concerne
l&#8217;&#233;v&#233;nement le plus tragique de la seconde guerre mondiale ; le relatif silence de de Gaulle (seulement trois phrases
sur plus de mille pages) s&#8217;explique par le fait que cette trag&#233;die ne peut, par son ampleur et l&#8217;impuissance de la
R&#233;sistance, participer &#224; la construction de l&#8217;Ethos gaullien &#8211; l&#8217;image du sauveur de la France (cf. (Legallois, 2010)
pour une interpr&#233;tation d&#233;velopp&#233;e). L&#8217;appariement permet de plus de montrer la fa&#231;on dont de Gaulle &#233;crivain
a r&#233;dig&#233; ces passages : il est certain que de Gaulle a &#233;crit les passages 2 et 3 en ayant sous les yeux le passage
1. Autrement dit, la r&#233;p&#233;tition des phrases incrimin&#233;es a &#233;t&#233; op&#233;r&#233;e de fa&#231;on consciente et d&#233;lib&#233;r&#233;e. Il s&#8217;agit l&#224;,
selon nous, d&#8217;un fait particuli&#232;rement &#233;clairant sur la fa&#231;on dont l&#8217;apr&#232;s-guerre en France tout en reconnaissant
l&#8217;horreur de la trag&#233;die, en a fait un &#233;v&#233;nement marginal.
</p>
<p>4 Conclusion
</p>
<p>Nous avons d&#233;velopp&#233; et utilis&#233; des outils informatiques pour mettre en &#339;uvre automatiquement le mod&#232;le lin-
guistique propos&#233;. Un premier outil calcule automatiquement les appariements et les r&#233;seaux que l&#8217;on peut ensuite
afficher dans un outil de visualisation. Un second outil (syst&#232;me d&#8217;information logique) nous permet d&#8217;affiner
l&#8217;exploration du texte par navigation. Cette premi&#232;re impl&#233;mentation du mod&#232;le linguistique permet une explora-
tion de corpus de grande taille en &#171; r&#233;duisant &#187; le texte aux phrases informationnellement les plus pertinentes et en
faisant appara&#238;tre la coh&#233;sion interphrastique du texte &#224; travers les appariements entre phrases. Les premi&#232;res ex-
p&#233;riences sur diff&#233;rents types de textes (narratif et expositif) montrent que le mod&#232;le permet de mettre en &#233;vidence
des relations discursives int&#233;ressantes qui &#233;chappent &#224; la &#171; simple &#187; analyse lexicom&#233;trique, ou &#224; l&#8217;utilisation de
concordanciers classiques.
</p>
<p>Pour le calcul des appariements, les traitements linguistiques sont bas&#233;s sur l&#8217;identit&#233; des lemmes des lex&#232;mes.
Nous envisageons d&#8217;am&#233;liorer ce calcul en prenant en compte les formes d&#233;riv&#233;es (stabiliser/stable) avec l&#8217;outil
DeriF (Namer, 2003) et les expressions temporelles et spatiales en utilisant des analyses locales comme celles
que nous avons d&#233;velopp&#233;es dans (Bilhaut et al., 2003). De fa&#231;on plus exploratoire, l&#8217;identification de marques
anaphoriques sur des phrases cons&#233;cutives devrait aussi permettre d&#8217;obtenir d&#8217;autres appariements int&#233;ressants.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALLARD P., FERR&#201; S. &amp; RIDOUX O. (2010). Discovering functional dependencies and association rules by
navigating in a lattice of OLAP views. In Concept Lattices and Their Applications, p. 199&#8211;210 : CEUR-WS.
</p>
<p>BILHAUT F., CHARNOIS T., ENJALBERT P. &amp; MATHET Y. (2003). Passage extraction in geographical docu-
ments. In Intelligent Information Processing and Web Mining, p. 121&#8211;130.
</p>
<p>FERR&#201; S. &amp; RIDOUX O. (2004). An introduction to logical information systems. Information Processing &amp;
Management, 40(3), 383&#8211;419.
HOEY M. (1991). Patterns of Lexis in Text. Describing English Language. Oxford University Press.
</p>
<p>KNIGHT K. &amp; MARCU D. (2002). Summarization beyond sentence extraction : A probabilistic approach to
sentence compression. Artificial Intelligence, 139(1), 91&#8211;107.
LEGALLOIS D. (2004). Coh&#233;sion lexicale et r&#233;seaux phrastiques dans la construction du texte expositif. In S.
PORHIEL &amp; D. KLINGER, Eds., L&#8217;unit&#233; texte : Association perspectives.
</p>
<p>LEGALLOIS D. (2006). Des phrases entre elles &#224; l&#8217;unit&#233; r&#233;ticulaire du texte. In Langages, volume 163, p. 56&#8211;73.
</p>
<p>LEGALLOIS D. (2010). Construire un &#171; hors-m&#233;moires &#187; : notes sur trois phrases des m&#233;moires de guerre du
g&#233;n&#233;ral de gaulle. In Les temps modernes, volume 661, p. 116&#8211;122.
</p>
<p>NAMER F. (2003). Morphologie et lexique. Cahiers de Grammaire, 28, 31&#8211;48.
THOMAS J. (1999). Prominence in discourse, a study based on french texts. Allied Publishers limited.
</p>
<p>TOOLAN M. (2009). Narrative Progression in the Short Story : A corpus stylistic approach. John Benjamins
Publishing Company.
</p>
<p>7. Ce texte est au programme du baccalaur&#233;at de fran&#231;ais. On sait que la d&#233;cision a fait pol&#233;mique.</p>

</div></div>
</body></html>