<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>PLATON, Plateforme d&#8217;apprentissage et d&#8217;enseignement de l&#8217;orthographe sur le Net</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>PLATON
Plateforme d&#8217;apprentissage et d&#8217;enseignement de l&#8217;orthographe sur le Net
</p>
<p>Richard Beaufort Sophie Roekhaut
CENTAL, UCLouvain, Place Blaise Pascal 1, B-1348 Louvain-la-Neuve
</p>
<p>{richard.beaufort,sophie.roekhaut}@uclouvain.be
</p>
<p>La plateforme PLATON s&#8217;inscrit dans le cadre g&#233;n&#233;ral de l&#8217;apprentissage et de l&#8217;enseignement des langues assist&#233;s
par ordinateur (ALAO/ELAO). D&#233;di&#233;e &#224; l&#8217;am&#233;lioration de la ma&#238;trise de l&#8217;orthographe, cette plateforme s&#8217;adresse
aussi bien &#224; des apprenants natifs qu&#8217;&#224; des allophones, pour autant que ceux-ci pr&#233;sentent d&#233;j&#224; un niveau de
ma&#238;trise avanc&#233; de la langue &#224; l&#8217;oral et &#224; l&#8217;&#233;crit 1. Sur ce point, PLATON se distingue des autres plateformes
d&#8217;ALAO/ELAO, classiquement d&#233;di&#233;es aux langues secondes.
</p>
<p>PLATON est une plateforme en ligne, accessible aux enseignants et &#224; leurs apprenants. Chaque enseignant g&#232;re
un ou plusieurs cours, divis&#233;s en le&#231;ons. Un cours &#233;tant vu comme un niveau de ma&#238;trise, un apprenant est norma-
lement inscrit &#224; un seul cours &#224; un moment donn&#233;.
Actuellement, PLATON g&#232;re principalement la partie &#171; exercices et corrig&#233;s &#187; : l&#8217;enseignant acc&#232;de &#224; PLATON
pour ajouter un exercice &#224; une le&#231;on ou pour visualiser les r&#233;sultats des apprenants concern&#233;s, tandis que l&#8217;ap-
prenant y acc&#232;de pour r&#233;aliser un exercice ou visualiser ses r&#233;sultats. A terme, PLATON proposera &#233;galement
le contenu didactique des le&#231;ons, directement produit par l&#8217;enseignant. L&#8217;adresse de la plateforme sera rendue
publique lors de son lancement, aux alentours de septembre 2011.
</p>
<p>Dans l&#8217;ensemble, le d&#233;veloppement de cette plateforme t&#226;che de r&#233;pondre aux diff&#233;rents besoins relev&#233;s par les
acteurs de l&#8217;ALAO/ELAO (Desmet, 2006). L&#8217;un d&#8217;eux, un v&#233;ritable d&#233;fi, a particuli&#232;rement retenu notre atten-
tion : d&#233;passer les exercices classiques que sont le texte &#224; trous et le choix multiple, qui limitent consid&#233;rablement
l&#8217;&#233;ventail des connaissances test&#233;es. Pour ce faire, l&#8217;id&#233;e est de proposer des exercices de type semi-ouvert, qui
&#233;vitent de signaler trop explicitement le lieu de la difficult&#233; et stimulent la spontan&#233;it&#233; des r&#233;ponses, tout en main-
tenant l&#8217;&#233;ventail des variations possibles dans les limites d&#8217;un ensemble g&#233;rable automatiquement.
La dict&#233;e, exercice de type semi-ouvert du fait de la pr&#233;sence d&#8217;un original, est l&#8217;exercice central de la plate-
forme, qui en g&#232;re automatiquement tous les aspects : sa vocalisation par synth&#232;se de la parole lors de son ajout
par l&#8217;enseignant, les diff&#233;rentes &#233;tapes de sa r&#233;alisation par l&#8217;apprenant (&#233;coute, copie, relecture) et, bien s&#251;r, sa
correction. La phase de correction propose un diagnostic automatique des erreurs, bas&#233; sur des m&#233;thodes d&#8217;ali-
gnement et d&#8217;analyse linguistique automatique pr&#233;sent&#233;es dans un article de la conf&#233;rence (Beaufort &amp; Roekhaut,
2011). A terme, la plateforme proposera aussi d&#8217;autres types d&#8217;exercices (textes &#224; trous, jeu des 7 erreurs, etc.),
mais &#233;galement des exercices g&#233;n&#233;r&#233;s automatiquement, sur la base des lacunes de chaque apprenant.
</p>
<p>Dans le cadre de la session de d&#233;monstration, nous montrerons les deux pans de la plateforme. Du c&#244;t&#233; de l&#8217;ensei-
gnant, nous nous focaliserons sur l&#8217;ajout d&#8217;une nouvelle dict&#233;e. Du c&#244;t&#233; de l&#8217;apprenant, nous nous concentrerons
sur la r&#233;alisation d&#8217;une dict&#233;e compl&#232;te. Accessoirement, nous montrerons &#233;galement comment visualiser et mo-
difier une dict&#233;e existante du c&#244;t&#233; enseignant, et comment visualiser les copies que ce soit du c&#244;t&#233; enseignant ou
apprenant. Les participants pourront eux-m&#234;mes interagir avec le syst&#232;me.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BEAUFORT R. &amp; ROEKHAUT S. (2011). Le TAL au service de l&#8217;ALAO/ELAO. L&#8217;exemple des exercices de
dict&#233;e automatis&#233;s. In Actes de la 18e conf&#233;rence sur le Traitement Automatique des Langues Naturelles (TALN
2011), 27 juin&#8211;1er juillet, Montpellier, France. A para&#238;tre.
DESMET P. (2006). L&#8217;enseignement/apprentissage des langues &#224; l&#8217;&#232;re du num&#233;rique : tendances r&#233;centes et d&#233;fis.
Revue fran&#231;aise de linguistique appliqu&#233;e, 11(1), 119&#8211;138.
</p>
<p>1. Les niveaux C1 et C2 du Cadre europ&#233;en commun de r&#233;f&#233;rence pour les langues.
Voir http://eduscol.education.fr/cid45678/cadre-europeen-commun-de-reference.html.</p>

</div></div>
</body></html>