<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>TTC TermSuite : une cha&#238;ne de traitement pour la fouille terminologique multilingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>TTC TermSuite : une cha&#238;ne de traitement
pour la fouille terminologique multilingue
</p>
<p>B&#233;atrice Daille Christine Jacquin Laura Monceaux Emmanuel Morin J&#233;rome
Rocheteau
</p>
<p>Universit&#233; de Nantes - LINA &#8211; 2 rue de la Houssini&#232;re &#8211; BP 92208 &#8211; 44322 Nantes cedex 3,
France
</p>
<p>{prenom.nom}@univ-nantes.fr
Le projet europ&#233;en TTC 1 vise &#224; exploiter les possibilit&#233;s offertes par les corpus comparables pour am&#233;liorer les
performances des outils informatiques de traduction. Il s&#8217;agit de traiter des domaines techniques dans un contexte
massivement multilingue o&#249; il est n&#233;cessaire de traduire un m&#234;me document dans plusieurs langues. TTC Term-
Suite est un ensemble de composants logiciels pour l&#8217;extraction et l&#8217;alignement terminologique multilingue &#224;
partir de corpus comparables dans 5 langues europ&#233;ennes - Anglais, Fran&#231;ais, Allemand, Espagnol et une langue
peu dot&#233;e, le Letton, ainsi qu&#8217;en Chinois et en Russe.
TTC TermSuite adopte la plate-forme Apache UIMA 2 con&#231;ue pour faciliter l&#8217;assemblage de composants, leur
int&#233;gration au sein d&#8217;une cha&#238;ne de traitement ainsi que le passage &#224; l&#8217;&#233;chelle dans un contexte industriel.
TTC TermSuite proc&#232;de &#224; une extraction terminologique monolingue pour les 7 langues, puis &#224; son alignement
par paire de langues. En entr&#233;e, sont fournis plusieurs corpus comparables dont les documents sont compos&#233;s de
deux types de fichiers : le texte du document et les m&#233;tadonn&#233;es associ&#233;es au format Dublin Core 3. Ces m&#233;ta-
donn&#233;es recensent la langue, la source du document, la date d&#8217;extraction s&#8217;il s&#8217;agit d&#8217;un fichier extrait du web, le
format (.txt, .html, .pdf, etc.), le sujet. Seule la langue est une m&#233;tadonn&#233;e obligatoire. En sortie, sont produites
des listes terminologiques monolingues et bilingues sous la forme d&#8217;une fichier XML au format TermBase eX-
change 4.
TTC TermSuite effectue les traitements informatiques d&#233;di&#233;s &#224; l&#8217;acquisition terminologique en 4 phases :
Traitements pr&#233;liminaires : identification et conversion des encodages de caract&#232;res, d&#233;tection de la langue ;
Analyses linguistiques d&#233;coupage du texte en mots, analyse morphosyntaxique et lemmatisation et conversion
</p>
<p>au format Multext ;
Extraction terminologique monolingue d&#233;tection d&#8217;occurrences de termes simples et complexes, normalisation
</p>
<p>et regroupement des termes en fonction de leurs variations, filtrage statistique ;
Alignement terminologique bilingue alignement contextuel par paires de langues.
Chacune des unit&#233;s fonctionnelles qui composent les 4 phases de cette architecture logicielle est r&#233;alis&#233;e par un
composant UIMA d&#233;di&#233;. Chacun de ces composants g&#232;re le multilinguisme et, au besoin, r&#233;partit le document en
cours de traitement &#224; un sous-composant d&#233;di&#233; au traitement de la langue de ce document.
</p>
<p>TTC TermSuite est librement distribu&#233; 5accompagn&#233; d&#8217;une vid&#233;o sur Youtube 6 expliquant comment l&#8217;utiliser.
La d&#233;monstration pr&#233;sentera l&#8217;extraction et l&#8217;alignement des termes simples sur l&#8217;Anglais, Fran&#231;ais, Allemand,
Espagnol, Chinois et Russe, ainsi que l&#8217;extraction et alignement de termes complexes sur le Fran&#231;ais et l&#8217;Anglais.
</p>
<p>1. http://www.ttc-project.eu
2. http://uima.apache.org
3. http://dublincore.org
4. http://www.lisa.org/Term-Base-eXchange.32.0.html
5. http://code.google.com/p/ttc-project
6. http://www.youtube.com/watch?v=Vi6yoXaFZ44</p>

</div></div>
</body></html>