<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction de patrons s&#233;mantiques appliqu&#233;e &#224; la classification d'Entit&#233;s Nomm&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>Extraction de patrons s&#233;mantiques appliqu&#233;e &#224; la classification d'Entit&#233;s Nomm&#233;es
</p>
<p>Isma&#239;l El Maarouf (1,2)   Jeanne Villaneau (2)   Sophie Rosset (3)
</p>
<p>(1)  HCTI UBS-UEB, Centre de Recherche Christiaan Huygens, 56321 Lorient
(2) Valoria UBS-UEB, Rue Yves Mainguy, Campus de Tohannic 56017 Vannes cedex
</p>
<p>(3) LIMSI-CNRS, F-91403 Orsay Cedex
ismail.el-maarouf@univ-ubs.fr, jeanne.villaneau@univ-ubs.fr, sophie.rosset@limsi.fr
</p>
<p>R&#233;sum&#233; La  variabilit&#233;  des  corpus  constitue  un  probl&#232;me  majeur  pour  les  syst&#232;mes  de 
reconnaissance  d'entit&#233;s  nomm&#233;es.  L'une  des  pistes  possibles  pour  y  rem&#233;dier  est  l'utilisation 
d'approches  linguistiques  pour  les  adapter  &#224;  de  nouveaux  contextes :  la  construction  de  patrons 
s&#233;mantiques peut permettre de d&#233;sambigu&#239;ser les entit&#233;s nomm&#233;es en structurant leur environnement 
syntaxico-s&#233;mantique.  Cet  article  pr&#233;sente  une  premi&#232;re  r&#233;alisation  sur  un  corpus  de  presse  d'un 
syst&#232;me  de  correction.  Apr&#232;s  une  &#233;tape  de  segmentation  sur  des  crit&#232;res  discursifs  de  surface,  le 
syst&#232;me extrait  et  pond&#232;re les patrons li&#233;s &#224; une classe d'entit&#233;  nomm&#233;e fournie par un analyseur.  
Malgr&#233;  des  mod&#232;les  encore  relativement  &#233;l&#233;mentaires,  les  r&#233;sultats  obtenus  sont  encourageants  et 
montrent la n&#233;cessit&#233; d'un traitement plus approfondi de la classe Organisation.
</p>
<p>Abstract Corpus variation is a major problem for named entity recognition systems. One possible 
direction to tackle this problem involves using linguistic approaches to adapt them to unseen contexts : 
building  semantic  patterns  may  help  for  their  disambiguation  by  structuring  their  syntactic  and 
semantic  environment.  This  article  presents  a  preliminary  implementation  on  a  press  corpus  of  a 
correction system. After a segmentation step based on surface discourse clues,  the system extracts and  
weights  the  patterns  linked  to  a  named  entity  class  provided  by  an  analyzer.  Despite  relatively  
elementary models,  the results obtained are promising and point on the necessary treatment of the 
Organisation class.
</p>
<p>Mots-cl&#233;s :   entit&#233;s nomm&#233;es, patrons s&#233;mantiques, segmentation discursive de surface
Keywords:   named entities, semantic patterns, surface discourse segmentation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ISMA&#207;L EL MAAROUF, JEANNE VILLANEAU, SOPHIE ROSSET
</p>
<p>1 Introduction
</p>
<p>Ritel est un Syst&#232;me de Question-R&#233;ponse interactif &#224; domaine ouvert  (Rosset et al., 2008), permettant &#224; 
un utilisateur de dialoguer et d'obtenir des r&#233;ponses &#224; ses questions. Parmi les questions auxquelles doit  
pouvoir  r&#233;pondre  un  tel  syst&#232;me,  certaines  (factuelles,  d&#233;finitions)  correspondent  &#224;  une  demande 
d'information sur une Entit&#233; Nomm&#233;e (EN), une valeur ou une date. L'analyse d&#233;taill&#233;e des composants 
d'un SQR (Moldovan et al., 2003) montre que la pr&#233;diction du type de r&#233;ponse dans les documents index&#233;s  
est l'une des causes d'erreurs majeure, en partie due &#224; la Reconnaissances de ces Entit&#233;s Nomm&#233;es (REN).
</p>
<p>Si  la  REN  semble  &#234;tre  une  t&#226;che  bien  maitris&#233;e  lorsque  l'on  se  r&#233;f&#232;re  aux  r&#233;sultats  des  campagnes  
d'&#233;valuation  classiques  (Grishman  et  al.,  1995),  on  conna&#238;t  moins  leurs  performances  sur  des  corpus 
diff&#233;rents de ceux pour lesquels ils ont &#233;t&#233; d&#233;velopp&#233;s (Grishman, 2010). La robustesse des syst&#232;mes peut  
&#234;tre mise &#224; l'&#233;preuve par le degr&#233; de granularit&#233; de la typologie d'EN (Galliano et al., 2009  ; Markert et al., 
2007), la qualit&#233; de retranscription du corpus (Galliano et al., 2009) et l'h&#233;t&#233;rog&#233;n&#233;it&#233; des corpus (Mota et 
al. 2008). Les d&#233;gradations de performances constat&#233;es dans ces trois cas justifie la conception de syst&#232;mes  
de correction qui assurent leur robustesse face &#224; des textes et &#224; des EN inconnus. 
</p>
<p>C'est dans la perspective d'adaptation d'un analyseur linguistique int&#233;grant la d&#233;tection d'EN (Ritel-nca) 
utilis&#233; par le SQR Ritel, que s'inscrit notre recherche. Nous pr&#233;sentons un syst&#232;me destin&#233; &#224; corriger les  
r&#233;sultats de l'analyseur, &#224; partir de patrons s&#233;mantiques extraits de corpus &#233;crits. Apr&#232;s avoir d&#233;crit notre  
approche et les traitements effectu&#233;s (section 2), les mod&#232;les de construction de patron sont pr&#233;sent&#233;s en 
section 3 puis &#233;valu&#233;s en section 4. Les premiers r&#233;sultats obtenus ouvrent la voie &#224; des perspectives de  
recherche explicit&#233;es section 5.
</p>
<p>2 Approche et traitements
</p>
<p>2.1 Choix de l'approche
</p>
<p>Les syst&#232;mes de REN sont principalement divis&#233;s en deux cat&#233;gories : d'une part, les syst&#232;mes &#224; base de 
r&#232;gles, correspondant &#224; des automates qui utilisent des listes d'entit&#233;s nomm&#233;es (&#171; gazetteers &#187;), des mots 
d&#233;clencheurs et des indices de surface, et d'autre part, les mod&#232;les probabilistes utilisant diff&#233;rents niveaux  
de repr&#233;sentation (forme, lemme, cat&#233;gorie morphosyntaxique) entrain&#233;s sur des corpus annot&#233;s (pour un  
&#233;tat de l'art, voir Nadeau et al., 2007). Notre syst&#232;me s'appuie sur un corpus annot&#233; automatiquement par  
un syst&#232;me  de  REN.  Les EN sur lesquelles  nous  travaillons  correspondent  &#224;  la  triade  Personne-Lieu-
Organisation car elles cristallisent de nombreux probl&#232;mes : la possibilit&#233; pour une forme de recouvrir les 
trois cat&#233;gories rend une analyse fine du contexte indispensable (voir &#233;galement 4.1).
</p>
<p>L'approche  d&#233;velopp&#233;e  dans  cet  article  s'inscrit  dans  une  perspective  d'enrichissement  linguistique  de 
syst&#232;mes &#224; base de r&#232;gles, en cr&#233;ant des grammaires de patrons s&#233;mantiques sur le mod&#232;le de celles qui  
sont employ&#233;es en Extraction d'Information (Ward et al., 1992). Elle s'inspire de la linguistique de corpus 
britannique  (Sinclair,  1991),  dont  le  but  est  de  d&#233;crire  les  usages  des  mots  en  contexte  &#224;  partir  de  
l'exploration de grands corpus. Le sens d'un mot est d&#233;fini en fonction des patrons majeurs dans lesquels il  
est  employ&#233;.  La  notion  de  patron  peut  recouvrir  diff&#233;rentes  r&#233;alit&#233;s,  des  collocations,  associations  
significatives  entre  lexies  (Sinclair,  1991),  jusqu'&#224;  l'identification  de  cadres  complexes,  proches  des 
structures pr&#233;dicatives (Hanks, 2008).
</p>
<p>Les associations sont automatiquement calcul&#233;es sur de grands corpus et permettent de cr&#233;er des r&#233;seaux 
s&#233;mantiques  pour  chaque  mot.  La  m&#233;thode  g&#233;n&#233;rale  consiste  &#224;  s&#233;lectionner  les  mots  apparaissant  de 
mani&#232;re significative dans une fen&#234;tre de taille arbitraire autour du mot-cl&#233;. Dans notre syst&#232;me, les unit&#233;s  
du r&#233;seau correspondent aux informations syntaxiques et s&#233;mantiques contenues dans des chunks (d&#233;crits 
en 2.2). La fen&#234;tre, quant &#224; elle, peut &#234;tre de taille variable, car elle correspond &#224; la notion de segment,  
d&#233;fini &#224; partir d'indices discursifs de surface tels que les marques de ponctuation et les formes en &#171;  qu- &#187; 
(cf. 2.3).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE PATRONS S&#201;MANTIQUES APPLIQU&#201;E &#192; LA CLASSIFICATION D'ENTIT&#201;S NOMM&#201;ES
</p>
<p>2.2 Chunking grammatical
</p>
<p>Ritel  utilise  les  r&#233;sultats  d'un  analyseur  linguistique  &#224;  base  de  r&#232;gles,  Ritel-nca,  dont  les  sorties  sont  
pr&#233;sent&#233;es  en  structure  arborescente  (figure  1).  Ce  syst&#232;me  a  fait  l'objet  d'un  d&#233;veloppement  
particuli&#232;rement approfondi : il permet l'acc&#232;s &#224; des lexiques cat&#233;gorisant plus d'un million de mots, dont 
une grande partie de noms propres, et pr&#232;s de 2000 r&#232;gles sont actuellement impl&#233;ment&#233;es. La taxonomie  
utilis&#233;e et continuellement augment&#233;e,  comprend plus de 300 types,  dont les EN classiques (Personne, 
Organisation et  Lieu),  affin&#233;s  et  structur&#233;s  en sous-types et  en composants.  La f-mesure  associ&#233;e  &#224; la  
classification d'entit&#233;s classiques est de 0,8 sur l'&#233;crit et &#224; hauteur de l'&#233;tat de l'art pour les corpus oraux  
(Rosset et al., 2008).
</p>
<p>Un syst&#232;me comme Ritel-nca facilite l'analyse linguistique : la d&#233;tection des entit&#233;s classiques, comme les 
dates, permet de regrouper de nombreuses variantes, faisant ainsi &#233;merger des associations nouvelles et 
s&#233;mantiquement pertinentes. Les mots grammaticaux (d&#233;terminants, pr&#233;positions) sont cependant rarement 
rattach&#233;s, ce qui nuit &#224; la construction de patrons. Pour r&#233;duire les phrases &#224; des groupes plus homog&#232;nes,  
nous avons int&#233;gr&#233; les entit&#233;s  dans des  chunks grammaticaux (dont  la version initiale est  d&#233;crite  dans  
Villaneau et al. 2007).
</p>
<p>Les chunks grammaticaux regroupent les n&#339;uds de l'arbre de la phrase &#224; partir de r&#232;gles exploitant des 
indices de formes, de type d'entit&#233; et de position. Cinq types de chunks sont d&#233;finis parmi les groupes  
nominaux (GN, GNP) et les groupes verbaux (GV, GVP, GVADJ). Les chunks sont associ&#233;s &#224; la cat&#233;gorie  
majeure : un verbe dans le cas des groupes verbaux, un lieu dans le cas d'un GNP regroupant les entit&#233;s  
[pr&#233;position d&#233;terminant lieu]. La figure 1 illustre la repr&#233;sentation arborescente de l'exemple (1) apr&#232;s la 
passe de chunking.
</p>
<p>(1) Patricia Highsmith est morte le 4 f&#233;vrier 1995 dans un h&#244;pital de Locarno
</p>
<p>Figure 1- Repr&#233;sentation arborescente apr&#232;s chunking de l'exemple 1.
</p>
<p>Dans cet exemple, le nombre de n&#339;uds de l'arbre de la phrase est divis&#233; par deux sans perte d'information : 
la cat&#233;gorie et la forme de la t&#234;te sont conserv&#233;es et il est toujours possible de parcourir les fils d'un n&#339;ud  
pour obtenir des informations plus d&#233;taill&#233;es. Les n&#339;uds de chunks grammaticaux poss&#232;dent en sus des  
attributs  concernant  la  voix  et  le  mode  du  verbe  (pronominal,  passif,  actif)  permettant  de  distinguer 
rapidement les diff&#233;rentes r&#233;alisations verbales.
</p>
<p>Nous  avons  manuellement  cherch&#233;  &#224;  extraire  des  relations  s&#233;mantiques  en  projetant  des  cadres  
s&#233;mantiques du type de FrameNet (Fillmore et al., 2003) &#224; partir de grammaires r&#233;guli&#232;res de chunks. Si  
les r&#233;sultats obtenus sont pr&#233;cis, l'analyse se heurte &#224; des limites qui compliquent la cr&#233;ation de r&#232;gles  : 
rigidit&#233; due &#224; l'ordre de d&#233;tection des &#233;l&#233;ments et sensibilit&#233; &#224; la variation de surface, due principalement &#224; 
la  pr&#233;sence  de  ponctuation.  Plut&#244;t  que  de  multiplier  les  r&#232;gles,  nous  avons  int&#233;gr&#233;  une  &#233;tape  de 
segmentation de surface qui permet d'isoler des s&#233;quences de chunks.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ISMA&#207;L EL MAAROUF, JEANNE VILLANEAU, SOPHIE ROSSET
</p>
<p>2.3 Segmentation de surface
</p>
<p>La segmentation consiste &#224; isoler des s&#233;quences de chunks en fonction d'indices de fronti&#232;re surfaciques 
comme la ponctuation : elle est principalement applicable &#224; des textes &#233;crits, quoique les travaux r&#233;cents en 
insertion automatique de ponctuation (Favre et al.,  2008) ouvrent des perspectives d'application &#224; l'oral.  
Les indices de ponctuation jouent un r&#244;le structurant dans la pr&#233;sentation de l'information. Leur prise en  
compte peut  permettre la d&#233;limitation de structures  appositives,  comme en (2),  citationnelles  en (3)  et  
parenth&#233;tiques en (4).
</p>
<p>(2) le secr&#233;taire d' Etat aux PME , Renaud Dutreil ,   s' &#233;tait ainsi vu convoquer par le directeur du 
cabinet du premier ministre , Michel Boyon.
</p>
<p>(3) ''le  navire doit  &#234;tre  capable de prendre un mauvais  coup de chien sans risque'' ,  explique Guy 
Ribadeau-Dumas, l' architecte naval ma&#238;tre d' &#339;uvre du chantier .
</p>
<p>(4) Eric Tanguy  (n&#233; en 1968)  passait alors pour un nouveau Dusapin.
</p>
<p>Ces  structures  imposent  des  contraintes  sur  leur  environnement :  dans  l'exemple  (3),  la  citation  entre 
guillemets pr&#233;c&#232;de un verbe dont le sujet est invers&#233;. On observe &#233;galement en (4) que les parenth&#233;tiques  
isolent un groupe d'information semi-autonome qui contient une relation s&#233;mantique (date de naissance). 
</p>
<p>Les segments que nous constituons se d&#233;finissent par leurs fronti&#232;res gauche et droite et leur taille. Pour  
premi&#232;re exp&#233;rience, nous nous limitons &#224; une typologie simple de fronti&#232;res en distinguant les fronti&#232;res  
fortes  (point,  point  d'exclamation,  etc.)  des  fronti&#232;res  faibles  (virgules,  parenth&#232;ses,  etc.).  Seules  les  
fronti&#232;res faibles sont franchies pour identifier des relations s&#233;mantiques (virgule dans l'exemple 2). Nous 
avons &#233;galement consid&#233;r&#233; les connecteurs et conjonctions comme des fronti&#232;res faibles pour obtenir des 
segments proches de propositions. L'algorithme de segmentation applique d'abord les r&#232;gles associ&#233;es &#224; la 
d&#233;tection de fronti&#232;res fortes, puis, dans une seconde passe et au sein des unit&#233;s d&#233;j&#224; segment&#233;es, celles  
associ&#233;es  aux fronti&#232;res  faibles  (automates  adapt&#233;s  aux  sorties  du chunking).  Le  tableau  1 r&#233;sume les 
fr&#233;quences des segments obtenus avec cette m&#233;thode de segmentation sur un corpus de presse (4,5 millions  
de mots).
</p>
<p>Tableau 1 &#8211; Fr&#233;quence des segments en fonction de leur taille (exprim&#233;e en nombre de chunks).
</p>
<p>En focalisant sur les relations contenues dans les segments de petite taille, on peut ainsi traiter la majorit&#233;  
des segments, sachant que 30% des segments (de taille 1) ne renferment pas de relation. La d&#233;tection de  
relations s&#233;mantiques peut s'effectuer de deux mani&#232;res : en analysant les associations entre chunks au sein 
de segments de taille sup&#233;rieure &#224; 1, et en analysant les relations entre chunks appartenant &#224; des segments  
diff&#233;rents. Les segments de taille 1 sont donc r&#233;serv&#233;s &#224; l'analyse entre segments. L'exemple (5) montre le 
type de relations que l'on peut d&#233;tecter  au sein des segments  dits &#171; pluriels &#187; (car  contenant  plus d'un 
chunk) : dans l'exemple, ces derniers figurent en rouge, les segments simples, en violet.
</p>
<p>(5) A. V. Shinde, n&#233;  &#224; Goa, en Inde, d&#233;c&#233;d&#233; en 2003 &#224; New York (&#224; l' &#226;ge de 86 ans), avait parcouru 
le monde en qu&#234;te des plus belles pierres pour le joaillier Harry Winston.
</p>
<p>Taille de Segment Fr&#233;quence Proportion
1 207260 0.29
2 160177 0.22
3 110760 0.15
4 78605 0.11
5 53846 0.07
6 35657 0.05
7 23103 0.03
8 14686 0.02
9 9282 0.01
10 5783 &lt;0.01
&gt;10 29951 0.04</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE PATRONS S&#201;MANTIQUES APPLIQU&#201;E &#192; LA CLASSIFICATION D'ENTIT&#201;S NOMM&#201;ES
</p>
<p>Nous nous concentrons dans cet article sur les relations existant entre chunks au sein des segments pluriels. 
Il s'agit dans l'exemple (5), d'analyser les relations entre &#171; n&#233; &#187; et &#171; &#224; Goa &#187;, ou encore entre &#171; d&#233;c&#233;d&#233; &#187;, 
&#171; en  2003 &#187;  et  &#171; &#224;  New  York &#187;.  Plus  pr&#233;cis&#233;ment,  nous  utilisons  ces  chunks  comme  indices  de 
d&#233;sambigu&#239;sation des EN figurant dans les m&#234;mes segments. Le syst&#232;me permettant d'extraire les patrons  
d'association [chunk-EN] est d&#233;crit en section suivante.
</p>
<p>3 Syst&#232;me et mod&#232;les
</p>
<p>3.1 Un syst&#232;me multi-niveaux
</p>
<p>Le syst&#232;me analyse l'arbre obtenu apr&#232;s la passe de chunking et y ajoute les segments. Quatre classes de 
r&#232;gles  d&#233;di&#233;es  &#224; chaque niveau de repr&#233;sentation sont d&#233;finies :  Forme,  Entit&#233;,  Chunk Grammatical  et 
Segment.  Chaque  niveau  de  repr&#233;sentation  poss&#232;de  son  propre  lexique  de  contraintes  (attribut-valeur), 
permettant d'identifier un &#233;l&#233;ment ou un segment.  Par exemple,  un groupe pr&#233;positionnel en &#171; &#224; &#187; sera 
d&#233;fini par sa classe (Chunk Grammatical), son sous-type (Groupe Nominal Pr&#233;positionnel) et la forme de 
la pr&#233;position. Les r&#232;gles et les lexiques sont externalis&#233;s afin de pouvoir appliquer des patrons d&#233;finis  
manuellement ou extraits automatiquement.
</p>
<p>Les patrons extraits au sein des segments peuvent s'appuyer sur les chunks, les entit&#233;s ou les formes.  &#192; 
titre d'illustration, la figure 3 d&#233;cline les caract&#233;ristiques internes de chaque segment de l'exemple (6) en 
fonction du niveau de repr&#233;sentation.
</p>
<p>(6)  il  y a pr&#232;s de cinquante ans d&#233;j&#224;   ,   Jacques Monod rappelait au colloque de Caen   que   50 
pourcent  du chiffre  d'  affaires  de  la  soci&#233;t&#233;  am&#233;ricaine  Du Pont  de  Nemours  provenait  de  la  
commercialisation de produits inconnus dix ans plus t&#244;t  . 
</p>
<p>Figure 3 &#8211; Tableaux des niveaux de repr&#233;sentation des segments de l'exemple (6).
</p>
<p>Cette repr&#233;sentation nivel&#233;e de la phrase permet de concevoir des mod&#232;les qui combinent les informations 
de plusieurs niveaux. Trois mod&#232;les sont &#233;valu&#233;s : la combinaison des niveaux Chunk et Forme (mod&#232;le 
CF), des niveaux Chunk et Entit&#233; (mod&#232;le CE) et un mod&#232;le mixte (mod&#232;le CEM) qui combine les niveaux  
Chunk  et  Entit&#233;,  en  substituant  les  entit&#233;s  &#171; substantif &#187;,  &#171; action &#187;  et  &#171; adjectif &#187;  par  les  formes 
correspondantes, les verbes &#233;tant lemmatis&#233;s. L'existence de ce dernier mod&#232;le est motiv&#233;e par l'hypoth&#232;se 
que ces classes contiennent r&#233;guli&#232;rement des informations s&#233;mantiques pertinentes qui seraient autrement  
masqu&#233;es. Le tableau 2 fait figurer les &#233;l&#233;ments extraits dans le segment 2 en fonction de chaque mod&#232;le.
</p>
<p>Tableau 2 - Exemples de patrons extraits du segment 2 en fonction des mod&#232;les.
</p>
<p>E1 E2 E3 E4
CF Jacques Monod rappelait GNP_au/colloque GNP_de/Caen
CE pers action GNP_au/subs GNP_de/loc
</p>
<p>CEM pers rappeler GNP_au_colloque GNP_de/loc</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ISMA&#207;L EL MAAROUF, JEANNE VILLANEAU, SOPHIE ROSSET
</p>
<p>Alors que le mod&#232;le CEM cherche &#224; optimiser les informations d&#233;tenues par chaque &#233;l&#233;ment, le mod&#232;le  
CE est le plus g&#233;n&#233;rique. Quant au mod&#232;le CF, il peut &#234;tre plus pr&#233;cis en cas d'erreurs d'analyse des entit&#233;s.
</p>
<p>3.2 M&#233;thode d'extraction et score
</p>
<p>Le corpus dont nous disposons correspond &#224; une ann&#233;e du Journal LeMonde de l'ann&#233;e 2003. Il est divis&#233;  
en deux parties, un corpus de d&#233;veloppement, &#224; partir duquel nous avons extrait les patrons (17 millions de  
mots), un quart (5,5 millions de mots, 10 000 articles) ayant &#233;t&#233; conserv&#233; dans la perspective de l'annoter  
manuellement  (cf.  4.1).  Pour  chaque  mod&#232;le,  nous  avons  s&#233;lectionn&#233;  les  segments  contenant  une  des  
entit&#233;s classiques (&#171; personne &#187;, &#171; organisation &#187; ou &#171; lieu &#187;) fournies par l'analyseur Ritel-nca, et puisque 
notre &#233;tude porte sur les patrons trouv&#233;s &#224; l'int&#233;rieur d'un segment, exclu les segments de taille 1.
</p>
<p>Le syst&#232;me &#233;valu&#233; s'appuie sur les patrons intra-segment observ&#233;s dans le corpus de d&#233;veloppement. Un 
patron correspond &#224; un chunk identifi&#233; dans un segment contenant une EN, mod&#233;lis&#233; selon un niveau de 
repr&#233;sentation. Par exemple, le patron &#171; GNP_de/_loc &#187; du mod&#232;le CEM appara&#238;t 12829 fois en corpus, 
6411 fois en coocurrence avec un Lieu, 2604 fois avec une Organisation et 3814 avec une Personne. &#192;  
partir  de  ces  donn&#233;es,  nous  calculons  deux  scores  d'association  d'un  patron  pour  chaque  classe  :  la 
probabilit&#233; de cooccurrence entre un chunk et une classe d'EN donn&#233;e (PROBA) et l'information mutuelle 
(IM) :
</p>
<p>PROBA &#57502; EN &#8739;Patron&#57503;= P &#57502; EN,Patron &#57503;
P &#57502; Patron &#57503;
</p>
<p>IM &#57502; EN, Patron &#57503;=P &#57502; X=EN,Y=Patron &#57503;&#215;log P &#57502; X=EN,Y=Patron &#57503;
P &#57502; X=EN &#57503;&#215;P &#57502;Y=Patron &#57503;
</p>
<p>Ces scores nous permettent de pr&#233;dire la classe d'EN la plus probable vis-&#224;-vis d'un patron donn&#233;. Pour 
l'&#233;valuation,  nous  avons  calcul&#233;  trois  scores  globaux  pour  prendre  en  compte  l'ensemble  des  patrons 
contenus dans le segment : la moyenne des scores des patrons (Mean) pour tenir compte du nombre de  
patrons  dans  le  segment,  le  score  du  meilleur  patron  (Max)  et  le  produit  des  scores,  pour  att&#233;nuer 
l'importance de patrons fr&#233;quents et communs aux diff&#233;rentes classes. Pour exemple, le score PP (Produit  
de Probabilit&#233;s) d'un segment pour la classe Personne, se calcule &#224; partir du produit des probabilit&#233;s de ses 
patrons :
</p>
<p>PP &#57502; Personne &#57503;=&#8719;
1
</p>
<p>n
</p>
<p>PROBA &#57502; Personne&#8739;Patroni &#57503;
</p>
<p>Six scores diff&#233;rents ont ainsi &#233;t&#233; exp&#233;riment&#233;s pour chaque type de mod&#232;le de repr&#233;sentation vis-&#224;-vis de  
chacune des trois classes, Personne, Lieu et Organisation.
</p>
<p>4 &#201;valuation
L'&#233;valuation  pr&#233;sent&#233;e  dans  cette  section  compare  les  performances  des  mod&#232;les  CF,  CE  et  CEM, 
combin&#233;s avec les scores PROBA et IM pr&#233;sent&#233;s pr&#233;c&#233;demment. Leur performance de classification est  
compar&#233;e &#224; celle du syst&#232;me Ritel-nca qui sert de r&#233;f&#233;rence.
</p>
<p>4.1 Un corpus d'&#233;valuation &#233;tabli sur des crit&#232;res contextuels
</p>
<p>200 articles de presse ont &#233;t&#233; annot&#233;s pour obtenir plus de mille instances d'entit&#233;s de chaque classe (plus 
exactement  1426  organisations,  1004  lieux  et  1377  personnes).  Les  segments  de  taille  1  &#233;taient  pr&#233;-
d&#233;tect&#233;s et exclus de l'annotation. Les conventions d'annotation ont r&#233;duit la t&#226;che de d&#233;tection des EN au  
nom  propre  (avec  ou  sans  majuscule)  lorsque  c'&#233;tait  possible,  en  excluant  les  titres,  fonctions,  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE PATRONS S&#201;MANTIQUES APPLIQU&#201;E &#192; LA CLASSIFICATION D'ENTIT&#201;S NOMM&#201;ES
</p>
<p>d&#233;terminants. Lorsque certains &#233;l&#233;ments (parfois m&#234;me des entit&#233;s nomm&#233;es dans des cas d'imbrication)  
pouvaient &#234;tre consid&#233;r&#233;s comme constitutifs du nom d'une EN, ils ont cependant &#233;t&#233; inclus (exemple 7).  
En  revanche,  seule  l'EN  &#233;tait  prise  en  compte  lorsque  sa  d&#233;nomination  ne  d&#233;pendait  pas  d'&#233;l&#233;ments  
englobants. Ces conventions distinguent ainsi les cas (7) et (8).
</p>
<p>(7)  l'&lt;org&gt; universit&#233; de Poitiers &lt;/org&gt;
</p>
<p>(8)  le maire de &lt;loc&gt; Poitiers &lt;/loc&gt;
</p>
<p>La difficult&#233; majeure consiste &#224; identifier des crit&#232;res fiables pour r&#233;soudre les cas o&#249; le type d'une EN 
diff&#232;re  de  son  r&#244;le  en contexte.  Les  conventions  d'annotation  privil&#233;gient  dans  ces  cas  l'interpr&#233;tation 
contextuelle. Deux types de divergences ont &#233;t&#233; rencontr&#233;es : lorsque cette divergence &#233;tait explicit&#233;e par 
un d&#233;clencheur imm&#233;diatement appos&#233; (9) et lorsqu'elle &#233;tait due &#224; une interpr&#233;tation globale de la phrase  
voire du contexte de l'article (10)
</p>
<p>(9)  c' est la mesure phare de la loi Perben du 9 mars sur la criminalit&#233;
</p>
<p>(10)  l' Italie s' oppose &#224; une r&#233;forme du Conseil de s&#233;curit&#233; de l' ONU
</p>
<p>En (9),  l'EN &#171; Perben &#187; a  &#233;t&#233;  exclue  de  l'annotation  car  elle  rel&#232;ve  du  type  &#171; Loi &#187;,  bien  qu'elle  soit 
nomm&#233;e  d'apr&#232;s  son  fondateur.  L'exemple  (10)  est  g&#233;n&#233;ralement  d&#233;crit  comme  un  cas  de  m&#233;tonymie  
(Markert et al., 2007), pour rendre compte de la relation existant entre un lieu (&#171; Italie &#187;) et des individus, 
l'interpr&#233;tation &#233;tant due au verbe avec lequel elle est employ&#233;e. Cet exemple ne d&#233;signe pas une personne  
comme les conventions d'annotation de m&#233;tonymie de la campagne Semeval7 semble l'indiquer &#224; travers la 
cat&#233;gorie &#171; Loc-for-People &#187; (Markert et al., 2007) : il s'agit d'une organisation politique, dans ce cas tr&#232;s 
probablement  le  gouvernement.  D'autres  types  d'organisations  r&#233;pondent  &#224;  ce  ph&#233;nom&#232;ne,  comme  les  
&#233;quipes de sport (11).
</p>
<p>(11)  dans  les  autres  rencontres  disput&#233;es  mercredi  soir,  &lt;org&gt;Auxerre&lt;/org&gt;  s'  est  impos&#233;  &#224; 
&lt;loc&gt;Rennes&lt;/loc&gt;
</p>
<p>Les conventions consid&#232;rent ainsi que l'EN &#171; Italie &#187; peut d&#233;signer un lieu ou une organisation, comme 
l'EN &#171; Florence &#187;, une personne (12) ou un lieu (13).
</p>
<p>(12)  ce n' est pas le moindre des m&#233;rites de l' essai d' Anton Brender et Florence Pisani
</p>
<p>(13)  une forte pluie commen&#231;a &#224; tomber sur la Toscane et Florence
</p>
<p>Les lieux ont donc &#233;t&#233; annot&#233;s comme tels lorsque l'interpr&#233;tation en contexte le justifiait (localisation,  
destination, origine, etc.), comme en (13).
</p>
<p>4.2 D&#233;tection et classification brute des EN
</p>
<p>Les r&#233;sultats de l'&#233;valuation du syst&#232;me confirment ce qui a &#233;t&#233; dit pr&#233;c&#233;demment &#224; propos de l'impact du 
corpus de d&#233;veloppement ainsi que des conventions d'annotations adopt&#233;es. 980 des 3807 EN annot&#233;es 
n'ont pas &#233;t&#233; d&#233;tect&#233;es par le syst&#232;me Ritel-nca, soit 25%, parmi lesquelles 515 sont &#233;tiquet&#233;es comme  
noms  propres  non  cat&#233;goris&#233;s.  Les  &#171; erreurs &#187;  de  d&#233;tection  affectent  principalement  la  cat&#233;gorie 
Organisation et s'expliquent pour les raisons suivantes : EN non retenues, mots inconnus, probl&#232;mes de 
normalisation du texte (suppression de majuscules, encodage), etc.
</p>
<p>Tableau 3 &#8211; Rappel, Pr&#233;cision et F-mesure de classification du syst&#232;me Ritel-nca.
</p>
<p>Classe Correct Faux Positif Rat&#233; PRECISION RAPPEL FMESURE
PERSONNE 1087 333 290 0,77 0,79 0,78
</p>
<p>LIEU 686 508 318 0,57 0,68 0,62
ORGANISATION 523 360 903 0,59 0,37 0,45</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ISMA&#207;L EL MAAROUF, JEANNE VILLANEAU, SOPHIE ROSSET
</p>
<p>&#201;tant donn&#233; que les patrons g&#233;n&#233;r&#233;s classent les EN &#224; partir des entit&#233;s fournies par le syst&#232;me  
Ritel-nca, l'&#233;valuation a uniquement port&#233; sur les EN d&#233;tect&#233;es. Les r&#233;sultats de ce dernier ont ainsi &#233;t&#233;  
recalcul&#233;s et figurent dans le tableau 4 (mod&#232;le R). Le nombre de segments total s'&#233;l&#232;ve &#224; 1712, r&#233;duisant  
le  nombre  de  segments  contenant  au  moins  une  personne  d&#233;tect&#233;e  &#224;  943  (les  lieux  &#224;  818  et  les  
organisations &#224; 659), 72% d'entre eux ne contenant qu'une seule entit&#233;.
</p>
<p>4.3 R&#233;sultats
</p>
<p>Les diagrammes 1 &#224; 3 pr&#233;sentent les f-mesures des mod&#232;les en fonction de la taille des segments pour  
chaque classe d'EN ; le nombre de segments par taille figure &#233;galement sur les diagrammes (NS), ainsi que 
les  r&#233;sultats  de  Ritel-nca  (R),  &#224;  titre  comparatif.  Par  degr&#233;  d'importance,  le  score  d'association  (IM, 
PROBA) est la variable qui influence le plus les r&#233;sultats, suivi par le niveau de repr&#233;sentation (CE, CF,  
CEM). Quand au calcul global du score (MAX, PROD, MEAN), il n'a qu'une faible influence : le choix du 
meilleur score d'association (MAX) &#233;quivaut globalement &#224; calculer la moyenne ou le produit des scores  
de tous les patrons. Les diagrammes font uniquement figurer les moyennes des scores en fonction de la 
mesure d'association (PROBA, IM).
</p>
<p>Diagramme 1 &#224; 3 : F-mesure pour les Lieux, les Organisations et les Personnes.
</p>
<p>Comme on peut l'observer, ces mod&#232;les ne rivalisent pas avec le mod&#232;le de r&#233;f&#233;rence (R). Les meilleurs 
mod&#232;les atteignent 0,62 de F-mesure sur les Personnes, 0,55 pour les Lieux et 0,45 sur les Organisations.  
On peut retenir globalement que le score PROBA est plus appropri&#233; pour la classification des Lieux et des  
Personnes, alors que l'IM semble plus performante sur les Organisations. L'augmentation de la taille du 
segment  semble  avoir  un  impact  n&#233;gatif  sur  la  classification  des  Personnes,  mais  elle  est  li&#233;e  &#224;  une  
am&#233;lioration des mod&#232;les PROBA pour les Lieux et des mod&#232;les IM pour les Organisations.
</p>
<p>Ces r&#233;sultats nous permettent de conna&#238;tre le comportement global des mod&#232;les mais ne nous renseignent 
pas directement sur leur utilit&#233; dans le cadre de la correction. Pour exp&#233;rimenter la t&#226;che de correction,  
motiv&#233;s par le fait que la mesure de score global avait une influence minime sur les r&#233;sultats, nous avons 
s&#233;lectionn&#233; tous les mod&#232;les MAX, qui, pour chaque EN, nous permet d'extraire un patron (un chunk du 
segment). Par exemple, le mod&#232;le CEM_IM_MAX a class&#233; correctement 17 instances de personnes gr&#226;ce 
au patron &quot;expliquer&quot;, comme dans l'exemple (14) :
</p>
<p>(14)  &quot; mon r&#244;le est de bousculer la perception  que les gens ont de Burberry &quot;,  explique Christopher 
Bailey
</p>
<p>L'exemple (15) est un cas d'erreur que ce patron permet de corriger : &#171; Maud &#187; est class&#233; en Lieu par le 
syst&#232;me de r&#233;f&#233;rence.
</p>
<p>(15)  une sorte de tri  s&#233;lectif qui &quot;  &#233;limine les cellules  mortes  et rend la  peau douce et  satin&#233;e &quot;, 
explique Maud
</p>
<p>2 3 4 5 6 7 8 9 10 11
0
</p>
<p>0,1
</p>
<p>0,2
</p>
<p>0,3
</p>
<p>0,4
</p>
<p>0,5
</p>
<p>0,6
</p>
<p>0,7
</p>
<p>0,8
</p>
<p>0,9
</p>
<p>1
</p>
<p>IM
PROBA
R
NS
</p>
<p>Lieu
</p>
<p>2 3 4 5 6 7 8 9 10 11
0
</p>
<p>0,1
</p>
<p>0,2
</p>
<p>0,3
</p>
<p>0,4
</p>
<p>0,5
</p>
<p>0,6
</p>
<p>0,7
</p>
<p>0,8
</p>
<p>0,9
</p>
<p>1
</p>
<p>IM
PROBA
R
NS
</p>
<p>Organisation
</p>
<p>2 3 4 5 6 7 8 9 10 11
0
</p>
<p>0,1
</p>
<p>0,2
</p>
<p>0,3
</p>
<p>0,4
</p>
<p>0,5
</p>
<p>0,6
</p>
<p>0,7
</p>
<p>0,8
</p>
<p>0,9
</p>
<p>1
</p>
<p>IM
PROBA
R
NS
</p>
<p>Personne</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE PATRONS S&#201;MANTIQUES APPLIQU&#201;E &#192; LA CLASSIFICATION D'ENTIT&#201;S NOMM&#201;ES
</p>
<p>En nous basant sur les r&#233;sultats de l'&#233;valuation, on peut alors assigner un taux de r&#233;ussite &#224; chaque patron.  
En ne s&#233;lectionnant que les patrons dont le score est sans appel (100%), il est alors possible de corriger les  
erreurs du mod&#232;le de r&#233;f&#233;rence, et, ce faisant, de juger de la pertinence linguistique des patrons correcteurs.
</p>
<p>Les  r&#233;sultats  pr&#233;sent&#233;s  dans  le  tableau  4  indiquent  les  performances  obtenues  lorsque  le  syst&#232;me  de 
r&#233;f&#233;rence d&#233;tecte correctement une EN (R) et lorsque les patrons de correction sont appliqu&#233;s. Les r&#233;sultats  
sont organis&#233;s en fonction de l'ajout de patrons issus d'un des trois niveaux de repr&#233;sentation, du score  
d'association, ou tous mod&#232;les r&#233;unis. Lorsqu'aucun patron n'est identifi&#233; pour une instance d'EN donn&#233;e,  
le choix se porte sur la cat&#233;gorie choisie par le syst&#232;me de r&#233;f&#233;rence (R).
</p>
<p>Tableau 4 - Potentiel de correction du syst&#232;me de r&#233;f&#233;rence.
</p>
<p>Globalement, la prise en compte de tous les patrons de correction permet d'am&#233;liorer les f-mesures de 5% 
pour les Personnes, et de 10% pour les Lieux et les Organisations. Le niveau de repr&#233;sentation qui permet 
de corriger le plus d'instances est le niveau CF, en partie du fait qu'il  g&#233;n&#232;re un plus grand nombre de  
patrons, multipliant ainsi les possibilit&#233;s de d&#233;sambigu&#239;sation. Le taux de correction par mod&#232;le ne d&#233;pend  
pourtant pas uniquement du nombre de patrons extraits : les niveaux CE et CEM ont un taux de correction 
relativement &#233;quivalent alors que le niveau CEM g&#233;n&#232;re un plus grand nombre de patron. Ceci s'explique  
simplement par le fait qu'une large part des patrons corrects de ce dernier vient confirmer le mod&#232;le de  
r&#233;f&#233;rence. La combinaison de tous les mod&#232;les permet de corriger 66% d'erreurs pour les Lieux, 55% pour  
les Personnes et 28% pour les Organisations.
</p>
<p>Ces r&#233;sultats semblent corroborer le lien qui peut exister entre la performance d'un mod&#232;le et sa capacit&#233; de 
correction : les mod&#232;les ayant permis de corriger un grand nombre d'organisations sont bas&#233;s sur le score 
IM, alors  que le score PROBA contribue &#224; g&#233;n&#233;rer  plus  de patrons de correction pour les lieux et les  
personnes. Nous avions constat&#233; des tendances similaires sur les diagrammes 1 &#224; 3.
</p>
<p>Travaux similaires
</p>
<p>Les syst&#232;mes obtenant les meilleurs performances sur la REN en fran&#231;ais comme dans d'autres langues  
s'appuient  g&#233;n&#233;ralement  sur  une  classification  supervis&#233;e  qui  n&#233;cessite  l'&#233;tablissement  d'un  corpus 
d'entrainement annot&#233; manuellement. Notre syst&#232;me est entrain&#233; sur un corpus automatiquement annot&#233; 
par un syst&#232;me de REN, qui, par cons&#233;quent, comporte n&#233;cessairement des erreurs. Dans ce cadre, Petasis  
et  al.  (2001)  ont  initi&#233;  un  travail  proche  de  nos  objectifs :  leur  syst&#232;me  est  bas&#233;  sur  un  corpus 
</p>
<p>Cat&#233;gorie Mod&#232;le Pr&#233;cision Rappel F-mesure # Corrig&#233;s
</p>
<p>LIEU
</p>
<p>R+TOUS 0,767 0,945 0,847 91
R+CF 0,754 0,930 0,833 78
R+PROBA 0,726 0,939 0,819 86
R+CE 0,727 0,910 0,808 61
R+IM 0,739 0,886 0,806 41
R+CEM 0,724 0,899 0,802 52
R 0,670 0,836 0,744 NA
</p>
<p>ORGANISATION
</p>
<p>R+TOUS 0,952 0,686 0,797 121
R+CF 0,941 0,672 0,784 107
R+IM 0,917 0,666 0,772 101
R+CE 0,925 0,624 0,745 61
R+CEM 0,918 0,623 0,742 59
R+PROBA 0,940 0,606 0,737 45
R 0,866 0,561 0,681 NA
</p>
<p>PERSONNE
</p>
<p>R+TOUS 0,924 0,978 0,950 31
R+CF 0,916 0,975 0,944 27
R+PROBA 0,909 0,977 0,942 30
R+CE 0,898 0,970 0,932 21
R+IM 0,897 0,967 0,930 18
R+CEM 0,894 0,969 0,930 20
R 0,861 0,951 0,904 NA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ISMA&#207;L EL MAAROUF, JEANNE VILLANEAU, SOPHIE ROSSET
</p>
<p>automatiquement annot&#233; par un premier syst&#232;me et les points de d&#233;saccord sont consid&#233;r&#233;s comme des 
indices de d&#233;faillance. Leur syst&#232;me ne leur permet cependant pas d'extraire des patrons pour envisager  
une correction automatique : les erreurs sont manuellement corrig&#233;es par un expert.  Plus g&#233;n&#233;ralement,  
l'inconv&#233;nient des syst&#232;mes d'apprentissage automatique est leur manque de transparence sur le lien entre 
les indices contextuels et la d&#233;cision de classification. Les travaux rapportent au mieux l'impact de classes 
d'indices (&#171; feature sets &#187; en anglais) sur les performances : capitalisation, taille de fen&#234;tre, prise en compte 
d'information syntaxique ou de ressources externes, etc. Notre m&#233;thode permet de juger directement de la 
pertinence  d'un  patron  sur  lequel  s'appuie  la  d&#233;cision  de  classification  et  d'en  induire  des  r&#232;gles  de 
correction.
</p>
<p>Conclusion et Perspectives
</p>
<p>Cet article pr&#233;sente un syst&#232;me de correction d'EN &#224; partir de patrons s&#233;mantiques. L'extraction 
s'appuie sur l'annotation de l'analyseur linguistique Ritel-nca, une phase de chunking et une segmentation 
de  surface.  Plusieurs  mod&#232;les  de  patrons  combinant  diff&#233;rentes  dimensions  sont  &#233;valu&#233;s  :  mesure 
d'association, score global et niveau de repr&#233;sentation. L'&#233;valuation de ce syst&#232;me montre que la mesure  
d'association a une forte influence sur les performances, m&#234;me si ces derni&#232;res sont en-de&#231;a de celles du 
syst&#232;me de r&#233;f&#233;rence. Nous mesurons le potentiel de correction du syst&#232;me de r&#233;f&#233;rence par ces mod&#232;les et  
obtenons des am&#233;liorations de 10% en F-mesure pour les Organisations et les Lieux et de 5% pour les  
Personnes. Ces am&#233;liorations nous encouragent &#224; tester cette approche sur d'autres classes d'EN.
</p>
<p>Les mod&#232;les employ&#233;s dans l'&#233;valuation sont relativement &#233;l&#233;mentaires : dans les travaux &#224; venir, 
nous &#233;valuerons l'apport de patrons con&#231;us &#224; partir des probabilit&#233;s conjointes des &#233;l&#233;ments d'un segment,  
en commen&#231;ant par exemple par la prise en compte du chunk contenant l'EN. Des mod&#232;les qui prennent en 
compte  l'ordre  (en  &#233;tablissant  des  contraintes  de  position  droite  ou  gauche  par  exemple)  m&#233;ritent  
&#233;galement d'&#234;tre test&#233;s. Ces pistes seront &#233;valu&#233;es dans le cadre d'analyses intra-segment et inter-segment  
telles que d&#233;crites dans cet article. Le probl&#232;me majeur de notre approche que nous ne pouvons qu'&#233;voquer 
ici,  r&#233;side dans la s&#233;lection des patrons de correction parmi la  totalit&#233;  des  patrons g&#233;n&#233;r&#233;s  par  chaque 
mod&#232;le.  L'intervention humaine  semble  indispensable  pour  permettre  d'y  rem&#233;dier  mais  l'utilisation de  
m&#233;thodes de filtrage automatique n'est pas exclue.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; partiellement r&#233;alis&#233; dans le cadre du programme QUAERO (financement OSEO).
</p>
<p>R&#233;f&#233;rences
</p>
<p>EL MAAROUF I., VILLANEAU J., SAID F., DUHAUT D.  (2009). Comparing Child and Adult Language: Exploring 
Semantic constraints. Actes de WOCCI ICMI-MLMI 2009.
</p>
<p>EL MAAROUF I.  (2009).  Natural  Ontologies  at  Work  :  Investigating  Fairy  Tales.  Actes  de  Corpus  
Linguistics Conference 2009.
</p>
<p>ERHMANN M.  (2008).  Les Entit&#233;s Nomm&#233;es, de la linguistique au TAL : statut th&#233;orique et m&#233;thodes de  
d&#233;sambigu&#239;sation. Th&#232;se de Doctorat en sciences du langage, Universit&#233; Paris 7.
</p>
<p>Favre B., Grishman R., Hillard D., Ji H., Hakkani-T&#252;r D. &amp; Ostendorf M. (2008). Punctuating speech for  
information extraction. Actes de ICASSP 2008 : 5013-5016.
</p>
<p>FILLMORE, C. J.,  JOHNSON C.R.,  PETRUCK M.R.L. (2003). Background to Framenet. International Journal of  
Lexicography, (16.3) : 235-250. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE PATRONS S&#201;MANTIQUES APPLIQU&#201;E &#192; LA CLASSIFICATION D'ENTIT&#201;S NOMM&#201;ES
</p>
<p>GALIBERT O. (2009). Approches et m&#233;thodologies pour la r&#233;ponse automatique &#224; des questions adapt&#233;es &#224;  
un cadre interactif en domaine ouvert. Th&#232;se de doctorat en informatique, Universit&#233; Paris-Sud 11, Orsay.
</p>
<p>GALIBERT O.,  QUINTARD L.,  ROSSET S.,  ZWEIGENBAUM P.,  N&#201;DELLEC C.,  AUBIN S.,  GILLARD L.,  RAYSZ J.-P., 
POIS D., TANNIER X., DEL&#201;GER L., LAURENT D. (2010). Named and specific entity detection in varied data: 
The Quaero Named Entity baseline evaluation. Actes de LREC'10.
</p>
<p>GALLIANO S., GRAVIER G., CHAUBARD L. (2009). The ester 2 evaluation campaign for the rich transcription of 
French radio broadcasts. Actes de INTERSPEECH-2009. 2583-2586. 
</p>
<p>GRISHMAN R. &amp; SUNDHEIM, B. (1995). Design of the MUC-6 evaluation. Actes de MUC6.
</p>
<p>GRISHMAN R. (2010). The Impact of Task and Corpus on Event Extraction Systems. Actes de LREC'10.
</p>
<p>HANKS P. (2008). Lexical Patterns: From Hornby to Hunston and Beyond. Actes d'Euralex 2008.
</p>
<p>MARKERT K.,  NISSIM M. (2007) SemEval-2007 task 08: metonymy resolution at SemEval-2007. Actes de 
the 4th International Workshop on Semantic Evaluations : 36-41.
</p>
<p>MOLDOVAN D., PASCA M., HARABAGIU S., SURDEANU M. (2003). Performance Issues and Error Analysis in an 
Open-Domain Question Answering System. ACM Transactions in Information Systems.
</p>
<p>MOTA C., GRISHMAN R. (2008). Is this NE tagger getting old. Actes de LREC'2008.
</p>
<p>NADEAU D.,  SEKINE S.  (2007).  A  survey  of  named  entity  recognition  and  classification.  Linguisticae  
Investigationes 30(1) : 3&#8211;26.
</p>
<p>PETASIS G.,  VICHOT F.,  WOLINSKI F.,  PALIOURAS G.,  KARKALETSIS V.,  SPYROPOULOS.  C.D. (2001).  Using 
Machine Learning to Maintain Rule-based Named-Entity Recognition and Classification Systems. Actes  
de ACL-EACL 2001 .
</p>
<p>ROSSET S.,  GALIBERT O.,  BERNARD G.,  BILINSKI E.,  ADDA G. (2008). The LIMSI participation to the QAst 
track. Actes de Working Notes of CLEF 2008 Workshop.
</p>
<p>SEKINE S.,  NOBATA C. (2004). Definition, Dictionary and Tagger for Extended Named Entities. Actes de 
LREC 04.
</p>
<p>SINCLAIR J.  (1991).  Corpus,  concordance,  collocation:  Describing  English  language. Oxford:  Oxford 
University Press.
</p>
<p>VILLANEAU J.,  ROSSET S.,  GALIBERT O. (2007).  Semantic Relations for  an Oral and Interactive Question-
Answering System. Actes de SRSL7.
</p>
<p>WARD  W., ISSAR S., HUANG X., HON H., HWANG M., YOUNG S., MATESSA M., LIU F., STERN R. (1992). Speech 
Understanding In Open Tasks. Actes de the Fifth DARPA Workshop on Speech and Natural Language.</p>

</div></div>
</body></html>