<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Quel apport des unit&#233;s polylexicales dans une formule de lisibilit&#233; pour le fran&#231;ais langue &#233;trang&#232;re</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Quel apport des unit&#233;s polylexicales dans une formule de lisibilit&#233; pour le
fran&#231;ais langue &#233;trang&#232;re
</p>
<p>Thomas Fran&#231;ois1, 2, 3 Patrick Watrin2, 3
(1) Aspirant FNRS
</p>
<p>(2) Centre de traitement automatique du langage (CENTAL), UCLouvain
(3) Institut Langage et Communication (IL&amp;C), UCLouvain
thomas.francois@uclouvain.be, patrick.watrin@uclouvain.be
</p>
<p>R&#233;sum&#233;. Cette &#233;tude envisage l&#8217;emploi des unit&#233;s polylexicales (UPs) comme pr&#233;dicteurs dans une formule
de lisibilit&#233; pour le fran&#231;ais langue &#233;trang&#232;re. &#192; l&#8217;aide d&#8217;un extracteur d&#8217;UPs combinant une approche statistique
&#224; un filtre linguistique, nous d&#233;finissons six variables qui prennent en compte la densit&#233; et la probabilit&#233; des UPs
nominales, mais aussi leur structure interne. Nos exp&#233;rimentations concluent &#224; un faible pouvoir pr&#233;dictif de ces
six variables et r&#233;v&#232;lent qu&#8217;une simple approche bas&#233;e sur la probabilit&#233; moyenne des n-grammes des textes est
plus efficace.
</p>
<p>Abstract. This study considers the use of multi-words expressions (MWEs) as predictors for a readability
formula for French as a foreign language. Using a MWEs extractor combining a statistical approach with a lin-
guistic filter, we define six variables. These take into account the density and the probability of MWEs, but also
their internal structure. Our experiments conclude that the predictive power of these six variables is low. Moreover,
we show that a simple approach based on the average probability of n-grams is a more effective predictor.
</p>
<p>Mots-cl&#233;s : Lisibilit&#233; du FLE, unit&#233;s polylexicales nominales, mod&#232;les N-grammes.
</p>
<p>Keywords: Readability of FFL, nominal MWEs, N-grams models.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>THOMAS FRAN&#199;OIS, PATRICK WATRIN
</p>
<p>1 Introduction
</p>
<p>Avec le succ&#232;s des approches communicatives et actionnelles dans l&#8217;enseignement des langues &#233;trang&#232;res, les
professeurs sont aujourd&#8217;hui encourag&#233;s &#224; travailler avec des textes authentiques, afin de mettre leurs &#233;tudiants en
contact avec des donn&#233;es linguistiques av&#233;r&#233;es. Le web constitue une pr&#233;cieuse source pour ce type de documents,
mais la recherche d&#8217;un document adapt&#233; au niveau des &#233;tudiants reste parfois ardue. Dans ce contexte, la lisibilit&#233;
a un r&#244;le &#224; jouer, car elle vise &#224; d&#233;velopper des outils capables de pr&#233;dire les difficult&#233;s de compr&#233;hension d&#8217;un
texte pour une population donn&#233;e, uniquement au moyen de caract&#233;ristiques textuelles (telles que le nombre de
lettres par mots, le nombre de mots par phrase, etc.).
</p>
<p>Cependant, si de nombreux travaux se sont pench&#233;s sur la lisibilit&#233; de l&#8217;anglais L1, on compte nettement moins
d&#8217;&#233;tudes sur la lisibilit&#233; en L2, et moins encore pour le fran&#231;ais langue &#233;trang&#232;re (FLE). Dans la majorit&#233; des
cas, ce sont des formules d&#233;velopp&#233;es sur des natifs qui ont &#233;t&#233; appliqu&#233;es &#224; des contextes d&#8217;enseignement des
L2. Or, la validit&#233; d&#8217;une telle approche est loin d&#8217;&#234;tre &#233;tablie, car elle repose sur trois hypoth&#232;ses fragiles : (1) la
compr&#233;hension des lecteurs en L2 est comparable &#224; celle de natifs ; (2) les variables textuelles consid&#233;r&#233;es dans
ces formules sont pertinentes pour la lecture en L2 et (3) la pond&#233;ration de ces variables peut &#234;tre la m&#234;me au sein
d&#8217;une formule pour une L1 et une L2.
</p>
<p>Plusieurs auteurs (Laroche, 1979; Uitdenbogerd, 2005) ne s&#8217;accordent pas avec ce point de vue et consid&#232;rent
que les particularit&#233;s du processus de lecture en L2, d&#233;crits entre autres par Koda (2005), doivent &#234;tre pris en
compte dans les formules de lisibilit&#233; sp&#233;cifiques aux L2. Nous avons pr&#233;c&#233;demment montr&#233; que les temps et
modes verbaux constituent d&#8217;excellents pr&#233;dicteurs pour la lisibilit&#233; des textes en FLE (Fran&#231;ois, 2009). Dans
cette &#233;tude, nous envisageons une autre facette textuelle a priori int&#233;ressante : les unit&#233;s polylexicales (UPs)
nominales. En effet, des exp&#233;rimentations que nous avons r&#233;alis&#233;es pr&#233;c&#233;demment ont confirm&#233; que la fr&#233;quence
des mots de contenu et, en particulier des noms, apportent une information utile en lisibilit&#233;. Par ailleurs, les UPs
sont associ&#233;es &#224; une pratique fluide et appropri&#233;e de la langue (Pawley &amp; Syder, 1983). On peut donc s&#8217;attendre &#224;
ce que les apprenants d&#8217;une L2, et en particulier les d&#233;butants, rencontrent des difficult&#233;s &#224; les traiter.
</p>
<p>Dans la section 2, nous synth&#233;tisons un ensemble de r&#233;sultats de recherche &#224; propos des UPs et de leur traitement,
en particulier lors de la lecture d&#8217;un texte en L2. La section 3 d&#233;crit la proc&#233;dure exp&#233;rimentale qui a &#233;t&#233; appliqu&#233;e
pour analyser la relation entre les UPs et la difficult&#233; des textes pour des lecteurs de FLE. Les r&#233;sultats de ces
exp&#233;rimentations sont rapport&#233;s et discut&#233;s dans la section 4.
</p>
<p>2 Les unit&#233;s polylexicales et la difficult&#233; des textes
</p>
<p>Dans cet article, nous d&#233;signons sous le terme &#171; unit&#233; polylexicale &#187; un ensemble d&#8217;objets linguistiques dont le
sens et la forme peuvent &#234;tre plus ou moins fig&#233;s (collocations, mots compos&#233;s, expressions idiomatiques, etc.).
D&#8217;un point de vue statistique, cette classe d&#8217;objets r&#233;f&#232;re commun&#233;ment &#224; des &#171; suites de mots qui se trouvent plus
fr&#233;quemment associ&#233;s qu&#8217;il ne le seraient par le seul fruit du hasard &#187; (Dias et al., 2000, 213).
</p>
<p>Plusieurs travaux en psychologie cognitive de la lecture, dont celui d&#8217;Underwood et al. (2004), ont observ&#233; qu&#8217;en
moyenne, le traitement des unit&#233;s polylexicales par des natifs est plus rapide que celui des cha&#238;nes libres, &#224; la
lecture comme lors de la production orale. Un effet similaire a aussi &#233;t&#233; observ&#233; pour des apprenants de niveau
avanc&#233; (Underwood et al., 2004). Cependant, ces &#233;tudes portent sur le temps de lecture et, donc, de reconnaissance
des UPs, mais elles n&#8217;&#233;valuent pas leur effet sur la compr&#233;hension. Or, chez des apprenants d&#233;butants ou interm&#233;-
diaires, il y a fort &#224; parier que cet effet soit contrebalanc&#233; par le fait que les unit&#233;s polylexicales rencontr&#233;es sont
(1) majoritairement inconnues des lecteurs et (2) d&#8217;autant plus difficiles &#224; &#233;lucider &#224; l&#8217;aide du contexte que leur
sens peut &#234;tre non-compositionnel.
</p>
<p>En lisibilit&#233;, l&#8217;hypoth&#232;se qu&#8217;une UP plus rare dans la langue serait plus ardue &#224; la lecture n&#8217;a gu&#232;re &#233;t&#233; explor&#233;e.
Weir &amp; Anagnostou (2008) ont sugg&#233;r&#233; de se servir de la moyenne des fr&#233;quences absolues des collocations pr&#233;-
sentes dans un texte comme d&#8217;un indice de sa difficult&#233;, sans valider leur approche par des exp&#233;rimentations. Dans
un article ant&#233;rieur, Ozasa et al. (2007) avaient pr&#233;sent&#233; une formule de lisibilit&#233; pour des apprenants japonais de
l&#8217;anglais langue &#233;trang&#232;re (ALE) qui comprend, entre autres variables, un indice de la difficult&#233; des collocations.
Celui-ci n&#8217;appara&#238;t cependant pas significatif au sein de leur mod&#232;le de r&#233;gression lin&#233;aire multiple, puisqu&#8217;il</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>QUEL APPORT DES UNIT&#201;S POLYLEXICALES DANS UNE FORMULE DE LISIBILIT&#201; POUR LE FRAN&#199;AIS
LANGUE &#201;TRANG&#200;RE
</p>
<p>obtient un t 1 de 0, 4987, ce qui correspond &#224; une p-valeur de 0, 6188 (Ozasa et al., 2007, 4).
</p>
<p>Ainsi, il n&#8217;est pas &#233;vident que les UPs constituent un pr&#233;dicteur efficace en lisibilit&#233; en L2. Comme les recherches
pr&#233;cit&#233;es n&#8217;ont abord&#233; cette probl&#233;matique que superficiellement, nous avons voulu l&#8217;explorer plus en d&#233;tail au
travers du cas particulier du FLE.
</p>
<p>3 Proc&#233;dure exp&#233;rimentale
</p>
<p>Pour r&#233;aliser nos exp&#233;rimentations, il a &#233;t&#233; n&#233;cessaire de : (1) rassembler un corpus d&#233;j&#224; annot&#233; en termes de
difficult&#233; ; (2) d&#233;velopper un extracteur d&#8217;UPs nominales.
</p>
<p>3.1 Le corpus
</p>
<p>La conception d&#8217;une formule de lisibilit&#233; implique l&#8217;annotation d&#8217;un corpus en terme de difficult&#233; et, par cons&#233;-
quent, le choix d&#8217;une &#233;chelle de r&#233;f&#233;rence. Dans le contexte de l&#8217;enseignement des langues en Europe, le Cadre
europ&#233;en commun de r&#233;f&#233;rences pour les langues (CECR) (Conseil de l&#8217;Europe, 2001) s&#8217;est impos&#233; comme un
choix &#233;vident. Cette norme d&#233;finit six niveaux de progression &#8211; A1 (d&#233;butant) ; A2 ; B1 ; B2 ; C1 et C2 (avanc&#233;).
Toutefois, afin de mieux rendre compte de l&#8217;&#233;volution des apprenants, plus rapide dans les premi&#232;res phases de
l&#8217;apprentissage, nous avons scind&#233; les trois premiers niveaux obtenant ainsi neufs &#233;chelons distincts.
</p>
<p>Notons que, depuis son introduction, le CECR a amen&#233; une certaine standardisation des manuels de FLE. Il a d&#232;s
lors &#233;t&#233; possible de rassembler, au d&#233;part d&#8217;un sous-ensemble de ces manuels, un corpus de textes annot&#233;s par des
experts 2. Nous avons ainsi rassembl&#233; 1 895 textes, dont la taille varie de quelques phrases &#224; plus de 2000 mots.
Par ailleurs, afin de disposer d&#8217;un corpus de tests dont la probabilit&#233; a priori de chaque classe est similaire, nous
avons s&#233;lectionn&#233; al&#233;atoirement 50 textes par niveau, retenant ainsi 450 textes pour nos exp&#233;rimentations.
</p>
<p>3.2 L&#8217;extraction des UPs
</p>
<p>En ce qui concerne la proc&#233;dure d&#8217;extraction des UPs, elle s&#8217;inspire largement des travaux de Daille (1995) en
ce qu&#8217;elle associe, &#224; la validation statistique, un ensemble de filtres linguistiques. En plus d&#8217;assurer une plus
grande pr&#233;cision, ces filtres nous permettent de contraindre la nature grammaticale des candidats termes et d&#8217;ainsi
restreindre l&#8217;extraction aux structures nominales.
</p>
<p>Dans ce syst&#232;me, la validation statistique impl&#233;mente le rapport de la log-vraisemblance tel que d&#233;crit dans Silva
&amp; Lopes (1999). Le fonctionnement de cette mesure, comme de l&#8217;ensemble des mesures d&#8217;association, suppose
une masse fr&#233;quentielle cons&#233;quente, masse qui n&#8217;&#233;tait pas accessible au d&#233;part des textes de notre corpus. Pour
palier ce probl&#232;me, nous proposons dans Watrin &amp; Fran&#231;ois (2011) le recours &#224; une r&#233;f&#233;rence fr&#233;quentielle, c&#8217;est-
&#224;-dire une base de donn&#233;es de n-grammes (et de leur fr&#233;quence) construite au d&#233;part de gros corpus. Dans le cadre
de cette &#233;tude, nous avons envisag&#233; l&#8217;indexation des 5-grammes du corpus de Google (Michel et al., 2011) (pour
les ann&#233;es 2000-2008) et d&#8217;un corpus de 5 000 000 de mots issus de l&#8217;ann&#233;e 2009 du quotidien belge Le Soir.
</p>
<p>4 R&#233;sultats et discussion
</p>
<p>4.1 Capacit&#233; pr&#233;dictive des unit&#233;s polylexicales
</p>
<p>Afin de d&#233;terminer l&#8217;int&#233;r&#234;t des UPs en lisibilit&#233; du FLE, nous avons d&#233;fini six variables &#224; m&#234;me de prendre en
compte diverses facettes de ce ph&#233;nom&#232;ne : (1) la proportion d&#8217;unit&#233;s polylexicales nominales par rapport au
nombre de mots (NCPW) ; la proportion des 4 familles de structures morpho-syntaxiques suivantes : (2) N N, (3)
</p>
<p>1. Dans le contexte de la r&#233;gression lin&#233;aire multiple, la statistique t r&#233;sulte d&#8217;un test de significativit&#233; sur le coefficient d&#8217;une des variables
explicatives (Howell, 2008, 264).
</p>
<p>2. Bien entendu, ce processus de s&#233;lection suppose que le niveau d&#8217;un texte est similaire &#224; celui du manuel dont il est extrait. Pour le d&#233;tail
des crit&#232;res utilis&#233;s pour la s&#233;lection, consulter Fran&#231;ois (2009).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>THOMAS FRAN&#199;OIS, PATRICK WATRIN
</p>
<p>Le Soir Google
Seuils &#952; 0 15 25 43 0 139 4000 9931
NCPW 0, 303 0, 142 0, 132 0, 142 0, 173 0, 101 0, 152 0, 152
</p>
<p>NN &#8722;0, 243 &#8722;0, 142 &#8722;0, 01 0, 03 &#8722;0, 223 &#8722;0, 132 0, 004 0, 007
NPN 0, 05 0, 132 0, 09 0, 111 0, 04 0, 06 0, 152 0, 173
</p>
<p>AN &#8722;0, 05 &#8722;0, 03 0, 02 0, 08 &#8722;0, 07 0, 03 0, 08 0, 091
NA 0, 363 0, 303 0, 273 0, 223 0, 373 0, 323 0, 253 0, 283
</p>
<p>MeanP-UP &#8722;0, 03 &#8722;0, 03 &#8722;0, 04 &#8722;0, 05 0, 152 0, 162 0, 141 0, 09
</p>
<p>TABLE 1 &#8211; Corr&#233;lation entre les variables ind&#233;pendantes et la difficult&#233; des textes. Le taux de significativit&#233; est
indiqu&#233; comme suit : 1p &lt; 0, 05 ; 2p &lt; 0, 01 ; 3p &lt; 0, 0001
</p>
<p>N PREP (DET) N, (4) A N et (5) N A ; et (6) la probabilit&#233; moyenne d&#8217;apparition des unit&#233;s polylexicales du texte
(MeanP-UP), calcul&#233;e sur la base des deux r&#233;f&#233;rences d&#233;crites pr&#233;c&#233;demment.
</p>
<p>Par ailleurs, nous avons &#233;galement fait varier le seuil &#952; associ&#233; &#224; la validation statistique. De cette mani&#232;re, nous
avons pu estimer l&#8217;impact de la force d&#8217;association des constituants des UPs. Quatre seuils ont &#233;t&#233; retenus pour
chacun des deux corpus de r&#233;f&#233;rence : un seuil nul o&#249; toutes les structures lexicales nominales sont consid&#233;r&#233;es ;
un second et un quatri&#232;me seuil qui correspondent respectivement &#224; une pr&#233;cision de 30% et 50% pour notre
extracteur (Watrin &amp; Fran&#231;ois, 2011) et une valeur interm&#233;diaire comme troisi&#232;me seuil. La Table 1 rapporte les
coefficients de corr&#233;lation de Pearson (r) entre les 6 variables susmentionn&#233;es et le niveau de difficult&#233; des textes
du corpus de tests.
</p>
<p>Ces r&#233;sultats apportent des enseignements int&#233;ressants. Premi&#232;rement, on note que plusieurs variables, en parti-
culier NPCW et la structure NA, sont significativement associ&#233;es avec la difficult&#233; des textes de notre corpus.
Elles semblent &#224; premi&#232;re vue &#234;tre de bons candidats pour pr&#233;dire la difficult&#233; de textes. Cependant, lorsqu&#8217;on les
int&#232;gre au sein d&#8217;une formule de lisibilit&#233; de type classique, c&#8217;est-&#224;-dire qui consid&#232;re uniquement le nombre de
lettres par mots (NLM) et le nombre de mots par phrase (NMP) 3, leur apport n&#8217;est pas significatif (&#967;2 = 2, 98 ;
p&#8722;value = 0, 08) 4. Les UPs n&#8217;am&#232;nent donc pas d&#8217;information v&#233;ritablement nouvelle par rapport aux variables
traditionnelles.
</p>
<p>Une seconde observation notable est que le fait d&#8217;augmenter &#952;, et donc de renforcer le taux de coh&#233;sion des UPs,
tend &#224; diminuer l&#8217;efficacit&#233; des diff&#233;rents pr&#233;dicteurs. Sur base de ces r&#233;sultats, on pourrait en conclure que les
UPs sont de moins bons pr&#233;dicteurs que l&#8217;ensemble des structures nominales complexes (&#952; = 0). Cependant, il
nous semble plus juste de limiter ce constat d&#8217;&#233;chec aux UPs d&#233;tect&#233;es automatiquement &#224; l&#8217;aide de techniques
statistiques. En effet, parmi les meilleurs candidats pour notre corpus, on trouve des UPs telles que &#171; effet de
serre &#187; ou &#171; d&#233;veloppement durable &#187;, pertinentes dans un contexte d&#8217;apprentissage des L2, mais aussi &#171; mardi
soir &#187; ou &#171; millions d&#8217;euros &#187;.
</p>
<p>Confront&#233;s &#224; cette inad&#233;quation des techniques de d&#233;tection des UPs au contexte de la lisibilit&#233;, nous nous sommes
pos&#233;s une seconde question. Qu&#8217;en est-il de mod&#232;les plus simples, les mod&#232;les n-grammes, qui consid&#232;rent des
suites de tokens sans motivation linguistique ?
</p>
<p>4.2 Les mod&#232;les n-grammes
</p>
<p>Pour v&#233;rifier l&#8217;efficacit&#233; de mod&#232;les n-grammes en lisibilit&#233;, nous nous sommes servis de la fr&#233;quence des n-
grammes d&#8217;ordre 1 &#224; 5 contenus dans nos r&#233;f&#233;rences (cf. Section 3). Seul le mod&#232;le bigramme s&#8217;est av&#233;r&#233; pertinent
pour notre approche. En effet, la capacit&#233; de discrimination des mod&#232;les d&#8217;ordre sup&#233;rieur souffre trop du lissage,
le nombre de n-grammes inconnus augmentant proportionnellement &#224; l&#8217;ordre du mod&#232;le. La probabilit&#233; des &#233;v&#232;-
nements inconnus &#233;tant toujours la m&#234;me, les variables qui en d&#233;coulent ne sont plus suffisamment discriminantes.
</p>
<p>Sur la base des bigrammes de Google et du Soir, nous avons d&#233;fini deux familles de pr&#233;dicteurs. La premi&#232;re re-
pose sur les probabilit&#233;s conditionnelles des mots, P (wi|wi&#8722;1), desquels nous avons d&#233;riv&#233; un mod&#232;le n-gramme
classique, normalis&#233; en fonction du nombre m de mots par texte selon la formule suivante :
</p>
<p>3. Les deux formules de lisibilit&#233; utilis&#233;es pour cette comparaison reposent sur une r&#233;gression logistique ordinale, qui est d&#233;crite en d&#233;tail
dans Fran&#231;ois (2009).
</p>
<p>4. La technique statistique de comparaison entre les deux mod&#232;les assimile chacun d&#8217;eux &#224; une hypoth&#232;se d&#8217;explication des donn&#233;es et en
calcule le rapport de la log-vraisemblance multipli&#233; par la constante &#8722;2. D&#232;s lors, ce rapport est distribu&#233; selon une loi chi-carr&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>QUEL APPORT DES UNIT&#201;S POLYLEXICALES DANS UNE FORMULE DE LISIBILIT&#201; POUR LE FRAN&#199;AIS
LANGUE &#201;TRANG&#200;RE
</p>
<p>normTLProb MeanProb MedianProb meanNGProb medianNGProb gmeanNGProb
Google 0, 003 0, 333 &#8722;0, 04 0, 383 &#8722;0, 001 &#8722;0, 03
Le Soir &#8722;0, 06 0, 182 0, 01 0, 253 &#8722;0, 09 &#8722;0, 0007
</p>
<p>TABLE 2 &#8211; Corr&#233;lation entre les variables bas&#233;es sur les n-grammes et la difficult&#233; des textes.
</p>
<p>normTLProb =
1
</p>
<p>m
</p>
<p>m&#8721;
i=1
</p>
<p>logP (wi|wi&#8722;1)
</p>
<p>En marge de ce mod&#232;le, nous avons aussi consid&#233;r&#233; la moyenne des probabilit&#233;s conditionnelles (MeanProb) et
leur m&#233;diane (MedianProb). La seconde famille de pr&#233;dicteurs s&#8217;int&#233;resse quant &#224; elle directement aux proba-
bilit&#233;s des bigrammes, P (w1 &#8745; w2), qui correspondent davantage aux probabilit&#233;s prises en compte dans notre
approche des UPs. Nous avons ainsi calcul&#233; la moyenne (meanNGProb), la m&#233;diane (medianNGProb) et la
moyenne g&#233;om&#233;trique (gmeanNGProb), qui comme un mod&#232;le n-gramme classique, multiplie les probabilit&#233;s
entre-elles plut&#244;t que d&#8217;en faire la somme. Les corr&#233;lations de ces 6 variables avec la difficult&#233; sont reprises dans
la Table 2.
</p>
<p>L&#224; aussi, nos analyses apportent quelques constatations d&#8217;int&#233;r&#234;t. La premi&#232;re d&#8217;entre-elles est l&#8217;inefficacit&#233; com-
pl&#232;te des variables bas&#233;es sur un mod&#232;le bigramme classique (r vaut 0, 003 et &#8722;0, 06 pour normTLProb), ce
qui nous para&#238;t hautement surprenant en regard des r&#233;sultats rapport&#233;s dans les travaux sur l&#8217;anglais. Schwarm &amp;
Ostendorf (2005), par exemple, disent employer des mod&#232;les n-grammes avec succ&#232;s. Notons qu&#8217;ils ne rapportent
pas de corr&#233;lation individuelle pour cette variable et que leurs bonnes performances globales sont obtenues &#224; l&#8217;aide
de nombreux pr&#233;dicteurs.
</p>
<p>Par contre, la moyenne des probabilit&#233;s des bigrammes du texte (MeanProb) appara&#238;t largement significative.
D&#8217;ailleurs, son addition &#224; la formule de lisibilit&#233; baseline envisag&#233;e pr&#233;c&#233;demment am&#232;ne cette fois une am&#233;lio-
ration significative des performances (R = 0, 67 ; &#967;2 = 11, 66 ; p &#8722; value = 0, 0006). Il est particuli&#232;rement
int&#233;ressant par rapport &#224; notre d&#233;marche de noter que MeanProb est plus informatif qu&#8217;une variable plus fine, qui
calcule la moyenne des probabilit&#233;s des UPs (MeanP-UP). Ce r&#233;sultat nous semble mettre s&#233;rieusement en ques-
tion l&#8217;int&#233;r&#234;t des UPs en lisibilit&#233;, et vient par ailleurs r&#233;pliquer les r&#233;sultats de Ozasa et al. (2007) sur l&#8217;anglais.
</p>
<p>5 Conclusion
</p>
<p>Dans cette &#233;tude, nous avons test&#233; les apports de la notion d&#8217;UPs dans une formule de lisibilit&#233; pour le FLE.
Ceux-ci se sont r&#233;v&#233;l&#233;s n&#233;gligeables, aussi bien de fa&#231;on absolue qu&#8217;en comparaison avec une approche plus
simple bas&#233;e sur les n-grammes. Notre exp&#233;rience souligne que la prise en compte automatique de notions plus
linguistiques ne conduit pas &#224; des r&#233;sultats satisfaisants pour la lisibilit&#233; du FLE. En effet, les traitements TAL
n&#233;cessaires sous-tendent trop d&#8217;approximations qui nuisent &#224; l&#8217;efficacit&#233; des variables : erreurs de l&#8217;extracteur
d&#8217;UPs, probl&#232;me de couverture des r&#233;f&#233;rences, etc.
</p>
<p>Par ailleurs, nos exp&#233;rimentations ont jet&#233; un doute sur l&#8217;efficacit&#233; des mod&#232;les n-grammes classiques pourtant lar-
gement employ&#233;s dans le domaine. En effet, rappelons que, sur notre corpus, une simple approche par unigramme
produit une corr&#233;lation &#233;lev&#233;e (r = &#8722;0, 59), ce qui n&#8217;est pas le cas des mod&#232;les d&#8217;ordre sup&#233;rieur (bigramme :
r = &#8722;0, 06). Il nous faut donc conclure soit &#224; un probl&#232;me d&#8217;estimation des probabilit&#233;s au niveau des r&#233;f&#233;rences,
soit remettre en question l&#8217;hypoth&#232;se qui fonde l&#8217;emploi d&#8217;un mod&#232;le n-gramme en lisibilit&#233;, &#224; savoir que la pro-
babilit&#233; d&#8217;un mot &#233;tant donn&#233; son historique est li&#233;e &#224; sa difficult&#233; de reconnaissance et de compr&#233;hension. Ce
dernier aspect requi&#232;rerait cependant des exp&#233;rimentations dans le cadre de mod&#232;les explicatifs et non pr&#233;dictifs.
</p>
<p>Enfin, on peut se demander si ce motif de r&#233;sultats se reproduirait si (1) les UPs verbales &#233;taient &#233;galement
consid&#233;r&#233;es ; si (2) le rep&#233;rage des UPs &#233;tait effectu&#233; manuellement (ce qui repr&#233;sente toutefois un travail &#233;norme) ;
et si (3) seules les expressions fig&#233;es, plus opaques s&#233;mantiquement, &#233;taient prises en compte. Cette derni&#232;re
perspective, intellectuellement attrayante, doit &#234;tre relativis&#233;e, car il est fort probable que ce type d&#8217;UPs soit trop
rare dans les textes &#224; analyser pour se r&#233;v&#233;ler statistiquement informatif.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>THOMAS FRAN&#199;OIS, PATRICK WATRIN
</p>
<p>R&#233;f&#233;rences
</p>
<p>CONSEIL DE L&#8217;EUROPE (2001). Cadre europ&#233;en commun de r&#233;f&#233;rence pour les langues : apprendre, enseigner,
&#233;valuer. Paris : Hatier.
</p>
<p>DAILLE B. (1995). Combined approach for terminology extraction : lexical statistics and linguistic filtering.
Rapport interne, Lancaster University.
</p>
<p>DIAS G., GUILLOR&#201; S. &amp; LOPES J. (2000). Extraction automatique d&#8217;associations textuelles &#224; partir de corpora
non trait&#233;s. In Proceedings of 5th International Conference on the Statistical Analysis of Textual Data, p. 213&#8211;
221.
</p>
<p>FRAN&#199;OIS T. (2009). Combining a statistical language model with logistic regression to predict the lexical and
syntactic difficulty of texts for FFL. In Proceedings of the 12th Conference of the EACL : Student Research
Workshop, p. 19&#8211;27.
</p>
<p>HOWELL D. (2008). M&#233;thodes statistiques en sciences humaines, 6&#232;me &#233;dition. Bruxelles : De Boeck.
</p>
<p>KODA K. (2005). Insights into second language reading : A cross-linguistic approach. Cambridge : Cambridge
University Press.
</p>
<p>LAROCHE J. (1979). Readability measurement for foreign-language materials. System, 7(2), 131&#8211;135.
MICHEL J., SHEN Y., AIDEN A., VERES A., GRAY M., TEAM T. G. B., PICKETT J., HOIBERG D., CLANCY
D., NORVIG P., ORWANT J., PINKER S., NOWAK M. &amp; AIDEN E. (2011). Quantitative analysis of culture
using millions of digitized books. Science, 331(6014), 176&#8211;182.
OZASA T., WEIR G. &amp; FUKUI M. (2007). Measuring readability for Japanese learners of English. In Procee-
dings of the 12th Conference of Pan-Pacific Association of Applied Linguistics.
</p>
<p>PAWLEY A. &amp; SYDER F. (1983). Two puzzles for linguistic theory : nativelike selection and nativelike fluency.
In J. RICHARDS &amp; R. SCHMITT, Eds., Language and Communication, p. 191&#8211;225. London : Longman.
</p>
<p>SCHWARM S. &amp; OSTENDORF M. (2005). Reading level assessment using support vector machines and statistical
language models. Proceedings of the 43rd Annual Meeting on Association for Computational Linguistics, p.
523&#8211;530.
</p>
<p>SILVA J. &amp; LOPES G. (1999). A local maxima method and a fair dispersion normalization for extracting multi-
word units from corpora. In Sixth Meeting on Mathematics of Language.
</p>
<p>UITDENBOGERD S. (2005). Readability of French as a foreign language and its uses. In Proceedings of the
Australian Document Computing Symposium, p. 19&#8211;25.
</p>
<p>UNDERWOOD G., SCHMITT N. &amp; GALPIN A. (2004). The eyes have it : An eye-movement study into the
processing of formulaic sequences. In N. SCHMITT, Ed., Formulaic sequences : acquisition processing and use,
p. 155&#8211;172. Amsterdam : John Benjamins.
</p>
<p>WATRIN P. &amp; FRAN&#199;OIS T. (2011). N-gram frequency database reference to handle MWE extraction in NLP
applications. In Unpublished manuscript.
</p>
<p>WEIR G. &amp; ANAGNOSTOU N. (2008). Collocation frequency as a readability factor. In Proceedings of the 13th
Conference of the Pan Pacific Association of Applied Linguistics.</p>

</div></div>
</body></html>