<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Construction de corpus multilingues : &#233;tat de l&#8217;art</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Construction de corpus multilingues : &#233;tat de l&#8217;art
</p>
<p>Manuela Yapomo 1, 2
(1) LiLPa (Linguistique, Langues, Parole), EA 1339
</p>
<p>(2) ICube - Laboratoire des sciences de l&#8217;Ing&#233;nieur, de l&#8217;Informatique et de l&#8217;Imagerie, UMR 7357
Universit&#233; de Strasbourg
</p>
<p>yapomodomkem@etu.unistra.fr
</p>
<p>R&#201;SUM&#201;
Les corpus multilingues sont extensivement exploit&#233;s dans plusieurs branches du traitement
automatique des langues. Cet article pr&#233;sente une vue d&#8217;ensemble des travaux en construction
automatique de ces corpus. Nous traitons ce sujet en donnant premi&#232;rement un aper&#231;u de
diff&#233;rentes perceptions de la comparabilit&#233;. Nous examinons ensuite les principales approches de
calcul de similarit&#233;, de construction et d&#8217;&#233;valuation d&#233;velopp&#233;es dans le domaine. Nous observons
que Le calcul de la similarit&#233; textuelle se fait g&#233;n&#233;ralement sur la base de statistiques de corpus,
de la structure de ressources ontologiques ou de la combinaison de ces deux approches. Dans un
cadre multilingue avec l&#8217;utilisation d&#8217;un dictionnaire multilingue ou d&#8217;un traducteur automatique,
de nombreux probl&#232;mes apparaissent. L&#8217;exploitation d&#8217;une ressource ontologique multilingue
semble &#234;tre une solution. En classification, la probl&#233;matique de l&#8217;ajout de documents &#224; la base
initiale sans affecter la qualit&#233; des clusters demeure ouverte.
</p>
<p>ABSTRACT
Multilingual document clustering : state of the art
</p>
<p>Multilingual corpora are extensively exploited in several branches of natural language processing.
This paper presents an overview of works in the automatic construction of such corpora. We
address this topic by first providing an overview of different perceptions of comparability. We then
examine the main approaches to similarity computation, construction and evaluation developed
in the field. We notice that the measurement of the textual similarity is usually based on corpus
statistics or the structure of ontological resources or on a combination of these two approaches. In
a multilingual framework, with the use of a multilingual dictionary or a machine translator, many
problems arise. The exploitation of a multilingual ontological ressource seems to be a worthy
option. In clustering, the problem of adding documents to the initial base without affecting the
quality of clusters remains open.
</p>
<p>MOTS-CL&#201;S : corpus multilingues, comparabilit&#233;, similarit&#233; textuelle translingue, classification.
KEYWORDS: multilingual corpora, comparability, crosslingual textual similarity, classification.
</p>
<p>1 Introduction
</p>
<p>La tendance actuelle en Traitement Automatique des Langues (TAL) est au d&#233;veloppement
de m&#233;thodes translingues pour la conception et l&#8217;am&#233;lioration d&#8217;outils multilingues. De telles
applications d&#233;pendent de la disponibilit&#233; de corpus multilingues en quantit&#233;s consid&#233;rables.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>56 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ces corpus sont principalement de deux sortes : parall&#232;les et comparables. Un corpus est dit
parall&#232;le s&#8217;il est constitu&#233; de textes sources et leurs traductions (McEnery et Xiao, 2007). Les
corpus comparables quant &#224; eux regroupent des documents ayant des caract&#233;ristiques communes.
La difficult&#233; qu&#8217;est l&#8217;acquisition de corpus exclusivement parall&#232;les et l&#8217;importance des corpus
comparables (d&#233;montr&#233;e empiriquement) ont favoris&#233; le d&#233;veloppement de m&#233;thodes de collecte
de corpus comparables &#224; grande &#233;chelle. Cependant, peu de travaux sur les standards de
comparabilit&#233; de telles donn&#233;es ont &#233;t&#233; men&#233;s, les recherches se focalisant sur leur exploitation.
Il y a donc une n&#233;cessit&#233; de d&#233;velopper des m&#233;thodes performantes fond&#233;es sur une d&#233;finition
pr&#233;cise de la comparabilit&#233; pour leur collecte (Su et Babych, 2012).
</p>
<p>Cet article qui a pour objectif de pr&#233;senter l&#8217;&#233;tat de la recherche en acquisition et structuration
de textes multilingues s&#8217;articule en 4 parties principales. Les corpus multilingues sont pr&#233;sent&#233;s
en section 2. Nous abordons principalement la notion de comparabilit&#233; et les applications de ces
corpus. La section 3 traite de leur construction en abordant les sources de collecte, les m&#233;thodes
de calcul de la similarit&#233; et de construction de ces corpus. Nous examinons ensuite en section 4
les diff&#233;rentes approches intrins&#232;ques et extrins&#232;ques d&#8217;&#233;valuation des donn&#233;es r&#233;sultantes. Ces
&#233;l&#233;ments nous permettrons de mieux identifier les limites du domaine et d&#233;terminer notre apport
&#224; la fois th&#233;orique et pratique en section 5. Enfin, nous concluons ce travail en section 6.
</p>
<p>2 Corpus multilingues
</p>
<p>2.1 La comparabilit&#233; en corpus multilingues
</p>
<p>La capacit&#233; des corpus multilingues &#224; am&#233;liorer la performance des syst&#232;mes qui y ont recours
serait fortement li&#233;e &#224; leur degr&#233; de comparabilit&#233;.
</p>
<p>2.1.1 D&#233;finition de la comparabilit&#233; de documents multilingues
</p>
<p>Plusieurs travaux mentionnent le besoin d&#8217;une d&#233;finition de la comparabilit&#233; et formulent leur
compr&#233;hension de celle-ci. Su et Babych (2012) mesurent la comparabilit&#233; de textes &#224; leur
potentiel d&#8217;extraction de segments parall&#232;les et d&#8217;am&#233;lioration de la performance de syst&#232;mes
de traduction automatique. Li et al. (2011) quant &#224; eux consid&#232;rent deux textes ou corpus
comme comparables s&#8217;ils ont une partie non n&#233;gligeable de vocabulaire en commun, la principale
application &#233;tant l&#8217;extraction de lexiques bilingues. Leturia et al. (2009) soutiennent que la
d&#233;finition de la comparabilit&#233; ne peut &#234;tre dissoci&#233;e de l&#8217;application cibl&#233;e et du type de corpus
souhait&#233;. La conception de la similarit&#233; varierait donc d&#8217;un objectif &#224; l&#8217;autre. Elle serait &#233;galement
influenc&#233;e par le type de corpus qui peut &#234;tre g&#233;n&#233;ral ou de sp&#233;cialit&#233;. Nous pensons qu&#8217;il en est
de m&#234;me pour la source de collecte de documents. Les crit&#232;res de comparabilit&#233; de documents
obtenus de Wikip&#233;dia (Paramita et al., 2012) par exemple peuvent diff&#233;rer de ceux de documents
venant d&#8217;un domaine d&#8217;articles de presse. Cette mesure de comparabilit&#233; est d&#233;finie par les
crit&#232;res qui la composent.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>57 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.1.2 Choix et association de crit&#232;res de comparabilit&#233;
</p>
<p>Dans le cadre d&#8217;une application particuli&#232;re, les param&#232;tres de comparabilit&#233; n&#8217;ont pas la m&#234;me
pr&#233;s&#233;ance. Certains travaux ne prennent en compte que des crit&#232;res linguistiques, d&#8217;autres des
crit&#232;res purement extralinguistiques et d&#8217;autres encore font usage de param&#232;tres des deux types.
</p>
<p>&#8211; En se focalisant principalement sur le contenu, Steinberger et al. (2002) mesurent la similarit&#233;
de documents en comparant les repr&#233;sentations des contenus de documents obtenues au
moyen des descripteurs d&#8217;un thesaurus. Pour l&#8217;extraction de terminologies, Goeuriot et al.
(2009) ajoutent au th&#232;me et au domaine, le type de discours comme crit&#232;re d&#8217;homog&#233;n&#233;it&#233;. Le
type de discours (science ou science populaire) est identifi&#233; &#224; travers la structure et les aspects
modaux et lexicaux des textes. Pour la m&#234;me application, Leturia et al. (2009) se basent sur la
similarit&#233; de domaine.
</p>
<p>&#8211; Pour ce qui est de l&#8217;exploitation de crit&#232;res extralinguistiques, Resnik (1999) identifie des
documents parall&#232;les sur le Web &#224; l&#8217;aide de la structure de leurs pages. Utsuro et al. (2002)
quant &#224; eux d&#233;terminent la comparabilit&#233; d&#8217;articles de presse en fonction de leurs dates de
publications.
</p>
<p>&#8211; La majorit&#233; des travaux combine &#224; la fois des crit&#232;res des deux types. Ainsi, les travaux de
Baradaran Hashemi et al. (2010) se basent sur le sujet et la date de publication pour l&#8217;obten-
tion de documents comparables pour la traduction de requ&#234;tes en recherche d&#8217;information
interlingue (RII). Aker et al. (2012) exploitent d&#8217;une part le sujet et d&#8217;autre part, les entit&#233;s
nomm&#233;es et dates de publication pour une application de traduction automatique. Ils mettent
l&#8217;accent sur l&#8217;importance des m&#233;tadonn&#233;es dans cet exercice.
</p>
<p>Nous observons que la tendance, ind&#233;pendamment de l&#8217;application, est de prendre en compte
comme crit&#232;res de similarit&#233; soit le th&#232;me seul qui peut &#234;tre mod&#233;lis&#233; de diverses mani&#232;res soit
le th&#232;me accompagn&#233; d&#8217;un ou de plusieurs autres param&#232;tres. L&#8217;utilisation exclusive de crit&#232;res
extralinguistiques fournit des r&#233;sultats moins bons. Pour rendre compte de la comparabilit&#233;,
plusieurs &#233;chelles de comparabilit&#233; ont &#233;t&#233; d&#233;velopp&#233;es dans la litt&#233;rature. Nous &#233;tablissons dans
le tableau 1 une correspondance entre les diff&#233;rents niveaux de ces &#233;chelles.
</p>
<p>Seuls Skadin&#807;a et al. (2010) traitent de la collecte de corpus multilingues avec la mention de textes
parall&#232;les. Les autres travaux se limitent aux corpus comparables. Les &#233;chelles les plus et moins
granulaires sont respectivement celles de Braschler et Sch&#228;uble (1998) &#224; 5 niveaux et Bekavac
et al. (2004) &#224; 2 niveaux. Except&#233; cette derni&#232;re &#233;chelle, aucune autre ne consid&#232;re les crit&#232;res
extralinguistiques comme seules composantes de la comparabilit&#233; m&#234;me la plus l&#233;g&#232;re. Nous
remarquons qu&#8217;il n&#8217;y a pas de consensus quant aux diff&#233;rents degr&#233;s de comparabilit&#233; en corpus
multilingues, sachant qu&#8217;&#224; l&#8217;exception de Skadin&#807;a et al. (2010), ces travaux se basent uniquement
sur des articles de presse. Ces &#233;chelles de comparabilit&#233; &#233;tant &#233;tablies pour le jugement humain,
il se pose &#233;galement le probl&#232;me de leur adaption &#224; la similarit&#233; automatique.
</p>
<p>Le degr&#233; de comparabilit&#233; de documents multilingues jouerait un r&#244;le crucial dans leurs applica-
tions.
</p>
<p>2.2 Applications des corpus multilingues
</p>
<p>L&#8217;importance des corpus en g&#233;n&#233;ral et notamment des corpus multilingues s&#8217;observe dans plu-
sieurs domaines du TAL. De nombreux travaux portent sur l&#8217;extraction de segments parall&#232;les
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>58 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>! &quot;#$%&amp;%'!#(!%)*!+,--./! 0$%12&#212;%!#(!%)*!+,-3-4/! &quot;5%6'7)#5!8!0'79:4)#!+3;;&lt;/! =&gt;:)2?:#@!#(!%)*!+,--./!!!A52(B5#6!)2@C:26(2?:#6!8!#D(5%E)2@C:26(2?:#6!
! +3/!F%5%))G)26H#! ! !!+3/!I&gt;5(#!'&gt;HF%5%42)2(G!!
</p>
<p>!+,/!I&gt;5(#!'&gt;HF%5%42)2(G!
+3/!726(&gt;25#!21#@(2?:#! +3/!%5(2')#!21#@(2?:#!+,/!726(&gt;25#!)2G#! +,/!%5(2')#!)2G!!+J/!I%24)#!'&gt;HF%5%42)2(G!
+J/!%6F#'(6!'&gt;HH:@6! !+J/!%5(2')#!&amp;%C:#H#@(!)2G!+./!(#5H2@&gt;)&gt;C2#!'&gt;HH:@#!A52(B5#6!#D(5%E)2@C:26(2?:#6!!+:@2?:#H#@(/! +,/!I%24)#!'&gt;HF%5%42)2(G! +./!%:':@#!'&gt;HF%5%42)2(G! +K/!6%@6!)2#@! +./!6%@6!)2#@!!
</p>
<p>TABLE 1 &#8211; Niveaux de comparabilit&#233; en corpus multilingues
</p>
<p>&#224; partir de corpus multilingues. Concernant l&#8217;extraction de terminologies ou de lexiques mul-
tilingues des textes, l&#8217;approche g&#233;n&#233;rale (Fung et Yee, 1998) consiste en la repr&#233;sentation des
mots des textes en vecteurs de contextes. La traduction d&#8217;un mot source dans la langue cible est
identifi&#233;e par le rep&#233;rage de vecteurs similaires ou &#233;quivalents dans les donn&#233;es cibles. Le projet
TTC 1 (Blancafort et al., 2010) a abouti &#224; la cr&#233;ation d&#8217;un outil de g&#233;n&#233;ration automatique de
terminologies bilingues &#224; partir de corpus comparables dans plusieurs langues pour la traduction
automatique. Pour cette m&#234;me application, Bin et al. (2010) agrandissent un corpus parall&#232;le
anglais-chinois avec des phrases parall&#232;les extraites de corpus comparables de brevets d&#8217;invention.
Des r&#233;sultats encourageants sont obtenus par le syst&#232;me de traduction automatique entra&#238;n&#233;
et test&#233; avec le corpus parall&#232;le obtenu. Ion (2012) propose un outil d&#8217;extraction de segments
parall&#232;les des corpus comparables pour enrichir des mod&#232;les de traduction statistique.
</p>
<p>R&#233;aliser ces applications n&#233;cessite d&#8217;avoir une quantit&#233; consid&#233;rable de documents multilingues
et donc des m&#233;thodes performantes pour leur collecte automatique.
</p>
<p>3 Construction automatique de corpus multilingues
</p>
<p>La proc&#233;dure de construction de corpus multilingues pr&#233;sente 3 aspects principaux.
&#8211; les sources &#224; partir desquelles les documents sont initialement extraits (section 3.1).
&#8211; la mesure de similarit&#233; permettant d&#8217;&#233;valuer la comparabilit&#233; entre deux textes ou entre des
</p>
<p>textes et des groupes de textes (section 3.2).
&#8211; et enfin la m&#233;thode de construction de corpus elle-m&#234;me pouvant prendre la forme de crawling,
</p>
<p>de RII ou de classification (section 3.3).
</p>
<p>1. TTC : Terminology Extraction, Translation Tools and Comparable Corpora. http://ttc.syllabs.com/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>59 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
</p>
<p>!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
</p>
<p>&quot;#$%&amp;'!$'!
(&amp;)**+,+()-+#.!
</p>
<p>&quot;'*%/'!$'!*+0+&amp;)/+-1!
-'2-%'&amp;&amp;'!-/).*&amp;+.3%'!
</p>
<p>4#(%0'.-*!
*#%/('*!
</p>
<p>!
!! 5&amp;%*-'/*!
</p>
<p>5#/6%*!
0%&amp;-+&amp;+.3%'!
</p>
<p>FIGURE 1 &#8211; Architecture g&#233;n&#233;rale d&#8217;un syst&#232;me de classification de documents
</p>
<p>La m&#233;thode de construction se sert de la mesure de similarit&#233; d&#233;velopp&#233;e pour obtenir des
documents hautement comparables et/ou parall&#232;les de la source. Cette proc&#233;dure d&#233;velopp&#233;e
sous la pr&#233;sente section est illustr&#233;e par la figure 1. Dans cette article, nous nous orientons vers la
m&#233;thode de classification, &#233;galement illustr&#233;e dans la figure 1, pour la construction d&#8217;un corpus
multilingue.
</p>
<p>3.1 Sources d&#8217;acquisition
</p>
<p>3.1.1 Collections existantes
</p>
<p>Les recherches ant&#233;rieures en compilation de corpus multilingues ont &#233;t&#233; principalement faites
sur la base de corpus de recherche existants. Dans leur objectif de produire un corpus comparable,
Bekavac et al. (2004) exploitent des sous-corpus monolingues d&#8217;un corpus de r&#233;f&#233;rence bulgare
et croate dont ils alignent les documents comparables. Talvensaari et al. (2007) utilisent deux
collections de documents monolingues, pour cr&#233;er un corpus comparable su&#233;dois-anglais. Ces
donn&#233;es ont l&#8217;avantage d&#8217;&#234;tre pr&#234;tes pour l&#8217;utilisation puisqu&#8217;il n&#8217;est pas n&#233;cessaire de d&#233;velopper
des m&#233;thodes suppl&#233;mentaires pour la collecte comme c&#8217;est le cas avec le Web. Cependant, la
vari&#233;t&#233; des donn&#233;es reste un probl&#232;me auquel le Web apporte un d&#233;but de solution.
</p>
<p>3.1.2 Le Web
</p>
<p>Le Web est une source de plus en plus sollicit&#233;e pour la collecte de corpus en tous genres. De
nombreux travaux en acquisition de corpus multilingues sur le Web se focalisent sur les articles
de presse. Aker et al. (2012) tirent profit de la repr&#233;sentation des documents en clusters et de
la disponibilit&#233; des titres &#224; travers les flux RSS qu&#8217;offre Google News pour extraire des articles
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>60 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>comparables pour les paires de langues anglais-allemand et anglais-grec. Wikip&#233;dia aussi est
utilis&#233; pour cette application gr&#226;ce &#224; sa structure ou &#224; ses liens inter-langues qui mettent en
relation les articles de diff&#233;rentes langues sur des th&#232;mes identiques ou li&#233;s. Ion et al. (2010)
compilent un corpus comparable roumain-anglais par l&#8217;identification d&#8217;articles ayant les m&#234;mes
titres. Paramita et al. (2012) identifient les articles comparables &#224; l&#8217;aide des dumps 2 et des liens
inter-langues sous Wikipedia. Certaines &#233;tudes ne restreignent pas leur collecte &#224; des domaines
sp&#233;cifiques. C&#8217;est le cas des travaux de Talvensaari et al. (2008) et Leturia et al. (2009) qui
con&#231;oivent respectivement un crawler th&#233;matique et un moteur de recherche pour obtenir des
corpus de sp&#233;cialit&#233; de l&#8217;Internet.
</p>
<p>L&#8217;extraction de documents comparables et parall&#232;les des sources expos&#233;es ci-dessus requiert une
mesure de similarit&#233;.
</p>
<p>3.2 Mesures de similarit&#233; translingue
</p>
<p>L&#8217;acquisition de documents multilingues est actuellement r&#233;alis&#233;e au moyen de mesures de
similarit&#233;. Ces mesures peuvent &#234;tre de trois sortes : statistiques, s&#233;mantiques et &#233;ventuellement
hybrides.
</p>
<p>3.2.1 Mesures statistiques
</p>
<p>Des m&#233;thodes bas&#233;es sur le vocabulaire commun et la recherche d&#8217;information peuvent &#234;tre
utilis&#233;es pour calculer la similarit&#233; de textes.
</p>
<p>&#8211; Selon la m&#233;thode bas&#233;e sur le vocabulaire commun, la similarit&#233; de deux textes se mesure &#224; la
quantit&#233; de mots qu&#8217;ils ont en communs. Dans un contexte multilingue, cette mesure repose sur
la quantit&#233; d&#8217;&#233;quivalents de traduction que partagent deux textes, obtenue par l&#8217;utilisation d&#8217;un
dictionnaire bilingue ou d&#8217;un traducteur automatique. Li et Gaussier (2010) et Su et Babych
(2012) d&#233;veloppent des mesures de comparabilit&#233; en corpus ou textes multilingues &#224; travers
l&#8217;utilisation de dictionnaires bilingues. Su et Babych (2012) va plus loin dans le pr&#233;traitement
de donn&#233;es pour contourner les probl&#232;mes d&#8217;ambigu&#239;t&#233; et des diff&#233;rentes formes d&#8217;un mot par
l&#8217;annotation en parties du discours et la stemmatisation.
</p>
<p>&#8211; Une seconde approche consiste dans la conversion de documents sources en requ&#234;tes au
moyen de techniques d&#8217;extraction de mots cl&#233;s. Yapomo et al. (2012) et Talvensaari et al.
(2007) utilisent respectivement les mesures TF-IDF 3 et 4 pour obtenir des listes de mots cl&#233;s
repr&#233;sentatives de textes sources. Les documents pertinents sont ceux dont les vecteurs se
rapprochent des vecteurs de requ&#234;tes. Les requ&#234;tes sont traduites dans la langue des documents
cibles pour une similarit&#233; translingue.
</p>
<p>Ces techniques sont certes les moins co&#251;teuses par l&#8217;utilisation principale de statistiques de corpus
mais l&#8217;exclusion d&#8217;informations s&#233;mantiques soul&#232;ve plusieurs probl&#232;mes. Puisque la similarit&#233;
est calcul&#233;e principalement sur la base de mots identiques, synonymie et paraphrase ne sont
g&#233;n&#233;ralement pas prises en compte. Les limites de cette m&#233;thode sont exacerb&#233;es dans un contexte
multilingue avec la traduction de textes ou de requ&#234;tes. Le calcul de la similarit&#233; translingue
</p>
<p>2. http://dumps.wikimedia.org/
3. Term frequency-inverse document frequency (Ramos, 2003)
4. Relative Average Term Frequency (Pirkola et al., 2002)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>61 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>peut &#234;tre affect&#233; par le mauvais choix de traductions candidates dans un dictionnaire. De plus, la
couverture limit&#233;e des dictionnaires/syst&#232;mes de traduction en termes de mots nouveaux, de
sp&#233;cialit&#233;, ou encore d&#8217;unit&#233;s polylexicales repr&#233;sente aussi un inconv&#233;nient consid&#233;rable. Les
mesures s&#233;mantiques sont une alternative &#224; cette m&#233;thode.
</p>
<p>3.2.2 Mesures s&#233;mantiques
</p>
<p>Plusieurs &#233;tudes exploitent la structure de ressources s&#233;mantiques (Leacock et Chodorow, 1998;
Jiang et Conrath, 1997) pour calculer la similarit&#233; de mots. Corley et Mihalcea (2005) proposent
une adaptation de ces m&#233;thodes de mesure de la similarit&#233; lexicale monolingue &#224; partir de
WordNet &#224; la similarit&#233; de segments textuels. Les segments textuels sont repr&#233;sent&#233;s par leurs
mots pleins group&#233;s en cat&#233;gories grammaticales dont la similarit&#233; est mesur&#233;e par WordNet. La
valeur de similarit&#233; entre deux phrases est obtenue par la moyenne des scores de similarit&#233; des
paires de mots de m&#234;me cat&#233;gorie. La sp&#233;cificit&#233; de mots est aussi prise en compte.
</p>
<p>A notre connaissance, Il existe peu ou pas d&#8217;&#233;tudes utilisant cette approche pour une similarit&#233;
translingue. Dans cet objectif, une ressource multilingue, &#224; l&#8217;exemple de global wordNet 5 ou
BabelNet 6 peut &#234;tre utilis&#233;e. L&#8217;efficacit&#233; de cette m&#233;thode est &#233;troitement li&#233;e &#224; la qualit&#233; de la
ressource s&#233;mantique utilis&#233;e. La structure de WordNet en hi&#233;rarchies diff&#233;rentes pour chaque
partie du discours limite la port&#233;e des similarit&#233;s qui ne peuvent &#234;tre qu&#8217;intracat&#233;gorielles.
De plus, la faible composition des hi&#233;rarchies autres que celle des noms remet en cause la
fiabilit&#233; des valeurs de similarit&#233; obtenues pour des mots appartenant aux autres cat&#233;gories
grammaticales (verbes, adjectifs et adverbes). Aussi, dans une ressource multilingue, le probl&#232;me
du d&#233;s&#233;quilibre entre les sous-r&#233;seaux s&#233;mantiques des diff&#233;rentes langues impliqu&#233;es se pose.
L&#8217;absence d&#8217;informations sur le contexte pourrait &#233;galement fausser la liaison des mots de
documents aux concepts d&#8217;une ressource s&#233;mantique : d&#8217;o&#249; l&#8217;introduction de l&#8217;approche hybride.
</p>
<p>3.2.3 Mesures hybrides
</p>
<p>Les recherches s&#8217;orientent &#233;galement vers des mesures de similarit&#233; hybrides qui par l&#8217;utilisation
d&#8217;informations en corpus et d&#8217;une ressource s&#233;mantique, tirent avantage de chacune des approches
ci-dessus.
</p>
<p>Partant de l&#8217;hypoth&#232;se selon laquelle le sens d&#8217;un mot se d&#233;termine en contexte, Mohammad et al.
(2007) proposent une m&#233;thode de calcul de la distance s&#233;mantique translingue des mots &#224; travers
la comparaison de leurs profils distributionnels de concepts. Les profils distributionnels de concepts
sont compos&#233;s des sens de mots non-ambig&#252;s environnants qui permettent d&#8217;inf&#233;rer le sens du
mot cible. Pour calculer la similarit&#233; de paires de mots allemands, des profils distributionnels de
concepts sont construits pour ces paires &#224; partir de leur contextes d&#8217;occurrence et d&#8217;un thesaurus
anglais. Le corpus allemand est mis en correspondance avec le thesaurus anglais &#224; travers un
lexique bilingue. Nous pensons que l&#8217;adaptation de cette m&#233;thode &#224; la similarit&#233; de segments
plus larges que le mot fournirait de bon r&#233;sultats. L&#8217;utilisation unique d&#8217;un thesaurus multilingue
sans un recours &#224; des lexiques multilingues est aussi envisageable. Ainsi, Steinberger et al. (2002)
exploitent les descripteurs du thesaurus multilingue EUROVOC 7. Ils calculent par ce moyen la
</p>
<p>5. http://www.globalwordnet.org
6. http://lcl.uniroma1.it/babelnet/
7. http://eurovoc.europa.eu/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>62 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>similarit&#233; de documents de diff&#233;rentes langues &#224; partir de leurs repr&#233;sentations conceptuelles. Un
inconv&#233;nient de cette approche est l&#8217;effort consid&#233;rable consacr&#233; &#224; l&#8217;annotation manuelle d&#8217;une
collection d&#8217;apprentissage en concepts du thesaurus pour l&#8217;annotation automatique de nouveaux
documents &#224; comparer.
</p>
<p>Dans notre but de classifier des documents multilingues, nous nous orientons vers cette approche.
Sa nature hybride r&#233;side dans le fait qu&#8217;elle permette de comparer des documents &#224; l&#8217;aide d&#8217;une
ressource s&#233;mantique et d&#8217;informations en corpus sur les mots dans les documents &#224; comparer.
La mesure de similarit&#233; ainsi d&#233;finie est le principal &#233;l&#233;ment pris en compte par les techniques de
construction de corpus multilingues.
</p>
<p>3.3 M&#233;thodes de construction de corpus multilingues
</p>
<p>Nous abordons dans cette section les principales approches d&#8217;acquisition et de structuration de
documents multilingues. L&#8217;approche Web que nous aborderons est le crawling th&#233;matique. Celles
pouvant &#234;tre r&#233;alis&#233;es ind&#233;pendamment du Web sont la RII et le clustering.
</p>
<p>3.3.1 Le crawling th&#233;matique
</p>
<p>Une m&#233;thode d&#8217;extraction de corpus du Web est le crawling qui consiste &#224; utiliser les liens entre les
pages pour collecter les documents. Les crawlers th&#233;matiques ont &#233;t&#233; d&#233;velopp&#233;s pour identifier
les sections du Web pertinentes par rapport &#224; un th&#232;me donn&#233; . Talvensaari et al. (2008) utilisent
cette m&#233;thode pour compiler un corpus comparable de sp&#233;cialit&#233; anglais-espagnol-allemand. Les
donn&#233;es de d&#233;part sont un ensemble d&#8217;URLs refl&#233;tant un sujet donn&#233;. Les pages correspondantes
sont extraites et celles dont les liens figurent dans ces pages initiales sont &#233;galement visit&#233;s et
prises en compte si le lien th&#233;matique avec les pages initiales peut &#234;tre &#233;tabli. L&#8217;identification du
domaine dans les pages candidates se fait sur la base de terminologies collect&#233;es s&#233;par&#233;ment
pour chaque langue.
</p>
<p>Puisque nous n&#8217;envisageons pas de d&#233;velopper des techniques d&#8217;extraction de documents de
l&#8217;Internet nous nous int&#233;ressons aux approches ind&#233;pendantes du Web ci-dessous.
</p>
<p>3.3.2 Recherche d&#8217;information interlingue
</p>
<p>Partant de collections de diff&#233;rentes langues, l&#8217;approche de RII est aussi utilis&#233;e pour collecter
des textes comparables. Elle consiste en l&#8217;obtention &#224; partir d&#8217;une collection source, de mots cl&#233;s
qui sont ensuite traduits et utilis&#233;s comme des requ&#234;tes ex&#233;cut&#233;es sur la collection cible pour
obtenir les documents souhait&#233;s. Talvensaari et al. (2007) proposent une approche de RII pour la
construction d&#8217;un corpus comparable su&#233;dois-anglais. Les mots cl&#233;s sont extraits des documents
sources par la RATF. Leurs traductions sont ex&#233;cut&#233;es comme requ&#234;tes sur la collection cible par
le syst&#232;me de recherche d&#8217;information Indri qui fait partie du projet Lemur 8. Les documents
obtenus avec cette technique sont appari&#233;s ou class&#233;s en fonction de leurs scores de similarit&#233;
avec un document source alors que la m&#233;thode de clustering dans la section suivante permet
d&#8217;obtenir des clusters ou groupes de documents.
</p>
<p>8. www.lemurproject.org
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>63 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.3.3 Clustering de documents
</p>
<p>Le clustering de documents se d&#233;finit comme la r&#233;partition d&#8217;un ensemble de textes dans des
groupes selon leurs traits de similarit&#233; sans connaissances a priori. Les documents ayant des
caract&#233;ristiques communes devraient appara&#238;tre dans le m&#234;me cluster (Montalvo et al., 2006).
R&#233;ciproquement, les documents non- ou peu similaires devraient appartenir &#224; des clusters
distincts.
</p>
<p>Pour cr&#233;er des clusters de documents, Li et al. (2011) utilisent l&#8217;approche agglom&#233;rative as-
cendante. Ils obtiennent des clusters bilingues &#224; partir d&#8217;une partie d&#8217;un corpus initial. Cette
partie regroupe des textes au-dessus d&#8217;un seuil minimum de similarit&#233; qui serviront &#224; former le
corpus comparable. La m&#234;me proc&#233;dure est reproduite sur la partie restante du corpus initial
par l&#8217;int&#233;gration de donn&#233;es externes et la cr&#233;ation &#233;ventuelle de nouveaux clusters. Ert&#246;z et al.
(2003) utilisent quant &#224; eux l&#8217;algorithme de clustering Shared Nearest Neighbour (SNN). Selon
cette m&#233;thode, deux documents ont plus de chance d&#8217;appartenir au m&#234;me cluster s&#8217;ils ont en
commun un nombre &#233;lev&#233; de voisins. Ils la comparent &#224; la m&#233;thode de K-means selon laquelle
un document appartient &#224; un cluster s&#8217;il est proche d&#8217;un nombre moyen de documents dans ce
cluster (Ert&#246;z et al., 2003).
</p>
<p>Nous privil&#233;gions le clustering qui va plus loin qu&#8217;un simple appariement ou alignement de
documents similaires en organisant les documents en groupes.
</p>
<p>4 &#201;valuation
</p>
<p>4.1 &#201;valuation intrins&#232;que
</p>
<p>La valeur d&#8217;une m&#233;thode de compilation de corpus multilingues peut &#234;tre estim&#233;e &#224; la qualit&#233;
des donn&#233;es qui en r&#233;sultent. Il s&#8217;agit d&#8217;une &#233;valuation intrins&#232;que. La m&#233;thode courante est la
comparaison des scores de similarit&#233; attribu&#233;s automatiquement &#224; ceux attribu&#233;s manuellement.
Une &#233;chelle de similarit&#233; est alors utilis&#233;e pour le jugement humain (voir section 2.1.2). Une cor-
r&#233;lation faible entre ces deux types de r&#233;sultats signifie g&#233;n&#233;ralement une mauvaise performance
du syst&#232;me automatique &#233;tant donn&#233; que le jugement humain tient lieu de r&#233;f&#233;rence.
</p>
<p>Pour &#233;valuer leur m&#233;thode de calcul de la similarit&#233; prenant uniquement en compte les titres
des articles, Aker et al. (2012) comparent la qualit&#233; des alignements obtenus avec celle des
alignements produits lorsque le contenu entier de l&#8217;article est utilis&#233;. Ils examinent en outre
la correspondance entre les r&#233;sultats de ces m&#233;thodes automatiques et la norme que sont les
r&#233;sultats humains. Li et Gaussier (2010) r&#233;alisent l&#8217;ensemble de l&#8217;&#233;valuation automatiquement
contournant ainsi l&#8217;effort d&#8217;annotation manuelle. Le corpus de r&#233;f&#233;rence est constitu&#233; par des
corpus dont la comparabilit&#233; est graduellement r&#233;duite par l&#8217;import de donn&#233;es externes. La
corr&#233;lation entre les scores de similarit&#233; des documents du corpus de r&#233;f&#233;rence ainsi construit et
ceux obtenus automatiquement est calcul&#233;e par le coefficent de Pearson. Steinberger et al. (2002)
utilisent comme crit&#232;re d&#8217;&#233;valuation la capacit&#233; de leur m&#233;thode &#224; identifier des documents
parall&#232;les en leur attribuant les scores de similarit&#233; les plus &#233;lev&#233;s.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>64 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.2 &#201;valuation extrins&#232;que
</p>
<p>Nous avons vu en section 2.2, les applications des corpus multilingues en TAL. La qualit&#233; des
donn&#233;es multilingues obtenues est d&#233;termin&#233;e par leur apport dans ces applications. C&#8217;est
le cas de l&#8217;&#233;tude de Talvensaari et al. (2007) dans laquelle le corpus comparable obtenu est
utilis&#233; comme un th&#233;saurus de similarit&#233; accompagn&#233; d&#8217;un outil de traduction pour am&#233;liorer
la traduction des requ&#234;tes et par ricochet la performance d&#8217;un syst&#232;me de RII. Bin et al. (2010)
entra&#238;nent et testent un syst&#232;me de traduction automatique avec un corpus de phrases parall&#232;les
obtenu &#224; partir d&#8217;un corpus comparable. Li et al. (2011) &#233;valuent la qualit&#233; du corpus comparable
obtenu dans l&#8217;application d&#8217;extraction de lexiques bilingues. Ils examinent en outre l&#8217;apport des
lexiques bilingues obtenus en RII.
</p>
<p>Des variantes de ces m&#233;thodes d&#8217;&#233;valuation sont dans un cadre intrins&#232;que, la comparaison
des r&#233;sultats de plusieurs m&#233;thodes automatiques au jugement humain sur les m&#234;mes donn&#233;es
(Mihalcea et al., 2006). Pour une &#233;valuation extrins&#232;que, cela reviendrait &#224; utiliser les donn&#233;es
multilingues obtenues d&#8217;une m&#234;me source par diff&#233;rentes techniques de similarit&#233; dans une
m&#234;me application et &#224; comparer leurs apports.
</p>
<p>Nous avons abord&#233; le sujet de la construction de corpus multilingues en passant en revue quelques
principes th&#233;oriques et les principales m&#233;thodes d&#233;velopp&#233;es dans ce domaine. Il convient &#224;
pr&#233;sent de situer l&#8217;apport envisag&#233; dans cette &#233;tat de l&#8217;art.
</p>
<p>5 Contributions envisag&#233;es
</p>
<p>Dans cette partie, nous pr&#233;sentons les limites de la litt&#233;rature et soulignons quelques perspectives
futures notamment celles que nous envisageons de r&#233;aliser.
</p>
<p>Comme nous l&#8217;avons observ&#233; en section 2.1.1, la comparabilit&#233; se d&#233;finit dans les limites d&#8217;une
application. En extraction de lexiques bilingues, elle se mesure g&#233;n&#233;ralement &#224; la quantit&#233; de
vocabulaire que des documents ont en commun (Li et al., 2011). La comparabilit&#233; en termes de
vocabulaire est-elle suffisante ? Dans un cadre de sp&#233;cialit&#233; o&#249; terminologie et vocabulaire n&#8217;ont
pas la m&#234;me pr&#233;s&#233;ance, l&#8217;injection de connaissances du domaine ne serait-elle pas n&#233;cessaire &#224; la
comparabilit&#233; ? Nous pr&#233;voyons d&#8217;&#233;valuer cette hypoth&#232;se de la comparabilit&#233; et &#233;ventuellement
de l&#8217;affiner dans notre objectif de concevoir une mesure de similarit&#233; permettant d&#8217;obtenir des
donn&#233;es hautement homog&#232;nes. Les mesures de similarit&#233; textuelle ont &#233;t&#233; largement explor&#233;es
dans un cadre monolingue avec des m&#233;thodes bas&#233;es sur des statistiques de corpus ou sur la struc-
ture de ressources ontologiques. Afin d&#8217;&#233;laborer une mesure de similarit&#233; textuelle translingue et
hautement s&#233;mantique, nous partirons de corpus multilingues faiblement comparables pour en
extraire des sous corpus de meilleure qualit&#233;. Notre approche consistera dans la repr&#233;sentation
conceptuelle de documents par des descripteurs d&#8217;un thesaurus en s&#8217;aidant des contextes d&#8217;oc-
currences des mots dans ces documents. Ceci permettra une meilleure attribution des concepts
aux documents. Le calcul de la similarit&#233; textuelle se fera entre ces repr&#233;sentations. La prise
en compte de crit&#232;res suppl&#233;mentaires permettra de parfaire la mesure de similarit&#233; pour une
meilleure classification de documents. Nous adoptons comme approche de construction de corpus
multilingues, le clustering qui nous permettra de former des sous corpus ou clusters &#224; partir
de notre collection de d&#233;part. Les techniques existantes de clustering ne traitent g&#233;n&#233;ralement
pas de la mise &#224; jour des clusters. Comment permettre l&#8217;int&#233;gration continuelle de nouveaux
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>65 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>textes &#224; la base ? Le probl&#232;me de clustering du flux de donn&#233;es restant ouvert, nous pensons que
le clustering incr&#233;mental (Kurtz, 2012) serait une solution appropri&#233;e. Le corpus multilingue
obtenu par cette m&#233;thode sera &#233;valu&#233; en extraction de lexiques, plus pr&#233;cis&#233;ment de n&#233;ologismes
multilingues. A notre connaissance, aucune &#233;tude dans le domaine n&#8217;a &#233;t&#233; entreprise dans cet
objectif.
</p>
<p>6 Conclusion
</p>
<p>Dans cet article, nous avons abord&#233; la construction de corpus multilingues sous plusieurs
aspects. Nous avons pu constater que la notion de comparabilit&#233; et les applications de corpus
multilingues en traitement automatique des langues sont &#233;troitement li&#233;es. En effet, la d&#233;finition
de la comparabilit&#233; devrait se limiter dans un cadre applicatif donn&#233;. Les mesures de similarit&#233;
textuelles ont g&#233;n&#233;ralement suivies les approches statistiques et s&#233;mantiques utilis&#233;es en majorit&#233;
dans un contexte monolingue. Les approches hybrides multilingues sont un domaine de la
similarit&#233; textuelle peu explor&#233;. Pour ce qui est des techniques de clustering de documents
existantes, entre autres les m&#233;thodes agglom&#233;rative hi&#233;rarchique, k-means et SNN, elles effectuent
une classification ponctuelle et ne r&#233;solvent pas le probl&#232;me de l&#8217;ajout permanent de textes &#224;
une base. Au vu des limites identifi&#233;es, nous pr&#233;voyons de fournir une description plus fine
de la comparabilit&#233; pour l&#8217;extraction de lexiques multilingues. Nous envisageons &#233;galement
d&#8217;adapter une/plusieurs des m&#233;thodes de classification existante(s) au clustering incr&#233;mental. La
mesure hybride d&#233;velopp&#233;e d&#233;terminera la similarit&#233; de textes &#224; travers leurs repr&#233;sentations
conceptuelles pour l&#8217;application d&#8217;extraction de n&#233;ologismes multilingues.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AKER, A., KANOULAS, E. et GAIZAUSKAS, R. (2012). A Light Way to Collect Comparable Corpora
from the Web. In Proceedings of LREC 2012, pages 21&#8211;27, Istanbul, Turquie.
</p>
<p>BARADARAN HASHEMI, H., SHAKERY, A. et FAILI, H. (2010). Creating a Persian-English Comparable
Corpus. In Proceedings of the 2010 international conference on Multilingual and multimodal
information access evaluation, pages 27&#8211;39, Padoue, Italie.
</p>
<p>BEKAVAC, B., OSENOVA, P., SIMOV, K. et TADIC, M. (2004). Making Monolingual Corpora Compa-
rable : a Case Study of Bulgarian and Croatian. In Proceedings of the 4th Language Resources and
Evaluation Conference, pages 1187&#8211;1190, Lisbonne, Portugal.
</p>
<p>BIN, L., JIANG, T., CHOW, K. et BENJAMIN K., T. (2010). Building a Large English-Chinese Parallel
Corpus from Comparable Patents and its Experimental Application to SMT. In Proceedings of the
3rd Workshop on Building and Using Comparable Corpora, pages 42&#8211;49, La Valette, Malte.
</p>
<p>BLANCAFORT, H., DAILLE, B., GORNOSTAY, T., HEID, U., SHAROFF, S. et M&#201;CHOULAM, C. (2010).
TTC : Terminology Extraction, Translation Tools and Comparable Corpora. In Proceedings of
EURALEX 2010, pages 263&#8211;268, Leeuwarden/Ljouwert, Pays-Bas.
</p>
<p>BRASCHLER, M. et SCH&#196;UBLE, P. (1998). Multilingual Information Retrieval Based on Document
Alignment Techniques. In Proceedings of the 2nd European Conference on Research and Advanced
Technology for Digital Libraries, pages 183&#8211;197, Heraklion, Cr&#232;te, Gr&#232;ce.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>66 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CORLEY, C. et MIHALCEA, R. (2005). Measuring the Semantic Similarity of Texts. In Proceedings
of the ACL Workshop on Empirical Modeling of Semantic Equivalence and Entailment, pages 13&#8211;18,
Ann Arbor, Michigan, USA.
ERT&#214;Z, L., STEINBACH, M. et KUMAR, V. (2003). Finding Topics in Collections of Documents : A
Shared Nearest Neighbor Approach. Clustering and Information Retrieval, 11:83&#8211;103.
FUNG, P. et YEE, L. Y. (1998). An IR approach for Translating New Words from Nonparal-
lel, Comparable Texts. In Proceedings of the 17th International Conference on Computational
linguistics-Volume 1, pages 414&#8211;420.
GOEURIOT, L., MORIN, E. et DAILLE, B. (2009). Compilation of Specialized Comparable Corpora
in French and Japanese. In Proceedings of the 2nd Workshop on Building and Using Comparable
Corpora : from Parallel to Non-parallel Corpora, pages 55&#8211;63, Suntec, Singapore.
ION, R. (2012). PEXACC : A Parallel Sentence Mining Algorithm from Comparable Corpora. In
Proceedings of the Eight International Conference on Language Resources and Evaluation, pages
2181&#8211;2188, Istanbul, Tuquie.
ION, R., TUFIS, D., BOROS, T., CEAUSU, A. et STEFANESCU, D. (2010). On-Line Compilation of
Comparable Corpora and their Evaluation. In FASSBL7, pages 29&#8211;33, Dubrovnik, Crotia.
JIANG, J. J. et CONRATH, D. W. (1997). Semantic Similarity Based on Corpus Statistics and Lexical
Taxonomy. In Proceedings of International Conference Research on Computational Linguistics
(ROCLING X), 1997, Taipei, Taiwan.
KURTZ, C. (2012). Une distance hi&#233;rarchique bas&#233;e sur la s&#233;mantique pour la comparaison
d&#8217;histogrammes nominaux. In Actes de Conf&#233;rence Internationale Francophone sur l&#8217;Extraction et
la Gestion de Connaissance, pages 77&#8211;88, Bordeaux, France.
LEACOCK, C. et CHODOROW, M. (1998). Combining Local Context and WordNet Similarity for
Word Wense Identification. In WordNet : An electronic lexical database, page 265&#8211;283. Fellbaum,
C., Cambridge, MA, MIT Press &#233;dition.
LETURIA, I., SAN VICENTE, I. et SARALEGI, X. (2009). Search Engine Based Approaches for
Collecting Domain-specific Basque-English Comparable Corpora from the Internet. In Proceedings
of the Fifth Web as Corpus Workshop, pages 53&#8211;61, Donostia-San Sebastian, Basque Country,
Spain.
LI, B. et GAUSSIER, E. (2010). Improving Corpus Comparability for Bilingual Lexicon Extraction
from Comparable Corpora. In Proceedings of the 23rd International Conference on Computational
Linguistics, pages 644&#8211;652, Beijing, China.
LI, B., GAUSSIER, E., MORIN, E. et HAZEM, A. (2011). Degr&#233; de comparabilit&#233;, extraction
lexicale bilingue et recherche d&#8217;information interlingue. In 18&#232;me conf&#233;rence sur le Traitement
Automatique des Langues Naturelles, Montpellier, France.
MCENERY, A. M. et XIAO, R. Z. (2007). Parallel and Comparable Corpora : what are they up to ?
In Incorporating Corpora : Translation and the Linguist. Anderman, G. &amp; Rogers, M., Clevedon,
UK, Multilingual Matters &#233;dition.
MIHALCEA, R., CORLEY, C. et STRAPPARAVA, C. (2006). Corpus-based and Knowledge-based
Measures of Text Semantic Similarity. In Proceedings of the 21st national conference on Artificial
intelligence, volume 1, pages 775&#8211;780, Boston, MA, USA.
MOHAMMAD, S., GUREVYCH, I., HIRST, G. et ZESCH, T. (2007). Cross-lingual Distributional Profiles
of Concepts for Measuring Semantic Distance. In Proceedings of the 2007 Joint Conference on
Empirical Methods in Natural Language Processing and Computational Natural Language Learning,
pages 571&#8211;580, Prague, R&#233;publique tch&#232;que.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>67 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MONTALVO, S., MARTINEZ, R., CASILLAS, A. et FRESNO, V. (2006). Multilingual Document Clus-
tering : an Heuristic Approach Based on Cognate Named Entities. In Proceedings of the 21st
International Conference on Computational Linguistics, volume 44, pages 1145&#8211;1152, Sydney,
Australie.
</p>
<p>PARAMITA, M., CLOUGH, P., AKER, A. et GAIZAUSKAS, R. (2012). Correlation between Similarity
Measures for Inter-Language Linked Wikipedia Articles. In Proceedings of the Eighth International
Conference on Language Resources and Evaluation, pages 790&#8211;797, Istanbul, Tuquie.
</p>
<p>PIRKOLA, A., LEPP&#196;NEN, E. et J&#196;RVELIN, K. (2002). The RATF Formula (Kwok&#8217;s formula) : Exploiting
Average Term Frequency in Cross-language Retrieval. Information Research, 7(2):7&#8211;2.
</p>
<p>RAMOS, J. (2003). Using TF-IDF to Determine Word Relevance in Document Queries. In
Proceedings of the First Instructional Conference on Machine Learning, Piscataway, NJ USA.
</p>
<p>RESNIK, P. (1999). Mining the Web for Bilingual Text. In Proceedings of the 37th annual meeting
of the Association for Computational Linguistics, pages 527&#8211;534, College Park, Maryland, USA.
</p>
<p>SKADIN&#807;A, I., AKER, A., GIOULI, V., TUFIS&#807;, D., GAIZAUSKAS, R., MIERIA, M. et MASTROPAVLOS, N.
(2010). A Collection of Comparable Corpora for Under-resourced Languages. In Proceedings of
the Fourth International Conference Baltic HLT, pages 161&#8211;168, Riga, Latvia.
</p>
<p>STEINBERGER, R., POULIQUEN, B. et HAGMAN, J. (2002). Cross-lingual Document Similarity
Calculation Using the Multilingual Thesaurus Eurovoc. In Proceedings of the 3rd International
Conference on Intelligent Text Processing and Computational Linguistics, pages 415&#8211;424, Mexico,
Mexique.
</p>
<p>SU, F. et BABYCH, B. (2012). Measuring Comparability of Documents in Non-parallel Corpora
for Efficient Extraction of (Semi-)Parallel Translation Equivalents. In Proceedings of the 13th
Conference of the European Chapter of the Association for Computational Linguistics, pages 10&#8211;19,
Avignon, France.
</p>
<p>TALVENSAARI, T., LAURIKKALA, J., J&#196;RVELIN, K., JUHOLA, M. et KESKUSTALO, H. (2007). Creating and
Exploiting a Comparable Corpus in Cross-language Information Retrieval. ACM TOIS, 25(1):4.
</p>
<p>TALVENSAARI, T., PIRKOLA, A., J&#196;RVELIN, K., JUHOLA, M. et LAURIKKALA, J. (2008). Focused Web
Crawling in the Acquisition of Comparable Corpora. IR, 11(5):427&#8211;445.
</p>
<p>UTSURO, T., HORIUCHI, T., CHIBA, Y. et HAMAMOTO, T. (2002). Semi-automatic Compilation of
Bilingual Lexicon Entries from Cross-lingually Relevant News Articles onWWW News Sites.
In Proccedings of the 5th Conference of the Association for Machine Translation in the Americas
(AMTA) : From Research to Real Users, pages 165&#8211;176, Tiburon, CA, USA.
</p>
<p>YAPOMO, M., CORPAS, G. et MITKOV, R. (2012). CLIR- and Ontology-based Approach for Bilingual
Extraction of Comparable Documents. In Proceedings of the 5th Workshop on Building and Using
Comparable Corpora, pages 121&#8211;125, Istanbul, Turquie.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>68 c&#65535; ATALA</p>

</div></div>
</body></html>