<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Acquisition de lexique bilingue d&#8217;expressions polylexicales: Une application &#224; la traduction automatique statistique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition de lexique bilingue d&#8217;expressions polylexicales:
une application &#224; la traduction automatique statistique
</p>
<p>Dhouha Bouamor
CEA-LIST, LVIC, F91191 Gif sur Yvette Cedex, France
</p>
<p>LIMSI-CNRS, F-91403 Orsay, France
Univ. Paris Sud, Orsay, France
dhouha.bouamor@cea.fr
</p>
<p>R&#201;SUM&#201;
Cet article d&#233;crit une m&#233;thode permettant d&#8217;acqu&#233;rir un lexique bilingue d&#8217;expressions polylexi-
cales (EPLS) &#224; partir d&#8217;un corpus parall&#232;le fran&#231;ais-anglais. Nous identifions dans un premier
temps les EPLS dans chaque partie du corpus parall&#232;le. Ensuite, nous proposons un algorithme
d&#8217;alignement assurant la mise en correspondance bilingue d&#8217;EPLS. Pour mesurer l&#8217;apport du
lexique construit, une &#233;valuation bas&#233;e sur la t&#226;che de Traduction Automatique Statistique (TAS)
est men&#233;e. Nous &#233;tudions les performances de trois strat&#233;gies dynamiques et d&#8217;une strat&#233;gie
statique pour int&#233;grer le lexique bilingue d&#8217;expressions polylexicales dans un syst&#232;me de TAS.
Les exp&#233;riences men&#233;es dans ce cadre montrent que ces unit&#233;s am&#233;liorent significativement la
qualit&#233; de traduction.
</p>
<p>ABSTRACT
Mining a Bilingual Lexicon of MultiWord Expressions : A Statistical Machine Translation
Evaluation Perspective
</p>
<p>This paper describes a method aiming to construct a bilingual lexicon of MultiWord Expressions
(MWES) from a French-English parallel corpus. We first extract monolingual MWES from each
part of the parallel corpus. The second step consists in acquiring bilingual correspondences of
MWEs. In order to assess the quality of the mined lexicon, a Statistical Machine Translation (SMT)
task-based evaluation is conducted. We investigate the performance of three dynamic strategies
and of one static strategy to integrate the mined bilingual MWES lexicon in a SMT system.
Experimental results show that such a lexicon significantly improves the quality of translation.
</p>
<p>MOTS-CL&#201;S : Expression polylexicale, alignement bilingue, traduction automatique statistique.
KEYWORDS: MultiWord expression, bilingual alignment, statistical machine translation.
</p>
<p>1 Introduction
</p>
<p>Une expression polylexicale (EPL, en anglais multiword expression) peut &#234;tre d&#233;finie comme une
combinaison de mots pour lesquels les propri&#233;t&#233;s syntaxiques ou s&#233;mantiques de l&#8217;expression
enti&#232;re ne peuvent pas &#234;tre obtenues &#224; partir de ses parties (Sag et al., 2002). Les EPLS regroupent
les expressions fig&#233;es et semi-fig&#233;es (ex. cordon bleu), les collocations (ex. chemin de fer), les
entit&#233;s nomm&#233;es (ex. New York), les verbes &#224; particule (ex. grow up), les constructions &#224; verbe
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>1 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>support (ex. faire face &#224;), etc.(Sag et al., 2002; Constant et al., 2011). Elles sont fr&#233;quemment
employ&#233;es dans les textes &#233;crits &#233;tant donn&#233;e qu&#8217;elles constituent une part significative du lexique
d&#8217;une langue. Jackendoff (1997) estime que la fr&#233;quence de leur utilisation est &#233;quivalente &#224; celle
des mots simples. Bien qu&#8217;elles soient facilement employ&#233;es et reconnues par les humains, leur
identification pose un probl&#232;me majeur pour diverses applications du traitement automatique
des langues.
</p>
<p>Pour la Traduction Automatique Statistique (TAS), diverses am&#233;liorations ont &#233;t&#233; obtenues avec
l&#8217;&#233;mergence des approches &#224; base de segments (phrase based approaches en anglais) (Koehn
et al., 2003). Ces segments sont d&#233;finis comme &#233;tant de simples n-grammes syst&#233;matiquement
traduits dans un corpus parall&#232;le sans aucune motivation linguistique. Dans de tels syst&#232;mes, le
manque d&#8217;un traitement ad&#233;quat des EPLS pourrait affecter la qualit&#233; de la traduction. En effet,
la traduction litt&#233;rale d&#8217;une expression non reconnue par le syst&#232;me de traduction comme une
EPL constitue une cause principale &#224; une traduction erron&#233;e et incompr&#233;hensible. Par exemple,
un tel syst&#232;me proposera &#171; way of iron &#187; comme traduction pour &#171; chemin de fer &#187; au lieu de
&#171; railway &#187;. Il est donc important d&#8217;utiliser un lexique dans lequel les EPLS sont prises en compte.
Or un des points faibles des lexiques est souvent le manque de couverture pour ces unit&#233;s (Sagot
et al., 2005). Ce point a &#233;t&#233; abord&#233; dans plusieurs travaux (Fazly et Stevenson, 2007; Caseli et al.,
2009).
</p>
<p>Cet article porte sur le traitement des EPLS bilingues, allant de l&#8217;acquisition automatique &#224; partir
de corpus parall&#232;les &#224; leur int&#233;gration dans un syst&#232;me de TAS. Nous consid&#233;rons toute s&#233;quence
contigu&#235; non compositionnelle, appartenant &#224; l&#8217;une des classes d&#233;finies par (Luka et al., 2006),
comme une EPL. Ces unit&#233;s ont &#233;t&#233; class&#233;es dans trois classes, sur la base de leurs propri&#233;t&#233;s
cat&#233;gorielles, ainsi que de leur degr&#233; de figement syntaxique et s&#233;mantique. Les classes sont
constitu&#233;es de mots compos&#233;s, d&#8217;expressions idiomatiques et de collocations. Intuitivement, les
EPLS bilingues sont utiles pour am&#233;liorer les r&#233;sultats de la TAS. Cependant, des recherches plus
approfondies sont n&#233;cessaires pour trouver la meilleure fa&#231;on d&#8217;int&#233;grer ce type d&#8217;unit&#233;s dans ces
syst&#232;mes. Dans cette &#233;tude, nous consid&#233;rons la TAS comme un mode d&#8217;&#233;valuation extrins&#232;que de
l&#8217;utilit&#233; des EPLS et explorons diff&#233;rentes strat&#233;gies d&#8217;int&#233;gration de ces unit&#233;s dans un syst&#232;me
de TAS. &#201;tant donn&#233; un lexique bilingue d&#8217;EPLS, nous proposons (1) trois strat&#233;gies d&#8217;int&#233;gration
dynamiques o&#249; nous cherchons &#224; modifier le mod&#232;le de traduction de diff&#233;rentes fa&#231;ons pour
une prise en consid&#233;ration des EPLS bilingues et (2) une strat&#233;gie d&#8217;int&#233;gration statique dans
laquelle nous incorporons ces unit&#233;s sans changer le mod&#232;le de traduction.
</p>
<p>Le reste de l&#8217;article est organis&#233; comme suit : dans la section 2, nous passons en revue les
principaux travaux en rapport avec la t&#226;che d&#8217;extraction de traduction pour les EPLS. Puis, nous
d&#233;crivons, dans la section 3, l&#8217;approche utilis&#233;e pour identifier ces unit&#233;s et pr&#233;sentons, par la
suite, l&#8217;algorithme d&#8217;alignement que nous avons impl&#233;ment&#233;. Dans la section 4, nous d&#233;crivons
les strat&#233;gies d&#8217;int&#233;gration propos&#233;es. La section 5 est consacr&#233;e aux exp&#233;riences men&#233;es ainsi
qu&#8217;&#224; la pr&#233;sentation des r&#233;sultats obtenus. Nous concluons notre article par une pr&#233;sentation des
principales perspectives en section 6.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Au cours des derni&#232;res ann&#233;es, de nombreux travaux de recherche ont &#233;t&#233; men&#233;s sur la t&#226;che
d&#8217;extraction bilingue d&#8217;EPLS &#224; partir de corpus parall&#232;les. La plupart d&#8217;entre eux commencent
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>2 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>tout d&#8217;abord par identifier les EPLS dans chaque partie du corpus parall&#232;le, ensuite, se basent sur
diff&#233;rentes techniques d&#8217;alignement pour les apparier. Les techniques d&#8217;extraction monolingue
d&#8217;EPLS tournent autour de trois approches : (1) des m&#233;thodes symboliques reposant sur des
patrons morphosyntaxiques (Okita et al., 2010; Dagan et Church, 1994) ; (2) des m&#233;thodes
statistiques utilisant des mesures d&#8217;association pour classer les EPLS candidates (Vintar et Fisier,
2008) et (3) des m&#233;thodes hybrides combinant (1) et (2) (Seretan et Wehrli, 2007; Daille, 2001).
Aucune des approches n&#8217;est sans limitations. Il est difficile d&#8217;appliquer des m&#233;thodes symboliques
&#224; des donn&#233;es sans annotations morphosyntaxiques. En ce qui concerne les m&#233;thodes statistiques,
bien qu&#8217;elles soient con&#231;ues pour des bigrammes, elles exigent la d&#233;finition d&#8217;un seuil &#224; partir
duquel un segment extrait peut &#234;tre consid&#233;r&#233; comme une EPL.
</p>
<p>Pour identifier des correspondances entre expressions dans diff&#233;rentes langues, quelques travaux
font appel &#224; des outils d&#8217;alignement de mots simples pour guider l&#8217;alignement d&#8217;EPLs (Dagan et
Church, 1994). D&#8217;autres se basent sur des algorithmes d&#8217;apprentissage statistique comme par
exemple l&#8217;algorithme it&#233;ratif de r&#233;-estimation Expectation Maximization (Kupiec, 1993; Okita
et al., 2010). Une hypoth&#232;se largement suivie pour acqu&#233;rir des EPLS bilingues est qu&#8217;une
expression dans une langue source garde la m&#234;me structure syntaxique que son &#233;quivalente
dans une langue cible donn&#233;e (Seretan et Wehrli, 2007; Tufis et Ion, 2007). Or, les EPLS ne
se traduisent pas forc&#233;ment par des expressions ayant la m&#234;me cat&#233;gorie grammaticale (i.e
&#171; insulaire en d&#233;veloppement &#187; et &#171; small island developing &#187;) ou la m&#234;me longueur1 (i.e &#171; en ce qui
concerne &#187; et &#171; as regards &#187;).
</p>
<p>Le but principal de la majorit&#233; des travaux de recherche men&#233;s sur cet objet linguistique &#233;tait
l&#8217;acquisition a priori de correspondances entre les paires d&#8217;unit&#233;s textuelles pour l&#8217;enrichissement
de ressources lexicales. En comparaison, peu de travaux ont &#233;t&#233; r&#233;alis&#233;s sur l&#8217;exploitation de
telles ressources, afin de rendre possible leur int&#233;gration dans des applications cl&#233;s, telles que
la d&#233;sambigu&#239;sation s&#233;mantique (Finlayson et Kulkarni, 2011) ou la recherche d&#8217;information
interlingue (Vechtomova, 2005). En TAS, Lambert et Banchs (2005) introduisent une m&#233;thode
dans laquelle les EPLS sont consid&#233;r&#233;es comme un &#233;l&#233;ment unique dans le corpus d&#8217;appren-
tissage. En exploitant un corpus de petite taille, ils ont montr&#233; que la qualit&#233; de l&#8217;alignement
et la pr&#233;cision de traduction ont &#233;t&#233; am&#233;lior&#233;es. Cependant, ils ont obtenu, dans des &#233;tudes
plus r&#233;centes (Lambert et Banchs, 2006), bas&#233;es sur un corpus de taille importante, un score
BLEU (Papineni et al., 2002) plus bas. Nous citons notamment les travaux de (Ren et al., 2009)
qui impl&#233;mentent une m&#233;thode permettant d&#8217;int&#233;grer des termes multi-mots issus du domaine
m&#233;dical dans MOSES (Koehn et al., 2007). Leur m&#233;thode a permis de gagner 0,17 points de score
BLEU par rapport au syst&#232;me de r&#233;f&#233;rence. La pr&#233;sente &#233;tude est une extension de l&#8217;approche
pr&#233;sent&#233;e dans (Bouamor et al., 2011). Nous proposons tout d&#8217;abord une m&#233;thode ayant pour
but d&#8217;extraire et aligner des EPLS bilingues. Nous &#233;tudions ensuite l&#8217;impact de l&#8217;utilisation de ces
unit&#233;s dans un syst&#232;me de TAS.
</p>
<p>3 Acquisition de lexique bilingue d&#8217;EPLS
</p>
<p>Dans cette section, nous d&#233;crivons l&#8217;approche propos&#233;e pour extraire un lexique bilingue d&#8217;EPLS
&#224; partir d&#8217;un corpus parall&#232;le fran&#231;ais-anglais align&#233; au niveau de la phrase. Cette approche est
r&#233;alis&#233;e en deux &#233;tapes. Dans la premi&#232;re &#233;tape, nous identifions les EPLS dans chaque partie
</p>
<p>1La longueur d&#8217;une EPL est calcul&#233;e en nombre de mots
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>3 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>du corpus parall&#232;le. La deuxi&#232;me &#233;tape consiste en l&#8217;acquisition de correspondances bilingues
d&#8217;EPLS.
</p>
<p>3.1 Extraction monolingue d&#8217;EPLS
</p>
<p>La m&#233;thode d&#8217;identification monolingue d&#8217;EPLS est fond&#233;e sur une approche symbolique, tr&#232;s
similaire &#224; celle pr&#233;sent&#233; dans (Okita et al., 2010). L&#224; o&#249; ils d&#233;finissent des patrons pour extraire
seulement des syntagmes nominaux, notre approche identifie &#224; la fois des syntagmes nominaux,
des expressions fig&#233;es et des entit&#233;s nomm&#233;es. La m&#233;thode propos&#233;e requiert simplement une
analyse morphosyntaxique des textes source et cible, comme &#233;tape pr&#233;liminaire &#224; la proc&#233;dure
de construction d&#8217;expressions. Nous faisons donc appel &#224; la plate forme d&#8217;analyse multilingue
LIMA du CEA-LIST (Besan&#231;on et al., 2010), qui produit une liste de lemmes &#233;tiquet&#233;s par leurs
cat&#233;gories grammaticales. Le processus d&#8217;identification d&#8217;EPLS op&#232;re sur des lemmes plut&#244;t que
sur des formes de surface.
</p>
<p>Comme la plupart des expressions sont constitu&#233;es de combinaisons de noms,d&#8217;adjectifs ou
encore de pr&#233;positions, nous produisons une liste de n-grammes candidats (2&#8804; n&#8804; 4), dont la
structure morphosyntaxique respecte une configuration pr&#233;d&#233;finie, telle que celles d&#233;crites dans
le tableau 1. seize configurations ont &#233;t&#233; manuellement d&#233;finies. Notons qu&#8217;il existe des patrons
d&#8217;extraction (ou configurations) pour lesquels aucune EPL n&#8217;a &#233;t&#233; produite (c-&#224;-d. Past_Participle-
Noun). Un tel type d&#8217;analyse permet de ne garder que des n-grammes jug&#233;s pertinents et d&#8217;&#233;carter
ceux constitu&#233;s de mots vides comme par exemple &#171; is a, of the, de la &#187;.
</p>
<p>Configuration Exemples anglais/fran&#231;ais
Adj-Noun Plenary meeting/Libre circulation
Noun-Adj Oil tanker/Parlement europ&#233;en
Noun-Noun Member state/Etat membre
Past_Participle-Noun Developped country/. . .
Noun-Past_Participle Parliament adopted/Pays developp&#233;
Adj-Adj-Noun European public prosecutor/. . .
Adj-Noun-Adj Social market economy/Bon conduite administratif
Adj-Noun-Noun Renewable energy source/. . .
Noun-Noun-Adj . . ./Industrie automobile allemand
Noun-Adj-Adj . . ./Minist&#232;re public europ&#233;en
Adj-Noun-Adj Social fund assistance/Important d&#233;bat politique
Noun-Prep-Noun Point of view/Chemin de fer
Noun-Prep-Adj-Noun Court of first instance/Court de premier instance
Noun-Prep-Noun-Adj . . ./Source d&#8217;&#233;nergie renouvelable
Adj-Noun-Prep-Noun European court of justice/. . .
Noun-Adj-Prep-Noun . . ./Politique europ&#233;en de concurrence
</p>
<p>TABLE 1 &#8211; Configurations morphosyntaxiques permises.
</p>
<p>A cette liste de candidats, nous ajoutons des expressions idiomatiques pr&#233;positionnelles comme
par exemple &#171; in the light of, with regard to, en ce qui concerne. . . &#187; et des entit&#233;s nomm&#233;es telles
que &#171; Middle East, South Africa, El-Salvador. . . &#187; reconnues par la plate-forme LIMA. Le r&#233;sultat
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>4 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ID.PHRASE PHRASE
2 . . .semblerait &#234;tre &#224; nouveau mis en accusation, le minist&#232;re public . . .
55 . . .vous demande donc &#224; nouveau de faire le n&#233;cessaire . . .
</p>
<p>n&#8722; 1 . . .aussi de promouvoir &#224; nouveau l&#8217;activit&#233; des femmes . . .
n . . .que le r&#232;glement soit &#224; nouveau modifi&#233; en collaboration . . .&#8659;
</p>
<p>1 2 3 4 .............. 55 ................... n&#8722; 1 n
&#224; nouveau 0 1 0 0 ............... 1 .................. 1 1
</p>
<p>FIGURE 1 &#8211; Repr&#233;sentation vectorielle de l&#8217;expression &#171; &#224; nouveau &#187;. ID.PHRASE correspond &#224; un
identifiant unique de la phrase contenant l&#8217;expression dans notre corpus.
</p>
<p>de l&#8217;extraction est repr&#233;sent&#233; par une liste de candidats tri&#233;e par ordre d&#233;croissant selon leur
fr&#233;quence dans le corpus. Plusieurs candidats parmi ceux produits apparaissent dans d&#8217;autres
candidats. Afin d&#8217;&#233;viter un effet de surg&#233;n&#233;ration, nous proposons les heuristiques de nettoyage
suivantes :
&#8722; Si une expression est imbriqu&#233;e dans une autre et qu&#8217;elles ont la m&#234;me fr&#233;quence, on ne garde
que la plus couvrante (plus longue).
</p>
<p>&#8722; Si une expression appara&#238;t dans un grand nombre d&#8217;autres expressions, nous suivons l&#8217;approche
propos&#233;e par (Frantzi et al., 2000) et &#233;liminons toutes les expressions plus longues.
</p>
<p>&#192; la diff&#233;rence de beaucoup d&#8217;autres syst&#232;mes existants (Daille, 2001; Seretan et Wehrli, 2007;
Vintar et Fisier, 2008), notre syst&#232;me n&#8217;applique pas de filtre fond&#233; sur des mesures d&#8217;association
ou sur la fr&#233;quence. Nous prenons en consid&#233;ration toutes les expressions extraites, aussi bien
fr&#233;quentes que non fr&#233;quentes et celles dont le degr&#233; de corr&#233;lation entre ses constituants est
&#233;lev&#233; ou faible. A notre connaissance, aucune approche n&#8217;a pris en consid&#233;ration tout l&#8217;ensemble.
</p>
<p>3.2 M&#233;thode d&#8217;alignement
</p>
<p>Dans cette section, nous pr&#233;sentons une m&#233;thode qui tente de trouver, pour chaque expression
source, la traduction qui lui est ad&#233;quate dans l&#8217;ensemble d&#8217;expressions cibles. Cette t&#226;che pose
de s&#233;rieux probl&#232;mes en l&#8217;absence de ressources externes comme les dictionnaires bilingues ou
les outils d&#8217;alignement de mots simples. Nous proposons une m&#233;thode ind&#233;pendante de toute
ressource externe, qui requiert simplement un corpus parall&#232;le et la liste de candidats source et
cible &#224; traduire. Notre approche h&#233;rite de la s&#233;mantique distributionnelle, o&#249; nous associons &#224;
chaque expression source et cible une repr&#233;sentation sp&#233;cifique qui servira par la suite de base
pour l&#8217;&#233;tablissement d&#8217;une relation de traduction entre chaque paire d&#8217;expressions (source, cible).
Nous faisons appel au mod&#232;le vectoriel (Salton et al., 1975), un mod&#232;le alg&#233;brique souvent utilis&#233;
en recherche d&#8217;information. Nous repr&#233;sentons chaque expression par un vecteur de dimension n
(nombre de phrases dans le corpus) indiquant si elle appara&#238;t ou non dans chaque phrase du
corpus. La figure 1 d&#233;crit le vecteur repr&#233;sentant l&#8217;EPL fran&#231;aise &#171; &#224; nouveau &#187;.
</p>
<p>Pour extraire des paires de traduction d&#8217;EPLS, nous proposons un algorithme it&#233;ratif d&#8217;alignement
op&#233;rant de la fa&#231;on suivante :
</p>
<p>1. Trouver l&#8217;expression la plus fr&#233;quente dans chaque phrase source.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>5 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ais &#8594; Anglais
parlement europ&#233;en &#8594; european parliament
</p>
<p>&#233;tat par &#233;tat &#8594; amount of state
coup d&#8217;&#233;tat &#8594; military coup
</p>
<p>zone non fumeur &#8594; no smoking area
insulaire en d&#233;veloppement &#8594; small island developing
</p>
<p>de bonne foi &#8594; good faith
politique de concurrence &#8594; competition policy
</p>
<p>chemin de fer &#8594; railway sector
en ce qui concerne &#8594; in regard to
en ce qui concerne &#8594; as regards
en ce qui concerne &#8594; with reference to
en ce qui concerne &#8594; with respect to
</p>
<p>coupe forestier &#8594; cut in forestation
TABLE 2 &#8211; Exemples d&#8217;EPLS bilingues align&#233;es par l&#8217;algorithme d&#233;crit ci-dessus.
</p>
<p>2. Extraire les expressions cibles qui apparaissent dans toutes les phrases parall&#232;les &#224; celles
o&#249; figure l&#8217;expression source.
</p>
<p>3. Calculer un score de confiance pour chaque couple (source, cible).
</p>
<p>4. Consid&#233;rer l&#8217;expression cible qui maximise ce score comme la meilleure traduction.
</p>
<p>5. Supprimer la paire de traductions du processus et retourner vers 1.
</p>
<p>Le score de confiance est calcul&#233; sur la base de la mesure de l&#8217;indice de Jaccard (&#233;quation 1).
</p>
<p>Jaccard=
Ist
</p>
<p>Vs + Vt &#8722; Ist (1)
</p>
<p>Cette mesure est fond&#233;e principalement sur le calcul de nombre de phrases partag&#233;es par chaque
expression source et cible nomm&#233; ici Ist qu&#8217;on normalise par la somme des normes des vecteurs
Vs et Vt diminu&#233; de l&#8217;ensemble d&#8217;intersection.
</p>
<p>En observant certaines paires d&#8217;expressions du tableau 2, nous remarquons que notre m&#233;thode
pr&#233;sente plusieurs avantages. Premi&#232;rement, pour trouver la traduction ad&#233;quate pour chaque
EPL et contrairement &#224; la plupart des travaux ant&#233;rieurs (Dagan et Church, 1994; Ren et al., 2009)
qui reposent sur la traduction mot &#224; mot des composantes d&#8217;une EPL, notre m&#233;thode capture
l&#8217;&#233;quivalence s&#233;mantique entre les EPLS en n&#8217;ayant recours &#224; aucune information pr&#233;alable sur
l&#8217;alignement des mots. Elle permet aussi d&#8217;aligner des expressions &#224; caract&#232;re idiomatique tel
que &#171; &#224; nouveau&#8594; once more &#187; ou encore &#171; &#233;tat par &#233;tat&#8594; amount of state &#187; et trouve toutes
les correspondances bilingues possibles pour les EPLS source pour lesquelles plusieurs EPLS
cible correctes existent. Par exemple, notre m&#233;thode fournit pour l&#8217;EPL &#171; en ce qui concerne &#187; les
traductions suivantes : &#171; in regard to &#187;, &#171; with reference to &#187;, &#171; with respect to &#187;, &#171; as regards &#187;.
</p>
<p>Nous avons pu aussi identifier une classe d&#8217;erreurs dont la cause provient essentiellement du
choix de la taille des n-grammes. Comme nous ne prenons en consid&#233;ration que des alignements
m-n avec m&#8805;2 and n&#8805;2, quelques expressions dont la traduction de r&#233;f&#233;rence est constitu&#233;e
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>6 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;un seul mot ne sont pas align&#233;es correctement. Par exemple, l&#8217;expression fran&#231;aise &#171; chemin de
fer &#187; correspondant normalement au mot simple anglais &#171; railway &#187; est traduite par l&#8217;expression
&#171; railway sector &#187;.
</p>
<p>4 EPLS dans Moses
</p>
<p>Dans la section pr&#233;c&#233;dente, nous avons d&#233;crit l&#8217;approche suivie pour acqu&#233;rir un lexique bilingue
d&#8217;EPLS. Pour &#233;valuer sa qualit&#233;, nous avons men&#233; dans (Bouamor et al., 2011) une &#233;valuation
intrins&#232;que &#224; petite &#233;chelle dans laquelle nous comparons les paires d&#8217;EPLS bilingues acquises &#224;
un alignement de r&#233;f&#233;rence cr&#233;&#233; manuellement. Sur un corpus de test constitu&#233; de 100 paires
de phrases parall&#232;les issues du corpus Europarl, nous avons obtenu une pr&#233;cision de 63,93%,
un rappel de 62,46% et une F-mesure de 63,19%. Comme il n&#8217;existe &#224; ce jour aucun protocole
commun permettant d&#8217;&#233;valuer les r&#233;sultats d&#8217;alignement d&#8217;EPLS, nous conduisons une &#233;valuation
extrins&#232;que dans laquelle nous &#233;tudions l&#8217;impact de l&#8217;utilisation de ces unit&#233;s dans MOSES, un
syst&#232;me de TAS &#224; base de segments. N&#233;anmoins, comme mentionn&#233; dans la section 1, la difficult&#233;
consiste &#224; trouver la meilleure fa&#231;on d&#8217;int&#233;grer les EPLS dans de tels syst&#232;mes. &#192; cet effet, nous
proposons trois strat&#233;gies d&#8217;int&#233;gration dynamiques o&#249; le mod&#232;le de traduction est modifi&#233; de
diff&#233;rentes fa&#231;ons et une strat&#233;gie d&#8217;int&#233;gration statique dans laquelle nous introduisons les EPLS
au d&#233;codeur sans changer le mod&#232;le de traduction et comparons leurs performances dans la
section 5.
</p>
<p>4.1 MOSES comme syst&#232;me de r&#233;f&#233;rence
</p>
<p>Le syst&#232;me de traduction de r&#233;f&#233;rence (R&#201;F) utilis&#233; est MOSES, un outil sous licence libre. Dans
ce syst&#232;me, l&#8217;unit&#233; de traduction est le segment, qui correspond &#224; un groupe de mots contigus.
Le mod&#232;le de traduction sert de pont entre les langues source et cible. Son r&#244;le est de guider la
construction, pour chaque phrase source, d&#8217;un ensemble d&#8217;hypoth&#232;ses de traduction en langue
cible. Lors de la phase de d&#233;codage, ces hypoth&#232;ses de traduction sont s&#233;lectionn&#233;es &#224; partir d&#8217;un
inventaire constitu&#233; d&#8217;un ensemble d&#8217;appariements entre des segments de longueur variable. Ces
associations et les scores qui les accompagnent constituent la table de traduction (phrase table).
</p>
<p>4.2 Strat&#233;gies d&#8217;int&#233;gration dynamiques
</p>
<p>4.2.1 Nouveau mod&#232;le de traduction
</p>
<p>Les tables de traduction constituent la source principale de connaissance pour le d&#233;codeur. Le
d&#233;codeur consulte ces tables pour d&#233;terminer comment traduire une phrase source en langue
cible. Cependant, en raison d&#8217;erreurs d&#8217;alignement automatique de certains mots, des segments
extraits peuvent &#234;tre d&#233;nu&#233;s de sens. Pour rem&#233;dier &#224; ce probl&#232;me, nous proposons de consid&#233;rer
les EPLS comme des paires de phrases parall&#232;les : nous les ajoutons au corpus d&#8217;apprentissage
et entra&#238;nons un nouveau mod&#232;le de traduction. Dans cette m&#233;thode (TRAIN), nous esp&#233;rons
que par l&#8217;augmentation du nombre d&#8217;occurrences des paires d&#8217;EPLS, consid&#233;r&#233;es comme de bons
segments, une modification de l&#8217;alignement et de la probabilit&#233; de la traduction soit enregistr&#233;e.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>7 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.2.2 Extension de la table de traduction
</p>
<p>Dans cette m&#233;thode, nous &#233;tendons la table de traduction du syst&#232;me de r&#233;f&#233;rence R&#201;F en y
incorporant les paires d&#8217;EPLS bilingues acquises. Nous utilisons la valeur de l&#8217;indice de Jaccard
propos&#233;e pour chaque paire d&#8217;EPLS pour d&#233;finir la probabilit&#233; de traduction dans les deux
directions et fixons les probabilit&#233;s lexicales &#224; 1 pour des raisons de simplicit&#233;. Ainsi, le d&#233;codeur
prendra en consid&#233;ration des EPLS bilingues lors de la recherche de segments candidats pour
traduire une phrase source. Cette m&#233;thode est not&#233;e TABLE dans le reste de cet article.
</p>
<p>4.2.3 Trait additionnel pour les EPLS
</p>
<p>(Lopez et Resnik, 2006) ont soulign&#233; qu&#8217;une meilleure d&#233;finition des traits utilis&#233;s peut conduire
&#224; un gain substantiel dans la qualit&#233; des traductions. Nous suivons cette hypoth&#232;se et &#233;tendons
la m&#233;thode TABLE. Nous d&#233;finissons un nouveau trait binaire indiquant pour chaque entr&#233;e de
la table de traduction s&#8217;il s&#8217;agit d&#8217;une EPL ou pas. Le but de cette m&#233;thode not&#233;e TRAIT est de
guider le syst&#232;me pour choisir les EPLS bilingues plut&#244;t que les hypoth&#232;ses propos&#233;es par R&#201;F.
</p>
<p>4.3 Strat&#233;gie d&#8217;int&#233;gration statique
</p>
<p>Dans cette m&#233;thode, not&#233;e FORC&#201;, nous voulons que le d&#233;codeur prenne en consid&#233;ration des
EPLS bilingues tout en gardant le mod&#232;le de traduction de R&#201;F. &#192; cet &#233;gard, nous utilisons le
mode de d&#233;codage forc&#233; du d&#233;codeur de MOSES. Ce dernier comporte un sch&#233;ma de balisage XML
permettant de sp&#233;cifier des traductions pour des parties des phrases &#224; traduire. Nous pouvons
ainsi indiquer au d&#233;codeur ce qu&#8217;il faut utiliser pour traduire certains mots ou segments dans les
phrases &#224; traduire. Dans le cadre de notre &#233;tude, nous repr&#233;sentons chaque EPL apparaissant
dans le corpus de test par la balise XML ad&#233;quate en se basant sur les traductions produites par
notre aligneur. Un exemple de repr&#233;sentation de l&#8217;EPL &#171; &#224; nouveau &#187; est pr&#233;sent&#233; ci-dessous :
</p>
<p>. . .sembler &#234;tre &#224; nouveau mis en accusation, le minist&#232;re public . . .
&#8659;
</p>
<p>. . .sembler &#234;tre &lt; mwe translation=&#8220;once more&quot; &gt;&#224; nouveau&lt; /mwe&gt; mis en accusation, le minist&#232;re
public . . .
</p>
<p>5 Exp&#233;riences et r&#233;sultats
</p>
<p>5.1 Corpus et outils
</p>
<p>Les donn&#233;es d&#8217;apprentissage et de test proviennent du corpus Europarl pour la paire de langues
fran&#231;ais-anglais. Ce corpus regroupe un ensemble de phrases parall&#232;les extraites des actes du
parlement europ&#233;en. Pour estimer le mod&#232;le de traduction du syst&#232;me de r&#233;f&#233;rence R&#201;F, nous
avons construit un corpus d&#8217;apprentissage contenant apr&#232;s normalisation 100 000 paires de
phrases. La normalisation est &#233;tablie &#224; travers les traitements suivants : tokenisation, suppression
de phrases de plus de 50 mots et lemmatisation &#224; l&#8217;aide de l&#8217;outil TreeTagger. Nous utilisons
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>8 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Method BLEU TER
Tous_Test EPLS_Test Tous_Test EPLS_Test
</p>
<p>R&#201;F 28,85 30,83 55,44 53,59
Dynamiques
</p>
<p>TRAIN 28,87 31,06 55,38 53,32
TABLE 28,82 30,88 55,42 53,46
TRAIT 28,95 31,06 55,48 53,56
</p>
<p>Statique
FORC&#201; 28,20 29,19 56,01 55,05
</p>
<p>TABLE 3 &#8211; R&#233;sultats de traduction des corpus de test Tous_Test et EPLS_Test en termes de scores
BLEU et TER
</p>
<p>ce m&#234;me corpus pour construire un lexique bilingue d&#8217;EPLS2. Comme les entr&#233;es de ce lexique
sont sous forme de lemmes et que le mode de d&#233;codage forc&#233; de MOSES n&#8217;est actuellement pas
compatible avec les mod&#232;les &#224; base de facteurs, le mod&#232;le de traduction a &#233;t&#233; estim&#233; sur des
lemmes plut&#244;t que sur des formes de surface. Outre le mod&#232;le de traduction, nous avons entra&#238;n&#233;
un mod&#232;le de langue (trigramme) sur une version lemmatis&#233;e de la totalit&#233; du corpus Europarl
(1, 8M) en utilisant la boite &#224; outils IRSTLM3.
</p>
<p>Les strat&#233;gies dynamiques et statique d&#233;crites pr&#233;c&#233;demment sont ensuite appliqu&#233;es. Dans TRAIN,
les EPLS bilingues sont ajout&#233;es au corpus d&#8217;apprentissage pour estimer un nouveau mod&#232;le de
traduction. En ce qui concerne TABLE, la table de traduction de R&#201;F est enrichie par les EPLS
bilingues. Dans TRAIT, un trait additionnel 1/0 est introduit dans la table de traduction de TABLE.
Finalement, FORC&#201; maintient le mod&#232;le de traduction de R&#201;F. Tous les mod&#232;les obtenus sont
optimis&#233;s par minimisation du taux d&#8217;erreur (MERT : Minimum Error Rate Training) (Och, 2003)
sur un corpus de d&#233;veloppement constitu&#233; de 4 000 paires de phrases issues du m&#234;me corpus.
</p>
<p>5.2 R&#233;sultats et discussion
</p>
<p>Deux s&#233;ries d&#8217;exp&#233;riences ont &#233;t&#233; men&#233;es : Tous_Test et EPLS_Test. Le premier corpus de test
Tous_Test est constitu&#233; de 1 000 paires de phrases parall&#232;les extraites al&#233;atoirement du corpus
Europarl. Pour mesurer l&#8217;apport r&#233;el du lexique bilingue d&#8217;EPLS, nous avons constitu&#233; un corpus
de test not&#233; EPLS_Test o&#249; nous ne conservons que les phrases du corpus Tous_Test contenant au
moins une EPL. Ce corpus contient 323 paires de phrases parall&#232;les. La qualit&#233; de traduction
du syst&#232;me R&#201;F et des diff&#233;rentes strat&#233;gies dynamiques et statique d&#8217;int&#233;gration est &#233;valu&#233;e
sur les deux corpus de test sur la base des mesures BLEU et TER (Snover et al., 2006). Nous
consid&#233;rons qu&#8217;&#224; chaque phrase source correspond une seule phrase de r&#233;f&#233;rence en langue cible.
Les r&#233;sultats de traduction pour les diff&#233;rentes configurations sont rassembl&#233;s dans le tableau 3.
</p>
<p>&#192; premi&#232;re vue, nous remarquons que le score BLEU varie en fonction du type du jeu de test.
Concernant le corpus de test Tous_test, la meilleure am&#233;lioration est obtenue par la strat&#233;gie
dynamique TRAIT. Cette m&#233;thode rapporte un faible gain de +0,1 points BLEU par rapport au
</p>
<p>2EPLs bilingues extraites par l&#8217;algorithme d&#233;crit dans la section 3
3http://hlt.fbk.eu/en/irstlm
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>9 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SRC je entendre en effet lancer un initiative communautaire pour le afrique en
&#233;tendre le ligne nepad . . .
</p>
<p>R&#201;FERENCE indeed , i intend to launch a community initiative for africa , develop the nepad
line. . .
</p>
<p>R&#201;F i hear be indeed launch an initiative for the eu africa by extend the nepad
line . . .
</p>
<p>TRAIT i hear in fact launch a community initiative for africa by extend the nepad line
. . .
</p>
<p>SRC le deuxi&#232;me groupe de probl&#232;me relever de le aide international et du prochain
engagement de johannesburg.
</p>
<p>R&#201;FERENCE another series of problem mention be a matter of international aid and the
forthcoming johannesburg summit.
</p>
<p>R&#201;F the second group of the problem be a matter of international aid and the
forthcoming johannesburg commitment.
</p>
<p>FORC&#201; the second group of the problem relate to the international aid and the
forthcoming johannesburg commitment.
</p>
<p>TABLE 4 &#8211; Exemples de traduction. Notons que le texte est lemmatis&#233;. Nous soulignons les EPLS
et mettons en gras diff&#233;rentes suggestions pour le contexte imm&#233;diat gauche ou droite.
</p>
<p>syst&#232;me R&#201;F. Le premier exemple de traduction pr&#233;sent&#233; dans le tableau 4 souligne la contribution
du trait introduit &#224; l&#8217;am&#233;lioration de la qualit&#233; de traduction. Contrairement &#224; R&#201;F, traduisant
l&#8217;EPL &#171; initiative communautaire &#187; par simplement le mot simple &#171; initiative &#187;, la strat&#233;gie TRAIT
m&#232;ne &#224; bien la traduction de l&#8217;EPL &#171; initiative communautaire &#187; par &#171; community initiative &#187; et de
son contexte imm&#233;diat (&#171; for africa &#187;). Des scores BLEU plus faibles que ceux rapport&#233;s par R&#201;F
sont obtenus par les strat&#233;gies TABLE et FORC&#201;.
</p>
<p>Pour le corpus de test EPLS_Test, qui ne consid&#232;re que les phrases contenant des EPLS du lexique
bilingue, nous constatons que toutes les strat&#233;gies d&#8217;int&#233;gration dynamiques rapportent des scores
BLEU plus &#233;lev&#233;s que ceux obtenus par R&#201;F et la strat&#233;gie statique FORC&#201;. Un gain de +0,23
points BLEU est obtenu par TRAIT et TRAIN. La strat&#233;gie TABLE rapporte un score l&#233;g&#232;rement
am&#233;lior&#233; montrant un gain de +0,05 points BLEU. Contrairement aux strat&#233;gies d&#8217;int&#233;gration
dynamiques, la m&#233;thode FORC&#201; obtient de faibles scores sur les deux corpus de test. Ceci peut &#234;tre
expliqu&#233; de la mani&#232;re suivante : nous supposons qu&#8217;en for&#231;ant le d&#233;codeur &#224; traduire une EPL
par une unit&#233; donn&#233;e, ce dernier &#233;choue &#224; bien traduire le contexte imm&#233;diat gauche ou droit de
l&#8217;EPL induisant ainsi une diminution de la valeur du score BLEU. Ainsi, dans le second exemple
du tableau 4, les deux syst&#232;mes produisent une bonne traduction pour l&#8217;EPL &#171; aide international &#187;.
Cependant, FORC&#201; &#233;choue dans la traduction du segment &#171; relever de &#187;. Il est important de noter
que cette traduction pourrait &#234;tre soutenue dans le cas o&#249; nous associons &#224; chaque phrase source
de multiples traductions de r&#233;f&#233;rence.
</p>
<p>Dans une &#233;tude ant&#233;rieure, (Ren et al., 2009) ont propos&#233; une strat&#233;gie similaire &#224; la strat&#233;gie
TRAIT dans laquelle ils indiquent pour chaque entr&#233;e de la table de traduction si un segment
contient une paire d&#8217;EPL bilingue sp&#233;cialis&#233;e. Pour le domaine m&#233;dical, leur m&#233;thode rapporte
un gain de +0,17 points BLEU par rapport &#224; MOSES, un gain plus faible que celui obtenu
par la strat&#233;gie TRAIT. La question que l&#8217;on peut se poser en observant les diff&#233;rents r&#233;sultats
obtenus est : est-il possible de pr&#233;tendre que le syst&#232;me ayant les meilleurs scores est vraiment
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>10 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>le meilleur syst&#232;me ? En d&#8217;autres termes, les r&#233;sultats obtenus par diff&#233;rentes strat&#233;gies sont-ils
statistiquement significatifs ?
</p>
<p>Pour &#233;valuer la significativit&#233; statistique des r&#233;sultats obtenus, nous utilisons la m&#233;thode par
r&#233;-&#233;chantillonage par amorce d&#233;crite par (Koehn, 2004). Cette m&#233;thode estime la probabilit&#233;
(p-valeur) qu&#8217;une diff&#233;rence mesur&#233;e entre les scores BLEU surgisse par hasard, par la cr&#233;ation &#224;
plusieurs reprises (10 fois) d&#8217;&#233;chantillons uniformes avec remise &#224; partir des corpus de tests. Nous
nous appuyons sur cette m&#233;thode pour comparer les m&#233;thodes TRAIN, TABLE et TRAIT apportant
des gains dans le score BLEU (Tableau 3) par rapport &#224; R&#201;F. Les r&#233;sultats obtenus sont pr&#233;sent&#233;s
dans le tableau ci-dessous.
</p>
<p>M&#233;thode p-valeur (95 % IC)
Tous_Test EPLS_Test
</p>
<p>R&#201;F - -
TRAIN 0,1 0,05
TABLE - 0,3
TRAIT 0,01 0,01
</p>
<p>TABLE 5 &#8211; Test de significativit&#233; statistique des r&#233;sultats en termes de p-valeur
</p>
<p>Sur un intervalle de confiance (IC) de 95%, les r&#233;sultats varient de non significatifs (quand
p &gt; 0,05) &#224; hautement significatifs. Sur les deux corpus de test, nous remarquons que les
am&#233;liorations apport&#233;es par la strat&#233;gie TRAIT ayant une p-valeur de 0,05 sont significatifs.
Cependant, le faible gain en score BLEU obtenu par TABLE (0,3 de p-valeur) est non significatif.
La cause est que nous utilisons la valeur de l&#8217;indice de Jaccard, une mesure utilis&#233;e pour comparer
la similarit&#233; et la diversit&#233; entre des &#233;chantillons, pour d&#233;finir la probabilit&#233; de traduction. Ceci
peut &#234;tre ajust&#233; par la transformation des valeurs de Jaccard obtenus pour chaque paire d&#8217;EPL en
une probabilit&#233; de traduction assurant ainsi l&#8217;uniformit&#233; et la coh&#233;rence des probabilit&#233;s dans la
table de traduction.
</p>
<p>Le score BLEU rel&#232;ve seulement les am&#233;liorations globales et ne montre aucune diff&#233;rence
pouvant &#234;tre r&#233;v&#233;l&#233;e par une &#233;valuation humaine. Cette observation nous a motiv&#233; &#224; mener une
&#233;valuation lexicale fine des EPLS du corpus EPLS_Test. Nous avons construit un corpus de test
constitu&#233; uniquement d&#8217;EPLS et avons manuellement cr&#233;&#233; une liste de r&#233;f&#233;rences &#224; partir du
corpus de r&#233;f&#233;rence. Ce corpus a &#233;t&#233; traduit par R&#201;F,TRAIN, TABLE, TRAIT et FORC&#201;. Les r&#233;sultats
obtenus &#233;valu&#233;s par les mesures du BLEU et TER sont pr&#233;sent&#233;s dans la figure 2. Nous constatons
qu&#8217;un gain de +9,8 et de &#8722;0,2 respectivement de points BLEU et TER est relev&#233; par la strat&#233;gie
FORC&#201;. Cela vient confirmer que l&#8217;obtention d&#8217;un faible score BLEU avec la strat&#233;gie FORC&#201; dans
les exp&#233;riences pr&#233;c&#233;dentes n&#8217;est pas due &#224; une mauvaise qualit&#233; du lexique bilingue d&#8217;EPLS.
Nous remarquons aussi que les strat&#233;gies TRAIN et TRAIT obtiennent des scores plus &#233;lev&#233;s
(respectivement 24,67 et 28,06 points BLEU) par rapport &#224; ceux obtenus par R&#201;F ayant un score
BLEU de 21,84.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>11 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>! !!&quot;#$ %#&amp;
</p>
<p>!
</p>
<p>&quot;!
</p>
<p>#!
</p>
<p>$!
</p>
<p>%!
</p>
<p>&amp;!
</p>
<p>'!
</p>
<p>!&quot;#
</p>
<p>#$!%&quot;
</p>
<p>&amp;'()*
</p>
<p>&amp;!'+&amp;
</p>
<p>&amp;!'+,
</p>
<p>-
.
</p>
<p>/
01
</p>
<p>2
3(
</p>
<p>)
*
</p>
<p>4
31
</p>
<p>53
&amp;
</p>
<p>*
!
</p>
<p>FIGURE 2 &#8211; &#201;valuation lexicale des EPLS en terme de scores BLEU et TER
</p>
<p>6 Conclusion et travaux futurs
</p>
<p>Dans cet article, nous avons d&#233;crit une m&#233;thode permettant d&#8217;extraire et d&#8217;aligner des EPLS dans
un corpus parall&#232;le fran&#231;ais-anglais. L&#8217;algorithme d&#8217;alignement propos&#233; effectue des alignements
de type m-n et prend en consid&#233;ration des EPLS quel que soit le degr&#233; de corr&#233;lation entre leurs
constituants. Pour mesurer l&#8217;apport de ces unit&#233;s pour MOSES, nous avons pr&#233;sent&#233; trois strat&#233;gies
d&#8217;int&#233;gration dynamiques o&#249; nous avons modifi&#233; le mod&#232;le de traduction de diff&#233;rentes fa&#231;ons
pour une prise en consid&#233;ration des EPLS bilingues et une strat&#233;gie d&#8217;int&#233;gration statique dans
laquelle nous avons incorpor&#233; ces unit&#233;s sans changer le mod&#232;le de traduction. Les exp&#233;riences
men&#233;es dans ce cadre montrent que la strat&#233;gie dynamique TRAIT, o&#249; un trait additionnel
indiquant pour chaque entr&#233;e de la table de traduction s&#8217;il s&#8217;agit d&#8217;une EPL ou pas, peut am&#233;liorer
significativement les r&#233;sultats obtenus par MOSES avec un gain allant jusqu&#8217;&#224; +0,23 points BLEU.
</p>
<p>Nous consid&#233;rons que nos exp&#233;riences initiales sont positives et peuvent &#234;tre am&#233;lior&#233;es de
diverses fa&#231;ons. Dans ce pr&#233;sent travail, le mod&#232;le de traduction est estim&#233; sur des lemmes plut&#244;t
que sur des formes de surface. Nous avons d&#8217;abord l&#8217;intention d&#8217;utiliser un mod&#232;le de g&#233;n&#233;ration
pour produire les formes de surfaces ad&#233;quates &#224; partir des r&#233;sultats de traduction, pr&#233;sent&#233;s ici
en lemmes. Nous comptons aussi entrainer notre syst&#232;me de traduction sur un corpus de taille
plus importante afin d&#8217;&#233;valuer l&#8217;impact du volume des donn&#233;es sur les r&#233;sultats obtenus. En plus
de leur application dans un syst&#232;me de TAS, nous tenterons d&#8217;&#233;tudier l&#8217;impact de ces EPLs sur la
pertinence des r&#233;sultats du moteur de recherche interlingue du CEA LIST.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BESAN&#199;ON, R., DE CHALENDAR, G., FERRET, O., GARA, F., LAIB, M., MESNARD, O. et SEMMAR,
N. (2010). Lima : A multilingual framework for linguistic analysis and linguistic resources
development and evaluation. In Proceedings of LREC, Malta.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>12 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOUAMOR, D., SEMMAR, N. et ZWEIGENBAUM, P. (2011). Improved statistical machine translation
using multi-word expressions. In Proceedings of MT-LIHMT, Barcelona, Spain.
</p>
<p>CASELI, H., VILLAVICENCIO, A., MACHADO, A. et FINATTO, M. J. (2009). Statistically-driven
alignment-based multiword expression identification for technical domains. In Proceedings
of the Workshop on Multiword Expressions : Identification, Interpretation, Disambiguation and
Applications, Singapore.
</p>
<p>CONSTANT, M., TELLIER, I., DUCHIER, D., DUPONT, Y., SIGOGNE, A., BILLOT, S. et al. (2011). Int&#233;grer
des connaissances linguistiques dans un crf : application &#224; l&#8217;apprentissage d&#8217;un segmenteur-
&#233;tiqueteur du fran&#231;ais. In Actes de TALN, Montpellier, France.
</p>
<p>DAGAN, I. et CHURCH, K. (1994). Termight : Identifying and translating technical terminology. In
Proceedings of the 4th Conference on ANLP, pages 34&#8211;40, Stuttgart, Germany.
</p>
<p>DAILLE, B. (2001). Extraction de collocation &#224; partir de textes. In MAUREL, D., &#233;diteur : Actes de
TALN 2001 (Traitement automatique des langues naturelles), Tours. ATALA, Universit&#233; de Tours.
</p>
<p>FAZLY, A. et STEVENSON, S. (2007). Distinguishing subtypes of multiword expressions using
linguistically-motivated statistical measures. In Proceedings of the Workshop on A Broader
Perspective on Multiword Expressions, pages 9&#8211;16.
</p>
<p>FINLAYSON, M. et KULKARNI, N. (2011). Detecting multi-word expressions improves word sense
disambiguation. In Proceedings of the Workshop on Multiword Expressions : from Parsing and
Generation to the Real World, pages 20&#8211;24, Portland, Oregon, USA.
</p>
<p>FRANTZI, C., ANANIADOU, S. et MIMA, H. (2000). Automatic recognition of multi-word terms :
the c-value/nc-value method. In Int. J. on Digital Libraries 3(2), pages 115&#8211;130.
</p>
<p>JACKENDOFF, R. (1997). The architecture of the language faculty. MIT Press.
</p>
<p>KOEHN, P. (2004). Statistical significance tests for machine translation evaluation. In Proceedings
of EMNLP.
</p>
<p>KOEHN, P., HOANG, H., BIRCH, A., CALLISON-BURCH, C., FEDERICO, M., BERTOLDI, N., COWAN, B.,
SHEN, W., MORAN, C., ZENS, R., DYER, C., BOJAR, O., CONSTANTIN, A. et HERBST, E. (2007). Moses :
Open source toolkit for statistical machine translation. In Proceedings of ACL, demo session,
Prague, Czech Republic.
</p>
<p>KOEHN, P., OCH, F. et MARCU, D. (2003). Statistical phrase-based translation. In Proceedings of
the Human Language Technology Conference of the North American Chapter of the Association for
Computational Linguistics, pages 115&#8211;124, Edmonton, Canada.
</p>
<p>KUPIEC, J. (1993). An algorithm for finding noun phrases correspondences in bilingual corpora.
In Proceedings of the 31st annual Meeting of the Association for Computational Linguistics, pages
17&#8211;22, Columbus, Ohio, USA.
</p>
<p>LAMBERT, P. et BANCHS, R. (2005). Data inferred multi-word expressions for statistical machine
translation. In Proceedings of MT SUMMIT.
</p>
<p>LAMBERT, P. et BANCHS, R. (2006). Grouping multi-word expressions according to part-of-speech
in statistical machine translation. In Proceedings of the Workshop on Multi-word Expressions in a
multilingual context.
</p>
<p>LOPEZ, A. et RESNIK, P. (2006). Word-based alignment, phrase based translation :what&#8217;s the
link ? In Proceedings of the association for machine translation in the Americas : visions for the
future of machine translation, pages 90&#8211;99.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>13 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LUKA, N., SERETAN, V. et WEHRLI, E. (2006). Le probl&#232;me de collocation en tal. In Nouveaux
cahiers de linguistiques Fran&#231;aise, pages 95&#8211;115.
</p>
<p>OCH, F. (2003). Minimum error rate training in statistical machine translation. In Proceedings of
ACL.
</p>
<p>OKITA, T., GUERRA, M., ALFREDO GRAHAM, Y. et WAY, A. (2010). Multi-word expression sensitive
word alignment. In Proceedings of the 4th International Workshop on Cross Lingual Information
Access at COLING 2010, pages 26&#8211;34, Beijing.
</p>
<p>PAPINENI, k., ROUKOS, S., WARD, T. et ZHU, W. J. (2002). Bleu : a method for automatic evaluation
of machine translation. In 40th Annual meeting of the Association for Computational Linguistics.
</p>
<p>REN, Z., LU, Y., LIU, Q. et HUANG, Y. (2009). Improving statistical machine translation using do-
main bilingual multiword expressions. In Proceedings of the Workshop on Multiword Expressions :
Identification, Interpretation, Disambiguation and Applications, pages 47&#8211;57.
</p>
<p>SAG, I., BALDWIN, T., FRANCIS BOND, F., COPESTAKE, A. et FLICKINGER, D. (2002). Multiword
expressions :a pain in the neck for nlp. In CICLing 2002, Mexico City, Mexico.
</p>
<p>SAGOT, B., CL&#201;MENT, L., DE LA CLERGERIE, &#201;., BOULLIER, P. et al. (2005). Vers un m&#233;ta-lexique
pour le fran&#231;ais : architecture, acquisition, utilisation. In Actes de TALN.
</p>
<p>SALTON, G., WONG, A. et YANG, C. (1975). A vector space model for automatic indexing. In
Communications of the ACM, pages 61&#8211;620.
</p>
<p>SERETAN, V. et WEHRLI, E. (2007). Collocation translation based on sentence alignment and
parsing. In BENARMARA, F., HATOUT, N., MULLER, P. et OZDOWSKA, S., &#233;diteurs : Actes de TALN
2007 (Traitement automatique des langues naturelles), Toulouse. ATALA, IRIT.
</p>
<p>SNOVER, M., DORR, B., SCHWARTZ, R., MICCIULLA, L. et MAKHOUL, J. (2006). A study of translation
edit rate with targeted human annotation. In Proceedings of Association for Machine Translation
in the Americas.
</p>
<p>TUFIS, I. et ION, R. (2007). Parallel corpora, alignment technologies and further prospects in
multilingual resources and technology infrastructure. In Proceedings of the 4th International
Conference on Speech and Dialogue Systems, pages 183&#8211;195.
</p>
<p>VECHTOMOVA, O. (2005). The role of multi-word units in interactive information retrieval. In
ECIR2005, pages 403&#8211;420, Berlin.
</p>
<p>VINTAR, S. et FISIER, D. (2008). Harvesting multi-word expressions from parallel corpora. In
Proceedings of LREC, Marrakech, Morocco.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>14 c&#65535; ATALA</p>

</div></div>
</body></html>