<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une identification automatique du chiasme de mots</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une identification automatique du chiasme de mots
</p>
<p>Marie Dubremetz
Uppsala universitet, Institutionen f&#246;r lingvistik och filologi - Box 635 - 751 26 Uppsala, Su&#232;de
Universit&#233; Paris Ouest La D&#233;fense - 200, Avenue de la R&#233;publique - 92001 Nanterre, France
</p>
<p>marie.dubremetz@lingfil.uu.se
</p>
<p>R&#201;SUM&#201;
Cette recherche porte sur le chiasme de mots : figure de style jouant sur la r&#233;version
(ex. &#171; Bonnet blanc, blanc bonnet &#187;). Elle place le chiasme dans la probl&#233;matique de sa re-
connaissance automatique : qu&#8217;est-ce qui le d&#233;finit et comment un ordinateur peut le trouver ?
Nous apportons une description formelle du ph&#233;nom&#232;ne. Puis nous proc&#233;dons &#224; la constitution
d&#8217;une liste d&#8217;exemples contextualis&#233;s qui nous sert au test des hypoth&#232;ses. Nous montrons ainsi
que l&#8217;ajout de contraintes formelles (contr&#244;le de la ponctuation et omission des mots vides)
p&#233;nalise tr&#232;s peu le rappel et augmente significativement la pr&#233;cision de la d&#233;tection. Nous
montrons aussi que la lemmatisation occasionne peu d&#8217;erreurs pour le travail d&#8217;extraction mais
qu&#8217;il n&#8217;en est pas de m&#234;me pour la racinisation. Enfin nous mettons en &#233;vidence que l&#8217;utilisation
d&#8217;un th&#233;saurus apporte quelques r&#233;sultats pertinents.
</p>
<p>ABSTRACT
Towards an automatic identification of chiasmus of words
</p>
<p>This article summarises the study of the rhetorical figure &#8220;chiasmus&#8221; (e.g : &#8220;Quitters never
win and winners never quit.&#8221;). We address the problem of its computational identification.
How can a computer identify this automatically ? For this purpose this article will provide a
formal description of the phenomenon. First, we put together an annotated text for testing our
hypothesis. At the end we demonstrate that the use of stopword lists and the identification of the
punctuation improve the precision of the results with very little impact on the recall. We discover
also that using lemmatization improves the results but stemming doesn&#8217;t. Finally we see that a
French thesaurus provided us with good results on the most elaborate form of chiasmus.
</p>
<p>MOTS-CL&#201;S : chiasme, rh&#233;torique, antim&#233;tabole, figure de style.
KEYWORDS: chiasmus, rhetoric, antimetabole, stylistic device.
</p>
<p>1 Introduction
</p>
<p>1.1 Situation de la recherche
</p>
<p>&#201;lev&#233;e au rang de science dans l&#8217;antiquit&#233;, la rh&#233;torique, ou l&#8217;&#233;tude des techniques de persuasion
au moyen du language, a, peu &#224; peu, &#233;t&#233; d&#233;laiss&#233;e par les recherches linguistiques modernes
(Harris et DiMarco, 2009). Parmi les moyens disponibles en rh&#233;torique pour convaincre, on
dispose de ce qu&#8217;on appelle les figures de style ou figures de rh&#233;torique. Selon Harris et DiMarco
(2009) on peut les diviser en deux cat&#233;gories : les figures de style reposant sur la s&#233;mantique
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>150 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(m&#233;taphore, m&#233;tonymie, comparaison. . .), et les autres qui jouent sur la syntaxe, les phon&#232;mes
ou tout autre constituant de la langue (rime, paronomase. . .). Si les premi&#232;res sont relativement
populaires, les autres restent un sujet de recherche tr&#232;s rare dans l&#8217;horizon acad&#233;mique du
TAL. Cet article contribue &#224; combler ce vide en proposant une m&#233;thode de d&#233;tection d&#8217;une de
ces figures de style : le chiasme de mots. Gr&#226;ce &#224; des observations empiriques et &#224; l&#8217;ajout de
contraintes simples (&#171; StopWords &#187; , analyse des ponctuations) nous pensons pouvoir am&#233;liorer
la qualit&#233; des algorithmes existants. Enfin gr&#226;ce aux outils que nous fournit le TAL (lemmatiseur,
raciniseur, th&#233;saurus) nous pourrons envisager de d&#233;tecter une plus grande vari&#233;t&#233; de chiasmes.
</p>
<p>Apr&#232;s avoir pr&#233;sent&#233; les applications li&#233;es &#224; notre objet d&#8217;&#233;tude nous pr&#233;senterons une d&#233;finition
et le corpus utilis&#233;. De l&#224; nous ferons l&#8217;&#233;tat de l&#8217;art des recherches existantes avant de soumettre,
comparer et enfin discuter notre m&#233;thode de d&#233;tection.
</p>
<p>1.2 Applications : pourquoi la question du chiasme en TAL ?
</p>
<p>L&#8217;application la plus &#233;vidente de ce type de recherche semble, &#224; premi&#232;re vue, l&#8217;analyse de
discours. Ainsi Gawryjolek (2009) avait d&#233;j&#224; mis en pratique son outil de d&#233;tection des figures
portant sur la r&#233;p&#233;tition pour analyser un discours de Barack Obama.
</p>
<p>On peut aussi imaginer qu&#8217;un outil de d&#233;tection contribuera, &#224; terme, non pas &#224; analyser le style
mais &#224; le g&#233;n&#233;rer via l&#8217;assistance &#224; la r&#233;daction. En effet les logiciels de traitement de textes nous
assistent d&#233;j&#224; en sugg&#233;rant les synonymes. &#192; terme le relev&#233; d&#8217;un tr&#232;s grand nombre de chiasmes
pourrait permettre la constitution de bases de donn&#233;es des figures de style index&#233;es par mots
clefs. Pourquoi alors ne pas imaginer un jour que l&#8217;utilisateur pourra &#233;crire tout en se voyant
sugg&#233;rer une figure de style appropri&#233;e ? Contrairement &#224; ce qu&#8217;on pourrait penser, le chiasme
n&#8217;est pas qu&#8217;une coquetterie de style destin&#233;e aux seuls po&#232;tes. Il est, au contraire, un proc&#233;d&#233;
rh&#233;torique utilis&#233; dans tout texte argumentatif et ce, m&#234;me s&#8217;il est de nature scientifique. 1
</p>
<p>Enfin, il convient d&#8217;&#233;voquer une autre application possible, celle de l&#8217;extraction automatique de
citations (Bendersky et Smith, 2012). Le chiasme en effet g&#233;n&#232;re souvent d&#8217;excellents jeux de
mots ce qui valorise le texte d&#8217;o&#249; il est extrait. &#201;tant donn&#233;e la n&#233;cessit&#233;, aujourd&#8217;hui, de traiter
un grand nombre d&#8217;&#339;uvres &#233;crites, rep&#233;rer non plus juste les mots clefs mais aussi les parties les
plus travaill&#233;es d&#8217;un texte devient de plus en plus important. L&#8217;observation du style apporte une
nouvelle dimension qui n&#8217;existe pas ou peu dans le traitement automatis&#233;.
</p>
<p>&#192; pr&#233;sent que nous avons entr&#8217;aper&#231;u l&#8217;enjeu comment d&#233;finir notre objet d&#8217;&#233;tude ?
</p>
<p>2 D&#233;finition
</p>
<p>Le mot chiasme tire son nom de la lettre &#967; en r&#233;f&#233;rence &#224; la croix qu&#8217;elle symbolise. On le d&#233;finit
en effet comme la reprise d&#8217;un couple d&#8217;&#233;l&#233;ments en sens inverse :
</p>
<p>1. &#171; Tr&#232;s r&#233;pandu dans les ann&#233;es 70, [le chiasme] a &#233;t&#233; d&#233;nonc&#233; vertement pour la violence qu&#8217;il fait &#224; la fonction
communicative du langage : &#171; [. . . ]. La recherche du sens c&#8217;est le sens de la recherche, etc. Vous pouvez para&#238;tre
profond avec n&#8217;importe quelle banalit&#233;&#187;. Mais en donnant &#224; penser au lecteur na&#239;f, ce chiasme propositionnel [. . . ], est
souvent appropri&#233; pour des titres, &#224; la fois par son &#233;conomie lexicale et par la profondeur apparemment in&#233;puisable des
discussions qu&#8217;il annonce. Dans La trouble-f&#234;te, Bernard Andr&#232;s &#233;pingle le proc&#233;d&#233; comme typique du jargon universitaire,
susceptible d&#8217;entra&#238;ner consid&#233;ration et subventions. &#187;(Vandendorpe, 1991, p.4)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>151 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A</p>
<p>A&#65535;B&#65535;
</p>
<p>B
</p>
<p>FIGURE 1 &#8211; Sch&#233;ma d&#233;finitoire du chiasme
</p>
<p>On citera ainsi l&#8217;exemple le plus classique : &#171; Bonnet blanc, blanc bonnet &#187;
</p>
<p>blanc
</p>
<p>blanc
</p>
<p>bonnet
</p>
<p>Bonnet
</p>
<p>FIGURE 2 &#8211; Exemple de chiasme
</p>
<p>Il existe toute sorte de chiasmes, ils peuvent porter sur le croisement de phon&#232;mes, de lettres,
d&#8217;&#233;l&#233;ments syntaxiques... Nous nous restreindrons &#224; l&#8217;&#233;tude des chiasmes de mots. Cependant
on constate dans cette sous-classe de chiasmes encore beaucoup de variantes qu&#8217;il faut d&#233;finir
pour le traitement automatique (Gawryjolek, 2009, p.67). Voici donc, &#224; l&#8217;issue des lectures des
linguistes 2 et de l&#8217;observation des exemples qu&#8217;ils donnent, les types de chiasmes de mots que
nous avons recens&#233;s :
</p>
<p>2. Diderot et D&#8217;Alembert (1789); Dupriez (2003); Garc&#237;a-Page (1991); Greene (2012); Nordahl (1971); Pougeoise
(2001); Rabatel (2008); Vandendorpe (1991); Van Gorp et al. (2001)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>152 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nom R&#233;p&#233;tition porte
sur :
</p>
<p>Exemple
</p>
<p>Les
chiasmes
de mots
</p>
<p>A
</p>
<p>A&#65535;B&#65535;
</p>
<p>B
</p>
<p>Antim&#233;tabole ou
Antim&#233;tabole stricte
</p>
<p>mots identiques 3
Ceux qui ont l&#8217;opinion que
l&#8217;argent peut tout faire pour-
raient bien &#234;tre suspect&#233;s de
tout faire pour de l&#8217;argent.
(George Savile)
</p>
<p>Chiasme flexionnel
ou Antim&#233;tabole
</p>
<p>flexionnelle
</p>
<p>mots fl&#233;chis
</p>
<p>Lui, veut une alliance des
contraires, c&#8217;est-&#224;-dire le
contraire d&#8217;une alliance. (Le
Monde, 13-3-2007)
</p>
<p>Chiasme
d&#233;rivationnel
</p>
<p>mots d&#233;riv&#233;s
</p>
<p>Moderniser l&#8217;Islam plut&#244;t
qu&#8217;islamiser la modernit&#233;.
(Jean Daniel)
</p>
<p>Antim&#233;talepse id&#233;e ou notion sans
forc&#233;ment de reprise
morphologique 4
</p>
<p>derni&#232;re averse [. . . ] neiges
d&#8217;antan (Georges Brassens,
Le temps ne fait rien &#224; l&#8217;af-
faire)
</p>
<p>TABLE 1 &#8211; Typologie des chiasmes de mots
</p>
<p>Les figures d&#233;crites par ce tableau sont tr&#232;s anciennes et connues depuis longtemps. Ainsi, on
observe d&#233;j&#224; &#224; l&#8217;&#233;poque de Quintilien (Greene, 2012, Art. &#171; Antim&#233;tabole &#187;) l&#8217;existence des
antim&#233;taboles comportant des mots identiques mais aux flexions diff&#233;rentes. Cependant jamais
un nom sp&#233;cifique n&#8217;a &#233;t&#233; donn&#233; &#224; ce ph&#233;nom&#232;ne pour le diff&#233;rencier de l&#8217;antim&#233;tabole &#171; stricte &#187;.
Il en va de m&#234;me pour le chiasme portant sur des mots d&#233;riv&#233;s. Ce tableau n&#8217;est sans doute pas
exhaustif puisqu&#8217;il est tributaire d&#8217;observations empiriques &#224; partir des exemples donn&#233;s par les
ouvrages de stylistique de r&#233;f&#233;rence. Il va cependant permettre &#224; cette recherche d&#8217;aller plus loin
et de ne pas se heurter au &#171; flottement &#187;(Rabatel, 2008, p.21) qui r&#232;gne autour de la d&#233;finition
de cette figure : car sans d&#233;finition formelle, il s&#8217;av&#232;re difficile d&#8217;&#233;laborer un syst&#232;me de d&#233;tection
(Gawryjolek, 2009, p.67).
</p>
<p>3. (Dupriez, 2003; Pougeoise, 2001, Art.&quot;Chiasme&quot;)
4. (Diderot et D&#8217;Alembert, 1789, Art. &quot;Antim&#233;tabole, Antim&#233;talepse, Antim&#233;tath&#232;se&quot;)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>153 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Corpus
</p>
<p>3.1 Mode de constitution
</p>
<p>Pour &#233;valuer une m&#233;thode de d&#233;tection des chiasmes, l&#8217;id&#233;al serait l&#8217;obtention d&#8217;un corpus d&#233;j&#224;
annot&#233;. Cependant le chiasme reste un ph&#233;nom&#232;ne linguistique relativement rare ce qui rend
la constitution d&#8217;un corpus difficile et explique en partie l&#8217;absence de ressources pour traiter
le ph&#233;nom&#232;ne. C&#8217;est donc gr&#226;ce aux relev&#233;s pr&#233;cis des exemples donn&#233;s par les dictionnaires
sp&#233;cialis&#233;s (Pougeoise, 2001; Dupriez, 2003), par la base de donn&#233;e JULIBEL 5(Bradfer et al.,
1995) par les quelques linguistes ayant trait&#233; sp&#233;cialement de cette figure (Garc&#237;a-Page, 1991;
Rabatel, 2008; Nordahl, 1971) ou parfois par la lecture d&#8217;extraits de textes d&#8217;auteurs c&#233;l&#232;bres
tomb&#233;s dans le domaine public (Hugo, Musset etc.) que nous avons r&#233;ussi &#224; constituer ce
corpus 6. Le corpus est en langue fran&#231;aise si possible non traduite, il est constitu&#233; de 43 chiasmes
(22 antim&#233;taboles strictes, 8 chiasmes flexionnels, 6 chiasmes d&#233;rivationels, 7 antim&#233;talepses).
Lorsque nous en avions la possibilit&#233;, nous avons ajout&#233; plusieurs pages du contexte d&#8217;origine
o&#249; est apparu le chiasme et v&#233;rifi&#233; soigneusement que ce contexte ne contenait pas d&#8217;autres
chiasmes. Concat&#233;n&#233;s ces chiasmes avec contextes constituent un texte d&#8217;entra&#238;nement de 16000
mots. Cette taille est d&#233;j&#224; assez grande, nous le verrons, pour donner des comparatifs clairs sur
l&#8217;efficacit&#233; des m&#233;thodes de d&#233;tection. Elle reste toutefois assez r&#233;duite pour que nous ayons pu
v&#233;rifier manuellement le nombre pr&#233;cis de chiasmes dans le texte et leur position. Avec toutes
ces donn&#233;es des calculs de rappel et de pr&#233;cision seront praticables.
</p>
<p>3.2 Contenu
</p>
<p>Le corpus sur lequel nous testons est extr&#234;mement vari&#233;, &#224; l&#8217;image des contextes dans lesquels
on peut retrouver cette figure de style. On peut y relever ainsi :
&#8211; des textes de litt&#233;raires :
</p>
<p>&#171; - Que tu es heureux d&#8217;&#234;tre fou !
- Que tu es fou de ne pas &#234;tre heureux ! &#187;, (Alfred de Musset, Les caprices de Marianne)
</p>
<p>&#8211; des textes journalistiques :
</p>
<p>&#171; L&#8217;&#233;conomie du discours ne peut se r&#233;duire au discours de l&#8217;&#233;conomie. &#187; (Lib&#233;ra-
tion, paroles rapport&#233;es de Michel Debray)
</p>
<p>&#8211; des textes publicitaires :
</p>
<p>&#171; [A la fin du clip, message au bas de l&#8217;&#233;cran] &quot;Ne vivez pas pour nettoyer
Nettoyez pour vivre &quot; &#187; (RTBF, octobre 2001, clip publicitaire pour Monsieur Propre)
</p>
<p>Nous mettons &#224; disposition ce corpus sous la forme d&#8217;un tableau afin de fournir les m&#233;tadonn&#233;es
indispensables &#224; une &#233;tude compl&#232;te. Un chiasme se pr&#233;sentera dans notre tableau sous la forme
pr&#233;sent&#233;e en table 2.
</p>
<p>5. Ressource linguistique destin&#233;e &#224; l&#8217;enseignement du fran&#231;ais http://home.scarlet.be/lmdp/
julibelmoded&#8217;emploi.html, consult&#233; le 08/05/2013
</p>
<p>6. Le corpus est mis &#224; libre disposition sur http://stp.lingfil.uu.se/~marie/chiasme.htm, consult&#233; le
08/05/2013
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>154 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Auteur Citation Contexte Source Chiasme de
cat&#233;gorie :
</p>
<p>C&#233;dric
Flament
</p>
<p>Festival de prix,
prix de festival
</p>
<p>58e Festival de Cannes *
Festival de prix, prix de
</p>
<p>festival La Face &quot;cachet&quot; de
la Croisette
</p>
<p>L&#8217;Avenir
du Luxem-
bourg
</p>
<p>20.05.2005
p.14
</p>
<p>1
</p>
<p>TABLE 2 &#8211; Pr&#233;sentation d&#8217;un chiasme dans notre tableau
</p>
<p>La derni&#232;re case est particuli&#232;re &#224; notre &#233;tude. &#192; chaque chiasme nous attribuons sa typologie
gr&#226;ce &#224; un num&#233;ro qui correspond aussi au degr&#233; de difficult&#233; d&#8217;identification en TAL. Voici la
l&#233;gende de cette typologie num&#233;rot&#233;e (Figure 3).
</p>
<p>Cat&#233;gorie 1 : Mots strictement identiques, simple rep&#233;rage de cha&#238;nes de caract&#232;res iden-
tiques
</p>
<p>Cat&#233;gorie 2 : Mots fl&#233;chis, lemmatisation n&#233;cessaire
</p>
<p>Cat&#233;gorie 3 : Mots d&#233;riv&#233;s d&#8217;une m&#234;me racine, racinisation n&#233;cessaire
</p>
<p>Cat&#233;gorie 4 : Rapprochement s&#233;mantique uniquement
</p>
<p>FIGURE 3 &#8211; Typologie des chiasmes : l&#233;gende
</p>
<p>Nous obtenons ainsi un texte d&#8217;entra&#238;nement dont les chiasmes sont class&#233;s selon le type de
traitement n&#233;cessaire. Cette classification permet de pratiquer des &#233;valuations sp&#233;cifiques des
algorithmes sur un type de chiasme en particulier.
</p>
<p>4 Les m&#233;thodes existantes pour la d&#233;tection des antim&#233;ta-
boles et leur application sur notre corpus
</p>
<p>&#192; ce jour il n&#8217;existe que deux recherches en TAL qui traitent du ph&#233;nom&#232;ne du
chiasme, cependant elles ne traitent que de l&#8217;antim&#233;tabole et s&#8217;inspirent du forma-
lisme de Harris et DiMarco (2009) pour d&#233;finir la figure recherch&#233;e (cf. Table 3).
</p>
<p>&#201;l&#233;ment Signification
</p>
<p>w Mot
. . . Suite de caract&#232;res
</p>
<p>&lt;. . .&gt; Fronti&#232;re de phrase ou de proposition
Indice abc Indique la m&#234;me identit&#233; ou non entre les &#233;l&#233;ments
</p>
<p>TABLE 3 &#8211; Formalisme des figures de style [traduit de Harris et DiMarco (2009, p.3)]
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>155 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ce formalisme permet &#224; Harris et DiMarco (2009) de d&#233;finir les antim&#233;taboles ainsi :
</p>
<p>&lt;WA . . .WB . . .WB . . .WA &gt; (Harris et DiMarco, 2009, p.4)
Cette formule signifie qu&#8217;une antim&#233;tabole est un ensemble de deux couples de mots identiques
dispos&#233;s en inclusion et s&#233;par&#233;s &#233;ventuellement par n&#8217;importe quels autres &#233;l&#233;ments de la langue
(autres mots, ponctuations. . .).
</p>
<p>4.1 Algorithme d&#8217;identification des doubles paires en inclusion (Gawryjo-
lek, 2009)
</p>
<p>En suivant la d&#233;finition de Harris et DiMarco (2009), Gawryjolek (2009) a mis au point un
logiciel qui rep&#232;re les antim&#233;taboles strictes. Il s&#233;lectionne pour cela toutes les doubles paires
de mots en inclusion sur une plage sp&#233;cifi&#233;e du texte. Il pr&#233;cise que cette m&#233;thode obtient cent
pour cent de rappel sur les antim&#233;taboles ce qui, sans surprise, est v&#233;rifi&#233; sur notre corpus. Il
pr&#233;cise aussi qu&#8217;il ne filtre aucune paire de mots, m&#234;me les plus fr&#233;quentes, et que la pr&#233;cision
est basse sans donner de chiffre ou d&#8217;estimation. Nous ne disposons pas du code source de
Gawryjolek (2009) ni de la d&#233;finition de ce qu&#8217;il appelle une &#171; plage sp&#233;cifi&#233;e &#187;. Nous avons donc
reproduit l&#8217;algorithme propos&#233; en limitant la fen&#234;tre de d&#233;tection &#224; 30 tokens (le plus grand
chiasme que nous ayons observ&#233; en comportait 23). Concr&#232;tement cela signifie que si un chiasme
&lt;WA . . .WB . . .W&#65535;B . . .W&#65535;A &gt; comporte plus de 30 tokens entre les &#233;l&#233;ments &#171; WA &#187; et &#171; W&#65535;A &#187; il est
&#233;limin&#233; : c&#8217;est une r&#233;version due au hasard sans volont&#233; de provoquer une figure de style, nous
appellerons ce ph&#233;nom&#232;ne &#171; pseudochiasme &#187;. Dans les conditions que nous avons d&#233;crites et
sur notre corpus de 16000 mots nous avons obtenu une pr&#233;cision inf&#233;rieure &#224; 2 % (0.017). Ce
manque de pr&#233;cision montre la complexit&#233; du probl&#232;me : une d&#233;tection efficace des antim&#233;taboles
ne peut pas se limiter au rep&#233;rage de deux couples de mots identiques sans autre forme de
s&#233;lection.
</p>
<p>4.2 M&#233;thode par identification de patrons de trois paires de mots (Hro-
mada, 2011)
</p>
<p>Hromada (2011) avec le formalisme de Harris et DiMarco (2009) retient une autre d&#233;finition de
l&#8217;antim&#233;tabole :
</p>
<p>&lt;WA WB WC . . . WC WB WA &gt;
Cette formulation signifie qu&#8217;une antim&#233;tabole est une r&#233;version de trois couples de mots
successifs (exemple : &#171; Le pouvoir du discours et le discours du pouvoir) s&#233;par&#233;s au centre par
plusieurs caract&#232;res symbolis&#233;s par &#171; . . . &#187;. Gr&#226;ce &#224; une expression r&#233;guli&#232;re, il va s&#233;lectionner les
r&#233;p&#233;titions non pas de deux mais de trois couples de mots successifs en r&#233;version. Les chiasmes
que cette expression r&#233;guli&#232;re s&#233;lectionne ont aussi pour contrainte de ne jamais comporter de
ponctuation forte. Hromada (2011) ne disposait malheureusement pas d&#8217;un corpus manuellement
annot&#233; pour &#233;valuer ses r&#233;sultats. Nous avons donc test&#233; aussi son expression r&#233;guli&#232;re sur notre
corpus. Les r&#233;sultats obtenus sont &#224; l&#8217;oppos&#233; de ceux de l&#8217;algorithme de Gawryjolek (2009)
puisque, certes, une antim&#233;tabole sur deux n&#8217;est pas identifi&#233;e (11 sur 22) mais la pr&#233;cision en
revanche est parfaite. L&#8217;expression recherch&#233;e pr&#233;sente donc tant de contraintes qu&#8217;elle arrive
&#224; ne g&#233;n&#233;rer, sur notre corpus, aucun faux positif. Nous n&#8217;allons pas reprendre l&#8217;id&#233;e des trois
paires de mots &#224; identifier au lieu de deux car cette mise en &#339;uvre est tr&#232;s restrictive. Cependant
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>156 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>cette m&#233;thode se fonde sur une bonne observation : celle que le chiasme en plus des deux paires
de mots principaux (comme dans notre exemple les termes &#171; pouvoir &#187; et &#171; discours &#187;) entra&#238;ne
souvent avec lui la r&#233;version d&#8217;autres couples de mots secondaires dans la proposition comme les
adverbes ou les d&#233;terminants (ainsi le mot &#171; du &#187; dans l&#8217;exemple).
</p>
<p>5 M&#233;thode propos&#233;e
</p>
<p>Les algorithmes que nous venons d&#8217;&#233;tudier et &#233;valuer sont encore assez limit&#233;s. Gr&#226;ce aux
&#233;valuations pr&#233;c&#233;dentes, nous savons que pour d&#233;tecter les antim&#233;taboles nous avons &#224; notre
disposition le choix entre un algorithme exhaustif mais tr&#232;s peu pr&#233;cis (Gawryjolek, 2009) et un
algorithme pr&#233;cis mais au rappel beaucoup moins important (Hromada, 2011). L&#8217;&#233;quilibre entre
rappel et pr&#233;cision est en effet difficile &#224; trouver. De plus, dans ces m&#233;thodes, la moindre flexion
telle qu&#8217;un pluriel suffit &#224; ne plus d&#233;tecter les chiasmes. Nous allons donc tout d&#8217;abord mettre
au point un algorithme qui concilie rappel et pr&#233;cision avant d&#8217;appliquer des outils de TAL pour
couvrir d&#8217;autres types de chiasmes.
</p>
<p>5.1 Les antim&#233;taboles
</p>
<p>5.1.1 M&#233;thode
</p>
<p>Notre algorithme de d&#233;tection des antim&#233;taboles s&#8217;inspire directement de celui de Gawryjolek
(2009). Cependant contrairement &#224; ce dernier, nous prenons en compte les donn&#233;es situ&#233;es
entre les mots r&#233;p&#233;t&#233;s. Cela nous permet d&#8217;ajouter plusieurs contraintes. Le probl&#232;me en effet
de l&#8217;algorithme ne rep&#233;rant que deux paires de mots en inclusion est qu&#8217;il rep&#232;re bien trop de
r&#233;p&#233;titions de mots non pertinentes (par exemple : &#171; Les chats des villes attrapent des souris mais
ne les mangent pas &#187;). Voici donc comment nous proc&#233;dons pour &#233;liminer ces pseudochiasmes :
</p>
<p>1. Nous rejetons les r&#233;p&#233;titions portant sur les mots les plus courants gr&#226;ce &#224; une liste de
&#171; mots vides &#187; (ou &#171; StopWords &#187;). Nous avons introduit une liste de mots &#224; exclure incluant
les d&#233;terminants et les mots outils les plus courants (articles, auxiliaires, pronoms et
quelques adverbes).
</p>
<p>2. Nous &#233;liminons les chiasmes en cas de ponctuation forte &#224; l&#8217;int&#233;rieur des membre gauche ou
droit du chiasme. Nous avons prolong&#233; la r&#233;flexion de Hromada (2011) sur les ponctuations.
Nous pensons que la ponctuation doit &#234;tre prise en compte mais contrairement &#224; son
expression r&#233;guli&#232;re nous allons tol&#233;rer la ponctuation forte dans certains cas. Dans nos
exemples en effet on observe que la ponctuation si elle est pr&#233;sente &#224; l&#8217;int&#233;rieur du chiasme,
se trouve le plus souvent, dans la partie centrale (exemple : &#171; Le Parti socialiste est un
parti sans leader. Fran&#231;ois Bayrou est un leader sans parti &#187;). Cela signifie que dans un
chiasme &lt;WA . . .WB . . .W&#65535;B . . .W&#65535;A &gt; il pourra se trouver un signe de ponctuation forte
mais seulement entre les mots WB et W&#65535;B. Dans le cas contraire, nous consid&#233;rerons que
le chiasme n&#8217;est qu&#8217;un pseudochiasme. Cette disposition de la ponctuation se justifie par
le fait que le chiasme joue souvent sur un effet de sym&#233;trie. Ainsi la position centrale du
signe de fin de phrase renforce cet effet.
</p>
<p>3. Enfin nous conservons la plage de 30 tokens que nous avions utilis&#233;e pour l&#8217;algorithme de
Gawryjolek (2009) (cf. 4.1).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>157 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5.1.2 R&#233;sultat
</p>
<p>Certes cet ajout de contraintes a baiss&#233; le rappel par rapport &#224; l&#8217;algorithme de Gawryjolek (2009) :
sur 22 antim&#233;taboles &#224; retrouver 21 ont &#233;t&#233; d&#233;tect&#233;es. Le filtre par &#171; StopWords &#187; en effet est une
m&#233;thode encore trop rudimentaire pour rep&#233;rer la phrase de Dumas :
</p>
<p>&#171; Tous pour un, un pour tous. &#187;
</p>
<p>Cependant le b&#233;n&#233;fice sur la pr&#233;cision est tr&#232;s significatif puisque nous passons de 2 &#224; 72 % de
pr&#233;cision. Pour trouver 21 chiasmes notre programme ne rel&#232;ve que 36 extraits au lieu de 1235
extraits pour celui de Gawryjolek (2009).
</p>
<p>5.2 Les autres types de chiasmes
</p>
<p>5.2.1 Les antim&#233;taboles flexionnelles
</p>
<p>Pour d&#233;tecter les chiasmes flexionnels nous avons repris l&#8217;algorithme 5.1.1 &#224; la seule diff&#233;rence
que nous avons pr&#233;alablement lemmatis&#233; le texte et les &#171; StopWords &#187; gr&#226;ce au programme Tree-
tagger (Schmid, 1994) associ&#233; au lemmatiseur pour le fran&#231;ais Flemm(Namer, 2000). Nous avons
pratiqu&#233; le test sur non seulement les antim&#233;taboles flexionnelles mais aussi sur les antim&#233;taboles
strictes. Les r&#233;sultats s&#8217;av&#232;rent excellents. 27 antim&#233;taboles sur 30 (22 strictes 8 flexionnelles) ont
&#233;t&#233; trouv&#233;es soit un rappel de 90 % et une pr&#233;cision de 46 %. Dans les chiasmes non reconnus
on rel&#232;ve :
</p>
<p>&#171; celui qui a le sens de la formule qui ne formule pas beaucoup de sens &#187;
</p>
<p>Cette erreur est due non pas &#224; une sous performance du lemmatiseur mais &#224; la nature ho-
monymique du lien entre les deux occurrences du mot &#171; formule &#187;. Ainsi &#171; formule &#187; dans les
deux cas a &#233;t&#233; lemmatis&#233; correctement tant&#244;t sous la forme &#171; formule &#187; (nom) tant&#244;t sous la
forme &#171; formuler &#187; (verbe) ce qui emp&#234;che l&#8217;identification. Dans ce cas pr&#233;cis, la d&#233;tection avec
lemmatisation pr&#233;alable ne remplace pas la d&#233;tection sans lemmatisation. &#192; noter, &#224; l&#8217;inverse,
que les erreurs du lemmatiseur ne g&#234;nent pas forc&#233;ment la d&#233;tection, ainsi le chiasme :
</p>
<p>&#171; Trop honn&#234;te pour &#234;tre poli que trop poli pour &#234;tre honn&#234;te ! &#187;
</p>
<p>lemmatis&#233; par Flemm en &#171; Trop honn&#234;te pour &#234;tre polir que trop polir pour &#234;tre honn&#234;te ! &#187; sera
toujours rep&#233;r&#233; puisque l&#8217;erreur provoqu&#233;e sur &#171; poli &#187; ne change pas l&#8217;identit&#233; entre les deux
occurrences du mot. Ainsi une contre-performance du lemmatiseur n&#8217;est pas forc&#233;ment nuisible &#224;
la t&#226;che de d&#233;tection des chiasmes.
</p>
<p>La deuxi&#232;me erreur de rappel est due &#224; notre filtre par position des ponctuations, l&#8217;extrait suivant
en effet n&#8217;a pas pu &#234;tre rep&#233;r&#233; :
</p>
<p>&#171; Faut-il te parler franchement ? ne te riras-tu pas de moi ?
- Laisse-moi rire de toi, et parle franchement. &#187; Musset, Les caprices de Marianne
</p>
<p>C&#8217;est ici le premier point d&#8217;interrogation qui a suscit&#233; l&#8217;erreur.
</p>
<p>Enfin le troisi&#232;me chiasme non rep&#233;r&#233; est toujours la devise des Trois Mousquetaires (cf. 5.1.2).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>158 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5.2.2 Les chiasmes d&#233;rivationnels
</p>
<p>Pour ce type de chiasme la m&#233;thode a &#233;t&#233; la m&#234;me que pour son homologue flexionnel &#224; la
diff&#233;rence que nous avons ajout&#233; un traitement sur les &#171; StopWords &#187; et sur l&#8217;ensemble du texte : la
racinisation via le programme Snowball 7 (Agichtein et Gravano, 2000). Le r&#233;sultat pour cet outil
est d&#233;favorable puisque aucun des six chiasmes n&#233;cessitant une racinisation n&#8217;a &#233;t&#233; trouv&#233;. Il y a
sur ou sous-racinisation de sorte que les termes du chiasme n&#8217;obtiennent jamais la m&#234;me racine.
Est-ce qu&#8217;un lemmatiseur &#224; base de dictionnaire et non de r&#232;gles comme snowball serait plus
efficace ? A-t-on vraiment en fran&#231;ais les ressources suffisantes pour trouver des chiasmes comme
&#171; la r&#233;gification des stars, la starification des rois &#187; ? On est en pr&#233;sence de jeux morphologiques
et &#233;tymologiques n&#233;cessitant parfois une connaissance acad&#233;mique, ce qu&#8217;un raciniseur &#224; base de
r&#232;gle n&#8217;a pas.
</p>
<p>5.2.3 Les chiasmes jouant sur les liens s&#233;mantiques ou antim&#233;talepses
</p>
<p>Th&#233;oriquement n&#8217;importe quel lien s&#233;mantique suffit &#224; relier les quatre mots d&#8217;un chiasme. En
pratique nous avons observ&#233; des liens de co-hyponymie :
</p>
<p>&#171; un b&#226;illon pour la bouche et pour la main le clou &#187;, Odon Vallet, L&#8217;&#233;vangile
des pa&#239;ens
</p>
<p>des liens de synonymie ou synonymie partielle
</p>
<p>&#171; Les d&#233;sespoirs sont morts, et mortes les douleurs &#187;, Albert Samain, Printemps
</p>
<p>et des relations d&#8217;antonymie :
</p>
<p>&#171; Ajoutez quelquefois, et souvent effacez. &#187;, Nicolas Boileau, Art po&#233;tique
</p>
<p>Nous n&#8217;avons pas trouv&#233; de wordnet fran&#231;ais couvrant assez de vocabulaire pour travailler sur
nos exemples de chiasmes liant des co-hyponymes ou des antonymes. Nous avons toutefois test&#233;
une ressource rarement utilis&#233;e en TAL (Rao et Ravichandran, 2009, p.677) : le dictionnaire des
synonymes OpenOffice (OpenOffice-community, 2011).Ce th&#233;saurus, &#224; l&#8217;origine utilis&#233; comme
dictionnaire de synonymes dans le c&#233;l&#232;bre traitement de texte pr&#233;sente l&#8217;avantage d&#8217;&#234;tre simple
(on le trouve sous la forme d&#8217;un fichier texte o&#249; est inscrit chaque mot associ&#233; &#224; une liste de
synonymes) traduit dans de nombreuses langues, gratuit et &#224; libre disposition des chercheurs.
Comment ce th&#233;saurus permet-il d&#8217;identifier des chiasmes s&#233;mantiques ? Voici sur un exemple le
proc&#233;d&#233; algorithmique utilis&#233; pour trouver la synonymie. Consid&#233;rons l&#8217;extrait suivant :
</p>
<p>&#171; Dur avec les faibles, et faible avec les forts. &#187;
</p>
<p>1. Tout le texte est pr&#233;alablement lemmatis&#233;. L&#8217;extrait devient ainsi : &#171; dur avec le faible , et
faible avec le fort . &#187;
</p>
<p>2. &#171; dur &#187; est compar&#233; &#224; tous les mots suivants mais il est proc&#233;d&#233; &#224; chaque fois &#224; deux
comparaisons. La premi&#232;re porte sur la morphologie. En effet, lorsque &#171; dur &#187; est compar&#233;
au mot &#171; fort &#187; il y a d&#8217;abord v&#233;rification des deux cha&#238;nes de caract&#232;res. &#171; dur &#187; n&#8217;est pas la
m&#234;me cha&#238;ne de caract&#232;re que &#171; fort &#187;, il faut donc proc&#233;der &#224; la seconde comparaison.
</p>
<p>3. La seconde comparaison est la comparaison s&#233;mantique. Le th&#233;saurus OpenOffice est alors mis
&#224; contribution. L&#8217;ordinateur v&#233;rifie l&#8217;entr&#233;e &#171; dur &#187; du th&#233;saurus, voici un court extrait de ce
</p>
<p>7. http://snowball.tartarus.org/algorithms/french/stemmer.html, consult&#233; le 08/05/2013
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>159 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>qui y est &#233;crit (cf. Figure 4).
</p>
<p>dur|1
(Adverbe Adjectif Nom) | acerbe | acide | consistant | ferme |[. . .]
| filandreux | nerveux | fort | fortin | forteresse | vigoureux |
robuste [. . .]
</p>
<p>FIGURE 4 &#8211; Extrait du th&#233;saurus d&#8217; Open Office &#224; l&#8217;entr&#233;e du mot &quot;dur&quot;
</p>
<p>Le mot &#171; fort &#187; est contenu dans la liste de synonymes du th&#233;saurus donc &#171; dur &#187; et &#171; fort &#187;
sont consid&#233;r&#233;s comme les candidats potentiels d&#8217;un chiasme s&#233;mantique. Si &#171; fort &#187; n&#8217;avait
pas &#233;t&#233; contenu dans l&#8217;entr&#233;e de &#171; dur &#187; la machine aurait aussi v&#233;rifi&#233; que &#171; dur &#187; n&#8217;est pas
compris dans l&#8217;entr&#233;e de &#171; fort &#187; avant d&#8217;&#233;liminer les deux candidats.
</p>
<p>Nous ne fournirons pas de calcul de pr&#233;cision sur la d&#233;tection des antim&#233;talepses car le nombre
de chiasmes de ce type &#224; trouver &#233;tant tr&#232;s r&#233;duit (sept) les r&#233;sultats n&#8217;auraient pas de tr&#232;s grande
signification. Cependant nous pouvons &#233;tablir les probl&#232;mes rencontr&#233;s. Nous avons pu observer
une importante baisse de la pr&#233;cision due &#224; des mots outils de sens proches (tant, comme, alors,
tel. . . ) ces mots outils &#233;tant consid&#233;r&#233;s comme des synonymes par le th&#233;saurus et &#233;tant assez
fr&#233;quents, il nous a fallu les inclure dans les &#171; StopWords &#187; afin d&#8217;obtenir des r&#233;sultats plus clairs.
Au final deux antim&#233;talepses ont &#233;t&#233; rep&#233;r&#233;es avec succ&#232;s :
</p>
<p>&#171; Les d&#233;sespoirs sont morts et mortes les douleurs &#187;
&#171; Dur avec les faibles, et faible avec les forts &#187;
</p>
<p>Nous observons que ces deux chiasmes sont les seuls rep&#233;r&#233;s sur les sept antim&#233;talepses pr&#233;sentes.
Cela dit, ce sont aussi les deux seuls reposant sur un lien de synonymie partielle (&#171; Dur/fort &#187;,
&#171; d&#233;sespoir/douleur &#187;) nous n&#8217;avons donc pas &#233;t&#233; victime de lacunes en terme de richesse de
vocabulaire du th&#233;saurus. Cette ressource n&#8217;&#233;tant qu&#8217;un dictionnaire de synonymes elle ne pouvait
pas, par d&#233;finition, &#233;tablir un lien entre des antonymes ou des co-hyponymes. En &#233;tablissant tous
les liens synonymiques n&#233;cessaires &#224; notre d&#233;tection, cette ressource a tenu ses promesses.
</p>
<p>6 Bilan
</p>
<p>Nous avons propos&#233; une m&#233;thode permettant d&#8217;identifier les chiasmes. Pour ce faire nous
avons &#233;mis l&#8217;hypoth&#232;se que par l&#8217;ajout de contraintes simples comme le filtrage des mots les
plus courants ou la limitation des signes de ponctuation nous pouvions obtenir une meilleure
pr&#233;cision. Cette hyoth&#232;se est v&#233;rifi&#233;e. Nous avons ensuite suppos&#233; que les outils mis &#224; disposition
du TAL fran&#231;ais nous aideraient &#224; couvrir une plus grande vari&#233;t&#233; de chiasmes. Cette hypoth&#232;se
se v&#233;rifie largement pour ce qui est du chiasme flexionnel. En revanche, en ce qui concerne le
chiasme d&#233;rivationnel nous ne sommes pas parvenue avec l&#8217;outil de racinisation test&#233; &#224; obtenir
de r&#233;sultats satisfaisants. Enfin l&#8217;antim&#233;talepse peut &#234;tre identifi&#233;e automatiquement en fran&#231;ais
gr&#226;ce &#224; un th&#233;saurus mais uniquement quand il s&#8217;agit de liens de synonymie. Concr&#233;tement nous
pouvons synth&#233;tiser l&#8217;apport de notre recherche gr&#226;ce au tableau ci-dessous (table4).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>160 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche doubles
inclusions
</p>
<p>(Gawryjolek, 2009)
</p>
<p>Recherche
triples inclusions
(Hromada, 2011)
</p>
<p>Notre recherche double
inclusion avec filtrage +
</p>
<p>outils TAL
</p>
<p>Pr&#233;cision 8
</p>
<p>(extraits justes
/ extraits rele-
v&#233;s)
</p>
<p>&lt;2 % (22 / 1235) 100 % (11/11) 58 % (21/36)
</p>
<p>Rappel
(chiasmes rele-
v&#233;s / chiasmes
&#224; trouver)
</p>
<p>100 % (22/22) 50 % (11/22) 95 % (21/22)
</p>
<p>F-mesure 9 4 % (0.035) 66 % 72 %(0.724)
D&#233;tecte-t-il les
antim&#233;taboles ?
</p>
<p>Oui Oui (en partie) Oui
</p>
<p>Les chiasmes
flexionnels ?
</p>
<p>Non Non Oui
</p>
<p>Les chiasmes
d&#233;rivationnels ?
</p>
<p>Non Non Non
</p>
<p>Les
antim&#233;talepses ?
</p>
<p>Non Non
Oui (sur liens de synony-
mie)
</p>
<p>Multilingue Non test&#233; Oui Non
</p>
<p>Avantages
</p>
<p>&#8211; Relev&#233; exhaustif
sur les antim&#233;ta-
boles strictes
</p>
<p>&#8211; Tri manuel
des faux posi-
tifs quasi-non
n&#233;cessaire.
</p>
<p>&#8211; Id&#233;al pour
fouiller de tr&#232;s
grands corpus
(&gt;100 000 de
mots)
</p>
<p>&#8211; Relev&#233; des chiasmes
jouant sur les mots
fl&#233;chis
</p>
<p>&#8211; Rappel important
&#8211; Assez pr&#233;cis pour des ana-
lyses semi-manuelles sur
corpus de taille moyenne
(&lt;100 000 de mots)
</p>
<p>Inconv&#233;nients
</p>
<p>&#8211; Peu pr&#233;cis v&#233;rifica-
tion manuelle n&#233;-
cessaire
</p>
<p>&#8211; Sur les corpus
&gt;1000 mots tri
manuel tr&#232;s long
</p>
<p>&#8211; Omission de
trop d&#8217;antim&#233;-
taboles pour
l&#8217;analyse de
discours
</p>
<p>&#8211; Tri manuel encore long si
corpus tr&#232;s grand (&gt;100
000 de mots).
</p>
<p>&#8211; Exhaustivit&#233; non garan-
tie.
</p>
<p>TABLE 4 &#8211; Synth&#232;se des r&#233;sultats et comparatif des recherches
</p>
<p>8. Tous les chiffres donn&#233;s dans ce tableau portent sur la d&#233;tection d&#8217;antim&#233;taboles strictes uniquement : les r&#233;sultats
sur antim&#233;taboles flexionnelles et antim&#233;talepses ne pouvant pas &#234;tre compar&#233;s avec d&#8217;autres.
</p>
<p>9. On &#233;mettra cependant une r&#233;serve sur les chiffres au regard de notre corpus (cf. commentaire 7.1).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>161 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>7 Discussion
</p>
<p>7.1 Commentaire sur les r&#233;sultats
</p>
<p>Les r&#233;sultats du tableau 4 sont &#224; consid&#233;rer de mani&#232;re relative. Il est important en effet de
rappeler que notre &#171; corpus &#187;, utilis&#233; &#224; la fois pour la mise au point et pour l&#8217;&#233;valuation de la
m&#233;thode, m&#234;me s&#8217;il est constitu&#233; d&#8217;exemples et de contextes r&#233;els, ne repr&#233;sente pas la raret&#233; du
ph&#233;nom&#232;ne du chiasme. Il reste un texte artificiel fond&#233; sur des extraits r&#233;els ni plus ni moins.
Ainsi, lanc&#233; sur un roman d&#8217;un 100 000 de mots la pr&#233;cision de notre algorithme comme celle de
Gawryjolek (2009) et celle de Hromada (2011) chutera parce qu&#8217;il y aura moins de chiasmes &#224;
trouver et plus de contexte pour g&#233;n&#233;rer des faux positifs.
</p>
<p>7.2 Perspectives
</p>
<p>&#192; notre connaissance cette recherche est la seule, toutes langues confondues, &#224; proposer une
ressource avec des chiasmes class&#233;s et dont on conna&#238;t pr&#233;cis&#233;ment l&#8217;origine ainsi que le contexte.
Cette ressource n&#233;cessite bien entendu d&#8217;&#234;tre enrichie surtout en ce qui concerne les antim&#233;-
talepses et les chiasmes d&#233;rivationnels trop rarement illustr&#233;s dans les ouvrages de r&#233;f&#233;rence.
Compte tenu des difficult&#233;s de collecte &#233;voqu&#233;es partie 3.1 et des probl&#232;mes de d&#233;finitions
auxquels le chercheur en TAL doit pr&#233;alablement faire face, une liste d&#8217;exemples, m&#234;me modeste,
constitue un vrai tremplin vers l&#8217;&#233;laboration d&#8217;outils automatiques ou semi-automatiques.
</p>
<p>&#192; l&#8217;am&#233;lioration du corpus, il serait int&#233;ressant d&#8217;ajouter l&#8217;am&#233;lioration des algorithmes. Cette
recherche nous a d&#233;j&#224; permis de faire le pas vers la d&#233;tection des chiasmes flexionnels : compte
tenu des r&#233;sultats encourageants obtenus avec Flemm, il n&#8217;y a plus d&#233;sormais de raison sur un
corpus en fran&#231;ais de se contenter de la d&#233;tection d&#8217;antim&#233;taboles strictes comme cela &#233;tait fait
auparavant. Notre recherche introduit aussi la d&#233;tection des chiasmes ne reposant pas sur le
rapprochement morphologique. Enfin les erreurs que nous avons relev&#233;es ouvrent la voie vers
d&#8217;autres r&#233;flexions : peut-&#234;tre que s&#233;lectionner manuellement les &#171; stopwords &#187; comme nous
l&#8217;avons fait n&#8217;est pas la mani&#232;re la plus efficace de proc&#233;der. En exploitant d&#8217;autres informations
comme l&#8217;&#233;tiquetage grammatical nous esp&#233;rons lors d&#8217;une prochaine &#233;tude augmenter la pr&#233;cision
voire le rappel. Une analyse linguistique plus pouss&#233;e non seulement des termes principaux
(adjectifs, verbes, noms) mais aussi concernant la disposition des termes secondaires (articles,
adverbes, autres mots outils) permettrait peut-&#234;tre une d&#233;tection plus pertinente (cf. 4.2).
</p>
<p>Remerciements
</p>
<p>Merci &#224; mon ancien directeur de recherche le Pr. Marcel Cori de l&#8217;universit&#233; Paris Ouest pour ses
conseils avis&#233;s lors de la direction de ce travail.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AGICHTEIN, E. et GRAVANO, L. (2000). Snowball : Extracting Relations from Large Plain-Text
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>162 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Collections. In Proceedings of the 5th ACM International Conference on Digital Libraries, pages
85&#8211;94, Texas, USA.
BENDERSKY, M. et SMITH, D. (2012). A Dictionary of Wisdom and Wit : Learning to Extract
Quotable Phrases. In Proceedings of the NAACL-HLT 2012 Workshop on Computational Linguistics
for Literature, pages 69&#8211;77, Montr&#233;al, Canada.
BRADFER, J., FRANCARD, M. et FAIRON, C. (1995). Base de donn&#233;es Julibel. Centres VALIBEL et
CENTAL, http://julibel.fltr.ucl.ac.be/index.php, consult&#233; le 08/05/2013.
DIDEROT, D. et D&#8217;ALEMBERT, J. l. R. (1789). Encyclop&#233;die m&#233;thodique : ou par ordre de
mati&#232;res, volume 66. Livre num&#233;rique Google http://books.google.fr/books?id=
NchCAAAAYAAJ&amp;lpg=PA198&amp;ots=UEkdoAOE-g&amp;dq=antimetabole%20diderot&amp;pg=
PA198#v=onepage&amp;q=antimetabole%20diderot&amp;f=false, consult&#233; le 08/05/2013.
DUPRIEZ, B. (2003). Gradus, les proc&#233;d&#233;s litt&#233;raires. Union G&#233;n&#233;rale d&#8217;&#201;ditions 10/18.
GARC&#205;A-PAGE, M. (1991). El &quot;retru&#233;cano l&#233;xico&quot; y sus l&#237;mites. Archivum : Revista de la Facultad
de Filolog&#237;a de Oviedo, 41-42:173&#8211;203.
GAWRYJOLEK, J. J. (2009). Automated Annotation and Visualization of Rhetorical Figures. Master
thesis, Universty of Waterloo.
GREENE, R. (2012). The Princeton Encyclopedia of Poetry and Poetics : Fourth Edition. Princeton
University Press.
HARRIS, R. et DIMARCO, C. (2009). Constructing a Rhetorical Figuration Ontology. In Persuasive
Technology and Digital Behaviour Intervention Symposium, pages 47&#8211;52, Edinburgh, Scotland.
HROMADA, D. D. (2011). Initial Experiments with Multilingual Extraction of Rhetoric Figures by
means of PERL-compatible Regular Expressions. In Proceedings of the Second Student Research
Workshop associated with RANLP 2011, pages 85&#8211;90, Hissar, Bulgaria.
NAMER, F. (2000). Un analyseur flexionnel du fran&#231;ais &#224; base de r&#232;gles. Traitement Automatique
des Langues, 41:1&#8211;23.
NORDAHL, H. (1971). Variantes chiasmiques. Essai de description formelle. Revue Romane,
6:219&#8211;232.
OPENOFFICE-COMMUNITY (2011). Open Office dictionaries. Th&#233;saurus en fran&#231;ais disponible sur :
http://extensions.openoffice.org/en/project/french-dictionary-modern
http://www.dicollecte.org/download/fr/thesaurus-v2.3.zip,
consult&#233;s le 08/05/2013.
POUGEOISE, M. (2001). Dictionnaire de Rh&#233;torique. Armand Colin.
RABATEL, A. (2008). Points de vue en confrontation dans les antim&#233;taboles PLUS et MOINS.
Langue fran&#231;aise, 160(4):21&#8211;36.
RAO, D. et RAVICHANDRAN, D. (2009). Semi-Supervised Polarity Lexicon Induction. In Proceedings
of the 12th Conference of the European Chapter of the ACL (EACL 2009), pages 675&#8211;682, Athens,
Greece.
SCHMID, H. (1994). Probabilistic Part-of-Speech Tagging Using Decision Trees. In Proceedings
of International Conference on New Methods in Language Processing, pages 44&#8211;49, Manchester,
Great Britain.
VAN GORP, H., DELABASTITA, D. et D&#8217;HULST, L. (2001). Dictionnaire des termes litt&#233;raires. Honor&#233;
Champion.
VANDENDORPE, C. (1991). Lecture et qu&#234;te de sens. Prot&#233;e, 19:95&#8211;101.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>163 c&#65535; ATALA</p>

</div></div>
</body></html>