<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une exp&#233;rience de compr&#233;hension en contexte de dialogue avec le syst&#232;me LOGUS, approche logique de la compr&#233;hension de la langue orale</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Une exp&#233;rience de compr&#233;hension en contexte de dialogue
avec le syst&#232;me LOGUS, approche logique de la
</p>
<p>compr&#233;hension de la langue orale
</p>
<p>Jeanne VILLANEAU
Valoria Universit&#233; de Bretagne Sud,
</p>
<p>Jeanne.Villaneau@univ-ubs.fr
</p>
<p>R&#233;sum&#233;. LOGUS est un syst&#232;me de compr&#233;hension de la langue orale dans le cadre d&#8217;un
dialogue homme-machine finalis&#233;. Il est la mise en &#339;uvre d&#8217;une approche logique qui utilise dif-
f&#233;rents formalismes afin d&#8217;obtenir un syst&#232;me robuste mais n&#233;anmoins relativement extensible.
Cet article d&#233;crit essentiellement l&#8217;&#233;tape de compr&#233;hension en contexte de dialogue impl&#233;men-
t&#233;e sur LOGUS, d&#233;velopp&#233;e et test&#233;e &#224; partir d&#8217;un corpus de r&#233;servation h&#244;teli&#232;re enregistr&#233;
et annot&#233; lors des travaux du groupe MEDIA du projet technolangue. Il d&#233;crit &#233;galement les
diff&#233;rentes interrogations et conclusions que peut susciter une telle exp&#233;rience et les r&#233;sultats
obtenus par le syst&#232;me dans la r&#233;solution des r&#233;f&#233;rences. Concernant l&#8217;approche elle-m&#234;me,
cette exp&#233;rience semble montrer que le formalisme adopt&#233; pour la repr&#233;sentation s&#233;mantique
des &#233;nonc&#233;s est bien adapt&#233; &#224; la compr&#233;hension en contexte.
</p>
<p>Abstract. LOGUS is a spoken language understanding system usable in a man-machine
dialogue. It is based on a logical approach where various formalisms are used, in order to
achieve a robust but generic and extensible system. Implementation of a context-sensitive un-
derstanding is the main topic of this paper. Processing and tests were carried out from a hotel
reservation corpus which was recorded and annotated as part of the work handled by the tech-
nolangue consortium&#8217;sMEDIA subgroup. This paper also describes the various questions raised
and conclusions drawn from such an experiment, as well as the results achieved by the system
for anaphora resolution. This experiment shows that the formalism used in order to represent
the meaning of the utterances is relevant for anaphora resolution and in-context understanding.
</p>
<p>Mots-cl&#233;s : compr&#233;hension automatique de la parole, r&#233;solution des r&#233;f&#233;rences, dialogue
oral homme-machine.
</p>
<p>Keywords: man-machine dialogue, spoken language understanding, anaphora re-
solution.
</p>
<p>1 Introduction
</p>
<p>Dans un syst&#232;me de dialogue oral Homme-Machine (DOHM), le module de &#171; compr&#233;hen-
sion &#187; de la langue orale spontan&#233;e remplit une t&#226;che essentielle : &#224; partir de la liste ou du
graphe de mots que lui transmet le module de reconnaissance de la parole, il doit construire une
structure s&#233;mantique qui puisse rendre compte du sens du message de l&#8217;utilisateur et qui soit
utilisable par le module de dialogue.
</p>
<p>293</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jeanne VILLANEAU
</p>
<p>Lorsque le syst&#232;me de DOHM est con&#231;u pour une t&#226;che tr&#232;s restreinte, horaires de train ou
d&#8217;avion par exemple, cette interpr&#233;tation du message peut se limiter &#224; la d&#233;tection d&#8217;une s&#233;-
quence de concepts, sur la base de structures s&#233;mantiques pr&#233;d&#233;finies. Mais, lorsque le domaine
d&#8217;application s&#8217;&#233;largit, cette pr&#233;d&#233;finition des requ&#234;tes devient plus complexe et la compr&#233;hen-
sion requiert d&#8217;autres approches (van Noord et al., 1999).
</p>
<p>LOGUS est un syst&#232;me de compr&#233;hension de la parole spontan&#233;e dans le cadre d&#8217;un DOHM
con&#231;u pour des domaines restreints, mais n&#233;anmoins plus &#233;tendus que les domaines o&#249; op&#232;rent
la plupart des syst&#232;mes actuellement op&#233;rationnels. Il correspond &#224; la mise en &#339;uvre d&#8217;une
approche logique qui utilise diff&#233;rents formalismes pour combiner des outils syntaxiques et
s&#233;mantiques. La prise en compte du contexte de dialogue est l&#8217;un des &#233;l&#233;ments essentiels de la
&#171; compr&#233;hension &#187;. Particuli&#232;rement, l&#8217;approche utilis&#233;e pour la r&#233;solution des r&#233;f&#233;rences reste
symbolique et logique et vient ainsi en compl&#233;ment de celle utilis&#233;e dans la conception g&#233;n&#233;rale
du syst&#232;me.
</p>
<p>Cet article pr&#233;sente essentiellement les travaux d&#8217;impl&#233;mentation de la compr&#233;hension en
contexte de dialogue r&#233;alis&#233;s sur le syst&#232;me LOGUS &#224; partir du corpus MEDIA. Apr&#232;s une
br&#232;ve exposition dans la section 2 des principes qui ont pr&#233;sid&#233; &#224; la conception du syst&#232;me
LOGUS, la section 3 d&#233;crit le cadre du projet MEDIA et fait une br&#232;ve analyse de son corpus,
afin de d&#233;gager l&#8217;int&#233;r&#234;t de son utilisation pour une telle exp&#233;rimentation. Les principes de la
compr&#233;hension en contexte et, plus pr&#233;cis&#233;ment, de la r&#233;solution des r&#233;f&#233;rences mises en &#339;uvre
dans LOGUS sont pr&#233;sent&#233;s dans la section 4. La section 5 pr&#233;sente une analyse quantitative
et qualitative des r&#233;sultats. L&#8217;article se termine avec la discussion et les conclusions pr&#233;sent&#233;es
dans la section 6.
</p>
<p>2 LOGUS : une utilisation de formalismes logiques pour la
compr&#233;hension
</p>
<p>LOGUS est un syst&#232;me de compr&#233;hension de l&#8217;oral spontan&#233; pour l&#8217;interrogation orale d&#8217;une
base de donn&#233;es1. Il a &#233;t&#233; con&#231;u pour fonctionner dans un domaine sensiblement plus large que
ceux habituellement consid&#233;r&#233;s pour ce type d&#8217;applications, o&#249; une repr&#233;sentation s&#233;mantique
de l&#8217;&#233;nonc&#233; par listes pr&#233;construites d&#8217;attributs-valeurs s&#8217;av&#232;re suffisante. N&#233;anmoins, l&#8217;analyse
s&#8217;appuie sur une connaissance s&#233;mantique du domaine qui doit donc rester bien d&#233;limit&#233; et
relativement &#233;troit.
</p>
<p>&#192; partir d&#8217;une liste de mots issue d&#8217;un module de reconnaissance de la parole, LOGUS pro-
duit une formule logique qui repr&#233;sente le sens de l&#8217;&#233;nonc&#233;. Le formalisme utilis&#233; est adapt&#233;
de la logique illocutoire de D. Vanderveken (Vanderveken, 2001) ; la formule logique s&#8217;obtient
par application d&#8217;un acte de langage (sa force propositionnelle) &#224; une structure construite &#224;
partir des &#171; objets &#187; de l&#8217;&#233;nonc&#233; connus du syst&#232;me (son contenu propositionnel). La repr&#233;sen-
tation s&#233;mantique peut &#233;galement &#234;tre repr&#233;sent&#233;e sous la forme d&#8217;un graphe conceptuel &#224; la
Sowa (Sowa, 2001). La figure 1 donne un exemple de la structure s&#233;mantique obtenue &#224; partir
d&#8217;un &#233;nonc&#233; du corpus MEDIA (cf. 3.1).
</p>
<p>L&#8217;analyse de l&#8217;&#233;nonc&#233; est incr&#233;mentale et progressive ; elle se fait par &#233;tapes qui utilisent suc-
cessivement diff&#233;rents formalismes logiques.
</p>
<p>1Pour une description plus d&#233;taill&#233;e du syst&#232;me, on peut consulter les r&#233;f&#233;rences suivantes : (Villaneau et al.,
2004; Villaneau, 2003).
</p>
<p>294</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOGUS : compr&#233;hension en contexte de dialogue
</p>
<p>L&#8217;&#233;nonc&#233; :
&#171; je souhaiterais r&#233;server dans un h&#244;tel Mercure trois &#233;toiles &#224; Belfort pour les quatre
derniers jours de juin &#187;
</p>
<p>Sorties LOGUS :
(vouloir (de (reservation [(date (num_mois (derniers (entier 4)) (nom &quot;juin&quot;)))])
</p>
<p>(hotel [ (marque_hotel (nom &quot;Mercure&quot;)),
(etoiles (entier 3)),
(lieu (ville [(identification (nom &quot;Belfort&quot;))]))])
</p>
<p>hotellieu
</p>
<p>(nom &quot;Belfort&quot;)
</p>
<p>ville
</p>
<p>ident. etoiles
</p>
<p>vouloir requete reservation
</p>
<p>de
</p>
<p>marque      &quot;Mercure&quot;
</p>
<p>date num_mois
</p>
<p>mois       juin
</p>
<p>(entier 3)
</p>
<p>jours         derniers (entier 4)
</p>
<p>FIG. 1 &#8211; Un &#233;nonc&#233; du corpus MEDIA et la sortie LOGUS correspondante
</p>
<p>&#8211; Un lexique permet d&#8217;attacher &#224; chaque mot &#171; connu &#187; une ou plusieurs &#171; d&#233;finitions &#187;.
&#8211; Une premi&#232;re analyse partielle rattache les mots grammaticaux &#224; leur t&#234;te lexicale. Cette &#233;tape
</p>
<p>peut &#234;tre consid&#233;r&#233;e comme un &#171; chunking minimaliste &#187;. Elle utilise des r&#232;gles adapt&#233;es de
celles des grammaires cat&#233;gorielles de type AB et les termes simplement typ&#233;s du &#955;-calcul
(Villaneau &amp; Antoine, 2004).
</p>
<p>&#8211; Les &#233;tapes suivantes s&#8217;appuient sur une connaissance du domaine (ontologie) qui d&#233;crit le
type des concepts du domaine d&#8217;application et les liens s&#233;mantiques qui peuvent les r&#233;unir.
L&#8217;analyse de ces liens dans l&#8217;&#233;nonc&#233; utilise les r&#232;gles g&#233;n&#233;riques d&#8217;une grammaire qui com-
binent les indices syntaxiques et s&#233;mantiques des diff&#233;rents composants. Ces r&#232;gles sont ap-
pliqu&#233;es en cascade, avec un assouplissement progressif des contraintes syntaxiques.
</p>
<p>&#8211; La derni&#232;re &#233;tape prend en compte le contexte du dialogue pour compl&#233;ter et pr&#233;ciser la
compr&#233;hension de l&#8217;&#233;nonc&#233; (cf. section 4). C&#8217;est essentiellement &#224; l&#8217;exp&#233;rimentation sur le
corpus MEDIA de cette contextualisation qu&#8217;est consacr&#233; cet article.
</p>
<p>3 Le projet MEDIA et son corpus
</p>
<p>3.1 Le corpus MEDIA
</p>
<p>Le projet MEDIA (programme Technolangue/Evalda) avait pour objectif l&#8217;&#233;valuation de diff&#233;-
rents syst&#232;mes de compr&#233;hension en dialogue Homme-Machine, hors et en contexte de dia-
logue. Les partenaires du projet avaient choisi d&#8217;enregistrer un corpus &#224; partir d&#8217;un serveur de
r&#233;servation h&#244;teli&#232;re. Le corpus enregistr&#233; par ELDA (appell&#233; corpus MEDIA par la suite) pour
la campagne d&#8217;&#233;valuation comporte 1250 dialogues : les 250 utilisateurs du syst&#232;me ont inter-
rog&#233; le syst&#232;me suivant diff&#233;rents scenarii de r&#233;servation d&#8217;h&#244;tels, &#233;labor&#233;s par les partenaires
</p>
<p>295</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jeanne VILLANEAU
</p>
<p>du projet. L&#8217;enregistrement s&#8217;est fait suivant le principe du Magicien d&#8217;Oz : les locuteurs ont
dialogu&#233; avec un syst&#232;me simul&#233; &#224; leur insu par un op&#233;rateur humain. La figure 2 donne un
extrait de dialogue du corpus. Dans cet exemple, Ut d&#233;signe l&#8217;utilisateur du syst&#232;me et Co le
comp&#232;re qui simule le syst&#232;me. Les expressions soulign&#233;es indiquent les marques linguistiques
qui renvoient &#224; une r&#233;solution des r&#233;f&#233;rences en contexte de dialogue.
</p>
<p>... ...
Ut &quot;r&#233;server une chambre simple du premier au six d&#233;cembre dans trois endroits
</p>
<p>diff&#233;rents&quot;
Co &quot;dans quelle ville souhaitez vous vous rendre&quot;
Ut &quot;alors du un au trois d&#233;cembre je veux &#234;tre &#224; Chalon Sur Sa&#244;ne du trois au cinq
</p>
<p>d&#233;cembre &#224; Bourg en Bresse et du cinq au six &#224; Chaumont&quot;
Co &quot;veuillez patienter nous recherchons cette information &#224; Chalon Sur Sa&#244;ne du premier
</p>
<p>au trois d&#233;cembre deux h&#244;tels correspondent &#224; votre demande le Saint R&#233;gis
et le Ibis centre ville voulez vous des d&#233;tails ou r&#233;server dans l un de ces h&#244;tels&quot;
</p>
<p>Ut &quot;hum des d&#233;tails&quot;
Co &quot;quelle information voulez vous&quot;
Ut &quot;euh je voudrais le prix de la chambre&quot;
Co &quot;&#8216;a l h&#244;tel le Saint R&#233;gis la chambre individuelle est &#224; cinquante euros &#8216;a l h&#244;tel Ibis
</p>
<p>centre ville la chambre individuelle est &#224; cinquante euros souhaitez vous faire une
r&#233;servation dans l un de ces h&#244;tels&quot;
</p>
<p>Ut &quot;euh est ce que l un de ces h&#244;tels accueille les animaux et est ce qu il y a un tennis&quot;
... ...
Co &quot;... souhaitez vous r&#233;server dans l un de ces h&#244;tels&quot;
Ut &quot;oui&quot;
Co &quot;si oui lequel&quot;
Ut &quot;euh le premier&quot;
... ...
</p>
<p>FIG. 2 &#8211; Extrait de dialogue du corpus MEDIA
</p>
<p>Le corpus ainsi enregistr&#233; a ensuite fait l&#8217;objet d&#8217;une transcription manuelle par ELDA, puis
d&#8217;une annotation s&#233;mantique suivant les r&#232;gles d&#8217;un manuel d&#8217;annotation mis au point par les
partenaires du projet2 : dans l&#8217;annotation s&#233;mantique hors-contexte, chaque &#233;nonc&#233; est divis&#233; en
segments conceptuels &#171; porteurs de sens &#187;. &#192; chacun d&#8217;entre eux est attribu&#233; un triplet (mode,
attribut, valeur) ; des sp&#233;cifieurs sont attach&#233;s aux attributs, afin de pr&#233;ciser les liens entre les
diff&#233;rents concepts3. La figure 3 donne un &#233;nonc&#233; extrait du corpus MEDIA avec son annotation
s&#233;mantique.
</p>
<p>Dans l&#8217;annotation s&#233;mantique en contexte de dialogue, les expressions r&#233;f&#233;rentielles portent les
num&#233;ros des segments conceptuels auxquels elles renvoient.
</p>
<p>2La mesure d&#8217;accord entre annotateurs (kappa) se situe au-dessus de 80%.
3Pour plus de d&#233;tails, on peut consulter (Devillers et al., 2004).
</p>
<p>296</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOGUS : compr&#233;hension en contexte de dialogue
</p>
<p>je souhaiterais r&#233;server + :command-tache :reservation
dans un h&#244;tel Mercure + :hotel-marque-reservation :mercure
trois &#233;toiles + :hotel-etoile :3etoile
&#224; Belfort + :localisation-ville-hotel :belfort
pour les quatre + :nombre-temps-reservation :4
derniers + :temps-axetps-reservation :dernier
jours + :temps-unite-reservation :jour
de juin + :temps-mois-reservation :6
</p>
<p>FIG. 3 &#8211; L&#8217;&#233;nonc&#233; de la figure 1 et son annotation MEDIA
</p>
<p>3.2 &#201;valuation hors-contexte
</p>
<p>Le syst&#232;me LOGUS a particip&#233; &#224; la campagne d&#8217;&#233;valuation hors-contexte (Bonneau-Maynard
et al., 2006). Il y a obtenu des r&#233;sultats honorables mais sans grande signification4. En effet,
la principale difficult&#233; rencontr&#233;e pour la participation de LOGUS &#224; cette campagne ne fut pas
l&#8217;adaptation du syst&#232;me &#224; la t&#226;che, mais bien la transformation de la formule logique obtenue
en la suite ordonn&#233;e de triplets (mode, attribut, valeur) demand&#233;e par MEDIA. Les sorties LO-
GUS sont globales : il y a &#171; oubli &#187; de l&#8217;ordre des mots et de la forme linguistique attach&#233;e &#224;
l&#8217;expression des requ&#234;tes. Comme on pouvait le craindre, l&#8217;annotation &#171; coll&#233;e au texte &#187; de
MEDIA s&#8217;est r&#233;v&#233;l&#233;e souvent difficile voire impossible5 &#224; reconstituer &#224; partir de la repr&#233;senta-
tion s&#233;mantique finale : ainsi les deux tiers des erreurs relev&#233;es pour LOGUS ont &#233;t&#233; imputables
&#224; la transformation des sorties du syst&#232;me en la liste ordonn&#233;e des triplets demand&#233;e.
</p>
<p>3.3 Les r&#233;f&#233;rences dans Media
</p>
<p>L&#8217;un des principes retenus par les partenaires MEDIA &#233;tait que seules les expressions se rappor-
tant &#224; des r&#233;f&#233;rences hors &#233;nonc&#233; devaient &#234;tre prises en consid&#233;ration.
</p>
<p>&#201;tant donn&#233; le domaine d&#8217;application retenu pour le projet, la r&#233;solution des r&#233;f&#233;rences ne porte
que sur quatre types d&#8217;objets : les h&#244;tels, les chambres, les tarifs et les dates. Par ailleurs, les
dialogues MEDIA sont g&#233;n&#233;ralement assez simples. Dans un dialogue standard du corpus, les
&#233;nonc&#233;s les plus complexes sont ceux o&#249; l&#8217;utilisateur expose ses exigences. Ensuite, le comp&#232;re
pose des questions et, le plus souvent, l&#8217;utilisateur lui donne des r&#233;ponses courtes et elliptiques.
Malgr&#233; tout, les expressions anaphoriques y sont tr&#232;s diverses et repr&#233;sentatives de l&#8217;ensemble
des difficult&#233;s classiquement rencontr&#233;es lors de la r&#233;solution des r&#233;f&#233;rences.
</p>
<p>Le corpus contient par exemple un grand nombre d&#8217;expressions d&#233;finies et toutes les classes
d&#8217;anaphores qui leur correspondent. Par exemples, suivant la classification propos&#233;e par
C. Gardent et H. Manu&#233;lian (Gardent &amp; Manuelian, 2005), &#171; les &#187; dans l&#8217;expression &#171; les ani-
maux &#187; de l&#8217;extrait de dialogue donn&#233; figure 2 est une description autonome : elle ne donne pas
lieu &#224; une r&#233;solution. Dans ce m&#234;me extrait le &#171; le &#187; de l&#8217;expression &#171; le prix de la chambre &#187; est
une description associative ; comme son r&#233;f&#233;rent se trouve dans l&#8217;&#233;nonc&#233;, il n&#8217;y a pas de r&#233;solu-
tion suivant les conventions MEDIA. En revanche, &#171; la &#187; dans cette m&#234;me expression peut &#234;tre
</p>
<p>4Le syst&#232;me a &#233;t&#233; class&#233; quatri&#232;me derri&#232;re les 2 syst&#232;mes du LIMSI et le syst&#232;me du LORIA (approche
symbolique) et devant le syst&#232;me du LIA (approche stochastique).
</p>
<p>5Sauf &#224; remodeler profond&#233;ment le syst&#232;me, solution a priori exclue.
</p>
<p>297</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jeanne VILLANEAU
</p>
<p>consid&#233;r&#233;e comme une description contextuelle, li&#233;e au r&#233;f&#233;rent des h&#244;tels pr&#233;cit&#233;s. Mais ce
&#171; la &#187; est &#233;galement cor&#233;f&#233;rentiel dans la mesure o&#249; &#171; la chambre &#187; s&#8217;identifie avec la chambre
demand&#233;e par l&#8217;utilisateur. Le choix MEDIA retient d&#8217;ailleurs les deux typologies puisque les
segments r&#233;f&#233;rentiels de l&#8217;annotation contextuelle contiennent les caract&#233;ristiques de la chambre
demand&#233;es par l&#8217;utilisateur (chambre simple) et les propri&#233;t&#233;s des h&#244;tels propos&#233;s par le com-
p&#232;re. Des expressions anaphoriques similaires sont introduites par des adjectifs d&#233;monstratifs :
cet h&#244;tel, ces deux chambres, etc..
</p>
<p>Le corpus contient &#233;galement un tr&#232;s grand nombre d&#8217;expressions anaphoriques incluant une
notion d&#8217;ordre : le premier, le dernier, le deuxi&#232;me, etc. ou une notion d&#8217;exclusion : l&#8217;autre, les
autres, les deux autres, un autre, d&#8217;autres.
</p>
<p>On trouve &#233;galement des pronoms qui d&#233;signent des r&#233;f&#233;rents au sens MEDIA : je la r&#233;serve,
est-ce qu&#8217;ils acceptent les chiens, etc. alors que, par convention MEDIA, l&#8217;expression &#171; il y a &#187;
n&#8217;est pas cor&#233;f&#233;rentielle.
</p>
<p>4 LOGUS : compr&#233;hension en contexte
</p>
<p>4.1 Les principes g&#233;n&#233;raux de la compr&#233;hension en contexte
</p>
<p>Le principe g&#233;n&#233;ral adopt&#233; pour la r&#233;solution des r&#233;f&#233;rences dans LOGUS reste le m&#234;me que
celui qui pr&#233;vaut &#224; la compr&#233;hension hors contexte : combiner les crit&#232;res syntaxiques et les
crit&#232;res s&#233;mantiques, ceux-ci pr&#233;valant sur ceux-l&#224;. En effet, si, dans les textes, les crit&#232;res
syntaxiques sont g&#233;n&#233;ralement plut&#244;t bien respect&#233;s (Boudreau &amp; Kittredge, 2005), il est loin
d&#8217;en &#234;tre de m&#234;me &#224; l&#8217;oral o&#249;, g&#233;n&#233;ralement, l&#8217;implicite domine. Le corpus MEDIA permet
d&#8217;illustrer ces affirmations : par exemple, l&#8217;une des formulations les plus fr&#233;quentes dans le
corpus MEDIA pour demander si un h&#244;tel accepte les animaux est : &#171; est-ce qu&#8217;il acceptent
les chiens &#187;. Cette utilisation du pluriel est si fr&#233;quente qu&#8217;il est difficile de penser qu&#8217;il s&#8217;agit
l&#224; d&#8217;une faute de syntaxe. Elle correspond ici plut&#244;t &#224; une ellipse pour les &#171; gens de l&#8217;h&#244;tel &#187;.
On trouve &#233;galement des expressions telles que &#171; celle &#224; cinquante euros &#187; alors m&#234;me que le
r&#233;f&#233;rent logique est un h&#244;tel. Il s&#8217;agit bien l&#224; encore d&#8217;une ellipse pour &#171; la chambre de l&#8217;h&#244;tel &#187;.
</p>
<p>L&#8217;une des relations s&#233;mantiques fondamentales utilis&#233;e pour la construction de la repr&#233;senta-
tion du sens de l&#8217;&#233;nonc&#233; dans LOGUS indique une d&#233;pendance entre deux objets. Cette relation
conceptuelle g&#233;n&#233;rique, d&#233;sign&#233;e par &#171; de &#187;, inclut par exemple les relations partie-tout ; elle
permet de construire les &#171; cha&#238;nes d&#8217;objets &#187;. Ainsi &#171; le prix d&#8217;une chambre &#224; l&#8217;h&#244;tel Ibis &#187; cor-
respond &#224; la cha&#238;ne : (tarif []) de (chambre []) de (hotel [(marque &#8220;Ibis&#8221;)]) o&#249; l&#8217;objet &#171; termi-
nal &#187; est (hotel [(marque &#8220;Ibis&#8221;)]), en l&#8217;occurrence une entit&#233; nomm&#233;e. La notion qui pr&#233;vaut
&#224; la compr&#233;hension en contexte de dialogue pour le syst&#232;me LOGUS est celle de compl&#233;tion
des cha&#238;nes d&#8217;objets : dans un &#233;nonc&#233;, une propri&#233;t&#233; ou un sous-objet peuvent &#234;tre compl&#233;t&#233;s
par des cha&#238;nes de sur-objet du contexte, si cette compl&#233;tion a un sens, donc si l&#8217;ontologie du
domaine le permet. Par exemple, pour un &#233;nonc&#233; &#171; quels sont les tarifs &#187; l&#8217;objet tarif serait au-
tomatiquement compl&#233;t&#233; par la cha&#238;ne (chambre []) de (hotel [(marque &#8220;Ibis&#8221;)]) si cette cha&#238;ne
est l&#8217;objet contextuel le plus proche.
</p>
<p>298</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOGUS : compr&#233;hension en contexte de dialogue
</p>
<p>4.2 LOGUS : mise en &#339;uvre de la r&#233;solution des r&#233;f&#233;rences pour le corpus
MEDIA
</p>
<p>Les dialogues du corpus MEDIA correspondent &#224; un jeu de r&#244;les relativement simple. Le locu-
teur &#233;nonce des contraintes ; le syst&#232;me propose des noms d&#8217;h&#244;tels qui sont cens&#233;s les satisfaire.
Au cours du dialogue, l&#8217;utilisateur fait &#233;voluer ses exigences et il y a succ&#232;s si un accord finit par
&#234;tre trouv&#233; entre celles-ci et les propositions du comp&#232;re. Dans la pratique, les r&#233;f&#233;rences li&#233;es
au dialogue portent essentiellement sur les h&#244;tels propos&#233;s par le comp&#232;re et les sous-objets ou
propri&#233;t&#233;s de ces h&#244;tels li&#233;s aux exigences du demandeur.
</p>
<p>L&#8217;objectif &#233;tant de pouvoir mesurer objectivement les performances du syst&#232;me &#224; partir des
exigences MEDIA, il convenait de respecter les principes g&#233;n&#233;raux de l&#8217;annotation et de se li-
miter aux r&#233;f&#233;rences qui correspondaient &#224; des indices linguistiques explicites. Les principes
g&#233;n&#233;raux expos&#233;s dans le paragraphe pr&#233;c&#233;dent ont donc d&#251; &#234;tre largement amend&#233;s. Plus pr&#233;-
cis&#233;ment, les r&#233;f&#233;rences renvoyant &#224; des chambres ou &#224; des tarifs ont &#233;t&#233; trait&#233;es conform&#233;ment
&#224; ces principes, avec un recopiage de la cha&#238;ne d&#8217;objets correspondante jusqu&#8217;au sur-objet de
cette cha&#238;ne : l&#8217;h&#244;tel concern&#233;. Afin de faire un choix parmi les cha&#238;nes d&#8217;objets contextuels
d&#233;sign&#233;es comme s&#233;mantiquement possibles par l&#8217;ontologie, un traitement particulier a d&#251; &#234;tre
appliqu&#233; pour chaque forme linguistique de la r&#233;f&#233;rence.
</p>
<p>Chacun de ces traitements comporte g&#233;n&#233;ralement plusieurs niveaux : une premi&#232;re recherche
o&#249; crit&#232;res syntaxiques et s&#233;mantiques sont respect&#233;s, suivie d&#8217;un rel&#226;chement progressif des
contraintes. Par exemple, &#171; le premier h&#244;tel &#187; est d&#8217;abord recherch&#233; comme le premier &#233;l&#233;ment
de la derni&#232;re liste d&#8217;h&#244;tels &#233;nonc&#233;s par le comp&#232;re. Cependant, rien n&#8217;est moins s&#251;r que cette
liste existe. Les alea du dialogue, tours de parole interrompus par exemple, font que le com-
p&#232;re n&#8217;a pas forc&#233;ment propos&#233; les diff&#233;rents h&#244;tels dans un seul tour de parole : si donc cette
premi&#232;re recherche ne rend pas de r&#233;sultat, &#171; le premier h&#244;tel &#187; sera alors recherch&#233; comme le
premier h&#244;tel propos&#233; par le comp&#232;re. De la m&#234;me mani&#232;re, chaque expression de &#171; autre &#187; :
les deux autres, un autre, l&#8217;autre, etc. donne lieu &#224; une strat&#233;gie de recherche particuli&#232;re.
</p>
<p>La r&#233;solution doit &#233;galement prendre en compte les erreurs potentielles des locuteurs : erreurs
de genre ou de nombre. Des exemples en ont d&#233;j&#224; &#233;t&#233; donn&#233;s dans le paragraphe pr&#233;c&#233;dent
(cf. 4.1) sous la forme d&#8217;ellipses ; il peut aussi s&#8217;agir parfois de v&#233;ritables erreurs de la part
du locuteur &#171; ces deux h&#244;tels &#187; alors qu&#8217;il y a trois h&#244;tels par exemple. Dans la r&#233;solution, ce
type de contraintes sur les quantit&#233;s exprim&#233;es ne sont rel&#226;ch&#233;es qu&#8217;en tout dernier lieu. Il n&#8217;est
d&#8217;ailleurs pas certain qu&#8217;elles devraient l&#8217;&#234;tre dans un v&#233;ritable syst&#232;me : il serait en effet sans
doute plus pertinent que le syst&#232;me signifie &#224; son interlocuteur qu&#8217;il ne l&#8217;a pas compris.
</p>
<p>5 Analyse des r&#233;sultats
</p>
<p>Les tests ont &#233;t&#233; faits sur 100 dialogues pris au hasard dans le corpus annot&#233; parmi ceux qui
n&#8217;avaient pas servi au d&#233;veloppement du syst&#232;me. Le tableau 1 donne les r&#233;sultats chiffr&#233;s ainsi
obtenus, et ce, de deux fa&#231;ons diff&#233;rentes. Les premiers sont calcul&#233;s &#224; partir des segments
conceptuels d&#233;finis dans l&#8217;annotation du corpus. Les seconds sont obtenus &#224; partir des objets
MEDIA eux-m&#234;mes, un objet &#233;tant en g&#233;n&#233;ral d&#233;fini par plusieurs segments. Par exemple, un
h&#244;tel est en g&#233;n&#233;ral r&#233;f&#233;renc&#233; par deux segments conceptuels : son nom et sa ville. Une erreur
sur l&#8217;un d&#8217;entre eux correspond en fait &#224; une erreur sur l&#8217;objet lui-m&#234;me. En revanche, on
peut consid&#233;rer que l&#8217;identification de la taille, de la date et de l&#8217;h&#244;tel suffisent &#224; r&#233;f&#233;rencer
</p>
<p>299</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jeanne VILLANEAU
</p>
<p>une chambre, m&#234;me si le (ou les) segments conceptuels qui pr&#233;cisent son prix a &#233;t&#233; oubli&#233;.
Lorsque ces nombres ont &#233;t&#233; collect&#233;s, la diff&#233;rence entre les deux m&#233;thodes de calcul semblait
flagrante. Or, si les r&#233;sultats obtenus peuvent &#234;tre tr&#232;s diff&#233;rents lorsqu&#8217;ils se rapportent &#224; un
ou deux dialogues, il est &#233;tonnant de constater que sur l&#8217;ensemble des dialogues test&#233;s, ils sont
finalement globalement tr&#232;s comparables6.
</p>
<p>Nb de segments Segments Segments Rappel Pr&#233;cision F
MEDIA (A) corrects (C) incorrects (I) R=C/A) P=C/(C+I) 2RP/(R+P)
</p>
<p>572 405 42 0,71 0,91 0,80
Nb d&#8217;objets Objets Objets Rappel Pr&#233;cision F&#8217;
MEDIA (A&#8217;) corrects (C&#8217;) incorrects (I&#8217;) R&#8217;=C&#8217;/A&#8217; P&#8217;=C&#8217;/(C&#8217;+I&#8217;) 2R&#8217;P&#8217;/(R&#8217;+P&#8217;)
</p>
<p>212 155 19 0,73 0,89 0,80
</p>
<p>TAB. 1 &#8211; R&#233;solution des r&#233;f&#233;rences dans le corpus MEDIA : r&#233;sultats chiffr&#233;s
</p>
<p>Qualitativement, on peut classer les fautes faites par le syst&#232;me en quatre cat&#233;gories.
&#8211; Comme l&#8217;indique le taux relativement bas du Rappel, la premi&#232;re cause d&#8217;erreurs est l&#8217;ab-
sence de d&#233;tection de certaines r&#233;f&#233;rences. Les articles d&#233;finis sont particuli&#232;rement redou-
tables &#224; cet &#233;gard. Par exemple, il n&#8217;est pas &#233;vident de savoir si une condition sur &#171; les
chambres &#187; se rapportent ou non aux h&#244;tels propos&#233;s pr&#233;c&#233;demment. Par ailleurs, &#224; l&#8217;ins-
tar du &#171; it &#187; de la langue anglaise (Boyd et al., 2005), le pronom personnel &#171; il &#187; a beaucoup
d&#8217;occurrences non r&#233;f&#233;rentielles et m&#233;riterait un traitement sp&#233;cifique qui n&#8217;est actuellement
pas r&#233;alis&#233;.
</p>
<p>&#8211; Certaines erreurs sont dues aux difficult&#233;s de compr&#233;hension des... &#233;nonc&#233;s du comp&#232;re (cf. la
discussion de la section suivante). Dans un &#233;nonc&#233; tel que &#171; Astor Sofitel Novotel arc de
triomphe Libertel Arc de triomphe &#187;, une segmentation correcte pour d&#233;tecter les trois h&#244;tels
propos&#233;s n&#8217;est pas si &#233;vidente.
</p>
<p>&#8211; D&#8217;autres erreurs sont dues &#224; une mauvaise compr&#233;hension de la r&#233;f&#233;rence elle-m&#234;me. Ainsi,
pour des expressions telles que &#171; la deuxi&#232;me proposition &#187;, &#171; celui qui reste &#187;, &#171; celui qui est
pr&#232;s de l&#8217;autoroute &#187;, LOGUS donne une r&#233;f&#233;rence erron&#233;e.
</p>
<p>&#8211; Il semble relativement facile de corriger une bonne partie des bugs pr&#233;cit&#233;s. En revanche, pour
r&#233;soudre certaines r&#233;f&#233;rences, il faudrait munir le syst&#232;me d&#8217;une connaissance du contexte
autrement plus complexe que celle dont il est actuellement pourvu. Par exemple, dans l&#8217;un
des dialogues on a les tours de parole suivants :
</p>
<p>Comp&#232;re : &#171; ... il reste cinq cents chambres disponibles &#187;
</p>
<p>Comp&#232;re/Utilisateur : tours de parole concernant la date
</p>
<p>Utilisateur : &#171; oui vous me la r&#233;servez &#187;
</p>
<p>Le &#171; la &#187; fait r&#233;f&#233;rence aux cinq chambres demand&#233;es par l&#8217;utilisateur en d&#233;but de dialogue,
dans des tours de parole relativement &#233;loign&#233;s. En rel&#226;chant les contraintes de nombre, LO-
GUS choisit les cinq cents chambres...
</p>
<p>En conclusion, les traitements utilis&#233;s n&#8217;&#233;tant pas tr&#232;s sophistiqu&#233;s, il serait sans doute relative-
ment facile d&#8217;augmenter le rappel sans nuire &#224; la pr&#233;cision. En revanche, un certain nombre de
r&#233;f&#233;rences font appel au &#171; sens commun &#187;, celui qui est si difficile &#224; cerner et &#224; impl&#233;menter...
</p>
<p>6Aucune comparaison directe n&#8217;est malheureusement possible avec les deux participants de la campagne d&#8217;&#233;va-
luation en contexte de MEDIA puisque la fa&#231;on de proc&#233;der pour l&#8217;&#233;valuation de LOGUS a &#233;limin&#233; les contraintes
dues &#224; la forme requise par MEDIA et les erreurs qu&#8217;elle implique.
</p>
<p>300</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOGUS : compr&#233;hension en contexte de dialogue
</p>
<p>6 Discussion et conclusion
</p>
<p>Une premi&#232;re critique possible de cette exp&#233;rience est le caract&#232;re quelque peu artificiel de
l&#8217;exercice.
&#8211; La compr&#233;hension en contexte de dialogue sur ce corpus a demand&#233; que soit impl&#233;ment&#233;e
</p>
<p>une compr&#233;hension des &#233;nonc&#233;s comp&#232;re. Cette t&#226;che n&#8217;aurait pas lieu d&#8217;&#234;tre dans le mo-
dule de compr&#233;hension d&#8217;un v&#233;ritable syst&#232;me. Ceci dit, comprendre un &#233;nonc&#233;-syst&#232;me est
beaucoup plus simple que comprendre un &#233;nonc&#233;-utilisateur puisque les formes linguistiques
utilis&#233;es sont connues et st&#233;r&#233;otyp&#233;es. Mais tout aussi consciencieux et appliqu&#233;s que soient
les comp&#232;res qui simulent un syst&#232;me dans un corpus &#233;labor&#233; par la technique du Magicien
d&#8217;Oz, ils ne peuvent pas simuler parfaitement un v&#233;ritable syst&#232;me. Les expressions qu&#8217;ils
utilisent ne sont pas enti&#232;rement st&#233;r&#233;otyp&#233;es et laissent place &#224; une assez large variabilit&#233;.
Par ailleurs, il leur arrive &#233;galement de se tromper, c&#8217;est &#224; dire, en l&#8217;occurrence, de proposer
des r&#233;ponses non conformes &#224; celles que pourrait proposer le syst&#232;me.
</p>
<p>&#8211; On peut &#233;galement discuter le bien-fond&#233; du choix fait dans MEDIA d&#8217;avoir utilis&#233; un corpus
dont la retranscription &#171; gomme &#187; les erreurs dues &#224; la reconnaissance de la parole car on
sait qu&#8217;il s&#8217;agit l&#224; d&#8217;une des plus grandes difficult&#233;s rencontr&#233;es par les syst&#232;mes de compr&#233;-
hension de la langue orale. On peut aussi d&#233;fendre la position selon laquelle les probl&#232;mes
trait&#233;s sont suffisamment complexes pour m&#233;riter d&#8217;&#234;tre clairement s&#233;par&#233;s.
</p>
<p>L&#8217;utilisation du corpus MEDIA pour tester le syst&#232;me LOGUS pr&#233;sente un autre type d&#8217;inconv&#233;-
nients, li&#233;s &#224; la nature m&#234;me du syst&#232;me test&#233;.
&#8211; La r&#233;solution des r&#233;f&#233;rences faite dans MEDIA ne correspond pas vraiment &#224; l&#8217;approche de
</p>
<p>la compr&#233;hension en contexte envisag&#233;e pour LOGUS. Dans MEDIA, la r&#233;solution des r&#233;f&#233;-
rences est enti&#232;rement bas&#233;e sur l&#8217;existence d&#8217;indices linguistiques ; par exemple, l&#8217;expres-
sion &#171; est-ce qu&#8217;ils acceptent les chiens &#187; demande la r&#233;solution d&#8217;une r&#233;f&#233;rence &#224; cause
du pronom ils alors que la question pos&#233;e sous la forme &#171; est-ce que les chiens sont ac-
cept&#233;s &#187; n&#8217;est pas r&#233;f&#233;rentielle. Dans l&#8217;approche LOGUS, les deux expressions appellent
une r&#233;solution identique. L&#8217;acceptation des animaux est une propri&#233;t&#233; relative &#224; un h&#244;tel :
la compr&#233;hension en contexte demande que soit recherch&#233; le (ou les) h&#244;tels &#233;ventuellement
concern&#233;(s) par cette interrogation. Tester les principes de la compr&#233;hension en contexte de
LOGUS &#224; partir du corpus MEDIA a donc demand&#233; que soient mis de c&#244;t&#233; certains des prin-
cipes fondamentaux de la compr&#233;hension contextuelle.
</p>
<p>&#8211; Enfin, comme il a &#233;t&#233; dit pr&#233;c&#233;demment, le syst&#232;me LOGUS a &#233;t&#233; con&#231;u pour essayer d&#8217;&#233;largir
les domaines potentiels de la compr&#233;hension en dialogue homme-machine. Un domaine tel
que la r&#233;servation h&#244;teli&#232;re reste trop &#233;troit pour valider compl&#232;tement l&#8217;approche utilis&#233;e. La
repr&#233;sentation s&#233;mantique des &#233;nonc&#233;s choisie par les partenaires MEDIA en triplets (mode,
attribut, valeur) reste pertinente pour une telle application et les formules logiques construites
par LOGUS peuvent appara&#238;tre comme inutilement complexes.
</p>
<p>En m&#234;me temps et malgr&#233; les r&#233;serves pr&#233;c&#233;dentes, le corpus MEDIA est compos&#233; de v&#233;ritables
dialogues dans lesquels, malgr&#233; leur relative simplicit&#233;, on retrouve la plupart des probl&#232;mes
classiques li&#233;s &#224; la r&#233;solution des r&#233;f&#233;rences. L&#8217;annotation des r&#233;f&#233;rences en fait un corpus de
langue fran&#231;aise parl&#233;e tr&#232;s int&#233;ressant pour la mise au point de syst&#232;mes de compr&#233;hension
dans le domaine du DOHM.
</p>
<p>Les r&#233;sultats obtenus par LOGUS au cours de cette exp&#233;rience sont encourageants : ils semblent
en effet prouver que la notion de cha&#238;nes d&#8217;objets utilis&#233;e pour la repr&#233;sentation s&#233;mantique est
un point de d&#233;part solide pour la r&#233;solution des r&#233;f&#233;rences et la compr&#233;hension en contexte.
</p>
<p>301</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jeanne VILLANEAU
</p>
<p>Remerciements
</p>
<p>Merci &#224; tous les membres du consortium MEDIA pour toutes les discussions que nous avons pu
avoir et sans lesquelles ce travail n&#8217;aurait pas &#233;t&#233; possible.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BONNEAU-MAYNARD H., AYACHE C., BECHET F., A. A. D., KHUN A., LEFEVRE F.,
MOSTEFA D., QUIGNARD M., ROSSET S., SERVAN C. &amp; VILLANEAU J. (2006). Results of
the french evalda-media evaluation campaign for literal understanding. In the 5th International
Conference on Language Resources and Evaluation (LREC 2006), p. 2054&#8211;2059, Genoa, Italy.
</p>
<p>BOUDREAU S. &amp; KITTREDGE R. (2005). R&#233;solution des anaphores et d&#233;termination des
cha&#238;nes de cor&#233;f&#233;rences. Traitement Automatique des Langues (TAL), 46(1), 41&#8211;69.
</p>
<p>BOYD A., GEGG-HARRISON W. &amp; BYRON D. (2005). Identifying non-referential it : a
machine learning approach incorporating linguistically motivated patterns. Traitement Auto-
matique des Langues (TAL), 46(1), 71&#8211;90.
</p>
<p>DEVILLERS L., BONNEAU-MAYNARD H., ROSSET S., PAROUBEK P., MOSTEFA D.,
CHOUKRI K., CHARNAY L., BOUSQUET C., VIGOUROUX N., BECHET F., ROMARY L.,
ANTOINE J.-Y., VILLANEAU J., VERGNES M. &amp; GOULIAN J. (2004). The french evalda-
media project : the evaluation of the understanding capabilities of spoken language dialogue
systems. In the 4th International Conference on Language Resources and Evaluation (LREC
2004), p. 2131&#8211;2134, Lisboa, Portugal.
</p>
<p>GARDENT C. &amp; MANUELIAN H. (2005). Cr&#233;ation d&#8217;un corpus annot&#233; pour le traitement des
descriptions d&#233;finies. Traitement Automatique des Langues (TAL), 46(1), 115&#8211;139.
</p>
<p>SOWA J. (2001). Conceptuals Graphs. http ://users.bestweb.net/ sowa/cg/cgstand.htm.
</p>
<p>VAN NOORD G., BOUMA G., KOELING R. &amp; NEDERHOF M. (1999). Robust grammatical
analysis for spoken dialogue systems. Natural Language Engineering., 5(1), 45&#8211;93.
</p>
<p>VANDERVEKEN D. (2001). Universal Grammar and Speech Act Theory. In D. VANDER-
VEKEN &amp; S. KUBO, Eds., Essays in Speech Act Theory, chapter 2, p. 25&#8211;62. Amsterdam,
Philadelphia : John Benjamin.
</p>
<p>VILLANEAU J. (2003). Contribution au traitement syntaxico-pragmatique de la langue natu-
relle parl&#233;e : approche logique pour la compr&#233;hension de la parole. PhD thesis, Universit&#233; de
Bretagne Sud, Vannes, France.
</p>
<p>VILLANEAU J. &amp; ANTOINE J.-Y. (2004). Categorials grammars used to partial parsing of
spoken language. In Actes de CG2004, p. 244&#8211;258, Montpellier, France.
</p>
<p>VILLANEAU J., RIDOUX O. &amp; ANTOINE J.-Y. (2004). LOGUS : compr&#233;hension de l&#8217;oral
spontan&#233;. Revue d&#8217;intelligence artificielle, 18(5&#8211;6), 709&#8211;742.
</p>
<p>302</p>

</div></div>
</body></html>