<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D-STAG : un formalisme pour le discours bas&#233; sur les TAG synchrones</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>D-STAG : un formalisme pour le discours bas&#233;
sur les TAG synchrones
</p>
<p>Laurence DANLOS
LATTICE &#8211; Universit&#233; Paris 7
Institut Universitaire de France
</p>
<p>Laurence.Danlos@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. Nous proposons D-STAG, un formalisme pour le discours qui utilise les TAG
synchrones. Les analyses s&#233;mantiques produites par D-STAG sont des structures de discours
hi&#233;rarchiques annot&#233;es de relations de discours coordonnantes ou subordonnantes. Elles sont
compatibles avec les structures de discours produites tant en RST qu&#8217;en SDRT. Les relations de
discours coordonnantes et subordonnantes sont mod&#233;lis&#233;es respectivement par les op&#233;rations de
substitution et d&#8217;adjonction introduites en TAG.
</p>
<p>Abstract. We propose D-STAG, a framework which uses Synchronous TAG for discourse.
D-STAG semantic analyses are hierarchical discourse structures richly annotated with coordi-
nating and subordinating discourse relations. They are compatible both with RST and SDRT
discourse structures. Coordinating and subordinating relations are respectively modeled with
the TAG substitution and adjunction operations.
</p>
<p>Mots-cl&#233;s : discours, grammaires d&#8217;arbres adjoints (synchrones), interface syntaxe/s&#233;-
mantique.
</p>
<p>Keywords: discourse, (synchronous) tree adjoining grammars, syntax/semantic inter-
face.
</p>
<p>1 Introduction
</p>
<p>RST - Rhetorical Structure Theory (Mann &amp; Thompson, 1988; Taboada &amp; Mann, 2006) - et
SDRT - Segmented Discourse Representation Theory (Asher, 1993; Asher &amp; Lascarides, 2003)
- sont deux th&#233;ories pour le discours qui reposent sur la notion de relation de discours. Ces
th&#233;ories partagent l&#8217;id&#233;e que certaines parties d&#8217;un discours, appel&#233;es Satellites, jouent un r&#244;le
&#171; subordonn&#233; &#187; (&#171; moins important &#187;) que d&#8217;autres parties, appel&#233;es Nucleus. Cette asym&#233;trie
est comparable &#224; la distinction faite au niveau syntaxique entre les arguments (nuclei) et les
adjoints (satellites) d&#8217;une phrase. Elle am&#232;ne &#224; poser l&#8217;existence de deux types de relations de
discours : une relation coordonnante (multi-nucl&#233;aire) relie deux Nuclei, tandis qu&#8217;une relation
subordonnante (nucleus-satellite) relie un Nucleus et un Satellite. Elle permet la construction
de structures de discours hi&#233;rarchiques annot&#233;es de relations coordonnantes ou subordonnantes.
</p>
<p>Nous proposons ici un nouveau formalisme pour le discours, D-STAG (Discourse Synchronous
TAG), qui utilise aussi les relations de discours coordonnantes et subordonnantes et qui repose
</p>
<p>389</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS
</p>
<p>sur STAG - Synchronous TAG (Shieber, 1994; Shieber &amp; Schabes, 1990). STAG a &#233;t&#233; utilis&#233;
avec succ&#232;s dans une grammaire anglaise qui permet d&#8217;engendrer simultan&#233;ment les analyses
syntaxique et s&#233;mantique d&#8217;une phrase (Nesson &amp; Shieber, 2006). Dans le prolongement de
cette id&#233;e, une grammaire D-STAG pour le fran&#231;ais ou l&#8217;anglais permet d&#8217;engendrer simultan&#233;-
ment les analyses syntaxique et s&#233;mantique d&#8217;un discours fran&#231;ais ou anglais donn&#233; en entr&#233;e.
Les analyses s&#233;mantiques des discours sont des structures hi&#233;rarchiques annot&#233;es par des re-
lations coordonnantes ou subordonnantes. Elles peuvent &#234;tre converties de fa&#231;on d&#233;terministe
en structures RST ou SDRT. Par cons&#233;quent, D-STAG peut b&#233;n&#233;ficier des r&#233;sultats apport&#233;s par
ces th&#233;ories du discours, par exemple, D-STAG peut b&#233;n&#233;ficier de la Contrainte de la Fronti&#232;re
Droite (Section 2.2), qui simplifie grandement le calcul des structures de discours.
</p>
<p>En D-STAG, les relations de discours coordonnantes et subordonnantes sont mod&#233;lis&#233;es res-
pectivement par les op&#233;rations de substitution et d&#8217;adjonction introduites en TAG- Tree Adjoi-
ning Grammar (Joshi, 1985). En TAG, les arbres initiaux introduisent les d&#233;pendances pr&#233;dicat-
arguments par substitution, tandis que les arbres auxiliaires introduisent la r&#233;cursivit&#233; et per-
mettent la modification d&#8217;arbres &#233;l&#233;mentaires gr&#226;ce &#224; l&#8217;op&#233;ration d&#8217;adjonction. D-STAG suit ces
principes de base de TAG ; plus pr&#233;cis&#233;ment, les relations coordonnantes ancrent des arbres
initiaux qui introduisent leurs arguments (deux Nuclei) par substitution, tandis que les relations
subordonnantes ancrent des arbres auxiliaires : le Satellite d&#8217;une relation subordonnante modifie
son Nucleus par l&#8217;adjonction d&#8217;un arbre auxiliaire ancr&#233; par la relation subordonnante.
</p>
<p>Une grammaire D-STAG est une extension naturelle d&#8217;une grammaire STAG r&#233;alisant une inter-
face syntaxe/s&#233;mantique pour les phrases. Dans cette perspective, le m&#234;me analyseur peut &#234;tre
utilis&#233; tant pour les phrases que pour les discours, et les formes logiques des discours peuvent
&#234;tre calcul&#233;es de fa&#231;on d&#233;terministe &#224; partir des analyses s&#233;mantiques calcul&#233;es en D-STAG en
employant les formes logiques des phrases (qui sont calcul&#233;es de fa&#231;on d&#233;terministe &#224; partir de
leurs analyses s&#233;mantiques produites par la grammaire STAG).
</p>
<p>D-STAG ressemble &#224; D-LTAG - Discourse Lexicalized TAG dans la version pr&#233;sent&#233;e dans
(Forbes-Riley et al., 2006) - dans la mesure o&#249; les deux formalismes &#233;tendent une interface
syntaxe/s&#233;man-tique phrastique au niveau du discours. Cependant, il existe une diff&#233;rence cru-
ciale : D-LTAG n&#8217;utilise pas les relations de discours et ignore la distinction entre relations
coordonnantes et subordonnantes. Par cons&#233;quent, D-LTAG n&#8217;a rien de commun avec RST ou
SDRT.
</p>
<p>Cet article est organis&#233; de la fa&#231;on suivante : la Section 2 introduit bri&#232;vement RST et SDRT,
la Section 3 STAG. La Section 4 expose les principes de D-STAG. La Section 5 compare D-
LTAG et D-STAG. Le m&#234;me exemple de r&#233;f&#233;rence est utilis&#233; dans toutes les sections, &#224; savoir
(1) qui est de la forme P1 parce que P2. Ensuite, P3., dans lequel parce que exprime la relation
subordonnante Explication et ensuite la relation cordonnante Narration.
</p>
<p>(1) Jean est all&#233; au super-march&#233; parce que son frigo &#233;tait vide. Ensuite, il est all&#233; au cin&#233;ma.
</p>
<p>2 Br&#232;ve introduction &#224; RST et SDRT
</p>
<p>RST et SDRT reposent sur la notion de relation de discours et emploient grosso modo le m&#234;me
ensemble de relations de discours1. Des d&#233;bats ont lieu sur la distinction Nucleus/Satellite de
</p>
<p>1Il arrive qu&#8217;une relation de discours donn&#233;e soit nomm&#233;e de deux fa&#231;ons diff&#233;rentes. Par exemple, S&#233;quence
en RST est appel&#233;e Narration en SDRT.
</p>
<p>390</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D-STAG
</p>
<p>RST (Stede, 2007) et sur la distinction cordonnante/subordonnante de SDRT (Asher &amp; Vieu,
2005). Cependant, on suppose ici que le statut d&#8217;une relation de discours (coordonnante versus
subordonnante) est clair et identique en RST et SDRT2. RST et SDRT proposent des structures de
discours graphiquement diff&#233;rentes, comme montr&#233; dans les deux sections suivantes.
</p>
<p>2.1 Structures de discours en RST
</p>
<p>RST est une th&#233;orie qui a &#233;t&#233; con&#231;ue il y a une vingtaine d&#8217;ann&#233;es et qui a &#233;t&#233; beaucoup em-
ploy&#233;e. De ce fait, il existe diff&#233;rentes interpr&#233;tations de RST (Taboada &amp; Mann, 2006). Dans
cet article, nous ne parlerons que de l&#8217;interpr&#233;tation de Marcu, qui a eu un fort impact en analyse
de discours (Marcu, 2000) et annotation de discours (Carlson et al., 2003).
</p>
<p>Pour un discours donn&#233;, RST calcule une structure d&#8217;arbre qui connecte r&#233;cursivement les uni-
t&#233;s minimales (les clauses) et les segments de texte plus larges ainsi construits ; une relation
de discours ne peut relier que des segments de texte adjacents. L&#8217;arbre RST pour (1), dans la
repr&#233;sentation graphique de Marcu (2000), est donn&#233; dans la Figure 1(a). Le symbole Ci repr&#233;-
sente la phrase Pi, son analyse syntaxique ou son analyse s&#233;mantique (selon l&#8217;application dans
laquelle RST est employ&#233;e). Les &#233;tiquettes N et S sur les arcs abr&#232;gent respectivement Nucleus
et Satellite.
</p>
<p>Marcu (2000) a propos&#233; un principe, appel&#233; &#171; Principe de Nucl&#233;arit&#233; &#187; (ou &#171; Principe compo-
sitionnel &#187;) qui s&#8217;&#233;nonce comme suit : quand une relation de discours relie deux segments de
discours, alors elle relie aussi les Nuclei de ces deux segments. Le Principe de Nucl&#233;arit&#233; donne
l&#8217;interpr&#233;tation en termes de pr&#233;dicats et arguments &#224; un arbre RST. Par exemple, il indique que
C1 est l&#8217;argument gauche de Narration dans l&#8217;arbre pour (1) donn&#233; dans la Figure 1(a).
</p>
<p>C1
</p>
<p>Narration
</p>
<p>Explication C3
</p>
<p>N N
</p>
<p>N S
</p>
<p>C2
</p>
<p>Narration
!1 !3
</p>
<p>Explication
</p>
<p>!'
</p>
<p>!2
(a) (b)
</p>
<p>FIG. 1 &#8211; Arbre RST (a) et graphe SDRT (b) pour le discours (1)
</p>
<p>2.2 Structures de discours en SDRT
</p>
<p>&#192; l&#8217;origine, SDRT a &#233;t&#233; con&#231;ue comme une extension de la DRT - Discourse Represen-
tation Theory (Kamp &amp; Reyle, 1993) - pour rendre compte des propri&#233;t&#233;s sp&#233;cifiques du
discours. Toutefois, cette th&#233;orie s&#8217;est inspir&#233;e de RST, par exemple, la distinction coor-
donnante/subordonnante faite en SDRT est inspir&#233;e de la distinction multi-nucl&#233;aire/nucleus-
satellite faite en RST.
</p>
<p>Les structures de discours en SDRT sont repr&#233;sent&#233;es comme des graphes dirig&#233;s con&#231;us avec les
principes suivants. Pour un discours compos&#233; de deux phrases (clauses) li&#233;es par une relation
</p>
<p>2Ceci est le cas la plupart du temps, except&#233; pour R&#233;sultat qui est subordonnante en RST et coordonnante en
SDRT, bien que (Asher &amp; Vieu, 2005) postulent que R&#233;sultat est coordonnante &#8216;par d&#233;faut&#8217;.
</p>
<p>391</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS
</p>
<p>de discours R, les n&#339;uds du graphe sont les &#233;tiquettes pi1 et pi2 des DRS donnant les formes
logiques des phrases. Ils sont li&#233;s par une fl&#232;che qui est &#233;tiquet&#233;e par la relation R. La fl&#232;che
est horizontale si R est coordonnante, verticale si R est subordonnante (Asher &amp; Vieu, 2005).
Si l&#8217;on prend en compte la distinction Nucleus/Satellite, ceci signifie qu&#8217;une fl&#232;che horizontale
relie deux Nuclei, tandis qu&#8217;une fl&#232;che verticale descend d&#8217;un Nucleus vers un Satellite. En plus
des n&#339;uds repr&#233;sentant les phrases (not&#233;s pii et appel&#233;s &#171; n&#339;uds de phrase &#187;), les graphes SDRT
peuvent comporter des &#171; n&#339;uds de port&#233;e &#187; (not&#233;s pi&#8242;, pi &gt;&gt;, . . .). Un n&#339;ud de port&#233;e est li&#233;
par des lignes &#224; des n&#339;uds de phrase. Pour (1), le graphe SDRT est donn&#233; dans la Figure 1(b).
</p>
<p>Lors de la proc&#233;dure de construction des structures de discours, SDRT fait appel &#224; la notion
de fronti&#232;re droite, propos&#233;e &#224; l&#8217;origine par (Polanyi, 1988). Informellement, dans le graphe
SDRT pour un discours comportant n phrases (clauses), la fronti&#232;re droite contient le n&#339;ud
pin repr&#233;sentant la derni&#232;re phrase et les autres n&#339;uds de phrase situ&#233;s sur la fronti&#232;re droite
du graphe3. A titre d&#8217;illustration, la fronti&#232;re droite dans le graphe de la Figure 1(b) contient
seulement le n&#339;ud pi3. Lors de la construction dynamique d&#8217;un graphe SDRT, les n&#339;uds de
la fronti&#232;re droite sont les seuls n&#339;uds qui permettent d&#8217;accrocher une information nouvelle ;
ceci est connu sous le nom de &#171; Contrainte de la Fronti&#232;re Droite &#187;4. Cette contrainte simplifie
grandement la construction des structures de discours, et par l&#224;-m&#234;me le calcul des formes
logiques des discours, qui sont obtenues de fa&#231;on d&#233;terministe &#224; partir des structures de discours.
</p>
<p>3 Introduction aux TAG synchrones
</p>
<p>Les parties entre guillemets de cette section sont traduites de (Nesson &amp; Shieber, 2006). Les
op&#233;rations de substitution et adjonction introduites en TAG pour la syntaxe sont rappel&#233;es dans
le Figure 2.
</p>
<p>S
</p>
<p>NP! VP
</p>
<p>V
</p>
<p>likes
</p>
<p>NP!
</p>
<p>S
</p>
<p>NP VP
</p>
<p>V
</p>
<p>likes
</p>
<p>NP!John
&#1;NP
</p>
<p>John
</p>
<p>S
</p>
<p>NP! VP
</p>
<p>V
</p>
<p>likes
</p>
<p>NP!
</p>
<p>&#1;
</p>
<p>S
</p>
<p>NP!
</p>
<p>VP
</p>
<p>V
</p>
<p>likes
</p>
<p>NP!
</p>
<p>VP
</p>
<p>Adv
</p>
<p>apparently
</p>
<p>VP
</p>
<p>Adv VP
*
</p>
<p>apparently
(a) (b)
</p>
<p>FIG. 2 &#8211; Exemples des op&#233;rations de substitution (a) et d&#8217;adjonction (b) en TAG
</p>
<p>&#171; Les TAG synchrones (STAG) prolongent les TAG en consid&#233;rant les structures &#233;l&#233;mentaires
comme des paires d&#8217;arbres TAG avec des liens entre certains n&#339;uds de ces arbres. Une STAG
est un ensemble de triplets &#12296;tL, tR,&quot;&#12297; o&#249; tL et tR sont des arbres &#233;l&#233;mentaires TAG et &quot; est
une relation de liage entre certains n&#339;uds de tL et certains n&#339;uds de tR (Shieber, 1994; Shieber
&amp; Schabes, 1990). La d&#233;rivation se d&#233;roule comme en TAG except&#233; que toutes les op&#233;rations
doivent &#234;tre appari&#233;es. En d&#8217;autres mots, un arbre ne peut &#234;tre substitu&#233; ou adjoint &#224; un n&#339;ud
que si l&#8217;arbre appari&#233; est simultan&#233;ment substitu&#233; ou adjoint au n&#339;ud li&#233;. Nous notons les liens
en utilisant des indices dans des cercles (e.g. !) qui viennent d&#233;corer les n&#339;uds li&#233;s. &#187;
</p>
<p>3En fait, la fronti&#232;re droite contient aussi les &#171; n&#339;uds topiques &#187; situ&#233;s sur la fronti&#232;re droite du graphe. La
notion de n&#339;ud topique est importante en SDRT, mais elle est laiss&#233;e de c&#244;t&#233; dans cet article.
</p>
<p>4Cette contrainte dit aussi que l&#8217;ant&#233;c&#233;dent d&#8217;une expression anaphorique doit &#234;tre sur la fronti&#232;re droite, mais
les expressions anaphoriques ne sont pas discut&#233;es ici.
</p>
<p>392</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D-STAG
</p>
<p>STAG a &#233;t&#233; utilis&#233; avec succ&#232;s dans une interface syntaxe/s&#233;mantique pour l&#8217;anglais qui peut
traiter de phrases complexes soulevant des probl&#232;mes d&#233;licats de port&#233;e (Nesson &amp; Shieber,
2006). Cette interface est illustr&#233;e dans la Figure 3 pour l&#8217;analyse de la phrase (tr&#232;s simple)
John apparently likes Mary.
</p>
<p>NP
</p>
<p>John
</p>
<p>e
</p>
<p>john
</p>
<p>NP
</p>
<p>Mary
</p>
<p>e
</p>
<p>VP
</p>
<p>Adv VP
*
</p>
<p>apparently
</p>
<p>t
</p>
<p>&#12296;t,t&#12297; t
*
</p>
<p>apparently
</p>
<p>S &#9312;
NP!&#2; VP&#1;
</p>
<p>V
</p>
<p>likes
</p>
<p>NP!&#3;
</p>
<p>t &#9312;&#1;&#1;
&#12296;e,t&#12297; e!&#2;
</p>
<p>likes e!&#3;
</p>
<p>(a)
</p>
<p>S
</p>
<p>NP VP
</p>
<p>Adv VP
</p>
<p>V NP
</p>
<p>John apparently likes Mary
</p>
<p>t
</p>
<p>&#12296;t,t&#12297; t
&#12296;e,t&#12297;
</p>
<p>apparently
e
</p>
<p>john
</p>
<p>likes
</p>
<p>e
</p>
<p>mary
</p>
<p>(b)
</p>
<p>mary
</p>
<p>likes
</p>
<p>john
apparently
</p>
<p>mary
</p>
<p>&#2; &#3;
&#1;
</p>
<p>(c)
</p>
<p>FIG. 3 &#8211; Fragment d&#8217;une interface syntaxe/s&#233;mantique pour l&#8217;anglais (a), les paires d&#8217;arbres
d&#233;riv&#233;s (b) et l&#8217;arbre de d&#233;rivation (c) pour la phrase John apparently likes Mary. (Figure repro-
duite &#224; partir de (Nesson et Shieber, 2006))
</p>
<p>Dans l&#8217;arbre de d&#233;rivation, &#171; les op&#233;rations de substitution sont not&#233;es avec une ligne continue,
celles d&#8217;adjonction avec une ligne en pointill&#233;s. Il faut noter que chaque lien de l&#8217;arbre de
d&#233;rivation sp&#233;cifie un num&#233;ro de liage dans la paire d&#8217;arbres &#233;l&#233;mentaires. Ces liens donnent
l&#8217;adresse des op&#233;rations dans l&#8217;arbre syntaxique et dans l&#8217;arbre s&#233;mantique. Ces op&#233;rations
doivent op&#233;rer &#224; des n&#339;uds li&#233;s dans la paire d&#8217;arbres &#233;l&#233;mentaires concern&#233;e. &#187;
</p>
<p>Les arbres d&#233;riv&#233;s s&#233;mantiques permettent de calculer de fa&#231;on d&#233;terministe les formes logiques
des phrases, par exemple la forme apparently(likes(john,mary)) &#224; partir de l&#8217;arbre d&#233;riv&#233;
s&#233;mantique de la phrase John apparently likes Mary.
</p>
<p>4 Pr&#233;sentation de D-STAG
</p>
<p>D-STAG utilise STAG pour le discours, une grammaire D-STAG &#233;tant une extension naturelle
d&#8217;une grammaire STAG r&#233;alisant une interface syntaxe/s&#233;mantique au niveau phrastique. Une
paire d&#8217;arbres &#233;l&#233;mentaires en D-STAG consiste en un arbre &#233;l&#233;mentaire ancr&#233; par un connecteur
de discours et comportant deux n&#339;uds non terminaux5 appari&#233; avec un arbre &#233;l&#233;mentaire ancr&#233;
par la relation de discours exprim&#233;e par le connecteur et comportant deux n&#339;uds non terminaux.
Pour une relation de discours coordonnante, l&#8217;arbre &#233;l&#233;mentaire est un arbre initial comportant
deux n&#339;uds &#224; substitution correspondant aux deux Nuclei. Pour une relation subordonnante R,
il existe deux arbres &#233;l&#233;mentaires associ&#233;s aux positions du Satellite vis-&#224;-vis du Nucleus ; la
notation Rr (resp. Rl) signifie que le Satellite appara&#238;t &#224; la droite (resp. gauche) du Nucleus.
</p>
<p>5L&#8217;arbre D-STAG d&#8217;un connecteur n&#8217;est pas forc&#233;ment similaire &#224; son arbre syntaxique. De ce fait, un analyseur
D-STAG doit inclure un module d&#8217;extraction d&#8217;arbres et un module de correspondance entre arbres syntaxiques et
arbres discursifs, comme c&#8217;est le cas dans l&#8217;analyseur pour D-LTAG d&#233;crit dans (Webber, 2004).
</p>
<p>393</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS
</p>
<p>Ces arbres &#233;l&#233;mentaires sont des arbres auxiliaires dont le n&#339;ud pied correspond au Nucleus et
qui comportent un n&#339;ud &#224; substitution correspondant au Satellite.
</p>
<p>La Figure 4 contient quatre paires d&#8217;arbres : la premi&#232;re, nomm&#233;e &#945;ensuite-Narration6 apparie
l&#8217;arbre initial pour ensuite avec l&#8217;arbre initial pour Narration exprim&#233;e par ensuite. Les deux sui-
vantes, nomm&#233;es &#946;parce&#8722;que-ExplicationR et &#946;parce&#8722;que-ExplicationL, apparient les arbres
auxiliaires pour parce que avec ceux pour la relation subordonnante Explication exprim&#233;e par
parce que7. La derni&#232;re paire d&#8217;arbres, nomm&#233;e &#945;P-to-D, est sp&#233;ciale : elle est con&#231;ue pour
immerger dans une grammaire D-STAG les analyses syntaxique et s&#233;mantique d&#8217;une phrase en-
gendr&#233;es par une grammaire STAG. Expliquons les symboles non terminaux figurant dans ces
paires d&#8217;arbres. Les symboles DC et DR sont respectivement utilis&#233;s pour les connecteurs de
discours (&#171; discourse connectives &#187;) et les relations de discours (&#171; discourse relations &#187;) ; les
n&#339;uds &#233;tiquet&#233;s DC ou DR sont li&#233;s par l&#8217;indice ! dont l&#8217;emploi sera illustr&#233; pour le discours
(2) ci-dessous. Les symboles DU et AO sont respectivement utilis&#233;s pour les unit&#233;s de discours
(&#171; discourse units &#187;) et les objets abstraits (&#171; abstract objects &#187;, (Asher, 1993)). Une unit&#233; de
discours peut &#234;tre simple ou complexe. Une unit&#233; de discours simple est l&#8217;analyse syntaxique
d&#8217;une phrase &#171; simple &#187; (i.e. une phrase ne comportant pas de connecteur de discours), soit
un arbre de racine P qui est introduit au niveau discursif par &#945;P-to-D. Une unit&#233; de discours
complexe est r&#233;cursivement l&#8217;analyse syntaxique d&#8217;une phrase complexe (comportant un ou
plusieurs connecteurs) ou d&#8217;un texte de plusieurs phrases. Parall&#232;lement, les objets abstraits
simples ou complexes sont des analyses s&#233;mantiques ; un objet abstrait simple est un arbre de
racine t qui est introduit au niveau discursif par &#945;P-to-D. Signalons que l&#8217;&#233;tiquetage par N (Nu-
cleus) ou S (Satellite) des arcs pointant sur les n&#339;uds AO dans les arbres &#233;l&#233;mentaires ancr&#233;s
par une relation de discours est une information qui est juste destin&#233;e &#224; la conversion d&#8217;une
analyse s&#233;mantique de D-STAG en un arbre RST (voir Figure 6(a) ci-dessous).
</p>
<p>DU
</p>
<p>DU*
</p>
<p>DC&#9314;
</p>
<p>parce-que
</p>
<p>DU!&#1;
</p>
<p>AO
</p>
<p>AO*
</p>
<p>DR&#9314;
</p>
<p>ExplicationR
</p>
<p>AO!&#1;
</p>
<p>N S
</p>
<p>&#2;parce_que-ExplicationR
</p>
<p>DU
</p>
<p>DU!&#1;
</p>
<p>parce-que
</p>
<p>DU*
</p>
<p>AO
</p>
<p>AO!&#1;
</p>
<p>DR&#9314;
</p>
<p>ExplicationL
</p>
<p>AO*
</p>
<p>S N
</p>
<p>&#2;parce_que-ExplicationL
</p>
<p>DC&#9314; DU&#2; AO&#2;
</p>
<p>P!&#1; t!&#1;
</p>
<p>&#1;P-to-D
</p>
<p>AO
</p>
<p>AO!&#1;
</p>
<p>DR&#9314;
</p>
<p>Narration
</p>
<p>AO!&#2;
</p>
<p>N N
</p>
<p>&#1;ensuite-Narration
</p>
<p>DU
</p>
<p>DU!&#1;
</p>
<p>ensuite
</p>
<p>DU!&#2;
</p>
<p>DC&#9314;
</p>
<p>FIG. 4 &#8211; Fragment d&#8217;une grammaire D-STAG pour le fran&#231;ais
</p>
<p>Montrons maintenant comment les paires d&#8217;arbres de la Figure 4 sont utilis&#233;es pour analyser
le discours (1). La Figure 5 contient les paires d&#8217;arbres d&#233;riv&#233;s (a)-(b) pour (1), et l&#8217;arbre de
</p>
<p>6Une paire d&#8217;arbres &#233;l&#233;mentaires en D-STAG est nomm&#233;e avec les conventions suivantes : le pr&#233;fixe &#945; ou &#946; in-
dique si les arbres appari&#233;s sont initiaux (&#945;) ou auxiliaires (&#946;) ; le nom concat&#232;ne les ancres des arbres &#233;l&#233;mentaires,
i.e un connecteur de discours et une relation de discours.
</p>
<p>7Dans les phrases de forme P1 parce que P2. ou Parce que P1, P2., les n&#339;uds pied proviennent structurellement
des phrases principales, les n&#339;uds &#224; substitution des phrases subordonn&#233;es. N&#233;anmoins, dans les phrases de forme
P1 Conj P2 parce que S3., dans lesquelles Conj d&#233;signe une autre conjonction de subordination, le n&#339;ud pied de
parce que n&#8217;est pas structurellement d&#233;fini : il provient de P1, de P2 ou de P1 Conj P2 (Danlos, 2004).
</p>
<p>394</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D-STAG
</p>
<p>d&#233;rivation (c). En supposant que les analyses syntaxique et s&#233;mantique d&#8217;une phrase simple
sont engendr&#233;es simultan&#233;ment par une grammaire STAG, le symbole Ti repr&#233;sente l&#8217;analyse
syntaxique de la phrase Pi (un arbre de racine P ), Fi son analyse s&#233;mantique (un arbre de
racine t), &#964;i son arbre de d&#233;rivation. Nous emploierons les termes suivants : dans la Figure 5,
(a) est l&#8217;analyse syntaxique discursive de (1), (b) son analyse s&#233;mantique discursive, (c) son
analyse s&#233;mantique compositionnelle.
</p>
<p>DU
</p>
<p>DU DC
</p>
<p>ensuite T3
</p>
<p>DU DUDC
</p>
<p>parce-que T2T1
</p>
<p>AO
</p>
<p>AO DR
</p>
<p>Narration F3
</p>
<p>N N
</p>
<p>AO AODR
</p>
<p>ExplicationR F2F1
</p>
<p>N S
</p>
<p>(a) (b)
</p>
<p>&#1;ensuite-Narration
</p>
<p>&#2;parce_que-ExplicationR
</p>
<p>!3
</p>
<p>!1
</p>
<p>!2
</p>
<p>&#1;
</p>
<p>&#2;
</p>
<p>(c)
</p>
<p>&#2;
&#1;P-to-D
</p>
<p>&#1;P-to-D
</p>
<p>&#1;P-to-D
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>DU AO
&#1;
</p>
<p>&#1;
</p>
<p>FIG. 5 &#8211; Paire d&#8217;arbres d&#233;riv&#233;s (a)-(b) et arbre de d&#233;rivation (c) calcul&#233;s en D-STAG pour (1)
</p>
<p>Nous allons maintenant montrer comment les analyses de D-STAG se convertissent en structures
de discours RST ou SDRT. Les analyses s&#233;mantiques discursives de D-STAG sont convertibles
de fa&#231;on d&#233;terministe en arbres RST, par exemple l&#8217;analyse (b) de (1) est convertible en l&#8217;arbre
RST pour (1) - Figure 1(a) - en appliquant r&#233;cursivement le patron donn&#233; dans la Figure 6(a).
Les symboles l1 ou l2 sur les arcs ont pour valeur N (Nucleus) ou S (Satellite)8. La conversion
d&#8217;analyses s&#233;mantiques de D-STAG en arbres RST s&#8217;explique en reconsid&#233;rant le Principe de
Nucl&#233;arit&#233; (Section 2.1) &#224; la lumi&#232;re de l&#8217;op&#233;ration d&#8217;adjonction. Par exemple, dire que C1 est
l&#8217;argument gauche de Narration dans l&#8217;arbre RST de la Figure 1(a) (gr&#226;ce au Principe de Nucl&#233;a-
rit&#233;) revient &#224; dire que le sous-arbre dont la racine est la relation subordonnante Explication est
introduit par adjonction. C&#8217;est la raison pour laquelle nous avons postul&#233; que les relations de
discours subordonnantes ancrent des arbres auxiliaires en D-STAG. Comme la distinction Nu-
cleus/Satellite faite en RST est similaire &#224; la distinction argument/adjoint faite en syntaxe, les
relations subordonnantes sont mod&#233;lis&#233;es par l&#8217;op&#233;ration d&#8217;adjonction, tandis que les relation
coordonnantes sont mod&#233;lis&#233;es par l&#8217;op&#233;ration de substitution (Section 1).
</p>
<p>&#2;DC-DR
</p>
<p>!'2!'1
</p>
<p>&#1; &#2;&#1;
&#1;!'
</p>
<p>!2!1 DR
</p>
<p>&#3;DC-DRR
</p>
<p>!'1
</p>
<p>!'2
</p>
<p>&#2;
</p>
<p>&#9312;
</p>
<p>!1
</p>
<p>!2
</p>
<p>DRR&#1; &#3;DC-DRL
!'2
</p>
<p>!'1
</p>
<p>&#2;
</p>
<p>&#9312;
</p>
<p>!2
</p>
<p>!1
</p>
<p>DRL&#1;
AO
</p>
<p>AO AODR
</p>
<p>R F2F1
</p>
<p>l1 l2
</p>
<p>R
</p>
<p>C2C1
</p>
<p>l1 l2&#1;
(a) (b)
</p>
<p>FIG. 6 &#8211; Patrons de conversion d&#8217;une analyse s&#233;mantique de D-STAG vers un arbre RST (a) et
d&#8217;une analyse compositionnelle de D-STAG vers un graphe SDRT (b)
</p>
<p>Passons aux structures de discours SDRT. Les analyses s&#233;mantiques compositionnelles de D-
STAG sont convertibles de fa&#231;on d&#233;terministe en graphes SDRT, par exemple l&#8217;analyse (c) de (1)
est convertible selon le graphe SDRT pour (1) - Figure 1(b) - en appliquant r&#233;cursivement les
patrons donn&#233;s dans la Figure 6(b). Pour simplifier la lecture de ces patrons, nous avons utilis&#233;
les symboles &#964; &#8242;i qui repr&#233;sentent &#945;P-to-D dans lequel &#964;i est substitu&#233; au lien !.
</p>
<p>8Un constituantCi est soit une phrase, soit son analyse syntaxique, soit son analyse s&#233;mantique (alorsCi = Fi),
selon l&#8217;interpr&#233;tation et l&#8217;utilisation de RST (Section 2.1). Dans tous les cas, Ci peut &#234;tre obtenu &#224; partir de Fi.
</p>
<p>395</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS
</p>
<p>Les analyses s&#233;mantiques compositionnelles de D-STAG conduisent de fa&#231;on d&#233;terministe aux
formes logiques. Par exemple, l&#8217;arbre de d&#233;rivation (c) pour (1) conduit &#224; la forme logique
(simplifi&#233;e) suivante : F1 &#8743; F2 &#8743; F3 &#8743; precede(F1, F3) &#8743; cause(F2, F1). En suivant SDRT, ce
calcul demande simplement d&#8217;interpr&#233;ter Narration(pi1, pi3) en F1 &#8743; F3 &#8743; precede(F1, F3) et
Explication(pi1, pi2) en F1 &#8743; F2 &#8743; cause(F2, F1).
En conclusion, les analyses s&#233;mantiques discursives et compositionnelles de D-STAG sont res-
pectivement convertibles en structures de discours RST et SDRT. Par cons&#233;quent, D-STAG peut
b&#233;n&#233;ficier des r&#233;sultats apport&#233;s par ces th&#233;ories du discours. Par exemple, D-STAG peut profiter
de la Contraint de la Fronti&#232;re Droite (Section 2.2) pour simplifier grandement la construction
des structures de discours et par l&#224;-m&#234;me le calcul des formes logiques de discours.
</p>
<p>De plus, D-STAG peut profiter de l&#8217;op&#233;ration d&#8217;adjonction pour la modification des relations de
discours, un ph&#233;nom&#232;ne qui n&#8217;est pas trait&#233; en RST ou SDRT. Ce ph&#233;nom&#232;ne est illustr&#233; par le
discours (2).
</p>
<p>(2) Tu ne dois pas faire confiance &#224; Jean parce que, par exemple, il ne rend jamais ce qu&#8217;il a emprunt&#233;.
(Exemple traduit de (Webber et al., 2003))
</p>
<p>Comme expliqu&#233; dans (Webber et al., 2003), l&#8217;interpr&#233;tation de (2) est que le non retour par Jean
des objets emprunt&#233;s est un exemple des raisons pour ne pas lui faire confiance. Guid&#233;e par cette
interpr&#233;tation, nous postulons que par exemple dans ce discours est un modifieur de parce que.
De ce fait, nous postulons qu&#8217;en D-STAG cet adverbial ancre un arbre auxiliaire syntaxique dont
la racine est un n&#339;ud &#233;tiquet&#233; DC et qui est appari&#233; avec un arbre auxiliaire s&#233;mantique dont la
racine est &#233;tiquet&#233;e DR et dont l&#8217;ancre est simplement par-ex&#8217;9. La paire d&#8217;arbres ainsi form&#233;e,
appel&#233;e &#946;par-ex, est montr&#233;e dans la Figure 7(a). Lors de l&#8217;analyse de (2), &#946;par-ex s&#8217;adjoint au
lien ! dans &#946;parce&#8722;que-ExplanationR donn&#233; dans la Figure 4. L&#8217;analyse compositionnelle de
(2) est pr&#233;sent&#233;e dans la Figure 7(b).
</p>
<p>DC
</p>
<p>DC* par-exemple
</p>
<p>&#1;par-ex
</p>
<p>DR
</p>
<p>DR* par-ex'
</p>
<p>&#1;parce_que-ExplicationR
</p>
<p>!'2
</p>
<p>&#2;
</p>
<p>!'1
</p>
<p>&#1;
</p>
<p>&#1;par-ex
</p>
<p>&#9314;
</p>
<p>(a) (b)
</p>
<p>FIG. 7 &#8211; Paire &#946;par-ex (a) et analyse compositionnelle de (2) (b)
</p>
<p>La forme logique de (2), e.g. Exemplify(F2,&#955;F.cause(F, F1)) donn&#233;e dans (Forbes-Riley
et al., 2006), est calcul&#233;e simplement &#224; partir de l&#8217;arbre de d&#233;rivation de (2) en interpr&#233;tant
&#946;par-ex selon la forme abstraite Exemplify(?X2,&#955;F.?R(F, ?X1)) dans laquelle les variables
?R, ?X1 et ?X2 prennent leur valeur dans l&#8217;arbre de d&#233;rivation o&#249; &#946;par-ex est adjoint.
</p>
<p>Nous concluons cette pr&#233;sentation de D-STAG par une remarque sur l&#8217;ambigu&#239;t&#233; au niveau dis-
cursif. Il arrive souvent qu&#8217;un connecteur de discours soit s&#233;mantiquement ambigu, i.e. exprime
</p>
<p>9Par contre, en D-LTAG, for example (par exemple) est consid&#233;r&#233; comme un connecteur de discours en (2). En
D-STAG, cet adverbial n&#8217;est un connecteur de discours (exprimant la relation de discours Exemplification) que dans
un discours comme Jean adore le fromage. Par exemple, il adore le brie.
</p>
<p>396</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D-STAG
</p>
<p>plusieurs relations de discours. C&#8217;est le cas entre autres pour le connecteur vide !10 qui exprime
les relations Explicationr, Elaborationr et Narration, entre autres. En D-STAG, un connecteur
ambigu ancre autant d&#8217;arbres &#233;l&#233;mentaires syntaxiques qu&#8217;il a d&#8217;interpr&#233;tations, ce qui conduit
&#224; une paire d&#8217;arbres pour chaque interpr&#233;tation. Le choix de la bonne interpr&#233;tation pour un
connecteur ambigu d&#233;pend de consid&#233;rations (extra)-linguistiques. Par exemple, le discours (3)
doit recevoir les analyses pr&#233;sent&#233;es dans la Figure 8.
</p>
<p>(3) Jean est all&#233; au super-march&#233; parce que son frigo &#233;tait vide. Il a achet&#233; un r&#244;ti et du brie.
</p>
<p>DU
</p>
<p>DU DC
</p>
<p>! T3
</p>
<p>DU DUDC
</p>
<p>parce-que T2T1
</p>
<p>AO
</p>
<p>AO DR
</p>
<p>F3
</p>
<p>N N
</p>
<p>AO AODR
</p>
<p>ExplicationR F2F1
</p>
<p>N S
</p>
<p>(a) (b)
</p>
<p>&#2;parce_que-ExplicationR
</p>
<p>(c)
</p>
<p>&#1;
</p>
<p>!'3
</p>
<p>!'1
</p>
<p>!'2
</p>
<p>DU AO
</p>
<p>&#1;
</p>
<p>ElaborationR
</p>
<p>&#2;&#1;!-ElaborationR
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>FIG. 8 &#8211; Paire d&#8217;arbres d&#233;riv&#233;s (a)-(b) et arbre de d&#233;rivation (c) calcul&#233;s en D-STAG pour (3)
</p>
<p>Le fait que le connecteur vide ! introduisant P3 dans (3) exprime la relation Elaborationr vient
de la connaissance qu&#8217;on va au super-march&#233; pour faire des achats. La prise en compte de consi-
d&#233;rations (extra)-linguistiques demande des techniques comme celles mises en &#339;uvre en SDRT,
qui reposent sur une proc&#233;dure incr&#233;mentale bas&#233;e sur la &#171; glue logique &#187; (Asher &amp; Lascarides,
2003). Une autre solution consiste &#224; faire appel &#224; des m&#233;thodes probabilistes, comme cela est
propos&#233; en D-LTAG en s&#8217;appuyant sur le Penn Discourse TreeBank (Webber, 2004). Ces deux
solutions sont compl&#233;mentaires.
</p>
<p>5 Comparaison entre D-STAG et D-LTAG
</p>
<p>D-STAG ressemble &#224; D-LTAG - dans la version pr&#233;sent&#233;e dans (Forbes-Riley et al., 2006) - dans
la mesure o&#249; ces deux formalismes &#233;tendent une interface syntaxe/s&#233;mantique bas&#233;e sur TAG
au discours. Cependant, il existe une diff&#233;rence cruciale : D-LTAG n&#8217;utilise pas les relations de
discours et ignore la distinction entre relations coordonnantes et subordonnantes. Les formes
logiques des discours sont calcul&#233;es par le m&#234;me proc&#233;d&#233; que celui utilis&#233; pour calculer les
formes logiques des phrases. Ceci donne &#224; D-LTAG une homog&#233;n&#233;it&#233; certaine mais l&#8217;emp&#234;che
de b&#233;n&#233;ficier des r&#233;sultats apport&#233;s par les th&#233;ories sur le discours.
</p>
<p>Il existe une autre diff&#233;rence entre D-STAG et D-LTAG : les analyses syntaxiques des discours
sont diff&#233;rentes car en D-STAG les connecteurs de discours ancrent des arbres &#233;l&#233;mentaires avec
deux arguments, tandis qu&#8217;en D-LTAG ils peuvent ancrer des arbres avec un seul argument (qui
est fourni structurellement, l&#8217;autre &#233;tant fourni anaphoriquement (Webber et al., 2003; Webber,
2004)), e.g. l&#8217;arbre pour ensuite n&#8217;a qu&#8217;un seul argument11.
</p>
<p>10Dans un discours de la forme P1. P2. dans lequel les phrases P1 et P2 ne sont pas li&#233;es par un item lexical
(un connecteur de discours), on suppose que P2 comporte le connecteur vide !, ce qui s&#8217;&#233;crit P1. ! P2. Une fa&#231;on
diff&#233;rente mais &#233;quivalente de voir les choses consiste &#224; consid&#233;rer le point s&#233;parant P1 et P2 comme un connecteur
de discours (Danlos, 1998).
</p>
<p>11A titre d&#8217;illustration, l&#8217;analyse syntaxique de (1) fournie par D-LTAG est donn&#233;e ci-contre ;
</p>
<p>397</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS
</p>
<p>6 Conclusion
</p>
<p>D-STAG est un formalisme qui &#233;tend une interface syntaxe/s&#233;mantique d&#233;velopp&#233;e en STAG au
niveau du discours et qui prend en compte la pragmatique du discours. Une grammaire D-
STAG g&#233;n&#232;re des analyses qui peuvent &#234;tre interpr&#233;t&#233;es comme des structures RST ou SDRT.
Les formes logiques pour les discours sont calcul&#233;es de fa&#231;on d&#233;terministe &#224; partir des analyses
compositionnelles (arbres de d&#233;rivation). Dans (Danlos, 2007), nous montrons comment traiter
en D-STAG des ph&#233;nom&#232;nes complexes de port&#233;e.
</p>
<p>La recherche future concernera les discours dans lesquels un argument d&#8217;une relation de dis-
cours provient d&#8217;un segment de texte discontinu, ce qui arrive avec la relation Attribution quand
un de ses arguments est ench&#226;ss&#233; dans l&#8217;autre (qui est de ce fait discontinu). Nous pensons que
la relation d&#8217;adjonction sera d&#8217;un grand secours pour ces cas. Ceux-ci demanderont d&#8217;entre-
m&#234;ler les grammaires STAG phrastique et discursive, alors qu&#8217;elles ont &#233;t&#233; consid&#233;r&#233;es comme
fonctionnant s&#233;quentiellement (en pipe-line) dans cet article.
</p>
<p>R&#233;f&#233;rences
ASHER N. (1993). Reference to Abstract Objects in Discourse. Dordrecht : Kluwer.
ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation. Cambridge : Cambridge University Press.
ASHER N. &amp; VIEU L. (2005). Subordinating and coordinating discourse relations. Lingua, 115(4), 591&#8211;610.
CARLSON L., MARCU D. &amp; OKUROWSKI M. E. (2003). Building a discourse-tagged corpus in the framework of rhetorical
structure theory. In J. VAN KUPPEVELT &amp; R. SMITH, Eds., Current Directions in Discourse and Dialogue, p. 85&#8211;112. Kluwer
Academic Publishers.
DANLOS L. (1998). G-TAG : un formalisme lexicalis&#233; pour la g&#233;n&#233;ration de textes inspir&#233; de TAG. Revue TAL, 39(2).
DANLOS L. (2004). Sentences with two subordinate clauses : syntactic and semantic analyses, underspecified semantic
representation. In Proceedings of TAG+7, p. 140&#8211;147, Vancouver.
DANLOS L. (2007). Flexible composition in D-STAG. In Proceedings of MTT&#8217;07, Klagenfurt, Austria.
FORBES-RILEY K., WEBBER B. &amp; JOSHI A. (2006). Computing discourse semantics : The predicate-argument semantics
of discourse connectives in D-LTAG. Journal of Semantics, 23(1).
JOSHI A. (1985). Tree-adjoining grammars. In D. DOWTY, L. KARTTUNEN &amp; A. ZWICKY, Eds., Natural language parsing,
p. 206&#8211;250. Cambridge University Press.
KAMP H. &amp; REYLE U. (1993). From Discourse to Logic. Dordrecht : Kluwer Academic Publishers.
MANN W. C. &amp; THOMPSON S. A. (1988). Rhetorical structure theory : Toward a functional theory of text organization.
Text, 8(3), 243&#8211;281.
MARCU D. (2000). The Theory and Practice of Discourse Parsing and Summarization. The MIT Press.
NESSON R. &amp; SHIEBER S. (2006). Simpler TAG semantics through synchronization. In Formal Grammars, Malaga.
POLANYI L. (1988). A formal model of the structure of discourse. Journal of Pragmatics, 12, 601&#8211;638.
SHIEBER S. (1994). Restricting the weak-generative capacity of synchronous tree-adjoining grammars. Computational
Intelligence, 10(4), 371&#8211;385.
SHIEBER S. &amp; SCHABES Y. (1990). Synchronous tree-adjoining grammars. In Proceedings of the 13th International Confe-
rence on Computational Linguistics, volume 3, p. 253&#8211;258, Helsinki.
STEDE M. (2007). RST revisited : Disentangling nuclearity.
TABOADA M. &amp; MANN W. (2006). Rhetorical structure theory : Looking back and moving ahead. Discourse Studies, 8(3),
423&#8211;459.
WEBBER B. (2004). DTAG : extending lexicalized TAG to discourse. Cognitive Science, 28(5), 751&#8211;779.
WEBBER B. L., JOSHI A., STONE M. &amp; KNOTT A. (2003). Anaphora and discourse structure. Computational Linguistics,
29(4), 545&#8211;587.
</p>
<p>elle comporte trois n&#339;uds &#233;tiquet&#233;s DC, un pour parce que, un pour !, et un pour
ensuite. Elle est diff&#233;rente de l&#8217;analyse syntaxique de (1) fournie par D-STAG - Fi-
gure 5(a) - qui ne comporte que deux n&#339;uds &#233;tiquet&#233;s DC.
</p>
<p>DU
</p>
<p>DU DC
</p>
<p>T3
</p>
<p>DU DUDC
</p>
<p>parce-que T2T1
</p>
<p>DU
</p>
<p>DUDC
</p>
<p>ensuite!
</p>
<p>398</p>

</div></div>
</body></html>