<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Les ellipses dans un syst&#232;me de traduction automatique de la parole</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Les ellipses dans un syst&#232;me
de traduction automatique de la parole
</p>
<p>Pierrette BOUILLON1, Manny RAYNER1, 2
</p>
<p>Marianne STARLANDER1, Marianne SANTAHOLMA1
1 University of Geneva, TIM/ISSCO
</p>
<p>40, bvd du Pont-d&#8217;Arve, CH-1211 Geneva 4, Switzerland
2 Powerset Inc, 475 Brannan Street, San Francisco, CA 94107, US
{Pierrette.Bouillon,Emmanuel.Rayner}@issco.unige.ch
</p>
<p>{Marianne.Starlander,Marianne.Santaholma}@eti.unige.ch
</p>
<p>R&#233;sum&#233;. Dans tout dialogue, les phrases elliptiques sont tr&#232;s nombreuses. Dans cet article,
nous &#233;valuons leur impact sur la reconnaissance et la traduction dans le syst&#232;me de traduction
automatique de la parole MedSLT. La r&#233;solution des ellipses y est effectu&#233;e par une m&#233;thode ro-
buste et portable, emprunt&#233;e aux syst&#232;mes de dialogue homme-machine. Cette derni&#232;re exploite
une repr&#233;sentation s&#233;mantique plate et combine des techniques linguistiques (pour construire la
repr&#233;sentation) et bas&#233;es sur les exemples (pour apprendre sur la base d&#8217;un corpus ce qu&#8217;est une
ellipse bien form&#233;e dans un sous-domaine donn&#233; et comment la r&#233;soudre).
</p>
<p>Abstract. Elliptical phrases are frequent in all genres of dialogue. In this paper, we des-
cribe an evaluation of the speech understanding component of the MedSLT medical speech
translation system, which focusses on the contrast between system performance on elliptical
phrases and full utterances. Ellipsis resolution in the system is handled by a robust and portable
method, adapted from similar methods commonly used in spoken dialogue systems, which ex-
ploits the flat representation structures used. The resolution module combines linguistic me-
thods, used to construct the representations, with an example-based approach to defining the
space of well-formed ellipsis resolutions in a subdomain.
</p>
<p>Mots-cl&#233;s : traduction automatique de la parole, reconnaissance de la parole, ellipses,
&#233;valuation, traitement du dialogue, mod&#232;le du language fond&#233; sur les grammaire.
</p>
<p>Keywords: speech recognition, speech translation, ellipsis, dialogue processing, gram-
mar-based language modelling, evaluation.
</p>
<p>1 Introduction
</p>
<p>Dans tout dialogue, les phrases elliptiques sont tr&#232;s nombreuses et il semble important de pou-
voir les traiter correctement (Fernandez &amp; Ginzburg, 2002). Ceci est particuli&#232;rement vrai avec
MedSLT, un syst&#232;me de traduction automatique de la parole dans le domaine m&#233;dical. Celui-
ci traduit des questions de diagnostic pour des patients &#233;trangers, et ceci en anglais, fran&#231;ais,
japonais, espagnol, catalan et arabe (Bouillon et al., 2005). Dans sa version unidirectionnelle
(o&#249; le m&#233;decin pose essentiellement des questions de type oui-non auxquelles le patient r&#233;pond
</p>
<p>53</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierrette BOUILLON, Manny RAYNER, Marianne STARLANDER, Marianne SANTAHOLMA
</p>
<p>de mani&#232;re non verbale), l&#8217;utilisation des ellipses permet en effet au docteur (M) d&#8217;&#233;viter les
r&#233;p&#233;titions et pallie ainsi la n&#233;cessit&#233; de poser des question oui-non (1)1 :
</p>
<p>(1) M : avez-vous mal sur le c&#244;t&#233; droit ?
M : le c&#244;t&#233; gauche ?
M : des deux c&#244;t&#233;s ?
M : avez-vous ces douleurs depuis une semaine ?
M : deux semaines ?
M : plus de deux semaines ?
</p>
<p>Dans la version bidirectionnelle (o&#249; le patient (P) r&#233;pond aux questions du docteur), elle permet
de simplifier la t&#226;che. Si le syst&#232;me n&#8217;accepte que des r&#233;ponses elliptiques, comme en (2), il
devient en effet plus facile de pr&#233;voir les r&#233;ponses du patient (il y moins de variations stylis-
tiques possibles avec des phrases courtes que compl&#232;tes) et de le guider ensuite vers des phrases
couvertes par le syst&#232;me.
</p>
<p>(2) M : do you have a fever ?
P : un poco / mucho / s&#237; treinta y nueve
</p>
<p>L&#8217;utilisation des ellipses dans ce contexte particulier soul&#232;ve cependant deux questions : (1)
qu&#8217;en est-il de la reconnaissance des ellipses, par rapport aux phrases compl&#232;tes ? et (2) est-
il possible, avec les techniques actuelles, d&#8217;obtenir une traduction de qualit&#233; suffisante pour
ce type d&#8217;application ? La premi&#232;re question n&#8217;a pas encore re&#231;u beaucoup d&#8217;attention &#224; notre
connaissance. A priori, les ellipses devraient avoir des cons&#233;quences b&#233;n&#233;fiques pour la recon-
naissance. Du fait que les phrases sont plus courtes, celle-ci devrait prendre moins de temps ;
elle devrait aussi &#234;tre de meilleure qualit&#233; - on s&#8217;attend &#224; avoir moins d&#8217;erreurs dans une phrase
courte que longue. Mais on sait par ailleurs que les phrases et mots courts peuvent &#234;tre difficiles
&#224; reconna&#238;tre, faute de contraintes syntaxiques et s&#233;mantiques venant du contexte. Il semble
donc important de v&#233;rifier leur impact r&#233;el sur la reconnaissance. Pour la traduction, diff&#233;rentes
approches sont envisageables. Dans un syst&#232;me g&#233;n&#233;ral, il devrait &#234;tre possible de traduire les
ellipses mot &#224; mot. Mais si la qualit&#233; est importante, comme dans le domaine m&#233;dical, les pro-
bl&#232;mes seront tr&#232;s nombreux et on peut se demander jusqu&#8217;&#224; quel point ce type de traduction
restera compr&#233;hensible (Boitet et al., 2002). M&#234;me pour des langues proches et dans un do-
maine limit&#233; comme le n&#244;tre, la traduction des ellipses ne peut pas se faire sans contexte. Dans
l&#8217;exemple (3), celui-ci conditionne l&#8217;accord de l&#8217;adjectif.
</p>
<p>(3) M : is the pain severe ?
Trad : la douleur est-elle intense ?
M : moderate
</p>
<p>Trad : mod&#233;r&#233; / mod&#233;r&#233;e / mod&#233;r&#233;es / mod&#233;r&#233;s
</p>
<p>Il est aussi indispensable pour que les r&#232;gles de traduction puissent s&#8217;appliquer correctement.
En (4), for doit &#234;tre traduit par &#8220;depuis&#8221; si l&#8217;aspect de la phrase est perfectif.
</p>
<p>(4) M : have you had headaches for days ?
Trad : avez vous mal depuis plusieurs jours ?
M : for weeks
</p>
<p>Trad : pendant plusieurs semaines
</p>
<p>En (5), le compl&#233;ment de lieu en anglais (in your stomach) devient le sujet de la phrase en
espagnol, ce qui fait que la traduction de l&#8217;ellipse devrait changer de cat&#233;gorie syntaxique (&#8220;in
</p>
<p>1Tous les exemples de cet article sont directement repris des donn&#233;es collect&#233;es dans le cadre du projet MedSLT.
</p>
<p>54</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les ellipses dans un syst&#232;me de traduction automatique de la parole
</p>
<p>your head&#8221; (pp)&#8594; la cabeza (np)). Ce type de divergence est fr&#233;quent aussi quand on traduit
vers des langues plus &#233;loign&#233;es. En japonais par exemple, les ellipses adjectivales ou nominales
rel&#232;vent de la langue famili&#232;re et se traduisent plut&#244;t par des phrases compl&#232;tes comme en (6).
</p>
<p>(5) M : do you have a pain in your stomach ?
Trad : le duele el estomago ?
M : in your head
</p>
<p>Trad : en la cabeza ?
</p>
<p>(6) M : is the pain severe ?
Trad : hageshii itami desu ka ? (sev&#232;re douleur est Q ?)
M : moderate ?
</p>
<p>Trad : *chuuteido / *chuuteido no (moder&#233;e / moder&#233;e GEN)
chuuteido no itami desu ka (mod&#233;r&#233;e GEN douleur est Q)
</p>
<p>Pour &#233;viter la traduction mot &#224; mot, une autre solution, &#224; l&#8217;extr&#234;me oppos&#233;, consiste &#224; effectuer
une analyse profonde au niveau de la syntaxe et du discours, de mani&#232;re &#224; pouvoir traduire les
ellipses en contexte. C&#8217;est l&#8217;optique choisie dans Verbmobil (Kipp et al., 2000). On sait cepen-
dant que les diff&#233;rentes composantes sous-jacentes (m&#233;moire du dialogue, processeur de plan
et processeur de dialogue) sont tr&#232;s co&#251;teuses et restent peu robustes et portables. Nous pro-
posons donc plut&#244;t une approche interm&#233;diaire, possible elle aussi pour des domaines limit&#233;s.
Emprunt&#233;e directement aux m&#233;thodes similaires traditionnellement utilis&#233;es en traitement de
dialogue (par exemple, (Ward &amp; Issar, 1994) dans le contexte de ATIS), elle exploite des re-
pr&#233;sentations s&#233;mantiques plates (Rayner et al., 2005) et combine des techniques linguistiques
(pour construire la repr&#233;sentation) et d&#8217;apprentissage (pour apprendre ce qu&#8217;est une ellipse bien
form&#233;e dans un sous-domaine donn&#233; et comment la r&#233;soudre). Dans la suite, nous d&#233;crivons
d&#8217;abord MedSLT, en focalisant sur les composantes qui nous int&#233;ressent ici, puis nous pr&#233;sen-
tons la mani&#232;re dont les ellipses y sont trait&#233;es. L&#8217;&#233;valuation r&#233;pond aux deux questions pos&#233;es
plus haut : quel est l&#8217;impact des ellipses sur la reconnaissance et la traduction ? Elle montre que
l&#8217;architecture g&#233;n&#233;rale de MedSLT permet une int&#233;gration simple avec le contexte qui conduit
&#224; une traduction en contexte de qualit&#233; suffisante pour la t&#226;che.
</p>
<p>2 MedSLT
</p>
<p>MedSLT est un syst&#232;me de traduction automatique de la parole (TAP) pour le diagnostic d&#8217;ur-
gence de patients &#233;trangers. Il permet &#224; un docteur de poser des questions &#224; un patient dans des
domaines sp&#233;cifiques, comme les maux de t&#234;te ou les douleurs abdominales, avec un vocabu-
laire d&#8217;approximativement 1000 &#224; 1500 mots par domaine. En deux mots, MedSLT pr&#233;sente
deux sp&#233;cificit&#233;s principales (Bouillon et al., 2005). Contrairement aux autres applications de
ce type o&#249; la reconnaissance est soit statistique (Seligman &amp; Dillinger, 2006; Gao et al., 2006),
soit bas&#233;e sur des grammaires ad hoc de bas niveau (Ehsani et al., 2006), le mod&#232;le du lan-
gage pour la reconnaissance est compil&#233; ici &#224; partir de grammaires d&#8217;unification g&#233;n&#233;rales de
la langue. Ceci se fait avec la plateforme Regulus, b&#226;tie directement sur les outils vocaux de
Nuance(Rayner et al., 2006). Celle-ci permet de d&#233;river toutes les grammaires du syst&#232;me &#224;
partir de la m&#234;me grammaire g&#233;n&#233;rale. Pour ce faire, Regulus va d&#8217;abord sp&#233;cialiser les gram-
maires g&#233;n&#233;rales par des m&#233;thodes d&#8217;apprentissage bas&#233;es sur des corpus pour les rendre moins
ambigu&#235;s et les plus sp&#233;cifiques possibles pour un domaine et/ou une t&#226;che donn&#233;s. Il compile
ensuite les grammaires sp&#233;cialis&#233;es pour les diff&#233;rentes t&#226;ches du syst&#232;me, &#224; savoir : reconnais-
</p>
<p>55</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierrette BOUILLON, Manny RAYNER, Marianne STARLANDER, Marianne SANTAHOLMA
</p>
<p>sance/analyse apr&#232;s conversion dans le format CFG requis par Nuance, puis g&#233;n&#233;ration. De l&#224;,
d&#233;coule la seconde sp&#233;cificit&#233;. Comme ce type de reconnaisance donne surtout des r&#233;sultats
comp&#233;titifs pour les phrases couvertes par la grammaire, il s&#8217;agit d&#8217;une application contr&#244;l&#233;e
qui suppose que l&#8217;utilisateur pourra apprendre la couverture du syst&#232;me, de mani&#232;re &#224; en ti-
rer le meilleur profit possible. Pour l&#8217;aider dans cette t&#226;che, nous utilisons un syst&#232;me d&#8217;aide
(Starlander et al., 2005; Chatzichrisafis et al., 2006). Au docteur, celui-ci propose, apr&#232;s chaque
question, des phrases similaires, couvertes par le syst&#232;me, dont il pourra s&#8217;inspirer ; au patient, il
donne des exemples de r&#233;ponses possibles apr&#232;s chaque question. Pour d&#233;river l&#8217;aide, le syst&#232;me
repose un corpus de phrases pr&#233;enregistr&#233;es avec des questions et les r&#233;ponses li&#233;es. Pour les
questions, le syst&#232;me fait en parall&#232;le une reconnaissance statistique et compare ensuite le r&#233;-
sultat de cette reconnaissance avec les phrases pr&#233;-enregistr&#233;es pour extraire les plus similaires
(en termes de n-grammes). C&#8217;est ainsi que nous introduisons de la robustesse dans un syst&#232;me
contr&#244;l&#233; ; pour les r&#233;ponses, le syst&#232;me d&#8217;aide cherche dans le corpus la question la plus simi-
laire &#224; celle qui a &#233;t&#233; envoy&#233;e &#224; la traduction et propose les r&#233;ponses correspondantes. Une fois
reconnue, la phrase est traduite, suivant la m&#233;thode interlingue. Dans notre approche, la m&#234;me
grammaire sp&#233;cialis&#233;e est utilis&#233;e pour la reconnaissance et l&#8217;analyse, ce qui assure que chaque
phrase reconnue recevra aussi une analyse. Regulus permet diff&#233;rents types de repr&#233;sentation
(Rayner et al., 2006), mais nous avons choisi ici d&#8217;exploiter la plus simple possible. Il s&#8217;agit
d&#8217;une structure s&#233;mantique quasi plate, form&#233;e par concat&#233;nation de la s&#233;mantique des mots.
Par exemple, &#8220;avez-vous mal &#224; la t&#234;te quand vous buvez du caf&#233; ?&#8221; sera repr&#233;sent&#233; de la mani&#232;re
suivante :
</p>
<p>[[sc, quand],
[clause, [[pronoun, vous], [voice, active],
</p>
<p>[tense, present], [action, boire], [cause, caf&#233;]],
[path_proc, avoir], [pronoun, vous], [symptom, mal],
[tense, present], [utterance_type, sentence],
[voice, active], [locative_prep, &#224;], [body_part, t&#234;te]]
</p>
<p>Le m&#234;me formalisme est aussi utilis&#233; pour l&#8217;interlangue, qui est une version standardis&#233;e de la
langue source. Nous avons d&#233;j&#224; montr&#233; l&#8217;avantage de ces structures pour la traduction (Rayner
et al., 2005) et comment il est possible de d&#233;river des grammaires sp&#233;cialis&#233;es pour la g&#233;n&#233;ration
qui &#233;vitent le probl&#232;me de surg&#233;n&#233;ration (Bouillon et al., 2006). Dans la suite, nous verrons
qu&#8217;elles constituent aussi un excellent point de d&#233;part pour le traitement des ellipses.
</p>
<p>3 Le traitement des ellipses dans MedSLT
</p>
<p>Dans MedSLT, les ellipses sont tr&#232;s productives. On y trouve non seulement des omissions,
comme en (7), mais aussi des substitutions (Cf. (8)), o&#249; l&#8217;ellipse remplace une information d&#233;j&#224;
existante.
(7) M : avez vous souvent des maux de t&#234;te ?
</p>
<p>Trad : do you often have the headaches ?
M : le soir
</p>
<p>Trad : do you often have the headaches in the evening
</p>
<p>56</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les ellipses dans un syst&#232;me de traduction automatique de la parole
</p>
<p>(8) M : avez vous des maux de t&#234;te chaque jour ?
Trad : do you have the headaches every day ?
M : plusieurs fois par jour
</p>
<p>Trad : do you have the headaches several times a day ?
</p>
<p>Diff&#233;rents types de substitution sont &#233;galement possibles. Il est par exemple tr&#232;s courant de
substituer deux &#233;l&#233;ments non interrogatifs au niveau de la question, comme en (8). Un &#233;l&#233;ment
non interrogatif peut aussi remplacer un &#233;l&#233;ment interrogatif, au niveau de la question (9) ou
de la r&#233;ponse (10). L&#8217;algorithme de r&#233;solution devra donc &#234;tre assez puissant pour traiter ces
diff&#233;rents cas.
(9) M : when did you visit the doctor ?
</p>
<p>Trad : cu&#225;ndo ha consultado un m&#233;dico ?
M : yesterday
</p>
<p>Trad : ha consultado un m&#233;dico ayer ?
</p>
<p>(10) M : when did you visit the doctor ?
Trad : cu&#225;ndo ha consultado un m&#233;dico ?
</p>
<p>P : ayer
Trad : i visited the doctor yesterday
</p>
<p>Comme nous l&#8217;avons dit plus haut, nous ne nous appuyons pourtant pas ici sur une analyse
profonde. Les repr&#233;sentations plates de MedSLT vont en effet nous permettre un traitement
plus efficace et portable, directement adapt&#233; des syst&#232;mes traditionnels de dialogue homme-
machine : comme les phrases elliptiques et leur contexte sont repr&#233;sent&#233;s dans des listes plates
d&#8217;attributs-valeurs, nous pouvons consid&#233;rer la r&#233;solution comme une forme de manipulation
de listes d&#8217;attributs. Nous traitons ainsi l&#8217;omission comme une simple concat&#233;nation de listes
et la substitution comme une substitution de listes d&#8217;&#233;l&#233;ments similaires. Pour ce faire, il nous
faut cependant r&#233;pondre &#224; deux questions sp&#233;cifiques &#224; la TAP : (1) &#224; quel niveau du flux de
traitement devons-nous manipuler les listes ? et (2) surtout : comment d&#233;terminer les &#233;l&#233;ments
substituables les uns aux autres dans la phrase elliptique et la phrase compl&#232;te, de la mani&#232;re la
moins ad-hoc possible ?
</p>
<p>La Figure 1 illustre le flux de traduction par interlangue dans MedSLT pour les deux phrases
does the pain radiate to your neck ? et the jaw ? Pour r&#233;soudre la phrase elliptique et la tra-
duire ensuite en contexte, il faut arriver &#224; remplacer la sous-repr&#233;sentation [body_part,
neck] de la phrase compl&#232;te (tagg&#233;e [utterance_type, ynq]), par [body_part,
jaw] qui se trouve dans la phrase elliptique (not&#233;e, [utterance_type, phrase]). Dans
cet exemple, il serait sans doute pr&#233;f&#233;rable de faire la substitution au niveau de l&#8217;interlangue.
Cette derni&#232;re a l&#8217;avantage de ne plus contenir l&#8217;information sur le possessif ([possessive,
your]) &#8212; les d&#233;terminants sont en g&#233;n&#233;ral tellement mal reconnus que nous avons d&#233;cid&#233; de
ne pas les faire figurer dans l&#8217;interlangue et de laisser au g&#233;n&#233;rateur le soin de choisir l&#8217;article
le plus appropri&#233; sur la base de corpus (Cf. (Bouillon et al., 2006)). Mais dans beaucoup de
cas, la r&#233;solution au niveau de l&#8217;interlangue posera de nombreux probl&#232;mes, notamment quand
elle ajoute des informations s&#233;mantiques. Par exemple, la phrase &#8220;la douleur est-elle aggrav&#233;e
par le chocolat&#8221; sera repr&#233;sent&#233;e au niveau de l&#8217;interlangue dans un sens paraphrasable par &#8220;la
douleur augmente-t-elle quand vous mangez du chocolat&#8221;, ce qui rend ensuite la substitution
impossible si l&#8217;ellipse fait appel &#224; un autre verbe implicite. Nous proposons donc de faire la
r&#233;solution avant le passage &#224; l&#8217;interlangue, ce qui rend d&#8217;ailleurs compte du fait que l&#8217;ellipse est
avant tout un ph&#233;nom&#232;me syntaxique. Celle-ci se fait ainsi en deux &#233;tapes. D&#8217;abord, nous sim-
plifions le r&#233;sultat de l&#8217;analyse, en enlevant certains &#233;l&#233;ments, comme le possessif, dont nous
</p>
<p>57</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierrette BOUILLON, Manny RAYNER, Marianne STARLANDER, Marianne SANTAHOLMA
</p>
<p>Source1 = &quot;does the pain radiate to your neck&quot;
Source Rep1 = [[body_part,neck], [possessive, your],
</p>
<p>[prep,to_loc], [secondary_symptom,pain],
[state,radiate], [tense,present],
[utterance_type,ynq]]
</p>
<p>Interling1 = [[body_part,neck], [state,radiate], [symptom,pain],
[tense,present], [utterance_type,ynq]]
</p>
<p>Target Rep1 = [[body_part,nuque], [path_proc,irradier],
[symptom,douleur], [tense,present],
[utterance_type,sentence]]
</p>
<p>Target1 = &quot;la douleur irradie-t-elle la nuque&quot;
Source2 = &quot;the jaw&quot;
Source Rep2 = [[body_part,jaw], [utterance_type,phrase]]
Interling2 = [[body_part,jaw], [utterance_type,phrase]]
Resolved2 = [[body_part,jaw], [state,radiate], [symptom,pain],
</p>
<p>[tense,present], [utterance_type,ynq]]
Target2 = &quot;la douleur irradie-t-elle les machoires&quot;
</p>
<p>FIG. 1 &#8211; Flux de traduction dans MedSLT
</p>
<p>venons de parler. C&#8217;est ensuite au niveau de cette seconde structure que se font les op&#233;rations
d&#8217;ajout et de substitution. Pour d&#233;terminer les &#233;l&#233;ments substituables, nous exploitons le fait que
les mots sont li&#233;s dans leur repr&#233;sentation &#224; leur type ontologique (body_part, symptom,
etc.) : un &#233;l&#233;ment peut d&#232;s lors se substituer &#224; un autre s&#8217;il a le m&#234;me type ou un type li&#233; (hypo-
nyme, hyperonyme, etc.). Pour appr&#233;hender ces &#233;l&#233;ments de la mani&#232;re la plus robuste possible
et ind&#233;pendamment des changements dans le lexique ou la grammaire, nous utilisons une m&#233;-
thode d&#8217;apprentissage &#233;l&#233;mentaire. Nous constituons d&#8217;abord un corpus qui d&#233;crit chaque type
d&#8217;ellipse possible (lieu, temps, etc.) avec des exemples, comme dans la Figure 2. Ceux-ci sont
ensuite analys&#233;s par la grammaire, puis g&#233;n&#233;ralis&#233;s, de mani&#232;re &#224; extraire les patrons les plus
g&#233;n&#233;raux possibles qui ensemble d&#233;finissent la bonne formation d&#8217;une classe d&#8217;ellipses. Ici, par
exemple, sont g&#233;n&#233;ralis&#233;s les patrons repris dans la Figure 3. On voit que, en g&#233;n&#233;ral, seul le
type ontologique est gard&#233;, mais pour les &#233;l&#233;ments interrogatifs, comme where ou when, nous
conservons aussi la valeur de l&#8217;attribut de mani&#232;re &#224; pouvoir distinguer ces mots entre eux.
</p>
<p>ellipsis_class(
place_of_pain_np,
[&#8217;the left angle of the ribs&#8217;, &#8217;the right lower chest&#8217;,
&#8217;the right chest&#8217;, &#8217;the front of the head&#8217;,
&#8217;both sides of the head&#8217;,
&#8217;both arms&#8217;, &#8217;the left side&#8217;,
&#8217;the chest&#8217;, &#8217;the side&#8217;]).
</p>
<p>FIG. 2 &#8211; Classe d&#8217;ellipses
</p>
<p>Sur la base de ces informations, l&#8217;algorithme de r&#233;solution peut &#234;tre tr&#232;s simple. Pour toute
phrase identifi&#233;e comme elliptique par l&#8217;analyseur, le syst&#232;me va d&#8217;abord v&#233;rifier si une sub-
stitution est possible : chaque sous-repr&#233;sentation d&#8217;une phrase elliptique qui correspond &#224; l&#8217;un
des patrons peut se substituer &#224; toute autre sous-repr&#233;sentation d&#8217;une phrase compl&#232;te qui cor-
respond &#224; un patron de la m&#234;me classe. Au cas o&#249; diff&#233;rentes substitutions sont possibles, le
</p>
<p>58</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les ellipses dans un syst&#232;me de traduction automatique de la parole
</p>
<p>compiled_ellipsis_class(
place_of_pain_np,
[[[adj, _], [body_part, _], [part, _]],
[[adj, _], [adj, _], [body_part, _]],
[[adj, _], [body_part, _]], [[body_part, _], [part, _]],
[[body_part, _], [part, _], [spec, _]],
[[body_part, _], [spec, _]], [[adj, _], [part, _]],
[[body_part, _]], [[part, _]]]).
</p>
<p>FIG. 3 &#8211; G&#233;n&#233;ralisation des patrons &#224; partir des exemples de la Figure 2
</p>
<p>syst&#232;me choisit toujours la plus longue. Ensuite, si la substitution est impossible, le syst&#232;me
consid&#233;rera qu&#8217;il s&#8217;agit d&#8217;un ajout. Si un patron manque, le syst&#232;me fera donc erron&#233;ment un
ajout, mais nous verrons dans l&#8217;&#233;valuation que ce cas se produit tr&#232;s rarement : la m&#233;thode
est suffisamment robuste pour apprendre a priori des patrons assez g&#233;n&#233;raux pour couvrir les
domaines contr&#244;l&#233;s de notre application.
</p>
<p>4 Evaluation
</p>
<p>Dans un premier temps, nous avons voulu v&#233;rifier l&#8217;impact des ellipses sur la reconnaissance.
Nous avons constitu&#233; deux ensembles de questions couvertes par le syst&#232;me, avec les questions
oui-non types pour les maux de t&#234;te. Le premier ensemble ne contient que des phrases compl&#232;tes
(11) ; dans le second, nous avons remplac&#233; les phrases compl&#232;tes par des phrases elliptiques,
quand c&#8217;est possible (12). Chaque fichier contient 111 phrases.
</p>
<p>(11) avez vous mal quand vous toussez ?
avez vous mal quand vous mangez ?
avez vous mal quand vous &#234;tes stress&#233; ?
avez vous mal quand vous &#234;tes fatigu&#233; ?
</p>
<p>(12) avez vous mal quand vous toussez ?
quand vous mangez ?
quand vous &#234;tes stress&#233; ?
fatigu&#233; ?
</p>
<p>Nous avons ensuite demand&#233; &#224; sept personnes de lire successivement les deux s&#233;ries de ques-
tions, puis nous avons mesur&#233; la qualit&#233; de la reconnaissance. Pour ce faire, nous avons com-
par&#233; le taux d&#8217;erreurs au niveau des mots (WER) et des phrases (SER). Comme nous savons
ces mesures peu fiables (Wang et al., 2003; Bouillon et al., 2006), nous avons aussi calcul&#233; le
taux d&#8217;erreurs s&#233;mantiques (SemER), c&#8217;est-&#224;-dire le nombre de phrases o&#249; la reconnaissance ne
pr&#233;serve pas le sens. Elles correspondent aux phrases dont la r&#233;tro-traduction est correcte et qui
seraient donc envoy&#233;es &#224; la traduction par l&#8217;utilisateur. Les r&#233;sultats sont repris dans le tableau 1.
Ceux-ci nous semblent particuli&#232;rement int&#233;ressants. Les mesures traditionnelles (WER et SER)
donnent l&#8217;impression que l&#8217;impact des ellipses est tr&#232;s n&#233;gatif. Elles d&#233;t&#233;rioreraient consid&#233;ra-
blement la reconnaissance : 11,5% d&#8217;erreurs au niveau des mots pour les ellipses versus 3,1%
pour les phrases compl&#232;tes. Mais si on regarde le SemER, les r&#233;sultats ont tendance &#224; s&#8217;inverser,
dans le sens attendu : le taux d&#8217;erreurs s&#233;mantiques est l&#233;g&#232;rement moins important pour les
</p>
<p>59</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierrette BOUILLON, Manny RAYNER, Marianne STARLANDER, Marianne SANTAHOLMA
</p>
<p>Ellipses Phrases compl&#232;tes
Sujets WER SER SemER Secs WER SER SemER Secs
AR 8,3% 22,4% 0,0% 2,0 1,8% 12,0% 1,3% 3,2
BR 14,3% 32,1% 3,8% 1,6 5,4% 27,3% 3,9% 2,5
CL 13,3% 28,2% 2,6% 2,0 2,0% 11,5% 1,3% 3,0
LA 13,8% 37,2% 0,0% 1,7 4,3% 21,8% 1,3% 2,6
LU 9,5% 25,6% 1,3% 1,8 2,7% 12,8% 3,8% 2,6
PI 10,0% 26,9% 2,6% 2,0 3,5% 21,8% 7,7% 2,8
SE 11,0% 26,9% 0,0% 2,0 2,3% 15,4% 0,0% 3,1
Moyen 11,5% 28,5% 1,5% 1,9 3,1% 17,5% 2,8% 2,8
</p>
<p>TAB. 1 &#8211; R&#233;sultats de la reconnaissance avec des phrases compl&#232;tes et elliptiques
</p>
<p>ellipses que pour les phrases compl&#232;tes (1,5% versus 2,8%) et ceci pour tous les locuteurs. Un
examen des donn&#233;es explique cette diff&#233;rence entre le WER et SemER : la plupart des fautes
faites lors de la reconnaissance des ellipses ne sont pas importantes pour la t&#226;che. Il s&#8217;agit par
exemple d&#8217;erreurs au niveau du nombre : le syst&#232;me reconna&#238;t &#8220;occipitales&#8221; &#224; la place &#8220;occi-
pal&#8221;, faute de contexte. Mais comme cette information n&#8217;appara&#238;t pas dans la repr&#233;sentation,
cette erreur n&#8217;a aucune r&#233;percussion sur la traduction.
</p>
<p>Nous pouvons donc tirer trois conclusions de cette &#233;valuation : (1) Les mesures traditionnelles
doivent &#234;tre &#233;vit&#233;es, puisqu&#8217;elles peuvent conduire &#224; de fausses conclusions ; (2) la longueur
des phrases n&#8217;aurait finalement qu&#8217;une l&#233;g&#232;re influence sur la reconnaissance (en tout cas quand
cette derni&#232;re est bas&#233;e sur des grammaires et qu&#8217;il s&#8217;agit de donn&#233;es lues). (3) L&#8217;impact des el-
lipses sur la reconnaissance est donc globalement positif, puisqu&#8217;elles diminuent aussi le temps
de traitement (Secs) : 1,9 secondes de moyenne pour les ellipses versus 2,8 pour les phrases
compl&#232;tes. Mais peut-on obtenir une traduction en contexte de qualit&#233; suffisante avec l&#8217;algo-
rithme pr&#233;sent&#233; plus haut ?
</p>
<p>Pour mesurer la qualit&#233; de l&#8217;algorithme de r&#233;solution, nous avons collect&#233; pour la premi&#232;re fois
des donn&#233;es avec le syst&#232;me bidirectionnel anglais-espagnol et nous avons &#233;valu&#233; la qualit&#233; de
la traduction des r&#233;ponses elliptiques du patient en anglais. Dans cette exp&#233;rience, l&#8217;un d&#8217;entre
nous a jou&#233; le r&#244;le du m&#233;decin. Le but &#233;tait de voir si le patient souffrait ou pas d&#8217;une infec-
tion bact&#233;rienne &#224; la gorge. Les patients &#233;taient au nombre de six. Ils n&#8217;avaient jamais utilis&#233;
le syst&#232;me auparavant et avaient re&#231;u une carte d&#233;crivant leurs sympt&#244;mes. Nous avons ainsi
collect&#233; 47 r&#233;ponses elliptiques en espagnol, consid&#233;r&#233;es comme bien reconnues par le patient,
sur un total de 92 r&#233;ponses. Celles-ci sont peu nombreuses, mais sont pourtant repr&#233;sentatives :
comme le syst&#232;me est contr&#244;l&#233; et dans un domaine tr&#232;s limit&#233;, nous n&#8217;aurions probablement pas
obtenu plus de r&#233;ponses diff&#233;rentes bien reconnues, en augmentant le nombre de patients. Parmi
les r&#233;ponses, 36/47 ont &#233;t&#233; jug&#233;es tout-&#224;-fait intelligibles et fid&#232;les par deux traducteurs et 3/47,
OK. Une seule traduction (1/47) a &#233;chou&#233; en raison de l&#8217;algorithme de r&#233;solution (Cf. exemple
(11)), ce qui montre que les patrons appris sont assez g&#233;n&#233;raux pour la t&#226;che. Les autres erreurs
se situent soit au niveau de la traduction (2/47), soit au niveau de l&#8217;interaction avec le syst&#232;me,
par exemple le patient accepte parfois des phrases mal reconnues, ce qui donne des r&#233;sultats
erron&#233;s (3/47).
</p>
<p>60</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les ellipses dans un syst&#232;me de traduction automatique de la parole
</p>
<p>(10) M : for how long have you had your sore throat ?
P : desde hace m&#225;s de una semana
</p>
<p>Trad : i have had a sore throat for more than one week
M : what were the results ?
P : negativo
</p>
<p>Trad : the results were negative
M : have you seen a doctor for your sore throat ?
P : s&#237; el lunes
</p>
<p>Trad : i visited the doctor for my sore throat monday
(11) M : have you been with anyone recently who has a strep throat ?
</p>
<p>P : si m&#225;s de dos semanas
Trad : i was in contact with someone more than two weeks
</p>
<p>recently who had strep throat
</p>
<p>Une &#233;valuation plus importante est en cours qui devrait compl&#233;ter ces r&#233;sultats. Il serait en effet
int&#233;ressant de v&#233;rifier si ceux-ci restent les m&#234;mes avec la version statistique du syst&#232;me et
pour des donn&#233;es non-lues. Nous voudrions aussi &#233;tablir quantitativement qu&#8217;une traduction en
contexte am&#233;liore la t&#226;che.
</p>
<p>5 Conclusion
</p>
<p>Dans cet article, nous avons montr&#233; qu&#8217;il est possible d&#8217;arriver &#224; traiter ad&#233;quatement les el-
lipses dans un syst&#232;me de TAP, bas&#233; sur les grammaires. Comme celles-ci sont tr&#232;s naturelles
dans le domaine et semblent avoir un impact positif sur la reconnaissance, il est en effet essen-
tiel de pouvoir les traduire correctement en contexte pour en tirer le meilleur parti possible dans
l&#8217;application. Pour ce faire, l&#8217;approche contr&#244;l&#233;e de MedSLT rend possible l&#8217;utilisation d&#8217;algo-
rithmes de r&#233;solution tr&#232;s peu co&#251;teux qui permettent une traduction en contexte intelligible et
fid&#232;le. Nous avons ainsi clairement contribu&#233; &#224; int&#233;grer le contexte dans une architecture comme
la n&#244;tre et, de mani&#232;re plus g&#233;n&#233;rale, dans les syst&#232;mes de TAP.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOITET C., BLANCHON H. &amp; GUILBAUD J.-P. (2002). A way to integrate context processing
in the MT component of spoken, task-oriented translation systems. In Proc. MSC2000, p. 83&#8211;
87, Kyoto, Japan.
</p>
<p>BOUILLON P., RAYNER M., CHATZICHRISAFIS N., HOCKEY B., SANTAHOLMA M., STAR-
LANDER M., NAKAO Y., KANZAKI K. &amp; ISAHARA H. (2005). A generic multi-lingual open
source platform for limited-domain medical speech translation. In Proceedings of the 10th
Conference of the European Association for Machine Translation (EAMT), p. 50&#8211;58, Buda-
pest, Hungary.
</p>
<p>BOUILLON P., RAYNER M., VALL B. N., NAKAO Y., SANTAHOLMA M., STARLANDER
M. &amp; CHATZICHRISAFIS N. (2006). Une grammaire multilingue partag&#233;e pour la traduction
automatique de la parole. In Proceedings of TALN 2006, Leuwen, Belgium.
</p>
<p>CHATZICHRISAFIS N., BOUILLON P., RAYNER M., SANTAHOLMA M., STARLANDER M.
&amp; HOCKEY B. (2006). Evaluating task performance for a unidirectional controlled language
</p>
<p>61</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierrette BOUILLON, Manny RAYNER, Marianne STARLANDER, Marianne SANTAHOLMA
</p>
<p>medical speech translation system. In Proceedings of the HLT-NAACL International Workshop
on Medical Speech Translation, p. 9&#8211;16, New York.
EHSANI F., KINZEY J., MASTER D., LESEA K. &amp; PARK H. (2006). Speech to speech
translation for medical triage in Korean. In Proceedings of the HLT-NAACL International
Workshop on Medical Speech Translation, p. 17&#8211;23, New York.
FERNANDEZ R. &amp; GINZBURG J. (2002). Non-sentential utterances in dialogue : a corpus
study. In Proc. Third SIGdial Workshop on Discourse and Dialogue, Philadelphia, PA.
GAO Y., ZHOU B., SARIKAYA R., AFIFY M., KUO H.-K., ZHU W.-Z., DENG Y., PROSSER
C., ZHANG W. &amp; BESACIER L. (2006). IBM MASTOR SYSTEM : Multilingual automatic
speech-to-speech translator. In Proceedings of the HLT-NAACL International Workshop on
Medical Speech Translation, p. 57&#8211;60, New York.
KIPP M., ALEXANDERSSON J., ENGEL R. &amp; REITHINGER N. (2000). Dialog processing.
In W. WAHLSTER, Ed., Verbmobil : Foundations of Speech-to-Speech Translation.
RAYNER M., BOUILLON P., SANTAHOLMA M. &amp; NAKAO Y. (2005). Representational and
architectural issues in a limited-domain medical speech translator. In Proceedings of TALN
2005, p. 163&#8211;172, Dourdan, France.
RAYNER M., HOCKEY B. &amp; BOUILLON P. (2006). Putting Linguistics into Speech Recogni-
tion : The Regulus Grammar Compiler. Chicago : CSLI Press.
SELIGMAN M. &amp; DILLINGER M. (2006). Usability issues in an interactive speech-to-speech
translation system for healthcare. In Proceedings of the HLT-NAACL International Workshop
on Medical Speech Translation, p. 1&#8211;8, New York.
STARLANDER M., BOUILLON P., CHATZICHRISAFIS N., SANTAHOLMA M., RAYNER M.,
HOCKEY B., ISAHARA H., KANZAKI K. &amp; NAKAO Y. (2005). Practising controlled lan-
guage through a help system integrated into the medical speech translation system (MedSLT).
In Proceedings of MT Summit X, Phuket, Thailand.
WANG Y.-Y., ACERO A. &amp; CHELBA C. (2003). Is Word Error Rate a good indicator for
spoken language understanding accuracy. In Proceedings of Eurospeech 2003, p. 609&#8211;612,
Geneva, Switzerland.
WARD W. &amp; ISSAR S. (1994). Recent improvements in the CMU ATIS system. In Procee-
dings of the ARPA Human System Technology Workshop, p. 213&#8211;216.
</p>
<p>62</p>

</div></div>
</body></html>