<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitements phrastiques phon&#233;tiques pour la r&#233;&#233;criture de phrases dysorthographi&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Traitements phrastiques phon&#233;tiques pour la r&#233;&#233;criture de
phrases dysorthographi&#233;es
</p>
<p>Laurianne SITBON1, 2, Patrice BELLOT1, Philippe BLACHE2
1 Laboratoire d&#8217;Informatique d&#8217;Avignon - Universit&#233; d&#8217;Avignon
</p>
<p>2 Laboratoire Parole et Langage - Universit&#233; de Provence
{laurianne.sitbon,patrice.bellot}@univ-avignon.fr,
</p>
<p>blache@lpl.univ-aix.fr
</p>
<p>R&#233;sum&#233;. Cet article d&#233;crit une m&#233;thode qui combine des hypoth&#232;ses graph&#233;miques et pho-
n&#233;tiques au niveau de la phrase, &#224; l&#8217;aide d&#8217;une r&#233;pr&#233;sentation en automates &#224; &#233;tats finis et d&#8217;un
mod&#232;le de langage, pour la r&#233;&#233;criture de phrases tap&#233;es au clavier par des dysorthographiques.
La particularit&#233; des &#233;crits dysorthographi&#233;s qui emp&#234;che les correcteurs orthographiques d&#8217;&#234;tre
efficaces pour cette t&#226;che est une segmentation en mots parfois incorrecte. La r&#233;&#233;criture diff&#232;re
de la correction en ce sens que les phrases r&#233;&#233;crites ne sont pas &#224; destination de l&#8217;utilisateur mais
d&#8217;un syst&#232;me automatique, tel qu&#8217;un moteur de recherche. De ce fait l&#8217;&#233;valuation est conduite
sur des versions filtr&#233;es et lemmatis&#233;es des phrases. Le taux d&#8217;erreurs mots moyen passe de
51 % &#224; 20 % avec notre m&#233;thode, et est de 0 % sur 43 % des phrases test&#233;es.
</p>
<p>Abstract. This paper introduces a sentence level method combining written correction
and phonetic interpretation in order to automatically rewrite sentences typed by dyslexic spel-
lers. The method uses a finite state automata framework and a language model. Dysorthogra-
phics refers to incorrect word segmentation which usually causes classical spelling correctors
fail. Our approach differs from spelling correction in that we aim to use several rewritings as an
expression of the user need in an information retrieval context. Our system is evaluated on ques-
tions collected with the help of an orthophonist. The word error rate on lemmatised sentences
falls from 51 % to 20 % (falls to 0 % on 43 % of sentences).
</p>
<p>Mots-cl&#233;s : r&#233;&#233;criture de phrases, dyslexie, automates, correction orthographique.
Keywords: sentence level rewriting, dyslexia, FSM, spell checking.
</p>
<p>1 Introduction
</p>
<p>koman sapel le mer de bastya ? Si votre syst&#232;me de conversion graph&#232;me-phon&#232;me et votre
conscience phonologique fonctionnent parfaitement, vous devriez avoir une intuition de l&#8217;in-
tention de cette question. Peut-&#234;tre m&#234;me pouvez-vous y r&#233;pondre ? En revanche, les syst&#232;mes
automatiques pourtant tr&#232;s &#233;labor&#233;s de questions r&#233;ponses en resteront cois, dans le meilleur
des cas ils r&#233;pondront la M&#233;diterran&#233;e, s&#8217;ils s&#8217;aident d&#8217;un correcteur orthographique. La raison
principale est que ces syst&#232;mes ne sont pas con&#231;us pour prendre en compte un profil linguis-
tique de l&#8217;utilisateur, et dans le cas d&#8217;utilisateurs avec un handicap de langage ces syst&#232;mes ne
</p>
<p>263</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON, Patrice BELLOT, Philippe BLACHE
</p>
<p>sont g&#233;n&#233;ralement pas assez robustes. Les performances des correcteurs orthographiques sont
par exemple faibles dans le cas o&#249; l&#8217;auteur est dysorthographique. Les correcteurs orthogra-
phiques grand public supposent une segmentation en mots correcte, ce qui les rend tr&#232;s peu
efficaces dans des cas d&#8217;&#233;criture dysorthographique, comme le montre une &#233;tude men&#233;e par
(James &amp; Draffan, 2004). Or la dysorthographie est un trouble associ&#233; &#224; la dyslexie d&#8217;origine
phonologique 1, qui provient d&#8217;un trouble de la conscience phonologique. Ceci implique g&#233;n&#233;-
ralement une &#233;criture essentiellement phon&#233;tique et une segmentation en mots souvent erron&#233;e.
La conscience phonologique permet de d&#233;couper une s&#233;quence de phon&#232;mes en unit&#233;s s&#233;man-
tiques dans une phrase (Gillon, 2004). Si les unit&#233;s s&#233;mantiques sont identifi&#233;es correctement, le
passage &#224; l&#8217;orthographe se fait ensuite par des voies de conversion phon&#232;me-graph&#232;me coupl&#233;es
avec des connaissances sur les exceptions orthographiques reli&#233;es au mot.
</p>
<p>Avant d&#8217;envisager un syst&#232;me de r&#233;&#233;criture, la premi&#232;re section situe les besoins par rapport
aux syst&#232;mes auxquels les r&#233;&#233;critures s&#8217;adressent ainsi qu&#8217;aux utilisateurs &#224; travers la consti-
tution d&#8217;un corpus d&#8217;&#233;valuation . La seconde section pose les bases d&#8217;un syst&#232;me d&#233;di&#233; aux
dysorthographiques qui s&#8217;appuie sur une combinaison d&#8217;hypoth&#232;ses graph&#233;miques et phon&#233;-
tiques au niveau de la phrase, ainsi que sa mise en application. La troisi&#232;me section propose une
&#233;valuation de ce syst&#232;me sur le corpus constitu&#233;, en comparant ses performances &#224; celles d&#8217;un
correcteur orthographique.
</p>
<p>2 Enjeux de la r&#233;&#233;criture
</p>
<p>Dans le cadre de la recherche d&#8217;information, on pourra admettre plusieurs hypoth&#232;ses de r&#233;-
&#233;criture de la requ&#234;te initiale &#224; l&#8217;aide d&#8217;un mod&#232;le robuste capable de pond&#233;rer les diff&#233;rentes
hypoth&#232;ses, ce qui est pratiqu&#233; dans le cadre de l&#8217;expansion de requ&#234;tes. De plus, les syst&#232;mes
utilisant g&#233;n&#233;ralement les lemmes de mots de la requ&#234;te &#224; la place des formes, une hypoth&#232;se
contenant des fautes d&#8217;accord reste acceptable. Ainsi, il s&#8217;agit bien de r&#233;&#233;criture en vue d&#8217;un
traitement automatique et non pas de correction orthographique.
</p>
<p>2.1 Constitution d&#8217;un corpus d&#8217;exemples de questions dysorthographi&#233;es
</p>
<p>Parmi les diff&#233;rents types de syst&#232;me de recherche d&#8217;information, nous nous sommes focalis&#233;s
sur les syst&#232;mes de questions r&#233;ponses car ils exigent une requ&#234;te formul&#233;e en une phrase co-
h&#233;rente. De plus, les enfants sont les plus touch&#233;s par les probl&#232;mes de dysorthographie et ils
formulent g&#233;n&#233;ralement leurs requ&#234;tes par des questions.
</p>
<p>Le corpus que nous avons recueilli est donc un corpus de questions tap&#233;es par des enfants
dyslexiques (qui sont &#233;galement dysorthographiques). Ce corpus a &#233;t&#233; r&#233;alis&#233; lors de s&#233;ances
d&#8217;orthophonie de huit enfants (entre 9 ans et demi (CE2) et 13 ans (4e)).
</p>
<p>Le choix des questions a &#233;t&#233; guid&#233; par les contraintes d&#8217;&#233;valuation du syst&#232;me de questions r&#233;-
ponses (SQR) SQuALIA (Gillard et al., 2006) dont nous disposons ainsi que par le vocabulaire
restreint des enfants. Nous avons s&#233;lectionn&#233; des questions factuelles de la campagne d&#8217;&#233;valua-
tion Technolangue EQUER (Ayache et al., 2006) pour lesquelles SQuALIA a fourni une bonne
r&#233;ponse (Gillard et al., 2005), soit environ 200 questions sur les 500 propos&#233;es. Parmi ces 200
questions, nous avons s&#233;lectionn&#233; celles dont tous les mots se trouvent dans le lexique de niveau
</p>
<p>1Selon les &#233;tudes les plus r&#233;centes, la dyslexie touche 3 &#224; 5 % des enfants.
</p>
<p>264</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;&#233;criture de phrases dysorthographi&#233;es
</p>
<p>cours pr&#233;paratoire de Manulex (L&#233;t&#233; et al., 2004), qui recense les fr&#233;quences des mots de ma-
nuels scolaires pour diff&#233;rentes classes d&#8217;&#226;ge, et donne ainsi un aper&#231;u des mots &#233;crits connus
par les enfants. Les 5 questions finalement retenues se trouvent dans le tableau 1.
</p>
<p>Qui est le maire de Bastia ?
Quel &#226;ge a l&#8217;abb&#233; Pierre ?
</p>
<p>Quelle est la capitale de Terre Neuve ?
Qui est le fr&#232;re de la princesse Leia ?
</p>
<p>Quelle est la monnaie nationale en Hongrie ?
</p>
<p>TAB. 1 &#8211; Questions de la campagne EQUER retenues pour constituer le corpus.
</p>
<p>Les questions ont &#233;t&#233; saisies au clavier par les 8 enfants de mani&#232;re semi-spontann&#233;e, c&#8217;est &#224;
dire qu&#8217;elles ne leur ont pas &#233;t&#233; dict&#233;es. Pour chaque question, les quatre &#233;tapes suivantes ont
&#233;t&#233; suivies par l&#8217;orthophoniste :
&#8211; la r&#233;ponse est dite &#224; l&#8217;enfant dans une phrase (Le maire de Bastia s&#8217;appelle X) ;
&#8211; elle demande &#224; l&#8217;enfant quelle question il poserait pour obtenir cette r&#233;ponse (que me demanderais-
</p>
<p>tu pour que je te r&#233;ponde X ?) ;
&#8211; l&#8217;enfant tape la question qu&#8217;il vient de formuler ;
&#8211; l&#8217;enfant relit la question qu&#8217;il vient de taper et &#233;ventuellement corrige ce qu&#8217;il veut.
Le corpus ainsi obtenu, bien que de taille r&#233;duite (37 phrases), est tr&#232;s repr&#233;sentatif car il permet
beaucoup d&#8217;observations communes aux huit participants. En premier lieu il appara&#238;t clairement
que la plupart des observations faites classiquement sur les manuscrits d&#8217;enfants dyslexiques ne
sont pas valid&#233;es sur les &#233;crits typographi&#233;es. Cela est du non seulement &#224; une organisation mo-
trice diff&#233;rente pour la production &#233;crite (il ne s&#8217;agit pas de former les lettres mais de les rep&#233;rer
sur le clavier, o&#249; elles apparaissent en majuscules, il n&#8217;est donc plus question de lat&#233;ralisation),
mais &#233;galement &#224; une plus grande motivation pour la frappe au clavier impliquant une plus
grande attention au niveau de la production comme de la relecture. Ainsi, on ne rencontre pas
de substitutions de lettres dites &quot;miroirs&quot; (p, b, d, q ou m et w, n et u). De m&#234;me on n&#8217;observe
que deux cas d&#8217;inversion de lettres, et aucun cas d&#8217;inversion de syllabes.
</p>
<p>Les erreurs que l&#8217;on rencontre sont essentiellement des erreurs de conversion phon&#232;me-graph&#232;me
au niveau de la phrase. Cela signifie &#224; la fois une &#233;criture phon&#233;tique mais pas n&#233;cessairement
simpliste des mots (ainsi, monnaie s&#8217;&#233;crit monn&#233;, monais, moner, monnaie, moner, monaie ou
monai), et une segmentation en mots erron&#233;e (s&#8217;appelle peut s&#8217;&#233;crire ca ple ou bien sapel, et
l&#8217;abb&#233; Pierre s&#8217;&#233;crit labe pierre, labpier, la Bepierre, labepier, lab&#233;e pierre, l abepier, l&#8217;ab&#233;e
pierre ou labpier). On rencontre &#233;galement des omissions ou substitutions de lettres dans des
cas o&#249; les phon&#232;mes ne sont pas assez distincts (comme pour Bastia ou monnaie). Une autre
cons&#233;quence de l&#8217;&#233;criture phon&#233;tique est la substitution de certains mots par des homophones
(mer remplace maire).
</p>
<p>Par ailleurs on remarque des motifs d&#8217;erreurs constants pour chaque individu et propres &#224; cha-
cun. Par exemple pour un m&#234;me enfant les pronoms interrogatifs souffrent syst&#233;matiquement
d&#8217;un remplacement du u par une apostrophe (q&#8217;elle au lieu de quel) ou pour un autre enfant
d&#8217;un ajout d&#8217;apostrophe (qu&#8217;el au lieu de quel). Ces r&#233;gularit&#233;s pour un m&#234;me utilisateur sug-
g&#232;rent la possibilit&#233; de d&#233;finir des mod&#232;les individuels d&#8217;erreurs mod&#233;lisant les transitions des
orthographes erron&#233;es vers les orthographes correctes. Cependant la d&#233;finition d&#8217;un mod&#232;le g&#233;-
n&#233;rique pour tous les utilisateurs se r&#233;v&#232;le impossible, &#233;tant donn&#233; que comme ces exemples le
confirment, il existe autant de dyslexies que de dyslexiques. D&#8217;autre part la d&#233;finition de mo-
d&#232;les individuels devrait n&#233;cessairement &#234;tre dynamique car les utilisateurs sont g&#233;n&#233;ralement
en cours d&#8217;apprentissage et les type d&#8217;erreurs peuvent &#233;voluer.
</p>
<p>265</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON, Patrice BELLOT, Philippe BLACHE
</p>
<p>3 Un syst&#232;me de r&#233;&#233;criture d&#233;di&#233;
</p>
<p>La r&#233;&#233;criture peut se faire &#224; l&#8217;aide d&#8217;un correcteur orthographique &#233;tant donn&#233; qu&#8217;ils proposent
g&#233;n&#233;ralement plusieurs alternatives pour chaque mot rencontr&#233; hors de leur lexique. Cependant
comme le d&#233;montre l&#8217;&#233;tude publi&#233;e dans (James &amp; Draffan, 2004) les correcteurs grand pu-
blic ne r&#233;pondent g&#233;n&#233;ralement pas aux besoins sp&#233;cifiques des dyslexiques, qui ont tendance
&#224; produire un mauvais d&#233;coupage en mots ainsi qu&#8217;&#224; la substitution d&#8217;homophones (lesquels
homophones se trouvent g&#233;n&#233;ralement dans le lexique et ne sont donc pas rep&#233;r&#233;s).
</p>
<p>Des mod&#232;les pour la correction orthographique d&#233;di&#233;e ont &#233;t&#233; propos&#233;s. Ainsi (Loosemore,
1991) propose une mod&#233;lisation globale des erreurs commises par des dyslexiques, arguant que
la dyslexie implique des erreurs aggrav&#233;es mais pas diff&#233;rentes par rapport &#224; celles produites
par des non dyslexiques. De la m&#234;me mani&#232;re, (Deorowicz &amp; Ciura, 2005) proposent des r&#233;-
seaux de confusions repr&#233;sent&#233;s par des automates, o&#249; les alternatives sont issues de mod&#232;les de
confusion graphiques suppos&#233;s mod&#233;liser les causes d&#8217;erreurs. On se rend bien compte avec un
corpus tel que celui que nous avons recueilli que ces mod&#232;les g&#233;n&#233;riques peuvent rapidement
prendre des proportions consid&#233;rables. (Spooner, 1998), toujours en partant de l&#8217;id&#233;e qu&#8217;une
erreur commise par un dyslexique ne se diff&#233;rencie que par son niveau de gravit&#233;, propose
des mod&#232;les sp&#233;cifiques &#224; chaque utilisateur. Le correcteur qu&#8217;il impl&#233;mente &#224; l&#8217;aide de ces
mod&#232;les obtient des performances comparables &#224; celles des correcteurs orthographiques grand
public. Enfin, (Toutanova &amp; Moore, 2002) propose une approche qui combine des mod&#232;les de
lettres et de phon&#232;mes sur les mots, en se basant sur les approches probabilistes de canal bruit&#233;
introduites par (Brill &amp; Moore, 2000). L&#8217;ensemble de ces syst&#232;mes permettent de corriger des
mots hors d&#8217;un lexique mais ne tiennent pas compte des homophones. (Pedler, 2001) propose
une d&#233;tection de telles erreurs &#224; l&#8217;aide de contextes syntaxiques et s&#233;mantiques, sur la base
d&#8217;ensembles de confusion.
</p>
<p>Cependant toutes ces applications fonctionnent sur le postulat que les s&#233;quences de mots sont
correctement identifiables, et que les erreurs sont isol&#233;es (pour les syst&#232;mes utilisant les in-
formations syntaxiques et s&#233;mantiques notamment). Cependant, comme le montre l&#8217;analyse de
notre corpus, un traitement au niveau de la phrase s&#8217;impose. La majorit&#233; des erreurs &#233;tant de
nature graph&#233;mique et non phon&#233;tique, cela sugg&#232;re un traitement phon&#233;tique au niveau de
la phrase enti&#232;re. Cela l&#232;ve &#224; la fois le probl&#232;me de la segmentation en mots et celui des ho-
mophones. Les outils de la reconnaissance automatique de la parole offrent des performances
int&#233;ressantes en se fondant sur des mod&#232;les de langage.
</p>
<p>3.1 Combinaison d&#8217;alternatives graph&#233;miques et phonologiques pour l&#8217;in-
terpr&#233;tation
</p>
<p>Une fois oralis&#233;es, la plupart des phrases de notre corpus deviennent compr&#233;hensibles et inter-
pr&#233;tables par des &#234;tres humains. A partir de ce constat, nous avons &#233;mis l&#8217;id&#233;e d&#8217;un syst&#232;me
automatique fonctionnant sur ce principe, en encha&#238;nant une phon&#233;tisation de la phrase et une
transcription du signal ainsi g&#233;n&#233;r&#233;. En pratique le passage par un signal audio n&#8217;est pas n&#233;ces-
saire, on peut se contenter d&#8217;un passage par une s&#233;quence de phon&#232;mes en sortie du phon&#233;tiseur
et en entr&#233;e du syst&#232;me de reconnaissance. Le phon&#233;tiseur s&#8217;appuie sur un ensemble de r&#232;gles
de conversion graph&#232;me-phon&#232;mes ainsi que sur un lexique phon&#233;tis&#233; de la langue. Le syst&#232;me
de reconnaissance s&#8217;appuie sur un mod&#232;le de langage ainsi qu&#8217;un lexique phon&#233;tique pour pro-
duire plusieurs hypoth&#232;ses de transcription, dont le contenu verbal se limite au lexique utilis&#233;.
</p>
<p>266</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;&#233;criture de phrases dysorthographi&#233;es
</p>
<p>Graphe de 
phon&#232;mes
</p>
<p>Accepteur : mod&#232;le 
de langage
</p>
<p>Transducteur : 
lexique phon&#233;tique
</p>
<p>QUESTIONS
REECRITES
</p>
<p>Phon&#233;tiseur : LIA_Phon
</p>
<p>Transcription :
FSM compose
</p>
<p>QUESTION
INITIALE
</p>
<p>Graphe
d'hypoth&#232;ses
</p>
<p>de mots
</p>
<p>Correcteur orthographique : Aspell
</p>
<p>Lexique
phon&#233;tique
</p>
<p>R&#232;gles de 
conversion
</p>
<p>Graphe de 
phon&#232;mes
</p>
<p>&#233;tendu
</p>
<p>extension Matrice de 
confusion
</p>
<p>FIG. 1 &#8211; Etapes de la r&#233;&#233;criture d&#8217;une question : &#233;tat initial et final, repr&#233;sentations interm&#233;-
diaires, outils pour les transitions entre les repr&#233;sentations, donn&#233;es utilis&#233;es par ces outils
</p>
<p>En pratique, nous nous sommes rendus compte qu&#8217;en se contentant d&#8217;une unique s&#233;quence de
phon&#232;mes correspondant &#224; la phrase, nous perdions trop d&#8217;informations. Ainsi les confusions
phon&#233;tiques (entre les voyelles ouvertes et ferm&#233;es notamment) n&#8217;&#233;taient pas prises en compte.
Il faut donc construire un graphe de phon&#232;mes et non pas une s&#233;quence de phon&#232;mes. D&#8217;autre
part, les omissions et les inversions de lettres ne peuvent pas &#234;tre trait&#233;es si l&#8217;on s&#8217;en tient
aux r&#232;gles de conversion, et g&#233;n&#233;rer toutes les possibilit&#233;s de ce type (en g&#233;n&#233;rant des arcs
suppl&#233;mentaires dans le graphe de phon&#232;mes) risquerait d&#8217;apporter trop de confusions. Une
solution &#224; cela est de g&#233;n&#233;rer un graphe d&#8217;hypoth&#232;ses de mots qui repr&#233;sente la s&#233;quence &#233;crite,
puis de phon&#233;tiser toutes les phrases issues de ce graphe de mots afin de g&#233;n&#233;rer un graphe de
phon&#232;mes plus complet. Les hypoth&#232;ses de mots peuvent &#234;tre obtenues &#224; l&#8217;aide d&#8217;un correcteur
orthographique, la plupart se basant sur des distances d&#8217;&#233;dition. Le graphe de la figure 1 illustre
ce processus.
</p>
<p>Dans les graphes repr&#233;sentant la phrase aux &#233;tapes interm&#233;diaires, les arcs portent les co&#251;ts
de transition associ&#233;s aux phon&#232;mes ou aux mots qu&#8217;ils portent &#233;galement, et les noeuds sont
les &#233;tapes qui s&#233;quencent la phrase. Ainsi les diff&#233;rentes phrases hypoth&#232;ses graphiques ou
phon&#233;tiques ont un co&#251;t associ&#233; correspondant &#224; la somme des co&#251;ts de transition du chemin
emprunt&#233;. Le chemin correspondant exactement &#224; ce qui a &#233;t&#233; &#233;crit doit avoir un co&#251;t nul, et
plus on s&#8217;en &#233;carte plus le co&#251;t doit &#234;tre important.
</p>
<p>On attribue un poids Wg aux mots alternatifs H (hypoth&#232;ses graph&#233;miques) propos&#233;s par le
correcteur orthographique :
</p>
<p>Wg(H) = f(d(H, I)), (1)
</p>
<p>267</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON, Patrice BELLOT, Philippe BLACHE
</p>
<p>o&#249; f est une fonction de normalisation de la distance d(H, I) entre l&#8217;hypoth&#232;se propos&#233;e et le
mot initialement &#233;crit. Cette distance peut &#234;tre fournie par le correcteur, ou calcul&#233;e a posteriori
(distance d&#8217;&#233;dition par exemple).
</p>
<p>On attribue un poids Wp aux alternatives phon&#233;tiques H (hypoth&#232;ses phon&#233;tiques) obtenues &#224;
l&#8217;aide d&#8217;une matrice de confusion :
</p>
<p>Wp(H) = g(m(H, I)), (2)
</p>
<p>o&#249; g est une fonction de normalisation d&#8217;une distancem(H, I) entre le phon&#232;me alternatif et le
phon&#232;me initial. Cette distance peut faire partie int&#233;grante de la matrice de confusion.
</p>
<p>3.2 Mise en application
</p>
<p>Le cadre th&#233;orique et applicatif propos&#233; par les machines &#224; &#233;tats finis (FSM) (Mohri et al.,
2002) pour la reconnaissance automatique de la parole correspond &#224; nos besoins de repr&#233;sen-
tations interm&#233;diaires en graphes, &#224; travers leur impl&#233;mentation dans le AT&amp;T FSM Toolkit
(Mohri et al., 1997). En effet l&#8217;impl&#233;mentation de mod&#232;les de langages dans le formalisme des
automates telle que propos&#233;e par (Allauzen &amp; Mohri, 2005) avec la biblioth&#232;que grm permet
de les utiliser pour d&#233;coder un automate construit &#224; partir du graphe de phon&#232;mes &#233;tendu, &#224;
condition de le coupler avec un transducteur permettant de faire correspondre des s&#233;quences de
phon&#232;mes &#224; des mots &#233;crits. Il s&#8217;agit alors de rechercher les meilleurs chemins en fonction des
co&#251;ts de transition associ&#233;s dans le graphe compos&#233; des hypoth&#232;ses phon&#233;tiques, du mod&#232;le de
langage et du transducteur d&#233;duit du lexique phon&#233;tique. Le mod&#232;le de langage est appris sur
un mois d&#8217;articles du journal Le Monde disponibles dans le corpus de la campagne EQUER.
</p>
<p>0 1
</p>
<p>koman/0
</p>
<p>coma/0.1
</p>
<p>comas/0.1
</p>
<p>roman/0.1
</p>
<p>2
</p>
<p>sapel/0
</p>
<p>sape/0.1
</p>
<p>sap/0.1
</p>
<p>sahel/0.1
</p>
<p>3
le/0
</p>
<p>4
mer/0
</p>
<p>5
de/0
</p>
<p>6/0
</p>
<p>batia/0
</p>
<p>Bastia/0.1
</p>
<p>bat-ia/0.1
</p>
<p>FIG. 2 &#8211; Graphe de mots pour la phrase koman sapel le mer de batia
</p>
<p>Les hypoth&#232;ses graph&#233;miques permettant de g&#233;n&#233;rer le graphe de mots sont obtenues &#224; l&#8217;aide
du correcteur orthographique libre GNU ASPELL 2. En mode badspellers, il utilise &#224; la fois des
distances de Levenshtein (distance d&#8217;&#233;dition, &#233;gale au nombre minimal de caract&#232;res qu&#8217;il faut
supprimer, ins&#233;rer, ou remplacer pour passer du mot &#233;crit aux mots du lexique) et des distances
phonologiques (distance d&#8217;&#233;dition bas&#233;e sur les phon&#232;mes) pour proposer des alternatives au
mots rencontr&#233;s hors de son lexique. Ce correcteur montre de bonnes performances par rapport
aux autres outils commerciaux et libres grand public 3. La figure 2 montre un exemple de graphe
de mots ainsi construit. La phon&#233;tisation est effectu&#233;e &#224; l&#8217;aide de l&#8217;outil LIA_phon (Bechet,
2001), qui dispose &#224; la fois d&#8217;un lexique phon&#233;tique de 80 000 mots et d&#8217;un syst&#232;me de 1996
r&#232;gles de conversions ordonn&#233;es des plus g&#233;n&#233;rales aux plus exceptionnelles. La combinaison
</p>
<p>2http://aspell.sourceforge.net
3http://aspell.net/test/
</p>
<p>268</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;&#233;criture de phrases dysorthographi&#233;es
</p>
<p>de ces deux ressources rend la phon&#233;tisation robuste, ce qui est essentiel compte tenu des d&#233;-
gradations orthographiques qui peuvent &#234;tre rencontr&#233;es. La matrice de confusion pour obtenir
le graphe de phon&#232;mes &#233;tendu contient uniquement les confusions entre les voyelles ouvertes
et ferm&#233;es. Par la suite elle pourra &#234;tre &#233;tendue &#224; l&#8217;aide de mod&#232;les de confusion phon&#233;tiques
appris sur un grand corpus. La figure 3 illustre le graphe de phon&#232;mes &#233;tendus correspondant
au graphe de mots de la figure 2.
</p>
<p>0
</p>
<p>1kk/0
</p>
<p>2
</p>
<p>rr/19.29
</p>
<p>3oo/0
</p>
<p>4
au/0.099
</p>
<p>143
</p>
<p>oo/0.900 144
au/0
</p>
<p>5mm/0
</p>
<p>101mm/0
</p>
<p>145
mm/0
</p>
<p>146mm/0
</p>
<p>6
an/0
</p>
<p>7
</p>
<p>aa/20.20
</p>
<p>102
an/0
</p>
<p>103
</p>
<p>aa/19.20
</p>
<p>8ss/0
</p>
<p>65
</p>
<p>ss/0
</p>
<p>9aa/0
</p>
<p>66
</p>
<p>aa/0
</p>
<p>10
pp/0
</p>
<p>11
</p>
<p>ai/20.09
</p>
<p>12
</p>
<p>ei/19.20
</p>
<p>13ai/0
</p>
<p>14
ei/0.099
</p>
<p>15
ll/19.09
</p>
<p>62
ll/0
</p>
<p>64
</p>
<p>ll/0
</p>
<p>16ll/0
</p>
<p>48
ll/0
</p>
<p>18
</p>
<p>ee/0
</p>
<p>63
</p>
<p>ll/0
</p>
<p>ll/0
</p>
<p>ee/19.20
</p>
<p>17
ll/0
</p>
<p>49
</p>
<p>ll/0
</p>
<p>50
</p>
<p>ee/20
</p>
<p>39mm/0
</p>
<p>19
ee/0
</p>
<p>20mm/0
</p>
<p>40
</p>
<p>ai/0.900
</p>
<p>41ei/0
</p>
<p>21
</p>
<p>ai/0
</p>
<p>22
</p>
<p>ei/0.099
</p>
<p>23rr/0
</p>
<p>36rr/0
</p>
<p>24dd/0
</p>
<p>37dd/0
</p>
<p>25/16ee/0
</p>
<p>26
</p>
<p>pp/23
</p>
<p>27
</p>
<p>bb/0
</p>
<p>28
aa/0
</p>
<p>34aa/0
</p>
<p>29ss/0
</p>
<p>35ss/0
</p>
<p>30tt/0
</p>
<p>31
ii/0
</p>
<p>32yy/0 33/0aa/0
tt/0
</p>
<p>38/15ee/0
</p>
<p>pp/22
</p>
<p>bb/0
</p>
<p>42rr/0
</p>
<p>45rr/0
</p>
<p>43dd/0
</p>
<p>46dd/0
</p>
<p>44/8ee/0
</p>
<p>pp/22
</p>
<p>bb/0
</p>
<p>47/7ee/0
</p>
<p>pp/21
</p>
<p>bb/0
</p>
<p>51ee/0
</p>
<p>57mm/0
</p>
<p>52mm/0
</p>
<p>ei/0
</p>
<p>58
</p>
<p>ai/0.900
</p>
<p>ai/0
</p>
<p>53
ei/0.099
</p>
<p>54rr/0 55dd/0 56/14ee/0
</p>
<p>pp/21
</p>
<p>bb/0
</p>
<p>59rr/0 60dd/0 61/9ee/0
</p>
<p>pp/23
</p>
<p>bb/0
</p>
<p>ee/0
</p>
<p>67
</p>
<p>pp/0
</p>
<p>68
</p>
<p>ai/19.90
</p>
<p>69
ei/18
</p>
<p>70
</p>
<p>ai/0.900 71
</p>
<p>ei/0
</p>
<p>72
ll/17.90
</p>
<p>98
</p>
<p>ll/0
</p>
<p>100ll/0
</p>
<p>73ll/0
</p>
<p>91ll/0
</p>
<p>75ee/0
</p>
<p>99ll/0
</p>
<p>ll/0
</p>
<p>ee/17.09
</p>
<p>74ll/0
</p>
<p>ll/0
</p>
<p>92
</p>
<p>ee/19.90
</p>
<p>82mm/0
</p>
<p>76ee/0 77mm/0
</p>
<p>84
</p>
<p>ei/0
</p>
<p>83ai/1.900
</p>
<p>ei/0
</p>
<p>78ai/0.900 79rr/0 80
dd/0 81/10ee/0
</p>
<p>pp/24
</p>
<p>bb/0
</p>
<p>88rr/0
</p>
<p>85rr/0 86dd/0
</p>
<p>89dd/0
</p>
<p>87/2ee/0
</p>
<p>pp/23
</p>
<p>bb/0
</p>
<p>90/1ee/0
</p>
<p>pp/22
</p>
<p>bb/0
</p>
<p>93mm/0
</p>
<p>ei/0
</p>
<p>94ai/1.900 95rr/0 96
dd/0
</p>
<p>97/3
ee/0
</p>
<p>pp/24
</p>
<p>bb/0
</p>
<p>ee/0
</p>
<p>104
ss/0
</p>
<p>127
ss/0
</p>
<p>105
</p>
<p>aa/0
</p>
<p>128
</p>
<p>aa/0
</p>
<p>ai/19.09
</p>
<p>106
</p>
<p>pp/0
</p>
<p>107
ei/18.20
</p>
<p>108
ai/0
</p>
<p>109
ei/0.099
</p>
<p>110ll/18.09
</p>
<p>126
ll/0
</p>
<p>111ll/0
</p>
<p>118ll/0
</p>
<p>112
</p>
<p>ee/0
</p>
<p>ll/0
</p>
<p>ll/0
</p>
<p>ee/18.20
</p>
<p>ee/19
</p>
<p>119ll/0
</p>
<p>113mm/0
</p>
<p>ai/0.900
</p>
<p>114
ei/0
</p>
<p>115rr/0 116
dd/0 117/6ee/0
</p>
<p>pp/20
</p>
<p>bb/0
</p>
<p>120ee/0 121mm/0
</p>
<p>ai/0
</p>
<p>122
</p>
<p>ei/0.099
</p>
<p>123rr/0 124dd/0 125/13ee/0
</p>
<p>pp/20
</p>
<p>bb/0
</p>
<p>ai/18.90
</p>
<p>129pp/0
</p>
<p>130
</p>
<p>ei/17
</p>
<p>131
ai/0.900
</p>
<p>132ei/0
</p>
<p>133
</p>
<p>ll/16.90
</p>
<p>142
ll/0
</p>
<p>134
</p>
<p>ll/0
</p>
<p>141
</p>
<p>ll/0
</p>
<p>135
</p>
<p>ee/0
</p>
<p>ll/0
</p>
<p>ll/0
</p>
<p>ee/16.09
</p>
<p>ll/0
</p>
<p>ee/18.90
136mm/0
</p>
<p>ai/1.900
</p>
<p>137
</p>
<p>ei/0
</p>
<p>138rr/0 139dd/0 140/0ee/0
</p>
<p>pp/21
</p>
<p>bb/0
</p>
<p>an/0
</p>
<p>an/0
</p>
<p>0
</p>
<p>1kk/0
</p>
<p>2
</p>
<p>rr/19.29
</p>
<p>3oo/0
</p>
<p>4
au/0.099
</p>
<p>143
</p>
<p>oo/0.900 144
au/0
</p>
<p>5mm/0
</p>
<p>101mm/0
</p>
<p>145
mm/0
</p>
<p>146mm/0
</p>
<p>FIG. 3 &#8211; Graphe de phon&#232;mes &#233;tendu de la phrase koman sapel le mer de batia
</p>
<p>Phrase Score
comment s&#8217;appelle le maire de bail &#224; 52,2848701
comment s&#8217;appelle le maire de bahia 54,6559029
comment s&#8217;appelle le maire de bastia 54,8422737
</p>
<p>TAB. 2 &#8211; R&#233;&#233;critures les plus probables de koman sapel le mer de batia
</p>
<p>Les fonctions de co&#251;t normalis&#233; associ&#233;es aux alternatives graph&#233;miques ou phon&#233;tiques des
&#233;quations (1) et (2) ont &#233;t&#233; &#233;tablies de mani&#232;re empirique avec les valeurs suivantes :
</p>
<p>f(d(H, I)) =
</p>
<p>{
0 if H = I
0.1 if H != I (3)
</p>
<p>g(m(H, I)) =
</p>
<p>{
0 if H = I
0.1 if H != I (4)
</p>
<p>Ainsi la recherche du meilleur chemin dans le graphe final compos&#233; du graphe d&#8217;hypoth&#232;ses
phon&#233;tiques, de l&#8217;accepteur du mod&#232;le de langage et du transducteur du lexique phon&#233;tique
prend en compte les co&#251;ts de transition issus de chacun des automates, et permet d&#8217;affecter
des scores &#224; tous les chemins. Le tableau 2 repr&#233;sente les trois hypoth&#232;ses les plus probables,
qui correspondent aux chemins de co&#251;t minimal dans le graphe de la figure 3, et les co&#251;ts de
chacune de ces hypoth&#232;ses. Dans ce cas, l&#8217;hypoth&#232;se attendue est la troisi&#232;me et son score est
proche des deux premi&#232;res. Les phrases improbables ont des scores au del&#224; de 100.
</p>
<p>4 &#201;valuation
</p>
<p>Pour l&#8217;&#233;valuation, nous avons constitu&#233; une r&#233;f&#233;rence de la m&#234;me mani&#232;re que l&#8217;on transcrit ma-
nuellement les textes audio pour tester la reconnaissance : nous avons effectu&#233; une transcription
</p>
<p>269</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON, Patrice BELLOT, Philippe BLACHE
</p>
<p>manuelle des phrases tap&#233;es par les enfants de mani&#232;re &#224; s&#8217;approcher au mieux de leur intention.
Il n&#8217;y a pas d&#8217;ambigu&#239;t&#233;s dans les choix de transcription puisque l&#8217;on conna&#238;t par avance l&#8217;objet
des questions. La plate forme d&#8217;&#233;valuation des outils de reconnaissance de la parole SCTK 4
inclut l&#8217;outil SCLITE qui impl&#233;mente un algorithme de programmation dynamique pour calcu-
ler des taux d&#8217;erreurs mots dans le meilleur des cas entre une phrase de r&#233;f&#233;rence et la phrase
correspondante qui peut contenir plusieurs hypoth&#232;ses (repr&#233;sent&#233;es par un graphe de mots), en
prenant en compte les insertions, omissions et les substitutions.
</p>
<p>Dans le cadre d&#8217;une r&#233;&#233;criture en entr&#233;e d&#8217;un syst&#232;me de recherche d&#8217;information, il n&#8217;est pas
n&#233;cessaire que tous les mots de la question soient corrects ni qu&#8217;ils soient bien accord&#233;s. En
effet la plupart des syst&#232;mes effectuent en premier lieu une lemmatisation et un filtrage des re-
qu&#234;tes, c&#8217;est &#224; dire que les mots outils sont retir&#233;s et les mots fl&#233;chis sont ramen&#233;s &#224; leur forme
de base. Par exemple la phrase Comment s&#8217;appellent le maires des Bastia sera trait&#233;e &#224; l&#8217;iden-
tique de Comment s&#8217;appelle le maire de Bastia via la phrase lemmatis&#233;e Comment se appeller
maire Bastia. Ainsi nous proposons pour l&#8217;&#233;valuation de comparer les versions lemmatis&#233;es des
phrases de r&#233;f&#233;rences et des phrases r&#233;&#233;crites. De plus en accord avec un mod&#232;le &#233;tendu pour
les hypoth&#232;ses de la requ&#234;te en entr&#233;e des syst&#232;mes, l&#8217;&#233;valuation peut prendre en compte par
exemple les trois premi&#232;res hypoth&#232;ses du syst&#232;me de r&#233;&#233;criture, ou uniquement la premi&#232;re
hypoth&#232;se. Les hypoth&#232;ses fournies par le syst&#232;me de combinaison &#233;tant ind&#233;pendantes, dans le
cas de l&#8217;&#233;valuation des trois premi&#232;res hypoth&#232;ses c&#8217;est le score de la phrase propos&#233;e la plus
proche de la r&#233;f&#233;rence qui sera retourn&#233;e.
</p>
<p>Afin de comparer les performances de la combinaison phon&#233;tique et graph&#233;mique avec l&#8217;uti-
lisation d&#8217;un correcteur orthographique pour la r&#233;&#233;criture, nous avons &#233;valu&#233; un syst&#232;me de
r&#233;&#233;criture bas&#233; uniquement sur les hypoth&#232;ses fournies par Aspell, qui correspondent en r&#233;alit&#233;
aux graphes de mots tel que celui de la figure 2. Dans ce cas, l&#8217;&#233;valuation des trois premi&#232;res
hypoth&#232;ses correspond &#224; l&#8217;&#233;valuation du chemin le plus proche de la r&#233;f&#233;rence.
</p>
<p>Le tableau 3 contient les r&#233;sultats de l&#8217;&#233;valuation par SCLITE des phrases d&#8217;origine (Initial),
des premi&#232;res hypoth&#232;ses du syst&#232;me graph&#233;miques (Asp 1) et du syst&#232;me de combinaison
(FSM 1), ainsi que des trois premi&#232;res hypoth&#232;ses fournies par ces syst&#232;mes (Asp 3 et FSM 3).
L&#8217;&#233;valuation est effectu&#233;e selon deux crit&#232;res diff&#233;rents : le taux d&#8217;erreurs mots prend en compte
&#224; la fois les insertions, substitutions et omissions de mots, il faut le minimiser ; le pourcentage
de phrases correctes constitue un aper&#231;u des cas o&#249; l&#8217;on est certain que le syst&#232;me aura la
possibilit&#233; de r&#233;pondre, &#233;tant donn&#233; qu&#8217;il contient les m&#234;me informations que la phrase de
r&#233;f&#233;rence (il contient &#233;galement des informations bruit&#233;es dans le cas o&#249; l&#8217;on consid&#232;re plusieurs
hypoth&#232;ses de r&#233;&#233;criture), il faut le maximiser. Les r&#233;sultats pour les trois premi&#232;res hypoth&#232;ses
</p>
<p>Mesure Initial Asp 1 Asp 3 FSM 1 FSM 3
Taux d&#8217;erreur 51 36 31 23 20
</p>
<p>% phrases correctes 5 13 19 43 46
</p>
<p>TAB. 3 &#8211; Taux d&#8217;erreur et pourcentage de phrases identiques &#224; la r&#233;f&#233;rence apr&#232;s lemmatisation
et filtrage sur les phrases tap&#233;es initialement ou r&#233;&#233;crites &#224; l&#8217;aide de Aspell (Asp) ou de notre
syst&#232;me (FSM), si l&#8217;on consid&#232;re la premi&#232;re ou les trois premi&#232;res hypoth&#232;ses.
</p>
<p>montrent que si l&#8217;am&#233;lioration en terme de taux d&#8217;erreurs est d&#233;j&#224; importante dans l&#8217;absolu (on
le divise par 2,5 par rapport &#224; l&#8217;initial), elle l&#8217;est aussi par rapport &#224; un correcteur orthographique
performant (le taux d&#8217;erreur est 1,5 fois plus bas). Les r&#233;sultats en termes de taux d&#8217;erreurs sont
</p>
<p>4http://www.nist.gov/speech/tools
</p>
<p>270</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;&#233;criture de phrases dysorthographi&#233;es
</p>
<p>&#233;galement probants si l&#8217;on ne consid&#232;re que la premi&#232;re hypoth&#232;se du syst&#232;me par combinaison,
ce qui laisse &#224; penser que l&#8217;ajout de bruit qu&#8217;apporterait des hypoth&#232;ses multiples sera peut &#234;tre
plus n&#233;faste que la perte engendr&#233;e par la conservation d&#8217;une seule hypoth&#232;se. Cela est confirm&#233;
par les r&#233;sultats au niveau des phrases. En effet, on atteint 43 % de phrases identiques &#224; la
r&#233;f&#233;rence apr&#232;s filtrage et lemmatisation de la premi&#232;re hypoth&#232;se FSM, alors qu&#8217;il n&#8217;y en avait
que 5 % &#224; l&#8217;origine et qu&#8217;on atteint moins de 20 % avec Aspell. La diff&#233;rence avec l&#8217;&#233;valuation
des trois premi&#232;res hypoth&#232;ses FSM montre que la suggestion correcte se trouve en seconde ou
troisi&#232;me position seulement dans de rares cas.
</p>
<p>Les r&#233;sultats obtenus par les premi&#232;res hypoth&#232;ses du syst&#232;me de r&#233;&#233;criture par combinaison
sont tr&#232;s bons d&#8217;autant qu&#8217;il n&#8217;y a pas de d&#233;gradation des parties de phrases d&#233;j&#224; correctes, et il
est int&#233;ressant d&#8217;observer leur r&#233;partition en fonction des individus et des th&#232;mes abord&#233;s (les
th&#232;mes &#233;tant les questions d&#8217;origine). Cette r&#233;partition consign&#233;e dans le tableau 4 montre que
si les variations existent entre les individus, &#224; part pour 1 et 4, elles ne sont pas tr&#232;s significatives
&#233;tant donn&#233; qu&#8217;elles s&#8217;appliquent sur cinq exemples au maximum. La r&#233;partition des r&#233;sultats
par th&#232;me montre en revanche une nette diff&#233;rence, et l&#8217;on remarque notamment que les th&#232;mes
de questions 1 et 2 maintiennent des taux d&#8217;erreurs importants et que le syst&#232;me ne parvient
&#224; une phrase lemmatis&#233;e identique &#224; la r&#233;f&#233;rence dans aucun cas. La raison de ces erreurs est
que les noms propres associ&#233;s &#224; ces questions ne se trouvent ni dans le lexique phon&#233;tique ni
dans le mod&#232;le de langage et sont par cons&#233;quent impossibles &#224; proposer dans les hypoth&#232;ses.
Cela sugg&#232;re que les performances du syst&#232;me par combinaison de processus graph&#233;miques et
phon&#233;tiques pourront encore &#234;tre am&#233;lior&#233;s par un enrichissement dynamique des ressources, ou
par un enrichissement statique se basant sur l&#8217;ensemble du corpus sur lesquelles les questions
sont pos&#233;es. En effet le mod&#232;le de langage a ici &#233;t&#233; appris sur un sous ensemble du corpus
EQUER, et on peut imaginer y ajouter les phrases contenant des mots inconnus du lexique et
du mod&#232;le initial.
</p>
<p>Taux d&#8217;erreur Taux % phrases
Pers initial d&#8217;erreur correctes
1 36 9 75
2 67 39 40
3 49 18 40
4 50 30 20
5 73 12 60
6 30 27 40
7 46 21 40
8 60 30 50
</p>
<p>Taux d&#8217;erreur Taux % phrases
Th&#232;me initial d&#8217;erreur correctes
</p>
<p>1 58 47 0
2 52 42 0
3 40 0 100
4 43 17 62
5 65 11 57
</p>
<p>TAB. 4 &#8211; Distribution des performances de notre syst&#232;me sur la premi&#232;re hypoth&#232;ses propos&#233;e,
par personne (Pers) ou par th&#232;me de question, selon les mesures de taux d&#8217;erreur mot et de
pourcentage de phrases identiques &#224; la correction, par rapport au taux d&#8217;erreur mot initial.
</p>
<p>5 Conclusion
</p>
<p>Les performances obtenues par un syst&#232;me combinant des aspects graph&#233;miques et phon&#233;tiques
au niveau de la phrase enti&#232;re permettent de proposer des r&#233;&#233;critures qui multiplient par 8 le
nombre de questions correctes une fois lemmatis&#233;es, et donc d&#8217;autant les performances d&#8217;un
syst&#232;me de questions r&#233;ponses pour des questions tap&#233;es par des enfants dyslexiques. L&#8217;&#233;valua-
tion des phrases filtr&#233;es et lemmatis&#233;es montre que l&#8217;on peut faire descendre le taux d&#8217;erreurs
</p>
<p>271</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON, Patrice BELLOT, Philippe BLACHE
</p>
<p>de 51 % &#224; 23 % en consid&#233;rant uniquement la premi&#232;re hypoth&#232;se, alors qu&#8217;un correcteur or-
thographique performant ne permet de descendre qu&#8217;&#224; 36 %. Une analyse en profondeur des
erreurs r&#233;siduelles montre qu&#8217;il est encore possible d&#8217;am&#233;liorer nettement les performances &#224;
l&#8217;aide de mod&#232;les de langages et de lexiques plus adapt&#233;s, soit plus complets soit dynamiques.
</p>
<p>R&#233;f&#233;rences
ALLAUZEN C. &amp; MOHRI M. (2005). The design principles and algorithms of a weighted
grammar library. International Journal of Foundations of Computer Science, 16(3), 403&#8211;421.
AYACHE C., GRAU B. &amp; VILNAT A. (2006). Equer : the french evaluation campaign of ques-
tion answering system equer/evalda. In 5th international Conference on Language Resources
and Evaluation (LREC 2006), p. 1157&#8211;1160, Genoa, Italy.
BECHET F. (2001). Lia_phon - un systeme complet de phonetisation de textes. Traitement
Automatique des Langues (T.A.L.), 42(1).
BRILL E. &amp; MOORE R. C. (2000). An improved error model for noisy channel spelling
correction. In Proceedings of the 38th Annual Meeting of the ACL, p. 286&#8211;293.
DEOROWICZ S. &amp; CIURA M. G. (2005). Correcting spelling errors by modelling their causes.
International journal of applied mathematics and computer science, 15(2), 275&#8211;285.
GILLARD L., BELLOT P. &amp; EL-B&#200;ZE M. (2005). Le lia &#224; equer (campagne technolangue des
syst&#232;mes questions-r&#233;ponses). In Actes de TALN&#8217;05, Dourdan.
GILLARD L., SITBON L., BELLOT P. &amp; EL-BEZE M. (2006). Dernieres evolutions de squa-
lia, le systeme de questions/reponses du lia. Traitement Automatique des Langues (TAL).
GILLON G. T. (2004). Phonological Awareness- From Research to Practice. Guilford Press.
JAMES A. &amp; DRAFFAN E. (2004). The accuracy of electronic spell checkers for dyslexic
learners. PATOSS bulletin.
L&#201;T&#201; B., SPRENGER-CHAROLLES L. &amp; COL&#201; P. (2004). Manulex : A grade-level lexical
database from french elementary-school readers. Behavior Research Methods, Instruments,
and Computers, 36, 156&#8211;166.
LOOSEMORE R. P. W. (1991). A neural net model of normal and dyslexic spelling. In
International Joint Conference on Neural Networks, volume 2, p. 231&#8211;236, Seattle, USA.
MOHRI M., PEREIRA F. C. N. &amp; RILEY M. (2002). Weighted finite-state transducers in
speech recognition. Computer Speech and Language, 16(1), 69&#8211;88.
MOHRI M., PEREIRA F. C. N. &amp; RILEY M. D. (1997). At&amp;t fsm librarytm &#8211; finite-state
machine library.
PEDLER J. (2001). The detection and correction of real-word spelling errors in dyslexic text.
In Proceedings of the 4th Annual CLUK Colloquium.
SPOONER R. (1998). A spelling checker for dyslexic users : user modelling for error recovery.
PhD thesis, Human Computer Interaction Group, Department of Computer Science, University
of York, Heslington, York,.
TOUTANOVA K. &amp; MOORE R. C. (2002). Pronunciation modeling for improved spelling
correction. In Proceedings of the 40th annual meeting of ACL, p. 144&#8211;151, Philadelphia.
</p>
<p>272</p>

</div></div>
</body></html>