<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse automatique de sondages t&#233;l&#233;phoniques d&#8217;opinion</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Analyse automatique de sondages t&#233;l&#233;phoniques d&#8217;opinion&#8727;
</p>
<p>Nathalie CAMELIN1, Fr&#233;d&#233;ric B&#201;CHET1
</p>
<p>G&#233;raldine DAMNATI2, Renato DE MORI1
1 LIA/CNRS, University of Avignon,
</p>
<p>BP1228, 84911 Avignon cedex 09 France
2 France T&#233;l&#233;com R&amp;D &#8211; TECH/SSTP/RVA, 2 av. Pierre Marzin,
</p>
<p>22307 Lannion Cedex 07, France
{nathalie.camelin,frederic.bechet,renato.demori}@
</p>
<p>univ-avignon.fr
geraldine.damnati@francetelecom.com
</p>
<p>R&#233;sum&#233;. Cette &#233;tude pr&#233;sente la probl&#233;matique de l&#8217;analyse automatique de sondages t&#233;-
l&#233;phoniques d&#8217;opinion. Cette analyse se fait en deux &#233;tapes : tout d&#8217;abord extraire des messages
oraux les expressions subjectives relatives aux opinions de utilisateurs sur une dimension par-
ticuli&#232;re (efficacit&#233;, accueil, etc.) ; puis s&#233;lectionner les messages fiables, selon un ensemble de
mesures de confiance, et estimer la distribution des diverses opinions sur le corpus de test. Le
but est d&#8217;estimer une distribution aussi proche que possible de la distribution de r&#233;f&#233;rence. Cette
&#233;tude est men&#233;e sur un corpus de messages provenant de vrais utilisateurs fournis par France
T&#233;l&#233;com R&amp;D.
</p>
<p>Abstract. This paper introduces the context of the automatic analysis of opinion tele-
phone surveys. This analysis is done by means of two stages : firstly the subjective expressions,
related to the expression of an opinion on a particular dimension (efficiency, courtesy, . . . ), are
extracted from the audio messages ; secondly the reliable messages, according to a set of confi-
dence measures, are selected and the distribution of the positive and negative opinions in these
messages is estimated. The goal is to obtain a distribution as close as possible to the reference
one. This study is carried on a telephone survey corpus, provided by France T&#233;l&#233;com R&amp;D,
obtained in real field conditions.
</p>
<p>Mots-cl&#233;s : d&#233;tection d&#8217;opinions, classification automatique, reconnaissance automa-
tique de la parole, champs conditionnels al&#233;atoires.
</p>
<p>Keywords: opinion extraction, automatic classification, automatic speech recognition,
conditional random fields.
</p>
<p>1 Introduction
</p>
<p>Face &#224; la quantit&#233; grandissante de donn&#233;e disponible, l&#8217;extraction d&#8217;information pertinente est
devenue un des d&#233;fis de ces derni&#232;res ann&#233;es. Plus pr&#233;cis&#233;ment, l&#8217;extraction d&#8217;opinion a r&#233;-
</p>
<p>&#8727;Travaux r&#233;alis&#233;s en collaboration avec France T&#233;l&#233;com&#8217;s R&amp;D, contrat 021B178.
</p>
<p>63</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nathalie CAMELIN, Fr&#233;d&#233;ric B&#201;CHET, G&#233;raldine DAMNATI, Renato DE MORI
</p>
<p>cemment fait l&#8217;objet d&#8217;une grande attention de la part de la communaut&#233; TALN (atelier d&#8217;ACL
2006 Sentiment and Subjectivity in Text, DEFT&#8217;07). Ce domaine a donn&#233; lieu &#224; de nombreuses
publications (Wiebe et al., 2005; Choi et al., 2005) portant principalement sur deux aspects :
la d&#233;tection automatique d&#8217;opinions &#224; partir d&#8217;avis r&#233;dig&#233;s par des consommateurs (Popescu
&amp; Etzioni, 2005) et d&#8217;autre part l&#8217;analyse de la subjectivit&#233; d&#8217;une phrase pour les syst&#232;mes de
r&#233;sum&#233; automatique ou de question/r&#233;ponse (Riloff &amp; Wiebe, 2003).
</p>
<p>Les travaux pr&#233;sent&#233;s dans cette &#233;tude concernent le premier cadre applicatif : la d&#233;tection
automatique d&#8217;opinions &#224; partir de sondage d&#8217;utilisateurs. Il s&#8217;agit ici de sondages t&#233;l&#233;phoniques
effectu&#233;s par France T&#233;l&#233;com aupr&#232;s d&#8217;utilisateurs r&#233;els. Une des principales caract&#233;ristiques
de cette &#233;tude est la d&#233;tection d&#8217;opinions &#224; partir de messages vocaux, contenant de la parole
compl&#232;tement spontan&#233;e, collect&#233;e dans des conditions r&#233;elles.
</p>
<p>A cause des difficult&#233;s intrins&#232;ques &#224; ce type de corpus (bruits, t&#233;l&#233;phone mobile, disfluences,
grande vari&#233;t&#233; d&#8217;accents, nombreuses digressions entra&#238;nant un nombre important de mots hors-
vocabulaire), il est tr&#232;s important de d&#233;velopper des m&#233;thodes robustes, peu sensibles aux er-
reurs de Reconnaissance Automatique de la Parole (RAP). En contrepartie, le nombre d&#8217;opi-
nions susceptibles d&#8217;&#234;tre d&#233;tect&#233;es est forc&#233;ment r&#233;duit. Nous avons pr&#233;sent&#233; dans (Camelin
et al., 2006) une strat&#233;gie de RAP utilisant des mod&#232;les de langage sp&#233;cifiques &#224; la d&#233;tec-
tion d&#8217;opinions afin de limiter le bruit g&#233;n&#233;r&#233; par les portions de messages hors-sujet (ou di-
gressions). La probl&#233;matique des sondages d&#8217;opinions &#224; partir de corpus de messages vocaux
et une strat&#233;gie d&#8217;analyse automatique de ces m&#234;mes sondages a &#233;t&#233; pr&#233;sent&#233;e dans (B&#233;chet
et al., 2006). Les travaux pr&#233;sent&#233;s ici proposent de nouvelles strat&#233;gies mettant l&#8217;accent sur
l&#8217;introduction de connaissances explicites dans le processus de classification automatique. La
d&#233;finition de crit&#232;res de calibrage du syst&#232;me de d&#233;tection, sp&#233;cifiques &#224; la probl&#233;matique des
sondages, est &#233;galement abord&#233;e.
</p>
<p>Cet article est organis&#233; comme suit : le paragraphe 2 formalise le probl&#232;me de la d&#233;tection d&#8217;opi-
nion et de l&#8217;analyse de sondages ; le paragraphe 3 introduit le corpus utilis&#233; dans cette &#233;tude ;
le paragraphe 4 pr&#233;sente les strat&#233;gies de d&#233;tection d&#8217;opinions sur des transcriptions manuelles
des messages et sur des sorties du module de RAP ; enfin la section 5 permet de comparer ces
2 strat&#233;gies et d&#233;taille l&#8217;ajout de connaissances explicites dans la strat&#233;gie analysant les mes-
sages vocaux ; elle expose &#233;galement comment le syst&#232;me peut &#234;tre param&#233;tr&#233; pour le probl&#232;me
particulier de l&#8217;analyse de sondages.
</p>
<p>2 Formulation du probl&#232;me
</p>
<p>L&#8217;analyse automatique d&#8217;opinions &#224; partir de messages collect&#233;s dans des conditions r&#233;elles est
une t&#226;che difficile. Une tr&#232;s grande vari&#233;t&#233; de locuteurs exprime leurs opinions de tr&#232;s nom-
breuses fa&#231;ons, avec des messages de tailles variables, et un grand nombre de r&#233;p&#233;titions, cor-
rections et contradictions. &#193; cette variabilit&#233; des locuteurs s&#8217;ajoute la variabilit&#233; acoustique due
&#224; des environnements et des canaux de transmissions tr&#232;s vari&#233;s (t&#233;l&#233;phones portables, bruits
ambiants). Pour toutes ces raisons, les r&#233;sultats obtenus par les syst&#232;mes de RAP sur ce type de
corpus sont tr&#232;s variables, avec des taux d&#8217;erreurs sur les mots d&#233;passant les 50%.
</p>
<p>Ces erreurs de reconnaissance vont grandement affecter les performances de d&#233;tection d&#8217;opi-
nions pour les messages tr&#232;s bruit&#233;s, cependant le probl&#232;me de l&#8217;analyse de sondages ne n&#233;ces-
site pas le traitement de la totalit&#233; des messages enregistr&#233;s. En effet, le but recherch&#233; est de
conna&#238;tre la distribution des &#233;tiquettes d&#8217;opinions sur le corpus, pas les &#233;tiquettes individuelles
</p>
<p>64</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique de sondages t&#233;l&#233;phoniques d&#8217;opinion
</p>
<p>de chaque message. On retrouve ici la probl&#233;matique traditionnelle des sondages d&#8217;opinion :
comment collecter un sous-ensemble traitable d&#8217;observations qui conserve les m&#234;mes distri-
butions d&#8217;opinions que celles du corpus g&#233;n&#233;ral. Le sous-ensemble traitable, dans notre cas,
est l&#8217;ensemble des messages consid&#233;r&#233;s comme fiables par les mod&#232;les de RAP et de d&#233;tection
d&#8217;opinion. Nous verrons au paragraphe 4 comment cette fiabilit&#233; est estim&#233;e &#224; l&#8217;aide de mesures
de confiance.
</p>
<p>2.1 Analyse de sondage
</p>
<p>Le probl&#232;me est formalis&#233; de la mani&#232;re suivante :
</p>
<p>Soit C un corpus de n messages orauxm1,m2, . . . ,mn.
</p>
<p>Soit C &#8242; &#8712; C un sous-ensemble de n&#8242; messages de C s&#233;lectionn&#233; par la strat&#233;gie d&#8217;analyse
automatique.
</p>
<p>Soit O(m,x) &#8712; {o1, . . . , ok} l&#8217;opinion exprim&#233; dans le message m &#224; propos de la dimen-
sion x &#8712; D. Les dimensions correspondent ici aux diff&#233;rentes analyses effectu&#233;es dans le son-
dage, par exemple sur l&#8217;efficacit&#233; d&#8217;un service, la courtoisie des op&#233;rateurs, le co&#251;t, etc. Les
valeurs d&#8217;opinions oi &#8712; O sont les diff&#233;rentes opinions possibles. Dans cette &#233;tude on consid&#232;re
les opinions suivantes :
</p>
<p>O = {enti&#232;rement positives, enti&#232;rement n&#233;gatives,mitig&#233;es, sans opinion}.
Les opinions Or(m,x) sont les opinions de r&#233;f&#233;rence, donn&#233;es par des annotateurs humains.
Les opinions Oh(m,x) sont les &#233;tiquettes d&#8217;opinions attribu&#233;es automatiquement.
</p>
<p>Le but des strat&#233;gies propos&#233;es dans cette &#233;tude est de minimiser la distance entre la distribution
des opinions de r&#233;f&#233;rence PC pour la dimension x :
</p>
<p>PC(x) = [p(o1), . . . , p(ok)] et p(oi) =
|Coi|
n
</p>
<p>avecm &#8712; Coi ssi m &#8712; C et Or(m,x) = oi.
et la distribution PC &#8242; estim&#233;e sur le sous-corpus extrait C &#8242; :
</p>
<p>PC &#8242;(x) = [p&#8242;(o1), . . . , p&#8242;(ok)] et p&#8242;(oi) =
</p>
<p>&#8739;&#8739;C &#8242;oi&#8739;&#8739;
n&#8242;
</p>
<p>avecm &#8712; C &#8242;oi ssi m &#8712; C &#8242; et Oh(m,x) = oi.
Cette distance est &#233;valu&#233;e gr&#226;ce &#224; la divergence de Kullback-Leibler (KLD) entre les deux
distributions :
</p>
<p>DKL(PC(x)&#8214;PC &#8242;(x)) =
k&#8721;
i=1
</p>
<p>p(oi) &#183; log p(oi)
p&#8242;(oi)
</p>
<p>(1)
</p>
<p>2.2 D&#233;tection d&#8217;opinions
</p>
<p>Le formalisme introduit dans le paragraphe pr&#233;c&#233;dent n&#233;cessite le calcul de O(m,x) qui repr&#233;-
sente l&#8217;opinion oi contenue dans le message m &#224; propos de la dimension x. Ces opinions oi
</p>
<p>65</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nathalie CAMELIN, Fr&#233;d&#233;ric B&#201;CHET, G&#233;raldine DAMNATI, Renato DE MORI
</p>
<p>sont exprim&#233;es dans le message sous la forme d&#8217;expressions subjectives not&#233;es W (oi, x). Par
exemple pour la dimension x =courtoisie et oi =enti&#232;rement positive on peut trouver dans notre
corpus :W (oi, x) = [l&#8217;accueil &#233;tait parfait].
</p>
<p>Le r&#244;le du module de d&#233;tection d&#8217;opinions est d&#8217;extraire des messages vocauxm ces s&#233;quences
W (oi, x) afin de calculer O(m,x). Cette op&#233;ration se fait en deux &#233;tapes : tout d&#8217;abord extraire
du message les segments susceptibles de repr&#233;senter des expressions subjectives, puis caract&#233;-
riser ces segments en fonctions des diff&#233;rentes &#233;tiquettes d&#8217;opinions.
</p>
<p>Une fois ces &#233;tapes effectu&#233;es, un messagem est d&#233;crit par une s&#233;quence de segments :
m = W1(o1, d1) . . .Wl(ol, dl) avec oi &#8712; O et dj &#8712; D.
L&#8217;attribution de l&#8217;opinion O(m,x) au message m pour la dimension x est effectu&#233;e de la ma-
ni&#232;re suivante :
</p>
<p>O(m,x) =
</p>
<p>&#63729;&#63732;&#63732;&#63730;&#63732;&#63732;&#63731;
sans opinion si &#8704; Wi(oi, di) &#8712; m on a di #= x
satisfait si &#8704; Wi(oi, x) &#8712; m on a oi =satisfait
insatisfait si &#8704; Wi(oi, x) &#8712; m on a oi =insatisfait
mitig&#233; sinon
</p>
<p>3 Description du corpus de sondage t&#233;l&#233;phoniques
</p>
<p>Le corpus de sondage t&#233;l&#233;phonique a &#233;t&#233; collect&#233; aupr&#232;s de r&#233;els clients d&#8217;un service de France
T&#233;l&#233;com. Les personnes contact&#233;es sont invit&#233;es par un court message &#224; appeler un num&#233;ro gra-
tuit qui leur permet d&#8217;exprimer leur satisfaction vis &#224; vis du service-client qu&#8217;ils ont r&#233;cemment
appel&#233;. En composant ce num&#233;ro, le message vocal suivant les invite &#224; laisser un message : [. . . ]
Vous avez r&#233;cemment contact&#233; notre service client&#232;le. Nous souhaitons nous assurer que vous
avez &#233;t&#233; satisfait de l&#8217;accueil et de la suite donn&#233;e &#224; votre appel. N&#8217;h&#233;sitez pas &#224; me faire part
de tous vos commentaires et de vos suggestions sur notre service, ceux-ci nous aideront &#224; nous
am&#233;liorer. Nous vous remercions de votre aide et nous restons &#224; votre disposition. Laissez votre
message apr&#232;s le signal sonore. [. . .]
</p>
<p>A l&#8217;origine ces messages &#233;taient destin&#233;s &#224; &#234;tre trait&#233;s par des op&#233;rateurs. Ainsi aucune consigne
de nature &#224; faciliter le traitement automatique n&#8217;a &#233;t&#233; donn&#233;e : pas de conseils sur le mode
d&#8217;&#233;locution, question ouverte et m&#234;me incitation &#224; laisser des commentaires. Pour cette &#233;tude un
ensemble de 1779 messages, collect&#233;s sur une p&#233;riode de 3 mois, a &#233;t&#233; transcrit manuellement
au niveau mots, expressions subjectives et marqueurs (indication de disfluence et marqueurs
discursifs). Ce corpus a &#233;t&#233; divis&#233; en deux sous-corpus : un corpus d&#8217;apprentissage contenant
environ 80% des messages et un corpus de test contenant les 20% restant.
</p>
<p>L&#8217;analyse de la satisfaction des utilisateurs par l&#8217;&#233;quipe d&#8217;analyse des sondages se fait selon
trois dimensions : la qualit&#233; de l&#8217;accueil (not&#233;e accueil), la rapidit&#233; d&#8217;acc&#232;s au service (not&#233;e
attente) et enfin l&#8217;efficacit&#233; du service (not&#233;e efficacit&#233;). Cette derni&#232;re dimension est la plus
repr&#233;sent&#233; dans le corpus, elle concerne &#224; la fois l&#8217;&#233;valuation des r&#233;ponses aux attentes des
utilisateurs (est ce que le probl&#232;me a &#233;t&#233; r&#233;gl&#233; ?) mais aussi la qualit&#233; des informations donn&#233;es.
Chaque expression subjective peut recevoir deux polarit&#233;s : positive et n&#233;gative. Nous avons
donc un total de 6 &#233;tiquettes pour caract&#233;riser les expressions subjectives du corpus.
</p>
<p>Dans la transcription manuelle, au sein de chaque message, ces expressions sont indiqu&#233;es
par des balises. Nous disposons ainsi d&#8217;un corpus de segments, chacun porteur d&#8217;une opinion
</p>
<p>66</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique de sondages t&#233;l&#233;phoniques d&#8217;opinion
</p>
<p>particuli&#232;re. Le but du traitement automatique est de retrouver ces segments et de les &#233;tiqueter
avec l&#8217;une des 6 &#233;tiquettes. Voici un exemple de message avec les balises manuelles :
</p>
<p>oui c&#8217;est monsieur NOMS PRENOMS j&#8217;avais appel&#233; donc le service client ouais &lt;seg la-
bel=accueil,pos&gt; j&#8217;ai &#233;t&#233; tr&#232;s bien accueilli &lt;/seg&gt; des &lt;seg label=efficacit&#233;,pos&gt; bons ren-
seignements &lt;/seg&gt; sauf que &lt;seg label=efficacit&#233;,neg&gt; &#231;a ne fonctionne toujours pas &lt;/seg&gt;
donc je sais pas si j&#8217;ai fait une mauvaise manipulation ou y a un probl&#232;me enfin voil&#224; sinon
&lt;seg label=efficacit&#233;,pos label=accueil,pos&gt; l&#8217;accueil &#233;tait et les conseils tr&#232;s judicieux &lt;/seg&gt;
m&#234;me si &lt;seg label=efficacit&#233;,neg&gt; le r&#233;sultat n&#8217;est pas n&#8217;est pas l&#224; &lt;/seg&gt; merci au revoir
</p>
<p>4 D&#233;tection et classification d&#8217;expressions subjectives
</p>
<p>Deux strat&#233;gies ont &#233;t&#233; d&#233;velopp&#233;es pour extraire et classifier les expressions subjectives des
messages vocaux : l&#8217;une (not&#233;e ref ) s&#8217;appuie sur les transcriptions manuelles des messages ;
l&#8217;autre (not&#233;e asr) est int&#233;gr&#233;e dans le processus de d&#233;codage de parole. Ces deux strat&#233;gies
nous permettent de dissocier les erreurs dues &#224; une mauvaise transcription en mots des erreurs
de d&#233;tection d&#8217;opinions. Il a &#233;t&#233; n&#233;cessaire de diff&#233;rencier les traitements sur les transcriptions
manuelles des traitements sur les transcriptions automatiques &#224; cause de la tr&#232;s mauvaise qualit&#233;
de ces derni&#232;res : les m&#233;thodes d&#233;velopp&#233;es sur le texte propre ne sont pas assez robustes pour
s&#8217;appliquer aux transcriptions automatiques bruit&#233;es. La figure 1 pr&#233;sente ces strat&#233;gies. Elles
sont d&#233;crites bri&#232;vement dans les prochains paragraphes.
</p>
<p>Segmentation
</p>
<p>Filtrage des segments
</p>
<p>Classification 
en type d&#8217;expression
(dimension+polarit&#233;)
</p>
<p>Processus de d&#233;cision
</p>
<p>CRF
&#233;tiqueteur
</p>
<p>ML Opinion
</p>
<p>Classifieur
(text+RAP mes. conf.)
</p>
<p>+Seuil de rejet &#945;
</p>
<p>Concat&#233;nation segments
+
</p>
<p>Classiffieur
</p>
<p>2 strat&#233;gies:
- sur les messages audio
- sur les transcriptions manuelles 
</p>
<p>Message audioTranscription manuelle
</p>
<p>Seuil de rejet &#946;
</p>
<p>Extraction uniquement
des expressions subjectives
</p>
<p>Concat&#233;nation segments
+
</p>
<p>Classiffieur
</p>
<p>Seuil de rejet &#946;
</p>
<p>FIG. 1 &#8211; Strat&#233;gies de d&#233;tection et de classification d&#8217;expressions subjectives pour les transcrip-
tions manuelles et les messages audio
</p>
<p>67</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nathalie CAMELIN, Fr&#233;d&#233;ric B&#201;CHET, G&#233;raldine DAMNATI, Renato DE MORI
</p>
<p>Mod&#232;les de Langage sp&#233;cifiques &#224; l&#8217;expression d&#8217;opinions. Nous avons montr&#233; dans (Ca-
melin et al., 2006) qu&#8217;un mod&#232;le de langage sp&#233;cifique &#224; la d&#233;tection des opinions permettait
d&#8217;obtenir de meilleures performances lors de la phase de classification qu&#8217;un mod&#232;le RAP stan-
dard de type bigramme. Ceci est d&#251; principalement au protocole de collecte des messages (pas
de contraintes d&#8217;&#233;locution, encouragement &#224; laisser des commentaires) qui implique une tr&#232;s
grande dispersion dans les fr&#233;quences de distribution des mots du corpus collect&#233;.
</p>
<p>Ce mod&#232;le de langage sp&#233;cifique permet ainsi d&#8217;obtenir le message en une suite d&#8217;hypoth&#232;ses
d&#8217;expressions subjectives s&#233;par&#233;es par un symbole repr&#233;sentant les segments consid&#233;r&#233;s comme
vides.
</p>
<p>Un ensemble de mesures de confiance (acoustiques et linguistiques) est associ&#233; &#224; chaque hy-
poth&#232;se. Sa probabilit&#233; d&#8217;&#234;tre correcte est alors approxim&#233;e sur le corpus d&#8217;apprentissage par
r&#233;gression logistique sur ses mesures de confiance. Comme pr&#233;sent&#233; dans la figure 1 cette pro-
babilit&#233; permet de filtrer les hypoth&#232;ses peu fiables (seuil &#945; de la figure).
</p>
<p>Le principal avantage d&#8217;un tel mod&#232;le est de segmenter directement le flux audio en hypoth&#232;ses
d&#8217;expressions subjectives.
</p>
<p>Segmentation des messages avec des Champs Conditionnels Al&#233;atoires. Pour le traitement
des transcriptions manuelles un segmenteur bas&#233; sur les Champs Conditionnels Al&#233;atoires (ou
Conditional Random Fields CRF) a &#233;t&#233; d&#233;velopp&#233;. Les CRF (Lafferty et al., 2001) ont &#233;t&#233;
utilis&#233;s avec succ&#232;s dans de nombreuses t&#226;ches d&#8217;&#233;tiquetage telles que l&#8217;&#233;tiquetage morpho-
syntaxique ou la d&#233;tection d&#8217;entit&#233;s nomm&#233;es. L&#8217;avantage principal des CRF par rapport &#224; des
mod&#232;les g&#233;n&#233;ratifs tels que les Mod&#232;les de Markov Cach&#233;s est la possibilit&#233; d&#8217;utiliser l&#8217;en-
semble des observations d&#8217;une s&#233;quence pour pr&#233;dire une &#233;tiquette. Ce n&#8217;est donc pas le seul
historique imm&#233;diat qui contraint l&#8217;attribution d&#8217;une &#233;tiquette &#224; une observation mais potentiel-
lement toutes les observations pr&#233;c&#233;dentes et suivantes.
</p>
<p>Dans notre cas, le corpus d&#8217;apprentissage est format&#233; de mani&#232;re &#224; associer &#224; chaque mot une
&#233;tiquette indiquant s&#8217;il fait partie d&#8217;une expression subjective ou non. L&#8217;&#233;tiqueteur d&#233;velopp&#233;
est bas&#233; sur l&#8217;outil CRF++1 qui permet de repr&#233;senter chaque mot selon diff&#233;rents niveaux.
Ainsi un mot est repr&#233;sent&#233; par : son lemme et une &#233;tiquette nomm&#233;e seed. En effet, plusieurs
&#233;tudes (Hatzivassiloglou &amp; McKeown, 1997) utilisent un ensemble de mots (appel&#233;s seeds) qui
expriment explicitement une opinion (e.g. gentil, aga&#231;ant, utile, efficace).
</p>
<p>Lors de l&#8217;analyse d&#8217;un nouveau message, les &#233;tiquettes pos&#233;es par le CRF permettent d&#8217;extraire
uniquement les hypoth&#232;ses d&#8217;expressions subjectives.
</p>
<p>Classification des opinions. Une fois la segmentation du message effectu&#233;e, les hypoth&#232;ses
d&#8217;expressions subjectives associ&#233;es &#224; un m&#234;me label sont concat&#233;n&#233;es. Chaque segment ainsi
obtenu est ensuite &#233;tiquet&#233; par un classifieur bas&#233; sur l&#8217;algorithme AdaBoost (Schapire &amp; Singer,
2000).
</p>
<p>Deux mod&#232;les sont appris sur les expressions subjectives du corpus d&#8217;entra&#238;nement annot&#233;es
manuellement. La transcription exacte est utilis&#233;e pour le mod&#232;le ref et la transcription automa-
tique pour le mod&#232;le asr. Chaque expression subjective est repr&#233;sent&#233;e en entr&#233;e du classifieur
par ses lemmes et seeds ainsi que le nombre de mots.
</p>
<p>1Toolkit CRF++ : http ://www/chasen.org/ taku/software/CRF++/
</p>
<p>68</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique de sondages t&#233;l&#233;phoniques d&#8217;opinion
</p>
<p>!&quot;#
</p>
<p>!$#
</p>
<p>!%#
</p>
<p>!&amp;#
</p>
<p>!'#
</p>
<p>!(#
</p>
<p>!)#
</p>
<p>!*#
</p>
<p>!%&amp; !&amp;# !&amp;&amp; !'# !'&amp; !(# !(&amp; !)# !)&amp; !*# !*&amp;
</p>
<p>+
,-
</p>
<p>-.
/
</p>
<p>012345467
</p>
<p>,51
1.8
</p>
<p>!#
</p>
<p>!#9:
</p>
<p>!#9&quot;
</p>
<p>!#9$
</p>
<p>!#9%
</p>
<p>!#9&amp;
</p>
<p>!#9'
</p>
<p>!#9(
</p>
<p>!#9)
</p>
<p>!#9*
</p>
<p>!:
</p>
<p>!:9:
</p>
<p>!%&amp; !&amp;# !&amp;&amp; !'# !'&amp; !(# !(&amp; !)# !)&amp; !*# !*&amp;
</p>
<p>;
45
</p>
<p>&lt;,
73
</p>
<p>.!
=.
</p>
<p>!&gt;
?/
</p>
<p>/@
,3
</p>
<p>A&#358;
B
</p>
<p>4.
@/
</p>
<p>.1
</p>
<p>012345467
</p>
<p>,51
1.8
</p>
<p>FIG. 2 &#8211; Courbes de pr&#233;cision/rappel sur les segments d&#8217;opinion (gauche) et de pr&#233;ci-
sion/divergence DKL (droite) obtenues sur le corpus de test en faisant varier les seuils de rejet
&#945; et &#946; pour les transcriptions manuelles (ref ) et les sorties du module de RAP (asr)
</p>
<p>Ainsi l&#8217;expression subjective (transcription manuelle) : j&#8217;ai &#233;t&#233; tr&#232;s satisfaite euh de la commu-
nication avec euh l&#8217;interlocuteur que j&#8217;avais au t&#233;l&#233;phone donc euh j&#8217; attends des documents la
personne &#233;tait tr&#232;s gentille et tr&#232;s serviable et m&#8217; a bien d&#233;pann&#233;e est repr&#233;sent&#233;e par : il avoir
&#234;tre tr&#232;s satisfaire de le communication avec le interlocuteur que il avoir au t&#233;l&#233;phone donc il
attendre des document le personne &#234;tre tr&#232;s gentil et tr&#232;s serviable et me avoir bien d&#233;pann&#233; ,
satisfaire communication t&#233;l&#233;phone attendre personne gentil serviable d&#233;pann&#233; , 29.
</p>
<p>En sortie du classifieur, un score de confiance est attribu&#233; &#224; chaque &#233;tiquette recherch&#233;e pour
le segment consid&#233;r&#233;. Les &#233;tiquettes retenues sont celles d&#233;passant le seuil &#946; de la strat&#233;gie
pr&#233;sent&#233;e dans la figure 1.
</p>
<p>5 Exp&#233;riences
</p>
<p>Cette section permet de comparer les 2 strat&#233;gies pr&#233;sent&#233;es pr&#233;c&#233;demment et ainsi d&#8217;&#233;valuer
l&#8217;influence des erreurs du module RAP. Une am&#233;lioration de la strat&#233;gie asr avec l&#8217;introduction
de connaissances explicites est ensuite propos&#233;e. Enfin, les crit&#232;res de choix d&#8217;une strat&#233;gie par
rapport &#224; une autre selon la probl&#233;matique des sondages sont expos&#233;s.
</p>
<p>&#201;valuation des strat&#233;gies. L&#8217;&#233;valuation est faite sur le corpus de test par rapport &#224; deux types
de mesures : les mesures de pr&#233;cision/rappel sur la d&#233;tection des expressions subjectives et
la mesure de la distance de Kullback-Leibler (DKL) entre la distribution de r&#233;f&#233;rence sur les
opinions et celle estim&#233;e automatiquement. La figure 2 pr&#233;sente les courbes obtenues en faisant
varier les seuils de rejet &#945; et &#946;.
</p>
<p>Comme attendu la strat&#233;gie ref s&#8217;appliquant aux transcriptions manuelles donne de bien
meilleurs r&#233;sultats en terme de pr&#233;cision/rappel. Il est par contre particuli&#232;rement int&#233;ressant
de constater que pour la mesure de la divergence les deux courbes atteignent les m&#234;mes valeurs.
Ce r&#233;sultat valide notre approche consistant &#224; s&#233;lectionner un sous-ensemble repr&#233;sentatif de
messages pour lesquels les prises de d&#233;cision sur l&#8217;attribution d&#8217;opinions sont fiables selon la
strat&#233;gie impl&#233;ment&#233;e.
</p>
<p>69</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nathalie CAMELIN, Fr&#233;d&#233;ric B&#201;CHET, G&#233;raldine DAMNATI, Renato DE MORI
</p>
<p>Utilisation de connaissances explicites. Une &#233;tude manuelle des erreurs g&#233;n&#233;r&#233;es par la stra-
t&#233;gie asr sur le corpus d&#8217;entra&#238;nement a permis de mettre en &#233;vidence que de nombreux mes-
sages rejet&#233;s contenaient des phrases idiomatiques selon une ou plusieurs des dimensions re-
cherch&#233;es. Ces phrases ont &#233;t&#233; extraites du corpus d&#8217;entra&#238;nement puis manuellement g&#233;n&#233;rali-
s&#233;es sous formes d&#8217;expressions r&#233;guli&#232;res. Ces expressions sont tr&#232;s g&#233;n&#233;rales, en petit nombre,
non ambigu&#235;, et sont relativement ind&#233;pendante de l&#8217;application vis&#233;e de service client&#232;le. La
raison pour laquelle elles n&#8217;ont pas &#233;t&#233; captur&#233;es par le processus de classification automa-
tique est due &#224; la faible taille du corpus d&#8217;apprentissage. L&#8217;apport de connaissance explicite
vise ainsi &#224; pallier aux faiblesses des m&#233;thodes d&#8217;apprentissage automatique sur des donn&#233;es de
taille r&#233;duite. A la suite de ce processus manuel huit expressions r&#233;guli&#232;re ont &#233;t&#233; associ&#233;es &#224; la
dimension accueil, deux pour attente et treize pour efficacit&#233;.
</p>
<p>Pour pouvoir &#233;valuer l&#8217;apport de l&#8217;utilisation de cette connaissance explicite &#224; notre syst&#232;me,
quatre strat&#233;gies sont propos&#233;es :
&#8211; La strat&#233;gie &#936;1 est celle utilis&#233;e dans le syst&#232;me asr, sans l&#8217;apport de connaissances expli-
cites.
</p>
<p>&#8211; Pour la strat&#233;gie &#936;2, les expressions r&#233;guli&#232;res ont &#233;t&#233; int&#233;gr&#233;es comme param&#232;tre d&#8217;entr&#233;e
de l&#8217;algorithme de classification AdaBoost.
</p>
<p>&#8211; La strat&#233;gie &#936;3 correspond &#224; la fusion des hypoth&#232;ses d&#8217;opinions obtenues par la strat&#233;gie
&#936;1 et celles obtenues en appliquant directement les expressions r&#233;guli&#232;res sur les segments.
</p>
<p>&#8211; Enfin la strat&#233;gie&#936;4 correspond &#224; une strat&#233;gie s&#233;quentielle : les expressions r&#233;guli&#232;res ayant
&#233;t&#233; apprises principalement sur l&#8217;ensemble des messages rejet&#233;s par la strat&#233;gie &#936;1, celles-ci
sont appliqu&#233;es uniquement sur l&#8217;ensemble des messages rejet&#233;s par &#936;1.
</p>
<p>Toutes ces strat&#233;gies suivent la r&#232;gle de rejet suivante : si aucun des segments du message n&#8217;a
&#233;t&#233; associ&#233; &#224; une &#233;tiquette d&#8217;opinion, le message est rejet&#233;.
</p>
<p>Pour chaque strat&#233;gie, la pr&#233;cision, le rappel et la F-mesure ont &#233;t&#233; calcul&#233;s en faisant varier
les seuils &#945; et &#946;. La figure 3, pr&#233;sentant la F-mesure en fonction de la pr&#233;cision, permet de
mettre en &#233;vidence l&#8217;apport significatif de l&#8217;utilisation de connaissances explicites quelles que
soit la strat&#233;gie choisie, et ce malgr&#233; le faible nombre d&#8217;expressions r&#233;guli&#232;res rajout&#233;es pour
chaque dimension. La strat&#233;gie de fusion &#936;3 est celle qui permet d&#8217;obtenir la plus forte valeur
de F-mesure.
</p>
<p>Choix de la strat&#233;gie et r&#233;glage du syst&#232;me. Pour les syst&#232;mes de d&#233;tection d&#8217;entit&#233;s, le
choix de la meilleure strat&#233;gie ou le r&#233;glage de param&#232;tres tels que les seuils de rejet est g&#233;n&#233;ra-
lement fait sur des courbes de pr&#233;cision/rappel ou de F-mesure telles que la courbe 3. Dans cette
&#233;tude, le choix de la strat&#233;gie &#224; utiliser est fait selon la probl&#233;matique des sondages d&#8217;opinions.
En effet, il s&#8217;agit de trouver la strat&#233;gie qui conservera le mieux les distributions du corpus g&#233;n&#233;-
ral. Pour cela la divergence de Kullback-Leibler entre les proportions r&#233;elles et celles estim&#233;es
est calcul&#233;e pour toutes les strat&#233;gies avec diff&#233;rentes valeurs pour les seuils &#945; et &#946;. Le point de
fonctionnement du syst&#232;me est choisi comme celui qui minimise cette divergence. La figure 4
pr&#233;sente cette courbe pour les quatre strat&#233;gies d&#233;velopp&#233;es.
</p>
<p>Les strat&#233;gies&#936;3 et&#936;4 montrent une distance de Kullback-Leibler syst&#233;matiquement plus faible
que la strat&#233;gie &#936;1, la strat&#233;gie de fusion &#936;3 apparaissant comme la plus performante.
</p>
<p>70</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique de sondages t&#233;l&#233;phoniques d&#8217;opinion
</p>
<p>!&quot;#
</p>
<p>!$%
</p>
<p>!$#
</p>
<p>!&amp;%
</p>
<p>!&amp;#
</p>
<p>!#%
</p>
<p>!##
</p>
<p>!'%
</p>
<p>!'#
</p>
<p>!(%
</p>
<p>!(#
</p>
<p>!#% !## !'% !'# !(% !(# !)% !)# !*% !*#
</p>
<p>+&#358;
,
</p>
<p>-.
/0
</p>
<p>-
</p>
<p>10234.456
</p>
<p>&#936;1&#936;2&#936;3&#936;4
</p>
<p>FIG. 3 &#8211; F-mesure obtenue par les 4 strat&#233;gies d&#8217;extraction d&#8217;opinions sur le corpus de test en
faisant varier les seuils &#945; and &#946;.
</p>
<p>6 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; dans cette &#233;tude la probl&#233;matique de l&#8217;analyse automatique de sondages
d&#8217;opinion &#224; partir de messages oraux. Trois r&#233;sultats originaux ont &#233;t&#233; obtenus :
</p>
<p>1. Il est possible d&#8217;extraire de mani&#232;re robuste de l&#8217;information &#224; partir de transcriptions
automatiques tr&#232;s bruit&#233;es (dues &#224; l&#8217;extr&#234;me variabilit&#233; des corpus oraux collect&#233;s) si on
accepte de filtrer et s&#233;lectionner les messages fiables selon un ensemble de mesures de
confiance. Les r&#233;sultats obtenus dans cette &#233;tude avec cette strat&#233;gie sont identiques &#224;
ceux obtenus sur des transcriptions exactes.
</p>
<p>2. L&#8217;ajout de connaissances explicites peut am&#233;liorer un processus de classification automa-
tique en permettant de g&#233;n&#233;raliser certains ph&#233;nom&#232;nes peu repr&#233;sent&#233;s dans le corpus
d&#8217;apprentissage. Diverses strat&#233;gies sont propos&#233;es pour r&#233;aliser cet ajout, c&#8217;est la fusion
des hypoth&#232;ses qui s&#8217;est montr&#233;e la plus robuste dans notre &#233;tude.
</p>
<p>3. Enfin le choix de la strat&#233;gie et son point de fonctionnement doivent &#234;tre fait par rapport
&#224; la t&#226;che vis&#233;e. Dans le cadre de l&#8217;analyse de sondages, c&#8217;est la divergence entre la
distribution de r&#233;f&#233;rence des opinions et celle estim&#233;e qui doit &#234;tre minimis&#233;e, plut&#244;t que
la pr&#233;cision ou le rappel dans la d&#233;tection des opinions.
</p>
<p>R&#233;f&#233;rences
B&#201;CHET F., DAMNATI G., CAMELIN N. &amp; DE MORI R. (2006). Spoken opinion extrac-
tion detecting variations in user satisfaction. In IEEE/ACL Workshop on Spoken Language
Technology.
</p>
<p>71</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nathalie CAMELIN, Fr&#233;d&#233;ric B&#201;CHET, G&#233;raldine DAMNATI, Renato DE MORI
</p>
<p>!&quot;#&quot;$
</p>
<p>!&quot;#%
</p>
<p>!&quot;#%$
</p>
<p>!&quot;#&amp;
</p>
<p>!&quot;#&amp;$
</p>
<p>!&quot;#'
</p>
<p>!(&quot; !($ !)&quot; !)$ !*&quot; !*$ !+&quot;
</p>
<p>,
-.
</p>
<p>/0
12
</p>
<p>3!
43
</p>
<p>!5
67
</p>
<p>78
02
</p>
<p>9&#358;
:
</p>
<p>-3
87
</p>
<p>3;
</p>
<p>&lt;;=2-.-&gt;1
</p>
<p>&#936;1&#936;2&#936;3&#936;4
</p>
<p>FIG. 4 &#8211; Distance de Kullback-Leibler obtenue par les diff&#233;rentes strat&#233;gies appliqu&#233;es sur le
corpus de test transcrit automatiquement. Les courbes sont obtenus pour diff&#233;rentes valeurs de
&#945; et &#946;.
</p>
<p>CAMELIN N., DAMNATI G., B&#201;CHET F. &amp; DE MORI R. (2006). D&#233;tection automatique
d&#8217;opinions dans des corpus de messages oraux. In Journ&#233;es d&#8217;Etude de la Parole, France.
CHOI Y., CARDIE C., RILOFF E. &amp; PATWARDHANN S. (2005). Identifying sources of opi-
nions with conditional random fields and extraction patterns. In HLT/EMNLP, p. 355&#8211;362,
Vancouver, Canada.
HATZIVASSILOGLOU V. &amp; MCKEOWN K. R. (1997). Predicting the semantic orientation of
adjectives. In European chapter of ACL, p. 174&#8211;181, Morristown, NJ, USA : Association for
Computational Linguistics.
LAFFERTY J., MCCALLUM A. &amp; PEREIRA F. (2001). Conditional random fields : Probabi-
listic models for segmenting and labeling sequence data. In Proc. 18th International Conf. on
Machine Learning, p. 282&#8211;289 : Morgan Kaufmann, San Francisco, CA.
POPESCU A.-M. &amp; ETZIONI O. (2005). Extracting product features and opinions from re-
views. In HLT/EMNLP.
RILOFF E. &amp; WIEBE J. (2003). Learning extraction patterns for subjective expressions. In
Proceedings of the 2003 conference on EMNLP.
SCHAPIRE R. E. &amp; SINGER Y. (2000). BoosTexter : A boosting-based system for text cate-
gorization. Machine Learning, 39, 135&#8211;168.
WIEBE J., WILSON T. &amp; CARDIE C. (2005). Annotationg expressions of opinions and emo-
tions in language. In Language Resources and Evaluation.
</p>
<p>72</p>

</div></div>
</body></html>