<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>M&#233;thodes d&#8217;alignement des propositions : un d&#233;fi aux traductions crois&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>M&#233;thodes d&#8217;alignement des propositions :
un d&#233;fi aux traductions crois&#233;es
</p>
<p>Yayoi NAKAMURA-DELLOYE
Universit&#233; Paris 7 &#8211; LATTICE
</p>
<p>1 rue Maurice Arnoux 92120 Montrouge
http://www.lattice.cnrs.fr
</p>
<p>yayoi@free.fr
</p>
<p>R&#233;sum&#233;. Le pr&#233;sent article d&#233;crit deux m&#233;thodes d&#8217;alignement des propositions : l&#8217;une
bas&#233;e sur les m&#233;thodes d&#8217;appariement des graphes et une autre inspir&#233;e de la classification as-
cendante hi&#233;rarchique (CAH). Les deux m&#233;thodes sont caract&#233;ris&#233;es par leur capacit&#233; d&#8217;aligne-
ment des traductions crois&#233;es, ce qui &#233;tait impossible pour beaucoup de m&#233;thodes classiques
d&#8217;alignement des phrases. Contrairement aux r&#233;sultats obtenus avec l&#8217;approche spectrale qui
nous paraissent non satisfaisants, l&#8217;alignement bas&#233; sur la m&#233;thode de classification ascendante
hi&#233;rarchique est prometteur dans la mesure o&#249; cette technique supporte bien les traductions
crois&#233;es.
</p>
<p>Abstract. The present paper describes two methods for clauses alignment. The first one
uses a graph matching approach, while the second one relies on agglomerative hirerarchical
clustering (AHC). Both methods are characterized by the fact they can align cross translations,
which was impossible for previous classic sentence alignment methods. Though the results
given by the spectral method are unsatisfactory, the method based on AHC is very promising.
It handles correctly cross translations.
</p>
<p>Mots-cl&#233;s : alignement des corpus parall&#232;les, appariement de graphes, classification as-
cendante hi&#233;rarchique, proposition syntaxique, m&#233;moire de traduction, linguistique contrastive.
</p>
<p>Keywords: parallel corpora alignment, graph matching, agglomerative hierarchical clus-
tering, syntactic clause, translation memory, contrastive linguistics.
</p>
<p>1 Introduction
</p>
<p>L&#8217;alignement des propositions consiste en la mise en correspondance des propositions syn-
taxiques avec leurs traductions dans des textes parall&#232;les. Les corpus parall&#232;les align&#233;s au ni-
veau des propositions pourraient &#234;tre des ressources profitables dans beaucoup de domaines tels
que la traduction automatique ou la traduction assist&#233;e par ordinateur (TAO), ainsi que pour les
recherches en linguistique contrastive. En d&#233;pit de cet int&#233;r&#234;t notable, peu de travaux sur l&#8217;ali-
gnement des propositions ont &#233;t&#233; r&#233;alis&#233;s et les quelques m&#233;thodes propos&#233;es sont semblables
&#224; celles pour l&#8217;appariement des phrases. Or l&#8217;alignement des propositions entre deux langues
relativement diff&#233;rentes sur tous les plans, telles que la paire fran&#231;ais-japonais, n&#8217;est pas r&#233;a-
lisable par la simple application d&#8217;une m&#233;thode d&#8217;alignement des phrases. Nous avons donc
</p>
<p>223</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>essay&#233; de r&#233;aliser un syst&#232;me supportant ces diff&#233;rences structurales des langues trait&#233;es. Nous
d&#233;crivons, dans le pr&#233;sent article, deux m&#233;thodes d&#8217;alignement des propositions : l&#8217;une bas&#233;e
sur les m&#233;thodes d&#8217;appariement des graphes et une autre inspir&#233;e de la classification ascendante
hi&#233;rarchique (CAH). Nous allons d&#8217;abord pr&#233;senter un bref &#233;tat de l&#8217;art afin de mettre en re-
lief les probl&#232;mes. Puis, l&#8217;expos&#233; se poursuivra par la description des deux m&#233;thodes, pour se
terminer par l&#8217;analyse des r&#233;sultats obtenus et une discussion sur les pistes d&#8217;am&#233;lioration.
</p>
<p>2 Probl&#232;mes et solution adopt&#233;e
</p>
<p>Il existe tr&#232;s peu de travaux sur l&#8217;alignement des propositions. Nous pouvons tout de m&#234;me
citer ceux de Piperidis, Papageorgiou et Boutsis (Boutsis &amp; Piperidis, 1998) (Piperidis et al.,
2000) sur les textes parall&#232;les anglais-grec et ceux de Wang et Ren (Wang &amp; Ren, 2005) sur le
japonais-chinois. Dans la m&#233;thode de Piperidis, l&#8217;algorithme d&#8217;alignement est semblable &#224; celui
propos&#233; par Brown, Lai et Mercer (Brown et al., 1991) pour l&#8217;alignement des phrases, &#224; l&#8217;ex-
ception du fait qu&#8217;il utilise des informations lexicales contrairement &#224; la m&#233;thode d&#8217;alignement
des phrases n&#8217;exploitant, elle, que la longueur des textes. Wang et Ren am&#233;liorent &#233;galement
l&#8217;appariement bas&#233; sur les longueurs des textes par l&#8217;introduction d&#8217;un calcul de similarit&#233; bas&#233;
sur l&#8217;information port&#233;e par les id&#233;ogrammes Han.
</p>
<p>Il n&#8217;existe &#224; ce jour a priori aucune &#233;tude sur l&#8217;alignement des propositions traitant le japonais,
avec le fran&#231;ais, ou m&#234;me avec l&#8217;anglais. Il existe cependant un article portant sur l&#8217;alignement
manuel des propositions anglais-japonais qui pr&#233;sente une m&#233;thode d&#8217;alignement manuel et les
difficult&#233;s rencontr&#233;es (Kashioka et al., 2003).
</p>
<p>2.1 Difficult&#233;s d&#8217;appariement des propositions dues aux diff&#233;rences entre
les langues
</p>
<p>Au vu des d&#233;g&#226;ts sociaux et &#233;cologiques
</p>
<p>d!un mode de d&#233;veloppement qui semble
</p>
<p>indissociablement li&#233; &#224; la croissance, les
</p>
<p>&#233;conomis tes ant i l ib&#233;raux, issus du
</p>
<p>marxisme, du structuralisme ou du tiers-
</p>
<p>mondisme ont beaucoup de mal &#224; faire valoir
</p>
<p>qu!on peut distinguer les deux notions.
</p>
<p>&#25104;&#38263;&#12392;&#19981;&#21487;&#20998;&#12395;&#32080;&#12403;&#20184;&#12356;&#12390;&#12356;&#12427;&#12392;&#24605;&#12431;&#12428;&#12427;&#12288;
&#38283;&#30330;&#25163;&#27861;&#12364;&#31038;&#20250;&#12392;&#29872;&#22659;&#12395;&#12418;&#12383;&#12425;&#12375;&#12383;&#12288;&#25613;&#23475;&#12434;
&#21069;&#12395;&#12375;&#12390;&#12289;&#12510;&#12523;&#12463;&#12473;&#20027;&#32681;&#12289;&#27083;&#36896;&#20027;&#32681;&#12289;&#31532;&#65299;&#19990;
&#30028;&#20027;&#32681;&#12398;&#27969;&#12428;&#12434;&#27762;&#12416;&#12288;&#21453;&#33258;&#30001;&#20027;&#32681;&#30340;&#12394;&#32076;&#28168;&#23398;
&#32773;&#12399;&#12288;&#25104;&#38263;&#12392;&#38283;&#30330;&#12434;&#21306;&#21029;&#12391;&#12365;&#12427;&#12288;&#12392;&#12398;&#20027;&#24373;&#12395;
&#22823;&#12365;&#12394;&#25269;&#25239;&#12434;&#24863;&#12376;&#12390;&#12356;&#12427;&#12290;
</p>
<p>FIG. 1 &#8211; Exemple de non-parall&#233;lisme de l&#8217;alignement des propositions Fran&#231;ais-Japonais
</p>
<p>Dans leur article, Kashioka et al. pr&#233;sentent la constitution d&#8217;un corpus parall&#232;le avec aligne-
ment au niveau des propositions, r&#233;alis&#233;e dans un but d&#8217;utilisation pour la traduction automa-
tique des monologues (e.g. nouvelles t&#233;l&#233;vis&#233;es, conf&#233;rences, pr&#233;sentations techniques). Une re-
marque int&#233;ressante faite par les auteurs suite &#224; cette exp&#233;rience, porte sur la diff&#233;rence d&#8217;ordre
des propositions japonaises et des segments anglais correspondants : on constate beaucoup de
</p>
<p>224</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodes d&#8217;alignement des propositions
</p>
<p>croisement des alignements. Ce non-parall&#233;lisme des propositions (cf. figure 1) implique l&#8217;im-
possibilit&#233; d&#8217;appliquer les m&#233;thodes d&#8217;alignement des phrases classiques bas&#233;es sur l&#8217;hypoth&#232;se
de parall&#233;lisme. Nous avons donc besoin, pour automatiser la t&#226;che d&#8217;alignement des proposi-
tions, de concevoir un autre algorithme qui ne pr&#233;suppose pas le parall&#233;lisme.
</p>
<p>2.2 &#201;l&#233;ments de solution
</p>
<p>Pour supporter les croisements des traductions, l&#8217;automatisation de l&#8217;op&#233;ration d&#8217;alignement
n&#233;cessite un algorithme utilisant une structure non lin&#233;aire mais &#224; deux dimensions telle que
les graphes. Notre id&#233;e est comme suit : &#224; l&#8217;aide des informations sur les relations entre les
propositions, nous construisons l&#8217;arbre d&#233;pendanciel en propositions (arbre des propositions,
ci-apr&#232;s) pour r&#233;aliser l&#8217;alignement par une m&#233;thode d&#8217;appariement des graphes (cf. figure 2).
</p>
<p>les &#233;conomistes antilib&#233;raux, issus du 
marxisme, du structuralisme ou du 
</p>
<p>tiers-mondisme ont beaucoup de mal 
&#224; faire valoir
</p>
<p>Au vu des d&#233;g&#226;ts sociaux et 
&#233;cologiques d!un mode de 
</p>
<p>d&#233;veloppement
</p>
<p>qui semble 
indissociablement li&#233; &#224; la 
</p>
<p>croissance,
</p>
<p>qu!on peut distinguer 
les deux notions.
</p>
<p>Cadre
</p>
<p>Compl&#233;tive
</p>
<p>Relative
</p>
<p>&#21453;&#33258;&#30001;&#20027;&#32681;&#30340;&#12394;&#32076;&#28168;&#23398;&#32773;
&#12399;
</p>
<p>&#25104;&#38263;&#12392;&#19981;&#21487;&#20998;&#12395;&#32080;&#12403;&#20184;&#12356;&#12390;
&#12356;&#12427;&#12392;&#24605;&#12431;&#12428;&#12427;
</p>
<p>&#25613;&#23475;&#12434;&#21069;&#12395;&#12375;&#12390;&#12289;
</p>
<p>&#12392;&#12398;&#20027;&#24373;&#12395;&#22823;&#12365;&#12394;&#25269;&#25239;&#12434;
&#24863;&#12376;&#12390;&#12356;&#12427;&#12290;
</p>
<p>Relative
</p>
<p>Th&#232;meSubordonn&#233;e
(Contexte)
</p>
<p>&#38283;&#30330;&#25163;&#27861;&#12364;&#31038;&#20250;&#12392;&#29872;&#22659;&#12395;&#12418;
&#12383;&#12425;&#12375;&#12383;
Relative
</p>
<p>Phrase japonaise
</p>
<p>Principale
</p>
<p>&#12510;&#12523;&#12463;&#12473;&#20027;&#32681;&#12289;&#27083;&#36896;&#20027;
&#32681;&#12289;&#31532;&#65299;&#19990;&#30028;&#20027;&#32681;&#12398;&#27969;&#12428;
</p>
<p>&#12434;&#27762;&#12416;
Relative
</p>
<p>&#25104;&#38263;&#12392;&#38283;&#30330;&#12434;&#21306;&#21029;&#12391;&#12365;&#12427;
</p>
<p>Relative
</p>
<p>Principale
</p>
<p>Phrase fran&#231;aise
</p>
<p>FIG. 2 &#8211; Alignement des propositions &#224; l&#8217;aide des arbres des propositions
</p>
<p>L&#8217;alignement &#224; l&#8217;aide de graphes n&#8217;est pas un concept nouveau. Plusieurs &#233;tudes sur l&#8217;aligne-
ment anglais-japonais de structures inf&#233;rieures &#224; la proposition utilisant les arbres syntaxiques
ont &#233;t&#233; r&#233;alis&#233;es. Les travaux de Matsumoto et al. (Matsumoto et al., 1993) proposent une m&#233;-
thode permettant de trouver des correspondances structurelles entre deux arbres de d&#233;pendance.
Dans les m&#233;thodes (Kaji et al., 1993) (Imamura, 2000) (Watanabe et al., 2000), l&#8217;alignement
des syntagmes est r&#233;alis&#233; sur la base des mots mis en correspondance &#224; l&#8217;aide d&#8217;un dictionnaire
bilingue. Les mots align&#233;s servent &#224; ancrer les textes pour rep&#233;rer les segments &#224; extraire et la
repr&#233;sentation arborescente permet de d&#233;terminer correctement les structures form&#233;es par ces
mots ancres.
</p>
<p>Notre approche est semblable &#224; celle de Matsumoto. La difficult&#233; est que la recherche de la
meilleure d&#233;composition des arbres pour obtenir les structures isomorphes permettant l&#8217;appa-
riement maximal revient &#224; un appariement many-to-many de graphes, qui est un probl&#232;me de
grande complexit&#233; algorithmique. Dans les travaux de Matsumoto, est retenue une strat&#233;gie
d&#8217;am&#233;lioration par l&#8217;utilisation de la m&#233;thode du branch-and-bound. Dans le cadre des pr&#233;sents
travaux, nous avons choisi une solution bas&#233;e sur une technique d&#8217;appariement des graphes.
En effet, dans la th&#233;orie des graphes, il existe un ensemble de m&#233;thodes beaucoup plus &#233;cono-
miques que les proc&#233;dures de recherche combinatoire, g&#233;n&#233;ralement connues sous le nom de
m&#233;thodes spectrales.
</p>
<p>N&#233;anmoins, cette m&#233;thode s&#8217;appuie essentiellement sur la topologie des graphes &#224; apparier et
n&#8217;est pas destin&#233;e &#224; exploiter diff&#233;rentes informations disponibles, notamment les informations
lexicales dans le cas de nos travaux. La derni&#232;re &#233;tape de la m&#233;thode spectrale consistant en un
</p>
<p>225</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>regroupement des points projet&#233;s, nous a inspir&#233; l&#8217;approche pour l&#8217;alignement par la classifica-
tion ascendante hi&#233;rarchique (CAH). Celle-ci devant permettre de mieux profiter des informa-
tions lexicales tout en supportant les croisements des traductions.
</p>
<p>Apr&#232;s examen de l&#8217;existant, nous avons r&#233;alis&#233; deux m&#233;thodes d&#8217;alignement des propositions.
L&#8217;une est bas&#233;e sur les m&#233;thodes d&#8217;appariement des graphes &#8211; profitant pleinement des struc-
tures des arbres des propositions &#8211;, l&#8217;autre exploitant les informations lexicales et les longueurs
tout en supportant les croisements de correspondance avec une m&#233;thode inspir&#233;e de la classifi-
cation ascendante hi&#233;rarchique.
</p>
<p>3 M&#233;thodes bas&#233;es sur l&#8217;approche spectrale
</p>
<p>Dans la th&#233;orie des graphes, l&#8217;appariement par une approche spectrale consiste &#224; repr&#233;senter
et distinguer les propri&#233;t&#233;s structurales des graphes &#224; l&#8217;aide des valeurs propres et des vecteurs
propres de leurs matrices d&#8217;adjacence et se base g&#233;n&#233;ralement sur une technique de d&#233;com-
position spectrale. L&#8217;algorithme sur lequel nous nous sommes plus particuli&#232;rement appuy&#233;s,
celui propos&#233; par Kosinov et Caelli (Kosinov &amp; Caelli, 2002) (Kosinov &amp; Caelli, 2004), est une
am&#233;lioration visant en particulier la r&#233;alisation des appariements de graphes inexacts. Leral-
lut (Lerallut, 2006) a ensuite am&#233;lior&#233; cette m&#233;thode pour prendre en compte des informations
suppl&#233;mentaires en cas d&#8217;appariement de graphes valu&#233;s.
</p>
<p>Dans le cadre de notre alignement des propositions, la m&#233;thode de Kosinov est directement
utilis&#233;e pour apparier les arbres des propositions. Afin d&#8217;exploiter au mieux les informations
disponibles pour r&#233;aliser un meilleur appariement, nous avons &#233;galement r&#233;alis&#233; une adaptation
de la m&#233;thode de Lerallut &#224; notre op&#233;ration d&#8217;alignement des propositions.
</p>
<p>3.1 M&#233;thodes spectrales pour l&#8217;appariement des graphes
</p>
<p>La m&#233;thode d&#8217;appariement de graphes inexact propos&#233;e par Kosinov et Caelli combine les avan-
tages des techniques de d&#233;composition spectrale, de projection et de classification (clustering).
Elle consiste, &#233;tant donn&#233; les matrices d&#8217;adjacence A1 et A2 cr&#233;&#233;es &#224; partir des graphes G1
et G2 respectivement, (i) &#224; calculer les valeurs propres et les vecteurs propres, (ii) &#224; tronquer
les matrices selon le nombre de dimensions choisi pour la projection, (iii) &#224; normaliser les va-
leurs propres et les vecteurs propres pour projeter ensuite chaque graphe, enfin (iv) &#224; r&#233;aliser
l&#8217;appariement par regroupement des n&#339;uds projet&#233;s &#224; l&#8217;aide d&#8217;un algorithme de classification.
</p>
<p>Apr&#232;s la d&#233;composition, les donn&#233;es relatives aux n&#339;uds obtenues avec la matrice d&#8217;adjacence
sont projet&#233;es sur les k vecteurs propres les plus importants, formant un sous-espace propre
de dimension r&#233;duite du graphe. Dans ce sous-espace propre, des n&#339;uds ou des ensembles de
n&#339;uds ayant des propri&#233;t&#233;s structurales semblables sont proches les uns des autres, permettant
ainsi une comparaison et un appariement des graphes. N&#233;anmoins, &#233;tant donn&#233; que les graphes
&#224; aligner peuvent poss&#233;der un nombre diff&#233;rent de n&#339;uds, une op&#233;ration de normalisation est
&#233;galement n&#233;cessaire pour assurer de bonnes conditions de comparaison. Par examen du po-
sitionnement de ces projections de n&#339;uds, la mise en correspondance est alors possible. Le
regroupement des points projet&#233;s par une m&#233;thode de classification ascendante hi&#233;rarchique
permet de r&#233;aliser l&#8217;appariement des ensembles de n&#339;uds entre les graphes.
</p>
<p>Lerallut, cherchant &#224; appliquer cette m&#233;thode &#224; un traitement des images, propose une am&#233;-
</p>
<p>226</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodes d&#8217;alignement des propositions
</p>
<p>lioration permettant de prendre en compte des informations suppl&#233;mentaires en cas d&#8217;apparie-
ment de graphes valu&#233;s. Sa m&#233;thode part du r&#233;sultat obtenu avec la m&#233;thode de Kosinov. Cette
derni&#232;re permet d&#8217;abord d&#8217;obtenir la matrice topologique contenant des distances euclidiennes
entre toutes les projections dans le sous-espace propre. Les graphes sont ensuite valu&#233;s par l&#8217;af-
fectation de couleurs &#224; chaque n&#339;ud, et une matrice des distances de couleurs est calcul&#233;e entre
tous les n&#339;uds des deux graphes. Apr&#232;s avoir normalis&#233; ces deux matrices en les divisant par
leur valeur maximum, on calcule une somme pond&#233;r&#233;e. Enfin, apr&#232;s une modification pour &#233;car-
ter les valeurs tr&#232;s distantes, un sous-espace propre de cette matrice est calcul&#233; afin d&#8217;y projeter
tous les n&#339;uds.
</p>
<p>3.2 Application de la m&#233;thode spectrale &#224; l&#8217;alignement des propositions
</p>
<p>L&#8217;alignement des propositions r&#233;alis&#233; par la m&#233;thode de Kosinov s&#8217;appuie uniquement sur la
topologie des graphes. Toutefois, les arbres des propositions dont nous disposons comme entr&#233;e
du syst&#232;me contiennent beaucoup plus d&#8217;informations qui pourraient &#234;tre utilis&#233;es au profit
d&#8217;un bon appariement. Afin d&#8217;exploiter au mieux ces informations disponibles, nous avons tout
d&#8217;abord tent&#233; d&#8217;adapter la m&#233;thode de Lerallut de sorte que les graphes &#224; apparier soient valu&#233;s,
non par l&#8217;affectation de couleurs, mais selon les types de propositions. Mais, afin de calculer la
distance entre deux n&#339;uds sur la base de leur type de proposition, il nous a d&#8217;abord fallu d&#233;finir
une distance entre chaque type de proposition.
</p>
<p>Faute de corpus ad. hoc en quantit&#233; suffisante pour le calcul des probabilit&#233;s des correspon-
dances entre les types, nous avons choisi une m&#233;thode plus empirique, qui permettra &#233;galement
de constituer un premier corpus pour des travaux futurs. Nous avons d&#8217;abord mis en corres-
pondance les types de propositions du fran&#231;ais et du japonais, qui semblaient les plus proches
sur le plan syntaxique. &#201;tant donn&#233; l&#8217;existence d&#8217;un lien non n&#233;gligeable entre les fonctions
syntaxiques et la place dans la phrase, nous avons d&#233;fini une distance entre chaque type de
proposition sur la base de la topologie de la phrase. &#192; cette fin, nous nous sommes principa-
lement appuy&#233;s sur la structure canonique de la phrase fran&#231;aise. La structure canonique est
d&#233;finie comme : &#233;l&#233;ments extra-pr&#233;dicatifs &#8211; th&#232;me &#8211; racine (principale) &#8211; subordonn&#233;es post-
nominales &#8211; subordonn&#233;es post-verbales &#8211; subordonn&#233;es p&#233;riph&#233;riques1. Le principe de base est
que la distance d&#8217;un type donn&#233; de proposition par rapport &#224; la racine, point central, est d&#233;finie
par le nombre de propositions susceptibles d&#8217;appara&#238;tre entre elles.
</p>
<p>Nous avons utilis&#233; les distances ainsi d&#233;finies pour calculer la matrice des distances de couleurs
et r&#233;alis&#233; l&#8217;appariement des graphes avec la m&#233;thode de Lerallut. Mais, nous n&#8217;avons pas obtenu
le r&#233;sultat souhait&#233; : l&#8217;appariement ne refl&#233;tait pas bien les distances des types de propositions.
Afin de mieux refl&#233;ter les informations sur les types de n&#339;uds tout en conservant la structure des
arbres d&#8217;entr&#233;e, nous avons introduit une autre formule. Le principe du nouveau calcul consiste
&#224; prendre compte des informations topologiques pour les relations entre les n&#339;uds du m&#234;me
arbre et des informations sur les types pour les distances entre les n&#339;uds d&#8217;arbres diff&#233;rents.
</p>
<p>&#201;tant donn&#233; les deux graphesX et Y , la matrice finale de la m&#233;thode de Lerallut est une matrice
Mfinal de |X|+|Y |&#215;|X|+|Y |,Mfinal(i, j) correspondant &#224; la somme des distances topologique
et de couleur normalis&#233;es entre les n&#339;uds i et j.
</p>
<p>1Pour une description d&#233;taill&#233;e des types de propositions, voir (Nakamura-Delloye, 2007).
</p>
<p>227</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>Nous d&#233;composons cette matrice finale comme :
</p>
<p>Mfinal =
</p>
<p>[
M11 M12
M21 M22
</p>
<p>]
de mani&#232;re &#224; obtenir les sous-matricesM11 comme une matrice |X|&#215; |X|,M12 comme |X|&#215;
|Y |,M21 comme |Y |&#215; |X| etM22 comme |Y |&#215; |Y |, o&#249; :
</p>
<p>M11(i, j) = disttopo(Xi, Xj)&#215; (1&#8722; &#945;)
M12(i, j) = disttype(Xi, Yj)&#215; &#945;
M21(i, j) = disttopo(Xj, Yi)&#215; (1&#8722; &#945;)
M22(i, j) = disttype(Yi, Yj)&#215; &#945;
</p>
<p>4 M&#233;thode inspir&#233;e de la classification ascendante hi&#233;rarchique
</p>
<p>La deuxi&#232;me m&#233;thode que nous avons d&#233;cid&#233; d&#8217;&#233;tudier est bas&#233;e sur la classification ascendante
hi&#233;rarchique (CAH), celle-ci devant permettre de mieux profiter des informations lexicales tout
en supportant les croisements des traductions. En effet, nous consid&#233;rons maintenant l&#8217;aligne-
ment, comme nous l&#8217;avons fait dans la m&#233;thode spectrale, comme le regroupement des points
semblables appartenant &#224; deux classes diff&#233;rentes.
</p>
<p>4.1 Deux matrices de base
</p>
<p>Nous cr&#233;ons tout d&#8217;abord deux matrices : une contenant les similarit&#233;s de chaque paire de pro-
positions (Msim), et une autre pour stocker les valeurs indiquant l&#8217;&#233;volution du rapport des
longueurs entre les propositions de langues diff&#233;rentes (Mraplong).
</p>
<p>&#201;tant donn&#233; les deux (ensembles de) phrases X et Y , la matrice de similarit&#233; Msim de (|X| +
|Y |)&#215; (|X| + |Y |) est d&#233;finie comme :
</p>
<p>Msim =
</p>
<p>[
M11 M12
M21 M22
</p>
<p>]
avec les sous-matrices M11 de |X| &#215; |X|, M12 de |X| &#215; |Y |, M21 de |Y | &#215; |X| et M22 de
|Y |&#215; |Y |, o&#249; :
</p>
<p>M11(i, j) = synt(Xi, Xj)
M12(i, j) = simlex(Xi, Yj)
M21(i, j) = simlex(Xj, Yi)
M22(i, j) = synt(Yi, Yj)
</p>
<p>simlex(Xi, Yj) est la similarit&#233; lexicale obtenue de mani&#232;re classique telle qu&#8217;avec le coef-
ficient de Dice. Dans notre r&#233;alisation, elle est calcul&#233;e &#224; l&#8217;aide d&#8217;un dictionnaire bilingue et
d&#8217;une liste de mots align&#233;s au moment de l&#8217;alignement des phrases du m&#234;me corpus. Lorsque
la similarit&#233; lexicale est &#224; 0, on lui donne la valeur minimum &#945; pour favoriser la fusion des &#233;l&#233;-
ments (propositions) appartenant aux classes diff&#233;rentes. synt(Xi, Xj) est obtenue de la m&#234;me
mani&#232;re qu&#8217;une matrice d&#8217;adjacence, c&#8217;est-&#224;-dire 0 s&#8217;il n&#8217;existe aucun arc entre les n&#339;uds i et
j dans l&#8217;arbre d&#8217;entr&#233;e, et &#946; s&#8217;il en existe un. Ce m&#233;canisme permet, dans le cas du regroupe-
ment d&#8217;&#233;l&#233;ments appartenant &#224; la m&#234;me classe, de r&#233;aliser l&#8217;agr&#233;gation entre deux &#233;l&#233;ments en
relation de d&#233;pendance, plut&#244;t qu&#8217;entre deux &#233;l&#233;ments qui n&#8217;en ont aucune.
</p>
<p>228</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodes d&#8217;alignement des propositions
</p>
<p>La matrice d&#8217;&#233;volution du rapport des longueursMraplong est d&#233;finie telle qu&#8217;&#224; chacun de ses &#233;l&#233;-
ments (i, j) corresponde l&#8217;&#233;volution du rapport des longueurs entre les propositions de langues
diff&#233;rentes, qui se produira si le regroupement des deux &#233;l&#233;ments consid&#233;r&#233;s, i et j, a lieu. La
valeur indiquant cette &#233;volution est pond&#233;r&#233;e par a afin de p&#233;naliser les fusions importantes
d&#8217;&#233;l&#233;ments.
</p>
<p>Mraplong(i, j) = (rap (F (i, j), J(i, j))&#8722;min (rap (F (i), J(i)) , rap (F (j), J(j)))) &#183; a
o&#249;
&#8211; rap(x, y) est le rapport des longueurs des &#233;l&#233;ments (ou des classes) x et y ;
&#8211; F (x) (resp. J(x)) est la longueur normalis&#233;e de (l&#8217;ensemble des) proposition(s) fran&#231;aise(s)
(resp. japonaise(s)), constituant l&#8217;&#233;l&#233;ment (ou la classe) x ;
</p>
<p>&#8211; F (x, y) (resp. J(x, y)) est la longueur normalis&#233;e de l&#8217;ensemble des propositions fran&#231;aises
(resp. japonaises) constituant la classe regroupant les &#233;l&#233;ments (ou les classes) x et y ;
</p>
<p>&#8211; a est le poids d&#233;fini comme le logarithme de la moyenne des deux longueurs normalis&#233;es
a = log
</p>
<p>(
F (i,j)+J(i,j)
</p>
<p>2
</p>
<p>)
.
</p>
<p>4.2 Agr&#233;gation et recalcul des matrices
</p>
<p>En combinant ces deux matrices, de similarit&#233; et d&#8217;&#233;volution du rapport des longueurs, une
troisi&#232;me matrice, matrice courante, est calcul&#233;e et recalcul&#233;e apr&#232;s chaque agr&#233;gation de deux
&#233;l&#233;ments. La matrice courante est d&#233;finie comme :
</p>
<p>Mcourante(i, j) =
Mraplong(i, j)
</p>
<p>Msim(i, j)
</p>
<p>Dans cette matrice courante, nous cherchons la valeur minimum pour r&#233;aliser l&#8217;agr&#233;gation de
deux &#233;l&#233;ments (ou classes). Apr&#232;s l&#8217;agr&#233;gation des deux &#233;l&#233;ments, nous recalculons la matrice
d&#8217;&#233;volution du rapport des longueurs, en tenant compte du changement de longueurs des &#233;l&#233;-
ments regroup&#233;s. La matrice de similarit&#233; est &#233;galement recalcul&#233;e selon le crit&#232;re d&#8217;agr&#233;gation
adopt&#233;. Dans notre r&#233;alisation, les similarit&#233;s des classes nouvellement cr&#233;&#233;es suite &#224; l&#8217;agr&#233;ga-
tion sont obtenues en divisant la somme des similarit&#233;s des &#233;l&#233;ments (ou classes) regroup&#233;s,
par la valeur v calcul&#233;e sur la base du nombre de propositions faisant partie de cette nouvelle
classe. &#192; partir de ces deux matrices nouvellement calcul&#233;es, on calcule &#224; nouveau la matrice
courante et recommen&#231;ons les op&#233;rations d&#8217;agr&#233;gation tout comme la CAH. &#192; la diff&#233;rence
de l&#8217;algorithme classique de CAH, l&#8217;it&#233;ration s&#8217;arr&#234;te dans notre op&#233;ration d&#232;s que toutes les
propositions sont regroup&#233;es avec au moins une proposition de l&#8217;autre langue.
</p>
<p>5 &#201;valuation des m&#233;thodes
</p>
<p>Nous avons r&#233;alis&#233; une &#233;valuation des m&#233;thodes propos&#233;es avec quatre corpus parall&#232;les de
natures diverses et de langues originaires diff&#233;rentes (1, 2 en fran&#231;ais et 3, 4 en japonais) :
(1) corpus LMD constitu&#233; d&#8217;articles du Monde Diplomatique, (2) corpus BRVF et (3) BRVJ
compos&#233;s respectivement de deux et d&#8217;un brevets techniques, (4) corpus FdT, un extrait du
roman &#171; La fin des temps &#187; de Haruki MURAKAMI. Le corpus est d&#8217;abord align&#233; au niveau
des phrases par notre syst&#232;me d&#8217;alignement des phrases (Nakamura-Delloye, 2005) et le r&#233;sultat
est v&#233;rifi&#233; manuellement. Puis, pour chaque phrase, la d&#233;tection des propositions est r&#233;alis&#233;e &#224;
</p>
<p>229</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>l&#8217;aide de nos d&#233;tecteurs de propositions du fran&#231;ais (Nakamura-Delloye, 2006) et du japonais,
et le r&#233;sultat d&#8217;analyse est &#233;galement corrig&#233; manuellement.
</p>
<p>Caract&#233;ristiques R&#233;sultat
(A/B) (C) (D) (E) Partiel (F) Exact (G) Paires cr&#233;&#233;es (H)
Phr. Fr Jp Prop. M1 M2 M3 M1 M2 M3 M1 M2 M3
</p>
<p>LMD 222/500 644 1026 583 0,643 0,784 0,951 0,127 0,200 0,591 0,813 0,746 0,918
BRVF 161/339 447 854 444 0,619 0,705 0,977 0,081 0,158 0,706 0,750 0,757 0,867
BRVJ 44/66 146 280 141 0,663 0,689 0,990 0,048 0,078 0,537 0,738 0,638 0,674
FdT 99/200 286 428 251 0,670 0,659 0,932 0,138 0,151 0,464 0,892 0,817 0,936
</p>
<p>TAB. 1 &#8211; R&#233;sultats de l&#8217;alignement par les trois m&#233;thodes
</p>
<p>Nous avons utilis&#233; au total 1105 paires de phrases align&#233;es (d&#233;tails pour chaque corpus indiqu&#233;s
en (B), tableau 1). Parmi celles-ci, nous n&#8217;avons pris en compte dans nos r&#233;sultats d&#8217;&#233;valuation
que les paires comportant plus d&#8217;une proposition dans chaque langue, soit 526 paires de phrases
(A), qui repr&#233;sentent 1523 propositions fran&#231;aises (C) et 2588 propositions japonaises (D),
composant 1419 paires de propositions en relation de traduction (E). Nous pouvons constater
que le nombre de propositions japonaises est au moins 50% plus &#233;lev&#233; que celui des propositions
fran&#231;aises. Cela implique que le mod&#232;le de traduction 1-1 (mod&#232;le pour la paire en relation de
traduction constitu&#233;e d&#8217;une unit&#233; dans une langue avec une unit&#233; de l&#8217;autre langue) est beaucoup
moins courant que dans le cas de l&#8217;alignement des phrases. En effet, les paires 1-1 repr&#233;sentent
moins de 50% et le nombre d&#8217;alignements d&#8217;une proposition fran&#231;aise avec de 2 &#224; plus de 4
propositions japonaises s&#8217;&#233;l&#232;ve &#224; environ 40%. Ce type de paire complexe est une source de
perturbation pour les m&#233;thodes d&#8217;alignement des phrases classiques.
</p>
<p>Dans le tableau 1, est pr&#233;sent&#233; le r&#233;sultat de notre &#233;valuation des trois m&#233;thodes : m&#233;thode
spectrale uniquement topologique (M1), m&#233;thode spectrale avec types de propositions (M2) et
m&#233;thodes avec classification ascendante hi&#233;rarchique (M3). La zone marqu&#233;e &#171; Partiel &#187; (F) in-
dique la proportion de paires partiellement correctes parmi l&#8217;ensemble des paires effectivement
align&#233;es, et la zone marqu&#233;e &#171; Exact &#187; (G), celle des paires exactement align&#233;es correctement.
Enfin, la zone marqu&#233;e &#171; Paires cr&#233;&#233;es &#187; (H), correspond &#224; la proportion du nombre de paires
cr&#233;&#233;es par rapport au nombre correct de paires.
</p>
<p>Les r&#233;sultats montrent que nous avons r&#233;ussi &#224; am&#233;liorer la m&#233;thode de Kosinov (M1) avec
l&#8217;introduction des types de proposition (M2), encore que les chiffres obtenus ne soit pas encore
satisfaisants. En effet, il existe beaucoup de cas o&#249; la topologie des graphes n&#8217;est pas suffisante
pour l&#8217;appariement des arbres syntaxiques : il arrive, notamment, qu&#8217;un arbre soit interpr&#233;t&#233;
comme sym&#233;trique, alors qu&#8217;il ne l&#8217;est pas. C&#8217;est par exemple le cas des arbres des propositions
(pr&#233;sent&#233;s figure 3) des phrases parall&#232;les suivantes :
</p>
<p>Phrase fran&#231;aise : F1 : RACINE Paris avait estim&#233;, &#224; l&#8217;&#233;poque || F2 : SUBQ , qu&#8217;une r&#233;f&#233;rence
aux valeurs religieuses n&#8217;&#233;tait pas acceptable || F3 : SUBP car elle soulevait des probl&#232;mes
politiques et constitutionnels en France.
Phrase japonaise : J1 : EXTRA t&#244;ji,(&#224; l&#8217;&#233;poque) || J2 : THEME furansu wa, (La France) || J3 : THEME
sh&#251;ky&#244;teki kachi eno genky&#251; wa (une r&#233;f&#233;rence aux valeurs religieuses) || J4 : SUBAGG koku-
nai de seijij&#244;, kenp&#244;j&#244; no mondai wo hikiokosuga yueni (car [elle] soul&#232;ve des probl&#232;mes
politiques et constitutionnels dans le pays) || J5 : SUBCIT mitomerarenai tono (qui dit que ce
n&#8217;&#233;tait pas acceptable) || J6 : RACINE shisei wo totta.([La France] a pris la position)
</p>
<p>Dans les cas comme cet exemple, l&#8217;introduction des informations sur le type de proposition a
permis d&#8217;am&#233;liorer le r&#233;sultat et de fournir un alignement correct.
</p>
<p>230</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodes d&#8217;alignement des propositions
</p>
<p>F1
</p>
<p>F2
</p>
<p>F3
</p>
<p>J6
</p>
<p>J1 J2
</p>
<p>J3 J4
</p>
<p>J5
</p>
<p>Racine Racine
</p>
<p>Th&#232;me
</p>
<p>sub.
de citation
</p>
<p>Th&#232;me sub. &#224; connecteur 
agglutinant
</p>
<p>&#233;l&#233;.
extra-pr&#233;dicatif
</p>
<p>sub.
post-verbale
</p>
<p>sub.
p&#233;riph&#233;rique
</p>
<p>FIG. 3 &#8211; Arbres des propositions et appariement correct de leurs n&#339;uds
</p>
<p>Toutefois, beaucoup de phrases n&#233;cessitaient encore plus d&#8217;informations et leur alignement n&#8217;a
&#233;t&#233; am&#233;lior&#233; qu&#8217;avec la m&#233;thode &#224; classification ascendante hi&#233;rarchique (M3) bas&#233;e sur la
similarit&#233; lexicale. Cette m&#233;thode poss&#232;de encore des points potentiels d&#8217;am&#233;lioration (comme
la d&#233;sambigu&#239;sation lexicale par exemple), mais la capacit&#233; d&#8217;alignement avec des croisements
est un atout crucial. De plus, comme nous le savons bien, la m&#233;thode de classification nous
permet de d&#233;finir nous-m&#234;me la fin du d&#233;veloppement des fusions. Par ce m&#233;canisme, nous
pourrions obtenir un r&#233;sultat moins robuste mais plus fiable.
</p>
<p>6 Conclusion et perspectives des travaux futurs
</p>
<p>Nous avons pr&#233;sent&#233; deux m&#233;thodes pour l&#8217;alignement des propositions des textes parall&#232;les
fran&#231;ais-japonais. L&#8217;une s&#8217;appuie sur une m&#233;thode d&#8217;appariement des graphes consistant &#224; pro-
jeter les n&#339;uds sur un sous-espace propre. L&#8217;autre est bas&#233;e sur une m&#233;thode inspir&#233;e de la
classification ascendante hi&#233;rarchique.
</p>
<p>Les deux m&#233;thodes sont caract&#233;ris&#233;es par leur capacit&#233; d&#8217;alignement des traductions crois&#233;es
dans l&#8217;ordre d&#8217;apparition, ce qui &#233;tait impossible pour beaucoup de m&#233;thodes classiques d&#8217;ali-
gnement des phrases. Le r&#233;sultat obtenu avec la m&#233;thode spectrale n&#8217;&#233;tait pas satisfaisant. Il est
en effet difficile de trouver une formule permettant de refl&#233;ter les informations suppl&#233;mentaires
autres que la topologie. Une tr&#232;s r&#233;cente &#233;tude (Fraikin et al., 2006) propose une am&#233;lioration
visant le traitement des graphes orient&#233;s. N&#233;anmoins, du fait des diff&#233;rences consid&#233;rables de
structures, l&#8217;application de cette m&#233;thode &#224; l&#8217;alignement des langues tr&#232;s diff&#233;rentes semble dif-
ficile. En revanche, l&#8217;alignement bas&#233; sur la m&#233;thode de classification ascendante hi&#233;rarchique
est prometteur dans la mesure o&#249; cette technique permet d&#8217;exploiter plus efficacement diff&#233;-
rentes informations tout en supportant les croisement des traductions.
</p>
<p>&#192; travers cette exp&#233;rience, nous avons &#233;galement rencontr&#233; beaucoup de constructions pour
lesquelles un appariement m&#234;me manuel &#233;tait tr&#232;s difficile. Ces exemples sont, pour nous, non
seulement des indicateurs de futurs obstacles &#224; franchir, mais aussi tr&#232;s enrichissants du point de
vue de l&#8217;&#233;tude contrastive sur les structures syntaxiques des phrases fran&#231;aise et japonaise. Nos
travaux sur l&#8217;alignement pourraient non seulement participer au d&#233;veloppement du domaine
du TAL, mais aussi contribuer aux progr&#232;s des &#233;tudes linguistiques contrastives du fran&#231;ais-
japonais, qui favoriseraient &#224; leur tour l&#8217;innovation de nos recherches.
</p>
<p>231</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>R&#233;f&#233;rences
BOUTSIS S. &amp; PIPERIDIS S. (1998). Aligning clauses in parallel texts. In Proceedings of the
3rd Conference on Empirical Methods in Natural Language Processing, p. 17 &#8211; 26.
BROWN P. F., LAI J. C. &amp; MERCER R. L. (1991). Aligning sentences in parallel corpora. In
Proceedings of the 29th Annual Meeting of the Association for Computational Linguistics, p.
169 &#8211; 176.
FRAIKIN C., NESTEROV Y. &amp; VAN DOOREN P. (2006). A gradient-type algorithm optimizing
the coupling between matrices and application to graph matching. In Proceedings of the 13-th
ILAS conference in Amsterdam.
IMAMURA K. (2000). A hierarchical phrase alignment from english and japanese bilingual
text. In Proceedings of CICLing 2001.
KAJI H., KIDA Y. &amp; MORIMOTO Y. (1993). Learning translation templates from bilingual
text. In Proceedings of the 14th International Conference on Computational Linguistics (CO-
LING&#8217;92), p. 672&#8211;678.
KASHIOKA H., MARUYAMA T. &amp; TANAKA H. (2003). Building a parallel corpus for mono-
logue with clause alignment. In Proceedings of the 9th Machine Translation Summit, p. 216 &#8211;
223.
KOSINOV S. &amp; CAELLI T. (2002). Inexact multisubgraph matching using graph eigenspace
and clustering models. In Proceedings of SSPR/SPR, volume 2396, p. 133&#8211;142.
KOSINOV S. &amp; CAELLI T. (2004). An eigenspace projection clustering method for inexact
graph matching. IEEE transactions on pattern analysis and machine intelligence, 26(4), 515&#8211;
519.
LERALLUT R. (2006). Mod&#233;lisation et interpr&#233;tation d&#8217;images &#224; l&#8217;aide de graphes. Th&#232;se de
doctorat, &#201;cole des Mines de Paris.
MATSUMOTO Y., ISHIMOTO H. &amp; UTSURO T. (1993). Structural matching of parallel texts.
In Proceedings of the 31st Annual Meeting of the Association for Computational Linguistics,
p. 23&#8211; 30.
NAKAMURA-DELLOYE Y. (2005). Syst&#232;me AlALeR : Alignement au niveau phrastique des
textes parall&#232;les fran&#231;ais-japonais. In RECITAL 2005.
NAKAMURA-DELLOYE Y. (2006). D&#233;tection automatique des propositions syntaxiques du
fran&#231;ais. In TALN 2006.
NAKAMURA-DELLOYE Y. (2007). Typologie des subordonn&#233;es et des connecteurs en vue
de la d&#233;tection automatique des propositions syntaxiques du fran&#231;ais. In Description linguis-
tique pour le traitement automatique du fran&#231;ais, Cahiers du Cental. Presses universitaires de
Louvain. (&#224; para&#238;tre).
PIPERIDIS S., PAPAGEORGIOU H. &amp; BOUTSIS S. (2000). From sentences to words and
clauses. In J. V&#201;RONIS, Ed., Parallel text processing, p. 117 &#8211; 138. Kluwer Academic Publi-
shers.
WANG X. &amp; REN F. (2005). Chinese-japanese clause alignment. Lecture Notes in Computer
Science, 3406, 400&#8211;412.
WATANABE H., KUROHASHI S. &amp; ARAMAKI E. (2000). Finding structural correspondences
from bilingual parsel corpus for corpus-based traslation. In Proceedings of COLING 2000, p.
906&#8211;912.
</p>
<p>232</p>

</div></div>
</body></html>