<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Utilisation d&#8217;une approche bas&#233;e sur la recherche cross-lingue d&#8217;information pour l&#8217;alignement de phrases &#224; partir de textes bilingues Arabe-Fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Utilisation d&#8217;une approche bas&#233;e sur la recherche cross-lingue 
d&#8217;information pour l&#8217;alignement de phrases 
 &#224; partir de textes bilingues Arabe-Fran&#231;ais 
</p>
<p>Nasredine SEMMAR, Christian FLUHR
CEA, LIST, LIC2M 
</p>
<p>18 route du Panorama, BP6, FONTENAY AUX ROSES, F- 92265 France 
{nasredine.semmar,christian.fluhr}@cea.fr
</p>
<p>R&#233;sum&#233;. L&#8217;alignement de phrases &#224; partir de textes bilingues consiste &#224; reconna&#238;tre les 
phrases qui sont traductions les unes des autres. Cet article pr&#233;sente une nouvelle approche 
pour aligner les phrases d&#8217;un corpus parall&#232;le. Cette approche est bas&#233;e sur la recherche cross-
lingue d&#8217;information et consiste &#224; construire une base de donn&#233;es des phrases du texte cible et 
consid&#233;rer chaque phrase du texte source comme une requ&#234;te &#224; cette base. La recherche cross-
lingue utilise un analyseur linguistique et un moteur de recherche. L&#8217;analyseur linguistique 
traite aussi bien les documents &#224; indexer que les requ&#234;tes et produit un ensemble de lemmes 
normalis&#233;s, un ensemble d&#8217;entit&#233;s nomm&#233;es et un ensemble de mots compos&#233;s avec leurs 
&#233;tiquettes morpho-syntaxiques. Le moteur de recherche construit les fichiers invers&#233;s des 
documents en se basant sur leur analyse linguistique et retrouve les documents pertinents &#224; 
partir de leur indexes. L&#8217;aligneur de phrases a &#233;t&#233; &#233;valu&#233; sur un corpus parall&#232;le Arabe-
Fran&#231;ais et les r&#233;sultats obtenus montrent que 97% des phrases ont &#233;t&#233; correctement align&#233;es. 
</p>
<p>Abstract. Sentence alignment consists in identifying correspondences between sentences 
in one language and sentences in the other language. This paper describes a new approach to 
aligning sentences from a parallel corpora. This approach is based on cross-language 
information retrieval and consists in building a database of sentences of the target text and 
considering each sentence of the source text as a query to that database. Cross-language 
information retrieval uses a linguistic analyzer and a search engine. The linguistic analyzer 
processes both documents to be indexed and queries to produce a set of normalized lemmas, a 
set of named entities and a set of nominal compounds with their morpho-syntactic tags. The 
search engine builds the inverted files of the documents on the basis of their linguistic analysis 
and retrieves the relevant documents from the indexes. An evaluation of the sentence aligner 
was performed based on a Arabic to French parallel corpus and results show that 97% of 
sentences were correctly aligned. 
</p>
<p>Mots-cl&#233;s :   alignement de phrases, corpus parall&#232;le, recherche cross-lingue 
d&#8217;information.
Keywords:   sentence alignment, parallel corpora, cross-lingual information retrieval. 
</p>
<p>411</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nasredine SEMMAR, Christian FLUHR
</p>
<p>1 Introduction 
L&#8217;alignement de textes bilingues dont l&#8217;un est une traduction de l&#8217;autre consiste &#224; mettre en 
relation des unit&#233;s linguistiques ou logiques qui se correspondent dans les deux textes. Ces 
unit&#233;s peuvent &#234;tre des paragraphes, des phrases, des syntagmes, des mots, etc. L&#8217;alignement 
de textes permet l&#8217;&#233;laboration de lexiques et de bases de donn&#233;es phras&#233;ologiques 
multilingues n&#233;cessaires pour la traduction et la terminologie. Plusieurs techniques 
d&#8217;alignement de textes ont &#233;t&#233; propos&#233;es (Gale, Church, 1991) (Brown et al., 1991) (Debili, 
Samouda, 1992) (Gaussier, 1995) (Melamed, 1996) (Fluhr et al., 2000). 
</p>
<p>Dans cet article, nous pr&#233;sentons un aligneur de phrases &#224; partir de corpus parall&#232;les utilisant 
une approche bas&#233;e sur la recherche d&#8217;information cross-lingue et combinant plusieurs 
sources d&#8217;information (dictionnaire bilingue, longueurs des phrases, num&#233;ros d&#8217;ordre des 
phrases dans le corpus parall&#232;le). Cet aligneur a &#233;t&#233; d&#233;velopp&#233; initialement pour aligner les 
corpus parall&#232;les Fran&#231;ais-Anglais, il a &#233;t&#233; ensuite adapt&#233; pour aligner les corpus des couples 
de langues Arabe-Fran&#231;ais et Arabe-Anglais. 
</p>
<p>Nous pr&#233;sentons dans la section 2 les principaux composants du moteur de recherche cross-
lingue du LIC2M, en particulier, nous nous focalisons sur les modules de l&#8217;analyse 
linguistique. Dans la section 3, nous d&#233;crivons le prototype de notre aligneur de phrases. Nous 
discutons dans la section 4 les r&#233;sultats obtenus en alignant le corpus MD (Monde 
Diplomatique) de la campagne ARCADE II. La section 5 conclut notre &#233;tude et pr&#233;sente nos 
travaux futurs. 
</p>
<p>2 Le moteur de recherche cross-lingue 
Le moteur de recherche cross-lingue permet, &#224; partir d&#8217;une requ&#234;te en une seule langue, de 
fournir des r&#233;ponses trouv&#233;es dans des documents qui sont dans d&#8217;autres langues. Le moteur 
de recherche cross-lingue du LIC2M est compos&#233; d&#8217;un analyseur linguistique, d&#8217;un analyseur 
statistique, d&#8217;un reformulateur et d&#8217;un comparateur (Semmar et al., 2005). 
</p>
<p>2.1 L'analyse linguistique 
L'analyse linguistique des documents et de la requ&#234;te est un composant important dans le 
syst&#232;me de recherche d'information cross-lingue du LIC2M. L'analyseur linguistique LIMA 
(LIc2m Multilingual Analyser) est compos&#233; d&#8217;un ensemble de modules dont le nombre et la 
nature varient selon la langue trait&#233;e et un ensemble de ressources linguistiques. Selon que 
l'on traite l'arabe, le fran&#231;ais ou le chinois, le syst&#232;me sait modifier le traitement et utiliser les
ressources adapt&#233;es. Nous pr&#233;sentons dans les sections suivantes les modules et les ressources 
utilis&#233;s dans l&#8217;analyseur linguistique LIMA en se focalisant sur les traitements sp&#233;cifiques &#224; la 
langue arabe (Grefenstette et al., 2005). 
</p>
<p>2.1.1 Modules de traitement linguistique 
Certains des ces modules sont utilis&#233;s pour le traitement de la majorit&#233; des langues trait&#233;es par 
LIMA. D'autres, plus sp&#233;cifiques, ne sont utilis&#233;s que pour certaines langues. 
</p>
<p>1. La tokenisation qui d&#233;coupe le texte en mots (tokens). 
</p>
<p>412</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche cross-lingue d&#8217;information pour l&#8217;alignement de phrases Arabe-Fran&#231;ais 
</p>
<p>2. La consultation du dictionnaire des formes qui permet &#233;ventuellement de r&#233;cup&#233;rer 
des informations linguistiques concernant les mots &#224; reconna&#238;tre. Pour ceux qui sont 
semi voyell&#233;s ou non voyell&#233;s, cette consultation du lexique permet de r&#233;cup&#233;rer les 
formes voyell&#233;es correspondantes, c'est &#224; dire leurs alternatives orthographiques 
lorsqu'elles existent. Dans le cas par exemple du mot non voyell&#233; !&quot;&#1585;$% la recherche 
dans le dictionnaire donne les deux alternatives orthographiques suivantes: !&quot;&#1614;&#1614;&#1585;$&#1618;%&#1614;
&quot;Ecole&quot; (Nom commun f&#233;minin singulier) et !&quot;&#1614;(&#1585;$&#1614;%&#1615; &quot;Institutrice&quot; (Nom commun 
f&#233;minin singulier). 
</p>
<p>3. Lorsque leur forme de surface le permet, les mots sont segment&#233;s en proclitique-
radical-enclitique ou en proclitique-radical ou en radical-enclitique ou en proclitique-
enclitique. Ce module de segmentation n&#8217;est utilis&#233; que pour l&#8217;Arabe et l&#8217;Espagnol. 
Par exemple, le mot *&quot;&#1585;$% est candidat au d&#233;coupage $&#1614;%&#1615; &#1587;(&#1585; +,  &quot;Instituteur&quot; + &quot;lui, &#224; lui&quot;. 
</p>
<p>4. Les expressions idiomatiques sont ensuite reconnues et regroup&#233;es pour &#234;tre 
consid&#233;r&#233;es comme un seul mot dans le graphe d'analyse. Cette reconnaissance se fait 
&#224; l'aide de r&#232;gles de d&#233;clencheurs qui sont g&#233;n&#233;ralement des lemmes. Ces r&#232;gles 
permettent par exemple de reconna&#238;tre les noms de mois arabes &#1577;$&#1614;.&#1618;0&#1616;1&#1575; &#1608;&#1615;&#1584; et 51&#1614;&#1608;6&#1615;&#1575; &#1609;&#1614;&#1583;9:&#1614;;&#1615;
comme des mots uniques. 
</p>
<p>5. Si, apr&#232;s ces &#233;tapes, un mot reste inconnu, le syst&#232;me lui attribue une/des cat&#233;gorie(s) 
par d&#233;faut en s'appuyant g&#233;n&#233;ralement sur des informations r&#233;v&#233;l&#233;es par sa forme de 
surface. 
</p>
<p>6. Apr&#232;s cette analyse morphologique, la majorit&#233; des mots restent ambigus notamment 
&#224; cause du nombre &#233;lev&#233; des voyellations possibles. Le r&#244;le du d&#233;sambigu&#239;seur 
morpho-syntaxique est ensuite de r&#233;duire le nombre des ambigu&#239;t&#233;s en utilisant des 
matrices de d&#233;sambigu&#239;sation. Ce sont des matrices de bi-grammes et tri-grammes 
obtenues &#224; partir d'un corpus de 13 200 mots pour l&#8217;Arabe et de 25 000 mots pour le 
Fran&#231;ais. Ce corpus est &#233;tiquet&#233; et d&#233;sambigu&#239;s&#233; manuellement. La pr&#233;cision du 
d&#233;sambigu&#239;seur morpho-syntaxique est d&#8217;environ 91% pour l&#8217;Arabe et de 94% pour 
le Fran&#231;ais. 
</p>
<p>7. Une analyse syntaxique tente ensuite, par un jeu de r&#232;gles &#233;crites &#224; la main, d'&#233;tablir 
les relations de d&#233;pendance entre les mots dans un m&#234;me syntagme et entre les 
syntagmes dans une m&#234;me phrase. Par exemple, dans la cha&#238;ne nominale  ,9&lt;:1&#1575; =&gt;&#1586;@A
!B19C1&#1575; &quot;Distribution des eaux potables&quot;, l&#8217;analyse syntaxique consid&#232;re que cette 
cha&#238;ne est un mot compos&#233; des mots =&gt;&#1586;@A &quot;Distribution&quot; (nom commun), ,9&lt;% &quot;Eaux&quot; 
(nom commun) et !B19D &quot;Potables&quot; (adjectif). 
</p>
<p>8. Une reconnaissance des entit&#233;s nomm&#233;es est ensuite activ&#233;e. Cette &#233;tape de l'analyse 
utilise des fichiers de listes ainsi que de r&#232;gles de d&#233;clencheurs pour reconna&#238;tre des 
entit&#233;s telles que les noms de personnes, d'organisations, de produits et de lieux, les 
dates ainsi que les unit&#233;s de mesure. Ainsi, un &#233;nonc&#233; comme &#1587;&#1585;9%&#1614; E&#1616;F&#1618;G&#1614; H%&#1616; &#1604;J&#1608;6&#1614;&#1575; &quot;Le 
premier du mois de Mars&quot; est reconnu comme une date et K&quot;&#1614;&#1618;&#1608;6&#1614;&#1575; &#1602;E&#1618;JM1&#1575; &quot;Le Moyen-
Orient&quot; est reconnu comme un nom de lieu. 
</p>
<p>413</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nasredine SEMMAR, Christian FLUHR
</p>
<p>2.1.2 Ressources linguistiques 
Pour le traitement de l'arabe, le syst&#232;me dispose de ressources lexicales et grammaticales 
suivantes: 
</p>
<p>&#8226; Un dictionnaire de formes qui contient toutes les formes fl&#233;chies et d&#233;riv&#233;es 
simples des mots en arabe. Ce dictionnaire est obtenu par un fl&#233;chisseur automatique 
d&#233;velopp&#233; au sein du LIC2M (Debili, Zouari, 1985). Cet outil produit 3 164 000 
entr&#233;es &#224; partir de 14 000 lemmes (noms, adjectives et verbes). Le dictionnaire final 
contient &#233;galement les listes ferm&#233;es comme les pronoms, les pr&#233;positions, les 
nombres, etc. Les mots du dictionnaire ont deux sortes d'entr&#233;es: des formes 
compl&#232;tement voyell&#233;es ou compl&#232;tement d&#233;voyell&#233;es. Seules les entr&#233;es voyell&#233;es 
poss&#232;dent des informations linguistiques (cat&#233;gorie, genre, nombre, etc.). Les entr&#233;es 
non voyell&#233;es, qui sont ambigu&#235;s par nature, ne poss&#232;dent que des pointeurs vers les 
entr&#233;es voyell&#233;es correspondantes et donc leur informations linguistiques comme il a 
&#233;t&#233; montr&#233; dans l'exemple de !&quot;&#1585;$% plus haut. Le contenu du dictionnaire ne permet pas 
seulement d'attribuer des voyellations aux mots non voyell&#233;s mais aussi de proposer 
les diff&#233;rentes alternatives concernant certaines lettres comme c'est la cas pour  &#1571;  &#1573; ( qui 
sont trois mani&#232;res diff&#233;rentes d'&#233;crire la lettre &#1575;  et pour &#1609;&#1569; et &#1608;&#1569;  qui sont deux 
alternatives &#224; l'&#233;criture pour les lettres &#1574;  et  &#1574;.
</p>
<p>&#8226; Un dictionnaire de proclitiques ainsi qu'un dictionnaire d'enclitiques simples 
et compos&#233;s. La m&#234;me structure est attribu&#233;e &#224; ces entr&#233;es, c'est &#224; dire une forme 
voyell&#233;e et une forme non voyell&#233;e correspondante. Par exemple, le proclitique /&#1616;1&#1614;&#1614;&#1571; est 
d&#233;compos&#233; en trois parties  &#1614;&#1571;+ &#1614;&#1601; +&#1616;&#1576; .
</p>
<p>&#8226; Des dictionnaires bilingues pour toutes les paires de langues trait&#233;es par le 
syst&#232;me sont &#233;galement disponibles. Ces dictionnaires permettent la reformulation 
bilingue dans le cadre de la recherche d'information cross-lingue. Le dictionnaire 
bilingue Arabe-Fran&#231;ais est compos&#233; de 120 000 entr&#233;es valid&#233;es manuellement. 
</p>
<p>2.2 Analyse statistique 
L&#8217;analyse statistique consiste &#224; attribuer un poids aux mots simples et aux mots compos&#233;s sur 
l'ensemble des documents index&#233;s, selon le &quot;degr&#233; d&#8217;information&quot; qu&#8217;ils contiennent. Ce poids 
est li&#233; &#224; l'h&#233;t&#233;rog&#233;n&#233;it&#233; de r&#233;partition du terme dans la base de documents. Il sera maximum si 
le terme est compl&#232;tement discriminant, c'est-&#224;-dire s'il appara&#238;t dans un seul document, et 
minimum s'il n'est pas discriminant et appara&#238;t dans tous les documents (Andreewsky et al., 
1981). 
</p>
<p>2.3 Reformulation de la requ&#234;te 
Dans certains cas, l&#8217;analyse linguistique et l&#8217;analyse statistique expliqu&#233;es ci-dessus ne 
suffisent pas &#224; &#233;tablir un lien entre la requ&#234;te et les documents pertinents. Dans ce cas, il est 
n&#233;cessaire d&#8217;ajouter un &#233;l&#233;ment s&#233;mantique au processus sur la base de la requ&#234;te originale 
afin d&#8217;inf&#233;rer ce que recherche l&#8217;utilisateur. Il s&#8217;agit donc d&#8217;&#233;tendre la requ&#234;te pos&#233;e en 
utilisant d&#8217;autres formulations de l&#8217;id&#233;e qui y est exprim&#233;e pour que soient retrouv&#233;s les 
documents susceptibles d&#8217;&#234;tre pertinents. Cette reformulation peut aussi bien &#234;tre dans la 
</p>
<p>414</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche cross-lingue d&#8217;information pour l&#8217;alignement de phrases Arabe-Fran&#231;ais 
</p>
<p>m&#234;me langue (synonymes, hyponymes, etc.) que dans des langues diff&#233;rentes, et pour ce faire, 
le syst&#232;me du LIC2M utilise des dictionnaires de reformulation monolingue et bilingue. 
</p>
<p>2.4 Calcul de la proximit&#233; s&#233;mantique 
Le comparateur sert &#224; calculer la proximit&#233; s&#233;mantique entre la requ&#234;te et les documents 
index&#233;s &#224; partir des mots communs (mots de l'intersection requ&#234;te/documents). Ce 
comparateur consiste, d'une part, &#224; identifier les meilleures intersections requ&#234;te/documents, et 
d'autre part, &#224; regrouper les intersections identiques et leur attribuer un poids. Le r&#233;sultat est 
pr&#233;sent&#233; sous forme d'une liste de classes d'intersections dans un ordre croissant de poids. Les 
documents de la base sont index&#233;s et stock&#233;s dans des fichiers invers&#233;s. On construit un index 
pour chacune des langues des documents constituant le corpus et on applique l&#8217;analyse 
linguistique pour les documents &#224; indexer et pour les requ&#234;tes. 
</p>
<p>2.5 R&#233;sultats de la recherche cross-lingue 
Le syst&#232;me de recherche cross-lingue d&#8217;information du LIC2M utilise le mod&#232;le bool&#233;en 
pond&#233;r&#233;. Lorsque la requ&#234;te est effectu&#233;e, les documents sont renvoy&#233;s group&#233;s par classes, 
qui repr&#233;sentent la r&#233;partition des mots de la requ&#234;te dans les bases de donn&#233;es. Chaque classe 
contient une liste de documents class&#233;s par ordre de pertinence. Par exemple, le moteur de 
recherche retourne 12 classes pour la requ&#234;te !&quot;#$%&#1575; &#1583;&#1585;&#1575;)* &#1577;&#1585;&#1575;&#1583;&#1573; &quot;gestion des ressources en eau&quot; 
(Tableau 1). 
</p>
<p>Classe Termes de la requ&#234;te Nombre de termes de la requ&#234;te 
1 &#1577;&#1585;&#1575;&#1583;&#1573;_&#1583;&#1585;&#1575;)*_!&quot;#* 1
</p>
<p>2 &#1583;&#1585;&#1575;)*_ !&quot;#*,&#1577;&#1585;&#1575;&#1583;&#1573;_&#1583;&#1585;&#1575;)* 2
</p>
<p>3  !&quot;#*,&#1577;&#1585;&#1575;&#1583;&#1573;_&#1583;&#1585;&#1575;&#1608; 2
</p>
<p>4  &#1577;&#1585;&#1575;&#1583;&#1573;,&#1583;&#1585;&#1575;)*_!&quot;#* 2
</p>
<p>5 &#1577;&#1585;&#1575;&#1583;&#1573;_&#1583;&#1585;&#1575;)* 1
</p>
<p>6 &#1583;&#1585;&#1575;)*_!&quot;#* 1
</p>
<p>7  &#1577;&#1585;&#1575;&#1583;&#1573;, &#1583;&#1585;&#1575;)*,!&quot;#* 3
</p>
<p>8  &#1577;&#1585;&#1575;&#1583;&#1573;,!&quot;#* 2
</p>
<p>9  &#1577;&#1585;&#1575;&#1583;&#1573;,&#1583;&#1585;&#1575;)* 2
</p>
<p>10  &#1583;&#1585;&#1575;)*,!&quot;#* 2
</p>
<p>11 !&quot;#* 1
</p>
<p>12 &#1583;&#1585;&#1575;)* 1
Tableau 1 : Classes retrouv&#233;es pertinentes pour la requ&#234;te &#1577;&#1585;&#1575;&#1583;&#1573; &#1583;&#1585;&#1575;)* !&quot;#$%&#1575;
</p>
<p>415</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nasredine SEMMAR, Christian FLUHR
</p>
<p>3 Alignement de phrases bas&#233; sur la recherche cross-lingue 
L&#8217;alignement de phrases &#224; partir de textes bilingues bas&#233; sur la recherche cross-lingue 
d&#8217;information consiste &#224; construire une base de donn&#233;es des phrases du texte cible (CorpusFr) 
et consid&#233;rer chaque phrase du texte source (CorpusAr) comme une requ&#234;te &#224; cette base de 
donn&#233;es (Figure 1). 
</p>
<p>Figure 1 : Etapes de l&#8217;alignement de phrases 
</p>
<p>La validation de l&#8217;alignement est bas&#233;e sur trois crit&#232;res: 
</p>
<p>&#8226; Position de la phrase dans le document : L&#8217;alignement est valid&#233; si le rang (num&#233;ro 
d&#8217;ordre) de la phrase &#224; aligner se situe dans une fen&#234;tre de tol&#233;rance de 10 (rangs) par 
rapport &#224; la derni&#232;re phrase align&#233;e. Cette valeur a &#233;t&#233; &#233;tablie exp&#233;rimentalement. 
</p>
<p>&#8226; Le nombre de termes communs entre la phrase source et la phrase cible (intersection 
s&#233;mantique) doit repr&#233;senter plus de 50% du nombre des termes de la phrase source. 
</p>
<p>&#8226; Le rapport entre la taille (exprim&#233;e en nombre de caract&#232;res) de la phrase cible et la 
taille de la phrase source doit &#234;tre sup&#233;rieur &#224; 1.1. La valeur de ce rapport a &#233;t&#233; fix&#233;e 
exp&#233;rimentalement. Elle repose sur l&#8217;id&#233;e qu&#8217;une phrase aura tendance &#224; &#234;tre 
traduite par une phrase longue si elle est longue, et par une phrase courte si elle est 
courte.
</p>
<p>Le processus d&#8217;alignement se d&#233;roule en quatre &#233;tapes : 
</p>
<p>Interrogation cross-lingue dans la base 
fran&#231;aise 
</p>
<p>Liste des phrases 
fran&#231;aises
</p>
<p>Liste des phrases 
arabes
</p>
<p>Phrases arabes &#224; aligner 
</p>
<p>Phrases fran&#231;aise align&#233;es 
</p>
<p>Interrogation cross-lingue dans la base 
arabe 
</p>
<p>V&#233;rification des crit&#232;res de validation 
</p>
<p>416</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche cross-lingue d&#8217;information pour l&#8217;alignement de phrases Arabe-Fran&#231;ais 
</p>
<p>1. Alignement 1-1 Exact Match: L&#8217;objectif est d&#8217;obtenir un alignement avec une 
pr&#233;cision maximale en utilisant les trois crit&#232;res de validation. 
</p>
<p>2. Alignement 1-2: Cet alignement consiste &#224; trouver pour la phrase &#224; aligner deux 
phrases en langue cible en utilisant comme r&#233;f&#233;rence le rang de la phrase pr&#233;c&#233;dente 
d&#233;j&#224; align&#233;e. Nous utilisons pour valider cet alignement les deux premiers crit&#232;res. 
</p>
<p>3. Alignement 2-1: L&#8217;objectif de cet alignement est de trouver pour les deux phrases en 
langue source suivant une phrase d&#233;j&#224; align&#233;e une phrase en langue cible en utilisant 
comme r&#233;f&#233;rence le rang de la phrase pr&#233;c&#233;dente d&#233;j&#224; align&#233;e. Cet alignement est 
valid&#233; par les deux premiers crit&#232;res. 
</p>
<p>4. Alignement 1-1 Fuzzy Match: Cette &#233;tape consiste &#224; aligner la phrase source avec la 
premi&#232;re phrase cible de la premi&#232;re classe retourn&#233;e par le moteur de recherche cross-
lingue. Cet alignement n&#8217;utilise aucun crit&#232;re de validation. 
</p>
<p>Nous d&#233;crivons ci-apr&#232;s l&#8217;algorithme de l&#8217;aligneur 1-1 Exact Match qui constitue la base des 
autres aligneurs. Cet algorithme utilise les fonctions de l&#8217;API du moteur de recherche: 
</p>
<p>- PerformCrosslinguageSearch(Requ&#234;te, Corpus, Langue source, Langue cible): 
retourne l&#8217;ensemble des classes retrouv&#233;es pertinentes pour la question &quot;Requ&#234;te&quot; 
dans la base de donn&#233;es textuelles &quot;Corpus&quot;. Chaque classe est compos&#233;e d&#8217;un 
ensemble de phrases dans la langue cible. 
</p>
<p>- GetNumberOfCommonWords(Classe): retourne le nombre de termes communs entre la 
phrase source et la phrase cible (intersection s&#233;mantique).
</p>
<p>- GetNumberOfWords(Phrase): retourne le nombre de mots pleins d&#8217;une phrase. 
</p>
<p>- GetNumberOfCharacters(Phrase): retourne le nombre de caract&#232;res d&#8217;une phrase. 
</p>
<p>Fonction GetExactMatchOneToOneAlignments(CorpusAr, CorpusFr)
Pour chaque phrase arabe PjAr (de rang j) &#8712; CorpusAr faire
CFr = PerformCrosslinguageSearch(PjAr, CorpusFr, Ar, Fr) 
R = 0; Initialisation du rang de la derni&#232;re phrase align&#233;e. 
Pour chaque classe ClFr &#8712; CFr faire
Pour chaque phrase fran&#231;aise PmFr (de rang m) &#8712; ClFr faire
CAr = PerformCrosslinguageSearch(PmFr, CorpusAr, Fr, Ar) 
Pour chaque classe CqAr &#8712; CAr faire
Pour chaque phrase arabe PqAr &#8712; CqAr faire
Si PqAr = PjAr alors
NMFr = GetNumberOfCommonWords(ClFr); NMAr = GetNumberOfWords(PjAr);
NCAr = GetNumberOfCharacters(PjAr); NCFr = GetNumberOfCharacters(PmFr)
Si (NMFr &gt;= NMAr/2) et (R &#8211; 5 &lt;= m &lt;= R + 5) et (NCFr = (1.1)* NCAr) alors
La phrase PmFr est l&#8217;alignement de la phrase PjAr; R = m 
</p>
<p>Fin Si 
Fin Si 
</p>
<p>Fin Pour 
Fin Pour 
</p>
<p>Fin Pour 
Fin Pour 
</p>
<p>Fin Pour 
Fin Fonction 
</p>
<p>Par exemple, pour aligner la phrase arabe [4/30] (Phrase de rang 4 dans une base de donn&#233;es 
contenant 30 phrases) &quot; !&quot;# $% &amp;'$(&quot;)*+&#1575; &#1576;&#1575;./0&#1575; 12&#1586; &#1606;5# &amp;(672 7(8 &amp;)'79 :; 1(&lt;=&gt;?+&#1575; &amp;(&lt;+&gt;8 &#1593;&gt;?%&#1575; A+&#1575; &#1569;&gt;(C0&#1575; &amp;D(&lt;9 &#1578;&#1583;&#1575; &gt;(+&gt;G'&#1575; :;
H*'&gt;IJ&quot;, l&#8217;aligneur 1-1 Exact Match proc&#232;de comme suit: 
</p>
<p>&#8226; La phrase arabe est consid&#233;r&#233;e comme une requ&#234;te dans la base de donn&#233;es des 
phrases fran&#231;aises en utilisant le moteur de recherche cross-lingue. Les phrases 
retrouv&#233;es pertinentes des deux premi&#232;res classes sont illustr&#233;es dans Tableau 2. 
</p>
<p>417</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nasredine SEMMAR, Christian FLUHR
</p>
<p>&#8226; Les r&#233;ponses de l&#8217;interrogation cross-lingue montrent que la phrase fran&#231;aise [4/36] 
est un bon candidat pour l&#8217;alignement. Pour confirmer cet alignement, nous utilisons 
cette phrase comme une requ&#234;te &#224; la base de donn&#233;es des phrases arabes. Les phrases 
retrouv&#233;es pertinentes pour cette phrase sont group&#233;es dans deux classes dans 
Tableau 3. 
</p>
<p>Classe Nombre de 
phrases 
retrouv&#233;es 
</p>
<p>Phrases retrouv&#233;es 
</p>
<p>1 1 [4/36] En Italie, l'ordre des choses a persuad&#233; de mani&#232;re invisible une 
majorit&#233; d'&#233;lecteurs que le temps des partis traditionnels &#233;tait termin&#233; 
</p>
<p>2 3 [32/36] Au point que, d&#232;s avant ces &#233;lections, un hebdomadaire 
britannique, rappelant les accusations port&#233;es par la justice italienne 
contre M. Berlusconi, estimait qu'un tel dirigeant n'&#233;tait pas digne de 
gouverner l'Italie, car il constituait un danger pour la d&#233;mocratie et une 
menace pour l'Etat de droit 
</p>
<p>[34/36] Apr&#232;s le pitoyable effondrement des partis traditionnels, la 
soci&#233;t&#233; italienne, si cultiv&#233;e, assiste assez impassible (seul le monde du 
cin&#233;ma est entr&#233; en r&#233;sistance) &#224; l'actuelle d&#233;gradation d'un syst&#232;me 
politique de plus en plus confus, extravagant, ridicule et dangereux 
</p>
<p>[36/36] Toute la question est de savoir dans quelle mesure ce mod&#232;le 
italien si pr&#233;occupant risque de s'&#233;tendre demain &#224; d'autres pays d'Europe 
</p>
<p>Tableau 2 : Phrases retrouv&#233;es pertinentes pour la phrase arabe &#224; aligner [4/30] 
</p>
<p>Classe Nombre de 
phrases 
retrouv&#233;es
</p>
<p>Phrases retrouv&#233;es
</p>
<p>1 1 [4/30] 
&#1575;&quot;#$&#1575; %&amp;&#1586; &#1606;)* +,-.&amp; .,/ +01.2 34 %,56789&#1575; +,597/ &#1593;78;&#1575; &lt;9&#1575; &#1569;7,&gt;$&#1575; +?,52 &#1578;&#1583;&#1575; 7,97B1&#1575; 34 C; +1C,D0E9&#1575; &#1576;
</p>
<p>GE17HI JD*
</p>
<p>2 3 [26/30] 
 +,KL5M$&#1575; &#1578;NOP9&#1575; &#1609;C#&#1575; &#1606;&#1575; +R&#1585;&#1583; &lt;9&#1575; &#1548;7*&#1608;&#1585;&#1608;&#1575; 34 &#1586;&quot;0E9&#1575;&#1608; +1.VWD9 &#1577;.,Y&amp; +,ZNZ .Y&#1570;&#1575; &#1604;7R.9&#1575; &#1569;$]&#1607; _`a1 
 bc&#1607; _5; 3IL`ML9.* C,W9&#1575; &lt;9&#1575; +HRLP9&#1575; +,-7d09&#1575; &#1578;7&amp;7HeN9 7He&#1583;7?EM&#1575; &#1590;.?&amp; 34 &#1578;.5EK&#1575; +,I7B1.59&#1575;
</p>
<p>c&#1607; %&amp; $&#1608;]W&amp; &#1606;&#1575; &#1578;7*7VEI$&#1575; &#1593;L89&#1575; &#1575;&quot;7,97B1&#1575; g`h* &#1575;.1CR i,9 &quot; _YP1 GI&#1575;&#1608;&quot;+,2&#1575;.;LP1C9&#1575; &lt;DK &#1575;.B6 &quot; &lt;DK&#1608;
&quot;&#1606;LI709&#1575; +9&#1608;&#1583; &quot; 
</p>
<p>[28/30] 
 jPEOP9&#1575; CH&gt; &#1548;+1C,D0E9&#1575; &#1576;&#1575;&quot;#N9 +0kaD9 .,YP9&#1575; &#1585;7,HI$&#1575; C?54 &#1548;+P-7aEP9&#1575; &#1578;7?;LE9&#1575; bc&#1607; +hl m8,5e C;&#1608;
</p>
<p> 7&#1570;&#1575;.# &#1610;C51 &#1606;&#1575; &#1606;&#1608;&#1583; %&amp;&#1608; GE470Y* &#1601;&#1608;.?P9&#1575; 397B1$&#1575; )&#1575; &#1593;7B; &#1569;78YEM7*+&amp;&#1608;70P9&#1575; &lt;9&#1575; )O9 &#1610;c9&#1575; 7P8,W9 ( &#1585;L&#1607;CE9&#1575;
&#1577;&#1585;LBV9&#1575;&#1608; pVW9&#1575;&#1608; qBa9&#1575;&#1608; &#1590;LPr9&#1575; %&amp; C1&quot;P9&#1575; 3I7?1 3M7,M &#1605;7t89 %&#1607;&#1575;.9&#1575;
[30/30] 
 &#1606;&#1575;CD* 34 &#1611;&#1575;C/ .aE81 &#1606;&#1575; vD0D9 .,YP9&#1575; 397B1$&#1575; &#1580;&#1584;LP89&#1575; &#1575;c&#1607; %`P1 &#1609;C&amp; &#1610;&#1575; &lt;9&#1575; +4.?&amp; 34 %P`e +9)WP9&#1575; _&#1570;&#1608; 
&#1609;.6&#1575; +,*&#1608;&#1585;&#1608;&#1575;
</p>
<p>Tableau 3 : Phrases retrouv&#233;es pertinentes pour la phrase fran&#231;aise [4/36] 
</p>
<p>La premi&#232;re phrase propos&#233;e par l&#8217;interrogation cross-lingue correspond &#224; la phrase initiale &#224; 
aligner et plus de 50% des mots sont communs entre les deux phrases. De plus, le rapport 
</p>
<p>418</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche cross-lingue d&#8217;information pour l&#8217;alignement de phrases Arabe-Fran&#231;ais 
</p>
<p>entre la phrase fran&#231;aise et la phrase arabe est sup&#233;rieur &#224; 1.1 et les positions des deux phrases 
dans les deux bases de donn&#233;es sont identiques. Par cons&#233;quent, l&#8217;aligneur 1-1 Exact Match 
consid&#232;re la phrase fran&#231;aise [4/36] comme la traduction de la phrase arabe [4/30]. 
</p>
<p>4 R&#233;sultats et Discussions 
Pour mener nos exp&#233;rimentations et &#234;tre en mesure de calculer la performance de notre 
aligneur de phrases, nous avons utilis&#233; le corpus MD (Monde Diplomatique) de la campagne 
ARCADE II (Chiao et al., 2006). Le corpus contient 5 textes arabes (244 phrases) align&#233;s 
avec 5 textes fran&#231;ais (283 phrases). 
</p>
<p>Pour &#233;valuer l&#8217;aligneur au niveau de la phrase, nous avons utilis&#233; les mesures suivantes : 
</p>
<p>Pr&#233;cision = A
AA r&#8745;  et Rappel = 
</p>
<p>r
</p>
<p>r
</p>
<p>A
AA&#8745;
</p>
<p>A correspond &#224; l&#8217;ensemble des alignements fournis par l&#8217;aligneur et Ar correspond &#224; 
l&#8217;ensemble des alignements corrects. 
</p>
<p>Les r&#233;sultats d&#8217;alignement sont illustr&#233;s dans Tableau 4 et montrent que la pr&#233;cision est autour 
de 97% et le rappel est autour de 93%. Ces r&#233;sultats ne prennent pas en compte les 
alignements partiellement corrects (Alignement 1-1 Fuzzy Match). 
</p>
<p>Texte parall&#232;le Pr&#233;cision Rappel 
1 0,969 0,941 
</p>
<p>2 0,962 0,928 
</p>
<p>3 0,985 0,957 
</p>
<p>4 0,983 0,952 
</p>
<p>5 0,966 0,878 
</p>
<p>Tableau 4 : R&#233;sultats d&#8217;alignement au niveau de la phrase du corpus MD 
</p>
<p>Par ailleurs, l&#8217;analyse de ces r&#233;sultats montre, d&#8217;une part, que l&#8217;alignement est correct m&#234;me si 
le corpus n&#8217;est pas parfaitement parall&#232;le, et d&#8217;autre part, que la pr&#233;cision d&#233;pend fortement 
des mots discriminants pr&#233;sents dans les phrases source et cible. 
</p>
<p>5 Conclusion et Perspectives 
Nous avons propos&#233; une nouvelle approche pour aligner les phrases d&#8217;un corpus parall&#232;le. 
Cette approche est bas&#233;e sur une recherche cross-lingue d&#8217;information et combine plusieurs 
sources d&#8217;information (dictionnaire bilingue, longueurs des phrases, num&#233;ros d&#8217;ordre des 
phrases dans le corpus parall&#232;le). Les r&#233;sultats que nous avons obtenus montrent des valeurs 
correctes pour la pr&#233;cision et le rappel m&#234;me lorsque le corpus n&#8217;est que partiellement 
parall&#232;le. Nos travaux vont maintenant s&#8217;&#233;tendre, d&#8217;une part, &#224; l&#8217;utilisation des structures 
</p>
<p>419</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nasredine SEMMAR, Christian FLUHR
</p>
<p>syntaxiques du corpus parall&#232;le pour am&#233;liorer la performance de l&#8217;alignement de phrases, et 
d&#8217;autre part, au d&#233;veloppement d&#8217;un outil d&#8217;aide &#224; la traduction bas&#233; sur les textes bilingues 
align&#233;s. 
</p>
<p>R&#233;f&#233;rences 
A. ANDREEWSKY, J. P. BINQUET, F. DEBILI, C. FLUHR, B. POUDEROUX. (1981). Le traitement 
linguistique et statistique des textes et son application dans la documentation juridique. Actes 
du Sixi&#232;me Symposium sur l'Informatique Juridique en Europe, Thessaloniki, Gr&#232;ce. 
</p>
<p>BROWN P., LAI L., MERCIER L. (1991). Aligning Sentences in Parallel Corpora. Actes de ACL-
1991.
</p>
<p>CHIAO Y. C., KRAIF O., LAURENT D., NGUYEN T., SEMMAR N., STUCK F., V&#201;RONIS J.,
ZAGHOUANI W. (2006). Evaluation of multilingual text alignment systems: the ARCADE II 
project. Actes de LREC-2006.
</p>
<p>DEBILI F. SAMMOUDA E. (1992). Appariement des Phrases des Textes Bilingues. Actes du 14th 
International Conference on Computational Linguistics.
</p>
<p>DEBILI F., ZOUARI L. (1985). Analyse morphologique de l'arabe &#233;crit voyell&#233; ou non fond&#233;e 
sur la construction automatique d'un dictionnaire arabe. Actes de Cognitiva-1985.
</p>
<p>FLUHR C., BISSON F., ELKATEB F. (2000). Parallel text alignment using cross-lingual 
information retrieval techniques. Parallel text processing. Kluwer, Boston. 
</p>
<p>GALE W.A. CHURCH K. W. (1991). A program for aligning sentences in bilingual corpora. 
Actes du 29th Annual Meeting of Association for Computational Linguistics.
</p>
<p>GAUSSIER E. (1995). Mod&#232;les statistiques et patrons morphosyntaxiques pour l'extraction de 
lexiques bilingues. Ph.D. Thesis, Paris VII University. 
</p>
<p>GREFENSTETTE G., SEMMAR N., ELKATEB-GARA F. (2005). Modifying a Natural Language 
Processing System for European Languages to Treat Arabic in Information Processing and 
Information Retrieval Applications. Actes de ACL-2005, 31-38. 
</p>
<p>MELAMED I. D. (1996). A Geometric Approach to Mapping Bitext Correspondence. Actes de 
Conference on Empirical Methods in Natural Language Processing.
</p>
<p>SEMMAR N., ELKATEB-GARA F., LAIB M., FLUHR C. (2005). A Cross-language information 
retrieval system based on linguistic and statistical approaches. Actes du Deuxi&#232;me Congr&#232;s 
International sur l'Ing&#233;nierie de l'Arabe et l'Ing&#233;nierie de la Langue.
</p>
<p>420</p>

</div></div>
</body></html>