<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Inf&#233;rence de r&#232;gles de r&#233;&#233;criture pour la traduction de termes biom&#233;dicaux</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Inf&#233;rence de r&#232;gles de r&#233;&#233;criture
pour la traduction de termes biom&#233;dicaux
</p>
<p>Vincent CLAVEAU
IRISA - CNRS
</p>
<p>Campus de Beaulieu
35042 Rennes cedex, France
</p>
<p>Vincent.Claveau@irisa.fr
</p>
<p>R&#233;sum&#233;. Dans le domaine biom&#233;dical, le caract&#232;re multilingue de l&#8217;acc&#232;s &#224; l&#8217;information
est un probl&#232;me d&#8217;importance. Dans cet article nous pr&#233;sentons une technique originale permet-
tant de traduire des termes simples du domaine biom&#233;dical de et vers de nombreuses langues.
Cette technique enti&#232;rement automatique repose sur l&#8217;apprentissage de r&#232;gles de r&#233;&#233;criture &#224;
partir d&#8217;exemples et l&#8217;utilisation de mod&#232;les de langues. Les &#233;valuations pr&#233;sent&#233;es sont me-
n&#233;es sur diff&#233;rentes paires de langues (fran&#231;ais-anglais, espagnol-portugais, tch&#232;que-anglais,
russe-anglais...). Elles montrent que cette approche est tr&#232;s efficace et offre des performances
variables selon les langues mais tr&#232;s bonnes dans l&#8217;ensemble et nettement sup&#233;rieures &#224; celles
disponibles dans l&#8217;&#233;tat de l&#8217;art. Les taux de pr&#233;cision de traductions s&#8217;&#233;tagent ainsi de 57.5%
pour la paire russe-anglais jusqu&#8217;&#224; 85% pour la paire espagnol-portugais et la paire fran&#231;ais-
anglais.
Abstract. In the biomedical domain, offering a multilingual access to specialized infor-
mation is a major issue. In this paper, we present an original approach to translate simple bio-
medical terms between several languages. This fully automatic approach is based on a ma-
chine learning technique inferring rewriting rules and on language models. The experiments
that are presented are done onn several language pairs (French-English, Spanish-Portuguese,
Czech-English, Russian-English...). They demonstrate the efficiency of our approach by yiel-
ding translation performances that vary according to the languages but are always very good
and better than those of state-of-art techniques. Indeed, the translation precision rates go from
57.5% for translation from Russian to English up to 85% for Spanish-Portuguese and French-
English language pairs.
Mots-cl&#233;s : traduction artificielle, terminologie biom&#233;dicale, apprentissage artificiel,
mod&#232;les de langue.
</p>
<p>Keywords: machine translation, biomedical terminology, machine learning, lan-
guage models.
</p>
<p>1 Introduction
Dans le domaine biom&#233;dical, les probl&#233;matiques d&#8217;acc&#232;s &#224; l&#8217;information sont particuli&#232;rement
importants. De nombreux documents sont en effet quotidiennement collect&#233;s dans des bases
</p>
<p>111</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent CLAVEAU
</p>
<p>sp&#233;cialis&#233;es tr&#232;s consult&#233;es. La base PubMed regroupe par exemple 16 millions de publications
m&#233;dicales et fait face &#224; plus de 3 millions de requ&#234;tes par jour. Dans la plupart de ces bases,
les documents sont index&#233;s &#224; l&#8217;aide de terminologies de r&#233;f&#233;rence en anglais ; la mise en place
de strat&#233;gies multilingues pour faciliter l&#8217;acc&#232;s &#224; ces bases pour les non-anglophones est donc
cruciale. Quelques terminologies biom&#233;dicales multilingues existent, mais elles sont mises en
d&#233;faut par l&#8217;&#233;volution rapide des connaissances et le manque de moyens pour certaines langues.
En r&#233;ponse &#224; ces besoins, nous pr&#233;sentons et &#233;valuons dans cet article une m&#233;thode de traduc-
tion automatique de termes biom&#233;dicaux fonctionnant sur diff&#233;rentes langues (anglais, espa-
gnol, fran&#231;ais, russe...). Cette m&#233;thode permet de produire des traductions de termes simples
(i.e. compos&#233;s d&#8217;un seul mot) du domaine biom&#233;dical d&#8217;une langue source dans une langue
cible. Ce travail repose sur deux hypoth&#232;ses majeures : 1- dans le domaine biom&#233;dical, les
termes &#233;quivalents entre deux langues sont souvent morphologiquement proches ; 2- les diff&#233;-
rences entre termes de chaque langue sont r&#233;guli&#232;res et peuvent &#234;tre apprises automatiquement.
Ces deux hypoth&#232;ses s&#8217;appuient sur le fait que les termes biom&#233;dicaux sont construits sur les
m&#234;mes racines grecques et latines (Namer, 2005), et leurs d&#233;rivations tr&#232;s r&#233;guli&#232;res (e.g. pour
le couple fran&#231;ais-anglais ophtalmorragie/ophthalmorrhagia, ophtalmoplastie/ophthalmoplasty ,
leucorragie/leukorrhagia).
Notre approche s&#8217;appuie sur une technique d&#8217;apprentissage artificiel simple que nous avons d&#233;-
velopp&#233;e. Elle nous permet d&#8217;inf&#233;rer un ensemble de r&#232;gles de r&#233;&#233;criture &#224; partir de couples
de termes langue source-langue cible traductions l&#8217;un de l&#8217;autre. Ces r&#232;gles, une fois apprises,
peuvent alors &#234;tre appliqu&#233;es &#224; des termes de la langue source pour produire les termes &#233;qui-
valents dans la langue cible. Il est int&#233;ressant de noter qu&#8217;aucune connaissance, ni intervention
humaine n&#8217;est requise &#224; l&#8217;exception de la phase de supervision (i.e. la constitution de l&#8217;ensemble
de couples de termes langue source-langue cible), celle-ci pouvant se faire simplement en ex-
ploitant les terminologies multilingues existantes.
Dans la section suivante, nous pr&#233;sentons les travaux connexes &#224; notre probl&#233;matique. Nous
d&#233;crivons ensuite en section 3 notre technique de traduction de termes biom&#233;dicaux que nous
&#233;valuons sur diff&#233;rentes paires de langues en section 4.
</p>
<p>2 Travaux connexes
Peu de travaux se placent dans le cadre de la traduction directe de termes, et moins encore dans
le domaine biom&#233;dical. Cette probl&#233;matique a cependant d&#233;j&#224; &#233;t&#233; abord&#233;e et une solution fonc-
tionnelle a &#233;t&#233; propos&#233;e par Claveau &amp; Zweigenbaum (2005b; 2005a). Celle-ci repose sur une
technique d&#8217;apprentissage de transducteurs mais ne peut s&#8217;appliquer qu&#8217;aux langues partageant
le m&#234;me alphabet, contrairement &#224; l&#8217;approche pr&#233;sent&#233;e ici. Outre sa plus grande souplesse,
nous montrons en section 4 que notre technique obtient, de plus, des performances sup&#233;rieures
&#224; cette approche par transducteurs. Schulz et al. (2004) ont &#233;galement propos&#233; une technique
de traduction de termes biom&#233;dicaux, du portugais vers l&#8217;espagnol, s&#8217;appuyant sur des r&#232;gles
de r&#233;&#233;criture. Cependant, ces r&#232;gles sont fournies manuellement ; une telle approche n&#8217;est donc
pas envisageable &#224; grande &#233;chelle pour le traitement de plusieurs paires de langues.
Hors du domaine biom&#233;dical, des probl&#233;matiques proches sont parfois abord&#233;es dans le do-
maine de la traduction automatique de textes. Ainsi, la d&#233;tection de cognats (couples de mots
bilingues de formes proches) (Fluhr et al., 2000, inter alia) s&#8217;appuie sur des op&#233;rations morpho-
logiques simples parfois proches des r&#232;gles de r&#233;&#233;criture que nous inf&#233;rons. D&#8217;autres travaux
</p>
<p>112</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Inf&#233;rence de r&#232;gles de traduction de termes biom&#233;dicaux
</p>
<p>reposent quant &#224; eux sur des recherches en corpus &#224; l&#8217;aide de techniques statistiques de cooc-
currences pour trouver des alignements &#8211; et donc des relations de traduction potentielle &#8211; entre
termes dans des corpus align&#233;s (Ahrenberg et al., 2000; Gale &amp; Church, 1991) ou comparables
(Fung &amp; McKeown, 1997). Outre le probl&#232;me de la raret&#233; de corpus sp&#233;cialis&#233;s align&#233;s, ces
approches diff&#232;rent de la n&#244;tre en cela qu&#8217;il s&#8217;agit pour ces auteurs de retrouver une traduction
d&#8217;un mot dans un texte (mise en relation), alors que nous nous posons dans le cadre plus strict
de la traduction (g&#233;n&#233;ration). Mentionnons enfin les travaux sur la translitt&#233;ration, notamment
du katakana ou de l&#8217;arabe (Tsuji et al., 2002; Knight &amp; Graehl, 1998, par exemple). Les tech-
niques utilis&#233;es dans ceux-ci sont parfois proches de celle propos&#233;e ici, mais ne concernent que
la repr&#233;sentation d&#8217;imports dans des langues ayant un alphabet diff&#233;rent de la langue source.
</p>
<p>3 Technique de traduction artificielle de termes
La technique de traduction de termes biom&#233;dicaux que nous proposons fonctionne en deux
temps. Tout d&#8217;abord, des r&#232;gles de r&#233;&#233;criture sont inf&#233;r&#233;es &#224; partir d&#8217;exemples de paires de
termes traductions l&#8217;un de l&#8217;autre (sous-section 3.1). Un mod&#232;le de langue est ensuite appris et
utilis&#233; pour choisir la traduction la plus probable parmi les possibilit&#233;s g&#233;n&#233;r&#233;es par l&#8217;application
des r&#232;gles de r&#233;&#233;criture inf&#233;r&#233;es (sous-section 3.2). Nous terminons la section par quelques
commentaires sur cette technique de traduction de termes.
</p>
<p>3.1 Inf&#233;rence de r&#232;gles de r&#233;&#233;criture
La technique de traduction propos&#233;e repose sur l&#8217;apprentissage de r&#232;gles de r&#233;&#233;criture (que l&#8217;on
peut aussi voir comme des r&#232;gles de translitt&#233;ration). Ces r&#232;gles, apprises &#224; partir de listes de
paires bilingues de termes du domaine (cf. section 4.1), sont de la forme : &#12296;input string&#12297; &#8594;
&#12296;output string&#12297;. Dans la suite de l&#8217;article, nous notons r une r&#232;gle de r&#233;&#233;criture, R est la liste
de toutes les r&#232;gles inf&#233;r&#233;es pendant une exp&#233;rience, input(r) et output(r) d&#233;signent respecti-
vement la cha&#238;ne d&#8217;entr&#233;e et la cha&#238;ne de sortie de la r&#232;gle r.
</p>
<p>Algorithme 1 Apprentissage des r&#232;gles de r&#233;&#233;criture
1: aligner les paires de termes au niveau des lettres, mettre le r&#233;sultat dans L
2: for all paire de termes W1 dans L do
3: for all alignement de lettres dont les 2 lettres diff&#232;rent dans W1 do
4: trouver la meilleure hypoth&#232;se de r&#232;gles r dans l&#8217;espace de recherche E
5: ajouter r &#224; l&#8217;ensemble de r&#232;glesR
6: end for
7: end for
</p>
<p>L&#8217;algorithme 1 donne un aper&#231;u global de notre technique d&#8217;apprentissage. La premi&#232;re &#233;tape
est r&#233;alis&#233;e &#224; l&#8217;aide de DPalign (http://www.cnts.ua.ac.be/~decadt/?section=
dpalign). Ce logiciel aligne deux s&#233;quences en minimisant leur distance d&#8217;&#233;dition par pro-
grammation dynamique selon l&#8217;algorithme de Wagner &amp; Fischer (1974) ; les co&#251;ts de substi-
tution des caract&#232;res sont calcul&#233;s sur l&#8217;ensemble des paires &#224; aligner. Ce logiciel ne repose
donc pas sur une similarit&#233; formelle des caract&#232;res pour aligner les s&#233;quences ; il nous est ainsi
possible d&#8217;aligner des termes ne partageant pas le m&#234;me alphabet.
</p>
<p>113</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent CLAVEAU
</p>
<p>Une liste de paires de termes est donn&#233;e en entr&#233;e ; &#224; chaque terme sont ajout&#233;s deux caract&#232;res #
pour repr&#233;senter le d&#233;but et la fin de la cha&#238;ne de caract&#232;res. La liste de sortie L va alors contenir
les paires de termes align&#233;s au niveau des lettres ; le tableau 1 en pr&#233;sente quelques exemples
(&#8217;_&#8217; signifie aucun caract&#232;re). Par la suite, le terme d&#8217;entr&#233;e (respectivement de sortie) d&#8217;une
telle paire align&#233;e p est not&#233; input(p) (resp. output(p)) ; de plus, align(x, y) indique que la
sous-cha&#238;ne x est align&#233;e avec la sous-cha&#238;ne y dans la paire de termes consid&#233;r&#233;e.
</p>
<p>L portugais-anglais L anglais-russe
# c e t o s t e r &#243; i d e s #
# k e t o s t e r o i d _ s #
</p>
<p># a d e n o s i n e t r i p h o s p h a t a s e #
# a d e n o z i n _ trif _ o sf _ a t a z a #
</p>
<p># e l e c t r o p o r a &#231; &#227; o _ #
# e l e c t r o p o r a t i o n #
</p>
<p># h y d r o x _ y p r e g n e n o l o n e #
# g i d ro k s i pr e g n e n olon _ #
</p>
<p># e n c e f _ a l o g r a f _ i a #
# e n c e p h a l o g r a p h y _ #
</p>
<p># k e r a t o p l a s t y _ _ #
# k e r a t o p la s ti k a #
</p>
<p>TAB. 1 &#8211; Exemples d&#8217;alignements produits pour deux paires de langues
</p>
<p>Dans notre processus d&#8217;apprentissage, ces paires de mots align&#233;s sont consid&#233;r&#233;es comme des
exemples &#224; partir desquels les deux boucles imbriqu&#233;es inf&#232;rent des r&#232;gles de r&#233;&#233;criture. Comme
pour beaucoup de probl&#232;mes d&#8217;apprentissage artificiel symbolique, cette phase d&#8217;inf&#233;rence
(ligne 4) peut &#234;tre consid&#233;r&#233;e comme un probl&#232;me de parcours d&#8217;espace. &#192; chaque &#233;l&#233;ment
de cet espace est associ&#233; un score ; on cherche &#224; trouver l&#8217;&#233;l&#233;ment de l&#8217;espace maximisant ce
score. Dans notre cas, l&#8217;espace de recherche est compos&#233; de toutes les r&#232;gles de r&#233;&#233;criture pos-
sibles compatibles avec l&#8217;exemple choisi. Par exemple, consid&#233;rons que la paire de mots W1
choisie &#224; la ligne 2 est #opht_almologie#/#ophthalmology_#, et supposons que c&#8217;est l&#8217;aligne-
ment i/y qui est choisi &#224; la ligne 3. Quelques r&#232;gles de r&#233;&#233;criture compatibles dans ce contexte
sont i &#8594; y , gi &#8594; gy , ie&#8594; y (on ne note pas le caract&#232;re _ dans les r&#232;gles), ologie# &#8594; ology#...
Le score d&#8217;une r&#232;gle est calcul&#233; &#224; partir de la liste L ; c&#8217;est le ratio entre le nombre de fois o&#249; la
r&#232;gle s&#8217;applique aux termes align&#233;s de la liste d&#8217;exemples et le nombre de fois o&#249; la pr&#233;misse
de la r&#232;gle appara&#238;t dans les termes source de la liste d&#8217;exemples. Formellement, le score d&#8217;une
r&#232;gle r est donc d&#233;fini par (&#8838; repr&#233;sente l&#8217;inclusion de cha&#238;ne de caract&#232;res) :
</p>
<p>score(r) =
|{p &#8712; L | input(r) &#8838; input(p) &#8743; output(r) &#8838; align(input(r), p)}|
</p>
<p>|{s &#8712; Linput | input(r) &#8838; s}|
</p>
<p>Du fait du tr&#232;s grand nombre de r&#232;gles possibles, chercher la r&#232;gle maximisant la fonction de
score pour chacun des exemples peut &#234;tre une t&#226;che tr&#232;s lourde en temps de calcul. Heureuse-
ment, l&#8217;espace de recherche peut &#234;tre organis&#233; hi&#233;rarchiquement pour rendre l&#8217;exploration plus
efficace. En effet, les r&#232;gles compatibles pour un exemple peuvent &#234;tre organis&#233;es de la plus
g&#233;n&#233;rale &#224; la plus sp&#233;cifique avec la notion de subsomption suivante :
</p>
<p>r1 % r2 &#8660; (input(r1) &#8838; input(r2) &#8743; output(r1) &#8838; output(r2)).
</p>
<p>Cette relation de subsomption est r&#233;flexive, antisym&#233;trique et transitive ; l&#8217;espace r&#233;sultant est
un treillis. La figure 1 pr&#233;sente l&#8217;espace de recherche organis&#233; par cette subsomption construit &#224;
partir de l&#8217;exemple i/y dans #opht_almologie#/#ophthalmology_#. Dans notre cas, la recherche
est effectu&#233;e du plus g&#233;n&#233;ral au plus sp&#233;cifique (top-down) ; cela, et les propri&#233;t&#233;s d&#8217;h&#233;ritage
que cette structure implique, nous permet de rechercher efficacement la meilleure r&#232;gle (calcul
du score d&#8217;une r&#232;gle en n&#8217;examinant que les paires de termes que son p&#232;re couvre, &#233;lagage de
l&#8217;espace bas&#233; sur le meilleur score courant...).
</p>
<p>114</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Inf&#233;rence de r&#232;gles de traduction de termes biom&#233;dicaux
</p>
<p>i&#8594; y
</p>
<p>ie&#8594; ygi&#8594; gy
</p>
<p>ie#&#8594; y#
</p>
<p>ogie&#8594; ogy
gie#&#8594; gy#
</p>
<p>gie&#8594; gyogi&#8594; ogy
</p>
<p>logi&#8594; logy
</p>
<p>#ophtalmologie#&#8594; #ophthalmology#
</p>
<p>FIG. 1 &#8211; Treillis de recherche de l&#8217;exemple i/y dans #opht_almologie#/#ophthalmology_#
</p>
<p>3.2 &#201;valuation des traductions propos&#233;es
</p>
<p>L&#8217;algorithme pr&#233;sent&#233; ci-dessus va potentiellement g&#233;n&#233;rer une r&#232;gle de r&#233;&#233;criture par diff&#233;-
rence pour chacune des paires de termes utilis&#233;es en exemple, conduisant &#224; obtenir un grand
nombre de r&#232;gles. Pour traduire un terme inconnu dans la langue d&#8217;entr&#233;e, toutes les r&#232;gles ap-
plicables &#224; ce terme (i.e. les r&#232;gles dont la pr&#233;misse correspond &#224; une sous-cha&#238;ne du terme) sont
effectivement appliqu&#233;es. Dans le cas de r&#232;gles concurrentes, toutes les possibilit&#233;s sont g&#233;n&#233;-
r&#233;es. Pour choisir parmi ces possibilit&#233;s la traduction la plus probable, nous avons utilis&#233; une
approche simple bas&#233;e sur les mod&#232;les de langue (ML). Les ML sont largement utilis&#233;s pour la
traduction artificielle, la transcription de l&#8217;oral ou encore la recherche d&#8217;information (Charniak,
1993). Cependant, dans ces cadres, les ML sont utilis&#233;s pour associer une probabilit&#233; &#224; une s&#233;-
quence de mots, alors que dans notre cas, la probabilit&#233; va au contraire &#234;tre associ&#233;e &#224; un mot
consid&#233;r&#233; comme une s&#233;quence de lettres. Plus formellement, avec les notations standard on a :
</p>
<p>P (w) =
m&#8719;
i=1
</p>
<p>P (li|l1, ..., li&#8722;1) pour un terme w compos&#233; des lettres l1, l2, ..., lm
</p>
<p>En pratique, les probabilit&#233;s P (li|...) sont estim&#233;es &#224; partir des termes biom&#233;dicaux de la langue
cible, d&#233;compos&#233;s en n-grammes de lettres, issus de la liste d&#8217;exemples. Pour pr&#233;venir le pro-
bl&#232;me des s&#233;quences de lettres non vues, les probabilit&#233;s sont en r&#233;alit&#233; calcul&#233;es &#224; partir d&#8217;un
historique r&#233;duit aux n&#8722;1 lettres pr&#233;c&#233;dentes (i.e. P (li|li&#8722;n+1, ..., li&#8722;1)) et un lissage simple est
appliqu&#233;. Dans les exp&#233;riences pr&#233;sent&#233;es ci-apr&#232;s, n est fix&#233; &#224; 7 lettres.
Intuitivement, le ML va favoriser les traductions qui ressemblent &#224; des termes biom&#233;dicaux bien
form&#233;s dans la langue cible. Parmi toutes les traductions propos&#233;es pour un terme de la langue
source, on conserve donc finalement celle qui obtient la probabilit&#233; la plus forte selon le ML
appris. Par ailleurs, il est int&#233;ressant de noter qu&#8217;en plus de choisir la traduction la plus probable,
cette technique nous donne un facteur de confiance sur la traduction retenue.
</p>
<p>115</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent CLAVEAU
</p>
<p>3.3 Commentaires sur la technique de traduction
</p>
<p>Deux points concernant la technique de traduction propos&#233;e m&#233;ritent d&#8217;&#234;tre mentionn&#233;s. Il est
tout d&#8217;abord int&#233;ressant de constater que l&#8217;approche que nous avons adopt&#233;e peut &#234;tre rappro-
ch&#233;e du cadre usuel de la traduction artificielle statistique dans lequel le but est de traduire une
s&#233;quence de mots f dans une langue source en une s&#233;quence e dans la langue cible en cherchant
e maximisant P (e) &#183;P (f |e) (Brown et al., 1993). Le terme P (f |e) repr&#233;sente la probabilit&#233; que
la s&#233;quence f soit la traduction de e. Ces probabilit&#233;s, qui sont estim&#233;es &#224; partir d&#8217;un corpus
align&#233;, peuvent &#234;tre rapproch&#233;es de nos r&#232;gles de r&#233;&#233;criture et leur score. Le terme P (e) sert &#224;
v&#233;rifier que la s&#233;quence propos&#233;e soit bien form&#233;e ; son fonctionnement est en tout point simi-
laire au mod&#232;le de langue que nous utilisons, si ce n&#8217;est que nos s&#233;quences sont compos&#233;es de
lettres et non de mots. Il y a cependant quelques diff&#233;rences importantes avec notre approche,
principalement induites par la nature de nos donn&#233;es. Ainsi, dans le cadre de la traduction arti-
ficielle de textes, les diff&#233;rences d&#8217;ordonnancement des mots entre la langue source et la langue
cible sont des probl&#232;mes difficiles &#224; r&#233;soudre et m&#232;nent &#224; construire des mod&#232;les de traduc-
tion compliqu&#233;s. Dans notre cas, ce probl&#232;me est quasiment inexistant : l&#8217;ordre des morphes, et
donc des lettres composant les termes, varie peu d&#8217;une langue &#224; l&#8217;autre. Le fait de manipuler des
lettres et non des mots nous permet aussi d&#8217;utiliser un ML avec un historique de taille impor-
tante sans craindre de tomber trop souvent sur des s&#233;quences non observ&#233;es ; les combinaisons
possibles de lettres sont en effet bien moins nombreuses que les combinaisons de mots.
Le deuxi&#232;me point &#224; noter concerne une des limites &#233;voqu&#233;es par Claveau &amp; Zweigenbaum
(2005b) &#224; propos de leur technique de traduction de termes. Ces derniers indiquent en effet
que leur approche par transducteur ne peut pas prendre en compte des informations sur les
termes comme les parties-du-discours (PoS). Cela a pour effet de g&#233;n&#233;rer des erreurs et de
complexifier l&#8217;apprentissage dans le cas de mots polyfonctionnels comme linguistique qui se
traduira diff&#233;remment selon qu&#8217;il soit nom ou adjectif. Dans notre cas, cette limite est lev&#233;e
puisque l&#8217;ajout de ces informations se fait tr&#232;s naturellement avec le mod&#232;le de langues. Les
probabilit&#233;s peuvent en effet &#234;tre calcul&#233;es en incluant la partie-du-discours de la s&#233;quence en
cours de traitement (on calcule alors les scores en fonction des P (li|li&#8722;n+1, ..., li&#8722;1, PoS)).
</p>
<p>4 &#201;valuation de la traduction de terme
</p>
<p>4.1 Description des donn&#233;es
</p>
<p>Deux jeux de donn&#233;es sont utilis&#233;s pour nos exp&#233;riences de traduction. Le premier est une
collection de termes fran&#231;ais-anglais issue du dictionnaire m&#233;dical Masson (http://www.
atmedica.com). C&#8217;est la m&#234;me collection que celle utilis&#233;e dans Claveau &amp; Zweigenbaum
(2005b), ce qui nous permettra de comparer les r&#233;sultats. Seules les paires compos&#233;es de termes
simples dans la langue source et dans la langue cible, hors acronymes, sont conserv&#233;es. La liste
bilingue ainsi constitu&#233;e contient environ 12 000 paires de termes.
Le second jeu de termes multilingues est le M&#233;tath&#233;saurus de l&#8217;UMLS (Bodenreider, 2004).
Cette collection de th&#233;saurus rassemble des termes biom&#233;dicaux dans 17 langues et associe
&#224; chacun des termes un identifiant de concept ind&#233;pendant des langues, le Concept Unique
identifier, CUI. Ces CUI nous permettent donc de constituer des ensembles de paires de termes
bilingues. L&#224; encore, seuls les termes simples non acronymes sont conserv&#233;s.
</p>
<p>116</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Inf&#233;rence de r&#232;gles de traduction de termes biom&#233;dicaux
</p>
<p>4.2 M&#233;thode d&#8217;&#233;valuation
Pour l&#8217;&#233;valuation de notre technique, nous suivons une approche standard : la liste initiale de
paires de termes est d&#233;coup&#233;e en deux ensembles, le premier sert pour l&#8217;apprentissage (inf&#233;rence
de r&#232;gles et mod&#232;le de langue), et le second, compos&#233; de 1 000 paires, sert de jeu de test. Une
fois les r&#232;gles et le mod&#232;le de langue appris sur le jeu d&#8217;entra&#238;nement, nous l&#8217;appliquons &#224;
chaque terme d&#8217;entr&#233;e du jeu de test. Nous comparons alors la traduction propos&#233;e avec celle
attendue. Si les deux cha&#238;nes de caract&#232;res sont identiques, la traduction est consid&#233;r&#233;e correcte ;
dans tous les autres cas, elle est consid&#233;r&#233;e incorrecte.
Les r&#233;sultats sont &#233;valu&#233;s en terme de pr&#233;cision (pourcentage de traductions correctes g&#233;n&#233;r&#233;es).
Cependant, puisque le mod&#232;le de langue nous fournit un indice de confiance, on peut d&#233;cider
de ne conserver que les traductions dont l&#8217;indice est sup&#233;rieur &#224; un certain seuil. Un seuil &#233;lev&#233;
doit favoriser la pr&#233;cision au d&#233;triment du nombre de traductions propos&#233;es, et vice-versa. &#192;
la mani&#232;re de courbes rappel-pr&#233;cision, nous repr&#233;sentons donc ci-apr&#232;s la pr&#233;cision suivant le
pourcentage de mots traduits pour tous les seuils possibles d&#8217;indice de confiance.
</p>
<p>4.3 R&#233;sultats
4.3.1 Traduction entre le fran&#231;ais et l&#8217;anglais
</p>
<p>Pour cette premi&#232;re exp&#233;rience, nous nous int&#233;ressons &#224; la traduction entre le fran&#231;ais et l&#8217;an-
glais. Comme pr&#233;cis&#233; pr&#233;c&#233;demment, nous utilisons le jeu de donn&#233;es Masson qui nous permet
de comparer directement nos r&#233;sultats &#224; ceux de Claveau &amp; Zweigenbaum (2005b; 2005a) dont
nous reportons les r&#233;sutats ci-apr&#232;s. Nous utilisons aussi les informations de parties-du-discours
dans le mod&#232;le de langue. Les figures 2 et 3 pr&#233;sentent les graphes de pr&#233;cision des traductions
g&#233;n&#233;r&#233;es sur les ensembles de test pour les deux sens de traduction. Dans des langues proches
comme le sont le fran&#231;ais et l&#8217;anglais, beaucoup de termes sp&#233;cialis&#233;s sont identiques. Comme
simple baseline, nous calculons donc la pr&#233;cision qu&#8217;obtiendrait un syst&#232;me proposant syst&#233;-
matiquement un terme comme sa propre traduction ; cette pr&#233;cision minimale donne ainsi une
id&#233;e de la difficult&#233; de la t&#226;che de traduction.
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  20  40  60  80  100
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p>Pourcentage de termes traduits
</p>
<p>R&#232;gles de r&#233;&#233;criture
Claveau &amp; Zweigenbaum 2005
</p>
<p>Baseline
</p>
<p>FIG. 2 &#8211; Performances de traduction du fran-
&#231;ais vers l&#8217;anglais
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  20  40  60  80  100
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p>Pourcentage de termes traduits
</p>
<p>R&#232;gles de r&#233;&#233;criture
Claveau &amp; Zweigenbaum 2005
</p>
<p>Baseline
</p>
<p>FIG. 3 &#8211; Performances de traduction de l&#8217;an-
glais vers fran&#231;ais
</p>
<p>Notre approche obtient de tr&#232;s bons r&#233;sultats : 85.4 % de pr&#233;cision pour 100 % des mots traduits
117</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent CLAVEAU
</p>
<p>pour le sens fran&#231;ais-anglais et 84.8% pour le sens inverse. Dans les deux cas, l&#8217;am&#233;lioration
par rapport &#224; l&#8217;approche par transducteur (Claveau &amp; Zweigenbaum, 2005b) est de 10%. Cela
s&#8217;explique principalement par la souplesse de notre approche par r&#232;gles qui l&#232;ve la contrainte
de d&#233;terminisme de l&#8217;approche par transducteur imposant qu&#8217;une s&#233;quence ne puisse se traduire
que d&#8217;une fa&#231;on, limitant et complexifiant ainsi l&#8217;apprentissage en pr&#233;sence de donn&#233;es brui-
t&#233;es, d&#8217;exceptions ou de mots polyfonctionnels. Concernant l&#8217;utilisation des mod&#232;les de langue,
on remarque qu&#8217;utiliser les ML sans prendre en compte des parties-du-discours fournit des
pr&#233;cisions l&#233;g&#232;rement plus faibles (82.6% pour le sens fran&#231;ais-anglais et 84.8% pour l&#8217;autre
sens). Et choisir le candidat au hasard parmi les diff&#233;rentes traductions g&#233;ner&#233;es plut&#244;t qu&#8217;uti-
liser les scores de ML m&#232;ne &#224; une pr&#233;cision d&#8217;environ 50%. Ces deux r&#233;sulats montrent bien
l&#8217;int&#233;r&#234;t des ML pour choisir la meilleure traduction et le bien-fond&#233; de l&#8217;inclusion des parties-
du-discours dans ces ML. Enfin, notre technique est tr&#232;s largement au-dessus de la baseline,
mais il convient de noter que celle-ci montre que 25% des termes biom&#233;dicaux sont identiques
en fran&#231;ais et en anglais, ce qui semble indiquer que les deux langues sont suffisamment proches
pour rendre la t&#226;che d&#8217;apprentissage relativement ais&#233;e.
</p>
<p>4.3.2 Autres paires de langues
</p>
<p>Nous r&#233;p&#233;tons les exp&#233;riences avec d&#8217;autres paires de langues disponibles dans l&#8217;UMLS.
Parmi les diff&#233;rentes combinaisons de langues possibles, nous n&#8217;en pr&#233;sentons ci-dessous que
quelques unes. La figure 4 pr&#233;sente les r&#233;sultats obtenus avec deux langues r&#233;put&#233;es proches :
l&#8217;espagnol et le portugais. Les r&#233;sultats sont tr&#232;s bons : 87.9% des termes portugais sont correc-
tement traduits en espagnol quand on traduit tous les termes (i.e. quand aucun seuil pour le ML
n&#8217;est fix&#233;) ; dans le sens inverse, ce sont 85% des termes qui sont correctement traduits. Ces
bons r&#233;sultats ne sont pas surprenants : l&#8217;espagnol et le portugais sont tr&#232;s proches, et comme le
soulignent les tr&#232;s hautes baselines, beaucoup de mots sont en fait identiques.
Nous pr&#233;sentons maintenant les r&#233;sultats obtenus par la traduction de diverses langues vers l&#8217;an-
glais &#8212; cas le plus &#224; m&#234;me d&#8217;&#234;tre utilis&#233; en pratique. La figure 5 pr&#233;sente les performances de
la traduction de l&#8217;espagnol et du portugais vers l&#8217;anglais. Les r&#233;sultats sont plut&#244;t bons : 71.7%
des termes espagnols et 71.5% des termes portugais sont correctement traduits quand toutes les
traductions sont gard&#233;es (i.e. aucun seuil de ML n&#8217;est fix&#233;). Ces r&#233;sultats sont conformes avec
la proximit&#233; de l&#8217;espagnol et du portugais illustr&#233;e dans l&#8217;exp&#233;rience pr&#233;c&#233;dente. La traduction
de l&#8217;italien et du tch&#232;que vers l&#8217;anglais (figure 6) donne &#233;galement des r&#233;sultats comparables :
au pire cas, 70% des termes italiens et 75.5% des termes tch&#232;ques sont correctement traduits.
Comme nous l&#8217;avons dit pr&#233;c&#233;demment, notre technique de traduction peut traiter des langues
avec des alphabets diff&#233;rents, pourvu qu&#8217;elles montrent des r&#233;gularit&#233;s pouvant &#234;tre apprises
automatiquement. Pour illustrer cela, nous nous int&#233;ressons &#224; la paire russe-anglais. La figure 7
pr&#233;sente les r&#233;sultats obtenus ; la pr&#233;cision minimale obtenue ici est de 57.5% (du fait de la
diff&#233;rence d&#8217;alphabet, la baseline est ici &#224; 0). Bien qu&#8217;inf&#233;rieurs aux autres paires de langues,
ces r&#233;sultats sont relativement bons &#233;tant donn&#233;e la difficult&#233; apparente de la t&#226;che. Cela met en
exergue l&#8217;emploi en russe des m&#234;mes racines gr&#233;co-latines que pour les autres langues &#233;tudi&#233;es.
</p>
<p>118</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Inf&#233;rence de r&#232;gles de traduction de termes biom&#233;dicaux
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  20  40  60  80  100
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p>Pourcentage de termes traduits
</p>
<p>R&#232;gle de r&#233;&#233;criture portugais &#224; espagnol
R&#232;gles de r&#233;&#233;criture espagnol &#224; portugais
</p>
<p>Baseline portugais &#224; espagnol
Baseline espagnol &#224; portugais
</p>
<p>FIG. 4 &#8211; Performances de traduction espagnol
- portugais
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  20  40  60  80  100
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p>Pourcentage de termes traduits
</p>
<p>R&#232;gles de r&#233;&#233;criture espagnol!anglais
R&#232;gles de r&#233;&#233;criture portugais!anglais
</p>
<p>Baseline espagnol!anglais
Baseline portugais!anglais
</p>
<p>FIG. 5 &#8211; Performances de traduction portu-
gais/espagnol vers anglais
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  20  40  60  80  100
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p>Pourcentage of termes traduits
</p>
<p>R&#232;gles de r&#233;&#233;criture italien &#224; anglais
R&#232;gles de r&#233;&#233;criture tch&#232;que &#224; anglais
</p>
<p>Baseline italien!anglais
Baseline tch&#232;que!anglais
</p>
<p>FIG. 6 &#8211; Performances de traduction de l&#8217;ita-
lien/tch&#232;que vers l&#8217;anglais
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  20  40  60  80  100
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p>Pourcentage de termes traduits
</p>
<p>R&#232;gles de r&#233;&#233;criture
Baseline
</p>
<p>FIG. 7 &#8211; Performances de traduction du russe
vers l&#8217;anglais
</p>
<p>5 Conclusion
</p>
<p>Notre technique de traduction &#224; base de r&#232;gles de r&#233;&#233;criture capture automatiquement les r&#233;gu-
larit&#233;s existant dans le domaine biom&#233;dical entre les termes des langues sources et cibles. De ce
fait et sans surprise, la principale cause des traductions erron&#233;es observ&#233;es est l&#8217;absence de lien
morphologique entre le terme source et le terme cible. C&#8217;est &#233;videmment souvent le cas pour la
paire russe-anglais, mais aussi pour des paires de langues pourtant proches (e.g. asimiento/grip
pour espagnol-portugais ou embrochage/pinning pour fran&#231;ais-anglais). Les &#233;valuations me-
n&#233;es montrent cependant que ces cas sont assez rares pour que notre technique offre des taux
de pr&#233;cision variables selon les langues mais tr&#232;s bons dans l&#8217;ensemble, et sup&#233;rieurs &#224; ceux
disponibles dans l&#8217;&#233;tat de l&#8217;art. De plus, l&#8217;utilisation de mod&#232;les de langues pour donner un
score &#224; chaque traduction permet de contr&#244;ler la pr&#233;cision souhait&#233;e en fixant ou non un seuil &#224;
d&#233;passer.
Parmi les perspectives ouvertes par ce travail, la traduction des termes complexes (compos&#233;s
de plusieurs mots, comme col du f&#233;mur ) est l&#8217;une des plus importantes pour assurer une bonne
couverture des terminologies &#224; traduire (ils repr&#233;sentent par exemple environ 50 % de la ter-
minologie MeSH). Enfin, dans un cadre plus applicatif, l&#8217;utilisation de cette technique dans un
cadre de recherche d&#8217;information translingue (traduction de requ&#234;tes de la base PubMed) est &#224;
l&#8217;&#233;tude et donne des premiers r&#233;sultats encourageants (Claveau, 2007).
</p>
<p>119</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent CLAVEAU
</p>
<p>R&#233;f&#233;rences
AHRENBERG L., ANDERSSON M. &amp; MERKEL M. (2000). A knowledge-lite approach to
word alignment, chapter 5, p. 97&#8211;138. In (V&#233;ronis, 2000).
BODENREIDER O. (2004). The Unified Medical Language System (UMLS): integrating bio-
medical terminology. Nucleic Acids Research, 32(D267-D270).
BROWN P. F., PIETRA V. J. D., PIETRA S. A. D. &amp; MERCER R. L. (1993). The mathematics
of statistical machine translation: Parameter estimation. Computational Linguistics, 19(2).
CHARNIAK E. (1993). Statistical Language Learning. Cambridge, Massachusetts: MIT Press.
CLAVEAU V. (2007). Traduction automatique de termes biom&#233;dicaux pour la recherche d&#8217;in-
formation interlingue. In Actes de la Conf&#233;rence en Recherche d&#8217;Information et Applications,
CORIA&#8217;07, St-&#201;tienne, France.
CLAVEAU V. &amp; ZWEIGENBAUM P. (2005a). Automatic translation of biomedical terms by su-
pervised transducer inference. In Proceedings of the 10th Conference on Artificial Intelligence
in Medicine, AIME 05, Lecture Notes of Computer Science, Aberdeen, &#201;cosse: Springer.
CLAVEAU V. &amp; ZWEIGENBAUM P. (2005b). Traduction de termes biom&#233;dicaux par inf&#233;rence
de transducteurs. In Actes de la conf&#233;rence Traitement automatique des langues naturelles,
TALN&#8217;05, Dourdan, France.
FLUHR C., BISSON F. &amp; ELKATEB F. (2000). Parallel text alignment using crosslingual
information retrieval techniques, chapter 9. In (V&#233;ronis, 2000).
FUNG P. &amp; MCKEOWN K. (1997). A technical word and term translation aid using noisy
parallel corpora across language groups. Machine Translation, 12(1/2), 53&#8211;87.
GALE W. &amp; CHURCH K. (1991). Identifying word correspondences in parallel texts. In
Proceedings of the 4th Darpa Workshop on Speech and Natural Language, p. 152&#8211;157, Pacific
Grove, CA, &#201;tats-Unis.
KNIGHT K. &amp; GRAEHL J. (1998). Machine transliteration. Computational Linguistics, 24(4),
599&#8211;612.
NAMER F. (2005). Morphos&#233;mantique pour l&#8217;appariement de termes dans le vocabulaire m&#233;-
dical : approche multilingue. In Actes de la conf&#233;rence Traitement Automatique des langues
naturelles, TALN&#8217;05, Dourdan, France.
SCHULZ S., MARK&#211; K., SBRISSIA E., NOHAMA P. &amp; HAHN U. (2004). Cognate Mapping
- A Heuristic Strategy for the Semi-Supervised Acquisition of a Spanish Lexicon from a Por-
tuguese Seed Lexicon. In Proceedings of the 20th International Conference on Computational
Linguistics, COLING&#8217;04, p. 813&#8211;819, Gen&#232;ve, Suisse.
TSUJI K., DAILLE B. &amp; KAGEURA K. (2002). Extracting french-japanese word pairs from
bilingual corpora based on transliteration rules. In Proceedings of the 3rd International Confe-
rence on Language Resources and Evaluation, LREC&#8217;02, p. 499&#8211;502, Las Palmas de Gran
Canaria, Espagne.
J. V&#201;RONIS, Ed. (2000). Parallel Text Processing. Dordrecht: Kluwer Academic Publishers.
WAGNER R. A. &amp; FISCHER M. J. (1974). The string-to-string correction problem. Journal
of the Association for Computing Machinery, 21(1), 168&#8211;173.
</p>
<p>120</p>

</div></div>
</body></html>