<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Ressources lexicales chinoises pour le TALN</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5-8 juin 2007 
</p>
<p>Ressources lexicales chinoises pour le TALN
</p>
<p>Huei-Chi LIN, Max SILBERZTEIN
Laboratoire de S&#233;miolinguistique, Didactique, Informatique (LASELDI) &#8211; 
</p>
<p>Universit&#233; de Franche-Comt&#233;, 30 rue M&#233;gevand 25000 Besan&#231;on 
lin_huei_chi@yahoo.fr 
</p>
<p>max.silberztein@univ-fcomte.fr
</p>
<p>R&#233;sum&#233;.   Nous voulons traiter des textes chinois automatiquement ; pour ce faire, nous 
formalisons le vocabulaire chinois, en utilisant principalement des dictionnaires et des 
grammaires morphologiques et syntaxiques formalis&#233;s avec le logiciel NooJ. Nous pr&#233;sentons 
ici les crit&#232;res linguistiques qui nous ont permis de construire dictionnaires et grammaires, 
sachant que l&#8217;application envisag&#233;e (linguistique de corpus) nous impose certaines contraintes 
dans la formalisation des unit&#233;s de la langue, en particulier des compos&#233;s. 
</p>
<p>Abstract.   In order to parse Chinese texts automatically, we need to formalize the 
Chinese vocabulary by using electronic dictionaries and morphological and syntactic grammars. 
We have used the NooJ software to enter the formalization. We present here the set of linguistic 
criteria used to construct these dictionaries and grammars, so that they can be used by 
corpus-linguistic applications. We focus our discussion on the characterization of Chinese 
linguistic units, specifically compounds. 
</p>
<p>Mots-cl&#233;s :   ressources linguistiques pour le chinois, linguistique de corpus, NooJ.
Keywords:   linguistic resources for chinese, corpus linguistics, NooJ.  
</p>
<p>1 Introduction 
Notre but est de formaliser le vocabulaire de la langue chinoise, plus pr&#233;cis&#233;ment le mandarin 
tel qu&#8217;on le trouve dans les textes litt&#233;raires &#224; partir du XXe si&#232;cle, et &#233;crit avec les caract&#232;res 
chinois traditionnels cod&#233;s avec UNICODE (ce qui repr&#233;sente 70.207 caract&#232;res) pour les 
besoins des applications de linguistique de corpus et d&#8217;analyse syntaxique automatique. Nous 
avons donc entrepris la construction d&#8217;un module chinois pour NooJ1. Ce travail de recherche 
nous a conduits &#224; construire des dictionnaires &#233;lectroniques, des grammaires morphologiques et 
des grammaires syntaxiques. Toutes les unit&#233;s du vocabulaire chinois doivent &#234;tre recens&#233;es 
</p>
<p>1
  Cf. http://www.nooj4nlp.net. NooJ ainsi que le module chinois et d&#8217;autres ressources peuvent &#234;tre t&#233;l&#233;charg&#233;s 
</p>
<p>librement, et les utilisateurs de NooJ peuvent d&#233;velopper leurs propres ensembles de ressources linguistiques 
pour formaliser divers niveaux des langues : orthographe, lexique, morphologie, syntaxe et s&#233;mantique. Ces 
ensembles de ressources peuvent &#234;tre rassembl&#233;es dans un &#171; module &#187; autonome, qui peut ensuite &#234;tre charg&#233; 
par d&#8217;autres utilisateurs pour analyser des textes de grande taille.  
</p>
<p>183</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Huei-Chi LIN, Max SILBERZTEIN
</p>
<p>syst&#233;matiquement et d&#233;crites explicitement. Il est imp&#233;ratif de formaliser tous les types d&#8217;unit&#233;s 
linguistiques, et pas simplement les mots simples, et aussi de d&#233;crire leurs variations lexicales 
et morphologiques, ce que n&#8217;ont pas fait syst&#233;matiquement les dictionnaires traditionnels 
chinois jusqu&#8217;&#224; pr&#233;sent. Par exemple, le dictionnaire &#6319;&#3047; (C&#237;h&#259;i) contient l&#8217;entr&#233;e lexicale 
&#171; &#4029;&#14456; &#187; (hu&#224;c&#232;) [album de peintures], mais ne la relie pas &#224; sa variante orthographique 
&#171; &#4029;&#1501; &#187; (hu&#224;c&#232;) [album de peintures], ni &#224; sa variante morphologique &#171; &#4029;&#14456;&#2077; &#187; (hu&#224;c&#232;&#233;r) 
[album de peintures]. En chinois, il n&#8217;y a pas de blanc s&#233;parateur de mots dans les textes. La 
reconnaissance automatique des mots chinois doit donc passer par la consultation de 
dictionnaires &#233;lectroniques ou de grammaires morphologiques ou syntaxiques complets ; ce 
probl&#232;me ressemble beaucoup &#224; celui de la reconnaissance des mots compos&#233;s et expressions 
fig&#233;es dans les langues romanes, o&#249; l&#8217;on ne sait pas a priori o&#249; s&#8217;arr&#234;te un mot compos&#233;, et o&#249; 
seule un recensement syst&#233;matique et une description pr&#233;cise permettent de distinguer les mots 
compos&#233;s lexicalis&#233;s (par ex. &#171; carte bleue &#187;) des s&#233;quences libres de mots (&#171; carte marron &#187;). 
Nous avons d&#251; adopter une s&#233;rie de crit&#232;res linguistiques pr&#233;cis et surtout reproductibles, pour 
d&#233;cider si une s&#233;quence de caract&#232;res chinois doit ou non &#234;tre lexicalis&#233;e. Ces crit&#232;res sont 
diff&#233;rents de ceux utilis&#233;s en linguistique traditionnelle : par exemple, dans le dictionnaire &#6319;&#3047;
(C&#237;h&#259;i), on trouve des entr&#233;es telles que &#171; &#1595;&#1662; &#187; (b&#225;ich&#299;) [prendre gratuitement un repas], que 
nous n&#8217;avons pas de raison de lexicaliser, tandis que nous d&#233;crivons explicitement l&#8217;entr&#233;e 
&#171; &#5715;&#4022;&#2926; &#187; (g&#257;ngq&#237;nji&#257;) [pianiste], non r&#233;pertori&#233;e dans le dictionnaire &#6319;&#3047; (C&#237;h&#259;i).  
Nous avons d&#233;velopp&#233; le module chinois pour NooJ afin d&#8217;analyser automatiquement des 
textes, de fa&#231;on similaire aux syst&#232;mes CKIP et ICTCLAS ; notre module permet &#233;galement 
d&#8217;identifier les entit&#233;s nomm&#233;es, et d&#8217;extraire &#224; volont&#233; des motifs syntactico-s&#233;mantiques &#224; 
partir de requ&#234;tes d&#8217;utilisateurs. Notre module n&#8217;a pas d&#8217;application directe en traduction 
automatique, ni pour la comparaison entre le chinois, le japonais et le cor&#233;en. Enfin, nos 
dictionnaires &#233;lectroniques ne contiennent pas de synonymes (au contraire de WordNet). 
</p>
<p>2 D&#233;finition des unit&#233;s 
Les Unit&#233;s Linguistiques Atomiques (Atomic Linguistic Units, ou ALUs) de NooJ constituent 
les unit&#233;s les plus petites de la langue qui doivent &#234;tre associ&#233;es &#224; des informations linguistiques. 
Formellement, NooJ traite les ALUs en quatre classes formelles distinctes : 
</p>
<p>1) Affixes (pr&#233;fixe, infixe et suffixe) : Ce sont des s&#233;quences de caract&#232;res chinois d&#233;crites par 
un composant morphologique, ou qui interviennent dans des op&#233;rations lexicales de flexion ou 
de d&#233;rivation. Par exemple, le pr&#233;fixe &#171; &#2403; &#187; (ch&#363;) et le suffixe &#171; &#2077; &#187; (&#233;r)2.
</p>
<p>2) Mots simples : NooJ traite a priori chaque caract&#232;re chinois comme un mot simple. Par 
exemple, le caract&#232;re &#171; &#5547; &#187; (sh&#249;) [arbre] constitue un mot simple et est utilis&#233; dans les textes 
dans des contextes libres. 
</p>
<p>3) Mots compos&#233;s : Ce sont des s&#233;quences de caract&#232;res que nous devons lexicaliser, comme 
par exemple &#171; &#5335;&#5336; &#187; (h&#250;di&#233;) [papillon] et &#171; &#5111;&#2887;&#2110;&#6049; &#187; (j&#299;l&#299;g&#363;l&#363;) [avoir faim]. 
</p>
<p>&#1629; &#2403; (ch&#363;) est un pr&#233;fixe d&#233;terminatif que l&#8217;on place devant les dix premiers num&#233;ros de jours des mois, ce qui
correspond au &#171; er &#187; dans &#171; le 1er janvier &#187;. &#2077; (&#233;r) est un suffixe phon&#233;tique pur (qui ne change pas le sens des 
mots), qu&#8217;on utilise apr&#232;s certains noms, verbes, adjectifs ou adverbes. 
</p>
<p>184</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources lexicales chinoises pour TALN 
</p>
<p>4) Expressions fig&#233;es : Ce sont des s&#233;quences de caract&#232;res potentiellement discontinues. Par 
exemple, &#224; l&#8217;int&#233;rieur de l&#8217;expression &#171; &#2246;&#1344;&#1469; &#187; (tu&#333; xi&#224;shu&#301;) [implanter dans l&#8217;eau &#8212; 
impliquer quelqu&#8217;un dans une situation], on peut ins&#233;rer des pronoms personnels comme &#171; &#1914; &#187; 
(w&#335;) [je], &#171; &#1795; &#187; (n&#301;) [tu], &#171; &#1492; &#187; (t&#257;) [il], etc. : 
&#1795;&#2782;&#2246;&#1492;&#1344;&#1469;&#918; (n&#301; y&#224;o tu&#333; t&#257; xi&#224;shu&#301;) [Tu veux l&#8217;impliquer dans cette situation.] 
</p>
<p>NooJ traite diff&#233;remment les affixes, mots simples et mots compos&#233;s, qui sont des s&#233;quences 
ins&#233;cables constitu&#233;s d&#8217;un ou de plusieurs caract&#232;res, des expressions fig&#233;es qui elles peuvent 
&#234;tre discontinues. Il s&#8217;agit donc d&#8217;une part d&#8217;int&#233;grer et de d&#233;crire les quatre types d&#8217;ALUs du 
chinois dans des dictionnaires : d&#8217;affixes, de mots simples, de mots compos&#233;s et d&#8217;expressions 
fig&#233;es ; et d&#8217;autre part, de construire des grammaires qui permettent de d&#233;crire les conditions 
d&#8217;utilisation et de combinaison de ces ALUs. 
</p>
<p>Par rapport aux approches lexicographiques traditionnelles, les expressions idiomatiques, les 
mots polym&#232;res chinois (cf. ci-dessous) et les mots surcompos&#233;s &#171; en paire &#187; (mots de 2x2 
caract&#232;res) ont &#233;t&#233; simplement int&#233;gr&#233;s &#224; nos dictionnaires puisque ce sont des ALUs comme 
les autres du point de vue du TALN. Par ailleurs, certaines ALUs ont &#233;t&#233; formalis&#233;es selon deux 
m&#233;thodes : l&#8217;une est de les ranger directement dans un dictionnaire ; l&#8217;autre est de les 
repr&#233;senter &#224; l&#8217;int&#233;rieur de grammaires locales, morphologiques ou syntaxiques. 
</p>
<p>Dans l&#8217;alphabet chinois traditionnel (au contraire de l&#8217;alphabet chinois simplifi&#233;), il existe de 
nombreuses variantes orthographiques, i.e. lorsqu&#8217;un mot ou un morph&#232;me s&#8217;&#233;crit avec deux 
orthographes ou plus, et se prononce de la m&#234;me fa&#231;on dans tous les cas. Plusieurs variantes 
d&#8217;un m&#234;me caract&#232;re peuvent cohabiter dans un m&#234;me texte. Nous avons donc entr&#233; une table 
d&#8217;&#233;quivalence qui contient plus de 1.000 paires, telles que &#17810; = &#13159; et &#15705; = &#3870;, et nous avons 
modifi&#233; l&#8217;algorithme de consultation des dictionnaires de NooJ pour qu&#8217;il prenne en compte ces 
&#233;quivalences. 
</p>
<p>3 Crit&#232;res de lexicalisation 
Nous pr&#233;sentons une s&#233;rie de crit&#232;res qui nous ont permis de formaliser le vocabulaire chinois. 
Pour ce faire, nous avons d&#251; adapter les crit&#232;res utilis&#233;s avec NooJ pour d&#233;crire les ALUs des 
langues romanes (pr&#233;sent&#233;es dans Silberztein 1993) ; de plus il a fallu r&#233;soudre les difficult&#233;s 
sp&#233;cifiques au chinois, principalement : 
</p>
<p>1) Du point de vue orthographique, la reconnaissance automatique des ALUs chinoises est plus 
complexe que celle des ALUs pour les langues romanes : un caract&#232;re chinois peut soit 
correspondre &#224; une ALU autonome (comme un &#171; mot simple &#187; fran&#231;ais), soit &#224; un composant 
d&#8217;un ensemble d&#8217;ALUs productifs (&#171; pr&#233;fixe &#187; que l&#8217;on traite avec des r&#232;gles morphologiques), 
soit un composant d&#8217;une ALU plus longue (comme un &#171; mot compos&#233; &#187;) (Lin 2006). 
</p>
<p>2) En chinois, bien plus que dans les langues romanes et l&#8217;anglais, les mots ont 
syst&#233;matiquement plusieurs fonctions syntaxiques. Par exemple, le m&#234;me mot &#171; &#4574;&#6441; &#187; (ji&#283;sh&#236;) 
[expliquer ou explication] peut &#234;tre indiff&#233;remment un verbe ou un nom : 
</p>
<p>&#1492;&#1659;&#1914;&#4574;&#6441;&#1492;&#2596;&#1434;&#3154;&#2946;&#2353;&#2874;&#1666;&#918; [Il m&#8217;explique pourquoi il a &#233;t&#233; absent hier.] 
</p>
<p>&#1914;&#3447;&#2105;&#1329;&#1492;&#2353;&#4574;&#6441;&#918; [J&#8217;ai accept&#233; son explication.] 
</p>
<p>185</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Huei-Chi LIN, Max SILBERZTEIN
</p>
<p>Les ambigu&#239;t&#233;s concernent aussi les adjectifs et les adverbes : 
&#1492;&#2121;&#6416;&#1521;&#5667;&#918; [Il est gentil.]      &#1492;&#2121;&#6416;&#1521;&#5667;&#1670;&#4950;&#1914;&#4997;&#4585;&#918; [Il m&#8217;a parl&#233; gentiment.] 
</p>
<p>les adjectifs et les noms, etc. Pour calculer la fonction d&#8217;un mot dans la phrase (ce qui 
correspond &#224; l&#8217;&#233;tiquetage pour les langues romanes), il faut donc bien souvent analyser 
syntaxiquement pr&#233;alablement la phrase compl&#232;te. Il est donc impossible de commencer 
l&#8217;analyse d&#8217;un texte par une &#233;tape d&#8217;&#233;tiquetage et de lev&#233;e d&#8217;ambigu&#239;t&#233;s : l&#8217;analyseur lexical des 
textes chinois produira donc n&#233;cessairement un r&#233;sultat massivement ambigu, qui sera transmis 
&#224; l&#8217;analyseur syntaxique. L&#8217;architecture sp&#233;cifique de NooJ, qui permet d&#8217;&#233;tiqueter les textes 
partiellement ambigus en produisant une structure d&#8217;annotations potentiellement ambigu&#235;, est 
donc bien adapt&#233;e &#224; l&#8217;analyse lexicale des textes chinois. 
</p>
<p>3.1 Compositionnalit&#233; 
</p>
<p>La majorit&#233; des ALUs chinoises sont constitu&#233;es d&#8217;au moins deux caract&#232;res. Parmi ces mots, 
certains ne peuvent pas &#234;tre d&#233;compos&#233;s car ils contiennent des caract&#232;res non-autonomes, i.e. 
qu&#8217;on ne trouve nulle part ailleurs que dans ces mots. Consid&#233;rons les mots ci-dessous : 
</p>
<p>&#5335;&#5336;
 (h&#250;di&#233;) [papillon], &#5111;&#2887;&#2110;&#6049; (j&#299;l&#299;g&#363;l&#363;) [avoir faim] 
</p>
<p>Ces deux mots contiennent des caract&#232;res qui n&#8217;ont pas d&#8217;utilisation autonome, par exemple, on 
ne trouve pas le caract&#232;re &#171; &#5335; &#187; en dehors du mot [papillon], et on ne trouve pas le caract&#232;re 
&#171; &#5111; &#187; en dehors de [avoir faim]. Il faut donc recenser et d&#233;crire ces mots dans un dictionnaire. 
</p>
<p>En revanche, certains mots peuvent &#234;tre constitu&#233;s de caract&#232;res qui peuvent avoir d&#8217;autres 
emplois de fa&#231;on ind&#233;pendante. Par exemple, consid&#233;rons le mot suivant :  
</p>
<p>&#1595;&#4124;
 (b&#225;ic&#224;i) [chou chinois] 
</p>
<p>Ce mot est constitu&#233; du caract&#232;re &#171; &#4124; &#187; (qui signifie &#171; l&#233;gume &#187;) et du caract&#232;re &#171; &#1595; &#187; (qui 
signifie &#171; blanc &#187;). Mais le sens du mot [chou chinois] ne peut pas &#234;tre d&#233;termin&#233; &#224; partir du 
sens de ses deux constituants. En cons&#233;quence, il faut absolument lexicaliser ce mot, d&#8217;une part 
pour obtenir la bonne analyse du mot, et d&#8217;autre part, pour bloquer une analyse 
compositionnelle qui produirait le r&#233;sultat incorrect &#171; l&#233;gume blanc &#187; (un l&#233;gume blanc 
s&#8217;&#233;crirait &#171; &#1595;&#2353;&#4124; &#187;). 
</p>
<p>3.2 Institutionnalisation 
</p>
<p>Beaucoup de concepts ou objets du monde r&#233;el sont d&#233;sign&#233;s ou nomm&#233;s syst&#233;matiquement de 
la m&#234;me fa&#231;on par les locuteurs d&#8217;une langue, et ce de fa&#231;on arbitraire. Par exemple, le concept 
[c&#339;ur sensible] s&#8217;exprime en chinois par le terme &#171; &#2020;&#4941;&#1448; &#187;, litt&#233;ralement &#171; c&#339;ur de tofu &#187;, 
alors que d&#8217;autres expressions tr&#232;s semblables, telles que &#171; &#1476;&#1546;&#1448;  &#187; (&#171; c&#339;ur de lait &#187;) ou &#171; &#1595;
&#3152;&#1448; &#187; (&#171; c&#339;ur de pur&#233;e &#187;) ne peuvent pas utilis&#233;es pour exprimer ce concept. 
</p>
<p>Les formes dont l&#8217;usage est &#171; institutionnalis&#233; &#187; ne sont pas morphologiquement, 
syntaxiquement ou s&#233;mantiquement diff&#233;rentes des autres formes potentielles qui ne sont 
jamais utilis&#233;es par les locuteurs chinois. Il faut donc distinguer formellement les termes 
vraiment employ&#233;s par les locuteurs chinois des expressions potentielles qui ne le sont jamais. 
</p>
<p>186</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources lexicales chinoises pour TALN 
</p>
<p>Dans certaines applications de la formalisation des langues, telles que la traduction automatique 
ou l&#8217;enseignement des langues secondes, il est n&#233;cessaire de lexicaliser ces termes, qui 
correspondent &#224; la &#171; bonne &#187; traduction, ce qui permet d&#8217;&#233;viter des fautes d&#8217;analyse ou de 
traduction. Ainsi, pour traduire correctement l&#8217;expression fran&#231;aise &#171; c&#339;ur sensible &#187;, il faut 
produire &#171; &#2020;&#4941;&#1448; &#187; sans chercher &#224; analyser les deux constituants de l&#8217;expression fran&#231;aise ou 
de sa traduction : on traduit donc le tout &#171; en bloc &#187;, ce qui revient &#224; dire que l&#8217;expression 
compl&#232;te est une ALU lexicalis&#233;e. La comparaison syst&#233;matique entre les termes et des 
expressions similaires potentielles montre d&#8217;une part, que leur structure syntaxique n&#8217;est pas 
sp&#233;cifique, d&#8217;autre part que la construction des termes ne peut pas &#234;tre calcul&#233;e par des r&#232;gles 
morphologiques, syntaxiques ou s&#233;mantiques. 
</p>
<p>3.3 Structure des mots compos&#233;s 
</p>
<p>A chaque fois que certaines propri&#233;t&#233;s syntaxiques ou s&#233;mantiques d&#8217;une forme chinoise ne 
peuvent pas &#234;tre calcul&#233;es &#224; partir de celles de ses constituants, il faut lexicaliser cette forme et 
la traiter en tant qu&#8217;ALU, i.e. &#171; en bloc &#187;. Cependant, on ne peut pas ne pas noter que de 
nombreux termes compos&#233;s chinois se construisent selon quelques sch&#233;mas productifs. Nous 
d&#233;crivons ces sch&#233;mas. 
</p>
<p>3.3.1 Mots polym&#232;res 
</p>
<p>Les mots polym&#232;res se composent d&#8217;au moins quatre caract&#232;res potentiellement autonomes 
dont les sens sont &#171; similaires &#187;. S&#233;mantiquement, les polym&#232;res chinois sont construits par des 
m&#233;canismes relevant de la coordination. Les caract&#232;res constituant un mot polym&#232;re ne peuvent 
pas &#234;tre remplac&#233;s par d&#8217;autres caract&#232;res. Cependant, leur ordre d&#8217;apparition peut &#234;tre modifi&#233; 
&#224; l&#8217;int&#233;rieur du polym&#232;re. Par exemple, le terme &#171; &#3152;&#5472;&#4061;&#4048; &#187; qui signifie [trousse] peut 
s&#8217;&#233;crire de huit fa&#231;ons diff&#233;rentes : 
</p>
<p>&#3152;&#5472;&#4061;&#4048;
 (zh&#301; m&#242; b&#301; y&#224;n) [papier, encre, pinceau, encrier], mais aussi : 
</p>
<p>&#3152;&#4061;&#4048;&#5472;&#3152;&#4061;&#5472;&#4048;&#3152;&#4048;&#4061;&#5472;&#4061;&#4048;&#3152;&#5472;&#4061;&#5472;&#4048;&#3152;&#4061;&#5472;&#3152;&#4048;&#4048;&#5472;&#3152;&#4061;
  
</p>
<p>80% des mots polym&#232;res se composent de quatre caract&#232;res. Les polym&#232;res sont fr&#233;quemment 
employ&#233;s dans des textes. On distingue traditionnellement trois sortes de polym&#232;res : 
</p>
<p>1) Les quatre caract&#232;res ont des sens semblables. Par exemple : 
&#5032;&#3585;&#2759;&#5018;
</p>
<p> (su&#257;nti&#225;n k&#468;l&#224;) [aigre, doux, amer, &#226;cre &#8594; al&#233;as de la vie] 
</p>
<p>Les quatre caract&#232;res appartiennent au m&#234;me champ s&#233;mantique. 
</p>
<p>2) Les quatre caract&#232;res sont semblables deux &#224; deux ; les deux premiers forment une paire, et 
les deux derniers forment une autre paire. Par exemple : 
</p>
<p>&#1499;&#1900;&#2154;&#2146;
 (xi&#333;ngd&#236; ji&#277;m&#232;i) [grand fr&#232;re, petit fr&#232;re, grande s&#339;ur, petite s&#339;ur &#8594; fr&#232;res et s&#339;urs] 
</p>
<p>&#2154;&#2146;&#1499;&#1900;(ji&#277;m&#232;i xi&#333;ngd&#236;) [grande s&#339;ur, petite s&#339;ur, grand fr&#232;re, petit fr&#232;re &#8594; fr&#232;res et s&#339;urs] 
Ce terme d&#233;signe l&#8217;ensemble des enfants d&#8217;une m&#234;me famille. 
</p>
<p>3) Les deux premiers caract&#232;res qualifient les deux derniers. Par exemple : 
</p>
<p>187</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Huei-Chi LIN, Max SILBERZTEIN
</p>
<p>&#2414;&#5036;&#3079;&#6378;
 (j&#299;ny&#237;n zh&#363;b&#259;o) [or, argent, objet d&#8217;une grande valeur &#8594; tr&#233;sor] 
</p>
<p>Ici il n&#8217;y a pas de possibilit&#233; de permutation des caract&#232;res. &#171; &#2414; &#187; (j&#299;n) et &#171; &#5036; &#187; (y&#237;n) 
appartiennent &#224; la m&#234;me classe s&#233;mantique : m&#233;taux pr&#233;cieux, et qualifient le mot &#171; &#3079;&#6378; &#187; 
(zh&#363;b&#259;o), qui repr&#233;sente la deuxi&#232;me partie de ce polym&#232;re. 
</p>
<p>3.3.2 Mot radical + suffixe signifiant 
</p>
<p>Certains termes sont constitu&#233;s d&#8217;un suffixe signifiant associ&#233; &#224; un ensemble sp&#233;cifique de mots 
de distribution restreinte. Par exemple, le mot &#171; &#4728; &#187; (tu&#225;n) [groupe] peut &#234;tre combin&#233; avec 
une centaine de mots selon la r&#232;gle morphologique productive chinoise : mot radical + Suffixe 
signifiant : 
</p>
<p>&#1661;&#3328;&#4728;
 (h&#233;ch&#224;ngtu&#225;n) [groupe de chanteurs = chorale] 
</p>
<p>&#3702;&#3330;&#4728;
 (f&#259;nw&#232;ntu&#225;n) [groupe d&#8217;interviewers = &#233;quipe journalistique] 
</p>
<p>&#6688;&#1632;&#4728;
 (gu&#257;ngu&#257;ngtu&#225;n) [groupe de touristes] 
</p>
<p>tandis que d&#8217;autres suffixes (&#1648; (ji&#224;ng), &#2889; (yu&#225;n), &#3320; (sh&#257;ng), &#2926; (ji&#257;), etc.) s&#8217;utilisent 
avec d&#8217;autres mots. Plut&#244;t que de lexicaliser toutes ces formes dans un dictionnaire, il vaut 
mieux construire une grammaire locale NooJ qui les d&#233;crit de fa&#231;on unifi&#233;e, cf. Figure 1 : 
</p>
<p>Figure 1 : Une grammaire locale de termes compos&#233;s 
</p>
<p>Dans les grammaires de NooJ, les symboles comme &lt;N+Jiang&gt; r&#233;f&#232;rent &#224; des informations 
lexicales et repr&#233;sentent tous les noms (N) associ&#233;s &#224; la propri&#233;t&#233; &#171; +Jiang &#187; (qui ont &#233;t&#233; 
marqu&#233;s comme pouvant &#234;tre suivis du suffixe &#1648;). Noter que la description en extension de 
</p>
<p>188</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources lexicales chinoises pour TALN 
</p>
<p>ces ALUs dans une grammaire locale repr&#233;sente le fait que leur mode de construction est 
productif, mais pas que ces termes sont analysables : cette situation se retrouve en fran&#231;ais, o&#249; 
par exemple les termes en &#171; assurance &#187; sont productifs : assurance maladie, assurance vie, 
assurance ch&#244;mage, etc. mais chacun des termes construits est non-analysable (par ex. une 
assurance vie n&#8217;est pas une assurance contre la vie). 
</p>
<p>3.3.3 Mots compos&#233;s de structure XY
</p>
<p>En chinois, certains mots compos&#233;s peuvent &#234;tre cr&#233;&#233;s sans conjonction. Ces mots compos&#233;s 
sont class&#233;s en trois cat&#233;gories et doivent &#234;tre aussi rang&#233;s dans un dictionnaire : 
</p>
<p>1) Les deux constituants sont des lemmes lexicaux semblables. Par exemple : 
&#2414;&#5216;&#1583;&#6440;
</p>
<p> (j&#299;nji&#257;ng y&#249;l&#464;) [liqueur d&#8217;or + vin de jade &#8594; un vin d&#233;licieux] 
Il s&#8217;agit donc d&#8217;un mot compos&#233; de deux mots &#171; &#2414;&#5216; &#187; et &#171; &#1583;&#6440; &#187; de m&#234;me classe s&#233;mantique 
qui se combinent. 
</p>
<p>2) Les deux constituants sont synonymes. Par exemple : 
&#1414;&#1367;&#2882;&#2077;
</p>
<p> (g&#333;ngz&#301; g&#275;&#233;r) [jeune homme, gar&#231;on &#8594; fils de riche] 
Ici, le deuxi&#232;me constituant est un synonyme du premier. En chinois, beaucoup de termes sont 
construits gr&#226;ce &#224; des r&#233;p&#233;titions synonymiques. Ici, les deux constituants &#171; &#1414;&#1367; &#187; [jeune 
homme] et &#171; &#2882;&#2077; &#187; [gar&#231;on] sont obligatoirement juxtapos&#233;s, et ne peuvent pas &#234;tre utilis&#233;s 
pour construire le sens de &#171; fils de riche &#187; dans une phrase s&#8217;ils sont isol&#233;s l&#8217;un de l&#8217;autre. 
</p>
<p>3) Chaque constituant d&#233;crit une partie d&#8217;une image 
</p>
<p>Lorsqu&#8217;ils se juxtaposent, les constituants cr&#233;ent alors une image m&#233;taphorique. Dans : 
&#1371;&#5551;&#2636;&#1469;
</p>
<p> (xi&#259;oqi&#225;o li&#250;shu&#301;) [petit pont, eau courante &#8594; un beau paysage] 
</p>
<p>on trouve les deux constituants &#171; &#1371;&#5551; &#187; (petit pont) et &#171; &#2636;&#1469; &#187; (eau courante). 
</p>
<p>3.3.4 Mots compos&#233;s de structure AXBX
</p>
<p>Dans certains termes, les deux constituants XX s&#8217;intercalent avec deux formes A et B qui sont 
semblables, synonymes ou antonymes. Par exemple : 
</p>
<p>&#1346;X&#1344;X (sh&#224;ng X xi&#224; X) [dessus X dessous X] &#2271;X&#1771;X (d&#333;ng X x&#299; X) [est X ouest X] 
&#1683;X&#1464;X (h&#259;o X d&#259;i X) [bon X mauvais X] &#1552;X&#1523;X (zu&#335; X y&#242;u X) [gauche X droit X]
</p>
<p>Trois cas de figure se pr&#233;sentent : 
</p>
<p>1) Les caract&#232;res X sont synonymes, par exemple : 
&#1552;&#2552;&#1523;&#4323;
</p>
<p> (zu&#335; s&#299; y&#242;u xi&#259;ng) [gauche r&#233;fl&#233;chir droite penser &#8594; r&#233;fl&#233;chir pendant longtemps] 
</p>
<p>2) Les caract&#232;res X appartiennent &#224; la m&#234;me classe s&#233;mantique, par exemple : 
</p>
<p>189</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Huei-Chi LIN, Max SILBERZTEIN
</p>
<p>&#1326;&#1451;&#1334;&#4524;
 (q&#299; sh&#335;u b&#257; ji&#259;o) [septs mains, huit pieds &#8594; agitation d&#233;sordonn&#233;e] 
</p>
<p>Les mots simples &#171; &#1451; &#187; [main] et &#171; &#4524; &#187; [pied] sont des membres du corps. 
</p>
<p>3) Les caract&#232;res X sont identiques, par exemple : 
&#1683;&#4997;&#1464;&#4997;
</p>
<p> (h&#259;o shu&#333; d&#259;i shu&#333;) [bon parler mauvais parler &#8594; patiemment] 
</p>
<p>3.4 Locutions idiomatiques 
</p>
<p>On trouve beaucoup de locutions idiomatiques dans les textes chinois, et leur structure est plus 
ou moins r&#233;guli&#232;re. Les locutions idiomatiques peuvent &#234;tre formalis&#233;es avec NooJ de deux 
fa&#231;ons compl&#233;mentaires : lorsque ces locutions sont ins&#233;cables, on peut les ranger dans des 
dictionnaires, tout comme des mots compos&#233;s ; lorsqu&#8217;elles admettent des insertions possibles 
(comme en fran&#231;ais l&#8217;expression &#171; prendre ... en compte &#187;), on doit les traiter avec des 
grammaires syntaxiques locales, cf. (Silberztein 2007). Par exemple, dans l&#8217;expression 
suivante :  
</p>
<p>&#1860;&#1808;&#2280;&#4707;
 (zu&#242; l&#277;ng b&#259;nd&#232;ng) [s&#8217;asseoir sur un banc froid &#8594; &#234;tre mal trait&#233;] 
</p>
<p>les constituants ne sont pas forc&#233;ment juxtapos&#233;s, ce qu&#8217;on peut voir dans le texte suivant : 
&#1492;&#1378;&#1860;&#4632;&#1329;&#1808;&#2280;&#4707;&#918; (t&#257; y&#464; zu&#242; gu&#242; le l&#277;ng b&#259;nd&#232;ng) [Il s&#8217;est d&#233;j&#224; trouv&#233; dans la situation 
d&#8217;&#234;tre mal trait&#233;] 
</p>
<p>Par ailleurs, certaines locutions s&#233;cables admettent des variantes orthographiques que l&#8217;on peut 
repr&#233;senter dans les dictionnaires de NooJ. Par exemple, dans les deux expressions synonymes 
suivantes : 
</p>
<p>&#2246;&#1344;&#1469;
 (tu&#333; xi&#224;shu&#301;) [implanter dans l&#8217;eau &#8594; impliquer quelqu&#8217;un dans une situation] 
</p>
<p>&#2222;&#1344;&#1469;
 (l&#257; xi&#224;shu&#301;) [implanter dans l&#8217;eau &#8594; impliquer quelqu&#8217;un dans une situation] 
</p>
<p>&#1928;&#1344;&#1469;
 (ch&#277; xi&#224;shu&#301;) [implanter dans l&#8217;eau &#8594; impliquer quelqu&#8217;un dans une situation] 
</p>
<p>le verbe &#171; &#2246; &#187; (tu&#333;) peut &#234;tre remplac&#233; par les verbes &#171; &#2222; &#187; (l&#257;) et &#171; &#1928; &#187; (ch&#277;) sans aucun 
changement de sens. 
</p>
<p>Certaines locutions admettent des variantes productives, que l&#8217;on peut traiter avec le module 
morphologique de NooJ, un peu comme on traite les variantes orthographiques des langues 
romanes. Par exemple, la locution suivante : 
</p>
<p>&#2386;&#3774;&#4920;&#2020;&#2164; (zh&#299;m&#225; l&#476;d&#242;u gu&#257;n) [s&#233;same, haricot mungo, fonctionnaire &#8594; petit fonctionnaire] 
</p>
<p>accepte quatre variantes que l&#8217;on peut repr&#233;senter &#224; l&#8217;aide d&#8217;un automate fini dans NooJ, cf. 
Figure 2.  
</p>
<p>190</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources lexicales chinoises pour TALN 
</p>
<p>Figure 2 : D&#233;rivation de la locution &#2386;&#3774;&#4920;&#2020;&#2164; [petit fonctionnaire] 
</p>
<p>4 Conclusion 
Notre formalisation du vocabulaire chinois est fond&#233;e sur une classification en quatre classes 
d&#8217;unit&#233;s linguistiques atomiques : affixes, mots simples, mots compos&#233;s et expressions fig&#233;es, 
qui correspondent &#224; des crit&#232;res purement orthographiques. Puisque la plupart des unit&#233;s 
linguistiques chinoises sont indistinguables des simples s&#233;quences de caract&#232;res (il n&#8217;y a pas de 
blanc en chinois), il est indispensable de se doter de crit&#232;res syntaxiques et s&#233;mantiques pr&#233;cis 
et reproductibles pour d&#233;cider si une forme ou expression doit ou non &#234;tre d&#233;crite dans un 
dictionnaire, plut&#244;t que d&#8217;&#234;tre trait&#233;e comme une s&#233;quence analysable de mots. 
</p>
<p>1) Le crit&#232;re de la compositionalit&#233; v&#233;rifie si toutes les propri&#233;t&#233;s d&#8217;une forme peuvent ou non 
&#234;tre calcul&#233;es &#224; partir des constituants de la forme. 
</p>
<p>2) Le crit&#232;re d&#8217;institutionnalisation v&#233;rifie si une forme ou expression est ou non utilis&#233;e de 
fa&#231;on syst&#233;matique et privil&#233;gi&#233;e par rapport &#224; d&#8217;autres expressions potentielles. 
</p>
<p>Les mots et expressions chinois sont souvent construits sur des sch&#233;mas morpho-syntaxiques 
productifs (par exemple les polym&#232;res), bien connus des linguistes traditionnels chinois. Nous 
avons donc class&#233; les termes selon leur structure, ce qui du m&#234;me coup rend la maintenance de 
nos dictionnaires plus facile. 
</p>
<p>Nous avons d&#251; modifier NooJ pour qu&#8217;il puisse prendre en compte des ph&#233;nom&#232;nes sp&#233;cifiques 
au chinois, comme par exemple la variation syst&#233;matique de certains caract&#232;res (par exemple 
&#16511; &#4514;= ) et les op&#233;rations morphologiques de r&#233;duplication (&#1910;&#5207; devient &#1910;&#1910;&#5207;&#5207;). 
L&#8217;ensemble des outils lexicaux de NooJ (dictionnaires, grammaires flexionnelles, grammaires 
morphologiques et grammaires syntaxiques locales) ont &#233;t&#233; utilis&#233;s. 
</p>
<p>Le dictionnaire chinois de NooJ contient actuellement 93.013 entr&#233;es lexicales, dont 9 % sont 
des caract&#232;res autonomes (&#171; mots simples &#187;) ou non-autonomes, 27 % sont des mots de deux 
caract&#232;res, 24 % sont des mots compos&#233;s de trois caract&#232;res et 40 % sont des mots de quatre 
</p>
<p>191</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Huei-Chi LIN, Max SILBERZTEIN
</p>
<p>caract&#232;res ou plus. Le module chinois contient aussi des dictionnaires sp&#233;cialis&#233;s, tels que un 
dictionnaire de noms de famille, un dictionnaire de toponymes, etc. ainsi que plus de vingt 
grammaires, dont des grammaires morphologiques et des grammaires syntaxiques locales, 
telles que la grammaire de date, de lieux, de noms de personne, etc. 
</p>
<p>Nous avons d&#233;velopp&#233;, test&#233; et affin&#233; ce module &#224; partir d&#8217;un corpus d&#8217;une cinquantaine de 
textes litt&#233;raires (par exemple S&#236;sh&#236;t&#243;ngt&#225;ng de Lao She et Ch&#233;ngn&#225;n ji&#249;sh&#236; de Lin Haiyin) ; 
apr&#232;s enrichissement des donn&#233;es, le module couvre la totalit&#233; du vocabulaire de ces textes, en 
incluant la reconnaissance de motifs syntaxiques tels que les noms professionnels. Le module 
chinois de NooJ peut &#234;tre t&#233;l&#233;charg&#233; &#224; partir du site WEB de NooJ : http://www.nooj4nlp.net.  
</p>
<p>R&#233;f&#233;rences 
CAO WEI &#3494;&#19749;. (2004). &#19842;&#1626;&#19641;&#20863;&#20831;&#19639;&#2708;&#2002;Xiandai hanyu cihui yanjiu . Beijing &#1511;&#2055; : Peking 
University Press &#1511;&#2055;&#1365;&#18276;&#1504;&#2336;&#2359;.
</p>
<p>FU HUAIQING &#3620;&#3554;&#2425;. (2005). Xiandai hanyu cihui (Zengding ben) &#19842;&#1494;&#19641;&#20863;&#20831;&#19639;&#944;&#5114;&#20788;&#1569;&#945;. 
coll. &#171; yuyanxue jiaocai xilie &#20863;&#2018;&#18276;&#3474;&#1943;&#2003;&#1640; &#187;. 2nd ed. Beijing &#1511;&#2055; : Beijing daxue 
chubanshe &#1511;&#2055;&#1365;&#18276;&#1504;&#2336;&#2359;.
</p>
<p>GE BENYI &#4540;&#1569;&#18647;. (2002). Xiandai hanyu cihuixue &#19842;&#1494;&#19641;&#20863;&#20831;&#19639;&#18276;. Jinan &#19669;&#2468; : Shandong 
renmin chubanshe &#1374;&#18581;&#1331;&#1575;&#1504;&#2336;&#2359;.
</p>
<p>KANG SHIYONG &#1399;&#1480;&#2463;. (2004). Mianxiang xinxi chuli de xiandai hanyu yufa yanjiu 
&#2815;&#1659;&#2430;&#2962;&#14474;&#3579;&#2353;&#19842;&#1494;&#19641;&#20863;&#20863;&#2308;&#2708;&#2002;. coll. &#171; Yuyan wenzi lilun yu yingyong yanjiu wenku 
&#20863;&#2018;&#1454;&#1687;&#3579;&#20812;&#6739;&#19223;&#1588;&#2708;&#2002;&#1454;&#19222;
</p>
<p> &#187;. Shanghai &#1346;&#3047; : Shanghai cishu chubanshe 
&#1346;&#3047;&#16569;&#18608;&#1504;&#2336;&#2359;
</p>
<p> and Shiji chuban jituan &#1480;&#20227;&#1504;&#2336;&#4227;&#18970;.
LIN HUEICHI &#2277;&#3873;&#4481;. (2006). Les probl&#232;mes rencontr&#233;s dans le domaine de la cat&#233;gorisation 
grammaticale du chinois et leurs solutions propos&#233;es. 9th INTEX/NooJ Conf&#233;rence.
LU SHICHENG &#3756;&#2947;&#1707;. (1992). Cihai &#6319;&#3047;. Taipei &#4949;&#1511; : Wenhua tushu gongsi &#1454;&#1423;&#4729;&#3004;&#1414;
&#1529;.
</p>
<p>SILBERZTEIN MAX. (1993). Les groupes nominaux productifs et les noms compos&#233;s lexicalis&#233;s. 
Linguistic&#230; Investigationes 2, 405-425. 
</p>
<p>SILBERZTEIN MAX. (2002). NooJ Manuel d&#8217;utilisation en anglais que l&#8217;on peut t&#233;l&#233;charger &#224; 
partir de http://www.nooj4nlp.net (environ 200 pages).
SILBERZTEIN MAX. (2007). Frozen expressions and discontinuous annotations. In the 
Proceedings of Computational Linguistics 2007. Birmingham. 
</p>
<p>SUN YINXIN &#19096;&#21372;&#4357;. (2003). &#19842;&#1494;&#19641;&#20863;&#20831;&#3144;&#2708;&#2002;Xiandai hanyu cisu yanjiu . coll. &#171; Zhonghua 
&#1389;&#18816;&#18276;&#1331;&#18580;&#18608;xueren congshu  &#1511;&#2055;&#187;. Beijing  : Zhongguo wenshi chubanshe 
</p>
<p>&#1389;&#14842;&#1454;&#1534;&#1504;&#2336;&#2359;.
</p>
<p>ZHU DEXI &#1721;&#5146;&#4858;. (2003). Xiandai hanyu yufa yanjiu&#19842;&#1494;&#19641;&#20863;&#20863;&#2308;&#2708;&#2002;. coll. &#171; Shangwu 
yinshuguan wenku &#3320;&#18780;&#1649;&#18608;&#21758;&#1454;&#19222; &#187;. Beijing &#1511;&#2055; : Shangwu yinshuguan &#3320;&#18780;&#1649;&#18608;&#21758;.
</p>
<p>192</p>

</div></div>
</body></html>