<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;valuation des stades de d&#233;veloppement en fran&#231;ais langue &#233;trang&#232;re</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>&#201;valuation des stades de d&#233;veloppement
en fran&#231;ais langue &#233;trang&#232;re&#8727;
</p>
<p>Jonas GRANFELDT1, Pierre NUGUES2
1 Centre de langues et de litt&#233;rature, Universit&#233; de Lund, S-221 00 Lund
</p>
<p>2 Institut d&#8217;informatique, Institut de Technologie de Lund, S-221 00 Lund
Jonas.Granfeldt@rom.lu.se, Pierre.Nugues@cs.lth.se
</p>
<p>R&#233;sum&#233;. Cet article d&#233;crit un syst&#232;me pour d&#233;finir et &#233;valuer les stades de d&#233;veloppement
en fran&#231;ais langue &#233;trang&#232;re. L&#8217;&#233;valuation de tels stades correspond &#224; l&#8217;identification de la fr&#233;-
quence de certains ph&#233;nom&#232;nes lexicaux et grammaticaux dans la production des apprenants et
comment ces fr&#233;quences changent en fonction du temps. Les probl&#232;mes &#224; r&#233;soudre dans cette
d&#233;marche sont triples : identifier les attributs les plus r&#233;v&#233;lateurs, d&#233;cider des points de s&#233;pa-
ration entre les stades et &#233;valuer le degr&#233; d&#8217;efficacit&#233; des attributs et de la classification dans
son ensemble. Le syst&#232;me traite ces trois probl&#232;mes. Il se compose d&#8217;un analyseur morphosyn-
taxique, appel&#233; Direkt Profil, auquel nous avons reli&#233; un module d&#8217;apprentissage automatique.
Dans cet article, nous d&#233;crivons les id&#233;es qui ont conduit au d&#233;veloppement du syst&#232;me et
son int&#233;r&#234;t. Nous pr&#233;sentons ensuite le corpus que nous avons utilis&#233; pour d&#233;velopper notre
analyseur morphosyntaxique. Enfin, nous pr&#233;sentons les r&#233;sultats sensiblement am&#233;lior&#233;s des
classificateurs compar&#233; aux travaux pr&#233;c&#233;dents (Granfeldt et al., 2006). Nous pr&#233;sentons &#233;ga-
lement une m&#233;thode de s&#233;lection de param&#232;tres afin d&#8217;identifier les attributs grammaticaux les
plus appropri&#233;s.
</p>
<p>Abstract. This paper describes a system to define and evaluate stages of development in
second language French. The task of identifying such stages can be formulated as identifying
the frequency of some lexical and grammatical features in the learners&#8217; production and how they
vary over time. The problems in this procedure are threefold : identify the relevant features, de-
cide on cutoff points for the stages, and evaluate the degree of efficiency of the attributes and of
the overall classification. The system addresses these three problems. It consists of a morpho-
syntactic analyzer called Direkt Profil and a machine-learning module connected to it. We first
describe the usefulness and rationale behind the development of the system. We then present
the corpus we used to develop our morphosyntactic analyzer called Direkt Profil. Finally, we
present new and substantially improved results on training machine-learning classifiers compa-
red to previous experiments (Granfeldt et al., 2006). We also introduce a method of attribute
selection in order to identify the most relevant grammatical features.
</p>
<p>Mots-cl&#233;s : analyseur morphosyntaxique, apprentissage automatique, acquisition des
langues.
</p>
<p>Keywords: morphosyntactic parser, machine learning, language acquisition.
&#8727;Une premi&#232;re version de cet article a &#233;t&#233; pr&#233;sent&#233;e &#224; la 16e conf&#233;rence nordique de traitement automatique
</p>
<p>des langues, NODALIDA 2007, Tartu, Estonie, sous le titre Evaluating Stages of Development in Second Language
French : A Machine-Learning Approach.
</p>
<p>357</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas GRANFELDT, Pierre NUGUES
</p>
<p>1 Introduction
</p>
<p>L&#8217;un des points essentiels des recherches sur l&#8217;acquisition des langues &#233;trang&#232;res est l&#8217;identifi-
cation et l&#8217;analyse des stades de d&#233;veloppement que l&#8217;on traverse en apprenant une deuxi&#232;me
langue ou une langue &#233;trang&#232;re. La notion de stade de d&#233;veloppement peut s&#8217;appliquer aux don-
n&#233;es de tous les niveaux linguistiques, mais elle est particuli&#232;rement int&#233;ressante pour rendre
compte de l&#8217;acquisition de la morphologie et de la syntaxe. Dans ce cadre, on peut consid&#233;rer
la grammaire interne de l&#8217;apprenant comme un syst&#232;me propre qui se d&#233;velopperait et subirait
des restructurations au cours du temps.
</p>
<p>La mod&#233;lisation du d&#233;veloppement de la grammaire de l&#8217;apprenant et de ses propri&#233;t&#233;s &#224; des
moments diff&#233;rents revient, pour l&#8217;essentiel, &#224; identifier les ph&#233;nom&#232;nes grammaticaux perti-
nents, &#224; d&#233;finir des points de s&#233;paration entre les stades et &#224; les &#233;valuer de mani&#232;re syst&#233;matique.
Dans cet article, nous d&#233;crivons et nous &#233;valuons un syst&#232;me qui a enti&#232;rement automatis&#233; ce
processus. Avant de le pr&#233;senter, nous d&#233;crivons de fa&#231;on simplifi&#233;e comment on identifie en
g&#233;n&#233;ral les stades de d&#233;veloppement dans le domaine de l&#8217;acquisition des langues.
</p>
<p>2 Contexte
</p>
<p>2.1 M&#233;thode actuelle pour identifier les stades de d&#233;veloppement
</p>
<p>La premi&#232;re &#233;tape pour identifier les stades de d&#233;veloppement est de d&#233;terminer et d&#8217;extraire des
ph&#233;nom&#232;nes grammaticaux dans la production, orale ou &#233;crite, d&#8217;une population repr&#233;sentative
d&#8217;apprenants. Le point crucial dans le choix de ces ph&#233;nom&#232;nes est qu&#8217;ils aient une validit&#233;
interne, dont les r&#233;alisations peuvent traduire un changement qualitatif de la grammaire. Une
deuxi&#232;me &#233;tape est de comprendre et mod&#233;liser leur d&#233;veloppement.
</p>
<p>Certains ph&#233;nom&#232;nes linguistiques montrent un d&#233;veloppement lin&#233;aire simple et les pourcen-
tages d&#8217;usages corrects ont une augmentation stable avec le temps. D&#8217;autres ph&#233;nom&#232;nes ont un
d&#233;veloppement non lin&#233;aire, parfois en forme de &#171; U &#187;, o&#249; les pourcentages d&#8217;usages corrects
au d&#233;but de l&#8217;acquisition sont &#233;lev&#233;s mais diminuent dans une deuxi&#232;me phase pour ensuite re-
gagner un niveau &#233;lev&#233; de rectitude dans une troisi&#232;me phase. Une explication qui a souvent &#233;t&#233;
propos&#233;e pour ce type d&#8217;&#233;volution est que la premi&#232;re phase contient un certain nombre d&#8217;ex-
pressions fixes apprises de fa&#231;on holistique par l&#8217;apprenant. Ces structures, peut-&#234;tre apprises
par c&#339;ur, repr&#233;senteraient alors des structures linguistiques non-analys&#233;es dans la grammaire
interne des apprenants. Ensuite, une fois que les s&#233;quences de d&#233;veloppement sont connues,
il faut d&#233;cider des points de s&#233;paration dans les donn&#233;es o&#249; l&#8217;apprenant a atteint un nouveau
stade de d&#233;veloppement. La plupart du temps, il est pr&#233;f&#233;rable de prendre en compte plusieurs
ph&#233;nom&#232;nes grammaticaux pour en m&#234;me temps r&#233;aliser un &#171; profilage grammatical &#187;.
</p>
<p>2.2 Probl&#232;mes de la m&#233;thode actuelle
</p>
<p>L&#8217;analyse morphosyntaxique d&#233;taill&#233;e de textes ou d&#8217;&#233;nonc&#233;s produits par les apprenants est une
partie centrale dans la m&#233;thode d&#233;crite dans le paragraphe pr&#233;c&#233;dent. La plupart des analystes
travaillant sur l&#8217;acquisition d&#8217;une premi&#232;re et d&#8217;une deuxi&#232;me langue ont maintenant acc&#232;s &#224; de
grands corpus de productions orales et &#233;crites. Dans notre cas, ce sont des textes &#233;crits mais on
</p>
<p>358</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation des stades de d&#233;veloppement en fran&#231;ais langue &#233;trang&#232;re
</p>
<p>pourrait tout aussi bien l&#8217;appliquer &#224; des transcriptions de productions orales. Pour des langues
r&#233;pandues, comme l&#8217;anglais et le fran&#231;ais, on dispose &#233;galement d&#8217;outils tels que des analy-
seurs morphologiques et des &#233;tiqueteurs de parties du discours (MacWhinney, 2000). Ces outils
peuvent r&#233;duire de fa&#231;on consid&#233;rable le temps de l&#8217;analyse morphosyntaxique qui autrement
serait tr&#232;s fastidieuse.
</p>
<p>Cependant m&#234;me avec ces outils, beaucoup d&#8217;analyses manuelles restent &#224; faire. D&#8217;abord il
n&#8217;existe actuellement aucun outil automatis&#233; fiable pour l&#8217;analyse syntaxique de textes d&#8217;appre-
nants malgr&#233; quelques tentatives r&#233;centes pour l&#8217;anglais (Sagae et al., 2005). Pour le fran&#231;ais,
une partie des structures linguistiques utilis&#233;es dans le profilage grammatical peuvent &#234;tre d&#233;-
tect&#233;es en utilisant des outils comme CHILDES. Mais pour d&#8217;autres structures plus complexes
telles que l&#8217;accord entre les constituants, c&#8217;est impossible. Un autre probl&#232;me est qu&#8217;avec les
outils actuels, on ne peut effectuer que des requ&#234;tes simples sur un ph&#233;nom&#232;ne individuel alors
que dans le profilage grammatical, on doit en analyser un grand nombre en m&#234;me temps.
</p>
<p>Un troisi&#232;me probl&#232;me concerne le c&#244;t&#233; artificiel des stades. Le r&#233;sultat de l&#8217;analyse morpho-
syntaxique est pr&#233;sent&#233; typiquement sous forme de fr&#233;quences de certains ph&#233;nom&#232;nes. Pour un
ph&#233;nom&#232;ne linguistique particulier, par exemple l&#8217;accord sujet-verbe &#224; la troisi&#232;me personne du
singulier au pr&#233;sent, on identifie les diff&#233;rentes r&#233;alisations de cette structure et on les compte.
Les donn&#233;es compil&#233;es pour tous les apprenants et tous les ph&#233;nom&#232;nes et structures faisant
partie du profil grammatical sont ensuite inspect&#233;es afin d&#8217;identifier intuitivement des stades
de d&#233;veloppement. Il y a actuellement de multiples fa&#231;ons de traiter cette &#233;tape, mais aucune
n&#8217;a re&#231;u d&#8217;&#233;valuation syst&#233;matique. Une raison possible est que personne n&#8217;ait reli&#233; les deux
premi&#232;res &#233;tapes, l&#8217;analyse morphosyntaxique et l&#8217;analyse des fr&#233;quences, &#224; un traitement sta-
tistique. Si un traitement enti&#232;rement automatis&#233; du processus &#233;tait disponible, toutes ses &#233;tapes
auraient pu &#234;tre &#233;valu&#233;es plus compl&#232;tement.
</p>
<p>Dans le reste de l&#8217;article, nous pr&#233;sentons notre syst&#232;me qui vise &#224; surmonter les probl&#232;mes
mentionn&#233;s pr&#233;c&#233;demment. Nous commen&#231;ons par un bref r&#233;sum&#233; des travaux pr&#233;c&#233;dents sur
le d&#233;veloppement morphosyntaxique du fran&#231;ais langue &#233;trang&#232;re. Nous d&#233;crivons ensuite le
corpus que nous employons ainsi que de fa&#231;on br&#232;ve notre analyseur, Direkt Profil. Dans les
derniers paragraphes, nous discutons de notre d&#233;marche fond&#233;e sur l&#8217;apprentissage automatique
pour d&#233;finir et &#233;valuer les stades de d&#233;veloppement et pour s&#233;lectionner les attributs. Nous
pr&#233;sentons enfin nos r&#233;sultats actuels.
</p>
<p>3 D&#233;veloppement morphosyntaxique du fran&#231;ais deuxi&#232;me
langue
</p>
<p>Une partie des recherches sur le d&#233;veloppement morphosyntaxique de fran&#231;ais langue &#233;trang&#232;re
a pour objectif d&#8217;atteindre une description d&#233;taill&#233;e de la fa&#231;on dont les apprenants d&#233;veloppent
leur grammaire en fonction du temps. L&#8217;&#233;tude de Bartning &amp; Schlyter (2004) en est un exemple
pour le fran&#231;ais parl&#233;, o&#249; les auteurs ont identifi&#233; environ 25 constructions morphosyntaxiques
diff&#233;rentes et ont propos&#233; une d&#233;finition de leur d&#233;veloppement dans le temps pour des Su&#233;dois
adultes. Pris ensemble, ces ph&#233;nom&#232;nes d&#233;limitent six stades sous la forme de profils gramma-
ticaux qui s&#8217;&#233;tendent des d&#233;butants aux apprenants tr&#232;s avanc&#233;s. Des exemples de constructions
sont donn&#233;s dans le tableau 1. Au fur et &#224; mesure que l&#8217;apprenant automatise la mise en &#339;uvre
de la langue cible, les structures produites deviennent plus fr&#233;quentes, plus complexes et plus
correctes. Les itin&#233;raires d&#8217;acquisition d&#233;crivent ce processus en termes linguistiques.
</p>
<p>359</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas GRANFELDT, Pierre NUGUES
</p>
<p>Stades 1 2 3 4 5 6
% Formes conjugu&#233;es de
verbes lexicaux en contextes
obligatoires
</p>
<p>50-75 70-80 80-90 90-98 100 100
</p>
<p>% Accord 1re personne plu-
riel S-V (nous V-ons)
</p>
<p>&#8211; 70-80 80-95 100 100 100
</p>
<p>% Accord 3e pers pluriel
avec verbes irr&#233;guliers
lexicaux comme viennent,
veulent, prennent
</p>
<p>&#8211; &#8211; qq cas &#8776; 50 qq erreurs 100
</p>
<p>Placement des pronoms ob-
jets
</p>
<p>&#8211; SVO S(v)oV SovV app. SovV prod acquis
(y et en)
</p>
<p>% Accord genre grammatical 55-75 60-80 65-85 70-90 75-95 90-100
</p>
<p>TAB. 1 &#8211; Itin&#233;raire de d&#233;veloppement d&#8217;apr&#232;s Bartning &amp; Schlyter (2004). L&#233;gende : &#8211; = pas
d&#8217;occurrences ; app = appara&#238;t ; prod = productif niveau avanc&#233;.
</p>
<p>4 Un corpus &#233;crit de fran&#231;ais langue &#233;trang&#232;re
</p>
<p>Pour d&#233;velopper notre analyseur (voir &#167; 5) et exp&#233;rimenter notre approche d&#8217;apprentissage au-
tomatique des stades, nous avons utilis&#233; le Corpus &#201;crit de Fran&#231;ais Langue &#201;trang&#232;re de Lund
(&#197;gren, 2005) &#8211; CEFLE. CEFLE se compose de textes en fran&#231;ais provenant de 85 &#233;tudiants
su&#233;dois &#224; diff&#233;rents niveaux de d&#233;veloppement. Il contient approximativement 400 textes et
100 000 mots. Il comporte &#233;galement des textes d&#8217;un groupe de contr&#244;le de 22 jeunes Fran&#231;ais
du m&#234;me &#226;ge. CEFLE a &#233;t&#233; compil&#233; lors de l&#8217;ann&#233;e scolaire 2003/2004 pendant laquelle chaque
&#233;tudiant a &#233;crit quatre ou cinq textes &#224; deux mois d&#8217;intervalle.
</p>
<p>Pour notre &#233;tude, nous avons utilis&#233; un sous-ensemble de 317 textes du corpus dont les carac-
t&#233;ristiques sont donn&#233;es dans le tableau 2. En employant les crit&#232;res d&#233;crits dans Bartning &amp;
Schlyter (2004), un membre de l&#8217;&#233;quipe a au pr&#233;alable annot&#233; un texte de chaque &#233;tudiant et a
estim&#233; le stade de d&#233;veloppement qu&#8217;il refl&#233;tait. Pour les exp&#233;rimentations que nous d&#233;crivons
dans les paragraphes qui suivent, nous avons attribu&#233; de fa&#231;on syst&#233;matique la m&#234;me classi-
fication aux trois ou quatre autres textes du m&#234;me &#233;tudiant dans le corpus. Nous avons ainsi
propag&#233; le stade annot&#233; &#224; la main &#224; tous les textes du m&#234;me &#233;tudiant. Nous avons suppos&#233; que
g&#233;n&#233;ralement l&#8217;&#233;tudiant ne monterait pas d&#8217;un stade pendant la courte p&#233;riode o&#249; a eu lieu la
collecte des textes.
</p>
<p>CEFLE Sous-ensemble de CEFLE (moyenne)
T&#226;che Type d&#8217;&#233;licitation Mots Stade Textes Taille texte Taille phrases
Homme Images 17 260 Stade 1 23 78 6,9
Souvenir R&#233;cit personnel 14 365 Stade 2 98 161 8,4
Italie Images 30 840 Stade 3 97 212 9,8
Moi R&#233;cit personnel 30 355 Stade 4 58 320 11,6
Total 92 820 Contr&#244;le 41 308 15,2
</p>
<p>TAB. 2 &#8211; La description g&#233;n&#233;rale du corpus CEFLE et du sous-ensemble utilis&#233; dans les exp&#233;-
riences rapport&#233;es dans cet article.
</p>
<p>360</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation des stades de d&#233;veloppement en fran&#231;ais langue &#233;trang&#232;re
</p>
<p>5 Direkt Profil
</p>
<p>Direkt Profil (Granfeldt et al., 2005, 2006) est un analyseur morphosyntaxique con&#231;u pour du
fran&#231;ais langue &#233;trang&#232;re. Le but initial &#233;tait de mettre en &#339;uvre une analyse automatique des
ph&#233;nom&#232;nes et des constructions grammaticaux contenus dans le tableau 1. Dans sa version
actuelle, le syst&#232;me ne d&#233;tecte pas certains des ph&#233;nom&#232;nes indiqu&#233;s par Bartning &amp; Schlyter
(2004), mais en contrepartie il en d&#233;tecte un grand nombre d&#8217;autres. Le syst&#232;me a fait l&#8217;objet
d&#8217;une pr&#233;sentation d&#233;taill&#233;e dans des articles pr&#233;c&#233;dents et nous nous contenterons d&#8217;en donner
une br&#232;ve description.
</p>
<p>Le concept de groupe, nominal ou verbal, correct ou non, repr&#233;sente le support grammatical
essentiel de notre analyse. Nous avons d&#233;fini une annotation des textes, propre au projet, fond&#233;
sur ces groupes. Elle prend en compte les ph&#233;nom&#232;nes linguistiques caract&#233;ristiques des iti-
n&#233;raires de d&#233;veloppement d&#8217;apr&#232;s les cat&#233;gories d&#233;crites par Bartning &amp; Schlyter (2004). La
version actuelle de Direkt Profil, V. 2.1, d&#233;tecte trois types de groupes syntaxiques : nominaux
non-r&#233;cursifs, verbaux et pr&#233;positionnels.
</p>
<p>L&#8217;analyseur utilise des r&#232;gles &#233;crites manuellement et s&#8217;appuie sur un lexique de formes fl&#233;-
chies. De fa&#231;on conceptuelle, l&#8217;analyseur recherche des classes de structures syntagmatiques
sans consid&#233;rer leurs traits grammaticaux. Il identifie ensuite les structures progressivement en
tentant d&#8217;affecter des valeurs &#224; ces traits. La reconnaissance des limites des groupes se fait par
un ensemble de mots vides et par des heuristiques &#224; l&#8217;int&#233;rieur des r&#232;gles. Direkt Profil applique
en cascade trois ensembles de r&#232;gles pour produire quatre niveaux d&#8217;annotations. Le premier
ensemble segmente le texte en mots. Un ensemble interm&#233;diaire identifie les expressions fig&#233;es.
Le troisi&#232;me ensemble annote simultan&#233;ment les parties du discours et les groupes. Finalement,
le moteur cr&#233;e un groupe de r&#233;sultats reli&#233; au stade de l&#8217;apprenant. Il est &#224; noter que le moteur
n&#8217;annote pas tous les mots, ni tous les segments. Il ne consid&#232;re que ceux qui sont pertinents
pour la d&#233;termination du stade. Le moteur applique les r&#232;gles de gauche &#224; droite puis de droite
&#224; gauche pour r&#233;soudre certains probl&#232;mes d&#8217;accord.
</p>
<p>La version actuelle de Direkt Profil est accessible en ligne &#224; l&#8217;adresse www.rom.lu.se :8080/pro-
fil. La performance de la version 1.5.2 pour la d&#233;tection des segments a &#233;t&#233; &#233;valu&#233;e dans Gran-
feldt et al. (2005). Les r&#233;sultats ont donn&#233; une moyenne harmonique F globale de pr&#233;cision et
de rappel de 0,83.
</p>
<p>6 Une m&#233;thode d&#8217;apprentissage automatique pour &#233;valuer
les stades de d&#233;veloppement
</p>
<p>&#192; l&#8217;heure actuelle, il existe des quantit&#233;s de m&#233;thodes pour d&#233;finir les stades de d&#233;veloppement,
mais &#224; notre connaissance aucune fa&#231;on syst&#233;matique pour les &#233;valuer. Dans leur article, Bart-
ning &amp; Schlyter (2004) avaient d&#233;fini six stades de d&#233;veloppement. Le corpus CEFLE en utilise
cinq attribu&#233;s par un annotateur humain. Un probl&#232;me essentiel dans cette derni&#232;re &#233;tape est que
l&#8217;analyse montre une augmentation progressive des fr&#233;quences avec l&#8217;acquisition qui sugg&#232;re
plut&#244;t un d&#233;veloppement en continu que selon des stades discrets. D&#8217;une certaine mani&#232;re, il
faut donc accepter que n&#8217;importe quelle d&#233;finition soit en partie arbitraire.
</p>
<p>Dans notre syst&#232;me, l&#8217;analyse des fr&#233;quences des constructions grammaticales est obtenue auto-
matiquement et correspond &#224; la sortie de Direkt Profil. Elle forme le support qui permet d&#8217;&#233;tablir
</p>
<p>361</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas GRANFELDT, Pierre NUGUES
</p>
<p>les stades de d&#233;veloppement. Dans le paragraphe suivant, nous &#233;valuons la probabilit&#233; de l&#8217;exis-
tence de ces cinq stades diff&#233;rents en utilisant des techniques d&#8217;apprentissage automatique.
</p>
<p>6.1 Premi&#232;re exp&#233;rience : classification utilisant tous les attributs
</p>
<p>Comme conditions exp&#233;rimentales, nous avons employ&#233; chacun des textes des 85 &#233;tudiants
qui a re&#231;u manuellement un stade de d&#233;veloppement. Nous avons ensuite r&#233;utilis&#233; la m&#234;me
classification pour les trois ou quatre autres textes du m&#234;me &#233;tudiant dans le corpus, ce qui
donne comme r&#233;sultat 276 textes d&#8217;apprenant classifi&#233;s. Les 41 textes suppl&#233;mentaires viennent
du groupe de contr&#244;le des natifs, ce qui aboutit &#224; un total de 317 textes classifi&#233;s. La phase
d&#8217;apprentissage induit automatiquement des classifieurs &#224; partir des vecteurs de 142 attributs
que nous extrayons des textes au moyen de l&#8217;analyseur.
</p>
<p>Nous avons employ&#233; trois algorithmes d&#8217;apprentissage automatique : ID3/C4.5 (Quinlan, 1986),
les machines &#224; vecteurs de support (SVM) (Boser et al., 1992) et les arbres de mod&#232;les logis-
tiques (LMT) (Landwehr et al., 2003). Dans un premier temps, nous avons regroup&#233; les cinq
stades dans trois stades plus g&#233;n&#233;raux, o&#249; les stades 1 et 2 ainsi que les stades 3 et 4 ont &#233;t&#233;
fusionn&#233;s et nous avons entra&#238;n&#233; les algorithmes sur ces trois stades. Nous avons ensuite r&#233;a-
lis&#233; une deuxi&#232;me &#233;valuation avec les cinq stades d&#8217;origine. Nous avons r&#233;alis&#233; toutes nos ex-
p&#233;riences avec l&#8217;ensemble d&#8217;algorithmes d&#8217;apprentissage automatique disponible dans Weka1
(Witten &amp; Frank, 2005) et nous les avons &#233;valu&#233;s en appliquant 10 fois une validation crois&#233;e
sur le corpus d&#8217;apprentissage. Les tableaux 3 et 4 pr&#233;sentent les r&#233;sultats pour les 317 textes
pour 3 et 5 classes respectivement.
</p>
<p>C4.5 SVM LMT
Stades P R F P R F P R F
1&#8211;2 0,66 0,70 0,68 0,70 0,71 0,71 0,76 0,75 0,75
3&#8211;4 0,70 0,68 0,69 0,71 0,72 0,71 0,76 0,79 0,77
</p>
<p>Contr&#244;le 0,71 0,66 0,68 0,70 0,63 0,67 0,89 0,83 0,86
</p>
<p>TAB. 3 &#8211; R&#233;sultats de la classification des textes en trois stades pour les trois classifieurs.
Chaque classifieur a employ&#233; 142 attributs et a &#233;t&#233; entra&#238;n&#233; sur 317 textes du corpus CEFLE.
P : Pr&#233;cision. R : Rappel, F : Moyenne harmonique de la pr&#233;cision et du rappel.
</p>
<p>C4.5 SVM LMT
Stades P R F P R F P R F
</p>
<p>1 0,37 0,42 0,39 0,54 0,58 0,56 0,44 0,33 0,38
2 0,50 0,52 0,51 0,60 0,60 0,60 0,59 0,61 0,60
3 0,42 0,46 0,44 0,45 0,46 0,45 0,51 0,54 0,53
4 0,48 0,38 0,42 0,52 0,50 0,51 0,64 0,66 0,65
</p>
<p>Contr&#244;le 0,71 0,66 0,68 0,70 0,63 0,67 0,89 0,83 0,86
</p>
<p>TAB. 4 &#8211; R&#233;sultats de la classification des textes en cinq stades pour les trois classifieurs. Chaque
classifieur a employ&#233; 142 attributs et a &#233;t&#233; entra&#238;n&#233; sur 317 textes du corpus CEFLE.
</p>
<p>1Accessible &#224; partir de ce site : http ://www.cs.waikato.ac.nz/ml/weka/.
</p>
<p>362</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation des stades de d&#233;veloppement en fran&#231;ais langue &#233;trang&#232;re
</p>
<p>Ces r&#233;sultats peuvent &#234;tre compar&#233;s &#224; ceux que nous avons obtenus avec une version pr&#233;c&#233;dente
de Direkt Profil (1.5.4) employant un nombre plus petit de 33 attributs et un corpus d&#8217;entra&#238;-
nement moins important de 80 textes. Ces r&#233;sultats (Granfeldt et al., 2006) ont montr&#233; que
le meilleur classifieur, SVM, obtenait une moyenne harmonique de pr&#233;cision et de rappel de
pr&#232;s de 70% pour la classification en trois stades, et une moyenne de 43% de pr&#233;cision et 36%
de rappel pour une classification en cinq stades. Les r&#233;sultats actuels avec plus de 100 attri-
buts suppl&#233;mentaires et un corpus d&#8217;entra&#238;nement qui est quatre fois plus grand montrent une
am&#233;lioration de presque 10%. Le meilleur algorithme, cette fois LMT, obtient une moyenne de
pr&#233;cision et de rappel de 79% pour la classification en trois stades (Tableau 3). Pour la classifi-
cation en cinq stades, l&#8217;am&#233;lioration est encore plus importante (Tableau 4). LMT obtient 62%
de pr&#233;cision et 59% de rappel. En comparant la performance des deux meilleurs algorithmes,
SVM et LMT, nous observons que LMT est sup&#233;rieur &#224; SVM sur les stades interm&#233;diaire et
avanc&#233; &#8211; 3, 4, et le groupe de contr&#244;le des natifs &#8211; mais pas sur les deux premiers stades de
d&#233;veloppement. Nous n&#8217;avons aucune explication pour ce fait.
</p>
<p>En conclusion de cette premi&#232;re exp&#233;rience, nous pouvons affirmer que le plus grand nombre
d&#8217;attributs et le corpus d&#8217;entra&#238;nement plus important ont eu comme r&#233;sultat une meilleure
performance globale pour les trois classifieurs. Mais l&#8217;am&#233;lioration n&#8217;a pas &#233;t&#233; aussi grande
qu&#8217;esp&#233;r&#233;e. Une hypoth&#232;se possible est que nous avons introduit un certain nombre d&#8217;attributs
non pertinents parmi les quelques 100 nouveaux. Pour cette raison, nous avons appliqu&#233; une
proc&#233;dure de s&#233;lection afin d&#8217;identifier les meilleurs attributs. Les r&#233;sultats de cette deuxi&#232;me
exp&#233;rience sont pr&#233;sent&#233;s dans le paragraphe suivant.
</p>
<p>6.2 Deuxi&#232;me exp&#233;rience : classification utilisant une s&#233;lection d&#8217;attributs
</p>
<p>Pour &#233;valuer les 142 attributs, nous avons mesur&#233; le gain d&#8217;information (Quinlan, 1986) pour
chaque attribut par rapport &#224; la classe. Ce crit&#232;re est &#224; la base de l&#8217;algorithme ID3 et fait partie
de la bo&#238;te &#224; outils Weka. Nous avons employ&#233; la m&#233;thode de recherche de rang qui classe les
diff&#233;rents attributs en fonction de leur &#233;valuation. Les tableaux 5 et 6 pr&#233;sentent les r&#233;sultats
pour respectivement les 10 et 20 meilleurs attributs selon cette m&#233;thode. Dans un deuxi&#232;me
temps, nous avons r&#233;alis&#233; deux nouvelles classifications en utilisant les m&#234;mes algorithmes que
dans la premi&#232;re exp&#233;rience et le m&#234;me choix de 317 textes du corpus, mais cette fois avec un
nombre d&#8217;attributs r&#233;duit aux meilleurs d&#8217;entre eux.
</p>
<p>Lors de la premi&#232;re classification, nous avons &#233;valu&#233; la performance des classifieurs en utilisant
les 10 meilleurs attributs. Les r&#233;sultats produits sont mitig&#233;s (voir le tableau 7 pour la classi-
fication en cinq stades). En moyenne, la r&#233;duction radicale du nombre d&#8217;attributs de 142 &#224; 10
ne semble pas beaucoup affecter les r&#233;sultats. Les moyennes des pr&#233;cision et rappel pour LMT
sont respectivement de 66% et 58%. Ceci sugg&#232;re qu&#8217;il y a beaucoup de bruit dans les 132 attri-
buts restants. En revanche, les r&#233;sultats pour le premier stade de d&#233;veloppement se d&#233;t&#233;riorent
de fa&#231;on importante. L&#8217;algorithme SVM n&#8217;identifie plus un seul texte au stade 1. Ceci sugg&#232;re
que le reste des 132 attributs contient des informations tr&#232;s importantes pour identifier ce stade.
Dans notre deuxi&#232;me &#233;valuation, nous avons incorpor&#233; les 10 attributs suivants (attributs 11&#8211;20,
soit au total 20 attributs). Les r&#233;sultats pour la classification en cinq stades sont pr&#233;sent&#233;s dans
le tableau 8.
</p>
<p>Les r&#233;sultats globaux de cette deuxi&#232;me classification sont meilleurs et le vecteur de 20 attributs
permet &#224; chacun des trois classifieurs d&#8217;identifier des textes au stade 1. Cependant la moyenne
pour LMT est en l&#233;g&#232;re baisse par rapport &#224; la classification avec 10 attributs. On note &#233;galement
</p>
<p>363</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas GRANFELDT, Pierre NUGUES
</p>
<p>M&#233;rite Rang Attribut
0,405 1,4 Pourcentage de s&#233;quences d&#233;terminant-nom avec accord (nombre et genre)
0,354 2,2 Pourcentage de mots inconnus
0,33 3,2 Pourcentage de GNs avec accord en genre
0,313 3,9 Pourcentage de pr&#233;positions (sur toutes les parties de discours)
0,311 4,3 Longueur moyenne des phrases
0,208 6,2 Pourcentage de s&#233;quences nom-adjectif avec accord (nombre et genre)
0,198 7,4 Pourcentage d&#8217;accord sujet-verbe avec des verbes modaux + INF
0,187 8,3 Pourcentage d&#8217;accord sujet-verbe avec verbes au pass&#233; compos&#233;
0,177 9,3 Pourcentage d&#8217;accord sujet-verbe avec &#234;tre/avoir au 3e personne pluriel
0,176 9,8 Pourcentage d&#8217;accord sujet-verbe avec verbes modaux et sujets pronomi-
</p>
<p>naux
</p>
<p>TAB. 5 &#8211; Les 10 meilleurs attributs. Attributs 1&#8211;10.
</p>
<p>M&#233;rite Rang Attribut
0,168 11,4 Pourcentage de verbes au pr&#233;sent (sur tous les temps)
0,165 11,8 Pourcentage de verbes au pass&#233; compos&#233; (sur tous les temps)
0,15 14 Pourcentage d&#8217;accord sujet-verbe avec aux. de mode (sur tous les sujets)
0,142 15,7 Pourcentage d&#8217;accord sujet-verbe avec aux. de mode au sg.
0,14 16,2 Pourcentage d&#8217;accord sujet-verbe avec aux. de mode au pr&#233;sent et sujet pro-
</p>
<p>nominal 3e personne
0,136 16,7 Pourcentage verbes lexicaux conjugu&#233;s dans des contextes conjugu&#233;s
0,133 17,3 Pourcentage d&#8217;accord sujet-verbe avec verbes lexicaux conjugu&#233;s
0,131 18,1 Pourcentage d&#8217;accord sujet-verbe avec sujet pronominal sg et aux. de mode
0,125 19,3 Pourcentage d&#8217;accord sujet-verbe avec verbes lexicaux &#224; la 3e personne du
</p>
<p>pluriel
0,116 21,4 Pourcentage d&#8217;accord sujet-verbe avec sujet pronominal et &#234;tre/avoir
</p>
<p>TAB. 6 &#8211; Les 10 attributs suivants. Attributs 11&#8211;20.
</p>
<p>C4.5 SVM LMT
Stades P R F P R F P R F
</p>
<p>1 0,46 0,46 0,46 0,00 0,00 0,00 0,78 0,29 0,42
2 0,50 0,49 0,49 0,53 0,72 0,61 0,57 0,70 0,63
3 0,43 0,42 0,43 0,50 0,43 0,46 0,55 0,49 0,52
4 0,50 0,57 0,53 0,62 0,71 0,66 0,63 0,64 0,63
</p>
<p>Contr&#244;le 0,84 0,76 0,79 0,94 0,76 0,84 0,78 0,78 0,78
</p>
<p>TAB. 7 &#8211; R&#233;sultats de la classification des textes en cinq stades pour les trois classificateurs.
Chaque classificateur a employ&#233; les 10 meilleurs attributs &#233;valu&#233;s avec le crit&#232;re du gain d&#8217;in-
formation de Weka et a &#233;t&#233; entra&#238;n&#233; sur 317 textes du corpus.
</p>
<p>364</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation des stades de d&#233;veloppement en fran&#231;ais langue &#233;trang&#232;re
</p>
<p>C4.5 SVM LMT
Stades P R F P R F P R F
</p>
<p>1 0,56 0,38 0,45 0,60 0,38 0,46 0,53 0,38 0,44
2 0,51 0,53 0,52 0,61 0,62 0,62 0,61 0,61 0,61
3 0,49 0,47 0,48 0,54 0,57 0,56 0,56 0,59 0,57
4 0,45 0,55 0,50 0,61 0,69 0,65 0,61 0,62 0,62
</p>
<p>Contr&#244;le 0,78 0,68 0,73 0,83 0,73 0,78 0,86 0,88 0,87
</p>
<p>TAB. 8 &#8211; R&#233;sultats de la classification des textes en cinq stades pour les trois classificateurs.
Chaque classificateur a employ&#233; les 20 meilleurs attributs &#233;valu&#233;s avec le crit&#232;re du gain d&#8217;in-
formation de Weka et a &#233;t&#233; entra&#238;n&#233; sur 317 textes du corpus.
</p>
<p>une diff&#233;rence dans les chiffres de pr&#233;cision et de rappel pour le stade 1, cette fois-ci par rapport
&#224; la premi&#232;re exp&#233;rience utilisant les 142 attributs (voir les tableaux 3 et 4). Alors que ces
chiffres &#233;taient relativement proches, ils sont tr&#232;s diff&#233;rents dans les deux exp&#233;riences suivantes
avec un rappel consid&#233;rablement inf&#233;rieur &#224; la pr&#233;cision. Ceci signifie que la qualit&#233; du rappel
d&#233;pend d&#8217;un ensemble d&#8217;attributs beaucoup plus grand pour le stade de d&#233;veloppement le plus
bas que pour les autres stades. Puisque la pr&#233;cision et le rappel pour les stades plus avanc&#233;s
sont proches dans toutes exp&#233;riences men&#233;es, ceci pourrait signifier que le stade 1 est le plus
h&#233;t&#233;rog&#232;ne.
</p>
<p>7 Conclusion
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; et &#233;valu&#233; un syst&#232;me pour identifier des stades de d&#233;velop-
pement en fran&#231;ais langue &#233;trang&#232;re. Le syst&#232;me se compose d&#8217;un analyseur morphosyntaxique
et d&#8217;un module d&#8217;apprentissage automatique. Dans un premier temps, l&#8217;analyse morphosyn-
taxique nous permet de repr&#233;senter chaque texte par un vecteur de 142 attributs. Gr&#226;ce aux
second module, nous avons ensuite entra&#238;n&#233; trois classifieurs diff&#233;rents pour &#233;valuer l&#8217;hypo-
th&#232;se qu&#8217;on pouvait partitionner les textes du corpus en cinq stades de d&#233;veloppement. Cette
d&#233;marche a permis la classification automatique d&#8217;un ensemble de 317 textes du corpus CEFLE
selon le stade de d&#233;veloppement qu&#8217;ils refl&#233;taient.
</p>
<p>Les r&#233;sultats d&#8217;une premi&#232;re exp&#233;rience de classification employant un vecteur contenant l&#8217;en-
semble des 142 attributs ont montr&#233; une am&#233;lioration importante de plus de 10% compar&#233;s &#224;
nos r&#233;sultats pr&#233;c&#233;dents. Pour une classification simplifi&#233;e &#224; trois stades, la moyenne de pr&#233;ci-
sion et de rappel pour le syst&#232;me est maintenant de 79%. Dans le but d&#8217;identifier les meilleurs
attributs pour la classification, nous avons introduit un crit&#232;re de s&#233;lection fond&#233;e sur le gain
d&#8217;information. &#192; notre surprise, les r&#233;sultats ont montr&#233; que la performance globale n&#8217;&#233;tait pas
affect&#233;e de fa&#231;on sensible par la r&#233;duction radicale du nombre d&#8217;attributs (de 142 &#224; 10 et 20 res-
pectivement). Cependant les r&#233;sultats pour le stade de d&#233;veloppement le plus bas sont d&#233;grad&#233;s
de fa&#231;on tr&#232;s importante. Une interpr&#233;tation possible est que les textes du stade 1 sont tellement
h&#233;t&#233;rog&#232;nes qu&#8217;on doive remettre en cause l&#8217;unicit&#233; de ce niveau et qu&#8217;il serait pr&#233;f&#233;rable de le
diviser en plusieurs sous-classes.
</p>
<p>365</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas GRANFELDT, Pierre NUGUES
</p>
<p>Remerciements
</p>
<p>La recherche pr&#233;sent&#233;e dans cet article b&#233;n&#233;ficie d&#8217;un financement du Conseil su&#233;dois pour
la science, contrat num&#233;ro 2004-1674, et de bourses de la fondation Elisabeth Rausing pour la
recherche dans les sciences humaines et de la fondation Erik Philip-S&#246;renssen pour la recherche.
</p>
<p>R&#233;f&#233;rences
&#197;GREN M. (2005). Le marquage morphologique du nombre dans la phrase nominale. Une
&#233;tude sur l&#8217;acquisition du fran&#231;ais L2 &#233;crit. Rapport interne, Institut d&#8217;&#233;tudes romanes de
Lund. Universit&#233; de Lund.
BARTNING I. &amp; SCHLYTER S. (2004). Stades et itin&#233;raires acquisitionnels des apprenants
su&#233;dophones en fran&#231;ais L2. Journal of French Language Studies, 14(3), 281&#8211;299.
BOSER B., GUYON I. &amp; VAPNIK V. (1992). A training algorithm for optimal margin clas-
sifiers. In Proceedings of the Fifth Annual Workshop on Computational Learning Theory, p.
144&#8211;152, Pittsburgh : ACM.
GRANFELDT J., NUGUES P., PERSSON E., PERSSON L., KOSTADINOV F., &#197;GREN M. &amp;
SCHLYTER S. (2005). Direkt Profil : un syst&#232;me d&#8217;&#233;valuation de textes d&#8217;&#233;l&#232;ves de fran&#231;ais
langue &#233;trang&#232;re fond&#233; sur les itin&#233;raires d&#8217;acquisition. In Actes de la conf&#233;rence Traitement
Automatique des Langues Naturelles, TALN &amp; RECITAL 2005, volume Tome 1 &#8211; Conf&#233;rences
principales, p. 113&#8211;122, Dourdan, France.
GRANFELDT J., NUGUES P., &#197;GREN M., THULIN J., PERSSON E. &amp; SCHLYTER S. (2006).
CEFLE and Direkt Profil : A new computer learner corpus in French L2 and a system for gram-
matical profiling. In Proceedings of the 5th International Conference on Language Ressources
and Evaluation, p. 565&#8211;570, Genoa, Italy.
LANDWEHR N., HALL M. &amp; FRANK E. (2003). Logistic model trees. In N. LAVRAC,
D. GAMBERGER, L. TODOROVSKI &amp; H. BLOCKEEL, Eds., Proceedings of the 14th Euro-
pean Conference on Machine Learning (ECML), volume 2837 of Lecture Notes in Computer
Science, p. 241&#8211;252. Springer.
MACWHINNEY B. (2000). The CHILDES project : Tools for analyzing talk. Mahwah, New
Jersey : Lawrence Erlbaum.
QUINLAN J. R. (1986). Induction of decision trees. Machine Learning, 1(1), 81&#8211;106.
SAGAE K., LAVIE A. &amp; MACWHINNEY B. (2005). Automatic measurement of syntactic
development in child language. In Proceedings of the 43rd Annual Meeting of the Association
for Computational Linguistics 2005, p. 197&#8211;2004, Ann Arbor, USA.
WITTEN I. H. &amp; FRANK E. (2005). Data Mining. Practical Machine Learning Tools and
Techniques. Amsterdam : Elsevier.
</p>
<p>366</p>

</div></div>
</body></html>