<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une m&#233;thodologie g&#233;n&#233;rique de contr&#244;le bas&#233;e sur la combinaison de sources de jugement</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Vers une m&#233;thodologie g&#233;n&#233;rique de contr&#244;le bas&#233;e
sur la combinaison de sources de jugement
</p>
<p>Gr&#233;gory SMITS1, Christine CHARDENON2
1 GREYC&#8211;Universit&#233; de Caen, F-14032 CAEN cedex
</p>
<p>2 France T&#233;l&#233;com R&amp;D TECH/EASY/LN,
2, avenue Pierre Marzin, 22307 Lannion Cedex
</p>
<p>gsmits@info.unicaen.fr
christine.chardenon@orange-ftgroup.com
</p>
<p>R&#233;sum&#233;. Le contr&#244;le des hypoth&#232;ses concurrentes g&#233;n&#233;r&#233;es par les diff&#233;rents modules qui
peuvent intervenir dans des processus de TALN reste un enjeu important malgr&#233; de nombreuses
avanc&#233;es en terme de robustesse. Nous pr&#233;sentons dans cet article une m&#233;thodologie g&#233;n&#233;rique
de contr&#244;le exploitant des techniques issues de l&#8217;aide multicrit&#232;re &#224; la d&#233;cision. &#192; partir de l&#8217;en-
semble des crit&#232;res de comparaison disponibles et la formalisation des pr&#233;f&#233;rences d&#8217;un expert,
l&#8217;approche propos&#233;e &#233;value la pertinence relative des diff&#233;rents objets linguistiques g&#233;n&#233;r&#233;s et
conduit &#224; la mise en place d&#8217;une action de contr&#244;le appropri&#233;e telle que le filtrage, le classement,
le tri ou la propagation.
</p>
<p>Abstract. The control of concurrent hypotheses generated by the different modules which
compose NLP processes is still an important issue despite advances concerning robustness. In
this article, we present a generic methodology of control inspired frommulticriteria decision aid
methods. Based on available comparison criteria and formalized expert knowledge, the propo-
sed approach evaluate the relevancy of each generated linguistic object and lead to the decision
of an appropriate control action such as filtering, ordering, sorting or propagating.
</p>
<p>Mots-cl&#233;s : m&#233;thodologie de contr&#244;le, aide multicrit&#232;re &#224; la d&#233;cision, apprentissage au-
tomatique de m&#233;triques.
</p>
<p>Keywords: control methodology, multicriteria decision aid, metrics automatic learning.
</p>
<p>1 Introduction
</p>
<p>De nombreuses avanc&#233;es en termes de formalisme, d&#8217;algorithmique et de d&#233;veloppement de res-
sources ont permis aux syst&#232;mes de traitement automatique des langues naturelles (TALN) d&#8217;at-
teindre une couverture tr&#232;s satisfaisante des diff&#233;rents ph&#233;nom&#232;nes linguistiques observables.
Cependant, quelle que soit la t&#226;che ou le niveau d&#8217;analyse concern&#233;, les diff&#233;rentes approches
envisag&#233;es sont de mani&#232;re r&#233;currente confront&#233;es au manque de pr&#233;cision des r&#233;sultats g&#233;n&#233;r&#233;s.
Ce ph&#233;nom&#232;ne se mat&#233;rialise par la pr&#233;sence d&#8217;objets linguistiques concurrents de diff&#233;rentes
natures. Bien que justifiable en pr&#233;sence d&#8217;ambigu&#239;t&#233;s locales &#8220;naturelles&#8221;, ces ind&#233;terminations
concernent la plupart du temps des erreurs d&#8217;interpr&#233;tations souvent qualifi&#233;es d&#8217;ambigu&#239;t&#233;s &#8220;ar-
</p>
<p>273</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gr&#233;gory SMITS, Christine CHARDENON
</p>
<p>tificielles&#8221;. Le contr&#244;le du processus d&#8217;analyse a pour objectif d&#8217;identifier le plus t&#244;t possible
ces ambigu&#239;t&#233;s &#8220;artificielles&#8221; afin notamment d&#8217;&#233;viter leur propagation vers les &#233;tapes suivantes
de l&#8217;analyse.
</p>
<p>Bien que des propositions d&#8217;architectures de TALN conformes vis &#224; vis des mod&#232;les cogni-
tifs aient &#233;t&#233; propos&#233;es afin d&#8217;&#233;viter la g&#233;n&#233;ration d&#8217;objets linguistiques erronn&#233;s (Rady, 1983)
(Sabah, 1990), la mise en place de strat&#233;gies sp&#233;cifiques de contr&#244;le semble indispensable.
</p>
<p>Nous verrons dans un premier temps que le contr&#244;le des ind&#233;terminations, appel&#233;s &#8220;points
d&#8217;embarras&#8221;1 par (Sabah, 1989) repose sur la prise en compte d&#8217;informations distinctives h&#233;t&#233;-
rog&#232;nes. En s&#8217;appuyant sur un exemple de cha&#238;ne de TALN et un cas concret d&#8217;ind&#233;termination,
nous verrons dans un second temps que le contr&#244;le peut &#234;tre consid&#233;r&#233; comme une d&#233;marche
d&#233;cisionnelle bas&#233;e sur plusieurs crit&#232;res de comparaison. Nous avons ainsi d&#233;velopp&#233; une m&#233;-
thode compl&#232;te et g&#233;n&#233;rique inspir&#233;e des approches d&#8217;aide multicrit&#232;re &#224; la d&#233;cision. Avant de
pr&#233;senter les premiers r&#233;sultats obtenus, nous verrons que la prise d&#8217;une d&#233;cision repose sur la
formalisation des connaissances d&#8217;un expert sur la t&#226;che &#224; contr&#244;ler.
</p>
<p>2 D&#233;finition de la notion de contr&#244;le
</p>
<p>2.1 Le TALN comme une succession de &#8220;points d&#8217;embarras&#8221; potentiels
</p>
<p>De nombreux syst&#232;mes de TALN peuvent &#234;tre repr&#233;sent&#233;s comme un ensemble de modules
d&#8217;analyse qui appliqu&#233;s successivement composent le processus complet d&#8217;interpr&#233;tation lin-
guistique. L&#8217;objectif de chacun de ces composants est de construire ses propres interpr&#233;tations
&#224; partir de ressources linguistiques et des informations g&#233;n&#233;r&#233;es par les &#233;tapes pr&#233;c&#233;dentes. Ces
interpr&#233;tations que nous nommerons par la suite objets linguistiques peuvent correspondre &#224; :
&#8211; des unit&#233;s lexicales ou de sens ;
&#8211; &#224; un d&#233;coupage en constituants suite &#224; une analyse syntaxique de surface ;
&#8211; &#224; un arbre de d&#233;pendance syntaxique suite &#224; l&#8217;application d&#8217;une grammaire de d&#233;pendances ;
&#8211; &#224; des graphes s&#233;mantiques ;
&#8211; &#224; des suggestions de corrections orthographiques ;
&#8211; &#224; des rubriques s&#233;mantiques d&#8217;indexation correspondant &#224; une requ&#234;te.
Fr&#233;quemment appliqu&#233;s s&#233;quentiellement, ces modules sont sources de &#8220;points d&#8217;embarras&#8221;
et affectent donc la complexit&#233; et l&#8217;efficacit&#233; du processus d&#8217;analyse et nuisent &#233;galement &#224;
l&#8217;utilisabilit&#233; des r&#233;sultats g&#233;n&#233;r&#233;s. Il devient alors indispensable de contr&#244;ler l&#8217;apparition de ces
ind&#233;terminations, notamment en comparant la pertinence relative de chaque objet linguistique
instanci&#233; et en mettant en place une action de contr&#244;le appropri&#233;e pour &#233;viter la propagation
d&#8217;interpr&#233;tations erronn&#233;es.
</p>
<p>2.2 Des &#8220;points d&#8217;embarras&#8221; aux &#8220;points de d&#233;cision&#8221;
</p>
<p>En conservant la terminologie propos&#233;e par (Sabah, 1989), l&#8217;enjeu du contr&#244;le de ces proces-
sus r&#233;side dans la transformation des &#8220;points d&#8217;embarras&#8221; en &#8220;points de d&#233;cision&#8221;. Ce dernier
d&#233;signe un &#233;tat du processus de traitement o&#249; plusieurs objets linguistiques concurrents ont &#233;t&#233;
g&#233;n&#233;r&#233;s, mais qui est &#233;galement caract&#233;ris&#233; par la disponibilit&#233; de connaissances et de crit&#232;res de
</p>
<p>1L&#8217;IA et le langage tome 2 page 121
</p>
<p>274</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodologie g&#233;n&#233;rique de contr&#244;le d&#8217;une cha&#238;ne de TALN
</p>
<p>comparaisons &#224; partir desquels une strat&#233;gie de contr&#244;le peut &#234;tre d&#233;ploy&#233;e. Ainsi, pour pallier
le manque d&#8217;informations distinctives n&#233;cessaires &#224; la comparaison des diff&#233;rents objets lin-
guistiques, de nombreux travaux ont propos&#233; d&#8217;int&#233;grer des connaissances suppl&#233;mentaires de
diff&#233;rentes natures (probabiliste (Blache &amp; Rauzy, 2006), statistiques (Charniak &amp; M.Johnson,
2005), heuristique (Uszkoreit, 1991), symbolique (Bourigault &amp; Fr&#233;rot, 2004)) pour qualifier la
pertinence de chaque candidat et permettre la mise en place d&#8217;une action de contr&#244;le.
</p>
<p>On constate &#233;galement que pour un &#8220;point d&#8217;embarras&#8221; identifi&#233;, plusieurs sources ind&#233;pen-
dantes de connaissances peuvent &#234;tre exploit&#233;es pour affecter &#224; chacun des objets linguistiques
un crit&#232;re de comparaison. Il appara&#238;t cependant que pour chaque contexte de contr&#244;le, aucune
connaissance ne permet individuellement de caract&#233;riser et d&#8217;&#233;valuer pleinement la validit&#233; de
chaque interpr&#233;tation envisag&#233;e.
</p>
<p>L&#8217;ind&#233;terminisme li&#233; &#224; l&#8217;attachement d&#8217;un groupe pr&#233;positionnel constitue un exemple tr&#232;s illus-
tratif . En effet, l&#8217;application d&#8217;une grammaire donn&#233;e sur une phrase &#8220;jouet&#8221; comme : &#8220;Je pos-
s&#232;de la statue de bois de rose de Charles&#8221;, entra&#238;nerait sans doute la construction d&#8217;au moins
5 arbres syntaxiques concurrents. Afin de d&#233;terminer leur pertinence, chaque attachement peut
&#234;tre jug&#233; par rapport :
&#8211; &#224; sa conformit&#233; vis &#224; vis des informations prosodiques (rarement disponibles) ;
&#8211; &#224; son respect des heuristiques d&#8217;attachement droit ou minimal ;
&#8211; &#224; des donn&#233;es de sous-cat&#233;gorisations syntaxiques (Bourigault &amp; Fr&#233;rot, 2004) ;
&#8211; &#224; sa fr&#233;quence d&#8217;apparition observ&#233;e sur corpus (Gala, 2003) ;
&#8211; &#224; des pr&#233;f&#233;rences d&#8217;usages li&#233;es &#224; la s&#233;mantique des propositions (Whittemore et al., 1990) ;
&#8211; etc.
Chacune des sources de jugement cit&#233;es pr&#233;c&#233;demment apporte ainsi une information discrimi-
nante permettant d&#8217;identifier pour certains cas &#8220;ambigu&#239;t&#233;s&#8221; d&#8217;attachement envisageables les er-
reurs d&#8217;interpr&#233;tation &#224; filtrer, ou r&#233;ciproquement les attachements &#224; privil&#233;gier, mais &#233;galement
une erreur d&#8217;appr&#233;ciation pour les autres cas. Afin d&#8217;augmenter la robustesse et la cr&#233;dibilit&#233;
apport&#233;e &#224; l&#8217;&#233;valuation de la pertinence de chaque objet linguistique, il semble indispensable de
combiner et d&#8217;exploiter diff&#233;rents points de vue de jugement. Bien que des arguments psycho-
lolinguistiques (Altmann, 1998) (Gibson &amp; Pearlmutter, 1998) aient d&#233;j&#224; &#233;t&#233; avanc&#233;s en faveur
de l&#8217;usage combin&#233;e de sources de connaissances, peu de strat&#233;gies de contr&#244;le exploitent la
compl&#233;mentarit&#233; de diff&#233;rents crit&#232;res de comparaison (Rosso et al., 2003) (Rigau et al., 1997).
Nos travaux se sont donc focalis&#233;s sur la mise en place d&#8217;un formalisme et d&#8217;une m&#233;thodologie
g&#233;n&#233;rique de contr&#244;le exploitant l&#8217;information apport&#233;e par chaque source de jugement pour
comparer la pertinence d&#8217;objets linguistiques concurrents.
</p>
<p>2.3 Le cas de TiLT
</p>
<p>TiLT est une bo&#238;te &#224; outils de TALN d&#233;velopp&#233;e par l&#8217;&#233;quipe Langues Naturelles de
France T&#233;l&#233;com R&amp;D. Le processus d&#8217;analyse param&#233;trable est compos&#233; d&#8217;un ensemble
de modules de traitements qui, appliqu&#233;s s&#233;quentiellement, construisent de mani&#232;re it&#233;rative des
interpr&#233;tations linguistiques de diff&#233;rentes natures. En fonction des caract&#233;ristiques du contexte
applicatif, certaines &#233;tapes de traitement constituent des &#8220;points d&#8217;embarras&#8221;. Pour &#233;viter la
propagation d&#8217;objets linguistiques erron&#233;s, diff&#233;rents traits, scores ou probabilit&#233;s calcul&#233;s, m&#233;-
thodes sp&#233;cifiques de jugement ont &#233;t&#233; int&#233;gr&#233;s au processus classique d&#8217;analyse pour &#234;tre ex-
ploit&#233;s comme crit&#232;res de comparaison. Cependant aucune strat&#233;gie sp&#233;cifique de contr&#244;le ne
permettait de les combiner ou d&#8217;&#233;valuer leur efficacit&#233;. L&#8217;architecture modulaire d&#8217;analyse de
</p>
<p>275</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gr&#233;gory SMITS, Christine CHARDENON
</p>
<p>TiLT a &#233;t&#233; dans un premier temps modifi&#233;e (Smits, 2006) afin de simplifier l&#8217;int&#233;gration de ces
crit&#232;res de comparaison, de les centraliser et de permettre la mise en place de phases de contr&#244;le
entre les &#233;tapes d&#8217;analyse.
</p>
<p>3 Formalisation d&#8217;une m&#233;thode d&#8217;aide multicrit&#232;re &#224; la d&#233;ci-
sion
</p>
<p>3.1 Agr&#233;gation des crit&#232;res et interpr&#233;tation des comparaisons
</p>
<p>L&#8217;architecture d&#233;cisionnelle de TiLT centralise en tant que crit&#232;res de comparaison les connais-
sances suppl&#233;mentaires int&#233;gr&#233;es lors du contr&#244;le d&#8217;un &#8220;point d&#8217;embarras&#8221;. En plus du cadre
formel, l&#8217;approche de contr&#244;le propose une m&#233;thode compl&#232;te permettant &#224; un expert, le lin-
guiste ou l&#8217;informaticien en charge du param&#233;trage de TiLT, d&#8217;exprimer ses connaissances et
intuitions sur la t&#226;che de contr&#244;le en question et la fa&#231;on dont les crit&#232;res disponibles doivent
&#234;tre exploit&#233;s. Nous nous rapprochons ainsi du domaine de l&#8217;aide multicrit&#232;re &#224; la d&#233;cision qui
&#8220;vise, comme son nom l&#8217;indique, &#224; fournir &#224; un d&#233;cideur des outils lui permettant de progresser
dans la r&#233;solution d&#8217;un probl&#232;me de d&#233;cision o&#249; plusieurs points de vue, souvent contradictoires,
doivent &#234;tre pris en compte.&#8221; (Vincke, 1998).
</p>
<p>La m&#233;thode envisag&#233;e (Smits, 2007) s&#8217;inspire profond&#233;ment des m&#233;thodes de surclassement (en
particulier ELECTRE III et ELECTRE TRI (Roy, 1990)). &#192; partir des valeurs des crit&#232;res de
comparaison qui qualifient les objets compar&#233;s et des connaissances exprim&#233;es par le d&#233;cideur,
ces m&#233;thodes &#233;tablissent entre les diff&#233;rentes hypoth&#232;ses candidates des relations de surclasse-
ment. Une telle relation not&#233;e oSo&#8242; est &#233;tablie entre deux objets linguistiques o et o&#8242; si &#8220;il y a
suffisamment d&#8217;arguments pour admettre que o est au moins aussi bonne que o&#8242;, sans qu&#8217;il y ait
de raison importante de refuser cette affirmation.&#8221; Ces relations &#8220;abstraites&#8221; de surclassements
permettent d&#8217;&#233;tablir des relations de pr&#233;f&#233;rence, d&#8217;indiff&#233;rence (utile pour la factorisation) ou
d&#8217;incomparabilit&#233; (exploit&#233;es pour le filtrage).
</p>
<p>Pour r&#233;pondre &#224; une probl&#233;matique de classement, on exploiter l&#8217;ensemble des relations de
surclassement &#233;tablies entre les diff&#233;rents objets linguistiques pour &#233;tablir un pr&#233;-ordre partiel
(avec ex aequo) ou total (Fig. 1). Quant aux probl&#233;matiques de tri et filtrage, les diff&#233;rents
objets linguistiques concurrents ne sont plus compar&#233;s entre eux, mais par rapport &#224; des profils
d&#8217;acceptabilit&#233; qui d&#233;finissent, pour chaque classe consid&#233;r&#233;e, les performances &#224; atteindre sur
chacun des crit&#232;res pour faire partie de la classe en question (cf. cas d&#8217;exp&#233;rimentation Fig. 2).
</p>
<p>3.2 Formalisation du probl&#232;me et construction des relations
</p>
<p>Soit O : o1, o2, ..., on l&#8217;ensemble des objets linguistiques compar&#233;s et G : g1, g2, ..., gm les m
crit&#232;res utilis&#233;s lors du contr&#244;le, o&#249; gj(oi) correspond &#224; la valeur obtenue par l&#8217;objet oi pour le
jeme crit&#232;re.
</p>
<p>Les pr&#233;f&#233;rences et connaissances du d&#233;cideur se mat&#233;rialisent dans un premier temps &#224; travers
les crit&#232;res choisis pour la t&#226;che de contr&#244;le, mais &#233;galement par un ensemble de param&#232;tres qui
peuvent &#234;tre associ&#233;s &#224; chaque crit&#232;re gj :
&#8211; un poids d&#8217;importance wj ;
</p>
<p>276</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodologie g&#233;n&#233;rique de contr&#244;le d&#8217;une cha&#238;ne de TALN
</p>
<p>&#8211; un seuil de pr&#233;f&#233;rence pj ;
il correspond &#224; la plus petite diff&#233;rence de valeur &#224; partir de laquelle une situation de pr&#233;f&#233;-
rence peut &#234;tre &#233;tablie entre deux objets.
</p>
<p>&#8211; un seuil d&#8217;indiff&#233;rence qj (qj &lt;= pj) ;
correspond &#224; la plus grande diff&#233;rence pr&#233;servant l&#8217;indiff&#233;rence entre 2 objets sur le crit&#232;re j.
</p>
<p>&#8211; un seuil de veto vj (pj &lt;= vj).
correspond &#224; la diff&#233;rence de valeur &#224; partir de laquelle un objet devient incomparable vis &#224;
vis d&#8217;un autre, car jug&#233; trop faible sur un crit&#232;re important. Ce param&#232;tre permet notamment
de d&#233;finir des conditions de filtrage.
</p>
<p>Ces pr&#233;f&#233;rences expertes interviennent dans le calcul d&#8217;un indice de surclassement S(o, o&#8242;),
quantifiant la cr&#233;dibilit&#233; du surclassement de o&#8242; par l&#8217;objet o, o&#249; o&#8242; peut correspondre &#224; un objet
concurrent de o ou &#224; un profil d&#8217;acceptabilit&#233; d&#8217;une classe pour les probl&#233;matiques de tri. Cet in-
dice de surclassement S(o, o&#8242;) repose sur le produit d&#8217;un indice de concordance C(o, o&#8242;), repr&#233;-
sentant la majorit&#233; des crit&#232;res en faveur de o, et d&#8217;un indice de discordance D(o, o&#8242;), repr&#233;sen-
tant la minorit&#233; des crit&#232;res refusant le surclassement de o&#8242; par o : S(o, o&#8242;) = C(o, o&#8242;) . D(o, o&#8242;)
, o&#249; C(o, o&#8242;) = 1P
</p>
<p>j&#8712;G wj
</p>
<p>&#8721;
j&#8712;Gwjcj(o, o&#8242;)
</p>
<p>cj(o, o&#8242;) =
</p>
<p>&#63729;&#63732;&#63730;&#63732;&#63731;
1, si gj(o)&#8722; gj(o&#8242;) &gt;= pj
0, si gj(o)&#8722; gj(o&#8242;) &lt;= qj
pj&#8722;gj(o)&#8722;gj(o&#8242;)
</p>
<p>pj&#8722;qj , si qj &lt; gj(o)&#8722; gj(o&#8242;) &lt; pj
</p>
<p>, et D(o, o&#8242;) =&#8719;j&#8712;G 1&#8722;dj(o,o&#8242;)1&#8722;C(o,o&#8242;) , G = j &#8712; G/dj(o, o&#8242;) &gt; C(o, o&#8242;)
</p>
<p>dj(o, o&#8242;) =
</p>
<p>&#63729;&#63732;&#63730;&#63732;&#63731;
1, si gj(o&#8242;)&#8722; gj(o) &gt;= vj
0, si gj(o&#8242;)&#8722; gj(o) &lt;= pj
gj(o&#8242;)&#8722;gj(o)&#8722;pj
</p>
<p>vj&#8722;pj , si pj &lt; gj(o&#8242;)&#8722; gj(o) &lt; vj
</p>
<p>L&#8217;interpr&#233;tation des relations de surclassement permet de d&#233;finir des situations de pr&#233;f&#233;rence
stricte : oPo&#8242; si S(o, o&#8242;) &#8743; &#172;S(o&#8242;, o), d&#8217;indiff&#233;rence : oIo&#8242; si S(o, o&#8242;) &#8743; S(o&#8242;, o) ou d&#8217;incompa-
rabilit&#233; : oRo&#8242; si &#172;S(o, o&#8242;) &#8743; &#172;S(o&#8242;, o). Les relations &#233;tablies, regroup&#233;es dans une structure de
pr&#233;f&#233;rences (Fig. 1), sont exploit&#233;es pour &#233;tablir un pr&#233;-ordre complet ou partiel (avec ex aequo)
des objets compar&#233;s.
</p>
<p>o3
</p>
<p>o4
</p>
<p>o1
</p>
<p>o2
</p>
<p>o7
</p>
<p>o6 on
</p>
<p>O'
</p>
<p>O''
</p>
<p>O'''
O'PO'' O''PO'''o3Io4
</p>
<p>o1Io2
</p>
<p>o2Io7
</p>
<p>o8
</p>
<p>o6Ro8
</p>
<p>FIG. 1 &#8211; Repr&#233;sentation agr&#233;g&#233;e des relations de pr&#233;f&#233;rences &#233;tablies entre les hypoth&#232;ses
</p>
<p>277</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gr&#233;gory SMITS, Christine CHARDENON
</p>
<p>3.3 Vers une &#233;licitation des pr&#233;f&#233;rences et connaissances de l&#8217;expert
</p>
<p>La pertinence des relations de comparaison &#233;tablies entre les objets concurrents d&#233;pend &#224; la
fois de l&#8217;information distinctive port&#233;e par les crit&#232;res qui les qualifient, mais &#233;galement des
pr&#233;f&#233;rences du d&#233;cideur. Il est cependant difficile et peu naturel pour un d&#233;cideur de d&#233;ter-
miner clairement et par l&#8217;interm&#233;diaire de valeurs num&#233;riques, les valeurs de ces diff&#233;rents
param&#232;tres d&#233;cisionnels. M&#234;me si l&#8217;externalisation de l&#8217;ensemble de ces informations dans un
module sp&#233;cifique de contr&#244;le facilite les exp&#233;rimentations it&#233;ratives, l&#8217;impact de chaque pa-
ram&#232;tre sur le r&#233;sultat final est difficilement quantifiable a priori. Il est en revanche nettement
plus &#233;vident pour un expert de se prononcer sur la pertinence des objets linguistiques g&#233;n&#233;-
r&#233;s. Cette d&#233;marche de validation des r&#233;sultats g&#233;n&#233;r&#233;s par un expert est fortement exploit&#233;e
pour la construction de corpus de r&#233;f&#233;rences, servant ensuite de donn&#233;es pour l&#8217;apprentissage
de ressources ou l&#8217;&#233;valuation de syst&#232;mes.
</p>
<p>Nous proposons de consid&#233;rer l&#8217;identification des objets linguistiques de r&#233;f&#233;rence comme l&#8217;ex-
pression de l&#8217;expertise de l&#8217;annoteur sur une t&#226;che de contr&#244;le &#224; automatiser. Ainsi, qualifier une
hypoth&#232;se comme valide revient &#224; qualifier les performances qu&#8217;elle a obtenu sur les crit&#232;res
exploit&#233;es comme discriminants. Une hypoth&#232;se annot&#233;e comme correcte ou incorrect et les
performances calcul&#233;es sur les crit&#232;res concern&#233;s par l&#8217;&#233;tape de contr&#244;le constituent un enregis-
trement de ce que nous nommons un tableau de performances : Nous exploitons ce tableau de
</p>
<p>Objets annot&#233;s. vecteur de performances annotation
crit&#232;re 1 crit&#232;re 2 ... crit&#232;rem
</p>
<p>o1 4.2 Vrai ... 36 correct
o2 5.0 Vrai ... 16 correct
o3 2.6 Faux ... 24 incorrect
o4 1.2 Faux ... 42 correct
... ... ... ... ... ...
op&#8722;1 4.0 Vrai ... 4 incorrect
op 0 Faux ... 17 incorrect
</p>
<p>TAB. 1 &#8211; Tableau de performances construit &#224; partir du corpus de r&#233;f&#233;rences
</p>
<p>performances pour &#233;valuer et quantifier la pertinence de chacun des crit&#232;res disponibles. Une
distribution de performances d&#8217;un crit&#232;re est jug&#233;e pertinente, si elle permet de caract&#233;riser un
certain type d&#8217;annotation (i.e. la classe des hypoth&#232;ses correctes ou la classes des hypoth&#232;ses
incorrectes). La m&#233;thode d&#8217;apprentissage de m&#233;triques RELIEF (Kononenko, 1994) permet
d&#8217;atteindre ce but, en associant &#224; chaque crit&#232;re un poids norm&#233; sur [&#8722;1, 1], o&#249; une valeur n&#233;ga-
tive caract&#233;rise un crit&#232;re non repr&#233;sentatif de la classe des hypoth&#232;ses correctes. Les r&#233;sultats
de la m&#233;thode sont ensuite exploiter lors de la construction de l&#8217;indice de cr&#233;dibilit&#233; en tant que
vecteur de poids des crit&#232;res.
</p>
<p>Nous proposons &#233;galement de consid&#233;rer la performance minimale obtenue sur un crit&#232;re par
les hypoth&#232;ses annot&#233;es comme correctes en tant que limite d&#8217;acceptabilit&#233; de ce crit&#232;re.
</p>
<p>278</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodologie g&#233;n&#233;rique de contr&#244;le d&#8217;une cha&#238;ne de TALN
</p>
<p>4 Exp&#233;rimentation
</p>
<p>Nous pr&#233;sentons dans cette section les premiers r&#233;sultats obtenus sur un des nombreux cas de
contr&#244;le envisageables. Il s&#8217;agit de r&#233;pondre &#224; une probl&#233;matique de classement des couples
ant&#233;c&#233;dent/reprise-anaphorique candidats extraits d&#8217;un corpus.
</p>
<p>4.1 Contr&#244;le des couples ant&#233;c&#233;dent/reprise-anaphorique candidats
</p>
<p>Cette exp&#233;rimentation s&#8217;inscrit dans le cadre d&#8217;une collaboration et d&#8217;une extension des travaux
r&#233;alis&#233;s par OLIVIER TARDIF (Tardif, 2006). Un algorithme extrait &#224; partir d&#8217;un texte un
ensemble de couples d&#8217;expressions constituant potentiellement des patrons ant&#233;c&#233;dent/reprise-
anaphorique. Une expression correspond &#224; une entit&#233; nomm&#233;e (NPR : Micka&#235;l Gordbatchev,
l&#8217;URSS, Vilnius), un pronom (PRON : il, celui-l&#224;) ou un groupe nominal (NCOM : le dirigeant
sovi&#233;tique, le parlement). L&#8217;enjeu du contr&#244;le est de construire une classes des candidats valides
&#224; partir des performances qui leurs sont associ&#233;es sur diff&#233;rents crit&#232;res, tels que :
&#8211; des mesures de distances (en mots, phrases, etc.) ;
&#8211; la correspondance des classes s&#233;mantiques et des fonctions syntaxiques ;
&#8211; des marques morphologiques (ind&#233;fini, possessif) ;
&#8211; des mesures de distance et de similarit&#233; alphab&#233;tiques ;
&#8211; des propri&#233;t&#233;s d&#8217;accords de genre et de nombre.
Pour constituer la classe des reprises anaphoriques valides, les relations de surclassement ne
sont pas construites entre les couples candidats, mais entre chaque candidat et un profil d&#8217;ac-
ceptabilit&#233; (Fig. 2). Ce vecteur de limites d&#8217;acceptabilit&#233; constitue une nouvelle pr&#233;f&#233;rence mise
en place par l&#8217;expert pour contr&#244;ler la validit&#233; des hypoth&#232;ses compar&#233;es. Ainsi, un candidat qui
surclasse ce profil est consid&#233;r&#233; comme un cas de reprise anaphorique.
</p>
<p>crit&#232;re 1
</p>
<p>crit&#232;re 2
</p>
<p>crit&#232;re 3
</p>
<p>crit&#232;re k-1
</p>
<p>crit&#232;re k
</p>
<p>Q P
</p>
<p>profil d&#8217;acceptabilit&#233;
des couples valides
</p>
<p>classe des anaphores valid&#233;sclasse des anaphores
 non valid&#233;es
</p>
<p>: seuils d&#8217;indiff&#233;renceQ
P : seuils de pr&#233;f&#233;rence
</p>
<p>L
</p>
<p>L : limites d&#8217;acceptabilit&#233;
</p>
<p>FIG. 2 &#8211; Profil d&#8217;acceptabilit&#233; des reprises anaphoriques candidates
</p>
<p>279</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gr&#233;gory SMITS, Christine CHARDENON
</p>
<p>4.2 Entre expertise et apprentissage automatique
</p>
<p>Nous disposons d&#8217;un corpus de 80 textes journalistiques (Le Monde de 1989-1990) annot&#233;
automatiquement par TiLT afin de disposer d&#8217;informations morphologiques, syntaxiques et
s&#233;mantiques sur les expressions et leur r&#244;le dans la phrase. Les liens de cor&#233;f&#233;rences entre
les expressions ainsi que la classe s&#233;mantique (personne, lieux, organisation) de celles-ci ont
ensuite &#233;t&#233; marqu&#233;s manuellement.
</p>
<p>Les couples d&#8217;expressions constitu&#233;es &#224; partir du corpus ont &#233;t&#233; partitionn&#233;s en fonction de leur
type : NPR-NPR, NPR-NCOM, NPR-PRON, NCOM-NCOM, NCOM-PRON, PRON-PRON.
Nous nous sommes restreint pour cette &#233;valuation aux couples ayant pour ant&#233;c&#233;dent un nom
propre.
</p>
<p>Dans un premier temps, nous avons, &#224; travers une d&#233;marche interactive, demand&#233; &#224; un expert du
domaine de constituer trois profils de param&#232;tres d&#233;cisionnels (voir Sec. 3.2) pour les trois cas
de reprise anaphorique trait&#233;s. L&#8217;expert devait ainsi identifier les crit&#232;res qu&#8217;il jugeait pertinents
dans chacun des cas, ainsi que leur importance relative dans l&#8217;agr&#233;gation, un profil d&#8217;accepta-
bilit&#233; et &#233;ventuellement des seuils de pr&#233;f&#233;rence, indiff&#233;rence et veto. Dans un second temps,
nous avons exploit&#233; une partie du corpus annot&#233; pour apprendre automatiquement les poids des
diff&#233;rents crit&#232;res ainsi que les seuils d&#233;limitant la classe des couples valides (Sec. 3.3). Ce
corpus est constitu&#233; de 950 paires npr-npr, 3400 paires npr-ncom et 620 paires npr-pron, com-
pos&#233; respectivement de 90, 46 et 48 cas valides (positifs) de cor&#233;f&#233;rence. Nous avons ensuite
&#233;valu&#233; les diff&#233;rents profils de param&#232;tres sur un corpus d&#8217;&#233;valuation extrait du corpus de r&#233;f&#233;-
rence, constitu&#233; de 120 paires candidates NPR-NPR (19 positives), 80 paires NPR-PRON (12
positives) et de 414 paires NPR-NCOM (9 positives).
</p>
<p>Profil Expressions Pr&#233;cision Rappel F-mesure
Manuel NPR-NPR 0.9 0.92 0.91
</p>
<p>NPR-NCOM 0.4 0.2 0.26
NPR-PRON 0.4 0.25 0.3
</p>
<p>Automatique NPR-NPR 0.94 0.96 0.95
NPR-NCOM 0.35 0.17 0.23
NPR-PRON 0.6 0.39 0.47
</p>
<p>L&#8217;apprentissage automatique des poids des crit&#232;res ainsi que des limites d&#8217;acceptabilit&#233; nous
permet d&#8217;am&#233;liorer sensiblement les r&#233;sultats bien que le corpus soit principalement compos&#233;
d&#8217;exemples n&#233;gatifs (&#224; plus de 90% sur le corpus de test et &#224; plus de 95% sur le corpus d&#8217;ap-
prentissage). Inf&#233;rer automatiquement ces param&#232;tres d&#233;cisionnels nous permet identifier et de
quantifier l&#8217;utilit&#233; des diff&#233;rents crit&#232;res disponibles, contredisant parfois les intuitions de l&#8217;ex-
pert qui exploitait des crit&#232;res n&#8217;apportant que du bruit. Par exemple, pour le cas des couples
NPR-PRON, l&#8217;expert a s&#233;lectionn&#233; quatre crit&#232;res comme pertinents et a formul&#233; les pr&#233;f&#233;rences
suivantes concernant l&#8217;importance relative de chacun d&#8217;eux :
</p>
<p>1. accord en nombre entre l&#8217;ant&#233;c&#233;dent et la reprise
2. accord en genre entre l&#8217;ant&#233;c&#233;dent et la reprise
3. nombre d&#8217;occurences de l&#8217;ant&#233;c&#233;dent dans le texte
4. nombre d&#8217;expressions s&#233;parant l&#8217;ant&#233;c&#233;dent de la reprise
5. ant&#233;c&#233;dent et reprise ont la fonction sujet
</p>
<p>280</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodologie g&#233;n&#233;rique de contr&#244;le d&#8217;une cha&#238;ne de TALN
</p>
<p>Cependant, par apprentissage sur corpus de r&#233;f&#233;rence, de nouveaux crit&#232;res ont &#233;t&#233; identifi&#233;s
comme pertinents et l&#8217;ordre d&#8217;importance de l&#8217;ensemble des crit&#232;res utilis&#233; a &#233;t&#233; modifi&#233;, ce
qui explique l&#8217;am&#233;lioration des r&#233;sultats (les autres param&#232;tres de seuils restants identiques au
profil d&#233;cisionnel de l&#8217;expert) :
</p>
<p>1. ant&#233;c&#233;dent est l&#8217;expression la plus proche
</p>
<p>2. ant&#233;c&#233;dent et reprise sont dans la m&#234;me phrase
</p>
<p>3. nombre d&#8217;occurences de l&#8217;ant&#233;c&#233;dent dans le texte
</p>
<p>4. accord en nombre entre l&#8217;ant&#233;c&#233;dent et la reprise
</p>
<p>5. nombre d&#8217;expressions s&#233;parant l&#8217;ant&#233;c&#233;dent de la reprise
</p>
<p>6. nombre de mots s&#233;parant l&#8217;ant&#233;c&#233;dent de la reprise
</p>
<p>7. ant&#233;c&#233;dent et reprise ont la fonction sujet
</p>
<p>8. accord en genre entre l&#8217;ant&#233;c&#233;dent et la reprise
</p>
<p>Cette t&#226;che d&#8217;identification des couples ant&#233;c&#233;dent/reprise-anaphorique avait dans un premier
&#233;t&#233; trait&#233;e &#224; l&#8217;aide de classifieurs bay&#233;siens na&#239;fs. Outre des am&#233;liorations des valeurs de pr&#233;ci-
sion et de rappel, notre approche offre &#224; l&#8217;expert la possibilit&#233; d&#8217;intervenir sur le comportement
de la m&#233;thode de classification mais &#233;galement une meilleure compr&#233;hension des d&#233;cisions
&#233;mises.
</p>
<p>5 Perspectives et conclusion
</p>
<p>Nous proposons une m&#233;thode g&#233;n&#233;rique de contr&#244;le des points d&#8217;embarras apparaissant lors
d&#8217;un processus de TALN. Cette m&#233;thode inspir&#233;e de l&#8217;aide multicrit&#232;re &#224; la d&#233;cision se base
sur l&#8217;agr&#233;gation de crit&#232;res de comparaison h&#233;t&#233;rog&#232;nes. Les diff&#233;rents param&#232;tres externalis&#233;s
dans un profil d&#233;cisionnel permettent &#224; un expert d&#8217;exprimer ses connaissances et intuitions
sur le probl&#232;me trait&#233;. Pour valider ou inf&#233;rer automatiquement les pr&#233;f&#233;rences &#233;mises par un
expert, nous utilisons des m&#233;thodes d&#8217;apprentissage supervis&#233; exploitant un corpus de r&#233;f&#233;rence.
</p>
<p>La m&#233;thode d&#8217;apprentissage de m&#233;triques RELIEF s&#8217;av&#232;re efficace pour quantifier la repr&#233;sen-
tativit&#233; d&#8217;un crit&#232;re vis &#224; vis d&#8217;un ensemble d&#8217;exemples annot&#233;s comme valides. Nous envi-
sageons cependant d&#8217;exploiter une variante de cette m&#233;thode pour r&#233;duire l&#8217;impact de la forte
proportion d&#8217;exemples n&#233;gatifs lors de l&#8217;apprentissage. Nous travaillons actuellement sur la
mise en place de m&#233;thodes de seuillage pour inf&#233;rer automatiquement les autres param&#232;tres
d&#233;cisionnels.
</p>
<p>L&#8217;approche propos&#233;e est en cours de validation sur un autre cas concret d&#8217;exp&#233;rimentation : le
classement des arbres syntaxiques concurrents. L&#8217;automatisation d&#8217;une proc&#233;dure d&#8217;aide &#224; la
d&#233;cision bas&#233;e sur la comparaison deux &#224; deux des hypoth&#232;ses concurrentes, pour les probl&#233;-
matiques de classement, pose cependant des probl&#232;mes de complexit&#233;. Ainsi, en pr&#233;sence d&#8217;un
grand nombre d&#8217;hypoth&#232;ses concurrentes, il ne semble pas judicieux de construire un classe-
ment de tous les candidats. Nous proposons donc d&#8217;effectuer un premier filtrage en exploitant
notamment les crit&#232;res jug&#233;s comme les plus pertinent par la m&#233;thode d&#8217;apprentissage auto-
matique des poids. Sur le sous-ensemble d&#8217;hypoth&#232;ses restant, des relations de surclassement
peuvent &#234;tre &#233;tablies et interpr&#233;t&#233;es pour obtenir un classement des N meilleurs candidats.
</p>
<p>281</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gr&#233;gory SMITS, Christine CHARDENON
</p>
<p>R&#233;f&#233;rences
ALTMANN G. (1998). Ambiguity in sentence processing. Trends in Cognitive Sciences, 2(4).
BLACHE P. &amp; RAUZY S. (2006). M&#233;canismes de contr&#244;le pour l&#8217;analyse en grammaires de
propri&#233;t&#233;s. In in proceedings of TALN.
BOURIGAULT D. &amp; FR&#201;ROT C. (2004). Ambigu&#239;t&#233; de rattachement pr&#233;positionnel : intro-
duction de ressources exog&#232;nes de sous-cat&#233;gorisation dans un analyseur syntaxique de corpus
endog&#232;ne. In in proceedings of TALN.
CHARNIAK E. &amp; M.JOHNSON (2005). Coarse-to-fine n-best parsing and maxent discrimi-
native reranking. In ACL &#8217;05 : Proceedings of the 43rd Annual Meeting on Association for
Computational Linguistics, p. 173&#8211;180, Morristown, NJ, USA : Association for Computatio-
nal Linguistics.
GALA N. (2003). Une m&#233;thode non supervis&#233;e d&#8217;apprentissage sur le web pour la r&#233;solution
d&#8217;ambigu&#239;t&#233;s structurelles li&#233;es au rattachement pr&#233;positionnel. In in proceedings of TALN.
GIBSON E. &amp; PEARLMUTTER N. (1998). Constraints on sentence comprehension. Trends in
Cognitive Sciences, 2(7).
KONONENKO I. (1994). Estimating attributes : Analysis and extensions of relief. In In pro-
ceedings of the European Conference on Machine Learning.
RADY M. (1983). L&#8217;ambigu&#239;t&#233; du langage naturel est-elle la source du non-d&#233;terminisme des
proc&#233;dures de traitement ? PhD thesis, Universit&#233; de Paris VI.
RIGAU G., ATSERIAS J. &amp; AGIRRE E. (1997). Combining unsupervised lexical knowledge
methods for word sense disambiguation. Proceedings of the 35th annual meeting on Associa-
tion for Computational Linguistic.
ROSSO P., MASSULLI F. &amp; BUSCALDI D. (2003). Word sense disambiguation combining
conceptual distance, frequency and gloss. IEEE.
ROY B. (1990). Decision-aid and decision-making. In European Journal of Operational
Research, volume 45, p. 324&#8211;331.
SABAH G. (1989). L&#8217;IA et le langage (tome 2). Hermes.
SABAH G. (1990). Caramel : A flexible model for interaction between the cognitive processes
underlying natural language understanding. In Proceedings of the Ninth European Conference
on Artificial.
SMITS G. (2006). Contr&#244;le dynamique multicrit&#232;re des r&#233;sultats d&#8217;une cha&#238;ne de tal. In in
proceedings of RECITAL.
SMITS G. (2007). M&#233;thodologie d&#8217;aide multicrit&#232;re &#224; la d&#233;cision pour le contr&#244;le d&#8217;une cha&#238;ne
de traitement automatique des langues naturelles. In in proceedings of ROADEF&#8217;07.
TARDIF O. (2006). R&#233;soudre la cor&#233;f&#233;rence &#224; l&#8217;aide d&#8217;un classifieur bay&#233;sien na&#239;f. In in
proceedings of RECITAL.
USZKOREIT H. (1991). Strategies for adding control information to declarative grammars.
In A. FOR COMPUTATIONAL LINGUISTICS, Ed., Proceedings of the 29th annual meeting on
Association for Computational Linguistics, p. 237&#8211;245.
VINCKE P. (1998). Aide multicrit&#232;re &#224; la d&#233;cision. Ellipses Marketing.
WHITTEMORE G., FERRARA K. &amp; BRUNNER H. (1990). Empirical study of predictive
powers of simple attachment schemes for post-modifier prepositional phrases. In Proceedings
of the 28th annual meeting on Association for Computational Linguistics.
</p>
<p>282</p>

</div></div>
</body></html>