<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;tection et pr&#233;diction de la satisfaction des usagers dans les dialogues Personne-Machine</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>D&#233;tection et pr&#233;diction de la satisfaction des usagers dans les
dialogues Personne-Machine
</p>
<p>Narj&#232;s Boufaden, Truong Le Hoang, Pierre Dumouchel
&#201;cole de Technologie Sup&#233;rieure et Centre de Recherche Informatique de
</p>
<p>Montr&#233;al
{Narjes.Boufaden,LeHoang.Truong,Pierre.Dumouchel}@crim.ca
</p>
<p>R&#233;sum&#233;. Nous &#233;tudions le r&#244;le des entit&#233;s nomm&#233;es et marques discursives de r&#233;troac-
tion pour la t&#226;che de classification et pr&#233;diction de la satisfaction usager &#224; partir de dialogues.
Les exp&#233;riences men&#233;es sur 1027 dialogues Personne-Machine dans le domaine des agences
de voyage montrent que les entit&#233;s nomm&#233;es et les marques discursives n&#8217;am&#233;liorent pas de
mani&#232;re significative le taux de classification des dialogues. Par contre, elles permettent une
meilleure pr&#233;diction de la satisfaction usager &#224; partir des premiers tours de parole usager.
</p>
<p>Abstract. We study the usefulness of named entities and acknowldgment words for user
satisfaction classification and prediction from Human-Computer dialogs. We show that named
entities and acknowledgment words do not enhance baseline classification performance. Howe-
ver, they allow a better prediction of user satisfaction in the beginning of the dialogue.
</p>
<p>Mots-cl&#233;s : pr&#233;diction de la satisfaction usager, classification des dialogues Personne-
Machine.
</p>
<p>Keywords: prediction of user satisfaction, Human-Computer dialog classification.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N.Boufaden, L.H Truong, P.Dumouchel
</p>
<p>1 Introduction
</p>
<p>La progression des syst&#232;mes de dialogue Personne-Machine dans le march&#233; du service &#224; la
client&#232;le cr&#233;e des attentes grandissantes tant sur le plan de la gestion des donn&#233;es g&#233;n&#233;r&#233;es par
ces syst&#232;mes que sur leur exploitation &#224; des fins d&#8217;&#233;valuation.
</p>
<p>La classification, l&#8217;indexation et l&#8217;extraction d&#8217;information sont autant d&#8217;exemples d&#8217;applica-
tions peu ou pas encore explor&#233;es en gestion des dialogues Personne-Machine. La majeure
partie de la recherche dans ce domaine est encore consacr&#233;e &#224; l&#8217;&#233;valuation de ces syst&#232;mes.
</p>
<p>Dans cet article, nous explorons la classification des dialogues Personne-Machine dans le but
de d&#233;tecter les dialogues probl&#233;matiques dans lesquels l&#8217;usager montre une insatisfaction par
rapport au syst&#232;me. Nous explorons l&#8217;utilisation des entit&#233;s nomm&#233;s et des marques discursives
de r&#233;troaction pour la t&#226;che de pr&#233;diction de la satisfaction usager durant et apr&#232;s le d&#233;roulement
du dialogue.
</p>
<p>Ces travaux s&#8217;ins&#232;rent dans le cadre d&#8217;un projet en cours avec une compagnie de t&#233;l&#233;commu-
nication dans le but d&#8217;&#233;valuer leur syst&#232;me de dialogue et analyser les dialogues qu&#8217;il g&#233;n&#232;re.
Comme premi&#232;re &#233;tape de ce projet, nous &#233;tudions la probl&#233;matique de d&#233;tection et pr&#233;diction
de la satisfaction usager sur un corpus public : DARPA Communicator.
</p>
<p>Dans la section 2, nous pr&#233;sentons l&#8217;&#233;tat de l&#8217;art en &#233;valuation des syst&#232;mes de dialogues
Personne-Machine, en d&#233;tection des dialogues probl&#233;matiques et pr&#233;sentons le cadre th&#233;orique
PARADISE. Dans la section 3, nous pr&#233;sentons le corpus DARPA Communicator avec lequel
nous effectuons nos exp&#233;riences. La section 4 d&#233;crit notre approche bas&#233;e du cadre th&#233;orique
PARADISE. La section 5 pr&#233;sente trois exp&#233;riences de classification dans lesquelles nous exp&#233;-
rimentons diff&#233;rentes combinaisons des attributs propos&#233;s pour d&#233;tecter la satisfaction usager &#224;
partir du dialogue. Dans la section 6, nous &#233;tudions le r&#244;le des entit&#233;s nomm&#233;es et des marques
discursives dans la pr&#233;diction de la satisfaction usager en d&#233;but de dialogue. Enfin, la section 7
pr&#233;sente une synth&#232;se de nos r&#233;sultats ainsi que les prochaines &#233;tapes de ce projet.
</p>
<p>2 &#201;tat de l&#8217;art
L&#8217;&#233;valuation des syst&#232;mes de dialogue occupe depuis la fin des ann&#233;es 90 une place de plus en
plus importante en recherche. Par exemple, (Eckert et al., 1998) ont utilis&#233; un mod&#232;le stochas-
tique pour mod&#233;liser le comportement de diff&#233;rentes classes d&#8217;usager dans le but de collecter
des statistiques sur les diff&#233;rents sc&#233;narii de dialogues. En particulier, ils ont montr&#233; que la
longueur du dialogue en termes du nombre de tours de parole est un bon pr&#233;dicteur des perfor-
mances d&#8217;un syst&#232;me.
</p>
<p>Dans une perspective plus g&#233;n&#233;rale, (Walker et al., 1997) proposaient le cadre th&#233;orique PARA-
DISE actuellement le plus utilis&#233; pour l&#8217;&#233;valuation des syst&#232;mes de dialogues. Ce cadre th&#233;o-
rique s&#8217;inspire de la th&#233;orie de d&#233;cision et pose comme hypoth&#232;se que la performance d&#8217;un
syst&#232;me de dialogues est corr&#233;l&#233;e avec le degr&#233; de convivialit&#233;. Dans le cadre de notre applica-
tion (le service &#224; la client&#232;le), la convivialit&#233; se mesure en termes de satisfaction de l&#8217;usager.
PARADISE met en avant la maximisation de la satisfaction usager en maximisant les chances de
r&#233;ussir la t&#226;che ou but du dialogue tout en minimisant les co&#251;ts associ&#233;s &#224; sa r&#233;alisation. Ces
co&#251;ts sont d&#233;finis en termes d&#8217;efficacit&#233; (i.e. nombre de tours de parole syst&#232;me et usager) et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection et pr&#233;diction de la satisfaction des usagers dans les dialogues Personne-Machine
</p>
<p>qualit&#233; du syst&#232;me (i.e. temps de r&#233;ponse du syst&#232;me). La Figure 1 illustre le cadre th&#233;orique
PARADISE.
</p>
<p>Minimiser les co&#251;t associ&#233;s &#224; la 
r&#233;alisation de la t&#226;che
</p>
<p>Mesure de l&#8217;efficacite de la t&#226;che Mesure de la qualit&#233; de la t&#226;che
</p>
<p>Maximiser la satisfaction de l&#8217;usager
</p>
<p>Maximiser la r&#233;alisation de la t&#226;che
</p>
<p>FIG. 1 &#8211; Cadre th&#233;orique PARADISE
</p>
<p>Le cadre PARADISE a &#233;t&#233; utilis&#233; dans plusieurs travaux (Walker et al., 2000), (Lamel &amp; Rosset,
2000), (Devillers &amp; Rosset, 2000), notamment dans le but de choisir les strat&#233;gies de dialogues
qui maximisent la satisfaction de l&#8217;usager (Walker &amp; Passonneau, 2001), pour d&#233;terminer les
composantes (reconnaissance de la parole, strat&#233;gie de dialogue) ayant le plus d&#8217;impact sur la
performance d&#8217;un syst&#232;me ou encore pour d&#233;tecter les dialogues probl&#233;matiques (Hastie et al.,
2002).
En particulier, (Hastie et al., 2002) ont propos&#233; une approche pour la d&#233;tection des dialogues
probl&#233;matiques utilisant 16 attributs repr&#233;sentant diff&#233;rentes mesures reli&#233;es aux trois dimen-
sions d&#233;finies dans PARADISE, &#224; savoir :
Mesure du succ&#232;s de la t&#226;che &#201;valuation de l&#8217;usager indiquant la r&#233;alisation de la t&#226;che.
Mesure de l&#8217;efficacit&#233; du syst&#232;me Traits extraits des traces du syst&#232;me de dialogue.
</p>
<p>&#8211; Manuellement : Taux d&#8217;erreur de reconnaissance de la parole calcul&#233; &#224; partir des trans-
criptions manuelles des dialogues et le taux d&#8217;erreur phrastique.
</p>
<p>&#8211; Automatiquement : la dur&#233;e de la t&#226;che, le nombre de tours de parole durant la t&#226;che,
nombre de chevauchement de tours de parole syst&#232;me et usager, la moyenne des temps
des tours de parole usager, la moyenne des mots par tour de parole usager, la moyenne
des temps des tours de parole syst&#232;me, la moyenne des mots par tour de parole syst&#232;me
et le type de t&#233;l&#233;phone (cellulaire ou fixe).
</p>
<p>Mesure de la qualit&#233; du syst&#232;me Actes de dialogue associ&#233;s aux tours de parole du syst&#232;me.
Dans une premi&#232;re exp&#233;rience, les auteurs ont utilis&#233; tous les traits : extraits automatiquement
ainsi que ceux annot&#233;s manuellement. En utilisant un arbre de d&#233;cision, ils ont obtenu un taux
de classification de 54%. Toutefois, pour &#233;viter l&#8217;utilisation des attributs annot&#233;s manuellement,
ils ont entra&#238;n&#233; un arbre de d&#233;cision afin de pr&#233;dire le succ&#232;s de la t&#226;che et les actes de dialogues
des tours de parole syst&#232;me. Avec un taux de pr&#233;diction du succ&#232;s de la t&#226;che de 92% et un
taux de pr&#233;diction des actes de dialogues de 98%, les auteurs ont obtenu un taux de classification
similaire.
</p>
<p>(Walker et al., 2002) ont test&#233; la d&#233;tection des dialogues probl&#233;matiques en utilisant des attributs
enti&#232;rement extraits de mani&#232;re automatique. Ils ont utilis&#233; aussi des mesures de l&#8217;efficacit&#233;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N.Boufaden, L.H Truong, P.Dumouchel
</p>
<p>mod&#233;lis&#233; avec l&#8217;algorithme RIPPER (Cohen, 1995) : un algorithme de classification &#224; base de
r&#232;gles. Sur le corpus g&#233;n&#233;r&#233; par le syst&#232;me de AT&amp;T How May I Help You, les auteurs ont
obtenu un taux de classification de 70,1% &#224; partir du premier tour de parole usager, 78,4% &#224;
partir des deux premiers tours de parole et de 83% sur tout le dialogue.
</p>
<p>Les travaux que nous pr&#233;sentons se basent sur le cadre th&#233;orique PARADISE et s&#8217;inspirent des
travaux de (Hastie et al., 2002) r&#233;alis&#233;s sur le corpus DARPA Communicator.
</p>
<p>3 Corpus DARPA Communicator
</p>
<p>Le corpus DARPA Communicator (version 2001) est un corpus public distribu&#233; par le Linguistic
Data Consortium (LDC). C&#8217;est le r&#233;sultat d&#8217;une exp&#233;rience men&#233;e sur plusieurs sites incluant
huit syst&#232;mes de dialogue Personne-Machine dans le but de d&#233;velopper des approches robustes
de reconnaissance de la parole et de gestion de dialogues pour l&#8217;acc&#232;s interactif &#224; l&#8217;informa-
tion (Robust Recognition and Dialog Tracking for Interactive Information Access). Le domaine
d&#8217;application choisi est celui des agences de voyages.
</p>
<p>Un des d&#233;fis de cette exp&#233;rience &#233;tait de collecter un corpus de dialogues Personne-Machine
proche de la r&#233;alit&#233;. Pour ce faire, les sc&#233;narii des dialogues &#233;taient en majorit&#233; pr&#233;d&#233;finis (sept
des neuf sc&#233;narii) puisque chaque participant savait l&#8217;origine et la destination de son voyage
ainsi que les dates et la compagnie a&#233;rienne &#224; choisir. Tandis que deux des sc&#233;narii &#233;taient
laiss&#233;s au choix des participants. La version 2001 du corpus contient une s&#233;lection de plus de
1242 dialogues annot&#233;s avec la degr&#233; de satisfaction de l&#8217;usager. Les dialogues sont en moyenne
compos&#233;s de 51 tours de parole avec en moyenne 25,4 tours de parole usager et une longueur
moyenne d&#8217;un tour de parole usager est de 64,6 mots.
</p>
<p>Dans la version 2001 du corpus que nous utilisons dans nos exp&#233;riences, chaque dialogue est
accompagn&#233; de deux fichiers :
&#8211; Un fichier qui contient la transcription du dialogue (partie du haut de la Figure 2).
&#8211; Un fichier r&#233;capitulatif contenant les scores attribu&#233;s par l&#8217;usager pour l&#8217;&#233;valuation de la
</p>
<p>convivialit&#233; du syst&#232;me (partie du bas de la Figure 2). En allant de gauche &#224; droite la ligne
contient le nom du syst&#232;me (CMU pour Carnegie Melon University), l&#8217;index du site (le chiffre
27), le temps de d&#233;but du dialogue (14 :25), la date du dialogue (2000/07/06), la compl&#233;tion
de la t&#226;che et le reste des donn&#233;es sont respectivement les r&#233;ponses &#224; des questions portant
sur la convivialit&#233; du syst&#232;me. Chaque question &#233;tait not&#233;e sur une &#233;chelle de 1 &#224; 5 avec la
valeur 1 indiquant que l&#8217;usager est en parfait accord avec l&#8217;affirmation et le score 5 indiquant
un total d&#233;saccord.
</p>
<p>4 Approche
</p>
<p>Nous proposons d&#8217;utiliser PARADISE pour d&#233;tecter les dialogues probl&#233;matiques et pr&#233;dire la
satisfaction usager durant et apr&#232;s le d&#233;roulement du dialogue.
</p>
<p>Dans notre approche nous tenons compte de deux contraintes li&#233;es &#224; notre projet :
&#8211; Minimiser la quantit&#233; d&#8217;information &#224; annoter manuellement. Le but de ces exp&#233;riences &#233;tant
</p>
<p>de concevoir une application r&#233;elle pour la d&#233;tection des dialogues probl&#233;matiques, nous
voulons obtenir un syst&#232;me enti&#232;rement automatis&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection et pr&#233;diction de la satisfaction des usagers dans les dialogues Personne-Machine
</p>
<p>Thu Jul 6 2000 at 15 :15 :38.51 : Task-specific portion started.
Thu Jul 6 2000 at 15 :17 :01.44 : Overall task started.
Task completion status : not completed.
Thu Jul 6 2000 at 15 :15 :24.85 to Thu Jul 6 2000 at 15 :15 :25.01 : New system turn
began.
Thu Jul 6 2000 at 15 :15 :24.94 : System started speaking.
Thu Jul 6 2000 at 15 :15 :36.22 : System finished speaking.
System said : . Hello. Welcome to the C M U Communicator. Please speak your 4-digit
ID number using the phrase, . My ID number is
Thu Jul 6 2000 at 15 :15 :38.51 : New user turn began.
Thu Jul 6 2000 at 15 :15 :38.51 : User started speaking.
Thu Jul 6 2000 at 15 :15 :43.53 : User finished speaking.
Recognizer heard : MY I D NUMBER IS . ?THAT ?. . ?WONDER ?. ZERO EIGHT SE-
VEN
User said : my i. d. number is one zero eight seven [h#]
1087_02_27_03_20000706
CMU 27 14 :25 EDT 2000/07/06 Alive No 4 1 4 3 4
(no comments provided)
</p>
<p>FIG. 2 &#8211; Exemple de traces du syst&#232;me extrait du corpus DARPA Communicator.
</p>
<p>&#8211; Minimiser la quantit&#233; d&#8217;information d&#233;pendante du domaine. Notre syst&#232;me &#233;tant vou&#233; &#224;
&#234;tre appliqu&#233; sur un corpus diff&#233;rent du DARPA Communicator, nous voulons minimiser
l&#8217;information d&#233;pendante du domaine des agences de voyages.
</p>
<p>Nous proposons de partir des mesures d&#8217;efficacit&#233; propos&#233;es par (Hastie et al., 2002). Plus pr&#233;-
cis&#233;ment, nous partons des mesures extraites automatiquement et &#233;tudions deux nouveaux traits
ind&#233;pendants du domaine : les entit&#233;s nomm&#233;es contenue dans un dialogue et les marques
discursives de r&#233;troaction. Nous proposons d&#8217;utiliser les entit&#233;s nomm&#233;es comme indica-
teur de la densit&#233; d&#8217;information que nous corr&#233;lons avec la qualit&#233; du dialogue. Nous pensons
qu&#8217;une densit&#233; d&#8217;information faible (interruption du dialogue) ou trop importante (plusieurs r&#233;-
p&#233;titions) pourrait indiquer un probl&#232;me de communication entre l&#8217;usager et le syst&#232;me. Les
marques discursives de r&#233;troaction sont utilis&#233;es dans la d&#233;tection des actes de dialogues
notamment d&#8217;acquiescement ou de confirmation, tous les deux correl&#233;s avec la satisfaction de
l&#8217;usager (Colineau &amp; Caelen, 1996).
</p>
<p>4.1 Les entit&#233;s nomm&#233;es
</p>
<p>Les entit&#233;s nomm&#233;es sont des noms propres ou chiffres r&#233;f&#233;rant &#224; des noms de personnes, de
lieux ou des noms de compagnies. L&#8217;apport des entit&#233;s nomm&#233;es pour les applications de com-
pr&#233;hension du langage naturel a &#233;t&#233; largement d&#233;montr&#233; aussi bien en extraction d&#8217;information
qu&#8217;en r&#233;sum&#233; automatique ou en traduction automatique. Leur int&#233;r&#234;t r&#233;side dans la valeur
s&#233;mantique de l&#8217;information qu&#8217;ils v&#233;hiculent. Dans le cadre de notre application, nous nous
int&#233;ressons &#224; la correlation existant entre les entit&#233;s nomm&#233;es et la densit&#233; d&#8217;information.
</p>
<p>Nous proposons d&#8217;utiliser le compte des entit&#233;s nomm&#233;es comme indicateur de la densit&#233; d&#8217;in-
formation contenue dans un dialogue. Par ailleurs et dans la mesure o&#249; notre corpus n&#8217;est pas de
taille importante, nous regroupons le compte de toutes les cat&#233;gories d&#8217;entit&#233;s nomm&#233;es pour</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N.Boufaden, L.H Truong, P.Dumouchel
</p>
<p>r&#233;duire la dimension des vecteurs des donn&#233;es fournies comme donn&#233;es d&#8217;entra&#238;nement.
</p>
<p>4.2 les marques discursives de r&#233;troaction
</p>
<p>Les marques discursives de r&#233;troaction telles que ok, yes et no sont des marques lexicales
utilis&#233;es pour d&#233;tecter les actes de dialogues d&#8217;acquiescement ou d&#8217;opposition (Colineau &amp;
Caelen, 1996), (Jurafsky et al., 1998). Ce sont des unit&#233;s lexicales qui, dans le contexte des
dialogues Personne-Machine, donnent une mesure qualitative sur le d&#233;roulement du dialogue.
</p>
<p>Par ailleurs, les strat&#233;gies dialogiques des syst&#232;mes de dialogues Personne-Machine &#233;tant en
grande partie compos&#233;es de questions &#224; base de choix binaires (Yes/No questions) ou de choix
multiples, nous sommes assur&#233;s d&#8217;observer ces marques de mani&#232;re significative dans les dia-
logues. Dans notre approche, nous ne faisons aucune distinction entre les marques de r&#233;tro-
actions indiquant un acquiescement yes, ok, correct ou yep de celles indiquant une op-
position no, wrong ou erase puisque nous ne tenons pas compte du contexte pr&#233;c&#233;dent le
tour de parole. Aussi, ce choix nous permet de r&#233;duire la dimension des vecteurs des donn&#233;es
d&#8217;entra&#238;nement.
</p>
<p>Dans ce qui suit, nous testons diff&#233;rentes combinaisons des attributs d&#233;crits dans notre approche
pour la t&#226;che de classification des dialogues et la pr&#233;diction de la satisfaction usager durant le
d&#233;roulement du dialogue.
</p>
<p>5 Exp&#233;rience 1 : D&#233;tection des dialogues probl&#233;matiques
</p>
<p>Notre premi&#232;re exp&#233;rience a pour but de classer des dialogues dans une des classes suivantes :
&#8211; Positive : L&#8217;usager a attribu&#233; un score de satisfaction &lt; 12. Ce score est obtenu en cumulant
</p>
<p>tous les scores des cinq questions &#233;valuant la convivialit&#233; du syst&#232;me. Le seuil de 12 est align&#233;
sur celui propos&#233; dans les travaux de (Hastie et al., 2002) afin de permettre la comparaison
de nos r&#233;sultats.
</p>
<p>&#8211; N&#233;gative : L&#8217;usager a attribu&#233; un score &#8805; 12.
Afin d&#8217;&#233;valuer notre approche, nous comparons nos r&#233;sultats avec ceux de (Hastie et al., 2002)
en utilisant que les mesures d&#8217;efficacit&#233; (ind&#233;pendantes du domaine) extraites de mani&#232;re auto-
matique et les actes de dialogues (d&#233;pendants du domaine) pour classer les dialogues.
Nous pr&#233;sentons quatre exp&#233;riences combinant nos diff&#233;rents attributs :
Eff. compos&#233; uniquement des mesures de l&#8217;efficacit&#233; extraites automatiquent &#224; partir des traces
</p>
<p>du syst&#232;me de dialogue.
Eff.+NE compos&#233; des mesures de l&#8217;efficacit&#233; et du compte des entit&#233;s nomm&#233;es toutes cat&#233;go-
</p>
<p>ries confondues.
Eff.+ACK compos&#233; des mesures de l&#8217;efficacit&#233; et du compte des marques discursives de r&#233;tro-
</p>
<p>action.
Eff.+EN+ACK compos&#233; de tous les attributs.
Nous testons ces combinaisons avec trois algorithmes de classification : Support Vector Ma-
chine (SVM), k-Nearest-Neighbour (kNN) et un arbre de d&#233;cision (DT). Le corpus utilis&#233; est
constitu&#233; de 1027 dialogues tir&#233;s du corpus DARPA Communicator 2001. &#192; la base le cor-
pus contenait une distribution de quatre dialogues de la classe positive pour un dialogue de la</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection et pr&#233;diction de la satisfaction des usagers dans les dialogues Personne-Machine
</p>
<p>classe n&#233;gative. Les premiers r&#233;sultats sur ce corpus avec une distribution tr&#232;s biais&#233;e en faveur
des dialogues positifs se rapprochaient sensiblement du baseline de 80%. Afin de rem&#233;dier &#224;
ce biais, nous avons constitu&#233; un nouveau corpus &#224; partir du corpus original en dupliquant de
mani&#232;re al&#233;atoire les statistiques de dialogues de la classe n&#233;gative et en retirant de mani&#232;re
al&#233;atoire les statistiques de dialogues de la classe positive jusqu&#8217;&#224; obtention d&#8217;une distribution
uniforme (re-&#233;chantillonage avec duplication) avec 50% des donn&#233;es par classes.
Les r&#233;sultats que nous pr&#233;sentons sont obtenus sur ce nouveau corpus. Ce sont les moyennes
des r&#233;sultats de 10 validations crois&#233;es.
</p>
<p>Mod&#232;le Baseline Eff. Eff.+NE Eff.+ACK Eff.+NE+ACK (Hastie et al., 2002)
SVM 50% 61,26% 62,9% 62,83% 63,51% -
kNN 50% 91,41% 91,12% 91,6% 91,8% -
DT 50% 85,75% 84,68% 87,41% 87,26% 54%
</p>
<p>TAB. 1 &#8211; Performance des diff&#233;rents classificateurs en termes de taux de classification pour les
diff&#233;rentes combinaisons d&#8217;attributs.
</p>
<p>Contrairement &#224; notre intuition quant &#224; l&#8217;apport des entit&#233;s nomm&#233;es et des marques discursives,
aucune am&#233;lioration significative est observ&#233;e pour les diff&#233;rents mod&#232;les. Les r&#233;sultats pour le
mod&#232;les kNN est sensiblement le m&#234;me pour toutes les combinaisons d&#8217;attributs. Tandis qu&#8217;une
petite am&#233;lioration est observ&#233;e pour l&#8217;arbre de d&#233;cision (DT) et le SVM. Cependant, le r&#233;sultat
obtenu pour le kNN avec la combinaison de tous les attributs est sup&#233;rieur aux r&#233;sultats obtenus
par (Hastie et al., 2002). Toutefois, rappelons que la distribution des classes n&#8217;&#233;tant pas la m&#234;me
ont ne peut &#233;tablir une comparaison directe entre nos r&#233;sultats et les leurs.
</p>
<p>Enfin, bien que nous n&#8217;ayons pas am&#233;lior&#233; le r&#233;sultat de la classification obtenu avec les mesures
d&#8217;efficacit&#233;, nous avons obtenu un meilleur taux de classification de 91,8% avec le mod&#232;le kNN.
</p>
<p>6 Exp&#233;rience 2 : Pr&#233;diction de la satisfaction de l&#8217;usager
</p>
<p>Malgr&#233; le peu d&#8217;am&#233;lioration des r&#233;sultats obtenus sur la classification des dialogues en com-
binant toutes les marques, nous voulions tester l&#8217;apport des entit&#233;s nomm&#233;s et des marques
discursives pour la pr&#233;diction de la satisfaction usager durant le d&#233;roulement du dialogue. Nous
avons conduit neuf exp&#233;riences dans lesquelles nous testons successivement les diff&#233;rentes com-
binaisons des attributs du Tableau 1 avec des donn&#233;es issues uniquement d&#8217;un nombre variable
de tours de parole usager. Chacune des combinaisons est test&#233;e sur des parties d&#8217;un dialogue
comprenant respectivement 1 tour de parole de l&#8217;usager, 2 tours de parole et ce jusqu&#8217;&#224; 8 tours
de parole et enfin sur tout le dialogue (soit 25,4 tours de parole).
Nous avons dress&#233; des courbes illustrant la progression du taux de classification durnat le dia-
logue en augmentant le nombre des tours de parole de l&#8217;usager &#224; chaque nouvelle exp&#233;rience.
Nous avons utilis&#233; le m&#234;me corpus que celui utilis&#233; dans la premi&#232;re exp&#233;rience et les r&#233;sultats
obtenus sont la moyenne de 10 validations crois&#233;es.
</p>
<p>Les courbes obtenues sont montr&#233;es dans les Figures 3, 4 et 5. La premi&#232;re figure repr&#233;sente
l&#8217;&#233;volution du taux de classification en fonction du nombre de tours de parole usager et ce
pour diff&#233;rentes combinaisons des attributs mod&#233;lis&#233;s par un SVM. La deuxi&#232;me figure montre
la progression mod&#233;lis&#233;e avec l&#8217;algorithme kNN et la derni&#232;re figure montre la progression
mod&#233;lis&#233;e avec un arbre de d&#233;cision.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N.Boufaden, L.H Truong, P.Dumouchel
</p>
<p> 50
</p>
<p> 52
</p>
<p> 54
</p>
<p> 56
</p>
<p> 58
</p>
<p> 60
</p>
<p> 62
</p>
<p> 64
</p>
<p> 0  2  4  6  8  10  12  14  16  18  20
</p>
<p>Baseline
Eff.
</p>
<p>Eff.+NE
Eff.+ACK
</p>
<p>Eff.+NE+ACK
</p>
<p>FIG. 3 &#8211; Courbes illustrant la progression du taux de classification durant le dialogue pour le
mod&#232;le SVM.
</p>
<p> 50
</p>
<p> 55
</p>
<p> 60
</p>
<p> 65
</p>
<p> 70
</p>
<p> 75
</p>
<p> 80
</p>
<p> 85
</p>
<p> 90
</p>
<p> 95
</p>
<p> 0  2  4  6  8  10  12  14  16  18  20
</p>
<p>Baseline
Eff.
</p>
<p>Eff.+NE
Eff.+ACK
</p>
<p>Eff.+NE+ACK
</p>
<p>FIG. 4 &#8211; Courbes illustrant la progression du taux de classification durant le dialogue pour le
mod&#232;le kNN.
</p>
<p> 50
</p>
<p> 55
</p>
<p> 60
</p>
<p> 65
</p>
<p> 70
</p>
<p> 75
</p>
<p> 80
</p>
<p> 85
</p>
<p> 90
</p>
<p> 0  2  4  6  8  10  12  14  16  18  20
</p>
<p>Baseline
Eff.
</p>
<p>Eff.+NE
Eff.+ACK
</p>
<p>Eff.+NE+ACK
</p>
<p> 55
</p>
<p> 60
</p>
<p> 65
</p>
<p> 70
</p>
<p> 75
</p>
<p> 80
</p>
<p> 85
</p>
<p> 90
</p>
<p>5
</p>
<p>FIG. 5 &#8211; Courbes illustrant la progression du taux de classification durant le dialogue pour le
mod&#232;le DT.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection et pr&#233;diction de la satisfaction des usagers dans les dialogues Personne-Machine
</p>
<p>Nous remarquons sur les diff&#233;rents graphiques que pendant les trois premiers tours de parole
usager, la combinaison de tous les attributs donne une meilleure pr&#233;diction de la satisfaction
usager.
</p>
<p>Aussi, nous remarquons que le meilleur r&#233;sultat est en majorit&#233; obtenu pour la combinaison
Eff.+ACK. Les marques discursives combin&#233;es aux mesures d&#8217;efficacit&#233; am&#233;liorent grande-
ment le taux de classification pendant les premiers tours de parole et ce pour tous les mod&#232;les.
Il semble que l&#8217;ajout des entit&#233;s nomm&#233;es introduit du bruit car le r&#233;sultat obtenu pour la com-
binaison Eff.+EN+ACK est moins bon.
</p>
<p>Par ailleurs, la meilleure performance est obtenue avec l&#8217;algorithme kNN qui se base sur la dis-
tance euclidienne pour classer les dialogues. Cela s&#8217;explique par le fait que les donn&#233;es d&#8217;entra&#238;-
nement sont des valeurs r&#233;elles qui repr&#233;sentent des fr&#233;quences et que la distance euclidienne
est une fonction qui permet de repr&#233;senter efficacement la similarit&#233; en termes de proximit&#233;.
</p>
<p>Le Tableau 2 montre les performances du mod&#232;le kNN qui a donn&#233; le meilleur r&#233;sultat de
classification avec les diff&#233;rentes combinaisons d&#8217;attributs.
</p>
<p>Nb tours de parole Eff. Eff.+EN Eff.+ACK Eff.+EN+ACK
1 80,49% 81,78% 87,07% 87,26%
2 81,47% 83,44% 87,65% 87,26%
3 87,80% 88,29% 88,48% 88,39%
tous 91,41% 91,12% 91,6% 91,8%
</p>
<p>TAB. 2 &#8211; Progression du taux de classification sur les trois premiers tours de parole usager pour
le mod&#232;le kNN.
</p>
<p>7 Conclusion
</p>
<p>Nous avons test&#233; la combinaison des mesures de l&#8217;efficacit&#233; propos&#233;es par (Hastie et al., 2002)
avec deux nouveaux attributs : les entit&#233;s nomm&#233;s et les marques discursives de r&#233;troaction pour
la classification des dialogues et la pr&#233;diction de la satisfaction usager. Bien que ces deux attri-
buts n&#8217;aient pas am&#233;lior&#233; de mani&#232;re significative les r&#233;sultats de la classification des dialogues,
ils ont permis une meilleure pr&#233;diction de la satisfaction usager durant les premiers tours de
parole de l&#8217;usager.
</p>
<p>En particulier, le compte des marques discursives a permis d&#8217;obtenir les meilleurs taux de pr&#233;-
diction en d&#233;but de dialogue. Ce r&#233;sultat a un int&#233;r&#234;t particulier puisque moyennant cet attribut
facilement calculable et non d&#233;pendant du domaine d&#8217;application, nous avons am&#233;lior&#233; le taux
de pr&#233;diction de la satisfaction usager de 6,6% pour le premier et second tour de parole par
rapport &#224; celui obtenu avec le mod&#232;le utilisant un arbre de d&#233;cision.
</p>
<p>Dans les prochaines &#233;tapes, nous exploiterons d&#8217;avantage les marques discursives de r&#233;troaction
en tenant compte de l&#8217;information prosodique extraites de l&#8217;audio de ces unit&#233;s lexicales. L&#8217;ajout
de la prosodie permettra de distinguer ces marques en leur associant un contenu &#233;motionnel pour
une meilleur pr&#233;diction de la satisfaction usager.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N.Boufaden, L.H Truong, P.Dumouchel
</p>
<p>Remerciement
</p>
<p>Ce projet est rendu possible gr&#226;ce au support de Patrimoine Canada.
</p>
<p>R&#233;f&#233;rences
COHEN W. (1995). Fast Effective rule induction. In Proceedings of the 12th Conference on
Machine Learning.
COLINEAU N. &amp; CAELEN J. (1996). Une approche lexicale pour la reconnaissance d&#8217;actes de
dialogue. In S&#233;minaire lexique en traitement automatique de la parole, p. 137&#8211;145, Toulouse,
France.
DEVILLERS B.-M. H. L. &amp; ROSSET S. (2000). Predictive performance of dialog systems. In
Int. Conf. on Language ResourcesandEvaluation,LREC2000.
ECKERT W., LEVIN E. &amp; PIERACCINI R. (1998). Automatic evaluation of spoken dialogue
systems. TWLT13 : Formal semantics and pragmatics of dialogue.
HASTIE H., PRASAD R. &amp; WALKER M. (2002). What&#8217;s the Trouble : Automatically Identi-
fying Problematic Dialogues in DARPA Communicator Dialogue Systems. In Proceedings of
the ACL 2002.
JURAFSKY D., E. S., B. F. &amp; CURL T. (1998). Lexical, prosodic, and syntactic cues for dialog
acts. In Proceedings of ACL/COLING 98 Workshop on Discourse Relations and Discourse
Markers.
LAMEL L. &amp; ROSSET S. (2000). Considerations in the design and evaluation of spoken
language dialog systems. In ICSLP, 2000.
WALKER M., LITMAN D. J., KAMM C. A. &amp; ABELLA A. (1997). Interactive Spoken Dialog
Systems : Bridging Speech and NLP Together in Real Applications, chapter Evaluating Inter-
active Dialogue Systems : Extending Component Evaluation to Integrated System Evaluation.
Association for Computational Linguistics : New Brunswick, New Jersey.
WALKER M. A., LANGKILDE I., WRIGHT J., GORIN A. &amp; LITMAN D. (2000). Learning to
predict problematic situations in a spoken dialogue system : Experiments with how may i help
you ? In North American Meeting of the Association of Computational Linguistics.
WALKER M. A., LANGKILDE-GEARY I., HASTIE H. W., WRIGHT J. &amp; GORIN A. (2002).
Automatically Training A Problematic Dialog Predictor for the HMOHY Spoken Dialog Sys-
tem. Journal of Artificial Intelligence Research, 16, 293&#8211;319.
WALKER M. A. &amp; PASSONNEAU R. (2001). Date : A dialogue act tagging scheme for evalua-
tion of spoken dialogue systems. In In Proceedings of Human Language Technology Confe-
rence, San Diego.</p>

</div></div>
</body></html>