<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une exp&#233;rience d&#8217;extraction de relations s&#233;mantiques &#224; partir de textes dans le domaine m&#233;dical</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Une exp&#233;rience d&#8217;extraction de relations s&#233;mantiques
&#224; partir de textes dans le domaine m&#233;dical
</p>
<p>Mehdi EMBAREK, Olivier FERRET
CEA LIST, LIC2M,
</p>
<p>18 route du Panorama, BP6, FONTENAY AUX ROSES, F- 92265 France
{embarekm,ferreto}@zoe.cea.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons une m&#233;thode permettant d&#8217;extraire &#224; partir de
textes des relations s&#233;mantiques dans le domaine m&#233;dical en utilisant des patrons linguistiques.
La premi&#232;re partie de cette m&#233;thode consiste &#224; identifier les entit&#233;s entre lesquelles les relations
vis&#233;es interviennent, en l&#8217;occurrence les maladies, les examens, les m&#233;dicaments et les symp-
t&#244;mes. La pr&#233;sence d&#8217;une des relations s&#233;mantiques vis&#233;es dans les phrases contenant un couple
de ces entit&#233;s est ensuite valid&#233;e par l&#8217;application de patrons linguistiques pr&#233;alablement appris
de mani&#232;re automatique &#224; partir d&#8217;un corpus annot&#233;. Nous rendons compte de l&#8217;&#233;valuation de
cette m&#233;thode sur un corpus en Fran&#231;ais pour quatre relations.
Abstract. In this article, we present a method to extract semantic relations automatically
in the medical domain using linguistic patterns. This method consists first in identifying the
entities that are part of the relations to extract, that is to say diseases, exams, treatments, drugs
and symptoms. Thereafter, sentences that contain these entities are extracted and the presence
of a semantic relation is validated by applying linguistic patterns that were automatically learnt
from an annotated corpus. We report the results of an evaluation of our extraction method on a
French corpus for four relations.
Mots-cl&#233;s : extraction de relations s&#233;mantiques, patrons lexico-syntaxiques, domaine
m&#233;dical.
</p>
<p>Keywords: extraction of semantic relations, lexico-syntactic patterns, medical domain.
</p>
<p>1 Introduction
Dans cet article, nous nous int&#233;ressons au domaine m&#233;dical, dont la particularit&#233; est la richesse
et la complexit&#233; de son vocabulaire sp&#233;cialis&#233;. Cette particularit&#233; a conduit depuis de nom-
breuses ann&#233;es au d&#233;veloppement d&#8217;un ensemble important de ressources terminologiques telles
que le MeSH ou l&#8217;UMLS par exemple. Ces ressources ont &#233;t&#233; utilis&#233;es dans des contextes aussi
divers que l&#8217;indexation de documents, la recherche d&#8217;information, l&#8217;extraction d&#8217;information
ou m&#234;me les syst&#232;mes de question-r&#233;ponse. &#192; l&#8217;image de r&#233;seaux lexicaux de m&#234;me type mais
plus g&#233;n&#233;raux, comme WordNet (Fellbaum, 1998), ces ressources contiennent majoritairement
des relations d&#8217;hyperonymie ou de synonymie et sont donc beaucoup moins riches en relations
syntagmatiques comme celles sp&#233;cifiant qu&#8217;une maladieM peut &#234;tre soign&#233;e par le traitement T
ou que l&#8217;examen E permet de diagnostiquer la maladie M. De m&#234;me, les m&#233;thodes ayant pour
</p>
<p>37</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi EMBAREK, Olivier FERRET
</p>
<p>objectif d&#8217;extraire des relations s&#233;mantiques &#224; partir de textes se focalisent majoritairement sur
les relations de synonymie et d&#8217;hyperonymie, &#224; la suite de (Hearst, 1992) ou plus r&#233;cemment de
(Caraballo, 1999).
Le travail dont nous rendons compte dans cet article concerne l&#8217;extraction et la validation de
relations s&#233;mantiques entre des entit&#233;s caract&#233;ristiques du domaine m&#233;dical, telles que des mala-
dies, des m&#233;dicaments ou des examens, en se focalisant prioritairement sur des relations de type
syntagmatique. Diff&#233;rents travaux ont d&#233;j&#224; &#233;t&#233; men&#233;s concernant l&#8217;extraction de relations s&#233;-
mantiques dans le domaine m&#233;dical ou biom&#233;dical, travaux parmi lesquels on peut citer (Craven,
1999), (Mukherjea &amp; Sahay, 2006), (Rosario &amp; Hearst, 2004) ou (Vintar &amp; Buitelaar, 2003).
Les recherches men&#233;es en extraction d&#8217;information dans ce m&#234;me contexte, bien qu&#8217;ayant a
priori une finalit&#233; plus large, se ram&#232;nent dans bon nombre de cas &#224; l&#8217;extraction de ce m&#234;me
type de relations, &#224; l&#8217;instar de la d&#233;tection des interactions entre g&#232;nes ou entre g&#232;nes et pro-
t&#233;ines. On se reportera &#224; (N&#233;dellec, 2004) pour un panorama de ces travaux, souvent fond&#233;s sur
des r&#232;gles d&#8217;extraction d&#233;finies manuellement.
La m&#233;thode que nous proposons repose pour sa part sur l&#8217;identification puis l&#8217;application de
patrons linguistiques caract&#233;risant les relations vis&#233;es, dans le prolongement direct de (Pantel
et al., 2004). Cette application se d&#233;roule en deux &#233;tapes. La premi&#232;re consiste &#224; identifier dans
les textes les entit&#233;s du domaine m&#233;dical intervenant dans les relations vis&#233;es. Dans la phrase
&#171; . . . en novembre 2001, ann&#233;e d&#8217;un cancer de la prostate trait&#233; par radioth&#233;rapie et qu&#8217;il affirme
aujourd&#8217;hui disparu, . . . &#187;, le premier objectif est ainsi de rep&#233;rer que cancer de la prostate est
une maladie et que radioth&#233;rapie est un traitement. Dans un second temps, l&#8217;application du
patron &lt;maladie&gt; trait&#233; par &lt;traitement&gt; construit automatiquement &#224; partir d&#8217;un corpus de
r&#233;f&#233;rence permet de valider la pr&#233;sence d&#8217;une relation entre ces deux entit&#233;s, relation stipulant
dans le cas pr&#233;sent que la radioth&#233;rapie est un traitement possible du cancer de la prostate.
</p>
<p>2 Ontologie du domaine m&#233;dical
La premi&#232;re &#233;tape de notre travail s&#8217;est focalis&#233;e sur la d&#233;finition d&#8217;une ontologie du domaine
de la m&#233;decine g&#233;n&#233;rale permettant de faire appara&#238;tre les entit&#233;s caract&#233;risant ce domaine ainsi
que les relations existant entre ces entit&#233;s. Cette ontologie a &#233;t&#233; d&#233;finie &#224; la fois en sollicitant
directement des m&#233;decins et par l&#8217;analyse des questions typiquement pos&#233;es par des m&#233;decins
g&#233;n&#233;ralistes (Ely et al., 1999). La Figure 1 illustre le sous-ensemble de cette ontologie corres-
</p>
<p>FIG. 1 &#8211; Sous-ensemble de l&#8217;ontologie du domaine m&#233;dical concernant les relations &#224; extraire
</p>
<p>pondant aux quatre relations objets de notre travail et aux entit&#233;s qu&#8217;elles font intervenir. Sont
38</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraire des relations s&#233;mantiques dans le domaine m&#233;dical
</p>
<p>ainsi concern&#233;es les cinq entit&#233;s suivantes : Maladie, Traitement, M&#233;dicament, Sympt&#244;me et
Examen. Parmi toutes les relations de la Figure 1, les quatre relations auxquelles nous nous
sommes attach&#233;s sont :
&#8211; Traite : Maladie &#8211; Traitement
&#8211; Soigne : Maladie &#8211; M&#233;dicament
&#8211; D&#233;tecte : Maladie &#8211; Examen
&#8211; Signe : Maladie &#8211; Sympt&#244;me
</p>
<p>3 Reconnaissance des entit&#233;s m&#233;dicales
L&#8217;identification dans les documents des entit&#233;s m&#233;dicales que nous avons retenues a &#233;t&#233; r&#233;a-
lis&#233;e ind&#233;pendamment de leur nature intrins&#232;que (entit&#233; nomm&#233;e au sens litt&#233;ral ou terme) en
adoptant une approche &#224; base de r&#232;gles m&#234;lant patrons morpho-syntaxiques et listes d&#8217;entit&#233;s
ou d&#8217;&#233;l&#233;ments caract&#233;ristiques de ces entit&#233;s. Ces r&#232;gles ont &#233;t&#233; d&#233;finies manuellement &#224; partir
d&#8217;un travail sur corpus. Nous avons repris en l&#8217;occurrence une des approches classiquement
utilis&#233;es pour identifier des entit&#233;s nomm&#233;es de nature plus g&#233;n&#233;rale comme les personnes, les
organisations ou les lieux. &#192; la diff&#233;rence de ces derni&#232;res, les patrons morpho-syntaxiques ont
ici une importance moindre ce qui &#224; l&#8217;inverse, donne un r&#244;le plus central aux listes d&#8217;entit&#233;s ou
de parties d&#8217;entit&#233;s. Nous avons donc accord&#233; un soin tout particulier &#224; la constitution de ces
listes pour chaque type d&#8217;entit&#233;s en exploitant pour ce faire &#224; la fois des ressources disponibles
sur le Web1 et des dictionnaires de l&#8217;Acad&#233;mie de M&#233;decine sous forme &#233;lectronique.
Chaque r&#232;gle de reconnaissance d&#8217;une entit&#233; est compos&#233;e d&#8217;un d&#233;clencheur, d&#8217;un contexte pr&#233;-
c&#233;dent, d&#8217;un contexte suivant et du type d&#8217;entit&#233; identifi&#233;. Ces r&#232;gles sont impl&#233;ment&#233;es sous la
forme d&#8217;automates. Leur application s&#8217;effectuant &#224; la suite de l&#8217;&#233;tiquetage morpho-syntaxique
r&#233;alis&#233; par l&#8217;analyseur LIMA (LIC2M Multilingual Analyzer) (Besan&#231;on &amp; Chalendar, 2005),
le d&#233;clencheur et les contextes pr&#233;c&#233;dent et suivant d&#8217;une r&#232;gle prennent donc la forme d&#8217;ex-
pressions r&#233;guli&#232;res pouvant porter sur la forme fl&#233;chie, la forme normalis&#233;e ou la cat&#233;gorie
d&#8217;un ou de plusieurs mots. Ainsi, la r&#232;gle
</p>
<p>@AnnonceurMaladie::$L_DET ?::$L_DET ($L_NC|$L_NP)::MALADIE2
d&#233;clencheur::contexte_pr&#233;c&#233;dent::contexte_suivant::type_d&#8217;expression
</p>
<p>permet-elle d&#8217;identifier maladie de Lyme comme une maladie dans &#171; La maladie de Lyme est
une . . . &#187; tandis que la r&#232;gle
</p>
<p>[@AnnonceurSymptome]::::[,] [$L_NC] [$L_DET] $L_NC::SYMPTOME3
</p>
<p>reconna&#238;t fi&#232;vre comme un sympt&#244;me dans &#171; . . . sympt&#244;me, comme la fi&#232;vre . . . &#187;. On peut
noter &#224; cette occasion la pr&#233;sence de r&#233;f&#233;rence &#224; des listes permettant de regrouper des &#233;l&#233;ments
linguistiques ayant un m&#234;me r&#244;le, comme les &#233;l&#233;ments marquant la pr&#233;sence d&#8217;une maladie
(@AnnonceurMaladie={maladie, syndrome . . .}) ou ceux marquant la pr&#233;sence d&#8217;un sympt&#244;me
(@AnnonceurSymptome={signe, sympt&#244;me . . .}).
</p>
<p>1Le site Doctissimo pour les noms de m&#233;dicaments ou le site Orphanet pour les noms de maladies par exemple.
2 ? marque classiquement un &#233;l&#233;ment optionnel tandis que ( | ) note une alternative. $L_DET, $L_NC et
</p>
<p>$L_NP sont des cat&#233;gories morpho-syntaxiques, correspondant respectivement &#224; d&#233;terminant, nom commun et
nom propre.
</p>
<p>3[] permet de sp&#233;cifier la non appartenance d&#8217;un &#233;l&#233;ment &#224; l&#8217;entit&#233; reconnue.
39</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi EMBAREK, Olivier FERRET
</p>
<p>4 Extraction de relations s&#233;mantiques
</p>
<p>4.1 Apprentissage de patrons linguistiques d&#8217;extraction
Le terme de patron linguistique d&#233;signe dans le cas pr&#233;sent un sch&#233;ma lexico-syntaxique sp&#233;-
cifique d&#8217;une relation s&#233;mantique intervenant entre deux entit&#233;s. Dans le cas pr&#233;sent, ces pa-
trons sont dits multi-niveaux, c&#8217;est-&#224;-dire qu&#8217;ils s&#8217;appuient sur des informations provenant de
plusieurs niveaux de traitement des textes : &#224; l&#8217;instar des r&#232;gles de reconnaissance des entit&#233;s
m&#233;dicales, ils peuvent ainsi faire intervenir la forme fl&#233;chie des mots, leur forme normalis&#233;e
ou bien encore leur cat&#233;gorie morpho-syntaxique. Le processus que nous avons &#233;labor&#233; pour
extraire &#224; partir d&#8217;un corpus les patrons linguistiques caract&#233;risant une relation est le suivant :
</p>
<p>1. appliquer sur le corpus consid&#233;r&#233; les r&#232;gles de reconnaissance des entit&#233;s m&#233;dicales im-
pliqu&#233;es dans la relation cible. Nous prendrons &#224; titre d&#8217;exemple la relation Traite entre
une Maladie et un Traitement ;
</p>
<p>2. extraire du corpus toutes les phrases contenant les deux entit&#233;s de la relation cible, &#224; savoir
ici les phrases contenant &#224; la fois une maladie et un traitement ;
</p>
<p>3. s&#233;lectionner manuellement les phrases dans lesquelles la relation entre les deux entit&#233;s
correspond effectivement &#224; la relation cible. Cela implique en particulier d&#8217;&#233;carter les
phrases telles que &#171; la &lt;maladie&gt; n&#8217;est pas trait&#233;e par le &lt;traitement&gt; &#187; ;
</p>
<p>4. r&#233;aliser l&#8217;analyse linguistique de chaque phrase s&#233;lectionn&#233;e pour en faire appara&#238;tre les
diff&#233;rents niveaux d&#8217;information. Cette analyse est r&#233;alis&#233;e comme pour la reconnaissance
des entit&#233;s par l&#8217;analyseur LIMA ;
</p>
<p>5. remplacer dans chaque phrase les entit&#233;s par leur type ;
6. appliquer l&#8217;algorithme d&#8217;extraction de patrons multi-niveaux pr&#233;sent&#233; ci-dessous entre
</p>
<p>chaque couple de phrases parmi celles s&#233;lectionn&#233;es pr&#233;c&#233;demment.
</p>
<p>Pour extraire les patrons linguistiques propres &#224; chaque relation s&#233;mantique trait&#233;e (cf. Sec-
tion 2), nous faisons appel &#224; l&#8217;algorithme propos&#233; par Ravichandran dans (Pantel et al., 2004)
pour apprendre des patrons multi-niveaux. Cet algorithme est compos&#233; de deux parties. La pre-
mi&#232;re consiste &#224; calculer la distance d&#8217;&#233;dition minimale entre deux phrases, ce qui permet de
d&#233;terminer le nombre minimum d&#8217;op&#233;rations (insertion, suppression et remplacement) &#224; ap-
pliquer pour passer d&#8217;une phrase &#224; l&#8217;autre. La deuxi&#232;me &#233;tape extrait le patron multi-niveau le
plus sp&#233;cifique permettant de g&#233;n&#233;raliser les deux phrases. Pour compl&#233;ter certains alignements,
deux op&#233;rateurs sont introduits : (*s*), qui repr&#233;sente 0 ou 1 instance de n&#8217;importe quel mot et
(*g*), qui repr&#233;sente exactement une instance de n&#8217;importe quel mot.
Nous avons appliqu&#233; le processus d&#233;crit plus haut sur une partie du corpus m&#233;dical de la cam-
pagne d&#8217;&#233;valuation des syst&#232;mes de Question/R&#233;ponse EQueR et extrait ainsi des patrons multi-
niveaux pour les quatre relations consid&#233;r&#233;es dans cette &#233;tude. Nous donnons &#224; titre illustratif
quelques exemples de patrons extraits pour chaque relation :
</p>
<p>Maladie &#8211; Examen
&lt;examen&gt; en suspicion de &lt;maladie&gt;
&lt;maladie&gt; &#234;tre (*g*) &#224; le &lt;examen&gt;
&lt;examen&gt; pour le NC_GEN (*g*) &lt;maladie&gt;
&lt;examen&gt; montre un &lt;maladie&gt;
</p>
<p>40</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraire des relations s&#233;mantiques dans le domaine m&#233;dical
</p>
<p>&lt;examen&gt; (*g*) le diagnostic (*g*) &lt;maladie&gt;
&lt;maladie&gt; , (*s*) &lt;examen&gt;
</p>
<p>Maladie &#8211; Traitement
&lt;traitement&gt; dans le traitement des &lt;maladie&gt;
&lt;traitement&gt; &#234;tre (*g*) PREP_GENERAL le traitement de le (*s*) &lt;maladie&gt;
&lt;traitement&gt; est recommand&#233; pour le traitement des &lt;maladie&gt;
&lt;maladie&gt; , (*g*) NC_GEN (*g*) une &lt;traitement&gt;
&lt;maladie&gt; n&#233;cessitant un &lt;traitement&gt;
&lt;traitement&gt; contre le &lt;maladie&gt;
</p>
<p>Maladie &#8211; Sympt&#244;me
&lt;maladie&gt; , se manifeste par une &lt;symptome&gt;
&lt;symptome&gt; (*g*) &#234;tre (*s*) des sympt&#244;mes d&#8217; une &lt;maladie&gt;
&lt;maladie&gt; VERBE_PRINC_INDICATIF (*s*) &lt;symptome&gt;
&lt;symptome&gt; (*s*) peut VERBE_PRINC_INFINIT la NC_GEN de le (*s*) &lt;maladie&gt;
&lt;maladie&gt; (*g*) avec &lt;symptome&gt;
&lt;symptom&gt; ( &lt;maladie&gt;
</p>
<p>Maladie &#8211; M&#233;dicament
&lt;medicament&gt; est indiqu&#233; dans le traitement de la &lt;maladie&gt;
&lt;medicament&gt; , utilis&#233;e (*s*) (*s*) dans le traitement de &lt;maladie&gt;
&lt;medicament&gt; est un m&#233;dicament utilis&#233; pour traiter &lt;maladie&gt;
&lt;maladie&gt; chez les NC_GEN trait&#233; par &lt;medicament&gt;
&lt;medicament&gt; dans le cas de &lt;maladie&gt;
&lt;medicament&gt; ( propos&#233; dans le traitement de (*s*) &lt;maladie&gt;
</p>
<p>4.2 Extraction et validation des relations s&#233;mantiques
</p>
<p>Pour acqu&#233;rir de nouvelles relations s&#233;mantiques &#224; partir d&#8217;un corpus, i.e. de nouveaux couples
d&#8217;entit&#233;s li&#233;es par une relation identifi&#233;e, nous appliquons une d&#233;marche en deux temps. Comme
dans le cas de l&#8217;extraction des patrons de relation, nous commen&#231;ons par s&#233;lectionner des re-
lations candidates en rep&#233;rant les phrases contenant un couple d&#8217;entit&#233;s intervenant dans une
des relations cibles. Dans un second temps, nous confrontons la phrase contenant la relation
candidate avec les patrons linguistiques sp&#233;cifiques de cette relation. Si l&#8217;un au moins de ces
patrons peut s&#8217;appliquer &#224; la phrase consid&#233;r&#233;e, la relation est consid&#233;r&#233;e comme valid&#233;e. Dans
le cas contraire, elle est &#233;cart&#233;e. Plus formellement, le processus mis en &#339;uvre pour un type de
relation est le suivant :
</p>
<p>1. appliquer sur le corpus consid&#233;r&#233; les r&#232;gles de reconnaissance des entit&#233;s m&#233;dicales im-
pliqu&#233;es dans la relation cible ;
</p>
<p>2. extraire du corpus toutes les phrases contenant simultan&#233;ment les deux entit&#233;s de la rela-
tion cible ;
</p>
<p>3. r&#233;aliser l&#8217;analyse linguistique de chaque phrase s&#233;lectionn&#233;e, toujours en utilisant l&#8217;ana-
lyseur LIMA ;
</p>
<p>41</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi EMBAREK, Olivier FERRET
</p>
<p>4. remplacer dans chaque phrase les entit&#233;s par leur type ;
5. pour chaque phrase, calculer sa distance d&#8217;&#233;dition avec tous les patrons multi-niveaux de
</p>
<p>la relation. Si la distance d&#8217;&#233;dition est &#233;gale &#224; 0, c&#8217;est-&#224;-dire si la relation entre les deux
types s&#233;mantiques de la phrase respecte le sch&#233;ma du patron, alors valider la relation.
</p>
<p>Nous avons appliqu&#233; notre algorithme d&#8217;extraction et de validation de relations s&#233;mantiques
pour les quatre relations retenues dans notre &#233;tude sur un corpus de textes m&#233;dicaux recueillis
dans le cadre du projet Technolangue Atonant, corpus diff&#233;rent de celui utilis&#233; pour induire les
patrons de caract&#233;risation de ces relations. Voici quelques exemples de relations s&#233;mantiques
valid&#233;es par notre m&#233;thode (le patron utilis&#233; est introduit par =&#8658;) :
</p>
<p>Maladie &#8211; Examen
tomodensitom&#233;trie dans le diagnostic des tumeurs du m&#233;diastin
=&#8658; &lt;examen&gt; dans le diagnostic (*s*) &lt;maladie&gt;
radiographie pulmonaire pour le diagnostic de tuberculose
=&#8658; &lt;examen&gt; (*g*) le diagnostic (*g*) &lt;maladie&gt;
</p>
<p>Maladie &#8211; M&#233;dicament
insuffisance r&#233;nale chronique trait&#233;e par Eprex
=&#8658; &lt;maladie&gt; trait&#233;e par &lt;medicament&gt;
Le vaccin utilis&#233; pour pr&#233;venir la fi&#232;vre aphteuse
=&#8658; &lt;medicament&gt; utilis&#233; pour VERBE_PRINC_INFINIT (*g*) &lt;maladie&gt;
</p>
<p>Maladie &#8211; Traitement
chimioprophylaxie contre la malaria
=&#8658; &lt;traitement&gt; contre la &lt;maladie&gt;
radioth&#233;rapie dans le traitement de la rest&#233;nose
=&#8658; &lt;traitement&gt; dans le traitement de la &lt;maladie&gt;
</p>
<p>Maladie &#8211; Sympt&#244;me
L&#8217;intoxication peut provoquer des vomissements
=&#8658; &lt;maladie&gt; (*s*) peut VERBE_PRINC_INFINIT DET_ART_CONTRACT (*s*) &lt;symptome&gt;
Botulisme , se manifeste par une s&#233;cheresse de la bouche.
=&#8658; &lt;maladie&gt;, se manifeste (*s*) par une &lt;symptome&gt;
</p>
<p>5 &#201;valuation
Dans cette section, nous pr&#233;sentons les r&#233;sultats des &#233;valuations men&#233;es sur deux corpus en
fran&#231;ais, constitu&#233;s chacun d&#8217;articles scientifiques et de recommandations de bonne pratique
m&#233;dicale t&#233;l&#233;charg&#233;es &#224; partir du site du CISMeF4. La premi&#232;re (cf. Table 1) concerne l&#8217;identi-
fication des entit&#233;s m&#233;dicales dans les textes en appliquant les r&#232;gles de reconnaissance pr&#233;sen-
t&#233;es &#224; la Section 3. La seconde (cf. Table 2) porte sur l&#8217;extraction et la validation de relations
s&#233;mantiques gr&#226;ce &#224; la m&#233;thode pr&#233;sent&#233;e &#224; la Section 4.2.
</p>
<p>La Table 1 r&#233;sume les r&#233;sultats obtenus en appliquant nos r&#232;gles de reconnaissance d&#8217;entit&#233;s
4Catalogue et Index des Sites M&#233;dicaux Francophones : http://www.cismef.org
</p>
<p>42</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraire des relations s&#233;mantiques dans le domaine m&#233;dical
</p>
<p>m&#233;dicales sur un sous-ensemble d&#8217;une taille de 1,5 Mo (soit environ 130.000 mots) du cor-
pus m&#233;dical de la campagne d&#8217;&#233;valuation EQueR. Les mesures utilis&#233;es sont classiquement la
pr&#233;cision et le rappel, qui se d&#233;finissent ici de la fa&#231;on suivante :
&#8211; la pr&#233;cision repr&#233;sente le nombre d&#8217;entit&#233;s correctes extraites par notre syst&#232;me sur le nombre
</p>
<p>total des entit&#233;s extraites par notre syst&#232;me ;
&#8211; le rappel repr&#233;sente le nombre d&#8217;entit&#233;s correctes extraites par notre syst&#232;me sur le nombre
</p>
<p>total des entit&#233;s pr&#233;sentes dans le corpus.
La F1-mesure correspond &#224; la moyenne harmonique entre la pr&#233;cision et le rappel. Ces mesures
sont r&#233;alis&#233;es par comparaison avec une annotation manuelle du corpus d&#8217;&#233;valuation. Les r&#233;sul-
</p>
<p>Entit&#233;s s&#233;mantiques Pr&#233;cision Rappel F1-mesure
Maladie 0,95 0,80 0,86
</p>
<p>Sympt&#244;me 0,84 0,76 0,79
Examen 0,94 0,93 0,93
</p>
<p>Traitement 0,86 0,81 0,83
M&#233;dicament 0,93 0,88 0,90
Moyenne 0,90 0,84 0,86
</p>
<p>TAB. 1 &#8211; R&#233;sultats de la reconnaissance des entit&#233;s m&#233;dicales
</p>
<p>tats de notre m&#233;thode donn&#233;s par la Table 1 montrent une pr&#233;cision et un rappel sup&#233;rieurs ou
&#233;gaux &#224; 83% en moyenne, ce qui constitue un bon niveau pour ce type de t&#226;che. On peut noter
en particulier le niveau &#233;lev&#233; de la pr&#233;cision qui caract&#233;rise un niveau de fiabilit&#233; tr&#232;s significa-
tif. Cette propri&#233;t&#233; est d&#8217;autant plus importante dans le cas pr&#233;sent que la d&#233;tection des entit&#233;s
sert ensuite de point de d&#233;part &#224; l&#8217;extraction des relations. Le rappel pourrait quant &#224; lui &#234;tre
am&#233;lior&#233; en &#233;tant plus exhaustif dans les listes d&#8217;entit&#233;s constitu&#233;es.
</p>
<p>Concernant l&#8217;extraction et la validation des relations s&#233;mantiques, nous avons appliqu&#233; la m&#233;-
thode pr&#233;sent&#233;e &#224; la Section 4.2 sur 65 Mo du corpus utilis&#233; dans le cadre du projet Techno-
langue Atonant, soit environ 10 millions de mots. Les patrons d&#8217;extraction appliqu&#233;s avaient &#233;t&#233;
pr&#233;alablement appris &#224; partir de la totalit&#233; du corpus m&#233;dical EQueR, soit environ 16 millions de
mots. Contrairement au cas des entit&#233;s, l&#8217;annotation manuelle de r&#233;f&#233;rence n&#8217;a pas &#233;t&#233; r&#233;alis&#233;e
en parcourant tout le corpus mais en jugeant de la pr&#233;sence effective d&#8217;une des quatre relations
cibles parmi les phrases abritant des relations candidates, c&#8217;est-&#224;-dire les phrases contenant au
moins deux entit&#233;s compatibles avec des relations cibles. Par cons&#233;quent, seule la validation des
relations candidates est &#233;valu&#233;e ici. Pour les mesures d&#8217;&#233;valuation, nous avons &#224; nouveau fait
appel &#224; la pr&#233;cision et au rappel, d&#233;finis comme suit :
&#8211; la pr&#233;cision repr&#233;sente le nombre de relations valid&#233;es correctes sur le nombre total des rela-
</p>
<p>tions valid&#233;es par notre syst&#232;me ;
&#8211; le rappel repr&#233;sente le nombre de relations valid&#233;es correctes par notre syst&#232;me sur le nombre
</p>
<p>total de relations annot&#233;es dans le corpus.
Comme dans le cas de la reconnaissance des entit&#233;s, la validation des relations extraites se ca-
ract&#233;rise par une forte pr&#233;cision et un rappel un peu moins &#233;lev&#233;. La diff&#233;rence entre pr&#233;cision
et rappel est d&#8217;ailleurs plus accentu&#233;e dans ce cas que pour la reconnaissance des entit&#233;s, un
peu du fait d&#8217;une pr&#233;cision moyenne l&#233;g&#232;rement plus forte mais surtout par un rappel notable-
ment moins &#233;lev&#233;. On peut donc dire que les relations produites par la m&#233;thode que nous avons
propos&#233;e sont globalement d&#8217;une bonne fiabilit&#233; mais que les patrons linguistiques appris sur
le corpus m&#233;dical EQueR ne couvrent pas toutes les formes par lesquelles les relations cibles
</p>
<p>43</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi EMBAREK, Olivier FERRET
</p>
<p>Relations Pr&#233;cision Rappel F1-mesure
Maladie&#8211;Examen 0,92 0,63 0,74
</p>
<p>Maladie&#8211;M&#233;dicament 0,91 0,59 0,71
Maladie&#8211;Traitement 0,92 0,69 0,78
Maladie&#8211;Sympt&#244;me 0,90 0,65 0,75
</p>
<p>Moyenne 0,91 0,64 0,75
</p>
<p>TAB. 2 &#8211; R&#233;sultats de la validation des relations s&#233;mantiques
</p>
<p>se manifestent dans le corpus Atonant. La comparaison avec d&#8217;autres travaux est quant &#224; elle
difficile du fait de la diversit&#233; des types de relations consid&#233;r&#233;s, des corpus et des approches
adopt&#233;es. N&#233;anmoins, il est possible de donner quelques &#233;l&#233;ments de situation. En utilisant des
patrons linguistiques &#233;labor&#233;s manuellement pour caract&#233;riser des relations d&#8217;inhibition dans
des phrases extraites de Medline, (Pustejovsky et al., 2002) obtient ainsi une pr&#233;cision de 94%
et un rappel de 58,9%. La Table 2 montre que nous obtenons des r&#233;sultats globalement com-
parables en construisant ces patrons linguistiques de mani&#232;re automatique. Le processus de
validation des relations extraites peut &#233;galement &#234;tre envisag&#233; sous l&#8217;angle de la classification :
une relation candidate est alors class&#233;e comme pertinente ou non pertinente. C&#8217;est l&#8217;approche
retenue par (Craven, 1999) ou par (Rosario &amp; Hearst, 2004). En utilisant un classifieur bay&#233;sien
na&#239;f sur des relations candidates de type subcellular&#8211;location extraites de Medline, (Craven,
1999) fait &#233;tat d&#8217;une pr&#233;cision de 78% et d&#8217;un rappel de 32%. Dans le cas de (Rosario &amp;
Hearst, 2004), le classifieur n&#8217;est plus seulement binaire. Il s&#8217;agit en effet de discriminer les
relations intervenant entre un traitement et une maladie : 8 relations sont ainsi distingu&#233;es qui
recouvrent la relation Traite &#224; laquelle nous nous sommes attach&#233;s mais &#233;galement des relations
exprimant qu&#8217;un traitement peut pr&#233;venir une maladie ou qu&#8217;une maladie est un effet secondaire
d&#8217;un traitement. (Rosario &amp; Hearst, 2004) rapporte les &#233;valuations men&#233;es avec plusieurs types
de classifieurs et obtient les meilleurs r&#233;sultats avec un r&#233;seau de neurones, la pr&#233;cision &#233;tant
alors de 96,9%. Il est &#224; noter que ce travail s&#8217;appuie sur des ressources plus &#233;tendues que le
n&#244;tre puisqu&#8217;il fait appel &#224; un analyseur syntaxique de surface et qu&#8217;il exploite &#233;galement la
ressource s&#233;mantique que constitue le MeSH.
</p>
<p>6 Discussion
</p>
<p>La m&#233;thodologie propos&#233;e pour l&#8217;extraction de relations s&#233;mantiques dans le domaine m&#233;di-
cal repose sur l&#8217;identification des entit&#233;s du domaine puis la validation de relations candidates
extraites sur la base de la cooccurrence de ces entit&#233;s en utilisant des patrons linguistiques.
L&#8217;utilisation de sch&#233;mas lexico-syntaxiques pour l&#8217;extraction de relations s&#233;mantiques a d&#233;j&#224;
fait l&#8217;objet de nombreux travaux. Hearst (Hearst, 1992) est l&#8217;une des premi&#232;res &#224; avoir propos&#233;
une approche fond&#233;e sur des patrons pour extraire des relations d&#8217;hyperonymie. Cependant, sa
m&#233;thode, qui consiste &#224; extraire un environnement commun &#224; un ensemble de phrases, &#233;tait es-
sentiellement manuelle. Cette approche a &#233;t&#233; reprise et compl&#233;t&#233;e par d&#8217;autres travaux, toujours
dans le domaine de l&#8217;extraction de relations s&#233;mantiques, dans le but notamment d&#8217;automa-
tiser l&#8217;extraction des patrons. La m&#233;thode d&#233;velopp&#233;e par Ravichandran (Pantel et al., 2004)
dont nous nous sommes inspir&#233;s se situe pr&#233;cis&#233;ment dans cette perspective. Cette d&#233;marche
s&#8217;est &#233;galement av&#233;r&#233;e particuli&#232;rement productive dans des domaines de sp&#233;cialit&#233; comme en
</p>
<p>44</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraire des relations s&#233;mantiques dans le domaine m&#233;dical
</p>
<p>attestent par exemple les travaux rapport&#233;s dans (Finkelstein-Landau &amp; Morin, 1999) ou (S&#233;-
gu&#233;la, 1999), qui se sont focalis&#233;s sur des textes techniques.
</p>
<p>Bien que se situant dans le droit fil de tous ces travaux, la m&#233;thode que nous avons expos&#233;e
ici s&#8217;en diff&#233;rencie par le mode d&#8217;application des patrons linguistiques induits. Au lieu de les
appliquer &#224; la mani&#232;re d&#8217;expressions r&#233;guli&#232;res, nous calculons une distance entre le patron et
la phrase abritant une relation candidate. Cette fa&#231;on de faire autorise une plus grande souplesse
dans l&#8217;application des patrons et permet &#233;galement d&#8217;avoir le m&#234;me mode de fonctionnement
lorsque les relations sont caract&#233;ris&#233;es par des patrons, comme c&#8217;est le cas ici, et lorsqu&#8217;elles
sont caract&#233;ris&#233;es par des exemples, comme dans une approche de type Memory-Based Lear-
ning. On peut m&#234;me envisager ainsi de m&#234;ler les deux approches.
</p>
<p>Une autre diff&#233;rence notable avec les travaux tels que (Pantel et al., 2004) est que les r&#233;sultats
de la Section 5 ont &#233;t&#233; obtenus sans utilisation d&#8217;un filtrage a posteriori des relations extraites.
En d&#233;pit de cette absence, la pr&#233;cision se situe &#224; un haut niveau sans que le rappel ne soit
trop faible. Plusieurs explications compl&#233;mentaires peuvent &#234;tre avanc&#233;es. Tout d&#8217;abord, cette
extraction intervient dans un domaine sp&#233;cialis&#233; et se focalise sur des relations intervenant entre
des entit&#233;s sp&#233;cifiques &#224; ce domaine. Ensuite, les relations sont de type syntagmatique et non
paradigmatique comme dans (Pantel et al., 2004). Enfin, les patrons linguistiques appris restent
assez sp&#233;cialis&#233;s puisqu&#8217;ils ne sont issus que de la g&#233;n&#233;ralisation de couples d&#8217;exemples.
</p>
<p>7 Conclusion et perspectives
Dans cet article, nous avons propos&#233; une m&#233;thode d&#8217;extraction de relations s&#233;mantiques inter-
venant entre des entit&#233;s du domaine m&#233;dical. Cette m&#233;thode utilise des patrons linguistiques
multi-niveaux pour valider des relations s&#233;mantiques candidates extraites des textes. Ces pa-
trons sont appris automatiquement &#224; partir de textes annot&#233;s en s&#8217;appuyant sur une notion de
distance d&#8217;&#233;dition &#233;tendue.
</p>
<p>La m&#233;thode propos&#233;e ici a montr&#233; des r&#233;sultats encourageants en regard des travaux compa-
rables existants. L&#8217;axe principal d&#8217;am&#233;lioration doit porter sur le rappel. Les &#233;valuations rela-
tives &#224; la validation des relations ont montr&#233; que les patrons linguistiques appris ne couvrent
pas toutes les manifestations des relations cibles. En outre, &#233;tant r&#233;alis&#233;es seulement &#224; partir
des phrases extraites et non de toutes les phrases du corpus d&#8217;&#233;valuation du fait de la taille de
ce dernier, elles masquent le d&#233;ficit de rappel r&#233;sultant de l&#8217;absence de reconnaissance des en-
tit&#233;s m&#233;dicales d&#233;clenchant le processus d&#8217;extraction. M&#234;me si le niveau de reconnaissance de
ces entit&#233;s peut &#234;tre consid&#233;r&#233; comme bon, la n&#233;cessit&#233; de reconna&#238;tre les deux entit&#233;s d&#8217;une
relation amplifie l&#8217;impact de leur &#233;ventuelle mauvaise reconnaissance.
</p>
<p>Pour am&#233;liorer &#224; la fois la couverture des patrons linguistiques et la reconnaissance des enti-
t&#233;s m&#233;dicales, nous envisageons d&#8217;adopter une d&#233;marche it&#233;rative classiquement utilis&#233;e dans
un tel cas : au lieu de limiter l&#8217;usage des patrons linguistiques &#224; la seule validation des rela-
tions extraites, il est aussi possible de les utiliser pour extraire de nouvelles entit&#233;s en ne fixant
qu&#8217;une seule des entit&#233;s d&#8217;une relation. Ces nouvelles entit&#233;s viennent &#224; leur tour enrichir la
reconnaissance des entit&#233;s m&#233;dicales et peuvent ainsi servir &#224; acqu&#233;rir de nouveaux patrons lin-
guistiques. Une autre voie d&#8217;am&#233;lioration du rappel est l&#8217;utilisation des ressources s&#233;mantiques
existant dans le domaine m&#233;dical, comme le th&#233;saurus MeSH ou le m&#233;ta-th&#233;saurus UMLS. Il
</p>
<p>45</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi EMBAREK, Olivier FERRET
</p>
<p>serait ainsi possible d&#8217;inclure la v&#233;rification de relations s&#233;mantiques telles que l&#8217;hyperonymie
dans la distance d&#8217;&#233;dition &#233;tendue permettant &#224; la fois de construire les patrons linguistiques
et de les appliquer. Enfin, parmi les extensions envisag&#233;es de ce travail figure &#233;galement une
extension de la couverture des relations de notre ontologie m&#233;dicale, dont la Figure 1 ne montre
qu&#8217;une partie. Nous nous sommes limit&#233;s pour le moment &#224; quatre relations mais les principes
test&#233;s peuvent tout &#224; fait &#234;tre appliqu&#233;s aux autres relations de cette ontologie.
</p>
<p>R&#233;f&#233;rences
BESAN&#199;ON R. &amp; CHALENDAR G. D. (2005). L&#8217;analyseur syntaxique de LIMA dans la cam-
pagne d&#8217;&#233;valuation EASY. In M. JARDINO, Ed., Actes de TALN 2005 (Traitement automatique
des langues naturelles), p. 21&#8211;24, Dourdan : ATALA LIMSI.
CARABALLO S. A. (1999). Automatic acquisition of a hypernym-labeled noun hierarchy from
text. In 37th Annual Meeting of the Association for Computational Linguistics (ACL&#8217;99), p.
120&#8211;126.
CRAVEN M. (1999). Learning to extract relations from medline. In AAAI-99 Workshop on
Machine Learning for Information Extraction, Orlando, Florida, USA.
ELY J., OSHEROFF J., EBELL M., BERGUS G., LEVY B., CHAMBLISS M. &amp; EVANS E.
(1999). Analysis of questions asked by family doctors regarding patient care. BMJ, 319,
358&#8211;361.
C. FELLBAUM, Ed. (1998). WordNet : An Electronic Lexical Database. The MIT Press.
FINKELSTEIN-LANDAU M. &amp; MORIN E. (1999). Extracting semantic relationships between
terms : Supervised vs. unsupervised methods. In International Workshop on Ontological En-
gineering on the Global Information Infrastructure, p. 71&#8211;80.
HEARST M. (1992). Automatic aquisition of hyponyms from large text corpora. In 14th
International Conference on Computational Linguistics (COLING&#8217;92), Nantes, France.
MUKHERJEA S. &amp; SAHAY S. (2006). Discovering biomedical relations utilizing the world
wide web. In Pacific Symposium on Biocomputing 11, p. 164&#8211;175.
N&#201;DELLEC C. (2004). Machine Learning for Information Extraction in Genomics - State of
the art and perspectives. In S. SIRMAKESSIS, Ed., Text Mining and its Applications : Results
of the NEMIS Launch Conference. Springer Verlag.
PANTEL P., RAVICHANDRAN D. &amp; HOVY E. (2004). Towards terascale knowledge acqui-
sition. In International Conference on Computational Linguistics (COLING&#8217;04), p. 771&#8211;777,
Geneva, Switzerland.
PUSTEJOVSKY J., CASTANO J. &amp; ZHANG J. (2002). Robust relational parsing over biome-
dical literature : Extract inhibit relations. In PSB 2002, p. 362&#8211;373.
ROSARIO B. &amp; HEARST M. (2004). Classifying semantic relations in bioscience texts. In
42th Annual Conference of the Association for Computational Linguistics (ACL&#8217;04).
S&#201;GU&#201;LA P. (1999). Extraction de relations s&#233;mantiques entre termes et enrichissement de
mod&#232;les du domaine. In Actes de la conf&#233;rence Ing&#233;nierie des Connaissances (IC&#8217;99), p.
79&#8211;88, Palaiseau.
VINTAR S. &amp; BUITELAAR P. (2003). Semantic relations in concept-based cross-language
medical information retrieval. In ECML/PKDD Workshop on Adaptive Text Extraction and
Mining (ATEM), Germany.
</p>
<p>46</p>

</div></div>
</body></html>