<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Pr&#233;sentation du logiciel Antidote RX</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p> Pr&#233;sentation du logiciel Antidote RX
</p>
<p>&#201;ric BRUNELLE, Simon CHAREST
Druide informatique inc. 
</p>
<p>1435, rue St-Alexandre, bureau 1040 
Montr&#233;al (Qu&#233;bec) H3A 2G4, Canada 
developpement@druide.com
</p>
<p>Antidote RX est la sixi&#232;me &#233;dition d&#8217;Antidote, un logiciel d&#8217;aide &#224; la r&#233;daction d&#233;velopp&#233; et 
commercialis&#233; par la soci&#233;t&#233; Druide informatique. Antidote RX comporte un correcteur 
grammatical avanc&#233;, dix dictionnaires de consultation et dix guides linguistiques. Il 
fonctionne sous les syst&#232;mes d&#8217;exploitation Windows, Mac OS X et Linux. 
</p>
<p>1 Correcteur
Fond&#233; sur un analyseur en d&#233;pendances, le correcteur d&#8217;Antidote transforme les r&#233;sultats de 
son analyse en diagnostics utilisables par le grand public. Il propose des corrections 
d&#8217;orthographe, de syntaxe, d&#8217;accords grammaticaux, de conformit&#233; &#224; l&#8217;usage, et plusieurs 
autres. Antidote RX corrige aussi certaines erreurs de nature s&#233;mantique, comme *perp&#233;trer
la tradition, qui ne peuvent &#234;tre rep&#233;r&#233;es par la seule analyse syntaxique. 
</p>
<p>Figure 1 : le correcteur d&#8217;Antidote RX offre plus de 1 000 cas de d&#233;tection et 25 000 corrections s&#233;mantiques. 
</p>
<p>2 Prismes de r&#233;vision et d&#8217;inspection 
En s&#8217;appuyant sur les r&#233;sultats de l&#8217;analyse linguistique, le prisme de r&#233;vision offre 32 filtres 
qui illustrent visuellement certains aspects pragmatiques (Qui, Quand, O&#249;, Combien), 
logiques (charni&#232;res, citations), stylistiques (r&#233;p&#233;titions, verbes ternes, tournures passives et 
</p>
<p>315</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;ric BRUNELLE, Simon CHAREST
</p>
<p>n&#233;gatives) et s&#233;mantiques (positif, n&#233;gatif, fort, faible) d&#8217;un texte. Le prisme d&#8217;inspection, de 
son c&#244;t&#233;, en r&#233;v&#232;le les &#233;l&#233;ments constitutifs : cat&#233;gories, groupes, fonctions et autres. En 
soumettant son texte &#224; la correction puis aux filtres des prismes, l&#8217;utilisateur dispose d&#8217;une 
panoplie in&#233;dite d&#8217;outils pour l&#8217;examiner, le corriger, le r&#233;viser et le raffiner en profondeur.  
</p>
<p>Figure 2 : le filtre des r&#233;p&#233;titions surligne les redites potentielles. 
</p>
<p>3 Dictionnaires
Antidote RX propose dix grands dictionnaires du fran&#231;ais en une interface unifi&#233;e de 
consultation et de pr&#233;sentation. Des d&#233;finitions aux synonymes, des cooccurrences aux 
analogies, les dictionnaires d&#8217;Antidote offrent une r&#233;f&#233;rence lexicale d&#8217;une richesse, d&#8217;une 
vari&#233;t&#233; et d&#8217;une coh&#233;sion fort int&#233;ressantes. 
</p>
<p>Le dictionnaire de cooccurrences est une nouveaut&#233; de l&#8217;&#233;dition RX. Il a &#233;t&#233; constitu&#233; 
essentiellement automatiquement &#224; partir d&#8217;un corpus de 500 millions de mots. L&#8217;analyseur 
syntaxique d&#8217;Antidote a &#233;t&#233; mis &#224; contribution pour recenser plus de 17 millions de paires de 
mots li&#233;es par diverses relations syntaxiques. Les cooccurrences les plus significatives ont &#233;t&#233; 
d&#233;gag&#233;es &#224; l&#8217;aide d&#8217;un filtre statistique et d&#8217;une r&#233;vision manuelle. Le r&#233;sultat est un 
dictionnaire de 800 000 cooccurrences illustr&#233;es par plus de 2 millions de phrases exemples 
tir&#233;es du corpus. &#192; notre connaissance, il s&#8217;agit du plus vaste dictionnaire de cooccurrences 
du fran&#231;ais &#224; ce jour. 
</p>
<p>316</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pr&#233;sentation du logiciel Antidote RX 
</p>
<p>Figure 3 : le dictionnaire de cooccurrences compte 800 000 cooccurrences illustr&#233;es par plus de 2 millions de 
phrases exemples. 
</p>
<p>4 Guides linguistiques 
L&#8217;utilisateur humain se contente rarement des diagnostics de la machine. Pour &#233;clairer ses 
raisonnements, Antidote pr&#233;sente dix guides linguistiques totalisant 600 articles et couvrant 
tous les sujets pertinents &#224; l&#8217;&#233;criture du fran&#231;ais. Lorsque le correcteur signale une erreur, il 
ouvre directement l&#8217;article correspondant pour que l&#8217;utilisateur puisse juger de la pertinence 
de sa d&#233;tection. 
</p>
<p>Figure 4 : le guide de grammaire explique les r&#232;gles de l&#8217;orthographe grammaticale. 
</p>
<p>317</p>

</div></div>
</body></html>