<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Le CNRTL, Centre National de Ressources Textuelles et Lexicales, un outil de mutualisation de ressources linguistiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Le CNRTL, Centre National de Ressources Textuelles et 
Lexicales, un outil de mutualisation de ressources linguistiques
</p>
<p>Jean-Marie PIERREL, Etienne PETITJEAN
CNRTL/ATILF CNRS &#8211; Nancy Universit&#233; 
</p>
<p>44 avenue de la Lib&#233;ration, BP 30687, 54063 Nancy CEDEX 
{Jean-Marie.Pierrel,Etienne.Petitjean}@atilf.fr
</p>
<p>R&#233;sum&#233;. Cr&#233;&#233; en 2005 &#224; l&#8217;initiative du Centre National de la Recherche Scientifique, le 
CNRTL propose une plate-forme unifi&#233;e pour l&#8217;acc&#232;s aux ressources et documents 
&#233;lectroniques destin&#233;s &#224; l&#8217;&#233;tude et l&#8217;analyse de la langue fran&#231;aise. Les services du CNRTL 
comprennent le recensement, la documentation (m&#233;tadonn&#233;es), la normalisation, l&#8217;archivage, 
l&#8217;enrichissement et la diffusion des ressources. La p&#233;rennit&#233; du service et des donn&#233;es est 
garantie par le soutien institutionnel du CNRS, l&#8217;adossement &#224; un laboratoire de recherche en 
linguistique et informatique du CNRS et de Nancy Universit&#233; (ATILF &#8211; Analyse et 
Traitement Informatique de la Langue Fran&#231;aise), ainsi que l&#8217;int&#233;gration dans le r&#233;seau 
europ&#233;en CLARIN (common language resources and technology infrastructure european).  
</p>
<p>1 Les missions du CNRTL 
Les missions du CNRTL (www.cnrtl.fr) mis en place par le CNRS, D&#233;partement Sciences de 
l&#8217;Homme et de la Soci&#233;t&#233; et Direction de l&#8217;Information Scientifique, au sein de l&#8217;ATILF 
peuvent se r&#233;sumer en sept points :  
- &#171; Entr&#233;es &#187; : acceptation, contr&#244;le et validation des ressources, tant d&#8217;un point de vue 
</p>
<p>scientifique que technique, afin d&#8217;assurer la qualit&#233; des ressources (corpus dictionnaires, 
lexiques et outils de traitement) offertes par le centre ;  
</p>
<p>- &#171; Stockage &#187; : stockage, maintenance et r&#233;cup&#233;ration des ressources. Beaucoup de 
chercheurs et d&#8217;&#233;quipes en SHS qui d&#233;veloppent pour leurs recherches propres des 
ressources informatis&#233;es ne disposent en effet pas des moyens n&#233;cessaires pour assurer 
cette fonction ; 
</p>
<p>- &#171; Gestion des ressources &#187; : partage, conservation et enrichissement de ressources, afin 
d&#8217;assurer une r&#233;elle mutualisation entre &#233;quipes de recherche ; 
</p>
<p>- &#171; Administration &#187; : administration des ressources et aide aux utilisateurs ; 
- &#171; P&#233;rennisation et documentation &#187; : mise &#224; jour et &#233;volution des supports informatiques. 
</p>
<p>L&#8217;&#233;volution des mat&#233;riels et logiciels informatiques n&#233;cessite une maintenance r&#233;guli&#232;re 
de telles ressources informatis&#233;es pour &#233;viter des g&#226;chis que nous avons pu conna&#238;tre dans 
le pass&#233; o&#249; certains corpus ont &#233;t&#233; perdus par manque de maintenance et de 
p&#233;rennisation ; 
</p>
<p>- &#171; Acc&#232;s &#187; : aide et r&#233;ponse aux utilisateurs permettant aux non sp&#233;cialistes de 
l&#8217;informatique que sont les chercheurs en SHS d&#8217;acc&#233;der et d&#8217;exploiter au mieux de telles 
ressources informatis&#233;es &#224; travers des outils adapt&#233;s &#224; leurs besoins ; 
</p>
<p>- &#171; Formation &#187; : formation des producteurs et utilisateurs aux m&#233;thodologies d&#8217;annotation, 
de codage et de normalisation. Sur ce point fort du fait que Nancy est centre support de la 
TEI, on s&#8217;appuie autant que faire se peut sur les recommandations de la TEI. 
</p>
<p>327</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Marie PIERREL, Etienne PETITJEAN
</p>
<p>2 Le CNRTL n&#339;ud d&#8217;un r&#233;seau international europ&#233;en 
Au-del&#224; de sa seule mission nationale, le CNRTL participe au r&#233;seau europ&#233;en CLARIN 
(Common Language Resource and Technologie Infrastructure : http://www.mpi.nl/clarin)  des 
centres de gestion de ressources linguistiques qui correspond &#224; l&#8217;une des propositions 
europ&#233;ennes d&#8217;infrastructure de recherche en SHS incluse dans la feuille de route ESFRI qui 
d&#233;finit les infrastructures de recherches &#224; soutenir dans le cadre du 7&#232;me programme-cadre. 
Elle vise &#224; d&#233;finir une infrastructure europ&#233;enne partag&#233;e par les grands centres de recherche 
europ&#233;ens et s&#8217;appuyant sur des centres r&#233;gionaux &#171; certifi&#233;s &#187; dans leurs domaines respectifs.  
Ce projet est &#233;galement l&#8217;occasion d&#8217;organiser une r&#233;flexion commune sur la gestion d&#8217;une 
plate-forme ouverte de gestion et d&#8217;archivage de documents num&#233;riques avec nos coll&#232;gues 
du Max Planck Institute qui travaillent actuellement sur le m&#234;me sujet. Dans l&#8217;id&#233;al, cette 
collaboration permettra de converger vers une plate-forme logicielle unique utilisable par le 
CNRTL comme par le MPI. Cette plate-forme logicielle pourrait s&#8217;articuler autour de Fedora 
(http://www.fedora.info/) qui est un projet open-source offrant une architecture flexible pour 
la gestion et la distribution de documents num&#233;riques. D&#233;velopp&#233; conjointement par 
l&#8217;universit&#233; de Virginie et l&#8217;universit&#233; de Cornell, ce syst&#232;me semble offrir les bases dont 
nous avons besoin pour d&#233;velopper cette plate-forme, &#224; savoir :  
- Le d&#233;p&#244;t de ressources : permettre &#224; un utilisateur de pouvoir soumettre une ou plusieurs 
</p>
<p>ressources num&#233;riques (texte brut ou &#233;tiquet&#233; morpho-syntaxiquement, etc.) 
- La consultation des ressources : offrir aux utilisateurs une interface de consultation 
</p>
<p>permettant la navigation et la s&#233;lection des diff&#233;rents corpus et ressources disponibles sur 
la plateforme. 
</p>
<p>- Le t&#233;l&#233;chargement des ressources : faciliter le t&#233;l&#233;chargement des ressources s&#233;lectionn&#233;es 
dans le format de sortie souhait&#233; par les utilisateurs (XML, PDF, Word, HTML, etc.) 
</p>
<p>3 Les ressources accessibles au sein du CNRTL 
Le CNRTL s&#8217;est structur&#233; autour de cinq p&#244;les de comp&#233;tence : un portail lexical sur le 
fran&#231;ais ; des corpus et donn&#233;es textuelles, annot&#233;s ou non ; des 
dictionnaires encyclop&#233;diques et linguistiques (anciens et modernes) ; des 
lexiques phon&#233;tiques, morphologiques, syntaxiques, s&#233;mantiques ; des outils 
linguistiques (&#233;tiqueteurs, analyseurs, aligneurs, concordances, outils d&#8217;annotation).Afin de 
proposer une premi&#232;re offre de ressources au sein du CNRTL, nous avons travaill&#233; dans un 
premier temps sur la base des ressources linguistiques informatis&#233;es actuellement disponibles 
&#224; Nancy, ressources qui, suivant les cas, sont des ressources libres et t&#233;l&#233;chargeables apr&#232;s 
acceptation d&#8217;une licence de type ressources libres, des ressources sous droits accessibles 
uniquement via une interface web sp&#233;cifique, ressources sous droits accessibles uniquement 
dans le cadre d&#8217;une convention de partenariat avec les ayants droits. Parmi les ressources d&#233;j&#224; 
int&#233;gr&#233;es au CNRTL, outre les outils et le portail lexical sur lesquels nous allons reveni, il 
convient de noter :
Les corpus de textes libres de droit d&#8217;auteur et d&#8217;&#233;diteur (dans un premier temps 500 textes 
issus de FRANTEXT) : &#224; travers une s&#233;lection par auteurs, titres, dates ou genres, nous offrons 
la possibilit&#233; de t&#233;l&#233;charger les textes s&#233;lectionn&#233;s au format XML dans une DTD respectant 
les recommandations de la TEI : l&#8217;utilisateur r&#233;cup&#232;re une archive contenant la DTD et le 
codage XML/TEI des textes (&#224; notre connaissance, le CNRTL est le premier site offrant un 
ensemble de corpus fran&#231;ais t&#233;l&#233;chargeables et normalis&#233;s XML/TEI d&#8217;environ 150 millions 
de caract&#232;res) ; et un corpus annot&#233; pour le traitement des DEscriptions DEfinies (DEDE : 
coop&#233;ration LORIA, Metadif et ATILF).
</p>
<p>328</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le CNRTL, un outil de mutualisation de ressources linguistique 
</p>
<p>Le lexique Morphalou en acc&#232;s libre tant en consultation qu&#8217;en t&#233;l&#233;chargement : lexique 
ouvert des formes fl&#233;chies du fran&#231;ais qui fournit 524 725 formes fl&#233;chies, appartenant &#224; 95 
810 lemmes, linguistiquement valides (responsabilit&#233; d'un comit&#233; &#233;ditorial) et respectant les 
propositions de normalisation pour les ressources lexicales de l'ISO (TC37/SC4). 
Des dictionnaires tant modernes qu&#8217;anciens : outre l&#8217;acc&#232;s &#224; la version &#233;lectronique du Tr&#233;sor 
de la Langue Fran&#231;aise, dictionnaire de r&#233;f&#233;rence des 19e et 20e si&#232;cles, produit par le 
laboratoire ATILF, un ensemble de liens permet &#233;galement la consultation des dictionnaires 
suivants : le Dictionarium latinogallicum (troisi&#232;me &#233;dition - 1552) de Robert Estienne, le 
Thresor de la langue fran&#231;oyse, tant ancienne que moderne de Jean Nicot (Paris, David 
Douceur, 1606), le Dictionnaire historique et critique de Bayle (fac-simil&#233; de la version de 
1740), le Dictionnaire critique de la langue fran&#231;aise de Jean-Fran&#231;ois F&#233;raud (1787-1788), le 
Dictionnaire de l'Acad&#233;mie fran&#231;aise (1e &#233;dition 1694 - 4e &#233;dition 1762 - 5e &#233;dition 1798 - 6e 
&#233;dition 1835 - 8e &#233;dition 1932/1935 &#8211; 9e &#233;dition en cours) 
</p>
<p>4 Des outils &#224; disposition de la communaut&#233; 
Le CNRTL se propose &#233;galement de mettre &#224; disposition de la communaut&#233; des outils 
linguistiques utilisables directement sur le site Web &#224; partir d&#8217;un simple navigateur Internet. 
Parmi les diff&#233;rents projets en cours ou &#224; venir, nous comptons offrir aux utilisateurs un acc&#232;s 
simple et convivial &#224; des outils comme : 
- FLEMM : outil d'analyse flexionnelle de textes en fran&#231;ais qui ont &#233;t&#233; au pr&#233;alable &#233;t&#233; 
</p>
<p>&#233;tiquet&#233;, au moyen de l'un des deux cat&#233;gorisateurs : Brill ou TreeTagger. 
- DERIF : outil d&#8217;analyse morpho-s&#233;mantique du fran&#231;ais qui s&#8217;applique &#224; des entr&#233;es 
</p>
<p>lexicales cat&#233;goris&#233;es issues d&#8217;un dictionnaire de la langue g&#233;n&#233;rale, capable de traiter des 
mots hors-dictionnaire et dont les r&#233;sultats associent la morphologie et la s&#233;mantique 
</p>
<p>- POMPAMO : outil de d&#233;tection de candidats &#224; la n&#233;ologie formelle et cat&#233;gorielle bas&#233; 
sur l&#8217;utilisation de lexiques d&#8217;exclusion. Ce projet exploite des ressources lexicales 
comme Morphalou et permet d&#8217;en constituer de nouvelles.  
</p>
<p>5 Un exemple d&#8217;int&#233;gration de ressources : le portail lexical 
Le portail lexical, quant &#224; lui, a pour vocation de valoriser et de partager un ensemble de 
donn&#233;es issues des travaux de recherche sur le lexique fran&#231;ais. Projet &#233;volutif, cette base de 
connaissances lexicales exploite aujourd&#8217;hui divers documents num&#233;riques pour fournir, &#224; 
partir d&#8217;une forme lexicale, six types d&#8217;informations importantes : des informations 
morphologiques issues de Morphalou (www.atilf.fr/morphalou),  des informations lexicogra-
phiques et &#233;tymologiques issues des projets TLF (www.atilf.fr/tlfi) et TLF-Etym, des 
informations de synonymies &#224; travers l&#8217;int&#233;gration du dictionnaire de synonymes de Caen 
(http://www.crisco.unicaen.fr/), une concordance utilisant le corpus des textes de la base 
Frantext (www.atilf.fr/frantext) et une pr&#233;sentation des r&#233;sultats de prox&#233;mie du projet Prox 
de l&#8217;ERSS (http://w3.univ-tlse2.fr/erss/). Il offre aussi la possibilit&#233; d&#8217;exporter les r&#233;sultats du 
concordancier au format XML/TEI. C&#8217;est &#224; notre connaissance le seul site permettant &#224; un 
utilisateur d&#8217;exporter dans un format normalis&#233; un concordancier fran&#231;ais d&#8217;une telle 
importance. Ces informations sont directement int&#233;grables dans d&#8217;autres applications Web &#224; 
travers des liens sp&#233;cifiques &#224; chacune des formes type d&#8217;informations tels que : 
www.cnrtl.fr/concordance/mot. De plus, le portail lexical permet une hyper-navigation vers 
toutes les informations lexicales disponibles pour ce mot. Par exemple, si l&#8217;on veut obtenir 
des informations sur un mot d&#8217;un exemple de concordance, un double-clic sur le mot affiche 
un menu qui permet d&#8217;hyper-naviguer vers les informations lexicales de ce mot. 
</p>
<p>329</p>

</div></div>
</body></html>