<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse des &#233;checs d&#8217;une approche pour traiter les questions d&#233;finitoires soumises &#224; un syst&#232;me de questions/r&#233;ponses</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Analyse des &#233;checs d&#8217;une approche pour traiter les questions 
 d&#233;finitoires soumises &#224; un syst&#232;me de questions/r&#233;ponses
</p>
<p>Laurent GILLARD, Patrice BELLOT, Marc EL-B&#200;ZE
Laboratoire d'Informatique d'Avignon (LIA) 
</p>
<p>Universit&#233; d&#8217;Avignon et des Pays de Vaucluse 
339 ch. des Meinajaries, BP 1228 
</p>
<p>F-84911 Avignon Cedex 9 (France) 
{laurent.gillard,patrice.bellot,marc.elbeze}@univ-avignon.fr
</p>
<p>R&#233;sum&#233;. Cet article revient sur le type particulier des questions d&#233;finitoires &#233;tudi&#233;es dans 
le cadre des campagnes d&#8217;&#233;valuation des syst&#232;mes de Questions/R&#233;ponses. Nous pr&#233;sentons 
l&#8217;approche d&#233;velopp&#233;e suite &#224; notre participation &#224; la campagne EQueR et son &#233;valuation lors 
de QA@CLEF 2006. La r&#233;ponse propos&#233;e est la plus repr&#233;sentative des expressions pr&#233;sentes 
en apposition avec l&#8217;objet &#224; d&#233;finir, sa s&#233;lection est faite depuis des indices d&#233;riv&#233;s de ces 
appositions. Environ 80% de bonnes r&#233;ponses sont trouv&#233;es sur les questions d&#233;finitoires des 
volets francophones de CLEF. Les cas d&#8217;erreurs rencontr&#233;s sont analys&#233;s et discut&#233;s en d&#233;tail. 
</p>
<p>Abstract. This paper proposes an approach to deal with definitional question answering. 
Our system extracts answers to these questions from appositives appearing closed to the 
subject to define. Results are presented for CLEF campaigns. Next, failures are discussed. 
</p>
<p>Mots-cl&#233;s : syst&#232;me de questions/r&#233;ponses, questions d&#233;finitoires. 
</p>
<p>Keywords: question answering, definitional question answering. 
</p>
<p>1 Introduction
Les syst&#232;mes de Questions/R&#233;ponses (sQR) se proposent d&#8217;aller au del&#224; de la recherche de 
documents pertinents afin de r&#233;pondre, pr&#233;cis&#233;ment et avec concision, &#224; une question 
directement formul&#233;e en langue naturelle. L&#8217;&#233;tude de ces syst&#232;mes est encourag&#233;e par des 
campagnes d&#8217;&#233;valuation qui sp&#233;cifient des axes de recherche comme la nature des questions &#224; 
consid&#233;rer. Cet article s&#8217;int&#233;resse tout particuli&#232;rement aux questions &#171; d&#233;finitoires &#187; (QD), en 
domaine ouvert, telles que Qui &#233;tait Alfred Nobel ? (CLEF06/28), qui interroge sur les aspects 
biographiques d&#8217;un individu, ou les questions Qu'est-ce que la RKA ? (CLEF06/95) et Qu'est-ce que 
Hubble ? (CLEF06/02), qui attendent une forme &#233;tendue ou encore une (voire La) caract&#233;ristique 
remarquable de l&#8217;objet &#224; d&#233;finir. Ces questions ont &#233;t&#233; introduites lors du volet 
Questions/R&#233;ponses (QR) de la campagne TREC-9. Il est &#224; noter que dans ce qui suit, nous 
nous limitons au contexte des campagnes EQueR (Ayache et al., 2006) et plus sp&#233;cifiquement 
CLEF (Vallin et al., 2006), o&#249; une seule et unique r&#233;ponse est &#224; produire. En effet, depuis 
2003 (Voorhees, 2003) et dans les campagnes TREC (Voorhees, 2005), les r&#233;ponses 
attendues aux QD sont constitu&#233;es de l&#8217;int&#233;gralit&#233; des faits pertinents connus sur le sujet &#224; 
d&#233;finir ; cela, au travers d&#8217;un d&#233;coupage en &#171; p&#233;pites &#187; d&#8217;informations vitales (&#224; maximiser), 
non vitales (indiff&#233;rentes) et inint&#233;ressantes (&#224; minimiser et p&#233;nalisantes). A Contrario, dans 
</p>
<p>83</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurent GILLARD, Patrice BELLOT, Marc EL-B&#200;ZE
</p>
<p>ce travail, notre objectif est d&#8217;extraire LA meilleure des r&#233;ponses pour une QD ; et nous 
souhaitons y parvenir depuis la d&#233;tection de mises en apposition et l&#8217;emploi d&#8217;un minimum de 
ressources. De plus, ce travail, pr&#233;liminaire du point de vue de la t&#226;che, nous permet 
d&#8217;explorer l&#8217;utilisation de la proximit&#233; imm&#233;diate des objets &#224; d&#233;finir avec leur d&#233;finition. 
Une autre motivation provenait des faibles performances obtenues par notre syst&#232;me lors 
d&#8217;EQueR sur ces QD : seulement 7% de r&#233;ponses courtes correctes pour les QD concernant 
des personnes et 42% pour les autres. Cela est d&#8217;autant peu qu&#8217;une partie &#233;tait obtenue gr&#226;ce &#224; 
des bases de connaissances et par cons&#233;quent la projection de ressources exog&#232;nes (couteuses 
&#224; maintenir). La m&#233;thode employ&#233;e &#233;tait bas&#233;e sur un appariement entre un type de r&#233;ponse 
attendu et la d&#233;tection au sein des documents d&#8217;Entit&#233;s du type ad&#233;quat. La principale 
difficult&#233; rencontr&#233;e &#233;tait li&#233;e &#224; la l&#8217;identification des limites pr&#233;cises de l&#8217;&#233;nonc&#233; 
correspondant &#224; la d&#233;finition. Pour illustrer cette d&#233;tection parfois mal ais&#233;e, consid&#233;rons une 
fonction (ou profession), qui d&#233;bute pourtant par chef (une telle construction est assez 
fr&#233;quente en QR) : 
</p>
<p>- Bouraima Kon&#233;, [Fonctionchef] des op&#233;rations techniques] de lutte d'urgence] contre les criquets] au 
minist&#232;re malien] de l'agriculture], au micro de Jean Paul Ade.  
</p>
<p>(Lu en ligne, http://www2.dw-world.de/french/Politik_Afrika/1.173728.1.html)
</p>
<p>Il appara&#238;t, comme le signale les crochets fermants, que la fronti&#232;re droite de l&#8217;expression est 
d&#233;licate &#224; appr&#233;cier, et donc sujette &#224; erreurs lors d&#8217;un &#233;tiquetage en Entit&#233;s Nomm&#233;es (ou 
m&#234;me une extraction &#224; l&#8217;aide de patrons). Par cons&#233;quent, le risque existe de faire glisser la 
r&#233;ponse extraite vers une r&#233;ponse incorrecte ou inexacte. Pourtant, cet exemple reste un cas 
simple : pour les QD qui commencent par Qui, la d&#233;finition &#224; trouver n&#8217;est pas 
syst&#233;matiquement un r&#244;le social mais peut &#234;tre n&#8217;importe quelle raison pour laquelle une 
personnalit&#233; est connue (de telles QD sont parfois &#233;tiquet&#233;es &#171; WhyFamous &#187;). Et pour les 
Qu&#8217;est-ce que, les possibilit&#233;s sont encore plus vastes. Aussi, notre approche a &#233;t&#233; de partir des 
expressions mises en apposition avec les objets &#224; d&#233;finir pour s&#233;lectionner celle qui semble la 
meilleure (selon diff&#233;rents crit&#232;res et indices, qui sont pr&#233;sent&#233;s en section 3) et de la proposer 
comme r&#233;ponse. L&#8217;utilisation d&#8217;une apposition permet de s&#8217;affranchir d&#8217;une d&#233;tection plus 
hasardeuse, et puisqu&#8217;il s&#8217;agit d&#8217;un extrait du document, cela nous permet de supposer une 
r&#233;ponse mieux construite. L&#8217;approche que nous pr&#233;sentons est &#233;valu&#233;e dans le cadre de notre 
participation &#224; la campagne QA@CLEF-2006 (Gillard et al., 2006) et obtient autour de 80% 
de bonnes r&#233;ponses. Ensuite (section 4), les cas d&#8217;&#233;checs que nous avons rencontr&#233;s sur 
CLEF-2006 sont analys&#233;s et discut&#233;s en d&#233;tails afin de mettre en &#233;vidence des am&#233;liorations &#224; 
mettre en &#339;uvre ou des points importants &#224; consid&#233;rer pour traiter de telles questions. 
</p>
<p>2 Autres travaux sur les questions d&#233;finitoires 
Un travail similaire &#224; celui-ci a &#233;t&#233; fait par (Malais&#233; et al., 2005) mais il porte sur la d&#233;tection 
d&#8217;&#233;nonc&#233; d&#233;finitoires dans le domaine m&#233;dical de la t&#226;che sp&#233;cialis&#233;e de la campagne EQueR. 
&#201;trangement, les constructions faisant intervenir des appositions ne sont pas list&#233;es dans les 
nombreux patrons d&#8217;extraction lexico-syntaxiques utilis&#233;s pour r&#233;pondre aux questions. 
</p>
<p>De nombreuses approches ont &#233;t&#233; envisag&#233;es, et pratiquement chaque syst&#232;me emploie une 
strat&#233;gie diff&#233;rente pour traiter les questions d&#233;finitoires. Par exemple, (Greenwood, Saggion, 
2004) utilisent une &#233;tape pr&#233;alable d&#8217;acquisition de termes secondaires depuis des ressources 
exog&#232;nes (WordNet, l&#8217;encyclop&#233;die Britannica et le Web, ce dernier contribue d&#8217;ailleurs a 
78%) pour aider &#224; s&#233;lectionner des d&#233;finitions d&#8217;abord extraites avec l&#8217;aide de patrons. 
(Fleischman et al., 2003) centrent &#233;galement leur travaux sur des patrons pour la collecte des 
r&#233;ponses candidates, mais se limitent &#224; deux : la succession Nom Commun Nom Propre et la 
</p>
<p>84</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Questions d&#233;finitoires : analyses des &#233;checs d&#8217;un syst&#232;me de questions/r&#233;ponses 
</p>
<p>mise en apposition ; ensuite un apprentissage automatique permet un filtrage. L&#8217;apposition est 
&#233;galement l&#8217;un des patrons de (Hildebrandt et al., 2004) parmi 11 autres constructions pour 
extraire a priori des connaissances du corpus ; ils s&#8217;aident &#233;galement d&#8217;une projection des 
d&#233;finitions de dictionnaires en ligne. (Prager et al., 2001) utilisent les liens d&#8217;hyperonymie de 
WordNet pour localiser un passage contenant une r&#233;ponse. D&#8217;autres, comme (Cui et al., 2005) 
proposent d&#8217;utiliser des patrons lexico-syntaxique probabilistes aux travers de deux mod&#232;les 
(bigrammes et PHMM). (Han et al., 2006) proposent un mod&#232;le purement probabiliste bas&#233; 
sur une s&#233;paration entre les mod&#232;les pour la question et la d&#233;finition. 
</p>
<p>3 Une approche et son &#233;valuation pour les questions d&#233;finitoires 
Comme dans tous les syst&#232;mes de Questions/R&#233;ponses, les questions d&#233;finitoires sont d&#8217;abord 
identifi&#233;es comme telles puis class&#233;es suivant quatre cat&#233;gories (au moyen de motifs 
d&#8217;expressions r&#233;guli&#232;res) : D+Personne, pour les questions telles que Qui est Neil Armstrong ?
(CLEF06/51) ; D+Acronyme pour les questions telles que Qu'est-ce que l'OUA ? (CLEF06/48) ; 
D+minuscules pour celles comme Qu'est-ce que l'effet de serre ? (CLEF06/189) ; et enfin, ce qui 
constitue le choix par d&#233;faut, la cat&#233;gorie D pour les questions d&#233;finitoires qui n&#8217;entrent dans 
aucune des pr&#233;c&#233;dentes cat&#233;gories comme par exemple Qu'est-ce que Challenger ? (CLEF06/81),
Qu'est-ce qu'Euro Disney ? (CLEF06/29) ou Qu'appelle-t-on le Knesset ? (CLEF06/103). Ensuite, l&#8217;objet &#224; 
d&#233;finir est obtenu en filtrant, apr&#232;s un &#233;tiquetage morphosyntaxique (TreeTagger), les 
diff&#233;rents pronoms interrogatifs et mots vides de sens comme &#234;tre, appeler, acronyme, sigle,
etc. Puis toutes les phrases du corpus contenant l&#8217;objet &#224; d&#233;finir sont conserv&#233;es et &#233;tiquet&#233;es 
morphosyntaxiquement. Si aucune phrase n&#8217;est trouv&#233;e la r&#233;ponse NIL est retourn&#233;e. 
</p>
<p>Ce n&#8217;est qu&#8217;apr&#232;s ces diff&#233;rents pr&#233;traitements que les diff&#233;rentes expressions candidates sont 
extraites. Chacune d&#8217;entre elles est accompagn&#233;e de diff&#233;rents crit&#232;res qu&#8217;il est possible de 
percevoir comme des juges dont les votes pond&#233;r&#233;s permettent de faire pr&#233;f&#233;rer in fine l&#8217;une 
plut&#244;t que l&#8217;autre. La fusion de ces diff&#233;rents jugements est variable suivant l&#8217;appartenance de 
la question &#224; l&#8217;une des quatre cat&#233;gories initiales. Les r&#233;glages utilis&#233;s ont &#233;t&#233; obtenus de 
mani&#232;re empirique sur les QR des campagnes CLEF-2004, 2005 et EQueR. 
</p>
<p>Les expressions appos&#233;es &#224; celle &#224; d&#233;finir et s&#233;par&#233;es d&#8217;elle par des virgules sont extraites et 
constituent l&#8217;ensemble pr&#233;f&#233;rentiel dans lequel la r&#233;ponse devrait &#234;tre extraite. Un crit&#232;re 
correspondant &#224; leur fr&#233;quence d&#8217;apparition dans l&#8217;ensemble des phrases leur est associ&#233;. Un 
autre ensemble plus particuli&#232;rement adapt&#233; aux acronymes et abr&#233;viations est d&#233;fini et 
correspond &#224; une construction Expression (CAPITALES) ou CAPITALES (Expression), par 
l&#8217;interm&#233;diaire de deux extractions de ces Expressions : l&#8217;une est obtenue depuis un 
alignement dynamique entre la forme CAPITALES et l&#8217;Expression, l&#8217;autre depuis la partie 
gauche (respectivement droite) la plus redondante ; l&#224; encore, un crit&#232;re de fr&#233;quence est 
associ&#233; avec chacune d&#8217;elles. D&#8217;autres juges sont d&#233;finis : la pr&#233;sence en t&#234;te de l&#8217;expression 
du nom le plus fr&#233;quent &#224; la position imm&#233;diatement &#224; gauche ; de m&#234;me, et apr&#232;s application 
d&#8217;un motif morphosyntaxique minimal pour d&#233;tecter des groupes nominaux, la pr&#233;sence en 
t&#234;te de ce groupe nominal du nom principal d&#233;termin&#233; le plus fr&#233;quent ; un taux de couverture 
avec le centro&#239;de des noms les plus fr&#233;quents au sein d&#8217;une fen&#234;tre de 10 mots autour de 
l&#8217;objet &#224; d&#233;finir ; un fonction de la longueur de l&#8217;expression ; un fonction du nombre de 
noms ; et deux autres juges binaires pour la pr&#233;sence des noms pr&#233;sident ou soci&#233;t&#233; en t&#234;te 
d&#8217;expression. Enfin, depuis ces expressions, et une strat&#233;gie de fusion des provenances, 
cat&#233;gories et juges, les meilleures sont propos&#233;es comme r&#233;ponse avec un comportement par 
d&#233;faut qui consiste &#224; r&#233;pondre par : l&#8217;expression appos&#233;e qui est &#224; la fois la plus longue et en 
ad&#233;quation avec le motif de d&#233;tection des groupes nominaux, si elle existe, ou le nom le plus 
</p>
<p>85</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurent GILLARD, Patrice BELLOT, Marc EL-B&#200;ZE
</p>
<p>fr&#233;quent pr&#233;c&#233;dant l&#8217;objet &#224; d&#233;finir. Cette r&#233;ponse par d&#233;faut est syst&#233;matiquement propos&#233;e 
en position 5. 
</p>
<p>Contexte et &#233;valuation de la m&#233;thode : Le tableau 1 propose un r&#233;f&#233;rentiel pour l&#8217;&#233;valuation 
de notre m&#233;thode au travers d&#8217;un bilan sur les r&#233;sultats obtenus par l&#8217;ensemble des 
participants aux questions d&#233;finitoires en fran&#231;ais des 3 campagnes QA@CLEF pass&#233;es, mais 
selon les ventilations que nous avons retenues. En 1i&#232;re colonne (#Q) est pr&#233;sent&#233; le nombre de 
QD pour chacune des campagnes et cat&#233;gories : 20 en 2004, 50 en 2005 et 42 en 2006. Le 
2i&#232;me groupe de colonnes correspond aux nombres et pourcentages de ces questions pour 
lesquelles une r&#233;ponse correcte a &#233;t&#233; trouv&#233;e (RC) par au moins l&#8217;un des participants. Il 
ressort de cette colonne que l&#8217;ensemble des strat&#233;gies mises en &#339;uvre par tous les syst&#232;mes 
permet, &#224; partir de 2005, de s&#8217;approcher de la totalit&#233; des r&#233;ponses &#224; obtenir (94%). Enfin le 
dernier groupe (RC par soumission) permet de situer les performances des syst&#232;mes puisque 
figure le nombre de r&#233;ponses correctes obtenues par : la/les moins bonnes des soumissions 
(Min.), la/les meilleures (Max.), ainsi que leur moyenne arithm&#233;tique (Moy.). Il est &#224; noter que 
l&#8217;ann&#233;e 2004 est moins repr&#233;sentative puisqu&#8217;un seul syst&#232;me a particip&#233;. &#201;galement, si le (ou 
les) meilleur des syst&#232;mes d&#233;passe 80% de bonnes r&#233;ponses, la moyenne de ceux-ci se situe 
en de&#231;&#224; (34% et 50%). Les questions portant sur les mots/concepts les plus g&#233;n&#233;raux 
(D+minuscules), et dont la r&#233;ponse devrait &#234;tre proche d&#8217;une d&#233;finition du type dictionnaire, 
rencontrent une r&#233;ussite moindre, il est possible d&#8217;envisager deux raisons &#224; cela : le fait que 
les corpus journalistiques employ&#233;es se pr&#234;tent peu &#224; ce type d&#8217;extraction (contrairement &#224; 
des d&#8217;informations plus biographiques), ou tout simplement leur relative nouveaut&#233; en QR. 
</p>
<p>Tableau 1: Bilan sur les r&#233;ponses correctes(RC) propos&#233;es par les participants 
aux questions d&#233;finitoires des campagnes QA@CLEF. 
</p>
<p>Le tableau 2 pr&#233;sente les r&#233;sultats obtenus par notre m&#233;thode sur les m&#234;mes jeux de QD que 
le tableau 1. Les questions des campagnes CLEF 2004, 2005 et EQueR (non pr&#233;sent&#233;es) ont 
&#233;t&#233; utilis&#233;es pour raffiner la m&#233;thode mise au point apr&#232;s notre participation &#224; EQueR. 
L&#8217;&#233;valuation de ces r&#233;sultats a &#233;t&#233; faite manuellement. Il en est de m&#234;me pour la derni&#232;re 
colonne (Au moins une r&#233;ponse correcte dans les 5 premi&#232;res r&#233;ponses). En revanche pour les 
autres donn&#233;es de CLEF 2006, les r&#233;sultats pr&#233;sent&#233;s sont ceux obtenus lors de notre 
participation &#224; la campagne au volet Fran&#231;ais-Fran&#231;ais (les r&#233;sultats en Anglais-Fran&#231;ais sont 
inf&#233;rieurs en raison d&#8217;erreurs de traduction ; 67% de r&#233;ponses correctes sont trouv&#233;es au rang 
1 au lieu de 79%). Les (+1) et (+2) qui figurent dans le tableau correspondent &#224; des r&#233;ponses 
qui auraient d&#251; &#234;tre extraites mais qui ont &#233;t&#233; perdues &#224; cause de probl&#232;mes d&#8217;ing&#233;nierie, ou 
pour l&#8217;une de la ligne D+Personne en raison d&#8217;une incertitude que nous avons : est-il 
</p>
<p>86</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Questions d&#233;finitoires : analyses des &#233;checs d&#8217;un syst&#232;me de questions/r&#233;ponses 
</p>
<p>acceptable de d&#233;finir Boris Becker comme une t&#234;te de s&#233;rie n&#186;7 ? (cf. discussion en section suivante).
Il appara&#238;t de ce tableau que les taux de bonnes r&#233;ponses sont constants et aux alentours de 
80% au premier rang et d&#233;passent 83% pour une r&#233;ponse correcte plac&#233;e parmi les 5 
premi&#232;res. Cependant, et comme pr&#233;c&#233;demment soulign&#233; par le tableau 1, les questions 
d&#233;finitoires portant sur des concepts g&#233;n&#233;riques (D+minuscules) ou qui ne concerne ni les 
personnes ni les acronymes, rencontrent &#233;galement moins de succ&#232;s avec notre m&#233;thode. 
</p>
<p>Tableau 2: R&#233;sultats obtenus par notre m&#233;thode sur les questions d&#233;finitoires
des campagnes QA@CLEF ; &#233;valuation officielle pour 2006 (soumission FR-FR). 
</p>
<p>4 Analyse et discussion des cas d&#8217;&#233;checs sur CLEF-2006 
Cette partie propose une discussion sur les cas d&#8217;&#233;checs que nous avons rencontr&#233;s. Aussi, 
elle s&#8217;articule autour de quelques questions qui illustrent des difficult&#233;s repr&#233;sentatives pour 
notre syst&#232;me et parfois la t&#226;che elle-m&#234;me. Il faut &#233;galement rappeler que notre m&#233;thode 
n&#8217;utilise pas d&#8217;analyse syntaxique et repose essentiellement sur une recherche d&#8217;expressions 
appos&#233;es depuis un d&#233;coupage en phrases, et, par cons&#233;quent, avec un contexte limit&#233;. 
</p>
<p>Qui est Boris Becker ? (CLEF2006/90) Au del&#224; de la simplicit&#233; &#233;vidente de cette question pour un 
&#171; lecteur moyen de journaux &#187;, la difficult&#233; est r&#233;elle puisqu&#8217;aucun des syst&#232;mes n&#8217;a trouv&#233; 
une r&#233;ponse correcte. En effet, la r&#233;ponse retourn&#233;e par notre syst&#232;me est une nationalit&#233; au 
travers du nom Allemand soit le nom qui qualifie le plus fr&#233;quemment Boris Becker dans le 
corpus (l&#8217;Allemand Boris Becker est pr&#233;sent 21 fois sur les 104 occurrences de Boris Becker).
Cette r&#233;ponse n&#8217;a pas &#233;t&#233; jug&#233;e correcte, la raison &#233;tant qu&#8217;une nationalit&#233; n&#8217;est pas suffisante, 
&#224; elle seule, pour qualifier convenablement une personne. Cette r&#232;gle connue, il appara&#238;t 
possible, notamment dans ce cas simple, de filtrer les &#171; mauvais &#187; candidats &#224; l&#8217;aide de r&#232;gles 
de rejet. Aussi, il faut poursuivre l&#8217;investigation. L&#8217;une des premi&#232;res d&#233;finitions qui viendrait 
&#224; l&#8217;esprit pour d&#233;finir Boris Becker serait tr&#232;s probablement sa qualit&#233; de joueur de tennis. Mais, 
au sein d&#8217;un d&#233;coupage en phrase du corpus, Boris Becker entre que tr&#232;s rarement en 
cooccurrence avec un motif comprenant tennis (qu&#8217;il soit issu de l&#8217;expression joueur de tennis
ou m&#234;me tennism(a|e)n). Et, sur les neuf fois o&#249; cela se produit sur les 104 phrases contenant 
Boris Becker, une seule permet effectivement de le d&#233;finir directement au travers de ce trait : 
- Sa fortune , il l' a b&#226;tie sur les courts de tennis aux c&#244;t&#233;s de son partenaire de double , le fantasque 
Ilie Nastase , dans les ann&#233;es 60 ; puis en g&#233;rant les affaires des meilleurs tennismen , tels que l' 
Allemand Boris Becker hier ou le Croate Goran Ivanisevic aujourd'hui . (LEMONDE94-000881-19940108)
</p>
<p>Cependant, malgr&#233; la pr&#233;sence du tels introductif &#224; une explicitation, il faut souligner ici &#224; 
quel point le processus de r&#233;ponse appara&#238;t d&#233;licat : il est n&#233;cessaire de ne pas tenir compte de 
</p>
<p>87</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurent GILLARD, Patrice BELLOT, Marc EL-B&#200;ZE
</p>
<p>la pr&#233;sence du nom Allemand pour revenir en arri&#232;re jusqu&#8217;&#224; celui de tennismen. En outre, une 
inversion de la position des deux joueurs Goran Ivanisevic et Boris Becker dans la phrase aurait 
encore complexifi&#233; son analyse et aurait n&#233;cessit&#233; la mise en balance des deux groupes 
nominaux par la conjonction ou. Et dans ce dernier cas, la t&#226;che aurait &#233;t&#233; compliqu&#233;e par la 
pr&#233;sence des mots hier et aujourd&#8217;hui puisqu&#8217;ils apparaissent comme des &#233;l&#233;ments 
perturbateurs difficiles &#224; pr&#233;voir (notamment dans le cas d&#8217;une extraction &#224; partir de patrons 
morphosyntaxiques) mais pourtant &#224; ignorer. Enfin, il faut se rem&#233;morer qu&#8217;il s&#8217;agit de 
l&#8217;unique cooccurrence entre tennismen et Boris Becker dans le corpus et par cons&#233;quent une 
prise en compte fr&#233;quentielle n&#8217;est pas envisageable dans ce cas (cependant une parenth&#232;se 
m&#233;rite d&#8217;&#234;tre ouverte : des proc&#233;d&#233;s de r&#233;solutions d&#8217;anaphores pourraient augmenter le 
nombre de candidats mais notre syst&#232;me en est actuellement d&#233;pourvu). 
</p>
<p>Cette (probable) bonne r&#233;ponse &#233;tant &#233;cart&#233;e, il est possible de s&#8217;int&#233;resser &#224; une autre  
r&#233;ponse candidate ou plut&#244;t un autre lot de r&#233;ponses envisageables. En effet, Boris Becker est &#224; 
plusieurs reprises qualifi&#233; de t&#234;te de s&#233;rie comme explicit&#233; dans les exemples ci-dessous : 
</p>
<p>- Victime d' une blessure au dos &#224; l' &#233;chauffement , l' Allemand Boris Becker , t&#234;te de s&#233;rie num&#233;ro 10 
, a d&#233;clar&#233; forfait avant le match contre Stark (LEMONDE94-002991-19940525)
- Pete Sampras a gagn&#233; , dimanche 15 mai , les Internationaux d' Italie de tennis en battant en finale l' 
Allemand Boris Becker , t&#234;te de s&#233;rie n 8 ( 6-1 , 6-2 , 6-2 ) . (LEMONDE94-001994-19940517)
- Sur le court n&#186; 1 , dos-&#224;-dos &#224; deux sets partout , l' Allemand Boris Becker , t&#234;te de s&#233;rie n&#186; 7 , et l' 
Ukrainien Andrei Medvedev ( n&#186; 9 ) ont vu leur rencontre interrompue [&#8230;]  (LEMONDE94-003405-19940629)
</p>
<p>Ainsi, une premi&#232;re difficult&#233; survient dans le cas d&#8217;une &#233;ventuelle factorisation fr&#233;quentielle 
sur t&#234;te de s&#233;rie : l&#8217;expression n&#8217;est pas suffisante si le qualifi&#233; n&#8217;est pas t&#234;te de s&#233;rie num&#233;ro 1.
Aussi, il peut &#234;tre n&#233;cessaire de la compl&#233;menter. Dans ce cas, cela suppose d&#8217;&#234;tre en mesure 
de prendre en compte les diff&#233;rentes &#233;critures de num&#233;ro. Pourtant cela serait une erreur de 
penser qu&#8217;il s&#8217;agit d&#8217;un m&#234;me classement comparable et qu&#8217;il est possible de suivre sa 
variation dans le temps au travers des diff&#233;rents documents (auquel cas, une d&#233;cision aurait pu 
&#234;tre de ne consid&#233;rer que le plus r&#233;cent). En effet, une t&#234;te de s&#233;rie correspond &#224; un classement 
pr&#233;alable &#224; un tournoi, sorte d&#8217;estimation faite en fonction du niveau d&#8217;un participant, pour 
faire en sorte que les meilleurs d&#8217;entre eux ne se rencontrent qu&#8217;&#224; la fin de la comp&#233;tition. 
Aussi la notion de t&#234;te de s&#233;rie n&#8217;a de sens que vis-&#224;-vis d&#8217;une comp&#233;tition sportive. 
Cependant, comme il est possible de le voir sur ces exemples, ces r&#233;f&#233;rences ne sont pas 
toujours pr&#233;sentes dans la fen&#234;tre de la phrase : seul le deuxi&#232;me exemple propose &#224; la fois la 
comp&#233;tition et le domaine au travers des Internationaux d'Italie de tennis. Aussi, et finalement, 
l&#8217;ensemble de ces ambigu&#239;t&#233;s li&#233;es &#224; autant d&#8217;&#233;lisions peut diminuer consid&#233;rablement 
l&#8217;int&#233;r&#234;t d&#8217;une r&#233;ponse extraite de ces phrases (sauf &#224; pouvoir synth&#233;tiser une r&#233;ponse telle 
que t&#234;te de s&#233;rie n&#176;8 aux Internationaux d&#8217;Italie de tennis mais dans ce cas il serait probablement 
pr&#233;f&#233;rable d&#8217;aller jusqu&#8217;&#224; demi-finaliste aux Internationaux d&#8217;Italie de tennis en 1994).
</p>
<p>Il est d&#8217;ailleurs &#224; noter qu&#8217;une partie de cette discussion eut &#233;t&#233; diff&#233;rente si plut&#244;t que t&#234;te de 
s&#233;rie n&#176;X, l&#8217;expression n&#176;X mondial avait &#233;t&#233; pr&#233;sente, puisque alors il aurait fallu prendre 
justement en compte une variabilit&#233; dans le temps de ce classement parmi les meilleurs 
joueurs mondiaux. Et de s&#8217;interroger sur l&#8217;opportunit&#233; de qualifier Boris Becker avec autant de 
classements diff&#233;rents malgr&#233; un d&#233;nominateur commun d&#8217;&#234;tre &#171; l&#8217;un des 10 premiers joueurs 
mondiaux de tennis en 1994 &#187; (d&#8217;ailleurs, n&#8217;est-ce pas la r&#233;ponse, actuellement hors de 
port&#233;e, qu&#8217;il aurait fallu pouvoir inf&#233;rer de ces diff&#233;rentes r&#233;alisations ?). 
</p>
<p>Apr&#232;s avoir consid&#233;r&#233; ces candidats de r&#233;ponses propuls&#233;s en t&#234;te des possibles en raison de 
leur r&#233;p&#233;tition, il appara&#238;t parmi les appositions restantes quelques autres susceptibles de 
donner lieu &#224; des r&#233;ponses correctes. Cependant, dans trois de celles-ci, le rapprochement 
</p>
<p>88</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Questions d&#233;finitoires : analyses des &#233;checs d&#8217;un syst&#232;me de questions/r&#233;ponses 
</p>
<p>avec le monde du tennis n&#8217;est pas pr&#233;sent, ce qui par cons&#233;quent am&#232;nera &#224; pr&#233;supposer cette 
connaissance (qui peut ne pas aller de soi). Il est aussi int&#233;ressant de noter que trois d&#8217;entres 
elles commencent par des adjectifs num&#233;raux ou multiplicateurs (peut-&#234;tre faut-il y voir une 
particularit&#233; de l&#8217;univers sportif ?). Enfin, et comme pour &#233;tayer la discussion pass&#233;e, une 
erreur de typographie peut compliquer les rapprochements des t&#234;te de sr&#233;ie num&#233;ro 3. Tout 
comme il appara&#238;t d&#233;licat de d&#233;cider si Boris Becker est huiti&#232;me joueur mondial ou bien no 3 
mondial (respectivement dans un document de 1994 et 1995, aussi a-t-il &#233;t&#233; successivement, 
l&#8217;un puis l&#8217;autre ; du moins au moment de l&#8217;&#233;criture de chacun de ces documents). 
</p>
<p>- En d&#233;clarant , [&#8230;] sans toutefois apporter de preuves , l' Allemand Boris Becker , triple champion 
de Wimbledon , a relanc&#233; la rumeur autour du dopage dans le monde du tennis (LEMONDE94-000256-19940104)
- L' Allemand Boris Becker , huiti&#232;me joueur mondial et t&#234;te de sr&#233;ie num&#233;ro 3 , s' est impos&#233; en finale 
du tournoi de New-Haven ( Connecticut ) en battant [&#8230;] (LEMONDE94-001895-19940823)
- La f&#233;d&#233;ration acc&#233;derait ainsi aux exigences de Stich , qui r&#233;clame une somme identique &#224; celle 
accord&#233;e &#224; son compatriote Boris Becker , no 3 mondial , soit 1 million [&#8230;]. (LEMONDE95-010221)
- Boris Becker , multiple vainqueur dans les autres tournois du Grand Chelem , a fait une nouvelle 
fois son deuil des Internationaux de France . (LEMONDE95-022102)
</p>
<p>Enfin, il est possible de remarquer que, depuis ce dernier exemple, et puisque la r&#233;ponse est &#224; 
fournir hors du contexte du document sans doute serait-il pr&#233;f&#233;rable d&#8217;&#234;tre capable de perdre 
le autres pour ne conserver que multiple vainqueur dans les tournois du Grand Chelem.
</p>
<p>Qui &#233;tait Alexander Graham Bell ? (CLEF2006/0050) C&#8217;est un probl&#232;me d&#8217;ing&#233;nierie li&#233; aux 
nombreuses ponctuations qui a emp&#234;ch&#233; notre syst&#232;me de r&#233;pondre &#224; cette question depuis : 
</p>
<p>- Parmi les lieux historiques , le canal de St-Peters ( entre le lac du Bras-d' Or et l' Atlantique ) , le 
site d&#233;di&#233; &#224; l' inventeur du t&#233;l&#233;phone , Alexander Graham Bell ( &#224; Baddeck , &#224; l' ouest de Sydney ) , 
Louisbourg ( lire notre reportage ) , la citadelle de Halifax ( fortifications du XIXe ) , Port-Royal , &#224; 
210 km &#224; l' ouest de Halifax [&#8230;] . (LEMONDE95-023507)
</p>
<p>Mais cette question nous permet d&#8217;illustrer une autre difficult&#233; qu&#8217;il ne faut pas oublier de 
consid&#233;rer lors des &#233;tapes de recherche ou d&#8217;appariement, qu&#8217;il s&#8217;agisse de la question, des 
documents voire de l&#8217;un avec l&#8217;autre. En effet, il faut autoriser une certaine variabilit&#233; dans 
les noms propres afin de s&#8217;assurer qu&#8217;Alexandre et Alexander soit une m&#234;me personne, qu&#8217;un 
&#233;ventuel nom interm&#233;diaire, deuxi&#232;me pr&#233;nom, etc. puisse &#233;galement &#234;tre facultatif ou 
pr&#233;sent. Cela pour qu&#8217;Arantxa Sanchez Vicario (CLEF05/175) puisse s&#8217;&#233;crire Arantxa Sanchez-Vicario
mais n&#8217;&#234;tre parfois qu&#8217;Arantxa Sanchez. S&#8217;il en doit en &#234;tre de m&#234;me pour Bill, William
Jefferson, W.J. ou m&#234;me William J. Clinton, force est de constater que dans ce cas la solution 
n&#8217;appara&#238;t pas triviale (quelle forme canonique pour les noms propres ?). Enfin, dans certains 
cas, plus chanceux, si l&#8217;&#233;criture fautive appara&#238;t &#224; la fois dans la question et les documents, le 
syst&#232;me peut &#233;tablir qu&#8217;Hil(l)ary Clinton (CLEF06/120) est tout de m&#234;me l&#8217;&#233;pouse du pr&#233;sident 
am&#233;ricain. N&#233;anmoins, il est aussi possible d&#8217;utiliser des algorithmes de tol&#233;rance aux fautes. 
</p>
<p>- Un compromis [&#8230;]sans d&#233;lai en &#233;change de la confirmation par Washington de la pr&#233;sence de 
Hilary Clinton , l' &#233;pouse du pr&#233;sident am&#233;ricain , &#224; la conf&#233;rence [&#8230;]. (LEMONDE95-031398)
</p>
<p>Qu&#8217;est-ce que le Cr&#233;dit Suisse ? (CLEF2006/0107) Cette question est particuli&#232;rement int&#233;ressante : 
comment peut-on d&#233;finir quelque chose qui appara&#238;t comme d&#233;j&#224; transparent ? Notre syst&#232;me 
n&#8217;y est pas parvenu et s&#8217;y est m&#234;me tromp&#233; : le groupe Cr&#233;dit Suisse est effectivement un 
groupe (et &#224; de nombreuses reprises), mais ce n&#8217;est pas tr&#232;s satisfaisant et si c&#8217;est le seul
groupe, c&#8217;est d&#233;j&#224; trop. En effet, il faut prendre garde &#224; certains adjectifs qui nuisent plus 
qu&#8217;ils n&#8217;apportent. Nous avions envisag&#233; ce probl&#232;me mais oubli&#233; de l&#8217;impl&#233;menter : s&#8217;il est 
int&#233;ressant de savoir que Stephen Hawking (CLEF06/0027) est un c&#233;l&#232;bre physicien anglais, ou que 
</p>
<p>89</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurent GILLARD, Patrice BELLOT, Marc EL-B&#200;ZE
</p>
<p>Nick Leeson (CLEF06/0041) est un ancien courtier de la banque Barings ; d&#8217;autres adjectifs tels nouveau
doivent &#234;tre soigneusement &#233;vit&#233;s (et &#224; plus forte raison pour un corpus ancien). Ainsi notre 
syst&#232;me aurait pu filtrer Windows (CLEF06/107), le nouveau syst&#232;me d' exploitation jug&#233; inexact (mais 
aussi parce qu&#8217;il &#233;tait question de l&#8217;une des versions de Windows dans le document). En outre, 
et pour revenir au cas Cr&#233;dit Suisse, les syst&#232;mes participants n&#8217;ont pu faire mieux que de 
r&#233;pondre groupe qui a &#233;t&#233; la seule bonne r&#233;ponse accept&#233;e, &#224; deux reprises, lors de 
l&#8217;&#233;valuation (mais il reste possible de s&#8217;interroger sur l&#8217;int&#233;r&#234;t de cette d&#233;finition, surtout 
lorsque Prix de Le Prix Cr&#233;dit Suisse est refus&#233;, peut &#234;tre parce qu&#8217;il s&#8217;agit d&#8217;une &#171; copie &#187; ou
une &#171; imitation &#187;).
Il est &#224; noter que notre syst&#232;me propose en 4i&#232;me position, banque qui a plac&#233; les emprunts Biber,
depuis :
</p>
<p>- Ces cr&#233;anciers sp&#233;culent [&#8230;] hausse des cours , a expliqu&#233; Dieter Enkelmann , membre de la 
direction du Cr&#233;dit Suisse , banque [est-ce &#224; conserver ? qui a plac&#233; les emprunts Biber] . (ATS.940426.0097)
</p>
<p>mais la fr&#233;quence banque (7) n&#8217;a pu prendre le pas sur celle de groupe (31). Un autre point est 
qu&#8217;il peut appara&#238;tre opportun (d&#8217;ailleurs plus par conformit&#233; avec les sp&#233;cifications des 
r&#233;ponses &#224; produire dans le cadre des campagnes d&#8217;&#233;valuations CLEF que du point de vue de 
la pertinence de la &#171; p&#233;pite &#187; d&#8217;information elle-m&#234;me) d&#8217;&#233;loigner la proposition subordonn&#233;e 
relative pour ne conserver que banque. Et encore une fois, dans le cas de Windows (CLEF06/107) : 
</p>
<p>- Microsoft Network [&#8230;] que la prochaine version de Windows , le syst&#232;me d' exploitation
[est-ce &#224; conserver ? qui a permis au groupe d' asseoir sa domination du march&#233; des logiciels ] (ATS.950516.0148)
</p>
<p>Pour conclure avec l&#8217;institution financi&#232;re, dans l&#8217;exemple ci-dessous, il ne faut pas extraire 
trop rapidement banque b&#226;loise puisqu&#8217;il s&#8217;agit en fait de la Soci&#233;t&#233; de Banque Suisse ( SBS ) et
non du Cr&#233;dit Suisse, l&#8217;une des grandes concurrentes du SBS. Mais la compr&#233;hension n&#233;cessaire 
n&#8217;apparait pas dans la fen&#234;tre de la phrase.
</p>
<p>- A l' instar de ses deux grandes concurrentes , l' UBS et le Cr&#233;dit Suisse , la banque b&#226;loise a subi le 
contre-coup des turbulences qui ont affect&#233; l' an pass&#233; les march&#233;s financiers . (ATS.950315.0084)
</p>
<p>Qu&#8217;est-ce qu'un samovar ? (CLEF2006/0188) Cette question cristallise les difficult&#233;s. Dans le corpus, 
il n&#8217;est pas possible d&#8217;obtenir la d&#233;finition &#224; laquelle on s&#8217;attend. Pourtant, c&#8217;est justement 
gr&#226;ce &#224; une apposition qu&#8217;il est envisageable de r&#233;pondre depuis l&#8217;une des 9 phrases utilisant 
le mot (les 8 autres sont susceptibles de brouiller les pistes). Mais l&#8217;analyse pour aboutir 
appara&#238;t particuli&#232;rement complexe : il faut consid&#233;rer la seconde occurrence du mot plut&#244;t 
que la premi&#232;re (laquelle seconde est &#224; ignorer sinon), passer outre la forme plurielle, les 
guillemets fermants, une partie de la premi&#232;re apposition, pour s&#8217;arr&#234;ter apr&#232;s la troisi&#232;me, et 
non plus loin. Ensuite, un samovar peut &#234;tre ceux qui, au front, avaient perdu bras ou jambe.
Aucun des syst&#232;mes participants n&#8217;y est parvenu. Et finalement, cette question pose un autre 
probl&#232;me sous-jacent &#224; toute la t&#226;che Questions/R&#233;ponses : est-il toujours possible d&#8217;extraire 
automatiquement une r&#233;ponse concise depuis un passage qui la contient manifestement ? 
- Pr&#232;s du [1samovar] , ou entour&#233;e de &quot; [2samovars] &quot; , comme on appelait ceux qui , au front , 
avaient perdu bras ou jambe , la voil&#224; soudain loin de la litt&#233;rature , se souvenant [&#8230;](LEMONDE95-036764)
</p>
<p>Qu&#8217;est-ce qu'un t-shirt ? (CLEF2006/0144) Cette question a donn&#233; lieu &#224; une r&#233;ponse vestimentaire 
sans int&#233;r&#234;t li&#233;e &#224; une &#233;num&#233;ration : veste et cravate. La r&#233;ponse attendue &#233;tait NIL, soit celle 
correspondant &#224; une absence de r&#233;ponse dans le corpus. Cette bonne absence de r&#233;ponse a &#233;t&#233; 
propos&#233;e par 5 syst&#232;mes, dont le n&#244;tre mais uniquement dans sa version anglais vers fran&#231;ais 
et cela, seulement &#224; cause d&#8217;une erreur de traduction. En effet, notre approche tend &#224; toujours 
</p>
<p>90</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Questions d&#233;finitoires : analyses des &#233;checs d&#8217;un syst&#232;me de questions/r&#233;ponses 
</p>
<p>proposer une r&#233;ponse (par d&#233;faut l&#8217;expression appos&#233;e la plus longue ou le nom le plus 
fr&#233;quent pr&#233;c&#233;dant l&#8217;objet de la question). Le seul cas o&#249; un NIL est retourn&#233; survient lorsque 
l&#8217;expression &#224; d&#233;finir est absente du corpus (comme ce fut le cas &#224; raison pour Linux (CLEF06/03),
pas encore assez populaire en 1994 et 95, dates des documents de la campagne). 
- &quot; Casquette de base-ball , jeans , T-shirt , veste et cravate , tenue de jogging : il est impossible de 
dresser un portrait-robot de ces candidats &#224; une arme . (LEMONDE95-028295)
</p>
<p>5 Perspectives : vers une synth&#232;se de d&#233;finitions 
Un tel processus de r&#233;ponse &#224; des questions d&#233;finitoires ouvre une perspective int&#233;ressante : il 
permet d&#8217;am&#233;liorer la notion de satisfaction en s&#8217;essayant &#224; une g&#233;n&#233;ration ou plut&#244;t &#224; une 
synth&#232;se pour la r&#233;ponse propos&#233;e. En effet, les r&#233;ponses extraites depuis un contexte unique 
ne sont que tr&#232;s rarement exhaustives (surtout s&#8217;il est limit&#233; &#224; quelques phrases). Pourtant, et &#224; 
leur lecture, il appara&#238;t &#233;vident qu&#8217;il est possible d&#8217;am&#233;liorer LA r&#233;ponse gr&#226;ce &#224; l&#8217;ensemble 
des r&#233;ponses candidates (mais il est alors n&#233;cessaire de s&#8217;assurer de la qualit&#233; de ces r&#233;ponses 
candidates, par exemple, depuis des crit&#232;res fr&#233;quentiels ou des coefficients d&#8217;association). 
</p>
<p>Ainsi, lorsque nous cherchons &#224; d&#233;finir Airbus (CLEF06/53), le nom le plus fr&#233;quemment associ&#233; 
est Consortium et parmi les expressions les plus fr&#233;quentes sont Consortium europ&#233;en,
Consortium civil, et Consortium a&#233;ronautique (Consortium, Programme et Consortium europ&#233;en ont
&#233;t&#233;s pr&#233;sent&#233;es par les syst&#232;mes et jug&#233;es correctes lors de l&#8217;&#233;valuation). D&#8217;autre part 
Consortium a&#233;ronautique europ&#233;en appara&#238;t dans le corpus mais &#233;pisodiquement. Toutefois, 
force est de constater que ce dernier semble plus satisfaisant (m&#234;me si sa fr&#233;quence moindre 
le rend peu sujet &#224; extraction). En outre, il peut &#234;tre synth&#233;tis&#233; depuis les premiers. Il suffit de 
compl&#233;menter le nom le plus fr&#233;quemment appos&#233; par tous les adjectifs &#233;pith&#232;tes qui 
l&#8217;accompagnent dans ses r&#233;alisations. Un simple &#233;tiquetage morphosyntaxique est suffisant. 
Enfin, une projection (sur le web ou dans le corpus) des expressions ainsi cr&#233;&#233;es peut 
permettre de v&#233;rifier leur validit&#233; du point de vue de leur construction et, notamment, dans ce 
cas, fixer l&#8217;ordre des adjectifs (sauf &#224; d&#233;finir des r&#232;gles : une nationalit&#233; appara&#238;t souvent en 
dernier). Il en est de m&#234;me pour le classique Bill Clinton (CLEF06/91) tour &#224; tour pr&#233;sident am&#233;ricain
et pr&#233;sident d&#233;mocrate mais pourtant les deux &#224; la fois ou des navettes Atlantis (CLEF06/01) et
Challenger (CLEF06/81), avant tout spatiales et am&#233;ricaines. Par ailleurs, il peut &#234;tre opportun de 
disposer d&#8217;une ressource, m&#234;me limit&#233;e, afin, par exemple, de manipuler comme un m&#234;me 
concept des noms tels que Chef et Leader (certaines fonctions reviennent particuli&#232;rement dans 
les QD de ces campagnes), et/ou &#233;viter une &#233;ventuelle redite des adjectifs. 
</p>
<p>Id&#233;alement une telle m&#233;thode pourrait &#234;tre appliqu&#233;e avec des subordonn&#233;es relatives mais 
ces &#171; p&#233;pites &#187; d&#8217;informations seraient probablement jug&#233;es comme inexactes dans le 
contexte actuel des campagnes, tout en &#233;tant susceptibles d&#8217;induire plus d&#8217;erreurs durant leur 
g&#233;n&#233;ration. Cependant, cela permettrait d&#8217;apporter une r&#233;ponse concise ad&#233;quate &#224; la question 
(fictive) Qu&#8217;est-ce que Bell&#8217;s Beach ?, depuis le seul passage du corpus (EQueR) contenant 
l&#8217;expression Bell&#8217;s Beach, puisqu&#8217;elle serait alors (la|une) plage o&#249; &#233;clatent les plus grosses 
vagues d'Australie. Il est &#224; noter qu&#8217;ici, le proc&#233;d&#233; de r&#233;ponse implique une mise en relation 
entre Beach et plage puis d&#8217;utiliser ce qui joue le r&#244;le d&#8217;un g&#233;n&#233;rique comme ant&#233;c&#233;dent de la 
proposition relative. En d&#8217;autres termes, cela revient &#224; compl&#233;menter une sorte de 
classe/hyperonyme par la proposition relative initialement appos&#233;e &#224; l&#8217;expression &#224; d&#233;finir. 
</p>
<p>C' est du c&#244;t&#233; de Torquay , petite ville c&#244;ti&#232;re du Victoria au sud -est du pays , situ&#233;e &#224; quelques 
kilom&#232;tres de Bell' s Beach , o&#249; &#233;clatent les plus grosses vagues d' Australie , que [&#8230;] (LEMONDE99-19935)
</p>
<p>91</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurent GILLARD, Patrice BELLOT, Marc EL-B&#200;ZE
</p>
<p>6 Conclusion
Dans cet article nous avons &#233;tudi&#233; l&#8217;utilisation de l&#8217;apposition pour r&#233;pondre &#224; des questions 
d&#233;finitoires telles qu&#8217;elles sont propos&#233;es dans les campagnes d&#8217;&#233;valuation des syst&#232;mes de 
Questions/R&#233;ponses. En effet, dans notre syst&#232;me, les r&#233;ponses candidates pour ces questions 
sont extraites depuis leur mise en apposition (ou entre parenth&#232;ses) avec les objets &#224; d&#233;finir. 
Ensuite, afin de filtrer et retenir la meilleure des expressions appos&#233;es comme r&#233;ponse, un 
choix est effectu&#233; depuis une strat&#233;gie impliquant diff&#233;rents indices (principalement 
fr&#233;quentiels) d&#233;riv&#233;s du voisinage des objets &#224; d&#233;finir. L&#8217;hypoth&#232;se forte de notre approche 
est qu&#8217;elle ne n&#233;cessite pas de connaissances externes ni m&#234;me une analyse syntaxique. 
&#201;valu&#233;e dans le cadre d&#8217;une participation &#224; la campagne QA@CLEF-2006, elle trouve 
environ 80% de bonnes r&#233;ponses. Cependant une analyse d&#233;taill&#233;e de quelques cas d&#8217;&#233;checs 
rencontr&#233;s nous a amen&#233; au constat qu&#8217;il n&#8217;est pas toujours possible d&#8217;aboutir &#224; une r&#233;ponse. 
Enfin, et parce que les r&#233;ponses aux questions d&#233;finitoires s&#8217;y pr&#234;tent particuli&#232;rement, nous 
avons esquiss&#233; une perspective quant &#224; la synth&#232;se de r&#233;ponses (depuis les meilleures 
r&#233;ponses extraites) pour aller plus avant vers des r&#233;ponses plus satisfaisantes. 
</p>
<p>R&#233;f&#233;rences
AYACHE C., GRAU B., VILNAT A. (2006). EQueR: The French Evaluation campaign of 
Question Answering Systems. Actes de LREC&#8217;2006.
CUI H., KAN M.-Y., CHUA T.-S. (2005). Generic  Soft Pattern Models for Definitional 
Question Answering. Actes de The 28th ACM SIGIR Conference, 384-391. 
FLEISCHMAN M., HOVY E., ECHIHABI A. (2003). Offline Strategies for Online Question 
Answering: Answering Questions Before they Are Asked. Actes de ACL-2003, 1-7. 
GILLARD L., SITBON L., BLAUDEZ E., BELLOT P., EL-B&#200;ZE M. (2006). The LIA at 
QA@CLEF2006. The Working Notes for the CLEF 2006 Workshop.
GREENWOOD M.A., SAGGION H. (2004). A Pattern Based Approach to Answering Factoid, 
List and Definition Questions. Actes de The 7th RIAO Conference, 232-243. 
HAN K.-S., SONG Y.-I., RIM H.-C. (2006). Probabilistic model for definitional question 
answering. Actes de The 29th ACM SIGIR Conference, 212-219. 
HILDEBRANDT W., KATZ B., LIN J. (2004). Answering Definition Questions Using Multiple 
Knowledge Sources. Actes de HLT-NAACL 2004, 49-56. 
MALAIS&#201; V., DELBECQUE T., ZWEIGENBAUM P. (2005). Recherche en corpus de r&#233;ponses &#224; 
des questions d&#233;finitoires. Actes de la Conf&#233;rence TALN 2005, 43-52. 
PRAGER J., RADEV D., CZUBA K. (2001). Answering What-Is Questions by Virtual 
Annotation. Actes de HLT-2001 Conference, 26-30. 
VALLIN A., MAGNINI B., GIAMPICCOLO D., AUNIMO L., AYACHE C., OSENOVA P., PE&#209;AS A.,
DE RIJKE M., SACALEANU B., SANTOS D., SUTCLIFFE R. (2006). Overview of the CLEF 2006 
Multilingual Question Answering Track. The Working Notes for the CLEF 2006 Workshop.
VOORHEES E.M. (2003). Overview of the TREC 2003 Question Answering track, Actes de 
The 12th TREC Conference, 54-68. 
VOORHEES E.M. (2005). Chapter 10: Question Answering in TREC. Dans VOORHEES E. M.,
HARMAN D. (&#233;d.): TREC Experiment and Evaluation in Information Retrieval. 233-257. 
</p>
<p>92</p>

</div></div>
</body></html>