<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitement s&#233;mantique par analyse distributionnelle des noms transdisciplinaires des &#233;crits scientifiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Traitement s&#233;mantique par analyse distributionnelle des noms 
transdisciplinaires des &#233;crits scientifiques 
</p>
<p>Agn&#232;s TUTIN
LIDILEM, Universit&#233; Grenoble 3, BP 25, 38040 Grenoble Cedex 09 
</p>
<p>agnes.tutin@u-grenoble3.fr
</p>
<p>R&#233;sum&#233;. Dans cette &#233;tude sur le lexique transdisciplinaire des &#233;crits scientifiques, nous 
souhaitons &#233;valuer dans quelle mesure les m&#233;thodes distributionnelles de TAL peuvent faciliter 
la t&#226;che du linguiste dans le traitement s&#233;mantique de ce lexique. Apr&#232;s avoir d&#233;fini le champ 
lexical et les corpus exploit&#233;s, nous testons plusieurs m&#233;thodes bas&#233;es sur des d&#233;pendances 
syntaxiques et observons les proximit&#233;s s&#233;mantiques et les classes &#233;tablies. L&#8217;hypoth&#232;se que 
certaines relations syntaxiques  - en particulier les relations de sous-cat&#233;gorisation &#8211; sont plus 
appropri&#233;es pour &#233;tablir des classements s&#233;mantiques n&#8217;appara&#238;t qu&#8217;en partie v&#233;rifi&#233;e. Si les 
relations de sous-cat&#233;gorisation g&#233;n&#232;rent des proximit&#233;s s&#233;mantiques entre les mots de 
meilleure qualit&#233;, cela ne semble pas le cas pour la classification par voisinage. 
</p>
<p>Abstract. In this study about general scientific lexicon, we aim at evaluating to what extent 
distributional methods in NLP can enhance the linguist&#8217;s task in the semantic treatment. After 
a definition of our lexical field and a presentation of our corpora, we evaluate several methods 
based on syntactic dependencies for establishing semantic similarities and semantic classes. 
Our hypothesis that some syntactic relations &#8211; namely subcategorized relations &#8211; is more 
relevant to establish semantic classes does not entirely appears valid. If subcategorized 
relations produce better semantic links between words, this is not the case with neighbour 
joigning clustering method.  
</p>
<p>Mots-cl&#233;s : corpus &#8211; &#233;crits scientifiques - classes s&#233;mantiques &#8211; analyse distributionnelle. 
</p>
<p>Keywords: corpus &#8211; scientific writings &#8211; semantic classes &#8211; distributional analysis. 
</p>
<p>1 Introduction
Le traitement s&#233;mantique des &#233;l&#233;ments du lexique constitue un pr&#233;alable dans de nombreuses 
applications du TAL. Dans une application d&#8217;aide &#224; la r&#233;daction en Fran&#231;ais Langue Etrang&#232;re 
(Kraif &amp; Tutin 2006), nous souhaitons ainsi effectuer un traitement du lexique 
transdisciplinaire des &#233;crits scientifiques et de ses collocations. Dans ce cadre, nous 
souhaiterions proposer une approche onomasiologique de ce lexique (i.e. avec un acc&#232;s par le 
sens plut&#244;t que par la forme), dont l&#8217;&#233;tude pourrait &#234;tre facilit&#233;e si les approches 
&#171; machinales &#187; (Habert &amp; Zweigenbaum 2003) de traitement s&#233;mantique &#224; partir d&#8217;analyse 
distributionnelle se r&#233;v&#233;laient concluantes pour le travail du linguiste. Dans cette &#233;tude, nous 
d&#233;sirons plus pr&#233;cis&#233;ment &#233;valuer la pertinence des m&#233;thodes d&#8217;analyse distributionnelle 
bas&#233;es sur des d&#233;pendances syntaxiques pour la constitution de classes s&#233;mantiques 
homog&#232;nes de noms transdisciplinaires des &#233;crits scientifiques. Nous voudrions en particulier 
d&#233;terminer dans quelle mesure cette m&#233;thode, qui s&#8217;est r&#233;v&#233;l&#233;e adapt&#233;e &#224; des sous-langages 
sp&#233;cifiques pour la terminologie du droit (Bourigault &amp; Lame 2002), de l&#8217;immunologie (Harris 
et al. 1989) ou de la m&#233;decine (Nazarenko et al. (2001), peut &#234;tre appliqu&#233;e au lexique du 
genre des &#233;crits scientifiques qui pr&#233;sente davantage de polys&#233;mie. Nous faisons l&#8217;hypoth&#232;se 
</p>
<p>283</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agn&#232;s TUTIN
</p>
<p>que certaines relations syntaxiques de d&#233;pendance, plus contraintes sur le plan syntaxique et 
s&#233;mantique, produiront des associations s&#233;mantiques de meilleure qualit&#233;. 
</p>
<p>Dans un premier temps, nous d&#233;finirons le lexique transdisciplinaire des &#233;crits scientifiques, et 
pr&#233;senterons un premier classement s&#233;mantique manuel bas&#233; sur des propri&#233;t&#233;s linguistiques. 
Dans un second temps, nous &#233;valuerons les r&#233;sultats de la m&#233;thode distributionnelle employ&#233;e 
par Didier Bourigault (Bourigault 2002 ; Bourigault et Lame 2002) &#224; notre lexique, m&#233;thode 
qui dissocie les &#171; voisins en t&#234;te &#187; des &#171; voisins en expansion &#187;, et les comparerons au 
classement manuel. Puis, nous nous pencherons sur une seconde m&#233;thode bas&#233;e sur les 
d&#233;pendances syntaxiques que le mot soit recteur ou r&#233;gi (&#224; l&#8217;instar de Grefenstette 1996). Nous 
comparerons enfin les associations &#233;tablies avec les relations syntaxiques de sous-
cat&#233;gorisation et les associations issues des relations de modification. Nous finirons par une 
&#233;valuation et une r&#233;flexion sur les m&#233;thodes distributionnelles &#171; machinales &#187; pour la t&#226;che 
linguistique qui nous int&#233;resse. 
</p>
<p>2 Le lexique transdisciplinaire des &#233;crits scientifiques : un 
premier classement manuel 
</p>
<p>Le lexique transdisciplinaire des &#233;crits scientifiques, qui appara&#238;t dans les articles de recherche, 
les monographies scientifiques, les m&#233;moires, les th&#232;ses et les rapports de recherche, est le 
lexique partag&#233; par la communaut&#233; scientifique mis en &#339;uvre dans la description et la 
pr&#233;sentation de l&#8217;activit&#233; scientifique. Ce lexique peut &#234;tre consid&#233;r&#233; comme un lexique de 
genre, n&#8217;int&#233;grant pas la terminologie du domaine, mais renvoyant aux concepts mis en &#339;uvre 
dans l&#8217;activit&#233; scientifique (examiner, prouver, r&#233;futer, concluant, hypoth&#232;se, examen, 
encourageant &#8230;) (Cf. aussi les d&#233;finitions un peu diff&#233;rentes du VGOS de Phal (1971) et les 
travaux de Pecman (2004) sur le lexique des &#233;crits des sciences &#171; dures &#187;). Nous nous 
int&#233;ressons en particulier au lexique m&#233;thodologique partag&#233; par l&#8217;ensemble des disciplines 
scientifiques, qu&#8217;il s&#8217;agisse des sciences exp&#233;rimentales, des sciences appliqu&#233;es ou des 
sciences humaines.  
</p>
<p>L&#8217;&#233;tude de ce lexique permet d&#8217;approfondir au plan linguistique et &#233;pist&#233;mologique la 
sp&#233;cificit&#233; de l&#8217;&#233;crit scientifique en rep&#233;rant un ensemble de traces lexicales embl&#233;matiques du 
genre. Ce traitement peut &#233;galement d&#233;boucher sur des applications didactiques comme l&#8217;aide 
&#224; la r&#233;daction en langue maternelle et en langue &#233;trang&#232;re. Dans cette perspective, nous 
souhaiterions proposer des outils facilitant le choix lexical pour les apprenants &#233;trangers, bas&#233;s 
sur un acc&#232;s onomasiologique (acc&#232;s par l&#8217;analogie ou la classe s&#233;mantique) ou 
s&#233;masiologique (par la forme) (Cf. Kraif &amp; Tutin 2006). A cet effet, un premier relev&#233; bas&#233; sur 
les noms fr&#233;quents et communs &#224; des corpus de plusieurs disciplines a &#233;t&#233; effectu&#233; puis filtr&#233;1.
Dans un second temps, ces noms ont &#233;t&#233; r&#233;partis dans des grandes classes s&#233;mantiques, &#224; partir 
de propri&#233;t&#233;s syntaxiques, morphologiques et s&#233;mantiques, un peu &#224; la fa&#231;on de Flaux et van 
de Velde (2000) pour les noms abstraits. Pour les 83 noms les plus fr&#233;quents, sept grandes 
classes ont &#233;t&#233; d&#233;gag&#233;es : 
</p>
<p>1 Ont &#233;t&#233; retenus un ensemble de noms (cat&#233;gorisation de Cordial) apparaissant plus de 15 fois en m&#233;decine, 
linguistique et &#233;conomie dans un corpus de 2 millions de mots. 
</p>
<p>284</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement s&#233;mantique par analyse distributionnelle des noms transdisciplinaires  
</p>
<p>1 Les noms de processus de l&#8217;activit&#233; scientifique (analyse, application, choix, &#8230;) sont 
des noms extensifs (se combinent avec lors, durant, des verbes phasiques, souvent avec 
faire), et ont un agent humain. 
</p>
<p>2 Les noms d&#8217;objets construits par l&#8217;activit&#233; scientifique ( approche, argument, concept, 
conception, d&#233;marche, &#8230;) ne sont pas extensifs,  ont un agent humain, se combinent avec 
des verbes comme &#233;laborer, construire.
</p>
<p>3 Les noms d&#8217;observables de l&#8217;activit&#233; scientifique (cas, donn&#233;es, &#233;chantillon, exemple, 
facteur,&#8230;) ne sont pas extensifs, se combinent avec le support &#234;tre et avec les verbes 
analyser, examiner, &#233;tudier.
</p>
<p>4 Les noms de supports de la r&#233;daction scientifique (article, chapitre, conclusion, 
document, figure, &#8230;) sont &#224; la fois concrets et abstraits non extensifs. Ils se combinent 
avec la pr&#233;position dans, et sont sujets du verbe pr&#233;senter.
</p>
<p>5 Les noms de caract&#233;risation (caract&#232;re, caract&#233;ristique, diff&#233;rence, difficult&#233;, 
fonction,&#8230;) sont des noms intensifs, se combinant souvent avec le support avoir et sont 
g&#233;n&#233;ralement accompagn&#233;s d&#8217;un adjectif.  
</p>
<p>6 Les noms d&#8217;acteurs de l&#8217;activit&#233; scientifique (auteur, chercheur, &#8230;) sont des noms 
humains, souvent sujets des verbes d&#8217;activit&#233; scientifique (examiner, d&#233;crire, observer
&#8230;).
</p>
<p>7 Les noms de relation logique (but, cause, cons&#233;quence, corr&#233;lation, effet, influence, 
liaison, lien, rapport, relation&#8230;), qui sont abstraits et non extensifs, se combinent avec les 
supports &#234;tre et avoir et  apparaissent souvent dans des structures : Nlogique de N.. 
</p>
<p>Les noms polys&#233;miques comme rapport ou &#233;tude sont bien entendu rattach&#233;s &#224; plusieurs 
classes. Ce premier classement sera notre &#233;talon pour l&#8217;&#233;valuation des m&#233;thodes 
distributionnelles automatiques.
</p>
<p>3 Le corpus des &#233;crits scientifiques 
Les m&#233;thodes distributionnelles machinales sont tributaires des donn&#233;es textuelles exploit&#233;es. 
La qualit&#233; des associations lexicales extraites d&#233;pend en effet tr&#232;s largement de l&#8217;homog&#233;n&#233;it&#233; 
et de la repr&#233;sentativit&#233; des corpus trait&#233;s. Pour cette &#233;tude, nous avons constitu&#233; un corpus de 
2 millions de mots comprenant plusieurs genres d&#8217;&#233;crits scientifiques du fran&#231;ais (articles 
scientifiques, th&#232;ses, rapports, cours) dans trois disciplines assez diff&#233;rentes : la linguistique, 
l&#8217;&#233;conomie et la m&#233;decine (Le tableau 1 indique le nombre de mots pour chaque type de texte). 
Le corpus d&#8217;articles scientifiques est extrait du corpus KIAP2 &#233;labor&#233; par l&#8217;&#233;quipe de Kjersti 
Fl&#248;ttum, de l&#8217;Universit&#233; de Bergen. Notre objectif sera d&#8217;observer comment s&#8217;effectuent les 
regroupements des noms transdisciplinaires qui ont des comportements syntaxiques analogues. 
</p>
<p>Linguistique Economie M&#233;decine
</p>
<p>Articles de revues (corpus 
KIAP)
</p>
<p>285 881 mots 374 516 mots 164 315 mots 
</p>
<p>Th&#232;ses, rapports, cours 364 812 mots 286 653 mots 492 173 mots 
</p>
<p>Total 650 693 mots 661 169 mots 656 488 mots 
</p>
<p>Tableau 1 : Corpus des &#233;crits scientifiques 
</p>
<p>2  KIAP : Kulturell Identitet i Akademisk Prosa. Cf. http://kiap.aksis.uib.no/ 
</p>
<p>3
285</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agn&#232;s TUTIN
</p>
<p>4 La m&#233;thode distributionnelle du linguiste et l&#8217;analyse 
distributionnelle machinale 
</p>
<p>Pour &#233;tablir des associations s&#233;mantiques, l&#8217;int&#233;r&#234;t de l&#8217;analyse distributionnelle para&#238;t aller de 
soi, puisqu&#8217;il est classique dans la tradition de la s&#233;mantique lexicale, en particulier europ&#233;enne 
(Cruse 1986, par exemple), de consid&#233;rer que des mots qui ont des environnements 
syntaxiques comparables partagent des propri&#233;t&#233;s s&#233;mantiques non triviales, allant de la 
synonymie pour les associations les plus fortes &#224; la co-hyponymie (Cf. aussi l&#8217;&#233;tude r&#233;alis&#233;e 
par Galy &amp; Bourigault (&#224; para&#238;tre)). Le recours aux distributions syntaxiques pour mettre en 
&#233;vidence les propri&#233;t&#233;s s&#233;mantiques permet au linguiste de s&#8217;appuyer sur des crit&#232;res tangibles, 
palpables, et non plus des approximations notionnelles.  
</p>
<p>Cependant, la m&#233;thode distributionnelle du linguiste, qui fait appel en partie &#224; son intuition de 
sujet parlant et cat&#233;gorisant, diff&#232;re assez largement de l&#8217;approche distributionnelle 
&#171; orthodoxe &#187;, en particulier dans Harris et al. (1989), enti&#232;rement bas&#233;e sur les observables du 
corpus. En effet, le linguiste choisit tout d&#8217;abord les contextes lexicaux qui lui apparaissent les 
plus pertinents pour circonscrire la notion qui l&#8217;int&#233;resse (Cf. par exemple, la notion de classe 
d&#8217;objets, chez Gaston Gross (1994)). Dans notre champ  lexical, par exemple, on pourra ainsi 
rep&#233;rer comme &#8216;objets construits par l&#8217;activit&#233; scientifique&#8217; des noms qui se combinent 
r&#233;guli&#232;rement avec les verbes de la s&#233;rie &#233;laborer, construire, concevoir. Le linguiste laissera 
de c&#244;t&#233; les associations lexicales qui lui apparaissent moins d&#233;terminantes, contrairement &#224; 
l&#8217;approche automatique qui ne peut pas s&#233;lectionner a priori les contextes lexicaux qui seront 
les plus r&#233;v&#233;lateurs. En outre, le linguiste effectue naturellement la d&#233;sambigu&#239;sation des 
notions, par exemple conclusion comme partie du texte, ou comme aboutissement d&#8217;un 
raisonnement, op&#233;ration qui sera beaucoup plus d&#233;licate avec une m&#233;thode machinale. Enfin, le 
linguiste compl&#232;te les donn&#233;es lacunaires du corpus ou &#233;carte les associations jug&#233;es atypiques. 
Si un contexte n&#8217;est pas observable dans les textes, il recourt &#224; son intuition pour v&#233;rifier si le 
contexte est possible. En bref, le linguiste s&#8217;aide du corpus, mais s&#8217;en abstrait partiellement 
pour les besoins interpr&#233;tatifs si besoin est. 
</p>
<p>La m&#233;thode distributionnelle &#171; orthodoxe &#187; appara&#238;t plus contrainte, puisqu&#8217;elle doit permettre 
de tirer toutes les observations du corpus et rien que du corpus. Le corpus doit donc &#224; la fois 
&#234;tre exhaustif pour la repr&#233;sentativit&#233; des associations lexicales (donc de grande taille), et tr&#232;s 
homog&#232;ne pour &#233;viter la polys&#233;mie. Cette approche donne g&#233;n&#233;ralement de bons r&#233;sultats dans 
le domaine de la terminologie (Bourigault &amp; Lame 2002 ; Harris et al. 1989 ; Nazarenko et al. 
2001) o&#249; le lexique pr&#233;sente peu de variations. Nous souhaitons &#233;valuer la m&#234;me m&#233;thode dans 
notre champ lexical, en exploitant des relations syntaxiques de d&#233;pendance. Nous faisons 
l&#8217;hypoth&#232;se qu&#8217;en s&#233;lectionnant certains types de relation, &#224; l&#8217;instar de la m&#233;thode 
distributionnelle &#171; manuelle &#187;, nous obtiendrons des r&#233;sultats de meilleure qualit&#233;. 
</p>
<p>5 &#201;valuation de m&#233;thodes d&#8217;analyse distributionnelle machinale 
bas&#233;es sur des d&#233;pendances syntaxiques 
</p>
<p>Dans les m&#233;thodes d&#8217;analyse distributionnelle machinale, plusieurs d&#233;finitions de la 
distribution ont &#233;t&#233; propos&#233;es. Les plus rustiques (Cf. par exemple Grefenstette (1996) peuvent 
simplement prendre en compte les mots pleins partag&#233;s dans une fen&#234;tre de quelques mots. Les 
distributions bas&#233;es sur les relations syntaxiques partag&#233;es donnent cependant de meilleurs 
r&#233;sultats sur les lex&#232;mes les plus fr&#233;quents, donc les plus significatifs (Grefenstette Ibid.). Nous 
adopterons cette derni&#232;re m&#233;thode en exploitant les d&#233;pendances syntaxiques obtenues sur 
</p>
<p>286</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement s&#233;mantique par analyse distributionnelle des noms transdisciplinaires  
</p>
<p>notre corpus &#224; l&#8217;aide des r&#233;sultats de l&#8217;analyseur Syntex (Bourigault et al. 2005). Nous 
&#233;valuerons les proximit&#233;s s&#233;mantiques &#233;tablies et les classes s&#233;mantiques obtenues &#224; l&#8217;aide des 
coefficients de similarit&#233; entre les mots. 
</p>
<p>5.1 Proximit&#233;s s&#233;mantiques &#233;tablies &#224; l&#8217;aide de la m&#233;thode de D. Bourigault 
(2002)
</p>
<p>La m&#233;thode distributionnelle a &#233;t&#233; appliqu&#233;e avec succ&#232;s par Didier Bourigault et ses coll&#232;gues 
&#224; plusieurs domaines dont la terminologie du droit (Bourigault &amp; Lame 2002). Cette approche 
pr&#233;sente deux originalit&#233;s : d&#8217;une part, elle dissocie les mots proches, appel&#233;s &#171; voisins &#187;, selon 
qu&#8217;ils sont recteurs (ou t&#234;tes) ou r&#233;gis (dans l&#8217;expansion) ; d&#8217;autre part, comme elle vise les 
applications terminologiques, elle prend en compte aussi bien les unit&#233;s que les syntagmes 
dans les relations syntaxiques de d&#233;pendance. Le syst&#232;me, appel&#233; Upery, bas&#233; sur les r&#233;sultats 
de l&#8217;analyse syntaxique du logiciel Syntex (Bourigault et al.  2005), extrait des triplets 
contenant le terme (unit&#233; lexicale simple ou complexe), la relation de d&#233;pendance, et le 
contexte (le syntagme ou &#233;l&#233;ment lexical r&#233;gi). Il rapproche ensuite, en utilisant des mesures de 
proximit&#233; comme le jaccard, les termes selon le nombre de contextes diff&#233;rents qu&#8217;ils 
partagent3. Par exemple, les mots article et chapitre, qui apparaissent &#224; la premi&#232;re ligne du 
tableau, partagent 6 contextes identiques (= a) lorsqu&#8217;ils sont accompagn&#233;s d&#8217;un adjectif4 (par 
exemple pr&#233;sent, suivant, dernier  &#8230;). article appara&#238;t lui-m&#234;me dans 18 contextes adjectivaux 
diff&#233;rents (= n1), alors que chapitre appara&#238;t lui-m&#234;me dans 12 contextes adjectivaux (= n2). 
Le coefficient jaccard utilis&#233; ici calcule la proximit&#233; s&#233;mantique entre les mots avec la formule 
suivante : a/(n1+n2-a). Seuls sont s&#233;lectionn&#233;s les voisins pour lesquels le coefficient de jaccard 
d&#233;passe 0,10 et qui ont au moins quatre types de contextes communs. 
</p>
<p>contexte1 rel1 contexte2 rel2 a n1 n2 jaccard
article ADJ chapitre ADJ 6 18 12 0.25
article EPI section EPI 6 11 19 0.25
tableau EPI chapitre EPI 21 84 21 0.25
Tableau 2 : Exemples de voisins en t&#234;te extraits &#224; l&#8217;aide de l&#8217;outil Upery de Didier Bourigault 
</p>
<p>Upery a &#233;t&#233; appliqu&#233; &#224; notre corpus d&#8217;&#233;crits scientifiques et sur le lexique des 85 noms 
transdisciplinaires class&#233;s. Nous avons ensuite &#233;valu&#233; les couples extraits &#224; partir des classes 
&#233;tablies manuellement, en examinant tour &#224; tour les voisins en expansion et les voisins en t&#234;te. 
</p>
<p>Les voisins en t&#234;te associent des mots qui sont des recteurs et qui partagent des contextes 
semblables avec une relation syntaxique donn&#233;e. Pour la liste de noms s&#233;lectionn&#233;s, on obtient 
516 r&#233;sultats. Nous avons observ&#233; pour chaque couple de voisins &#233;tabli si les deux &#233;l&#233;ments 
associ&#233;s appartenaient &#224; la m&#234;me classe dans notre classification manuelle. Si tel &#233;tait le cas, 
nous avons consid&#233;r&#233; que la r&#233;ponse &#233;tait acceptable et l&#8217;avons rejet&#233;e dans le cas inverse. Par 
exemple, l&#8217;association figure-chapitre a &#233;t&#233; consid&#233;r&#233;e comme satisfaisante car les deux noms 
font partie de la classe des &#8216;supports &#233;crits de l&#8217;activit&#233; scientifique&#8217;, mais l&#8217;association 
</p>
<p>3 La m&#233;thode ne prend pas en compte le nombre d&#8217;occurrences pour chaque contexte, contrairement &#224; d&#8217;autres 
approches comme celle de Grefenstette (1996) mais seuls sont retenus les contextes apparaissant plus de deux 
fois.
</p>
<p>4 Les relations pourraient ici &#234;tre diff&#233;rentes pour les deux &#233;l&#233;ments rapproch&#233;s. 
</p>
<p>5
287</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agn&#232;s TUTIN
</p>
<p>hypoth&#232;se-section  n&#8217;appara&#238;t pas valide car les deux &#233;l&#233;ments appartiennent &#224; des classes 
diff&#233;rentes.
</p>
<p>L&#8217;observation des r&#233;sultats r&#233;v&#232;le que 50,5 % des voisins en t&#234;te extraits rel&#232;vent de la m&#234;me 
classe, ce qui est a priori assez peu, &#233;tant donn&#233; le caract&#232;re assez l&#226;che des classes &#233;tablies 
manuellement. Les voisins en t&#234;te mettent en jeu de nombreuses relations de modification5,
facultatives, et peu contraintes sur le plan s&#233;mantique, comme la relation d&#8217;&#233;pith&#232;te ou 
d&#8217;attribut. Par exemple, les noms cas et mod&#232;le, assez distincts sur le plan s&#233;mantique, 
apparaissent dans 19 contextes adjectivaux communs. Un examen plus pouss&#233; montre que 
nombre de ces adjectifs sont tr&#232;s peu contraints du point de vue de leur s&#233;lection nominale (par 
exemple, autre, dernier, tel, g&#233;n&#233;ral, pr&#233;c&#233;dent) et donc probablement peu informatifs du point 
de vue s&#233;mantique.  
</p>
<p>Nous avons ensuite compar&#233; ces r&#233;sultats avec les voisins en expansion, c&#8217;est-&#224;-dire les cas o&#249; 
les noms transdisciplinaires sont r&#233;gis dans une relation de sujet ou de compl&#233;ment. Nous 
faisons l&#8217;hypoth&#232;se que ces relations qui mettent souvent en jeu des arguments sous-
cat&#233;goris&#233;s &#8211; mais pas uniquement &#8211;, souvent obligatoires, seraient davantage significatives 
pour &#233;tablir des proximit&#233;s s&#233;mantiques. Les r&#233;sultats obtenus, bien que peu nombreux, 
semblent aller dans ce sens. Utilisant les m&#234;mes seuils que pour les voisins en t&#234;te, 52 paires de 
voisins sont d&#233;gag&#233;es, dont 34 apparaissent valides (65,5% des paires). L&#8217;examen plus d&#233;taill&#233; 
des contextes partag&#233;s montre que les associations Nom-Verbe apparaissent souvent plus 
significatives que dans les contextes Nom-Adj, &#224; l&#8217;exception des relations o&#249; le verbe &#234;tre
appara&#238;t.
</p>
<p>5.2 Proximit&#233;s s&#233;mantiques &#233;tablies &#224; l&#8217;aide de l&#8217;ensemble des relations 
syntaxiques
</p>
<p>La m&#233;thode de Didier Bourigault dissocie les voisins qui apparaissent comme t&#234;tes des voisins 
qui apparaissent comme r&#233;gis (dans l&#8217;&#171; expansion &#187;). Ce traitement s&#233;par&#233; permet de mettre en 
lumi&#232;re des associations sp&#233;cifiques, comme l&#8217;association examiner des donn&#233;es et l&#8217;examen
des donn&#233;es, qui seraient autrement noy&#233;es dans l&#8217;ensemble des relations. Ce type 
d&#8217;observation n&#8217;&#233;tant pas essentiel pour notre &#233;tude, nous avons observ&#233;, &#224; l&#8217;instar de 
Grefenstette (1996) les proximit&#233;s s&#233;mantiques &#233;tablies &#224; partir de l&#8217;ensemble des relations 
syntaxiques, que le nom transdisciplinaire soit recteur (Ex : analyse des donn&#233;es) ou r&#233;gi (Ex : 
confirmer l&#8217;analyse &#8230;). Les contextes ont ici &#233;t&#233; r&#233;duits aux verbes, noms et adjectifs qui 
entretenaient une relation syntaxique avec le nom transdisciplinaire, et non plus &#224; tous les 
&#233;l&#233;ments (mots simples ou syntagmes) apparaissant en cooccurrence. L&#8217;id&#233;e &#233;tait ici de v&#233;rifier 
si une fusion des relations, en produisant un plus grand nombre de contextes communs, pouvait 
am&#233;liorer la qualit&#233; des r&#233;sultats.  
</p>
<p>La m&#233;thode employ&#233;e (avec les m&#234;mes seuils qu&#8217;en 5.1) produit 292 paires, dont 177 (soit 
60,5%) apparaissent correctement appari&#233;es. Les r&#233;sultats apparaissent donc meilleurs que 
pour les voisins en t&#234;te, mais cependant inf&#233;rieurs &#224; ceux des voisins en expansion.  
</p>
<p>5 Mais pas uniquement. On rep&#232;re aussi des relations de compl&#233;ments de noms comme dans l&#8217;efficacit&#233; de cette 
m&#233;thode ou l&#8217;&#233;laboration du mod&#232;le.
</p>
<p>288</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement s&#233;mantique par analyse distributionnelle des noms transdisciplinaires  
</p>
<p>En outre, une classification par voisinage (neighbour joining cluster) a &#233;t&#233; effectu&#233;e &#224; partir 
d&#8217;une une matrice contenant tous les coefficients de proximit&#233; (jaccard) &#8211; sans seuil &#8211; liant les 
mots (Cf. Fig. 1.a). Sur les 27 classes finales obtenues, 20 constituent des sous-ensembles des 7 
classes d&#233;finies manuellement (2 sous-ensembles ont des &#233;l&#233;ments uniques). Les sous-classes 
r&#233;v&#232;lent des associations lexicales fines, qui apparaissent pour la plupart appropri&#233;es pour 
notre approche onomasiologique. 
</p>
<p>5.3 Proximit&#233;s s&#233;mantiques &#233;tablies &#224; l&#8217;aide des relations de sous-
cat&#233;gorisation vs relations de modification 
</p>
<p>Nous faisons l&#8217;hypoth&#232;se que les relations syntaxiques mettant en jeu la sous-cat&#233;gorisation 
sont plus d&#233;terminantes pour &#233;tablir des proximit&#233;s s&#233;mantiques que les relations de 
modification, parce que les arguments sont davantage contraints sur le plan syntaxique et 
s&#233;mantique par les restrictions s&#233;lectionnelles. Les voisins en expansion - correspondant pour 
la plupart &#224; des relations de sous-cat&#233;gorisation - obtenus avec la m&#233;thode de Didier Bourigault 
semblaient aller dans ce sens. Nous avons souhait&#233; approfondir ce point en observant plus 
syst&#233;matiquement quelques relations de sous-cat&#233;gorisation. Les relations de sous-
cat&#233;gorisation observ&#233;es ont &#233;t&#233; la relation objet (confirmer une analyse), la relation sujet (les
r&#233;sultats infirment &#8230;), les compl&#233;ments nominaux en de, que le nom soit recteur (ou t&#234;te) 
(l&#8217;analyse des donn&#233;es) ou r&#233;gi (l&#8217;efficacit&#233; de la m&#233;thode)6.
</p>
<p>La m&#233;thode a d&#233;gag&#233; 76 paires, dont 48 ont &#233;t&#233; consid&#233;r&#233;es valides, soit 63 %. Nous avons 
ensuite compar&#233; ces r&#233;sultats avec les associations obtenues uniquement avec les modifieurs. 
Pour cela, nous avons s&#233;lectionn&#233; uniquement les relations liant l&#8217;adjectif &#233;pith&#232;te au nom, 
ainsi que la relation d&#8217;apposition. 582 paires ont &#233;t&#233; obtenues, parmi lesquelles 285 ont &#233;t&#233; 
valid&#233;es, soit 49%. On remarque donc que le nombre de paires obtenues par les relations de 
sous-cat&#233;gorisation appara&#238;t nettement moins important que le nombre de paires obtenues &#224; 
l&#8217;aide des relations de modification. Cette disparit&#233; des effectifs semble avoir une incidence sur 
les classes &#233;tablies &#224; l&#8217;aide de la m&#234;me m&#233;thode qu&#8217;en 5.2 (Cf. Fig. 1.b et Fig. 1.c), puisqu&#8217;on 
rel&#232;ve que les classes obtenues par les relations de sous-cat&#233;gorisation sont de moins bonne 
qualit&#233; (14 sur 23 classes sont des sous-classes de nos classes manuelles) que les classes 
obtenues &#224; l&#8217;aide des relations de modification (20 sur 29 classes apparaissent valides). 
</p>
<p>Le type de relation &#8211; sous-cat&#233;gorisation ou modification &#8211; semble donc avoir une incidence 
sur la qualit&#233; des associations produites avec la m&#233;thode distributionnelle lorsqu&#8217;on observe les 
proximit&#233;s entre mots. Les relations adjectivales et apposition, plus l&#226;ches, permettent moins 
facilement de rendre compte du sens des noms. Les relations de sous-cat&#233;gorisation paraissent 
plus adapt&#233;es pour cette t&#226;che, mais la sup&#233;riorit&#233; de l&#8217;analyse &#224; l&#8217;aide des relations de sous-
cat&#233;gorisation n&#8217;appara&#238;t cependant pas r&#233;elle si l&#8217;on observe les classes obtenues &#224; l&#8217;aide des 
coefficients de proximit&#233;, probablement du fait d&#8217;un nombre de relations syntaxiques moins 
important pour ces distributions syntaxiques. 
</p>
<p>6  Les relations incluant d&#8217;autres pr&#233;positions comme sur ou dans n&#8217;ont pas &#233;t&#233; retenues car elles mettent en jeu 
des relations de sous-cat&#233;gorisation ou de modification selon le contexte. Le logiciel Syntex ne fait pas la 
diff&#233;rence entre ces deux types de relations. 
</p>
<p>7
289</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agn&#232;s TUTIN
</p>
<p>(a) Ensemble des relations 
syntaxiques
</p>
<p>(b) Relations de sous-
cat&#233;gorisation
</p>
<p>(c) Relations de modification 
</p>
<p>Fig. 1 : Classification par voisinage &#224; partir des coefficients de proximit&#233; (jaccard) entre mots  
</p>
<p>290</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement s&#233;mantique par analyse distributionnelle des noms transdisciplinaires  
</p>
<p>Le tableau 2 r&#233;sume les r&#233;sultats des m&#233;thodes employ&#233;es. 
</p>
<p>Ensemble des relations de 
d&#233;pendance
</p>
<p>Relations de sous-
cat&#233;gorisation 
</p>
<p>Relations de 
modification 
</p>
<p>Nombre de paires d&#233;gag&#233;es 292 76 582
</p>
<p>Qualit&#233; estim&#233;e pour les paires 
obtenues (avec la mesure jaccard) 
</p>
<p>60,5% 63% 49%
</p>
<p>Pr&#233;cision des classes obtenues avec 
la classification par voisinage 
(calcul&#233;e &#224; partir du jaccard) 
</p>
<p>20/27 (74%) 14/23 (61%) 20/29 (69%) 
</p>
<p>Tableau 2 : Comparatif des m&#233;thodes employ&#233;es 
</p>
<p>6 Conclusion
Les m&#233;thodes d&#8217;analyse distributionnelle automatique appliqu&#233;es &#224; notre champ lexical 
n&#8217;apparaissent qu&#8217;en partie concluantes. Les voisins obtenus &#224; partir des distributions 
syntaxiques apparaissent valides &#224; 60% si l&#8217;on tient compte de l&#8217;ensemble des relations 
syntaxiques. Nos r&#233;sultats sont cependant pratiquement toujours meilleurs que ceux que 
Grefenstette (1996) obtient avec l&#8217;analyse syntaxique en comparant ses r&#233;sultats &#224; l&#8217;aune du 
th&#233;saurus Roget. Nos classes sont cependant plus l&#226;ches.
</p>
<p>La prise en compte des seules relations de sous-cat&#233;gorisation augmente la pr&#233;cision (63%), 
mais le rappel est plus faible du fait du faible nombre de relations envisag&#233;es. Les r&#233;sultats 
paraissent plus int&#233;ressants pour les classes obtenues par voisinage &#224; l&#8217;aide du coefficient de 
proximit&#233; (jaccard), surtout si l&#8217;on prend en compte l&#8217;ensemble des relations syntaxiques (sans 
privil&#233;gier les relations de sous-cat&#233;gorisation ou les relations de modification). Les classes 
obtenues confirment souvent la classification manuelle, tout en proposant des regroupements 
plus fins, probablement tr&#232;s utiles pour l&#8217;acc&#232;s onomasiologique que nous envisageons pour 
notre application d&#8217;aide &#224; la r&#233;daction. 
</p>
<p>Deux types de traitement linguistique pourraient probablement am&#233;liorer les r&#233;sultats. Tout 
d&#8217;abord, il serait souhaitable de normaliser les relations syntaxiques et les ramener &#224; des 
relations plus s&#233;mantiques. Par exemple, il n&#8217;y a pas lieu de distinguer la relation entre 
l&#8217;adjectif &#233;pith&#232;te et le nom, et celle qui lie l&#8217;adjectif attribut et le nom. En outre, pour pallier le 
manque de donn&#233;es, il pourrait &#234;tre utile de regrouper les relations par classes s&#233;mantiques, en 
utilisant la m&#233;thode distributionnelle de fa&#231;on incr&#233;mentale. Enfin, il appara&#238;t indispensable 
d&#8217;explorer d&#8217;autres mesures de similarit&#233;, comme la mesure prox, qui prend en compte la 
productivit&#233; de la relation syntaxique, ce qui n&#8217;est pas le cas de la mesure de jaccard. 
</p>
<p>Pour une application linguistique comme la n&#244;tre, la m&#233;thode peut n&#233;anmoins appara&#238;tre utile, 
si les donn&#233;es obtenues sont valid&#233;es manuellement. Le linguiste pourra ainsi partir des 
classifications obtenues automatiquement, observer les contextes partag&#233;s dans le corpus et 
corriger les donn&#233;es. Comme en terminologie, la m&#233;thode distributionnelle sera ainsi con&#231;ue 
comme une aide &#224; la d&#233;cision pour le lexicologue. 
</p>
<p>9
291</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agn&#232;s TUTIN
</p>
<p>Remerciements
Tout d&#8217;abord, un tr&#232;s grand merci &#224; Didier Bourigault qui m&#8217;a fourni les r&#233;sultats de 
l&#8217;analyseur Syntex ainsi que les r&#233;sultats du syst&#232;me d&#8217;analyse Upery et a relu une premi&#232;re 
version de ce papier. Merci &#233;galement &#224; Kjersti Fl&#248;ttum, de l&#8217;Universit&#233; de Bergen, qui m&#8217;a 
permis d&#8217;utiliser le corpus KIAP. Toute ma reconnaissance &#233;galement &#224; Christophe, le roi de 
Java, pour son aide. Merci aussi &#224; C&#233;cile Fr&#233;rot pour ses conseils et &#224; Olivier Kraif  pour sa 
relecture d&#8217;une premi&#232;re version de ce papier. 
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOURIGAULT D. (2002). Upery : un outil d'analyse distributionnelle &#233;tendue pour la construction 
d&#8217;ontologies &#224; partir de corpus. Actes de la 9&#232;me conf&#233;rence annuelle sur le Traitement Automatique des 
Langues (TALN 2002), Nancy, 2002, 75-84. 
BOURIGAULT D., FABRE C., FR&#201;ROT C., JACQUES M.-P. &amp; OZDOWSKA S. (2005), Syntex, analyseur 
syntaxique de corpus. Actes des 12&#232;mes journ&#233;es sur le Traitement Automatique des Langues 
Naturelles, Dourdan, France. 
BOURIGAULT D., LAME G. (2002). Analyse distributionnelle et structuration de terminologie. 
Application &#224; la construction d'une ontologie documentaire du Droit, in TAL, 43-1. 
CRUSE D.A. (1986). Lexical Semantics. Cambridge, London : Cambridge University Press (Cambridge 
Textbooks in Linguistics). 
GALY E., BOURIGAULT D. (&#224; para&#238;tre). Analyse distributionnelle de corpus de langue g&#233;n&#233;rale et 
synonymie. Actes JLC 2005. Lorient. 
GREFENSTETTE G. (1996). Evaluation techniques for automatic semantic extraction : Comparing 
syntactic and window based approaches. In Boguraev, B. and Pustejovsky, J., editors, Corpus
Processing for Lexical Acquisition. Cambridge, Massachusset : MIT Press, 205-216.  
GROSS G. (1994). Classes d'objets et description des verbes. Langages 115 , 15-30. 
HABERT, B. AND ZWEIGENBAUM, P. (2003). Classer les mots : s&#233;mantique &#224; gros grain et m&#233;thodologie 
harrissienne. Revue de S&#233;mantique et Pragmatique, (12), 101&#8211;119. 
HARRIS Z., GOTTFRIED M., RYCKMAN T. (1989). The Form of Information in Science, Analysis of 
Immunology Sublanguage. Kluwer Academic Publisher, Dordrecht, The Netherlands, 1989. 
KRAIF O., TUTIN A. (2006). Des corpus bilingues align&#233;s annot&#233;s s&#233;mantiquement pour l'aide &#224; la 
r&#233;daction: application aux collocations de la langue scientifique g&#233;n&#233;rale. Aide &#224; la r&#233;daction - Apports 
du Traitement Automatique des Langues, Journ&#233;e d'&#233;tude l'ATALA, Paris.
NAZARENKO A., ZWEIGENBAUM P. , HABERT B, BOUAUD J. (2001). Corpus-based Extension of a 
Terminological Semantic Lexicon. Recent Advances in Computational Terminology. Amtserdam : John 
Benjamins, 327-351. 
PECMAN M. (2004). Phras&#233;ologie contrastive anglais-fran&#231;ais : analyse et traitement en vue de l&#8217;aide &#224; 
la r&#233;daction scientifique, Th&#232;se de doctorat, Universit&#233; de Nice Sophia Antipolis, d&#233;cembre 2004. 
PHAL A. (1971). Vocabulaire g&#233;n&#233;ral d'orientation scientifique (V.G.O.S.) - Part du lexique commun 
dans l'expression scientifique. Paris : Didier, Cr&#233;dif. 
</p>
<p>292</p>

</div></div>
</body></html>