<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une r&#233;alisateur de surface bas&#233; sur une grammaire r&#233;versible</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Une r&#233;alisateur de surface bas&#233; sur une grammaire r&#233;versible
</p>
<p>Claire GARDENT1, &#201;ric KOW2
1 CNRS/LORIA, Nancy
2 INRIA/LORIA, Nancy
</p>
<p>{Claire.Gardent,Eric.Kow}@loria.fr
</p>
<p>R&#233;sum&#233;. En g&#233;n&#233;ration, un r&#233;alisateur de surface a pour fonction de produire, &#224; partir
d&#8217;une repr&#233;sentation conceptuelle donn&#233;e, une phrase grammaticale. Les r&#233;alisateur existants
soit utilisent une grammaire r&#233;versible et des m&#233;thodes statistiques pour d&#233;terminer parmi l&#8217;en-
semble des sorties produites la plus plausible ; soit utilisent des grammaires sp&#233;cialis&#233;es pour la
g&#233;n&#233;ration et des m&#233;thodes symboliques pour d&#233;terminer la paraphrase la plus appropri&#233;e &#224; un
contexte de g&#233;n&#233;ration donn&#233;. Dans cet article, nous pr&#233;sentons GENI, un r&#233;alisateur de surface
bas&#233; sur une grammaire d&#8217;arbres adjoints pour le fran&#231;ais qui r&#233;concilie les deux approches en
combinant une grammaire r&#233;versible avec une s&#233;lection symbolique des paraphrases.
</p>
<p>Abstract. In generation, a surface realiser takes as input a conceptual representation and
outputs a grammatical sentence. Existing realisers fall into two camps. Either they are based
on a reversible grammar and use statistical filtering to determine among the several outputs the
most plausible one. Or they combine a grammar tailored for generation and a symbolic means of
choosing the paraphrase most appropriate to a given generation context. In this paper, we present
GENI, a surface realiser based on a Tree Adjoining Grammar for French which reconciles both
approaches in that (i) the grammar used is r&#233;versible and (ii) paraphrase selection is based on
symbolic means.
</p>
<p>Mots-cl&#233;s : r&#233;alisation de surface, grammaire d&#8217;arbres adjoints, r&#233;versibilit&#233;.
Keywords: surface realisation, tree adjoining grammar, reversibility.
</p>
<p>1 Introduction
</p>
<p>En g&#233;n&#233;ration, le module de r&#233;alisation de surface a pour fonction de produire, &#224; partir d&#8217;une
repr&#233;sentation conceptuelle donn&#233;e, une phrase grammaticale. Par exemple, &#224; partir de l&#8217;entr&#233;e
donn&#233;e en (1a), un r&#233;alisateur de surface pourra produire l&#8217;une des variantes list&#233;e en (1b-1k).
</p>
<p>(1) a. jean(j) aimer(e,j,m) marie(m)
b. Jean aime Marie
c. Marie est aim&#233;e par Jean
d. Marie est aim&#233;e de Jean
e. C&#8217;est Marie que Jean aime
f. C&#8217;est Jean qui aime Marie
</p>
<p>(1) g. C&#8217;est Marie qui est aim&#233;e par Jean
h. C&#8217;est Marie qui est aim&#233;e de Jean
i. Marie, Jean l&#8217;aime
j. Marie, c&#8217;est Jean qui l&#8217;aime
k. Jean, c&#8217;est Marie qu&#8217;il aime
</p>
<p>Dans cet article, nous pr&#233;sentons un r&#233;alisateur de surface (GENI) qui combine une m&#233;thode</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claire GARDENT, &#201;ric KOW
</p>
<p>symbolique de s&#233;lection de paraphrases avec une grammaire r&#233;versible. En outre, le r&#233;alisateur
est param&#233;trable et peut &#234;tre utilis&#233; soit en mode d&#233;terministe (une seule solution produite), soit
en mode non d&#233;terministe (toutes les paraphrases associ&#233;es par la grammaire &#224; la s&#233;mantique
d&#8217;entr&#233;e sont produites).
L&#8217;utilisation de m&#233;thodes symboliques pour guider le choix de la paraphrase permet de prendre
en compte les facteurs contextuels impos&#233;s par un syst&#232;me de g&#233;n&#233;ration : la r&#233;alisation produite
est une r&#233;alisation appropri&#233;e pour un contexte donn&#233; plut&#244;t que la r&#233;alisation la plus fr&#233;quente
dans l&#8217;usage g&#233;n&#233;ral repr&#233;sent&#233; par un corpus d&#8217;apprentissage.
</p>
<p>L&#8217;utilisation d&#8217;une grammaire r&#233;versible a plusieurs avantages.
</p>
<p>Premi&#232;rement, elle permet d&#8217;utiliser le m&#234;me lexique et la m&#234;me grammaire pour l&#8217;analyse et
pour la r&#233;alisation. Etant donn&#233;e la difficult&#233; de d&#233;velopper de telles ressources, la question de
la r&#233;utilisabilit&#233; est un point non trivial.
</p>
<p>Deuxi&#232;mement, comme l&#8217;illustre la Redwood Lingo Treebank (Velldal &amp; Oepen, 2006), la r&#233;-
versibilit&#233; permet de cr&#233;er rapidement de tr&#232;s grandes suites de tests pour la r&#233;alisation : il suffit
pour ce faire d&#8217;analyser des phrases, de s&#233;lectionner parmi les sorties produites l&#8217;analyse corres-
pondant &#224; l&#8217;interpr&#233;tation de l&#8217;entr&#233;e et d&#8217;utiliser la repr&#233;sentation s&#233;mantique associ&#233;e comme
entr&#233;e pour le r&#233;alisateur. Par comparaison, les plus grandes suites de tests distribu&#233;es actuel-
lement avec les r&#233;alisateurs existants soit sont de taille restreinte (500 phrases distinces pour
SURGE, 210 pour KPML), soit exigent de d&#233;velopper un module de transformation permettant
de cr&#233;er &#224; partir d&#8217;un corpus arbor&#233; un format d&#8217;entr&#233;e adapt&#233; &#224; la r&#233;alisation (Callaway, 2003).
Troisi&#232;mement, la r&#233;versibilit&#233; permet de mieux mesurer la couverture et le pouvoir paraphras-
tique du r&#233;alisateur. La couverture est test&#233;e par une analyse doubl&#233;e d&#8217;une phase de r&#233;alisation
(la phrase d&#8217;entr&#233;e peut-elle &#234;tre &#224; la fois analys&#233;e et r&#233;alis&#233;e par le syst&#232;me ?). Le pouvoir
paraphrastique pourra &#234;tre mesur&#233; en utilisant le r&#233;alisateur en mode non d&#233;terministe (toutes
les paraphrases possibles sont produites) et en identifiant les sorties correctes produites par le
r&#233;alisateur pour une entr&#233;e donn&#233;e.
</p>
<p>Quatri&#232;mement, une grammaire r&#233;versible peut &#234;tre utilis&#233;e &#224; la fois pour la r&#233;alisation et pour
son inverse &#224; savoir, la construction s&#233;mantique (i.e., la construction pour une phrase de sa
ou ses repr&#233;sentations s&#233;mantique(s)). Si, comme nous cherchons &#224; le garantir dans GENI, le
r&#233;alisateur a un bon pouvoir paraphrastique, cela a pour effet que la grammaire peut &#234;tre utilis&#233;e
&#224; la fois pour g&#233;n&#233;rer et pour d&#233;tecter les paraphrases.
</p>
<p>L&#8217;article est structur&#233; de la fa&#231;on suivante. Nous commen&#231;ons par pr&#233;senter la grammaire (sec-
tion 2) et l&#8217;algorithme de base (section 3.1). Ce premier algorithme est un algorithme non d&#233;-
terministe qui produit l&#8217;ensemble des paraphrases associ&#233;es par la grammaire &#224; une repr&#233;sen-
tation s&#233;mantique donn&#233;e. Nous montrons ensuite comment une m&#233;thode de param&#233;trisation
des entr&#233;es permet de restreindre la r&#233;alisation aux seules paraphrases respectant les crit&#232;res
syntaxico-s&#233;mantiques sp&#233;cifi&#233;s par les param&#232;tres donn&#233;s en entr&#233;e (section 3.2). La section
4 pr&#233;sente des r&#233;sultats chiffr&#233;s donnant une indication de la couverture et du pouvoir para-
phrastique de GENI et la section 5 compare l&#8217;approche propos&#233;e avec les travaux connexes. La
section 6 conclut avec des pointeurs pour des recherches futures.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GenI, un r&#233;alisateur bas&#233; sur une grammaire r&#233;versible
</p>
<p>2 La grammaire
</p>
<p>Formalisme. La grammaire utilis&#233;e est une grammaire d&#8217;arbres adjoints lexicalis&#233;e bas&#233;e sur
l&#8217;unification (FLTAG, (Vijay-Shanker &amp; Joshi, 1988)). Une FLTAG comprend un ensemble
d&#8217;arbres &#233;l&#233;mentaires et deux op&#233;rations permettant de combiner ces arbres entre eux, l&#8217;op&#233;-
ration de substitution et l&#8217;op&#233;ration d&#8217;adjonction. Les arbres r&#233;sultant d&#8217;une de ces op&#233;rations
sont appel&#233;s &#171;arbres d&#233;riv&#233;s&#187;.
</p>
<p>Les arbres &#233;l&#233;mentaires sont lexicalis&#233;s, c&#8217;est-&#224;-dire qu&#8217;ils sont explicitement associ&#233;s avec un
lemme ou une forme fl&#233;chie. Leurs noeuds sont &#233;tiquet&#233;s par deux structures de traits appel&#233;es
TOP et BOTTOM. Un arbre &#233;l&#233;mentaire est soit initial, soit auxiliaire. Un arbre initial est un
arbre dont les noeuds feuilles sont soit des noeuds terminaux, soit des noeuds dit de substitution
(marqu&#233;s par &#8595;). Un arbre auxiliaire est un arbre dont l&#8217;un des noeuds feuilles est un noeud
&#171;pied&#187; (marqu&#233; par &#8902;) &#233;tiquet&#233; par la m&#234;me cat&#233;gorie que le noeud racine.
L&#8217;op&#233;ration de substitution permet d&#8217;ins&#233;rer un arbre &#233;l&#233;mentaire ou d&#233;riv&#233; &#964;&#948; dans un arbre
initial &#964;&#945; : le noeud racine de &#964;&#948; est alors identifi&#233; avec un noeud de substitution dans &#964;&#945; et
les traits TOP sont unifi&#233;s (Top&#964;&#945; = Top&#964;&#948; ). L&#8217;op&#233;ration d&#8217;adjonction permet d&#8217;ins&#233;rer un arbre
auxiliaire &#964;&#946; dans un arbre quelconque &#964;&#945; &#224; un noeud n : les traits TOPn et BOTTOMn du
noeud n o&#249; se fait l&#8217;adjonction sont alors unifi&#233;s avec les traits TOP du noeud racine de l&#8217;arbre
auxiliaire et les traits BOTTOM de son noeud pied respectivement (Topn = TopRoot&#964;&#946; et Bottomn
= BottomFoot&#964;&#946; ). En fin de d&#233;rivation, les traits TOP et BOTTOM de chaque noeud de l&#8217;arbre
d&#233;riv&#233; produit sont unifi&#233;s.
</p>
<p>Grammaire et m&#233;ta-grammaire. La grammaire TAG utilis&#233;e est une grammaire produite
par compilation &#224; partir d&#8217;une sp&#233;cification plus abstraite appel&#233;e, metagrammaire. Dans cette
m&#233;tagrammaire, un arbre &#233;l&#233;mentaire est d&#233;fini par la combinaison d&#8217;un ou de plusieurs frag-
ments d&#8217;arbres et chaque fragment d&#8217;arbre encapsule une caract&#233;risque linguistique sp&#233;cifique.
Par exemple, tout arbre verbal dont le sujet est un sujet nominal canonique fera intervenir le
fragment d&#8217;arbre SUJETCANONIQUE. Plus g&#233;n&#233;ralement, chaque arbre &#233;l&#233;mentaire est associ&#233;
par le processus de compilation &#224; un profil listant l&#8217;ensemble des noms de fragments d&#8217;arbres
ayant particip&#233; &#224; sa construction. Comme l&#8217;illustre le profil de l&#8217;arbre donn&#233; en Figure 1, le
profil de chaque arbre donne ainsi des informations sur ses caract&#233;ristiques linguistiques. Or les
r&#233;alisateurs TAG utilisent souvent ce type d&#8217;information pour guider la r&#233;alisation (cf. (Yang
et al., 1991; Danlos, 1998)) mais l&#8217;association est faite de mani&#232;re manuelle ; Dans GENI, ces
informations sont automatiquement associ&#233;s avec chaque arbre &#233;l&#233;mentaire par le compilateur
de m&#233;tagrammaire.
</p>
<p>S
</p>
<p>N&#8595;x1 V
</p>
<p>dort
dort(x1)
</p>
<p>SUJETCANONIQUE
VERBEACTIF
</p>
<p>FIG. 1 &#8211; Profil d&#8217;un arbre
</p>
<p>Interface Syntaxe/S&#233;mantique. Dans la grammaire d&#8217;arbres adjoints utilis&#233;e, le lien entre
structure syntaxique et repr&#233;sentation s&#233;mantique se fait de la fa&#231;on illustr&#233;e par la figure 2.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claire GARDENT, &#201;ric KOW
</p>
<p>Chaque arbre &#233;l&#233;mentaire est associ&#233; avec une repr&#233;sentation s&#233;mantique o&#249; les arguments man-
quants sont des variables d&#8217;unification. Ces variables apparaissent en outre sur certains noeuds
de l&#8217;arbre et sont instanti&#233;es par le biais des substitutions et des adjonctions1. Ainsi, dans la
d&#233;rivation de Jean court souvent illustr&#233; ci-dessous, j unifie avec s et r avec x si bien que la
repr&#233;sentation s&#233;mantique finale est nom(j,jean), courir(r,j), souvent(r).
</p>
<p>Nj
</p>
<p>Jean
</p>
<p>nom(j,jean)
</p>
<p>S
</p>
<p>N&#8595;s Vr
</p>
<p>court
</p>
<p>courir(r,s)
</p>
<p>Vx
</p>
<p>V* Adv
</p>
<p>souvent
</p>
<p>souvent(x)
&#8658; nom(j,jean), courir(r,j), souvent(r)
</p>
<p>FIG. 2 &#8211; &#8220;Jean court souvent&#8221;
</p>
<p>Couverture. La grammaire (Crabb&#233; &amp; Duchier, 2004) couvre la grammaire noyau du fran&#231;ais
d&#233;crite dans (Abeill&#233;, 2002) c&#8217;est-&#224;-dire, l&#8217;ensemble des cadres syntaxiques de base qui y sont
list&#233;s et pour chacun de ces cadres, l&#8217;ensemble des redistributions (actif, passif, moyen, neutre,
r&#233;flexivisation, impersonnel, passif-impersonnel) et des r&#233;alisations d&#8217;arguments permises (cli-
ticisation, extraction, ommission, variations d&#8217;ordre).
</p>
<p>3 Le r&#233;alisateur GENI
</p>
<p>Nous commen&#231;ons par d&#233;crire l&#8217;algorithme de base utilis&#233; par GENI. Cet algorithme est un
algorithme non d&#233;terministe permettant de g&#233;n&#233;rer l&#8217;ensemble des paraphrases associ&#233;es par la
grammaire &#224; une entr&#233;e s&#233;mantique telle que celle donn&#233;e en (1a). Nous montrons ensuite com-
ment cet algorithme peut &#234;tre modifi&#233; pour assurer le d&#233;terminisme et g&#233;n&#233;rer parmi l&#8217;ensemble
des paraphrases possibles, la paraphrase respectant les contraintes plac&#233;es sur une verbalisation
par un contexte de g&#233;n&#233;ration donn&#233;.
</p>
<p>3.1 G&#233;n&#233;rer toutes les paraphrases
</p>
<p>L&#8217;algorithme de base est un algorithme tabulaire (Kay, 1996) ascendant optimis&#233; pour les gram-
maires d&#8217;arbres adjoints. Une sp&#233;cification d&#233;taill&#233;e de l&#8217;algorithme et des optimisations d&#233;-
ploy&#233;es est donn&#233;e dans (Gardent &amp; Kow, 2005). Par manque de place, nous nous contentons
ici d&#8217;illustrer son fonctionnement par un exemple.
</p>
<p>Supposons que la s&#233;mantique donn&#233;e en entr&#233;e soit courir(r,j),nom(j,jean),souvent(r).
L&#8217;algorithme proc&#232;de de la fa&#231;on suivante. Dans un premier temps (phase de s&#233;lection lexi-
cale), les arbres &#233;l&#233;mentaires dont la s&#233;mantique subsume une partie de l&#8217;entr&#233;e sont s&#233;lection-
n&#233;s. Pour notre exemple, les arbres s&#233;lectionn&#233;s seront (entre autre) les arbres de Jean, court
et souvent (cf. Figure 2). La deuxi&#232;me &#233;tape (phase de substitution) consiste &#224; explorer syst&#233;-
matiquement les possibilit&#233;s de combinaisons par substitution. Pour l&#8217;exemple consid&#233;r&#233;, cette
</p>
<p>1Pour plus de d&#233;tails sur le calcul s&#233;mantique utilis&#233;, cf. (Gardent &amp; Kallmeyer, 2003).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GenI, un r&#233;alisateur bas&#233; sur une grammaire r&#233;versible
</p>
<p>exploration permettra de substituer l&#8217;arbre pour Jean dans l&#8217;arbre pour court (cf. Figure 2). La
troisi&#232;me &#233;tape (phase d&#8217;adjonction) permet de combiner les arbres produits par adjonction.
C&#8217;est &#224; ce stade que l&#8217;arbre pour souvent sera adjoint &#224; l&#8217;arbre d&#233;riv&#233; pour Jean court. En dernier
ressort (phase d&#8217;extraction), les cha&#238;nes &#233;tiquettant les items couvrant la s&#233;mantique donn&#233;e
en entr&#233;e sont produites en l&#8217;occurrence : Jean court souvent.
</p>
<p>3.2 G&#233;n&#233;rer une seule paraphrase
</p>
<p>L&#8217;algorithme pr&#233;sent&#233; dans la section pr&#233;c&#233;dente est non d&#233;terministe et produit, pour une en-
tr&#233;e s&#233;mantique donn&#233;e, l&#8217;ensemble des paraphrases associ&#233;es par la grammaire &#224; cette entr&#233;e.
L&#8217;entr&#233;e (1a) par exemple, permet la r&#233;alisation de l&#8217;ensemble des paraphrases list&#233;es en (1b-
1k).
Pour une utilisation au sein d&#8217;un syst&#232;me de g&#233;n&#233;ration, il est n&#233;cessaire de pouvoir contraindre
l&#8217;algorithme de facon &#224; pouvoir s&#233;lectionner, parmi l&#8217;ensemble des paraphrases possibles, la
paraphrase appropri&#233;e au contexte consid&#233;r&#233;. Nous montrons maintenant comment l&#8217;entr&#233;e s&#233;-
mantique de GENI peut &#234;tre enrichie pour guider l&#8217;algorithme dans ses choix et assurer le d&#233;-
terminisme.
</p>
<p>Au plus une verbalisation. Dans l&#8217;algorithme pr&#233;sent&#233; en section 3, le non d&#233;terminisme
provient principalement2 de l&#8217;ambiguit&#233; lexicale : pour chaque lit&#233;ral l dans l&#8217;entr&#233;e, il y a
g&#233;n&#233;ralement plus d&#8217;un arbre &#233;l&#233;mentaire s&#233;lectionn&#233; par la phase de s&#233;lection lexicale. Ainsi
pour chaque entr&#233;e s&#233;mantique, la sortie de GENI est donn&#233;e par l&#8217;ensemble des combinaisons
d&#8217;arbres &#233;l&#233;mentaires couvrant la s&#233;mantique d&#8217;entr&#233;e et dont la combinaison par substitution
ou adjonction est permise par la grammaire.
Pour permettre le d&#233;terminisme, nous associons &#224; chaque litt&#233;ral un identifiant d&#8217;arbre. Comme
nous l&#8217;avons vu en section 2, la grammaire utilis&#233;e est produite par un processus de compilation
qui associe &#224; chaque arbre &#233;l&#233;mentaire un profil r&#233;sumant ses caract&#233;ristiques linguistiques.
Parce que ce profil recense l&#8217;ensemble des fragments d&#8217;arbres utilis&#233;s pour construire un arbre
donn&#233; et parce que chaque arbre diff&#232;re d&#8217;un autre par au moins un fragment d&#8217;arbre dans son
profil, le profil de chaque arbre &#233;l&#233;mentaire est un identifiant pour cet arbre3. Nous utilisons
cette caract&#233;ristique de la grammaire pour guider la r&#233;alisation et assurer son d&#233;terminisme de
la facon suivante :
</p>
<p>1. Chaque lit&#233;ral li dans l&#8217;entr&#233;e est associ&#233;e avec un identifiant d&#8217;arbre Ai. Cet identifiant est un
profil simplifi&#233; ne prenant en compte que les informations utiles pour la g&#233;n&#233;ration et pr&#233;servant
l&#8217;unicit&#233; de l&#8217;arbre identifi&#233;.
</p>
<p>2. Pendant la r&#233;alisation, pour chaque paire li : Ai dans l&#8217;entr&#233;e enrichie, la s&#233;lection lexicale est
restreinte aux arbres dont la s&#233;mantique subsume li et dont le profil simplifi&#233; est Ai.
</p>
<p>Puisque chaque lit&#233;ral est associ&#233; avec un identifiant d&#8217;arbre et chaque identifiant d&#8217;arbre iden-
tifie un arbre unique, le r&#233;alisateur produira au plus une phrase. Les exemples (2a-2c) illustrent
</p>
<p>2Une seconde source de non d&#233;terminisme provient des modificateurs qui peuvent souvent s&#8217;adjoindre dans des
ordres diff&#233;rents (l&#8217;homme jeune et grand, l&#8217;homme grand et jeune). Ce type de non d&#233;terminisme est trait&#233; dans la
phase d&#8217;adjonction en regroupant les modificateurs d&#8217;une m&#234;me entit&#233; et en imposant un ordre unique d&#8217;adjonction
en cas d&#8217;ambiguit&#233;.
</p>
<p>3Il s&#8217;agit l&#224; d&#8217;une simplification. Dans certains cas (peu nombreux), deux arbres &#233;l&#233;mentaires distincts ont le
m&#234;me profil. Nous revenons sur ce point en section 4.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claire GARDENT, &#201;ric KOW
</p>
<p>le type de contraintes mises en jeu par GENI.
(2) a. lj :jean(j)/NomPropre la :aimer(e,j,m)/[SujetCanoniqueNominal, VerbeActif, ObjetCanonique-
</p>
<p>Nominal] lm :marie(m)/NomPropre
Jean aime Marie
Marie est aim&#233;e de Jean, C&#8217;est Jean qui aime Marie, etc.
</p>
<p>b. lc :le(c)/Det lc :chien(c)/NomCommun ld :dormir(e1,c)/SujetRelatif
lr :ronfler(e2,c)/SujetCanoniqueNominal
Le chien qui dort ronfle
Le chien qui ronfle dort
</p>
<p>c. lj :jean(j)/ProperName lp :promettre(e1,j,m,e2)/[SujetCanoniqueNominal, VerbeActif, Objet-
Completive] lm :marie(m)/ProperName le2 :partir(e2,j)/VerbeInfinitif
Jean promet &#224; Marie de partir
Jean promet &#224; Marie qu&#8217;il partira
</p>
<p>Au moins une verbalisation. Si une entr&#233;e enrichie permet de limiter la r&#233;alisation &#224; une
verbalisation maximum, elle ne garantit pas une solution au sens o&#249; la combinaison d&#8217;identi-
fiants d&#8217;arbres choisie peut ne pas &#234;tre r&#233;alisable. Mais comment v&#233;rifier la satisfiabilit&#233; d&#8217;une
entr&#233;e sans pour autant tenter de la r&#233;aliser ? Les syst&#232;mes existants donnent trois grands types
de r&#233;ponses &#224; cette question.
</p>
<p>Une premi&#232;re possibilit&#233; est de construire simultan&#233;ment entr&#233;e enrichie et verbalisation. C&#8217;est
le cas en particulier, des r&#233;alisateurs bas&#233;s sur les grammaires syst&#233;miques (KPML(Matthiessen
&amp; Bateman, 1991)) o&#249; la r&#233;alisation coincide avec la travers&#233;e d&#8217;un r&#233;seau syst&#233;mique permet-
tant d&#8217;associer &#224; un contenu s&#233;mantique (dimension id&#233;ationnelle dans la terminologie syst&#233;-
mique), une description syntaxique et fonctionnelle.
Une deuxi&#232;me possibilit&#233; consiste &#224; v&#233;rifier la validit&#233; de l&#8217;entr&#233;e sur un crit&#232;re partiel de bonne
formation. Par exemple, REALPRO (Lavoie &amp; Rambow, 1997) prend pour entr&#233;e un structure
syntaxique profonde de la th&#233;orie Sens-Texte (Mel&#8217;c&#780;uk &amp; &#381;olkovskij, 1970) et SURGE (Elha-
dad &amp; Robin, 1999) une description fonctionnelle des grammaires fonctionnelles d&#8217;unification.
Dans les deux cas, l&#8217;entr&#233;e n&#8217;est pas n&#233;cessairement satisfiable puisqu&#8217;elle doit &#234;tre valid&#233;e par
l&#8217;ensemble de la th&#233;orie. Dans la th&#233;orie sens-texte, la structure syntaxique profonde doit, pour
&#234;tre r&#233;alisable, pouvoir &#234;tre projet&#233;e successivement en une structure syntactique de surface,
une structure morphologique et une structure phon&#233;tique. Dans SURGE, l&#8217;entr&#233;e n&#8217;est r&#233;alisable
que si elle permet une travers&#233;e complete de la grammaire du noeud racine aux noeuds lexicaux
instanciant la s&#233;mantique d&#8217;entr&#233;e.
</p>
<p>Une troisi&#232;me possibilit&#233; consiste &#224; proc&#233;der de fa&#231;on incr&#233;mentale et &#224; faire des choix locaux
(algorithme gourmand) guid&#233;s par les contraintes introduites par les choix faits. C&#8217;est le cas
en particulier de l&#8217;algorithme semi-r&#233;cursif bas&#233; sur les grammaires d&#8217;arbres adjoints d&#233;crit
dans (Danlos, 1998) : &#224; chaque &#233;tape de la r&#233;alisation, un arbre unique est s&#233;lectionn&#233; et les
contraintes introduites par cet arbre sont utilis&#233;es pour contraindre le choix des arbres restant &#224;
s&#233;lectionner. En cas d&#8217;&#233;chec, l&#8217;algorithme fait un retour arri&#232;re.
</p>
<p>Nous adoptons une strat&#233;gie mixte o&#249; la technique dite de filtrage par polarit&#233;s est utilis&#233;e
pour :
</p>
<p>1. effectuer une v&#233;rification de la validit&#233; de l&#8217;entr&#233;e enrichie
2. proposer une alternative en cas d&#8217;&#233;chec de cette v&#233;rification</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GenI, un r&#233;alisateur bas&#233; sur une grammaire r&#233;versible
</p>
<p>3. proposer une entr&#233;e enrichie par d&#233;faut en cas d&#180;&#233;chec de r&#233;alisation
</p>
<p>Le filtrage par polarit&#233;s s&#8217;inspire des travaux de (Bonfante et al., 2003; Koller &amp; Striegnitz,
2002) et vise &#224; d&#233;tecter les combinaisons d&#8217;arbres &#233;l&#233;mentaires o&#249; besoins et ressources
syntaxico-s&#233;mantiques &#233;chouent &#224; s&#8217;annuler. Plus sp&#233;cifiquement, l&#8217;id&#233;e est de v&#233;rifier si pour
une entr&#233;e donn&#233;e, l&#8217;ensemble d&#8217;arbres s&#233;lectionn&#233;s est tel que chaque noeud de substitution et
chaque noeud pied peut &#234;tre associ&#233; avec exactement un arbre de la cat&#233;gorie syntaxique et de
l&#8217;index s&#233;mantique appropri&#233;.4
</p>
<p>Nous utilisons le filtrage par polarit&#233; pour filtrer les entr&#233;es enrichies non satisfiables (i.e., des
entr&#233;es dont la polarit&#233; est non nulle) mais &#233;galement pour proposer une entr&#233;e alternative en
cas de d&#233;tection d&#8217;entr&#233;e non satisfiable. Dans ce cas, l&#8217;entr&#233;e enrichie est d&#233;pouill&#233;e de ses
identifiants d&#8217;arbre et l&#8217;algorithme non d&#233;terministe est utilis&#233; avec additionellement une &#233;tape
de filtrage par polarit&#233; (introduite entre la phase de s&#233;lection lexicale et celle de substitution).
Les combinaisons d&#8217;arbres &#224; polarit&#233;s neutres (i.e., les combinaisons d&#8217;arbres o&#249; besoins et
ressources syntaxico-s&#233;mantiques s&#8217;annulent) sont ensuite compar&#233;es &#224; l&#8217;entr&#233;e enrichie initiale
et la combinaison la plus similaire &#224; cette entr&#233;e est alors propos&#233;e en alternative. La similarit&#233;
entre deux combinaisons d&#8217;arbres est mesur&#233;e par le nombre d&#8217;identifiant communs entre ces
deux combinaisons : plus le nombre d&#8217;identifiants commun aux deux s&#233;lections est grand, plus
les s&#233;lections sont similaires. Si plusieurs s&#233;lections sont &#233;galement similaires, un choix non
d&#233;terministe est fait.
</p>
<p>Enfin il est malgr&#233; tout possible qu&#8217;un ensemble d&#8217;arbres &#224; polarit&#233; neutre soit non satisfiable5.
Dans ce cas, l&#8217;algorithme utilise un enrichissement de la s&#233;mantique d&#8217;entr&#233;e par d&#233;faut qui
permet de g&#233;n&#233;rer une verbalisation &#171;canonique&#187; de cette s&#233;mantique.
</p>
<p>4 &#201;valuation
Afin d&#8217;&#233;valuer d&#8217;une part, le pouvoir paraphrastique du r&#233;alisateur et d&#8217;autre part, l&#8217;impact des
annotations de contr&#244;le sur le non-d&#233;terminisme, nous avons utilis&#233; une suite de tests gradu&#233;e.
Cette suite a &#233;t&#233; construite en (i) analysant un ensemble de phrases et (ii) s&#233;lectionnant pour
chaque phrase la repr&#233;sentation s&#233;mantique correcte6. Le r&#233;sultat est une suite de 80 repr&#233;sen-
tations s&#233;mantiques choisies pour illustrer les diff&#233;rents types de paraphrases grammaticales
d&#233;crites par la grammaire utilis&#233;e c&#8217;est-&#224;-dire,
</p>
<p>&#8211; les variations grammaticales dans la r&#233;alisation des arguments (cliv&#233;s, cliticisation, extrac-
tion, inversion du sujet, etc.) et la forme du verbe (passive/active, impersonnal, etc.)
</p>
<p>&#8211; les variations dans la r&#233;alisation des modificateurs (ant&#233;- vs post-pos&#233;s, adjectif vs subordon-
n&#233;e relative, &#233;pith&#232;te vs. attribut, etc.)
</p>
<p>&#8211; les variations permises par une &#233;quivalence morpho-d&#233;rivationnelle (Ex. arriv&#233;e/arriver)
Les 80 cas s&#233;lectionn&#233;s donnent lieu &#224; la g&#233;n&#233;ration par GENI de 1 528 phrases distinctes soit
un taux de paraphrases moyen par entr&#233;e de 18 avec une variation allant de 1 &#224; plus de 50
</p>
<p>4Les restrictions d&#8217;espace nous emp&#234;che d&#8217;expliciter ici la m&#233;thode de filtrage par polarit&#233;. Celle ci est cepen-
dant d&#233;taill&#233;e dans (Gardent &amp; Kow, 2005).
</p>
<p>5Le filtrage par polarit&#233; permet de d&#233;tecter la non satisfiabilit&#233; d&#8217;une combinaisons d&#8217;arbres pas d&#8217;assurer sa
satisfiabilit&#233;.
</p>
<p>6L&#8217;analyseur peut donner plusieurs analyses et donc souvent plusieurs repr&#233;sentations s&#233;mantiques dont cer-
taines repr&#233;sentent correctement le sens de la phrase analys&#233;e , d&#8217;autres non.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claire GARDENT, &#201;ric KOW
</p>
<p>FIG. 3 &#8211; Distribution du taux de variation paraphrastique
</p>
<p>paraphrases par repr&#233;sentation s&#233;mantique. La Figure 3 donne une description plus d&#233;taill&#233;e de
la distribution du taux de variation paraphrastique. Plus g&#233;n&#233;ralement, 42% des phrases avec un
verbe fini ont une &#224; 3 paraphrases (cas des verbes intransitifs), 44% 4 &#224; 28 paraphrases (verbes
prenant deux arguments) et 13% acceptent plus de 30 paraphrases (verbes &#224; trois arguments).
Pour les phrases contenant deux verbes finis, le ratio est de 5% des cas ayant 1 &#224; 3 paraphrases,
36% des cas ayant entre 4 et 14 paraphrases et 59% plus de 14 paraphrases. Enfin les phrases
contenant plus de 3 verbes finis acceptent toutes plus de 20 paraphrases.
</p>
<p>Afin de v&#233;rifier que l&#8217;utilisation des profils suffit &#224; assurer le d&#233;terminisme (cf. section 3.2),
nous avons calcul&#233; le nombre de cas o&#249; deux paraphrases d&#8217;un m&#234;me contenu partagent le
m&#234;me profil. Pour ce faire, nous avons &#233;tiquet&#233; de fa&#231;on automatique les 1 528 paraphrases
produites par GENI &#224; partir de la suite de test, avec leur profils (le profil d&#8217;une paraphrase est
l&#8217;ensemble des profils associ&#233;s aux arbres &#233;l&#233;mentaires utilis&#233;s pour construire l&#8217;arbre d&#233;riv&#233;
de cette paraphrase). Nous avons ensuite compar&#233;, pour chaque entr&#233;e de la suite de tests, les
profils de toutes les paires de paraphrases correspondantes et compt&#233; le nombre de fois o&#249; une
paire de paraphrases partage le m&#234;me profil.
</p>
<p>Cette manipulation montre que pour les 1 528 paraphrases consid&#233;r&#233;es, le profil &#233;choue &#224; refl&#233;ter
la diff&#233;rence entre deux paraphrases dans moins de 1% des cas. L&#8217;analyse des donn&#233;es fautives
r&#233;v&#232;le que les cas posant probl&#232;me sont les paires paraphrastiques impliquant uniquement (i)
une variation d&#8217;ordre des arguments (Ex. Jean donne une pomme &#224; Marie / Jean donne &#224; Marie
une pomme ) ou (2) une variation de position pour un modificateur (Ex. Jean donne ce soir une
pomme &#224; Marie /Jean donne une pomme ce soir &#224; Marie / Jean donne une pomme &#224; Marie
ce soir). Le premier cas peut &#234;tre r&#233;solu en modifiant la grammaire de fa&#231;on &#224; expliciter la
diff&#233;rence dans le profil des arbres &#233;l&#233;mentaires correspondant, le second en imposant un ordre
canonique sur l&#8217;adjonction des modificateurs.
</p>
<p>5 Discussion et comparaison avec travaux connexes
</p>
<p>GENI diff&#232;re des r&#233;alisateurs existants en ce qu&#8217;il combine l&#8217;utilisation d&#8217;une grammaire r&#233;ver-
sible avec un m&#233;canisme symbolique de s&#233;lection des paraphrases.
</p>
<p>Ainsi, les r&#233;alisateurs utilisant une grammaire r&#233;versible utilisent g&#233;n&#233;ralement des m&#233;thodes
statistiques pour choisir parmi l&#8217;ensemble des paraphrases associ&#233;es &#224; un sens par la grammaire,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GenI, un r&#233;alisateur bas&#233; sur une grammaire r&#233;versible
</p>
<p>la paraphrase la plus fr&#233;quente plut&#244;t que la paraphrase appropri&#233;e &#224; un contexte de g&#233;n&#233;ration
donn&#233;. Ils sont de ce fait mal adapt&#233;s &#224; une utilisation dans des sc&#233;narios de g&#233;n&#233;ration exigeant
un bon pouvoir paraphrastique et sont plut&#244;t mis en jeu soit dans des syst&#232;mes de traduction
(Carroll &amp; Oepen, 2005) soit dans des sc&#233;narios de g&#233;n&#233;ration o&#249; les textes &#224; produire sont for-
tement st&#233;r&#233;otyp&#233;s et o&#249; la paraphrase la plus fr&#233;quente est aussi la paraphrase la plus appropri&#233;e
dans une majorit&#233; des cas (White, 2004).
Par ailleurs, les r&#233;alisateurs utilisant un m&#233;canisme symbolique de s&#233;lection des paraphrases
(Danlos, 1998; Matthiessen &amp; Bateman, 1991; Elhadad &amp; Robin, 1999; Lavoie &amp; Rambow,
1997) mettent habituellement en jeu des grammaires qui ne sont pas r&#233;versibles c&#8217;est-&#224;-dire des
grammaires qui ne peuvent pas &#234;tre exploit&#233;es &#224; la fois pour associer un sens &#224; un texte (ana-
lyse) et pour verbaliser un sens donn&#233; (r&#233;alisation). Or comme nous l&#8217;avons mentionn&#233; dans
l&#8217;introduction, l&#8217;utilisation de la grammaire en analyse comme en r&#233;alisation est un point im-
portant. Outre qu&#8217;elle permet de minimiser l&#8217;effort de d&#233;veloppement sur la grammaire (chaque
modification apport&#233;e &#224; la grammaire ou au lexique b&#233;n&#233;ficie &#224; la fois &#224; l&#8217;analyse et &#224; la g&#233;n&#233;ra-
tion), cette dualit&#233; permet un meilleur contr&#244;le de la qualit&#233; et de la couverture de la grammaire
puisque l&#8217;analyseur permet de d&#233;tecter la sous-g&#233;n&#233;ration (i.e., la non g&#233;n&#233;ration de phrases
grammaticales) et le r&#233;alisateur la sur-g&#233;n&#233;ration (i.e., la g&#233;n&#233;ration de phrases agrammaticales).
Enfin, l&#8217;utilisation en mode double de la grammaire permet de produire automatiquement des
quantit&#233;s arbitraires d&#8217;entr&#233;es pour le r&#233;alisateur et ainsi de mieux tester son pouvoir paraphras-
tique. Par comparaison, l&#8217;entr&#233;e des r&#233;alisateurs non r&#233;versibles est g&#233;n&#233;ralement produite soit
par un syst&#232;me de g&#233;n&#233;ration, soit manuellement ce qui rend difficile une &#233;valuation pr&#233;cise de
leur couverture et pouvoir paraphrastique.
</p>
<p>6 Conclusion
</p>
<p>En r&#233;sum&#233;, GENI est un r&#233;alisateur de surface bas&#233; sur une grammaire d&#8217;arbres adjoints pour le
fran&#231;ais qui pr&#233;sente les propri&#233;t&#233;s suivantes :
</p>
<p>&#8211; GENI peut &#234;tre utilis&#233; en mode d&#233;terministe (une paraphrase) ou non-d&#233;terministe (toutes les para-
phrases)
</p>
<p>&#8211; GENI utilise une grammaire et un lexique r&#233;versible
&#8211; GENI utilise une grammaire qui associe aux paraphrases grammaticales une m&#234;me s&#233;mantique &#8211; ceci
</p>
<p>permet, gr&#226;ce &#224; la r&#233;versibilit&#233;, &#224; la fois un bon pouvoir paraphrastique et la d&#233;tection de paraphrases
&#8211; GENI est disponible en libre source (http://trac.loria.fr/~geni).
Outre les ph&#233;nom&#232;nes d&#233;crits en section 4, la grammaire utilis&#233;e par GENI est essentiellement la
grammaire sp&#233;cifi&#233;e par (Crabb&#233;, 2005) augment&#233;e avec une dimension s&#233;mantique (Gardent,
2006). Elle couvre donc l&#8217;essentiel de la TSNLP et des ph&#233;nom&#232;nes d&#233;crit dans (Abeill&#233;, 2002).
Le travail futur inclut (i) un passage &#224; grande &#233;chelle par l&#8217;extension de la grammaire et du
lexique et (ii) l&#8217;utilisation du r&#233;alisateur pour r&#233;duire la sur-g&#233;n&#233;ration.
</p>
<p>R&#233;f&#233;rences
ABEILL&#201; A. (2002). Une grammaire &#233;l&#233;ctronique du fran&#231;ais. CNRS Editions.
BONFANTE G., GUILLAUME B. &amp; PERRIER G. (2003). Analyse syntaxique &#233;lectrostatique.
&#201;volutions en analyse syntaxique, Revue TAL (Traitement Automatique des Langues), 44(3).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claire GARDENT, &#201;ric KOW
</p>
<p>CALLAWAY C. B. (2003). Evaluating coverage for large symbolic NLG grammars. In 18th
IJCAI.
CARROLL J. &amp; OEPEN S. (2005). High efficiency realization for a wide-coverage unification
grammar. 2nd IJCNLP.
CRABB&#201; B. (2005). Repr&#233;sentation informatique de grammaires fortement lexicalis&#233;es. PhD
thesis, Universit&#233; Henri Poincar&#233;, Nancy.
CRABB&#201; B. &amp; DUCHIER D. (2004). Metagrammar redux. In CSLP 2004, Copenhagen.
DANLOS L. (1998). G-TAG : un formalisme lexicalis&#233; pour la g&#233;n&#233;ration de textes inspir&#233; de
TAG. Traitement Automatique des Langues - T.A.L., 2.
ELHADAD M. &amp; ROBIN J. (1999). SURGE : a comprehensive plug-in syntactic realization
component for text generation. Computational Linguistics.
GARDENT C. (2006). Int&#233;gration d&#8217;une dimension s&#233;mantique dans les grammaires d&#8217;arbres
adjoints. In TALN 2006.
GARDENT C. &amp; KALLMEYER L. (2003). Semantic construction in FTAG. In 10th EACL,
Budapest.
GARDENT C. &amp; KOW E. (2005). Generating and selecting grammatical paraphrases. ENLG.
KAY M. (1996). Chart Generation. In 34th ACL, p. 200&#8211;204, Santa Cruz, California.
KOLLER A. &amp; STRIEGNITZ K. (2002). Generation as dependency parsing. In 40th ACL,
Philadelphia.
LAVOIE B. &amp; RAMBOW O. (1997). RealPro&#8211;a fast, portable sentence realizer. ANLP&#8217;97.
MATTHIESSEN C. &amp; BATEMAN J. (1991). Text generation and systemic-functional linguis-
tics : experiences from English and Japanese. Frances Pinter Publishers and St. Martin&#8217;s Press.
MEL&#8217; &#711;CUK I. &amp; &#381;OLKOVSKIJ A. (1970). Towards a functioning meaning-text model of lan-
guage. Linguistics, 57, 10&#8211;47.
VELLDAL E. &amp; OEPEN S. (2006). Statistical ranking in tactical generation. In EMNLP,
Sydney.
VIJAY-SHANKER K. &amp; JOSHI A. (1988). Feature Structures Based Tree Adjoining Grammars.
12th Computational linguistics, 55, v2.
WHITE M. (2004). Reining in CCG chart realization. In INLG, p. 182&#8211;191.
YANG G., MCKOY K. &amp; VIJAY-SHANKER K. (1991). From functional specification to syn-
tactic structure. Computational Intelligence, 7, 207&#8211;219.</p>

</div></div>
</body></html>