<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>PrepLex : un lexique des pr&#233;positions du fran&#231;ais pour l&#8217;analyse syntaxique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>PrepLex : un lexique des pr&#233;positions du fran&#231;ais pour
l&#8217;analyse syntaxique
</p>
<p>Kar&#235;n FORT1, Bruno GUILLAUME2
1 projets Calligramme et TALARIS, 2 projet Calligramme
</p>
<p>LORIA/INRIA Lorraine, UMR 7503, Nancy
{Karen.Fort,Bruno.Guillaume}@loria.fr
</p>
<p>R&#233;sum&#233;. PrepLex est un lexique des pr&#233;positions du fran&#231;ais. Il contient les informations
utiles &#224; des syst&#232;mes d&#8217;analyse syntaxique. Il a &#233;t&#233; construit en comparant puis fusionnant
diff&#233;rentes sources d&#8217;informations lexicales disponibles. Ce lexique met &#233;galement en &#233;vidence
les pr&#233;positions ou classes de pr&#233;positions qui apparaissent dans la d&#233;finition des cadres de
sous-cat&#233;gorisation des ressources lexicales qui d&#233;crivent la valence des verbes.
</p>
<p>Abstract. PrepLex is a lexicon of French prepositions which provides all the information
needed for parsing. It was built by comparing and merging several authoritative lexical sources.
This lexicon also shows the prepositions or classes of prepositions that appear in verbs sub-
categorization frames.
</p>
<p>Mots-cl&#233;s : pr&#233;positions, lexique, analyse syntaxique.
Keywords: prepositions, lexicon, parsing.
</p>
<p>1 Introduction
</p>
<p>Lors de la d&#233;finition de classes d&#8217;entr&#233;es lexicales en fonction de leur cat&#233;gorie, il appara&#238;t
naturellement une distinction entre deux types de classes. D&#8217;une part, les classes ferm&#233;es dont
on peut &#233;num&#233;rer tous les &#233;l&#233;ments de fa&#231;on exhaustive ; c&#8217;est le cas par exemple des pronoms
ou des d&#233;terminants. D&#8217;autre part, les classes ouvertes pour lesquelles il n&#8217;est pas possible de
lister tous les &#233;l&#233;ments (ils peuvent d&#233;pendre d&#8217;un vocabulaire sp&#233;cifique &#224; un domaine par
exemple) ; les quatre grandes classes ouvertes sont les noms, les verbes, les adjectifs et les
adverbes. La m&#233;thodologie de construction d&#8217;un lexique doit n&#233;cessairement &#234;tre adapt&#233;e en
fonction de cette notion de classe.
</p>
<p>Le statut de la classe des pr&#233;positions est plus difficile &#224; &#233;tablir. A priori, l&#8217;ensemble des pr&#233;-
positions peut sembler une classe ferm&#233;e dont on peut &#233;num&#233;rer les &#233;l&#233;ments ; en pratique, la
comparaison de diff&#233;rentes sources disponibles montre qu&#8217;il n&#8217;est pas facile de d&#233;terminer de
fa&#231;on exhaustive la liste des pr&#233;positions. Or, celles-ci repr&#233;sentent plus de 14% des lemmes du
fran&#231;ais1.
</p>
<p>1voir par exemple sur un corpus journalistique : https://www.kuleuven.be/ilt/blf/
rechbaselex_kul.php\#freq (Selva et al., 2002)
</p>
<p>219</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n FORT, Bruno GUILLAUME
</p>
<p>Dans un lexique complet, il est important d&#8217;avoir des informations de sous-cat&#233;gorisation pour
les mots pr&#233;dicatifs (Briscoe &amp; Carroll, 1993; Carroll &amp; Fang, 2004). Ces informations de
sous-cat&#233;gorisation font souvent r&#233;f&#233;rence &#224; des pr&#233;positions dans la description des argu-
ments. En effet, ces arguments sont souvent contraints &#224; utiliser une pr&#233;position particuli&#232;re (par
exemple compter sur) ou un ensemble de pr&#233;positions qui ont un aspect s&#233;mantique commun
(par exemple aller LOC, o&#249; LOC peut &#234;tre remplac&#233; par n&#8217;importe quelle pr&#233;position locative).
</p>
<p>Pour une analyse syntaxique profonde, il est utile de distinguer les compl&#233;ments indirects requis
par le verbe des autres compl&#233;ments adjoints ne figurant pas dans la valence du verbe. Les
deux exemples (1a) et (1b) ont la m&#234;me structure de surface et seule la s&#233;mantique permet de
distinguer les deux usages diff&#233;rents de la pr&#233;position sur : elle introduit un compl&#233;ment oblique
dans le premier cas et un compl&#233;ment adjoint dans le second. Ce probl&#232;me peut &#234;tre g&#233;r&#233; par
l&#8217;utilisation d&#8217;informations s&#233;mantiques plus fines.
</p>
<p>1a. Jean compte sur ses amis
1b. Jean compte sur ses doigts
</p>
<p>Cette distinction am&#232;ne &#224; distinguer deux usages diff&#233;rents des pr&#233;positions et est donc une
source d&#8217;ambigu&#239;t&#233; lexicale. Pour limiter cette ambigu&#239;t&#233;, il est important que le lexique rep&#232;re
les pr&#233;positions qui peuvent jouer ces deux r&#244;les (ce sont les pr&#233;positions argumentales).
</p>
<p>Notre travail est destin&#233; &#224; fournir un lexique utilisable par un analyseur syntaxique. Nous
nous sommes restreints aux aspects purement syntaxiques et &#224; quelques &#233;l&#233;ments s&#233;man-
tiques comme la d&#233;finition des ensembles de pr&#233;positions ayant un aspect s&#233;mantique commun
(comme LOC). Le lexique produit est diffus&#233; sous licence libre et a vocation &#224; &#234;tre int&#233;gr&#233; dans
des ressources plus larges, existantes ou &#224; venir.
</p>
<p>La section 2 d&#233;crit les sources utilis&#233;es et la m&#233;thodologie de comparaison, la section 3 d&#233;crit
les r&#233;sultats de cette comparaison. La section 4 d&#233;crit comment le lexique est constitu&#233; &#224; partir
des r&#233;sultats pr&#233;c&#233;dents. Enfin, la section 5 pr&#233;sente un exemple d&#8217;utilisation de ce lexique en
analyse syntaxique.
</p>
<p>2 M&#233;thodologie
</p>
<p>L&#8217;utilisation de pr&#233;positions dans le cadre d&#8217;une analyse syntaxique n&#233;cessite une liste large,
inventoriant &#224; la fois les pr&#233;positions non argumentales et celles susceptibles d&#8217;appara&#238;tre dans
les cadres de sous-cat&#233;gorisation des verbes.
</p>
<p>2.1 Utilisation de lexiques syntaxiques
</p>
<p>Bien entendu, il existe d&#233;j&#224; des lexiques syntaxiques, qui proposent un ensemble int&#233;ressant de
pr&#233;positions. Ainsi, le Lefff (Sagot et al., 2006) fournit une liste cons&#233;quente de pr&#233;positions,
mais la partie syntaxique du lexique est encore en cours de d&#233;veloppement, il pr&#233;sente donc peu
de pr&#233;positions dans les cadres de sous-cat&#233;gorisation des verbes. En outre, certaines pr&#233;posi-
tions du Lefff semblent obsol&#232;tes ou rares. Le dictionnaire fran&#231;ais-UNL (S&#233;rasset &amp; Boitet,
2000) en propose &#233;galement, mais sa couverture reste limit&#233;e et la qualit&#233; des entr&#233;es est encore
in&#233;gale. D&#8217;autres sources proposent des pr&#233;positions dans les cadres de sous-cat&#233;gorisation des
verbes, mais les listes ne sont pas tout &#224; fait coh&#233;rentes d&#8217;une source &#224; l&#8217;autre.
</p>
<p>220</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un lexique des pr&#233;positions
</p>
<p>Nous avons donc effectu&#233;, dans un premier temps, un travail d&#8217;inventaire des pr&#233;positions pr&#233;-
sentes dans un certain nombre de ressources, des lexiques et/ou dictionnaires d&#8217;une part, pour
la liste g&#233;n&#233;rale, des lexiques syntaxiques d&#8217;autre part, pour la liste de pr&#233;positions argumen-
tales. Deux ressources se classent cependant dans les deux cat&#233;gories, le Lefff et le dictionnaire
UNL :
&#8211; Le Lefff (Lexique des Formes Fl&#233;chies du Fran&#231;ais (Sagot et al., 2006)) est un lexique mor-
phologique et syntaxique du fran&#231;ais &#224; large couverture (plus de 110 000 lemmes). Dans sa
version 2.2.1, ce lexique contient 48 pr&#233;positions simples et 164 pr&#233;positions complexes. Il
pr&#233;sente &#233;galement des informations de sous-cat&#233;gorisation des verbes, qui font appara&#238;tre
14 pr&#233;positions que nous qualifierons d&#8217;argumentales.
</p>
<p>&#8211; UNL (Universal Networking Language (S&#233;rasset &amp; Boitet, 2000)), est un dictionnaire du
fran&#231;ais vers un anglais d&#233;sambigu&#239;s&#233; con&#231;u pour la traduction automatique, qui comprend
des informations syntaxiques dans sa partie fran&#231;aise. UNL n&#8217;a qu&#8217;une couverture assez
faible (moins de 27 000 lemmes), mais il propose dans sa partie anglaise des informations de
type s&#233;mantique que nous envisageons d&#8217;utiliser par la suite. UNL contient 48 pr&#233;positions
simples dont 10 apparaissant dans les cadres de sous-cat&#233;gorisation des verbes.
</p>
<p>2.2 Utilisation de sources de r&#233;f&#233;rence
</p>
<p>Nous avons ensuite compl&#233;t&#233; la liste de pr&#233;positions en utilisant diff&#233;rentes sources construites
manuellement, lexique ou dictionnaire, voire grammaire :
</p>
<p>&#8211; Le Grevisse (Grevisse, 1997), dans sa version papier, nous a permis de v&#233;rifier certaines
intuitions concernant l&#8217;obsolescence ou l&#8217;usage de certaines pr&#233;positions.
</p>
<p>&#8211; Le TLFi (Tr&#233;sor de la langue fran&#231;aise informatis&#233;), que nous avons consult&#233; via l&#8217;interface
du CNRTL2, offre une liste de pr&#233;positions un peu diff&#233;rente des autres. Elle comporte no-
tamment les formes voici et voil&#224;, rarement cit&#233;es dans les autres sources &#224; notre disposition.
</p>
<p>&#8211; Enfin, la base de pr&#233;positions PrepNet (Saint-Dizier, 2006) nous a permis de v&#233;rifier &#224; la fois
la compl&#233;tude de notre liste et les informations s&#233;mantiques pr&#233;sentes dans certaines sources.
</p>
<p>2.3 Utilisation de dictionnaires de valences verbales
</p>
<p>Nous avons ensuite cherch&#233; &#224; enrichir la liste des pr&#233;positions apparaissant dans les cadres de
sous-cat&#233;gorisation des verbes de Lefff et UNL en nous r&#233;f&#233;rant &#224; deux sources traitant plus
particuli&#232;rement des verbes :
</p>
<p>&#8211; Le dictionnaire de valences des verbes du fran&#231;ais DICOVALENCE, h&#233;ritier de PROTON
(van den Eynde &amp; Mertens, 2002), dont la d&#233;marche est fond&#233;e sur l&#8217;approche pronominale.
Dans sa version 1.1, ce dictionnaire donne les cadres valenciels de plus de 3700 verbes. Nous
avons extrait les pr&#233;positions simples et multi-mots qu&#8217;il contient (soit plus de 40), ainsi que
leurs traits s&#233;mantiques associ&#233;s.
</p>
<p>&#8211; Nous avons compl&#233;t&#233; cette liste de pr&#233;positions argumentales par celle de SynLex (Gardent
et al., 2006), lexique syntaxique cr&#233;&#233; &#224; partir des tables du lexique-grammaire du LADL
(Gross, 1975).
</p>
<p>2voir : http://www.cnrtl.fr
</p>
<p>221</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n FORT, Bruno GUILLAUME
</p>
<p>Lexiques Cadres de sous-cat&#233;gorisation
Lefff TLFi Grevisse PrepNet UNL Lefff DVa SynLex UNL
</p>
<p>&#224; X X X loc 319 895 887 246
apr&#232;s X X X loc X 2 12 1
aussi X
avec X X X X X 35 193 611 49
chez X X X loc X 9 1
</p>
<p>comme X X 14 11 10 3
de X X X deloc X 310 888 1980 282
</p>
<p>depuis X X X deloc X 2 1
derri&#232;re X X X loc X 3
devers X X X
dixit X
emmi X
entre X X X loc X 19 4
hormis X X X X X
jusque X X X X 7
l&#232;s X X X
</p>
<p>moyennant X X X X X
par X X X loc X 3 38 73 8
</p>
<p>parmi X X X loc X 7 7
pass&#233; X X
selon X X X X X 1 1
voici X X
</p>
<p>TAB. 1 &#8211; Quelques pr&#233;positions simples dans les diff&#233;rentes sources
aDICOVALENCE
</p>
<p>Nous avons, &#224; partir de ces diff&#233;rentes sources, effectu&#233; une &#233;tude syst&#233;matique de la pr&#233;sence
de chaque pr&#233;position, de leur appartenance &#233;ventuelle &#224; des cadres valenciels, ainsi que de
certains traits s&#233;mantiques qui leur sont associ&#233;s. Nous avons ensuite regroup&#233; les pr&#233;positions
qui apparaissaient &#224; la fois en tant qu&#8217;entr&#233;e lexicale et dans les cadres de sous-cat&#233;gorisation
des verbes.
</p>
<p>Il est &#224; noter que nous avons d&#251; restreindre notre analyse des cadres de sous-cat&#233;gorisation &#224;
ceux des verbes, du fait qu&#8217;il n&#8217;existe encore &#224; notre connaissance aucun lexique pr&#233;sentant une
information syntaxique suffisamment riche sur les adjectifs ou les noms.
</p>
<p>Les pr&#233;positions multi-mots pr&#233;sentant des caract&#233;ristiques (nombre) et des difficult&#233;s sp&#233;ci-
fiques (segmentation), nous en avons fait un inventaire s&#233;par&#233; selon les m&#234;mes m&#233;thodes.
</p>
<p>222</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un lexique des pr&#233;positions
</p>
<p>Lexiques Cadres de sous-cat&#233;gorisation
Lefff TLFi Grevisse PrepNet UNL Lefff DVa SynLex UNL
</p>
<p>&#224; cause de X X X
&#224; la faveur de X X
&#224; partir de X X deloc 1
afin de X X X X
</p>
<p>au nord de loc
au vu de X
aupr&#232;s de X X X loc 27 35
comme de 1
</p>
<p>conform&#233;ment &#224; X X
d&#8217;avec X 1 6
</p>
<p>en faveur de X X X 13
il y a X
jusqu&#8217;&#224; X loc X 10
jusqu&#8217;en X
jusqu&#8217;o&#249; X
loin de X X loc
</p>
<p>par suite de X
pour comble de X
</p>
<p>pr&#232;s de X X loc
quant &#224; X X X
</p>
<p>tout au long de X X
vis-&#224;-vis de X X X 1
</p>
<p>TAB. 2 &#8211; Quelques pr&#233;positions multi-mots dans les diff&#233;rentes sources
aDICOVALENCE
</p>
<p>3 R&#233;sultat de la comparaison des sources
</p>
<p>3.1 Pr&#233;positions simples
</p>
<p>Nous avons ainsi list&#233; 85 pr&#233;positions simples, dont 24 apparaissent dans des cadres de sous-
cat&#233;gorisation de verbes (cf. tableau 1).
</p>
<p>Il est &#224; noter que les 4 sources qui d&#233;crivent des cadres de sous-cat&#233;gorisation utilisent des
formats tr&#232;s diff&#233;rents. Lefffpropose une vision condens&#233;e des verbes, les cadres valenciels
&#233;tant regroup&#233;s dans une seule entr&#233;e ; &#224; l&#8217;oppos&#233;, SynLex et DICOVALENCE d&#233;crivent de
nombreux cadres en distinguant par exemple syst&#233;matiquement les diff&#233;rentes r&#233;alisations syn-
taxiques des arguments. Les valeurs relatives sur une ligne ne refl&#232;tent donc pas du tout la
couverture lexicale des sources.
</p>
<p>3.2 Pr&#233;positions multi-mots
</p>
<p>Nous avons obtenu une liste de 222 pr&#233;positions multi-mots, dont 18 apparaissent dans des
cadres de sous-cat&#233;gorisation de verbes (cf. tableau 2). Il est int&#233;ressant de noter que seuls
</p>
<p>223</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n FORT, Bruno GUILLAUME
</p>
<p>DICOVALENCE et SynLex proposent des pr&#233;positions multi-mots dans leurs cadres de sous-
cat&#233;gorisation. Le Lefff fournit quant &#224; lui une liste impressionante de pr&#233;positions multi-mots
(plus de 150) qui repr&#233;sente une excellente base de travail.
</p>
<p>4 Construction du lexique
</p>
<p>Le premier crit&#232;re de s&#233;lection que nous avons choisi d&#8217;appliquer pour construire notre lexique
est qu&#8217;une pr&#233;position doit &#234;tre list&#233;e dans au moins une source parmi celles cit&#233;es. Par ailleurs,
nous consid&#233;rons qu&#8217;une pr&#233;position est argumentale si elle appara&#238;t dans au moins un cadre de
sous-cat&#233;gorisation de verbe.
</p>
<p>4.1 Filtrage manuel
</p>
<p>Nous avons ensuite tri&#233; ces pr&#233;positions en fonction de crit&#232;res simples et avons identifi&#233; en
particulier celles qui &#233;taient &#224; &#233;liminer parce que :
&#8211; visiblement erron&#233;es, c&#8217;est le cas par exemple de aussi, pr&#233;sent dans le dictionnaire UNL en
tant que pr&#233;position,
</p>
<p>&#8211; obsol&#232;tes ou d&#8217;un emploi extr&#234;mement rare, comme emmi (TLFi), devers (Lefff, TLFi, Gre-
visse) ou encore comme de (DICOVALENCE).
</p>
<p>Nous avons &#233;galement effectu&#233; un tri dans les traits s&#233;mantiques et avons supprim&#233; les entr&#233;es
erron&#233;es, telles que avec comme locatif dans SynLex et dans DICOVALENCE.
</p>
<p>4.2 Quelques remarques
</p>
<p>Certaines sources font appara&#238;tre comme des pr&#233;positions des formes qui ne sont pas consid&#233;-
r&#233;es comme telles en linguistique. C&#8217;est le cas en particulier de :
&#8211; comme, qui n&#8217;est pas cit&#233; dans les trois sources de r&#233;f&#233;rence que sont le Grevisse, le TLFi et
PrepNet, il est en effet ambigu et peut &#233;galement &#234;tre consid&#233;r&#233; comme une conjonction,
</p>
<p>&#8211; il y a ou y compris, qui ne sont cit&#233;es que dans le Lefff,
&#8211; d&#8217;avec, qui, bien qu&#8217;il apparaisse dans le Grevisse, n&#8217;est pr&#233;sent que dans les cadres de sous-
cat&#233;gorisation de DICOVALENCE et SynLex.
</p>
<p>Nous avons choisi de conserver ces formes dans notre lexique, pour des raisons pratiques li&#233;es
&#224; l&#8217;application vis&#233;e, l&#8217;analyse syntaxique.
</p>
<p>Par ailleurs, m&#234;me si sa couverture est large, notre lexique n&#8217;est &#233;videmment pas exhaustif. Il
serait int&#233;ressant d&#8217;y ajouter certaines formes manquantes, notamment :
&#8211; des pr&#233;positions pr&#233;sentes dans le DAFLES (Selva et al., 2002), comme par exemple la forme
</p>
<p>au d&#233;triment de,
&#8211; des pr&#233;positions cit&#233;es dans des grammaires de r&#233;f&#233;rence, comme question, dans la Gram-
maire m&#233;thodique du fran&#231;ais (Riegel et al., 1997),
</p>
<p>&#8211; les multiples pr&#233;positions locatives (et, par m&#233;tonymie, temporelles) que peut pr&#233;fixer la
forme jusqu&#8217;, par exemple jusqu&#8217;aupr&#232;s de. Cette forme &#233;lid&#233;e de jusque pourrait sans doute
faire l&#8217;objet d&#8217;un traitement particulier en tant quemodifieur de pr&#233;position. Il en va d&#8217;ailleurs
de m&#234;me de d&#232;s, suivi d&#8217;un temporel (ou d&#8217;un locatif, par m&#233;tonymie).
</p>
<p>224</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un lexique des pr&#233;positions
</p>
<p>Lexiques Cadres de sous-cat&#233;gorisation
Lefff TLFi Grevisse PrepNet UNL PrepLex Lefff DV SynLex UNL PrepLex
44 69 55 36 46 49 14 24 18 11 23
</p>
<p>TAB. 3 &#8211; Total des pr&#233;positions simples par source
</p>
<p>Lexiques Cadres de sous-cat&#233;gorisation
Lefff TLFi Grevisse PrepNet UNL PrepLex Lefff DV SynLex UNL PrepLex
166 11 77 89 2 206 0 16 4 0 15
</p>
<p>TAB. 4 &#8211; Total des pr&#233;positions multi-mots par source
</p>
<p>Ce tri a &#233;galement permis de mettre en &#233;vidence certaines difficult&#233;s, en particulier les &#233;lisions
dans les formes multi-mots, telle afin de, afin d&#8217;, ou les contractions telles face &#224;, face au ou &#224;
partir de, &#224; partir du, qui seront trait&#233;es lors de la segmentation.
</p>
<p>D&#8217;autres, comme l&#232;s, qui n&#8217;est utilis&#233; qu&#8217;en toponymie dans des formes avec tirets (comme
Bathel&#233;mont-l&#232;s-Bauzemont), seront trait&#233;es en amont, lors de la segmentation.
</p>
<p>4.3 R&#233;sultats
</p>
<p>Au final, nous obtenons une liste de 49 pr&#233;positions simples, dont 23 apparaissent dans des
cadres de sous-cat&#233;gorisation des verbes, dans au moins une source, et sont donc consid&#233;r&#233;es
comme argumentales (cf. tableau 3).
</p>
<p>Nous obtenons &#233;galement une liste de plus de 200 pr&#233;positions multi-mots, dont 15 apparaissent
dans des cadres de sous-cat&#233;gorisation des verbes, dans au moins une source, et sont donc
consid&#233;r&#233;es comme argumentales (cf. tableau 4).
</p>
<p>Nous avons pour l&#8217;instant limit&#233; les informations s&#233;mantiques utilis&#233;es dans le lexique &#224; loc (lo-
catif) et deloc (d&#233;locatif), mais nous avons l&#8217;intention d&#8217;&#233;tendre ces cat&#233;gories &#224; celles retenues
dans DICOVALENCE (temps, quantit&#233;, mani&#232;re).
</p>
<p>En outre, nous nous sommes &#233;galement r&#233;f&#233;r&#233;s aux sources pour renseigner les cat&#233;gories des
arguments introduits par les pr&#233;positions argumentales.
</p>
<p>Il n&#8217;existe pas encore de format normalis&#233; pour les lexiques syntaxiques, m&#234;me si un effort
d&#8217;homog&#233;n&#233;isation est en cours (Projet Lexsynt). Actuellement, PrepLex est donc pr&#233;sent&#233; dans
un format texte qui permet &#224; la fois l&#8217;&#233;dition manuelle et l&#8217;utilisation dans un analyseur ou
dans d&#8217;autres outils de traitement de la langue. Dans ce format, les informations syntaxiques
sont d&#233;crites &#224; l&#8217;aide structures de traits r&#233;cursives de profondeur 2. Le niveau externe d&#233;crit
la structure en termes d&#8217;&#8220;argument&#8221; : ce niveau contient toujours un trait &#8220;head&#8221; et un trait
pour chacun des &#8220;arguments&#8221; de l&#8217;entr&#233;e. Le niveau interne d&#233;crit alors plus finement chaque
argument. De plus, ce format permet de d&#233;finir des informations syntaxiques de fa&#231;on modulaire
en factorisant les parties redondantes. Dans le cas des pr&#233;positions, toutes les entr&#233;es partagent
le m&#234;me squelette :
</p>
<p>Prep : [
head [cat=prep, prep=#, funct=#]
comp [cat=#, cpl=@]
]
</p>
<p>225</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n FORT, Bruno GUILLAUME
</p>
<p>Lorsque ce squelette est instanci&#233; pour une pr&#233;position particuli&#232;re, les 3 valeurs de traits (not&#233;es
&#8220;#&#8221;) doivent imp&#233;rativement &#234;tre renseign&#233;es et la valeur de trait not&#233;e &#8220;@&#8221; est optionnelle.
Ces traits sont rep&#233;r&#233;s par leur nom (prep, funct) pour la t&#234;te, par une notation point&#233;e
(comp.cat, comp.cpl) pour l&#8217;argument.
</p>
<p>&#224; Prep [prep=a|LOC; funct=aobj|loc|adj; comp.cat=np|sinf;
comp.cpl=void|ceque]
</p>
<p>apr&#232;s Prep [prep=apres|LOC; funct=obl|loc|adj; comp.cat=np]
avec Prep [prep=avec; funct=obl|adj; comp.cat=np]
&#224;_travers Prep [prep=a_travers;funct=obl|adj; comp.cat=np]
</p>
<p>Techniquement, la seule difficult&#233; est de choisir comment repr&#233;senter l&#8217;appartenance &#224; une
classe s&#233;mantique de pr&#233;positions comme loc. Ici, nous avons choisi de d&#233;finir comme va-
leurs atomiques possibles pour le trait &#8220;prep&#8221;, l&#8217;ensemble des pr&#233;positions argumentales et l&#8217;en-
semble des classes s&#233;mantiques (not&#233;es en majuscules). On utilise alors la disjonction a|LOC
pour indiquer que la pr&#233;position &#224; peut &#234;tre utilis&#233;e soit comme une pr&#233;position particuli&#232;re,
soit comme une pr&#233;position locative.
</p>
<p>Nous avons en outre d&#233;cid&#233; d&#8217;indiquer dans le lexique les sources dans lesquelles la pr&#233;position
appara&#238;t, afin de permettre un &#233;ventuel filtrage pour des utilisations particuli&#232;res. Dans le cas des
pr&#233;positions argumentales, nous avons ajout&#233; un champ comportant la fr&#233;quence d&#8217;apparition
et un exemple pris dans l&#8217;une des sources.
</p>
<p>5 Un exemple d&#8217;utilisation dans un syst&#232;me TAL
</p>
<p>Nous exposons ici de mani&#232;re succinte quelques probl&#232;mes pos&#233;s par les pr&#233;positions lors de
l&#8217;analyse syntaxique.
</p>
<p>5.1 Sp&#233;cificit&#233;s li&#233;es &#224; la segmentation
</p>
<p>La premi&#232;re difficult&#233; pour l&#8217;int&#233;gration des pr&#233;positions dans un analyseur se situe au niveau de
la segmentation en lex&#232;mes. Il faut g&#233;rer les ph&#233;nom&#232;nes d&#8217;&#233;lision : au doit &#234;tre trait&#233; comme &#224;
le, le de finissant certaines pr&#233;positions multi-mots peut &#234;tre &#233;lid&#233; en d&#8217;. Cependant, ces ph&#233;no-
m&#232;nes ne sont pas sp&#233;cifiques aux pr&#233;positions, il sont trait&#233;s soit dans le lexique (par exemple
Lefff distingue les deux formes au cours de et au cours d&#8217;), soit lors de la segmentation. Nous
avons choisi de les traiter dans le segmenteur, afin de simplifier la maintenance du lexique.
</p>
<p>Une difficult&#233; plus directement li&#233;e aux pr&#233;positions multi-mots, est la possibilit&#233; d&#8217;avoir une
ambigu&#239;t&#233; de segmentation. Par exemple, dans les deux phrases (2a) et (2b) la suite de mots
au cours de est une pr&#233;position multi-mots dans le premier cas, mais elle doit &#234;tre d&#233;compos&#233;e
dans le deuxi&#232;me. D&#8217;autres pr&#233;positions multi-mots ne n&#233;cessitent jamais de d&#233;coupage, par
exemple y compris.
</p>
<p>2a. Il a beaucoup travaill&#233; au cours de cette ann&#233;e
2b. Il a beaucoup travaill&#233; au cours de M. Durand
</p>
<p>226</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un lexique des pr&#233;positions
</p>
<p>5.2 Pr&#233;positions compl&#233;ments vs pr&#233;positions argumentales
</p>
<p>Lors de l&#8217;analyse syntaxique, on doit n&#233;cessairement distinguer l&#8217;usage d&#8217;une pr&#233;position
pour introduire un argument du verbe de celui d&#8217;une pr&#233;position introduisant un compl&#233;ment.
Comme on l&#8217;a vu (exemples (1a) et (1b)), cette distinction est souvent difficile &#224; &#233;tablir et re-
pose sur des consid&#233;rations s&#233;mantiques. L&#8217;analyse syntaxique doit alors maintenir l&#8217;ambiguit&#233;
de rattachement. Le fait d&#8217;avoir des informations pr&#233;cises sur les pr&#233;positions argumentales
permet de contr&#244;ler ces ambigu&#239;t&#233;s.
</p>
<p>6 Conclusion
</p>
<p>En comparant divers lexiques et dictionnaires, nous avons &#233;tabli une liste de pr&#233;positions utiles
pour le TAL. Nous nous sommes concentr&#233;s surtout sur les aspects syntaxiques. Un tri manuel
a permis d&#8217;&#233;carter des pr&#233;positions obsol&#232;tes ou tr&#232;s rares et quelques cas d&#8217;erreur. Le lexique
ainsi produit contient plus de 250 pr&#233;positions dont 49 sont des pr&#233;positions simples.
</p>
<p>Dans les lexiques syntaxiques, les cadres de sous-cat&#233;gorisation d&#233;crivent les pr&#233;positions intro-
duisant certains arguments. Des pr&#233;positions apparaissant dans les entr&#233;es verbales d&#8217;un lexique
syntaxique sont appel&#233;es argumentales. Nous avons identifi&#233; 40 pr&#233;positions argumentales.
</p>
<p>Le lexique d&#233;velopp&#233; est librement disponible 3. Ce lexique va n&#233;cessairement &#233;voluer. D&#8217;autres
sources d&#8217;information auraient leur place dans ce travail, notamment les champs constructions
des verbes du TFLi qui font r&#233;f&#233;rence &#224; des pr&#233;positions qui sont donc argumentales. Il est
pr&#233;vu d&#8217;utiliser prochainement cette source pour faire &#233;voluer le lexique.
</p>
<p>La mise en place d&#8217;une base de donn&#233;e contenant ce lexique est en cours 3. Cela devrait per-
mettre de faciliter la maintenance du lexique, mais aussi d&#8217;enrichir les donn&#233;es pour chaque
entr&#233;e, notamment avec des exemples d&#8217;usage ou des traits s&#233;mantiques plus vari&#233;s (loc, de-
loc, mais aussi tim, man, qty). Nous envisageons d&#8217;y ajouter des informations de fr&#233;quence sur
corpus.
</p>
<p>Une t&#226;che de bien plus grande ampleur serait d&#8217;enrichir ce lexique avec des informations s&#233;-
mantiques plus fines que la seule r&#233;f&#233;rence aux classes loc, deloc, . . . Il existe de nombreux
travaux de linguistique portant sur les pr&#233;positions. Cependant, la plupart s&#8217;attache &#224; des des-
criptions s&#233;mantiques fines d&#8217;un petit nombre de pr&#233;positions ; une exception notable &#233;tant le
travail r&#233;alis&#233; dans PrepNet (Saint-Dizier, 2006). Il conviendrait donc de transformer ces res-
sources pour les rendre directement utilisables par un syst&#232;me de traitement automatique des
langues.
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224; remercier chaleureusement M. Guy Perrier, Professeur &#224; l&#8217;Universit&#233; Nancy 2,
pour ses conseils patients et &#233;clair&#233;s.
</p>
<p>3http://loriatal.loria.fr/Resources.html
</p>
<p>227</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n FORT, Bruno GUILLAUME
</p>
<p>R&#233;f&#233;rences
BRISCOE T. &amp; CARROLL J. A. (1993). Generalised probabilistic LR parsing for unification-
based grammars. Computational Linguistics.
CARROLL J. A. &amp; FANG A. C. (2004). The automatic acquisition of verb subcategorisations
and their impact on the performance of an HPSG parser. In Proceedings of the 1st International
Joint Conference on Natural Language Processing (IJCNLP), p. 107&#8211;114, Sanya City, China.
GARDENT C., GUILLAUME B., PERRIER G. &amp; FALK I. (2006). Extraction d&#8217;information
de sous-cat&#233;gorisation &#224; partir des tables du LADL. In Proceedings of TALN 06, p. 139&#8211;148,
Leuven.
GREVISSE M. (1997). Le Bon Usage &#8211; Grammaire fran&#231;aise, &#233;dition refondue par Andr&#233;
Goosse. Paris &#8211; Louvain-la-Neuve : DeBoeck-Duculot, 13e edition.
GROSS M. (1975). M&#233;thodes en syntaxe. Hermann.
RIEGEL M., PELLAT J.-C. &amp; RIOUL R. (1997). Grammaire m&#233;thodique du fran&#231;ais. PUF,
3e edition.
SAGOT B., CL&#201;MENT L., VILLEMONTE DE LA CLERGERIE E. &amp; BOULLIER P. (2006). The
Lefff 2 syntactic lexicon for French : architecture, acquisition, use. In Actes de LREC 06,
G&#234;nes, Italie.
SAINT-DIZIER P. (2006). PrepNet : a Multilingual Lexical Description of Prepositions. In
LREC, G&#232;nes, 12/05/2006-14/05/2006, p. 877&#8211;885 : European Language Resources Associa-
tion (ELRA).
SELVA T., VERLINDE S. &amp; BINON J. (2002). Le DAFLES, un nouveau dictionnaire pour
apprenants du fran&#231;ais. In Actes du dixi&#232;me congr&#232;s EURALEX&#8217;2002 (European Association
for Lexicography). Copenhague.
S&#201;RASSET G. &amp; BOITET C. (2000). On UNL as the future &quot;html of the linguistic content&quot;
and the reuse of existing NLP components in UNL-related applications with the example of a
UNL-French deconverter. In Proceedings of COLING 2000, Saarebruecken, Germany.
VAN DEN EYNDE K. &amp; MERTENS P. (2002). La valence : l&#8217;approche pronominale et son
application au lexique verbal, In Journal of French Language Studies, p. 63&#8211;104. Cambridge
University Press, 13e edition.
</p>
<p>228</p>

</div></div>
</body></html>