<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>TransCheck : un v&#233;rificateur automatique de traductions</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>TransCheck : un v&#233;rificateur automatique de traductions 
</p>
<p>Elliott MACKLOVITCH, Guy LAPALME
Laboratoire RALI &#8211; Universit&#233; de Montr&#233;al 
</p>
<p>Montr&#233;al, Canada 
{macklovi,lapalme}@iro.umontreal.ca
</p>
<p>R&#233;sum&#233;.   Nous offrirons une d&#233;monstration de la derni&#232;re version de TransCheck,  un 
v&#233;rificateur automatique de traductions que le RALI est en train de d&#233;velopper. TransCheck 
prend en entr&#233;e deux textes, un texte source dans une langue et sa traduction dans une autre, 
les aligne au niveau de la phrase et ensuite v&#233;rifie les r&#233;gions align&#233;es pour s&#8217;assurer de la 
pr&#233;sence de certains &#233;quivalents obligatoires (p. ex. la terminologie normalis&#233;e) et de 
l&#8217;absence de certaines interdictions de traduction (p. ex. des interf&#233;rences de la langue 
source). Ainsi, TransCheck se veut un nouveau type d&#8217;outil d&#8217;aide &#224; la traduction qui pourra &#224; 
r&#233;duire le fardeau de la r&#233;vision et diminuer le co&#251;t du contr&#244;le de la qualit&#233;.  
</p>
<p>Abstract. We will present a demonstration of the latest version of TransCheck, an 
automatic translation checker that the RALI is currently developing. TransCheck takes as 
input two texts, a source text in one language and its translation in another, aligns them at the 
sentence level and then verifies the aligned regions to ensure that they contain certain 
obligatory equivalents (e.g. standardized terminology) and do not contain certain prohibited 
translations (e.g. source language interference). TransCheck is thus intended to be a new type 
of tool for assisting translators which has the potential to ease the burden of revision and 
diminish the costs of quality control.  
</p>
<p>Mots-cl&#233;s : traduction assist&#233;e par ordinateur, v&#233;rification automatique de traductions, 
r&#233;vision de traduction. 
</p>
<p>Keywords: machine-aided translation, automatic translation checking, translation 
revision.
</p>
<p>323</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Elliott MACKLOVITCH, Guy LAPALME
</p>
<p>En collaboration avec le Centre de recherche en technologies langagi&#232;res &#224; Ottawa, le
laboratoire RALI est en train de d&#233;velopper un nouveau prototype de TransCheck, un 
v&#233;rificateur automatique de traductions. Comme son nom l'indique, TransCheck est un outil 
qui vise &#224; aider un r&#233;viseur humain &#224; d&#233;celer automatiquement certaines erreurs de traduction 
et &#224; faire respecter certaines normes linguistiques au sein d'un grand service de traduction. Le 
syst&#232;me ressemble un peu &#224; un v&#233;rificateur d&#8217;orthographe, dans le sens qu&#8217;il sert &#224; rep&#233;rer des 
erreurs potentielles dans un texte. Mais contrairement &#224; un v&#233;rificateur d&#8217;orthographe, qui 
d&#233;c&#232;le des erreurs de forme monolingues, TransCheck cible des erreurs de correspondances 
entre deux textes, un texte source et sa traduction. Le mot &#171; librairie &#187;, par exemple, est une 
forme correcte en fran&#231;ais, mais il constitue n&#233;anmoins une erreur en tant que traduction du 
mot anglais &#171; library &#187;. Un v&#233;rificateur monolingue serait muet devant de tels cas, alors qu&#8217;un 
v&#233;rificateur bi-textuel comme TransCheck sera en mesure de le signaler.  
</p>
<p>Conceptuellement, comment fonctionne ce v&#233;rificateur automatique de traductions ? 
TransCheck prend en entr&#233;e deux textes, un texte source dans une langue et une &#233;bauche de 
traduction dans une autre. Dans un premier temps, le syst&#232;me segmente chaque texte en unit&#233;s 
linguistiques (c.-&#224;-d. des phrases et des mots), pour ensuite les aligner au niveau des phrases. 
Une fois qu&#8217;il a &#233;tabli cette correspondance entre les phrases qui sont des traductions 
mutuelles, TransCheck y applique les diff&#233;rents modules de d&#233;tection d&#8217;erreurs. Certains de 
ces modules sont bas&#233;s sur des grammaires internes, comme les grammaires des diff&#233;rents 
types d&#8217;expressions num&#233;riques (p. ex. les dates ou les expressions mon&#233;taires) ; d&#8217;autres 
modules exigent des donn&#233;es externes fournies normalement par l&#8217;utilisateur (p. ex. la 
terminologie). TransCheck signale une erreur potentielle lorsque, dans une r&#233;gion align&#233;e, il 
rep&#232;re un item source sans trouver son correspondant obligatoire, ou lorsque le syst&#232;me 
rep&#232;re un item source et trouve aussi son correspondant interdit dans la r&#233;gion cible.  
</p>
<p>Nous pouvons illustrer ces diff&#233;rents cas de figures &#224; l&#8217;aide de la capture d&#8217;&#233;cran &#224; la page 
suivante. Comme on peut y voir, le prototype actuel est pourvu d&#8217;une interface graphique 
dans laquelle le texte source appara&#238;t &#224; gauche et le texte cible &#224; droite. Les cases &#224; cocher au 
dessus des deux textes permettent &#224; l&#8217;utilisateur d&#8217;activer ou de d&#233;sactiver les diff&#233;rents 
modules de d&#233;tection d&#8217;erreurs. Les r&#233;gions align&#233;es sont d&#233;marqu&#233;es par une ligne 
horizontale bleue et, au sein de ces r&#233;gions, les erreurs d&#233;cel&#233;es sont signal&#233;es par un 
soulignement rouge. Dans la troisi&#232;me r&#233;gion, par exemple, o&#249; l&#8217;utilisateur a point&#233; sur le mot 
soulign&#233; &#171; sniper &#187;, le syst&#232;me signale une erreur potentielle de terminologie ; et, dans le 
cadre inf&#233;rieur de la fen&#234;tre, il indique les termes fran&#231;ais qu&#8217;il cherchait mais n&#8217;a pas trouv&#233;s 
du c&#244;t&#233; cible. Dans la r&#233;gion suivante, il s&#8217;agit d&#8217;un autre type de correspondance obligatoire : 
une expression num&#233;rique cette fois, qui se trouve &#224; &#234;tre traduit par la paraphrase &#171; un tour 
complet &#187;.  Dans la derni&#232;re r&#233;gion align&#233;e, nous voyons un exemple d&#8217;une interdiction de 
traduction : normalement, le nom &#171; deception &#187; en anglais et son homographe fran&#231;ais sont 
consid&#233;r&#233;s comme &#233;tant des faux-amis.  
</p>
<p>Il ne faut pas s'imaginer qu'un outil comme TransCheck pourra d&#233;celer toutes les erreurs de 
traduction, ce qui repr&#233;sente un probl&#232;me qui est probablement plus difficile que la traduction 
automatique elle-m&#234;me. Par contre, un syst&#232;me qui serait en mesure d'all&#233;ger le fardeau des 
r&#233;viseurs en automatisant les aspects les plus m&#233;caniques et fastidieux de leur travail serait 
certainement bien accueilli. Ainsi, le prototype actuel traite un sous-ensemble d&#8217;erreurs que 
l&#8217;on peut d&#233;tecter par des techniques simples et formelles, c.-&#224;-d. sans &#8216;compr&#233;hension 
profonde&#8217; des textes. Ceci dit, TransCheck n&#8217;est pas du tout un syst&#232;me ferm&#233; ; au fur et &#224; 
mesure que notre compr&#233;hension des relations traductionnelles avancera, nous pourrons y 
int&#233;grer d'autres types de v&#233;rifications.  
</p>
<p>324</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TransCheck : un v&#233;rificateur automatique de traductions 
</p>
<p>Figure 1 : Une capture d&#8217;&#233;cran du syst&#232;me TransCheck
o&#249; les erreurs signal&#233;es par le syst&#232;me sont soulign&#233;es en rouge. 
</p>
<p>Finalement, il est important de noter que TransCheck est un outil d&#8217;aide &#224; la traduction qui 
vise surtout &#224; appuyer le traducteur et non pas &#224; le remplacer. Ainsi, le syst&#232;me signale des 
erreurs potentielles, mais c&#8217;est &#224; l&#8217;utilisateur de d&#233;cider lesquelles doivent r&#233;ellement &#234;tre 
corrig&#233;es et lesquelles peuvent rester telles quelles. Autre &#233;l&#233;ment interactif dans l&#8217;emploi de 
TransCheck, l&#8217;utilisateur peut ais&#233;ment modifier ou ajouter des entr&#233;es au glossaire de la 
terminologie et &#224; l&#8217;anti-dictionnaire des interdictions dont TransCheck se sert pour effectuer 
ces v&#233;rification.
</p>
<p>R&#233;f&#233;rences
JUTRAS J-M. (2000). An Automatic Reviser : The TransCheck System. Sixth Applied Natural 
Language Processing Conference,  127-134. 
</p>
<p>MACKLOVITCH E. (1995). TransCheck - or the Automatic Validation of Human Translations. 
Proceedings of MT Summit V (Luxembourg). 
</p>
<p>RUSSELL, G. (2005). Automatic Detection of Translation Errors: the TransCheck System. 
Translating and the Computer 27 (ASLIB Conference).
</p>
<p>325</p>

</div></div>
</body></html>