<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Utiliser des classes de s&#233;lection distributionnelle pour d&#233;sambigu&#239;ser les adjectifs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser des classes de s&#233;lection distributionnelle 
pour d&#233;sambigu&#239;ser les adjectifs 
</p>
<p>Fabienne VENANT
LaLIC &#8211; Universit&#233; Paris IV, Maison de la recherche,
</p>
<p>28 rue Serpente 75006 Paris 
fabienne.venant@ens.fr
</p>
<p>R&#233;sum&#233;.  La d&#233;sambigu&#239;sation lexicale pr&#233;sente un int&#233;r&#234;t consid&#233;rable pour un nombre 
important d&#8217;applications, en traitement automatique des langues comme en recherche 
d'information. Nous proposons un mod&#232;le d&#8217;un genre nouveau, fond&#233; sur la th&#233;orie de la 
construction dynamique du sens (Victorri et Fuchs, 1996). Ce mod&#232;le donne une place 
centrale &#224; la polys&#233;mie et propose une repr&#233;sentation g&#233;om&#233;trique du sens. Nous pr&#233;sentons 
ici une application de ce mod&#232;le &#224; la d&#233;sambigu&#239;sation automatique des adjectifs. La m&#233;thode  
utilis&#233;e s'appuie sur une pr&#233;-d&#233;sambigu&#239;sation du nom r&#233;gissant l'adjectif, par le biais de 
classes de s&#233;lection distributionnelle. Elle permet aussi de prendre en compte les positions 
relatives du nom et de l'adjectif (postpostion ou ant&#233;position) dans le calcul du sens.
</p>
<p>Abstract. Automatic word sense disambiguation represents an important issue for many 
applications, in Natural Language Processing as in Information Retrieval. We propose a new 
kind of model, within the framework of Dynamical Construction of Meaning (Victorri and 
Fuchs, 1996). This model gives a central place to polysemy and proposes a geometric 
representation of meaning. We present here an application of this model to adjective sense 
disambiguation. The method we used relies on a pre-disambiguation of the noun used with the 
adjective under study, using distributionnal classes. It can also take into account the changes 
in the meaning of the adjective, whether it is placed before or after the noun.
</p>
<p>Mots-cl&#233;s :  traitement automatique des langues, d&#233;sambigu&#239;sation, s&#233;mantique, 
polys&#233;mie adjectivale, construction dynamique du sens, synonymie, classes distributionnelles, 
corpus, espace s&#233;mantique, espace distributionnel.
</p>
<p>Keywords :    natural language processing, word sense disambiguation, semantics, 
adjectival polysemy, dynamical construction of meaning, synonymy, distributionnal classes, 
corpus, semantic space, distributional space. 
</p>
<p>1 Enjeux actuels pour la d&#233;sambigu&#239;sation automatique 
 Le d&#233;veloppement et la g&#233;n&#233;ralisation de l'utilisation de documents num&#233;riques g&#233;n&#232;rent des 
nouveaux besoins en analyse textuelle, notamment pour la navigation dans des bases de 
donn&#233;es num&#233;riques et la recherche d'information. La d&#233;sambigu&#239;sation automatique constitue 
</p>
<p>187</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne VENANT
</p>
<p>une &#233;tape importante dans l'analyse de ces donn&#233;es textuelles, dans les phases d'indexation, ou 
de description, des documents, comme dans celle de l'extension de requ&#234;te. Un des enjeux 
dans ce domaine est, en effet, de pouvoir faire des requ&#234;tes non pas sur des occurrences de 
mots simples mais sur des concepts, et donc de construire des outils capables de prendre en 
compte la polys&#233;mie. Le but du travail pr&#233;sent&#233; ici est donc d'&#233;valuer les performances d'un 
mod&#232;le dynamique de calcul du sens, et des outils g&#233;om&#233;triques qu'il met en jeu, dans des 
t&#226;ches de d&#233;sambigu&#239;sation s&#233;mantique d'assez haut niveau. La polys&#233;mie adjectivale 
constitue pour cela un champ d'exp&#233;rimentation id&#233;al, assez peu explor&#233; d'un point de vue 
informatique. Les travaux existants portent surtout sur la cat&#233;gorisation des adjectifs, en lien 
avec l'acquisition lexicale ((Rasking et Nurinburg, 1996) ; (Bouillon et Viegas, 1999)). Les 
travaux en d&#233;sambigu&#239;sation automatique se sont quant &#224; eux majoritairement int&#233;ress&#233;s aux 
noms et aux verbes. Les ph&#233;nom&#232;nes mis en jeu dans la s&#233;mantique adjectivale sont en effet 
tr&#232;s subtils, difficiles &#224; formaliser et &#224; expliquer de fa&#231;on syst&#233;matique. La prise en compte de 
ces ph&#233;nom&#232;nes peut cependant beaucoup apporter &#224; des outils de recherche d'information, 
notamment dans des &#233;tudes d'opinions ou de modalit&#233;s sentimentales.  
</p>
<p>2 Un mod&#232;le dynamique du sens 
Le syst&#232;me informatique que nous avons d&#233;velopp&#233; met en jeu le mod&#232;le dynamique du sens 
propos&#233; par Victorri et Fuchs (1996). Le principe est le suivant : on associe &#224; chaque mot 
polys&#233;mique un espace s&#233;mantique dans lequel se d&#233;ploient ses diff&#233;rents sens. Les autres 
mots pr&#233;sents dans l&#8217;&#233;nonc&#233; d&#233;finissent une fonction potentielle, et ce sont les sommets de 
cette fonction potentielle qui permettent de d&#233;terminer le sens pris par le mot &#233;tudi&#233;, dans 
l&#8217;&#233;nonc&#233; consid&#233;r&#233;. Le d&#233;veloppement du syst&#232;me s'est fait en deux &#233;tapes. Un premier 
travail, portant sur la repr&#233;sentation du sens, a consist&#233; &#224; mettre au point une m&#233;thode de 
construction automatique des espaces s&#233;mantiques et d'exploration du lexique, par le biais de 
la relation de synonymie ((Ploux et Victorri, 1998) ; (Venant 2007)). Nous pr&#233;sentons cette 
m&#233;thode en section 3. Un second travail a permis d'utiliser ces espaces s&#233;mantiques dans une 
m&#233;thode de d&#233;sambigu&#239;sation automatique. Les travaux ont port&#233; d'une part sur la prise en 
compte de la polys&#233;mie verbale (Jacquet, 2006), d'autre part sur la prise en compte de la 
polys&#233;mie adjectivale (Venant, 2006). 
Nous pr&#233;sentons ici les derni&#232;res avanc&#233;es dans la d&#233;sambigu&#239;sation adjectivale. Les &#233;tudes 
linguistiques sur l'adjectif s'accordent pour d&#233;gager deux caract&#233;ristiques principales de la 
s&#233;mantique adjectivale. La premi&#232;re concerne le fait que le sens de l'adjectif d&#233;pend du nom 
qui le r&#233;git. Ainsi sec prend des sens diff&#233;rents dans un terrain sec et un visage sec. La 
seconde concerne l'influence sur le sens de l'adjectif de sa position relativement au nom. Ainsi 
un curieux homme n'est pas n&#233;cessairement un homme curieux. Nous attendons du syst&#232;me 
qu&#8217;il soit capable de prendre en compte ces caract&#233;ristiques dans le calcul du sens d'un 
adjectif en pr&#233;sence d'un nom donn&#233;. Avant de lancer une &#233;tude &#224; grande &#233;chelle, nous avons 
voulu &#233;tudier la plausibilit&#233; du syst&#232;me par une &#233;tude en profondeur des adjectifs sec, curieux
et m&#233;chant. Notre travail s'appuie une pr&#233;-d&#233;sambigu&#239;sation du nom par le biais de classes de 
s&#233;lection distributionnelle. La section 4 pr&#233;sente la m&#233;thode de construction automatique de 
ces classes. Les sections 5 et 6 d&#233;taillent la fa&#231;on dont nous utilisons ces classes, ainsi que les 
espaces s&#233;mantiques, pour prendre en compte l'influence du nom recteur dans le calcul du 
sens d'un adjectif. La section 7 porte sur le traitement des changements de sens entre ant&#233; et 
postposition.
</p>
<p>188</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser des classes de s&#233;lection distributionnelle pour d&#233;sambigu&#239;ser les adjectifs 
</p>
<p>3 Construction des espaces s&#233;mantiques 
Nous illustrons ici, sur le cas de l'adjectif m&#233;chant, la m&#233;thode de construction des espaces 
s&#233;mantiques mise au point par Ploux et Victorri (1998). Cette m&#233;thode repose sur l&#8217;analyse 
d&#8217;un graphe de synonymie (Dictionnaire Electronique des Synonymes, DES : 
www.crisco.unicaen.fr). Le DES fournit le graphe de synonymie de m&#233;chant : les sommets du 
graphe sont m&#233;chant et tous ses synonymes, et il y a un lien entre deux de ces adjectifs 
lorsque le DES indique un renvoi synonymique. La FigureErreur ! Aucun nom n'a &#233;t&#233; 
donn&#233; au signet.Erreur ! Aucun nom n'a &#233;t&#233; donn&#233; au signet. montre un extrait du graphe 
de synonymie de m&#233;chant.
</p>
<p>Figure 1 : un extrait du graphe de synonymie de m&#233;chant
Un synonyme ne suffit pas en g&#233;n&#233;ral pour d&#233;finir un sens du mot &#233;tudi&#233;. On voit, par 
exemple, sur la Figure Erreur ! Aucun nom n'a &#233;t&#233; donn&#233; au signet.Erreur ! Aucun nom 
n'a &#233;t&#233; donn&#233; au signet. que bas est &#224; la fois synonyme de brutal et de faible, qui 
correspondent &#224; deux sens diff&#233;rents de m&#233;chant. On va donc utiliser des ensembles de 
synonymes, et plus pr&#233;cis&#233;ment les cliques du graphe. Une clique est un ensemble de 
sommets deux &#224; deux synonymes le plus grand possible. Le graphe de la Figure Erreur ! 
Aucun nom n'a &#233;t&#233; donn&#233; au signet. pr&#233;sente ainsi 3 cliques : &lt;bas ; brutal ; mauvais ; 
m&#233;chant&gt;, &lt;bas ; faible ; mauvais ; m&#233;chant&gt; et &lt;fier ; intraitable ; m&#233;chant ; sauvage&gt;. On 
va consid&#233;rer qu&#8217;une clique correspond, en premi&#232;re approximation, &#224; une nuance de sens 
possible pour le mot consid&#233;r&#233;. Ce sont donc les cliques qui constitueront les points de 
l'espace s&#233;mantique. L&#8217;espace s&#233;mantique est alors d&#233;fini comme l&#8217;espace euclidien engendr&#233; 
par m&#233;chant et tous ses synonymes. A chaque adjectif correspond un axe de l&#8217;espace. A 
chaque clique du graphe correspond un point de l'espace, dont les coordonn&#233;es d&#233;pendent des 
synonymes qu&#8217;elle contient. Cet espace est muni de la distance du Chi2, bien connue en 
analyse des donn&#233;es, de fa&#231;on &#224; rendre compte des proximit&#233;s s&#233;mantiques r&#233;elles entre les 
diff&#233;rents sens du mot &#233;tudi&#233;. On utilise une Analyse en Composantes Principales pour 
obtenir une visualisation en deux ou trois dimensions. La Figure Erreur ! Aucun nom n'a 
&#233;t&#233; donn&#233; au signet. pr&#233;sente la visualisation de l&#8217;espace s&#233;mantique associ&#233; &#224; m&#233;chant.
L'espace construit automatiquement rend correctement compte de la s&#233;mantique de l&#8217;adjectif 
m&#233;chant. En effet, on peut constater que les sens de m&#233;chant se r&#233;partissent en trois zones, 
correspondant aux distinctions de sens apparaissant dans les dictionnaires. En haut &#224; gauche, 
on trouve les sens intensifs (intensivit&#233; n&#233;gative: incapable, d&#233;risoire, d&#233;ficient...), les plus 
g&#233;n&#233;raux. La partie droite de l&#8217;espace s&#233;mantique organise les sens les plus sp&#233;cifiques de 
m&#233;chant. En haut &#224; droite, on trouve les cliques correspondant aux sens s&#8217;appliquant surtout &#224; 
des personnes et &#224; leurs actes. En bas &#224; droite on trouve regroup&#233;es les cliques correspondant 
&#224; des sens psychologiques de m&#233;chant, caract&#233;risant par exemple des attitudes ou des 
sentiments. 
</p>
<p>189</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne VENANT
</p>
<p>Figure 2 : Espace s&#233;mantique associ&#233; &#224; m&#233;chant
</p>
<p>4 Utiliser des classes distributionnelles 
</p>
<p>F
igure 3: Influence mutuelle nom-adjectif
</p>
<p> Nous avons, dans un travail ant&#233;rieur (Jacquet et Venant, 2005), mis au point une m&#233;thode de 
construction automatique de classes de s&#233;lection distributionnelle (CSD), &#224; partir d'un corpus. 
Le principe de construction des CSD est de rassembler dans une m&#234;me classe les noms 
influen&#231;ant de la m&#234;me mani&#232;re le sens d'un adjectif. Les noms sont rassembl&#233;s sur la base 
des contextes lexico-syntaxiques qu'ils partagent. Un contexte lexico-syntaxique est constitu&#233; 
d'un mot et d'une relation syntaxique, comme par exemple &#234;tre recteur de l'adjectif sec en 
position &#233;pith&#232;te (cod&#233; sec.EPI), ou &#234;tre compl&#233;ment d'objet direct du verbe donner (cod&#233; 
donner.OBJ). Ces classes vont servir ici &#224; rendre compte de l'aspect dynamique du calcul du 
sens, en permettant une double d&#233;sambigu&#239;sation nom-adjectif. Les CSD constituent en effet 
un outil ad&#233;quat pour la prise en charge de l'influence de l'adjectif sur la s&#233;mantique du nom 
qui le r&#233;git. Consid&#233;rons ainsi le groupe nominal coup sec. On va ainsi d&#233;finir une classe 
(coup, bruit, geste..), rassemblant des noms en pr&#233;sence desquels sec prend un sens d&#233;notant 
un manque de douceur. Cette classe se distingue d'une part de celles d'autres noms, comme 
par exemple celle associ&#233;e au nom fruit, rassemblant des noms (fruit, haricot, l&#233;gume...), en 
pr&#233;sence desquels sec prend un sens d&#233;notant un manque d&#8217;eau. Elle se distingue d'autre part 
de celle associ&#233;e au m&#234;me nom coup, dans l'&#233;tude d'un autre syntagme, par exemple le 
syntagme coup audacieux (cf. figure 3). Ce qui nous int&#233;resse particuli&#232;rement ici, c'est que la 
classe d'un nom varie en fonction de l'adjectif &#233;tudi&#233;, et que c'est cette classe qui permet 
</p>
<p>190</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser des classes de s&#233;lection distributionnelle pour d&#233;sambigu&#239;ser les adjectifs 
</p>
<p>ensuite de d&#233;sambigu&#239;ser l'adjectif, et de lui assigner le sens correct en pr&#233;sence du nom 
consid&#233;r&#233;.
Pour construire automatiquement ces classes, nous travaillons &#224; partir des sorties de 
l&#8217;analyseur syntaxique Syntex (Bourigault et Fabre, 2000) sur le corpus Le Monde LM10.
Apr&#232;s filtrage, le corpus contient 31 417 mots et 61 202 contextes lexico-syntaxiques (CLS). 
A partir de ces donn&#233;es, nous construisons l&#8217;espace multidimensionnel engendr&#233; par les CLS. 
C'est ce que nous appelons l&#8217;espace distributionnel associ&#233; au corpus. Chaque mot y est 
repr&#233;sent&#233; par un point. Les coordonn&#233;es de ce point d&#233;pendent des fr&#233;quences d'emploi du 
mot associ&#233; dans chacun des CLS engendrant l'espace. La classe d'un nom N en tant que 
recteur d'un adjectif A rassemble des noms qui sont eux aussi attest&#233;s comme &#233;tant recteur de 
l'adjectif A, et qui sont proches du nom N dans l'espace distributionnel. Nous ne d&#233;taillons pas 
ici la m&#233;thode de construction de la classe (cf. Venant 2006), mais nous l'illustrons sur le cas 
du nom bruit. Pour construire la classe associ&#233;e au nom bruit en tant que recteur de sec dans
une relation &#233;pith&#232;te, on commence par chercher dans l&#8217;espace distributionnel tous les noms 
attest&#233;s comme recteur de sec dans le corpus, c'est-&#224;-dire les noms qui ont une coordonn&#233;e 
non nulle selon la dimension sec.EPI. Si cet ensemble contient plus de 100 mots, on ne prend 
que les 100 mots les plus proches (au sens du Chi2) de bruit dans l&#8217;espace distributionnel. 
Notons MOTS l&#8217;ensemble form&#233;. On va ensuite recenser tous les contextes pour lesquels au 
moins un des &#233;l&#233;ments de MOTS a une coordonn&#233;e non nulle, c'est-&#224;-dire l'ensemble des 
contextes dans lesquels au moins un des noms inclus dans MOTS est employ&#233;. Notons CONT 
l&#8217;union de tous ces contextes. Dans le cas de bruit, MOTS contient 59 mots (l'ensemble des 
noms recteurs de sec dans le corpus) et CONT contient 9 506 contextes. Une Analyse en 
Composantes Principales fournit alors les 10 axes de visualisation synth&#233;tisant le mieux 
l&#8217;information des 9 506 contextes de CONT, ainsi que les coordonn&#233;es des points repr&#233;sentant 
les 59 mots &#233;tudi&#233;s dans l&#8217;espace euclidien engendr&#233; par ces 10 axes. On peut ainsi obtenir 
des repr&#233;sentations en deux ou trois dimensions de l'espace engendr&#233; par CONT. La figure 4, 
ci- dessous, montre ainsi deux visualisations de l'ensemble des noms recteurs de sec dans 
l'espace distributionnel. On peut ainsi s'apercevoir que bruit est proche de coup et geste, et 
que fruit est proche de l&#233;gume et pain. Chaque nom est ainsi proche de noms en pr&#233;sence 
desquels l'adjectif sec prend des sens similaires. 
</p>
<p>F
igure 4: Noms recteur de sec dans l'espace distributionnel
</p>
<p>Pour constituer la classe distributionnelle de bruit, dans le contexte sec.EPI, le syst&#232;me classe 
les noms selon leur distance au nom &#233;tudi&#233;. Il ajoute ces noms &#224; la classe, du plus proche au 
</p>
<p>191</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne VENANT
</p>
<p>plus &#233;loign&#233;, en additionnant leurs fr&#233;quences respectives dans le corpus. Il continue tant 
qu'un certain seuil de pr&#233;sence dans le corpus n'a pas &#233;t&#233; atteint. Ce seuil correspond au 
troisi&#232;me quartile de la s&#233;rie des fr&#233;quences dans le corpus des noms &#233;tudi&#233;s. Il vaut ici 10 
960. La classe distributionnelle de bruit, en tant que recteur de l&#8217;adjectif &#233;pith&#232;te sec, est 
(bruit, coup).
</p>
<p>5 Influence du nom recteur 
Nous avons, dans un premier temps, travaill&#233; sur l&#8217;influence du nom recteur sur le sens de 
l&#8217;adjectif sec. L'influence du nom est prise en compte sous la forme d'une fonction potentielle, 
d&#233;finie sur l'espace s&#233;mantique de l'adjectif &#233;tudi&#233;, et dont les sommets permettent de 
d&#233;terminer dans quelle zone de l'espace s&#233;mantique ce nom contraint l'adjectif &#224; prendre son 
sens. Il s'agit donc ici d'associer &#224; chaque nom, ou plut&#244;t &#224; la CSD de ce nom en tant que 
recteur de sec, un potentiel d&#233;sambigu&#239;sateur. Pour cela, le syst&#232;me que nous avons d&#233;velopp&#233; 
calcule le degr&#233; d&#8217;affinit&#233; de la CSD avec chacune des cliques de sec, en fonction des 
fr&#233;quences de cooccurences de chacun des noms pr&#233;sents dans la classe avec chacun des 
synonymes pr&#233;sents dans la clique. Le tableau 1 pr&#233;sente quelques degr&#233;s d'affinit&#233;s, entre 
certaines cliques de sec et la classe C : (bruit; coup).
</p>
<p>CLIQUES Degr&#233; d&#8217;affinit&#233; avec C  
aust&#232;re ; rude ; sec ; simple  98%
bourru ; dur ; rude ; r&#233;barbatif ; sec ; s&#233;v&#232;re  98%  
bourru ; brutal ; dur ; rude ; sec ; s&#233;v&#232;re ; &#226;pre  97%  
sec ; seul ; simple  96%  
bourru ; brutal ; cru ; dur ; rude ; sec  95%  
bourru ; brusque ; d&#233;sagr&#233;able ; rude ; sec  95%  
</p>
<p>Tableau 1. Cliques pr&#233;sentant les plus fortes affinit&#233;s avec la classe C : (bruit, coup)
</p>
<p>Ces degr&#233;s d'affinit&#233; sont ensuite mis en jeu dans le calcul d'une fonction potentielle 
associ&#233;e &#224; la classe. La valeur de la fonction en chaque point d&#233;pend du degr&#233; d'affinit&#233; de la 
classe avec la clique associ&#233;e &#224; ce point. La fonction potentielle associ&#233;e &#224; la classe C : 
(bruit,coup) est la suivante : elle atteint son maximum dans la r&#233;gion de l'espace s&#233;mantique 
de sec qui rassemble les cliques exprimant le manque de douceur (ie. contenant des adjectifs 
comme brusque, bref, brutal...), ce qui correspond bien au sens pris par sec dans le syntagme 
un bruit sec.
</p>
<p>6 Calcul du sens d'un adjectif en pr&#233;sence d'un nom donn&#233; 
Nous avons partitionn&#233;, manuellement, l'espace s&#233;mantique de sec en zones correspondant 
aux sens principaux distingu&#233;s par les dictionnaires : le manque d'eau et l'improductivit&#233; (une
fleur s&#232;che, un terrain sec), le manque de douceur (un coup sec), la maigreur (un visage sec),
les sens psychologiques (un coeur sec)... La t&#226;che du syst&#232;me consiste ensuite &#224; d&#233;terminer 
automatiquement quelle est la zone de l'espace s&#233;mantique correspondant au sens pris par sec
en pr&#233;sence d'un nom donn&#233;. Le syst&#232;me associe une fonction potentielle &#224; chacune de ces 
zones. Cette fonction d&#233;pend des cliques appartenant &#224; la zone. Le syst&#232;me effectue alors un 
calcul int&#233;gral pour comparer ces fonctions aux fonctions potentielles des noms, et d&#233;terminer 
comment se r&#233;partit le potentiel d&#233;sambigu&#239;sateur de chacun des noms &#233;tudi&#233;s, relativement 
aux diff&#233;rentes zones de sens. Le tableau 2 donne un aper&#231;u partiel des r&#233;sultats. La t&#226;che a 
&#233;t&#233; men&#233;e sur 49 noms. Pour 26 d'entre eux, le syst&#232;me s&#233;lectionne la zone de sens ad&#233;quate, 
</p>
<p>192</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser des classes de s&#233;lection distributionnelle pour d&#233;sambigu&#239;ser les adjectifs 
</p>
<p>pour 16 d'entre eux, le r&#233;sutat est faux, c'est &#224; dire que la zone s&#233;lectionn&#233;e n'est pas 
pertinente. Enfin pour les 7 noms restants, le syst&#232;me reste silencieux et ne s&#233;lectionne aucune 
zone de sens. Il s'agit d'une part des mots mois, refus, r&#233;gime et vol, tr&#232;s fr&#233;quents dans le 
corpus, donc seuls dans leur classe distributionnelle, mais par ailleurs peu employ&#233;s avec sec
et ses synonymes, de sorte que le calcul n'aboutit pas. Pour les autre noms, bois, geste et
licenciement, l&#8217;apport de la classe reste insuffisant en termes de fr&#233;quences de cooccurrence 
avec les synonymes de sec. Pour ces 7 noms, un deuxi&#232;me calcul a &#233;t&#233; men&#233;, apr&#232;s inclusion 
dans la classe distributionnelle du nom le plus proche dans l&#8217;espace distributionnel. Le 
syst&#232;me a pu cette fois s&#233;lectionner la zone de sens correcte, &#224; l'exception du nom mois pour 
lequel il s&#233;lectionne la zone des sens psychologiques. 
</p>
<p>NOM ZONE DE SENS TAUX D'AFFINITE 
sol Manque d'eau, improductivit&#233; 
</p>
<p>Manque de douceur
</p>
<p>Maigre, d&#233;charn&#233;
</p>
<p>28%
27%
</p>
<p>19%
</p>
<p>humour Sens psychologiques 
Manque de douceur
</p>
<p>Manque d'eau, improductivit&#233;
</p>
<p>25%
22%
</p>
<p>18%
</p>
<p>cheveu Manque d'eau, improductivit&#233; 77%
</p>
<p>ton Manque de douceur 
Sens psychologiques
</p>
<p>42%
33%
</p>
<p>hiver Sens psychologiques 100%
</p>
<p>Tableau 2 : Influence du nom recteur, quelques r&#233;sultats sur l'adjectif sec
Afin de mesurer l'apport des classes distributionnelles, et donc de la d&#233;sambigu&#239;sation 
simultan&#233;e du nom et de l'adjectif, ces r&#233;sultats ont &#233;t&#233; compar&#233;s &#224; ceux obtenus, pour les 
m&#234;me noms et sur la m&#234;me t&#226;che, sans utiliser les classes distributionnelles, c'est-&#224;-dire en 
associant une fonction potentielle au nom seul, selon ses fr&#233;quences d'emplois avec les 
diff&#233;rents adjectifs. 
Il s'av&#232;re, et c&#8217;est heureux, que l&#8217;utilisation des classes distributionnelles ne nous fait perdre 
aucun des r&#233;sultats positifs qui apparaissent avec le nom seul. Elle apporte au contraire 
quelques nuances de sens, puisqu&#8217;on voit appara&#238;tre le fait qu&#8217;un humour sec, sec bien s&#251;r 
d&#8217;un point de vue psychologique, est aussi d&#233;nu&#233; de douceur. De m&#234;me, les classes 
distributionnelles permettent au syst&#232;me de d&#233;tecter que le manque d&#8217;eau d&#8217;un sol en fait un 
sol rude, difficile &#224; exploiter, ou encore que sec dans ton sec est porteur &#224; la fois d'un sens 
acoustique et d'une connotation psychologique. L'utilisation des classes distributionnelles 
permet aussi d'obtenir des r&#233;sultats corrects l&#224; o&#249; l'utilisation du nom seul g&#233;n&#232;re une erreur 
(c'est le cas pour le nom arbre), ou ne donne pas de r&#233;sultat du tout (14 noms sont concern&#233;s 
dont bruit et cheveu ). Le point important est que l'utilisation des classes distributionnelles ne 
g&#233;n&#232;re pas d'erreur suppl&#233;mentaire. Les erreurs obtenues sur des noms comme hiver rel&#232;vent 
du mode de   description du sens que nous utilisons, et non de l'utilisation des classes 
distributionnelles. Les points des espaces s&#233;mantiques sont en effet des cliques de synonymes. 
On se heurte ici au fait que non seulement la synonymie entre froid et sec n&#8217;est pas pertinente 
dans le contexte de hiver, mais qu&#8217;en plus cela concerne des cliques enti&#232;res, puisque le 
ph&#233;nom&#232;ne se reproduit pour glac&#233; et glacial, qui partagent de nombreuses cliques avec froid 
et sec. Il faut ici chercher un moyen d&#8217;informer notre syst&#232;me que sec d&#233;ploie ses sens dans 
deux directions s&#233;mantiques, l&#8217;une plut&#244;t physique, l&#8217;autre plut&#244;t psychologique, mais que 
employ&#233; avec certains noms, comme hiver, il ne peut prendre son sens que dans le domaine 
physique, et que donc seules les cliques correspondantes sont &#224; prendre en compte dans le 
</p>
<p>193</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne VENANT
</p>
<p>calcul du sens en pr&#233;sence de ces noms. Une piste pour la r&#233;solution de ce probl&#232;me est 
l'utilisation d'informations globales sur le lexique adjectival, que nous pensons obtenir 
automatiquement gr&#226;ce &#224; notre travail sur la caract&#233;risation des emplois adjectivaux (Venant, 
2007).
</p>
<p>7 Influence de la position de l'adjectif
Une premi&#232;re &#233;tude men&#233;e sur l&#8217;adjectif curieux (Fran&#231;ois, Victorri et Manguin, 2002) avait 
montr&#233; que le syst&#232;me &#233;tait capable de rendre compte des changements de sens entre 
ant&#233;position et postposition. Nous avons poursuivi l&#8217;investigation de ce ph&#233;nom&#232;ne, par 
l'&#233;tude de l&#8217;adjectif m&#233;chant, dont le s&#233;mantisme en ant&#233;position est plus complexe que celui 
de curieux. M&#233;chant poss&#232;de en effet une tr&#232;s grande extension (il peut s&#8217;appliquer &#224; 
n&#8217;importe quoi, de la table au costume en passant par l&#8217;avocat, la f&#233;e, ou la pendule). En 
ant&#233;position, dans ses emplois g&#233;n&#233;raux, il est sujet au ph&#233;nom&#232;ne de d&#233;s&#233;mantisation d&#233;crit 
par Goes (1999), c'est-&#224;-dire qu'il prend un sens si g&#233;n&#233;ral que le sens du syntagme semble 
d&#233;pendre essentiellement du nom recteur. Enfin, les changements de sens entre ant&#233;position et 
postposition ne sont pas syst&#233;matiques. On trouve en effet des cas o&#249; le changement de sens 
est flagrant, et d&#8217;autres o&#249; le sens de l&#8217;adjectif est le m&#234;me qu&#8217;il soit plac&#233; avant ou apr&#232;s le 
nom. Ainsi, s&#8217;il est pr&#233;f&#233;rable de ne pas engager un m&#233;chant avocat pour se d&#233;fendre &#224; un 
proc&#232;s, un avocat m&#233;chant peut au contraire se montrer redoutable. En revanche, on redoutera 
de la m&#234;me fa&#231;on de recevoir un coup m&#233;chant ou un m&#233;chant coup. Nous attendons de notre 
syst&#232;me qu'il soit capable de rendre compte de tous ces ph&#233;nom&#232;nes. 
La m&#233;thode de d&#233;sambigu&#239;sation repose sur les m&#234;mes principes que pr&#233;c&#233;demment, mais on 
utilise ici deux classes distributionnelles [ANTE vs. POST] pour chaque mot, l&#8217;une calcul&#233;e &#224; 
partir des fr&#233;quences en ant&#233;position, l&#8217;autre calcul&#233;e &#224; partir des fr&#233;quences en postposition. 
On mesure ensuite l&#8217;influence du nom recteur sur la s&#233;mantique de m&#233;chant en associant &#224; 
chacune de ces classes une fonction potentielle, d&#233;finie sur l&#8217;espace s&#233;mantique. Rappelons 
qu&#8217;&#224; chaque point de l&#8217;espace s&#233;mantique correspond une clique du graphe de synonymie de 
m&#233;chant. La valeur de la fonction en chaque point d&#233;pend des fr&#233;quences de cooccurrence (en 
ant&#233;position pour une classe [ANTE], en postposition pour une classe [POST]) de chacun des 
noms constituant la classe avec chacun des adjectifs constituant la clique (pour le d&#233;tail des 
calculs voir Venant, 2006). La Figure 5 montre les fonctions potentielles associ&#233;es aux CSD 
du nom b&#234;te.
</p>
<p>.Figure 5 : Fonctions potentielles associ&#233;es aux classes distributionnelles de b&#234;te
Le syst&#232;me doit alors d&#233;terminer le sens que prend l&#8217;adjectif m&#233;chant en pr&#233;sence d&#8217;un nom 
donn&#233;. Par sens, nous entendons ici, comme dans le paragraphe pr&#233;c&#233;dent, la zone (sens 
intensifs, sens comportementaux ou sens psychologiques) de l&#8217;espace s&#233;mantique 
correspondant au sens de m&#233;chant dans le syntagme &#233;tudi&#233;. Ces zones ont &#233;t&#233; d&#233;finies 
manuellement. Le syst&#232;me calcule une fonction potentielle pour chacune des zones. 
Rappelons que, en chaque point, la valeur de la fonction d&#233;pend de l&#8217;appartenance ou non de 
</p>
<p>194</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser des classes de s&#233;lection distributionnelle pour d&#233;sambigu&#239;ser les adjectifs 
</p>
<p>la clique &#224; la zone consid&#233;r&#233;e. Etant donn&#233; un groupe nominal m&#233;chant + N ou N + m&#233;chant,
le syst&#232;me d&#233;termine la CSD [ANTE] ou la CSD [POST], associ&#233;e &#224; N en tant que recteur de 
m&#233;chant. Il calcule ensuite la fonction potentielle associ&#233;e &#224; cette CSD et la compare &#224; 
chacune des fonctions potentielles associ&#233;es aux zones de sens de l&#8217;espace s&#233;mantique. Les 
calculs ont &#233;t&#233; men&#233;s pour les 40 noms les plus fr&#233;quemment utilis&#233;s comme recteur de 
m&#233;chant dans le corpus Frantext Cat&#233;goris&#233;. Le tableau 3 pr&#233;sente quelques r&#233;sultats: 
</p>
<p>ANTE POST 
Sens intensifs 
</p>
<p>Sens comportementaux
76%
</p>
<p>24%
cheval Sens intensifs 69%
</p>
<p>Sens comportementaux 100% regard Sens comportementaux 100%
Sens intensifs 93% homme Sens intensifs 100%
Sens intensifs 99% loup Sens comportementaux 
</p>
<p>Sens intensifs
53%
47%
</p>
<p>Tableau 3 : Influence de la position de l'adjectif, quelques r&#233;sultats sur l'adjectif m&#233;chant
Les r&#233;sultats que nous obtenons montrent que le syst&#232;me est capable de rep&#233;rer des 
changements de sens entre ant&#233;position et postposition. Ce sont les sens intensifs qui 
obtiennent les scores les plus &#233;lev&#233;s dans quasiment tous les cas en ant&#233;position. Le syst&#232;me 
est donc capable de rendre compte du fait qu'on trouve en ant&#233;position les valeurs de sens qui 
ont la plus grande extension. Ici c&#8217;est clairement la valeur intensive, tr&#232;s g&#233;n&#233;rale, qui a la 
plus grande extension. Elle peut s&#8217;appliquer &#224; n&#8217;importe quoi, alors que les deux autres 
valeurs ne s&#8217;appliquent qu&#8217;&#224; des noms anim&#233;s ou consid&#233;r&#233;s comme tels. Le syst&#232;me rep&#232;re 
en outre que, si en ant&#233;position les sens intensifs sont omnipr&#233;sents, il y a des noms pour 
lesquels ils ne s&#8217;imposent pas forc&#233;ment. Cheval, couleur, eau, esp&#232;ce, farce, matin, mot, 
nature, parole, taureau, terre donnent &#224; m&#233;chant en ant&#233;position tant&#244;t une valeur g&#233;n&#233;rale, 
tant&#244;t une valeur comportementale. Le contexte permet souvent de trancher entre les deux 
valeurs, mais ce n&#8217;est pas toujours tr&#232;s clair. On a ainsi une ambigu&#239;t&#233; dans un m&#233;chant 
cheval, qui peut d&#233;signer selon les cas un cheval maigre, faible ou un cheval agressif. Nous 
avons pu v&#233;rifier que la fonction potentielle associ&#233;e &#224; la classe [ANTE] de cheval en tant que 
recteur de m&#233;chant pr&#233;sente deux sommets l'un couvrant la zone intensive et l'autre la zone 
comportementale. Cette ambigu&#239;t&#233; dispara&#238;t en postposition, et le syst&#232;me en rend compte. 
Ainsi cheval, couleur, dent, eau, esp&#232;ce, farce, maison, mot, nature, parole, part, soci&#233;t&#233;, 
taureau, terre acceptent aussi bien une valeur intensive que comportementale en ant&#233;position, 
mais ne s&#233;lectionnent que la valeur comportementale ou psychologique en postposition. Pour 
les noms b&#234;te, bois, bruit, chemin, chose, corps, rire et voix le changement de sens est encore 
plus radical, puisqu&#8217;en ant&#233;position m&#233;chant est exclusivement intensif, alors qu&#8217;en 
postposition il devient comportemental ou psychologique. Enfin, le syst&#232;me est aussi capable 
de rep&#233;rer les noms pour lesquels on ne rep&#232;re pas de changement de sens lors du passage de 
l&#8217;ant&#233;position &#224; la postposition. C&#8217;est le cas ici de coup, part, regard et v&#233;rit&#233;.
Les erreurs rencontr&#233;es sur des noms comme homme ou enfant (calcul d&#8217;une valeur intensive 
en postposition) montrent ici encore les limites de la synonymie comme description du sens. 
Le calcul d&#8217;une valeur g&#233;n&#233;rale en postposition repose sur les hautes fr&#233;quences de 
cooccurrences de ces noms avec les adjectifs maigre, faible, pauvre et petit. Or la synonymie 
entre m&#233;chant et ces adjectifs n&#8217;est plus valable dans le contexte des noms consid&#233;r&#233;s ici, en 
pr&#233;sence desquels m&#233;chant se colore plut&#244;t d&#8217;une valeur comportementale ou psychologique. 
Le calcul d&#8217;un sens intensif en postposition pour cheval montre par ailleurs que ces relations 
de synonymie, en plus d&#8217;&#234;tre partielles, ne sont valables qu&#8217;en ant&#233;position. L&#224; encore, une 
perspective de r&#233;solution du probl&#232;me repose sur notre m&#233;thode d&#8217;exploration du graphe 
adjectival global, qui devrait permettre de rep&#233;rer automatiquement les sens intensifs d&#8217;un 
adjectif, ceux qui ne sont valables qu&#8217;en ant&#233;position.
</p>
<p>195</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne VENANT
</p>
<p>8 Conclusion 
Les analyses d&#233;taill&#233;es que nous avons men&#233;es montrent que les outils informatiques 
d&#233;velopp&#233;s sont tr&#232;s prometteurs. Les diff&#233;rentes &#233;tapes dans la r&#233;alisation, et l&#8217;analyse des 
r&#233;sultats obtenus &#224; chaque pas, ont mis au jour diff&#233;rents probl&#232;mes, que nous devrons 
r&#233;soudre pour aller plus avant. L&#8217;utilisation des cliques du graphe de synonymie s&#8217;est av&#233;r&#233;e 
fort judicieuse, tant pour la construction des espaces s&#233;mantiques que pour le calcul du sens 
proprement dit. Le recouvrement de l&#8217;espace s&#233;mantique par les cliques contrebalance le fait 
que la relation de synonymie est une relation partielle, non transitive et peut d&#233;pendre de la 
position de l&#8217;adjectif, ce qui cause cependant encore quelques probl&#232;mes non r&#233;solus. Les 
classes distributionnelles ont montr&#233; leur efficacit&#233; pour la prise en compte de l'influence du 
nom recteur, et de sa position relativement &#224; l'adjectif. Elles constituent une premi&#232;re &#233;tape 
vers une prise en charge des diff&#233;rences entre polys&#233;mie nominale et polys&#233;mie verbo-
adjectivale. Jacquet (2006) dans son travail sur la polys&#233;mie verbale, arrive en effet &#224; une 
conclusion similaire: &#171; On pourrait envisager d&#8217;utiliser les CSD pour la d&#233;sambigu&#239;sation des 
noms en tant que tels. Cela reviendrait &#224; dire que bureau dans l&#8217;&#233;nonc&#233; travailler sur le 
bureau prend le sens de la classe (bureau, table, chaise) que l&#8217;on pourrait nommer &#8216;meuble&#8217;. 
Alors que dans entrer dans le bureau, bureau prend le sens de la classe (bureau, cuisine, 
salon) que l&#8217;on pourrait nommer &#8216;pi&#232;ce&#8217;. &#187; Le travail d&#233;crit ici ne constitue cependant que la 
premi&#232;re &#233;tape dans le processus de validation du mod&#232;le utilis&#233;. Nous devons maintenant 
mener des &#233;valuations massives sur un &#233;chantillon beaucoup plus large d&#8217;adjectifs ambigus. Il 
faudra, dans ce cadre, r&#233;fl&#233;chir au mode de repr&#233;sentation du sens utilis&#233;. On peut chercher &#224; 
trouver un ensemble de synonymes ad&#233;quats pour un adjectif dans un syntagme donn&#233;, ou 
encore r&#233;fl&#233;chir &#224; une m&#233;thode automatique de partitionnement de l'espace s&#233;mantique par 
des outils g&#233;om&#233;triques (rep&#233;rer les zones denses en cliques dans l'espace s&#233;mantique). Il 
faudra aussi tenir compte des erreurs inh&#233;rentes &#224; l'analyse syntaxique automatique, par 
exemple dans le r&#233;p&#233;rage du nom recteur de l'adjectif. Ce travail laisse cependant entrevoir 
tout l&#8217;int&#233;r&#234;t de l&#8217;utilisation des math&#233;matiques du continu en traitement automatique des 
langues.
</p>
<p>R&#233;f&#233;rences 
BOUILLON P.,VIEGAS E (1999). The description of adjectives for natural languge processing : 
theoretical and applied perspectives, in Atelier th&#233;matique sur la description des adjectifs pour les 
traitements informatiques, Institut d&#8217;&#233;tudes scientifiques de Carg&#235;se. 
FRAN&#199;OIS J., VICTORRI B. et MANGUIN J.-L. (2002). Polys&#233;mie adjectivale et synonymie : l&#8217;&#233;ventail 
des sens de curieux, in La polys&#233;mie, Soutet, Olivier (Eds). Paris : PUS. 
FUCHS C., VICTORRI B. (1996). La polys&#233;mie. Construction dynamique du sens. Herm&#232;s. 
GOES J. (1999). L&#8217;adjectif. Entre nom et verbe. Paris/Bruxelles : Duculot. 
JACQUET G. (2006), Polys&#233;mie verbale et calcul du sens; th&#232;se de doctorat de l&#8217;EHESS.  
JACQUET G., VENANT F. (2005). Construction automatique de classes de s&#233;lection distributionnelles, 
in Actes du colloque TALN&#8217;05, Dourdan. 
PLOUX S., VICTORRI B. (1998). Construction d&#8217;espaces s&#233;mantiques &#224; l&#8217;aide de dictionnaires de 
synonymes. Traitement automatique des langues 39 (1). 
RASKIN V., NIRENBURG S. (1996.) Adjectival modification in text meaning representation. 
Proceedings of COLING '96. Copenhagen 
VENANT F. (2006), Repr&#233;sentation et calcul dynamique du sens : exploration du lexique adjectival du 
fran&#231;ais, th&#232;se de doctorat de l&#8217;EHESS.  
</p>
<p>196</p>

</div></div>
</body></html>