<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction automatique de cadres de sous-cat&#233;gorisation verbale pour le fran&#231;ais &#224; partir d&#8217;un corpus arbor&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Extraction automatique de cadres de sous-cat&#233;gorisation
verbale pour le fran&#231;ais &#224; partir d&#8217;un corpus arbor&#233;
</p>
<p>Anna KUPS&#769;C&#769;
Universit&#233; Paris3 / LLF, UMR 7110
et Acad&#233;mie Polonaise des Sciences
akupsc@univ-paris3.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons une exp&#233;rience d&#8217;extraction automatique des cadres de sous-
cat&#233;gorisation pour 1362 verbes fran&#231;ais. Nous exploitons un corpus journalistique richement
annot&#233; de 15 000 phrases dont nous extrayons 12 510 occurrences verbales. Nous &#233;valuons
dans un premier temps l&#8217;extraction des cadres bas&#233;e sur la fonction des arguments, ce qui nous
fournit 39 cadres diff&#233;rents avec une moyenne de 1.54 cadres par lemme. Ensuite, nous adoptons
une approche mixte (fonction et cat&#233;gorie syntaxique) qui nous fournit dans un premier temps
925 cadres diff&#233;rents, avec une moyenne de 3.44 cadres par lemme. Plusieurs m&#233;thodes de
factorisation, neutralisant en particulier les variantes de r&#233;alisation avec le passif ou les pronoms
clitiques, sont ensuite appliqu&#233;es et nous permettent d&#8217;aboutir &#224; 235 cadres diff&#233;rents avec une
moyenne de 1.94 cadres par verbe. Nous comparons bri&#232;vement nos r&#233;sultats avec les travaux
existants pour le fran&#231;ais et pour l&#8217;anglais.
</p>
<p>Abstract. We present our work on automatic extraction of subcategorisation frames for
1362 French verbs. We use a treebank of 15000 sentences from which we extract 12510 verb
occurrences. We evaluate the results based on a functional representation of frames and we
acquire 39 different frames, 1.54 per lemma on average. Then, we adopt a mixed representation
(functions and categories), which leads to 925 different frames, 3.44 frames on average. We
investigate several methods to reduce the ambiguity (e.g., neutralisation of passive forms or
clitic arguments), which allows us to arrive at 235 frames, with 1.94 frames per lemma on
average. We present a brief comparison with the existing work on French and English.
</p>
<p>Mots-cl&#233;s : fran&#231;ais, corpus arbor&#233;, sous-cat&#233;gorisation verbale, lexique-grammaire.
Keywords: French, treebank, verbal subcategorization, lexicon grammar.
</p>
<p>1 Introduction
</p>
<p>Cet article pr&#233;sente une exp&#233;rience pr&#233;liminaire d&#8217;extraction de sous-cat&#233;gorisations verbales
pour le fran&#231;ais &#224; partir d&#8217;un corpus journalistique richement annot&#233; (le corpus arbor&#233; de Pa-
ris7).
</p>
<p>Un lexique syntaxique est une ressource qui contient l&#8217;information sur le potentiel combina-
toire d&#8217;un pr&#233;dicat (ex., le verbe dormir r&#233;git un seul argument, le sujet), mais aussi sur le type
de ses arguments (ex., l&#8217;adjectif fier se combine avec un syntagme pr&#233;positionnel en de). Ces
</p>
<p>153</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anna KUPS&#769;C&#769;
</p>
<p>informations varient d&#8217;une langue &#224; l&#8217;autre, elles sont donc essentielles pour l&#8217;apprentissage
et l&#8217;acquisition des langues. Pour le traitement automatique des langues (TAL), les informa-
tions sur la structure pr&#233;dicative sont importantes dans la plupart des applications. (Briscoe &amp;
Carroll, 1993) estiment qu&#8217;environ la moiti&#233; des erreurs des analyseurs syntaxiques repose sur
des informations insuffisantes concernant la structure argumentale, tandis que (Carroll &amp; Fang,
2004) montrent une am&#233;lioration significative de la performance d&#8217;un parseur enrichi avec un tel
lexique. Elles jouent &#233;galement un r&#244;le essentiel pour la g&#233;n&#233;ration automatique (Danlos, 1985),
la traduction automatique (Han et al., 2000), ou l&#8217;extraction d&#8217;information, cf. (Surdeanu et al.,
2003).
</p>
<p>N&#233;anmoins, ce type d&#8217;informations est toujours difficilement disponible. Traditionnellement, de
telles ressources ont &#233;t&#233; d&#233;velopp&#233;es par des experts humains, par ex., (Procter, 1978; Hornby,
1989) (pour l&#8217;anglais) ou les lexiques-grammaires du LADL (Gross, 1975; Guillet &amp; Lecl&#232;re,
1992) et le Dictionnaire explicatif et Combinatoire (DECFC) de (Mel&#8217;cuk et al., 1984 1988
1992 1999) (pour le fran&#231;ais), ce qui garantit leur bonne qualit&#233;, mais elles ne sont pas directe-
ment adapt&#233;es au traitement automatique. Par contre, les ressources informatis&#233;es d&#233;velopp&#233;es
en vue des applications TAL utilisent des m&#233;thodes statistiques, par ex. : (Bourigault &amp; Fr&#233;-
rot, 2005; Chesley &amp; Salmon-Alt, 2005), ou semi-automatique (Sagot et al., 2006), (pour le
fran&#231;ais) ce qui rend les r&#233;sultats moins fiables.
</p>
<p>Dans cet article, nous nous basons sur le corpus arbor&#233; de Paris7, cf. (Abeill&#233; et al., 2003;
Abeill&#233; &amp; Barrier, 2004), pour obtenir les cadres de sous-cat&#233;gorisation verbales pour le fran-
&#231;ais. &#224; notre connaissance, ce corpus n&#8217;a pas encore &#233;t&#233; exploit&#233; pour l&#8217;extraction de telles
ressources lexicales. Le corpus arbor&#233; de Paris7 est un ensemble de textes journalistiques du
Journal Le Monde (1989-1993), annot&#233;s aux niveaux morphologique et syntaxique, pour les
constituants majeurs mais aussi pour les fonctions grammaticales. L&#8217;&#233;tiquetage a &#233;t&#233; valid&#233; par
des experts humains, ce qui fait du corpus une ressource pr&#233;cieuse pour des recherches lin-
guistiques mais aussi pour le d&#233;veloppement d&#8217;outils de TAL. Pour l&#8217;acquisition des cadres de
sous-cat&#233;gorisation verbale, nous nous sommes bas&#233;s sur une sous-partie du corpus qui com-
prend des annotations fonctionnelles, soit environ 15 000 phrases (environ 300 000 mots).
</p>
<p>L&#8217;objectif de ce travail est d&#8217;obtenir une liste de cadres de sous-cat&#233;gorisation utilisables par
diff&#233;rents types de grammaires &#233;lectroniques, ainsi qu&#8217;un lexique informatis&#233;, fiable et de haute
qualit&#233;, qui pourra servir en particulier pour l&#8217;&#233;valuation d&#8217;autres lexiques syntaxiques obtenus
automatiquement. Il s&#8217;agit &#233;galement d&#8217;estimer l&#8217;ambigu&#239;t&#233; des cadres de sous-cat&#233;gorisation
verbale (combien de cadres par verbe ?) et de rechercher les m&#233;thodes pour la r&#233;duire. Ceci nous
permettra de pr&#233;parer une ressource bien adapt&#233;e pour diff&#233;rentes applications TAL.
</p>
<p>2 &#233;tat de l&#8217;art
</p>
<p>Les travaux sur l&#8217;acquisition du lexique syntaxique &#224; partir de treebanks sont relativement nom-
breux, et la plupart utilise des donn&#233;es moins riches que les notres. Pour l&#8217;anglais, le lexique
syntaxique le plus important extrait &#224; partir du corpus arbor&#233; (Penn-II Treebank) a &#233;t&#233; obtenu
par (O&#8217;Donovan et al., 2004), comme une ressource suppl&#233;mentaire de l&#8217;induction des gram-
maires lexicalis&#233;es. La m&#234;me technique a &#233;t&#233; adopt&#233;e pour d&#8217;autres langues comme l&#8217;allemand
et le chinois, inter alia. (Sarkar &amp; Zeman, 2000) pr&#233;sentent les r&#233;sultats d&#8217;apprentissage automa-
tique de cadres de sous-cat&#233;gorisation &#224; partir du corpus arbor&#233; du tch&#232;que (Prague Dependency
Treebank), tandis que (Marinov, 2004) applique les m&#234;mes techniques sur un treebank bulgare
</p>
<p>154</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique de cadres sous-cat&#233;gorisation verbale
</p>
<p>(BullTreebank). Tous ces lexiques sont obtenus &#224; partir des annotations syntagmatiques, i.e., les
fonctions grammaticales sont assign&#233;es automatiquement en utilisant des m&#233;thodes statistiques.
Notre t&#226;che est diff&#233;rente car nous b&#233;n&#233;ficions des annotations fonctionnelles d&#233;j&#224; existantes
dans le treebank, sans interm&#233;diaire probabiliste.
</p>
<p>Pour le fran&#231;ais, les efforts r&#233;cents pour construire des &#233;lectroniques lexiques syntaxiques se
sont bas&#233;s sur les m&#233;thodes probabilistes, cf. (Bourigault &amp; Fr&#233;rot, 2005), (Chesley &amp; Salmon-
Alt, 2005), ou automatiques (Sagot et al., 2006). Elles utilisent des corpus qui n&#8217;ont que des
informations cat&#233;gorielles ou bien des fonctions sont assign&#233;es automatiquement (par un par-
seur), ce qui pose probl&#232;me pour distinguer arguments et ajouts. Un autre p&#244;le est repr&#233;sent&#233;
par les travaux sur l&#8217;informatisation et l&#8217;actualisation du lexique&#8211;grammaire de LADL, effectu&#233;
par (Gardent et al., 2006). C&#8217;est une ressource tout &#224; fait pr&#233;cieuse (plus de 8000 lemmes) mais
qui n&#8217;a pas &#224; notre connaissance &#233;t&#233; enti&#232;rement informatis&#233;e ni surtout valid&#233;e sur corpus.1 Un
autre lexique syntaxique de la large couverture (plus de 3700 verbes), Proton2 d&#233;velopp&#233; selon
l&#8217;approche pronominale, n&#8217;est pas directement utilisable dans les application TAL.
</p>
<p>3 Extraction des cadres de sous-cat&#233;gorisation verbale
</p>
<p>3.1 Choix d&#8217;informations &#224; extraire
</p>
<p>La repr&#233;sentation des cadres de sous-cat&#233;gorisation se fait diff&#233;remment selon diff&#233;rents ap-
proches : certains mod&#232;les th&#233;oriques, comme LFG (grammaire lexicale fonctionnelle) privi-
l&#233;gient une notation bas&#233;e sur les fonctions (1a), d&#8217;autres comme le LADL privil&#233;gient une
notation bas&#233;e sur les cat&#233;gories (1b), d&#8217;autres enfin, comme en HPSG (grammaire syntagma-
tique guid&#233;e par les t&#234;tes), ont une approche mixte (1c) :
(1) laver :
</p>
<p>a. &lt;SUJ, OBJ&gt;
b. N0 V N1
c. &lt;SUJ :NP, OBJ :NP&gt;
</p>
<p>Les deux premi&#232;res repr&#233;sentations ne sont pas compl&#232;tes parce que les fonctions et les cat&#233;go-
ries peuvent avoir plusieurs r&#233;alisations (par exemple le sujet peut &#234;tre nominal ou phrastique,
tandis qu&#8217;un NP postverbal peut &#234;tre objet direct ou attribut). Comme nous disposons d&#8217;un cor-
pus annot&#233; et pour les cat&#233;gories et pour les fonctions, nous adoptons une approche mixte pour
obtenir l&#8217;information plus riche. La liste des fonctions et des cat&#233;gories dans le corpus est indi-
qu&#233;e dans le tab. 1. Nous ignorons la fonction MOD qui correspond toujours &#224; des &#233;l&#233;ments non
sous-cat&#233;goris&#233;s (des modifieurs). Parmi les r&#233;alisations possibles des fonctions, nous ignorons
les cas avec COORD, puisque la coordination double est tr&#232;s rare.
</p>
<p>Pour les compl&#233;ments pr&#233;positionnels (P-OBJ), nous marquons le type de la pr&#233;position r&#233;gie
par le verbe. Ceci nous permettra de normaliser les cadres par rapport aux formes passives et
actives. Le noyau verbal, VN, contient le verbe principal mais aussi des auxiliaires, &#233;l&#233;ments
n&#233;gatifs, et les clitiques pronominaux. Selon une suggestion de (Abeill&#233; &amp; Barrier, 2004), nous
consid&#233;rons que le dernier V est la t&#234;te s&#233;mantique du VN. Les clitiques ont &#233;galement une
fonction indiqu&#233;e (au niveau du VN) quand ils correspondent aux arguments du verbe.
</p>
<p>1Le DECFC de Montr&#233;al est &#233;galement en cours d&#8217;informatisation mais ne comprend que 514 vocables, qui ne
sont pas tous des verbes (avec des informations s&#233;mantiques et non seulement syntaxiques).
</p>
<p>2http ://bach.arts.kuleuven.be/PA/proton.html
</p>
<p>155</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anna KUPS&#769;C&#769;
</p>
<p>SUJ NP, VPinf, Ssub, COORD
OBJ NP, AP, AdP, VPinf, COORD, Sint, Ssub
DE-OBJ VPinf, PP, Ssub, COORD
A-OBJ VPinf, PP, COORD
P-OBJ PP, AdP, COORD, NP
ATO Srel, PP, AP, NP, VPpart, COORD, VPinf, Ssub
ATS NP, PP, AP, AdP, VPinf, Ssub, COORD, VPpart, Sint
</p>
<p>FIG. 1 &#8211; Liste des cat&#233;gories possibles pour chaque fonction sous-cat&#233;goris&#233;e. Fonctions : SUJ
(sujet), OBJ (objet direct), DE-OBJ (objet indirect en de), A-OBJ (objet indirect en &#224;), P-OBJ
(compl&#233;ment avec une autre pr&#233;position), ATO (attribut de l&#8217;objet), ATS (attribut du sujet)
</p>
<p>3.2 Description de l&#8217;exp&#233;rience
</p>
<p>L&#8217;extraction de cadres de sous-cat&#233;gorisation verbale est plus difficile pour le fran&#231;ais que pour
l&#8217;anglais, d&#8217;une part &#224; cause des alternances de variantes avec les pronoms clitiques, d&#8217;autre
part &#224; cause d&#8217;un ordre des mots plus libre (un SN (NP) postverbal peut &#234;tre un sujet invers&#233; par
exemple). Nous avons extrait les lemmes des phrases principales du corpus arbor&#233; annot&#233; pour
les fonctions. Les fonctions sont trait&#233;es comme des attributs des syntagmes et non comme des
relations entre la t&#234;te et les syntagmes. Elles sont not&#233;es soit sur les syntagmes de m&#234;me niveau
que le VN (pour les d&#233;pendants du verbe) soit sur le VN lui-m&#234;me (pour les pronoms clitiques).
Puisque le VN contient aussi les auxiliaires, nous traitons le dernier verbe dans VN comme le
verbe principal, tandis que les auxiliaires sont stock&#233;s afin de normaliser les cadres par rapport
aux formes passives et actives.
</p>
<p>Comme point de d&#233;part, nous avons utilis&#233; les cadres extraits directement du corpus, sans au-
cune modification, et ensuite nous avons fait plusieurs tests pour compacter les cadres.
</p>
<p>D&#8217;abord, nous avons d&#233;group&#233; les fonctions accumul&#233;es par les clitiques dans le VN. S&#8217;il y
a plusieurs clitiques attach&#233;s au verbe (ex. : le sujet et l&#8217;objet dans Il l&#8217;a vue), leur fonctions
sont group&#233;es dans un seul tag (SUJ/OBJ). Il faut donc les s&#233;parer. Les cas o&#249; un clitique
appara&#238;t sans fonction sont normalement ceux qui correspondent &#224; des r&#233;fl&#233;chis fig&#233;s (comme
pour s&#8217;&#233;vanouir). Nous les conservons comme tels dans nos cadres. Enfin, on peut avoir dans
la m&#234;me phrase un clitique et un argument nominal de m&#234;me fonction. Ainsi dans une phrase
comme : Paul en mange-t-il beaucoup ?, on a deux sujets (Paul et il) et deux objets (en et
beaucoup). Il faut donc &#233;liminer les duplicats des fonctions dans les cadres. Finalement, il y a
des cadres qui n&#8217;ont pas de sujet sp&#233;cifi&#233;. C&#8217;est le cas pour les formes verbales &#224; l&#8217;imp&#233;ratif,
et nous avons compl&#233;t&#233; leurs cadres avec SUJ. Seules deux lemmes apparaissent toujours sans
sujet : il s&#8217;agit de voici et voil&#224; qui sont analys&#233;s comme des formes verbales &#224; l&#8217;indicatif, et
qui ont donc des cadres sp&#233;cifiques sans sujet.
</p>
<p>Nous avons normalis&#233; les cadres par rapport aux formes du passif. On a utilis&#233; une liste de 62
verbes qui sont conjugu&#233;s avec &#234;tre pour distinguer les formes du pass&#233; et du passif. Ainsi si
le verbe appara&#238;t dans le corpus avec l&#8217;auxiliaire &#234;tre mais qu&#8217;il se conjugue avec avoir, son
cadre est consid&#233;r&#233; comme passif et transform&#233; en forme active. On ajoute OBJ, tandis que le
compl&#233;ment d&#8217;agent (s&#8217;il est pr&#233;sent), i.e., P-OBJ introduit par la pr&#233;position par ou de, est
supprim&#233; (le SUJ est d&#233;j&#224; pr&#233;sent dans les deux cadres passifs), et on change ATS en ATO s&#8217;il
y a un attribut.
</p>
<p>156</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique de cadres sous-cat&#233;gorisation verbale
</p>
<p>Un deuxi&#232;me type de normalisation concerne les arguments clitiques. Comme nous extrayons
les cat&#233;gories des arguments, nous obtenons dans un premier temps, un cadre diff&#233;rent pour
une occurrence avec sujet clitique et une occurrence avec sujet nominal alors que c&#8217;est la m&#234;me
sous-cat&#233;gorisation. Nous avons donc regroup&#233; les r&#233;sultats.
</p>
<p>Nous avons aussi commenc&#233; la factorisation des compl&#233;ments optionnels. Par exemple, si un
m&#234;me verbe a deux cadres SUJ et SUJ OBJ, nous consid&#233;rons que l&#8217;objet est optionnel. On peut
donc lui assigner le cadre SUJ (OBJ).
</p>
<p>Certaines difficult&#233;s viennent des choix d&#8217;annotation du corpus. Par exemple, les syntagmes
adverbiaux sous-cat&#233;goris&#233;s ont une fonction syntaxique associ&#233;e mais pas les adverbes seuls.
Donc l&#8217;adverbe bien n&#8217;est pas reconnu comme le compl&#233;ment dans la phrase Elle va bien. Les
annotations du corpus ne sont faites que pour les arguments qui appartiennent au cadre du verbe
de m&#234;me niveau. Donc on va rater des cas de d&#233;pendance &#224; distance comme : Que peut faire le
gouvernement ? (puisqu&#8217;on va extraire deux OBJ pour peut et aucun pour faire). Tels cas sont
cependant assez rares.
</p>
<p>3.3 R&#233;sultats
</p>
<p>Dans cette exp&#233;rience nous avons utilis&#233; uniquement les verbes dans les phrases principales, soit
1362 verbe lemmes (12510 tokens). Nous comparons une approche uniquement fonctionnelle
de la sous-cat&#233;gorisation (comme (1a)) et une approche mixte qui tient compte &#233;galement des
cat&#233;gories (comme (1c)).
</p>
<p>3.3.1 Extraction de la Sous-cat&#233;gorisation fonctionnelle
</p>
<p>Nous avons normalis&#233; les cadres par rapport au passif et nous n&#8217;avons pas utilis&#233; les cat&#233;gories.
Nous ne tenons pas compte de l&#8217;ordre des mots, c&#8217;est-&#224;-dire que nous consid&#233;rons un seul cadre
pour Jean pense &#224; Marie et &#224; qui pense Jean que nous notons &#8217;A-OBJ, SUJ&#8217; (avec les fonctions
en ordre alphab&#233;tique). Si l&#8217;on tient compte des clitiques r&#233;fl&#233;chis, qui peuvent &#234;tre fig&#233;s, on
aboutit &#224; 39 cadres diff&#233;rents avec une moyenne de 1.75 cadres par verbe. Le lemme avec le
plus des cadres, 18, est le verbe &#234;tre. Plus de la moiti&#233; des verbes (63.3% des lemmes, soit 862
lemmes diff&#233;rents) sont non ambigus et ont un seul cadre.
</p>
<p>On peut r&#233;duire le nombre des cadres en &#233;liminant le clitique r&#233;fl&#233;chi pour les verbes qui ont
un OBJ ou un A-OBJ correspondant. Le nombre de cadres diff&#233;rents au total (39) comme le
maximum de cadres par lemme (18 pour &#234;tre) ne changent pas, mais on r&#233;duit la moyenne de
cadres par lemme &#224; 1.68. Avec ceci nous arrivons &#224; 65.1% des verbes (888 lemmes) &#224; un seul
cadre.
</p>
<p>Ensuite, si l&#8217;on factorise les arguments optionnels, par exemple les cadres SUJ et SUJ-OBJ,
on obtient plus de cadres diff&#233;rents possibles et moins de cadres diff&#233;rents pour chaque verbe.
Pour l&#8217;objet optionnel, nous avons un cadre de plus, c&#8217;est-&#224;-dire 40 cadres en g&#233;n&#233;ral, avec une
moyenne de 1.54 cadres par lemme, tandis qu&#8217;il y a 4 verbes &#224; 10 ou plus cadres, qui sont
effectivement parmi les plus ambigus du fran&#231;ais (&#234;tre, passer, avoir, rendre). Les r&#233;sultats sont
pr&#233;sent&#233;s dans le tableau 2. Les cadres pour les 4 verbes avec le plus de cadres sont dans le
tableau 3.
</p>
<p>Les cadres les plus fr&#233;quents sont ceux des verbes &#224; un compl&#233;ment, tout d&#8217;abord ceux &#224; objet
</p>
<p>157</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anna KUPS&#769;C&#769;
</p>
<p># cadres moyenne max. cadres verbes &#224; un cadre
% #
</p>
<p>avec r&#233;fl&#233;chi 39 1.75 18 (&#234;tre) 63.3% 862
sans r&#233;fl&#233;chi 39 1.68 18 (&#234;tre) 65.1% 888
SUJ (OBJ) 40 1.54 17 (&#234;tre) 68.9% 939
</p>
<p>FIG. 2 &#8211; R&#233;sultats pour les cadres fonctionnels
</p>
<p>&#234;tre (17): (OBJ), SUJ| A-OBJ, ATS, OBJ, SUJ| A-OBJ, ATS, SUJ| A-OBJ,
OBJ, SUJ| A-OBJ, SUJ| ATS, DE-OBJ, OBJ, SUJ| ATS, DE-OBJ, SUJ| ATS,
DE-OBJ, SUJ, refl| ATS, OBJ, P-OBJ, SUJ| ATS, OBJ, SUJ| ATS, P-OBJ,
SUJ| ATS, SUJ| ATS, SUJ, refl| DE-OBJ, OBJ, SUJ| DE-OBJ, SUJ| OBJ,
P-OBJ, SUJ| P-OBJ, SUJ
</p>
<p>avoir (11): (OBJ), SUJ| A-OBJ, DE-OBJ, OBJ, SUJ| A-OBJ, OBJ, SUJ|
A-OBJ, SUJ| ATO, OBJ, SUJ| ATS, OBJ, SUJ| DE-OBJ, OBJ, P-OBJ, SUJ|
DE-OBJ, OBJ, SUJ| DE-OBJ, SUJ| OBJ, P-OBJ, SUJ| P-OBJ, SUJ
</p>
<p>passer (10): (OBJ), SUJ| A-OBJ, DE-OBJ, SUJ| A-OBJ, OBJ, SUJ| A-OBJ,
SUJ| ATS, SUJ| DE-OBJ, SUJ| DE-OBJ, SUJ, refl| OBJ, P-OBJ, SUJ|
P-OBJ, SUJ| P-OBJ, SUJ, refl
</p>
<p>rendre (10): A-OBJ, DE-OBJ, OBJ, SUJ| A-OBJ, OBJ, SUJ| A-OBJ, SUJ|
ATO, DE-OBJ, OBJ, SUJ| ATO, OBJ, SUJ| ATS, P-OBJ, SUJ| ATS, SUJ|
DE-OBJ, OBJ, SUJ| OBJ, SUJ| P-OBJ, SUJ, refl
</p>
<p>FIG. 3 &#8211; Cadres fonctionnels pour les 4 verbes le plus ambigus : 10 cadres ou plus
</p>
<p>direct (plus de la moiti&#233; des occurrences), puis ceux &#224; sujet seul (le quart des lemmes), et ceux
&#224; objet indirect introduit par &#224; ou de, et diff&#233;rents types de ditransitifs. Il y a relativement peu
de verbes &#224; attribut, mais ils sont tr&#232;s fr&#233;quemment utilis&#233;s. Dans le tableau 4, les cadres sont
repr&#233;sent&#233;s avec les fonctions dans l&#8217;ordre alphab&#233;tique.
</p>
<p>L&#8217;inconv&#233;nient de cette approche est que l&#8217;on a perdu des informations par rapport au corpus,
en particulier on ne distingue pas les verbes qui prennent seulement un sujet nominal et ceux
qui prennent un sujet nominal et phrastique. C&#8217;est pourquoi nous passons &#224; une approche mixte.
</p>
<p>3.3.2 Extraction de la Sous-cat&#233;gorisation mixte
</p>
<p>Nous avons adopt&#233; une repr&#233;sentation mixte, qui garde les fonctions et les cat&#233;gories. Sans
aucune factorisation, ni pour le passif ni pour les clitiques (pronominaux et r&#233;fl&#233;chis), on obtient
925 cadres diff&#233;rents, avec une moyenne de 3.44 cadres par verbe, et 49% des verbes (668
lemmes) qui n&#8217;ont qu&#8217;un seul cadre.
</p>
<p>Apr&#232;s le d&#233;groupage et l&#8217;&#233;limination des duplicats des fonctions d&#233;crits dans la sec. 3.2, et avec
la normalisation du passif, on r&#233;duit le nombre de cadres presque de moiti&#233; (on obtient 465
cadres diff&#233;rents), avec une moyenne de 2.78 cadres par verbe. Le nombre de verbes qui ont un
seul cadre n&#8217;augmente pas beaucoup : 53% de verbes ne sont pas ambigus, soit 727 lemmes.
</p>
<p>Nous proc&#233;dons alors &#224; la factorisation par rapport aux diff&#233;rentes r&#233;alisations clitiques (pour
les sujets, les objets directs, les de-objets et les &#224;-objets). Le taux d&#8217;ambigu&#239;t&#233; baisse &#224; 2.17 et
nous obtenons 127 cadres de moins (337), tandis qu&#8217;un peu plus de 100 verbes ont un seul cadre
</p>
<p>158</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique de cadres sous-cat&#233;gorisation verbale
</p>
<p>cadre # types de verbes occurrences
OBJ, SUJ 986 (72.4%) 6625 (52.9%)
SUJ 346 (25.4%) 1052 (8.4%)
A-OBJ, OBJ, SUJ 184 (13.5%) 423 (3.4%)
A-OBJ, SUJ 136 (9.9%) 423 (3.4%)
DE-OBJ, SUJ 125 (9.1%) 534 (4.3%)
OBJ, P-OBJ, SUJ 101 (7.4%) 165 (1.3%)
DE-OBJ, OBJ, SUJ 98 (7.2%) 196 (1.5%)
P-OBJ, SUJ 81 (5.9%) 215 (1.7%)
ATO, OBJ, SUJ 42 (3.1%) 1929 (15.4%)
SUJ, refl 36 (2.6%) 259 (2.1%)
</p>
<p>FIG. 4 &#8211; Les 10 cadres de sous-cat&#233;gorisation fonctionnelle les plus fr&#233;quents
</p>
<p># cadres moyenne max. cadres verbes &#224; un cadre
% #
</p>
<p>donn&#233;es brutes 925 3.44 242 (&#234;tre) 49% 668
normalisation passif 465 2.78 114 (&#234;tre) 53.3% 727
normalisation clitiques 337 2.17 76 (&#234;tre) 60.8% 829
normalisation r&#233;fl&#233;chi 337 2.11 76 (&#234;tre) 62.5% 851
avec OBJ optionnel 338 2.00 75 (&#234;tre) 64.4% 877
sans pr&#233;positions 235 1.94 62 (&#234;tre) 64.4% 877
</p>
<p>FIG. 5 &#8211; R&#233;sultats pour les cadres mixtes
</p>
<p>&#234;tre (62), avoir (23), rester (22), faire (17), passer (14),
trouver (14), estimer (13), sembler (13), rendre (13), devenir (11),
demander (11), aller (11), porter (11), d&#233;clarer (10), laisser (10)
</p>
<p>FIG. 6 &#8211; Nombre de cadres mixtes pour 14 verbes les plus ambigus (10 cadres ou plus)
</p>
<p>(829). La normalisation par rapport au clitique r&#233;fl&#233;chi diminue un peu l&#8217;ambigu&#239;t&#233; (&#224; 2.11 en
moyenne) et augmente l&#233;g&#232;rement le nombre de verbes &#224; un seul cadre (&#224; 851). Le nombre de
cadres ne change pas. Nous proc&#233;dons enfin &#224; la factorisation des objets optionnels, en ajoutant
les cadres correspondants, ce qui nous am&#232;ne &#224; 338 cadres distincts, avec une moyenne de 2
cadres par verbe. Si, enfin, on neutralise la valeur lexicale des pr&#233;positions (diff&#233;rentes de &#224; ou
de), on obtient 235 cadres diff&#233;rents au total, et 1.94 en moyenne. Il reste 14 verbes avec plus
de 10 cadres, avec un maximum de 62 cadres pour le verbe &#234;tre, indiqu&#233;s dans le tableau 6. Les
r&#233;sultats sont group&#233;s dans le tableau 5.
</p>
<p>Il est clair que l&#8217;approche mixte est plus pr&#233;cise mais aboutit &#224; un grand &#233;clatement par rap-
port &#224; l&#8217;approche fonctionnelle : si l&#8217;on inclut les cat&#233;gories, m&#234;me avec les r&#233;sultats les plus
compact&#233;s, nous avons presque 6 fois plus des cadres ! N&#233;anmoins, les taux d&#8217;ambigu&#239;t&#233;s en
moyenne et surtout les nombres de verbes avec un seul cadre sont relativement proches. Ceci
nous donne l&#8217;espoir que l&#8217;approche mixte, plus riche en information, peut &#234;tre adopt&#233;e dans
les applications pratiques. Il nous reste certaines factorisations &#224; effectuer : celles qui concerne
l&#8217;optionalit&#233; des autres compl&#233;ments, et celle qui concerne les attributs. En effet, on distingue
les attributs selon leur cat&#233;gorie, alors que pour &#234;tre, par exemple, il s&#8217;agit du m&#234;me cadre.
</p>
<p>159</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anna KUPS&#769;C&#769;
</p>
<p>cadre # types de verbes occurrences
OBJ :NP, SUJ :NP 764 (55.6%) 3489 (27.8%)
SUJ :NP 159 (11.6%) 846 (6.7%)
A-OBJ :PP, OBJ :NP, SUJ :NP 103 (7.5%) 268 (2.1%)
OBJ :Ssub, SUJ :NP 92 (6.7%) 420 (3.3%)
DE-OBJ :PP, SUJ :NP 85 (6.2%) 308 (2.4%)
OBJ :VPinf, SUJ :NP 77 (5.6%) 1636 (13.7%)
P-OBJ :PP, SUJ :NP 73 (5.3%) 170 (1.3%)
OBJ :NP, P-OBJ :PP, SUJ :NP 68 (4.9%) 100 (0.8%)
A-OBJ :PP, SUJ :NP 68 (4.9%) 175 (1.3%)
SUJ :NP, refl :CL 36 (2.6%) 234 (1.9%)
</p>
<p>FIG. 7 &#8211; Les 10 cadres de sous-cat&#233;gorisation mixte les plus fr&#233;quents
</p>
<p>Mais il n&#8217;est pas vrai que tous les verbes attributifs acceptent des attributs de n&#8217;importe quelle
cat&#233;gorie et il faut sans doute affiner les cadres (Lamiroy &amp; Melis, 2005). On pourrait de m&#234;me
regrouper les compl&#233;ments phrastiques et infinitifs pour les lemmes qui acceptent les deux.
</p>
<p>Si l&#8217;on consid&#232;re les cadres de sous-cat&#233;gorisation les plus fr&#233;quents (tab. 7), on voit que comme
dans l&#8217;approche pr&#233;c&#233;dente, c&#8217;est le cadre transitif direct qui arrive en t&#234;te. On voit aussi que le
compl&#233;ment phrastique concerne plus de lemmes que le compl&#233;ment infinitif, mais beaucoup
moins d&#8217;occurrences.
</p>
<p>3.4 Discussion
</p>
<p>Les approches pr&#233;c&#233;dentes ne disposant pas de la distinction entre ajouts et arguments dans
le corpus de d&#233;part, adoptent une approche statistique qui les conduit &#224; ignorer les lemmes &#224;
fr&#233;quence basse (moins de 5 occurrences). Puisque nous disposons de ces informations dans le
corpus, ceci nous permet de consid&#233;rer aussi les cadres plus rares.
</p>
<p>3.4.1 Comparaison avec les travaux sur l&#8217;anglais
</p>
<p>Pour l&#8217;anglais, le taux d&#8217;ambigu&#239;t&#233; de cadres est rarement mentionn&#233;. (Manning, 1993) rapporte
la moyenne de 1.43 cadres par verbe pour le lexique de 1856 lemmes, ce qui est comparable
avec les chiffres que nous obtenons : un lexique de 1362 lemmes et 1.54 cadres en moyenne
(cadres fonctionnels). La diff&#233;rence principale r&#233;side non seulement dans la m&#233;thode adopt&#233;e
(l&#8217;approche statistique) mais aussi dans le fait qu&#8217;il utilise 19 cadres pr&#233;suppos&#233;s, tandis que
nous les acqu&#233;rons &#224; partir des annotations dans le corpus. (O&#8217;Donovan et al., 2004) adoptent,
comme nous, une approche mixte pour la repr&#233;sentation des cadres et obtiennent un lexique
de 4362 lemmes, avec environ 4 cadres en moyenne, 38 types de cadres bas&#233;s uniquement
sur les fonctions et 577 cadres acquis si les diff&#233;rents types de pr&#233;positions et particules sont
inclus. Les auteurs sont quand m&#234;me oblig&#233;s &#224; adopter une m&#233;thode automatique pour obtenir
les annotations fonctionnelles car ces informations ne sont pas pr&#233;sentes dans le corpus.
</p>
<p>160</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique de cadres sous-cat&#233;gorisation verbale
</p>
<p>3.4.2 Comparaison avec les travaux sur le fran&#231;ais
</p>
<p>Les tables du LADL comportent 38 cadres principaux pour les verbes simples. Ces cadres sont
bas&#233;s sur la cat&#233;gorie des arguments et non sur les fonctions, et ils tiennent compte de la valeur
lexicale de certaines pr&#233;positions. Les tables distinguent ainsi parmi les compl&#233;ments, les cadres
o&#249; seul un compl&#233;ment infinitif est autoris&#233; (table 1) ou ceux avec un compl&#233;ment nominal
introduit par la pr&#233;position &#224; (table 33). Nos r&#233;sultats, obtenus par la m&#233;thode fonctionnelle,
sont presque de m&#234;me taille (39 cadres diff&#233;rents) mais ils sont en fait diff&#233;rents. Nous avons
par exemple des cadres pour les emplois attributifs (cadres avec attribut du sujet ou attribut de
l&#8217;objet) qui ne figurent pas dans les tables du LADL. D&#8217;autre part, nous avons certains emplois
fig&#233;s (cf. verbes avec clitique fig&#233;) ce qui cr&#233;e des cadres suppl&#233;mentaires. Si l&#8217;on compare les
tables avec nos r&#233;sultats obtenus par la m&#233;thode mixte, nos chiffres sont tr&#232;s sup&#233;rieurs. Il y a
deux raisons &#224; ceci : d&#8217;une part nous avons d&#233;gag&#233; des cadres suppl&#233;mentaires par rapport aux
tables LADL (pour les attributs, pour les clitiques fig&#233;s ou pour les verbes sans sujet) et d&#8217;autre
part il nous reste encore &#224; faire certains regroupements, par exemple pour les cat&#233;gories des
attributs, ou les emplois &#224; compl&#233;ment infinitif ou phrastique.
</p>
<p>(Candito, 1999) et (Abeill&#233;, 2002) d&#233;crivent les familles d&#8217;arbres de la grammaire FTAG. Il
s&#8217;agit pourtant de cadres abstraits qui ne sont pas coupl&#233;s &#224; un lexique de grande taille. Dans
la grammaire FTAG sont distingu&#233;es 45 familles &#224; t&#234;te verbale, dont 15 &#224; arguments nominaux
et 24 &#224; arguments phrastiques et 6 &#224; compl&#233;ment adverbial. Cette grammaire inclut, comme ici,
un cadre pour les formes verbales sans sujet, voici et voil&#224;, quelques cadres pour les verbes &#224;
clitique fig&#233; (comme s&#8217;&#233;vanouir ou s&#8217;appeler N). Mais il est clair que nous extrayons des cadres
suppl&#233;mentaires.
</p>
<p>4 Conclusion
</p>
<p>Les r&#233;sultats pr&#233;liminaires d&#8217;extraction des cadres de sous-cat&#233;gorisation verbale &#224; partir de
treebank fran&#231;ais pr&#233;sent&#233; dans cet article sont encourageants. Nous avons r&#233;ussi &#224; consi-
d&#233;rablement r&#233;duire l&#8217;ambigu&#239;t&#233; de la repr&#233;sentation mixte avec les diff&#233;rentes techniques de
factorisations. Ce r&#233;sultat nous laisse esp&#233;rer qu&#8217;il est donc possible d&#8217;incorporer les informa-
tions plus riches dans les applications pratiques.
</p>
<p>Nous planifions plusieurs extensions de ce travail. Pour obtenir un lexique plus important, nous
allons prendre toutes les occurrences des verbes (environ 2200 verbes, soit 15% de 15000 verbes
en usage, selon (Gross, 1975; Guillet &amp; Lecl&#232;re, 1992)) et non seulement les verbes dans les
phrases principales. On pr&#233;voit aussi l&#8217;extraction d&#8217;autres cat&#233;gories pr&#233;dicatives (cadres de
sous-cat&#233;gorisation des adjectifs ou des noms). Nous pensons incorporer ce lexique dans les ap-
plications TAL. Les cadres obtenus peuvent &#234;tre facilement traduits dans un mod&#232;le et un format
utilisables par un analyseur syntaxique (par exemple XLFG de L. Cl&#233;ment bas&#233; sur LFG), dans
une autre application ou selon le format sp&#233;cifi&#233; par le projet LexSynt.3 Nous proposons aussi
de confronter nos r&#233;sultats &#224; d&#8217;autres corpus (par exemple, TLFI ou Frantext) pour valider le
lexique et le comparer avec d&#8217;autres travaux. Ceci nous permettra aussi enrichir le treebank de
d&#233;part en ajoutant automatiquement le cadre de sous-cat&#233;gorisation &#224; chaque occurrence ver-
bale (quand on en a extrait un seul) ou en en ajoutant plusieurs (avec un choix &#224; valider par un
annotateur humain) si l&#8217;on en a extrait plusieurs.
</p>
<p>3http ://lexsynt.inria.fr/index.php
</p>
<p>161</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anna KUPS&#769;C&#769;
</p>
<p>R&#233;f&#233;rences
ABEILL&#201; A. (2002). Une grammaire &#233;lectronique du fran&#231;ais. CNRS Editions.
ABEILL&#201; A. &amp; BARRIER N. (2004). Enriching a French treebank. In Proceedings of the LREC04
Conference, Lisbonne.
ABEILL&#201; A., CL&#201;MENT L. &amp; TOUSSENEL F. (2003). Building a treebank for French. In Treebanks.
Kluwer.
BOURIGAULT D. &amp; FR&#201;ROT C. (2005). Acquisition et &#233;valuation sur corpus de propri&#233;t&#233;s de sous-
cat&#233;gorisation syntaxique. In Actes des 12&#232;mes journ&#233;es sur le Traitement Automatique des Langues
Naturelles.
BRISCOE T. &amp; CARROLL J. (1993). Generalised probabilistic LR parsing for unification-based gram-
mars. Computational linguistics.
CANDITO M.-H. (1999). R&#233;presentation modulaire et parametrable de grammaires &#233;lectroniques lexi-
calis&#233;es. Application au fran&#231;ais et &#224; l&#8217;italien. PhD thesis, Universit&#233; Paris7.
CARROLL J. &amp; FANG A. (2004). The automatique acquisition of verb subcategorisations and their
impact on the performance of an HPSG parser. In Proceedings of the 1st International Conference on
Natural Language Processing, Sanya City, China.
CHESLEY P. &amp; SALMON-ALT S. (2005). Le filtrage probabiliste dans l&#8217;extraction automatique de
cadres de sous-catg&#769;orisation. In Journ&#233; ATALA sur l&#8217;interface lexique-grammaire, Paris.
DANLOS L. (1985). La generation automatique de textes. Masson.
GARDENT C., GUILLAUME B., PERRIER G. &amp; FALK I. (2006). Extraction d&#8217;information de sous-
cat&#233;gorisation &#224; partir du lexique-grammaire de Maurice Gross. In TALN 2006.
GROSS M. (1975). M&#233;thodes en syntaxe. Hermann.
GUILLET A. &amp; LECL&#200;RE C. (1992). La structure des phrases simples en fran&#231;ais. Gen&#232;ve : Droz.
HAN C., YOON J., KIM N. &amp; PALMER M. (2000). A Feature-Based Lexicalized Tree Adjoining
Grammar for Korean. Rapport interne, IRCS.
HORNBY A. S. (1989). Oxford Advanced Learner&#8217;s Dictionary of Current English. Oxford : Oxford
University Press, 4th edition.
LAMIROY B. &amp; MELIS L. (2005). Les copules ressemblent-elles aux auxiliaires ? In SHYLDKROT, H.
BAT-ZEEV &amp; N. L. QUERLER, Eds., Les P&#233;riphrases Verbales, p. 145&#8211;170.
MANNING C. D. (1993). Automatic acquisition of a large subcategorization dictionary from corpora.
In Proceedings of the 31th Meeting of the ACL, p. 235&#8211;242, Columbus, Ohio.
MARINOV S. (2004). Automatic extraction of subcategorization frames for Bulgarian. In P. EGR&#201; &amp;
L. A. I ALEMANY, Eds., Proceedings of the Ninth ESSLLI Student Session.
MEL&#8217;CUK I., ARBATCHEWSKY-JUMARIE N. &amp; CLAS A. (1984, 1988, 1992, 1999). Dictionnaire
explicatif et combinatoire du fran&#231;ais contemporain. Recherches lexico-s&#233;mantiques, vol. I, II, III, IV.
Les Presses de l&#8217;Universit&#233; de Montr&#233;al.
O&#8217;DONOVAN R., BURKE M., CAHILL A., VAN GENABITH J. &amp; WAY A. (2004). Large-scale in-
duction and Evaluation of Lexical Resources from the Penn-II Treebank. In Proceedings of the 42nd
Conference of the Association for Computational Linguistics, p. 367&#8211;374, Barcelona, Spain.
P. PROCTER, Ed. (1978). Longman Dictionary of Contemporary English. Burnt Mill, Harlow : Long-
man.
SAGOT B., CL&#201;MENT L., DE LA CLERGERIE E. V. &amp; BOULLIER P. (2006). The lefff 2 syntactic
lexicon for french : architecture, acquisition, use. In Actes de LREC 06, G&#234;nes, Italie.
SARKAR A. &amp; ZEMAN D. (2000). Automatic extraction of subcategorization frames for Czech. In
Proceedings of Colling 2000.
SURDEANU M., HARABAGIU S., WILLIAMS J. &amp; AARSETH P. (2003). Using predicate-argument
structures for information extraction.
</p>
<p>162</p>

</div></div>
</body></html>