<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apprentissage non supervis&#233; de familles morphologiques par classification ascendante hi&#233;rarchique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Apprentissage non supervis&#233; de familles
morphologiques par classification
</p>
<p>ascendante hi&#233;rarchique
</p>
<p>Delphine Bernhard
TIMC-IMAG, Institut d&#8217;Ing&#233;nierie de l&#8217;Information de Sant&#233;
</p>
<p>Facult&#233; de M&#233;decine, 38706 La Tronche cedex
Delphine.Bernhard@imag.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente un syst&#232;me d&#8217;acquisition de familles morphologiques
qui proc&#232;de par apprentissage non supervis&#233; &#224; partir de listes de mots extraites de corpus
de textes. L&#8217;approche consiste &#224; former des familles par groupements successifs, similaire-
ment aux m&#233;thodes de classification ascendante hi&#233;rarchique. Les crit&#232;res de regroupement
reposent sur la similarit&#233; graphique des mots ainsi que sur des listes de pr&#233;fixes et de paires
de suffixes acquises automatiquement &#224; partir des corpus trait&#233;s. Les r&#233;sultats obtenus
pour des corpus de textes de sp&#233;cialit&#233; en fran&#231;ais et en anglais sont &#233;valu&#233;s &#224; l&#8217;aide de la
base CELEX et de listes de r&#233;f&#233;rence construites manuellement. L&#8217;&#233;valuation d&#233;montre les
bonnes performances du syst&#232;me, ind&#233;pendamment de la langue, et ce malgr&#233; la technicit&#233;
et la complexit&#233; morphologique du vocabulaire trait&#233;.
</p>
<p>Abstract. This article describes a method for the unsupervised acquisition of mor-
phological families using lists of words extracted from text corpora. It proceeds by in-
crementally grouping words in families, similarly to agglomerative hierarchical clustering
methods. Clustering criteria rely on graphical similarity as well as lists of prefixes and
suffix pairs which are automatically acquired from the target corpus. Results obtained for
specialised text corpora in French and English are evaluated using the CELEX database
and manually built reference lists. The evaluation shows that the system perfoms well for
both languages, despite the morphological complexity of the technical vocabulary used
for the evaluation.
</p>
<p>Mots-cl&#233;s : familles morphologiques, classification, apprentissage non supervis&#233;.
</p>
<p>Keywords: morphological families, clustering, unsupervised learning.
</p>
<p>1 Introduction
</p>
<p>L&#8217;analyse morphologique est une t&#226;che importante dans divers domaines du traitement
automatique des langues comme la reconnaissance de la parole, la communication alter-
native et augment&#233;e, la traduction automatique ou la recherche d&#8217;informations. Dans ce
dernier cas, l&#8217;utilit&#233; des connaissances morphologiques se justifie par la proximit&#233; s&#233;man-
tique des variantes flexionnelles ou d&#233;rivationnelles. Il est &#233;galement possible d&#8217;exploiter
</p>
<p>367</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>la structure morphologique des mots pour l&#8217;acquisition de relations s&#233;mantiques telles
que l&#8217;hyponymie (Buitelaar &amp; Sacaleanu, 2002) ou l&#8217;antonymie (Schwab et al., 2005). Les
ressources d&#233;crivant les liens morphologiques n&#8217;&#233;tant pas disponibles &#224; l&#8217;heure actuelle
pour toutes les langues et tous les domaines, ces applications sont fr&#233;quemment associ&#233;es
&#224; l&#8217;acquisition automatique de connaissances morphologiques &#224; partir de textes. Les m&#233;-
thodes d&#8217;analyse morphologique non supervis&#233;e sont vari&#233;es : comparaison de graphies
(Zweigenbaum &amp; Grabar, 2000), recherche d&#8217;analogies (Lepage, 1998), mod&#232;les probabi-
listes (Creutz &amp; Lagus, 2005) ou segmentation par optimisation (Goldsmith, 2001; Creutz
&amp; Lagus, 2002). Elles se distinguent &#233;galement par le type de r&#233;sultats obtenus : mots
d&#233;coup&#233;s en segments morph&#233;miques ou liens morphologiques.
</p>
<p>Le travail pr&#233;sent&#233; dans cet article rel&#232;ve du second type de m&#233;thode car il consiste en
l&#8217;acquisition de familles morphologiques, c&#8217;est-&#224;-dire des groupes de mots li&#233;s deux &#224; deux
par un lien morphologique d&#8217;affixation (pr&#233;fixation ou suffixation) ou de composition. Nous
formulons la question de l&#8217;acquisition de familles morphologiques comme un probl&#232;me de
classification. En effet, l&#8217;objectif de la classification est d&#8217;organiser un ensemble de donn&#233;es
en groupes homog&#232;nes et contrast&#233;s : dans notre cas, les groupes souhait&#233;s sont des familles
de mots morphologiquement reli&#233;s. La m&#233;thode que nous proposons prend pour point de
d&#233;part une liste de mots et les groupe en familles d&#8217;une mani&#232;re similaire aux m&#233;thodes
de classification ascendante hi&#233;rarchique utilis&#233;es en analyse de donn&#233;es. Elle a de plus la
particularit&#233; d&#8217;&#234;tre non supervis&#233;e et n&#8217;est donc pas li&#233;e &#224; une langue ou &#224; un domaine
pr&#233;cis.
</p>
<p>Nous allons dans un premier temps d&#233;crire les diverses &#233;tapes de la m&#233;thode avant de
pr&#233;senter et d&#8217;analyser les r&#233;sultats obtenus pour des corpus de textes techniques (m&#233;de-
cine et volcanologie) en fran&#231;ais et en anglais. Nous nous int&#233;ressons plus particuli&#232;rement
au vocabulaire technique car il se caract&#233;rise par l&#8217;utilisation fr&#233;quente des proc&#233;d&#233;s de
composition et de d&#233;rivation, notamment par pr&#233;fixation.
</p>
<p>2 Description de la m&#233;thode
</p>
<p>Le syst&#232;me prend pour entr&#233;e les donn&#233;es suivantes :
</p>
<p>&#8211; Une liste des mots d&#8217;un corpus L
&#8211; Une liste de pr&#233;fixes P
&#8211; Une liste de signatures (ou paires de suffixes) S
</p>
<p>Les deux derni&#232;res listes sont obtenues &#224; partir de la premi&#232;re &#224; l&#8217;aide du module d&#8217;ap-
prentissage d&#8217;affixes d&#233;crit dans (Bernhard, 2006). Celui-ci utilise les probabilit&#233;s transi-
tionnelles entre sous-cha&#238;nes pour rep&#233;rer les zones de faible probabilit&#233; et ainsi d&#233;couper
les mots en radical et affixes. Nous avons adapt&#233; ce module pour qu&#8217;il produise non seule-
ment une liste de pr&#233;fixes et de suffixes mais &#233;galement une liste de paires de suffixes qui
apparaissent avec la m&#234;me base et qui sont donc mutuellement substituables sur l&#8217;axe
paradigmatique1. Par exemple, les suffixes de la paire (s,ique) peuvent se combiner &#224; la
base climat pour former les mots climats et climatique. La m&#234;me signature se retrouve
dans les paires de mots volcans &#8211; volcanique et oc&#233;ans &#8211; oc&#233;anique. La notion de signa-
</p>
<p>1Il faut noter que les pr&#233;fixes et les suffixes sont acquis automatiquement, de mani&#232;re non supervis&#233;e.
Par cons&#233;quent, aucune distinction n&#8217;est faite entre les affixes flexionnels et d&#233;rivationnels.
</p>
<p>368</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage non supervis&#233; de familles morphologiques
</p>
<p>ture est pr&#233;sente dans de nombreux travaux en acquisition automatique de connaissances
morphologiques, parfois sous des d&#233;nominations diff&#233;rentes : paires de suffixes (Gaussier,
1999), r&#232;gles morphologiques (Grabar &amp; Zweigenbaum, 1999) ou sch&#233;mas de suffixation
(Hathout, 2005).
</p>
<p>Nous allons maintenant d&#233;tailler l&#8217;ensemble des &#233;tapes menant &#224; l&#8217;acquisition des familles
morphologiques.
</p>
<p>2.1 Familles initiales
</p>
<p>Avant apprentissage, il y a autant de familles que de mots dans la liste donn&#233;e en entr&#233;e :
chaque mot constitue sa propre famille. Les familles form&#233;es au cours du processus d&#8217;ap-
prentissage sont repr&#233;sent&#233;es par un radical R. De plus, chaque famille comprend deux
sous-familles, sauf si elle correspond &#224; une feuille dans la hi&#233;rarchie : dans ce cas, elle
contient un mot unique et n&#8217;a pas de sous-famille.
</p>
<p>2.2 &#201;tape 1 : regroupement de familles &#224; partir de l&#8217;inclusion
de mots
</p>
<p>Le premier crit&#232;re de regroupement des familles est l&#8217;inclusion de mots : il s&#8217;agit de rep&#233;rer
les mots form&#233;s par pr&#233;fixation &#224; partir d&#8217;un autre mot de la liste, selon une proc&#233;dure
d&#233;taill&#233;e ci-dessous :
</p>
<p>Soient :
&#8211; m1,m2, . . . ,mi et mj des mots de longueur minimale &#233;gale &#224; 4 ;
&#8211; F1, F2, . . . , Fi des familles telles que F1 = [m1] , F2 = [m2] , . . . , Fi = [mi] ;
&#8211; Fj une famille telle que Fj = [mj].
Les familles F1, F2, . . . , Fi et Fj sont regroup&#233;es pour former une nouvelle famille
Fk si m1 = E1 +mj,m2 = E2 +mj, . . . ,mi = Ei +mj
o&#249; E1, E2, . . ., Ei repr&#233;sentent une suite maximale d&#8217;un ou plusieurs pr&#233;fixes de
la liste P , &#233;ventuellement s&#233;par&#233;s par des tirets, tels que chaque pr&#233;fixe ait une
longueur minimale de 3.
Le radical de la nouvelle famille Fk est mj.
</p>
<p>Par exemple, si F1 = [sub-oc&#233;aniques], F2 = [oc&#233;aniques] et F3 = [intra-oc&#233;aniques]
alors il est possible de former une nouvelle famille F4 telle que F4 = F1 &#8746; F2 &#8746; F3 =
[sub-oc&#233;aniques, oc&#233;aniques, intra-oc&#233;aniques]. En effet, les mots sub-oc&#233;aniques et intra-
oc&#233;aniques contiennent tous le mot oc&#233;aniques. De plus, ils d&#233;butent par les pr&#233;fixes sub+
et intra+. Le radical de la nouvelle famille est oc&#233;aniques.
</p>
<p>2.3 &#201;tape 2 : regroupement de familles &#224; partir des pr&#233;fixes
</p>
<p>Apr&#232;s avoir proc&#233;d&#233; &#224; un premier regroupement des mots en fonction des mots inclus,
nous utilisons d&#8217;autres crit&#232;res de regroupement, bas&#233;s sur la comparaison des graphies
des radicaux des familles existantes et des pr&#233;fixes auxquels ils peuvent &#234;tre associ&#233;s. En
</p>
<p>369</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>effet, lorsque deux mots partagent un m&#234;me pr&#233;fixe et que leurs bases sont graphiquement
similaires, alors il y a de fortes chances pour qu&#8217;ils soient &#233;galement morphologiquement
li&#233;s. Prenons l&#8217;exemple des mots suivants : neuro-oncologist et neuro-oncology. Ces deux
mots d&#233;butent tous deux par le pr&#233;fixe neuro- suivi d&#8217;une m&#234;me cha&#238;ne de caract&#232;res de
longueur 7 : oncolog. La combinaison de deux indices, &#224; savoir le partage d&#8217;un pr&#233;fixe,
suivi d&#8217;une cha&#238;ne commune, est un indice suffisant dans la plupart des cas pour conclure
que les mots sont morphologiquement li&#233;s.
</p>
<p>Nous appliquons ces remarques de la mani&#232;re suivante :
</p>
<p>Soient :
&#8211; F1 et F2 deux familles ;
&#8211; R1 le radical repr&#233;sentant F1 ;
&#8211; R2 le radical repr&#233;sentant F2.
Les deux familles F1 et F2 sont regroup&#233;es dans une nouvelle famille F3 ssi :
</p>
<p>1. R1 = &#945;+ s1 et R2 = &#945;+ s2, o&#249; &#945; est une cha&#238;ne de caract&#232;res de longueur
minimale &#233;gale &#224; 4 et s1 et s2 sont des cha&#238;nes de caract&#232;res diff&#233;rant au
moins par leur premier caract&#232;re.
</p>
<p>2. Il existe au moins un mot m1 &#8712; F1 et un mot m2 &#8712; F2 tels que m1 et m2
incluent le m&#234;me pr&#233;fixe.
</p>
<p>Le radical R3 de la nouvelle famille F3 est le mot le plus court parmi R1 et R2.
</p>
<p>Par exemple, si :
</p>
<p>&#8211; F1 = [oc&#233;anique, intra-oc&#233;anique] avec R1 = oc&#233;anique ;
&#8211; F2 = [oc&#233;aniques, sub-oc&#233;aniques, intra-oc&#233;aniques] avec R2 = oc&#233;aniques
</p>
<p>alors il est possible de former une nouvelle famille :
</p>
<p>F3 = F1&#8746;F2 = [oc&#233;anique, intra-oc&#233;anique, oc&#233;aniques, sub-oc&#233;aniques, intra-oc&#233;aniques].
En effet, R1 et R2 partagent une cha&#238;ne initiale commune de longueur 9, oc&#233;anique, et les
mots intra-oc&#233;anique de F1 et intra-oc&#233;aniques de F2 ont en commun le pr&#233;fixe intra. Le
radical de F3 est le radical le plus court, &#224; savoir oc&#233;anique.
</p>
<p>2.4 &#201;tape 3 : regroupement de familles &#224; partir des signatures
</p>
<p>La derni&#232;re &#233;tape de la classification consiste &#224; utiliser la liste de signatures S donn&#233;e
en entr&#233;e et &#224; d&#233;couvrir de nouvelles signatures &#224; partir des regroupements op&#233;r&#233;s lors
des &#233;tapes pr&#233;c&#233;dentes. Ces signatures vont permettre &#224; leur tour d&#8217;effectuer de nouveaux
regroupements, selon le principe du bootstrapping. Le processus se termine lorsqu&#8217;il n&#8217;est
plus possible de d&#233;couvrir de nouvelles signatures.
</p>
<p>2.4.1 D&#233;couverte de nouvelles signatures
</p>
<p>La d&#233;couverte de nouvelles signatures se fait &#224; partir des familles d&#233;j&#224; constitu&#233;es au cours
des &#233;tapes pr&#233;c&#233;dentes. Les mots non pr&#233;fix&#233;s de chaque famille sont compar&#233;s deux &#224;
deux afin d&#8217;obtenir une liste de signatures, selon la m&#233;thode suivante :
</p>
<p>370</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage non supervis&#233; de familles morphologiques
</p>
<p>Soient m1 et m2 deux mots non pr&#233;fix&#233;s appartenant &#224; la famille F
tels que m1 = &#945;+ s1 et m2 = &#945;+ s2
avec |&#945;| &#8805; 4 et s1 et s2 des cha&#238;nes de caract&#232;res diff&#233;rant au moins par leur
premier caract&#232;re.
Nous appellerons signature la paire de suffixes (s1,s2) et sig(F, F ) l&#8217;ensemble des
signatures form&#233;es &#224; partir d&#8217;une famille F , c&#8217;est-&#224;-dire par comparaison b&#307;ective
des mots non pr&#233;fix&#233;s de F . Toutes ces signatures sont ajout&#233;es &#224; la liste des
signatures S.
</p>
<p>Prenons l&#8217;exemple de la famille suivante, form&#233;e lors des &#233;tapes 1 et 2 :
</p>
<p>[trachyand&#233;site, and&#233;site, trachy-and&#233;site, and&#233;sites, trachy-and&#233;sites, trachyand&#233;sites,
and&#233;sitique, trachy-and&#233;sitique, trachyand&#233;sitique, trachy-and&#233;sitiques, trachyand&#233;si-
tiques, and&#233;sitiques].
</p>
<p>La comparaison des graphies des mots non pr&#233;fix&#233;s de cette famille conduit &#224; l&#8217;identifi-
cation des paires de suffixes suivantes : (&quot;, s), (e, ique), (e, iques), (es, ique) et (es, iques)
(voir Figure 1).
</p>
<p>Fig. 1: Identification de signatures
</p>
<p>2.4.2 Fusion de familles &#224; l&#8217;aide des signatures
</p>
<p>Les signatures ainsi acquises sont utilis&#233;es pour fusionner des familles. Le crit&#232;re d&#8217;agglo-
m&#233;ration repose sur un indice p qui mesure la proportion de signatures valides partag&#233;es
entre deux familles que l&#8217;on cherche &#224; fusionner :
</p>
<p>Soient :
&#8211; F1 et F2 deux familles ;
&#8211; l1 le nombre de mots non pr&#233;fix&#233;s de F1 ;
&#8211; l2 le nombre de mots non pr&#233;fix&#233;s de F2 ;
&#8211; S la liste de signatures fournies en entr&#233;e et d&#233;couvertes &#224; partir des familles
</p>
<p>d&#233;j&#224; constitu&#233;es.
</p>
<p>p =
|sig(F1, F2) &#8745; S|
</p>
<p>l1 &#183; l2
</p>
<p>Dans les exp&#233;riences relat&#233;es dans la suite de cet article, nous avons fusionn&#233; deux familles
lorsque p &#8805; 0.5.
</p>
<p>371</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>Prenons l&#8217;exemple des familles repr&#233;sent&#233;es sur la Figure 2. Les signatures connues sont
repr&#233;sent&#233;es par un arc plein tandis que les signatures inconnues sont repr&#233;sent&#233;es en poin-
till&#233;s. Ces deux familles sont fusionn&#233;es car le rapport du nombre de signatures connues
sur le nombre total de signatures possibles est &#233;gal &#224; 0.5.
</p>
<p>Fig. 2: Fusion de familles
</p>
<p>Le dendrogramme de la Figure 3 illustre l&#8217;int&#233;r&#234;t des regroupements effectu&#233;s aux diverses
&#233;tapes de la m&#233;thode. La seule famille form&#233;e &#224; l&#8217;issue des deux premi&#232;res &#233;tapes est
[satellites, microsatellites, microsatellite, sous-satellite, satellite, mini-satellite]. L&#8217;&#233;tape
de fusion de familles &#224; partir des signatures partag&#233;es permet le regroupement de mots
comme [satellitaire, satellitaires] ou [satellisation, satellisait].
</p>
<p>satellites
microsatellites
</p>
<p>microsatellite
</p>
<p>satellite
sous-satellite
</p>
<p>mini-satellite
satellitaire
satellitaires
satellitales
satellitiques
satellisation
satellisait
</p>
<p>&#201;tape 1 &#201;tape 2 &#201;tape 3
</p>
<p>Fig. 3: Familles obtenues par classification &#224; l&#8217;issue des trois &#233;tapes.
</p>
<p>L&#8217;&#233;tape 3 d&#8217;agglom&#233;ration &#224; partir des signatures partag&#233;es est r&#233;p&#233;t&#233;e tant que de nou-
velles signatures sont acquises &#224; partir des regroupements effectu&#233;s et tant que ces signa-
tures permettent de regrouper des familles. Le nombre de signatures diff&#233;rentes augmente
fortement au cours des premi&#232;res it&#233;rations, puis se stabilise. Le processus d&#8217;acquisition
de nouvelles signatures, et par cons&#233;quent d&#8217;apprentissage de familles, s&#8217;ach&#232;ve au bout
de 10 &#224; 15 it&#233;rations.
</p>
<p>372</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage non supervis&#233; de familles morphologiques
</p>
<p>3 &#201;valuation
</p>
<p>Afin d&#8217;&#233;valuer les r&#233;sultats de la m&#233;thode, nous avons utilis&#233; 4 corpus diff&#233;rents, en anglais
et en fran&#231;ais, couvrant deux domaines sp&#233;cialis&#233;s distincts, la volcanologie et le cancer
du sein. Dans la suite de cet article, ils seront d&#233;sign&#233;s respectivement par volcano-en,
volcano-fr, cancer-en et cancer-fr. Ces corpus ont &#233;t&#233; construits automatiquement &#224;
partir du Web en utilisant la m&#233;thode d&#233;crite dans (Baroni &amp; Bernardini, 2004). Les listes
de mots extraites de ces corpus comprennent entre 47 000 et 86 000 formes diff&#233;rentes.
</p>
<p>3.1 M&#233;thode d&#8217;&#233;valuation
</p>
<p>L&#8217;&#233;valuation des r&#233;sultats n&#233;cessite de disposer de familles morphologiques de r&#233;f&#233;rence
auxquelles sont compar&#233;es les familles obtenues automatiquement par classification. Nous
avons utilis&#233; deux sources pour les familles de r&#233;f&#233;rence : nous avons d&#8217;une part &#233;labor&#233;
manuellement des listes de r&#233;f&#233;rence et, pour l&#8217;anglais, nous avons extrait des familles de
r&#233;f&#233;rence &#224; partir des segmentations contenues dans la base CELEX (Baayen et al., 1995).
Les listes de r&#233;f&#233;rence construites manuellement contiennent des familles de mots pour le
domaine du cancer du sein en fran&#231;ais et en anglais. Elles contiennent 3 250 familles en
anglais et 1 964 familles en fran&#231;ais. Les familles morphologiques maximales de CELEX
sont d&#233;termin&#233;es &#224; partir des relations morphologiques de d&#233;rivation, de composition et
de conversion, ce qui permet d&#8217;obtenir 14 880 familles de r&#233;f&#233;rence.
</p>
<p>Nous avons &#233;valu&#233; les familles induites par rapport aux familles de r&#233;f&#233;rence en utilisant les
mesures propos&#233;es par (Schone &amp; Jurafsky, 2000; Schone &amp; Jurafsky, 2001). La m&#233;thode
d&#8217;&#233;valuation consiste &#224; faire la somme des proportions de mots corrects (C), ins&#233;r&#233;s (I) et
supprim&#233;s (D) dans les familles morphologiques de tous les mots w de la liste d&#8217;&#233;valuation.
Si Xw est l&#8217;ensemble des mots appartenant &#224; la famille morphologique d&#8217;un mot w selon
le syst&#232;me &#224; &#233;valuer et Yw est l&#8217;ensemble des mots appartenant &#224; la famille morphologique
de w selon CELEX ou toute autre base de r&#233;f&#233;rence, alors :
</p>
<p>C =
&#8721;
&#8704;w
</p>
<p>|Xw &#8745; Yw|
|Yw| ; D =
</p>
<p>&#8721;
&#8704;w
</p>
<p>|Yw &#8722; (Xw &#8745; Yw)|
|Yw| et I =
</p>
<p>&#8721;
&#8704;w
</p>
<p>|Xw &#8722; (Xw &#8745; Yw)|
|Yw|
</p>
<p>&#192; partir de ces valeurs, il est &#233;galement possible de calculer la pr&#233;cision, le rappel (et par
cons&#233;quent la F-mesure) du syst&#232;me. La pr&#233;cision est &#233;gale &#224; C/(C + I) et le rappel &#224;
C/(C +D).
</p>
<p>3.2 R&#233;sultats obtenus
</p>
<p>Les r&#233;sultats sont d&#233;taill&#233;s dans la Table 12. Ils d&#233;montrent la grande pr&#233;cision du syst&#232;me,
qui est d&#8217;environ 80-90% suivant le corpus. De plus, malgr&#233; les contraintes impos&#233;es sur
la longueur minimale des pr&#233;fixes et des bases, le rappel est assez &#233;lev&#233; et se situe autour
</p>
<p>2Ces r&#233;sultats ont &#233;t&#233; obtenus pour une valeur du param&#232;tre N du module d&#8217;apprentissage des affixes
&#233;gale &#224; 10. N est un param&#232;tre permettant de contr&#244;ler le processus d&#8217;apprentissage des affixes. Plus N
est grand, plus le nombre de pr&#233;fixes, de suffixes et, par cons&#233;quent, de signatures, est important.
</p>
<p>373</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>de la barre des 70%. Ce r&#233;sultat est d&#8217;autant plus remarquable que la m&#233;thode ne traite
pas le cas des mots compos&#233;s. La F-mesure varie peu sur l&#8217;ensemble des corpus, ce qui
montre que les principes de regroupement utilis&#233;s sont valables aussi bien pour l&#8217;anglais
que pour le fran&#231;ais, et pour des domaines diff&#233;rents.
</p>
<p>R&#233;f&#233;rence CELEX Listes construites manuellement
Corpus cancer-en volcano-en cancer-en volcano-en cancer-fr volcano-fr
Pr&#233;cision 79.3 81.4 89.8 91.2 91.5 93.1
Rappel 72.9 73.2 71.4 75.0 69.3 73.3
F-mesure 75.9 77.1 79.5 82.3 78.9 82.0
</p>
<p>Tab. 1: R&#233;sultats obtenus pour les diff&#233;rents corpus et familles de r&#233;f&#233;rence.
</p>
<p>3.3 Analyse des r&#233;sultats
</p>
<p>L&#8217;examen plus appronfondi des r&#233;sultats montre que diff&#233;rents types de variantes sont
group&#233;s par l&#8217;algorithme :
&#8211; variantes orthographiques comme tumor (variante am&#233;ricaine) et tumour (variante bri-
tannique).
</p>
<p>&#8211; variantes flexionnelles comme traitement et traitements.
&#8211; variantes d&#233;rivationnelles suffix&#233;es comme traiter et traitement et pr&#233;fix&#233;es comme auto-
</p>
<p>examen et examen.
&#8211; compos&#233;s savants comme hormonoth&#233;rapie et immunoth&#233;rapie. Il faut toutefois noter
que dans ce cas, les cha&#238;nes hormono et immuno sont consid&#233;r&#233;es comme des pr&#233;fixes,
car la m&#233;thode ne traite pas explicitement de la composition.
</p>
<p>Malgr&#233; sa bonne pr&#233;cision, le syst&#232;me commet deux types d&#8217;erreur : sur-regroupement,
c&#8217;est-&#224;-dire le groupement de mots qui n&#8217;appartiennent pas tous &#224; la m&#234;me famille mor-
phologique et sous-regroupement, c&#8217;est-&#224;-dire l&#8217;absence de regroupement pour des mots
appartenant &#224; la m&#234;me famille. La premi&#232;re erreur a pour cons&#233;quence de faire baisser la
pr&#233;cision du syst&#232;me, tandis que la seconde conduit &#224; une baisse du rappel. Ces erreurs
peuvent survenir &#224; toutes les &#233;tapes de la classification :
</p>
<p>&#8211; &#192; l&#8217;&#233;tape 1, malgr&#233; les contraintes impos&#233;es sur la longueur des pr&#233;fixes et des mots, des
mots peuvent &#234;tre injustement consid&#233;r&#233;s comme &#233;tant form&#233;s par combinaison d&#8217;un
pr&#233;fixe et d&#8217;un autre mot. Ainsi, le mot anglais missing est analys&#233; comme &#233;tant la
forme pr&#233;fix&#233;e par mis du mot sing.
</p>
<p>&#8211; &#192; l&#8217;&#233;tape 2, il arrive que des familles soient fusionn&#233;es alors m&#234;me qu&#8217;elles sont mor-
phologiquement disjointes. Par exemple, la famille [m&#233;diane, param&#233;diane] est fusionn&#233;e
avec la famille [socio-m&#233;dical, param&#233;dical, m&#233;dical] car les mots m&#233;diane et m&#233;dical
commencent par la m&#234;me cha&#238;ne de caract&#232;res de longueur 4 et apparaissent tous deux
sous forme pr&#233;fix&#233;e avec para.
</p>
<p>&#8211; &#192; l&#8217;&#233;tape 3 enfin, les contraintes impos&#233;es sur la longueur minimale de la base, &#233;gale &#224;
4, peuvent emp&#234;cher le regroupement de certaines familles comme [&#238;le] et [&#238;les], et donc
induire une baisse du rappel.
</p>
<p>374</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage non supervis&#233; de familles morphologiques
</p>
<p>4 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; une m&#233;thode non supervis&#233;e d&#8217;acquisition de familles morphologiques.
Malgr&#233; la simplicit&#233; de la m&#233;thode, les r&#233;sultats obtenus sont tr&#232;s bons, notamment en
terme de pr&#233;cision. L&#8217;analyse des r&#233;sultats montre que les liens morphologiques d&#233;cou-
verts sont vari&#233;s : flexion, d&#233;rivation et composition. De plus, l&#8217;apprentissage est effectu&#233;
uniquement &#224; partir d&#8217;une liste de mots et n&#8217;utilise aucune ressource externe. L&#8217;approche
peut donc &#234;tre directement appliqu&#233;e &#224; des langues et des domaines diff&#233;rents, &#224; condition
que les mots soient form&#233;s par concat&#233;nation lin&#233;aire de morph&#232;mes.
</p>
<p>Des &#233;valuations compl&#233;mentaires sont toutefois n&#233;cessaires. Nous n&#8217;avons pour l&#8217;heure
test&#233; le syst&#232;me que pour du vocabulaire issu de corpus de sp&#233;cialit&#233; en fran&#231;ais et en
anglais. Il serait int&#233;ressant d&#8217;&#233;valuer les performances pour d&#8217;autres langues plus com-
plexes et pour du vocabulaire non technique. L&#8217;utilisation des pr&#233;fixes aux deux premi&#232;res
&#233;tapes de la classification suppose que la langue trait&#233;e utilise ce proc&#233;d&#233; de formation. Or
ce proc&#233;d&#233; n&#8217;est pas pr&#233;sent dans toutes les langues : le turc par exemple n&#8217;emploie que
tr&#232;s peu de pr&#233;fixes, ce qui rend les deux premi&#232;res &#233;tapes du traitement inutiles. Reste
alors &#224; d&#233;terminer si le syst&#232;me est capable de produire des regroupements pertinents en
utilisant uniquement les suffixes. On peut se poser une question similaire pour le voca-
bulaire moins technique, o&#249; le proc&#233;d&#233; de pr&#233;fixation est utilis&#233; moins fr&#233;quemment. Des
exp&#233;rimentations compl&#233;mentaires pourront nous permettre de r&#233;pondre &#224; ces questions.
</p>
<p>Les perspectives d&#8217;am&#233;liorations du syst&#232;me sont diverses. En effet, le syst&#232;me proc&#232;de
&#224; une classification hi&#233;rarchique ascendante stricte, sans parent&#233; multiple et donc sans
possibilit&#233; pour un mot d&#8217;appartenir &#224; deux voire &#224; plusieurs familles diff&#233;rentes. Ceci est
souhaitable pour les mots compos&#233;s, qui font partie de plusieurs familles morphologiques.
Il faudrait donc recourir &#224; une forme de classification &#171; floue &#187;. Le syst&#232;me ne permet
pas non plus la d&#233;couverte de nouveaux pr&#233;fixes, en compl&#233;ment de ceux inject&#233;s dans
le syst&#232;me lors de la phase d&#8217;initialisation. On pourrait envisager d&#8217;appliquer une phase
de bootstrapping similaire &#224; celle qui permet la d&#233;couverte de nouvelles signatures. De
plus, il serait pertinent d&#8217;utiliser la fr&#233;quence des signatures au cours de la classification,
afin de proc&#233;der aux regroupements correspondant aux signatures les plus fr&#233;quentes. Les
informations contextuelles, disponibles dans les corpus, pourraient &#233;galement permettre
d&#8217;am&#233;liorer encore les r&#233;sultats, notamment en terme de pr&#233;cision en validant le fusion-
nement de deux familles en fonction de la similarit&#233; de leurs contextes d&#8217;occurrence.
</p>
<p>Les perspectives applicatives directement envisageables concernent la recherche d&#8217;informa-
tion et la classification de documents. En recherche d&#8217;information, les familles morpholo-
giques peuvent &#234;tre utilis&#233;es pour l&#8217;extension de requ&#234;tes (Moreau &amp; Claveau, 2006). Pour
la cat&#233;gorisation de documents, les familles peuvent servir de descripteurs des documents
&#224; classer (Witschel &amp; Biemann, 2006).
</p>
<p>R&#233;f&#233;rences
</p>
<p>Baayen R. H., Piepenbrock R. &amp; Gulikers L. (1995). The Celex Lexical Database
(Release 2) [CD-ROM]. Philadelphia, PA : Linguistic Data Consortium.
Baroni M. &amp; Bernardini S. (2004). BootCaT : Bootstrapping Corpora and Terms
from the Web. InM. T. Lino, M. F. Xavier, F. Ferreira, R. Costa &amp; R. Silva,
</p>
<p>375</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>Eds., Proceedings of the Fourth International Conference on Language Resources and
Evaluation (LREC), p. 1313&#8211;1316, Lisbon, Portugal.
Bernhard D. (2006). Unsupervised Morphological Segmentation Based on Segment
Predictability and Word Segments Alignment. In M. Kurimo, M. Creutz &amp; K.
Lagus, Eds., Proceedings of the Pascal Challenges Workshop on the Unsupervised Seg-
mentation of Words into Morphemes, p. 19&#8211;23, Venice, Italy.
Buitelaar P. &amp; Sacaleanu B. (2002). Extending Synsets with Medical Terms. In
Proceedings of the First International WordNet Conference, Mysore, India.
Creutz M. &amp; Lagus K. (2002). Unsupervised Discovery of Morphemes. In Proceedings
of the Workshop on Morphological and Phonological Learning of ACL-02, p. 21&#8211;30.
Creutz M. &amp; Lagus K. (2005). Inducing the Morphological Lexicon of a Natural
Language from Unannotated Text. In Proceedings of the International and Interdisci-
plinary Conference on Adaptive Knowledge Representation and Reasoning (AKRR&#8217;05),
Espoo, Finland.
Gaussier E. (1999). Unsupervised learning of derivational morphology from inflectional
lexicons. In Proceedings of the Workshop on Unsupervised Methods in Natural Language
Processing : University of Maryland.
Goldsmith J. (2001). Unsupervised Learning of the Morphology of a Natural Language.
Computational Linguistics, 27(2), 153&#8211;198.
Grabar N. &amp; Zweigenbaum P. (1999). Acquisition automatique de connaissances
morphologiques sur le vocabulaire m&#233;dical. In P. Amsili, Ed., Actes de TALN 1999, p.
175&#8211;184, Carg&#232;se.
Hathout N. (2005). Exploiter la structure analogique du lexique construit : une ap-
proche computationnelle. Cahiers de Lexicologie, 87(2).
Lepage Y. (1998). Solving analogies on words : an algorithm. In Proceedings of the
17th international conference on Computational Linguistics, volume 1, p. 728&#8211;734, Mor-
ristown, NJ, USA : Association for Computational Linguistics.
Moreau F. &amp; Claveau V. (2006). Extension de requ&#234;tes par relations morpholo-
giques acquises automatiquement. In Actes de la Troisi&#232;me Conf&#233;rence en Recherche
d&#8217;Informations et Applications CORIA 2006, p. 181&#8211;192.
Schone P. &amp; Jurafsky D. (2000). Knowledge-Free Induction of Morphology Using
Latent Semantic Analysis. In Proceedings of the Fourth Conference on Computational
Natural Language Learning and of the Second Learning Language in Logic Workshop,
Lisbon, Portugal.
Schone P. &amp; Jurafsky D. (2001). Knowledge-Free Induction of Inflectional Mor-
phologies. In Proceedings of the Second meeting of the North American Chapter of the
Association for Computational Linguistics, p. 1&#8211;9.
Schwab D., Lafourcade M. &amp; Prince V. (2005). Extraction semi-supervis&#233;e de
couples d&#8217;antonymes gr&#226;ce &#224; leur morphologie. In Actes de TALN 2005, p. 73&#8211;82.
Witschel H. F. &amp; Biemann C. (2006). Rigorous dimensionality reduction through
linguistically motivated feature selection for text categorization. In S. Werner, Ed.,
Proceedings of the 15th NODALIDA conference, Joensuu 2005, volume 1, p. 197&#8211;204,
Joensuu, Finland.
Zweigenbaum P. &amp; Grabar N. (2000). Liens morphologiques et structuration de
terminologie. In Actes de IC 2000 : Ing&#233;nierie des Connaissances, p. 325&#8211;334.
</p>
<p>376</p>

</div></div>
</body></html>