<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse morphos&#233;mantique des compos&#233;s savants : transposition du fran&#231;ais &#224; l&#8217;anglais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Analyse morphos&#233;mantique des compos&#233;s savants :
transposition du fran&#231;ais &#224; l&#8217;anglais
</p>
<p>Louise DEL&#201;GER1, Fiammetta NAMER2, Pierre ZWEIGENBAUM3, 4
1 INSERM, UMR_S 872, &#201;q. 20, Les Cordeliers, 75006 Paris
</p>
<p>Universit&#233; Pierre et Marie Curie-Paris6, UMR_S 872, 75006 Paris
Universit&#233; Paris Descartes, UMR_S 872, 75006 Paris
2 ATILF et Universit&#233; Nancy 2, CLSH, 54015 Nancy
</p>
<p>3 CNRS, UPR3251, LIMSI, 91403 Orsay
4 INALCO, CRIM, 75343 Paris Cedex 07
</p>
<p>louise.deleger@spim.jussieu.fr,
fiammetta.namer@univ-nancy2.fr, pz@limsi.fr
</p>
<p>R&#233;sum&#233;. La plupart des vocabulaires sp&#233;cialis&#233;s comprennent une part importante de
lex&#232;mes morphologiquement complexes, construits &#224; partir de racines grecques et latines, qu&#8217;on
appelle &#171; compos&#233;s savants &#187;. Une analyse morphos&#233;mantique permet de d&#233;composer et de don-
ner des d&#233;finitions &#224; ces lex&#232;mes, et semble pouvoir &#234;tre appliqu&#233;e de fa&#231;on similaire aux com-
pos&#233;s de plusieurs langues. Cet article pr&#233;sente l&#8217;adaptation d&#8217;un analyseur morphos&#233;mantique,
initialement d&#233;di&#233; au fran&#231;ais (D&#233;riF), &#224; l&#8217;analyse de compos&#233;s savants m&#233;dicaux anglais, illus-
trant ainsi la similarit&#233; de structure de ces compos&#233;s dans des langues europ&#233;ennes proches.
Nous exposons les principes de cette transposition et ses performances. L&#8217;analyseur a &#233;t&#233; test&#233;
sur un ensemble de 1299 lex&#232;mes extraits de la terminologie m&#233;dicale WHO-ART : 859 ont pu
&#234;tre d&#233;compos&#233;s et d&#233;finis, dont 675 avec succ&#232;s. Outre une simple transposition d&#8217;une langue
&#224; l&#8217;autre, la m&#233;thode montre la potentialit&#233; d&#8217;un syst&#232;me multilingue.
Abstract. Medical language, as many technical languages, is rich with morphologically
complex words, many of which take their roots in Greek and Latin &#8211; in which case they are
called neoclassical compounds. Morphosemantic analysis can help generate decompositions
and definitions of such words, and is likely to be similarly applicable to compounds from dif-
ferent languages. This paper reports work on the adaptation of a morphosemantic analyzer
dedicated to French (D&#233;riF) to analyze English medical neoclassical compounds, and shows the
similarity in structure of compounds from related European languages. It presents the princi-
ples of this transposition and its current performance. The analyzer was tested on a set of 1,299
compounds extracted from theWHO-ART terminology: 859 could be decomposed and defined,
675 of which successfully. Aside from simple transposition from one language to another, the
method also emphasizes the potentiality for a multilingual system.
Mots-cl&#233;s : analyse morphos&#233;mantique, composition savante, terminologie m&#233;dicale.
Keywords: morphosemantic analysis, neo-classical compounding, medical terminology.
</p>
<p>79</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Louise DEL&#201;GER, Fiammetta NAMER, Pierre ZWEIGENBAUM
</p>
<p>1 Introduction
</p>
<p>La plupart des vocabulaires sp&#233;cialis&#233;s, et en particulier le vocabulaire m&#233;dical, comprennent
une part importante de lex&#232;mes morphologiquement complexes, construits &#224; partir de racines
grecques et latines, qu&#8217;on appelle &#171; compos&#233;s savants &#187;. Segmenter ces compos&#233;s en lex&#232;mes
de base est la t&#226;che de l&#8217;analyse morphologique. Lorsque celle-ci inclut &#224; la fois une partie
formelle et une partie s&#233;mantique, on parle d&#8217;analyse morphos&#233;mantique. Ce type d&#8217;analyse est
particuli&#232;rement adapt&#233; aux compos&#233;s savants, o&#249; le sens est souvent &#171; compositionnel &#187;, c&#8217;est-
&#224;-dire qu&#8217;il est la combinaison au moins partielle du sens des composants du lex&#232;me complexe.
L&#8217;analyse morphos&#233;mantique est donc utile pour les m&#233;thodes int&#233;ress&#233;es par la s&#233;mantique,
comme la g&#233;n&#233;ration de d&#233;finitions ou la d&#233;tection de termes similaires.
Il a de plus &#233;t&#233; observ&#233; que la structure morphologique des lex&#232;mes compos&#233;s savants est simi-
laire dans de nombreuses langues europ&#233;ennes (Iacobini, 2003). Il semble donc possible d&#8217;ap-
pliquer une analyse linguistique d&#233;di&#233;e aux compos&#233;s savants d&#8217;une langue &#224; d&#8217;autres langues
proches. (Namer, 2005a) l&#8217;a montr&#233; pour un certain type de compos&#233;s m&#233;dicaux en proposant
une analyse des noms de pathologies (comme HYPERCALCIURIE) pouvant &#234;tre appliqu&#233;e au
fran&#231;ais, &#224; l&#8217;allemand, &#224; l&#8217;espagnol, &#224; l&#8217;italien et &#224; l&#8217;anglais. L&#8217;analyse morphos&#233;mantique de
tels compos&#233;s montre ainsi un potentiel multilingue.
Dans le domaine m&#233;dical, plusieurs travaux se sont int&#233;ress&#233;s &#224; l&#8217;analyse de ces lex&#232;mes com-
plexes. Les premiers se concentrent sur un type particulier de r&#232;gles de formation des lex&#232;mes,
comme les r&#232;gles de suffixation en -ITIS (Pacak et al., 1980) ou -OSIS (Dujols et al., 1991), puis
&#233;largissent leur champs d&#8217;analyse (Wolff, 1984). (Lovis et al., 1995) d&#233;composent les termes
m&#233;dicaux en introduisant la notion de morphos&#233;mant&#232;mes, unit&#233;s ne pouvant &#234;tre d&#233;compo-
s&#233;es sans perdre leur sens original. On trouve une notion similaire dans le syst&#232;me Morpho-
saurus (Schulz et al., 1999; Mark&#243; et al., 2005). Cet outil, qui ne se limite pas aux compos&#233;s
savants, est l&#8217;un des rares fonctionnant en multilingue ; il ne va cependant pas jusqu&#8217;&#224; l&#8217;inter-
pr&#233;tation s&#233;mantique. (Iavindrasana et al., 2006) utilisent un outil statistique de segmentation
morphologique (Creutz et al., 2005) pour mettre en correspondance les termes similaires d&#8217;une
terminologie m&#233;dicale (WHO-ART). L&#8217;outil D&#233;riF (Namer &amp; Zweigenbaum, 2004) effectue
une analyse morphos&#233;mantique des lex&#232;mes d&#233;riv&#233;s ou compos&#233;s fran&#231;ais et produit une d&#233;-
composition hi&#233;rarchique (par opposition &#224; (Mark&#243; et al., 2005) ou (Lovis et al., 1995) o&#249; la
segmentation reste lin&#233;aire) ainsi qu&#8217;une d&#233;finition s&#233;mantique des lex&#232;mes et un ensemble de
lex&#232;mes s&#233;mantiquement apparent&#233;s (relations d&#8217;hyponymie ou d&#8217;&#233;quivalence, par exemple).
Son potentiel pour une application multilingue a &#233;t&#233; soulign&#233; dans (Namer, 2005b).
Cet article pr&#233;sente nos travaux concernant l&#8217;adaptation de D&#233;riF aux compos&#233;s savants m&#233;di-
caux anglais1. Notre but est de transposer l&#8217;analyse par D&#233;riF des compos&#233;s fran&#231;ais &#224; l&#8217;anglais,
afin d&#8217;illustrer la similarit&#233; des m&#233;canismes des compos&#233;s savants dans des langues europ&#233;ennes
proches et d&#8217;obtenir un outil qui fait d&#233;faut sur l&#8217;anglais, que nous baptisons D&#233;riA. Ce travail
peut en outre &#234;tre vu comme une premi&#232;re &#233;tape vers un syst&#232;me multilingue.
Nous posons dans un premier temps les &#233;l&#233;ments th&#233;oriques sous-jacents &#224; ce travail, puis d&#233;cri-
vons l&#8217;analyseur morphos&#233;mantique et notre liste de lex&#232;mes test. Nous expliquons ensuite les
modifications effectu&#233;es sur le syst&#232;me et son mode d&#8217;&#233;valuation. Nous exposons nos r&#233;sultats
et discutons la m&#233;thode, puis concluons avec quelques perspectives.
</p>
<p>1Cet article actualise une pr&#233;c&#233;dente version de nos travaux soumise &#224; la conf&#233;rence MEDINFO 2007.
80</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse morphos&#233;mantique des compos&#233;s savants m&#233;dicaux
</p>
<p>2 El&#233;ments th&#233;oriques
La base de ce travail est l&#8217;analyse morphos&#233;mantique, c&#8217;est-&#224;-dire une analyse morphologique
associ&#233;e &#224; une interpr&#233;tation s&#233;mantique. Nous cherchons &#224; lier le lex&#232;me d&#8217;entr&#233;e &#224; sa base (en
cas de d&#233;rivation) ou &#224; ses composants (en cas de composition). La d&#233;composition est associ&#233;e
&#224; une description du sens du lex&#232;me complexe bas&#233;e sur le sens de ses composants. Un lex&#232;me
complexe est form&#233; &#224; partir de n&#8217;importe quelle combinaison des deux r&#232;gles suivantes :
&#8211; la d&#233;rivation qui se manifeste formellement par l&#8217;ajout d&#8217;un affixe (pr&#233;fixe ou suffixe) &#224; une
</p>
<p>base ; par exemple : BOSSENOM / BOSSUADJ ; GRIPPENOM / ANTIGRIPPEADJ
&#8211; la composition consiste &#224; former un lex&#232;me en combinant deux composants, qui peuvent &#234;tre
</p>
<p>chacun soit des lex&#232;mes de la langue moderne, soit des racines grecques et latines appel&#233;es
&#233;l&#233;ments de formation (EF) ; par exemple THERMOR&#201;GULATION, ARTHRALGIE.
</p>
<p>Nous avons choisi ici de traiter les compos&#233;s savants anglais (form&#233;s &#224; partir d&#8217;EF). Cependant,
comme nous l&#8217;avons expliqu&#233;, un lex&#232;me complexe peut avoir &#233;t&#233; form&#233; &#224; la fois par composi-
tion et par d&#233;rivation. Un compos&#233; peut donc &#234;tre la base d&#8217;une r&#232;gle de d&#233;rivation ; de m&#234;me,
un lex&#232;me d&#233;riv&#233; peut &#234;tre l&#8217;un des composants d&#8217;une r&#232;gle de composition. C&#8217;est pourquoi
nous devons prendre en compte les lex&#232;mes compos&#233;s et d&#233;riv&#233;s (comme HAEMORRHAGIC).
Notre hypoth&#232;se de travail pour la transposition de l&#8217;analyse du fran&#231;ais vers l&#8217;anglais est que
l&#8217;on peut appliquer une m&#234;me analyse linguistique aux compos&#233;s savants de plusieurs langues.
En effet, nous supposons que ces compos&#233;s sont form&#233;s de la m&#234;me fa&#231;on et que les composants
mis en jeu sont similaires, les principales diff&#233;rences &#233;tant orthographiques (par exemple, ALGIE
en fran&#231;ais et ALGIA en anglais). Les difficult&#233;s &#233;ventuelles se situeraient :
&#8211; au niveau de l&#8217;ordre combinatoire des composants : l&#8217;analyse ne fonctionnera pas si l&#8217;ordre
</p>
<p>n&#8217;est pas le m&#234;me dans les deux langues. Ce cas devrait &#234;tre peu fr&#233;quent, car il s&#8217;agit ici de
composition classique qui reprend l&#8217;ordre latin ou grec ;
</p>
<p>&#8211; au niveau des composants eux-m&#234;mes : la correspondance des analyses ne peut se faire que
si les lex&#232;mes anglais et fran&#231;ais sont bien dans les deux cas form&#233;s &#224; partir d&#8217;EF. C&#8217;est notre
hypoth&#232;se et l&#8217;analyse pourra se faire car ces EF sont list&#233;s et en nombre limit&#233;.
</p>
<p>&#8211; au niveau de la jointure des composants : la modification du premier composant lors de sa
combinaison avec le deuxi&#232;me (allomorphie), par exemple le rajout de l&#8217;&#233;l&#233;ment de jointure
-o-. Si ces ph&#233;nom&#232;nes sont tr&#232;s diff&#233;rents, il peut y avoir des probl&#232;mes dans l&#8217;analyse. Nous
supposons qu&#8217;ils sont similaires, mis &#224; part quelques modifications orthographiques ;
</p>
<p>&#8211; au niveau des processus morphologiques de suffixation et pr&#233;fixation appliqu&#233;s aux compos&#233;s
savants. En effet, les affixes ne sont pas les m&#234;mes dans les deux langues. Cependant, nous
supposons que, dans le cas des compos&#233;s savants, il est suffisant de remplacer les affixes
fran&#231;ais par des affixes anglais de m&#234;me &#171; classe &#187; (par exemple, les suffixes formateurs
d&#8217;adjectifs relationnels fran&#231;ais peuvent &#234;tre remplac&#233;s par leurs homologues anglais).
</p>
<p>3 Mat&#233;riel de d&#233;part
</p>
<p>3.1 L&#8217;analyseur morphos&#233;mantique D&#233;riF
Nous nous basons sur la version fran&#231;aise de l&#8217;analyseur morphos&#233;mantique D&#233;riF (&#171; D&#233;riva-
tion en Fran&#231;ais &#187;), destin&#233; aussi bien &#224; la langue g&#233;n&#233;rale qu&#8217;&#224; des vocabulaires plus sp&#233;cialis&#233;s
</p>
<p>81</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Louise DEL&#201;GER, Fiammetta NAMER, Pierre ZWEIGENBAUM
</p>
<p>arthralgia/NOM
atelectasis/NOM
blepharospasm/NOM
calcinosis/NOM
capillary/ADJ
</p>
<p>cardiomegaly/NOM
cerebellar/ADJ
claustrophobia/NOM
clostridial/ADJ
cryptococcal/ADJ
</p>
<p>crystalluria/NOM
dermatomyositis/NOM
dextrocardia/NOM
dorsal/ADJ
dysmenorrhea/NOM
</p>
<p>TAB. 1 &#8211; Extrait de la liste de lex&#232;mes construits contenant un &#233;l&#233;ment de formation
</p>
<p>tels que la langue m&#233;dicale. L&#8217;analyse effectu&#233;e est purement linguistique et impl&#233;mente un cer-
tain nombre de r&#232;gles de d&#233;composition ainsi que de sch&#233;mas d&#8217;interpr&#233;tation s&#233;mantique des
lex&#232;mes. Les ressources n&#233;cessaires &#224; l&#8217;outil comprennent des lexiques de lex&#232;mes lemmatis&#233;s
et &#233;tiquet&#233;s morphosyntaxiquement et une table des &#233;l&#233;ments de formation. Lorsque D&#233;riF est
appliqu&#233; &#224; un vocabulaire biom&#233;dical, le syst&#232;me ne se limite pas &#224; une simple d&#233;composition et
interpr&#233;tation s&#233;mantique, mais produit &#233;galement un ensemble de lex&#232;mes lexicalement reli&#233;s.
Le syst&#232;me prend en entr&#233;e une liste de lex&#232;mes &#233;tiquet&#233;s et lemmatis&#233;s et produit en sortie :
</p>
<p>1. une repr&#233;sentation ordonn&#233;e des r&#232;gles d&#8217;analyse qui se sont appliqu&#233;es successivement ;
2. une d&#233;finition (ou glose) du lex&#232;me en langue naturelle ;
3. une cat&#233;gorie conceptuelle, inspir&#233;e des descripteurs principaux du th&#233;saurus MeSH (ana-
</p>
<p>tomie, organisme, maladie, etc.) ;
4. un ensemble de lex&#232;mes qui sont potentiellement li&#233;s lexicalement au lex&#232;me d&#8217;entr&#233;e.
</p>
<p>Les diff&#233;rentes relations identifi&#233;es sont l&#8217;&#233;quivalence (eql), l&#8217;hyponymie (isa) et la rela-
tion de proximit&#233; s&#233;mantique &#171; voir-aussi &#187; (see).
</p>
<p>Un exemple d&#8217;analyse morphos&#233;mantique pour le lex&#232;me ACRODYNIE est donn&#233; ci-dessous (N
signifie nom et N* est associ&#233; &#224; un EF nominal).
ACRODYNIE/N ==&gt; (1) [ [ acr N* ] [ odyn N* ] ie N ]
</p>
<p>(2) douleur (de&#8211;li&#233;(e) &#224;) articulation
(3) maladie
(4) eql : acr/algie, eql : apex/algie, see : acr/ite, see : apex/ite
</p>
<p>3.2 Le corpus de test : la terminologie WHO-ART
Pour tester D&#233;riA, notre transposition de D&#233;riF &#224; l&#8217;anglais, une liste de lex&#232;mes a &#233;t&#233; s&#233;lec-
tionn&#233;e. Ceux-ci ont &#233;t&#233; extraits de la terminologie WHO-ART, qui d&#233;crit les effets secondaires
des m&#233;dicaments, car une des applications vis&#233;es par ce travail est d&#8217;apporter une contribu-
tion au domaine de la pharmacovigilance. Nous avons segment&#233; les termes anglais en lex&#232;mes,
car D&#233;riF traite des lex&#232;mes simples et non des unit&#233;s polylexicales. Parmi ces lex&#232;mes, nous
n&#8217;avons retenu que les compos&#233;s savants (nous cherchons en effet &#224; adapter D&#233;riF pour ce
type de lex&#232;mes). Cette s&#233;lection a &#233;t&#233; effectu&#233;e &#224; la fois automatiquement, en rejetant tous les
lex&#232;mes de 4 caract&#232;res ou moins (ils ne sont quasiment jamais construits), et manuellement
en parcourant la liste pour extraire les compos&#233;s savants. Nous avons ainsi obtenu une liste de
1299 lex&#232;mes sur un total de 3476. Comme expliqu&#233; pr&#233;c&#233;demment, nous avons s&#233;lectionn&#233; &#224;
la fois les compos&#233;s &#171; purs &#187; et les lex&#232;mes d&#233;riv&#233;s contenant un EF. Un extrait de la liste est
donn&#233; dans le tableau 1. Afin d&#8217;avoir une id&#233;e de la proportion des diff&#233;rents types de compo-
s&#233;s, nous avons calcul&#233; leur pourcentage sur un &#233;chantillon de 200 lex&#232;mes. Nous avons 45 %
de compos&#233;s purs et 55 % de lex&#232;mes d&#233;riv&#233;s.
</p>
<p>82</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse morphos&#233;mantique des compos&#233;s savants m&#233;dicaux
</p>
<p>FIG. 1 &#8211; Analyse morphos&#233;mantique
</p>
<p>Les lex&#232;mes ont &#233;t&#233; pr&#233;alablement &#233;tiquet&#233;s morphosyntaxiquement et lemmatis&#233;s avec l&#8217;&#233;ti-
queteur Treetagger2. Un lexique de lex&#232;mes &#233;tiquet&#233;s, extrait du Specialist Lexicon de l&#8217;UMLS3
a &#233;t&#233; utilis&#233; pour aider Treetagger &#224; traiter les lex&#232;mes inconnus.
</p>
<p>4 Transposition de D&#233;riF en anglais
</p>
<p>4.1 Modifications effectu&#233;es
Le m&#233;canisme de l&#8217;analyse morphos&#233;mantique de D&#233;riF est sch&#233;matis&#233; sur la figure 1. Nous
avons identifi&#233; plusieurs niveaux o&#249; l&#8217;analyse fait appel &#224; des &#233;l&#233;ments sp&#233;cifiques &#224; la langue :
</p>
<p>1. Le lexique de lex&#232;mes &#233;tiquet&#233;s qui est utilis&#233; par le syst&#232;me pour tester l&#8217;existence d&#8217;un
composant et pour obtenir sa cat&#233;gorie grammaticale.
</p>
<p>2. La table des EF, o&#249; chaque &#233;l&#233;ment est associ&#233; &#224; un lex&#232;me en fran&#231;ais moderne d&#233;crivant
son sens, &#224; un type conceptuel, &#224; une cat&#233;gorie grammaticale et &#224; un ensemble d&#8217;&#233;l&#233;ments
li&#233;s par des relations d&#8217;&#233;quivalence, d&#8217;hyponymie ou de proximit&#233; s&#233;mantique.
</p>
<p>3. Les r&#232;gles de d&#233;composition, qui sont d&#233;clench&#233;es dans un certain ordre selon la cat&#233;gorie
grammaticale du lex&#232;me et l&#8217;affixe identifi&#233; (s&#8217;il y en a un). Ces r&#232;gles identifient la t&#234;te
et les autres composants, en se basant sur la table des EF et le lexique. Chaque r&#232;gle inclut
des exceptions et des normalisations orthographiques sur les composants.
</p>
<p>4. Les sch&#233;mas d&#8217;interpr&#233;tation s&#233;mantique, qui produisent des gloses &#224; partir de la relation
entre la t&#234;te du lex&#232;me et ses autres composants.
</p>
<p>Nous avons apport&#233; des modifications pour chacun de ces niveaux :
</p>
<p>1. Nous avons remplac&#233; le lexique par un lexique anglais du Specialist Lexicon de l&#8217;UMLS.
2. Nous partons de l&#8217;hypoth&#232;se que les EF sont les m&#234;mes en fran&#231;ais et en anglais, avec
</p>
<p>seulement de l&#233;g&#232;res diff&#233;rences orthographiques. Nous avons donc effectu&#233; de petites
2http://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger/
</p>
<p>DecisionTreeTagger.html
3http://www.nlm.nih.gov/pubs/factsheets/umlslex.html
</p>
<p>83</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Louise DEL&#201;GER, Fiammetta NAMER, Pierre ZWEIGENBAUM
</p>
<p>EF Anglais Type Relations lexicales
algia pain disease odyn, algo, ~itis
</p>
<p>blephar eyelid anatomy palpebr, &lt;-ocul, ~coro
ectomy surgical excision act ~tomy, ~stomy
gastr stomach anatomy stomac, gaster, ~hepat, ~entero, &lt;-abdomino,
</p>
<p>~pancreat
TAB. 2 &#8211; Table des &#233;l&#233;ments de formation (extrait)
</p>
<p>modifications sur les EF fran&#231;ais (par exemple, retirer les accents, comme pour BL&#201;-
PHARO / BLEPHARO) pour obtenir les &#233;quivalents anglais. Les types conceptuels attri-
bu&#233;s &#224; chaque EF auraient pu &#234;tre conserv&#233;s en fran&#231;ais, mais nous avons d&#233;cid&#233; que les
traduire en anglais serait plus adapt&#233;, ce qui a &#233;t&#233; fait ais&#233;ment car ces types sont peu nom-
breux. Nous avons &#233;galement associ&#233; des lex&#232;mes en anglais moderne &#224; chaque EF, que
nous avons obtenus &#224; partir de deux listes de racines savantes, une extraite du Specialist
Lexicon de l&#8217;UMLS, l&#8217;autre du dictionnaire m&#233;dical Dorland4, les racines &#233;tant appari&#233;es
avec leur &#233;quivalent en anglais moderne dans ces deux listes. Nous avons mis en cor-
respondance automatiquement les EF et valid&#233; les r&#233;sultats. Les EF pour lesquels aucun
&#233;quivalent n&#8217;a pu &#234;tre obtenu ont &#233;t&#233; trait&#233;s manuellement. Enfin, l&#8217;ensemble des EF lexi-
calement li&#233;s ont &#233;t&#233; remplac&#233;s par leurs &#233;quivalents anglais (suivant les modifications
orthographiques effectu&#233;es pour obtenir les EF anglais). Les cat&#233;gories grammaticales
ont &#233;t&#233; conserv&#233;es. Un extrait de cette table est fourni dans le tableau 2. Les relations
lexicales entre les &#233;l&#233;ments sont &#233;tiquet&#233;es comme suit : &lt;- pour une relation d&#8217;hypony-
mie, ~ pour une relation voir-aussi, et aucun signe pour une relation d&#8217;&#233;quivalence.
</p>
<p>3. Nous sommes tr&#232;s peu intervenus au niveau des r&#232;gles de d&#233;composition puisque notre
hypoth&#232;se est que les compos&#233;s savants sont form&#233;s de la m&#234;me mani&#232;re. Nous avons
donc simplement adapt&#233; les exceptions, les normalisations orthographiques et les affixes
(par exemple, le suffixe fran&#231;ais -IQUE est remplac&#233; par le suffixe anglais -IC).
</p>
<p>4. Enfin, nous avons traduit les sch&#233;mas d&#8217;interpr&#233;tation s&#233;mantique afin que ceux-ci g&#233;-
n&#232;rent des gloses anglaises. Par exemple, le sch&#233;ma suivant est associ&#233; au suffixe -IA (-IE
en fran&#231;ais) et au pr&#233;fixe HYPER- avec les composants Y/X comme noms : Affection of
X linked to the excess of Y (o&#249; X et Y sont remplac&#233;s par les &#233;quivalents modernes des
EF ou par des lex&#232;mes simples du lexique, comme par exemple HYPERCALCEMIA dont
l&#8217;analyse produit &#171; Affection of blood linked to the excess of calcium &#187;).
</p>
<p>4.2 &#201;valuation
Nous avons test&#233; D&#233;riA sur les 1299 lex&#232;mes extraits de la terminologie WHO-ART. La sortie
attendue pour chaque lex&#232;me est donc une d&#233;composition hi&#233;rarchique des lex&#232;mes, une d&#233;fini-
tion en langage naturel, un type conceptuel et un ensemble de lex&#232;mes li&#233;s. Nous avons &#233;valu&#233;
la couverture, la pr&#233;cision et le rappel de ces r&#233;sultats. Nous avons d&#233;fini la couverture comme
la proportion de lex&#232;mes que le syst&#232;me analyse, la pr&#233;cision comme le rapport entre le nombre
d&#8217;analyses correctes et le nombre total d&#8217;analyses, et le rappel comme le rapport entre le nombre
d&#8217;analyses correctes et le nombre d&#8217;analyses attendues (i.e. le nombre de lex&#232;mes). Une analyse
</p>
<p>4http://www.merckmedicus.com/pp/us/hcp/thcp_dorlands_content.jsp?pg=
/ppdocs/us/common/dorlands/dorland/dmd-a-b-000.htm
</p>
<p>84</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse morphos&#233;mantique des compos&#233;s savants m&#233;dicaux
</p>
<p>est consid&#233;r&#233;e valide si sa d&#233;composition et sa d&#233;finition sont correctes ; nous n&#8217;avons pas pris
en compte les lex&#232;mes lexicalement li&#233;s ni le type conceptuel dans cette &#233;valuation.
La m&#233;thode de (Iavindrasana et al., 2006) est appliqu&#233;e, comme la n&#244;tre, &#224; la terminologie
WHO-ART, de sorte que nous mis en place une comparaison. Nous avons soumis la m&#234;me liste
de lex&#232;mes &#224; Morfessor (qui est l&#8217;outil utilis&#233; dans ces travaux) dans les m&#234;mes conditions que
(Iavindrasana et al., 2006) et avons &#233;valu&#233; couverture, pr&#233;cision et rappel.
</p>
<p>5 R&#233;sultats
Au stade actuel de D&#233;riA (D&#233;riF en anglais), nous avons pu obtenir 859 analyses sur les 1299
lex&#232;mes de notre liste (voir tableau 3), ce qui donne une couverture de 66 %. Des exemples
d&#8217;analyses sont donn&#233;s dans le tableau 4. On observe que le syst&#232;me a pu analyser aussi bien de
purs compos&#233;s savants ([ [arthr N*] [algia N*] N]) que des lex&#232;mes d&#233;riv&#233;s construits &#224; partir
d&#8217;une base savante ([ a+ [ dactyl N*] +y N]).
Nous avons identifi&#233; plusieurs causes pour lesquelles un lex&#232;me n&#8217;a pas pu &#234;tre d&#233;compos&#233; :
&#8211; Certaines r&#232;gles de suffixation ne sont pas actuellement impl&#233;ment&#233;es dans D&#233;riF et D&#233;riA :
c&#8217;est le cas pour les suffixes -ATION et -ISM, les lex&#232;mes tels que LACRIMATION et HERMA-
PHRODITISM ne sont donc pas d&#233;compos&#233;s ;
</p>
<p>&#8211; Certains &#233;l&#233;ments ne sont pas pr&#233;sents dans la table des EF ni dans le lexique de lex&#232;mes :
par exemple CAMPT- n&#8217;est pas dans la table des EF et le lex&#232;me CAMPTODACTYLY n&#8217;a donc
pas &#233;t&#233; d&#233;compos&#233; ;
</p>
<p>&#8211; Des erreurs sont survenues pendant le pr&#233;-traitement (c&#8217;est-&#224;-dire des lex&#232;mes mals &#233;tique-
t&#233;s) : par exemple, CORPORAL a &#233;t&#233; &#233;tiquet&#233; comme nom au lieu d&#8217;adjectif.
</p>
<p>Nous avons mesur&#233; une pr&#233;cision de 78,5 % (voir tableau 3) ce qui est assez satisfaisant. Etant
donn&#233;e une couverture mod&#233;r&#233;e, cela donne un rappel de 52 %. Les erreurs sont dues &#224; :
&#8211; Une mauvaise structuration de la d&#233;composition. On en voit un exemple dans le tableau 4
avec le lex&#232;me MENINGOENCEPHALITIS, dont la bonne d&#233;composition devrait &#234;tre comme
suit : [ [ [mening N*] [encephal N*] ] [itis N*] N]. L&#8217;&#233;l&#233;ment -ITIS devrait &#234;tre la t&#234;te de la
combinaison des deux EF MENING- et ENCEPHAL-, ce qui donnerait une d&#233;finition telle que
&#171; inflammation related to head and meninges. &#187;
</p>
<p>&#8211; Une d&#233;finition insatisfaisante, ce qui est souvent d&#251; au fait que le sens du lex&#232;me n&#8217;est pas
suffisamment refl&#233;t&#233; par celui de ses parties. Le lex&#232;me ACANTHOSIS (voir tableau 4) en est
une illustration : sa d&#233;composition est correcte mais son sens s&#8217;est opacifi&#233; et ne peut &#234;tre
d&#233;riv&#233; de celui de ses composants. Il devrait &#234;tre de nos jours analys&#233; comme non construit.
</p>
<p>&#8211; Une erreur d&#8217;&#233;tiquetage : les lex&#232;mes mal &#233;tiquet&#233;s n&#8217;ont pas pu &#234;tre correctement analys&#233;s.
C&#8217;est le cas de ALVEOLAR (derni&#232;re ligne du tableau 4) qui a &#233;t&#233; trait&#233; comme un nom d&#233;riv&#233;
d&#8217;un adjectif (ALVEOLAR en tant qu&#8217;adjectif est, lui, correctement analys&#233; par le syst&#232;me).
</p>
<p>Aucun cas de bruit ni de silence ne semble &#234;tre d&#251; &#224; une sp&#233;cificit&#233; des compos&#233;s anglais par
</p>
<p>Nb total de
lex&#232;mes
</p>
<p>Lex&#232;mes d&#233;compos&#233;s
(couverture)
</p>
<p>Nombre d&#8217;analyses
correctes
</p>
<p>Pr&#233;cision Rappel
</p>
<p>1299 859 (66 %) 675 78,5 % 52 %
TAB. 3 &#8211; R&#233;sultats de l&#8217;&#233;valuation de D&#233;riA
</p>
<p>85</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Louise DEL&#201;GER, Fiammetta NAMER, Pierre ZWEIGENBAUM
</p>
<p>Lex&#232;me/Cat D&#233;composition D&#233;finition Type Lex&#232;mes
proches
</p>
<p>arthralgia/N [ [arthr N*] [algia N*] N] pain
(of&#8211;linked to)
joint
</p>
<p>disease eql : arthr/algesia
see : arthr/itis
</p>
<p>adactyly/N [ a+ [ dactyl N*] +y N] Affection
characterized
by the
absence of
digit
</p>
<p>disease
</p>
<p>gastroeso-
phageal/ADJ
</p>
<p>[ [gastr N*] [oesophag N*]
al ADJ]
</p>
<p>Related to
oesophagus
and stomach
</p>
<p>anatomy eql :
stomac/oesophag
isa : abdo-
min/oesophag
</p>
<p>meningoence-
phalitis/ADJ
</p>
<p>[ [mening N*] [ [encephal
N*] [itis N*] N] N]
</p>
<p>(Part of &#8211;
Specific type
of)
encephalitis
related to
meninges
</p>
<p>acanthosis/N [ [acanth N*] [osis N*] N] (Part of &#8211;
Specific type
of) disease
related to
prickle
</p>
<p>disease
</p>
<p>alveolar/N [ [alveolar A] N] Entity being
alveolar
</p>
<p>TAB. 4 &#8211; Exemples d&#8217;analyses de lex&#232;mes effectu&#233;es par D&#233;riA (correctes puis incorrectes)
</p>
<p>rapport aux compos&#233;s fran&#231;ais.
L&#8217;&#233;valuation des r&#233;sultats de l&#8217;analyse des lex&#232;mes par Morfessor (m&#233;thode de (Iavindrasana
et al., 2006)) donne une couverture de 93,7 %, une pr&#233;cision de 53,2 % et un rappel de 49,9 %
(voir tableau 5). Nous avons &#233;galement calcul&#233; la pr&#233;cision des deux outils sur leur intersection
de couverture, soit 830 lex&#232;mes, et avons obtenu 58,7% pour Morfessor et 78,2% pour D&#233;riA.
</p>
<p>6 Discussion
La pr&#233;cision de notre syst&#232;me adapt&#233; (D&#233;riA) est encourageante, et pourrait &#234;tre am&#233;lior&#233;e en
identifiant les mots compos&#233;s dont le sens s&#8217;est fig&#233;. Le rappel est plus bas mais devrait augmen-
</p>
<p>Nb total de
lex&#232;mes
</p>
<p>Lex&#232;mes d&#233;compos&#233;s
(couverture)
</p>
<p>Nombre d&#8217;analyses
correctes
</p>
<p>Pr&#233;cision Rappel
</p>
<p>1299 1217 (93,7 %) 648 53,2 % 49,9 %
TAB. 5 &#8211; R&#233;sultats de l&#8217;&#233;valuation de Morfessor
</p>
<p>86</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse morphos&#233;mantique des compos&#233;s savants m&#233;dicaux
</p>
<p>ter rapidement en impl&#233;mentant des r&#232;gles suppl&#233;mentaires. Les r&#233;sultats sont similaires &#224; ceux
obtenus sur le fran&#231;ais par (Namer &amp; Baud, 2006). Le syst&#232;me ne g&#233;n&#232;re pas plus d&#8217;analyses
erron&#233;es que dans la langue d&#8217;origine. De plus, l&#8217;analyse des r&#233;sultats (section 5) n&#8217;a pas relev&#233;
d&#8217;erreurs dues &#224; une diff&#233;rence de m&#233;canisme dans la formation des compos&#233;s. Les probl&#232;mes
potentiels &#233;num&#233;r&#233;s (section 2) ne semblent pas s&#8217;&#234;tre r&#233;alis&#233;s. Bien que notre corpus de test ne
soit pas exhaustif, nous en concluons que ces difficult&#233;s sont rares et pourraient, le cas &#233;ch&#233;ant,
&#234;tre trait&#233;es gr&#226;ce &#224; des r&#232;gles d&#8217;exception. Ce syst&#232;me sp&#233;cifique &#224; une langue a donc pu &#234;tre
adapt&#233; avec succ&#232;s &#224; une autre langue pour l&#8217;analyse de compos&#233;s m&#233;dicaux.
L&#8217;utilisation d&#8217;un analyseur morphos&#233;mantique comme D&#233;riF bas&#233; sur des m&#233;thodes linguis-
tiques pr&#233;sente en outre un certain nombre d&#8217;avantages. Le syst&#232;me effectue &#224; la fois une d&#233;com-
position morphologique et une interpr&#233;tation s&#233;mantique, tandis que d&#8217;autres m&#233;thodes restent
au niveau de la segmentation morphologique ou ajoutent de la s&#233;mantique apr&#232;s l&#8217;application
d&#8217;un outil de d&#233;composition. Nous produisons &#233;galement une d&#233;composition hi&#233;rarchique et
non simplement lin&#233;aire. Les r&#233;sultats obtenus en suivant la m&#233;thode de (Iavindrasana et al.,
2006) ont donn&#233; une couverture bien plus grande qu&#8217;avec D&#233;riA, mais une pr&#233;cision tr&#232;s inf&#233;-
rieure (20-25 % de moins) et un rappel l&#233;g&#232;rement moindre. Ceci montre qu&#8217;un nombre presque
identique de lex&#232;mes sont correctement analys&#233;s (rappel), mais que D&#233;riA est bien plus exact
car il propose beaucoup moins d&#8217;analyses incorrectes. En se basant sur un analyseur statistique,
la m&#233;thode de (Iavindrasana et al., 2006) a l&#8217;avantage d&#8217;&#234;tre ind&#233;pendante de la langue ; cepen-
dant, l&#8217;impl&#233;mentation utilis&#233;e fait &#233;galement usage d&#8217;une table de morph&#232;mes, de sorte que
la transposition vers une autre langue n&#8217;est pas imm&#233;diate non plus. De plus, la segmentation
sur des bases statistiques cause &#233;galement certains types d&#8217;erreurs qui peuvent &#234;tre facilement
&#233;vit&#233;es avec des r&#232;gles linguistiques comme celles de D&#233;riA (par exemple, CHEMOSIS est seg-
ment&#233; en C+HEM+OSIS parMorfessor). De plus, comme nous l&#8217;avons soulign&#233; ci-dessus, D&#233;riA
propose en sortie une information plus riche que Morfessor (simple segmentation lin&#233;aire).
Ce travail offre aussi la perspective d&#8217;un syst&#232;me capable de fonctionner avec plusieurs langues.
Nous avons transpos&#233; le syst&#232;me du fran&#231;ais &#224; l&#8217;anglais, mais une prochaine &#233;tape pourrait &#234;tre
de faire fonctionner le syst&#232;me sur les deux langues (utiliser le m&#234;me syst&#232;me aussi bien pour
analyser des compos&#233;s anglais que fran&#231;ais) ou de l&#8217;utiliser pour la traduction : produire une d&#233;-
finition anglaise d&#8217;un lex&#232;me fran&#231;ais (et vice-versa). Il faudrait pour cela une table multilingue
de racines (comme propos&#233; dans (Namer, 2005b) et pr&#233;par&#233; ici pour l&#8217;anglais et le fran&#231;ais), des
sch&#233;mas d&#8217;interpr&#233;tation s&#233;mantique multilingues (comme obtenus ici pour ces deux langues)
et une traduction des lex&#232;mes du lexique. Un tel syst&#232;me pourrait, par exemple, contribuer &#224; la
recherche d&#8217;information translingue, avec les m&#234;mes principes que dans (Mark&#243; et al., 2005).
</p>
<p>7 Conclusion
Dans cet article, nous avons montr&#233; comment transposer un analyseur morphos&#233;mantique bas&#233;
sur des r&#232;gles linguistiques depuis le fran&#231;ais vers l&#8217;anglais afin d&#8217;analyser des compos&#233;s sa-
vants m&#233;dicaux. Ceci v&#233;rifie l&#8217;hypoth&#232;se que les compos&#233;s savants de diff&#233;rentes langues peuvent
&#234;tre analys&#233;s de la m&#234;me fa&#231;on sur le cas du voculaire m&#233;dical de deux langues de type romane
(le fran&#231;ais) et germanique (l&#8217;anglais). La m&#233;thode peut &#234;tre appliqu&#233;e sur les compos&#233;s savants
d&#8217;autres vocabulaires sp&#233;cialis&#233;s et devrait donner des r&#233;sultats similaires. Ce travail constitue
&#233;galement un premier pas vers la cr&#233;ation d&#8217;un syst&#232;me multilingue, qu&#8217;on obtiendrait en appli-
quant la m&#233;thode &#224; d&#8217;autres langues, t&#226;che plus ou moins ais&#233;e selon la proximit&#233; des langues
(le fran&#231;ais et l&#8217;anglais &#233;tant proches, on peut supposer que de nouvelles difficult&#233;s se poseront
</p>
<p>87</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Louise DEL&#201;GER, Fiammetta NAMER, Pierre ZWEIGENBAUM
</p>
<p>avec d&#8217;autres langues plus &#233;loign&#233;es).
D&#8217;un point de vue directement applicatif, nous disposons d&#233;sormais d&#8217;un syst&#232;me fonction-
nant sur l&#8217;anglais que nous pouvons utiliser dans le domaine de la pharmacovigilance sur les
termes de la terminologie WHO-ART afin de mesurer leur proximit&#233;, ce qui constituerait une
alternative &#224; la m&#233;thode propos&#233;e par (Iavindrasana et al., 2006).
</p>
<p>R&#233;f&#233;rences
CREUTZ M., LAGUS K., LINDEN K. &amp; VIRPIOJA S. (2005). Unsupervised morpheme seg-
mentation and morphology induction from text corpora using Morfessor 1.0. Rapport interne,
Computer and Information Science, Helsinki University of Technology.
DUJOLS P., AUBAS P., BAYLON C. &amp; GR&#201;MY F. (1991). Morphosemantic analysis and
translation of medical compound terms. Methods of Information in Medicine, 30, 30&#8211;35.
IACOBINI C. (2003). Composizione con elementi neoclassici. In M. GROSSMAN &amp; F. RAI-
NER, Eds., La formazione delle parole in italiano, p. 69&#8211;96. T&#252;bingen : Niemeyer.
IAVINDRASANA J., BOUSQUET C. &amp; JAULENT M.-C. (2006). Knowledge acquisition for
computation of semantic distance between WHO-ART terms. In Stud Health Technol Inform,
p. 839&#8211;44.
LOVIS C., MICHEL P., BAUD R. &amp; SCHERRER J. (1995). Word segmentation processing :
a way to exponentially extend medical dictionaries. Methods of Information in Medicine, p.
28&#8211;32.
MARK&#211; K., SCHULZ S. &amp; HAHN U. (2005). Morphosaurus - design and evaluation of an
interlingua-based, cross-language document retrieval engine for the medical domain. Methods
of Information in Medicine, p. 537&#8211;545.
NAMER F. (2005a). Guessing the meaning of neoclassical compounds within LG : the case
of pathology nouns. In Proceedings of Generative Approaches to the Lexicon, p. 175&#8211;84,
Geneva.
NAMER F. (2005b). Morphos&#233;mantique pour l&#8217;appariement de termes dans le vocabulaire
m&#233;dical : approche multilingue. In M. JARDINO, Ed., Actes de TALN 2005 (Traitement auto-
matique des langues naturelles), p. 63&#8211;72, Dourdan : ATALA LIMSI.
NAMER F. &amp; BAUD R. (2006). Defining and relating biomedical terms : towards a cross-
language morphosemantics-based system. Int J Med Inform.
NAMER F. &amp; ZWEIGENBAUM P. (2004). Acquiring meaning for French medical termino-
logy : contribution of morphosemantics. In M. FIESCHI, E. COIERA &amp; Y.-C. J. LI, Eds.,
MEDINFO, p. 535&#8211;539, San Francisco.
PACAK M., NORTON L. &amp; DUNHAM G. (1980). Morphosemantic analysis of -itis forms in
medical language. Methods of Information in Medicine, 19, 99&#8211;105.
SCHULZ S., ROMACKER M., FRANZ P., ZAISS A., KLAR R. &amp; HAHN U. (1999). Towards
a multilingual morpheme thesaurus for medical free-text retrieval. In Proceedings of MIE&#8217;99,
Ljubliana, Slovenia : IOS Press.
WOLFF S. (1984). The use of morphosemantic regularities in the medical vocabulary for
automatic lexical coding. Methods of Information in Medicine, 4(23), 195&#8211;203.
</p>
<p>88</p>

</div></div>
</body></html>