<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>R&#233;solution de la r&#233;f&#233;rence dans des dialogues homme-machine : &#233;valuation sur corpus de deux approches symbolique et probabiliste</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>R&#233;solution de la r&#233;f&#233;rence dans des dialogues
homme-machine : &#233;valuation sur corpus de deux approches
</p>
<p>symbolique et probabiliste
</p>
<p>Alexandre DENIS1, Fr&#233;d&#233;ric B&#201;CHET2, Matthieu QUIGNARD1
1 UMR 7503 LORIA/CNRS &#8211; Campus scientifique
</p>
<p>56 506 Vandoeuvre-l&#232;s-Nancy Cedex
2 LIA &#8211; 339, chemin des Meinajaries, BP 1228,
</p>
<p>84 911 Avignon Cedex 9
{alexandre.denis,matthieu.quignard}@loria.fr,
</p>
<p>frederic.bechet@univ-avignon.fr
</p>
<p>R&#233;sum&#233;. Cet article d&#233;crit deux approches, l&#8217;une num&#233;rique, l&#8217;autre symbolique, traitant
le probl&#232;me de la r&#233;solution de la r&#233;f&#233;rence dans un cadre de dialogue homme-machine. L&#8217;ana-
lyse des r&#233;sultats obtenus sur le corpus MEDIA montre la compl&#233;mentarit&#233; des deux syst&#232;mes
d&#233;velopp&#233;s : robustesse aux erreurs et hypoth&#232;ses multiples pour l&#8217;approche num&#233;rique ; mod&#233;-
lisation de ph&#233;nom&#232;nes complexes et interpr&#233;tation compl&#232;te pour l&#8217;approche symbolique.
</p>
<p>Abstract. This paper presents two approaches, one symbolic, the other one probabilistic,
for processing reference resolution in the framework of human-machine spoken dialogues. The
results obtained by both systems on the French MEDIA corpus points out the complementarity
of the two approaches : robustness and multiple hypotheses generation for the probabilistic one ;
global interpretation and modeling of complex phenomenon for the symbolic one.
</p>
<p>Mots-cl&#233;s : dialogue homme-machine, r&#233;solution de la r&#233;f&#233;rence, &#233;valuation, compr&#233;-
hension dans le dialogue.
</p>
<p>Keywords: human-machine dialogue, reference resolution, dialogue understanding, eva-
luation.
</p>
<p>1 Introduction
</p>
<p>Le projet MEDIA de l&#8217;action TECHNOLANGUE propose une m&#233;thodologie d&#8217;&#233;valuation des sys-
t&#232;mes de compr&#233;hension de la parole dans un cadre de dialogues homme-machine. Le para-
digme est inspir&#233; du projet PEACE (Maynard &amp; Devillers, 2000). Il d&#233;finit une repr&#233;sentation
s&#233;mantique commune vers laquelle chaque syst&#232;me devra convertir sa propre repr&#233;sentation.
</p>
<p>A partir du corpus collect&#233; (Bonneau-Maynard et al., 2005), le projet MEDIA se divise en deux
campagnes d&#8217;&#233;valuation : MEDIA-HC (hors contexte) et MEDIA-EC (en contexte). Dans la pre-
mi&#232;re campagne les syst&#232;mes sont &#233;valu&#233;s sur leur capacit&#233; &#224; produire la forme s&#233;mantique
d&#233;sir&#233;e sans prendre en compte le contexte du dialogue, chaque &#233;nonc&#233; &#233;tant consid&#233;r&#233; comme
</p>
<p>261</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre DENIS, Fr&#233;d&#233;ric B&#201;CHET, Matthieu QUIGNARD
</p>
<p>ind&#233;pendant (Bonneau-Maynard et al., 2006). La deuxi&#232;me campagne &#233;value la compr&#233;hension
d&#8217;un &#233;nonc&#233; dans le contexte du dialogue. En particulier deux aspects sont &#233;valu&#233;s :
</p>
<p>&#8211; sp&#233;cification du sens en contexte des entit&#233;s d&#233;tect&#233;es lors de la phase MEDIA-HC ;
&#8211; r&#233;solution des r&#233;f&#233;rences vers des entit&#233;s introduites dans des tours pr&#233;c&#233;dents du dialogue.
</p>
<p>Deux syst&#232;mes ont particip&#233; &#224; cette &#233;valuation en-contexte, un syst&#232;me r&#233;alis&#233; au LIA et un
autre au LORIA, chacun impl&#233;mentant des m&#233;thodes diff&#233;rentes : une approche num&#233;rique pour
le LIA, une approche symbolique pour le LORIA. Cet article d&#233;crit ces deux syst&#232;mes, l&#8217;outil
d&#8217;&#233;valuation d&#233;velopp&#233; pour cette campagne par le LORIA et les premiers r&#233;sultats obtenus.
</p>
<p>2 Probl&#233;matique et manuel d&#8217;annotation
</p>
<p>La r&#233;solution de la r&#233;f&#233;rence est le processus cognitif qui met en relation une expression (lin-
guistique ou non) et la repr&#233;sentation mentale que cette expression d&#233;signe (voir pour une d&#233;-
finition proche (Reboul &amp; Moeschler, 1994)). Une repr&#233;sentation mentale est d&#233;finie comme
l&#8217;aggr&#233;gation de donn&#233;es h&#233;t&#233;rog&#232;nes (perceptives, m&#233;morielles, logiques, etc.) sur une entit&#233;
(Reboul &amp; Gaiffe, 1999). Dans cette campagne, nous nous focalisons sur la repr&#233;sentation des
r&#233;f&#233;rents acquise par une relation intra-linguistique de cor&#233;f&#233;rence, d&#233;finie entre deux expres-
sions r&#233;f&#233;rentielles si ces derni&#232;res d&#233;signent le m&#234;me r&#233;f&#233;rent (van Deemter &amp; Kibble, 2000).
</p>
<p>L&#8217;&#233;valuation de la r&#233;f&#233;rence au sein du consortium devait r&#233;pondre &#224; deux objectifs principaux :
elle devait &#234;tre accessible &#224; tous les syst&#232;mes participants et elle devait &#234;tre compatible avec
le paradigme d&#8217;&#233;valuation hors-contexte et en particulier la repr&#233;sentation s&#233;mantique utilis&#233;e
(Bonneau-Maynard et al., 2005).
</p>
<p>La plupart des approches &#233;valuent les relations entre expressions r&#233;f&#233;rentielles (Popescu-Belis
et al., 2004), et s&#8217;appuient sur des formats d&#8217;annotation qui se concentrent sur les relations,
&#224; l&#8217;instar du format des campagnes MUC-6 et MUC-7 bas&#233; sur les cor&#233;f&#233;rences (Chinchor &amp;
Hirschmann, 1997; van Deemter &amp; Kibble, 2000). Dans cette lign&#233;e, le Reference Annotation
Framework, RAF (Salmon-Alt &amp; Romary, 2004) d&#233;finit des cat&#233;gories de donn&#233;es pour anno-
ter les expressions r&#233;ferentielles (les markables) et les relations de diff&#233;rentes natures qu&#8217;elles
entretiennent (les referentials links).
</p>
<p>Cependant, comme tous les syst&#232;mes ne pouvaient produire ces relations mais &#233;taient tous ca-
pables de fournir une repr&#233;sentation s&#233;mantique des r&#233;f&#233;rents (Bonneau-Maynard et al., 2006),
il a &#233;t&#233; d&#233;cid&#233; d&#8217;&#233;valuer non pas les relations mais les descriptions des r&#233;f&#233;rents. L&#8217;annotation en
contexte est alors vue comme une extension de l&#8217;annotation hors-contexte. Nous nous sommes
toutefois inspir&#233;s des cat&#233;gories pertinentes de liens r&#233;f&#233;rentiels d&#233;finis dans RAF (identit&#233;,
codomanialit&#233;, partie-tout) pour annoter les formes d&#8217;expressions r&#233;f&#233;rentielles.
</p>
<p>Annotation hors-contexte de la r&#233;f&#233;rence. L&#8217;annotation hors-contexte consiste &#224; annoter
chaque segment signifiant d&#8217;un &#233;nonc&#233; par un trait s&#233;mantique du type &#12296;mode, attribut, va-
leur&#12297; dont les contraintes ont &#233;t&#233; d&#233;finies collectivement lors de l&#8217;&#233;valuation hors-contexte 1
(Bonneau-Maynard et al., 2005). En ce qui concerne la r&#233;f&#233;rence, cette annotation s&#8217;est limit&#233;e
&#224; annoter la pr&#233;sence d&#8217;une expression r&#233;f&#233;rentielle gr&#226;ce &#224; un trait d&#8217;attribut lienRef raffin&#233;
</p>
<p>1le mode d&#233;crit la polarit&#233; du trait (positive, n&#233;gative, interrogative, optionnelle), l&#8217;attribut repr&#233;sente la cat&#233;-
gorie s&#233;mantique mentionn&#233;e, et la valeur son instanciation
</p>
<p>262</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution de la r&#233;f&#233;rence dans des dialogues homme-machine
</p>
<p>par la cat&#233;gorie de l&#8217;expression. Les diff&#233;rents raffinements retenus (appel&#233;s sp&#233;cifieurs) sont
proches des cat&#233;gories de RAF (voir tableau 1), &#224; l&#8217;exception de partie-tout que nous n&#8217;avons
pas annot&#233; faute de consensus. A la diff&#233;rence des markables de RAF, seuls les d&#233;terminants
des groupes nominaux sont associ&#233;s au lienRef afin de ne pas interf&#233;rer avec le reste du groupe
nominal d&#233;j&#224; annot&#233; en s&#233;mantique.
</p>
<p>TAB. 1 &#8211; Types de sp&#233;cifieurs
Sp&#233;cifieur Signification Expressions r&#233;f&#233;rentielles
coRef cor&#233;f&#233;rence : l&#8217;expression r&#233;f&#233;rentielle d&#233;signe son r&#233;f&#233;rent
</p>
<p>par r&#233;f&#233;rence directe
pronoms, d&#233;finis, d&#233;monstratifs
</p>
<p>elsEns &#233;l&#233;ment-ensemble : l&#8217;expression r&#233;f&#233;rentielle d&#233;signe son
r&#233;f&#233;rent en vertu de propri&#233;t&#233;s s&#233;mantiques ou indexicales
qui l&#8217;opposent &#224; d&#8217;autres entit&#233;s dans un ensemble
</p>
<p>ordinaux, superlatifs, relatives,
certains pronoms d&#233;monstratifs
</p>
<p>coDom co-domaine : l&#8217;expression r&#233;f&#233;rentielle d&#233;signe son r&#233;f&#233;rent
gr&#226;ce &#224; un marqueur linguistique d&#8217;alt&#233;rit&#233;
</p>
<p>alt&#233;rit&#233;s
</p>
<p>Afin de r&#233;duire le co&#251;t d&#8217;annotation, seules les expressions r&#233;f&#233;rentielles dont la r&#233;solution
d&#233;passe le cadre de l&#8217;&#233;nonc&#233; ont &#233;t&#233; annot&#233;es. Cela exclut d&#232;s lors les r&#233;f&#233;rents dont l&#8217;ant&#233;c&#233;dent
a &#233;t&#233; introduit dans le m&#234;me &#233;nonc&#233;, les entit&#233;s nomm&#233;es et les ind&#233;finis2. En revanche, les
articles d&#233;finis ont &#233;t&#233; annot&#233;s syst&#233;matiquement, du moins pour les entit&#233;s relevant de la t&#226;che.
</p>
<p>Annotation en contexte de la r&#233;f&#233;rence. Une r&#233;f&#233;rence est repr&#233;sent&#233;e comme un ensemble
de r&#233;f&#233;rents, chacun d&#233;crit par un ensemble de traits s&#233;mantiques. On adjoint un champ refe-
rence &#224; tous les traits lienRef. On notera par exemple {(t1,t2), (t3)} une expression r&#233;f&#233;rentielle
qui fait r&#233;f&#233;rence &#224; deux entit&#233;s, l&#8217;une d&#233;crite par deux traits et l&#8217;autre d&#233;crite par un seul.
</p>
<p>Exemple d&#8217;annotation hors et en contexte :
</p>
<p>je veux / une / chambre double / et / une / chambre simple
+/nombre-chambre : 1
+/chambre-type : double
+/nombre-chambre : 1
+/chambre-type : simple
</p>
<p>est-ce que / ces / chambres / ont la douche ?
+/lienRef-coRef : pluriel reference = {
</p>
<p>(+/nombre-chambre :1, +/chambre-type :double),
(+/nombre-chambre :1, +/chambre-type :simple)}
</p>
<p>+/objet : chambre
?/chambre-equipement : douche
</p>
<p>Afin de raffiner l&#8217;expression du formalisme on autorise le lienRef a &#234;tre resp&#233;cifi&#233; dans certains cas. Par
exemple, pour repr&#233;senter l&#8217;ambigu&#239;t&#233;, en l&#8217;absence d&#8217;un niveau suppl&#233;mentaire requis, on approxime
l&#8217;alternative comme un ensemble de r&#233;f&#233;rents en sp&#233;cifiant le lienRef par ambigu. Ou encore pour dis-
tinguer les r&#233;f&#233;rents exclus des r&#233;f&#233;rents inclus (en particulier pour l&#8217;ind&#233;fini avec alt&#233;rit&#233;, voir note 2)
on sp&#233;cifie le lienRef par exclusion ou inclusion.
</p>
<p>R&#232;gles d&#8217;annotation. Nous avons collectivement d&#233;fini des r&#232;gles d&#8217;annotation pour r&#233;duire le
risque de d&#233;saccord entre annotateurs et s&#8217;adapter aux sp&#233;cificit&#233;s de l&#8217;annotation hors-contexte 3. Tout
</p>
<p>2&#192; l&#8217;exception de l&#8217;ind&#233;fini avec alt&#233;rit&#233; (par ex. &quot;une autre chambre&quot;) que nous avons jug&#233; pertinent d&#8217;&#233;valuer.
Dans ce cas ce n&#8217;est pas le r&#233;f&#233;rent qui est annot&#233; (il est ind&#233;fini) mais l&#8217;entit&#233; exclue.
</p>
<p>3ces r&#232;gles sont disponibles sur http://www.loria.fr/~denis/media.html, l&#8217;accord inter-
annotateur est donn&#233; dans le tableau 2
</p>
<p>263</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre DENIS, Fr&#233;d&#233;ric B&#201;CHET, Matthieu QUIGNARD
</p>
<p>d&#8217;abord la port&#233;e de la description d&#8217;un r&#233;f&#233;rent est constitu&#233;e uniquement des traits s&#233;mantiques pr&#233;-
sents dans le dialogue ant&#233;rieur en excluant l&#8217;&#233;nonc&#233; courant et les &#233;nonc&#233;s simultan&#233;s en cas de che-
vauchements. Ensuite la couverture de la description est un compromis entre une annotation maximale
qui aurait &#233;t&#233; trop co&#251;teuse &#224; effectuer et une annotation minimale restreinte aux traits discriminants peu
int&#233;ressante &#224; &#233;valuer lorsqu&#8217;il n&#8217;y a qu&#8217;un seul r&#233;f&#233;rent. Nous avons alors distingu&#233; entit&#233;s nomm&#233;es et
non-nomm&#233;es :
</p>
<p>&#8211; les entit&#233;s nomm&#233;es ou assimil&#233;es (h&#244;tel nomm&#233;, dates, prix, villes, etc.) ne sont d&#233;crites que par un
ensemble tr&#232;s restreint de traits comme leur nom ou leur valeur ;
</p>
<p>&#8211; les entit&#233;s non-nomm&#233;es (h&#244;tel non nomm&#233; et chambre) sont, elles seules, annot&#233;es avec la totalit&#233; de
la description possible, y compris les traits d&#8217;autres r&#233;f&#233;rents.
</p>
<p>Enfin on contraint la description des r&#233;f&#233;rents &#224; &#234;tre en forme normale, c&#8217;est-&#224;-dire principalement non-
redondante et non-contradictoire, de mani&#232;re &#224; homog&#233;n&#233;iser les descriptions r&#233;p&#233;t&#233;es (comme dans les
anaphores fid&#232;les) ou r&#233;vis&#233;es.
</p>
<p>3 L&#8217;approche symbolique du LORIA
</p>
<p>Le syst&#232;me de r&#233;solution de la r&#233;f&#233;rence d&#233;velopp&#233; au LORIA est fond&#233; sur la th&#233;orie des domaines
de r&#233;f&#233;rence (Corblin, 1987; Reboul et al., 1997; Salmon-Alt, 2001). Il postule que la d&#233;signation des
r&#233;f&#233;rents passe par l&#8217;identification pr&#233;alable d&#8217;un domaine dans lequel l&#8217;expression r&#233;f&#233;rentielle isole le
r&#233;f&#233;rent. Cette vision de la r&#233;f&#233;rence se rapproche de la th&#233;orie des espaces focaux de Sidner (Grosz &amp;
Sidner, 1986). Elle a pour but d&#8217;unifier le traitement des diff&#233;rentes modalit&#233;s ou types de d&#233;signation
mod&#233;lis&#233;s de mani&#232;re h&#233;t&#233;rog&#232;ne par d&#8217;autres syst&#232;mes. En particulier les ordinaux et les expressions
d&#8217;alt&#233;rit&#233; ne n&#233;cessitent pas de traitement ad hoc et s&#8217;int&#232;grent &#233;l&#233;gamment dans la th&#233;orie. L&#8217;&#233;valuation
MEDIA fut pour nous l&#8217;occasion de tester le mod&#232;le sur l&#8217;anaphore bien qu&#8217;il f&#251;t &#224; l&#8217;origine cr&#233;&#233; pour la
r&#233;f&#233;rence multimodale.
</p>
<p>Structuration en domaines de r&#233;f&#233;rence. Un domaine de r&#233;f&#233;rence est constitu&#233; d&#8217;un support,
un ensemble d&#8217;objets d&#233;fini intensionnellement ou extensionnellement, et d&#8217;un ensemble de crit&#232;res de
diff&#233;renciation qui en discriminent les &#233;l&#233;ments. Chaque d&#233;signation active le domaine dans lequel on
extrait le r&#233;f&#233;rent en le focalisant, le pr&#233;f&#233;rant ainsi pour les d&#233;signations ult&#233;rieures. On repr&#233;sente ici un
domaine comme un couple (S,C), o&#249; S est l&#8217;ensemble support et C un ensemble de crit&#232;res (formalis&#233;s
par des relations d&#8217;&#233;quivalence). Chaque crit&#232;re sera not&#233; c :F , o&#249; c est la relation et F un &#233;l&#233;ment
focalis&#233; de la partition op&#233;r&#233;e par c. Dans l&#8217;exemple suivant un seul crit&#232;re (l&#8217;index) sera utilis&#233; pour
discriminer les r&#233;f&#233;rents.
</p>
<p>S : je vous propose l&#8217;h&#244;tel ibis et l&#8217;h&#244;tel lafayette H*=( {h1, h2}, {index :{}} )
U : est-ce que le premier h&#244;tel accepte les animaux H*=( {h1, h2}, {index :{h1}} )
S : non l&#8217;h&#244;tel ibis n&#8217;accepte pas les animaux H*=( {h1, h2}, {index :{h1}} )
U : ok, je prends l&#8217;autre alors H*=( {h1, h2}, {index :{h2}} )
</p>
<p>L&#8217;expression ordinale &quot;le premier h&#244;tel&quot; r&#233;f&#232;re &#224; h1 en vertu de son index, ce dernier re&#231;oit donc la
focalisation pour le crit&#232;re &quot;index&quot;. L&#8217;expression d&#8217;alt&#233;rit&#233; recherche un domaine pr&#233;sentant une partition
focalis&#233;e dans laquelle extraire l&#8217;autre &#233;l&#233;ment, ce qui a pour effet de focaliser h2 dans la partition &quot;index&quot;
(Denis et al., 2006b).
</p>
<p>Projection dans le formalisme. La projection consiste &#224; construire la repr&#233;sentation MEDIA d&#8217;un
r&#233;f&#233;rent. Etant donn&#233; que les domaines de r&#233;f&#233;rence ne conservent que le point de vue courant sur les
r&#233;f&#233;rents et non pas les expressions r&#233;f&#233;rentielles et le contexte de leur emploi, il &#233;tait n&#233;cessaire de
</p>
<p>264</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution de la r&#233;f&#233;rence dans des dialogues homme-machine
</p>
<p>combiner le mod&#232;le avec une repr&#233;sentation lexicale et s&#233;mantique des r&#233;f&#233;rents. Parall&#232;lement &#224; la
structuration domaniale de l&#8217;espace r&#233;f&#233;rentiel, nous avons conserv&#233; la structure s&#233;mantique des &#233;non-
c&#233;s &#224; laquelle nous avons ajout&#233; des relations r&#233;f&#233;rentielles. Cette derni&#232;re s&#8217;appuie sur le MultiModal
Interface Language, MMIL (Landragin &amp; Romary, 2004) la repr&#233;sentation s&#233;mantique utilis&#233;e lors de
la phase hors-contexte qui permet la repr&#233;sentation d&#8217;informations de natures lexicale, syntaxique ou
s&#233;mantique. Ces liens r&#233;f&#233;rentiels nous permettent de parcourir les cha&#238;nes de cor&#233;f&#233;rence afin d&#8217;anno-
ter les descriptions des r&#233;f&#233;rents en fonction de leur repr&#233;sentation s&#233;mantique &#224; diff&#233;rents instants du
dialogue.
</p>
<p>L&#8217;algorithme est le suivant :
</p>
<p>1. interpr&#233;tation de l&#8217;&#233;nonc&#233; et production d&#8217;une forme s&#233;mantique (Denis et al., 2006a) ;
</p>
<p>2. r&#233;solution de chaque r&#233;f&#233;rent de l&#8217;&#233;nonc&#233; : identification d&#8217;un domaine compatible gr&#226;ce &#224; la
forme s&#233;mantique puis extraction et focalisation du r&#233;f&#233;rent (Salmon-Alt, 2001) ;
</p>
<p>3. mise &#224; jour de l&#8217;historique s&#233;mantique : cr&#233;ation des relations d&#8217;anaphores (cor&#233;f&#233;rence, et ana-
phore associative) entre les instances des r&#233;f&#233;rents ;
</p>
<p>4. projection par parcours des cha&#238;nes de cor&#233;f&#233;rence : aggr&#233;gation des informations s&#233;mantiques
hors-contexte relatives aux r&#233;f&#233;rents dans un voisinage pr&#233;d&#233;fini correspondant au type d&#8217;entit&#233;s
(pr&#233;sence d&#8217;une relation s&#233;mantique, co-occurrence dans le composant s&#233;mantique, co-occurrence
dans l&#8217;&#233;nonc&#233;, pr&#233;sence dans le dialogue ant&#233;rieur).
Dans une des conditions du test (avecHC, cf. &#167;5), nous int&#233;grons &#224; ce stade les annotations HC
fournies par le protocole. Nous n&#8217;en tirons pas partie pour identifier les r&#233;f&#233;rents.
</p>
<p>4 L&#8217;approche probabiliste du LIA
</p>
<p>Le syst&#232;me d&#8217;interpr&#233;tation du LIA est compos&#233; de deux niveaux. Le premier niveau effectue le d&#233;-
codage conceptuel en calculant, &#224; partir d&#8217;un message vocal, une liste des n-meilleures s&#233;quences de
concepts (o&#249; chaque concept est repr&#233;sent&#233; par trois champs qui sont la cha&#238;ne de mots supports, l&#8217;attri-
but s&#233;mantique et la valeur). L&#8217;attribution des sp&#233;cifieurs, du mode et la r&#233;solution des r&#233;f&#233;rences sont
pris en compte par le second niveau prenant en entr&#233;e la liste des n-meilleures s&#233;quences de concepts
obtenues &#224; partir du message vocal. Ce syst&#232;me (Servan &amp; Bechet, 2006) est fond&#233; sur une approche
probabiliste identique &#224; celle utilis&#233;e en Reconnaissance Automatique de la Parole (RAP). Ce syst&#232;me a
&#233;t&#233; d&#233;velopp&#233; pour traiter directement des messages vocaux, cependant les r&#233;sultats pr&#233;sent&#233;s dans cette
&#233;tude sont obtenus sur les transcriptions manuelles du corpus, comme pour toute la campagne MEDIA.
</p>
<p>La compr&#233;hension en contexte est ici effectu&#233;e selon l&#8217;approche suivante : la sp&#233;cification du sens est vue
comme une t&#226;che d&#8217;&#233;tiquetage pouvant &#234;tre trait&#233;e gr&#226;ce &#224; des techniques d&#8217;&#233;tiquetage probabilistes. La
r&#233;solution des r&#233;f&#233;rences est faite par un certain nombre d&#8217;heuristiques d&#233;crivant tous les rattachements
possibles pouvant &#234;tre faits entre la liste des n-meilleures interpr&#233;tations et l&#8217;historique du dialogue.
</p>
<p>Sp&#233;cification du sens en contexte. Les s&#233;quences de concepts produites &#224; partir du graphe de
concepts dans la phase de d&#233;codage conceptuel ne contiennent aucun sp&#233;cifieur de sens, hors ou en
contexte. Ces sp&#233;cifieurs sont attribu&#233;s par un &#233;tiqueteur probabiliste bas&#233; sur les Champs Conditionnels
Al&#233;atoires (ou Conditional Random Fields, CRF). Les CRF (Lafferty et al., 2001) ont &#233;t&#233; utilis&#233;s avec
succ&#232;s dans de nombreuses t&#226;ches d&#8217;&#233;tiquetage telles que l&#8217;&#233;tiquetage morphosyntaxique ou la d&#233;tec-
tion d&#8217;entit&#233;s nomm&#233;es. L&#8217;avantage principal des CRF par rapport &#224; des mod&#232;les g&#233;n&#233;ratifs tels que les
mod&#232;les de Markov cach&#233;s est la possibilit&#233; d&#8217;utiliser l&#8217;ensemble des observations d&#8217;une s&#233;quence pour
pr&#233;dire une &#233;tiquette. Ce n&#8217;est donc pas le seul historique imm&#233;diat qui contraint l&#8217;attribution d&#8217;une &#233;ti-
quette &#224; une observation mais potentiellement toutes les observations pr&#233;c&#233;dentes et suivantes. Cela est
particuli&#232;rement int&#233;ressant pour l&#8217;&#233;tiquetage des sp&#233;cifieurs dans la mesure o&#249; la sp&#233;cification du sens
</p>
<p>265</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre DENIS, Fr&#233;d&#233;ric B&#201;CHET, Matthieu QUIGNARD
</p>
<p>d&#8217;un concept peut se faire avec des &#233;l&#233;ments situ&#233;s avant ou apr&#232;s le concept dans l&#8217;&#233;nonc&#233; courant, ou
dans les &#233;nonc&#233;s pr&#233;c&#233;dents. Les liens r&#233;f&#233;rentiels sont &#233;tiquet&#233;s dans cette phase par rapport au type de
l&#8217;objet r&#233;f&#233;renc&#233; et au type de r&#233;f&#233;rence.
</p>
<p>Le corpus d&#8217;apprentissage des CRF est obtenu &#224; partir des corpus MEDIA. Chaque dialogue constitue
une s&#233;quence o&#249; les observations sont les concepts marqu&#233;s dans la r&#233;f&#233;rence et les &#233;tiquettes sont soit
les sp&#233;cifieurs attribu&#233;s aux concepts ; soit le type du ou des objets r&#233;f&#233;renc&#233;s pour les liens r&#233;f&#233;rentiels,
ainsi que le type du lien ; soit le symbole NULL si un concept n&#8217;a ni sp&#233;cifieur ni lien r&#233;f&#233;rentiel. Lors du
traitement d&#8217;un message, chaque cha&#238;ne de concepts produite par le d&#233;codeur mot/concept est trait&#233;e par
l&#8217;&#233;tiqueteur CRF et la description des concepts est enrichie avec les &#233;tiquettes attribu&#233;es. L&#8217;&#233;tiqueteur
d&#233;velopp&#233; utilise l&#8217;outil CRF++4.
</p>
<p>R&#233;solution de la r&#233;f&#233;rence. A la suite de la phase pr&#233;c&#233;dente les concepts liens r&#233;f&#233;rentiels sont
&#233;tiquet&#233;s avec les trois informations suivantes : le type de ou des objets point&#233;s (chambre, h&#244;tel, r&#233;ser-
vation ou une combinaison de ces valeurs) ; le type du lien r&#233;f&#233;rentiel (ambigu, exclusion, inclusion) ; et
enfin le nombre (singulier ou pluriel).
</p>
<p>La r&#233;solution des r&#233;f&#233;rences s&#8217;effectue alors selon l&#8217;algorithme suivant : tous les concepts situ&#233;s dans
l&#8217;historique du dialogue (limit&#233; aux n &#233;nonc&#233;s pr&#233;c&#233;dents) ayant une &#233;tiquette sp&#233;cifieur similaire au
type d&#8217;objet point&#233; par le lien r&#233;f&#233;rentiel sont associ&#233;s &#224; ce lien.
</p>
<p>Chaque objet est caract&#233;ris&#233; par un certain nombre de traits (par exemple la ville, la marque, le nom
ou les services associ&#233;s &#224; un h&#244;tel). L&#8217;algorithme d&#8217;association fait pointer le lien r&#233;f&#233;rentiel vers tous
les concepts repr&#233;sentant ces traits. Lorsque tous les traits sont identifi&#233;s, l&#8217;algorithme s&#8217;arr&#234;te s&#8217;il s&#8217;agit
d&#8217;un lien r&#233;f&#233;rence singulier. Sinon un nouvel objet est cr&#233;&#233; et le processus se poursuit. Aucun contr&#244;le
n&#8217;est effectu&#233; sur le nombre d&#8217;objets d&#233;sign&#233;s. Le but ici est de maximiser les mesures de rappel sur
les r&#233;f&#233;rences pour proposer au module de d&#233;cision (analyseur s&#233;mantique, gestionnaire de dialogue) le
plus d&#8217;associations possibles, chacune avec un score donn&#233; par les diff&#233;rents mod&#232;les utilis&#233;s lors du
d&#233;codage.
</p>
<p>5 M&#233;thodologie
</p>
<p>Dans le cadre de la campagne MEDIA un corpus de 1 250 dialogues a &#233;t&#233; constitu&#233; selon un protocole
de type Magicien d&#8217;Oz : 250 locuteurs ont effectu&#233;s chacun 5 sc&#233;narios de r&#233;servation d&#8217;h&#244;tel avec un
syst&#232;me de dialogue simul&#233; par un op&#233;rateur humain. Pour la campagne MEDIA-EC le corpus d&#8217;appren-
tissage disponible contient 814 dialogues, 11 800 &#233;nonc&#233;s utilisateurs et 38 800 segments s&#233;mantiques
dont 2 294 liens r&#233;f&#233;rentiels. Le corpus de test MEDIA-EC contient 174 dialogues pour 2 650 &#233;nonc&#233;s
utilisateurs et 7 780 segments dont 910 liens r&#233;f&#233;rentiels.
</p>
<p>Deux conditions de test sont organis&#233;es : la premi&#232;re (sansHC) consiste &#224; n&#8217;utiliser que les dialogues
transcrits, les erreurs de l&#8217;&#233;tiquetage hors-contexte se cumulant &#224; celles de l&#8217;&#233;tiquetage en-contexte. La
deuxi&#232;me condition (avecHC) consiste &#224; utiliser les dialogues avec leur annotation hors contexte.
</p>
<p>M&#233;thode d&#8217;&#233;valuation. L&#8217;&#233;valuation de la r&#233;solution de la r&#233;f&#233;rence s&#8217;effectue par comparaison des
traits s&#233;mantiques propos&#233;s pour chaque r&#233;f&#233;rent. Nous observons que pour d&#233;crire un r&#233;f&#233;rent, il faut
pr&#233;alablement l&#8217;avoir identifi&#233;. De m&#234;me, pour l&#8217;identifier, il faut pr&#233;alablement avoir rep&#233;r&#233; l&#8217;expression
r&#233;f&#233;rentielle. Comme ces t&#226;ches impliquent potentiellement des capacit&#233;s diff&#233;rentes, nous avons jug&#233;
int&#233;ressant d&#8217;&#233;valuer la r&#233;solution de la r&#233;f&#233;rence selon quatre niveaux, chacun donnant lieu &#224; des scores
de rappel, pr&#233;cision et f-mesure :
</p>
<p>4T&#233;l&#233;chargeable &#224; http://chasen.org/~taku/software/CRF++
</p>
<p>266</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution de la r&#233;f&#233;rence dans des dialogues homme-machine
</p>
<p>IER Capacit&#233; &#224; rep&#233;rer (ou identifier) les expressions r&#233;f&#233;rentielles. Il s&#8217;agit d&#8217;une capacit&#233; hors
contexte, qu&#8217;on &#233;value tout de m&#234;me car l&#8217;&#233;valuation de la r&#233;f&#233;rence en d&#233;pend.
</p>
<p>DER Capacit&#233; &#224; d&#233;crire les expressions r&#233;f&#233;rentielles identifi&#233;es, c&#8217;est-&#224;-dire, &#224; fournir les bons sp&#233;-
cifieurs (coRef, coDom, elsEns, mais aussi inclusion, exclusion et ambigu). Cette capacit&#233; est
&#233;valu&#233;e sur la base des expressions correctement rep&#233;r&#233;es en IER.
</p>
<p>IREF Capacit&#233; &#224; identifier les r&#233;f&#233;rents, c&#8217;est-&#224;-dire &#224; fournir pour chaque r&#233;f&#233;rent suffisamment de
traits corrects pour qu&#8217;il soit couplable avec un r&#233;f&#233;rent &#224; trouver. Comme la pr&#233;c&#233;dente, cette
capacit&#233; n&#8217;est &#233;valu&#233;e que sur les expressions r&#233;f&#233;rentielles correctement rep&#233;r&#233;es en IER.
</p>
<p>DREF Capacit&#233; &#224; d&#233;crire in extenso les r&#233;f&#233;rents. Cette &#233;valuation n&#8217;est calcul&#233;e que sur les r&#233;f&#233;rents
corrects en IREF.
</p>
<p>En proc&#233;dant ainsi par niveau, nous pouvons mieux appr&#233;cier les diff&#233;rentes capacit&#233;s qu&#8217;implique la
r&#233;solution de la r&#233;f&#233;rence. Nous notons qu&#8217;il est possible d&#8217;avoir un score global de rappel (resp. de
pr&#233;cision) en DREF, c&#8217;est-&#224;-dire le nombre de traits corrects fournis par un syst&#232;me rapport&#233; au nombre
de traits fournis par l&#8217;annotation manuelle (resp. fournis par le syst&#232;me), en multipliant les scores de
rappel (resp. de pr&#233;cision) obtenus en IER, IREF et DREF.
</p>
<p>Pour chaque niveau, nous avons d&#233;velopp&#233; les algorithmes suivants :
</p>
<p>IER Le but est d&#8217;aligner les traits lienRef sans s&#8217;appuyer ni sur leurs sp&#233;cifieurs (&#233;valu&#233;s en DER), ni
sur leur contenu r&#233;f&#233;rentiel (&#233;valu&#233; en IREF et DREF). Or, si l&#8217;on retire ces annotations, le trait
lienRef comporte trop peu d&#8217;information pour pouvoir effectuer l&#8217;alignement sans risque dans
le cas d&#8217;une omission ou d&#8217;une addition de lienRef. Nous effectuons donc un alignement des
lienRef sur la base des autres traits s&#233;mantiques qui sont dans l&#8217;intervalle. Nous avons adapt&#233;
l&#8217;algorithme de Levenshtein pour que le gain d&#8217;un appariement de lienRef soit proportionnel &#224; la
valeur d&#8217;appariement des traits (non r&#233;f&#233;rentiels) qui se trouvent entre un lienRef et le suivant5.
</p>
<p>DER Pour chaque couple de lienRef appari&#233;s selon le proc&#233;d&#233; ci-dessus, on calcule le nombre d&#8217;er-
reurs qui apparaissent lorsqu&#8217;on rajoute les modes et surtout les sp&#233;cifieurs.
</p>
<p>IREF Pour chaque couple de lienRef appari&#233;s en IER, on effectue un couplage maximal de poids
maximal entre r&#233;f&#233;rents hypoth&#232;se et r&#233;f&#233;rents de l&#8217;annotation manuelle. La matrice de couplage
donne un poids proportionnel aux nombres de traits partag&#233;s6.
</p>
<p>DREF Pour chaque couple de r&#233;f&#233;rents form&#233; en IREF, on effectue un couplage maximal entre traits.
En effet, il n&#8217;y a pas d&#8217;ordre prescrit pour d&#233;crire les r&#233;f&#233;rents.
</p>
<p>Evaluation de la qualit&#233; de l&#8217;annotation manuelle. L&#8217;annotation EC a fait l&#8217;objet de contr&#244;les
&#224; trois reprises. A chaque fois, une double annotation a &#233;t&#233; effectu&#233;e sur une dizaine de dialogues puis
&#233;valu&#233;e &#224; l&#8217;aide de l&#8217;outil de mesure pr&#233;sent&#233; plus haut. Cette &#233;valuation repose donc sur un &#233;chantillon
ne repr&#233;sentant que 4% du corpus d&#8217;apprentissage (31 dialogues sur 814).
</p>
<p>Les r&#233;sultats sont pr&#233;sent&#233;s dans le ta-
IAG Dialogues IER DER IREF DREF
1 10 24 (24) 24 (24) 23 (25) 23 (23)
2 10 29 (29) 27 (29) 32 (33) 72 (108)
3 11 27 (27) 25 (27) 34 (36) 135 (150)
</p>
<p>Total 31 80 (80) 76 (80) 89 (94) 230 (281)
100% 95% 95% 82%
</p>
<p>TAB. 2 &#8211; Accord inter-annotateurs
</p>
<p>bleau 2. L&#8217;accord inter-annotateurs est
globalement tr&#232;s bon, surtout dans les ni-
veaux sup&#233;rieurs (IER, DER et IREF).
Le score en DREF, plus faible que les
autres, traduit la difficult&#233; de fournir una-
nimement une description compl&#232;te des
r&#233;f&#233;rents.
</p>
<p>5Ce proc&#233;d&#233; &#233;vite aux syst&#232;mes de produire une double annotation (HC et EC), l&#8217;IER devant &#234;tre a priori
calcul&#233;e sur les lienRef corrects en HC et non sur l&#8217;annotation EC.
</p>
<p>6Il suffit donc qu&#8217;un r&#233;f&#233;rent ait un trait correct pour &#234;tre candidat. Pour &#234;tre plus pr&#233;cis, il faudrait ne conserver
que les traits permettant de discriminer un r&#233;f&#233;rent parmi les autres r&#233;f&#233;rents propos&#233;s.
</p>
<p>267</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre DENIS, Fr&#233;d&#233;ric B&#201;CHET, Matthieu QUIGNARD
</p>
<p>6 R&#233;sultats
</p>
<p>TAB. 3 &#8211; R&#233;sultats en pr&#233;cision et rappel de la t&#226;che de r&#233;solution des r&#233;f&#233;rences pour les
syst&#232;mes du LIA et du LORIA. L&#8217;accord est une f-mesure des scores de rappel d&#8217;un syst&#232;me
par rapport &#224; l&#8217;autre.
</p>
<p>LIA LORIA Accord
sansHC prec rappel prec rappel f-mes
DER 71.4 71.4 50.9 50.9 51.6
IREF 74.1 61.9 65.2 44.3 49.8
DREF 67.3 55.2 68.9 48.3 53.3
</p>
<p>LIA LORIA Accord
avecHC prec rappel prec rappel f-mes
DER 86.5 86.5 86.5 86.5 86.5
IREF 77.1 73.8 62.4 40.8 44.0
DREF 74.1 64.0 76.5 43.3 51.6
</p>
<p>Le tableau 3 pr&#233;sente les r&#233;sultats des syst&#232;mes du LIA et du LORIA pour les deux conditions du test :
sansHC et avecHC. En DER, le LORIA a un score m&#233;diocre dans la phase sansHC, qui s&#8217;am&#233;liore
consid&#233;rablement par la connaissance des traits HC. Pour l&#8217;identification des r&#233;f&#233;rents (IREF), le syst&#232;me
symbolique p&#232;che consid&#233;rablement en rappel, avec un score comparable dans les deux phases sansHC
et avecHC. Cela s&#8217;explique par le fait que l&#8217;annotation HC n&#8217;est pas utilis&#233;e pour la r&#233;solution de la
r&#233;f&#233;rence proprement dite et n&#8217;intervient que pour am&#233;liorer la description des r&#233;f&#233;rents lorsque ceux-ci
ont &#233;t&#233; identifi&#233;s. &#192; l&#8217;inverse le syst&#232;me statistique tire bien meilleure partie des informations hors-
contexte et parvient &#224; augmenter ses scores de rappel d&#8217;une dizaine de points sur les trois cat&#233;gories.
</p>
<p>Pour investiguer plus profond&#233;ment la compl&#233;mentarit&#233; des syst&#232;mes, nous les avons &#233;valu&#233;s l&#8217;un par
rapport &#224; l&#8217;autre. Les r&#233;sultats sont donn&#233;s dans la derni&#232;re colonne de chaque tableau. Il s&#8217;agit d&#8217;une
moyenne (f-mesure) des scores de rappel d&#8217;un syst&#232;me par rapport &#224; l&#8217;autre. Les scores ne sont ni vrai-
ment sup&#233;rieurs aux valeurs de chaque syst&#232;me, ni vraiment inf&#233;rieurs. Il semble donc que les syst&#232;mes
sont aussi distants entre eux que de l&#8217;annotation de r&#233;f&#233;rence. Ils ne produisent donc pas les m&#234;mes er-
reurs (l&#8217;accord n&#8217;augmente pas). De m&#234;me, leurs sorties ne sont pas fondamentalement compl&#233;mentaires
(l&#8217;accord reste du niveau du score de rappel le plus bas).
</p>
<p>Syst&#232;me LIA Les r&#233;sultats de la condition avecHC nous permettent de distinguer les erreurs dues
uniquement &#224; la sp&#233;cification du sens et &#224; la r&#233;solution des r&#233;f&#233;rences en contexte. L&#8217;&#233;tiquetage des liens
r&#233;f&#233;rentiels (DER) est correcte &#224; 86.5%. En ventilant ce r&#233;sultat par rapport au type de liens r&#233;f&#233;rentiels
(les sp&#233;cifieurs), on remarque que les r&#233;sultats sont tr&#232;s disparates : le taux d&#8217;&#233;tiquettes correctes atteint
95.2% pour les &#233;tiquettes lienRef sans sp&#233;cifieur qui repr&#233;sentent 57% des liens r&#233;f&#233;rentiels du corpus ;
il n&#8217;est que de 25% pour le sp&#233;cifieur ambigu, associ&#233; &#224; seulement 7.2% des liens du corpus. Cette faible
repr&#233;sentativit&#233; de certains ph&#233;nom&#232;nes pose probl&#232;me aux m&#233;thodes probabilistes qui ont besoin d&#8217;un
grand nombre d&#8217;exemples pour apprendre les mod&#232;les. L&#8217;identification des r&#233;f&#233;rents obtient des scores
de pr&#233;cision/rappel convenables &#233;tant donn&#233; la simplicit&#233; des heuristiques mises en &#339;uvre. Une analyse
plus fine nous montre &#233;galement que le syst&#232;me fait peu d&#8217;erreurs sur les r&#233;f&#233;rences directes, qui sont
aussi les plus nombreuses. Beaucoup d&#8217;erreurs se concentrent sur les liens ambigus et les liens contenant
le sp&#233;cifieur inclusion sont mieux trait&#233;s que l&#8217;exclusion. Enfin notons que pour la condition de test
sansHC la d&#233;gradation des r&#233;sultats est limit&#233;e (-3% de precision, -12% de rappel) sachant que le taux
d&#8217;erreur de l&#8217;annotation hors-contexte est de l&#8217;ordre de 20%. Ce dernier point souligne la robustesse de
l&#8217;approche.
</p>
<p>Syst&#232;me LORIA Le d&#233;pouillement des r&#233;sultats du LORIA s&#8217;appuie sur une classification des er-
reurs IREF. Le premier r&#233;sultat significatif est que 57% de nos erreurs proviennent de la r&#233;solution de
la r&#233;f&#233;rence, alors que les 43% restants sont issus d&#8217;erreurs ext&#233;rieures au module (projection hors-
contexte, construction de la forme s&#233;mantique, analyse syntaxique ou lexicale). Par exemple si l&#8217;analyse
</p>
<p>268</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution de la r&#233;f&#233;rence dans des dialogues homme-machine
</p>
<p>syntaxique oublie un h&#244;tel parmi trois h&#244;tels, le module de r&#233;f&#233;rence l&#8217;ignorera compl&#232;tement de telle
sorte que l&#8217;expression ult&#233;rieure &quot;ces trois h&#244;tels&quot; &#233;choue &#224; trouver trois h&#244;tels et ne retournera rien.
</p>
<p>Nous avons ensuite raffin&#233; les 57% d&#8217;erreurs de r&#233;f&#233;rence en vingt cat&#233;gories class&#233;es en deux groupes.
Nous distinguons les ph&#233;nom&#232;nes non pris en compte (35%) et les r&#233;elles erreurs, probl&#232;mes et bugs
(65%). Le premier groupe recouvre des cas complexes comme par exemple le g&#233;n&#233;rique &quot;la chambre&quot; en
anaphore associative qui est mal g&#233;r&#233; en cas d&#8217;ant&#233;c&#233;dent pluriel pour cause d&#8217;inconsistence logique. Le
second groupe d&#8217;erreurs correspond &#224; un fonctionnement anormal du module, par exemple rechercher
le r&#233;f&#233;rent avec des contraintes qui n&#8217;auraient pas lieu d&#8217;&#234;tre (comme dans &quot;je voudrais plus de d&#233;tails
sur les h&#244;tels&quot; o&#249; l&#8217;on recherche &quot;des h&#244;tels avec plus de d&#233;tails&quot;) ou encore une mauvaise structure
domaniale. Nous pouvons conclure de cette analyse que le mod&#232;le des domaines de r&#233;f&#233;rence est tr&#232;s fin
mais peu robuste. A la diff&#233;rence du syst&#232;me statistique du LIA tr&#232;s tol&#233;rant face aux erreurs, une erreur
en d&#233;but de dialogue peut entra&#238;ner ici une cascade d&#8217;erreurs.
</p>
<p>Les r&#233;sultats doivent cependant &#234;tre compris en consid&#233;rant la mesure d&#8217;&#233;valuation qui a &#233;t&#233; adopt&#233;e. En
effet cette derni&#232;re d&#233;finit l&#8217;identit&#233; de deux r&#233;f&#233;rents comme une identit&#233; de description, traduisant alors
mal le fait que deux r&#233;f&#233;rents peuvent &#234;tre diff&#233;rents tout en se ressemblant. Par exemple, le r&#233;f&#233;rent de
&quot;une chambre double &#224; l&#8217;h&#244;tel ibis paris&quot; et celui de &quot;une chambre double &#224; l&#8217;h&#244;tel lafayette paris&quot; sont
similaires &#224; 80% bien qu&#8217;ils repr&#233;sentent deux r&#233;f&#233;rents distincts. Le syst&#232;me du LIA est insensible au
fait qu&#8217;il s&#8217;agisse de deux r&#233;f&#233;rents puisqu&#8217;il s&#8217;appuie directement sur les traits s&#233;mantiques de bon type
dans le contexte ant&#233;rieur, alors que le syst&#232;me du LORIA qui construit une repr&#233;sentation structur&#233;e des
r&#233;f&#233;rents y est au contraire tr&#232;s sensible. Cette mesure ne permet alors d&#8217;&#233;valuer que les capacit&#233;s des-
criptives des r&#233;f&#233;rents, n&#233;cessaires dans un syst&#232;me de dialogue mais pas suffisantes. En effet la mesure
ne permet pas de comparer les capacit&#233;s r&#233;f&#233;rentielles pour lesquelles il est indispensable d&#8217;identifier
avec pr&#233;cision le r&#233;f&#233;rent (en l&#8217;occurrence ne pas r&#233;server une chambre dans le mauvais h&#244;tel). Afin de
consid&#233;rer ces capacit&#233;s, il est envisageable d&#8217;am&#233;liorer le couplage IREF pour qu&#8217;il ne couple que des
r&#233;f&#233;rents d&#233;crits par les m&#234;mes traits s&#8217;il s&#8217;agit d&#8217;entit&#233;s nomm&#233;es ou que des r&#233;f&#233;rents d&#233;crits par les
m&#234;mes traits discriminants s&#8217;il s&#8217;agit d&#8217;entit&#233;s non-nomm&#233;es (voir note 6).
</p>
<p>7 Conclusion et perspectives
</p>
<p>Cette &#233;tude pr&#233;sente la comparaison de deux approches tr&#232;s diff&#233;rentes pour r&#233;soudre le probl&#232;me dif-
ficile de la r&#233;solution des r&#233;f&#233;rences dans un contexte de dialogue. Les r&#233;sultats obtenus permettent de
mettre en avant les qualit&#233;s et d&#233;fauts des deux approches : bonne mod&#233;lisation de ph&#233;nom&#232;nes com-
plexes mais faible tol&#233;rance aux erreurs pour le syst&#232;me symbolique ; bonne int&#233;gration avec les mo-
dules de d&#233;codage de parole et d&#8217;&#233;tiquetage conceptuel mais mauvaise prise en compte des r&#233;f&#233;rences
complexes pour le syst&#232;me probabiliste. A l&#8217;examen d&#233;taill&#233; des r&#233;sultats, la t&#226;che de r&#233;solution des r&#233;-
f&#233;rences semble &#234;tre un domaine d&#8217;exp&#233;rimentation prometteur pour &#233;tudier l&#8217;int&#233;gration des approches
num&#233;riques et symboliques : en g&#233;n&#233;rant des listes d&#8217;hypoth&#232;ses valu&#233;es, un syst&#232;me probabiliste peut
&#234;tre utilis&#233; en entr&#233;e d&#8217;un syst&#232;me symbolique charg&#233; de v&#233;rifier la coh&#233;rence des hypoth&#232;ses g&#233;n&#233;r&#233;es,
en supprimer certaines, afin de fournir les analyses les plus probables au gestionnaire de dialogue.
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224; remercier chaleureusement les annotatrices, Christelle AYACHE et Anne KUHN, pour la
qualit&#233; de leur travail et leur participation enthousiaste et constructive &#224; la d&#233;finition du manuel d&#8217;anno-
tation. Nous tenons &#233;galement &#224; remercier les relecteurs pour la pertinence de leurs commentaires.
</p>
<p>269</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre DENIS, Fr&#233;d&#233;ric B&#201;CHET, Matthieu QUIGNARD
</p>
<p>R&#233;f&#233;rences
BONNEAU-MAYNARD H., AYACHE C., BECHET F., DENIS A., KUHN A., LEFEVRE F., MOSTEFA
D., QUIGNARD M., ROSSET S., SERVAN C. &amp; VILLANEAU J. (2006). Results of the French Evalda-
Media evaluation campaign for literal understanding. In LREC&#8217;06, Genoa.
</p>
<p>BONNEAU-MAYNARD H., ROSSET S., AYACHE C., KUHN A. &amp; MOSTEFA D. (2005). Semantic
annotation of the french media dialog corpus. In Proceedings of the European Conference on Speech
Communication and Technology (Eurospeech), Lisboa, Portugal.
</p>
<p>CHINCHOR N. &amp; HIRSCHMANN L. (1997). MUC-7 coreference task definition, version 3.0. In Actes
de MUC-7.
</p>
<p>CORBLIN F. (1987). Ind&#233;fini, D&#233;fini et D&#233;monstratif. Gen&#232;ve : Droz.
</p>
<p>DENIS A., PITEL G. &amp; QUIGNARD M. (2006a). A deep-parsing approach to natural language unders-
tanding in dialogue system : Results from a corpus-based evaluation. In LREC 2006, Genoa, Italy.
</p>
<p>DENIS A., PITEL G. &amp; QUIGNARD M. (2006b). Resolution of reference grouping in practical dia-
logues. In SIGDial 2006, Sydney, Australia.
</p>
<p>GROSZ B. &amp; SIDNER C. (1986). Attention, intention and the structure of discourse. Computational
Linguistics, 12, 175&#8211;204.
LAFFERTY J., MCCALLUM A. &amp; PEREIRA F. (2001). Conditional random fields : Probabilistic models
for segmenting and labeling sequence data. In Proc. 18th International Conf. on Machine Learning, p.
282&#8211;289 : Morgan Kaufmann, San Francisco, CA.
</p>
<p>LANDRAGIN F. &amp; ROMARY L. (2004). Dialogue history modelling for multimodal human-computer
interaction. In Eighth Workshop on the Semantics and Pragmatics of Dialogue (Catalog&#8217;04).
</p>
<p>MAYNARD H. &amp; DEVILLERS L. (2000). A framework for evaluating contextual understanding. In
Proceedings of the International Conference on Spoken Langage Processing (ICSLP), Beijing, Chine.
</p>
<p>POPESCU-BELIS A., RIGOUSTE L., SALMON-ALT S. &amp; ROMARY L. (2004). Online evaluation of
coreference resolution. In Proceedings of LREC 2004.
</p>
<p>REBOUL A., BALKANSKI C., BRIFFAULT X., GAIFFE B., POPESCU-BELIS A., ROBBA I., ROMARY
L. &amp; G. G. S. (1997). Le projet CERVICAL : Repr&#233;sentations mentales, r&#233;f&#233;rence aux objets et aux
&#233;v&#233;nements. Rapport interne, Loria-CNRS/Limsi, France.
</p>
<p>REBOUL A. &amp; GAIFFE B. (1999). Repr&#233;sentations mentales et r&#233;f&#233;rence.
</p>
<p>REBOUL A. &amp; MOESCHLER J. (1994). Dictionnaire encyclop&#233;dique de la pragmatique. Editions du
Seuil.
</p>
<p>SALMON-ALT S. (2001). R&#233;f&#233;rence et Dialogue finalis&#233; : de la linguistique &#224; un mod&#232;le op&#233;rationnel.
PhD thesis, Universit&#233; Henri Poincar&#233;, Nancy.
</p>
<p>SALMON-ALT S. &amp; ROMARY L. (2004). Towards a reference annotation framework. In Proceedings
of LREC 2004.
</p>
<p>SERVAN C. &amp; BECHET F. (2006). D&#233;codage conceptuel et apprentissage automatique : application au
corpus de dialogue homme-machine media. In TALN, Leuven.
</p>
<p>VAN DEEMTER K. &amp; KIBBLE R. (2000). On coreferring : Coreference in MUC and related annotation
schemes. Computational Linguistics, 26(4), 629&#8211;637.
</p>
<p>270</p>

</div></div>
</body></html>