<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Enrichissement d&#8217;un lexique bilingue par analogie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Enrichissement d&#8217;un lexique bilingue par analogie
</p>
<p>Philippe LANGLAIS, Alexandre PATRY
Universit&#233; de Montr&#233;al
</p>
<p>CP. 6128 succursale centre-ville
{felipe,patryale}@iro.umontreal.ca
</p>
<p>R&#233;sum&#233;. La pr&#233;sence de mots inconnus dans les applications langagi&#232;res repr&#233;sente un
d&#233;fi de taille bien connu auquel n&#8217;&#233;chappe pas la traduction automatique. Les syst&#232;mes profes-
sionnels de traduction offrent &#224; cet effet &#224; leurs utilisateurs la possibilit&#233; d&#8217;enrichir un lexique de
base avec de nouvelles entr&#233;es. R&#233;cemment, Stroppa et Yvon (2005) d&#233;montraient l&#8217;int&#233;r&#234;t du
raisonnement par analogie pour l&#8217;analyse morphologique d&#8217;une langue. Dans cette &#233;tude, nous
montrons que le raisonnement par analogie offre &#233;galement une r&#233;ponse adapt&#233;e au probl&#232;me
de la traduction d&#8217;entr&#233;es lexicales inconnues.
</p>
<p>Abstract. Unknown words are a well-known hindrance to natural language applications.
In particular, they drastically impact machine translation quality. An easy way out commercial
translation systems usually offer their users is the possibility to add unknown words and their
translations into a dedicated lexicon. Recently, Stroppa et Yvon (2005) shown how analogical
learning alone deals nicely with morphology in different languages. In this study we show that
analogical learning offers as well an elegant and efficient solution to the problem of identifying
potential translations of unknown words.
</p>
<p>Mots-cl&#233;s : analogie formelle, enrichissement de lexiques bilingues, traduction automa-
tique.
</p>
<p>Keywords: formal analogy, bilingual lexicon projection, machine translation.
</p>
<p>1 Introduction
</p>
<p>Le raisonnement par analogie est un principe bien connu en sciences cognitives et en intelli-
gence artificielle (Gentner et al., 2001). L&#8217;aptitude &#224; raisonner par analogie a longtemps fait
l&#8217;objet de questions dans les tests SAT (Scholastic Assessment Test) aux &#201;tats-Unis1. Turney et
Littman (2005) d&#233;crivent une approche bas&#233;e sur le mod&#232;le de l&#8217;espace vectoriel populaire en
recherche d&#8217;information qui permet de r&#233;pondre &#224; 47% de 374 questions typiquement pos&#233;es
dans ces tests.
</p>
<p>On trouve dans (Lepage, 2003) un traitement particuli&#232;rement riche du r&#244;le de l&#8217;analogie dans la
langue, tant d&#8217;un point de vue formel, algorithmique qu&#8217;historique. L&#8217;auteur d&#233;crit diff&#233;rentes
exp&#233;riences, notamment en analyse morphologique, qui attestent du bien-fond&#233; applicatif de
</p>
<p>1Les tests SAT introduits en 1926 aux &#201;tats-unis incluaient des tests analogiques qui ont &#233;t&#233; retir&#233;s en 2005
(http://www.collegeboard.com/about/newstat/newstat.html).
</p>
<p>101</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe LANGLAIS, Alexandre PATRY
</p>
<p>l&#8217;analogie. Des principes d&#233;gag&#233;s dans ce travail, Lepage et Denoual (2005) pr&#233;sentaient r&#233;-
cemment le syst&#232;me ALEPH, un syst&#232;me de traduction par l&#8217;exemple enti&#232;rement bas&#233; sur le
principe de r&#233;solution d&#8217;analogies formelles. Une analogie formelle met en relation quatre en-
tit&#233;s, ce que l&#8217;on d&#233;note [A : B = C : D] et qui se lit: &#8220;A est &#224; B ce que C est &#224; D&#8221;. Ce syst&#232;me
d&#8217;une &#233;l&#233;gance remarquable2 montrait des performances &#233;tat-de-l&#8217;art dans les t&#226;ches partag&#233;es
organis&#233;es en marge des ateliers IWSLT3.
</p>
<p>Stroppa et Yvon (2005) proposent une formalisation alg&#233;brique &#224; la fois concise et accessible
de l&#8217;analogie formelle et d&#233;crivent les fondements th&#233;oriques de l&#8217;apprentissage analogique. Ils
d&#233;montrent exp&#233;rimentalement l&#8217;&#233;l&#233;gance et la puissance de cette approche dans deux t&#226;ches
d&#8217;&#233;tiquetage morphologique ; la premi&#232;re consistait &#224; &#233;tiqueter morpho-syntaxiquement &#224; l&#8217;aide
d&#8217;un jeu d&#8217;&#233;tiquettes fines les mots inconnus d&#8217;une langue ; la seconde visait &#224; pr&#233;dire l&#8217;arbre
d&#8217;analyse morphologique d&#8217;un lemme inconnu (lire &#233;galement (Yvon et al., 2004)).
</p>
<p>D&#8217;autres auteurs se sont int&#233;ress&#233;s ces derni&#232;res ann&#233;es au potentiel applicatif des analogies for-
melles. Claveau et L&#8217;Homme (2005) montraient notamment qu&#8217;un type particulier d&#8217;analogies
formelles tr&#232;s simples &#224; calculer permettait de structurer les termes d&#8217;un domaine. Moreau et
Claveau (2006) montrent &#233;galement le b&#233;n&#233;fice du raisonnement par analogie pour l&#8217;extension
de requ&#234;tes dans un syst&#232;me monolingue de recherche d&#8217;information.
</p>
<p>Dans cette &#233;tude, nous montrons que le raisonnement par analogie offre &#233;galement une r&#233;ponse
ad&#233;quate au probl&#232;me concret de la traduction d&#8217;entr&#233;es lexicales inconnues. Nous rappelons
en section 2 le principe g&#233;n&#233;ral de l&#8217;apprentissage analogique. Nous pr&#233;sentons en section 3
comment il peut &#234;tre appliqu&#233; &#224; la t&#226;che d&#8217;enrichissement d&#8217;un lexique bilingue. Nous &#233;valuons
notre approche en section 4 en la comparant &#224; deux syst&#232;mes de base. Nous montrons que notre
approche permet de traduire automatiquement 60% des mots inconnus d&#8217;une application. Nous
dressons en section 5 un bilan de ce travail, et proposons des perspectives de recherche.
</p>
<p>2 Raisonnement analogique
</p>
<p>2.1 Apprentissage analogique
</p>
<p>L&#8217;approche mise en place dans cette &#233;tude pour l&#8217;enrichissement de lexiques bilingues s&#8217;inscrit
dans le cadre th&#233;orique de l&#8217;apprentissage par analogie propos&#233; dans (Stroppa &amp; Yvon, 2005).
Un ensemble d&#8217;apprentissage L = {L1, . . . , LN} est compos&#233; deN observations. Un ensemble
de traits calcul&#233;s sur une observation incompl&#232;te X d&#233;finit un espace d&#8217;entr&#233;e. La t&#226;che d&#8217;inf&#233;-
rence consiste &#224; pr&#233;dire les traits manquants deX qui d&#233;finissent &#224; leur tour un espace de sortie.
On d&#233;signe par I(X) et O(X) les projections respectives dans l&#8217;espace d&#8217;entr&#233;e et de sortie de
l&#8217;observation X . La proc&#233;dure d&#8217;inf&#233;rence met en &#339;uvre trois &#233;tapes:
</p>
<p>1. construire EI(X) = {(A,B,C) &#8712; L3 | [I(A) : I(B) = I(C) : I(X)]}, l&#8217;ensemble de
triplets analogiques de X , &#233;galement d&#233;nomm&#233;s stems dans la suite
</p>
<p>2. construire EO(X) = {Y | [O(A) : O(B) = O(C) : Y] ,&#8704;(A,B,C) &#8712; EI(X)} l&#8217;en-
semble des solutions trouv&#233;es aux &#233;quations analogiques form&#233;es par projection des tri-
plets analogiques de X dans l&#8217;espace de sortie.
</p>
<p>3. choisir O(X) parmi les &#233;l&#233;ments de EO(X)
2Ce syst&#232;me ne fait appel &#224; aucune distance ni &#224; aucun seuil pour rapprocher diff&#233;rents exemples.
3http://www.slc.atr.jp
</p>
<p>102</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Enrichissement d&#8217;un lexique bilingue par analogie
</p>
<p>Cette proc&#233;dure d&#8217;inf&#233;rence partage les avantages et les inconv&#233;nients de l&#8217;approche des k plus
proches voisins (k-ppv). Il s&#8217;agit en effet d&#8217;une approche d&#8217;apprentissage passive qui n&#8217;effectue
aucune g&#233;n&#233;ralisation &#224; partir du corpus d&#8217;entra&#238;nement qui doit donc &#234;tre conserv&#233;. Contrai-
rement au k-ppv, l&#8217;&#233;tape 1 de recherche des exemples &#8220;proches&#8221; ne requiert pas la d&#233;finition
d&#8217;une distance entre deux exemples mais &#233;merge du seul principe de commutation linguistique
(Lepage, 2003). Cette puret&#233; a un co&#251;t: la recherche d&#8217;exemples proches est une op&#233;ration de
complexit&#233; cubique en N , le nombre d&#8217;exemples dans L, alors qu&#8217;elle est seulement lin&#233;aire
en N dans le cas des k-ppv. Dans de nombreuses applications incluant celle pr&#233;sent&#233;e dans
cette &#233;tude, cette recherche est trop co&#251;teuse pour &#234;tre effectu&#233;e au complet et des heuristiques
doivent &#234;tre appliqu&#233;es pour r&#233;duire l&#8217;espace de recherche (voir section 3.2).
</p>
<p>Le succ&#232;s de l&#8217;approche repose presque enti&#232;rement sur le concept d&#8217;&#233;quation analogique que
nous d&#233;crivons ci-apr&#232;s ainsi que sur l&#8217;hypoth&#232;se qu&#8217;il existe une correspondance entre les
analogies construites sur l&#8217;espace d&#8217;entr&#233;e et leur projection dans l&#8217;espace de sortie.
</p>
<p>2.2 &#201;quation analogique
</p>
<p>Diff&#233;rents niveaux paradigmatiques peuvent unir quatre objets en relation analogique. Ainsi
des relations d&#8217;ordre s&#233;mantique comme celles utilis&#233;es dans les tests SAT peuvent &#234;tre d&#233;-
crites: [hache : b&#251;cheron = roulette : dentiste] et [aluminium : metal =
novel : book]. Des analogies dites formelles avec lesquelles nous travaillons dans cette &#233;tude
d&#233;notent des relations graphiques entre les formes mises en relation. [fournit : fleurit =
fournie : fleurie] et [abandoning : abandonment = amending : amendment]
sont deux exemples (l&#8217;un en fran&#231;ais, l&#8217;autre en anglais) de relations de nature morphologique.
Le lecteur int&#233;ress&#233; trouvera dans (Lepage, 2003) de nombreux exemples de relations ana-
logiques dans des langues tr&#232;s diff&#233;rentes. L&#8217;&#233;quation analogique [A : B = C : ?] d&#233;note
l&#8217;ensemble des formes qui sont en relation analogique avec le triplet (ou stem) &#12296;A,B,C&#12297;:
</p>
<p>[A : B = C : ?] = {X | [A : B = C : X]}
</p>
<p>Stroppa et Yvon (2005) montrent qu&#8217;il est possible de calculer les solutions d&#8217;une &#233;quation ana-
logique formelle &#224; l&#8217;aide d&#8217;un transducteur &#224; &#233;tats finis. Cette approche g&#233;n&#233;ralise l&#8217;algorithme
propos&#233; initialement par Lepage (1998) qui r&#233;side dans la synchronisation de deux tables d&#8217;&#233;di-
tions: l&#8217;une entre A et B, l&#8217;autre entre A et C. Intuitivement, cet algorithme compose dans le
bon ordre les sous-s&#233;quences de B et de C qui ne sont pas dans A.
</p>
<p>Dans ce travail, nous avons impl&#233;ment&#233; une variante de cet algorithme qui calcule premi&#232;rement
les deux tables d&#8217;&#233;dition4 (op&#233;ration de complexit&#233; quadratique avec la longueur, compt&#233;e en
caract&#232;res, des cha&#238;nes en pr&#233;sence), puis qui synchronise ensuite les deux tables (op&#233;ration de
complexit&#233; lin&#233;aire) pour tout chemin d&#8217;&#233;dition minimal de chaque table. Comme le nombre
de chemins d&#8217;&#233;dition de co&#251;t minimal peut &#234;tre exponentiel, nous consid&#233;rons au plus les M
premiers chemins de chaque table (dans nos exp&#233;riences,M a &#233;t&#233; fix&#233; exp&#233;rimentalement &#224; la
valeur non critique de 20) et un total deM2 paires de chemins est donc au plus synchronis&#233;.
</p>
<p>Il est important de noter qu&#8217;une &#233;quation peut admettre z&#233;ro, une ou plusieurs solutions qui
ne sont pas n&#233;cessairement des formes l&#233;gitimes de la langue &#233;tudi&#233;e. L&#8217;&#233;quation [fournir :
fourniront = courir : ?] a par exemple pour solution couriront.
</p>
<p>4Les co&#251;ts des op&#233;rations sont unitaires &#224; l&#8217;exception de l&#8217;op&#233;ration d&#8217;insertion qui est de co&#251;t nul, pr&#233;cis&#233;ment
car les caract&#232;res de B et C &#8220;ins&#233;r&#233;s&#8221; sont ceux que nous d&#233;sirons conserver dans les solutions.
</p>
<p>103</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe LANGLAIS, Alexandre PATRY
</p>
<p>3 Application &#224; l&#8217;enrichissement d&#8217;un lexique bilingue
</p>
<p>Les principes d&#233;crits dans la section pr&#233;c&#233;dente peuvent &#234;tre appliqu&#233;s au probl&#232;me de l&#8217;enri-
chissement d&#8217;un lexique bilingue. Cette op&#233;ration qui consiste &#224; &#233;tendre un lexique existant &#224;
de nouvelles entr&#233;es pr&#233;sente de nombreux int&#233;r&#234;ts pratiques, notamment dans le cas de paires
de langues faiblement dot&#233;es. La couverture d&#8217;un lexique, aussi grande soit-elle, n&#8217;est pas ga-
rante de son utilit&#233;. Ainsi, m&#234;me pour une paire de langues largement dot&#233;e comme le fran&#231;ais
et l&#8217;anglais, n&#8217;existe-t-il pas de lexique bilingue couvrant les termes de tous les domaines de
sp&#233;cialit&#233;. Ceci justifie l&#8217;int&#233;r&#234;t de travaux visant &#224; apprendre automatiquement &#224; traduire les
termes sp&#233;cifiques comme ceux du domaine m&#233;dical (Claveau &amp; Zweigenbaum, 2005).
</p>
<p>3.1 Approche
</p>
<p>Notre approche peut-&#234;tre illustr&#233;e sur un exemple simple. Pour chercher la traduction du mot
inconnu futilit&#233;, nous identifions des relations analogiques dans la langue source comme:
[activit&#233;s : activit&#233; = futilit&#233;s : futilit&#233;]. Nous projetons (par une op&#233;ration
d&#233;finie plus loin) ces relations en langue cible de mani&#232;re &#224; d&#233;finir des &#233;quations analogiques
(cibles) comme: [actions : action = gimmicks : ?] dont gimmick est une solution.
</p>
<p>Formellement, nous disposons d&#8217;un corpus d&#8217;apprentissage L = {&#12296;S1, T1&#12297;, . . . , &#12296;SN , TN&#12297;} qui
r&#233;unit des paires de mots en relation de traduction. L&#8217;espace d&#8217;entr&#233;e est l&#8217;ensemble des mots
de la langue source, l&#8217;espace de sortie celui des mots de la langue cible ; et on d&#233;finit5:
</p>
<p>&#8704;X &#8801; &#12296;S,T&#12297;, I(X) = S et O(X) = T
</p>
<p>L&#8217;enrichissement de L consiste pour toute forme source S inconnue de l&#8217;espace d&#8217;entr&#233;e &#224;
identifier les triplets analogiques sources qui entrent en &#233;quation analogique avec S:
</p>
<p>EI(S) = {&#12296;i,j,k&#12297;,&#8712; [1, N ]3 | Si &amp;= Sj &amp;= Sk et [Si : Sj = Sk : S]}
</p>
<p>Chaque &#233;l&#233;ment de EI(S) est ensuite projet&#233; dans l&#8217;espace de sortie &#224; l&#8217;aide de l&#8217;op&#233;rateur
projL et les solutions calcul&#233;es dans cet espace sont collig&#233;es dans EO(S):
</p>
<p>EO(S) =
&#8899;
</p>
<p>&#12296;i,j,k&#12297;&#8712;EI(S)
E&#12296;i,j,k&#12297;(S)
</p>
<p>o&#249;:
</p>
<p>E&#12296;i,j,k&#12297;(S) = {T | [U : V = W : T ],&#8704;(U, V,W ) &#8712; (projL(Si)&#215; projL(Sj)&#215; projL(Sk))}
</p>
<p>Le m&#233;canisme de projection que nous utilisons consiste &#224; simplement &#224; retourner pour une
entr&#233;e source S du lexique bilingue les associations cibles (ou traductions) qui lui correspondent
(une entr&#233;e S poss&#232;de potentiellement plusieurs traductions dans L):
</p>
<p>projL(S) = {T | &#12296;S, T &#12297; &#8712; L}
5Par exemple, pour l&#8217;observation X = &#12296;d&#233;j&#224;,already&#12297;, I(X) = d&#233;j&#224; et O(X) = already.
</p>
<p>104</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Enrichissement d&#8217;un lexique bilingue par analogie
</p>
<p>3.2 Impl&#233;mentation
</p>
<p>Trouver l&#8217;ensemble des triplets analogiques de S est une op&#233;ration trop co&#251;teuse en temps
(cubique avec la taille de l&#8217;espace d&#8217;entr&#233;e). Nous utilisons deux techniques pour r&#233;duire cette
complexit&#233;. La premi&#232;re consiste &#224; utiliser les &#233;quations analogiques en mode g&#233;n&#233;ratif: plut&#244;t
que de v&#233;rifier tous les triplets &#12296;Si, Sj, Sk&#12297; entretenant une relation analogique avec S, nous
cherchons les solutions &#224; [Sj : Si = S :?]. Il s&#8217;agit d&#8217;une m&#233;thode exacte qui repose sur la
propri&#233;t&#233; (Lepage, 2003):
</p>
<p>[A : B = C : D] &#8801; [B : A = D : C]
Cette m&#233;thode, qui r&#233;duit la construction de EI(S) &#224; une op&#233;ration de complexit&#233; quadratique,
est encore trop co&#251;teuse. Nous appliquons donc une seconde m&#233;thode, cette fois-ci heuristique,
qui consiste &#224; ne calculer les &#233;quations analogiques que sur les seuls mots proches de S ; for-
mellement, nous construisons EI(S) selon (&#233;tape 1):
</p>
<p>EI(S) = {U | [A : B = S : U ] ,&#8704;A &#8712; v&#948;(S) et B &#8712; v&#946;(A)}
o&#249; v&#947;(A) est une fonction de voisinage d&#8217;une lexie A de la forme:
</p>
<p>v&#947;(A) = {B | f(B,A) &#8804; &#947;}
</p>
<p>Dans cette &#233;tude, nous avons utilis&#233; pour fonction f la distance d&#8217;&#233;dition (Levenshtein, 1966)6.
</p>
<p>Nous avons mentionn&#233; qu&#8217;une &#233;quation analogique peut g&#233;n&#233;rer plusieurs solutions, certaines
n&#8217;&#233;tant pas des formes l&#233;gitimes d&#8217;une langue. Aussi, l&#8217;&#233;tape 3 du processus d&#8217;inf&#233;rence
consiste dans notre cas &#224; s&#233;lectionner les solutions analogiques les plus fr&#233;quemment g&#233;n&#233;-
r&#233;es et &#224; ne retenir que celles qui sont pr&#233;sentes dans un (grand) lexique monolingue cible
V . Nous avons compil&#233; &#224; cet effet &#224; partir de textes vari&#233;s un lexique monolingue totalisant
466 439 formes diff&#233;rentes. Des exemples de traductions produites par analogie sont pr&#233;sent&#233;s
en Table 1.
</p>
<p>4 Exp&#233;riences
</p>
<p>Nous avons r&#233;alis&#233; nos exp&#233;riences dans le cadre de la campagne d&#8217;&#233;valuation des syst&#232;mes de
traduction qui s&#8217;est tenue lors de l&#8217;atelier WMT&#8217;06 (Koehn &amp; Monz, 2006). Dans cette t&#226;che,
les corpus d&#8217;entra&#238;nement et de test &#233;taient constitu&#233;s de textes parlementaires europ&#233;ens. &#192;
l&#8217;insu des &#233;quipes participantes, les organisateurs ont ajout&#233; aux 2 000 phrases du corpus de
test (corpus domaine dans la suite), 1064 phrases7 hors-domaine en provenance du site in-
ternet de Project Syndicate (http://www.project-syndicate.com), une or-
ganisation sans but lucratif qui distribue des articles de revue sur des th&#232;mes vari&#233;s (politique,
&#233;conomie, science, etc.). Ce corpus est baptis&#233; hors-domaine dans la suite.
</p>
<p>Nos exp&#233;rimentations simulent une situation typique du d&#233;veloppement d&#8217;un syst&#232;me de tra-
duction bas&#233; sur l&#8217;exemple: nous disposons d&#8217;un corpus d&#8217;entra&#238;nement bilingue sur lequel est
</p>
<p>6Le lecteur attentif aura not&#233; que nous avons plus haut (section 2.1) soulign&#233; que contrairement &#224; l&#8217;approche des
K plus proches voisins, le raisonnement par analogie ne requiert pas de distance. La distance que nous utilisons ici
n&#8217;est pas constitutive de l&#8217;approche (comme c&#8217;est le cas dans les k-ppv) mais r&#233;pond seulement &#224; des consid&#233;rations
pratiques: nous pourrions par exemple nous en affranchir en tirant al&#233;atoirement des triplets dans l&#8217;espace d&#8217;entr&#233;e.
</p>
<p>730 de ces phrases contenaient des probl&#232;mes d&#8217;encodage et ont &#233;t&#233; retir&#233;es de notre &#233;tude.
</p>
<p>105</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe LANGLAIS, Alexandre PATRY
</p>
<p>source cand nb (candidat, fr&#233;quence)
</p>
<p>anti-agricole 296 5 (anti-farm,5) (anti-agricultural,3) (anti-farming,3) (anti-
rural,3) (anti-farmer,3)
</p>
<p>concentrerait 2947 7 (concentrat,11) (concentrate,4) (summarized,4) (summari-
zing,4) (concentrating,3) (focuss,3) (focus,3)
</p>
<p>&#233;crirait 156 4 (writs,1) (write,1) (writes,1) (writ,1)
r&#233;int&#233;gr&#233;s 2686 18 (reinstated,20) (reintegrated,17) (re-integrated,13) (re-
</p>
<p>entered,10) (reincluded,8) (reinvolved,8) (reincorporated,8)
(reinserted,7) (reinstate,7) (reintegrate,6) (reinstating,4) (ac-
complished,3) (rebuilt,3) (reinclude,3) (rejoined,3) (reverte,2)
(reintegration,2) (reintegrating,2)
</p>
<p>galette 218 1 (pancake,13)
</p>
<p>TAB. 1 &#8211; Exemples de traductions obtenues par projection &#224; partir de L100 000. cand indique le
nombre de solutions analogiques cibles g&#233;n&#233;r&#233;es, nb indique les traductions candidates retenues
une fois valid&#233;es par le lexique V . Les traductions en gras sont clairement erron&#233;es.
</p>
<p>appris un lexique bilingue (probabiliste dans notre cas). Nous disposons de plus d&#8217;une (grande)
collection de textes en langue cible que nous avons utilis&#233;e ici pour compiler le lexique mono-
lingue cible V (voir la section 3.2). Afin de bien analyser les limites de l&#8217;approche, nous nous
sommes concentr&#233;s sur la paire de langues fran&#231;ais-anglais qui nous est famili&#232;re8. Notre but
est de pr&#233;dire des traductions anglaises de termes fran&#231;ais inconnus du corpus d&#8217;entra&#238;nement.
Nous avons &#233;limin&#233; de notre &#233;tude les formes num&#233;riques (nous pouvons les traiter de mani&#232;re
simple).
</p>
<p>4.1 &#201;valuation automatique
</p>
<p>&#201;valuer la qualit&#233; de diff&#233;rentes variantes de notre approche n&#233;cessite le parcours de plusieurs
listes de traductions. En plus de s&#8217;av&#233;rer fastidieuse, cette entreprise s&#8217;av&#232;re d&#233;licate: beaucoup
de traductions produites ne sont valides que dans certains contextes seulement. Il suffit pour
cela de consulter les exemples de la Table 1 pour s&#8217;apercevoir de la difficult&#233; de la t&#226;che.
</p>
<p>Nous avons donc, dans un premier temps, proc&#233;d&#233; &#224; une &#233;valuation automatique o&#249; un lexique
bilingue de r&#233;f&#233;rence est utilis&#233;. Ce lexique, d&#233;nomm&#233; Lref , est obtenu par entra&#238;nement sur
le corpus au complet de WMT&#8217;06 (688 000 paires de phrases) d&#8217;un mod&#232;le statistique obtenu
&#224; l&#8217;aide de la trousse &#224; outils GIZA++ (Och &amp; Ney, 2000)9. De la m&#234;me mani&#232;re, nous avons
entra&#238;n&#233; des mod&#232;les lexicauxLT sur diff&#233;rentes tranches du corpus d&#8217;entra&#238;nement (T = 5 000,
10 000, 100 000, 200 000 et 500 000 paires de phrases). Nous avons alors traduit &#224; l&#8217;aide du
raisonnement analogique les mots fran&#231;ais du corpus de test de WMT&#8217;06 qui n&#8217;&#233;taient pas
pr&#233;sents dans les lexiques LT mais pr&#233;sents dans le lexique de r&#233;f&#233;rence Lref . Une traduction
candidate est consid&#233;r&#233;e correcte si elle est valid&#233;e par Lref .
&#192; des fins de comparaison, deux approches de base (baseline) ont &#233;t&#233; test&#233;es sur la m&#234;me
</p>
<p>8Des r&#233;sultats similaires sont observ&#233;s pour la paire de langues espagnol-anglais.
9En pratique, pour &#233;liminer une partie du bruit d&#8217;un lexique appris automatiquement, nous le croisons (in-
</p>
<p>tersection) avec un lexique r&#233;sultant de l&#8217;entra&#238;nement d&#8217;un mod&#232;le lexical entra&#238;n&#233; dans la direction oppos&#233;e
(anglais-fran&#231;ais versus fran&#231;ais-anglais).
</p>
<p>106</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Enrichissement d&#8217;un lexique bilingue par analogie
</p>
<p>t&#226;che dans les m&#234;mes conditions. La premi&#232;re approche (BASE1) consiste &#224; proposer comme
traduction d&#8217;un mot source inconnu, les mots cibles les plus similaires (au sens de la distance
d&#8217;&#233;dition). Cette approche marchera d&#8217;autant mieux que les langues sont proches (ex. docteur
&#8594; doctor). La deuxi&#232;me approche (BASE2) ressemble davantage &#224; l&#8217;approche analogique et
consiste &#224; identifier les formes sources connues du lexique LT qui sont proches du mot inconnu,
puis &#224; proposer leurs traductions telles qu&#8217;indiqu&#233;es par ce lexique (ex. demanda&#8594; demande&#8594;
request). Chacune de ces approches est test&#233;e selon deux variantes. La premi&#232;re (id) propose le
m&#234;me nombre de traductions que l&#8217;a sugg&#233;r&#233; l&#8217;approche ANALOG dans les m&#234;mes conditions
(les approches sont donc directement comparables) ; la seconde (10) propose dix traductions
pour chaque mot inconnu.
</p>
<p>T 5 000 10 000 50 000 100 000 200 000 500 000
p% r% p% r% p% r% p% r% p% r% p% r%
</p>
<p>domaine
ANALOG 50.8 30.7 54.4 44.3 57.9 63.9 57.0 63.8 57.7 64.4 30.4 67.6
BASE1id 31.6 30.7 32.3 44.3 24.7 63.9 20.3 63.8 20.9 64.4 8.7 67.6
BASE2id 34.5 30.7 37.1 44.3 39.0 63.9 37.8 63.8 34.4 64.4 56.5 67.6
BASE110 26.7 100.0 28.3 100.0 23.9 100.0 20.0 100.0 16.6 100.0 11.8 100.0
BASE210 26.3 100.0 30.8 100.0 29.3 100.0 27.6 100.0 24.9 100.0 55.9 100.0
unk [3 171 , 6.8] [2 245 , 6.1] [754 , 3.7] [456 , 2.8] [253 , 2.0] [34 , 1.2]
</p>
<p>hors-domaine
ANALOG 52.4 28.9 54.4 42.4 51.7 68.0 53.6 73.4 55.3 79.2 43.9 86.8
BASE1id 28.0 28.9 29.0 42.4 27.3 68.0 23.1 73.4 26.8 79.2 22.7 86.8
BASE2id 32.9 28.9 35.0 42.4 32.5 68.0 35.9 73.4 40.8 79.2 59.1 86.8
BASE110 24.7 100.0 25.9 100.0 25.1 100.0 20.9 100.0 25.2 100.0 25.0 100.0
BASE210 21.7 100.0 26.4 100.0 27.2 100.0 29.4 100.0 33.6 100.0 57.9 100.0
unk [2 270 , 6.2] [1 701 , 5.5] [621 , 3.2] [402 , 2.4] [226 , 1.7] [76 , 1.3]
</p>
<p>TAB. 2 &#8211; R&#233;sultats de diff&#233;rentes m&#233;thodes d&#8217;extension de lexique en fonction de la taille du
lexique &#224; &#233;tendre (ligne du haut). Les lignes pr&#233;fix&#233;es de unk indiquent le nombre de mots &#224;
traduire ainsi que le nombre moyen de traductions dans Lref .
</p>
<p>Les r&#233;sultats de cette &#233;valuation automatique sont consign&#233;s en Table 2 en fonction de la taille
du lexique utilis&#233; pour la projection. Deux mesures sont rapport&#233;es: p% repr&#233;sente le pourcen-
tage d&#8217;entr&#233;es inconnues ayant au moins une traduction valide ; r% indique le pourcentage de
mots traduits. La premi&#232;re ligne de cette table indique par exemple que sur le corpus de test
domaine, notre approche (ANALOG) propose au moins une traduction pour 30.7% des mots
du corpus de test du domaine qui sont inconnus du lexique L5000. La moiti&#233; (50.8%) de ces
entr&#233;es &#233;tendues contiennent une traduction valide (selon Lref ).
La Table 2 appelle plusieurs commentaires. Il convient tout d&#8217;abord de garder &#224; l&#8217;esprit que
ce que nous mesurons ici est davantage l&#8217;aptitude d&#8217;une approche &#224; reconstruire un lexique de
r&#233;f&#233;rence &#224; partir d&#8217;un lexique de base. Nous ne mesurons par exemple pas ici les traductions
produites pour les mots inconnus du lexique de r&#233;f&#233;rence. Globalement, les performances de
ANALOG augmentent avec la taille du lexique de base. Ceci est normal car plus ce lexique est
grand, plus il contient de formes sources qui peuvent entrer en relation analogique avec un mot
inconnu et plus les traductions de ces mots sont nombreuses, ce qui permet de cr&#233;er davantage
de relations analogiques dans la langue cible. Les mesures faites &#224; l&#8217;aide du lexique L500 000
</p>
<p>107</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe LANGLAIS, Alexandre PATRY
</p>
<p>sont certainement peu fiables: seulement 34 et 76 entr&#233;es sont en effet &#233;valu&#233;es sur le jeu de
test domaine et hors-domaine respectivement. On remarque &#233;galement que les approches
BASE1 et BASE2 sont inf&#233;rieures en qualit&#233; &#224; l&#8217;approche ANALOG (BASE1 est sans surprise la
moins bonne des trois). Il est possible avec les approches de proximit&#233; d&#8217;obtenir un taux de
traduction r% parfait, au prix d&#8217;une d&#233;t&#233;rioration de la qualit&#233; des traduction produites, ce qui
sugg&#232;re qu&#8217;une combinaison des deux approches (comme par exemple &#233;couter BASE2 lorsque
ANALOG est silencieuse) am&#233;liorerait les performances globales.
</p>
<p>Nous avons &#233;valu&#233; que pour la moiti&#233; des entr&#233;es non traduites, c&#8217;est une absence de relation
analogique identifi&#233;e dans l&#8217;espace cible qui aboutit &#224; l&#8217;absence de candidat. En moyenne sur
le lexique L100 000, une entr&#233;e inconnue entre en relation analogique 988 fois du c&#244;t&#233; source,
ce qui g&#233;n&#232;re en moyenne 52 formes sources qui appartiennent au lexique de projection LT .
Du c&#244;t&#233; cible, une moyenne de 99 solutions analogiques sont propos&#233;es (par forme inconnue
source) ; une moyenne de 5 d&#8217;entre-elles seulement sont valid&#233;es par V et donc consid&#233;r&#233;es ici.
</p>
<p>4.2 &#201;valuation manuelle
</p>
<p>Une inspection des traductions propos&#233;es r&#233;v&#232;le certains probl&#232;mes dont cette &#233;valuation ne
rend pas compte. En particulier, certaines entr&#233;es re&#231;oivent une traduction correcte alors que
le lexique de r&#233;f&#233;rence est erron&#233; ou incomplet. C&#8217;est par exemple le cas des exemples de
la Figure 1. Par exemple, circumventing et fellow sont des traductions l&#233;gitimes de
coutournant et concitoyen respectivement. Sur les 20 premi&#232;res entr&#233;es lexicales consi-
d&#233;r&#233;es erron&#233;es par notre proc&#233;dure d&#8217;&#233;valuation, 12 contenaient des traductions valides et 4 des
entr&#233;es &#233;taient mal traduites dans le lexique de r&#233;f&#233;rence.
</p>
<p>contournant (49 candidats)
analog ! (circumventing,55) (undermining,20) (evading,19) (circumvented,17) (overtur-
ning,16) (circumvent,15) (circumvention,15) (bypass,13) (evade,13) (skirt,12)
Lref ! skirting, bypassing, by-pass, overcoming
concitoyen (24 candidats)
analog ! (citizens,26) (fellow,26) (fellow-citizens,26) (people,26) (citizen,23) (fellow-
citizen,21) (fellows,5) (peoples,3) (civils,3) (fellowship,2)
Lref ! fellow-citizens
</p>
<p>FIG. 1 &#8211; Les 10 meilleures traductions produites par analog &#224; patir de L200 000 pour deux
mots inconnus et leurs traductions dans Lref . Les traductions en gras sont pr&#233;sentes dans la
liste candidate et la liste de r&#233;f&#233;rence.
</p>
<p>Nous avons donc entrepris une &#233;valuation manuelle des traductions propos&#233;es par les deux
approches ANALOG et BASE2 pour les 127 termes du corpus domaine10 inconnus de Lref .
Nous avons d&#233;cid&#233;, non sans arbitraire, d&#8217;identifier comme valide une traduction candidate d&#232;s
lors qu&#8217;elle &#233;tait synonyme d&#8217;une traduction possible du mot source (citizen &#233;tait par exemple
consid&#233;r&#233;e comme une traduction acceptable de concitoyen).
</p>
<p>75 (60%) des mots inconnus recevaient au moins une traduction valide avec la premi&#232;re m&#233;-
thode, contre 63 (50%) avec la seconde. Sur ces mots, 61 traductions (81%) &#233;taient propos&#233;es
</p>
<p>10Nous n&#8217;avons pas observ&#233; de diff&#233;rence notable dans l&#8217;&#233;valuation automatique sur les mots du et hors-domaine.
</p>
<p>108</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Enrichissement d&#8217;un lexique bilingue par analogie
</p>
<p>en t&#234;te par ANALOG contre 22 (35%) pour BASE2. Des 52 mots n&#8217;ayant pas re&#231;u par ANALOG
de traduction satisfaisante, 38 (73%) n&#8217;ont en fait re&#231;u aucune traduction. Ces mots sont en
majorit&#233; des noms propres, des mots d&#8217;une autre langue (Latin, Grec ou Anglais) ainsi que des
mots compos&#233;s.
</p>
<p>Nous concluons de cette &#233;valuation manuelle que le raisonnement par analogie permet pour la
paire de langue fran&#231;ais-anglais de proposer une traduction valide pour 80% des entr&#233;es incon-
nues simples (c&#8217;est-&#224;-dire excluant les noms propres, les mots d&#8217;emprunts, les mots compos&#233;s
et les donn&#233;es chiffr&#233;es) de notre jeu de test.
</p>
<p>5 Discussion et perspectives
</p>
<p>Nous avons montr&#233; que le raisonnement analogique permettait de proposer une traduction valide
&#224; 60% des mots inconnus d&#8217;un jeu de test particulier (soit 80% des mots simples) pour la paire
de langues fran&#231;ais-anglais. Nous menons actuellement des exp&#233;riences sur d&#8217;autres paires de
langues disponibles dans le cadre de la t&#226;che partag&#233;e de WMT&#8217;06. Des taux similaires sont ob-
serv&#233;s pour la paire de langue Espagnol-Anglais, alors qu&#8217;une perte d&#8217;environ 10% est observ&#233;e
sur la paire allemand-anglais.
</p>
<p>En plus de pr&#233;dire la traduction de mots inconnus, nous avons remarqu&#233; que cette technique
peut-&#234;tre utilis&#233;e pour enrichir les traductions d&#8217;entr&#233;es lexicales peu fr&#233;quentes dans le corpus
d&#8217;entra&#238;nement. Ces entr&#233;es sont souvent mal traduites par les approches probabilistes. Nous
avons &#233;galement observ&#233; qu&#8217;il &#233;tait envisageable d&#8217;appliquer analog &#224; la traduction de s&#233;-
quences de mots. Nous planifions donc d&#8217;&#233;tudier de mani&#232;re syst&#233;matique l&#8217;impact de notre
approche sur un syst&#232;me de traduction statistique bas&#233; sur les s&#233;quences de mots.
</p>
<p>Toute analogie n&#8217;est pas bonne &#224; faire ; aussi souhaitons-nous apprendre automatiquement &#224;
pr&#233;dire la productivit&#233; d&#8217;une analogie. Ceci offrirait notamment une m&#233;thode de s&#233;lection plus
efficace que la simple fr&#233;quence que nous avons consid&#233;r&#233;e dans cette &#233;tude. Consulter le cor-
pus d&#8217;entra&#238;nement lors d&#8217;une traduction n&#8217;est pas une approche satisfaisante. Nous souhaitons
donc mod&#233;liser les r&#233;gularit&#233;s que rec&#232;lent les &#233;quations analogiques que nous formulons, dans
la veine des travaux d&#233;crits par (Claveau &amp; Zweigenbaum, 2005). Traduire un mot inconnu
pourrait alors se faire par application de r&#232;gles plut&#244;t que par consultation d&#8217;exemples.
</p>
<p>Plusieurs auteurs se sont int&#233;ress&#233;s &#224; l&#8217;identification de traductions dans des corpus compa-
rables, soit pour des mots simples (Fung &amp; Yee, 1998; Rapp, 1999; Takaaki &amp; Matsuo, 1999),
soit pour des termes de sp&#233;cialit&#233; (Morin &amp; Daille, 2004). Les techniques propos&#233;es dans ces
travaux peuvent &#234;tre employ&#233;es &#224; l&#8217;enrichissement d&#8217;un lexique bilingue. Il convient cependant
de souligner que contrairement &#224; ces approches, les traductions que nous proposons &#233;mergent
du seul principe de l&#8217;analogie. Nous ne sommes donc pas soumis au probl&#232;me non trivial de
l&#8217;acquisition de corpus d&#233;di&#233;s (parall&#232;les ou non) qui doivent contenir les mots que nous avons
&#224; traduire ainsi que leurs traductions.
</p>
<p>Remerciements
</p>
<p>Cette &#233;tude a largement profit&#233; de discussions que nous avons eues avec Nicolas Stroppa et
Fran&#231;ois Yvon ainsi que du tutoriel donn&#233; &#224; TALN&#8217;06 par Yves Lepage. Nous remercions les
relecteurs anonymes pour la pertinence de leurs commentaires.
</p>
<p>109</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe LANGLAIS, Alexandre PATRY
</p>
<p>R&#233;f&#233;rences
CLAVEAU V. &amp; L&#8217;HOMME M.-C. (2005). Apprentissage par analogie pour la structuration de
terminologie - utilisation compar&#233;e de ressources endog&#232;nes et exog&#232;nes. In 6&#232;me rencontre
de Terminologie et Intelligence Artificielle (TIA&#8217;05), Rouen, France.
CLAVEAU V. &amp; ZWEIGENBAUM P. (2005). Automatic translation of biomedical terms by
supervised transducer inference. In 10th Conference on Artificial Intelligence in Medicine
(AIME&#8217;05), Aberdeen, &#201;cosse.
FUNG P. &amp; YEE L. Y. (1998). An IR approach for translating new words from nonparallel,
comparable texts. In Proc. of the 36th ACL, p. 414&#8211;420, San Francisco, California.
GENTNER D., HOLYOAK K. J. &amp; KONIKOV B. N. (2001). The Analogical Mind. Cambridge,
MA: MIT Press.
KOEHN P. &amp; MONZ C. (2006). Manual and automatic evaluation of machine translation
between european languages. In Proceedings on the Workshop on Statistical Machine Trans-
lation, p. 102&#8211;121, New York City: Association for Computational Linguistics.
LEPAGE Y. (1998). Solving analogies on words: an algorithm. In COLING-ACL, p. 728&#8211;734.
LEPAGE Y. (2003). De l&#8217;analogie rendant compte de la commutation en linguistique. M&#233;moire
d&#8217;Habilitation &#224; diriger des recherches, Universit&#233; Joseph Fourier, Grenoble I.
LEPAGE Y. &amp; DENOUAL E. (2005). Aleph: an ebmt system based on the preservation of
proportionnal analogies between sentences across languages. In International Workshop on
Statistical Language Translation (IWSLT), Pittsburgh, PA.
LEVENSHTEIN V. I. (1966). Binary codes capable of correcting deletions, insertions and
reversals. Sov. Phys. Dokl., 6, 707&#8211;710.
MOREAU F. &amp; CLAVEAU V. (2006). Extensions de requ&#234;tes par relations morpho-syntaxiques
apprises automatiquement. In 3&#232;me Conf&#233;rence en Recherche d&#8217;Informations et Applications
(CORIA&#8217;06), Lyon, France.
MORIN E. &amp; DAILLE B. (2004). Extraction de terminologies bilingues &#224; partir de corpus
comparables d&#8217;un domaine sp&#233;cialis&#233;. TAL, 45(3), 103&#8211;122.
OCH F. &amp; NEY H. (2000). Improved statistical alignment models. In 38th annual meeting of
the Association for Computational Linguistics (ACL&#8217;00), p. 440&#8211;447, Hongkong, China.
RAPP R. (1999). Automatic identification of word translations from unrelated english and
german corpora. In 37th annual meeting of the Association for Computational Linguistics
(ACL&#8217;99), p. 519&#8211;526, College Park, Maryland.
STROPPA N. &amp; YVON F. (2005). An analogical learner for morphological analysis. In 9th
Conf. on Computational Natural Language Learning (CoNLL), p. 120&#8211;127, Ann Arbor, MI.
TAKAAKI T. &amp; MATSUO Y. (1999). Extraction of translation equivalents from non-parallel
corpora. In Proc. of the 8th International Conference on Theoretical and Methodological
Issues in Machine Translation (TMI&#8217;99), p. 109&#8211;119, Chester, England.
TURNEY P. &amp; LITTMAN M. (2005). Corpus-based learning of analogies and semantic rela-
tions. Machine Learning Journal, 60(1-3), 251&#8211;278.
YVON F., STROPPA N., DELHAY A. &amp; MICLET L. (2004). Solving analogical equations on
words. Rapport interne, &#201;cole Nationale Sup&#233;rieure des T&#233;l&#233;communications, Paris, France.
</p>
<p>110</p>

</div></div>
</body></html>