<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Dictionnaires &#233;lectroniques et &#233;tiquetage syntactico-s&#233;mantique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5-8 juin 2007
</p>
<p>Dictionnaires &#233;lectroniques et &#233;tiquetage syntactico-s&#233;mantique
</p>
<p>Pierre-Andr&#233; BUVET, Emmanuel CARTIER, Fabrice ISSAC, Salah MEJRI
LDI UMR 7187&#8211; Universit&#233; Paris 13
</p>
<p>{pr&#233;nom.nom}@lli.univ-paris13.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons dans cet article le prototype d&#8217;un syst&#232;me d&#8217;&#233;tiquetage
syntactico-s&#233;mantique des mots qui utilise comme principales ressources linguistiques
diff&#233;rents dictionnaires du laboratoire Lexiques, Dictionnaires, Informatique (LDI). Dans un
premier temps, nous mentionnons des travaux sur le m&#234;me sujet. Dans un deuxi&#232;me temps,
nous faisons la pr&#233;sentation g&#233;n&#233;rale du syst&#232;me. Dans un troisi&#232;me temps, nous exposons les
principales caract&#233;ristiques des dictionnaires syntactico-s&#233;mantiques utilis&#233;s. Dans un
quatri&#232;me temps, nous d&#233;taillons un exemple de traitement.
</p>
<p>Abstract. We present in this paper a syntactico-semantics tagger prototype which uses as
first linguistic resources various dictionaries elaborated at LDI. First, we mention several
related works. Second, we present the overall sketch of the system. Third, we expose the main
characteristics of the syntactico-semantic dictionaries implied in the processes. Last, using an
example, we explicit the main stages of the analysis.
</p>
<p>Mots-cl&#233;s : &#233;tiqueteur s&#233;mantique, dictionnaire, LMF, XML, XPATH;
</p>
<p>Keywords : word sense disambiguation (WSD), dictionnary, LMF, XML, XPATH;
</p>
<p>1 Introduction
L&#8217;une des activit&#233;s majeures du Laboratoire Lexiques, Dictionnaires, Informatique (LDI) est
d&#8217;&#233;laborer des dictionnaires &#233;lectroniques &#224; large couverture qui sont d&#233;di&#233;s &#224; des syst&#232;mes
op&#233;rant sur des textes num&#233;ris&#233;s. Les descriptions contenues dans les dictionnaires sont de
nature morphologique, d&#8217;une part, syntactico-s&#233;mantique, d&#8217;autre part. Les descriptions du
second type sont effectu&#233;es dans le cadre th&#233;orique du mod&#232;le des classes d&#8217;objets (Gross,
1995, Le Pesant et Mathieu-Colas, 1998). Nous pr&#233;sentons dans cet article le prototype d&#8217;un
syst&#232;me d&#8217;&#233;tiquetage syntactico-s&#233;mantique des mots qui utilise comme principales
ressources linguistiques diff&#233;rents dictionnaires du LDI. Dans un premier temps, nous
mentionnons des travaux sur le m&#234;me sujet. Dans un deuxi&#232;me temps, nous faisons la
pr&#233;sentation g&#233;n&#233;rale du syst&#232;me. Dans un troisi&#232;me temps, nous exposons les principales
caract&#233;ristiques des dictionnaires syntactico-s&#233;mantiques utilis&#233;s. Dans un quatri&#232;me temps,
nous d&#233;taillons un exemple de traitement.
</p>
<p>239</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIERRE-ANDR&#201; BUVET, EMMANUEL CARTIER, FABRICE ISSAC, SALAH MEJRI
</p>
<p>2 &#201;tat de l&#8217;art1
Nous rappelons comment l&#8217;&#233;tiquetage s&#233;mantique est g&#233;n&#233;ralement d&#233;fini, puis nous
indiquons dans quel cadre ce type d&#8217;&#233;tiquetage peut &#234;tre utilis&#233; et nous pr&#233;cisons finalement
ses principales caract&#233;ristiques.
L'&#233;tiquetage s&#233;mantique est la t&#226;che qui consiste &#224; attribuer une valeur s&#233;mantique &#224; un mot
lexical2. Il s&#8217;agit d&#8217;une t&#226;che interm&#233;diaire dans un processus de traitement automatique des
langues, puisqu'elle sert de point de d&#233;part &#224; d'autres t&#226;ches plus directement en rapport avec
la finalit&#233; du processus. Les &#233;tiquetages morphosyntaxiques et syntaxiques sont &#233;galement des
t&#226;ches interm&#233;diaires que l&#8217;on consid&#232;re disjointes de l'&#233;tiquetage s&#233;mantique.
La notion de valeur s&#233;mantique est beaucoup moins pr&#233;cise que celles de valeur
morphosyntaxique et de valeur syntaxique car la structure et l'&#233;tendue des informations de
nature s&#233;mantique sont beaucoup plus complexes. A l&#8217;instar de l&#8217;&#233;tiquetage
morphosyntaxique, l&#8217;&#233;tiquetage s&#233;mantique implique que le choix d'une &#233;tiquette ne d&#233;pend
pas seulement du mot mais aussi de son contexte. Ainsi dans les phrases La pi&#232;ce est dans le
porte-monnaie et Le porte-monnaie est dans la pi&#232;ce3, le calcul du sens du mot pi&#232;ce n&#233;cessite
des connaissances sur sa combinatoire compte tenu de sa polys&#233;mie.
Selon les types d&#8217;applications, les &#233;tiquettes s&#233;mantiques ont plus ou moins d&#8217;importance.
Elles sont cruciales en traduction automatique ou en traduction assist&#233;e par ordinateur du fait
que la transposition d&#8217;un texte d&#8217;une langue cible vers une langue source n&#233;cessite, entre
autres t&#226;ches, d&#8217;attribuer la valeur exacte d&#8217;une forme donn&#233;e dans un contexte donn&#233;. Ainsi,
pour traduire abattre par cut down dans abattre un arbre et kill par tuer dans abattre un
criminel, il faut &#233;tiqueter la forme verbale comme un synonyme de couper dans un cas, de
tuer dans l&#8217;autre. De m&#234;me, en recherche d'information, il faut faire appel non seulement &#224;
l&#8217;&#233;tiquetage morphosyntaxique mais aussi &#224; l&#8217;&#233;tiquetage s&#233;mantique pour construire des index
et analyser les requ&#234;tes. Ainsi, une requ&#234;te comme Quelle est la vitesse du jaguar ? ne sera
pas associ&#233;e &#224; des r&#233;sultats pertinents si la nature du mot jaguar (f&#233;lin, avion ou voiture) n&#8217;est
pas pr&#233;cis&#233;e.
L'&#233;tiquetage s&#233;mantique est con&#231;u comme un processus en deux &#233;tapes : (i) utiliser une
ressource linguistique du type dictionnaire ou du type ontologie pour attribuer un ensemble de
sens &#224; tous les mots pleins d&#8217;un texte ; (ii) utiliser des techniques symboliques ou num&#233;riques
faisant appel &#224; des ressources linguistiques pour &#233;liminer les sens incorrects. Ce type de
repr&#233;sentation permet de distinguer les ressources linguistiques &#224; utiliser et les traitements &#224;
appliquer. La premi&#232;re &#233;tape ne pr&#233;sente aucune difficult&#233; particuli&#232;re pour peu que l'on
dispose d'une ressource suffisamment compl&#232;te ; elle consiste &#224; attribuer des &#233;tiquettes
s&#233;mantiques &#224; des formes. La deuxi&#232;me &#233;tape fait appel &#224; des ressources linguistiques
beaucoup plus riches4 ou bien &#224; un &#233;chantillon pr&#233;-&#233;tiquet&#233;.
Le syst&#232;me utilise dans les deux cas des ressources linguistiques du type dictionnaire pour
&#233;tiqueter s&#233;mantiquement les mots lexicaux. Nous montrons maintenant l&#8217;int&#233;r&#234;t de faire
appel &#224; des dictionnaires &#233;lectroniques param&#233;tr&#233;s de fa&#231;on syntactico-s&#233;mantique.
</p>
<p>3 Pr&#233;sentation g&#233;n&#233;rale du syst&#232;me
L'&#233;laboration du syst&#232;me est un projet en cours qui s'inscrit dans le programme TAL du LDI
visant &#224; construire une plateforme d'analyse syntactico-s&#233;mantique des textes d&#233;di&#233;e &#224; la mise
1On trouvera une description plus compl&#232;te du domaine dans (Ide et V&#233;ronis, 1998) et (V&#233;ronis, 2004) ainsi 
qu&#8217;un aper&#231;u des applications les plus r&#233;centes dans (Mihalcea et Edmonds, 2004).
2 En anglais, Word Sense Disambiguation (WSD).
3 Adaptation au fran&#231;ais des phrases &#171; the box is in the pen &#187; et &#171; the pen is in the box &#187; de Yehoshua Bar-Hillel 
(Sabah, 1996).
4  Par exemple, WordNet / EuroWordNet (Preiss, Stevenson, 2004) ou EST (Piao et al., 2005)
</p>
<p>240</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dictionnaires &#233;lectronique et &#233;tiquetage syntactico-s&#233;mantique
</p>
<p>en place d'applications (veille, traduction, etc.) et &#224; la gestion de corpus de documents par les
linguistes du laboratoire .
Nous indiquons quelle est l'architecture g&#233;n&#233;rale du syst&#232;me puis nous pr&#233;cisons pour chaque
module quelles sont les ressources utilis&#233;es. Ensuite, nous pr&#233;sentons le corpus de travail et
nous d&#233;taillons la cha&#238;ne de traitements
</p>
<p>3.1 Architecture g&#233;n&#233;rale
</p>
<p>3.2 Ressources du syst&#232;me
Le syst&#232;me utilise trois ressources lexicographiques et un corpus :
! dictionnaire morphologique : Il comprend pour l'instant l'ensemble des formes
</p>
<p>simples du fran&#231;ais (actuellement plus de 750 000 formes), qui sont g&#233;n&#233;r&#233;es &#224; partir
d'une table des lemmes et d'une table de mod&#232;les morphologiques. Par la suite, il
int&#232;grera l'ensemble des mots compos&#233;s du fran&#231;ais5.
</p>
<p>! dictionnaire des arguments : cf. Infra.
! dictionnaire des pr&#233;dicats : cf. Infra.
! Corpus : il est compos&#233; pour l'essentiel d'articles du journal Le Monde au format texte
</p>
<p>ainsi que d'autres types de documents dans des formats vari&#233;s (HTML, Open Office,
PDF, Word et RTF)
</p>
<p>Un pr&#233;-traitement permet de normaliser les documents en les convertissant de leur format
d'origine vers un format XML commun. Il consiste &#224; r&#233;cup&#233;rer des informations sur la
structure des documents. Nous avons opt&#233;, en l'&#233;tat actuel, pour une DTD &#171; minimale &#187;,
permettant d'annoter les titres, sous-titres, sections et sous-sections ainsi que les paragraphes
du texte. Dans une phase ult&#233;rieure, des annotations suppl&#233;mentaires permettront de rendre
compte de structures textuelles plus fines, comme les listes et les tableaux. La normalisation
XML des documents permet de les d&#233;corer de balises &lt;text&gt;&lt;title
level='1..N'&gt;&lt;section level='1..N'&gt;&lt;p&gt;. Le pr&#233;-traitement permet &#233;galement
de convertir les documents de leur encodage d'origine vers l'encodage UTF-86.
</p>
<p>5 Ce dictionnaire est issu des travaux de Michel Mathieu-Colas au LLI
6 Ce travail a &#233;t&#233; effectu&#233; avec la promotion 2006-2007 des &#233;tudiants du Master PRO TILDE de l'Universit&#233; 
Paris 13.
</p>
<p>D i c t i o n n a i r e  
m o r p h o l o g i q u e
</p>
<p>L e m m e s M o d &#232; l e s
m o r p h o l o g i q u e s
</p>
<p>C o r p u s  d e  d o c u m e n t s
</p>
<p>X M L i s a t i o n d e s  d o c u m e n t s
G &#233; n &#233; r a t i o n  
</p>
<p>d e s  f o r m e s  f l &#233; c h i e s
</p>
<p>A n n o t a t i o n  m o r p h o l o g i q u e
d e s  t o k e n s
</p>
<p>( m o r p h E t i q )
</p>
<p>A n n o t a t i o n  s y n t a x i c o - s &#233; m a n t i q u e
( s y n t a x E t i q )
</p>
<p>D i c t i o n n a i r e  d e s  
p r &#233; d i c a t s
</p>
<p>1
</p>
<p>2
</p>
<p>4
</p>
<p>5
</p>
<p>D i c t i o n n a i r e  d e s  
a r g u m e n t s
</p>
<p>S e g m e n t a t i o n
T o k e n i s a t i o n3
</p>
<p>241</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIERRE-ANDR&#201; BUVET, EMMANUEL CARTIER, FABRICE ISSAC, SALAH MEJRI
Le syst&#232;me comprend deux &#233;tapes de pr&#233;-traitement (g&#233;n&#233;ration du dictionnaire
morphologique, &#233;tape 1, et normalisation XML des documents, &#233;tape 2) et trois &#233;tapes de
traitement. A chaque &#233;tape, le syst&#232;me pr&#233;voit une sortie afin d'effectuer une &#233;valuation des
r&#233;sultats.
</p>
<p>3.3 &#201;tapes du traitement
Etape 3 : segmentation en phrases et en mots des documents XML : la segmentation en
phrases et en mots permet de d&#233;corer les documents de deux nouvelles balises : &lt;s&gt; et &lt;w&gt;
(respectivement &#171; sentence &#187; et &#171; word &#187;).
La phase de segmentation en phrases (d&#233;finies du point de vue graphique) r&#233;sulte de l'analyse
et du classement des diff&#233;rents sortes de 'point' dans le corpus &#171; Le Monde &#187;. Des listes
d'abr&#233;viations et d'acronymes courants ainsi qu'une s&#233;rie d'expressions r&#233;guli&#232;res permettent
de rep&#233;rer les 'points' qui ne sont pas en fin de phrase. Un sous-corpus a &#233;t&#233; manuellement
annot&#233; pour constituer un corpus de r&#233;f&#233;rence de 150 000 mots. Les r&#233;sultats de la
segmentation automatique sont un taux de rappel de 98,7% et un taux de pr&#233;cision de 97,6%.
La phase de segmentation en mots a consist&#233; tout d'abord &#224; reconna&#238;tre un certain nombre
d'unit&#233;s textuelles, qu'il s'agisse d'entit&#233;s num&#233;riques (5,7%, 13,2 millions), d'entit&#233;s
temporelles &#224; base num&#233;rique (le 12/12/2005) ou encore d'entit&#233;s sp&#233;cifiques (url, mail, etc.).
Elle a &#233;galement consist&#233; &#224; normaliser les signes de ponctuation (r&#233;duction de plusieurs
espaces en un seul, s&#233;paration des signes de ponctuation, normalisation des signes d'&#233;lision...),
puis &#224; segmenter les phrases en mots sur la base de l'espace.7
Etape 4 : annotation morpho-syntaxique des tokens : les cha&#238;nes de caract&#232;res reconnues
comme des mots font l'objet d'une annotation morphosyntaxique. Par projection, les
informations contenues dans le dictionnaire morphologique sont associ&#233;es aux tokens :
lemme, cat&#233;gorie morphosyntaxique, informations de nombre, genre, mode, temps, personne8.
A ce stade, les mots peuvent &#234;tre ambigus. Par exemple, porte comprend l'ensemble des
informations li&#233;es aux formes verbales (mode : indicatif, subjonctif ; temps : pr&#233;sent,
personne$1 : 1, 3) et &#224; la forme nominale (nom, f&#233;minin, singulier). Dans le fichier XML
ad&#233;quat, cela se traduit par l'annotation suivante :
&lt;w  case='lc'&gt;
 &lt;morph  lemma='porter'  cat='v'  mood=''subj'  tense='pres'  pers='1'/&gt;  
 &lt;morph  lemma='porter'  cat='v'  mood=''subj'  tense='pres'  pers='3'/&gt;  
 &lt;morph  lemma='porter'  cat='v'  mood=''ind'  tense='pres'  pers='1'/&gt;  
 &lt;morph  lemma='porter'  cat='v'  mood=''ind'  tense='pres'  pers='3'/&gt;  
 &lt;morph  lemma='porte'  cat='n'  nb='plu'  gender='fem'/&gt;
 porte  
&lt;/w&gt; 
Etape 5 : annotation syntaxico-s&#233;mantique : l'annotation syntaxico-s&#233;mantique est l'&#233;tape
la plus complexe du traitement. Elle fait appel au dictionnaire des arguments et &#224; celui des
pr&#233;dicats. Elle se d&#233;compose en plusieurs sous &#233;tapes :
! 5a. d&#233;sambiguisation morpho-syntaxique : le syst&#232;me &#233;limine un certain nombre de
</p>
<p>solutions morphologiques issues de la projection des dictionnaires sur les mots &#171; hors
contexte &#187; en faisant appel &#224; des r&#232;gles correspondant &#224; des grammaires locales.
</p>
<p>7 D&#232;s cette phase, un certain nombre d'informations typographiques sont incluses sous forme d'attributs : le type 
de l'&#233;l&#233;ment (valeur de l'&#233;l&#233;ment : w pour word, num pour infos num&#233;riques, punct pour signe de ponctuation, 
symb pour symbole) ainsi que des attributs de casse pour w (case='lowercase,uppercase,titlecase') et un attribut 
type pour num (afin de reconna&#238;tre, entre autres, les dates).
8Cf. Mathieu-Colas, 2007, &#224; propos des informations morphologiques utilis&#233;es.
</p>
<p>242</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dictionnaires &#233;lectronique et &#233;tiquetage syntactico-s&#233;mantique
</p>
<p>! 5b. projection du dictionnaire des arguments : le dictionnaire des arguments est projet&#233;
sur le fichier XML afin d'ajouter des informations de type s&#233;mantique au niveau de
certains signes de type mot &#171; w &#187;.
</p>
<p>! 5c. Annotation des constructions syntaxiques : le syst&#232;me identifie diverses
constructions syntaxiques : groupes nominaux, groupes pr&#233;positionnels, etc.. Pour
chaque groupe, un attribut &#171; head &#187; correspondant &#224; la &#171; t&#234;te s&#233;mantique&#187; des
diff&#233;rents groupes est &#233;galement r&#233;cup&#233;r&#233;. Sont &#233;galement reconnues les s&#233;quences
relatives &#224; des entit&#233;s nomm&#233;es (personnes, organisations, lieux, artefacts,
&#233;v&#233;nements).
</p>
<p>! 5d. Analyse pr&#233;dicative : il s'agit enfin d'identifier les structures pr&#233;dicat-arguments &#224;
l'aide du dictionnaire des pr&#233;dicats. Le syst&#232;me g&#233;n&#232;re automatiquement une
expression XPATH &#224; partir des descriptions lexicographiques. Par exemple, pour
l'entr&#233;e &#171; subir &#187;, dans le sens de subir(EVENEMENT,ENTITE CONCRETE), nous
aurons l'expression XPATH :
group[1][@cat='gn' and @sem='ENTITE'] and group[2][@cat='gv' and
@head='subir'] and group[3][@cat='gn' and @sem='EVE'].
</p>
<p>Le XML r&#233;sultant de l'analyse pr&#233;dicative se pr&#233;sente comme suit :
&lt;s&gt;
</p>
<p>&lt;gn head='12/12/2003'&gt;
 &lt;w case='tc' &gt;&lt;morph lemma='le' cat='det'&gt;Le&lt;/morph&gt;&lt;/w&gt;
 &lt;num type='date'&gt;12/12/2003&lt;/num&gt;
</p>
<p>&lt;/gn&gt;
 &lt;punct&gt;,&lt;/punct&gt;
</p>
<p>&lt;pred sem='subir' X0='population' X1='hausse'&gt;
 &lt;gn head='population'&gt;
</p>
<p> ...
</p>
<p> &lt;/gn&gt;
 &lt;gv head='subir'&gt;
 ...
</p>
<p> &lt;/gv&gt;
 &lt;gn head='hausse'&gt;
 ...
</p>
<p> &lt;/gn&gt;
&lt;/pred&gt;
</p>
<p>&lt;w typo='punct'&gt;,&lt;/w&gt;
</p>
<p>&lt;gadj head='atteindre'&gt;
 ...
</p>
<p>&lt;/gadj&gt;
 &lt;punct&gt;.&lt;/punct&gt;
</p>
<p>&lt;/s&gt;
</p>
<p>4 Les dictionnaires syntactico-s&#233;mantiques
Le mod&#232;le des classes d&#8217;objets subdivise les unit&#233;s linguistiques &#224; partir du postulat suivant :
toute phrase &#233;l&#233;mentaire est constitu&#233;e d&#8217;un pr&#233;dicat du premier ordre et de ses &#233;ventuels
arguments, les autres constituants phrastiques ressortissant &#224; l&#8217;actualisation. Il s&#8217;ensuit trois
sous-cat&#233;gories majeures : celle des pr&#233;dicats, celle des arguments &#233;l&#233;mentaires et celles des
actualisateurs. La description des items de la derni&#232;re sous-cat&#233;gorie est subordonn&#233;e &#224; celles
des items des autres sous-cat&#233;gories (Buvet, &#224; paraitre). Les descriptions des arguments
&#233;l&#233;mentaires et des pr&#233;dicats sont formalis&#233;es dans des dictionnaires &#233;lectroniques. Nous
discutons de ces dictionnaires du point de vue linguistique puis du point de vue informatique.
</p>
<p>4.1 Structuration linguistique
Deux sortes de dictionnaires syntactico-s&#233;mantiques sont &#233;labor&#233;s au LLI : ARGU-DIC et
PREDI-DIC. Le premier dictionnaire d&#233;crit les arguments &#233;l&#233;mentaires, le second les
pr&#233;dicats.
ARGU-DIC : les arguments &#233;l&#233;mentaires sont des substantifs qui ne peuvent jamais occuper
une position pr&#233;dicative dans une construction &#224; support (Gross et Vives, 1986). D&#8217;un point
</p>
<p>243</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIERRE-ANDR&#201; BUVET, EMMANUEL CARTIER, FABRICE ISSAC, SALAH MEJRI
de vue syntactico-s&#233;mantique, ils sont caract&#233;ris&#233;s en termes de classes d&#8217;objets
(&lt;aliment&gt;,&lt;moyen de transport&gt;, &lt;outil&gt;, &lt;voie&gt;, etc.) et de domaines
(&lt;a&#233;ronautique&gt;, &lt;m&#233;decine&gt;, &lt;sciences&gt;, etc.) (Buvet et Mathieu-Colas, 1999). La
macrostructure du dictionnaire est donc constitu&#233;e de l&#8217;ensemble des noms correspondant &#224;
des arguments &#233;l&#233;mentaires. La microstructure comporte la vedette et des informations
m&#233;talinguistiques relatives aux classes et aux domaines9.
PRED-DIC : la structuration du dictionnaire des pr&#233;dicats est plus complexe. Nous d&#233;crivons
successivement la macrostructure puis la microstructructure.
</p>
<p>Macrostructure
La nomenclature du dictionnaire PR&#201;D-DIC est constitu&#233;e des racines pr&#233;dicatives
correspondant &#224; autant d&#8217;emplois pr&#233;dicatifs. Nous pr&#233;cisons successivement les notions de
racine pr&#233;dicative et d&#8217;emploi pr&#233;dicatif.
Racine pr&#233;dicative : la notion de racine pr&#233;dicative rend compte du caract&#232;re polymorphe de
certains pr&#233;dicats : Il l&#8217;aime/Il est amoureux d&#8217;elle/Il &#233;prouve de l&#8217;amour pour elle. La parent&#233;
morphologique entre le verbe, l&#8217;adjectif et le nom en position de pr&#233;dicat et la stricte
&#233;quivalence entre les trois &#233;nonc&#233;s permettent d&#8217;interpr&#233;ter aimer, amoureux et amour comme
trois formes diff&#233;rentes d&#8217;une m&#234;me racine pr&#233;dicative. Toutes les racines pr&#233;dicatives ne
donnent pas lieu &#224; des &#233;nonc&#233;s &#233;quivalents : Ceci g&#234;ne Luc/Ceci est g&#234;nant/Luc ressent de la
g&#234;ne.
Emploi pr&#233;dicatif : un emploi pr&#233;dicatif est d&#233;fini conjointement par une racine pr&#233;dicative,
une classe s&#233;mantique et une interpr&#233;tation donn&#233;e. Deux cas de figure sont &#224; envisager selon
que l&#8217;emploi pr&#233;dicatif est autonome (grognon) ou polymorphique (d&#233;dain/d&#233;daigner/
d&#233;daigneux).
Une racine pr&#233;dicative polymorphique permet de rendre compte d&#8217;emplois pr&#233;dicatifs non
&#233;quivalents mais morphologiquement reli&#233;s et s&#233;mantiquement apparent&#233;s : Luc d&#233;teste
Max/Max est d&#233;test&#233;/Max est d&#233;testable. Les trois formes pr&#233;dicatives ont une interpr&#233;tation
sp&#233;cifique : d&#233;tester s&#8217;interpr&#232;te comme une &#8216;propri&#233;t&#233; occasionnelle&#8217;, d&#233;test&#233; comme une
&#8216;propri&#233;t&#233; r&#233;sultative&#8217; et d&#233;testable comme une &#8216;propri&#233;t&#233; causale permanente&#8217;.
</p>
<p>L&#8217;interpr&#233;tation d&#8217;un pr&#233;dicat est le produit de sa construction, de son trait et de son aspect
inh&#233;rent. Si d&#233;tester, d&#233;test&#233; et d&#233;testable sont des pr&#233;dicats qui partagent la m&#234;me racine
pr&#233;dicative, en l&#8217;occurrence d&#233;test-, et appartiennent &#224; la m&#234;me classe s&#233;mantique &lt;haine&gt;,
ils n&#8217;ont pas cependant la m&#234;me interpr&#233;tation.
</p>
<p>1. celle du verbe r&#233;sulte du fait qu&#8217;il a la construction X0 V X1 avec X0 =&#8216;humain&#8217; et
X1=&#8216;humain&#8217;, le trait &#8216;&#233;tat&#8217; et l&#8217;aspect &#8216;provisoire&#8217; ;
</p>
<p>2. celle de l&#8217;adjectif participe tient au fait qu&#8217;il a la construction X0 &#234;tre App&#233; avec X0=
&#8216;humain&#8217;, le trait &#8216;&#233;tat&#8217; et l&#8217;aspect &#8216;accompli&#8217; ;
</p>
<p>3. celle de l&#8217;adjectif en &#8211;able s&#8217;explique parce qu&#8217;il a la construction X0 &#234;tre A avec X0=
&#8216;humain&#8217;, le trait &#8216;&#233;tat&#8217; et l&#8217;aspect &#8216;permanent&#8217;.
</p>
<p>Quels que soient les dictionnaires, les vedettes sont &#224; l&#8217;intersection de leur macrostructure et
de leur microstructure. Les vedettes de PRED-DIC sont des racines pr&#233;dicatives
correspondant &#224; autant d&#8217;emplois pr&#233;dicatifs. Autrement dit, une racine pr&#233;dicative appara&#238;t
dans plus d&#8217;une entr&#233;e lorsqu&#8217;elle correspond &#224; plus d&#8217;un emploi pr&#233;dicatif. Par contre, un
emploi pr&#233;dicatif polymorphique est d&#233;crit sous la m&#234;me entr&#233;e et il est sp&#233;cifi&#233; dans l&#8217;article
aff&#233;rent quelles sont les diff&#233;rentes formes qu&#8217;il recouvre. Ainsi, d&#233;testation est dans le m&#234;me
article que d&#233;tester du fait de l&#8217;&#233;quivalence des deux phrases suivantes :
</p>
<p>Luc d&#233;teste Max
</p>
<p>9  Tous les noms du dictionnaire ne n&#233;cessitent pas d&#8217;&#234;tre caract&#233;ris&#233;s par un domaine.
</p>
<p>244</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dictionnaires &#233;lectronique et &#233;tiquetage syntactico-s&#233;mantique
</p>
<p>Luc a de la d&#233;testation pour Max
</p>
<p>Nous pr&#233;sentons maintenant les informations m&#233;talinguistiques qui constituent le reste d&#8217;un
article de PRED-DIC.
</p>
<p>Microstructure
Les descripteurs associ&#233;s &#224; l&#8217;entr&#233;e d&#8217;un dictionnaire sont tous des propri&#233;t&#233;s linguistiques. Ils
sont de trois ordres : les descripteurs de d&#233;finition, les descripteurs de conditions et les
descripteurs de validation
Les descripteurs de d&#233;finition : il s&#8217;agit de la classe s&#233;mantique et de l&#8217;interpr&#233;tation de
l&#8217;emploi pr&#233;dicatif correspondant &#224; l&#8217;entr&#233;e. Elles constituent les deux informations qui sont
associ&#233;es &#224; la racine pr&#233;dicative lors de l&#8217;&#233;tiquetage syntactico-s&#233;mantique.
Les classes s&#233;mantiques qui caract&#233;risent les pr&#233;dicats sont en assez grand nombre (environ
2000 en l&#8217;&#233;tat actuel des travaux du LLI). Par contre, les interpr&#233;tations possibles sont
limit&#233;es en nombre (une douzaine).
Les descripteurs de conditions : ce sont les diff&#233;rentes propri&#233;t&#233;s linguistiques qui
permettent &#224; l&#8217;&#233;tiqueteur s&#233;mantique de d&#233;terminer quels sont les emplois pr&#233;dicatifs des
racines pr&#233;dicatives. Elles sont de cinq sortes.
</p>
<p>Les propri&#233;t&#233;s morphologiques : ces propri&#233;t&#233;s sont au nombre de trois. Tout d&#8217;abord, elles
indiquent les diverses formes simples possibles d&#8217;un m&#234;me emploi pr&#233;dicatif (le verbe
prendre et le nom prise ou uniquement le verbe prendre). Elles font &#233;tat de l&#8217;&#233;ventuel
caract&#232;re complexe de l&#8217;entr&#233;e (prendre ombrage). Elles signalent aussi la d&#233;fectivit&#233;
(prendre fin ne s&#8217;emploie qu&#8217;&#224; la troisi&#232;me personne).
Les propri&#233;t&#233;s structurelles : elles font &#233;tat du nombre des arguments et de leur mode de
structuration. Le nombre de structures possibles d&#233;pend de la forme des pr&#233;dicats. Par
exemple, prendre est caract&#233;ris&#233; par :
</p>
<p>1. la construction X0 V X1 en tant que synonyme de commander (Luc prend une bi&#232;re) ;
2. la construction X0 V X1 PREP2 X2 en tant que synonyme de tenir (Luc prend L&#233;a par
</p>
<p>la taille) ;
Les propri&#233;t&#233;s distributionnelles : elles font &#233;tat de la structure argumentale du pr&#233;dicat en
indiquant, d&#8217;une part, la nature syntaxique des arguments (groupe nominal, compl&#233;tive,
infinitive, etc.) et, d&#8217;autre part, la nature s&#233;mantique des pr&#233;dicats (en termes de classes
d&#8217;objets ou d&#8217;hyperclasses). Il est possible de la sorte d&#8217;&#233;tablir que prendre a deux acceptions
diff&#233;rentes selon que la position X0 est occup&#233;e :
</p>
<p>1. indiff&#233;remment par un groupe nominal ou une infinitive ((Cette affaire Faire cela)
prend du temps) ;
</p>
<p>2. seulement par un groupe nominal qui, de plus, correspond n&#233;cessairement &#224; un humain
(Luc prend du temps).
</p>
<p>Les propri&#233;t&#233;s combinatoires : ces propri&#233;t&#233;s sont dissoci&#233;es selon qu&#8217;elles ressortissent &#224; la
signification grammaticale (br&#251;ler dans Luc br&#251;le d&#8217;amour pour L&#233;a) ou bien &#224; la
signification lexicale (intelligemment dans Luc a pr&#233;sent&#233; le projet intelligemment) (Blanco et
Buvet, 2004).
Les propri&#233;t&#233;s paraphrastiques : il s&#8217;agit de reconstructions des phrases canoniques,
typiquement le passif ou la forme pronominale. La construction standard Luc prend Max au
s&#233;rieux donne la reconstruction du type passif Max est pris au s&#233;rieux par Luc et la
reconstruction du type forme pronominale r&#233;fl&#233;chie Luc se prend au s&#233;rieux.
Elles sont symptomatiques de la polys&#233;mie des racines pr&#233;dicatives dans la mesure o&#249; les
reconstructions varient selon les emplois.
</p>
<p>245</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIERRE-ANDR&#201; BUVET, EMMANUEL CARTIER, FABRICE ISSAC, SALAH MEJRI
Les descripteurs de validation : ces descripteurs justifient les interpr&#233;tations des racines
constituant les entr&#233;es. Ils permettent de v&#233;rifier la coh&#233;rence de la d&#233;finition propos&#233;e dans
l&#8217;article. Si certains sont aussi des descripteurs de conditions (par exemple, les propri&#233;t&#233;s
structurelles), les autres sont de propri&#233;t&#233;s s&#233;mantiques sp&#233;cifiques qui ne participent pas
directement &#224; l&#8217;identification de l&#8217;emploi. Il s&#8217;agit du type (&#233;tat, action &#233;v&#233;nement) et l&#8217;aspect
intrins&#232;que de l&#8217;emploi pr&#233;dicatif (e.g. le ponctuel pour gifler).
La description param&#233;tr&#233;e des diff&#233;rents emplois pr&#233;dicatifs et des arguments donne &#224; lieu &#224;
diverses informations explicites qu&#8217;il est possible de structurer sous un format informatisable.
</p>
<p>4.2 Mod&#233;lisation informatique
L'augmentation des performances des syst&#232;mes TAL est directement li&#233;e &#224; celle des
ressources linguistiques tant du point de vue qualitatif que du point de vue quantitatif.
L'exploitation informatique de ces ressources, qu'elles soient de nature morphologique,
syntaxique ou s&#233;mantique, est toujours probl&#233;matique. Pour des raisons de r&#233;utilisabilit&#233; et de
p&#233;rennit&#233;, il faut que les ressources respectent des normes reconnues par tous les acteurs du
domaine (Francopoulo, 2006). La structuration informatique de ARGU-DIC et PRED-DIC
utilise la pr&#233;-norme LMF (ISO, 2006). Celle-ci propose non pas une DTD XML toute faite
mais plut&#244;t un cadre dans lequel il possible de construire et documenter un grand nombre de
ressources linguistiques d&#233;crites dans des formalismes tr&#232;s divers. Le risque de contraindre
une repr&#233;sentation par le biais d'un DTD est l'abandon de celle-ci lorsqu'un mod&#232;le ne peut y
trouver sa place. Nous nous appuyons &#233;galement sur les recommandations de la TEI en ce qui
concerne la repr&#233;sentations des dictionnaires &#171; papier &#187; et le codage des ent&#234;tes. La
structuration m&#233;talinguistique de PRED-DIC est prise en charge au format XML comme suit :
&lt;entry id=&quot;prendre_1&quot; class=&quot;capture&quot; int=&quot;operation&quot;&gt;
</p>
<p>&lt;root&gt;prendre&lt;/root&gt;
&lt;example&gt;les enfants prennent un chat
&lt;/example&gt;
&lt;definition&gt;
</p>
<p>&lt;item name=&quot;class&quot; val=&quot;capture&quot;/&gt;
&lt;item name=&quot;int&quot; val=&quot;operation&quot;/&gt;
</p>
<p>&lt;/definition&gt;
&lt;morphProp&gt;
</p>
<p>&lt;item val=&quot;verb&quot;/&gt;
&lt;/morphProp&gt;
&lt;structprop&gt;
</p>
<p>&lt;item pred=&quot;verb&quot; val=&quot;X0_V_X1&quot;/&gt;
&lt;/structProp&gt;
&lt;distProp&gt;
</p>
<p>&lt;struct type=&quot;syntax&quot;&gt;
&lt;item arg=&quot;0&quot; val=&quot;np&quot;/&gt;
&lt;item arg=&quot;1&quot; val=&quot;np&quot;/&gt;
</p>
<p>&lt;/struct&gt;
&lt;struct type=&quot;semantic&quot;&gt;
</p>
<p>&lt;item arg=&quot;0&quot; val=&quot;hum&quot;/&gt;
&lt;item arg=&quot;1&quot; val=&quot;animal&quot;/&gt;
</p>
<p>&lt;/struct&gt;
&lt;/distProp&gt;
&lt;semanticProp&gt;
</p>
<p>&lt;item type=&quot;feature&quot; val=&quot;action&quot;/&gt;
&lt;item type=&quot;aspect&quot; val=&quot;perfective&quot;/&gt;
</p>
<p>&lt;/semanticProp&gt;
&lt;appropriateProp&gt;&lt;/appropriateProp&gt;
</p>
<p>&lt;paraphrasticProp&gt;
&lt;item pred=&quot;verb&quot; val=&quot;passive&quot;/&gt;
</p>
<p>&lt;/paraphrasticProp&gt;
&lt;/entry&gt;&lt;classFrame&gt;
</p>
<p>&lt;item id=&quot;capture&quot;/&gt;
&lt;item id=&quot;hum&quot;/&gt;
&lt;item id=&quot;animal&quot;/&gt;
</p>
<p>&lt;/classFrame&gt;
</p>
<p>&lt;intFrame&gt;
&lt;item id=&quot;operation&quot;/&gt;
</p>
<p>&lt;/intFrame&gt;
</p>
<p>&lt;interpretationFrame&gt;
&lt;item id=&quot;operation&quot;/&gt;
</p>
<p>&lt;/interpretationFrame&gt;
</p>
<p>&lt;propertyFrame typepred=&quot;verb&quot;&gt;
&lt;struct id=&quot;X0_V_X1&quot;&gt;
</p>
<p>&lt;item val=&quot;0&quot;/&gt;
&lt;item pred=&quot;verb&quot;/&gt;
&lt;item val=&quot;1&quot;/&gt;
</p>
<p>&lt;/struct&gt;
&lt;struct id=&quot;X0_V_X1opt&quot;&gt;
</p>
<p>&lt;item num=&quot;0&quot;/&gt;
&lt;item pred=&quot;V&quot;/&gt;
&lt;item num=&quot;1&quot; type=&quot;opt&quot;/&gt;
</p>
<p>&lt;/struct&gt;
&lt;/propertyFrame&gt;
</p>
<p>246</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Di
cti
</p>
<p>on
na
</p>
<p>ire
s &#233;
</p>
<p>lec
tro
</p>
<p>niq
ue
</p>
<p> et
 &#233;t
</p>
<p>iqu
eta
</p>
<p>ge
 sy
</p>
<p>nta
cti
</p>
<p>co
-s&#233;
</p>
<p>ma
nti
</p>
<p>qu
e
</p>
<p>5
Ex
</p>
<p>em
ple
</p>
<p> de
tra
</p>
<p>ite
me
</p>
<p>nt
10
</p>
<p>Co
mm
</p>
<p>en
tai
</p>
<p>re
s (
</p>
<p>ex
em
</p>
<p>ple
s d
</p>
<p>e r
&#232;g
</p>
<p>les
 ut
</p>
<p>ilis
&#233;e
</p>
<p>s p
ou
</p>
<p>r g
&#233;n
</p>
<p>&#233;r
er
</p>
<p> le
sr
</p>
<p>ep
r&#233;
</p>
<p>sen
tat
</p>
<p>ion
s)
</p>
<p>0 :
 le
</p>
<p>s s
ign
</p>
<p>es 
so
</p>
<p>nt
 re
</p>
<p>co
nn
</p>
<p>us
 vi
</p>
<p>ad
es 
</p>
<p>ex
pr
</p>
<p>ess
ion
</p>
<p>s r
&#233;g
</p>
<p>uli
&#232;r
</p>
<p>es 
UN
</p>
<p>IC
OD
</p>
<p>E.
Ex
</p>
<p>em
ple
</p>
<p>s :
w
</p>
<p>=
(\
</p>
<p>p{
L
</p>
<p>})
+(
</p>
<p>-)
(\
</p>
<p>p{
L}
</p>
<p>)+
;
</p>
<p>p
u
</p>
<p>n
ct
</p>
<p>=
\p
</p>
<p>{P
}
</p>
<p>1 :
 un
</p>
<p>ce
rta
</p>
<p>in 
no
</p>
<p>mb
re
</p>
<p> d'
en
</p>
<p>tit
&#233;s
</p>
<p>no
mm
</p>
<p>&#233;e
s &#224;
</p>
<p> ba
se 
</p>
<p>nu
m&#233;
</p>
<p>riq
ue
</p>
<p> so
nt
</p>
<p> re
co
</p>
<p>nn
ue
</p>
<p>s d
&#232;s 
</p>
<p>la 
re
</p>
<p>co
nn
</p>
<p>ais
sa
</p>
<p>nc
e t
</p>
<p>yp
og
</p>
<p>ra
ph
</p>
<p>iqu
e.
</p>
<p>Ex
em
</p>
<p>ple
:H
</p>
<p>o
u
</p>
<p>r
=
</p>
<p>[0
-9
</p>
<p>]{
2}
</p>
<p>[h
:]
</p>
<p>[0
-9
</p>
<p>]{
2}
</p>
<p>2 :
 E
</p>
<p>nf
ra
</p>
<p>n&#231;
ais
</p>
<p>, la
 d&#233;
</p>
<p>sa
mb
</p>
<p>igu
isa
</p>
<p>tio
n m
</p>
<p>or
ph
</p>
<p>o-s
yn
</p>
<p>tax
iqu
</p>
<p>e p
or
</p>
<p>te 
no
</p>
<p>tam
me
</p>
<p>nt
 su
</p>
<p>r l
es
</p>
<p>d&#233;
ter
</p>
<p>mi
na
</p>
<p>nt
s/p
</p>
<p>ro
no
</p>
<p>ms
.
</p>
<p>Ex
em
</p>
<p>ple
 de
</p>
<p> r&#232;
gle
</p>
<p> de
 d&#233;
</p>
<p>sam
big
</p>
<p>uis
ati
</p>
<p>on
 :m
</p>
<p>o
r
</p>
<p>ph
[1
</p>
<p>][
@c
</p>
<p>at
 
</p>
<p>in
 '
</p>
<p>de
t
</p>
<p>,
p
</p>
<p>r
o'
</p>
<p>] 
an
</p>
<p>d 
mo
</p>
<p>r
p
</p>
<p>h[
@c
</p>
<p>at
 
</p>
<p>in
 '
</p>
<p>n
,
</p>
<p>a
dj
</p>
<p>']
a
</p>
<p>n
d
</p>
<p>m
o
</p>
<p>r
p
</p>
<p>h[
3]
</p>
<p>[@
ca
</p>
<p>t
=
</p>
<p>'
v
</p>
<p>'
]=
</p>
<p>&gt;d
et
</p>
<p>+n
+
</p>
<p>v
</p>
<p>3 :
la 
</p>
<p>re
co
</p>
<p>nn
ais
</p>
<p>sa
nc
</p>
<p>e d
es
</p>
<p>gr
ou
</p>
<p>pe
s s
</p>
<p>e f
ait
</p>
<p> su
r l
</p>
<p>a b
as
</p>
<p>e d
e g
</p>
<p>ra
mm
</p>
<p>air
es 
</p>
<p>loc
ale
</p>
<p>se
xp
</p>
<p>rim
&#233;e
</p>
<p>s e
n X
</p>
<p>PA
TH
</p>
<p> :
Ex
</p>
<p>em
ple
</p>
<p>s :
w
</p>
<p>[1
][
</p>
<p>@c
a
</p>
<p>t
=
</p>
<p>'
de
</p>
<p>t'
] 
</p>
<p>an
d 
</p>
<p>w[
2]
</p>
<p>[@
c
</p>
<p>a
t
</p>
<p>=
'
</p>
<p>n
'
</p>
<p>]
a
</p>
<p>n
d 
</p>
<p>w[
3]
</p>
<p>[@
c
</p>
<p>a
t
</p>
<p>=
'
</p>
<p>v
'
</p>
<p>]
=
</p>
<p>&gt;
 
</p>
<p>GN
[d
</p>
<p>et
 
</p>
<p>n
] 
</p>
<p>V
4 :
</p>
<p> R
ec
</p>
<p>on
na
</p>
<p>iss
an
</p>
<p>ce
 pr
</p>
<p>&#233;d
ica
</p>
<p>tiv
e
</p>
<p>Ex
em
</p>
<p>ple
 :
</p>
<p>G
N[
</p>
<p>1]
[@
</p>
<p>se
m=
</p>
<p>'
hu
</p>
<p>m
'
</p>
<p>] 
an
</p>
<p>d 
GV
</p>
<p>[2
][
</p>
<p>@h
ea
</p>
<p>d=
'p
</p>
<p>r
e
</p>
<p>nd
re
</p>
<p>']
 a
</p>
<p>nd
 G
</p>
<p>N[
3]
</p>
<p>[@
s
</p>
<p>e
m
</p>
<p>=
'
</p>
<p>v
o
</p>
<p>ie
'
</p>
<p>]
</p>
<p>10
La
</p>
<p> p
hr
</p>
<p>as
e e
</p>
<p>xe
m
</p>
<p>pl
e e
</p>
<p>st 
tir
</p>
<p>&#233;e
 d
</p>
<p>u 
M
</p>
<p>on
de
</p>
<p> en
 li
</p>
<p>gn
e, 
</p>
<p>ar
tic
</p>
<p>le
 d
</p>
<p>u 
19
</p>
<p>/0
7/
</p>
<p>20
03
</p>
<p>N
iv
</p>
<p>e
a
</p>
<p>u
 d
</p>
<p>'a
n
</p>
<p>a
ly
</p>
<p>s
e
</p>
<p>In
fo
</p>
<p>s
L
</p>
<p>e
s
</p>
<p>je
u
</p>
<p>n
es
</p>
<p> 
p
</p>
<p>re
n
</p>
<p>n
e
</p>
<p>n
t
</p>
<p> le
s
</p>
<p> a
u
</p>
<p>to
ro
</p>
<p>u
te
</p>
<p>s
&#224;
</p>
<p> c
o
</p>
<p>n
tr
</p>
<p>e
-s
</p>
<p>e
n
</p>
<p>s
le
</p>
<p>1
4
</p>
<p>ju
ill
</p>
<p>e
t
</p>
<p>&#224;
1
</p>
<p>3
h
</p>
<p>3
5
</p>
<p>s
u
</p>
<p>r
la
</p>
<p>h
u
</p>
<p>it
i&#232;
</p>
<p>m
e
</p>
<p>a
v
</p>
<p>e
n
</p>
<p>u
e
</p>
<p>.
C
</p>
<p>o
m
</p>
<p>m
e
</p>
<p>nt
ai
</p>
<p>re
s
</p>
<p>T
y
</p>
<p>p
o
</p>
<p>g
ra
</p>
<p>p
h
</p>
<p>iq
u
</p>
<p>e
S
</p>
<p>ig
n
</p>
<p>w
w
</p>
<p>w
w
</p>
<p>w
w
</p>
<p>w
w
</p>
<p>n
u
</p>
<p>m
w
</p>
<p>w
tim
</p>
<p>e
w
</p>
<p>w
w
</p>
<p>w
p
</p>
<p>u
n
</p>
<p>ct
0
</p>
<p>T
yp
</p>
<p>e
h
</p>
<p>o
u
</p>
<p>r
te
</p>
<p>rm
1
</p>
<p>C
a
</p>
<p>se
tc
</p>
<p>lc
lc
</p>
<p>lc
lc
</p>
<p>lc
lc
</p>
<p>lc
lc
</p>
<p>lc
lc
</p>
<p>lc
lc
</p>
<p>lc
</p>
<p>M
o
</p>
<p>rp
h
</p>
<p>o
lo
</p>
<p>g
iq
</p>
<p>u
e
</p>
<p>m
o
</p>
<p>rp
h
</p>
<p>ca
t
</p>
<p>d
e
</p>
<p>t|p
ro
</p>
<p>a
d
</p>
<p>j|n
v
</p>
<p>d
e
</p>
<p>t|
p
</p>
<p>ro
n
</p>
<p>p
re
</p>
<p>p
n
</p>
<p>d
e
</p>
<p>t|
p
</p>
<p>ro
n
</p>
<p>p
re
</p>
<p>p
p
</p>
<p>re
p
</p>
<p>d
e
</p>
<p>t|
p
</p>
<p>ro
a
</p>
<p>d
j
</p>
<p>n
su
</p>
<p>b
_c
</p>
<p>at
d
</p>
<p>e
f|p
</p>
<p>e
rs
</p>
<p>de
f|
</p>
<p>p
e
</p>
<p>rs
d
</p>
<p>e
f|
</p>
<p>p
e
</p>
<p>rs
de
</p>
<p>f|p
er
</p>
<p>s
n
</p>
<p>u
m
</p>
<p>N
b
</p>
<p>p
lu
</p>
<p>p
lu
</p>
<p>G
e
</p>
<p>n
d
</p>
<p>e
r
</p>
<p>P
e
</p>
<p>rs
3
</p>
<p>3
T
</p>
<p>e
n
</p>
<p>se
p
</p>
<p>re
s
</p>
<p>M
o
</p>
<p>d
e
</p>
<p>in
d
</p>
<p>|s
u
</p>
<p>b
j
</p>
<p>5
. 
</p>
<p>A
n
</p>
<p>a
ly
</p>
<p>s
e
</p>
<p> s
y
</p>
<p>n
ta
</p>
<p>x
ic
</p>
<p>o
-s
</p>
<p>&#233;
m
</p>
<p>a
n
</p>
<p>ti
q
</p>
<p>u
e
</p>
<p>a
. D
</p>
<p>&#233;
s
</p>
<p>a
m
</p>
<p>b
ig
</p>
<p> m
o
</p>
<p>rp
h
</p>
<p>o
d
</p>
<p>e
t
</p>
<p>n
d
</p>
<p>e
t
</p>
<p>d
e
</p>
<p>t
d
</p>
<p>e
t
</p>
<p>2
b
</p>
<p>. 
P
</p>
<p>ro
je
</p>
<p>c
ti
</p>
<p>o
n
</p>
<p> d
ic
</p>
<p>t.
 A
</p>
<p>rg
u
</p>
<p>m
e
</p>
<p>n
ts
</p>
<p>S
e
</p>
<p>m
h
</p>
<p>u
m
</p>
<p>vo
ie
</p>
<p>vo
ie
</p>
<p>D
o
</p>
<p>m
c
</p>
<p>. 
R
</p>
<p>e
c
</p>
<p>o
n
</p>
<p>n
a
</p>
<p>is
s
</p>
<p>a
n
</p>
<p>c
e
</p>
<p> d
e
</p>
<p>s
 G
</p>
<p>ro
u
</p>
<p>p
e
</p>
<p>s
G
</p>
<p>N
G
</p>
<p>V
G
</p>
<p>N
G
</p>
<p>P
R
</p>
<p>E
P
</p>
<p>G
N
</p>
<p>G
P
</p>
<p>R
E
</p>
<p>P
G
</p>
<p>P
R
</p>
<p>E
P
</p>
<p>3
H
</p>
<p>e
a
</p>
<p>d
Je
</p>
<p>u
n
</p>
<p>e
P
</p>
<p>re
n
</p>
<p>d
re
</p>
<p>A
u
</p>
<p>to
ro
</p>
<p>u
te
</p>
<p>A
ve
</p>
<p>n
u
</p>
<p>e
</p>
<p>247</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Buvet, Cartier, Issac, Mejri
</p>
<p>6 Conclusion
Nous avons pr&#233;sent&#233; un prototype d'&#233;tiqueteur syntactico-s&#233;mantique int&#233;gr&#233; dans une plate-
forme d'analyse linguistique. La particularit&#233; de cet &#233;tiqueteur est d'utiliser le mod&#232;le
linguistique des classes d'objets. Celui-ci offre un moyen efficace de lier la syntaxe et la
s&#233;mantique au sein d'une structure. Du point de vue informatique, nous avons d&#233;crit un
syst&#232;me qui reprend les grandes &#233;tapes &#171; classiques &#187; en T.A.L., en nous appuyant sur des
ressources linguistiques, et en mettant au point un langage d'expression de grammaires locales
tr&#232;s proche d'une expression abstraite et quasi linguistique des ph&#233;nom&#232;nes. L'impl&#233;mentation
proprement dite de ce mod&#232;le a &#233;t&#233; r&#233;alis&#233; en respectant les normes (ou futures normes) et
recommandations reconnues.
</p>
<p>7 Bibliographie
BLANCO X et BUVET P.-A. (2004), &#171; Verbes supports et significations grammaticales.
Implications pour la traduction espagnol-fran&#231;ais &#187; in Lingvisticae Investigationes 27(2), John
Benjamins B.V., Amsterdam
BUVET P.-A. (&#224; para&#238;tre), &#171; D&#233;termination et figement au regard de la traduction &#187;, META.
BUVET P.-A. et MATHIEU-COLAS M. (1999), &#171; Les champs domaine et sous-domaine dans les
dictionnaires &#233;lectroniques &#187;, Cahiers de lexicologie, 75, Didier Erudition, Paris, pp. 173-191.
SABAH G. (1996), Le sens dans les traitements automatiques des langues &#8212; le point apr&#232;s 50
ans de recherches, conf&#233;rence invit&#233;e, journ&#233;e ATALA (un demi-si&#232;cle de traitement
automatique des langues : Paris.
GROSS G. (1995), &#171; Une s&#233;mantique nouvelle pour la traduction automatique : les classes
d&#8217;objets &#187;, in La Tribune des Industries de la Langue et l&#8217;Information &#233;lectronique, 17-18-19,
Paris.
GROSS G. et VIVES R. (1986), &#171; Les constructions nominales et l&#8217;&#233;laboration d&#8217;un lexique-
grammaire &#187;, Langue fran&#231;aise, 69, Larousse, Paris, pp. 5-27.
IDE, N., VERONIS, J., (1998). The state of the art. Computational Linguistics 24, 1&#8211;40,
Introduction to the Special Issue on Word Sense Disambiguation
LE PESANT D. et M. MATHIEU-COLAS (1998), &#171; Introduction aux classes d&#8217;objets &#187; in
Langages 131, Larousse, Paris.
MIHALCE R., EDMOND P. (Eds.), (2004). Proceedings of SENSEVAL-3 : Third International
Workshop on Evaluating Word Sense Disambiguation Systems
PREISS J., STEVENSON M., (2004). Word Sense Disambiguation, Computer Speech &amp;
language,Volume 18, Issue 3
PIAO S.L., ARCHER D., MUDRAYA O., RAYSON P., GARSIDE R., MCENERY T., WILSON A.
(2005) A Large Semantic Lexicon for Corpus Annotation. In proceedings of the Corpus
Linguistics 2005 conference, July 14-17, Birmingham, UK. Proceedings from the Corpus
Linguistics Conference Series on-line e-journal, Vol. 1, no. 1, ISSN 1747-9398.
VERONIS, J. (2004). &#171; Quels dictionnaires pour l'&#233;tiquetage s&#233;mantique ? &#187; Le fran&#231;ais
moderne, 72(1):27-38.
</p>
<p>248</p>

</div></div>
</body></html>