<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;tiquetage morpho-syntaxique de textes kabyles</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>&#201;tiquetage morpho-syntaxique de textes kabyles
</p>
<p>Sinikka LOIKKANEN
Universit&#233; d&#8217;Helsinki
</p>
<p>sinikka.loikkanen@helsinki.fi
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente la construction d&#8217;un &#233;tiqueteur morpho-syntaxique d&#233;ve-
lopp&#233; pour annoter un corpus de textes kabyles (1 million de mots). Au sein de notre projet,
un &#233;tiqueteur morpho-syntaxique a &#233;t&#233; d&#233;velopp&#233; et impl&#233;ment&#233;. Ceci inclut un analyseur mor-
phologique ainsi que l&#8217;ensemble de r&#232;gles de d&#233;sambigu&#239;sation qui se basent sur l&#8217;approche su-
pervis&#233;e &#224; base de r&#232;gles. Pour effectuer le marquage, un jeu d&#8217;&#233;tiquettes morpho-syntaxiques
pour le kabyle est propos&#233;. Les r&#233;sultats pr&#233;liminaires sont tr&#232;s encourageants. Nous obtenons
un taux d&#8217;&#233;tiquetage r&#233;ussi autour de 97 % des textes en prose.
</p>
<p>Abstract. This paper describes the construction of a morpho-syntactic tagger developed
to annotate our Kabyle text corpus (1 million words). Within our project, a part-of-speech tagger
has been developed and implemented. That includes a morphological analyser and a set of
disambiguation rules based on supervised rule-based tagging. To realise the annotation, a POS
tagset for Kabyle is proposed. The first results of tests are very encouraging. At present stage,
our tagger reaches 97 % of success.
</p>
<p>Mots-cl&#233;s : &#201;tiquetage morpho-syntaxique, corpus de textes, langue kabyle, berb&#232;re.
</p>
<p>Keywords: Part of speech tagging, text corpus, kabyle language, berber.
</p>
<p>1 Introduction
</p>
<p>L&#8217;&#233;tiquetage morpho-syntaxique automatique est une technologie relativement bien ma&#238;tris&#233;e.
Au moins pour les langues europ&#233;ennes comme l&#8217;anglais qui d&#233;j&#224; dispose de grands volumes de
corpus &#233;tiquet&#233;s. L&#8217;&#233;tiquetage morpho-syntaxique ou grammatical consiste &#224; affecter &#224; chaque
occurrence d&#8217;un corpus un symbole repr&#233;sentant sa cat&#233;gorie grammaticale (nom, verbe, ...) et,
&#233;ventuellement, les informations morphologiques associ&#233;es (masculin, singulier, ...) (Paroubek
&amp; Rajman, 2000). Les m&#233;thodes et les applications con&#231;ues pour une langue ne sont pas telles
quelles transf&#233;rables aux autres langues. Mais au niveau de l&#8217;annotation grammaticale, il y a
eu d&#8217;importants efforts d&#8217;harmonisation et de standardisation aux seins de projets internatio-
naux tels que MULTEXT (MUL, 1996) et EAGLES (EAG, 1996). Les recommandations et
les standards de ces projets rendent possible la comparabilit&#233; des diff&#233;rents corpus &#233;tiquet&#233;s en
plusieurs langues.
</p>
<p>Dans le cadre de notre projet, nous avons constitu&#233; un corpus de textes kabyles, CKL (corpus
kabyle litt&#233;raire). Le fond du corpus est constitu&#233; des six premiers romans kabyles publi&#233;s entre
1981&#8211;1995 dont le vocabulaire est pr&#233;sent&#233; dans notre m&#233;moire de DEA (Loikkanen, 1998).
Par la suite, le corpus a &#233;t&#233; progressivement compl&#233;t&#233; au fur et &#224; mesure de la disponibilit&#233;
</p>
<p>193</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sinikka LOIKKANEN
</p>
<p>de nouveaux textes. Le CKL comprend actuellement soixante textes int&#233;graux qui repr&#233;sentent
un million d&#8217;occurrences. Les textes repr&#233;sentent diff&#233;rents genres litt&#233;raires (romans, contes,
po&#232;mes, chansons, r&#233;cits) et couvrent diff&#233;rents th&#232;mes. Les romans repr&#233;sentent la moiti&#233; des
occurrences bien qu&#8217;ils ne repr&#233;sentent que 20 % des textes. Les textes sont num&#233;ris&#233;s, la struc-
ture balis&#233;e en XML1 selon les principes de TEI2 et la transcription est marqu&#233;e par Unicode3.
</p>
<p>Le kabyle est une langue pour laquelle le travail d&#8217;&#233;tiquetage est une t&#226;che nouvelle. Le kabyle
est une variante de la langue berb&#232;re parl&#233; en Kabylie, en Alg&#233;rie du Nord. Le berb&#232;re ou
tamazight (nom berb&#232;re de langue) est une langue afro-asiatique (ou chamito-s&#233;mitique) qui est
consid&#233;r&#233;e comme la langue autochtone de l&#8217;Afrique du Nord (Camps, 1987).
</p>
<p>Pour annoter notre corpus, nous avons con&#231;u et d&#233;velopp&#233; un &#233;tiqueteur ainsi qu&#8217;un jeu d&#8217;&#233;ti-
quettes morpho-syntaxiques. Dans ce qui suit, nous pr&#233;sentons d&#8217;abord notre jeu d&#8217;&#233;tiquettes
morpho-syntaxiques pour le kabyle. Puis, nous pr&#233;sentons les principes de l&#8217;analyse. Pour finir,
les premiers r&#233;sultats de cette annotation seront rapport&#233;s.
</p>
<p>2 Jeu d&#8217;&#233;tiquettes morpho-syntaxiques pour le kabyle
</p>
<p>Pour annoter notre corpus, nous avons &#233;labor&#233; un jeu d&#8217;&#233;tiquettes morpho-syntaxiques pour
le kabyle. Actuellement, il n&#8217;existe pas, &#224; notre connaissance, d&#8217;&#233;tudes disponibles ni de cata-
logues avec un classement morpho-syntaxique fin pour le kabyle ou pour les autres dialectes
du berb&#232;re. Dans les grammaires du kabyle (Mammeri, 1986; Mammeri, 1988; Na&#239;t-Zerrad,
2001), on trouve les descriptions pour les parties du discours comme nom, verbe, adjectif, ad-
verbe, pronom, pr&#233;position, conjonction, etc. ; on a appliqu&#233; tel quel au berb&#232;re les cat&#233;gories
grammaticales que l&#8217;on retrouvait, par exemple, dans les grammaires traditionnelles du fran-
&#231;ais. En fait, l&#8217;organisation des classes en berb&#232;re n&#8217;est pas radicalement diff&#233;rente de celle que
l&#8217;ont peut rencontrer dans les langues indo-europ&#233;ennes (Chaker, 1984). Si l&#8217;on n&#233;glige un cer-
tain nombre de ph&#233;nom&#232;nes secondaires et de formes isol&#233;es, les unit&#233;s syntaxiques du berb&#232;re
s&#8217;organisent en quatre grands ensembles qui sont 1) les verbes, 2) les noms, 3) les connecteurs
ou relationnels et 4) les d&#233;terminants divers. Les deux premiers sont des cat&#233;gories lexicales,
les deux derniers des cat&#233;gories grammaticales. Sous la classe de connecteurs, on regroupe tous
les indicateurs de relation, pr&#233;positions, subordonnants, conjonctions et connecteurs divers. La
classe des d&#233;terminants forme un ensemble h&#233;t&#233;rog&#232;ne o&#249; on peut isoler, entre autres, une sous-
cat&#233;gorie comme les adverbes (Chaker, 1984).
</p>
<p>Pour construire notre jeu d&#8217;&#233;tiquettes, nous avons d&#233;fini un classement aussi fonctionnel que
possible. Le jeu d&#8217;&#233;tiquettes s&#8217;inspire du projet EAGLES (EAG, 1996). Bien que ces recom-
mandations ne soient pas applicables telles quelles au kabyle, elles servent de point de d&#233;part
pour s&#8217;orienter vers des applications multilingues ainsi que la r&#233;utilisabilit&#233; et la comparabilit&#233;
d&#8217;&#233;tiquettes. Pour l&#8217;instant, notre jeu d&#8217;&#233;tiquettes contient 12 cat&#233;gories principales : nom (N),
verbe (V), adjectif (A), pronom (PR), adverbe (ADV), pr&#233;position (PREP), conjonction (C),
num&#233;ral (NU), interjection (I), particule (P), r&#233;sidu (R) et ponctuation (PU). Ces cat&#233;gories se
basent sur les parties du discours et sur les traits morphologiques d&#233;crits dans les grammaires
kabyles. Le jeu d&#8217;&#233;tiquetage est pr&#233;sent&#233; par les paires attribut&#8211;valeur, par exemple un nom com-
mun f&#233;minin singulier &#224; l&#8217;&#233;tat libre, comme taqcict &#8217;une fille&#8217;, est cod&#233; de la fa&#231;on suivante :
</p>
<p>1Extensible Markup Language, http ://www.w3.org/XML/
2Text Encoding Initiative, http ://www.tei-c.org/
3http ://unicode.org/
</p>
<p>194</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tiquetage morpho-syntaxique de textes kabyles
</p>
<p>N[type=commun genre=f&#233;minin nombre=singulier &#233;tat=libre] ou NCFSL.
</p>
<p>&#8211; Nom : Le nom kabyle varie en genre, en nombre et en &#233;tat4. Pour le nombre, outre les
formes du singulier et du pluriel, il existe une forme duelle emprunt&#233;e &#224; l&#8217;arabe, mais tr&#232;s
peu utilis&#233;e et on ne l&#8217;emploie que lorsqu&#8217;il s&#8217;agit de temps (cehr. ayen &#8217;deux mois&#8217;). L&#8217;&#233;tat
se manifeste par un changement d&#8217;une voyelle initiale et, &#233;ventuellement, par un ajout d&#8217;une
semi-consonne (w, y) au d&#233;but d&#8217;un mot pour les masculins commen&#231;ant par une voyelle, par
exemple axxam (&#233;tat libre) &#8217;maison&#8217; devient une forme wexxam (&#233;tat d&#8217;annexion). Mais, il
existe une partie importante de mots invariables en &#233;tat (les noms de parent&#233;, les emprunts au
fran&#231;ais et &#224; l&#8217;arabe), i.e. les mots n&#8217;ayant pas de modifications dans la forme et dont l&#8217;&#233;tat
n&#8217;est pas ainsi identifiable automatiquement hors contexte. Pour le nom kabyle, nous avons
ainsi d&#233;fini les attibuts suivants dont les valeurs sont pr&#233;sent&#233;es entre crochets :
</p>
<p>type [commun, propre], genre [masculin, f&#233;minin], nombre [singulier, pluriel, duel],
&#233;tat [libre, annexion, non-marqu&#233;].
</p>
<p>&#8211; Verbe : Les verbes kabyles sont flexionnels et varient en genre, en nombre et en personne.
Il existe trois aspects : l&#8217;aoriste, l&#8217;aoriste intensif (inaccompli) et le pr&#233;t&#233;rit (accompli), ainsi
que trois modes : l&#8217;indicatif, l&#8217;imp&#233;ratif et le participe. L&#8217;infinitif n&#8217;existe pas au sens o&#249; on
l&#8217;entend par exemple en fran&#231;ais ; le lemme ou la forme lexicale d&#8217;un verbe donn&#233; dans les
dictionnaires est la forme &#224; l&#8217;imp&#233;ratif de la 2e personne du singulier. Notre proposition pour
les paires attribut&#8211;valeur pour les verbes kabyles est la suivante :
</p>
<p>mode [indicatif, imp&#233;ratif, participe], th&#232;me [aoriste, aoriste intensif, pr&#233;t&#233;rit],
degr&#233; [positif, n&#233;gatif], nombre [singulier, pluriel], personne [1re, 2e, 3e],
genre [masculin, f&#233;minin, commun].
</p>
<p>&#8211; Adjectif : L&#8217;adjectif kabyle se forme principalement sur les verbes d&#8217;&#233;tat (aberkan &#8217;noir&#8217;
du verbe ibrik &#8217;&#234;tre noir&#8217;) ; par son type, il est qualificatif. Les formes secondaires sont les
formes emprunt&#233;es &#224; l&#8217;arabe, les formes invariables et les formes complexes (Chaker, 1995).
L&#8217;adjectif partage toutes les caract&#233;ristiques morphologiques du nom, il varie en genre, en
nombre et en &#233;tat, sauf les invariables. Les degr&#233;s de comparaison sont indiqu&#233;s avec les
verbes ou avec les pr&#233;positions, il n&#8217;y a pas de formes graphiques pour le comparatif ou pour
le superlatif de type bon &#8211; meilleur. Les paires attribut&#8211;valeur propos&#233;es sont les suivantes :
</p>
<p>genre [masculin, f&#233;minin, commun], nombre [singulier, pluriel],
&#233;tat [libre, annexion, non-marqu&#233;].
</p>
<p>&#8211; Pronom : Dans cette cat&#233;gorie, nous avons regroup&#233; diff&#233;rents types de pronoms et de d&#233;-
terminants, comme les pronoms personnels et les pronoms d&#233;monstratifs. Les pronoms per-
sonnels varient en genre, en nombre et en personne. Ils sont autonomes (netta &#8217;il, lui&#8217;) ou
des affixes (-k &#8217;&#224; toi&#8217;) li&#233;s &#224; un &#233;l&#233;ment comme nom, verbe, pr&#233;position, adverbe ou pr&#233;sen-
tatif (l&#8217;affixe du nom exprime la possession, l&#8217;affixe du verbe marque le compl&#233;ment direct
ou indirect, l&#8217;affixe des pr&#233;positions et l&#8217;affixe des adverbes joignent l&#8217;&#233;tat ou l&#8217;action &#224; une
personne). Les d&#233;monstratifs forment un groupe d&#233;terminatif sp&#233;cial. Il s&#8217;agit du groupe des
unit&#233;s fr&#233;quentes et largement cultiv&#233;es dans le parl&#233; indiquant la situation d&#8217;un objet par
rapport au locuteur. Ils sont autonomes ou suffix&#233;s au noms ; les premiers varient en genre et
en nombre, les derniers sont invariables. Les paires propos&#233;es sont les suivantes :
</p>
<p>type [personnel, d&#233;monstratif, ind&#233;fini, interrogatif, relatif],
position [autonome, affixe], pers-type [nom, pr&#233;position, verbe],
</p>
<p>4&#201;tat : Il s&#8217;agit d&#8217;un concept grammatical repr&#233;sentant un couple oppositif &#233;tat libre / &#233;tat d&#8217;annexion dans
lequel la forme du nom change. L&#8217;&#233;tat d&#8217;annexion marque la d&#233;pendance du nom par rapport aux autres &#233;l&#233;ments
de la phrase (Chaker, 1995).
</p>
<p>195</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sinikka LOIKKANEN
</p>
<p>nombre [singulier, pluriel], personne [1re, 2e, 3e], genre [masculin, f&#233;minin, commun],
location [proximit&#233;, &#233;loignement, absence].
</p>
<p>&#8211; Adverbe : Mot invariable, sauf quelques exceptions qui portent la forme nominale et qui
varient en &#233;tat. Par son type, l&#8217;adverbe d&#233;crit le temps (azekka &#8217;demain&#8217;), la mani&#232;re (bat.el
&#8217;gratuitement&#8217;), la quantit&#233; (mlih. &#8217;beaucoup&#8217;) ou le lieu (ber. r. a &#8217;dehors&#8217;).
</p>
<p>&#8211; Pr&#233;position : Les pr&#233;positions sont invariables, utilis&#233;es isol&#233;ment devant un nom (zdat
wexxam &#8217;devant la maison&#8217;) ou avec les affixes personnels (zdat-i &#8217;devant moi&#8217;).
</p>
<p>&#8211; Conjonction : Elles sont de types de coordination (ihi &#8217;donc&#8217;, walakin &#8217;mais&#8217;) et de subordi-
nation (mi &#8217;quand&#8217;, qbel &#8217;avant que&#8217;). Certaines d&#8217;elles sont utilis&#233;es dans les deux cas.
</p>
<p>&#8211; Num&#233;ral : Ils sont de types cardinal (tlata &#8217;trois&#8217;) ou ordinal (wis tlata &#8217;troisi&#232;me&#8217;). Ils varient
en genre sauf les num&#233;raux emprunt&#233;s &#224; l&#8217;arabe qui ne s&#8217;accordent pas en kabyle.
</p>
<p>&#8211; Particule : Elles sont de petits mots invariables servant &#224; pr&#233;ciser le sens d&#8217;autres mots. Dans
les recommandations EAGLES, certains de ces &#233;l&#233;ments sont regroup&#233;s sous la cat&#233;gorie
&#8217;unique/unassigned&#8217;. Les particules sont : particule de l&#8217;aoriste (ad), particule pr&#233;dicative (d),
particule de n&#233;gation (ur), particule compl&#233;tive de n&#233;gation (ara), particule vocative (a), par-
ticule exclamative (ack-), particule pr&#233;sentative (aql-) et particule d&#8217;orientation (d, n).
</p>
<p>3 Le probl&#232;me de la variabilit&#233; des transcriptions
</p>
<p>Les textes du CKL datent de diff&#233;rentes d&#233;cennies, les premiers viennent de la fin du 19e si&#232;cle,
les plus r&#233;cents sont de l&#8217;ann&#233;e 2006. Bien que les principes de la notation (PNB, 1996; ALB,
1998) soient bien &#233;tablis, on trouve dans la pratique des transcriptions diff&#233;rentes.
&#8211; Au niveau des lettres les variations se manifestent en diff&#233;rents choix graphiques :
</p>
<p>(1) e&#231;&#231; = ec&#780;c&#780; &#8217;manger&#8217;, h. emmel = h&#728;
emmel &#8217;aimer&#8217;, d. leb = d.&#772; leb &#8217;demander&#8217;,
</p>
<p>imjuhad = img&#780;uhad &#8217;combattant&#8217;, taabbut. = ta&#226;bbut. = taEbbut. &#8217;ventre&#8217;.
</p>
<p>&#8211; Au niveau des mots, il y a des h&#233;sitations concernant le nombre des consonnes &#224; &#233;crire :
</p>
<p>(2) claGem = cclaGem &#8217;moustache&#8217;, tagara = taggara &#8217;moment&#8217;, tidet = tidett &#8217;v&#233;rit&#233;&#8217;,
</p>
<p>le placement d&#8217;un point emphatique :
</p>
<p>(3) ad. ar. = ad. ar = adar. &#8217;pied&#8217;, as. ad. uf = asad. uf &#8217;loi&#8217;, lbarud. = lbar. ud &#8217;poudre &#224; canon&#8217;,
</p>
<p>ou la notation de la labio-v&#233;larisation des consonnes v&#233;laires et labiales :
</p>
<p>(4) ameqran = ameq&#778;ran = ameq&#9702;ran = ameqwran = ameqwran &#8217;grand&#8217;.
</p>
<p>&#8211; Au niveau des phrases, les variations se manifestent par l&#8217;assimilation phon&#233;tiques aux fron-
ti&#232;res des mots :
</p>
<p>(5) t&#807;-t&#807;idet&#807;&#8592; d tidet&#807;, a d awi&#8592; a d-tawi.
</p>
<p>ou par la pr&#233;sence ou l&#8217;absence d&#8217;un tiret entre le nom ou le verbe et leurs affixes :
</p>
<p>(6) yellis = yelli-s = yell-is = yelli s &#8217;sa fille&#8217;.
</p>
<p>Finalement, la position du @-muet pose certains probl&#232;mes. Il s&#8217;agit d&#8217;une voyelle neutre qui
n&#8217;a pas de statut phonologique et dont la situation d&#233;pend de ce qui l&#8217;entoure. Par convention
il est not&#233; par une lettre &#8217;e&#8217; dans tous les textes kabyles &#224; quelques exceptions pr&#232;s. On ne peut
pas nier son existence, au niveau graphique sa pr&#233;sence est importante : 12 % des lettres parmi
toutes les lettres dans les six premiers romans kabyles (le deuxi&#232;me rang apr&#232;s la lettre &#8217;a&#8217;). Le
placement de cet &#8217;e&#8217; varie d&#251; &#224; l&#8217;encha&#238;nement des mots :
</p>
<p>(7) iger &#8217;il a mis&#8217;, mais yegr-as &#8217;il lui a mis&#8217; au lieu d&#8217;&#233;crire iger-as.
</p>
<p>196</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tiquetage morpho-syntaxique de textes kabyles
</p>
<p>Pour g&#233;rer toutes ces variations et pour annoter le corpus, nous avons d&#233;velopp&#233; un analyseur
qui se base sur les expressions r&#233;guli&#232;res dans la reconnaissance des mots. Ainsi, nous trou-
vons des occurrences qu&#8217;elles soient &#233;crites avec une ou plusieurs consonnes similaires au sein
d&#8217;un mot (c{1,}laGem), avec ou sans point sous la lettre (a(d|d. )a(r|r.)) ou qu&#8217;elles soient &#233;crites
diff&#233;remment &#224; cause de l&#8217;assimilation, comme pour le mot abrid &#8217;chemin&#8217; &#224; l&#8217;&#233;tat d&#8217;annexion :
</p>
<p>(8) [g] brid &#8212; [deg&#778;g&#778;]-ebrid &#8212; [deg]-gwebrid &#8212; [deg]-webrid &#8212; [f]-febrid &#8212;
[anebdu] bwebrid &#8212; [tikli] bbwebrid &#8212; wubrid &#8212; ubrid.
</p>
<p>Le probl&#232;me de la variabilit&#233; des transcriptions a ces cons&#233;quences aussi dans la segmenta-
tion des mots. La segmentation par des blancs n&#8217;est pas suffisante. Pour avoir des occurrences
analogues, les unit&#233;s textuelles sont ou d&#233;coup&#233;es ou regroup&#233;es ou bien les deux &#224; la fois :
&#8211; Les cha&#238;nes sont d&#233;coup&#233;es lorsqu&#8217;il s&#8217;agit des affixes reli&#233;s par un trait d&#8217;union au mot
</p>
<p>auquel ils se rapportent. Parfois les m&#234;mes unit&#233;s sont &#233;crites ensemble sans tiret entre les
composants. Par exemple, les compositions yemma s | yemma-s | yemmas &#8217;sa m&#232;re&#8217;.
</p>
<p>&#8211; Les unit&#233;s sont regroup&#233;es lorsqu&#8217;il s&#8217;agit des noms compos&#233;es (adrar ufud &#8217;tibia (montagne
de jambe)&#8217;, Ait Ahmed) ou les num&#233;raux compos&#233;s (xems meyya &#8217;cinq cents&#8217;). Un grand
groupe causant des h&#233;sitations dans l&#8217;&#233;criture sont les pr&#233;positions complexes ; nous avons
r&#233;uni les composants s&#233;par&#233;s par des blancs, par exemple, pour seddaw &#8217;en-dessous de&#8217;, nous
avons aussi les formes s ddaw | s eddaw | s-eddaw | si ddaw.
</p>
<p>&#8211; Parfois, les cha&#238;nes sont reconstruites. Par exemple, la composition comme aqli-y-i &#8217;me voici&#8217;
est d&#233;coup&#233;e aux fronti&#232;res des mots, puis, le reste a &#233;t&#233; regroup&#233; pour avoir des occurrences
analogues (aql&#8214; i-y-i) &#224; une forme &#171; canoniques &#187; aql-iyi &#8217;me voici&#8217;.
</p>
<p>4 Analyse morphologique
</p>
<p>&#192; cause de la transcription tr&#232;s instable, l&#8217;&#233;num&#233;ration de toutes les formes dans un lexique est
une t&#226;che impossible. En fait, nous n&#8217;avons pu utiliser les listes pr&#233;alablement &#233;tablies que pour
les mots de classes grammaticales. Pour les autres classes, notamment pour les verbes et les
noms, nous avons adopt&#233; une autre approche.
</p>
<p>Bien que le kabyle soit une langue o&#249; la construction des mots se base principalement sur
l&#8217;usage des racines, l&#8217;analyse se basant sur le mod&#232;le &#171; interdigitation &#187; de style s&#233;mitique n&#8217;est
pas applicable telle quelle. Premi&#232;rement, parce que l&#8217;alternance vocalique n&#8217;est pas sch&#233;ma-
tique ni toujours possible &#224; pr&#233;voir, et deuxi&#232;mement, les racines kabyles ne portent pas un
sens unique par racine. En fait, il existe plusieurs racines avec plusieurs champs s&#233;mantiques
distincts, par exemple, la racine
</p>
<p>&#8730;
br a une vingtaine de sens diff&#233;rents.
</p>
<p>Pour notre analyseur, nous avons fix&#233; les exigences suivantes :
</p>
<p>1. La langue que nous allons analyser se base sur l&#8217;utilisation des racines ; l&#8217;analyse doit
produire de chaque forme au minimum un lemme et les consonnes de la racine.
</p>
<p>2. L&#8217;analyseur doit identifier toutes les formes avec toutes les transcriptions possibles et
rendre les descriptions morphologiques.
</p>
<p>3. Pour identifier les formes, l&#8217;analyse se base sur l&#8217;extraction des stemmes, &#224; partir desquels
on d&#233;rive les lemmes et les racines.
</p>
<p>4. Les d&#233;pendances de longues distances doivent &#234;tre respect&#233;es, seulement les couples d&#8217;af-
fixe &#171; l&#233;gaux &#187; seront accept&#233;s.
</p>
<p>197</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sinikka LOIKKANEN
</p>
<p>Par les couples d&#8217;affixe &#171; l&#233;gaux &#187; on comprend les paires pr&#233;fixes&#8211;suffixes correctes qui
forment les mots. Par exemple, pour les verbes ordinaires nous avons 9 formes conjugu&#233;es
en personne, 3 formes pour l&#8217;imp&#233;ratif et 5 formes de participe. Parmi ces formes, trois pr&#233;fixes
(&#8709;-, t- et i-, dont le dernier peut se manifester aussi comme y-) et 3 suffixes (-mt, -n et
-&#8709;) sont ambigus. Les couples l&#233;gaux sont les paires qui se r&#233;alisent correctement.
</p>
<p>Pour construire un analyseur, on pourrait bien former trois listes dont la premi&#232;re pour les pr&#233;-
fixes, la deuxi&#232;me pour les stemmes et la troisi&#232;me pour les suffixes, et construire un automate
sur ces trois listes. Le probl&#232;me dans cette approche est ce que le nombre de stemmes diff&#233;rents
peut devenir relativement grand &#224; cause des diff&#233;rentes notations utilis&#233;es dont nous ignorons a
priori la nature des variations. Notre solution est l&#8217;identification des composants en expressions
r&#233;guli&#232;res. Initialement, nous n&#8217;avons les listes num&#233;riques que pour les affixes, pas celles de
stemmes ou de racines. Ces derni&#232;res sont ici d&#233;riv&#233;es &#224; partir des donn&#233;es du corpus. Notre
analyseur identifie d&#8217;abord les composantes morphologiques des formes donn&#233;es, puis, &#224; par-
tir des stemmes obtenus, l&#8217;identification des racines et des lemmes est effectu&#233;e. Par exemple,
pour la forme pr&#233;t&#233;rit d&#8217;un verbe comme turgamt &#8217;vous (f.) avez r&#234;v&#233;&#8217; la base de l&#8217;analyse est le
stemme urga (racine : rg ; vocalisation : u-a ; stemme : urga &#8217;pr&#233;t&#233;rit&#8217; ; affixes : t-, -mt ; lemme :
argu &#8217;r&#234;ver&#8217;) auquel on ajoute les affixes par la concat&#233;nation. Pour extraire ces composants,
une r&#232;gle est d&#233;finie :
</p>
<p>if ($w =&#732; /(&#710;t)(.*?)mt$/) { $stemme = $2; }
</p>
<p>Cette r&#232;gle veut dire que si la forme commence par t- et finisse par -mt, la forme est vraisem-
blablement une forme verbale de la 2e personne f&#233;minine du pluriel. Ce qui reste, dans le milieu
dans la variable $2, est le stemme avec toutes les transcriptions possibles. &#192; partir de ce stemme
nous obtenons les consonnes de la racine, le lemme et l&#8217;information concernant l&#8217;aspect verbal.
Ce n&#8217;est que dans cette phase que l&#8217;on recourt &#224; l&#8217;aide des dictionnaires pour d&#233;finir la forme du
lemme. Par exemple, pour les motifs tegremt et tersemt, pour lesquels on obtient les stemmes
egre et erse respectivement, on d&#233;fini ainsi avec les dictionnaires les formes du lemme qui sont
pour ces verbes ger &#8217;mettre&#8217; et ers &#8217;descendre ; se poser ; se calmer&#8217;.
</p>
<p>5 D&#233;sambigu&#239;sation
</p>
<p>On s&#8217;appuie sur l&#8217;approche &#224; base de r&#232;gles. On tente de minimiser l&#8217;ambigu&#239;t&#233; par l&#8217;analyse
du contexte proche ; ce processus repose sur l&#8217;hypoth&#232;se que la cat&#233;gorie d&#8217;un mot d&#233;pend d&#8217;un
contexte local, i.e. de la cat&#233;gorie d&#8217;un mot pr&#233;c&#233;dent ou suivant (fen&#234;tre = 1). Les d&#233;finitions
se basent ou sur les cat&#233;gories grammaticales ou sur les cat&#233;gories grammaticales et les traits
morphologiques. Les r&#232;gles contextuelles &#224; d&#233;finir sont de types :
</p>
<p>&#171; si X est marqu&#233; NOM et VERBE, et que X est pr&#233;c&#233;d&#233; d&#8217;un Y marqu&#233;
PREP, alors l&#8217;&#233;tiquette VERBE doit &#234;tre supprim&#233;e de X &#187;
</p>
<p>&#171; si X = &#8217;d&#8217;, et que X est suivi d&#8217;un Z marqu&#233; NOM+EA, alors
</p>
<p>X = &#8217;PREP&#8217; &#187;
</p>
<p>Ces r&#232;gles reposent sur l&#8217;analyse des mots proches qui peuvent eux-m&#234;mes &#234;tre ambigus, dans
ces cas, les r&#232;gles fonctionnent en cascade. Prenons par exemple la forme yesli (figure 1) dans
une cha&#238;ne comme axxam n yesli &#8217;la maison du jeune mari&#233;&#8217; (exemple 9) dans laquelle nous
avons deux mots avec deux interpr&#233;tations :
(9) axxam
</p>
<p>NOM
maison
</p>
<p>n
X
?
</p>
<p>yesli
X
?
</p>
<p>198</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tiquetage morpho-syntaxique de textes kabyles
</p>
<p>FIG. 1 &#8211; D&#233;but de la concordance de la forme yesli dans le CKL.
</p>
<p>n : 1) pr&#233;position &#8217;de, appartenant &#224;&#8217; ; 2) particule d&#8217;orientation &#8217;vers ici&#8217;.
yesli : 1) nom commun masculin singulier isli &#8217;jeune mari&#233;&#8217;, la forme &#224; l&#8217;&#233;tat d&#8217;annexion ;
</p>
<p>2) pr&#233;t&#233;rit n&#233;gatif du verbe sel &#8217;entendre&#8217;, forme masculine 3e personne du singulier
&#8217;il n&#8217;a pas entendu&#8217;.
</p>
<p>Les deux X sont r&#233;solus en deux phases : dans la premi&#232;re phase, on d&#233;fini que n est une
pr&#233;position s&#8217;il est pr&#233;c&#233;d&#233; d&#8217;un nom ou d&#8217;un pronom et, dans la deuxi&#232;me, on d&#233;fini que yesli
est un nom comme il a &#233;t&#233; pr&#233;c&#233;d&#233; d&#8217;une pr&#233;position. Ces r&#232;gles excluent les interpr&#233;tations
n = particule d&#8217;orientation et yesli = verbe qui se manifestent dans les phrases comme :
</p>
<p>(10) a n yuGal : particule de l&#8217;aoriste + particule d&#8217;orientation + verbe
ur yesli : particule de n&#233;gation + verbe.
</p>
<p>Dans certains cas, pour r&#233;soudre des ambigu&#239;t&#233;s, la fen&#234;tre a &#233;t&#233; &#233;tendue &#224; couvrir les cas &#177;2,
et m&#234;me plus, de mani&#232;re &#224; encadrer des classes grammaticales (affixes personnels, d&#233;monstra-
tifs). Cela rend possible la r&#233;solution des cas comme :
</p>
<p>(11) axxam-nni n yesli &#8217;la maison (en question, dont on parle) du jeune mari&#233;&#8217;.
</p>
<p>Les r&#232;gles contextuelles se basant sur les cat&#233;gories grammaticales ou sur les cat&#233;gories gram-
maticales et les traits morphologiques ne peuvent pas toujours lever l&#8217;ambigu&#239;t&#233;. Prenons
comme exemple un mot kabyle tr&#232;s fr&#233;quent comme d, qui a, entre autres, les sens 1) parti-
cule pr&#233;dicative &#8217;c&#8217;est, ce sont&#8217; et 2) pr&#233;position &#8217;et, avec&#8217;. Le sens de ce d peut &#234;tre distingu&#233;,
lorsqu&#8217;il pr&#233;c&#232;de un nom, par l&#8217;&#233;tat de ce nom : si le nom qui suit est &#224; l&#8217;&#233;tat libre (EL), d a le
sens 1 (exemple 12), si le nom qui suit est &#224; l&#8217;&#233;tat d&#8217;annexion (EA), d a le sens 2 (exemple 13).
</p>
<p>(12) argaz
homme
</p>
<p>d
c&#8217;est
</p>
<p>aGyul
&#226;ne+EL
</p>
<p>l&#8217;homme est un &#226;ne
</p>
<p>(13) argaz
homme
</p>
<p>d
et
</p>
<p>weGyul
&#226;ne+EA
</p>
<p>l&#8217;homme avec un &#226;ne
</p>
<p>Mais, si le nom qui suit ne porte pas la marque de variation de l&#8217;&#233;tat, comme par exemple dans
l&#8217;&#233;nonc&#233; argaz d mmi-s (exemple 14), nous avons deux sens selon le contexte : 1) l&#8217;homme,
c&#8217;est son fils, 2) l&#8217;homme et son fils. Nous marquerons par EI (&#233;tat invariable) les noms ne
changeant pas de forme au d&#233;but du mot.
</p>
<p>199</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sinikka LOIKKANEN
</p>
<p>(14) argaz
homme
</p>
<p>d
d
</p>
<p>mmi
fils+EI
</p>
<p>-s
son
</p>
<p>l&#8217;homme? son fils
</p>
<p>Dans ce dernier cas, pour enlever les ambigu&#239;t&#233;s d&#8217;une fa&#231;on automatique, on pensait &#224; recourir
aux m&#233;thodes statistiques de d&#233;sambigu&#239;sation, mais les premiers tests effectu&#233;s ne confortent
pas cette approche.
</p>
<p>6 Tests et r&#233;sultats
</p>
<p>Nous avons test&#233; notre syst&#232;me avec deux s&#233;ries d&#8217;extraits de corpus. La premi&#232;re s&#233;rie a &#233;t&#233;
utilis&#233;e comme corpus d&#8217;apprentissage pour la d&#233;finitions des r&#232;gles de d&#233;sambigu&#239;sation, la
deuxi&#232;me pour la validation. Les corpus de test ont &#233;t&#233; construits &#224; partir des fragments de textes
bruts de prose (contes, r&#233;cits, romans). Pour la premi&#232;re s&#233;rie, on a pris de 6 textes diff&#233;rents les
premiers 12000 bytes par texte. Cette quantit&#233; a puis &#233;t&#233; compl&#233;t&#233;e pour terminer les derni&#232;res
phrases obtenues jusqu&#8217;au point suivant terminant la phrase. Cela fait 1800&#8211;2500 mots par
fragment (compt&#233;s par des blancs). Apr&#232;s la segmentation, le nombre se fixait entre 2000&#8211;2300.
</p>
<p>Apr&#232;s l&#8217;analyse morphologique hors contexte, on constate qu&#8217;en moyenne un quart des mots
&#233;tait marqu&#233; comme ambigu. Sur la base de ces cas ambigus, on a &#233;crit une centaine de r&#232;gles
de d&#233;sambigu&#239;sation. Les r&#233;sultats sont v&#233;rifi&#233;s manuellement et, en cas d&#8217;erreurs, les r&#232;gles
sont corrig&#233;es, l&#8217;algorithme ex&#233;cut&#233; et le r&#233;sultat v&#233;rifi&#233;. Finalement, on a obtenu 150 r&#232;gles
&#233;crites. De cette mani&#232;re on a construit it&#233;rativement un ensemble de r&#232;gles de d&#233;sambigu&#239;sa-
tion. Apr&#232;s l&#8217;application de ces r&#232;gles, il ne nous restait qu&#8217;en moyenne 1 % de cas ambigus.
Le taux de r&#233;ussite de la d&#233;sambigu&#239;sation est d&#233;finit comme le pourcentage d&#8217;&#233;tiquettes assi-
gn&#233;es correctes par rapport au nombre total d&#8217;&#233;tiquettes assign&#233;es. Voir le tableau r&#233;capitulatif
(tableau 1) o&#249; les r&#233;sultats du premier tour avec les six fragments textuels.
</p>
<p>1 2 3 4 5 6 7
Na wb &lt;w&gt;c X Sd X S %e X Df %-finalg
</p>
<p>F1 1988 2314 623 26,9 31 98,6
F2 2514 2321 678 29,2 13 99,4
F3 2262 2189 488 22,3 23 98,9
F4 2064 2150 495 23,0 15 99,3
F5 2082 2052 382 18,6 8 99,6
F6 1803 2198 542 24,7 13 99,4
a Num&#233;ro de fragment.
b Nombre des mots w dans le texte brut, d&#233;coupage par des blancs.
c Nombre des mots &#233;tiquet&#233;s en balise &lt;w&gt; ... &lt;/w&gt; (hors ponctuation).
d Nombre des cas X, i.e. des mots ayant de multiples interpr&#233;tations, dans les textes segment&#233;s correctement
apr&#232;s l&#8217;analyse morphologique, avant l&#8217;application des r&#232;gles de d&#233;sambigu&#239;sation.
</p>
<p>e Pr&#233;c&#233;dant en pourcentage.
f Nombre des cas X restant ambigus apr&#232;s l&#8217;application des r&#232;gles de d&#233;sambigu&#239;sation.
g Pourcentage d&#8217;&#233;tiquettes r&#233;ussites.
</p>
<p>TAB. 1 &#8211; R&#233;sultats du premier tour.
</p>
<p>Les cas restants encore ambigus, environ 1 %, sont les cas o&#249; X = d et pour lesquels nous
n&#8217;avons pas pu &#233;crire des r&#232;gles, par exemple, comme dans la phrase suivante (exemple 15) :
</p>
<p>200</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tiquetage morpho-syntaxique de textes kabyles
</p>
<p>(15) yekseb
VPS3M
il-a-poss&#233;d&#233;
</p>
<p>tamet.t.ut
NCFSL
une-femme
</p>
<p>d
X
?
</p>
<p>lall
NCFSI
propri&#233;taire
</p>
<p>n
PREP
de
</p>
<p>nnif
NCMSI
honneur
</p>
<p>d
X
?
</p>
<p>lh. er.ma
NCFSI
respect
</p>
<p>il avait une femme (c&#8217;est une propri&#233;taire) d&#8217;honneur et de sacr&#233;e
</p>
<p>Pour d&#233;sambigu&#239;ser ces cas automatiquement, on a examin&#233; les distributions des cas X = d
dans les fragments du corpus d&#8217;apprentissage en gardant &#224; l&#8217;esprit les m&#233;thodes probabilistes
de d&#233;sambigu&#239;sation. Les nombres obtenus &#233;taient
</p>
<p>d = PO (particule d&#8217;orientation) : 50 %
d = PD (particule pr&#233;dicative) : 40 %
d = PREP (pr&#233;position) : 10 %.
</p>
<p>Parmi les cas qui restaient encore ambigus et que nous avons ensuite annot&#233;s manuellement, la
distribution des cas X = d est la suivante :
</p>
<p>d = PO (particule d&#8217;orientation) : 0 %
d = PD (particule pr&#233;dicative) : 60 %
d = PREP (pr&#233;position) : 40 %.
</p>
<p>Ces nombres indiquent que pour r&#233;soudre les derniers cas X = d (+ N+EI, nom &#224; l&#8217;&#233;tat inva-
riable) la r&#233;solution doit &#234;tre cherch&#233;e ailleurs ; les m&#233;thodes probabilistes simples ne sont pas
capables de les r&#233;soudre lorsqu&#8217;on obtient des r&#233;partitions presque &#233;gales (40 % / 60 %).
</p>
<p>La deuxi&#232;me s&#233;rie de test (tableau 2), validation des r&#232;gles, a &#233;t&#233; effectu&#233;e avec deux fragments
de texte plus larges. Pour cela, on a pris les premiers 50000 bytes de deux textes bruts en
prose (un roman, un conte) qui ont ensuite &#233;t&#233; compl&#233;t&#233;s pour terminer les derni&#232;res phrases
obtenues jusqu&#8217;au point suivant terminant la phrase. Ces deux textes n&#8217;ont pas &#233;t&#233; utilis&#233;s dans
la d&#233;rivation des r&#232;gles de d&#233;sambigu&#239;sation (serie 1 ci-dessus). La validation est faite avec les
r&#232;gles d&#233;finies dans le premier test. Cette fois, le taux de r&#233;solution du texte a atteint 97 %.
En examinant les listes des cas restant non r&#233;solus, on constate qu&#8217;il y a 1) des cas o&#249; X = d
(+ N+EI), 2) des nouveaux casX pour lesquels il n&#8217;y avait pas encore de r&#232;gles ainsi que 3) des
cas pour lesquels les r&#232;gles d&#233;j&#224; existaient mais qui restaient ambigus &#224; cause de la transcription
variable.
</p>
<p>1 2 3 4 5 6 7
Na wb &lt;w&gt;c X Sd X S %e X Df %-finalg
</p>
<p>T1 8289 9335 2169 23,2 162 98,2
T2 8074 9007 2055 22,8 239 97,3
</p>
<p>a&#8722;&#8722;g Voir les explications ci-dessus, tableau 1.
</p>
<p>TAB. 2 &#8211; R&#233;sultats du deuxi&#232;me tour.
</p>
<p>7 Conclusions et perspectives
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; notre travail sur l&#8217;&#233;tiquetage d&#8217;un corpus kabyle litt&#233;-
raire. L&#8217;&#233;tiquetage morpho-syntaxique est une t&#226;che nouvelle dans le domaine du berb&#232;re. Il
n&#8217;existe, &#224; notre connaissance, aucun corpus kabyle, ni berb&#232;re, sous format num&#233;rique qui soit
grammaticalement annot&#233;, publi&#233; et disponible. Au sein de notre projet, nous avons construit
</p>
<p>201</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sinikka LOIKKANEN
</p>
<p>un &#233;tiqueteur, un jeu d&#8217;&#233;tiquettes morpho-syntaxiques ainsi qu&#8217;un formalisme pour r&#233;soudre les
ambigu&#239;t&#233;s dues aux homographes. Notre &#233;tiqueteur est constitu&#233; de trois modules : le segmen-
teur, l&#8217;analyseur et le d&#233;sambigu&#239;sateur. Dans toutes les &#233;tapes, les sp&#233;cificit&#233;s du corpus ont &#233;t&#233;
prises en compte.
</p>
<p>Les r&#233;sultats pr&#233;liminaires des tests effectu&#233;s sont tr&#232;s encourageants. La d&#233;sambigu&#239;sation faite
&#224; base de r&#232;gles a pu atteindre un taux d&#8217;&#233;tiquetage correct de 97 % des textes en prose.
</p>
<p>La construction d&#8217;un &#233;tiqueteur morpho-syntaxique pour une langue pour laquelle les ressources
num&#233;riques (lexiques, textes annot&#233;s) et les d&#233;finitions formelles sont encore en cours de d&#233;-
veloppement est un processus qui avance pas &#224; pas. Avec notre m&#233;thode nous produisons &#224;
partir des donn&#233;es du corpus les ressources qui manquent : les premi&#232;res listes num&#233;riques des
stemmes, des lemmes et des racines qui peuvent &#234;tre utilis&#233;es ult&#233;rieurement dans les futures
versions de l&#8217;&#233;tiqueteur. Dans les perspectives d&#8217;&#233;valuation du jeu d&#8217;&#233;tiquettes, une analyse plus
profonde concernant les parties du discours et la cat&#233;gorisation des mots grammaticaux est envi-
sag&#233;e. La pr&#233;cision et l&#8217;extension des r&#232;gles de d&#233;sambigu&#239;sation ainsi que de nouveaux tests se
basant sur ces r&#232;gles plus &#233;tendues avec des donn&#233;es sur une grande &#233;chelle sont aussi pr&#233;vues.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALB (1998). Am&#233;nagement linguistique de la langue berb&#232;re. Inalco, Paris. http://www.
inalco.fr/crb/docs_pdf/amenage1998.pdf [10.9.2006].
</p>
<p>CAMPS G. (1987). Les Berb&#232;res. M&#233;moire et identit&#233;. Paris : &#201;ditions Errance.
</p>
<p>CHAKER S. (1984). Textes en Linguistiques Berb&#232;re. Introduction au domaine berb&#232;re.
CNRS.
</p>
<p>CHAKER S. (1995). Linguistique berb&#232;re. &#201;tude de syntaxe et de diachronie. Paris : Peeters.
</p>
<p>EAG (1996). EAGLES, Recommendations for the Morphosyntactic Annotation of Corpora.
EAGLES Document EAG-TCWG-MAC/R. http://www.ilc.cnr.it/EAGLES96/
home.html [15.1.2007].
</p>
<p>LOIKKANEN S. (1998). Vocabulaire du roman kabyle (1981&#8211;1995). Une &#233;tude quantitative.
&#201;tudes et documents berb&#232;re, 15&#8211;16, 185&#8211;196.
</p>
<p>MAMMERI M. (1986). Pr&#233;cis de grammaire berb&#232;re (kabyle). Paris : AWAL.
</p>
<p>MAMMERI M. (1988). Tajer. r. umt n tmaziGt (tantala taqbaylit). Paris : AWAL/La D&#233;couverte.
</p>
<p>MUL (1996). Multilingual Text Tools and Corpora. http://www.lpl.univ-aix.fr/
projects/multext [15.1.2007].
</p>
<p>NA&#207;T-ZERRAD K. (2001). Grammaire moderne du kabyle. Tajerrumt tatrart n teqbaylit. Pa-
ris : Karthala.
</p>
<p>PAROUBEK P. &amp; RAJMAN M. (2000). &#201;tiquetage morpho-syntaxique. In J.-M. PIERREL,
Ed., Ing&#233;nierie des langues, p. 131&#8211;150. Paris : HERMES Science Europe.
</p>
<p>PNB (1996). Propositions pour la notation usuelle &#224; base latine du berb&#232;re. Inalco, Paris.
http://www.inalco.fr/crb/docs_pdf/notation.pdf [10.9.2006].
</p>
<p>202</p>

</div></div>
</body></html>