<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une grammaire du fran&#231;ais pour une th&#233;orie descriptive et formelle de la langue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Une grammaire du fran&#231;ais
pour une th&#233;orie descriptive et formelle de la langue
</p>
<p>Marie-Laure GU&#201;NOT&#8727;
</p>
<p>Signes, Universit&#233; Michel de Montaigne Bordeaux 3
marie-laure.guenot@u-bordeaux3.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons une grammaire du fran&#231;ais qui fait l&#8217;objet d&#8217;un
mod&#232;le bas&#233; sur des descriptions linguistiques de corpus (provenant notamment des travaux de
l&#8217;Approche Pronominale) et repr&#233;sent&#233;e selon le formalisme des Grammaires de Propri&#233;t&#233;s.
Elle constitue une proposition nouvelle parmi les grammaires formelles du fran&#231;ais, participant
&#224; la mise en convergence de la vari&#233;t&#233; des travaux de description linguistique, et de la diversit&#233;
des possibilit&#233;s de repr&#233;sentation formelle. Cette grammaire est mise &#224; disposition publique sur
le Centre de Ressources pour la Description de l&#8217;Oral en tant que ressource pour la repr&#233;senta-
tion et l&#8217;analyse.
</p>
<p>Abstract. In this paper I present a grammar for French, which is the implementation of a
linguistic model based on corpus descriptions (notably coming from Approche Pronominale)
and represented into the Property Grammars formalism. It accounts for a new proposition
among formal grammars, taking part into the works that aim to promote convergence between
the various researchs of descriptive linguistics and the diversity of formal representation possi-
bilities. It is freely available on the Spoken Data Resource Center (CRDO), as a representation
and analysis resource.
</p>
<p>Mots-cl&#233;s : d&#233;veloppement de grammaire, ressource pour le TAL, grammaire du fran-
&#231;ais, syntaxe, linguistique formelle, linguistique descriptive, grammaires de propri&#233;t&#233;s (GP).
</p>
<p>Keywords: grammar development, resource for NLP, French grammar, syntax, formal
linguistics, descriptive linguistics, property grammars (PG).
</p>
<p>1 Introduction
</p>
<p>Nous pr&#233;sentons ici une nouvelle ressource pour le TAL et pour la linguistique descriptive et
formelle : une grammaire du fran&#231;ais &#224; large couverture s&#8217;int&#233;ressant &#224; l&#8217;&#233;crit et &#224; l&#8217;oral, bas&#233;e
sur des positions th&#233;oriques originales et formalis&#233;e en Grammaires de Propri&#233;t&#233;s (Blache,
2005) (ci-apr&#232;s GP). Cette grammaire a &#233;t&#233; con&#231;ue dans le but de faire davantage converger la
vari&#233;t&#233; des descriptions linguistiques et la richesse des possibilit&#233;s formelles offertes, afin de
proposer &#224; la fois d&#8217;&#233;largir les points de vue th&#233;oriques des grammaires formelles, et de valider
les descriptions linguistiques utilis&#233;es.
</p>
<p>&#8727;Je tiens &#224; remercier tr&#232;s chaleureusement Philippe Blache, sans qui cette ressource n&#8217;aurait pu voir le jour.
</p>
<p>155</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure GU&#201;NOT
</p>
<p>Une th&#233;orie descriptive et formelle. Le d&#233;veloppement de cette ressource est bas&#233; sur la mise
au point d&#8217;une th&#233;orie de la langue, que l&#8217;on a orient&#233;e &#224; la fois vers la linguistique descriptive
et vers la linguistique formelle.
</p>
<p>La linguistique descriptive construit des hypoth&#232;ses explicatives &#224; partir de l&#8217;observation des
productions de langue ; celles-ci constituent la mati&#232;re premi&#232;re de la grammaire. Il s&#8217;agit l&#224;, en
premier lieu, d&#8217;op&#233;rer un choix parmi les th&#233;ories, les m&#233;thodes, et les descriptions linguistiques
que l&#8217;on souhaite retenir, puisque l&#8217;on sait que celles-ci pr&#233;sentent une vari&#233;t&#233; consid&#233;rable,
aussi bien concernant les ph&#233;nom&#232;nes auxquelles la discipline s&#8217;int&#233;resse, la couverture des tra-
vaux, et la diversit&#233; des approches th&#233;oriques sous-jacentes. L&#8217;une des cons&#233;quences &#233;videntes
de cette vari&#233;t&#233; est que toutes les descriptions ne sont pas compatibles entre elles ; en outre,
puisque les descriptions ne sont pas syst&#233;matiquement envisag&#233;es sous l&#8217;angle de leur coh&#233;sion
g&#233;n&#233;rale, de leur interd&#233;pendance, il arrive que certaines d&#8217;entre elles r&#233;pondant pourtant &#224; une
m&#234;me th&#233;orie et une m&#234;me m&#233;thodologie, engendrent quand on entreprend de les rassembler en
une grammaire une certaine h&#233;t&#233;rog&#233;n&#233;it&#233;, voire parfois des contradictions. Partant de cet &#233;tat
de fait, nous avons donc voulu dans notre grammaire expliciter les m&#233;canismes mis en &#339;uvre
par les descriptions utilis&#233;es, et en proposer un ensemble homog&#232;ne et coh&#233;rent.
</p>
<p>La linguistique formelle, quant &#224; celle, propose des modes d&#8217;expression logico-math&#233;matique
pour repr&#233;senter les r&#233;gularit&#233;s linguistiques et leur fonctionnement, &#224; partir desquels on peut
&#233;laborer des mod&#232;les de grammaire, i.e. des squelettes d&#8217;organisation des informations et de
leur analyse. Or la discipline conna&#238;t elle aussi une importante vari&#233;t&#233; des propositions, qui
s&#8217;explique par le fait que les motivations sous-jacentes aux mod&#232;les peuvent &#234;tre tr&#232;s diff&#233;rentes,
par les domaines de recherche qui peuvent en &#234;tre &#224; l&#8217;origine, et par l&#8217;ensemble de postulats
propre &#224; chaque mod&#232;le et en faisant l&#8217;originalit&#233;. Tout ceci offre au linguiste une remarquable
gamme de possibilit&#233;s de repr&#233;sentation. Toutefois, toutes les pistes envisag&#233;es dans le cadre
de la linguistique (strictement) descriptive ne sont pas, et dans certains cas m&#234;me ne peuvent
pas &#234;tre repr&#233;sent&#233;es formellement, en d&#233;pit de la richesse des propositions. Nous avons donc
souhait&#233; &#233;galement pour notre grammaire, proposer un mod&#232;le qui prenne en compte toute une
partie de la linguistique descriptive qui n&#8217;a pas encore &#233;t&#233; formalis&#233;e, pour en retour valider la
pertinence du formalisme linguistique utilis&#233; en montrant qu&#8217;il permet de repr&#233;senter de telles
informations.
</p>
<p>La ressource que nous pr&#233;sentons ici est bas&#233;e sur un mod&#232;le, lui-m&#234;me &#233;labor&#233; &#224; partir d&#8217;un
ensemble de positions th&#233;oriques (&#167;2.1) et du choix d&#8217;un formalisme (&#167;2.2) ; apr&#232;s avoir intro-
duit ceci, nous pr&#233;senterons les points les plus originaux de la grammaire d&#233;velopp&#233;e pour le
fran&#231;ais (&#167;3). Nous aborderons (&#167;4) sa mise &#224; disposition publique et &#233;voquerons d&#8217;autres res-
sources compl&#233;mentaires &#224; diffuser dans le m&#234;me cadre. Enfin, nous conclurons sur les futurs
d&#233;veloppements de la grammaire.
</p>
<p>2 Le mod&#232;le
</p>
<p>2.1 Aspects th&#233;oriques
</p>
<p>Une approche non g&#233;n&#233;rative. L&#224; o&#249; les approches g&#233;n&#233;ratives (Generative-Enumerative
Syntax), les plus r&#233;pandues actuellement, d&#233;finissent une langue comme une liste r&#233;cursivement
&#233;num&#233;rable d&#8217;&#233;l&#233;ments obtenus &#224; partir d&#8217;un nombre fini de r&#232;gles, et d&#233;finissent une gram-
maire comme un outil permettant de g&#233;n&#233;rer toutes et uniquement les phrases d&#8217;une langue, les
</p>
<p>156</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une grammaire du fran&#231;ais
</p>
<p>th&#233;ories bas&#233;es sur des mod&#232;les (Model-Theoretic Syntax) consid&#232;rent la grammaire comme un
ensemble de contraintes portant sur la structure des expressions de langue, et la langue comme
un ensemble par d&#233;finition infini, tenant ainsi compte de la variabilit&#233; des degr&#233;s de grammati-
calit&#233; et d&#8217;interpr&#233;tabilit&#233;, ainsi que de la cr&#233;ativit&#233; linguistique (Pullum &amp; Scholz, 2001). Pour
ces raisons, le mod&#232;le de que l&#8217;on propose fait partie de cette seconde classe.
</p>
<p>Une grammaire non pr&#233;somptive. Nous adoptons une position qui consiste &#224; ne pas antici-
per sur la structure externe d&#8217;une construction au sein de la description de sa structure interne
(Deulofeu, 2006) : autrement dit, on ne pr&#233;sume pas des relations qu&#8217;une construction entre-
tient avec les autres &#233;l&#233;ments de l&#8217;&#233;nonc&#233;, uniquement sur la base des relations qu&#8217;entretiennent
ses constituants. La cons&#233;quence de ceci qui tranche le plus avec les autres grammaires for-
melles actuelles, est que la n&#244;tre n&#8217;est pas lexicalis&#233;e : en effet, s&#8217;il est ind&#233;niable que le lexique
contraint effectivement en partie la structuration syntaxique, comme le font par exemple les
restrictions de s&#233;lection lexicale ou la valence des objets, nous refusons pour autant de radica-
liser la vision lexicaliste et de syst&#233;matiser l&#8217;expression des informations syntaxiques dans le
lexique.
</p>
<p>Un traitement non modulaire. A l&#8217;observation des corpus, on constate que l&#8217;information y
est &#233;parse et inconstante (Blache, 2004) : elle est dispers&#233;e &#224; travers les domaines (phon&#233;tique,
morphologie, syntaxe, s&#233;mantique, etc.), et pour chaque domaine elle est pr&#233;sente en quantit&#233;
(de m&#234;me qu&#8217;en qualit&#233;) variable. Par exemple, on trouve des indications syntaxiques en plus
grande quantit&#233; et de meilleure qualit&#233; dans (1a), que dans (1b, 1c) o&#249; il manque des informa-
tions, ou bien dans (1d, 1e) o&#249; figurent des &#233;carts &#224; la grammaire, qu&#8217;ils soient volontaires et
accept&#233;s (1d) ou non (1e).
</p>
<p>(1) a. Deux scientifiques travaillent actuellement sur un mat&#233;riau qu&#8217;ils ont baptis&#233; &quot;claytronics&quot;, qui sera compos&#233; de nano-
machines capables de s&#8217;organiser pour reproduire &#224; distance en 3D, et via internet, n&#8217;importe quelle forme, y compris
la v&#244;tre. (fr.sci.philo, 21 septembre 2006)
</p>
<p>b. lundi lavage mardi repassage mercredi repos (Mertens, 1993)
c. il y a mon fr&#232;re sa moto le guidon eh ben compl&#232;tement naze quoi (Cappeau &amp; Deulofeu, 2001)
d. T&#8217;occupe !
e. c&#8217;est parcequ&#8217;on est 3 &#224; bosser sur le site et que le troisi&#232;me &#224; casser son portable alors la com passe mal !
</p>
<p>(http://www.onpeutlefaire.com/forum/index.php?showtopic=6164, 26 juillet 2006)
</p>
<p>Notre grammaire est donc con&#231;ue comme une ressource unique, rassemblant des constructions
provenant de tous les domaines selon une repr&#233;sentation homog&#232;ne.
</p>
<p>Une analyse multi-dimensionnelle. Le dernier point th&#233;orique concerne les axes de struc-
turation de l&#8217;analyse linguistique. Nous pensons, pour ce qui nous concerne, que la structure
arborescente telle que d&#233;finie par (Chomsky, 1957) (et qui &#233;quivaut &#224; la plupart des structures
de repr&#233;sentation des grammaires formelles, y compris celles de d&#233;pendance (Kahane, 2006))
ne suffit pas. En effet, l&#8217;une des premi&#232;res choses que l&#8217;on apprend en linguistique est que
l&#8217;information y est organis&#233;e selon deux axes, syntagmatique et paradigmatique (De Saussure,
1916). Cette id&#233;e fondamentale a &#233;t&#233; suivie dans certaines descriptions (Meillet, 1924; Bally,
1965; Perrot, 1994), mais elle est jusqu&#8217;&#224; pr&#233;sent demeur&#233;e ignor&#233;e dans les grammaires for-
melles : la dimension paradigmatique, consid&#233;r&#233;e a priori comme restant &#171; virtuelle &#187; (Dubois
et al., 1994), n&#8217;est pas prise en compte et ne peut y &#234;tre repr&#233;sent&#233;e. Pourtant il a &#233;t&#233; montr&#233;
(Blanche-Benveniste et al., 1990) que des objets produits dans un &#233;nonc&#233; peuvent entretenir des
</p>
<p>157</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure GU&#201;NOT
</p>
<p>relations s&#8217;inscrivant dans cet axe, comme les disfluences et les coordinations. En cons&#233;quence,
nous avons tenu dans notre mod&#232;le &#224; bien consid&#233;rer l&#8217;analyse syntaxique comme s&#8217;articulant
simultan&#233;ment selon les deux dimensions syntagmatique et paradigmatique et &#224; permettre l&#8217;in-
troduction de constructions des deux sortes.
</p>
<p>2.2 Aspects formels
</p>
<p>Une grammaire1 en GP se pr&#233;sente sous la forme d&#8217;un couple constitu&#233; d&#8217;un ensemble de des-
criptions linguistiques et d&#8217;une sp&#233;cification des types de propri&#233;t&#233;s.
</p>
<p>Ensemble de descriptions linguistiques. La premi&#232;re partie se pr&#233;sente sous la forme d&#8217;un
r&#233;seau complexe de descriptions de constructions linguistiques (Fillmore, 1985), h&#233;ritant les
unes des autres. Chaque objet y est repr&#233;sent&#233; sous la forme d&#8217;un double ensemble, de carac-
t&#233;ristiques intrins&#232;ques d&#8217;une part (i.e., les qualit&#233;s inh&#233;rentes &#224; la construction, p.ex. le fait de
porter un genre pour une construction nominale), et extrins&#232;ques d&#8217;autre part (i.e., les qualit&#233;s
qui lui viennent de ses constituants, p.ex. l&#8217;accord, entre un d&#233;terminant et un nom et/ou entre
un nom et un adjectif, etc.) (Gu&#233;not, 2005a). Les informations intrins&#232;ques prennent la forme
d&#8217;une matrice de traits, et les extrins&#232;ques d&#8217;une liste de contraintes : les propri&#233;t&#233;s.
</p>
<p>Adj
HERIT X
</p>
<p>INTR.
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
ID | NATURE
</p>
<p>[
TYPE Adj
CAT&#201;GORIE Adj
</p>
<p>]
</p>
<p>SYN
</p>
<p>&#63726;&#63728;CPLT [RECTEUR 1
D&#201;PENDANT 2
</p>
<p>]&#63737;&#63739;
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
Majeur 1 (Adj-q &#8744; Adj-n &#8744; V-p &#8744; N &#8744; SPrep &#8744; Adv-d)
Mineur 2SPrep
Unicit&#233; 2
Exigence 1 .Adj&#8658; 2
Adjacence 1 &#8596; 2
Accord 1 .GENRE! 2 .GENRE
</p>
<p>1 .NOMBRE! 2 .NOMBRE
</p>
<p>FIG. 1 &#8211; Repr&#233;sentation d&#8217;une construction en GP : l&#8217;Adjectif construit (Adj).
</p>
<p>La Figure 1 montre la forme que rev&#234;t une construction en GP : il s&#8217;agit de l&#8217;exemple de la
construction adjectivale dans la grammaire qui nous int&#233;resse. Elle est constitu&#233;e d&#8217;un car-
touche permettant de l&#8217;identifier dans la grammaire, qui indique l&#8217;&#233;tiquette de la construction
(Adj) ainsi que son h&#233;ritage (ici, Adj h&#233;rite de la construction &#233;tiquet&#233;e X). On y voit ensuite
les deux blocs de caract&#233;ristiques : en haut la structure de traits rassemblant les informations in-
trins&#232;ques, indiquant p.ex. le fait qu&#8217;il s&#8217;agit d&#8217;une construction de CAT&#201;GORIE adjectivale ; en
bas la liste des propri&#233;t&#233;s repr&#233;sentant les informations extrins&#232;ques, comme p.ex. l&#8217;indication
selon laquelle les deux constituants possibles de la construction, s&#8217;ils sont pr&#233;sents, doivent &#234;tre
</p>
<p>1Ou un module dans le cadre d&#8217;un mod&#232;le modulaire. P.ex., notre mod&#232;le n&#8217;a qu&#8217;une grammaire, mais une
GUST (Kahane, 2002) a autant de grammaires que de modules.
</p>
<p>158</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une grammaire du fran&#231;ais
</p>
<p>contig&#252;s (quel que soit leur ordre relatif), ou le fait que l&#8217;objet Mineur doit s&#8217;accorder en genre
et en nombre avec le Majeur, si toutefois il poss&#232;de les traits correspondants.
</p>
<p>Sp&#233;cification des types de propri&#233;t&#233;s. La seconde partie de la grammaire rassemble la d&#233;-
finition des contraintes pouvant s&#8217;&#233;tablir entre les objets de la grammaire, dans un &#233;nonc&#233;. A
chaque ensemble de descriptions correspond une sp&#233;cification donn&#233;e, indiquant les relations
que la grammaire observe, les objets qu&#8217;elles mettent en relation (leur nombre, leur forme, etc.),
et la fa&#231;on dont elles sont &#233;valu&#233;es (leurs conditions d&#8217;&#233;valuation et de satisfaction).
</p>
<p>TYPE D&#201;FINITION INFORMELLE EXEMPLE
Majeur Influe sur la nature M(Det) dans SN
Mineur N&#8217;influe pas sur la nature m(SPrep) dans SN
Unicit&#233; Objets uniques Objet direct dans SV
Exigence Obligation de cooccurrence SPrep&#8660; N dans SN
Exclusion Restrictions de cooccurrence Clitique accusatif &quot;&#8660; SN objet dans SV
Pr&#233;c&#233;dence Ordre relatif Det &#8826; Nom dans SN
Adjacence Contigu&#239;t&#233; Adj &#8596; Nom dans SN
Accord Correspondance de traits Nom.genre! Adj.genre dans SN
</p>
<p>FIG. 2 &#8211; Sp&#233;cification des types de propri&#233;t&#233;s pour le mod&#232;le de grammaire pr&#233;sent&#233;.
</p>
<p>Par exemple, le mod&#232;le que nous avons d&#233;fini contient dans sa sp&#233;cification les types de propri&#233;-
t&#233;s de la Figure 2 : les deux premi&#232;res propri&#233;t&#233;s (Majeur et Mineur) expriment les relations de
constituance ; les trois suivantes (Unicit&#233;, Exigence, Exclusion) les relations de cooccurrence ;
les deux suivantes (Pr&#233;c&#233;dence, Adjacence) les relations de position ; enfin, la derni&#232;re (Accord)
exprime une relation de d&#233;pendance.
</p>
<p>Il est possible de faire varier cet ensemble : dans d&#8217;autres grammaires2 les types de propri&#233;t&#233;s
ne sont pas les m&#234;mes, et m&#234;me les propri&#233;t&#233;s &#224; la d&#233;nomination identique n&#8217;ont pas n&#233;cessai-
rement le m&#234;me fonctionnement (p.ex. la Pr&#233;c&#233;dence peut &#234;tre d&#233;finie comme imm&#233;diate, ou
non).
</p>
<p>Il est &#224; noter que GP ne fait pas usage d&#8217;informations grammaticales au-del&#224; de la grammaire
(i.e., elle n&#8217;exprime pas de &#171; principes &#187; comme en HPSG ou en TAG) : avec le jeu des h&#233;ritages
et l&#8217;ind&#233;pendance d&#8217;expression des types de propri&#233;t&#233;s par rapport aux constructions, toutes les
informations sont exprim&#233;es au sein m&#234;me de la grammaire et sont trait&#233;es selon une m&#234;me
proc&#233;dure.
</p>
<p>3 La grammaire
</p>
<p>Le mod&#232;le introduit dans la section pr&#233;c&#233;dente a servi de structure au d&#233;veloppement de la
grammaire que nous pr&#233;sentons dans cette section. Dans son &#233;tat actuel, celle-ci est constitu&#233;e
d&#8217;un ensemble de descriptions de constructions syntaxiques du fran&#231;ais. Il ne s&#8217;agit pas l&#224; de
son contenu d&#233;finitif puisque celle-ci a vocation &#224; &#234;tre compl&#233;t&#233;e, aussi bien en ce qui concerne
la finesse des descriptions syntaxiques que l&#8217;ajout d&#8217;informations provenant d&#8217;autres domaines.
</p>
<p>2Cf. par exemple la grammaire d&#233;velopp&#233;e pour les besoins de la campagne EASY (Balfourier et al., 2005), ou
les extraits de grammaires bas&#233;es sur d&#8217;autres mod&#232;les dans (Gu&#233;not, 2006a).
</p>
<p>159</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure GU&#201;NOT
</p>
<p>Elle constitue toutefois d&#8217;ores et d&#233;j&#224; une ressource &#224; large couverture pour le fran&#231;ais, int&#233;-
grant notamment des descriptions de ph&#233;nom&#232;nes tels que les SN sans t&#234;te nominale (2a), un
traitement original des clitiques, les coordinations elliptiques ou de cat&#233;gories diff&#233;rentes (2b),
ou m&#234;me les disfluences (2c).
</p>
<p>(2) a. le vrai, le moi, le boire, les avants, le dessus, des mais, un sans faute, un je ne sais quoi, ...
b. Un pas de plus et tu es mort
c. un jeune homme me l&#8217;avait dans lanch&#233; lanc&#233; dans la figure
</p>
<p>Plut&#244;t que d&#8217;en pr&#233;senter un extrait n&#233;cessairement tr&#232;s limit&#233; compte tenu de la place, nous
pr&#233;f&#233;rons proposer ici une description des grandes originalit&#233;s de notre ressource. L&#8217;ensemble
de la grammaire prend la forme d&#8217;une hi&#233;rarchie de constructions : elle comporte une construc-
tion racine, dont h&#233;ritent tous les autres objets. Les constructions qui en h&#233;ritent peuvent &#234;tre de
deux sortes : syntagmatique (&#167;3.1) ou paradigmatique (&#167;3.2). L&#8217;une des cons&#233;quences de cette
diff&#233;renciation est que l&#8217;on a pu ainsi proposer une description paradigmatique des disfluences
et des coordinations (&#167;3.3), ce qui constitue l&#8217;une des plus grandes originalit&#233;s de notre gram-
maire formelle.
</p>
<p>3.1 Red&#233;finition des constructions syntagmatiques
</p>
<p>Les constructions de la grammaire sont bas&#233;es sur une red&#233;finition du syntagme, elle-m&#234;me
provenant d&#8217;une r&#233;flexion critique sur la notion de t&#234;te : l&#224; o&#249; la lecture classiquement adop-
t&#233;e de Bloomfield (1961) est que les syntagmes peuvent ou non porter une t&#234;te selon qu&#8217;il
sont endocentriques ou exocentriques (Pollard &amp; Sag, 1994), nous posons pour notre part que
tous les syntagmes ont une t&#234;te, et que c&#8217;est la port&#233;e de l&#8217;influence de cette t&#234;te qui est va-
riable en fonction de l&#8217;endocentricit&#233; ou exocentricit&#233; de la construction. En effet le texte de
Bloomfield peut &#234;tre compris de mani&#232;res assez diff&#233;rentes (Zwicky, 1985) et l&#8217;on peut &#233;gale-
ment en conclure que tout syntagme, qu&#8217;il soit endocentrique ou exocentrique, porte une t&#234;te
c&#8217;est-&#224;-dire un constituant dont la pr&#233;sence influe directement sur la nature de la construction.
Toutefois, cette influence a une port&#233;e plus ou moins large suivant les autres constituants de la
construction (notamment, suivant leur fonction au sein du syntagme).
</p>
<p>Syntagmes endocentriques. Les constructions endocentriques occupent, &#171; globalement &#187;
comme le disait Bloomfield, le m&#234;me paradigme que leur t&#234;te3. Elles portent donc la CAT&#201;-
GORIE ainsi que le TYPE de leur T&#202;TE: ainsi, des constructions syntaxiques telles que (3) seront
de la m&#234;me CAT&#201;GORIE (Adj) et du m&#234;me TYPE (Adj) que leur T&#202;TE (resp. provocateur, rouge
et vert).
</p>
<p>(3) a. ...Thierry &#233;tait l&#233;g&#232;rement provocateur
b. Maturit&#233; du potiron &#171; Rouge vif d&#8217;Etampes &#187;
c. d&#8217;un beau vert &#233;meraude
</p>
<p>Dem&#234;me, les constructions nominales de (4) et les verbales de (5) sont endocentriques et portent
la CAT&#201;GORIE et le TYPE de leur T&#202;TE (resp. N et V).
</p>
<p>3On dit &#171; globalement &#187; parce que parce que pour l&#8217;instant on s&#8217;accorde &#224; employer la d&#233;finition de la notion
de paradigme de Saussure (1916), tout en conc&#233;dant qu&#8217;&#224; l&#8217;observation des corpus on constate qu&#8217;elle m&#233;rite une
red&#233;finition qui soit plus claire et surtout plus rigoureuse.
</p>
<p>160</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une grammaire du fran&#231;ais
</p>
<p>(4) a. un livre ennuyeux
b. une tarte maison
c. la personne venue me remplacer
</p>
<p>(5) a. l&#8217;homme a pris une cigarette
b. il ne mange pas mais grossit tout de m&#234;me
c. Pierre lui avait fait donner un cadeau
</p>
<p>Syntagmes exocentriques. Les constructions exocentriques portent bien le TYPE de leur
T&#202;TE, mais pas sa CAT&#201;GORIE. C&#8217;est le cas par exemple des Syntagmes Nominaux (2a, 6)
et des Syntagmes Verbaux (7) qui sont de TYPE N ou V mais de CAT&#201;GORIE SN ou SV.
</p>
<p>(6) a. Le petit chien de ma grand-m&#232;re
b. on peut &#234;tre en d&#233;saccord avec les ceusses qui g&#232;rent l&#8217;Usenet fran&#231;ais sans user d&#8217;un tel vocabulaire qui n&#8217;ap-
</p>
<p>porte rigoureusement rien au d&#233;bat (fr.usenet.abus.d, 28 septembre 2000)
</p>
<p>(7) a. l&#8217;homme a pris une cigarette
b. je sais o&#249; je dois aller
c. Pierre lui avait fait donner un cadeau
</p>
<p>Notons que d&#8217;apr&#232;s ceci, par exemple, il n&#8217;y a pas de Syntagmes Adjectivaux dans la gram-
maire, puisqu&#8217;il n&#8217;existe pas en fran&#231;ais de syntagmes qui soient de TYPE adjectival mais de
CAT&#201;GORIE diff&#233;rente (en d&#8217;autres termes, qui soient de TYPE adjectival mais qui occupent un
paradigme diff&#233;rent de l&#8217;adjectif lexical).
</p>
<p>3.2 Introduction des constructions paradigmatiques
</p>
<p>La plupart des grammaires admettent (et nous en faisons partie) que certaines constructions
n&#8217;ont pas de t&#234;te ; mais dans le cas habituel, la diff&#233;rence entre constructions &#224; t&#234;te et construc-
tion sans t&#234;te4 les m&#232;ne &#224; opposer syntagmes endocentriques (avec t&#234;te) et exocentriques (sans
t&#234;te ou &#224; t&#234;te particuli&#232;re). Or on vient de voir que nous adoptons une position diff&#233;rente puisque
nous posons que tous les syntagmes ont bel et bien une (et une seule) t&#234;te (r&#233;guli&#232;re). N&#233;an-
moins, nous admettons &#233;galement que toutes les constructions n&#8217;ont pas de t&#234;te, ce qui signifie
que dans la grammaire, toutes les constructions syntaxiques ne sont pas des syntagmes.
</p>
<p>En effet, en plus des syntagmes on d&#233;finit un autre type de construction syntaxique : les
constructions paradigmatiques. Celles-ci sont caract&#233;ris&#233;es par le fait que leurs constituants
n&#8217;entretiennent pas des relations hypotactiques, &#224; la diff&#233;rence des syntagmes (o&#249; les relations,
quelles qu&#8217;elles soient, se font hi&#233;rarchiquement entre un objet recteur et un d&#233;pendant), et par
cons&#233;quent ne portent pas de t&#234;te.
</p>
<p>3.3 Formalisation des disfluences et traitement original des coordinations
</p>
<p>Deux grands types de constructions font partie des paradigmes : les coordinations et les
disfluences. Cette position descriptive est bas&#233;e sur les travaux de l&#8217;Approche Pronominale
</p>
<p>4Ou alors, suivant les variantes possibles de la d&#233;finition de la notion de t&#234;te, faisant l&#8217;objet de classes sp&#233;ciales
telles que les &#171; t&#234;tes faibles &#187; d&#8217;Abeill&#233; (2003) par exemple.
</p>
<p>161</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure GU&#201;NOT
</p>
<p>(Blanche-Benveniste, 1987), dont nous avons propos&#233; la description, la repr&#233;sentation formelle
et l&#8217;int&#233;gration &#224; notre grammaire.
</p>
<p>Il s&#8217;agit ici aussi d&#8217;une proposition nouvelle et originale, sous deux aspects. D&#8217;une part, les
disfluences ne sont quasiment jamais formalis&#233;es dans les grammaires actuelles ; et quand elles
le sont, alors il n&#8217;est pas tenu compte de leurs caract&#233;ristiques et de ce qu&#8217;il a pu &#234;tre montr&#233; de
leur fonctionnement et de leurs apports &#224; l&#8217;interpr&#233;tation, ce qui implique des pertes d&#8217;informa-
tion et un manque de rigueur, ainsi qu&#8217;une absence de consensus dans leur traitement (Gu&#233;not,
2005b). D&#8217;autre part, la fait de ne pas consid&#233;rer les coordinations comme des syntagmes est
un point de vue tout &#224; nouveau en linguistique formelle. Nous avons montr&#233; (Gu&#233;not, 2006a)
l&#8217;int&#233;r&#234;t de cette approche en en illustrant le fonctionnement simple et efficace sur des exemples
vari&#233;s tels que les coordinations mettant en jeu des coordonn&#233;s de cat&#233;gories diff&#233;rentes (2b) ou
des coordonnants non standard (8a), ou encore les formes elliptiques (8b).
</p>
<p>(8) a. Il a &#233;t&#233; habiter &#224; c&#244;t&#233; de chez Rosalie que Rosalie elle savait pas (Deulofeu, 1999)
b. Pierre aime le cin&#233;ma et Marie le th&#233;&#226;tre
</p>
<p>4 Mise &#224; disposition
</p>
<p>La grammaire que nous venons de pr&#233;senter est mise &#224; la disposition publique sur le Centre
de Ressources pour la Description de l&#8217;Oral5, en tant que ressource pour la description et le
traitement des donn&#233;es. Elle fait l&#8217;objet d&#8217;une licence Creative Commons (Paternit&#233; - Partage
des conditions initiales &#224; l&#8217;identique6). Elle sera r&#233;guli&#232;rement mise &#224; jour &#224; chaque &#233;tape vali-
d&#233;e de son d&#233;veloppement. Elle est pour l&#8217;instant pr&#233;sent&#233;e sous une forme textuelle, qui sera
prochainement compl&#233;t&#233;e par son &#233;quivalent &#233;lectronique7.
</p>
<p>Autres ressources. La diffusion de cette grammaire est une premi&#232;re &#233;tape de mise &#224; dispo-
sition de ressources GP pour le TAL ; en effet nous ferons suivre &#224; cette grammaire la diffusion
du mod&#232;le lui-m&#234;me (sous la forme d&#8217;un squelette de d&#233;veloppement de grammaire) afin de
permettre, le cas &#233;ch&#233;ant, son utilisation pour le d&#233;veloppement d&#8217;autres grammaires (p.ex.,
portant sur d&#8217;autres langues et/ou mettant en &#339;uvre d&#8217;autres positions th&#233;oriques).
</p>
<p>Nous ajouterons &#233;galement &#224; cela la grammaire que nous avons d&#233;velopp&#233;e dans le cadre de
la campagne EASY (Paroubek, 2005), repr&#233;sent&#233;e dans les m&#234;mes formats. Celle-ci est &#233;gale-
ment formalis&#233;e en GP mais est bas&#233;e sur un mod&#232;le th&#233;oriquement &#233;loign&#233; de notre pr&#233;sente
proposition (Balfourier et al., 2005).
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; ici nous nouvelle ressource pour le TAL : une grammaire du fran&#231;ais &#224;
large couverture qui s&#8217;int&#233;resse &#224; la fois aux ph&#233;nom&#232;nes &#233;crits et oraux. Elle est bas&#233;e sur
</p>
<p>5http://crdo.fr. Le service &#233;tant en cours d&#8217;&#233;laboration et la grammaire n&#8217;y &#233;tant &#224; l&#8217;heure actuelle pas
encore disponible, elle est pour l&#8217;instant t&#233;l&#233;chargeable &#224; l&#8217;adresse http://mlguenot.googlepages.com/
Grammaire.pdf.
</p>
<p>6http://creativecommons.org/licenses/by-sa/2.0/fr/.
7En l&#8217;esp&#232;ce d&#8217;un document XML g&#233;n&#233;r&#233; &#224; partir du m&#234;me source LATEX que celui qui est &#224; l&#8217;origine du PDF.
</p>
<p>162</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une grammaire du fran&#231;ais
</p>
<p>un ensemble de positionnements th&#233;oriques qui constitue une nouveaut&#233; pour la linguistique
formelle (non-g&#233;n&#233;rativisme, non-lexicalisation, non-modularit&#233; et multi-dimensionnalit&#233;), et
est repr&#233;sent&#233;e sous la forme de Grammaire de Propri&#233;t&#233;s.
</p>
<p>Elle a vocation &#224; participer &#224; la mise en convergence de la vari&#233;t&#233; consid&#233;rable des descriptions
linguistiques de corpus et des possibilit&#233;s formelles, apportant aux premi&#232;res une validation par
leur explicitation et leur r&#233;gularisation (Chomsky, 1957; Pollard &amp; Sag, 1994), et aux secondes
un &#233;largissement des ph&#233;nom&#232;nes pris en consid&#233;ration.
</p>
<p>Dans son &#233;tat actuel, elle est vou&#233;e &#224; &#234;tre affin&#233;e et compl&#233;t&#233;e, aussi bien concernant la descrip-
tion des ph&#233;nom&#232;nes syntaxiques (on y affinera progressivement le contenu en enrichissant la
hi&#233;rarchie jusqu&#8217;&#224; proposer des descriptions de figements), que l&#8217;ajout d&#8217;informations provenant
d&#8217;autres domaines (s&#233;mantique, prosodie, discours, voire descriptions multimodales (Gu&#233;not &amp;
Bellengier, 2004)). Le mod&#232;le sur lequel elle se base a &#233;t&#233; con&#231;u afin que de tels ajouts soient
facilit&#233;s par la forme m&#234;me de la grammaire.
</p>
<p>Elle est mise &#224; la disposition du public afin d&#8217;en permettre la diffusion, l&#8217;utilisation, la compa-
raison, la compl&#233;tion avec la participation de la communaut&#233;. Ceci constitue une premi&#232;re &#233;tape
dans la mise &#224; disposition d&#8217;un ensemble de ressources GP pour le TAL.
</p>
<p>R&#233;f&#233;rences
ABEILL&#201; A. (2003). A lexicalist and construction-based approach to coordinations. In S.
MUELLER, Ed., Proceedings of the HPSG03 Conference, p. 5&#8211;24, Michigan State University,
East Lansing: CSLI Online Publications.
BALFOURIER J.-M., BLACHE P., GU&#201;NOT M.-L. &amp; VANRULLEN T. (2005). Comparaison
de trois analyseurs symboliques dans une t&#226;che d&#8217;annotation syntaxique. In Actes de TALN
2005 - Workshop EASY, Dourdan, France.
BALLY C. (1965). Linguistique g&#233;n&#233;rale et Linguistique fran&#231;aise. Paris: Leroux.
BLACHE P. (2004). Constraints: an operational framework for construction grammars. In Pro-
ceedings of the 3rd International Conference on Construction Grammars (ICCG3), Marseille,
France.
BLACHE P. (2005). Property grammars: A fully constraint-based theory. In H. CHRISTIAN-
SEN, P. SKADHAUGE &amp; J. VILLADSEN, Eds., Constraint Satisfaction and Language Proces-
sing. Springer.
BLANCHE-BENVENISTE C. (1987). Syntaxe, choix du lexique et lieux de bafouillage. DR-
LAV, 36-37, 123&#8211;157.
BLANCHE-BENVENISTE C., BILGER M., ROUGET C. &amp; EYNDE K. V. D. (1990). Le fran-
&#231;ais parl&#233;: Etudes grammaticales. Sciences du langage. Paris: CNRS Editions.
BLOOMFIELD L. (1961). Language. New York: Holt.
CAPPEAU P. &amp; DEULOFEU H.-J. (2001). Partition et topicalisation : il y en a &#8220;stabilisateur&#8221;
de sujets et de topiques ind&#233;finis. Cahiers de prax&#233;matique, 37.
CHOMSKY N. (1957). Syntactic Structures. la Hague: Mouton.
DE SAUSSURE F. (1916). Cours de linguistique g&#233;n&#233;rale. Paris: Payot. r&#233;&#233;dition de 1990.
DEULOFEU H.-J. (1999). Prob&#232;mes m&#233;thodologiques de l&#8217;analyse morphosyntaxique de que
en fran&#231;ais contemporain. Recherches sur le Fran&#231;ais Parl&#233;, 15.
</p>
<p>163</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure GU&#201;NOT
</p>
<p>DEULOFEU H.-J. (2006). Les cons&#233;cutives construites avec tellement ont-elles une syntaxe
scalaire ? In La scalarit&#233;: autant de moyens d&#8217;expression, autant d&#8217;effets de sens, Bruxelles,
Belgique.
DUBOIS J., GESPIN L., GIACOMO M., MARCELLESI C., MARCELLESI J.-B. &amp; M&#201;VEL
J.-P. (1994). Dictionnaire de linguistique et des sciences du langage. Paris: Larousse.
FILLMORE C. (1985). Syntactic intrusions and the notion of grammatical construction. BLS,
11, 73&#8211;86.
GU&#201;NOT M.-L. (2005a). Des constructions &#224; l&#8217;interface entre lexique et grammaire. In S.
KAHANE, Ed., Journ&#233;e de l&#8217;Atala Interfaces Lexique-Grammaire et lexiques syntaxiques et
s&#233;mantiques, Paris.
GU&#201;NOT M.-L. (2005b). Parsing de l&#8217;oral: traiter les disfluences. In Actes de TALN 2005, p.
323&#8211;332, Dourdan, France.
GU&#201;NOT M.-L. (2006a). El&#233;ments de grammaire du fran&#231;ais pour une th&#233;orie descriptive et
formelle de la langue. Th&#232;se de doctorat, Universit&#233; de Provence, Aix-Marseille I.
GU&#201;NOT M.-L. (2006b). La coordination consid&#233;r&#233;e comme un entassement paradigmatique:
description, repr&#233;sentation et int&#233;gration. Actes de TALN 2006 - Cahiers du Cental, 2(1), 178&#8211;
187.
GU&#201;NOT M.-L. &amp; BELLENGIER E. (2004). Quelques principes pour une grammaire multi-
modale du fran&#231;ais. In B. BEL &amp; I. MARLIEN, Eds., Actes de RECITAL 2004, p. 51&#8211;60, F&#232;s,
Maroc.
KAHANE S. (2002). Grammaire d&#8217;unification sens-texte: Vers un mod&#232;le math&#233;matique arti-
cul&#233; de la langue naturelle. Document de synth&#232;se de l&#8217;habilitation &#224; diriger les recherches,
Universit&#233; Denis Diderot, Paris VII.
KAHANE S. (2006). On the status of phrases in head-driven phrase-structure grammar: Illus-
tration by a totally lexical treatment of extraction. In A. Polgu&#232;re (ed.). Benjamins. A para&#238;tre.
MEILLET A. (1924). Trait&#233; de grammaire compar&#233;e des langues indo-europ&#233;ennes. Paris:
Champion.
MERTENS P. (1993). Accentuation, intonation et morphosyntaxe. Travaux de Linguistique,
26.
PAROUBEK P. (2005). EASY: Campagne d&#8217;&#233;valuation des analyseurs syntaxiques. In Actes
de TALN 2005 - Workshop EASY, Dourdan, France.
PERROT J. (1994). El&#233;ments pour une typologie des structures informatives. In M&#233;moires de
la Soci&#233;t&#233; de Linguistique de Paris, tome II: La phrase: &#201;nonciation et information, p. 13&#8211;26.
Leuven: Peeters.
POLLARD C. &amp; SAG I. (1994). Head-Driven Phrase Structure Grammar. Chicago: University
of Chicago Press.
PULLUM G. &amp; SCHOLZ B. (2001). On the distinction between model-theoretic and
generative-enumerative syntactic frameworks. In P. DE GROOTE, G. MORRILL &amp; C. RE-
TOR&#201;, Eds., Lecture Notes in Artificial Intelligence - Proceedings of the 4th LACL Internatio-
nal Conference, p. 17&#8211;43, Berlin: Springer.
ZWICKY A. (1985). Heads. Journal of Linguistics, 21, 1&#8211;29.
</p>
<p>164</p>

</div></div>
</body></html>