<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>TiLT correcteur de SMS : &#233;valuation et bilan qualitatif</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TiLT correcteur de SMS : &#233;valuation et bilan qualitatif 
</p>
<p>TiLT correcteur de SMS : &#233;valuation et bilan qualitatif 
</p>
<p>&#201;milie GUIMIER DE NEEF, Arnaud DEBEURME, Jungyeul PARK
FTR&amp;D/TECH/EASY &#8211; France Telecom R&amp;D 
</p>
<p>2, avenue Pierre Marzin, 22300 Lannion Cedex, France 
{emilie.guimierdeneef,arnaud.debeurme,jungyeul.park}
</p>
<p>@orange-ftgroup.com
</p>
<p>R&#233;sum&#233;.   Nous pr&#233;sentons le logiciel TiLT pour la correction des SMS et &#233;valuons ses 
performances sur le corpus de SMS du DELIC. L'&#233;valuation utilise la distance de Jaccard et la 
mesure BLEU. La pr&#233;sentation des r&#233;sultats est suivie d'une analyse qualitative du syst&#232;me et 
de ses limites. 
</p>
<p>Abstract. This paper presents TiLT system which allows us to correct spelling errors in 
SMS messages to standard French. We perform Jaccard and Bleu metrics for its evaluation 
using the DELIC SMS corpus as a reference. We discuss qualitative analyses of system and 
its limits. 
</p>
<p>Mots-cl&#233;s : SMS, SMS corpus, correction orthographique, TiLT, evaluation. 
</p>
<p>Keywords: SMS, SMS corpus, spelling correction, TiLT, evaluation. 
</p>
<p>1 Introduction
Les nouvelles formes de communication &#233;crite (blogs, SMS, chats etc.) se caract&#233;risent par de 
nombreux &#233;carts vis-&#224;-vis des conventions orthographiques standards. Ces &#233;carts recens&#233;s par 
Anis (2002), confirm&#233;s par des &#233;tudes de corpus r&#233;els Bove (2005) et tr&#232;s bri&#232;vement rappel&#233;s 
ci-dessous, offrent un nouveau d&#233;fi aux outils de correction automatique. En effet, comme 
l'ont montr&#233; V&#233;ronis et Guimier De Neef (2006), un simple recensement de couples graphie 
SMS / graphie standard ne suffit pas &#224; r&#233;pondre &#224; la productivit&#233; et &#224; la combinatoire des 
diff&#233;rents proc&#233;d&#233;s d'&#233;criture. 
</p>
<p>x Graphies phon&#233;tisantes et r&#233;bus : g ht du kf&#233; a+ (j'ai achet&#233; du caf&#233; &#224; plus) 
x Abr&#233;viations diverses : slt k f tu (salut que fais-tu ?)
x &#201;tirements graphiques : ssuuuppperr ! hhhhhuuuuummmm !
x Agglutinations : g &#233;say&#233; 2tapel&#233; pl1 2foi (j'ai essay&#233; de t'appeler plein de fois)
</p>
<p>123</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;milie GUIMIER DE NEEF, Arnaud DEBEURME, Jungyeul PARK
</p>
<p>Diff&#233;rentes motivations peuvent justifier la correction, ou plut&#244;t la normalisation, de l'&#233;criture 
SMS : l'extraction d'information, l'indexation, l'analyse de blogs, de wikis etc. La vocalisation 
des SMS destin&#233;s aux t&#233;l&#233;phones fixes a &#233;t&#233; l'occasion pour FTR&amp;D d'adapter son logiciel 
TiLT &#224; ce contexte. L'architecture globale du service est sch&#233;matis&#233;e Figure 1.
</p>
<p>Pr&#233;-traitement 
linguistique 
</p>
<p>chui en fisic ta pa 1 id 
GEEENIAAALE 2 kdo pr ludo :-&gt; 
</p>
<p>a2m1 steph
</p>
<p>Synth&#232;se vocale 
</p>
<p>Je suis en physique t'as pas une 
id&#233;e g&#233;niale de cadeau pour ludo 
hahaha ! &#192; demain St&#232;ph
</p>
<p>Figure 1 : correction des SMS avant vocalisation 
</p>
<p>Dans cet article, nous pr&#233;sentons une &#233;valuation du correcteur de SMS TiLT en mesurant ses 
performances sur le corpus de SMS du laboratoire DELIC. Dans une premi&#232;re section, nous 
d&#233;crivons le logiciel et ses adaptations au contexte SMS. Nous pr&#233;sentons le corpus du 
DELIC en seconde section. Les mesures utilis&#233;es et les r&#233;sultats de l'&#233;valuation sont fournis 
en troisi&#232;me section ainsi qu'une analyse qualitative des r&#233;sultats obtenus. Nous terminons 
l'article par diff&#233;rentes perspectives de recherche. 
</p>
<p>2 TiLT correcteur de SMS 
Le logiciel TiLT est une solution d'analyse linguistique modulaire permettant diff&#233;rents types 
de traitements automatiques comme la correction orthographique, le pr&#233;-traitement 
linguistique de documents avant indexation, l'extraction d'informations, la traduction 
automatique etc. Nous pr&#233;sentons ci-dessous l'architecture et les particularit&#233;s de la solution 
TiLT pour la correction orthographique dont l'application SMS est une instance particuli&#232;re. 
</p>
<p>Le logiciel fait intervenir s&#233;quentiellement trois briques : (i) un module de segmentation, 
(ii) un module d'analyse lexicale avec ou sans m&#233;thodes correctives, (iii) un module d'analyse 
en chunking. Des donn&#233;es linguistiques sp&#233;cifiques au contexte SMS ont &#233;t&#233; d&#233;velopp&#233;es &#224; 
partir d'observations linguistiques et de tests sur corpus. L'ensemble des donn&#233;es symboliques 
utilis&#233;es par le logiciel est d&#233;velopp&#233; &#224; partir d'une expertise humaine. 
</p>
<p>2.1 Segmentation
</p>
<p>La segmentation permet le d&#233;coupage et le typage des diff&#233;rents segments du message en 
entr&#233;e. Le typage des segments permet de diff&#233;rencier ensuite le traitement qu'il convient de 
</p>
<p>124</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TiLT correcteur de SMS : &#233;valuation et bilan qualitatif 
</p>
<p>leur associer : seuls les segments de type MOT sont envoy&#233;s &#224; l'analyse lexicale. La 
description des segments se fait au moyen d'expressions r&#233;guli&#232;res compil&#233;es par FLEX1.
</p>
<p>Pour le traitement des SMS, une modification importante des donn&#233;es de segmentation est 
rendue n&#233;cessaire principalement pour l'identification des smileys et pour l'inclusion massive 
des chiffres et des symboles dans les mots. 
</p>
<p>Phrase analys&#233;e : tu vi1 2m1 a+ ;-)
0  1 : &quot;tu&quot;  : MOT 
1  2 : &quot;vi1&quot; : MOT_AVECCHIFFRE 
2  3 : &quot;2m1&quot; : MOT_AVECCHIFFRE 
3  4 : &quot;a+&quot;  : MOT_AVECSYMB 
4  5 : &quot;;-)&quot; : SMILEY 
</p>
<p>Figure 2 : segmentation TiLT 
</p>
<p>2.2 Lexique
</p>
<p>Le lexique du fran&#231;ais utilis&#233; par TiLT comporte environ 100 000 entr&#233;es incluant une base 
de mots-compos&#233;s. Pour le traitement des SMS, ce lexique a &#233;t&#233; enrichi d'une base d'un 
millier d'abr&#233;viations recueillies sur le web ou compil&#233;es d'apr&#232;s relev&#233;s sur corpus. Parmi ces 
abr&#233;viations, on recense des sigles (atd = &#224; ta disposition, tvb = tout va bien&#8230;), des 
squelettes consonantiques (slt a vs ts = salut &#224; vous tous), des troncations (adr = adresse) etc. 
Le lexique SMS inclut &#233;galement une base de pr&#233;noms de 3 000 entr&#233;es environ. 
</p>
<p>Un apprentissage sur corpus a permis de d&#233;limiter la liste des mots les plus fr&#233;quemment 
utilis&#233;s dans un contexte SMS afin de favoriser ces formes par rapport aux autres mots de la 
base lexicale. 
</p>
<p>2.3 Les m&#233;thodes correctives 
</p>
<p>Au cours de l'analyse lexicale, le lexique est consult&#233; et renvoie l'ensemble des informations 
disponibles : lemme, orthographe standard, cat&#233;gorie grammaticale, traits 
morpho-syntaxiques. Cette consultation se fait selon diff&#233;rents modes dont des modes 
correctifs, certains ayant &#233;t&#233; sp&#233;cialement adapt&#233;s au contexte SMS. 
</p>
<p>1. Correction phon&#233;tique : le module de correction phon&#233;tique, bas&#233; sur un 
transducteur appris par alignement des formes phon&#233;tiques et graphiques des mots 
d'une langue, a &#233;t&#233; enrichi de r&#232;gles permettant la phon&#233;tisation des symboles, 
chiffres et lettres utilis&#233;s pour leur valeur phon&#233;tique en &#233;criture SMS. 
</p>
<p>2. Correction par d&#233;coupage morpho-syntaxique : des observations sur corpus 
(Bove 2005) ont montr&#233; que l'agglutination de mots non g&#233;n&#233;ralis&#233;e n'intervient pas 
au hasard mais concerne de fa&#231;on privil&#233;gi&#233;e les s&#233;quences avec clitiques (jtrappelle,
gsp&#232;re qtu va bien&#8230;), avec pr&#233;position (g &#233;say&#233; 2tapel&#233; pl1 2foi), les s&#233;quences 
d&#233;terminant/nom (c le foot ki te m&#233; ds 7&#233;ta?) ou les formes lexicales complexes 
</p>
<p>1  http://fr.wikipedia.org/wiki/Flex_%28GNU%29.
</p>
<p>125</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;milie GUIMIER DE NEEF, Arnaud DEBEURME, Jungyeul PARK
</p>
<p>(Keske tu deviens?) etc. Le module de correction par d&#233;coupage a &#233;t&#233; associ&#233; &#224; des 
donn&#233;es sp&#233;cifiques pour permettre l'expansion de ces formes compact&#233;es. 
</p>
<p>3. Tol&#233;rance &#224; la r&#233;p&#233;tition : l'une des particularit&#233;s de l'&#233;criture SMS est la pr&#233;sence 
de marques expressives dans l'&#233;criture. Ces marques incluent les smileys, des jeux 
sur les signes de ponctuation (on est sur la plage!!!!!!!!!!), l'utilisation de la casse 
(Encore un grand MERCI &#224; tous les deux) mais aussi l'&#233;tirement graphique (c la 
foliiiiiiiie !!). Une m&#233;thode corrective dite de tol&#233;rance &#224; la r&#233;p&#233;tition a &#233;t&#233; 
sp&#233;cialement d&#233;velopp&#233;e pour restituer les orthographes non &#233;tir&#233;es.
</p>
<p>Ces m&#233;thodes calculent dynamiquement les corrections possibles dans les SMS, ce qui r&#233;pond 
&#224; la cr&#233;ativit&#233; orthographique des utilisateurs de SMS. 
</p>
<p>2.4 La grammaire de chunking 
</p>
<p>L'analyse en chunking pratiqu&#233;e par TiLT utilise une grammaire hors contexte de 2 000 r&#232;gles 
environ. Son r&#244;le est de permettre de choisir la correction adapt&#233;e pour un mot &#233;tant donn&#233; 
son contexte syntaxique local. 
</p>
<p>En SMS, deux particularit&#233;s augmentent la difficult&#233; du chunking : 
</p>
<p>1. l'ambigu&#239;t&#233; en g&#233;n&#233;ral et celle des mots outils en particulier, comme dans le 
paradigme suivant o&#249; le caract&#232;re c se normalise de 4 fa&#231;ons diff&#233;rentes : 
</p>
<p>Voil&#224; c fini ca c bin pass&#233;  =&gt;  voil&#224; c'est fini &#231;a s'est bien pass&#233; 
Je c pa ki c    =&gt; je sais pas qui c'est 
Jespere k vou descend&#233; c soir =&gt; j'esp&#232;re que vous descendez ce soir 
</p>
<p>2. la ponctuation souvent absente qui cesse de jouer son r&#244;le de c&#233;sure : 
</p>
<p>alor t soulag&#233; moi la jaten 1h ca me soule j menui a mourir biz 
G un empechement previen sophie gros poutou &#224; demain 
</p>
<p>Pour contrer ces difficult&#233;s, la grammaire a &#233;t&#233; enrichie de r&#232;gles prenant en compte des 
structures particuli&#232;rement fr&#233;quentes en contexte SMS (interrogatives, formes pr&#233;sentatives 
introduites par c'est&#8230;, constructions modales etc.). En particulier, une grammaire locale des 
formules de politesse, s'appuyant sur des d&#233;clencheurs tels que salut, bisous etc. s'est av&#233;r&#233;e 
indispensable pour aider &#224; la d&#233;tection des noms propres (HELLO R&#201;JANE, A BIENTO 
JOHAN, coucou N&#233;nette, a+ Reno etc.) 
</p>
<p>3 Le corpus de SMS du DELIC 
</p>
<p>3.1 Pr&#233;sentation du corpus 
</p>
<p>Dans le cas d'un contrat collaboratif avec France T&#233;l&#233;com R&amp;D, le laboratoire DELIC de 
l'universit&#233; d'Aix en Provence a collect&#233;, avec le concours de ses &#233;tudiants, un corpus 
d'environ 9 700 messages SMS correspondant &#224; un peu plus de 132 000 mots. Ces messages 
ont &#233;t&#233; corrig&#233;s semi-automatiquement puis r&#233;vis&#233;s manuellement pour constituer une base 
align&#233;e de SMS et de transcriptions. Le Tableau 1 fournit un extrait de ce corpus. 
</p>
<p>126</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TiLT correcteur de SMS : &#233;valuation et bilan qualitatif 
</p>
<p>tu pe tokup du cha 2m1? 
</p>
<p>Je sui dvt ch&#233; toi 
</p>
<p>Jarriv!!tnev pa!! 
</p>
<p>Je conte sur toi 2m1 a la danse! 
</p>
<p>Dsl pour ier..enormes bisous 
</p>
<p>pti coucou d vacs!! C terrible c bo !! je vs racontr&#233; 
</p>
<p>Tu peux t'occuper du chat demain ? 
</p>
<p>Je sui devant chez toi. 
</p>
<p>J'arrive ! [ne] t'&#233;nerve pas ! 
</p>
<p>Je compte sur toi demain &#224; la danse 
</p>
<p>D&#233;sol&#233;(e) pour hier&#8230; &#233;normes bisous. 
</p>
<p>Petit coucou des vacances ! C'est terrible, c'est beau ! Je 
vous raconterai ! 
</p>
<p>Tableau 1 : Extrait du corpus align&#233; SMS / fran&#231;ais standard du DELIC 
</p>
<p>Une description fine des conventions de correction utilis&#233;es dans la transcription du corpus 
peut &#234;tre trouv&#233;e dans Hocq (2006). Globalement, les orthographes phon&#233;tiques, erron&#233;es, 
abr&#233;g&#233;es sont corrig&#233;es. Il en va de m&#234;me des marques de ponctuation qui sont ramen&#233;es &#224; 
l'usage standard. Des alternances d'accord sont propos&#233;es en cas d'ambigu&#239;t&#233; (dsl = d&#233;sol&#233; ou 
d&#233;sol&#233;e). Certains mots manquants, ne n&#233;gatif, pronom sujet principalement, sont not&#233;s entre 
crochets. Les sigles et abr&#233;viations sont &#233;tendus (mdr = mort de rire, dvt = devant etc.). Des 
donn&#233;es personnelles ont &#233;t&#233; rendues anonymes. Les num&#233;ros de t&#233;l&#233;phone ont &#233;t&#233; remplac&#233;s 
par 01 02 03 04 05. La balise &lt;NOM&gt; se substitue aux noms de personne identifiables : 
Michel Dupont est remplac&#233; par &lt;NOM&gt;. Par contre, les pr&#233;noms isol&#233;s ont &#233;t&#233; conserv&#233;s. 
</p>
<p>Ce corpus peut &#234;tre caract&#233;ris&#233; par quelques chiffres. La taille moyenne des messages SMS 
est de 14,5 mots. Le nombre moyen de caract&#232;res par message est de 66,7 caract&#232;res2. Le 
rapport entre le nombre de caract&#232;res utilis&#233;s dans la correction et le nombre de caract&#232;res 
pr&#233;sents dans le SMS source, nous donne un taux de compression de l'&#233;criture SMS de l'ordre 
de 20%. 
</p>
<p>3.2 Post-traitements pour l'&#233;valuation 
</p>
<p>La correction fournie par TiLT ne suivant pas toujours les m&#234;mes normes que la correction 
manuelle propos&#233;e dans le corpus du DELIC, une phase de normalisation des sorties de TiLT 
et d'enrichissement du corpus du DELIC a &#233;t&#233; effectu&#233;e. Les principales divergences portent 
sur la normalisation des heures (10h30 vs 10 h 30), des nombres not&#233;s en lettres ou en 
chiffres, des unit&#233;s de mesure (km vs kilom&#232;tre), de certaines abr&#233;viations conserv&#233;es ou 
&#233;tendues dans les corrections automatiques ou dans le corpus du DELIC. Certains choix de 
restitution TiLT en rapport avec l'application de vocalisation ont &#233;t&#233; revus : la restitution des 
smileys sous forme de balise par exemple (le smiley ;-) devient &lt;SMILEY&gt;). 
</p>
<p>Apr&#232;s post-traitement du corpus du DELIC, &#224; chaque SMS correspond en moyenne 1,2 
transcription standardis&#233;e. C'est cette version post-trait&#233;e du corpus qui sert de r&#233;f&#233;rence pour 
notre &#233;valuation. Le Tableau 2 montre un extrait du corpus apr&#232;s les post-traitements. 
</p>
<p>2 Le nombre maximum de caract&#232;res autoris&#233;s pour la saisie d'un SMS sur t&#233;l&#233;phone mobile est de 160 
caract&#232;res. Certains t&#233;l&#233;phones autorisent la saisie de messages plus longs qui sont alors d&#233;coup&#233;s avant 
d'&#234;tre envoy&#233;s au destinataire. 
</p>
<p>127</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;milie GUIMIER DE NEEF, Arnaud DEBEURME, Jungyeul PARK
</p>
<p>tu t es plant&#233; en math t a eu 1 sal note Tu t'es plant&#233; en math, t'as eu une sale note. Tu t'es plant&#233; en math, tu as eu une sale note. 
</p>
<p>tu pe venir me prendre a aix ver 2h30? 
merci ta couzine bizz 
</p>
<p>Tu peux venir me prendre &#224; Aix vers 2 h 30 ? Merci. Ta 
cousine. Bise. 
Tu peux venir me prendre &#224; Aix vers 2h30 ? Merci. Ta 
cousine. Bise. 
Tu peux venir me prendre &#224; Aix vers 2 h 30 ? Merci. Ta 
cousine. Bisou. 
Tu peux venir me prendre &#224; Aix vers 2h30 ? Merci. Ta 
cousine. Bisou. 
</p>
<p>TU PE VENIR Tu peux venir. 
</p>
<p>Tableau 2 : Extrait du corpus align&#233; SMS / fran&#231;ais standard apr&#232;s post-traitements 
</p>
<p>4 &#201;valuation
Les objectifs de cette &#233;valuation sont doubles. Il s'agit d'une part de trouver des indicateurs 
permettant de quantifier objectivement les performances pour pouvoir en suivre les &#233;volutions 
dans le temps. Il s'agit &#233;galement de rep&#233;rer les ph&#233;nom&#232;nes de l'&#233;criture SMS r&#233;sistants pour 
mieux cerner les limites de notre approche et pr&#233;voir des extensions. En cons&#233;quence, la 
partie &#233;valuation objective est suivie d'une analyse qualitative des r&#233;sultats obtenus. 
</p>
<p>4.1 &#201;valuation objective 
</p>
<p>Parmi les mesures fr&#233;quemment utilis&#233;es pour mesurer les performances des traducteurs 
statistiques ou des syst&#232;mes de reconnaissance vocale, nous en avons retenu deux pour 
l'&#233;valuation de notre correcteur de SMS : la mesure BLEU (Papineni et al. 2002) et le 
coefficient de Jaccard. La prise en compte ou pas de l'ordre des mots distingue les deux types 
de mesure. Le coefficient de Jaccard3 consid&#232;re la phrase comme un sac de mots, tandis que 
la mesure BLEU4 prend en compte les n-grams et p&#233;nalise les corrections qui divergent quant 
&#224; l'ordre des mots. 
</p>
<p>3 Coefficient de Jaccard =
unionl'dans mots nb
</p>
<p>onintersectil' dans mots nb
</p>
<p>x nb mots dans l'intersection = nombre de mots communs entre la solution et la r&#233;f&#233;rence la plus proche. 
x nb mots dans l'union = nombre de mots de la solution + nombre de mots de la r&#233;f&#233;rence &#8211; nombre de mots 
</p>
<p>communs. S'il y a un seul mot en commun, cette mesure n'est pas nulle.
</p>
<p>4 &#184;
&#185;
&#183;&#168;
</p>
<p>&#169;
&#167;&#152; &#166;
</p>
<p> 
</p>
<p>N
</p>
<p>n
BPBLEU
</p>
<p>1 N
)grams-n nb / gram-n soccurrence nblog(exp
</p>
<p>x nb occurrences n-gram = nombre de n-gram commun avec au moins une r&#233;f&#233;rence. 
x nb n-gram = nombre de n-gram dans la phrase &#224; &#233;valuer = taille de la phrase &#8211; (n &#8211; 1) 
x BP = Brevity Penalty = min ( 1, exp(1 &#8211; Min Nb Mots Ref&#233;rence / Nb Mots Solution) ) 
x Si la solution a au moins le m&#234;me nombre de mots que la plus petite des r&#233;f&#233;rences, BP = 1 (pas de 
</p>
<p>p&#233;nalit&#233;). 
</p>
<p>Pour la mesure BLEU standard N = 4. La mesure BLEU est donc une moyenne logarithmique (=g&#233;om&#233;trique) 
entre les taux de 1-gram, 2-gram, etc, en commun avec les r&#233;f&#233;rences. Cette moyenne est pond&#233;r&#233;e par un 
facteur entre 0 et 1 : Brevity Penalty. Plus il y a de r&#233;f&#233;rences, meilleur sera le score. En mesure BLEU standard 
</p>
<p>128</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TiLT correcteur de SMS : &#233;valuation et bilan qualitatif 
</p>
<p>La solution de correction TiLT, &#224; la diff&#233;rence d'un syst&#232;me de traduction automatique, ne 
reformule pas le message SMS. Elle corrige les mots dans l'ordre dans lequel ils sont 
formul&#233;s. Les risques d'erreurs li&#233;es &#224; l'ordre des mots sont donc assez faibles. N&#233;anmoins, 
l'&#233;criture SMS pr&#233;sentant de nombreux cas d'agglutinations &#224; &#233;tendre, l'utilisation de la 
m&#233;trique BLEU nous a sembl&#233; appropri&#233;e. 
</p>
<p>En standard, la m&#233;trique BLEU prend en compte les n-grams jusqu'au 4-grams. Une seule 
erreur de correction situ&#233;e au milieu d'un message SMS bref, dont la taille est de 5 ou 6 mots, 
est tr&#232;s fortement sanctionn&#233;e par BLEU. Le tableau suivant montre quelques exemples de ce 
type, fortement p&#233;nalis&#233;s par BLEU alors que plut&#244;t bien not&#233;s par Jaccard. 
</p>
<p>SMS source Correction TiLT Correction DELIC Jaccard BLEU
</p>
<p>CT koi ldebu du mess? c'&#233;tait quoi d&#233;but du message ? C'&#233;tait quoi le d&#233;but du message ? 0,85 0
</p>
<p>COMEN FAI T ON 
ALOR? COMMENT fait-t-ON alors ? Comment fait-on alors ? 0,8 0
</p>
<p>L&#233; fete toute seul c cool Les f&#234;tes toute seul c'est cool Les f&#234;tes toute seule, c'est cool 0,75 0
</p>
<p>Tableau 3 : Comparaison de r&#233;sultats obtenus avec les m&#233;triques Jaccard et avec BLEU 
</p>
<p>Consid&#233;rant BLEU comme peu informatif sur les messages brefs tr&#232;s fr&#233;quents en SMS, un 
param&#232;tre a &#233;t&#233; ajout&#233; au calcul de la mesure BLEU permettant de faire varier n dans le calcul 
des n-grams en fonction de la taille du message. Pour un message de 4 ou 5 mots, BLEU 
s'arr&#234;tera aux bi-grams, pour un message de 6 ou 7 mots, on s'arr&#234;te aux tri-grams etc. Avec 
ce param&#232;tre, la mesure BLEU fait d'avantage sens pour les corpus SMS et la coh&#233;rence entre 
Jaccard et BLEU est plus importante. 
</p>
<p>Le Tableau 4 donne les r&#233;sultats obtenus sur les 9 575 SMS du corpus DELIC avec ces trois 
mesures. Pr&#233;cisons que la casse et les signes de ponctuation ont &#233;t&#233; ignor&#233;s pour le calcul. En 
cas de r&#233;f&#233;rence multiple pour un SMS (cf. Tableau 2), le score retenu est le meilleur score 
obtenu sur l'ensemble des r&#233;f&#233;rences possibles. 
</p>
<p>Jaccard BLEU standard BLEU pond&#233;r&#233; 
</p>
<p>0,769 0,681 0,712
</p>
<p>Tableau 4 : Scores BLEU et Jaccard obtenus sur le corpus SMS du DELIC 
</p>
<p>4.2 &#201;valuation qualitative 
</p>
<p>Une &#233;tude des scores obtenus SMS par SMS permet de voir qu'environ 25% du corpus re&#231;oit 
le score maximal de 1. Parmi les SMS source, on trouve des exemples parfaitement ou 
quasi-parfaitement orthographi&#233;s et non d&#233;grad&#233;s par la correction automatique : 
</p>
<p>(N = 4), si aucun t&#233;tragramme est commun avec une r&#233;f&#233;rence, le score est 0. Si la solution est courte, la 
moindre diff&#233;rence avec les r&#233;f&#233;rences donnera un score de 0. Il est donc pr&#233;f&#233;rable d'ajuster le param&#232;tre N en 
fonction de la taille de la solution. N = min (4 , Nb Mots Solution / 2) par exemple.
</p>
<p>129</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;milie GUIMIER DE NEEF, Arnaud DEBEURME, Jungyeul PARK
</p>
<p>Soliel et piscine tout va bien bisous 
Sommes &#224; arles maman 
Souper &#224; la maison ce soir pour feter le d&#233;but de mes vacances 
</p>
<p>mais &#233;galement des exemples &#224; l'&#233;criture typiquement SMS tr&#232;s bien corrig&#233;s : 
</p>
<p>ojrd8 jv ala pi6n tu ve vnir? Aujourd'hui je vais &#224; la piscine, tu veux venir ? 
</p>
<p>noubli pa ke jser&#233; tjs la pr toi N'oublie pas que je serai toujours l&#224; pour toi 
</p>
<p>bjr, vs av&#233; le tps pr 1 kf ? avt 15h.G du taf Bonjour, vous avez le temps pour un caf&#233; ? Avant 15h. J'ai du 
taf.
</p>
<p>Tableau 5 : SMS dont la correction re&#231;oit un score de 1 
</p>
<p>L'analyse des mauvais scores montre trois grands types de limites dans notre syst&#232;me actuel. 
La premi&#232;re tourne autour de la primitive &quot;mot&quot; prise comme point de d&#233;part pour effectuer 
ses hypoth&#232;ses correctives. On remarque, en effet, que les plus mauvais scores sont obtenus 
sur les SMS pr&#233;sentant une absence de s&#233;parateur g&#233;n&#233;ralis&#233;e ou avec un s&#233;parateur peu 
classique de type casse ou symbole particulier. Ce type de ph&#233;nom&#232;ne est pr&#233;sent dans 1 &#224; 2% 
des messages SMS. 
</p>
<p>SMS Correction manuelle Correction TiLT
</p>
<p>TuTcouch&#233;to!Cbi1! 
moijaVpEr2pareusir 
adormir.onsphon... 
</p>
<p>Tu t'es couch&#233; t&#244;t ! C'est bien ! 
Moi j'avais peur de pas r&#233;ussir &#224; 
dormir. On se phone... 
</p>
<p>TuTcouch&#233;to ! c'est bien ! 
MoijaVpEr2pareusir dormir . 
Onspho
</p>
<p>B o n n e f e t e p r o f i t es b i e n d 
e v o t r e d e r n i e r j o u r d e v a 
c a n c e 
</p>
<p>Bonne f&#234;te, profite bien de votre 
dernier jour de vacances. 
</p>
<p>Bonnefeteprof il t'est biendevotrede 
rnierjourdeva cance 
</p>
<p>Tableau 6 : SMS pr&#233;sentant une absence de s&#233;parateur 
</p>
<p>De m&#234;me, sur les m&#233;thodes correctives, notre approche trouve ses limites quand un m&#234;me 
segment cumule diff&#233;rents proc&#233;d&#233;s d'&#233;criture : phon&#233;tique et agglutination (je ne pep a mpaC 
dtoi =&gt; je ne peux pas me passer de toi), &#233;tirement et phon&#233;tique : (G haaaaaaateuh =&gt; j'ai 
h&#226;te) etc. 
</p>
<p>La solution &#224; ces deux difficult&#233;s est sans doute &#224; aller chercher du c&#244;t&#233; des m&#233;thodes 
employ&#233;es en reconnaissance de la parole pour segmenter le signal acoustique. Le probl&#232;me 
de l'absence de s&#233;parateur n'est pas sans rappeler une langue comme le chinois pour laquelle 
des algorithmes de segmentation ont &#233;t&#233; d&#233;velopp&#233;s. 
</p>
<p>La seconde limite vient de l'absence d'apprentissage dans le d&#233;veloppement des donn&#233;es. 
L'indisponibilit&#233; d'un corpus align&#233; lors de la mise au point de la solution en est la cause. On 
peut esp&#233;rer pouvoir maintenant tenter des exp&#233;riences pour extraire les n-grams fr&#233;quents et 
enrichir les lexiques d'expressions r&#233;currentes telles que rien de sp&#233;cial, etc. Apprendre des 
s&#233;quences fr&#233;quentes de mots pour pouvoir affiner les scores attribu&#233;s aux diff&#233;rentes 
hypoth&#232;ses etc. 
</p>
<p>130</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TiLT correcteur de SMS : &#233;valuation et bilan qualitatif 
</p>
<p>Cet apprentissage permettrait sans doute d'ouvrir l'espace des corrections aux mots dont 
l'orthographe est connue du lexique5. En effet, la strat&#233;gie utilis&#233;e actuellement a l'avantage 
de ne pas d&#233;grader les messages bien &#233;crits mais a l'inconv&#233;nient de laisser de nombreux 
homophones h&#233;t&#233;rographes non corrig&#233;s : 
</p>
<p>SMS Correction manuelle Correction TiLT
</p>
<p>Tu me racontera dis Tu me raconteras, dis Tu me racontera dis 
</p>
<p>ns avons dormis Nous avons dormi Nous avons dormis 
</p>
<p>T ou au moi daout? T'es o&#249; au mois d'ao&#251;t T'es o&#249; au moi d'ao&#251;t 
</p>
<p>Tableau 7 : homophones h&#233;t&#233;rographes non corrig&#233;s 
</p>
<p>La troisi&#232;me lacune concerne la trop grande localit&#233; des r&#232;gles de grammaire. Une grammaire 
v&#233;rifiant les principales contraintes de sous-cat&#233;gorisation aiderait &#224; orienter certains choix de 
correction. Dans l'exemple jme langui tro dy aller, TiLT &#233;choue &#224; corriger faute de lien entre 
languir et son d&#233;pendant d'y aller. De m&#234;me, l'accord sujet verbe n'est pas v&#233;rifi&#233; dans tes
vacs se pass bi1 qui est corrig&#233; en tes vacances se passe bien. L'utilisation d'une grammaire 
v&#233;rifiant des contraintes entre t&#234;te et d&#233;pendant serait &#224; exp&#233;rimenter. 
</p>
<p>Enfin, des travaux autour des noms propres restent &#233;galement &#224; faire m&#234;me si &#233;tant donn&#233; leur 
anonymisation dans ce corpus, il est difficile de tirer des conclusions d&#233;finitives sur ce point. 
N&#233;anmoins, on remarque sans surprise que l'identification des pr&#233;noms sans contexte 
d&#233;clencheur connu des lexiques est g&#233;n&#233;rateur de nombreuses erreurs : Julie c jb ap moi =&gt;
Julie ce gibet apr&#232;s moi, gros bisous &#224; vous tous caro =&gt; gros bisous &#224; vous tous carreau.
</p>
<p>5 Bilan et perspectives 
Les mesures BLEU et Jaccard pratiqu&#233;es pour l'&#233;valuation des performances de TiLT 
correcteur de SMS montrent que la solution est efficace &#224; 75% environ. L'ad&#233;quation des 
mesures utilis&#233;es reste bien entendu &#224; discuter. En particulier, il pourrait &#234;tre int&#233;ressant de 
pond&#233;rer les scores obtenus par la difficult&#233; a priori de la correction ; cette difficult&#233; &#233;tant 
quantifiable par une distance entre le SMS et sa transcription. Il faut noter &#233;galement que pour 
une application de correction de SMS avant synth&#232;se vocale, il faudrait pr&#233;voir une &#233;valuation 
par l'usage : les erreurs sur les homophones seraient sans doute moins p&#233;nalisantes. 
</p>
<p>La correction pratiqu&#233;e par TiLT n'exploite pas de donn&#233;es apprises sur corpus. Une 
&#233;valuation sur un autre corpus permettrait de s'assurer de la stabilit&#233; de la solution. C'est 
pourquoi, nous esp&#233;rons pouvoir faire cette m&#234;me &#233;valuation sur le corpus de Fairon et 
al. (2006). 
</p>
<p>Les 25% &#224; 30% de mauvaises corrections montrent les limites de l'approche corrective 
actuelle : pas de correction des homophones h&#233;t&#233;rographes, pas de segmentation des messages 
sans s&#233;parateur, pas de mode correctif hybride etc. autant de ph&#233;nom&#232;nes qui nous montrent 
</p>
<p>5 Sauf dans certains cas tr&#232;s fr&#233;quents d'erreur comme la confusion participe pass&#233; en &#8211;&#233; et infinitif en -er.
</p>
<p>131</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;milie GUIMIER DE NEEF, Arnaud DEBEURME, Jungyeul PARK
</p>
<p>la parent&#233; entre les messages SMS et la langue orale et qui nous invitent &#224; reconsid&#233;rer la 
place centrale de la notion de mot dans notre traitement. 
</p>
<p>Remerciements
Nous remercions Olivier Collin et Jean V&#233;ronis pour leurs conseils et Sabrina Hocq pour son 
travail de collecte et de transcription du corpus. 
</p>
<p>R&#233;f&#233;rences
ANIS, J., (1999). Chats et usages graphiques. Internet, communication et langue fran&#231;aise. In 
Anis J. (&#233;d.), Paris : Herm&#232;s, 71-90.
</p>
<p>ANIS, J., (2001). Parlez-vous texto ? Guide des nouveaux langages du r&#233;seau., Paris : Le 
cherche-midi &#233;diteur. 
</p>
<p>ANIS, J., (2002). Communication &#233;lectronique scripturale et formes langagi&#232;res : chats et 
SMS., Actes des journ&#233;es &#171; S'&#233;crire avec les outils d'aujourd'hui &#187;, Universit&#233; de Poitiers. 
</p>
<p>BOVE, R., (2005)., &#201;tude de quelques probl&#232;mes de phon&#233;tisation dans un syst&#232;me de 
synth&#232;se de la parole &#224; partir de SMS, Actes de R&#201;CITAL 2005, Dourdan, 625-634.
</p>
<p>FAIRON, C., KLEIN, J., PAUMIER, S., (2006)., Le langage SMS. &#201;tude d'un corpus informatis&#233; &#224; 
partir de l'enqu&#234;te 'Faites don de vos SMS &#224; la science', Presses universitaires de Louvain, 
Louvain-la-Neuve.
</p>
<p>GUIMIER DE NEEF, &#201;., V&#201;RONIS, J., (2004). 1 pw1 sr la kestion ;-), Papier pr&#233;sent&#233; &#224; la 
Journ&#233;e d'&#201;tude de l'ATALA &quot;Le traitement automatique des nouvelles formes de 
communication &#233;crite (e-mails, forums, chats, SMS, etc.), Paris.
</p>
<p>HOCQ, S., (2006). &#201;tude des SMS en fran&#231;ais : constitution et exploitation d'un corpus align&#233; 
SMS &#8211; langue standard. Rapport de Master II &quot;Industries des Langues&quot;, Aix-en-Provence. 
</p>
<p>PAPINENI, K., ROUKOS, S., WARD, T., ZHU, W. J., (2002), BLEU: a method for automatic 
evaluation of machine translation, in ACL-2002 : 40th Annual meeting of the Association for 
Computational Linguistics, 311-318. 
</p>
<p>V&#201;RONIS, J., GUIMIER DE NEEF, &#201;., (2006). Le traitement des nouvelles formes de 
communication &#233;crite. In Sabah, G. (&#201;d.), Compr&#233;hension automatique des langues et 
interaction, 227-248, Paris: Herm&#232;s Science. 
</p>
<p>132</p>

</div></div>
</body></html>