<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Caract&#233;risation des discours scientifiques et vulgaris&#233;s en fran&#231;ais, japonais et russe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Caract&#233;risation des discours scientifiques et vulgaris&#233;s
en fran&#231;ais, japonais et russe
</p>
<p>Lorraine GOEURIOT1, Natalia GRABAR2,3, B&#233;atrice DAILLE1
1 LINA/Nantes
</p>
<p>2 INSERM, UMR_S 872, Eq. 20, Paris, F-75006
Universit&#233; Ren&#233; Descartes, Paris, F-75006
</p>
<p>3 Health on the Net Foundation, SIM/HUG, Gen&#232;ve, Suisse
natalia.grabar@biomath.jussieu.fr,
</p>
<p>{lorraine.goeuriot,beatrice.daille}@univ-nantes.fr
</p>
<p>R&#233;sum&#233;. L&#8217;objectif principal de notre travail consiste &#224; &#233;tudier la notion de comparabilit&#233;
des corpus, et nous abordons cette question dans un contexte monolingue en cherchant &#224; dis-
tinguer les documents scientifiques et vulgaris&#233;s. Nous travaillons s&#233;par&#233;ment sur des corpus
compos&#233;s de documents du domaine m&#233;dical dans trois langues &#224; forte distance linguistique
(le fran&#231;ais, le japonais et le russe). Dans notre approche, les documents sont caract&#233;ris&#233;s dans
chaque langue selon leur th&#233;matique et une typologie discursive qui se situe &#224; trois niveaux de
l&#8217;analyse des documents : structurel, modal et lexical. Le typage des documents est impl&#233;ment&#233;
avec deux algorithmes d&#8217;apprentissage (SVMlight et C4.5). L&#8217;&#233;valuation des r&#233;sultats montre
que la typologie discursive propos&#233;e est portable d&#8217;une langue &#224; l&#8217;autre car elle permet en effet
de distinguer les deux discours. Nous constatons n&#233;anmoins des performances tr&#232;s vari&#233;es selon
les langues, les algorithmes et les types de caract&#233;ristiques discursives.
</p>
<p>Abstract. The main objective of our study consists to characterise the comparability of
corpora, and we address this issue in the monolingual context through the disctinction of expert
and non expert documents. We work separately with corpora composed of medical area docu-
ments in three languages, which show an important linguistic distance between them (French,
Japanese and Russian). In our approach, documents are characterised in each language through
their thematic topic and through a discursive typology positioned at three levels of document
analysis : structural, modal and lexical. The document typology is implemented with two lear-
ning algorithms (SVMlight and C4.5). Evaluation of results shows that the proposed discursive
typology can be transposed from one language to another, as it indeed allows to distinguish
the two aimed discourses. However, we observe that performances vary a lot according to lan-
guages, algorithms and types of discursive characteristics.
</p>
<p>Mots-cl&#233;s : linguistique des corpus, corpus comparable, algorithmes d&#8217;apprentissage,
analyse stylistique, degr&#233; de comparabilit&#233;.
</p>
<p>Keywords: corpus linguistics, comparable corpora, learning algorithms, stylistic ana-
lysis, degree of comparability.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lorraine GOEURIOT, Natalia GRABAR, B&#233;atrice DAILLE
</p>
<p>1 Introduction
</p>
<p>Un corpus comparable est un ensemble de textes qui partagent entre eux un certain nombre
de caract&#233;ristiques. La premi&#232;re de ces caract&#233;ristiques est de rassembler des documents qui
portent sur des sujets proches. Par exemple, dans le contexte multilingue, les corpus compa-
rables vont r&#233;unir les documents qui une th&#233;matique commune mais qui ne sont des traductions
(Bowker &amp; Pearson, 2002). Dans un contexte monolingue, les corpus comparables peuvent
contenir les documents qui portent sur le m&#234;me sujet mais rel&#232;vent de discours diff&#233;rents. Le
terme comparable est donc employ&#233; afin d&#8217;indiquer que les corpus ont un certain nombre de
caract&#233;ristiques en commun. Celles-ci peuvent concerner le contexte de cr&#233;ation du texte (ex. :
la p&#233;riode, l&#8217;auteur), mais aussi le texte lui-m&#234;me (ex. : le th&#232;me, le genre). Le choix de ces
caract&#233;ristiques d&#233;pend des objectifs fix&#233;s. Il influe sur le degr&#233; de comparabilit&#233; du corpus,
notion permettant de quantifier la comparabilit&#233; d&#8217;un corpus (aux valeurs maximales dans un
corpus parall&#232;le par exemple).
Dans notre travail, nous &#233;tudions un corpus comparable portant sur le domaine m&#233;dical dans
trois langues &#224; forte distance linguistique : le fran&#231;ais, le japonais et le russe. Afin de garantir
une meilleure comparabilit&#233; des documents de notre corpus, nous prenons en compte une ca-
ract&#233;ristique classique, relative &#224; la th&#233;matique du corpus, mais aussi une caract&#233;ristique discur-
sive : distinction entre les documents selon qu&#8217;ils rel&#232;vent du discours scientifique ou vulgaris&#233;.
Nous nous basons ici sur la notion de discours telle qu&#8217;elle est d&#233;finie par (Ducrot &amp; Schaef-
fer, 1999) : &quot;Tout ensemble d&#8217;&#233;nonc&#233;s d&#8217;un &#233;nonciateur caract&#233;ris&#233; par une unit&#233; globale de
th&#232;me&quot;. Pour l&#8217;impl&#233;mentation de cette caract&#233;risation, nous effectuons une analyse stylistique
contrastive, inspir&#233;e des travaux de (Karlgren, 1998), et proposons une typologie pour la dis-
tinction automatique des documents scientifiques et vulgaris&#233;s en diff&#233;rentes langues. Cette
typologie reprend trois niveaux d&#8217;analyse des documents : structurel, modal et lexical. L&#8217;objec-
tif principal de notre travail consiste &#224; v&#233;rifier si cette typologie, bas&#233;e sur ces trois niveaux,
permet effectivement de caract&#233;riser le discours d&#8217;un document du Web et d&#8217;affiner la notion
de comparabilit&#233; des documents. En travaillant sur un corpus trilingue, nous pourrons aussi
observer le comportement de cette typologie selon les langues. Finalement, cette typologie est
utilis&#233;e afin d&#8217;adapter &#224; notre corpus des algorithmes d&#8217;apprentissage.
</p>
<p>Dans la suite de cet article, nous pr&#233;sentons d&#8217;abord le corpus &#233;tudi&#233; (sec. 2), la typologie &#233;tablie
pour la caract&#233;risation des discours scientifique et vulgaris&#233; (sec. 3), et les m&#233;thodes utilis&#233;es
pour la d&#233;tection automatique de ces discours (sec. 4). Nous pr&#233;sentons ensuite les r&#233;sultats
(sec. 5) et concluons (sec. 6).
</p>
<p>2 Collecte et caract&#233;ristiques du corpus comparable trilingue
</p>
<p>Notre corpus de travail est un corpus comparable comportant des documents en trois langues &#224;
grande distance linguistique : le fran&#231;ais, le japonais et le russe. Dans le cadre de notre &#233;tude,
relative &#224; la recherche d&#8217;information multi- et translangue, nous souhaitons disposer d&#8217;un cor-
pus au degr&#233; de comparabilit&#233; assez &#233;lev&#233;, sans pour autant effacer les diversit&#233;s culturelles
et linguistiques propres &#224; chacune des langues &#233;tudi&#233;es. Nous situons la comparabilit&#233; &#224; deux
niveaux :
&#8211; comme c&#8217;est souvent le cas en recherche d&#8217;information, nous assurons un premier niveau de
</p>
<p>comparabilit&#233; gr&#226;ce &#224; la th&#233;matique commune partag&#233;e par les documents en trois langues.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caract&#233;risation des discours scientifiques et vulgaris&#233;s en fran&#231;ais, japonais et russe
</p>
<p>Nous avons choisi le domaine m&#233;dical et, plus pr&#233;cis&#233;mment, la th&#233;matique &#8220;diab&#232;te et ali-
mentation&#8221; : ce th&#232;me touche un large public et pr&#233;sente une garantie potentielle de collecter
une diversit&#233; de documents sur le web. Par ailleurs, du point de vue applicatif, les corpus com-
parables trilingues &#233;tant en partie d&#233;di&#233;s &#224; l&#8217;extraction d&#8217;informations multilingues, un th&#232;me
commun renforce la garantie de trouver un vocabulaire et des caract&#233;ristiques linguistiques
communes dans les langues trait&#233;es.
</p>
<p>&#8211; de plus, afin d&#8217;augmenter la comparabilit&#233; des textes, nous cherchons &#224; assurer un deuxi&#232;me
niveau de comparabilit&#233; et distinguons les textes du corpus selon leur type de discours, scien-
tifique et vulgaris&#233;.
</p>
<p>Dans la suite de cette section, nous abordons la m&#233;thodologie de constitution du corpus trilingue
et donnons ses principales caract&#233;ristiques.
</p>
<p>2.1 M&#233;thodologie de constitution des corpus
</p>
<p>Le corpus de cette &#233;tude est un corpus comparable dans les langues fran&#231;aise, japonaise et
russe. Les documents sont extraits du Web. La d&#233;marche de constitution du corpus repose sur
trois &#233;tapes principales :
</p>
<p>1. Recherche de pages web correspondant &#224; la th&#233;matique vis&#233;e,
2. S&#233;lection des pages pertinentes,
3. Classement de ces pages selon leur type de discours.
</p>
<p>Ainsi, lors de la premi&#232;re &#233;tape de recherche des pages web, nous avons utilis&#233; trois approches :
(1) Recherche sur le web &#224; l&#8217;aide de moteurs de recherche g&#233;n&#233;raux ; (2) Recherche interne sur
des portails (m&#233;dicaux) en utilisant le cas &#233;ch&#233;ant les moteurs de recherche propres aux sites ;
(3) Exploitation des liens entre les pages. Les deux premi&#232;res approches n&#233;cessitent l&#8217;utilisation
de mots cl&#233;s. Afin d&#8217;obtenir un large spectre de documents, les requ&#234;tes utilis&#233;es sont form&#233;es
avec des combinaisons vari&#233;es de mots cl&#233;s tels que alimentation, diab&#232;te et ob&#233;sit&#233; &#233;tendus
avec i) leurs synonymes relev&#233;s dans les dictionnaires, et ii) aux termes &#233;quivalents extraits des
pages visit&#233;es. Notons aussi que dans le cas d&#8217;utilisation d&#8217;un moteur de recherche sp&#233;cifique &#224;
un portail, les mots cl&#233;s sont &#233;galement sp&#233;cifiques &#224; ce portail.
</p>
<p>Parmi ces documents, nous avons s&#233;lectionn&#233; manuellement les documents pertinents pour la
th&#233;matique vis&#233;e. Et enfin, les pages s&#233;lectionn&#233;es ont ensuite &#233;t&#233; class&#233;es selon le type de
discours &#233;manant. Lors de la classification manuelle, nous utilisons les heuristiques suivantes :
&#8211; un document scientifique est r&#233;dig&#233; par des sp&#233;cialistes &#224; destination de sp&#233;cialistes.
&#8211; en ce qui concerne la vulgarisation scientifique, nous distinguons deux degr&#233;s de vulgarisa-
</p>
<p>tion : les textes &#233;crits par &#8220;le grand public&#8221; &#224; destination de tous, et les textes &#233;crits par des
sp&#233;cialistes &#224; destination du &#8220;grand public&#8221;.
</p>
<p>Nous ne distinguerons pas par la suite ces deux niveaux mais accorderons cependant une plus
grande place aux documents &#233;crits par des sp&#233;cialistes au d&#233;triment des discussions sur des
forums par exemple. Les documents &#233;crits par les sp&#233;cialistes s&#8217;av&#232;rent en effet &#234;tre plus riches
en vocabulaire et plus complets en contenu. La classification manuelle est donc bas&#233;e sur ces
heuristiques, elle est appuy&#233;e par des &#233;l&#233;ments suppl&#233;mentaires : la nature du site contenant
le document, le vocabulaire utilis&#233; dans le document, etc. Il faut noter cependant que la t&#226;che
de classification manuelle reste assez empirique. Cela nous a conduit &#224; ne pas inclure certains
documents &#8220;ambigus&#8221; (documents inclassables ou sur lesquels les avis divergeaient) dans les
corpus d&#8217;apprentissage.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lorraine GOEURIOT, Natalia GRABAR, B&#233;atrice DAILLE
</p>
<p>2.2 Caract&#233;ristiques des corpus
</p>
<p>Le tableau 1 pr&#233;sente les principales caract&#233;ristiques du corpus ainsi constitu&#233; : le nombre de
documents et le nombre de mots dans chacune des langues et pour chaque type de discours.
</p>
<p>Fran&#231;ais Japonais Russe
SC VU SC VU SC VU
</p>
<p>Nb. documents 65 183 119 419 45 150
Nb. mots 425 800 267 900 318 596 175126
</p>
<p>Nb. caract&#233;res 2 668 783 2 845 114 493 587 1 154 773 2298306 2 165 768
</p>
<p>TAB. 1 &#8211; Caract&#233;ristiques du corpus
</p>
<p>Ce corpus rassemble ainsi plus de 1 500 000 mots dans trois langues. Les chiffres donn&#233;s pour la
langue japonaise correspondent au nombre de caract&#232;res, le nombre de mots &#233;tant difficilement
estimable. L&#8217;ensemble de nos documents utilise plus de 3 alphabets et un grand nombre d&#8217;en-
codages diff&#233;rents. C&#8217;est pourquoi les textes ont tous &#233;t&#233; transcod&#233;s en Unicode UTF-8, seul
codage permettant de traiter les alphabets latin et cyrillique, ainsi que les caract&#232;res kanjis ja-
ponais. Les documents du corpus appartiennent &#224; diff&#233;rents formats, parmi lesquels on compte
les formats usuels du web (html, xhtml, php, etc.), mais aussi d&#8217;autres formats (pdf, ps, doc,
etc.). Toutes les pages ont &#233;t&#233; conserv&#233;es dans leur format original, mais aussi converties en
texte brut. Les genres du Web (Bretan et al., 1998) ne sont pas tous repr&#233;sent&#233;s dans le corpus
fran&#231;ais, dans lequel on trouve en majorit&#233; des rapports et articles (de presse ou scientifiques),
contrairement au corpus japonais dans lequel on trouve une grande diversit&#233; (allant du rapport
scientifique &#224; l&#8217;offre d&#8217;emploi). Le corpus russe montre &#233;galement une variabilit&#233; de genres
(articles, ouvrages, recettes de cuisine, guides de bonne pratique, discussions sur des forums
sp&#233;cialis&#233;s, ...).
</p>
<p>3 Une typologie pour l&#8217;analyse stylistique du corpus
</p>
<p>L&#8217;analyse stylistique est une discipline linguistique trouvant son application informatique dans
le domaine de la cat&#233;gorisation textuelle. Ces travaux se basent sur des m&#233;thodes relevant de
l&#8217;apprentissage automatique. Les algorithmes d&#8217;apprentissage les plus connus sont les s&#233;para-
teurs &#224; vastes marges (SVM), les r&#233;seaux de neurones, les classifieurs de Bayes et les arbres de
d&#233;cision (Sebastiani, 2002). Deux grands courants se distinguent dans l&#8217;analyse stylistique. Les
travaux adoptant la d&#233;marche inductive permettent de faire &#233;merger d&#8217;un corpus des corr&#233;lations
d&#233;terminant des classes de similarit&#233;s (pouvant varier selon le type de caract&#233;ristiques utilis&#233;).
Cette m&#233;thode permet de cr&#233;er des typologies dites inductives. Dans le cadre de l&#8217;apprentissage
automatique, cette m&#233;thode s&#8217;apparente &#224; l&#8217;apprentissage non-supervis&#233;, ou clustering (Biber,
1989). La seconde d&#233;marche, appel&#233;e d&#233;marche d&#233;ductive, consiste &#224; analyser un ensemble
de documents pr&#233;class&#233;s afin de caract&#233;riser l&#8217;appartenance d&#8217;un &#233;l&#233;ment &#224; une classe, sous
la forme d&#8217;une typologie. Cette d&#233;marche s&#8217;apparente &#224; l&#8217;apprentissage supervis&#233; (Bretan et
al., 1998). Avec la d&#233;marche d&#233;ductive, deux techniques permettent d&#8217;arriver &#224; une typologie :
l&#8217;analyse des documents un &#224; un, ou l&#8217;analyse contrastive de documents appartenant &#224; deux
classes distinctes. Dans notre travail, nous avons choisi d&#8217;utiliser l&#8217;approche contrastive.
</p>
<p>Les algorithmes de cat&#233;gorisation textuelle s&#8217;appliquent &#224; de nombreuses typologies. Les plus
fr&#233;quentes sont les typologies th&#233;matiques ou de genres (Bretan et al., 1998). Les travaux por-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caract&#233;risation des discours scientifiques et vulgaris&#233;s en fran&#231;ais, japonais et russe
</p>
<p>tant sur les typologies de discours &#233;tant en revanche moins nombreux, nous allons adapter les
algorithmes de la d&#233;marche d&#233;ductive et contrastive &#224; la typologie des discours.
</p>
<p>Les documents de notre corpus, collect&#233;s sur le Web, pr&#233;sentent une structure propre que nous
ne pouvons pas n&#233;gliger. Ainsi, contrairement &#224; un grand nombre de travaux traitant de l&#8217;analyse
stylistique de textes, par exemple (Malrieu &amp; Rastier, 2002 ; Biber, 1989), nous prenons en
compte aussi bien le contenu textuel que la structure des documents. Nous nous basons sur ces
deux types d&#8217;informations afin de d&#233;gager une typologie propre aux discours cibl&#233;s.
</p>
<p>Sinclair (1996) dans ses travaux typologiques introduit une notion de niveaux dans les typolo-
gies textuelles. En effet, il est selon lui plus pertinent de distinguer deux cat&#233;gories de crit&#232;res :
les crit&#232;res externes, caract&#233;ristiques du contexte de cr&#233;ation du texte ; et les crit&#232;res internes,
caract&#233;ristiques linguistiques du texte. Notre corpus &#233;tant construit &#224; partir de documents issus
du Web, nous consid&#233;rons les crit&#232;res externes comme &#233;tant les crit&#232;res relatifs &#224; la cr&#233;ation du
document et &#224; sa structure (caract&#233;ristiques &#8220;non-linguistiques&#8221;). La partie interne concerne les
caract&#233;ristiques linguistiques du document. Cependant, l&#8217;analyse stylistique met en &#233;vidence
diff&#233;rents niveaux de granularit&#233; dans les crit&#232;res. La distinction entre les documents scienti-
fiques et vulgaris&#233;s induit une prise en compte du locuteur dans son discours, c&#8217;est-&#224;-dire de
la modalit&#233;. De plus, le discours scientifique peut se caract&#233;riser par le vocabulaire employ&#233;,
la longueur des mots, et autres crit&#232;res relevant du lexique. La typologie que nous adoptons
distingue donc trois niveaux d&#8217;analyse des documents :
</p>
<p>Caract&#233;ristiques structurelles : &#233;l&#233;ments de la structure graphique et textuelle du texte ;
Caract&#233;ristiques modales : &#233;l&#233;ments caract&#233;risant la modalit&#233; dans le texte ;
Caract&#233;ristiques lexicales : &#233;l&#233;ments relatifs au lexique employ&#233; dans le texte.
</p>
<p>Crit&#232;re Fran&#231;ais Japonais Russe
Format d&#8217;URL &#215;
Format de document &#215; &#215; &#215;
M&#233;ta-informations (pr&#233;sence) &#215; &#215; &#215;
Titre de la page (pr&#233;sence) &#215; &#215; &#215;
Techniques de mise en page &#215; &#215; &#215;
Fonds &#215; &#215; &#215;
Images &#215; &#215; &#215;
Paragraphes &#215; &#215; &#215;
Listes &#215; &#215; &#215;
Nombre de phrases &#215; &#215; &#215;
Typographie &#215; &#215; &#215;
Longueur du document &#215; &#215; &#215;
</p>
<p>TAB. 2 &#8211; Caract&#233;ristiques structurelles
</p>
<p>Les caract&#233;ristiques structurelles, pr&#233;sent&#233;es dans le tableau 2, concernent en majeure partie
l&#8217;aspect graphique du document (format, images, fonds, ...) ainsi que les &#233;l&#233;ments de sa structure
pris en compte ici gr&#226;ce aux balises HTML (paragraphes, listes, titre, ...). L&#8217;ensemble de crit&#232;res
structurels sont d&#233;tectables dans les trois langues.
</p>
<p>Dans le tableau 3 sont pr&#233;sent&#233;es les caract&#233;ristiques modales, qui correspondent &#224; la modalit&#233;
dans les textes, c&#8217;est-&#224;-dire &#224; la position du locuteur dans son propre discours. Ces crit&#232;res sont
directement inspir&#233;s des th&#233;ories de Charaudeau (1992), et ont &#233;t&#233; adapt&#233; &#224; notre corpus (Kri-
vine et al., 2006; Nakao, 2006). Parmi les actes locutifs &#233;nonc&#233;s par Charaudeau (1992), nous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lorraine GOEURIOT, Natalia GRABAR, B&#233;atrice DAILLE
</p>
<p>Crit&#232;re Fran&#231;ais Japonais Russe
Pronoms personnels sujets allocutifs &#215; &#215;
Modalit&#233; de l&#8217;injonction &#215; &#215; &#215;
Modalit&#233; de l&#8217;autorisation &#215; &#215;
Modalit&#233; du jugement &#215;
Modalit&#233; de la suggestion &#215; &#215; &#215;
Modalit&#233; de l&#8217;interrogation &#215; &#215; &#215;
Modalit&#233; de l&#8217;interpellation &#215; &#215;
</p>
<p>M
o
</p>
<p>da
lit
</p>
<p>&#233;
al
</p>
<p>lo
cu
</p>
<p>tiv
e
</p>
<p>odalit&#233; de la requ&#234;te &#215; &#215; &#215;
Pronoms personnels sujets &#233;locutifs &#215; &#215;
Modalit&#233; du constat &#215; &#215; &#215;
Modalit&#233; du savoir &#215; &#215; &#215;
Modalit&#233; de l&#8217;opinion &#215; &#215; &#215;
Modalit&#233; de la volont&#233; &#215; &#215; &#215;
Modalit&#233; de la promesse &#215; &#215; &#215;
Modalit&#233; de la d&#233;claration &#215; &#215;
Modalit&#233; de l&#8217;appr&#233;ciation &#215; &#215;
</p>
<p>M
o
</p>
<p>da
lit
</p>
<p>&#233;
&#233;l
</p>
<p>o
cu
</p>
<p>tiv
e
</p>
<p>odalit&#233; de l&#8217;obligation &#215; &#215;
Modalit&#233; de la possibilit&#233; &#215; &#215;
Modalit&#233; de l&#8217;interdiction &#215;
</p>
<p>TAB. 3 &#8211; Caract&#233;ristiques modales
</p>
<p>Crit&#232;re Fran&#231;ais Japonais Russe
Vocabulaire sp&#233;cialis&#233; &#215; &#215; &#215;
Caract&#232;res num&#233;riques &#215; &#215; &#215;
Unit&#233;s de mesure &#215; &#215; &#215;
Longueur des mots &#215; &#215;
Bibliographie &#215; &#215; &#215;
Citations bibliographiques &#215; &#215; &#215;
Ponctuation &#215; &#215; &#215;
Fins de phrases1 &#215;
Parenth&#232;ses &#215; &#215; &#215;
Autres alphabets (latin, hiragana, katakana) &#215; &#215;
Symboles2 &#215;
</p>
<p>TAB. 4 &#8211; Caract&#233;ristiques lexicales
</p>
<p>n&#8217;avons conserv&#233; que ceux qui s&#8217;av&#233;rent op&#233;ratoires dans les documents analys&#233;s. Par exemple,
la modalit&#233; de l&#8217;opinion peut &#234;tre d&#233;tect&#233;e en fran&#231;ais gr&#226;ce aux verbes comme penser, pa-
ra&#238;tre, sembler. Si, dans leur majorit&#233;, ces crit&#232;res se retrouvent dans les trois langues, quelques
crit&#232;res (jugement, interdiction) s&#8217;av&#232;rent sp&#233;cifiques &#224; une ou deux des langues trait&#233;es, essen-
tiellement parce que l&#8217;instantiation de la typologie &#233;tait bas&#233;e sur des &#233;tudes assez isol&#233;es des
corpus dans chaque langue.
</p>
<p>Enfin, dans le tableau 4, nous pr&#233;sentons les crit&#232;res lexicaux. Plus que dans les deux types pr&#233;-
c&#233;dents, ces crit&#232;res montrent une d&#233;pendance selon les langues, comme l&#8217;usage de caract&#232;res
hiragana ou katakana pour la langue japonaise et celui de l&#8217;alphabet latin en russe. Notons aussi
que certains de ces crit&#232;res sont sp&#233;cifiques des documents scientifiques, comme les bibliogra-
phies et citations bibliographiques, le vocabulaire sp&#233;cialis&#233; ou les unit&#233;s de mesure.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caract&#233;risation des discours scientifiques et vulgaris&#233;s en fran&#231;ais, japonais et russe
</p>
<p>4 Classification automatique selon les discours
</p>
<p>La typologie tripartite (caract&#233;ristiques structurelles, modales et lexicales) sert de base aux al-
gorithmes d&#8217;apprentissage automatique. Nous pr&#233;sentons dans cette section la m&#233;thode : les
algorithmes d&#8217;apprentissage utilis&#233;s et les principes d&#8217;&#233;valuation des r&#233;sultats.
</p>
<p>4.1 Apprentissage
</p>
<p>Comme nous l&#8217;avons annonc&#233;, l&#8217;objectif de notre travail consiste &#224; adapter les algorithmes
d&#8217;apprentissage &#224; la cat&#233;gorisation des documents en fonction de deux discours, scientifique et
vulgaris&#233;. Dans notre travail, l&#8217;analyse stylistique, et la cat&#233;gorisation des documents, est effec-
tu&#233;e &#224; travers la typologie de crit&#232;res propos&#233;e (sec. 3). En effet, les algorithmes d&#8217;apprentissage
per&#231;oivent les documents sous formes de vecteurs, o&#249; chaque &#233;l&#233;ment du vecteur repr&#233;sente la
valeur d&#8217;un crit&#232;re pour le document correspondant. La longueur d&#8217;un vecteur correspond &#224; la
fr&#233;quence (brute ou pond&#233;r&#233;e) de chaque crit&#232;re dans le document trait&#233;. En partant d&#8217;un corpus
d&#8217;apprentissage, o&#249; les documents sont r&#233;partis en deux &#233;chantillons (scientifique et vulgaris&#233;),
et d&#8217;une liste de crit&#232;res, les m&#233;thodes d&#8217;apprentissage g&#233;n&#232;rent une proc&#233;dure de classifica-
tion. Cette proc&#233;dure est ensuite appliqu&#233;e &#224; de nouvelles donn&#233;es, pour effectuer de nouvelles
classifications.
</p>
<p>Il existe diff&#233;rentes techniques de classification automatique de textes (r&#233;seaux de neurones,
classifieurs de Bayes, s&#233;parateurs &#224; vastes marges, etc.) pour lesquelles Sebastiani (2002) a
effectu&#233; un travail de rassemblement et comparaison. Appliqu&#233;es sur un corpus de d&#233;p&#234;ches
Reuters, ces techniques ont ainsi montr&#233; des performances variables en fonction de l&#8217;utilisation
des approches supervis&#233;e ou non-supervis&#233;e, de la taille du corpus, du nombre de cat&#233;gories, etc.
Nous avons choisi d&#8217;utiliser les s&#233;parateurs &#224; vastes marges SVMlight (Joachims, 2002) ainsi
que les arbres de d&#233;cision C4.5 (Quinlan, 1993). Visant un syst&#232;me de classification rapide,
nous avons privil&#233;gi&#233;, pour l&#8217;impl&#233;mentation des crit&#232;res, des techniques simples bas&#233;es sur
des patrons lexicaux ou lexicaux-syntaxiques et qui analysent superficiellement les documents
et leur contenu.
</p>
<p>Le fonctionnement du syst&#232;me de cat&#233;gorisation repose sur la reconnaissance de formes lexi-
cales dans les documents, que ce soit pour les crit&#232;res graphiques (reconnus &#224; travers les balises),
modaux (reconnus &#224; travers les marqueurs de modalit&#233;) ou lexicaux.
</p>
<p>4.2 &#201;valuation
Le corpus doit &#234;tre &#233;chantillonn&#233; en deux parties : un &#233;chantillon &#233;tant r&#233;serv&#233; &#224; l&#8217;apprentissage,
l&#8217;autre au test. Pour cela, nous avons utilis&#233; la m&#233;thode dite par validation crois&#233;e (N-fold cross
validation)(Cornu&#233;jols &amp; Miclet, 2002).
Cette m&#233;thode consiste &#224; diviser le corpus d&#8217;apprentissage en n sous-&#233;chantillons de tailles
&#233;gales. On retient ensuite un des n &#233;chantillons (celui de num&#233;ro i) qui sera utilis&#233; pour la
phase de test, les autres servant &#224; l&#8217;apprentissage. Une fois les r&#233;sultats collect&#233;s, on r&#233;it&#232;re
cette op&#233;ration en faisant varier i de 1 &#224; n. Nous avons choisi de poser n = 5. Nous avons donc
80% de nos documents (en terme de caract&#232;res) dans l&#8217;&#233;chantillon d&#8217;apprentissage, les autres
20% dans l&#8217;&#233;chantillon de test. Les r&#233;sultats pr&#233;sent&#233;s dans la section 5 sont les moyennes sur</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lorraine GOEURIOT, Natalia GRABAR, B&#233;atrice DAILLE
</p>
<p>les 5 partitionnements.
</p>
<p>Par ailleurs, nous utilisons les m&#233;triques de pr&#233;cision et de rappel pour &#233;valuer nos r&#233;sultats :
&#8211; le rappel, correspondant au nombre de documents correctement class&#233;s dans une classe C sur
</p>
<p>le nombre de documents appartenant &#224; cette classe ;
&#8211; la pr&#233;cision, correspondant au nombre de documents correctement class&#233;s dans la classe C
</p>
<p>sur le nombre de documents class&#233;s dans la classe C.
</p>
<p>5 Analyse et discussion des r&#233;sultats
</p>
<p>Nous avons donc appliqu&#233; les algorithmes SVMlight et C4.5 &#224; notre corpus. Les r&#233;sultats de la
classification pour ces deux algorithmes figurent dans les tableaux 5 et 6.
</p>
<p>Fran&#231;ais Japonais Russe
Pr&#233;c. Rapp. Pr&#233;c. Rapp. Pr&#233;c. Rapp.
</p>
<p>Scientifique 1,00 0,36 0,20 0,41 1,00 0,52
</p>
<p>sv
m
</p>
<p>l
</p>
<p>Vulgaris&#233; 0,80 1,00 0,72 0,80 0,75 1,00
Scientifique 0,89 0,80 0,13 0,12 0,50 0,38
</p>
<p>c4
.
</p>
<p>5
</p>
<p>Vulgaris&#233; 0,91 0,94 0,84 0,86 0,74 0,82
</p>
<p>TAB. 5 &#8211; Pr&#233;cision et rappel pour chaque cat&#233;gorie de crit&#232;res obtenus pour les algorithmes
SVM light et C4.5 sur les trois langues
</p>
<p>Fran&#231;ais Japonais Russe
Pr&#233;c. Rapp. Pr&#233;c. Rapp. Pr&#233;c. Rapp.
</p>
<p>Caract&#233;ristiques structurelles 0,90 0,67 0,59 0,71 0,85 0,74
</p>
<p>sv
m
</p>
<p>l
</p>
<p>Caract&#233;ristiques modales 0,60 0,50 0,50 0,49 0,28 0,50
Caract&#233;ristiques lexicales 0,91 0,75 0,58 0,53 0,98 0,97
</p>
<p>Caract&#233;ristiques structurelles 0,85 0,85 0,41 0,44 0.62 0,68
</p>
<p>c4
.
</p>
<p>5
</p>
<p>Caract&#233;ristiques modales 0,89 0,91 0,39 0,44 0,34 0,68
Caract&#233;ristiques lexicales 0,85 0,85 0,47 0,45 0,45 0,52
</p>
<p>TAB. 6 &#8211; R&#233;sultats pour chaque cat&#233;gorie de crit&#232;res
</p>
<p>Selon le tableau 5, quels que soient la langue et l&#8217;algorithme, les documents du discours vul-
garis&#233; sont toujours mieux cat&#233;goris&#233;s. On remarque ainsi que les r&#233;sultats obtenus avec les
documents en fran&#231;ais sont dans l&#8217;ensemble assez satisfaisants, avec un rappel moyen de 87%,
et une pr&#233;cision moyenne de 90% toutes cat&#233;gories confondues pour le classifieur C4.5 (soit
plus de 200 documents bien class&#233;s parmi les 250 du corpus). Les r&#233;sultats de la classification
en japonais sont bons pour les documents du discours vulgaris&#233;, mais assez m&#233;diocres pour les
documents scientifiques. Finalement, avec les documents russes, on obtient de meilleurs r&#233;sul-
tats avec le syst&#232;me SVMlight, avec un rappel sup&#233;rieur &#224; 75 % et une pr&#233;cision de 87%. En ce
qui concerne les performances plus faibles de la cat&#233;gorisation des documents scientifiques en
japonais et en russe, cela peut &#234;tre expliqu&#233; par la plus forte proportion de documents vulgaris&#233;s
pour ces langues, au d&#233;triment des documents scientifiques (voir le tableau 1). La normalisation
des vecteurs d&#8217;apprentissage permet de pallier ces trop grandes variations mais il est &#233;vident</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caract&#233;risation des discours scientifiques et vulgaris&#233;s en fran&#231;ais, japonais et russe
</p>
<p>qu&#8217;un corpus d&#8217;apprentissage plus grand contient des donn&#233;es plus vari&#233;es et permet de g&#233;n&#233;rer
un mod&#232;le de la langue plus complet.
</p>
<p>Par contre, ce r&#233;sultat est assez surprenant pour le fran&#231;ais : le nombre d&#8217;occurrences dans
les documents scientifiques y est presque deux fois plus important, m&#234;me si le nombre de do-
cuments scientifiques reste inf&#233;rieur. Quant aux r&#233;sultats globalement moins performants en
japonais, ils peuvent s&#8217;expliquer par une forte disparit&#233; dans les genres des documents. Par
cons&#233;quent, il est plus difficile de caract&#233;riser ce type de discours par un ensemble de caract&#233;-
ristiques &#8220;stable&#8221;. Les crit&#232;res utilis&#233;s lors de la classification manuelle (voir sec. 2.1) ne sont
peut &#234;tre pas suffisants dans cette langue et devraient &#234;tre affin&#233;s.
</p>
<p>Dans le tableau 6 figurent les r&#233;sultats obtenus par chacun des deux algorithmes en fonction des
cat&#233;gories de la typologie. Chacune de ces cat&#233;gories montre son importance dans la typologie.
En effet, quel que soit le type de classifieur, les r&#233;sultats obtenus dans chaque langue indiquent
qu&#8217;il est possible de classer correctement plus de la moiti&#233; de nos documents en tenant compte
des crit&#232;res n&#8217;appartenant qu&#8217;&#224; une seule cat&#233;gorie. Cependant, aucune des cat&#233;gories ne se
distingue de fa&#231;on significative dans ces tests. Par ailleurs, les meilleures cat&#233;gories ne sont
pas les m&#234;mes selon le classifieur utilis&#233;. Ainsi, avec SVMlight, ce sont les caract&#233;ristiques
structurelles et lexicales qui se montrent les plus efficaces dans les trois langues. Par contre,
avec C4.5, chaque langue privil&#233;gie des caract&#233;ristiques diff&#233;rentes : la modalit&#233; en fran&#231;ais, le
lexique en japonais et la structure des documents en russe. De mani&#232;re plus d&#233;taill&#233;e, nous avons
pu &#233;galement constater que, parmi les crit&#232;res les plus discriminants, on trouve le type d&#8217;URL
(format de l&#8217;URL : site hospitalier, universitaire, etc.), les pronoms d&#233;locutifs et le nombre de
phrases narratives pour le corpus fran&#231;ais ; la longueur des documents, les pronoms &#233;locutifs et
les formules de politesse en fin de phrases pour le japonais ; le titre des documents, les images
et le vocabulaire sp&#233;cialis&#233; pour le corpus russe.
</p>
<p>6 Conclusion et perspectives
</p>
<p>En partant d&#8217;un corpus comparable compos&#233; de documents issus du Web en fran&#231;ais, japonais
et russe, nous avons men&#233; une analyse stylistique et contrastive et avons &#233;labor&#233; une typologie
pour la caract&#233;risation des discours scientifique et vulgaris&#233; sur le Web. Cette typologie se base
sur trois aspects des documents du Web : l&#8217;aspect structurel, l&#8217;aspect modal et l&#8217;aspect lexical.
Notre typologie, impl&#233;ment&#233;e gr&#226;ce aux algorithmes d&#8217;apprentissage des s&#233;parateurs &#224; vastes
marges (SVMlight) ainsi qu&#8217;aux arbres de d&#233;cision (C4.5) donne des r&#233;sultats de classification
satisfaisants. Nous pouvons ainsi &#8220;calculer&#8221; le type de discours d&#8217;un document du Web. Ces
r&#233;sultats montrent en outre que chacune des cat&#233;gories de la typologie est discriminante pour le
syst&#232;me de cat&#233;gorisation. En effet, chacune d&#8217;elles permet d&#8217;obtenir des r&#233;sultats acceptables,
tandis que leur combinaison permet de les am&#233;liorer. Le discours d&#8217;un document du Web peut
donc &#234;tre caract&#233;ris&#233; selon ces trois aspects. Nous remarquons par ailleurs que certains des cri-
t&#232;res de la typologie sont pr&#233;sents quelle que soit la langue, ce qui permet de statuer sur leur
caract&#232;re &#8220;universel&#8221;. Il semble donc qu&#8217;il existe des &#233;l&#233;ments communs dans les documents en
langues diff&#233;rentes qui permettent d&#8217;indiquer leur type de discours et que, de mani&#232;re g&#233;n&#233;rale,
cette typologie est portable d&#8217;une langue &#224; une autre. Une des limites principales, observable
dans notre travail, semble provenir de la taille insuffisante des corpus. Par exemple, pour la cat&#233;-
gorisation des documents scientifiques en japonais et en russe. Par ailleurs, les faibles r&#233;sultats
de la classification des documents scientifiques japonais sont dus &#233;galement &#224; la diversit&#233; des
genres dans ce corpus. Cette constatation nous am&#232;ne &#224; nous interroger sur la composition et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lorraine GOEURIOT, Natalia GRABAR, B&#233;atrice DAILLE
</p>
<p>la cat&#233;gorisation manuelle du corpus japonais. Ainsi, suite &#224; la classification hi&#233;rarchique des
notions de genres et de discours de (Malrieu &amp; Rastier, 2002), on peut se demander si cette dis-
tinction ne permettrait pas d&#8217;affiner nos r&#233;sultats. En respectant la distinction des genres, nous
pouvons rendre les cat&#233;gories d&#8217;apprentissage plus homog&#232;nes et garantir ainsi un plus fort de-
gr&#233; de comparabilit&#233; dans les corpus. De plus, suite &#224; notre travail, nous nous interrogeons sur
la l&#233;gitimit&#233; de la cat&#233;gorisation binaire effectu&#233;e. Nous pensons qu&#8217;il pourrait &#234;tre int&#233;ressant
de consid&#233;rer les cat&#233;gories scientifiques et vulgaris&#233;es des documents comme un continuum.
Ceci conduirait &#224; attribuer un &#8220;degr&#233; de vulgarisation&#8221; &#224; chaque document plut&#244;t qu&#8217;un type de
discours.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; men&#233; dans le cadre du projet DECO, programme CNRS-TCAN 2004-2006 en
partenariat avec le NII et l&#8217;INaLCO. Nous remercions Estelle Dubreil, Sonia Krivine et Masaru
Tomimitsu pour leur participation &#224; la construction du corpus comparable.
</p>
<p>R&#233;f&#233;rences
BIBER D. (1989). A typology of english texts. Linguistics, 27, 3&#8211;43.
BOWKER L. &amp; PEARSON J. (2002). Working with Specialized Language : A Practical Guide to Using
Corpora. London/New York, Routeledge.
BRETAN I., DEWE J., HALLBERG A., WOLKERT N. &amp; KARLGREN J. (1998). Web-specific genre
visualisation. In Proceedings of the 3rd World Conference on the WWW and Internet.
CHARAUDEAU P. (1992). Grammaire du sens et de l&#8217;expression. Hachette.
CORNU&#201;JOLS A. &amp; MICLET L. (2002). Apprentissage artificiel : Concepts et algorithmes. Eyrolles.
DUCROT O. &amp; SCHAEFFER J.-M. (1999). Nouveau dictionnaire encyclop&#233;dique des sciences du lan-
gage. Seuil.
JOACHIMS T. (2002). Learning to Classify Text using Support Vector Machines. Kluwer.
KARLGREN J. (1998). Natural Language Information Retrieval, chapter Stylistic Experiments in In-
formation Retrieval. Tomek, Kluwer.
KRIVINE S., TOMIMITSU M., GRABAR N. &amp; SLODZIAN M. (2006). Relever des crit&#232;res pour la
distinction automatique entre les documents m&#233;dicaux scientifiques et vulgaris&#233;s en russe et en japonais.
In P. MERTENS, C. FAIRON, A. DISTER &amp; P. WATRIN, Eds., Actes de la 13&#232;me conf&#233;rence sur le
Traitement Automatique des Langues Naturelles (TALN), volume vol.1, p. 522&#8211;531, Leuven.
MALRIEU D. &amp; RASTIER F. (2002). Genres et variations morphosyntaxiques. TAL, 42(2), 548&#8211;577.
NAKAO Y. (2006). &#233;tude s&#233;mantico-discursive contrastive d&#8217;un corpus comparable fran&#231;ais-japonais.
Master&#8217;s thesis, Universit&#233; de Nantes.
QUINLAN J. R. (1993). C4.5 : Programs for Machine Learning. San Francisco, CA, USA : Morgan
Kaufmann Publishers.
SEBASTIANI F. (2002). Machine learning in automated text categorization. ACM Computing Surveys,
34(1), 1&#8211;47.
SINCLAIR J. (1996a). Preliminary recommendations on Corpus Typology. Rapport interne, EAGLES
(Expert Advisory Group on Language Engineering Standards).
SINCLAIR J. (1996b). Preliminary recommendations on Text Typology. Rapport interne, EAGLES
(Expert Advisory Group on Language Engineering Standards).</p>

</div></div>
</body></html>