<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse automatique vs analyse interactive : un cercle vertueux pour la voyellation, l&#8217;&#233;tiquetage et la lemmatisation de l&#8217;arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211; 8 juin 2007 
</p>
<p>Analyse automatique vs analyse interactive : un cercle vertueux 
pour la voyellation, l&#8217;&#233;tiquetage et la lemmatisation de l&#8217;arabe
</p>
<p>Fathi DEBILI1, Zied BEN TAHAR1, Emna SOUISSI2
1 LLACAN, INALCO, CNRS 
</p>
<p>7, rue Guy M&#244;quet, 94801 Villejuif cedex, France 
2 ESSTT, 5, Avenue Taha Hussein &#8211; 1008 Tunis 
</p>
<p>fathi.debili@wanadoo.fr, bentaharzied@gmail.com,
emna.souissi@planet.tn
</p>
<p>R&#233;sum&#233;. Comment produire de fa&#231;on massive des textes annot&#233;s dans des conditions 
d&#8217;efficacit&#233;, de reproductibilit&#233; et de co&#251;t optimales ? Plut&#244;t que de corriger les sorties 
d&#8217;analyse automatique moyennant des outils d&#8217;&#233;ditions &#233;ventuellement d&#233;di&#233;s, ainsi qu&#8217;il est 
commun&#233;ment pr&#233;conis&#233;, nous proposons de recourir &#224; des outils d&#8217;analyse interactive o&#249; la 
correction manuelle est au fur et &#224; mesure prise en compte par l&#8217;analyse automatique. Posant 
le probl&#232;me de l&#8217;&#233;valuation de ces outils interactifs et du rendement de leur ergonomie 
linguistique, et proposant pour cela une m&#233;trique fond&#233;e sur le calcul du co&#251;t qu&#8217;exigent ces 
corrections exprim&#233; en nombre de manipulations (frappe au clavier, clic de souris, etc.), nous 
montrons, au travers d&#8217;un protocole exp&#233;rimental simple orient&#233; vers la voyellation, 
l&#8217;&#233;tiquetage et la lemmatisation de l&#8217;arabe, que paradoxalement, les meilleures performances 
interactives d&#8217;un syst&#232;me ne sont pas toujours corr&#233;l&#233;es &#224; ses meilleures performances 
automatiques. Autrement dit, que le comportement linguistique automatique le plus 
performant n&#8217;est pas toujours celui qui assure, d&#232;s lors qu&#8217;il y a contributions manuelles, le 
meilleur rendement interactif. 
</p>
<p>Abstract. How can we massively produce annotated texts, with optimal efficiency, 
reproducibility and cost? Rather than correcting the output of automatic analysis by means of 
possibly dedicated tools, as is currently suggested, we find it more advisable to use interactive 
tools for analysis, where manual editing is fed in real time into automatic analysis. We 
address the issue of evaluating these tools, along with their performance in terms of linguistic 
ergonomy, and propose a metric for calculating the cost of editing as a number of keystrokes 
and mouse clicks. We show, by way of a simple protocol addressing Arabic vowellation, 
tagging and lemmatization, that, surprisingly, the best interactive performance of a system is 
not always correlated to its best automatic performance. In other words, the most performing 
automatic linguistic behavior of a system is not always yielding the best interactive behavior, 
when manual editing is involved. 
</p>
<p>Mots-cl&#233;s : analyse automatique vs interactive ; annotation s&#233;quentielle, parall&#232;le ; voyellation, 
lemmatisation, &#233;tiquetage de l&#8217;arabe ; m&#233;trique pour l&#8217;&#233;valuation de l&#8217;analyse interactive.
</p>
<p>Keywords: automatic versus interactive analysis of Arabic, proposal of metrics for evaluating 
the interactive analysis, design and implementation of software for interactive vowellation, 
lemmatisation and POS-tagging of Arabic, evaluation.
</p>
<p>347</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi DEBILI, Zied BEN TAHAR, Emna SOUISSI
</p>
<p>1 Introduction
L&#8217;analyse automatique semble avoir pr&#233;c&#233;d&#233; l&#8217;analyse interactive, laquelle signifie 
intervention manuelle. Elle a &#233;t&#233; la pr&#233;occupation premi&#232;re des chercheurs, pour la plupart 
d&#8217;entre eux et d&#232;s le d&#233;part1, et sans doute restera-t-elle longtemps encore le but &#224; atteindre, la 
dimension &#224; parfaire. L&#8217;analyse manuelle que nous dirons &#171; artisanale &#187; a, elle aussi, &#233;t&#233; 
pratiqu&#233;e d&#8217;embl&#233;e, avec des objectifs divers, en particulier celui de la confection de corpus 
annot&#233;s orient&#233;s vers l&#8217;apprentissage ou l&#8217;&#233;valuation. M&#234;me si l&#8217;on s&#8217;est tr&#232;s vite rendu 
compte de la difficult&#233; mat&#233;rielle qu&#8217;il y avait &#224; produire de l&#8217;analyse manuelle, ce n&#8217;est que 
tardivement, sous la pression d&#8217;une double exigence, de performances et de plus large 
couverture, que l&#8217;on y a consacr&#233; des efforts soutenus. Avec la r&#233;daction de guides 
d&#8217;annotation pour rendre l&#8217;op&#233;ration autant que faire se peut reproductible (cf. l&#8217;action 
GRACE par exemple, Adda et al. 1999, V&#233;ronis, 1999, Abeill&#233; et Cl&#233;ment, 2003). Puis avec 
la confection d&#8217;outils informatiques d&#233;di&#233;s o&#249; la part de l&#8217;automatique au service du manuel a 
&#233;t&#233; peu &#224; peu introduite et amplifi&#233;e (Habert, 2005). Le pr&#233;sent travail s&#8217;inscrit dans cette 
dynamique qu&#8217;il prolonge. Nous abordons les probl&#232;mes que pose l&#8217;annotation massive, 
manuellement v&#233;rifi&#233;e et corrig&#233;e, de corpus arabes. Autrement dit, de l&#8217;analyse morpho-
grammaticale interactive de l&#8217;arabe. 
</p>
<p>Au travers des difficult&#233;s que pr&#233;sentent la voyellation, l&#8217;&#233;tiquetage et la lemmatisation de 
l&#8217;arabe, cf. partie 2, des co&#251;ts prohibitifs qu&#8217;elles engendrent sous l&#8217;angle de la v&#233;rification et 
saisie manuelle, cf. partie 3, nous d&#233;crivons, partie 4, les sp&#233;cifications qui nous ont amen&#233;s &#224; 
d&#233;velopper une analyse interactive vue non pas comme ind&#233;pendante de l&#8217;analyse 
automatique, m&#234;me si elle en utilise les r&#233;sultats qu&#8217;elle est sens&#233;e lui renvoyer 
&#233;ventuellement corrig&#233;s, mais bien comme une extension r&#233;troactive de celle-ci.  
</p>
<p>Soulevant le probl&#232;me que pose l&#8217;&#233;valuation des performances de l&#8217;annotation interactive, 
nous montrons qu&#8217;il y a intrication entre les deux processus, automatique et interactif, o&#249; le 
service rendu mutuel va au-del&#224; du simple &#233;change de donn&#233;es annot&#233;es. L&#8217;on constate en 
effet que l&#8217;exigence de meilleures performances pour les proc&#233;dures d&#8217;analyse interactive, qui 
passent par la d&#233;finition de diverses ergonomies linguistiques intuitives et efficaces, am&#232;ne &#224; 
reconsid&#233;rer la conception m&#234;me des algorithmes de la dimension automatique.  
</p>
<p>Deux ergonomies linguistiques se d&#233;gagent. La premi&#232;re, s&#233;quentielle, est celle, classique, qui 
vient naturellement &#224; l&#8217;esprit. Elle est li&#233;e au fait que les v&#233;rifications annotations manuelles 
n&#233;cessitent en g&#233;n&#233;ral que soit consult&#233; le contexte du mot en cours de v&#233;rification. Cette 
ergonomie s&#8217;av&#232;re tr&#232;s lente, et donc peu productive, cf. partie 5. La seconde, parall&#232;le, essaie 
de parer &#224; cette lenteur en mettant &#224; profit le fait que bon nombre de mots apparaissent 
souvent, le gain projet&#233; &#233;tant alors que l&#8217;on puisse tous les v&#233;rifier et annoter en m&#234;me temps. 
Cette ergonomie s&#8217;av&#232;re plus productive mais est plus difficile &#224; mettre en &#339;uvre, cf. partie 6.  
</p>
<p>Faisant ainsi converger nos pr&#233;occupations vers la r&#233;alisation d&#8217;un syst&#232;me int&#233;gr&#233;, comment 
&#233;valuer les performances des ergonomies linguistiques et interactives qui en constituent 
l&#8217;interface, performances qui rel&#232;vent a priori du qualitatif, et qui en m&#234;me temps restent 
d&#233;pendantes des performances des traitements d&#8217;analyse automatique qui, eux, constituent le 
c&#339;ur du syst&#232;me ? Une m&#233;trique et un protocole exp&#233;rimental sont propos&#233;s pour la mesure 
</p>
<p>1  Les diverses applications assist&#233;es par ordinateur (x. A. O.) ne visaient pas la confection massive de 
donn&#233;es dictionnairiques ou textuelles annot&#233;es. 
</p>
<p>348</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique vs analyse interactive : un cercle vertueux 
</p>
<p>des performances de l&#8217;analyse interactive, lesquelles ne se calculent pas de la m&#234;me fa&#231;on que 
celles de l&#8217;analyse automatique.  
</p>
<p>R&#233;sultats d&#8217;exp&#233;rimentations et commentaires sont livr&#233;s parties 5 et suivantes. 
</p>
<p>2 Des niveaux d&#8217;ambigu&#239;t&#233; &#233;lev&#233;s 
Le mot arabe, tel qu&#8217;on le rencontre dans les textes, c'est-&#224;-dire sous sa forme fl&#233;chie, simple 
ou agglutin&#233;e (proclitique+forme simple+enclitique, que nous conviendrons d&#8217;appeler hyper-
forme), pr&#233;sente des niveaux d&#8217;ambigu&#239;t&#233; segmentale, vocalique, casuelle, lemmatique, et 
grammaticale relativement &#233;lev&#233;s. Le tableau 1 donne &#224; titre indicatif les valeurs moyennes 
mesur&#233;es en d&#233;finition (comptages effectu&#233;s sur des donn&#233;es dictionnairiques : un 
dictionnaire de 66 millions d&#8217;entr&#233;es non voyell&#233;es obtenues par synth&#232;se lexico-
syntagmatique, un autre de 157 mille entr&#233;es issues d&#8217;un corpus de 2 millions d&#8217;occurrences), 
et en usage (comptages effectu&#233;s sur des donn&#233;es textuelles : ici, sur les 2 millions 
d&#8217;occurrences du corpus pr&#233;cit&#233;). 
</p>
<p>Ambigu&#239;t&#233; Segmentale Vocalique et Casuelle Lemmatique Grammaticale
</p>
<p>Dictionnaire 66.106 1,08 2,17 1,68 2,99
</p>
<p>Sous lexique 157 031 1,26 6,40 2,65 9,16
</p>
<p>En usage 1,32 7,84 3,66 10,76
</p>
<p>Tableau 1 : Niveaux d&#8217;ambigu&#239;t&#233; de l&#8217;hyper-forme arabe 
</p>
<p>Ces valeurs placent l&#8217;arabe &#224; des niveaux d&#8217;ambigu&#239;t&#233; sensiblement plus &#233;lev&#233;s que ceux du 
fran&#231;ais. Elles se rapportent en effet, ainsi que nous venons de le dire, non pas aux formes 
simples de l&#8217;arabe, dont les niveaux d&#8217;ambigu&#239;t&#233; sont plus &#233;lev&#233;s encore (Debili et al. 2002), 
mais aux formes simples et agglutin&#233;es. Une autre mesure, plus globale, a pu &#234;tre effectu&#233;e. 
Elle se rapporte au niveau d&#8217;ambigu&#239;t&#233; compos&#233;e, c'est-&#224;-dire toutes ambigu&#239;t&#233;s segmentales, 
vocaliques, casuelles, lemmatiques, et grammaticales confondues. La synth&#232;se lexico-
syntagmatique donne en effet pour 500 mille formes fl&#233;chies simples non voyell&#233;es arabes, 
305 millions de formes simples et agglutin&#233;es, voyell&#233;es, lemmatis&#233;es et &#233;tiquet&#233;es, 
diff&#233;rentes, correspondant &#224; 66 millions de formes simples et agglutin&#233;es non voyell&#233;es. Le 
rapport de 305 sur 66 conduit &#224; une ambigu&#239;t&#233; moyenne d&#8217;environ 4,6 acceptions morpho-
grammaticales diff&#233;rentes par entr&#233;e. Ce chiffre est de 14,7 si les comptages sont effectu&#233;s sur 
le sous lexique de 157 mille entr&#233;es. En usage, comptages effectu&#233;s sur le texte de 2 millions 
d&#8217;occurrences, cette moyenne passe &#224; 16,7 acceptions morpho-grammaticales diff&#233;rentes par 
occurrence. L&#8217;on peut remarquer, incidemment, que la r&#233;p&#233;tition textuelle semble ainsi puiser 
davantage dans l&#8217;ambigu que dans le non ambigu. 
</p>
<p>Ces niveaux d&#8217;ambigu&#239;t&#233;s sont relativement importants. Nous ne disposons pas de chiffres 
&#233;quivalents pour le fran&#231;ais ou l&#8217;anglais. Il nous faudrait pour cela consid&#233;rer les ambigu&#239;t&#233;s 
li&#233;es non pas seulement aux formes fl&#233;chies, mais aussi aux syntagmes constitu&#233;s de ces 
formes simples et des mots vides (articles, pr&#233;positions, pronoms, etc.) qui peuvent leurs &#234;tre 
adjoints, afin d&#8217;&#233;tablir le parall&#232;le avec l&#8217;arabe o&#249; ces mots s&#8217;attachent sous forme de 
proclitiques et d&#8217;enclitiques. Dans la terminologie de Lucien Tesni&#232;re, consid&#233;rer les mots
constitutifs accompagn&#233;s de leurs mots subsidiaires ou satellites (Tesni&#232;re, 1969, p. 57, &#167;18). 
</p>
<p>349</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi DEBILI, Zied BEN TAHAR, Emna SOUISSI
</p>
<p>Dans une perspective d&#8217;annotation manuelle, au-del&#224; des difficult&#233;s &#224; caract&#232;re linguistique 
(d&#233;finition des &#233;tiquettes, crit&#232;res de choix, etc.) dont nous admettrons qu&#8217;elles puissent &#234;tre 
comparables d&#8217;une langue &#224; une autre, ces niveaux d&#8217;ambigu&#239;t&#233; indiquent que l&#8217;op&#233;ration 
d&#8217;annotation sera sans doute comparativement plus co&#251;teuse au plan mat&#233;riel qu&#8217;elle ne peut 
l&#8217;&#234;tre pour le fran&#231;ais par exemple, l&#8217;&#233;tendue des choix &#233;tant plus large. Avec la saisie des 
voyelles, la situation va &#234;tre plus critique encore. 
</p>
<p>3 Des co&#251;ts d&#8217;annotation et de saisie &#233;lev&#233;s 
En effet, en arabe, la plupart des lettres (87% en d&#233;finition, 77% en usage) demandent pour 
&#234;tre voyell&#233;es d&#8217;&#234;tre accompagn&#233;es d&#8217;un signe diacritique dont la saisie co&#251;te 2 frappes au 
clavier, &#224; l&#8217;image du tr&#233;ma en fran&#231;ais. La saisie des lettres voyell&#233;es en arabe est donc 
particuli&#232;rement co&#251;teuse : 3 frappes en l&#8217;occurrence, soit autant que pour les lettres avec 
tr&#233;ma en fran&#231;ais. Le tableau 2 donne le co&#251;t moyen du caract&#232;re exprim&#233; en nombre de 
frappes, calcul&#233; pour diff&#233;rents corpus : fran&#231;ais (673 mille mots), anglais (650 mille mots), 
arabe voyell&#233; (800 mille mots), et arabe non voyell&#233; (2 millions de mots).  
</p>
<p>Co&#251;t moyen du caract&#232;re Proportion des 
signes diacritiques
</p>
<p>Proportion dans le 
co&#251;t de la saisie 
</p>
<p>Anglais 1,00001 0,0005 0,001
</p>
<p>Fran&#231;ais 1,003  3,51  3,84 
</p>
<p>Arabe non voyell&#233; 1,037 - -
</p>
<p>Arabe voyell&#233; 1,46 43,7% 59,9%
</p>
<p>Tableau 2 : Co&#251;t moyen du caract&#232;re en nombre de frappes 
</p>
<p>Ces chiffres signifient que la saisie d&#8217;un texte de N caract&#232;res (lettres avec ou sans signe 
diacritique) co&#251;tera approximativement N&#176;1,00001 frappes au clavier si le texte est en 
anglais, contre N&#176;1,003 si le texte est en fran&#231;ais, N&#176;1,037 si le texte est en arabe non 
voyell&#233;, mais N&#176;1,46 si le texte est en arabe voyell&#233; ! Si l&#8217;on ajoute que la voyellation d&#8217;un 
texte pr&#233;alablement saisi ne co&#251;te pas moins, mais autant que de le ressaisir enti&#232;rement 
voyell&#233; (Debili et Fluhr, 2006), alors l&#8217;annotation vocalique de l&#8217;arabe, sans autre pr&#233;caution, 
s&#8217;av&#232;re prohibitivement co&#251;teuse. 
</p>
<p>Ces caract&#233;risations sont bien entendu li&#233;es &#224; la technologie, aux claviers respectivement 
associ&#233;s &#224; chacune des trois langues. Elles offrent une sorte d&#8217;&#233;valuation a posteriori des 
standards et normes en vigueur qu&#8217;elles sont susceptibles de conforter ou d&#8217;infl&#233;chir2. Mais  
</p>
<p>2  En incitant &#224; les amender pour un meilleur rendement. Car sous cet angle, la technologie ne semble pas 
conf&#233;rer les m&#234;mes avantages aux langues qu&#8217;elle prend en charge. Sur un autre plan, ces comptages et 
observations sugg&#232;rent que les syst&#232;mes d&#8217;&#233;criture qui persistent ou qui s&#8217;installent dans l&#8217;usage sont ceux 
dont le co&#251;t est proche de 1, tel que celui de l&#8217;anglais, du fran&#231;ais, ou de l&#8217;arabe non voyell&#233;. On peut 
remarquer que l&#8217;arabe voyell&#233; qui pr&#233;sente un co&#251;t de 1,46 le caract&#232;re est tr&#232;s peu pratiqu&#233;. M&#234;me si les 
raisons qui sous tendent ce constat sont sans doute de nature bien plus complexe, n&#8217;y a-t-il pas l&#224; un seuil au-
del&#224; duquel un syst&#232;me d&#8217;&#233;criture n&#8217;est plus pratiqu&#233; ? 
</p>
<p>350</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique vs analyse interactive : un cercle vertueux 
</p>
<p>elles permettent aussi, en appr&#233;hendant les difficult&#233;s que pose la confection massive de 
corpus annot&#233;s sous un angle mat&#233;riel, d&#8217;introduire, aux c&#244;t&#233;s des m&#233;triques d&#8217;&#233;valuation des 
proc&#233;dures d&#8217;analyse automatique classiques,  une m&#233;trique pour l&#8217;&#233;valuation quantitative des 
processus d&#8217;analyse interactive, fond&#233;e sur le calcul des co&#251;ts qu&#8217;engendrent pr&#233;cis&#233;ment les 
n&#233;cessaires interventions manuelles. 
</p>
<p>4 Evaluation de l&#8217;annotation interactive 
Un syst&#232;me d&#8217;annotation automatique est performant &#224; 100% lorsque ses r&#233;sultats sont jug&#233;s 
totalement conformes &#224; une annotation manuelle. Ce crit&#232;re ne vaut &#233;videmment pas pour un 
syst&#232;me d&#8217;annotation interactif, puisque par d&#233;finition la conformit&#233; est ici atteinte &#224; la fin du 
processus. Un syst&#232;me d&#8217;annotation interactif est en fait d&#8217;autant plus performant que le 
nombre de manipulations impos&#233;es &#224; l&#8217;annotateur pour accomplir une t&#226;che donn&#233;e est petit. 
Lorsque les performances de sa composante automatique, ici, d&#8217;&#233;tiquetage, de lemmatisation, 
et de voyellation sont totales, cet objectif est &#233;videmment atteint puisque pour chaque 
occurrence de mot, les trois propositions &#8211; de lemmatisation, d&#8217;&#233;tiquetage, et de vocalisation 
&#8211; class&#233;es en t&#234;te de leurs listes respectives s&#8217;av&#232;reront syst&#233;matiquement correctes. Dans ces 
conditions les manipulations de l&#8217;annotateur se r&#233;duisent &#224; de simples validations qui ne lui 
co&#251;tent en nombre d&#8217;op&#233;rations qu&#8217;une seule action (frappe au clavier, clic de souris, 
pointage sur un &#233;cran tactile, etc.). C&#8217;est une situation id&#233;ale, mais que l&#8217;on ne parvient pas 
atteindre pour toutes les occurrences qui constituent un corpus, les performances des 
programmes d&#8217;analyse automatique &#233;tant, comme on le sait, en de&#231;&#224; du 100%. Pour ces 
occurrences, le co&#251;t de l&#8217;annotation est d&#8217;autant plus &#233;lev&#233; que les solutions propos&#233;es par la 
composante automatique se trouvent situ&#233;es loin dans les listes des voyellations, des 
&#233;tiquettes et des lemmes r&#233;siduels, c'est-&#224;-dire des solutions potentielles qui n&#8217;ont pu &#234;tre 
&#233;limin&#233;es. L&#8217;op&#233;ration d&#8217;annotation interactive la plus co&#251;teuse advient lorsque la r&#233;solution 
est en queue de liste, ou plus grave, lorsqu&#8217;elle ne s&#8217;y trouve pas du tout.
</p>
<p>Les performances de l&#8217;analyse interactive d&#233;pendent des performances de l&#8217;analyse 
automatique, mais tandis que dans un cas, elles sont &#233;valu&#233;es au nombre ou &#224; la proportion 
des occurrences qui sont correctement annot&#233;es ou non, elles sont &#233;valu&#233;es dans l&#8217;autre cas au 
nombre ou &#224; la proportion des interventions manuelles effectives n&#233;cessaires pour valider le 
correct, et corriger l&#8217;incorrect. En cela, et quoique corr&#233;l&#233;es aux extr&#234;mes, ces deux 
performances sont compl&#233;mentaires et ne renseignent pas de la m&#234;me fa&#231;on. L&#8217;&#233;valuation 
sous l&#8217;angle interactif jette en fait un autre regard sur les performances de la composante 
automatique, et peut conduire, ainsi que nous allons le montrer, jusqu&#8217;&#224; sugg&#233;rer d&#8217;en 
modifier la conception ou le comportement interne, aboutissant ainsi &#224; des sp&#233;cifications 
d&#8217;analyseurs automatiques diff&#233;rents, selon qu&#8217;ils sont destin&#233;s &#224; un usage interactif, ou &#224; un 
usage automatique pur, du moins si leurs performances restent en de&#231;&#224; d&#8217;un certain seuil. 
</p>
<p>Il y a cercle vertueux parce que les actions manuelles, d&#232;s lors qu&#8217;elles sont prises en compte, 
modifient &#224; leur tour de fa&#231;on dynamique les performances de l&#8217;analyse automatique. En 
effet, en &#233;liminant les ambigu&#239;t&#233;s l&#224; o&#249; elles r&#233;sistent, ces actions am&#233;liorent les performances 
locales des r&#232;gles automatiquement mises en jeu, et donc les performances globales de 
l&#8217;analyse automatique, laquelle, offrant de meilleurs r&#233;sultats, diminue d&#8217;autant la charge 
manuelle, am&#233;liorant ainsi les performances de la partie interactive, et ainsi de suite. 
</p>
<p>Mais l&#8217;enseignement qu&#8217;apportent l&#8217;&#233;valuation interactive et son impact sur la d&#233;finition de 
l&#8217;analyse automatique va plus loin encore. L&#8217;on s&#8217;aper&#231;oit que l&#8217;ordre d&#8217;application des r&#232;gles 
qui conduit aux meilleures performances automatiques n&#8217;est pas forc&#233;ment celui qui conduit 
</p>
<p>351</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi DEBILI, Zied BEN TAHAR, Emna SOUISSI
</p>
<p>aux meilleures performances interactives, sauf cas extr&#234;me d&#8217;une annotation automatique 
totalement r&#233;ussie o&#249; les deux performances se rejoignent alors. Ce point nous para&#238;t 
important. Nous ne pointons pas le fait que, ayant b&#233;n&#233;fici&#233; d&#8217;une contribution humaine 
externe, alors l&#8217;analyse automatique produit de meilleurs r&#233;sultats. Cela est entendu. Nous 
disons que les meilleures performances interactives d&#8217;un syst&#232;me ne sont paradoxalement pas 
toujours corr&#233;l&#233;es &#224; ses meilleures performances automatiques. Autrement dit, que le 
comportement linguistique automatique le plus performant n&#8217;est pas toujours celui qui assure, 
d&#232;s lors qu&#8217;il y a interf&#233;rence manuelle, le meilleur rendement interactif. Nous d&#233;crivons dans 
le paragraphe suivant le protocole exp&#233;rimental et les r&#233;sultats qui ont conduit &#224; ce constat 
contre intuitif. 
</p>
<p>5 Annotation interactive s&#233;quentielle 
L&#8217;ergonomie interactive qui vient en premier &#224; l&#8217;esprit est s&#233;quentielle. Elle est li&#233;e &#224; la 
nature des ambigu&#239;t&#233;s que nous voulons lever, ici les ambigu&#239;t&#233;s que pose la voyellation, la 
lemmatisation, et l&#8217;&#233;tiquetage de l&#8217;arabe, et au fait que pour lever ces ambigu&#239;t&#233;s, le recours 
au contexte s&#8217;impose. De sorte que c&#8217;est tout naturellement que l&#8217;on s&#8217;oriente vers une lecture 
s&#233;quentielle lorsque l&#8217;on souhaite &#233;tablir ou v&#233;rifier les annotations d&#8217;un texte. 
</p>
<p>Ayant &#224; accomplir pour chaque occurrence trois choix, &#8211; de sa voyellation, de son lemme, de 
son &#233;tiquette, &#8211; et dans la mesure o&#249; ces choix peuvent interf&#233;rer, c'est-&#224;-dire influer de fa&#231;on 
dynamique sur l&#8217;ordre selon lequel sont pr&#233;sent&#233;es les solutions des annotations non encore 
fix&#233;es, plusieurs (6 au total) s&#233;quences ou protocoles d&#8217;intervention peuvent &#234;tre propos&#233;s &#224; 
l&#8217;annotateur, selon que l&#8217;on commence par l&#8217;un ou l&#8217;autre de ces trois choix, et que l&#8217;on 
poursuive ainsi. L&#8217;arborescence Figure 1 donne les six cas possibles. A ces six s&#233;quences ou 
protocoles, il convient d&#8217;ajouter un septi&#232;me, celui o&#249; les choix resteraient ind&#233;pendants : pas 
d&#8217;interf&#233;rence ; on ne retient pas que la r&#233;solution de l&#8217;une des trois valeurs puisse r&#233;duire 
l&#8217;ambigu&#239;t&#233; qui porte sur les deux autres, puis, en cascade, que la r&#233;solution d&#8217;une deuxi&#232;me 
puisse r&#233;duire l&#8217;ambigu&#239;t&#233; de la derni&#232;re. 
</p>
<p>Deux protocoles sont a priori privil&#233;gi&#233;s : Etiquetage, puis Lemmatisation, puis Voyellation 
(s&#233;quence ELV, &#224; gauche sur la figure 1), et Voyellation, suivie de Lemmatisation, puis 
Etiquetage (s&#233;quence VLE, &#224; droite). Le premier donne l&#8217;ordre selon lequel op&#232;rent les 
traitements automatiques, la machine donc. Le second donne l&#8217;ordre selon lequel op&#232;rent 
pr&#233;f&#233;rentiellement les annotateurs, c'est-&#224;-dire selon lequel les traitements manuels sont 
effectu&#233;s. Ces deux protocoles sont privil&#233;gi&#233;s en vertu de consid&#233;rations qui sont li&#233;es &#224; 
leurs performances attendues d&#8217;une fa&#231;on g&#233;n&#233;rale, et suppos&#233;es &#234;tre les meilleures par 
opposition aux performances des autres protocoles.  
</p>
<p>Dans le premier cas, les meilleures performances d&#8217;analyse automatique attendues semblent 
pouvoir provenir d&#8217;une succession Etiquetage, Lemmatisation, puis Voyellation, &#224; l&#8217;image par 
exemple de ce qui est commun&#233;ment retenu pour le fran&#231;ais. En effet, dans une approche 
modulaire, les r&#232;gles utiles pour lever ces diff&#233;rents types d&#8217;ambigu&#239;t&#233;s paraissent pouvoir 
&#234;tre plus facilement apprises pour le niveau grammatical, que pour les deux autres niveaux. 
Ce sont donc en premier les ambigu&#239;t&#233;s grammaticales qui sont r&#233;duites. Les ambigu&#239;t&#233;s 
lemmatiques et vocaliques, pour lesquelles il semble plus difficile ou plus long de rassembler 
des r&#232;gles qui leurs soient propres, peuvent n&#233;anmoins b&#233;n&#233;ficier de ces r&#233;ductions 
d&#8217;ambigu&#239;t&#233;s grammaticales : pr&#233;cis&#233;ment, en &#233;cartant les candidats lemmes et/ou 
voyellations exclusivement li&#233;s aux &#233;tiquettes &#233;limin&#233;es. Par exemple, l&#8217;&#233;limination durant la 
phase d&#8217;&#233;tiquetage de l&#8217;&#233;tiquette nom permet de ne plus retenir au compte du mot &#233;l&#232;ve que le 
</p>
<p>352</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique vs analyse interactive : un cercle vertueux 
</p>
<p>lemme &#233;lever. Le lemme &#233;l&#232;ve n&#8217;&#233;tant que nom, il est &#233;limin&#233; en m&#234;me temps ou suite &#224; 
l&#8217;&#233;limination de l&#8217;&#233;tiquette nom.
</p>
<p>Dans le second cas, ce sont les performances globales du processus interactif machine-
annotateur que l&#8217;on essaie de maximiser. Le facteur humain est ici pr&#233;pond&#233;rant. Quel est le 
protocole ergonomique qui assure la meilleure efficacit&#233;, le meilleur rendement ? Il semble 
raisonnable de supposer que les annotateurs auront plus de facilit&#233;s &#224; d&#8217;abord Voyeller, 
Lemmatiser, puis Etiqueter (parcours VLE, &#224; droite), ou &#224; Lemmatiser, puis Voyeller, puis 
Etiqueter, (parcours LVE, au centre), que de commencer par Etiqueter (parcours de gauche). 
</p>
<p>Ces parcours interactifs induisent des comportements linguistiques machine diff&#233;rents. Du fait 
que les r&#232;gles interagissent entre elles, on ne sait pas a priori lequel de ces parcours ou 
comportements est le plus performant sous l&#8217;angle automatique, ni lequel est le plus 
performant sous l&#8217;angle interactif.  
</p>
<p>Pour mesurer ces performances, nous avons imagin&#233; et mis en &#339;uvre le protocole 
exp&#233;rimental simple suivant. Partant d&#8217;un corpus pr&#233;alablement annot&#233; de 145 mille hyper-
formes (toutes enti&#232;rement voyell&#233;es, lemmatis&#233;es et &#233;tiquet&#233;es), nous en avons extrait les 
fr&#233;quences relatives : f(&#233;tiquette | Mot Non Voyell&#233;) = Nbre(MNV, &#233;tiquette)/Nbre(MNV) ; 
f(lemme | mot non voyell&#233;) ; f(voyellation | mot non voyell&#233;) ; 
f(lemme | mot non voyell&#233;, &#233;tiquette) ; etc., voir l&#233;gende de la figure 1. 
</p>
<p>           MNV 
&#404;
</p>
<p>Etiquette Lemme Voyellation
A 76,76% 93,04% 84,18%
</p>
<p>Lemme  Voyellation Etiquette Voyellation Etiquette Lemme 
B 74,06% 75,96% 74,04% 80,99% 75,87% 73,78%
C 96,39% 98,91% 79,68% 87,18% 90,68% 96,28%
</p>
<p>Voyellation Lemme Voyellation Etiquette Lemme Etiquette
D 73,88% 73,87% 73,86% 73,77% 73,78% 73,77%
E 99,73% 97,19% 99,73% 91,48% 97,19% 91,48%
F 0,43 0,43 0,41 0,36 0,37 0,37
G 0,21 0,21 0,20 0,17 0,18 0,18
</p>
<p>Traitements
automatiques
</p>
<p>Traitements
interactifs
</p>
<p>Ligne A : Performances automatiques, Application des r&#232;gles f(E|MNV), f(L|MNV), f(V|MNV). 
Ligne B : Performances automatiques, Application des r&#232;gles f(L|MNV, E), f(V|MNV, E), f(E|MNV, L),  
</p>
<p>  f(V|MNV, L), f(E|MNV, V), f(L|MNV, V). 
Ligne C : Performances interactives, Application des r&#232;gles f(L|MNV, E), f(V|MNV, E), f(E|MNV, L),  
</p>
<p>  f(V|MNV, L), f(E|MNV, V), f(L|MNV, V). Ici, dans les conditions | MNV, y), y est correct. 
Ligne D : Performances automatiques, Application des r&#232;gles f(V|MNV, E, L), f(L|MNV, E, V), 
                f(V|MNV, L, E), f(E|MNV, L, V), f(L|MNV, V, E), f(E|MNV, V, L). 
Ligne E : Performances interactives, Application des r&#232;gles f(V|MNV, E, L), f(L|MNV, E, V), f(V|MNV, L, E), 
                f(E|MNV, L, V), f(L|MNV, V, E), f(E|MNV, V, L). Ici, dans | MNV, y, z), y et z sont corrects. 
Ligne F : Co&#251;t ergonomique des interventions manuelles, annotation s&#233;quentielle} exprim&#233; en nombre moyen 
Ligne G : Co&#251;t ergonomique des interventions manuelles, annotation parall&#232;le   } de frappes ou clics par mot.
MNV : hyper-forme non voyell&#233;e ; E : &#233;tiquette grammaticale ; V : voyellation ; L : lemme 
</p>
<p>Figure 1 : Performances des analyses automatique et interactive li&#233;es aux six s&#233;quences 
possibles d&#8217;application des r&#232;gles et d&#8217;interventions manuelles 
</p>
<p>353</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi DEBILI, Zied BEN TAHAR, Emna SOUISSI
</p>
<p>Utilisant ces fr&#233;quences comme autant de r&#232;gles unaires que nous avons r&#233;appliqu&#233;es en 
cascade le long des six parcours, nous en avons calcul&#233; les performances, et de fa&#231;on 
r&#233;trospective les co&#251;ts qu&#8217;auraient engendr&#233;s les interventions manuelles n&#233;cessaires pour en 
corriger les &#233;carts. 
</p>
<p>La figure 1 liste ces r&#233;sultats. Les lignes A, B, et D donnent les performances de l&#8217;&#233;tiquetage, 
lemmatisation et voyellation automatiques mettant en &#339;uvre les s&#233;quences de r&#232;gles 
f(x|MNV), f(x|MNV, y), et f(x|MNV, y, z), avec, selon les parcours, x, y, z = E, L ou V. Les 
lignes C et E donnent les performances issues de l&#8217;application de ces m&#234;mes r&#232;gles, mais avec 
y et z manuellement corrig&#233;es. La ligne F donne les co&#251;ts moyens rapport&#233;s au mot, selon les 
parcours, des diverses interventions manuelles, interventions qui consistent &#224; simplement 
valider si les choix machine sont corrects (co&#251;t nul), et &#224; d&#233;signer au moyen de la souris les 
valeurs potentielles E, L, et V qui conviennent &#233;tant donn&#233;es l&#8217;occurrence MNV et son 
contexte, si celles-ci ne sont pas propos&#233;es en premi&#232;re position dans leurs listes respectives. 
Le co&#251;t partiel est nul si la valeur E, L, ou V class&#233;e premi&#232;re par le syst&#232;me est correcte. Il 
est sinon d&#8217;autant plus &#233;lev&#233; que la r&#233;solution est class&#233;e loin dans la liste des solutions 
potentielles non &#233;limin&#233;es. La formule retenue pour calculer le co&#251;t global d&#8217;une op&#233;ration 
d&#8217;annotation interactive est simple :  
Co&#251;t d&#8217;annotation s&#233;quentielle = &#520;i=1 &#224; nombre de mots du corpus &#520;x=E, L, ou V (rang de la r&#233;solution xi&#8211;1)
Nous constatons que les co&#251;ts d&#8217;annotation rapport&#233;s au mot sont tous diff&#233;rents. Mais surtout 
que co&#251;ts d&#8217;annotation interactive et performances d&#8217;analyse automatique ne sont pas 
corr&#233;l&#233;s, comme l&#8217;on aurait pu s&#8217;attendre. Le co&#251;t le plus bas (42 652 clics ou d&#233;placements 
de curseur, soit 0,36 clic ou frappe en moyenne par mot, s&#233;quence LVE) ne correspond pas au 
comportement automatique le plus performant (73,88% des mots tous correctement annot&#233;s, 
s&#233;quence ELV) qui, lui, r&#233;clame 50590 interventions manuelles pour en corriger les &#233;carts, 
soit 0,43 clic en moyenne par mot. Les s&#233;quences d&#8217;annotation qui donnent les co&#251;ts les plus 
bas s&#8217;av&#232;rent &#234;tre les s&#233;quences qui consistent &#224; commencer par la v&#233;rification de la 
lemmatisation ou voyellation, puis respectivement la lemmatisation ou voyellation, puis 
&#233;tiquetage, tandis que les s&#233;quences qui donnent les meilleures performances automatiques 
s&#8217;av&#232;rent &#234;tre celles qui commencent par l&#8217;&#233;tiquetage. Les premi&#232;res correspondent aux trois 
parcours dessin&#233;s &#224; droite sur la figure 1, les secondes, au trois parcours de gauche. Cette 
distribution spatiale qui partage la figure 1 en deux parties selon les niveaux de performances 
et de co&#251;ts (voir fig. 2), r&#233;v&#232;le qu&#8217;il ne faut pas privil&#233;gier un seul comportement 
automatique, le plus performant en l&#8217;occurrence. D&#8217;autres comportements moins performants 
peuvent se r&#233;v&#233;ler meilleurs d&#232;s lors qu&#8217;il y a interaction. Elle confirme aussi le bien fond&#233; 
des approches a priori pr&#233;conis&#233;es, selon qu&#8217;elles sont orient&#233;es vers l&#8217;autonomie, ou vers 
l&#8217;interactivit&#233;.
</p>
<p>6 Annotation interactive parall&#232;le 
Si les hapax sont rares (5 &#224; 12% selon les corpus dont nous disposons), et les proportions des 
mots qui apparaissent deux fois ou plus dans un corpus, importantes, ne pourrait-on factoriser 
les annotations, c'est-&#224;-dire voyeller, lemmatiser et &#233;tiqueter en m&#234;me temps toutes les 
occurrences d&#8217;un m&#234;me mot ? Car outre les gains de productivit&#233; attendus, ces conditions 
pourraient aussi assurer une meilleure reproductibilit&#233; dans la mesure o&#249;, op&#233;rant de fa&#231;on 
contrastive (toutes les occurrences en contexte d&#8217;un m&#234;me mot sont visibles en m&#234;me temps), 
l&#8217;annotateur pourrait en effet d&#233;cider de fa&#231;on plus homog&#232;ne. Ces consid&#233;rations nous ont 
amen&#233; &#224; dessiner les contours d&#8217;une ergonomie d&#8217;annotation parall&#232;le dont la figure 1, ligne 
G, donne, pour le m&#234;me corpus, les performances calcul&#233;es de fa&#231;on r&#233;trospective en se 
fondant sur les m&#234;mes conventions de co&#251;t. 
</p>
<p>354</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique vs analyse interactive : un cercle vertueux 
</p>
<p>La comparaison des lignes F et G r&#233;v&#232;le un gain de facteur 2 : l&#8217;annotation parall&#232;le co&#251;te 
approximativement deux fois moins cher que l&#8217;annotation s&#233;quentielle. Mais l&#8217;on constate 
surtout que les observations que nous avons pu faire plus haut restent vraies. Avec une acuit&#233; 
l&#233;g&#232;rement accrue, nous remarquons en effet que l&#8217;annotation parall&#232;le la moins co&#251;teuse 
n&#8217;est pas corr&#233;l&#233;e au traitement automatique le plus performant. Et que la partition droite 
gauche observ&#233;e plus haut, selon les niveaux de performance ou de co&#251;t, est confort&#233;e. 
Dans cette ergonomie, l&#8217;annotation interactive n&#8217;est plus appliqu&#233;e &#224; toutes les occurrences 
du corpus prises une &#224; une, mais aux seules entr&#233;es du lexique qui leur correspond.  Dans le 
cas pr&#233;sent, aux seules 24291 diff&#233;rentes hyper-formes non voyell&#233;es qui constituent le 
lexique du corpus, et non aux 117900 occurrences reconnues de ce corpus, m&#234;me si de fait, il 
y a bien prise en compte de 117900 contextes potentiellement tous diff&#233;rents. L&#8217;annotation 
retient pour les 24291 entr&#233;es non voyell&#233;es, 38108 descriptions morpho-grammaticales 
diff&#233;rentes, sur 334179 descriptions potentielles, c'est-&#224;-dire qu&#8217;elle donne lieu &#224; 38108 
hyper-formes d&#251;ment voyell&#233;es, lemmatis&#233;es et &#233;tiquet&#233;es diff&#233;rentes.  
</p>
<p>7 Conclusion
Ce graphe, qui reprend les r&#233;sultats lignes D et F 
de la figure 1, indique que, dans une plage de 
performances donn&#233;e, le meilleur comportement 
automatique n&#8217;est pas celui qui assure toujours, 
d&#232;s lors qu&#8217;il y a intervention manuelle, le 
meilleur comportement interactif. Dit autrement, 
et en soulignant le caract&#232;re local de nos 
observations, nous d&#233;couvrons en effet que le
comportement autonome le plus performant n&#8217;est 
pas toujours celui qui garantit, d&#232;s lors qu&#8217;il y a 
interaction, le comportement coop&#233;ratif le plus 
performant. C&#8217;est ce r&#233;sultat empirique qui ne 
</p>
<p>laisse de surprendre &#8211; la corr&#233;lation Co&#251;t-Performance attendue &#233;tait et reste en effet qu&#8217;&#224; 
performance automatique meilleure corresponde co&#251;t interactif moindre, et que les points 
dessinent la courbe de tendance en pointill&#233;e, et non celle observ&#233;e trait continu &#8211; qui est 
devenu, chemin faisant, pr&#233;pond&#233;rant, au-del&#224; de la conception et r&#233;alisation d&#8217;un syst&#232;me 
d&#8217;analyse morpho-grammaticale interactive de l&#8217;arabe et de sa mise en &#339;uvre pour la 
confection de corpus voyell&#233;s, &#233;tiquet&#233;s, et lemmatis&#233;s. Sur le plan m&#233;thodologique, il remet 
en cause les strat&#233;gies commun&#233;ment pr&#233;conis&#233;es pour la confection massive de donn&#233;es 
linguistiques annot&#233;es, o&#249; l&#8217;id&#233;e est de corriger les sorties d&#8217;analyse automatique au moyen 
d&#8217;&#233;diteurs d&#233;di&#233;s, en consid&#233;rant a priori que le rendement optimal est atteint d&#232;s lors que 
l&#8217;analyseur automatique qui est mis en &#339;uvre est le plus performant. Nous pressentons, sans 
l&#8217;avoir encore constat&#233;, que cet a priori n&#8217;est vrai qu&#8217;au-del&#224; d&#8217;un certain seuil de 
performance automatique, seuil qu&#8217;il conviendrait de d&#233;terminer. En de&#231;&#224; de ce seuil critique, 
nous assisterions &#224; des comportements &#171; erratiques &#187; o&#249; pr&#233;cis&#233;ment, ainsi que nous l&#8217;avons 
observ&#233;, la corr&#233;lation meilleure performance automatique alors meilleure  performance 
interactive n&#8217;est pas maintenue. Au-del&#224;, au contraire, la corr&#233;lation est ou serait r&#233;tablie. 
</p>
<p>Corr&#233;lation 
Co&#251;t interactif s&#233;quentiel / Performance automatique
</p>
<p>0,35
</p>
<p>0,36
</p>
<p>0,37
</p>
<p>0,38
</p>
<p>0,39
</p>
<p>0,4
</p>
<p>0,41
</p>
<p>0,42
</p>
<p>0,43
</p>
<p>0,44
</p>
<p>73,76 73,78 73,8 73,82 73,84 73,86 73,88 73,9
</p>
<p>Performance automatique
</p>
<p>Co
&#251;t
</p>
<p> in
te
</p>
<p>ra
ct
</p>
<p>if 
s&#233;
</p>
<p>qu
en
</p>
<p>tie
l
</p>
<p>VEL
VLE
</p>
<p>EVL
</p>
<p>LEV
</p>
<p>LVE
</p>
<p>ELV
</p>
<p>Figure 2. 
</p>
<p>Mais il nous semble que les cons&#233;quences de ce constat vont plus loin encore. S&#8217;il devait &#234;tre 
confirm&#233; par d&#8217;autres exp&#233;rimentations men&#233;es par nous ou par d&#8217;autres, sur d&#8217;autres langues 
et/ou d&#8217;autres types de r&#232;gles, alors nous serions fond&#233;s &#224; dire que nos objectifs devraient non 
plus se focaliser sur la seule dimension automatique, ainsi que nous disions au d&#233;but de notre 
introduction, mais devraient aussi, d&#8217;embl&#233;e, prendre en compte le d&#233;veloppement de la 
</p>
<p>355</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi DEBILI, Zied BEN TAHAR, Emna SOUISSI
</p>
<p>n&#233;cessaire dimension interactive et de ce que celle-ci induit dans le d&#233;veloppement et 
l&#8217;&#233;valuation de la dimension automatique. Car l&#8217;on s&#8217;aper&#231;oit qu&#8217;introduire parall&#232;lement une 
dimension interactive plus dynamique, loin de r&#233;duire la surface de la composante 
automatique ou de ce que l&#8217;on peut en exiger, conduit au contraire &#224; en multiplier les 
comportements linguistiques et &#224; en &#233;tendre les potentialit&#233;s, tout en en r&#233;v&#233;lant les 
insuffisances critiques. L&#8217;interactif ram&#232;ne ainsi &#224; l&#8217;automatique.  
Sous l&#8217;angle de l&#8217;&#233;valuation, l&#8217;interactif conduit, comme pour les applications qui mettent en 
&#339;uvre diff&#233;rents composants linguistiques, et o&#249; l&#8217;on distingue, (cf. par ex. Berthelin et al. 
2001), les performances intrins&#232;ques de ces composants d&#8217;une part, et les performances 
globales de ces m&#234;mes composants interagissant ensemble, &#224; une caract&#233;risation tierce de ces 
composants. Mais l&#224; s&#8217;arr&#234;te l&#8217;analogie. Les m&#233;triques restent en effet les m&#234;mes dans le 
premier cas. Qu&#8217;il s&#8217;agisse de performances locales et directes, ou globales et indirectes, l&#8217;on 
essaie de compter les &#233;carts, les erreurs, les silences. Alors qu&#8217;elles sont diff&#233;rentes lorsqu&#8217;il 
s&#8217;agit de mesurer les performances de la dimension interactive, ainsi que nous avons essay&#233; 
de le montrer. L&#8217;on rejoint ici l&#8217;une des multiples &#171; dimensions &#187; de l&#8217;&#233;valuation recens&#233;es 
par Chaudiron, en l&#8217;occurrence, la notion d&#8217;efficience vue, pour une t&#226;che donn&#233;e, &#171; comme la 
possibilit&#233; pour un utilisateur d&#8217;accomplir cette t&#226;che &#224; moindre co&#251;t en terme de charge de 
travail et d&#8217;effort cognitif &#187; (Chaudiron, 2001, p. 100). Corr&#233;l&#233;e &#224; l&#8217;&#233;valuation de l&#8217;analyse 
automatique, l&#8217;&#233;valuation de l&#8217;annotation interactive souligne au final qu&#8217;il est certes crucial 
de parfaire les performances de l&#8217;automatique, mais qu&#8217;il est aussi utile d&#8217;octroyer &#224; celui-ci 
non plus un, mais diff&#233;rents comportements pour &#234;tre &#224; m&#234;me de s&#8217;adapter de fa&#231;on optimale 
&#224; la variabilit&#233; des comportements des annotateurs, sous peine de ne pas &#234;tre retenu.
</p>
<p>Remerciements
Le pr&#233;sent travail a &#233;t&#233; initi&#233; dans le cadre du projet EurADic (Action Technolangue du 
Minist&#232;re de la recherche), et se poursuit dans le cadre du projet MUSCLE (6&#232;me PCRD).
A J.-B. Berthelin, pour la traduction du r&#233;sum&#233;, et sa disponibilit&#233; &#224; aborder ces th&#233;matiques. 
</p>
<p>R&#233;f&#233;rences
ABEILLE A., CLEMENT L. (2003). Annotation morpho-syntaxique. Les mots simples &#8211; Les mots 
compos&#233;s. Corpus Le Monde. Technical report, Paris 7.
ADDA, G., MARIANI, J., PAROUBEK, P., RAJMAN, M., &amp; LECOMTE, J. (1999). L&#8217;action GRACE 
d'&#233;valuation de l&#8217;assignation des parties du discours pour le fran&#231;ais. Langues, 2(1). 
BERTHELIN J.-B. (2001). Two levels of evaluation in a complex NL system. Actes 
d&#8217;ACL&#8217;2001, Toulouse.
CHAUDIRON S. (2001). L'&#201;valuation des syst&#232;mes de traitement de l'information textuelle : 
vers un changement de paradigme. Habilitation &#224; diriger des recherches, Paris X, Nov. 2001.
DEBILI F., ACHOUR H., SOUISSI E. (2002). La langue arabe et l&#8217;ordinateur : de l&#8217;&#233;tiquetage 
grammatical &#224; la voyellation automatique. Correspondances N&#176;71, IRMC, Tunis, 10-26.
DEBILI F., FLUHR C. (2006). Confection de ressources dictionnairiques et textuelles 
multilingues. Actes de TALN&#8217;2006, Louvain, Belgique, 10-13 Avril 2006, 910-917.
DEBILI F., SOUISSI E. (2005). Y a-t-il une taille optimale des r&#232;gles de succession intervenant 
dans l&#8217;&#233;tiquetage grammatical ? Actes de TALN&#8217;2005, Dourdan, Juin 2005, 363-372.
HABERT B. (2005). Instruments et ressources &#233;lectroniques pour le fran&#231;ais. Paris : Editions 
Ophrys.
TESNIERE L. (1969). El&#233;ments de syntaxe structurale. Paris : Editions Klincksieck.
VERONIS J. (1999). Guide d&#8217;&#233;tiquetage Multitag. Version 3.1, 6 novembre 1999. 
</p>
<p>356</p>

</div></div>
</body></html>