<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Rep&#233;rage de sens et d&#233;sambigu&#239;sation dans un contexte bilingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Rep&#233;rage de sens et d&#233;sambigu&#239;sation 
dans un contexte bilingue 
</p>
<p>Marianna APIDIANAKI
Lattice, Universit&#233; Paris 7, CNRS 
</p>
<p>ENS-1 rue Maurice Arnoux, F-92120, Montrouge 
Marianna.Apidianaki@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. Les besoins de d&#233;sambigu&#239;sation varient dans les diff&#233;rentes applications du 
Traitement Automatique des Langues (TAL). Dans cet article, nous proposons une m&#233;thode 
de d&#233;sambigu&#239;sation lexicale op&#233;ratoire dans un contexte bilingue et, par cons&#233;quent, 
ad&#233;quate pour la d&#233;sambigu&#239;sation au sein d&#8217;applications relatives &#224; la traduction. Il s&#8217;agit 
d&#8217;une m&#233;thode contextuelle, qui combine des informations de cooccurrence avec des 
informations traductionnelles venant d&#8217;un bitexte. L&#8217;objectif est l&#8217;&#233;tablissement de 
correspondances de traduction au niveau s&#233;mantique entre les mots de deux langues. Cette 
m&#233;thode &#233;tend les cons&#233;quences de l&#8217;hypoth&#232;se contextuelle du sens dans un contexte 
bilingue, tout en admettant l&#8217;existence d&#8217;une relation de similarit&#233; s&#233;mantique entre les mots 
de deux langues en relation de traduction. La mod&#233;lisation de ces correspondances de 
granularit&#233; fine permet la d&#233;sambigu&#239;sation lexicale de nouvelles occurrences des mots 
polys&#233;miques de la langue source ainsi que la pr&#233;diction de la traduction la plus ad&#233;quate 
pour ces occurrences.
</p>
<p>Abstract. Word Sense Disambiguation (WSD) needs vary greatly in different Natural 
Language Processing (NLP) applications. In this article, we propose a WSD method which 
operates in a bilingual context and is, thus, adequate for disambiguation in applications 
relative to translation. It is a contextual method which combines cooccurrence information 
with translation information found in a bitext. The goal is the establishment of translation 
correspondences at the sense level between the lexical items of two languages. This method 
extends the consequences of the contextual hypothesis in a bilingual framework assuming, at 
the same time, the existence of a semantic similarity relation between words of two languages 
being in a translation relation. The modelling of fine-grained correspondences allows for the 
disambiguation of new occurrences of the polysemous source language lexical items as well 
as for the prediction of the most adequate translation for those occurrences.  
</p>
<p>Mots cl&#233;s : d&#233;sambigu&#239;sation contextuelle, similarit&#233; s&#233;mantique, substituabilit&#233;, 
traduction.
</p>
<p>Keywords: contextual disambiguation, semantic similarity, substitutability, translation. 
</p>
<p>1. D&#233;sambigu&#239;sation lexicale pour la traduction  
</p>
<p>La d&#233;finition de la nature des sens, leur &#233;num&#233;ration et leur description constituent des 
questions centrales dans la probl&#233;matique de la d&#233;sambigu&#239;sation lexicale, auxquelles une 
</p>
<p>207</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marianna APIDIANAKI
</p>
<p>r&#233;ponse unanime est loin d&#8217;&#234;tre trouv&#233;e. Les besoins concernant le degr&#233; de d&#233;sambigu&#239;sation 
ainsi que le type et le niveau des distinctions s&#233;mantiques varient dans le cadre de diff&#233;rentes 
applications du Traitement Automatique des Langues (TAL). Ainsi, les informations trouv&#233;es 
dans des ressources s&#233;mantiques pr&#233;d&#233;finies s&#8217;av&#232;rent souvent peu conformes aux besoins des 
applications particuli&#232;res, et les m&#233;thodes de d&#233;sambigu&#239;sation sont parfois critiqu&#233;es pour ne 
pas &#234;tre li&#233;es &#224; une application r&#233;elle.
</p>
<p>Dans cet article, nous allons pr&#233;senter une m&#233;thode originale de d&#233;sambigu&#239;sation lexicale qui 
op&#232;re dans un contexte bilingue et dont les r&#233;sultats sont, par cons&#233;quent, utilisables dans des 
applications relatives &#224; la traduction. Il s&#8217;agit d&#8217;une m&#233;thode de cooccurrences qui peut op&#233;rer 
sur les deux c&#244;t&#233;s d&#8217;un corpus parall&#232;le (bitexte) : les contextes de la langue source (LS) et les 
contextes de la langue cible (LC). La combinaison d&#8217;informations contextuelles et 
traductionnelles permet le rep&#233;rage de distinctions s&#233;mantiques au sein des mots 
polys&#233;miques et l&#8217;&#233;tablissement, entre les mots des deux langues, de correspondances au 
niveau s&#233;mantique exploitables dans des syst&#232;mes de traduction automatique ou assist&#233;e par 
ordinateur.
</p>
<p>2.  Principes de la m&#233;thode et hypoth&#232;ses sous-jacentes 
Les hypoth&#232;ses th&#233;oriques sous-jacentes &#224; cette m&#233;thode de d&#233;sambigu&#239;sation lexicale sont les 
suivantes :
</p>
<p>1. l&#8217;hypoth&#232;se contextuelle du sens (Firth, 1957 ; Harris, 1985), d&#8217;apr&#232;s laquelle le sens 
des mots correspond &#224; leurs usages dans les textes ;  
</p>
<p>2. l&#8217;hypoth&#232;se de l&#8217;existence d&#8217;une relation de similarit&#233; s&#233;mantique entre les mots de 
deux langues entretenant une relation de traduction dans des textes r&#233;els. 
</p>
<p>D&#8217;apr&#232;s la premi&#232;re hypoth&#232;se, l&#8217;analyse du contexte lexical (co-texte) entourant un mot dans 
des textes peut &#233;clairer sa s&#233;mantique. Le contexte lexical a &#233;t&#233; exploit&#233; pour la 
d&#233;sambigu&#239;sation aussi bien dans des m&#233;thodes qui proc&#232;dent &#224; la s&#233;lection du bon sens des 
mots &#224; partir d&#8217;un dictionnaire dans un cadre monolingue (Lesk, 1986) et bilingue (Brun et
al., 2001 ; Dufour, 1997), que dans des m&#233;thodes de d&#233;sambigu&#239;sation n&#8217;utilisant pas de 
ressources lexicales pr&#233;alables. De telles m&#233;thodes, propos&#233;es dans un cadre monolingue, sont 
celles de Sch&#252;tze (1998), de V&#233;ronis (2003) et de Pantel et Lin (2002) ; les deux premi&#232;res 
exploitent les informations de cooccurrence des mots, tandis que la troisi&#232;me met l&#8217;accent sur 
le contexte syntaxique. Dans un cadre de traduction, le contexte lexical des mots est explor&#233; 
dans les m&#233;thodes de d&#233;sambigu&#239;sation propos&#233;es par Brown et al. (1991)1, Kaji et al.
(2003)2 et Specia et al. (2006)3, tandis que celle propos&#233;e par Dagan et Itai (1991) exploite le 
contexte syntaxique de la LC pour choisir le bon &#233;quivalent de traduction.
</p>
<p>La deuxi&#232;me hypoth&#232;se, cit&#233;e plus haut, postule que, dans le cas de correspondances au 
niveau lexical au sein d&#8217;un corpus parall&#232;le, le sens v&#233;hicul&#233; par un &#233;quivalent de traduction 
est suppos&#233; similaire &#224; celui du mot source qu&#8217;il traduit. Par cons&#233;quent, les &#233;quivalents de 
traduction possibles des mots polys&#233;miques de la LS sont cens&#233;s traduire les diff&#233;rents sens 
</p>
<p>1 La m&#233;thode utilise des questions binaires pour choisir entre deux sens d&#8217;un mot.  
2 La m&#233;thode exploite des corpus comparables et utilise des informations sur l&#8217;alignement translinguistique de 
paires de mots li&#233;s. Les sens sont d&#233;crits par un ou plusieurs &#233;quivalents, dont le regroupement se base sur la 
similarit&#233; distributionnelle dans les deux langues. Cette m&#233;thode ne prend pas en compte les ambigu&#239;t&#233;s 
parall&#232;les entre les mots des deux langues, et elle pr&#233;suppose que chaque &#233;quivalent traduit uniquement un sens 
du mot polys&#233;mique.  
3 La m&#233;thode propos&#233;e par Specia et al. prend en compte des informations de cooccurrence lexicale dans la LC 
acquises &#224; l&#8217;aide de requ&#234;tes effectu&#233;es sur le Web concernant des fragments de texte de la LC.  
</p>
<p>208</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de sens et d&#233;sambigu&#239;sation dans un contexte bilingue 
</p>
<p>de ces mots dans la LC, sens refl&#233;t&#233;s aussi dans le contexte lexical de la LS. La nouveaut&#233; de 
notre approche consiste justement au rep&#233;rage automatique des sens des mots polys&#233;miques 
par projection des informations de cooccurrence d&#8217;un c&#244;t&#233; du bitexte &#224; l&#8217;autre, sans recours &#224; 
une ressource lexicale pr&#233;alable. L&#8217;analyse s&#233;mantique qui en r&#233;sulte concerne tant les mots 
de la LS que les &#233;quivalents, et les r&#233;sultats sont directement exploitables pour la 
d&#233;sambigu&#239;sation et la s&#233;lection lexicale dans la traduction.
</p>
<p>La correspondance s&#233;mantique entre deux unit&#233;s lexicales en relation de traduction peut &#234;tre 
mise en &#233;vidence et servir &#224; la mod&#233;lisation de correspondances s&#233;mantiques au sein d&#8217;un 
syst&#232;me automatique. La correspondance &#224; laquelle nous faisons face avant la 
d&#233;sambigu&#239;sation d&#8217;un mot polys&#233;mique de la LS se situe au niveau lexical, o&#249; le mot en 
question correspond &#224; plusieurs &#233;quivalents dans la LC. Le but est de raffiner cette relation et 
de repr&#233;senter les liens entre les mots des deux langues &#224; un niveau d&#8217;analyse plus &#233;lev&#233;. Sur 
la base des hypoth&#232;ses pr&#233;cit&#233;es, nous acceptons que les informations venant du co-texte des 
occurrences de l&#8217;unit&#233; source qui sont traduites par un &#233;quivalent pr&#233;cis dans le corpus 
&#233;clairent tant le(s) sens v&#233;hicul&#233;(s) par ces occurrences que celui(ceux) de l&#8217;&#233;quivalent de 
traduction. Le co-texte du mot source par rapport &#224; un &#233;quivalent pr&#233;cis correspond aux mots 
de contenu (noms, adjectifs et verbes) qui cooccurrent avec le mot dans les segments de 
traduction o&#249; il est traduit par cet &#233;quivalent4.
</p>
<p>Dans une m&#233;thode contextuelle monolingue de d&#233;sambigu&#239;sation, la comparaison des 
contextes (lexicaux ou grammaticaux) des occurrences du mot polys&#233;mique permet leur 
clusterisation en fonction de leur similarit&#233; et les clusters r&#233;sultants sont cens&#233;s illustrer les 
diff&#233;rents sens du mot. Ici, au lieu de comparer entre eux et de clusteriser les contextes dans 
lesquels un mot polys&#233;mique appara&#238;t, nous allons comparer entre eux et clusteriser des 
ensembles de contextes correspondant &#224; chacun de ses &#233;quivalents. Dans le paragraphe 
suivant, nous allons d&#233;crire comment les ensembles en question sont construits. 
</p>
<p>3.  Pr&#233;traitement du corpus 
Le corpus utilis&#233; dans ce travail pour l&#8217;apprentissage est un bitexte anglais-grec de 4 000 000 
mots (Gavrilidou et al., 2004), lemmatis&#233;, morphosyntaxiquement &#233;tiquet&#233; et align&#233; au niveau 
des phrases et au niveau des mots (Simard, Langlais, 2003). La source principale des textes 
est le Journal de l&#8217;Union Europ&#233;enne (domaines : droit [42 % des textes du corpus], 
sant&#233; [24 %], &#233;ducation [21 %]), mais il y a aussi des textes venant de l&#8217;Office National 
Hell&#233;nique du Tourisme (11 %), ainsi qu&#8217;un petit nombre de textes scientifiques sur 
l&#8217;environnement (2 %). Pour chaque mot polys&#233;mique &#233;tudi&#233;, un sous-corpus a &#233;t&#233; cr&#233;&#233;, qui 
contient les segments de traduction dans lesquels le mot source occurre5. Le choix des 
segments de traduction en tant que contexte est dict&#233; par notre objectif d&#8217;exploration de 
l&#8217;influence du co-texte proche des unit&#233;s source sur la d&#233;sambigu&#239;sation et le transfert lexical. 
Les segments constituant le sous-corpus d&#8217;un mot polys&#233;mique ont &#233;t&#233; regroup&#233;s en fonction 
de ses &#233;quivalents de traduction. Ainsi des ensembles de phrases correspondant &#224; chacun des 
&#233;quivalents sont cr&#233;&#233;s dans les deux c&#244;t&#233;s du bitexte, comme cela est d&#233;crit dans la figure 1. 
</p>
<p>Cette figure illustre le sous-corpus d&#8217;un mot source m, qui est traduit dans le corpus par trois 
&#233;quivalents diff&#233;rents : a, b et c. Dans la partie gauche de la figure, nous avons les phrases de 
la LS et, &#224; droite, leurs traductions dans la LC, qui se trouvent dans les m&#234;mes segments de 
</p>
<p>4 Tous les calculs op&#232;rent sur les lemmes (types) auxquels les mots des contextes (tokens) ont &#233;t&#233; ramen&#233;s.  
5 Un segment peut contenir de 0 &#224; 2 phrases par langue. Par exemple, un alignement 2:1 met en correspondance 
2 phrases du texte de la LS avec 1 phrase du texte de la LC, &#224; l&#8217;int&#233;rieur d&#8217;un segment.  
</p>
<p>209</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marianna APIDIANAKI
</p>
<p>traduction, comme cela a &#233;t&#233; d&#233;termin&#233; par le processus d&#8217;alignement des phrases.
LCLS
</p>
<p>segments LS b
</p>
<p>segments LS a
</p>
<p>segments LS c &#8230; c &#8230;
</p>
<p>segments LC b
</p>
<p>segments LC a
</p>
<p>segments LC c
</p>
<p>&#8230; b &#8230;
</p>
<p>&#8230; a &#8230;
</p>
<p>&#8230; a &#8230;
</p>
<p>&#8230; a &#8230;
</p>
<p>&#8230; b &#8230;&#8230; m &#8230;
</p>
<p>&#8230; m &#8230;
</p>
<p>&#8230; m &#8230;
</p>
<p>&#8230; m &#8230;
</p>
<p>&#8230; m &#8230;
</p>
<p>&#8230; m &#8230;
</p>
<p>Figure 1 : Regroupement des segments de traduction en fonction des &#233;quivalents 
</p>
<p>Les segments sont regroup&#233;s en fonction des &#233;quivalents. Ainsi, nous avons un ensemble de 
phrases dans la LS correspondant aux occurrences de m traduites par a et un ensemble de 
phrases dans la LC correspondant &#224; ces traductions et contenant, bien &#233;videmment, le mot a.
Nous proc&#233;dons de la m&#234;me mani&#232;re pour les autres &#233;quivalents (b et c) en constituant les 
groupes de phrases respectifs dans les deux langues6. Ces ensembles de segments constituent 
l&#8217;entr&#233;e de la m&#233;thode de similarit&#233; s&#233;mantique qui sera pr&#233;sent&#233;e par la suite.  
</p>
<p>4.  M&#233;thode d&#8217;estimation de similarit&#233; s&#233;mantique 
</p>
<p>4.1  Description et pr&#233;suppos&#233;s 
Le calcul de similarit&#233; s&#233;mantique est appliqu&#233; sur les ensembles de segments correspondant 
aux &#233;quivalents de traduction d&#8217;un mot polys&#233;mique. Il peut porter sur les contextes du mot 
source aussi bien que sur les contextes des &#233;quivalents. Sur la base de l&#8217;hypoth&#232;se 
contextuelle du sens, un grand degr&#233; de similarit&#233; des contextes de la LS indique 
l&#8217;homog&#233;n&#233;it&#233; s&#233;mantique du mot source, tandis que leur dissimilarit&#233; constitue un indice de 
l&#8217;existence de distinctions s&#233;mantiques au sein du mot en question. D&#8217;apr&#232;s la deuxi&#232;me 
hypoth&#232;se du d&#233;part, qui concerne l&#8217;existence d&#8217;une correspondance d&#8217;ordre s&#233;mantique entre 
les mots de deux langues entretenant une relation de traduction, la similarit&#233; plus ou moins 
grande des contextes de la LS correspondant &#224; des &#233;quivalents diff&#233;rents indique le degr&#233; de 
similarit&#233; s&#233;mantique des &#233;quivalents en question. Ainsi, les r&#233;sultats du calcul de similarit&#233; 
au sein de la LS permettent la clusterisation (ou la distinction) des &#233;quivalents en fonction de 
leur similarit&#233; (ou dissimilarit&#233;) s&#233;mantique.  
Les &#233;quivalents clusteris&#233;s sur la base de leur similarit&#233; s&#233;mantique sont cens&#233;s traduire le 
m&#234;me sens du mot polys&#233;mique7. Dans une approche contextuelle de la similarit&#233; 
s&#233;mantique, les mots similaires sont consid&#233;r&#233;s comme substituables au sein des contextes qui 
induisent leur relation (Miller et Charles, 1991). Ainsi, il est possible d&#8217;&#233;mettre l&#8217;hypoth&#232;se 
que lorsque le calcul porte sur les contextes de la LS, les &#233;quivalents clusteris&#233;s sont 
substituables en tant que traductions pour les occurrences du mot source trouv&#233;es dans les 
contextes r&#233;v&#233;lant leur similarit&#233;.  
La projection des r&#233;sultats de la clusterisation sur le mot source permet donc le rep&#233;rage des 
sens v&#233;hicul&#233;s par le mot. Ainsi la notion de similarit&#233; s&#233;mantique bas&#233;e sur la similarit&#233; 
contextuelle, et hautement utilis&#233;e dans le cadre de la d&#233;sambigu&#239;sation monolingue, est 
</p>
<p>6 Dans la figure, nous d&#233;crivons ces ensembles de phrases comme &#171; segments LS &#233;quivalent &#187; et &#171; segments 
LC &#233;quivalent &#187;. 
7 En revanche, la distinction des &#233;quivalents signale leur dissimilarit&#233; s&#233;mantique, c&#8217;est-&#224;-dire qu&#8217;ils traduisent 
des sens diff&#233;rents du mot source. 
</p>
<p>210</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de sens et d&#233;sambigu&#239;sation dans un contexte bilingue 
</p>
<p>reprise ici afin d&#8217;&#233;mettre des jugements sur la similarit&#233; des &#233;quivalents de traduction qui 
peuvent, par la suite, &#234;tre projet&#233;s sur les unit&#233;s polys&#233;miques source. Un avantage de 
l&#8217;utilisation de cette m&#233;thode par rapport &#224; l&#8217;application d&#8217;une m&#233;thode monolingue de 
d&#233;sambigu&#239;sation (Apidianaki, 2006) est que les distinctions propos&#233;es sont beaucoup plus 
pertinentes pour la traduction8.
</p>
<p>4.2  La mesure de similarit&#233; s&#233;mantique 
La mesure utilis&#233;e pour estimer la similarit&#233; s&#233;mantique entre les &#233;quivalents de traduction est 
une variation de la mesure de Jaccard pond&#233;r&#233;e (JP), propos&#233;e par Grefenstette pour la 
cr&#233;ation de thesaurus s&#233;mantiques dans un contexte monolingue (1994 : 48-50)9. Dans notre 
travail, les informations utilis&#233;es pour le calcul concernent la cooccurrence des mots &#224; 
l&#8217;int&#233;rieur des segments de traduction. Le contexte de la LS par rapport &#224; un &#233;quivalent est 
constitu&#233; par les mots de contenu cooccurrant avec le mot source dans les segments o&#249; il est 
traduit par cet &#233;quivalent pr&#233;cis. D&#8217;autre part, les traits sur lequel porte le calcul dans la LC 
sont les mots de contenu du co-texte de l&#8217;&#233;quivalent dans les traductions. Pour chaque trait 
nous calculons son poids global (global weight : gw) : 
</p>
<p>&#166;&#16; 
i
</p>
<p>ijij
j nrels
</p>
<p>pp
traitgw
</p>
<p>)log(
1)(        o&#249;
</p>
<p>i
</p>
<p>ij
ij &#233;quivlpourtraitsdetotalnombre
</p>
<p>&#233;quivlavectraitduabsoluefr&#233;quence
p
</p>
<p>'
'
</p>
<p> 
</p>
<p>           et jtraitlepourcorpusduextraitesrelationsdetotalnombrelenrels  
son poids local (local weight : lw) : )'log(),( ijji &#233;quivlavectraitdufr&#233;quencetrait&#233;quivlw  
</p>
<p>et son poids total (whole weight : W) : lwgwW &#13; 
Les &#233;l&#233;ments du contexte qui nous servent comme traits sont donc pond&#233;r&#233;s en fonction de 
leur dispersion dans les textes (gw) et de leur fr&#233;quence d&#8217;occurrence avec chaque &#233;quivalent 
pr&#233;cis (lw). Le poids global d&#8217;un trait est calcul&#233; en prenant en compte la somme de la 
probabilit&#233; d&#8217;occurrence du trait avec chacun des &#233;quivalents (pij), ainsi que le nombre total 
d&#8217;&#233;quivalents avec lesquels ce trait occurre (nrels). Le poids local est calcul&#233; sur la base de la 
fr&#233;quence d&#8217;apparition du trait avec un &#233;quivalent pr&#233;cis. Ainsi le coefficient pond&#233;r&#233; nous 
permet d&#8217;attribuer une importance aux traits, qui est proportionnelle &#224; leur pertinence pour 
l&#8217;estimation de la similarit&#233; entre les &#233;quivalents. Le Jaccard entre deux &#233;quivalents m et n est
calcul&#233; par la formule suivante :  
</p>
<p>&#166;
&#166; 
</p>
<p>)),(),(max(
)),(),(min(
</p>
<p>),(
jnjmj
</p>
<p>jnjmj
nm trait&#233;quivWtrait&#233;quivW
</p>
<p>trait&#233;quivWtrait&#233;quivW
&#233;quiv&#233;quivJP
</p>
<p>4.3  Analyse des r&#233;sultats 
Le processus a &#233;t&#233; appliqu&#233; sur dix mots polys&#233;miques anglais10. Nous allons pr&#233;senter ici un 
exemple illustrant le fonctionnement de la m&#233;thode et les r&#233;sultats que nous pouvons obtenir. 
Cet exemple concerne le mot movement qui a neuf &#233;quivalents de traduction dans le corpus11:
&#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; (251), &#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536; (38), &#539;&#531;&#542;&#536;&#305;&#536; (28), &#541;&#304;&#306;&#302;&#539;&#531;&#542;&#536;&#305;&#536; (19), &#539;&#531;&#542;&#536;&#541;&#302; (11), &#539;&#538;&#542;&#536;&#306;&#538;&#539;&#553;&#306;&#536;&#306;&#302;
</p>
<p>8 Les sens propos&#233;s par l&#8217;application d&#8217;une m&#233;thode de d&#233;sambigu&#239;sation qui ne prend pas en compte les 
&#233;quivalents d&#232;s le d&#233;but sont tr&#232;s nombreux, et il est difficile de cr&#233;er des correspondances de traduction 
satisfaisantes au niveau s&#233;mantique. L&#8217;utilisation des &#233;quivalents comme indices pour le fusionnement des sens 
risque de nous faire entrer dans un cercle vicieux &#224; cause de la polys&#233;mie propre aux &#233;quivalents m&#234;mes.
9 La similarit&#233; entre les mots est estim&#233;e sur la base de leurs contextes syntaxiques partag&#233;s. 
10 Plant, movement, occupation, communication, treatment, passage, power, competence, facility, paper.
11 Entre parenth&#232;ses, nous donnons la fr&#233;quence avec laquelle l&#8217;&#233;quivalent traduit le mot source dans le corpus. 
</p>
<p>211</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marianna APIDIANAKI
</p>
<p>(6), &#652;&#545;&#544;&#305;&#652;&#528;&#537;&#304;&#538;&#302; (1), &#306;&#528;&#305;&#536; (1), &#533;&#530;&#541;&#302; (1). Les r&#233;sultats du calcul de similarit&#233; entre ces 
&#233;quivalents sont d&#233;crits dans le tableau 112.
</p>
<p>Paires d&#8217;&#233;quivalents Contextes anglais Contextes grecs 
&#541;&#304;&#306;&#302;&#539;&#531;&#542;&#536;&#305;&#536; &#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536; 0,11 0,125
&#539;&#531;&#542;&#536;&#305;&#536; &#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536; 0,099 0,13
&#541;&#304;&#306;&#302;&#539;&#531;&#542;&#536;&#305;&#536; &#539;&#531;&#542;&#536;&#305;&#536; 0,087 0,141
&#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; &#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536; 0,078 0,091
&#539;&#531;&#542;&#536;&#305;&#536; &#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; 0,063 0,077
&#539;&#531;&#542;&#536;&#305;&#536; &#539;&#531;&#542;&#536;&#541;&#302; 0,046 0,052
</p>
<p>Moyenne 0,043 0,062
</p>
<p>Tableau 1 : Relations de similarit&#233; entre les &#233;quivalents de movement 
</p>
<p>Les &#233;l&#233;ments des paires qui apparaissent au d&#233;but de la liste sont cens&#233;s entretenir des 
relations s&#233;mantiques plus fortes que ceux qui apparaissent vers la fin. L&#8217;analyse des r&#233;sultats 
obtenus pour tous les mots &#233;tudi&#233;s a d&#233;montr&#233; que la moyenne des scores associ&#233;s aux paires 
d&#8217;&#233;quivalents13 pourrait constituer une sorte de seuil au-dessous duquel les relations trouv&#233;es 
ne sont pas pertinentes. Les relations rep&#233;r&#233;es permettent la clusterisation des &#233;quivalents : les 
&#233;l&#233;ments inclus dans un cluster sont cens&#233;s traduire le m&#234;me sens du mot source tandis qu&#8217;un 
&#233;l&#233;ment qui appartient &#224; plusieurs clusters est suppos&#233; traduire des sens diff&#233;rents.
</p>
<p>             &#541;&#304;&#306;&#302;&#539;&#531;&#542;&#536;&#305;&#536;
          a
</p>
<p>&#539;&#531;&#542;&#536;&#305;&#536;                 &#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536;      &#539;&#538;&#542;&#536;&#306;&#538;&#539;&#553;&#306;&#536;&#306;&#302;
                            d 
</p>
<p>&#539;&#531;&#542;&#536;&#541;&#302; c      &#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; b
                                  relations rep&#233;r&#233;es dans les contextes de la LS 
</p>
<p>                 relations rep&#233;r&#233;es dans les deux types de contexte  
</p>
<p>Figure 2 : Clusterisation des &#233;quivalents de movement
</p>
<p>Les relations entre les &#233;quivalents sont induites soit par les contextes de la LS, soit par ceux 
de la LC, soit par les deux types de contexte ; ceci est illustr&#233; dans la figure 2 par l&#8217;utilisation 
de lignes diff&#233;rentes. D&#8217;apr&#232;s les r&#233;sultats obtenus jusqu&#8217;&#224; maintenant, les relations rep&#233;r&#233;es 
seulement dans les contextes des traductions ne sont pas pertinentes, contrairement aux 
relations rep&#233;r&#233;es dans les contextes des textes originaux ou dans les deux types de contextes.
</p>
<p>La projection des clusters d&#8217;&#233;quivalents sur le mot polys&#233;mique source induit trois sens au 
sein du mot movement. Les deux premiers sens sont illustr&#233;s par les clusters a et b
(&#541;&#304;&#306;&#302;&#539;&#531;&#542;&#536;&#305;&#536;-&#539;&#531;&#542;&#536;&#305;&#536;-&#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536; et &#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536;-&#539;&#531;&#542;&#536;&#305;&#536;-&#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302;) et correspondent aux usages 
de movement qui d&#233;crivent les notions de mobilit&#233;, de circulation et de transfert. Les sens 
d&#233;crits par ces deux clusters pourraient th&#233;oriquement &#234;tre regroup&#233;s dans un sens plus large. 
N&#233;anmoins, la distinction induite par les clusters s&#233;par&#233;s peut &#234;tre expliqu&#233;e comme refl&#233;tant 
des contraintes d&#8217;utilisation et de substitution des &#233;quivalents au sein des contextes. Le cluster 
c (&#539;&#531;&#542;&#536;&#541;&#302;-&#539;&#531;&#542;&#536;&#305;&#536;), d&#233;crit le sens m&#233;taphorique de movement (par ex. des mouvements sociaux 
et autres). Ce sens est le plus souvent traduit par &#539;&#531;&#542;&#536;&#541;&#302;, mais aussi parfois par &#539;&#531;&#542;&#536;&#305;&#536;. &#512;&#531;&#542;&#536;&#305;&#536;
est un mot polys&#233;mique qui peut v&#233;hiculer, d&#8217;une part, le sens de mobilit&#233; et de d&#233;placement 
physique et, d&#8217;autre part, le sens de mouvement social. L&#8217;isolation de certains &#233;quivalents, 
comme dans le cas de &#539;&#538;&#542;&#536;&#306;&#538;&#539;&#553;&#306;&#536;&#306;&#302;, peut &#234;tre due aussi bien &#224; des raisons s&#233;mantiques qu&#8217;&#224; 
leur basse fr&#233;quence d&#8217;occurrence dans le corpus, ce qui fait qu&#8217;il n&#8217;y a pas assez 
</p>
<p>12 Paires faiblement li&#233;es (avec des scores inf&#233;rieurs &#224; la moyenne) : &#541;&#304;&#306;&#302;&#539;&#531;&#542;&#536;&#305;&#536;-&#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; (0,035-0,05) / -
&#539;&#538;&#542;&#536;&#306;&#538;&#539;&#553;&#306;&#536;&#306;&#302; (0,039-0,009) / -&#539;&#531;&#542;&#536;&#541;&#302; (0,009-0,044), &#539;&#538;&#542;&#536;&#306;&#538;&#539;&#553;&#306;&#536;&#306;&#302;-&#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536; (0,038-0,036) / -&#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; (0,022-
0,023) / -&#539;&#531;&#542;&#536;&#541;&#302; (0-0,045) / -&#539;&#531;&#542;&#536;&#305;&#536; (0-0,029), &#539;&#531;&#542;&#536;&#541;&#302;-&#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536; (0,019-0,06) / -&#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; (0,008-0,018). 
13 La moyenne des scores attribu&#233;s &#224; toutes les paires (m&#234;mes aux paires d&#8217;&#233;quivalents faiblement li&#233;s). 
</p>
<p>212</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de sens et d&#233;sambigu&#239;sation dans un contexte bilingue 
</p>
<p>d&#8217;informations contextuelles pour les rapprocher des autres. Quand la fr&#233;quence d&#8217;occurrence 
d&#8217;un &#233;quivalent est grande par rapport &#224; celle des autres &#233;quivalents et qu&#8217;il reste, malgr&#233; cela, 
isol&#233;, nous pouvons supposer l&#8217;existence d&#8217;une diff&#233;rence s&#233;mantique. Dans le cas de 
&#539;&#538;&#542;&#536;&#306;&#538;&#539;&#553;&#306;&#536;&#306;&#302;, son isolation est due &#224; sa basse fr&#233;quence dans le corpus (6) et &#224; son contexte 
tr&#232;s restreint, qui fait qu&#8217;il n&#8217;y a pas assez d&#8217;informations contextuelles sur cet &#233;quivalent qui 
pourraient le &#171; rapprocher &#187; des autres. 
</p>
<p>Les relations entre les &#233;quivalents contenus dans un cluster sont mod&#233;lis&#233;es &#224; l&#8217;aide des 
&#233;l&#233;ments contextuels qui les mettent en &#233;vidence, c&#8217;est-&#224;-dire par les traits qui sont communs 
aux &#233;quivalents en question et que nous pourrions appeler leurs co-textes assimilateurs 
(Fuchs, 1994 :134-141). Ainsi chaque paire d&#8217;&#233;quivalents est caract&#233;ris&#233;e par l&#8217;ensemble de 
traits de leurs co-textes assimilateurs et par un ensemble de traits correspondant &#224; chacun des 
&#233;quivalents, qui contient aussi bien leurs traits communs que les traits de leurs co-textes 
dissimilateurs, qui diff&#233;rencient l&#8217;un &#233;quivalent de l&#8217;autre. Il se peut que les co-textes 
dissimilateurs caract&#233;risant un &#233;quivalent d&#233;crivent un sens v&#233;hicul&#233; seulement par celui-ci (et 
non par l&#8217;autre membre de la paire). Le regroupement des traits dissimilateurs et assimilateurs 
au sein de ces ensembles provoque une perte d&#8217;informations relatives &#224; ce type de distinctions 
qui n&#8217;a pas d&#8217;impact n&#233;gatif important sur le processus de pr&#233;diction de traduction et qui 
am&#233;liore m&#234;me les r&#233;sultats du point de vue qualitatif. Le regroupement permet la s&#233;lection 
correcte de l&#8217;un des &#233;quivalents d&#8217;une paire, non pas seulement si celui-ci v&#233;hicule un sens 
bien distinct, mais aussi lorsqu&#8217;il est plus ad&#233;quat que l&#8217;autre &#233;quivalent de la paire pour 
traduire la nouvelle occurrence du mot source. En revanche, l&#8217;utilisation de correspondances 
de ce type dans le cadre d&#8217;une autre application, comme la recherche d&#8217;informations 
multilingues, n&#233;cessiterait probablement une mod&#233;lisation plus fine des sens v&#233;hicul&#233;s par 
chacun des &#233;quivalents.
</p>
<p>5.  &#201;valuation 
Le corpus de test utilis&#233; pour l&#8217;&#233;valuation de la m&#233;thode est diff&#233;rent du corpus 
d&#8217;apprentissage. Il s&#8217;agit de la partie anglais-grec du corpus parall&#232;le EUROPARL (Koehn, 
2003). Etant align&#233; au niveau des phrases, nous avons pu extraire &#224; partir de ce corpus des 
segments de traduction contenant, d&#8217;une part, les phrases en anglais o&#249; les mots polys&#233;miques 
occurrent et, d&#8217;autre part, leurs traductions en grec. L&#8217;&#233;valuation de la m&#233;thode consiste &#224; 
l&#8217;utilisation des correspondances &#233;tablies entre les mots polys&#233;miques et leurs &#233;quivalents de 
traduction pendant l&#8217;&#233;tape pr&#233;c&#233;dente pour (a) la d&#233;sambigu&#239;sation des nouvelles occurrences 
des mots polys&#233;miques et (b) la pr&#233;diction des traductions les plus ad&#233;quates pour ces 
occurrences. Pour chacun des &#233;quivalents des mots polys&#233;miques trouv&#233;s dans le corpus de 
test, nous avons retenu un ensemble de segments choisis au hasard. Par exemple, le mot 
movement est traduit dans EUROPARL par tous les &#233;quivalents clusteris&#233;s (voir figure 2) et 
nous avons retenu dix segments correspondant &#224; chacun de ces &#233;quivalents. 
</p>
<p>Etant donn&#233; que l&#8217;apprentissage a op&#233;r&#233; sur les formes des mots de cat&#233;gories grammaticales 
pr&#233;cises et que les correspondances ont &#233;t&#233; mod&#233;lis&#233;es &#224; l&#8217;aide de celles-ci, il a fallu 
lemmatiser et &#233;tiqueter morphosyntaxiquement les nouveaux contextes pour rendre possible 
leur comparaison avec les informations retenues14. Voici un exemple d&#8217;un segment de 
traduction pour le mot movement :
</p>
<p>14 L&#8217;&#233;tiquetage morphosyntaxique et la lemmatisation ont &#233;t&#233; effectu&#233;s &#224; l&#8217;aide de l&#8217;&#233;tiqueteur TreeTagger 
(Schmid, 1994). Nous rappelons que seulement les noms, les adjectifs et les verbes des contextes sont retenus.
</p>
<p>213</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marianna APIDIANAKI
</p>
<p>{I am therefore delighted that steps are finally being taken which will allow the theoretical freedom of 
movement of persons to be translated into practice, albeit still far from perfect practice! -- &#508;&#652;&#544;&#541;&#529;&#542;&#550;&#546;
&#304;&#531;&#541;&#302;&#538; &#538;&#539;&#302;&#542;&#544;&#652;&#544;&#538;&#536;&#541;&#529;&#542;&#544;&#546; &#652;&#544;&#547; &#304;&#652;&#538;&#306;&#529;&#540;&#544;&#547;&#546; &#540;&#302;&#541;&#533;&#528;&#542;&#544;&#542;&#306;&#302;&#538; &#541;&#529;&#306;&#545;&#302; &#306;&#302; &#544;&#652;&#544;&#531;&#302; &#537;&#302; &#304;&#652;&#538;&#306;&#545;&#529;&#549;&#544;&#547;&#542; &#542;&#302; &#534;&#531;&#542;&#304;&#538; &#652;&#545;&#528;&#543;&#536; &#536; &#302;&#545;&#548;&#530;
&#306;&#536;&#546; &#304;&#540;&#304;&#554;&#537;&#304;&#545;&#536;&#546; &#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302;&#546; &#306;&#550;&#542; &#652;&#545;&#544;&#305;&#555;&#652;&#550;&#542;, &#529;&#305;&#306;&#550; &#539;&#302;&#538; &#302;&#542; &#306;&#302; &#541;&#529;&#306;&#545;&#302; &#302;&#547;&#306;&#528; &#304;&#531;&#542;&#302;&#538; &#302;&#539;&#553;&#541;&#302;, &#539;&#302;&#306;&#528; &#306;&#536; &#534;&#542;&#555;&#541;&#536;
&#541;&#544;&#547;, &#302;&#542;&#304;&#652;&#302;&#545;&#539;&#529;&#305;&#306;&#302;&#306;&#302;!}
</p>
<p>Le contexte de la nouvelle occurrence de movement est repr&#233;sent&#233; de la mani&#232;re suivante : 
{be (VBP), delight (VVN), step (NNS), be (VBG), take (VVN), allow (VV), theoretical (JJ),
freedom (NN), person (NNS), translate (VVN), practice (NN), &#8230;}. La comparaison de cet 
ensemble d&#8217;&#233;l&#233;ments avec les traits qui caract&#233;risent les correspondances entre movement et 
ses &#233;quivalents permet la s&#233;lection de l&#8217;&#233;quivalent le plus ad&#233;quat pour la nouvelle occurrence 
du mot. La pr&#233;diction de traduction avec le plus grand score pour cette occurrence de 
movement est la paire d&#8217;&#233;quivalents : &#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536;-&#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; (score : 2,951). 
</p>
<p>La proposition de paires d&#8217;&#233;quivalents pour un mot constitue l&#8217;un des points forts de la 
m&#233;thode dans le sens o&#249; elle profite bien des informations paradigmatiques relatives &#224; la 
similarit&#233; s&#233;mantique entre les &#233;quivalents, qui enrichissent les correspondances &#233;tablies entre 
les mots des deux langues. La proposition d&#8217;une paire d&#8217;&#233;quivalents signifie qu&#8217;ils sont 
interchangeables au sein du nouveau contexte. Il faut souligner le r&#244;le important des scores 
attribu&#233;s aux nouveaux contextes par rapport aux correspondances &#233;tablies ; ces scores sont 
calcul&#233;s sur la base des poids attribu&#233;s aux traits qui caract&#233;risent les &#233;quivalents clusteris&#233;s. 
Ainsi, une proposition est faite non pas sur la base du nombre des traits communs entre le 
nouveau contexte et les correspondances mod&#233;lis&#233;es, mais en fonction de la pertinence des 
traits du nouveau contexte par rapport aux &#233;l&#233;ments qui forment les correspondances.  
</p>
<p>Pour &#233;valuer les r&#233;sultats du point de vue quantitatif, nous utilisons les mesures de rappel et 
de pr&#233;cision ; le rappel correspond au rapport du nombre de pr&#233;dictions correctes au nombre 
de traductions de r&#233;f&#233;rence et la pr&#233;cision au rapport du nombre de pr&#233;dictions correctes au 
nombre de propositions faites par le syst&#232;me. Nous consid&#233;rons comme pr&#233;diction correcte la 
proposition de l&#8217;&#233;quivalent qui traduit la nouvelle occurrence du mot dans le corpus de test &#8211; 
dans notre exemple il s&#8217;agit de l&#8217;&#233;quivalent &#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302; &#8211; ainsi que les propositions 
d&#8217;&#233;quivalents qui retiennent une relation de similarit&#233; s&#233;mantique avec lui et donc se trouvent 
dans le m&#234;me cluster15. La prise en compte des relations paradigmatiques &#233;tablies entre les 
&#233;quivalents et d&#233;crites &#224; l&#8217;aide des clusters apporte une am&#233;lioration des r&#233;sultats de 
l&#8217;&#233;valuation par rapport aux r&#233;sultats obtenus en consid&#233;rant comme correctes seulement les 
propositions correspondant aux &#233;quivalents trouv&#233;s dans le corpus de r&#233;f&#233;rence. Dans le 
premier cas, la pr&#233;cision pour les dix mots &#233;tudi&#233;s est de 71,91 % et le rappel de 68,26 %, 
tandis que, dans le deuxi&#232;me cas, la pr&#233;cision est de 38,48 % et le rappel de 36,53 %. Nous 
remarquons aussi l&#8217;influence des limitations du corpus sur les r&#233;sultats ; ceux-ci se d&#233;t&#233;riorent 
clairement dans le cas d&#8217;&#233;quivalents qui ont une fr&#233;quence d&#8217;occurrence inf&#233;rieure &#224; dix dans 
le corpus d&#8217;apprentissage. Les correspondances mod&#233;lis&#233;es entre le mot source et ces 
&#233;quivalents ne contiennent pas d&#8217;informations suffisantes sur leurs conditions d&#8217;utilisation 
afin qu&#8217;ils soient s&#233;lectionn&#233;s pour traduire une nouvelle occurrence du mot. Si les r&#233;sultats 
pour ces &#233;quivalents ne sont pas pris en compte, la pr&#233;cision est de 80,33 % et le rappel de 
76,8 % en tenant compte de la clusterisation versus 48,11 % et 46 % dans le cas inverse. 
</p>
<p>15 Par exemple, la proposition de l&#8217;&#233;quivalent &#303;&#538;&#302;&#539;&#531;&#542;&#536;&#305;&#536; pour une occurrence de movement traduite dans le 
corpus de test par &#539;&#547;&#539;&#540;&#544;&#307;&#544;&#545;&#531;&#302;. Cette proposition est consid&#233;r&#233;e comme correcte &#233;tant donn&#233; que les deux 
&#233;quivalents sont li&#233;s et qu&#8217;ils sont consid&#233;r&#233;s comme ad&#233;quats et interchangeables au sein du nouveau contexte. 
</p>
<p>214</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de sens et d&#233;sambigu&#239;sation dans un contexte bilingue 
</p>
<p>6.  Discussion et perspectives 
La m&#233;thode pr&#233;sent&#233;e dans cet article ne se base sur aucune ressource s&#233;mantique pr&#233;d&#233;finie, 
et les sens sont mis en &#233;vidence sur la base des informations contenues dans le corpus 
d&#8217;apprentissage. Il serait donc souhaitable de proc&#233;der &#224; une validation des sens propos&#233;s et 
des relations s&#233;mantiques &#233;tablies entre les &#233;quivalents. Pour ce faire, nous avons compar&#233; les 
r&#233;sultats obtenus par la m&#233;thode des cooccurrences avec ceux d&#8217;une autre m&#233;thode 
automatique de d&#233;sambigu&#239;sation ; il s&#8217;agit de la m&#233;thode des Miroirs S&#233;mantiques propos&#233;e 
par Dyvik (1998, 2003) qui se sert des informations sur les relations de traduction entre les 
mots d&#8217;un bitexte afin d&#8217;analyser leur s&#233;mantique et de construire des thesaurus s&#233;mantiques. 
En raison des contraintes d&#8217;espace, nous ne pouvons pas pr&#233;senter ici en d&#233;tail les r&#233;sultats de 
l&#8217;application de cette m&#233;thode sur notre corpus. Cependant, nous pouvons signaler que les 
distinctions s&#233;mantiques propos&#233;es par cette m&#233;thode sont assez similaires aux distinctions 
propos&#233;es par la m&#233;thode contextuelle. Etant donn&#233; que les Miroirs S&#233;mantiques utilisent des 
informations de nature tr&#232;s diff&#233;rente16, la similarit&#233; entre les r&#233;sultats des deux m&#233;thodes 
constitue une sorte de validation des r&#233;sultats obtenus par la m&#233;thode contextuelle et apporte 
un bon degr&#233; de confiance quant aux distinctions s&#233;mantiques propos&#233;es. 
</p>
<p>L&#8217;application &#224; notre corpus de la m&#233;thode des Miroirs S&#233;mantiques permet aussi de rem&#233;dier 
&#224; une limitation de la m&#233;thode contextuelle de d&#233;sambigu&#239;sation. Celle-ci rend possible le 
rep&#233;rage des relations de similarit&#233; s&#233;mantique entre les &#233;quivalents et leur clusterisation, 
mais elle ne permet pas l&#8217;analyse de la nature des relations entre les &#233;quivalents clusteris&#233;s. 
Les diff&#233;rents &#233;quivalents de traduction d&#8217;un mot peuvent entretenir des relations de (quasi)-
synonymie, d&#8217;hyponymie, d&#8217;hyperonymie ou, m&#234;me, de causalit&#233;. La m&#233;thode des Miroirs 
S&#233;mantiques offre la possibilit&#233; d&#8217;analyse de la nature des relations s&#233;mantiques existant entre 
les &#233;quivalents, qui sont d&#233;crites au sein des entr&#233;es correspondantes du thesaurus.
</p>
<p>Compte tenu, d&#8217;une part, du caract&#232;re automatique de la m&#233;thode de d&#233;sambigu&#239;sation 
propos&#233;e dans cet article et, d&#8217;autre part, des r&#233;sultats encourageants de l&#8217;&#233;valuation, nous 
estimons que cette m&#233;thode m&#233;rite d&#8217;&#234;tre test&#233;e &#224; grande &#233;chelle. La mani&#232;re dont 
l&#8217;&#233;valuation est men&#233;e ici (par prise en compte d&#8217;un nombre fixe et plus ou moins &#233;gal de 
nouvelles occurrences par candidat de traduction) ne permet pas de comparer les r&#233;sultats 
avec une m&#233;thode &#171; baseline &#187;, qui concernerait, par exemple, la s&#233;lection de l&#8217;&#233;quivalent (et 
du sens) le plus fr&#233;quent pour toutes les occurrences17. Par la suite, nous proc&#233;derons &#224; une 
&#233;valuation plus globale de la m&#233;thode sur l&#8217;ensemble du corpus de test, qui nous permettra 
aussi d&#8217;avoir des r&#233;sultats significatifs &#224; l&#8217;aide de la m&#233;thode &#171; baseline &#187;, comparables avec 
les r&#233;sultats de notre m&#233;thode.  
</p>
<p>R&#233;f&#233;rences
APIDIANAKI M. (2006) Traitement de la polys&#233;mie lexicale dans un but de traduction. Actes de 
TALN 2006, 10-13 avril, Leuven, Belgique, vol. 1, 53-62. 
BROWN P. F., DELLA PIETRA S. A., DELLA PIETRA V. J., MERCER R. L. (1991) Word-sense 
disambiguation using statistical methods. Actes de 29th Annual Meeting of the Association for 
Computational Linguistics, 264-270.
</p>
<p>16 Les informations contextuelles ne sont pas prises en compte. 
17 Nous estimons que la comparaison avec une m&#233;thode &#171; baseline &#187; de ce type serait beaucoup plus int&#233;ressante 
que la comparaison avec une m&#233;thode effectuant le choix al&#233;atoire entre les alternatives.  
</p>
<p>215</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marianna APIDIANAKI
</p>
<p>BRUN C., JACQUEMIN B., SEGOND F. (2001) Exploitation de dictionnaires &#233;lectroniques pour la 
d&#233;sambigu&#239;sation s&#233;mantique lexicale, TAL, vol. 42(3), 667-690. 
DAGAN I., ITAI A. (1991) Word Sense Disambiguation Using a Second Language Monolingual 
Corpus, Computational Linguistics, vol. 20(4), 563-596. 
DUFOUR N. (1997) DEFIDIC, a lexical database for computerized translation selection, RISHH
vol. 33, Li&#232;ge, 79-111. 
DYVIK H. (1998) A translational basis for semantics. Corpora and Cross-Linguistic 
Research : Theory, Method and Case Studies, Johansson S., Oksefjell S. (&#233;ds.), 51-86. 
DYVIK H. (2003) Translations as a semantic knowledge source. (brouillon) URL : 
http://www.hf.uib.no/i/LiLi/SLF/ans/Dyvik/transknow.pdf  
FUCHS C. (1994) Paraphrase et &#233;nonciation. Paris : Editions Ophrys.
GAVRILIDOU M., LABROPOULOU P., DESIPRI E., GIOULI V., ANTONOPOULOS V., PIPERIDIS S.,
(2004) Building parallel corpora for eContent professionals. Actes de MLR 2004, 
PostCOLING Workshop on Multilingual Linguistic Resources, Gen&#232;ve, 28 ao&#251;t.
GREFENSTETTE G. (1994) Explorations in Automatic Thesaurus Discovery.
Boston/Dordrecht/London : Kluwer Academic Publishers.  
JOHANSSON S., OKSEFJELL S. (&#233;ds.) (1998) Corpora and Cross-Linguistic Research : Theory, 
Method and Case Studies. Amsterdam/Atlanta : Rodopi. 
KAJI H. (2003) Word Sense Acquisition from Bilingual Comparable Corpora. Actes de HLT-
NAACL, Edmonton, mai-juin, 32-39. 
KOEHN P. (2003) Europarl : a Multilingual Corpus for Evaluation of Machine Translation.
(brouillon) URL : http://www.iccs.inf.ed.ac.uk/~pkoehn/publications/europarl.pdf
MILLER G. A., CHARLES W.G. (1991) Contextual Correlates of Semantic Similarity. Language
and Cognitive Processes, vol. 6(1), 1-28. 
PANTEL P., LIN D. (2002) Discovering Word Senses from Text. Actes de ACM SIGKDD 
Conference on Knowledge Discovery and Data Mining, Edmonton, 613-619.
SCH&#220;TZE H. (1998) Automatic Word Sense Discrimination. Computational Linguistics, vol.
24(1), 97-123. 
SCHMID H. (1994) Probabilistic Part-of-Speech Tagging Using Decision Trees. Actes de 
International Conference on New Methods in Language Processing, Manchester, 44-49.
SIMARD M., LANGLAIS P. (2003) Statistical Translation Alignment with Compositionality 
Constraints. Actes de HLT-NAACL Workshop : Building and Using Parallel Texts : Data-
Driven Machine Translation and Beyond, Edmonton, Canada, May 31, 19-22. 
SPECIA L., VOLPE NUNES M. DAS GRA&#199;AS, STEVENSON M. (2006) Translation Context Sensitive 
WSD, Actes de EAMT-2006 : 11th Annual Conference of the European Association for 
Machine Translation, 19-20 juin, Oslo, 227-232.  
VERONIS J. (2003) Hyperlex : cartographie lexicale pour la recherche d&#8217;informations. Actes de 
TALN 2003, Batz-sur-mer, 11-14 juin, 265-274. 
VICKREY D., BIEWALD L., TEYSSIER M., KOLLER D. (2005)  Word-Sense Disambiguation for 
Machine Translation, Actes de HLT/EMNLP, Vancouver, BC, 771-778. 
</p>
<p>216</p>

</div></div>
</body></html>