<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>R&#233;gler les r&#232;gles d&#8217;analyse morphologique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5-8 juin 2007 
</p>
<p>R&#233;gler les r&#232;gles d&#8217;analyse morphologique
</p>
<p>Bruno CARTONI
ISSCO/TIM/ETI &#8211; Universit&#233; de Gen&#232;ve 
</p>
<p>40 bd du Pont d&#8217;Arve, 1205 Gen&#232;ve 
bruno.cartoni@eti.unige.ch
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons diff&#233;rentes contraintes m&#233;caniques et 
linguistiques applicables &#224; des r&#232;gles d&#8217;analyse des mots inconnus afin d&#8217;am&#233;liorer la 
performance d&#8217;un analyseur morphologique de l&#8217;italien. Pour mesurer l&#8217;impact de ces 
contraintes, nous pr&#233;sentons les r&#233;sultats d&#8217;une &#233;valuation de chaque contrainte qui prend en 
compte les gains et les pertes qu&#8217;elle engendre. Nous discutons ainsi de la n&#233;cessaire 
&#233;valuation de chaque r&#233;glage apport&#233; aux r&#232;gles afin d&#8217;en d&#233;terminer la pertinence.  
</p>
<p>Abstract. In this article, we present various constraints, mechanical and linguistic, that 
can be applied to analysing rules for unknown words in order to improve the performance of a 
morphological analyser for Italian. To measure the impact of these constraints, we present an 
evaluation for each constraint, taking into account the gains and losses which they generate. 
We then discuss the need to evaluate any fine-tuning of these kinds of rules in order to decide 
whether they are appropriate or not. 
</p>
<p>Mots-cl&#233;s : &#233;valuation, analyse morphologique, mots inconnus, morphologie 
constructionnelle.
Keywords: evaluation, morphological analysis, unknown words, constructional 
morphology. 
</p>
<p>1 Introduction
Les mots inconnus repr&#233;sentent un probl&#232;me r&#233;current pour le traitement automatique de la 
langue. Traditionnellement, on distingue trois types de mots inconnus : les noms propres, les 
erreurs et les mots issus de la cr&#233;ativit&#233; lexicale (n&#233;ologismes), chaque type recevant un 
traitement particulier. Pour les mots inconnus issus de la cr&#233;ativit&#233; lexicale et particuli&#232;rement 
de la cr&#233;ativit&#233; morphologique (les n&#233;ologismes construits), il a souvent &#233;t&#233; propos&#233; 
d&#8217;employer des r&#232;gles d&#8217;analyse qui formalisent plus ou moins les proc&#233;d&#233;s de construction 
des mots. Ces r&#232;gles, souvent bas&#233;es sur des principes linguistiques, mais &#233;galement 
fortement contraintes par les ressources disponibles et d&#8217;autres consid&#233;rations plus 
m&#233;caniques, rencontrent un certain nombre de limites. En effet, ce type d&#8217;approche est 
rapidement confront&#233; au probl&#232;me de l&#8217;homographie des cha&#238;nes de caract&#232;res des mots 
potentiellement construits avec des mots qui ne le sont pas. Ainsi, il arrive que ces r&#232;gles 
d&#8217;analyse engendrent plus de probl&#232;mes qu&#8217;elles n&#8217;en r&#233;solvent. Pour pallier ces &#233;cueils, ces 
</p>
<p>59</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno CARTONI
</p>
<p>r&#232;gles sont ajust&#233;es au moyen d&#8217;un certain nombre de contraintes, linguistiques ou 
m&#233;caniques. 
</p>
<p>Dans cet article, nous pr&#233;sentons l&#8217;&#233;valuation des contraintes linguistiques et m&#233;caniques qui 
peuvent &#234;tre appliqu&#233;es sur les r&#232;gles d&#8217;analyse des mots inconnus. Nous commen&#231;ons par 
passer en revue quelques analyseurs &#224; base de r&#232;gles qui traitent des mots inconnus 
morphologiquement construits (section 2), puis nous pr&#233;sentons notre analyseur bas&#233; sur les 
cha&#238;nes de caract&#232;res et sur des contraintes qui permettent d&#8217;&#233;viter les &#233;cueils (section 3). Le 
nombre de mauvaises analyses engendr&#233;es par les r&#232;gles ou par l&#8217;application d&#8217;une contrainte 
linguistique peut cependant ternir le b&#233;n&#233;fice apport&#233; par les r&#232;gles dans le traitement des 
mots inconnus. L&#8217;&#233;valuation de notre analyseur et de chacune des contraintes repr&#233;sente par 
cons&#233;quent un sujet crucial. Apr&#232;s avoir pos&#233; les jalons de l&#8217;&#233;valuation de l&#8217;analyse 
morphologique (section 4.1), nous pr&#233;sentons les r&#233;sultats de l&#8217;&#233;valuation des contraintes de 
notre analyseur (section 4.2), afin de voir quelles sont celles qui aident le syst&#232;me &#224; tendre 
vers une performance maximale. Nous concluons en montrant que l&#8217;importance donn&#233;e aux 
pertes et aux gains induits par ces contraintes d&#233;pend avant tout de la finalit&#233; de la t&#226;che.  
</p>
<p>2 Analyse morphologique et mots inconnus : &#233;tat de l&#8217;art 
Les mots inconnus sont un ph&#233;nom&#232;ne constant, mais leur proportion relativement restreinte 
constitue un frein aux m&#233;thodes d&#8217;apprentissage automatique et nous pousse &#224; privil&#233;gier des 
m&#233;thodes davantage linguistiques, &#224; base de r&#232;gles. 
</p>
<p>Une grande partie des &#233;tudes qui exploitent les connaissances morphologiques pour traiter les 
mots inconnus n&#233;ologiques se concentrent sur l&#8217;incompl&#233;tude lexicale des lexiques des 
analyseurs morphosyntaxiques. Elles ont pour principal objectif de deviner la cat&#233;gorie 
morphosyntaxique des mots inconnus, le plus souvent en exploitant les terminaisons typiques 
de ces mots (Guilbaud et al., 1997) et (Woods, 2000). Si certaines &#233;tudes ne se r&#233;clament 
d&#8217;aucune approche linguistique particuli&#232;re, d&#8217;autres montrent explicitement leur r&#233;f&#233;rence 
th&#233;orique, &#224; l&#8217;image de (Byrd, 1983) et (Byrd et al., 1989), qui proposent une application des 
principes de la morphologie lex&#233;matique de (Aronoff, 1976). (Byrd, 1983) pr&#244;ne un v&#233;ritable 
calcul morphologique permettant de retrouver la base et le(s) affixe(s) qui constituent le mot 
construit.
</p>
<p>Toutes ces &#233;tudes pr&#233;voient d&#8217;ajuster les r&#232;gles par l&#8217;entremise de contraintes qui permettent 
d&#8217;&#233;viter les probl&#232;mes engendr&#233;s par ce type d&#8217;approche (cf. ci-apr&#232;s section 3.1). Une des 
contraintes principales porte sur la cat&#233;gorie morphosyntaxique de la base, qui peut 
facilement &#234;tre filtr&#233;e, &#233;tant donn&#233; qu&#8217;elle se trouve dans le lexique. D&#8217;autres r&#233;glages sont 
davantage s&#233;mantiques, comme l&#8217;&#233;tymologie latine de certains mots anglais qui favorise 
l&#8217;affixation avec un affixe latin (Byrd et al., 1989). 
</p>
<p>Du point de vue de l&#8217;&#233;valuation, les &#233;tudes mentionn&#233;es ne font &#233;tat ni des gains apport&#233;s par 
ces r&#232;gles ni de la correction des analyses, et se cantonnent &#224; &#233;valuer d&#8217;un point de vue 
beaucoup plus large l&#8217;am&#233;lioration des performances de l&#8217;analyseur en g&#233;n&#233;ral. Or, nous 
pensons que le traitement des mots inconnus est, de par sa nature, une t&#226;che extr&#234;mement 
pr&#233;cise et granulaire. Une augmentation m&#234;me minime de la performance de l&#8217;analyseur doit 
&#234;tre mise en regard non seulement des mauvaises analyses engendr&#233;es (le bruit), mais 
&#233;galement du nombre de mots non-analys&#233;s (le silence). En effet, si une r&#232;gle d&#8217;analyse 
engendre plus de probl&#232;mes qu&#8217;elle n&#8217;en r&#233;sout, le gain global est alors insignifiant. Dans la 
suite, nous pr&#233;sentons les diff&#233;rentes questions soulev&#233;es par l&#8217;&#233;valuation de l&#8217;analyse 
</p>
<p>60</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;gler les r&#232;gles d&#8217;analyse morphologique 
</p>
<p>morphologique &#224; base de r&#232;gles. Mais avant cela, nous pr&#233;sentons l&#8217;analyseur de mots 
inconnus pr&#233;fix&#233;s que nous avons contraint puis &#233;valu&#233;. 
</p>
<p>3 Analyseur morphologique bas&#233; sur les r&#232;gles 
Dans le cadre d&#8217;un projet de recherche plus large de traduction automatique des mots 
inconnus morphologiquement construits (Cartoni, 2005), nous avons mis au point un 
analyseur morphologique de l&#8217;italien permettant d&#8217;analyser les mots inconnus mais corrects 
construits par pr&#233;fixation. Par analyse morphologique, nous entendons l&#8217;identification des 
mots r&#233;ellement pr&#233;fix&#233;s et donc l&#8217;individualisation de leur base. Le calcul s&#233;mantique 
base+pr&#233;fixe est effectu&#233; ult&#233;rieurement par les r&#232;gles. Cet analyseur s&#8217;appuie sur un lexique 
de r&#233;f&#233;rence de l&#8217;italien (Mmorph (Petitpierre et al., 1995) &#8211; 739 000 formes) dont il extrait 
les informations lexicales. L&#8217;analyseur morphologique est donc constitu&#233; de r&#232;gles de 
construction des mots (RCM1), comme le montre la figure 1 : 
</p>
<p>La r&#232;gle de la figure 1 analyse les mots inconnus dont la premi&#232;re s&#233;quence de lettres est 
i p e r. Si la s&#233;quence de lettres restantes (c'est-&#224;-dire la base potentielle) est pr&#233;sente dans 
le lexique de r&#233;f&#233;rence (ligne (3)), le mot X est alors consid&#233;r&#233; comme construit. Toutes les 
recherches que nous avons d&#233;j&#224; &#233;voqu&#233;es (section 2) prenaient &#233;videmment en compte le fait 
qu&#8217;un mot construit l&#8217;&#233;tait avec un affixe (instanci&#233; par la r&#232;gle) et une base qui devait &#234;tre 
connue du lexique de r&#233;f&#233;rence. Il nous faut toutefois mentionner que cette &#233;vidence ne 
s&#8217;applique pas toujours, notamment lorsqu&#8217;un pr&#233;fixe s&#8217;accole avec un trait d&#8217;union &#224; une 
base absente du lexique, formant tout de m&#234;me un mot construit (il s&#8217;agit souvent de noms 
propres, comme pro-Tibet). Ajoutons &#233;galement que, comme les r&#232;gles traitent des cha&#238;nes de 
caract&#232;res, nous devons formaliser plusieurs r&#232;gles pour un m&#234;me pr&#233;fixe en fonction des 
diff&#233;rents allomorphes qu&#8217;il peut avoir (le pr&#233;fixe in peut par exemple prendre la forme il, im,
ou ir, suivant la consonne initiale de la base), ou encore avec ou sans trait d&#8217;union, l&#8217;usage de 
celui-ci &#233;tant passablement flottant. 
</p>
<p>Figure 1 : R&#232;gle d'analyse pour la pr&#233;fixation en iper
</p>
<p>Une &#233;tude de faisabilit&#233; (Cartoni, 2006) nous avait d&#233;j&#224; montr&#233; que, parmi les 46 pr&#233;fixes 
productifs de l&#8217;italien list&#233;s par (Iacobini, 2004), certains sont tr&#232;s peu probl&#233;matiques en 
terme de transparence et d&#8217;homographie avec d&#8217;autres cha&#238;nes de caract&#232;res. Nous les avons 
donc pour l&#8217;instant mis de c&#244;t&#233; et nous nous sommes content&#233;s d&#8217;impl&#233;menter l&#8217;analyseur 
avec les 14 pr&#233;fixes de l&#8217;italien (et leurs allomorphes) qui posent le plus de probl&#232;mes, &#224; 
savoir : pro, dis, trans, inter, in, poli, arci, retro, post, mini, iper, multi, ri et co.
</p>
<p>1 La morphologie lex&#233;matique rejette la notion de mot et pr&#233;f&#232;re parler de lex&#232;mes, comme unit&#233; abstraite. Il en 
r&#233;sulte que l&#8217;on parle maintenant de r&#232;gles de construction des lex&#232;mes (RCL) plut&#244;t que de RCM. Nous 
conservons cependant l&#8217;appellation de RCM, &#233;tant donn&#233; que, d&#8217;un point de vue informatique, il s&#8217;agit bien 
de mots (dans le sens de mot forme) que nous voulons analyser. 
</p>
<p>61</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno CARTONI
</p>
<p>3.1 Les probl&#232;mes de l&#8217;analyse morphologique 
</p>
<p>De telles r&#232;gles, bien que tr&#232;s simples, se r&#233;v&#232;lent relativement efficaces, mais elles 
pr&#233;sentent &#233;videmment un certain nombre d&#8217;&#233;cueils, &#224; cause de l&#8217;homographie de certaines 
cha&#238;nes de caract&#232;res avec des mots r&#233;ellement construits. (Grabar et al., 2006) distinguent 
cinq types de mauvaises analyses engendr&#233;es par ce genre de m&#233;thode : (1) des &#171; lex&#232;mes 
dans lesquels l&#8217;op&#233;ration &#233;tudi&#233;e n&#8217;est pas la derni&#232;re op&#233;ration constructionnelle &#187;, (2) des 
&#171; lex&#232;mes difficilement analysables comme construits en fran&#231;ais &#187;, (3) des &#171; lex&#232;mes 
comportant une suite graphique accidentellement identique aux affixes &#233;tudi&#233;s &#187;, (4) des 
&#171; lex&#232;mes polys&#233;miques [dont] le sens attest&#233; n&#8217;est pas celui qui nous int&#233;resse &#187; et (5) des 
&#171; erreurs et fautes d&#8217;orthographe &#187;. 
</p>
<p>Dans la pr&#233;sente &#233;tude, nous appliquons les r&#232;gles aux mots inconnus du lexique de r&#233;f&#233;rence. 
Par cons&#233;quent, nous rencontrons majoritairement des probl&#232;mes du type (1), quand 
l&#8217;op&#233;ration qui a construit le mot inconnu n&#8217;est pas la pr&#233;fixation (&quot;prostatiche&quot; = 
prostata +ico, et non pas pro+statiche), ainsi que des probl&#232;mes du type (5) o&#249; 
le mot inconnu est erron&#233;, mais a &#233;t&#233; analys&#233; comme une s&#233;quence pr&#233;fixe + base 
(&quot;progesso&quot; est la forme erron&#233;e de &quot;progresso&quot; et non pas &quot;pro+gesso&quot;). Il 
reste n&#233;anmoins quelques cas de mauvaises analyses qui proviennent de l&#8217;absence du mot 
dans le lexique de r&#233;f&#233;rence bien qu&#8217;il ne s&#8217;agisse ni d&#8217;un n&#233;ologisme construit ni d&#8217;une faute 
d&#8217;orthographe. Il s&#8217;agit alors majoritairement d&#8217;emprunts ou de termes techniques.
</p>
<p>Tout l&#8217;enjeu de l&#8217;analyseur est par cons&#233;quent d&#8217;&#233;viter les pi&#232;ges provoqu&#233;s par ces 
homographies. Ainsi, nous avons r&#233;gl&#233; nos r&#232;gles avec un certain nombre de contraintes que 
nous d&#233;crivons ci-dessous, et que nous &#233;valuons dans la section 4. 
</p>
<p>3.2 Les contraintes possibles sur les r&#232;gles 
</p>
<p>Pour r&#233;gler nos r&#232;gles, nous avons mis en place deux types de contraintes qui &#233;taient d&#233;j&#224; 
propos&#233;es notamment par (Byrd et al., 1986 et Bopp et al., 2004). La premi&#232;re, qui prend en 
compte la cat&#233;gorie morphosyntaxique de la base, est bas&#233;e sur des principes linguistiques. La 
seconde, qui porte sur la valeur s&#233;mantique de la base, est &#233;galement d&#8217;inspiration 
linguistique, m&#234;me si certaines donn&#233;es proviennent d&#8217;intuitions plus empiriques. 
</p>
<p>La contrainte de la cat&#233;gorie morphosyntaxique de la base est motiv&#233;e par le fait que certains 
affixes ne s&#8217;accolent qu&#8217;&#224; certains types de base, m&#234;me s&#8217;il est vrai que plus d&#8217;un quart des 
pr&#233;fixes de l&#8217;italien s&#8217;accolent aux trois cat&#233;gories lexicales majeures (adjectif, nom, verbe) 
(Iacobini, 2004). Ainsi, pour la r&#232;gle de pr&#233;fixation en mini, nous avons contraint la r&#232;gle 
avec une cat&#233;gorie de base uniquement nominale. Pour les r&#232;gles de pr&#233;fixation en pro, retro, 
post, poli, multi, trans, arci, et iper, la base doit &#234;tre soit adjectivale, soit nominale. Enfin, 
pour les bases des r&#232;gles de pr&#233;fixation en dis, ri, co, et inter, les trois cat&#233;gories majeures 
sont possibles. Notons &#233;galement que cette contrainte, m&#234;me si elle est parfois tr&#232;s large, 
permet d&#8217;exclure des mauvaises analyses sur un d&#233;terminant ou une conjonction (arcipel
est un emprunt, et non pas une construction avec le pr&#233;fixe arci et la pr&#233;position contract&#233;e 
pel).
La deuxi&#232;me contrainte porte sur la valeur s&#233;mantique de la base qui peut favoriser &#233;galement 
l&#8217;application de tel ou tel pr&#233;fixe. A moins de disposer de ressources lexicales contenant des 
informations s&#233;mantiques, il est tr&#232;s difficile de formaliser informatiquement ce genre de 
contrainte. Cependant, la s&#233;mantique de la base est parfois observable dans sa forme de 
</p>
<p>62</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;gler les r&#232;gles d&#8217;analyse morphologique 
</p>
<p>surface. Ainsi, comme l&#8217;affirme (Iacobini, 2004, p. 114) &#171; l&#8217;emploi d&#8217;un pr&#233;fixe peut &#234;tre 
conditionn&#233; par le suffixe de la base &#187;, &#233;tant donn&#233; que la valeur s&#233;mantique de la base peut 
&#234;tre exprim&#233;e par l&#8217;emploi d&#8217;un ou plusieurs suffixes. Cette assertion est int&#233;ressante car le ou 
les suffixe(s) concern&#233;s peuvent &#234;tre exprim&#233;s en termes de cha&#238;nes de caract&#232;res, permettant 
de contraindre la r&#232;gle d&#8217;analyse. Cette optique revient &#224; dire que certains pr&#233;fixes sont 
productifs sur des bases qui sont d&#233;j&#224; des mots construits, ou que la &#171; constructivit&#233; &#187; des 
bases permet la pr&#233;fixation. (Krott et al., 1999) et plus tard (Namer, 2003) ont soulign&#233; le 
nombre important de mots construits sur des bases elles-m&#234;mes construites. Il est donc 
envisageable, pour certains pr&#233;fixes, de contraindre la base sur certaines terminaisons que 
nous consid&#233;rons alors comme des &#171; indices de constructivit&#233; &#187;. 
</p>
<p>Dans la mesure o&#249; certains pr&#233;fixes comme ri, co et retro sont r&#233;put&#233;s productifs avec les 
noms d&#233;verbaux, nous pouvons contraindre les r&#232;gles d&#8217;analyse en imposant la pr&#233;sence de 
suffixes typiques de la nominalisation d&#233;verbalisante, comme &#8211;zione et &#8211;mento. Il en va de 
m&#234;me pour le pr&#233;fixe co qui est tr&#232;s productif sur des noms d&#8217;agent (typiquement suffix&#233;s en 
&#8211;(t)ore). (Iacobini, 2004) cite &#233;galement les adjectifs en -bile qui sont fr&#233;quemment pr&#233;fix&#233;s 
en in. Le corollaire de cette derni&#232;re remarque est qu&#8217;un grand nombre de noms en -it&#224;
(suffixation nominale des adjectifs en -bile) sont &#233;galement pr&#233;fix&#233;s en in (comme 
inconciliabilit&#224;, indisponibilit&#224;).
</p>
<p>De plus, la pr&#233;fixation permet la formation d&#8217;adjectifs sur des bases nominales, qui prennent 
la forme de l&#8217;adjectif relationnel correspondant. En fran&#231;ais, par exemple, anticanc&#233;reux est
form&#233; sur canc&#233;reux, qui est l&#8217;adjectif relationnel de cancer. M&#234;me si s&#233;mantiquement la base 
du mot construit est le nom qui est &#224; la base de l&#8217;adjectif (anticanc&#233;reux = contre le cancer et
non pas contre les canc&#233;reux), la forte r&#233;gularit&#233; de ce type de construction nous permet de 
consid&#233;rer la base comme un adjectif relationnel (ind&#233;pendamment du calcul s&#233;mantique 
n&#233;cessaire &#224; l&#8217;interpr&#233;tation du mot construit). Les adjectifs relationnels sont eux aussi des 
mots construits sur des bases nominales, &#224; l&#8217;aide de suffixes typiques de ce genre de 
formation. Il est donc int&#233;ressant de contraindre les bases analys&#233;es en fonction des suffixes 
types de la formation d&#8217;adjectifs relationnels. Pour l&#8217;italien, les suffixes typiques de formation 
des adjectifs relationnels sont : -ale, -are, -ario, -ano, -ico, -ile, -ino, -ivo, -orio, -esco, -asco, 
-iero, -izio, -aceo (Wandruszka, 2004). Comme nous travaillons sur des cha&#238;nes de caract&#232;res, 
il faut &#233;videmment d&#233;cupler ces suffixes en fonction de chaque flexion de genre et de nombre 
(-ino, -ina, -ini, -ine).
</p>
<p>Ainsi, pour certains pr&#233;fixes impl&#233;ment&#233;s jusqu&#8217;&#224; pr&#233;sent dans notre analyseur, nous avons pu 
contraindre les r&#232;gles avec les indices suivants : (a) les indices d&#8217;adjectif relationnel pour les 
pr&#233;fixes inter, multi, poli, post, et trans ; (b) les indices de noms d&#8217;action (-zione, -mento)
pour les pr&#233;fixes co, retro et ri ; (c) les indices de noms d&#8217;agent (-(t)ore) pour le pr&#233;fixe co, et
enfin, (d) les indices d&#8217;adjectifs en -bile et de noms en -it&#224; pour le pr&#233;fixe in. Evidemment, la 
validit&#233; de ces contraintes doit &#234;tre v&#233;rifi&#233;e sur une large &#233;chelle, v&#233;rification que nous 
pr&#233;sentons ci-dessous. 
</p>
<p>4 &#201;valuation de l&#8217;analyse morphologique des mots inconnus 
Nous l&#8217;avons dit, la plupart des recherches qui exploitent les propri&#233;t&#233;s morphologiques pour 
r&#233;soudre le probl&#232;me des mots inconnus construits n&#8217;&#233;valuent que le produit final (la 
couverture lexicale de leur analyseur) ou la vitesse de traitement. Tr&#232;s peu s&#8217;int&#233;ressent aux 
gains, et aux erreurs suppl&#233;mentaires que de telles r&#232;gles peuvent engendrer. Dans cette 
</p>
<p>63</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno CARTONI
</p>
<p>section, nous proposons une &#233;valuation de progression, qui permet d&#8217;appr&#233;hender l&#8217;impact de 
chacune des contraintes appliqu&#233;es sur les r&#232;gles. 
</p>
<p>4.1 Les questions d&#8217;&#233;valuation 
</p>
<p>L&#8217;objet de notre &#233;valuation est double. Premi&#232;rement, nous voulons &#233;valuer la performance 
de nos r&#232;gles avec contraintes, c'est-&#224;-dire le pourcentage d&#8217;analyses correctes apr&#232;s l&#8217;ajout de 
chaque contrainte. Id&#233;alement, l&#8217;ajout de chaque contrainte devrait augmenter la performance 
de la r&#232;gle. Le but ultime de chaque r&#232;gle est de tendre vers une performance maximale, car 
une r&#232;gle qui traite les mots inconnus ne devrait pas fournir d&#8217;analyse incorrecte (et g&#233;n&#233;rer 
ainsi plus de bruit que le silence qu&#8217;elle r&#233;duit). Deuxi&#232;mement, nous voulons mesurer plus 
finement les gains de chaque contrainte (les vrais positifs) par rapport aux nombres de 
&#171; pertes &#187; provoqu&#233;es par celle-ci, c&#8217;est-&#224;-dire le nombre de mots construits &#171; corrects &#187; mais 
exclus &#224; cause de l&#8217;application de la contrainte (les &#171; faux n&#233;gatifs &#187;). 
</p>
<p>Pour &#233;valuer l&#8217;impact de ces contraintes sur la performance globale de la r&#232;gle, nous utilisons 
comme score minimal (la baseline) la performance de la r&#232;gle contrainte, telle qu&#8217;elle est 
pr&#233;sent&#233;e &#224; la figure 1, section 3. Dans l&#8217;&#233;valuation plus pr&#233;cise des gains et des pertes, nous 
cherchons &#224; nous approcher des 100% d'analyse correcte pour les &#171; vrais positifs &#187;. 
</p>
<p>Pour mener &#224; bien l&#8217;&#233;valuation, il faut &#233;galement d&#233;cider quelle est la bonne r&#233;ponse, la 
r&#233;ponse attendue. En morphologie constructionnelle, et peut-&#234;tre encore d&#8217;avantage en 
n&#233;ologie, il est parfois tr&#232;s difficile de dire si un mot est construit ou non. Comme le 
soulignent (Schmid et al., 2004) &#224; propos des analyseurs morphologiques de l&#8217;allemand, 
&#171; there is no general agreement yet about what constitutes the correct analyses &#187;. Pour notre 
part, nous consid&#233;rons qu&#8217;une analyse est correcte quand la base et le pr&#233;fixe sont trouv&#233;s 
pour un mot r&#233;ellement construit. La difficult&#233; de d&#233;cider de la bonne analyse d&#233;pend de 
plusieurs facteurs, et notamment la connaissance approfondie de la r&#232;gle de pr&#233;fixation. Cette 
t&#226;che est d&#8217;autant plus complexe que les descriptions th&#233;oriques sur les pr&#233;fixes de l&#8217;italien ne 
prennent pas forc&#233;ment en consid&#233;ration tous les cas de figure, et que l&#8217;italien semble &#234;tre une 
langue tr&#232;s flexible morphologiquement (nous y reviendrons). 
</p>
<p>Pratiquement, pour &#233;valuer notre analyseur et ses contraintes, nous lui avons soumis une liste 
de mots inconnus de notre lexique de r&#233;f&#233;rence qui commencent par les m&#234;mes s&#233;quences de 
lettres que les pr&#233;fixes &#233;tudi&#233;s. Ces mots ont &#233;t&#233; extraits d&#8217;un important corpus journalistique 
de l&#8217;italien (Baroni et al., 2004, - environ 380 millions d&#8217;occurrences). Les occurrences 
analys&#233;es ont ensuite &#233;t&#233; r&#233;duites en formes uniques. Finalement, chaque forme a &#233;t&#233; &#233;valu&#233;e 
manuellement pour distinguer les mots construits de ceux qui ne l&#8217;&#233;taient pas.  
</p>
<p>4.2 &#201;valuation des r&#232;gles sans contrainte 
</p>
<p>L&#8217;&#233;valuation de la performance de l&#8217;ensemble des r&#232;gles impl&#233;ment&#233;es jusqu&#8217;&#224; pr&#233;sent dans 
notre analyseur permet d&#8217;obtenir un score de r&#233;f&#233;rence (baseline) pour le reste de 
l&#8217;&#233;valuation. Comme le montre le tableau 1, l&#8217;analyse par cet ensemble de r&#232;gles a une 
performance tout &#224; fait honorable. Mais, en distinguant les formes pr&#233;fix&#233;es avec trait d&#8217;union 
de celles qui ne le sont pas, nous remarquons que les r&#232;gles sont beaucoup moins 
performantes quand il n&#8217;y a pas de trait d&#8217;union. 
</p>
<p>64</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;gler les r&#232;gles d&#8217;analyse morphologique 
</p>
<p>mots concern&#233;s analyses correctes analyses incorrectes 
</p>
<p>avec trait d&#8217;union 2839 2833 (99,79 %) 6 (0,21 %) 
</p>
<p>sans trait d&#8217;union 10191 8962 (87,94 %) 1229 (12,05 %) 
</p>
<p>total 13030 11795 (90,52 %) 1235 (9,48 %) 
</p>
<p>Tableau 1 : &#201;valuation des r&#232;gles sans contrainte 
</p>
<p>Notons &#233;galement que la performance n&#8217;est pas uniforme entre les r&#232;gles et d&#233;pend beaucoup 
du pr&#233;fixe concern&#233;. Ainsi, les pr&#233;fixes courts ont plus tendance &#224; se retrouver dans des 
s&#233;quences de lettres ambigu&#235;s. Par exemple, la r&#232;gle pour le pr&#233;fixe pro a une performance de 
42 %, alors que la r&#232;gle de iper a une performance de 98,29 %. Pour la suite de l&#8217;exp&#233;rience, 
nous avons pris en compte uniquement les r&#232;gles de pr&#233;fixation sans trait d&#8217;union, &#233;tant donn&#233; 
leur faible performance. 
</p>
<p>4.3 &#201;valuation de la r&#232;gle avec contrainte de cat&#233;gorie 
</p>
<p>Globalement, la mise en place de la contrainte de cat&#233;gorie sur l&#8217;ensemble des r&#232;gles permet 
d&#8217;am&#233;liorer l&#233;g&#232;rement la performance de toutes les r&#232;gles. Ainsi, d&#8217;une performance globale 
de 87,94 % d&#8217;analyses correctes, nous passons &#224; 89,00 %, m&#234;me si cette variation est 
diff&#233;rente dans chaque r&#232;gle. De plus, le nombre de vrais positifs est acceptable, comme le 
montre le tableau 2.  
</p>
<p>total vrais positifs faux positifs 
</p>
<p>analys&#233;s 9955 8898 (89,38 %) 1057 (10,62 %) 
</p>
<p>total faux n&#233;gatifs vrais n&#233;gatifs 
</p>
<p>pas analys&#233;s 238 64 (26,89 %) 174 (73,11 %) 
</p>
<p>Tableau 2 : Ensemble des r&#232;gles d&#8217;analyse avec contrainte de cat&#233;gorie 
</p>
<p>Il nous faut &#233;galement noter que le nombre de mots r&#233;ellement pr&#233;fix&#233;s mais exclus par les 
r&#232;gles (les faux n&#233;gatifs) est relativement important. Mais ce ph&#233;nom&#232;ne varie &#233;galement 
beaucoup selon les r&#232;gles. Par exemple, pour la r&#232;gle de pr&#233;fixation en inter, nous avions 
analys&#233; 505 mots, dont 398 &#233;taient r&#233;ellement des mots construits (performance globale = 
78,81 %). L&#8217;application de la contrainte cat&#233;gorielle sur les trois principales cat&#233;gories 
lexicales permet d&#8217;exclure des s&#233;quences de lettres qui avaient &#233;t&#233; analys&#233;es avec une base 
n&#8217;appartenant pas &#224; l&#8217;une de ces trois cat&#233;gories et qui &#233;taient en fait des mots erron&#233;s. Le 
nombre de mots mal analys&#233;s a alors diminu&#233;, permettant d&#8217;augmenter la performance 
globale de la r&#232;gle. Le pourcentage de vrais positifs s&#8217;&#233;l&#232;ve alors &#224; 79,5 %, sans pour autant 
exclure des mots r&#233;ellement construits (0% de faux n&#233;gatifs). Dans ce cas, l&#8217;application de la 
contrainte, m&#234;me si elle n&#8217;augmente pas significativement la performance, n&#8217;exclut pas non 
plus de mots corrects. 
</p>
<p>En revanche, avec le pr&#233;fixe multi, nous avons contraint la cat&#233;gorie de la base aux seuls 
noms et adjectifs, comme nous l&#8217;indique la pr&#233;sentation linguistique faite par 
</p>
<p>65</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno CARTONI
</p>
<p>(Iacobini, 2004). Or, l&#8217;application abrupte de ce pr&#233;cepte linguistique provoque l&#8217;exclusion de 
dix formes qui &#233;taient r&#233;ellement des mots construits. Notre lexique avait analys&#233; leur base 
comme &#233;tant des verbes, alors qu&#8217;il s&#8217;agissait de participes pass&#233;s employ&#233;s comme adjectifs. 
Il convient par cons&#233;quent d&#8217;&#234;tre particuli&#232;rement prudent avec l&#8217;application de certaines 
&#171; normes &#187; linguistiques et leur ad&#233;quation avec les descriptions linguistiques disponibles. 
</p>
<p>Cette question de &#171; prescription &#187; th&#233;orique se retrouve dans le cas particulier du pr&#233;fixe mini,
pour lequel les &#233;tudes morphologiques nous indiquent qu&#8217;il ne s&#8217;accole qu&#8217;&#224; des noms pour 
former des noms (RCM(mini) : X/NOM = MINI[Y/NOM]). Nous avons donc exclu 
toutes les analyses proposant une base non-nominale. Or, si la contrainte de cat&#233;gorie permet 
d&#8217;obtenir 98,7 % de vrais positifs, elle exclut de l&#8217;analyse 22 formes qui sont en fait des mots 
construits (des faux n&#233;gatifs). Si ce silence est d&#251; en partie &#224; des mots qui n&#8217;avaient pas une 
base reconnue comme nom par notre lexique de r&#233;f&#233;rence, alors qu&#8217;elle aurait due l&#8217;&#234;tre 
(comme dans un miniporno, o&#249; porno est uniquement enregistr&#233; comme adjectif), une autre 
partie concerne des constructions qui ne sont pas nominales (minigeografica, miniatomica).
La question est de savoir ici comment consid&#233;rer ces formations. S&#8217;agit-il de nouveaux 
emplois du pr&#233;fixe selon un usage qui n&#8217;est pas encore enregistr&#233; par les &#233;tudes 
linguistiques ? Cette question renvoie &#224; un plus large d&#233;bat du TALN actuel qui &#171; s&#8217;articule 
d&#233;sormais entre les r&#232;gles postul&#233;es et les r&#233;gularit&#233;s observ&#233;es &#187; (Habert et Zweigenbaum, 
2002, p. 99). 
</p>
<p>Nous venons de montrer que l&#8217;ajustement des r&#232;gles d&#8217;analyse peut am&#233;liorer leur 
performance, mais que les pr&#233;ceptes linguistiques ne doivent pas forc&#233;ment &#234;tre pris en 
compte de mani&#232;re aveugle, et qu&#8217;une &#233;valuation, m&#234;me partielle, doit en tous les cas &#234;tre 
effectu&#233;e &#224; chaque nouveau r&#233;glage. 
</p>
<p>4.4 &#201;valuation de la contrainte de l&#8217;indice de constructivit&#233; 
</p>
<p>Concernant l&#8217;indice de constructivit&#233; des adjectifs relationnels, la performance globale de la 
r&#232;gle diminue fortement - 79,37 % alors que la performance pour les r&#232;gles sur bases 
adjectivales avant l&#8217;application de la contrainte &#233;tait de 91,38 %. En revanche, comme le 
montre le tableau 3, l&#8217;application de cette contrainte sur les r&#232;gles de pr&#233;fixation &#233;tudi&#233;es 
(multi, poli, post, trans et inter) permet d&#8217;obtenir une proportion importante de vrais positifs. 
</p>
<p>total vrais positifs faux positifs 
</p>
<p>analys&#233;s 680 652 (95,88 %) 28 (4,12 %) 
</p>
<p>total faux n&#233;gatifs vrais n&#233;gatifs 
</p>
<p>pas analys&#233;s 202 154 (76,23 %) 48 (23,77 %) 
</p>
<p>Tableau 3 : R&#232;gles d'analyse avec l'indice de constructivit&#233; 
</p>
<p>Si le pourcentage de vrais positifs augmente vraiment, le pourcentage de faux n&#233;gatifs est tr&#232;s 
important (ce qui explique la mauvaise performance globale de la r&#232;gle) et pourrait remettre 
en cause l&#8217;application d&#8217;une telle contrainte. Toutefois, une analyse minutieuse des faux 
n&#233;gatifs, nous permet, empiriquement cette fois, d&#8217;individualiser un certain nombre de 
constructions typiques semblant favoriser certaines pr&#233;fixations (comme les mots suffix&#233;s en 
&#8211;ista et en -ismo tr&#232;s fr&#233;quemment pr&#233;fix&#233;s en pro). De ce constat linguistique, nous passons 
</p>
<p>66</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;gler les r&#232;gles d&#8217;analyse morphologique 
</p>
<p>alors &#224; des constats qui rel&#232;vent davantage d&#8217;intuitions de r&#233;gularit&#233;, mais qui sont sans doute 
valables et qui peuvent donc &#234;tre ajout&#233;es aux contraintes. Evidemment, de telles intuitions 
devraient &#234;tre &#233;valu&#233;es sur un second corpus. 
</p>
<p>Concernant les autres indices de constructivit&#233; (sur les noms d&#233;verbaux ou sur les adjectifs en 
-bile et les noms en -t&#224;), le pourcentage de vrais positifs est tr&#232;s &#233;lev&#233;, comme le r&#233;sume le 
tableau 4. 
</p>
<p>r&#232;gle sans indice indice de constructivit&#233; r&#232;gle avec indice 
</p>
<p>in + adj 93,14 % -bile 100 % 
</p>
<p>in + nom  86,70 % -t&#224; 100 % 
</p>
<p>co + nom  69,48 % -(t)ore | -zione | -mento 96 % 
</p>
<p>retro + nom  90 %  -zione | -mento 100%
</p>
<p>ri + nom  91,21 % -zione | -mento 99,65 % 
</p>
<p>Tableau 4 :Performance des r&#232;gles avec et sans indice de constructivit&#233; 
</p>
<p>Cependant, le nombre de mots exclus par cette contrainte est, on s&#8217;en doute, extr&#234;mement 
important. En effet, la contrainte exclut &#224; chaque fois plus de la moiti&#233; des mots commen&#231;ant 
par la s&#233;quence de lettres concern&#233;e, et parmi eux, entre 50 % et 80 % sont r&#233;ellement 
construits, ce qui peut &#233;videmment remettre en cause la contrainte de l&#8217;indice de 
constructivit&#233;. Il faut n&#233;anmoins souligner la performance quasi-optimale des r&#232;gles ainsi 
contraintes et donc l&#8217;extr&#234;me fiabilit&#233; de l&#8217;analyse produite pour les vrais positifs. 
</p>
<p>5 Discussion et conclusion 
Nous avons montr&#233; que de nombreux moyens linguistiques peuvent &#234;tre mis en place pour 
am&#233;liorer la performance des r&#232;gles d&#8217;analyse des mots construits. Evidemment, des &#233;tudes 
plus approfondies, tant linguistiques qu&#8217;empiriques, permettraient de d&#233;couvrir d&#8217;autres 
contraintes plus fines pour r&#233;gler nos r&#232;gles. Nous avons &#233;galement montr&#233; que pour certaines 
r&#232;gles, les indices de constructivit&#233; permettaient d&#8217;atteindre une performance maximale. 
</p>
<p>Si toutes ces contraintes augmentent la performance de l&#8217;analyse, nous avons &#233;galement vu 
qu&#8217;il fallait regarder de plus pr&#232;s toutes les cons&#233;quences de l&#8217;application de ces contraintes. 
Parfois, nous avons observ&#233; que les &#233;tudes linguistiques ne sont pas toujours des sources 
pertinentes pour la mise en place de ces contraintes, surtout face &#224; la cr&#233;ativit&#233; langagi&#232;re. 
Nous avons &#233;galement montr&#233; que si certaines contraintes permettent une am&#233;lioration 
consid&#233;rable de la performance de la r&#232;gle, elles excluent aussi beaucoup de bonnes analyses. 
Il est alors important de resituer les objectifs du syst&#232;me pour d&#233;cider si la perte est plus 
dommageable que les gains acquis. Dans cette &#233;tude, l&#8217;application des contraintes permet 
d&#8217;obtenir une performance maximale (100 % de vrais positifs corrects), ce qui, dans notre 
projet de traduction automatique, est une condition n&#233;cessaire &#224; la poursuite du traitement du 
mot inconnu. Et les pertes importantes (les faux n&#233;gatifs) peuvent &#234;tre ici consid&#233;r&#233;es comme 
un statu quo par rapport &#224; leur condition initiale de mots inconnus. 
</p>
<p>67</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno CARTONI
</p>
<p>R&#233;f&#233;rences
ARONOFF M. (1976) Word Formation in Generative Grammar. Cambridge, The MIT press
</p>
<p>BARONI M., BERNARDINI S., COMASTRI F., PICCIONI L, VOLPI A., ASTON G., MAZZOLENI M,
(2004). Introducing the &quot;la Repubblica&quot; corpus: A large, annotated, TEI(XML)-compliant 
corpus of newspaper Italian. Acte de LREC 2004, 1771-1774. 
</p>
<p>BYRD R. J. (1983). Word Formation in Natural Language Processing Systems IJCAI, 704-
706.
</p>
<p>BYRD, R. J., KLAVANS J. L., ARONOFF M., ANSHEN F., (1989). Computer methods for 
morphological analysis. Actes de 24th ACL, 120-127. 
</p>
<p>CARTONI B. (2005). Traduction de r&#232;gles de construction des mots pour r&#233;soudre les 
probl&#232;mes d'incompl&#233;tude lexicale en traduction automatique &#201;tude de cas. Actes de 
RECITAL 2005, 565-574. 
</p>
<p>CARTONI B. (2006). Dealing with unknown words by simple decomposition: feasibility 
studies with Italian prefixes. Actesde LREC 2006, 1674-1677. 
</p>
<p>GRABAR N., TRIBOUT D, DAL G., FRADIN F., HATHOUT N, LIGNON S., NAMER F., PLANCQ C.,
YVON F., ZWEIGENBAUM P. (2006). Productivit&#233; quantitative des suffixations par -it&#233; et -Able 
dans un corpus journalistique moderne. Actes de  TALN 2006, 167-175. 
</p>
<p>GUILBAUD J.-P., BOITET C. (1997). Comment rendre une morphologie robuste du fran&#231;ais 
encore plus robuste en traitant finement les mots inconnus avec les donn&#233;es disponibles. 
Actes de TALN&#8217;97,
</p>
<p>HABERT B., ZWEIGENBAUM P. (2002) R&#233;gler les r&#232;gles. TAL 43(3) 83-105. 
</p>
<p>IACOBINI C. (2004). I prefissi. in La formazione delle parole in italiano. Grossmann M, 
Rainer F, (&#233;ds). T&#252;bingen, Niemeyer: 99-163. 
</p>
<p>Krott A., Schreuder R., Baayen R. H. (1999) Complex Words in Complex Words Linguistics
37(5), 905-926 
</p>
<p>NAMER F. (2003). Productivit&#233; morphologique, repr&#233;sentativit&#233; et complexit&#233; de la base: le 
syst&#232;me moQu&#234;te. Langue fran&#231;aise 140, 79-101
</p>
<p>PETITPIERRE D., RUSSEL G, (1995). Mmorph, The Multext Morphology. Gen&#232;ve, Issco 
(Technical Report). 
</p>
<p>SCHMID H., FITSCHEN A, HEID U. (2004). SMOR: A German Computational Morphology 
Covering Derivation, Composition, and Inflection. Actes de LREC 2004 1263-1266 
</p>
<p>WANDRUSZKA U. (2004). Derivazione aggettivale in La Formazione delle Parole in Italiano
Grossman M, Rainer F (&#233;ds) T&#252;bingen, Niemeyer. 
</p>
<p>WOODS W. A. (2000). Aggressive morphology for robust lexical coverage. Actes de Applied
natural language processing 
</p>
<p>68</p>

</div></div>
</body></html>