<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;laboration automatique d&#8217;un dictionnaire de cooccurrences grand public</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>&#201;laboration automatique 
d&#8217;un dictionnaire de cooccurrences grand public
</p>
<p>Simon CHAREST, &#201;ric BRUNELLE, Jean FONTAINE, Bertrand PELLETIER
Druide informatique inc. 
</p>
<p>1435, rue St-Alexandre, bureau 1040 
Montr&#233;al (Qu&#233;bec) H3A 2G4, Canada 
developpement@druide.com
</p>
<p>R&#233;sum&#233;. Antidote RX, un logiciel d&#8217;aide &#224; la r&#233;daction grand public, comporte un 
nouveau dictionnaire de 800 000 cooccurrences, &#233;labor&#233; essentiellement automatiquement. 
Nous l&#8217;avons cr&#233;&#233; par l&#8217;analyse syntaxique d&#233;taill&#233;e d&#8217;un vaste corpus et par la s&#233;lection 
automatique des cooccurrences les plus pertinentes &#224; l&#8217;aide d&#8217;un test statistique, le rapport de 
vraisemblance. Chaque cooccurrence est illustr&#233;e par des exemples de phrases &#233;galement tir&#233;s 
du corpus automatiquement. Les cooccurrences et les exemples extraits ont &#233;t&#233; r&#233;vis&#233;s par des 
linguistes. Nous examinons les choix d&#8217;interface que nous avons faits pour pr&#233;senter ces 
donn&#233;es complexes &#224; un public non sp&#233;cialis&#233;. Enfin, nous montrons comment nous avons 
int&#233;gr&#233; les cooccurrences au correcteur d&#8217;Antidote pour am&#233;liorer ses performances. 
</p>
<p>Abstract. Antidote is a complete set of software reference tools for writing French that 
includes an advanced grammar checker. Antidote RX boasts a new dictionary of 800,000 co-
occurrences created mostly automatically. The approach we chose is based on the syntactic 
parsing of a large corpus and the automatic selection of the most relevant co-occurrences 
using a statistical test, the log-likelihood ratio. Example sentences illustrating each co-
occurrence in context are also automatically selected. The extracted co-occurrences and 
examples were revised by linguists.  We examine the various choices that were made to 
present this complex data to a non-specialized public. We then show how we use the co-
occurrence data to improve the performance of Antidote&#8217;s grammar checker. 
</p>
<p>Mots-cl&#233;s : antidote, cooccurrences, collocations, corpus, analyseur, correcteur.
Keywords: antidote, co-occurrences, collocations, corpus, parser, grammar checker. 
</p>
<p>1 Introduction
Antidote RX est la sixi&#232;me &#233;dition d&#8217;Antidote, un logiciel d&#8217;aide &#224; la r&#233;daction d&#233;velopp&#233; et 
commercialis&#233; par la soci&#233;t&#233; Druide informatique. Antidote RX comporte un correcteur 
grammatical avanc&#233;, dix dictionnaires de consultation et dix guides linguistiques. Parmi les 
dix dictionnaires de l&#8217;&#233;dition RX figure un nouveau dictionnaire de cooccurrences, constitu&#233; 
essentiellement automatiquement au moyen d&#8217;outils de traitement de la langue &#224; couverture 
large. Le dictionnaire de cooccurrences d&#8217;Antidote a la particularit&#233; d&#8217;&#234;tre destin&#233; au grand 
public, pour qui il &#233;tablira souvent le premier contact avec la notion de cooccurrence. 
</p>
<p>283</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Simon CHAREST, &#201;ric BRUNELLE, Jean FONTAINE, Bertrand PELLETIER
</p>
<p>Par cooccurrence, nous entendons la pr&#233;sence simultan&#233;e et statistiquement significative, 
dans un corpus, de deux unit&#233;s linguistiques en relation syntaxique. Notre d&#233;finition 
correspond aux cooccurrences relationnelles d&#8217;Evert (2005), aussi appel&#233;es cooccurrences
syntaxiques, par opposition aux cooccurrences positionnelles, dont les mots apparaissent 
simplement fr&#233;quemment dans une certaine proximit&#233;. 
</p>
<p>Notre concept de cooccurrence englobe des combinaisons lexicales dont le degr&#233; de figement 
est variable : nous y incluons &#224; la fois des combinaisons libres (entendre un cri), des 
combinaisons semi-fig&#233;es ou collocations au sens strict (pousser un cri) et des locutions
fig&#233;es courantes (cri du c&#339;ur) ou terminologiques (cri primal).
</p>
<p>Comme Antidote comporte d&#233;j&#224; un dictionnaire de locutions, nous avions d&#8217;abord pens&#233; nous 
restreindre aux collocations, mais deux motifs nous ont incit&#233;s &#224; &#233;largir notre cible : 
</p>
<p>1. La fronti&#232;re entre collocation et locution fig&#233;e, d&#8217;une part, et entre collocation et 
combinaison libre, d&#8217;autre part, n&#8217;est pas toujours nette. Par exemple, dans certains 
cas limites, il n&#8217;est pas clair si une combinaison de mots acquiert vraiment un sens 
diff&#233;rent de la composition des sens de chacune de ses parties. 
</p>
<p>2. Pour obtenir la description la plus compl&#232;te possible de l&#8217;usage d&#8217;un mot, il nous est 
apparu plus int&#233;ressant de pr&#233;senter toutes les combinaisons les plus fortes de ce 
mot, incluant les locutions fig&#233;es et les combinaisons libres statistiquement 
significatives.
</p>
<p>Tutin (2005) examine l&#8217;int&#233;r&#234;t d&#8217;un dictionnaire de cooccurrences et constate les lacunes des 
dictionnaires g&#233;n&#233;ralistes en la mati&#232;re. Comme outil de consultation, un dictionnaire de 
cooccurrences &#233;num&#232;re les contextes d&#8217;usage d&#8217;un mot. En production de texte, il compl&#232;te le 
dictionnaire de synonymes pour retrouver le mot juste ou le tour idiomatique. Il aide enfin &#224; 
l&#8217;apprentissage du fran&#231;ais langue seconde, car les locutions et collocations, qui refl&#232;tent des 
emplois fig&#233;s ou semi-fig&#233;s, sont difficilement pr&#233;dictibles pour un locuteur &#233;tranger.
</p>
<p>Le dictionnaire de cooccurrences d&#8217;Antidote RX a &#233;t&#233; extrait automatiquement &#224; partir d&#8217;un 
corpus de 500 millions de mots. L&#8217;analyseur syntaxique de haut niveau d&#8217;Antidote a &#233;t&#233; mis &#224; 
contribution pour recenser plus de 17 millions de paires de mots li&#233;es par diverses relations 
syntaxiques. Les cooccurrences les plus significatives ont &#233;t&#233; d&#233;gag&#233;es &#224; l&#8217;aide d&#8217;un filtre 
statistique et d&#8217;une r&#233;vision manuelle. Le r&#233;sultat est un dictionnaire de 800 000 
cooccurrences illustr&#233;es par plus de 2 millions de phrases exemples tir&#233;es du corpus. &#192; notre 
connaissance, il s&#8217;agit du plus vaste dictionnaire de cooccurrences du fran&#231;ais &#224; ce jour. Le 
pr&#233;sent article d&#233;crit le processus d&#8217;&#233;laboration de ce dictionnaire. 
</p>
<p>2 Travaux ant&#233;rieurs 
Les dictionnaires de cooccurrences en fran&#231;ais sont peu nombreux. Un pionnier fut Ulysse 
Lacroix avec Les mots et les id&#233;es : dictionnaire des termes cadrant avec les id&#233;es, dont la 
premi&#232;re &#233;dition remonte &#224; 1931. Plus r&#233;cemment, le Dictionnaire des cooccurrences de 
Beauchesne (2001) recense environ 150 000 cooccurrences. Le site Web Dictionnaire des 
collocations de Rodriguez, lanc&#233; en 2004, affichait 31 400 combinaisons &#224; la fin de 2006. Ces 
trois dictionnaires ont &#233;t&#233; &#233;labor&#233;s &#224; partir d&#8217;une collecte manuelle des cooccurrences. Le 
Dictionnaire combinatoire du fran&#231;ais de Zingl&#233; et Brobeck-Zingl&#233; (2003) a &#233;t&#233; cr&#233;&#233; &#224; partir 
d&#8217;un corpus dont ont &#233;t&#233; tir&#233;es 65 000 expressions (34 000 en version imprim&#233;e). 
</p>
<p>284</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;laboration automatique d&#8217;un dictionnaire de cooccurrences grand public 
</p>
<p>Parmi les dictionnaires universitaires, mentionnons le Dictionnaire explicatif et combinatoire 
du fran&#231;ais contemporain (Mel'&#254;uk et coll., 1984, 1988, 1992, 1999), dont une version 
&#233;lectronique simplifi&#233;e d&#233;velopp&#233;e par Mel'&#254;uk et Polgu&#232;re peut &#234;tre consult&#233;e sur le site 
DiCou&#232;be. On peut aussi consulter, sur le site de l&#8217;&#201;quipe de recherche en syntaxe et 
s&#233;mantique (ERSS), la base lexicale distributionnelle Les voisins de Le Monde, construite 
automatiquement &#224; partir d&#8217;un corpus comprenant l&#8217;ensemble des articles du quotidien Le
Monde sur une p&#233;riode de dix ans (1991-2000), soit environ 200 millions de mots. 
</p>
<p>L&#8217;extraction automatique de cooccurrences &#224; partir d&#8217;un corpus a fait l&#8217;objet de nombreux 
articles. Plusieurs traitent de cooccurrences positionnelles, bas&#233;es sur la seule proximit&#233; des 
mots &#224; l&#8217;int&#233;rieur d&#8217;un intervalle donn&#233; (par ex. de 5 positions). Parmi les travaux qui 
mentionnent un traitement syntaxique, soulignons ceux de Lin (1998), qui utilise un parseur 
et filtre les cooccurrences en fonction de l&#8217;information mutuelle ; ceux de Kilgarriff et 
Tugwell (2001) pour Word Sketch, un module du Sketch Engine accessible en ligne, o&#249; les 
cooccurrences sont extraites du British National Corpus &#224; l&#8217;aide d&#8217;un &#233;tiqueteur et d&#8217;une 
grammaire de type pattern matching, puis filtr&#233;es selon une mesure int&#233;grant l&#8217;information 
mutuelle ; et enfin les travaux du Laboratoire d'Analyse et de Technologie du Langage 
(LATL) de l&#8217;Universit&#233; de Gen&#232;ve (Seretan, Wehrli, 2006), qui utilisent le parseur 
multilingue Fips et filtrent les r&#233;sultats en employant la mesure du rapport de vraisemblance. 
</p>
<p>3 M&#233;thodologie
</p>
<p>3.1 Constitution d&#8217;un corpus
</p>
<p>Le mat&#233;riau brut de notre dictionnaire &#233;tant un corpus, il est essentiel que celui-ci soit de 
grande taille, afin de refl&#233;ter un large &#233;ventail d&#8217;usage des mots, des plus fr&#233;quents aux plus 
rares. Il faut aussi varier les styles d&#8217;&#233;criture ainsi que les domaines des textes (voir Tableau
1). Nous r&#233;coltons en outre des &#233;crits de diverses r&#233;gions de la francophonie dans le but 
d&#8217;extraire des cooccurrences propres aux locuteurs de chacune de ces r&#233;gions. 
</p>
<p>Domaine Proportion Exemples de sources 
</p>
<p>Litt&#233;raire 30 % Gallica, Projet Gutenberg, Les &#201;ditions Qu&#233;bec Am&#233;rique 
</p>
<p>Journalistique 40 % Le Devoir, Voir, L&#8217;Express, Lib&#233;ration, La Tribune de Gen&#232;ve 
</p>
<p>Autres 30 % Wikip&#233;dia, CyberSciences, L&#233;giFrance, Universit&#233; de Montr&#233;al 
Tableau 1: principales sources du corpus 
</p>
<p>Le Web, mine quasi in&#233;puisable de textes de toute sorte, est la principale source de notre 
corpus. Mais le Web a aussi ses d&#233;fauts. Par exemple, il est fr&#233;quent de trouver des phrases 
qui apparaissent de mani&#232;re r&#233;currente dans plusieurs pages d&#8217;un m&#234;me site. On trouve aussi 
des phrases, provenant de citations ou de d&#233;p&#234;ches journalistiques, qui se retrouvent sur 
plusieurs sites diff&#233;rents, parfois telles quelles, parfois l&#233;g&#232;rement reformul&#233;es. Ces phrases 
r&#233;currentes faussent les statistiques de fr&#233;quence. Il a donc fallu identifier et &#233;liminer 
automatiquement les phrases identiques ou trop similaires. 
</p>
<p>Au final, nous avons constitu&#233; un corpus de 500 millions de mots, r&#233;partis sur 25 millions de 
phrases. C&#8217;est de ce mat&#233;riau brut que nous avons extrait nos cooccurrences. 
</p>
<p>285</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Simon CHAREST, &#201;ric BRUNELLE, Jean FONTAINE, Bertrand PELLETIER
</p>
<p>3.2 Extraction des cooccurrences
</p>
<p>L&#8217;analyseur d&#8217;Antidote, fruit de plus de 10 ann&#233;es de d&#233;veloppement intensif, reconnait un 
large &#233;ventail de structures syntaxiques du fran&#231;ais. Nous en avons cr&#233;&#233; une version adapt&#233;e, 
optimis&#233;e pour analyser en traitement distribu&#233; la masse &#233;norme du corpus et en extraire les 
cooccurrences. Sur une grappe de 15 ordinateurs utilisant la technologie de distribution XGrid 
d&#8217;Apple, il lui a fallu 1100 heures pour analyser les 500 millions de mots du corpus. 
</p>
<p>L&#8217;analyseur effectue une analyse en d&#233;pendance et g&#233;n&#232;re des arbres syntaxiques complets, 
desquels les cooccurrences sont extraites directement. Lorsque plusieurs analyses sont 
trouv&#233;es pour une m&#234;me phrase, l&#8217;arbre le plus probable, selon la pond&#233;ration de l&#8217;analyseur, 
est choisi. Nous avons s&#233;lectionn&#233; les relations syntaxiques les plus pertinentes pour un 
dictionnaire de cooccurrences (voir Tableau 2). Pour cette premi&#232;re version, nous n&#8217;avons 
consid&#233;r&#233; que les cooccurrences &#224; deux membres. 
</p>
<p>Categ 1 Categ 2 Relation Proportion Exemple
Nom Adjectif &#201;pith&#232;te 18 % jeune fille 
Nom Nom Apposition 1 % site internet 
Nom Nom/Verbe Compl&#233;ment du nom 25 % coup d&#8217;&#339;il 
Verbe Adverbe Modificateur 4 % aller loin 
Verbe Nom Sujet 12 % le vent souffle 
Verbe Nom Compl&#233;ment direct 10 % jouer un r&#244;le 
Verbe Nom Autres compl&#233;ments1 26 % perdre de vue 
Verbe Nom/Adj Attribut 1 % retenir prisonnier 
Verbe Verbe Compl&#233;ment verbal 1 % entendre parler 
</p>
<p>Adjectif Adverbe Modificateur 1 % gravement malade 
Adjectif Nom Compl&#233;ment de l&#8217;adjectif 1 % &#226;g&#233; de x ans 
</p>
<p>Tableau 2 : principales relations extraites 
</p>
<p>Au-del&#224; des relations syntaxiques directes, le syst&#232;me s&#8217;efforce d&#8217;extraire des cooccurrences 
en franchissant des relations plus profondes. Par exemple : 
</p>
<p>x Coordinations : &#171; De temps en temps cette clameur et ce bruit redoublaient. &#187; &#198; la
clameur redouble ; le bruit redouble
</p>
<p>x Relatives : &#171; Or, sa r&#233;ouverture est cruciale pour acheminer l&#8217;aide humanitaire dont a
d&#233;sesp&#233;r&#233;ment besoin la population. &#187; &#198; avoir besoin d&#8217;aide
</p>
<p>x Agents : &#171; Nous laissons &#224; nos lecteurs le soin de deviner quel genre de surprise cette 
chute apporterait aux habitants. &#187; &#198; le lecteur devine
</p>
<p>1 Les &#171; autres compl&#233;ments &#187; incluent les compl&#233;ments indirects (COI) et les compl&#233;ments adverbiaux ou 
circonstanciels. 
</p>
<p>286</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;laboration automatique d&#8217;un dictionnaire de cooccurrences grand public 
</p>
<p>x Collectifs : &#171; Il a ouvert une infinit&#233; de routes, toutes raboteuses, qu&#8217;il a fallu ensuite 
aplanir. &#187; &#198; ouvrir la route
</p>
<p>Nous avons consid&#233;r&#233; certaines locutions verbales fig&#233;es (p. ex. faire face, laisser place,
avoir besoin) comme des verbes &#224; part enti&#232;re, ce qui nous a permis d&#8217;extraire des 
cooccurrences comme faire face aux d&#233;fis, laisser place au doute et avoir besoin d&#8217;aide.
</p>
<p>Outre les deux mots formant la cooccurrence, nous notons certaines donn&#233;es morpho-
syntaxiques qui d&#233;finissent la distribution de ses emplois. Nous retenons ainsi, pour chaque 
cooccurrence, les types des d&#233;terminants, le genre et le nombre de chaque mot, et la position 
relative de ceux-ci. Ces donn&#233;es d&#233;terminent la formulation la plus fr&#233;quente de la 
cooccurrence, qui sera utilis&#233;e notamment pour l&#8217;affichage. 
</p>
<p>Au total, plus de 17 millions de cooccurrences distinctes ont &#233;t&#233; extraites, chacune 
apparaissant en moyenne 4 fois dans le corpus. 
</p>
<p>3.3 S&#233;lection des cooccurrences
</p>
<p>3.3.1 S&#233;lection automatique 
</p>
<p>Un test statistique permet de faire un premier tri des cooccurrences. Le test le plus simple 
serait d&#8217;utiliser directement les fr&#233;quences, en ne retenant que les cooccurrences d&#8217;une 
fr&#233;quence minimale donn&#233;e. Mais un tel test peut difficilement s&#8217;appliquer &#224; l&#8217;ensemble des 
mots d&#8217;une langue, car les fr&#233;quences varient &#233;norm&#233;ment d&#8217;un mot &#224; l&#8217;autre. Plusieurs autres 
mesures d&#8217;association ont toutefois &#233;t&#233; propos&#233;es pour quantifier la force d&#8217;une combinaison 
de mots, dont le rapport de vraisemblance (log-likelihood ratio), l&#8217;information mutuelle, le 
test t et le test du khi-carr&#233;. Pour une description approfondie de diverses mesures 
d&#8217;association, voir (Evert, 2005), Manning &amp; Sch&#252;tze (1999) ou Dunning (1993). 
</p>
<p>Selon Dunning (1993), l&#8217;information mutuelle et le test t ont tendance &#224; surestimer la force 
des combinaisons de faible fr&#233;quence ou dont un des composants est rare. En revanche, le 
rapport de vraisemblance s&#8217;appuie sur des fondements statistiques solides pour comparer 
directement l&#8217;importance d&#8217;&#233;v&#232;nements rares et d&#8217;&#233;v&#232;nements fr&#233;quents. De plus, selon 
Orliac (2004), il s&#8217;agit de la mesure la plus apte &#224; isoler les collocations d&#8217;un ensemble de 
combinaisons. Pour ces raisons, nous avons choisi le rapport de vraisemblance comme mesure 
de la force de nos cooccurrences. 
</p>
<p>Nous l&#8217;avons mentionn&#233; &#224; la section 3.1, la diversit&#233; du corpus a un impact direct sur les 
cooccurrences extraites. Lors de nos premiers essais, certaines cooccurrences &#224; priori peu 
int&#233;ressantes mais pr&#233;sentant une valeur de force anormalement &#233;lev&#233;e provenaient souvent 
d&#8217;un seul et m&#234;me texte ou site Web. Nous avons d&#251; &#233;laborer une euristique pour tenir 
compte de la dispersion d&#8217;une combinaison &#224; travers plusieurs sources. Plut&#244;t que la 
fr&#233;quence brute, nous employons la somme des racines carr&#233;es des fr&#233;quences pour chaque 
source. Ainsi, une combinaison apparaissant 9 fois dans une m&#234;me source aura le m&#234;me poids 
que si elle apparaissait une fois dans 3 sources distinctes. 
</p>
<p>Apr&#232;s avoir calcul&#233; la force des combinaisons candidates, nous avons filtr&#233; les moins 
int&#233;ressantes en fixant empiriquement un seuil pour chaque type de relation syntaxique. Cet 
ensemble de seuils a ainsi retranch&#233; 93,5 % des 17 millions de cooccurrences extraites. De 
</p>
<p>287</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Simon CHAREST, &#201;ric BRUNELLE, Jean FONTAINE, Bertrand PELLETIER
</p>
<p>plus, les cooccurrences de fr&#233;quence 1 (apax) et celles form&#233;es de mots banals, comme le 
verbe &#171; &#234;tre &#187; et certains adverbes (&#171; tr&#232;s &#187;, &#171; trop &#187;&#8230;), ont &#233;t&#233; filtr&#233;es automatiquement, 
retirant un autre 1,5 %. Au total, la s&#233;lection automatique retient donc un peu plus de 850 000 
cooccurrences &#171; brutes &#187;. 
</p>
<p>3.3.2 R&#233;vision manuelle 
</p>
<p>Les cooccurrences brutes ont ensuite fait l&#8217;objet d&#8217;une r&#233;vision &#171; manuelle &#187; par des 
linguistes, afin de v&#233;rifier la qualit&#233; des r&#233;sultats et de rejeter les cooccurrences jug&#233;es 
ind&#233;sirables. Ces rejets concernent : 
</p>
<p>x Des cooccurrences mal analys&#233;es : des phrases complexes peuvent donner du fil &#224; 
retordre &#224; l&#8217;analyseur et lui faire g&#233;n&#233;rer des analyses incorrectes. Par exemple, 
pr&#233;sident du tr&#233;sor, mauvaise analyse de pr&#233;sident du Conseil du tr&#233;sor.
</p>
<p>x Des cooccurrences incompl&#232;tes : l&#8217;extracteur ne consid&#233;rant que deux mots 
principaux par cooccurrence, il lui arrive de g&#233;n&#233;rer une cooccurrence incompl&#232;te 
comme emploi &#224; temps, &#224; laquelle il manque un adjectif essentiel (plein ou partiel).
Parfois, le linguiste peut y rem&#233;dier en ins&#233;rant manuellement certains &#233;l&#233;ments 
r&#233;currents (nager en d&#233;lire &gt; nager en plein d&#233;lire) ou paires binaires de tels 
&#233;l&#233;ments (blague de gout &gt; blague de bon/mauvais gout).
</p>
<p>x Des cooccurrences peu int&#233;ressantes : certaines cooccurrences offrent peu d&#8217;int&#233;r&#234;t 
pour un dictionnaire malgr&#233; leur relative fr&#233;quence. Par exemple, des combinaisons 
libres avec un gentil&#233; (ambassadeur am&#233;ricain, fran&#231;ais, etc.), ou un verbe de sens 
tr&#232;s g&#233;n&#233;rique (avoir un chien, un livre, etc.). 
</p>
<p>x Des cooccurrences d&#233;licates : cooccurrences de caract&#232;re offensant, expressions de 
registre vulgaire, anglicismes condamn&#233;s par Antidote, etc.  
</p>
<p>Un autre objet de la r&#233;vision humaine est de v&#233;rifier la formulation choisie de mani&#232;re 
automatique et de rectifier, le cas &#233;ch&#233;ant, certains attributs morphosyntaxiques. Par exemple, 
le linguiste peut remplacer un article par un possessif (rencontrer sur le passage &gt; rencontrer
sur son passage), ins&#233;rer une n&#233;gation (la pluie discontinue &gt; la pluie ne discontinue pas),
modifier le genre (abandonn&#233; par son mari &gt; abandonn&#233;e par son mari), etc. 
</p>
<p>Apr&#232;s huit mois de r&#233;vision, 5 % seulement des cooccurrences ont ainsi &#233;t&#233; rejet&#233;es manuel-
lement. Nous obtenons donc 800 000 cooccurrences qui constituent le dictionnaire final. 
</p>
<p>3.4 Choix des exemples 
</p>
<p>Nous avons choisi d&#8217;illustrer chaque cooccurrence par des exemples r&#233;els tir&#233;s du corpus. Un 
algorithme vorace s&#233;lectionne un ensemble minimal de phrases qui serviront d&#8217;exemples. 
L&#8217;algorithme s&#8217;efforce de minimiser la longueur totale des phrases tout en maximisant leur 
&#171; qualit&#233; &#187;. La qualit&#233; d&#8217;une phrase tient compte de plusieurs param&#232;tres, dont : 
</p>
<p>x sa longueur (ni trop courte ni trop longue) ; 
</p>
<p>x la qualit&#233; de la source d&#8217;o&#249; elle provient ; 
</p>
<p>288</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;laboration automatique d&#8217;un dictionnaire de cooccurrences grand public 
</p>
<p>x le nombre de fautes identifi&#233;es par l&#8217;analyseur ; 
</p>
<p>x le nombre de noms propres (l&#8217;id&#233;e &#233;tant de minimiser les noms propres).  
</p>
<p>L&#8217;algorithme tente aussi de maximiser la diversit&#233; des sources, pour &#233;viter de choisir, pour 
une m&#234;me cooccurrence, plusieurs phrases du m&#234;me ouvrage, du m&#234;me auteur, ou du m&#234;me 
site Web. En revanche, l&#8217;algorithme essaie de r&#233;utiliser le plus possible une m&#234;me phrase 
pour illustrer plusieurs cooccurrences distinctes, afin de minimiser la taille totale des donn&#233;es. 
Enfin, les phrases trop similaires pour une m&#234;me cooccurrence sont identifi&#233;es et coup&#233;es. 
</p>
<p>Parmi 11 millions de phrases candidates, 870 000 phrases sont ainsi s&#233;lectionn&#233;es, 
repr&#233;sentant plus de 2 millions d&#8217;exemples. 
</p>
<p>De ce nombre, 300 000 phrases ont &#233;t&#233; identifi&#233;es automatiquement pour &#234;tre r&#233;vis&#233;es par des 
linguistes, dans le but de rejeter les phrases jug&#233;es ind&#233;sirables selon certains crit&#232;res, parmi 
lesquels :
</p>
<p>x Pr&#233;sence d&#8217;erreurs non d&#233;tect&#233;es par l&#8217;analyseur ; phrases de mauvaise qualit&#233;, trop 
&#171; orales &#187;, parsem&#233;es d&#8217;anglais, en ancien fran&#231;ais, etc. 
</p>
<p>x Pr&#233;sence de mots offensants, inconvenants, vulgaires ; propos non neutres sur des 
sujets d&#233;licats. 
</p>
<p>x Mention d&#8217;une personne non publique ; pr&#233;sence de coordonn&#233;es, de num&#233;ros de 
t&#233;l&#233;phone, etc. ; phrases &#224; caract&#232;re publicitaire. 
</p>
<p>Environ le quart des phrases r&#233;vis&#233;es ont &#233;t&#233; ainsi rejet&#233;es, puis remplac&#233;es et r&#233;vis&#233;es &#224; 
nouveau, en un processus it&#233;ratif de s&#233;lection automatique et de r&#233;vision manuelle. 
</p>
<p>4 Pr&#233;sentation des cooccurrences
Pr&#233;senter efficacement une masse de plusieurs centaines de cooccurrences &#224; un utilisateur non 
sp&#233;cialis&#233; pr&#233;sente plusieurs d&#233;fis. La Figure 1, ouverte sur le d&#233;but des cooccurrences du mot 
gr&#232;ve, donne un aper&#231;u des choix que nous avons faits et que nous discutons ci-dessous.
</p>
<p>Nous estimons que des cooccurrences compl&#232;tes ont plus d&#8217;impact et sont plus faciles &#224; lire 
que celles o&#249; le mot-vedette est omis ou remplac&#233; par un symbole. De plus, nous jugeons 
qu&#8217;il est utile de pr&#233;senter les cooccurrences avec leurs attributs morphosyntaxiques r&#233;els. 
Nous affichons donc d&#233;clencher une gr&#232;ve, mettre fin &#224; la gr&#232;ve, voter en faveur d&#8217;une gr&#232;ve,
ce qui correspond aux formulations les plus fr&#233;quentes. D&#8217;autres formulations ont pu &#234;tre 
rencontr&#233;es dans le corpus (d&#233;clencher la gr&#232;ve, d&#233;clencher cette gr&#232;ve, les gr&#232;ves ont &#233;t&#233; 
d&#233;clench&#233;es&#8230;) ; les exemples d&#8217;occurrences peuvent donner un aper&#231;u de cette variabilit&#233;. 
Lorsqu&#8217;une cooccurrence est s&#233;lectionn&#233;e, des exemples de phrases tir&#233;es du corpus 
s&#8217;affichent en effet dans le panneau de droite, avec surlignement des mots de la cooccurrence. 
</p>
<p>289</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Simon CHAREST, &#201;ric BRUNELLE, Jean FONTAINE, Bertrand PELLETIER
</p>
<p>Dans le cas d&#8217;un mot polys&#233;mique, comme gr&#232;ve, les cooccurrences sont regroup&#233;es sous 
chacun des sens, affich&#233;s en vert, afin de faciliter la consultation2. Un triangle de d&#233;voilement 
permet de r&#233;duire les listes sous chaque sens afin d&#8217;acc&#233;der rapidement au sens d&#233;sir&#233;. 
</p>
<p>Les cooccurrences sont ensuite class&#233;es par relation syntaxique. Un histogramme discret 
illustre la force relative de chaque cooccurrence. Au d&#233;part, seules les cinq cooccurrences les 
plus fortes de chaque relation sont affich&#233;es, pour donner une meilleure vue d&#8217;ensemble. Le 
lien et x autres, &#224; la fin de chaque liste, permet de d&#233;voiler la suite. Un triangle de 
d&#233;voilement permet de r&#233;duire chacune des listes individuellement.  
</p>
<p>&#169; 2006 Druide informatique inc. 
</p>
<p>Figure 1: interface du dictionnaire de cooccurrences d&#8217;Antidote RX 
</p>
<p>2  Pour l&#8217;affichage, les cooccurrences dont les bases sont polys&#233;miques ont &#233;t&#233; manuellement class&#233;es sous les 
divers sens de la base (environ 4000 sens sous 900 bases). Par exemple, les cooccurrences de gr&#232;ve au sens 
d&#8217;&#171; interruption de travail &#187; ont &#233;t&#233; s&#233;par&#233;es de celles de gr&#232;ve au sens de &#171; plage &#187;. 
</p>
<p>290</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;laboration automatique d&#8217;un dictionnaire de cooccurrences grand public 
</p>
<p>5 Utilisation dans le correcteur 
Le dictionnaire de cooccurrences d&#8217;Antidote RX n&#8217;est pas seulement un outil de consultation, 
il est aussi utilis&#233; par le correcteur pour raffiner l&#8217;analyse syntaxique, d&#233;tecter et corriger des 
fautes s&#233;mantiques et &#233;liminer certaines alertes inutiles. 
</p>
<p>Les cooccurrences guident l&#8217;analyseur en lui permettant d&#8217;&#233;liminer des branchements 
syntaxiques moins probables si un branchement plus fort est d&#233;tect&#233;. Ce faisant, l&#8217;analyseur 
purement symbolique devient un analyseur hybride int&#233;grant aussi des notions statistiques. 
Cette avanc&#233;e a permis de r&#233;duire d&#8217;environ 10 % le nombre d&#8217;arbres syntaxiques produits, 
augmentant du m&#234;me coup la vitesse d&#8217;analyse. 
</p>
<p>Les erreurs de nature s&#233;mantique, comme *tache ingrate ou *perp&#233;trer la tradition, ne 
peuvent &#234;tre rep&#233;r&#233;es par la seule analyse syntaxique. Mais comme ces erreurs proviennent 
souvent de la confusion entre homonymes ou paronymes, il devient possible, en consultant les 
cooccurrences, de d&#233;terminer si un homonyme ou un paronyme est statistiquement plus 
probable et de proposer la correction le cas &#233;ch&#233;ant. Antidote peut corriger 25 000 confusions 
de ce type. 
</p>
<p>Figure 2 : correction d'une erreur de nature s&#233;mantique 
</p>
<p>Inversement, si le correcteur trouve deux mots en relation de cooccurrence forte, il peut taire 
certaines alertes de nature s&#233;mantique qu&#8217;il aurait autrement g&#233;n&#233;r&#233;es. Par exemple, sur un 
mot qui peut &#234;tre un faux ami (ou anglicisme s&#233;mantique), comme digital au sens de 
num&#233;rique, le correcteur n&#8217;alertera pas l&#8217;utilisateur si le mot est employ&#233; dans un contexte de 
cooccurrence forte, comme empreinte digitale.
</p>
<p>6 Conclusion
Nous avons vu comment a &#233;t&#233; &#233;labor&#233; un dictionnaire de cooccurrences commercial, au 
moyen d&#8217;outils de traitement automatique de la langue (TAL) &#224; couverture large appliqu&#233;s &#224; 
un vaste corpus du fran&#231;ais. Nous avons vu &#233;galement comment l&#8217;analyseur syntaxique utilis&#233; 
pour extraire les cooccurrences en a lui-m&#234;me tir&#233; profit pour am&#233;liorer ses performances 
d&#8217;analyse et de correction.
</p>
<p>Le dictionnaire de cooccurrences d&#8217;Antidote RX est aujourd&#8217;hui entre les mains de milliers 
d&#8217;utilisateurs. Plusieurs ont manifest&#233; leur satisfaction, et m&#234;me not&#233; que, de tous les outils 
d&#8217;Antidote RX, le dictionnaire de cooccurrences est d&#233;j&#224; devenu celui qu&#8217;ils consultent le 
plus souvent. D&#8217;autres ont &#233;t&#233; agr&#233;ablement surpris par une correction &#171; s&#233;mantique &#187; 
pertinente. Ces r&#233;sultats montrent que le grand public peut profiter pleinement des avanc&#233;es 
du TAL, et qu&#8217;il est pr&#234;t &#224; accueillir de nouveaux outils linguistiques avanc&#233;s et in&#233;dits. 
</p>
<p>291</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Simon CHAREST, &#201;ric BRUNELLE, Jean FONTAINE, Bertrand PELLETIER
</p>
<p>Remerciements
Nous tenons &#224; remercier Mala Bergevin, Jean Saint-Germain, Jasmin Lapalme, Marie-H&#233;l&#232;ne 
Gaudreault, Sophie Campbell, Sara-Anne Leblanc, Oph&#233;lie Tremblay, Guy Lapalme, Alain 
Polgu&#232;re et toute l&#8217;&#233;quipe des druides sans qui Antidote RX n&#8217;aurait pu voir le jour. 
</p>
<p>R&#233;f&#233;rences
DUNNING, T. (1993). Accurate methods for the statistics of surprise and coincidence. 
Computational Linguistics 19, 61-74. 
EVERT S. (2005). The Statistics of Word Cooccurrences: Word Pairs and Collocations. Ph.D. 
thesis, University of Stuttgart. 
KILGARRIFF A., TUGWELL D. (2001). WORD SKETCH: Extraction and Display of Significant 
Collocations for Lexicography. Proc. Collocations workshop, ACL 2001, Toulouse, 32-38.
LIN, D. (1998). Extracting Collocations from Text Corpora. First Workshop on 
Computational Terminology, COLING-ACL &#8217;98, Montr&#233;al, 57-63.
MANNING C., SCH&#220;TZE H. (1999). Foundations of Statistical Natural Language Processing.
Cambridge : The MIT Press. 
ORLIAC B. (2004). Automatisation du rep&#233;rage et de l'encodage des collocations en langue de 
sp&#233;cialit&#233;. Th&#232;se de doctorat pr&#233;sent&#233;e &#224; l'Universit&#233; de Montr&#233;al. 
SERETAN V., WEHRLI E. (2006). Accurate collocation extraction using a multilingual parser. 
Proceedings of COLING-ACL 2006, Sydney, Australia, 953-960.
TUTIN A. (2005). Le dictionnaire de collocations est-il indispensable ? Revue fran&#231;aise de 
linguistique appliqu&#233;e, X-2, 31-48. 
</p>
<p>Dictionnaires
BEAUCHESNE, J. (2001). Dictionnaire des cooccurrences. Montr&#233;al : Gu&#233;rin. 
LACROIX, U. (1931). Les mots et les id&#233;es. Dictionnaire des termes cadrant avec les id&#233;es.
Paris/Bruxelles.
MEL&#8217;&#253;UK I. et coll. (1984, 1988, 1992, 2000). Dictionnaire explicatif et combinatoire du 
fran&#231;ais contemporain. Recherches lexico-s&#233;mantiques I, II, III, IV. Montr&#233;al : Les Presses de 
l&#8217;Universit&#233; de Montr&#233;al. 
MEL&#8217;&#253;UK I., POLGU&#200;RE A. (Sous presse). Lexique actif du fran&#231;ais. L&#8217;apprentissage du 
vocabulaire fond&#233; sur 20 000 d&#233;rivations s&#233;mantiques et collocations du fran&#231;ais. Louvain-
la-Neuve : Duculot. 
ZINGL&#201; H., BROBECK-ZINGL&#201; M.-L. (2003). Dictionnaire combinatoire du fran&#231;ais. 
Expression, locutions et constructions. Paris : La Maison du Dictionnaire. 
DiCou&#232;be, dictionnaire en ligne de combinatoire du fran&#231;ais : 
http://olst.ling.umontreal.ca/dicouebe 
Dictionnaire des collocations : http://www.tonitraduction.net 
Les voisins de Le Monde : http://w3.univ-tlse2.fr/erss/voisinsdelemonde 
</p>
<p>292</p>

</div></div>
</body></html>