<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Logiciel Cordial</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Logiciel Cordial 
</p>
<p>Dominique LAURENT, Sophie N&#200;GRE, Patrick S&#201;GU&#201;LA
Synapse D&#233;veloppement 
</p>
<p>33 Rue Maynard, 
31000 Toulouse 
</p>
<p>http://www.synapse-fr.com
</p>
<p>R&#233;sum&#233;. Cordial est un correcteur efficace et discret enrichi d'un grand nombre de 
fonctions d'aide &#224; la r&#233;daction et d'analyse de documents. Tr&#232;s riche avec ces multiples 
dictionnaires et souvent pertinent dans ses propositions, Cordial est un compagnon pr&#233;cieux 
qui vous permet d'assurer la qualit&#233; de vos &#233;crits. La version 2007 de Cordial s'int&#232;gre dans 
un vaste &#233;ventail de logiciels comme les traitements de texte (Word, Open Office, Word 
Perfect...), clients de messagerie (Outlook, Notes, Thunderbird, webmails...) ou navigateurs 
(Explorer, Mozilla). 
</p>
<p>1 Correcteur orthographique et grammatical multilingue 
Cordial 2007 met en &#339;uvre des milliers de r&#232;gles de grammaire qui s'appuient sur des 
dictionnaires orthographiques (205 000 lemmes) et grammaticaux (104 000 lemmes) tr&#232;s 
pointus. Cordial s'appuie sur le sens des mots avant la correction. Il corrige ainsi pr&#232;s de 9 
fautes sur 10 et &#233;vite de corriger des phrases justes ! Il atteint des scores exceptionnels : moins 
d'un faux message toutes les deux pages !
</p>
<p>Figure 1. Correction en fran&#231;ais, phrase par phrase. 
</p>
<p>319</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dominique LAURENT, Sophie N&#200;GRE, Patrick S&#201;GU&#201;LA
</p>
<p>2 Aides &#224; la r&#233;daction 
Cordial est aussi un atelier 
d&#8217;aides &#224; la r&#233;daction int&#233;grant 
les dictionnaires de r&#233;f&#233;rences du 
fran&#231;ais, noms propres et noms 
communs, Littr&#233;, Tr&#233;sor de la 
Langue Fran&#231;aise, dictionnaire de 
synonymie, dictionnaire des 
analogies et homonymies, 
traducteur mot-&#224;-mot , 
conjugueur, aide grammaticale 
intelligente.
</p>
<p>Ces ressources sont accessibles 
dans tous les logiciels ou sur 
simple clic via un m&#233;canisme de 
Pop up. Figure 2. Pop up Lexical : une interface hypertextuelle 
</p>
<p>pour naviguer dans les ressources dictionnairiques 
</p>
<p>Le dictionnaire de synonymie propose 4,5 millions de liens pond&#233;r&#233;s entre les sens de chaque 
mot mais &#233;galement entre les expressions nominales et verbales. 
</p>
<p>Figure 3. Dictionnaire des synonymes. 
</p>
<p>Cordial 2007 offre des traductions (mot &#224; mot ou expression &#224; expression) entre : fran&#231;ais, 
anglais, allemand, espagnol, italien, portugais. Vous pouvez dans n'importe quel logiciel 
demander la traduction d'un mot ou d'une expression d'une de ces cinq langues vers une autre. 
Plus de 200 000 mots et expressions du fran&#231;ais vers l'anglais et de l'anglais vers le fran&#231;ais, 
au total plus de 2.5 millions de traduction de mots et expressions. 
</p>
<p>320</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Logiciel Cordial 
</p>
<p>3 Analyseur syntaxique et s&#233;mantique 
Enfin, Cordial propose des fonctions nombreuses et performantes qui font habituellement 
l&#8217;objet de logiciels sp&#233;cialis&#233;s. Ces fonctions d&#8217;analyse de donn&#233;es textuelles et de synth&#232;se 
de texte ont &#233;t&#233; d&#233;velopp&#233;es et g&#233;n&#233;ralis&#233;es avec un soin particulier et une amplitude sans 
pr&#233;c&#233;dent dans les correcteurs grammaticaux habituels. 
</p>
<p>Figure 4. Analyse morphologique, syntaxique et s&#233;mantique. 
</p>
<p>L'analyse syntaxique de Cordial, pierre angulaire des d&#233;veloppements chez Synapse 
D&#233;veloppement, a &#233;t&#233; r&#233;cemment d&#233;sign&#233;e comme l'une des plus pertinentes pour le fran&#231;ais, 
lors de la campagne Easy du programme Technolangue, o&#249; elle a obtenu la F-Measure 
globale la plus &#233;lev&#233;e. Cette analyse est &#233;galement disponible dans le logiciel Cordial
Analyseur.
</p>
<p>Dans Cordial, l'analyse 
s&#233;mantique est utilis&#233;e dans 
la plupart des traitements. 
Une fonction reprend dans 
une repr&#233;sentation &#171; en 
&#233;clat&#233; &#187; les informations 
th&#233;matiques et les concepts 
cl&#233;s (en blanc) trouv&#233;s sur 
un texte. D&#8217;un seul coup 
d&#8217;&#339;il, vous pouvez ainsi 
voir quels sont les th&#232;mes 
pr&#233;sents dans le texte. 
Voici comment elle se 
pr&#233;sente sur ce texte. 
</p>
<p>Figure 5. Analyse th&#233;matique de ce texte. 
</p>
<p>Toutes les briques technologiques disponibles dans Cordial sont disponibles sous la forme de 
composants ind&#233;pendants, sous Windows et Linux. Ceci permet l'int&#233;gration directe de ces 
technologies de traitement du langage dans les cha&#238;nes de traitement. 
</p>
<p>321</p>

</div></div>
</body></html>