<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Encha&#238;nements verbaux &#8211; &#233;tude sur le temps et l'aspect utilisant des techniques d&#8217;apprentissage non supervis&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Encha&#238;nements verbaux &#8211; &#233;tude sur le temps et l'aspect utilisant 
des techniques d&#8217;apprentissage non supervis&#233;
</p>
<p>Catherine RECANATI, Nicoleta ROGOVSCHI
LIPN &#8211; UMR 7030 du CNRS, Institut Galil&#233;e, Universit&#233; Paris 13 
</p>
<p>99, avenue J-B. Cl&#233;ment, 93430 Villetaneuse, France  
{Catherine.Recanati,Nicoleta.Rogovschi}@lipn.univ-paris13.fr
</p>
<p>R&#233;sum&#233;. L&#8217;apprentissage non supervis&#233; permet la d&#233;couverte de cat&#233;gories initialement 
inconnues. Les techniques actuelles permettent d'explorer des s&#233;quences de ph&#233;nom&#232;nes alors 
qu'on a tendance &#224; se focaliser sur l'analyse de ph&#233;nom&#232;nes isol&#233;s ou sur la relation entre deux 
ph&#233;nom&#232;nes. Elles offrent ainsi de pr&#233;cieux outils pour l'analyse de donn&#233;es organis&#233;es en 
s&#233;quences, et en particulier, pour la d&#233;couverte de structures textuelles.  Nous pr&#233;sentons ici 
les r&#233;sultats d&#8217;une premi&#232;re tentative de les utiliser pour inspecter les suites de verbes 
provenant de phrases de r&#233;cits d&#8217;accident de la route. Les verbes &#233;taient encod&#233;s comme 
paires (cat, temps), o&#249; cat repr&#233;sente la cat&#233;gorie aspectuelle d&#8217;un verbe, et temps son temps 
grammatical. L&#8217;analyse, bas&#233;e sur une approche originale, a fourni une classification des 
encha&#238;nements de deux verbes successifs en quatre groupes permettant de segmenter les 
textes. Nous donnons ici une interpr&#233;tation de ces groupes &#224; partir de statistiques sur des 
annotations s&#233;mantiques ind&#233;pendantes.  
</p>
<p>Abstract. Unsupervised learning allows the discovery of initially unknown categories. 
Current techniques make it possible to explore sequences of phenomena whereas one tends to 
focus on the analysis of isolated phenomena or on the relation between two phenomena. They 
offer thus invaluable tools for the analysis of sequential data, and in particular, for the 
discovery of textual structures. We report here the results of a first attempt at using them for 
inspecting sequences of verbs coming from sentences of French accounts of road accidents. 
Verbs were encoded as pairs (cat, tense) &#8211; where cat is the aspectual category of a verb, and 
tense its grammatical tense. The analysis, based on an original approach, provided a 
classification of the links between two successive verbs into four distinct groups (clusters) 
allowing texts segmentation. We give here an interpretation of these clusters by using 
statistics on semantic annotations independent of the training process.  
</p>
<p>Mots-cl&#233;s : temps, aspect, s&#233;mantique, apprentissage non supervis&#233;, fouille de donn&#233;es. 
</p>
<p>Keywords: time, tense, aspect, semantics, unsupervised learning, data mining. 
</p>
<p>1 Introduction
L&#8217;int&#233;r&#234;t de l&#8217;apprentissage non supervis&#233; est qu&#8217;il permet la d&#233;couverte de cat&#233;gories 
initialement inconnues. Les techniques actuelles permettent d'explorer des s&#233;quences de 
</p>
<p>379</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Catherine RECANATI, Nicoleta ROGOVSCHI
</p>
<p>ph&#233;nom&#232;nes alors qu'on a tendance &#224; se focaliser sur l'analyse de ph&#233;nom&#232;nes isol&#233;s ou sur la 
relation entre deux ph&#233;nom&#232;nes. Elles offrent ainsi de pr&#233;cieux outils pour l'analyse de 
donn&#233;es organis&#233;es en s&#233;quences, et en particulier, pour la d&#233;couverte de structures textuelles. 
Notre objectif est de les utiliser &#224; cette fin et nous pr&#233;sentons ici l&#8217;interpr&#233;tation des r&#233;sultats 
d&#8217;une premi&#232;re tentative.  
</p>
<p>De nombreuses &#233;tudes ont montr&#233; l&#8217;importance des temps dans la structure narrative d&#8217;un 
r&#233;cit (Vuillaume, 1990). L'opposition entre le pass&#233; simple et l'imparfait a en particulier fait 
couler beaucoup d'encre. Mais de nombreux liens unissant le temps et l&#8217;aspect, l&#8217;id&#233;e d&#8217;un 
couplage temps et cat&#233;gorie aspectuelle nous a paru naturelle et int&#233;ressante. Il a en effet &#233;t&#233; 
d&#233;montr&#233; qu&#8217;on ne peut effectuer l&#8217;analyse temporelle des suites d&#8217;&#233;v&#233;nements &#224; partir du 
seul temps grammatical sans faire intervenir l&#8217;aspect (voir Kamp H., Vet C. ou Vlach F. dans 
(Martin et Nef, 1981), (Vet, 1994), (Gosselin, 1996), etc.). On trouve aussi dans la litt&#233;rature 
des liens entre l&#8217;aspect et d&#8217;autres ph&#233;nom&#232;nes s&#233;mantiques, comme l&#8217;intentionnalit&#233; ou la 
causalit&#233;. Dans cette premi&#232;re &#233;tude, nous avons cherch&#233; &#224; voir si l'on pouvait d&#233;tecter une 
certaine r&#233;gularit&#233; dans les encha&#238;nements de verbes au sein des phrases en couplant temps et 
cat&#233;gorie aspectuelle des verbes, et s&#8217;il &#233;tait possible, dans un cadre restreint, de leur attribuer 
un &#171; sens &#187;.
</p>
<p>Les r&#233;cits qui ont &#233;t&#233; analys&#233;s sont des r&#233;cits d'accident de la route provenant de la partie 
&#171; observations &#187; d'un constat &#224; l'amiable destin&#233; aux assureurs. Ils nous ont gracieusement &#233;t&#233; 
fournis par la MAIF, que nous remercions. Assez courts, leur int&#233;r&#234;t a priori est de montrer 
comment s'exprime un accident, ses causes et la responsabilit&#233; de ses auteurs, dans un espace 
limit&#233;. Ces textes ont d&#233;j&#224; &#233;t&#233; utilis&#233;s au LIPN pour des travaux sur les inf&#233;rences causales 
(Nouioua et Kayser, 2006). Notre approche est n&#233;anmoins diff&#233;rente puisqu&#8217;il s&#8217;agit d&#8217;une 
approche statistique visant &#224; cat&#233;goriser des encha&#238;nements de verbes &#8211; le pari &#233;tant que, si de 
telles classes d&#8217;encha&#238;nements existent, elles aient globalement un sens, &#224; tout le moins pour 
le type de r&#233;cit consid&#233;r&#233;.
</p>
<p>Nous avons pleinement conscience de la difficult&#233; concernant l'&#233;valuation de ce premier 
travail, ce dernier &#233;tant bas&#233; sur le postulat que de tels encha&#238;nements (ici relativement 
pauvres du point de vue syntaxico-s&#233;mantique) puissent se voir attribuer un sens, et ne pas 
&#234;tre le reflet de statistiques contingentes. Mais le peu de ressources utilis&#233;es est un pr&#233;cieux 
avantage pour de futures applications au TAL, et l&#8217;exp&#233;rience m&#233;ritait donc d&#8217;&#234;tre men&#233;e. 
Ajoutons que les outils math&#233;matiques dont nous disposons nous ont permis de tester la 
validit&#233; des cat&#233;gories obtenues du point de vue statistique, et que notre analyse s&#233;mantique a 
&#233;t&#233; effectu&#233;e &#224; partir d'annotations compl&#232;tement ind&#233;pendantes de l&#8217;apprentissage. 
</p>
<p>1.1 Int&#233;r&#234;ts de notre approche formelle 
</p>
<p>Les SOM (Self Organizing Map) ou cartes topologiques de Kohonen (Kohonen, 1995) 
permettent un apprentissage non supervis&#233; (clustering) efficace avec visualisation simultan&#233;e 
des r&#233;sultats de la classification. Cette visualisation se fait gr&#226;ce &#224; la carte topologique des 
donn&#233;es (deux donn&#233;es similaires sont proches sur la carte) qui fournit en m&#234;me temps un 
codage &quot;intelligent&quot; des donn&#233;es sous forme de prototypes. Ces prototypes &#233;tant de m&#234;me 
nature que les donn&#233;es, ils sont interpr&#233;tables, et la carte fournit ainsi un r&#233;sum&#233; des donn&#233;es. 
A partir de ce codage, nous avons pris les HMM (Hidden Markov Models) pour mod&#233;liser la 
dynamique des s&#233;quences de donn&#233;es (ici, les suites de verbes). Les HMM (Rabiner et Juang, 
1986) sont la meilleure approche pour traiter des s&#233;quences de longueur variable et capturer 
leur dynamique. C&#8217;est pourquoi ces mod&#232;les ont &#233;t&#233; largement utilis&#233;s dans le domaine de la 
</p>
<p>380</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Encha&#238;nements verbaux &#8211; &#233;tude sur le temps et l&#8217;aspect 
</p>
<p>reconnaissance de la parole et sont tout particuli&#232;rement adapt&#233;s &#224; notre objectif. Pour la 
validation de notre approche, nous avons utilis&#233; &#224; la fois des donn&#233;es g&#233;n&#233;tiques et des 
donn&#233;es textuelles (celles dont nous pr&#233;sentons ici l&#8217;interpr&#233;tation). Pour plus de d&#233;tails 
techniques sur cette m&#233;thode, voir (Rogovschi, 2006) ou (Rogovschi et al., 2006). 
</p>
<p>1.2 Codage des phrases 
</p>
<p>L&#8217;analyse a &#233;t&#233; r&#233;alis&#233;e sur une centaine de textes correspondant &#224; 700 occurrences de verbes. 
On a consid&#233;r&#233; dans ces r&#233;cits toutes les s&#233;quences de verbes d&#233;limit&#233;es par des phrases d&#8217;au 
moins deux verbes. Pour palier au faible nombre de donn&#233;es, nous avons utilis&#233; des 
techniques de r&#233;-&#233;chantillonnage bas&#233;es sur des fen&#234;tres glissantes permettant d&#8217;augmenter la 
redondance (la redondance assure une meilleure classification des donn&#233;es). Pour le codage, 
les quatre cat&#233;gories aspectuelles de verbes (&#233;tat, activit&#233;, accomplissement, ach&#232;vement) 
originellement dues &#224; Vendler et Kenny (Vendler, 1967) ont &#233;t&#233; coupl&#233;es avec le temps 
grammatical. Le Tableau 1 r&#233;sume sommairement les diff&#233;rences entre ces quatre cat&#233;gories 
s&#233;mantiques. L'indexation a &#233;t&#233; r&#233;alis&#233;e &#224; la main en s'appuyant sur notre conception de ces 
cat&#233;gories (Recanati C., Recanati F., 1999).
</p>
<p>ETAT homog&#232;ne, duratif, habituel  
ou indiquant une disposition 
</p>
<p>&#234;tre (&#224; l'arr&#234;t) / vouloir / pouvoir
</p>
<p>ACTIVITE processus relativement 
homog&#232;ne, non born&#233; 
</p>
<p>rouler / circuler / slalomer / suivre
</p>
<p>ACCOMPLISSEMENT processus
dirig&#233; et born&#233; par une fin 
</p>
<p>traverser  / faire un cr&#233;neau / aller &#224;
</p>
<p>ACHEVEMENT &#233;v&#233;nement quasi 
ponctuel
</p>
<p>franchir  / heurter / percuter
</p>
<p>Tableau 1 : Les quatre cat&#233;gories aspectuelles de verbes
</p>
<p>Ce type de r&#233;cit n'utilise globalement que l'imparfait (24%) et le pass&#233; compos&#233; (34%), avec 
de temps &#224; autre quelques phrases au pr&#233;sent. On y trouve aussi quelques occurrences (rares) 
de pass&#233; simple et de plus-que-parfait. Il existe par contre un nombre important de participes 
pr&#233;sents (11%) et d'infinitifs (20%). Nous avons donc d&#233;cid&#233; de les retenir, bien qu'ils ne 
participent pas de la m&#234;me mani&#232;re &#224; l'ossature grammaticale. Nous avons ainsi effectu&#233; 
l'apprentissage en gardant 9 codes1 pour les temps apparus sur les verbes. 
</p>
<p>Exemple &#171; Le v&#233;hicule B circulait sur la voie de gauche des v&#233;hicules allant &#224; gauche 
(marquage au sol par des fl&#232;ches). Celui-ci s'est rabattu sur mon v&#233;hicule, me heurtant &#224;
l'arri&#232;re. Il a accroch&#233; mon pare-choc et m'a entra&#238;n&#233; vers le mur amovible du pont de 
Gennevilliers que j'ai percut&#233; violemment. &#187; sera r&#233;duit apr&#232;s codage aux suites de verbes 
apparus dans les phrases : (circulait, allant) / (s&#8217;est rabattu, heurtant)/ (a accroch&#233;, a entra&#238;n&#233;, 
ai percut&#233;) &#8211; lesquelles ont encore &#233;t&#233; encod&#233;es num&#233;riquement comme s&#233;quences de couples 
(temps, cat&#233;gorie), soit ici : (act., IM) (acco., pp) / (acco., PC) (ach&#232;., pp) / (ach&#232;., PC) 
(acco., PC) (ach&#232;., PC). 
</p>
<p>1 IM = imparfait, PR = pr&#233;sent, PC = pass&#233; compos&#233;, PS = pass&#233; simple, PQP = plus-que-parfait, inf = 
infinitif, ppr = participe pr&#233;sent, pp = participe pass&#233; et pps = participe pass&#233; surcompos&#233;. En ce qui 
concerne les participes pass&#233;s (peu nombreux ici), nous n&#8217;avons pas toujours compt&#233; les emplois adjectivaux 
contingents, et du point de vue du cat&#233;gorisateur, ils constituent plut&#244;t du bruit. 
</p>
<p>381</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Catherine RECANATI, Nicoleta ROGOVSCHI
</p>
<p>2 Premiers r&#233;sultats 
Les premiers r&#233;sultats concernent les statistiques sur les verbes et les cat&#233;gories, 
ind&#233;pendamment de leurs encha&#238;nements. Dans ce type de r&#233;cit, les verbes d'&#233;tat repr&#233;sentent 
24% du corpus, ceux d'activit&#233; seulement 10%, et l'on trouve 34% de verbes 
d'accomplissement et 32% de verbes d'ach&#232;vement. La r&#233;partition non uniforme des temps sur 
les cat&#233;gories confirme l&#8217;int&#233;r&#234;t de notre couplage temps/cat&#233;gorie aspectuelle (cf. Figure 1). 
</p>
<p>0%
</p>
<p>2%
</p>
<p>4%
</p>
<p>6%
</p>
<p>8%
</p>
<p>10%
</p>
<p>12%
</p>
<p>14%
</p>
<p>16%
</p>
<p>18%
</p>
<p>20%
</p>
<p>ETAT ACTIVITE ACCOMP. ACHEV.
</p>
<p>IM
PR
PC
INF
ppr
</p>
<p>Figure 1 : R&#233;partition des temps par cat&#233;gorie  
</p>
<p>Ces pourcentages et leur r&#233;partition s'expliquent assez naturellement par la nature de chaque 
cat&#233;gorie aspectuelle, la structure g&#233;n&#233;ralement typique de ces r&#233;cits, et la sp&#233;cialisation 
aspectuelle des temps grammaticaux (opposition perfectif/imperfectif). 
</p>
<p>Les verbes d'&#233;tats (24%) sont r&#233;partis &#224; plus de 70% sur l'imparfait, le pr&#233;sent et le participe 
pr&#233;sent. Cela n'est gu&#232;re surprenant puisque les &#233;tats sont homog&#232;nes, souvent duratifs ou 
caract&#233;risant une aptitude (habituels, g&#233;n&#233;riques). La proportion n&#233;anmoins non n&#233;gligeable 
du pass&#233; compos&#233; s'explique sans doute par la fr&#233;quence de verbes comme &#171; vouloir &#187; ou 
&#171; pouvoir &#187;, class&#233;s comme verbes d'&#233;tats du fait de leur aspect dispositionnel (&#171; j'ai voulu 
freiner &#187;, &#171; je n'ai pu &#233;viter &#187;). La faible proportion de pr&#233;sent provient du fait que le r&#233;cit est 
au pass&#233; et que le pr&#233;sent historique est trop litt&#233;raire pour le genre.
</p>
<p>Les verbes d'activit&#233;s (10%) d&#233;notant des processus homog&#232;nes et non born&#233;s, ils se 
r&#233;partissent tout naturellement &#224; plus de 79% sur l'imparfait et le participe pr&#233;sent. La 
pr&#233;sence de 10% d'infinitif peut facilement s'expliquer par le fait qu'il s'agit de processus qui 
ont un d&#233;but, et qui peuvent donc se trouver compl&#233;ment de verbe comme &#171; commencer &#224; &#187;, 
&#171; vouloir &#187;, ou &#234;tre introduits pour mentionner un but par la pr&#233;position &#171; pour &#187;.
</p>
<p>Les accomplissements (34%) et les ach&#232;vements (32%) sont tr&#232;s fr&#233;quents au pass&#233; 
compos&#233; du fait de leur caract&#232;re t&#233;lique (born&#233; par une fin). Les ach&#232;vements sont pr&#233;sents 
de mani&#232;re massive car, &#233;tant ponctuels ou de courte dur&#233;e, ils supportent mal l'imparfait. A 
l'inverse, les accomplissements supportent bien l'imparfait et le participe pr&#233;sent, parce qu'ils 
ont une dur&#233;e intrins&#232;que, et mettent l'accent sur le proc&#232;s plut&#244;t que sur sa fin &#8211; ce qui les 
rapproche finalement des activit&#233;s. L'importance globale de ces deux cat&#233;gories est sans doute 
li&#233;e &#224; la typologie des textes analys&#233;s, un r&#233;cit d'accident impliquant de d&#233;crire la s&#233;quence 
des &#233;v&#233;nements successifs qui l&#8217;ont provoqu&#233;. 
</p>
<p>Distinction perfectif/imperfectif. Il y a trois points de vue dans le syst&#232;me aspectuel du 
Fran&#231;ais (Smith, 1991). Un point de vue perfectif pr&#233;sente les situations comme ferm&#233;es, y 
</p>
<p>382</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Encha&#238;nements verbaux &#8211; &#233;tude sur le temps et l&#8217;aspect 
</p>
<p>compris les &#233;tats (le point final est alors un changement d'&#233;tat). Le perfectif s'exprime par le 
pass&#233; compos&#233; et le pass&#233; simple. Les points de vue imperfectif et neutre pr&#233;sentent &#224; 
l'inverse des situations ouvertes. Le point de vue neutre s'exprime par le pr&#233;sent. Le point de 
vue imperfectif s'exprime par l'imparfait, ou par la forme en train de. Paul J. Hopper (Hopper, 
1979) a fort bien d&#233;crit les caract&#233;ristiques de ces deux modes vis-&#224;-vis de la structure 
narrative, du focus et de l'aspect (cf. Tableau 2). Ici, l&#8217;opposition perfectif/imperfectif sera 
r&#233;alis&#233;e par l&#8217;opposition pass&#233; compos&#233;/imparfait. Cette opposition est n&#233;anmoins globale et 
l&#8217;on aurait tort d'attribuer de mani&#232;re syst&#233;matique un aspect imperfectif &#224; tous les imparfaits. 
</p>
<p>Perfectif Imperfectif
Chronologie stricte Simultan&#233;it&#233; ou recouvrement 
</p>
<p>Vue d'un &#233;v&#233;nement comme un tout, dont la 
fin est une condition pr&#233;alable pour 
</p>
<p>l'&#233;v&#233;nement suivant 
</p>
<p>Vue de la situation ou de ce qui arrive 
sans que la fin soit n&#233;cessaire pour ce 
</p>
<p>qui va arriver ensuite 
Identit&#233; du sujet &#224; l'int&#233;rieur de chaque 
</p>
<p>&#233;pisode discret 
Changement fr&#233;quent de sujet 
</p>
<p>Topicalisation humaine Vari&#233;t&#233; de topiques, y compris des 
ph&#233;nom&#232;nes naturels 
</p>
<p>Focus non marqu&#233; dans les clauses, avec 
pr&#233;supposition du sujet et assertion dans le 
</p>
<p>verbe et ses compl&#233;ments imm&#233;diats 
</p>
<p>Distribution marqu&#233;e du focus, sur le 
sujet, l'instrument, ou un adverbe 
</p>
<p>Ev&#233;nements dynamiques et cin&#233;matiques Situation descriptive, statique 
Avant-plan. Ev&#233;nement indispensable &#224; la 
</p>
<p>structure narrative 
Arri&#232;re-plan. Etat ou situation 
</p>
<p>n&#233;cessaire pour comprendre les motifs, 
les attitudes, etc. 
</p>
<p>Tableau 2 : Opposition perfectif/imperfectif 
</p>
<p>Structure typique. Un r&#233;cit d&#8217;accident commence g&#233;n&#233;ralement par quelques phrases 
d&#233;crivant les circonstances et les &#233;tats de choses pr&#233;c&#233;dant l'accident. Cette premi&#232;re partie 
est alors &#224; l'imparfait, et contient de nombreux participes pr&#233;sents. On y trouve aussi quelques 
pr&#233;sents et de nombreux infinitifs introduits par &#171; pour &#187;, ou compl&#233;ments de verbes (&#171; je 
m'appr&#234;tais &#224; tourner &#187;, &#171; le feu venait de passer au rouge &#187;). Essentiellement circonstancielle, 
cette partie contient une majorit&#233; de verbes d'&#233;tats, et quelques activit&#233;s et accomplissements. 
Elle est globalement caract&#233;ris&#233;e par un point de vue imperfectif, et le r&#233;cit est en arri&#232;re-
plan. Vient ensuite la description de l'accident proprement dit, qui mentionne la suite des 
&#233;v&#233;nements ayant conduit &#224; l'accident pour finir par le choc. Cette partie utilise massivement 
des verbes d'accomplissement et d'ach&#232;vement, le plus souvent au pass&#233; compos&#233;. Elle est 
caract&#233;ris&#233;e par un mode perfectif, mais le but du jeu &#233;tant d'indiquer les responsabilit&#233;s des 
auteurs, on trouve ici encore beaucoup de participes pr&#233;sents et de tournures infinitives 
encha&#238;nant souvent trois verbes (&#171; J'ai voulu freiner pour l'&#233;viter &#187;, &#171; voulant &#233;viter la borne, 
je n'ai pu &#187;). En fin de r&#233;cit, on trouve parfois une troisi&#232;me partie constitu&#233;e de 
commentaires et inventoriant notamment les d&#233;g&#226;ts. Cette partie est relativement courte et 
plus difficile &#224; caract&#233;riser stylistiquement.  
</p>
<p>3 Cat&#233;gorisation des encha&#238;nements verbaux 
Notre approche non supervis&#233;e a fourni une classification des paires de deux verbes 
successifs (au sein d&#8217;une m&#234;me phrase) en quatre groupes. Il faut souligner que ce nombre de 
</p>
<p>383</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Catherine RECANATI, Nicoleta ROGOVSCHI
</p>
<p>quatre, particuli&#232;rement petit, est int&#233;ressant car il atteste du bien fond&#233; de notre couplage 
temps/aspect (pas d&#8217;explosion combinatoire). Rappelons qu&#8217;avec 9 temps et 4 cat&#233;gories on 
obtient 36 sortes de verbes, soit 1296 couples virtuels. La r&#233;partition des temps sur les 
cat&#233;gories a en effet restreint le nombre de couples. Mais c&#8217;est aussi la capacit&#233; de r&#233;duction 
de la m&#233;thode qui permet d&#8217;obtenir ce r&#233;sultat. Une premi&#232;re r&#233;duction de dimension a &#233;t&#233; 
effectu&#233;e par les cartes SOM, qui repr&#233;sentent ici les classes avec 36 paires, puis un &#233;lagage 
de la carte, effectu&#233; &#224; partir des matrices de probabilit&#233;s de transitions provenant des HMM, a 
r&#233;duit encore ces classes &#224; un plus faible nombre de paires typiques. 
</p>
<p>Annotations s&#233;mantiques. Pour faciliter l&#8217;interpr&#233;tation des classes obtenues, nous avions 
effectu&#233; par avance un certain nombre d&#8217;annotations. Ces annotations n'ont pas &#233;t&#233; utilis&#233;es 
pour l&#8217;apprentissage mais elles vont nous permettre de caract&#233;riser s&#233;mantiquement les 
classes de transitions verbales de fa&#231;on globale. Ainsi, pour rendre compte de la structure 
typique de ces r&#233;cits, nous avons index&#233; tous les verbes d&#8217;un num&#233;ro indiquant la &#171; partie &#187; 
th&#233;matique (1-circonstance, 2-accident ou 3-commentaire). Nous avons &#233;galement marqu&#233; 
certains verbes des attributs foreground ou background pour indiquer que le r&#233;cit est en 
avant-plan ou en arri&#232;re-plan. Pour d&#233;celer d'&#233;ventuelles cha&#238;nes causales conduisant &#224; 
l'accident, nous avons marqu&#233; les verbes des attributs causal ou choc quand le verbe indiquait 
une cause directe de l&#8217;accident, ou le choc lui-m&#234;me. Nous avons &#233;galement marqu&#233; les 
verbes d'action en fonction de l'agent (A pour le conducteur auteur du r&#233;cit, B pour 
&#171; l'adversaire &#187;, et C pour un tiers). Nous avons aussi not&#233; la pr&#233;sence de n&#233;gation, et 
l'&#233;vocation plus g&#233;n&#233;rale de buts poursuivis ou de mondes possibles voisins qui ne se sont pas 
produits (attributs n&#233;gation et inertia). Le  Tableau 3 r&#233;sume symboliquement les r&#233;sultats 
que nous avons obtenus en faisant des statistiques sur nos marques s&#233;mantiques dans ces 
quatre classes. Le marquage de la n&#233;gation s&#8217;est av&#233;r&#233; peu discriminant, et celui des agents 
relativement peu informatif. 
</p>
<p>Groupe C (circonstances) 
Pas de causalit&#233;, arri&#232;re-plan, pas de choc, 
</p>
<p>nombreux buts et alternatives               
(&#233;tais, tournant)  (reculais, repartir)
</p>
<p>Groupe CI (circonstances ou incident) 
Peu de causalit&#233;, arri&#232;re-plan, peu de choc, 
</p>
<p>ni but ou alternative
(d&#233;marrais, ai entendu) (avait, trouvais) 
</p>
<p>Groupe AA (actions menant &#224; l&#8217;accident) 
Causalit&#233; forte, relief neutre, quelques chocs, 
</p>
<p>nombreux buts et alternatives               
(ai voulu, engager) (a percut&#233;, ab&#238;mant)
</p>
<p>Groupe CC (choc ou commentaires) 
Causalit&#233; tr&#232;s forte, en avant-plan, choc 
</p>
<p>fr&#233;quent, buts et alternatives
(a accroch&#233;, a entra&#238;n&#233;) (n&#8217;a pu, stopper)
</p>
<p>Tableau 3 : Synth&#232;se sur les annotations s&#233;mantiques 
</p>
<p>3.1 Groupe C des circonstances 
</p>
<p>Ce groupe se distingue par une nette diff&#233;renciation du premier verbe et du second. Le 
premier verbe est &#224; 93% &#224; l&#8217;imparfait, pour seulement 7% de pr&#233;sent, tandis que le second est 
&#224; 63% &#224; l&#8217;infinitif et &#224; 30% au participe pr&#233;sent. Du point de vue des cat&#233;gories aspectuelles, 
le premier verbe est &#224; 56% un verbe d&#8217;&#233;tat, et le second &#224; 63% un verbe d&#8217;accomplissement 
(les autres cat&#233;gories se trouvant distribu&#233;es de mani&#232;re r&#233;guli&#232;re entre 12% et 16%). On 
pourrait r&#233;sumer globalement les transitions de ce groupe comme pr&#233;sentant un verbe d&#8217;&#233;tat 
(ou d&#8217;activit&#233;) &#224; l&#8217;imparfait, suivi d&#8217;un verbe d&#8217;accomplissement &#224; l&#8217;infinitif ou au participe 
</p>
<p>384</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Encha&#238;nements verbaux &#8211; &#233;tude sur le temps et l&#8217;aspect 
</p>
<p>pr&#233;sent. Le Tableau 4 (voir plus loin) nous donne une synth&#232;se plus fine. Ce groupe privil&#233;gie 
les &#233;tats et les activit&#233;s au d&#233;triment des ach&#232;vements &#8211; et les accomplissements sont 
massivement repr&#233;sent&#233;s en seconde occurrence verbale. Ce groupe est celui o&#249; l&#8217;attribut 
inertia (indiquant un but ou un monde possible proche) est le plus important. Cela s'explique 
par les nombreux accomplissements introduits par la pr&#233;position &#171; pour &#187; (&#171; je reculais pour 
repartir &#187;, &#171; je sortais du parking pour me diriger &#187;) ou les auxiliaires &#224; l'imparfait 
introduisant un infinitif et indiquant des intentions du conducteur (&#171; je m'appr&#234;tais &#224; tourner
&#224; gauche &#187;). C&#8217;est une des raisons pour laquelle nous l&#8217;avons baptis&#233; groupe C des 
circonstances. L&#8217;autre raison est que ce groupe contient une majorit&#233; de verbes appartenant &#224; 
la premi&#232;re partie du r&#233;cit (63%), et peu de la seconde et la troisi&#232;me. On constate en outre 
que ce groupe ne contient pratiquement aucun verbe indiquant les causes de l&#8217;accident ou le 
choc. L&#8217;acteur A y est le plus pr&#233;sent, et le r&#233;cit est en arri&#232;re-plan. 
</p>
<p>3.2 Groupe CI des circonstances ou de la survenue d&#8217;un incident 
</p>
<p>Le groupe CI est celui des circonstances ou de la survenue d&#8217;un incident. On note ici un grand 
nombre de verbes d'&#233;tats (37,5%) et d'activit&#233;s (17%), encore plus important que dans le 
groupe pr&#233;c&#233;dent et tr&#232;s sup&#233;rieur &#224; la moyenne. On a par contre un nombre moyen 
d'ach&#232;vements (29%), absents du premier verbe mais massivement repr&#233;sent&#233;s en second. 
Cela distingue ce groupe du pr&#233;c&#233;dent, o&#249; les accomplissements jouaient ce r&#244;le. Ici, &#224; 
l'inverse, les accomplissements sont exclus de la seconde place et nettement sous repr&#233;sent&#233;s 
(16,5%). On peut synth&#233;tiser les encha&#238;nements de ce groupe en disant qu&#8217;on a g&#233;n&#233;ralement 
affaire &#224; un &#233;tat ou une activit&#233; &#224; l'imparfait, suivi d'un &#233;tat ou d'un ach&#232;vement, &#224; l&#8217;imparfait 
ou au pass&#233; compos&#233;. On encha&#238;ne donc deux points de vue imperfectifs, et parfois, un point 
de vue imperfectif et un point de vue perfectif. On a en effet 36% des verbes qui proviennent 
de la partie circonstancielle (&#171; Je circulais &#224; environ 45 Km/h dans une petite rue &#224; sens 
unique o&#249; stationnaient des voitures de chaque c&#244;t&#233; &#187;), mais &#233;galement des s&#233;quences 
finissant par un ach&#232;vement au pass&#233; compos&#233;, provenant de la seconde (34%, &#171; Je roulais
dans la rue Pasteur quand une voiture a surgi de ma droite &#187;). Ce groupe contient en outre 
25% de s&#233;quences verbales situ&#233;es &#224; cheval entre les deux parties, soit environ la moiti&#233; de 
ces derni&#232;res. C&#8217;est la raison pour laquelle nous l&#8217;avons baptis&#233; &#171; groupe des circonstances ou 
de la survenue d&#8217;un incident &#187;. Le r&#233;cit est principalement en arri&#232;re-plan. L&#8217;acteur A (ou un 
tiers C) se trouvent fortement repr&#233;sent&#233;s au d&#233;triment de l&#8217;acteur B. Il y a peu d&#8217;allusions 
aux causes de l&#8217;accident et au choc. L&#8217;&#233;vocation de buts ou d&#8217;alternatives y est insignifiante. 
</p>
<p>3.3 Groupe AA des actions menant &#224; l&#8217;accident
</p>
<p>Les verbes du groupe AA proviennent essentiellement du r&#233;cit de l&#8217;accident proprement dit. 
Ce groupe est caract&#233;ris&#233; par l'abondance des accomplissements, au d&#233;triment des &#233;tats et des 
activit&#233;s, et c&#8217;est pourquoi nous l&#8217;avons baptis&#233; &#171; groupe des actions menant &#224; l&#8217;accident &#187;. 
Le mode est g&#233;n&#233;ralement perfectif mais on y trouve aussi beaucoup d&#8217;infinitifs. Les &#233;l&#233;ments 
les plus typiques sont list&#233;s sur le Tableau 4. Ces encha&#238;nements se pr&#234;tent &#224; des constructions 
de trois verbes comme &#171; j'ai voulu m'engager pour laisser &#187;, ou &#171; n'ayant pas la possibilit&#233; de 
changer de voie et la route &#233;tant mouill&#233;e &#187;. 56% des s&#233;quences proviennent de la seconde 
partie, mais les participes pr&#233;sents et les infinitifs permettant l&#8217;expression de buts et de 
mondes possibles (&#171;  d&#233;sirant me rendre &#224; &#187;, &#171; commen&#231;ant &#224; tourner &#187;), 26% proviennent de 
la premi&#232;re partie. On constate ici une assez forte proportion d&#8217;acteurs A et B, peu de tiers C, 
et tr&#232;s peu de marques de relief &#8211; le r&#233;cit n&#8217;&#233;tant ni sp&#233;cialement en avant-plan, ni 
</p>
<p>385</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Catherine RECANATI, Nicoleta ROGOVSCHI
</p>
<p>sp&#233;cialement en arri&#232;re-plan. On trouve beaucoup de verbes participant &#224; la cha&#238;ne causale de 
l&#8217;accident, mais relativement peu mentionnant le choc. 
</p>
<p>3.4 Groupe CC du choc ou des commentaires 
</p>
<p>Les verbes d'ach&#232;vements figurent ici (45%) en plus grand nombre que partout ailleurs, au 
d&#233;triment des activit&#233;s (seulement 6,5%) et des &#233;tats (seulement 14,5%). Cela explique que ce 
groupe favorise globalement la partie descriptive de l'accident (57%). On observe aussi une 
augmentation des infinitifs et des participes en premier verbe au d&#233;triment de l'imparfait et du 
pr&#233;sent, et une augmentation massive du pass&#233; compos&#233; sur le second verbe au d&#233;triment de 
toutes les cat&#233;gories &#8211; sauf le pr&#233;sent (8%, l&#233;g&#232;rement plus que la moyenne). Cette apparition 
du pr&#233;sent explique peut-&#234;tre la pr&#233;sence de la partie 3-commentaire (29% au lieu de18% en 
moyenne).  La mention de but ou d&#8217;alternative est moyenne. C&#8217;est ici par contre que l&#8217;avant-
plan est le plus marqu&#233;. Il y a un nombre important d&#8217;acteur B (le conducteur adverse) et c&#8217;est 
l&#224; que l&#8217;on trouve le plus de verbes relatifs aux causes de l&#8217;accident et au choc lui-m&#234;me. Le 
Tableau 4 indique seulement deux &#233;l&#233;ments typiques dans ce groupe qui, bien qu&#8217;assez 
volumineux, est plus difficile &#224; caract&#233;riser. L'analyse en termes de point de vue montre 
n&#233;anmoins que la s&#233;quence finit g&#233;n&#233;ralement par un point de vue perfectif.  
</p>
<p>Groupe Type verbe 1 verbe 2 
1 Etat ou act., IM Etat ou act., ppr 
2 Etat, IM (ou PR) Acc., INF C
3 Act. ou ach., IM Acc. (ou ach.) INF
4 Etat ou act., IM Etat (ou ach.), IM 
</p>
<p>CI 5 Etat ou act., IM Etat (ou ach.), PC 
6 Acc.(ou ach.) INF Acc.(ou ach.) INF (ou ppr) 
7 Ach. (ou acc.), PC Acc.(ou ach.) INF AA
8 Etats, PC Ach. INF 
9 Ach. (ou acc.)., INF Ach., PC
</p>
<p>CC 10 Ach.ou &#233;tat, PC Ach. (ou acc) PC
</p>
<p>Tableau 4 : &#201;l&#233;ments les plus typiques des quatre groupes 
</p>
<p>3.5 Bilan et commentaires 
</p>
<p>Cette cat&#233;gorisation a bien distingu&#233; les &#233;tats et activit&#233;s (groupes C, CI) des &#233;v&#233;nements 
(groupes AA, CC). De mani&#232;re plus int&#233;ressante, les accomplissements sont aussi distingu&#233;s 
des ach&#232;vements, justifiant la distinction accomplissement/ach&#232;vement (par opposition &#224; la 
notion plus g&#233;n&#233;rale d'&#233;v&#233;nements). On a pu &#233;galement mettre en &#233;vidence que l&#8217;expression 
de buts ou d'alternatives passe souvent par l'utilisation de verbes au participe pr&#233;sent ou &#224; 
l'infinitif &#8211; ce qui explique les taux r&#233;alis&#233;s par les groupes C et AA. Mais la cat&#233;gorie utilis&#233;e 
influence aussi cette expression, car le second verbe dans ces deux groupes est g&#233;n&#233;ralement 
un accomplissement. En outre, les groupes C et CI (non marqu&#233; pour cet indice) se 
distinguent justement sur le type d'&#233;v&#233;nement qui appara&#238;t en second. De m&#234;me les &#233;l&#233;ments 
diff&#233;renciant les groupes AA et CC (lesquels ont cette fois une majorit&#233; d'&#233;v&#233;nements) 
montrent que le groupe AA (qui favorise les accomplissements), bien que v&#233;hiculant un mode 
perfectif, est peu marqu&#233; sur le plan du relief narratif. Ce groupe est &#233;galement moins 
concern&#233; par les causes de l'accident que le groupe CC, et il fait peu allusion au choc. Les 
</p>
<p>386</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Encha&#238;nements verbaux &#8211; &#233;tude sur le temps et l&#8217;aspect 
</p>
<p>buts et intentions s'exprimeraient donc plus facilement par des accomplissements que par des 
ach&#232;vements &#8211; lesquels seraient porteurs de plus de causalit&#233;. En effet, le groupe CC, qui 
favorise les ach&#232;vements, est plus fortement marqu&#233; pour l'avant plan, le choc lui-m&#234;me et la 
cha&#238;ne causale des &#233;v&#233;nements l'ayant directement provoqu&#233;. Ajoutons &#224; ce propos qu'il 
semble que pour les ach&#232;vements et les activit&#233;s, le sujet ait une relation de pouvoir sur l'objet 
direct (ou sur l'objet oblique). On peut tester son existence en utilisant des adverbes de 
mani&#232;re (doucement, pr&#233;cautionneusement, etc.). Cela explique peut-&#234;tre aussi la plus forte 
responsabilit&#233; du sujet avec des verbes d'ach&#232;vements. 
</p>
<p>Mais quoi qu&#8217;ayant bien rep&#233;r&#233; l&#8217;opposition perfectif/imperfectif (groupes AA et CC vs C et 
CI), cette classification a mis dans le m&#234;me groupe CI des s&#233;quences &#224; l&#8217;imparfait et les 
ruptures imparfait/pass&#233; compos&#233;. Une des explications est que notre algorithme 
d&#8217;apprentissage n&#8217;a pas tenu compte de l&#8217;ordre des phrases (ni de la distinction entre les 
textes), de sorte que la succession de plusieurs phrases &#224; l&#8217;imparfait, et la structure typique de 
ces r&#233;cits (telle que nous la percevons), n&#8217;a pas pu &#234;tre bien rep&#233;r&#233;e. On a ainsi manqu&#233; une 
part importante de notre objectif. Mais les r&#233;sultats obtenus sont d&#233;j&#224; prometteurs, puisque les 
trois parties ont tout de m&#234;me &#233;t&#233; distribu&#233;es de mani&#232;re non uniforme sur les quatre groupes. 
On notera &#233;galement que cette classification a mis en &#233;vidence l&#8217;importance des tournures 
infinitives et des participes pr&#233;sents, et la subtilit&#233; de leurs encha&#238;nements (cf. Tableau 4).  
</p>
<p>Am&#233;liorations techniques possibles. On a construit ici les HMM en d&#233;pla&#231;ant une fen&#234;tre de 
taille 2 : un verbe est analys&#233; au regard du verbe qui le pr&#233;c&#232;de et de celui qui le suit, mais pas 
au regard des n pr&#233;c&#233;dents ou des n suivants. Cela n&#8217;est pas tr&#232;s g&#234;nant si l&#8217;on se situe comme 
ici au niveau de la phrase, (dans ces r&#233;cits, les phrases comportent rarement plus de trois 
verbes) mais pour une analyse globale prenant en compte tout le texte, on aura certainement 
besoin de cette am&#233;lioration. D&#8217;autre part, nous aurions aim&#233; produire des s&#233;quences typiques 
de longueur variables. Ainsi, les groupes AA et CC auraient fourni des s&#233;quences de plusieurs 
verbes. (Cela se voit sur les &#233;l&#233;ments du Tableau 4, et nous l&#8217;avons par ailleurs constat&#233; sur la 
segmentation des textes). Ce r&#233;sultat pourrait &#234;tre obtenu automatiquement &#224; partir des HMM, 
mais nous n&#8217;avons pas eu encore le temps d&#8217;implanter cette m&#233;thode. 
</p>
<p>4 Conclusion
Notre projet g&#233;n&#233;ral est d&#8217;appliquer les techniques de la fouille de donn&#233;es &#224; la d&#233;couverte de 
structures textuelles. Nous avons d&#233;velopp&#233; &#224; cette fin une technique d&#8217;apprentissage non 
supervis&#233; permettant de d&#233;tecter des structures s&#233;quentielles. Elle a permis d&#8217;analyser les 
s&#233;quences de verbes constituant une phrase, et de proposer une classification des apparitions 
de deux verbes successifs en quatre groupes. Nous avons r&#233;ussi &#224; valider s&#233;mantiquement ces 
groupes de mani&#232;re satisfaisante, en nous basant sur des annotations et des statistiques. Cela 
confirme &#224; la fois le bien-fond&#233; de la technique employ&#233;e, et celui de notre couplage des 
temps grammaticaux avec la cat&#233;gorie aspectuelle d&#8217;un verbe.  
</p>
<p>Mais ce travail n'en est encore qu'&#224; ses d&#233;buts, et il nous reste de nombreux points &#224; &#233;lucider. 
Nous regrettons tout d&#8217;abord de ne pas avoir pu comparer nos statistiques globales sur les 
emplois temps/cat&#233;gorie &#224; celles d'autres types de r&#233;cits (et en particulier &#224; celle de r&#233;cits 
simples d'incident au pass&#233;). Il nous reste en effet &#224; d&#233;terminer quelle est la part 
&quot;typologique&quot; des groupes d'encha&#238;nements que nous avons isol&#233;s. Nous n&#8217;avons pas non plus 
eu le temps d&#8217;exploiter les automates probabilistes obtenus &#224; partir de notre m&#233;thode, et ces 
derniers pourraient se r&#233;v&#233;ler int&#233;ressants pour des applications (en particulier en g&#233;n&#233;ration). 
Il reste enfin des am&#233;liorations &#224; apporter &#224; la m&#233;thode g&#233;n&#233;rale pour prendre en compte la 
</p>
<p>387</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Catherine RECANATI, Nicoleta ROGOVSCHI
</p>
<p>structure globale des textes (non prise en compte ici), et la mod&#233;lisation reste &#224; poursuivre 
pour la recherche de s&#233;quences de longueur sup&#233;rieure &#224; 2.
</p>
<p>Remerciements
Nous remercions vivement Y. Bennani pour l'aide pr&#233;cieuse qu'il a apport&#233;e pour le 
d&#233;veloppement de la technique utilis&#233;e, et sans qui ce travail n'aurait pu &#234;tre men&#233; &#224; bien. 
Nous remercions &#233;galement A. Nazarenko et D. Kayser pour leurs aimables relectures. 
</p>
<p>R&#233;f&#233;rences
GOSSELIN L. (1996), S&#233;mantique de la temporalit&#233; en fran&#231;ais, Louvain-la-Neuve : Duculot.
HOPPER J. (1979). Some observations on the typology of focus and aspect in narrative 
language. Studies in Language 3.1, 37-64, Amsterdam : J. Benjamins. 
KOHONEN T., (1995). Self-Organizing Map. Springer.
MARTIN R, NEF F. eds (1981). Le temps grammatical. Langage 64, KAMP H. 39-64, VLACH F.
65-79, VET C. 109-124, Paris : Larousse.
NOUIOUA F., KAYSER D. (2006). Une exp&#233;rience de s&#233;mantique inf&#233;rentielle. Actes de TALN 
2006, 246-255.
RABINER L.R., JUANG B.H. (1986). An Introduction to Hidden Markov models. IEEE ASSP 
Magazine, jan. 86, 4-16. 
RECANATI C., RECANATI F. (1999). La classification de Vendler revue et corrig&#233;e. La
modalit&#233; sous tous ses aspects, Cahiers Chronos 4, 167-184. Amsterdam/Atlanta, GA. 
ROGOVSCHI N. (2006). Syst&#232;mes d'apprentissage non supervis&#233; connexionnistes et 
stochastiques pour la fouille de donn&#233;es structur&#233;es en s&#233;quences. Rapport de stage de Master 
Recherche, LIPN, Universit&#233; Paris 13. 
ROGOVSCHI N., BENNANI Y., RECANATI C. (2007). Apprentissage neuro-markovien pour la 
classification non supervis&#233;e de donn&#233;es structur&#233;es en s&#233;quences. Actes des 7&#232;mes journ&#233;es 
francophones Extraction et Gestion des Connaissances. Namur, Belgique. 
SMITH C. S. (1991). The parameter of aspect, Studies in Linguistics and Philosophy, Kluwer 
Academic publishers. 
VENDLER Z. (1967).  Verbs and Times. Linguistics in Philosophy, 97-121. Ithaca, New-York: 
Cornell University Press. 
VUILLAUME M. (1990). Grammaire temporelle des r&#233;cits. Paris : Minuit. 
VET C. (1994). Relations temporelles et progression th&#233;matique. &#201;tudes Cognitives 1, 
S&#233;mantique des Cat&#233;gories de l'aspect et du Temps, 131-149. Warszawa : acad&#233;mie des 
Sciences de Pologne.
</p>
<p>388</p>

</div></div>
</body></html>