<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Du bruit, du silence et des ambigu&#239;t&#233;s : que faire du TAL pour l'apprentissage des langues ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Que faire du TAL pour l'apprentissage des langues ? 
</p>
<p>Du bruit, du silence et des ambigu&#239;t&#233;s :
que faire du TAL pour l'apprentissage des langues ? 
</p>
<p>Olivier KRAIF, Claude PONTON
LIDILEM - Laboratoire de linguistique et didactique des langues &#233;trang&#232;res 
</p>
<p>et maternelles (http://www.u-grenoble3.fr/lidilem/labo) 
{Olivier.Kraif,Claude.Ponton}@u-grenoble3.fr
</p>
<p>R&#233;sum&#233;. Nous proposons une nouvelle approche pour l&#8217;int&#233;gration du TAL dans les 
syst&#232;mes d&#8217;apprentissage des langues assist&#233; par ordinateur (ALAO), la strat&#233;gie &#171; moins-
disante &#187;. Cette approche tire profit des technologies &#233;l&#233;mentaires mais fiables du TAL et 
insiste sur la n&#233;cessit&#233; de traitements modulaires et d&#233;claratifs afin de faciliter la portabilit&#233; et 
la prise en main didactique des syst&#232;mes. Bas&#233; sur cette approche, ExoGen est un premier 
prototype pour la g&#233;n&#233;ration automatique d&#8217;activit&#233;s lacunaires ou de lecture d&#8217;exemples. Il 
int&#232;gre un module de rep&#233;rage et de description des r&#233;ponses des apprenants fond&#233; sur la 
comparaison entre r&#233;ponse attendue et r&#233;ponse donn&#233;e. L&#8217;analyse des diff&#233;rences graphiques, 
orthographiques et morphosyntaxiques permet un diagnostic des erreurs de type fautes 
d&#8217;orthographe, confusions, probl&#232;mes d&#8217;accord, de conjugaison, etc. La premi&#232;re &#233;valuation 
d&#8217;ExoGen sur un extrait du corpus d&#8217;apprenants FRIDA produit des r&#233;sultats prometteurs 
pour le d&#233;veloppement de cette approche &#171; moins-disante &#187;, et permet d'envisager un mod&#232;le 
d'analyse performant et g&#233;n&#233;ralisable &#224; une grande vari&#233;t&#233; d'activit&#233;s. 
</p>
<p>Abstract. This paper presents the so-called &quot;moins-disante&quot; strategy, a new approach for 
NLP integrating in Computer Assisted Language Learning (CALL) systems. It is based on the 
implementation of basic but reliable NLP techniques, and put emphasis on declarative and 
modular processing, for the sake of portability and didactic implementation. Based on this 
approach, ExoGen is a prototype for generating activities such as gap filling exercises. It 
integrates a module for error detection and description, which checks learners' answers 
against expected ones. Through the analysis of graphic, orthographic and morphosyntactic 
differences, it is able to diagnose problems like spelling errors, lexical mix-up, error prone 
agreement, bad conjugations, etc. The first evaluation of ExoGen outputs, based on the 
FRIDA learner corpus, has yielded very promising results, paving the way for the 
development of an efficient and general model tailored to a wide variety of activities.
</p>
<p>Mots-cl&#233;s : ALAO, apprentissage des langues, diagnostic d'erreur, feed-back d'erreur.
Keywords: CALL, language learning, error diagnosis, error feedback. 
</p>
<p>1 Introduction
Dans le cadre de l&#8217;ALAO (Apprentissage des Langues Assist&#233; par Ordinateur), et plus 
particuli&#232;rement pour les syst&#232;mes dits &#171; de structure &#187; (syst&#232;mes de r&#233;p&#233;titions, 
d&#8217;entra&#238;nement, tutoriels, etc. par opposition aux syst&#232;mes de r&#233;f&#233;rence et aux syst&#232;mes 
</p>
<p>143</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier KRAIF, Claude PONTON
</p>
<p>d&#8217;exploration, cf. Wyatt, 1987; Meunier, 2000), la d&#233;tection et l&#8217;analyse d&#8217;erreurs constituent 
un &#233;l&#233;ment central pour un diagnostic et une production de r&#233;troactions adapt&#233;es permettant 
ainsi un apprentissage interactif, autonome et personnalis&#233;. Or, la plupart de ces syst&#232;mes 
actuels ne disposent que de techniques rudimentaires de tests d&#8217;identit&#233; de cha&#238;nes entre 
&#171; r&#233;ponse donn&#233;e &#187; et &#171; r&#233;ponse attendue &#187;. Ces approches ne peuvent conduire qu&#8217;&#224; de 
simples r&#233;troactions du type vrai/faux n&#8217;offrant pas ainsi &#224; l&#8217;apprenant une possibilit&#233; de 
r&#233;flexion sur les strat&#233;gies qu&#8217;il a mises en &#339;uvre et lui permettre ainsi de modifier sa 
production langagi&#232;re. En traitant les diff&#233;rents niveaux de la langue, le TAL semble pouvoir 
offrir de meilleures perspectives &#224; cette probl&#233;matique. Toutefois, comme le fait remarquer J. 
R&#233;zeau (2001), &#171;(&#8230;) on constate que la quasi-totalit&#233; des didacticiels de langue sur le 
march&#233; &#224; la fin des ann&#233;es 1990 proposent des exercices du premier type (i.e. qui attendent 
une seule r&#233;ponse), et donc une analyse de r&#233;ponse que nous qualifierons de &quot;minimale&quot; (i.e. 
vrai/faux)&#187;. Outre le manque de communication entre les chercheurs et praticiens des 
diff&#233;rents domaines, l&#8217;explication de cette d&#233;saffection du TAL en ALAO d&#233;coule de diverses 
raisons li&#233;es aux contextes didactiques des syst&#232;mes et donc de l&#8217;analyse d&#8217;erreurs. 
</p>
<p>&#138; Analyse de textes libres : Des syst&#232;mes comme FreeText (Granger et al., 2001) ou &#171; le 
correcteur 101 didactique &#187; de la soci&#233;t&#233; Machina Sapiens visent l&#8217;analyse d&#8217;erreurs sur des 
textes libres d&#8217;apprenants. Or, comme le reconna&#238;t lui-m&#234;me S. L&#8217;Haire, l&#8217;un des participants 
au projet FreeText, le syst&#232;me p&#232;che par &#171; une trop grande surd&#233;tection d&#8217;erreurs &#187; (L&#8217;Haire, 
2004). La m&#234;me critique s&#8217;applique au correcteur 101 Didactique. Par exemple, l&#8217;analyse par 
ce logiciel d&#8217;un texte d&#8217;apprenant de niveau interm&#233;diaire issu du corpus FRIDA (Granger et 
al., 2001) produit : 
</p>
<p>&#171; Dans tout le monde, il y a plus que plusieurs langues &#233;trang&#232;res [&#233;tranger]. Ce pour sa [&#231;a], qui 
parler [parle] ou conna&#238;tre plusieurs de langues est [sont] n&#233;cessaire. Mais [mai ?], je crois qui 
parler trois ou quattre langues sont sufficents, parce qui n&#8217;est pas possible &#233;tudier [&#233;tudie?] tout le 
[toutes les] langues. &#187; (d&#233;tection en soulign&#233;, correction propos&#233;e entre crochets)
</p>
<p>Si la d&#233;tection des mots inconnus (quattre, sufficents&#8230;) est relativement bien trait&#233;e, le 
traitement de l&#8217;homophonie indique fr&#233;quemment des erreurs inexistantes. Seuls les accords 
de courtes port&#233;es sont bien analys&#233;s et des erreurs grossi&#232;res d&#8217;analyse syntaxique (* 
plusieurs langues &#233;tranger) compromettent une utilisation en autonomie compl&#232;te. 
</p>
<p>&#138; Analyse de textes sous contr&#244;le : Pour &#233;viter les travers d&#8217;une analyse de textes libres, 
certaines approches ont tent&#233; de contr&#244;ler divers param&#232;tres de la production. Par exemple, le 
syst&#232;me ALEXIA (Selva, Chanier, 2000) travaille sur un domaine cibl&#233; (i.e. celui de l&#8217;emploi 
et du ch&#244;mage) alors que le syst&#232;me ELEONORE (R&#233;ni&#233;, Chanier, 1993) s&#8217;int&#233;resse 
uniquement &#224; la construction des interrogatives. En termes d&#8217;analyse et de feed-back, des 
critiques subsistent certainement mais les r&#233;sultats restent bien plus pr&#233;cis et pertinents que 
pour l&#8217;analyse de textes libres. Le probl&#232;me se situe davantage au niveau du ratio co&#251;t de 
d&#233;veloppement/apport, d&#8217;autant plus que ces d&#233;marches semblent peu g&#233;n&#233;ralisables et 
exportables &#224; d&#8217;autres types d&#8217;activit&#233;s. 
</p>
<p>Ce tour d&#8217;horizon des diverses tentatives d&#8217;utilisation du TAL dans la d&#233;tection/correction des 
fautes ne serait pas complet si nous ne citions pas les correcteurs orthographiques et 
grammaticaux. Contrairement aux syst&#232;mes &#233;voqu&#233;s, ces correcteurs n&#8217;ont pas une vis&#233;e 
didactique, mais ils ont cependant donn&#233; lieu &#224; diff&#233;rentes tentatives d&#8217;utilisation en classe de 
langue. Le constat semble relativement partag&#233; (Cordier-Gauthier, Dion, 2003 ; Charnet, 
Panckhurst, 1998; D&#233;silets, 1998) ; la relative qualit&#233; des analyses tant par le bruit et le 
silence g&#233;n&#233;r&#233;s que par les r&#233;troactions inadapt&#233;es de ce type de logiciels permettent &#224; 
</p>
<p>144</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Que faire du TAL pour l'apprentissage des langues ? 
</p>
<p>l&#8217;enseignant d&#8217;amorcer une r&#233;flexion avec les &#233;l&#232;ves autour des fautes d&#233;tect&#233;es mais 
n&#8217;autorisent en aucun cas un travail en autonomie. En r&#233;sum&#233;, l&#8217;analyse automatique 
d&#8217;erreurs d&#8217;apprenants se heurte &#224; deux probl&#232;mes majeurs. D&#8217;une part, des analyses TAL peu 
fiables car trop bruit&#233;es ou trop silencieuses et, d&#8217;autre part, comme le souligne &#233;galement J. 
R&#233;zeau (2001), du fait des co&#251;ts de recherche et de d&#233;veloppement, ces projets restent 
souvent &#224; l&#8217;&#233;tat de prototypes voire de simples sp&#233;cifications. Face &#224; ces blocages, nous 
proposons une nouvelle approche du probl&#232;me, la strat&#233;gie &#171; moins-disante &#187;. Les parties 3 et 
4 de cet article seront consacr&#233;es &#224; l'&#233;tude des premiers r&#233;sultats d'ExoGen, un syst&#232;me fond&#233; 
sur cette strat&#233;gie. 
</p>
<p>2 Strat&#233;gie &#171; moins-disante &#187; 
La partie pr&#233;c&#233;dente de cet article met en &#233;vidence les faiblesses et les blocages actuels de 
l&#8217;analyse d&#8217;erreurs. Toutefois, nous tirons deux constats principaux de ces diverses 
exp&#233;riences. Le premier concerne la bonne fiabilit&#233; des analyses TAL sous certaines 
conditions : cadre didactique contr&#244;l&#233;, lemmatisation, traitements des accords de courte 
port&#233;e, etc. Le deuxi&#232;me constat prend appui sur les retours d&#8217;enseignants &#224; l&#8217;usage de ces 
syst&#232;mes. L&#8217;exemple suivant en est relativement significatif : 
</p>
<p>&#171; Le Correcteur 101 est int&#233;ressant du fait qu'il am&#232;ne l'&#233;l&#232;ve &#224; se questionner sur sa phrase 
et ses erreurs. Le logiciel n'offre que tr&#232;s rarement la r&#233;ponse. Deux outils sont aussi offerts: 
un dictionnaire et une grammaire. Ils peuvent s'av&#233;rer tr&#232;s utiles pour d&#233;panner. Le langage 
utilis&#233; n'est pas conforme &#224; la grammaire nouvelle, ce serait un atout pour permettre un lien 
&#224; la grammaire &#233;tudi&#233;e en classe. Parfois, le logiciel ne mentionne pas certaines fautes. &#187;1
</p>
<p>La d&#233;tection des erreurs sans correction constitue un atout p&#233;dagogique en soi car il am&#232;ne les 
apprenants &#224; r&#233;fl&#233;chir sur leurs erreurs. La production de r&#233;troactions (aides, explications, 
etc.) adapt&#233;es et didactiquement pertinentes facilitent cette r&#233;flexion et la recherche de 
solutions. Or, la qualit&#233; de ces r&#233;troactions &#233;tant &#233;troitement li&#233;e &#224; la d&#233;tection et &#224; l&#8217;analyse 
des erreurs, ces deux phases doivent &#234;tre contr&#244;l&#233;es pour assurer une fiabilit&#233; et une pr&#233;cision 
maximales. La strat&#233;gie &#171; moins-disante &#187; que nous d&#233;veloppons est un corollaire de ces 
constats. C&#8217;est une approche empirique qui se base sur les hypoth&#232;ses suivantes : 
</p>
<p>- Il existe un ensemble de technologies TAL fiables (tokenisation, lemmatisation, 
&#233;tiquetage morpho-syntaxique&#8230;) pouvant fournir des &#233;l&#233;ments de d&#233;tection et 
d&#8217;analyse des erreurs pertinents. 
</p>
<p>- L&#8217;analyse hors-contr&#244;le du contexte de production n&#8217;est actuellement pas 
envisageable. Il est donc n&#233;cessaire de ma&#238;triser, d'un point de vue final (i.e. 
didactique), les insuffisances du TAL. Dans notre cas, la connaissance des r&#233;ponses 
attendues, qui permet des comparaisons, de lever des ambig&#252;it&#233;s, de cibler les 
analyses, etc., constitue une donn&#233;e du syst&#232;me. 
</p>
<p>- La fiabilit&#233; &#224; 100% des analyses reste, et &#224; notre avis restera, un objectif inaccessible. 
Pour &#233;viter ce travers, nous pr&#233;f&#233;rons privil&#233;gier &#171; l&#8217;aide &#224;&#8230; &#187; &#224; l&#8217;automatisation des 
proc&#233;d&#233;s. Effectivement, dans ce contexte, le TAL nous semble pouvoir am&#233;liorer 
sensiblement les diff&#233;rents niveaux de la cha&#238;ne d&#8217;ALAO : aide au choix d&#8217;exemples 
</p>
<p>1 Critique d&#8217;une enseignante sur son utilisation du Correcteur 101 didactique en classe (http://c-
rdi.qc.ca/produits/aff_fiche.asp?fiche=426, consult&#233; le 31/01/2007). A noter que les autres critiques post&#233;es 
sur ce site vont globalement toutes dans ce sens. 
</p>
<p>145</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier KRAIF, Claude PONTON
</p>
<p>(Antoniadis et al., 2007), aide &#224; la g&#233;n&#233;ration d&#8217;activit&#233;s (Antoniadis et al., 2005) ou 
encore l&#8217;aide &#224; l&#8217;autocorrection (&#233;valuation formative) qui constitue le sujet de cet 
article.
</p>
<p>- En cas d&#8217;ambig&#252;it&#233;, conserver la multiplicit&#233; des r&#233;sultats pour une prise de d&#233;cision 
au niveau didactique 
</p>
<p>- D&#233;velopper une approche d&#233;clarative et modulaire des traitements pour permettre une 
&#233;volution du syst&#232;me et de ses ressources. 
</p>
<p>La mise en &#339;uvre de notre approche (cf. figure 1) est comparable &#224; la reprise, par D. Anctil 
(2005), de &#171; la strat&#233;gie de r&#233;solution de probl&#232;mes &#187; d&#233;velopp&#233;e par T. Andre (1986).  
</p>
<p>Figure 1 : Mise en &#339;uvre de la strat&#233;gie &#171; moins-disante &#187;  
</p>
<p>production 
apprenant enrichissement rep&#233;rage/
</p>
<p>description
</p>
<p>production 
apprenant
enrichie
</p>
<p>corrig&#233; de 
l&#8217;activit&#233;
enrichi
</p>
<p>production
r&#233;troaction
</p>
<p>proc&#233;dures TAL 
g&#233;n&#233;riques 
</p>
<p>proc&#233;dures TAL 
sp&#233;cifiques
</p>
<p>(triangulation)
</p>
<p>production 
apprenant
</p>
<p>avec
descriptions 
des erreurs  
</p>
<p>connaissances
contextuelles
</p>
<p>production 
corrig&#233;e
</p>
<p>connaissances
didactiques
</p>
<p>activit&#233; 
</p>
<p>Phase d&#8217;analyse 
Phase de r&#233;solution
</p>
<p>diagnostic
</p>
<p>Il s&#8217;agit de s&#233;parer la phase d&#8217;analyse du probl&#232;me (i.e. l&#8217;erreur de l&#8217;apprenant pour notre 
syst&#232;me) de sa phase de r&#233;solution ; cette derni&#232;re passe par la production de r&#233;troactions 
adapt&#233;es qui feront l&#8217;objet d&#8217;&#233;tudes ult&#233;rieures en collaboration avec des enseignants et des 
didacticiens. La phase de r&#233;solution permet, quant &#224; elle, une distinction entre rep&#233;rage, 
description et analyse de ce probl&#232;me. Comme chez D. Anctil, nous avons r&#233;uni les &#233;tapes de 
rep&#233;rage et de description du probl&#232;me. En se basant sur un pr&#233;traitement2 g&#233;n&#233;rique &#224; la fois 
de la production de l&#8217;apprenant et du corrig&#233; de l&#8217;activit&#233;, cette phase consiste en une analyse 
fine des diff&#233;rences entre r&#233;ponses donn&#233;es (RD) et r&#233;ponses attendues (RA). La 
d&#233;sambigu&#239;sation de ces analyses repose sur une triangulation entre RD, RA et le contexte.3
</p>
<p>L&#8217;&#233;tape d&#8217;analyse du probl&#232;me (appel&#233;e diagnostic) consiste, en fonction de connaissances 
sur le contexte de production (type d&#8217;activit&#233;, mod&#232;le apprenant, etc.) &#224; rechercher les causes 
</p>
<p>2 Il s&#8217;agit ici d&#8217;un enrichissement de la production de l&#8217;apprenant &#224; l&#8217;aide de proc&#233;dures de tokenisation, 
d&#8217;analyse morpho-syntaxique, etc. 
</p>
<p>3 Par exemple, pour une activit&#233; portant sur l'accord du participe pass&#233; apr&#232;s l'auxiliaire avoir, si la forme 
correcte comporte des flexions (f&#233;minin ou pluriel) on peut en d&#233;duire que le verbe est transitif et qu'il existe 
un COD pr&#233;c&#233;dant le participe pass&#233; : ces inf&#233;rences, &#233;troitement li&#233;es &#224; l'activit&#233;, permettent de 
d&#233;sambigu&#239;ser les r&#233;sultats d'une analyse classique (&#233;tiquetage) et d'appliquer ensuite des r&#232;gles simplifi&#233;es 
pour le diagnostic. 
</p>
<p>146</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Que faire du TAL pour l'apprentissage des langues ? 
</p>
<p>potentielles de l&#8217;erreur et &#224; s&#233;lectionner les informations pertinentes et fiables permettant un 
calcul de la r&#233;troaction. 
</p>
<p>3 L'exemple du syst&#232;me ExoGen 
Pour valider notre approche, nous avons d&#233;velopp&#233; un prototype, nomm&#233; ExoGen, qui permet 
la g&#233;n&#233;ration d'activit&#233;s &#224; partir d'un corpus de textes lemmatis&#233;s et &#233;tiquet&#233;s. Les activit&#233;s 
propos&#233;es sont de type &quot;lecture d'exemples&quot; et &quot;exercices lacunaires&quot;, et sont fond&#233;es sur 
l'extraction al&#233;atoire de phrases contenant des patterns d'expressions r&#233;guli&#232;res portant sur les 
formes, les lemmes, les cat&#233;gories et les traits morphosyntaxiques (Kraif, 2006). Ces patterns 
permettent par exemple d'identifier des constructions telles qu'un participe pass&#233; dans un 
contexte de pass&#233; compos&#233; avec l'auxiliaire avoir, ou une flexion irr&#233;guli&#232;re pour le pluriel 
d'un nom, etc. A chaque g&#233;n&#233;ration d'activit&#233;, on peut obtenir un exercice lacunaire portant 
par exemple sur l'accord du participe pass&#233; avec l'auxiliaire avoir, les participes pass&#233;s ayant 
&#233;t&#233; escamot&#233;s et remplac&#233;s par leur forme lemmatis&#233;e. Ce mod&#232;le de g&#233;n&#233;ration d'activit&#233;, 
tr&#232;s simple (analogue &#224; celui du syst&#232;me Alfalex), se pr&#234;te bien &#224; l'analyse d'erreur 
pr&#233;c&#233;demment d&#233;crite, bas&#233;e sur la comparaison entre la r&#233;ponse attendue RA et la r&#233;ponse 
donn&#233;e RD. 
</p>
<p>Dans cette premi&#232;re impl&#233;mentation, nous n'avons pas recouru au principe de triangulation, 
selon lequel l'analyse de la r&#233;ponse attendue permettrait de d&#233;sambigu&#239;ser &#224; la fois le contexte 
et la r&#233;ponse donn&#233;e, en vue d'appliquer une r&#232;gle d&#233;clarative de diagnostic. Nous nous 
sommes content&#233;s d'appliquer une heuristique simple lors de la phase d'analyse des 
diff&#233;rences, qui permet de privil&#233;gier, en cas d'ambigu&#239;t&#233;, les analyses maximisant la 
similitude entre RA et RD (dans l'id&#233;e que cette similitude n'est pas fortuite). Qui plus est, 
nous n'utilisons pas les donn&#233;es issues de l'&#233;tiquetage et de la lemmatisation (obtenus avec 
Treetagger), afin de montrer jusqu'o&#249; cette heuristique permet de d&#233;sambigu&#239;ser sans 
traitement pr&#233;alable. 
</p>
<p>L'analyse et le diagnostic sont donc bas&#233;s sur la seule comparaison de RA et de RD, 
ind&#233;pendamment de tout contexte. Pour comparer ces deux formes nous ne disposons que 
d'une seule source d'information externe (en dehors des formes elles-m&#234;mes) : les analyses 
possibles des formes fl&#233;chies, donn&#233;es par le dictionnaire de formes fl&#233;chies mis en ligne par 
l'ABU (http://abu.cnam.fr/). Chaque entr&#233;e de ce dictionnaire est une forme fl&#233;chie simple, &#224; 
laquelle sont associ&#233;s un lemme et les analyses possibles en terme de combinaison de traits 
morphosyntaxiques (nombre, genre, personne, temps, mode, etc.). La figure 2 donne un 
&#233;chantillon de quelques enregistrements de ce dictionnaire. 
</p>
<p>glace glacer Ver:IPre+SG+P1:IPre+SG+P3:SPre+SG+P1:SPre+SG+P3:ImPre+SG+P2 
glac&#233; glacer Ver:PPas+Mas+SG 
glacent glacer Ver:IPre+PL+P3:SPre+PL+P3 
glacera glacer Ver:IFut+SG+P3 
glaceraient glacer Ver:CPre+PL+P3 
</p>
<p>Figure 2 : Un extrait du dictionnaire de formes fl&#233;chies 
</p>
<p>L'analyse repose sur une hi&#233;rarchisation des diff&#233;rences observ&#233;es entre RA et RD : on traite 
en priorit&#233; les diff&#233;rences les plus l&#233;g&#232;res et les plus superficielles, c'est-&#224;-dire celles qui 
requi&#232;rent le moins d'inf&#233;rence. A priori, ce sont aussi celles qui m&#232;nent aux diagnostics les 
plus s&#251;rs : 
</p>
<p>147</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier KRAIF, Claude PONTON
</p>
<p>1. Diff&#233;rences graphiques. Espacements, majuscules, variantes graphiques (p. ex. ligatures 
telle que oe et &#339;), etc. Ces diff&#233;rences, peuvent donner lieu &#224; la validation de RD comme 
&#233;tant correcte, sauf si l'exercice porte explicitement sur ces aspects (usage des majuscules, 
r&#233;forme de l'orthographe, &#8230;). 
</p>
<p>2. Diff&#233;rences orthographiques. Si RD est absente du dictionnaire de formes fl&#233;chies, 
plusieurs cas peuvent &#234;tre consid&#233;r&#233;s : 
</p>
<p>a) RD ressemble &#224; RA 
 i/ RD est identique &#224; RA si l'on n&#233;glige les signes diacritiques (accents, c&#233;dille) 
 ii/ RD est une forme inconnue du dictionnaire 
b) RD ne ressemble pas &#224; RA 
 i/ RD est une forme inconnue du dictionnaire, voisine de certaines formes connues 
 ii/ RD est une forme inconnue du dictionnaire, et aucune forme voisine n'a &#233;t&#233; trouv&#233;e 
</p>
<p>La ressemblance peut &#234;tre calcul&#233;e par une fonction de Levenshtein, ou de recherche de la 
plus longue sous-cha&#238;ne commune (Kraif, 2001). Les formes voisines peuvent &#234;tre trouv&#233;es 
gr&#226;ce &#224; une fonction de hachage dont les cl&#233;s correspondraient &#224; une &#233;criture simplifi&#233;e (sans 
lettre double, sans accent, sans finales muettes, avec r&#233;duction des variantes graphiques, etc.). 
Chacun de ces cas peut donner lieu &#224; un feed-back sp&#233;cifique, en fonction du contexte 
didactique. Par exemple pour 2.a.i, on pourrait avoir &quot;Accentuation incorrecte&quot;, pour 2.a.ii 
&quot;Faute d'orthographe&quot;, pour 2.b.ii &quot;Pensiez-vous &#224; une de ces formes : [formes voisines]&quot;, etc. 
</p>
<p>3. Diff&#233;rences morphosyntaxiques. Si RD est connue dans le dictionnaire, on peut calculer 
ses lemmes potentiels, ainsi que les cat&#233;gories et structures de traits aff&#233;rentes. La 
comparaison peut alors porter sur chacun de ces aspects : 
</p>
<p>a) RD et RA correspondent &#224; un m&#234;me lemme 
 i/ RD et RA correspondent &#224; une m&#234;me cat&#233;gorie. Dans ce cas, seuls leurs traits les 
diff&#233;rencient.
 ii/ RD et RA correspondent &#224; un m&#234;me lemme, mais avec des cat&#233;gories diff&#233;rentes. P.ex. 
RD=&quot;&#234;tres&quot; (&#234;tre-Nom-PL), RA=&quot;&#234;tes&quot; (&#234;tre-Ver-P2-PL). 
b) RD et RA correspondent &#224; des lemmes diff&#233;rents 
 i/ RD et RA correspondent &#224; une m&#234;me cat&#233;gorie avec les m&#234;mes traits (p. ex. 
RA=&quot;trouverons&quot; vs RD=&quot;penserons&quot;).
 ii/ RD et RA correspondent &#224; une m&#234;me cat&#233;gorie avec des traits diff&#233;rents (p.ex. 
RA=&quot;conscience&quot;, RD=&quot;connaissances&quot;) 
 iii/ RD et RA correspondent &#224; des cat&#233;gories diff&#233;rentes (p. ex. RD=&quot;mieux&quot; (Adv) vs 
RA=&quot;pr&#233;f&#233;rable&quot; (Adj)). 
</p>
<p>L'&#233;tude des cas est donc guid&#233;e par les similarit&#233;s, le long d'un continuum allant de l'identit&#233; &#224; 
la diff&#233;rence compl&#232;te. Notre heuristique se fonde sur l'id&#233;e sous-jacente que les similarit&#233;s 
sont rarement fortuites, tandis que les diff&#233;rences, elles, sont plus difficiles &#224; syst&#233;matiser. On 
peut en tirer une m&#233;thode de d&#233;sambigu&#239;sation lors de la comparaison des traits ou des 
cat&#233;gories. Par exemple : 
</p>
<p>RA : si j'avais su  Cat&#233;gorie : Ver Traits : IImp+SG+P1 ou IImp+SG+P2 
RD : si j'aurais su Cat&#233;gorie : Ver Traits : CPre+SG+P1 ou CPre+SG+P2 
</p>
<p>Ici, on observe des diff&#233;rences au niveau du temps/mode ainsi que pour la personne : P1 z P2, 
CPre z IImp. On peut donc avoir 4 analyses diff&#233;rentes pour le couple (RA, RD). Gr&#226;ce &#224; 
l'heuristique de moindre diff&#233;rence, on ne compare que les analyses les plus proches (entre 
pointill&#233;s), ce qui permet de ne retenir qu'une seule diff&#233;rence de trait, entre le conditionnel 
</p>
<p>148</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Que faire du TAL pour l'apprentissage des langues ? 
</p>
<p>pr&#233;sent et l'imparfait : CPre z IImp. Le feed-back correspondant pourrait &#234;tre &quot;Dans ce 
contexte, utilisez un imparfait plut&#244;t qu'un conditionnel pr&#233;sent&quot;. 
</p>
<p>L'analyse pourrait se poursuivre sur le plan s&#233;mantique : lorsqu'on trouve deux lemmes 
distincts, de m&#234;me cat&#233;gorie, on peut &#233;valuer leur proximit&#233; s&#233;mantique, par exemple en se 
basant sur une ressource du type dictionnaire de synonymes, th&#233;saurus, r&#233;seau s&#233;mantique, 
etc. (cette fonctionnalit&#233; n'est pas encore impl&#233;ment&#233;e dans notre prototype). Dans le cas 
d'unit&#233;s polys&#233;miques, l'heuristique de moindre diff&#233;rence permet encore de d&#233;sambigu&#239;ser. 
Par exemple, si RA=&quot;pomme de pin&quot;, RD=&quot;pignon&quot;, et si le dictionnaire propose plusieurs 
acceptions pour &quot;pignon&quot; (/fruit/, /engrenage/) la comparaison RD/RA permettra de choisir 
l'acception la plus proche (i.e. le chemin le plus court &#224; travers le graphe repr&#233;sentant les 
relations s&#233;mantiques). 
</p>
<p>4 &#201;valuation
Pour &#233;valuer cette m&#233;thode simple d'analyse et de d&#233;sambigu&#239;sation des erreurs, il nous 
faudrait un corpus de r&#233;ponses d'apprenants, obtenues dans le cadre d'activit&#233;s de type QROC 
(questions &#224; r&#233;ponse ouverte courte), telles que des exercices lacunaires ou des quiz. Pour 
chaque r&#233;ponse donn&#233;e, on pourrait ainsi appliquer l'analyse des erreurs en fonction de la 
r&#233;ponse attendue. Bien que la constitution d'un corpus de ce genre soit pr&#233;vue dans les 
d&#233;veloppements ult&#233;rieurs d'ExoGen, nous ne disposons pas encore de telles donn&#233;es 
empiriques. Pour l'&#233;valuation, nous avons donc utilis&#233; une autre ressource, &#224; savoir des 
exemples issus du corpus FRIDA (FRench Interlanguage DAtabase), constitu&#233; dans le cadre 
du projet Freetext (Granger et al., 2001). Il s&#8217;agit d&#8217;un corpus de r&#233;daction d&#8217;apprenants de 
diff&#233;rents niveaux et de diff&#233;rentes langues maternelles pour lequel les erreurs ont &#233;t&#233; 
identifi&#233;es manuellement et balis&#233;es en fonction d'une typologie indiquant le domaine 
(morphologie, grammaire, lexique, etc.), la cat&#233;gorie ( agglutination, graphie, genre, etc.) et la 
cat&#233;gorie grammaticale de la forme erron&#233;e. Pour chaque erreur identifi&#233;e, les annotateurs ont 
indiqu&#233; une correction. Ce corpus permet donc d'extraire des couples forme erron&#233;e / forme 
corrig&#233;e comparables aux couples RD / RA issus des QROC. On en tire des exemples du 
type : 
</p>
<p>(&#8230;) une seule monnaie (l'ECU) n'adresse pas bien au gouvernement anglais. 
Forme erron&#233;e : adresse, Forme corrig&#233;e : convient 
</p>
<p>Cette &#233;valuation peut comporter un biais, car le rapport RD/RA n'est pas identique &#224; celui 
R&#233;ponse erron&#233;e/R&#233;ponse corrig&#233;e : dans le cadre d'un CROQ, la r&#233;ponse attendue et son 
contexte pr&#233;existent &#224; la r&#233;ponse donn&#233;e, tandis qu'ici, les r&#233;ponses corrig&#233;es sont donn&#233;es a
posteriori, en fonction d'une erreur et d'un contexte issu d'une production libre. Mais nous 
pensons que ce biais est limit&#233; du point de vue de l'analyse des diff&#233;rences, car le m&#234;me genre 
d'&#233;cart est observ&#233;, et la m&#233;thode d'analyse est confront&#233;e au m&#234;me type d'ambigu&#239;t&#233;s (de 
lemme, de cat&#233;gorie, de traits, de sens). 
</p>
<p>Nous avons utilis&#233; un &#233;chantillon de 47 productions d'apprenants anglophones, de niveau 
variable. Ont &#233;t&#233; retenues toutes les erreurs impliquant deux formes simples (du fait des 
limitations de notre dictionnaire), hors ponctuation, pour un total de 318 cas d'erreurs. Pour 
chaque erreur nous avons appliqu&#233; l'analyse des diff&#233;rences, et obtenu des descriptions 
correspondant &#224; 16 cas possibles, avec des pr&#233;cisions concernant les lemmes, cat&#233;gories ou 
traits identifi&#233;s. On obtient par exemple les sorties suivantes : 
</p>
<p>149</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier KRAIF, Claude PONTON
</p>
<p>Exemple d'erreur Description (obtenue automatiquement) 
(&#8230;) avant de retourner (arriver) en Angleterre. Forme grammaticalement correcte (verbe 
</p>
<p>infinitif), mais on attendait une autre forme. 
et beaucoup d&#8217;&#233;chafaide (&#233;chafaudages). Orthographe erron&#233;e ou mot inconnu du 
</p>
<p>dictionnaire.
Je dois me d&#233;p&#233;cher (d&#233;p&#234;cher). Orthographe erron&#233;e : probl&#232;me d'accent. 
</p>
<p>(&#8230;) sommes bien amus&#233;es et c'est vrai (juste) de 
dire que nous avons dans&#233; assez bien 
</p>
<p>Forme grammaticalement correcte (adjectif ou 
adverbe ou nom masculin singulier), mais on 
</p>
<p>attendait une autre forme 
C&#8217;&#233;tait d&#233;sesp&#233;r&#233; (d&#233;sesp&#233;rant) mais c&#8217;&#233;tait la 
</p>
<p>seule chance (&#8230;) 
S'il s'agit du verbe d&#233;sesp&#233;rer :
</p>
<p>cas 1 [masculin singulier] : On attend un 
participe pr&#233;sent et non un participe pass&#233;. 
</p>
<p>Pour moi l&#8217; (cette) image cr&#233;e une ambiance 
d&#233;lassante
</p>
<p>Forme grammaticalement correcte sur le plan de 
la cat&#233;gorie (d&#233;terminant), mais on attendait une 
</p>
<p>autre forme avec d'autres traits. 
le Premier ministre reste toujours un 
</p>
<p>britannique (Britannique)
Exact, mais il faut une majuscule &#224; l'initiale. 
</p>
<p>Tableau 3 : Exemples d'erreurs (corrig&#233;es entre parenth&#232;ses) et descriptions correspondantes 
</p>
<p>On constate que dans certains cas la d&#233;sambigu&#239;sation est partielle, ce qui n'emp&#234;che pas de 
donner une description pertinente. Pour une &#233;valuation chiffr&#233;e des r&#233;sultats, nous avons 
&#233;valu&#233; manuellement la correction des affirmations li&#233;es aux diff&#233;rentes analyses. En outre, 
nous avons not&#233;, pour tous les cas o&#249; les formes (erron&#233;es et corrig&#233;es) recelaient des 
ambigu&#239;t&#233;s (analyses multiples), si la d&#233;sambigu&#239;sation est totale, partielle ou nulle. 
</p>
<p>Tous les cas Non ambigus Compl&#232;tement 
d&#233;sambigu&#239;s&#233;s
</p>
<p>Partiellement 
d&#233;sambigu&#239;s&#233;s 
</p>
<p>Non
d&#233;sambigu&#239;s&#233;s
</p>
<p>Corrects 312 187 104 14 7
Incorrects 6 1 5 0 0
Pr&#233;cision 0,981 0,995 0,954 1 1
</p>
<p>Tableau 4 : Evaluation de la correction des descriptions d'erreur 
</p>
<p>On constate que la pr&#233;cision est tr&#232;s satisfaisante. L'heuristique de d&#233;sambigu&#239;sation, op&#233;rante 
dans 1/3 des cas, aboutit tr&#232;s fr&#233;quemment &#224; une d&#233;sambigu&#239;sation compl&#232;te, avec un peu 
moins de 5% d'erreurs. Dans de nombreux cas, l'heuristique aboutit &#224; une r&#233;duction 
spectaculaire des ambigu&#239;t&#233;s :  
</p>
<p>une seul monnaie (l'ECU) n' adresse (convient) pas bien au gouvernement anglais. 
</p>
<p>Ici adresse peut correspondre &#224; deux lemmes diff&#233;rents (adresse et adresser), deux cat&#233;gories 
diff&#233;rentes (nom et verbe) et de nombreuses structures de traits (le dictionnaire en donne 6 : 
Nom:Fem+SG, Ver:IPre+SG+P1, IPre+SG+P3, SPre+SG+P1, SPre+SG+P3, ImPre+SG+P2). 
La comparaison avec convient permet de conserver la seule interpr&#233;tation commune : verbe &#224; 
l'indicatif pr&#233;sent, troisi&#232;me personne du singulier. Quant aux analyses erron&#233;es, elles sont 
dues &#224; deux ph&#233;nom&#232;nes : 
</p>
<p>- Lacune du dictionnaire (2 cas) : dans l'exemple ci-dessous, le dictionnaire n'enregistre pas 
futur comme nom potentiel, mais seulement comme adjectif. 
</p>
<p>le futur (avenir) de l'Angleterre -&gt; &quot;On attendait une autre forme, d'une autre cat&#233;gorie 
grammaticale (Nom#Adj).&quot; 
</p>
<p>150</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Que faire du TAL pour l'apprentissage des langues ? 
</p>
<p>- Mauvaise d&#233;sambigu&#239;sation (4 cas) : dans l'exemple suivant, la forme corrig&#233;e est 
interpr&#233;t&#233;e comme le d&#233;terminant tous, et non comme un pronom : 
</p>
<p>l'heure de se joindre et de parler tout (tous) d'une voix -&gt; &quot;S'il s'agit du Det tout on a : 
cas 1 [Masculin] : On attend un pluriel et non un singulier.&quot; 
</p>
<p>Notons que m&#234;me si la d&#233;sambigu&#239;sation est mauvaise, le feed-back donn&#233; &#224; l'apprenant peut 
pr&#233;senter une analyse comme hypoth&#233;tique, ce qui &#233;vite d'affirmer une contre-v&#233;rit&#233;. Par 
ailleurs certaines ambigu&#239;t&#233;s peuvent &#234;tre r&#233;duites en s&#233;lectionnant les informations donn&#233;es &#224; 
l'utilisateur. Prenons l'exemple suivant : 
</p>
<p>Soudain, nous avons entendus (entendu) un bruit -&gt; &quot;S'il s'agit du verbe entendre 
[participe pass&#233; masculin], on attend un singulier et non un pluriel ; S'il s'agit de 
l'adjectif entendu [masculin] on attend un singulier et non un pluriel ; s'il s'agit du nom 
entendu [masculin] on attend un singulier et non un pluriel.&quot; 
</p>
<p>L'analyse donne un r&#233;sultat ambigu (verbe, adjectif ou nom) mais l'analyse concernant les 
traits est toujours la m&#234;me, et peut aboutir au feed-back suivant : &quot;on attend un singulier et 
non un pluriel&quot;. Sur la base de la strat&#233;gie moins-disante, on pourra se contenter de cette 
information, incompl&#232;te mais fiable, et centr&#233;e sur l'erreur commise par l'apprenant. 
</p>
<p>5 Conclusion
Nous avons pr&#233;sent&#233; un cadre g&#233;n&#233;ral pour l'analyse des r&#233;ponses d'apprenant, bas&#233; sur la 
comparaison entre r&#233;ponse donn&#233;e et r&#233;ponse attendue, en se limitant &#224; des productions 
contr&#244;l&#233;es, tant sur le plan de la forme qu'au niveau du contexte didactique. Ces limitations 
permettent selon nous de mettre en &#339;uvre des techniques fiables dont les analyses 
n'outrepassent pas les capacit&#233;s actuelles des syst&#232;mes de TAL. Cette approche, qualifi&#233;e de 
&quot;moins disante&quot; permet selon nous, lorsque le contexte didactique est suffisamment sp&#233;cifi&#233; 
(de la d&#233;finition d'une consigne &#224; la mise en oeuvre de r&#233;troactions adapt&#233;es), de 
diagnostiquer des fautes d'orthographe, des confusions, des probl&#232;mes d'accord, de 
conjugaison, etc. Dans cette optique, nous avons impl&#233;ment&#233; et &#233;valu&#233; une m&#233;thode simple 
d'analyse des r&#233;ponses, avec une heuristique de d&#233;sambigu&#239;sation tirant parti des &#233;carts avec 
les r&#233;ponses attendues. Les r&#233;sultats sont encourageants, avec une pr&#233;cision sup&#233;rieure &#224; 98%.
</p>
<p>L'&#233;tape suivante consistera &#224; mettre en &#339;uvre des r&#232;gles de diagnostic, afin de d&#233;terminer les 
causes probables des erreurs (p.ex. un accord erron&#233; d'un participe pass&#233; avec le sujet de 
l'auxiliaire avoir). Pour qu'un tel syst&#232;me soit g&#233;n&#233;ralisable et puisse s'adapter facilement &#224; 
des activit&#233;s vari&#233;es, il est important de d&#233;finir un langage simple et d&#233;claratif pour la mise en 
&#339;uvre des r&#232;gles de diagnostic : c'est &#224; notre avis une condition indispensable &#224; 
l'appropriation de ces techniques par les p&#233;dagogues, qui seuls sont qualifi&#233;s pour interpr&#233;ter 
les erreurs, d&#233;terminer leurs causes, et ensuite d&#233;finir des r&#233;troactions adapt&#233;es. 
</p>
<p>Pour y parvenir, nous pr&#233;voyons de d&#233;velopper des techniques de d&#233;sambigu&#239;sation plus 
fines, bas&#233;es sur une triangulation entre RA/RD et leur contexte linguistique. Cette &#233;tape, 
d&#233;passant les outils g&#233;n&#233;riques tels que l'&#233;tiquetage et la lemmatisation, constituera un module 
de TAL relativement autonome, et g&#233;n&#233;ralisable &#224; de nombreux types d'activit&#233;s en ALAO. 
</p>
<p>151</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier KRAIF, Claude PONTON
</p>
<p>R&#233;f&#233;rences
ANCTIL D. (2005). Ma&#238;trise du lexique chez les &#233;tudiants universitaires : typologie des 
probl&#232;mes lexicaux et analyse des strat&#233;gies de r&#233;solution de probl&#232;mes lexicaux. M&#233;moire 
de M.A. Facult&#233; des Sciences de l&#8217;Education. Universit&#233; de Montr&#233;al (Qu&#233;bec). 
</p>
<p>ANDRE T. (1986). Problem solving and education. San Diego, CA: Academic Press.  
</p>
<p>ANTONIADIS G., ECHINARD, S., KRAIF O., LEBARB&#201; T. &amp; PONTON C. (2005). Mod&#233;lisation de 
l'int&#233;gration de ressources TAL pour l'apprentissage des langues : la plateforme MIRTO. 
ALSIC, vol. 8, n&#176; 1. pp. 65-79. 
</p>
<p>ANTONIADIS G., KRAIF O., PONTON C., ZAMPA V. (2007). Un outil exploratoire de corpus 
d&#8217;apprenants. Actes de UNTELE&#8217;07. Universit&#233; de Compi&#232;gne. 29-31 mars 2007 (&#224; para&#238;tre). 
</p>
<p>CHARNET C., PANCKHURST R. (1998). Le correcteur grammatical : un auxiliaire efficace pour 
l&#8217;enseignant ? Quelques &#233;l&#233;ments de r&#233;flexion. ALSIC, vol. 1, 2. pp. 103-114.
</p>
<p>D&#201;SILETS M. (1998). Que penser de l'utilisation des logiciels correcteurs &#224; l'&#233;cole? Vie
p&#233;dagogique. No 107. avril-mai 1998. 9-11.  
</p>
<p>GRANGER, S., VANDEVENTER, A., HAMEL, M.-J. (2001). Analyse des corpus d&#8217;apprenants 
pour l&#8217;ELAO bas&#233; sur le TAL. Traitement automatique des langues. 42 (2). 609-621.
</p>
<p>KRAIF O. (2006) Extraction automatique de lexique bilingue : application pour la recherche 
d'exemples en lexicographie, Journ&#233;es du CRTT, Universit&#233; Lyon 2, Lyon. 
</p>
<p>KRAIF O. (2001) Exploitation des cognats dans les syst&#232;mes d&#8217;alignement bi-textuel : 
architecture et &#233;valuation, TAL 42 :3, ATALA, Paris, pp. 833-867. 
</p>
<p>L&#8217;HAIRE S. (2004). Vers un feed-back plus intelligent, les enseignements du projet Freetext. 
Actes de la journ&#233;e TALAL. Grenoble. 1-12. 
</p>
<p>MEUNIER L. E. (2000). La typologie des intelligences humaine et artificielle : complexit&#233;  
p&#233;dagogique de l&#8217;enseignement des langues &#233;trang&#232;res dans un environnement multim&#233;dia. 
Apprendre une langue dans un environnement multim&#233;dia. Les &#233;ditions Logiques : sous la 
direction de Duquette L. et Laurier M. Outremont (Qu&#233;bec). 211-253. 
</p>
<p>R&#201;NI&#201; D., CHANIER T. (1993). La mod&#233;lisation de l'acquisition, une &#233;tape dans la construction 
de syst&#232;mes d'EIAO des langues: le cas des interrogatives en fran&#231;ais langue seconde. 
Environnements Interactifs d'Apprentissage avec Ordinateur. Tome 1. Eyrolles. 123-134.  
</p>
<p>R&#201;ZEAU J. (2001). M&#233;diatisation et m&#233;diation p&#233;dagogique dans un environnement 
multim&#233;dia. Le cas de l&#8217;apprentissage de l&#8217;anglais en Histoire de l&#8217;art &#224; l&#8217;universit&#233;. Th&#232;se 
de troisi&#232;me cycle. Universit&#233; Bordeaux II, France.  
</p>
<p>SELVA, T., CHANIER, T. (2000). G&#233;n&#233;ration automatique d'activit&#233;s Lexicales dans le syst&#232;me 
ALEXIA. Sciences et Techniques Educatives, (STE), 7 (2). 385-412. 
</p>
<p>WYATT D. H. (1987). Applying pedagogical principles to CALL courseware development. 
Modern Media in Foreign Language Education. Wm. Flint Smith (dir.). Lincolnwood, IL : 
National Textbook. 85-98.
</p>
<p>152</p>

</div></div>
</body></html>