<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse syntaxique et traitement automatique du syntagme nominal grec moderne</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Analyse syntaxique et traitement automatique
du syntagme nominal grec moderne  
</p>
<p>Athina MICHOU
LATL &#8211; Universit&#233; de Gen&#232;ve 
</p>
<p>Athina.Michou@lettres.unige.ch
</p>
<p>R&#233;sum&#233;.  Cet article d&#233;crit le traitement automatique du syntagme nominal en grec 
moderne par le mod&#232;le d&#8217;analyse syntaxique multilingue Fips. L&#8217;analyse syntaxique 
linguistique est focalis&#233;e sur les points principaux du DP grec : l&#8217;accord entre les constituants 
fl&#233;chis, l&#8217;ordre flexible des constituants, la cliticisation sur les noms et le ph&#233;nom&#232;ne de la 
polyd&#233;finitude. Il est montr&#233; comment ces ph&#233;nom&#232;nes sont trait&#233;s et impl&#233;ment&#233;s dans le 
cadre de l&#8217;analyseur syntaxique FipsGreek, qui met en &#339;uvre un formalisme inspir&#233; de la 
grammaire g&#233;n&#233;rative chomskyenne. 
</p>
<p>Abstract.   This article describes an automatic treatment to the Modern Greek noun phrase 
in terms of the Fips multilingual syntactic parser. The syntactic analysis focuses on the main 
issues related to the Greek DP: the agreement among the inflected constituents, the relatively 
free constituent order, noun cliticisation, and the polydefiniteness phenomenon. The paper 
discusses how these processes are treated and implemented within the FipsGreek parser, 
which puts forth a formalism relying on Chomsky&#8217;s generative grammar. 
</p>
<p>Mots-cl&#233;s :  analyseur grec, analyse morphosyntaxique, syntagme nominal, grec 
moderne. 
</p>
<p>Keywords: Greek parser, morphosyntactic analysis, determiner phrase, modern Greek. 
</p>
<p>1 Introduction
C&#8217;est aux ann&#233;es &#8217;70 que remonte l&#8217;&#233;tude du grec moderne sous l&#8217;angle des th&#233;ories 
linguistiques modernes; c&#8217;est la p&#233;riode que marquent la reconnaissance et la propagation de 
la grammaire g&#233;n&#233;rative aux Etats-Unis et en Europe, en tant que mod&#232;le dominant de la 
recherche dans le domaine syntaxique des langues naturelles. Depuis, les &#233;tudes de la 
morphosyntaxe du grec moderne ont connu une &#233;volution croissante jusqu&#8217;&#224; nos jours o&#249; la 
recherche linguistique constitue un champ bien &#233;tabli. 
</p>
<p>Parmi d&#8217;autres champs de la syntaxe grecque, le syntagme nominal et ses aspects ont souvent 
offert des sujets de d&#233;bats et d&#8217;analyses linguistiques &#233;tendues. En particulier, l&#8217;attention des 
chercheurs a &#233;t&#233; attir&#233;e par la place et l&#8217;ordre relativement libre des modificateurs nominaux, 
le comportement des noms d&#233;verbaux, la nominalisation, les pronoms d&#233;ictiques, la 
distribution et l&#8217;interpr&#233;tation du g&#233;nitif possessif. En outre, un d&#233;fi pour les chercheurs a 
constitu&#233; le ph&#233;nom&#232;ne de la r&#233;p&#233;tition de l&#8217;article d&#233;fini accompagn&#233; d&#8217;un adjectif, appel&#233; 
construction polyd&#233;finie, d&#233;termination multiple, double d&#233;finitude ou encore determiner
</p>
<p>203</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Athina MICHOU
</p>
<p>spreading. N&#233;anmoins, si la situation au niveau de la recherche linguistique est florissante, le 
domaine du traitement automatique de la syntaxe grecque n&#8217;est pas &#233;quivalent. Cela est du au 
fait de la complexit&#233; de la langue, vu l&#8217;ordre relativement libre de ses constituants, et au 
manque des ressources linguistiques pour l&#8217;&#233;valuation des travaux. Ainsi, la plupart de 
programmes de traitement du langage d&#233;velopp&#233;s jusqu&#8217;&#224; aujourd&#8217;hui visent &#224; traiter la 
morphologie mais tr&#232;s peu la syntaxe du grec moderne. De plus, les analyseurs 
morphosyntaxiques int&#233;gr&#233;s dans les processeurs lexicaux des syst&#232;mes du traitement 
automatique du grec sont d&#8217;habitude destin&#233;s &#224; la correction orthographique ou syntaxique ou 
encore &#224; une application de lexicographie ou de la recherche de l&#8217;information.  
</p>
<p>Dans le cadre de la pr&#233;sente recherche, nous avons envisag&#233; d&#8217;&#233;tudier les ph&#233;nom&#232;nes 
int&#233;ressants du syntagme nominal en grec moderne dans le but de b&#226;tir un analyseur 
syntaxique qui puisse traiter efficacement sa structure. La structure du syntagme nominal grec 
pr&#233;sente des particularit&#233;s que les langues romanes et germaniques ne partagent pas et dont 
les analyseurs syntaxiques existants ne tiennent pas compte. Dans notre &#233;tude, nous 
proposons une analyse linguistique de la structure du syntagme nominal grec en vue de son 
traitement automatique par le mod&#232;le FipsGreek (Leoni de Le&#243;n &amp; Michou, 2006). Du point 
de vue th&#233;orique, notre approche repose sur une analyse profonde bas&#233;e sur l&#8217;hypoth&#232;se dite 
analyse DP et du point de vue computationnel la mod&#233;lisation prend place dans le cadre 
d&#8217;analyse automatique multilingue.
</p>
<p>2 &#201;tat de l&#8217;art 
Pendant les deux derni&#232;res d&#233;cennies, plusieurs tentatives de traiter le grec moderne, 
notamment au niveau du traitement morphologique et du traitement syntaxique ont vu le jour 
dans des instituts et d&#233;partements universitaires du pays. Parmi ces travaux, il y en a qui 
traitent des donn&#233;es linguistiques sp&#233;cifiques sans le support ferme d&#8217;un cadre th&#233;orique, 
d&#8217;autres qui se r&#233;f&#232;rent &#224; des applications au grec moderne des outils puissants d&#233;j&#224; 
d&#233;velopp&#233;s, comme par exemple le mod&#232;le KIMMO (Markopoulos, 2001) et encore d&#8217;autres 
qui recouvrent diverses approches linguistiques th&#233;oriques dans le TALN tels que Affix 
Grammars (Triantopoulou, 1995), HPSG (Kolliakou, 2004), grammaire de validation (Ralli &amp; 
Galiotou, 1987). N&#233;anmoins, la plupart d&#8217;entre eux, m&#234;me s&#8217;ils ont donn&#233; des r&#233;sultats 
satisfaisants, r&#233;alisent un traitement morphologique ou syntaxique partiel. Parmi les 
programmes d&#233;velopp&#233;s, nous allons citer ceux qui ont pour but de traiter la syntaxe du grec 
moderne.                              
Triantopoulou (1995) a pr&#233;sent&#233; une premi&#232;re tentative du traitement automatique du grec 
moderne. Son travail consiste en une description du syntagme nominal suivant le mod&#232;le 
formel des grammaires d&#8217;affixes AGFL (Affix Grammar over a Finite Lattice) et en utilisant 
un syst&#232;me orient&#233; vers les corpus.                                    
Draggiotis, Grigoriadou et Philokyprou (1997) ont pr&#233;sent&#233;  le syst&#232;me Dinous, dans le but de 
simuler la mani&#232;re dont les locuteurs natifs analysent les phrases naturelles. Cet analyseur  
combine deux sous-syst&#232;mes computationnels diff&#233;remment structur&#233;s. Le premier d&#8217;entre 
eux utilise de l&#8217;information concernant les pr&#233;f&#233;rences des locuteurs natifs et le deuxi&#232;me 
traite la connaissance linguistique. Dinous analyse des phrases en fournissant comme r&#233;sultats 
des repr&#233;sentations arborescentes annot&#233;es avec de l&#8217;information morphosyntaxique. 
Kermanidis, Sgarbas, Fakotakis et Kokkinakis (2000) ont impl&#233;ment&#233; un analyseur 
syntaxique pour le grec moderne bas&#233; sur le formalisme PC-PATR, ayant pour objectif de 
traiter plusieurs ph&#233;nom&#232;nes syntaxiques. Dans ce cadre, ils traitent les constructions &#224; verbes 
copulatifs, l&#8217;ensemble des propositions subordonn&#233;es, tous les types d&#8217;accord (accord entre 
d&#233;terminant - adjectif et nom, sujet - verbe) et la majorit&#233; des possibilit&#233;s de l&#8217;ordre des mots 
</p>
<p>204</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse Syntaxique et Traitement Automatique du syntagme nominal grec moderne 
</p>
<p>dans  les structures syntagmatiques.                       
Baldzis, Eumeridou et Kolalas (2002) ont d&#233;velopp&#233; un syst&#232;me pour le traitement 
automatique du grec moderne, inscrit dans le domaine de l&#8217;enseignement des langues assist&#233; 
par ordinateur (ELAO). Le mod&#232;le propos&#233; essaie, d&#8217;une part de formaliser la morphologie, la 
syntaxe et la s&#233;mantique du grec moderne, et d&#8217;autre part d&#8217;encoder dans un ensemble fini des 
r&#232;gles les interactions entre ces niveaux, au cours de l&#8217;analyse syntaxique des propositions 
r&#233;elles. Le syst&#232;me a &#233;t&#233; cr&#233;&#233; pour couvrir principalement des domaines th&#233;matiques 
importants pour l&#8217;approche communicative de l&#8217;enseignement et peut &#234;tre utilis&#233; dans la 
classe ou par correspondance via Internet.
</p>
<p>3 Description du syntagme nominal grec moderne 
Dans cette partie, nous allons nous rapporter aux constituants divers du syntagme nominal, et 
aborder des ph&#233;nom&#232;nes int&#233;ressants qui s&#8217;y produisent : l&#8217;accord entre les constituants 
fl&#233;chis et leur ordre (section 3.1), la cliticisation (section 3.2), la polyd&#233;finitude (section 3.3). 
</p>
<p>3.1 Les propri&#233;t&#233;s des constituants du syntagme nominal 
</p>
<p>Le syntagme nominal du grec moderne est compos&#233; d&#8217;une t&#234;te que constitue le nom, de 
modificateurs possibles que sont le d&#233;terminant, l&#8217;adjectif, l&#8217;adverbe, et de compl&#233;ments tels 
qu&#8217;un syntagme nominal au g&#233;nitif, un pronom clitique ou une proposition relative. Les noms, 
ainsi que tous ses modificateurs fl&#233;chis (d&#233;terminants, num&#233;raux, adjectifs) sont dot&#233;s d&#8217;un 
genre (masculin - f&#233;minin - neutre), d&#8217;un nombre (singulier - pluriel), d&#8217;un cas (nominatif -
accusatif - g&#233;nitif - vocatif) et appartiennent &#224; plusieurs classes flexionnelles qui d&#233;terminent 
leurs suffixes flexionnels aux cas du singulier et du pluriel. Les caract&#233;ristiques majeures des 
constituants fl&#233;chis du syntagme nominal sont : l&#8217;accord entre eux en genre, nombre et cas, 
comme le d&#233;note clairement l&#8217;exemple (1a-f), et leur ordre relativement libre : 
</p>
<p>(1)  a. &#517; &#541;&#538;&#539;&#545;&#553;&#546; &#652;&#545;&#531;&#534;&#539;&#538;&#652;&#302;&#546; (nom-masc-sg)       d.  &#517;&#538; &#541;&#538;&#539;&#545;&#544;&#531; &#652;&#545;&#531;&#534;&#539;&#538;&#652;&#304;&#546; (nom-masc-pl)              
   b.  &#521;&#544;&#547; &#541;&#538;&#539;&#545;&#544;&#554; &#652;&#545;&#531;&#534;&#539;&#538;&#652;&#302; (gen-masc-sg)             e.  &#521;&#550;&#542; &#541;&#538;&#539;&#545;&#555;&#542; &#652;&#545;&#538;&#534;&#539;&#531;&#652;&#550;&#542; (gen-masc-pl)           
    c. To &#541;&#538;&#539;&#545;&#553; &#652;&#545;&#531;&#534;&#539;&#538;&#652;&#302; (acc-masc-sg)     f. &#521;&#544;&#547;&#546; &#541;&#538;&#539;&#545;&#544;&#554;&#546; &#652;&#545;&#531;&#534;&#539;&#538;&#652;&#304;&#546; (acc-masc-pl)
          Detdef  petitadj  princeNom              Detdef   petitsadj   princesNom
        &#8216;Le petit prince&#8217;             &#8216;Les petits princes&#8217;
</p>
<p>Les deux articles, l&#8217;article d&#233;fini (&#544;, &#536;, &#306;&#544; &#8216;le, la&#8217;) et l&#8217;article ind&#233;fini (&#529;&#542;&#302;&#546;, &#541;&#538;&#302;, &#529;&#542;&#302; &#8216;un, 
une&#8217;), marquent la d&#233;finitude ou l&#8217;ind&#233;finitude d&#8217;un syntagme nominal. Il se peut, cependant, 
que l&#8217;article soit absent. En ce qui concerne l&#8217;ordre des &#233;l&#233;ments divers du syntagme nominal, 
les modificateurs pr&#233;c&#233;dent majoritairement le nom en se pla&#231;ant normalement entre l&#8217;article 
et le nom. Un autre modificateur ou un adjectif uniquement peut les s&#233;parer par la t&#234;te 
nominale, &#224; l&#8217;exception du d&#233;monstratif &#306;&#529;&#306;&#544;&#538;&#544;&#546; &#8216;tel&#8217; et du contrastif &#528;&#540;&#540;&#544;&#546; &#8216;autre&#8217; qui peuvent 
soit pr&#233;c&#233;der soit suivre les noms. Les d&#233;monstratifs &#302;&#547;&#306;&#553;&#546; &#8216;ce&#8217;, &#306;&#544;&#554;&#306;&#544;&#546; &#8216;ce-ci&#8217; et &#304;&#539;&#304;&#531;&#542;&#544;&#546; &#8216;ce-
l&#224;&#8217;, ainsi que les quantifieurs &#553;&#540;&#544;&#546; &#8216;tout&#8217; et &#544;&#540;&#553;&#539;&#540;&#536;&#545;&#544;&#546; &#8216;entier&#8217; diff&#232;rent des autres 
modificateurs en restant &#224; la p&#233;riph&#233;rie du syntagme nominal. Dans le cas o&#249; plusieurs 
modificateurs sont employ&#233;s ensemble dans le syntagme nominal, leur ordre canonique est le 
suivant : Quantifieur + d&#233;monstratif + d&#233;terminant + num&#233;ral + adjectif + nom + pronom 
clitique (Holton et al., 1997).
</p>
<p>205</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Athina MICHOU
</p>
<p>3.2 La cliticisation dans le syntagme nominal
</p>
<p>Les deux types de compl&#233;ment du nom dont nous tenons compte dans cette &#233;tude sont :               
I. Le syntagme nominal plein au g&#233;nitif, en l&#8217;occurrence le syntagme &#306;&#536;&#546; &#508;&#538;&#545;&#530;&#542;&#536;&#546;, exprimant 
le possesseur qui peut soit suivre (ex. 2a), soit pr&#233;c&#233;der le nom (ex. 2b) :  
</p>
<p>(2) a. &#521;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#306;&#536;&#546; &#508;&#538;&#545;&#530;&#542;&#536;&#546;          b. &#521;&#536;&#546; &#508;&#538;&#545;&#530;&#542;&#536;&#546; &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;
      Detdef  voitureNom  Detdef  Ir&#232;neNom                  Detdef  Ir&#232;neNom   Detdef  voitureNom                        
      &#8216;La  voiture d&#8217;Ir&#232;ne&#8217;                                  &#8216;La voiture d&#8217;Ir&#232;ne&#8217;                                              
</p>
<p>II. Le g&#233;nitif des pronoms clitiques (&#541;&#544;&#547;, &#305;&#544;&#547;, &#306;&#544;&#547;/&#306;&#536;&#546;, &#541;&#302;&#546;, &#305;&#302;&#546;, &#306;&#544;&#547;&#546;) qui, en tant qu&#8217;&#233;l&#233;ment 
possessif, s&#8217;attache toujours &#224; un &#233;l&#233;ment h&#244;te qui peut &#234;tre soit la t&#234;te nominale (ex. 3a, 4a), 
soit un num&#233;ral (ex. 3b), soit un adjectif (ex. 4b), mais jamais l&#8217;article d&#233;fini (ex. 3c-d, 4c-d). 
D&#8217;autre part, le clitique &#306;&#536;&#546; ne peut pas appara&#238;tre seul sans &#234;tre soud&#233; &#224; un &#233;l&#233;ment h&#244;te (ex. 
3e). A savoir, il ne se comporte ni comme un d&#233;terminant, ni comme un adjectif ; il ne partage 
pas les propri&#233;t&#233;s distributionnelles de ces cat&#233;gories et il dispose des propri&#233;t&#233;s 
particuli&#232;res (&#233;tant intransitif, ne faisant pas l&#8217;accord avec son h&#244;te, portant des traits de 
personne) et il entretient un lien th&#233;matique avec le nom dont ils est s&#233;lectionn&#233;.                                            
</p>
<p>(3) a. &#521;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#553; &#306;&#536;&#546;                       (4) a. &#521;&#544; &#550;&#545;&#302;&#531;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#553; &#306;&#536;&#546;
     Detdef  voitureNom PRclg&#233;n                                    Detdef   belleadj  voitureNom   PRclg&#233;n
      &#8216;Sa  voiture&#8217;                                 &#8216;Sa belle voiture&#8217;                                         
  b. &#521;&#544; &#652;&#545;&#555;&#306;&#544; &#306;&#536;&#546; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;                               b. &#521;&#544; &#550;&#545;&#302;&#531;&#544; &#306;&#536;&#546; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;
      Detdef  premierNum PRclg&#233;n voitureNom                                  Detdef  belleadj  PRclg&#233;n voitureNom
      &#8216;Sa premi&#232;re voiture&#8217;              &#8216;Sa belle voiture&#8217;                                                       
  c.*&#521;&#544; &#306;&#536;&#546; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;                c.*&#521;&#544; &#306;&#536;&#546; &#550;&#545;&#302;&#531;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;
</p>
<p>d.*&#521;&#544; &#306;&#536;&#546; &#652;&#545;&#555;&#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; d. *&#521;&#544; &#306;&#536;&#546; &#306;&#544; &#550;&#545;&#302;&#531;&#544; &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;
e.*&#521;&#536;&#546; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;         
</p>
<p>3.3 Les adjectifs et le ph&#233;nom&#232;ne de la polyd&#233;finitude
</p>
<p>En g&#233;n&#233;ral, les modificateurs adjectivaux peuvent appara&#238;tre en position pr&#233;nominale ou 
postnominale. Plus pr&#233;cis&#233;ment, les adjectifs dans leur usage attributif sont pr&#233;nominaux  
&#233;tant pr&#233;c&#233;d&#233;s de l&#8217;article d&#233;fini (ex. 5a) ou ind&#233;fini (ex. 6a). Ils peuvent &#233;galement suivre le 
nom dans un syntagme nominal ind&#233;fini (ex. 6b), mais jamais dans un syntagme nominal 
d&#233;fini simple (ex. 5b). La r&#233;p&#233;tition de l&#8217;article d&#233;fini est obligatoire devant l&#8217;adjectif qui 
appara&#238;t en position postnominale seulement si la t&#234;te nominale est d&#233;finie (ex. 5c); au 
contraire, la propagation de l&#8217;article ind&#233;fini est exclue (ex. 6c):
</p>
<p>(5) a. &#510; &#652;&#544;&#540;&#547;&#306;&#304;&#540;&#530;&#546; &#539;&#302;&#306;&#544;&#538;&#539;&#531;&#302;                                  (6) a. &#514;&#538;&#302; &#652;&#544;&#540;&#547;&#306;&#304;&#540;&#530;&#546; &#539;&#302;&#306;&#544;&#538;&#539;&#531;&#302;                                       
       Detdef  luxueuxadj  domicileNom                                 Detindef   luxueuxadj   domicileNom
  b.*&#510; &#539;&#302;&#306;&#544;&#538;&#539;&#531;&#302; &#652;&#544;&#540;&#547;&#306;&#304;&#540;&#530;&#546;                                          b. &#514;&#538;&#302; &#539;&#302;&#306;&#544;&#538;&#539;&#531;&#302; &#652;&#544;&#540;&#547;&#306;&#304;&#540;&#530;&#546;
       Detdef  domicileNom  luxueuxadj                                                  Detindef   domicileNom  luxueuxadj
      &#8216;Le luxueux domicile&#8217;                                              &#8216;Un domicile luxueux&#8217;                         
  c.  &#510; &#539;&#302;&#306;&#544;&#538;&#539;&#531;&#302; &#536; &#652;&#544;&#540;&#547;&#306;&#304;&#540;&#530;&#546;                              c. *&#514;&#538;&#302; &#539;&#302;&#306;&#544;&#538;&#539;&#531;&#302; &#541;&#538;&#302; &#652;&#544;&#540;&#547;&#306;&#304;&#540;&#530;&#546;                                   
</p>
<p>Cette possibilit&#233; d&#8217;avoir &#224; l&#8217;int&#233;rieur du syntagme nominal grec des occurrences multiples du 
d&#233;terminant d&#233;fini suivi par des adjectifs, constitue une particularit&#233; appel&#233;e &#8216;determiner 
spreading&#8217; (Androutsopoulou, 1995) ou &#8216;construction polyd&#233;finie&#8217; (Kolliakou, 2004). Ce cas 
de figure est mieux illustr&#233; dans les exemples (7a-c), o&#249; l&#8217;article d&#233;fini  &#306;&#544; &#8216;le&#8217; pr&#233;c&#232;de 
obligatoirement le nom &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#8216;voiture&#8217; ainsi que les adjectifs &#541;&#538;&#539;&#545;&#553; &#8216;petit&#8217; et &#538;&#306;&#302;&#540;&#538;&#539;&#553;
</p>
<p>206</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse Syntaxique et Traitement Automatique du syntagme nominal grec moderne 
</p>
<p>&#8216;italien&#8217; qui le modifient. Les adjectifs qui entrent dans la polyd&#233;finitude peuvent &#234;tre 
&#233;galement postnominaux (ex. 7a), pr&#233;nominaux (ex. 7b) ou les deux (ex. 7c-d). Par contre, le 
syntagme nominal en (ex. 7e) est agrammatical puisqu&#8217;il n&#8217;existe pas d&#8217;article d&#233;fini pr&#233;-
adjectival. En outre, le placement des adjectifs dans les exemples ci-dessous est 
interchangeable en rendant tous les diff&#233;rents ordres possibles : 
</p>
<p>(7)  a. &#521;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#306;&#544; &#541;&#538;&#539;&#545;&#553; &#306;&#544; &#538;&#306;&#302;&#540;&#538;&#539;&#553;                  c. &#521;&#544; &#541;&#538;&#539;&#545;&#553; &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#306;&#544; &#538;&#306;&#302;&#540;&#538;&#539;&#553;
    Detdef voitureNom Detdef  petiteadj Detdef  italienneadj Detdef  petiteadj Detdef  voitureNom Detdef  italienneadj
    &#8216;La petite voiture italienne&#8217;    d. &#521;&#544; &#538;&#306;&#302;&#540;&#538;&#539;&#553; &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#306;&#544; &#541;&#538;&#539;&#545;&#553;
 b. &#521;&#544; &#541;&#538;&#539;&#545;&#553; &#306;&#544; &#538;&#306;&#302;&#540;&#538;&#539;&#553; &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;   e. *&#521;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#541;&#538;&#539;&#545;&#553; &#538;&#306;&#302;&#540;&#538;&#539;&#553;
</p>
<p>Comme il sera pr&#233;sent&#233; dans la section 4.1, dans notre analyse nous adoptons le cadre 
th&#233;orique de l&#8217;analyse DP (Abney, 1987) qui postule que le syntagme nominal est la 
projection d&#8217;une cat&#233;gorie fonctionnelle D qui est r&#233;alis&#233;e par un &#233;l&#233;ment appel&#233; d&#233;terminant 
et s&#233;lectionne un compl&#233;ment de cat&#233;gorie NP. Pour ce qui est de l&#8217;attachement des adjectifs, 
lorsqu&#8217;ils sont pr&#233;nominaux, ils constituent des sp&#233;cificateurs du nom et ils occupent la place 
de [Spec, NP] (Stavrou, 1996, 1999). En plus, la position canonique des adjectifs &#233;tant &#224; 
gauche de la t&#234;te nominale, l&#8217;accord morphosyntaxique r&#233;alis&#233; entre l&#8217;adjectif et le nom est le 
type d&#8217;accord qui a lieu directement entre Spec - t&#234;te nominale. Quant aux adjectifs 
postnominaux, ils ont une lecture pr&#233;dicative et ils sont analys&#233;s dans une projection 
fonctionnelle (FP) de type small clause, adjointe &#224; droite du NP dans laquelle le nom n&#8217;est pas 
r&#233;alis&#233;. La proc&#233;dure de l&#8217;analyse Fips de ce type de structure sera d&#233;crite plus en d&#233;tail en fin 
de la section 4.2.
</p>
<p> Dans notre analyse, nous traitons aussi les s&#233;quences d&#8217;adjectifs, en usage attributif, qui 
sont soit en modification parall&#232;le du nom, c&#8217;est-&#224;-dire une suite lin&#233;aire d&#8217;adjectifs, sans 
marque de ponctuation ou de conjonction (ex. 8a), soit en modification avec marque de 
conjonctions (ex. 8b). Dans la structure en (8b) les adjectifs &#233;tant coordonn&#233;s par la 
conjonction de coordination &#539;&#302;&#538; &#8216;et&#8217;, ils constituent des conjoints dans une projection ConjP. 
En ce qui concerne l&#8217;ordre d&#8217;apparition des adjectifs dans la projection nominale incluse dans 
les structures suivantes, il est flexible permettant toutes les combinaisons possibles1, &#224; 
l&#8217;exception du quantifieur adjectival &#652;&#544;&#540;&#540;&#528; &#8216;beaucoup de&#8217;, qui doit pr&#233;c&#233;der les autres 
adjectifs.
</p>
<p>(8) a. &#521;&#302; &#652;&#544;&#540;&#540;&#528; &#541;&#538;&#539;&#545;&#528; &#304;&#538;&#539;&#544;&#542;&#544;&#534;&#545;&#302;&#307;&#536;&#541;&#529;&#542;&#302; &#652;&#302;&#538;&#303;&#538;&#539;&#528; &#533;&#538;&#533;&#540;&#531;&#302;      [DP [ NP [AP][AP][AP][AP] N ]]
      Detdef  nombreuxadj  petitadj   illustr&#233;adj    enfantadj livreNom                                                                                        
      &#8216;Les nombreux petits illustr&#233;s livres pour enfants&#8217;                                                                      
  b. &#498;&#542;&#302; &#550;&#545;&#302;&#531;&#544; &#539;&#302;&#538; &#534;&#545;&#530;&#534;&#544;&#545;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;  [DP[NP[AP [ConjP[AP ] [AP ]]] N]]   
    Detindef  belleadj et   rapideadj  voitureNom
      &#8216;Une belle et  rapide voiture&#8217;
</p>
<p>1    Sachant qu&#8217;au point de vue linguistique il y a des restrictions dans l&#8217;ordre des adjectifs qui semblent &#234;tre des 
pr&#233;f&#233;rences, certaines combinaisons apparaissent plus ou moins acceptables au niveau du parsing. 
</p>
<p>207</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Athina MICHOU
</p>
<p>4 Analyse du groupe nominal propos&#233;e dans Fips 
</p>
<p>4.1 Le formalisme du syst&#232;me Fips et l&#8217;algorithme d&#8217;analyse 
</p>
<p>Dans notre syst&#232;me FipsGreek, tout comme dans les autres Fips faisant partie du mod&#232;le 
d&#8217;analyse syntaxique multilingue (Wehrli, 2004), le formalisme grammatical utilis&#233; rel&#232;ve de 
la th&#233;orie g&#233;n&#233;rative chomskyenne et notamment du module X-barre qui dicte de fa&#231;on 
g&#233;n&#233;rale et uniforme la g&#233;om&#233;trie des structures syntaxiques. N&#233;anmoins, le sch&#233;ma X-barre 
est simplifi&#233; pour faciliter le processus d&#8217;impl&#233;mentation. Comme le n&#339;ud &#8216;barre&#8217; n&#8217;est pas 
repr&#233;sent&#233; au niveau informatique le sch&#233;ma est transform&#233; &#224; celui pr&#233;sent&#233; dans la figure 1. 
Ainsi, la t&#234;te syntagmatique X, est une cat&#233;gorie lexicale (N/nom, V/verbe, P/pr&#233;position, 
Adv/adverbe, Adj/adjectif, Conj/conjonction) ou fonctionnelle (C/complementeur, T/verbe 
conjugu&#233;, D/d&#233;terminant, F/fonctionnelle), ainsi que Left (&#224; gauche de la t&#234;te) et Right (&#224; 
droite de la t&#234;te) correspondent &#224; des listes (&#233;ventuellement vides) de projections maximales.  
</p>
<p>  XP 
</p>
<p>    Left          X          Right 
</p>
<p>Figure 1 : le sch&#233;ma X-barre simplifi&#233; 
</p>
<p>Par convention, dans le sch&#233;ma, la projection DP (Determiner Phrase) est la repr&#233;sentation 
d&#8217;un syntagme dont la t&#234;te D (Abney, 1987), r&#233;alis&#233;e par un d&#233;terminant, s&#233;lectionne une 
cat&#233;gorie syntaxique NP en position de sous-constituant droit. En ce qui concerne 
l&#8217;algorithme d&#8217;analyse, il comprend une analyse lexicale, responsable de la segmentation 
d&#8217;une phrase d&#8217;entr&#233;e en unit&#233;s lexicales, servant de base &#224; une  analyse syntaxique, qui 
assigne &#224; une phrase une ou plusieurs structures syntaxiques. Puisque la grammaire n&#8217;est pas 
d&#233;terministe, c&#8217;est-&#224;-dire qu&#8217;elle admet plusieurs alternatives possibles, l&#8217;analyseur doit 
traiter plusieurs hypoth&#232;ses possibles en parall&#232;le. Cela se fait par une strat&#233;gie d&#8217;analyse 
syntaxique de type gauche-droite avec un traitement parall&#232;le des alternatives, combinant une 
approche incr&#233;mentale, essentiellement ascendante  avec un filtre descendant. En d&#8217;autres 
termes, pour chaque nouveau mot lu, l&#8217;analyseur cherche &#224; le combiner avec les constituants 
d&#233;j&#224; construits (contexte gauche), au moyen des op&#233;rations suivantes : i) Projection : un 
constituant maximal (XP) est projet&#233; sur la base des traits inh&#233;rents du mot lu. ii) 
Attachement &#224; gauche : le constituant &#233;tant &#224; gauche du nouveau constituant est attach&#233; 
comme sous-constituant du nouveau constituant. iii) Attachement &#224; droite : le nouveau 
constituant gauche est attach&#233; comme compl&#233;ment d&#8217;un constituant du contexte gauche.  
</p>
<p>4.2 Les r&#232;gles propos&#233;es et le traitement des donn&#233;es 
</p>
<p>Dans cette section, nous pr&#233;senterons notre proposition d&#8217;int&#233;grer dans l&#8217;analyseur FipsGreek 
les structures du syntagme nominal grec que nous avons d&#233;j&#224; pr&#233;sent&#233;es dans la section 3. 
Comme nous venons le voir, dans le formalisme du syst&#232;me Fips les constituants 
syntagmatiques sont attach&#233;s &#224; gauche et &#224; droite des cat&#233;gories syntaxiques. En ce qui 
concerne l&#8217;analyse du syntagme nominal,  nous adoptons l&#8217;hypoth&#232;se th&#233;orique portant sur 
l&#8217;analyse du DP (Abney, 1987) selon laquelle le syntagme nominal se compose de la 
projection d&#8217;une cat&#233;gorie fonctionnelle D, remplie g&#233;n&#233;ralement par un d&#233;terminant lexical, 
et qui prend comme compl&#233;ment une projection lexicale de cat&#233;gorie NP (Horrocks &amp; 
Stavrou, 1987). Ainsi, nous obtenons le syntagme [DP [D [NP [N]]]], illustr&#233; dans la figure 
</p>
<p>208</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse Syntaxique et Traitement Automatique du syntagme nominal grec moderne 
</p>
<p>2(a), o&#249; la cat&#233;gorie D peut &#234;tre occup&#233;e par une cat&#233;gorie lexicale autre que l&#8217;article, comme 
illustr&#233; dans 2(b), et elle peut s&#233;lectionner un compl&#233;ment NP ou un autre D (cf. 2c), d&#8217;apr&#232;s 
les r&#232;gles de s&#233;lection d&#233;termin&#233;es dans notre grammaire :  
</p>
<p>2 (a)   DP               (b)       D               (c)      DP   
                          
             NP             Quantifieur,   D    DP 
                          Article,                          
 D N (Nom/Pronom)           D&#233;monstratif,                                D        NP 
                               Num&#233;ral    
</p>
<p>Figure 2(a-c): la structure du DP grec 
</p>
<p>En grec, comme en fran&#231;ais, les &#233;l&#233;ments appartenant &#224; la cat&#233;gorie D s&#233;lectionnent un NP 
dont la t&#234;te doit &#234;tre lexicalement r&#233;alis&#233;e. Par exemple, la structure du DP &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#8216;la
voiture&#8217; est rendue ainsi : [DP &#306;&#544; [NP &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;]]. Dans ce syntagme, la t&#234;te nominale 
&#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;, occupe la position N et sa projection maximale (NP) s&#8217;attache comme 
compl&#233;ment de D. En plus, l&#8217;analyseur, pendant le processus de la reconnaissance des mots, 
doit v&#233;rifier l&#8217;accord en genre, nombre et cas, r&#233;alis&#233; entre le D et le NP (accord t&#234;te-compl) ; 
ce type d&#8217;accord est obligatoire entre tous les d&#233;terminants fl&#233;chis (articles, quantifieurs, 
num&#233;raux) et le nom et fait partie int&#233;grale des r&#232;gles d&#8217;attachement des constituants. Dans 
notre analyse, chaque d&#233;terminant est transpos&#233; en tant que t&#234;te D s&#233;lectionnant soit un autre 
DP (ex. 9) soit un NP comme compl&#233;ment. En outre, dans le lexique chaque entr&#233;e lexicale 
est sp&#233;cifi&#233;e pour tous les traits morphologiques, s&#233;lectionnels et s&#233;mantiques n&#233;cessaires afin 
d&#8217;&#234;tre utilis&#233;s au cours de l&#8217;analyse pour autoriser les diff&#233;rents types d&#8217;attachements. Ainsi, 
une s&#233;quence de diff&#233;rents types de d&#233;terminants, comme celle de l&#8217;exemple (9), sera 
analys&#233;e sur la base des traits de s&#233;lection qui sont associ&#233;s &#224; chaque lex&#232;me. La structure de 
sortie du syntagme nominal en (9) est pr&#233;sent&#233;e en (10) : 
 (9) &#501;&#540;&#304;&#546; &#302;&#547;&#306;&#529;&#546; &#544;&#538; &#303;&#529;&#539;&#302; &#304;&#306;&#530;&#305;&#538;&#304;&#546; &#652;&#544;&#540;&#538;&#306;&#538;&#305;&#306;&#538;&#539;&#529;&#546; &#304;&#539;&#303;&#536;&#540;&#555;&#305;&#304;&#538;&#546; &#306;&#544;&#547; &#305;&#547;&#540;&#540;&#553;&#534;&#544;&#547; &#541;&#302;&#546;
    Detquant Detdem Detdef Detnum  Adj        Adj           activit&#233;    Detdef  association PRclg&#233;n
    &#8216;Toutes ces dix annuelles activit&#233;s culturelles de notre association&#8217;                                                      
(10)   [DP &#553;&#540;&#304;&#546; [DP &#302;&#547;&#306;&#529;&#546;  [DP &#544;&#538; [DP &#303;&#529;&#539;&#302; [NP [AP &#304;&#306;&#530;&#305;&#538;&#304;&#546;] [AP &#652;&#544;&#540;&#538;&#306;&#538;&#305;&#306;&#538;&#539;&#529;&#546;] &#304;&#539;&#303;&#536;&#540;&#555;&#305;&#304;&#538;&#546;[DP &#306;&#544;&#547;
[NP &#305;&#547;&#540;&#540;&#553;&#534;&#544;&#547;  [N(+CL) &#541;&#302;&#546;]]]]]]]]
</p>
<p>Or, quelques d&#233;terminants ont un comportement distributionnel plus compliqu&#233; que d&#8217;autres. 
Cette cat&#233;gorie contient les quantifieurs &#553;&#540;&#544;&#546; &#8216;tout&#8217; et &#544;&#540;&#553;&#539;&#540;&#536;&#545;&#544;&#546; &#8216;entier&#8217;, ainsi que les 
d&#233;monstratifs &#302;&#547;&#306;&#553;&#546; &#8216;celui-ci&#8217;, &#304;&#539;&#304;&#531;&#542;&#544;&#546; &#8216;celui-l&#224;&#8217; et &#306;&#544;&#554;&#306;&#544;&#546; &#8216;ce-ci&#8217; qui sont pr&#233;nominaux en 
tant que d&#233;terminants, ou postnominaux, ayant un comportement adjectival (cf. &#501;&#540;&#544;&#546; &#544;
&#539;&#553;&#305;&#541;&#544;&#546;  et *&#544; &#553;&#540;&#544;&#546; &#539;&#553;&#305;&#541;&#544;&#546; &#8216;tout le monde&#8217; vs. &#517; &#539;&#553;&#305;&#541;&#544;&#546; &#553;&#540;&#544;&#546; &#8216;le monde entier&#8217;). Pour traiter 
ces &#233;l&#233;ments, nous avons opt&#233; pour une double entr&#233;e lexicale : celle du d&#233;terminant 
s&#233;lectionnant un autre d&#233;terminant ou un nom, et celle de l&#8217;adjectif portant le trait lexical 
[+postnominal], ce qui leur permet d&#8217;occuper des positions postnominales2. Quant aux pronoms 
clitiques, dans le cadre de notre analyse, ils constituent des pronoms, c&#8217;est-&#224;-dire une sous-
cat&#233;gorie de N portant le trait lexical [+CL], pouvant s&#8217;attacher aux noms, adjectifs, num&#233;raux 
</p>
<p>2  Notons que les adjectifs comme &#553;&#540;&#544;&#546;, &#233;tant des adjectifs non-intersectifs, ne sont pas compatibles avec la 
polyd&#233;finitude (cf. &#544; &#539;&#553;&#305;&#541;&#544;&#546; (*&#544;) &#553;&#540;&#544;&#546;). Voir aussi note 4. 
</p>
<p>209</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Athina MICHOU
</p>
<p>et quantifieurs3. La figure 3(a) pr&#233;sente la configuration du syntagme &#306;&#544; &#652;&#545;&#555;&#306;&#544; &#539;&#302;&#538;&#542;&#544;&#554;&#545;&#534;&#538;&#544;
&#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#553; &#306;&#536;&#546; &#8216;sa premi&#232;re voiture neuve&#8217; illustrant cette hypoth&#232;se ainsi que les possibilit&#233;s 
du mouvement du clitique possessif et de son attachement &#224; un adjectif (&#539;&#302;&#538;&#542;&#544;&#554;&#545;&#534;&#538;&#544; &#306;&#536;&#546;) ou &#224; 
un num&#233;ral (&#652;&#545;&#555;&#306;&#544; &#306;&#536;&#546;) en formant une cha&#238;ne clitique qui le lie &#224; sa position initiale 
(&#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#553; &#306;&#536;&#546;). Plus pr&#233;cis&#233;ment, Fips proc&#232;de &#224; la reconnaissance des mots du syntagme 
jusqu&#8217;&#224; l&#8217;identification du nom &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; et &#224; la projection de la t&#234;te clitique &#224; sa droite. 
Dans le cas o&#249; le clitique s&#8217;est d&#233;plac&#233; plus haut, l&#8217;analyseur cr&#233;e une trace et en parall&#232;le une 
coindexation du clitique avec sa position canonique. Quant &#224; la forme nominale pleine du 
g&#233;nitif possessif &#306;&#536;&#546; &#508;&#538;&#545;&#530;&#542;&#536;&#546; 4 &#8216;d&#8217;Ir&#232;ne&#8217; dans le syntagme &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#306;&#536;&#546; &#508;&#538;&#545;&#530;&#542;&#536;&#546; &#8216;la
voiture d&#8217;Ir&#232;ne&#8217;, donn&#233; dans 3(b), elle occupe la position du compl&#233;ment de la t&#234;te 
nominale &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#8216;la voiture&#8217;. Son analyse est d&#233;termin&#233;e par une r&#232;gle d&#8217;attachement 
du DP (+g&#233;nitif) &#224; droite du NP. La structure rendue par l&#8217;analyseur est la suivante : [ DP &#306;&#544;
[NP &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; [DP &#306;&#536;&#546; [NP &#508;&#538;&#545;&#530;&#542;&#536;&#546;]]]]. La repr&#233;sentation arborescente de la structure en 3(b) 
illustre les deux possibilit&#233;s de placement du DP possessif, soit &#224; sa position canonique soit 
par d&#233;placement  dans le [Spec, DP]  pour des raisons de focalisation.                  
</p>
<p>3 (a)            DP     (b)                                DP 
</p>
<p>         D                         DP            DP             D                     NP 
</p>
<p>    &#521;&#544;     D                          NP                                                      &#521;&#544;          N             DP
                                                                                                                                                                                 
    &#652;&#545;&#555;&#306;&#544; &#306;&#536;&#546;j    AP                     N                                  &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;
</p>
<p>         &#539;&#302;&#538;&#542;&#544;&#554;&#545;&#534;&#538;&#544; &#306;&#536;&#546;i   N &#515;+Cl &#521;&#536;&#546; &#508;&#538;&#545;&#530;&#542;&#536;&#546;i                        &#306;&#536;&#546; &#508;&#538;&#545;&#530;&#542;&#536;&#546;
</p>
<p>&#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#553; &#306;&#536;&#546;                ti
Cha&#238;ne clitique  ti                                 Mouvement dans le Spec DP 
</p>
<p>   Cha&#238;ne clitique             tj
</p>
<p>Figure 3(a-b) : D&#233;placement des clitiques  et du DP possessif 
</p>
<p>Examinons maintenant le ph&#233;nom&#232;ne de la r&#233;p&#233;tition du d&#233;terminant d&#233;fini avec un 
modificateur adjectival pr&#233;nominal (Detdef+Adj+Detdef+Nom) ou postnominal5 (Detdef +Nom 
+Detdef+Adj). Vu que dans les deux cas les adjectifs ont une lecture pr&#233;dicative, nous 
proposons un traitement relativement similaire, c&#8217;est-&#224;-dire que Fips les analyse comme des 
structures FP de type small clause. Plus pr&#233;cis&#233;ment, lors de la reconnaissance d&#8217;une 
s&#233;quence Detdef +Adj qui doit &#234;tre imp&#233;rativement pr&#233;c&#233;d&#233;e ou suivie d&#8217;une autre s&#233;quence 
Detdef +Nom, apr&#232;s la v&#233;rification de l&#8217;accord entre les deux s&#233;quences, nous proposons 
qu&#8217;une projection fonctionnelle FP se cr&#233;e. Dans cette projection de pr&#233;dication FP, l&#8217;article 
projetant un DP occupe la position du sujet et l&#8217;adjectif constitue le pr&#233;dicat. La figure 4(a-b) 
illustre mieux cette configuration : dans la repr&#233;sentation du syntagme nominal &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;
</p>
<p>3  Les &#233;l&#233;ments clitiques possessifs au g&#233;nitif sont de la m&#234;me nature (pronominale) que les &#233;l&#233;ments clitiques 
des phrases. A savoir, ils portent des traits de personne, ils ne font pas l&#8217;accord avec leur h&#244;te et  ils sont  
intransitifs.    
</p>
<p>4 L&#8217;&#233;l&#233;ment &#306;&#536;&#546; est le  Detdef  et non le pronom clitique dont la forme est identique &#224; l&#8217;article d&#233;fini.
5 La propagation de l&#8217;article d&#233;fini n&#8217;est pas possible avec tous les adjectifs. En fait, les adjectifs dits non- 
intersectifs bloquent la polyd&#233;finitude (Alexiadou &amp; Wilder, 1998).  
</p>
<p>210</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse Syntaxique et Traitement Automatique du syntagme nominal grec moderne 
</p>
<p>&#306;&#544; &#541;&#538;&#539;&#545;&#553; &#8216;la voiture la petite&#8217; la projection fonctionnelle s&#8217;attache &#224; droite du NP (cf. 4(a)), 
contrairement &#224; la repr&#233;sentation du syntagme &#306;&#544; &#541;&#538;&#539;&#545;&#553; &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544; &#8216;la petite la voiture&#8217; o&#249; 
le FP s&#8217;ant&#233;pose en occupant la place du [Spec, DP] (cf. 4(b)). 
</p>
<p>4 (a)      DP      (b)         DP
</p>
<p>       D   NP               FP     DP 
</p>
<p>&#521;&#544;           N                FP         DP            AP         D            NP 
</p>
<p>&#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;     DP    AP             D      NP                                  N    
</p>
<p>              D      NP         &#306;&#544;    &#216;     &#541;&#538;&#539;&#545;&#553; &#306;&#544; &#302;&#547;&#306;&#544;&#539;&#531;&#542;&#536;&#306;&#544;
</p>
<p>             &#306;&#544;       &#216; &#541;&#538;&#539;&#545;&#553;
</p>
<p>Figure 4(a-b) : Analyses propos&#233;es pour les structures polyd&#233;finies
</p>
<p>5 Evaluation
L&#8217;analyseur FipsGreek a &#233;t&#233; test&#233; sur un ensemble de fichiers d&#8217;exemples des 1000 syntagmes 
nominaux manuellement extraits de textes en ligne. Ce petit corpus de test a &#233;t&#233; cr&#233;&#233; dans le 
but de nous permettre de contr&#244;ler chaque r&#232;gle de grammaire relative &#224; chaque structure 
syntaxique trait&#233;e. Notre lexique &#233;tait d&#233;j&#224; enrichi avec les nouveaux mots contenus dans ces 
fichiers. De ce fait, nous avons &#233;cart&#233; le probl&#232;me que les mots inconnus pr&#233;sentent dans 
l&#8217;analyse et nous avons obtenu le taux de 80% des syntagmes compl&#232;tement analys&#233;es. Une 
analyse est dite compl&#232;te si l&#8217;analyseur parvient &#224; construire une structure arborescente des 
constituants couvrant l&#8217;int&#233;gralit&#233; de la phrase. Lorsqu&#8217;une analyse est incompl&#232;te l&#8217;analyseur 
retourne une s&#233;quence d&#8217;analyses partielles couvrant toute la phrase. Une &#233;valuation manuelle 
des analyses compl&#232;tes r&#233;v&#232;le que les analyses linguistiquement incorrectes repr&#233;sentent un 
tr&#232;s faible pourcentage de 4%. Les analyses incompl&#232;tes ou incorrectes sont dues &#224; trois 
raisons principales. Premi&#232;rement, &#224; l&#8217;ambig&#252;it&#233; lexicale, l&#8217;analyseur n&#8217;ayant pas identifi&#233; la 
bonne cat&#233;gorie des mots dans les syntagmes. Deuxi&#232;mement, au fait que dans les syntagmes 
non analys&#233;s, il existe des fautes d&#8217;orthographe, des mots &#233;trangers, des abr&#233;viations et des 
sigles que l&#8217;analyseur n&#8217;a pas pu deviner. Troisi&#232;mement, au manque de la couverture de 
r&#232;gles de la grammaire dans le syst&#232;me, fait qui est la cause de la majorit&#233; d&#8217;&#233;checs. A savoir, 
il y a encore diverses structures que nous ne traitons pas, telles que les appositions, les 
constructions elliptiques, les figures du discours stylistiques, les d&#233;pendances &#224; longue 
distance (Horrocks &amp; Stavrou, 1987), etc.
</p>
<p>6  Conclusion 
Cet article pr&#233;sente une approche au traitement automatique des structures syntaxiques du 
syntagme nominal en grec moderne qui repose sur le postulat th&#233;orique de l&#8217;analyse DP.  
Cette analyse permet la s&#233;lection non seulement d&#8217;un NP mais aussi d&#8217;un DP par un autre DP 
et, par cons&#233;quent, des couches successives des DP que nous rencontrons dans le contexte du 
syntagme nominal en grec moderne. Notre proposition de mod&#233;lisation utilise l&#8217;avantage que 
pr&#233;sente l&#8217;analyse hi&#233;rarchique du DP plut&#244;t qu&#8217;une analyse plus lin&#233;aire avec une structure 
NP simple, pour la formalisation et l&#8217;impl&#233;mentation des structures nominales du grec dans le 
cadre de l&#8217;analyseur multilingue Fips. Ce dernier est con&#231;u avec des proc&#233;dures et des 
modules g&#233;n&#233;raux et des modules sp&#233;cifiques au grec. Ainsi, FipsGreek, s&#8217;int&#233;grant dans ce 
</p>
<p>211</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Athina MICHOU
</p>
<p>syst&#232;me multilingue proc&#232;de &#224; une analyse de surface enrichie, parall&#232;le &#224; celles effectu&#233;es 
pour les autres langues, ce qui conduit &#224; l&#8217;am&#233;lioration de la proc&#233;dure du parsing dans le 
syst&#232;me de la traduction. Par ailleurs, les r&#233;sultats obtenus montrent que notre mod&#232;le 
constitue un outil ad&#233;quat pour le traitement automatique des sp&#233;cificit&#233;s que pr&#233;sente le grec. 
La pr&#233;sente &#233;tude peut &#234;tre &#233;tendue et couvrir l&#8217;analyse syntaxique de la phrase en donnant 
des perspectives &#224; la recherche men&#233;e dans le futur. 
</p>
<p>Remerciements
Cette recherch&#233; a b&#233;n&#233;fici&#233; du financement du Fonds national suisse de la recherche 
scientifique (projet n&#176; 101412-103999). L&#8217;auteur tient &#224; remercier Eric Wehrli, et Christopher 
Laenzlinger en particulier, pour leurs discussions et commentaires fructueux. 
</p>
<p>R&#233;f&#233;rences
ABNEY S. (1987). The English Noun Phrase in its Sentential Aspect. Cambridge, MA: MIT Press. 
ALEXIADOU A., WILDER C. (1998). Adjectival modification and multiple determiners. In Alexiadou &#505;.
et al. (&#233;d.), Possessors, Predicates and Movement in the Determiner Phrase, 303-332. Benjamins. 
BALDZIS S.D., EUMERIDOU E., KOLALAS S. (2002). A Complete and Comprehensive System for 
Modern Greek Language Processing Proposed as a Modern Greek Language Call Method Developer. 
Literary and Linguistic Computing 17(4), 373-400. 
ANDROUTSOPOULOU A. (1995).  The distribution of definite determiners and the syntax of Greek DPs. 
In Proceedings of CLS. 
DRAGGIOTIS A., GRIGORIADOU M., PHILOKYPROU G. (1998). The DINOUS parser. Natural Language 
Engineering 4(2), 145-173. 
HOLTON D., MACKRIDGE P., PHILIPPAKI-WARBURTON I. (1997). Greek: A Comprehensive Grammar of 
the Modern Language. London: Routledge. 
HORROCKS G., STAVROU M. (1987). Bounding theory and Greek syntax: evidence for wh- movement 
in NP. Journal of Linguistics 23, 79-108. 
KERMANIDIS K., SGARBAS K., FAKOTAKIS N., KOKKINAKIS G. (2001). A PC-PATR-Based Syntactic 
Description of Modern Greek. Literary and Linguistic Computing 15(3), 291-311.
KOLLIAKOU D. (2004). Monadic definites and polydefinites: their form, meaning and use. Journal of 
Linguistics  40, 263-323. 
LEONI DE LE&#211;N A., MICHOU A. (2006). Traitement des clitiques dans un environnement multilingue. 
Actes de la 13&#232;me conference TALN 2006, 541-550. 
MARKOPOULOS G. (2001). A Two-level Description of the Greek Noun Morphology with a Unification-
based Word Grammar. Ph.D. Dissertation: University of Athens. 
STAVROU M. (1999). The position and serialization of APs in the DP: evidence from Greek. In 
Alexiadou A. et al. (&#233;d.). Studies in Greek Syntax, 201-225. Dordrecht: Kluwer. 
STAVROU M. (1996). Adjectives in Modern Greek. An instance of predication or an old issue revisited. 
Journal of Linguistics 32, 79-111. 
TRIANTOPOULOU T. (1997). A Description of the Modern Greek Noun Phrase Using the &#8220;Affix 
Grammars over a Finite Lattice&#8221; Formalism. Literary and Linguistic Computing 12(2), 119-133. 
RALLI A., GALIOTOU E. (1987). A morphological processor of Modern Greek. Proceedings of the 
ACL European Chapter Meeting. Denmark. 
WEHRLI E. (2004). Un mod&#232;le multilingue d&#8217;analyse syntaxique. In Auchlin &#505;. et al. (&#233;d.), Structures
et discours : M&#233;langes offerts &#224; Eddy Roulet, 311-329. Canada: Nota bene.
</p>
<p>212</p>

</div></div>
</body></html>