<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les par projection cross-linguistique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p> Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les 
par projection cross-linguistique&#13;
</p>
<p>Sebastian PAD&#211;1, Guillaume PITEL2
1 Computerlinguistik &#8211; Universit&#233; de la Sarre
</p>
<p> 2 &#201;quipe TALARIS, LORIA &#8211; INRIA 
pado@coli.uni-sb.de, Guillaume.Pitel@loria.fr 
</p>
<p>R&#233;sum&#233;. Dans le paradigme FrameNet, cet article aborde le probl&#232;me de l&#8217;annotation 
pr&#233;cise et automatique de r&#244;les s&#233;mantiques dans une langue sans lexique FrameNet existant. 
Nous &#233;valuons la m&#233;thode propos&#233;e par Pad&#243; et Lapata (2005, 2006), fond&#233;e sur la projection 
de r&#244;les et appliqu&#233;e initialement &#224; la paire anglais-allemand. Nous testons sa g&#233;n&#233;ralisabilit&#233; 
du point de vue (a) des langues, en l'appliquant &#224; la paire (anglais-fran&#231;ais) et (b) de la qualit&#233; 
de la source, en utilisant une annotation automatique du c&#244;t&#233; anglais. Les exp&#233;riences 
montrent des r&#233;sultats &#224; la hauteur de ceux obtenus pour l'allemand, nous permettant de 
conclure que cette approche pr&#233;sente un grand potentiel pour r&#233;duire la quantit&#233; de travail 
n&#233;cessaire &#224; la cr&#233;ation de telles ressources dans de nombreuses langues.  
</p>
<p>Abstract. This paper considers the task of the automatic induction of role-semantic 
annotations for new languages with high precision. To this end we test the generalisability of 
the language-independent, projection-based annotation framework introduced by Pad&#243; and 
Lapata (2005, 2006) by (a) applying it to a new, more distant, language pair (English-French), 
and (b), using automatic, and thus noisy, input annotation. We show that even under these 
conditions, high-quality role annotations for French can be obtained that rival existing results 
for German. We conclude that the framework has considerable potential in reducing the  
manual effort involved in creating role-semantic resources for a wider range of languages. 
</p>
<p>Mots-cl&#233;s : multilingue, FrameNet, annotation s&#233;mantique automatique, s&#233;mantique 
lexicale, projection d&#8217;annotation de r&#244;les, r&#244;les s&#233;mantiques. 
</p>
<p>Keywords: multilingual, FrameNet, automatic semantic annotation, lexical semantics, 
annotation projection, semantic roles. 
</p>
<p>1 Introduction
L&#8217;analyse s&#233;mantique de surface (en anglais, shallow semantic parsing) consiste &#224; reconna&#238;tre 
les r&#244;les s&#233;mantiques attribuables aux diff&#233;rents constituants d&#8217;un &#233;nonc&#233;, sans d&#233;crire avec 
pr&#233;cision la s&#233;mantique interne de ces constituants. Les r&#244;les s&#233;mantiques correspondent aux 
arguments des pr&#233;dicats &#233;voqu&#233;s par certains mots, notamment les verbes. Ce type d'analyse 
pr&#233;sente un int&#233;r&#234;t tout particulier dans les applications utilisant les informations s&#233;mantiques 
&#224; grande &#233;chelle, telles que l&#8217;extraction d&#8217;information (Bouillon et al., 2000 ; Surdeanu et al.,
2003), la traduction automatique (Boas, 2002) et les syst&#232;mes de question/r&#233;ponse 
(Narayanan et Harabagiu, 2004). 
</p>
<p>&#13; Ces travaux ont &#233;t&#233; financ&#233;s par le fonds France-Berkeley (projet FR.FrameNet sous la responsabilit&#233; de C. J. 
Fillmore et L. Romary) et le DFG (Pad&#243;; bourse PI-154/9-2). 
</p>
<p>271</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sebastian PAD&#211;, Guillaume PITEL
</p>
<p>Le projet FrameNet (Fillmore et al., 2003) peut jouer un r&#244;le central dans les entreprises de ce 
type, en mettant &#224; disposition une ressource lexicale de grande couverture, pr&#233;cis&#233;ment 
articul&#233;e autour de la notion de r&#244;le s&#233;mantique. Dans la s&#233;mantique des frames de Fillmore 
(1982)  sur laquelle s&#8217;appuie FrameNet, le sens pr&#233;dicatif est repr&#233;sent&#233; &#224; partir de frames1
qui peuvent &#234;tre consid&#233;r&#233;es comme des repr&#233;sentations sch&#233;matiques de situations. Dans ce 
cadre, les r&#244;les s&#233;mantiques sont appel&#233;s frame elements (FEs), ils sont attach&#233;s de mani&#232;re 
unique &#224; une frame (on compte en moyenne 7 &#224; 8 FEs par frame). Le projet FrameNet en lui-
m&#234;me consiste &#224; construire une base de donn&#233;es mettant en relation les frames, les lemmes 
qui les &#233;voquent (Unit&#233;s Lexicales ou ULs) et les informations d&#233;taill&#233;es sur la r&#233;alisation de 
surface des Fes, sous la forme de cadres syntaxiques et grammaticaux et d'exemples 
d&#8217;annotations sur le British National Corpus. Ces informations ont cr&#233;&#233; un fort int&#233;r&#234;t du c&#244;t&#233; 
de l&#8217;analyse s&#233;mantique de surface et ont rendu possible le d&#233;veloppement d&#8217;analyseurs 
automatiques pour le texte libre (initi&#233;s par Gildea et Jurafsky, 2002) qui peuvent &#234;tre utilis&#233;s 
pour les applications cit&#233;es ci-dessus. 
</p>
<p>Frame: ARRIVING (Un THEME se rapproche d'un GOAL)
THEME The officer approached the house 
</p>
<p>Amy arrived home from school 
After she arrived home, &#8230; 
</p>
<p>L&#8217;officier s&#8217;approcha de la maison  
De l&#8217;&#233;cole, Amy rentra &#224; la maison  
Apr&#232;s son arriv&#233;e &#224; la maison, &#8230; 
</p>
<p>Fr
am
</p>
<p>e 
El
</p>
<p>em
en
</p>
<p>ts 
</p>
<p>GOAL The officer approached the house
Amy arrived home from school 
He had arrived there from London 
</p>
<p>L&#8217;officier approcha_de la maison
De l&#8217;&#233;cole, Amy rentra &#224; la maison
Clarke est arriv&#233; l&#224; de Londres 
</p>
<p>U
ni
</p>
<p>t&#233;
s L
</p>
<p>ex
ic
</p>
<p>al
es
</p>
<p> approach.n, approach.v, arrival.n, 
arrive.v, come.v, crest.v, 
descend_(on).v, enter.v, entrance.n, 
entry.n, get.v, make it.v, make.v, 
reach.v, return.n, return.v, visit.n, 
visit.v 
</p>
<p>aborder.v, aboutir.v, acc&#233;der_&#224;.v, approche.n, 
approcher.v, approcher_de.v, arriver.v, arriv&#233;e.n, 
atteindre.v, descendre_&#224;.v, descendre_sur.v, 
entrer.v, entr&#233;e.n, gagner.v, parvenir.v, passer.v, 
rapprochement.n, regagner.v, rejoindre.v, rentrer.v, 
rentr&#233;e.n, retour.n, retourner.v, revenir.v, venir.v 
</p>
<p>Tableau 1: Exemple simplifi&#233; de frame dans le paradigme FrameNet (fran&#231;ais et anglais) 
</p>
<p>Le tableau 1 illustre, pour la frame ARRIVING, certaines des informations contenues dans la 
base FrameNet (les ULs pour le fran&#231;ais sont tir&#233;es d'une m&#233;thode semi-automatique de 
construction de lexique s&#233;mantique (Pitel, 2006)). Cette frame, qui mod&#233;lise une situation o&#249; 
un objet en mouvement se rapproche d'un endroit, poss&#232;de deux FEs principaux : le th&#232;me 
(THEME) et le but (GOAL). D'autres FEs secondaires lui sont rattach&#233;s, parmi lesquels : 
MODE_OF_TRANSPORTATION, CIRCUMSTANCES et GOAL_CONDITION2. Comme le montrent les 
exemples d'annotation, les m&#234;mes FEs peuvent &#234;tre &#233;voqu&#233;s par des constituants de 
diff&#233;rentes natures syntaxiques et grammaticales et ce sont ces informations qui seront 
particuli&#232;rement exploit&#233;es par les syst&#232;mes d'annotation s&#233;mantique automatique. Dans sa 
version 1.1 utilis&#233;e dans l'exp&#233;rimentation que nous pr&#233;sentons, FrameNet d&#233;crit 513 frames 
li&#233;es &#224; 7125 unit&#233;s lexicales, avec en moyenne 7.5 FEs par frame. 
</p>
<p>Malheureusement, l'anglais est actuellement la seule langue dans laquelle une telle ressource 
existe &#224; grande &#233;chelle. Un petit nombre de projets existent dans d'autres langues (allemand, 
espagnol et japonais principalement), mais ceux-ci n'ont pas encore atteint la maturit&#233; 
</p>
<p>1 Afin d'&#233;viter la confusion avec les autres usages de &#171; cadre &#187;, nous conserverons les expressions usuelles 
anglaises lorsqu'elles comprennent le terme frame, et traduisons dans les autres cas. 
</p>
<p>2 De nombreux exemples de frames ainsi que des documents sur FrameNet sont accessibles sur 
http://framenet.icsi.berkeley.edu
</p>
<p>272</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les par projection cross-linguistique 
</p>
<p>n&#233;cessaire &#224; une exploitation automatique. La principale cause de ce d&#233;ficit en ressources est 
le haut niveau d'exigence en temps et en attention requis pour l'annotation s&#233;mantique 
manuelle. Le fait que l'analyse s&#233;mantique de surface soit limit&#233;e &#224; un petit nombre de 
langues est un obstacle important &#224; son usage comme strat&#233;gie d'analyse g&#233;n&#233;rale pour le 
TAL. Il est donc imp&#233;ratif de concevoir des m&#233;thodes pour r&#233;duire l'effort n&#233;cessaire &#224; 
l'amor&#231;age de telles ressources. Dans cet article nous nous int&#233;ressons &#224; l'induction des 
informations s&#233;mantiques sur les FEs, probl&#232;me pour lequel (Pad&#243; et Lapata, 2005 ; 2006) &#8211; 
ci-apr&#232;s, P&amp;L &#8211;  ont sugg&#233;r&#233; l'utilisation de la projection d'annotations. Ce paradigme 
s'articule autour de l'exploitation de ressources parall&#232;les entre des langues L1 et L2, o&#249; L1 
est dot&#233;e en ressources de type FrameNet et L2 ne l'est pas. En supposant que l'on puisse 
obtenir une analyse s&#233;mantique pour le c&#244;t&#233; L1, la projection d&#8217;annotations consiste &#224; 
recopier simplement les annotations de L1 sur le c&#244;t&#233; L2. et permet ainsi de r&#233;utiliser le 
travail manuel effectu&#233; sur L1.  
</p>
<p>P&amp;L ont montr&#233; l'efficacit&#233; de cette m&#233;thode en utilisant FrameNet pour induire l'annotation 
de FEs en allemand, mais leur &#233;tude a &#233;t&#233; limit&#233;e sur deux aspects:  
</p>
<p>1. Seule une langue cible est consid&#233;r&#233;e : l'allemand. Johansson et Nugues (2006) 
rapportent, avec une strat&#233;gie identique, un succ&#232;s similaire  pour le su&#233;dois. 
Cependant, le su&#233;dois et l'allemand &#233;tant deux langues germaniques, typologiquement 
proches de l'anglais, l'approche dans le cas g&#233;n&#233;ral n'est pas valid&#233;e. 
</p>
<p>2. P&amp;L n'ont pris en compte que le cas o&#249; le c&#244;t&#233; L1 est annot&#233; manuellement, ce qui ne 
permet pas de g&#233;n&#233;raliser les r&#233;sultats pour un passage &#224; grande &#233;chelle. Bien que 
Johansson et Nugues (2006) l'aient fait pour une source automatique, les diff&#233;rences 
avec la m&#233;thode exp&#233;rimentale de P&amp;L ne permettent pas d'&#233;valuer l'impact r&#233;el d'une 
annotation automatique.  
</p>
<p>Dans cet article, nous montrons que le paradigme de projection d'annotations des FEs se 
g&#233;n&#233;ralise au-del&#224; du cas &#233;tudi&#233; dans P&amp;L. Nous reproduisons les exp&#233;riences r&#233;alis&#233;es dans 
P&amp;L sur une langue romane, le fran&#231;ais. Nous &#233;tendons de plus le champ d'investigation en 
r&#233;alisant une comparaison avec une projection &#224; partir de FEs annot&#233;s automatiquement. Nous 
montrons que m&#234;me cette situation permet d'obtenir des r&#233;sultats de haute qualit&#233; pour le 
fran&#231;ais. La structure de cet article est la suivante : nous pr&#233;sentons tout d'abord quelques 
travaux ayant explor&#233; la projection cross-linguistique et d&#233;crivons la m&#233;thode de projection 
utilis&#233;e. Apr&#232;s avoir v&#233;rifier l'hypoth&#232;se fondamentale de parall&#233;lisme cross-linguistique des 
frames et Fes pos&#233;e par cette m&#233;thode, nous pr&#233;sentons les r&#233;sultats obtenus pour la 
projection de FEs de l'anglais vers le fran&#231;ais. Nous concluons en &#233;voquant les diff&#233;rentes 
pistes ouvertes par la projection cross-linguistique de frame elements.
</p>
<p>2 Approches existantes 
Le paradigme de la projection d'annotation a &#233;t&#233; introduit par Yarowsky et al. (2001), en 
utilisant un corpus parall&#232;le pour adapter des outils monolingues (POS taggers, chunkers et 
analyseurs morphologiques) &#224; des nouvelles langues. Le transfert effectif entre les langues a 
&#233;t&#233; rendu possible en utilisant les alignements de mots individuels entre les phrases, 
alignements qui peuvent aujourd'hui &#234;tre obtenu automatiquement gr&#226;ce &#224; des outils comme 
GIZA++ (Och et Ney, 2003). Cette approche a &#233;t&#233; ensuite adapt&#233;e &#224; d'autres niveaux de 
description linguistique, principalement pour la grammaire et la syntaxe. Par exemple, Hwa et 
al. (2002) ont projet&#233; les informations de d&#233;pendance syntaxique de l'anglais au chinois. 
</p>
<p>La premi&#232;re tentative de transfert cross-linguistique d'informations s&#233;mantique a &#233;t&#233; pr&#233;sent&#233;e 
par Fung et Chen (2004) dans un projet de construction de FrameNet pour le chinois. Ceux-ci 
</p>
<p>273</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sebastian PAD&#211;, Guillaume PITEL
</p>
<p>exploitent les informations du FrameNet anglais en les mettant en relation avec des concepts 
tir&#233;s d'une ontologie en chinois, HowNet, sans d'ailleurs exploiter de corpus align&#233;s. Leur 
strat&#233;gie requiert donc l'existence d'une grande ontologie pour la langue cible, ce qui n'est pas 
toujours disponible. L'approche de P&amp;L se donne la m&#234;me t&#226;che, mais sans n&#233;cessiter une 
telle ressource, en se focalisant sur la projection d'annotations, moins gourmande en 
connaissances.
</p>
<p>Cependant, la r&#233;ussite de la projection d'annotations d&#233;pend en grande partie du parall&#233;lisme
cross-linguistique de ces annotations. Comme la projection d'annotations basique consiste &#224; 
copier l'information de l'annotation source, il y a erreur si l'annotation &#171; id&#233;ale &#187; de la cible 
n'est pas identique &#224; l'annotation source. Le degr&#233; de parall&#233;lisme cross-linguistique est connu 
pour &#234;tre tr&#232;s d&#233;pendant du niveau de description en question. Alors que Yarowsky et al. 
(2001) rapportent un parall&#233;lisme allant jusqu'&#224; 85 % pour les &#233;tiquettes de partie du discours 
(anglais-fran&#231;ais), Hwa et al. (2002) n'ont pas mesur&#233; plus de 40 % de liens de d&#233;pendance 
syntaxique pouvant &#234;tre projet&#233; directement de l'anglais au chinois. P&amp;L ont trouv&#233; une 
bonne correspondance entre les frames et les FEs entre l'anglais et l'allemand, (voir section 4), 
ce qui donne une id&#233;e de la pertinence de l'approche. La question de la g&#233;n&#233;ralisation &#224; 
d'autres langues, donc de l'&#233;valuation du parall&#233;lisme s&#233;mantique, est cependant pos&#233;e, car la 
proximit&#233; anglais-allemand est particuli&#232;rement importante.  
</p>
<p>3 M&#233;thode de projection 
Cette section d&#233;crit rapidement la m&#233;thode de projection propos&#233;e par P&amp;L, qui d&#233;finit un 
mod&#232;le g&#233;n&#233;ral voulu ind&#233;pendant de la langue, pour projeter les FEs de la langue source vers 
la langue cible. Contrairement aux &#233;tudes pr&#233;c&#233;dentes, P&amp;L ont trouv&#233; que les alignements 
mot &#224; mot donnent de moins bons r&#233;sultats pour la projection de FEs. Ces &#233;tudes concernaient 
la projection d'informations r&#233;sidant au niveau des mots (Hwa et al., 2002) ou de syntagmes 
courts (Yarowsky et al., 2001), alors que les FEs peuvent s'&#233;tendre sur des syntagmes longs. 
Du fait des erreurs et des omissions dans les alignements automatiques de mots, la projection 
de longs constituants est d&#233;licate. Nous consid&#233;rons donc comme P&amp;L que les mod&#232;les de 
projections par alignement mot &#224; mot (M) doivent &#234;tre pris comme mod&#232;le de r&#233;f&#233;rence 
uniquement en l'absence d'informations plus riches. 
</p>
<p>D'autre part, P&amp;L ont montr&#233; que la projection peut b&#233;n&#233;ficier &#233;norm&#233;ment d&#8217;informations 
sur les constituants. Les transferts par constituants permettent &#224; la fois d'esp&#233;rer projeter les 
FEs sur des &#233;tendues pertinentes et d'avoir une meilleure robustesse que M, puisqu'un certain 
nombre d'erreurs d'alignement peut &#234;tre compens&#233; par les bons alignements. Par ailleurs, le 
fait que l'alignement soit recalcul&#233; au niveau des constituants permet des strat&#233;gies 
alternatives &#224; l'alignement un &#224; un. P&amp;L proposent ainsi d'&#233;valuer trois classes d'alignement 
de constituants : les alignements Total (T), Couvrant (C) et Exact (E) qui diff&#232;rent dans la 
force des contraintes qu'ils imposent sur l'alignement.  
</p>
<p>Ces classes sont repr&#233;sent&#233;es figure 1 : T impose que chaque constituant source soit projet&#233; 
au moins une fois, C impose en plus que chaque constituant cible soit li&#233; &#224; au moins une 
source et E impose que les constituants soient projet&#233;s un &#224; un, introduisant &#233;ventuellement 
des constituants vides (H). Un compromis doit &#234;tre trouv&#233; entre les alignements plus stricts 
comme E, qui peut corriger plus d'erreurs et un alignement plus souple comme T qui peut 
mieux mod&#233;liser les glissements dus &#224; la traduction. Ce compromis pouvant &#234;tre d&#233;pendant de 
la langue, nous comparons toutes ces diff&#233;rentes classes pour le fran&#231;ais. 
</p>
<p>274</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les par projection cross-linguistique 
</p>
<p>US UC
</p>
<p>fe1 fe1
</p>
<p>fe2
</p>
<p>fe2
</p>
<p>1 1
</p>
<p>2
</p>
<p>3
</p>
<p>4
</p>
<p>2
</p>
<p>3
</p>
<p>fe2
</p>
<p>US UC
</p>
<p>fe1 fe1
</p>
<p>fe2
</p>
<p>fe2
</p>
<p>1 1
</p>
<p>2
</p>
<p>3
</p>
<p>4
</p>
<p>2
</p>
<p>3
</p>
<p>fe2
</p>
<p>US UC
</p>
<p>fe1 fe1
</p>
<p>fe2
</p>
<p>fe2
</p>
<p>1 1
</p>
<p>2
</p>
<p>3
</p>
<p>4
</p>
<p>2
</p>
<p>3
</p>
<p>fe2
</p>
<p>Total Couvrant Exact 
</p>
<p>Figure 1: Mod&#232;les d'alignement de constituants (Us et Uc sont les ensembles de constituants 
sources et cibles, fe1 et fe2 sont deux FEs) 
</p>
<p>Parall&#232;lement aux diff&#233;rents mod&#232;les d'alignements, P&amp;L proposent diff&#233;rents filtres pr&#233;- ou 
post-projection afin de r&#233;duire l'impact des erreurs d'alignements sur le r&#233;sultat.3
</p>
<p>1. Le filtre correctif de convexit&#233; de couverture, appliqu&#233; apr&#232;s projection, consiste &#224; 
&#233;tendre artificiellement l'&#233;tendue d'un FE sur tous les &#233;l&#233;ments non annot&#233;s situ&#233;s 
entre le premier et le dernier &#233;l&#233;ment qui lui est attribuable. Johansson et Nugues 
(2006) &#233;tendent une telle heuristique en y ajoutant des caract&#233;ristiques sp&#233;cifiques au 
su&#233;dois, ce qui leur permet d'obtenir d'excellents scores de projection. 
</p>
<p>2. Le filtrage de mots permet de corriger les erreurs dues &#224; l'alignement : les mots 
grammaticaux souvent mal align&#233;s et les nombreux mots laiss&#233;s non align&#233;s. La 
pr&#233;sence de ces erreurs dans un constituant peut le p&#233;naliser inutilement dans le 
transfert. Pour palier ce probl&#232;me, P&amp;L proposent un filtre sur les mots grammaticaux 
(MG) et un autre sur les mots non align&#233;s (NA).
</p>
<p>3. Le filtrage des non-arguments (Arg) permet, &#224; partir d'informations syntaxiques 
profondes, de ne pas prendre en compte les constituants qui ont peu de chances d'&#234;tre 
des arguments du pr&#233;dicat. L'efficacit&#233; de cette strat&#233;gie repose fortement sur la 
qualit&#233; de l'analyse syntaxique, afin que les constituants l&#233;gitimes ne soient pas filtr&#233;s. 
</p>
<p>4 Parall&#233;lisme s&#233;mantique cross-linguistique 
Nous avons argument&#233; dans la section 2 sur le fait que le parall&#233;lisme s&#233;mantique entre deux 
langues repr&#233;sente une borne maximum &#224; la performance d'un syst&#232;me de projection de 
l'annotation. Pour cette raison, le parall&#233;lisme s&#233;mantique doit &#234;tre &#233;valu&#233; auparavant afin de 
d&#233;terminer la possibilit&#233; d'appliquer la projection &#224; une langue particuli&#232;re. Afin d'estimer ce 
parall&#233;lisme entre l'anglais et le fran&#231;ais, nous avons produit un corpus annot&#233; en s&#233;mantique 
des frames. Pour faire la comparaison avec les r&#233;sultats de P&amp;L, nous avons produit un sous-
corpus en annotant les phrases correspondants au sous-corpus extrait pour leurs travaux. Ceci 
a &#233;t&#233; possible du fait que ce sous-corpus est tir&#233; de Europarl (Koehn, 2005), corpus des 
minutes du parlement europ&#233;en dans 11 langues. Le sous-corpus original a &#233;t&#233; extrait afin 
d&#8217;&#233;valuer la projection entre l'allemand et l'anglais et est soumis &#224; des contraintes sp&#233;ciales 
qui introduisaient des biais que nous discuterons plus loin. 
</p>
<p>Etant donn&#233; la nature de l'exp&#233;rimentation, consistant &#224; mettre en relation une unique frame 
entre deux traductions, nous avons construit un guide pour l'annotation d&#233;crivant pour chaque 
phrase &#224; annoter en fran&#231;ais, le mot qui &#233;tait le plus probablement le pr&#233;dicat de la frame 
</p>
<p>3 Nous ne testons pas les combinaisons possibles de filtres, suivant en cela P&amp;L. 
</p>
<p>275</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sebastian PAD&#211;, Guillaume PITEL
</p>
<p>(trouv&#233; par alignement &#224; partir de la version anglaise annot&#233;e), ainsi que les frames 
potentiellement &#233;voqu&#233;es. En utilisant ce guide, deux annotateurs4 ont produit une annotation 
du sous-corpus fran&#231;ais de 1076 phrases, en utilisant 60 phrases pour la mise au point. Le 
sous-corpus &#233;tait initialement analys&#233; syntaxiquement par Syntex (Bourigault et al., 2005) et 
a &#233;t&#233; annot&#233; en utilisant l'outil SALTO (Burchardt et al., 2006). L'&#233;valuation de l'accord inter-
annotateurs (avant adjudication) est r&#233;sum&#233;e dans la colonne gauche du tableau 2 ; la colonne 
de droite pr&#233;sente les r&#233;sultats de  P&amp;L. En g&#233;n&#233;ral l'accord pour le fran&#231;ais est &#233;lev&#233; et 
correspond aux r&#233;sultats pour l'allemand. Une des deux raisons auxquelles nous attribuons le 
score plus faible pour l'&#233;tendue des FEs est la nature plus fragmentaire de l'arbre syntaxique 
fran&#231;ais (seuls 82 % des FEs fran&#231;ais ont pu &#234;tre assign&#233;s &#224; des constituants uniques). 
</p>
<p>Fran&#231;ais Allemand (P&amp;L)
Acc. frames 0.87 0.87
Acc. FEs 0.89 0.95
Acc. &#233;tendue 0.72 0.83
</p>
<p>Tableau 2: Accords inter-annotateurs pour les sous-corpus fran&#231;ais (sur 500 phrases), 
compar&#233;s aux r&#233;sultats de P&amp;L pour l'allemand.  
</p>
<p>Le tableau 3 montre l'accord pour le fran&#231;ais par rapport &#224; l'anglais. Les r&#233;sultats de P&amp;L 
pour l'anglais-allemand sont donn&#233;s &#224; titre de comparaison. La premi&#232;re ligne donne l'accord 
sur la frame choisie, la seconde sur les FEs. Nous avons trouv&#233; que la correspondance cross-
linguistique est quasiment identique pour les deux paires de langues. C'est le premier r&#233;sultat 
important de notre &#233;tude, qui montre que le paradigme de projection est applicable aussi pour 
la paire anglais-fran&#231;ais, malgr&#233; une plus grande distance typologique. 
</p>
<p>Fran&#231;ais/anglais Allemand/anglais (P&amp;L)
Corresp. frames 0.69 0.71
Corresp. FEs 0.88 0.91
</p>
<p>Tableau 3: Correspondance interlingue des sous-corpus annot&#233;s 
</p>
<p>Il est int&#233;ressant de constater des diff&#233;rences dans la distribution des frames entre l'annotation 
fran&#231;aise d'une part et les annotations anglaise et allemande d'autre part. Le tableau 4 donne le 
nombre de frames ayant un nombre d'annotation compris dans la fourchette d&#233;crite dans la 
colonne de gauche et entre parenth&#232;ses le total des annotations pour ces frames. Il montre des 
diff&#233;rences de r&#233;partition des frames dans l'annotation, qui s'expliquent par le fait que le sous-
corpus a &#233;t&#233; initialement s&#233;lectionn&#233; pour maximiser les chances d'avoir des phrases avec des 
correspondances de frames entre l'allemand et l'anglais.  
</p>
<p>Nb annotations par frame Fran&#231;ais Allemand Anglais
25-160 8 (418) 13 (578) 9 (447) 
10-24 20 (315) 14 (228) 25 (389) 
1-9 93 (233) 45 (133) 49 (151)
</p>
<p>Total 121 (966) 73 (987) 83 (987) 
Tableau 4: Distribution des frames en fonction du nombre d'annotations dans les trois sous-
</p>
<p>corpus: fran&#231;ais, allemand et anglais. 
</p>
<p>4 Nous remercions &#224; ce propos Christiane Jadelot de l'ATILF pour son implication. 
</p>
<p>276</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les par projection cross-linguistique 
</p>
<p>La distribution des frames est gonfl&#233;e vers le bas, ce qui est une seconde raison pour le plus 
faible accord sur les &#233;tendues, les frames plus rares &#233;tant a priori plus difficiles &#224; annoter. 
</p>
<p>5 Evaluation exp&#233;rimentale 
</p>
<p>5.1 Conditions de l'exp&#233;rimentation 
</p>
<p>Dans nos exp&#233;riences, nous appliquons la m&#233;thode de projection au sous-corpus anglais-
fran&#231;ais que nous avons d&#233;crit dans la section 3. L'information sur les FEs est projet&#233;e de 
l'anglais sur le fran&#231;ais. L'annotation manuelle en fran&#231;ais sert de r&#233;f&#233;rence pour &#233;valuer les 
annotations projet&#233;es. Nous comparons deux sources de projection  diff&#233;rentes : 
</p>
<p>z Condition 1 : annotation manuelle. Cette annotation correspond &#224; la configuration de 
P&amp;L, dont le mat&#233;riel est disponible. Comme nous l'avons &#233;voqu&#233;, la pertinence de 
cette disposition est incertaine pour une application pratique, puisqu'en g&#233;n&#233;ral, 
aucune annotation manuelle n'est  disponible pour des corpus parall&#232;les. 
</p>
<p>z Condition 2 : annotation automatique. Dans cette configuration nous avons utilis&#233; un 
analyseur s&#233;mantique de surface de derni&#232;re g&#233;n&#233;ration (Giuglea et Moschitti 2006) 
entra&#238;n&#233; sur les donn&#233;es de FrameNet 1.1, pour annoter les FEs sur le c&#244;t&#233; anglais du 
corpus5. Giuglea et Moschitti rapportent une pr&#233;cision de 85.2 % sur un jeu de 
donn&#233;es tir&#233; de FrameNet ; dans notre &#233;valuation avec l'annotation anglaise de 
r&#233;f&#233;rence de P&amp;L, nous obtenons une f-mesure6 de 65.1 (pr&#233;c.: 78.1 %, rap.:  55.8 %). 
Les sources de diff&#233;rence sont les suivantes : (a) notre jeu de donn&#233;es &#171; standard &#187; 
n'inclut pas les traits de PropBank utilis&#233;s par Giuglea et Moschitti, (b) l'application &#224; 
un corpus d'un autre domaine et (c) la couverture restreinte aux verbes, qui ne 
concernent que 87 % de notre corpus d'&#233;valuation. Avec une &#233;valuation limit&#233;e aux 
verbes, le syst&#232;me obtient un rappel de 62.4 %. 
</p>
<p>Afin de pouvoir rendre nos r&#233;sultats comparables avec P&amp;L, nous suivons leur d&#233;marche: le 
corpus parall&#232;le est divis&#233; en un corpus de d&#233;veloppement et un corpus de test (50 % chacun). 
Dans les deux conditions, nous utilisons l'ensemble de d&#233;veloppement pour comparer le 
mod&#232;le M de r&#233;f&#233;rence avec les mod&#232;les sur constituants, chacun combinant une classe 
d'alignement avec une proc&#233;dure de filtrage. Les r&#233;sultats des meilleurs mod&#232;les pour chaque 
alignement sont ensuite v&#233;rifi&#233;s sur l'ensemble de test. Toutes les &#233;valuations utilisent 
l'alignement automatique intersectif produit par GIZA++. 
</p>
<p>5.2 R&#233;sultats
</p>
<p>Mod&#232;le \ Filtre &#135; NA MG Arg
Mots 50.7 (53.3/48.3) 50.7 (53.3/48.3) 30.4 (32.5/28.6) -
</p>
<p>Total 53.5 (57.2/50.2) 57.8 (68.1/50.2) 45.6 (60.5/36.6) 64.1 (71.4/58.1) 
</p>
<p>Couvrant 55.9 (60.0/52.3) 62.6 (65.9/59.7) 61.9 (66.8/57.6) 64.2 (71.5/58.3) 
Exact 54.7 (60.9/49.6) 63.4 (68.9/58.7) 62.3 (69.4/56.6) 60.6 (84.2/47.3) 
</p>
<p>Tableau 5: Evaluations dans l'ensemble de d&#233;veloppement, source manuelle (condition 1) 
</p>
<p>5 Nous remercions Ana-Maria Giuglea et Alessandro Moschitti pour l'acc&#232;s &#224; leur logiciel. 
6 F-mesure = (2&#215;Rappel&#215;Pr&#233;cision)&#247;(Rappel+Pr&#233;cision) 
</p>
<p>277</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sebastian PAD&#211;, Guillaume PITEL
</p>
<p>Nous pr&#233;sentons les r&#233;sultats sur l'ensemble de d&#233;veloppement dans les tableaux 5 (condition 
1) et 6 (condition 2). Les r&#233;sultats sur l'ensemble de test sont dans le tableau 7. Le format des 
mesures reproduites est : &#171; F-mesure (%Pr&#233;cision/%Rappel) &#187;. Les meilleures configurations 
globales d'apr&#232;s l'ensemble de d&#233;veloppement sont en gris&#233;, les meilleures f-mesures par filtre 
sont en gras, les meilleures f-mesures par mod&#232;le sont soulign&#233;es. 
</p>
<p>Mod&#232;le \ Filtre &#135;&#3; NA MG Arg
Mots 45.4 (54.6/38.9) 45.4 (54.6/38.6) 28.1 (34.0/24.0) -
</p>
<p>Total 47.9 (58.4/40.6) 51.3 (69.7/40.6) 42.8 (66.3/31.6) 59.5 (74.4/49.6) 
Couvrant 51.7 (62.9/43.9) 57.6 (68.8/49.6) 56.7 (69.5/47.9) 59.5 (74.4/49.6) 
Exact 51.5 (65.0/42.6) 58.3 (71.7/49.1) 57.1 (72.0/47.3) 55.9 (84.6/41.7) 
</p>
<p>Tableau 6: Evaluations dans l'ensemble de d&#233;veloppement, source automatique (condition 2) 
</p>
<p>Mod&#232;le Condition 1 Condition 2 
Mots &#135;&#3;:  49.3 (50.6/48.1) &#135;&#3;:  45.4 (54.6/38.9) 
Total Arg : 62.7 (68.3/57.9) Arg : 56.1 (72.0/47.9) 
</p>
<p>Couvrant Arg : 63.0 (68.8/58.3) Arg : 55.9 (71.6/45.9) 
</p>
<p>Exact NA : 63.1 (66.2/60.3) NA : 57.2 (70.2/48.3) 
</p>
<p>Tableau 7: Evaluation des projections dans l'ensemble de test, comparaison des mod&#232;les dans 
chaque condition (avec les meilleurs filtres selon l'ensemble de d&#233;veloppement).  
</p>
<p>5.3 Comparaisons et discussion 
</p>
<p>Nous consid&#233;rons tout d'abord les r&#233;sultats sur l'ensemble de d&#233;veloppement pour la condition 
1, tableau 5. On constate que les mod&#232;les &#224; base de constituants d&#233;passent syst&#233;matiquement 
la r&#233;f&#233;rence du mod&#232;le M, ce qui signifie que la segmentation est utile aussi pour le fran&#231;ais. 
Les r&#233;sultats de la condition 1 sont largement similaires aux r&#233;sultats de P&amp;L dans plusieurs 
aspects. La qualit&#233; globale est proche : le meilleur mod&#232;le sur le fran&#231;ais (f=64.2 %) est 
seulement 3 % en dessous du score pour l'allemand obtenu par P&amp;L (f=67.3 %). Les r&#233;sultats 
sur le fran&#231;ais sont encore plus favorables quand ils sont compar&#233;s &#224; leur borne sup&#233;rieure, 
qui est l'accord inter-annotateur (&#224; d&#233;faut d'avoir une &#233;valuation manuelle des projections) : 
ils sont &#224; 6 % sous le plafond de 72 %, l&#224; o&#249; les r&#233;sultats allemands sont 16 % sous l'accord &#224; 
83 %. Ensuite, on observe le m&#234;me impact des proc&#233;dures de filtrage. Les r&#233;sultats montrent 
clairement un impact positif des filtres NA et Arg. En revanche, le filtre NA qui limite le bruit 
d&#251; &#224; l'alignement montre de meilleurs r&#233;sultats quand le mod&#232;le est plus restrictif (Couvrant et 
Exact par rapport &#224; Total), alors que le filtre Arg am&#233;liore nettement la pr&#233;cision mais fait 
baisser le rappel, et favorise les mod&#232;les relativement moins restrictifs (Total et Couvrant par 
rapport &#224; Exact). Ces observations montrent que les mod&#232;les d'alignement et les filtres de 
P&amp;L sont pertinents au-del&#224; de la paire de langues pour laquelle ils ont &#233;t&#233; cr&#233;&#233;s. La 
g&#233;n&#233;ricit&#233; de ce paradigme doit &#234;tre prise en compte pour comparer nos r&#233;sultats avec ceux de 
Johansson et Nugues (2006), qui annoncent une f-mesure de 82.0 (pr&#233;c. : 84.0, rap. : 81.0) 
pour leur projection. Ils utilisent des heuristiques sp&#233;cifiques au su&#233;dois7, qui devront &#234;tre 
</p>
<p>7 L'accord inter-annotateur de leur corpus de r&#233;f&#233;rence n'&#233;tant pas connu,et comme celui-ci ne comporte que 
150 phrases, il n'est pas possible de faire une comparaison des deux m&#233;thodes.  
</p>
<p>278</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les par projection cross-linguistique 
</p>
<p>recr&#233;&#233;es pour chaque nouvelle langue cible et sont probablement plus difficile &#224; identifier 
pour des langues plus distantes que l'anglais et le su&#233;dois, qui sont des langues tr&#232;s proches 
(Koehn 2005). 
</p>
<p>Ensuite, nous nous int&#233;ressons aux r&#233;sultats utilisant une source automatique (condition 2), 
qui sont expos&#233;s dans le tableau 6 pour l'ensemble de d&#233;veloppement. On note que le passage 
de la version manuelle &#224; celle annot&#233;e automatiquement conduit &#224; une perte de performance 
allant de seulement 3 &#224; 7 points sur la f-mesure. Cette diff&#233;rence correspond assez bien &#224; la 
diff&#233;rence observ&#233;e entre les annotations manuelles (f=72 %, d'apr&#232;s l'accord inter-
annotateurs), et l'analyseur s&#233;mantique de surface (f=65 %). Une comparaison des tableaux 5 
et 6 montre que les caract&#232;res de l'annotation automatique (haute pr&#233;cision, rappel bas) sont 
tr&#232;s clairement reproduits dans les propri&#233;t&#233;s de la projection : alors que la source 
automatique am&#232;ne une nette chute du rappel, la pr&#233;cision reste constante voire s'am&#233;liore par 
rapport &#224; la source manuelle. Cet apparent paradoxe vient du fait que la projection &#224; partir de 
la source automatique ne tente pas de projeter certain FEs difficiles, par exemple ceux qui 
s'&#233;tendent sur plusieurs constituants, simplement parce que les FEs n'ont pas &#233;t&#233; annot&#233;s par 
le syst&#232;me automatique sur l'anglais. En somme, les r&#233;sultats de la condition 2 montrent la 
possibilit&#233; d'utiliser des analyseurs s&#233;mantiques de surface comme entr&#233;e de la projection, ce 
qui est indispensable pour appliquer ce paradigme &#224; grande &#233;chelle. En plus, les annotations 
obtenues sont de grande pr&#233;cision, caract&#233;ristique essentielle pour la cr&#233;ation de ressources. 
</p>
<p>Les r&#233;sultats sur l'ensemble de test sont expos&#233;s dans le tableau 7. Moins riches 
d'enseignement que les r&#233;sultats de l'ensemble de d&#233;veloppement et par manque de place, 
nous n'en ferons qu'une synth&#232;se courte. Une baisse de 2 &#224; 3 % est observ&#233;e en moyenne sur 
la f-mesure, par rapport &#224; l'ensemble de d&#233;veloppement, mais cette diff&#233;rence peut s'expliquer 
par une variation al&#233;atoire naturelle sur le partitionnement du corpus (P&amp;L obtiennent des 
r&#233;sultats l&#233;g&#232;rement meilleurs avec le m&#234;me d&#233;coupage). Les diff&#233;rences entre les m&#233;thodes 
bas&#233;es sur constituants ne sont pas significatives, mais le meilleur mod&#232;le (E+NA) pour le 
fran&#231;ais est le m&#234;me que le meilleur mod&#232;le pour l'allemand trouv&#233; par P&amp;L. 
</p>
<p>6 Conclusion et perspectives 
Dans cette &#233;tude nous avons montr&#233; la possibilit&#233; de produire des annotations s&#233;mantiques de 
grande pr&#233;cision pour le fran&#231;ais en appliquant la d&#233;marche propos&#233;e par Pad&#243; et Lapata 
(2005, 2006). Cette d&#233;monstration proc&#232;de en trois &#233;tapes : (1) la v&#233;rification que le 
parall&#233;lisme fran&#231;ais-anglais du point de vue de la s&#233;mantique des frames est suffisant pour 
permettre la projection de l'annotation, (2) la d&#233;monstration que les r&#233;sultats obtenus par P&amp;L 
pour la paire anglais-allemand se reproduisent bien pour la paire anglais-fran&#231;ais aussi bien 
en terme de performance absolue que du point de vue des effets des diff&#233;rents filtrages &#8211; ce 
qui  montre la g&#233;n&#233;ricit&#233; dans la d&#233;marche suivie et valide une fois encore l'aspect multilingue 
de FrameNet &#8211; et (3) la d&#233;monstration que m&#234;me l'utilisation d'une source bruit&#233;e provenant 
d'une annotation automatique r&#233;sulte en une annotation qui, en particulier, montre une haute 
pr&#233;cision. D'ores et d&#233;j&#224;, une analyse plus approfondie de nos donn&#233;es a montr&#233; que 124 
phrases du corpus ont une annotation parfaitement identique &#224; l'annotation manuelle de 
r&#233;f&#233;rence. Ces r&#233;sultats ont de fortes chances de s'am&#233;liorer avec des avanc&#233;es dans les 
technologies d'alignement, d'analyse syntaxique et s&#233;mantique de surface. 
</p>
<p>Avec un tel r&#233;sultat de r&#233;f&#233;rence, relativement facile &#224; obtenir (alignement automatique, 
analyseur syntaxique et corpus align&#233; avec l'anglais), on peut tr&#232;s raisonnablement envisager 
d'entra&#238;ner d&#232;s maintenant des annotateurs automatiques de FEs en fran&#231;ais &#224; moindre co&#251;t. 
Les r&#233;sultats obtenus par Johansson et Nugues (2006) nous indiquent que des techniques 
sp&#233;cifiques &#224; la langue cible, qui &#233;liminent les FEs non plausibles projet&#233;s durant l'induction 
</p>
<p>279</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sebastian PAD&#211;, Guillaume PITEL
</p>
<p>de l'analyseur s&#233;mantique, permettent de produire un annotateur automatique ayant une 
performance &#224; peine d&#233;grad&#233;e par rapport aux versions natives. Ces bons r&#233;sultats autorisent &#224; 
envisager une m&#233;thode de construction de ressources fond&#233;e sur un travail it&#233;ratif, utilisant &#224; 
la fois un outil automatique pour produire des annotations et une phase de r&#233;vision manuelle 
pour obtenir un corpus de bonne qualit&#233; lexicographique. En effet, l'effort requis pour 
d&#233;marrer une telle ressource est rendu abordable par cette approche, m&#234;me si une &#233;valuation 
plus pr&#233;cise du co&#251;t de correction par rapport au co&#251;t de production reste &#224; faire afin de 
valider totalement cette d&#233;marche. 
</p>
<p>R&#233;f&#233;rences
BOAS H.C. (2002). Bilingual FrameNet dictionaries for machine translation. Actes de LREC 2002, pp. 
1364&#8211;1371, Las Palmas, Iles Canaries.  
BOUILLON P., FABRE C., S&#201;BILLOT P., JACQMIN L. (2000). Apprentissage de ressources lexicales pour 
l'extension de requ&#234;tes, Traitement Automatique des Langues, 41:2, pp. 367&#8212;393. 
BOURIGAULT D., FABRE C., FR&#201;ROT C., JACQUES M.-P., OZDOWSKA S. (2005). Syntex, analyseur 
syntaxique de corpus, Actes de TALN 2005, Dourdan, France. 
BURCHARDT A., ERK K., FRANK A., KOWALSKI A., PADO S. (2006). SALTO &#8211; A Versatile Multi-
Level Annotation Tool. Actes de LREC 2006, G&#234;nes, Italie.
FILLMORE C.J. (1982). Frame Semantics. Linguistics in the Morning Calm, pp. 111&#8212;38. Seoul. 
FILLMORE C.J., JOHNSON C.R., PETRUCK M.R. (2003). Background to FrameNet. International
Journal of Lexicography, 16:235&#8211;250. 
FUNG P., CHEN B. (2004). BiFrameNet: Bilingual frame semantics resources construction by cross-
lingual induction. Actes de COLING 2004, pp. 931&#8212;935, Gen&#232;ve, Suisse.
GILDEA D., JURAFSKY D. (2002). Automatic labeling of semantic roles. Computational Linguistics,
28(3):245&#8211;288.
GIUGLEA A.-M., MOSCHITTI A. (2006). Semantic role labeling via FrameNet, VerbNet and PropBank. 
Actes de COLING/ACL 2006, pp. 929&#8212;936, Syndey, Australie. 
HWA R., RESNIK P., WEINBERG A., KOLAK O. (2002). Evaluation translational correspondance using 
annotation projection. Actes de ACL 2002, pp. 392&#8212;399, Philadelphia. 
JOHANSSON R., NUGUES P.  (2006). A FrameNet-based Semantic Role Labeler for Swedish. Actes de 
COLING/ACL 2006 Main Conf. Poster Sessions, pp. 436&#8212;443, Sydney, Australie.  
KOEHN P. (2005). Europarl: A parallel corpus for statistical machine translation. Actes de MT Summit 
X. Phuket, Tha&#239;lande. 
NARAYANAN S., HARABAGIU S. (2004). Question answering based on semantic structures. Actes de 
COLING 2004, pp. 693&#8211;701, Gen&#232;ve, Suisse.
OCH F. J., NEY H. (2003). A Systematic Comparison of Various Statistical Alignment Models, 
Computational Linguistics,  29(1):19-51. 
PAD&#211; S., LAPATA M. (2005). Cross-lingual projection of role-semantic information. Actes de 
HLT/EMNLP 2005, Vancouver, Canada.
PAD&#211; S., LAPATA M. (2006). Optimal Constituent Alignment with Edge Covers for Semantic 
Projection. Actes de COLING/ACL 2006, pp. 1161&#8212;1168, Sydney, Australie. 
PITEL G. (2006). Using bilingual LSA for FN annotation of French text from generic resources. 
Workshop on Multilingual Annotation : Theory and Applications, Saarbr&#252;cken. 
SURDEANU M., HARABAGIU S., WILLIAMS J., AARSETH P. (2003). Using predicate-argument 
structures for information extraction. Actes de ACL 2003, pp. 8&#8212;15, Sapporo, Japon.
YAROWSKY D., NGAI G., WICENTOWSKI R. (2001). Inducing multilingual text analysis tools via 
robust projection across aligned corpora. Actes de HLT  2001, pp. 161&#8212;168. San Francisco. 
</p>
<p>280</p>

</div></div>
</body></html>