<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un Lexique G&#233;n&#233;ratif de r&#233;f&#233;rence pour le fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Un Lexique G&#233;n&#233;ratif de r&#233;f&#233;rence pour le fran&#231;ais 
</p>
<p>Fiammetta NAMER1, Pierrette BOUILLON2, Evelyne JACQUEY3
1Universit&#233; Nancy2 et ATILF 
</p>
<p>fiammetta.namer@univ-nancy2.fr
2 ISSCO 
</p>
<p>pierrette.bouillon@issco.unige.ch
3ATILF,
</p>
<p>evelyne.jacquey@atilf.fr
</p>
<p>R&#233;sum&#233;. Cet article propose une approche originale visant la construction d&#8217;un lexique 
s&#233;mantique de r&#233;f&#233;rence sur le fran&#231;ais. Sa principale caract&#233;ristique est de pouvoir s&#8217;appuyer 
sur les propri&#233;t&#233;s morphologiques des lex&#232;mes. La m&#233;thode combine en effet des r&#233;sultats 
d&#8217;analyse morphologique (Namer, 2002;2003), &#224; partir de ressources lexicales de grande taille 
(nomenclatures du TLF) et des m&#233;thodologies d&#8217;acquisition d&#8217;information lexicale d&#233;j&#224; 
&#233;prouv&#233;es (Namer 2005; S&#233;billot 2002). Le format de repr&#233;sentation choisi, dans le cadre du 
Lexique G&#233;n&#233;ratif, se distingue par ses propri&#233;t&#233;s d&#8217;expressivit&#233; et d&#8217;&#233;conomie. Cette 
approche permet donc d&#8217;envisager la construction d&#8217;un lexique de r&#233;f&#233;rence sur le fran&#231;ais 
caract&#233;ris&#233; par une forte homog&#233;n&#233;it&#233; tout en garantissant une couverture large, tant du point 
de vue de la nomenclature que du point de vue des contenus s&#233;mantiques. Une premi&#232;re 
validation de la m&#233;thode fournit une projection quantitative et qualitative des r&#233;sultats 
attendus.
</p>
<p> Abstract. This paper describes an original approach aiming at building a reference 
semantic lexicon for French. Its main characteristic is that of being able to rely on 
morphological properties. The method thus combines morphological analyses results (Namer 
2002;2003;2005) from large scale lexical resources (i.e. TLF word lists) with already tested 
acquisition methodologies on lexical information (S&#233;billot, 2002). The representation format, 
within the Generative Lexicon framework, has been chosen for its expressiveness and 
economy features. So, this approach allows us to consider building a reference lexicon for 
French, which is fundamentally homogeneous as well as of a large coverage. A feasability 
study of the described method provides a projection of expected results, from both 
quantitative and qualitative points of view. 
</p>
<p>Mots-cl&#233;s : acquisition lexicale, lexique de r&#233;f&#233;rence du fran&#231;ais, mod&#232;le du lexique 
g&#233;n&#233;ratif, morphologie constructionnelle, corpus, s&#233;mantique. 
</p>
<p>Keywords:   lexical acquisition, reference lexicon for French, generative lexicon model, 
word formation, corpora, semantics. 
</p>
<p>233</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fiammetta NAMER, Pierrette BOUILLON, Evelyne JACQUEY
</p>
<p>1 Introduction : objectifs 
Cet article pr&#233;sente une m&#233;thodologie1, dont l&#8217;objectif est de construire automatiquement un 
lexique du fran&#231;ais dans le format du Lexique G&#233;n&#233;ratif (Pustejovsky 1995), d&#233;sormais LG. 
La construction de ce lexique exploite deux sources d&#8217;acquisition : des r&#232;gles linguistiques 
fond&#233;es sur des contraintes impos&#233;es par la morphologie (d&#233;sormais r&#232;gles de construction de 
lex&#232;mes : RCL, cf. (Aronoff 1994; Fradin 2003)), et des r&#232;gles d&#8217;apprentissage, &#224; partir de 
d&#233;finitions du TLFi2 ou/et &#224; partir de corpus. Ces derni&#232;res s&#8217;appliquent aux lex&#232;mes non 
construits, c&#8217;est-&#224;-dire non accessibles aux RCL, et permettent, en cas d&#8217;ambigu&#239;t&#233; non 
soluble par les r&#232;gles, d&#8217;acqu&#233;rir des informations sp&#233;cifiques, ou d&#8217;enrichir les sch&#233;mas sous-
sp&#233;cifi&#233;s. Par cette combinaison d'approches, nous esp&#233;rons arriver &#224; une meilleure 
coh&#233;rence globale du lexique d&#233;riv&#233;. En effet, les RCL d&#233;finissent des structures s&#233;mantiques 
g&#233;n&#233;rales qui s'appliquent de fa&#231;on syst&#233;matique &#224; des classes de lex&#232;mes construits 
similaires. C&#8217;est pourquoi elles sont traduisibles sous forme de mod&#232;les lexicaux dans le LG. 
Par exemple, tous les adjectifs d&#233;verbaux d&#233;notent une propri&#233;t&#233; attendue, qui se manifeste 
sous la forme de l&#8217;activation potentielle du pr&#233;dicat de base. Cette propri&#233;t&#233; commune 
s&#8217;observe quelles que soient les caract&#233;ristiques du verbe de base, comme l&#8217;illustrent les 
exemples sous (1a) (le verbe est agentif) et (1b) (le verbe est inaccusatif) :
</p>
<p>(1) a. [[pull lavable]] = Oy, &#7;e, &#7;x (&#161; laver&#8217;(e, x,y) &amp; pull&#8217;(y)) 
b.     [[marchandise p&#233;rissable]] = Oy, &#7;e (&#161; p&#233;rir&#8217;(e, y) &amp; marchandise&#8217;(y)) 
</p>
<p>Dans la suite, nous pr&#233;sentons cette m&#233;thodologie en d&#233;tail. Nous la situons d&#8217;abord dans un 
cadre plus g&#233;n&#233;ral, pour montrer sa sp&#233;cificit&#233;. Nous l&#8217;illustrons ensuite par plusieurs
exemples concrets qui montrent l&#8217;apport respectif des RCL et des ressources lexicales et 
textuelles. Enfin, nous &#233;valuons quantitativement les r&#233;sultats escompt&#233;s. 
</p>
<p>2 Cadre Th&#233;orique 
Aujourd&#8217;hui, il existe diff&#233;rents lexiques s&#233;mantiques pour le fran&#231;ais, plus ou moins librement 
disponibles, par exemple l'adaptation et/ou l'extension en fran&#231;ais de ressources comme 
EuroWordnet (Vossem 2001). Cependant, aucun d&#8217;entre eux n&#8217;a r&#233;ussi &#224; rendre explicite 
l&#8217;ensemble des propri&#233;t&#233;s suivantes : les liens morphologiques entre les entr&#233;es lexicales 
(comme ceux tiss&#233;s en (1) entre LAVABLE et LAVER, P&#201;RISSABLE et P&#201;RIR) ; d'autres relations 
permettant d&#8217;&#233;toffer la structure hi&#233;rarchique du lexique (par exemple, le lien nom-verbe entre 
COUTEAU et sa fonction prototypique, i.e. COUPER) ; la polys&#233;mie syst&#233;matique de certains 
lex&#232;mes (cf. exemples (2)) ; les interactions syntaxe-s&#233;mantique (comme la relation mise en 
jeu, en (2a), entre les deux emplois de COULER et les fonctions grammaticales r&#233;alis&#233;es dans 
chaque cas). Or c'est l'acquisition de ces propri&#233;t&#233;s qui constitue la motivation fondamentale 
de notre approche. 
</p>
<p>(2) (a) le bateau coule versus les pirates coulent le bateau
COULER : est-il transitif/causatif ou intransitif/inchoatif ? 
</p>
<p>1 d&#233;velopp&#233;e dans le cadre d'une proposition de projet qui r&#233;unit les auteurs de cet article ainsi que C. Fabre 
(ERSS), P. S&#233;billot et V. Claveau (IRISA).  
</p>
<p>2 TLFi : &quot;Tr&#233;sor de la Langue Fran&#231;aise informatis&#233;e&quot;: version informatis&#233;e du 'Tr&#233;sor de la langue Fran&#231;aise', 
16 volumes, cf. URL : http://atilf.atilf.fr/tlf.htm 
</p>
<p>234</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un lexique g&#233;n&#233;ratif de r&#233;f&#233;rence pour le fran&#231;ais 
</p>
<p>(b) commencer &#224; &#233;crire/lire un livre versus commencer un livre
COMMENCER : s&#233;lectionne-t-il un objet direct nominal ou un syntagme verbal ?
</p>
<p>(c) la salle a applaudi, la salle contient 200 personnes, la salle a &#233;t&#233; repeinte r&#233;cemment 
SALLE : d&#233;signe-t-il un collectif, un espace ou un objet physique ? 
</p>
<p>(d) un chien rapide versus une route rapide
RAPIDE : qualifie-t-il la nature (CHIEN) ou la fonction (ROUTE) du nom modifi&#233; ? 
</p>
<p>(e) un livre rouge versus un livre int&#233;ressant
LIVRE : d&#233;note-t-il un objet physique ou de l&#8217;information ? 
</p>
<p>Son originalit&#233; tient de fait en deux points : pour extraire ces diff&#233;rentes informations, nous 
r&#233;utilisons un analyseur morphologique existant (D&#233;riF, cf. (Namer 2002, 2003, 2005)). Nous 
tirons ainsi parti des propri&#233;t&#233;s s&#233;mantiques des lex&#232;mes reli&#233;s morphologiquement pour 
d&#233;river un lexique coh&#233;rent et de grande taille &#224; partir des traits morphologiques et 
s&#233;mantiques au moyen desquels l&#8217;analyseur D&#233;rif annote automatiquement les lex&#232;mes. 
Ensuite, le mod&#232;le choisi pour l'encodage des informations est le LG. Par rapport aux autres 
th&#233;ories lexicales, LG pr&#233;sente diff&#233;rents attraits. Il se caract&#233;rise fondamentalement par un 
principe d&#8217;&#233;conomie relay&#233;e par un syst&#232;me de types coh&#233;rent et des m&#233;canismes g&#233;n&#233;ratifs 
qui factorisent l&#8217;information lexicale s&#233;mantique et rendent ainsi compte des cas d&#8217;ambigu&#239;t&#233;s 
lexicales, comme celles illustr&#233;es sous (2). Dans LG, le sens est repr&#233;sent&#233; sous la forme du 
produit de quatre rubriques, chacune remplissant un r&#244;le particulier. Ces quatre r&#244;les 
s&#233;mantiques, appel&#233;s FORMEL, CONSTITUTIF, AGENTIF, et TELIQUE, constituent la 
structure des qualia. Ils sont illustr&#233;s dans la Figure (1) pour le nom COUTEAU.
</p>
<p>ROLE Fonction Exemple : M = couteau 
FORMEL place de M dans la 
</p>
<p>taxinomie 
x de type artefact
</p>
<p>CONSTITUTIF relations (partie-tout) entre 
M et ses constituants 
</p>
<p>Relation = Composant-assemblage , entre x 
(ie le couteau) et z (de type manche) et entre x 
et y (de type lame) 
</p>
<p>AGENTIF conditions n&#233;cessaires 
(pr&#233;suppos&#233;es) &#224; 
l&#8217;existence de M 
</p>
<p>Ev&#233;nement (accomplissement) : fabriquer, 
faisant intervenir un agent u et le r&#233;sultat x 
</p>
<p>TELIQUE d&#233;crit la finalit&#233; de M Ev&#233;nement (accomplissement) : couper, 
faisant intervenir un agent u&#8217;, l&#8217;instrument x 
et l&#8217;objet &#224; couper : y 
</p>
<p>Figure 1 : Structure de qualia d&#8217;une entr&#233;e lexicale M dans le LG 
</p>
<p>Dans cette structure, chaque r&#244;le d&#233;finit un pr&#233;dicat qui relie entre eux diff&#233;rents param&#232;tres, 
et est caract&#233;ris&#233; d&#8217;un point de vue &#233;v&#233;nementiel, comme l'illustre la troisi&#232;me colonne. Les 
param&#232;tres manipul&#233;s par le pr&#233;dicat sont typ&#233;s. C'est aussi le cas de la structure de qualia, 
qui, sous la forme du Paradigme Lexical Conceptuel, organise le lexique en classes 
s&#233;mantiques. Toute structure de qualia peut ainsi &#234;tre interpr&#233;t&#233;e et reformul&#233;e dans diff&#233;rents 
mod&#232;les logiques (Pustejovsky 2001). Par exemple, la structure de qualia de COUTEAU peut 
&#234;tre traduite dans la formule (3). Cette propri&#233;t&#233; g&#233;n&#233;rale rend le LG particuli&#232;rement ad&#233;quat 
pour le calcul logique (Pustejovsky 2001).
</p>
<p>(3) Ox [couteau&#8217;(x) : formal(x) = Ox [artefact&#8217;(x)] &#154; constitutif(x) = &#7;y,z [composant-
assemblage&#8217;(y, x) &#154; composant-assemblage&#8217;(z,x)] &#154; agentif(x) = &#7;e,u [fabriquer&#8217;(e, u, x)] &#154;
telique(x) = Oe&#8217; &#7;uy&#8217; [&#161; couper&#8217;(e&#8217;, u&#8217;, y, avec&#8217;(x))] 
Dans le pass&#233;, d&#8217;autres projets se sont donn&#233; un objectif similaire (notamment Acquilex, cf.   
(Copestake et al. 1993),  Simple  (Busa et al. 2001) et Clips, cf. (Calzolari et al. 2003)). 
Cependant aucun d'entre eux n'a v&#233;ritablement exploit&#233; les liens morphologiques pour en 
</p>
<p>235</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fiammetta NAMER, Pierrette BOUILLON, Evelyne JACQUEY
</p>
<p>extraire les informations s&#233;mantiques pertinentes &#224; grande &#233;chelle, faute d'un analyseur 
morphologique ad&#233;quat. En prenant comme source l'analyse fournie par Derif, nous &#233;vitons 
deux pierres d'achoppement : d'abord, la repr&#233;sentation LG d&#233;coule ici du proc&#233;d&#233; 
morphologique impliqu&#233;, ce qui la motive th&#233;oriquement. D'autre part, tous les lex&#232;mes 
construits de la m&#234;me mani&#232;re re&#231;oivent une repr&#233;sentation LG similaire, ce qui devrait 
assurer une meilleure coh&#233;rence globale de la ressource. Nous esp&#233;rons ainsi deux retomb&#233;es 
principales sur le plan th&#233;orique. D'une part, nous compl&#233;tons l'apport de l'analyseur D&#233;riF en 
le couplant &#224; une s&#233;mantique plus profonde. Rappelons que la contribution de la morphologie 
&#224; la construction du sens lexical, que D&#233;riF formalise, n'est que partielle (cf section 3.3) : une 
RCL ne fournit en effet que les &#233;l&#233;ments fondamentaux de l'interpr&#233;tation d'un lex&#232;me, qui 
seront sp&#233;cifi&#233;s ult&#233;rieurement, notamment par le contexte d'utilisation (cf. (Aronoff 1980)). 
D'autre part, nous confirmons les hypoth&#232;ses th&#233;oriques sur lesquelles repose le LG, et 
notamment nous r&#233;pondons &#224; la question suivante :  LG fournit-il un cadre suffisant pour 
d&#233;crire les diff&#233;rents aspects de la s&#233;mantique lexicale et ceci, &#224; grande &#233;chelle, pour 
diff&#233;rentes familles de lex&#232;mes ? Id&#233;alement, toutes les propri&#233;t&#233;s pr&#233;dictibles par les RCL 
(par exemple : la base verbale des verbes pr&#233;fix&#233;s par d&#233;- , e.g. D&#201;COUDRE, D&#201;FAIRE,  d&#233;note 
un accomplissement, dont le r&#233;sultat d&#233;signe une propri&#233;t&#233; r&#233;versible, cf. (Amiot &#224; para&#238;tre)) 
devraient pouvoir &#234;tre repr&#233;sent&#233;es formellement au niveau de la structure des qualia. De cette 
structure, diff&#233;rentes informations peuvent ensuite &#234;tre extraites, dont on a d&#233;j&#224; montr&#233; 
l&#8217;int&#233;r&#234;t sur le plan pratique. (Bouillon et al. 2000; Claveau et al. 2001; Claveau et al. 2003) 
ont notamment montr&#233; comment tirer parti des liens Nom-Verbe exprim&#233;s dans la qualia pour 
la recherche documentaire. Une question ouverte est de savoir si cette ressource sera plus utile 
que les pr&#233;c&#233;dentes bas&#233;es sur le m&#234;me formalisme. Nous pensons en tout cas que le fait de 
lier cette ressource &#224; un analyseur morphologique existant la rend potentiellement plus apte &#224; 
r&#233;pondre &#224; la question fondamentale de la cr&#233;ativit&#233; de la langue, D&#233;riF &#233;tant con&#231;u pour 
l&#8217;analyse des lex&#232;mes inconnus. Dans la suite, nous d&#233;crivons plus en d&#233;tail la m&#233;thodologie 
d&#8217;acquisition.
</p>
<p>3 M&#233;thodologie d&#8217;acquisition du lexique 
L'acquisition des entr&#233;es lexicales fait collaborer deux approches d&#233;crites dans ce qui suit. La 
premi&#232;re se fonde sur l'utilisation de connaissances morphologiques (section 3.1), la seconde 
sur l'emploi de m&#233;thodes d'apprentissage &#224; partir de corpus (section 3.2). La combinaison des 
deux approches (section 3.3), enfin, confirme, infirme ou affine les contributions propres &#224; 
chaque technique. 
</p>
<p>3.1  Acquisition d&#8217;entr&#233;e par r&#232;gles morphologiques 
</p>
<p>Cette approche exploite les r&#233;sultats fournis par l&#8217;analyseur morphologique D&#233;riF (Namer 
2002, 2003, 2005), qui sont reformat&#233;s de mani&#232;re &#224; &#234;tre en conformit&#233; avec les notations du 
LG, suivant l&#8217;extension du mod&#232;le propos&#233; dans (Jacquey et al. &#224; para&#238;tre; Namer et al. 2003, 
soumission).
</p>
<p>3.1.1 R&#233;sultats de D&#233;riF 
</p>
<p>D&#233;riF produit la d&#233;composition d&#8217;un lex&#232;me L muni d&#8217;une cat&#233;gorie grammaticale, selon sa 
base morphologique B. Cette analyse s&#8217;accompagne d&#8217;annotations, refl&#233;tant les contraintes de 
la RCL appliqu&#233;e, et pouvant porter sur L et B. Par exemple, la Figure2 illustre au moyen de 
</p>
<p>236</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un lexique g&#233;n&#233;ratif de r&#233;f&#233;rence pour le fran&#231;ais 
</p>
<p>l'analyse de DESSOULERVERBE (construit sur SOULADJ) le format dans lequel s'affiche le r&#233;sultat 
de l'analyse par la RCL en d&#233;- des verbes d&#233;sadjectivaux. En dehors de l'analyse elle m&#234;me 
(lignes 1 et 2), la r&#232;gle attribue aux lex&#232;mes reli&#233;s les traits suivants : l&#8217;adjectif doit &#234;tre 
toujours qualificatif et d&#233;crire une propri&#233;t&#233; transitoire (ligne 3). Le verbe est soit transitif 
causatif (&quot;le caf&#233; sal&#233; dessoule Max&quot;) soit intransitif r&#233;sultatif (ou anticausatif) (&quot;Max 
dessoule&quot;) (ligne 4).
</p>
<p>1
2
3
4
</p>
<p>dessouler/VERBE ==&gt; soul,ADJ/d&#233;:prefixe 
&quot;(Supprimer - Faire perdre) le caract&#232;re soul&quot; 
soul/ADJ:(pr&#233;dicatif,_,temporaire)
dessouler/VERBE:  (causatif,transitif,[cause,theme])|| 
                  (resultatif,intransitif,[theme])
</p>
<p>Figure 2 : Analyse du verbe DESSOULER par D&#233;riF 
</p>
<p>3.1.2 Traduction des r&#233;sultats dans le LG 
</p>
<p>En fonction des r&#233;sultats produits par D&#233;riF, il est au mieux possible de g&#233;n&#233;rer 
automatiquement les deux entr&#233;es au format LG (celles du lex&#232;me analys&#233; L et de sa base B) 
reli&#233;es morphologiquement par la r&#232;gle ayant produit le r&#233;sultat. Le niveau de sp&#233;cification de 
chaque entr&#233;e d&#233;pend des informations produites lors de la phase d&#8217;analyse morphologique. 
Dans l&#8217;exemple pris plus haut, il est ainsi possible de pr&#233;dire la distribution sous forme de 
r&#244;les de qualia des &#233;tapes de l'encha&#238;nement causal qui constituent l'&#233;v&#233;nement complexe 
d&#233;fini par le verbe DESSOULER (Figure 3a), &#224; savoir la succession des situations suivantes : (1) 
l&#8217;individu y est soul (&#233;tat initial, pr&#233;suppos&#233; dans le r&#244;le AGENTIF) ; (2) l&#8217;agent x dessoule 
l&#8217;individu y ou y dessoule (accomplissement, dans le r&#244;le AGENTIF) ; (3) y n&#8217;est plus soul 
(&#233;tat final, r&#244;le FORMEL). En ce qui concerne l&#8217;adjectif SOUL, en tant que base de 
DESSOULER, la seule information inf&#233;rable &#224; partir de la r&#232;gle de pr&#233;fixation en d&#233;- est qu&#8217;il 
s&#8217;agit d&#8217;une propri&#233;t&#233; identifi&#233;e d'un point de vue &#233;v&#233;nementiel sous la forme d&#8217;un &#233;tat 
transitoire e (ou stage level predicate, cf. (Carlson 1977)) affectant un individu y (cf. Figure 
3b) (dans l'ontologie du r&#244;le FORMEL, e caract&#233;rise SOUL comme sous-type du type '&#233;tat'). 
La valeur des autres traits (Structure Argumentale, Structure Ev&#233;nementielle) constituant une 
entr&#233;e lexicale dans le LG est ensuite instanci&#233;e &#224; partir du contenu de la Structure de qualia. 
</p>
<p>ROLE (V) dessouler 
</p>
<p>FORMEL not (soul' (e1 :&#233;tat_trans,y :individu)) 
</p>
<p>AGENTIF soul'(e0 :etat_trans,y) ET  dessouler_acte'(e2 :accompl., x :agent, y)  
OU
</p>
<p>soul'(e0 :etat_trans,y) ET  
dessouler_acte' (e2 :accompl., y)     
</p>
<p>ROLE (A) soul 
</p>
<p>FORMEL soul'(e :&#233;tat_trans, 
</p>
<p>             y :patient) 
</p>
<p>Figure 3 : D&#233;composition des sens de DESSOULER (a) et de SOUL (b) sous forme de r&#244;les de 
qualia, &#224; partir de l&#8217;analyse par D&#233;riF 
</p>
<p>3.2 Acquisition par apprentissage sur corpus 
</p>
<p>En dehors des cas o&#249; les lex&#232;mes simples sont des bases d&#8217;autres lex&#232;mes construits, D&#233;riF ne 
fournit aucune information &#224; traduire dans le format LG. Dans ces cas de silence, la 
m&#233;thodologie pr&#233;sent&#233;e s&#8217;appuie sur un apprentissage de corpus, et plus pr&#233;cis&#233;ment sur un 
</p>
<p>237</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fiammetta NAMER, Pierrette BOUILLON, Evelyne JACQUEY
</p>
<p>corpus issu des donn&#233;es lexicographiques du TLFi. Une exp&#233;rience pr&#233;liminaire, effectu&#233;e sur 
la version XML cat&#233;goris&#233;e du TLFi, montre par exemple que les d&#233;finitions de ce 
dictionnaire sont suffisamment r&#233;guli&#232;res pour permettre de d&#233;tecter les substantifs ayant une 
fonction prototypique, c&#8217;est-&#224;-dire une facette t&#233;lique dans leur contenu s&#233;mantique. En 
recherchant dans le corpus des d&#233;finitions des expressions comme &#171; servir, permettre, destin&#233;  
&#224;/au/aux/de &#187;, on rep&#232;re pr&#232;s de 14% de substantifs ayant un emploi t&#233;lique (4279 des 30544 
substantifs du TLFi). Ceci constitue donc un premier r&#233;sultat non n&#233;gligeable. De plus, les 
expressions verbales ci-dessus s&#8217;accompagnent de substantifs (&#171; appareil, organe, 
instrument &#187;) qui permettent d&#8217;identifier des r&#244;les formels (&#171; balai = UstensileFORMEL de 
m&#233;nage servant au nettoyageTELIQUE &#187;).  Ces substantifs servent &#224; leur tour &#224; la recherche de 
nouvelles expressions verbales, permettant ainsi de d&#233;tecter de nouveaux pr&#233;dicats t&#233;liques, et 
ainsi de suite&#8230; Cette premi&#232;re exp&#233;rience montre donc l'exploitabilit&#233; du corpus des 
d&#233;finitions cat&#233;goris&#233;es du TLFi dans le cadre de la construction automatique d&#8217;un lexique du 
fran&#231;ais.
</p>
<p>3.3 Croisement des deux approches 
</p>
<p>Le croisement des deux m&#233;thodes d&#8217;acquisition pr&#233;sent&#233;es supra peut servir &#224; pr&#233;ciser 
certaines informations laiss&#233;es sous-sp&#233;cifi&#233;es par l&#8217;application des RCL. La sous-
sp&#233;cification a deux origines. Soit la morphologie ne dispose pas d'indices suffisants pour 
pr&#233;ciser un sens (cf section 3.3.1), soit le lex&#232;me construit est intrins&#232;quement ambigu (cf. 
section 3.3.2). Dans les deux cas, la contribution de l'approche par corpus doit servir &#224; 
apporter l'information manquante. 
</p>
<p>3.3.1 Morphologie et sous-sp&#233;cification : la pr&#233;fixation en d&#233;- 
</p>
<p>Consid&#233;rons le cas des verbes en d&#233;- sur base nominale. Deux types de sens sont possibles 
pour ces verbes. En effet, soit le nom de base d&#233;crit la localisation initiale de ce que d&#233;note 
l&#8217;objet direct du verbe ; c&#8217;est ce que l&#8217;on observe avec D&#201;TERRER : &#171; faire sortir qqch de 
terre &#187;. Soit, au contraire, le nom de base d&#233;crit l&#8217;entit&#233; qui subit le changement de lieu ; c&#8217;est 
ce que l&#8217;on observe avec D&#201;SOSSER : &#171; faire sortir les os de qqch/quelquepart &#187;. L&#8217;analyse 
automatique par D&#233;riF est incapable de distinguer les deux cas de figure, qui se diff&#233;rencient 
sur la base de caract&#233;ristiques des noms de base qui sont d&#8217;ordre extralinguistique. Par 
cons&#233;quent, D&#233;riF fournit syst&#233;matiquement deux d&#233;finitions &#224; chaque analyse de ce type de 
verbe. Ainsi, pour D&#201;TERRER, on obtient : 
</p>
<p>1  d&#233;terrer/VERBE ==&gt; terre,NOM/d&#233;:prefixe 
2  &quot;Faire sortir qqc de terre || Faire sortir la terre de qqc&quot; 
3  d&#233;terrer/VERBE: (dynamique,trans. ,[cause,theme], causatif) 
</p>
<p>Figure 4 : Analyse de DETERRER par D&#233;riF 
</p>
<p>Cette analyse illustre un certain nombre de faits. Tout d'abord, aucune contrainte n'est 
g&#233;n&#233;ralisable pour la base.  En effet, le nom s&#233;lectionn&#233; par la r&#232;gle en d&#233;- est soit concret 
(TERRE : DETERRER), soit abstrait (COURAGE :  D&#201;COURAGER). Par contre, la r&#232;gle impose que 
le verbe r&#233;sultant (D&#201;TERRER, DECOURAGER) soit transitif et d&#233;crive un accomplissement  
(plus pr&#233;cis&#233;ment, un changement de localisation). En r&#233;sum&#233;, les contraintes li&#233;es &#224; la 
formation de verbes d&#233;nominaux en d&#233;- sont les suivantes : (1) le verbe est transitif, causatif, 
faisant intervenir une cause x et un th&#232;me y; (2) le proc&#232;s d&#233;signe l&#8217;acte du causateur sur le 
th&#232;me (&#171; x cause qqc &#224; y &#187;); (3) l&#8217;&#233;tat final affecte soit y (c&#8217;est le cas avec D&#201;TERRER), soit 
</p>
<p>238</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un lexique g&#233;n&#233;ratif de r&#233;f&#233;rence pour le fran&#231;ais 
</p>
<p>l&#8217;entit&#233; d&#233;crite par le nom de base (e.g. avec D&#201;CLOUER). Avec D&#201;TERRER c&#8217;est y qui est une 
entit&#233; d&#233;localis&#233;e par rapport &#224; son site3 initial : TERRE   (Max d&#233;terre le coffre). Par contre, 
avec D&#201;CLOUER (ex : Max d&#233;cloue le coffre), y joue le r&#244;le du site initial alors que CLOU  est la 
cible (voir note pr&#233;c&#233;dente) d&#233;localis&#233;e par rapport au site. La RCL est donc incapable de 
d&#233;terminer qui, du th&#232;me ou de la base d&#8217;un verbe quelconque pr&#233;fix&#233; par d&#233;-, joue le r&#244;le de 
cible (et de site), et donc, en cons&#233;quence,  de d&#233;finir le verbe construit de fa&#231;on univoque par 
rapport &#224; sa base. Voil&#224; pourquoi deux d&#233;finitions sont propos&#233;es pour D&#201;TERRER, comme 
l'indique la ligne 2 de la Figure 4. Face &#224; ce type d&#8217;ambigu&#239;t&#233; que des r&#232;gles linguistiques ne 
peuvent pas r&#233;soudre, deux cas de figures peuvent se pr&#233;senter : soit un seul des deux sens est 
attest&#233;, soit les deux emplois existent, mais avec des fr&#233;quences diff&#233;rentes. Dans les deux 
cas, l&#8217;analyse de corpus et de d&#233;finitions du TLFi permet, selon le cas, soit de lever 
l&#8217;ambiguit&#233;, soit de pond&#233;rer chacun des emplois. Avec &#8216;D&#201;TERRER X&#8217;, par exemple, 
l&#8217;interpr&#233;tation &#171; faire sortir la terre de X &#187; est improbable : elle est absente des d&#233;finitions du 
TLFi et des 100 premiers r&#233;sultats renvoy&#233;s par Google.  
</p>
<p>3.3.2 Morphologie et exceptions : la suffixation en -oir 
</p>
<p>Alors que l'exemple pr&#233;c&#233;dent montre comment les d&#233;finitions dictionnairiques et les 
connaissances textuelles pr&#233;cisent l'information lexicale que la morphologie ne sait 
qu'esquisser, voyons maintenant un cas inverse : l'analyse de corpus au service de la d&#233;tection 
des exceptions &#224; une RCL, &#224; savoir la formation de noms d&#233;verbaux en &#8211;oir. A l'exception de 
quelques noms d&#233;signant le patient prototypique du verbe de base (TIROIR), ou son agent 
(CONSOLOIR 4), la RCL &#8211;oir construit des noms faisant r&#233;f&#233;rence &#224; des lieux ou des 
instruments 5. La diff&#233;rence entre ces deux concepts est parfois t&#233;nue, d&#232;s lors qu'un objet 
poss&#232;de la taille requise pour occuper les deux fonctions : c'est le cas de la majeure partie des 
noms d&#233;verbaux en &#8211;oir (ABREUVOIR, BALAN&#199;OIRE, &#201;GOUTTOIR d&#233;signent chacun l'objet qui 
sert &#224; la fois d'instrument aidant au d&#233;roulement du proc&#232;s d&#233;crit par le verbe,  et de lieu o&#249; ce 
proc&#232;s se d&#233;roule). D'autres noms en &#8211;oir ont la particularit&#233; d'&#234;tre polyr&#233;f&#233;rentiels : ils 
d&#233;notent deux objets distincts, comme HACHOIR qui d&#233;signe soit un couteau soit une 
planchette, ou SOULOIR, qui en argot fait r&#233;f&#233;rence &#224; un verre ou &#224; un d&#233;bit de boisson. Enfin, 
certains noms identifient clairement un lieu (DORTOIR, FUMOIR) ou un instrument (RATISSOIR,
RASOIR). Comme le montre la Figure 5, l'analyse par D&#233;riF des noms d&#233;verbaux en &#8211;oir
refl&#232;te la polys&#233;mie qui caract&#233;rise la plupart de ces noms. Presque rien, par contre, n'est 
pr&#233;dictible pour le verbe de base : il peut &#234;tre transitif (ABREUVOIR), ergatif (DESSOULOIR),
inergatif (TROTTOIR), inaccusatif (MOUROIR). En bref, &#224; quelques exceptions pr&#232;s (on rel&#232;ve 
CR&#202;CHOIR et VIVOTOIR sur la Toile, dont le verbe de base est analysable comme statif), la 
seule propri&#233;t&#233; verbale identifiable est 'dynamique'.  
</p>
<p>abreuvoir/NOM ==&gt; abreuver,VERBE/oir:suffixe 
</p>
<p>3 Les termes de cible et site sont emprunt&#233;s &#224; (Vandeloise 1986). D'autres linguistes du courant cognitiviste 
utilisent les termes de, respectivement, trajector et landmark (Langacker 1987) ou figure et ground (Talmy 
1983). 
</p>
<p>4 &quot;Elle est mon refuge, mon consoloir&quot;, (Yahoo). 
</p>
<p>5 Entre autres d&#233;finitions des r&#244;les th&#233;matiques, celle de (Fillmore 1968) dit qu'un instrument est &quot;la force ou 
objet inanim&#233; impliqu&#233; dans et &#224; l'origine de l'&#233;v&#233;nement&quot; et un lieu d&#233;signe &quot;la localisation ou l'orientation 
spatiale de l'&#233;v&#233;nement&quot;  
</p>
<p>239</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fiammetta NAMER, Pierrette BOUILLON, Evelyne JACQUEY
</p>
<p>&quot;Instrument de abreuver || Lieu de abreuver&quot; 
abreuver/VERBE: (dynamique,-,-,-) 
</p>
<p>Figure 5 : Analyse de ABREUVOIR par D&#233;riF 
</p>
<p>La repr&#233;sentation dans le LG des propri&#233;t&#233;s de ABREUVOIR pr&#233;dites par la RCL &#8211;oir exprime 
donc les faits suivants: (1) le nom d&#233;signe une entit&#233;, qui poss&#232;de un type point&#233; 
(instrument&#8226;lieu), m&#233;canisme du LG pour exprimer les diff&#233;rentes facettes des lex&#232;mes 
polys&#233;miques ; (2) il est l'un des participants du pr&#233;dicat (dynamique) potentiel d&#233;crit par le 
verbe de base et qui d&#233;finit le r&#244;le TELIQUE (c'est &#224; dire la fonction pr&#233;vue de l'entit&#233; d&#233;crite 
par le nom). Tout nom construit en &#8211;oir est cod&#233; suivant ces indications, qui r&#233;v&#232;lent 
l'ambigu&#239;t&#233; suppos&#233;e par d&#233;faut de ce type de noms. Cette hypoth&#232;se doit alors &#234;tre v&#233;rifi&#233;e 
dans les corpus : le nom appara&#238;t-il derri&#232;re la pr&#233;position &quot;avec&quot; ? dans un compl&#233;ment 
locatif ? En fonction de la r&#233;ponse, soit la polys&#233;mie est confirm&#233;e, soit le codage est revu 
(instrument ou lieu seul) en fonction de l&#8217;&#233;chec &#224; l&#8217;un ou l&#8217;autre des tests. 
</p>
<p>4 Evaluation 
Nous sommes d&#232;s &#224; pr&#233;sent en mesure de pr&#233;voir quantitativement et qualitativement une 
partie des r&#233;sultats qui seront produits selon cette approche, &#224; savoir les entr&#233;es lexicales 
g&#233;n&#233;r&#233;es &#224; partir des analyses de D&#233;riF. Actuellement, au moins 35,5%  (i.e. 35263/99445) 
des lex&#232;mes du TLFi sont analys&#233;s comme construits par D&#233;riF, sous la forme de 45478 
&#233;tapes constructionnelles6. Ce r&#233;sultat correspond &#224; l'activation d'environ 85 RCLs. Le 
pourcentage de 35,5% a deux motifs principaux : (1) toutes les RCL ne sont pas encore 
impl&#233;ment&#233;es, (2) une grande partie des entr&#233;es lexicales du TLFi ne sont pas 
morphologiquement construites. La Figure 6 montre les r&#232;gles les plus fr&#233;quemment 
appliqu&#233;es.
</p>
<p>Type d&#8217;op&#233;ration de 
d&#233;rivation morphologique 
</p>
<p>Cat&#233;gorie du Construit : R&#232;gle (Cat&#233;gorie de la Base) 
</p>
<p>Suffixation A :el, ique, if, al,eux, aire, ien, iste (N), able(V),  
N : eur (V), ie, it&#233; (A),
V :ifier, iser(N,A), re (V) 
</p>
<p>Pr&#233;fixation V :en, a (A,N), &#233;, d&#233; (A,N,V), pr&#233; (V) 
A :in, hyper,sub,non (A), sur,anti,sub,sous, mono, poly, auto (N) 
</p>
<p>Conversion N -&gt;V, A-&gt;V, V-&gt;N, A -&gt; N 
Figure 6 : R&#232;gles s&#8217;appliquant &#224; plus de 80 lex&#232;mes du TLFi
</p>
<p>Parmi celles-ci, les r&#232;gles en gras sont d&#8217;ores et d&#233;j&#224; associ&#233;es &#224; des contraintes pour 
l&#8217;identification de leur entr&#233;e ou de leur sortie prototypique, &#224; l&#8217;image de ce qui est d&#233;j&#224; 
illustr&#233; par les Figures 2, 4, 5 (cf. supra)  ainsi que la Figure 7, qui reprend ci-dessous les 
conditions de formation des adjectifs d&#233;verbaux en &#8211;able, &#233;bauch&#233;es dans la section 1, cf. 
exemple (1). 
</p>
<p>lavable/ADJ ==&gt; laver,VERBE/able:suffixe 
  &quot;Que l&#8217;on peut laver || PREP que l&#8217;on peut laver&quot; 
</p>
<p>6 Soit 39028 op&#233;rations de d&#233;rivation, et 6450 op&#233;rations  de composition dite n&#233;oclassique (cf infra).
</p>
<p>240</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un lexique g&#233;n&#233;ratif de r&#233;f&#233;rence pour le fran&#231;ais 
</p>
<p>  laver/VERBE: (dynamique,-,[-,theme], -) 
  lavable/ADJ : (pr&#233;dicatif, latent,-) 
</p>
<p>Figure 7 : Analyse de LAVABLE par D&#233;riF 
</p>
<p>La formation d&#8217;adjectifs d&#233;verbaux en &#8211;able illustre d&#8217;ailleurs un autre cas de collaboration 
n&#233;cessaire entre approche morphologique et recherche en corpus. En effet, la contrainte par 
d&#233;faut stipule que le nom recteur de l&#8217;adjectif s&#8217;identifie avec le patient du verbe de base de 
celui-ci (laver un pull / un pull lavable). Cependant, (Hathout et al. 2003) ont montr&#233; que 
selon l&#8217;adjectif (et donc son verbe de base) n&#8217;importe quel participant du pr&#233;dicat pouvait 
occuper cette fonction : &#171; un poisson, une saison, un &#233;tang p&#234;chable &#187;. Ce n&#8217;est donc qu&#8217;en 
retrouvant en corpus la construction verbale (&#171; p&#234;cher un poisson, dans un &#233;tang, pendant
une saison &#187;) que l&#8217;on pourra affiner l&#8217;entr&#233;e lexicale de l&#8217;adjectif et du verbe reli&#233;s par la 
RCLable. Pour finir, rappelons que l&#8217;avantage de D&#233;riF est qu&#8217;il s&#8217;applique &#224; n&#8217;importe quel 
lexique, qui peut ainsi servir d&#8217;entr&#233;e &#224; la m&#233;thodologie et accro&#238;tre la taille de la ressource 
LG. Par exemple, la substitution d&#8217;un lexique sp&#233;cialis&#233; biom&#233;dical &#224; la liste des 
nomenclatures du TLFi fait varier sensiblement les chiffres pr&#233;sent&#233;s dans la Figure 6 : ici, 
59% des lex&#232;mes (soit 17297 des 29273 entr&#233;es) sont analys&#233;s comme construits, 
essentiellement par composition n&#233;oclassique7 (13237 des 21757 op&#233;rations morphologiques 
analys&#233;es). Une &#233;valuation quantitative r&#233;cente de D&#233;riF par rapport &#224; un &quot;Gold Standard&quot; 
((Namer et al. 2007)) a montr&#233; un score d'au moins 77,6% de bonnes analyses de la part du 
programme. Une autre exp&#233;rience ((Namer 2007b),(Namer et al. 2007),(Del&#233;ger et al. 2007)) 
a, elle, prouv&#233; que, appliqu&#233; aux lexiques sp&#233;cialis&#233;s du domaine biom&#233;dical, les RCL de 
D&#233;riF sont facilement transposables dans d'autres langues; en particulier, des r&#232;gles d'analyses 
des compos&#233;s n&#233;oclassiques ont &#233;t&#233; traduites en anglais avec succ&#232;s ((Del&#233;ger et al. 2007)). 
</p>
<p>5 Conclusion 
Dans cet article, nous avons pr&#233;sent&#233; une m&#233;thodologie pour d&#233;river un LG. Son originalit&#233; 
repose surtout sur l&#8217;exploitation des propri&#233;t&#233;s morphologiques du lexique. Sur le plan 
pratique, cette approche nous permet de garantir la coh&#233;rence des informations d&#233;riv&#233;es ; sur 
le plan th&#233;orique, elle montre comment la morphologie peut collaborer avec d&#8217;autres 
connaissances (dictionnairiques et textuelles) pour d&#233;river des repr&#233;sentations profondes du 
sens des mots. Nous ne connaissons pas d&#8217;autre tentative du m&#234;me type pour exploiter 
ensemble l&#8217;apport de ces diff&#233;rentes disciplines. Les r&#233;sultats attendus comprennent le lexique 
LG et une s&#233;rie d&#8217;outils pour extraire dynamiquement de nouvelles entr&#233;es, en particulier 
D&#233;rif, des mod&#232;les pour convertir la sortie de D&#233;rif en des mod&#232;les LG et des r&#232;gles 
d&#8217;extraction pour le corpus/TLFi. 
</p>
<p>R&#233;f&#233;rences  
AMIOT, D. (&#224; para&#238;tre). La cat&#233;gorie de la base dans la pr&#233;fixation en d&#233;-. La raison morphologique. Hommage &#224; 
la m&#233;moire de Danielle Corbin. B. Fradin. Amsterdam/Philadelphia, John Benjamins. 
ARONOFF, M. (1980). Contextuals. Language 56(4): 744-758. 
ARONOFF, M. (1994). Morphology by Itself. Cambridge, MIT Press. 
</p>
<p>7 Un nom ou adjectif compos&#233; n&#233;oclassique est form&#233; par une r&#232;gle de composition, et diff&#232;re &#224; plusieurs &#233;gards 
des compos&#233;s dits 'standard' ou 'ordinaires': leur sens, leur structure, les composants impliqu&#233;s, les domaines 
textuels et/ou le registre de langue concern&#233;s, etc. cf. (Namer 2007a). 
</p>
<p>241</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fiammetta NAMER, Pierrette BOUILLON, Evelyne JACQUEY
</p>
<p>BOUILLON, P., C. FABRE, P. S&#201;BILLOT and L. JACQMIN (2000). Apprentissage de ressources lexicales pour 
l'extension de requ&#234;tes. TAL 41(2): 367-393. 
BUSA, F., N. CALZOLARI and A. LENCI (2001). Generative Lexicon and the Simple model, developing Semantic 
Resources for NLP. the Language of Word Meaning. P. Bouillon and F. Busa. Cambridge, CUP: 333-349. 
CALZOLARI, N., F. BERTAGNA, A. LENCI and M. MONACHINI (2003). New perspectives for lexical web resource 
in the Semantic Web Scenario. Generative Approaches to the Lexicon, Geneva. 
CARLSON, G. (1977). Reference to Kinds in English, University of California. Ph.D. Dissertation.
CLAVEAU, V., P. S&#201;BILLOT, P. BOUILLON and C. FABRE (2001). Acqu&#233;rir des &#233;l&#233;ments du lexique g&#233;n&#233;ratif : 
quels r&#233;sultats et &#224; quels co&#251;ts ? TAL 42(3): 729-753. 
CLAVEAU, V., P. S&#201;BILLOT, C. FABRE and P. BOUILLON (2003). Learning Semantic Lexicons from a Part-of-
Speech and Semantically Tagged Corpus Using Inductive Logic Programming. Journal of Machine Learning 
Research 4: 493-525. 
COPESTAKE, A., S. ANTONIO, T. BRISCOE and V. DE PAIVA (1993). The ACQUILEX LKB : an introduction. 
Inheritance, defaults and the lexicon. T. Briscoe, A. Copestakeet al. Cambridge, CUP: 148-163. 
DEL&#201;GER, L., F. NAMER and P. ZWEIGENBAUM (2007). Analyse morphos&#233;mantique des compos&#233;s savants : 
transposition du fran&#231;ais &#224; l'anglais. TALN, Toulouse. 
FILLMORE, C. (1968). The case for case. Universals in Linguistic Theory. E. Bach and R. Harms. New-York, 
Holt, Rinehart, and Winston: 1-88. 
FRADIN, B. (2003). Nouvelles approches en morphologie. Paris, Presses Universitaires de France. 
HATHOUT, N., M. PL&#201;NAT and L. TANGUY (2003). Enqu&#234;te sur les d&#233;riv&#233;s en -able. Cahiers de Grammaire. N. 
Hathout, M. Roch&#233;et al. Toulouse, ERSS. 28: 49-91. 
JACQUEY, E. and F. NAMER (&#224; para&#238;tre). Morphos&#233;mantique et mod&#233;lisation : le cas des verbes d&#233;nominaux 
pr&#233;fix&#233;s par &#233;-. Actes du Colloque &quot;Le sens en linguistique&quot; (25-27 mai 2003), Montr&#233;al. 
LANGACKER, R. (1987). Foundations of Cognitive Grammar. Standford, Standford University Press. 
NAMER, F. (2002). Acquisition automatique de sens &#224; partir d'op&#233;rations morphologiques en fran&#231;ais : &#233;tudes de 
cas. Actes de Traitement Automatique du Langage Naturel (TALN) 2002, Nancy, France, ATALA-ATILF. 
NAMER, F. (2003). Automatiser l'analyse morpho-s&#233;mantique non affixale : le syst&#232;me D&#233;riF Cahiers de 
Grammaire. N. Hathout, M. Roch&#233;et al. Toulouse, ERSS. 28: 31-48. 
NAMER, F. (2005). La Morphologie Constructionnelle du Fran&#231;ais et les Propri&#233;t&#233;s S&#233;mantiques du Lexique - 
M&#233;moire pr&#233;sent&#233; dans le cadre de l'habilitation &#224; diriger des recherches. UFR Sciences du Langage. Nancy, 
Universit&#233; de Nancy2. 
NAMER, F. (2007a). Composition n&#233;oclassique : est-on dans l' &quot;h&#233;t&#233;romorphos&#233;mie&quot; ? Morphologie &#224; Toulouse - 
Actes du colloque international de Morphologie 4&#232;mes D&#233;cembrettes. N. Hathout and F. Montermini. M&#252;nchen, 
Lincom Europa. (LSTL 37): 185-206. 
NAMER, F. (2007b). Morphos&#233;mantique pour l'appariement de termes dans le vocabulaire m&#233;dical : approche 
multilingue. T.A.L. 46(2): 157-181. 
NAMER, F. and R. BAUD (2007). Defining and relating biomedical terms : towards a cross-language 
morphosemantics-based system. International Journal of Medical Informatics 76: 226-233. 
NAMER, F. and E. JACQUEY (2003). Lexical Semantics and derivational morphology: the case of the popular &#233;-
prefixation in French GL 2003 : 2nd International Workshop on Generative Approaches to the Lexicon (May, 
15-17 2003), Geneva. 
NAMER, F. and E. JACQUEY (&#224; para&#238;tre). Word Formation Rules and the Generative Lexicon: Representing noun-
to-verb versus verb-to-noun Conversion. Generative Lexicon Book. P. Bouillon, H. Isaharaet al. Dordrecht, 
Kluwer. 
PUSTEJOVSKY, J. (1995). The Generative Lexicon. Cambridge, MA, MIT Press. 
PUSTEJOVSKY, J. (2001). Type Construction and the Logic of Concepts. The Syntax of Word Meanings. P. 
Bouillon and F. Busa. Cambridge, Cambridge University Press: 91-123. 
S&#201;BILLOT, P. (2002). Apprentissage sur corpus de relations lexicales s&#233;mantiques - La linguistique et 
l'apprentissage au service d'applications du traitement automatique des langues. M&#233;moire pr&#233;sent&#233; dans le 
cadre de l'habilitation &#224; diriger des recherches. Rennes, Universit&#233; de Rennes 1. 
TALMY, L. (1983). How language structures space. Spatial orientation, Theory, Research, and Applications. H. 
Pick and L. Acredolo. New York, Plenum: 225-282. 
VANDELOISE, C. (1986). L'espace en fran&#231;ais: s&#233;mantique des pr&#233;positions spatiales Paris, Les &#233;ditions du 
Seuil. 
VOSSEM, P. (2001). Condensed Meaning in EuroWordnet. The language of Word Meaning. P. Bouillon and F. 
Busa. Cambridge, CUP: 363-383. 
</p>
<p>242</p>

</div></div>
</body></html>