<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Les Lexiques-Miroirs. Du dictionnaire bilingue au graphe multilingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Les Lexiques-Miroirs.  
Du dictionnaire bilingue au graphe multilingue 
</p>
<p>S&#233;bastien HATON, Jean-Marie PIERREL
Laboratoire ATILF Nancy Universit&#233; &#8211; CNRS 
</p>
<p>44 avenue de la Lib&#233;ration, BP 30687, 54063 Nancy CEDEX  
{sebastien.haton,jean-marie.pierrel}@atilf.fr
</p>
<p>R&#233;sum&#233;. On observe dans les dictionnaires bilingues une forte asym&#233;trie entre les deux 
parties d&#8217;un m&#234;me dictionnaire et l&#8217;existence de traductions et d&#8217;informations &#171; cach&#233;es &#187;, i.e. 
pas directement visibles &#224; l&#8217;entr&#233;e du mot &#224; traduire. Nous proposons une m&#233;thodologie de 
r&#233;cup&#233;ration des donn&#233;es cach&#233;es ainsi que la &#171; sym&#233;trisation &#187; du dictionnaire gr&#226;ce &#224; un 
traitement automatique. L&#8217;&#233;tude d&#8217;un certain nombre de verbes et de leurs traductions en 
plusieurs langues a conduit &#224; l&#8217;int&#233;gration de toutes les donn&#233;es, visibles ou cach&#233;es, au sein 
d&#8217;une base de donn&#233;es unique et multilingue. L&#8217;exploitation de la base de donn&#233;es a &#233;t&#233; 
rendue possible par l&#8217;&#233;criture d&#8217;un algorithme de cr&#233;ation de graphe synonymique qui lie dans 
un m&#234;me espace les mots de langues diff&#233;rentes. Le programme qui en d&#233;coule permettra de 
g&#233;n&#233;rer des dictionnaires param&#233;trables directement &#224; partir du graphe. 
</p>
<p>Abstract. Lexical asymmetry and hidden data, i.e. not directly visible into one lexical 
entry, are phenomena peculiar to most of the bilingual dictionaries. Our purpose is to 
establish a methodology to highlight both phenomena by extracting hidden data from the 
dictionary and by re-establishing symmetry between its two parts. So we studied a large 
number of verbs and integrated them into a unique multilingual database. At last, our database 
is turned into a &#8220;multilexical&#8221; graph thanks to an algorithm, which is binding together words 
from different languages into the same semantic space. This will allow us to generate 
automatically dictionaries straight from the graph. 
</p>
<p>Mots-cl&#233;s : dictionnaires bilingues, traduction automatique, graphe multilingue, 
algorithme, polys&#233;mie verbale, dissym&#233;trie lexicographique. 
</p>
<p>Keywords: bilingual dictionaries, machine translation, multilingual graph, algorithm, 
verbal polysemy, lexicographical asymmetry. 
</p>
<p>113</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>S&#233;bastien HATON, Jean-Marie PIERREL
</p>
<p>1 Introduction
A partir de l&#8217;analyse de la polys&#233;mie des verbes dans un cadre lexicographique et sur la base 
des lexiques miroirs dont nous expliquerons pr&#233;cis&#233;ment le principe, nous avons cherch&#233; &#224; 
&#233;tablir une m&#233;thodologie de r&#233;cup&#233;ration de l&#8217;int&#233;gralit&#233; des donn&#233;es de dictionnaires 
bilingues pour les inclure dans des mod&#232;les &#224; des fins d&#8217;exploitation informatique. Nous 
avons travaill&#233; sur trois dictionnaires bilingues, fran&#231;ais-anglais, fran&#231;ais-espagnol et 
fran&#231;ais-italien et la cat&#233;gorie verbale a &#233;t&#233; le mat&#233;riau central de notre travail. Il est &#224; noter 
que toutes nos &#233;tudes incluent une composante sur le fran&#231;ais et sont destin&#233;es &#224; 
l&#8217;informatisation, conform&#233;ment &#224; la politique scientifique de l&#8217;ATILF qui est un laboratoire 
d&#8217;analyse et de traitement informatique de la langue fran&#231;aise. 
</p>
<p>Pour mener &#224; bien cet objectif assez vaste, nous avons proc&#233;d&#233; en trois &#233;tapes que nous 
d&#233;crivons dans cet article. Tout d&#8217;abord, nous discuterons de la polys&#233;mie dans un cadre 
lexicographique et nous essaierons de montrer quelles sont les ressources r&#233;elles des 
dictionnaires bilingues ainsi que leurs principales lacunes, pour la plupart in&#233;vitables. Dans 
un deuxi&#232;me temps, nous pr&#233;senterons la m&#233;thodologie que nous avons d&#233;velopp&#233;e pour 
essayer de pallier ces lacunes et pour mettre en valeur les informations cach&#233;es ou indirectes 
que ces ouvrages contiennent. Et enfin, nous pr&#233;senterons les mod&#232;les que nous avons con&#231;us 
&#224; partir de nos pr&#233;c&#233;dentes analyses ainsi que l&#8217;algorithme de programmation qui permet de 
transformer ces mod&#232;les en graphes lexicaux exploitables informatiquement. 
</p>
<p>2 Analyse critique d&#8217;une entr&#233;e d&#8217;un dictionnaire bilingue 
fran&#231;ais-anglais
</p>
<p>Le premier travail que nous avons effectu&#233; a &#233;t&#233; de faire une analyse critique et descriptive 
des dictionnaires bilingues, de leur contenu, de leurs structures et surtout de ce qu&#8217;ils rec&#232;lent 
r&#233;ellement en termes de liens et d&#8217;informations cach&#233;s. &#192; titre d&#8217;exemple, dans l&#8217;extrait 
suivant de l&#8217;entr&#233;e to leave tir&#233; du Robert &amp; Collins fran&#231;ais-anglais derni&#232;re &#233;dition, on peut 
relever une richesse importante en termes d&#8217;informations diff&#233;rents (28 types que nous avons 
relev&#233;s et d&#233;crits par ailleurs dans (Haton 2006)) : 
</p>
<p>leave /li:v/ (vb : pr&#234;t, ptp left)
VT a (= go away from) [+ town] quitter, partir de ; (permanently) quitter ; [+ room, building] 
sortir de, quitter ; [+ person, job, one&#8217;s hus- 
band, wife] quitter ; [+ one&#8217;s children] abandonner &#391; he left Paris in 2001 il a quitt&#233; Paris en 
2001 &#391; we left Paris at 6 o&#8217;clock nous sommes partis de Paris or nous avons quitt&#233; Paris &#224; 6 
heures&#8230;
(&#8230;)
e (Math) three from six ~s three six moins trois &#233;galent trois&#8230; 
f (in will) [+ money] laisser {to &#224;} ; [+ object, property] laisser, l&#233;guer {to &#224;}&#8230; 
VI (= go away) [person, train, ship etc] partir, s&#8217;en aller ; (= resign) partir, d&#233;missionner &#391; to
~ for Paris [person, train] partir pour Paris ; [ship] partir or appareiller pour Paris&#8230; 
&#377; leave off VI (*= stop) s&#8217;arr&#234;ter &#391; where did we ~ off? (in work, reading) o&#249; nous 
sommes-nous arr&#234;t&#233;s? &#391; ~ off ! arr&#234;te !, &#231;a suffit ! * 
VT SEP a (*= stop) arr&#234;ter (doing sth de faire qch)&#8230; 
&#377;leave out VT SEP a (= omit) (accidentally) oublier, omettre ; (deliberately) exclure ; [+ 
line in text] (also Mus) [+ note] sauter&#8230; 
</p>
<p>114</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les Lexiques-Miroirs. Du dictionnaire bilingue au graphe multilingue 
</p>
<p>La lecture d&#8217;un tel dictionnaire ressemble presque &#224; un exercice de sp&#233;cialistes d&#8217;autant qu&#8217;il 
faut se familiariser avec les typographies diff&#233;rentes choisies pour caract&#233;riser chacun des 
types. Ce qui nous int&#233;resse prioritairement dans cet extrait et dans le reste du dictionnaire 
est donc : quelles sont les informations n&#233;cessaires pour caract&#233;riser un lien de traduction et 
comment les mod&#233;liser ? 
</p>
<p>L&#8217;autre grand int&#233;r&#234;t de cet extrait est qu&#8217;il nous apprend beaucoup de choses en plus de nous 
donner les traductions de to leave. Si nous observons &#224; nouveau le d&#233;but de l&#8217;extrait, apr&#232;s les 
informations phon&#233;tiques et grammaticales, 
</p>
<p>leave /li:v/ (vb : pr&#234;t, ptp left)
VT a (= go away from) [+ town] quitter, partir de ; 
</p>
<p>on observe que quitter et partir de sont assimilables &#224; des synonymes l&#8217;un de l&#8217;autre 
lorsqu&#8217;ils traduisent to leave avec comme objet direct town. De m&#234;me to go away from est
pr&#233;sent&#233; comme un synonyme de to leave dans les m&#234;mes conditions d&#8217;emploi et par voie de 
cons&#233;quence comme une traduction potentielle de quitter et partir de et pouvant &#234;tre traduit 
par eux. Ainsi, cette simple relation de traduction cr&#233;e deux liens de synonymie et deux liens 
de traduction qui sont des informations que nous avons appel&#233;es &#171; cach&#233;es ou indirectes &#187; 
dans notre travail, et ce ne sont pas les seules. &#192; la lecture de ce fragment, il est permis de 
penser que la pr&#233;sence de ces donn&#233;es cach&#233;es est un ph&#233;nom&#232;ne g&#233;n&#233;ralis&#233; et qu&#8217;un simple 
dictionnaire bilingue contient &#233;galement, dans une certaine mesure, deux dictionnaires de 
synonymes monolingues. En tout &#233;tat de cause, il faut que ces liens apparaissent clairement 
dans notre mod&#233;lisation. 
</p>
<p>La richesse cach&#233;e des dictionnaires ne s&#8217;arr&#234;te pas l&#224; et nous allons maintenant exposer 
bri&#232;vement le principe des lexiques miroirs qui est une mani&#232;re de r&#233;concilier les deux parties 
d&#8217;un m&#234;me dictionnaire bilingue car leur confrontation montre dans les faits que ce sont 
vraiment deux dictionnaires tr&#232;s diff&#233;rents. 
</p>
<p>3 Principe des lexiques-miroirs et g&#233;n&#233;ralisation de la m&#233;thode 
Pour bien illustrer le fonctionnement des lexiques miroirs ou invers&#233;s (Haton 2003, 2006), 
nous utiliserons &#224; nouveau l&#8217;entr&#233;e du verbe to leave. Ce que nous appelons le lexique droit 
(le LD) de to leave est l&#8217;ensemble des traductions fran&#231;aises de to leave &#224; l&#8217;entr&#233;e de celui-ci 
dans la partie anglais-fran&#231;ais du dictionnaire et qui contient donc, entre autres, quitter et 
partir de. Maintenant, ce que nous appelons le lexique miroir ou invers&#233; (le LI) de to leave
correspond &#224; l&#8217;ensemble des verbes fran&#231;ais pour lesquels to leave est une des traductions 
potentielles dans la partie fran&#231;ais-anglais du dictionnaire. Nous nous attendions lors de la 
confrontation des lexiques droit et invers&#233; &#224; observer une certaine sym&#233;trie entre les deux. Or, 
nous avons constat&#233; que les cas de sym&#233;trie pour les traductions entre lex&#232;mes repr&#233;sentent 
nettement moins que 50 % du total. En d&#8217;autres termes, lorsqu&#8217;un verbe est propos&#233; comme 
traduction d&#8217;un autre dans une partie d&#8217;un dictionnaire bilingue, il y a moins d&#8217;une chance sur 
deux que la r&#233;ciproque soit vraie dans l&#8217;autre partie du dictionnaire. Pour effectuer cette 
comparaison, nous avons construit trois lexiques miroirs complets entre le fran&#231;ais et 
l&#8217;espagnol, le fran&#231;ais et l&#8217;anglais et le fran&#231;ais et l&#8217;italien, ce qui repr&#233;sente 9000 formes 
verbales du fran&#231;ais et leurs correspondants invers&#233;s dans les trois autres langues. Cette 
dissym&#233;trie est encore plus flagrante si l&#8217;on essaie de rattacher les justes acceptions du verbe 
&#233;tudi&#233; &#224; ses traductions. Nous prenons comme exemple le verbe traverser pour lequel nous 
</p>
<p>115</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>S&#233;bastien HATON, Jean-Marie PIERREL
</p>
<p>avons extrait du dictionnaire Le Petit Robert toutes les acceptions et nous les avons 
num&#233;rot&#233;es : 
</p>
<p>x1a- passer, p&#233;n&#233;trer de part en part, &#224; travers (un corps, un milieu interpos&#233;) / 1b- fig :
passer, p&#233;n&#233;trer de part en part, &#224; travers / 2- se frayer un passage &#224; travers (des
personnes rassembl&#233;es) / 3- parcourir d&#8217;une extr&#233;mit&#233;, d&#8217;un bord &#224; l&#8217;autre (un espace) / 
4a- couper, aller d&#8217;un bord &#224; l&#8217;autre (une voie de communication) / 4b- absolu : couper,
aller d&#8217;un bord &#224; l&#8217;autre / 4c- en parlant de choses mobiles : couper, aller d&#8217;un bord &#224; 
l&#8217;autre / 5- choses sans mouvement : &#234;tre, s&#8217;&#233;tendre au travers de / 6a- aller d&#8217;un bout &#224; 
l&#8217;autre de (un espace de temps) / 6b- d&#233;passer (un &#233;tat durable) / 7a- se pr&#233;senter &#224;
(l&#8217;esprit) / 7b- passer par (la t&#234;te) / 8- &#233;quit : mettre de travers / 9- vx : se mettre en 
travers de, s&#8217;opposer &#224; 
</p>
<p>Ensuite, nous avons fait le relev&#233; des verbes anglais qui entretiennent un lien de traduction 
avec traverser et nous avons associ&#233; &#224; chaque lien l&#8217;indice correspondant. La deuxi&#232;me 
colonne du tableau correspond au LD de traverser et il contient le relev&#233; des indices se 
rapportant aux acceptions de traverser si le verbe anglais de la premi&#232;re colonne est propos&#233; 
comme traduction de traverser. &#192; l&#8217;inverse, la troisi&#232;me colonne qui correspond au lexique-
miroir de traverser contient ces indices lorsque c&#8217;est traverser qui est la traduction du verbe 
anglais.
</p>
<p>Dico droit Indice T1 Indice T2 Sens proche Prolongement du sens 
</p>
<p>Amble through 2 d&#8217;un pas tranquille 
</p>
<p>Barge through 2 en bousculant 
be across 5
Beetle through 3-4a en vitesse 
</p>
<p>belt across 3-4a &#224; toutes jambes, &#224; toute 
blinde
</p>
<p>Come across = cross t2 = cross 
Come through 1a
Cross 3-4a-4c-5-7 3-4
cross over ind&#233;fini cross
cross under 3-4a par en-dessous 
Cut 5 cross,
</p>
<p>intersect
cut across 5
cut right across 5
</p>
<p>Ford 3-4a &#224; gu&#233;
get across ind&#233;fini Lit
get over ind&#233;fini cross
get through ind&#233;fini
go across ind&#233;fini cross
go right through 1a de part en part 
</p>
<p>116</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les Lexiques-Miroirs. Du dictionnaire bilingue au graphe multilingue 
</p>
<p>go through 1a-6b-6a 6b suffer, endure 
have across 5
lie over 5
live through 6a
make one&#8217;s way 
through
</p>
<p>2 passer &#224;
travers
</p>
<p>negotiate ind&#233;fini cross
occur to 7 7 come to mind
pass through 6b 1-2-3-4
run across 5 2-3-4-5 en courant (li) 
run right across 5
</p>
<p>Sail 3 en bateau
Shoot through 1a-1b une douleur / balle (sujet) 
</p>
<p>Stride across 3 2-3-4 &#224; grands pas 
Swim across 3 &#224; la nage 
travel down 6a
travel through 3
undergo 6b
Wade across 3-4a 4a &#224; gu&#233; 
walk across ind&#233;fini
zigzag through ind&#233;fini en zigzaguant 
</p>
<p>Figure 1 : Tableau de comparaison LD/LI pour la traduction du verbe traverser en anglais 
</p>
<p>On peut observer dans ces conditions d&#8217;analyse qu&#8217;il y a un seul cas de sym&#233;trie dans ce 
relev&#233;, celui de la correspondance entre traverser et to occur to, ce qui repr&#233;sente ici un cas 
sur quarante-deux. L&#8217;&#233;tude statistique globale n&#8217;a que peu d&#8217;int&#233;r&#234;t, nous retenons surtout 
cette tr&#232;s grande asym&#233;trie &#224; l&#8217;int&#233;rieur d&#8217;un m&#234;me dictionnaire. M&#234;me si nous admettons que 
la sym&#233;trie ne peut &#234;tre la r&#232;gle, il s&#8217;agit tout de m&#234;me d&#8217;un ph&#233;nom&#232;ne d&#8217;une ampleur tr&#232;s 
inattendue et il faudra en rendre compte dans les mod&#232;les. 
</p>
<p>Ces deux constats ont eu deux cons&#233;quences directes sur notre recherche, l&#8217;une entra&#238;nant 
l&#8217;autre : tout d&#8217;abord, la multiplicit&#233; des liens r&#233;ellement pr&#233;sents dans le dictionnaire ainsi 
que la difficult&#233; de d&#233;crire l&#8217;asym&#233;trie au cas par cas par les acceptions font qu&#8217;il est 
quasiment impossible de continuer &#224; avoir une approche s&#233;masiologique du probl&#232;me, c&#8217;est-
&#224;-dire de continuer &#224; travailler &#224; partir des lex&#232;mes polys&#233;miques et de leurs d&#233;groupements 
en acceptions. Il a donc fallu rechercher une d&#233;marche plus onomasiologique, c&#8217;est-&#224;-dire qui 
traite d&#8217;abord de la signification pour remonter vers le mot. Ensuite, nous nous sommes 
attach&#233;s &#224; rechercher une mod&#233;lisation du probl&#232;me dans le but d&#8217;automatiser int&#233;gralement 
les liens de traduction directs, cach&#233;s et asym&#233;triques avec comme objectif avou&#233; d&#8217;autoriser 
la restitution d&#8217;un dictionnaire bilingue enti&#232;rement sym&#233;trique sans omission d&#8217;information. 
Ce souci d&#8217;exhaustivit&#233; que nous revendiquons rejoint celui qui sous-tend les travaux de 
Mel&#8217;&#231;uk (1984, 1995) mais sans ajout ext&#233;rieur pour notre part. Sowa (1992) et Dutoit (2000) 
adoptent la m&#234;me d&#233;marche dans leurs propres mod&#232;les en partant du principe que toute la 
langue est potentiellement formalisable dans un m&#234;me espace. Bien entendu, nous voyons 
cette pr&#233;occupation comme un objectif stimulant mais pas comme une fin. 
</p>
<p>117</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>S&#233;bastien HATON, Jean-Marie PIERREL
</p>
<p>Dans l&#8217;optique d&#8217;une mod&#233;lisation efficace, nous avons introduit la notion linguistique de 
lexie au sens que Pottier puis Mel&#8217;&#231;uk et son &#233;quipe (1995) lui ont donn&#233;, &#224; savoir un mot pris 
dans une acception bien sp&#233;cifique. Dans le cadre de notre propre mod&#233;lisation, une lexie est 
un mot muni d&#8217;un faisceau de traits qui la distinguent de toutes les autres lexies du m&#234;me 
mot. Voyons toujours notre exemple de to leave, ces traits peuvent &#234;tre une traduction, un ou 
plusieurs synonymes li&#233;s &#224; la traduction, &#233;ventuellement des restrictions sur le choix des 
collocations sujet et objet, sur les constructions syntaxiques voire sur le registre, le domaine 
d&#8217;emploi et sur certaines informations extra-langagi&#232;res. Bref, une lexie dans nos mod&#232;les est 
caract&#233;ris&#233;e par tout ce qui est jug&#233; pertinent pour caract&#233;riser une relation de traduction dans 
un dictionnaire bilingue. 
</p>
<p>4 Mod&#233;lisation des donn&#233;es et programmation des graphes 
</p>
<p>4.1 Mod&#233;lisation du dictionnaire : le traitement des lexies au cas par cas 
</p>
<p>Le dernier volet de notre travail concerne la mod&#233;lisation proprement dite des lexies rep&#233;r&#233;es 
dans les dictionnaires et &#8211; &#233;ventuellement &#8211; dans les corpus litt&#233;raires. La premi&#232;re &#233;tape de la 
mod&#233;lisation est la transformation en bases de donn&#233;es des dictionnaires bilingues. Revenons 
&#224; notre fragment d&#8217;extrait de to leave.
</p>
<p>leave /li:v/ (vb : pr&#234;t, ptp left)
VT a (= go away from) [+ town] quitter, partir de ; 
</p>
<p>Comme nous l&#8217;avons dit, ce fragment contient, outre un lien de traduction, plusieurs liens de 
synonymie et de traduction pr&#233;sum&#233;e qu&#8217;il va falloir ordonner. Pour en rendre compte, nous 
avons effectu&#233; une nomenclature de liens de synonymie, lesquels se retrouvent dans 
l&#8217;algorithme final. Trois de ces liens sont directs (traduction directe, synonymie monolingue 
et traduction r&#233;ciproque), trois autres sont indirects (synonymie partielle en langue source, 
partielle en langue cible et traduction indirecte). 
</p>
<p>Le travail de mod&#233;lisation d&#8217;une lexie r&#233;side dans le codage de toutes les informations 
linguistiques pr&#233;sentes dans la ligne. En l&#8217;occurrence, notre fragment induit la d&#233;finition de 
plusieurs liens et structures pour les lexies pr&#233;sentes (Haton 2004 &amp; 2006) : 
</p>
<p>- Deux liens de synonymie de traduction directe (ST) entre to leave et quitter et entre to
leave et partir de 
</p>
<p>- Un lien de synonymie partielle en langue source (SPS) entre to leave et to go away 
from
</p>
<p>- Un lien de synonymie partielle en langue cible (SPTC) entre quitter et partir de
- Deux liens de synonymie indirecte (SI) entre to go away from et quitter et entre to go 
</p>
<p>away from et partir de.
- Une structure de traits pour chacune des quatre lexies to leave, to go away from,
</p>
<p>quitter et partir de dont la plus compl&#232;te est celle de la lexie source to leave qui 
contient : 
</p>
<p>- Son lemme : to leave
- Sa langue: Anglais 
- Sa cat&#233;gorie grammaticale: Verbe 
</p>
<p>Ces trois crit&#232;res sont communs &#224; toutes les lexies du m&#234;me mot to leave.
</p>
<p>118</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les Lexiques-Miroirs. Du dictionnaire bilingue au graphe multilingue 
</p>
<p>- Elle contient &#233;galement la collocation sujet (pas renseign&#233;e donc valeur par d&#233;faut qui 
est th&#233;oriquement &#171; sans importance d&#8217;un point de vue s&#233;mantique &#187;), la collocation 
objet (ici house), la construction syntaxique (pas renseign&#233;e donc transitif direct), le 
registre (pas renseign&#233; donc &#171; neutre &#187;) et les informations compl&#233;mentaires 
(absentes).
</p>
<p>- Trois autres structures sont cr&#233;&#233;es pour les trois autres lexies selon un proc&#233;d&#233; un peu 
diff&#233;rent car les informations qui les concernent ne sont pas identiques. 
</p>
<p>Le tout peut &#234;tre contenu dans une base de donn&#233;es interm&#233;diaire entre le dictionnaire et le 
graphe qui peut d&#233;couler de l&#8217;implantation de tous les liens de synonymie entre les lexies. Et 
bien entendu, pour permettre l&#8217;exploitation informatique de tous les objets qui viennent d&#8217;&#234;tre 
d&#233;crits, les liens et les structures sont munis automatiquement d&#8217;indices num&#233;riques 
permettant de les r&#233;unir ult&#233;rieurement par l&#8217;interm&#233;diaire du programme de cr&#233;ation de 
graphes. Voil&#224; par l&#8217;exemple ce que l&#8217;algorithme que nous avons con&#231;u fait sur l&#8217;ensemble de 
notre base de donn&#233;es lexicales en la traitant ligne par ligne. Pour justifier l&#8217;existence de 
plusieurs sources de donn&#233;es distinctes, et notamment la source des corpus, l&#8217;algorithme 
pr&#233;voit que lorsque les cases mot-source ou synonymes ne sont pas renseign&#233;es, il ne cr&#233;e 
qu&#8217;une structure pour la lexie sans lien de synonymie. 
</p>
<p>Dans leur m&#233;thodologie d&#8217;&#233;laboration, les graphes que nous nous proposons de g&#233;n&#233;rer 
ressemblent aux graphes construits par l&#8217;&#233;quipe de Sabine Ploux &#224; l&#8217;ISC Lyon (1997, 2003) 
ainsi qu&#8217;au dictionnaire des synonymes du CRISCO &#224; Caen (Manguin &amp; Fran&#231;ois, 2004). 
</p>
<p>4.2 Algorithme de transformation en graphe multilingue des lexiques 
bilingues transform&#233;s 
</p>
<p>Nous pr&#233;sentons ci-apr&#232;s l&#8217;algorithme qui a servi pour l&#8217;&#233;criture du programme initial. 
Quelques explications sur la typographie choisie sont n&#233;cessaires pour faciliter la lecture de 
l&#8217;algorithme : Les fonctions sont en petites majuscules ; les ensembles d&#8217;objets de m&#234;me type 
sont not&#233;s entre crochets {} ; les ensembles de couples attribut-valeur h&#233;t&#233;roclites sont entre 
parenth&#232;ses ( ) ; les op&#233;rateurs habituels (boucles, actions, conditions, etc.) sont soulign&#233;s ; 
les constantes en position de valeur sont entre guillemets &#171; &#187; ; Les variables sont &#233;crites avec 
une majuscule initiale (et peuvent &#234;tre int&#233;gralement &#233;crites en grandes majuscules pour 
certaines) ; Nil repr&#233;sente l&#8217;ensemble vide ou l&#8217;absence d&#8217;&#233;l&#233;ment ; chaque ligne de code 
active de l&#8217;algorithme se termine par un point virgule. 
L&#8217;algorithme de cr&#233;ation de graphes &#171; multilexicaux &#187;, car nous n&#8217;osons dire pleinement 
multilingues, a &#233;t&#233; programm&#233; tel quel il y a quelques mois par Etienne Petitjean &#224; l&#8217;ATILF. 
Nous n&#8217;avons &#233;videmment pas eu le temps de tester toutes ses potentialit&#233;s mais, gr&#226;ce au test 
r&#233;alis&#233; &#224; partir de l&#8217;entr&#233;e abandonner  du Robert &amp; Collins enrichie par l&#8217;ensemble de ses 
traductions et des traductions de ces traductions (4 300 liens de traductions r&#233;pertori&#233;s) nous 
savons d&#233;j&#224; que la transformation de cette base de donn&#233;es en graphe est acquise (cf. r&#233;sultats 
accessibles &#224; l&#8217;adresse http://www.atilf.fr/perso/pierrel/telechargement/result.txt). D&#8217;autre 
part, la perspective de disposer de lexiques &#233;lectroniques correctement balis&#233;s nous autorise &#224; 
esp&#233;rer l&#8217;automatisation compl&#232;te de toute la cha&#238;ne de transformation du dictionnaire en base 
de donn&#233;es puis de la base de donn&#233;es en graphe, et ce quel que soit le dictionnaire d&#8217;origine. 
La conservation de l&#8217;&#233;tape interm&#233;diaire &#171; Base de Donn&#233;es &#187; nous semble tr&#232;s importante 
car c&#8217;est le seul espace commun &#224; la fois aux donn&#233;es qui sont automatisables et &#224; celles qui 
ne le sont pas (notamment les donn&#233;es litt&#233;raires originales). La r&#233;union des deux types de 
donn&#233;es constitue une biblioth&#232;que ou banque lexicale de grande ampleur, ouvrant des 
perspectives particuli&#232;rement riches. 
</p>
<p>119</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>S&#233;bastien HATON, Jean-Marie PIERREL
</p>
<p> (Dico : Ensemble d&#8217;objets) : EXTRACTDONNEES (BD : xls) 
(Valeur : Cha&#238;ne de caract&#232;res) : EXTRACT (TAB[x, y] : tableau) 
(Dico : Ensemble d&#8217;objets) : AJOUT (Objdico : (Lemme, Cat, Lang, Econstr), Dico : Ensemble 
d&#8217;objets) 
(Liens : Ensemble de liens) : AJOUTLIEN (Lien : (Indice, Indice, Type), Liens : Ensemble de 
liens) 
(Econstr : Ensemble de constructions) : AJOUTCONSTR (Eltconstr : ( Constr, Collocobj1, 
Collocobj2, Collocsuj, Registre, Info compl), Econstr : Ensemble de constructions) 
Ensemble-d&#8217;objets : (Objdico, Liens) 
Objdico : (Lemme, Cat, Lang, Econstr) 
Liens : {lien} 
Lien : (Indice, Indice, Type) 
(Econstr : ensemble de constructions) : {Eltconstr} 
Eltconstr : ( Constr, Collocobj1, Collocobj2, Collocsuj, Registre, Info compl) 
</p>
<p>Dico = {Nil} ; Liens = {Nil} ; 
Ligne = 1 ; 
Motsource = TAB[ligne, 1] ; 
LS = TAB[ligne, 2] ; 
Numcons = 0 ; 
Tant que1 motsource .NE. Nil r&#233;p&#233;ter
</p>
<p>Econstr = {Nil} ;
Tant que2 (Motsource, LS)= (TAB[ligne, 1], TAB[ligne, 2])  r&#233;p&#233;ter
</p>
<p>Numcons = Numcons + 1 ;
IndiceMS = Numcons ; 
EltconstrMS = (Constr = EXTRACT (TAB[ligne,10]), Collocobjet1 = EXTRACT 
</p>
<p>(TAB [ligne, 7]), Collocobjet2 = EXTRACT (TAB [ligne, 8]) , 
Collocsuj = EXTRACT (TAB [ligne, 9]), Registre = EXTRACT (TAB
[ligne, 12]), Infoscompls = EXTRACT (TAB [ligne, 13]), 
IndiceMS) ; 
</p>
<p>MC = EXTRACT (TAB[ligne, 3]) ; 
LC = EXTRACT (TAB[ligne, 4]) ; 
SMC = EXTRACT (TAB[ligne, 6]) ; 
SMS = EXTRACT (TAB[ligne, 5]) ; 
IndiceMC = Numcons ; 
Numcons = Numcons + 1 ; 
EltconstrMC = (Constr = EXTRACT (TAB[ligne,11]), Collocobjet1 = EXTRACT 
</p>
<p>(TAB [ligne, 7]), Collocobjet2 = EXTRACT (TAB [ligne, 8]) , 
Collocsuj = EXTRACT (TAB [ligne, 9]), Registre = EXTRACT (TAB
[ligne, 12]), Infoscompls = EXTRACT (TAB [ligne, 13]), 
IndiceMC) ; 
</p>
<p>EconstrMC = {EltconstrMC} ; 
AJOUTLIEN (Liens, (IndiceMS, IndiceMC, &#171; ST &#187;) ; 
Objdico = (Lemme = MC ; Cat = &#171; V &#187; ; Lang = LC ; Constr = EconstrMC) ; 
Dico = AJOUT (Dico, Objdico) ; 
</p>
<p>Si SMS .NE. Nil alors d&#233;but
IndiceSMS = Numcons ; 
Numcons = Numcons + 1 ; 
EltconstrSMS = (IndiceSMS) ; 
EconstrSMS = {EltconstrSMS} ; 
</p>
<p>120</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les Lexiques-Miroirs. Du dictionnaire bilingue au graphe multilingue 
</p>
<p>AJOUTLIEN (Liens, (IndiceSMS, IndiceMC, &#171; SI &#187; ) ; 
AJOUTLIEN (Liens, (IndiceSMS, IndiceMS, &#171; SPS &#187; ) ; 
objdico = (lemme = MC ; cat = &#171; V &#187; ; lang = LC ; 
Constr = EconstrMC) ; 
Dico = AJOUT (Dico, objdico) ; 
fin
</p>
<p>Si SMC .NE. Nil alors d&#233;but
IndiceSMC = Numcons ; 
Numcons = Numcons + 1 ;
EltonstrSMC = (IndiceSMC) ; 
EconstrSMC = {EltconstrSMC] ; 
AJOUTLIEN (Liens, (IndiceMS, IndiceSMC, &#171; ST &#187;) ; 
AJOUTLIEN (Liens, (IndiceSMC, IndiceMC, &#171; SPTC &#187;) ; 
AJOUTLIEN (Liens, (IndiceMC, IndiceSMC, &#171; SPTC &#187;) ; 
Objdico = (Lemme = SMC ; Cat = &#171; V &#187; ; lang = LC ; 
Constr = EconstrSMC) ; 
Dico = Ajout (Dico, Objdico) ; 
</p>
<p>               fin
</p>
<p>Si SMS .NE. Nil et SMC .NE. Nil alors AJOUTLIEN (Liens, (IndiceSMS,
IndiceSMC, &#171; SI &#187;) 
</p>
<p>EconstrMS = AJOUTCONSTR(EconstrMS, EltconstrMS) 
ligne = ligne +1 
</p>
<p>Fintantque2
objdico = (lemme = Motsource ; cat = &#171; V &#187; ; lang = LS ; Constr = Econstr) 
Dico = Ajout (Dico, objdico) 
</p>
<p>Fintantque1
</p>
<p>5 Conclusion
Bien s&#251;r, si notre algorithme est capable de transformer un dictionnaire en graphe, l&#8217;inverse 
est &#233;galement vrai moyennant quelques am&#233;nagements mineurs. De ce point de vue, nous 
pensons que notre m&#233;thode permettra la g&#233;n&#233;ration automatique de dictionnaires selon un 
param&#233;trage tr&#232;s souple. Par exemple, admettons que nous avons saisi l&#8217;int&#233;gralit&#233; de notre 
dictionnaire bilingue et que nous voulons le restituer sous une forme parfaitement sym&#233;trique. 
Deux lignes de code informatique suffisent pour demander &#224; ce que tous les liens de 
synonymie de traduction, naturellement orient&#233;s, soient d&#233;sorient&#233;s et le dictionnaire bilingue 
sym&#233;trique est pr&#234;t &#224; &#234;tre g&#233;n&#233;r&#233;. 
</p>
<p>Les applications les plus directes que nous envisageons sont de deux types : nous esp&#233;rons 
pouvoir g&#233;n&#233;rer au moins partiellement des dictionnaires in&#233;dits &#224; partir de ceux qui auront 
d&#233;j&#224; &#233;t&#233; transform&#233;s. Par exemple, admettons que nous ayons saisi un dictionnaire fran&#231;ais-
anglais et un dictionnaire fran&#231;ais-italien. &#192; partir de cela, nous souhaitons r&#233;fl&#233;chir aux 
moyens informatiques &#224; mettre en &#339;uvre pour g&#233;n&#233;rer un dictionnaire anglais-italien 
compl&#232;tement in&#233;dit (cf. Teeraparbseree, 2004). Ce travail a d&#233;j&#224; &#233;t&#233; entam&#233; et les premiers 
r&#233;sultats sont encourageants, nonobstant la surg&#233;n&#233;ration de liens de synonymie entre 
l&#8217;anglais et l&#8217;italien via le fran&#231;ais. D&#8217;autre part, la m&#233;thode semble offrir un certain int&#233;r&#234;t 
pour l&#8217;aide &#224; l&#8217;alignement des textes en plusieurs langues, ce dernier g&#233;n&#233;rant un feedback 
tr&#232;s profitable pour l&#8217;enrichissement du graphe multilingue. En d&#233;finitive, le dictionnaire 
</p>
<p>121</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>S&#233;bastien HATON, Jean-Marie PIERREL
</p>
<p>&#171; fusionn&#233; &#187; et les textes align&#233;s constituent des m&#233;moires de traduction quasiment 
in&#233;puisables et susceptibles de s&#8217;enrichir mutuellement. 
</p>
<p>R&#233;f&#233;rences
DUTOIT D., (2000). Quelques op&#233;rations Sens &#198; Texte et Texte &#198; Sens utilisant une 
S&#233;mantique Linguistique Universaliste a priori. Th&#232;se soutenue &#224; l&#8217;Universit&#233; de Caen, 
sp&#233;cialit&#233; Informatique Linguistique. 
</p>
<p>HATON S., (2003). &#171; Les Champs S&#233;mantiques Multilingues Unifi&#233;s &#187;. Actes du congr&#232;s 
international Repr&#233;sentation du Sens, Montr&#233;al. 
</p>
<p>HATON S., (2004). &#171; Sens, polys&#233;mie et multilinguisme : comment g&#233;n&#233;rer des champs 
synonymiques &#224; partir de dictionnaires de langues &#187;. Actes du colloque JETOU2003 autour
du sens, Toulouse. 
</p>
<p>HATON S., (2006). Analyse et mod&#233;lisation de la polys&#233;mie verbale dans une perspective 
multilingue : le dictionnaire bilingue vu dans un miroir. Th&#232;se de doctorat soutenue le 25 
novembre 2006. Universit&#233; de Nancy 2. 
</p>
<p>MANGUIN J-L., FRAN&#199;OIS J., ALII, (2004). Le dictionnaire &#233;lectronique des synonymes du 
CRISCO. Un mode d&#8217;emploi &#224; trois niveaux. Cahiers du CRISCO n&#176;17, juillet 2004. 
Universit&#233; de Caen.
</p>
<p>MEL&#8217;&#199;UK I., ALII, (1984). Dictionnaire explicatif et combinatoire du fran&#231;ais contemporain. 
Recherches Lexico-S&#233;mantiques I. Les Presses de l&#8217;Universit&#233; de Montr&#233;al. 
</p>
<p>MEL&#8217;&#199;UK I., CLAS A., POLGU&#200;RE A., (1995). Introduction &#224; la lexicologie explicative et 
combinatoire. Champs linguistiques. &#201;ditions Duculot, AUPELF UREF. 
</p>
<p>PLOUX S., (1997). &#171; Mod&#233;lisation et traitement informatique de la synonymie &#187;. Linguisticae
Investigationes, Tome XXI/1997, Fascicule 1. 
</p>
<p>PLOUX S., JI H., (2003). &#8220;A Model for Matching Semantic Maps Between Languages ( French 
/ English, English / French )&#8221;. Computational Linguistics. 29(2), pp.155-178. 
</p>
<p>SOWA J., (1992). &#8220;Logical structures in the Lexicon&#8221; in Lexical Semantics and Commonsense 
Reasoning, edited by James Pustejovsky and Sabine Bergler, LNAI 627, Springer-Verlag, 
Berlin, 1992, pp.39-60. 
</p>
<p>TEERAPARBSEREE A., (2004). &#171; Un syst&#232;me adaptable pour l&#8217;initialisation automatique d&#8217;une 
base lexicale interlingue par acceptions &#187;. RECITAL 2004, F&#232;s, 21 avril 2004. 
</p>
<p>122</p>

</div></div>
</body></html>