<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une formalisation des d&#233;compositions s&#233;mantiques dans la Grammaire d&#8217;Unification Sens-Texte</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Vers une formalisation des d&#233;compositions s&#233;mantiques
dans la Grammaire d&#8217;Unification Sens-Texte
</p>
<p>Fran&#231;ois LAREAU
Lattice - U. Paris 7, UFRL, Case 7003, 2 pl. Jussieu, 75251 Paris cedex 5
OLST - U. de Montr&#233;al, Ling., CP 6128 succ C.-V., Montr&#233;al QC, H3C 3J7
</p>
<p>francois.lareau@umontreal.ca
</p>
<p>R&#233;sum&#233;. Nous proposons une formalisation de la d&#233;composition du sens dans le cadre
de la Grammaire d&#8217;Unification Sens-Texte. Cette formalisation vise une meilleure int&#233;gration
des d&#233;compositions s&#233;mantiques dans un mod&#232;le global de la langue. Elle repose sur un jeu de
saturation de polarit&#233;s qui permet de contr&#244;ler la construction des repr&#233;sentations d&#233;compos&#233;es
ainsi que leur mise en correspondance avec des arbres syntaxiques qui les expriment. Le forma-
lisme propos&#233; est illustr&#233; ici dans une perspective de synth&#232;se, mais il s&#8217;applique &#233;galement en
analyse.
</p>
<p>Abstract. We propose a formal representation of meaning decomposition in the frame-
work of the Meaning-Text Unification Grammar. The proposed technique aims at offering a
better integration of such semantic decompositions into a global model of the language. It re-
lies on the saturation of polarities to control the construction of decomposed respresentations
as well as their mapping to the syntactic trees that express them. The proposed formalism is
discussed from the viewpoint of generation, but it applies to analysis as well.
</p>
<p>Mots-cl&#233;s : Grammaire d&#8217;Unification Sens-Texte, Th&#233;orie Sens-Texte, s&#233;mantique, re-
pr&#233;sentation du sens, paraphrasage.
</p>
<p>Keywords: Meaning-Text Unification Grammar, Meaning-Text Theory, semantics, re-
presentation of meaning, paraphrasing.
</p>
<p>1 Introduction
</p>
<p>Dans le cadre de la th&#233;orie Sens-Texte (Mel&#8217;c&#780;uk, 1997; Kahane, 2001) (ci-apr&#232;s, TST), le sens
d&#8217;un &#233;nonc&#233; est repr&#233;sent&#233; par un r&#233;seau de s&#233;mant&#232;mes. Ces s&#233;mant&#232;mes peuvent &#234;tre d&#233;com-
pos&#233;s (c&#8217;est-&#224;-dire remplac&#233;s par leur d&#233;finition) mais ce sont en g&#233;n&#233;ral des repr&#233;sentations
r&#233;duites (c&#8217;est-&#224;-dire dont les s&#233;mant&#232;mes ne sont pas d&#233;compos&#233;s) qui sont utilis&#233;es pour re-
pr&#233;senter le sens d&#8217;un &#233;nonc&#233;. La principale raison pour laquelle on ne d&#233;compose pas les
repr&#233;sentations s&#233;mantiques est qu&#8217;on ne saurait pas o&#249; s&#8217;arr&#234;ter. En effet, jusqu&#8217;&#224; quel point
faut-il d&#233;composer ? Il n&#8217;y a &#224; cette question que deux r&#233;ponses possibles si on veut &#233;viter l&#8217;arbi-
traire : soit on d&#233;compose jusqu&#8217;aux sens primitifs, ce que fait notamment (Wierzbicka, 1996),
soit on ne d&#233;compose pas du tout, ce qui est la position de la TST (Mel&#8217;c&#780;uk, 1988; Mel&#8217;c&#780;uk,
1989). Ainsi, bien qu&#8217;ils soient des paraphrases, les trois &#233;nonc&#233;s suivants n&#8217;ont pas la m&#234;me
repr&#233;sentation s&#233;mantique, comme le montre la Figure 1.
</p>
<p>163</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois LAREAU
</p>
<p>(1) a. Une Torontoise rousse.
</p>
<p>b. Une rousse qui habite Toronto.
</p>
<p>c. Une femme rousse qui habite Toronto.
</p>
<p>1
</p>
<p>roux
</p>
<p>Torontoise
</p>
<p>2
</p>
<p>rousse
</p>
<p>habiter
</p>
<p>Toronto
</p>
<p>1
</p>
<p>roux
</p>
<p>1
</p>
<p>femme habiter
</p>
<p>Toronto
</p>
<p>1
</p>
<p>2
</p>
<p>a. b. c.
</p>
<p>FIG. 1 &#8211; Trois paraphrases qui n&#8217;ont pas la m&#234;me repr&#233;sentation s&#233;mantique
</p>
<p>Ces trois &#233;nonc&#233;s expriment exactement les m&#234;mes sens, soit ceux visibles &#224; la Figure 1c, mais
ils diff&#232;rent par la fa&#231;on dont ils les regroupent. Dans le premier les sens (femme), (habiter)
et (Toronto) sont exprim&#233;s par un m&#234;me nom, TORONTOISE(N) (cf. Figure 1a), alors que dans
le second ce sont (femme) et (roux(Adj)) qui sont regroup&#233;s et exprim&#233;s par le nom ROUSSE(N)
(cf. Figure 1b), tandis que dans le troisi&#232;me &#233;nonc&#233; &#224; chaque s&#233;mant&#232;me correspond un lex&#232;me
distinct (cf. Figure 1c). Bien entendu, on peut d&#233;montrer que leurs repr&#233;sentations s&#233;mantiques
respectives sont strictement &#233;quivalentes, tout simplement par le biais de ce que (Milic&#769;evic&#769;, sous
presse) appelle des r&#232;gles d&#8217;expansion / r&#233;duction ordinaires, c&#8217;est-&#224;-dire des r&#232;gles qui mettent
en &#233;quivalence les s&#233;mant&#232;mes et leur d&#233;finition. La Figure 2 montre un exemple d&#8217;une telle
r&#232;gle.
</p>
<p>Torontoise femme
</p>
<p>habiter
2
</p>
<p>1
</p>
<p>Toronto
</p>
<p>FIG. 2 &#8211; Une r&#232;gle d&#8217;&#233;quivalence s&#233;mantique de la TST
</p>
<p>Toutefois, ces r&#232;gles soul&#232;vent au moins trois questions quant &#224; leur formalisation :
</p>
<p>1. O&#249; se situent les r&#232;gles d&#8217;&#233;quivalence s&#233;mantique par rapport aux diff&#233;rents modules d&#8217;un
mod&#232;le linguistique ?
</p>
<p>2. Comment peuvent-elles interagir avec les autres r&#232;gles du mod&#232;le ?
</p>
<p>3. Comment peuvent-elles &#234;tre formalis&#233;es ?
</p>
<p>Nous tenterons d&#8217;y r&#233;pondre en nous situant dans le cadre de la Grammaire d&#8217;Unification Sens-
Texte, dont nous proposons d&#8217;abord un bref rappel. Nous sugg&#233;rons une solution qui ne fait
appel &#224; aucun m&#233;canisme ext&#233;rieur et qui ne n&#233;cessite aucun changement au formalisme. Nous
</p>
<p>164</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une formalisation des d&#233;compositions s&#233;mantiques dans GUST
</p>
<p>verrons &#233;galement bri&#232;vement comment notre solution peut servir &#224; typer les actants s&#233;man-
tiques, si d&#233;sir&#233;.
</p>
<p>2 La Grammaire d&#8217;Unification Sens-Texte
</p>
<p>La Grammaire d&#8217;Unification Sens-Texte (ci-apr&#232;s, GUST) a d&#8217;abord &#233;t&#233; propos&#233;e par (Kahane,
2002), puis formalis&#233;e sous forme de grammaire d&#8217;unification polaris&#233;e (Kahane, 2004) par
(Kahane &amp; Lareau, 2005). Puisqu&#8217;elle est bas&#233;e sur la TST, GUST consid&#232;re plusieurs niveaux
de repr&#233;sentation (s&#233;mantique, syntaxique, morphotopologique et phonologique). &#192; chaque ni-
veau correspond une grammaire de bonne formation qui d&#233;crit les structures possibles (ces
grammaires sont appel&#233;es respectivement Gs&#233;m, Gsynt, Gmorph et Gphon). Les niveaux sont or-
donn&#233;s et la correspondance entre deux structures de niveaux adjacents est assur&#233;e par des
grammaires d&#8217;interface (I s&#233;m-synt, I synt-morph et Imorph-phon) qui mettent en correspondance des
fragments &#233;l&#233;mentaires de structures.
</p>
<p>Tous les n&#339;uds, arcs et autres objets des grammaires de bonne formation ou d&#8217;interface sont
associ&#233;s &#224; un certain nombre de polarit&#233;s. Contrairement &#224; (Kahane &amp; Lareau, 2005), nous uti-
lisons un syst&#232;me &#224; deux valeurs de polarit&#233;s (plut&#244;t que trois), soit ! et &quot;. Parmi ces deux
valeurs, la noire est dite neutre, c&#8217;est-&#224;-dire qu&#8217;une structure dont tous les objets ne portent que
des polarit&#233;s de valeur noire est consid&#233;r&#233;e comme satur&#233;e, alors qu&#8217;une polarit&#233; blanche d&#233;-
clenche obligatoirement l&#8217;unification de son porteur avec d&#8217;autres objets afin d&#8217;&#234;tre neutralis&#233;e.
L&#8217;unification de deux objets entra&#238;ne en effet le calcul d&#8217;une nouvelle valeur pour chacune des
polarit&#233;s qu&#8217;ils portent de la fa&#231;on suivante : ! &#183; ! = ! et ! &#183; &quot; = &quot; &#183; ! = &quot; (l&#8217;unification
de deux objets noirs n&#8217;est pas permise). C&#8217;est ainsi que, par unification, les structures se sa-
turent. C&#8217;est en fait la neutralisation des polarit&#233;s qui contr&#244;le tout le processus de synth&#232;se
ou d&#8217;analyse linguistique. Cela s&#8217;op&#232;re notamment par les polarit&#233;s d&#8217;interface, c&#8217;est-&#224;-dire des
polarit&#233;s non neutres qui sont ajout&#233;es aux objets d&#8217;une grammaire dans le but de d&#233;clencher le
module suivant dans le mod&#232;le linguistique. Par exemple, les objets de Gs&#233;m, en plus de porter
une polarit&#233; ps&#233;m, qui contr&#244;le la saturation des structures s&#233;mantiques, portent tous une polarit&#233;
ps&#233;m-synt blanche. Les r&#232;gles de I s&#233;m-synt &#233;tant les seules &#224; contenir des objets de polarit&#233; ps&#233;m-synt
noire, ce module sera automatiquement appliqu&#233;, de fa&#231;on &#224; neutraliser les structures produites
par Gs&#233;m. Nous ne pouvons pas illustrer en d&#233;tail ce m&#233;canisme dans le pr&#233;sent article, aussi
renvoyons-nous le lecteur &#224; (Kahane &amp; Lareau, 2005). Nous verrons qu&#8217;il est au c&#339;ur de la
formalisation que nous proposons ici pour les r&#232;gles d&#8217;&#233;quivalence s&#233;mantique.
</p>
<p>3 La place des r&#232;gles d&#8217;&#233;quivalence s&#233;mantique dans GUST
</p>
<p>Dans le cadre de la TST, les r&#232;gles d&#8217;&#233;quivalence s&#233;mantique ne font partie d&#8217;aucun des modules
de transition qui constituent un mod&#232;le Sens-Texte, puisqu&#8217;elles encodent des ph&#233;nom&#232;nes or-
thogonaux aux processus de synth&#232;se et d&#8217;analyse simul&#233;s par les r&#232;gles de correspondance.
Pour les m&#234;mes raisons, elles ne peuvent pas constituer une grammaire d&#8217;interface dans GUST,
puisqu&#8217;elles ne mettent pas en relation des objets de niveaux adjacents. En fait, ces r&#232;gles ne
peuvent m&#234;me pas constituer un module distinct, puisqu&#8217;on ne sait pas a priori jusqu&#8217;&#224; quel ni-
veau on doit d&#233;composer (ou r&#233;duire) un s&#233;mant&#232;me (ou une configuration de s&#233;mant&#232;mes). Il
</p>
<p>165</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois LAREAU
</p>
<p>faudrait donc que ce module puisse s&#8217;appliquer &#224; son propre r&#233;sultat de fa&#231;on r&#233;cursive, ce qui
est difficilement compatible avec le syst&#232;me de polarit&#233;s utilis&#233; dans GUST. Ainsi, nous pro-
posons plut&#244;t d&#8217;int&#233;grer les r&#232;gles d&#8217;expansion / r&#233;duction &#224; la grammaire de bonne formation
s&#233;mantique de GUST.
</p>
<p>4 Une repr&#233;sentation formelle du sens en GUST
</p>
<p>Afin d&#8217;int&#233;grer les r&#232;gles d&#8217;expansion / r&#233;duction &#224; Gs&#233;m, nous devons l&#233;g&#232;rement modifier la
caract&#233;risation de celle-ci donn&#233;e par (Kahane &amp; Lareau, 2005), sans pour autant en modifier le
formalisme. Les n&#339;uds s&#233;mantiques seront ici con&#231;us comme des ensembles qui peuvent conte-
nir d&#8217;autres n&#339;uds. Les n&#339;uds inclus &#224; l&#8217;int&#233;rieur d&#8217;un autre n&#339;ud sont reli&#233;s par des arcs et
forment de petites structures s&#233;mantiques qui repr&#233;sentent les constituants du s&#233;mant&#232;me ainsi
d&#233;compos&#233;. Les n&#339;uds qui d&#233;composent un autre n&#339;ud sont reli&#233;s &#224; ce dernier par la fonction
r&#233;duction, qui associe &#224; un n&#339;ud l&#8217;ensemble dont il fait partie (c&#8217;est-&#224;-dire un autre n&#339;ud).
Parmi les n&#339;uds qui forment la d&#233;composition d&#8217;un s&#233;mant&#232;me, un seul est identifi&#233; comme le
sens principal. Il s&#8217;agit du genre prochain et il est identifi&#233; par la fonction g&#233;n&#233;rique, qui prend
comme argument un s&#233;mant&#232;me (un n&#339;ud) et retourne son genre prochain (un autre n&#339;ud).1
Graphiquement, nous repr&#233;sentons les d&#233;compositions &#224; l&#8217;int&#233;rieur d&#8217;une bulle en pointill&#233;s
li&#233;e au n&#339;ud r&#233;duit, dans laquelle le genre prochain est soulign&#233;. Par souci de lisibilit&#233;, nous
r&#233;duisons la taille des caract&#232;res et des traits &#224; l&#8217;int&#233;rieur de ces bulles. La Figure 3 encode la
r&#232;gle d&#8217;&#233;quivalence (Torontoise) &#8801; (femme qui habite Toronto), tant sous forme explicite2 que
graphique.3
</p>
<p>{ 1:n&#339;uds&#233;m, 2: n&#339;uds&#233;m, 3: n&#339;uds&#233;m,
4: n&#339;uds&#233;m, 5: arcs&#233;m, 6: arcs&#233;m },
</p>
<p>{ source(5) = 2, cible(5) = 3, 
source(6) = 2, cible(6) = 4, 
&#233;tiquette(1) = &quot;Torontoise&quot;, 
</p>
<p>&#233;tiquette(2) = &quot;habiter&quot;, &#233;tiquette(3) = &quot;femme&quot;, 
&#233;tiquette(4) = &quot;Toronto&quot;, &#233;tiquette(5) = &quot;1&quot;, 
</p>
<p>&#233;tiquette(6) = &quot;2&quot;, 
ps&#233;m(1) = N, ps&#233;m(2) = B, ps&#233;m(3) = B, 
ps&#233;m(4) = B, ps&#233;m(5) = B, ps&#233;m(6) = B, 
</p>
<p>ps&#233;m-synt(1) = B, ps&#233;m-synt(2) = N, ps&#233;m-synt(3) = N, 
ps&#233;m-synt(4) = N, ps&#233;m-synt(5) = N, ps&#233;m-synt(6) = N, 
</p>
<p>g&#233;n&#233;rique(1) = 3, r&#233;duction(2) = 1, 
r&#233;duction(3) = 1, r&#233;duction(4) = 1 }
</p>
<p>Torontoise
</p>
<p>1
</p>
<p>femme
</p>
<p>habiter
2
</p>
<p>Toronto
</p>
<p>(1)
</p>
<p>(2)
</p>
<p>(3)
(4)
</p>
<p>FIG. 3 &#8211; La d&#233;composition s&#233;mantique de (Torontoise)
</p>
<p>1Il n&#8217;est pas &#233;vident que l&#8217;on puisse toujours identifier un seul s&#233;mant&#232;me comme genre prochain pour tous
les sens de la langue. Nous ne savons pas pour l&#8217;instant comment encoder les cas o&#249; le genre prochain est une
configuration de s&#233;mant&#232;mes ou o&#249; il y a plusieurs genres prochains.
</p>
<p>2Les valeurs &#171; N &#187; et &#171; B &#187; des fonctions de polarit&#233;s renvoient respectivement aux polarit&#233;s ! et &quot;.
3Toutes les figures qui suivent montrent deux polarit&#233;s pour chaque objet : ps&#233;m (qui contr&#244;le la saturation
</p>
<p>des structures s&#233;mantiques), indiqu&#233;e par la couleur de l&#8217;objet, et ps&#233;m-synt (qui assure l&#8217;interface avec I s&#233;m-synt),
indiqu&#233;e par un petit carr&#233; &#224; c&#244;t&#233; de l&#8217;objet. Par ailleurs, dans la Figure 3, nous ajoutons aux n&#339;uds de la version
graphique (entre parenth&#232;ses et en italique) les num&#233;ros d&#8217;identification utilis&#233;s dans la version textuelle afin que
le lecteur puisse plus facilement mettre en relation les deux formes de repr&#233;sentation.
</p>
<p>166</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une formalisation des d&#233;compositions s&#233;mantiques dans GUST
</p>
<p>Les s&#233;mant&#232;mes (rousse(N)) et (femme) peuvent se d&#233;composer de la m&#234;me fa&#231;on, comme le
montre la Figure 4. On remarquera que les n&#339;uds &#224; l&#8217;int&#233;rieur des d&#233;compositions portent
toujours une polarit&#233; ps&#233;m blanche. Ils forcent ainsi l&#8217;application d&#8217;autres r&#232;gles de Gs&#233;m pour
v&#233;rifier leur bonne formation. Par exemple, le n&#339;ud (femme) apparaissant dans la d&#233;composition
de (rousse(N)) forcera l&#8217;application de la r&#232;gle qui en v&#233;rifie la bonne formation (&#224; droite dans la
Figure 4), introduisant par le fait m&#234;me la d&#233;composition de ce s&#233;mant&#232;me.
</p>
<p>femme
</p>
<p>f&#233;minin
</p>
<p>personne
</p>
<p>1
</p>
<p>rousse
</p>
<p>roux
</p>
<p>femme
</p>
<p>1
</p>
<p>FIG. 4 &#8211; La d&#233;composition s&#233;mantique de (femme) et de (rousse(N))
</p>
<p>On remarquera &#233;galement que les n&#339;uds &#224; l&#8217;int&#233;rieur des d&#233;compositions sont toujours satu-
r&#233;s en ps&#233;m-synt. Cela a pour but d&#8217;&#233;viter de r&#233;aliser &#224; la fois un sens et sa d&#233;finition dans le
m&#234;me &#233;nonc&#233;. Lorsqu&#8217;un fragment de la structure s&#233;mantique a &#233;t&#233; r&#233;duit, tous ses &#233;l&#233;ments
deviennent invisibles pour l&#8217;interface I s&#233;m-synt, qui ne peut plus voir que le s&#233;mant&#232;me r&#233;duit.
Ainsi, toutes les r&#232;gles de Gs&#233;m qui construisent un n&#339;ud devront &#233;galement en fournir la d&#233;-
composition. Seuls les primitifs s&#233;mantiques4 font exception, puisqu&#8217;ils ne peuvent pas &#234;tre
d&#233;compos&#233;s. Pour les besoins de notre expos&#233;, nous allons consid&#233;rer que ((de sexe) f&#233;minin),
((aux cheveux) roux(Adj)), (habiter), (Toronto) et (personne) sont des sens ind&#233;composables.
</p>
<p>roux
</p>
<p>1
</p>
<p>f&#233;minin
</p>
<p>1
</p>
<p>habiter
</p>
<p>21
</p>
<p>personne
</p>
<p>Toronto
</p>
<p>FIG. 5 &#8211; Les sens primitifs dans la grammaire s&#233;mantique
</p>
<p>Voyons maintenant comment ces r&#232;gles s&#8217;appliquent en synth&#232;se. D&#8217;abord, les sens &#171; primitifs &#187;
d&#233;crits &#224; la Figure 5 nous permettent de construire la repr&#233;sentation de la Figure 6.
</p>
<p>4Nous partons du postulat, h&#233;rit&#233; de la TST, que toute langue comporte un certain nombre de sens ind&#233;com-
posables, dits &#171; primitifs &#187; (qui ne sont pas forc&#233;ment universels). Notre formalisme ne peut pas fonctionner si
on admet la circularit&#233; dans les descriptions s&#233;mantiques. Cette propri&#233;t&#233; est d&#8217;ailleurs souhaitable &#224; nos yeux
puisqu&#8217;elle permet de v&#233;rifier la non-circularit&#233; de la grammaire s&#233;mantique.
</p>
<p>167</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois LAREAU
</p>
<p>1
1
</p>
<p>1
2
</p>
<p>roux
</p>
<p>personne
habiter
</p>
<p>Toronto
f&#233;minin
</p>
<p>FIG. 6 &#8211; Une repr&#233;sentation s&#233;mantique d&#233;compos&#233;e &#224; r&#233;aliser
</p>
<p>Il est parfaitement possible d&#8217;utiliser cette repr&#233;sentation s&#233;mantique telle quelle et de la mettre
en correspondance avec un arbre syntaxique sans la r&#233;duire aucunement. On obtient alors
l&#8217;&#233;nonc&#233; (2).
</p>
<p>(2) Une personne rousse de sexe f&#233;minin qui habite Toronto.
</p>
<p>On peut &#233;galement op&#233;rer une premi&#232;re r&#233;duction en appliquant la d&#233;finition de (femme) (voir
la Figure 4), ce qui donne la structure de la Figure 7.
</p>
<p>1 1 1
2
</p>
<p>roux
</p>
<p>personne
</p>
<p>habiter
</p>
<p>Toronto
</p>
<p>f&#233;minin
</p>
<p>femme
</p>
<p>FIG. 7 &#8211; La r&#233;duction de (personne (de sexe) f&#233;minin)
</p>
<p>Cette repr&#233;sentation ne peut toutefois pas &#234;tre mise en correspondance avec un arbre syntaxique,
puisque du point de vue de l&#8217;inteface s&#233;mantique-syntaxe elle n&#8217;est pas connexe ((personne)
&#233;tant satur&#233; en ps&#233;m-synt, il n&#8217;est plus visible pour l&#8217;interface). La structure qui en r&#233;sulterait ne
serait pas un arbre et serait donc rejet&#233;e (Kahane &amp; Lareau, 2005). Pour rendre cette struc-
ture connexe, il faut en quelque sorte &#171; d&#233;placer &#187; les relations s&#233;mantiques qui pointaient
vers (personne) pour qu&#8217;elles portent maintenant sur (femme). Nous devons donc introduire une
r&#232;gle de propagation qui recopie les relations s&#233;mantiques pointant vers un n&#339;ud pour qu&#8217;elles
pointent vers le s&#233;mant&#232;me r&#233;duit dont ce n&#339;ud est le genre prochain5 (voir Figure 8). Une fois
cette r&#232;gle appliqu&#233;e, on obtient la structure de la Figure 9.
</p>
<p>5Cette r&#232;gle ne concerne que le genre prochain. En effet, si une relation pointe vers un autre s&#233;mant&#232;me, la
r&#233;duction n&#8217;est pas possible. Par exemple, (femme tr&#232;s rousse) ne peut pas &#234;tre r&#233;duit sans perte d&#8217;information
[*une tr&#232;s rousse(N)], alors que (grande femme rousse) ne pose aucun probl&#232;me [une grande rousse(N)].
</p>
<p>168</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une formalisation des d&#233;compositions s&#233;mantiques dans GUST
</p>
<p>x
x
</p>
<p>FIG. 8 &#8211; Une r&#232;gle de propagation du gouverneur
</p>
<p>1 1
</p>
<p>2
roux habiter
</p>
<p>Toronto
</p>
<p>femme
</p>
<p>1 1
1
</p>
<p>personne
</p>
<p>f&#233;minin
</p>
<p>FIG. 9 &#8211; La r&#233;duction de (personne (de sexe) f&#233;minin) avec propagation des gouverneurs
</p>
<p>Les relations pointant vers (personne) ont &#233;t&#233; neutralis&#233;es du point de vue de l&#8217;interface s&#233;mantique-
syntaxe par la saturation de leur polarit&#233; ps&#233;m-synt. La structure r&#233;sultante peut tout de suite &#234;tre
mise en correspondance avec un arbre syntaxique, ce qui donne l&#8217;&#233;nonc&#233; (3).
</p>
<p>(3) Une femme rousse qui habite Toronto.
</p>
<p>Elle peut aussi &#234;tre r&#233;duite encore une fois en appliquant la r&#232;gle qui construit (rousse(N)). Cela
nous donne la structure de la Figure 10a, puis celle en 10b une fois la r&#232;gle de propagation
des gouverneurs appliqu&#233;e. Il r&#233;sulte que les seuls s&#233;mant&#232;mes accessibles &#224; I s&#233;m-synt (donc
demandant &#224; &#234;tre exprim&#233;s), sont (rousse(N)), (habiter) et (Toronto) ce qui permet de former
l&#8217;&#233;nonc&#233; (4).
</p>
<p>(4) Une rousse qui habite Toronto.
</p>
<p>On aurait pu r&#233;duire les s&#233;mant&#232;mes autrement, en utilisant d&#8217;autres r&#232;gles d&#8217;&#233;quivalence s&#233;-
mantique. Dans tous les cas, on retrouverait toujours la configuation s&#233;mantique de la Figure 6,
mais de nouveaux s&#233;mant&#232;mes r&#233;duits appara&#238;traient et les sens accessibles &#224; I s&#233;m-syntne seraient
pas les m&#234;mes.
</p>
<p>169</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois LAREAU
</p>
<p>1
</p>
<p>1
</p>
<p>1
</p>
<p>2
roux
</p>
<p>personne
habiter
</p>
<p>Toronto
f&#233;minin
</p>
<p>femme
</p>
<p>1
1
</p>
<p>rousse
</p>
<p>1
</p>
<p>1
</p>
<p>1
</p>
<p>2
roux
</p>
<p>personne habiter
</p>
<p>Toronto
f&#233;minin
</p>
<p>femme
</p>
<p>1
1
</p>
<p>rousse
</p>
<p>1
</p>
<p>a. b.
</p>
<p>FIG. 10 &#8211; La r&#233;duction de (femme rousse) avec propagation des gouverneurs
</p>
<p>5 Le typage des actants s&#233;mantiques
</p>
<p>Le type de repr&#233;sentation s&#233;mantique que nous sugg&#233;rons ici permet de repr&#233;senter de fa&#231;on
assez naturelle le typage des actants s&#233;mantiques. Si on souhaite restreindre la combinatoire
s&#233;mantique d&#8217;un pr&#233;dicat, on peut en &#233;tiqueter les actants dans la r&#232;gle de Gs&#233;m qui le construit.
Par exemple, si on veut que le pr&#233;dicat (habiter) ne puisse prendre comme premier actant qu&#8217;un
s&#233;mant&#232;me d&#233;notant une personne et comme deuxi&#232;me actant un s&#233;mant&#232;me qui d&#233;note un lieu,
il suffit de modifier la r&#232;gle (que nous avons d&#233;j&#224; vue &#224; la Figure 5) qui introduit ce s&#233;mant&#232;me
de la fa&#231;on illustr&#233;e &#224; la Figure 11.
</p>
<p>habiter
21
</p>
<p>personne lieu
</p>
<p>FIG. 11 &#8211; Le typage des actants s&#233;mantiques en GUST
</p>
<p>Sans avoir acc&#232;s &#224; la d&#233;composition du sens, le premier actant de (habiter) ne pourrait pas,
par exemple, &#234;tre (rousse(N)) puisque l&#8217;&#233;tiquette (personne) du n&#339;ud en Figure 11 ne peut pas
directement s&#8217;unifier avec l&#8217;&#233;tiquette (rousse(N)). Par contre, avec les r&#232;gles que nous avons
pr&#233;sent&#233;es, puisque (personne) est le genre prochain de (femme), qui lui-m&#234;me est le genre
prochain de (rousse(N)), ce dernier pourra, gr&#226;ce &#224; la r&#232;gle de propagation des gouverneurs, &#234;tre
le premier actant de (habiter), sans qu&#8217;il ne soit n&#233;cessaire d&#8217;activer une quelconque proc&#233;dure
additionnelle ou de faire appel &#224; une structure de donn&#233;e s&#233;par&#233;e qui encode une hi&#233;rarchie des
types s&#233;mantiques. Comme on peut l&#8217;observer &#224; la Figure 10b, le formalisme permet en effet
de v&#233;rifier que (personne) est une composante centrale du premier actant de (habiter), et ce peu
</p>
<p>170</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une formalisation des d&#233;compositions s&#233;mantiques dans GUST
</p>
<p>importe &#224; quelle &#171; profondeur &#187; se trouve enfouie cette composante dans le sens de l&#8217;actant.
Bien entendu, puisque nous n&#8217;avons pas fourni dans nos r&#232;gles la d&#233;composition s&#233;mantique de
(Toronto), le m&#233;canisme ne pourrait pas fonctionner pour le deuxi&#232;me actant et (habiter), tel que
d&#233;fini ici, ne pourrait pas se combiner &#224; (Toronto). Mais si nous compl&#233;tons notre grammaire
pour fournir la d&#233;composition de ce s&#233;mant&#232;me, (habiter) pourra l&#8217;accepter comme deuxi&#232;me
actant puisque (Toronto) &#8835; (ville) &#8835; (lieu).
Insistons sur le fait que le formalisme n&#8217;oblige pas &#224; typer les actants d&#8217;un s&#233;mant&#232;me. On peut
tr&#232;s bien ne pas &#233;tiqueter les actants dans les r&#232;gles qui introduisent les s&#233;mant&#232;mes pr&#233;dicatifs
sans que n&#8217;en souffre la grammaire. Le mod&#232;le permet alors de mettre en correspondance des
phrases absurdes avec des repr&#233;sentations s&#233;mantiques formellement correctes, mais difficiles
&#224; interpr&#233;ter. Revient-il &#224; la grammaire de rejeter de tels &#233;nonc&#233;s ? D&#8217;un c&#244;t&#233;, il est vrai que la
langue permet d&#8217;exprimer m&#234;me des id&#233;es absurdes ou contradictoires. Si la grammaire n&#8217;est
qu&#8217;un mod&#232;le fonctionnel de la langue, alors elle doit permettre de telles phrases. Le typage des
actants risque, sans m&#233;canisme appropri&#233;6, de rendre la grammaire trop rigide pour permettre
les &#233;carts et glissements s&#233;mantiques. D&#8217;un autre c&#244;t&#233;, le typage des actants semble mod&#233;liser
une certaine connaissance que les locuteurs ont des sens de la langue. De fait, dans le cadre
de la TST, Mel&#8217;c&#780;uk et Polgu&#232;re n&#8217;h&#233;sitent pas &#224; y avoir recours dans leur base de donn&#233;es
lexicales DiCo (Polgu&#232;re, 2003). En outre, cela peut s&#8217;av&#233;rer utile pour diverses applications,
notamment en linguistique computationnelle (par exemple pour valider une analyse incertaine).
Enfin, la question d&#233;passe le cadre de notre expos&#233;, mais quoi qu&#8217;il en soit, le formalisme permet
d&#8217;impl&#233;menter, au moins dans une certaine mesure, les deux solutions : le linguiste choisira &#224;
sa guise de typer ou non les actants des pr&#233;dicats qu&#8217;il d&#233;crit dans la grammaire de bonne
formation s&#233;mantique.
</p>
<p>6 Conclusion
</p>
<p>Le type de r&#232;gle que nous proposons permet, sans aucune proc&#233;dure particuli&#232;re et sans avoir &#224;
ajouter ni nouveau module ni nouvelle polarit&#233; au mod&#232;le, de trouver automatiquement toutes
les r&#233;ductions possibles pour une repr&#233;sentation s&#233;mantique donn&#233;e, et donc toutes ses dif-
f&#233;rentes expressions. Nous avons illustr&#233; le fonctionnement de ces r&#232;gles en synth&#232;se, mais
elles fonctionnent &#233;galement en analyse. Elles fournissent alors, pour l&#8217;&#233;nonc&#233; analys&#233;, non
seulement sa repr&#233;sentation s&#233;mantique r&#233;duite, mais &#233;galement sa d&#233;composition compl&#232;te
ainsi que toutes les d&#233;compositions interm&#233;diaires. Cette caract&#233;ristique du formalisme pro-
pos&#233; peut s&#8217;av&#233;rer fort int&#233;ressante notamment en traduction automatique, puisque la traduction
des lex&#232;mes et des sens grammaticaux doit souvent &#234;tre approximative, ce qui demande d&#8217;avoir
acc&#232;s &#224; la d&#233;composition des sens.
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224; remercier les relecteurs anonymes pour leurs commentaires constructifs ainsi que
Dominique Longin pour son aide pr&#233;cieuse lors de l&#8217;&#233;dition de la version finale de cette article.
</p>
<p>6(Pustejovsky, 1995) propose justement de tels m&#233;canismes.
</p>
<p>171</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois LAREAU
</p>
<p>R&#233;f&#233;rences
KAHANE S. (2001). Grammaires de d&#233;pendance formelles et th&#233;orie sens-texte : Tutoriel.
In D. MAUREL, Ed., Actes de TALN 2001 (Traitement automatique des langues naturelles),
volume 2, p. 17&#8211;76, Tours : ATALA.
KAHANE S. (2002). Grammaire d&#8217;Unification Sens-Texte : vers un mod&#232;le math&#233;matique
articul&#233; de la langue. Th&#232;se d&#8217;habilitation &#224; diriger des recherches, Universit&#233; Paris 7.
KAHANE S. (2004). Grammaires d&#8217;unification polaris&#233;es. In P. BLACHE, Ed., Actes de TALN
2004 (Traitement automatique des langues naturelles), p. 233&#8211;242 : ATALA LPL.
KAHANE S. &amp; LAREAU F. (2005). Grammaire d&#8217;unification sens-texte : modularit&#233; et pola-
risation. In Actes de TALN 2005 (Traitement automatique des langues naturelles), p. 23&#8211;32,
Dourdan : ATALA LIMSI.
MEL&#8217;C&#780;UK I. (1988). Semantic description of lexical units in an explanatory combinatorial
dictionary : basic principles and heuristic criteria. International Journal of Lexicography, 1,
165&#8211;88.
MEL&#8217;C&#780;UK I. (1989). Semantic primitives from the viewpoint of the meaning-text linguistic
theory. Quaderni di semantica, 10, 65&#8211;102.
MEL&#8217;C&#780;UK I. (1997). Vers une Linguistique Sens-Texte : Le&#231;on inaugurale au Coll&#232;ge de
France. Paris : Coll&#232;ge de France.
MILIC&#769;EVIC&#769; J. (sous presse). Mod&#233;lisation de la paraphrase langagi&#232;re. Bern : Peter Lang.
POLGU&#200;RE A. (2003). &#201;tiquetage s&#233;mantique des lexies dans la base de donn&#233;es dico. Trai-
tement automatique des langues, 44(2), 39&#8211;68.
PUSTEJOVSKY J. (1995). The generative lexicon. Cambridge / London : The MIT Press.
WIERZBICKA A. (1996). Semantics : primes and universals. Oxford : Oxford University
Press.
</p>
<p>172</p>

</div></div>
</body></html>