<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mod&#233;lisation des paradigmes de flexion des verbes arabes selon la norme LMF - ISO 24613</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Mod&#233;lisation des paradigmes de flexion des verbes arabes 
selon la norme LMF - ISO 24613 
</p>
<p>A&#239;da KHEMAKHEM1, Bilel GARGOURI1,
Abdelhamid ABDELWAHED2, Gil FRANCOPOULO3
</p>
<p>1 Laboratoire MIRACL,  FSEG-SFAX B.P. 1088, 3018 SFAX &#8211; TUNISIE 
2 Unit&#233; de recherche LSCA, FLSH-SFAX B.P. 553, 3018 SFAX &#8211; TUNISIE,  
</p>
<p>3 INRIA-Loria
khemakhem.aida@gnet.tn, Bilel.Gargouri@fsegs.rnu.tn 
</p>
<p>abdelhamid.abdelwahed@yahoo.fr, gil.francopoulo@wanadoo.fr 
</p>
<p>R&#233;sum&#233;. Dans cet article, nous sp&#233;cifions les paradigmes de flexion des verbes arabes en 
respectant la version 9 de LMF (Lexical Markup Framework), future norme ISO 24613 qui 
traite de la standardisation des bases lexicales. La sp&#233;cification de ces paradigmes se fonde 
sur une combinaison des racines et des sch&#232;mes. En particulier, nous mettons en relief les  
terminaisons de racines sensibles aux ajouts de suffixes et ce, afin de couvrir les situations 
non consid&#233;r&#233;es dans les travaux existants. L&#8217;&#233;laboration des paradigmes de flexion verbale 
que nous proposons est une description en intension d'ArabicLDB (Arabic Lexical DataBase) 
qui est une base lexicale normalis&#233;e pour la langue arabe. Nos travaux sont illustr&#233;s par la 
r&#233;alisation d&#8217;un conjugueur des verbes arabes &#224; partir d'ArabicLDB.
</p>
<p>Abstract. In this paper, we specify the inflected paradigms of Arabic verbs with respect to 
the version 9 of LMF (Lexical Markup Framework) which is the expected ISO 24613 
standard dealing with the standardisation of lexical databases. The specification of these 
paradigms is based on a combination of schemes and roots. In particular, we highlight the role 
of root endings that is not considered in other researches and that may generate erroneous 
forms while concatenating suffixes. The development of verbal inflected paradigms that we 
propose is an intentional component of ArabicLDB (Arabic Lexical DataBase) which is a 
normalized Arabic lexical database that we developed according to LMF. Our works are 
illustrated by the realization of a conjugation tool for Arabic verbs using ArabicLDB.
</p>
<p>Mots-cl&#233;s : langue arabe, paradigmes de flexion verbale, base lexicale, norme ISO 24613, 
LMF, lexical markup framework, conjugueur des verbes arabes.
</p>
<p>Keywords: Arabic, inflected paradigms of verb, lexical database, norm ISO 24613, LMF, 
lexical markup framework, conjugation of arabic verbs. 
</p>
<p>1 Introduction 
L&#8217;arabe est une langue &#224; la fois d&#233;rivationnelle et flexionnelle (Blach&#232;re et al, 1975). Elle se 
caract&#233;rise par une morphologie assez complexe &#224; la mani&#232;re de la conjugaison de ses verbes 
</p>
<p>133</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Khemakhem A&#207;DA, Gargouri BILEL, Abdelwahed ABDELHAMID, Francopoulo GIL
</p>
<p>qui g&#233;n&#232;re plusieurs formes fl&#233;chies variant d&#8217;un verbe &#224; un autre. Ainsi, s&#8217;accro&#238;t le besoin 
de mod&#233;liser les paradigmes de flexion de l&#8217;arabe afin de limiter l&#8217;espace de repr&#233;sentation 
des formes fl&#233;chies lors de la construction d&#8217;une base lexicale.
</p>
<p>Dans le pr&#233;sent papier, nous nous int&#233;ressons &#224; la mod&#233;lisation des paradigmes de flexion des 
verbes arabes en vue de construire une description en intension des verbes dans une base 
lexicale. Nos investigations sont fond&#233;es sur les principaux travaux existants dans ce domaine 
(El-Dahdah, 1999), (Ammar et al, 1999), (Abdelwaheh, 1996) et (Ibn elqataa, 2003). 
</p>
<p>Ces travaux classent les verbes selon des crit&#232;res qui se fondent sur les consonnes sensibles &#224; 
la modification des voyelles voisines. N&#233;anmoins, nous avons pris en consid&#233;ration certains 
cas li&#233;s &#224; l&#8217;ajout d&#8217;un suffixe qui peuvent engendrer des formes erron&#233;es. Partant de cette 
constatation, nous proposons d&#8217;adapter la classification des racines selon les besoins du 
traitement automatique en vue de couvrir des cas omis dans la quasi-totalit&#233; des travaux sur le 
sujet.
</p>
<p>En ce qui concerne la mod&#233;lisation et la r&#233;alisation, nous profitons du travail en cours au sein 
de l&#8217;ISO de la sp&#233;cification LMF (Lexical Markup Framework) (Francopoulo, 2003) qui 
propose une repr&#233;sentation lexicale standard pour les langues les plus utilis&#233;es tout en 
couvrant, entre autres, la repr&#233;sentation des paradigmes de flexion.  Ce projet est en cours de 
validation par le comit&#233; TC37/SC4 de l&#8217;ISO sous la r&#233;f&#233;rence ISO-24613 (Francopoulo, 
2006). Comme illustration de l&#8217;application de LMF sur le cas de la langue arabe, nous 
pr&#233;sentons la base ArabicLDB qui se limite dans sa version actuelle &#224; la repr&#233;sentation du 
niveau morphologique (Khemakhem et al, 2006), (Khemakhem, 2006).  
</p>
<p>Le pr&#233;sent travail est r&#233;alis&#233; selon les recommandations de la version 9 de LMF appliqu&#233;es &#224; 
la base ArabicLDB repr&#233;sentant une description des paradigmes de flexion verbale. 
</p>
<p>Dans la premi&#232;re partie, nous pr&#233;sentons les travaux actuels de mod&#233;lisation des paradigmes 
de flexion des verbes arabes. Ensuite, nous donnerons une id&#233;e sur le projet de normalisation 
LMF, en s&#8217;int&#233;ressant en particulier &#224; l&#8217;extension des paradigmes de flexion. Dans la section 
suivante, nous pr&#233;senterons la mod&#233;lisation des paradigmes verbaux de la langue arabe selon 
LMF. Puis nous sp&#233;cifierons les verbes types de la langue arabe. Enfin, nous terminerons par 
l&#8217;impl&#233;mentation des paradigmes de la base ArabicLDB avec un descriptif du conjugueur 
r&#233;alis&#233;.
</p>
<p>2 Aper&#231;u sur les travaux de mod&#233;lisation des paradigmes des 
verbes arabes 
</p>
<p>2.1 Caract&#233;ristiques des verbes arabes 
Dans la langue arabe, il y a plus de 16 000 verbes. Un verbe peut avoir 109 formes fl&#233;chies 
quand il admet &#224; la fois la voix active et passive et 57 formes fl&#233;chies (FF) lorsqu&#8217;il n&#8217;admet 
que la voix active (Ammar et al, 1999). En g&#233;n&#233;ral, les verbes sont des formes d&#233;riv&#233;es &#224; 
partir d&#8217;une racine et d&#8217;un sch&#232;me. La racine est purement consonantique qui peut &#234;tre form&#233;e 
soit par trois consonnes formant des verbes trilit&#232;res, soit par quatre consonnes formant des 
verbes quadrilit&#232;res. Le sch&#232;me peut &#234;tre consid&#233;r&#233; comme une repr&#233;sentation formelle 
constitu&#233;e par 3 ou 4 consonnes (&#977; ,&#969; ,&#989; ) qui sont totalement vocalis&#233;es, ou comme un moule 
sur laquelle coule la racine (Baloul, 2003). En totalit&#233;, il y a 19 sch&#232;mes verbaux qui peuvent 
&#234;tre soit nus, soit augment&#233;s d&#233;rivant de trois consonnes de la racine par modification des 
voyelles, par redoublement de la deuxi&#232;me lettre de la racine, par adjonction et m&#234;me par 
</p>
<p>134</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des paradigmes de flexion verbes arabes selon la norme LMF - ISO 24613 
</p>
<p>intercalation d&#8217;affixes (pr&#233;fixe, infixe, suffixe). Les verbes augment&#233;s se conjuguent avec les 
m&#234;mes pr&#233;fixes et suffixes que le verbe sans augment. De ce fait, une racine peut g&#233;n&#233;rer au 
maximum 19 verbes et les sch&#232;mes correspondants peuvent donner 22 mod&#232;les de 
conjugaison diff&#233;rents. En effet, il y a le sch&#232;me &#990;&#756;&#972;&#756;&#979;&#756; [fa&#8217;ala] qui peut avoir trois alternances 
diff&#233;rentes de conjugaison selon la nature de la voyelle de la 2e consonne de la racine de 
l&#8217;inaccompli &#990;&#757;&#972;&#757;&#980;&#760;&#1011;&#756; [yaf&#8217;ulu], &#990;&#757;&#972;&#758;&#980;&#760;&#1011;&#756; [yaf&#8217;ilu], et &#972;&#756;&#980;&#760;&#1011;&#756;&#990;&#757; [yaf&#8217;alu]. En plus, le sch&#232;me &#990;&#756;&#972;&#758;&#979;&#756; [fa&#8217;ila] peut 
donner deux alternances diff&#233;rentes de conjugaison pour la m&#234;me raison (El-Dahdah, 1999). 
</p>
<p>La conjugaison d&#8217;un verbe arabe consiste &#224; engendrer l&#8217;ensemble des formes que peut prendre 
ce verbe &#224; la voix active ou passive. Ces formes varient selon le mode et l&#8217;aspect (accompli, 
inaccompli indicatif, inaccompli subjonctif, inaccompli apocop&#233; et l&#8217;imp&#233;ratif), comme elles 
varies selon le nombre (singulier, duel, pluriel) et le genre (masculin, f&#233;minin). Elles varient 
aussi selon la personne ou les personnes repr&#233;sent&#233;es par le sujet : &#912;&#760;&#920;&#756;&#987;&#756;&#917;&#757;[katabtu], &#912;&#760;&#920;&#756;&#987;&#756;&#910;&#996;&#756;&#919;&#757;
[katbtum&#226;]&#8230;
</p>
<p>G&#233;n&#233;ralement, les r&#232;gles de conjugaison d&#8217;un verbe arabe peuvent engendrer les 
modifications suivantes : le changement des voyelles, l&#8217;ajout d&#8217;un pr&#233;fixe ou d&#8217;un suffixe, et 
la suppression d&#8217;un hamza wasliya au d&#233;but ou d&#8217;une voyelle &#224; la fin. De plus, ces 
modifications peuvent avoir recours &#224; des r&#232;gles phonologiques qui op&#232;rent sur certaines 
formes verbales particuli&#232;res. 
</p>
<p>2.2 Les principales propositions du domaine
</p>
<p>Les travaux sur la langues arabe sont tr&#232;s nombreux mais tr&#232;s dispers&#233;s compar&#233;s &#224; ceux 
d&#8217;autres langues comme l&#8217;anglais ou le fran&#231;ais. Parmi les principaux travaux sur les verbes 
arabes, nous citons &#171; &#916;&#1012;&#759;&#913;&#942;&#972;&#991;&#909; &#989;&#910;&#972;&#979;&#1015;&#909; &#978;&#1011;&#942;&#956;&#919; &#994;&#928;&#972;&#995; &#187; (El-Dahdah, 1999), &#171; Les verbes arabes &#187;
(Ammar et al, 1999), &#171; &#990;&#972;&#980;&#758;&#991;&#909; &#916;&#1012;&#1000;&#913;&#758;. &#1010;&#913;&#942;&#972;&#991;&#909; &#978;&#1011;&#942;&#956;&#920;&#991;&#909; &#1010;&#979; &#915;&#751;&#909;&#942;&#756;&#983;&#758; &#187; (Abdelwaheh, 1996) et &#171;&#985;&#917;&#909;&#911;
&#909;&#989;&#899;&#977;&#969;&#909;&#989; &#187; (Ibn elqataa, 2003) qui traitent un nombre important de verbes, mais qui sont 
destin&#233;s &#224; une utilisation manuelle.  
</p>
<p>Signalons que les travaux sur les verbes poss&#232;dent quelques points communs, comme la 
distribution des verbes et la d&#233;termination de leur nature, ainsi que l&#8217;id&#233;e principale qui 
consiste &#224; traiter les r&#232;gles phonologiques comme des r&#232;gles de conjugaison ou 
morphologique. Selon ces auteurs, les causes de d&#233;clenchement des r&#232;gles phonologiques sont 
limit&#233;es par la nature des consonnes de la racine. Ce qui a pour effet de d&#233;terminer un 
classement des paradigmes de flexion et des verbes. Selon cette optique, deux principales 
classes de verbe sont distingu&#233;es: les verbes sains (&#953;&#929;&#1009;&#929;) qui ne comportent pas de lettres 
d&#233;fectueuses, et les verbes d&#233;fectueux (&#990;&#759;&#920;&#972;&#995;) qui contiennent une ou deux lettres d&#233;fectueuses 
causant des alt&#233;rations importantes au cours de la conjugaison. Un verbe sain peut contenir la 
lettre hamza ou &#353;adda qui peut engendrer des conjugaisons irr&#233;guli&#232;res.
</p>
<p>Bien qu&#8217;il y ait des points communs, les diff&#233;rences impliquent des cons&#233;quences importantes 
pour la repr&#233;sentation et la couverture : Ammar traite seulement 10 000 verbes, alors que El-
Dahdah traite plus de 16 000 des verbes arabes. Notons que ce dernier auteur couvre la 
plupart des verbes quadrilit&#232;res ainsi que les verbes trilit&#232;res rarement utilis&#233;s. 
</p>
<p>La complexit&#233; morphologique de la langue arabe est constat&#233;e entre autres dans l&#8217;utilisation 
des r&#232;gles phonologiques au cours du calcul d&#8217;une forme fl&#233;chie. Par cons&#233;quent, les 
linguistes ont propos&#233; la classification des verbes selon la racine et ils ont valoris&#233; les 
consonnes (la lettre hamza, les lettres d&#233;fectueuses ou le signe &#353;adda) sensibles aux 
changements de leurs voyelles (pr&#233;c&#233;dente et suivante). Cependant, l&#8217;automatisation directe 
</p>
<p>135</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Khemakhem A&#207;DA, Gargouri BILEL, Abdelwahed ABDELHAMID, Francopoulo GIL
</p>
<p>3.2 Le module d&#8217;extension des paradigmes de flexion 
</p>
<p>Le module des paradigmes propos&#233; dans LMF est une description simple des modifications 
qui sont apport&#233;es au lemme pour calculer toutes les formes fl&#233;chies d&#8217;une entr&#233;e lexicale. 
</p>
<p>de cette classification, peut nous donner des formes erron&#233;es. Pour &#233;viter l&#8217;apparition de ces 
formes, il faut valoriser les consonnes sensibles &#224; l&#8217;ajout d&#8217;un suffixe (les terminaisons qui 
peuvent &#234;tre fusionn&#233;es avec la premi&#232;re consonne du suffixe) (Khemakhem, 2006). 
</p>
<p>Lemme             &#997;&#756;&#944;&#756;&#931;&#756;  [hazana]
Forme Fl&#233;chie interm&#233;diaire avec  &#998;&#841;&#1003;&#757; &#998;&#756;&#999;&#760;&#944;&#756;&#931;&#756;
</p>
<p>Forme Fl&#233;chie finale avec &#998;&#841;&#1003;&#757; &#997;&#841;&#944;&#756;&#931;&#756; [hazanna]
</p>
<p>Figure 1 : Exemple de fusion d&#8217;une terminaison et suffixe utilisant une r&#232;gle phonologique 
</p>
<p>Dans cet exemple, si ce verbe est trait&#233; comme les autres verbes sains, la forme interm&#233;diaire 
&#171; &#998;&#756;&#999;&#760;&#944;&#756;&#931;&#756; &#187; [hazanna] sera une forme erron&#233;e qui n&#233;cessitera l&#8217;intervention d&#8217;une r&#232;gle 
phonologique pour donner la forme finale &#171; &#997;&#841;&#944;&#756;&#931;&#756; &#187; [hazanna].
</p>
<p>3 LMF : future norme ISO 24613  
</p>
<p>3.1 Pr&#233;sentation g&#233;n&#233;rale
</p>
<p>LMF (Lexical Markup Framework) est un projet en cours de validation par le  sous comit&#233; 
TC-37/SC-4 de l&#8217;ISO sous la r&#233;f&#233;rence ISO-24613. Le projet traite de la normalisation des 
bases lexicales &#224; large couverture (Francopoulo et al, 2006). Ce projet est n&#233; du besoin 
exprim&#233; par les diff&#233;rentes d&#233;l&#233;gations nationales de pouvoir repr&#233;senter, &#233;changer et 
fusionner les bases lexicales actuelles et futures. Notons que le besoin de fusion est celui qui 
est le plus souvent exprim&#233;. La totalit&#233; de LMF est sp&#233;cifi&#233;e &#224; l&#8217;aide d&#8217;UML (Unified 
Modeling Language) qui s&#8217;impose maintenant comme le standard de mod&#233;lisation des 
structures. Le format d&#8217;&#233;change est d&#233;fini en XML. 
</p>
<p>Un lexique LMF doit comporter une partie noyau et un ou plusieurs modules d&#8217;extension qui 
sont sp&#233;cifi&#233;s par des &quot;packages&quot; UML. Le noyau traite des notions de lexique (en tant que 
conteneur), de mot, de forme et de sens. Le noyau est &#224; consid&#233;rer &#224; la fois comme le 
squelette du lexique et comme le d&#233;nominateur commun &#224; plusieurs lexiques, ce qui est 
essentiel pour les op&#233;rations de fusion. Le noyau est obligatoire. Autour de ce dernier, le 
cr&#233;ateur du lexique peut d&#233;finir des modules d&#8217;extension pour la morphologie, les paradigmes 
de flexion, la syntaxe, la s&#233;mantique et/ou les notations multilingues.  
</p>
<p>LMF d&#233;finit la structure du lexique mais n&#8217;en pr&#233;cise pas les d&#233;tails. La structure est d&#233;cor&#233;e 
par des couples attribut-valeur &#224; prendre dans un registre de cat&#233;gories de donn&#233;es (RCD) qui 
est g&#233;r&#233; par l&#8217;ISO dans le cadre de l&#8217;ISO-12620 (http://syntax.inist.fr/) (Romary et al, 2003). 
</p>
<p>Ainsi, LMF permet deux axes de variation : d&#8217;une part le choix des modules d&#8217;extension et 
d&#8217;autre part le choix des cat&#233;gories de donn&#233;es. Par exemple, un gestionnaire de lexique de 
morphologie n&#8217;aura pas &#224; s&#8217;embarrasser des m&#233;canismes descriptifs de la syntaxe, s&#8217;il n&#8217;en 
&#233;prouve pas le besoin. De m&#234;me, ce m&#234;me gestionnaire s&#233;lectionnera les valeurs /masculine/ 
et /feminine/ pour le fran&#231;ais alors qu&#8217;il choisira /masculine/, /feminine/ et /neuter/ pour 
l&#8217;allemand. 
</p>
<p>136</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des paradigmes de flexion verbes arabes selon la norme LMF - ISO 24613 
</p>
<p>/, /addAfter/, /remove/, 
/removeAfter/, /removeBefore/, /substitute/, /copy/) qui sont li&#233;es &#224; un calculateur de forme 
Cette description utilise huit op&#233;rations (/add/, /addBefore
</p>
<p>fl&#233;chie sp&#233;cifique &#224; une combinaison de traits morphologiques (Francopoulo et al, 2006). 
</p>
<p>Figure 2 : L&#8217;extension des paradigmes de flexion selon LMF 
</p>
<p>Les paradigmes de flexion comportent plusieurs instances de la classe Morphological
FeaturesCombinator. Ces derni&#232;res sont relatives &#224; une classe abstraite qui fa t le lien entre 
des traits morph regroupent des 
Operations et des OperationArguments permettant de calculer les FF correspondantes.
</p>
<p>e &#224; la 
r&#233;vision 9 de la future norme LMF. Elle est impl&#233;ment&#233;e en XML en respectant la DTD 
</p>
<p>t al, 2006). Le choix a &#233;t&#233; pris de d&#233;crire 
explicitement toutes les FF des noms et de d&#233;crire les verbes en intension &#224; l&#8217;aide des 
</p>
<p>e cat&#233;gories de donn&#233;es est s&#233;lectionn&#233; &#224; partir du RCD quand c&#8217;&#233;tait 
possible. Certaines valeurs sont absentes du registre actuel. Nous les avons utilis&#233;es et test&#233;s, 
</p>
<p>distinctes (&#994;&#760;&#987;&#756; : pronom )). En contrepartie, des 
</p>
<p>i
ologiques et un ou plusieurs InflectedFormCalculators qui
</p>
<p>4 La base lexicale ArabicLDB   
ArabicLDB (Khemakhem, 2006) est une nouvelle base lexicale arabe, qui est conform
</p>
<p>propos&#233;e dans cette r&#233;vision (Francopoulo e
</p>
<p>paradigmes de flexion. 
</p>
<p>Les entr&#233;es lexicales d&#8217;ArabicLDB peuvent &#234;tre des formes d&#233;riv&#233;es (nominales ou verbales), 
des noms non d&#233;riv&#233;s et des particules, qui sont totalement vocalis&#233;es. Pour chaque partie du 
discours, un ensemble d
</p>
<p>puis, nous avons demand&#233; leur ajout dans le registre de l&#8217;ISO. 
</p>
<p>Figure 3 : Exemple d&#8217;une entr&#233;e  lexicale 
</p>
<p>Les entr&#233;es lexicales portent un identifiant et l&#8217;information de partie du discours. Ce choix 
implique la cr&#233;ation de deux entr&#233;es pour des formes identiques &#224; parties de discours 
</p>
<p>: LexicalEntry
Root = &quot;&#945; &#989; &#993;&quot;
Scheme = &quot;&#990;&#760;&#972;&#758;&#980;&#760;&#995;&#757;&quot;
POS = communNoun
</p>
<p>: LemmatisedForm
wordForm= &quot;&#994;&#760;&#992;&#758;&#948;&#760;&#995;&#757;&quot;
</p>
<p>interrogatif vs. &#994;&#760;&#987;&#756; : pronom allusif (&#916;&#1011;&#756;&#910;&#1000;&#756;&#987;&#758;
</p>
<p>137</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Khemakhem A&#207;DA, Gargouri BILEL, Abdelwahed ABDELHAMID, Francopoulo GIL
</p>
<p>t/ et /scheme/ comme des couples attribut-valeur de la 
classe LexicalEntry, qui est la classe permettant de repr&#233;senter la notion de mot. 
</p>
<p>t des entr&#233;es 
lexicales (plus de 16 000 verbe, 500 particules&#8230;). Pour l&#8217;exploitation, nous avons des 
</p>
<p>ots
ue sous 
</p>
<p>forme d&#8217;un prototype de conjugaison. Ils facilitent donc la maintenance et r&#233;duisent la taille 
</p>
<p>L&#8217;objectif de cette phase &#233;tait l&#8217;&#233;tude des consonnes qui d&#233;terminent une r&#232;gle phonologique. 
acines d&#233;j&#224; propos&#233;es dans la litt&#233;rature, nous les avons 
</p>
<p>pr&#233;cis&#233; en valorisant les terminaisons (les lettres  &#917; et &#997;) qui peuvent se fusionner avec la 
</p>
<p>qui peuvent se
</p>
<p>homonymes &#224; partie de discours identique (&#916;&#754;&#971;&#756;&#910;&#947;&#756; : une heure vs. &#916;&#754;&#971;&#756;&#910;&#947;&#756; : une montre) ne sont pas 
trait&#233;s dans deux entr&#233;es diff&#233;rentes. 
</p>
<p>Pour la langue arabe, le verbe et la plupart des noms sont identifi&#233;s par une racine et un 
sch&#232;me. En effet, nous utilisons /roo
</p>
<p>Actuellement, nous avons un outil d&#8217;alimentation de cette base et d&#8217;autres outils pour 
l&#8217;exploitation. Nous avons des modules d&#8217;acquisition des paradigmes (256) e
</p>
<p>modules de recherche et de conjugaison des verbes. 
</p>
<p>5 Les paradigmes de flexion verbale de l&#8217;arabe selon LMF
Les paradigmes de flexion sont des repr&#233;sentations communes &#224; un grand nombre de m
dans une optique de description en intention. Ils factorisent la connaissance linguistiq
</p>
<p>de la base de donn&#233;es. Cependant, le chevauchement entre les diff&#233;rents niveaux linguistiques 
dans la langue arabe, notamment morphologique et phonologique, et l&#8217;absence de la 
phonologie dans la norme, montrent que ces paradigmes n&#233;cessitent une investigation tr&#232;s 
d&#233;taill&#233;e. En effet, nous suivons une d&#233;marche qui proc&#232;de en trois &#233;tapes: la classification, 
l&#8217;identification des verbes types et l&#8217;application des op&#233;rations (selon LMF). 
</p>
<p>5.1 Classification des verbes  
</p>
<p>Apr&#232;s l&#8217;&#233;tude des classifications des r
</p>
<p>premi&#232;re consonne du suffixe. La Figure 4 donn&#233;e ci-apr&#232;s, illustre la consid&#233;ration des 
terminaisons lors de la classification des verbes. Dans cette figure, la sous classe des verbes 
sains (&#994;&#991;&#758;&#910;&#947;&#756; &#760;) sera constitu&#233;e de trois sous classes : la premi&#232;re (*) regroupe les verbes qui ne se 
terminent ni par la lettre &#917; ni par la lettre &#997;, la deuxi&#232;me (#&#997;) regroupe les verbes ayant la 
terminaison &#997; et la troisi&#232;me (#&#917;) regroupe les verbes ayant la terminaison &#917;.
</p>
<p>Figure 4 : R&#244;le des terminaisons dans la classification des verbes
</p>
<p>En r&#233;sultat, nous avons d&#233;gag&#233; 42 classes de racines verbales en consid&#233;rant les terminaisons
 fusionner avec la premi&#232;re consonne du suffixe. 
</p>
<p>&#990;&#754;&#920;&#756;&#972;&#760;&#995;&#757; &#990;&#754;&#972;&#760;&#979;&#758; &#932;&#758;&#955;&#756; &#990;&#754;&#972;&#760;&#979;&#758;&#930;&#760;&#1012;
</p>
<p>&#8230;      &#8230;    ...  &#8230; 
</p>
<p>&#990;&#972;&#760;&#980;&#758;&#991;&#909;
</p>
<p>&#994;&#991;&#758;&#910;&#947;&#756;&#760; &#978;&#760;&#971;&#756;&#910;&#960;&#756;&#995;&#757; &#943;&#760;&#1006;&#996;&#757;&#1004;&#760;&#995;&#756;
</p>
<p>&#8230;&#8230;.... &#8230;&#8230;.... &#917; # &#997;#   * 
</p>
<p>138</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des paradigmes de flexion verbes arabes selon la norme LMF - ISO 24613 
</p>
<p>5.2 Identification des verbes types
</p>
<p>Le mod&#232;le LMF n&#8217;a pas d&#8217;extension phonologique, ce qui nous am&#232;ne &#224; traiter les 
transformations phonologiques comme des flexions morphologiques. Et nous n&#8217;avons pas que 
22 mod&#232;les de conjugaison puisqu&#8217;il faut consid&#233;rer les diff&#233;rents types de racine possibles. 
</p>
<p>Par ailleurs, nous avons combin&#233; les mod&#232;les de conjugaison (les 22 classes de sch&#232;me) et les 
classes de racine. Ensuite, nous avons optimis&#233; les r&#233;sultats pour &#233;viter la redondance des 
paradigmes et l&#8217;apparition de paradigmes superflus: il y a des sch&#232;mes qui rev&#234;tent un sens 
assez particulier et qui sont utilis&#233;s uniquement avec quelques classes de racine. 
</p>
<p>Classification des 
racines (42)
</p>
<p>Classification des 
sch&#232;mes (22)
</p>
<p>Combinaison
</p>
<p>Filtrage 
</p>
<p>256 paradigmes
</p>
<p>s
c
h
&#233;
m
e
</p>
<p>Classe de racine 
</p>
<p>Figure 5 : D&#233;marche de pr&#233;paration des paradigmes verbaux 
</p>
<p>Apr&#232;s la combinaison et l&#8217;optimisation des combinaisons des classes de racine et des classes 
de sch&#232;me, nous avons trouv&#233; 256 paradigmes qui correspondrent aux verbes types 
(Khemakhem, 2006). 
</p>
<p>5.3 Application des op&#233;rations propos&#233;es par LMF pour le cas de l&#8217;arabe
</p>
<p>Dans cette section, il s&#8217;agit d&#8217;&#233;tudier la couverture de toutes les transformations possibles au 
cours de la conjugaison des verbes par les op&#233;rations propos&#233;es par LMF. 
</p>
<p>Nous rappelons que les r&#232;gles de conjugaison d&#8217;un verbe arabe peuvent engendrer les 
modifications suivantes : le changement des voyelles, l&#8217;ajout d&#8217;un pr&#233;fixe ou d&#8217;un suffixe, et 
la suppression d&#8217;un hamza wasliya au d&#233;but ou une voyelle &#224; la fin. Nous avons utilis&#233; les 
op&#233;rations propos&#233;es dans LMF pour appliquer les r&#232;gles de conjugaison de l&#8217;arabe. Comme 
illustration, nous pr&#233;sentons dans la Figure 6, l&#8217;exemple de calcul de la forme fl&#233;chie 
&#171; &#990;&#757;&#914;&#758;&#984;&#760;&#920;&#756;&#948;&#760;&#1011;&#756; &#187; [yastaqbilu] &#224; partir du lemme &#171; &#990;&#756;&#914;&#756;&#984;&#760;&#920;&#756;&#947;&#760;&#909;&#758; &#187; [istaqbala]. 
Nous avons encore des cas particuliers qui n&#233;cessitent des modifications particuli&#232;res li&#233;es &#224; 
l&#8217;application des r&#232;gles phonologiques. Ces modifications sont :  
x la transformation de la graphie de hamza, ce qui n&#233;cessite parfois les op&#233;rations de 
</p>
<p>remplacement substitute ou de suppression remove.
x la transformation des lettres d&#233;fectueuses, ce qui n&#233;cessite parfois les op&#233;rations de 
</p>
<p>remplacement substitute ou de suppression remove.
x la transformation de &#353;adda qui peut &#234;tre supprim&#233; par remove, la consonne 
</p>
<p>impliqu&#233;e dupliqu&#233;e par copy. De plus, des voyelles peuvent &#234;tre ajout&#233;es par add.
x la fusion du suffixe avec la derni&#232;re consonne de la racine &#997; ou &#917;. Elle est assur&#233;e 
</p>
<p>par la suppression remove d&#8217;une consonne avec sa voyelle et l&#8217;ajout add de &#353;adda.
</p>
<p>139</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Khemakhem A&#207;DA, Gargouri BILEL, Abdelwahed ABDELHAMID, Francopoulo GIL
</p>
<p>Lemme :                   &#990;&#756;&#914;&#756;&#984;&#760;&#920;&#756;&#947;&#760;&#909;&#758;   CvCvCvCvCvCv     [istaqbala]  
       addBefore(&#1417;)&#756;
</p>
<p>                       &#1011;&#756;&#990;&#756;&#914;&#756;&#984;&#760;&#920;&#756;&#947;&#760;&#910;&#758;   P(&#1417;)&#756; +CvCvCvCvCvCv   [yaistaqbala] 
         remove (3,2) 
</p>
<p>             &#990;&#756;&#914;&#756;&#984;&#760;&#920;&#756;&#948;&#760;&#1011;&#756;   P(&#1417;)&#756; +CvCvCvCvCvCv   [yastaqbala] 
         removeAfter(1) 
    
            &#912;&#756;&#984;&#760;&#920;&#756;&#948;&#760;&#1011;&#756;&#989;  P(&#1417;)&#756; +CvCvCvCvCv   [yastaqbal] 
       addAfter( &#757; ) 
</p>
<p>             &#984;&#760;&#920;&#756;&#948;&#760;&#1011;&#756;&#990;&#757;&#914;&#756;  P(&#1417;)&#756; +CvCvCvCvC +S( &#757; )  [yastaqbalu]
          substitute(10, (  &#758;
</p>
<p>Forme fl&#233;chie :           &#990;&#757;&#914;&#758;&#984;&#760;&#920;&#756;&#948;&#760;&#1011;&#756;          P(&#1417;)&#756; +CvCvCvCvC+S(&#757; ) [yastaqbilu]
Figure 6 : Exemple d&#8217;un calcul d&#8217;une forme fl&#233;chie 
</p>
<p>D&#8217;apr&#232;s l&#8217;&#233;tude de tous les cas particuliers li&#233;s &#224; la phonologie, nous pouvons conclure que les 
op&#233;rations propos&#233;es par la norme LMF couvrent toutes les flexions de la langue arabe. 
</p>
<p>6 Elaboration de la base des paradigmes
</p>
<p>6.1 La base des paradigmes 
</p>
<p>Cette base comporte la description en XML des combinaisons des traits morphologiques pour 
chaque verbe type. Une interface appropri&#233;e a &#233;t&#233; mise en place pour faciliter la cr&#233;ation d&#8217;un 
paradigme de flexion. L&#8217;utilisateur peut choisir une combinaison et sp&#233;cifier les op&#233;rations en 
pr&#233;cisant les arguments associ&#233;s. Comme illustration, nous pr&#233;sentons, dans la Figure 7, 
l&#8217;exemple de &#171;  &#990;&#757;&#914;&#758;&#984;&#760;&#920;&#756;&#948;&#760;&#1011;&#756;&#187; [yastaqbilu] de la figure pr&#233;c&#233;dente. 
</p>
<p>&lt;Lexicon&gt;  &lt;InflectionalParadigm id=&quot;asIstaqbala&quot;&gt; 
&lt;MorphologicalFeaturesCombo&gt;&lt;MorphologicalFeature att=&quot;verbFormAspect&quot; val=&quot;unaccomplished&quot;/&gt; 
                    &lt;MorphologicalFeature att=&quot;verbFormMood&quot; val=&quot;indicative&quot; /&gt; 
</p>
<p>           &lt;MorphologicalFeature att=&quot;voice&quot; val=&quot;activeVoice&quot; /&gt; 
           &lt;MorphologicalFeature att=&quot;person&quot; val=&quot;thirdPerson&quot; /&gt; 
           &lt;MorphologicalFeature att=&quot;grammaticalNumber&quot; val=&quot;singular&quot; /&gt; 
           &lt;MorphologicalFeature att=&quot;grammaticalGender&quot; val=&quot;masculine&quot; /&gt; 
</p>
<p>      &lt;InflectedFormCalculator&gt;   &lt;DC att=&quot;stem&quot; val=&quot;0&quot; /&gt; 
        &lt;Operation&gt; &lt;DC att=&quot;graphicalOperator&quot; val=&quot;addBefore&quot; /&gt; 
              &lt;OperationArgument&gt; &lt;DC att=&quot;chain&quot; val=&quot;&#1009;&#756;&quot; /&gt;  &lt;/OperationArgument&gt;  &lt;/Operation&gt; 
         &lt;Operation&gt; &lt;DC att=&quot;graphicalOperator&quot; val=&quot;remove&quot; /&gt; 
              &lt;OperationArgument&gt; &lt;DC att=&quot;pos&quot; val=&quot;3&quot; /&gt;  
              &lt;OperationArgument&gt; &lt;DC att=&quot;number&quot; val=&quot;2&quot; /&gt;  &lt;/OperationArgument&gt;  &lt;/Operation&gt;   
         &lt;Operation&gt; &lt;DC att=&quot;graphicalOperator&quot; val=&quot;removeAfter&quot; /&gt; 
              &lt;OperationArgument&gt;  &lt;DC att=&quot;number&quot; val=&quot;1&quot; /&gt;  &lt;/OperationArgument&gt;  &lt;/Operation&gt; 
         &lt;Operation&gt; &lt;DC att=&quot;graphicalOperator&quot; val=&quot;addAfter&quot; /&gt; 
              &lt;OperationArgument&gt; &lt;DC att=&quot;chain&quot; val=&quot;&quot;&#757; /&gt;  &lt;/OperationArgument&gt; &lt;/Operation&gt; 
         &lt;Operation&gt; &lt;DC att=&quot;graphicalOperator&quot; val=&quot;substitute&quot; /&gt; 
              &lt;OperationArgument&gt; &lt;DC att=&quot;chain&quot; val=&quot;&quot;&#758; /&gt;  &lt;/OperationArgument&gt; 
              &lt;OperationArgument&gt; &lt;DC att=&quot;pos&quot; val=&quot;10&quot; /&gt; &lt;/OperationArgument&gt;   &lt;/Operation&gt; 
     &lt;/InflectedFormCalculator&gt;&lt;/MorphologicalFeaturesCombo&gt;&#8230; 
&lt;/InflectionalParadigm&gt;&#8230;..&lt;/Lexicon&gt;
</p>
<p>Figure 7 : Combinaison de traits morphologiques du paradigme du verbe&quot; &#990;&#756;&#914;&#756;&#984;&#760;&#920;&#756;&#947;&#760;&#909;&#758;&quot;
</p>
<p>140</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des paradigmes de flexion verbes arabes selon la norme LMF - ISO 24613 
</p>
<p>6.2 Le module d&#8217;extension morphologique de la base ArabicLDB 
</p>
<p>Apr&#232;s l&#8217;&#233;laboration des paradigmes qui se caract&#233;risent par un identifiant, nous pouvons 
sp&#233;cifier pour chaque verbe son paradigme de flexion au niveau du lemme. En plus, nous 
ajoutons une cat&#233;gorie de donn&#233;es /havePassive/ qui est sp&#233;cifique pour les verbes. Elle prend 
no si le verbe admet seulement la voix active et  yes si le verbe admet les deux voix. 
</p>
<p>&lt;lexicalEntry&gt;    &lt;DC att=&quot;root&quot; val=&quot;&#985; &#917; &#911;&quot; /&gt;
        &lt;DC att=&quot;scheme&quot; val=&quot;&#990;&#756;&#972;&#756;&#979;&#756;&quot; /&gt; 
         &lt;DC att=&quot;pos&quot; val=&quot;verb&quot; /&gt; 
        &lt;lemmatisedForm paradigm=&quot;asKataba&quot;&gt;  &lt;DC att=&quot;wordForm&quot; val=&quot;&#912;&#756;&#920;&#756;&#987;&#756;&quot; /&gt;
</p>
<p> &lt;DC att=&quot;havePassive&quot; val=&quot;yes&quot; /&gt; 
        &lt;/lemmatisedForm&gt; 
&lt;/lexicalEntry&gt; 
</p>
<p>Figure 8 : Exemple d&#8217;une entr&#233;e lexicale verbale d&#8217;ArabicLDB 
</p>
<p>Dans cet exemple, nous avons sp&#233;cifi&#233; le paradigme du verbe &quot;&#912;&#756;&#920;&#756;&#987;&#756;&quot; [kataba] comme attribut 
de ce lemme. Cet attribut joue le r&#244;le d&#8217;une r&#233;f&#233;rence pour trouver le paradigme convenable &#224; 
un verbe dans le module des modes de flexion. Ce paradigme peut &#234;tre appliqu&#233; totalement 
sur ce verbe puisque la cat&#233;gorie de donn&#233;es /havePassive/ prend la valeur yes. Autrement dit, 
ce verbe admet les deux voix (active et passive). 
</p>
<p>7 Mise en &#339;uvre d&#8217;un conjugueur
Le conjugueur de la base ArabicLDB utilise le module des paradigmes de flexions pour 
engendrer toutes les formes fl&#233;chies d&#8217;un verbe donn&#233; &#224; partir du lemme. Dans un premier 
temps, le programme acc&#232;de &#224; l&#8217;extension morphologique pour chercher l&#8217;identifiant du 
paradigme du verbe. Dans un deuxi&#232;me temps, il acc&#232;de &#224; l&#8217;extension des modes de flexion 
pour importer le paradigme en question. Nous rappelons que ce paradigme est compos&#233; de 
plusieurs combinaisons de traits morphologiques dont chacune d&#8217;elles poss&#232;de des op&#233;rations 
et des arguments (position, cha&#238;ne, etc.) qui permettent le calcul des formes fl&#233;chies. 
</p>
<p>Figure 9 : Architecture du conjugueur 
</p>
<p>Extension 
des modes 
de flexion
</p>
<p>Extension 
Morphologique 
</p>
<p>ArabicLDB
</p>
<p>Verbe (aspect, mode, personne,
 genre, nombre)   
</p>
<p>R&#233;cup&#233;ration du paradigme
</p>
<p>Recherche de l&#8217;identifiant du paradigme
</p>
<p>Identifiant du paradigme
</p>
<p>Application des op&#233;rations sur le lemme 
</p>
<p>Les op&#233;rations et leurs arguments 
</p>
<p>Les formes fl&#233;chies  
</p>
<p>Affichage de la forme fl&#233;chie  
</p>
<p>Le lemme  
</p>
<p>141</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Khemakhem A&#207;DA, Gargouri BILEL, Abdelwahed ABDELHAMID, Francopoulo GIL
</p>
<p>Notre conjugueur est compos&#233; de quatre modules : 
x Recherche de l&#8217;identifiant du paradigme : c&#8217;est la premi&#232;re &#233;tape de ce conjugueur 
</p>
<p>qui consiste &#224; trouver l&#8217;identifiant du paradigme du verbe en question, en acc&#233;dant &#224; 
l&#8217;extension morphologique de la base ArabicLDB.
</p>
<p>x R&#233;cup&#233;ration du paradigme : cette &#233;tape utilise l&#8217;identifiant du paradigme pour 
acc&#233;der &#224; l&#8217;extension des modes de flexion et importer les donn&#233;es de ce paradigme. 
</p>
<p>x Application des op&#233;rations sur le lemme : ce module permet la g&#233;n&#233;ration les 
formes fl&#233;chies en se basant sur les op&#233;rations et leurs argument. 
</p>
<p>x Affichage de la forme fl&#233;chie : nous affichons la forme fl&#233;chie g&#233;n&#233;r&#233;e avec ses 
traits morphologiques.  
</p>
<p>8 Conclusion 
L&#8217;absence d&#8217;une repr&#233;sentation intensionnelle robuste pour les verbes arabes, nous a pouss&#233; &#224; 
&#233;tudier ce domaine. En plus, l&#8217;apparition d&#8217;une norme ISO (LMF) nous a encourag&#233; &#224; 
&#233;laborer les paradigmes de flexion des verbes arabes selon cette norme sachant que nous 
avons d&#233;j&#224; utilis&#233; LMF pour &#233;laborer la base morphologique ArabicLDB.  
</p>
<p>En ce qui concerne l&#8217;identification des verbes types, nous avons adopt&#233; les classifications 
propos&#233;es dans les travaux existants afin de combiner les classes r&#233;sultantes avec les classes 
de sch&#232;me tout en mettant en relief les terminaisons des racines sensibles &#224; l&#8217;ajout des 
suffixes. Ensuite, nous avons filtr&#233; ces combinaisons en utilisant des crit&#232;res d&#8217;ordre 
s&#233;mantique pour aboutir &#224; la sp&#233;cification de 256 paradigmes verbaux. Ces paradigmes 
forment la repr&#233;sentation en intension des verbes dans la base ArabicLDB qui comporte 
16 000 verbes.
</p>
<p>Un conjugueur a &#233;t&#233; mis en place comme outil d&#8217;exploitation et de v&#233;rification en s&#8217;appuyant 
sur ArabicLDB. Ce conjugueur est utilis&#233; dans un contexte d&#8217;enseignement de l&#8217;arabe.  
</p>
<p>R&#233;f&#233;rences 
ABDELWAHED A. (1996).. &#946;&#999;&#1006;&#919; &#748;&#946;&#983;&#910;&#980;&#956;&#913; &#916;&#1012;&#759;&#999;&#910;&#948;&#999;&#1017;&#909; &#993;&#1006;&#992;&#972;&#991;&#909; &#1005; &#911;&#909;&#937;&#1013;&#909; &#916;&#1012;&#992;&#987;.
AMMAR S., DICHY J. (1999). Les verbes arabes (Collection Bescherelle). Editions HATIER, Paris.
BALOUL S. (2003). D&#233;veloppement d&#8217;un syst&#232;me automatique de la parole &#224; partir du texte arabe 
standard voyell&#233;. Th&#232;se de doctorat de l&#8217;universit&#233; du MAINE, Le Mans, France. 
BLACHERE R., GAUDEFROY-DEMOMBYNES M. (1975). Grammaire de l&#8217;arabe classique.
Lieu : Edition Maisonneuvre-Larose, Paris. 
EL-DAHDEH  A. (1999). &#993;&#985;&#917;&#911;&#915; &#989;&#911;&#997;&#909;&#997; &#997;&#909;&#949;&#941;&#1005;&#997;&#748; &#911;&#1009;&#941;&#1005;&#917;&#748; &#989;&#911;&#997;&#909;&#997;.
FRANCOPOULO G. (2003). Proposition de normalisation de norme des lexiques pour le traitement 
automatique du langage. INRIA/LORIA-ACTION SYNTAXE, Version-1.3. 
FRANCOPOULO G., GEORGE M. (2006). ISO/TC 37/SC4 N130 Rev.9. Language resource 
management &#237; Lexical markup framework (LMF).  
IBN ELQATAA (2003). &#937;&#909;&#941; &#909;&#989;&#985;&#917;&#911; &#909;&#989;&#969;&#989;&#993;&#1009;&#915;&#748; &#911;&#1009;&#941;&#1005;&#917; .
KHEMAKHEM A., GARGOURI B., ABDELWAHED A. (2006). LMF est-il convenable pour la 
langue arabe ? Actes de Journ&#233;es sur le Traitement Automatique de la Langue Arabe JTALA&#8217;06,
Rabat, Maroc.
KHEMAKHEM A. (2006). &quot;ArabicLDB : une base lexicale normalis&#233;e pour la langue arabe&quot;. 
M&#233;moire de master en Syst&#232;mes d&#8217;Information et Nouvelles Technologies. Lieu : FSEG, Sfax, Tunis. 
(http://www.tagmatica.fr/doc/MemoireAida.pdf). 
ROMARY L., WRIGHT S., FARRA S., GILLAM L. (2003). ISO TC 37/SC4 N055, Language 
resource management - Implementing a data category registry within ISO TC37. 
</p>
<p>142</p>

</div></div>
</body></html>