<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Repr&#233;senter la dynamique &#233;nonciative et modale de textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Repr&#233;senter la dynamique &#233;nonciative et modale de textes
</p>
<p>Delphine BATTISTELLI1, Marie CHAGNOUX2
1 Lalic &#8211; Universit&#233; Paris IV-Sorbonne, 28 rue Serpente 75006 Paris 
</p>
<p>2 France T&#233;l&#233;com &#8211; Div. R&amp;D, TECH/EASY/Langues Naturelles,                         
2 avenue Pierre Marzin, 22307 Lannion Cedex 
</p>
<p>Delphine.Battistelli@paris4.sorbonne.fr,Marie.Chagnoux@free.fr
</p>
<p>R&#233;sum&#233;. Nous proposons d&#8217;exposer ici une m&#233;thodologie d&#8217;analyse et de repr&#233;sentation 
d&#8217;une des composantes de la structuration des textes, celle li&#233;e &#224; la notion de prise en charge 
&#233;nonciative. Nous mettons l&#8217;accent sur la structure hi&#233;rarchis&#233;e des segments textuels qui en 
r&#233;sulte ; nous la repr&#233;sentons d&#8217;une part sous forme d&#8217;arbre et d&#8217;autre part sous forme de 
graphe. Ce dernier permet d&#8217;appr&#233;hender la dynamique &#233;nonciative et modale de textes 
comme un cheminement qui s&#8217;op&#232;re entre diff&#233;rents niveaux de discours dans un texte au fur 
et &#224; mesure de sa lecture syntagmatique. 
</p>
<p>Abstract. We propose a methodological framework for analyzing and representing the 
concept of commitment, which is one of the features characterizing textual structure. We 
emphasize the hierarchical structure of textual segments commitment conveys to. We 
represent it first as a tree and then as a graph. The latter enables us to access the modal and 
enunciative textual dynamics, as it shows the path followed through different discursive 
levels during the syntagmatic reading of a text.    
</p>
<p>Mots-cl&#233;s : linguistique textuelle, &#233;nonciation, repr&#233;sentation s&#233;mantique. 
</p>
<p>Keywords: textual linguistics, enunciation, semantical representation. 
</p>
<p>1 Introduction 
Notre approche vise &#224; mettre l&#8217;accent sur la dynamique d&#8217;interpr&#233;tation d&#8217;un texte 
appr&#233;hend&#233;e au travers des m&#233;canismes de prise en charge &#233;nonciative qui instruisent une 
structuration de type hi&#233;rarchique. Nous proposons d&#8217;en donner deux types de repr&#233;sentation : 
la premi&#232;re met en &#233;vidence la structure &#233;nonciative et modale du texte, que nous 
repr&#233;sentons sous la forme d&#8217;un arbre ; la deuxi&#232;me met en &#233;vidence la dynamique 
&#233;nonciative et modale du texte, que nous repr&#233;sentons sous la forme d&#8217;un graphe. Ces 
repr&#233;sentations vont toutes deux &#234;tre convoqu&#233;es pour deux types d&#8217;utilisations que nous 
visons : la premi&#232;re consiste seulement &#224; rendre possible la construction automatique et la 
visualisation d&#8217;arbres et de graphes &#224; l&#8217;&#233;cran ; la seconde consiste &#224; utiliser ces 
repr&#233;sentations comme repr&#233;sentations internes d&#8217;un texte pour proposer des parcours entre 
segments dans le cadre d&#8217;une plateforme de navigation textuelle. Nous proposons dans cet 
article d&#8217;expliciter notre d&#233;marche. Dans la section 2, nous la situons par rapport aux 
approches existantes. La section 3 pr&#233;sente les &#233;tapes pr&#233;liminaires de segmentation et 
d&#8217;annotation automatiques qui permettent de construire les repr&#233;sentations selon des 
modalit&#233;s d&#233;taill&#233;es dans la section 4. 
</p>
<p>23</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine BATTISTELLI, Marie CHAGNOUX
</p>
<p>2 La prise en compte du contexte &#233;nonciatif et modal dans les 
syst&#232;mes de recherche d&#8217;information 
</p>
<p>Les syst&#232;mes actuels de recherche d&#8217;information tels que les r&#233;sumeurs automatiques ou les 
syst&#232;mes de questions-r&#233;ponses ne s&#233;lectionnent pas des documents entiers mais des segments
correspondant &#224; une requ&#234;te ou &#224; un profil &#224; l&#8217;int&#233;rieur de ceux-ci. L&#8217;extraction de ces 
segments brise la continuit&#233; r&#233;f&#233;rentielle &#224; l&#8217;&#339;uvre dans un texte (Battistelli et Minel, 2006) : 
priv&#233;s de leur contexte, les segments peuvent alors &#234;tre difficiles &#224; interpr&#233;ter, en particulier 
quant &#224; leur ancrage temporel, &#233;nonciatif et modal. 
</p>
<p>2.1 Exemples 
</p>
<p>L&#8217;absence de prise en compte du contexte &#233;nonciatif et modal peut entra&#238;ner des impr&#233;cisions, 
des contresens ou des conflits comme l&#8217;illustrent les trois exemples du tableau 1. Si l&#8217;on 
consid&#232;re le segment l&#8217;appel &#224; un cessez-le-feu urgent et non pas imm&#233;diat constitue un 
&#233;chec, on inf&#232;re que l&#8217;auteur de l&#8217;article dont est extrait ce segment consid&#232;re que l&#8217;appel &#224; un 
cessez-le-feu est un &#233;chec. Or, si on le r&#233;inscrit dans sa continuit&#233; r&#233;f&#233;rentielle de l&#8217;extrait 1 
du tableau 1, il appara&#238;t que l&#8217;auteur ne prend en charge que le principe de citation et qu&#8217;un 
&#233;nonciateur second, la Maison-Blanche, r&#233;fute cette proposition. 
</p>
<p>1. La Maison-Blanche s&#8217;est, elle, montr&#233;e satisfaite des r&#233;sultats de la r&#233;union de Rome et a r&#233;fut&#233; que l&#8217;appel &#224; un cessez-
le-feu urgent et non pas imm&#233;diat constitue un &#233;chec.
2. 1. Le Hezbollah a captur&#233; deux soldats isra&#233;liens qui patrouillaient dans des jeeps blind&#233;es sur le territoire libanais &#224; la 
fronti&#232;re avec Isra&#235;l.  
2. 2. Le mercredi 12 juillet, 8 soldats de Tsahal ont &#233;t&#233; tu&#233;s et 2 ont &#233;t&#233; kidnapp&#233;s, au cours d&#8217;une attaque du Hezbollah &#224; 
l&#8217;int&#233;rieur du territoire isra&#233;lien, pr&#232;s de la fronti&#232;re isra&#233;lo-libanaise. 
3. A propos du lieu de l&#8217;enl&#232;vement, les versions diff&#232;rent. Les Isra&#233;liens affirment qu&#8217;ils ont &#233;t&#233; captur&#233;s pr&#232;s de la ferme 
collective de Zarit en territoire isra&#233;lien tout pr&#232;s de la fronti&#232;re libanaise. De son c&#244;t&#233;, la police libanaise soutient que la 
capture s&#8217;est produite dans la r&#233;gion de A&#239;ta al-Chaab en territoire libanais donc, proche de la fronti&#232;re libano-sra&#233;lienne o&#249; 
une unit&#233; isra&#233;lienne avait p&#233;n&#233;tr&#233; le matin m&#234;me. 
</p>
<p>Tableau 1 : Extraits de textes portant sur le conflit entre Isra&#235;l et le Liban durant l&#8217;&#233;t&#233; 2006 
</p>
<p>L&#8217;exemple 2 du m&#234;me tableau montre que l&#8217;extraction de segments isol&#233;s de leur contexte 
&#233;nonciatif peut conduire &#224; des conflits. Ainsi les exemples 2.1 et 2.2 sont contradictoires. Les 
deux extraits r&#233;f&#232;rent &#224; la m&#234;me situation : la capture de deux soldats au Moyen-Orient le 12 
juillet 2006. Or, selon l&#8217;&#233;nonciateur, le lieu de la capture est diff&#233;rent : pour l&#8217;association 
France Palestine, la capture a eu lieu sur le territoire libanais ; pour l&#8217;Ambassade d&#8217;Isra&#235;l en 
France, elle s&#8217;est d&#233;roul&#233;e &#224; l&#8217;int&#233;rieur du territoire isra&#233;lien. La reconnaissance de la source 
peut para&#238;tre triviale dans le cas d&#8217;application inter-documents puisqu&#8217;il suffit d&#8217;annoter le 
texte pour le doter de cette information comme cela est propos&#233; par exemple pour le Web 
s&#233;mantique. Cependant l&#8217;examen de l&#8217;exemple 3 du tableau 1 montre que le m&#234;me conflit 
peut appara&#238;tre au sein d&#8217;un seul et m&#234;me texte. 
</p>
<p>2.2 Annotation vs. Repr&#233;sentation 
</p>
<p>Le texte est la trace d&#8217;au moins un acte d&#8217;&#233;nonciation, cet acte est celui accompli par 
l&#8217;&#233;nonciateur principal qui prend en charge l&#8217;ensemble du discours. Cependant, certains 
segments de son discours ne sont pas compl&#232;tement assum&#233;s par cet &#233;nonciateur, soit qu&#8217;un 
&#233;nonciateur second est convoqu&#233; au terme d&#8217;une citation, soit que ces segments sont assujettis 
&#224; un certain degr&#233; de plausibilit&#233; ou d&#8217;intentionnalit&#233;. Il devient alors crucial pour les 
</p>
<p>24</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;senter la dynamique &#233;nonciative et modale de textes 
</p>
<p>syst&#232;mes de disposer de cette information qui instruit le contexte &#233;nonciatif et modal d&#8217;un 
segment textuel, comme en t&#233;moignent les trois exemples du tableau 1. Actuellement, de 
nombreux travaux s&#8217;inscrivent dans ce paradigme et proposent des syst&#232;mes d&#8217;annotation de 
ce type d&#8217;information (Giguet et Lucas 2004 ; Harabagiu et al., 2004 ; Sauri et al., 2005 ; 
Wilson et Wiebe, 2005). Nous pensons pour notre part que la seule t&#226;che d&#8217;annotation des 
ruptures de prises en charge &#233;nonciative n&#8217;est pas suffisante et qu&#8217;il est n&#233;cessaire de les 
organiser en une structure repr&#233;sentationnelle qui rend compte des liens de type hi&#233;rarchique 
entre les segments annot&#233;s. En ayant ainsi rep&#233;r&#233; et hi&#233;rarchis&#233; les diff&#233;rentes prises en 
charge &#233;nonciatives, un traitement informatique est &#224; m&#234;me de rendre compte de la v&#233;ritable 
attribution de tel ou tel segment &#224; tel ou tel &#233;nonciateur, que ce soit dans le cadre d&#8217;un 
traitement inter-documents ou intra-document. 
</p>
<p>2.3 Linguistique textuelle et syst&#232;mes de navigation textuelle 
</p>
<p>Pour des syst&#232;mes de navigation textuelle, qui proposent une alternative aux syst&#232;mes 
classiques de r&#233;sum&#233; automatique et de questions-r&#233;ponses en permettant une navigation &#224; 
l&#8217;int&#233;rieur d&#8217;un document parmi des segments annot&#233;s inscrits dans leurs co-textes (Bilhaut et 
al., 2003 ; Crestan et al., 2004 ; Minel et Couto, 2004), disposer de ce type d&#8217;informations 
constitue un enjeu important. En outre, il est int&#233;ressant de relever que ces syst&#232;mes 
s&#8217;appuient sur les structures discursives identifi&#233;es (le plus souvent de type hi&#233;rarchique) pour 
proposer une navigation &#224; l&#8217;int&#233;rieur des documents ; ce faisant, ils sont directement 
concern&#233;s par les travaux r&#233;cents de la linguistique textuelle qui a pour objet l&#8217;analyse des 
modes d&#8217;organisation discursifs (P&#233;ry-Woodley, 2001). Parmi ces modes, la temporalit&#233; 
occupe une place privil&#233;gi&#233;e tr&#232;s largement &#233;tudi&#233;e : par l&#8217;analyse des indices calendaires en 
position initiale de phrases qui constituent des marques d&#8217;ouverture de cadres temporels 
(Charolles et Vigier, 2005 ; Le Draoulec et P&#233;ry-Woodley, 2005), par l&#8217;analyse des variations 
de prises en charge &#233;nonciative et modale de contenus propositionnels (Descl&#233;s et 
Guentch&#233;va, 2000 ; Kronning, 2003), etc.
</p>
<p>La m&#233;thodologie de la linguistique textuelle consiste &#224; &#233;tablir le lien entre structures 
discursives et marques formelles organis&#233;es en syst&#232;mes. Elle se distingue en cela de celle 
mise en &#339;uvre dans le cadre de mod&#232;les du discours comme ceux de la RST (Mann et 
Thompson 1988) ou de (Hobbs 1990) qui insistent sur l&#8217;ind&#233;pendance du type de structures 
qui les int&#233;resse par rapport &#224; toute marque linguistique1. Nous situant pour notre part dans 
une d&#233;marche d&#8217;analyse empirique des modes de structuration discursive &#8211; ici, &#233;nonciative et 
modale &#8211;, nous nous inscrivons dans les principes m&#233;thodologiques de la linguistique 
textuelle et donc aussi dans ceux qui fondent selon nous le d&#233;veloppement de syst&#232;mes de 
navigation textuelle qui s&#8217;appuient directement sur les structures discursives mises en 
&#233;vidence. Nous exposons bri&#232;vement dans la section suivante l&#8217;&#233;tape qui pr&#233;c&#232;de celle de la 
construction de la repr&#233;sentation hi&#233;rarchique du texte : la t&#226;che d&#8217;annotation. Elle consiste (i) 
d&#8217;une part &#224; sp&#233;cifier le type d&#8217;unit&#233;s textuelles &#224; annoter et donc &#224; proc&#233;der &#224; une 
segmentation du texte ; (ii) et d&#8217;autre part &#224; pr&#233;ciser la typologie des annotations s&#233;mantiques 
&#224; associer &#224; ces unit&#233;s.
</p>
<p>1 Il est &#224; noter que l&#8217;approche de la SDRT (Asher, 1993) est &#224; cet &#233;gard quelque peu diff&#233;rente. Il existe en effet 
depuis plusieurs ann&#233;es une volont&#233; de lier le mod&#232;le aux instanciations langagi&#232;res des relations de 
discours.   
</p>
<p>25</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine BATTISTELLI, Marie CHAGNOUX
</p>
<p>3 Segmentation et annotation des segments textuels 
Nous pr&#233;sentons dans cette section les principes qui r&#233;gissent l&#8217;annotation et en gouvernent 
l&#8217;automatisation. Au niveau discursif, le texte est consid&#233;r&#233; comme une suite de propositions 
en relations de rupture ou de continuit&#233;. Ces relations qui conduisent &#224; consid&#233;rer des 
segments homog&#232;nes regroupant plusieurs propositions sont d&#233;finies lors de la construction 
de la repr&#233;sentation. Au niveau de l&#8217;annotation, le texte est segment&#233; en propositions par le 
syst&#232;me PROPOS (Wonsever, 2004) avant d'&#234;tre annot&#233;. Les crit&#232;res d&#8217;annotation sont fond&#233;s 
sur les types de d&#233;crochage de prise en charge et sur la typologie des r&#233;f&#233;rentiels propos&#233;e par 
(Descl&#233;s, 1995) et pr&#233;cis&#233;e par (Chagnoux, 2006). Ces crit&#232;res permettent d&#8217;inscrire les 
propositions sur diff&#233;rents r&#233;f&#233;rentiels : 
</p>
<p>&#8211; Le r&#233;f&#233;rentiel &#233;nonciatif RE, sur lequel le contenu propositionnel est compl&#232;tement 
assum&#233; par un &#233;nonciateur E ; il peut &#234;tre global (not&#233; REG) quand il s&#8217;agit de 
l&#8217;&#233;nonciateur premier ou local (not&#233; REL) quand il s&#8217;agit d&#8217;un discours rapport&#233;, direct ou 
indirect, ou m&#233;diatis&#233; ; 
</p>
<p>&#8211; Le r&#233;f&#233;rentiel possible RP, sur lequel le contenu propositionnel est consid&#233;r&#233; comme 
possible &#233;ventuel (dans ce cas, le r&#233;f&#233;rentiel est not&#233; RPE) ou possible contre-factuel (ici, 
le r&#233;f&#233;rentiel est not&#233; RPC) ; 
</p>
<p>&#8211; Le r&#233;f&#233;rentiel mental not&#233; RM, o&#249; s&#8217;inscrivent des propositions introduites par il pense 
que, il croit que, etc., &#224; rapprocher des m&#233;ta-repr&#233;sentations d&#233;crites par (Recanati, 2000). 
</p>
<p>L&#8217;objectif de cet article &#233;tant davantage de s&#8217;int&#233;resser aux m&#233;canismes de construction des 
structures hi&#233;rarchiques qui r&#233;sultent de l&#8217;identification de ces diff&#233;rents r&#233;f&#233;rentiels dans les 
textes, nous ne pr&#233;sentons pas ici les analyses linguistiques d&#233;taill&#233;es sur lesquelles se 
fondent cette typologie. On pourra se reporter &#224; (Guentch&#233;va, 1996), (Descl&#233;s et Guentch&#233;va, 
2000) ou (Chagnoux, 2006) pour une pr&#233;sentation des analyses de discours directs, indirects, 
indirects libres et de la m&#233;diation. 
</p>
<p>L&#8217;identification et l&#8217;annotation des segments s&#8217;appuient sur la pr&#233;sence de marqueurs 
linguistiques de diff&#233;rentes natures : temps et modes des verbes conjugu&#233;s, d&#233;ictiques, 
constructions syntaxiques, lex&#232;mes, adverbes, etc. Nous insistons sur le fait que ces cat&#233;gories 
fonctionnent en syst&#232;mes et que c&#8217;est l&#8217;expression de patrons complexes qui rend compte des 
op&#233;rations de rupture ou au contraire de coh&#233;sion. Une base de marqueurs et une base de 
r&#232;gles heuristiques ont &#233;t&#233; impl&#233;ment&#233;es dans Chronotext2 afin d&#8217;annoter les r&#233;f&#233;rentiels. Le 
tableau 2 d&#233;taille la segmentation et l'annotation d'un extrait court : l'extrait 1 est segment&#233; 
selon le format propos&#233; en 2 par PROPOS (r&#233;sum&#233; en 3 pour une meilleure lisibilit&#233;) et 
annot&#233; comme dans 4 par Chronotext.  
</p>
<p>Les annotations de 4 sont obtenues par les r&#232;gles pr&#233;sent&#233;es dans le tableau 3 et qui peuvent 
&#234;tre glos&#233;es comme suit : nous partons du postulat que tout texte s&#8217;inscrit dans un r&#233;f&#233;rentiel 
&#233;nonciatif global par d&#233;faut. Tant qu&#8217;aucun marqueur ne permet de les assigner &#224; un autre 
r&#233;f&#233;rentiel, toutes les propositions rel&#232;vent de ce r&#233;f&#233;rentiel &#233;nonciatif global. Ici, c&#8217;est le cas 
de P1. 
</p>
<p>2 Chronotext, pr&#233;sent&#233; en d&#233;tail dans (Chagnoux 2006) permet la reconnaissance des diff&#233;rents r&#233;f&#233;rentiels gr&#226;ce 
&#224; une base de 76 r&#232;gles et de 708 marqueurs organis&#233; dans 119 classes impl&#233;ment&#233;s dans Semantext, plate-
forme de collecte et d'organisation de connaissances linguistiques pour l'annotation des textes. 
</p>
<p>26</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;senter la dynamique &#233;nonciative et modale de textes 
</p>
<p>1. Ses cadres affirment qu&#8217;ils ont les moyens de proc&#233;der &#224; une escalade de grande envergure si Tsahal poursuit ses raids 
sur le sol libanais. 
</p>
<p>2. &lt;PHRASE_TEXTE&gt;&lt;PROP COD=pli1 NIVEAU=1 INDEP VERBE = affirment&gt;Ses cadres affirment &lt;/PROP&gt;&lt;PROP 
COD=prl1 NIVEAU=2 INSER IP=mot (que) VERBE = ont&gt;qu&#8217;ils ont les moyens de proc&#233;der &#224; une escalade de grande 
envergure &gt;&lt;PROP COD=gf21 NIVEAU=3 INDEP VERBE = poursuit&gt;si Tsahal poursuit ses raids sur le sol libanais. 
&lt;/PROP&gt;&lt;/PROP&gt;&lt;/PHRASE_TEXTE 
</p>
<p>3. [P1 : Ses cadres affirment] [P2 : qu&#8217;ils ont les moyens de proc&#233;der &#224; une escalade de grande envergure] [P3 : si Tsahal 
poursuit ses raids sur le sol libanais.] 
</p>
<p>4. &lt;REG&gt; Ses cadres affirment &lt;/REG&gt; &lt;REL&gt; qu&#8217;ils ont les moyens de proc&#233;der &#224; une escalade de grande envergure 
&lt;/REL&gt; &lt;RPE&gt; si Tsahal poursuit ses raids sur le sol libanais.&lt; /RPE&gt; 
</p>
<p>Tableau 2 : Segmentation et annotation d&#8217;un extrait de texte  
</p>
<p>En revanche, la pr&#233;sence du patron &amp;ouverture_citation + que3 permet d&#8217;identifier 
automatiquement que P2 rel&#232;ve d&#8217;un r&#233;f&#233;rentiel &#233;nonciatif local. L&#8217;annotation de P3 r&#233;sulte 
de l&#8217;introduction de la proposition courante par si associ&#233;e &#224; la r&#232;gle de concordance des 
temps.  . Des r&#232;gles de r&#233;cursivit&#233; d&#233;finissent des conditions de propagation qui permettent &#224; 
l&#8217;annotation s&#233;mantique d&#8217;une proposition d&#8217;&#234;tre associ&#233;e &#224; la proposition suivante afin 
d&#8217;annoter l&#8217;ensemble des propositions du texte.   
</p>
<p>1. NOT ($proposition$ contains (/$Refentiel-possible/OR /$Referentiel-mental/ OR/Referentiel-enonciatif2/) 
AND($proposition$ contains(/&amp;deictique/ OR /&amp;interjection/)) AND NOT ($proposition$contains (/&amp;Nactualise/ OR 
/&amp;PS/)
2. ( ($proposition justbefore $proposition$)contains /&amp;ouverture-citation/) AND  ($proposition$ contains/ &amp;que/) 
3. ($proposition$ starts-with /&amp;si/) AND ($proposition$ contains /&amp;present/) AND ($proposition justbefore $proposition$ 
contains /&amp;present/)
</p>
<p>Tableau 3 : Exemples de r&#232;gles d'annotation des segments 
</p>
<p>4 Repr&#233;sentation de la s&#233;mantique &#233;nonciative et modale d&#8217;un 
texte
</p>
<p>La t&#226;che de construction de la repr&#233;sentation oblige &#224; sp&#233;cifier les relations entre les unit&#233;s 
distingu&#233;es lors de l&#8217;&#233;tape pr&#233;c&#233;dente. Le fait de consid&#233;rer une structure textuelle 
hi&#233;rarchis&#233;e est classique en analyse du discours (Mann et Thompson, 1988 ; Hobbs, 1990, 
Asher 1993). Comme le souligne (Cornish 2006), le &#171; scripteur &#187; r&#233;alise linguistiquement une 
organisation qui passe par la constitution de segments, la hi&#233;rarchisation de ces segments et 
leur mise en relation. Autrement dit, un texte est vu comme un ensemble de segments qui 
entrent en relation d&#8217;inclusion ou de succession4 et il peut donc &#234;tre repr&#233;sent&#233; &#224; l&#8217;aide d&#8217;une 
structure d&#8217;arbre. Nous proposons d&#8217;exposer ici les principes de construction de la 
repr&#233;sentation &#171; statique &#187; sous forme d&#8217;arbre de la structure de l'extrait (section 4.1) ; puis 
d&#8217;exposer ceux relatifs &#224; la construction de la repr&#233;sentation sous forme de graphe de la 
&#171; dynamique &#187; du texte (section 4.2). Cette derni&#232;re permet de visualiser le cheminement qui 
s&#8217;op&#232;re entre diff&#233;rents niveaux de discours dans un texte au fur et &#224; mesure de sa lecture 
</p>
<p>3 Dans Chronotext, &amp;ouverture_citation est le nom de la classe contenant plus de 90 verbes susceptibles 
d&#8217;introduire les propos d&#8217;un tiers comme s&#8217;exclamer, dire, hurler, etc. 
</p>
<p>4 Ces relations peuvent &#233;ventuellement faire l&#8217;objet d&#8217;une typologie s&#233;mantique comme c&#8217;est le cas pour les 
relations dites de discours (narration, &#233;laboration, &#8230;) propos&#233;es par exemple par (Mann et Thompson 
1998) ; il reste qu&#8217;elles renvoient toutes &#224; une structuration arborescente du texte.  
</p>
<p>27</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine BATTISTELLI, Marie CHAGNOUX
</p>
<p>syntagmatique. Ces deux repr&#233;sentations sont construites &#224; partir des segments annot&#233;s du 
texte pr&#233;sent&#233; dans le tableau 4. 
</p>
<p>Hier apr&#232;s-midi, quarante-huit heures apr&#232;s l'ouverture du front libano-isra&#233;lien, le Hezbollah qui, selon son chef Hassan 
Nasrallah, disposerait de plus de 10 000 roquettes et missiles point&#233;s sur Isra&#235;l, avait d&#233;j&#224; frapp&#233; 165 fois le territoire de 
l'Etat h&#233;breu. Et ce ne pourrait &#234;tre qu'un d&#233;but. Ses cadres affirment qu'ils ont les moyens de proc&#233;der &#224; une escalade de 
grande envergure si Tsahal poursuit ses raids sur le sol libanais. 
</p>
<p>Tableau 4 : Incipit de l'article &quot;Les chiites fous du Parti de Dieu&quot;, Lib&#233;ration, (15/072006) 
</p>
<p>4.1  Repr&#233;senter la structure &#233;nonciative et modale sous forme d&#8217;arbre
</p>
<p>Pour faire &#233;merger la structure textuelle, l&#8217;annotation n&#8217;est plus seulement faite au niveau 
propositionnel par des balises XML mais se r&#233;alise au niveau segmental via un mod&#232;le de 
repr&#233;sentation du texte d&#233;fini par (Couto 2006) et sp&#233;cifi&#233; dans une DTD. Ce mod&#232;le permet 
de d&#233;finir des Unit&#233;s Textuelles (UT) &#224; partir de propositions connexes mais surtout de traiter 
le probl&#232;me de la discontinuit&#233; par une op&#233;ration de S&#233;quence qui r&#233;tablit la coh&#233;sion entre 
des segments discontinus dans le texte. A chaque UT est associ&#233; un attribut Nature qui d&#233;finit 
la nature du segment. Chaque type de r&#233;f&#233;rentiel convoque des attributs diff&#233;rents qui 
permettent d&#8217;encoder toutes les propri&#233;t&#233;s qui lui sont associ&#233;es. La figure 1 pr&#233;sente la mise 
au format du texte dont est extrait l'exemple 1 du tableau 2. La T&#234;te contient les op&#233;rations de 
S&#233;quence et le Corps contient les diff&#233;rentes propositions du texte. 
</p>
<p>&lt;?xml version=&quot;1.0&quot; encoding=&quot;iso-8859-1&quot;?&gt; 
&lt;!DOCTYPE Texte SYSTEM &quot;DocumentNaviTexte.dtd&quot;&gt; 
&lt;Texte&gt;
   &lt;Tete&gt; 
      &lt;Sequence Type=&quot;Regroupement&quot; Nro=&quot;1&quot; &gt; 
         &lt;UTP Type=&quot; Segment_referentiel &quot; Nro=&quot;1&quot;/&gt; 
         &lt;UTP Type=&quot; Segment_referentiel &quot; Nro=&quot;4&quot;/&gt; 
      &lt;/Sequence&gt; 
   &lt;/Tete&gt; 
   &lt;Corps&gt; 
      &lt;UT Type=&quot; Segment_referentiel &quot; Nro=&quot;1&quot;&gt; 
            &lt;Attribut Nom=&quot;Nature&quot;&gt;Enonciatif_global&lt;/Attribut&gt; 
      &lt;UT Type=&quot; Proposition&quot; Nro=&quot;1&quot;&gt; 
            &lt;Chaine&gt;Hier apr&#232;s-midi, quarante huit heures apr&#232;s l&#8217;ouverture du front libano-isra&#233;lien, le
Hezbollah avait frapp&#233; 165 fois le territoire de l&#8217;Etat h&#233;breu&lt;/Chaine&gt;&lt;/UT&gt; 
      &lt;UT Type=&quot; Segment_referentiel &quot; Nro=&quot;2&quot;&gt; 
            &lt;Attribut Nom=&quot;Nature&quot;&gt;Enonciatif_local 
&lt;/Attribut&gt;
         &lt;UT Type=&quot; Proposition &quot; Nro=&quot;2&quot;&gt; 
            &lt;Chaine&gt; qui, selon son chef Hassan Nasrallah, disposerait de plus de 10 000 roquettes et 
missiles point&#233;s sur Isra&#235;l, &lt;/Chaine&gt;&lt;/UT&gt;&lt;/UT&gt; 
         &lt;UT Type=&quot; Segment_referentiel &quot; Nro=&quot;3&quot;&gt; 
            &lt;Attribut Nom=&quot;Nature&quot;&gt;Possible_eventuel&lt;/Attribut&gt; 
         &lt;UT Type=&quot; Proposition &quot; Nro=&quot;3&quot;&gt; 
            &lt;Chaine&gt; Et ce pourrait n&#8217;&#234;tre qu&#8217;un d&#233;but &lt;/Chaine&gt;&lt;/UT&gt;&lt;/UT&gt; 
         &lt;UT Type=&quot; Segment_referentiel &quot; Nro=&quot;4&quot;&gt; 
            &lt;Attribut Nom=&quot;Nature&quot;&gt;Enonciatif_global&lt;/Attribut&gt; 
         &lt;UT Type=&quot; Proposition &quot; Nro=&quot;4&quot;&gt; 
            &lt;Chaine&gt; Ses cadres affirment&lt;/Chaine&gt;&lt;/UT&gt;&lt;/UT&gt; 
         &lt;UT Type=&quot; Segment_referentiel &quot; Nro=&quot;5&quot;&gt; 
            &lt;Attribut Nom=&quot;Nature&quot;&gt;Enonciatif_local&lt;/Attribut&gt; 
         &lt;UT Type=&quot; Proposition &quot; Nro=&quot;5&quot;&gt; 
            &lt;Chaine&gt; qu&#8217;ils ont les moyens de proc&#233;der &#224; une escalade de grande envergure 
&lt;/Chaine&gt;&lt;/UT&gt;&lt;/UT&gt;
         &lt;UT Type=&quot; Segment_referentiel &quot; Nro=&quot;6&quot;&gt; 
            &lt;Attribut Nom=&quot;Nature&quot;&gt;Enonciatif_local&lt;/Attribut&gt; 
         &lt;UT Type=&quot; Proposition &quot; Nro=&quot;6&quot;&gt; 
            &lt;Chaine&gt; si Tsahal poursuit ses raids sur le sol libanais &lt;/Chaine&gt;&lt;/UT&gt;&lt;/UT&gt;&lt;/UT&gt;&lt;/UT&gt; 
   &lt;/Corps&gt; 
   &lt;/Texte&gt; 
</p>
<p>Figure 1. Texte annot&#233; en conformit&#233; avec la DTD d&#233;finie dans (Couto 2006) 
</p>
<p>28</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;senter la dynamique &#233;nonciative et modale de textes 
</p>
<p>A partir de cette organisation des segments, un arbre est g&#233;n&#233;r&#233; via Graphviz5. La figure 2 
pr&#233;sente le graphe associ&#233; &#224; cet extrait. La racine de l&#8217;arbre correspond &#224; REG ; les n&#339;uds 
correspondent aux diff&#233;rents r&#233;f&#233;rentiels sur lesquels s&#8217;inscrivent les propositions du texte. 
</p>
<p>Figure 2 : Arbre de la structure &#233;nonciative et modale de l'extrait 2 
</p>
<p>4.2 Repr&#233;senter la dynamique &#233;nonciative et modale sous forme de graphe
</p>
<p>Le ph&#233;nom&#232;ne des diff&#233;rentes prises en charge &#233;nonciative &#224; l&#8217;&#339;uvre dans un texte peut &#234;tre 
rendu par une structure de graphe. Dans ce cas, on met l&#8217;accent sur la dynamique &#233;nonciative 
interne du texte comme l'illustre le tableau 5 o&#249; se construit progressivement le graphe 
associ&#233; au texte du tableau 3.
</p>
<p>Toute &#233;nonciation ouvre un r&#233;f&#233;rentiel 
&#233;nonciatif global (REG) : on construit ici REG, 
premier n&#339;ud du graphe sur lequel on situe P1
</p>
<p>Bien que situ&#233; sur REG, P1 contient des indices 
de rupture &#233;nonciative (selon suivi d&#8217;un emploi 
du conditionnel) qui ouvrent un r&#233;f&#233;rentiel 
&#233;nonciatif local REL 
</p>
<p>C&#8217;est sur ce r&#233;f&#233;rentiel que s&#8217;inscrit la 
proposition P2. La fin de la proposition relative 
permet de fermer le r&#233;f&#233;rentiel REL et de 
revenir sur REG. P3 contient un indice de 
rupture modale (pouvoir) qui ouvre un 
r&#233;f&#233;rentiel du possible &#233;ventuel RPE o&#249; situer 
P3. Il se referme gr&#226;ce &#224; la pr&#233;sence du signe 
de ponctuation &quot;.  
</p>
<p>P4 contient un indice de rupture &#233;nonciative 
(affirmer que) qui ouvre un r&#233;f&#233;rentiel &#233;nonciatif 
local REL o&#249; se situe P5.
</p>
<p>5 GraphViz est un logiciel libre qui permet de g&#233;n&#233;rer automatiquement des arbres et des graphes. 
</p>
<p>29</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine BATTISTELLI, Marie CHAGNOUX
</p>
<p>P6 contient un indice de rupture modale (si) qui 
ouvre un r&#233;f&#233;rentiel du possible &#233;ventuel RPE 
o&#249; situer P6. Il se referme gr&#226;ce &#224; la pr&#233;sence 
du signe de ponctuation &quot;. Enfin, la fin du texte 
avec un point, en tant que fin de l&#8217;&#233;nonciation, 
ferme tous les r&#233;f&#233;rentiels ouverts et le graphe 
s&#8217;ach&#232;ve donc par un retour &#224; REG.
</p>
<p>Tableau 5 : Etapes de construction du graphe de la dynamique &#233;nonciative et modale du texte  
</p>
<p>Les n&#339;uds correspondent toujours aux r&#233;f&#233;rentiels identifi&#233;s. Les arcs indiquent les parcours 
entre les diff&#233;rents niveaux de discours et sont &#233;tiquet&#233;s avec les marqueurs qui font passer 
d&#8217;un niveau &#224; un autre. Il faut souligner que cette structure encode la structure arborescente 
sous-jacente puisque les bi-arcs entre n&#339;uds correspondent exactement aux liens de l&#8217;arbre. 
Lors de la construction de la structure textuelle, la principale difficult&#233; r&#233;side dans 
l&#8217;identification automatique de la fermeture des segments rep&#233;r&#233;s. Cette difficult&#233; se pose 
&#233;galement dans les autres mod&#232;les qui rendent compte de la structure textuelle (Charolles et 
Vigier 2005), diverses strat&#233;gies sont mises en &#339;uvre pour r&#233;soudre ce point comme par 
exemple dans cet extrait le retour syst&#233;matique au premier n&#339;ud du graphe en fin de texte. 
</p>
<p>5  Conclusion 
Dans cet article, nous avons propos&#233; un mod&#232;le de repr&#233;sentation de la dynamique 
&#233;nonciative et modale ainsi que son automatisation via la cha&#238;ne de traitement que synth&#233;tise 
la figure 3. 
</p>
<p>Figure 3: Cha&#238;ne de traitement pour l'automatisation de la g&#233;n&#233;ration de graphes 
</p>
<p>Cette cha&#238;ne est actuellement en cours de r&#233;alisation et est test&#233;e sur un corpus de 25 textes (5 
textes journalistiques, 5 textes tir&#233;s de la Wikipedia, 5 incipit de roman, 5 textes scientifiques 
et 5 textes &quot;entreprises&quot;). Les t&#226;ches de segmentation et d&#8217;annotation sont op&#233;rationnelles et 
nous travaillons actuellement d&#8217;une part &#224; la mise au format automatique dans la DTD choisie 
et d&#8217;autre part &#224; la g&#233;n&#233;ration automatique de l'arbre et du graphe via Graphviz. Il nous faut 
encore r&#233;soudre un certain nombre de difficult&#233;s : lors de l&#8217;annotation automatique des 
propositions, il est parfois difficile de distinguer automatiquement la nature de tous les 
r&#233;f&#233;rentiels. Ainsi par exemple, le rep&#233;rage des assertions introduites par &quot;selon&quot; ou&quot; pour&quot; en 
position ant&#233;pos&#233;e produit encore trop de bruits en identifiant des propositions comme &quot;selon 
</p>
<p>30</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;senter la dynamique &#233;nonciative et modale de textes 
</p>
<p>l'appartenance sociale&quot; ou &quot;pour le d&#233;veloppement&quot;. Les r&#232;gles qui traitent les ph&#233;nom&#232;nes 
modaux doivent encore &#234;tre affin&#233;es pour permettre une meilleure annotation. Il faudrait 
&#233;galement &#224; terme pouvoir regrouper les segments discontinus pris en charge par un m&#234;me 
&#233;nonciateur.
En ce qui concerne l'&#233;valuation, comme l'explicite (Chaudiron, 2004), la difficult&#233; qu'il y a &#224; 
construire des protocoles d'&#233;valuation est particuli&#232;rement accrue dans le domaine 
s&#233;mantique. A d&#233;faut de pouvoir &#233;valuer la pertinence de la repr&#233;sentation s&#233;mantique 
propos&#233;e ici, nous pensons qu'illustrer son utilisation pour d'autres t&#226;ches permet de valider 
notre approche. Les premiers r&#233;sultats que nous avons obtenus montrent d'une part qu&#8217;il nous 
est possible de traiter tout type de texte et, par l&#224; m&#234;me, de proposer une typologie bas&#233;e sur 
les m&#233;canismes &#233;nonciatifs (Battistelli et Chagnoux, 2006). D'autre part, le format d&#8217;encodage 
des informations permet un certain nombre d&#8217;op&#233;rations de navigation &#224; l&#8217;int&#233;rieur d&#8217;un texte 
dans une plate-forme comme celle de (Couto et Minel, 2006). Notre approche se distingue de 
la &#171; simple &#187; approche d&#8217;annotation des ruptures de prise en charge &#233;nonciative et modale 
puisque nous proposons de construire, &#224; partir des textes annot&#233;s, des repr&#233;sentations des 
structures discursives. Notre mod&#232;le de repr&#233;sentation discursive prend non seulement en 
compte les ruptures de prises en charge &#233;nonciative mais les organise en une structure 
hi&#233;rarchique, ce qui constitue un enjeu fondamental pour les syst&#232;mes actuels de recherche 
d&#8217;information. Par ailleurs, ce projet prend toute sa l&#233;gitimit&#233; dans le cadre de plateformes de 
navigation textuelle qui s&#8217;appuient directement sur ces structures pour proposer des parcours 
de navigation entre segments textuels.  
</p>
<p>R&#233;f&#233;rences
ASHER N. (1993). Reference to Abstract objects in Discourse. Kluwer Academic Publishers. 
</p>
<p>BATTISTELLI D., CHAGNOUX M. (2006). Vers une typologie de m&#233;canismes discursifs. Actes
de la journ&#233;e ATALA &quot;Typologie de textes&quot;, Paris. 
</p>
<p>BATTISTELLI D., MINEL J.-L. (2006). Les syst&#232;mes de r&#233;sum&#233; automatique : comment assurer 
une continuit&#233; r&#233;f&#233;rentielle dans la lecture des textes, in G. Sabah (Ed.), Compr&#233;hension des 
langues et interaction, 295-330. 
</p>
<p>BATTISTELLI D., MINEL J.-L., SCHWER S. (2006). Repr&#233;sentation des expressions calendaires 
dans les textes : vers une application &#224; la lecture assist&#233;e de biographies. TAL vol. 47/2. 
</p>
<p>BILHAUT F., HO-DAC M., BORILLO A., CHARNOIS T., ENJALBERT P., LE DRAOULEC A.,
MATHET Y., MIGUET H., P&#201;RY-WOODLEY M.-P., SARDA L. (2003). Indexation discursive pour 
la navigation intradocumentaire : cadres temporels et spatiaux dans l&#8217;information 
g&#233;ographique, Actes TALN&#8217;03, Batz-sur-Mer, 315-320.
</p>
<p>CHAGNOUX M. (2006). Temporalit&#233; et aspectualit&#233; dans les textes fran&#231;ais. Mod&#233;lisation 
s&#233;mantico-cognitive et traitement informatique. Th&#232;se de l&#8217;Universit&#233; Paris-Sorbonne.
</p>
<p>CHAROLLES M., VIGIER D. (2005). Les adverbiaux en position pr&#233;verbale : port&#233;e cadrative et 
organisation des discours, Langue Fran&#231;aise, 148, 9-30. 
</p>
<p>CHAUDIRON, S. (2004). L'&#233;valuation des syst&#232;mes de traitement de l'information. Lavoisier. 
</p>
<p>COUTO J. (2006). Mod&#233;lisation des connaissances pour une navigation textuelle assist&#233;e. La 
plate-forme logicielle NaviTexte. Th&#232;se de l&#8217;Universit&#233; Paris-Sorbonne.
</p>
<p>31</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine BATTISTELLI, Marie CHAGNOUX
</p>
<p>COUTO J., MINEL J.-L. (2006). SEXTANT, un langage de mod&#233;lisation des connaissances 
pour la navigation textuelle. Actes ISDD&#8217;06, Caen, 80-90.
</p>
<p>CORNISH F. (2006). Relations de coh&#233;rence en discours : crit&#232;res de reconnaissance, 
caract&#233;risation et articulation coh&#233;sion-coh&#233;rence, Journ&#233;e d&#8217;&#233;tude du CRISCO Organisation
des textes et coh&#233;rence des discours, Universit&#233; de Caen, texte publi&#233; en ligne en 2006 
</p>
<p>CRESTAN &#201;., DE LOUPY C., MANIGOT L. (2004). Analyses s&#233;mantiques pour la navigation 
textuelle ; Actes CIDE 7, La Rochelle ; 22-25 juin 2004, 293-308. 
</p>
<p>DESCLES J.-P. (1995). Les r&#233;f&#233;rentiels temporels pour le temps linguistique. Mod&#232;les 
linguistiques 16, 9-36.
</p>
<p>DESCL&#201;S J.-P., GUENTCHEVA Z. (2000). Enonciateur, locuteur, m&#233;diateur. Erikson Ph et 
Monod-Becquelin A (&#233;ds). Les rituels du dialogue. Nanterre : Soci&#233;t&#233; d&#8217;&#233;thnologie.
</p>
<p>GUENTCHEVA Z. (&#233;d.) (2000). L&#8217;&#233;nonciation m&#233;diatis&#233;e. Louvain-Paris : Peeters. 
</p>
<p>GIGUET E., LUCAS N. (2004). La d&#233;tection automatique des citations et des locuteurs dans les 
textes informatifs. Le Discours rapport&#233; dans tous ses &#233;tats : question de fronti&#232;res, Paris,
L&#8217;Harmattan.
</p>
<p>HARABAGIU M., MAIORANO S.J., MOSCHITTI A., BEJAN A.C. (2004). Intentions, Implicatures 
and Processing of Complex Questions. Actes HLT-NAACL Workshop on Pragmatics of Q. A. 
</p>
<p>HOBBS J.R. (1990). Chap. 5 : The coherence and structure of discourse, Literature and 
Cognition, Leland Standford Junior University, Calif: CSLI Lecture Notes 21, 83-114.
</p>
<p>KRONNING H. (2003). Modalit&#233; et &#233;videntialit&#233;. Birkelund, M., Boysen, G. &amp; Kj&#230;rsgaard, P. 
S. (&#233;ds). Aspects de la Modalit&#233;, Linguistische Arbeiten 469, 131-151. 
</p>
<p>LE DRAOULEC A., P&#201;RY-WOODLEY M.-P. (2005). Encadrement temporel et relations de 
discours, Langue Fran&#231;aise 148, 45-60.
</p>
<p>MANN W.C., THOMPSON S.A. (1988). Rhetorical Structure Theory: toward a functional theory 
of text organization, Text 8(3), 243-281.
</p>
<p>P&#201;RY-WOODLEY M.-P. (2001). Pr&#233;sentation du num&#233;ro : Coh&#233;rence et relations de discours &#224; 
l&#8217;&#233;crit, Verbum, XXIII, 1.
</p>
<p>RECANATI F. (2000). Oratio Obliqua, Oratio Recta : An Essay on Metarepresentation.
Cambrige : MIT Press.  
</p>
<p>SAURI R., VERHAGEN M., PUSTEJOVSKY J. (2005). Annotating and recognizing Event 
Modality in Text. Actes FLAIRS&#8217;06, Melbourne Beach, Florida.
</p>
<p>WILSON T., WIEBE J. (2005). Annotating Attributions and Private States, Proceedings of the 
ACL Workshop on Frontiers in Corpus Annotation II: Pie in the Sky, Ann Arbor, Michigan.
</p>
<p>WONSEVER D. (2004). Rep&#233;rage automatique des propositions par exploration contextuelle.
Th&#232;se de l&#8217;Universit&#233; Paris-Sorbonne.
</p>
<p>32</p>

</div></div>
</body></html>