<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Comparaison du Lexique-Grammaire des verbes pleins et de DICOVALENCE : vers une int&#233;gration dans le Lefff</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Comparaison du Lexique-Grammaire des verbes pleins
et de DICOVALENCE : vers une int&#233;gration dans le Lefff
</p>
<p>Laurence DANLOS1, Beno&#238;t SAGOT2
1 Lattice - Universit&#233; Paris 7 - Institut Universitaire de France
2 place Jussieu, case 7003, 75251 Paris Cedex 05, France
</p>
<p>2 Projet Signes - INRIA, Dom. Universitaire
351 cours de la Lib&#233;ration, 33405 Talence Cedex, France
laurence.danlos@linguist.jussieu.fr
</p>
<p>benoit.sagot@inria.fr
</p>
<p>R&#233;sum&#233;. Cet article compare le Lexique-Grammaire des verbes pleins et DICOVALENCE,
deux ressources lexicales syntaxiques pour le fran&#231;ais d&#233;velopp&#233;es par des linguistes depuis de
nombreuses ann&#233;es. Nous &#233;tudions en particulier les divergences et les empi&#232;tements des mo-
d&#232;les lexicaux sous-jacents. Puis nous pr&#233;sentons le Lefff , lexique syntaxique &#224; grande &#233;chelle
pour le TAL, et son propre mod&#232;le lexical. Nous montrons que ce mod&#232;le est &#224; m&#234;me d&#8217;int&#233;grer
les informations lexicales pr&#233;sentes dans le Lexique-Grammaire et dans DICOVALENCE. Nous
pr&#233;sentons les r&#233;sultats des premiers travaux effectu&#233;s en ce sens, avec pour objectif &#224; terme la
constitution d&#8217;un lexique syntaxique de r&#233;f&#233;rence pour le TAL.
</p>
<p>Abstract. This paper compares the Lexicon-Grammar of full verbs and DICOVALENCE,
two syntactic lexical resources for French developed by linguists for numerous years. We focus
on differences and overlaps between both underlying lexical models. Then we introduce the
Lefff , large-coverage syntactic lexicon for NLP, and its own lexical model. We show that this
model is able to integrate lexical information present in the Lexicon-Grammar and in DICOVA-
LENCE. We describe the results of the first work done in this direction, the long term goal being
the consitution of a high-quality syntactic lexicon for NLP.
</p>
<p>Mots-cl&#233;s : lexique syntaxique, Lexique-Grammaire, DICOVALENCE, Lefff .
Keywords: syntactic lexicon, Lexicon-Grammar, DICOVALENCE, Lefff .
</p>
<p>1 Introduction
</p>
<p>&#192; l&#8217;heure actuelle, il existe deux grandes ressources lexicales syntaxiques pour le fran&#231;ais
d&#233;velopp&#233;es depuis de nombreuses ann&#233;es dans des laboratoires de linguistique : le Lexique-
Grammaire (Gross, 1975; Boons et al., 1976a; Boons et al., 1976b; Guillet &amp; Lecl&#232;re, 1992) et
le dictionnaire DICOVALENCE (Van den Eynde &amp;Mertens, 2006). L&#8217;objectif de cet article est de
comparer ces deux ressources lexicales, afin d&#8217;en tirer le meilleur parti, et de l&#8217;int&#233;grer dans le
Lefff (Lexique des Formes Fl&#233;chies du Fran&#231;ais, (Sagot, 2006; Sagot &amp; Danlos, 2007), lexique
syntaxique destin&#233; au TAL et en cours de d&#233;veloppement. Nous nous limitons ici aux seules
</p>
<p>229</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS, Beno&#238;t SAGOT
</p>
<p>entr&#233;es des verbes pleins, c&#8217;est-&#224;-dire ni fig&#233;s ni supports d&#8217;adjectifs ou de noms pr&#233;dicatifs (le
Lexique-Grammaire et le Lefff comportent des entr&#233;es pour les verbes non pleins et des entr&#233;es
non verbales, mais ceci n&#8217;est pas le cas de DICOVALENCE). Les objectifs des lexiques consid&#233;-
r&#233;s, comme de tout lexique syntaxique, sont de d&#233;finir, pour chaque lemme verbal donn&#233;, ses
diff&#233;rents emplois et, pour chacun de ces emplois, son (ou ses) cadres de sous-cat&#233;gorisation et
les informations compl&#233;mentaires qui s&#8217;y rapportent (p.ex. les informations sur le contr&#244;le).
</p>
<p>Nous pr&#233;sentons donc un travail de comparaison entre le Lexique-Grammaire et DICOVALENCE,
ressources pr&#233;sent&#233;es bri&#232;vement dans les sections 2 et 3, afin de comprendre leurs points com-
muns et leurs divergences et d&#8217;aider &#224; leur am&#233;lioration mutuelle (Section 4). Puis nous mon-
trons (Section 5) en quoi le mod&#232;le lexical utilis&#233; dans le Lefff permet de mod&#233;liser les in-
formations pr&#233;sentes dans l&#8217;une ou l&#8217;autre de ces ressources, am&#233;liorant ainsi sa pr&#233;cision, sa
couverture, et donc la qualit&#233; des outils de TAL qui l&#8217;utilisent.
</p>
<p>2 Introduction au Lexique-Grammaire
</p>
<p>Dans le Lexique-Grammaire, un cadre de sous-cat&#233;gorisation d&#180;un emploi de verbe plein, qui
donne sa valence, est d&#233;fini par deux crit&#232;res de base (non hi&#233;rarchis&#233;s) :
&#8211; nombre et nature directe ou indirecte des compl&#233;ments : le tableau ci-dessous r&#233;sume les
</p>
<p>sch&#233;mas de cadres de sous-cat&#233;gorisation d&#233;finis par ce crit&#232;re.
</p>
<p>N0 V z&#233;ro compl&#233;ment
N0 V N1 &#8212; N0 V Pre&#769;p N1 un compl&#233;ment
N0 V N1 N2 &#8212; N0 V N1 Pre&#769;p N2 deux compl&#233;ments
N0 V N1 Pre&#769;p N2 Pre&#769;p N3 &#8212; N0 V Pre&#769;p N1 Pre&#769;p N2 Pre&#769;p N3 trois compl&#233;ments
</p>
<p>Ces sch&#233;mas sont ensuite affin&#233;s selon la valeur des pr&#233;positions : sont distingu&#233;es Pr&#233;p = &#224;,
Pr&#233;p = de, Pr&#233;p = Loc, Pr&#233;p = avec et Pr&#233;p = autres.
</p>
<p>&#8211; r&#233;alisations du sujet et des compl&#233;ments ; nous employons le terme de &#171; position &#187; pour
d&#233;signer un &#233;l&#233;ment Ni, o&#249; N0 correspond au sujet et Ni (i &gt; 1) &#224; un compl&#233;ment. Une
position peut-&#234;tre r&#233;alis&#233;e comme une compl&#233;tive (not&#233;eQue P ), une infinitive (not&#233;e V inf )
ou un groupe nominal (not&#233; GN ). Pour chaque Ni, les distributions suivantes sont celles qui
sont le plus souvent retenues : Ni = Que P / V inf / GN ou Ni = V inf / GN ou
Ni = GN . &#192; ces distributions s&#8217;ajoutent le sujet impersonnel (pl&#233;onastique) r&#233;alis&#233; par les
pronoms il ou &#231;a, soit N0 = ilimp ou N0 = &#231;aimp.
</p>
<p>Les diff&#233;rents cadres de sous-cat&#233;gorisation des emplois des verbes sont structur&#233;s en Tables.
Chaque table est d&#233;finie par une propri&#233;t&#233; d&#233;finitoire. Parmi les propri&#233;t&#233;s d&#233;finitoires, on peut
distinguer les propri&#233;t&#233;s de base de celles qui sont occasionnelles :
</p>
<p>&#8211; Les propri&#233;t&#233;s d&#233;finitoires basiques correspondent &#224; l&#8217;intersection des deux crit&#232;res que nous
venons d&#8217;expliquer. Ainsi la propri&#233;t&#233; d&#233;finitoire de la Table 9 est N0 V (QueP )1 a&#768; N2,
ce qui correspond au sch&#233;ma N0 V N1 a&#768; N2 en ce qui concerne le nombre et la nature des
compl&#233;ments, et au fait que la r&#233;alisation deN1 estN1 = Que P / V inf / GN . Par exemple,
le verbe dire appartient &#224; la Table 9 parce qu&#8217;il est la t&#234;te verbale des phrases suivantes : (Luc)0
a dit &#224; (Marie)2 (qu&#8217;il faisait beau)1 / (&#234;tre malade)1 / (une b&#234;tise)11.
</p>
<p>1Dans ces phrases, a&#768; N2 appara&#238;t avantN1, en accord avec le fait que les propri&#233;t&#233;s d&#233;finitoires n&#8217;imposent pas
d&#8217;ordre sur les compl&#233;ments.
</p>
<p>230</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comparaison du Lexique-Grammaire des verbes simples et de DICOVALENCE
</p>
<p>&#8211; Les propri&#233;t&#233;s d&#233;finitoires occasionnelles servent &#224; affiner la structuration en tables obtenue
par les propri&#233;t&#233;s de base. Ainsi les verbes entrant dans le sch&#233;ma N0 V avec N0 = GN sont
r&#233;partis en deux tables selon le trait plus ou moins humain du sujet. On peut donc inclure des
traits s&#233;mantiques sur les Ni = GN dans les propri&#233;t&#233;s d&#233;finitoires. On peut aussi inclure
des traits morphologiques soit sur le verbe (par exemple, la table 32RA a pour propri&#233;t&#233;
d&#233;finitoire N0 V N1 avec N0 = GN , N1 = GN et V est un verbe d&#233;riv&#233; d&#8217;un adjectif, voir
assombrir &gt; sombre), soit sur un Ni = GN (par exemple, la Table 32CV a pour propri&#233;t&#233;
d&#233;finitoireN0 V N1 en N2 avecN0 = GN ,N1 = GN ,N2 = GN avecN2 qui est d&#233;riv&#233; d&#8217;un
verbe, voir caram&#233;liser &gt; caramel). Enfin, les propri&#233;t&#233;s d&#233;finitoires occasionnelles peuvent
inclure une relation interdite ou autoris&#233;e entre deux phrases. Par exemple, la Table 32NM
a pour propri&#233;t&#233; d&#233;finitoire N0 V N1 avec N0 = GN , N1 = GN et o&#249; la forme passive est
interdite (Cette valise p&#232;se 10 kilos, *10 kilos sont pes&#233;s par cette valise). La Table 34L0
a pour propri&#233;t&#233; d&#233;finitoire la relation de paraphrase entre N0 V Loc N1 et, par abus de
notation, N1 V de N0 (Des abeilles grouillent dans le jardin, Le jardin grouille d&#8217;abeilles).
</p>
<p>Les propri&#233;t&#233;s d&#233;finitoires basiques et occasionnelles d&#233;bouchent sur 61 tables. Les crit&#232;res
nombre et nature des compl&#233;ments et r&#233;alisation des positions n&#8217;&#233;tant pas hi&#233;rarchis&#233;s, la struc-
turation en tables peut &#234;tre pr&#233;sent&#233;e de deux mani&#232;res : (i) la pr&#233;sentation classique, o&#249; la
r&#233;alisation des positions est le premier crit&#232;re mis en avant, qui distingue les tables &#224; compl&#233;tive
ou infinitive ( &#8707; Ni avec Ni &quot;= GN ) regroupant les Tables 1 &#224; 18 de (Gross, 1975), des tables
sans compl&#233;tive ni infinitive (&#8704; Ni, Ni = GN ) regroupant les Tables 30 &#224; 40 de (Boons et al.,
1976a; Boons et al., 1976b; Guillet &amp; Lecl&#232;re, 1992) ; (ii) la pr&#233;sentation de (Lecl&#232;re, 1990) o&#249;
le nombre et la nature des compl&#233;ments est le premier crit&#232;re mis en avant.
</p>
<p>Il nous reste &#224; pr&#233;senter l&#8217;aspect matriciel des tables. Un verbe (emploi de verbe) satisfaisant la
propri&#233;t&#233; d&#233;finitoire d&#8217;une table est l&#8217;en-t&#234;te lexicale d&#8217;une ligne de la table. Une table comporte
plusieurs colonnes qui indiquent les propri&#233;t&#233;s respect&#233;es ou non par les en-t&#234;tes lexicales de la
table. Les cases de la matrice relient les propri&#233;t&#233;s aux en-t&#234;tes lexicales avec des + et des -.
</p>
<p>3 Introduction &#224; DICOVALENCE
</p>
<p>DICOVALENCE est un dictionnaire de valence verbale pour le fran&#231;ais, h&#233;ritier du lexique PRO-
TON (Van den Eynde &amp; Mertens, 2003). Il a &#233;t&#233; d&#233;velopp&#233; dans le cadre m&#233;thodologique de
l&#8217;Approche Pronominale &#8212; cf. par exemple (Blanche-Benveniste et al., 1984). Pour identifier
la valence d&#8217;un pr&#233;dicat (i.e. ses d&#233;pendants et leurs caract&#233;ristiques), l&#8217;Approche Pronominale
exploite la relation qui existe entre les d&#233;pendants dits lexicalis&#233;s (r&#233;alis&#233;s sous forme de syn-
tagmes) et les pronoms qui couvre &#171; en intention &#187; ces lexicalisations possibles. Les pronoms
(et les paranoms, cf. ci-dessous), contrairement aux syntagmes, aux fonctions syntaxiques ou
aux r&#244;les th&#233;matiques, ont deux avantages majeurs :
</p>
<p>&#8211; tout en &#233;tant des &#233;l&#233;ments de r&#233;f&#233;rence minimale, ils sont des &#233;l&#233;ments purement lin-
guistiques, d&#233;nu&#233;s des propri&#233;t&#233;s qui rendent difficile l&#8217;interpr&#233;tation de la grammaticalit&#233;
d&#8217;&#233;nonc&#233;s utilisant des d&#233;pendants syntagmatiques,
</p>
<p>&#8211; ils sont en nombre restreint : leur inventaire est fini.
</p>
<p>La valence peut donc &#234;tre obtenue sans qu&#8217;il y ait besoin d&#8217;un travail d&#8217;interpr&#233;tation, &#224; l&#8217;aide
d&#8217;une v&#233;rification syst&#233;matique et exhaustive des combinaisons entre les diff&#233;rents pronoms et
le pr&#233;dicat verbal. Les pronoms retenus forment un ensemble plus large que ce que l&#8217;on d&#233;signe
usuellement par le terme de &#171; pronom &#187; : il s&#8217;agit des pronoms clitiques, des pronoms person-
</p>
<p>231</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS, Beno&#238;t SAGOT
</p>
<p>nels pleins et des pronoms dits suspensifs (qui regroupent ce que l&#8217;on appelle habituellement
pronoms interrogatifs et adverbes interrogatifs ou ind&#233;finis, comme &#224; qui, quand,. . .). Sont &#233;ga-
lement pris en compte les paranoms, qui se distinguent des pronoms par leur modifiabilit&#233; (rien
modifi&#233; dans rien d&#8217;int&#233;ressant) et l&#8217;impossibilit&#233; de reprise par un syntagme (*il ne trouve rien,
les indices vs. il les trouve, les indices).
</p>
<p>Les combinaisons entre pr&#233;dicats et pronoms induisent des paradigmes de port&#233;e globale. Cer-
tains correspondent &#224; peu pr&#232;s aux traditionnelles fonctions syntaxiques (P0 = {je, tu, il, elle,
. . ., qui, . . .} correspond &#224; la fonction sujet (&#224; l&#8217;exclusion du il impersonnel), P1 &#224; la fonction
objet direct, P2 &#224; la fonction &#224;-objet ou dative, etc.), d&#8217;autres permettent des distinctions plus
fines que dans d&#8217;autres approches (PQ paradigme de quantit&#233;, PM paradigme de mani&#232;re, etc.)2.
</p>
<p>DICOVALENCE proprement dit se pr&#233;sente comme une liste d&#8217;entr&#233;es correspondant chacune
&#224; un emploi d&#8217;un lemme verbal3. Sont tout d&#8217;abord donn&#233;s l&#8217;entr&#233;e et son type (pr&#233;dicateur
simple, verbe adjoint, verbe auxiliaire, verbe copule, verbe de dispositif, construction r&#233;sul-
tative4). Suivent alors les diff&#233;rents paradigmes qui d&#233;pendent du pr&#233;dicateur (les termes de
valences), avec pour chacun d&#8217;eux la liste des pronoms et paranoms qui peuvent en &#234;tre la
r&#233;alisation. Sont enfin indiqu&#233;es certaines propri&#233;t&#233;s compl&#233;mentaires, dont les passivations
possibles (passif &#234;tre, se passif et/ou se faire passif ). Le tableau 1 pr&#233;sente l&#8217;entr&#233;e (unique) du
verbe supprimer extraite de DICOVALENCE.
</p>
<p>TAB. 1 &#8211; Exemple d&#8217;entr&#233;e de DICOVALENCE (repris de (Van den Eynde &amp; Mertens, 2006)).
VAL$ supprimer : P0 P1
VERB$ SUPPRIMER/supprimer
VTYPE$ predicator simple
NUM$ 80500
EX$ r : supprimer une loi / r : supprimer les obstacles
TR$ afschaffen, opheffen, intrekken, weghalen, weglaten, schrappen, doen verdwijnen
P0$ je, nous, on, qui, que, elle, il, ils, celui-ci, ceux-ci, &#231;a
P1$ te, vous, qui, ceci, la, le, les, en Q, en, que, celui-ci, ceux-ci, &#231;a, ser&#233;fl., l&#8217;un l&#8217;autre, ser&#233;c.
RP$ passif &#234;tre, se passif, se faire passif
</p>
<p>4 Comparaison entre le Lexique-Grammaire et DICOVALENCE
</p>
<p>4.1 Divergences fondamentales
</p>
<p>Avant d&#8217;entrer dans des consid&#233;rations scientifiques, signalons qu&#8217;une diff&#233;rence majeure entre
le Lexique-Grammaire et DICOVALENCE r&#233;side dans le fait que DICOVALENCE est disponible
librement dans son int&#233;gralit&#233;, alors que le Lexique-Grammaire n&#8217;est distribu&#233; que partiellement
par ses d&#233;positaires actuels5.
</p>
<p>2Un m&#234;me pronom peut appartenir &#224; plusieurs paradigmes, p.ex. nous appartient &#224; P0, P1 et P2.
3Il y a en moyenne 2,4 entr&#233;es par lemme.
4On se reportera &#224; (Van den Eynde &amp; Mertens, 2006) pour une description pr&#233;cise de ces termes.
5Environ 60% des donn&#233;es sont accessibles sur le site http://infolingu.univ-mlv.fr/. Pour les
</p>
<p>verbes pleins, seules 41 tables (sur 61) sont distribu&#233;es. Ceci emp&#234;che d&#8217;avoir une vision globale sur les entr&#233;es
d&#8217;un verbe donn&#233;, certaines entr&#233;es pouvant faire partie de tables non distribu&#233;es.
</p>
<p>232</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comparaison du Lexique-Grammaire des verbes simples et de DICOVALENCE
</p>
<p>Deux strat&#233;gies diff&#233;rentes ont &#233;t&#233; mises en &#339;uvre dans le d&#233;veloppement de ces ressources.
DICOVALENCE se concentre volontairement sur les verbes les plus fr&#233;quents (3738 lemmes),
et, pour ces verbes, sur leurs emplois les plus fr&#233;quents (8313 entr&#233;es). A contrario, le Lexique-
Grammaire s&#8217;est lanc&#233; dans une qu&#234;te sans limite d&#8217;exhaustivit&#233;, &#224; l&#8217;int&#233;r&#234;t discutable, aboutis-
sant &#224; 6500 lemmes d&#233;crits par 13 375 entr&#233;es. &#192; titre d&#8217;illustration, la Table 31H des construc-
tions de type Nhum0 V comportait 129 entr&#233;es dans l&#8217;annexe de (Boons et al., 1976a) ; cette
m&#234;me table, qui fait partie de celles qui sont distribu&#233;es librement, comporte aujourd&#8217;hui 626
verbes, dont certains lemmes peu usit&#233;s tels que bovaryser, calancher, se curedenter, ou faon-
ner. Au niveau des entr&#233;es, la m&#234;me exhaustivit&#233; est recherch&#233;e : dans la table 9 (non disponible
sauf dans (Gross, 1975)), qui, rappelons-le, a pour propri&#233;t&#233; d&#233;finitoire N0 V (Que P )1 a&#768; N2,
inclut des verbes tels que bourdonner, bramer, chuinter, coasser, couiner, croasser, cr&#233;pi-
ter, ou gargouiller (ces entr&#233;es sont analys&#233;es par &#171; fusion &#187; : bramer = dire en bramant).
D&#8217;une mani&#232;re plus g&#233;n&#233;rale, les verbes peu usit&#233;s et les entr&#233;es douteuses (correspondant &#224;
des phrases traditionnellement pr&#233;fix&#233;es par &#171; ? &#187;) sont consid&#233;r&#233;s comme acceptables par le
Lexique-Grammaire, alors que DICOVALENCE aura tendance &#224; ne pas les conserver.
</p>
<p>D&#8217;un point de vue m&#233;thodologique, le Lexique-Grammaire repose sur une structuration hi&#233;rar-
chique refl&#233;t&#233;e par une organisation en tables. &#192; l&#8217;inverse, DICOVALENCE est un ensemble non
structur&#233; d&#8217;entr&#233;es. La structuration des entr&#233;es, que l&#8217;on peut formaliser par un graphe d&#8217;h&#233;-
ritage, n&#8217;a aucune cons&#233;quence pour la r&#233;alisation d&#8217;analyseurs syntaxiques. N&#233;anmoins, une
telle structuration refl&#232;te des g&#233;n&#233;ralisations linguistiques pertinentes et facilite le d&#233;veloppe-
ment et la maintenance de ressources lexicales. C&#8217;est ce qui a amen&#233; &#224; la structuration en deux
niveaux du Lefff, un niveau intensionnel structur&#233; et un niveau extensionnel plat (Section 5.2)6.
</p>
<p>4.2 O&#249; l&#8217;un empi&#232;te sur l&#8217;autre
</p>
<p>Nous avons observ&#233; deux types d&#8217;empi&#232;tements entre les approches utilis&#233;es par le Lexique-
Grammaire et par DICOVALENCE. D&#8217;une part, le Lexique-Grammaire, fait abondamment usage
de l&#8217;approche pronominale, quoiqu&#8217;implicitement. Par exemple, le syst&#232;me Pr&#233;p = Loc, utilis&#233;
pour les compl&#233;ments pr&#233;positionnels introduits par les pr&#233;positions &#224;, de, dans, sur, sous, etc.,
est enti&#232;rement fond&#233; sur la pronominalisation de ces compl&#233;ments par les pronoms y, en, o&#249;, l&#224;,
ici, etc. De m&#234;me, la distinction entre pr&#233;positions et compl&#233;menteurs pouvant appara&#238;tre devant
les infinitives repose sur les propri&#233;t&#233;s de pronominalisation, tout comme le ph&#233;nom&#232;ne de chute
de la pr&#233;position (et de &#171; ce &#187;) devant Que P . Ainsi, la table 8 regroupe des constructions du
type N0 V de (ce Que P )1 (Luc doute de ce que Marie parte) et du type N0 V (Que P )1
(Luc doute que Marie parte), gr&#226;ce &#224; la pronominalisation en en et en de cela de la compl&#233;tive,
qu&#8217;elle soit ou non introduite par de (ce).
</p>
<p>D&#8217;autre part, DICOVALENCE ne se limite pas strictement &#224; l&#8217;&#233;tude des r&#233;alisations pronominales
des actants verbaux. Par exemple, le pronom &#231;a peut pronominaliser une compl&#233;tive &#224; l&#8217;indicatif
ou au subjonctif, mais aussi une infinitive, une concessive ou un interrogative indirecte. DICO-
VALENCE est donc oblig&#233; de sp&#233;cifier les syntagmes dont &#231;a peut &#234;tre la pronominalisation.
Ceci est fait par une mise entre parenth&#232;ses du type de syntagme correspondant : &#231;a(qpind),
&#231;a(qpsubj), &#231;a(inf), etc. Le cas &#233;ch&#233;ant, l&#8217;identifiant de r&#233;alisation syntagmatique est assorti
d&#8217;un compl&#233;menteur : &#231;a(de_inf), &#231;a(&#224;_inf), &#231;a(de ce qps), etc.
</p>
<p>6Des consid&#233;rations parall&#232;les au niveau des grammaires ont induit le d&#233;veloppement de la notion de m&#233;ta-
grammaire, description grammaticale structur&#233;e et factoris&#233;e, permettant la g&#233;n&#233;ration de grammaires classiques.
</p>
<p>233</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS, Beno&#238;t SAGOT
</p>
<p>4.3 O&#249; l&#8217;un apporte &#224; l&#8217;autre
</p>
<p>Le Lexique-Grammaire et DICOVALENCE sont deux ressources tr&#232;s riches mais incompl&#232;tes.
Toutefois, elles peuvent mutuellement s&#8217;enrichir. Ainsi, DICOVALENCE comporte des infor-
mations pr&#233;cises sur les pronoms suspensifs (cf. plus haut), tandis que le Lexique-Grammaire
ne prend pas en compte les interrogatives indirectes7 et regroupent sous l&#8217;identifiant ADV les
compl&#233;ments pronominalisables en ainsi, autant, (Pr&#233;p) quand, etc. A l&#8217;inverse, le Lexique-
Grammaire comporte des informations plus pr&#233;cises que DICOVALENCE, en particulier :
&#8211; le syst&#232;me des noms parties du corps (Npc), qui permet de rendre compte d&#8217;alternances telles
</p>
<p>que Luc caresse les cheveux de Marie / Luc lui caresse les cheveux,
&#8211; les compl&#233;ments sous-cat&#233;goris&#233;s mais non pronominalisables (cf. Table 38PL : couper le
</p>
<p>g&#226;teau en quatre parts &#233;gales, o&#249; le compl&#233;ment introduit par en n&#8217;est pas pronominalisable),
&#8211; certaines &#171; restructurations &#187;, telles que Luc copie les habitudes de L&#233;a / Luc copie L&#233;a dans
</p>
<p>ses habitudes,
&#8211; certaines relations de d&#233;rivation morphologique : rappelons, par exemple, que la table 32RA
</p>
<p>regroupe les verbes morphologiquement d&#233;riv&#233;s d&#8217;adjectifs (assombrir &gt; sombre).
Certaines propri&#233;t&#233;s ou constructions complexes, comme les diff&#233;rentes constructions prono-
minales, font l&#8217;objet de codages diff&#233;rents dans chacune des ressources. Dans un futur proche,
nous chercherons &#224; comprendre dans quelle mesure elles s&#8217;harmonisent et/ou se compl&#232;tent.
</p>
<p>En conclusion, ces deux ressources doivent imp&#233;rativement &#234;tre harmonis&#233;es et mutuellement
enrichies pour obtenir une ressource lexicale compl&#232;te du syst&#232;me verbal fran&#231;ais. Nous nous
sommes attaqu&#233;s &#224; cette t&#226;che, avec l&#8217;objectif d&#8217;enrichir une ressource destin&#233;e au TAL. C&#8217;est
ce que nous allons d&#233;crire dans la section suivante, consacr&#233;e au lexique Lefff.
</p>
<p>5 Le Lefff : pr&#233;sentation et enrichissement
</p>
<p>5.1 Historique
</p>
<p>Le d&#233;veloppement du Lefff a commenc&#233; en 2003, &#224; partir du constat suivant : &#224; cette &#233;poque,
il n&#8217;existait pas de lexique syntaxique pour le fran&#231;ais qui soit librement utilisable et dont la
couverture soit importante. La construction d&#8217;un tel lexique a donc &#233;t&#233; initi&#233;e au sein du projet
Atoll de l&#8217;INRIA par Lionel Cl&#233;ment, avec le double objectif qu&#8217;il soit adapt&#233; au TAL tout en
restant linguistiquement pertinent.
</p>
<p>Dans un premier temps, le Lefff s&#8217;est limit&#233; &#224; un lexique morphologique des verbes du fran&#231;ais,
acquis automatiquement et valid&#233; manuellement selon une technique originale (Cl&#233;ment et al.,
2004; Sagot, 2005). C&#8217;est le Lefff 1, distribu&#233; depuis 2004. Dans un second temps, le Lefff a &#233;t&#233;
&#233;tendu &#224; l&#8217;ensemble des cat&#233;gories, tout en devenant un lexique morphologique et syntaxique.
L&#8217;extension &#224; toutes les cat&#233;gories a &#233;t&#233; faite manuellement pour les cat&#233;gories ferm&#233;es, et &#224;
l&#8217;aide du lexique morphologique fran&#231;ais de Multext (Veronis, 1998) pour les noms, adjectifs
et adverbes &#8212; lexique dont la libre exploitation nous a &#233;t&#233; autoris&#233;e explicitement par son prin-
cipal auteur. Les informations syntaxiques ont &#233;t&#233; tout d&#8217;abord renseign&#233;es int&#233;gralement &#224; la
main, en profitant au mieux de l&#8217;architecture &#224; deux niveaux du Lefff (cf. ci-dessous). Depuis,
diverses techniques ont &#233;t&#233; utilis&#233;es pour &#233;tendre et corriger le Lefff : acquisition automatique
(avec validation manuelle) d&#8217;entr&#233;es morphologiques et d&#8217;informations syntaxiques atomiques
</p>
<p>7Voir cependant (Nakamura, 2006), qui a cod&#233; les interrogatives indirectes pour la Table 6 (N0 V (Que P )1).
</p>
<p>234</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comparaison du Lexique-Grammaire des verbes simples et de DICOVALENCE
</p>
<p>(Sagot, 2006; Sagot et al., 2006), corrections et ajouts manuels ou guid&#233;s par des techniques
automatiques telles la fouille d&#8217;erreurs dans les sorties d&#8217;analyseurs syntaxiques (Sagot &amp; Vil-
lemonte de La Clergerie, 2006), et recherche de mots inconnus dans de grands corpus.
</p>
<p>Le Lefff est donc aujourd&#8217;hui un lexique syntaxique &#224; large couverture pour le fran&#231;ais. Actuel-
lement en version 2.5, il est enti&#232;rement t&#233;l&#233;chargeable sous sa forme extensionnelle, et sera
prochainement t&#233;l&#233;chargeable &#233;galement sous sa forme intensionnelle, sous une licence libre
(LGPL-LR), sur le site internet www.lefff.net.
</p>
<p>5.2 Mod&#233;lisation des informations syntaxiques
</p>
<p>Le Lefff repose sur une architecture &#224; deux niveaux : (i) un lexique intensionnel, o&#249; l&#8217;informa-
tion est factoris&#233;e au maximum, qui associe &#224; chaque lemme une classe morphologique et une
classe syntaxique ; c&#8217;est &#224; ce niveau qu&#8217;est fait le travail de d&#233;veloppement &#8212; (ii) un lexique ex-
tensionnel, obtenu &#224; partir du lexique intensionnel par compilation, qui associe &#224; chaque forme
une structure repr&#233;sentant explicitement toutes les informations linguistiques associ&#233;es ; c&#8217;est
ce lexique qui est utilis&#233; par les analyseurs. Ci-dessous une entr&#233;e intensionnelle pour le lemme
manger et une entr&#233;e extensionnelle pour la forme fl&#233;chie mange :
manger v-er:std @verbe_transitif_direct,
mange v [pred=&#8217;manger1&lt;Suj:sn|cln,Obj:(sn|cla)&gt;&#8217;, cat=v, @pers, @PS13s].
</p>
<p>Au niveau intensionnel, les informations syntaxiques sont donc d&#233;crites &#224; l&#8217;aide de classes syn-
taxiques, d&#233;finies par h&#233;ritage de propri&#233;t&#233;s syntaxiques atomiques, propri&#233;t&#233;s elles-m&#234;mes d&#233;-
finies de fa&#231;on ind&#233;pendante de la d&#233;finition des classes. Au niveau extensionnel, le cadre de
sous-cat&#233;gorisation d&#8217;une forme donn&#233;e8 est constitu&#233; d&#8217;une liste de fonctions syntaxiques, cha-
cune indiquant les r&#233;alisations possibles de cette fonction ainsi que le caract&#232;re obligatoire ou
non de sa r&#233;alisation (indiqu&#233; par des parenth&#232;ses). La structure syntaxique compl&#232;te, outre le
cadre, comporte le cas &#233;ch&#233;ant des macros (introduites par &#171; @ &#187;) qui repr&#233;sentent de fa&#231;on im-
plicite des informations syntaxiques compl&#233;mentaires (contr&#244;le, attribution, (im)personnel,. . .).
</p>
<p>Les fonctions syntaxiques ne sont utilis&#233;es ni dans le Lexique-Grammaire ni dans DICOVA-
LENCE, mais les notions respectives de position et de paradigme s&#8217;en rapprochent. Elles sont
d&#233;finies dans le Lefff par des crit&#232;res proches de ceux de DICOVALENCE, d&#233;velopp&#233;s au cours
de travaux de comparaison et fusion avec le Lexique-Grammaire et DICOVALENCE (en particu-
lier sur les constructions impersonnelles, cf. (Sagot &amp; Danlos, 2007)), mais &#233;galement au cours
de travaux non publi&#233;s en collaboration avec Claire Gardent. Ces crit&#232;res reposent sur la sub-
stituabilit&#233; (en prenant en compte pronoms et syntagmes), sur le principe de r&#233;alisation unique
d&#8217;une fonction syntaxique pour un pr&#233;dicat donn&#233;, et sur l&#8217;identification de la fonction par un
paradigme de pronoms (&#224; l&#8217;exception des cas &#224; partage d&#8217;arguments, c&#8217;est-&#224;-dire les attributs)9.
</p>
<p>8Le passage de la forme intensionnelle &#224; la forme extensionnelle est &#233;galement un passage d&#8217;un lexique de
lemmes &#224; un lexique de formes. Ceci permet &#224; certaines formes d&#8217;indiquer des modifications dans leur structure
syntaxique par rapport &#224; la structure par d&#233;faut correspondant &#224; la classe syntaxique. Ainsi, bien que le conjugueur
ne construise qu&#8217;une forme pour le participe pass&#233; d&#8217;un verbe passivable, le lexique extensionnel comportera deux
entr&#233;es pour cette forme, l&#8217;une, active, avec le cadre par d&#233;faut, et l&#8217;autre, passive, dont les arguments syntaxiques
seront caract&#233;ristiques de la construction passive.
</p>
<p>9Actuellement, la liste de fonctions utilis&#233;es est la suivante : Suj (fonction sujet), Obj (fonction objet), Obj&#224;
(fonction &#224;-objet), Objde (fonction de-objet), Loc (fonction locative), Dloc (fonction d&#233;locative), Att (fonction at-
tributive), Obl et Obl2 (fonctions obliques). Une terminologie assez traditionnelle a &#233;t&#233; pr&#233;f&#233;r&#233;e, pour des questions
de lisibilit&#233;, &#224; une terminologie plus alg&#233;brique comme utilis&#233;e dans DICOVALENCE. Ce qui ne signifie &#233;videmment
pas, par exemple, que toute r&#233;alisation d&#8217;un Objde comporte la pr&#233;position de, ni, &#224; l&#8217;inverse, que tout compl&#233;ment
</p>
<p>235</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS, Beno&#238;t SAGOT
</p>
<p>Les r&#233;alisations possibles, quant &#224; elles, sont de trois types : pronoms clitiques (clitique no-
minatif (cln), accusatif (cla), datif (cld), g&#233;nitif (en), locatif (y)10), syntagme direct (syntagme
nominal (sn), adjectival (sa), infinitif (sinf), phrastique fini (scompl), interrogative indirecte
(qcompl)) et syntagme pr&#233;positionnel (syntagme direct pr&#233;c&#233;d&#233; d&#8217;une pr&#233;position, comme de-
sn, &#224;-sinf ou pour-sa ; &#224;-scompl et de-scompl repr&#233;sentent les r&#233;alisations en &#224;/de ce que P).
</p>
<p>Le Lefff extensionnel est illustr&#233; dans le Tableau 2. On notera que les listes de fonctions syn-
taxiques dans les entr&#233;es active et passive de mang&#233; sont pr&#233;sent&#233;es en ordre inverse. Ceci pour
simuler d&#8217;une fa&#231;on (trop ?) &#233;conomique les r&#244;les th&#233;matiques. Nous envisageons d&#8217;indiquer
plus explicitement les r&#244;les th&#233;matiques.
</p>
<p>TAB. 2 &#8211; Quelques entr&#233;es du Lefff extensionnel
apprend v [pred=&#8217;apprendre2&lt;Suj :sn|cln,Obj :(sn|cla|&#224;-sinf|scompl|qcompl)&gt;&#8217;,
</p>
<p>cat=v, @pers, @P13s] # Pierre apprend &#224; conduire / la conduite
imagine v [pred=&#8217;imaginer1&lt;Suj :sn|cln,Obj :(sn|cla), Att :(sn|sa|sinf|comme-sn|comme-sa)&gt;&#8217;,
</p>
<p>cat=v, @pers, @PS13s] # Pierre imagine Marie nue / se d&#233;v&#234;tir
mang&#233; v [pred=&#8217;manger1&lt;Suj :sn|cln,Obj :(sn|cla)&gt;&#8217;, cat=v, @active, @avoir, @Kms]
mang&#233; v [pred=&#8217;manger1&lt;Obl :(par-sn),Suj :sn|cln&gt;&#8217;, cat=v, @passive, @Kms]
</p>
<p>5.3 Enrichir du Lefff &#224; partir du Lexique-Grammaire et de DICOVALENCE
</p>
<p>Le Lefff repose ainsi sur une architecture efficace et un format directement utilisable en TAL.
De plus, ce format est en partie le r&#233;sultat d&#8217;un consensus issu de travaux r&#233;alis&#233;s dans le cadre
du projet ILF LexSynt. Nous avons donc commenc&#233; &#224; enrichir le Lefff &#224; partir du Lexique-
Grammaire et de DICOVALENCE, ce qui demande une connaissance approfondie de ces deux
ressources, &#233;tant donn&#233; les divergences entre les mod&#232;les lexicaux sous-jacents.
</p>
<p>Il n&#8217;est pas possible de convertir directement au format Lefff les informations lexicales pr&#233;sentes
dans le Lexique-Grammaire. Les travaux de (Gardent et al., 2005) effectuent une telle conver-
sion pour les tables distribu&#233;es (d&#233;bouchant sur le lexique Synlex-Lefff ), mais elle est indirecte,
imparfaite, et n&#233;cessite une explicitation formalis&#233;e de donn&#233;es linguistiques sous-entendues
dans le Lexique-Grammaire, apport qui n&#8217;est ni simple ni ais&#233;. Nous avons donc pr&#233;f&#233;r&#233; pour
le moment nous focaliser sur certaines constructions, mal trait&#233;es dans le Lefff , et extraire du
Lexique-Grammaire les informations lexicales pertinentes pour les y int&#233;grer. Dans sa version
actuelle (2.5), le Lefff a &#233;t&#233; am&#233;lior&#233; de cette fa&#231;on :
&#8211; pour les constructions impersonnelles verbales et adjectivales (Sagot &amp; Danlos, 2007), ex-
traites de l&#8217;outil ILIMP (Danlos, 2005) d&#233;velopp&#233; en partie &#224; partir du Lexique-Grammaire,
</p>
<p>&#8211; pour un certain nombre d&#8217;expressions verbales fig&#233;es (Danlos et al., 2006).
En revanche, la conversion de DICOVALENCE au format Lefff est plus directe. La convergence
sur un nombre important de points entre les paradigmes de DICOVALENCE et les fonctions
syntaxiques du Lefff rendent la correspondance relativement simple &#224; impl&#233;menter11. Les pa-
</p>
<p>introduit par de est la r&#233;alisation d&#8217;une fonction Objde. Pour une description plus pr&#233;cise, voir (Sagot &amp; Danlos,
2007).
</p>
<p>10On notera que le se r&#233;fl&#233;chi ou r&#233;ciproque est consid&#233;r&#233; comme une r&#233;alisation de type cla ou cld selon les cas
(Les &#233;poux se disputent / Pierre se laisse cette possibilit&#233;).
</p>
<p>11Les correspondances, &#224; quelques exceptions pr&#232;s (sujet des impersonnelles, par exemple), sont les suivantes :
P0&#8594; Suj, P1&#8594; Obj, P2&#8594; Obj&#224;, P3&#8594; Objde, PL&#8594; Loc, PDL&#8594; Dloc, PMi&#8594; Att, PQ&#8594; Att (discutable), PP
&#8594; Obl ou Obl2, PM ignor&#233; (pour le moment).
</p>
<p>236</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comparaison du Lexique-Grammaire des verbes simples et de DICOVALENCE
</p>
<p>radigmes de pronoms de DICOVALENCE peuvent &#233;galement se convertir directement en listes
de r&#233;alisations au sens du Lefff . Toutefois, le Lefff ne retranscrit pas ces paradigmes dans toute
leur richesse, et de l&#8217;information est donc perdue. Elle pourrait ne pas l&#8217;&#234;tre si l&#8217;on prenait
&#233;galement en compte les traits s&#233;mantiques que l&#8217;on peut extraire des paradigmes de pronoms
(Mertens, comm. pers.). Mais pour l&#8217;instant, DICOVALENCE n&#8217;a &#233;t&#233; utilis&#233; que pour proc&#233;der &#224;
une &#233;valuation du Lefff , pas pour compl&#233;ter et corriger ce dernier.
</p>
<p>5.4 Exemple d&#8217;&#233;valuation : les constructions verbales impersonnelles
</p>
<p>L&#8217;&#233;valuation d&#8217;un lexique comme le Lefff peut se faire naturellement via l&#8217;&#233;valuation d&#8217;ana-
lyseurs qui reposent sur lui, travail que nous effectuerons dans le futur. Mais une &#233;valuation
directe par comparaison avec d&#8217;autres ressources est &#233;galement riche d&#8217;enseignements. Pour
illustrer le dialogue que nous avons instaur&#233; entre le Lexique-Grammaire, DICOVALENCE et le
Lefff , nous avons proc&#233;d&#233; &#224; une comparaison entre le Lefff et DICOVALENCE pour les entr&#233;es
verbales impersonnelles, renseign&#233;es dans le Lefff &#224; partir d&#8217;ILIMP, et donc indirectement &#224;
partir du Lexique-Grammaire. L&#8217;&#233;valuation s&#8217;est faite sur les entr&#233;es d&#233;factoris&#233;es (une entr&#233;e
comportant des disjonctions - sur les r&#233;alisations ou &#224; cause de fonctions syntaxiques faculta-
tives - est remplac&#233;e par un ensemble d&#8217;entr&#233;es). On peut alors comparer les cadres complets,
ou se restreindre aux cadres fonctionnels (liste des fonctions syntaxiques r&#233;alis&#233;es).
</p>
<p>Au niveau des cadres fonctionnels, les r&#233;sultats sur les constructions verbales impersonnelles
sont les suivants : 60 cadres pr&#233;sents &#224; la fois dans DICOVALENCE et dans le Lefff , 160 cadres
(tous corrects) pr&#233;sents seulement dans le Lefff , et 19 cadres pr&#233;sents uniquement dans DICOVA-
LENCE (certains d&#8217;entre eux nous ont sembl&#233; inacceptables, certains autres sont la cons&#233;quence
de difficult&#233;s de conversion entre DICOVALENCE et le mod&#232;le lexical du Lefff ). Le Lefff est
donc d&#233;sormais couvrant et pr&#233;cis sur les impersonnelles.
</p>
<p>6 Conclusion
</p>
<p>L&#8217;am&#233;lioration du Lefff &#224; partir du Lexique-Grammaire et de DICOVALENCE est donc en cours
dans le but d&#8217;obtenir une ressource de r&#233;f&#233;rence pour le TAL12. En ce qui concerne le Lexique-
Grammaire, la pertinence et l&#8217;utilit&#233; de ces travaux reste limit&#233;e, compte tenu de la disponibilit&#233;
restreinte des tables. Ceci n&#8217;est pas le cas de DICOVALENCE et nous comptons effectuer &#224; partir
de cette ressource, en collaboration avec Piet Mertens, un travail sur les constructions verbales
pronominales pour augmenter la qualit&#233; du Lefff sur ce point.
</p>
<p>En amont des donn&#233;es lexicales proprement dites, le mod&#232;le lexical du Lefff est &#224; am&#233;liorer :
certains cas verbaux non triviaux sont &#224; revoir (en particulier, les modaux et verbes adjoints
(selon la terminologie de DICOVALENCE), qui correspondent respectivement aux verbes de la
Table 1 et aux verbes de perception de la Table 6 du Lexique-Grammaire), le mod&#232;le utilis&#233; pour
les constructions fig&#233;es est trop simpliste, certaines fonctions syntaxiques sont probablement &#224;
d&#233;coupler (distinguer Att d&#8217;un pseudo-objet de type PQ) ou &#224; ajouter (cf. PM), et certaines
r&#233;alisations, comme les concessives, sont &#224; mieux prendre en compte.
</p>
<p>Enfin, nous allons mettre l&#8217;accent sur diff&#233;rents types d&#8217;interface de visualisation et d&#8217;&#233;dition
du Lefff , voire de comparaison avec d&#8217;autres ressources converties au format Lefff .
</p>
<p>12Des travaux de comparaison avec Synlex-Lefff sont aussi en cours, en collaboration avec Claire Gardent.
</p>
<p>237</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence DANLOS, Beno&#238;t SAGOT
</p>
<p>R&#233;f&#233;rences
BLANCHE-BENVENISTE C., DELOFEU J., STEFANINI J. &amp; EYNDE K. V. D. (1984). Pronom
et syntaxe. L&#8217;approche pronominale et son application au fran&#231;ais. Paris : SELAF.
BOONS J.-P., GUILLET A. &amp; LECL&#200;RE C. (1976a). La structure des phrases simples en
fran&#231;ais, Classes de constructions transitives. Rapport interne, LADL, CNRS, Paris 7.
BOONS J.-P., GUILLET A. &amp; LECL&#200;RE C. (1976b). La structure des phrases simples en
fran&#231;ais, Constructions intransitives. Gen&#232;ve : Droz.
CL&#201;MENT L., SAGOT B. &amp; LANG B. (2004). Morphology based automatic acquisition of
large-coverage lexica. In Proc. of LREC&#8217;04, p. 1841&#8211;1844, Lisbon, Portugal.
DANLOS L. (2005). ILIMP : Outil pour rep&#233;rer les occurences du pronom impersonnel il. In
Actes de TALN 2005, Dourdan, France.
DANLOS L., SAGOT B. &amp; SALMON-ALT S. (2006). French frozen verbal expressions : from
lexicon-grammar to NLP applications. In Actes du colloque sur le lexique et la grammaire
2006, Palerme, Italie.
GARDENT C., GUILLAUME B., PERRIER G. &amp; FALK I. (2005). Maurice Gross&#8217; grammar
lexicon and natural language processing. In Proc. of the 2nd LTC, Poznan&#769;, Poland.
GROSS M. (1975). M&#233;thodes en syntaxe. Paris : Hermann.
GUILLET A. &amp; LECL&#200;RE C. (1992). La structure des phrases simples en fran&#231;ais : Les
constructions transitives locatives. Gen&#232;ve : Droz.
LECL&#200;RE C. (1990). Organisation du lexique-grammaire des verbes fran&#231;ais. Langue Fran-
&#231;aise, 87.
NAKAMURA T. (2006). Lexique et grammaire des interrogatives partielles en fran&#231;ais : &#233;tude
des verbes &#224; une compl&#233;tive directe. PhD thesis, Universit&#233; de Marne-la-Vall&#233;e.
SAGOT B. (2005). Automatic acquisition of a Slovak lexicon from a raw corpus. In Proc. of
TSD 2005 (LNAI 3658, c&#169;Springer-Verlag), Karlovy Vary, Czech Rep.
SAGOT B. (2006). Analyse automatique du fran&#231;ais : lexiques, formalismes, analyseurs. PhD
thesis, Universit&#233; Paris 7.
SAGOT B., CL&#201;MENT L., VILLEMONTE DE LA CLERGERIE E. &amp; BOULLIER P. (2006). The
Lefff 2 syntactic lexicon for French : architecture, acquisition, use. In Proc. of LREC&#8217;06.
SAGOT B. &amp; DANLOS L. (2007). Am&#233;liorer un lexique syntaxique &#224; l&#8217;aide des tables du
lexique-grammaire &#8211; Constructions impersonnelles et expressions verbales fig&#233;es. Cahiers du
Cental. to appear.
SAGOT B. &amp; VILLEMONTE DE LA CLERGERIE E. (2006). Error mining in parsing results.
In Proc. of ACL 2006, p. 329&#8211;336, Sydney, Australia.
VAN DEN EYNDE K. &amp; MERTENS P. (2003). La valence : l&#8217;approche pronominale et son
application au lexique verbal. Journal of French Language Studies, 13, 63&#8211;104.
VAN DEN EYNDE K. &amp; MERTENS P. (2006). Le dictionnaire de valence DICOVALENCE :
manuel d&#8217;utilisation. http ://bach.arts.kuleuven.be/dicovalence/manuel_061117.pdf.
VERONIS J. (1998). Multext-Lexicons, A set of Electronic Lexicons for European Languages.
Rapport interne.
</p>
<p>238</p>

</div></div>
</body></html>