<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers un m&#233;ta-EDL complet, puis un EDL universel pour la TAO</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Vers un m&#233;ta-EDL complet, puis un EDL universel pour la TAO 
</p>
<p>Hong-Thai NGUYEN1, Christian BOITET2
GETALP, LIG 
</p>
<p>385, av. de la Biblioth&#232;que, BP 53 F-38041 Grenoble cedex 9 
{Hong-Thai.Nguyen,Christian.Boitet}@imag.fr
</p>
<p>R&#233;sum&#233;. Un &#8220;m&#233;ta-EDL&#8221; (m&#233;ta-Environnement de D&#233;veloppement Linguiciel) pour la 
TAO permet de piloter &#224; distance un ou plusieurs EDL pour construire des syst&#232;mes de TAO 
h&#233;t&#233;rog&#232;nes. Partant de CASH, un m&#233;ta-EDL d&#233;di&#233; &#224; Ariane-G5, et de WICALE 1.0, un 
premier m&#233;ta-EDL g&#233;n&#233;rique mais aux fonctionnalit&#233;s minimales, nous d&#233;gageons les 
probl&#232;mes li&#233;s &#224; l&#8217;ajout de fonctionnalit&#233;s riches comme l&#8217;&#233;dition et la navigation en local, et 
donnons une solution impl&#233;ment&#233;e dans WICALE 2.0. Nous y int&#233;grons maintenant une base 
lexicale pour les syst&#232;mes &#224; &#171; pivot lexical &#187;, comme UNL/U++. Un but &#224; plus long terme est 
de passer d&#8217;un tel m&#233;ta-EDL g&#233;n&#233;rique multifonctionnel &#224; un EDL &#171; universel &#187;, ce qui 
suppose la r&#233;ing&#233;nierie des compilateurs et des moteurs des langages sp&#233;cialis&#233;s pour la 
programmation linguistique (LSPL) support&#233;s par les divers EDL.
</p>
<p>Abstract. A &#8220;meta-EDL&#8221; (meta-Environment for Developing Lingware) for MT allows to 
pilot one or more distant EDL in order to build heterogeneous MT systems. Starting from 
CASH, a meta-EDL dedicated to Ariane-G5, and from WICALE 1.0, a first meta-EDL, 
generic but offering minimal functionalities, we study the problems arising when adding rich 
functionalities such as local editing and navigation, and give a solution implemented in 
WICALE 2.0.  We are now integrating to it a lexical database for MT systems relying on a 
&#8220;lexical pivot&#8221;, such as UNL/U++. A longer-term goal is to evolve from such a 
multifunctional generic meta-EDL to a &#8220;universal&#8221; EDL, which would imply the 
reengineering of the compilers and engines of the specialized languages (SLLPs) supported 
by the various EDLs. 
</p>
<p>Mot-cl&#233;s : g&#233;nie linguiciel, langages sp&#233;cialis&#233;s pour la programmation linguistique, 
LSPL, environnement de d&#233;veloppement, EDL, TAO, syst&#232;mes distribu&#233;s h&#233;t&#233;rog&#232;nes.
</p>
<p>Keywords: lingware engineering, specialized languages for linguistic programming, 
development environment, EDL, MT, heterogeneous distributed MT systems.
</p>
<p>1 Introduction 
Il existe des EDL (Environnements de D&#233;veloppement Linguistique) pour syst&#232;mes de TAO, 
plus ou moins complets. Ils sont tous construits autour d&#8217;une technologie sp&#233;cifique. On peut 
citer Ariane-78 puis Ariane-G5 du GETA (Grenoble), Tapestry du CRDL (Singapour), 
ETAP-3 de l&#8217;IPPI (Moscou), et ceux des fournisseurs de syst&#232;me de TAO commerciaux, non 
disponibles pour la recherche. 
Depuis 10 ans environ, on cherche &#224; r&#233;aliser des syst&#232;mes de TAO h&#233;t&#233;rog&#232;nes, soit pour 
combiner plusieurs syst&#232;mes pour une nouvelle paire de langues (approche &#171; multimoteur &#187; 
</p>
<p>133</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Hong-Thai NGUYEN, Christian BOITET
</p>
<p>de Pangloss (Nirenburg and Frederking, 1994), VerbMobil (Ney H, Och &amp; Vogel, 2000), 
etc.), soit pour construire un syst&#232;me de TAO fortement multilingue dont les composants 
peuvent &#234;tre d&#233;velopp&#233;s par diff&#233;rents groupes, avec des approches et des EDL diff&#233;rents, 
comme dans le projet UNL (Projet UNL). 
Pour permettre le d&#233;veloppement coop&#233;ratif et distribu&#233; de ce type de syst&#232;me, une premi&#232;re 
&#233;tape consiste &#224; d&#233;velopper un &#171; m&#233;ta-EDL &#187; fonctionnant comme une interface avec 
plusieurs EDL distants, i.e. permettant d&#8217;&#233;diter et de synchroniser les composants linguiciels 
(dictionnaires, grammaires, automates) et de combiner diff&#233;rents modules distants pour 
produire des traductions. Un probl&#232;me int&#233;ressant est alors d&#8217;int&#233;grer le plus possible de 
fonctions des EDL (navigation, aide &#224; l&#8217;indexage des dictionnaires, etc.), sans devoir effectuer 
une r&#233;ing&#233;nierie de ces EDL. Enfin, comme cette approche est par nature limit&#233;e, un but plus 
ambitieux est de construire un &#171; EDL g&#233;n&#233;rique &#187; pour le d&#233;veloppement distribu&#233; de 
syst&#232;mes de TAO h&#233;t&#233;rog&#232;nes. 
Cet article est organis&#233; en trois parties. Nous d&#233;taillons d'abord les fonctionnalit&#233;s des EDL et 
des m&#233;ta-EDL, et en donnons une illustration avec CASH et WICALE 1.0. Dans la deuxi&#232;me 
partie, nous montrons les probl&#232;mes pos&#233;s par l&#8217;ajout &#224; WICALE des fonctions d&#8217;&#233;dition et de 
navigation en local, ainsi que les solutions retenues pour leur impl&#233;mentation dans WICALE 
2.0. Dans la troisi&#232;me partie, nous montrons la n&#233;cessit&#233; et la difficult&#233; d&#8217;int&#233;grer une base 
lexicale dans un m&#233;ta-EDL, et d&#233;crivons PIVAX, une base lexicale multilingue organis&#233;e 
autour d&#8217;un &#171; pivot lexical &#187;, en cours de construction. PIVAX pourra &#234;tre utilis&#233;e non 
seulement pour la TAO, en particulier pour le projet UNL/U++, mais pour d&#233;velopper 
&#8217;autres applications comme la recherche d&#8217;informations en contexte multilingue (CLIR). d
</p>
<p>2 EDL et m&#233;ta-EDL pour la TAO 
Un Environnement de D&#233;veloppement Linguistique (EDL) est un environnement de 
programmation linguistique qui connecte ou int&#232;gre un ou plusieurs LSPL (Langages 
Sp&#233;cialis&#233;s pour la Programmation Linguistique). Un EDL permet aux d&#233;veloppeurs 
linguistes de r&#233;aliser les op&#233;rations n&#233;cessaires (gestion, manipulation des linguiciels et des 
donn&#233;es, compilation, test, production) de fa&#231;on transparente. 
Un &#171; m&#233;ta EDL&#187; permet de piloter &#224; distance un ou des EDL distants. Pour l&#8217;instant, nous 
travaillons &#224; la construction d&#8217;un m&#233;ta-ED pour la TAO le plus puissant possible. Dans le 
futur, nous voulons d&#233;velopper un EDL &#171; universel &#187; permettant la r&#233;ing&#233;nierie de tout EDL. 
Les caract&#233;ristiques des EDL sont assez diff&#233;rentes de celles des IDE (environnement de 
d&#233;veloppement de logiciels). Nous l&#8217;illustrerons avec deux exemples de m&#233;ta-EDL existants. 
</p>
<p>2.1 Fonctionnalit&#233;s d&#8217;un EDL 
Table 1: comparaison des IDE et des EDL 
</p>
<p>IDE EDL
Utilisateur programmeur linguiste, lexicographe, gestionnaire, utilisateur &#8230; 
Type de 
</p>
<p>composant 
fonction, proc&#233;dure, objet, 
</p>
<p>module, paquetage&#8230; variables, mod&#232;les, grammaire, automate, dictionnaire&#8230; 
</p>
<p>Taille de 
composant petite (quelques pages) 
</p>
<p>grande (100K-1G entr&#233;es pour un gros dictionnaire de 
TA, 100-400 pages pour une grammaire d&#8217;analyse) 
</p>
<p>Type d&#8217;&#233;volution plut&#244;t stable en perp&#233;tuelle &#233;volution 
</p>
<p>Un EDL de TAO complet doit offrir 4 &#171; classes de fonctionnalit&#233;s &#187;. 
</p>
<p>134</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un m&#233;ta-EDL complet, puis un EDL universel pour la TAO 
</p>
<p>Pr&#233;paration des composants linguiciels : (1) visualisation, (2) &#233;dition, (3) tri, (4) aide &#224; 
l&#8217;indexage.
Organisation en &#233;tapes et phases : (1) gestion de versions de test pour mise au point, (2) 
gestion de cha&#238;nes d&#8217;ex&#233;cution (totale ou partielle), (3) g&#233;n&#233;ration de syst&#232;mes de TAO 
complet ou des parties de tels syst&#232;mes.  
Gestion de corpus d&#8217;essai : (1) cr&#233;ation ou modification de corpus ou de textes, (2) 
passage de tests, (3) traduction de (parties de) corpus, (4) r&#233;vision humaine.  
Actions globales : (1) extraction d&#8217;informations, (2) v&#233;rification de coh&#233;rence, (3) 
impressions avec filtrage et tri. 
</p>
<p>2.2 Les EDL de TAO existants 
Le plus complet semble toujours &#234;tre Ariane-G5 (Ariane-Y) du GETA (Figure 1), le seul qui 
permet de &#171; cr&#233;er &#187; un nouveau syst&#232;me de TAO en quelques commandes, sans intervention 
d&#8217;informaticiens. Le processus de traduction se compose de trois &#233;tapes (analyse, transfert, 
g&#233;n&#233;ration), chaque &#233;tape &#233;tant compos&#233;e de phases (obligatoires ou facultatives). 
</p>
<p>En analyse, on trouve : 
AM analyse morphologique obligatoire
</p>
<p>AX analyse expansive facultative 
</p>
<p>AY analyse expansive facultative 
</p>
<p>AS analyse structurale obligatoire
</p>
<p>En transfert, on trouve :
TL transfert lexical obligatoire
</p>
<p>TX transfert expansif facultative 
</p>
<p>TS transfert structural obligatoire
</p>
<p>TY transfert expansif facultative 
</p>
<p>En g&#233;n&#233;ration, on trouve : 
GX g&#233;n&#233;ration expansive facultative
</p>
<p>GS g&#233;n&#233;ration syntaxique obligatoire
</p>
<p>GY g&#233;n&#233;ration expansive facultative
</p>
<p>GM g&#233;n&#233;ration morphologique obligatoire
</p>
<p>Figure 1 : &#233;tapes, phases et LSPL de l'EDL Ariane-G5 
</p>
<p>Pour g&#233;n&#233;rer un syst&#232;me de TAO, l&#8217;utilisateur (un d&#233;veloppeur linguiste) &#233;crit un linguiciel 
pour chaque phase avec le LSPL ad&#233;quat, le compile et g&#233;n&#232;re une &#171; cha&#238;ne d&#8217;ex&#233;cution &#187;. 
Citons quelques EDL de TAO incomplets &#224; notre sens. 
</p>
<p>ETAP-3 de l&#8217;IPPI &#224; Moscou. L&#8217;EDL vu en d&#233;monstration est partiel, et nous n&#8217;avons pas 
trouv&#233; de r&#233;f&#233;rence le d&#233;crivant. 
Vermobil. Il n&#8217;y avait pas d&#8217;EDL pour pr&#233;parer les linguiciels, mais au maximum 
quelques script sous Linux. Par contre, il y avait un EDL pour l&#8217;int&#233;gration et la mise au 
point du syst&#232;me global, construit autour d&#8217;une structure commune (&#171; tableau noir &#187;) 
acc&#233;d&#233;e par chaque module de fa&#231;on distribu&#233;e. 
Systran (Systran). L&#224; aussi, les d&#233;veloppeurs sont informaticiens-linguistes. Les parties 
concernant les grammaires et les automates sont d&#233;finies directement dans le code source. 
Les &#171; composants &#187; &#233;crits dans les LSPL semblent n&#8217;&#234;tre que les dictionnaires et les 
</p>
<p>135</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Hong-Thai NGUYEN, Christian BOITET
</p>
<p>transducteurs finis utilis&#233;s pour la morphologie. Le cycle de d&#233;veloppement est le m&#234;me 
pour le &#171; c&#339;ur &#187; de TALN que pour les interfaces et la gestion du flot de travaux, i.e. le 
cycle de production en g&#233;nie logiciel. La partie lexicale est s&#233;par&#233;e et d&#233;velopp&#233;e avec des 
outils internes : commandes, scripts pour l&#8217;indexage, filtrage d&#8217;erreurs, etc. Le code 
source lexical (sous plusieurs formats : texte, Excel, XML&#8230;) est compil&#233; et encrypt&#233; par 
l&#8217;outil ACMulti (J. Senellart 2003). La gestion de versions est faite sous le syst&#232;me CVS. 
</p>
<p>2.3 Exemples de M&#233;ta-EDL : CASH et WICALE 1.0 
2.3.1 CASH, pour Ariane-G5 
Le syst&#232;me Ariane-G5 est normalement utilisable depuis une &#171; machine virtuelle &#187; g&#233;n&#233;r&#233;e 
par VM/ESA et accessible via http, smtp ou des sockets. Cette accessibilit&#233; ne se limite pas &#224; 
l'ex&#233;cution de traductions, mais s'&#233;tend &#224; l'ensemble du d&#233;veloppement des linguiciels, y 
compris &#224; la cr&#233;ation et &#224; la maintenance de grammaires et de dictionnaires. 
Pour faciliter cette exploitation &#224; distance, E.Blanc a r&#233;alis&#233; une interface hypertextuelle, 
CASH (Commande d'Ariane Sous Hypertexte) (E. Blanc 1996). CASH int&#232;gre plusieurs 
fonctions qui en font plus qu&#8217;un m&#233;ta-EDL, comme l&#8217;aide &#224; l&#8217;indexation dans les 
dictionnaires et l&#8217;&#233;dition graphique d&#8217;arbres et sch&#233;mas d&#8217;arbres. CASH vient d&#8217;&#234;tre converti 
de HyperCard (propre &#224; Mac OS 9) vers une plate-forme portable (Revolution). 
Dans l&#8217;exemple, 
on a cliqu&#233; sur la 
variable SUBA 
utilis&#233;e dans la 
d&#233;finition de la 
proc&#233;dure ADJ, 
d'o&#249; l'ouverture 
d'une autre 
fen&#234;tre contenant 
la d&#233;finition de 
cette variable. 
</p>
<p>Figure 2: navigation sous CASH 
</p>
<p>2.3.2 WICALE version 1.0 
Un m&#233;ta-EDL minimal pour la TA, WICALE version 1.0 (V. Carpena 2004) a &#233;t&#233; construit en 
2005. Il offre aux linguistes les m&#234;mes services d&#8217;&#233;change de donn&#233;es que CASH, mais aucun 
autre. En ce sens, il est &#171; minimal &#187;. Par contre, il est &#171; g&#233;n&#233;rique &#187; car il permet de travailler 
avec plusieurs EDL. D&#8217;un autre c&#244;t&#233;, CASH est tr&#232;s riche et tr&#232;s utile pour travailler 
sp&#233;cifiquement avec Ariane-G5. WICALE 1.0 a &#233;t&#233; exp&#233;riment&#233; avec les EDL d&#8217;Ariane-G5, 
de PILAF et d&#8217;UNL (UNL-deco du GETA). 
</p>
<p>Table 2 : comparaison entre CASH et WICALE 1.0 
</p>
<p>Echange de 
commandes et donn&#233;es 
</p>
<p>Edition de 
donn&#233;es 
</p>
<p>Navigation dans 
les donn&#233;es G&#233;n&#233;ricit&#233; 
</p>
<p>Aide aux 
linguistes 
</p>
<p>CASH oui oui oui non (sp&#233;cifique &#224; Ariane-G5) oui 
</p>
<p>WICALE 1.0 oui non non oui non 
</p>
<p>WICALE pr&#233;sente deux avantages principaux, la g&#233;n&#233;ricit&#233; et la portabilit&#233;. 
</p>
<p>136</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un m&#233;ta-EDL complet, puis un EDL universel pour la TAO 
</p>
<p>g&#233;n&#233;ricit&#233; : on peut &#233;tendre WICALE &#224; un nouvel EDL sans &#233;crire de code Java, mais 
simplement en d&#233;crivant les commandes et les donn&#233;es de cet EDL 
portabilit&#233; : elle est simplement due au fait que Java existe dans pratiquement tous les 
environnements logiciels actuels. 
</p>
<p>WICALE permet de d&#233;finir l&#8217;architecture et les commandes d&#8217;ex&#233;cution des syst&#232;mes 
connect&#233;s. (Des exemples pour Ariane-G5, PILAF et UNL-Deco sont donn&#233;s en annexe.) 
</p>
<p>Figure 3: repr&#233;sentation des commandes et sous-commandes d'un EDL sous WICALE 
</p>
<p>WICALE g&#233;n&#232;re l&#8217;interface 
correspondant aux param&#232;tres 
d&#233;finis dans l&#8217;architecture de 
chaque syst&#232;me. Exemple: en 
Ariane-G5, l&#8217;architecture est 
Machine&gt;Disque&gt;Langue&gt;.
</p>
<p>(Le code XML d&#233;crivant cette 
architecture a &#233;t&#233; supprim&#233; de  
l'annexe, faute de place.) 
</p>
<p>Figure 4: interface g&#233;n&#233;r&#233;e par WICALE 1.0 
</p>
<p>3 Enrichissement d&#8217;un m&#233;ta-EDL g&#233;n&#233;rique: WICALE 2.0 
Nous avons cherch&#233; &#224; enrichir WICALE 1.0 en utilisant la m&#234;me technique g&#233;n&#233;rique. 
</p>
<p>3.1 &#201;dition en local 
On utilise tout &#233;diteur disponible (choix param&#233;trable), alors qu&#8217;Ariane-G5 utilise seulement 
XEDIT, et on s&#8217;inspire aussi d&#8217;Ariane-G5 au niveau fonctionnel : par s&#233;curit&#233;, l&#8217;utilisateur 
&#233;dite toujours une copie du composant &#233;dit&#233;. Il y a deux modes, V (Visualisation) et M 
(Modification) : dans le premier, les modifications effectu&#233;es n&#8217;ont aucune cons&#233;quence (on 
avertit cependant l'utilisateur !).  
</p>
<p>137</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Hong-Thai NGUYEN, Christian BOITET
</p>
<p>Cette extension de WICALE 1.0 a &#233;t&#233; tr&#232;s facile &#224; r&#233;aliser, gr&#226;ce &#224; la modularit&#233; et &#224; la 
g&#233;n&#233;ricit&#233; du code. 
</p>
<p>3.2 Navigation
Il s&#8217;agit ici d&#8217;offrir une possibilit&#233; similaire &#224; celle de CASH (impl&#233;ment&#233;e par des scripts ad
hoc). Nous avons propos&#233; et impl&#233;ment&#233; une solution simple bas&#233;e sur XML et inspir&#233;e de 
Doxygen, un outil de g&#233;n&#233;ration de documentation (Doxygen). 
Dans cette approche, un programme analyse et marque la liaison entre les occurrences et la 
d&#233;finition de chaque &#233;l&#233;ment. De plus, il prend en compte certains commentaires sp&#233;ciaux 
(auteur, date, r&#233;sum&#233;, &#8230;). Finalement, un g&#233;n&#233;rateur produit des fichiers HTML o&#249; toutes les 
occurrences dans le source deviennent des liens pointant vers la page contenant la d&#233;finition. 
L&#8217;utilisateur navigue dans l&#8217;ensemble de ces fichiers HTML en utilisant n'importe quel 
navigateur Web. 
Dans WICALE 2.0, la pr&#233;paration des fichiers de navigation se passe de la m&#234;me fa&#231;on, en 
trois &#233;tapes:  
</p>
<p>transformation en XML du code source des composants linguiciels, r&#233;alis&#233;e dans notre cas 
par le compilateur d&#8217;Ariane-Y ; 
marquage : parcours de la structure interm&#233;diaire XML de chaque composant et insertion 
de liens entre d&#233;finitions et occurrences ; 
g&#233;n&#233;ration d'un fichier html pour chaque composant, avec ajout &#224; chaque occurrence d&#8217;un 
&#233;l&#233;ment d'un lien vers la position de sa d&#233;finition. 
</p>
<p>Voici un exemple tir&#233; d'un composant de &quot;d&#233;finition de variables&quot; (d&#233;finition d'un jeu de 
d&#233;corations linguistiques) :  
</p>
<p>** Commentaires entre 2 &#233;toiles et point. 
** Transformation statique Jeu_1 --&gt; Jeu_2. 
-DECVAR- dv .  ** Nom du composant: DV. 
-DECO- deco .  ** Nom du jeu : deco. 
MT             ** Temps morphologique. 
==(IMP,IPR,SPR,IPA,SPA,INF,PPR,PPA,FUT,CDL).
SEXE == (FEMININ, MASCULIN). 
DGA == (SYN, ANA, NO). 
&#8230;
</p>
<p>-CVAR-
** Transformation compl&#233;mentaire (proc&#233;dure). 
CHGMT(C;@S) == 
-SI-   MT(@S)-INC-IPR -ALORS- MT(C):=IPR; 
</p>
<p>-SNSI- MT(@S)-INC-SPR -ALORS- MT(C):=IPR; 
-SNSI- MT(@S)-INC-IPF -ALORS- MT(C):=IPA; 
-SNSI- MT(@S)-INC-SPF -ALORS- MT(C):=SPR; 
-SNSI- MT(@S)-INC-IPA -ALORS- MT(C):=IPA; 
-SNSI- MT(@S)-INC-FUT -ALORS- MT(C):=FUT; 
-SNSI- MT(@S)-INC-CDL -ALORS- MT(C):=SPA; 
-SNSI- MT(@S)-INC-IMP -ALORS- MT(C):=IMP; 
-SNSI- SUBV(@S)-E-INF -ALORS- MT(C):=INF; 
-SNSI- SUBV(@S)-E-PPR -ALORS- MT(C):=PPR; 
-SNSI- SUBV(@S)-E-PPA -ALORS- MT(C):=PPA; 
-FSI-.
&#8230;
</p>
<p>-FIN-
</p>
<p>Figure 5: navigation sous WICALE 2.0 
</p>
<p>Apr&#232;s la g&#233;n&#233;ration, on a des fichiers HTML et on peut y naviguer. 
</p>
<p>138</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un m&#233;ta-EDL complet, puis un EDL universel pour la TAO 
</p>
<p>4 Int&#233;gration d'une base de donn&#233;es lexicales multilingue 
</p>
<p>4.1 N&#233;cessit&#233; &amp; difficult&#233; 
4.1.1 N&#233;cessit&#233;
Si l'on veut d&#233;velopper un syst&#232;me de TA h&#233;t&#233;rog&#232;ne gr&#226;ce &#224; un EDL, il faut y centraliser de 
traitement des parties multilingues. En approche transfert, cela implique de traiter les 
grammaires et les dictionnaires de transfert, la partie lexicale &#233;tant la plus importante.
En approche par &#171; pivot interlingue &#187;, il faut centraliser le d&#233;veloppement des dictionnaires 
pivot-Li, pour chaque langue Li. G.S&#233;rasset a d&#233;velopp&#233; un premier exemple d&#8217;une telle base 
lexicale dans le serveur UNL-deco pour traduire le site B@bel de l&#8217;UNESCO en fran&#231;ais, 
espagnol, russe, et chinois (C. Boitet 2005). 
4.1.2 Probl&#232;mes rencontr&#233;s lors de travaux ant&#233;rieurs 
</p>
<p>CICC. C&#8217;est un projet de l&#8217;ODA (Overseas Development Agency) pour la TAO &#171; &#224; 
pivot &#187; entre japonais, chinois, tha&#239;, malais et indon&#233;sien, financ&#233; par de grosses soci&#233;t&#233;s 
japonaises actives en TAO. On y tenta de d&#233;velopper le vocabulaire IL comme un 
ensemble de &#171; concepts &#187;, identifi&#233;s uniquement &#224; l&#8217;aide de d&#233;finitions en anglais. Mais 
cette contrainte &#233;tait trop forte (comment distinguer 2 poissons par 2 d&#233;finitions ?), et il 
n&#8217;y avait pas de base de donn&#233;es partag&#233;e en acc&#232;s direct. 
UWGate. Cette base de donn&#233;es lexicales centralis&#233;e pour le projet UNL donne l&#8217;acc&#232;s 
par &#233;change de fichiers (gzip prot&#233;g&#233;), m&#234;me pour un seul article de dictionnaire. De plus, 
le d&#233;lai d&#8217;attente est bien trop long (accus&#233; de r&#233;ception apr&#232;s 2 ou 3 jours ou jamais&#8230;). 
UNL-deco. Ce service web de d&#233;conversion d&#8217;UNL vers le fran&#231;ais contient une base de 
donn&#233;es lexicales accessible par le Web en temps r&#233;el, mais actuellement limit&#233;e au 
fran&#231;ais et &#224; UNL. Elle n&#8217;a en fait pas &#233;t&#233; utilis&#233;e pour d&#233;velopper le syst&#232;me fra-UNL, 
car elle n&#8217;offre aucun outil d&#8217;aide aux travaux lexicographiques (tri, filtre, aide &#224; 
l&#8217;indexage&#8230;) et elle est inextensible &#224; N langues, au contraire de CASH+PARAX. 
</p>
<p>4.1.3 Difficult&#233; de principe 
Les probl&#232;mes d&#233;crits plus haut nous semblent provenir d'une difficult&#233; de principe, &#224; savoir 
que le probl&#232;me tr&#232;s g&#233;n&#233;ral de construire une base de donn&#233;es lexicales &#171; universelle &#187; pour 
la TAO, capable de g&#233;rer tous les aspects, de la construction des donn&#233;es jusqu&#8217;&#224; l&#8217;extraction 
automatique de dictionnaires des modules des diff&#233;rents syst&#232;mes (ex. analyse morphologique 
de Systran, transfert lexical de Neon), est quasiment insoluble. 
Non seulement les difficult&#233;s th&#233;oriques sont encore plus grandes que dans le cas d&#8217;une base 
lexicale multilingue &#171; d&#8217;usage &#187;, destin&#233;e aussi &#224; la recherche en dictionnairique multilingue, 
comme la base Papillon (Projet PAPILLON), mais les difficult&#233;s pratiques sont quasiment 
insurmontables (diversit&#233; des formats, et pire encore de la nature des informations, probl&#232;mes 
de droits de propri&#233;t&#233; intellectuelle (IPR)). 
</p>
<p>4.2 Une premi&#232;re approche, se limiter &#224; des syst&#232;mes de TAO &#224; pivot 
L&#8217;analyse r&#233;sum&#233;e ci-dessus a cependant montr&#233; qu&#8217;il devrait &#234;tre possible de simplifier ce 
probl&#232;me et d&#8217;arriver &#224; un probl&#232;me soluble en th&#233;orie, et &#224; une r&#233;alisation utile en pratique. 
La simplification dont il s&#8217;agit a deux aspects : 
</p>
<p>on consid&#232;re une architecture lexicale &#171; en &#233;toile &#187;, ou &#171; &#224; pivot &#187;, ce qui revient &#224; se 
limiter &#224; des syst&#232;mes de TAO &#224; &#171; pivot lexical &#187;. 
</p>
<p>139</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Hong-Thai NGUYEN, Christian BOITET
</p>
<p>on renonce &#224; ce que le syst&#232;me contr&#244;le totalement les donn&#233;es lexicales, jusqu&#8217;&#224; leur 
repr&#233;sentation &#171; cod&#233;e &#187; dans les divers syst&#232;mes de TAO consid&#233;r&#233;s. 
</p>
<p>Cette approche a d&#233;j&#224; &#233;t&#233; r&#233;alis&#233;e et valid&#233;e par la base de donn&#233;es lexicales PARAX (Blanc 
1999). Mais cet environnement de d&#233;veloppement, tr&#232;s adapt&#233; pour les manipulations 
lexicales, ne permet pas le travail coop&#233;ratif &#224; distance. PIVAX s&#8217;inspire donc de PARAX, 
mais l&#8217;&#233;tend au niveau structurel, et vise un fonctionnement distribu&#233; de type Wiki. 
</p>
<p>4.3 Vers PIVAX, une base de donn&#233;es lexicales contributive pour 
syst&#232;mes &#224; pivot lexical 
</p>
<p>Informations lexicales trait&#711;es  par PIVAX 
</p>
<p>Figure 6: sch&#233;ma de l'information pr&#233;sent&#233;e dans PIVAX 
</p>
<p>Dans PIVAX, on consid&#232;re que chaque syst&#232;me poss&#232;de ses propres linguiciels priv&#233;s non 
g&#233;r&#233;s par PIVAX, et partage via PIVAX la partie &#171; pivot &#187; ainsi que sa partie &#171; publique &#187;. 
Dans la partie priv&#233;e, on mettra par exemple des informations sp&#233;cifiques r&#233;serv&#233;es pour ce 
syst&#232;me comme les codes (morphologiques, syntaxiques et s&#233;mantiques) li&#233;s aux LSPL, les 
familles d&#233;rivationnelles (UL du GETA), et les formules s&#233;mantiques. La partie &#171; pivot &#187; 
contient des unit&#233;s conceptuelles (IF, CATALYST) ou des acceptions interlingues (ATLAS-
II, ULTRA, PIVOT, UNL), et la partie &#171; publique &#187; contient des lemmes ou des lexies 
(lemme avec indication de sens), entit&#233;s par essence non propri&#233;taires. 
PIVAX sera accessible pour le travail lexicographique (humain) par une interface du type de 
celle de PARAX. D&#8217;autre part, PIVAX offrira une API pour la synchronisation avec divers 
syst&#232;mes de TAO, r&#233;alis&#233;e avec les modules existants de WICALE. Notons enfin que PIVAX 
est d&#233;velopp&#233; sur la plate-forme Jibiki de G. S&#233;rasset, d&#233;j&#224; utilis&#233;e pour d&#233;velopper la base 
lexicale PAPILLON, la terminologie multilingue de la Convention Alpine (Projet LexAlp), et 
le Grand Dictionnaire Estonien-Fran&#231;ais GDEF (Projet GDEF). 
</p>
<p>Conclusion et perspectives 
Nous avons expos&#233; la conception d'un m&#233;ta-EDL g&#233;n&#233;rique et d'un EDL &#171; int&#233;grateur &#187;, qui 
ne seraient pas n&#233;cessairement limit&#233;s &#224; la TAO comme WICALE. Dans un premier temps, 
nous avons cherch&#233; &#224; incorporer au m&#233;ta-EDL WICALE 1.0 toutes les fonctions de CASH. 
Concr&#232;tement, nous y avons ajout&#233; une possibilit&#233; d&#8217;&#233;dition des composants linguiciels, puis 
une possibilit&#233; de navigation utilisant une compilation &#171; l&#233;g&#232;re &#187; vers un format XML, 
</p>
<p>140</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un m&#233;ta-EDL complet, puis un EDL universel pour la TAO 
</p>
<p>obtenant WICALE 1.1. D'autre part, nous avons d&#233;crit la construction en cours de PIVAX, 
une base de donn&#233;es lexicales contributive &#224; pivot interlingue destin&#233;e &#224; la TAO et aux autres 
applications multilingues (RI, traitement de contenu&#8230;). Nous esp&#233;rons pouvoir pr&#233;senter lors 
de TALN une premi&#232;re version de PIVAX, appliqu&#233;e au d&#233;veloppement de la base lexicale du 
projet UNL/U++ (fran&#231;ais, anglais, espagnol, russe au moins). 
</p>
<p>R&#233;f&#233;rences 
BLANC, E. (1996). Une maquette de base lexicale multilingue &#224; pivot lexical (&quot;acceptions 
multilingues&quot;): PARAX. Actes des quatri&#232;mes Journ&#233;es scientifiques du R&#233;seau &quot;Lexicologie, 
Terminologie, Traduction&quot; de l'AUF, Lyon (France), 43-58. 
BLANC, E. (1999). An interactive hypertextual environment for MT development. MT Summit 
VIII, Santiago de Compostela, Galicia, Spain, EAMT, 67-81. 
BOITET, C. (1988). Dictionnaires int&#233;gr&#233;s multiusage et multicible, une premi&#232;re expr&#233;rience. 
Colloque sur l'histoire de la terminologie, Inistitut Libre Marie Haps, Bruxelles, 6 p. 
BOITET, C. (1989). Software and lingware engineering in modern M(A)T systems. 
Computational Linguistics, an International Handbook on Computer-Oriented Language 
Research and Applications, Niemeyer, 670-682. 
BOITET, C. and N&#201;DOBEJKINE, N. (1986). Towards integrated dictionary for M(a)T: 
motivations and linguistic organization. Proc. COLING-86, Bonn, 1/1, 423-428. 
CARPENA, V. (2004). Interface cliente g&#233;n&#233;rique pour le pilotage de serveurs linguistiques. 
M&#233;moire CNAM GETA, CLIPS, Grenoble, 86 p. 
DOXYGEN. http://www.stack.nl/~dimitri/doxygen/, acc&#233;d&#233; en 2007. 
LAFOURCADE, M. (1994). G&#233;nie Logiciel pour le G&#233;nie Linguistique. Th&#232;se, UJF, Grenoble.
MANGEOT-LEREBOURS, M. (1999). Acc&#232;s unique &#224; des dictionnaires h&#233;t&#233;rog&#232;nes. VIe 
journ&#233;es scientifiques du r&#233;seau th&#233;matique LTT de l'AUF (Lexicologie, Terminologie, 
Traduction), 311-316. 
MANGEOT-LEREBOURS, M. (2001). Environnements centralis&#233;s et distribu&#233;s pour 
lexicographes et lexicologues en contexte multilingue. Th&#232;se, UJF, Grenoble, 279 p. 
MANGEOT-LEREBOURS, M., S&#201;RASSET, G. (2001). Projet Papillon: architecture du serveur 
Web. JST'2001 Journ&#233;es Science et Technologie, National Olympic Memorial Youth Center, 
Tokyo, Japon 1/1, 149-150. 
NEY, H., OCH, F. J. AND VOGEL, S. (2000). Statistical Translation of Spoken Dialogues in the 
Vermobil System. Proc. MSC2000, 69-74. 
NGUYEN, H.-T. (2005). Vers un &quot;m&#233;ta-EDL&quot;, puis un &quot;EDL g&#233;n&#233;rique&quot; pour la TAO. 
M&#233;moire de master recherche (M2R), UJF, Grenoble, 85 p. 
NIRENBURG, S. AND FREDERKING, R. (1994). Toward multi-engine machine translation. Proc.
of the workshop on Human Language Technology, Plainsboro, New Jersey, USA, 147-151. 
PROJET PAPILLON (2003). http://www.papillon-dictionary.org/, acc&#233;d&#233; en 2007. 
PROJET ARIANE-Y (2004). http://www-clips.imag.fr/geta/User/jean-
philippe.guilbaud/DOCUMENTS/ARIANE-Y/ARIANE-Y-Index.html, acc&#233;d&#233; en 2007. 
PROJET C-STAR (2004). http://www.c-star.org/, acc&#233;d&#233; en 2007. 
</p>
<p>141</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Hong-Thai NGUYEN, Christian BOITET
</p>
<p>PROJET UNL (1997). http://www.unl.ias.unu.edu/, acc&#233;d&#233; en 2007. 
PROJET GDEF (2005). http://estfra.ee/Home.po, acc&#233;d&#233; en 2007. 
PROJET LEXALP (2004). http://217.199.4.152:8080/general/lexalp/index.php, acc&#233;d&#233; en 2007. 
SENELLART, J., YANG, J. AND REBOLLO, A. (2003). Technologie &#8220;Intuitive Coding&#8221; de 
SYSTRAN. MT Summit IX, 8p. 
S&#201;RASSET, G. (1994). SUBLIM: un syst&#232;me universel de bases lexicales multilingues et 
NADIA: sa sp&#233;cialisation aux bases lexicales interlingues par acceptions. Th&#232;se, UJF,
Grenoble, 194 p. 
SYSTRAN (2006). https://systran.fr, acc&#233;d&#233; en 2007. 
</p>
<p>Annexe
Exemple de d&#233;claration des commandes d&#8217;Ariane-G5, de PILAF et d&#8217;UNL-deco : 
&lt; !---Description des commandes Ariane-G5 --&gt; 
&lt;LST_SERVEUR&gt;
 &lt;SERVEUR&gt; 
  &lt;nom_serveur&gt;ARIANE-G5&lt;/nom_serveur&gt; &lt; !--Nom de serveur --&gt; 
  &lt;classe&gt;ServerAriane&lt;/classe&gt; &lt; !--Type de serveur --&gt;
  &lt;Communication&gt;Socket&lt;/Communication&gt; &lt; !--Protocole de communication--&gt;
  &lt;adresse&gt;tupai.imag.fr&lt;/adresse&gt; &lt; !--Adresse du serveur --&gt; 
  &lt;port&gt;5768&lt;/port&gt; &lt; !--Port du serveur --&gt;
  &lt;codage&gt;iso-8859-1&lt;/codage&gt; &lt; !--Encodage des donn&#233;es --&gt;
  &lt;entete_ligne&gt; &amp;lt;&amp;lt;&amp;lt; 19283 &amp;gt;&amp;gt;&amp;gt; --- premier enregistrement --- 
ARIANET --- LIDIA20 ---. &lt;/entete_ligne&gt;
  &lt;fin_ligne&gt; &amp;lt;&amp;lt;&amp;lt; 19283 &amp;gt;&amp;gt;&amp;gt; --- premier enregistrement --- ARIANET 
--- LIDIA20 ---. &lt;/fin_ligne&gt;
 &lt;/SERVEUR&gt; 
 &lt;SERVEUR&gt; 
 &lt;nom_serveur&gt;PILAF&lt;/nom_serveur&gt; 
 &lt;classe&gt;ServerHttp&lt;/classe&gt; 
   &lt;communication&gt;Http&lt;/communication&gt; 
   &lt;adresse&gt;http://clips.imag.fr/cgi-
bin/pilaf/&lt;/adresse&gt;
   &lt;port&gt;&lt;/port&gt; 
   &lt;codage&gt;iso-8859-1&lt;/codage&gt; 
   &lt;entete_ligne&gt;&lt;/entete_ligne&gt; 
   &lt;fin_ligne&gt;&lt;/fin_ligne&gt; 
 &lt;/SERVEUR&gt; 
</p>
<p>&lt;SERVEUR&gt;
 &lt;nom_serveur&gt;UNL&lt;/nom_serveur&gt; 
 &lt;classe&gt;ServerUnl&lt;/classe&gt; 
   &lt;communication&gt;Socket&lt;/communication&gt; 
   &lt;adresse&gt;tupai.imag.fr&lt;/adresse&gt; 
   &lt;port&gt;5768&lt;/port&gt; 
   &lt;codage&gt;iso-8859-1&lt;/codage&gt; 
   &lt;entete_ligne&gt;&lt;/entete_ligne&gt; 
   &lt;fin_ligne&gt;&lt;/fin_ligne&gt; 
&lt;/SERVEUR&gt;
&lt;/LST_SERVEUR&gt;
</p>
<p>Description de la commande d&#8217;Ariane-G5 qui demande la liste des noms des corpus. En natif, 
sa forme est LISNOMCORP (Terminal | Imprimante | TI). 
&lt;COMMANDE num_cde=&quot;1&quot;&gt; 
 &lt;num_cde&gt;1&lt;/num_cde&gt; 
 &lt;nom_cde&gt;LISNOMCORP&lt;/nom_cde&gt;
 &lt;intitule_cde&gt;Liste des noms de 
corpus&lt;/intitule_cde&gt;
 &lt;PARAMETRE_SAISIE&gt; &lt;/PARAMETRE_SAISIE&gt; 
 &lt;SYNTAXE&gt; 
   &lt;ETAPE&gt; 
  &lt;mot_cle&gt;TRAIT = LISNOMCORP (*) 
&lt;/mot_cle&gt;
  &lt;num_param&gt;&lt;/num_param&gt; 
  &lt;expression&gt;&lt;/expression&gt; 
</p>
<p> &lt;separateur&gt;&amp;retour_chariot;&lt;/separateur
&gt; ... 
</p>
<p> &lt;saisie_obligatoire&gt;false&lt;/saisie_obliga
toire&gt;
   &lt;/ETAPE&gt;  
 &lt;/SYNTAXE&gt; 
</p>
<p>&lt;RESULTAT&gt;
 &lt;resultat_OK&gt;-&gt; Tout est 
O.K.&lt;/resultat_OK&gt;
 &lt;resultat_type&gt;-&gt; Tout est 
O.K.&lt;/resultat_type&gt;
   &lt;ETAPE&gt;  
  &lt;nom_methode&gt;find&lt;/nom_methode&gt; 
  &lt;expr_deb&gt;Liste des noms de 
corpus&lt;/expr_deb&gt;
  &lt;expr_corps&gt; [A-Za-z0-9]* 
&lt;/expr_corps&gt;
  &lt;expr_fin&gt;-LISTE TERMINEE-
&lt;/expr_fin&gt;
</p>
<p> &lt;expr_concat&gt;&amp;retour_chariot;&lt;/expr_c
oncat&gt;
</p>
<p> &lt;expr_remplacement&gt;&lt;/expr_remplacemen
t&gt;
   &lt;/ETAPE&gt;  
 &lt;/RESULTAT&gt;  
&lt;/COMMANDE&gt;
</p>
<p>142</p>

</div></div>
</body></html>