<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Classification d&#8217;un contenu encyclop&#233;dique en vue d&#8217;un &#233;tiquetage par entit&#233;s nomm&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Classification d&#8217;un contenu encyclop&#233;dique en vue d&#8217;un
&#233;tiquetage par entit&#233;s nomm&#233;es
</p>
<p>Eric Charton1 Juan-Manuel Torres-Moreno1
</p>
<p>(1) LIA / Universit&#233; d&#8217;Avignon, 339 chemin des Meinajari&#232;s, 84911 Avignon
eric.charton@univ-avignon.fr, juan-manuel.torres@univ-avignon.fr
</p>
<p>R&#233;sum&#233;. On utilise souvent des ressources lexicales externes pour am&#233;liorer les perfor-
mances des syst&#232;mes d&#8217;&#233;tiquetage d&#8217;entit&#233;s nomm&#233;es. Les contenus de ces ressources lexicales
peuvent &#234;tre vari&#233;s : liste de noms propres, de lieux, de marques. On note cependant que la
disponibilit&#233; de corpus encyclop&#233;diques exhaustifs et ouverts de grande taille tels que World-
net ou Wikipedia, a fait &#233;merger de nombreuses propositions sp&#233;cifiques d&#8217;exploitation de ces
contenus par des syst&#232;mes d&#8217;&#233;tiquetage. Un probl&#232;me demeure n&#233;anmoins ouvert avec ces res-
sources : celui de l&#8217;adaptation de leur taxonomie interne, complexe et compos&#233;e de dizaines
de milliers cat&#233;gories, aux exigences particuli&#232;res de l&#8217;&#233;tiquetage des entit&#233;s nomm&#233;es. Pour
ces derni&#232;res, au plus de quelques centaines de classes s&#233;mantiques sont requises. Dans cet ar-
ticle nous explorons cette difficult&#233; et proposons un syst&#232;me complet de transformation d&#8217;un
arbre taxonomique encyclop&#233;dique en une syst&#232;me &#224; classe s&#233;mantiques adapt&#233; &#224; l&#8217;&#233;tiquetage
d&#8217;entit&#233;s nomm&#233;es.
Abstract. The advent of Wikipedia and WordNet aroused new interest in labeling by na-
med entity aided by external resources. The availability of these large, multilingual, comprehen-
sive and open digital encyclopaedic corpora suggests the development of labeling solutions that
exploit the knowledge contained in these corpora. The mapping of a word sequence to an en-
cyclopedic document is possible, however the classification of encyclopaedic entities and their
related labels, is not yet fully resolved. The inconsistency of an open encyclopaedic corpus such
as Wikipedia, makes sometimes difficult establishing a relationship between its entities and a
restricted taxonomy. In this article we explore this problem and propose a complete system to
meet this need.
Mots-cl&#233;s : Etiquetage, Entit&#233;s nomm&#233;es, classification, taxonomie.
</p>
<p>Keywords: Named entity recognition, classification, taxonomie.
</p>
<p>1 Introduction
Les syst&#232;mes d&#8217;&#233;tiquetage par entit&#233;s nomm&#233;es (EEN) font le plus souvent appel &#224; plusieurs
familles de ressources : des syst&#232;mes tels que celui de (Brun &amp; Hagege, 2008) sont associ&#233;s
&#224; des analyseurs syntaxiques robustes. Ils recourent &#233;galement &#224; des ressources externes telles
que WordNet (Fellbaum, 1998) ou l&#8217;encyclop&#233;die en ligne Wikip&#233;dia 1. Ces syst&#232;mes, qu&#8217;ils
exploitent des ressources lexicales externes, ou de type automate &#224; &#233;tats finis (FSM), doivent
r&#233;guli&#232;rement &#234;tre configur&#233;s pour r&#233;pondre &#224; un besoin d&#8217;extraction pr&#233;cis : la bio-technologie
ou les textes m&#233;dicaux (Sasaki et al., 2008) par exemple. Si les syst&#232;mes &#224; base d&#8217;automates
peuvent &#234;tre rapidement adapt&#233;s par une s&#233;quence d&#8217;apprentissage, le probl&#232;me pos&#233; par les
contenus lexicaux externes tels que Wordnet ou Wikip&#233;dia est diff&#233;rent. En effet, par nature, les
</p>
<p>1. http ://www.wikipedia.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Charton, Juan-Manuel Torres-Moreno
</p>
<p>entit&#233;s encyclop&#233;diques sont tr&#232;s nombreuses (plusieurs millions d&#233;sormais pour Wikip&#233;dia) et
constituent des r&#233;servoirs d&#8217;entit&#233;s pr&#233;-existants sur lesquels doit &#234;tre appliqu&#233;e, pour chaque
besoin, une nouvelle cartographie. Or, les analyses que nous avons conduites sur quatre versions
linguistiques du corpus Wikip&#233;dia (anglaise, fran&#231;aise, allemande et espagnole) font &#233;tat non
seulement de grandes divergences de classement, mais aussi d&#8217;une grande disparit&#233; de taille de
classes.
Cette question de l&#8217;application d&#8217;une cartographie de classes &#224; un lexique d&#8217;&#233;tiquetage est &#224;
la fois importante et d&#233;licate. D&#233;licate car elle fait intervenir deux disciplines du traitement
et de l&#8217;analyse de la langue, &#224; savoir la classification et l&#8217;extraction d&#8217;information. Importante
car de la finesse ou de la souplesse d&#8217;une cat&#233;gorisation d&#8217;un corpus de connaissance appliqu&#233;
&#224; la d&#233;tection d&#8217;entit&#233;es, d&#233;pendront les performances finales du syst&#232;me d&#8217;extraction et son
adaptabilit&#233; &#224; des t&#226;ches vari&#233;es.
Cet article propose un syst&#232;me capable de g&#233;n&#233;rer un lexique issu de Wikip&#233;dia, utilisable
pour l&#8217;&#233;tiquetage d&#8217;entit&#233;s nomm&#233;es. Ce lexique est constitu&#233; par un ensemble de m&#233;tadonn&#233;es,
compos&#233;es de formes de surface des termes encyclop&#233;diques et de sacs de mots utilisables pour
la d&#233;sambiguisation.
Nous d&#233;crivons dans un premier temps les propositions r&#233;centes de dictionnaires et de lexiques
appliqu&#233;s &#224; la d&#233;tection d&#8217;entit&#233;s et reposant sur des contenus encyclop&#233;diques. Nous mettons
en perspective ces ressources avec les besoins taxonomiques d&#8217;une t&#226;che d&#8217;&#233;tiquetage par en-
tit&#233;s nomm&#233;es. Nous utilisons, &#224; titre d&#8217;exemple, les besoins rencontr&#233;s lors des campagnes
d&#8217;&#233;valuation Ace 2, CoNLL 3 ou Ester 4. Nous pr&#233;sentons ensuite le syst&#232;me de classification
que nous avons appliqu&#233; au corpus Wikip&#233;dia pour produire un lexique ais&#233;ment adaptable aux
besoins de l&#8217;&#233;tiquetage d&#8217;entit&#233;s nomm&#233;es, puis nous d&#233;crivons les r&#233;sultats de nos exp&#233;riences.
Nous avons mesur&#233; la qualit&#233; des classes d&#8217;&#233;tiquetage affect&#233;es aux entit&#233;s encyclop&#233;diques par
notre syst&#232;me, puis nous avons d&#233;ploy&#233; un syst&#232;me d&#8217;&#233;tiquetage complet sur des donn&#233;es de la
campagne Ester. Nous pr&#233;sentons pour finir nos conclusions et perspectives de d&#233;veloppement
sur ce projet naissant, et indiquons comment nous mettons &#224; la disposition de la communaut&#233;
scientifique notre syst&#232;me et les donn&#233;es lexicales qu&#8217;il contient.
</p>
<p>2 Utilisation de Wikip&#233;dia comme lexique d&#8217;entit&#233;s nomm&#233;es
L&#8217;un des premiers syst&#232;mes propos&#233;s pour exploiter un contenu encyclop&#233;dique tel que Wiki-
p&#233;dia &#224; des fins de d&#233;sambiguisation d&#8217;entit&#233;s nomm&#233;es est celui de (Bunescu &amp; Pasca, 2006).
L&#8217;id&#233;e est d&#8217;extraire de la structure particuli&#232;re de Wikip&#233;dia (pages de redirection, de synony-
mie, d&#8217;entit&#233;s) des dictionnaires d&#8217;entit&#233;s nomm&#233;es et d&#8217;associer &#224; chaque entit&#233; un sac de mots
extrait de sa description encyclop&#233;dique. Chaque terme d&#8217;un sac de mots est ensuite affect&#233; d&#8217;un
poids TF.Idf. Le principe du syst&#232;me de d&#233;tection et de d&#233;sambiguisation consiste &#224; calculer la
similarit&#233; cosinus entre le contexte d&#8217;un mot &#224; &#233;tiqueter et les sacs de mots reli&#233;s &#224; des entit&#233;s
candidates issues de Wikip&#233;dia.
La finalit&#233; de ce syst&#232;me est d&#8217;associer, avec pr&#233;cision, un mot d&#233;tect&#233; avec son entit&#233; ency-
clop&#233;dique. Dans cette d&#233;monstration, il n&#8217;existe pas &#224; proprement parler d&#8217;&#233;tiquetage selon
les standards d&#8217;&#233;valuation. Un noyau taxonomique reposant sur les cat&#233;gories de Wikip&#233;dia est
entra&#238;n&#233; avec des classifieurs du type Machine &#224; Vecteurs de Support (SVM), mais &#224; fin exclu-
sive de restreindre le champ des recherches de similarit&#233;s entre les mots d&#8217;une requ&#234;te et une
entit&#233; encyclop&#233;dique. Il est donc relativement difficile d&#8217;appliquer tel quel ce syst&#232;me dans un
</p>
<p>2. http ://www.nist.gov/speech/tests/ace/
3. http ://www.cnts.ua.ac.be/conll2003/ner/
4. http ://www.afcp-parole.org/ester/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Classification encyclop&#233;dique en vue d&#8217;un &#233;tiquetage par entit&#233;s nomm&#233;es
</p>
<p>contexte d&#8217;extraction d&#8217;entit&#233;s nomm&#233;es.
Un syst&#232;me d&#233;riv&#233; de celui de Bunescu et Pasca est pr&#233;sent&#233; dans (Jun&#8217;ichi &amp; Kentaro, 2007).
Il adjoint &#224; l&#8217;index d&#8217;entit&#233;s extraites, en exploitant les liens internes du corpus Wikip&#233;dia, un
ensemble de relations compl&#233;mentaires entre termes. Dans Wikip&#233;dia, une relation entre deux
documents peut &#234;tre repr&#233;sent&#233;e par un lien reliant une entit&#233; et sa description
(ex [[BobDylan(Singer)|Dylan]]). C&#8217;est ce type de lien qui est repris pour &#233;tendre le dic-
tionnaire de formes de surface reli&#233;es &#224; une entit&#233;. Le syst&#232;me de d&#233;tection d&#8217;entit&#233;s nomm&#233;es
n&#8217;est pas directement appliqu&#233; &#224; une t&#226;che de reconnaissance d&#8217;entit&#233;s. Ce syst&#232;me &#8211; apr&#232;s en-
trainement d&#8217;un classifieur &#224; base de Champs Conditionnels Al&#233;atoires (CRF) &#8211; associe &#224; des
&#233;tiquettes du corpus de CoNLL ( PER, LOC, ORG, MISC ) des entit&#233;s de Wikip&#233;dia, mais ne
proc&#232;de pas directement &#224; un &#233;tiquetage des entit&#233;s.
C&#8217;est dans (Wisam &amp; Silviu, 2008) que l&#8217;on trouve le syst&#232;me le plus proche de la t&#226;che d&#8217;&#233;ti-
quetage. Dans ce travail, qui reprend le syst&#232;me de (Bunescu &amp; Pasca, 2006), les pages d&#8217;une
version linguistique de Wikip&#233;dia sont classifi&#233;es en utilisant le syst&#232;me taxonomique des en-
tit&#233;s nomm&#233;es de (Sang &amp; Meulder, 2003). C&#8217;est un classifieur SVM qui est d&#233;ploy&#233; pour
attribuer une des cinq &#233;tiquettes de classes &#224; des pages d&#8217;un corpus linguistique de Wikip&#233;dia.
</p>
<p>3 Normes taxonomiques des entit&#233;s nomm&#233;es
Il n&#8217;existe pas &#224; proprement parler de standard taxonomique pour les &#233;tiquettes. N&#233;anmoins, on
observe que les propositions de classes retenues pour les syst&#232;mes d&#8217;&#233;tiquetage g&#233;n&#233;riques sont
g&#233;n&#233;ralement issues d&#8217;un tronc commun de d&#233;finitions conceptuelles, propos&#233;es lors des cam-
pagnes d&#8217;&#233;valuation. Dans les syst&#232;mes anglophones, ce sont les r&#232;gles de la campagne MUC 5
</p>
<p>ACE 6 ou CoNLL qui sont mises en &#339;uvre. Dans le monde francophone, l&#8217;unique disponibi-
lit&#233; des corpus de la t&#226;che d&#8217;&#233;tiquetage de la campagne Ester 7 a fait des r&#232;gles taxonomiques
propos&#233;es par ce groupe un standard de-facto.
De mani&#232;re g&#233;n&#233;rale, on peut observer que les principales entit&#233;s nomm&#233;es recherch&#233;es sont
regroup&#233;es dans des classes racines de type organisationnelles (ORG), individuelles (PERS),
g&#233;ographiques (LOC), des descriptions de produits ou d&#8217;objets, et plus g&#233;n&#233;ralement de toute
conception humaine (PROD). &#192; ces d&#233;finitions d&#8217;entit&#233;s sont parfois adjointes des propri&#233;t&#233;s
(les titres ou fonctions), des entit&#233;s temporelles telles que les dates (DATE), les horaires (TIME),
ou des entit&#233;s num&#233;riques (AMOUNT) telles que les poids ou les mesures.
La granularit&#233; des classes se d&#233;veloppe r&#233;guli&#232;rement. Les classes racines sont affin&#233;es dans
les r&#233;centes campagnes d&#8217;&#233;valuations (ACE 2007 et Ester 2) par des sous-classes filles plus
pr&#233;cises : ORG.COM ou ORG.NON-PROFIT, etc.
</p>
<p>3.1 Autres besoins taxonomiques exprim&#233;s
Ces grandes familles de classes sont inadapt&#233;es pour r&#233;pondre &#224; certains besoins &#233;mergents ou
particuliers : c&#8217;est le cas par exemple des classes d&#8217;&#233;tiquetage pour des entit&#233;s de types bio-
logiques ou chimiques (application &#224; la recherche m&#233;dicale (Kulick et al., 2004)). On note
aussi la n&#233;cessit&#233; d&#8217;&#233;tiquetages particuliers pour r&#233;pondre &#224; des t&#226;ches de type Question et
R&#233;ponse (Turmo et al., 2007). Par ailleurs, de nouvelles t&#226;ches d&#8217;extraction d&#8217;information ou-
vertes au cours des deux derni&#232;res ann&#233;es peuvent imposer l&#8217;usage d&#8217;un &#233;tiquetage adapt&#233; &#224;
une th&#233;matique particuli&#232;re : c&#8217;est le cas pour la construction automatique d&#8217;ontologies sur des
</p>
<p>5. http ://www.itl.nist.gov/iaui/894.02/related_projects/muc/
6. http ://nist.gov/speech/tests/ace/2008/doc/ace08-evalplan.v1.2d.pdf
7. http ://www.afcp-parole.org/ester/docs/Conventions_EN_ESTER2_v01.pdf</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Charton, Juan-Manuel Torres-Moreno
</p>
<p>individus d&#8217;apr&#232;s des corpus de pages web ou de textes, telle que propos&#233;e lors de campagnes
Web People Search (Artiles et al., 2007) en 2008 et pour une t&#226;che sp&#233;cialis&#233;e, h&#233;ritant de ACE,
intitul&#233;e Knowledge Base Population, entam&#233;e par le Nist en 2009 8. Dans ces exp&#233;riences,
les extractions d&#8217;information demand&#233;es peuvent amener &#224; rechercher des entit&#233;s particuli&#232;res
telles que les titres, les dipl&#244;mes, les adresses postales, etc.
</p>
<p>3.2 Sp&#233;cificit&#233;s de la taxonomie appliqu&#233;e au corpus Wikip&#233;dia
Les versions r&#233;centes de Wikip&#233;dia contiennent de nombreuses entit&#233;s nomm&#233;es. Mais pour
exploiter cette connaissance, il est important de la cartographier en l&#8217;adaptant &#224; des exigences
taxonomiques qui varient selon le cadre applicatif. Les particularit&#233;s taxonomiques d&#8217;une cam-
pagne d&#8217;&#233;valuation par exemple. Or, l&#8217;application &#224; Wikip&#233;dia d&#8217;une cartographie de classes
adapt&#233;es &#224; l&#8217;EEN est une t&#226;che qui se heurte &#224; plusieurs difficult&#233;s :
&#8211; Il a &#233;t&#233; soulign&#233; lors de pr&#233;c&#233;dentes campagnes d&#8217;&#233;valuation, et notamment lors du D&#233;fi
</p>
<p>Fouille de textes 2008 (Hurault-Plantet et al., 2008) qui consistait &#224; segmenter un corpus
contenant notamment des fiches Wikip&#233;dia, qu&#8217;il est difficile de d&#233;passer avec les meilleures
m&#233;thodes (num&#233;riques) une pr&#233;cision de classification sup&#233;rieure &#224; 90%, m&#234;me avec un
nombre de classes restreint. Cette pr&#233;cision est insuffisante puisqu&#8217;elle implique qu&#8217;une t&#226;che
d&#8217;EEN reposant sur les entit&#233;s d&#233;riv&#233;es de Wikip&#233;dia pourrait produire 10% d&#8217;erreurs.
</p>
<p>&#8211; La mise au point d&#8217;un classifieur non &#233;quiprobable (i.e. mod&#233;lisant &#224; la fois des classes de
tr&#232;s grande taille et d&#8217;autres de petite taille sur un m&#234;me corpus) est particuli&#232;rement d&#233;licate,
et donc peu adapt&#233;e &#224; la mod&#233;lisation de certaines classes peu repr&#233;sent&#233;es dans Wikip&#233;dia
et pourtant recherch&#233;es en EEN (c&#8217;est le cas des fonctions et des dipl&#244;mes par exemple).
</p>
<p>&#8211; La r&#233;utilisation de la taxonomie interne de Wikip&#233;dia pour en d&#233;river un nouveau syst&#232;me
de classes adapt&#233;es &#224; l&#8217;EEN, comme cela a &#233;t&#233; r&#233;cemment propos&#233; par (Suchanek et al.,
2007) pour le domaine ontologique, est d&#233;licate dans le cas de l&#8217;EEN car elle implique la
transformation d&#8217;un graphe de classes volumineux, granulaire et dont les n&#339;uds sont tr&#232;s
imbriqu&#233;s, en un arbre taxonomique compact et pr&#233;cis.
</p>
<p>On peut donc r&#233;sumer la difficult&#233; de cette t&#226;che par son exigence de r&#233;duction de classes d&#8217;un
facteur cons&#233;quent : au maximum quelques centaines de classes sont exig&#233;es en EEN. Or, nos
mesures statistiques 9 indiquent que la version fran&#231;aise 10 de Wikip&#233;dia contient 100.731 ca-
t&#233;gories et la version anglaise, 256.000. Par ailleurs la distribution de ces cat&#233;gories peut &#234;tre
repr&#233;sent&#233;e par une loi de Zipf-Mandelbrot : dans la version fran&#231;aise, la classe la mieux re-
pr&#233;sent&#233;e est celle des dates de naissances (regroupant 144.000 entit&#233;s de types personnes, soit
7,68% du corpus), suivie des d&#233;c&#232;s (69.970 entit&#233;s soit 3,7% du corpus). A la suite de ces
classes volumineuses, on trouve des milliers de cat&#233;gories qui caract&#233;risent moins de 0,1% du
corpus. Or ces micro-classes sont parfois exig&#233;es en EEN. C&#8217;est le cas des fonctions militaires
par exemple ( FONC.MIL de la campagne ESTER 2), repr&#233;sent&#233;es par 151 entit&#233;s dans Wiki-
p&#233;dia 11, ventil&#233;es sur trois classes.
On ajoutera qu&#8217;&#224; cette difficult&#233; de transformation du graphe de cat&#233;gories de Wikip&#233;dia en
arbre taxonomique adapt&#233; &#224; l&#8217;EEN, s&#8217;ajoute celle de la s&#233;lection des entit&#233;s pertinentes pour
l&#8217;EEN. Wikip&#233;dia int&#232;gre en effet 140.000 descriptions encyclop&#233;diques inutiles pour les t&#226;ches
d&#8217;EEN (des noms communs par exemple &#8211; fiche Voiture ou Dirigeable) qui sont elles aussi
r&#233;f&#233;renc&#233;es par le syst&#232;me taxonomique de l&#8217;encyclop&#233;die, et parfois m&#233;lang&#233;es avec des entit&#233;s
</p>
<p>8. Voir http ://apl.jhu.edu/ paulmac/kbp/090220-KBPTaskGuidelines.pdf
9. voir notamment www.nlgbase.org, et www.nlgbase.org/fr/stat.html
</p>
<p>10. Version du dump XML
11. voir www.nlgbase.org/fr/stat/stat_clust.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Classification encyclop&#233;dique en vue d&#8217;un &#233;tiquetage par entit&#233;s nomm&#233;es
</p>
<p>FIGURE 1 &#8211; La fiche de Victor Hugo dans Wikip&#233;dia contient un texte descriptif et une bo&#238;te
d&#8217;information (sur la droite). Dans le cas de cette fiche, la bo&#238;te d&#8217;information est celle des
&#233;crivains.
</p>
<p>FIGURE 2 &#8211; Les cat&#233;gories associ&#233;es &#224; la fiche Victor Hugo de Wikip&#233;dia.
</p>
<p>elles-m&#234;mes pertinentes 12. Ces entit&#233;s non d&#233;sir&#233;es doivent &#234;tre isol&#233;es pour ne pas introduire
de bruit dans la t&#226;che de d&#233;tection. Elles sont r&#233;f&#233;renc&#233;es dans notre syst&#232;me par le label UNK.
</p>
<p>4 Approches de classification adapt&#233;es &#224; Wikip&#233;dia
Nous avons d&#233;velopp&#233; un ensemble d&#8217;algorithmes de classification permettant d&#8217;extraire et de
structurer les contenus encyclop&#233;diques, mais aussi de transformer la classification interne tr&#232;s
complexe et ouverte de Wikip&#233;dia.
Consid&#233;rons, pour la mise au point de notre syst&#232;me, une entit&#233; encyclop&#233;dique et ses &#233;l&#233;ments
constitutifs :
&#8211; Elle contient un texte qui peut &#234;tre analys&#233; par un classifieur num&#233;rique (voir figure 1).
&#8211; Des &quot;Cat&#233;gories&quot; lui sont attribu&#233;es, faisant partie d&#8217;un graphe qui peut &#234;tre explor&#233; et par-
</p>
<p>tiellement d&#233;crit par un arbre taxonomique (voir figure 2).
&#8211; Elle contient des bo&#238;tes d&#8217;information nomm&#233;es &quot;Infobox&quot; qui d&#233;crivent des propri&#233;t&#233;s stan-
</p>
<p>dardis&#233;es de l&#8217;objet d&#233;crit par l&#8217;entit&#233; encyclop&#233;dique. Par exemple, pour un &#233;crivain, sa date
de naissance, son lieu de naissance, etc. (voir figure 1)
</p>
<p>Notre id&#233;e est de tirer parti de l&#8217;existence de ces trois &#233;l&#233;ments susceptibles de participer d&#8217;une
classification. Dans un tel cadre applicatif, nous nous trouvons face &#224; des ensembles ayant des
intersections plus ou moins larges, suivant des r&#232;gles &#224; finalit&#233;s divergentes. Notre syst&#232;me
fonctionne en deux phases que nous intitulerons Wk1 et Wk2 :
</p>
<p>12. Voir par exemple la classe Cat&#233;gorie :Universit&#233; de la version fran&#231;aise de Wikip&#233;dia qui inclut aussi bien
des &#233;tablissements que des personnes ou des concepts</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Charton, Juan-Manuel Torres-Moreno
</p>
<p>Phase Wk1 : premi&#232;re classification
</p>
<p>La premi&#232;re phase permet de cr&#233;er une classification g&#233;n&#233;rale, du niveau de l&#8217;&#233;tat de l&#8217;art pour
ce qui est de la classe racine (par exemple la classe descriptive des Organisation, ORG), et moins
exhaustive et pr&#233;cise pour ce qui est du second niveau d&#8217;&#233;tiquetage de l&#8217;arbre taxonomique
(ORG.DIV ou LOC.GEO). La phase Wk1 se d&#233;roule ainsi :
&#8211; Une &#233;tape de classification num&#233;rique est appliqu&#233;e pour inventorier les contenus affect&#233;s
</p>
<p>aux classes racines (par exemple ORG, PERS, LOC ou PROD)
&#8211; Une &#233;tape de classification est men&#233;e &#224; partir de r&#232;gles &#233;tablies d&#8217;apr&#232;s des cat&#233;gories s&#233;lec-
</p>
<p>tionn&#233;es au sein de la taxonomie de Wikip&#233;dia, pour le second niveau de classe (par exemple
ORG.DIV, LOC.ADMI ou PERS.HUM ).
</p>
<p>&#8211; Une &#233;tape de classification est conduite &#224; partir de r&#232;gles &#233;tablies d&#8217;apr&#232;s des cat&#233;gories pour
les micro-classes (tel que les titres nobiliaires ou les fonctions).
</p>
<p>&#193; l&#8217;issue de cette premi&#232;re phase, nous obtenons une premi&#232;re classification qui d&#233;crit le second
niveau taxonomique tr&#232;s partiellement. Par exemple 85% &#224; 89% des lieux sont correctement
&#233;tiquet&#233;s LOC, mais moins de la moiti&#233; des &#233;l&#233;ments de sous classes LOC.GEO ou LOC.ADMIN
est d&#233;tect&#233;e. Il faut donc affiner le processus.
</p>
<p>Phase Wk2 : perfectionnement de la classification
</p>
<p>Nous utilisons les informations d&#233;j&#224; disponibles pour proc&#233;der &#224; un nouvel apprentissage suivi
d&#8217;une nouvelle phase de classification, la phase Wk2 :
&#8211; L&#8217;apprentissage consiste &#224; inventorier la classe attribu&#233;e lors de la phase pr&#233;c&#233;dente pour
</p>
<p>chaque document Wikip&#233;dia contenant une Infobox.
&#8211; Cette information &#233;tant disponible, la probabilit&#233; qu&#8217;une classe d&#8217;&#233;tiquetage soit associ&#233;e &#224;
</p>
<p>une Infobox est &#233;valu&#233;e. Puis des r&#232;gles d&#8217;association entre Infobox et classes sont &#233;labor&#233;es
(par exemple Infobox Communes de France sera associ&#233;e &#224; LOC.ADMI).
</p>
<p>&#8211; Le corpus Wikip&#233;dia est reclass&#233; en utilisant en tant que r&#232;gles d&#8217;attribution de classe la
pr&#233;sence d&#8217;une Infobox
</p>
<p>La seconde phase de d&#233;tection Wk2 s&#8217;applique &#224; la totalit&#233; des pages contenant une Infobox 13.
A l&#8217;issue de cette phase les classes associ&#233;es aux Infobox sont fiables &#224; 99%. Apr&#232;s cette phase,
nous obtenons un gain de qualit&#233; finale de la classification &#8211; par rapport &#224; Wk1 &#8211; de l&#8217;ordre de
8% &#224; 15% (voir tableau 1).
</p>
<p>4.1 Classification num&#233;rique
Le syst&#232;me num&#233;rique utilis&#233; pour Wk1 est une fusion ternaire des r&#233;sultats produits par un
classifieur SVM, un classifieur bay&#233;sien na&#239;f et AdaBoost, tel que pr&#233;sent&#233; dans (Charton et al.,
2008). Les classes de d&#233;tection sont construites apr&#232;s application de pr&#233;-traitements au corpus
d&#8217;apprentissage : lin&#233;arisation des classes par comparaison des distributions de Zipf, utilisation
de trigrammes et application d&#8217;un anti-dictionnaire.
La fusion par vote majoritaire que nous avons d&#233;ploy&#233;e est triviale. Elle consiste &#224; confronter
les propositions des trois meilleurs classifieurs (SVMLib, Na&#239;ve Bayes, Icsiboost) pour chaque
document. Si une majorit&#233; l&#8217;emporte (2/3 ou 3/3), la classe majoritaire est choisie, dans le cas
contraire, la strat&#233;gie de fusion se replie sur le syst&#232;me le plus performant (le classifieur SVM
avec noyau lin&#233;aire).
</p>
<p>13. Mesure r&#233;alis&#233;e sur le dump XML Wikip&#233;dia r&#233;f&#233;renc&#233; frwiki-20081201-pages-articles.xml disponible sur
download.wikipedia.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Classification encyclop&#233;dique en vue d&#8217;un &#233;tiquetage par entit&#233;s nomm&#233;es
</p>
<p>Ce syst&#232;me n&#8217;est efficace que sur des classes de poids &#233;quivalents et n&#8217;est donc d&#233;ploy&#233; que sur
les classes PERS, PROD, ORG, LOC et UNK. Les classes FONC et DATE (repr&#233;sentant moins
de 1% du corpus) ne sont pas mod&#233;lisables avec ce syst&#232;me de classification, tout comme les
sous-classes.
</p>
<p>4.2 Classification d&#8217;apr&#232;s des Infobox
Pour ex&#233;cuter la phase Wk2 nous utilisons les Infobox de Wikip&#233;dia afin d&#8217;introduire un second
niveau de classement des entit&#233;s encyclop&#233;diques.
Soient un ensemble D de documents issus de Wikip&#233;dia, un ensemble C de cat&#233;gories de Wiki-
p&#233;dia et un ensemble I d&#8217;Infobox de Wikip&#233;dia. D&#233;nommons &#233;tiquette de second niveau (ESN )
la sous-classe d&#8217;une classe racine.
Consid&#233;rons un ensemble de documentsE &#8712; D appartenant &#224; une cat&#233;gorie c &#8712; C, un ensemble
de documents F &#8712; D munis d&#8217;une Infobox i &#8712; I , et un ensemble de documentsG &#8712; D &#233;tiquet&#233;s
par un label l qui est une ESN .
Soit U = E &#8745; F &#8745;G.
Tous les &#233;l&#233;ments de U ont en commun la cat&#233;gorie c, l&#8217;Infobox i et le label d&#8217;ESN l. On peut
donc en d&#233;duire une association directe entre l&#8217;Infobox i et le label d&#8217;ESN l pour les documents
de U .
Ceci nous permet d&#8217;&#233;laborer automatiquement, en partant d&#8217;un petit groupe de cat&#233;gories re-
pr&#233;sentatives de chaque ESN , la table des associations entre les Infobox et les &#233;tiquettes ESN .
Nous utilisons cette table d&#8217;associations pour reclasser toutes les entit&#233;s de Wikip&#233;dia en d&#233;tec-
tant la pr&#233;sence &#233;ventuelle d&#8217;une Infobox dans le document qui les d&#233;crit et en lui attribuant le
label d&#8217;ESN qui lui est associ&#233;e.
</p>
<p>4.3 Classification d&#8217;apr&#232;s des cat&#233;gories
Un r&#233;sidu de documents du corpus Wikip&#233;dia ne peut &#234;tre class&#233; par les deux m&#233;thodes pr&#233;c&#233;-
dentes : soit leur contenu trop faiblement informatif pour ce qui est de la classification num&#233;-
rique, soit ils ne contiennent pas d&#8217;Infobox. Pour ces documents, nous pr&#233;voyons dans la phase
Wk2 une derni&#232;re &#233;tape qui consiste &#224; associer une &#233;tiquette &#224; une cat&#233;gorie de Wikip&#233;dia. Cette
m&#233;thode peut &#234;tre tr&#232;s performante si une classe est fortement repr&#233;sentative, mais tr&#232;s co&#251;teuse
lorsque les cat&#233;gories sont mal d&#233;finies ou tr&#232;s granulaires.
On notera, par exemple, que plus de 144.000 entit&#233;s encyclop&#233;diques sont associ&#233;es &#224; la cat&#233;-
gorie Naissance en : ce type de cat&#233;gorie utilis&#233; comme r&#232;gle de d&#233;tection augmente consid&#233;ra-
blement la pr&#233;cision de la classe PERS.HUM. En revanche, la cat&#233;gorie Locution ou expression
latine qui devrait cat&#233;goriser des entit&#233;s de type UNK est de faible utilit&#233; avec les 124 &#233;l&#233;-
ments encyclop&#233;diques qu&#8217;elle contient 14. Les r&#232;gles cat&#233;gorielles, du fait de leur variabilit&#233;,
ne peuvent donc &#234;tre employ&#233;es que pour affiner ou renforcer l&#8217;&#233;tiquetage des entit&#233;s ou pour
traiter des micro-classes non mod&#233;lisables par m&#233;thodes num&#233;riques.
</p>
<p>5 Exp&#233;riences et r&#233;sultats
Pour &#233;valuer l&#8217;int&#233;r&#234;t de notre dictionnaire d&#8217;entit&#233;s nous avons proc&#233;d&#233; &#224; un ensemble d&#8217;exp&#233;-
riences et de mesures. Le standard retenu pour nos exp&#233;riences est celui &#233;tabli par la campagne
Ester 2 pour ce qui est de la taxonomie des entit&#233;s nomm&#233;es et de la v&#233;rification de couverture
du dictionnaire. Seules les entit&#233;s racines et de second niveau des familles PERS, ORG, LOC,
</p>
<p>14. Voir les analyses de cat&#233;gories sur www.nlgbase.org/fr/stat/stat_cat.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Charton, Juan-Manuel Torres-Moreno
</p>
<p>PROD et FONC ont &#233;t&#233; retenues pour ces exp&#233;riences. Les &#233;tiquettes de type AMOUNT, TIME,
ne sont pas concern&#233;es par le dictionnaire extrait de Wikip&#233;dia et ne sont donc pas mesur&#233;es ici.
Les &#233;tiquettes de type DATE qui sont pr&#233;sentes en tant que descriptifs de dates historiques dans
Wikip&#233;dia, sont mesur&#233;es &#224; titre indicatif mais ne sont pas exploit&#233;es dans le cadre applicatif de
la d&#233;tection.
Nous avons tout d&#8217;abord &#233;valu&#233; la qualit&#233; de la classification des entit&#233;s de Wikip&#233;dia obtenues
avec les algorithmes Wk1 et Wk2 en mesurant la pr&#233;cision et le rappel d&#8217;apr&#232;s un &#233;chantillon
de r&#233;f&#233;rence. Nous avons ensuite introduit le dictionnaire produit d&#8217;apr&#232;s Wikip&#233;dia dans un
syst&#232;me d&#8217;&#233;tiquetage inspir&#233; de la proposition de (Bunescu &amp; Pasca, 2006) et &#233;valu&#233; ses perfor-
mances sur une partie des transcriptions &#233;tiquet&#233;es de la campagne ESTER 2.
</p>
<p>5.1 Mesure de la classification
</p>
<p>Les r&#233;sultats de l&#8217;attribution de classes d&#8217;&#233;tiquetages aux entit&#233;s nomm&#233;es repr&#233;sent&#233;es par les
entit&#233;s encyclop&#233;diques de Wikip&#233;dia sont pr&#233;sent&#233;s dans le tableau 1. Les donn&#233;es de r&#233;f&#233;rence
utilis&#233;es pour mesurer la pr&#233;cision et le rappel sont fournies par un corpus de 5.500 entit&#233;s
extraites al&#233;atoirement dans Wikip&#233;dia ; 4.800 entit&#233;s de r&#233;f&#233;rence sont &#233;tiquet&#233;es de mani&#232;re
semi-automatique et corrig&#233;es &#224; la main ; 700 entit&#233;s de r&#233;f&#233;rence sont enti&#232;rement &#233;tiquet&#233;es &#224;
la main.
</p>
<p>Classes Wk1 Classification num&#233;rique Wk2 : Classification compl&#232;te
(p&#772;) (r&#772;) (F&#772;-s) (p&#772;) (r&#772;) (F&#772;-s)
</p>
<p>Pers 0,92 0,91 0,92 0,95 0,97 0,96
Org 0,74 0,83 0,79 0,82 0,89 0,87
Loc 0,85 0,89 0,87 0,93 0,96 0,95
Prod 0,80 0,94 0,86 0,90 0,95 0,93
Unk 0,95 0,78 0,85 0,96 0,92 0,94
Date - - - 1 1 1
Fonc - - - 1 1 1
Total 0,86 0,95
</p>
<p>TABLE 1 &#8211; Precision (p&#772;), Rappel (r&#772;), F-Score (F&#772;-s) obtenus sur le jeu de test
</p>
<p>Ce tableau est divis&#233; en deux sections : la premi&#232;re pr&#233;sente le F-Score 15 obtenu pour chaque
classe par la classification num&#233;rique de l&#8217;algorithme Wk1 ; la seconde met en &#233;vidence l&#8217;am&#233;-
lioration obtenue apr&#232;s utilisation des modes de d&#233;tection de classes compl&#233;mentaires offerts
par les classifieurs de l&#8217;algorithme Wk2. Les scores d&#233;taill&#233;s des sous-classes introduites dans
l&#8217;algorithme Wk2 ne sont pas pr&#233;sent&#233;s ici 16. En effet, seules les classes racines sont classifi&#233;es
&#224; la fois par Wk1 et Wk2 ce qui permet une comparaison des r&#233;sultats obtenus (les sous-classes
n&#8217;&#233;tant classifi&#233;es que par Wk2).
&#192; l&#8217;exception de la classe ORG qui pose des probl&#232;mes de mod&#233;lisation sp&#233;cifiques 17, la pr&#233;-
cision et le rappel obtenus sur des entit&#233;s class&#233;es semblent suffisamment &#233;lev&#233;s (de l&#8217;ordre de
95% de pr&#233;cision) pour envisager une utilisation dans une t&#226;che d&#8217;EEN.
</p>
<p>15. Mesure harmonique combinant la pr&#233;cision et le rappel.
16. Voir le d&#233;tail des sous classes sur www.nlgbase.org/fr/stat/stat_clust.html
17. La classe ORG pr&#233;vue par la campagne ESTER 2 fait cohabiter des partis politiques, des organisations com-
</p>
<p>merciales, des entit&#233;s g&#233;opolitiques et des &#233;missions de divertissements. Ces entit&#233;s sont suffisamment diff&#233;rentes
pour rendre d&#233;licate la mise au point de leur classe de d&#233;tection</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Classification encyclop&#233;dique en vue d&#8217;un &#233;tiquetage par entit&#233;s nomm&#233;es
</p>
<p>5.2 Mesure de l&#8217;&#233;tiquetage
L&#8217;&#233;tiquetage est r&#233;alis&#233; sur les transcriptions pr&#233;-&#233;tiquet&#233;es et manuellement corrig&#233;es de la
campagne Ester 2. Nous avons s&#233;lectionn&#233; un ensemble de trois transcriptions repr&#233;sentatives
de ce corpus 18 et mesur&#233; le Slot Error Rate (SER) 19. Le SER est mesur&#233; en distinguant trois
types d&#8217;erreurs : In les insertions, qui sont des entit&#233;s d&#233;tect&#233;es n&#8217;ayant aucun mot commun
avec une entit&#233; de r&#233;f&#233;rence, De les suppressions ou entit&#233;s manqu&#233;es par le syst&#232;me, et Su les
entit&#233;s substitu&#233;es, c&#8217;est &#224; dire correspondant de mani&#232;re incorrecte &#224; des entit&#233;s de r&#233;f&#233;rence.
Cette derni&#232;re mesure est particuli&#232;rement int&#233;ressante dans notre cadre applicatif puisqu&#8217;elle
correspond aux erreurs de classification des entit&#233;s. En notant R l&#8217;ensemble des entit&#233;s de r&#233;f&#233;-
rence on obtient la formule de calcul de SER comme suit : SER = (In+De+ Su)/R.
</p>
<p>Entit&#233;s R In De Su SER
ORG 240 23 5 10 0,15
PERS 1071 15 60 6 0,07
LOC 190 19 6 2 0,14
PROD 110 21 0 2 0,20
FONC 26 10 0 7 0,65
Total 1637 88 71 27 0,12
</p>
<p>Ces transcriptions repr&#233;sentent 35.000 mots et 1.637 entit&#233;s &#224; &#233;tiqueter. Nous ne mesurons pas
dans cette exp&#233;rience les performances de d&#233;tection sur les classes d&#8217;EN temporelles (DATE,
AMOUNT). On observe dans ces r&#233;sultats un bon niveau de performance sur les entit&#233;s de type
PERS (SER &lt; 7%) qui sont par ailleurs particuli&#232;rement bien retrouv&#233;es et &#233;tiquet&#233;es par notre
syst&#232;me (F-Score de 0,96) dans le corpus Wikip&#233;dia.
L&#8217;&#233;tiquette de fonction FONC cr&#233;e des difficult&#233;s particuli&#232;res : cette classe est difficile &#224; construire
d&#8217;apr&#232;s les informations trop fragmentaires extraites depuis Wikip&#233;dia et la d&#233;tection de ses
entit&#233;s par des syst&#232;mes &#224; base de r&#232;gles ou d&#8217;automates semble plus appropri&#233;e pour son &#233;ti-
quetage. On doit probablement voir dans cette particularit&#233; que le contexte d&#8217;une entit&#233; de type
attribut (comme une fonction) est moins bien mesur&#233; par similarit&#233; cosinus avec l&#8217;algorithme
de (Bunescu &amp; Pasca, 2006) que celui d&#8217;une entit&#233; de type nom propre.
</p>
<p>6 Conclusion
Nous avons pr&#233;sent&#233; un syst&#232;me capable de produire, d&#8217;apr&#232;s un corpus encyclop&#233;dique tel
que Wikip&#233;dia, un dictionnaire d&#8217;entit&#233;s nomm&#233;es &#233;tiquet&#233;es, pr&#234;tes &#224; l&#8217;emploi dans une t&#226;che
d&#8217;EEN et utilisant des mesures de similarit&#233; pour d&#233;sambig&#252;iser des entit&#233;s en contexte. Les
performances obtenues nous permettent d&#8217;envisager que ce type de ressources puisse faire pro-
gresser significativement les applications d&#8217;EEN.
Le corpus d&#8217;entit&#233;s class&#233;es que nous proposons est disponible en t&#233;l&#233;chargement 20. Avec cette
mise &#224; disposition nous esp&#233;rons que notre contribution permettra &#224; des chercheurs d&#233;sireux de
d&#233;velopper leur propre syst&#232;me d&#8217;&#233;tiquetage, de gagner du temps.
En l&#8217;&#233;tat notre corpus d&#8217;entit&#233;s class&#233;es permet d&#8217;extraire facilement des sous-lexiques sp&#233;cia-
lis&#233;s de noms propres, de noms de personnes ou de lieux. &#192; terme, nous envisageons de faire
&#233;voluer nos algorithmes vers un syst&#232;me d&#8217;&#233;tiquetage et d&#8217;extraction d&#8217;information applicable
dans des campagnes tels que Weps ou KBP.
</p>
<p>18. L&#8217;exp&#233;rience est reproductible sur www.nlgbase.org/perl/nlgetiq.pl
19. J. Makhoul, F. Kubala, R. Schwartz, and R. Weischedel, Performance measures for information extraction,
</p>
<p>in Proceedings of DARPA Broadcast News Workshop, February 1999
20. Consulter www.nlgbase.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Charton, Juan-Manuel Torres-Moreno
</p>
<p>R&#233;f&#233;rences
ARTILES J., GONZALO J. &amp; SEKINE S. (2007). The semeval-2007 weps evaluation : Establi-
shing a benchmark for the web people search task. In Proceedings of the Fourth International
Workshop on Semantic Evaluations (SemEval-2007), p. 64&#8211;69, Prague, Czech Republic : As-
sociation for Computational Linguistics.
</p>
<p>BRUN C. &amp; HAGEGE C. (2008). V&#233;rification s&#233;mantique pour l&#8217;annotation d&#8217;entit&#233;s nom-
m&#233;es. In TALN08, Actes de la conf&#233;rence TALN-RECITAL 08, 2008, Avignon.
</p>
<p>BUNESCU R. &amp; PASCA M. (2006). Exploiting wikipedia as external knowledge for named
entity recognition. In ACLWEB Antology 2006.
</p>
<p>CHARTON E., CAMELIN N., ACUNA-AGOST R., GOTAB P., LAVALLEY R., KESSLER R. &amp;
FERNANDEZ S. (2008). Pr&#233;traitements classiques ou par analyse distributionnelle : application
aux m&#233;thodes de classification automatique d&#233;ploy&#233;es pour deft08. In Atelier DEFT&#8217;08, Actes
de la conf&#233;rence TALN-RECITAL 08, 2008, Avignon, p. 101&#8211;110.
</p>
<p>C. FELLBAUM, Ed. (1998). WordNet An Electronic Lexical Database. Cambridge, MA ;
London : The MIT Press.
</p>
<p>HURAULT-PLANTET M., BERTHELIN J.-B., AYARI S. E., GROUIN C., LOISEAU S. &amp; PA-
ROUBEK P. (2008). R&#233;sultats de l&#8217;&#233;dition 2008 du defi fouille de textes. In Actes de l&#8217;atelier
DEFT&#8217;08, TALN08 Avignon : limsi.fr.
</p>
<p>JUN&#8217;ICHI K. &amp; KENTARO T. (2007). Exploiting wikipedia as external knowledge for named
entity recognition. In Joint Conference on Empirical Methods in Natural Language Processing
and Computational Natural Language Learning, p. 698&#8211;707.
</p>
<p>KULICK S., BIES A., LIBERMAN M., MANDEL M., MCDONALD R., PALMER M., SCHEIN
A. &amp; UNGAR L. (2004). Integrated annotation for biomedical information extraction. In
HLT/NAACL 2004 Workshop : Biolink 2004, pp. 61-68.
</p>
<p>SANG E. T. K. &amp; MEULDER F. D. (2003). Introduction to the conll-2003 shared task :
Language-independent named entity recognition. In Proceedings of CoNLL-2003, Edmonton,
Canada, 2003, pp. 142-147.
</p>
<p>SASAKI Y., TSURUOKA Y., MCNAUGHT J. &amp; ANANIADOU S. (2008). How to make the
most of ne dictionaries in statistical ner. BMC bioinformatics, 9 Suppl 11.
SUCHANEK F. M., KASNECI G. &amp; WEIKUM G. (2007). Yago, a core of semantic knowledge.
In Proceedings of WWW 2007.
</p>
<p>TURMO D., COMAS P., AYACHE C., MOSTEFA D., ROSSET S. &amp; LAMEL L. (2007). Over-
view of qast 2007. In Working Notes for the CLEF 2007 Workshop, Budapest, Hungary,
September 2007.
</p>
<p>WISAM D. &amp; SILVIU C. (2008). Augmenting wikipedia with named entity tags. In ACL
Proceedings of the Third International Joint Conference on Natural Language Processing.</p>

</div></div>
</body></html>