<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me modulaire d&#8217;acquisition automatique de traductions &#224; partir du Web</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TAL&#4; 2009, Senlis, 24-26 juin 2009 
</p>
<p>Un syst&#232;me modulaire d&#8217;acquisition automatique de traductions &#224; 
</p>
<p>partir du Web 
</p>
<p>St&#233;phanie L&#233;on 
</p>
<p>LIRMM, 161 rue Ada, 34392 Montpellier Cedex 51 
stephanie.leon@lirmm.fr 
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons une m&#233;thode de Traduction Automatique d&#8217;Unit&#233;s Lexicales 
Complexes (ULC) pour la construction de ressources bilingues fran&#231;ais/anglais, bas&#233;e sur un 
syst&#232;me modulaire qui prend en compte les propri&#233;t&#233;s linguistiques des unit&#233;s sources 
(compositionnalit&#233;, polys&#233;mie, etc.). Notre syst&#232;me exploite les diff&#233;rentes &#171; facettes &#187; du 
Web multilingue pour valider des traductions candidates ou acqu&#233;rir de nouvelles traductions. 
Apr&#232;s avoir collect&#233; une base d&#8217;ULC en fran&#231;ais &#224; partir d&#8217;un corpus de pages Web, nous 
passons par trois phases de traduction qui s&#8217;appliquent &#224; un cas linguistique, avec une 
m&#233;thode adapt&#233;e : les traductions compositionnelles non polys&#233;miques, les traductions 
compositionnelles polys&#233;miques et les traductions non compositionnelles et/ou inconnues. 
Notre &#233;valuation sur un vaste &#233;chantillon d&#8217;ULC montre que l&#8217;exploitation du Web pour la 
traduction et la prise en compte des propri&#233;t&#233;s linguistiques au sein d&#8217;un syst&#232;me modulaire 
permet une acquisition automatique de traductions avec une excellente pr&#233;cision. 
</p>
<p>Abstract We present a method of automatic translation (French/English) of Complex 
Lexical Units (CLU) for aiming at extracting a bilingual lexicon. Our modular system is based 
on linguistic properties (compositionality, polysemy, etc.). Different aspects of the 
multilingual Web are used to validate candidate translations and collect new terms. We first 
build a French corpus of Web pages to collect CLU. Three adapted processing stages are 
applied for each linguistic property : compositional and non polysemous translations, 
compositional polysemous translations and non compositional translations. Our evaluation on 
a sample of CLU shows that our technique based on the Web can reach a very high precision. 
</p>
<p>Mots-cl&#233;s : Traduction Automatique, Unit&#233;s Lexicales Complexes, D&#233;sambigu&#239;sation 
lexicale, World Wide Web, Terminologie 
</p>
<p>Keywords : Automatic translation, Complex lexical units, Lexical disambiguisation, 
World Wide Web, Terminology 
</p>
<p>1 Introduction 
</p>
<p>L&#8217;ambigu&#239;t&#233; lexicale est un probl&#232;me majeur pour les syst&#232;mes de traduction automatique ou 
de recherche d&#8217;informations interlingue. Par exemple, la traduction anglaise du terme fran&#231;ais 
                                                 
1 Cet article est issu d&#8217;un travail de th&#232;se soutenue en d&#233;cembre 2008 sous la direction de Jean V&#233;ronis (LIF). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on 
</p>
<p>caisse est diff&#233;rente selon que l'usage concerne, entre autres, l&#8217;I&#4;STRUME&#4;T DE MUSIQUE 
(drum), la BA&#4;QUE (fund) ou la VALISE (case). L&#8217;absence de d&#233;sambigu&#239;sation lexicale pour 
la traduction automatique conduit &#224; des r&#233;sultats qui g&#234;nent souvent la compr&#233;hension. Ainsi, 
le syst&#232;me Systran2 traduit l&#8217;Unit&#233; Lexicale Complexe (ULC)3 caisse claire par clear case, ce 
qui est incompr&#233;hensible pour un anglophone. La co-occurrence caisse/claire constitue un 
indice d&#233;sambigu&#239;sateur tr&#232;s fort, qui, si elle &#233;tait correctement enregistr&#233;e dans une base de 
donn&#233;es bilingue pourrait servir &#224; g&#233;n&#233;rer des traductions correctes (caisse claire &gt; snare 
drum). La polys&#233;mie est rendue faible d&#232;s que l'on envisage les unit&#233;s lexicales selon leur co-
occurrent (Yarowsky, 1993), (Sh&#252;tze, 1998) et (V&#233;ronis, 2003). Les travaux existants ont 
propos&#233; des m&#233;thodes d&#8217;acquisition de terminologie bilingue &#224; partir de corpus parall&#232;les 
(voir (V&#233;ronis, 2000)) ou comparables (citons, entre autres, (Rapp, 1999), (Fung, McKeown, 
1997) (Fung, Yee, 1998) et (Morin et al., 2004)). Les corpus parall&#232;les constituent des 
ressources rares tandis que les corpus comparables se limitent &#224; un domaine de sp&#233;cialit&#233;. Le 
Web, qui g&#233;n&#232;re des besoins consid&#233;rables en traduction, offre en m&#234;me temps un r&#233;servoir 
gigantesque de donn&#233;es multilingues qui pourraient &#234;tre exploit&#233;es afin d&#8217;acqu&#233;rir les 
traductions correctes.  
</p>
<p>Les contraintes de Traduction Automatique d&#8217;ULC varient en fonction des caract&#233;ristiques 
linguistiques des unit&#233;s sources. Si les constituants de l&#8217;ULC sont polys&#233;miques, la t&#226;che 
consiste &#224; s&#233;lectionner la bonne traduction de chaque constituant parmi des traductions 
candidates. Si les constituants ne sont pas polys&#233;miques, la t&#226;che consiste &#224; valider ou pas la 
combinaison de leurs traductions. Les traductions d&#8217;ULC peuvent &#234;tre compositionnelles, 
c&#8217;est-&#224;-dire bas&#233;es sur une combinaison des traductions des constituants, ou non 
compositionnelles (traduction non litt&#233;rale). Les travaux d&#8217;acquisition de traductions n&#8217;ont pas 
exploit&#233; ces indices linguistiques et ont propos&#233; des m&#233;thodes globales. Nous appliquons un 
traitement automatique adapt&#233; &#224; une typologie linguistique, pour la construction d&#8217;un syst&#232;me 
modulaire d&#8217;acquisition automatique de traductions d&#8217;ULC du fran&#231;ais vers l&#8217;anglais, &#224; partir 
du Web. Ce syst&#232;me s&#8217;appuie sur la d&#233;tection automatique des propri&#233;t&#233;s linguistiques de 
traduction des ULC (compositionnalit&#233;, polys&#233;mie des constituants) et chaque module est 
consacr&#233; &#224; un type de traduction. Les propri&#233;t&#233;s multilingues du Web sont exploit&#233;es afin de 
collecter et de filtrer automatiquement des traductions candidates (pages parall&#232;les ou 
&#171; partiellement &#187; parall&#232;les, fr&#233;quences, comparaison de mondes lexicaux). Notre syst&#232;me 
permet d&#8217;acqu&#233;rir des ULC sources en fran&#231;ais, &#224; partir d&#8217;un corpus de pages Web et de 
proposer un syst&#232;me modulaire de traductions de ces ULC. La section 2 pr&#233;sente notre 
m&#233;thodologie, l&#8217;acquisition automatique des donn&#233;es et la m&#233;thode de traduction sur un 
&#233;chantillon al&#233;atoire. La section 3 pr&#233;sente l&#8217;&#233;valuation, les r&#233;sultats et les perspectives. 
</p>
<p>2 M&#233;thodologie et traitement des donn&#233;es 
</p>
<p>Nous proc&#233;dons &#224; une extraction d&#8217;ULC en fran&#231;ais &#224; partir d&#8217;un corpus de pages Web 
&#233;tiquet&#233; morpho-syntaxiquement. Nous analysons automatiquement leurs propri&#233;t&#233;s 
linguistiques via un dictionnaire &#233;lectronique bilingue. Le module de traduction est 
s&#233;lectionn&#233; en fonction de ces caract&#233;ristiques. Apr&#232;s avoir d&#233;crit la m&#233;thode d&#8217;acquisition 
d&#8217;ULC sources (2.1), nous d&#233;crivons l&#8217;architecture du syst&#232;me et d&#233;taillons chaque module 
(2.2). 
</p>
<p>                                                 
2  http://www.systransoft.com/ 
</p>
<p>3  Nous parlons d&#8217;ULC afin de d&#233;signer une cooccurrence lexicale entre deux lex&#232;mes li&#233;s syntaxiquement. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me modulaire d&#8217;acquisition automatique de traductions &#224; partir du Web 
</p>
<p>2.1 Acquisition d&#8217;ULC en langue source 
</p>
<p>Nous collectons des pages Web associ&#233;es &#224; une liste al&#233;atoire de noms simples extraits du 
dictionnaire &#233;lectronique bilingue Collins Pocket (fran&#231;ais-anglais)4. Ces pages sont nettoy&#233;es 
automatiquement et &#233;tiquet&#233;es via le logiciel Treetagger5. Nous appliquons ensuite des filtres 
linguistiques et des filtres de fr&#233;quence. D&#8217;un point de vue linguistique, nous d&#233;finissons les 
patrons morpho-syntaxiques r&#233;pondant aux relations de d&#233;pendances syntaxiques recherch&#233;es 
(NOM-ADJECTIF ET NOM-de(d&#8217;)-NOM) en ne prenant en compte que les s&#233;quences 
contig&#252;es. En ce qui concerne la fr&#233;quence, nous posons des seuils fixes. La fr&#233;quence de 
l&#8217;ULC au sein de notre corpus doit &#234;tre sup&#233;rieure ou &#233;gale &#224; 10. Ensuite, les ULC sont test&#233;es 
en tant que requ&#234;tes sur le moteur de recherche Yahoo et nous ne conservons que celles dont 
les nombres d'occurrences estim&#233;s par le moteur de recherche sont les plus &#233;lev&#233;s 6. Ce filtre 
peut provoquer du silence, mais nous posons volontairement un filtre &#233;lev&#233; afin d&#8217;obtenir des 
ressources de tr&#232;s bonne qualit&#233;, sans aucune intervention humaine. Cette &#233;tape pourra &#234;tre 
am&#233;lior&#233;e par la suite par des m&#233;thodes statistiques plus pouss&#233;es, mais elle constitue en l&#8217;&#233;tat 
un banc de test satisfaisant afin d&#8217;&#233;valuer notre syst&#232;me de traduction. Nous obtenons 9664 
ULC en fran&#231;ais, associ&#233;es &#224; 1664 t&#234;tes s&#233;mantiques7(noms simples dont vont d&#233;pendre 
s&#233;mantiquement les autres actants au sein d&#8217;une ULC). Le nombre moyen d&#8217;ULC par t&#234;te 
s&#233;mantique est de 6. Notre corpus de pages Web est constitu&#233; d&#8217;environ 4 160 000 pages Web 
et continue de grossir au quotidien. Le sch&#233;ma suivant pr&#233;sente le nombre d&#8217;ULC sources 
obtenus par patron morpho-syntaxique : 
</p>
<p>(OM-ADJECTIF 5 166
(OM-DE-(OM 2934
(OM-D'-(OM 1564
TOTAL 9664  
</p>
<p>Tableau 1 : Proportion d&#8217;ULC par patron morpho-syntaxique 
</p>
<p>Voici un extrait d&#8217;ULC associ&#233;es &#224; la t&#234;te s&#233;mantique appareil : 
</p>
<p>&#4;OM-D&#8217;-&#4;OM : Appareil d&#8217;&#233;tat, appareil d&#8217;imagerie, cat&#233;gorie d&#8217;appareil 
</p>
<p>&#4;OM-DE-&#4;OM : Appareil de chauffage, appareil de contr&#244;le, appareil de cuisson 
</p>
<p>&#4;OM-ADJECTIF : Appareil administratif, appareil argentique, appareil auditif 
</p>
<p>Afin de tester notre m&#233;thodologie de traduction, nous r&#233;alisons un &#233;chantillon al&#233;atoire de 
1075 ULC. Nous avons &#233;valu&#233; la qualit&#233; des ULC de fa&#231;on manuelle et aucune n&#8217;a &#233;t&#233; 
&#233;limin&#233;e. 
</p>
<p>                                                 
4  Nous aurions pu partir d&#8217;une liste monolingue d&#8217;ULC d&#233;j&#224; existante mais il n&#8217;existe pas de ressource &#224; tr&#232;s 
</p>
<p>vaste &#233;chelle.  
</p>
<p>5  http://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger/ 
</p>
<p>6  La fr&#233;quence de l&#8217;ULC retourn&#233;e par le moteur de recherche en tant qu&#8217;expression litt&#233;rale doit &#234;tre 
sup&#233;rieure ou &#233;gale &#224; 10000 et la fr&#233;quence de l&#8217;ULC, pr&#233;c&#233;d&#233;e par un article (d&#233;fini ou ind&#233;fini) doit &#234;tre 
sup&#233;rieure ou &#233;gale &#224; 1000. 
</p>
<p>7  Nous parlons de t&#234;te s&#233;mantique afin de d&#233;signer l&#8217;&#233;l&#233;ment dont d&#233;pendent s&#233;mantiquement les autres actants 
au sein d&#8217;une ULC. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on 
</p>
<p>2.2 Architecture et sp&#233;cification du syst&#232;me d&#8217;acquisition des traductions 
</p>
<p>Notre syst&#232;me est modulaire (chaque phase traite d&#8217;ULC ayant des caract&#233;ristiques 
sp&#233;cifiques de traduction) et lin&#233;aire (les traductions non obtenues au sein d&#8217;un module sont 
renvoy&#233;es au module suivant). Chaque sous-section pr&#233;sente un module : les traductions 
compositionnelles non polys&#233;miques (2.2.1), les traductions compositionnelles polys&#233;miques 
(2.2.2) et les traductions non compositionnelles et/ou inconnues (2.2.3). 
</p>
<p>2.2.1 Traductions compositionnelles non polys&#233;miques 
</p>
<p>Le premier module traite des traductions compositionnelles non polys&#233;miques : le sens est 
transparent (chaque constituant peut &#234;tre traduit de fa&#231;on litt&#233;rale) et le sens de chaque 
constituant n&#8217;est pas ambigu (non polys&#233;mique)8. Cette t&#226;che peut consister &#224; d&#233;terminer si la 
combinaison de chaque traduction candidate des constituants de l&#8217;ULC, g&#233;n&#233;r&#233;e par une 
ressource dictionnairique est valide ou pas. (L&#233;on et Millon, 2005) montrent que la fr&#233;quence 
sur le Web de traductions candidates peut &#234;tre exploit&#233;e pour la validation si les unit&#233;s sources 
ne sont pas polys&#233;miques. Nous nous appuyons sur le nombre de traductions candidates de 
chaque constituant dans notre dictionnaire bilingue (Dagan et al., 1991) et ne conservons que 
celles dont les constituants ne comptent qu&#8217;une traduction. Par exemple, l&#8217;ULC ambiance 
musicale est conserv&#233;e puisque ambiance et musicale ne comptent respectivement qu&#8217;une 
seule traduction (atmosphere/musical). Nous g&#233;n&#233;rons automatiquement toutes les traductions 
candidates via le Collins Pocket selon la m&#233;thode de (L&#233;on, Millon, 2005 ; L&#233;on, 2006), qui 
consiste &#224; g&#233;n&#233;rer toutes les combinaisons possibles des traductions des &#233;l&#233;ments simples et &#224; 
effectuer des r&#232;gles de transformation morpho-syntaxique, comme institut de 
psychologie (institut / institute, psychologie / psychology), dont les traductions candidates 
sont institute of psychology et psychology institute. Les r&#232;gles de transformation morpho-
syntaxiques pour chaque patron sont les suivantes :  
</p>
<p>&#4;OM1 de &#4;OM 2 &gt; &#4;OM1 of &#4;OM2 
</p>
<p>&#4;OM1 de &#4;OM 2 &gt; &#4;OM2 &#4;OM1 
</p>
<p>&#4;OM ADJECTIF &gt; ADJECTIF &#4;OM 
</p>
<p>Le moteur de recherche Yahoo est interrog&#233; automatiquement afin de r&#233;cup&#233;rer le nombre 
d&#8217;occurrences de chaque traduction candidate. Pour chaque traduction candidate, nous 
g&#233;n&#233;rons un ensemble de requ&#234;tes selon le mod&#232;le suivant : 
</p>
<p>(OM-ADJECTIF &#171; the ADJ NOM &#187; OR &#171; a ADJ NOM &#187;
(OM1-DE(D')-(OM2 &#171; the NOM1 of NOM2 &#187; OR &#171; a NOM1 of NOM2 &#187; 
</p>
<p>&#171; the NOM2 NOM1 &#187; OR &#171; a NOM2 NOM1 &#187;  
</p>
<p>Tableau 2 : Patrons des requ&#234;tes des traductions candidates 
</p>
<p>Un filtre simple est appliqu&#233; aux traductions candidates. Nous ne conservons que celles dont 
la fr&#233;quence sur le Web est au moins &#233;gale &#224; un dix-milli&#232;me des occurrences du mot cible. 
</p>
<p>                                                 
8  Nous consid&#233;rons qu&#8217;une unit&#233; est non polys&#233;mique si elle a strictement une unique traduction dans notre 
</p>
<p>dictionnaire bilingue. Le terme de &#171; polys&#233;mie &#187; est donc ici employ&#233; de fa&#231;on pratique, dans le contexte de 
la traduction et &#224; partir d&#8217;une ressource donn&#233;e.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me modulaire d&#8217;acquisition automatique de traductions &#224; partir du Web 
</p>
<p>Prenons pour exemple9 &#171; messe de minuit &#187; et deux de ses traductions candidates &#171; midnight 
mass &#187; et &#171; mass of midnight &#187; : Seuil_mass : 764 000 000 / 10 000 = 30400. La traduction 
&#171; midnight mass &#187; (avec une fr&#233;quence de 336 000, donc sup&#233;rieure au seuil limite pour le 
nom cible mass) est retenue, tandis que &#171; mass of midnight &#187; (avec une fr&#233;quence de 65, donc 
inf&#233;rieure au seuil limite pour le nom cible mass) est rejet&#233;e. Apr&#232;s le filtre automatique sur 
les fr&#233;quences, 39.24% des traductions candidates sont conserv&#233;es. Les traductions obtenues 
comptent pour 9.11% de nos unit&#233;s lexicales &#224; traduire10. Parmi les unit&#233;s lexicales non 
polys&#233;miques, 57.40% d&#8217;entre elles obtiennent une traduction &#224; cette &#233;tape. Le tableau suivant 
pr&#233;sente la proportion de traductions conserv&#233;es apr&#232;s le filtre automatique. 
</p>
<p>Traductions 
</p>
<p>g&#233;n&#233;r&#233;es
</p>
<p>(OM ADJ 29 20 68,97%
(OM DE (OM 40 8 20,00%
(OM D' (OM 10 3 30,00%
</p>
<p>TOTAL 79 31 39,24%
</p>
<p>Filtre automatique
</p>
<p>Filtre seuil fr&#233;quence
</p>
<p> 
</p>
<p>Tableau 3 : R&#233;sultats du filtre des traductions apr&#232;s la phase 1 
</p>
<p>2.2.2 Traductions compositionnelles polys&#233;miques 
</p>
<p>Lorsque les constituants &#224; traduire sont polys&#233;miques, la t&#226;che de traduction ne consiste pas 
en une simple validation mais en une s&#233;lection parmi de nombreuses traductions candidates. Il 
s&#8217;agit de d&#233;sambigu&#239;ser le sens de chaque constituant. (L&#233;on, 2006) montre qu&#8217;une 
comparaison des mondes lexicaux sur le Web entre l&#8217;unit&#233; source et chaque traduction 
candidate permet de lever un grand nombre d&#8217;ambigu&#239;t&#233;s lexicales. Selon nous, un &#171; monde 
lexical &#187; d&#233;signe les co-occurrences fr&#233;quentes (plus larges que le co-occurrent imm&#233;diat) 
d'une unit&#233; lexicale au sein d&#8217;une collection de textes (V&#233;ronis, 2003). Ce deuxi&#232;me module 
est une version am&#233;lior&#233;e de la m&#233;thode de (L&#233;on, 2006) qui proc&#232;de &#224; une d&#233;sambig&#252;isation 
lexicale pour la traduction via les contextes lexicaux sources et cibles sur le Web. Les 
traductions candidates sont g&#233;n&#233;r&#233;es avec la m&#234;me m&#233;thode que celle d&#233;crite en 2.2.1. 
Comme celles-ci sont en grande quantit&#233;, il serait co&#251;teux de g&#233;n&#233;rer les mondes lexicaux de 
chacune d&#8217;elle. Nous utilisons deux filtres pr&#233;alables qui permettent d&#8217;&#233;liminer les traductions 
les plus erron&#233;es. Nous testons les fr&#233;quences des couples de traduction sur le Web. Notre 
hypoth&#232;se est que si la traduction est correcte, le couple doit appara&#238;tre au moins une fois dans 
un m&#234;me document : de nombreux documents du Web sont des textes linguistiquement 
mixtes (traductions de manuels, de catalogues, glossaires, etc.). Nous engendrons 
automatiquement une requ&#234;te pour chaque couple restant, du type de &#171; caisse centrale &#187; 
&#171;central fund &#187; et ne conservons que les couples dont la fr&#233;quence est sup&#233;rieure ou &#233;gale &#224; 1. 
Notre second filtre d&#233;termine le rapport entre la fr&#233;quence sur le Web de l&#8217;ULC source et 
celui des traductions candidates. Par exemple, &#171; caisse de retraite &#187; appara&#238;t 157000 fois. 
&#171; retirement cas &#187; appara&#238;t 2850 fois, tandis que &#171; retirement fund &#187; appara&#238;t 1240000 fois. 
On exclut les traductions ayant une fr&#233;quence inf&#233;rieure au terme fran&#231;ais (&#233;tant donn&#233; le 
</p>
<p>                                                 
</p>
<p>9     Juillet 2008. 
</p>
<p>10  Viennent s&#8217;ajouter les ULC d&#233;j&#224; traduites au sein de notre dictionnaire que nous conservons d&#8217;embl&#233;e, &#224; 
savoir 98 traductions &#224; l&#8217;issue de la phase 1 sur les 1075 ULC de d&#233;part. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on 
</p>
<p>rapport entre le nombre de pages index&#233;es en anglais et en fran&#231;ais, une traduction correcte en 
anglais doit avoir une fr&#233;quence sup&#233;rieure &#224; son ULC source en fran&#231;ais). 
</p>
<p>Nous construisons enfin les mondes lexicaux de chaque ULC source et des traductions 
candidates restantes. Nous collectons les 1000 premiers r&#233;sum&#233;s retourn&#233;s par le moteur de 
recherche Yahoo pour chaque requ&#234;te correspondant &#224; une ULC source et &#224; chacune de ses 
traductions candidates. Nous collectons ensuite les cinquante noms et les cinquante adjectifs 
les plus fr&#233;quents parmi les r&#233;sum&#233;s &#233;tiquet&#233;s de fa&#231;on morpho-syntaxique. Ces mondes 
lexicaux fran&#231;ais et anglais pour les noms et pour les adjectifs sont respectivement compar&#233;s 
via le dictionnaire bilingue. Le nombre de mots communs entre les mondes lexicaux fran&#231;ais 
et anglais est comptabilis&#233;. Le coefficient de Jaquard est utilis&#233; afin de mesurer le degr&#233; de 
similitude entre les deux ensembles : | inter(X,Y) | / | union (X,Y) |. Seules les traductions 
candidates dont l&#8217;indice de Jaquard est sup&#233;rieur &#224; un seuil fix&#233; (pour la cat&#233;gorie des noms et 
pour la cat&#233;gorie des adjectifs) sont conserv&#233;es et nous s&#233;lectionnons celle qui a le plus haut 
score pour chaque ULC. A l&#8217;issue de cette &#233;tape, nous obtenons pour 68.98% des ULC 
restantes traduire. 
</p>
<p> 
</p>
<p>Tableau 4 : R&#233;sultats des filtres apr&#232;s la phase 2 
</p>
<p>2.2.3 Traductions non compositionnelles et/ou inconnues 
</p>
<p>A ce stade, plusieurs difficult&#233;s expliquent l&#8217;absence de traduction des ULC restantes. Il arrive 
que la somme des traductions de chaque &#233;l&#233;ment de l&#8217;ULC ne permette pas d&#8217;obtenir la 
traduction ad&#233;quate, comme dans caisse claire &gt; snare drum (tambour/ pi&#232;ge). Il peut aussi 
s&#8217;agir de cas o&#249; la base et/ou le co-occurrent est recens&#233; dans notre dictionnaire, mais l&#8217;emploi 
pertinent n&#8217;est pas r&#233;pertori&#233;, comme pour caisse d&#8217;&#233;pargne &gt; savings bank. Ici, l&#8217;emploi de 
caisse (BA&#4;QUE) n&#8217;est pas r&#233;pertori&#233; dans notre dictionnaire. Enfin, il peut s&#8217;agir de cas o&#249; la 
base ou le co-occurrent est un terme technique non recens&#233; dans nos ressources 
dictionnairiques comme dans appareil circulatoire. Dans cet exemple, la traduction de 
circulatoire est inconnue de nos ressources et notre objectif est &#233;galement de d&#233;couvrir de 
nouvelles traductions. Notre derni&#232;re phase vise &#224; pallier deux difficult&#233;s, le probl&#232;me de la 
non-compositionnalit&#233; et celui de co-occurrents inconnus de nos ressources dictionnairiques, 
parce qu&#8217;ils sont trop techniques ou r&#233;cents. Le point commun est qu&#8217;une utilisation de 
ressources existantes n&#8217;est pas satisfaisante. Le principe de ce module est de collecter 
directement les traductions &#224; partir de r&#233;sum&#233;s &#171; mixtes &#187; sur le Web, &#224; l&#8217;instar de Nagata 
(2001) pour le japonais et l&#8217;anglais. Notre m&#233;thode d&#8217;acquisition de r&#233;sum&#233;s mixtes consiste &#224; 
g&#233;n&#233;rer des requ&#234;tes en fran&#231;ais (langue source), recherch&#233;es dans des pages en anglais 
(langue cible), ce qui ram&#232;ne majoritairement des pages linguistiquement &#171; mixtes &#187;. A partir 
de ces r&#233;sum&#233;s, nous appliquons deux strat&#233;gies de rep&#233;rage des traductions candidates : dans 
un premier temps, nous identifions des cognats (&#171; occurrences qui sont identiques ou se 
ressemblent graphiquement &#187;, V&#233;ronis, 2000), et dans un second temps, nous rep&#233;rons les 
couples les plus fr&#233;quents. Ces deux &#233;tapes se pr&#233;sentent de la m&#234;me fa&#231;on que les &#233;tapes 
pr&#233;c&#233;dentes, c&#8217;est-&#224;-dire qu&#8217;elles sont successives : nous recherchons d&#8217;abord les cognats. Il 
peut s&#8217;agir, par exemple de mots graphiquement apparent&#233;s tels que langue et language (ibid.) 
</p>
<p>Filtre Web
</p>
<p>parall&#232;le,
</p>
<p>&#171; top 3 &#187;
</p>
<p>Filtre
</p>
<p>rapport
</p>
<p>fran&#231;ais/ 
</p>
<p>anglais
</p>
<p>Filtre
</p>
<p>indice de
</p>
<p>Jaquard
</p>
<p>977 18 844 1919 1239 674
</p>
<p>Unit&#233;s lexicales
</p>
<p>restantes apr&#232;s la
</p>
<p>phase 1
</p>
<p>Traductions candidates
</p>
<p>g&#233;n&#233;r&#233;es
</p>
<p> 
</p>
<p>Filtre automatique </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me modulaire d&#8217;acquisition automatique de traductions &#224; partir du Web 
</p>
<p>ou alors de formes communes. Nous comparons les quatre premi&#232;res lettres du co-occurrent 
anglais (premier constituant du couple) avec celui du co-occurrent fran&#231;ais (deuxi&#232;me 
constituant). Nous aurions pu appliquer une m&#233;thode de comparaison plus classique telle 
qu&#8217;une distance de Levenshtein mais nous ne nous int&#233;ressons qu&#8217;aux chaines communes qui 
se trouvent dans la m&#234;me position au sein des mots source et cible. Nous passons ensuite par 
plusieurs filtres de validation, selon le m&#234;me mod&#232;le que dans la phase pr&#233;c&#233;dente (requ&#234;tes 
en couple sur le Web et filtre du rapport entre les fr&#233;quences fran&#231;aises et anglaises). Il reste, 
apr&#232;s tous les filtres, 292 traductions candidates. Les traductions candidates restantes sont 
ensuite filtr&#233;es par l&#8217;indice de Jaquard. A l&#8217;issue de cette sous-&#233;tape, 89 traductions sont 
valid&#233;es, soit 29.37% des unit&#233;s lexicales de d&#233;part pour cette phase, et 8.27% de la totalit&#233; de 
nos donn&#233;es de d&#233;part. Les traductions non obtenues passent ensuite par le module des 
couples fr&#233;quents. Etant donn&#233; que le texte contient plusieurs langues, il est d&#233;licat de 
proc&#233;der &#224; un &#233;tiquetage morpho-syntaxique. Nous conservons les r&#233;sum&#233;s bruts retourn&#233;s par 
le moteur de recherche et r&#233;coltons les couples de mots les plus fr&#233;quents au sein de ces 
r&#233;sum&#233;s. Nous nous centrons volontairement sur les couples candidats, et ne prenons pas en 
compte les chaines plus longues, ce qui peut provoquer des cas de silence pour le rep&#233;rage du 
patron &#4;OM-of-&#4;OM ou d&#8217;une unit&#233; simple. Toutefois, l&#8217;analyse de textes non &#233;tiquet&#233;s est 
une t&#226;che d&#233;licate et nous nous centrons sur le patron morpho-syntaxique candidat le plus 
fr&#233;quent. A partir des 303 unit&#233;s lexicales sources restantes &#224; traduire, 327 815 couples 
diff&#233;rents sont g&#233;n&#233;r&#233;s. A l&#8217;issue des m&#234;mes filtres que pr&#233;c&#233;demment, 26 traductions sont 
valid&#233;es (soit 115 en tout pour la phase compl&#232;te). Le tableau 5 montre un exemple de 
traductions obtenues &#224; chaque &#233;tape (la totalit&#233; des traductions est de 887) et le tableau 6 
pr&#233;sente la quantit&#233; de traductions obtenues par phase. 
</p>
<p>psychologie sociale/social psychology 
drame musical/musical drama
</p>
<p>acide nucl&#233;ique/nucleic acid
souris d&#8217;agneau/lamb shank 
</p>
<p>PHASE 1 (M&#233;thode des fr&#233;quences)
</p>
<p>PHASE 2 (Mondes lexicaux)
</p>
<p>PHASE 3 (Cognats et couples fr&#233;quents)
</p>
<p>accident grave/serious accident                  
&#233;clat naturel/natural shine
</p>
<p>Tableau 5 : Exemples de traductions 
</p>
<p>11,05%
</p>
<p>75,99%
</p>
<p>12,97%
</p>
<p>PHASE 1 (M&#233;thode des fr&#233;quences) 98
</p>
<p>PHASE 2 (Mondes lexicaux) 674
</p>
<p>PHASE 3 (Cognats et couples fr&#233;quents) 115
</p>
<p> 
</p>
<p>Tableau 6 : Traductions obtenues pour chaque phase11 
</p>
<p>3 Evaluation et analyse des r&#233;sultats 
</p>
<p>Au sein de notre &#233;chantillon al&#233;atoire, nous &#233;valuons les 887 traductions obtenues. Nous 
avons opt&#233; pour une &#233;valuation manuelle, effectu&#233;e par un locuteur bilingue12, avec trois 
                                                 
11  La phase 1 combine les traductions obtenues &#224; cette &#233;tape avec les ULC d&#233;j&#224; traduites dans notre dictionnaire 
</p>
<p>que nous conservons telles quelles.  
</p>
<p>12  L&#8217;&#233;valuatrice est Amanda Grey, traductrice professionnelle (http://www.amandagrey.com/). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on 
</p>
<p>appr&#233;ciations possibles : A (Bonne traduction), B (Traduction acceptable), ou C (Mauvaise 
traduction). Le locuteur a eu acc&#232;s aux contextes des traductions, en observant les contextes 
retourn&#233;s par le moteur de recherche, pour chaque requ&#234;te d&#8217;ULC source et chaque traduction 
obtenue. Les r&#233;sultats obtenus montrent que 89,29% des traductions ont &#233;t&#233; consid&#233;r&#233;es 
comme correctes par l&#8217;&#233;valuatrice (cat&#233;gorie A) et 5,07% ont &#233;t&#233; consid&#233;r&#233;es comme 
acceptables (B). Seulement 5,64% de traductions ont &#233;t&#233; jug&#233;es erron&#233;es (C). Ces r&#233;sultats 
sont particuli&#232;rement satisfaisants puisqu&#8217;ils montrent que 94,36% des r&#233;sultats sont 
directement exploitables, sans aucune intervention humaine, soit une pr&#233;cision tr&#232;s 
satisfaisante. Le taux de rappel, lui, est de 77,86%. Nous analysons les erreurs de traduction 
(3.1), puis nous pr&#233;sentons nos perspectives d&#8217;&#233;volution (3.2). 
</p>
<p>3.1 Analyse des erreurs 
</p>
<p>Les erreurs que nous analysons ici concernent exclusivement celles qui ont &#233;t&#233; relev&#233;es via la 
non acceptation de l&#8217;&#233;valuation de l&#8217;expert, &#224; savoir le bruit. Nous recensons trois grandes 
cat&#233;gories d&#8217;erreurs, les erreurs lexicales (3.1.1), les erreurs morpho-syntaxiques (3.1.2) et les 
erreurs &#171; idiomatiques &#187; (3.1.3). 
</p>
<p>3.1.1 Erreurs lexicales 
</p>
<p>Les erreurs lexicales d&#233;signent un mauvais choix lexical d&#8217;au moins un des constituants de 
l&#8217;ULC. Le choix lexical peut &#234;tre proche d&#8217;un point de vue th&#233;matique mais non &#233;quivalent (il 
s&#8217;agit de la t&#234;te s&#233;mantique, du co-occurrent ou de la totalit&#233; des &#233;l&#233;ments) comme dans 
l&#8217;exemple de Parc nucl&#233;aire &gt; nuclear energy. Le choix lexical peut &#234;tre totalement erron&#233;, 
c&#8217;est-&#224;-dire que la d&#233;sambig&#252;isation lexicale n&#8217;a pas &#233;t&#233; correctement effectu&#233;e (il s&#8217;agit 
syst&#233;matiquement d&#8217;un mauvais choix de la t&#234;te s&#233;mantique) comme dans Fond d&#8217;aide &gt; help 
back. 
</p>
<p>3.1.2 Erreurs morpho-syntaxiques 
</p>
<p>Un autre type d&#8217;erreur concerne les cas de traductions ayant une structure morpho-syntaxique 
erron&#233;e. Les erreurs morpho-syntaxiques alt&#232;rent moins la compr&#233;hension globale que les 
erreurs lexicales, comme dans l&#8217;exemple de Analyse de march&#233; &gt; analysis of market (au lieu 
de market analysis). Parmi les erreurs morpho-syntaxiques, nous distinguons deux cas pour la 
structure syntaxique source &#4;OM-DE-&#4;OM (du type de analyse de march&#233;). Certaines erreurs 
consistent en un mauvais choix entre les structures de type &#171; germanique &#187; (&#4;OM-&#4;OM) et de 
type &#171; roman &#187; (&#4;OM OF &#4;OM) (Chuquet et Paillard, 1987). D&#8217;autres erreurs consistent en 
une non prise en compte de la structure de type &#171; possessif &#187;, faisant intervenir le g&#233;nitif. 
</p>
<p>3.1.3 Erreurs idiomatiques 
</p>
<p>Un dernier type d&#8217;erreur concerne un choix lexical s&#233;mantiquement pertinent, mais dont le 
caract&#232;re idiomatique n&#8217;est pas pleinement satisfaisant, comme dans l&#8217;exemple de F&#234;te 
d&#8217;anniversaire &gt; anniversary party. Bien que cette traduction soit consid&#233;r&#233;e comme 
acceptable et reste compr&#233;hensible, le choix lexical de anniversary (au lieu de birthday) ne 
correspond pas au choix le plus pertinent d&#8217;un point de vue idiomatique.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me modulaire d&#8217;acquisition automatique de traductions &#224; partir du Web 
</p>
<p>3.1.4 Perspectives 
</p>
<p>3.1.4.1 Th&#233;matiques de recherche 
</p>
<p>Nous avons fait le choix de n&#8217;extraire qu&#8217;une seule traduction par unit&#233; lexicale source. Nous 
pourrions nous int&#233;resser &#224; un recensement de toutes les traductions possibles pour une ULC. 
Nous pourrions nous int&#233;resser &#224; un ensemble de domaines ou de th&#233;matiques sur le Web. Par 
exemple, une traduction satisfaisante en langue g&#233;n&#233;rale (l&#8217;usage le plus courant) peut &#234;tre 
inad&#233;quat dans un domaine de sp&#233;cialit&#233;. Consid&#233;rons la traduction appareil num&#233;rique &gt; 
digital camera. Bien que l&#8217;usage le plus courant soit l&#8217;usage PHOTOGRAPHIE, la traduction 
digital camera est inappropri&#233;e dans certains domaines. Dans le domaine m&#233;dical, la 
traduction est digital device. Une &#233;volution sera de nous int&#233;resser aux domaines de sp&#233;cialit&#233; 
sur le Web, afin de pallier les limites li&#233;es &#224; l&#8217;ambig&#252;it&#233; lexicale.  
</p>
<p>3.1.4.2 Am&#233;lioration de la conparaison des mondes lexicaux 
</p>
<p>Une limite de la mesure de Jaquard (comparaison des mondes lexicaux) est de ne pas prendre 
en compte les diff&#233;rences de fr&#233;quences. Si le partage des fr&#233;quences est in&#233;gal, la 
comparaison est moins efficace que si la r&#233;partition des fr&#233;quences &#233;tait &#233;quilibr&#233;e. Nous 
pourrions prendre en compte le poids (fr&#233;quence) des unit&#233;s lexicales au sein de chaque 
monde lexical et obtenir une comparaison pond&#233;r&#233;e. De nombreuses m&#233;thodes peuvent &#234;tre 
envisag&#233;es afin de tenir compte de la fr&#233;quence des unit&#233;s au sein des textes &#224; comparer. Dans 
une discussion sur le choix d&#8217;une m&#233;thode de mesure de comparaison entre deux textes, 
Brunet (2003) montre que quelle que soit la m&#233;thode, les diff&#233;rences sont peu sensibles. 
</p>
<p>3.1.4.3 Ajout de ressources externes 
</p>
<p>Prince et Chauch&#233; (2008) pr&#233;sentent une m&#233;thode de traduction bas&#233;e sur l&#8217;exploitation de 
ressources de type ontologique. Chaque thesaurus en anglais (English Roget Thesaurus) et en 
fran&#231;ais (Thesaurus Larousse) est exploit&#233; tel un espace vectoriel, dans lequel les entr&#233;es 
monolingues forment un vecteur de concepts associ&#233;s. Les entr&#233;es fran&#231;aises sont repr&#233;sent&#233;es 
sous la forme de leur &#233;quivalence dans l&#8217;espace anglais. La t&#226;che de d&#233;sambig&#252;isation lexicale 
consiste &#224; s&#233;lectionner le vecteur appropri&#233; au sein des vecteurs bilingues par comparaison 
avec un vecteur contextuel de la phrase source. L&#8217;exploitation de ressources externes pour la 
d&#233;sambig&#252;isation lexicale pourrait &#234;tre combin&#233;e &#224; notre m&#233;thode, afin de m&#234;ler des 
connaissances encyclop&#233;diques (th&#233;saurus) &#224; des connaissances textuelles (mondes lexicaux). 
</p>
<p>4 Conclusion 
</p>
<p>Notre travail a port&#233; sur l&#8217;analyse de l&#8217;aspect interlingue des ULC pour l&#8217;acquisition 
automatique de traductions &#224; partir du Web. La prise en compte des caract&#233;ristiques 
linguistiques de traduction permet d&#8217;apporter un traitement adapt&#233; &#224; chaque cas. Nous avons 
propos&#233; une application de l&#8217;utilisation du Web dans le cadre d&#8217;applications linguistiques, en 
proposant une m&#233;thode &#171; mixte &#187; de strat&#233;gies. Les ressources que nous avons collect&#233;es 
jusqu&#8217;&#224; pr&#233;sent sont de bonne qualit&#233;, avec une pr&#233;cision de traduction tr&#232;s satisfaisante, &#224; 
savoir environ 94% de traductions acceptables. Le rappel est &#233;galement honorable, avec un 
taux d&#8217;environ 77%. Nous nous sommes &#233;galement centr&#233;e sur l&#8217;&#233;tude du contexte des ULC 
en testant ce ph&#233;nom&#232;ne &#224; vaste &#233;chelle, en collectant les mondes lexicaux directement &#224; 
partir du Web. Ces mondes lexicaux, en fran&#231;ais et en anglais, ont &#233;t&#233; exploit&#233;s pour la 
d&#233;sambig&#252;isation lexicale pour la traduction mais pourront &#234;tre exploit&#233;es pour la 
construction de ressources de type ontologiques. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BRUNET E. (2003). Peut-on mesurer la distance entre deux textes ? Corpus, La distance 
intertextuelle 2. 
</p>
<p>CHUQUET, H., PAILLARD, M. (1987). Approche linguistique des probl&#232;mes de traduction 
anglais &lt;-&gt; fran&#231;ais. Gap, Paris : Ophrys. 
</p>
<p>DAGAN I., ITAI A., SCHWALL U. (1991). Two languages are more informative than one. 
Actes de Annual Meeting of the Association for Computational Linguistics (ACL), 130-137. 
</p>
<p>FUNG P., MCKEOWN K. (1997). Finding terminology translations from non-parallel 
corpora. Actes de Annual Workshop on Very Large Corpora, 192-202. 
</p>
<p>FUNG P., YEE L. Y. (1998). An IR approach for translating new words from nonparallel, 
comparable texts. Actes de International Conference on Computational Linguistics 
(COLI&#4;G), 414-420. 
</p>
<p>LEON S., MILLON C. (2005). Acquisition semi-automatique de relations lexicales bilingues 
(fran&#231;ais-anglais) &#224; partir du Web. Actes de Rencontre des Etudiants Chercheurs en 
Informatique pour le Traitement Automatique des Langues (RECITAL), 595-604. 
</p>
<p>LEON S. (2006). Acquisition automatique de traductions de termes complexes par 
comparaison de &#171; mondes lexicaux &#187; sur le Web. Actes de Rencontre des Etudiants 
Chercheurs en Informatique pour le Traitement Automatique des Langues (RECITAL), 700-
709. 
</p>
<p>MORIN E., DUFOUR-KOWALSKI S., DAILLE B. (2004). Extraction de terminologies 
bilingues &#224; partir de corpus. Actes de Traitement Automatique des Langues &#4;aturelles 
(TAL&#4;). 
</p>
<p>NAGATA M. (2001). Using the Web as a bilingual dictionary. 39th ACL Worshop on Data-
Driven Methods in Machine Translation. 
</p>
<p>PRINCE V., CHAUCHE, J. (2008). Building a Bilingual Representation of the Roget 
Thesaurus for French to English Machine Translation. Actes de international conference on 
Language REsources and Evaluation (LREC).. 
</p>
<p>RAPP R. (1999). Automatic Identification of Word Translations from Unrelated English and 
German Corpora. Actes de Association for Computational Linguistics (ACL), 519-525. 
</p>
<p>SCH&#220;TZE H. (1998). Automatic word sense discrimination. Computational Linguistics 
(24)1, 97-124. 
</p>
<p>V&#201;RONIS J. (2000). Parallel Text Processing: Alignment and use of translation corpora. 
Dordrecht : Kluwer Academic Publishers. 
</p>
<p>VERONIS J. (2003). Hyperlex : cartographie lexicale pour la recherche d&#8217;informations. Actes 
de Traitement Automatique des Langues &#4;aturelles (TAL&#4;), 265-274. 
</p>
<p>YAROWSKY D. (1993). One Sense per Collocation. Actes de ARPA Human Language 
Technology Workshop, 266-271.  </p>

</div></div>
</body></html>