<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Quels attributs discriminants pour une analyse syntaxique par classification de textes en langue arabe ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#150; Session posters, Senlis, 24-26 juin 2009 
 
</p>
<p>Quels attributs discriminants pour une analyse syntaxique par 
classification de textes en langue arabe ?  
</p>
<p>F&#233;riel Ben Fraj (1), Chiraz Ben Othmane Zribi (2), Mohamed Ben Ahmed (3) 
Laboratoire RIADI &#150; Universit&#233; La Manouba 
</p>
<p>ENSI, La Manouba, Tunisie  
(1) Feriel.BenFraj@riadi.rnu.tn, (2) Chiraz.BenOthmane@riadi.rnu.tn,  
</p>
<p>(3)Mohamed.BenAhmed@riadi.rnu.tn 
</p>
<p>R&#233;sum&#233; Dans le cadre d&#146;une approche d&#233;terministe et incr&#233;mentale d&#146;analyse syntaxique 
par classification de textes en langue arabe, nous avons pr&#233;vu de prendre en consid&#233;ration un 
ensemble vari&#233; d&#146;attributs discriminants afin de mieux assister la proc&#233;dure de classification 
dans ses prises de d&#233;cisions &#224; travers les diff&#233;rentes &#233;tapes d&#146;analyse. Ainsi, en plus des 
attributs morpho-syntaxiques du mot en cours d&#146;analyse et des informations contextuelles des 
mots l&#146;avoisinant, nous avons ajout&#233; des informations compositionnelles extraites du fragment 
de l&#146;arbre syntaxique d&#233;j&#224; construit lors de l&#146;&#233;tape pr&#233;c&#233;dente de l&#146;analyse en cours. Ce papier 
pr&#233;sente notre approche d&#146;analyse syntaxique par classification et vise l&#146;exposition d&#146;une 
justification exp&#233;rimentale de l&#146;apport de chaque type d&#146;attributs discriminants et 
sp&#233;cialement ceux compositionnels dans ladite analyse syntaxique. 
</p>
<p>Abstract For parsing Arabic texts in a deterministic and incremental classification 
approach, we suggest that varying discriminative attributes is helpful in disambiguation 
between structures to classify. That&#146;s why; we consider morpho-syntactic information of the 
current analyzed word and its surrounding context. In addition, we add a new information 
type: the compositional one. It consists of the portion of the syntactic tree already constructed 
until the previous analysis step. In this paper, we expose our parsing approach with 
classification basis and we justify the utility of the different discriminative attributes and 
especially the compositional ones. 
</p>
<p>Mots-cl&#233;s :   analyse syntaxique incr&#233;mentale, langue arabe, apprentissage automatique, 
classification, attributs discriminants 
Keywords: incremental parsing, Arabic language, machine learning, classification, 
discriminative attributes 
</p>
<p>1 Introduction 
Par intuition, l&#146;analyse syntaxique d&#146;une phrase par un humain ne correspond pas &#224; la 
recherche de l&#146;ensemble des r&#232;gles n&#233;cessaires &#224; la traiter mais plut&#244;t &#224; d&#233;celer toutes les 
connaissances disponibles au moment de l&#146;analyse pour prendre la bonne solution ou celle qui 
semble &#234;tre la meilleure. Nous sugg&#233;rons, alors, qu&#146;une  analyse syntaxique automatique doit 
proc&#233;der de la m&#234;me mani&#232;re afin de faire correspondre les pr&#233;-requis th&#233;oriques (r&#232;gles 
</p>
<p>id16619671 pdfMachine by Broadgun Software  - a great PDF writer!  - a great PDF creator! - http://www.pdfmachine.com  http://www.broadgun.com </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F&#233;riel Ben Fraj, Chiraz Ben Othmane Zribi et Mohamed Ben Ahmed 
</p>
<p>grammaticales) et l&#146;&#233;tat du cas actuel &#224; traiter pour aboutir &#224; une bonne performance 
d&#146;analyse. 
</p>
<p>Pour notre part, nous avons propos&#233; pour la langue arabe (Ben Fraj et al., 2008a) une 
approche d&#146;analyse syntaxique par classification &#224; base d&#146;apprentissage supervis&#233;. 
N&#233;anmoins, la prise de d&#233;cision dans un mod&#232;le d&#146;apprentissage automatique doit &#234;tre 
conditionn&#233;e par un ensemble d&#146;attributs dits d&#146;apprentissage permettant la discrimination 
entre les diff&#233;rentes solutions (ou d&#233;cisions &#224; prendre) possibles.  Pour ce faire, nous avons 
pr&#233;conis&#233; un ensemble vari&#233; d&#146;attributs ; &#224; savoir morpho-syntaxiques, contextuels et 
compositionnels. Mais, la question qui doit &#234;tre pos&#233;e &#224; ce stade est : A quel point cette 
diversification peut-elle &#234;tre utile et efficace pour notre proc&#233;dure d&#146;analyse syntaxique? 
</p>
<p>Le but de cet article consiste, alors, &#224; valider exp&#233;rimentalement l&#146;apport des diff&#233;rents types 
d&#146;attributs dans la proc&#233;dure d&#146;analyse syntaxique. Ainsi, nous commen&#231;ons ce papier par la 
pr&#233;sentation de notre approche classificatoire d&#146;analyse syntaxique de textes en langue arabe. 
Dans une seconde section, nous d&#233;crivons les diff&#233;rents attributs discriminants mis en jeu en 
apprentissage. La derni&#232;re section est consacr&#233;e &#224; l&#146;&#233;valuation de la pertinence de ces attributs 
dans la t&#226;che en main. 
</p>
<p>2 Analyse syntaxique de l&#146;arabe comme un probl&#232;me de 
classification 
</p>
<p>Notre approche d&#146;analyse syntaxique se base sur l&#146;attribution d&#146;un ensemble d&#146;arbres 
&#233;l&#233;mentaires aux diff&#233;rents mots d&#146;une phrase  par une proc&#233;dure de classification, et ce en se 
basant sur leurs contextes respectifs. Ces arbres classes sont con&#231;us suivant le formalisme 
grammatical d&#146;arbres adjoints (TAG : Tree Adjoining Grammar). D&#146;o&#249; la grammaire 
ArabTAG. 
</p>
<p>2.1 Pr&#233;sentation du formalisme TAG 
</p>
<p>La grammaire TAG (Joshi, 1987) fait partie des grammaires dites d&#146;unification. Elle utilise la 
notion de structures de traits et peut &#234;tre qualifi&#233;e de grammaire binaire vu qu&#146;elle utilise deux 
structures arborescentes dites arbres &#233;l&#233;mentaires pour la repr&#233;sentation des &#233;l&#233;ments 
langagiers (mots ou cat&#233;gories grammaticales) et deux op&#233;rations pour les accoler dans le but 
de g&#233;n&#233;rer deux arbres r&#233;sultats.  
</p>
<p>Deux types d&#146;arbres &#233;l&#233;mentaires sont utilis&#233;s:  
</p>
<p>&#61623; les arbres initiaux qui s&#146;accolent &#224; d&#146;autres arbres par substitution  
</p>
<p>&#61623; et les arbres auxiliaires qui se lient avec d&#146;autres arbres &#233;l&#233;mentaires ou fragments 
d&#146;arbres d&#233;riv&#233;s par adjonction. Pour un arbre auxiliaire, le n&#156;ud racine doit avoir la 
m&#234;me cat&#233;gorie qu&#146;un des n&#156;uds feuilles du m&#234;me arbre. 
</p>
<p>La grammaire TAG est qualifi&#233;e de simplicit&#233; vu que seules deux op&#233;rations de liaison entre 
structures sont permises :  
</p>
<p>&#61623; la substitution qui ins&#232;re un arbre initial (ou le d&#233;riv&#233; d&#146;un arbre initial) &#224; un n&#156;ud 
feuille d&#146;un arbre &#233;l&#233;mentaire ou d&#233;riv&#233;  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quels attributs discriminants pour une analyse syntaxique par classification de textes en 
langue arabe ? 
&#61623; et l&#146;adjonction qui permet la composition d&#146;un arbre auxiliaire (ou d&#233;riv&#233; d&#146;un arbre                         
</p>
<p>auxiliaire) avec un arbre &#233;l&#233;mentaire ou d&#233;riv&#233;. L&#146;arbre auxiliaire, ayant deux n&#156;uds 
particuliers racine et pied de m&#234;me cat&#233;gorie, peut s&#146;adjoindre &#224; un autre n&#156;ud racine 
ou interne de m&#234;me cat&#233;gorie.  
</p>
<p>A part l&#146;arbre d&#233;riv&#233; qui constitue l&#146;arbre syntaxique de la phrase en cours de traitement, le 
formalisme TAG associe &#224; toute phrase un arbre de d&#233;rivation o&#249; chaque n&#156;ud renvoie &#224; une 
unit&#233; lexicale de la phrase et &#224; la structure &#233;l&#233;mentaire choisie pour la repr&#233;senter et chaque 
branche indique le type de combinaison entre les deux structures &#233;l&#233;mentaires qu&#146;elle relie. 
</p>
<p>Ce formalisme grammatical d&#146;unification a &#233;t&#233; accommod&#233; (Ben Fraj et al., 2009) et utilis&#233; 
pour la cr&#233;ation de la grammaire ArabTAG. 
</p>
<p>2.2 La grammaire ArabTAG 
</p>
<p>ArabTAG (Ben Fraj et al., 2008b) est un mod&#232;le g&#233;n&#233;rique pour la repr&#233;sentation des 
structures syntaxiques modulaires de la langue arabe &#224; base du formalisme pr&#233;c&#233;demment 
pr&#233;sent&#233;. Ces structures sont construites &#224; partir d&#146;une collection de r&#232;gles grammaticales 
enrichies. L&#146;enrichissement vient du fait qu&#146;on a associ&#233; aux r&#232;gles simples1 d&#146;une grammaire 
hors contexte certaines informations syntaxiques et s&#233;mantiques (se pr&#233;sentant les r&#244;les des 
diff&#233;rentes composantes de la phrase) afin d&#146;aider leur transformation en un mod&#232;le 
grammatical d&#146;unification. Ces r&#232;gles enrichies sont par la suite cod&#233;es avec le langage de 
standardisation XML.  
</p>
<p>Ainsi, ArabTAG couvre la plupart des structures arborescentes standards utilis&#233;es dans les 
textes arabes. Lesdites structures sont organis&#233;es par familles suivant leur repr&#233;sentation d&#146;une 
phrase (nominale (PN) ou verbale (PV)), d&#146;un syntagme nominal (SN), d&#146;un syntagme verbal 
(SV) ou d&#146;un syntagme pr&#233;positionnel (SP). A l&#146;int&#233;rieur de chaque famille, un ensemble 
assez vari&#233; et riche de sous-arbres est d&#233;crit. Pour la famille des SNs par exemple, nous avons 
con&#231;u ses diff&#233;rents types ainsi que leurs repr&#233;sentations structurales possibles. Nous citons, &#224; 
titre indicatif, le SN adjectival, le SN d&#146;annexion, le SN quasi-propositionnel, etc. 
</p>
<p>2.3 Principe d&#146;analyse 
</p>
<p>Notre analyseur syntaxique propos&#233; est incr&#233;mental, d&#233;terministe et &#224; base de classification. 
L&#146;hypoth&#232;se incr&#233;mentale suppose que le traitement des langues humaines se fait dans une 
m&#234;me direction : de droite &#224; gauche dans notre cas, et proc&#232;de par des d&#233;coupages partiels qui 
permettent d&#146;&#233;tendre les fragments composant une m&#234;me phrase. Dans la strat&#233;gie 
incr&#233;mentale, le mod&#232;le d&#146;analyse suit une cha&#238;ne de r&#232;gles de pr&#233;dictions autorisant le lien 
d&#146;un nouveau mot avec la partie d&#233;j&#224; construite de l&#146;arbre d&#146;analyse (Costa et al., 2001).  
</p>
<p>Consid&#233;rons le mot mt en cours d&#146;analyse &#224; un instant t du processus d&#146;analyse et l&#146;arbre 
partiel d&#146;analyse APt-1 construit jusqu&#146;&#224; l&#146;instant t-1. On cherche &#224; trouver pour le mot mt 
l&#146;arbre &#233;l&#233;mentaire convenable en se basant sur l&#146;environnement du mot compos&#233; : des 
informations lexicales, syntaxiques et contextuelles relatives &#224; ce mot et sur le fragment APt-1. 
D&#146;autant plus que, nous pr&#233;supposons que l&#146;affectation des arbres &#233;l&#233;mentaires aux diff&#233;rents 
                                                 
</p>
<p>1
 Les r&#232;gles simples sont celles qui repr&#233;sentent seulement les composantes principales des phrases ; &#224; savoir le 
</p>
<p>sujet, le verbe et les compl&#233;ments pour une phrase verbale et le sujet et le pr&#233;dicat d&#146;une phrase nominale. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F&#233;riel Ben Fraj, Chiraz Ben Othmane Zribi et Mohamed Ben Ahmed 
</p>
<p>mots de la phrase est intimement li&#233;e &#224; la sp&#233;cification des op&#233;rations n&#233;cessaires &#224; les 
joindre ; c'est-&#224;-dire que le choix d&#146;un arbre &#233;l&#233;mentaire parmi d&#146;autres pour un mot donn&#233; 
doit profiter &#224; la fois du contexte lexical et de celui d&#233;rivationnel (ou compositionnel) des 
arbres &#233;l&#233;mentaires. Le r&#233;sultat sera APt qui est la portion d&#146;arbre APt-1 incr&#233;ment&#233; de l&#146;arbre 
&#233;l&#233;mentaire pr&#233;dit du mot mt &#224; l&#146;instant t.  
</p>
<p>3 Attributs discriminants 
Les attributs discriminants constituent l&#146;ensemble des descriptions qui permettent de 
diff&#233;rencier entre multiples cas &#224; analyser. Ce sont les attributs susceptibles d&#146;&#234;tre pertinents 
pour le probl&#232;me consid&#233;r&#233;. C&#146;est ce qu&#146;on appelle : langage de description du probl&#232;me de 
classification. La question du choix des attributs est abord&#233;e lorsqu&#146;il faut extraire des 
connaissances &#224; partir de donn&#233;es ou de textes (Denis, Gilleron, 2000). Classifier un cas 
revient &#224; chercher la probabilit&#233; de son appartenance &#224; une classe sachant la description qui lui 
correspond. Dans la proc&#233;dure de classification en main, les attributs pris en compte sont : 
</p>
<p>3.1 Attributs morpho-syntaxiques 
</p>
<p>Les attributs morpho-syntaxiques  du mot en cours d&#146;analyse qui sont vari&#233;s : forme du mot2 , 
valeur grammaticale (VG) positionnelle3, lemme, valeurs et VGs des enclinom&#232;nes4 s&#146;ils 
existent, genre/nombre pour les noms et les adjectifs, temps/personne/transitivit&#233; pour les 
verbes (Ben Othmane, 1998). Ces informations permettent une bonne d&#233;sambigu&#239;sation entre 
les diff&#233;rents cas. Dans l&#146;exemple de la figure 1, le fait que le mot &#990;&#842;&#984;&#758;&#1011;&#756; est un verbe et qu&#146;il est 
transitif direct et indirect &#224; la fois permettent de choisir la structure d&#146;une phrase verbale &#224; 
deux compl&#233;ments d&#146;objet le premier est direct et le second est indirect. 
</p>
<p>3.2 Attributs contextuels 
</p>
<p>Les attributs contextuels qui rassemblent les caract&#233;ristiques morpho-syntaxiques des mots se 
trouvant au voisinage du mot en cours d&#146;analyse. On peut utiliser une fen&#234;tre (-k, +k) qui 
prend en consid&#233;ration le contexte &#224; gauche et celui &#224; droite. La valeur de k est d&#233;finie par 
exp&#233;rimentation. Ce genre d&#146;informations permet de prendre en consid&#233;ration &#224; la fois le 
pass&#233; et le futur de l&#146;analyse. Ceci permettra d&#146;am&#233;liorer la pr&#233;diction, d&#146;&#233;viter au maximum 
les erreurs d&#146;analyse et aussi d&#146;&#233;liminer le risque des retours en arri&#232;re en cas d&#146;erreur. Lors de 
l&#146;analyse du mot cible &#941;&#757;&#1005;&#760;&#937;&#756; de l&#146;exemple de la figure 1, la v&#233;rification du vocable se trouvant &#224; 
la premi&#232;re position de son contexte &#224; gauche et ses caract&#233;ristiques (proclitique et cas 
sp&#233;cialement), permet de d&#233;cider que  les deux mots associ&#233;s forment un SN d&#146;annexion 
repr&#233;sent&#233; par l&#146;arbre&#61559;. 
</p>
<p>                                                 
</p>
<p>2
 C&#146;est la forme comme elle est pr&#233;sente dans le texte comme le mot &#912;&#1003;&#940;&#991;&#909; (l&#146;or). 
</p>
<p>3
 Exemples de valeurs grammaticales positionnelles  (Ben Othmane, 1998)  : &#754;&#752; &#994;&#992;&#971; &#994;&#947;&#909; (nom propre au nominatif) 
</p>
<p>ou &#756;&#752; &#993;&#1006;&#992;&#972;&#995; &#969;&#941;&#910;&#960;&#995; &#990;&#972;&#979; (verbe au pr&#233;sent actif pr&#233;c&#233;d&#233; d'un outil modificateur). 
4
 Les enclinom&#232;nes agglutin&#233;s aux formes simples, permettent d&#146;avoir des formes plus complexes comme dans 
</p>
<p>l&#146;exemple de la forme agglutin&#233;e : &#910;&#1000;&#999;&#1005;&#942;&#987;&#940;&#920;&#947;&#899; (est-ce que vous vous souviendrez de nous ?) 
</p>
<p>. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quels attributs discriminants pour une analyse syntaxique par classification de textes en 
langue arabe ? 
3.3 Attributs compositionnels 
</p>
<p>Ce sont les attributs compositionnels ou d&#233;rivationnels qui incluent la structure du fragment 
d&#233;j&#224; construit de l&#146;arbre d&#146;analyse syntaxique &#224; une &#233;tape interm&#233;diaire de l&#146;analyse. Ils 
englobent alors les n&#156;uds (arbres &#233;l&#233;mentaires) d&#233;j&#224; trouv&#233;s et sp&#233;cialement ceux capables 
d&#146;&#234;tre d&#233;riv&#233;s dans des phases ult&#233;rieures d&#146;analyse, les op&#233;rations possibles pour les lier et 
surtout les positions de jointure des anciens n&#156;uds sur la portion construite de l&#146;arbre 
d&#146;analyse. Au fait, une d&#233;composition en syntagmes est effectu&#233;e en cours d&#146;analyse et ce sont 
les anciens points de jointure qui pr&#233;ciseront &#224; quel ancien syntagme doit &#234;tre accol&#233; le mot en 
cours d&#146;analyse ou doit-il plut&#244;t constituer un nouveau syntagme. La figure 1 pr&#233;sente aussi 
cet aspect. 
</p>
<p> 
Figure 1 : Premi&#232;res &#233;tapes d&#146;analyse de la phrase P1 
</p>
<p>Exemple : (P1) &#1019;&#756;&#3;&#990;&#842;&#984;&#758;&#1011;&#756;&#3;&#941;&#757;&#1005;&#760;&#937;&#756;&#3;&#969;&#758;&#910;&#964;&#756;&#983;&#758;&#3;&#917;&#758;&#909;&#941;&#756;&#910;&#984;&#756;&#972;&#756;&#991;&#760;&#909;&#3;&#3;&#916;&#1012;&#996;&#759;&#1003;&#899;&#998;&#760;&#971;&#756;&#3;&#917;&#758;&#910;&#971;&#756;&#910;&#964;&#756;&#984;&#758;&#991;&#760;&#909;&#3;&#916;&#758;&#1011;&#841;&#937;&#758;&#910;&#956;&#756;&#920;&#758;&#983;&#760;&#910;&#758;&#991;&#760;&#909;&#3;&#1007;&#942;&#756;&#935;&#760;&#757;&#769;&#991;&#760;&#909;  (Le secteur foncier n&#146;est pas moins 
important que les autres secteurs &#233;conomiques). 
</p>
<p>Lors de l&#146;analyse de cet exemple, une bonne classification du premier mot &#1019;&#756; permettra de 
r&#233;cup&#233;rer l&#146;arbre &#233;l&#233;mentaire &#61557; repr&#233;sent&#233; sur la figure 1. Cet arbre permet de restreindre les 
choix de l&#146;arbre &#233;l&#233;mentaire suivant &#224; ceux repr&#233;sentant seulement des phrases verbales et 
l&#146;op&#233;ration de liaison &#224; une adjonction. Ainsi, une classification correcte aboutira en se basant 
sur les informations morpho-syntaxiques et contextuelles du second mot &#990;&#842;&#984;&#758;&#1011;&#756;  &#224; la structure &#61558; 
de la m&#234;me figure. Et ainsi de suite pour les autres mots. A chaque fois, le fragment de l&#146;arbre 
construit &#224; une &#233;tape ant&#233;rieure fournit une information suppl&#233;mentaire &#224; l&#146;&#233;tape courante de 
la m&#234;me proc&#233;dure d&#146;analyse. 
</p>
<p>4 Evaluation de l&#146;apport des attributs discriminants 
Afin d&#146;&#233;valuer l&#146;apport des ces attributs dans notre proc&#233;dure de classification, nous avons 
utilis&#233; certains mod&#232;les standards de classification et ce en faisant appel &#224; la biblioth&#232;que 
Weka (Witten, Frank, 2005) qui contient les impl&#233;mentations d&#146;une vari&#233;t&#233; d&#146;algorithmes 
d&#146;apprentissage automatique standards. Nous avons alors utilis&#233; : les mod&#232;les bay&#233;siens NB et 
LBR pour un apprentissage statistique, le mod&#232;le J4.8 (une version am&#233;lior&#233;e de C4.5) pour 
</p>
<p>PV 
</p>
<p>Modif&#61624; 
&#1010;&#980;&#999;&#3;&#915;&#909;&#937;&#899; 
</p>
<p>PV* 
</p>
<p>&#61557; &#61558; 
</p>
<p>PV 
</p>
<p>V&#61624; 
&#990;&#752;&#752;&#972;&#979; 
</p>
<p> 
</p>
<p>SN&#8595; 
&#990;&#971;&#910;&#752;&#752;&#979; 
</p>
<p>SN&#8595; 
&#1002;&#913;&#3;&#989;&#1006;&#972;&#980;&#995;&#20;  
</p>
<p>SP&#8595; 
&#1002;&#913;&#3;&#989;&#1006;&#972;&#980;&#995;&#21;  
</p>
<p> 
</p>
<p>SN-SComp 
</p>
<p>N&#61624; 
&#3;&#977;&#910;&#960;&#995; 
</p>
<p>SN&#8595; 
&#1002;&#1012;&#991;&#903;&#3;&#977;&#910;&#960;&#995; 
</p>
<p>&#61559; 
</p>
<p>&#61558; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F&#233;riel Ben Fraj, Chiraz Ben Othmane Zribi et Mohamed Ben Ahmed 
</p>
<p>un apprentissage &#224; base d&#146;arbre de d&#233;cision, l&#146;algorithme IB1 pour un apprentissage &#224; base de 
cas, les mod&#232;les JRip et  table de d&#233;cision comme apprenants &#224; base de r&#232;gles.  
</p>
<p>Le corpus d&#146;apprentissage que nous avons utilis&#233; est arbor&#233; et est form&#233; d&#146;environ 1050 mots 
&#233;tiquet&#233;s par leurs arbres &#233;l&#233;mentaires correspondants et formant 236 phrases types &#233;tiquet&#233;es 
elles m&#234;mes par les arbres de d&#233;rivation respectifs. Ces phrases repr&#233;sentent la plupart des 
structures syntaxiques standards de la langue arabe. L&#146;ensemble de test constitue une partie de 
celui d&#146;apprentissage et ce dans le cadre d&#146;une validation crois&#233;e. 
</p>
<p>4.1 Exp&#233;riences 
</p>
<p>Nous avons r&#233;alis&#233; des tests en proc&#233;dant par des ajouts cons&#233;cutifs des diff&#233;rents attributs 
d&#146;apprentissage. Nous avons, alors, commenc&#233; par un premier test (&#61557;) ne faisant intervenir 
qu&#146;un ensemble d&#146;attributs morpho-syntaxiques du mot en cours d&#146;analyse. Ensuite nous 
avons incr&#233;ment&#233; cet ensemble par des attributs contextuels. Un second test (&#61558;) a &#233;t&#233;, ainsi,  
r&#233;alis&#233; avec une fen&#234;tre (-1,+1) et un troisi&#232;me (&#61559;) a &#233;t&#233; &#233;labor&#233; avec une fen&#234;tre (-2,+2). Le 
quatri&#232;me test (&#61583;) inclut en plus des attributs morpho-syntaxiques, une fen&#234;tre contextuelle 
de taille (-1,+1) et des attributs compositionnels. Les crit&#232;res d&#146;&#233;valuation que nous avons 
utilis&#233;s sont r&#233;partis en deux groupes ; &#224; savoir : 
</p>
<p>&#61623; les taux des pr&#233;cisions d&#146;affectation des arbres &#233;l&#233;mentaires (AEs) aux mots ainsi que 
celles des op&#233;rations choisies pour leur liaison dans le cadre d&#146;une classification 
&#233;l&#233;mentaire. 
</p>
<p>&#61623; les  taux des pr&#233;cisions d&#146;analyse des phrases dans le cadre d&#146;une classification 
int&#233;grale. 
</p>
<p>4.2 Exploitation des r&#233;sultats 
</p>
<p>Les r&#233;sultats obtenus sont illustr&#233;s dans le tableau 1.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quels attributs discriminants pour une analyse syntaxique par classification de textes en 
langue arabe ? 
</p>
<p>Classifieurs Pr&#233;cisions &#233;l&#233;mentaires Pr&#233;cision d&#146;analyse AEs Op&#233;rations 
</p>
<p>Bay&#233;sien 
</p>
<p>&#61557; 52,33% 61,95% 05,00% 
&#61558; 57,85% 68,42% 06,66% 
&#61559; 55,27% 66,44% 03,33% 
&#61583; 63,75% 83,21% 13,33% 
</p>
<p>IB1 
</p>
<p>&#61557; 71,34% 78,31% 26,66% 
&#61558; 98,46% 96,02% 81,66% 
&#61559; 99,60% 99,60% 98,33% 
&#61583; 98,45% 99,04% 91,66% 
</p>
<p>J48 
</p>
<p>&#61557; 59,91% 70,89% 06,66% 
&#61558; 72,63% 77,01% 16,66% 
&#61559; 75,29% 76,87% 23,33% 
&#61583; 76,88% 95,55% 30,00% 
</p>
<p>LBR 
</p>
<p>&#61557; 52,49% 61,29% 06,66% 
&#61558; 66,01% 73,35% 16,66% 
&#61559; 68,38% 75,42% 20,00% 
&#61583; 68,40% 84,47% 16,66% 
</p>
<p>JRip 
</p>
<p>&#61557; 46,50% 56,39% 03,33% 
&#61558; 53,01% 63,77% 11,66% 
&#61559; 53,86% 64,56% 11,66% 
&#61583; 63,09% 71,14% 16,66% 
</p>
<p>Table de 
d&#233;cision 
</p>
<p>&#61557; 72,25% 76,22% 16,66% 
&#61558; 78,49% 77,79% 25,00% 
&#61559; 78,49% 77,79% 25,00% 
&#61583; 86,64% 97,48% 50,00% 
</p>
<p>Tableau 1 : Pr&#233;cisions des classifications : &#233;l&#233;mentaire et int&#233;grale 
</p>
<p>Nous avons remarqu&#233; en se basant sur ces r&#233;sultats que la pr&#233;cision de la classification 
&#233;l&#233;mentaire ainsi que celle de l&#146;analyse syntaxique int&#233;grale des phrases augmente 
g&#233;n&#233;ralement proportionnellement aux ajouts successifs d&#146;attributs discriminants. 
L&#146;am&#233;lioration est plus &#233;lev&#233;e pour la classification des op&#233;rations de liaison que pour 
l&#146;affectation des arbres &#233;l&#233;mentaires. Ceci est d&#251; au fait que le nombre d&#146;op&#233;rations &#224; 
classifier est beaucoup moins &#233;lev&#233; que celui des arbres &#233;l&#233;mentaires &#224; classifier. Aussi, la 
pr&#233;cision d&#146;analyse des phrases enti&#232;res a-t-elle augment&#233;e d&#146;un ensemble d&#146;attributs &#224; un 
autre et ce sauf pour le mod&#232;le IB1 qui se base sur l&#146;algorithme des plus proches voisins. De 
plus, le mod&#232;le Bay&#233;sien n&#146;a pas am&#233;lior&#233; sa performance lors de l&#146;ajout d&#146;une fen&#234;tre 
contextuelle plus large ; c'est-&#224;-dire (-2,+2) &#233;tant donn&#233; que la longueur moyenne des phrases 
du corpus et celles de test est de 4 mots (taille minimale 1 et taille maximale 14). En effet, on 
pourrait stipuler qu&#146;un contexte plus large, engendrerait des attributs &#224; valeurs nulles ce qui 
rendrait &#233;parse l&#146;information &#224; extraire.  
</p>
<p>Par ailleurs, nous avons remarqu&#233; que notre choix d&#146;ajouter des informations 
compositionnelles aux informations standards utilis&#233;es dans une analyse syntaxique &#224; base de 
classification est b&#233;n&#233;fique. En effet, nous avons gagn&#233; en pr&#233;cision dans la plupart des tests 
effectu&#233;s. La discrimination devient alors de plus en plus bonne vu que ces informations 
restreignent les choix aux n&#156;uds pouvant accepter des d&#233;rivations ult&#233;rieures. Toutefois, la 
pr&#233;cision globale de l&#146;analyse est assez faible pour la plupart des mod&#232;les d&#146;apprentissage </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F&#233;riel Ben Fraj, Chiraz Ben Othmane Zribi et Mohamed Ben Ahmed 
</p>
<p>utilis&#233;s pour les tests. Ce qui justifie notre vision de proc&#233;der &#224; une classification ensembliste 
faisant intervenir plusieurs algorithmes d&#146;apprentissage. 
</p>
<p>5 Conclusion et perspectives  
Cette &#233;tude comparative nous a permis d&#146;avoir une id&#233;e sur les impacts des diff&#233;rents attributs 
d&#146;apprentissage mis en jeu dans la proc&#233;dure d&#146;analyse syntaxique. Nous avons pu noter que 
le contexte joue un r&#244;le important dans la discrimination entre structures et nous avons pu 
justifier exp&#233;rimentalement l&#146;apport des attributs compositionnels dans ladite proc&#233;dure 
d&#146;analyse. Nous avons utilis&#233; plusieurs mod&#232;les d&#146;apprentissage afin de rendre plus g&#233;n&#233;rales 
les conclusions tir&#233;es. De plus, cette &#233;tude comparative nous permettra aussi d&#146;&#233;valuer les 
performances respectives des diff&#233;rents mod&#232;les mis en jeu dans le but d&#146;&#233;laborer un mod&#232;le 
combinatoire d&#146;apprentissage bas&#233; sur un apprentissage de qualit&#233;. 
</p>
<p>R&#233;f&#233;rences  
BEN FRAJ F., BEN OTHMANE ZRIBI C., BEN AHMED M. (2009). A tool for syntactic tagging an 
Arabic treebank, 2nd International Conference on Arabic Language Resources and Tools, 
Egypt, Cairo. 
</p>
<p>BEN FRAJ F., BEN OTHMANE ZRIBI C., BEN AHMED M. (2008). Ensemble Classification for 
Parsing Arabic Texts: A Theoretical Approach, In Proceedings Artificial Intelligence and 
Pattern Recognition, Florida, 51-57. 
</p>
<p>BEN FRAJ F., BEN OTHMANE ZRIBI C., BEN AHMED M. (2008). ArabTAG: a Tree Adjoining 
Grammar for Arabic Syntactic Structures, ACIT2008, Tunisia, Hammamet. 
</p>
<p>BEN OTHMANE ZRIBI C. (1998). De la synth&#232;se lexicographique &#224; la d&#233;tection et &#224; la 
correction des graphies fautives arabes, Th&#232;se de doctorat, Universit&#233; de Paris XI, Orsay. 
</p>
<p>COSTA F., LOMBARDO V., FRASCONI P., SODA G. (2001). Wide coverage incremental parsing 
by learning attachment preferences, In LNCS 2175, Springer, 297-307. 
</p>
<p>DENIS F. &amp; GILLERON R. (2000). Apprentissage &#224; partir d&#146;exemples, notes de cours, 
Universit&#233; Charles De Gaule, Lille 3. 
</p>
<p>JOSHI A. (1987) Introduction to Tree Adjoining Grammar, in A. Manaster Ramer (ed), The 
Mathematics of Language, J. Benjamins.s 
SAGAE K., LAVIE A. (2005). A classifier-based parser with linear run-time complexity, In 
Proceedings of the Ninth International Workshop on Parsing Technologies, 2005, Vancouver, 
Canada.  
</p>
<p>WITTEN I. H., FRANK E. (2005). Data Mining: Practical Machine Learning Tools and 
Techniques, 2nd Edition. Morgan Kaufmann. 
</p>
<p> </p>

</div></div>
</body></html>