<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Collecte et analyses de r&#233;ponses naturelles pour les syst&#232;mes de questions-r&#233;ponses</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Collecte et analyses de r&#233;ponses naturelles pour les syst&#232;mes
de questions-r&#233;ponses
</p>
<p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
LIMSI-CNRS / Universit&#233; Paris Sud 11 Orsay
</p>
<p>annegf, vilnat, rosset @limsi.fr
</p>
<p>R&#233;sum&#233;. Notre travail se situe dans le cadre des syst&#232;mes de r&#233;ponse a une question et &#224;
pour but de fournir une r&#233;ponse en langue naturelle aux questions pos&#233;es en langue naturelle.
Cet article pr&#233;sente une exp&#233;rience permettant d&#8217;analyser les r&#233;ponses de locuteurs du fran&#231;ais &#224;
des questions que nous leur posons. L&#8217;exp&#233;rience se d&#233;roule &#224; l&#8217;&#233;crit comme &#224; l&#8217;oral et propose
&#224; des locuteurs fran&#231;ais des questions relevant de diff&#233;rents types s&#233;mantiques et syntaxiques.
Nous mettons en valeur une large variabilit&#233; dans les formes de r&#233;ponses possibles en langue
fran&#231;aise. D&#8217;autre part nous &#233;tablissons un certain nombre de liens entre formulation de question
et formulation de r&#233;ponse. Nous proposons d&#8217;autre part une comparaison des r&#233;ponses selon la
modalit&#233; oral / &#233;crit. Ces r&#233;sultats peuvent &#234;tre int&#233;gr&#233;s &#224; des syst&#232;mes existants pour produire
une r&#233;ponse en langue naturelle de fa&#231;on dynamique.
</p>
<p>Abstract. Situated within the domain of interactive question-answering, our work is to
increase the naturalness of natural language answers. This paper presents an experiment aiming
at observing the formulation of answers by French speakers. The system asked simple questions
to which the humans had to answer. Two modalities were used : text (web) and speech (phone).
We present and analyze the collected corpus. Within the large variability of answer forms in
French, we point some links between the answer form and the question form. Moreover we
present a preliminary study on the observed variation between modalities. We expect these
results to be integrable in existing systems to dynamically produce adpated natural language
answers.
</p>
<p>Mots-cl&#233;s : syst&#232;mes de r&#233;ponse &#224; une question, exp&#233;rience, variations linguistiques,
r&#233;ponse en langue naturelle.
</p>
<p>Keywords: question-answering systems, experimentation, linguistics variations, natu-
ral language answer.
</p>
<p>1 Introduction
</p>
<p>Les syst&#232;mes de question-r&#233;ponse ont pour objectif de permettre l&#8217;acc&#232;s &#224; une information. &#192;
partir d&#8217;une question en langue naturelle et d&#8217;un ensemble de documents, le syst&#232;me fournit une
r&#233;ponse &#224; la question. Actuellement la plupart de ces syst&#232;mes propose une r&#233;ponse compos&#233;e
de l&#8217;information r&#233;ponse &#224; laquelle s&#8217;ajoute une &#233;ventuelle justification (extrait du (des) docu-
ment(s) dans le(s)quel(s) la r&#233;ponse a &#233;t&#233; trouv&#233;e). Le travail pr&#233;sent&#233; ici s&#8217;inscrit dans l&#8217;objectif
de fournir une r&#233;ponse compl&#232;tement formul&#233;e en langue naturelle &#224; la question pos&#233;e. Les en-
jeux sont multiples. Il s&#8217;agit d&#8217;offrir une interface plus naturelle &#224; l&#8217;utilisateur : &#224; une question</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>en langue naturelle, une r&#233;ponse en langue naturelle se doit d&#8217;&#234;tre propos&#233;e. Nous supposons
qu&#8217;il s&#8217;agit d&#8217;un pr&#233;-requis pour cr&#233;er l&#8217;&#233;change interactif qui m&#232;ne d&#8217;une premi&#232;re question
pos&#233;e par l&#8217;utilisateur &#224; la r&#233;ponse finale donn&#233;e par le syst&#232;me et qui satisfera l&#8217;utilisateur.
</p>
<p>Au del&#224; de r&#233;pondre la bonne information, nous nous centrons ainsi sur le niveau phrastique de
la r&#233;ponse et nous attachons au fait que la r&#233;ponse peut prendre plusieurs formes linguistiques
comme le montre l&#8217;exemple ci-dessous :
</p>
<p>Question : O&#249; est-ce que se trouve la Joconde ?
R&#233;ponse A : La Joconde est au Louvre.
R&#233;ponse B : C&#8217;est au Louvre que la Joconde se trouve.
</p>
<p>Par opposition &#224; un syst&#232;me qui r&#233;pondrait :
</p>
<p>R&#233;ponse : mus&#233;e du Louvre
Passage : La Joconde (ou Portrait de Mona Lisa) est un tableau de L&#233;onard de
Vinci, r&#233;alis&#233; entre 1503 et 1506 d&#8217;une femme qui s&#8217;appelait &#224; l&#8217;&#233;poque Mona Lisa
del Giocondo. Huile sur panneau de bois de peuplier de 77 x 53 cm, il est expos&#233;
au mus&#233;e du Louvre &#224; Paris.
</p>
<p>Notre intuition est qu&#8217;en fonction des caract&#233;ristiques linguistiques de la question (sa syntaxe,
mais aussi sa s&#233;mantique (le th&#232;me et le rh&#232;me de la question), le lexique s&#233;lectionn&#233; par le
locuteur et la granularit&#233; qu&#8217;elle sous-entend pour la r&#233;ponse), la ou les r&#233;ponses possibles sont
diff&#233;rentes toujours d&#8217;un point de vue linguistique. Il nous semble donc primordial de prendre
en compte ces possibles variations. &#202;tre capable de produire une r&#233;ponse adapt&#233;e &#224; la forme
linguistique de la question, c&#8217;est s&#8217;&#233;loigner des syst&#232;mes de dialogue o&#249; les r&#233;ponses prennent
des formes fig&#233;es fix&#233;es par un ensemble de patrons syntaxiques pr&#233;vus &#224; l&#8217;avance et aller vers
un syst&#232;me de dialogue plus naturel et surtout plus dynamique. Ainsi pour d&#233;terminer la ou les
formulation(s) de r&#233;ponses possibles pour une question donn&#233;e, nous nous appuyons d&#8217;une part
sur un mod&#232;le linguistique que nous utiliserons comme un g&#233;n&#233;rateur de variations de question,
d&#8217;autre part sur l&#8217;observation et l&#8217;analyse de r&#233;ponses formul&#233;es par des locuteurs du fran&#231;ais.
</p>
<p>Des travaux r&#233;cents en linguistique (Luzzati, 2006) proposent un mod&#232;le de la question en
interaction mettant en exergue que la formulation d&#8217;une question traduit d&#8217;une part le focus
exact que le questionneur vise, d&#8217;autre part son intention d&#8217;obtenir une r&#233;ponse plus ou moins
pr&#233;cise, de remettre en cause ou non la capacit&#233; de l&#8217;interlocuteur &#224; r&#233;pondre,... L&#8217;id&#233;e sous-
jacente est que la forme morphosyntaxique d&#8217;une question traduit la volont&#233; du questionnant et
peut donc &#234;tre un indice de la r&#233;ponse qu&#8217;il escompte et de sa forme. Nous ne supposons pas
qu&#8217;&#224; une forme de question propos&#233;e par le mod&#232;le corresponde une forme de r&#233;ponse unique.
Mais les diff&#233;rentes classes de questions qu&#8217;il d&#233;termine nous servent de point de d&#233;part pour la
mise en place de notre &#233;tude. Nous souhaitons donc l&#8217;utiliser afin de d&#233;terminer la ou les formes
des r&#233;ponses en langue naturelle qu&#8217;un syst&#232;me de question-r&#233;ponse pourrait fournir.
</p>
<p>La probl&#233;matique des r&#233;ponses et de leur g&#233;n&#233;ration compl&#232;te dans le cadre des syst&#232;mes de
question-r&#233;ponse en domaine ouvert a &#233;t&#233; essentiellement &#233;tudi&#233;e pour am&#233;liorer, &#224; terme, la
pr&#233;cision de l&#8217;extraction de la r&#233;ponse et de la s&#233;lection des documents et passages (par exemple
(Plamondon et al., 2002), (Soubbotin, 2006) ou encore (de Chalendar et al., 2002)). Des travaux
existent &#233;galement sur la forme de la r&#233;ponse dans le cadre de syst&#232;mes de question-r&#233;ponse
interactifs mais portent soit sur l&#8217;aspect multimodal (par exemple (van Hooijdonk et al., 2008))
soit sur des syst&#232;mes en domaine limit&#233; pour lesquels il existe des mod&#232;les de t&#226;che ou de
domaine permettant une adaptation naturelle fine de la r&#233;ponse (par exemple (?)).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Collecte et analyses de r&#233;ponses naturelles pour les syst&#232;mes de questions-r&#233;ponses
</p>
<p>Nous nous int&#233;ressons &#224; la production naturelle de r&#233;ponses compl&#232;tes dans le cadre de syst&#232;mes
interactifs de question-r&#233;ponse en domaine ouvert. Observer comment des humains produisent
des r&#233;ponses &#224; des questions para&#238;t &#234;tre un pr&#233;alable n&#233;cessaire.
</p>
<p>C&#8217;est pourquoi, &#224; l&#8217;instar de (Anaya &amp; Kosseim, 2003), nous observons des r&#233;ponses produites
par des locuteurs natifs du fran&#231;ais afin de mettre en valeur les liens qui existent entre diff&#233;rentes
formes linguistiques de question et les formes linguistiques des r&#233;ponses r&#233;colt&#233;es au cours
des exp&#233;riences. Les r&#233;ponses obtenues seront analys&#233;es en veillant &#224; ce que les liens entre
questions et r&#233;ponses mis en exergue puissent &#234;tre exploitables quel que soit le syst&#232;me de
question-r&#233;ponse consid&#233;r&#233;.
</p>
<p>La section 2 d&#233;taille la mise en place des exp&#233;riences. La section 3 pr&#233;sente le corpus collect&#233;
et des analyses pr&#233;liminaires obtenues. Enfin la section 4 discute cette exp&#233;rience.
</p>
<p>2 Protocole d&#8217;observation de r&#233;ponses humaines
</p>
<p>Afin d&#8217;observer les r&#233;ponses formul&#233;es par des humains, nous avons mis en place une exp&#233;-
rience. Dans celle-ci, plut&#244;t qu&#8217;un syst&#232;me de question-r&#233;ponse r&#233;ponde &#224; des questions pos&#233;es
par des utilisateurs (ou donn&#233;es dans un fichier d&#8217;entr&#233;e dans le cas des campagnes d&#8217;&#233;valua-
tion), nous avons demand&#233; &#224; des locuteurs natifs du fran&#231;ais de r&#233;pondre &#224; un ensemble de
questions pos&#233;es par un syst&#232;me. Il s&#8217;agit d&#8217;un protocole unique et m&#234;me si certains travaux
observent des r&#233;ponses de locuteurs humains, aucun ne permet d&#8217;observer des r&#233;ponses sur dif-
f&#233;rentes modalit&#233;s (orale et &#233;crite dans notre cas) pour les m&#234;mes questions et/ou des questions
dont la variance linguistique est contr&#244;l&#233;e et avec un panel de sujet aussi large que le n&#244;tre (40
chez (Anaya &amp; Kosseim, 2003), 148 chez nous).
L&#8217;exp&#233;rience a pour but de permettre l&#8217;observation de r&#233;ponses dites humaines. Pour cadrer cette
observation et comme notre hypoth&#232;se premi&#232;re est qu&#8217;il y a un lien entre la forme linguistique
de la question et celle de la r&#233;ponse, nous avons mis en place une exp&#233;rimentation permettant
d&#8217;observer comment des locuteurs natifs du fran&#231;ais r&#233;pondent &#224; une question ayant une forme
linguistique bien d&#233;termin&#233;e. Pour cela nous avons cr&#233;&#233; un panel de questions &#224; soumettre aux
sujets. La sous-section suivante en expose la construction. Nous pr&#233;sentons par la suite la mise
en place de l&#8217;exp&#233;rience sur deux modalit&#233;s : l&#8217;&#233;crit et l&#8217;oral, ainsi que l&#8217;organisation des
passations.
</p>
<p>2.1 Panel de question
</p>
<p>Le choix des questions &#224; soumettre aux sujets est crucial. Il doit nous permettre de faire une
observation la moins biais&#233;e possible et d&#8217;&#233;tablir un mod&#232;le qui soit le plus complet possible.
Concr&#232;tement, il doit nous permettre de d&#233;terminer si pour une forme de question donn&#233;e, il y
a une forme de r&#233;ponse privil&#233;gi&#233;e par les sujets. Et ce, en prenant en compte un maximum de
variation linguistique possible pour une question.
</p>
<p>&#201;tant donn&#233; le cadre de ce travail, nous aurions pu, &#224; l&#8217;instar d&#8217;autres &#233;tudes qui nous ont pr&#233;-
c&#233;d&#233;, s&#233;lectionner des questions issues de campagnes d&#8217;&#233;valuation. Cependant cette approche ne
permet d&#8217;obtenir qu&#8217;un &#233;ventail de variations linguistiques faible ((Anaya &amp; Kosseim, 2003)).
Nous avons &#224; notre disposition un mod&#232;le, la Grammaire Interactive (ou GRINT, (Luzzati,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>2006) et (Garcia-Fernandez &amp; Lailler, 2007)) qui peut nous servir d&#8217;outil de g&#233;n&#233;ration de
variations autour d&#8217;une question prototypique. Il s&#8217;agit d&#8217;une mod&#233;lisation des questions de
la langue fran&#231;aise selon trois dimensions. La dimension dite ontologique peut &#234;tre mise en
correspondance avec le type attendu de la r&#233;ponse, information sur laquelle se base, par ailleurs,
les syst&#232;mes de question-r&#233;ponse.
</p>
<p>En se positionnant sur la dimension ontologique (en profondeur dans le tableau 1), on peut
consid&#233;rer une question prototypique dont les variations sont contr&#244;l&#233;es selon les deux autres
dimensions. Ces deux derni&#232;res repr&#233;sentent des variations de type morphosyntaxique. La di-
mension dite paradigmatique (en vertical dans le tableau 1) correspond &#224; une variation de l&#8217;in-
terrogatif utilis&#233; (pronom interrogatif, locution introductrice de question indirecte, pas d&#8217;in-
terrogatif,...). La variation dite syntagmatique (en horizontal) concerne la structure syntaxique
globale de la question (inversion du sujet, question directe, indirecte,...).
</p>
<p>TAB. 1 &#8211; Illustration des variations tri-dimensionnelles propos&#233;es par la GRINT
</p>
<p>Nous avons ainsi d&#233;termin&#233; un ensemble de question prototypiques dont nous avons construit
l&#8217;ensemble des variantes telles que d&#233;finies par la GRINT.
</p>
<p>Les questions prototypiques ont &#233;t&#233; choisies selon diff&#233;rents crit&#232;res. Tout d&#8217;abord notre choix
a &#233;t&#233; de ne pas balayer l&#8217;ensemble des classes ontologiques d&#233;finies par la GRINT. En effet le
total des combinaisons possibles selon les 3 dimensions s&#8217;&#233;l&#232;ve &#224; plus de 200 (15 classes ontolo-
giques et en moyenne 4 classes paradigmatiques et 4 classes syntagmatiques) ce qui repr&#233;sente
un &#233;chantillon bien trop important de tests &#224; r&#233;aliser. Un corpus de requ&#234;tes utilisateurs col-
lect&#233; au LIMSI ( (Galibert et al., 2005), (Rosset &amp; Petel, 2006)) en situation de Dialogue Oral
Homme Machine (corpus RITEL) a &#233;t&#233; annot&#233; selon le type ontologique d&#233;fini par la GRINT.
Le tableau 2 pr&#233;sente le taux de pr&#233;sence de ces types dans le corpus Ritel. Nous avons observ&#233;
ces taux de pr&#233;sence et choisi de mener notre &#233;tude sur 3 des plus fr&#233;quentes : Lieu, Temps et
Quantit&#233;.
Nous supposons cependant que choisir une unique question prototypique par classe ontologique
est insuffisant. Notamment, nous supposons que l&#8217;objet de la question ou focus joue un r&#244;le sur
la formulation de la r&#233;ponse. Nous avons donc cr&#233;&#233; un panel de questions prototypiques dont le
choix suit un certains nombre de variations autour de facteurs de type s&#233;mantiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Collecte et analyses de r&#233;ponses naturelles pour les syst&#232;mes de questions-r&#233;ponses
</p>
<p>Nombre de type concern&#233;s % de pr&#233;sence dans le corpus Ritel
5 &gt; 8 %
0 &lt; 8 % et &gt; 3 %
6 &lt; 3 %
</p>
<p>TAB. 2 &#8211; Pr&#233;sence des questions relevant des classes ontologiques de la GRINT dans le corpus RITEL
</p>
<p>Pour les questions quantit&#233; nous avons pris en compte deux facteurs : le type de quantifica-
tion/mesure (mesure de l&#8217;espace, du poids,...) et le type de r&#233;ponse (fixe, variable - selon l&#8217;objet
du monde consid&#233;r&#233;) ou d&#233;pendante d&#8217;un param&#232;tre externe). Les d&#233;tails de ces choix sont
pr&#233;sent&#233;s dans (Garcia-Fernandez &amp; Lailler, 2007).
Pour les questions lieu et temps nous avons ajout&#233; un facteur concernant le verbe utilis&#233; dans la
question. Ainsi pour les questions lieu, les facteurs sont : le type de localisation (o&#249; est, d&#8217;o&#249;
part, o&#249; va,...), le type de r&#233;ponse (un lieu fixe ou plusieurs lieux) et le type de verbe (localisant
ou bien neutre). Les questions prototypiques Temps sont pr&#233;sent&#233;es dans le tableau 3. Quant aux
questions temps, les 3 facteurs se r&#233;alisent par le type de temporalit&#233; (quand est, depuis quand,
jusqu&#8217;&#224; quand,...), le type de r&#233;ponse (fixe ou multiple) et le type de verbe (temporalisant ou
bien neutre).
</p>
<p>Type de localisation
lieu o&#249; l&#8217;on est autre
</p>
<p>Ty
pe
</p>
<p>de
</p>
<p>fixe O&#249; est/se trouve la Joconde ? O&#249; est l&#8217;arriv&#233;e/arrive le Tour de France ?
</p>
<p>r&#233;p
on
</p>
<p>se
</p>
<p>multiple O&#249; est/se trouve le Rhin ? O&#249; est l&#8217;estuaire/fini le Rh&#244;nne ?
</p>
<p>TAB. 3 &#8211; Questions prototypiques de Lieu
</p>
<p>Les questions propos&#233;es sont simples, leurs r&#233;ponses possibles suppos&#233;es connues du plus grand
nombre, afin de maximiser les r&#233;ponses &#224; valence positive (le sujet donne en effet une informa-
tion r&#233;ponse). En effet, les r&#233;ponses du type je ne sais pas (ou &#224; valence n&#233;gative) sont moins
int&#233;ressantes compte-tenu du but de l&#8217;&#233;tude.
</p>
<p>2.2 Protocole multimodal
</p>
<p>L&#8217;exp&#233;rimentation a eu lieu &#224; l&#8217;oral et &#224; l&#8217;&#233;crit. Une partie des questions a &#233;t&#233; pos&#233;e aux m&#234;mes
sujets &#224; la fois &#224; l&#8217;&#233;crit et &#224; l&#8217;oral permettant ainsi d&#8217;observer les diff&#233;rences entre ces deux
modalit&#233;s dialogiques.
</p>
<p>Malgr&#233; les diff&#233;rences inh&#233;rentes aux deux modalit&#233;s, nous avons voulu proposer un protocole
variant le moins possible entre les deux phases exp&#233;rimentales. L&#8217;exp&#233;rience &#224; l&#8217;&#233;crit a &#233;t&#233; mise
en place sur une page web. Nous avons cr&#233;&#233; une interface php pour l&#8217;occasion. A l&#8217;oral, nous
avons utilis&#233; un dispositif d&#233;j&#224; existant au sein du laboratoire (mise en place de lignes t&#233;l&#233;pho-
niques, syst&#232;me de d&#233;tection de la parole - notamment pour d&#233;tecter quand le locuteur a fini de
r&#233;pondre, synth&#232;se de la parole - m&#234;me mod&#232;le vocal pour l&#8217;ensemble des tests (Toney et al.,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>2008). Les r&#233;ponses des utilisateurs ont &#233;t&#233; transcrites automatiquement gr&#226;ce &#224; ce syst&#232;me. Ces
transcriptions ont &#233;t&#233; corrig&#233;es manuellement.
</p>
<p>Dans les deux cas, les sujets ont &#233;t&#233; expos&#233;s au m&#234;me nombre de questions propos&#233;es dans un
m&#234;me contexte exp&#233;rimental (cf. section 2.3).
</p>
<p>2.3 Contexte exp&#233;rimental et passation
</p>
<p>Notre but n&#8217;est pas d&#8217;obtenir de vraies r&#233;ponses aux questions. Par contre nous cherchons &#224; ob-
server la formulation de cette information r&#233;ponse. Nous souhaitons inciter les sujets &#224; formuler
des phrases tout en sugg&#233;rant un contexte exp&#233;rimental coh&#233;rent avec la &#8220;simplicit&#233;&#8221; des ques-
tions soumises. Nous avons ainsi fait appel &#224; des locuteurs natifs du fran&#231;ais en leur demandant
de r&#233;pondre &#224; des questions suppos&#233;es pos&#233;es par des enfants de CM2 pr&#233;parant des expos&#233;s.
</p>
<p>La passation des exp&#233;riences a eu lieu en trois grandes phases. D&#8217;abord, nous avons mont&#233;
une exp&#233;rience portant uniquement sur les questions de quantit&#233; pos&#233;es &#224; l&#8217;&#233;crit. Chaque sujet
s&#8217;est vu poser un total de 18 questions. Et chaque forme variationnelle de question a &#233;t&#233; pos&#233;e
&#224; au moins 3 sujets diff&#233;rents. Cette exp&#233;rience nous a permis de tester et valider le principe
exp&#233;rimental tant dans son d&#233;roulement que dans ses r&#233;sultats (Garcia-Fernandez &amp; Lailler,
2007). Puis nous avons men&#233; l&#8217;exp&#233;rience correspondante &#224; l&#8217;oral. Comme nous avons observ&#233;
que l&#8217;exp&#233;rience pouvait &#234;tre allong&#233;e tant &#224; l&#8217;oral qu&#8217;&#224; l&#8217;&#233;crit, nous avons d&#233;cid&#233; d&#8217;augmenter
le nombre de question pos&#233;es &#224; chaque locuteur (passant ainsi de 18 &#224; 25). Ceci a permis de
diminuer notablement le nombre de sujets n&#233;cessaires et donc d&#8217;acc&#233;l&#233;rer d&#8217;autant le processus
de collecte de ces donn&#233;es. Enfin une phase concernant les questions Lieu et Temps &#224; l&#8217;oral et &#224;
l&#8217;&#233;crit a eu lieu.
</p>
<p>Nous avons fait appel a pr&#232;s de 150 sujets. La passation a &#233;t&#233; organis&#233;e de fa&#231;on &#224; avoir au
moins 4 sujets par question test. Ceci &#233;quivaut &#224; une moyenne de 50 questions pos&#233;es pour une
forme morphosyntaxique donn&#233;e &#224; l&#8217;&#233;crit et autant &#224; l&#8217;oral.
</p>
<p>3 Analyses du corpus recueilli
</p>
<p>Dans cette section, nous commen&#231;ons par d&#233;crire le corpus d&#8217;un point de vue g&#233;n&#233;ral puis nous
pr&#233;sentons quelques analyses plus fines sur certains aspects.
</p>
<p>3.1 Description g&#233;n&#233;rale
</p>
<p>Le tableau 4 pr&#233;sente les caract&#233;ristiques principales du corpus global et des sous-parties orale
et &#233;crite.
</p>
<p>La premi&#232;re constatation que l&#8217;on peut faire est que les r&#233;ponses &#233;crites sont nettement plus
longues que les r&#233;ponses orales. Ceci se remarque d&#8217;une part par le nombre total de mots pr&#233;-
sents dans les r&#233;ponses (environ 17000 pour les r&#233;ponses &#233;crites contre environ 5000 pour les
r&#233;ponses orales) et par le nombre moyen de mots par r&#233;ponse (8,18 &#224; l&#8217;&#233;crit contre 5,53 &#224; l&#8217;oral).
La taille du lexique des r&#233;ponses &#233;crites est 2,5 fois plus &#233;lev&#233;e que pour les r&#233;ponses orales.
</p>
<p>Le tableau 5 pr&#233;sente le nombre moyen de mot par r&#233;ponse en distinguant selon la classe de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Collecte et analyses de r&#233;ponses naturelles pour les syst&#232;mes de questions-r&#233;ponses
</p>
<p>&#201;crit Oral
nb. mots total 17395 5255
taille lexique 1536 609
moy. mot/r&#233;ponses 8,18 5,83
nb. questions 2125 900
nb. questions diff&#233;rentes 507 434
nb. sujets 101 47
nb. sujets/question 4,19 2,17
</p>
<p>TAB. 4 &#8211; Caract&#233;ristiques g&#233;n&#233;rales du corpus
</p>
<p>Quantit&#233; Lieu Temps
&#201;crit Oral Total &#201;crit Oral Total &#201;crit Oral Total
</p>
<p>moy. mot/reponses 9,81 7,08 8,67 6,81 2,70 6,09 7,46 3,11 6,69
</p>
<p>TAB. 5 &#8211; Taille moyenne (en nombre de mots) des r&#233;ponses consid&#233;r&#233;es selon la classe de la question et la
modalit&#233;
</p>
<p>la question (Temps, Lieu et Quantit&#233;). On peut faire la m&#234;me remarque en ce qui concerne la
diff&#233;rence &#233;crit vs oral que pr&#233;c&#233;demment : la longueur moyenne des r&#233;ponses (en nombre de
mots) est nettement plus importante pour l&#8217;&#233;crit que pour l&#8217;oral et ce dans toutes les classes.
Cette diff&#233;rence est particuli&#232;rement importante pour les questions Lieu et Temps (plus de deux
fois plus de mots &#224; l&#8217;&#233;crit qu&#8217;&#224; l&#8217;oral).
Les diff&#233;rences dans le nombre total de sujets (101 &#224; l&#8217;&#233;crit et 47 &#224; l&#8217;oral) ainsi que le nombre
de sujets par question (4,19 &#224; l&#8217;&#233;crit et 2,17 &#224; l&#8217;oral) s&#8217;expliquent par un ph&#233;nom&#232;ne beaucoup
plus important de rejet dans l&#8217;exp&#233;rience orale que dans l&#8217;exp&#233;rience &#233;crite. Pour l&#8217;exp&#233;rience
orale, il a &#233;t&#233; fait appel &#224; des sujets non contr&#244;l&#233;s 1). Ceci explique peut-&#234;tre en partie pourquoi
nous avons d&#251; rejeter plus de donn&#233;es dans ces exp&#233;riences. Le nombre de sujets n&#233;cessaires
pour obtenir un corpus raisonnable a &#233;t&#233; choisi en fonction d&#8217;une premi&#232;re exp&#233;rience &#224; l&#8217;&#233;crit.
Ce nombre, les conditions de recrutement des sujets ayant chang&#233;, n&#8217;&#233;tait en fait pas suffisant.
</p>
<p>3.2 Analyse du lexique
</p>
<p>Le tableau 6 pr&#233;sente les diff&#233;rents corpus en fonction du lexique g&#233;n&#233;ral et des lexiques pour
chaque modalit&#233;. L&#8217;objet de ce tableau est de nous permettre de r&#233;pondre aux questions sui-
vantes : (1) Etant donn&#233; un lexique, quelle est la part de ce lexique utilis&#233; dans les r&#233;ponses des
diff&#233;rentes classes ?, (2) Etant donn&#233; un lexique associ&#233; &#224; une modalit&#233;, quelle est la part de
ce lexique utilis&#233; dans les r&#233;ponses des diff&#233;rentes classes ? et (3) Le vocabulaire des r&#233;ponses
est-il vari&#233; ?
</p>
<p>Une premi&#232;re observation que l&#8217;on peut faire est que le lexique des r&#233;ponses Quantit&#233; (1158)
est presque deux fois plus grand que celui des r&#233;ponses Lieu (708) et Temps (538). En ce qui
concerne la part des lexiques effectivement utilis&#233;e dans les r&#233;ponses, on constate tout d&#8217;abord
que les r&#233;ponses orales utilisent tr&#232;s peu des mots du lexique comparativement aux r&#233;ponses
</p>
<p>1Nous remercions le RISC et le site http ://faites-la-science.risc.cnrs.fr/ pour la base de donn&#233;es de volontaire
qu&#8217;ils proposent</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>&#201;crit Oral Total
Q L T Q L T Q L T
</p>
<p>nb. mots 8674 5662 3059 4515 476 274 13189 6138 3333
taille lexique 932 682 518 554 122 97 1160 708 538
% du Lexique L 43.4 31.7 24.1 25.8 5.7 4.5 54.0 33.0 25.0
% du lexique LM 60.7 44.4 33.7 90.6 20.0 15.8 54.0 33.0 25.0
fr&#233;q moy rel.L 9.3 8.3 5.9 8.1 3.9 2.8 11.4 8.7 6.2
fr&#233;q moy abs L 2.3 3.1 4.1 3.9 17.5 22.1 1.8 3.0 4.0
fr&#233;q moy abs LM 1.6 2.3 2.9 1.1 5.0 6.2 1.8 3.0 4.0
</p>
<p>TAB. 6 &#8211; R&#233;partition du lexique (L) suivant les classes de questions et les modalit&#233;s (LM)
</p>
<p>&#233;crites. En particulier les r&#233;ponses des classes Temps et Lieu couvrent moins de 6% du lexique
g&#233;n&#233;ral. De fa&#231;on syst&#233;matique, pour toutes les classes, les r&#233;ponses &#233;crites couvrent une plus
grande part du lexique g&#233;n&#233;ral. Si on regarde le comportement selon les lexiques sp&#233;cifiques
&#224; chaque modalit&#233;, on observe que les questions Quantit&#233; repr&#233;sentent une part importante de
ces lexiques (60,7% pour les questions &#233;crites et 90,6% pour les questions orales). Il n&#8217;en va
pas de m&#234;me pour les questions Lieu et Temps, en particulier ces derni&#232;res couvrent moins d&#8217;un
tiers du lexique de la modalit&#233;. On constate aussi qu&#8217;il y a une moins grande r&#233;utilisation des
mots &#224; l&#8217;oral qu&#8217;&#224; l&#8217;&#233;crit. La ligne fr&#233;quence moyenne relative au lexique L du tableau 6 donne
une indication sur le nombre de fois o&#249; un mot est utilis&#233;. On peut remarquer que les mots
sont plus souvent r&#233;utilis&#233;s &#224; l&#8217;&#233;crit (de 6 &#224; 9 fois selon la classe) qu&#8217;&#224; l&#8217;oral (de 3 &#224; 8 fois). Il
est int&#233;ressant de constater qu&#8217;&#224; l&#8217;oral il y a une grande diff&#233;rence selon les classes (8,1 pour
Quantit&#233;, 3,9 pour Lieu et 2,8 pour Lieu).
On peut &#233;galement constater que les r&#233;ponses de la classe Quantit&#233; forment un groupe, en terme
de comportement, nettement diff&#233;rent des r&#233;ponses des classes Lieu et Temps. Cette particula-
rit&#233; va dans le m&#234;me sens que l&#8217;observation selon laquelle la taille des r&#233;ponses moyennes
pour les questions Quantit&#233; est sup&#233;rieure (1 &#224; 3 mots de plus) &#224; celle des deux autres classes de
question. Nous expliquons ce ph&#233;nom&#232;ne par le fait qu&#8217;une quantit&#233; peut faire l&#8217;objet d&#8217;approxi-
mation, d&#8217;intervalle beaucoup plus facilement qu&#8217;un lieu par exemple. Les quantit&#233;s (le poids,
la distance,...) sont des &#233;l&#233;ments relativement difficiles &#224; d&#233;terminer et l&#8217;estimation est toujours
permise. Par contre, les questions Lieu et Temps portent sur des informations plus facilement
d&#233;terminables. Et m&#234;me si l&#8217;estimation est possible, il existe souvent un terme permettant de
d&#233;signer l&#8217;estimation en question.
</p>
<p>Question : O&#249; est le Rhin ?
R&#233;ponse pr&#233;cise : En France, en allemagne,...
R&#233;ponse estimation : En Europe de l&#8217;ouest.
</p>
<p>&#201;crit Oral Total
Q L T Q L T Q L T
</p>
<p>taille lexique 932 682 518 554 122 97 1160 708 538
taille lexique commun 159 45 185
</p>
<p>TAB. 7 &#8211; Recouvrement des lexiques suivant les questions et les modalit&#233;s
</p>
<p>Le tableau 7 pr&#233;sente les tailles des diff&#233;rents lexiques de mots communs aux diff&#233;rentes classes
de questions, &#224; l&#8217;&#233;crit, &#224; l&#8217;oral et en g&#233;n&#233;ral. On observe que seule une faible partie des diff&#233;-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Collecte et analyses de r&#233;ponses naturelles pour les syst&#232;mes de questions-r&#233;ponses
</p>
<p>rents lexiques est commun quelle que soit la classe de la question. Ceci tient &#224; la diversit&#233; des
th&#232;mes abord&#233;s par les trois classes de question. Nous avons observ&#233; plus en d&#233;tails chacun de
ces lexiques communs. On retrouve dans chacun une grande part de mots-outils (pr&#233;position,
conjonction,...). Mais on y trouve aussi des verbes dont des auxiliaires, des verbes modaux et
des verbes tels que &#8220;croire&#8221;, &#8220;penser&#8221;, &#8220;savoir&#8221; et ce quelle que soit la modalit&#233; consid&#233;r&#233;e.
</p>
<p>Le tableau 8 pr&#233;sente le nombre moyen des parties du discours (substantif, verbe et nombre)
pour les sous-parties &#233;crit et oral du corpus et d&#233;taille les moyennes selon la cat&#233;gorie de la ques-
tion. Nous avons ici s&#233;lectionn&#233; les 3 parties du discours qui permettent de distinguer au mieux
les 6 classes (les 6 colonnes du tableau) au travers d&#8217;une analyse en composantes principales.
On constate que les questions Quantit&#233; se distinguent encore une fois des deux autres cat&#233;go-
ries de question. Le nombre de chiffres moyen par r&#233;ponse y est sup&#233;rieur : il y a en moyenne
plus d&#8217;une valeur num&#233;rique pour de telles questions (1,22 &#224; l&#8217;&#233;crit et 1.13 &#224; l&#8217;oral) alors qu&#8217;il
y en a moins d&#8217;une r&#233;ponse sur deux pour les questions de Lieu et de Temps (respectivement
0.47 et 0.14 &#224; l&#8217;&#233;crit et 0.26 et 0.10 &#224; l&#8217;oral). Cette diff&#233;rence doit &#234;tre attribu&#233;e directement
aux types des questions : une question de Quantit&#233; attend plus naturellement une valeur num&#233;-
rique qu&#8217;une question relevant de l&#8217;un des deux autres types de question. De plus le nombre de
noms et de verbes y est lui aussi sup&#233;rieur tant &#224; l&#8217;&#233;crit qu&#8217;&#224; l&#8217;oral. Cependant, il est int&#233;ressant
d&#8217;observer que le taux de verbe des questions Quantit&#233; est sup&#233;rieur &#224; l&#8217;oral qu&#8217;&#224; l&#8217;&#233;crit alors
que la tendance est inverse concernant les deux autres types de question. D&#8217;autre part les taux
des deux autres parties du discours, toujours pour les questions Quantit&#233;, restent stables alors
m&#234;me que la taille moyenne de la r&#233;ponse est plus faible &#224; l&#8217;oral (7 mots en moyenne, voir
tableau 5). Il semble donc que les r&#233;ponses &#224; l&#8217;oral soient plus centr&#233;e vers un transfert pr&#233;cis
de l&#8217;information (utilisation plus importante de mots pleins) plut&#244;t que vers une formulation
d&#233;taill&#233;e (utilisation de connecteurs, etc.).
</p>
<p>&#201;crit Oral
L Q T L Q T
</p>
<p>Subtantifs. 1.47 1.93 1.80 0.67 1.97 1.00
Verbes 0.71 0.95 0.89 0.41 1.34 0.57
Valeurs num&#233;riques 0.47 1.22 0.14 0.26 1.13 0.10
</p>
<p>TAB. 8 &#8211; Effectifs moyens de pr&#233;sence de cat&#233;gories : substantifs, verbes et valeurs num&#233;riques dans les r&#233;ponses
</p>
<p>4 Discussion et conclusion
</p>
<p>Dans le cadre de nos travaux sur la g&#233;n&#233;ration compl&#232;te en langue naturelle de r&#233;ponses pour
les syst&#232;mes interactifs de question-r&#233;ponse, nous avons mis en place un protocole d&#8217;acquisition
d&#8217;un corpus de production naturelle de r&#233;ponse. Ce protocole a &#233;t&#233; d&#233;crit ainsi que le corpus.
Le corpus collect&#233; est &#224; notre connaissance le seul de ce genre et en tout cas le seul de cette
importance. Une premi&#232;re analyse a permis de mettre en &#233;vidence la diversit&#233; des r&#233;ponses ob-
tenues. Cependant nous avons mis en valeur des caract&#233;ristiques plus particuli&#232;res d&#233;pendantes
d&#8217;une part de la modalit&#233; de l&#8217;interaction (oral vs. &#233;crit) d&#8217;autre part du type de la r&#233;ponse. En
particulier, aux questions Quantit&#233; une r&#233;ponse plus d&#233;taill&#233;e, plus longue est fournie.
Le corpus collect&#233; est extr&#234;mement riche tant par sa taille que par les possibles comparaisons
qui peuvent &#234;tre mise en place. Il nous semble &#224; pr&#233;sent essentiel de poursuivre l&#8217;analyse des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>r&#233;ponses et notamment en se centrant sur une analyse de la correspondance syntaxique entre les
questions et les r&#233;ponses.
</p>
<p>R&#233;f&#233;rences
ANAYA G. &amp; KOSSEIM L. (2003). Generation of natural responses through syntactic patterns.
In TALN, p. 297.
DE CHALENDAR G., DALMAS T., ELKATEB-GARA F., FERRET O., GRAU B., HURAULT-
PLANTET M., ILLOUZ G., MONCEAUX L., ROBBA I. &amp; VILNAT A. (2002). The question
answering system QALC at LIMSI, experiments in using web and wordnet. In TREC.
GALIBERT O., ILLOUZ G. &amp; ROSSET S. (2005). An open-domain, human-computer dialog
system. In InterSpeech.
GARCIA-FERNANDEZ A. &amp; LAILLER C. (2007). Morphosyntaxe de l&#8217;interrogation pour le
syst&#232;me de question-r&#233;ponse RITEL. In RECITAL.
LUZZATI D. (2006). Essai de description interactive : l&#8217;exemple des questions quantificatrices.
In Colloque La quantification.
PLAMONDON L., LAPALME G. &amp; KOSSEIM L. (2002). The quantum question answering
system at TREC 11. In TREC.
ROSSET S. &amp; PETEL S. (2006). The Ritel corpus - an annotated human-machine open-domain
question answering spoken dialog corpus. In LREC 2006, Genoa, Italy.
SOUBBOTIN M. (2006). Patterns of potential answer expressions as clues to the right answer.
In The 10th TREC Conference (TREC 2001).
TONEY D., ROSSET S., MAX A., GALIBERT O. &amp; BILINSKI E. (2008). An Evaluation
of Spoken and Textual Interaction in the RITEL Interactive Question Answering System. In
E. L. R. A. (ELRA), Ed., Proceedings of the Sixth International Language Resources and
Evaluation (LREC&#8217;08), Marrakech, Morocco.
VAN HOOIJDONK C., KRAHMER E., A.MAES, THEUNE M. &amp; BOSMA W. (2008). Pro-
duction and evaluation of (multimodal) answers to medical questions. In EARLI SIG2 - 2008
Conference on Comprehension of Text and Graphics, p. 72&#8211;76.</p>

</div></div>
</body></html>