<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Probl&#233;matique d'analyse et de mod&#233;lisation des erreurs en production &#233;crite. Approche interdisciplinaire</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009 
 
</p>
<p>Probl&#233;matique d'analyse et de mod&#233;lisation des erreurs en 
production &#233;crite. Approche interdisciplinaire 
</p>
<p>J.-L. Bouraoui*&#8212; Ph. Boissi&#232;re* &#8212; M. Mojahid* &#8212; N. Vigouroux* &#8212; A. 
Lagarrigue*, F. Vella* &#8212; J.-L. Nespoulous** 
</p>
<p>* IRIT (Institut de Recherche en Informatique de Toulouse), UMR CNRS 5505 
Universit&#233; Paul Sabatier 
</p>
<p>118, Route de Narbonne, F-31062 Toulouse Cedex 
{bouraoui,boissier, mojahid, vigourou, alagarri, vella}@irit.fr 
</p>
<p>** OCTOGONE, (E.A 4156) / Laboratoire Jacques Lordat 
Universit&#233; de Toulouse II - Le Mirail Pavillon de la Recherche, 
</p>
<p>5, All&#233;es Antonio-Machado, F-31058 Toulouse Cedex 
nespoulo@univ-tlse2.fr 
</p>
<p>R&#233;sum&#233; L'objectif du travail pr&#233;sent&#233; ici est la mod&#233;lisation de la d&#233;tection et la correction 
des erreurs orthographiques et dactylographiques, plus particuli&#232;rement dans le contexte des 
handicaps langagiers. Le travail est fond&#233; sur une analyse fine des erreurs d&#8217;&#233;criture 
commises. La premi&#232;re partie de cet article est consacr&#233;e &#224; une description pr&#233;cise de la faute. 
Dans la seconde partie, nous analysons l&#8217;erreur (1) en d&#233;terminant la nature de la faute 
(typographique, orthographique, ou grammaticale) et (2) en explicitant sa cons&#233;quence sur le 
niveau de perturbation linguistique (phonologique, orthographique, morphologique ou 
syntaxique). Il r&#233;sulte de ce travail un mod&#232;le g&#233;n&#233;ral des erreurs (une grille) que nous 
pr&#233;senterons, ainsi que les r&#233;sultats statistiques correspondants. Enfin, nous montrerons sur 
des exemples, l&#8217;utilit&#233; de l&#8217;apport de cette grille, en soumettant ces types de fautes &#224; quelques 
correcteurs. Nous envisageons &#233;galement les implications informatiques de ce travail. 
</p>
<p>Abstract  The aim of our work is modeling the detection and the correction of spelling and 
typing errors, especially in the linguistic disabilities context. The work is based on a  fine 
analysis of clerical errors committed. The first part of this article is devoted to a detailed 
description of error. In the second part, we analyze error in (1) determining the nature of the 
fault (typographical, spelling, or grammar) and (2) by explaining its consequences on the level 
of linguistic disturbance (phonological, orthographic, morphological and syntactic). The 
outcome of this work is a general model of errors (a grid) that we present, as well as the 
corresponding statistical results. Finally, we show on examples, the usefulness of this grid, by 
submitting these types of errors to a few spellcheckers. We also envisage the computer 
implications of this work 
</p>
<p>Mots-cl&#233;s :  Typologie et analyse d&#8217;erreurs textuelles, assistance &#224; la saisie de textes 
Keywords :   Typology and analyze of textual errors, writing assitance systems.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bouraoui Jean-L&#233;on, Boissi&#232;re Philippe, Mojahid Mustapha 
</p>
<p>1 Introduction 
Un des principaux enjeux de la prise en compte des erreurs &#224; l&#8217;&#233;crit (production manuscrite ou 
clavier) sont leurs traitements computationnels imm&#233;diats ou diff&#233;r&#233;s (par le biais de  
correcteurs orthographiques) et leurs pr&#233;ventions &#224; long terme gr&#226;ce &#224; des dispositifs 
d&#8217;apprentissage (particuli&#232;rement pour des enfants ou des &#233;trangers apprenant le fran&#231;ais). Or, 
ces enjeux, s&#8217;ils sont de mieux en mieux trait&#233;s pour les sujets &#171; sains &#187;, et ce malgr&#233; 
l&#8217;explosion de la communication par SMS par exemple qui postule pour un nouveau mode 
(V&#233;ronis et al. 2006), posent d&#8217;importants probl&#232;mes pour les personnes souffrant de 
handicaps langagiers, en fonction de la nature de la pathologie (c&#233;r&#233;braux-l&#233;s&#233;s, sujets 
dyslexiques, parkinsoniens, aphasiques, paralysie c&#233;r&#233;brale, etc.) ou d&#8217;incapacit&#233;s motrices 
des membres sup&#233;rieurs (myopathes, sujets parkinsoniens, etc.). Leurs productions 
linguistiques comportent de nombreuses erreurs, bien plus nombreuses que la moyenne 
comme nous le verrons dans cet article, et auxquelles les correcteurs orthographiques 
s&#8217;appliquent peu ou prou. Il est, par cons&#233;quent, n&#233;cessaire de disposer d&#8217;une identification et 
&#224; terme d&#8217;une mod&#233;lisation computationnelle des diverses cat&#233;gories d&#8217;erreurs.  
L&#8217;une des contributions principales de ce travail est la proposition d&#8217;une grille d&#8217;interpr&#233;tation 
et d&#8217;annotation des erreurs &#224; l&#8217;&#233;crit. Celle-ci vise &#224; rendre compte, de la mani&#232;re la plus 
exhaustive possible, des erreurs survenues dans la production &#233;crite, manuscrite ou par saisie 
clavier, de personnes pr&#233;sentant divers types de handicaps &#171; centraux &#187; ou &#171; p&#233;riph&#233;riques &#187; 
du langage. Cette mod&#233;lisation nous permet d&#8217;am&#233;liorer les processus de d&#233;tection et de 
correction d&#8217;erreurs car en effet, les outils existants se trouvent d&#233;faillants face &#224; ces types 
erreurs. 
</p>
<p>Ce  travail s&#8217;inscrit dans les projets ESACIMC et  CALAME1. Nous proc&#233;dons &#224; l&#8217;analyse 
(neuro)linguistique des erreurs des sujets IMOC/IMC2 en situation de saisie sur claviers. Nous 
pr&#233;sentons les principaux enjeux et probl&#232;mes li&#233;s &#224; notre &#233;tude. Nous recensons ensuite les 
diff&#233;rentes cat&#233;gories d&#8217;erreurs et de perturbations qui leur sont associ&#233;es. Nous montrons 
notamment que lors de la saisie par clavier, les erreurs peuvent avoir une motivation 
phon&#233;tique, morph&#233;mique, voire spatiale (relative &#224; la configuration du clavier). Nous 
analysons le comportement des correcteurs automatiques face aux erreurs commises pour 
illustrer leurs limites; ici nous nous focaliserons sur les erreurs li&#233;es aux unit&#233;s lexicales et &#224; 
la gestion des blancs. Nous illustrons &#233;galement l&#8217;apport de notre grille &#224; l&#8217;aide d&#8217;exemples 
extraits du jeu d&#8217;essai. Nous montrons enfin quelques pistes concernant les strat&#233;gies pour 
am&#233;liorer les processus de d&#233;tection et de correction. 
</p>
<p>2 R&#233;flexions th&#233;oriques et m&#233;thodologiques 
Compte tenu de l&#8217;existence de diff&#233;rents niveaux d&#8217;organisation de la structure des langues 
naturelles, il appara&#238;t indispensable de rendre compte de l&#8217;ensemble des erreurs susceptibles 
de survenir &#224; chacun de ces niveaux: litt&#233;ral, graph&#233;mique, lexical, morphologique, syntaxique 
portant sur des entit&#233;s linguistiques allant de la &#171; lettre &#187; &#224; la &#171; phrase &#187; et au &#171; texte &#187;. 
Ceci &#233;tant, rares sont finalement les erreurs qui (a) ne se situent  qu&#8217;&#224; un seul niveau et (b) 
n&#8217;ont pas d&#8217;impact (m&#234;me indirect) &#224; d&#8217;autres niveaux. Ainsi, une omission &#171; locale &#187; d&#8217;une 
pr&#233;position entra&#238;ne in&#233;luctablement l&#8217;agrammaticalit&#233; de la phrase dans laquelle elle  
intervient (exemple : Il a pos&#233; l&#8217;assiette XXX la table). Pareillement, une erreur qui pourrait 
</p>
<p>                                                 
</p>
<p>1
 &#201;valuation qualitative de Syst&#232;mes d&#8217;Aide &#224; la Communication pour les Infirmes Moteurs C&#233;r&#233;braux 
</p>
<p>(http://www.irit.fr/ESACIMC/); CALAME: http://www.irit.fr/calame/. 
2
 Infirmes Moteur d&#8217;Origine C&#233;r&#233;brale/ Infirmes Moteurs C&#233;r&#233;braux </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#233;matique d'analyse et de mod&#233;lisation des erreurs en production &#233;crite. Approche 
interdisciplinaire 
n&#8217;&#234;tre qu&#8217;orthographique (dans son d&#233;terminisme sous-jacent) peut entra&#238;ner, secondairement, 
une violation morphologique (exemple : il mangeais). 
Il convient, par cons&#233;quent, d&#8217;adopter une d&#233;marche &#171; multi-niveaux &#187;, laquelle requiert 
d&#8217;octroyer &#224; une m&#234;me erreur &#171; superficielle &#187; plusieurs &#233;tiquettes. Dans le premier exemple 
ci-dessus, nous serons ainsi amen&#233;s &#224; &#233;tiqueter &#224; un premier niveau, l&#8217;omission de morph&#232;me 
grammatical en tant que telle, avant d&#8217;ajouter une deuxi&#232;me &#233;tiquette, au plan syntaxique cette 
fois (&#171; agrammatisme &#187;). Cela ne veut certes pas dire que le sujet a commis plusieurs erreurs. 
Cela veut simplement dire qu&#8217;en commettant une erreur &#224; tel ou tel endroit du message, le 
sujet a entra&#238;n&#233; plusieurs violations aux conditions de bonne formation des &#233;nonc&#233;s &#233;crits. Par 
cons&#233;quent, ceci nous conduira &#224; diff&#233;rencier, (a) des &#171; erreurs &#224; impact (simplement) local &#187; 
et  (b) des &#171; erreurs &#224; effets secondaires &#187; ;  ces derni&#232;res pr&#233;sentant,  de  toute &#233;vidence,  un 
degr&#233; de gravit&#233; plus important, susceptible de perturber de fa&#231;on massive l&#8217;&#233;change 
d&#8217;informations entre l&#8217;&#233;metteur (scripteur) et le r&#233;cepteur (lecteur). 
La &#171; port&#233;e &#187; de l&#8217;erreur complique passablement l&#8217;analyse dont il est ici question. Dans ce 
qui suit, nous pr&#233;sentons les points n&#233;cessitant une analyse multi-niveaux, dans la perspective 
que nous venons de d&#233;crire.  
</p>
<p>3 Typologie des erreurs et exploitation de la grille 
A l&#8217;&#233;crit, les erreurs peuvent intervenir &#224; diff&#233;rents niveaux. Ils correspondent aux diff&#233;rentes 
dimensions de l&#8217;&#233;crit, de la plus globale (mise en forme du document) aux plus fines 
(phon&#232;mes,  caract&#232;res  de ponctuation, &#8230;). Nous pouvons les hi&#233;rarchiser, par granularit&#233; 
croissante, de la mani&#232;re suivante : 
&#8211; Mise en Forme Mat&#233;rielle (Virbel 1989) du document (au plan spatial essentiellement). A ce 
niveau, les erreurs peuvent consister, par exemple, en des sauts de page ou retours &#224; la ligne 
g&#234;nant dans l&#8217;organisation de l&#8217;ensemble du texte, des erreurs dans l&#8217;attribution des titres&#8230; ;  
&#8211; Segmentation en phrases : il  s&#8217;agit  de la composition des &#233;nonc&#233;s produits en phrases bien 
form&#233;es (m&#234;me si celles-ci comportent des erreurs aux niveaux inf&#233;rieurs) par opposition &#224; ce 
que l&#8217;on peut appeler &#171; &#233;nonc&#233;s non-phrases &#187; (par exemple, &#233;crits en &#171; style 
t&#233;l&#233;graphique &#187;) ; 
&#8211; Unit&#233; lexicale : il peut s&#8217;agir aussi bien de l&#8217;unit&#233; lexicale dans sa globalit&#233; que de ses 
entit&#233;s constituantes : lettres, morph&#232;mes, etc. ;  
&#8211; Gestion de la ponctuation : ce niveau recouvre, par exemple, l&#8217;utilisation erron&#233;e d&#8217;un point 
&#224; la place d&#8217;une virgule ou inversement, l&#8217;absence de ponctuation, etc. Cela concerne aussi 
bien les niveaux phrastique que intra-phrastique ; 
&#8211; Gestion des blancs inter-mots, voire intra-mots, ces derniers sont appel&#233;s &#171; erreurs 
logogrammiques &#187; par (Catach 1980). 
Dans cet article, nous ne nous sommes pench&#233;s que sur les niveaux : unit&#233; lexicale et gestion 
des blancs. Concernant le niveau unit&#233; lexicale : il se retrouve &#233;galement dans les productions 
orales, ce qui peut &#234;tre int&#233;ressant dans la perspective d&#8217;une typologie adaptable &#224; d&#8217;autres 
modalit&#233;s; d&#8217;autre part, il a fait l&#8217;objet de nombreuses &#233;tudes et exp&#233;rimentations, notamment 
psycholinguistiques, sur lesquelles nous pouvons nous baser (cf. par exemple (Bonin 2007)). 
Quant au niveau, gestion des blancs, il est reli&#233; &#224; celui des unit&#233;s lexicales, puisqu&#8217;il peut 
affecter leur formation, comme nous le verrons plus bas. Il nous paraissait indispensable de le 
traiter dans le cadre de ce travail. 
Une fois que nous avons d&#233;limit&#233; les niveaux sur lesquels nous allons travailler, il nous faut 
ensuite &#233;laborer une typologie des erreurs qui s&#8217;y manifestent. Notre objectif est de permettre 
une description aussi pr&#233;cise que possible des  erreurs, du niveau le plus concret au plus 
abstrait. Nous avons ainsi d&#233;fini un ensemble de cat&#233;gories, regroup&#233;es sous deux grandes 
&#233;tiquettes, correspondant respectivement &#224; la description des erreurs, et &#224; l&#8217;analyse de celles-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bouraoui Jean-L&#233;on, Boissi&#232;re Philippe, Mojahid Mustapha 
</p>
<p>ci. Ces diff&#233;rentes cat&#233;gories sont repr&#233;sent&#233;es dans la deuxi&#232;me colonne du Tableau 1. Nous 
l&#8217;explicitons ci-apr&#232;s. 
Nous avons r&#233;alis&#233; une &#233;tude comparative des annotateurs et les r&#233;sultats se sont av&#233;r&#233;s 
int&#233;ressants et prometteurs. Cependant, une objection pourrait &#234;tre soulev&#233;e : l&#8217;annotation 
effectu&#233;e n&#8217;est-elle pas sujette &#224; la subjectivit&#233; de celui qui la r&#233;alise ? Dans ce cas, les 
r&#233;sultats obtenus varieraient grandement selon l&#8217;annotateur, et seraient donc inexploitables. 
Pour pallier cette argumentation le &#171; coefficient Kappa &#187; appel&#233; aussi calcul de l&#8217;accord inter-
annotateurs est un moyen utilis&#233; pour &#233;valuer la divergence ou la convergence des 
annotateurs. 4 sp&#233;cialistes ont annot&#233; les m&#234;mes phrases issues des jeux d&#8217;essai (cf. infra), et 
la formule de (Carletta 1996) a &#233;t&#233; appliqu&#233;e. Les r&#233;sultats donnent un coefficient de 0,866 
pour les types de fautes et 0,842 pour les niveaux d&#8217;erreurs. Notre sch&#233;ma d&#8217;annotations peut 
&#234;tre ainsi consid&#233;r&#233; comme robuste, et peut permettre des interpr&#233;tations rigoureuses. 
Notre premier objectif scientifique est d&#8217;&#233;tudier les erreurs provenant de pathologies affectant 
la production du langage, dans le but de les mod&#233;liser. Nous avons conduit cette premi&#232;re 
&#233;tude sur la base de la pratique ant&#233;rieure de certains d&#8217;entre nous en mati&#232;re d&#8217;&#233;tude de 
productions pathologiques, g&#233;n&#233;ralement chez des sujets c&#233;r&#233;brol&#233;s&#233;s (voir par exemple, 
(Nespoulous et al, 1982)).  
Lors de cette &#233;tude, nous nous sommes focalis&#233;s sur des textes &#233;cologiques de patients IMC. 
Ces textes nous ont &#233;t&#233; fournis d&#8217;une part, par le centre Kerpape dans le cadre du projet 
ESACIMC, et d&#8217;autre part, par le centre Les Iris de Carpentras. 
L&#8217;&#233;chantillon de production fourni par Kerpape est compos&#233; de 472 phrases, produites par six 
sujets IMC3. Il &#233;tait propos&#233; aux sujets de s&#8217;exprimer librement. Nous en avons extrait 13 
&#233;nonc&#233;s, provenant tous du m&#234;me sujet4 ; c&#8217;est &#224; partir de ces &#233;nonc&#233;s qu&#8217;a &#233;t&#233; con&#231;ue notre 
grille d&#8217;annotation. Le choix des &#233;nonc&#233;s parmi l'ensemble de l&#8217;&#233;chantillon de production a 
&#233;t&#233; fait selon des crit&#232;res de spontan&#233;it&#233; et d&#8217;intelligibilit&#233; des &#233;nonc&#233;s &#233;crits. Les phrases 
agrammaticales r&#233;pondant directement &#224; des questions scolaires ont &#233;t&#233; &#233;limin&#233;es. 
Concernant l&#8217;&#233;chantillon de production fourni par le centre de Carpentras, il s&#8217;agit d&#8217;un 
dialogue &#233;crit &#8211; le sujet est atteint d&#8217;anarthrie &#8211; entre la patiente IMC adolescente, et son 
psychoth&#233;rapeute, il comporte 9 &#233;nonc&#233;s. Il nous a servi &#224; calculer la robustesse de notre grille 
d&#8217;annotation; combin&#233; aux 13 &#233;nonc&#233;s du centre Kerpape, il a &#233;galement permis de calculer la 
distribution des diff&#233;rentes cat&#233;gories d&#8217;erreurs. 
</p>
<p>3.1 Grille et conventions d&#8217;annotation 
Nous posons la question de savoir quand cat&#233;goriser un ph&#233;nom&#232;ne comme &#233;tant une erreur 
ou non, puis nous pr&#233;sentons les conventions d&#8217;annotation utilis&#233;es. 
L&#8217;annotation se fait dans un tableau; une illustration est donn&#233;e dans le Tableau 2 : l&#8217;&#233;nonc&#233; &#224; 
analyser est pr&#233;sent&#233; dans une ligne du tableau, et chaque unit&#233; lexicale faisant l&#8217;objet d&#8217;une 
ou plusieurs erreurs est mise en gras. Chaque ligne suivante est consacr&#233;e &#224; une erreur. Nous 
appliquerons &#233;galement cette r&#232;gle dans le cas o&#249; une seule unit&#233; lexicale pr&#233;sente plus d&#8217;une  
erreur, &#224; l&#8217;exception de la colonne &#171; mot en faute &#187;, avec utilisation de la fonction &#171; fusion des 
cellules &#187;. Les colonnes correspondent aux diff&#233;rentes cat&#233;gories d&#8217;erreur. Quand tous les 
mots en faute ont &#233;t&#233; ainsi pr&#233;sent&#233;s et trait&#233;s, nous passons &#224; l&#8217;&#233;nonc&#233; suivant,  et ainsi de 
suite. Les notations pour chaque niveau sont d&#233;crites ci-apr&#232;s. 
</p>
<p>                                                 
</p>
<p>3
 Nous ne disposons malheureusement pas de plus de d&#233;tails sur le cadre de production de ces &#233;nonc&#233;s, 
</p>
<p>notamment le type de clavier utilis&#233;. 
</p>
<p>4
 N&#233; en 1984, la cause de son handicap est une souffrance p&#233;rinatale ayant entra&#238;n&#233; une dyskin&#233;sie et, au plan 
</p>
<p>de l&#8217;expression orale, une anarthrie. La motricit&#233; est de niveau V (mobilit&#233; tr&#232;s restreinte, m&#234;me avec fauteuil 
roulant). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#233;matique d'analyse et de mod&#233;lisation des erreurs en production &#233;crite. Approche 
interdisciplinaire 
 
</p>
<p> Types de fautes  Typologie Exemples 
</p>
<p>Addition Paragraphie Litt&#233;rale (PL) *fautteuil &#8594; fauteuil 
</p>
<p>D&#233;placement Paragraphie Litt&#233;rale (PL) * bein &#8594; bien 
</p>
<p>Omission Paragraphie Litt&#233;rale (PL) * deuxi&#232;m &#8594; deuxi&#232;me 
</p>
<p>Descripti
on 
</p>
<p>Substitution Paragraphie Litt&#233;rale (PL) *g&#233;n&#233;cologue &#8594; 
gyn&#233;cologue 
</p>
<p>Faute de frappe Paragraphie Litt&#233;rale Clavier 
(PLC) 
</p>
<p>*bo, &#8594; bon 
</p>
<p>Faute d&#8217;orthographe 
usuelle 
</p>
<p>Paragraphie Graph&#233;mique (PG) *foy&#233; &#8594; foyer 
</p>
<p>Faute d&#8217;accord Paragraphie Morph&#233;mique 
(PM) 
</p>
<p>* des famille &#8594; des familles 
</p>
<p>Fusion de mots Perturbation Morph&#233;mique 
Fusion (PeMf) 
</p>
<p>* papa ma expliqu&#233;  
&#8594; papa m&#8217;a expliqu&#233; 
</p>
<p>Analyse 
</p>
<p>Coupure de mots Perturbation Morph&#233;mique 
Segmentation (PeMs) 
</p>
<p>*j&#8217;ai merai&#8594; j'aimerai  
</p>
<p>Tableau 1 : Typologie et exemples des types de fautes 
Dans le niveau &#171; Analyse &#187;, l&#8217;annotation des diff&#233;rentes parties de ce niveau est faite sur trois 
colonnes : 
</p>
<p>&#8211;  Colonne &#171; Type de faute ou paragraphie &#187; : utilisation des abr&#233;viations d&#233;crites ci-
dessus. Dans le cas de la seule faute &#224; cons&#233;quence orthographique, on laissera la case vide. 
S&#8217;il s&#8217;agit d&#8217;une erreur &#171; ind&#233;chiffrable &#187; (toute s&#233;quence de lettres/caract&#232;res ne pouvant &#234;tre 
identifi&#233;e &#224; un mot existant), c&#8217;est dans cette colonne que l&#8217;on notera &#171; IND &#187; ;  
</p>
<p>&#8211;  Colonne &#171; Niveau (cons&#233;quence) &#187; : les commentaires fait pour la colonne &#171; Type de 
faute ou paragraphie &#187; s'appliquent &#233;galement ici ; 
</p>
<p>&#8211;  Colonne &#171; Commentaire &#187; : la r&#233;daction est laiss&#233;e &#224; l&#8217;appr&#233;ciation de l&#8217;annotateur, avec 
une pr&#233;f&#233;rence pour des commentaires succincts. 
Les conventions &#233;nonc&#233;es ci-dessus sont appliqu&#233;es &#224; l&#8217;analyse de l&#8217;&#233;nonc&#233;  : 
&#171; il estg super facip &#224; utilisre &#187;. Le Tableau 2 illustre le r&#233;sultat de l&#8217;annotation.  
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bouraoui Jean-L&#233;on, Boissi&#232;re Philippe, Mojahid Mustapha 
</p>
<p> 
</p>
<p>Description Analyse de l&#8217;erreur Mot en 
faute 
</p>
<p>Addition Omission D&#233;placement Substitution 
Type de faute ou 
</p>
<p>paragraphie 
Niveau 
</p>
<p>(cons&#233;quence) 
Nature / Commentaire 
</p>
<p>il estg super facip &#224; utilisre 
</p>
<p>Estg G    PLC Phono  
</p>
<p>   p&#1;l PLC Phono  facip 
</p>
<p> E   PL Phono oubli [e] final 
</p>
<p>utilisre   r (-1)e(+1)  PLC Phono M&#233;tath&#232;se r&#233;ciproque 
</p>
<p>Tableau 2 : Exemple d'annotation 
</p>
<p>3.2 Analyse du comportement des correcteurs automatiques 
</p>
<p>Nous avons cherch&#233; &#224; d&#233;terminer l&#8217;apport de notre approche d&#8217;identification des erreurs par 
rapport &#224; celles d&#233;j&#224; impl&#233;ment&#233;es dans les correcteurs orthographiques, libres ou payants, du 
march&#233;. Notre but est de d&#233;terminer dans quelle mesure les syst&#232;mes existants et &#171; grand 
public &#187; sont adapt&#233;s, ou non, aux erreurs produites par des sujets IMC. Notre analyse se 
compose de deux parties. D&#8217;une part, une comparaison statistique des performances par ces 
correcteurs et d&#8217;autre part, une analyse plus fine des performances obtenues par ces 
correcteurs, et de ce qu&#8217;elles pourraient &#234;tre si l&#8217;on appliquait notre m&#233;thodologie. 
</p>
<p>3.2.1 Comparaison de correcteurs existants 
</p>
<p>Pour &#233;tablir ces comparaisons, nous avons retenu trois correcteurs tr&#232;s largement r&#233;pandus: 
Hunspell, Cordial (version d&#233;mo: toutes les fonctionnalit&#233;s activ&#233;es, mais seulement pendant 
un mois), et le correcteur int&#233;gr&#233; &#224; Microsoft Word 2003. 
Nous avons soumis &#224; chacun les 13 &#233;nonc&#233;s de l&#8217;&#233;chantillon de production d&#233;crit en d&#233;but de 
section 3, et comptabilis&#233; le nombre de fautes d&#233;tect&#233;es, ainsi que les &#171; faux positifs &#187;, c&#8217;est-&#224;-
dire les mots signal&#233;s comme faux alors qu&#8217;ils ne comportent pas d&#8217;erreurs. Dans ce contexte, 
nous employons le terme de &#171; corpus &#187; par raccourci, mais nous avons plut&#244;t consid&#233;r&#233; 
l&#8217;ensemble des &#233;nonc&#233;s comme un jeu d&#8217;essai pour &#233;valuer les limites des syst&#232;mes de 
correction. Cette m&#233;thodologie est couramment employ&#233;e en g&#233;nie logiciel, et consiste &#224; 
d&#233;finir les conditions dans lesquelles une application donn&#233;e est peu performante. Souvent, 
ces conditions sont choisies parce que l&#8217;application n&#8217;a pas &#233;t&#233; con&#231;ue pour les prendre en 
compte. Nous consid&#233;rons que c&#8217;est la m&#234;me probl&#233;matique que nous adoptons avec les 
correcteurs orthographiques du march&#233;, qui ne sont pas adapt&#233;s aux fautes produites par les 
sujets IMC/IMOC. 
Bien que le logiciel Cordial et le correcteur de Word disposent de modules de corrections 
syntaxiques (&#224; port&#233;e morphologique), les erreurs morphologiques ne sont pas d&#233;tect&#233;es. La 
raison vient du fait que les erreurs commises en amont d&#8217;une faute &#224; port&#233;e morphologique 
Probl&#233;matique d'analyse et de mod&#233;lisation des erreurs en production &#233;crite. font perdre les 
rep&#232;res au correcteur orthographique. Il suffit de corriger les erreurs ant&#233;rieures pour que les 
fautes morphologiques deviennent d&#233;tectables. De plus, Word comme Cordial signalent une 
faute si la premi&#232;re lettre de la phrase n&#8217;est pas en majuscule. Ce type d&#8217;erreurs (tr&#232;s 
fr&#233;quentes dans nos phrases tests, puisqu&#8217;une seule des phrases analys&#233;es commence par une 
majuscule), contribue &#233;galement &#224; &#171; d&#233;stabiliser &#187; le progiciel de correction. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#233;matique d'analyse et de mod&#233;lisation des erreurs en production &#233;crite. Approche 
interdisciplinaire 
Exemples : 
 (1) &#171; tu a vu quil ya des famille &#8230; &#187;. En (1),  tu est d&#233;tect&#233; comme erreur de syntaxe et  quil 
comme faute. En &#233;crivant : (2) &#171; Tu a vu quil ya des famille &#8230; &#187; a est d&#233;tect&#233; comme faute de 
syntaxe. Si l&#8217;on corrige les trois premi&#232;res fautes a quil et ya, on obtient : (3) &#171; Tu as vu qu&#8217;il  
y a des famille &#8230; &#187;. 
Ici, tout le groupe des famille est soulign&#233; comme erreur morphologique (abusivement appel&#233; 
faute de syntaxe par Word). 
La couverture lexicale de Word est sup&#233;rieure &#224; celle de Hunspell et Cordial ce qui 
paradoxalement fait faire au premier un oubli suppl&#233;mentaire. Dans (4) &#171; je pences .. &#187; Word 
sait que pences est le pluriel de penny et ne d&#233;tecte pas la faute contrairement &#224; Hunspell et 
Cordial. On voit donc qu&#8217;une trop grande couverture lexicale peut &#234;tre nuisible quand les 
textes sont fortement entach&#233;s d&#8217;erreurs. 
</p>
<p>Enfin, seul Hunspell a d&#233;tect&#233; une erreur sur le h aspir&#233; de (5) &#171; l&#8217;handicap de &#8230; &#187;  
Les r&#233;sultats chiffr&#233;s sont pr&#233;sent&#233;s dans le Tableau 3. 
 
</p>
<p>Avec oubli des majuscules et 
retours &#224; la ligne intempestifs 
</p>
<p>(S1) 
</p>
<p> Sans oubli des majuscules et 
retours &#224; la ligne intempestifs 
</p>
<p>(S2) 
</p>
<p> 
</p>
<p>Pourcentage 
de fautes 
d&#233;tect&#233;es 
</p>
<p>Pourcentage 
de faux 
positifs 
</p>
<p>Pourcentage 
de fautes 
d&#233;tect&#233;es 
</p>
<p>Pourcentage 
de faux 
positifs 
</p>
<p>Hunspel 54,42% 0,00% 55,10% 0,68% 
</p>
<p>Word 74,15% 21,09% 59,86% 2,72% 
</p>
<p>Cordial 65,99% 12,24% 63,27% 4,76% 
</p>
<p>Tableau 3 : Performances des principaux correcteurs du march&#233; 
On observe que les performances g&#233;n&#233;rales des correcteurs confront&#233;s &#224; ces erreurs sont assez 
faibles puisqu&#8217;elles sont de l&#8217;ordre de 50% d&#8217;efficacit&#233;. Pour plus de raffinement dans 
l&#8217;analyse, nous avons calcul&#233; les taux de pr&#233;cision (nombre de d&#233;tections correctes par rapport 
au nombre total de d&#233;tections (y compris les &#171; faux positifs &#187;)) et les taux de rappel (nombre 
d&#8217;erreurs correctement d&#233;tect&#233;es par rapport au nombre total d&#8217;occurrences d'erreurs) obtenus. 
Ces deux m&#233;triques sont g&#233;n&#233;ralement utilis&#233;es dans l&#8217;&#233;valuation des performances de module 
d&#8217;identification du TAL. Globalement, les correcteurs provoquent peu de &#171; faux-positifs &#187; ; 
par contre, les taux de rappel montrent des performances parfois basses, en &#233;tant parfois 
proche des 50%.  
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bouraoui Jean-L&#233;on, Boissi&#232;re Philippe, Mojahid Mustapha 
</p>
<p>(S1) (S2)  
Taux de 
pr&#233;cision 
</p>
<p>Taux de 
rappel 
</p>
<p>Taux de 
pr&#233;cision 
</p>
<p>Taux de 
rappel 
</p>
<p>Hunspel 100,00% 54,42% 98,77% 54,42% 
Word 71,56% 53,06% 95,45% 57,14% 
</p>
<p>Cordial 81,44% 53,74% 92,47% 58,50% 
</p>
<p> 
</p>
<p>Tableau 4 : Taux de pr&#233;cision et de rappel des trois correcteurs test&#233;s 
On remarque &#233;galement que les performances sont meilleures quand les erreurs portant sur les 
majuscules et les retours &#224; la ligne (colonne S2) sont prises en compte. Comme nous allons le 
montrer dans la section suivante, la prise en compte de ce type d&#8217;erreurs est l&#8217;un des points sur 
lesquels notre m&#233;thodologie est un apport, dans le contexte d&#8217;&#233;crits par des personnes 
souffrant de pathologies, par rapport aux correcteurs existants. 
</p>
<p>3.2.2 Apports potentiels de notre grille 
</p>
<p>Pour cette analyse d&#233;taill&#233;e, nous avons approfondi les mesures pr&#233;sent&#233;es pr&#233;c&#233;demment. Le 
but est de d&#233;terminer concr&#232;tement si la grille que nous proposons, et le mod&#232;le qui peut en 
&#234;tre tir&#233;, permettrait de meilleures performances, que celles des correcteurs existants. Pour 
cela, nous &#233;tudions en d&#233;tails les erreurs non ou mal trait&#233;es par ces syst&#232;mes, les raisons de 
ces probl&#232;mes de traitement, et les apports de notre grille &#224; ces probl&#232;mes. Plus pr&#233;cis&#233;ment, 
nous avons d&#233;termin&#233; (uniquement sur le correcteur int&#233;gr&#233; de Microsoft Word) : 
</p>
<p>- Pour les fautes d&#233;tect&#233;es par le correcteur orthographique, si aucune proposition n&#8217;est 
faite, si une voire plusieurs corrections sont propos&#233;es, et le cas &#233;ch&#233;ant si une ou plusieurs 
sont pertinentes. La distinction entre le traitement de d&#233;tection et de correction est 
importante. Comme le fait remarquer (Kukish, 1992, p. 378-379), le premier est bien plus 
facile que le second, en raison notamment de la complexit&#233; de la production 
morphologique de la langue. Nous distinguerons par ailleurs l&#8217;identification et l&#8217;&#233;tiquetage 
des erreurs au sein d&#8217;un m&#234;me mot quand elles existent. Dans le domaine d&#8217;&#233;tude qui nous 
concerne ici, la difficult&#233; de la correction est accrue par la pr&#233;sence d&#8217;erreurs absente des 
cadres de productions non pathologiques ; 
- Pour les fautes non d&#233;tect&#233;es par le correcteur, les raisons de l&#8217;absence de d&#233;tection ; 
- Pour les &#171; faux positifs &#187; les raisons de l&#8217;erreur. 
</p>
<p>A chaque d&#233;faillance av&#233;r&#233;e du correcteur, nous avons d&#233;termin&#233; si notre grille permettrait 
une am&#233;lioration.  
Il s&#8217;av&#232;re que c&#8217;est effectivement le cas, notamment en ce qui concerne les fautes relatives &#224; la 
mise en forme des documents. En effet, beaucoup d&#8217;erreurs concernant certaines propri&#233;t&#233;s de 
mise en forme sont commises : ajout ou suppression d&#8217;espace de tabulation ou de retour &#224; la 
ligne, et o&#249; le correcteur se trouve d&#233;faillant. 
Par exemple dans &#171; an visag&#232; &#187; l&#8217;espace ins&#233;r&#233; n&#8217;est pas consid&#233;r&#233; par le correcteur Word et 
l&#8217;erreur sur  &#171; an  &#187; n&#8217;est pas trouv&#233;e ; par ailleurs toutes les propositions (visage, vissage, 
visages) sont erron&#233;es. Dans un deuxi&#232;me exemple d&#8217;erreur provoqu&#233; par un retour &#224; la ligne 
non volontaire : &#171; consulta &#2; ion &#187;5, le correcteur a propos&#233; cinq corrections totalement hors 
sujet. Par ailleurs, il a pu d&#233;tecter une erreur syntaxique concernant &#171; ion &#187; puisqu&#8217;il r&#233;clame 
syst&#233;matiquement une majuscule en d&#233;but de chaque paragraphe. 
                                                 
</p>
<p>5
 Le &#2; repr&#233;sente le retour &#224; la ligne. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#233;matique d'analyse et de mod&#233;lisation des erreurs en production &#233;crite. Approche 
interdisciplinaire 
Dans notre jeu d&#8217;essais, nous avons relev&#233; un type d&#8217;erreurs fr&#233;quentes li&#233; &#224; la 
m&#233;connaissance de l&#8217;orthographe et o&#249; les sujets cherchent &#224; transcrire &#224; l&#8217;&#233;crit ce qu&#8217;ils 
pourraient &#233;noncer &#224; l&#8217;oral. Par exemple &#171; musure daprand &#187; ou &#171; lord de mition &#187;. Dans le 
premier exemple, toutes les propositions du correcteur  sont fausses, et dans le deuxi&#232;me 
exemple l&#8217;erreur sur &#171; lord &#187; n&#8217;est pas d&#233;tect&#233;e. 
En plus des erreurs de type PLC, PL et PG que VITIPI6 corrige d&#233;j&#224;, la grille des erreurs telle 
que nous la proposons permettra dans ces cas d&#8217;am&#233;liorer la d&#233;tection et la correction des 
erreurs. En effet, la grille repr&#233;sente les particularit&#233;s de la production &#233;crite des sujets 
IMC/IMOC, &#224; partir desquelles de nouveaux mod&#232;les et de nouveaux algorithmes de 
correction seront &#233;labor&#233;s, en combinant les trois approches suivantes qui nous semblent 
compl&#233;mentaires : (1) la prise en compte, dans les calculs de distance7 de caract&#232;res 
typographiques comme l&#8217;espace ou le retour &#224; la ligne, ou encore &#224; l&#8217;int&#233;gration de r&#232;gles 
sp&#233;cifiques au contexte de production; (2) l&#8217;utilisation d&#8217;un lexique ad&#233;quat aux situations de 
productions consid&#233;r&#233;es (par  exemple,  utilisation d&#8217;un  langage &#171; soutenu &#187; ou au contraire 
plus &#171; rel&#226;ch&#233; &#187; comme dans les productions que nous avons &#233;tudi&#233;es) et (3) le recours &#224; un 
phon&#233;tiseur8. Ce dernier permettrait de d&#233;terminer les s&#233;parations entre mots, non en fonction 
de donn&#233;es &#233;crites telles que les espaces ou les retours &#224; la ligne, mais de l&#8217;encha&#238;nement des 
phon&#232;mes. De ce fait, il serait ainsi possible de consid&#233;rer la suite &#171; an visag&#232; &#187; comme une 
seule unit&#233;, ind&#233;pendamment de l&#8217;espace ins&#233;r&#233;. 
</p>
<p>4 Conclusion 
Ce travail transdisciplinaire (linguistique, psycholinguistique, r&#233;&#233;ducation, TAL) repose sur la 
mise en &#339;uvre d&#8217;une d&#233;marche m&#233;thodologique d&#8217;annotation de production &#233;crite, manuscrite 
et clavier fond&#233;e sur les divers niveaux d&#8217;organisation de la langue. Le premier r&#233;sultat est la 
proposition d&#8217;une typologie des erreurs &#224; deux facettes : l&#8217;une descriptive et l&#8217;autre analytique 
de cat&#233;gorisation obtenue sur un jeu d&#8217;essai d&#8217;&#233;crits d&#8217;adolescents IMC. Nous avons, ensuite, 
appliqu&#233; cette grille &#224; l&#8217;annotation d&#8217;un jeu d&#8217;essai par quatre annotateurs. Le coefficient 
Kappa de 0.8 permet de confirmer la robustesse des consignes d&#8217;annotation. L&#8217;analyse de trois 
correcteurs a montr&#233; que nous obtenons au maximum un taux de rappel de 58, 50 % sur les 
corpus d&#8217;essai. Ce second r&#233;sultat nous conforte dans la n&#233;cessit&#233; de consid&#233;rer les 
particularit&#233;s de la production &#233;crite des sujets IMC dans les syst&#232;mes d&#8217;assistance &#224; l&#8217;&#233;criture 
(facilitation, correction et r&#233;&#233;ducation). Nous avons ainsi montr&#233; que, &#233;tant donn&#233; les 
sp&#233;cificit&#233;s des erreurs produites par les sujets, les correcteurs automatiques existants sont 
d&#233;faillants et que la grille que nous proposons apporte des am&#233;liorations tant qu&#8217;au niveau de 
la d&#233;tection qu&#8217;au niveau de la correction. 
A court terme, nous envisageons d&#8217;enrichir le sch&#233;ma d&#8217;annotation et de mener une campagne 
d&#8217;annotation &#224; plus grande &#233;chelle, sur plus de corpus (corpus &#224; th&#233;matiques diff&#233;rents, &#224; 
modalit&#233;s de communication diff&#233;rente (dict&#233;e, dialogue, etc.) et sujets avec des handicaps 
langagiers diff&#233;rents, etc.) afin de couvrir toutes les erreurs de la production &#233;crite.  Nous 
poursuivrons &#233;galement la multi-annotation afin de s&#8217;affranchir des subjectivit&#233;s des 
                                                 
</p>
<p>6
 VITIPI produit un texte sans avoir &#224; taper toutes les lettres qui le composent, car il pr&#233;dit des parties de mots 
</p>
<p>et les affiche d&#232;s qu&#8217;il n&#8217;y a plus d&#8217;ambigu&#239;t&#233;. Il est capable de prendre en compte les fautes de frappe, 
certaines fautes d&#8217;orthographe au fur et &#224; mesure de la saisie , ainsi que des mots n&#8217;appartenant pas &#224; son 
vocabulaire de base tout en continuant de pr&#233;dire des lettres. 
</p>
<p>7
 Le  calcul  de   la distance   entre   le  mot   cible   et   sa  correction potentielle  est  une des  m&#233;thodes   les 
</p>
<p>plus couramment  employ&#233;es pour   les correcteurs orthographiques.  Cf.  par  exemple  (Kukish, op. cit.). 
8
 Par exemple LIA_PHON (d&#233;velopp&#233; par Fr&#233;d&#233;ric B&#233;chet : 
</p>
<p>http://lia.univavignon.fr/fileadmin/documents/Users/Intranet/chercheurs/bechet/download_fred.html), qui 
convertit un texte en la suite de phon&#232;mes correspondants. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bouraoui Jean-L&#233;on, Boissi&#232;re Philippe, Mojahid Mustapha 
</p>
<p>annotateurs dans cette t&#226;che difficile d&#8217;interpr&#233;tation. L&#8217;analyse des comportements des 
correcteurs a montr&#233; l&#8217;imperfection de la prise en compte de la mise en forme des textes, de la 
gestion de la ponctuation, dimensions qui nous semblent indispensables dans l&#8217;&#233;tude cognitive 
de la saisie de textes. Nous envisageons &#233;galement de finaliser et de tester nos strat&#233;gies de 
d&#233;tection et de correction; cet objectif est central dans le cadre de notre projet ANR 
PALLIACOM en cours . 
Ce cadre m&#233;thodologique de d&#233;tection et de cat&#233;gorisation est un pr&#233;alable indispensable &#224; la 
mod&#233;lisation des connaissances linguistiques repr&#233;sentant les troubles langagiers. Enfin &#224; plus 
long terme, nous l'utiliserons &#224; des fins de d&#233;tection/correction au sein de syst&#232;mes 
d&#8217;assistance &#224; l'&#233;criture, pour personnes handicap&#233;es, comme VITIPI (Boissi&#232;re et al., 2006), 
Sibylle (Wandmacher et al., 2007). 
</p>
<p>R&#233;f&#233;rences 
BOISSIERE PH, SCHADLE I, ANTOINE J-Y. &#8220;A methodological framework for writing assistance 
systems: applications to sibylle and VITIPI systems&#8221;, In Modelling, Mesurement &amp; Control, 
S&#233;rie  C, (bioenginaring). Edited by Association for the Advancement of Modelling &amp; 
Simulation Techniques in Entreprise, AMSE-journals (Barcelona Spain), Modellling C, Vol 
67 (Supp Handicap 2006), pp. 167 - 176, 2006. 
</p>
<p>BOISSIERE PH., BOURAOUI J.-L, VELLA F., LAGARRIGUE A., MOJAHID M., VIGOUROUX N., 
NESPOULOUS J.L. &#171; M&#233;thodologie d&#8217;annotation des erreurs en production &#233;crite. Principes et 
r&#233;sultats pr&#233;liminaires &#187;, TALN07, Atelier &#171; Reconstruire la langue dans les communications 
alternatives et augment&#233;es &#187;, vol.2, p.529-538, Toulouse, juin 2007. 
BONIN P., Psychologie du langage : Approche cognitive de la production verbale de mots, De 
Boeck, Collection &#171; Ouvertures Psychologiques &#187;, 2007. 
</p>
<p>CATACH N. L&#8217;enseignement de l&#8217;orthographe, Paris, Nathan, 1980. 
</p>
<p>CARLETTA J. &#8220;Assessing agreement on classification tasks: the kappa statistic&#8221;, 
Computational Linguistics, Vol.2, Issue 2, p.249-54, juin 1996.  
KUKICH K., &#8220;Technique for automatically correcting words in text&#8221;, ACM Computing Surveys 
(CSUR), Vol. 24,  Issue 4, p. 377-439, Year of Publication: 1992 
</p>
<p>NESPOULOUS J-L., LECOURS A.R., &#171; Les troubles de l'&#233;criture dans l'aphasie &#187;, Etudes 
Fran&#231;aises, 18/1, p. 47-59, Les Presses de l'Universit&#233; de Montr&#233;al, 1982. 
</p>
<p>VIRBEL J. &#8220;The contribution of linguistic knowledge to the interpretation of text structure&#8221;. 
Dans Andre, J., Quint, V. et Furuta, R., (Eds) Structured Documents, p. 161&#8211;181. Cambridge 
University Press. 1989. 
</p>
<p>VERONIS J., GUIMIER DE NEEF E. &#171; Le traitement des nouvelles formes de communication 
&#233;crite &#187;. In Sabah, G. (Ed.), Compr&#233;hension automatique des langues et interaction, p. 227-
248. Paris: Herm&#232;s Science, 2006. 
</p>
<p>WANDMACHER T., ANTOINE J-Y., &#171; Mod&#232;le adaptatif pour la pr&#233;diction de mots Adaptation &#224; 
l&#8217;utilisateur et au contexte dans le cadre de la communication assist&#233;e pour personnes 
handicap&#233;es &#187;. In  Revue TAL. Volume 48 &#8211; n&#176; 2/2007, p. 71 &#8211; 95 </p>

</div></div>
</body></html>