<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apport des outils de TAL &#224; la construction d&#8217;ontologies : propositions au sein de la plateforme DaFOE</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Apport des outils de TAL &#224; la construction d&#8217;ontologies :
propositions au sein de la plateforme DaFOE &#8727;
</p>
<p>Jean Charlet1,2, Sylvie Szulman3, Nathalie Aussenac-Gilles4, Adeline
Nazarenko3, Nathalie Hernandez4, Nadia Nadah5, &#201;ric Sardet6, Jean
</p>
<p>Delahousse7, Guy Pierra6
</p>
<p>(1) INSERM UMR_S 872, Eq. 20, Paris
(2) Universit&#233; Pierre et Marie Curie ; AP-HP, Paris
(3) LIPN - UMR 7030, Universit&#233; Paris 13 - CNRS
</p>
<p>(4) CNRS/IRIT et Universit&#233; de Toulouse
(5) Heudiasyc CNRS/UMR 6599, Universit&#233; de Technologie de Compi&#232;gne
</p>
<p>(6) LISI-ENSMA et CRITT-Informatique, Poitiers
(7) MONDECA, Paris
</p>
<p>Jean.Charlet@spim.jussieu.fr, Sylvie.Szulman@lipn.univ-paris13.fr
</p>
<p>R&#233;sum&#233;. La construction d&#8217;ontologie &#224; partir de textes fait l&#8217;objet d&#8217;&#233;tudes depuis plu-
sieurs ann&#233;es dans le domaine de l&#8217;ing&#233;nierie des ontologies. Un cadre m&#233;thodologique en
quatre &#233;tapes (constitution d&#8217;un corpus de documents, analyse linguistique du corpus, concep-
tualisation, op&#233;rationnalisation de l&#8217;ontologie) est commun &#224; la plupart des m&#233;thodes de construc-
tion d&#8217;ontologies &#224; partir de textes. S&#8217;il existe plusieurs plateformes de traitement automatique
de la langue (TAL) permettant d&#8217;analyser automatiquement les corpus et de les annoter tant du
point de vue syntaxique que statistique, il n&#8217;existe actuellement aucune proc&#233;dure g&#233;n&#233;ralement
accept&#233;e, ni a fortiori aucun ensemble coh&#233;rent d&#8217;outils supports, permettant de concevoir de
fa&#231;on progressive, explicite et tra&#231;able une ontologie de domaine &#224; partir d&#8217;un ensemble de res-
sources informationnelles relevant de ce domaine. Le but de ce court article est de pr&#233;senter les
propositions d&#233;velopp&#233;es, au sein du projet ANR DaFOE 4app, pour favoriser l&#8217;&#233;mergence d&#8217;un
tel ensemble d&#8217;outils.
</p>
<p>Abstract. The concept of ontologies, appeared in the nineties, constitute a key point to
represent and share the meaning carried out by formal symbols. Thus, the building of such
an ontology is quite difficult. A way to do so is to use preexistent elements (textual corpus,
taxonomies, norms or other ontologies) and operate them as a basis to define the ontology field.
However, there is neither accepted process nor set of tools to progressively built ontologies from
the available resources in a traceable and explicit way. We report in this paper several proposi-
tions developed within the framework of the ANR DaFOE4App project to support emergence
of such tools.
</p>
<p>Mots-cl&#233;s : Ontologie, construction d&#8217;ontologie, TALN.
</p>
<p>Keywords: Ontology, Ontology building, NLP.
&#8727;. Ce travail b&#233;n&#233;ficie d&#8217;un financement ANR (2006 TLOG 10). Nous remercions l&#8217;ensemble des partenaires
</p>
<p>du projet qui ont contribu&#233; &#224; cette r&#233;flexion.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>J. Charlet, S. Szulman, N. Aussenac-Gilles, A. Nazarenko, N. Hernandez, N. Nadah, E. Sardet,
J. Delahousse, G. Pierra
</p>
<p>1 Motivation
</p>
<p>Depuis son &#233;mergence, au d&#233;but des ann&#233;es 1990, dans les recherches en mod&#233;lisation de
connaissances, la notion d&#8217;ontologie s&#8217;est rapidement diffus&#233;e dans un grand nombre de do-
maines de recherche en informatique. Compte tenu du caract&#232;re tr&#232;s prometteur de cette notion,
de nombreux travaux ont vis&#233;s &#224; permettre son utilisation dans des domaines aussi divers que le
traitement automatique de la langue naturelle, la recherche d&#8217;information, le commerce &#233;lectro-
nique, le web s&#233;mantique, la sp&#233;cification des composants logiciels et l&#8217;int&#233;gration de syst&#232;me
d&#8217;information.
</p>
<p>L&#8217;efficacit&#233; de toutes ces approches pr&#233;suppose n&#233;anmoins l&#8217;existence d&#8217;une ontologie de do-
maine susceptible d&#8217;&#234;tre d&#233;velopp&#233;e, ou d&#8217;&#234;tre mise en &#339;uvre, au sein de l&#8217;application cible.
Or la conception d&#8217;une telle ontologie s&#8217;av&#232;re particuli&#232;rement difficile, surtout si l&#8217;on souhaite
qu&#8217;elle fasse l&#8217;objet de consensus dans une communaut&#233; assez large. Un moyen tr&#232;s largement
utilis&#233; pour atteindre cet objectif est de partir d&#8217;&#233;l&#233;ments pr&#233;existants dans le domaine : corpus
textuels, taxonomies, normes ou fragments d&#8217;ontologie pr&#233;existants, et de les exploiter comme
base pour d&#233;finir progressivement l&#8217;ontologie du domaine. La construction d&#8217;ontologie &#224; partir
de textes fait l&#8217;objet d&#8217;&#233;tudes depuis plusieurs ann&#233;es dans le domaine de l&#8217;ing&#233;nierie des on-
tologies. Un cadre m&#233;thodologique en quatre &#233;tapes (constitution d&#8217;un corpus de documents,
analyse linguistique du corpus, conceptualisation, op&#233;rationnalisation de l&#8217;ontologie) est com-
mun &#224; la plupart des m&#233;thodes de construction d&#8217;ontologies &#224; partir de textes (TERMINAE 1
</p>
<p>(Aussenac-Gilles et al., 2000), Text2Onto (Cimiano &amp; Volker, 2005)). Ces m&#233;thodes sont im-
pl&#233;ment&#233;es dans des outils qui se distinguent par leur approche de la phase de conceptualisation
plus ou moins automatique (Mondary et al., 2008). Cependant s&#8217;il existe des outils largement
utilis&#233;s, tels que Prot&#233;g&#233;, pour repr&#233;senter formellement une ontologie suppos&#233;e d&#233;j&#224; con&#231;ue, et
s&#8217;il existe &#233;galement plusieurs plateformes de traitement automatique de la langue (TAL) per-
mettant d&#8217;analyser automatiquement les corpus et de les annoter tant du point de vue syntaxique
que statistique, il n&#8217;existe actuellement aucune proc&#233;dure g&#233;n&#233;ralement accept&#233;e, ni a fortiori
aucun ensemble coh&#233;rent d&#8217;outils supports, permettant de concevoir de fa&#231;on progressive, expli-
cite et tra&#231;able une ontologie de domaine &#224; partir d&#8217;un ensemble de ressources informationnelle
relevant de ce domaine.
</p>
<p>2 M&#233;thodes du TAL et sp&#233;cifications pour DAFOE
</p>
<p>Les logiciels de TAL permettent d&#8217;extraire des textes des &#233;l&#233;ments de connaissances &#224; repr&#233;-
senter dans une ontologie. Les exp&#233;riences en la mati&#232;re sont tr&#232;s diverses et apr&#232;s avoir fait un
inventaire des outils existants que nous ne d&#233;taillons pas ici 2, nous avons analys&#233; les fonction-
nalit&#233;s les plus importantes 3 et ce qu&#8217;elles peuvent apporter &#224; la construction d&#8217;ontologies dans
le contexte de DaFOE.
</p>
<p>Ainsi, les principales fonctionnalit&#233;s prises en compte dans DaFOE sont : l&#8217;extraction de candi-
dats termes, la pond&#233;ration des candidats termes, la validation des &#233;l&#233;ments terminologiques, la
normalisation des termes, l&#8217;extraction de relations conceptuelles et la gestion du multilinguisme.
</p>
<p>1. http://www-lipn.univ-paris13.fr/~szulman/logi/index.html
2. Le lecteur pourra se r&#233;f&#233;rer aux ouvrages de (Maedche, 2002) et (Buitelaar &amp; Cimiano, 2007)
3. A noter que le probl&#232;me important de l&#8217;extraction des entit&#233;s nomm&#233;es n&#8217;est pas une priorit&#233; pour DaFOE qui
</p>
<p>met l&#8217;accent sur la construction d&#8217;ontologie plus que sur son peuplement, m&#234;me si des extensions sont envisag&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apports du TAL au sein de la plateforme DaFOE
</p>
<p>3 Mod&#232;le de donn&#233;es
</p>
<p>Un cadre m&#233;thodologique a &#233;t&#233; &#233;labor&#233; durant la d&#233;finition de la plateforme. Il a &#233;t&#233; utilis&#233; de
deux fa&#231;ons, &#224; savoir comme cadre permettant d&#8217;avoir une description commune des processus
mis en jeu en m&#234;me temps que mod&#232;le &#233;voluant pour &#234;tre &#224; m&#234;me de tenir compte des desiderata
de tous les partenaires. Ainsi, la plateforme a diff&#233;rents niveaux d&#8217;entr&#233;es, correspondant aux
diff&#233;rentes ressources, et diff&#233;rents niveaux de sortie correspondant &#224; des produits de plus en
plus &#233;labor&#233;s (1) des r&#233;seaux terminologiques s&#8217;organisant durant l&#8217;analyse des donn&#233;es (&#171; R&#233;-
seaux termino-ontologiques &#187; et &#171; Mod&#232;le conceptuel &#187;), (2) un niveau termino-ontologique
o&#249; les concepts sont organis&#233;s et (3) un niveau o&#249; l&#8217;ontologie est formalis&#233;e (&#171; Ontologie for-
melle &#187;). Le mod&#232;le de donn&#233;es de la plateforme DaFOE suit le cadre m&#233;thodologique ainsi
d&#233;crit et se d&#233;compose en quatre couches (Charlet et al., 2008).
</p>
<p>4 Conclusion et perspectives
</p>
<p>Pour valider l&#8217;architecture de m&#233;ta-mod&#233;lisation propos&#233;e, un premier prototype est en cours de
r&#233;alisation par le LISI. Il s&#8217;agit d&#8217;une application Java s&#8217;appuyant sur le SGBD PostgreSQL. Le
mod&#232;le de donn&#233;es de DaFOE, et en corollaire les fonctionalit&#233;s, est particuli&#232;rement d&#233;velopp&#233;
sur les niveaux 1 et 2 du sch&#233;ma pr&#233;c&#233;dent car c&#8217;est &#224; ces niveaux que se concentrent un certain
nombre de difficult&#233;s sur la construction d&#8217;ontologies selon les m&#233;thodes propos&#233;es.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AUSSENAC-GILLES N., BI&#201;BOW B. &amp; SZULMAN S. (2000). Revisiting ontology design : a
methodology based on corpus analysis. In R. DIENG &amp; O. CORBY, Eds., Knowledge Engi-
neering and Knowledge Management : Methods, Models, and Tools. Proc. of the 12th Inter-
national Conference, (EKAW&#8217;2000), LNAI 1937, p. 172&#8211;188 : Springer-Verlag.
</p>
<p>P. BUITELAAR &amp; P. CIMIANO, Eds. (2007). Bridging the Gap between Text and Knowledge
- Selected Contributions to Ontology Learning and Population from Text. IOS Press.
</p>
<p>CHARLET J., SZULMAN S., PIERRA G., NADAH N., TEGUIAK H. V., AUSSENAC-GILLES
N. &amp; NAZARENKO A. (2008). Dafoe : A multimodel and multimethod platform for building
domain ontologies. In D. BENSLIMANE, Ed., 2eJourn&#233;es Francophones sur les Ontologies,
Lyon, France : ACM.
</p>
<p>CIMIANO P. &amp; VOLKER J. (2005). Text2onto - a framework for ontology learning and data-
driven change discovery. In A. MONTOYO, R. MUNOZ &amp; E. METAIS, Eds., Proceedings
of the 10th International Conference on Applications of Natural Language to Information
Systems (NLDB), volume 3513 of Lecture Notes in Computer Science, p. 227&#8211;238, Alicante,
Spain : Springer.
</p>
<p>MAEDCHE A. (2002). Ontology learning for the Semantic Web. Kluwer Academic Publisher.
</p>
<p>MONDARY T., DESPRES S., NAZARENKO A. &amp; SZULMAN S. (2008). Construction d&#8217;on-
tologies &#224; partir de textes : la phase de conceptualisation. In Y. PRI&#201;, Ed., 19es Journ&#233;es
Francophones d&#8217;Ing&#233;nierie des Connaissances (IC), p. 87&#8211;98.</p>

</div></div>
</body></html>