<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La place de la d&#233;sambigu&#239;sation lexicale dans la Traduction Automatique Statistique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>La place de la d&#233;sambigu&#239;sation lexicale dans la Traduction
Automatique Statistique
</p>
<p>Marianna Apidianaki
National Centre for Language Technology, Dublin City University
</p>
<p>mapidianaki@computing.dcu.ie
</p>
<p>R&#233;sum&#233;. L&#8217;&#233;tape de la d&#233;sambigu&#239;sation lexicale est souvent esquiv&#233;e dans les syst&#232;mes
de Traduction Automatique Statistique (Statistical Machine Translation (SMT)) car consid&#233;r&#233;e
comme non n&#233;cessaire &#224; la s&#233;lection de traductions correctes. Le d&#233;bat autour de cette n&#233;ces-
sit&#233; est actuellement assez vif. Dans cet article, nous pr&#233;sentons les principales positions sur le
sujet. Nous analysons les avantages et les inconv&#233;nients de la conception actuelle de la d&#233;sam-
bigu&#239;sation dans le cadre de la SMT, d&#8217;apr&#232;s laquelle les sens des mots correspondent &#224; leurs
traductions dans des corpus parall&#232;les. Ensuite, nous pr&#233;sentons des arguments en faveur d&#8217;une
analyse plus pouss&#233;e des informations s&#233;mantiques induites &#224; partir de corpus parall&#232;les et nous
expliquons comment les r&#233;sultats d&#8217;une telle analyse pourraient &#234;tre exploit&#233;s pour une &#233;valua-
tion plus flexible et concluante de l&#8217;impact de la d&#233;sambigu&#239;sation dans la SMT.
</p>
<p>Abstract. Word Sense Disambiguation (WSD) is often omitted in Statistical Machine
Translation (SMT) systems, as it is considered unnecessary for lexical selection. The discussion
on the need of WSD is currently very active. In this article we present the main positions on the
subject. We analyze the advantages and weaknesses of the current conception of WSD in SMT,
according to which the senses of ambiguous words correspond to their translations in a parallel
corpus. Then we present some arguments towards a more thorough analysis of the semantic
information induced from parallel corpora and we explain how the results of this analysis could
be exploited for a more flexible and conclusive evaluation of the impact of WSD on SMT.
</p>
<p>Mots-cl&#233;s : D&#233;sambigu&#239;sation lexicale, Traduction Automatique Statistique, s&#233;lection
lexicale.
</p>
<p>Keywords: Word Sense Disambiguation, Statistical Machine Translation, lexical selec-
tion.
</p>
<p>1 Introduction
</p>
<p>Les syst&#232;mes de SMT actuels effectuent une d&#233;sambigu&#239;sation lexicale (Word Sense Disam-
biguation (WSD)) implicite : la s&#233;lection lexicale est bas&#233;e sur le contexte local des mots, sans
consid&#233;ration d&#8217;informations linguistiques plus riches, comme celles exploit&#233;es pour la WSD.1
Les architectures de SMT fond&#233;es sur les mots r&#233;alisent la WSD en combinant des probabilit&#233;s
a priori sur les candidats de sens (traductions) &#224; partir de crit&#232;res de fluidit&#233; mod&#233;lis&#233;s par les
probabilit&#233;s du mod&#232;le de langue. Les architectures de SMT bas&#233;es sur les segments int&#232;grent
</p>
<p>1Ces informations peuvent &#234;tre syntaxiques ou collocationnelles, relatives &#224; la position des mots, etc. (Chan
et al., 2007; Carpuat &amp; Wu, 2007).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marianna Apidianaki
</p>
<p>en plus des pr&#233;f&#233;rences de collocation lexicale. N&#233;anmoins, les probl&#232;mes observ&#233;s au niveau
de la s&#233;lection lexicale ont r&#233;anim&#233; l&#8217;int&#233;r&#234;t autour des mod&#232;les de s&#233;lection bas&#233;s sur la WSD2,
capables d&#8217;incorporer des traits contextuels de la langue source (LS) plus riches que ceux pris
en compte par les syst&#232;mes de SMT &quot;&#233;tat de l&#8217;art&quot;. Dans cet article, nous expliquons comment
la WSD est actuellement con&#231;ue dans la SMT et analysons les inconv&#233;nients pos&#233;s par cette
conception. Finalement, nous pr&#233;sentons des arguments en faveur d&#8217;une t&#226;che de WSD bas&#233;e
sur une analyse de la s&#233;mantique lexicale.
</p>
<p>2 D&#233;sambigu&#239;sation dans les syst&#232;mes de SMT
</p>
<p>2.1 Impact n&#233;gatif de la WSD sur la qualit&#233; de traduction
</p>
<p>Le travail de Carpuat et Wu (2005) met en cause le statut de la WSD en tant qu&#8217;&#233;tape b&#233;n&#233;fique
au sein des syst&#232;mes de SMT. Dans les travaux ult&#233;rieurs sur la question (Cabezas &amp; Resnik,
2005; Chan et al., 2007), les auteurs prennent le soin de se positionner par rapport &#224; ces r&#233;sultats
en clarifiant les facteurs qui les ont provoqu&#233;s, voire m&#234;me en critiquant le cadre dans lequel les
exp&#233;riences ont &#233;t&#233; men&#233;es. Les principales raisons de cette d&#233;t&#233;rioration sont les suivantes :
</p>
<p>1. Le petit volume de donn&#233;es d&#8217;entra&#238;nement du syst&#232;me de WSD utilis&#233;.
2. L&#8217;absence de lien entre, d&#8217;une part, les donn&#233;es d&#8217;entra&#238;nement du syst&#232;me de SMT et,
</p>
<p>d&#8217;autre part, les donn&#233;es d&#8217;entra&#238;nement du syst&#232;me de WSD et l&#8217;inventaire de sens util-
is&#233;.
</p>
<p>3. L&#8217;int&#233;gration des pr&#233;dictions du syst&#232;me de WSD &#224; l&#8217;aide de contraintes dures et la non
int&#233;gration du mod&#232;le de WSD et de ses pr&#233;dictions dans le mod&#232;le de traduction. 3
</p>
<p>4. L&#8217;utilisation du score BLEU (Papineni et al., 2002) pour l&#8217;&#233;valuation.
</p>
<p>2.2 Impact positif de la WSD sur la qualit&#233; de traduction
</p>
<p>Des travaux plus r&#233;cents sur le sujet d&#233;montrent l&#8217;effet positif de la WSD dans la SMT. Dans
ces travaux, la WSD n&#8217;est pas restreinte &#224; un nombre pr&#233;cis de sens issus d&#8217;inventaires d&#233;finis a
priori (Cabezas &amp; Resnik, 2005; Chan et al., 2007; Stroppa et al., 2007; Carpuat &amp; Wu, 2007).
Au contraire, les sens des mots sont d&#233;sign&#233;s par leurs &#233;quivalents de traduction (EQVs), rep&#233;r&#233;s
au sein du corpus d&#8217;entra&#238;nement du syst&#232;me de SMT. Ainsi, les syst&#232;mes de WSD et de SMT
sont entra&#238;n&#233;s sur les m&#234;mes corpus.
</p>
<p>En outre, les pr&#233;dictions de WSD sont int&#233;gr&#233;es dans les syst&#232;mes de SMT de mani&#232;re dy-
namique : elles constituent des alternatives que le d&#233;codeur prend en compte en m&#234;me temps
que celles propos&#233;es par le mod&#232;le de traduction (Cabezas &amp; Resnik, 2005). Le d&#233;codeur n&#8217;est
donc pas contraint de s&#233;lectionner la traduction propos&#233;e par le syst&#232;me de WSD et la s&#233;lection
finale est effectu&#233;e par le mod&#232;le de langue.
</p>
<p>Il faut noter que les cibles de d&#233;sambigu&#239;sation dans ces travaux correspondent soit &#224; des mots
(Cabezas &amp; Resnik, 2005; Carpuat et al., 2006) soit &#224; des segments (Stroppa et al., 2007; Chan
</p>
<p>2La premi&#232;re &#233;tude sur le sujet (Brown et al., 1991) avait &#233;t&#233; encourageante mais limit&#233;e.
3Les pr&#233;dictions sont exploit&#233;es soit en for&#231;ant le d&#233;codeur &#224; effectuer un choix, soit en rempla&#231;ant les traduc-
</p>
<p>tions choisies par le syst&#232;me de SMT lors d&#8217;une &#233;tape de post-traitement.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La place de la d&#233;sambigu&#239;sation lexicale dans la Traduction Automatique Statistique
</p>
<p>et al., 2007; Carpuat &amp; Wu, 2007). L&#8217;unit&#233; de base de la s&#233;lection lexicale &#233;tant le segment
et non le mot dans la plupart des syst&#232;mes de SMT actuels (Och &amp; Ney, 2004; Koehn, 2004;
Chiang, 2005), la d&#233;sambigu&#239;sation des segments est suppos&#233;e adapter la WSD &#224; la t&#226;che &#224;
laquelle les syst&#232;mes de SMT sont confront&#233;s, afin qu&#8217;ils puissent tirer profit de ses avantages
(Carpuat &amp; Wu, 2007). Dans ce cas aussi, les sens candidats des segments source sont leurs
traductions rep&#233;r&#233;es dans le corpus d&#8217;entra&#238;nement du syst&#232;me de SMT.
</p>
<p>2.3 Assimilation des t&#226;ches de WSD et de s&#233;lection lexicale
</p>
<p>2.3.1 Avantages
</p>
<p>Lorsque les sens des mots ambigus sont d&#233;sign&#233;s &#224; l&#8217;aide de leurs EQVs, l&#8217;identification du
sens d&#8217;une nouvelle instance co&#239;ncide avec la s&#233;lection de sa traduction. L&#8217;assimilation de ces
deux t&#226;ches pr&#233;sente un certain nombre d&#8217;avantages :
</p>
<p>1. Elle permet de dissocier les techniques de WSD d&#8217;inventaires de sens pr&#233;d&#233;finis, qui peu-
vent contenir des sens non li&#233;s aux donn&#233;es d&#8217;entra&#238;nement du syst&#232;me de SMT (Resnik,
2007).
</p>
<p>2. Elle met l&#8217;accent sur les distinctions s&#233;mantiques pertinentes pour la traduction entre les
langues impliqu&#233;es et permet d&#8217;&#233;viter le rep&#233;rage de distinctions de granularit&#233; trop fine.
</p>
<p>3. Elle permet de tirer profit de la grande disponibilit&#233; de donn&#233;es &#233;tiquet&#233;es sous la forme
de corpus parall&#232;les align&#233;s. L&#8217;&#233;tiquetage des mots source par leurs EQVs augmente forte-
ment les donn&#233;es d&#8217;entra&#238;nement pour les algorithmes supervis&#233;s de WSD, dans la mesure
o&#249; il y a davantage de corpus parall&#232;les que de textes s&#233;mantiquement &#233;tiquet&#233;s.
</p>
<p>4. Elle lie la WSD et son &#233;valuation &#224; la traduction, ce qui permet de r&#233;soudre le probl&#232;me de
la non-conformit&#233;, dans ce cadre, des m&#233;thodes de WSD monolingues ou visant d&#8217;autres
applications.4
</p>
<p>Cette mani&#232;re de concevoir la WSD la rapproche des t&#226;ches multilingues de Senseval (Chklovski
et al., 2004) et de Semeval (Jin et al., 2007), o&#249; les inventaires utilis&#233;s pour la WSD repr&#233;sentent
des distinctions s&#233;mantiques effectu&#233;es dans d&#8217;autres langues.
</p>
<p>2.3.2 Inconv&#233;nients th&#233;oriques
</p>
<p>Malgr&#233; ses avantages, l&#8217;assimilation de la WSD et de la s&#233;lection lexicale pr&#233;sente &#233;galement
un ensemble d&#8217;inconv&#233;nients. Le souci de rendre l&#8217;inventaire de sens aussi relatif que possible
au corpus d&#8217;entra&#238;nement du syst&#232;me de SMT devient tellement important que la pertinence
th&#233;orique de l&#8217;approche adopt&#233;e n&#8217;est pas explor&#233;e. En effet, la consid&#233;ration de correspon-
dances biunivoques (de type un-&#224;-un) entre sens et EQVs para&#238;t simpliste et peut facilement &#234;tre
mise en question. Chaque EQV est consid&#233;r&#233; comme indiquant un sens distinct et l&#8217;&#233;ventuelle
similarit&#233; s&#233;mantique des EQVs n&#8217;est pas prise en compte. Ainsi, les sens sont simplement
&#233;numer&#233;s et consid&#233;r&#233;s comme &#233;quivalents, et leurs relations ne sont pas d&#233;crites.
</p>
<p>Cette approche n&#233;glige la complexit&#233; des relations entre sens et EQVs : un sens peut &#234;tre traduit
par des EQVs s&#233;mantiquement apparent&#233;s dans la langue cible (LC) ou, inversement, un EQV
</p>
<p>4En raison des besoins divergents des applications concernant tant le degr&#233; de WSD, que le type et le niveau
des distinctions s&#233;mantiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marianna Apidianaki
</p>
<p>peut traduire des sens diff&#233;rents. En outre, il se peut que certains EQVs ne constituent pas de
bons indices de sens, dans la mesure o&#249; ils peuvent r&#233;fl&#233;ter des distinctions s&#233;mantiques propres
&#224; la LC ou pr&#233;senter la m&#234;me ambigu&#239;t&#233; que le mot source.5 Par cons&#233;quent, une analyse plus
pouss&#233;e de la s&#233;mantique des EQVs et de leurs &#233;ventuelles relations serait requise.
En ce qui concerne la d&#233;sambigu&#239;sation des segments, elle est consid&#233;r&#233;e comme une v&#233;ritable
t&#226;che de d&#233;sambigu&#239;sation. N&#233;anmoins, les segments utilis&#233;s dans les syst&#232;mes de SMT &quot;&#233;tat
de l&#8217;art&quot; ne sont pas linguistiquement motiv&#233;s (Koehn et al., 2003). Il s&#8217;agit de s&#233;quences de
mots (par ex. house the) qui sont consid&#233;r&#233;es comme de bons segments parce que leurs mots
sont align&#233;s seulement entre eux et non &#224; des mots ext&#233;rieurs aux segments. Ces segments
n&#8217;ont donc pas de statut linguistique d&#233;fini, ce qui rend la d&#233;finition de leurs sens discutable.
La mention explicite &#224; la WSD dans la SMT ne se justifie que par l&#8217;utilisation d&#8217;informations
contextuelles &#233;tendues de la LS, permettant d&#8217;int&#233;grer des probabilit&#233;s contextuelles relatives
aux traductions.
</p>
<p>2.3.3 Inconv&#233;nients pratiques
</p>
<p>Les sens induits par cette approche inter-langue d&#8217;induction de sens ont le m&#234;me statut, ce
qui a comme r&#233;sultat leur traitement uniforme et l&#8217;application des m&#234;mes contraintes pour la
s&#233;lection lors de la WSD. En outre, lorsque la WSD co&#239;ncide avec la s&#233;lection lexicale, son &#233;val-
uation ob&#233;it aux m&#234;mes principes que l&#8217;&#233;valuation de la TA : la s&#233;lection parmi les candidats
de sens d&#8217;un mot pour une nouvelle instance est consid&#233;r&#233;e comme correcte si le sens choisi
correspond &#224; la traduction de r&#233;f&#233;rence6. Etant donn&#233; que chaque EQV repr&#233;sente un sens dis-
tinct, la s&#233;lection d&#8217;un EQV diff&#233;rent de la r&#233;f&#233;rence est directement consid&#233;r&#233;e comme fausse.
Cette conception ne permet pas de prendre en compte l&#8217;importance des erreurs de WSD et de
s&#233;lection lexicale.7 Dans le cadre de la TA, Resnik et Yarowsky (1997) proposent de p&#233;naliser
uniquement les distinctions s&#233;mantiques lexicalis&#233;es diff&#233;remment dans la LC. Nous estimons
que pour une &#233;valuation concluante il faudrait, en outre, consid&#233;rer la distance entre les sens
lexicalis&#233;s par des EQVs de traduction diff&#233;rents.
</p>
<p>3 Vers une analyse de la s&#233;mantique lexicale
</p>
<p>La conception actuelle de la WSD dans la SMT pose des probl&#232;mes aux niveaux de son int&#233;-
gration et de son &#233;valuation. L&#8217;&#233;valuation devient encore plus difficile en raison de l&#8217;incapacit&#233;
des m&#233;triques d&#8217;&#233;valuation de la TA &#224; identifier des correspondances de sens et donner ainsi
une image claire de l&#8217;impact de la WSD sur la traduction. BLEU (Papineni et al., 2002) pro-
pose l&#8217;utilisation de r&#233;f&#233;rences multiples, ce qui entra&#238;ne d&#8217;autres inconv&#233;nients (Callison-Burch
et al., 2006). METEOR traite la synonymie en consid&#233;rant comme correctes des traductions s&#233;-
mantiquement similaires &#224; la r&#233;f&#233;rence (trouv&#233;es dans le m&#234;me synset de WordNet) (Lavie &amp;
Agarwal, 2007). N&#233;anmoins, l&#8217;algorithme de d&#233;tection de la synonymie met en correspondance
les mots sans les d&#233;sambigu&#239;ser. En outre, la m&#233;thode est fortement d&#233;pendante d&#8217;un inventaire
</p>
<p>5Les ambigu&#239;t&#233;s parall&#232;les peuvent ne pas &#234;tre r&#233;solues pendant la traduction, mais elles devraient &#234;tre prises
en consid&#233;ration dans des applications comme la recherche d&#8217;information multilingue.
</p>
<p>6La traduction du mot dans le corpus d&#8217;&#233;valuation (corpus de test).
7Les erreurs devraient &#234;tre p&#233;nalis&#233;es en fonction de la granularit&#233; des distinctions s&#233;mantiques concern&#233;es :
</p>
<p>la classification erron&#233;e entre sens proches devrait &#234;tre moins p&#233;nalis&#233;e que celle entre sens distants (Resnik &amp;
Yarowsky, 1997).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La place de la d&#233;sambigu&#239;sation lexicale dans la Traduction Automatique Statistique
</p>
<p>de sens pr&#233;d&#233;fini, besoin qui restreint son application aux langues disposant de telles ressources
(Lavie &amp; Agarwal, 2007).
Nous estimons qu&#8217;une analyse pouss&#233;e des informations s&#233;mantiques extraites &#224; partir de cor-
pus parall&#232;les rapprocherait davantage la WSD dans la SMT &#224; une vraie t&#226;che de WSD. Cette
analyse pourrait &#234;tre effectu&#233;e en appliquant une m&#233;thode d&#8217;apprentissage non supervis&#233; sur
le corpus d&#8217;entra&#238;nement du syst&#232;me de SMT. Une m&#233;thode de clustering s&#233;mantique permet-
tant l&#8217;&#233;laboration automatique d&#8217;inventaires de sens est propos&#233;e dans Apidianaki (2008). Cette
m&#233;thode regroupe les EQVs des mots ambigus dans des clusters en fonction de leur similar-
it&#233; s&#233;mantique, qui correspond &#224; la similarit&#233; distributionnelle des instances des mots ambigus
qu&#8217;ils traduisent. Ainsi les EQVs s&#233;mantiquement proches et n&#8217;indiquant pas des sens distincts
des mots ambigus sont distingu&#233;s des EQVs qui traduisent des sens distincts, et qui constituent
des indices pertinents de sens. Les sens des mots ambigus sont donc d&#233;crits, au sein de l&#8217;inven-
taire g&#233;n&#233;r&#233;, par des clusters de sens regroupant leurs EQVs.
L&#8217;exploitation de cet inventaire de sens peut lier la WSD &#224; la s&#233;lection lexicale, tout en la ren-
dant sensible &#224; la s&#233;mantique, et s&#8217;av&#232;re b&#233;n&#233;fique au niveau de l&#8217;&#233;valuation de la WSD, qui
peut prendre en compte le ph&#233;nom&#232;ne de la variation lexicale dans la traduction (Apidianaki,
2009). Cet int&#233;r&#234;t vers l&#8217;utilisation de clusters de sens acquis &#224; partir de corpus est actuellement
manifest&#233; dans le domaine de l&#8217;&#233;valuation de la WSD. Contrairement aux t&#226;ches de WSD mul-
tilingue des campagnes Senseval et Semeval07 &#8211; qui consid&#233;raient chaque EQV comme indice
d&#8217;un sens distinct &#8211; dans la t&#226;che correspondante propos&#233;e pour Semeval-2010 les sens seront
d&#233;crits par des clusters d&#8217;EQVs s&#233;mantiquement proches, manuellement construits &#224; partir d&#8217;un
corpus parall&#232;le8.
</p>
<p>R&#233;f&#233;rences
APIDIANAKI M. (2008). Translation-oriented Word Sense Induction based on Parallel Cor-
pora. In Proceedings of the 6th International Conference on Language Resources and Evalu-
ation (LREC), p. 3269&#8211;3275, Marrakech, Morocco.
APIDIANAKI M. (2009). Data-driven semantic analysis for multilingual WSD and lexical
selection in translation. In Proceedings of the 12th Conference of the European Chapter of the
ACL (EACL), p. 77&#8211;85, Athens, Greece.
BROWN P. F., COCKE J., PIETRA S. D., PIETRA V. J. D., JELINEK F., MERCER R. L. &amp;
ROOSSIN P. S. (1988). A statistical approach to language translation. In Proceedings of the
12th International Conference on Computational Linguistics (COLING), p. 71&#8211;76, Budapest,
Hungary.
BROWN P. F., PIETRA S. A. D., PIETRA V. J. D. &amp; MERCER R. L. (1991). Word-sense
disambiguation using statistical methods. In Proceedings of the 29th Annual Meeting of the
ACL, p. 264&#8211;270, Berkeley, California.
CABEZAS C. &amp; RESNIK P. (2005). Using WSD Techniques for Lexical Selection in Statistical
Machine Translation. Rapport interne LAMP-TR-124,CS-TR-4736,UMIACS-TR-2005-42,
University of Maryland, College Park.
CALLISON-BURCH C., OSBORNE M. &amp; KOEHN P. (2006). Re-evaluating the role of BLEU
in machine translation research. In Proceedings of the 11th Conference of the European Chap-
ter of the ACL (EACL), p. 249&#8211;256, Trento, Italy.
</p>
<p>8http://webs.hogent.be/~elef464/lt3_SemEval.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marianna Apidianaki
</p>
<p>CARPUAT M. &amp; WU D. (2005). Word sense disambiguation vs. statistical machine translation.
In Proceedings of the 43rd Annual Meeting of the ACL, p. 387&#8211;394, Ann Arbor, Michigan.
CARPUAT M. &amp; WU D. (2007). How phrase sense disambiguation outperforms word sense
disambiguation for statistical machine translation. In Proceedings of the 11th International
TMI Conference, p. 43&#8211;52, Skovde, Sweden.
CARPUAT M., YU Y. X. &amp; WU D. (2006). Towards Integrating Word Sense and Entity Dis-
ambiguation into Statistical Machine Translation. In Proceedings of the International Work-
shop on Spoken Language Translation, p. 37&#8211;44, Kyoto, Japan.
CHAN Y. S., NG H. T. &amp; CHIANG D. (2007). Word Sense Disambiguation Improves Statisti-
cal Machine Translation. In Proceedings of the 45th Annual Meeting of the ACL, p. 263&#8211;270,
Prague, Czech Republic.
CHIANG D. (2005). A hierarchical phrase-based model for statistical machine translation. In
Proceedings of the 43rd Annual Meeting of the ACL, p. 263&#8211;270, Ann Arbor, Michigan.
CHKLOVSKI T., MIHALCEA R., PEDERSEN T. &amp; PURANDARE A. (2004). The SENSEVAL-
3 multilingual English-Hindi lexical sample task. In Proceedings of the 3rd International
Workshop on Evaluating Word Sense Disambiguation Systems, p. 5&#8211;8, Barcelona, Spain.
JIN P., WU Y. &amp; YU S. (2007). SemEval-2007 Task 05 : Multilingual Chinese-English
Lexical Sample. In Proceedings of the 4th International Workshop on Semantic Evaluations,
p. 19&#8211;23, Prague, Czech Republic.
KOEHN P. (2004). Pharaoh : A Beam Search Decoder for Phrase-Based Statistical Machine
Translation Models. In Proceedings of the 6th Conference of the Association for Machine
Translation in the Americas (AMTA), p. 115&#8211;124, Washington, DC.
KOEHN P., OCH F. J. &amp; MARCU D. (2003). Statistical Phrase-Based Translation. In Proceed-
ings of the Human Language Technology and North American ACL Conference (HLT/NAACL),
p. 48&#8211;54, Edmonton, Canada.
LAVIE A. &amp; AGARWAL A. (2007). METEOR : An Automatic Metric for MT Evaluation with
High Levels of Correlation with Human Judgments. In Proceedings of the 2nd Workshop on
Statistical Machine Translation, p. 228&#8211;231, Prague, Czech Republic.
OCH F. J. &amp; NEY H. (2004). The Alignment Template Approach to Statistical Machine
Translation. Computational Linguistics, 30(4), 417&#8211;449.
PAPINENI K., ROUKOS S., WARD T. &amp; JING ZHU W. (2002). BLEU : A method for au-
tomatic evaluation of machine translation. In Proceedings of the 40th Annual Meeting of the
ACL, p. 311&#8211;318, Philadelphia, PA, USA.
RESNIK P. (2007). WSD in NLP applications, In E. AGIRRE &amp; P. EDMONDS, Eds., Word
Sense Disambiguation : Algorithms and Applications, p. 299&#8211;337. Springer.
RESNIK P. &amp; YAROWSKY D. (1997). A perspective on word sense disambiguation meth-
ods and their evaluation. In Proceedings of SIGLEX Workshop &quot;Tagging Text with Lexical
Semantics : What, why and how ?&quot;, p. 79&#8211;86, Washington, D.C.
RESNIK P. &amp; YAROWSKY D. (2000). Distinguishing systems and distinguishing senses :
New evaluation methods for word sense disambiguation. Natural Language Engineering,
5(3), 113&#8211;133.
STROPPA N., VAN DEN BOSCH A. &amp; WAY A. (2007). Exploiting Source Similarity for SMT
using Context-Informed Features. In Proceedings of the 11th International TMI Conference,
p. 231&#8211;240, Skovde, Sweden.</p>

</div></div>
</body></html>