<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Motifs s&#233;quentiels pour l&#8217;extraction d&#8217;information : illustration sur le probl&#232;me de la d&#233;tection d&#8217;interactions entre g&#232;nes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Motifs s&#233;quentiels pour l&#8217;extraction d&#8217;information :
illustration sur le probl&#232;me de la d&#233;tection d&#8217;interactions
</p>
<p>entre g&#232;nes
</p>
<p>Marc Plantevit Thierry Charnois
GREYC &#8211; CNRS UMR 6072
</p>
<p>Universit&#233; de Caen &#8211; Bd Mal. Juin
14032 CAEN Cedex
</p>
<p>pr&#233;nom.nom@info.unicaen.fr
</p>
<p>R&#233;sum&#233;. Face &#224; la prolif&#233;ration des publications en biologie et m&#233;decine (plus de 18 mil-
lions de publications actuellement recens&#233;es dans PubMed), l&#8217;extraction d&#8217;information auto-
matique est devenue un enjeu crucial. Il existe de nombreux travaux dans le domaine du trai-
tement de la langue appliqu&#233;e &#224; la biom&#233;decine (&quot;BioNLP&quot;). Ces travaux se distribuent en
deux grandes tendances. La premi&#232;re est fond&#233;e sur les m&#233;thodes d&#8217;apprentissage automatique
de type num&#233;rique qui donnent de bons r&#233;sultats mais ont un fonctionnement de type &quot;boite
noire&quot;. La deuxi&#232;me tendance est celle du TALN &#224; base d&#8217;analyses (lexicales, syntaxiques,
voire s&#233;mantiques ou discursives) co&#251;teuses en temps de d&#233;veloppement des ressources n&#233;ces-
saires (lexiques, grammaires, etc.). Nous proposons dans cet article une approche bas&#233;e sur la
d&#233;couverte de motifs s&#233;quentiels pour apprendre automatiquement les ressources linguistiques,
en l&#8217;occurrence les patrons linguistiques qui permettent l&#8217;extraction de l&#8217;information dans les
textes. Plusieurs aspects m&#233;ritent d&#8217;&#234;tre soulign&#233;s : cette approche permet de s&#8217;affranchir de
l&#8217;analyse syntaxique de la phrase, elle ne n&#233;cessite pas de ressources en dehors du corpus d&#8217;ap-
prentissage et elle ne demande que tr&#232;s peu d&#8217;intervention manuelle. Nous illustrons l&#8217;approche
sur le probl&#232;me de la d&#233;tection d&#8217;interactions entre g&#232;nes et donnons les r&#233;sultats obtenus sur
des corpus biologiques qui montrent l&#8217;int&#233;r&#234;t de ce type d&#8217;approche.
</p>
<p>Abstract. The proliferation of publications in biology and medicine (more than 18 million
publications currently listed in PubMed) has lead to the crucial need of automatic information
extraction. There are many work in the field of natural language processing applied to bio-
medicine (BioNLP). Two types of approaches tackle this problem. On the one hand, machine
learning based approaches give good results but run as a &quot;black box&quot;. On the second hand, NLP
based approaches are highly time consuming for developing the resources (lexicons, grammars,
etc.). In this paper, we propose an approach based on sequential pattern mining to automatically
discover linguistic patterns that allow the information extraction in texts. This approach allows
to overcome sentence parsing and it does not require resources outside the training data set.
We illustrate the approach on the problem of detecting interactions between genes and give the
results obtained on biological corpora that show the relevance of this type of approach.
</p>
<p>Mots-cl&#233;s : Extraction d&#8217;information, fouille de textes, motifs s&#233;quentiels, interactions
entre g&#232;nes.
</p>
<p>Keywords: Information extraction, text mining, sequential patterns, gene interactions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M. Plantevit et T. Charnois
</p>
<p>1 Introduction
</p>
<p>Le volume des publications dans le domaine de la biologie et de la m&#233;decine s&#8217;accroit &#224; un
rythme consid&#233;rable : plus de 16 millions de publications recens&#233;es dans la base MedLine et
disponibles via PubMed1 en 2005 et une augmentation quotidienne de 1800 r&#233;f&#233;rences (chiffres
de 2005 tir&#233;s du site de l&#8217;INSERM). Dans cette masse de donn&#233;es textuelles, la recherche ma-
nuelle d&#8217;information est impossible. Deux types de requ&#234;tes int&#233;ressent le biologiste : &quot;dans
quels articles parle-t-on du g&#232;ne X ?&quot;, &quot;Avec quel(s) g&#232;ne(s), le g&#232;ne X interagit-il ?, et sous
quelle forme ?&quot;.
</p>
<p>Depuis une bonne quinzaine d&#8217;ann&#233;es de nombreux travaux en extraction d&#8217;information et en
fouille de textes appliqu&#233;es au domaine biom&#233;dical ont vu le jour. Deux t&#226;ches sont particuli&#232;-
rement explor&#233;es correspondant aux deux requ&#234;tes mentionn&#233;es pr&#233;c&#233;demment : la premi&#232;re est
la reconnaissance d&#8217;entit&#233;s nomm&#233;es de type biologique (noms de g&#232;nes, prot&#233;ines, fonctions
biologiques, etc.) et la deuxi&#232;me concerne l&#8217;identification et le typage de relations entre entit&#233;s
biologiques pr&#233;c&#233;demment reconnues. Dans cet article, nous nous int&#233;ressons &#224; la deuxi&#232;me
t&#226;che et plus particuli&#232;rement &#224; celle consistant &#224; d&#233;tecter les interactions entre g&#232;nes et &#224; leur
typage (inhibition, simulation,etc.) et &#224; terme &#224; ce que nous appelons &#171; modalit&#233; &#187; et qui peut
intervenir dans la relation (n&#233;gation, interaction possible, d&#233;montr&#233;e, etc.).
Deux types d&#8217;approches sont g&#233;n&#233;ralement consid&#233;r&#233;s (Zweigenbaum et al., 2007). Le premier
est fond&#233; sur des m&#233;thodes statistiques ou d&#8217;apprentissage : les approches &#224; base de calcul de co-
occurrences sont simples &#224; mettre en oeuvre et peuvent donner un bon rappel, mais les r&#233;sultats
sont faibles en pr&#233;cision (deux entit&#233;s peuvent appara&#238;tre dans une &#233;num&#233;ration sans interagir),
et ne donnent aucune caract&#233;risation de l&#8217;interaction. Les autres approches en apprentissage se
ram&#232;nent &#224; des probl&#232;mes de classification comme sp&#233;cifi&#233; dans le challenge BioCreative II
(Krallinger et al., 2008) : par exemple, d&#233;cider &#224; partir du r&#233;sum&#233; si l&#8217;article est susceptible
de contenir une interaction. Pour ce type de t&#226;che, les meilleurs r&#233;sultats sont obtenus par des
machines &#224; vecteurs de support (SVM), ou encore les &#171; conditional random fields &#187; (CRFs)
qui utilisent des descripteurs statistiques. Ces approches ont un fonctionnement de type &#171; boite
noire &#187; (les r&#232;gles ne sont ni interpr&#233;tables ni modifiables par un expert), la mise en place des
descripteurs est lourde &#224; mettre en &#339;uvre, et ne donnent pas le type de l&#8217;interaction.
</p>
<p>A l&#8217;oppos&#233;, les approches de type TAL s&#8217;appuient sur des connaissances linguistiques : r&#232;gles
d&#8217;extraction, analyse syntaxique voire s&#233;mantique de la phrase, pour d&#233;couvrir les interactions
(Zweigenbaum et al., 2007). Une r&#232;gle d&#8217;extraction, ou patron linguistique, peut s&#8217;exprimer
sous forme d&#8217;expression r&#233;guli&#232;re &#224; base de mots ou d&#8217;&#233;tiquettes grammaticales et d&#8217;un verbe,
ou d&#8217;une nominalisation d&#8217;un verbe, exprimant une interaction (interact, bind, encode). G&#233;-
n&#233;ralement, l&#8217;application des patrons s&#8217;op&#232;re apr&#232;s l&#8217;analyse de la phrase pour am&#233;liorer les
r&#233;sultats. En d&#233;pit des progr&#232;s r&#233;cents effectu&#233;s dans le domaine de l&#8217;analyse syntaxique, l&#8217;ex-
traction reste fortement d&#233;pendante des r&#233;sultats de la syntaxe. Par ailleurs, ce type de m&#233;thodes
a un co&#251;t important en termes d&#8217;&#233;criture et de d&#233;veloppement des patrons. Pour contourner ce
probl&#232;me, certaines approches visent &#224; apprendre automatiquement les r&#232;gles d&#8217;extraction, mais
l&#8217;apprentissage est r&#233;alis&#233; sur l&#8217;analyse syntaxique des phrases comme dans (Vetah et al., 2004;
Kim et al., 2007).
Nous proposons dans cet article une approche pour apprendre les patrons linguistiques par une
m&#233;thode de fouille de donn&#233;es bas&#233;e sur les motifs s&#233;quentiels. A notre connaissance, les mo-
</p>
<p>1http://www.ncbi.nlm.nih.gov/pubmed/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Motifs s&#233;quentiels pour l&#8217;extraction d&#8217;information et la d&#233;tection d&#8217;interactions entre g&#232;nes
</p>
<p>tifs s&#233;quentiels n&#8217;ont pas encore &#233;t&#233; utilis&#233;s pour r&#233;aliser de l&#8217;extraction d&#8217;information dans des
textes biom&#233;dicaux. L&#8217;originalit&#233; principale de l&#8217;approche consiste &#224; s&#8217;&#233;manciper de l&#8217;analyse
syntaxique pour l&#8217;apprentissage des patrons et pour leur application. Elle ne n&#233;cessite pas de
ressources linguistiques autres que le corpus d&#8217;apprentissage. Celui-ci consiste en un ensemble
de phrases qui contiennent des interactions et dont les entit&#233;s nomm&#233;es de type g&#232;ne sont anno-
t&#233;es en tant que tel. Seul un pr&#233;-traitement est r&#233;alis&#233; sur le corpus : tous les mots sont remplac&#233;s
par leur lemme auquel est ajout&#233; la cat&#233;gorie morpho-syntaxique2 du mot. De la m&#234;me mani&#232;re,
l&#8217;application des patrons pour extraire les interactions entre g&#232;nes s&#8217;effectue de fa&#231;on directe et
sans utiliser d&#8217;analyse syntaxique.
</p>
<p>Nous d&#233;crivons la m&#233;thode dans la section 2 en d&#233;taillant les diff&#233;rentes phases : extraction des
motifs s&#233;quentiels fr&#233;quents, ajout de contraintes et s&#233;lection. Puis nous pr&#233;sentons l&#8217;exp&#233;ri-
mentation men&#233;e et en discutons les r&#233;sultats (section 3) qui montrent l&#8217;int&#233;r&#234;t de l&#8217;approche.
</p>
<p>2 M&#233;thode
</p>
<p>2.1 Aper&#231;u de la m&#233;thode
</p>
<p>La figure 1 d&#233;crit le fonctionnement g&#233;n&#233;ral de notre m&#233;thode. Tout d&#8217;abord, une base de s&#233;-
quences textuelles est cr&#233;&#233;e &#224; partir d&#8217;un ensemble de phrases contenant des interactions entre
g&#232;nes sur lesquelles une analyse morpho-syntaxique a &#233;t&#233; effectu&#233;e (&#233;tape 1). Dans l&#8217;&#233;tape 2,
les motifs s&#233;quentiels fr&#233;quents sont extraits &#224; partir de la base de s&#233;quences textuelles. L&#8217;en-
semble des motifs s&#233;quentiels fr&#233;quents peut &#234;tre relativement important, rendant impossible
toute utilisation future des motifs d&#233;couverts. L&#8217;&#233;tape 3 vise &#224; contraindre ces motifs afin de
s&#233;lectionner un sous ensemble de motifs s&#233;quentiels qui respectent un ensemble de contraintes.
Les motifs satisfaisant les contraintes sont alors divis&#233;s en plusieurs sous ensembles par rapport
aux verbes et aux noms qu&#8217;ils contiennent. Par exemple, un ensemble contiendra tous les mo-
tifs s&#233;quentiels contenant l&#8217;&#233;l&#233;ment interact@vvz. Etant donn&#233; un entier k fix&#233; a priori, chaque
sous-ensemble est alors fouill&#233; r&#233;cursivement afin de disposer d&#8217;au plus k repr&#233;sentants par
sous-ensemble. L&#8217;&#233;tape 4 est d&#233;di&#233;e &#224; cette t&#226;che. Le nombre de motifs s&#233;quentiels restants peut
&#234;tre alors facilement examin&#233; par un expert humain. L&#8217;&#233;tape 5 repr&#233;sente la validation des motifs
par un expert. Les motifs s&#233;quentiels valid&#233;s forment alors l&#8217;ensemble des patrons linguistiques
qui sont ensuite utilis&#233;s pour d&#233;tecter des interactions entre g&#232;nes dans des textes biom&#233;dicaux
(&#233;tape 6).
Nous d&#233;crivons plus pr&#233;cis&#233;ment l&#8217;ensemble de ces &#233;tapes dans la suite de cet article.
</p>
<p>2.2 Extraction de motifs s&#233;quentiels fr&#233;quents
</p>
<p>Introduite par (Srikant &amp; Agrawal, 1996), l&#8217;extraction de motifs s&#233;quentiels fr&#233;quents permet de
d&#233;couvrir des corr&#233;lations entre des &#233;v&#233;nements au cours d&#8217;une relation d&#8217;ordre (e.g., le temps).
Ce probl&#232;me est devenu au fil des ann&#233;es un domaine actif de la fouille de donn&#233;es avec de
nombreux algorithmes &#224; la cl&#233; (Pei et al., 2001; Zaki, 2001).
</p>
<p>2Dans cet article, nous appelons morpho-syntaxique, l&#8217;analyse au niveau du mot fournissant sa cat&#233;gorie gram-
maticale, parfois associ&#233;e &#224; une information morphologique comme le mode passif pour un verbe.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M. Plantevit et T. Charnois
</p>
<p>Ensemble de 
phrases 
</p>
<p>contenant des 
interactions
</p>
<p>Base de s&#233;quences de donn&#233;es
</p>
<p>&lt; AGENE@np ... interact@vvz ... &gt;
</p>
<p>Analyse morpho-syntaxique
</p>
<p>Motifs 
s&#233;quentiels 
fr&#233;quents
</p>
<p>Extraction
</p>
<p>Motifs 
contraints
</p>
<p>Application de 
contraintes
</p>
<p>Division en sous-ensembles
</p>
<p>Fouille 
r&#233;cursive
</p>
<p>Patrons 
linguistiques
</p>
<p>Validation par 
expert
</p>
<p>D&#233;couverte et s&#233;lection des patrons linguistiques Application des patrons linguistiques
</p>
<p>et d&#233;tection d'interactions
</p>
<p>Textes 
biom&#233;dicaux
</p>
<p>D&#233;tection 
d'int&#233;ractions
</p>
<p> &lt;GENE_LMW_FGF_2&gt; regulate@vvn &lt;GENE_PKC_epsilon&gt;
&lt;GENE_F_beta_alpha_/_CG_beta&gt; bind@vvg &lt;GENE_CG&gt; 
&lt;GENE_pkcbeta&gt; play@vvz a@dt role@nn in@in &lt;GENE_insulin&gt; 
</p>
<p>6
</p>
<p>5
</p>
<p>4
</p>
<p>3
</p>
<p>2
</p>
<p>1
</p>
<p>FIG. 1 &#8211; Sch&#233;ma g&#233;n&#233;ral de l&#8217;approche
</p>
<p>Etant donn&#233; un ensemble I de litt&#233;raux distincts appel&#233;s items, une s&#233;quence s = &#12296;i1, i2, . . . , in&#12297;
est une liste ordonn&#233;e non vide d&#8217;items. Une s&#233;quence Sa = &#12296;a1, a2, . . . , an&#12297; est incluse dans
une autre s&#233;quence Sb = &#12296;b1, b2, . . . , bm&#12297; s&#8217;il existe des entiers 1 &#8804; i1 &lt; i2 &lt; . . . &lt; in &#8804; m
tels que a1 = bi1 , a2 = bi2 , . . . , an = bin . Si la s&#233;quence Sa est incluse dans Sb, alors Sa
est une sous-s&#233;quence de Sb et Sb est une super-s&#233;quence de Sa, not&#233; Sa &#22; Sb. Une base de
s&#233;quences SDB est un ensemble de paires (sid, S) o&#249; sid est un identifiant de s&#233;quence et S
est une s&#233;quence. Une paire (sid, S) contient une s&#233;quence S&#945; si S&#945; est une sous-s&#233;quence de S
(S&#945; &#22; S). Le support absolu d&#8217;une s&#233;quence S&#945; dans une base de s&#233;quences SDB correspond
au nombre de paires (sid, S) qui contiennent S&#945;. Le support relatif repr&#233;sente le pourcentage
de paires qui supportent S&#945; ( |(sid,S) t.q. S&#945;&#22;S||SDB| ).
Etant donn&#233;s une base de s&#233;quences SDB et un seuil de support minimum supmin, le probl&#232;me
de l&#8217;extraction de motifs s&#233;quentiels fr&#233;quents est de retourner l&#8217;ensemble complet FS des s&#233;-
quences S&#945; contenues dans SDB qui ont un support sup&#233;rieur ou &#233;gal &#224; supmin (support(S&#945;) &#8805;
supmin).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Motifs s&#233;quentiels pour l&#8217;extraction d&#8217;information et la d&#233;tection d&#8217;interactions entre g&#232;nes
</p>
<p>2.3 Extraction de motifs s&#233;quentiels dans des donn&#233;es textuelles
</p>
<p>Nous montrons ici comment nous appliquons la d&#233;couverte de motifs s&#233;quentiels &#224; des don-
n&#233;es textuelles. En particulier, nous d&#233;crivons le choix de la base de s&#233;quences SDB dans un
contexte de donn&#233;es textuelles.
</p>
<p>Nous disposons d&#8217;un ensemble de phrases reconnues comme contenant des interactions entre
g&#232;nes. Les g&#232;nes sont d&#233;j&#224; &#233;tiquet&#233;s comme tels dans ces phrases. Dans cet article, nous consi-
d&#233;rons les phrases contenant des interactions et au moins deux noms de g&#232;nes afin d&#8217;&#233;viter
le probl&#232;me introduit par les structures anaphoriques qui reste un probl&#232;me non r&#233;solu (Zwei-
genbaum et al., 2007). Ces phrases sont issues d&#8217;articles accessibles sur PubMed. Notre ob-
jectif &#233;tant d&#8217;apprendre des motifs repr&#233;sentant des interactions entre g&#232;nes, nous consid&#233;rons
la phrase comme s&#233;quence de donn&#233;es. Les items sont les lemmes auxquels sont associ&#233;s leur
&#233;tiquette morpho-syntaxique et la relation d&#8217;ordre est l&#8217;ordre des mots dans la phrase.
</p>
<p>Par exemple, une phrase contenant une interaction est : &#171; Here we show that &lt;Gene SOX10&gt;,
in synergy with &lt;GenePAX3&gt;, strongly activates &lt;Gene MITF &gt; expression in transfection
assays. &#187;
</p>
<p>Nous rempla&#231;ons les noms de g&#232;nes par un item particulier not&#233; AGENE. Ensuite, nous proc&#233;-
dons &#224; un &#233;tiquetage morpho-syntaxique des phrases. Les s&#233;quences de SDB seront alors les
phrases &#233;tiquet&#233;es par un analyseur morpho-syntaxique.
</p>
<p>Ainsi, la phrase pr&#233;c&#233;dente devient une s&#233;quence de SDB :
</p>
<p>&#12296; here@rb we@pp show@vvp that@in/that AGENE@np ,@, in@in synergy@nn with@in A-
GENE@np ,@, strongly@rb activate@vvz AGENE@np expression@nn in@in transfection@nn
assay@nns .@sent &#12297;
</p>
<p>En fouille de motifs fr&#233;quents, le choix du seuil de support minimum est un probl&#232;me r&#233;cur-
rent. Si le seuil de support est trop &#233;lev&#233;, le risque est d&#8217;extraire uniquement des g&#233;n&#233;ralit&#233;s
qui n&#8217;apporteront rien &#224; l&#8217;utilisateur. Si le seuil de support est trop faible, l&#8217;ensemble des mo-
tifs fr&#233;quents extraits peut &#234;tre extr&#234;mement volumineux rendant impossible toute utilisation.
Dans cet article, nous faisons le choix de consid&#233;rer un seuil de support faible et de r&#233;duire
l&#8217;ensemble des motifs s&#233;quentiels fr&#233;quents en post-traitement en introduisant des contraintes
suppl&#233;mentaires diff&#233;rentes de la contrainte de fr&#233;quence utilis&#233;e (supmin).
</p>
<p>2.4 Ajout de contraintes
En fouille de motifs, les contraintes permettent &#224; l&#8217;utilisateur de d&#233;finir plus pr&#233;cis&#233;ment ce qu&#8217;il
consid&#232;re comme int&#233;ressant. Ainsi, la contrainte la plus utilis&#233;e est la contrainte de fr&#233;quence
(supmin) qui permet de consid&#233;rer les motifs qui respectent cette contrainte. Il est possible
d&#8217;utiliser diff&#233;rentes contraintes en plus de la fr&#233;quence (Ng et al., 1998). Notons que dans cet
article, nous appliquons les contraintes autres que la fr&#233;quence en post-traitement de l&#8217;ensemble
des motifs fr&#233;quents.
</p>
<p>Etant donn&#233; que nous souhaitons extraire des motifs s&#233;quentiels qui mod&#233;lisent des interactions
entre g&#232;nes, nous pouvons utiliser les contraintes suivantes :
&#8211; C2g impose qu&#8217;un motif s&#233;quentiel doit contenir au moins deux fois l&#8217;item AGENE. Ainsi
</p>
<p>l&#8217;ensemble SAT (C2g) qui repr&#233;sente l&#8217;ensemble des motifs qui satisfont la C2g est &#233;gal &#224; :
SAT (C2g) = {s = &#12296;i1, . . . , in&#12297; t.q. |{j t.q. ij = AGENE}| &#8805; 2}.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M. Plantevit et T. Charnois
</p>
<p>&#8211; Cvn impose qu&#8217;un motif s&#233;quentiel doit contenir au moins un nom ou un verbe. L&#8217;ensemble
SAT (Cvn) des motifs s&#233;quentiels qui satisfont Cvn est :
SAT (Cvn) = {s = &#12296;i1, . . . , in&#12297; t.q. &#8707;ij , verbe(ij) = vrai &#8744; nom(ij) = vrai}.
</p>
<p>&#8211; Afin de r&#233;duire la redondance des motifs s&#233;quentiels, nous pouvons consid&#233;rer les s&#233;quences
fr&#233;quentes maximales (par rapport &#224; l&#8217;inclusion&#22;). Un motif s&#233;quentiel fr&#233;quent s1 est maxi-
mal s&#8217;il n&#8217;existe pas de motif s&#233;quentiel fr&#233;quent s2 tel que s1 &#22; s2. Nous notons Cmax
cette contrainte. L&#8217;ensemble SAT (Cmax) des motifs s&#233;quentiels fr&#233;quents qui v&#233;rifient cette
contrainte est : SAT (Cmax) = {s t.q. support(s) &#8805; supmin &#8743; &#8708;s&#8242; t.q. support(s&#8242;) &#8805;
supmin, s &#22; s&#8242;}.
</p>
<p>Les contraintes pr&#233;c&#233;dentes peuvent &#234;tre regroup&#233;es en une unique contrainte CG qui est la
conjonction de ces trois contraintes. L&#8217;ensemble SAT (CG) des motifs s&#233;quentiels fr&#233;quents qui
v&#233;rifient la contrainte CG est &#233;gal &#224; SAT (C2g)
</p>
<p>&#8898;
SAT (Cvn)
</p>
<p>&#8898;
SAT (Cmax).
</p>
<p>M&#234;me si l&#8217;ensemble SAT (CG) est sensiblement plus petit que l&#8217;ensemble complet des motifs
s&#233;quentiels fr&#233;quents, il est possible que cet ensemble soit encore trop important pour &#234;tre ana-
lys&#233; et valid&#233; par un utilisateur humain.
</p>
<p>2.5 Extraction r&#233;cursive de motifs s&#233;quentiels
</p>
<p>Nous divisons l&#8217;ensemble SAT (CG) en plusieurs sous-ensembles EXi o&#249; le sous-ensemble
EXi regroupe tous les motifs s&#233;quentiels de SAT (CG) contenant l&#8217;item Xi. Plus formellement,
EXi = {s &#8712; SAT (CG) t.q. &#12296;Xi&#12297; &#22; s}. Notons que nous r&#233;duisons les Xi aux &#233;l&#233;ments &#233;tiquet&#233;s
comme &#233;tant un verbe ou un nom.
</p>
<p>Nous souhaitons alors d&#233;terminer au plus k (k &#8805; 1) repr&#233;sentants pour chaque ensemble EXi .
Les principes de la fouille r&#233;cursive introduite par (Soulet, 2007), qui visent &#224; exhiber des re-
pr&#233;sentants parmi des motifs ensemblistes &#233;mergents, s&#8217;appliquent dans notre contexte. Chaque
sous-ensemble EXi est ainsi fouill&#233; r&#233;cursivement avec un seuil de support minimum minsup
&#233;gal &#224; 1
</p>
<p>k
afin d&#8217;extraire les motifs s&#233;quentiels fr&#233;quents v&#233;rifiant la contrainte globale CG in-
</p>
<p>troduite pr&#233;c&#233;demment. La r&#233;cursivit&#233; s&#8217;arr&#234;te d&#232;s que le nombre de motifs s&#233;quentiels extraits
v&#233;rifiant CG est inf&#233;rieur ou &#233;gal &#224; k3. En d&#8217;autres termes, dans la fouille r&#233;cursive les motifs
s&#233;quentiels extraits sur une base de s&#233;quences deviennent &#224; leur tour la base de s&#233;quences qui
va &#234;tre fouill&#233;e. Ce processus se termine quand le nombre de motifs extraits sur une base de
s&#233;quences (motifs) est inf&#233;rieur ou &#233;gal &#224; k.
Pour chaque sous-ensemble EXi , les k motifs s&#233;quentiels extraits r&#233;cursivement sont des motifs
s&#233;quentiels qui sont fr&#233;quents sur la base de s&#233;quence SDB. Autrement dit, ils appartiennent &#224;
l&#8217;ensemble complet des motifs s&#233;quentiels fr&#233;quents dans SDB par rapport &#224; supmin.
</p>
<p>A la fin de cette &#233;tape, le nombre de motifs s&#233;quentiels repr&#233;sentant des interactions entre g&#232;nes
est ma&#238;tris&#233;. Il est inf&#233;rieur ou &#233;gal &#224; n &#215; k o&#249; n est le nombre de sous-ensembles EXi de
SAT (CG). Notons que le param&#232;tre k est fix&#233; a priori par l&#8217;utilisateur. Ainsi, l&#8217;ensemble des
motifs s&#233;quentiels repr&#233;sentant des interactions entre g&#232;nes peut &#234;tre analys&#233; par un utilisa-
teur humain car sa taille le permet. Les motifs s&#233;quentiels sont alors valid&#233;s par l&#8217;utilisateur
et forment des patrons linguistiques permettant la d&#233;tection d&#8217;interaction entre g&#232;nes. De plus,
il est int&#233;ressant de noter que la sous-cat&#233;gorisation du verbe donn&#233;e par l&#8217;&#233;tiquetage morpho-
syntaxique indique la forme passive ou active du verbe et permet de rep&#233;rer le sens de l&#8217;interac-
tion. Les pr&#233;positions permettent aussi de rep&#233;rer cette information lorsque le patron ne contient
</p>
<p>3La contrainte Cmax permet d&#8217;assurer la terminaison de la r&#233;cursivit&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Motifs s&#233;quentiels pour l&#8217;extraction d&#8217;information et la d&#233;tection d&#8217;interactions entre g&#232;nes
</p>
<p>pas de verbe.
</p>
<p>3 Exp&#233;rimentation et r&#233;sultats
</p>
<p>Nous avons effectu&#233; des exp&#233;rimentations de notre m&#233;thode. Dans cette section, nous pr&#233;sen-
tons d&#8217;abord l&#8217;acquisition et la validation des patrons linguistiques et ensuite leur application
sur des jeux de donn&#233;es r&#233;els.
</p>
<p>3.1 D&#233;couverte des patrons linguistiques
</p>
<p>Les g&#232;nes peuvent interagir entre eux par l&#8217;interm&#233;diaire des prot&#233;ines qu&#8217;ils synth&#233;tisent. De
plus, bien qu&#8217;il existe des conventions, les biologistes ne font g&#233;n&#233;ralement pas de diff&#233;rence
dans les textes entre le nom du g&#232;ne et le nom de la prot&#233;ine synth&#233;tis&#233;e par le g&#232;ne. Ils &#233;crivent
l&#8217;un pour l&#8217;autre, et savent en fonction du contexte si la phrase traite de la prot&#233;ine ou du g&#232;ne.
Ainsi, pour d&#233;couvrir les patrons linguistiques d&#8217;interaction entre les g&#232;nes, nous avons r&#233;uni
deux corpus diff&#233;rents contenant des noms de g&#232;nes et de prot&#233;ines.
</p>
<p>Le premier corpus contient des phrases issues de r&#233;sum&#233;s de PubMed, annot&#233;es par Christine
Brun de l&#8217;Institut de Biologie du Developpement de Marseille-Luminy. Il contient 1806 phrases
annot&#233;es. Ce corpus est disponible en tant que source secondaire d&#8217;apprentissage de la t&#226;che
&#171; Protein-protein Interaction task (Interaction Sentence Sub-task, ISS) &#187; du challenge BioCrea-
tive II (Krallinger et al., 2008).
Le second corpus contient des phrases d&#8217;interactions entre prot&#233;ines annot&#233;es par un expert. Ce
jeu de donn&#233;es qui contient 2995 phrases d&#8217;interaction est d&#233;crit dans (Rosario &amp; Hearst, 2005).
Nous avons fusionn&#233; les deux corpus et attribu&#233; une &#233;tiquette unique aux diff&#233;rents noms de
g&#232;nes et prot&#233;ines : AGENE. Une analyse morpho-syntaxique est ensuite effectu&#233;e &#224; l&#8217;aide de
l&#8217;analyseur TreeTagger (Schmid, 1994). Les phrases sont alors pr&#234;tes pour &#234;tre fouill&#233;es afin
d&#8217;extraire l&#8217;ensemble des motifs s&#233;quentiels fr&#233;quents. Nous fixons un seuil de support mini-
mum &#233;gal &#224; 10. En effet, un tel seuil permet de ne pas consid&#233;rer le bruit tout en permettant
la d&#233;couverte de nombreuses formes d&#8217;interactions. Le nombre de motifs s&#233;quentiels fr&#233;quents
extraits est relativement important. Plus de 32 millions de s&#233;quences sont d&#233;couvertes. Bien
que le nombre de motifs extraits soit tr&#232;s important, l&#8217;extraction de cet ensemble a n&#233;cessit&#233; 15
minutes. L&#8217;extracteur utilis&#233; est dmt4 d&#233;velopp&#233; par C. Rigotti (Nanni &amp; Rigotti, 2007).
L&#8217;application des contraintes C2g, Cvn et Cmax permet de r&#233;duire sensiblement le nombre de
motifs s&#233;quentiels consid&#233;r&#233;s. En effet, le nombre de motifs s&#233;quentiels satisfaisant les trois
contraintes est d&#8217;environ 65 000. Toutefois, ce nombre reste prohibitif pour une analyse et une
validation par un utilisateur humain. L&#8217;application de ces contraintes sur l&#8217;ensemble des motifs
s&#233;quentiels fr&#233;quents est l&#8217;&#233;tape la plus co&#251;teuse de notre m&#233;thode. La s&#233;lection des 65 000
motifs a pris 636 minutes.
</p>
<p>La division de l&#8217;ensemble des motifs s&#233;quentiels obtenus &#224; l&#8217;&#233;tape pr&#233;c&#233;dente en plusieurs
sous-ensembles et la fouille r&#233;cursive de ces sous ensembles permet de r&#233;duire encore de fa-
&#231;on sensible le nombre de motifs s&#233;quentiels candidats pour repr&#233;senter des interactions. La
fouille r&#233;cursive de chacun de ces sous-ensemble permet d&#8217;exhiber au plus k motifs s&#233;quentiels
pour repr&#233;senter ce sous-ensemble. Dans cette exp&#233;rience, nous fixons le param&#232;tre k &#224; 4. Le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M. Plantevit et T. Charnois
</p>
<p>nombre de sous-ensembles cr&#233;&#233;s est de 515 (365 pour les noms, 150 pour les verbes). A l&#8217;issu
de la fouille r&#233;cursive sur chaque sous-ensemble, il reste 667 motifs s&#233;quentiels susceptibles de
repr&#233;senter des interactions. Ce nombre sensiblement plus petit que les pr&#233;c&#233;dents garantit la
faisabilit&#233; d&#8217;une analyse par un utilisateur humain. La fouille r&#233;cursive de ces sous-ensembles
est tr&#232;s peu co&#251;teuse. Elle a dur&#233; environ 2 minutes.
</p>
<p>Les 667 motifs s&#233;quentiels restants ont &#233;t&#233; analys&#233;s par deux utilisateurs. Ils ont valid&#233; 232
motifs s&#233;quentiels en 90 minutes. Ce qui signifie que ces 232 motifs s&#233;quentiels mod&#233;lisent
bien des interactions entre g&#232;nes (les motifs refus&#233;s &#233;tant porteurs d&#8217;autres relations s&#233;man-
tiques comme la modalit&#233;, la simple occurrence, etc). Parmi ces motifs, certains repr&#233;sentent
explicitement des interactions comme les motifs AGENE@np bind@vvz to@to AGENE@np
.@sent, AGENE@np deplete@vvn AGENE@np .@sent et activation@nn of@in AGENE@np
by@in AGENE@np .@sent qui d&#233;crivent des interactions bien connues (liaison, inhibition, ac-
tivation). D&#8217;autres motifs mod&#233;lisent des interactions entre g&#232;nes de fa&#231;on plus g&#233;n&#233;rale, si-
gnifiant simplement qu&#8217;un g&#232;ne joue un r&#244;le dans l&#8217;activit&#233; d&#8217;un autre g&#232;ne comme les motifs
AGENE@np involve@vvn in@in AGENE@np .@sent, AGENE@np play@vvz role@nn in@in
the@dt AGENE@np .@sent et AGENE@np play@vvz role@nn in@in of@in AGENE@np
.@sent.
</p>
<p>Les motifs s&#233;quentiels obtenus forment des patrons linguistiques pr&#234;ts &#224; &#234;tre appliqu&#233;s dans
des textes biom&#233;dicaux pour d&#233;tecter des interactions entre g&#232;nes. Rappelons que pour &#234;tre
appliqu&#233;s, ces patrons ne s&#8217;appuient sur aucune analyse syntaxique de la phrase. Il suffit de
chercher &#224; instancier chaque &#233;l&#233;ment du patron dans la phrase.
</p>
<p>3.2 Application des patrons linguistiques pour la d&#233;tection d&#8217;interactions
</p>
<p>Pour tester la qualit&#233; de nos patrons linguistiques, nous consid&#233;rons trois jeux de donn&#233;es
connus dans la litt&#233;rature : GeneTag du jeu de donn&#233;es Genia (Tanabe et al., 2005), BioCreative
issu de (Yeh et al., 2005), et AIMed de (Bunescu &amp; Mooney, 2005). Dans ces jeux de donn&#233;es,
les noms de g&#232;nes ou de prot&#233;ines sont &#233;tiquet&#233;s. Dans chaque corpus, nous avons pris al&#233;atoire-
ment 200 phrases et test&#233; si les patrons linguistiques s&#8217;appliquaient. Pour chaque phrase conte-
nant une interaction, nous mesurons les performances des patrons linguistiques pour d&#233;tecter
ces interactions. Notons que nous avons &#233;galement proc&#233;d&#233; &#224; un &#233;tiquetage morpho-syntaxique
de ces phrases pour pouvoir appliquer correctement les patrons linguistiques, de plus l&#8217;applica-
tion des patrons linguistiques est quasi-instantan&#233;e.
</p>
<p>Corpus Pr&#233;cision Rappel F-Score
BioCreative (Yeh et al., 2005) 0, 92 0, 767 0, 836
GeneTag (Tanabe et al., 2005) 0, 909 0, 8 0, 851
</p>
<p>AIMed (Bunescu &amp; Mooney, 2005) 0, 93 0, 84 0, 88
</p>
<p>TAB. 1 &#8211; Tests men&#233;s sur diff&#233;rents corpus
</p>
<p>Le tableau 1 d&#233;crit la pr&#233;cision, le rappel et le f-score (2&#215;P&#215;R
P+R
</p>
<p>) de l&#8217;application de patrons
linguistiques sur chaque corpus. Les scores sont similaires sur les trois corpus. De plus, ces
r&#233;sultats sont encourageants dans la mesure o&#249; la pr&#233;cision est tr&#232;s bonne et le rappel satisfai-
sant. Ces r&#233;sultats sont tout &#224; fait comparables &#224; ceux des autres m&#233;thodes pr&#233;sentes dans la
litt&#233;rature en notant toutefois que les t&#226;ches ne sont jamais identiques (Krallinger et al., 2008).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Motifs s&#233;quentiels pour l&#8217;extraction d&#8217;information et la d&#233;tection d&#8217;interactions entre g&#232;nes
</p>
<p>3.3 Discussion
</p>
<p>Bien que les outils d&#8217;analyse morpho-syntaxique pr&#233;sentent des r&#233;sultats satisfaisants, il sub-
siste encore un nombre non n&#233;gligeable d&#8217;erreurs d&#8217;&#233;tiquetage concernant la lemmatisation ou
l&#8217;attribution d&#8217;une cat&#233;gorie grammaticale. Notre m&#233;thode est assez robuste face &#224; ce ph&#233;no-
m&#232;ne puisque ces erreurs sont &#233;galement pr&#233;sentes lors de la d&#233;couverte des motifs d&#8217;inter-
actions. Ainsi, si une erreur est suffisamment fr&#233;quentes, elle sera pr&#233;sente dans un motif ex-
trait. Par exemple, Tree Tagger ne lemmatise pas le mot cotransfected mais des motifs extraits
contiennent la forme cotransfected@vvn.
Notons que la port&#233;e des patrons linguistiques se limitent au cadre de la phrase. Une telle por-
t&#233;e peut introduire des ambigu&#239;t&#233;s dans la d&#233;tection d&#8217;interaction lorsque plus de deux g&#232;nes
apparaissent dans la phrases. Plusieurs cas sont possibles. Soit plusieurs interactions binaires
sont pr&#233;sentes dans la phrase, soit l&#8217;interaction est de type n-aire (n &#8805; 3) ou encore on peut
trouver une interaction en pr&#233;sence d&#8217;une simple &#233;num&#233;ration de g&#232;nes. Le cas des interactions
n-aires peut &#234;tre r&#233;solu avec un apprentissage sur un jeux de donn&#233;es contenant des interactions
n-aires. Les deux autres cas peuvent &#234;tre trait&#233;s en introduisant des r&#232;gles limitant la port&#233;e des
patrons, par exemple &#224; l&#8217;aide de connecteurs (but, however, etc.).
</p>
<p>4 Conclusion
</p>
<p>Dans cet article, l&#8217;utilisation de l&#8217;extraction de motifs s&#233;quentiels permet de d&#233;couvrir des pa-
trons linguistiques pour d&#233;tecter des relations entre entit&#233;s nomm&#233;es. Cette m&#233;thode est ap-
pliqu&#233;e &#224; la d&#233;couverte d&#8217;interactions entre g&#232;nes. La d&#233;couverte des patrons linguistiques est
enti&#232;rement automatique et ne n&#233;cessite qu&#8217;une validation peu co&#251;teuse en temps par un expert.
En effet, le nombre de patrons linguistiques est limit&#233; par l&#8217;introduction de contraintes et un
processus de fouille r&#233;cursive. L&#8217;acquisition de ces patrons et leur application ne n&#233;cessitent ni
analyse syntaxique ni ressource autre que le corpus d&#8217;apprentissage.
</p>
<p>Nous pensons am&#233;liorer ce travail selon deux axes. D&#8217;une part, l&#8217;introduction de contraintes lin-
guistiques lors de la phase de fouille permettra d&#8217;&#233;viter l&#8217;application co&#251;teuse de ces contraintes
en post-traitement. La prise en compte de hi&#233;rarchie sur les items devrait permettre d&#8217;introduire
de nouveaux types de contraintes et d&#8217;am&#233;liorer les motifs d&#233;couverts, notamment par g&#233;n&#233;ra-
lisation. D&#8217;autre part, nous envisageons la prise en compte des &#171; modalit&#233;s &#187; qui interviennent
souvent dans l&#8217;expression de l&#8217;interaction (n&#233;gation, r&#233;sultat d&#8217;exp&#233;rience, impossibilit&#233;, etc.)
et qui, de plus int&#233;ressent les biologistes. Parmi les motifs d&#233;couverts non valid&#233;s, bon nombre
sont porteurs de modalit&#233;s.
</p>
<p>A terme, ce travail vise &#224; &#234;tre int&#233;gr&#233; dans une application plus large destin&#233;e aux biologistes.
L&#8217;id&#233;e est de combiner plusieurs sources de connaissances (connaissances issues du transcrip-
tome (Leyritz et al., 2008) et des donn&#233;es textuelles issues de PubMed). En effet, croiser ces
diff&#233;rentes sources devrait permettre de mettre en relief de nouvelles connaissances et d&#8217;intro-
duire de nouvelles contraintes.
</p>
<p>Remerciements : Nous remercions Christophe Rigotti pour nous avoir permis d&#8217;utiliser l&#8217;ex-
tracteur dmt4. Ce travail est partiellement financ&#233; par l&#8217;ANR, projet Bingo24 (ANR-07-MDCO-
014).
</p>
<p>4http://bingo2.greyc.fr/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M. Plantevit et T. Charnois
</p>
<p>R&#233;f&#233;rences
BUNESCU R. C. &amp; MOONEY R. J. (2005). A shortest path dependency kernel for relation
extraction. In HLT/EMNLP : The Association for Computational Linguistics.
KIM J.-H., MITCHELL A., ATTWOOD T. K. &amp; HILARIO M. (2007). Learning to extract
relations for protein annotation. In ISMB/ECCB (Supplement of Bioinformatics), p. 256&#8211;263.
KRALLINGER M., LEITNER F., RODRIGUEZ-PENAGOS C. &amp; VALENCIA A. (2008). Over-
view of the protein-protein interaction annotation extraction task of BioCreative II. Genome
Biology, 9(Suppl 2).
LEYRITZ J., SCHICKLIN S., BLACHON S., KEIME C., ROBARDET C., BOULICAUT J.-F.,
BESSON J., PENSA R. &amp; GANDRILLON O. (2008). SQUAT : A web tool to mine human,
murine and avian SAGE data. BMC Bioinformatics, 9(1), 378.
NANNI M. &amp; RIGOTTI C. (2007). Extracting trees of quantitative serial episodes. In Know-
ledge Discovery in Inductive Databases 5th Int. Workshop KDID&#8217;06, Revised Selected and
Invited Papers, p. 170&#8211;188 : Springer-Verlag LNCS 4747.
NG R. T., LAKSHMANAN L. V. S., HAN J. &amp; PANG A. (1998). Exploratory mining and
pruning optimizations of constrained association rules. In L. M. HAAS &amp; A. TIWARY, Eds.,
SIGMOD Conference, p. 13&#8211;24 : ACM Press.
PEI J., HAN B., MORTAZAVI-ASL B. &amp; PINTO H. (2001). Prefixspan : Mining sequential
patterns efficiently by prefix-projected pattern growth. In Proc. of the 17th Int. Conf. on Data
Engineering (ICDE&#8217;01), p. 215&#8211;224.
ROSARIO B. &amp; HEARST M. A. (2005). Multi-way relation classification : application to
protein-protein interactions. In HLT &#8217;05 : Proceedings of the conference on Human Language
Technology and Empirical Methods in Natural Language Processing, p. 732&#8211;739, Morristown,
NJ, USA : Association for Computational Linguistics.
SCHMID H. (1994). Probabilistic part-of-speech tagging using decision trees. In Proceedings
of International Conference on New Methods in Language Processing.
SOULET A. (2007). R&#233;sumer les contrastes par l&#8217;extraction r&#233;cursive de motifs. In Actes de
CAP&#8217;07, Conf&#233;rence francophone sur l&#8217;apprentissage automatique - 2007, Grenoble, France.
SRIKANT R. &amp; AGRAWAL R. (1996). Mining sequential patterns : Generalizations and per-
formance improvements. In P. M. G. APERS, M. BOUZEGHOUB &amp; G. GARDARIN, Eds.,
EDBT, volume 1057 of Lecture Notes in Computer Science, p. 3&#8211;17 : Springer.
TANABE L., XIE N., THOM L., MATTEN W. &amp; WILBUR J. (2005). GENETAG : a tagged
corpus for gene/protein named entity recognition. BMC Bioinformatics, 6, 10.
VETAH M. O. A., AUBIN S., BESSI&#200;RES P., BISSON G., HAMON T., LAGARRIGUE S.,
NAZARENKO A., N&#201;DELLEC C., POIBEAU T. &amp; WEISSENBACHER D. (2004). Extraction
d&#8217;information appliqu&#233;e au domaine biom&#233;dical - apprentissage et taln. In Actes de la Conf&#233;-
rence International de Fouille de texte, CIFT-04. Marie H&#233;l&#232;ne Antoni et Fran&#231;ois Yvon (Eds.).
La Rochelle.
YEH A., MORGAN A., COLOSIMO M. &amp; HIRSCHMAN L. (2005). BioCreAtIvE Task 1A :
gene mention finding evaluation. BMC Bioinformatics, 6, 10.
ZAKI M. J. (2001). Spade : An efficient algorithm for mining frequent sequences. Machine
Learning, 42(1/2), 31&#8211;60.
ZWEIGENBAUM P., DEMNER-FUSHMAN D., YU H. &amp; COHEN K. B. (2007). Frontiers of
biomedical text mining : current progress. Brief Bioinform, p. 358&#8211;375.</p>

</div></div>
</body></html>