<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Jugements d'&#233;valuation et constituants p&#233;riph&#233;riques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>Jugements d'&#233;valuation et constituants p&#233;riph&#233;riques 
</p>
<p>Agata Jackiewicz (1), Thierry Charnois (2), St&#233;phane Ferrari (2) 
</p>
<p>(1) LALIC &#8211; Universit&#233; Paris-Sorbonne  
Agata.Jackiewicz@paris-sorbonne.fr 
</p>
<p>(2) GREYC &#8211; Universit&#233; de Caen Basse-Normandie  
{Thierry.Charnois|Stephane.Ferrari}@info.unicaen.fr 
</p>
<p>R&#233;sum&#233; L&#8217;article pr&#233;sente une &#233;tude portant sur des constituants d&#233;tach&#233;s &#224; valeur 
axiologique. Dans un premier temps, une analyse linguistique sur corpus met en &#233;vidence un 
ensemble de patrons caract&#233;ristiques du ph&#233;nom&#232;ne. Ensuite, une exp&#233;rimentation 
informatique est propos&#233;e sur un corpus de plus grande taille afin de permettre l&#8217;observation 
des patrons en vue d&#8217;un retour sur le mod&#232;le linguistique. Ce travail s&#8217;inscrit dans un projet 
men&#233; &#224; l&#8217;interface de la linguistique et du TAL, qui se donne pour but d&#8217;enrichir, d&#8217;adapter au 
fran&#231;ais et de formaliser le mod&#232;le g&#233;n&#233;ral Appraisal de l&#8217;&#233;valuation dans la langue. 
</p>
<p>Abstract In this paper, we present a study about peripheral constituent expressing some 
axiological value. First, a linguistic corpus analysis highlights some characteristic patterns for 
this phenomenon. Then, a computational experiment is carried out on a larger corpus in order 
to enable the observation of these patterns and to get a feedback on the linguistic model. This 
work takes part in a project at the intersection of Linguistics and NLP, which aims at 
enhancing, adapting to French language and formalizing the Appraisal generic model of the 
evaluation in language. 
</p>
<p>Mots-cl&#233;s :   jugement d&#8217;&#233;valuation, constituants extra-pr&#233;dicatifs, constructions et 
lexiques subjectifs, Appraisal, impl&#233;mentation informatique, portraits et biographies dans la 
presse de sp&#233;cialit&#233; et la presse d&#8217;information. 
Keywords:   evaluative judgement, peripheral constituent, evaluative constructions and 
lexicon, Appraisal, computational implementation, biographies and portraits in specialized 
press and newspapers. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Jackiewicz, T. Charnois et S. Ferrari 
</p>
<p>1 Introduction 
Notre &#233;tude porte sur un mode particulier d&#8217;expression des jugements d&#8217;&#233;valuation dans la 
langue fran&#231;aise. Son originalit&#233; r&#233;side dans l&#8217;association des travaux sur le d&#233;tachement et 
l&#8217;apposition en linguistique du discours avec des recherches en TAL (Traitement 
Automatique des Langues) sur la fouille d&#8217;opinions. Dans une premi&#232;re partie, nous 
pr&#233;sentons une analyse linguistique men&#233;e sur un premier corpus de portraits journalistiques 
du ph&#233;nom&#232;ne discursif du d&#233;tachement et, plus sp&#233;cifiquement, de l&#8217;expression d&#8217;opinion au 
sein de constituants p&#233;riph&#233;riques, extra-pr&#233;dicatifs. Les r&#233;gularit&#233;s observ&#233;es mettent en 
&#233;vidence l&#8217;existence de diff&#233;rentes formes de surface, des patrons g&#233;n&#233;riques pouvant le cas 
&#233;ch&#233;ant &#234;tre pr&#233;cis&#233;s par un lexique sp&#233;cifique. Dans une deuxi&#232;me partie, nous pr&#233;sentons 
une exp&#233;rimentation informatique dont l&#8217;objectif est de permettre l&#8217;observation de ces patrons 
sur de nouveaux textes, en vue d&#8217;un retour sur le mod&#232;le linguistique. Apr&#232;s un bref &#233;tat de 
l&#8217;art des travaux en TAL dans le domaine de l&#8217;analyse d&#8217;opinion, cadre applicatif possible de 
nos travaux, nous pr&#233;sentons notre mise en &#339;uvre et une premi&#232;re &#233;valuation men&#233;e sur un 
nouveau corpus de m&#234;me genre que le pr&#233;c&#233;dent d&#8217;environ 880 textes. Les r&#233;sultats 
permettent de d&#233;gager ou de confirmer plusieurs ph&#233;nom&#232;nes int&#233;ressants comme une 
r&#233;partition tr&#232;s h&#233;t&#233;rog&#232;ne selon les textes et selon les patrons, l&#8217;utilisation r&#233;currente de 
phrases averbales, d&#8217;&#233;num&#233;rations et de connecteurs. En conclusion, nous proposons des 
pistes pour am&#233;liorer la reconnaissance des &#233;nonc&#233;s &#233;tudi&#233;s et leur exploitation effective dans 
le cadre d&#8217;une analyse automatique. 
</p>
<p>2 &#201;tude linguistique 
</p>
<p>2.1 Probl&#233;matique et cadre g&#233;n&#233;ral 
</p>
<p>Tr&#232;s pr&#233;sente en TAL ces derni&#232;res ann&#233;es, notamment dans la recherche informatis&#233;e des 
opinions, des attitudes ou des &#233;motions dans des documents textuels, la notion de jugement 
d&#8217;&#233;valuation1 n&#8217;a pas re&#231;u en linguistique fran&#231;aise de description th&#233;orique unifi&#233;e. Il 
n&#8217;existe pas, &#224; notre connaissance, de syst&#233;matisation linguistique de l&#8217;acte &#233;valuatif comme 
ph&#233;nom&#232;ne complexe. En sch&#233;matisant, l&#8217;&#233;valuation a &#233;t&#233; abord&#233;e dans des recherches sur la 
subjectivit&#233; dans la langue selon trois angles : (i) l&#8217;&#233;tude de certaines notions linguistiques 
apparent&#233;es, telles que point de vue ou prise en charge &#233;nonciative; (ii) l&#8217;&#233;tude de certaines 
valeurs modales (modalit&#233;s appr&#233;ciatives, &#233;valuatives&#8230;) ; (iii) l&#8217;analyse et la constitution de 
lexiques subjectifs. En revanche, la linguistique anglophone a abord&#233; ce ph&#233;nom&#232;ne dans des 
recherches de grande ampleur ; plusieurs d&#8217;entre elles cherchent &#224; construire un mod&#232;le 
int&#233;gral de l&#8217;&#233;valuation. Une des plus abouties, ayant d&#233;j&#224; donn&#233; lieu &#224; de nombreuses 
applications informatiques, est Appraisal in English de (Martin &amp; White, 2005). Le travail 
d&#233;crit ici prend place dans une recherche originale2, men&#233;e &#224; l&#8217;interface du TAL et de la 
linguistique, qui tente d&#8217;enrichir et de formaliser ce mod&#232;le, afin de le rendre op&#233;rationnel 
pour le fran&#231;ais, &#224; diff&#233;rents niveaux de grain (syntagme, phrase, discours). Le choix du 
                                                 
</p>
<p>1
   D&#233;finition : Le jugement d&#8217;&#233;valuation d&#233;termine, d&#8217;une mani&#232;re qui va de la plus instinctive &#224; la plus 
</p>
<p>r&#233;fl&#233;chie, la valeur que rev&#234;t un &#233;tat du monde pour un individu particulier &#224; un moment donn&#233;. C'est un acte 
de pr&#233;f&#233;rence, qui postule un syst&#232;me de valeurs hi&#233;rarchis&#233;es selon un ordre qui implique des degr&#233;s divers 
de d&#233;sirabilit&#233;. Les valeurs peuvent &#234;tre vues comme des id&#233;aux et des pr&#233;f&#233;rences qui pr&#233;disposent les 
individus &#224; agir dans un sens donn&#233;, qui structurent leurs repr&#233;sentations et leurs actions. 
</p>
<p>2
   Projet Ontopitex, actuellement en phase prospective. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jugements d'&#233;valuation et constituants p&#233;riph&#233;riques 
</p>
<p>ph&#233;nom&#232;ne discursif du d&#233;tachement, &#224; la fronti&#232;re entre la phrase et le discours, et &#171; lieu &#187; 
privil&#233;gi&#233; de l&#8217;expression des &#233;valuations, s&#8217;est impos&#233; en toute logique et a d&#233;bouch&#233; sur une 
&#233;tude (en cours) des constituants p&#233;riph&#233;riques &#224; valeur axiologique (Jackiewicz, &#224; para&#238;tre). 
</p>
<p>2.2 L&#8217;&#233;valuation &#224; la p&#233;riph&#233;rie du pr&#233;dicat 
</p>
<p>Un jugement d&#8217;&#233;valuation peut &#234;tre d&#233;not&#233;, de mani&#232;re souvent cumulative, par diff&#233;rents 
&#233;l&#233;ments de l&#8217;&#233;nonc&#233; : le sujet, l&#8217;objet, le pr&#233;dicat, un &#233;l&#233;ment extra-pr&#233;dicatif (1).  
</p>
<p>(1) Hypocondriaque, le clarinettiste amateur le plus fameux de Manhattan est un h&#233;doniste 
contrari&#233; : &#171; on peut vivre centenaire si l&#8217;on abandonne toutes les choses qui donnent envie de 
vivre centenaire &#187;. 
</p>
<p>Notre &#233;tude porte sur les &#233;valuations d&#233;not&#233;es par des &#233;l&#233;ments extra-pr&#233;dicatifs, ciblant des 
individus et des organisations (il s&#8217;agit de &#171; jugements &#187; au sens d&#8217;Appraisal).  Le paradigme 
(2) en illustre les cas de figure les plus courants et signale l&#8217;&#233;quivalence entre plusieurs 
formes d&#8217;expression possibles. 
</p>
<p>(2) Prudent, /Avec prudence, /D&#8217;une prudence exag&#233;r&#233;e, / Regard prudent, /Prudemment, /Par 
prudence, / En homme prudent, / Connu pour sa prudence, Tom&#8230; 
</p>
<p>De telles &#233;valuations conditionnent de mani&#232;re sensible l&#8217;interpr&#233;tation du texte, sans faire 
l&#8217;objet d&#8217;une assertion explicite. Il n&#8217;est pas dit dans (1) &#171; WA est hypocondriaque &#187;, mais 
cette information introduite par le biais de la pr&#233;dication r&#233;duite (hypocondriaque , le 
clarinettiste&#8230;) est pr&#233;sent&#233;e comme allant de soi ou comme &#233;tant commun&#233;ment partag&#233;e. 
C&#8217;est une sorte de pr&#233;suppos&#233;, consid&#233;r&#233; comme acquis, sur lequel il est possible de 
s&#8217;appuyer. L&#8217;&#233;nonciateur ne s&#8217;en trouve pas engag&#233; de la m&#234;me mani&#232;re, l&#8217;intention premi&#232;re 
n&#8217;&#233;tant pas de juger mais d&#8217;informer. 
Un constituant p&#233;riph&#233;rique, conform&#233;ment &#224; la d&#233;finition qu&#8217;en donne (Combettes, 1998, 
p.136), est un &#171; constituant qui ne se trouve pas int&#233;gr&#233; &#224; la structure syntaxique de la 
proposition, qui n&#8217;entre pas dans des relations de d&#233;pendance ou de rection avec d&#8217;autres 
&#233;l&#233;ments &#187;. Non essentiel, il est en r&#233;alit&#233; plus ou moins libre, c&#8217;est-&#224;-dire plus ou moins 
d&#233;pla&#231;able, plus ou moins effa&#231;able. Nous avons choisi de consid&#233;rer, pour amorcer le travail 
de collecte des observables, les constructions d&#233;tach&#233;es (au sens de Combettes), ainsi que des 
compl&#233;ments circonstanciels et des GN compatibles avec le d&#233;tachement. La cat&#233;gorie de 
construction d&#233;tach&#233;e qui int&#232;gre les groupes adjectivaux (impr&#233;visible et fantasque, X ...) les 
constructions absolues (l'&#339;il vigilent, X&#8230;) et les participes (r&#233;put&#233; pour son caract&#232;re 
bourru, X&#8230;). Les constructions d&#233;tach&#233;es sont d&#233;finies sur la base de trois crit&#232;res, ayant 
trait &#224; la libert&#233; de position, &#224; leur statut de pr&#233;dication seconde et au fait d&#8217;appeler un 
r&#233;f&#233;rent sous-jacent (3). La seconde famille de constituants p&#233;riph&#233;riques aptes &#224; d&#233;noter des 
&#233;valuations est form&#233;e par des adverbes (de sujet-phrase et de sujet-pr&#233;dicat, au sens de 
Guimier) et des circonstants pr&#233;positionnels (Patiemment, X&#8230; ; En mauvaise posture, X). Ces 
constituants pr&#233;sentent la situation d&#233;not&#233;e par la pr&#233;dication principale comme une 
manifestation circonstantielle (causale&#8230;) d&#8217;une qualit&#233; attribu&#233;e &#224; un actant (4). Enfin, le 
troisi&#232;me ensemble de constituants p&#233;riph&#233;riques comprend des groupes nominaux avec ou 
sans d&#233;terminants tels que femme de t&#234;te, X&#8230; ou X, le maestro de la d&#233;sinflation (5), 
</p>
<p>(3) Pragmatique et prudent, Barack Obama s&#8217;est bien gard&#233; jusqu&#8217;ici de chiffrer son plan de 
relance dans les infrastructures.  
(4) Avec pers&#233;v&#233;rance et beaucoup de diplomatie, Yves Neumager a finalement r&#233;ussi &#224; se faire 
accepter des 300 Br&#233;hatins qui vivent sur l&#8217;&#238;le toute l&#8217;ann&#233;e. 
(5) L&#8217;as de l&#8217;&#233;conomie, ce professeur de Harvard l&#8217;est presque g&#233;n&#233;tiquement puisqu&#8217;il est fils 
de deux &#233;conomistes et neveu de deux prix Nobel dans la sp&#233;cialit&#233;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Jackiewicz, T. Charnois et S. Ferrari 
</p>
<p>2.3 Observations sur corpus 
</p>
<p>L&#8217;&#233;tude d&#233;crite ici est destin&#233;e &#224; tester la pertinence des patrons linguistiques d&#233;gag&#233;s lors 
d&#8217;une analyse linguistique men&#233;e sur un corpus3 des Echos4. Elle s&#8217;inscrit dans une d&#233;marche 
en deux temps : le pr&#233;sent amor&#231;age &#171; manuel &#187; suivi d&#8217;une exp&#233;rimentation informatique 
pr&#233;sent&#233;e en section  3. 
Nous avons relev&#233; 20 patrons linguistiques sous-jacents aux expressions axiologiques les plus 
saillantes, ainsi qu&#8217;un lexique (d&#8217;environ 550 termes) constitutif de ces expressions. Un 
corpus d&#8217;exemples associ&#233;s aux patrons linguistiques a &#233;galement &#233;t&#233; constitu&#233;. Aucune 
forme d&#8217;exhaustivit&#233; quant aux ressources constitu&#233;es n&#8217;est revendiqu&#233;e &#224; ce stade de l&#8217;&#233;tude.  
Les expressions linguistiques correspondantes aux patrons d&#233;gag&#233;s doivent v&#233;rifier 
conjointement deux conditions : (i) figurer en position d&#233;tach&#233;e : &#224; l&#8217;initiale, en incise (entre 
sujet et verbe) ou d&#233;tach&#233;e &#224; droite, (ii) appara&#238;tre en cooccurrence avec un syntagme qui 
r&#233;f&#232;re &#224; un individu, un groupe d&#8217;individus ou une institution : Obama, il, le pr&#233;sident, cet 
homme politique, l&#8217;Am&#233;ricain&#8230; Ce syntagme d&#233;note la cible du jugement. Les patrons 
correspondent &#224; des constructions &#171; compl&#232;tes &#187; (marqu&#233;es par le gras dans 6), 
&#233;ventuellement dot&#233;es d&#8217;une expansion. Cela nous permet d&#8217;aller au-del&#224; des analyses 
fond&#233;es sur des lexiques subjectifs (absents de grand nombre de structures ou d&#8217;expressions 
&#233;valuatives : en patron de poigne&#8230;). 
</p>
<p>(6) Ni trop sentimental, ni trop &#233;nergique, il ma&#238;trise, avec une finesse quasi mozartienne, un 
lyrisme g&#233;n&#233;reux 
</p>
<p>Les patrons g&#233;n&#233;riques (constitu&#233;s uniquement de cat&#233;gories grammaticales, de pr&#233;positions 
et de mots supports) sont destin&#233;s entre autres &#224; acqu&#233;rir des lexiques &#171; axiologiques &#187; sur des 
corpus choisis. Leur pr&#233;cision peut &#234;tre variable. Par exemple, la s&#233;quence&#171; en 
homme/femme de N &#187; en position d&#233;tach&#233;e permet de collecter les substantifs susceptibles de 
d&#233;noter dans cette structure certaines qualit&#233;s humaines (confiance, &#233;coute, foi, &#8230; t&#234;te, 
poigne&#8230;). Les patrons exploitant partiellement le lexique accumul&#233; peuvent servir pour 
enrichir diff&#233;rentes cat&#233;gories de ce lexique. Il est possible, par exemple, d&#8217;exploiter des 
adjectifs attest&#233;s pour rechercher des substantifs ou l&#8217;inverse. Ainsi, avec le patron &#171; en Adj 
N, il &#187;, o&#249; la cat&#233;gorie Adj est instanci&#233;e par l&#8217;un des adjectifs de la liste &#171; amorce &#187; : {vrai, 
digne, authentique, v&#233;ritable, bon}, on peut collecter des substantifs susceptibles d&#8217;appara&#238;tre 
dans cette construction. Dans un second temps, il devient possible de compl&#233;ter la liste des 
adjectifs &#224; l&#8217;aide du patron &#171; en Adj {gestionnaire, industriel, strat&#232;ge&#8230;} &#187;, dont les 
substantifs sont issus de la phase pr&#233;c&#233;dente. On peut s&#8217;attendre &#224; ce que le domaine de 
connaissances concern&#233; ait une influence notable sur les champs lexicaux qui seront ainsi 
constitu&#233;s. 
Cette m&#233;thode peut &#234;tre utilis&#233;e pour expliciter ou reconstituer les syst&#232;mes d&#8217;&#233;valuation (ou 
de valeurs) tels qu&#8217;ils sont pratiqu&#233;s dans certains domaines ou certains univers 
socioprofessionnels. Il est pr&#233;f&#233;rable dans ce cas de ne pas utiliser de lexiques pr&#233;-&#233;tablis. La 
solution consiste &#224; amorcer la proc&#233;dure par l&#8217;emploi de quelques patrons g&#233;n&#233;riques 
                                                 
</p>
<p>3
   Analyse exhaustive sur les rubriques &#171; en vue &#187; et &#171; portraits &#187; et analyse cibl&#233;e sur les autres 
</p>
<p>cat&#233;gories d&#8217;articles disponibles sur  www.lesechos.fr. 
</p>
<p>4
   L&#8217;&#233;criture journalistique semble favoriser des &#233;nonc&#233;s &#224; constituants d&#233;tach&#233;s multiples. Elle en para&#238;t 
</p>
<p>plus fluide et plus &#171; dynamique &#187;. Cette mani&#232;re de pr&#233;senter l&#8217;information s&#8217;apparente &#224; un encha&#238;nement 
d&#8217;images (ou flashs) sur le r&#233;f&#233;rent concern&#233;, rendant saillantes certaines de ses facettes. Une telle &#233;criture 
est manifestement plus condens&#233;e, notamment du fait de l&#8217;absence de verbes dans les pr&#233;dications 
secondaires et de connecteurs entre ces pr&#233;dications d&#233;tach&#233;es.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jugements d'&#233;valuation et constituants p&#233;riph&#233;riques 
</p>
<p>sp&#233;cifiquement d&#233;di&#233;s &#224; l&#8217;&#233;valuation, puis poursuivre la collecte avec des patrons 
partiellement instanci&#233;s par le lexique progressivement acquis lors des phases pr&#233;c&#233;dentes. 
Toutefois, pour &#234;tre effectivement exploit&#233;s dans des situations de recherche d&#8217;informations 
ou d&#8217;acquisition de lexique, ces patrons ont besoin d&#8217;&#234;tre test&#233;s &#224; grande &#233;chelle. 
</p>
<p>2.4 Patrons soumis &#224; l&#8217;exp&#233;rimentation 
</p>
<p>La premi&#232;re phase de tests a port&#233; sur 10 patrons (tableau 1) choisis parmi les 20 initialement 
construits, de mani&#232;re &#224; pouvoir tester : (i) 3 ou 4 patrons repr&#233;sentatifs des trois cat&#233;gories de 
constituants p&#233;riph&#233;riques retenues, (ii) des patrons g&#233;n&#233;riques et des patrons sp&#233;cifiques. 
</p>
<p>P1 : (homme / femme) de N &#8211; femme de caract&#232;re &#8211; g&#233;nitif de qualit&#233; 
P2 : (homme / femme) &#224; GN &#8211; homme &#224; la forte personnalit&#233; &#8211; &#233;pith&#232;te 
P5 : N de GN &#8211; maestro de la d&#233;sinflation &#8211; excellence (expression m&#233;taphorique) 
P6 : N adj / adj N &#8211; &#233;conomiste brillant &#8211; savoir-faire 
P11 : GAdj &#8211; impr&#233;visible et fantasque &#8211; groupe adjectival 
P12 : GAdj &#224;/pour Vinf &#8211; habile &#224; construire&#8230; - groupe adjectival &#224; expansion 
P13 : de artInd N adj &#8211; d&#8217;une extr&#234;me fermet&#233; &#8211; g&#233;nitif de qualit&#233; 
P17 : en Adj N / N Adj &#8211; en industriel responsable &#8211; structure pr&#233;positionnelle en en 
P18.1 : avec N &#8211; avec pragmatisme &#8211; adverbial 
P18.2 : adverbe en ment &#8211; courageusement &#8211; adverbial 
</p>
<p>Tableau 1 : patrons linguistiques avec leurs cat&#233;gories et exemples illustratifs 
</p>
<p>Consid&#233;rons pour l&#8217;exemple trois d&#8217;entre eux. Le patron P5 est destin&#233; &#224; capter des 
expressions m&#233;taphoriques d&#233;notant l&#8217;excellence, un talent ou un apport remarquable d&#8217;un 
individu dans un domaine. Il associe un terme m&#233;lioratif (ap&#244;tre, maestro, ic&#244;ne&#8230;) avec une 
expression d&#233;notant un champ d&#8217;activit&#233; ou un savoir-faire (7). Il a besoin de listes de 
lex&#232;mes pleins. Le groupe adjectival (P11) m&#233;rite l&#8217;attention en raison de la multiplicit&#233; de 
ses formes (populaire ; impr&#233;visible et fantasque ; ni honn&#234;te, ni digne de confiance ; 
charmeur sans &#234;tre h&#226;bleur ; arrogant et sans scrupule ; plus instinctif qu&#8217;&#233;rudit ; vrai 
rebelle et faux intr&#233;pide&#8230;) et de la question des polarit&#233;s attach&#233;es hors et en contexte aux 
adjectifs constitutifs (8). La structure pr&#233;positionnelle (P17) quant &#224; elle cumule deux r&#244;les : 
elle exprime localement une &#233;valuation et &#224; l&#8217;&#233;chelle de la phrase porte une valeur causale (9).  
</p>
<p>(7) Ap&#244;tre du capitalisme familial, Lakshmi, cinquante-huit ans, l&#8217;a d&#8217;ailleurs nomm&#233; &#224; ses 
c&#244;t&#233;s au conseil d&#8217;ArcelorMittal,&#8230; 
(8) Militant mais opportuniste, franc-tireur mais habile, sociable mais anticonformiste, le 
directeur de l&#8217;Op&#233;ra de Paris sait manier les paradoxes pour parvenir &#224; ses fins. 
(9) En bon adepte de Warren Buffett, il privil&#233;gie les soci&#233;t&#233;s dont l'&#233;volution peut &#234;tre 
ais&#233;ment appr&#233;hend&#233;e. 
</p>
<p>3 Mise en &#339;uvre informatique et r&#233;sultats 
Notre &#233;tude permet ais&#233;ment d&#8217;envisager son exploitation pour l&#8217;analyse automatique d&#8217;une 
certaine cat&#233;gorie d&#8217;opinion. Toutefois, &#224; ce stade, il convient d&#8217;en v&#233;rifier la faisabilit&#233;, en 
testant la reconnaissance des patrons observ&#233;s sur de nouveaux textes, afin d&#8217;analyser leur 
pertinence pour une reconnaissance automatique. Nous proposons donc une premi&#232;re mise en 
&#339;uvre dont l&#8217;objectif est avant tout de permettre aux experts de linguistique et de TAL </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Jackiewicz, T. Charnois et S. Ferrari 
</p>
<p>d&#8217;observer le mod&#232;le sur de nouveaux corpus et de l&#8217;enrichir en retour. Le cadre applicatif 
potentiel, analyse automatis&#233;e d&#8217;opinions, m&#233;rite cependant que nous situions notre approche 
parmi celles de la communaut&#233;. C&#8217;est pourquoi un bref &#233;tat de l&#8217;art pr&#233;c&#232;de la pr&#233;sentation 
proprement dite de notre mise en &#339;uvre. 
</p>
<p>3.1 &#201;tat de l&#8217;art 
Les travaux informatiques relatifs au ph&#233;nom&#232;ne de l'&#233;valuation sont en majorit&#233; ceux traitant 
de la fouille d'opinion et de l'analyse de sentiments. Ils peuvent &#234;tre class&#233;s selon trois 
grandes approches : &#233;tablir des ressources lexicales, cat&#233;goriser des textes, dans leur globalit&#233;, 
et enfin analyser des expressions plus locales, comme des phrases. 
</p>
<p>En ce qui concerne les ressources lexicales, l&#8217;objectif est de les constituer de mani&#232;re semi-
automatique. Les travaux existants se distinguent par le type de propri&#233;t&#233;s lexicales &#233;tudi&#233;es : 
d&#233;terminer le caract&#232;re subjectif ou objectif des termes, ou la polarit&#233; des subjectifs (positive, 
n&#233;gative), ou encore pr&#233;ciser plus finement leur sens comme dans (Whitelaw et al., 2005) ou 
dans les travaux relatifs &#224; SentiWordNet (Esuli, Sebastiani, 2006), associant une combinaison 
des notions de subjectivit&#233; et de polarit&#233; &#224; chaque SynSet de WordNet. L'atelier FODOP08 
(FOuille des Donn&#233;es d&#8217;OPinions) a &#233;t&#233; l'occasion de v&#233;rifier l'existence de travaux 
comparables sur le fran&#231;ais (Harb et al., 2008). 
De nombreux travaux s&#8217;attachent &#224; cat&#233;goriser des textes dans leur int&#233;gralit&#233;, en terme de 
polarit&#233; globale (texte positif, n&#233;gatif ou neutre). La campagne d&#8217;&#233;valuation DEFT07 avait cet 
objectif, pour la langue fran&#231;aise. Les domaines d'applications sont nombreux et divers ; 
citons l&#8217;analyse de critiques de films (Turney, 2002), (Pang, Lee, 2004) et une partie de 
DEFT07, de textes politiques (un corpus de r&#233;actions &#224; des propositions de lois dans 
DEFT07), ou les critiques de produits. Les techniques utilis&#233;es sont vari&#233;es, majoritairement 
issues des domaines de la fouille de donn&#233;es et de l'apprentissage automatique. 
Une s&#233;rie de travaux s'attachent enfin &#224; mener des analyses plus locales, &#224; d&#233;terminer le 
caract&#232;re objectif ou subjectif ou encore la polarit&#233; de mots, d'expressions complexes ou de 
phrases dans leur int&#233;gralit&#233;, en contexte. Les buts sont ici encore multiples, et les attentes 
nombreuses, &#224; en juger par les usages des industriels du domaine (Marcoul, Athayde, 2008). 
Les approches relatives s'attachent &#224; la classification de phrases et de propositions pour 
distinguer les opinions des faits dans un syst&#232;me de Question/R&#233;ponse (Yu, Hatzivassiloglou, 
2003), pour proposer un r&#233;sum&#233; des points sur lesquels portent les critiques &#233;mises par les 
consommateurs dans les travaux de (Hu, Liu, 2004), ou encore &#224; l&#8217;annotation en contexte 
d&#8217;expressions d&#8217;opinion (Legallois, Ferrari, 2006), (Vernier, Ferrari, 2007). La pertinence des 
annotations propos&#233;es est li&#233;e aux applications vis&#233;es. On retrouve la simple d&#233;termination du 
caract&#232;re subjectif ou la polarit&#233;, mais une tendance se d&#233;gage pour proposer des annotations 
d&#8217;autres caract&#233;ristiques comme les cibles (objets des &#233;valuations), les sources (&#233;metteurs), 
l&#8217;intensit&#233;, etc. (Wiebe et al., 2005), (Read et al., 2007), (Ferrari et al., 2008). 
</p>
<p>3.2 R&#233;alisation informatique 
</p>
<p>Si l&#8217;&#233;tude de la section  2.3 a permis de constituer, manuellement, des ressources lexicales, la 
mise en &#339;uvre que nous proposons se situe plus parmi les approches visant une analyse locale 
et en contexte du ph&#233;nom&#232;ne &#233;valuatif. Bien que les annotations que nous proposons 
actuellement n&#8217;aient pas cet objectif en soi, elles peuvent &#234;tre enrichies en vue d&#8217;une telle 
application. Les patrons propos&#233;s s&#8217;appuient essentiellement sur des indices grammaticaux et </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jugements d'&#233;valuation et constituants p&#233;riph&#233;riques 
</p>
<p>lexicaux. Nous avons donc opt&#233; pour une r&#233;alisation sous forme de cha&#238;ne de traitements, 
d&#233;velopp&#233;e dans la plate-forme Linguastream (Widl&#246;cher, Bilhaut, 2006) (figure 1). 
</p>
<p> 
</p>
<p>Figure 1 : cha&#238;ne de traitements dans Linguastream 
</p>
<p>Les pr&#233;traitements sont ceux des modules de la premi&#232;re ligne : la cha&#238;ne prend en entr&#233;e un 
texte au format XML, y rep&#232;re les &#233;l&#233;ments &#224; analyser (les m&#233;ta-informations sont ignor&#233;e par 
les modules suivants), segmente, applique le treetagger (Schmid, 1994). Le module central 
d&#8217;analyse consiste en une grammaire Prolog (module DCG Marker) exploitant un lexique 
d&#233;di&#233;, dans lequel des r&#232;gles Ri exploitent &#224; la fois la pr&#233;sence de termes sp&#233;cifiques et les 
formes de surface correspondant aux patrons Pi observ&#233;s. Il s&#8217;agit d&#8217;une grammaire locale 
sans analyse syntaxique de la phrase, s&#8217;appuyant sur les ponctuations pour d&#233;terminer le 
caract&#232;re d&#233;tach&#233; des constituants, et exploitant les &#233;tiquettes issues du treetagger. La fin de 
la cha&#238;ne consiste en une pr&#233;paration pour affichage dans un navigateur, illustr&#233; dans la figure 
2. 
</p>
<p> 
</p>
<p>Figure 2 : visualisation des r&#233;sultats 
</p>
<p>Dans les fichiers de sortie, les constituants p&#233;riph&#233;riques rep&#233;r&#233;s sont annot&#233;s notamment par 
le nom de la r&#232;gle dont ils sont issus, afin de faciliter les retours sur le mod&#232;le. L&#8217;interface de 
visualisation permet de consulter les annotations dans le navigateur par simple clic sur les 
segments rep&#233;r&#233;s et mis en valeurs. 
</p>
<p>3.3 R&#233;sultats 
</p>
<p>Les analyses ont &#233;t&#233; men&#233;es sur une collection de textes issus cette fois du journal Le Monde, 
et constitu&#233;e des portraits ou biographies de la p&#233;riode juillet &#224; d&#233;cembre 2002, soit en tout 
884 articles. C&#8217;est un corpus d&#8217;un genre comparable &#224; celui utilis&#233; pour l&#8217;observation initiale, 
donc susceptible de contenir des patrons similaires employ&#233;s dans le m&#234;me sens. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Jackiewicz, T. Charnois et S. Ferrari 
</p>
<p>3.3.1 Aspects quantitatifs 
Pour cette premi&#232;re &#233;valuation des r&#233;sultats, les r&#232;gles r1, r2, r5, r6, r11, r12, r13, r17, r18.1 et 
r18.2 ont &#233;t&#233; test&#233;es. La mise en &#339;uvre permet de reconna&#238;tre les patrons pr&#233;sent&#233;s en  2.4 &#224; 
l&#8217;exception des expansions et des formes comparatives. La quantit&#233; de patrons correspondant 
et leur r&#233;partition dans le corpus sont pr&#233;sent&#233;es dans le tableau 2 et dans la figure 3. 
</p>
<p>r1 r2 r5 r6 r11 r12 r13 r17 r18.1 r18.2 ANY
nb occ 7 0 41 9 1662 84 67 67 22 7 1966
</p>
<p>0,4% 0,0% 2,1% 0,5% 84,5% 4,3% 3,4% 3,4% 1,1% 0,4% 100,0%
nb art &gt;0 7 0 39 9 535 71 61 62 21 7 580
</p>
<p>1,2% 0,0% 6,7% 1,6% 92,2% 12,2% 10,5% 10,7% 3,6% 1,2% 100,0%
 
</p>
<p>La ligne &#171; nb occ &#187; repr&#233;sente le nombre de patrons trouv&#233;s issus de chaque r&#232;gle ou, dans la colonne ANY, de 
l&#8217;ensemble des r&#232;gles ; en dessous figure le pourcentage par rapport &#224; la totalit&#233; des patrons trouv&#233;s, pour 
appr&#233;cier la r&#233;partition entre chaque cat&#233;gorie de r&#232;gles. La ligne &#171; nb art &gt;0 &#187; indique le nombre d&#8217;articles 
contenant au moins un patron issu de la r&#232;gle correspondante, ou de l&#8217;une d&#8217;entre elle (ANY) ; dessous figure la 
proportion par rapport &#224; l&#8217;ensemble des articles contenant au moins un patron. 
</p>
<p>Tableau 2 : r&#233;partition des patrons 
</p>
<p>En tout, 1966 patrons ont &#233;t&#233; trouv&#233;s dans le corpus, r&#233;partis sur 580 articles (65% du total). 
La r&#233;partition montre que 395 articles contiennent plus d&#8217;un patron, 107 plus de 5, 21 
seulement plus de 10 ; le maximum de patrons par article est 23. La dispersion sur le corpus 
est donc assez h&#233;t&#233;rog&#232;ne. La r&#233;partition selon les r&#232;gles indique que seule la r&#232;gle r11 et 
dans une bien moindre mesure r13 et r12 donnent plus de 2 patrons par article. Comme le 
tableau l&#8217;indique, r11 am&#232;ne 85% des r&#233;sultats. Le graphique de la figure 3 permet 
d&#8217;appr&#233;cier ces r&#233;partitions en montrant combien d&#8217;articles contiennent combien de patrons 
de chaque r&#232;gle productive, ou de toutes (ANY). 
</p>
<p>0
20
40
60
80
</p>
<p>100
120
140
160
180
200
</p>
<p>1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
nb patrons
</p>
<p>n
b 
</p>
<p>ar
tic
</p>
<p>le
s
</p>
<p>ANY
r1
r2
r5
r6
r11
r12
r13
r17
r18.1
r18.2
</p>
<p> 
</p>
<p>Figure 3 : r&#233;partition des patrons 
</p>
<p>3.3.2 Aspects qualitatifs 
Les r&#232;gles utilis&#233;es pour la recherche des patrons ne sont pas toutes comparables : certaines 
sp&#233;cifiques exploitent des listes d&#8217;entr&#233;es lexicales, d&#8217;autres, plus g&#233;n&#233;riques, am&#232;nent du 
bruit. Il s&#8217;agit d&#232;s lors d&#8217;interpr&#233;ter avec pr&#233;caution les statistiques pr&#233;c&#233;dentes. La r&#233;partition </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jugements d'&#233;valuation et constituants p&#233;riph&#233;riques 
</p>
<p>clairement h&#233;t&#233;rog&#232;ne des patrons trouv&#233;s reste un point certain, avec une forte concentration 
de patrons au sein de quelques articles (figure 3), tandis que 35% n&#8217;en contiennent aucun. 
Nous expliquons cette r&#233;partition par des modes pr&#233;f&#233;rentiels d&#8217;expression selon les auteurs. 
L&#8217;utilisation fr&#233;quente de groupes adjectivaux confirme le bien-fond&#233; des travaux de la 
communaut&#233; sur leur analyse en terme de subjectivit&#233; et de polarit&#233;. On remarque aussi 
quelques ph&#233;nom&#232;nes int&#233;ressants &#224; la lecture des sorties, notamment de nombreuses 
&#233;num&#233;rations, parfois au sein de phrases averbales (10-11), et l&#8217;utilisation de connecteurs 
permettant des jeux d&#8217;opposition ou de renforcement, des modalit&#233;s temporelles (12) (et, 
tant&#244;t, sans, &#224; la fois, mais, toujours, jamais, etc.). Autre fait notable : la position d&#233;tach&#233;e 
contribue &#224; l&#8217;interpr&#233;tation axiologique de certains adjectifs (ouvert, europ&#233;en&#8230;) (13). 
</p>
<p>(10) L'acteur d'Anouilh et de Chabrol, de Diderot et de Pinter, reste un voyageur traqu&#233; de 
l'&#226;me. Inqui&#233;tant, ambigu, fascinant. (&#8230;). Laconique et inqui&#233;tant, discret et courtois, il 
cultive l'anonymat jusqu'&#224; l'&#233;tranget&#233;. 
(11) Froidement, avec m&#233;thode, en chemise blanche et cravate noire. 
(12) R&#233;put&#233;e rigide, parfois cassante, elle est toujours difficile &#224; manoeuvrer. (..) D&#233;cri&#233;e, 
souvent m&#233;pris&#233;e par les caciques du parti, elle jouit malgr&#233; tout d'une v&#233;ritable popularit&#233; 
parmi les militants. 
(13) Elle participe &#224; ce Portugal &quot; qui va vite, ouvert, europ&#233;en, d&#233;complex&#233;. 
</p>
<p>Sans avoir men&#233; d&#8217;analyse quantitative syst&#233;matique, nous pouvons toutefois qualifier les 
principaux cas de bruit et de silence. Certains sont bien s&#251;r d&#251;s &#224; des erreurs de pr&#233;traitement 
(segmentation, &#233;tiquetage grammatical). Concernant le bruit, nous notons les cas suivants : (i) 
la cible est un objet, pas une personne (&#171; baroques et tendres, ils&#8230; &#187; en parlant des livres) ; 
(ii) le cas des propri&#233;t&#233;s sans charge axiologique (&#171; moustachu, aux yeux noirs, &#224; la voix 
douce &#187;) ; (iii) l&#8217;ambigu&#239;t&#233; de la structure (P17 : en bon parrain vs en pleine chiraquie). 
Quant au silence, il est essentiellement d&#251; aux facteurs suivants: (i) constructions trop 
&#171; serr&#233;es &#187; ne laissant pas de place &#224; des modifieurs (pour P6 notamment) ; (ii) restrictions 
lexicales fortes pour P1 et P2 (&#171; Critique &#224; la notori&#233;t&#233; transatlantique, Gerber &#187; non 
reconnu). L&#8217;analyse de ces erreurs permettra notamment de repenser la forme de certains 
patrons et d&#8217;approfondir la r&#233;flexion sur diff&#233;rents aspects du jugement d&#8217;&#233;valuation. 
En outre, une campagne d&#8217;annotation manuelle est initi&#233;e afin de permettre une mesure du 
taux d&#8217;accord entre experts humains et, &#224; terme, des taux de pr&#233;cision et rappel. 
</p>
<p>4 Conclusion, perspectives 
Nous avons men&#233; une &#233;tude de l&#8217;expression de jugement d&#8217;&#233;valuation au sein des constituants 
p&#233;riph&#233;riques qui a permis de d&#233;gager 20 patrons et un lexique associ&#233; d&#8217;environ 500 termes. 
Nous en avons propos&#233; une mise en &#339;uvre informatique pour mener une exp&#233;rimentation sur 
un corpus de plus grande taille. Les premiers r&#233;sultats confirment que ce mode d&#8217;expression 
est d&#8217;usage courant, et permettent d&#8217;observer une r&#233;partition in&#233;gale &#224; la fois selon les auteurs 
et selon les patrons. Des configurations particuli&#232;res &#233;mergent de l&#8217;analyse des r&#233;sultats : des 
&#233;num&#233;rations, des phrases averbales et un usage privil&#233;gi&#233; de certains connecteurs. Outre une 
analyse plus approfondie de ces ph&#233;nom&#232;nes, nous envisageons d&#233;sormais de poursuivre 
notre &#233;tude selon deux axes majeurs : un enrichissement des ressources par apprentissage du 
lexique dans les patrons g&#233;n&#233;riques, ainsi qu&#8217;une &#233;tude du rapport aux cibles des jugements, 
en couplant cette fois nos travaux avec d&#8217;autres sur la cor&#233;f&#233;rence et des ressources 
s&#233;mantiques pour d&#233;terminer la nature des cibles. Nous visons &#224; terme d&#8217;am&#233;liorer la 
reconnaissance des &#233;nonc&#233;s &#233;tudi&#233;s et d&#8217;enrichir les annotations d&#8217;informations sur la cible 
pour une analyse automatique de discours d&#8217;opinion. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Jackiewicz, T. Charnois et S. Ferrari 
</p>
<p>R&#233;f&#233;rences 
COMBETTES B. (1998). Constructions d&#233;tach&#233;es en fran&#231;ais. Ophrys Collection L&#8217;essentiel 
Fran&#231;ais. 
ESULI A., SEBASTIANI F. (2006). Sentiwordnet: A publicly available lexical resource for 
opinion mining. In Proceedings of LREC-06. 
FERRARI S., MATHET Y., CHARNOIS T, LEGALLOIS D. (2008). Analyse d&#8217;opinion : discours 
&#233;valuatif et classification de documents &#8211; Retour d&#8217;exp&#233;rience sur deux approches. Actes 
d&#8217;INFORSID&#8217;08 - FODOP&#8217;08. 23-36. 
GUIMIER C. (1996). Les adverbes du fran&#231;ais. Ophrys Collection L&#8217;essentiel Fran&#231;ais. 
HARB A., DRAY G., PLANTI&#201; M., PONCELET P., ROCHE M., TROUSSET F.  (2008). D&#233;tection 
d&#8217;Opinion : Apprenons les bons Adjectifs ! Actes d&#8217;INFORSID&#8217;08 - FODOP&#8217;08. 59-66. 
HU M., LIU B. (2004). Mining Opinion Features in Customer Reviews. In Proceedings of 
Nineteeth National Conference on Artificial Intelligence (AAAI-2004). 
JACKIEWICZ A. (soumis). L&#8217;&#233;valuation &#224; la p&#233;riph&#233;rie du pr&#233;dicat : constructions, lexiques et 
relations s&#233;mantiques. 28e Colloque Lexique Grammaire, Bergen 2009. 
LEGALLOIS D., FERRARI S. (2006). Vers une grammaire de l&#8217;&#233;valuation des objets culturels. In 
Actes d&#8217;ISDD06, Schedae, 2006:1. Presses Universitaires de Caen. 
MARCOUL F., ATHAYDE A. (2008). La d&#233;tection automatique de l&#8217;opinion : contraintes et 
enjeux. Actes d&#8217;INFORSID&#8217;08 - Atelier FODOP&#8217;08. 1-8. 
MARTIN J.R., WHITE P.R.R. (2005). The Language of Evaluation, Appraisal in English, 
Palgrave Macmillan, London &amp; New York. 
PANG B., LEE L. (2004). A sentimental education: Sentiment analysis using subjectivity 
summarization based on minimum cuts. Proceedings of the 42nd Annual Meeting of the ACL. 
READ J., HOPE D., CARROLL J. (2007). Annotating Expressions of Appraisal in English. 
Proceedings of the Linguistic Annotation Workshop. ACL. 
SCHMID H. (1994). Probabilistic Part-off Speech Tagging Using Decision Trees. Proceedings 
of the First International Conference on New Methods in Natural Language Processing 
(NemLap-94). 44-49. 
TURNEY P.D. (2002). Thumbs up or thumbs down? semantic orientation applied to 
unsupervised classification of reviews. Proceedings of the 40th Annual Meeting of the ACL. 
VERNIER M. ET FERRARI S. (2007). Tracking evaluation in discourse. Proceedings of ASOS07, 
Workshop on Applications of Semantics, Opinions and Sentiments. 
WIEBE J., WILSON T., CARDIE C. (2005). Annotating Expressions of Opinions and Emotions 
in Language. Language Resources and Evaluation 39, issue 2-3. 
WHITELAW C., GARG N., ARGAMON S. (2005). Using appraisal taxonomies for sentiment 
analysis. Proceedings of MCLC-05, the 2nd Midwest Computational Linguistic Colloquium. 
WIDL&#214;CHER A., BILHAUT F. (2006). LinguaStream: An Integrated Environment for 
Computational Linguistics Experimentation. Proceedings of EACL 2006, the 11th Conference 
of the European Chapter of the Association of Computational Linguistics. 95&#8211;98. 
YU H., HATZIVASSILOGLOU V. (2003). Towards Answering Opinion Questions: Separating 
Facts from Opinions and Identifying the Polarity of Opinion Sentences. Proceedings of the 
2003 Conference on Empirical Methods in Natural Language Processing (EMNLP 2003). </p>

</div></div>
</body></html>