<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Amener des utilisateurs &#224; cr&#233;er et &#233;valuer des paraphrases par le jeu</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Amener des utilisateurs &#224; cr&#233;er et &#233;valuer
des paraphrases par le jeu
</p>
<p>Houda Bouamor, Aur&#233;lien Max, Anne Vilnat
{prenom.nom}@limsi.fr
</p>
<p>LIMSI-CNRS et Universit&#233; Paris-Sud 11 Orsay, France
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons une application sur le web pour l&#8217;acquisition
de paraphrases phrastiques et sous-phrastiques sous forme de jeu. L&#8217;application permet l&#8217;ac-
quisition &#224; la fois de paraphrases et de jugements humains multiples sur ces paraphrases, ce
qui constitue des donn&#233;es particuli&#232;rement utiles pour les applications du TAL bas&#233;es sur les
ph&#233;nom&#232;nes paraphrastiques.
</p>
<p>Abstract. In this article, we present a web application presented as a game for acquiring
sentencial and phrasal paraphrases. It can be used both to acquire paraphrases and important
quantities of human evaluations of their quality. These are particularly useful for NLP applica-
tions relying on paraphrasing.
</p>
<p>Mots-cl&#233;s : Paraphrase, acquisition de donn&#233;es, &#233;valuation de donn&#233;es.
Keywords: Paraphrasing, data acquisition, data evaluation.
</p>
<p>1 Introduction
</p>
<p>L&#8217;acquisition de donn&#233;es est un des probl&#232;mes majeurs du TAL. La cr&#233;ation manuelle de res-
sources requiert un effort consid&#233;rable en termes de financement et de suivi de l&#8217;annotation.
L&#8217;acquisition automatique de donn&#233;es, telles que des bases terminologiques, requiert des algo-
rithmes difficiles &#224; concevoir, parfois des donn&#233;es annot&#233;es permettant d&#8217;amorcer un apprentis-
sage, et une validation des donn&#233;es obtenues. Le faible volume de donn&#233;es annot&#233;es de fa&#231;on
fiable est souvent un frein &#224; la recherche exp&#233;rimentale. Une solution essay&#233;e dans le domaine
du TAL consiste &#224; formuler le probl&#232;me d&#8217;acquisition et d&#8217;&#233;valuation de donn&#233;es sous forme
d&#8217;un jeu auquel des utilisateurs seront pr&#234;ts &#224; prendre part. Ainsi, par exemple, le site web
JeuxDeMots (Lafourcade, 2008), qui r&#233;alise une acquisition de relations entre termes, conna&#238;t
un certain succ&#232;s. Le domaine de la reconnaissance et de la g&#233;n&#233;ration de paraphrases manque
cruellement de donn&#233;es, et les moyens d&#8217;&#233;valuation actuellement utilis&#233;s se basent soit sur des
proc&#233;dures d&#8217;&#233;valuations humaines sp&#233;cifiques et co&#251;teuses en temps (Max, 2008), soit sur des
corpus de r&#233;f&#233;rence extr&#234;mement restreints (Cohn et al., 2008).
Dans cet article, nous pr&#233;sentons une application web bas&#233;e sur un jeu visant &#224; obtenir d&#8217;utili-
sateurs non seulement des paraphrases au niveau phrastique et sous-phrastique, mais &#233;galement
leur &#233;valuation, et ce &#224; grand volume. Le mode principal du jeu se pr&#233;sente sous forme d&#8217;une
am&#233;lioration collaborative et comp&#233;titive d&#8217;articles ou de parties d&#8217;articles de l&#8217;encyclop&#233;die
en ligne Wikipedia. Dans un premier temps, chaque phrase doit &#234;tre r&#233;&#233;crite par chaque joueur
inscrit &#224; une partie. Dans un deuxi&#232;me temps, les joueurs &#233;valuent les paraphrases et les valident</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H. Bouamor, A. Max et A. Vilnat
</p>
<p>de plusieurs mani&#232;res possibles. Un jugement consensuel positif sur des parties de phrases pro-
pos&#233;es par un joueur m&#232;ne &#224; l&#8217;attribution de points pour celui-ci. Le r&#233;sultat d&#8217;une partie est
double : du point de vue utilisateur, les joueurs ont propos&#233; des reformulations qui leur sem-
blaient appropri&#233;es, et ont r&#233;colt&#233; un nombre de points d&#233;pendant du jugement collectif de leurs
propositions ; du point de vue administrateur, des paraphrases ont &#233;t&#233; collect&#233;es et associ&#233;es &#224;
un jugement humain sur leur qualit&#233; dans un contexte particulier.1
</p>
<p>2 Acquisition de paraphrases phrastiques
</p>
<p>La premi&#232;re phase permet au joueur de s&#8217;inscrire &#224; une partie correspondant &#224; un article ou &#224;
une partie d&#8217;article sp&#233;cifique puis de proposer, pendant une p&#233;riode fix&#233;e , des reformulations
pour chacune des phrases constituant le texte. L&#8217;interface permet une &#233;dition phrase &#224; phrase
dans des zones textuelles ind&#233;pendantes. L&#8217;objectif du jeu fait qu&#8217;un joueur a un int&#233;r&#234;t fort &#224;
essayer de faire des propositions plut&#244;t qu&#8217;&#224; reprendre des phrases telles quelles, puisque ce
dernier cas ne peut mener &#224; l&#8217;attribution de points. Des &#233;l&#233;ments d&#233;terminants pour assurer la
participation de joueurs incluent le fait que les parties soient courtes et facilement interruptibles,
qu&#8217;elles portent sur des textes courts pour lesquels un r&#233;el besoin de r&#233;&#233;criture existe, et que
l&#8217;&#233;valuation entre joueurs soit per&#231;ue comme ludique (en particulier, la d&#233;finition de ce qui rend
une paraphrase meilleure qu&#8217;une autre &#233;mergera du jugement des joueurs eux-m&#234;mes). Une
&#233;tude pr&#233;liminaire a permis d&#8217;obtenir des jeux de reformulations pour des paragraphes issus
de Wikipedia, qui montrent qu&#8217;avec des contraintes de r&#233;&#233;criture assez libres, il est possible
d&#8217;obtenir une grande variabilit&#233; dans les propositions soumises (cf. Figure 1). En outre, ce type
d&#8217;interface peut &#233;galement servir &#224; des acquisitions cibl&#233;es pour des fragments de texte et/ou
des contextes particuliers, si l&#8217;on propose des textes qui les contiennent.
</p>
<p>3 &#201;valuation de paraphrases phrastiques et sous-phrastiques
Apr&#232;s une p&#233;riode sp&#233;cifi&#233;e, il devient possible &#224; des joueurs, qui n&#8217;ont pas n&#233;cessairement
pris part &#224; la premi&#232;re phase, de participer &#224; l&#8217;&#233;valuation d&#8217;une partie. Puisqu&#8217;un joueur doit
juger plusieurs reformulations par phrase, il est important de limiter la quantit&#233; de phrases &#224;
lire et &#224; &#233;valuer en le dispensant d&#8217;avoir &#224; formuler plusieurs fois un jugement sur des &#233;l&#233;ments
communs. Un mode d&#8217;interaction dit de &#8220;graphe syntaxique&#8221; permet ainsi de visualiser les
paraphrases &#224; &#233;valuer sous forme d&#8217;un graphe dirig&#233; acyclique, comme illustr&#233; sur la Figure 1.
Le graphe est obtenu par un algorithme de fusion/r&#233;duction guid&#233; par la structure syntaxique
inspir&#233; de (Pang et al., 2003). Un chemin complet dans le graphe correspond soit &#224; la proposition
d&#8217;un joueur, soit &#224; une proposition in&#233;dite.
Dans ce mode, le joueur doit explicitement valider certains arcs (en gras sur la figure, les n&#339;uds
color&#233;s indiquant des transitions dont tous les segments entrants et sortants ont &#233;t&#233; valid&#233;s). La
quantit&#233; de mots de la proposition d&#8217;un joueur appartenant &#224; des arcs valid&#233;s m&#232;ne &#224; un nombre
de points proportionnel, avec une r&#233;compense particuli&#232;re dans le cas o&#249; toute une phrase serait
valid&#233;e. Les reformulations acquises au niveau phrastique et sous-phrastique en contexte pour-
ront obtenir des &#233;valuations d&#233;pendant du nombre de jugements positifs rapport&#233;s au nombre
de jugements total. En outre, ne seront pas pris en compte les jugements correspondant &#224; des
</p>
<p>1Il est en outre possible de soumettre, apr&#232;s r&#233;vision, le meilleur texte obtenu pour publication dans Wikipedia.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amener des utilisateurs &#224; cr&#233;er et &#233;valuer des paraphrases par le jeu
</p>
<p>  
</p>
<p>sa  pet i te  ta i l le  e t  son
 
</p>
<p>aspec t  ch&#233; t i f
</p>
<p>a p p a r e n c e  c h &#233; t i v e
 
</p>
<p>ind iquent
</p>
<p>a m &#232; n e n t  &#224;  p e n s e r
</p>
<p>l a i s sen t  &#224;  pense r
m o n t r e n t  
</p>
<p>ne  pe rmet t en t  pas  de  l e  c l a s se r  pa rmi  l e s  adu l t e s
</p>
<p> qu&#8217;il
</p>
<p> 
</p>
<p>q u e
 
</p>
<p>n&#8217;es t  pas  un
</p>
<p>n&#8217;a  pas  a t te int  l &#8217;&#226;ge
</p>
<p> 
</p>
<p>Tintin n&#8217;est  pas un
ce  n &#8217;es t  pas  un
</p>
<p>a d u l t e
</p>
<p>a d u l t e
</p>
<p>FIG. 1 &#8211; Exemple de &#8220;graphe syntaxique&#8221; pour la validation de 5 paraphrases pour la phrase :
&#171; Ce n&#8217;est pas un adulte, comme le laisse &#224; penser sa petite taille et son aspect ch&#233;tif . &#187;
</p>
<p>propositions faites par l&#8217;&#233;valuateur lui-m&#234;me, ainsi que les jugements de joueurs n&#8217;ayant pas
acquis le statut de &#8220;joueurs certifi&#233;s&#8221;, statut accord&#233; lorsqu&#8217;un joueur a montr&#233; des jugements
suffisamment proches en moyenne de ceux des autres joueurs sur un certain nombre de parties.
&#192; l&#8217;issue de cette deuxi&#232;me phase, les joueurs peuvent consulter les &#233;valuations concernant
leurs propres propositions et celles obtenant les meilleurs r&#233;sultats, ainsi que confronter leurs
jugements &#224; ceux des autres &#233;valuateurs. Diff&#233;rents classements (nombre de parties gagn&#233;es,
nombre moyens de points par partie, moyenne des points des dix meilleures parties, nombres
de phrases compl&#232;tes retenues, etc.) sont accessibles et ont pour objectif de stimuler l&#8217;int&#233;r&#234;t
des joueurs et de les inciter &#224; rejouer.
</p>
<p>4 Discussion et conclusions
</p>
<p>Les &#233;l&#233;ments cl&#233;s du type d&#8217;application que nous avons pr&#233;sent&#233;e consiste en l&#8217;obtention d&#8217;une
grande quantit&#233; de donn&#233;es associ&#233;es &#224; des jugements humains consensuels. Comme cela a d&#233;j&#224;
&#233;t&#233; propos&#233; (Lafourcade, 2008), un jeu en ligne peut remplir ces objectifs. Cependant, l&#8217;appli-
cation pr&#233;sent&#233;e permet &#233;galement de mettre en place des campagnes d&#8217;acquisition de donn&#233;es
ou d&#8217;&#233;valuation de syst&#232;mes automatiques cibl&#233;es. Le jeu sera dans un premier temps propos&#233;
pour le fran&#231;ais. Un des premiers usages que nous envisageons concerne l&#8217;acquisition de re-
formulations locales annot&#233;es comme &#233;tant des paraphrases ou non, qui seront utilis&#233;es comme
une base d&#8217;exemples pour un apprentissage supervis&#233; de classifieurs pour l&#8217;extraction de pa-
raphrases depuis les r&#233;visions de Wikipedia, qui correspond &#224; un travail en cours. Une autre
utilisation concernera la r&#233;&#233;criture automatique d&#8217;&#233;nonc&#233;s pour la traduction automatique et la
recherche d&#8217;information par exploitation de paraphrases acquises depuis des sources h&#233;t&#233;ro-
g&#232;nes. Enfin, les donn&#233;es produites seront r&#233;guli&#232;rement mises &#224; disposition de la communaut&#233;
afin d&#8217;aider la recherche sur les ph&#233;nom&#232;nes paraphrastiques et leur &#233;valuation.
</p>
<p>R&#233;f&#233;rences
COHN T., CALLISON-BURCH C. &amp; LAPATA M. (2008). Constructing corpora for the deve-
lopment and evaluation of paraphrase systems. Computational Linguistics, 34(4).
LAFOURCADE M. (2008). JeuxDeMots : un prototype ludique pour l&#8217;&#233;mergence de relations
entre termes. In Actes de JADT, Lyon, France.
MAX A. (2008). G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision. In
Proceedings of TALN, Avignon, France.
PANG B., KNIGHT K. &amp; MARCU D. (2003). Syntax-based alignment of multiple transla-
tions : Extracting paraphrases and generating new sentences. In Proceedings of NAACL/HLT,
Edmonton, Canada.</p>

</div></div>
</body></html>