<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Acquisition morphologique &#224; partir d&#8217;un dictionnaire informatis&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Acquisition morphologique
&#224; partir d&#8217;un dictionnaire informatis&#233;
</p>
<p>Nabil Hathout
Universit&#233; de Toulouse
</p>
<p>Nabil.Hathout@univ-tlse2.fr
</p>
<p>R&#233;sum&#233;. L&#8217;article propose un mod&#232;le linguistique et informatique permettant de faire
&#233;merger la structure morphologique d&#233;rivationnelle du lexique &#224; partir des r&#233;gularit&#233;s s&#233;man-
tiques et formelles des mots qu&#8217;il contient. Ce mod&#232;le est radicalement lex&#233;matique. La struc-
ture morphologique est constitu&#233;e par les relations que chaque mot entretient avec les autres
unit&#233;s du lexique et notamment avec les mots de sa famille morphologique et de sa s&#233;rie d&#233;ri-
vationnelle. Ces relations forment des paradigmes analogiques. La mod&#233;lisation a &#233;t&#233; test&#233;e sur
le lexique du fran&#231;ais en utilisant le dictionnaire informatis&#233; TLFi.
</p>
<p>Abstract. The paper presents a linguistic and computational model aiming at making the
morphological structure of the lexicon emerge from the formal and semantic regularities of the
words it contains. The model is word-based. The proposed morphological structure consists of
(1) binary relations that connect each headword with words that are morphologically related,
and especially with the members of its morphological family and its derivational series, and
of (2) the analogies that hold between the words. The model has been tested on the lexicon of
French using the TLFi machine readable dictionary.
</p>
<p>Mots-cl&#233;s : Morphologie d&#233;rivationnelle, morphologie lex&#233;matique, similarit&#233; morpho-
logique, analogie formelle.
</p>
<p>Keywords: Derivational morphology, word-based morphology, morphological re-
latedness, formal analogy.
</p>
<p>1 Introduction
</p>
<p>L&#8217;objectif de cet article est d&#8217;apporter quelques &#233;l&#233;ments de r&#233;ponse &#224; la question suivante :
Comment r&#233;aliser une analyse morphologique d&#233;rivationnelle dans le cadre d&#8217;une morpholo-
gie lex&#233;matique, c&#8217;est-&#224;-dire sans recourir aux notions de morph&#232;me, d&#8217;affixe ni d&#8217;exposant
morphologique ?
</p>
<p>Cette &#233;tude, encore exploratoire, s&#8217;inscrit dans le cadre d&#8217;une th&#233;orie morphologique et d&#8217;un
mod&#232;le informatique en cours de co-&#233;laboration (section 1). Elle porte sur une mesure de si-
milarit&#233; morphologique (section 3) et une m&#233;thode d&#8217;acquisition de relations d&#233;rivationnelles
(section 4), deux composants fondamentaux d&#8217;un syst&#232;me qui permettra &#224; terme de cr&#233;er un
r&#233;seau morphologique global &#224; partir de ressources lexicographiques et de corpus. Nous pr&#233;-
sentons &#233;galement quelques r&#233;sultats pr&#233;liminaires (section 5), une &#233;valuation d&#233;taill&#233;e de ces
deux composants &#233;tant pour l&#8217;heure pr&#233;matur&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>Th&#233;orie morphologique. Cette &#233;tude s&#8217;inscrit dans le cadre d&#8217;une th&#233;orie morphologique
lex&#233;matique dans laquelle les atomes ne sont pas des morph&#232;mes mais des mots. Dans cette
th&#233;orie, les mots n&#8217;ont pas de structure. La structure morphologique est con&#231;ue comme un
niveau d&#8217;organisation du lexique, bas&#233; sur les relations de partage de propri&#233;t&#233;s s&#233;mantiques et
formelles entre mots (Bybee, 1985). Dans la th&#233;orie propos&#233;e ici, cette structure se compose
notamment des relations morphologiques :
&#8211; entre les formes d&#8217;un m&#234;me lex&#232;me. Par exemple, la forme verbale d&#233;rivons appartient &#224;
</p>
<p>l&#8217;ensemble des formes fl&#233;chies du verbe d&#233;river, qui contient &#233;galement d&#233;rive, d&#233;riverez,
d&#233;rivaient, d&#233;riv&#233;es, d&#233;rivions, etc.
</p>
<p>&#8211; entre les formes d&#8217;une m&#234;me s&#233;rie flexionnelle. Par exemple, d&#233;rivons appartient &#224; une s&#233;rie
de formes verbales &#224; l&#8217;indicatif pr&#233;sent premi&#232;re personne du pluriel qui inclut acclimatons,
compilons, &#233;duquons, localisons, varions, etc.
</p>
<p>&#8211; entre les mots d&#8217;une m&#234;me famille morphologique. Par exemple, la famille morphologique
de d&#233;rivation contient d&#233;river, d&#233;rivable, d&#233;rivatif, d&#233;rivationnel, d&#233;rivabilit&#233;, etc.
</p>
<p>&#8211; entre les mots d&#8217;une m&#234;me s&#233;rie d&#233;rivationnelle. Par exemple, d&#233;rivation appartient &#224; une
s&#233;rie de noms en -ion qui rassemble &#233;galement compilation, &#233;ducation, variation, etc.
</p>
<p>Chacune de ces relations est int&#233;gr&#233;e &#224; un ensemble d&#8217;analogies permettant de la carac-
t&#233;riser sur le plan s&#233;mantique et formel. Par exemple, la relation entre d&#233;rivation et d&#233;-
rivable fait partie d&#8217;une s&#233;rie d&#8217;analogies incluant d&#233;rivation:d&#233;rivable::variation:variable 1,
d&#233;rivation:d&#233;rivable::modification:modifiable, etc. De fa&#231;on analogue, d&#233;rivation et varia-
tion entrent dans une s&#233;rie d&#8217;analogies comme d&#233;rivation:variation::d&#233;river:varier, d&#233;riva-
tion:variation::d&#233;rivationnel:variationnel, d&#233;rivation:variation::d&#233;rivable:variable.
</p>
<p>Naturellement, la morphologie ne se r&#233;duit pas &#224; cette organisation lexicale et toutes les
constructions produites par la premi&#232;re n&#8217;ont pas vocation &#224; entrer dans la seconde (par exemple,
anti petit morveux qui ne connaissent plus que le mot pikachou). Dans le reste de l&#8217;article, nous
nous int&#233;ressons uniquement &#224; la composante d&#233;rivationnelle de cette structure.
</p>
<p>Mod&#232;le informatique. La distinction entre morphologie morph&#233;matique et morphologie
lex&#233;matique se retrouve sur le plan informatique. Dans une conception morph&#233;matique, l&#8217;ana-
lyse d&#8217;un mot consiste &#224; le d&#233;couper en une s&#233;quence de morph&#232;mes (D&#233;jean, 1998; Gaussier,
1999; Schone &amp; Jurafsky, 2000; Goldsmith, 2001; Creutz &amp; Lagus, 2002; Bernhard, 2006). Par
exemple, d&#233;rivabilit&#233; est analys&#233; en [[[d&#233;riv-]V -able]A -it&#233;]N . Dans une conception lex&#233;ma-
tique, elle est de d&#233;couvrir les relations que le mot entretient avec les autres unit&#233;s du lexique.
Ces relations permettent de d&#233;terminer sa position dans le lexique, notamment d&#8217;identifier sa
famille morphologique, sa s&#233;rie d&#233;rivationnelle et les analogies auxquelles il participe. Par
exemple, on consid&#233;rera que l&#8217;analyse du mot d&#233;rivation est satisfaisante si elle le met en
relation avec un nombre suffisant d&#8217;&#233;l&#233;ments de sa famille morphologique et de sa s&#233;rie d&#233;-
rivationnelle.
</p>
<p>L&#8217;article propose une m&#233;thode originale permettant de faire &#233;merger une partie de la structure
morphologique d&#233;rivationnelle du lexique. L&#8217;apport principal de la m&#233;thode est de combiner
analogie formelle et mesure de proximit&#233; morphologique. Dans un premier temps, la simila-
rit&#233; morphologique est utilis&#233;e pour s&#233;lectionner des quadruplets de mots susceptibles d&#8217;&#234;tre
morphologiquement apparent&#233;s. Ces candidats sont ensuite filtr&#233;s au moyen de l&#8217;analogie. Ces
deux techniques sont compl&#233;mentaires : les voisinages morphologiques peuvent &#234;tre calcul&#233;s
</p>
<p>1. Nous notons a : b :: c : d le fait que (a, b, c, d) forme un quadruplet analogique, c&#8217;est-&#224;-dire que a est &#224; b ce
que c est d.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition morphologique &#224; partir d&#8217;un dictionnaire informatis&#233;
</p>
<p>en grand nombre, mais ils sont trop grossiers pour discriminer entre les mots qui sont effective-
ment morphologiquement apparent&#233;s et ceux qui ne le sont pas ; l&#8217;analogie formelle permet un
filtrage fin mais elle est co&#251;teuse &#224; calculer. La m&#233;thode a &#233;t&#233; test&#233;e en utilisant le Tr&#233;sor de la
Langue Fran&#231;aise informatis&#233; 2 (TLFi).
</p>
<p>Les caract&#233;ristiques principales de notre mod&#232;le sont (1) que la d&#233;couverte de relations mor-
phologiques entre les mots ne fait intervenir &#224; aucun moment la notion de morph&#232;me ni aucune
repr&#233;sentation de morph&#232;me ; (2) qu&#8217;il int&#232;gre de mani&#232;re uniforme les informations s&#233;man-
tiques et formelles ; (3) que l&#8217;appartenance aux familles et aux s&#233;ries est graduelle, permettant
par exemple de rendre compte du fait que d&#233;riveur est morphologiquement et s&#233;mantiquement
plus proche de d&#233;rive que ne l&#8217;est d&#233;rivationnellement, bien que les trois mots appartiennent
clairement &#224; la m&#234;me famille morphologique. Le mod&#232;le permet d&#8217;articuler la repr&#233;sentation
du lexique sous la forme d&#8217;un graphe et son exploitation au moyen de parcours al&#233;atoires dans
la lign&#233;e des travaux de Gaume (2002), avec les travaux sur l&#8217;analogie formelle entre cha&#238;nes de
caract&#232;res (Lepage, 1998; Stroppa &amp; Yvon, 2005; Langlais &amp; Patry, 2007) dont les algorithmes
ne font pas intervenir la notion de morph&#232;me.
</p>
<p>2 Travaux connexes
</p>
<p>Un grand nombre de recherches en morphologie informatique visent &#224; d&#233;couvrir des relations
entre des unit&#233;s lexicales. Toutes s&#8217;appuient en premier lieu sur les similarit&#233;s entre les formes
graph&#233;miques des mots. Ces relations sont g&#233;n&#233;ralement pr&#233;fixales et / ou suffixales. Deux
exceptions peuvent &#234;tre signal&#233;es : (Yarowsky &amp; Wicentowski, 2000) et (Baroni et al., 2002)
utilisent les distances d&#8217;&#233;dition pour estimer la similarit&#233; formelle des mots. &#192; notre connais-
sance, tous les autres r&#233;alisent d&#8217;une fa&#231;on ou d&#8217;une autre une segmentation, y compris celles
comme (Neuvel &amp; Fulop, 2002) dont l&#8217;objectif n&#8217;est pas de d&#233;couvrir des morph&#232;mes. Notre
mod&#232;le se distingue de ces approches par le fait que la proximit&#233; graph&#233;mique est estim&#233;e sans
segmentation, de fa&#231;on globale, &#224; l&#8217;&#233;chelle de la totalit&#233; du lexique.
</p>
<p>Notre m&#233;thode peut &#234;tre &#233;galement compar&#233;e aux approches qui combinent indices formels et
s&#233;mantiques. Ces derniers sont g&#233;n&#233;ralement acquis &#224; partir de corpus en utilisant, par exemple,
l&#8217;analyse s&#233;mantique latente comme (Schone &amp; Jurafsky, 2000), l&#8217;information mutuelle comme
(Baroni et al., 2002) ou la co-occurrence &#224; l&#8217;int&#233;rieur d&#8217;une fen&#234;tre de mots comme (Xu &amp;
Croft, 1998; Zweigenbaum &amp; Grabar, 2003). Notre approche s&#8217;en distingue par le fait que nous
utilisons une ressource lexicographique et que les similarit&#233;s s&#233;mantiques sont &#233;tablies sur la
base de parcours al&#233;atoires dans un graphe lexical. Notre proposition peut &#234;tre rapproch&#233;e de
celle de (Hathout, 2002) qui utilise un dictionnaire de synonymes ou de (Claveau &amp; L&#8217;Homme,
2005) qui &#233;tablissent des relations morphologiques au sein d&#8217;une terminologie.
</p>
<p>3 Similarit&#233; morphologique
</p>
<p>Nous adoptons ici une d&#233;finition classique de la parent&#233; morphologique : deux mots sont mor-
phologiquement apparent&#233;s s&#8217;ils partagent &#224; la fois des propri&#233;t&#233;s phonologiques et s&#233;man-
tiques. Le TLFi ne fournissant pas la prononciation de toutes les entr&#233;es, nous utilisons les pro-
</p>
<p>2. atilf.atilf.fr/tlf.htm</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>pri&#233;t&#233;s graph&#233;miques &#224; la place des propri&#233;t&#233;s phonologiques 3. La similarit&#233; morphologique
est estim&#233;e en utilisant un bigraphe qui contient un ensemble de sommets qui repr&#233;sentent les
lex&#232;mes et un autre de sommets qui repr&#233;sentent leurs propri&#233;t&#233;s formelles et s&#233;mantiques (voir
figure 1).
</p>
<p>$or
</p>
<p>$ori
</p>
<p>orient
</p>
<p>entati
</p>
<p>N.action_X.de
</p>
<p>N.r&#233;sultat_X.de_X.ce
</p>
<p>N.orientation
</p>
<p>V.orienter
</p>
<p>A.original
</p>
<p>N.fermentation
</p>
<p>N.pointage
</p>
<p>FIGURE 1 &#8211; Extrait du bigraphe qui repr&#233;sente le lexique. Les lex&#232;mes se trouvent dans des
ovales, les traits formels par des octogones et les traits s&#233;mantiques par des rectangles. Le
graphe est sym&#233;trique.
</p>
<p>Les traits formels associ&#233;s &#224; un lex&#232;me sont les n-grammes de lettres qui apparaissent dans son
lemme. Nous imposons aux n-grammes une taille minimale (n &#8805; 3). Le d&#233;but et la fin des
lemmes sont marqu&#233;s par des $. La figure 2 pr&#233;sente une partie des n-grammes associ&#233;s au mot
orientation. Signalons que dans cette description aucun n-grammes n&#8217;a le statut de morph&#232;me.
Tous les n-grammes jouent le m&#234;me r&#244;le. Leur seule fonction est de rapprocher les mots qui
contiennent les m&#234;mes sons.
</p>
<p>$orientation$ $orientation orientation$ $orientatio orientation
rientation$ $orientati orientatio rientation ientation$ &#183; &#183; &#183; $ori
orie rien ient enta ntat tati atio tion ion$ $or ori rie ien ent nta tat
ati tio ion on$
</p>
<p>FIGURE 2 &#8211; Liste partielle des traits formels associ&#233;s au mot orientation.
</p>
<p>De fa&#231;on similaire, les traits s&#233;mantiques qui d&#233;crivent un lex&#232;me sont les n-grammes de mots
qui apparaissent dans ses d&#233;finitions. Les n-grammes qui contiennent des ponctuations sont &#233;li-
min&#233;s. Par exemple, les traits s&#233;mantiques induits par la d&#233;finition action d&#8217;orienter, de s&#8217;orien-
ter ; r&#233;sultat de cette action du lex&#232;me orientation sont pr&#233;sent&#233;s en figure 3. Les mots des
d&#233;finitions sont cat&#233;goris&#233;s et lemmatis&#233;s. Les &#233;tiquettes utilis&#233;es sont : A pour les adjectifs ;
R pour les adverbes ; N pour les noms ; V pour les verbes ; X pour toutes les autres cat&#233;gories.
Cette repr&#233;sentation tr&#232;s grossi&#232;re de la s&#233;mantique des mots est inspir&#233;e des segments r&#233;p&#233;-
t&#233;s (Lebart et al., 1998). Elle pr&#233;sente plusieurs avantages : (1) elle est fortement redondante,
pour capter les ressemblances qui existent entre les d&#233;finitions ; (2) les n-grammes permettent
</p>
<p>3. Nous envisageons de reprendre l&#8217;exp&#233;rience pr&#233;sent&#233;e ici en utilisant des repr&#233;sentations phonologiques
calcul&#233;es par LliaPhon (B&#233;chet, 2001).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition morphologique &#224; partir d&#8217;un dictionnaire informatis&#233;
</p>
<p>d&#8217;int&#233;grer des informations de nature syntagmatique sans r&#233;aliser une v&#233;ritable analyse syn-
taxique des d&#233;finitions ; (3) elle gomme l&#233;g&#232;rement les variations qui existent dans le traitement
lexicographique des mots, notamment dans les d&#233;coupages en sous-sens et la formulation des
d&#233;finitions.
</p>
<p>N.action_X.de_V.orienter N.action_X.de X.de_V.orienter N.action
X.de V.orienter X.de_V.s&#8217;orienter V.s&#8217;orienter N.r&#233;sultat_
X.de_X.ce_N.action N.r&#233;sultat_X.de_X.ce X.de_X.ce_N.action
N.r&#233;sultat_X.de X.de_X.ce X.ce_N.action N.r&#233;sultat X.ce
</p>
<p>FIGURE 3 &#8211; Traits s&#233;mantiques induits par la d&#233;finition action d&#8217;orienter, de s&#8217;orienter ; r&#233;sultat
de cette action.
</p>
<p>Le bigraphe est construit en connectant de fa&#231;on sym&#233;trique chaque mot &#224; l&#8217;ensemble de ses
traits formels et s&#233;mantiques (voir figure 1). La structure de graphe bipartie n&#8217;est pas essentielle
mais elle est utile car elle permet de propager de fa&#231;on synchrone une activation dans les sous-
graphes formel et s&#233;mantique.
</p>
<p>Parcours al&#233;atoires. La similarit&#233; morphologique est estim&#233;e en propageant une activation
dans le bigraphe un nombre pair de fois. Dans un graphe fortement redondant comme celui
que nous venons de d&#233;crire, une propagation de longueur 2 (des mots vers les traits puis des
traits vers les mots) permet d&#8217;obtenir les proximit&#233;s vis&#233;es. La propagation est simul&#233;e par
des parcours al&#233;atoires et calcul&#233;e de fa&#231;on classique en multipliant la matrice d&#8217;adjacence
stochastique du graphe (Gaume et al., 2002; Muller et al., 2006).
</p>
<p>Dans l&#8217;exemple de la figure 1, les voisins morphologiques du mot orientation sont identifi&#233;s
en g&#233;n&#233;rant une activation au niveau du sommet qui repr&#233;sente ce mot. Lors de la premi&#232;re
&#233;tape, l&#8217;activation est propag&#233;e vers l&#8217;ensemble des sommets qui repr&#233;sentent les traits formels
et s&#233;mantiques de orientation. Lors de la deuxi&#232;me &#233;tape, l&#8217;activation qui se trouve au niveau
des traits est propag&#233;e vers les mots. Ainsi orienter se trouve activ&#233; via les traits formels $or,
$ori, orien et fermentation par l&#8217;interm&#233;diaire du trait formel entati et du trait s&#233;man-
tique N.r&#233;sultat_X.de_X.ce. L&#8217;activation que l&#8217;on r&#233;cup&#232;re au niveau de chaque mot est
d&#8217;autant plus grande que le nombre de traits qu&#8217;il partage avec orientation est &#233;lev&#233; et que ces
traits sont sp&#233;cifiques (i.e. peu fr&#233;quents). L&#8217;hypoth&#232;se sous-jacente est que le niveau d&#8217;activa-
tion est une estimation du degr&#233; de parent&#233; morphologique.
</p>
<p>Voisinage lexical dans le graphe du TLFi. Le graphe que nous utilisons est construit &#224; partir
des entr&#233;es et des d&#233;finitions du TLFi. Nous en avons &#233;limin&#233; celles qui concernent des emplois
non standards (archa&#239;ques, argotiques, etc.). Le bigraphe est ainsi cr&#233;&#233; &#224; partir de 225 529 d&#233;-
finitions d&#233;crivant 75 024 entr&#233;es. Nous avons supprim&#233; les traits qui n&#8217;apparaissent que dans
un mot. On r&#233;duit ainsi fortement la taille du graphe sans modifier les connexions qui s&#8217;&#233;ta-
blissent entre les mots. On voit dans le tableau 1 que l&#8217;&#233;lagage est plus fort pour les propri&#233;t&#233;s
s&#233;mantiques qu&#8217;il ne l&#8217;est pour les propri&#233;t&#233;s formelles.
</p>
<p>La figure 4 illustre l&#8217;utilisation du graphe. Elle pr&#233;sente les 30 premiers voisins du verbe fructi-
fier pour diff&#233;rentes configurations de propagation. On voit en (a) que les membres de la famille
morphologique tendent &#224; &#234;tre plus proches que ceux de la s&#233;rie d&#233;rivationnelle, en l&#8217;occurrence
les verbes en -ifier. On constate &#233;galement en comparant (a) et (b), que les traits formels sont
les plus pr&#233;dictifs et que les traits s&#233;mantiques sont les moins fiables.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>traits complet r&#233;duit hapax
formels 1 306 497 400 915 69%
s&#233;mantiques 7 650 490 548 641 93%
total 8 956 987 949 556 90%
</p>
<p>TABLE 1 &#8211; Nombre des traits formels et s&#233;mantiques issus du TLFi. La premi&#232;re colonne in-
dique le nombre initial des traits, la deuxi&#232;me, le nombre des traits associ&#233;es &#224; deux mots ou
plus et la derni&#232;re, le taux de r&#233;duction.
</p>
<p>(a) V.fructifier N.fructification A.fructificateur A.fructifiant A.fructif&#232;re V.sanctifier
V.rectifier A.rectifier V.fructidoriser N.fructidorien N.fructidor N.fructuosit&#233;
R.fructueusement A.fructueux N.rectifieur A.obstructif A.instructif A.destructif
A.constructif N.infructuosit&#233; R.infructueusement A.infructueux V.transsubstantifier
V.substantifier V.stratifier V.schistifier V.savantifier V.refortifier V.ratifier V.quantifier
</p>
<p>(b) V.fructifier V.trouver N.missionnaire N.mission A.missionnaire N.saisie N.police N.hangar
N.d&#238;me N.ban V.affruiter N.melon N.saisonnement N.az&#233;darach A.fruitier A.bif&#232;re
V.saisonner N.roman N.troubadour V.contaminer N.conductibilit&#233; N.alevinage V.profiter
A.fructifiant N.pouvoir V.agir N.op&#233;ration V.placer N.rentabilit&#233; N.jouissance
</p>
<p>(c) V.fructifier A.fructifiant N.fructification A.fructificateur V.trouver A.fructif&#232;re
V.rectifier V.sanctifier A.rectifier V.fructidoriser N.fructidor N.fructidorien N.missionnaire
N.mission A.missionnaire A.fructueux R.fructueusement N.fructuosit&#233; N.rectifieur
N.saisie N.police N.hangar N.d&#238;me N.ban A.fruitier V.affruiter A.instructif A.obstructif
A.destructif A.constructif
</p>
<p>FIGURE 4 &#8211; Les 30 voisins les plus proches du verbe fructifier lorsque l&#8217;on utilise (a) seule-
ment les traits formels, (b) seulement les traits s&#233;mantiques et (c) &#224; la fois les traits formels et
s&#233;mantiques. Les mots qui appartiennent &#224; la famille ou &#224; la s&#233;rie de fructifier sont en gras.
</p>
<p>4 Analogies
</p>
<p>Les &#233;l&#233;ments des s&#233;ries et des familles sont massivement impliqu&#233;s dans les analogies qui struc-
turent le lexique. Par exemple, le couple (fructifier, fructification) forme des analogies avec plu-
sieurs couples compos&#233;s d&#8217;&#233;l&#233;ments des s&#233;ries de fructifier et de fructification comme (rectifier,
rectification), (certifier, certification), (plastifier, plastification), etc. De fa&#231;on duale, fructifier
et sanctifier forment des analogies avec les membres de leurs familles respectives comme (fruc-
tificateur, sanctificateur), (fructification, sanctification) ou (fructifiant, sanctifiant).
</p>
<p>Les analogies permettent de filtrer efficacement les voisinages morphologiques. Si v est un
voisin morphologique correct de m, c&#8217;est soit un &#233;l&#233;ment de la famille de m, soit un &#233;l&#233;ment
de sa s&#233;rie. Il existe alors un autre voisin v&#8242; de m (v&#8242; appartient &#224; la famille de m si v appartient
&#224; la s&#233;rie de m ou vice versa) tel qu&#8217;il existe w voisin de v et de v&#8242; tel que m : v :: v&#8242; : w 4. Il
n&#8217;existe ainsi que deux configurations possibles :
</p>
<p>1. si v &#8712; Fm, alors &#8707;v&#8242; &#8712; Sm,&#8707;w &#8712; Sv &#8745; Fv&#8242; ,m : v :: v&#8242; : w
2. si v &#8712; Sm, alors &#8707;v&#8242; &#8712; Fm,&#8707;w &#8712; Fv &#8745; Sv&#8242; ,m : v :: v&#8242; : w
</p>
<p>o&#249; Fx repr&#233;sente la famille de x et Sx sa s&#233;rie. La configuration 1 est illustr&#233;e par les exemples
ci-dessus avec m = fructifier et v = fructification, et la 2 avec m = fructifier et v = rectifier.
</p>
<p>4. Nous notons a : b :: c : d le fait que (a, b, c, d) forme un quadruplet analogique, c&#8217;est-&#224;-dire que a est &#224; b ce
que c est d.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition morphologique &#224; partir d&#8217;un dictionnaire informatis&#233;
</p>
<p>Analogies formelles. Une analogie formelle est une relation a : b :: c : d qui s&#8217;&#233;tablit entre
quatre formes telles que les diff&#233;rences graph&#233;miques qui existent entre a et b sont les m&#234;mes
que celles qui existent entre c et d. La figure 5 en pr&#233;sente un exemple adapt&#233; de (Lepage, 1998;
Lepage, 2003). On constate que les diff&#233;rences entre les deux premi&#232;res formes et les deux
derni&#232;res sont bien identiques.
</p>
<p>&#15; k a t a b a
ma k &#15; t ou b on
</p>
<p>&#15; f a 3 a l a
ma f &#15; 3 ou l on
</p>
<p>FIGURE 5 &#8211; Analogie formelle entre les transcriptions de quatre mots arabes, kataba:
maktoubon::fa3ala:maf3oulon. Ces mots sont respectivement la forme de citation du
verbe &#8216;&#233;crire&#8217;, du nom de r&#233;sultat &#8216;&#233;crit&#8217;, du verbe &#8216;faire&#8217; et du nom de r&#233;sultat &#8216;effet&#8217;. Les
diff&#233;rences sont situ&#233;es dans les parties encadr&#233;es.
</p>
<p>Les analogies formelles peuvent &#234;tre d&#233;finies en utilisant la notion de factorisation (Stroppa &amp;
Yvon, 2005). Soit L un alphabet et a &#8712; L? une cha&#238;ne de caract&#232;res d&#233;finie sur L. On appelle
factorisation de a de longueur n une s&#233;quence de n cha&#238;nes de caract&#232;res f1, . . . , fn dont la
concat&#233;nation est &#233;gale &#224; a. Par exemple, (ma, k, &#15;, t, ou, b, on) est une factorisation de lon-
gueur 7 de maktoubon. On peut alors d&#233;finir l&#8217;analogie formelle comme suit. Soit (a, b, c, d) &#8712;
L?4 quatre cha&#238;nes de caract&#232;res. a : b :: c : d constitue une analogie formelle ssi il existe un
entier n &#8712; N et quatre factorisations de longueur n des quatre cha&#238;nes (f(a), f(b), f(c), f(d)) &#8712;
(L?n)4 telles que &#8704;i &#8712; [1, n], (fi(b), fi(c)) &#8712; {(fi(a), fi(d)), (fi(d), fi(a)). Dans le cas de l&#8217;ana-
logie kataba:maktoubon:: fa3ala:maf3oulon, la propri&#233;t&#233; est v&#233;rifi&#233;e pour n = 7.
</p>
<p>Mise en &#339;uvre. Les analogies formelles peuvent &#234;tre v&#233;rifi&#233;es en comparant les s&#233;quences
d&#8217;op&#233;rations d&#8217;&#233;dition permettant de transformer une cha&#238;ne de caract&#232;res en une autre. Ces
s&#233;quences peuvent &#234;tre d&#233;duites simplement des tables de distances d&#8217;&#233;dition de Levenshtein
(Jurafsky &amp; Martin, 2000). Chaque s&#233;quence d&#8217;op&#233;rations permettant de transformer une pre-
mi&#232;re cha&#238;ne de caract&#232;res en une seconde correspond &#224; un parcourir dans le tableau qui part de
la derni&#232;re case et remonte jusqu&#8217;&#224; la premi&#232;re. Nous ne nous int&#233;ressons ici qu&#8217;aux s&#233;quences
de longueur minimale obtenues en s&#233;lectionnant pour chaque case la voisine de co&#251;t le plus
faible et en cas d&#8217;&#233;galit&#233;, en pr&#233;f&#233;rant la case qui se trouve sur la diagonale (substitution), et &#224;
d&#233;faut celle de gauche (insertion) puis celle du haut (suppression).
</p>
<p>La figure 6 pr&#233;sente la s&#233;quence d&#8217;op&#233;rations que l&#8217;on obtient pour le couple fructueux:
infructueusement. Cette s&#233;quence peut &#234;tre simplifi&#233;e en fusionnant les identit&#233;s conti-
gu&#235;s : ((I,&#15;,i), (I,&#15;,n), (M,fructueu,fructueu), (S,x,s), (I,&#15;,e), (I,&#15;,m), (I,&#15;,e), (I,&#15;,n),
(I,&#15;,t)). La s&#233;quence similaire pour le couple soucieux:insoucieusement est iden-
tique &#224; l&#8217;exception de la sous-s&#233;quence d&#8217;identit&#233;s : ((I,&#15;,i), (I,&#15;,n), (M,soucieu,soucieu),
(S,x,s), (I,&#15;,e), (I,&#15;,m), (I,&#15;,e), (I,&#15;,n), (I,&#15;,t)). Les deux s&#233;quences peuvent &#234;tre rendues stric-
tement identiques si ces sous-cha&#238;nes ne sont pas sp&#233;cifi&#233;es. On peut ainsi rendre compte de
l&#8217;analogie formelle fructueux:infructueusement::soucieux:insoucieusement
en associant &#224; chaque couple sa s&#233;quence comme signature d&#8217;&#233;dition (&#963;). En l&#8217;occur-
rence &#963;(fructueux,infructueusement) = &#963;(soucieux,insoucieusement) =
((I,&#15;,i), (I,&#15;,n), (M,@,@), (S,x,s), (I,&#15;,e), (I,&#15;,m), (I,&#15;,e), (I,&#15;,n), (I,&#15;,t)). Plus g&#233;n&#233;ralement,
quatre cha&#238;nes de caract&#232;res forment une analogie formelle a : b :: c : d si &#963;(a, b) = &#963;(c, d).
Insistons sur le fait que le calcul des signatures ne fait intervenir ni morph&#232;me ni repr&#233;sentation
de morph&#232;me.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>I I M M M M M M M M S I I I I I
a &#15; &#15; f r u c t u e u x &#15; &#15; &#15; &#15; &#15;
b i n f r u c t u e u s e m e n t
</p>
<p>FIGURE 6 &#8211; S&#233;quence d&#8217;op&#233;rations permettant de passer de fructueux (a) &#224;
infructueusement (b), repr&#233;sent&#233;e sous la forme d&#8217;une correspondance entre deux fac-
torisations f(a) et f(b) des deux cha&#238;nes de caract&#232;res. L&#8217;op&#233;ration correspondant &#224; un couple
(fi(a), fi(a)) est indiqu&#233;e sur la premi&#232;re ligne par I pour une insertion, D pour une suppression,
M pour une identit&#233; et S pour une substitution par un caract&#232;re diff&#233;rent.
</p>
<p>5 Premiers r&#233;sultats
</p>
<p>Nous avons impl&#233;ment&#233; le mod&#232;le informatique qui vient d&#8217;&#234;tre pr&#233;sent&#233; et r&#233;alis&#233; une premi&#232;re
exp&#233;rience consistant &#224; d&#233;terminer les 100 plus proches voisins de chaque entr&#233;e pour les trois
configurations pr&#233;sent&#233;es en figure 4, puis &#224; calculer les analogies formelles qui s&#8217;&#233;tablissent
entre cette entr&#233;e et les mots qui se trouvent dans ces voisinages. Nous avons ensuite r&#233;vis&#233;
manuellement les analogies induites par un &#233;chantillon de 22 entr&#233;es appartenant &#224; 4 familles
morphologiques de la tranche fr- du TLF 5. Une analogie a : b :: c : d est consid&#233;r&#233;e correcte
si b &#8712; Fa, c &#8712; Sa, d &#8712; Sb &#8745; Fc ou si b &#8712; Sa, c &#8712; Fa, d &#8712; Fb &#8745; Sc. Voici quelques exemples de
quadruplets corrects et erron&#233;s :
&#8211; R.fructueusement:R.affectueusement::A.infructueux:A.inaffectueux
&#8211; N.fruiterie:N.fruitier::N.laiterie:N.laitier
&#8211; * N.fruit:N.bruit::V.frusquer:V.brusquer
&#8211; * A.fruit&#233;:A.truit&#233;::N.frusquin:N.trusquin
Le premier exemple est particuli&#232;rement int&#233;ressant car il implique d&#8217;un c&#244;t&#233; des mots suffix&#233;s
et de l&#8217;autre des mots pr&#233;fix&#233;s. Les r&#233;sultats obtenus sont r&#233;sum&#233;s dans le tableau 2. On observe
que la qualit&#233; des r&#233;sultats est tr&#232;s satisfaisante, mais que la quantit&#233; des quadruplets varie
fortement en fonction du type de parcours.
</p>
<p>parcours quadruplets corrects erreur
form 169 163 3.6%
s&#233;m 5 5 0.0%
s&#233;m + form 130 128 1.5%
</p>
<p>TABLE 2 &#8211; Nombre de quadruplets acquis pour un &#233;chantillon de 22 entr&#233;es et taux d&#8217;erreur.
</p>
<p>taille 4 5 6 7 8 9 10 11 12 13 14 15 16
quadruplets 29 22 8 10 55 29 30 32 19 11 35 63 39
corrects 14 14 7 8 54 27 30 32 19 11 35 63 39
erreur (%) 51.7 36.4 12.5 20.0 1.8 6.9 0.0 0.0 0.0 0.0 0.0 0.0 0.0
</p>
<p>TABLE 3 &#8211; Nombres de quadruplets pour 13 &#233;chantillons de 5 entr&#233;es s&#233;lectionn&#233;s al&#233;atoire-
ment. Les quadruplets sont acquis dans des voisinages calcul&#233;s en utilisant &#224; la fois les traits
formels et s&#233;mantiques. Les entr&#233;es dans chaque &#233;chantillon sont de la m&#234;me taille. La taille
varie entre 4 et 16 caract&#232;res.
</p>
<p>Les performances de la m&#233;thode d&#233;pendent fortement de la longueur des entr&#233;es parce qu&#8217;elle
s&#8217;appuie avant tout sur les similarit&#233;s formelles et que ces derni&#232;res sont d&#8217;autant plus grandes
</p>
<p>5. Les entr&#233;es de cette tranche ont &#233;t&#233; class&#233;es en familles morphologiques en 1999 par Josette Lecomte et moi.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition morphologique &#224; partir d&#8217;un dictionnaire informatis&#233;
</p>
<p>que les mots sont longs. Cette corr&#233;lation appara&#238;t tr&#232;s clairement dans le tableau 3. On y voit
notamment que les quadruplets issus d&#8217;entr&#233;es de 10 caract&#232;res ou plus sont toutes correctes.
</p>
<p>6 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; un mod&#232;le informatique capable de faire &#233;merger une partie de la structure
morphologique du lexique. Ce mod&#232;le purement lex&#233;matique int&#232;gre de mani&#232;re uniforme les
propri&#233;t&#233;s s&#233;mantiques et formelles des mots au sein d&#8217;un bigraphe permettant de simuler la
propagation d&#8217;une activation dans un r&#233;seau lexical. Le niveau d&#8217;activation obtenu &#224; la suite
de la propagation permet d&#8217;identifier les voisins lexicaux de chaque entr&#233;e. On peut ensuite
retrouver parmi ces voisins les membres de la famille morphologique de l&#8217;entr&#233;e et les &#233;l&#233;ments
de sa s&#233;rie d&#233;rivationnelle en constituant des quadruplets analogiques.
</p>
<p>Cette &#233;tude pr&#233;liminaire fait partie d&#8217;un projet de constitution d&#8217;une base de donn&#233;es d&#233;di&#233;e
&#224; la description morphologique. Nous envisageons dans ce cadre de construire un r&#233;seau mor-
phologique en utilisant une m&#233;thode par bootstrap &#224; partir des entr&#233;es les plus longues. Nous
pr&#233;voyons &#233;galement de r&#233;p&#233;ter l&#8217;exp&#233;rience sur l&#8217;anglais notamment pour r&#233;aliser une &#233;valua-
tion pr&#233;cise en utilisant la base CELEX (Baayen et al., 1995).
</p>
<p>Remerciements
</p>
<p>Je remercie l&#8217;ATLIF et Jean-Marie Pierrel d&#8217;avoir mis &#224; notre disposition le TLFi. Je remer-
cie Bruno Gaume et Philippe Muller pour les nombreuses discussions que nous avons eu sur
prox et sur le nettoyage et l&#8217;exploitation du TLFi. Je suis reconnaissant &#224; Gilles Boy&#233;, Oli-
vier Haute-C&#339;ur, Ludovic Tanguy et aux trois relecteurs anonymes de TALN 2009 pour leurs
commentaires et suggestions.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BAAYEN R. H., PIEPENBROCK R. &amp; GULIKERS L. (1995). CELEX-2. Cdrom. Penn.: LDC.
</p>
<p>BARONI M., MATIASEK J. &amp; TROST H. (2002). Unsupervised discovery of morphologi-
cally related words based on orthographic and semantic similarity. In Proceedings of the ACL
Workshop on Morphological and Phonological Learning, p. 48&#8211;57, Philadelphia, Penn.: ACL.
</p>
<p>BERNHARD D. (2006). Automatic acquisition of semantic relationships from morphological
relatedness. In Advances in Natural Language Processing, volume 4139 of LNCS, p. 121&#8211;132:
Springer.
</p>
<p>BYBEE J. L. (1985). Morphology. A Study of the Relation between Meaning and Form. Am-
sterdam: John Benjamins Publishing Company.
</p>
<p>B&#201;CHET F. (2001). Lia_phon : un syst&#232;me complet de phon&#233;tisation de textes. Traitement
Automatique des Langues, 42(1), 47&#8211;67.
CLAVEAU V. &amp; L&#8217;HOMME M.-C. (2005). Structuring terminology by analogy-based machine
learning. In Proceedings of the 7th International Conference on Terminology and Knowledge
Engineering, TKE&#8217;05, Copenhague.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>CREUTZ M. &amp; LAGUS K. (2002). Unsupervised discovery of morphemes. In Proceedings
of the ACL Workshop on Morphological and Phonological Learning, p. 21&#8211;30, Philadelphia,
Penn.: ACL.
</p>
<p>D&#201;JEAN H. (1998). Morphemes as necessary concept for structures discovery from untagged
corpora. In Proceedings of the Workshop on Paradigms and Grounding in Natural Language
Learning, p. 295&#8211;299, Adelaide.
</p>
<p>GAUME B., DUVIGNEAU K., GASQUET O. &amp; GINESTE M.-D. (2002). Forms of meaning,
meaning of forms. Journal of Experimental and Theoretical Artificial Intelligence, 14(1), 61&#8211;
74.
</p>
<p>GAUSSIER E. (1999). Unsupervised learning of derivational morphology from inflectional
lexicons. In Proceedings of the ACL Workshop on Unsupervised Learning in Natural Lan-
guage Processing, University of Maryland.
</p>
<p>GOLDSMITH J. (2001). Unsupervised learning of the morphology of natural language. Com-
putational Linguistics, 27(2), 153&#8211;198.
HATHOUT N. (2002). From WordNet to CELEX: acquiring morphological links from dic-
tionaries of synonyms. In Proceedings of LREC-2002, p. 1478&#8211;1484, Las Palmas de Gran
Canaria: ELRA.
</p>
<p>JURAFSKY D. &amp; MARTIN J. H. (2000). Speech and language processing. Prentice-Hall.
</p>
<p>LANGLAIS P. &amp; PATRY A. (2007). Translating unknown words by analogical learning. In
Proceedings of EMNLP-CoNLL 2007, p. 877&#8211;886, Prague: ACL.
</p>
<p>LEBART L., SALEM A. &amp; BERRY L. (1998). Exploring textual data. Dordrecht: Kluwer
Academic Publishers.
</p>
<p>LEPAGE Y. (1998). Solving analogies on words: an algorithm. In Proceedings of COLING-
ACL&#8217;98, p. 728&#8211;735, Montr&#233;al.
</p>
<p>LEPAGE Y. (2003). De l&#8217;analogie rendant compte de la commutation en linguistique. M&#233;moire
de HDR, Universit&#233; Joseph Fourier, Grenoble.
</p>
<p>MULLER P., HATHOUT N. &amp; GAUME B. (2006). Synonym extraction using a semantic
distance on a dictionary. In Proceedings of the HLT/NAACL Workshop Textgraphs, p. 65&#8211;72,
New York, NY: ACL.
</p>
<p>NEUVEL S. &amp; FULOP S. A. (2002). Unsupervised learning of morphology without mor-
phemes. In Proceedings of the ACL Workshop on Morphological and Phonological Learning,
Philadelphia, Penn.: ACL.
</p>
<p>SCHONE P. &amp; JURAFSKY D. S. (2000). Knowledge-free induction of morphology using latent
semantic analysis. In Proceedings of CoNLL-2000, p. 67&#8211;72, Lisbonne.
</p>
<p>STROPPA N. &amp; YVON F. (2005). An analogical learner for morphological analysis. In Pro-
ceedings of CoNLL-2005, p. 120&#8211;127, Ann Arbor, Michigan: ACL.
</p>
<p>XU J. &amp; CROFT W. B. (1998). Corpus-based stemming using co-occurrence of word variants.
ACM Transaction on Information Systems, 16(1), 61&#8211;81.
YAROWSKY D. &amp; WICENTOWSKI R. (2000). Minimally supervised morphological analysis
by multimodal alignment. In Proceedings of the ACL-2000, p. 207&#8211;216, Hong Kong.
</p>
<p>ZWEIGENBAUM P. &amp; GRABAR N. (2003). Learning derived words from medical corpora. In
9th Conference on Artificial Intelligence in Medicine Europe, p. 189&#8211;198, Cyprus.</p>

</div></div>
</body></html>