<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Le projet BabyTalk : g&#233;n&#233;ration de texte &#224; partir de donn&#233;es h&#233;t&#233;rog&#232;nes pour la prise de d&#233;cision en unit&#233; n&#233;onatale</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>Le projet BabyTalk : g&#233;n&#233;ration de texte &#224; partir de donn&#233;es 
h&#233;t&#233;rog&#232;nes pour la prise de d&#233;cision en unit&#233; n&#233;onatale 
</p>
<p>Fran&#231;ois Portet (1,2), Albert Gatt (1), Jim Hunter (1), Ehud Reiter (1), 
Somayajulu Sripada (1) 
</p>
<p>(1) Department of Computing Science, University of Aberdeen, &#201;cosse  
portet@imag.fr, {a.gatt,j.hunter,e.reiter,yaji.sripada}@abdn.ac.uk 
</p>
<p>(2) LIG, UMR 5217, Universit&#233; de Grenoble, France 
</p>
<p>R&#233;sum&#233; Notre soci&#233;t&#233; g&#233;n&#232;re une masse d&#8217;information toujours croissante, que ce soit en 
m&#233;decine, en m&#233;t&#233;orologie, etc. La m&#233;thode la plus employ&#233;e pour analyser ces donn&#233;es est 
de les r&#233;sumer sous forme graphique. Cependant, il a &#233;t&#233; d&#233;montr&#233; qu'un r&#233;sum&#233; textuel est 
aussi un mode de pr&#233;sentation efficace. L'objectif du prototype BT-45, d&#233;velopp&#233; dans le 
cadre du projet Babytalk, est de g&#233;n&#233;rer des r&#233;sum&#233;s de 45 minutes de signaux physiologiques 
continus et d'&#233;v&#233;nements temporels discrets en unit&#233; n&#233;onatale de soins intensifs (NICU). 
L'article pr&#233;sente l'aspect g&#233;n&#233;ration de texte de ce prototype. Une exp&#233;rimentation clinique a 
montr&#233; que les r&#233;sum&#233;s humains am&#233;liorent la prise de d&#233;cision par rapport &#224; l'approche 
graphique, tandis que les textes de BT-45 donnent des r&#233;sultats similaires &#224; l&#8217;approche 
graphique. Une analyse a identifi&#233; certaines des limitations de BT-45 mais en d&#233;pit de celles-
ci, notre travail montre qu'il est possible de produire automatiquement des r&#233;sum&#233;s textuels 
efficaces de donn&#233;es complexes. 
</p>
<p>Abstract Nowadays large amount of data is produced every day in medicine, meteorology 
and other areas and the most common approach to analyse such data is to present it 
graphically. However, it has been shown that textual summarisation is also an effective 
approach. As part of the BabyTalk project, the prototype BT-45 was developed to generate 
summaries of 45 minutes of continuous physiological signals and discrete temporal events in a 
neonatal intensive care unit (NICU). The paper presents its architecture with an emphasis on 
its natural language generation part. A clinical experiment showed that human textual 
summaries led to better decision making than graphical presentation, whereas BT-45 texts led 
to similar results as visualisations. An analysis identified some of the reasons for the BT-45 
texts inferiority, but, despite these deficiencies, our work shows that it is possible for 
computer systems to generate effective textual summaries of complex data. 
</p>
<p>Mots-cl&#233;s : Traitement automatique des langues naturelles ; G&#233;n&#233;ration de texte ; Analyse 
de donn&#233;es ; Unit&#233; de soins intensifs ; Syst&#232;mes d'aide &#224; la d&#233;cision 
</p>
<p>Keywords: Natural language processing; Natural language generation; Intelligent data 
analysis; Intensive care unit; Decision support systems</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Portet, Albert Gatt, Jim Hunter, Ehud Reiter, Somayajulu Sripada 
</p>
<p>1 Introduction  
En unit&#233; de soins intensifs, le personnel m&#233;dical est amen&#233; &#224; prendre des d&#233;cisions 
importantes concernant le meilleur traitement &#224; administrer &#224; un patient, parfois sous la 
pression du temps. Les cliniciens disposent d&#8217;un grand nombre de donn&#233;es qui incluent les 
signaux physiologiques (p.ex. fr&#233;quence cardiaque, pression art&#233;rielle...), les r&#233;sultats de 
laboratoire, les notes qui enregistrent les interventions pr&#233;c&#233;dentes, etc. En principe, ce 
foisonnement d'informations devrait permettre une prise de d&#233;cision appropri&#233;e, mais le plus 
souvent la quantit&#233; de donn&#233;es est telle qu'il est difficile de trouver l'information pertinente 
rapidement. Le mode de pr&#233;sentation des donn&#233;es est donc crucial. En effet, cette masse 
d&#8217;informations est utile dans la mesure o&#249; elle est pr&#233;sent&#233;e d'une mani&#232;re qui permet aux 
&#233;l&#233;ments pertinents d'&#234;tre extraits rapidement. Actuellement, le mode pr&#233;dominant est la 
repr&#233;sentation graphique, mais, alors que les syst&#232;mes graphiques sont tr&#232;s performants 
lorsqu'ils sont utilis&#233;s par des experts (Shahar et al., 2006), ils ne sont pas toujours efficaces 
dans le cas d'utilisateurs novices (dans notre cas, des infirmi&#232;res ou des m&#233;decins d&#233;butants) 
devant prendre des d&#233;cisions en quelques minutes. Une autre fa&#231;on d&#8217;aider l&#8217;exploitation des 
donn&#233;es est de cr&#233;er un syst&#232;me expert qui recommande des actions au personnel m&#233;dical. 
Cependant, peu de ces syst&#232;mes ont &#233;t&#233; int&#233;gr&#233;s dans la pratique m&#233;dicale car leurs 
recommandations sont souvent ignor&#233;es m&#234;me lorsque les utilisateurs reconnaissent leur 
pertinence (Puppe et al., 2008). Nous pensons qu'une mani&#232;re alternative d&#8217;exploiter ces 
donn&#233;es pour l'aide &#224; la d&#233;cision est d'utiliser des syst&#232;mes &#224; base de connaissances afin 
d&#8217;extraire les informations pertinentes et les pr&#233;senter &#224; l'utilisateur sous forme de r&#233;sum&#233; 
textuel produit automatiquement par des techniques de g&#233;n&#233;ration de texte (Natural Language 
Generation &#8211; NLG). Succinctement, il s&#8217;agit de trouver un compromis entre la pr&#233;sentation 
des donn&#233;es brutes (visualisation classique) et la recommandation d&#8217;actions (approche des 
syst&#232;mes experts). Notre but est donc de fournir aux cliniciens un r&#233;sum&#233; clair qui pr&#233;sente 
l'information principale pour faciliter la prise de d&#233;cision, laissant cette derni&#232;re t&#226;che 
enti&#232;rement &#224; leur jugement. Ce travail a &#233;t&#233; initi&#233; au sein du projet britannique BabyTalk 
(Portet et al., 2009) dont le but est de g&#233;n&#233;rer des r&#233;sum&#233;s textuels de donn&#233;es de nouveau-n&#233;s 
en unit&#233; n&#233;onatale de soins intensifs. Ce projet, ainsi que les donn&#233;es manipul&#233;es sont 
pr&#233;sent&#233;s en section  2. Le d&#233;veloppement d&#8217;un prototype appel&#233; BT-45 (BabyTalk 45 
minutes) est ensuite r&#233;sum&#233; en section  3 et son &#233;valuation est pr&#233;sent&#233;e en section  4. La 
section  5 termine l&#8217;article par une discussion des r&#233;sultats et l&#8217;identification de certains d&#233;fis 
pour la g&#233;n&#233;ration de langage naturel. Cet article est une version condens&#233;e de Portet et 
al. (2009).   
</p>
<p>2 Le projet BabyTalk 
BabyTalk est une collaboration entre le NICU (Neonatal Intensive Care Unit) de la Royal 
Infirmary of Edinburgh et les universit&#233;s d'Aberdeen et d'&#201;dimbourg. L'objectif du projet est 
de concevoir des syst&#232;mes produisant des r&#233;sum&#233;s textuels de donn&#233;es m&#233;dicales &#224; diff&#233;rentes 
&#233;chelles temporelles (minutes, heures, journ&#233;es), pour diff&#233;rentes utilisations (aide &#224; la 
d&#233;cision, r&#233;sum&#233; pour l&#8217;&#233;quipe prenant le relais) et adapt&#233;s &#224; diff&#233;rents utilisateurs 
(infirmi&#232;res confirm&#233;es, m&#233;decins d&#233;butants, parents). Ces syst&#232;mes sont : 1) BT-Nurse (12 
heures de donn&#233;es &#224; destination des infirmi&#232;res prenant leur service pour r&#233;sumer ce qui s'est 
produit durant le service pr&#233;c&#233;dent) ; 2) BT-Doc (plusieurs heures de donn&#233;es, sur demande, 
pour aider les m&#233;decins d&#233;butants &#224; prendre des d&#233;cisions) ; 3) BT-Parent (production de 
r&#233;sum&#233;s rassurants adapt&#233;s &#224; l&#8217;&#233;tat &#233;motif des parents), une extension du syst&#232;me BabyLink 
(Freer et al., 2005) qui est actuellement utilis&#233; &#224; &#201;dimbourg ; et 4)  BT-Clan (r&#233;sum&#233; &#224; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le projet BabyTalk : r&#233;sum&#233; de donn&#233;es h&#233;t&#233;rog&#232;nes cliniques pour la prise de d&#233;cision 
</p>
<p>destination des amis et de la famille, pour les encourager &#224; offrir un soutien appropri&#233; aux 
parents). Avant d&#8217;atteindre ces objectifs, le prototype BT-45 (BabyTalk 45 minutes) a &#233;t&#233; 
con&#231;u pour tester la faisabilit&#233; de l&#8217;approche &#8211; qui combine des techniques de traitement 
intelligent du signal et de g&#233;n&#233;ration de textes &#8211; sur de courtes p&#233;riodes de donn&#233;es. La 
motivation principale pour la conception de BT-45 vient de l&#8217;&#233;tude de Law et al. (2005), qui 
ont constat&#233; que les cliniciens en NICU prennent de meilleures d&#233;cisions lorsqu&#8217;ils utilisent 
des donn&#233;es pr&#233;sent&#233;es sous forme textuelle (r&#233;sum&#233;s uniquement descriptifs r&#233;dig&#233;s par des 
experts) plut&#244;t que sous forme graphique, bien qu&#8217;ils pr&#233;f&#232;rent cette derni&#232;re forme de 
pr&#233;sentation (s&#251;rement parce qu&#8217;ils y sont habitu&#233;s). Notre premi&#232;re intention &#233;tait d&#8217;essayer 
de reproduire ces r&#233;sultats par le m&#234;me type d&#8217;&#233;valuation mais en pr&#233;sentant les donn&#233;es sous 
forme : H) textuelle r&#233;dig&#233;e par des experts humains, C) textuelle g&#233;n&#233;r&#233;e automatiquement, 
et G) graphique. Puisque l'&#233;tude de Law et al. (2005) a utilis&#233; des sc&#233;narios de 45 minutes de 
donn&#233;es, BT-45 a &#233;t&#233; con&#231;u pour produire des r&#233;sum&#233;s de cette longueur. 
Les donn&#233;es d&#8217;entr&#233;es de BT-45 ont &#233;t&#233; acquises durant le projet NEONATE (Hunter et al., 
2003) et repr&#233;sentent plus de 400 heures d&#8217;enregistrement de donn&#233;es de 42 nouveau-n&#233;s 
soign&#233;s dans la NICU de la Royal Infirmary of Edinburgh. Elles sont de deux sortes : 1) les 
&#233;v&#233;nements discrets (annotations d&#8217;intervalles de temps) tels que les r&#233;sultats de laboratoire, 
les activit&#233;s du personnel, les &#233;quipements utilis&#233;s et leur param&#233;trage, les prescriptions, etc. 
et 2) les donn&#233;es multivoies continues de signaux physiologiques (fr&#233;quence cardiaque HR,  
pressions de l'oxyg&#232;ne TcPO2 et de l&#8217;anhydride carbonique TcPCO2 dans le sang, saturation 
en oxyg&#232;ne SpO2, temp&#233;ratures p&#233;riph&#233;rique T2 et centrale T1 et tension art&#233;rielle moyenne 
mean BM). La Figure 1-G) donne un aper&#231;u des donn&#233;es d'entr&#233;e du syst&#232;me telles que les 
cliniciens les per&#231;oivent habituellement. La seule diff&#233;rence avec les syst&#232;mes r&#233;els est que les 
donn&#233;es discr&#232;tes de NEONATE ont &#233;t&#233; saisies pr&#233;cis&#233;ment par une infirmi&#232;re employ&#233;e &#224; cet 
effet. En plus des donn&#233;es cliniques, nos coll&#232;gues cliniciens &#224; &#201;dimbourg ont &#233;crit 23 
r&#233;sum&#233;s, d&#233;crivant des p&#233;riodes de temps entre 30 et 50 minutes, qui ont compl&#233;t&#233; les 18 
r&#233;sum&#233;s &#233;crits pour le projet NEONATE (Hunter et al., 2003). Ces r&#233;sum&#233;s ont &#233;t&#233; employ&#233;s 
comme donn&#233;es de d&#233;veloppement pour BT-45. Vingt-six autres r&#233;sum&#233;s ont &#233;t&#233; &#233;crits pour 
&#233;valuer la prise de d&#233;cision clinique &#224; partir de r&#233;sum&#233;s &#233;crits par des experts ou g&#233;n&#233;r&#233;s par 
BT-45. La Figure 1-H) montre un texte, &#233;crit par un expert, correspondant aux donn&#233;es de la  
Figure 1-G). 
</p>
<p>3 Architecture du prototype BT-45 
L'architecture du prototype est illustr&#233;e Figure 2. BT-45 cr&#233;e un r&#233;sum&#233; des donn&#233;es cliniques 
en quatre &#233;tapes principales. Les signaux physiologiques et les annotations sont trait&#233;s par  
l&#8217;&#233;tape d&#8217;analyse des signaux (1) pour extraire les caract&#233;ristiques principales des signaux 
(&#233;v&#233;nements m&#233;dicaux, art&#233;facts et tendances). Le module d&#8217;interpr&#233;tation (2) abstrait les 
&#233;v&#233;nements (p.ex. abstraction d&#8217;&#233;v&#233;nements cons&#233;cutifs en s&#233;quence) et interpr&#232;te les donn&#233;es 
pour d&#233;couvrir des relations entre &#233;v&#233;nements (p.ex. A cause B). &#192; partir du grand nombre 
d&#8217;&#233;v&#233;nements et de relations produites, l&#8217;&#233;tape de planification du document (3) choisit les 
plus importants et les agr&#232;ge dans un arbre d&#8217;&#233;v&#233;nements. Enfin, le module de micro-
planification et r&#233;alisation (4) traduit cet arbre en texte. Tous les termes employ&#233;s pour 
d&#233;crire les &#233;v&#233;nements sont li&#233;s par une ontologie des concepts du domaine NICU. Les sous-
sections suivantes d&#233;taillent les modules de BT-45 en mettant l'accent sur la g&#233;n&#233;ration de 
texte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Portet, Albert Gatt, Jim Hunter, Ehud Reiter, Somayajulu Sripada 
</p>
<p> 
</p>
<p>To start with, the HR=152;   TcPO2= 6;   TcPCO2= 8.6 and 
SaO2= 92%.  T1= 37.7&#186; and T2= 34.3&#186;C. 
Initially there is an increase in oxygenation: TcPO2 rises from 6 
to 10.6 SaO2 rises from 89 to 98%.  HR and TcPCO2 are static.  
At 14:15 hours a heel prick is done.  The HR increases at this 
</p>
<p>point and for 7 minutes from the start of this procedure there is a 
lot of artifact in the oxygen saturation trace.  Also there are 
upward spikes in the TcPO2 (to 17), each corresponding with 
</p>
<p>downward spikes in the TcPCO2 (to 2.6).  At 14:23 the FiO2 is 
changed to 45% and the TcPO2 rises from 6 to 12. 
At 14:28 the saturation probe is reapplied, the oxygen saturation 
is 100%, and the HR settles back to baseline of 155.  The FiO2 
is reduced twice and at 14:31 is 25%.  
At 14:34 hours the baby is examined.  For the following 5 
minutes there is another series of spikes in the transcutaneous 
parameters, with TcPO2 spikes up to 19 and corresponding 
TcPCO2 spikes down to 1.4, while the saturations fall to 74%.  
</p>
<p>The FiO2 is increased to 32%.  HR remains stable at 145-160. 
By 14:38 the toe-core gap has widened to &gt;4&#186; with a T1 of 
37.7&#186;C.  Both temperature probes are re-applied at 14:41.  
</p>
<p>Shortly after this the oxygen saturation settles to 94-95% and at 
14:46 the FiO2 is reduced to 28%.   
At 14.48 hours the oxygen saturation falls to 83%, TcPO2 is 6.6 
and TcPCO2 is 7.6.  HR remains steady around 160.  While the 
oxygen saturation remains at 83% the TcPO2 falls to 5 and the 
TcPCO2 to 6.6.  The FiO2 is increased to 30%.   
By 14:50 T1 is 37.5&#186; and T2 is 34.2&#186;C. 
</p>
<p>You saw the baby between 14:10 and 14:50. 
Heart Rate (HR) = 159. Core Temperature (T1) = 
37.7. Peripheral Temperature (T2) = 34.3. 
Transcutaneous Oxygen (TcPO2) = 5.8. 
Transcutaneous CO2 (TcPCO2) = 8.5. Oxygen 
Saturation (SaO2) = 89. 
</p>
<p>Over the next 30 minutes T1 gradually increased 
to 37.3. 
</p>
<p>By 14:27 there had been 2 successive 
desaturations down to 56. As a result, Fraction of 
Inspired Oxygen (FIO2) was set to 45%. Over 
the next 20 minutes T2 decreased to 32.9. A heel 
prick was taken. Previously the spo2 sensor had 
been re-sited. 
</p>
<p>At 14:31 FIO2 was lowered to 25%. Previously 
TcPO2 had decreased to 8.4. Over the next 20 
minutes HR decreased to 153. 
</p>
<p>By 14:40 there had been 2 successive 
desaturations down to 68. Previously FIO2 had 
been raised to 32%. TcPO2 decreased to 5.0. T2 
had suddenly increased to 33.9. Previously the 
spo2 sensor had been re-sited. The temperature 
sensor was re-sited. 
</p>
<p>G) H) C) 
</p>
<p>Figure 1:  G) Pr&#233;sentation Graphique de donn&#233;es NICU. Les voies physiologiques de haut en bas sont HR, TcPO2, TcPCO2, SaO2, T1 &amp; T2, et 
Mean BP (non connect&#233; durant la p&#233;riode d'enregistrement). Les carr&#233;s rouges en bas repr&#233;sentent les &#233;v&#233;nements annot&#233;s, l'utilisateur acc&#232;de &#224; 
</p>
<p>de l&#8217;information suppl&#233;mentaire en cliquant dessus (p.ex., un heel prick - acquisition d'&#233;chantillon sanguin au talon - a &#233;t&#233; enregistr&#233; &#224; 14h15). H) 
R&#233;sum&#233; textuel correspondant &#233;crit par un expert Humain. C) R&#233;sum&#233; textuel correspondant g&#233;n&#233;r&#233; par BT-45 (Computer) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le projet BabyTalk : r&#233;sum&#233; de donn&#233;es h&#233;t&#233;rog&#232;nes cliniques pour la prise de d&#233;cision 
 
</p>
<p>Base de
donn&#233;es
</p>
<p>NEONATE
</p>
<p>Analyse
des signaux Interpr&#233;tation
</p>
<p>Planification
du document
</p>
<p>Micro-Planning
et r&#233;alisation
</p>
<p>Ontologie
</p>
<p>s&#233;ries 
temporelles 
</p>
<p>notes cliniques
</p>
<p>&#233;v&#233;nements observations
m&#233;dicales
</p>
<p>groupes
d&#8217;&#233;v&#233;nements r&#233;sum&#233;s
</p>
<p>textuels
</p>
<p>1
2
</p>
<p>3
</p>
<p>4
</p>
<p>concepts
</p>
<p>concepts
</p>
<p> 
</p>
<p>Figure 2: Architecture du prototype BT-45. 
</p>
<p>3.1 Analyse des donn&#233;es et repr&#233;sentation dans l'ontologie du domaine  
</p>
<p>Dans BT-45, la connaissance du domaine est centralis&#233;e dans une ontologie. En plus d&#8217;avoir 
fourni un vocabulaire conceptuel commun entre les modules, cette ontologie a &#233;galement servi 
au raisonnement. Plut&#244;t que d&#8217;utiliser des ressources m&#233;dicales telles que SNOMED-CT ou 
UMLS trop difficiles &#224; int&#233;grer dans un syst&#232;me d&#233;di&#233; (UMLS couvre plus de 1.5 million de 
concepts), nous avons d&#233;velopp&#233; cette ontologie &#224; partir d&#8217;un lexique cr&#233;&#233; durant nos 
pr&#233;c&#233;dents projets en incluant notamment des informations linguistiques. La version finale 
repr&#233;sente environ 550 concepts s&#233;par&#233;s en deux branches principales : EVENT et ENTITY. 
ENTITY englobe les objets du domaine, tels que NURSE, VENTILATOR (appareil 
d&#8217;assistance respiratoire), MEDICATION, etc. EVENT englobe les activit&#233;s et les &#233;v&#233;nements 
qui impliquent des entit&#233;s. Tous les &#233;v&#233;nements ont une date de d&#233;but, une date de fin, et une 
valeur d'importance. Cette derni&#232;re repr&#233;sente l'importance m&#233;dicale d'un &#233;v&#233;nement qui peut 
&#234;tre fixe ou calcul&#233;e par BT-45. Les sous-classes de EVENT incluent INTERVENTION 
(p.ex., injection de m&#233;dicament), OBSERVATION (p.ex., b&#233;b&#233; est agit&#233;), etc. &#201;tant donn&#233; 
que l'ontologie est utilis&#233;e pour repr&#233;senter la connaissance et pour soutenir le traitement 
linguistique, les &#233;v&#233;nements ont des attributs qui sp&#233;cifient leurs participants. Durant la 
lexicalisation, ces participants sont reli&#233;s aux r&#244;les th&#233;matiques d&#8217;une structure 
&#233;v&#233;nementielle utilis&#233;e pour exprimer un &#233;v&#233;nement. Par exemple, INSERT_CHEST_DRAIN 
a des champs qui sp&#233;cifient l'agent (la personne qui ins&#232;re le drain), le b&#233;n&#233;ficiaire (la 
personne &#224; qui le drain est destin&#233;), et le th&#232;me (l'objet qui a &#233;t&#233; utilis&#233;; ici le drain).  
Les instances des classes de l'ontologie sont cr&#233;&#233;es lors de la lecture de la base de donn&#233;es ou 
inf&#233;r&#233;es par les modules d'analyse des signaux ou d'interpr&#233;tation des donn&#233;es.  Les signaux 
physiologiques contiennent beaucoup d'informations sur l&#8217;&#233;tat du patient qui doivent &#234;tre 
extraites (p.ex. les bradycardies &#8211; p&#233;riodes de ralentissement du rythme cardiaque). Le but de 
l&#8217;analyse des signaux est donc de d&#233;tecter les motifs repr&#233;sentant des &#233;v&#233;nements d&#8217;int&#233;r&#234;t sur 
les signaux physiologiques, de les classifier et d&#8217;estimer leur importance. Toutes les instances 
sont ensuite analys&#233;es par le module d&#8217;interpr&#233;tation des donn&#233;es qui est un pr&#233;requis pour la 
synth&#232;se des donn&#233;es. En effet, reporter les &#233;v&#233;nements pris isolement (p.ex. chaque pic) ne 
r&#233;duirait pas la charge d'informations tandis que l&#8217;abstraction de ceux-ci dans une description 
de plus haut niveau (p.ex., une s&#233;quence de pics) est d&#233;j&#224; une compression d&#8217;information. Par 
ailleurs, les associations entre couples d&#8217;&#233;v&#233;nements (p.ex., A cause B) doivent &#234;tre inf&#233;r&#233;es 
pour faciliter la compr&#233;hension. Ceci est r&#233;alis&#233; en utilisant plus d&#8217;une centaine de r&#232;gles et 
m&#233;tar&#232;gles expertes. Le lecteur qui souhaiterait plus de d&#233;tails sur ces parties pourra se 
reporter &#224; l&#8217;article de Portet et al. (2009).   </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Portet, Albert Gatt, Jim Hunter, Ehud Reiter, Somayajulu Sripada 
</p>
<p>3.2 Planification du document 
</p>
<p>Ce module d&#233;cide, &#224; partir des &#233;v&#233;nements et des liens produits par les modules en amont, 
quels sont les &#233;v&#233;nements (c.-&#224;-d. &#171; unit&#233;s d'informations &#187; ou &#171; messages &#187;) devant &#234;tre 
communiqu&#233;s dans le texte. La planification r&#233;partit les messages dans des paragraphes et  
d&#233;termine l'ordre des &#233;v&#233;nements dans chaque paragraphe. Le plan r&#233;sultant est une 
repr&#233;sentation abstraite d&#8217;un document sous forme d&#8217;un arbre dont les noeuds sont des 
&#233;v&#233;nements (messages) ou des informations de structure du document (paragraphes), et dont 
les arcs sont annot&#233;s avec des relations rh&#233;toriques. La Figure 3 illustre  la mani&#232;re de 
fonctionner de la planification. Le noeud racine (root) a quatre fils : un noeud SEQUENCE 
(l'&#233;v&#233;nement cl&#233; &#8211; key event), avec les &#233;v&#233;nements qui lui sont li&#233;s (DESATURATION et 
FIO2) ;   et les autres noeuds de groupe construits en fonction de leur cat&#233;gorie (syst&#232;me 
respiratoire, thermor&#233;gulation et autre...). L'algorithme, inspir&#233; de Hallett et al. (2006), 
identifie un nombre restreint d'&#233;v&#233;nements cl&#233;s (bas&#233; sur leur importance) et cr&#233;e un 
paragraphe pour chacun. Les &#233;v&#233;nements cl&#233;s sont mentionn&#233;s d'abord, suivis des &#233;v&#233;nements 
qui leur sont explicitement li&#233;s, suivis de ceux se produisant au m&#234;me moment. Les 
paragraphes sont ordonn&#233;s par heure de d&#233;but de leur &#233;v&#233;nement cl&#233; respectif. L'originalit&#233; de 
cette approche r&#233;side dans l'algorithme de construction autour d&#8217;&#233;v&#233;nements cl&#233;s et par le fait 
qu'un paragraphe est trait&#233; comme un type primitif. Dans la plupart des syst&#232;mes NLG, les 
paragraphes ont tendance &#224; suivre des mod&#232;les tr&#232;s stricts (par exemple, un paragraphe au 
sujet des m&#233;dicaments) ou &#224; &#234;tre trait&#233;s comme un ph&#233;nom&#232;ne d'agr&#233;gation. Dans BT-45, 
l&#8217;algorithme produit dynamiquement des paragraphes de longueur et de contenu variable. 
</p>
<p>(root)
sequence
</p>
<p>(key event)
</p>
<p>re-site
</p>
<p>re-site
</p>
<p>step (T2)
</p>
<p>Trend
(TcPO2)
</p>
<p>FIO2
</p>
<p>desat.
</p>
<p>desat.
</p>
<p>reason
</p>
<p>SEQUENCE:
DESATURATION:
EXAMINE_BABY:
TREND (HR): 
TREND (SaO2):
TREND (TcPO2):
TREND (T2):
DESATURATION:
RE-SITE_PROBES:
RE-SITE_PROBES:
TREND (TcPCO2):
STEP (T2): 
DESATURATION:
TREND (TcPO2):
TREND (SaO2):
FIO2:
FIO2:
</p>
<p>14:37:01&#9;14:37:01&#9;(21)
14:37:06&#9;14:40:36&#9;(55)
14:37:06&#9;14:37:57&#9;(27)
14:37:08&#9;14:37:22&#9;(20)
14:38:03&#9;14:49:16&#9;(  1)
14:38:10&#9;14:44:53&#9;(  9)
14:38:21&#9;14:39:36&#9;(  3)
14:38:29&#9;14:38:56&#9;(  1)
14:38:32&#9;14:38:45&#9;(17)
14:38:54&#9;14:39:51 (20)
14:38:54&#9;14:39:51 (20)
14:38:54&#9;14:42:00 (  5)
14:38:58&#9;14:39:23 (16)
14:39:25&#9;14:40:36 (45)
14:40:17&#9;14:49:21 (12)
14:45:04&#9;14:49:21 (  3)
14:46:03&#9;14:46:03 (12)
14:49:34&#9;14:49:34 (  6)
</p>
<p>FIO2: &#9;
</p>
<p>(vent.)
(temp.)
</p>
<p>(other)
</p>
<p>include
include
</p>
<p> 
</p>
<p>Figure 3 : Liste d'&#233;v&#233;nements pour la p&#233;riode de 14h37 &#224; 14h50 (&#224; gauche), dont les 
&#233;v&#233;nements gris&#233;s ont &#233;t&#233; s&#233;lectionn&#233;s pour constituer une partie du plan du document (&#224; 
droite). Les noeuds de groupement, entre parenth&#232;ses, ne correspondent pas &#224; un &#233;v&#233;nement. 
</p>
<p>3.3 Micro-planification et r&#233;alisation  
</p>
<p>Ce module regroupe le micro-planning et de r&#233;alisation qui sont souvent consid&#233;r&#233;es s&#233;par&#233;es 
en NLG (Reiter et Dale, 2000). Le microplanning ajoute le contenu linguistique au plan de 
document, cr&#233;ant des repr&#233;sentations s&#233;mantiques qui sont ensuite traduites en structures 
linguistiques (syntactiques), pour &#234;tre finalement lin&#233;aris&#233;es comme texte. L'architecture 
interne du microplanner BT-45 est donn&#233;e Figure 4. Les diff&#233;rentes parties du microplanner 
sont illustr&#233;es en se r&#233;f&#233;rant au dernier paragraphe du texte de la Figure 1-C). 
</p>
<p>La lexicalisation relie les &#233;v&#233;nements du plan &#224; des structures &#233;v&#233;nementielles (Event-Frame) 
consistant en un verbe (pr&#233;dicat) et une sp&#233;cification de ses arguments s&#233;mantiques (r&#244;le 
th&#233;matique) tels que AGENT ou THEME. La lexicalisation associe les EVENT &#224; des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le projet BabyTalk : r&#233;sum&#233; de donn&#233;es h&#233;t&#233;rog&#232;nes cliniques pour la prise de d&#233;cision 
 
</p>
<p>pr&#233;dicats en se basant sur leur classe ontologique et en utilisant des r&#232;gles expertes. Ce 
proc&#233;d&#233; est &#233;galement soutenu par le lexique Verbnet (Kipper et al., 2000) modifi&#233; pour 
inclure des classes sp&#233;cifiques au domaine. Verbnet groupe les verbes par classes selon leurs 
r&#244;les th&#233;matiques. Par exemple, dans le cas de l'&#233;v&#233;nement o&#249; le param&#232;tre du ventilateur 
FIO2 est augment&#233; &#224; 32%, cet &#233;v&#233;nement appartient &#224; une sous-classe de 
VENTILATOR_SETTING. Cette classe poss&#232;de un attribut de direction qui, dans ce cas-ci, 
prend la valeur increase de sorte que l'exemple correspond au mod&#232;le suivant (au format 
LISP) : (event-verb-mapping (event-class VENTILATOR_SETTING) 
(verb-class intentional_value_setting) (direction increase) 
(verb raise)). Le verbe appartient &#224; la classe intentional_value_setting du lexique et 
h&#233;rite de trois r&#244;les th&#233;matiques, AGENT (l&#8217;entit&#233; qui modifie FIO2), THEME (l&#8217;entit&#233; qui 
est modifi&#233;e, ici FIO2) et VALUE (ici, 32%). La lexicalisation est g&#233;n&#233;ralis&#233;e pour traiter des 
s&#233;quences d'&#233;v&#233;nements, en groupant ces derniers dans une seule structure &#233;v&#233;nementielle. 
L'Event Linking cherche &#224; rendre explicite les relations entre les &#233;v&#233;nements du plan. Les 
relations temporelles sont exprim&#233;es en utilisant des adverbiaux temporels. D'autres types de 
liens, tels que les relations causales, sont trait&#233;s par heuristique pour choisir la mani&#232;re la plus 
ad&#233;quate de les exprimer. Par exemple, si la cible d'un lien causal est une structure 
&#233;v&#233;nementielle r&#233;alis&#233;e comme clause non existentielle et d&#233;clarative, celle-ci sera r&#233;alis&#233;e 
comme une clause s&#233;par&#233;e telle que as a result. Par contre, les clauses existentielles (p.ex., 
there was a bradycardia) sont r&#233;alis&#233;es en tant que clauses subordonn&#233;es (p.ex., The baby was 
given morphine, causing a bradycardia). Suite &#224; ces op&#233;rations une structure &#233;v&#233;nementielle 
contient un certain nombre de r&#244;les th&#233;matiques qui se r&#233;f&#232;rent &#224; des entit&#233;s du domaine, pour 
lesquelles des expressions r&#233;f&#233;rentielles (RE) doivent &#234;tre construites. Le module GRE 
(Generation of Referring Expressions) manipule quatre types de RE : 1) les entit&#233;s nomm&#233;es ; 
2) les mass term qui se rapporte &#224; des substances ou des g&#233;n&#233;riques (p.ex. MORPHINE dans 
50mg of morphine) ; 3) les groupes nominaux (GN) d&#233;finis et ind&#233;finis, qui sont identifi&#233;s par 
leurs propri&#233;t&#233;s dans l'ontologie (p.ex.  the baby est un GN d&#233;fini unique dans le discours 
alors que an IV line est toujours ind&#233;fini) ; et 4) les r&#233;f&#233;rences anaphoriques, pour lesquelles 
un algorithme bas&#233; sur la pr&#233;pond&#233;rance (Krahmer et Theune 2002) est employ&#233; pour 
d&#233;terminer si des entit&#233;s doivent &#234;tre mentionn&#233;es par des pronoms. 
</p>
<p> 
</p>
<p>Figure 4 : Architecture du module de micro-planification de BT-45 
Un des points les plus d&#233;licats pour la micro-planification est l'expression du temps qui est 
g&#233;r&#233;e par le gestionnaire du discours. Le lecteur doit pouvoir reconstruire, &#224; partir du texte, 
l'ordre dans lequel les &#233;v&#233;nements se sont produits. Cependant, l'ordre narratif de BT-45 n'est 
pas isomorphe &#224; l'ordre temporel. Ceci est d&#251; &#224; la strat&#233;gie d&#8217;ordonnancement du planificateur 
(bas&#233;e sur l'importance) que le microplanner essaye de respecter. Malgr&#233; la quantit&#233; 
substantielle de publications sur la repr&#233;sentation temporelle dans le traitement du langage 
naturel, ce probl&#232;me n'a suscit&#233; que tr&#232;s peu d'attention du point de vue de la g&#233;n&#233;ration. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Portet, Albert Gatt, Jim Hunter, Ehud Reiter, Somayajulu Sripada 
</p>
<p>L'&#233;v&#233;nement cl&#233; qui forme la racine de chaque paragraphe est toujours exprim&#233; avec une 
mention explicite de son heure de d&#233;but, de sorte que chaque paragraphe commence par une 
r&#233;f&#233;rence temporelle claire. Des temps et des adverbiaux temporels sont ensuite employ&#233;s 
pour indiquer l'ordre temporel relatif des &#233;v&#233;nements mentionn&#233;s apr&#232;s l'&#233;v&#233;nement cl&#233;. Les 
temps sont calcul&#233;s en utilisant le mod&#232;le propos&#233; par Reichenbach (1947/1966). Le temps 
utilis&#233; d&#233;pend du moment d'occurrence de l'&#233;v&#233;nement (E), du moment de l&#8217;&#233;nonciation, et du 
moment de r&#233;f&#233;rence (R). Stylistiquement, ceci distingue les textes BT-45 &#233;crits au pass&#233; des 
textes humains o&#249; le pr&#233;sent de narration est employ&#233;. L&#8217;ordre relatif de R et de E pour un 
ensemble d'&#233;v&#233;nements d&#233;termine l'utilisation d'un past perfect ou d&#8217;un simple past. Par 
exemple, T2 had suddenly increased to 33.9 indique que son moment d'occurrence pr&#233;c&#232;de 
son moment de r&#233;f&#233;rence (E &lt; R). Dans ce cas-ci, son moment de r&#233;f&#233;rence est le moment 
d&#8217;occurrence de l&#8217;&#233;v&#233;nement mentionn&#233; pr&#233;c&#233;demment qui a en fait commenc&#233; apr&#232;s lui. La 
phrase The temperature sensor was re-sited a aussi l&#8217;&#233;v&#233;nement mentionn&#233; pr&#233;c&#233;demment 
comme moment de r&#233;f&#233;rence mais, comme les deux &#233;v&#233;nements se sont produits au m&#234;me 
moment (R = E), cette phrase est exprim&#233;e au simple past.  
</p>
<p>4 &#201;valuation 
Pour &#233;valuer BT-45, il a &#233;t&#233; demand&#233; &#224; 35 infirmi&#232;res et m&#233;decins de la Royal Infirmary of 
Edinburgh de prendre une d&#233;cision &#224; partir de 45 minutes d&#8217;informations sur des nouveau-n&#233;s 
(qu&#8217;ils ne connaissaient pas) pr&#233;sent&#233;es sous forme : graphique (G) ; textuelle r&#233;dig&#233;e par nos 
experts humains (H) ; ou textuelle g&#233;n&#233;r&#233;e par BT-45 (C). 24 sc&#233;narios ont &#233;t&#233; choisis pour 
lesquels 18 actions (appropri&#233;es, neutres ou inappropri&#233;es) pouvaient &#234;tre choisies. Ces 24 
sc&#233;narios, sous trois conditions, ont &#233;t&#233; distribu&#233;s en utilisant une strat&#233;gie de carr&#233; latin pour 
&#233;viter qu&#8217;un sujet soit confront&#233; plusieurs fois au m&#234;me sc&#233;nario. Les textes H ont &#233;t&#233; &#233;crits 
pour &#234;tre uniquement descriptifs et pour &#233;viter toutes indications th&#233;rapeutiques (p.ex., HR is 
normal ou arterial pressure is worrying). Les sujets ont &#233;t&#233; r&#233;partis en quatre groupes : 
docteurs seniors SD (n=9) et juniors JD (n=9), infirmi&#232;res seniors SN (n=9) et juniors JN 
(n=8). Chaque sc&#233;nario devait &#234;tre analys&#233; en moins de 3 minutes afin d'imposer une certaine 
pression. Les sujets n'ont pas &#233;t&#233; invit&#233;s &#224; donner leur avis mais tout avis spontan&#233; a &#233;t&#233; 
enregistr&#233; anonymement. Avant l&#8217;&#233;valuation, une initiation au logiciel de test a &#233;t&#233; effectu&#233;e. 
Aucun des d&#233;veloppeurs de BT-45 n&#8217;a eu acc&#232;s aux sc&#233;narios avant l&#8217;exp&#233;rimentation. La 
longueur moyenne des 26 (24 sc&#233;narios + 2 sc&#233;narios d&#8217;apprentissage) textes H &#233;tait de 135 
mots (&#963; = 79) et de 119 mots (&#963; = 36) pour les textes C mais ils n&#8217;ont pas une longueur 
significativement diff&#233;rente selon le test de Wilcoxon (z = -.588, p = .493). Bien que les textes 
H soient plus longs ils partagent la m&#234;me tendance (c.-&#224;-d., quand les textes H sont plus 
longs, les textes C le sont aussi). Le score de chaque sujet pour chaque sc&#233;nario a &#233;t&#233; calcul&#233; 
en soustrayant la proportion d'actions choisies inad&#233;quates de la proportion d'actions choisies 
appropri&#233;es. Le score global pour G &#233;tait 0.33 (&#963; = 0.14), pour H 0.39 (&#963; = 0.11) et pour C 
0.34 (&#963; = 0.14). Un test ANOVA 3 (conditions) x 4 (groupes) a montr&#233; un effet de condition 
approchant la significativit&#233; (F (2, 31) = 2.939, p = 0.06) mais aucun effet de groupe, et 
aucune interaction. Trois analyses ANOVA ont montr&#233; que G et H (F (1, 31) = 4.975, p &lt; 
0.05) et que C et H (F (1.31) = 5.266, p &lt; 0.05) donnent des r&#233;sultats significativement 
diff&#233;rents alors que les r&#233;sultats de G et C ne le sont pas (van der Meulen et al., 2009).  
</p>
<p>5 Discussion 
Le r&#233;sultat le plus important de cette &#233;tude est s&#251;rement d&#8217;avoir montr&#233; qu'il est possible de 
g&#233;n&#233;rer des r&#233;sum&#233;s de donn&#233;es cliniques complexes pouvant aider efficacement la prise de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le projet BabyTalk : r&#233;sum&#233; de donn&#233;es h&#233;t&#233;rog&#232;nes cliniques pour la prise de d&#233;cision 
 
</p>
<p>d&#233;cision. En effet, les d&#233;cisions sous conditions C sont au moins aussi efficaces que sous 
condition G (et m&#234;me bien meilleures dans certains cas) alors que G est une pr&#233;sentation 
quotidiennement utilis&#233;e par le personnel et que BT-45 n&#8217;est le r&#233;sultat que d&#8217;un an de 
d&#233;veloppement. Un autre r&#233;sultat important est que les textes peuvent &#234;tre une aide &#224; la 
d&#233;cision tr&#232;s efficace comme le prouvent les r&#233;sultats de H significativement meilleurs que C 
et G. Ceci conforte les r&#233;sultats de Law et al (2005) et encourage le d&#233;veloppement de 
nouvelles technologies de g&#233;n&#233;ration de textes &#224; partir d&#8217;ensembles de donn&#233;es temporelles 
h&#233;t&#233;rog&#232;nes. Afin de nous aider &#224; comprendre quels aspects des textes C les ont rendus moins 
efficaces que les textes H, nous avons analys&#233; les r&#233;sultats en profondeur. Cette analyse nous 
a permis d&#8217;identifier les principales limites du syst&#232;me &#224; tous les niveaux de traitement. Nous 
r&#233;sumons ici les principaux probl&#232;mes li&#233;s &#224; la g&#233;n&#233;ration de texte.  
</p>
<p>Le principal aspect de BT-45 qui a &#233;t&#233; critiqu&#233; est la description trop morcel&#233;e des signaux 
physiologiques. Par exemple, le texte de la Figure 1-C) commence avec T1 is 37.7, et TcPO2 
is 5.8, et les prochaines r&#233;f&#233;rences sont T1 increased to 37.3, et TcPO2 decreased to 8.4. Ce 
probl&#232;me est d&#251; &#224; la strat&#233;gie de planification bottom-up de BT-45. Sur la Figure 1-G) le 
signal TcPO2 s'est &#233;lev&#233;, entre 14.15 et 14.17, &#224; une valeur de cr&#234;te de 20, avant de diminuer &#224; 
8.4. Les r&#232;gles expertes ont assign&#233; plus d'importance &#224; la chute de TcPO2 qu'&#224; l'&#233;l&#233;vation 
pr&#233;c&#233;dente, ce qui a provoqu&#233; la s&#233;lection unique de cette premi&#232;re par le planificateur. Nous 
appelons ce probl&#232;me continuity qui fait r&#233;f&#233;rence &#224; l'expression employ&#233;e par des r&#233;alisateurs 
de film lorsqu&#8217;ils cherchent &#224; s'assurer que les sc&#232;nes voisines dans un film &#171; collent &#187; les 
unes avec les autres lors du montage. Certains textes humains ont &#233;galement des probl&#232;mes de 
continuit&#233;, mais aucun des sujets ne s'en est plaint. Ceci sugg&#232;re que certaines violations de 
continuit&#233; sont plus probl&#233;matiques que d'autres et il se peut que cela soit li&#233; &#224; la proximit&#233; 
des &#233;v&#233;nements dans le temps et dans l&#8217;espace du texte.  
Un autre probl&#232;me est la mauvaise communication des informations temporelles. L&#8217;une des 
difficult&#233;s est de choisir les r&#233;f&#233;rences temporelles pour un &#233;v&#233;nement. Par exemple dans un 
sc&#233;nario, BT-45 a g&#233;n&#233;r&#233; : After 6 attempts, at 14:17 a peripheral venous line was inserted 
successfully. En fait, 14 :17 correspond &#224; la date de la premi&#232;re tentative or les lecteurs 
l&#8217;interpr&#232;tent comme la date de succ&#232;s de l&#8217;op&#233;ration. Ceci est d&#8217;autant plus g&#234;nant que cette 
date, pour un &#233;v&#233;nement aussi long, peut servir de date de r&#233;f&#233;rence pour les &#233;v&#233;nements 
suivants du texte. Le probl&#232;me est que quand BT-45 d&#233;crit de longs &#233;v&#233;nements, il ne prend 
pas en compte le type de l'&#233;v&#233;nement. Dans cet exemple, la notion de succ&#232;s est cruciale. En 
effet, si tous les essais avaient &#233;t&#233; infructueux cette date serait acceptable. BT-45 a donc 
besoin d'un meilleur mod&#232;le pour communiquer le temps et pour lier l&#8217;expression linguistique 
&#224; la s&#233;mantique des &#233;v&#233;nements. Nous avons &#233;galement besoin de meilleures m&#233;thodes pour 
communiquer les relations temporelles entre les &#233;v&#233;nements dans les cas o&#249; ils ne sont pas 
&#233;num&#233;r&#233;s dans l'ordre chronologique.  
D&#8217;apr&#232;s deux analystes du discours de l'universit&#233; d'&#201;dimbourg (Andrew McKinlay et Chris 
McVittie), la sup&#233;riorit&#233; des textes humains peut &#234;tre expliqu&#233;e par leur structure narrative, 
bien meilleure que celle des textes BT-45. Ces analystes emploient le terme narratif dans le 
sens de Labov (1971), c&#8217;est-&#224;-dire des exp&#233;riences &#233;crites comme des r&#233;cits et qui vont au-
del&#224; d&#8217;une description factuelle d&#8217;&#233;v&#233;nements et qui incluent les informations qui aident des 
auditeurs &#224; rendre r&#233;aliste ce qui s'est produit (p.ex. : r&#233;sum&#233;s, &#233;valuatifs, corr&#233;latifs, ou 
explicatives). En fait, une grande partie des limitations du syst&#232;me (continuit&#233;, information 
relative, granularit&#233; temporelle et vue d'ensemble) sont des aspects de la g&#233;n&#233;ration narrative. 
Ceci est d&#8217;autant plus int&#233;ressant que nos collaborateurs cliniciens &#224; &#201;dimbourg sont 
persuad&#233;s de la valeur des informations sur les nouveau-n&#233;s rapport&#233;es sous forme de r&#233;cits. 
En effet, les syst&#232;mes de gestion de patients actuels, o&#249; la saisie d&#8217;informations est r&#233;alis&#233;e &#224; 
travers des formulaires, ont supprim&#233; les notes dites &#171; libres &#187; qui contenaient des erreurs 
(orthographiques, typographiques, etc.) mais dont la structure narrative contenait des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Portet, Albert Gatt, Jim Hunter, Ehud Reiter, Somayajulu Sripada 
</p>
<p>informations pr&#233;cieuses (relations causales et explications). Or, les cliniciens d&#233;butants 
apprenaient beaucoup gr&#226;ce &#224; ces notes qui rendaient les liens de cause/cons&#233;quence entre les 
&#233;v&#233;nements explicites.  
</p>
<p>Toutes ces limitations sont prises en compte pour le d&#233;veloppement des prochains syst&#232;mes 
du projet BabyTalk destin&#233;s &#224; un &#233;ventail plus large d&#8217;utilisateurs. Nous pensons que cette  
technologie de donn&#233;es-vers-texte sera bient&#244;t mature et pourra &#234;tre employ&#233;e pour aider des 
personnes &#224; comprendre de grands ensembles de donn&#233;es, en m&#233;decine, en m&#233;t&#233;orologie et 
dans beaucoup d'autres secteurs. 
</p>
<p>Remerciements 
Les auteurs remercient les membres du projet BabyTalk et les cliniciens ayant particip&#233; &#224; 
l'&#233;valuation pour leur aide. Ce travail est soutenu par Engineering and Physical Sciences 
Research Council (EPSRC) &#224; travers les financements EP/D049520/1 et EP/D05057X/1. 
</p>
<p>R&#233;f&#233;rences 
FREER Y., LYON A., STENSON B., COYLE C. (2005). BabyLink &#8211; improving communication among 
clinicians and with parents with babies in intensive care. Br J Healthcare Comput Inf Manage, 22(2), 
34-36. 
HUNTER J., FERGUSON L., FREER Y., EWING G., LOGIE R., MCCUE P., MCINTOSH N. (2003) The 
NEONATE Database. Joint AIMDM and IDAMAP Workshop, 21-24.  
HALLETT C., POWER R., SCOTT D. (2006). Summarisation and visualisation of e-Health data 
repositories. UK E-Science All-Hands Meeting, Nottingham, UK. 
KIPPER K., DANG H.T., PALMER M. (2000). Class-based construction of a verb lexicon. 17th National 
Conference on Artificial Intelligence, Austin, Texas, 691&#8211;696. 
KRAHMER E., THEUNE M. (2002). Efficient context-sensitive generation of referring expressions. 
Information Sharing: Reference and Presupposition in Language Generation and Interpretation, 
Stanford, CA. 
LABOV W. (1971) Language in the Inner City. University of Pennsylvania Press, Pennsylvania. 
LAW A.S., FREER Y., HUNTER J., LOGIE R.H., MCINTOSH N., QUINN J. (2005). A comparison of 
graphical and textual presentations of time series data to support medical decision making in the 
neonatal intensive care unit, J Clin Monit Comput, 19(3), 183-194. 
PORTET F., REITER E., GATT A., HUNTER J., SRIPADA S., FREER Y., SYKES C. (2009). Automatic 
generation of textual summaries from neonatal intensive care data. Artif Intell, 173(7-8), 789-816. 
PUPPE F., ATZM&#220;LLER M., BUSCHER G., H&#220;TTIG M., LUEHRS H., BUSCHER H.-P. (2008). Application 
and Evaluation of a Medical Knowledge System in Sonography (SONOCONSULT). ECAI, 683-687 
REICHENBACH H. (1947/1966). Elements of Symbolic Logic, Macmillan, New York. 
REITER E., DALE R. (2000). Building Natural Language Generation Systems, Cambridge University 
Press, Cambridge. 
SHAHAR Y., GOREN-BAR D., BOAZ D., TAHAN G. (2006). Distributed, intelligent, interactive 
visualization and exploration of time-oriented clinical data and their abstractions, Artif Intell Med, 
38(2), 115-135. 
VAN DER MEULEN, M., LOGIE R.H.,  FREER Y., SYKES C., MCINTOSH N., HUNTER J. (2009). When a 
graph is poorer than 100 words: A comparison of computerised Natural Language Generation, human 
generated descriptions and graphical displays in neonatal intensive care, Appl Cogn Psychol.  </p>

</div></div>
</body></html>