<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Segmentation et classification non supervis&#233;e de conversations t&#233;l&#233;phoniques automatiquement retranscrites</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009
</p>
<p>Segmentation et classification non supervis&#233;e de conversations 
t&#233;l&#233;phoniques automatiquement retranscrites
</p>
<p>Laurent Bozzi, Philippe Suignard, Claire Waast-Richard
</p>
<p>EDF R&amp;D
1, avenue du G&#233;n&#233;ral de Gaulle
</p>
<p>92141 Clamart Cedex
Laurent.Bozzi@edf.fr, Philippe.Suignard@edf.fr, Claire.Waast-Richard@edf.fr
</p>
<p>R&#233;sum&#233; : Cette &#233;tude porte sur l&#8217;analyse de conversations entre des clients et des t&#233;l&#233;-
conseillers  d&#8217;EDF.  Elle  propose  une  cha&#238;ne  de  traitements  permettant  d&#8217;automatiser  la 
d&#233;tection  des  sujets  abord&#233;s  dans  chaque  conversation.  L&#8217;aspect  multi-th&#233;matique  des 
conversations nous incite &#224; trouver une unit&#233; de documents entre le simple tour de parole et la 
conversation enti&#232;re. Cette d&#233;marche encha&#238;ne une &#233;tape de segmentation de la conversation 
en th&#232;mes homog&#232;nes bas&#233;e sur la notion de coh&#233;sion lexicale, puis une &#233;tape de text-mining 
comportant une analyse linguistique enrichie d&#8217;un vocabulaire m&#233;tier sp&#233;cifique &#224; EDF, et 
enfin  une  classification  non  supervis&#233;e  des  segments  obtenus.  Plusieurs  algorithmes  de 
segmentation ont &#233;t&#233; &#233;valu&#233;s sur un corpus de test, segment&#233; et annot&#233; manuellement : le plus 
&#171; proche &#187; de la segmentation de r&#233;f&#233;rence est C99. Cette d&#233;marche, appliqu&#233;e &#224; la fois sur un 
corpus de conversations transcrites &#224; la main, et sur les m&#234;mes conversations d&#233;cod&#233;es par un 
moteur  de  reconnaissance  vocale,  aboutit  quasiment  &#224;  l&#8217;obtention  des  20  m&#234;mes  classes 
th&#233;matiques. 
</p>
<p>Abstract : This study focuses on the analysis of conversations and between clients and 
EDF agent. It offers a range of treatments designed to automate the detection of the topics 
covered in  each conversation.  As the  conversations  are  multi-thematic  we have to  find a 
document unit, between the simple turn of speech and the whole conversation. The proposed 
approach starts with a step of segmentation of the conversation (based on lexical cohesion), 
and then a stage of text-mining, including a language enriched by a vocabulary specific to 
EDF, and finally a clustering of the segments. Several segmentation algorithms were tested on 
a test corpus, manually annotated and segmented : the &quot;closest&quot; to the reference segmentation 
is C99. This approach, applied to both a corpus of conversations transcribed manually, and on 
the same conversations decoded by a voice recognition engine, leads to almost obtain the 
same 200 clusters.
</p>
<p>Mots-cl&#233;s : audio-mining, text mining, segmentation, classification, cat&#233;gorisation, 
reconnaissance vocale, donn&#233;es textuelles, conversations t&#233;l&#233;phoniques, centre d&#8217;appel.
Keywords : audio-mining, text mining, segmentation, clustering, categorization, voice 
recognition, textual data, phone conversation, call center.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bozzi Laurent, Suignard Philippe, Waast-Richard Claire
</p>
<p>1 Introduction
Le d&#233;veloppement des NTIC dans une entreprise de la taille du Groupe EDF a entra&#238;n&#233; une 
augmentation  du  volume et  des  flux  de  donn&#233;es  h&#233;t&#233;rog&#232;nes  (t&#233;l&#233;phone,  internet  &#8230;) qui 
peuvent &#234;tre trait&#233;es par des m&#233;thodes de fouille et de classement automatique. En particulier 
en ce qui concerne les centres d&#8217;appels, les directions marketing cherchent &#224; mieux conna&#238;tre 
les motifs d&#8217;appels des clients, &#224; en faire une typologie. Il s&#8217;agit de comprendre la relation des 
clients &#224; l&#8217;entreprise mais aussi  de mesurer les impacts de certains &#233;v&#233;nements (publicit&#233;, 
nouvelles offres&#8230;). Le projet  Infom@gic,  du p&#244;le de comp&#233;titivit&#233;  CAP DIGITAL, et  le 
sous-projet CallSurf s&#8217;inscrivent dans le cadre du traitement automatique de conversations.
</p>
<p>Figure 1 : Sch&#233;ma fonctionnel de CallSurf
</p>
<p>CallSurf (Garnier-Rizet, 2008) est un syst&#232;me de transcription et de classement de donn&#233;es 
audio  comportant  plusieurs  &#233;tapes :  enregistrement  des  conversations  entre  client  et  t&#233;l&#233;-
conseiller  dans  un  centre  d&#8217;appel,  transcription  automatique  des  conversations  en  texte, 
classification des conversations pr&#233;alablement segment&#233;es en th&#232;mes homog&#232;nes en un ou 
plusieurs  th&#232;mes  et  cat&#233;gorisation  qui  consiste  &#224;  calculer  un  mod&#232;le  d&#8217;affectation  d&#8217;une 
nouvelle  conversation  &#224;  un  ou  plusieurs  des  th&#232;mes  pr&#233;d&#233;finis.  Les  sections  suivantes 
d&#233;crivent les premiers travaux ayant conduit &#224; une classification automatique satisfaisante des 
conversations t&#233;l&#233;phoniques.
</p>
<p>2 Segmentation des conversations
Une  classification  des  conversations  dans  leur  ensemble  s&#8217;av&#232;re  trop  grossi&#232;re  car  une 
conversation peut comporter plusieurs th&#232;mes. A l&#8217;inverse, classifier les tours de paroles est 
difficile car beaucoup d&#8217;&#233;changes oraux sont peu porteurs de sens. C&#8217;est pourquoi, on cherche 
d&#8217;abord &#224; d&#233;couper les conversations en segments homog&#232;nes pour ensuite les classifier. La 
suite de cette partie pr&#233;sente la d&#233;marche suivie afin d&#8217;aboutir &#224; la meilleure segmentation 
possible : constitution d&#8217;un corpus de r&#233;f&#233;rence, test et choix d&#8217;algorithmes.
</p>
<p>2.1 Corpus de r&#233;f&#233;rence
</p>
<p>Plusieurs conversations ont &#233;t&#233; segment&#233;es &#224; la main par des &#171; experts &#187; EDF aboutissant &#224; 
une nomenclature de segmentation et d&#8217;annotation en th&#232;mes (avec environ une vingtaine de 
th&#232;mes possibles comme ouverture, cl&#244;ture, motif, facture&#8230;). Cette description a ainsi permis </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation et classification non supervis&#233;e de conversations t&#233;l&#233;phoniques 
automatiquement retranscrites
de segmenter et d&#8217;annoter manuellement environ 150 conversations, repr&#233;sentant environ 15h, 
et ainsi constituer un corpus de r&#233;f&#233;rence. Ce corpus comporte des particularit&#233;s par rapport &#224; 
d&#8217;autres corpus utilis&#233;s pour tester des algorithmes de segmentation (DEFT par exemple) : il 
s&#8217;agit d&#8217;un corpus de parole conversationnelle, donc assez diff&#233;rent du texte &#233;crit, avec des 
dysfluences, reprises, r&#233;p&#233;titions, mots tronqu&#233;s&#8230; entre deux ou plusieurs personnes, avec du 
vouvoiement entre client et agent EDF, mais tutoiement entre agents. Par ailleurs, il pr&#233;sente 
une grande variabilit&#233; sur la longueur des segments.
</p>
<p>2.2 Algorithmes test&#233;s
</p>
<p>Les  algorithmes  test&#233;s  ici  font  partie  de  la  famille  des  m&#233;thodes  non  supervis&#233;es.  Elles 
s&#8217;appuient sur la notion de coh&#233;sion lexicale et  partent du principe qu&#8217;&#224; un th&#232;me donn&#233;, 
correspond un vocabulaire sp&#233;cifique. Ainsi, pour d&#233;tecter les changements de th&#232;me, il suffit 
de d&#233;tecter les ruptures lexicales. La m&#233;thode fondatrice du domaine s&#8217;appelle &#171; TextTiling &#187; 
(Hearst,  1997).  Pour  nos  conversations  compos&#233;es  de  tours  de  parole,  elle  consiste  &#224; 
consid&#233;rer deux fen&#234;tres lexicales constitu&#233;es de N tours de paroles situ&#233;s avant et apr&#232;s le 
tour de parole i. Pour chaque tour de parole i, on compare le vocabulaire des deux fen&#234;tres par 
la mesure des cosinus. En faisant glisser les deux fen&#234;tres le long des tours de parole, on 
obtient une courbe de coh&#233;sion. D&#233;tecter les chutes de cette coh&#233;sion permet de d&#233;tecter les 
ruptures de th&#232;me.
</p>
<p>Figure 2 : Principe de l&#8217;algorithme TextTiling
</p>
<p>&#171; C99 &#187;  (Cho&#239;,  2000),  est  la  grande  r&#233;f&#233;rence  &#224;  laquelle  toutes  les  autres  m&#233;thodes  se 
comparent. Cette m&#233;thode commence par calculer les similarit&#233;s 2 &#224; 2 entre tous les unit&#233;s 
textuelles (ici les tours de parole), puis regroupe ces unit&#233;s, de mani&#232;re successive, jusqu&#8217;&#224; 
obtenir  la  r&#233;partition  obtenant  la  meilleure  densit&#233;.  Cet  algorithme a  &#233;t&#233;  utilis&#233;  tel  quel, 
directement t&#233;l&#233;charg&#233; depuis le site de son auteur.
</p>
<p>Une m&#233;thode fortement inspir&#233;e de &#171; SegGen &#187; (Lamprier, 2007) a &#233;t&#233; reprogramm&#233;e : elle 
consiste  &#224;  g&#233;n&#233;rer  al&#233;atoirement  une  population  de  N segmentations  pour  un texte  initial 
donn&#233;.  Par  croisements  successifs  des  segmentations  entre  elles,  elle  converge  vers  la 
&#171; meilleure &#187; segmentation en maximisant un score &#171; intra segment &#187; qui mesure la coh&#233;sion 
du segment lui-m&#234;me et en minimisant un score &#171; inter segment &#187; mesurant la similarit&#233; entre 
deux segments cons&#233;cutifs.
</p>
<p>2.3 Mesures de distance
</p>
<p>Pour tester la qualit&#233; des segmentations obtenues par ces algorithmes, nous avons retenu la 
mesure WindowDiff (WD) (Pevzner &amp; Hearst, 2002) :
</p>
<p>Avec             le nombre 
d&#8217;occurrences du mot j dans le 
phrase x (ici, tour de parole x).
</p>
<p>&#8230;
</p>
<p>&#8230;&#8230;.
</p>
<p>..
</p>
<p>&#8230;&#8230;.
</p>
<p>Fg
</p>
<p>Fd
</p>
<p>Ruptures th&#233;matiques</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bozzi Laurent, Suignard Philippe, Waast-Richard Claire
</p>
<p>Avec b(xi, xj) le nombre de fronti&#232;res entre les tours i et j dans le texte x, contenant N tours 
de parole, k &#233;tant un entier fix&#233; au d&#233;part (par exemple la moiti&#233; de la longueur moyenne des 
segments du document de r&#233;f&#233;rence).
</p>
<p>2.4 Tests et r&#233;sultats
</p>
<p>Chacun des 3 algorithmes a &#233;t&#233; test&#233; sur les 150 conversations en faisant varier les traitements 
en amont sur le texte : suppression de la ponctuation, suppression de mots a priori parasites 
comme euh, hum, hein, ben&#8230; ou inutiles comme oui,  non, bon, d&#8217;accord&#8230; ou encore en 
racinisant les mots (pour supprimer les suffixes flexionnels et d&#233;rivationnels). Les conclusions 
de tous ces tests sont les suivantes :
</p>
<p>- C99 est retenu pour g&#233;n&#233;rer la segmentation : avec un WD moyen de 0.45 et un nombre 
moyen de  7.3 tours  de  parole  par  segment  contre  8.3  dans  le  corpus  de r&#233;f&#233;rence.  Il 
pr&#233;sente  l&#8217;int&#233;r&#234;t  d&#8217;&#234;tre  &#171; tout  terrain &#187;  (m&#234;me  quand  il  ne  fournit  pas  toujours  les 
meilleurs r&#233;sultats, la segmentation produite est &#171; correcte &#187;).
</p>
<p>- Tous ces tests poussent &#224; l&#8217;interrogation concernant la fiabilit&#233; de la mesure WD1. Par 
exemple, deux segmentations diff&#233;rentes peuvent obtenir un m&#234;me score, mais avec un 
nombre de segments tr&#232;s diff&#233;rents (10 segments dans un cas et 30 dans l&#8217;autre).
</p>
<p>- Il faut &#233;galement s&#8217;interroger sur les segmentations de r&#233;f&#233;rence (il peut y avoir jusqu&#8217;&#224; 31 
segments dans une conversation). Pour cela, d&#8217;autres conversations sont en train d&#8217;&#234;tre 
segment&#233;es et annot&#233;es &#224; la main pour augmenter la taille du corpus de r&#233;f&#233;rence et par 
des personnes diff&#233;rentes.
</p>
<p>3 Classification des conversations
</p>
<p>La partie de classification des conversations s&#8217;est faite en plusieurs &#233;tapes, et sur plusieurs 
jeux de donn&#233;es, 170 heures (1421 conversations) retranscrites manuellement, dont 20 heures 
(188 conversations) de fa&#231;on d&#233;taill&#233;e.
</p>
<p>3.1 Analyse sur les donn&#233;es retranscrites manuellement
</p>
<p>Pour  les  premiers  essais,  la  d&#233;marche  d&#8217;analyse  textuelle  suivante  a  &#233;t&#233;  suivie :  analyse 
morpho-syntaxique,  lemmatisation,  transformation  des  donn&#233;es  textuelles  en  matrice 
termes*documents, r&#233;duction de cette matrice par d&#233;composition en SVD2 , pond&#233;ration par la 
m&#233;thode  tf*idf,  classification  des  vecteurs  repr&#233;sentant  x%  de  l&#8217;inertie  totale  (x  &#233;tant 
param&#233;trable) par l&#8217;algorithme EM (Expectation-Maximization).
En classifiant les tours de parole en 10 classes, on s&#8217;est aper&#231;us de la n&#233;cessit&#233; de segmenter 
les conversations (cf. &#167;2). Pour les essais suivants, et afin d&#8217;optimiser les r&#233;sultats, nous avons 
jou&#233; sur plusieurs leviers :
- Segmentation de la conversation en parties homog&#232;nes (cf. partie pr&#233;c&#233;dente).
- Am&#233;lioration de la partie linguistique, en utilisant conjointement les possibilit&#233;s offertes 
</p>
<p>par Temis pour d&#233;velopper une &#171; cartouche &#187; sp&#233;cifique &#224; EDF3, et l&#8217;analyseur morpho-
syntaxique de Sinequa, adapt&#233; lui aussi aux donn&#233;es d&#8217;EDF.
</p>
<p>1 Une autre mesure,  &#948;-Front (Fernandez et al.,  2008) a &#233;galement &#233;t&#233; test&#233;e, mais pr&#233;sente le m&#234;me genre 
d&#8217;inconv&#233;nients.
</p>
<p>2 SVD : Singular Value Decomposition (D&#233;composition en valeurs singuli&#232;res) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation et classification non supervis&#233;e de conversations t&#233;l&#233;phoniques 
automatiquement retranscrites
- Classification, par la m&#233;thode k-means. Au vu du nombre d&#8217;essais &#224; pratiquer, sa rapidit&#233; 
</p>
<p>d&#8217;ex&#233;cution &#233;tait un plus, pour des r&#233;sultats tr&#232;s proches, au niveau qualitatif, de ceux 
obtenus avec l&#8217;algorithme EM. Afin de r&#233;duire la matrice termes*documents, nous avons 
essentiellement conserv&#233; les mots pr&#233;sents au moins 3 fois dans l&#8217;ensemble du corpus, et 
&#233;tiquet&#233;s comme verbes, noms communs, adjectifs et concepts cr&#233;&#233;s &#224; l&#8217;&#233;tape pr&#233;c&#233;dente.
</p>
<p>- Augmentation du nombre de classes : on a choisi de faire une classification &#171; &#224; plat &#187; avec 
beaucoup de classes, plut&#244;t qu&#8217;une classification hi&#233;rarchique, avec moins de classes au 
d&#233;part, elles-m&#234;mes sous-classifi&#233;es. 
</p>
<p>Cette m&#233;thode nous a permis de mettre en &#233;vidence une vingtaine de classes, certaines portant 
sur  la  structure  de  la  conversation,  et  d&#8217;autres  sur  son  th&#232;me :  cl&#244;ture/ouverture  de 
conversation, paiement de facture / mensualisation, coordonn&#233;es / r&#233;f&#233;rences client, r&#232;glement 
facture  /  probl&#232;me  de  paiement,  r&#233;siliation,  coordonn&#233;es  de  l&#8217;entreprise,  coordonn&#233;es  du 
client, prise de rendez-vous, probl&#232;me de puissance (souvent demande d&#8217;augmentation), mise 
en  service,  demande  de  branchement  /  raccordement,  coordonn&#233;es  bancaires,  usages 
chauffage, climatisation et autres, &#233;nergies concurrentes (gaz), mise en attente de la part de 
l&#8217;agent / recherche du dossier client, dates ou jours de rendez-vous. En revanche, la taille des 
classes  n&#8217;est  pas  homog&#232;ne,  un  quart  des  segments  de  conversations  concernent  soit 
l&#8217;ouverture  soit  la  cl&#244;ture  de  la  conversation  (car  ces  classes  structurelles  font  partie  de 
quasiment toutes les conversations). De m&#234;me, les &#233;changes de coordonn&#233;es (r&#233;f&#233;rence client, 
adresse, t&#233;l&#233;phone, etc.) repr&#233;sentent une bonne part des segments, 20%.
</p>
<p>3.2 Analyse sur les donn&#233;es retranscrites automatiquement
</p>
<p>Notre objectif &#233;tant de proposer une cha&#238;ne de traitements compl&#232;tement automatis&#233;e, on a 
alors utilis&#233; un premier jeu de donn&#233;es retranscrites automatiquement (reconnaissance vocale). 
Les r&#233;sultats des tests suivants sont toutefois provisoires, car ces donn&#233;es ont servi de base 
d&#8217;apprentissage au mod&#232;le de langage.
On  a  constat&#233;  que  l&#8217;outil  de  classification  &#233;tait  assez  robuste,  puisqu&#8217;on  retrouvait  les 
principaux th&#232;mes des classifications pr&#233;c&#233;dentes, sur donn&#233;es transcrites manuellement. Pour 
illustrer  cela,  si  l&#8217;on  prend  une  classe  qui  nous  int&#233;resse  particuli&#232;rement,  comme  les 
&#171; moyens de paiement &#187;, on constate  que cette classe repr&#233;sente 7% des segments sur les 
conversations retranscrites manuellement et 6% sur les conversations automatiques. En outre, 
le champ lexical caract&#233;risant les classes des deux jeux de donn&#233;es est quasiment le m&#234;me, les 
mots-cl&#233;s caract&#233;risant cette classes &#233;tant les suivants :
</p>
<p>&#8226; Sur les donn&#233;es manuelles :  moyen_paiement  ;  envoyer ;  facture ; r&#232;glement ;  recevoir ;  
carte_bancaire ; r&#233;gler ; courrier ; prelevement ; payer ; noter ; relance ; probleme ; mettre ; voir
</p>
<p>&#8226; Sur  les  donn&#233;es automatiques :  moyen_paiement  ;  envoyer  ;  facture  ;  &#234;tre  ;  recevoir  ;  
r&#232;glement ; courrier ; payer ; r&#233;gler ; y_avoir ; d'accord ; voir ; prelevement ; probleme ; mettre ;  
relance ; retard ; attendre ; jour ; septembre
</p>
<p>4 Conclusions et perspectives
</p>
<p>Nous proposons donc une cha&#238;ne de traitements assez complexe, permettant de passer d&#8217;un 
signal audio, &#224; une liste de th&#232;mes contenus dans ce signal. La d&#233;tection des th&#232;mes de la 
3
</p>
<p> Une &#171; cartouche &#187; de  Temis,  permet  de  prendre  en  compte  des  expressions  r&#233;guli&#232;res,  de  synonymiser 
certains mots ou groupes de mots, et surtout de cr&#233;er des concepts cl&#233;s sp&#233;cifiques au vocabulaire employ&#233; 
dans les conversations de t&#233;l&#233;-conseillers. Par exemple, regroupement sous le concept &#171; moyen de paiement &#187; 
des termes &#171; ch&#232;ques &#187;, &#171; TIP &#187;, &#171; RIB &#187;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bozzi Laurent, Suignard Philippe, Waast-Richard Claire
</p>
<p>conversation a &#233;t&#233; grandement facilit&#233; par la segmentation th&#233;matique automatique (apr&#232;s le 
choix de C99) et la prise en compte de r&#232;gles linguistiques propre au vocabulaire d&#8217;EDF. Par 
ailleurs, le passage de donn&#233;es manuelles &#224; des donn&#233;es automatiquement retranscrites n&#8217;a pas 
perturb&#233;  ce processus.  Cependant,  de  nouvelles  analyses  seront  r&#233;alis&#233;es  sur  des  donn&#233;es 
n&#8217;ayant pas servi &#224; caler le mod&#232;le de langage.
Plusieurs  limites  ou probl&#232;mes sont  apparus.  Concernant  la  segmentation,  les  algorithmes 
automatiques  pr&#233;sentent  plusieurs  param&#232;tres.  De  plus,  le  choix  de  l&#8217;algorithme  de 
segmentation n&#8217;est pas tranch&#233;, en raison de la mesure WD utilis&#233;e, peut-&#234;tre pas adapt&#233;e &#224; un 
corpus oral.  Enfin, lors de la classification, le nombre de classes doit  se faire de mani&#232;re 
experte  &#224;  la  suite  de  plusieurs  it&#233;rations.  De  ce  fait,  &#224;  chaque  &#233;tape  (segmentation, 
classification), nous sommes confront&#233;s &#224; de nombreux choix successifs, dont les effets sur le 
r&#233;sultat final sont difficiles &#224; &#233;valuer. Afin d&#8217;am&#233;liorer les r&#233;sultats, nous essaierons de r&#233;gler 
de fa&#231;on plus fine les param&#232;tres des algorithmes de segmentation, et tenterons d&#8217;am&#233;liorer 
les classifications par des techniques de r&#233;-&#233;chantillonnage.
</p>
<p>Remerciements
</p>
<p>CapDigital, les partenaires du projet :Vecsys, LIMSI, Sin&#233;qua et T&#233;mis.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CAILLIAU F., POUDAT C., (2008) Caract&#233;risation lexicale des contributions clients agents dans un 
corpus de conversations t&#233;l&#233;phoniques retranscrites, JADT 2008.
CHOI F. Y. Y. (2000). Advances  in  domain  independent  linear  text  segmentation.  In 
Proceedings  of  the  1st  Meeting  of  the  North  American  Chapter  of  the  Association  for 
Computational Linguistics, USA.
FERNANDEZ S., SANJUAN E., TORRES-MORENO J-M. (2008). Enertex: un syst&#232;me bas&#233; sur l'&#233;nergie 
textuelle. Actes de Traitement Automatique de la Langue Naturelle, TALN 2008.
GARNIER-RIZET M., ADDA G., CAILLIAU F., GAUVAIN J. L., GUILLEMIN-LANNE S., LAMEL L., VANNI S., 
WAAST-RICHARD C. (2008). CallSurf - Automatic transcription,  indexing and structuration of 
call center conversational speech for knowledge extraction and query by content, LREC 2008.
HEARST M. A. (1997). Text-tiling : segmenting text into multi-paragraph subtopic passages. 
Computational Linguistics, p. 59&#8211;66.
LABADI&#201; A., PRINCE V. (2008). Comparaison de m&#233;thodes lexicales et syntaxico-s&#233;mantiques 
dans la segmentation th&#233;matique de texte non supervis&#233;e. Actes de Traitement Automatique 
de la Langue Naturelle, TALN 2008.
LAMPRIER S.,  AMGHAR T.,  LEVRAT B.,  SAUBION F. (2007)  SegGen:  A  Genetic  Algorithm  for 
Linear Text Segmentation. Actes de IJCAI.
PEVZNER L. &amp; HEARST M. A. (2002). A critique and improvement of an evaluation metric for text 
segmentation. Computational Linguistics, p. 19&#8211;36.</p>

</div></div>
</body></html>