<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>anymalign : un outil d&#8217;alignement sous-phrastique libre pour les &#234;tres humains</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>anymalign : un outil d&#8217;alignement sous-phrastique libre
pour les &#234;tres humains
</p>
<p>Adrien Lardilleux Yves Lepage
GREYC, Universit&#233; de Caen Basse-Normandie
</p>
<p>pr&#233;nom.nom@info.unicaen.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons anymalign, un aligneur sous-phrastique grand public. Ses r&#233;-
sultats ont une qualit&#233; qui rivalise avec le meilleur outil du domaine, GIZA++. Il est rapide
et simple d&#8217;utilisation, et permet de produire dictionnaires et autres tables de traduction en
une seule commande. &#192; notre connaissance, c&#8217;est le seul outil au monde permettant d&#8217;aligner
un nombre quelconque de langues simultan&#233;ment. Il s&#8217;agit donc du premier aligneur sous-
phrastique r&#233;ellement multilingue.
</p>
<p>Abstract. We present anymalign, a sub-sentential aligner oriented towards end users. It
produces results that are competitive with the best known tool in the domain, GIZA++. It is
fast and easy to use, and allows dictionaries or translation tables to be produced in a single
command. To our knowledge, it is the only tool in the world capable of aligning any number of
languages simultaneously. It is therefore the first truly multilingual sub-sentential aligner.
</p>
<p>Mots-cl&#233;s : alignement sous-phrastique, multilinguisme, table de traduction.
</p>
<p>Keywords: sub-sentential alignment, multilinguism, translation table.
</p>
<p>1 Vue d&#8217;ensemble
</p>
<p>L&#8217;alignement sous-phrastique consiste &#224; extraire des traductions d&#8217;unit&#233;s textuelles de grain
inf&#233;rieur &#224; la phrase &#224; partir de textes multilingues dont les phrases ont pr&#233;alablement &#233;t&#233; mises
en correspondance. Le plus connu des outils disponibles est sans conteste GIZA++ (Och &amp;
Ney, 2003). Il impl&#233;mente les mod&#232;les probabilistes IBM. Bien que produisant des r&#233;sultats
d&#8217;une grande qualit&#233;, beaucoup de ses utilisateurs sont loin d&#8217;en saisir toutes les subtilit&#233;s, car
de tels mod&#232;les sont d&#8217;une grande complexit&#233;. Cette complexit&#233; se r&#233;percute sur l&#8217;interface
d&#8217;utilisation de l&#8217;outil.
</p>
<p>Pour r&#233;pondre &#224; toutes ces difficult&#233;s, nous mettons &#224; disposition de tous un aligneur sous-
phrastique qui se distingue de GIZA++ selon plusieurs points. Il est :
r&#233;ellement multilingue : il permet d&#8217;aligner un nombre quelconque de langues simultan&#233;-
</p>
<p>ment. Contrairement aux mod&#232;les d&#8217;alignement traditionnels, la m&#233;thode sous-jacente
n&#8217;est pas n&#233;cessairement bilingue. Elle repose sur un traitement alingue, ce qui la rend en
pratique multilingue ;
</p>
<p>simple d&#8217;utilisation : une unique commande suffit dans la plupart des cas. Il n&#8217;y a pas de
param&#232;tre superflu ;
</p>
<p>rapide : la qualit&#233; des alignements produits ne d&#233;pend pas du temps d&#8217;ex&#233;cution. C&#8217;est la cou-
verture du texte d&#8217;origine par les alignements qui augmente en fonction du temps. L&#8217;uti-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Adrien Lardilleux, Yves Lepage
</p>
<p>lisateur peut &#224; tout moment interrompre le traitement et r&#233;colter tous les alignements
obtenus jusqu&#8217;alors. En pratique, quelques secondes suffisent &#224; extraire les alignements
les plus fr&#233;quents &#224; partir de textes de plusieurs centaines de milliers de phrases ;
</p>
<p>facilement parall&#233;lisable : plusieurs processus peuvent &#234;tre lanc&#233;s simultan&#233;ment, sur plu-
sieurs machines par exemple. Les sorties de chacun peuvent &#234;tre fusionn&#233;es sans difficult&#233;
aucune ;
</p>
<p>facilement int&#233;grable : les formats d&#8217;entr&#233;e et de sortie sont de simples fichiers textes, ais&#233;-
ment r&#233;utilisables dans tout environnement (par exemple un pipeline Unix ou une plate-
forme de traitement linguistique). D&#8217;autres formats sont disponibles, tels que des sorties
directement compatibles avec le d&#233;codeur statistique Moses, HTML, ou encore le format
professionnel de m&#233;moire de traduction, TMX de LISA ;
</p>
<p>complet : contrairement &#224; un aligneur qui &#233;tablit des liens entre les mots sources et cibles d&#8217;un
couple de phrases traductions l&#8217;une de l&#8217;autre, anymalign produit directement des tables
de traduction constitu&#233;es d&#8217;alignements (suites de mots connexes ou non) et de leurs
scores associ&#233;s : actuellement fr&#233;quence, probabilit&#233;s de traduction et poids lexicaux ;
</p>
<p>portable : le programme est &#233;crit dans le langage de programmation Python, disponible sur
la plupart des syst&#232;mes d&#8217;exploitation (actuellement la version 2.4 suffit). Il ne n&#233;cessite
aucun module externe : seule la biblioth&#232;que standard est utilis&#233;e. Il est constitu&#233; d&#8217;un
unique fichier ex&#233;cutable : aucune installation n&#8217;est n&#233;cessaire.
</p>
<p>2 En th&#233;orie
</p>
<p>La m&#233;thode d&#8217;alignement originale a &#233;t&#233; d&#233;crite dans (Lardilleux &amp; Lepage, 2008). Les &#233;tapes
sont les suivantes :
</p>
<p>1. transformer le corpus d&#8217;entr&#233;e multilingue en un corpus alingue, c&#8217;est-&#224;-dire supprimer
les limites entre langues apr&#232;s discrimination des formes surfaciques des mots selon leur
langue d&#8217;origine. Sur le corpus trilingue fran&#231;ais-anglais-arabe ci-dessous, cette discri-
mination a &#233;t&#233; faite par indi&#231;age sur les langues (voir en particulier les points de fin de
phrases) ;
</p>
<p>2. extraire un sous-corpus par &#233;chantillonnage. En pratique, des sous-corpus de petite taille
sont privil&#233;gi&#233;s car ils fournissent de meilleurs r&#233;sultats (Lardilleux &amp; Lepage, 2008),
comme le sous-corpus suivant :
</p>
<p>1 Un1 caf&#233;1 ,1 s&#8217;il1 vous1 pla&#238;t1 .1 One2 coffee2 ,2 please2 .2 3 . 3&#189;&#202; &#9;&#146; &#9;&#772; 3 &#9;&#225;&#211; 3, 3 &#16;&#232;&#241;&#234;&#16;&#772;
</p>
<p>2 Ce1 caf&#233;1 est1 excellent1 .1 This2 coffee2 is2 excellent2 .2 3 . 3 &#16;&#232; &#9;PA&#16;J&#220;&#216; 3 &#16;&#232;&#241;&#234;&#16;&#772; 3 &#232; &#9;Y&#235;
3 Un1 th&#233;1 fort1 .1 One2 strong2 tea2 .2 3 . 3&#201;J&#10;&#16;&#174;&#17;K 3&#248;&#10; A
</p>
<p>&#17;&#131;
3. regrouper les mots de ce sous-corpus en fonction des lignes sur lesquelles ils appa-
</p>
<p>raissent : les mots d&#8217;un m&#234;me groupe apparaissent strictement sur les m&#234;mes lignes
(l&#8217;ordre des mots importe peu) :
</p>
<p>Les mots : apparaissent sur les lignes :
1 Un1 One2 1 3
2 caf&#233;1 coffee2 3
</p>
<p>&#16;&#232;&#241;&#234;&#16;&#772; 1 2
3 ,1 s&#8217;il1 vous1 pla&#238;t1 ,2 please2 3&#189;&#202; &#9;&#146; &#9;&#772; 3 &#9;&#225;&#211; 3, 1
4 .1 .2 3 . 1 2 3
5 Ce1 est1 excellent1 This2 is2 excellent2 3
</p>
<p>&#16;&#232; &#9;PA&#16;J&#220;&#216; 3 &#232; &#9;Y&#235; 2
6 th&#233;1 fort1 strong2 tea2 3&#201;J&#10;&#16;&#174;&#17;K 3&#248;&#10; A
</p>
<p>&#17;&#131; 3</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>anymalign : un outil d&#8217;alignement sous-phrastique libre pour les &#234;tres humains
</p>
<p>4. pour chaque groupe, relire les lignes du sous-corpus o&#249; ce groupe appara&#238;t, et en extraire
deux alignements :
</p>
<p>(a) la s&#233;quence ordonn&#233;e constitu&#233;e des mots du groupe ;
(b) la s&#233;quence compl&#233;mentaire de cette s&#233;quence ordonn&#233;e &#233;galement.
</p>
<p>Par exemple, le groupe 2 permet d&#8217;extraire la s&#233;quence ordonn&#233;e &#171; caf&#233;1 coffee2 3
&#16;&#232;&#241;&#234;&#16;&#772; &#187;
</p>
<p>et son compl&#233;mentaire &#171; Un1 _ ,1 s&#8217;il1 vous1 pla&#238;t1 .1 One2 _ ,2 please2 .2 3 . 3&#189;&#202; &#9;&#146; &#9;&#772; 3 &#9;&#225;&#211; 3, &#187;
de la ligne 1. Il permet aussi d&#8217;extraire &#171; caf&#233;1 coffee2 3
</p>
<p>&#16;&#232;&#241;&#234;&#16;&#772; &#187; et son nouveau compl&#233;-
mentaire &#171; Ce1 _ est1 excellent1 .1 This2 _ is2 excellent2 .2 3 . 3 &#16;&#232; &#9;PA&#16;J&#220;&#216; _ 3 &#232; &#9;Y&#235; &#187; de la ligne 3.
Chaque groupe est donc susceptible de produire deux alignements par ligne ;
</p>
<p>5. r&#233;p&#233;ter les &#233;tapes 2 &#224; 4 tant que de nouveaux alignements sont produits, ou jusqu&#8217;&#224; ce
que l&#8217;utilisateur interrompe le processus. Le nombre de fois que chaque alignement a
&#233;t&#233; obtenu permet de d&#233;duire les probabilit&#233;s de traduction associ&#233;es. Des poids lexicaux
peuvent &#233;galement &#234;tre calcul&#233;s &#224; partir des cooccurrences de mots dans le corpus initial.
</p>
<p>3 En pratique
</p>
<p>Le programme impl&#233;mentant la m&#233;thode d&#233;crite ci-dessus est t&#233;l&#233;chargeable &#224; l&#8217;adresse :
http://users.info.unicaen.fr/~alardill/anymalign/
</p>
<p>Il permet de traiter des quantit&#233;s de donn&#233;es consid&#233;rables tout en minimisant les ressources
n&#233;cessaires. &#201;tant donn&#233; un corpus multilingue disponible dans des fichiers s&#233;par&#233;s avec une
phrase par ligne, la simple commande :
</p>
<p>python anymalign.py langue1.txt langue2.txt [...]
suffit pour obtenir une table de traduction. La figure 1 donne un exemple de r&#233;sultat en HTML.
</p>
<p>FIG. 1 &#8211; Exemple d&#8217;un d&#233;but de sortie d&#8217;anymalign sur un corpus japonais-anglais-arabe. Les
alignements sont tri&#233;s par fr&#233;quence. Les meilleurs alignements sont mis en &#233;vidence par la
couleur.
</p>
<p>R&#233;f&#233;rences
LARDILLEUX A. &amp; LEPAGE Y. (2008). A truly multilingual, high coverage, accurate, yet
simple, sub-sentential alignment method. Dans Proceedings of the 8th Conference of the
Association for Machine Translation in the Americas (AMTA 2008), p. 125&#8211;132, Waikiki,
Hawai&#8217;i, &#201;tats-Unis.
OCH F. &amp; NEY H. (2003). A systematic comparison of various statistical alignment models.
Computational Linguistics, 29, 19&#8211;51.</p>

</div></div>
</body></html>