<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Influence des points d&#8217;ancrage pour l&#8217;extraction lexicale bilingue &#224; partir de corpus comparables sp&#233;cialis&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Influence des points d&#8217;ancrage pour l&#8217;extraction lexicale
bilingue &#224; partir de corpus comparables sp&#233;cialis&#233;s
</p>
<p>Emmanuel Prochasson Emmanuel Morin
Universit&#233; de Nantes, LINA - UMR CNRS 6241
</p>
<p>2 rue de la Houssini&#232;re, BP 92208, 44322 Nantes Cedex 03
{emmanuel.prochasson,emmanuel.morin}@univ-nantes.fr
</p>
<p>R&#233;sum&#233;. L&#8217;extraction de lexiques bilingues &#224; partir de corpus comparables affiche de
bonnes performances pour des corpus volumineux mais chute fortement pour des corpus d&#8217;une
taille plus modeste. Pour pallier cette faiblesse, nous proposons une nouvelle contribution au
processus d&#8217;alignement lexical &#224; partir de corpus comparables sp&#233;cialis&#233;s qui vise &#224; renforcer
la significativit&#233; des contextes lexicaux en s&#8217;appuyant sur le vocabulaire sp&#233;cialis&#233; du domaine
&#233;tudi&#233;. Les exp&#233;riences que nous avons r&#233;alis&#233;es en ce sens montrent qu&#8217;une meilleure prise en
compte du vocabulaire sp&#233;cialis&#233; permet d&#8217;am&#233;liorer la qualit&#233; des lexiques extraits.
</p>
<p>Abstract. Bilingual lexicon extraction from comparable corpora gives good results for
large corpora but drops significantly for small size corpora. In order to compensate this weak-
ness, we suggest a new contribution dedicated to the lexical alignment from specialized compa-
rable corpora that strengthens the representativeness of the lexical contexts based on domain-
specific vocabulary. The experiments carried out in this way show that taking better account the
specialized vocabulary induces a significant improvement in the quality of extracted lexicons.
</p>
<p>Mots-cl&#233;s : Corpus comparable, extraction de lexiques bilingues, points d&#8217;ancrage.
Keywords: Comparable corpus, bilingual lexicon extraction, anchor points.
</p>
<p>1 Introduction
</p>
<p>L&#8217;extraction de lexiques bilingues &#224; partir de corpus comparables a connu un essor important
depuis le d&#233;but des ann&#233;es quatre-vingt dix (Rapp, 1995; Fung, 1998; Rapp, 1999; Chiao &amp;
Zweigenbaum, 2002; Morin &amp; Daille, 2004, entre autres). Cet int&#233;r&#234;t pour l&#8217;exploitation de
corpus comparables est principalement li&#233; aux difficult&#233;s de disposer de corpus parall&#232;les, no-
tamment lorsqu&#8217;il s&#8217;agit d&#8217;exploiter un mat&#233;riau textuel ne faisant pas intervenir l&#8217;anglais. En
outre, les lexiques bilingues obtenus &#224; partir de corpus parall&#232;les sont quelque peu biais&#233;s. En
effet, un corpus parall&#232;le &#233;tant constitu&#233; d&#8217;un texte dans une langue source et de sa traduction
dans une langue cible, le vocabulaire rencontr&#233; dans la partie traduite est fortement influenc&#233;
par celui de la langue source en particulier dans les domaines sp&#233;cialis&#233;s. Les recherches se
sont donc tourn&#233;es vers l&#8217;exploitation de corpus comparables, c&#8217;est-&#224;-dire des corpus regrou-
pant des textes dans des langues diff&#233;rentes qui ne sont pas en correspondance de traduction
mais qui partagent des traits communs comme le domaine, le th&#232;me, la p&#233;riode... Ces corpus
sont plus largement disponibles, et les textes qui les composent ont &#233;t&#233; &#233;crits ind&#233;pendamment
dans chaque langue.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Prochasson, Emmanuel Morin
</p>
<p>La m&#233;thode par traduction directe associ&#233;e &#224; l&#8217;exploitation des corpus comparables donne de
bons r&#233;sultats pour des corpus volumineux (Rapp, 1999, centaine de millions de mots) mais
chute fortement pour des corpus d&#8217;une taille plus modeste (Chiao &amp; Zweigenbaum, 2002, au-
tour de 1 million de mots). Nous proposons dans cet article une nouvelle contribution &#224; la
m&#233;thode par traduction directe visant &#224; am&#233;liorer la qualit&#233; des lexiques bilingues extraits &#224;
partir de corpus comparables sp&#233;cialis&#233;s de taille modeste. Cette contribution vise &#224; renforcer
la significativit&#233; des contextes lexicaux de la m&#233;thode par traduction directe en s&#8217;appuyant sur
le vocabulaire sp&#233;cialis&#233; caract&#233;ristique du domaine &#233;tudi&#233;.
</p>
<p>Apr&#232;s avoir pr&#233;sent&#233; la m&#233;thode par traduction directe et pr&#233;cis&#233; les enjeux de la caract&#233;risation
des contextes des termes en section 2, nous pr&#233;cisons la notion de point d&#8217;ancrage sous-jacente
&#224; ce travail et montrons son int&#233;gration avec la m&#233;thode directe en section 3. Cette notion est
illustr&#233;e &#224; travers deux exemples de vocabulaire sp&#233;cialis&#233; : les translitt&#233;rations et les compos&#233;s
savants. Nous pr&#233;sentons ensuite les ressources et outils utilis&#233;s dans ce travail en section 4,
puis les diff&#233;rentes exp&#233;riences r&#233;alis&#233;es visant &#224; pr&#233;ciser l&#8217;influence de ces points d&#8217;ancrage
dans le processus d&#8217;alignement en section 5. Enfin, la section 6 dresse le bilan de ce travail.
</p>
<p>2 Extraction lexicale bilingue &#224; partir de corpus comparables
2.1 Caract&#233;risation des contextes des termes
Les premi&#232;res recherches en extraction lexicale &#224; partir de corpus comparables se sont naturel-
lement &#233;loign&#233;es des approches propos&#233;es pour les corpus parall&#232;les et ont propos&#233; de chercher
des caract&#233;ristiques qui seront proches entre un terme i et sa traduction t(i) et &#233;loign&#233;s entre un
terme i et d&#8217;autres mots qui n&#8217;en sont pas traductions. Fung (1995) a d&#8217;abord propos&#233; de s&#8217;int&#233;-
resser &#224; la productivit&#233; des termes, c&#8217;est-&#224;-dire le nombre de voisins directs rencontr&#233;s dans le
corpus ; l&#8217;hypoth&#232;se pos&#233;e &#233;tant que ces productivit&#233;s (productivit&#233;s &#224; gauche et &#224; droite) &#233;taient
proches entre un terme i et sa traduction t(i), mais tr&#232;s diff&#233;rentes pour des termes qui ne sont
pas en rapport de traduction. &#192; la m&#234;me p&#233;riode, Rapp (1995) propose une approche comparant
les motifs de relations d&#8217;associations entre un terme i et l&#8217;ensemble de ses voisins (l&#8217;association
entre deux termes indique dans quelle mesure ils apparaissent plus souvent ensemble que par
chance). Il proposait l&#8217;hypoth&#232;se qu&#8217;un mot i et sa traduction t(i) devaient avoir des motifs
d&#8217;associations comparables.
</p>
<p>Ces deux approches r&#233;alisent le bond conceptuel vers l&#8217;extraction &#224; partir de corpus compa-
rables : elles proposent de s&#8217;appuyer non plus sur un terme i &#224; traduire, mais sur son contexte,
c&#8217;est-&#224;-dire sur l&#8217;ensemble des mots avec lesquels i cooccurre. Elles font ainsi &#233;cho &#224; la propo-
sition de Firth (1957) : &#171; on reconna&#238;t un mot &#224; ses fr&#233;quentations &#187; 1. Le processus d&#8217;extraction
&#224; partir de corpus comparables repose donc en grande partie sur la capacit&#233; &#224; caract&#233;riser les
contextes des termes &#224; aligner. La m&#233;thode par traduction directe propose de s&#8217;appuyer sur des
ressources linguistiques existantes pour comparer les contextes des termes. Elle propose aussi
une structure de donn&#233;es pour enregistrer ces contextes.
</p>
<p>2.2 M&#233;thode par traduction directe
</p>
<p>La m&#233;thode par traduction directe, introduite par Fung (1998) et Rapp (1999), s&#8217;inspire des
mod&#232;les de contextes pour les corpus monolingues ainsi que des m&#233;thodes d&#8217;extraction d&#8217;in-
formation en rempla&#231;ant les concepts de requ&#234;te et de document par ceux de termes et contexte
</p>
<p>1&#171; You shall know a word by the company it keeps &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Influence des points d&#8217;ancrage pour l&#8217;extraction lexicale bilingue
</p>
<p>FIG. 1 &#8211; M&#233;thode par traduction directe.
</p>
<p>des termes. Le principe de cette m&#233;thode, illustr&#233;e par le sch&#233;ma de la figure 1, s&#8217;impl&#233;mente
de la mani&#232;re suivante :
Construction des vecteurs de contexte pour chaque mot i. Nous collectons tous les mots qui
</p>
<p>cooccurrent dans une fen&#234;tre donn&#233;e. Nous obtenons, pour chaque mot i des corpus
source et cible, un vecteur de contexte qui regroupe l&#8217;ensemble des mots j qui appa-
raissent avec i, associ&#233;s avec leur nombre de cooccurrences. Nous appelons i la t&#234;te du
vecteur et j les &#233;l&#233;ments du vecteur. Et nous d&#233;signons par occ(i, j) le nombre de cooc-
currences des &#233;l&#233;ments i et j.
</p>
<p>Normalisation des vecteurs de contexte en utilisant des mesures d&#8217;association, telles que le
Taux de vraisemblance (Dunning, 1993) (cf. &#233;quation 1 et table 1), entre la t&#234;te d&#8217;un
vecteur et ses &#233;l&#233;ments. De cette mani&#232;re, les vecteurs de contexte sont compar&#233;s non
plus sur les fr&#233;quences de leurs &#233;l&#233;ments, mais sur le motif des associations entre la t&#234;te
et les &#233;l&#233;ments des vecteurs.
</p>
<p>Traduction des vecteurs de contexte en utilisant un dictionnaire bilingue. Pour chaque mot
dont nous voulons obtenir la traduction, nous traduisons les &#233;l&#233;ments de son vecteur de
contexte. Si le dictionnaire propose plusieurs traductions pour un &#233;l&#233;ment, nous ajoutons
au vecteur de contexte de i l&#8217;ensemble des traductions propos&#233;es (lesquelles sont pond&#233;-
r&#233;es par la fr&#233;quence de la traduction en langue cible).
</p>
<p>S&#233;lection des vecteurs de contexte proches en utilisant des mesures de similarit&#233;. Plus deux
vecteurs de contexte sont proches, plus il est probable qu&#8217;ils correspondent &#224; des traduc-
tions.
</p>
<p>Nous obtenons ainsi, pour chaque mot &#224; traduire, une liste ordonn&#233;e (par ordre de similarit&#233;)
des candidats &#224; la traduction.
</p>
<p>j &#172;j
i a = occ(i, j) b = occ(i,&#172;j)
&#172;i c = occ(&#172;i, j) d = occ(&#172;i,&#172;j)
</p>
<p>TAB. 1 &#8211; Table de contingence pour un couple i et j
</p>
<p>&#955;(i, j) = a log(a) + b log(b) + c log(c) + d log(d) + (1)
(a + b + c + d) log(a + b + c + d)&#8722; (a + b) log(a + b)&#8722;
</p>
<p>(a + c) log(a + c)&#8722; (b + d) log(b + d)&#8722; (c + d) log(c + d)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Prochasson, Emmanuel Morin
</p>
<p>2.3 Quelques r&#233;sultats de la m&#233;thode directe
Il est malheureusement assez difficile de comparer les r&#233;sultats entre les diff&#233;rentes &#233;tudes pu-
bli&#233;es sur ce sujet, en raison des diff&#233;rences entre les corpus exploit&#233;s (en particulier leurs
contraintes de construction et leur volume) mais aussi de la couverture et de la pertinence des
ressources linguistiques utilis&#233;es pour la traduction. &#192; ce jour, il n&#8217;existe &#224; notre connaissance
aucune exp&#233;rience et aucun jeu de ressources de r&#233;f&#233;rence.
Les r&#233;sultats de la m&#233;thode par traduction directe s&#8217;&#233;valuent sur le nombre de candidats correc-
tement align&#233;s, trouv&#233;s dans la liste des x premiers candidats propos&#233;s (le Topx). Rapp (1999)
obtient par exemple 72 % de r&#233;sultats corrects pour le Top1 et 89 % pour le Top10 avec un cor-
pus comparable compos&#233; d&#8217;articles de journaux (135 millions de mots pour la partie anglaise
et 163 millions pour la partie allemande) et un dictionnaire bilingue contenant 16 380 entr&#233;es
(termes simples). Chiao &amp; Zweigenbaum (2002), en s&#8217;appuyant sur un corpus m&#233;dical fran-
&#231;ais/anglais de 1,2 millions de mots et un dictionnaire sp&#233;cialis&#233; de 18 437 entr&#233;es, obtiennent
20 % de pr&#233;cision pour le Top1 et environ 60 % pour le Top20. Ces r&#233;sultats sont moins bons
que ceux de Rapp (1999) mais s&#8217;expliquent ais&#233;ment par la diff&#233;rence de taille des corpus utili-
s&#233;s. Pr&#233;cisons que nous nous int&#233;ressons dans cet article uniquement &#224; l&#8217;alignement de termes
simples mais que d&#8217;autres recherches se sont port&#233;es sur l&#8217;alignement de termes complexes,
notamment Morin &amp; Daille (2004).
</p>
<p>3 Points d&#8217;ancrage dans les corpus comparables
</p>
<p>3.1 Vocabulaire sp&#233;cialis&#233; comme point d&#8217;ancrage
</p>
<p>Nous cherchons &#224; renforcer la significativit&#233; des vecteurs de contexte construits sur des pe-
tits corpus, en recherchant des points d&#8217;ancrage. Ces points d&#8217;ancrage doivent &#234;tre des &#233;l&#233;-
ments de confiance, c&#8217;est-&#224;-dire des &#233;l&#233;ments dont l&#8217;absence ou la pr&#233;sence dans un vecteur de
contexte est particuli&#232;rement discriminante pour caract&#233;riser un terme. Notons que cette notion
est proche de celle utilis&#233;e avec les corpus parall&#232;les (Brown et al., 1991), c&#8217;est-&#224;-dire des &#233;l&#233;-
ments align&#233;s avec confiance et sur lesquels les m&#233;thodes peuvent s&#8217;appuyer pour aligner leurs
voisins.
</p>
<p>En pratique, ces points d&#8217;ancrage doivent avoir plusieurs propri&#233;t&#233;s :
1. Ils doivent &#234;tre faciles &#224; identifier.
2. Ils doivent &#234;tre pertinents, relativement aux th&#232;mes des documents &#224; aligner.
3. Ils doivent &#234;tre peu polys&#233;miques, pour ne pas &#234;tre ambigus.
</p>
<p>Nous &#233;mettons l&#8217;hypoth&#232;se que ces points d&#8217;ancrage sont des &#233;l&#233;ments discriminants dans la ca-
ract&#233;risation des contextes des termes et qu&#8217;ils peuvent &#234;tre employ&#233;s efficacement pour am&#233;-
liorer les r&#233;sultats de la m&#233;thode directe. Dans ce cadre, nous nous sommes int&#233;ress&#233;s aux
translitt&#233;rations et aux compos&#233;s savants.
</p>
<p>Nous appelons translitt&#233;ration le ph&#233;nom&#232;ne d&#8217;emprunt d&#8217;un mot d&#8217;une langue source &#224; desti-
nation d&#8217;une langue cible, ne partageant pas n&#233;cessairement les m&#234;mes phon&#232;mes ni les m&#234;mes
symboles d&#8217;&#233;criture. Le mot emprunt&#233; est alors adapt&#233; graphiquement dans la langue cible,
sur la base de sa prononciation et non de son sens (Knight &amp; Graehl, 1997). Dans Prochasson
et al. (2008), nous avons montr&#233; la pro&#233;minence des translitt&#233;rations dans le corpus anglais-
fran&#231;ais-japonais que nous utilisons ici et que nous pr&#233;sentons en section 4.1. Elles sont de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Influence des points d&#8217;ancrage pour l&#8217;extraction lexicale bilingue
</p>
<p>bonnes candidates pour &#234;tre des points d&#8217;ancrage. Elles sont en effet faciles &#224; identifier, car
&#233;crites dans un syllabaire principalement d&#233;di&#233; aux mots d&#8217;emprunt en japonais (les kataka-
nas) ; elles sont &#233;galement repr&#233;sentatives d&#8217;un vocabulaire sp&#233;cifique qui recouvre le vocabu-
laire sp&#233;cialis&#233; (elles sont parfois utilis&#233;es alors m&#234;me qu&#8217;il existe un mot plus ancien et &#233;qui-
valent en japonais). Les translitt&#233;rations japonaises sont issues pour la plupart de l&#8217;anglais, mais
peuvent dans de nombreux cas &#234;tre align&#233;es avec des termes fran&#231;ais, en raison des relations de
cognats fr&#233;quentes entre le fran&#231;ais et l&#8217;anglais. Par exemple, le terme japonais&#12452;&#12531;&#12473;&#12522;&#12531; /
i-n-su-ri-n peut s&#8217;aligner en anglais avec insulin et en fran&#231;ais avec insuline.
</p>
<p>Nous nous sommes &#233;galement pench&#233;s sur les compos&#233;s savants. Ils s&#8217;agit de mots, en fran&#231;ais
et en anglais, construits &#224; partir de racines sp&#233;cifiques (Namer, 2005). Claveau (2007), s&#8217;int&#233;res-
sant &#224; la traduction automatique de termes biom&#233;dicaux observe que &#171; les termes biom&#233;dicaux
sont construits sur les m&#234;mes racines grecques et latines, et leurs d&#233;rivations tr&#232;s r&#233;guli&#232;res &#187;
(p. 2). Ces mots paraissent &#234;tre des points d&#8217;ancrage pertinents dans le cas d&#8217;un corpus sp&#233;cialis&#233;
sur le diab&#232;te et l&#8217;alimentation tel que le n&#244;tre, puisqu&#8217;ils sont repr&#233;sentatifs d&#8217;un vocabulaire
savant et qu&#8217;ils peuvent &#234;tre facilement identifi&#233;s &#224; partir de leur morphologie.
</p>
<p>3.2 Modification de la m&#233;thode directe
</p>
<p>Nous avons choisi de modifier la m&#233;thode par traduction directe en accordant plus d&#8217;importance
aux points d&#8217;ancrage lors du calcul de l&#8217;association entre la t&#234;te d&#8217;un vecteur et ses &#233;l&#233;ments.
Apr&#232;s avoir calcul&#233; l&#8217;association de fa&#231;on standard, nous rehaussons le score des points d&#8217;an-
crage et diminuons le score des autres &#233;l&#233;ments de mani&#232;re &#224; ce que les sommes des scores
initiaux et finaux soient identiques (voir &#233;quations 2 &#224; 4).
</p>
<p>assocv
a
</p>
<p>:= assocv
a
+&#946; , si a &#8712; PA
</p>
<p>(2)
</p>
<p>assocv
a
</p>
<p>:= assocv
a
&#8722;Decalage , si a /&#8712; PA
</p>
<p>(3)
</p>
<p>Decalage :=
#PA
</p>
<p>#&#172;PA
&#215; &#946; (4)
</p>
<p>Dans ces &#233;quations, #PA est le cardinal de l&#8217;ensemble des points d&#8217;ancrage extraits (et #&#172;PA
le cardinal des autres &#233;l&#233;ments) et assocv
</p>
<p>a
est la mesure d&#8217;association de l&#8217;&#233;l&#233;ment a dans le
</p>
<p>vecteur de contexte v. Le param&#232;tre &#946; permet de calibrer l&#8217;importance donn&#233;e aux points d&#8217;an-
crage. Ce param&#232;tre est ajout&#233; de fa&#231;on absolue au score de chaque point d&#8217;ancrage, et non de
fa&#231;on proportionnelle par rapport au score initial. En effet, nous souhaitons rehausser le score
de tous les points d&#8217;ancrage de mani&#232;re &#224; ce qu&#8217;ils soient pris en compte en priorit&#233; par les
mesures de similarit&#233;.
</p>
<p>4 Ressources et outils exploit&#233;s
</p>
<p>4.1 Ressources linguistiques
</p>
<p>Dans le cadre de cette &#233;tude, nous avons constitu&#233; un corpus trilingue, fran&#231;ais, anglais et ja-
ponais. Les documents qui composent ce corpus ont &#233;t&#233; extraits du Web et concernent le th&#232;me
alimentation et diab&#232;te et appartiennent au registre scientifique2. Les documents ont &#233;t&#233; s&#233;lec-
</p>
<p>2Documents &#233;crits par des experts &#224; destination d&#8217;autres experts (Pearson, 1998, p. 36).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Prochasson, Emmanuel Morin
</p>
<p>tionn&#233;s manuellement, &#224; partir de requ&#234;tes pr&#233;cises sur des moteurs de recherche, mais aussi en
suivant les liens internes des pages propos&#233;es. Ces documents ont &#233;t&#233; convertis de leur format
source HTML ou PDF en texte brut, puis normalis&#233;s &#224; travers les traitements suivants : segmen-
tation en occurrences de formes, &#233;tiquetage morpho-syntaxique et lemmatisation. Nous avons
ainsi collect&#233; 257 000 mots pour la partie fran&#231;aise, 235 000 pour la partie japonaise et 250 000
mots pour la partie anglaise.
</p>
<p>Le dictionnaire fran&#231;ais-japonais, n&#233;cessaire pour l&#8217;&#233;tape de traduction de la m&#233;thode directe,
est compos&#233; de quatre dictionnaires disponibles librement sur Internet3 ainsi que du Diction-
naire scientifique fran&#231;ais-japonais (1989). Il contient 173 156 entr&#233;es, dont 114 461 sont des
termes simples, avec une moyenne de 2,1 traductions par entr&#233;e. Nous avons utilis&#233; le diction-
naire JMDict pour l&#8217;anglais/japonais4 qui est disponible librement sous une licence Creative-
Commons (Attribution-ShareAlike). Nous l&#8217;avons compl&#233;t&#233; de traductions de termes techniques
issus de diff&#233;rentes sources : dictionnaire du Minist&#232;re de l&#8217;&#201;ducation japonais et du National
Institute of Informatics (Tokyo)5 ainsi que du Dictionary of Technical Term (Kotani &amp; Kori,
1990). Il contient 589 956 entr&#233;es avec une moyenne de 2,3 traductions par entr&#233;e et seulement
49 208 termes simples.
</p>
<p>Pour &#233;valuer la qualit&#233; de l&#8217;extraction, nous avons construit une liste de traductions connues.
Nous avons extrait du corpus les mots fran&#231;ais et anglais les plus fr&#233;quents (Nocc &gt; 50) dont
la traduction en japonais est connue. Parmi ces traductions, nous avons s&#233;lectionn&#233; celles ap-
paraissant fr&#233;quemment dans le corpus japonais (Nocc &gt; 50) pour construire une liste de 98
traductions fran&#231;ais-japonais et 99 traductions anglais-japonais. Ce protocole pour constituer
une liste de termes utilis&#233;e pour l&#8217;&#233;valuation est semblable &#224; celui pr&#233;sent&#233; dans Chiao &amp; Zwei-
genbaum (2002) qui travaillent avec une liste de 95 termes pour un corpus anglais/fran&#231;ais de
1,2 millions de mots.
</p>
<p>4.2 Outils
</p>
<p>De nombreux efforts ont &#233;t&#233; r&#233;alis&#233;s pour aligner automatiquement les translitt&#233;rations. Dans
ce travail, nous avons utilis&#233; un outil r&#233;alisant la d&#233;tection automatique de translitt&#233;rations
entre l&#8217;anglais et le japonais (Tsuji, 2001). Bien que plus simple que l&#8217;algorithme propos&#233; par
Knight &amp; Graehl (1997), cet outil, bas&#233; sur des cha&#238;nes de Markov, donne des r&#233;sultats sa-
tisfaisants. Il g&#233;n&#232;re un ensemble de correspondances potentielles pour une entr&#233;e donn&#233;e en
katakana ou en anglais. Les r&#233;sultats doivent alors &#234;tre compar&#233;s avec un vocabulaire existant
pour s&#233;lectionner les candidats les plus probables. Nous obtenons avec cet outil 589 paires de
translitt&#233;rations pour le couple anglais/japonais. En ce qui concerne la d&#233;tection des translitt&#233;-
rations entre le fran&#231;ais et le japonais, nous avons utilis&#233; le m&#234;me outil, n&#8217;ayant pu obtenir un
outil efficace d&#233;di&#233;. Avant traitement, les termes fran&#231;ais &#224; comparer sont normalis&#233;s pour faire
dispara&#238;tre les signes diacritiques sp&#233;cifiques (mais ils sont r&#233;int&#233;gr&#233;s dans les couples align&#233;s).
Nous obtenons 526 paires de translitt&#233;rations pour le couple fran&#231;ais/japonais.
En ce qui concerne la d&#233;tection des compos&#233;s savants, nous nous sommes appuy&#233;s sur une liste
de 606 affixes m&#233;dicaux utilis&#233;s en anglais avec leur correspondance en japonais6. Le processus
</p>
<p>3kanji.free.fr ; quebec-japon.com/lexique/index.php?a=index&amp;d=25 ; dico.fj.
free.fr/index.php ; quebec-japon.com/lexique/index.php?a=index&amp;d=3
</p>
<p>4www.csse.monash.edu.au/~jwb/j_jmdict.html
5sciterm.nii.ac.jp/cgi-bin/reference.cgi
6www.medo.jp/a.htm</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Influence des points d&#8217;ancrage pour l&#8217;extraction lexicale bilingue
</p>
<p>d&#8217;extraction est trivial : en compilant une expression r&#233;guli&#232;re par affixe, il cherche les mots an-
glais correspondant dans les dictionnaires bilingues utilis&#233;s pour l&#8217;alignement. Les mots extraits
sont conserv&#233;s ainsi que leurs traductions en japonais, pour obtenir des paires de traductions uti-
lis&#233;es comme points d&#8217;ancrage dans les vecteurs de contexte. La liste des affixes correspond aux
racines anglaises, mais elle peut facilement &#234;tre traduite en fran&#231;ais, en accord avec la remarque
de Claveau (2007). Nous nous sommes inspir&#233;s de ce travail pour &#233;crire quelques r&#232;gles simples
de conversion. La terminaison -y (comme dans psychology) est par exemple transform&#233;e en
-ie en fran&#231;ais (psychologie). Certains affixes sont tr&#232;s productifs (typiquement le privatif a-)
et les mots correspondants extraits ne sont pas forc&#233;ment form&#233;s &#224; partir de ces pr&#233;fixes (le a de
armoire ne correspond pas au privatif). Tous les affixes g&#233;n&#233;rant plus de 1 000 correspondances
sur les ressources ont donc &#233;t&#233; &#233;cart&#233;s. Ils sont toutefois assez rares et 12 seulement ont &#233;t&#233;
&#233;cart&#233;s pour l&#8217;anglais, 17 pour le fran&#231;ais. Nous avons ainsi obtenu 17 210 compos&#233;s savants en
anglais, correspondant &#224; 60 341 traductions (les ressources linguistiques comprennent des tra-
ductions multiples pour un seul &#233;l&#233;ment source). Nous avons &#233;galement obtenu 8 254 compos&#233;s
savants fran&#231;ais, soit 24 240 traductions. Ces diff&#233;rences de r&#233;sultats proviennent de la nature
des dictionnaires bilingues.
</p>
<p>5 Exp&#233;riences et r&#233;sultats
</p>
<p>5.1 Protocoles
</p>
<p>Nous avons r&#233;alis&#233; plusieurs exp&#233;riences pour &#233;valuer l&#8217;efficacit&#233; et l&#8217;impact des points d&#8217;an-
crage pour l&#8217;alignement lexical bilingue :
&#8211; (a) : approche standard utilisant simplement la m&#233;thode par traduction directe ;
&#8211; (b) : en utilisant les translitt&#233;rations d&#233;tect&#233;es automatiquement ;
&#8211; (c) : en utilisant les mots savants extraits automatiquement.
L&#8217;exp&#233;rience a est une exp&#233;rience t&#233;moin, utilis&#233;e comme &#233;talon pour &#234;tre compar&#233;e avec les
exp&#233;riences b et c.
</p>
<p>Les exp&#233;riences sont r&#233;alis&#233;es avec les m&#234;mes param&#232;tres. Nous utilisons le Taux de vraisem-
blance comme mesure d&#8217;association et le Cosinus comme mesure de similarit&#233;. Nous utilisons
une fen&#234;tre de taille 25 mots avant et apr&#232;s la t&#234;te pour la constitution des vecteurs de contexte,
et un nombre d&#8217;occurrences minimal de 3 pour qu&#8217;un mot soit pris en compte. Ces param&#232;tres
sont ceux qui donnent les meilleurs r&#233;sultats pour l&#8217;exp&#233;rience t&#233;moin. Dans le cas des exp&#233;-
riences b et c, nous faisons varier le param&#234;tre &#946; entre 1 et 10 (par pas de 1).
</p>
<p>5.2 R&#233;sultats
</p>
<p>La table 2 synth&#233;tise les r&#233;sultats obtenus pour les exp&#233;riences a, b et c pour les Top 1 et 10,
pour l&#8217;alignement anglais-japonais et fran&#231;ais-japonais (entre crochets, le gain obtenu).
Les r&#233;sultats pour l&#8217;exp&#233;rience de contr&#244;le a sont comparables &#224; ceux obtenus par Chiao &amp;
Zweigenbaum (2002) discut&#233;s en section 2.3. Dans le cas de l&#8217;anglais, le gain obtenu en s&#8217;ap-
puyant sur les points d&#8217;ancrage est important : &#224; hauteur de 12,5 % en utilisant les translitt&#233;ra-
tions (exp. b &#8211; Top1) et 18,8 % en utilisant les mots savants (exp. c &#8211; Top1). Le gain est moins
important pour le fran&#231;ais-japonais : il est nul pour le Top1 en utilisant les translitt&#233;rations et
atteint 10 % en utilisant les compos&#233;s savants. La moins bonne qualit&#233; de r&#233;sultats avec le fran-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Prochasson, Emmanuel Morin
</p>
<p>a b c
Anglais/Japonais (Top1) 17,1 % 20,2 % [18,2 %] 20,2 % [18,2 %]
Anglais/Japonais (Top10) 36,3 % 39,3 % [ 8,2 %] 40,4 % [11,2 %]
Fran&#231;ais/Japonais (Top1) 20,4 % 20,4 % [ 0,0 %] 22,4 % [10,0 %]
Fran&#231;ais/Japonais (Top10) 36,7 % 37,8 % [ 2,8 %] 38,8 % [ 5,6 %]
</p>
<p>TAB. 2 &#8211; R&#233;sultats de l&#8217;alignement anglais-japonais et fran&#231;ais-japonais (&#946; = 8)
</p>
<p>&#231;ais peut s&#8217;expliquer par la moins bonne qualit&#233; des listes de points d&#8217;ancrage. En particulier,
les translitt&#233;rations ont &#233;t&#233; extraites avec un outil initialement d&#233;di&#233; &#224; la d&#233;tection entre l&#8217;anglais
et le japonais, sans oublier que les translitt&#233;rations entre le fran&#231;ais et le japonais sont plus rares.
</p>
<p>5.3 Influence des points d&#8217;ancrage
</p>
<p>La figure 2 compare les r&#233;sultats obtenus entre l&#8217;exp&#233;rience t&#233;moin et l&#8217;utilisation des compos&#233;s
savants, dans le cas de l&#8217;alignement fran&#231;ais-japonais (&#946; = 8). Elle pr&#233;sente l&#8217;&#233;volution des
positions des traductions correctes dans les listes de candidats obtenues &#224; la fin du processus
d&#8217;alignement (en ordonn&#233;e), ainsi que de leurs scores de similarit&#233; (en abscisse).
</p>
<p>0.0 0.2 0.4 0.6 0.8 1.0
</p>
<p>0
20
</p>
<p>40
60
</p>
<p>80
10
</p>
<p>0
</p>
<p>similarit&#233;
</p>
<p>rang
</p>
<p>FIG. 2 &#8211; Rang et score des traductions correctes pour l&#8217;alignement fran&#231;ais-japonais (&#946; = 8)
</p>
<p>Les triangles vides repr&#233;sentent les traductions n&#8217;&#233;tant plus obtenues avec l&#8217;utilisation des com-
pos&#233;s savants, alors que les triangles noirs indiquent les nouvelles traductions obtenues, indispo-
nibles dans le cas de l&#8217;exp&#233;rience t&#233;moin. Les fl&#232;ches fines repr&#233;sentent le d&#233;placement d&#8217;une
traduction entre l&#8217;exp&#233;rience t&#233;moin (d&#233;but de la fl&#232;che) et l&#8217;exp&#233;rience utilisant des points
d&#8217;ancrage (pointe de la fl&#232;che). Enfin, les quatre fl&#232;ches plus &#233;paisses sont la somme des fl&#232;ches
fines pour chaque zone d&#233;limit&#233;e par des pointill&#233;s.
</p>
<p>Cette figure montre d&#8217;abord que le nombre de traductions introduites est proche du nombre
de traductions disparues. Elles correspondent &#224; des traductions instables, &#233;tant tr&#232;s sensibles
aux diff&#233;rents param&#232;tres utilis&#233;s (taille de fen&#234;tre, mesure d&#8217;association et de similarit&#233;...). Les
fl&#232;ches permettent de mieux comprendre l&#8217;influence des points d&#8217;ancrage. Elles indiquent en
effet que, en moyenne, les traductions correctes obtiennent un meilleur rang dans les r&#233;sultats</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Influence des points d&#8217;ancrage pour l&#8217;extraction lexicale bilingue
</p>
<p>de l&#8217;alignement. C&#8217;est particuli&#232;rement visible pour les traductions initialement mal class&#233;es
(Top50 &#224; Top100). Leur rang est largement am&#233;lior&#233; comme l&#8217;indique la somme des vecteurs
pour cette zone. Ce constat est valable pour les autres zones, m&#234;me s&#8217;il est moins flagrant.
Dans tous les cas, en moyenne, l&#8217;utilisation des points d&#8217;ancrage am&#233;liore le classement des
traductions correctes dans la liste des candidats obtenus. Toutefois, les traductions initialement
correctement align&#233;es (Top10 ou inf&#233;rieur) sont peu reclass&#233;es (elles ne sont toutefois pas d&#233;sa-
vantag&#233;es, m&#234;me si leur indice de similarit&#233; moyen diminue). Ces observations viennent com-
pl&#233;ter les r&#233;sultats pr&#233;sent&#233;s : elle montre une tendance au r&#233;arrangement des candidats &#224; la
traduction vers des positions plus avantageuses, quelque soit leur rang initial.
</p>
<p>6 Conclusion
</p>
<p>Nous avons propos&#233; dans cet article une nouvelle contribution &#224; l&#8217;extraction lexicale bilingue
&#224; partir de corpus comparables. Notre hypoth&#232;se repose sur l&#8217;identification et la confiance en
un vocabulaire sp&#233;cialis&#233; pour am&#233;liorer les r&#233;sultats de la m&#233;thode directe. Cette hypoth&#232;se
a &#233;t&#233; confirm&#233;e par l&#8217;exp&#233;rience : nous avons montr&#233; que les r&#233;sultats sont am&#233;lior&#233;s pour les
Top1 et Top10, mais aussi que le classement des candidats &#224; la traduction est notablement et
globalement am&#233;lior&#233; en utilisant des points d&#8217;ancrage.
</p>
<p>Cette &#233;tude ouvre la voie &#224; de nouvelles perspectives pour am&#233;liorer les m&#233;thodes d&#8217;alignement
lexical &#224; partir de corpus comparables sp&#233;cialis&#233;s d&#8217;une taille r&#233;duite. D&#8217;un c&#244;t&#233;, la qualit&#233;
des points d&#8217;ancrage que nous avons extraits peut &#234;tre am&#233;lior&#233;e en utilisant des outils plus
performants. De l&#8217;autre, il est probable qu&#8217;il existe d&#8217;autres points d&#8217;ancrage pertinents, dont
l&#8217;extraction est permise par des travaux transversaux en traitement automatique des langues
naturelles (typiquement les cognats).
Enfin, cette &#233;tude invite &#224; repenser la fa&#231;on dont sont caract&#233;ris&#233;s et compar&#233;s les contextes des
termes. En effet, la m&#233;thode par traduction directe s&#8217;appuie sur la comparaison des associations
entre les t&#234;tes et les &#233;l&#233;ments des vecteurs de contexte, d&#8217;une langue vers une autre. Nous l&#8217;avons
modifi&#233;e en utilisant un score artificiel, n&#8217;&#233;tant plus une mesure d&#8217;association et avons obtenu
des r&#233;sultats prometteurs. En parall&#232;le &#224; la recherche et &#224; l&#8217;exploitation de nouveaux points
d&#8217;ancrage, nous souhaitons donc r&#233;fl&#233;chir &#224; de nouvelles mesures discriminantes, plus adapt&#233;es
que ne le sont les mesures d&#8217;association pour l&#8217;extraction lexicale bilingue &#224; partir de corpus
comparables sp&#233;cialis&#233;s d&#8217;une taille r&#233;duite.
</p>
<p>Remerciements
</p>
<p>Les auteurs tiennent &#224; remercier Kyo Kageura (Universit&#233; de Tokyo) et Akiko Aizawa (National
Institute of Informatics, Tokyo) pour leur aide et leurs conseils avis&#233;s. Ce travail a b&#233;n&#233;fici&#233;
d&#8217;une aide de l&#8217;Agence Nationale de la Recherche portant la r&#233;f&#233;rence ANR-08-CORD-009.
</p>
<p>R&#233;f&#233;rences
BROWN P. F., LAI J. C. &amp; MERCER R. L. (1991). Aligning Sentences in Parallel Cor-
pora. In Proceedings of the 29th Annual Meeting on Association for Computational Linguistics
(ACL&#8217;91), p. 169&#8211;176, Berkeley, CA, &#201;tats-Unis d&#8217;Am&#233;rique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Prochasson, Emmanuel Morin
</p>
<p>CHIAO Y.-C. &amp; ZWEIGENBAUM P. (2002). Looking for candidate translational equivalents
in specialized, comparable corpora. In Proceedings of the 19th International Conference on
Computational Linguistics (COLING&#8217;02), p. 1208&#8211;1212, Tapei, Taiwan.
CLAVEAU V. (2007). Inf&#233;rence de r&#232;gles de r&#233;&#233;criture pour la traduction de termes biom&#233;di-
caux. In Actes de la conf&#233;rence Traitement Automatique des Langues Naturelles (TALN&#8217;07),
p. 111&#8211;120, Toulouse, France.
DUNNING T. (1993). Accurate Methods for the Statistics of Surprise and Coincidence. Com-
putational Linguistics, 19(1), 61&#8211;74.
FIRTH J. (1957). A synopsis of linguistic theory 1930-1955. Studies in Linguistic Analysis,
Philological. Longman.
FUNG P. (1995). Compiling bilingual lexicon entries from a non-parallel English-Chinese
corpus. In D. YAROVSKY &amp; K. CHURCH, Eds., Proceedings of the 3rd Workshop on Very
Large Corpora (VLC&#8217;95), p. 173&#8211;183, Somerset, NJ, &#201;tats-Unis d&#8217;Am&#233;rique.
FUNG P. (1998). A Statistical View on Bilingual Lexicon Extraction : From Parallel Corpora
to Non-parallel Corpora. In D. FARWELL, L. GERBER &amp; E. HOVY, Eds., Proceedings of
the 3rd Conference of the Association for Machine Translation in the Americas (AMTA&#8217;98), p.
1&#8211;16, Langhorne, PA, &#201;tats-Unis d&#8217;Am&#233;rique.
KNIGHT K. &amp; GRAEHL J. (1997). Machine transliteration. In P. R. COHEN &amp; W. WAHL-
STER, Eds., Proceedings of the 3rd Annual Meeting of the Association for Computational
Linguistics (ACL&#8217;97) and 8th Conference of the European Chapter of the Association for Com-
putational Linguistics (EACL&#8217;97), p. 128&#8211;135, Madrid, Espagne.
KOTANI T. &amp; KORI A. (1990). Dictionary of Technical Terms. Kenkyusha.
MORIN E. &amp; DAILLE B. (2004). Extraction terminologique bilingue &#224; partir de corpus compa-
rables d&#8217;un domaine sp&#233;cialis&#233;. Traitement Automatique des Langues (TAL), 45(3), 103&#8211;122.
NAMER F. (2005). Morphos&#233;mantique pour l&#8217;appariement de termes dans le vocabulaire m&#233;-
dical : approche multilingue. In Actes de la conf&#233;rence Traitement Automatique des Langues
Naturelles (TALN&#8217;05), p. 63&#8211;72, Dourdan, France.
PEARSON J. (1998). Terms in Context. John Benjamins publishing company.
PROCHASSON E., KAGEURA K., MORIN E. &amp; AIZAWA A. (2008). Looking for translitera-
tions in a trilingual english, french and japanese specialised comparable corpus. In Procee-
dings of the 1st Workshop on Building and Using Comparable Corpora, Language Resources
and Evaluation Conference (LREC&#8217;08), p. 83&#8211;86, Marrakech, Maroc.
RAPP R. (1995). Identifying word translations in non-parallel texts. In Proceedings of the
33rd annual meeting on Association for Computational Linguistics (ACL&#8217;95), p. 320&#8211;322,
Cambridge, MA, &#201;tats-Unis d&#8217;Am&#233;rique.
RAPP R. (1999). Automatic Identification of Word Translations from Unrelated English and
German Corpora. In Proceedings of the 37th Annual Meeting of the Association for Compu-
tational Linguistics (ACL&#8217;99), p. 519&#8211;526, College Park, MD, &#201;tats-Unis d&#8217;Am&#233;rique.
TSUJI K. (2001). Automatic extraction of translational japanese-katakana and english word
pairs from bilingual corpora. In Proceedings of the 19th International Conference on Compu-
ter Processing of Oriental Langages (ICCPOL&#8217;01), p. 245&#8211;250, Taichung, Taiwan.</p>

</div></div>
</body></html>