<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse syntaxique en d&#233;pendances de l&#8217;oral spontan&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Analyse syntaxique en d&#233;pendances de l&#8217;oral spontan&#233;
</p>
<p>Alexis Nasr1 Fr&#233;d&#233;ric B&#233;chet2
</p>
<p>(1) LIF - CNRS - Universit&#233; Aix Marseille
(2) LIA - Universit&#233; d&#8217;Avignon
</p>
<p>R&#233;sum&#233;. Cet article d&#233;crit un mod&#232;le d&#8217;analyse syntaxique de l&#8217;oral spontan&#233; ax&#233; sur
la reconnaissance de cadres valenciels verbaux. Le mod&#232;le d&#8217;analyse se d&#233;compose en deux
&#233;tapes : une &#233;tape g&#233;n&#233;rique, bas&#233;e sur des ressources g&#233;n&#233;riques du fran&#231;ais et une &#233;tape de r&#233;-
ordonnancement des solutions de l&#8217;analyseur r&#233;alis&#233; par un mod&#232;le sp&#233;cifique &#224; une application.
Le mod&#232;le est &#233;valu&#233; sur le corpus MEDIA.
</p>
<p>Abstract. We describe in this paper a syntactic parser for spontaneous speech geared
towards the identification of verbal subcategorization frames. The parser proceeds in two stages.
The first stage is based on generic syntactic ressources for French. The second stage is a reranker
which is specially trained for a given application. The parser is evaluated on the MEDIA corpus.
</p>
<p>Mots-cl&#233;s : Analyse syntaxique, reconnaissance automatique de la parole.
</p>
<p>Keywords: Syntactic parsing, automatic speech recognition.
</p>
<p>1 Introduction
</p>
<p>De nombreux syst&#232;mes automatiques contemporains de compr&#233;hension de la parole produisent
des repr&#233;sentations du sens des &#233;nonc&#233;s sous la forme de cadres s&#233;mantiques &#224; la FrameNet (Ba-
ker et al., 1998). La construction de ces repr&#233;sentations suppose en g&#233;n&#233;ral une &#233;tape d&#8217;analyse
syntaxique plus ou moins pouss&#233;e. Cette derni&#232;re se situe habituellement en aval d&#8217;un sys-
t&#232;me automatique de reconnaissance de la parole (SRAP), qui produit, pour un signal acous-
tique donn&#233;, correspondant &#224; un &#233;nonc&#233;, la retranscription jug&#233;e la plus probable par le SRAP
ou bien les n retranscriptions les plus probables repr&#233;sent&#233;es sous la forme d&#8217;un graphe de
formes. L&#8217;analyse syntaxique d&#8217;un tel graphe est confront&#233;e &#224; de nombreux probl&#232;mes, en sus
des probl&#232;mes traditionnels de l&#8217;analyse syntaxique. Ceux-ci sont de natures diverses, provenant
des sp&#233;cificit&#233;s de l&#8217;oral par rapport &#224; l&#8217;&#233;crit, mais aussi du caract&#232;re imparfait des retranscrip-
tions produites par le SRAP, surtout lorsque la parole &#224; transcrire est spontan&#233;e. Du fait de
ces particularit&#233;s, il est illusoire de recourir, pour une telle t&#226;che, &#224; des analyseurs syntaxiques
probabilistes modernes, con&#231;us pour traiter la langue &#233;crite. Il n&#8217;est pas possible non plus de
r&#233;entrainer ces analyseurs sur des corpus de l&#8217;oral, car nous ne disposons pas actuellement de
corpus syntaxiques pour l&#8217;oral (o&#249; chaque enonc&#233; est associ&#233; &#224; un arbre d&#8217;analyse syntaxique).
</p>
<p>Face &#224; une telle situation, une solution consiste &#224; d&#233;velopper des analyseurs ad-hoc, adapt&#233;s &#224;
un registre de langue donn&#233;, &#224; un champ s&#233;mantique particulier, voire m&#234;me &#224; un SRAP donn&#233;.
</p>
<p>1Ces travaux sont financ&#233;s par l&#8217;ANR, dans le cadre du projet EPAC, contrat num&#233;ro ANR-06-MDCA-006.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Nasr, Fr&#233;d&#233;ric B&#233;chet
</p>
<p>Une telle approche, m&#234;me si elle peut donner des r&#233;sultats satisfaisants (Seneff, 1992), p&#234;che
par son manque de g&#233;n&#233;ricit&#233; et rend l&#8217;adaptation de tels syst&#232;mes particuli&#232;rement co&#251;teux.
</p>
<p>Une solution alternative consiste &#224; distinguer, parmi les connaissances mobilis&#233;es par un tel
syst&#232;me, ce qui rel&#232;ve de la syntaxe g&#233;n&#233;rale de ce qui est propre &#224; un domaine applicatif. C&#8217;est
dans cette direction que s&#8217;inscrit le travail pr&#233;sent&#233; ici. Il propose un traitement en deux &#233;tapes.
</p>
<p>Dans un premier temps, une analyse syntaxique partielle des sorties du SRAP est effectu&#233;e. Elle
repose sur des ressources g&#233;n&#233;riques, en particulier une grammaire syntagmatique partielle, ce
qui n&#8217;est pas une nouveaut&#233; dans le domaine de l&#8217;analyse syntaxique automatique de l&#8217;oral (voir
(Antoine et al., )), mais aussi, et c&#8217;est une originalit&#233; de notre approche, sur deux ressources
g&#233;n&#233;rales que sont le lexique syntaxique dicovalence (van den Eynde &amp;Mertens, 2003) et sur la
grammaire d&#8217;adjonction d&#8217;arbres du fran&#231;ais FXMG (Crabb&#233;, 2005b). Cette &#233;tape produit, pour
un graphe donn&#233; de formes, plusieurs instanciations de cadres de valence. Il s&#8217;agit d&#8217;assigner
aux verbes pr&#233;sents dans le graphe un cadre valenciel (verbe intransitif, verbe transitif direct
. . . ) ainsi que ses actants (sujet, objet direct, objet indirect . . . ). Nous avons opt&#233; pour ce type
d&#8217;analyse syntaxique, plut&#244;t qu&#8217;une analyse syntagmatique plus traditionnelle, car elle fournit
des repr&#233;sentations plus adapt&#233;es au calcul de cadres s&#233;mantiques mentionn&#233;s ci-dessus.
</p>
<p>La seconde &#233;tape du traitement prend en entr&#233;e les cadres de valence instanci&#233;s produits &#224;
l&#8217;issue de l&#8217;&#233;tape pr&#233;c&#233;dente et les r&#233;ordonne en fonction d&#8217;un mod&#232;le sp&#233;cifique &#224; une t&#226;che
particuli&#232;re. Cette &#233;tape repose sur un mod&#232;le de boosting (Schapire &amp; Singer, 2000). Ce dernier
est entrain&#233; sur un corpus sp&#233;cifique &#224; l&#8217;application vis&#233;e.
</p>
<p>L&#8217;organisation de l&#8217;article est la suivante : dans la section 2, nous d&#233;crivons l&#8217;analyseur syn-
taxique, la section 3 d&#233;crit le mod&#232;le de reclassement utilis&#233;. La section 4 est consacr&#233;e &#224; la
partie exp&#233;rimentale de ce travail et la section 5 conclut l&#8217;article.
</p>
<p>2 Analyse syntaxique
</p>
<p>L&#8217;analyse linguistique des sorties du SRAP se d&#233;compose, de mani&#232;re classique, en une s&#233;rie de
processus qui constituent une cha&#238;ne de traitements : l&#8217;entr&#233;e d&#8217;un processus correspond &#224; la
sortie du processus pr&#233;c&#233;dent. Les diff&#233;rents modules qui constituent notre cha&#238;ne v&#233;rifient tous
un certain nombre de principes, en particulier :
</p>
<p>1 - Les modules sont monotones, ils ajoutent de l&#8217;information linguistique &#224; leurs entr&#233;es mais
ne modifient pas les informations d&#233;j&#224; pr&#233;sentes.
</p>
<p>2 - Les modules admettent plusieurs hypoth&#232;ses pond&#233;r&#233;es en entr&#233;e et produisent &#224; leur tour
plusieurs hypoth&#232;ses pond&#233;r&#233;es &#224; l&#8217;aide d&#8217;une fonction de co&#251;t propre au module. Le nombre
d&#8217;hypoth&#232;ses produites en sortie peut &#234;tre contr&#244;l&#233; gr&#226;ce &#224; la pond&#233;ration (on ne produit que les
n hypoth&#232;ses de meilleurs poids).
</p>
<p>3 - L&#8217;ambigu&#239;t&#233; est repr&#233;sent&#233;e sous la forme de graphes (graphes de formes, de mots, de cat&#233;-
gories, de syntagmes . . . ) qui permettent de mettre en facteur des parties communes &#224; plusieurs
hypoth&#232;ses. Ces graphes sont repr&#233;sent&#233;s par des transducteurs finis pond&#233;r&#233;s et la majorit&#233; des
traitements correspondent &#224; des op&#233;rations standard sur les transducteurs.
</p>
<p>Les premiers modules de la cha&#238;ne sont standards, nous ne ferons que les &#233;voquer pour nous
attarder plus longuement sur le dernier, l&#8217;analyseur en d&#233;pendances partiel.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique de l&#8217;oral
</p>
<p>Le graphe de formes issu du SRAP est trait&#233;, dans un premier temps, par un module lexical
qui permet de regrouper certaines formes. C&#8217;est &#224; ce niveau que sont reconnues des unit&#233;s
lexicales complexes telles que les locutions (au dessus de, &#224; mesure que . . . ) ou encore les
mots compos&#233;s (pomme de terre, couvre chef . . . ). Ce module repose sur le lexique des formes
fl&#233;chies du fran&#231;ais (le Lefff) (Sagot et al., 2006). Conform&#233;ment au second principe ce module
permet de conserver plusieurs d&#233;coupages possibles, pour les cas de chevauchement d&#8217;unit&#233;s
lexicales complexes. Le module produit un graphe d&#8217;unit&#233;s lexicales.
</p>
<p>Ce dernier constitue l&#8217;entr&#233;e d&#8217;un module d&#8217;&#233;tiquetage morpho-syntaxique qui produit un graphe
de cat&#233;gories morpho-syntaxiques, chaque cat&#233;gorie &#233;tant associ&#233;e &#224; une unit&#233; lexicale. L&#8217;&#233;ti-
queteur repose sur un mod&#232;le de Markov cach&#233; classique dont l&#8217;estimation des param&#232;tres a &#233;t&#233;
r&#233;alis&#233;e sur le corpus paris 7 (Abeill&#233; et al., 2003).
</p>
<p>Le graphe de cat&#233;gories est alors trait&#233; par un module d&#8217;analyse morphologique qui associe
&#224; tout couple compos&#233; d&#8217;une unit&#233; lexicale et d&#8217;une cat&#233;gorie une ou plusieurs analyses mor-
phologiques. Une analyse morphologique est compos&#233;e d&#8217;un lemme et d&#8217;une s&#233;rie de traits
morphologiques. Ce module repose, tout comme le premier, sur le Lefff.
</p>
<p>La quatri&#232;me &#233;tape consiste en une analyse syntaxique partielle du graphe de cat&#233;gories. Il
s&#8217;agit de regrouper des s&#233;quences de cat&#233;gorie au sein de syntagmes non r&#233;cursifs, souvent
appel&#233;s chunks. L&#8217;id&#233;e sous jacente est de n&#8217;effectuer que des regroupements non ambigus (tel
qu&#8217;une s&#233;quence d&#233;terminant, adjectif, nom ou encore auxiliaire, participe pass&#233; . . . ). Il n&#8217;y a
en particulier pas de rattachements pr&#233;positionnels effectu&#233;s &#224; ce niveau. Les traitements sont
r&#233;alis&#233;s &#224; l&#8217;aide d&#8217;une cascade de transducteurs, &#224; l&#8217;image de (Abney, 1996). Les grammaires
locales correspondant &#224; chaque syntagme sont produites manuellement. Tout syntagme poss&#232;de
une t&#234;te qui est sp&#233;cifi&#233;e dans la grammaire correspondante.
</p>
<p>Le r&#233;sultat de cette suite de traitements est un graphe de syntagmes. Il constitue l&#8217;entr&#233;e du
module d&#8217;analyse de d&#233;pendances syntaxiques partiel qui est l&#8217;objet de la section suivante.
</p>
<p>Il est important de noter que, de mani&#232;re g&#233;n&#233;rale, le nombre d&#8217;hypoth&#232;ses potentielles aug-
mente au fur et &#224; mesure que l&#8217;on &#233;volue dans la cha&#238;ne de traitement. A une suite de formes
peut correspondre plusieurs d&#233;coupages en mots. Une s&#233;quence de mots peut correspondre &#224;
plusieurs s&#233;quences de cat&#233;gories, chacune pouvant correspondre &#224; plusieurs d&#233;coupages en
unit&#233;s syntaxiques.
</p>
<p>2.1 L&#8217;analyseur de d&#233;pendances syntaxiques partiel
</p>
<p>L&#8217;objectif de ce module est de retrouver des d&#233;pendances actancielles (sujet, objet direct, objet
indirect, r&#233;gime d&#8217;une pr&#233;position, certains compl&#233;ment de noms . . . ) dans un graphe de sortie
d&#8217;un SRAP, pr&#233;alablement trait&#233; par les modules d&#233;crits ci-dessus. Nous nous int&#233;resserons ici
aux seules relations actancielles ayant pour gouverneur un verbe. La principale source d&#8217;infor-
mation utilis&#233;e pour d&#233;tecter l&#8217;occurrence de telles d&#233;pendances est une description des cadres
valenciels (appel&#233;s aussi sch&#233;mas de r&#233;gime ou cadres de sous-cat&#233;gorisation) des verbes.
</p>
<p>Le module doit offrir simultan&#233;ment une bonne couverture, de la souplesse et de l&#8217;efficacit&#233;.
</p>
<p>La couverture rev&#234;t deux aspects, la couverture lexicale (le nombre de verbes pour lesquels
on dispose d&#8217;une description du cadre valenciel), et la couverture syntaxique (les diff&#233;rentes
r&#233;alisations possibles d&#8217;un cadre valenciel).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Nasr, Fr&#233;d&#233;ric B&#233;chet
</p>
<p>La souplesse est la capacit&#233; &#224; retrouver des occurrences de d&#233;pendances actancielles dans des
entr&#233;es bruit&#233;es. Le bruit &#233;tant constitu&#233; des particularit&#233;s de la syntaxe de l&#8217;oral (disfluences,
h&#233;sitations) et des erreurs commises par le syst&#232;me de reconnaissance de parole.
</p>
<p>La couverture est assur&#233;e par deux ressources existantes, le lexique syntaxique Dicovalence
(van den Eynde &amp;Mertens, 2003) et la grammaire d&#8217;adjonction d&#8217;arbres FXMG (Crabb&#233;, 2005a).
La souplesse et l&#8217;efficacit&#233; sont assur&#233;es par une repr&#233;sentation sous sp&#233;cifi&#233;e des r&#233;alisations
des cadres valenciels sous la forme de transducteurs finis.
</p>
<p>Ces aspects sont d&#233;crits successivement dans les deux sections suivantes.
</p>
<p>Couverture lexicale et syntaxique
</p>
<p>Dicovalence est un lexique syntaxique de verbes du fran&#231;ais. Il recence les cadres valenciels
de plus de 3700 verbes. Un cadre valenciel d&#233;crit une configuration de compl&#233;ments valenciels
d&#8217;un verbe (le nombre, la nature et la fonction de ses compl&#233;ment). La description des cadres
valenciels repose sur les principes de l&#8217;approche pronominale (van den Eynde &amp; Blanche-
Benveniste, 1978) : chaque position actantielle, appel&#233;e paradigme, est d&#233;crite par le paradigme
des pronoms qui peuvent l&#8217;occuper. 20 paradigmes sont distingu&#233;s, parmi lesquels on trouve
P0, P1 et P2 qui correspondent grosso modo aux sujet, objet direct et objet indirect de la
grammaire traditionnelle. Comme nous l&#8217;avons pr&#233;cis&#233; ci-dessus, 3700 verbes sont r&#233;pertori&#233;s,
qui constituent plus de 8000 entr&#233;es, un verbe pouvant &#234;tre associ&#233; &#224; plusieurs cadres valen-
ciels. 311 cadres valenciels distincts sont r&#233;pertori&#233;s. Un cadre valenciel est d&#233;crit de mani&#232;re
concise par un identifiant qui en r&#233;sume les caract&#233;ristiques principales. L&#8217;identifiant P0 P1
par exemple d&#233;crit le cadre valenciel transitif direct. Il est constitu&#233; des deux paradigmes : P0
pour le sujet et P1 pour l&#8217;objet direct. Une entr&#233;e lexicale associe &#224; un lemme verbal un cadre
valenciel ainsi que les pronoms des diff&#233;rents paradigmes qui composent le cadre valenciel.
</p>
<p>Dicovalence offre une bonne couverture lexicale (il couvre 89, 3% des verbes du corpus Pa-
ris 7) mais sa couverture syntaxique est par construction limit&#233;e dans la mesure o&#249; seules les
r&#233;alisations pronominales des actants sont r&#233;pertori&#233;es. Pour obtenir une meilleure couverture
syntaxique, il est n&#233;cessaire d&#8217;associer &#224; tout cadre valenciel ses r&#233;alisations non pronominales.
Cette &#233;tape est r&#233;alis&#233;e &#224; l&#8217;aide de la grammaire FXMG.
</p>
<p>La grammaire FXMG est une grammaire d&#8217;adjonction d&#8217;arbres produite automatiquement &#224; par-
tir d&#8217;une m&#233;ta-grammaire &#224; l&#8217;aide du logiciel XMG (Crabb&#233;, 2005a). Nous ne ferons pas ici de
pr&#233;sentation des grammaires d&#8217;adjonction d&#8217;arbres, rappelons simplement qu&#8217;une telle gram-
maire associe &#224; toute entr&#233;e lexicale un ensemble d&#8217;arbres &#233;l&#233;mentaires qui d&#233;crivent, entre
autre, une r&#233;alisation possible d&#8217;un cadre valenciel de l&#8217;entr&#233;e lexicale. Les arbres &#233;l&#233;men-
taires sont regroup&#233;s en familles, chaque famille &#233;tant compos&#233;e des diff&#233;rentes r&#233;alisations
syntaxiques d&#8217;un cadre valenciel donn&#233;. Ainsi, est associ&#233; &#224; un verbe transitif une famille com-
pos&#233;e de l&#8217;arbre repr&#233;sentant la r&#233;alisation nominale du sujet et de l&#8217;objet direct (Jean mange la
pomme), d&#8217;une cliticisation de l&#8217;objet direct (Jean la mange), de la diath&#232;se passive (la pomme
est mang&#233;e par Jean) et ainsi de suite. La grammaire ainsi produite est de taille importante,
elle est compos&#233;e de 7600 arbres &#233;l&#233;mentaires, regroup&#233;s en 92 familles. Les familles sont de
tailles in&#233;gales. A titre d&#8217;exemple la famille des verbes transitifs est compos&#233;e de 159 arbres
&#233;l&#233;mentaires. Comme nous l&#8217;avons pr&#233;cis&#233; ci-dessus, une telle grammaire est produite auto-
matiquement &#224; partir d&#8217;une description plus abstraite, appel&#233;e m&#233;ta-grammaire. Tout arbre &#233;l&#233;-
mentaire de la grammaire est caract&#233;ris&#233; de mani&#232;re bi-univoque par un ensemble de traits qui
en d&#233;crivent ses caract&#233;ristiques syntaxiques (r&#233;alisation morpho-syntaxique des actants, ordre
lin&#233;aire, diath&#232;se . . . ). Cette repr&#233;sentation permet un filtrage simple et motiv&#233; de l&#8217;ensemble</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique de l&#8217;oral
</p>
<p>des arbres &#233;l&#233;mentaires : on peut d&#233;cider de ne garder que les arbres &#233;l&#233;mentaires poss&#233;dant
certains traits particuliers. Chaque famille est associ&#233;e &#224; un identifiant qui exprime de mani&#232;re
concise le cadre valenciel associ&#233; &#224; la famille : la famille associ&#233;e aux verbes transitifs est
n0Vn1 la famille des verbes di-transitifs dont l&#8217;objet indirect est introduit par la pr&#233;position &#224;
est n0Vn1an2 et ainsi de suite.
</p>
<p>La couverture de FXMG a &#233;t&#233; &#233;valu&#233;e sur le corpus TSNLP (Lehmann, 1996) par (Crabb&#233;,
2005b), elle est de 75% ce qui peut &#234;tre consid&#233;r&#233; comme un r&#233;sultat satisfaisant &#233;tant donn&#233; les
caract&#233;ristiques de ce corpus (les fr&#233;quences d&#8217;occurrence des constructions ne correspondent
pas &#224; leur fr&#233;quence d&#8217;usage dans la langue).
</p>
<p>FXMG d&#233;finit donc un ensemble d&#8217;arbres &#233;l&#233;mentaires, regroup&#233;s en familles, mais n&#8217;&#233;tablit pas
de lien entre les entr&#233;es lexicales et les arbres &#233;l&#233;mentaires. Il est facile de voir &#224; cette &#233;tape
de notre expos&#233; la compl&#233;mentarit&#233; de dicovalence et de FXMG. Le premier poss&#232;de une bonne
couverture lexicale tandis que le second poss&#232;de une bonne couverture syntaxique.
</p>
<p>Pour effectuer un lien entre dicovalence et FXMG, il convient de traduire les cadres valenciels
de dicovalence en noms de familles de FXMG. Cette traduction est r&#233;alis&#233;e &#224; l&#8217;aide de r&#232;gles
qui associent un couple (paradigme, pronom) &#224; un fragment d&#8217;identifiant de famille. A titre
d&#8217;exemple, la r&#232;gle (P0, je) &#8594; n0 indique que la r&#233;alisation du paradigme sujet (P0) sous
la forme du pronom je se traduit par n0 dans un identifiant de famille de FXMG. Les fragments
d&#8217;identifiants de familles sont ensuite concat&#233;n&#233;s1 pour constituer des identifiants de familles.
</p>
<p>Repr&#233;sentation des sch&#233;mas de valence sous la forme d&#8217;automates
</p>
<p>Nous avons d&#233;crit dans la section pr&#233;c&#233;dente la mani&#232;re dont les deux ressources dicovalence
et FXMG avaient &#233;t&#233; reli&#233;es entre elles &#224; l&#8217;aide de r&#232;gles de correspondance. Nous disposons
donc, pour chacun des 3700 verbes de dicovalence, d&#8217;une ou de plusieurs familles d&#8217;arbres
&#233;l&#233;mentaires qui d&#233;crivent les diff&#233;rentes r&#233;alisations possibles des cadres de valence de ces
verbes. Afin de retrouver une occurrence d&#8217;un cadre de valence dans les sorties de l&#8217;analyseur
syntaxique partiel, chaque arbre &#233;l&#233;mentaire est repr&#233;sent&#233; sous la forme d&#8217;un automate fini.
On effectue ensuite l&#8217;union des automates correspondant aux arbres d&#8217;une famille donn&#233;e pour
constituer l&#8217;automate de la famille.
</p>
<p>Le processus de construction d&#8217;un automate &#224; partir d&#8217;un arbre &#233;l&#233;mentaire est simple. Il consiste
&#224; parcourir l&#8217;arbre de mani&#232;re descendante (en profondeur d&#8217;abord, de gauche &#224; droite) et de
construire pour tout n&#339;ud de substitution de l&#8217;arbre une transition &#233;tiquet&#233;e par la cat&#233;gorie
du n&#339;ud de substitution. Nous avons repr&#233;sent&#233; dans la partie droite de la figure 1 l&#8217;automate
correspondant &#224; l&#8217;arbre de la partie gauche.
</p>
<p>On remarquera que tout &#233;tat de l&#8217;automate de la figure 1 poss&#232;de une transition sur lui-m&#234;me
pour chaque &#233;l&#233;ment de l&#8217;alphabet &#931;. Ce dernier est compos&#233; des diff&#233;rentes &#233;tiquettes de
groupes syntaxiques et de cat&#233;gories morpho-syntaxiques. Ces transitions permettent aux diff&#233;-
rents actants du verbe de se trouver &#224; une distance arbitraire de ce dernier.
</p>
<p>On pourra remarquer que l&#8217;automate correspondant &#224; un arbre &#233;l&#233;mentaire ne repr&#233;sente qu&#8217;une
partie de l&#8217;information syntaxique de ce dernier, plus pr&#233;cis&#233;ment, son nombre de n&#339;uds de
substitution, leur nature et leur ordre lin&#233;aire relatif. Ce rel&#226;chement de contraintes syntaxiques
peut aboutir &#224; des rattachements erron&#233;s. Pour attenuer cet effet, des pond&#233;rations (&#945; et &#946;) sont
</p>
<p>1Cette op&#233;ration est en fait un peu plus complexe car les indices des paradigmes dans dicovalence (le 1 de P1)
et les indices dans les familles d&#8217;arbres (le 0 de n0 dans n0Vn1) n&#8217;ont pas la m&#234;me s&#233;mantique. Le premier r&#233;f&#232;re
grosso modo &#224; une fonction syntaxique tandis que le second d&#233;signe une position lin&#233;aire.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Nasr, Fr&#233;d&#233;ric B&#233;chet
</p>
<p>GN / &#946; GN / &#946;
</p>
<p>S
</p>
<p>GV
</p>
<p>V
</p>
<p>&#931; / &#945;
</p>
<p>GN
</p>
<p>GN
</p>
<p>n0vn1
</p>
<p>&#931; &#931; / &#945; &#931;
</p>
<p>n0vN1
</p>
<p>FIG. 1 &#8211; Transformation d&#8217;un arbre &#233;l&#233;mentaire en automate
</p>
<p>ajout&#233;es aux transitions. &#945; mat&#233;rialise une p&#233;nalit&#233; qui s&#8217;accro&#238;t au fur et &#224; mesure que cro&#238;t la
distance entre le verbe et un de ses actants. &#946; correspond &#224; une r&#233;compense pour chaque actant
trouv&#233;. Ce jeux de pond&#233;rations permet d&#8217;impl&#233;menter une heuristique simple : on favorise la
proximit&#233; entre le verbe et ses actants, ainsi que le nombre d&#8217;actants.
</p>
<p>Le processus d&#8217;instanciation des cadres de valences dans un graphe de syntagmes issu de l&#8217;ana-
lyseur syntaxique partiel est r&#233;alis&#233; &#224; l&#8217;aide de l&#8217;op&#233;ration de composition d&#8217;automates. De
mani&#232;re plus pr&#233;cise, nous disposons de l&#8217;automate des sytagmes, not&#233; TS et d&#8217;un automate par
famille d&#8217;arbres &#233;l&#233;mentaires, soit n automates not&#233;s TF1 , . . . , TFn . Les n automates de familles
sont compos&#233;s successivement avec l&#8217;automate TS et les r&#233;sultats de ces compositions sont re-
goup&#233;s entre eux gr&#226;ce &#224; l&#8217;op&#233;ration d&#8217;union2. Le r&#233;sultat est donc &#8746;ni=1TS &#9702; TFi3. Ce mod&#232;le
s&#8217;oppose &#224; une cascade de transducteurs (TS &#9702; TF1 &#9702; . . . &#9702; TFn). Cette diff&#233;rence est importante
dans le cas de phrases complexes (comportant plusieurs verbes). Elle correspond &#224; l&#8217;id&#233;e que
l&#8217;on n&#8217;essaye pas de trouver une analyse compl&#232;te coh&#233;rente de la phrase mais &#224; retrouver les
actants potentiels de chacun de ses verbes, ind&#233;pendamment. Certaines analyses peuvent &#234;tre,
par cons&#233;quent, incompatibles (un m&#234;me groupe syntaxique peut &#234;tre actant de deux verbes
distincts de la phrase). Ce choix est motiv&#233; par des consid&#233;rations d&#8217;efficacit&#233;. En effet, &#233;tant
donn&#233; le rel&#226;chement syntaxique mis en &#339;uvre, la recherche d&#8217;analyses compl&#232;tes aboutit &#224; une
multiplication d&#233;raisonnable de solutions, et par cons&#233;quent une augmentation d&#233;raisonnable
de la taille des automates produits.
</p>
<p>2.2 Exemple
</p>
<p>Nous avons repr&#233;sent&#233; ci-dessous le r&#233;sultat du traitement du graphe de reconnaissance cor-
respondant &#224; l&#8217;&#233;nonc&#233; oui donc j&#8217; aimerais r&#233;server maintenant du onze au euh quatorze mai
c&#8217;est-&#224;-dire trois nuits la m&#234;me prestation &#224; carcassonne. Le graphe est trait&#233; successivement
par le module lexical, l&#8217;&#233;tiqueteur morpho-syntaxique, l&#8217;analyseur morphologique, l&#8217;analyseur
syntaxique partiel puis, finalement par l&#8217;analyseur en d&#233;pendances partiel. Ce sont les dix solu-
tions de meilleur poids que l&#8217;on a report&#233;es dans le tableau ci-dessous4.
</p>
<p>2Pour des raisons de lisibilit&#233;, nous avons omis un certain nombre de d&#233;tails techniques concernant la structure
des automates TFi et TS . En particulier, avant l&#8217;op&#233;ration de composition, les transitions de TS &#233;tiquet&#233;es par
un groupe verbal dont la t&#234;te est associ&#233;e &#224; n cadres valenciels est remplac&#233;e par n transitions &#233;tiquet&#233;es par
l&#8217;identifiant du cadre valenciel. D&#8217;autres d&#233;tails ne pr&#233;sentant pas d&#8217;inter&#234;t fondamental sont pass&#233;s sous silence.
</p>
<p>3Dans la pratique, on effectue des nmeilleurs chemins de l&#8217;automate produit lors de l&#8217;op&#233;ration de composition.
La formule est donc : &#8746;ni=1nbest(TS &#9702; TFi , n) o&#249; nbest(A,n) est l&#8217;op&#233;rateur produisant l&#8217;automate compos&#233; des
n chemins de meilleur poids de l&#8217;automate A.
</p>
<p>4La pr&#233;sence incongrue du mot stade dans quatorze mai stade provient d&#8217;une erreur de reconnaissance : sub-
stitution de c&#8217;est &#224; dire par stade.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique de l&#8217;oral
</p>
<p>n Cadre Sujet Verbe Objet direct Compl&#233;ment locatif
1 n0V j&#8217; aimerais r&#233;server &#8709; &#8709;
2 n0Vn1 j&#8217; aimerais r&#233;server quatorze mai stade &#8709;
3 n0Vn1 j&#8217; aimerais r&#233;server trois nuits &#8709;
4 n0Vn1locn2 j&#8217; aimerais r&#233;server quatorze mai stade &#224; carcassonne
5 n0Vn1locn2 j&#8217; aimerais r&#233;server la m&#234;me prestations &#224; carcassonne
6 n0Vn1locn2 j&#8217; aimerais r&#233;server trois nuits &#224; carcassonne
7 n0Vn1 j&#8217; aimerais r&#233;server la m&#234;me prestations &#8709;
8 n0Vlocn1 j&#8217; aimerais r&#233;server &#8709; &#224; carcassonne
9 n0Vn1 j&#8217; aimerais r&#233;server stade &#8709;
10 n0Vn1locn2 j&#8217; aimerais r&#233;server la m&#234;me &#224; carcassonne
</p>
<p>Les dix solutions repr&#233;sent&#233;es dans le tableau correspondent &#224; dix instanciations de cadres va-
lenciels associ&#233;s au verbe r&#233;server. Quatre cadres valenciels ont &#233;t&#233; s&#233;lectionn&#233;s, n0V (intransi-
tif), n0Vn1 (transitif direct), n0Vn1locn2 (objet direct et compl&#233;ment locatif pr&#233;positionnel)
et n0Vlocn1 (compl&#233;ment locatif). Le classement de ces solutions est r&#233;alis&#233; d&#8217;apr&#232;s la com-
binaison des poids donn&#233;s par les diff&#233;rents modules successifs. Il s&#8217;agit d&#8217;une fonction de co&#251;t
complexe, combinaison lin&#233;aire des fonctions de co&#251;t de chaque module.
</p>
<p>Nous aurions aim&#233; voir en premi&#232;res positions de la liste les solutions 5 et 6 qui peuvent &#234;tre
consid&#233;r&#233;es comme des analyses correctes de l&#8217;&#233;nonc&#233;. Leur positionnement en 5&#232;me et 6&#232;me
rang illustre l&#8217;imperfection de la fonction de co&#251;t. Mais il montre aussi qu&#8217;il est illusoire d&#8217;esp&#233;-
rer d&#233;finir une fonction de co&#251;t g&#233;n&#233;rique optimale. En particulier, notre fonction de co&#251;t n&#8217;im-
pl&#233;mente aucune contrainte de s&#233;lection (ou pr&#233;f&#233;rence lexicale) qui favoriserait, par exemple,
le groupe nominal trois nuits par rapport &#224; quatorze mai stade comme objet direct de r&#233;server.
De telles pr&#233;f&#233;rences sont &#233;troitement li&#233;es &#224; un domaine s&#233;mantique et &#224; un cadre applicatif
particuliers, c&#8217;est pourquoi nous consid&#233;rons qu&#8217;elles sont du ressort d&#8217;un module sp&#233;cifique &#224;
une application. Ce dernier est d&#233;crit dans la section suivante, il se pr&#233;sente sous la forme d&#8217;un
r&#233;ordonnanceur (reranker) qui prend en entr&#233;e n solutions de l&#8217;analyseur et les r&#233;ordonne en
fonction de connaissances propres &#224; l&#8217;application.
</p>
<p>3 R&#233;ordonnancement des solutions de l&#8217;analyseur
</p>
<p>Comme nous l&#8217;avons d&#233;crit dans la section pr&#233;c&#233;dente, les traitements g&#233;n&#233;riques ont permis de
construire, pour les sorties d&#8217;un SRAP correspondant &#224; un &#233;nonc&#233; donn&#233;, plusieurs instanciations
de cadres de valence associ&#233;s aux verbes de l&#8217;&#233;nonc&#233; consid&#233;r&#233;s pertinents pour la t&#226;che vis&#233;e
(verbes cibles dans la suite de l&#8217;article). Les cadres de valences ainsi produits constituent l&#8217;en-
tr&#233;e d&#8217;un processus de r&#233;ordonnancement qui int&#232;gre des contraintes propres &#224; une application
particuli&#232;re.
</p>
<p>Ce processus est bas&#233; sur un classifieur qui est entra&#238;n&#233; pour s&#233;lectionner les analyses valides
parmi l&#8217;ensemble des analyses produites. Nous utilisons un classifieur &#224; large marge sp&#233;cialis&#233;
dans le traitement de donn&#233;es textuelles, ICSIBOOST5, bas&#233; sur un algorithme de boosting (Scha-
pire &amp; Singer, 2000) de classifieurs simples (des arbres de d&#233;cision &#224; 1 niveau de profondeur sur
la pr&#233;sence ou l&#8217;absence de n-grammes de mots). L&#8217;entra&#238;nement de ce classifieur est effectu&#233;
de la mani&#232;re suivante :
</p>
<p>1 - Tout d&#8217;abord un corpus d&#8217;apprentissage compos&#233; de segments de parole transcrits manuel-
</p>
<p>5http ://code.google.com/p/icsiboost/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Nasr, Fr&#233;d&#233;ric B&#233;chet
</p>
<p>lement est trait&#233; par l&#8217;analyseur.
</p>
<p>2 - Pour chaque segment, et pour chaque verbe cible, la liste de n meilleurs cadres de valences
produits est pr&#233;sent&#233;e &#224; un juge humain qui valide la ou les analyses correctes, lorsqu&#8217;elles
existent. A l&#8217;issue de cette &#233;tape de validation manuelle, chaque cadre valenciel est &#233;tiquet&#233;
comme correct ou erron&#233;.
</p>
<p>3 - Tous les cadres valenciels produits sur le corpus d&#8217;apprentissage sont alors regroup&#233;s et cha-
cun d&#8217;eux est repr&#233;sent&#233; par la s&#233;quence de mots du segment enrichis de la fonction syntaxique
du constituant auquel il appartient ouNULL si le mot n&#8217;appartient &#224; aucun constituant. Le classi-
fieur ICSIBOOST est alors entra&#238;n&#233; pour s&#233;parer les exemples jug&#233;s corrects des exemples jug&#233;s
incorrects.
</p>
<p>Lors du traitement d&#8217;un segment de parole, le classifieur r&#233;&#233;value chaque cadre de valence
instanci&#233; produit par l&#8217;analyseur robuste et produit un nouveau classement de la liste de n-
meilleures hypoth&#232;ses. A l&#8217;issue de cette phase de r&#233;ordonnancement, l&#8217;hypoth&#232;se ou les hypo-
th&#232;ses ayant les meilleurs scores au sens du classifieur sont choisies comme solution.
</p>
<p>Dans l&#8217;exemple de la section pr&#233;c&#233;dente, le juge aura marqu&#233; les deux hypoth&#232;ses de rang 5 et
6 comme correctes. Il faut noter que cette &#233;tape d&#8217;adaptation manuelle &#224; une t&#226;che est bien plus
l&#233;g&#232;re que l&#8217;annotation manuelle de corpus ou l&#8217;adaptation de grammaire. Elle est cependant
limit&#233;e par la nature de la t&#226;che de r&#233;ordonnancement : elle ne peut proposer une solution qui
n&#8217;a pas &#233;t&#233; cr&#233;&#233;e par l&#8217;analyseur.
</p>
<p>4 Cadre exp&#233;rimental et &#233;valuation
</p>
<p>Le cadre applicatif choisi est issu du corpus de dialogue MEDIA (Bonneau-Maynard et al., 2005)
d&#233;velopp&#233; lors du projet Technolangue homonyme. Ce corpus a &#233;t&#233; enregistr&#233; selon un proto-
cole de type Magicien d&#8217;Oz simulant un serveur vocal t&#233;l&#233;phonique permettant la r&#233;servations
d&#8217;h&#244;tels. Huit cat&#233;gories de sc&#233;nario ont &#233;t&#233; d&#233;finies correspondant &#224; des degr&#233;s de complexit&#233;s
diff&#233;rents. Le corpus compte 1250 dialogues enregistr&#233;s aupr&#232;s de 250 interlocuteurs et repr&#233;-
sente environ 70 heures de parole.
</p>
<p>L&#8217;analyseur de la section 2 a &#233;t&#233; appliqu&#233; sur deux versions des transcriptions du corpus ME-
DIA : les transcriptions manuelles de r&#233;f&#233;rence et les transcriptions automatiques obtenues &#224;
partir des fichiers audio du corpus gr&#226;ce au syst&#232;me de reconnaissance automatique de la parole
SPEERAL (Nocera et al., 2002). Dans cette premi&#232;re &#233;tude nous avons volontairement restreint
le champs exp&#233;rimental en ne consid&#233;rant qu&#8217;un seul verbe cible, le verbe : &quot;r&#233;server&quot;, &#233;videm-
ment central dans une t&#226;che de r&#233;servation hoteli&#232;re.
</p>
<p>Le corpus utilis&#233; dans cette &#233;tude a &#233;t&#233; d&#233;coup&#233; en trois parties : un corpus d&#8217;apprentissage
constitu&#233; des lots 1,2,3 et 4 du corpus MEDIA ; un corpus de d&#233;veloppement constitu&#233; du &quot;test
&#224; blanc&quot; de la campagne MEDIA et un corpus de test correspondant au corpus &quot;test Hors-
Contexte&quot; de la campagne MEDIA. Les caract&#233;ristiques des trois parties sont d&#233;crites ci-dessous :
</p>
<p>Corpus Apprentissage D&#233;veloppement Test
Nb de dialogues 727 79 208
Nb de tours de parole (utilisateur) 12988 1265 3524
Nb d&#8217;occurrences du verbe r&#233;server 659 73 187
Taux d&#8217;erreur/mot 14.5 25.3 27.4</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique de l&#8217;oral
</p>
<p>Les trois corpus ont &#233;t&#233; trait&#233;s par l&#8217;analyseur et &#224; chaque tour de parole a &#233;t&#233; associ&#233;e la liste
d&#8217;hypoth&#232;ses de d&#233;pendance (&#233;ventuellement vide) pour le verbe cible. A l&#8217;issue de cette ana-
lyse, les listes d&#8217;hypoth&#232;ses ont &#233;t&#233; manuellement v&#233;rifi&#233;es pour marquer les cadres de valences
corrects. Le classifieur charg&#233; du r&#233;ordonnancement des hypoth&#232;ses a &#233;t&#233; entra&#238;n&#233; sur ce cor-
pus d&#8217;apprentissage &#233;tiquet&#233;. Les param&#232;tres de l&#8217;algorithme (nombre d&#8217;it&#233;rations, taille des
n-grammes pour les classifieurs simples, . . . ) ont &#233;t&#233; ajust&#233;s sur le corpus de d&#233;veloppement.
Rappelons que seul le r&#233;ordonnanceur a &#233;t&#233; entra&#238;n&#233; sur le corpus d&#8217;apprentissage. L&#8217;analyseur
syntaxique, lui, n&#8217;a subi aucune adaptation. Enfin l&#8217;&#233;valuation a &#233;t&#233; faite sur le corpus de test.
</p>
<p>Les performances sont exprim&#233;es par les mesures de rappel, pr&#233;cision et F-mesure en utilisant
deux mesures d&#8217;&#233;valuation. Dans la premi&#232;re, une hypoth&#232;se est jug&#233;e correcte si le cadre de
valence s&#233;lectionn&#233; pour le verbe est correct ainsi que tous les actants (leur fonction syntaxique
et la s&#233;quence de formes qui les constituent) La seconde mesure (repr&#233;sent&#233;e entre parenth&#232;ses
dans le tableau) est moins s&#233;v&#232;re, elle n&#8217;&#233;value que la d&#233;tection des actants d&#8217;un verbe (leur
fonction syntaxique et la s&#233;quence de formes qui les constituent), en faisant abstraction du
cadre de valence.
</p>
<p>Trois syst&#232;mes ont &#233;t&#233; &#233;valu&#233;s :
</p>
<p>&#8211; le syst&#232;me Oracle consiste &#224; choisir l&#8217;hypoth&#232;se correcte, si elle existe, dans la liste des n-
meilleures hypoth&#232;ses produites par l&#8217;analyseur. Il correspond &#224; la borne maximale que l&#8217;on
peut atteindre &#224; l&#8217;issue du r&#233;ordonnancement.
</p>
<p>&#8211; le syst&#232;me Baseline se contente de choisir la premi&#232;re hypoth&#232;se produite par l&#8217;analyseur.
&#8211; le syst&#232;me R&#233;ordonnancement r&#233;ordonne les hypoth&#232;ses de l&#8217;analyseur avec le classifieur
pr&#233;sent&#233; dans la section pr&#233;c&#233;dente et entra&#238;n&#233; sur le corpus d&#8217;apprentissage MEDIA.
</p>
<p>Les r&#233;sultats sont donn&#233;s ci-dessous :
</p>
<p>Corpus trans. manuelle trans. auto
syst&#232;me pr&#233;cision rappel F-mesure pr&#233;cision rappel F-mesure
Oracle 90.0 90.0 90.0 63.2 63.2 63.2
Baseline 42.8 (88.8) 38.3 (76.6) 40.4 (82.4) 34.7 (78.2) 29.2 (63.5) 31.6 (70.1)
Reclas. 59.9 (91.1) 70.8 (90.2) 64.9 (90.6) 45.9 (80.4) 53.1 (76.0) 49.2 (78.2)
</p>
<p>Les r&#233;sultats pr&#233;sent&#233;s ci-dessus permettent de tirer un certain nombre de conclusions. La cou-
verture de l&#8217;analyseur sur des entr&#233;es transcrites manuellement sont bonnes (90% de F-mesure).
L&#8217;analyseur se comporte donc bien sur des retranscriptions manuelles de l&#8217;oral. Cette couver-
ture chute &#224; 63% pour des transcriptions automatiques, illustrant la sensibilit&#233; de l&#8217;analyseur
aux erreurs du SRAP. La m&#233;diocrit&#233; des r&#233;sultats du syst&#232;me baseline peut &#234;tre interpr&#233;t&#233;e de
deux mani&#232;re : la fonction de co&#251;t de l&#8217;analyseur est globalement mauvaise (certains choix sont
syntaxiquement aberrants) ou bien elle n&#8217;est pas adapt&#233;e au corpus trait&#233; (certains choix sont
syntaxiquement raisonnables, mais s&#233;mantiquement incorrects). Une inspection rapide des r&#233;-
sultats montre que la r&#233;alit&#233; se situe entre les deux : la fonction de co&#251;t de l&#8217;analyseur peut
&#234;tre am&#233;lior&#233;e mais certains cas rel&#232;vent de la s&#233;mantique. Enfin, la comparaison de la baseline
et du syst&#232;me de r&#233;ordonnancement montre le r&#244;le important du r&#233;ordonnanceur (am&#233;liora-
tion de 55% de la F-mesure sur les transcriptions automatiques), mais qu&#8217;il reste une marge
de progression importante (28.4%). Ces tendances sont aussi valables pour la seconde mesure
d&#8217;&#233;valuation, avec des performances globales plus satisfaisantes (78.2%) pour une t&#226;che qui
reste int&#233;ressante dans le cadre de la compr&#233;hension de parole.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Nasr, Fr&#233;d&#233;ric B&#233;chet
</p>
<p>5 Conclusions
</p>
<p>Nous avons propos&#233; dans cet article un mod&#232;le de traitement syntaxique de l&#8217;oral spontan&#233; qui
se d&#233;compose en deux &#233;tapes. Une analyse syntaxique ax&#233;e sur la d&#233;tection de cadre valenciels,
suivie d&#8217;une &#233;tape de r&#233;ordonnancement des r&#233;sultats de l&#8217;analyse. La premi&#232;re est elle m&#234;me
compos&#233;e d&#8217;une analyse syntagmatique partielle, suivie d&#8217;une &#233;tape de d&#233;tection de cadres va-
lenciels. Ces deux derni&#232;res ont &#233;t&#233; adapt&#233;es au bruit inh&#233;rent aux graphes produits par des
SRAP. Mais cette adaptation doit &#234;tre am&#233;lior&#233;e. En particulier la d&#233;tection de cadres valen-
ciels repose sur un rel&#226;chement extr&#234;me des contraintes syntaxiques, qui pourrait &#234;tre mod&#233;r&#233;.
D&#8217;autre part, l&#8217;analyse syntagmatique manque de robustesse face aux ph&#233;nom&#232;nes propres &#224;
l&#8217;oral. Deux voies sont envisag&#233;es : la modification de la grammaire syntagmatique et le pr&#233;-
traitement des graphes produits par le SRAP afin d&#8217;en &#233;liminer certains ph&#233;nom&#232;nes (h&#233;sitations,
certaines r&#233;p&#233;titions).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A., CL&#201;MENT L. &amp; TOUSSENEL F. (2003). Building a treebank for french. In A.
ABEILL&#201;, Ed., Treebanks. Dordrecht : Kluwer.
ABNEY S. (1996). Partial parsing via finite-state cascades. In Workshop on Robust Parsing,
8th European Summer School in Logic, Language and Information, Prague, Czech Republic.
ANTOINE J.-Y., GOULIAN J. &amp; VILLANEAU J. Quand le TAL robuste s&#8217;attaque au langage
parl&#233; : analyse incrementale pour la compr&#233;hension de la parole spontan&#233;e. In TALN.
BAKER C. F., FILLMORE C. J. &amp; LOWE J. B. (1998). The Berkeley FrameNet project. In
COLING/ACL-98, p. 86&#8211;90.
BONNEAU-MAYNARD H., ROSSET S., AYACHE C., KUHN A. &amp; MOSTEFA D. (2005). Se-
mantic annotation of the french media dialog corpus. In Eurospeech, Lisboa, Portugal.
CRABB&#201; B. (2005a). Grammatical development with xmg. In Logical Aspects of Computa-
tional Linguistics.
CRABB&#201; B. (2005b). Repr&#233;sentation informatique de grammaires fortement lexicalis&#233;es, ap-
plication &#224; la grammaire d&#8217;arbres adjoints. PhD thesis, Universit&#233; Nancy 2.
LEHMANN S. et al. (1996). TSNLP : Test suites for natural language processing. In Procee-
dings of the 16th conference on Computational linguistics, p. 711&#8211;716.
NOCERA P., LINARES G. &amp; MASSONIE D. (2002). Principes et performances du d&#233;codeur
parole continue Speeral. In Proc. Journ&#233;es d&#8217;Etude sur la Parole (JEP).
SAGOT B., CL&#201;MENT L., &#201;RICE VILLEMONTE DE LA CLERGERIE &amp; BOULLIER P. (2006).
The lefff 2 syntactic lexicon for french : architecture, acquisition, use. In LREC.
SCHAPIRE R. E. &amp; SINGER Y. (2000). BoosTexter : A boosting-based system for text cate-
gorization. Machine Learning, 39, 135&#8211;168.
SENEFF S. (1992). TINA : A natural language system for spoken language applications.
Computational Linguistics, 18(1), 61&#8211;86.
VAN DEN EYNDE K. &amp; BLANCHE-BENVENISTE C. (1978). Syntaxe et m&#233;canismes descrip-
tifs : pr&#233;sentation de l&#8217;approche pronominale. Cahiers de lexicologie, 32, 63&#8211;104.
VAN DEN EYNDE K. &amp; MERTENS P. (2003). La valence : l&#8217;approche pronominale et son
application au lexique verbal. Journal of French Language Studies, 13, 63&#8211;104.</p>

</div></div>
</body></html>