<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Sens, synonymes et d&#233;finitions</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Sens, synonymes et d&#233;finitions
</p>
<p>Ingrid Falk1 Claire Gardent2 Evelyne Jacquey3 Fabienne Venant4
</p>
<p>(1) INRIA / Universit&#233; Nancy 2
(2) CNRS / LORIA, Nancy
(3) CNRS / ATILF, Nancy
</p>
<p>(4) Universit&#233; Nancy 2
ingrid.falk@loria.fr,claire.gardent@loria.fr, evelyne.jacquey@atilf.fr,
</p>
<p>fabienne.venant@loria.fr
</p>
<p>R&#233;sum&#233;. Cet article d&#233;crit une m&#233;thodologie visant la r&#233;alisation d&#8217;une ressource s&#233;man-
tique en fran&#231;ais centr&#233;e sur la synonymie. De mani&#232;re compl&#233;mentaire aux travaux existants,
la m&#233;thode propos&#233;e n&#8217;a pas seulement pour objectif d&#8217;&#233;tablir des liens de synonymie entre
lex&#232;mes, mais &#233;galement d&#8217;apparier les sens possibles d&#8217;un lex&#232;me avec les ensembles de sy-
nonymes appropri&#233;s. En pratique, les sens possibles des lex&#232;mes proviennent des d&#233;finitions du
TLFi et les synonymes de cinq dictionnaires accessibles &#224; l&#8217;ATILF. Pour &#233;valuer la m&#233;thode
d&#8217;appariement entre sens d&#8217;un lex&#232;me et ensemble de synonymes, une ressource de r&#233;f&#233;rence a
&#233;t&#233; r&#233;alis&#233;e pour 27 verbes du fran&#231;ais par quatre lexicographes qui ont sp&#233;cifi&#233; manuellement
l&#8217;association entre verbe, sens (d&#233;finition TLFi) et ensemble de synonymes. Relativement &#224; ce
standard &#233;talon, la m&#233;thode d&#8217;appariement affiche une F-mesure de 0.706 lorsque l&#8217;ensemble
des param&#232;tres est pris en compte, notamment la distinction pronominal / non-pronominal pour
les verbes du fran&#231;ais et de 0.602 sans cette distinction.
</p>
<p>Abstract. We present a method for grouping the synonyms of a word into sets represen-
ting the possible meanings of that word. The possible meanings are given by the definitions of
a general dictionary for French, the TLFi (Tr&#233;sor de la langue fran&#231;aise informatis&#233;) and the
method is applied to the synonyms of 5 synonym dictionnaries. To evaluate the method, we
manually constructed a gold standard where for each (word, definition) pair, 4 lexicographers
specified the set of synonyms they judge adequate. The method scores an F-measure of 0.602
when no distinction is made between pronominal and non-pronominal use and 0.706 when it is.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Falk, Gardent, Jacquey, Venant
</p>
<p>1 Introduction
</p>
<p>L&#8217;importance de la s&#233;mantique lexicale pour le TAL n&#8217;est plus &#224; d&#233;montrer. La question de la
repr&#233;sentation du sens et de l&#8217;acc&#232;s &#224; l&#8217;information dans les ressources lexicales devient fonda-
mentale pour la r&#233;solution de nombreux probl&#232;mes actuels tels que la construction d&#8217;ontologies,
la recherche d&#8217;information et la g&#233;n&#233;ration de textes. Cette question est d&#8217;autant plus importante
que pour le fran&#231;ais, on manque encore de ressources s&#233;mantiques de qualit&#233;, structur&#233;es, libre-
ment accessibles et non limit&#233;es &#224; un domaine sp&#233;cialis&#233;.
</p>
<p>Dans cet article, nous pr&#233;sentons une m&#233;thode visant &#224; regrouper les synonymes d&#8217;un mot en
sous-ensembles correspondant aux diff&#233;rents sens possibles de ce mot. Les sens possibles sont
donn&#233;s par les d&#233;finitions du TLFi et l&#8217;objectif est d&#8217;appliquer cette m&#233;thode &#224; la base des
synonymes de l&#8217;ATILF. Par exemple, &#233;tant donn&#233; les d&#233;finitions TLFi (2, en italiques) et les
synonymes (1) extraits des dictionnaires de la base de l&#8217;ATILF pour le verbe achever, la m&#233;-
thode propos&#233;e vise &#224; associer aux d&#233;finitions TLFi , le sous-ensemble de synonymes appropri&#233;
(2).
</p>
<p>(1) Achever : abattre, aboutir, accomplir, aiguiser, am&#233;liorer, an&#233;antir, assommer, boucler, cesser, clore, cl&#244;-
turer, compl&#233;menter, compl&#233;ter, conclure, conduire, consommer, continuer, couronner, estoquer, exp&#233;dier,
ex&#233;cuter, finir, parachever, parfaire, perfectionner, raser, ruiner, r&#233;aliser, r&#233;ussir, se taire, terminer, tuer
</p>
<p>(2) a. Mettre la derni&#232;re main pour perfectionner : accomplir, boucler, clore, cl&#244;turer, conclure, perfectionner
</p>
<p>b. Porter un coup mortel &#224; un animal d&#233;j&#224; atteint physiquement ; donner le coup de gr&#226;ce : assommer,
couronner, estoquer, abattre, an&#233;antir, ex&#233;cuter, ruiner, tuer
</p>
<p>c. Mener &#224; sa fin, compl&#233;ter l&#8217;action de : accomplir, cesser, compl&#233;menter, compl&#233;ter, conduire, finir,
parfaire
</p>
<p>Pour &#233;valuer notre m&#233;thode, nous avons cr&#233;&#233; manuellement une ressource de r&#233;f&#233;rence. Rela-
tivement &#224; cette ressource, notre m&#233;thode affiche une F-mesure de 0.602 lorsque la distinction
prononominal/non-pronominal n&#8217;est pas prise en compte, et de 0.706 lorsqu&#8217;elle l&#8217;est.
</p>
<p>L&#8217;approche propos&#233;e pr&#233;sente des similarit&#233;s avec d&#8217;une part, le travail d&#8217;extraction d&#8217;un word-
net libre pour le Fran&#231;ais (WOLF) pr&#233;sent&#233; dans (Sagot &amp; Fiser, 2008) et d&#8217;autre part, l&#8217;&#233;la-
boration de DicoSyn1 (Manguin et al., 2004). Elle diff&#232;re de DicoSyn en ce qu&#8217;elle permet
d&#8217;associer chaque groupe de synonymes avec une d&#233;finition repr&#233;sentant le sens de ces syno-
nymes. Elle se d&#233;marque de l&#8217;approche pr&#233;sent&#233;e dans (Sagot &amp; Fiser, 2008) en ce que les
ensembles de synonymes (&#171; synsets &#187;) obtenus sont cr&#233;&#233;s &#224; partir de donn&#233;es francophones plu-
t&#244;t que par traduction &#224; partir du WordNet de Princeton pour l&#8217;anglais et d&#233;sambigu&#239;sation sur
des donn&#233;es multilingues. Le travail pr&#233;sent&#233; ici ne porte en outre pas sur la production d&#8217;une
ressource mais plut&#244;t sur la pr&#233;sentation d&#8217;une m&#233;thodologie possible pour la cr&#233;ation d&#8217;une
ressource synonymique.
</p>
<p>L&#8217;article est structur&#233; de la fa&#231;on suivante. La section (2) pr&#233;sente la m&#233;thode mise au point pour
regrouper sens et synonymes, la section (3) r&#233;sume les r&#233;sultats obtenus, la section (4) compare
l&#8217;approche propos&#233;e avec les approches adopt&#233;es pour la cr&#233;ation de DicoSyn et du WOLF et
la section (5) indique les perspectives de recherche pour l&#8217;avenir.
</p>
<p>2 M&#233;thode
</p>
<p>Pour un m&#234;me lex&#232;me, les diff&#233;rents dictionnaires de synonymes de l&#8217;ATILF donnent g&#233;n&#233;-
ralement un nombre de sens et des ensembles de synonymes distincts. Afin de traiter de ces
</p>
<p>1http://www.crisco.unicaen.fr/Presentation-du-dictionnaire.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sens, synonymes et d&#233;finitions
</p>
<p>divergences et de fusionner l&#8217;information contenue par chacun de ces dictionnaires, nous pre-
nons les d&#233;finitions du TLFi comme r&#233;pertoire des sens possibles d&#8217;un lex&#232;me et nous utilisons
des mesures de similarit&#233; pour associer chacun des synonymes r&#233;pertori&#233;s dans les diff&#233;rents
dictionnaires de synonymes avec les sens (d&#233;finitions du TLFi) ad&#233;quats. La m&#233;thode employ&#233;e
comprend les trois grandes &#233;tapes suivantes :
&#8211; Extraction des d&#233;finitions du TLFi et cr&#233;ation d&#8217;un index par d&#233;finition.. L&#8217;index est une
</p>
<p>s&#233;quence de mots pleins lemmatis&#233;s apparaissant dans la d&#233;finition apr&#232;s h&#233;ritage (cf. in-
fra) et en prenant en compte, les champs des entr&#233;es dictionairiques portant sur le domaine
technique, la synonymie et l&#8217;antonymie et les indicateurs d&#8217;emploi.
</p>
<p>&#8211; Mesure de la similarit&#233; entre index. Etant donn&#233; un verbe V , un synonyme SiV de V , les index
extraits des d&#233;finitions TLFi D1V , ..., D
</p>
<p>n
V de V et l&#8217;union des index extraits des d&#233;finitions
</p>
<p>DSiV de S
i
V , des mesures de similarit&#233; sont appliqu&#233;es pour d&#233;terminer la d&#233;finition D
</p>
<p>j
V de V
</p>
<p>la plus similaire des d&#233;finitions de SiV .
&#8211; Association Synonyme/D&#233;finition. Chaque synonyme est associ&#233; avec la (les) d&#233;finition(s)
DjV de V la plus similaire &#224; l&#8217;ensemble de ses d&#233;finitions.
</p>
<p>2.1 Traitement des d&#233;finitions et cr&#233;ation des index
</p>
<p>Parce que les calculs de similarit&#233; op&#232;rent sur les index cr&#233;&#233;s &#224; partir des d&#233;finitions TLFi , il est
important de normaliser et d&#8217;enrichir ces d&#233;finitions autant que possible. Il importe par exemple,
d&#8217;&#233;viter que deux formes soient consid&#233;r&#233;es comme distinctes alors qu&#8217;elles repr&#233;sentent le
m&#234;me lemme (chat/chats) ou encore de pallier le fait que certaines d&#233;finitions du TLFi sont
vides de contenu parce que le texte de la d&#233;finition est suppos&#233; donn&#233; par h&#233;ritage &#224; partir des
niveaux sup&#233;rieurs de l&#8217;entr&#233;e dictionnairique. Nous d&#233;taillons dans ce qui suit, la structure des
entr&#233;es du TLFi et indiquons comment cette structure est utilis&#233;e pour construire les index sur
lesquels seront appliqu&#233;es les mesures de similarit&#233;.
</p>
<p>Les diff&#233;rents types d&#8217;information d&#8217;une entr&#233;e du TLFi. L&#8217;information fournie dans le
TLFi se subdivise en trois grands ensembles : (1) diff&#233;rents types d&#8217;informations non r&#233;trocon-
verties au format XML donc non exploitables ici (&#233;tymologie, fr&#233;quences dans le corpus de
r&#233;f&#233;rence du dictionnaire, d&#233;riv&#233;s, orthographe et prononciation) ; (2) l&#8217;information relative &#224;
l&#8217;organisation hi&#233;rarchique (marques de niveau hi&#233;rarchique, marques de plan, retraits, puces
et tirets) ; et (3) l&#8217;information lexicographique proprement dite qui est divis&#233;e en blocs d&#8217;infor-
mation coh&#233;rents pouvant contenir : un domaine d&#8217;emploi (ferronnerie, justice, etc.),
un indicateur d&#8217;emploi (figur&#233;, familier, pronominal etc), des crochets (informa-
tions tr&#232;s diverses), une d&#233;finition pr&#233;c&#233;d&#233;e ou non d&#8217;une locution d&#233;finie et/ou une relation de
synonymie ou antonymie. C&#8217;est ce dernier type d&#8217;information (l&#8217;information lexicographique)
qui fournit l&#8217;essentiel des informations utilis&#233;es pour construire les index. L&#8217;information hi&#233;rar-
chique, est pour sa part, essentiellement exploit&#233;e pour mettre en &#339;uvre l&#8217;h&#233;ritage descendant
d&#233;fini ci-dessous.
</p>
<p>Identification et cat&#233;gorisation des blocs d&#233;finitionels. Afin d&#8217;identifier et de cat&#233;goriser les
d&#233;finitions d&#8217;une entr&#233;e du TLFi, les r&#232;gles d&#8217;extraction suivantes ont &#233;t&#233; appliqu&#233;es :
D&#233;termination du nombre d&#8217;emplois ou sens de chaque lex&#232;me : est consid&#233;r&#233; comme un em-
</p>
<p>ploi g&#233;n&#233;ral distinct, tout bloc d&#8217;information contenant une d&#233;finition, et/ou une indication
de domaine technique, et/ou un synonyme ou antonyme ;
</p>
<p>Diff&#233;renciation des emplois pronominaux et non-pronominaux : est consid&#233;r&#233; comme un em-
ploi pronominal, tout bloc d&#8217;information contenant un indicateur d&#8217;emploi contenant l&#8217;in-
formation pronominal si le code grammatical de l&#8217;entr&#233;e du verbe est ambigu, ou bien, tous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Falk, Gardent, Jacquey, Venant
</p>
<p>les blocs d&#8217;information de l&#8217;entr&#233;e d&#8217;un verbe indiqu&#233; comme pronominal dans son code
grammatical ;
</p>
<p>Identification des emplois fig&#233;s : est consid&#233;r&#233; comme la description d&#8217;un emploi fig&#233; ou semi-
fig&#233;, tout bloc d&#8217;information dans lequel une expression ou locution d&#233;finie pr&#233;c&#232;de une d&#233;-
finition.
</p>
<p>H&#233;ritage de l&#8217;information. Nous avons proc&#233;d&#233; &#224; un h&#233;ritage descendant et contr&#244;l&#233; afin
d&#8217;expliciter l&#8217;information laiss&#233;e implicite par le lexicographe. Parmi les diff&#233;rents types d&#8217;in-
formations, certains ont &#233;t&#233; consid&#233;r&#233;s comme strictement locaux, d&#8217;autres comme pouvant &#234;tre
propag&#233;s sur les blocs hi&#233;rarchiquement domin&#233;s.
Informations h&#233;ritables : les indicateurs d&#8217;emploi (par exemple emploi pronominal), les cro-
</p>
<p>chets, les indications de domaine technique, le code grammatical de l&#8217;entr&#233;e ;
Informations locales : les d&#233;finitions, les synonymes et antonymes, les expressions illustratives
</p>
<p>et les exemples.
</p>
<p>Cr&#233;ation des index. Pour chaque d&#233;finition identifi&#233;e &#224; partir des informations hi&#233;rarchiques,
l&#8217;information extraite du TLFi comprend : le texte de la d&#233;finition, les synonymes et les an-
tonymes &#233;ventuellement associ&#233;s &#224; cette d&#233;finition et par h&#233;ritage, les indicateurs de domaine
technique. A partir de cette information, l&#8217;index cr&#233;&#233; est la s&#233;quence des lemmes2 de cat&#233;gorie :
Inf (infinitif), S (substantif), A (adjectif, sauf cas cardinal, part. pass&#233;, adverbe), APs (adverbes),
Pr (participe pr&#233;sent sauf g&#233;rondif), Ps (part. pass&#233; sauf cas infitinitif). Par exemple, dans le cas
des d&#233;finitions du verbe projeter, les index extraits seront les suivants : la d&#233;finition Jeter loin
en avant avec force est associ&#233;e &#224; l&#8217;index &#12296; jeter, loin, avant, force &#12297;, la d&#233;finition CIN. AUDIO-
VISUEL. Passer dans un projecteur, qui contient un domaine, &#224; l&#8217;index &#12296; cin&#233;ma, audiovisuel.
passer, projecteur &#12297;, et la d&#233;finition Eclaircir. Synon. jeter quelque lumi&#232;re qui comporte un
synonyme, &#224; l&#8217;index &#12296; &#233;claircir. jeter, lumi&#232;re &#12297;.
</p>
<p>2.2 Calculs des regroupements synonymiques
</p>
<p>Pour un verbe V , un synonyme SV de ce verbe et un ensemble de d&#233;finitions DV = {d1 . . . dn}
extraits du TLFi pour ce verbe nous cherchons &#224; identifier les d&#233;finitions di &#8712; DV de V pour
lesquelles SV est synonyme de V . Pour attribuer un synonyme SV &#224; une d&#233;finition di nous
proc&#233;dons de la mani&#232;re suivante :
</p>
<p>1. Nous comparons l&#8217;index de chaque d&#233;finition di &#8712; DV avec l&#8217;ensemble des d&#233;finitions
de SV en appliquant une mesure de similarit&#233; bas&#233;e sur les lemmes des d&#233;finitions3.
</p>
<p>2. SV sera attribu&#233; aux d&#233;finitions pour lesquelles la mesure de similarit&#233; est la meilleure
(pour autant qu&#8217;elle ne soit pas nulle).
</p>
<p>Afin d&#8217;estimer l&#8217;impact de la mesure de similarit&#233; utilis&#233;e, nous avons compar&#233; les 6 mesures
de similarit&#233; suivantes :
</p>
<p>1. Recouvrement de mots (Simple word overlap) : le score obtenu est le nombre de mots communs
aux deux textes compar&#233;s.
</p>
<p>2Les d&#233;finitions TLFi sont d&#233;ja lemmatis&#233;es et cat&#233;goris&#233;es et les lemmes sont aussi accessibles dans le XML.
3Le sens du synonyme consid&#233;r&#233; n&#8217;&#233;tant pas identifi&#233; par les dictionnaires de synonymes, il est impossible de
</p>
<p>d&#233;terminer la ou les d&#233;finitions pertinentes pour la comparaison verbe/synonyme. C&#8217;est pourquoi, nous prenons
comme base de comparaison l&#8217;ensemble des d&#233;finitions du synonyme et non, la ou les d&#233;finitions correspondant au
sens impliqu&#233;. Bien que cette proc&#233;dure soit ind&#233;niablement inexacte, les r&#233;sultats obtenus indiquent que le bruit
introduit reste acceptable.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sens, synonymes et d&#233;finitions
</p>
<p>2. Recouvrement de mots &#233;tendu (Extended word overlap). &#192; une s&#233;quence de nmots commune entre
les textes compar&#233;s est attribu&#233;e un score de n2. Le score donn&#233; par la mesure de recouvrement de
mots &#233;tendue (Banerjee &amp; Pedersen, 2003)4 est la somme des scores de recouvrements de n mots.
</p>
<p>3. Recouvrement de mots &#233;tendu avec normalisation (Extended word overlap, normalised). Le score
obtenu par le Recouvrement de mots &#233;tendu (2) est normalis&#233; par le nombre de mots des d&#233;finitions
compar&#233;es.
</p>
<p>4. Un vecteur du premier ordre pour un mot indique les co-occurences de ce mot dans un contexte
donn&#233; (en l&#8217;occurence une d&#233;finition du TLFi ). La similarit&#233; de deux mots peut alors &#234;tre calcul&#233;e
par une mesure vectorielle de similarit&#233;. Pour chaque verbe V nous construisons des vecteurs
de mots pond&#233;r&#233;s pour chacune de ses d&#233;finitions DiV et pour chacun de ses synonymes. Les
dimensions de ces vecteurs sont les lemmes des d&#233;finitions de V dont le tf.idf est non nul. Pour
une d&#233;finition DiV , le poid de chaque mot wj est le nombre d&#8217;occurences de wj dans D
</p>
<p>i
V divis&#233;
</p>
<p>par le nombre d&#8217;occurences de wj dans l&#8217;ensemble des d&#233;finitions de V . Pour un synonyme SV
le poid de wj est le nombre d&#8217;occurences de wj dans les d&#233;finitions de SV divis&#233; par le nombre
d&#8217;occurences de wj dans l&#8217;ensemble des d&#233;finitions de V . Le score de similarit&#233; d&#8217;une d&#233;finition
DiV de V et un synonyme SV et le produit scalaire des deux vecteurs correspondants.
</p>
<p>5. Vecteurs du second ordre (avec et sans seuil tf.idf) sont d&#233;riv&#233;s des vecteurs du premier ordre de la
mani&#232;re suivante : pour chaque d&#233;finition d&#8217;un verbe (ou synonyme) le vecteur de deuxi&#232;me ordre
est la somme des vecteurs de premier ordre5 correspondants aux mots pleins qu&#8217;elle contient. Les
vecteurs de second ordre permettent le calcul d&#8217;une direction &#171; moyenne &#187; pour un ensemble de
vecteurs. Quand pour une d&#233;finition les vecteurs de ses mots montrent dans une certaine direc-
tion, la dimension correspondante sera pr&#233;pond&#233;rante dans le vecteur du second ordre. Autrement
dit, les vecteurs du second ordre permettent de cerner le poids des diff&#233;rentes dimensions d&#8217;une
d&#233;finition.
</p>
<p>Etant donn&#233; une mesure de similarit&#233; M, l&#8217;ensemble DV des d&#233;finitions TLFi du verbe V , IV
l&#8217;index de DV et I iV l&#8217;index de la d&#233;finition D
</p>
<p>i
V de V , on calcule pour un synonyme SV de V
</p>
<p>les scores de similarit&#233; SimM(ISV , I
i
V ) pour chaque index I
</p>
<p>i
V .
</p>
<p>On consid&#232;re que SV est un synonyme de V pour le sens repr&#233;sent&#233; par la d&#233;finition DiV si
SimM(ISV , I
</p>
<p>i
V ) = max
</p>
<p>DiV &#8712;DV
SimM(ISV , I
</p>
<p>i
V ) et SimM(ISV , I
</p>
<p>i
V ) &gt; 0.
</p>
<p>La Figure 1 illustre les r&#233;sultats de cette m&#233;thode pour le verbe abandonner6. 1(a) montre les
scores de similarit&#233; de 3 synonymes avec la d&#233;finition TLFi Quitter un lieu, ne plus l&#8217;occuper.
du verbe abandonner, calcul&#233;s par 3 mesures de similarit&#233; diff&#233;rentes. Dans le tableau 1(b), la
mesure de similarit&#233; est fixe (Recouvrement de mots &#233;tendu avec normalisation) mais les scores
sont affich&#233;s pour un synonyme et plusieurs d&#233;finitions. On voit par exemple que le synonyme
d&#233;loger7 atteint le score maximal pour la d&#233;finition 1.1.1.1.1.2.1 (Quitter un lieu . . .). Il sera
consid&#233;r&#233; comme synonyme d&#8217;abandonner avec le sens repr&#233;sent&#233; par cette d&#233;finition. Enfin
</p>
<p>4(Banerjee &amp; Pedersen, 2003) inclut en outre dans la mesure de similarit&#233; les d&#233;finitions des hyponymes, hy-
peronymes, m&#233;ronymes, holonymes et troponymes donn&#233;s par le Princeton WordNet pour les mots impliqu&#233;s dans
les textes compar&#233;s. Nous n&#8217;avons pas pu prendre en compte cette extension du fait de la couverture relativement
pauvre de l&#8217;EuroWordNet Fran&#231;ais (2349 verbes contre e.g., 5077 verbes pour Le Petit Robert). Le WOLF (Sagot
&amp; Fiser, 2008) contient 979 verbes (1544 synsets verbaux) et est imparfait car r&#233;sultant d&#8217;un processus d&#8217;acquisi-
tion automatique. Il serait n&#233;anmoins int&#233;ressant de voir dans quelle mesure l&#8217;information qu&#8217;il contient impacte
la qualit&#233; des r&#233;sultats.
</p>
<p>5Contrairement &#224; 4, les dimensions de l&#8217;espace vectoriel consiste des lemmes de toutes les d&#233;finitions du TLFi
et non pas uniquement les lemmes des d&#233;finitions du verbe en question.
</p>
<p>6Par manque de place, nous n&#8217;avons inclus ni toutes les d&#233;finitions, ni tous les synonymes
7En Fran&#231;ais contemporain, le verbe d&#233;loger n&#8217;est pas un synonyme du verbe abandonner. N&#233;anmoins le
</p>
<p>TLFi associe &#224; d&#233;loger la d&#233;finition Sortir du lieu o&#249; l&#8217;on est install&#233;. Quitter le logement que l&#8217;on occupe (pour
s&#8217;installer ailleurs., d&#8217;o&#249; le lien de synonymie fort d&#233;tect&#233; par notre m&#233;thode.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Falk, Gardent, Jacquey, Venant
</p>
<p>Synonyme r re ren
d&#233;guerpir 1 1 0.067
d&#233;loger 5 8 0.778
d&#233;m&#233;nager 2 5 0.722
</p>
<p>(a) Scores de similarit&#233; selon les me-
sures recouvrement de mots (r), recouvre-
ment &#233;tendu (re) et recouvrement &#233;tendu
avec normalisation (ren) de quelques sy-
nonymes par rapport &#224; la d&#233;finition Quit-
ter un lieu, ne plus l&#8217;occuper.
</p>
<p>Synonyme 1.1.1 1.1.1.2.1 1.1.1.1.2.1 1.1.1.1.1.2.1
rompre 0.213 0.060 0.000 0.000
d&#233;loger 0.000 0.042 0.000 0.778
se d&#233;sister 0.000 0.000 0.167 0.000
</p>
<p>(b) Scores de similarit&#233; par synonyme et d&#233;finition pour quelques
synonymes par rapport &#224; quelques d&#233;finitions, donn&#233;es par leurs
identifiants. La mesure de similarit&#233; est recouvrement de mots
&#233;tendu avec normalisation. En gras les valeurs maximales par sy-
nonyme et l&#8217;ensemble de d&#233;finitions.
</p>
<p>1.1.1 : Rompre le lien qui attachait &#224; une chose ou &#224; une personne.
abjurer, accorder, c&#233;der, d&#233;laisser, d&#233;m&#233;nager, se d&#233;sister, exposer, finir, fuir, larguer, livrer, l&#226;cher, n&#233;gliger,
planter, rejeter, renier, r&#233;signer, rompre, sacrifier, semer, tomber
</p>
<p>1.1.1.1.2.1 : Renoncer &#224; poursuivre une action, une recherche ; renoncer &#224; une entr., &#224; un projet.
confier, se d&#233;mettre, d&#233;missionner, se d&#233;partir, se d&#233;sister, d&#233;teler, flancher, laisser, l&#226;cher, plaquer, reculer, re-
noncer, se r&#233;tirer
</p>
<p>1.1.1.1.1.2.1 : Quitter un lieu, ne plus l&#8217;occuper ;
donner, d&#233;guerpir, d&#233;loger, d&#233;m&#233;nager, d&#233;serter, laisser, l&#226;cher, quitter, rabattre, se s&#233;parer, &#233;vacuer
</p>
<p>(c) Groupements de synonymes par d&#233;finition. La mesure de similarit&#233; est recouvrement de mots &#233;tendu avec normali-
sation.
</p>
<p>FIG. 1: Mesures et scores de similarit&#233; pour quelques synonymes de abandonner. Exemple de calculs de
regroupement de synonymes.
</p>
<p>1(c) montre les ensembles de synonymes obtenus par la m&#233;thode exemplifi&#233;e ci-dessus. Par
rapport &#224; la r&#233;f&#233;rence, 5 des 6 synonymes attribu&#233;s par le syst&#232;me au sens 1.1.1.1.2.1 (Renoncer
. . .), ont aussi &#233;t&#233; attribu&#233;s &#224; ce sens par un lexicographe8.
</p>
<p>3 R&#233;sultats
</p>
<p>Afin d&#8217;&#233;valuer la qualit&#233; des r&#233;sultats obtenus, de comparer les mesures de similarit&#233; et de me-
surer l&#8217;impact du pr&#233;-traitement linguistique, nous avons manuellement cr&#233;&#233; un &#233;chantillon de
r&#233;f&#233;rence permettant de calculer le rappel et la pr&#233;cision de la m&#233;thode propos&#233;e et de diff&#233;rentes
variantes de cette m&#233;thode (diff&#233;rentes mesures de similarit&#233;, diff&#233;rents degr&#233; de pr&#233;-traitement
linguistique).
</p>
<p>L&#8217;&#233;chantillon de r&#233;f&#233;rence. Nous avons s&#233;lectionn&#233; un &#233;chantillon de verbes variant en terme
de fr&#233;quence, polys&#233;mie et g&#233;n&#233;ricit&#233;. Pour chaque dimension, nous avons identifi&#233; des verbes
illustrant trois valeurs (basse, moyenne et &#233;lev&#233;e) induisant un total de 27 verbes (33). La fr&#233;-
quence est estim&#233;e &#224; partir d&#8217;une liste de fr&#233;quence extraite d&#8217;une analyse avec Syntex de 10
ans du Monde (Bourigault &amp; Fabre, 2000), la g&#233;n&#233;ricit&#233; &#224; partir de la position du verbe dans
le module fran&#231;ais de l&#8217;EuroWordNet et la polys&#233;mie &#224; partir du nombre de d&#233;finitions lis-
t&#233;es dans le TLFi . Pour chacun des verbes s&#233;lectionn&#233;s, chaque d&#233;finition TLFi a &#233;t&#233; associ&#233;e
manuellement &#224; un ou plusieurs synonymes de la base par quatre lexicographes ou linguistes.
Sur un total de 7 047 triplets &#12296; Verbe, D&#233;finition, Synonyme &#12297;, le pourcentage d&#8217;accord inter-
annotateurs varie entre 74 et 87% pour les paires d&#8217;annotateur et descend &#224; 63% pour les 4
annotateurs. Aucune des paires ne pr&#233;sente un accord parfait ce qui montre la difficult&#233; de la
</p>
<p>8Pour les deux autres exemples pr&#233;sent&#233;s ici l&#8217;accord lexicographes/syst&#232;me est de 5/6 et 5/7 respectivement</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sens, synonymes et d&#233;finitions
</p>
<p>t&#226;che. Pour l&#8217;&#233;valuation, nous utilisons la r&#233;f&#233;rence cr&#233;&#233;e par le premier annotateur de la paire
ayant l&#8217;accord le plus &#233;lev&#233; (87%).
</p>
<p>Variantes et r&#233;sultats. Dans un premier temps, l&#8217;&#233;chantillon de r&#233;f&#233;rence a &#233;t&#233; utilis&#233; pour
&#233;valuer l&#8217;impact de la mesure de similarit&#233; utilis&#233;e sur le rappel et la pr&#233;cision. Le rappel est le
nombre de triplets &#12296;V,DiV , SV &#12297; trouv&#233;s par le syst&#232;me et contenus dans la r&#233;f&#233;rence divis&#233; par le
nombre de triplets contenus dans la r&#233;f&#233;rence. La pr&#233;cision est le nombre de triplets &#12296;V,DiV , SV &#12297;
trouv&#233;s par le syst&#232;me et contenus dans la r&#233;f&#233;rence divis&#233; par le nombre de triplets trouv&#233;s par
le syst&#232;me. Les r&#233;sultats obtenus pour les diff&#233;rentes mesures sont donn&#233;s en Tableau 1, avec
pour ligne de base (baseline), une association arbitraire entre synonymes et paires &#12296;V,DiV &#12297;.
Dans la premi&#232;re s&#233;rie de r&#233;sultats (sans prise en compte de la distinction pronominal vs. non-
pronominal), on observe que les r&#233;sultats obtenus par les mesures de similarit&#233; sont meilleurs
que le baseline. Les mesures utilis&#233;es permettent donc d&#8217;avoir des r&#233;sultats meilleurs que le
hasard. On observe &#233;galement qu&#8217;il y a peu de diff&#233;rence entre les diff&#233;rentes mesures et que la
pr&#233;cision reste relativement basse.
Cependant, dans la mesure o&#249; l&#8217;extraction des informations lexicographiques du TLFi a pris en
compte la distinction pronominal vs. non-pronominal, il a &#233;t&#233; possible de s&#233;parer les emplois
pronominaux des emplois non pronominaux. Les synonymes de la forme pronominale ne sont
alors compar&#233;s qu&#8217;aux emplois pronominaux et vice versa. Les r&#233;sultats obtenus sur la base de
cette nouvelle proc&#233;dure sont donn&#233;s dans la seconde s&#233;rie de r&#233;sultats, (Tableau 1). Ils montrent
un gain net en pr&#233;cision comme en rappel avec une F-mesure de 0.706 (pour le recouvrement
&#233;tendu normalis&#233;) contre 0.602 sans la distinction pronominal/non pronominal.
</p>
<p>Sans diff. pron vs. non-pron Avec diff. pron vs. non-pron
Mesure sim. R P F R P F
baseline 0.497 0.315 0.385 0.440 0.433 0.437
Recouvrement 0.725 0.508 0.598 0.697 0.685 0.691
Rec. &#233;tendu 0.723 0.508 0.597 0.697 0.685 0.691
Rec. &#233;tendu norm. 0.729 0.513 0.602 0.711 0.670 0.706
Vecteurs 1er ordre 0.727 0.510 0.560 0.704 0.693 0.698
Vecteurs 2nd ordre, sans tf.idf 0.715 0.503 0.590 0.698 0.686 0.692
Vecteurs 2nd ordre, avec tf.idf 0.717 0.505 0.592 0.701 0.689 0.695
</p>
<p>TAB. 1: Pr&#233;cision, rappel et F-mesure pour les diff&#233;rentes mesures de similarit&#233;, avec et sans la distinction
pronominal / non-pronominal.
</p>
<p>En r&#233;sum&#233;, la m&#233;thode propos&#233;e permet une nette am&#233;lioration par rapport &#224; un assignement
synonymes/d&#233;finitions fait au hasard (F-Mesure de 0.706% vs. 0.437% ). La diff&#233;rence entre
r&#233;sultats avec et r&#233;sultats sans pr&#233;traitement des pronominaux montrent en outre qu&#8217;un pr&#233;-
traitement fin des d&#233;finitions du TLFi est une composante importante pour des r&#233;sultats de
qualit&#233;.
</p>
<p>4 Comparaison / interaction possibles avec les ressources fran&#231;aises exis-
tantes</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Falk, Gardent, Jacquey, Venant
</p>
<p>Dicosyn. Dicosyn est un dictionnaire &#233;lectronique, disponible en ligne. Il est issu de la fusion
de 7 dictionnaires9.Le travail initial a &#233;t&#233; r&#233;alis&#233; par (Ploux &amp; Victorri, 1998). On explore ce
dictionnaire sous la forme d&#8217;un graphe : les sommets sont les entr&#233;es du dictionnaire. Un lien
est trac&#233; entre deux sommets lorsque le dictionnaire atteste de leur synonymie. Pour &#233;tudier
la s&#233;mantique d&#8217;un mot donn&#233;, on extrait du graphe de synonymie le sous-graphe constitu&#233;
par ce mot et tous ses synonymes, et seulement ses synonymes. La construction des espaces
s&#233;mantiques repose sur le m&#234;me constat que celui &#233;voqu&#233; pr&#233;c&#233;demment : un synonyme ne
suffit pas en g&#233;n&#233;ral pour d&#233;finir un sens du mot &#233;tudi&#233;. La Figure 2(a) montre un extrait du
graphe de synonymie de abandonner. On y voit que laisser, est &#224; la fois synonyme de quitter
et de confier, qui correspondent &#224; deux sens diff&#233;rents de abandonner. L&#8217;id&#233;e est donc, ici
aussi, de caract&#233;riser un sens par un ensemble de synonymes. Plus pr&#233;cis&#233;ment, Dicosyn utilise
les cliques du graphe de synonymie. Une clique est un ensemble de sommets deux &#224; deux
synonymes le plus grand possible. Le graphe de la Figure 2(a) pr&#233;sente ainsi 2 cliques : &#12296;
abandonner ; confier ; donner ; d&#233;poser, laisser &#12297;, &#12296; abandonner ; d&#233;laisser ; laisser ; quitter ;
renoncer ; &#12297; L&#8217;id&#233;e sous-jacente &#224; la construction des espaces s&#233;mantiques est qu&#8217;une clique
</p>
<p>(a) Un extrait du graphe de synonymie de
abandonner.
</p>
<p>(b) Espace s&#233;mantique associ&#233; au verbe abandonner
</p>
<p>FIG. 2: abandonner : un extrait du graph de synonymie (2(a)), l&#8217;espace s&#233;mantique associ&#233; (2(b)).
</p>
<p>correspond, en premi&#232;re approximation, &#224; une nuance de sens possible pour le mot consid&#233;r&#233;.
Nous ne d&#233;taillons pas ici la technique de construction de l&#8217;espace s&#233;mantique cf. (Ploux &amp;
Victorri, 1998). Disons simplement que l&#8217;espace s&#233;mantique est l&#8217;espace euclidien engendr&#233;
par abandonner et tous ses synonymes. Les points de cet espace sont les cliques du graphe. Les
coordonn&#233;es d&#8217;une clique d&#233;pendent des synonymes qu&#8217;elle contient. La Figure 2(b) montre
l&#8217;espace s&#233;mantique associ&#233; &#224; abandonner. Il s&#8217;agit d&#8217;une vision partielle, puisque l&#8217;espace &#233;tant
de grande dimension, il faut le projeter pour pouvoir en obtenir une vision 2D. Nous voyons ici
la projection selon les deux premiers axes de l&#8217;analyse en composantes principales. De telles
visualisations permettent une visualisation globale de la s&#233;mantique d&#8217;une unit&#233;. Leur int&#233;r&#234;t
principal est de rendre compte de la continuit&#233; du sens, de la difficult&#233; &#224; tracer des fronti&#232;res
nettes entre les sens, de la &#171; ressemblance de famille &#187; existant entre les diff&#233;rents sens d&#8217;une
unit&#233;. Sur la Figure 2 on voit ainsi se d&#233;gager 4 p&#244;les de sens, et la fa&#231;on dont on peut passer
contin&#251;ment d&#8217;un de ces p&#244;les &#224; un autre, en passant par des nuances de sens interm&#233;diaires.
Comparons ces p&#244;les aux 7 sens principaux que l&#8217;on peut extraire du TLFi :
1. Rompre le lien qui attachait &#224; une chose ou une personne ; renoncer &#224; un pouvoir, &#224; des doirs, &#224; la possession
</p>
<p>d&#8217;un bien ou &#224; l&#8217;utilisation d&#8217;une chose
</p>
<p>2. Quitter un lieu ne plus l&#8217;occuper : abandonner un pays, un domicile
</p>
<p>3. Cesser de d&#233;fendre une cause, renoncer &#224; des principes, &#224; une id&#233;e en la rejetant ou simplement en s&#8217;en s&#233;parant :
abandonner une cause, des principes
</p>
<p>4. Renoncer &#224; poursuivre une action, une recherche, renoncer &#224; une entreprise, un projet : abandonner des re-
cherches
</p>
<p>9http ://www.crisco.unicaen.fr/cgi-bin/cherches.cgi</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sens, synonymes et d&#233;finitions
</p>
<p>5. Quitter qqn, s&#8217;en s&#233;parer ; laisser qqn &#224; lui-m&#234;me, le laisser seul
</p>
<p>6. Laisser &#224; qqn la possession ou le soin d&#8217;un bien (ou d&#8217;une pers.), laisser qqc. &#224; l&#8217;enti&#232;re disposition de qqn :
abandonner &#224; qqn le soin de faire qqc
</p>
<p>7. Laisser qqc. ou qqn en proie &#224; qqc (gen. une force hostile) : abandonner une terre aux ravages, abandonner un
enfant au bagne
</p>
<p>Toute la partie sup&#233;rieure de l&#8217;espace s&#233;mantique rassemble des synonymes comme s&#8217;avouer
vaincu, se rendre, caler, c&#233;der, interrompre, repousser qui correspondent au sens 4. En des-
cendant vers la droite de l&#8217;espace s&#233;mantique, on arrive, via la notion de renoncement et de
d&#233;possession, &#224; des synonymes comme jeter, l&#226;cher, larguer, jeter qui correspondent (selon
que l&#8217;objet est humain ou non) aux sens 1 et 5. La partie inf&#233;rieure gauche de l&#8217;espace s&#233;man-
tique rassemble des synonymes comme d&#233;guerpir, fuir qui correspondent plut&#244;t au sens 2. Si
une telle exploration continue peut faire le bonheur d&#8217;un lexicographe ou d&#8217;un s&#233;manticien, on
voit qu&#8217;elle est plus difficile &#224; exploiter automatiquement de par sa granularit&#233; trop fine. Les
exp&#233;riences de d&#233;sambigu&#239;sation men&#233;es &#224; partir des espaces s&#233;mantiques de dicosyn (Venant,
2007; Venant, 2008) ont n&#233;cessit&#233; un regroupement manuel des cliques, les nuances de sens, en
sens macroscopiques correspondant &#224; des d&#233;finitions du TLFi . De plus, comme on a pu le voir
ici, on n&#8217;a pas acc&#232;s &#224; des discriminations de sens en fonction de la nature de l&#8217;objet ou du sujet.
On voit donc ici toute la compl&#233;mentarit&#233; des deux approches. L&#8217;id&#233;al serait &#224; terme d&#8217;&#233;tablir
des correspondances entre les deux ressources, en projetant sur les cliques les appariements
synonymes/d&#233;finitions que nous avons obtenus.
</p>
<p>WOLF. Le WOLF (WOrdnet Libre du Fran&#231;ais est une ressource lexicale s&#233;mantique pour le
fran&#231;ais, librement disponible (Sagot &amp; Fiser, 2008). Il s&#8217;agit d&#8217;un wordnet construit &#224; partir
du Princeton WordNet (PWN) et de diverses ressources multilingues (Sagot &amp; Fiser, 2008), au
moyen de deux approches compl&#233;mentaires. Comme dans tout WordNet, les unit&#233;s lexicales
sont r&#233;parties en cat&#233;gories et organis&#233;es en une hi&#233;rarchie de n&#339;ud, structur&#233;e par des rela-
tions s&#233;mantiques. Chaque n&#339;ud repr&#233;sente un concept et est associ&#233; &#224; un synset (ensemble de
synonymes d&#233;notant ce concept). Le WOLF reprend la structure de PWN. Pour chaque lex&#232;me
monos&#233;mique du PWN, on cr&#233;e l&#8217;entr&#233;e fran&#231;aise correspondante, via une ressource bilingue
anglais-fran&#231;ais. Les lex&#232;mes polys&#233;miques ont &#233;t&#233; trait&#233;s au moyen d&#8217;une approche reposant
sur l&#8217;alignement en mots d&#8217;un corpus parall&#232;le en cinq langues, dont le fran&#231;ais. Diff&#233;rents
lexiques multilingues ont &#233;t&#233; extraits de ce corpus align&#233;. Ces lexiques sont d&#233;sambigu&#239;s&#233;s &#224;
partir des synsets des Balkanet wordnet de chaque langues, qui ont la m&#234;me structure et uti-
lisent les m&#234;mes identifiants de synsets.
Le Wolf ainsi cr&#233;&#233; contient tous les synsets du PWN, y compris ceux pour lesquels aucun
lex&#232;me fran&#231;ais correspondant n&#8217;a &#233;t&#233; trouv&#233;. Le travail que nous avons r&#233;alis&#233; est compl&#233;men-
taire de l&#8217;approche utilis&#233;e par Sagot et al. La m&#233;thode qu&#8217;ils ont choisie permet de cr&#233;er au-
tomatiquement un WordNet &#224; partir d&#8217;un autre existant, mais elle repose sur l&#8217;hypoth&#232;se d&#8217;une
structuration s&#233;mantique identique en anglais et en fran&#231;ais. Nous exploitons quant &#224; nous la
structure s&#233;mantique du TLFi . Cette structure pr&#233;sente l&#8217;avantage d&#8217;&#234;tre sp&#233;cifique au fran&#231;ais.
Le point commun entre les deux approches r&#233;side dans l&#8217;association de chaque concept avec un
ensemble de synonymes. On doit pouvoir envisager une interaction entre les deux ressources.
Par exemple, une comparaison des deux structures permettrait un enrichissement mutuel : d&#8217;une
part la validation, l&#8217;enrichissement ou la correction des synsets existants, d&#8217;autre part l&#8217;exploi-
tation des relations s&#233;mantiques tir&#233;es du WordNet. Ces informations sont sans doute pr&#233;sentes
dans le TLFi , mais elles sont tr&#232;s difficiles &#224; extraire et exploiter automatiquement.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Falk, Gardent, Jacquey, Venant
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; une m&#233;thode permettant d&#8217;associer synonymes et d&#233;finitions. Afin d&#8217;&#233;va-
luer la qualit&#233; des r&#233;sultats obtenus, un &#233;chantillon de r&#233;f&#233;rence a &#233;t&#233; cr&#233;&#233; manuellement avec
un accord inter annotateurs variant entre 63% et 87%. Les r&#233;sultats obtenus pour les diff&#233;rentes
variantes explor&#233;es (diff&#233;rentes mesures de similarit&#233;, diff&#233;rents niveaux de pr&#233;traitement des
d&#233;finitions) montrent d&#8217;une part, que la m&#233;thode permet une pr&#233;cision proche de la borne in-
f&#233;rieure d&#233;limit&#233;e par l&#8217;accord inter-annotateur et d&#8217;autre part, qu&#8217;un pr&#233;traitement pouss&#233; des
d&#233;finitions et en particulier, la diff&#233;rentiation entre usage pronominal et non pronominal, est
essentiel pour la bonne qualit&#233; des r&#233;sultats.
Nous comptons am&#233;liorer la m&#233;thode propos&#233;e par un pr&#233;-traitement plus pouss&#233; des d&#233;finitions
du TLFi . En particulier, la prise en compte des informations de sous-cat&#233;gorisation devrait per-
mettre &#224; la fois d&#8217;enrichir les index utilis&#233;s par les calculs de similarit&#233; et de faire le lien avec les
lexiques syntaxiques r&#233;pertoriant les sch&#233;mas valenciels des &#233;l&#233;ments pr&#233;dicatifs. Ensuite, nous
pensons appliquer la m&#233;thode aux dictionnaires synonymiques disponibles dont en particulier,
les dictionnaires des synonymes de l&#8217;ATILF et le wiktionnaire du fran&#231;ais.
Enfin, nous souhaitons mettre au point une m&#233;thodologie permettant de tirer parti des compl&#233;-
mentarit&#233;s de WOLF et de DicoSyn pour &#233;valuer et compl&#233;menter le dictionnaire synonymique
r&#233;sultant.
</p>
<p>Remerciements. Nous remercions Christiane Jadelot, Aur&#233;lie Merlot et Mick Grzesitchak
pour leur participation &#224; la cr&#233;ation de l&#8217;&#233;chantillon de r&#233;f&#233;rence, Rohan Railkar pour sa contri-
bution &#224; l&#8217;implantation du processus d&#8217;h&#233;ritage et l&#8217;ATILF pour la mise &#224; disposition des sources
dictionnairiques (TLFi et Base des synonymes). Ce projet a &#233;t&#233; partiellement financ&#233; par le p&#244;le
TALC (Traitement automatique des langues et des connaissances10) du contrat plan Etat R&#233;gion
MISN (Mod&#233;lisation, information et syst&#232;mes num&#233;riques).
</p>
<p>R&#233;f&#233;rences
</p>
<p>BANERJEE S. &amp; PEDERSEN T. (2003). Extended gloss overlaps as a measure of semantic relatedness.
</p>
<p>BOURIGAULT D. &amp; FABRE C. (2000). Approche linguistique pour l&#8217;analyse syntaxique de corpus. Rapport
interne, Universit&#233; Toulouse - Le Mirail. Cahiers de Grammaires, no. 25.
</p>
<p>MANGUIN J.-L., FRAN&#199;OIS J., EUFE R., FESENMEIER L., OZOUF C. &amp; S&#201;N&#201;CHAL M. (2004). Le dic-
tionnaire &#233;lectronique des synonymes du crisco : un mode d&#8217;emploi &#224; trois niveaux. Les Cahiers du CRISCO,
17.
PLOUX S. &amp; VICTORRI B. (1998). Construction d&#8217;espaces s&#233;mantiques &#224; l&#8217;aide de dictionnaires informatis&#233;s
des synonymes. In Traitement automatique des langues, volume 39, p. 161&#8211;182.
</p>
<p>SAGOT B. &amp; FISER D. (2008). Building a Free French WordNet from Multilingual Resources. In Proc. of
Ontolex, Marrakech, Maroc.
</p>
<p>VENANT F. (2007). Utiliser des classes de s&#233;lection distributionnelle pour d&#233;sambiguiser les adjectifs. In Trai-
tement Automatique des Langues Naturelles, Toulouse, France.
</p>
<p>VENANT F. (2008). Repr&#233;sentation g&#233;om&#233;trique et calcul dynamique du sens lexical : application &#224; la polys&#233;mie
de livre. Langages, 172.
</p>
<p>10http://talc.loria.fr</p>

</div></div>
</body></html>