<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La plate-forme d&#8217;annotation Glozz</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>La plate-forme d&#8217;annotation Glozz
</p>
<p>Antoine Widl&#246;cher Yann Mathet
</p>
<p>Laboratoire GREYC, CNRS UMR 6072, Universit&#233; de Caen
{antoine.widlocher,yann.mathet}@info.unicaen.fr
</p>
<p>Mots-cl&#233;s : Linguistique de corpus, Annotation, Plate-forme logicielle.
</p>
<p>Keywords: Corpus Linguistics, Annotation, Software Framework.
</p>
<p>1 Une plate-forme d&#8217;annotation g&#233;n&#233;rique
</p>
<p>De plus en plus de travaux en linguistique, en linguistique computationnelle et en Traitement
Automatique des Langues manifestent un int&#233;r&#234;t croissant pour les &#233;tudes sur corpus. &#192; travers
une importante diversit&#233; d&#8217;approches, la n&#233;cessit&#233; d&#8217;une interaction syst&#233;matique entre mod&#232;les,
traitements et corpus rend n&#233;cessaire la disponibilit&#233; - et donc l&#8217;&#233;tablissement - d&#8217;annotations
de r&#233;f&#233;rence auxquelles les mod&#232;les et les traitements pourront &#234;tre confront&#233;s, pour leur &#233;la-
boration ou pour leur &#233;valuation. Or la mise en place de telles annotations est un processus
complexe qui requiert &#224; la fois un cadre formel permettant la repr&#233;sentation d&#8217;objets linguis-
tiques vari&#233;s, et des applications d&#233;di&#233;es &#224; l&#8217;annotation manuelle proprement dite, permettant &#224;
l&#8217;annotateur de localiser sur corpus et de caract&#233;riser les occurrences du ph&#233;nom&#232;ne observ&#233;.
Or, si diff&#233;rents outils d&#8217;annotation ont cons&#233;quemment vu le jour, il convient de remarquer,
d&#8217;une part qu&#8217;ils demeurent souvent fortement li&#233;s &#224; un mod&#232;le th&#233;orique et des objets linguis-
tiques particuliers, et d&#8217;autre part qu&#8217;ils ne permettent que marginalement d&#8217;explorer certaines
structures plus r&#233;cemment appr&#233;hend&#233;es exp&#233;rimentalement, notamment &#224; granularit&#233; &#233;lev&#233;e et
en mati&#232;re d&#8217;analyse du discours.
</p>
<p>La plate-forme Glozz, qui est l&#8217;objet de notre d&#233;monstration, r&#233;pond &#224; ces diff&#233;rentes contraintes
et propose un environnement d&#8217;exploration de corpus et d&#8217;annotation fortement configurable et
non limit&#233; a priori au contexte discursif dans lequel elle a initialement vu le jour. Elle repose
sur un m&#233;ta-mod&#232;le g&#233;n&#233;rique qui permet la repr&#233;sentation et la caract&#233;risation de structures
linguistiques vari&#233;es, observables &#224; diff&#233;rents niveaux de granularit&#233;, qui pourront reposer sur
des segments, des relations ou des dispositifs plus complexes, et auxquelles des repr&#233;sentations
symboliques pourront &#234;tre associ&#233;es, sous forme de structures de traits. Pour une campagne
d&#8217;annotation donn&#233;e, un mod&#232;le d&#8217;annotation pourra &#234;tre d&#233;fini, qui sp&#233;cifiera les objets lin-
guistiques disponibles, et le format des caract&#233;risations dont ils devront faire l&#8217;objet. Contraint
par ce mod&#232;le, l&#8217;annotateur pourra produire graphiquement, ou d&#233;crire formellement, de nou-
velles annotations, en les localisant dans le texte et en y associant les indications attendues.
Dans ce but, il pourra s&#8217;appuyer sur les diff&#233;rentes informations port&#233;es par le corpus, qu&#8217;il
s&#8217;agisse du contenu textuel initial ou d&#8217;informations linguistiques (typographiques, morpholo-
giques, syntaxiques, s&#233;mantiques...), qui pourront r&#233;sulter d&#8217;un traitement pr&#233;alable, manuel ou</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher, Yann Mathet
</p>
<p>automatique. Glozz simplifie l&#8217;acc&#232;s &#224; ces informations, par le biais de diff&#233;rents param&#232;tres
et outils de navigation. Il offre notamment une vue synth&#233;tique du corpus donnant un acc&#232;s
rapide aux zones porteuses d&#8217;indices, permet l&#8217;emphase graphique des objets linguistiques per-
tinents et le filtrage des objets insignifiants pour une t&#226;che donn&#233;e. De plus, Glozz int&#232;gre des
outils de recherche avanc&#233;e pouvant guider l&#8217;exploration du corpus. L&#8217;utilisateur peut notam-
ment restreindre une recherche plein-texte &#224; des contextes sp&#233;cifiques correspondant &#224; des en-
vironnements linguistiques particuliers, ou naviguer rapidement entre les diff&#233;rentes instances
d&#8217;un m&#234;me type d&#8217;objet linguistique, en exprimant &#233;ventuellement des contraintes sur leurs
propri&#233;t&#233;s ant&#233;rieurement sp&#233;cifi&#233;es. Toute annotation s&#8217;inscrit ainsi dans un processus d&#8217;enri-
chissement incr&#233;mental. Elle s&#8217;appuie sur des informations pr&#233;existantes et produit de nouveaux
objets, qui pourront eux-m&#234;mes, &#224; leur tour, devenir &#171; indices &#187;, lors de l&#8217;annotation d&#8217;&#233;l&#233;ments
d&#8217;ordre sup&#233;rieur, l&#8217;ensemble des objets identifi&#233;s (indices et induits) &#233;tant repr&#233;sent&#233; de ma-
ni&#232;re uniforme et exploitable par d&#8217;autres outils.
</p>
<p>2 D&#233;roulement de la d&#233;monstration
</p>
<p>La d&#233;monstration d&#233;bute par l&#8217;installation et l&#8217;ouverture du logiciel, puis l&#8217;ouverture d&#8217;un cor-
pus annot&#233;. Nous exposons ensuite les 7 points relatifs &#224; la figure suivante, que nous explicitons
ci-apr&#232;s.
</p>
<p>12
3
</p>
<p>6
</p>
<p>4
</p>
<p>5
</p>
<p>7
</p>
<p>FIG. 1 &#8211; Interface principale de Glozz</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La plate-forme d&#8217;annotation Glozz
</p>
<p>L&#8217;utilisateur dispose de deux &#171; vues &#187; sur le corpus annot&#233;. La vue principale, en (1), permet de
lire et d&#8217;annoter le texte. Simultan&#233;ment, la vue synoptique, en (2), propose un niveau de grain
permettant d&#8217;embrasser l&#8217;essentiel du texte d&#8217;un coup d&#8217;&#339;il. Nous montrons comment exploiter
efficacement ces deux vues qui fonctionnent en synergie.
</p>
<p>Nous indiquons ensuite la marche &#224; suivre pour cr&#233;er et modifier des &#233;l&#233;ments (unit&#233;s, relations
et sch&#233;mas), via les diff&#233;rents modes d&#233;di&#233;s, qui sont accessibles par les boutons pr&#233;sents en
(3). Nous d&#233;taillons chacun de ces modes sur des exemples concrets, en cr&#233;ant et modifiant
quelques unit&#233;s, puis en en mettant certaines en relation (en &#233;voquant la cr&#233;ation de relations
sur des unit&#233;s distantes gr&#226;ce &#224; la vue synoptique), et enfin en montrant l&#8217;int&#233;gration de quelques
unit&#233;s et relations au sein d&#8217;un sch&#233;ma. En compl&#233;ment, nous pr&#233;sentons les commentaires en
texte libre qu&#8217;il est possible de disposer au fil du texte.
</p>
<p>Nous montrons alors qu&#8217;il est possible d&#8217;associer une structure de traits &#224; chaque entit&#233; cr&#233;&#233;e.
Tout d&#8217;abord, les structures par d&#233;faut attribu&#233;es automatiquement en d&#233;but de d&#233;monstration
sont modifi&#233;es sur quelques exemples, en (4). Puis nous montrons qu&#8217;il est possible de choisir
diff&#233;rents mod&#232;les d&#8217;annotation, et en donnons deux exemples, en (5).
</p>
<p>Une fois les principes de l&#8217;annotation et de la caract&#233;risation (attribution de structures de traits)
acquis, nous pr&#233;sentons les styles qu&#8217;il est possible d&#8217;associer aux unit&#233;s et aux relations, via la
fen&#234;tre d&#233;di&#233;e en (7).
</p>
<p>Enfin, nous pr&#233;sentons les modules optionnels compl&#233;mentaires, qui apparaissent &#224; la demande
dans la zone (6) et qui permettent :
</p>
<p>&#8211; de faire des recherches &#171; plein texte &#187;, ou des recherches par types d&#8217;unit&#233;s, en imposant
&#233;ventuellement des contraintes sur les attributs/valeurs,
</p>
<p>&#8211; de param&#233;trer des seuils d&#8217;imbrication afin de rendre visibles ou non certaines unit&#233;s,
&#8211; d&#8217;acc&#233;der &#224; toutes les annotations via une repr&#233;sentation logico&#239;de permettant non seulement
de parcourir rapidement l&#8217;ensemble des annotations, mais aussi d&#8217;en cr&#233;er de nouvelles par
une saisie textuelle se conformant &#224; une syntaxe simple.
</p>
<p>3 Informations compl&#233;mentaires
</p>
<p>Cette d&#233;monstration de Glozz, ainsi qu&#8217;un guide d&#8217;utilisation du logiciel plus g&#233;n&#233;ral, sont
accessibles sur le web au format vid&#233;o, &#224; l&#8217;adresse http://www.glozz.org.
</p>
<p>Par ailleurs, l&#8217;article intitul&#233; &#171; La plateforme Glozz : environnement d&#8217;annotation et d&#8217;explo-
ration de corpus &#187;, publi&#233; dans les actes de TALN 2009, pr&#233;sente le contexte scientifique dont
Glozz est issu, propose un &#233;tat de l&#8217;art, indique les principes fondamentaux auxquels il est
adoss&#233; et pr&#233;cise les conditions de sa mise en &#339;uvre.</p>

</div></div>
</body></html>