<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un Analyseur S&#233;mantique pour le DHM</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>Un Analyseur S&#233;mantique pour le DHM 
D&#233;monstration 
</p>
<p>J&#233;r&#244;me Lehuen (1), Thierry Lemeunier (2) 
</p>
<p>LIUM - Universit&#233; du Maine 
Avenue La&#235;nnec, 72085 Le Mans Cedex 9 
(1) Jerome.Lehuen@lium.univ-lemans.fr 
</p>
<p>(2) Thierry.Lemeunier@lium.univ-lemans.fr 
</p>
<p>1 Introduction 
Le syst&#232;me pr&#233;sent&#233; est un analyseur s&#233;mantique destin&#233; &#224; &#234;tre int&#233;gr&#233; dans un syst&#232;me de 
dialogue homme-machine avec entr&#233;e vocale. Afin de ne pas faire reposer l&#8217;interpr&#233;tation 
s&#233;mantique sur le succ&#232;s d&#8217;une analyse syntaxique, nous avons cherch&#233; &#224; int&#233;grer des aspects 
syntaxiques et s&#233;mantiques au sein d&#8217;un m&#234;me mod&#232;le, ce qui permet plus facilement de faire 
collaborer ces deux dimensions. De plus, l&#8217;analyseur permet les analyses partielles, ainsi que 
la g&#233;n&#233;ration d&#8217;hypoth&#232;ses lexicales et structurelles. Il repose sur une grammaire syntaxico-
s&#233;mantique contr&#244;l&#233;e par un processus de type analyse tabulaire (Kay, 1986) qui permet de 
contourner certaines structures agrammaticales, ou non d&#233;crites dans la grammaire. 
</p>
<p>2 Mod&#233;lisation 
Les connaissances se pr&#233;sentent sous la forme d&#8217;un lexique dans lequel les entr&#233;es sont 
d&#233;finies &#224; la fois syntaxiquement et s&#233;mantiquement. Une lexie est caract&#233;ris&#233;e par un nom 
(forme normalis&#233;e), par un syst&#232;me d&#8217;offres et d&#8217;attentes s&#233;mantiques, et par au moins une 
forme d&#8217;usage langagi&#232;re (Figure 1). Les offres et les attentes sont des cat&#233;gories ou des traits 
s&#233;mantiques, d&#233;termin&#233;s &#224; partir d&#8217;une ontologie issue de la t&#226;che applicative. Les formes 
d&#8217;usage sont des structures syntaxiques compos&#233;es de mots (symboles terminaux) et/ou de 
relations de d&#233;pendance faisant r&#233;f&#233;rence aux attentes (symboles non-terminaux), comme par 
exemple &#171; A1 chambre A2 &#187; o&#249; A1 et A2 font r&#233;f&#233;rence &#224; des attentes de la lexie [chambre]. 
On obtient ainsi une sorte de grammaire non contextuelle utilisable pour l&#8217;analyse, et 
&#233;ventuellement pour la g&#233;n&#233;ration (Lehuen, 2008). 
</p>
<p> 
Figure 1 : Mod&#232;le de lexie &#224; deux attentes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Lehuen et Lemeunier 
</p>
<p>La repr&#233;sentation s&#233;mantique d&#8217;un &#233;nonc&#233; consiste alors en une structure de d&#233;pendances 
(Tesni&#232;re, 1959) qui couvre les mots ou expressions correspondant &#224; des formes d&#8217;usage 
reconnues. Les n&#339;uds du graphe &#8211; les granules &#8211; correspondent &#224; des lexies instanci&#233;es dans 
le contexte de l&#8217;&#233;nonc&#233; (Figure 2). 
</p>
<p> 
Figure 2 : Des lexies &#224; la structure de granules 
</p>
<p>La lexie [chambre] comporte une attente associ&#233;e &#224; un r&#244;le. Le r&#244;le permet de contextualiser 
un granule fils en fonction de son p&#232;re. Ainsi, un granule poss&#233;dant le trait {nombre} dans le 
contexte d&#8217;un granule [chambre] est un nombre-chambre. 
</p>
<p>3 Impl&#233;mentation et r&#233;sultats 
L&#8217;algorithme d&#8217;analyse tabulaire repose sur l&#8217;algorithme RETE (Forgy, 1982) qui intervient 
dans l&#8217;impl&#233;mentation de syst&#232;mes &#224; base de faits et de r&#232;gles de production, tel que CLIPS1. 
Pratiquement, le lexique cod&#233; en XML est d&#8217;abord traduit sous la forme de r&#232;gles CLIPS &#224; 
l&#8217;aide de transformations XSLT, puis compil&#233; par l&#8217;algorithme RETE. Cet algorithme, qui 
tend &#224; sacrifier la m&#233;moire au profit de la vitesse, s&#8217;est r&#233;v&#233;l&#233; particuli&#232;rement efficace pour 
impl&#233;menter notre algorithme. Les 3000 &#233;nonc&#233;s de 8 mots en moyenne du corpus MEDIA 
(Bonneau-Maynard, 2005) ont &#233;t&#233; analys&#233;s en moins de 4mn, soit 80ms par &#233;nonc&#233; sur un 
Dual Core 2Ghz (ce temps &#233;voluant lin&#233;airement par rapport au nombre de mots). Nos 
r&#233;sultats sur le corpus MEDIA sont plut&#244;t satisfaisants avec un CER (Concept Error Rate) 
&#233;gal &#224; 34,7 par rapport &#224; l&#8217;annotation manuelle en &#171; full 4 modes &#187;. Le tableau suivant place 
notre taux d&#8217;erreurs par rapport aux participants &#224; la campagne MEDIA-EVALDA de 2005 : 
</p>
<p>LIMSI-1 LIMSI-2 LIUM LORIA VALORIA LIA 
29,0 30,3 34,7 36,3 37,8 41,3 
</p>
<p>4 D&#233;monstration 
Notre d&#233;monstration consiste &#224; illustrer la grammaire et le fonctionnement de l&#8217;analyseur &#224; 
l&#8217;aide d&#8217;un lexique et d&#8217;un corpus simplifi&#233;s. Les points abord&#233;s sont les suivants : 
</p>
<p>1. Le mod&#232;le des connaissances (granules, structures de granules, r&#244;les) ; 
2. La r&#233;solution des ambigu&#239;t&#233;s lexicales (utilisation des traits s&#233;mantiques) ; 
3. La g&#233;n&#233;ration des hypoth&#232;ses lexicales (utilisation des formes d&#8217;usage) ; 
4. La g&#233;n&#233;ration des hypoth&#232;ses structurelles (utilisation des traits s&#233;mantiques) ; 
5. La repr&#233;sentation des questions et des n&#233;gations. 
</p>
<p>                                                 
1 CLIPS (C Language Integrated Production System) est un outil de construction de syst&#232;mes &#224; base de r&#232;gles. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyseur S&#233;mantique pour le DHM 
</p>
<p>Chaque point fait l&#8217;objet d&#8217;un mini sc&#233;nario qui illustre la formalisation des connaissances, les 
principes d&#8217;analyse mis en &#339;uvre, ainsi que la repr&#233;sentation obtenue. Par exemple, le point 
n&#176;2 (r&#233;solution des ambigu&#239;t&#233;s lexicales) est illustr&#233; &#224; l&#8217;aide des phrases suivantes : 
</p>
<p>&#8226; Un avocat ambigu&#239;t&#233; personne/fruit non r&#233;solue 
&#8226; Un avocat bien m&#251;r ambigu&#239;t&#233; r&#233;solue par le fils (adjectif) 
&#8226; Un avocat tr&#232;s comp&#233;tent ambigu&#239;t&#233; r&#233;solue par le fils (adjectif) 
&#8226; Je mange un avocat ambigu&#239;t&#233; r&#233;solue par le p&#232;re (verbe) 
&#8226; Je mange un avocat tr&#232;s comp&#233;tent ambigu&#239;t&#233; personne/fruit non r&#233;solue 
</p>
<p>La trace des inf&#233;rences permet de suivre les diff&#233;rentes &#233;tapes de l&#8217;analyse s&#233;mantique : 
</p>
<p> 
</p>
<p>R&#233;f&#233;rences 
BONNEAU-MAYNARD H., ROSSET S., AYACHE C., KUHN A., MOSTEFA D. (2005). Semantic 
Annotation of the French MEDIA dialog corpus. Proceedings of Eurospeech 05, Lisboa. 
</p>
<p>FORGY, C.L. (1982). Rete: A Fast Algorithm for the Many Pattern/Many Object Pattern 
Match Problem. Artificial Intelligence (19), 17-37. 
</p>
<p>KAY M. (1986). Algorithms chemata and data structures in syntactic processing. Readings in 
natural  language processing. San Francisco, CA, USA : Morgan Kaufmann Publishers Inc. 
</p>
<p>LEHUEN J. (2008). Un mod&#232;le de langage pour le DHM : la Grammaire S&#233;mantique 
R&#233;versible (poster), Actes de TALN&#8217;08, 9-13 juin 2008, Avignon (France). 
</p>
<p>TESNI&#200;RE L. (1959). &#201;l&#233;ments de syntaxe structurale, Paris, Klincksiek. </p>

</div></div>
</body></html>