<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me de traduction automatique param&#233;tr&#233; par des atlas dialectologiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Un syst&#232;me de traduction automatique
param&#233;tr&#233; par des atlas dialectologiques
</p>
<p>Yves Scherrer
LATL, Universit&#233; de Gen&#232;ve
</p>
<p>Rue de Candolle 5
1211 Gen&#232;ve 4, Suisse
yves.scherrer@unige.ch
</p>
<p>R&#233;sum&#233;. Contrairement &#224; la plupart des syst&#232;mes de traitement du langage, qui s&#8217;appliquent
&#224; des langues &#233;crites et standardis&#233;es, nous pr&#233;sentons ici un syst&#232;me de traduction automatique
qui prend en compte les sp&#233;cificit&#233;s des dialectes. En g&#233;n&#233;ral, les dialectes se caract&#233;risent par
une variation continue et un manque de donn&#233;es textuelles en qualit&#233; et quantit&#233; suffisantes. En
m&#234;me temps, du moins en Europe, les dialectologues ont &#233;tudi&#233; en d&#233;tail les caract&#233;ristiques
linguistiques des dialectes. Nous soutenons que des donn&#233;es provenant d&#8217;atlas dialectologiques
peuvent &#234;tre utilis&#233;es pour param&#233;trer un syst&#232;me de traduction automatique. Nous illustrons cette
id&#233;e avec le prototype d&#8217;un syst&#232;me de traduction bas&#233; sur des r&#232;gles, qui traduit de l&#8217;allemand
standard vers les diff&#233;rents dialectes de Suisse allemande. Quelques exemples linguistiquement
motiv&#233;s serviront &#224; exposer l&#8217;architecture de ce syst&#232;me.
</p>
<p>Abstract. Most natural language processing systems apply to written, standardized lan-
guage varieties. In contrast, we present a machine translation system that takes into account some
specificites of dialects : dialect areas show continuous variation along all levels of linguistic
analysis, and textual data is often not available in sufficient quality and quantity. At the same
time, many European dialect areas are well studied by dialectologists. We argue that data from
dialectological atlases can be used to parametrize a machine translation system. We illustrate
this idea by presenting the prototype of a rule-based machine translation system that translates
from Standard German into the Swiss German dialect continuum. Its architecture is explained
with some linguistically motivated examples.
</p>
<p>Mots-cl&#233;s : Traduction automatique, dialectes, langues proches, langues germaniques.
</p>
<p>Keywords: Machine translation, dialects, closely related languages, Germanic languages.
</p>
<p>1 Introduction
</p>
<p>La plupart des syst&#232;mes de traduction automatique ont comme objet des vari&#233;t&#233;s de langues
standardis&#233;es, &#233;crites, et parl&#233;es par un grand nombre de locuteurs. Cette tendance s&#8217;explique
d&#8217;une part par l&#8217;acc&#232;s plus ais&#233; &#224; des ressources linguistiques, et d&#8217;autre part par une diss&#233;mination
(ou commercialisation) plus facile du produit final.
</p>
<p>Contrairement &#224; ces syst&#232;mes, nous pr&#233;sentons ici un syst&#232;me de traduction automatique qui
traduit vers des dialectes. Cette particularit&#233; pose quelques d&#233;fis int&#233;ressants. Comme les dialectes</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Scherrer
</p>
<p>sont des vari&#233;t&#233;s linguistiques parl&#233;es, il n&#8217;y a pas de r&#232;gles orthographiques obligatoires, et
peu de donn&#233;es &#233;crites en g&#233;n&#233;ral. Ensuite, les diff&#233;rents dialectes forment un continuum, avec
des zones de transition (Chambers &amp; Trudgill, 1998). Ces propri&#233;t&#233;s emp&#234;chent l&#8217;utilisation
efficace de mod&#232;les standard de traduction automatique. Par contre, on peut d&#233;celer deux facteurs
simplificateurs. D&#8217;une part, les dialectes sont en g&#233;n&#233;ral dans une relation historique proche avec
une langue standardis&#233;e. Une strat&#233;gie int&#233;ressante consiste donc &#224; se baser sur des outils de
traitement linguistique existants pour cette derni&#232;re. D&#8217;autre part, les dialectes ont &#233;t&#233; &#233;tudi&#233;s
(du moins en Europe) de mani&#232;re syst&#233;matique par des dialectologues, et leurs r&#233;sultats peuvent
&#234;tre exploit&#233;es dans un syst&#232;me de traduction automatique.
</p>
<p>Cet article esquisse le d&#233;veloppement d&#8217;un syst&#232;me de traduction automatique bas&#233; sur les r&#232;gles,
qui traduit de l&#8217;allemand standard vers n&#8217;importe quelle vari&#233;t&#233; du continuum dialectal de la
Suisse allemande. Le choix d&#8217;une aire large de vari&#233;t&#233;s-cible implique que les r&#232;gles de transfert
ne sont pas appliqu&#233;es de mani&#232;re uniforme &#224; travers cette aire, et que diff&#233;rentes variantes
peuvent se chevaucher dans les zones de transition. Ces ph&#233;nom&#232;nes seront mod&#233;lis&#233;s &#224; l&#8217;aide
de donn&#233;es fournies par les atlas dialectologiques.
</p>
<p>La section suivante r&#233;sume la situation linguistique dans la partie germanophone de la Suisse, et
pr&#233;sente &#233;galement les donn&#233;es disponibles. Ces facteurs d&#233;terminent les choix m&#233;thodologiques
que nous avons faits (et que nous d&#233;taillons en section 3). La section 4 illustre l&#8217;architecture
du syst&#232;me en discutant quelques ph&#233;nom&#232;nes linguistiques int&#233;ressants. Nous concluons la
pr&#233;sentation par une revue d&#8217;articles de recherche connexes (Section 5), et par quelques r&#233;flexions
sur des extensions futures du syst&#232;me (Section 6).
</p>
<p>2 La situation linguistique en Suisse allemande
</p>
<p>Bien que la Suisse soit un pays relativement petit, elle pr&#233;sente une configuration linguistique
plut&#244;t complexe. La Constitution f&#233;d&#233;rale suisse d&#233;finit l&#8217;allemand, le fran&#231;ais, l&#8217;italien et le
romanche comme langues officielles. L&#8217;aire linguistique allemande (64% de la population suisse)
est la plus &#233;tendue et couvre, grosso modo, les deux tiers du territoire suisse &#224; partir du Nord-Est.
</p>
<p>Il est commun&#233;ment admis que la configuration socio-linguistique de la partie germanophone est
un cas-mod&#232;le de diglossie, c&#8217;est-&#224;-dire un environnement dans lequel deux vari&#233;t&#233;s linguistiques
sont utilis&#233;es de mani&#232;re compl&#233;mentaire dans des contextes fonctionnellement diff&#233;rents. En
Suisse allemande, les dialectes sont utilis&#233;s dans les situations de communication orale, tandis
que l&#8217;allemand standard est employ&#233; presque exclusivement dans la communication &#233;crite. A
la diff&#233;rence d&#8217;autres aires diglossiques, le choix de la vari&#233;t&#233; linguistique ne d&#233;pend pas du
statut social des locuteurs, mais uniquement du moyen de communication. Il s&#8217;ensuit que tous les
Suisses allemands de naissance sont bidialectaux : ils ma&#238;trisent leur dialecte local et l&#8217;allemand
standard (et comprennent en plus les dialectes des autres r&#233;gions de Suisse allemande).
</p>
<p>Des donn&#233;es &#233;crites en dialecte ont toutefois &#233;t&#233; produites dans diff&#233;rents contextes : il existe une
litt&#233;rature dialectale en Suisse allemande, et des enregistrements sonores ont &#233;t&#233; transcrits &#224; des
fins de recherche scientifique. De plus, on &#233;crit souvent en dialecte dans les m&#233;dias &#233;lectroniques
(SMS, E-mail, chat). Cependant, ces donn&#233;es sont tr&#232;s h&#233;t&#233;rog&#232;nes et proviennent de diff&#233;rents
dialectes. Elles sont donc difficilement utilisables dans des approches bas&#233;es sur des corpus. En
outre, les besoins de traduction sont faibles dans une soci&#233;t&#233; diglossique, et des corpus parall&#232;les
sont donc quasi inexistants.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de traduction automatique param&#233;tr&#233; par des atlas dialectologiques
</p>
<p>La classification des dialectes suisse allemands se base en g&#233;n&#233;ral sur des fronti&#232;res administra-
tives, confessionnelles et topographiques. Bien que ces fronti&#232;res aient influenc&#233; les dialectes
&#224; des degr&#233;s divers, la classification qui en r&#233;sulte ne correspond pas toujours &#224; des r&#233;alit&#233;s
linguistiques. Notre mod&#232;le ne se base sur aucune classification &#224; priori ; nous concevons l&#8217;aire
dialectale suisse allemande comme un continuum au sein duquel certains ph&#233;nom&#232;nes montrent
des fronti&#232;res plus nettes que d&#8217;autres.
</p>
<p>Depuis le d&#233;but du 20&#232;me si&#232;cle, le suisse allemand fait l&#8217;objet de recherches dialectologiques.
A c&#244;t&#233; d&#8217;&#233;tudes de ph&#233;nom&#232;nes dialectaux isol&#233;s, trois projets de grande envergure (couvrant
tout le territoire germanophone en Suisse) ont &#233;t&#233; initi&#233;s. Dans le domaine de la lexicographie
dialectale, le W&#246;rterbuch der schweizerdeutschen Sprache est en &#233;laboration depuis 1881 et
devrait &#234;tre termin&#233; en 2020. Le Sprachatlas der deutschen Schweiz (SDS) couvre les diff&#233;rences
phon&#233;tiques, morphologiques et lexicales sous la forme d&#8217;un atlas ; la collection des donn&#233;es et
la publication de ses 8 volumes se sont &#233;chelonn&#233;es de 1939 &#224; 1997 (Hotzenk&#246;cherle et al., 1962
1997). L&#8217;absence de donn&#233;es syntaxiques dans le SDS a conduit &#224; un projet successif appel&#233;
Syntaktischer Atlas der deutschen Schweiz (SADS), un atlas initi&#233; en 2000 et s&#8217;approchant de la
publication. Dans notre projet, nous utilisons des donn&#233;es du SDS, et des r&#233;sultats pr&#233;liminaires
du SADS.
</p>
<p>3 Architecture du syst&#232;me et m&#233;thodologie
</p>
<p>La diglossie en Suisse allemande sugg&#232;re le d&#233;veloppement d&#8217;un syst&#232;me de traduction multimo-
dal, de l&#8217;allemand standard &#233;crit vers le suisse allemand oral. Si cela peut constituer un objectif
de recherche &#224; long terme, cet article traite de la traduction vers du dialecte &#233;crit.
</p>
<p>Comme nous l&#8217;avons &#233;voqu&#233; ci-dessus, les donn&#233;es textuelles ne sont pas suffisantes en quantit&#233;
et en qualit&#233; pour &#234;tre utilis&#233;es dans des mod&#232;les classiques de traduction automatique statis-
tique. En revanche, nous comptons sur l&#8217;utilisation de donn&#233;es dialectales linguistiquement
interpr&#233;t&#233;es (sous forme d&#8217;atlas dialectologiques ou d&#8217;&#233;tudes th&#233;oriques), ce qui favorise une
approche traditionnelle bas&#233;e sur des r&#232;gles de transfert. L&#8217;approche bas&#233;e sur les r&#232;gles a deux
inconv&#233;nients majeurs, qui sont n&#233;anmoins att&#233;nu&#233;s par la configuration linguistique que nous
avons choisie. Premi&#232;rement, la multitude des r&#232;gles de transfert et leurs interactions mutuelles
sont difficiles &#224; ma&#238;triser ; mais dans notre cas, le nombre de r&#232;gles est limit&#233; par la proximit&#233;
linguistique entre l&#8217;allemand standard et les dialectes suisse allemands. Deuxi&#232;mement, cette
approche n&#233;cessite des dictionnaires bilingues avec des informations linguistiques pr&#233;cises ;
nous comptons l&#8217;&#233;viter par la d&#233;rivation en temps r&#233;el de correspondances lexicales en utilisant
des r&#232;gles de correspondances phon&#233;tiques. L&#224; encore, la proximit&#233; linguistique nous permet
d&#8217;emprunter cette voie.
</p>
<p>Le syst&#232;me propos&#233; utilise une approche de transfert classique et consiste en trois op&#233;rations :
l&#8217;analyse syntaxique du texte en langue source, le transfert, et la g&#233;n&#233;ration du texte en langue
cible. Les op&#233;rations de transfert et de g&#233;n&#233;ration impliquent l&#8217;utilisation de cartes dialectolo-
giques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Scherrer
</p>
<p>3.1 Analyse
</p>
<p>Le texte source en allemand standard est analys&#233; phrase par phrase, &#224; l&#8217;aide de l&#8217;analyseur
syntaxique Fips (Wehrli, 2007). Il en r&#233;sulte une repr&#233;sentation structurelle des phrases, contenant
l&#8217;analyse en constituants, des informations morphologiques et de lemmatisation ainsi qu&#8217;une
structure pr&#233;dicat-arguments. Cette repr&#233;sentation structurelle est bas&#233;e sur un format XML, ce
qui nous permet de cr&#233;er des variations du syst&#232;me. Par exemple, il sera possible de remplacer
Fips avec d&#8217;autres outils d&#8217;analyse, ou d&#8217;utiliser directement des phrases analys&#233;es provenant
d&#8217;une banque d&#8217;arbres allemande.
</p>
<p>3.2 Transfert
</p>
<p>Le module de transfert modifie le document XML r&#233;sultant de l&#8217;analyse. Il contient trois types
de r&#232;gles de transfert : les r&#232;gles lexicales, syntaxiques et phon&#233;tiques.1
</p>
<p>Les r&#232;gles syntaxiques sont d&#233;clench&#233;es en fonction de configurations syntaxiques sp&#233;cifiques,
ind&#233;pendamment des mots qui se trouvent dans le texte. Le SADS se base sur 118 questions,
dont plusieurs traitent du m&#234;me ph&#233;nom&#232;ne. Nous estimons donc qu&#8217;une couverture satisfaisante
n&#233;cessitera une quarantaine de r&#232;gles ; &#224; l&#8217;heure actuelle, nous avons impl&#233;ment&#233; une dizaine de
r&#232;gles, dont celle illustr&#233;e dans la section 4.1.
</p>
<p>Les r&#232;gles phon&#233;tiques ont une port&#233;e plus locale et s&#8217;appliquent &#224; des mots d&#8217;origine &#233;tymolo-
gique commune. Elles permettent de remplacer des phon&#232;mes (ou graph&#232;mes) sp&#233;cifiques. Les
donn&#233;es utilis&#233;es par (Scherrer, 2007), portant sur un seul dialecte suisse allemand, sugg&#232;rent
qu&#8217;environ 17% des mots2 sont identiques, et qu&#8217;environ 75% peuvent &#234;tre inf&#233;r&#233;s &#224; l&#8217;aide de
r&#232;gles phon&#233;tiques. Pour l&#8217;impl&#233;mentation, nous visons un ensemble qui d&#233;passe l&#233;g&#232;rement
les 50 r&#232;gles utilis&#233;es dans (Scherrer, 2007) ; ces r&#232;gles sont s&#233;lectionn&#233;es parmi les 300 cartes
phon&#233;tiques du SDS. La section 4.2 en donne un exemple.
</p>
<p>Les r&#232;gles lexicales servent &#224; traduire les correspondances non reli&#233;es &#233;tymologiquement, ainsi
que de nombreux mots &#224; haute fr&#233;quence (mots grammaticaux et lexicaux) dont les idiosyncrasies
ne permettent pas un traitement ad&#233;quat avec des r&#232;gles phon&#233;tiques. Les transformations
lexicales se r&#233;percutent souvent sur le contexte : le changement d&#8217;un lex&#232;me nominal peut
d&#233;clencher un changement de genre sur son article,3 et le changement d&#8217;un lex&#232;me verbal peut
d&#233;clencher un changement dans sa structure argumentale. Nous s&#233;lectionnons les r&#232;gles lexicales
en fonction des donn&#233;es pr&#233;sentes dans les atlas et en fonction de la fr&#233;quence d&#8217;utilisation des
mots selon (Ruoff, 1981).
</p>
<p>Quelques-unes de ces r&#232;gles sont g&#233;n&#233;rales et s&#8217;appliquent uniformement &#224; l&#8217;aire dialectale
suisse allemande enti&#232;re. Mais la plupart des r&#232;gles pr&#233;sentent plusieurs variantes r&#233;gionales.
Ainsi, on associe &#224; chaque r&#232;gle un ensemble de cartes probabilistes. Chaque carte repr&#233;sente
l&#8217;&#233;tendue g&#233;ographique d&#8217;une variante de r&#232;gle. A chaque point, la somme des probabilit&#233;s
des variantes d&#8217;une r&#232;gle est 1. Cette architecture tient donc compte de zones de transition
o&#249; plusieurs variantes sont utilis&#233;es simultan&#233;ment. Dans les zones de transition, le syst&#232;me
ne proposera donc pas une traduction unique, mais plusieurs traductions avec des probabilit&#233;s
</p>
<p>1Ces r&#232;gles sont impl&#233;ment&#233;es en Python et utilisent la fonctionnalit&#233; XPath du module lxml.
2Les statistiques portent sur des types de formes fl&#233;chies.
3Il peut &#233;galement y avoir des modifications &#224; plus longue distance, par exemple au niveau des pronoms
</p>
<p>anaphoriques, ou dans certains dialectes au niveau des adjectifs pr&#233;dicatifs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de traduction automatique param&#233;tr&#233; par des atlas dialectologiques
</p>
<p>diff&#233;rentes. Le choix du dialecte cible est effectu&#233; par l&#8217;utilisateur. Le syst&#232;me traduit donc
toujours vers un seul dialecte sp&#233;cifi&#233; par ses coordonn&#233;es.
</p>
<p>Les cartes pour les r&#232;gles phon&#233;tiques et lexicales sont compil&#233;es &#224; partir de donn&#233;es du SDS.
Malheureusement, ces cartes ne sont pas disponibles en format num&#233;rique et doivent &#234;tre
num&#233;ris&#233;es &#224; la main. Pour les r&#232;gles syntaxiques, les cartes sont cr&#233;&#233;es par l&#8217;auteur &#224; partir des
donn&#233;es pr&#233;liminaires du projet SADS.
</p>
<p>3.3 G&#233;n&#233;ration
</p>
<p>Les fichiers XML obtenus par le module de transfert contiennent les structures syntaxiques et les
racines des mots selon le dialecte choisi par l&#8217;utilisateur. L&#8217;objectif du module de g&#233;n&#233;ration est
donc de cr&#233;er les formes fl&#233;chies sur la base des racines dialectales et des traits morphologiques
contenus dans la structure XML. Les r&#232;gles de g&#233;n&#233;ration peuvent aussi &#234;tre g&#233;or&#233;f&#233;renc&#233;es,
c&#8217;est-&#224;-dire associ&#233;es &#224; des cartes de probabilit&#233;s. Cette approche nous permet de tenir compte des
divergences r&#233;gionales dans les paradigmes flexionnels. Actuellement, notre syst&#232;me contient les
paradigmes des noms, des verbes et des adjectifs r&#233;guliers ainsi que des d&#233;terminants ; ces r&#232;gles
ne sont pas encore g&#233;or&#233;f&#233;renc&#233;es. Ult&#233;rieurement, le module de g&#233;n&#233;ration tiendra &#233;galement
compte des ph&#233;nom&#232;nes de liaison et d&#8217;&#233;lision.
</p>
<p>4 Quelques r&#232;gles de transfert
</p>
<p>Dans cette section, nous illustrons l&#8217;architecture de notre syst&#232;me de traduction automatique
avec deux exemples de r&#232;gles de transfert utilisant des cartes de probabilit&#233;s.
</p>
<p>4.1 Marquage pr&#233;positionnel du datif
</p>
<p>En allemand standard, le datif est r&#233;alis&#233; morphologiquement dans la flexion du d&#233;terminant,
parfois &#233;galement dans la flexion du substantif. Le datif sert (entre autres) au marquage des
objets indirects (1). Dans la plupart des dialectes suisse allemands, la situation est analogue.
Cependant, dans certains dialectes de Suisse centrale, les objets indirects ne sont pas simplement
marqu&#233;s par le datif morphologique, mais &#233;galement par une pr&#233;position (Seiler, 2002). Selon
la r&#233;gion, c&#8217;est la pr&#233;position a ou i qui est utilis&#233;e (2).4 Par contre, les datifs &#224; l&#8217;int&#233;rieur d&#8217;un
syntagme pr&#233;positionnel ne sont pas affect&#233;s par ce marquage suppl&#233;mentaire : (3) en allemand
standard, (4) en dialecte de Suisse centrale. La Figure 1 montre les distributions g&#233;ographiques
des trois variantes de marquage du datif.
</p>
<p>(1) Er
il
</p>
<p>schreibt
&#233;crit
</p>
<p>der
la-DAT
</p>
<p>Mutter.
m&#232;re
</p>
<p>&#8216;il &#233;crit &#224; la m&#232;re&#8217;
</p>
<p>(2) Er
il
</p>
<p>schribt
&#233;crit
</p>
<p>a/i
&#224;/dans
</p>
<p>de
la-DAT
</p>
<p>Mueter.
m&#232;re
</p>
<p>4Ces deux pr&#233;positions sont les &#233;quivalents formels des pr&#233;positions allemand standards an &#8216;&#224;&#8217; et in &#8216;dans&#8217;, mais
ont perdu leur sens locatif.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Scherrer
</p>
<p>FIG. 1 &#8211; Distribution du marquage pr&#233;positionnel du datif en Suisse allemand (SADS I/4, variante
la plus naturelle). Les zones noires repr&#233;sentent des probabilit&#233;s &#233;lev&#233;es, les zones blanches des
probabilit&#233;s basses. A gauche, la distribution du marquage avec la pr&#233;position a ; au milieu, la
distribution du marquage avec la pr&#233;position i ; &#224; droite, les zones sans marquage pr&#233;positionnel
du datif.
</p>
<p>(3) mit
avec
</p>
<p>der
la-DAT
</p>
<p>Mutter
m&#232;re
</p>
<p>(4) mit
avec
</p>
<p>(*a/i) de
la-DAT
</p>
<p>Mueter
m&#232;re
</p>
<p>La r&#232;gle de transfert correspondante se base sur l&#8217;analyse syntaxique fournie par Fips. Une
repr&#233;sentation sch&#233;matique de l&#8217;analyse de (1) se trouve dans la Figure 2.5
</p>
<p>D&#8217;abord, il faut tester si la r&#232;gle de transfert s&#8217;applique &#224; la phrase, ou en d&#8217;autres termes, si la
phrase contient des DP au datif qui ne sont pas r&#233;gis par une pr&#233;position. Si de tels syntagmes
existent, le syst&#232;me charge les trois cartes et d&#233;termine les probabilit&#233;s des trois variantes dans le
dialecte-cible choisi par l&#8217;utilisateur. Si plusieurs variantes sont utilis&#233;es &#224; cet endroit, chaque
variante est appliqu&#233;e &#224; une copie diff&#233;rente de la structure de la phrase. Par exemple, pour la
variante avec la pr&#233;position i, l&#8217;algorithme de transformation est le suivant : &#8220;A la position de
chaque noeud DP au datif non gouvern&#233; par un PP, cr&#233;er un nouveau noeud PP, lui attacher une
t&#234;te pr&#233;positionnelle avec le mot i, et attacher le noeud DP original en tant que compl&#233;ment droit
du PP.&#8221; Enfin, on ajuste la probabilit&#233; de l&#8217;analyse. La structure modifi&#233;e, apr&#232;s application de la
r&#232;gle de transfert, est montr&#233;e dans la Figure 2.
</p>
<p>4.2 Traitement du -nd final
</p>
<p>Nous voudrions montrer ici un exemple de r&#232;gle de transformation phon&#233;tique. Ce type de
transformation est particulier &#224; notre syst&#232;me et ne se retrouve pas dans des syst&#232;mes de traduction
automatique g&#233;n&#233;riques. Les transformations phon&#233;tiques seront exemplifi&#233;es &#224; l&#8217;aide du mot
allemand Hund &#8216;chien&#8217;, dont le groupe consonantique final nd est sujet &#224; modification en suisse
allemand. Les cartes de la Figure 3 montrent les quatre variantes de prononciation qui existent
en Suisse allemande.
</p>
<p>Les r&#232;gles de transformation phon&#233;tique sont d&#233;clench&#233;es apr&#232;s les r&#232;gles syntaxiques, car
elles op&#232;rent de mani&#232;re locale et n&#8217;interf&#232;rent pas avec le contexte grammatical. En partant
</p>
<p>5L&#8217;analyseur Fips suit l&#8217;hypoth&#232;se DP &#8211; le d&#233;terminant se trouve donc &#224; la t&#234;te des syntagmes &#8220;nominaux&#8221;,
appel&#233;s plus pr&#233;cis&#233;ment &#8220;syntagmes d&#233;terminants&#8221;. Les &#233;tiquettes des noeuds finaux suivent les conventions du
Stuttgart-T&#252;bingen-TagSet.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de traduction automatique param&#233;tr&#233; par des atlas dialectologiques
</p>
<p>p= 1.0
</p>
<p>CP
</p>
<p>DP
[+Nom]
</p>
<p>PPER
[+Nom]
[+3Sg]
</p>
<p>[+Masc]
er
</p>
<p>VVFIN
[+3Sg]
[+Ind]
[+Pres]
schreibt
</p>
<p>TP
</p>
<p>VP
</p>
<p>DP
[+Dat]
</p>
<p>ART
[+Dat]
[+Sg]
</p>
<p>[+Fem]
der
</p>
<p>NP
</p>
<p>NN
[+Dat]
[+Sg]
</p>
<p>[+Fem]
Mutter
</p>
<p>p= 0.82
</p>
<p>CP
</p>
<p>DP
[+Nom]
</p>
<p>PPER
[+Nom]
[+3Sg]
</p>
<p>[+Masc]
er
</p>
<p>VVFIN
[+3Sg]
[+Ind]
[+Pres]
schreibt
</p>
<p>TP
</p>
<p>VP
</p>
<p>PP
</p>
<p>APPR
&#12296;i&#12297;
</p>
<p>DP
[+Dat]
</p>
<p>ART
[+Dat]
[+Sg]
</p>
<p>[+Fem]
der
</p>
<p>NP
</p>
<p>NN
[+Dat]
[+Sg]
</p>
<p>[+Fem]
Mutter
</p>
<p>FIG. 2 &#8211; Structures syntaxiques des exemples (1) &#224; gauche, et (2) &#224; droite. Seule la pr&#233;position i
est pr&#233;sent&#233;e dans sa forme dialectale, les autres mots seront transform&#233;es par d&#8217;autres r&#232;gles. La
probabilit&#233; est valable pour la ville d&#8217;Einsiedeln, o&#249; la variante avec la pr&#233;position a occupe les
18% restants.
</p>
<p>de la racine du mot allemand standard, les diff&#233;rentes r&#232;gles phon&#233;tiques sont appliqu&#233;es
s&#233;quentiellement afin de construire la racine dialectale.6 Ces r&#232;gles d&#233;pendent &#233;videmment de la
structure phon&#233;tique du mot, mais aussi de sa partie du discours et de ses traits morphologiques.
</p>
<p>Les transformations phon&#233;tiques op&#232;rent d&#8217;une mani&#232;re similaire aux autres types de transfor-
mations : le syst&#232;me d&#233;tecte les contextes auxquels la r&#232;gle s&#8217;applique, charge les cartes de
probabilit&#233;s des diff&#233;rentes variantes, extrait les probabilit&#233;s des variantes correspondant aux
coordonn&#233;es du dialecte-cible, et applique une expression r&#233;guli&#232;re de substitution pour chaque
variante, cr&#233;ant plusieurs copies selon les besoins.
</p>
<p>La transformation phon&#233;tique de nd est assez r&#233;guli&#232;re et s&#8217;applique, avec peu de changements
dans la distribution g&#233;ographique, &#224; d&#8217;autres mots. Ceci veut dire que les m&#234;mes cartes peuvent
servir &#224; pr&#233;dire la prononciation d&#8217;autres mots comme Hand &#8216;main&#8217; ou gesund &#8216;sain&#8217;. De telles
g&#233;n&#233;ralisations limitent le nombre de cartes en exploitant la proximit&#233; linguistique entre les
dialectes suisse allemands et la vari&#233;t&#233; standard de l&#8217;allemand.
</p>
<p>6Par exemple, une autre r&#232;gle phon&#233;tique d&#233;terminerait la qualit&#233; de la voyelle du mot Hund.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Scherrer
</p>
<p>FIG. 3 &#8211; Transformation du nd final dans le mot Hund (SDS II/120). La prononciation nd est
maintenue dans la plupart des r&#233;gions de Suisse allemande (carte en haut &#224; gauche). ng ([N] en
&#233;criture phon&#233;tique) est utilis&#233; dans la r&#233;gion de Berne (carte en haut &#224; droite). n est utilis&#233; dans
la r&#233;gion fribourgeoise et dans quelques r&#233;gions du Sud-Est (carte en bas &#224; gauche). nt est limit&#233;
aux r&#233;gions alpines (carte en bas &#224; droite).
</p>
<p>5 Travaux connexes
</p>
<p>Le m&#233;moire de (Forst, 2002) s&#8217;apparente probablement le plus &#224; notre recherche. Il propose
un syst&#232;me de traduction automatique de l&#8217;allemand standard vers le dialecte zurichois, bas&#233;
sur le cadre th&#233;orique de la LFG. Toutefois, l&#8217;utilisation d&#8217;une th&#233;orie standard l&#8217;emp&#234;che de
b&#233;n&#233;ficier de la proximit&#233; linguistique des deux vari&#233;t&#233;s linguistiques trait&#233;es, et il ne tient pas
compte de la diversit&#233; dialectale en Suisse allemande. Un autre projet de traduction automatique
concerne le dialecte italien Veneto, qu&#8217;il est pr&#233;vu de traduire vers l&#8217;anglais en utilisant l&#8217;italien
standard comme langue pivot.7 Les dialectes suisse allemands ont aussi fait l&#8217;objet de recherches
en synth&#232;se de la parole (Siebenhaar et al., 2004).
</p>
<p>Un champ d&#8217;&#233;tudes connexe est l&#8217;analyse syntaxique de dialectes. (Vaillant, 2008) propose un
mod&#232;le factoris&#233; pour analyser les diff&#233;rents cr&#233;oles antillais &#224; base fran&#231;aise. Son mod&#232;le est
bas&#233; sur le framework TAG et utilise un param&#232;tre num&#233;rique pour s&#233;lectionner le cr&#233;ole. La
topographie de l&#8217;aire dialectale antillaise simplifie le mod&#232;le puisqu&#8217;il n&#8217;existe pas de zones de
transition entre les diff&#233;rentes &#238;les. (Chiang et al., 2006) pr&#233;sentent une grammaire synchrone
pour l&#8217;arabe standard moderne et le dialecte arabe du Levant. Leur approche est essentiellement
bas&#233;e sur les corpus, mais inclut des adaptations manuelles.
</p>
<p>La traduction entre vari&#233;t&#233;s dialectales peut &#234;tre vue comme un cas de traduction entre langues
proches. Dans ce domaine, on peut citer des travaux sur diff&#233;rentes langues slaves (Hajic et al.,
2003) ou sur les langues romanes de l&#8217;Espagne (Corbi-Bellot et al., 2005).
</p>
<p>Une sous-t&#226;che de la traduction automatique est la cr&#233;ation de correspondances lexicales bi-
lingues, g&#233;n&#233;ralement extraits d&#8217;un corpus parall&#232;le &#224; l&#8217;aide de techniques d&#8217;alignement. Pour
des langues proches, des approches bas&#233;es sur la similarit&#233; phon&#233;tique peuvent &#234;tre utilis&#233;es
(Mann &amp; Yarowsky, 2001; Kondrak &amp; Sherif, 2006). A c&#244;t&#233; de m&#233;thodes d&#8217;apprentissage auto-
matique, (Scherrer, 2007) utilise des mod&#232;les de similarit&#233; bas&#233;s sur les r&#232;gles afin d&#8217;induire des
correspondances lexicales entre l&#8217;allemand standard et le dialecte bernois.
</p>
<p>Du c&#244;t&#233; de la dialectologie, nous avons d&#233;j&#224; mentionn&#233; les atlas dialectologiques que nous
utilisons. Pour am&#233;liorer la couverture lexicale, il pourrait &#234;tre int&#233;ressant d&#8217;utiliser des ouvrages
de lexicographie dialectale. Si de tels dictionnaires ne sont pas disponibles en format num&#233;rique
pour la Suisse, le projet dbo@ema pr&#233;voit de cr&#233;er une base de donn&#233;e lexicale g&#233;or&#233;f&#233;renc&#233;e
</p>
<p>7R. Delmonte, communication personnelle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de traduction automatique param&#233;tr&#233; par des atlas dialectologiques
</p>
<p>pour les dialectes autrichiens (Wandl-Vogt, 2008).
</p>
<p>Les m&#233;thodes computationnelles sont aussi utilis&#233;es en dialectom&#233;trie, afin de calculer les
diff&#233;rences entre diff&#233;rents dialectes &#224; l&#8217;aide de mesures num&#233;riques objectives. Si ces diff&#233;rences
peuvent &#234;tre mesur&#233;es sur tout type de donn&#233;e linguistique, l&#8217;approche la plus pratique est de
comparer des mots de diff&#233;rents dialectes avec des m&#233;thodes de distance d&#8217;&#233;dition (Nerbonne &amp;
Heeringa, 2001). Les dialectes peuvent ensuite &#234;tre classifi&#233;s moyennant une analyse de cluster.
</p>
<p>6 Perspectives et conclusion
</p>
<p>Nous avons pr&#233;sent&#233; le prototype d&#8217;un syst&#232;me de traduction automatique qui tient compte des
sp&#233;cificit&#233;s de la traduction de l&#8217;allemand standard vers le suisse allemand. On peut distinguer
deux id&#233;es principales dans ce mod&#232;le.
</p>
<p>La premi&#232;re id&#233;e consiste &#224; mod&#233;liser un continuum entier de vari&#233;t&#233;s dialectales (plut&#244;t que de
se limiter &#224; un ou deux dialectes prototypiques). En cons&#233;quence, nous proposons d&#8217;utiliser des
donn&#233;es r&#233;colt&#233;es par des dialectologues afin de param&#233;trer les r&#232;gles de transfert.
</p>
<p>La seconde id&#233;e d&#233;coule du fait que tous les dialectes suisse allemands partagent une base
linguistique commune avec l&#8217;allemand standard. Comme des ressources linguistiques dialectales
sont difficiles &#224; obtenir ou &#224; cr&#233;er, nous proposons d&#8217;exploiter au maximum les ressources
existantes pour l&#8217;allemand standard. Par exemple, beaucoup de correspondances lexicales ne
sont pas introduites explicitement dans un lexique, mais sont d&#233;riv&#233;es automatiquement &#224; l&#8217;aide
de r&#232;gles phon&#233;tiques.
</p>
<p>Nous avons &#233;galement pr&#233;sent&#233; la nature ouverte de notre syst&#232;me et les possibilit&#233;s d&#8217;extension
qui r&#233;sultent de ce choix. Peut-&#234;tre l&#8217;extension la plus int&#233;ressante est celle de cr&#233;er une banque
d&#8217;arbres pour quelques dialectes suisse allemands, qui pourraient ensuite rendre possible l&#8217;utili-
sation de m&#233;thodes statistiques. En particulier, des mod&#232;les statistiques pourraient s&#8217;av&#233;rer plus
robustes pour la direction de traduction allant des dialectes vers l&#8217;allemand standard.
</p>
<p>En ce moment, le syst&#232;me pr&#233;sent&#233; contient une vingtaine de r&#232;gles de transfert. La moiti&#233; de
ces r&#232;gles s&#8217;applique &#224; l&#8217;aire dialectale enti&#232;re sans distinction g&#233;ographique, l&#8217;autre moiti&#233; est
g&#233;or&#233;f&#233;renc&#233;e. La couverture du syst&#232;me est donc encore extr&#234;mement limit&#233;e, et une &#233;valuation
de la performance ne serait pas pertinente &#224; ce stade du projet. N&#233;anmoins, avec la couverture
et la complexit&#233; croissante du syst&#232;me, des moyens d&#8217;&#233;valuation doivent &#234;tre consid&#233;r&#233;s. Une
possibilit&#233; est d&#8217;utiliser un texte parall&#232;le existant dans plusieurs vari&#233;t&#233;s dialectales. Un tel texte
existe pour 70 points d&#8217;enqu&#234;te, mais il est relativement court (environ 250 mots). Une autre
possibilit&#233; est de recourir &#224; une &#233;valuation manuelle, en se basant sur un r&#233;seau d&#8217;informants.
Cependant, il est difficile de pr&#233;voir la qualit&#233; d&#8217;une telle &#233;valuation puisque les dialectophones
ne sont pas habitu&#233;s &#224; juger des textes dialectaux, et encore moins des textes &#233;crits. De toute
fa&#231;on, en l&#8217;absence d&#8217;un grand corpus pluridialectal, toutes les &#233;valuations resteront qualitatives.
</p>
<p>Actuellement, la t&#226;che la plus importante est d&#8217;&#233;tendre la couverture du syst&#232;me selon les crit&#232;res
esquiss&#233;s ci-dessus. Nous allons s&#233;lectionner un ensemble de ph&#233;nom&#232;nes dialectaux importants
afin de limiter le travail de pr&#233;paration et de num&#233;risation des donn&#233;es. Ainsi, nous esp&#233;rons
atteindre une couverture satisfaisante malgr&#233; nos ressources limit&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Scherrer
</p>
<p>R&#233;f&#233;rences
</p>
<p>CHAMBERS J. K. &amp; TRUDGILL P. (1998). Dialectology. Cambridge : Cambridge University
Press, 2 edition.
</p>
<p>CHIANG D., DIAB M., HABASH N., RAMBOW O. &amp; SHAREEF S. (2006). Parsing Arabic
dialects. In Proceedings of EACL&#8217;06, p. 369&#8211;376, Trento.
</p>
<p>CORBI-BELLOT A. M., FORCADA M. L., ORT&#205;Z-ROJAS S., P&#201;REZ-ORTIZ J. A., RAM&#205;REZ-
S&#193;NCHEZ G., S&#193;NCHEZ-MART&#205;NEZ F., ALEGRIA I., MAYOR A. &amp; SARASOLA K. (2005).
An open-source shallow-transfer machine translation engine for the Romance languages of
Spain. In Proceedings of EAMT&#8217;05, p. 79&#8211;86, Budapest.
</p>
<p>FORST M. (2002). La traduction automatique dans le cadre formel de la LFG &#8211; un syst&#232;me
de traduction entre l&#8217;allemand standard et le zurichois. In Publications du CTL, volume 41.
Universit&#233; de Lausanne.
</p>
<p>HAJIC J., HOMOLA P. &amp; KUBON V. (2003). A simple multilingual machine translation system.
In Proceedings of the Machine Translation Summit XI, p. 157&#8211;164, La Nouvelle-Orl&#233;ans.
</p>
<p>R. HOTZENK&#214;CHERLE, R. SCHL&#196;PFER, R. TR&#220;B &amp; P. ZINSLI, Eds. (1962-1997). Sprachatlas
der deutschen Schweiz. Berne : Francke.
</p>
<p>KONDRAK G. &amp; SHERIF T. (2006). Evaluation of several phonetic similarity algorithms on the
task of cognate identification. In Proceedings of the ACL&#8217;06 Workshop on Linguistic Distances,
p. 43&#8211;50, Sydney.
</p>
<p>MANN G. S. &amp; YAROWSKY D. (2001). Multipath translation lexicon induction via bridge
languages. In Proceedings of NAACL&#8217;01, Pittsburgh.
</p>
<p>NERBONNE J. &amp; HEERINGA W. (2001). Computational comparison and classification of
dialects. In W. VIERECK &amp; H. GWOSDEK, Eds., Dialectologia et Geolinguistica. Journal of
the International Society for Dialectology and Geolinguistics, number 9, p. 69&#8211;83. Alessandria :
Edizioni dell&#8217;Orso.
</p>
<p>RUOFF A. (1981). H&#228;ufigkeitsw&#246;rterbuch gesprochener Sprache. T&#252;bingen : Niemeyer.
</p>
<p>SCHERRER Y. (2007). Adaptive string distance measures for bilingual dialect lexicon induction.
In Proceedings of ACL&#8217;07, Student Research Workshop, p. 55&#8211;60, Prague.
</p>
<p>SEILER G. (2002). Prepositional dative marking in Upper German : a case of syntactic micro-
variation. In S. BARBIERS, L. CORNIPS &amp; S. VAN DER KLEIJ, Eds., Syntactic Microvariation,
volume II. Amsterdam : Meertens Institute Electronic Publications in Linguistics.
</p>
<p>SIEBENHAAR B., FORST M. &amp; KELLER E. (2004). Prosody of Bernese and Zurich German.
what the development of a dialectal speech synthesis system tells us about it. In P. GILLES &amp; J.
PETERS, Eds., Regional Variation in Intonation, p. 219&#8211;238. T&#252;bingen : Niemeyer.
</p>
<p>VAILLANT P. (2008). Grammaires factoris&#233;es pour des dialectes apparent&#233;s. In Actes de
TALN&#8217;08, p. 159&#8211;168, Avignon.
</p>
<p>WANDL-VOGT E. (2008). An der Schnittstelle von Dialektw&#246;rterbuch und Sprachatlas : Das
Projekt &#8220;Datenbank der bairischen Mundarten in &#214;sterreich electronically mapped (dbo@ema)&#8221;.
In S. ELSPASS &amp; W. K&#214;NIG, Eds., Germanistische Linguistik 190-191. Sprachgeographie
digital. Die neue Generation der Sprachatlanten, p. 197&#8211;212. Hildesheim : Olms.
</p>
<p>WEHRLI E. (2007). Fips, a &#8220;deep&#8221; linguistic multilingual parser. In Proceedings of the ACL&#8217;07
Workshop on Deep Linguistic Processing, p. 120&#8211;127, Prague.</p>

</div></div>
</body></html>