<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Composition multilingue de sentiments</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Composition multilingue de sentiments
</p>
<p>Stefanos Petrakis1 Manfred Klenner1 &#201;tienne Ailloud1 Angela Fahrni1
</p>
<p>(1) Institute of Computational Linguistics, University of Zurich, Switzerland
{petrakis, klenner, ailloud}@ifi.uzh.ch, angela.fahrni@swissonline.ch
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons ici PolArt, un outil multilingue pour l&#8217;analyse de sentiments
qui aborde la composition des sentiments en appliquant des transducteurs en cascade. La com-
positionnalit&#233; est assur&#233;e au moyen de polarit&#233;s pr&#233;alables extraites d&#8217;un lexique et des r&#232;gles
de composition appliqu&#233;es de mani&#232;re incr&#233;mentielle.
</p>
<p>Abstract. We introduce PolArt, a multilingual tool for sentiment detection that copes
with sentiment composition through the application of cascaded transducers. Compositionality
is enabled by prior polarities taken from a polarity lexicon and the compositional rules applied
incrementally.
</p>
<p>Mots-cl&#233;s : Analyse de sentiments.
</p>
<p>Keywords: Sentiment Detection.
Moyens techniques : Acc&#232;s &#224; Internet : http://www.cl.uzh.ch/kitt/polart/.
</p>
<p>1 Introduction
</p>
<p>L&#8217;analyse de sentiments a pour objectif d&#8217;identifier les polarit&#233;s (positives ou n&#233;gatives) de
portions d&#8217;un texte&#8212;mots, syntagmes et phrases. La polarit&#233; d&#8217;un syntagme est obtenue en
combinant les polarit&#233;s des mots qui le composent, et ainsi de suite : L&#8217;analyse de sentiments
est donc &#224; traiter de mani&#232;re compositionnelle. Par exemple, la phrase &#171; This is an unrealistic
hope &#187; est n&#233;gative, car un adjectif n&#233;gatif jouxtant un nom positif produit un syntagme nominal
n&#233;gatif.
</p>
<p>PolArt fait usage de lexiques de sentiments, sp&#233;cifiques &#224; chacune des langues-cibles. Pour
la version anglaise nous utilisons le lexique de subjectivit&#233; (T.Wilson &amp; P.Hoffmann, 2005),
pour la version allemande un lexique manuellement extrait et annot&#233; &#224; partir de GermaNet
(http://www.sfs.uni-tuebingen.de/GermaNet/). La version fran&#231;aise utilise un
lexique automatiquement induit &#224; partir du lexique allemand, en se basant sur le dictionnaire
allemand-fran&#231;ais disponible &#224; l&#8217;adresse http://dict.leo.org/. Le lexique de senti-
ments allemand contient 8500 mots &#233;tiquet&#233;s avec une polarit&#233; et comme la version fran&#231;aise
est bas&#233;e sur la version allemande et que nous conservons les synonymes, le lexique fran-
&#231;ais en contient plus de 8500 (par ex., l&#8217;allemand &#8217;Angst&#8217; induit les polarit&#233;s pour : &#8217;anxi&#233;t&#233;&#8217;,
&#8217;peur&#8217;, . . .).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Petrakis, Klenner, Ailloud, Fahrni
</p>
<p>FIG. 1 &#8211; Outil de visualisation : entr&#233;e
</p>
<p>2 PolArt&#8212;l&#8217;outil de visualisation
</p>
<p>La figure 1 montre le panneau de saisie de PolArt, notre outil d&#8217;analyse de sentiments. L&#8217;uti-
lisateur peut directement ins&#233;rer du texte dans la zone de saisie ou bien d&#233;cider de charger un
fichier contenant le(s) texte(s) &#224; analyser. Le syst&#232;me travaille sur du texte brut, mais une option
permet n&#233;anmoins d&#8217;analyser du texte avec balises HTML. Enfin, l&#8217;utilisateur doit s&#233;lectionner
la langue-cible appropri&#233;e, pour l&#8217;instant &#224; choisir parmi anglais, allemand et fran&#231;ais.
</p>
<p>La figure 2 montre un exemple de sortie produite &#224; partir d&#8217;un texte fran&#231;ais. Ici, une exploration
par cibles est possible. Pour illustrer ceci, nous avons choisi une liste arbitraire de mots-cibles
(fen&#234;tre de gauche). Le choix de ces mots-cibles est sp&#233;cifique &#224; l&#8217;application d&#233;sir&#233;e. En cli-
quant sur un &#233;l&#233;ment de la liste (par ex. &#8217;d&#233;fiance&#8217;), les occurrences positives, n&#233;gatives et non
&#233;valu&#233;es de la cible sont rendues accessibles (par d&#233;roulement dans la m&#234;me fen&#234;tre). Un clic
sur une valeur de polarit&#233; (par ex. n&#233;gative) fait appara&#238;tre tous les syntagmes &#233;valuant la cible
selon cette valeur et leur fr&#233;quence s&#8217;affiche dans la fen&#234;tre en haut &#224; droite (fen&#234;tre des syn-
tagmes polaris&#233;s). En cliquant sur le syntagme (par ex. &#8217;la d&#233;fiance &#233;veille la d&#233;fiance&#8217;), on
fait appara&#238;tre le contexte discursif dans la fen&#234;tre en bas &#224; droite (fen&#234;tre contextuelle) ; les
syntagmes interpr&#233;t&#233;s par le syst&#232;me sont mis en surbrillance avec des couleurs diff&#233;renci&#233;es.
</p>
<p>FIG. 2 &#8211; Outil de visualisation : sortie</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sentiment Composition across Multiple Languages
</p>
<p>3 Composition de la polarit&#233;
</p>
<p>Notre approche de l&#8217;analyse de sentiments est conceptuellement simple et pragmatique ; elle se
contente d&#8217;un petit nombre de r&#232;gles de composition &#233;labor&#233;es &#224; la main et d&#8217;un sch&#233;ma incr&#233;-
mentiel en cascade. Passer &#224; un domaine diff&#233;rent ne n&#233;cessitera que l&#8217;adaptation du lexique, pas
des r&#232;gles. Les donn&#233;es de d&#233;part pour cette cascade sont fournies par la sortie de l&#8217;&#233;tiqueteur-
chunker (H.Schmid, 1994), disponible pour l&#8217;anglais, le fran&#231;ais et l&#8217;allemand. En partant par
ex. de la phrase &#171; He doesn&#8217;t fail to verify his excellent idea &#187;, la cascade se pr&#233;sente comme suit
(les indices indiquent l&#8217;it&#233;ration,&#8594; la r&#233;&#233;criture ; la polarit&#233; pr&#233;alable des lex&#232;mes est donn&#233;e
par leur exposant : &#8217;+&#8217; signifie positif, &#8217;*&#8217; d&#233;note un &#233;changeur de polarit&#233;, &#8217;idea&#8217; est neutre) :
</p>
<p>his excellent+ idea &#8594; POS1
to verify+ POS1 &#8594; POS2
fail&#8727; POS2 &#8594; NEG3
doesn&#8217;t&#8727; NEG3 &#8594; POS4
</p>
<p>Au final la polarit&#233; est n&#233;gative au niveau de la phrase. Nous avons &#233;labor&#233; un m&#233;talangage pour
faciliter l&#8217;adaptation des r&#232;gles (actuellement 80 pour l&#8217;anglais, 70 pour l&#8217;allemand et 10 pour le
fran&#231;ais), ce qui est n&#233;cessaire pour d&#233;crire les configurations sp&#233;cifiques &#224; chaque langue (no-
tamment la position de l&#8217;adjectif dans le syntagme nominal, etc.). Notre &#233;valuation de PolArt
porte sur des textes anglais et allemands. La version fran&#231;aise est actuellement en cours d&#8217;&#233;va-
luation. Les donn&#233;es anglaises comprennent 248 syntagmes issus de 35 textes du groupe &#171; I
battle depression &#187; de l&#8217;Experience Project (http://www.experienceproject.com/).
Pour l&#8217;allemand ce sont 1209 syntagmes issus de romans d&#8217;Eduard von Keyserling. Cette &#233;va-
luation donne 90,38% de pr&#233;cision pour les syntagmes positifs et 80,48% pour les n&#233;gatifs.
</p>
<p>4 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; PolArt, un outil robuste et trilingue d&#8217;analyse de sentiments. Une version
de d&#233;monstration est accessible en ligne &#224; http://www.cl.uzh.ch/kitt/polart/.
Nous avons montr&#233; qu&#8217;une simple cascade de r&#233;&#233;criture de polarit&#233;s fournit un sch&#233;ma simple
et efficace pour une composition de polarit&#233; robuste. Nos r&#232;gles de r&#233;&#233;criture sont ind&#233;pendantes
du domaine, mais sp&#233;cifiques &#224; une langue (de m&#234;me que les lexiques de polarit&#233;). Les versions
anglaise et allemande sont stables et d&#233;j&#224; &#233;valu&#233;es ; la version fran&#231;aise est en d&#233;veloppement.
</p>
<p>Remerciements
Ce travail de recherche est support&#233; par le projet 10015&#8211;122546/1 du Fonds National Suisse.
</p>
<p>R&#233;f&#233;rences
</p>
<p>H.SCHMID (1994). Probabilistic part-of-speech tagging using decision trees. In Inten. Conf.
on New Methods in Language Processing 1994.
T.WILSON J. &amp; P.HOFFMANN (2005). Recognizing contextual polarity in phrase-level senti-
ment analysis. In HLT/EMNLP 2005, Vancouver, CA.</p>

</div></div>
</body></html>