<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Profilage s&#233;mantique endog&#232;ne des relations de synonymie au sein de Gene Ontology</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Profilage s&#233;mantique endog&#232;ne des relations de synonymie au
sein de Gene Ontology
</p>
<p>Thierry Hamon1, Natalia Grabar2
</p>
<p>(1)LIPN &#8211; UMR 7030, Universit&#233; Paris 13 &#8211; CNRS, 99 av. J-B Cl&#233;ment,
F-93430 Villetaneuse, France
</p>
<p>(2)Centre de Recherche des Cordeliers, Universit&#233; Pierre et Marie Curie -
Paris6, UMR_S 872, Paris, F-75006 France ; Universit&#233; Paris Descartes,
</p>
<p>UMR_S 872, Paris, F-75006 France ; INSERM, U872, Paris, F-75006 France ;
HEGP AP-HP
</p>
<p>R&#233;sum&#233;. Le calcul de la similarit&#233; s&#233;mantique entre les termes repose sur l&#8217;existence et
l&#8217;utilisation de ressources s&#233;mantiques. Cependant de telles ressources, qui proposent des &#233;qui-
valences entre entit&#233;s, souvent des relations de synonymie, doivent elles-m&#234;mes &#234;tre d&#8217;abord
analys&#233;es afin de d&#233;finir des zones de fiabilit&#233; o&#249; la similarit&#233; s&#233;mantique est plus forte. Nous
proposons une m&#233;thode d&#8217;acquisition de synonymes &#233;l&#233;mentaires gr&#226;ce &#224; l&#8217;exploitation des ter-
minologies structur&#233;es au travers l&#8217;analyse de la structure syntaxique des termes complexes et
de leur compositionnalit&#233;. Les synonymes acquis sont ensuite profil&#233;s gr&#226;ce aux indicateurs
endog&#232;nes inf&#233;r&#233;s automatiquement &#224; partir de ces m&#234;mes terminologies (d&#8217;autres types de re-
lations, inclusions lexicales, productivit&#233;, forme des composantes connexes). Dans le domaine
biom&#233;dical, il existe de nombreuses terminologies structur&#233;es qui peuvent &#234;tre exploit&#233;es pour
la constitution de ressources s&#233;mantiques. Le travail pr&#233;sent&#233; ici exploite une de ces terminolo-
gies, Gene Ontology.
</p>
<p>Abstract. Computing the semantic similarity between terms relies on existence and usage
of semantic resources. However, these resources, often composed of equivalent units, or syno-
nyms, must be first analyzed and weighted in order to define within them the reliability zones
where the semantic similarity shows to be stronger. We propose a method for acquisition of
elementary synonyms which is based on exploitation of structured terminologies, analysis of
syntactic structure of complex (multi-unit) terms and their compositionality. The acquired sy-
nonyms are then profiled thanks to endogenous indicators (other types of relations, lexical in-
clusions, productivity, form of connected components), which are automatically inferred within
the same terminologies. In the biomedical area, several structured terminologies have been built
and can be exploited for the construction of semantic resources. The work we present in this
paper, is applied to terms of one of these terminologies, i.e. the Gene Ontology.
</p>
<p>Mots-cl&#233;s : Terminologie, distance s&#233;mantique, relations s&#233;mantiques, synonymie.
</p>
<p>Keywords: Terminology, semantic distance, semantic relations, synonymy.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Hamon et Natalia Grabar
</p>
<p>1 Introduction
</p>
<p>Il est important de pouvoir d&#233;tecter et calculer la similarit&#233; s&#233;mantique entre les termes, comme
dans les exemples suivants : acetone anabolism et acetone biosynthesis ; replication of mito-
chondrial DNA et mtDNA replication, et acetone catabolism et acetone breakdown. En effet,
diff&#233;rentes applications du traitement automatique de langue (TAL) &#8211; comme la recherche d&#8217;in-
formation, expansion de requ&#234;tes, extraction de connaissances, appariement de terminologies,
fusion de bases de donn&#233;es &#8211; en sont demandeuses. Les lexiques de synonymes et de variantes
morphologiques peuvent &#234;tre utilis&#233;s pour le calcul de la similarit&#233; s&#233;mantique. En fonction
des langues et des domaines, ces lexiques sont plus ou moins complets. La morphologie de
la langue g&#233;n&#233;rale est la mieux d&#233;crite au travers des bases de donn&#233;es d&#233;di&#233;es comme Ce-
lex (Burnage, 1990) ou MorTAL (Hathout et al., 2001). Quant &#224; la langue biom&#233;dicale, &#224; la-
quelle nous nous int&#233;ressons dans ce travail, elle dispose surtout de ressources en anglais d&#233;-
crites dans l&#8217;UMLS Specialized Lexicon (NLM, 2007), mais &#233;galement de ressources similaires
dans d&#8217;autres langues (Schulz et al., 1999; Zweigenbaum et al., 2003), dont le fran&#231;ais. Par
contre, tr&#232;s peu est fait pour la constitution de ressources de synonymie : WordNet (Fellbaum,
1998) propose des synonymes pour l&#8217;anglais g&#233;n&#233;ral, mais les ressources correspondantes pour
d&#8217;autres langues ne sont pas librement disponibles. Par ailleurs, WordNet est insuffisant pour
le traitement de la langue biom&#233;dicale (Bodenreider et al., 2003) et l&#8217;initiative de son adapta-
tion &#224; ce domaine (Smith &amp; Fellbaum, 2004) semble avoir &#233;t&#233; abandonn&#233;e. Nous pouvons donc
constater un vrai manque de ressources de synonymie dans le domaine biom&#233;dical. Par contre,
ce domaine propose plusieurs terminologies (i.e., Gene Ontology (Gene Ontology Consortium,
2001), Snomed (C&#244;t&#233; et al., 1997) ou MeSH (NLM, 2001)) qui recensent des termes complexes
et souvent leurs synonymes. L&#8217;utilisation des termes biom&#233;dicaux complexes ne semble pas
&#234;tre facile ni g&#233;n&#233;ralisable par les outils du TAL (Poprat et al., 2008), tandis que les ressources
lexicales, proposant des entit&#233;s lexicales plus courtes et maniables, assurent cette fonction avec
plus de naturel.
</p>
<p>Dans notre travail, nous proposons d&#8217;utiliser les terminologies existantes pour inf&#233;rer et ensuite
profiler un lexique de synonymes &#233;l&#233;mentaires du domaine biom&#233;dical. Nous verrons que de
tels synonymes sont en effet souvent &#171; cach&#233;s &#187; au sein de termes complexes. Notre m&#233;thode
exploite essentiellement la compositionnalit&#233; des termes complexes et d&#8217;autres informations
s&#233;mantiques endog&#232;nes accessibles au travers les m&#234;mes terminologies.
</p>
<p>2 Mat&#233;riel et m&#233;thode
</p>
<p>Nous travaillons avec Gene Ontology (GO) (Gene Ontology Consortium, 2001), qui propose un
vocabulaire structur&#233; et contr&#244;l&#233; pour la description des r&#244;les de g&#232;nes et de leurs produits dans
diff&#233;rents organismes. Les termes GO appartiennent &#224; trois hi&#233;rarchies : processus biologiques,
fonctions mol&#233;culaires et composants cellulaires. Les termes sont structur&#233;s avec quatre types
de relations : subsomption is-a, m&#233;ronymie part-of, synonymie et une relation transversale
regulates. Nous avons utilis&#233; la version de Gene Ontology t&#233;l&#233;charg&#233;e le 19 f&#233;vrier 2008.
Cette version contient 26 057 concepts et 79 994 libell&#233;s ou termes, ce qui correspond &#224; une
moyenne de 3,07 termes synonymes par concept. Ces termes sont reli&#233;s entre eux avec 433 294
relations is-a, 34 032 part-of et 460 780 relations de synonymie. Ce sont ces paires de
termes que nous utilisons dans notre travail.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Profilage s&#233;mantique endog&#232;ne des relations de synonymie
</p>
<p>composant
principaldependance
</p>
<p>replicationmtDNA
</p>
<p>dependance
composant
principal
</p>
<p>mitochondrial DNAreplication (of)
</p>
<p>FIG. 1 &#8211; Analyse syntaxique de termes synonymes : replication of mitochondrial DNA et
mtDNA replication.
</p>
<p>Les termes GO sont souvent form&#233;s sur un sch&#233;ma compositionnel (Verspoor et al., 2003; Mun-
gall, 2004; Ogren et al., 2005). Selon la notion de compositionnalit&#233;, le sens d&#8217;une expression
complexe est d&#233;termin&#233; par sa structure syntaxique, le sens de ses composants et la fonction de
composition (Partee, 1984). Par exemple, le concept GO :0009073 contient les synonymes qui
d&#233;voilent leur structure compositionnelle au travers la substitution d&#8217;un de leurs composants
(composants soulign&#233;s dans les exemples) :
</p>
<p>aromatic amino acid family biosynthesic process, aromatic amino acid family biosynthesis,
aromatic amino acid family anabolism
aromatic amino acid family formation, aromatic amino acid family synthesis
</p>
<p>Nous exploitons ce principe pour l&#8217;induction de synonymes &#233;l&#233;mentaires. Il permet ainsi d&#8217;in-
duire la s&#233;rie suivante de synonymes &#233;l&#233;mentaires :
</p>
<p>biosynthesic process, biosynthesis, anabolism, formation, synthesis
Cette approche exploite le travail pr&#233;c&#233;dent (Hamon &amp; Nazarenko, 2001), o&#249; les auteurs avaient
pour objectif de d&#233;tecter des relations de synonymie entre termes complexes &#233;tant donn&#233; des
relations de synonymie entre les termes simples. Dans le pr&#233;sent travail, la fonction inverse de
la compositionnalit&#233; est exploit&#233;e : &#224; partir des termes complexes, nous induisons des termes
simples. Nous avons d&#233;crit l&#8217;impl&#233;mentation et la g&#233;n&#233;ralisation de cette approche dans (Hamon
&amp;Grabar, 2008) et mentionnons ici, pour la clart&#233; de l&#8217;expos&#233;, uniquement ses points principaux
(sec. 2.1). Nous d&#233;crivons ensuite les crit&#232;res pour le profilage des relations de synonymie (sec.
2.2).
</p>
<p>2.1 Acquisition de relations s&#233;mantiques &#233;l&#233;mentaires
</p>
<p>La premi&#232;re &#233;tape de la m&#233;thodologie mise en oeuvre consiste &#224; effectuer le pr&#233;-traitement des
termes. Lors du pr&#233;-traitement, nous effectuons la segmentation des termes de la terminolo-
gie en mots, l&#8217;&#233;tiquetage morpho-syntaxique des termes et leur lemmatisation avec TreeTagger
(Schmid, 1994). Nous effectuons ensuite une analyse syntaxique des termes et calculons les
d&#233;pendances syntaxiques avec l&#8217;outil YATEA
</p>
<p>1. Tous ces traitements sont r&#233;alis&#233;s au travers la
plateforme Ogmios2 adapt&#233;e au traitement de grands volumes de donn&#233;es et au domaine de la
biom&#233;decine. &#192; l&#8217;issu de cette &#233;tape, chaque terme est consid&#233;r&#233; comme un arbre syntaxique
binaire (comme sur la fig. 1) compos&#233; de deux composants : composant principal (replication)
et d&#233;pendance (mitochondrial DNA et mtDNA).
</p>
<p>La deuxi&#232;me &#233;tape consiste en application des r&#232;gles de compositionnalit&#233;. Ainsi, deux termes
complexes synonymes A rel B et A rel B&#8242; avec le sensM ont la repr&#233;sentation s&#233;mantique
suivante (le sens des termes complexes est fonction des sens de leurs composants) :
</p>
<p>M(A rel B) = f(M(A),M(B),M(rel))
1http ://search.cpan.org/&#8764;thhamon/Lingua-YaTeA/
2http ://search.cpan.org/&#8764;thhamon/Alvis-NLPPlatform/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Hamon et Natalia Grabar
</p>
<p>M(A rel B&#8242;) = f(M(A),M(B&#8242;),M(rel))
&#192; partir de ce principe, pour ces deux termes A rel B et A rel B&#8242;, si un des composants
(dans cet exemple, le composant principalA) est identique, alors les composants de d&#233;pendance
(B et B&#8242;) sont synonymes. Cette r&#232;gle permet d&#8217;induire la paire de synonymes &#233;l&#233;mentaires
{mitochondrial DNA, mtDNA} &#224; partir des synonymes complexes replication of mitochondrial
DNA et mtDNA replication. La variation est aussi accept&#233;e sur le composant principal (A et A&#8242;)
dans une paire A rel B et A&#8242; rel B (comme dans acetone catabolism et acetone breakdown), de
m&#234;me que sur les deux composants &#224; la fois, comme dans A rel B et A&#8242; rel B&#8242; : nicotinamide
adenine dinucleotide catabolism et NAD breakdown, o&#249; l&#8217;un des composants (par exemple,
{catabolism, breakdown}) correspond &#224; des synonymes d&#233;j&#224; connus.
</p>
<p>Cette m&#233;thode n&#8217;est pas sp&#233;cifique &#224; un type de relations. Elle fonctionne &#224; un niveau assez
abstrait de la langue &#8211; gr&#226;ce &#224; la repr&#233;sentation syntaxique &#8211; et est applicable &#224; d&#8217;autres types
de relations. Ainsi, avec le changement du type de la relation entre les termes complexes, le type
de la relation entre leurs composants change de la m&#234;me mani&#232;re. Par exemple, si nous avons
en entr&#233;e des termes complexes en relation part-of et si les r&#232;gles de compositionnalit&#233; sont
applicables, les termes &#233;l&#233;mentaires inf&#233;r&#233;s auront la relation part-of entre eux. Ainsi, &#224;
partir des deux termes de processus biologiques cerebral cortex development GO :0021987 et
cerebral cortex regionalization GO :0021796, nous inf&#233;rons la relation &#233;l&#233;mentaire part-of
entre leurs composants development et regionalization. Il en va de m&#234;me pour les relations
is-a : &#224; partir de termes cell activation GO :0001775 et astrocyte activation GO :0048143 en
relation is-a, nous pouvons &#233;tablir la relation &#233;l&#233;mentaire is-a entre cell et astrocyte.
</p>
<p>2.2 Profilage de relations s&#233;mantiques
</p>
<p>Le profilage des relations s&#233;mantiques poursuit plusieurs objectifs : (1) faciliter la validation
des relations de synonymie inf&#233;r&#233;es, (2) pond&#233;rer ces relations pour garantir une meilleure sp&#233;-
cificit&#233; lors de leur exploitation par un outil automatique, (3) respecter la nature contextuelle des
relations s&#233;mantiques (Cruse, 1986). Pour profiler les relations de synonymie, nous combinons
les indicateurs g&#233;n&#233;r&#233;s automatiquement et de mani&#232;re endog&#232;ne &#224; partir de GO :
</p>
<p>1. Relations &#233;l&#233;mentaires is-a acquises selon la m&#233;thode d&#233;crite en sec. 2.1 ;
2. Relations &#233;l&#233;mentaires part-of acquises selon cette m&#234;me m&#233;thode d&#233;crite en sec. 2.1 ;
3. Inclusion lexicale. Les termes en relation de synonymie sont contr&#244;l&#233;s pour l&#8217;inclusion
</p>
<p>lexicale (Bodenreider et al., 2001). Si le test est positif, comme dans {binding, DNA
binding}, les deux termes peuvent alors &#234;tre en relation hi&#233;rarchique : la subsomption
lexicale marque souvent la subsomption hi&#233;rarchique (Kleiber &amp; Tamba, 1990) ;
</p>
<p>4. Productivit&#233; des relations de synonymie au sein de GO. La productivit&#233; correspond au
nombre de paires de synonymes originaux &#224; partir desquelles une relation &#233;l&#233;mentaire est
inf&#233;r&#233;e. Par exemple, {catabolism, breakdown} est inf&#233;r&#233; &#224; partir de six paires originales
et {nicotinamide adenine dinucleotide, NAD} &#224; partir de deux, tandis que {anabolism,
biosynthesis} est inf&#233;r&#233; &#224; partir de 15 paires. Ainsi, du point de vue de productivit&#233; de ces
paires, {anabolism, biosynthesis} appara&#238;t le plus fiable.
</p>
<p>5. Observation des paires de synonymes au sein des composantes connexes. Les paires de
synonymes &#233;l&#233;mentaires sont fusionn&#233;es et observ&#233;es au sein des composantes connexes.
La g&#233;n&#233;ration des composantes connexes est faite en exploitant les relations de ces paires
de synonymes. Par exemple, &#224; partir de deux relations de synonymes {anabolism, bio-
synthesis} et {anabolism, synthesis}, nous g&#233;n&#233;rons une composante connexe compos&#233;e</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Profilage s&#233;mantique endog&#232;ne des relations de synonymie
</p>
<p>de trois noeuds : anabolism, biosynthesis et synthesis. Le travail avec les composantes
connexes de synonymes, plut&#244;t qu&#8217;avec les paires de synonymes, nous permet de :
&#8211; situer les paires de synonymes dans un contexte plus global, o&#249; la synonymie est port&#233;e
au niveau des familles de synonymes ;
</p>
<p>&#8211; observer la forme des composantes connexes, qui peut &#234;tre r&#233;v&#233;latrice de la force des
relations de synonymie au sein des composantes connexes et donc de leur fiabilit&#233; ;
</p>
<p>&#8211; explimer la force de synonymie de mani&#232;re num&#233;rique, par exemple en calculant la
densit&#233; des composantes connexes. Pour calculer la densit&#233;, nous prenons en compte
le nombre effectif d&#8217;arr&#234;tes Nb &#8722; arre&#770;tes et le nombre d&#8217;arr&#234;tes que pr&#233;senterait une
clique (une composante connexe compl&#232;te o&#249; tous les noeuds sont reli&#233;s entre eux)
Nb &#8722; arre&#770;tes &#8722; clique. La densit&#233; est calcul&#233;e comme suit : D = Nb&#8722;arre&#770;tes
</p>
<p>Nb&#8722;arre&#770;tes&#8722;clique
Selon cette formule, plus il y a de relations au sein d&#8217;une composante connexe, plus
cette composante connexe est forte et plus la valeur de la densit&#233; D est proche de 1.
LorsqueD est &#233;gal &#224; 1, il s&#8217;agit d&#8217;une clique. Dans le cadre de profilage des relations de
synonymie, plus la valeur de D est proche de 1 plus ces relations sont fortes et fiables.
</p>
<p>La pond&#233;ration des relations de synonymie est bas&#233;e sur les principes suivants :
&#8211; Lorsqu&#8217;une relation de synonymie cooccurre avec un des trois premiers indicateurs et/ou
lorsque sa productivit&#233; est faible cette relation s&#8217;en trouve affaiblie ;
</p>
<p>&#8211; Lorsqu&#8217;une relation de synonymie appara&#238;t toute seule (ne cooccurre pas avec un des trois
premiers indicateurs) et elle montre une productivit&#233; &#233;lev&#233;e, et la composante connexe cor-
respondante montre une densit&#233; &#233;lev&#233;e, alors il est fort probable qu&#8217;il s&#8217;agisse d&#8217;une relation
de synonymie correcte.
</p>
<p>3 R&#233;sultats et discussion
</p>
<p>3.1 Acquisition de relations s&#233;mantiques &#233;l&#233;mentaires
</p>
<p>79 994 termes GO ont &#233;t&#233; analys&#233;s gr&#226;ce &#224; la plateforme Ogmios. Les r&#232;gles de composition
(sec. 2.1) ont &#233;t&#233; appliqu&#233;es et ont permis d&#8217;induire 9 085 relations s&#233;mantiques &#233;l&#233;mentaires
parmi lesquelles 3 031 relations de synonymie, 5 095 relations is-a et 1 540 part-of. L&#8217;in-
clusion lexicale produit 1 074 relations. Parmi les 3 031 relations de synonymie, 18 % (n=540)
sont d&#233;j&#224; pr&#233;sents dans la terminologie Gene Ontology. Les relations qui restent (n=2 491) cor-
respondent &#224; des relations &#171; nouvelles &#187;. Les 3 031 relations de synonymes &#233;l&#233;mentaires ont
&#233;t&#233; group&#233;es en 1 019 composantes connexes (CC), qui sont des ensembles de synonymes li&#233;s
entre eux (fig. 2). Sur cette figure, nous pouvons observer une clique, o&#249; tous les noeuds sont
reli&#233;s entre eux (fig. 2(a)), et une composante connexe (fig. 2(b)). Les arr&#234;tes sont libell&#233;es par
le type de la relation SY N et par la productivit&#233;.
</p>
<p>3.2 Profilage des relations s&#233;mantiques
</p>
<p>Pour le profilage des relations de synonymie, nous utilisons les indicateurs pr&#233;sent&#233;s dans la
section 2.2 : relations &#233;l&#233;mentaires is-a et part-of, inclusions lexicales, productivit&#233; des
relations de synonymie et la densit&#233; des composantes connexes. Nous allons appliquer ces in-
dicateurs afin de d&#233;crire et profiler les composantes connexes et les relations de synonymie.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Hamon et Natalia Grabar
</p>
<p>(a) Clique de synonymes (b) Composante connexe de synonymes
</p>
<p>FIG. 2 &#8211; Composantes connexes form&#233;es de relations &#233;l&#233;mentaires de synonymie.
</p>
<p>La figure 2(a) contient trois synonymes &#233;l&#233;mentaires (cleavage system, cleavage complex, et
synthase complex) inf&#233;r&#233;s &#224; partir du concept GO :0004375. Cette composante contient trois
synonymes qui sont tous reli&#233;s entre eux : il s&#8217;agit d&#8217;une clique. La densit&#233; de cette composante
connexe est &#233;gale &#224; 1. Des relations aussi denses entre les synonymes montrent que la force est
grande dans cette famille. Par ailleurs, les relations de synonymie sont acquises &#224; partir d&#8217;une
paire de synonymes originaux de GO : la productivit&#233; est &#233;gale &#224; 1. La combinaison de ces
indicateurs, et surtout la forme de clique, montrent que ces relations de synonymie sont plut&#244;t
fiables.
</p>
<p>En ce qui concerne la composante connexe pr&#233;sent&#233;e en 2(b), elle reproduit en grande par-
tie le sch&#233;ma du graphe 2(a). Elle se compose de quatre paires de synonymes &#233;l&#233;mentaires :
{acid degradation, acid breakdown}, {acid degradation, acid catabolism}, {acid breakdown,
acid catabolism} et {acid catabolism, acid catabolic process}. Les trois premi&#232;res relations de
synonymie forment une clique : la densit&#233; est maximale et la productivit&#233; est assez &#233;lev&#233;e (9
paires de synonymes originaux). Par contre, la paire de synonymes {acid catabolism, acid cata-
bolic process} reste &#224; part. Elle est acquise &#224; partir de quatre paires de synonymes (notamment,
glutamic acid catabolism et fatty acid catabolism), ce qui correspond &#224; une productivit&#233; &#233;gale-
ment assez &#233;lev&#233;e. Comme cette relation reste assez excentr&#233;e dans la composante connexe de
la figure 2(b) et comme sa productivit&#233; est moins &#233;lev&#233;e que celle des autres relations, elle peut
&#234;tre consid&#233;r&#233;e comme le point faible de cette composante connexe.
</p>
<p>Le graphe de la figure 3 montre la coocurrence de la synonymie avec d&#8217;autres relations s&#233;man-
tiques : INCL marque la relation hi&#233;rarchique induite avec l&#8217;inclusion lexicale, HIER marque
la relation is-a induite par la composition, PAR marque la relation part-of induite par la
composition. Ainsi, les paires de synonymes &#233;l&#233;mentaires {genome, chromosome} et {DNA,
chromosome} sont induites &#224; partir des relations de synonymie et de m&#233;ronymie. Quant &#224; la
paire {chromosome, interphrase chromosome}, elle est induite &#224; partir des relations de syno-
nymie et d&#8217;hyp&#233;ronymie mais &#233;galement calcul&#233;e au travers de l&#8217;inclusion lexicale. Il s&#8217;agit
donc d&#8217;une relation hi&#233;rarchique potentielle. Avec l&#8217;analyse de la forme de cette composante
connexe, nous remarquons qu&#8217;elle a la forme d&#8217;une &#233;toile, ce qui correspond &#224; une structure
beaucoup moins fiable qu&#8217;une clique (comme sur la figure 2(a)). Au sein de cette composante
connexe, nous pouvons identifier trois zones avec DNA comme pivot :
</p>
<p>1. composants de la cellule : chromosome, interphase chromosome, genome ;
</p>
<p>2. processus biologiques : P-element, cut-and-paste ;
</p>
<p>3. une relation de synonymie {DNA, polydeoxyribonucleotide}.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Profilage s&#233;mantique endog&#232;ne des relations de synonymie
</p>
<p>FIG. 3 &#8211; Relations &#233;l&#233;mentaires de synonymie qui cooccurrent avec d&#8217;autres types de relations.
</p>
<p>Les deux premi&#232;res zones forment des cliques : la zone 1 est une clique et la zone 2 contient
une clique. La zone 3 est &#233;galement une clique mais minimale (avec deux noeuds seulement).
L&#8217;&#233;tude de l&#8217;occurrence des indicateurs avec les relations de synonymie nous aide &#224; mieux ap-
pr&#233;hender la nature des relations au sein de cette composante connexe, ou m&#234;me au sein de ses
cliques, et &#224; les profiler. Regardons de plus pr&#232;s la zone 1 compos&#233;e de chromosome, interphase
chromosome, genome et DNA. Comme nous l&#8217;avons not&#233;, les relations {DNA, chromosome} et
{genome, chromosome} sont &#233;galement induites &#224; partir des relations de m&#233;ronymie et leur s&#233;-
mantique est donc ambigu&#235;, bien qu&#8217;elles fassent partie d&#8217;une clique. Quant &#224; la relation {chro-
mosome, interphase chromosome}, qui est excentr&#233;e dans cette zone, elle est ambigu&#235; avec la
relation d&#8217;hyperonymie au travers de deux indicateurs (inclusion lexicale et relation is-a &#233;l&#233;-
mentaire). La zone 1 de cette composante connexe montre donc des points de faiblesse malgr&#233;
le fait qu&#8217;elle comporte une clique. Nous pouvons donc voir que l&#8217;analyse d&#8217;une composante
connexe devrait combiner les indicateurs s&#233;mantiques, la productivit&#233; des relations et la forme
de cette composante. Ceci permet de d&#233;tecter des zones plus fortement connexes que d&#8217;autres
et &#233;ventuellement conduire &#224; un partitionement du graphe afin de former des sous-graphes s&#233;-
mantiquement plus coh&#233;rents et fiables.
</p>
<p>&#201;tant donn&#233; ces consid&#233;rations, sur la figure 4 nous pouvons distinguer deux zones fortement
connexes : (1) regulation, control, modulation, regulator ; (2) cell cycle control, cell cycle re-
gulation, cell cycle regulator, cell cycle modulation. Ces deux zones peuvent justement cor-
respondre aux partitions principales de la composante connexe. De plus, l&#8217;exploitation de la</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Hamon et Natalia Grabar
</p>
<p>FIG. 4 &#8211; Identification de zones fortement et exploitation de la pond&#233;ration des ar&#234;tes.
</p>
<p>productivit&#233; des relations &#233;l&#233;mentaires au sein de la zone 1, qui est assez importante (entre 5 et
6), permet de conforter cette hypoth&#232;se. Le profilage des relations &#233;l&#233;mentaires de synonymie
selon cette m&#233;thodologie permet donc de renforcer les relations au sein de la zone 1, de les
renforcer un peu au sein de la zone 2, et d&#8217;affaiblir la validit&#233; de la relation {cell cycle control,
regulation}. Notons que nous n&#8217;avons pas analys&#233; la zone compos&#233;e des noeuds regulation,
homeostasis et ion homeostasis.
</p>
<p>Une &#233;valuation manuelle des relations &#233;l&#233;mentaires de synonymie a &#233;t&#233; effectu&#233;e par un infor-
maticien avec, pour crit&#232;re principal, le contexte original d&#8217;apparition des synonymes &#233;l&#233;men-
taires. Cette &#233;valuation a montr&#233; une pr&#233;cision de 93,1 %, avec 5,4 % de relations rejet&#233;es et
1,5 % relations toujours sous question. Il est clair que la perception de ces synonymes ne sera
pas la m&#234;me lorsque la validation est effectu&#233;e par un expert du domaine de biologie. Nous pen-
sons que l&#8217;&#233;valuation actuelle des relations de synonymie montre un profilage beaucoup plus
fin et fournit des indicateurs de validit&#233; plus fiables &#224; pr&#233;senter &#224; un expert du domaine. De
m&#234;me, lorsque ces indicateurs sont formalis&#233;s et chiffr&#233;s, ils peuvent &#234;tre utilis&#233;s par des outils
automatiques.
</p>
<p>4 Conclusion and Perspectives
</p>
<p>Nous avons propos&#233; une m&#233;thode pour l&#8217;inf&#233;rence de relations de synonymie &#233;l&#233;mentaires &#224;
partir de terminologies structur&#233;es et pour leur profilage en vue d&#8217;une pond&#233;ration. La m&#233;thode
exploite la compositionnalit&#233; et les d&#233;pendances syntaxiques des termes complexes. Les indi-
cateurs de profilage sont g&#233;n&#233;r&#233;s automatiquement et de mani&#232;re endog&#232;ne &#224; partir de la m&#234;me
terminologie. Le travail a &#233;t&#233; effectu&#233; sur les termes de Gene Ontology, mais peut &#234;tre appliqu&#233;
&#224; d&#8217;autres terminologies structur&#233;es et d&#8217;autres domaines.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Profilage s&#233;mantique endog&#232;ne des relations de synonymie
</p>
<p>Si les relations et les indicateurs sont g&#233;n&#233;r&#233;s automatiquement, le profilage est fait actuellement
de mani&#232;re empirique : il ne correspond pas &#224; une pond&#233;ration mais plut&#244;t &#224; une d&#233;cription. Il
sera ainsi int&#233;ressant de mod&#233;liser cette m&#233;thodologie et de l&#8217;impl&#233;menter pour la pond&#233;ration
des relations de synonymie. Le calcul de la pond&#233;ration ou de la probabilit&#233; que l&#8217;on pourra
associer ainsi &#224; une relation de synonymie peut par exemple &#234;tre effectu&#233;e avec une approche
par r&#233;seaux bayesiens (Spirtes et al., 1993; Pourret et al., 2008). Cette perspective demande une
collaboration &#233;troite entre les chercheurs en informatique et en biologie. Ainsi, lorsque, au sein
d&#8217;une composante connexe, certaines arr&#234;tes montrent un poids faible, ces arr&#234;tes peuvent &#234;tre
supprim&#233;es et le graphe d&#233;compos&#233; en sous-graphes plus petits et possiblement plus fiables.
Dans le travail pr&#233;sent&#233; ici, nous avons vis&#233; la pond&#233;ration des relations de synonymie par les
indicateurs de fiabilit&#233;. Notons que le m&#234;me travail peut &#234;tre effectu&#233; vis-&#224;-vis d&#8217;autres types de
relations (par exemple, profilage des relations hi&#233;rarchiques par les indicateurs de fiabilit&#233;). De
cette mani&#232;re, une validation mutuelle des relations s&#233;mantiques pourrait &#234;tre obtenue.
</p>
<p>Les relations inf&#233;r&#233;es pourront &#234;tre g&#233;n&#233;ralis&#233;es au travers des corpus et servir &#224; l&#8217;enrichisse-
ment et adaptation d&#8217;une terminologie (Hamon et al., 1998; Hole &amp; Srinivasan, 2000). Du point
de vue d&#8217;une perspective ontologique, cette m&#233;thode est un pas vers la v&#233;rification de la consis-
tance d&#8217;une terminologie (Mungall, 2004). Elle peut aussi &#234;tre utilis&#233;e pour la transformation
d&#8217;une terminologie pr&#233;-coordonn&#233;e en une terminologie post-coordonn&#233;e.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BODENREIDER O., BURGUN A. &amp; MITCHELL J. A. (2003). Evaluation of WordNet as a
source of lay knowledge for molecular biology and genetic diseases : a feasibility study. In
Medical Informatics in Europe (MIE), p. 379&#8211;384.
</p>
<p>BODENREIDER O., BURGUN A. &amp; RINDFLESCH T. C. (2001). Lexically-suggested hypo-
nymic relations among medical terms and their representation in the UMLS. In URI INIST
CNRS, Ed., Terminologie et Intelligence artificielle (TIA), p. 11&#8211;21, Nancy.
</p>
<p>BURNAGE G. (1990). CELEX - A Guide for Users. University of Nijmegen : Centre for
Lexical Information.
</p>
<p>C&#212;T&#201; R. A., BROCHU L. &amp; CABANA L. (1997). SNOMED Internationale &#8211; R&#233;pertoire
d&#8217;anatomie pathologique. Secr&#233;tariat francophone international de nomenclature m&#233;dicale,
Sherbrooke, Qu&#233;bec.
</p>
<p>CRUSE D. A. (1986). Lexical Semantics. Cambridge : Cambridge University Press.
</p>
<p>FELLBAUM C. (1998). A semantic network of english : the mother of all WordNets. Compu-
ters and Humanities. EuroWordNet : a multilingual database with lexical semantic network,
32(2-3), 209&#8211;220.
GENE ONTOLOGY CONSORTIUM (2001). Creating the Gene Ontology resource : design and
implementation. Genome Research, 11, 1425&#8211;1433.
HAMON T. &amp; GRABAR N. (2008). How can the term compositionality be useful for acquiring
elementary semantic relations ? In B. NORDSTROM &amp; A. RANTA, Eds.,GoTAL, number 5221
in LNAI, p. 809&#8211;814, Gothenburg, Sweden : Springer.
</p>
<p>HAMON T. &amp; NAZARENKO A. (2001). Detection of synonymy links between terms : ex-
periment and results. In Recent Advances in Computational Terminology, p. 185&#8211;208. John
Benjamins.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Hamon et Natalia Grabar
</p>
<p>HAMON T., NAZARENKO A. &amp; GROS C. (1998). A step towards the detection of semantic
variants of terms in technical documents. In International Conference on Computational Lin-
guistics (COLING-ACL&#8217;98), p. 498&#8211;504, Universit&#233; de Montr&#233;al, Montr&#233;al, Quebec, Canada.
</p>
<p>HATHOUT N., NAMER F. &amp; DAL G. (2001). An experimental constructional database : the
MorTAL project. In P. BOUCHER, Ed.,Morphology book. Cambridge, MA : Cascadilla Press.
</p>
<p>HOLE W. &amp; SRINIVASAN S. (2000). Discovering missed synonymy in a large concept-
oriented metathesaurus. In AMIA 2000, p. 354&#8211;8.
</p>
<p>KLEIBER G. &amp; TAMBA I. (1990). L&#8217;hyperonymie revisit&#233;e : inclusion et hi&#233;rarchie. Langages,
98, 7&#8211;32.
MUNGALL C. (2004). Obol : integrating language and meaning in bio-ontologies. Compara-
tive and Functional Genomics, 5(6-7), 509&#8211;520.
NLM (2001). Medical Subject Headings. National Library of Medicine, Bethesda, Maryland.
http://www.nlm.nih.gov/mesh/meshhome.html.
</p>
<p>NLM (2007). UMLS Knowledge Sources Manual. National Library of Medicine, Bethesda,
Maryland. www.nlm.nih.gov/research/umls/.
</p>
<p>OGREN P., COHEN K. &amp; HUNTER L. (2005). Implications of compositionality in the Gene
Ontology for its curation and usage. In Pacific Symposium of Biocomputing, p. 174&#8211;185.
</p>
<p>PARTEE B. H. (1984). Compositionality, In Varieties of formal semantics. F Landman and F
Veltman.
</p>
<p>POPRAT M., BEISSWANGER E. &amp; HAHN U. (2008). Building a biowordnet using wordnet
data structures and wordnet&#8217;s software infrastructure - a failure story. In ACL 2008 workshop
&quot;Software Engineering, Testing, and Quality Assurance for Natural Language Processing&quot;, p.
31&#8211;9.
</p>
<p>POURRET O., NAIM P. &amp; MARCOT B. (2008). Bayesian Networks : A Practical Guide to
Applications. Chichester, UK : Wiley.
</p>
<p>SCHMID H. (1994). Probabilistic part-of-speech tagging using decision trees. In Proceedings
of the International Conference on NewMethods in Language Processing, p. 44&#8211;49, Manches-
ter, UK.
</p>
<p>SCHULZ S., ROMACKER M., FRANZ P., ZAISS A., KLAR R. &amp; HAHN U. (1999). Towards
a multilingual morpheme thesaurus for medical free-text retrieval. In Medical Informatics in
Europe (MIE).
</p>
<p>SMITH B. &amp; FELLBAUM C. (2004). Medical wordnet : a new methodology for the construc-
tion and validation of information. In Proc of 20th CoLing, p. 371&#8211;382, Geneva, Switzerland.
</p>
<p>SPIRTES P., GLYMOUR C. &amp; SCHEINES R. (1993). Causation, Prediction, and Search. New
York : Springer-Verlag.
</p>
<p>VERSPOOR C. M., JOSLYN C. &amp; PAPCUN G. J. (2003). The gene ontology as a source of
lexical semantic knowledge for a biological natural language processing application. In SIGIR
workshop on Text Analysis and Search for Bioinformatics, p. 51&#8211;56.
</p>
<p>ZWEIGENBAUM P., BAUD R., BURGUN A., NAMER F., JARROUSSE E., GRABAR N., RUCH
P., DUFF F. L., THIRION B. &amp; DARMONI S. (2003). Towards a Unified Medical Lexicon for
French. In Medical Informatics in Europe (MIE).</p>

</div></div>
</body></html>