<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Recto /Verso Un syst&#232;me de conversion automatique ancienne / nouvelle orthographe &#224; vis&#233;e linguistique et didactique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Recto / Verso
Un syst&#232;me de conversion automatique ancienne / nouvelle
</p>
<p>orthographe &#224; vis&#233;e linguistique et didactique
</p>
<p>Richard Beaufort Anne Dister Hubert Naets K&#233;vin Mac&#233;
C&#233;drick Fairon
</p>
<p>CENTAL / Universit&#233; Catholique de Louvain, 1 Place Blaise Pascal, B-1348
Louvain-la-Neuve, Belgique
</p>
<p>{richard.beaufort, anne.dister, hubert.naets, kevin.mace,
cedrick.fairon}@uclouvain.be
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente Recto / Verso, un syst&#232;me de traitement automatique du lan-
gage d&#233;di&#233; &#224; l&#8217;application des rectifications orthographiques de 1990. Ce syst&#232;me a &#233;t&#233; d&#233;ve-
lopp&#233; dans le cadre de la campagne de sensibilisation r&#233;alis&#233;e en mars dernier par le Service et
le Conseil de la langue fran&#231;aise et de la politique linguistique de la Communaut&#233; fran&#231;aise de
Belgique. Nous commen&#231;ons par rappeler les motivations et le contenu de la r&#233;forme propos&#233;e,
et faisons le point sur les principes didactiques retenus dans le cadre de la campagne. La plus
grande partie de l&#8217;article est ensuite consacr&#233;e &#224; l&#8217;impl&#233;mentation du syst&#232;me. Nous terminons
enfin par une premi&#232;re analyse de l&#8217;impact de la campagne sur les utilisateurs.
</p>
<p>Abstract. This paper presents Recto / Verso, a natural language processing system dedi-
cated to the application of the 1990 French spelling rectifications. This system was developed
for supporting the awareness-raising campaign promoted last March by the Superior council of
the French language in Belgium. We first remind the motivations and the content of the reform,
and we draw up the didactic principles followed during the campaign. The most important part
of this paper is then focused on the system&#8217;s implementation. We finally end by a short analysis
of the campaign&#8217;s impact on the users.
</p>
<p>Mots-cl&#233;s : Rectifications orthographiques de 1990, conversion ancienne / nouvelle or-
thographe, objectifs didactiques, machines &#224; &#233;tats finis.
</p>
<p>Keywords: 1990 French spelling rectifications, ancient / new spelling conversion, di-
dactic purposes, finite-state machines.
</p>
<p>1 Introduction
</p>
<p>En 1990, le Conseil sup&#233;rieur de la langue fran&#231;aise, pr&#233;sid&#233; par Michel Rocard, et r&#233;unissant
des personnalit&#233;s et des experts fran&#231;ais, belge et qu&#233;b&#233;cois, proposait un ensemble de recti-
fications orthographiques, connues sous le nom de &#171; nouvelle orthographe &#187; (Goosse, 1991),
et approuv&#233;es par toutes les instances francophones comp&#233;tentes en mati&#232;re de langue (en ce
compris l&#8217;Acad&#233;mie fran&#231;aise). Ces modifications, propos&#233;es aux usagers sans leur &#234;tre impo-
s&#233;es, entrent peu &#224; peu dans l&#8217;usage, mais sans que leur emploi ne soit syst&#233;matique. Ainsi,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R. Beaufort, A. Dister, H. Naets, K. Mac&#233;, C. Fairon
</p>
<p>on constate que ces nouvelles graphies, bien qu&#8217;int&#233;gr&#233;es dans les correcteurs orthographiques
actuels (Fontenelle, 2006) et pr&#233;conis&#233;es dans l&#8217;enseignement, sont encore parfois sanction-
n&#233;es chez les &#233;l&#232;ves, tant en France qu&#8217;en Belgique. Fort de ce constat, le Conseil de la langue
fran&#231;aise et de la politique linguistique de la Communaut&#233; fran&#231;aise de Belgique a r&#233;alis&#233; en
mars dernier une vaste campagne de promotion des rectifications aupr&#232;s des usagers, action de
sensibilisation &#224; laquelle la presse francophone belge a particip&#233; en &#171; passant &#224; la nouvelle or-
thographe &#187; pour la version en ligne des quotidiens. Ce &#171; passage &#187; a &#233;t&#233; rendu possible gr&#226;ce au
d&#233;veloppement d&#8217;un syst&#232;me de traitement automatique du langage sp&#233;cialement d&#233;di&#233; &#224; cette
t&#226;che : Recto / Verso. C&#8217;est ce syst&#232;me que nous pr&#233;sentons ici.
</p>
<p>2 La campagne de sensibilisation
</p>
<p>En Communaut&#233; fran&#231;aise de Belgique, un d&#233;pliant reprenant &#171; 7 r&#232;gles pour nous simplifier
l&#8217;orthographe &#187; a &#233;t&#233; diffus&#233; &#224; 300 000 exemplaires, conjointement &#224; la publication en octobre
2008 de quatre circulaires minist&#233;rielles officialisant le choix de la &#171; nouvelle orthographe &#187;
pour l&#8217;enseignement du fran&#231;ais en Belgique.
</p>
<p>S&#8217;en est suivie une vaste campagne de sensibilisation au travers de la presse en ligne : quatre
des plus grands groupes de la presse francophone belge (soit un peu plus de 90 % de la presse
en ligne) ont fait le pas de passer &#224; la nouvelle orthographe.1
</p>
<p>Cette campagne a &#233;t&#233; men&#233;e durant la &#171; Semaine de la langue &#187; de mars 2009. Les &#233;ditions &#233;lec-
troniques des journaux ont alors &#233;t&#233; propos&#233;es au lecteur dans deux versions : en orthographe
&#171; standard &#187;, comme d&#8217;habitude, et en orthographe rectifi&#233;e. Dans le principe, un bouton nomm&#233;
&#171; RECTO/VERSO &#187; (RECTifications Orthographiques / VERSion Originale) permettait de bas-
culer d&#8217;une version &#224; l&#8217;autre.
</p>
<p>Cette action poursuivait deux objectifs compl&#233;mentaires. Premi&#232;rement, elle voulait sensibi-
liser les grands &#233;diteurs &#224; la question de la nouvelle orthographe, parce qu&#8217;il est aujourd&#8217;hui
&#233;vident que la nouvelle orthographe ne pourra se diffuser dans le public que si les grands &#233;di-
teurs l&#8217;adoptent au pr&#233;alable. Le passage temporaire de la presse &#224; la nouvelle orthographe, dans
le cadre de la campagne, est certainement un signe encourageant dans ce sens.
Deuxi&#232;mement, la campagne avait une dimension p&#233;dagogique. L&#8217;id&#233;e &#233;tait d&#8217;une part de per-
mettre au public de d&#233;couvrir la nouvelle orthographe au travers de cas concrets dans des articles
r&#233;els, et d&#8217;autre part de guider cette d&#233;couverte, au travers de notes explicatives pr&#233;sentant les
rectifications introduites dans le texte.
</p>
<p>Les versions en ligne des quotidiens se pr&#233;sentent classiquement sous la forme de pages HTML.
Dans le cadre de la campagne, nous devions donc g&#233;n&#233;rer des pages HTML en orthographe
rectifi&#233;e au d&#233;part de textes en orthographe traditionnelle.
</p>
<p>2.1 Les contraintes p&#233;dagogiques
</p>
<p>Afin de donner une dimension p&#233;dagogique aux pages en nouvelle orthographe, il fallait que
les formes rectifi&#233;es soient mises en &#233;vidence par rapport au reste du texte de la page, et soient
expliqu&#233;es &#224; l&#8217;utilisateur.
</p>
<p>1Voir www.lesoir.be ; www.lalibre.be ; www.dhnet.be ; www.sudpresse.be</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recto / Verso
</p>
<p>Des formes rectifi&#233;es visibles. Nous avons d&#233;cid&#233; d&#8217;utiliser des couleurs, r&#233;parties en deux ni-
veaux compl&#233;mentaires : d&#8217;une part, une couleur pour l&#8217;ensemble du mot concern&#233;, de mani&#232;re
&#224; faciliter sa localisation dans la page, et d&#8217;autre part, une couleur pour la partie du mot touch&#233;e
par la rectification, de mani&#232;re &#224; acc&#233;l&#233;rer l&#8217;identification visuelle des modifications r&#233;alis&#233;es.
Pour ce faire, nous avons utilis&#233; une feuille de style CSS, qui autorise entre autres l&#8217;utilisa-
tion de balises &lt;span&gt; pour formater un texte. Nous avons donc d&#233;fini deux niveaux de balises
&lt;span&gt; : le premier, &quot;recto..&quot;, correspond au mot rectifi&#233; dans sa globalit&#233; et indique si la
forme a &#233;t&#233; modifi&#233;e (&quot;recto&quot;) ou est une exception (&quot;recto_ex&quot;) ; le second, &quot;rule..&quot;, en-
toure la partie du mot concern&#233;e par une r&#232;gle, et indique par un chiffre de 1 &#224; 9 le num&#233;ro de
la r&#232;gle concern&#233;e. Par exemple, la phrase
</p>
<p>le b&#251;cher est l&#224; (1)
</p>
<p>deviendra, apr&#232;s rectification,
</p>
<p>le &lt;span class=&quot;recto&quot;&gt;b&lt;span class=&quot;rule4&quot;&gt;u&lt;/span&gt;cher&lt;/span&gt; est l&#224; (2)
</p>
<p>o&#249; &quot;recto&quot; et &quot;rule4&quot; indiquent conjointement que la r&#232;gle relative &#224; la suppression de l&#8217;ac-
cent circonflexe sur i et u a bien &#233;t&#233; appliqu&#233;e. Le CSS d&#233;finit la couleur &#224; appliquer pour chaque
classe &quot;recto..&quot; et pour chaque classe &quot;rule..&quot;. En l&#8217;occurrence, nous avons d&#233;cid&#233; d&#8217;uti-
liser l&#8217;orange fonc&#233; pour &quot;recto&quot;, le vert pour &quot;recto_ex&quot; et le bleu pour toutes les classes
&quot;rule..&quot;, afin de ne pas entrainer de surcharge cognitive.
</p>
<p>Des rectifications expliqu&#233;es. Apr&#232;s analyse, et afin de modifier le moins possible l&#8217;apparence
de la page rectifi&#233;e, nous avons d&#233;cid&#233; d&#8217;opter pour l&#8217;affichage d&#8217;infobulles, n&#8217;apparaissant que
lorsque l&#8217;utilisateur passe la souris sur une rectification donn&#233;e.
Pour ce faire, nous avons exploit&#233; la pr&#233;sence des balises &lt;span&gt; &#224; l&#8217;aide de la librairie JavaS-
cript jQuery.2 Le fonctionnement de jQuery tient dans la d&#233;finition de la fonction JavaScript
&quot;ready()&quot; qui ex&#233;cute au chargement de la page les instructions qui y sont contenues. Dans le
cas pr&#233;sent, il y est d&#233;crit que lorsque le curseur de la souris passe au-dessus de l&#8217;une des balises
ajout&#233;es, une infobulle doit s&#8217;afficher avec un texte. Ce texte, qui diff&#232;re selon la combinaison
&quot;recto..&quot; / &quot;rule..&quot; rencontr&#233;e, est conserv&#233; dans un tableau JavaScript, ce qui permet de
dissocier le comportement des infobulles de leur contenu.
</p>
<p>2.2 Un service accessible en ligne
</p>
<p>Afin de faciliter l&#8217;acc&#232;s au syst&#232;me par les journaux en ligne et dans le but de simplifier les
op&#233;rations de mise &#224; jour, Recto / Verso a &#233;t&#233; con&#231;u sous la forme d&#8217;un service web de type
SOAP. Les quotidiens en ligne ont pu transmettre ainsi leurs articles &#224; un serveur distant, &#224;
l&#8217;aide d&#8217;une API tr&#232;s simple, et recevoir en retour ces m&#234;mes textes rectifi&#233;s et ponctu&#233;s des
balises indiquant l&#8217;emplacement et la nature des rectifications.
</p>
<p>Les articles de presse n&#8217;ont toutefois pas &#233;t&#233; les seuls textes concern&#233;s par la campagne, puis-
qu&#8217;une interface web accessible au grand public a &#233;galement &#233;t&#233; mise en place. Acc&#233;dant elle
aussi au service web, elle a permis &#224; chacun d&#8217;employer le syst&#232;me de rectifications.
</p>
<p>Du c&#244;t&#233; serveur, l&#8217;architecture reste simple : le service web re&#231;oit le texte &#224; rectifier ; il y ap-
plique une s&#233;rie de pr&#233;traitements visant &#224; normaliser l&#8217;encodage du document ; le texte est
ensuite transmis au moteur de rectifications, et, une fois trait&#233;, renvoy&#233; au client par le service
web.
</p>
<p>2Voir http://jquery.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R. Beaufort, A. Dister, H. Naets, K. Mac&#233;, C. Fairon
</p>
<p>3 Impl&#233;mentation
</p>
<p>3.1 Outils utilis&#233;s
</p>
<p>L&#8217;ensemble des traitements linguistiques d&#233;crits dans cet article ont &#233;t&#233; implement&#233;s sous la
forme de machines &#224; &#233;tats finis. Selon les besoins, il s&#8217;agit d&#8217;automates ou de transducteurs,
pond&#233;r&#233;s ou non (Mohri, 1996; Roche &amp; Schabes, 1997).
</p>
<p>Nous avons utilis&#233; la biblioth&#232;que de machines &#224; &#233;tats finis et le compilateur pr&#233;sent&#233;s dans
(Beaufort, 2008). La biblioth&#232;que propose la plupart des algorithmes standard de la litt&#233;rature
dans leur version pond&#233;r&#233;e. Elle autorise la cr&#233;ation et la sauvegarde de machines dynamiques
(construites au vol), et permet la sauvegarde et le chargement de machines binaires (compl&#232;te-
ment pr&#233;calcul&#233;es), plus compactes et plus rapides &#224; charger. Le compilateur, d&#233;velopp&#233; autour
de la biblioth&#232;que, convertit en machines &#224; &#233;tas finis des r&#232;gles de r&#233;&#233;criture pond&#233;r&#233;es, des lan-
gages r&#233;guliers, des dictionnaires et des n-grammes. Les r&#232;gles de r&#233;&#233;criture autoris&#233;es prennent
la forme g&#233;n&#233;rale
</p>
<p>&#981;&#8594; &#968; : : &#955; _ &#961; / &#969; (3)
o&#249; &#981;, lorsqu&#8217;il est entour&#233; par &#955; et &#961;, se r&#233;&#233;crit &#968; et se voit attribuer le poids &#969;. Dans cette
formulation, &#981;, &#968;, &#955; et &#961; sont des expressions r&#233;guli&#232;res (McNaughton &amp; Yamada, 1960) et &#969;
est d&#233;fini sur le semi-anneau tropical (Kuich &amp; Salomaa, 1986). Dans tous les cas, le r&#233;sultat de
la compilation est une machine &#224; &#233;tats finis au format binaire de la biblioth&#232;que.
</p>
<p>3.2 Architecture g&#233;n&#233;rale du syst&#232;me
</p>
<p>Les r&#233;flexions pr&#233;liminaires au d&#233;veloppement de Recto / Verso ont &#233;t&#233; les suivantes :
</p>
<p>1. Certaines r&#232;gles de la r&#233;forme ne sont pas purement lexicales. C&#8217;est le cas, par exemple,
du pluriel des noms compos&#233;s ou de l&#8217;accord du participe pass&#233; laiss&#233; devant infinitif.
Recto / Verso devait donc inclure un moteur d&#8217;analyse linguistique.
</p>
<p>2. Dans le cadre de la campagne de sensibilisation, Recto / Verso devait traiter des pages
HTML et donc &#234;tre capable de masquer les &#233;l&#233;ments non linguistiques le temps du traite-
ment, et de les r&#233;introduire ensuite dans la version r&#233;form&#233;e, afin de respecter l&#8217;affichage
pr&#233;vu par le cr&#233;ateur de la page.
</p>
<p>Sur la base de ces consid&#233;rations, Recto / Verso a &#233;t&#233; pourvu des modules suivants :
</p>
<p>1. Un module de pr&#233;traitement HTML, qui cache le contenu non linguistique du texte &#224;
traiter ;
</p>
<p>2. Un module de d&#233;sambig&#252;isation linguistique, qui analyse le contenu linguistique du texte ;
</p>
<p>3. Un module de conversion, qui applique la r&#233;forme sur le r&#233;sultat de l&#8217;analyse ;
</p>
<p>4. Un module de post-traitement HTML, qui r&#233;ins&#232;re les &#233;l&#233;ments non linguistiques dans le
texte r&#233;form&#233;.
</p>
<p>Nous commen&#231;ons en 3.3 par d&#233;crire le moteur d&#8217;analyse linguistique, qui constitue le c&#339;ur
du syst&#232;me. Nous d&#233;taillons ensuite en 3.4 les modules de pr&#233;- et post-traitement HTML, qui
travaillent de pair. Ces modules font toute l&#8217;originalit&#233; et la robustesse de l&#8217;application. Nous
terminons enfin en 3.5 par le module de conversion, qui est la raison d&#8217;&#234;tre de Recto / Verso.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recto / Verso
</p>
<p>3.3 Le module de d&#233;sambig&#252;isation linguistique
</p>
<p>Ce module est fortement inspir&#233; de (Beaufort, 2008), auquel nous renvoyons le lecteur pour une
description d&#233;taill&#233;e. Dans ce syst&#232;me, la phase de d&#233;sambig&#252;isation linguistique se limite &#224; la
suite d&#8217;&#233;tapes n&#233;cessaires &#224; segmenter un texte en unit&#233;s de sens (dates, t&#233;l&#233;phones, URLs, . . .,
nombres, formes lexicales), et &#224; attribuer &#224; chaque unit&#233; et &#224; chacune de ses parties une et une
seule analyse morphologique possible : cat&#233;gorie, genre, nombre et personne. Aucune structure
syntaxique n&#8217;est construite, et aucune analyse s&#233;mantique n&#8217;est entreprise. Le syst&#232;me est or-
ganis&#233; en trois couches : un pr&#233;traitement, une analyse morphologique et une d&#233;sambig&#252;isation
syntaxique.
</p>
<p>1. Le pr&#233;traitement est r&#233;alis&#233; par un transducteur Pre obtenu par compilation de r&#232;gles
de r&#233;&#233;criture qui d&#233;crivent les unit&#233;s de sens &#224; d&#233;tecter. En cours de processus, un texte
W est donc compos&#233; avec le transducteur Pre, ce qui produit un transducteur W &#8242;, dont
l&#8217;entr&#233;e contient le texte et la sortie contient uniquement les unit&#233;s d&#233;tect&#233;es, chaque
unit&#233; &#233;tant syst&#233;matiquement situ&#233;e en face du premier caract&#232;re qui lui appartient. La
figure 3.3 en donne une illustration. A partir de ce r&#233;sultat et en appliquant l&#8217;algorithme
de segmentation de machines &#224; &#233;tats finis propos&#233; par (Beaufort, 2008), W &#8242; est segment&#233;
en un vecteur de machines &#224; &#233;tats finis VW &#8242; , o&#249; chaque machine correspond &#224; une seule
unit&#233;. Ce sont les machines m&#233;moris&#233;es dans ce vecteur qui subiront les &#233;tapes suivantes
du traitement.
</p>
<p>2. L&#8217;analyse morphologique repose principalement sur deux transducteurs pond&#233;r&#233;s. Le pre-
mier, d&#233;di&#233; aux formes connues, repr&#233;sente un simple lexique de formes fl&#233;chies. Le se-
cond, d&#233;di&#233; aux formes hors vocabulaire, permet de choisir les cat&#233;gories &#224; attribuer aux
formes en fonction de leur terminaison (il correspond &#224; l&#8217;expression r&#233;guli&#232;re &#171; .+ {suf} &#187;
o&#249; &#171; .+ &#187; est une suite non nulle de caract&#232;res, et &#171; {suf} &#187; est l&#8217;ensemble des suffixes
du fran&#231;ais, compl&#233;t&#233; de la chaine vide &#15;). Les deux transducteurs sont pond&#233;r&#233;s par des
mod&#232;les de mot distincts, de la forme &#8722; log p(wi|ti).
</p>
<p>3. L&#8217;analyse syntaxique, enfin, s&#8217;organise en deux niveaux. Le premier, repr&#233;sent&#233; sous la
forme d&#8217;un automate pond&#233;r&#233;, impl&#233;mente un n-gramme &#8722; log p(ti|ti&#8722;2, ti&#8722;1) liss&#233; par
interpolation lin&#233;aire (Beaufort et al., 2002). Le second est un transducteur qui regroupe
des suites de cat&#233;gories susceptibles de constituer des formes compos&#233;es de diff&#233;rents
types : mots compos&#233;s (e.g. nom, tiret, nom &#8594; nom), formes verbales compos&#233;es plus
ou moins complexes (e.g. auxiliaire, participe pass&#233;&#8594; verbe), etc. On retiendra que les
deux niveaux d&#8217;analyse sont conserv&#233;s dans des transducteurs distincts mais align&#233;s, de
mani&#232;re &#224; donner aux traitements suivants la possibilit&#233; d&#8217;un acc&#232;s &#224; une information
macro- ou micro-scopique.
</p>
<p>On notera que la composition de l&#8217;analyse morphologie et de l&#8217;analyse syntaxique permet la
reconstitution d&#8217;un mod&#232;le de langue complet sous la forme de Bayes :
</p>
<p>P (T |W ) = arg min
T
</p>
<p>&#8721;
i
</p>
<p>&#8722; log p(wi|ti) &#9702;
&#8721;
i
</p>
<p>&#8722; log p(ti|ti&#8722;2, ti&#8722;1) (4)
</p>
<p>Apr&#232;s d&#233;sambig&#252;isation, le texte se pr&#233;sente sous la forme de plusieurs machines &#224; &#233;tats finis
align&#233;es. Leur parcours en parall&#232;le permet de remplir une structure de donn&#233;es, que nous avons
baptis&#233;e OrthoML et qui pr&#233;sente les niveaux d&#8217;inclusion suivants :
</p>
<p>paragraphe&#8594; phrase&#8594; unit&#233; de sens&#8594; forme compos&#233;e&#8594; forme simple</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R. Beaufort, A. Dister, H. Naets, K. Mac&#233;, C. Fairon
</p>
<p>A:Alpha h:! !:Endpunct,:Punct s:!&quot; &quot;:! a:!u:Alpha &quot; &quot;:!n:!
</p>
<p>FIG. 1 &#8211; Application du pr&#233;traitement sur le texte &#171; Ah, un as ! &#187;
</p>
<p>3.4 Les modules de pr&#233;- et post-traitement HTML
</p>
<p>Une page HTML contient deux types d&#8217;&#233;l&#233;ments non linguistiques :
1. Des &#233;l&#233;ments structurants. Il s&#8217;agit exclusivement des balises HTML (ouvrantes et fer-
</p>
<p>mantes) permettant de d&#233;limiter des portions coh&#233;rentes de texte : une phrase (&lt;BR&gt;), un
paragraphe (&lt;P&gt;), une liste (&lt;UL, &lt;OL&gt;, &lt;LI&gt;) ou un titre (&lt;H1&gt;, &lt;H2&gt;, etc.). Dans
une page HTML, ces balises sont parfois le seul indice d&#8217;une ponctuation forte, absente
du texte lui-m&#234;me.
</p>
<p>2. Du bruit. Il s&#8217;agit de tout le reste. Dans ce reste, nous avons d&#233;cid&#233; de placer les balises
de formatage des polices (&lt;B&gt;, &lt;I&gt;, &lt;U&gt;, etc.), qui peuvent faire irruption n&#8217;importe o&#249;
dans le texte, que ce soit entre deux mots d&#8217;une m&#234;me phrase ou dans un mot lui-m&#234;me.
</p>
<p>Pour chaque type, nous avons construit un nouveau transducteur de pr&#233;traitement :
1. Tag, qui identifie les &#233;l&#233;ments structurants du texte et leur attribue une nouvelle unit&#233;, le
</p>
<p>Tag. Ce transducteur est obtenu et fonctionne de mani&#232;re similaire &#224; Pre.
2. Hid, qui identifie le bruit pr&#233;sent dans le texte et le cache &#224; l&#8217;analyse. Dans ce cas-ci,
</p>
<p>les r&#232;gles de r&#233;&#233;criture ne projettent plus les &#233;l&#233;ments d&#233;tect&#233;s sur une unit&#233;, mais sur la
chaine vide &#15;. Dans le r&#233;sultat de la compositionW &#9702;Hid, le bruit est pr&#233;sent sur l&#8217;entr&#233;e,
mais est absent de la sortie du transducteur.
</p>
<p>Id&#233;alement, nettoyer le texte, identifier les &#233;l&#233;ments structurants et d&#233;tecter les unit&#233;s classiques
devraient &#234;tre r&#233;alis&#233;s comme suit :
</p>
<p>W &#8242; = pi2(W &#9702;Hid) &#9702; Tag &#9702; Pre (5)
o&#249; pi2(&#183;) note la projection du langage de sortie de (&#183;).
Cependant, la projection fait disparaitre le bruit de la page, de mani&#232;re irr&#233;cup&#233;rable. Or, l&#8217;ob-
jectif est d&#8217;appliquer la r&#233;forme sur le texte, tout en conservant l&#8217;int&#233;gralit&#233; de la page d&#8217;origine.
Pour ce faire, nous avons proc&#233;d&#233; comme suit :
</p>
<p>1. Le pr&#233;traitement est r&#233;alis&#233; sans projection : W &#8242; = W &#9702;Hid &#9702; Tag &#9702; Pre.
2. Le r&#233;sultat du pr&#233;traitement est dupliqu&#233;, et la projection est appliqu&#233;e sur la copie uni-
</p>
<p>quement : W &#8242;pi = pi2(W
&#8242;).
</p>
<p>3. L&#8217;&#233;tape de segmentation du texte en unit&#233;s, sous la forme de machines &#224; &#233;tats finis conser-
v&#233;es dans un vecteur, est appliqu&#233;e aux deux versions, la bruit&#233;e et la projet&#233;e.
</p>
<p>4. La d&#233;sambig&#252;isation morphosyntaxique et l&#8217;application des rectifications orthographiques
sont r&#233;alis&#233;es sur le vecteur correspondant &#224; la version projet&#233;e, W &#8242;pi.
</p>
<p>5. A la fin du traitement, un alignement entre les deux versions du texte est r&#233;alis&#233;, de ma-
ni&#232;re &#224; contenir &#224; la fois la totalit&#233; de la page initiale, et les rectifications introduites dans
le texte. Dans le principe, cet alignement est obtenu comme suit entre les deux versions
du texte :
</p>
<p>W &#8242;&#8242; = Best(W &#8242; &#9702;W &#8242;pi) (6)
si ce n&#8217;est qu&#8217;il est r&#233;alis&#233; au niveau des deux vecteurs d&#8217;unit&#233;s :
</p>
<p>W &#8242;&#8242; = Best(VW &#8242; [1] &#9702; VW &#8242;pi [1]) &#183; . . . &#183;Best(VW &#8242; [n] &#9702; VW &#8242;pi [n]) (7)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recto / Verso
</p>
<p>3.5 Le module de conversion
</p>
<p>3.5.1 Description de l&#8217;algorithme
</p>
<p>L&#8217;algorithme consiste en un parcours r&#233;cursif des diff&#233;rentes couches de la structure de donn&#233;es
remplie par le module de d&#233;sambig&#252;isation. Toutes les op&#233;rations sont r&#233;alis&#233;es au travers de
machines &#224; &#233;tats finis, par composition avec des mod&#232;les pr&#233;compil&#233;s. Le niveau o&#249; tout com-
mence est en fait celui des unit&#233;s. Le processus de rectification n&#8217;y est cependant d&#233;clench&#233;
qu&#8217;en pr&#233;sence d&#8217;une unit&#233; alphab&#233;tique, et se d&#233;roule en deux &#233;tapes.
</p>
<p>La premi&#232;re &#233;tape traite successivement les diff&#233;rentes formes compos&#233;es (Comp) de l&#8217;unit&#233;.
Pour rappel, &#224; ce stade de l&#8217;analyse, une forme compos&#233;e est un niveau de la structure de
donn&#233;es, mais peut en r&#233;alit&#233; ne contenir qu&#8217;une forme simple. Le traitement r&#233;alis&#233; &#224; ce niveau
diff&#232;re en fonction de la cat&#233;gorie de la forme, et seuls les d&#233;terminants et les substantifs sont
concern&#233;s. S&#8217;il s&#8217;agit d&#8217;un d&#233;terminant, son nombre (Number) est conserv&#233; pour un emploi
ult&#233;rieur. S&#8217;il s&#8217;agit d&#8217;un substantif, le syst&#232;me tente de lui appliquer les r&#232;gles de rectification,
relatives aux mots compos&#233;s et aux mots &#233;trangers, qui sont contenues dans un lexique :
</p>
<p>(Fsm(Comp) . Fsm(Number)) &#9702; fsmRectoLexicon (8)
</p>
<p>C&#8217;est ici que le nombre du dernier d&#233;terminant rencontr&#233; intervient, puisqu&#8217;il est utilis&#233; pour
pr&#233;ciser au lexique si la forme trait&#233;e est au singulier ou au pluriel. Qu&#8217;il y ait eu rectification
ou pas, cette &#233;tape se termine par la concat&#233;nation de la forme compos&#233;e &#224; la machine &#224; &#233;tats
finis repr&#233;sentant l&#8217;unit&#233; compl&#232;te.
</p>
<p>La seconde &#233;tape concerne l&#8217;unit&#233; compl&#232;te (fsmUnit) et est r&#233;alis&#233;e sous la forme d&#8217;une cas-
cade de deux compositions :
</p>
<p>fsmUnit &#9702; fsmRectoRule &#9702; fsmMarkRule (9)
</p>
<p>A ce stade, les mots &#233;trangers et les mots compos&#233;s concern&#233;s par la r&#233;forme ont d&#233;j&#224; &#233;t&#233;
trait&#233;s. Toutes les autres rectifications sont encore &#224; appliquer, ce qui est fait dans la premi&#232;re
composition de la cascade. La deuxi&#232;me composition de la cascade n&#8217;applique plus de r&#232;gles
de rectification, mais ins&#232;re, autour des formes modifi&#233;es, les balises &lt;span&gt; qui permettront le
formatage du texte et l&#8217;affichage des bulles informatives lors de la lecture de la page dans un
navigateur. Ces balises s&#8217;ins&#232;rent autour de toutes les rectifications, y compris celles r&#233;alis&#233;es
sur les mots &#233;trangers et les mots compos&#233;s.
</p>
<p>L&#8217;algorithme se termine par la cr&#233;ation et l&#8217;impression (dans un fichier de sortie) de la chaine de
caract&#232;res correspondant &#224; l&#8217;unit&#233;. C&#8217;est &#224; ce moment qu&#8217;est r&#233;alis&#233; le post-traitement HTML
d&#233;crit en 3.4, o&#249; un alignement permet de combiner dans le texte de sortie &#224; la fois les rectifica-
tions r&#233;alis&#233;es et les informations non linguistiques qui appartenaient &#224; la page initiale.
</p>
<p>3.5.2 Deux modes de gestion des rectifications
</p>
<p>On le constate dans l&#8217;algorithme, les mots compos&#233;s et les mots &#233;trangers &#224; rectifier sont g&#233;r&#233;s
&#224; l&#8217;aide d&#8217;un lexique, alors que les autres rectifications sont g&#233;r&#233;es par des r&#232;gles de r&#233;&#233;criture.
Voici les justifications de ce choix.
</p>
<p>Utilisation d&#8217;un lexique. Qu&#8217;il s&#8217;agisse des mots &#233;trangers ou des mots compos&#233;s, il est pos-
sible d&#8217;en dresser une liste exhaustive. En ce qui concerne les mots &#233;trangers, il est bien &#233;vident</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R. Beaufort, A. Dister, H. Naets, K. Mac&#233;, C. Fairon
</p>
<p>que leur nombre est a priori infini. Cependant, les seuls mots &#233;trangers qui seront reconnus
comme tels et sans erreur sont ceux recens&#233;s dans les lexiques utilis&#233;s. Dans le cadre de la cam-
pagne, ces lexiques ont bien s&#251;r &#233;t&#233; compl&#233;t&#233;s.
En ce qui concerne les mots compos&#233;s, ceux concern&#233;s par les rectifications sont de la forme
&#171; porte-avion &#187; (verbe + nom) et &#171; sans-papier &#187; (pr&#233;position + nom). Il est de ce fait possible
d&#8217;exprimer l&#8217;ensemble des mots compos&#233;s que le syst&#232;me peut rencontrer, sous la forme de
l&#8217;expression r&#233;guli&#232;re suivante :
</p>
<p>({PREP}|{VERBE}) &#183; &quot;-&quot; &#183; {NOM} (10)
</p>
<p>o&#249; {PREP} repr&#233;sente l&#8217;ensemble des pr&#233;positions du lexique, {VERBE} correspond aux formes
verbales qui peuvent participer &#224; la cr&#233;ation d&#8217;un mot compos&#233;, et {NOM} fait r&#233;f&#233;rence &#224; l&#8217;en-
semble des substantifs du lexique. Gr&#226;ce au compilateur utilis&#233;, il est possible de d&#233;crire des
lexiques dont les formes accept&#233;es en entr&#233;e sont r&#233;&#233;crites en sortie. En voici un exemple :
</p>
<p>garde-chasses&lt;SG&gt;&#8594; garde-chasse
garde-chasse&lt;PL&gt;&#8594; garde-chasses (11)
</p>
<p>o&#249; &lt;SG&gt; et &lt;PL&gt; indiquent respectivement que le mot est singulier ou pluriel. Ceci permet d&#8217;&#233;vi-
ter de devoir d&#233;crire des r&#232;gles de r&#233;&#233;criture plus ou moins lourdes, dont chacune ne s&#8217;applique-
rait, au final, qu&#8217;&#224; une forme du lexique. Les diff&#233;rentes combinaisons possibles autorisent plus
de 3 millions de mots compos&#233;s potentiels (354 verbes / pr&#233;positions&#215; 92 778 noms), compil&#233;s
en 25,7s et repr&#233;sent&#233;s sous une machine &#224; &#233;tats finis compacte de 466 Ko.
</p>
<p>Utilisation de r&#232;gles. Les autres rectifications n&#233;cessitent des r&#232;gles de r&#233;&#233;criture pour l&#8217;une des
deux raisons suivantes. Soit le nombre de formes concern&#233;es est potentiellement infini. C&#8217;est
le cas des r&#232;gles concernant l&#8217;accent circonflexe. Soit la r&#232;gle n&#233;cessite la connaissance d&#8217;un
contexte post&#233;rieur &#224; la forme &#224; modifier, et indescriptible sous la forme d&#8217;un lexique. C&#8217;est
le cas, par exemple, de la r&#232;gle &#171; laiss&#233; + infinitif &#187;, qui implique de rep&#233;rer, &#224; l&#8217;aide d&#8217;une
expression r&#233;guli&#232;re, l&#8217;infinitif qui serait pr&#233;sent dans le contexte droit du participe.
</p>
<p>3.5.3 Insertion des balises &lt;span&gt;
</p>
<p>Si les machines &#224; &#233;tats finis ont de nombreux avantages, elles pr&#233;sentent cependant un incon-
v&#233;nient majeur : elles ne facilitent pas l&#8217;identification d&#8217;un symbole de l&#8217;alphabet qui aurait &#233;t&#233;
r&#233;&#233;crit par l&#8217;un ou l&#8217;autre r&#232;gle. Dans une machine, tous les symboles sont &#233;gaux. Il est d&#232;s lors
difficile de rep&#233;rer qu&#8217;une r&#232;gle de r&#233;&#233;criture a &#233;t&#233; appliqu&#233;e.
</p>
<p>Le compilateur que nous avons utilis&#233; (cf. point 3.1) propose un m&#233;canisme permettant de
r&#233;soudre cette difficult&#233;. Il autorise l&#8217;utilisation de marqueurs, symboles ext&#233;rieurs &#224; l&#8217;alphabet
utilis&#233;, que l&#8217;on peut ins&#233;rer dans une r&#232;gle de r&#233;&#233;criture afin d&#8217;identifier un ph&#233;nom&#232;ne et d&#8217;en
suivre l&#8217;&#233;volution.
</p>
<p>Dans notre cas, les marqueurs ont &#233;t&#233; exploit&#233;s comme suit. Nous avons d&#233;fini un couple de
marqueurs par r&#232;gle de rectification. Par exemple, [RU1] et [RU1END] pour la r&#232;gle concernant
le pluriel des mots compos&#233;s, le premier indiquant le d&#233;but d&#8217;une rectification, et le second en
indiquant la fin. Ceci &#233;tant fait, voici comment se r&#233;&#233;crit une ligne du lexique :
</p>
<p>garde-chasse&lt;PL&gt;&#8594; garde-chasse[RU1]s[RU1END] (12)
Gr&#226;ce &#224; la pr&#233;sence de ces marqueurs, l&#8217;insertion des balises &lt;span&gt; a &#233;t&#233; fortement simplifi&#233;e.
En effet, les r&#232;gles pr&#233;cisent maintenant qu&#8217;en pr&#233;sence de marqueurs de ce type, il faut d&#8217;une</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recto / Verso
</p>
<p>part introduire une balise globale autour de la forme compl&#232;te :
</p>
<p>&lt;span class=&quot;recto&quot;&gt;garde-chasse[RU1]s[RU1END]&lt;/span&gt; (13)
</p>
<p>et d&#8217;autre part r&#233;&#233;crire les marqueurs, en les repla&#231;ant par le nom de la r&#232;gle correspondante :
</p>
<p>&lt;span class=&quot;recto&quot;&gt;garde-chasse&lt;span class=&quot;rule1&quot;&gt;s&lt;/span&gt;&lt;/span&gt; (14)
</p>
<p>4 Evaluation du syst&#232;me
</p>
<p>Robustesse et nombre d&#8217;articles trait&#233;s. Lors du lancement de l&#8217;application, quelques bugs
ont caus&#233; plusieurs fois l&#8217;arr&#234;t brutal du syst&#232;me. Une rapide analyse nous a permis de les trou-
ver et de les corriger, de sorte que l&#8217;application a trait&#233;, sans arr&#234;t du syst&#232;me, plus de 1 000 000
de textes au cours de la Semaine de la langue fran&#231;aise en f&#234;te (mi-mars 2009). L&#8217;action, de-
puis, continue. En effet, la presse partenaire, convaincue par la stabilit&#233; de l&#8217;application et ayant
surtout constat&#233; une augmentation de la consultation des articles en ligne, a souhait&#233; conti-
nuer de proposer ce service &#224; ses lecteurs. C&#8217;est ainsi qu&#8217;&#224; l&#8217;heure o&#249; ces lignes sont &#233;crites,
Recto / Verso a trait&#233; plus de 7 000 000 d&#8217;articles, soit environ 3,2 articles/seconde.
</p>
<p>Performances et taille des articles trait&#233;s. L&#8217;application a &#233;t&#233; install&#233;e sur 4 serveurs pourvus
d&#8217;une distribution Ubuntu Server JeOS 8.04.1, d&#8217;un processeur 3 GHz et de 2 048 Mo de RAM.
Elle traite 20 000 caract&#232;res/seconde lorsque le traitement peut rester d&#233;terministe (absence ou
faible pr&#233;sence d&#8217;&#233;l&#233;ments non linguistiques), et tombe au minimum &#224; 10 000 caract&#232;res/se-
conde en cas d&#8217;ind&#233;terminisme fort (forte pr&#233;sence d&#8217;&#233;l&#233;ments non linguistiques).
</p>
<p>Les articles trait&#233;s ont une taille moyenne de 3 500 caract&#232;res, ce qui nous donne un traitement
moyen de 170 ms. La plupart des textes oscillent entre 200 et 4 500 caract&#232;res, 2% des textes
se situent entre 15 000 et 30 000 caract&#232;res, et 1 texte sur 50 000 environ d&#233;passe les 60 000
caract&#232;res.
</p>
<p>Qualit&#233; de l&#8217;analyse. Toutes les formes concern&#233;es par les Rectifications publi&#233;es au Journal
officiel sont trait&#233;es par notre logiciel, hormis punch (la boisson) qui s&#8217;&#233;crit d&#233;sormais ponch
conform&#233;ment &#224; la prononciation. En effet, notre syst&#232;me ne propose pas de d&#233;sambig&#252;isation
s&#233;mantique, et il ne nous &#233;tait pas possible de distinguer la boisson de son homonyme (au sens
de &#171; dynamisme &#187;).
</p>
<p>Lors d&#8217;une r&#233;vision manuelle de 1 000 articles, nous avons constat&#233; &#224; deux reprises que les noms
propres (Nivelles, Capelle), homographes de formes concern&#233;es par la r&#233;forme (tu nivelles, il
capelle), avaient &#233;t&#233; mal analys&#233;s et modifi&#233;s &#224; tort. Ce sont les seules erreurs que nous ayons
eu l&#8217;occasion d&#8217;observer.
</p>
<p>5 Conclusions
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; Recto / Verso, un syst&#232;me d&#233;di&#233; &#224; l&#8217;application de la nou-
velle orthographe, sp&#233;cialement d&#233;velopp&#233; dans le cadre de la Semaine de la langue fran&#231;aise
en Belgique. Pour &#234;tre accept&#233;e par la presse et bien accueillie par le public, l&#8217;application devait
&#234;tre rapide, simple et int&#233;grer une dimension p&#233;dagogique. Nos d&#233;veloppements ont t&#226;ch&#233; d&#8217;at-
teindre ces objectifs. L&#8217;application, r&#233;alis&#233;e &#224; l&#8217;aide de machines &#224; &#233;tats finis, traite entre 10 000</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R. Beaufort, A. Dister, H. Naets, K. Mac&#233;, C. Fairon
</p>
<p>et 20 000 caract&#232;res/seconde selon le taux d&#8217;&#233;l&#233;ments non linguistiques contenus dans le texte.
Le service web, de type SOAP, accepte des pages HTML complexes et y modifie les formes
concern&#233;es par la r&#233;forme, sans alt&#233;rer le reste de la page. Les feuilles de style et les scripts
Javascript, enfin, facilitent l&#8217;identification des rectifications r&#233;alis&#233;es et permettent l&#8217;affichage
d&#8217;infobulles explicatives.
</p>
<p>Ceci ayant &#233;t&#233; mis en place, il restait &#224; attendre le retour du public, dans le cadre de la campagne
de sensibilisation. Recto / Verso a int&#233;ress&#233; les lecteurs des quotidiens en ligne, qui l&#8217;ont test&#233;
massivement. La demande des journaux de maintenir le syst&#232;me sur leur site est d&#8217;ailleurs la
preuve la plus tangible de cet int&#233;r&#234;t du public pour la &#171; nouvelle orthographe &#187;.
</p>
<p>Remerciements
</p>
<p>Cette recherche a &#233;t&#233; partiellement financ&#233;e par le projet &#171; Vocalise &#187;, dans le cadre du pro-
gramme FIRST Post-Doc de la R&#233;gion wallonne (convention 716619), ainsi que par le Service
de la langue de la Communaut&#233; fran&#231;aise de Belgique.
</p>
<p>Nous remercions No&#233;mi Boubel, Bernadette Dehottay et Sophie Roekhaut, pour leur interven-
tion dans la constitution de certaines ressources linguistiques, et Olivier Blanc, pour les conseils
qu&#8217;il nous a donn&#233;s lors de l&#8217;&#233;tablissement des principes de l&#8217;architecture client / serveur.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BEAUFORT R. (2008). Application des Machines &#224; Etats Finis en Synth&#232;se de la Parole. S&#233;lec-
tion d&#8217;unit&#233;s non uniformes et Correction orthographique. PhD thesis, Facult&#233; d&#8217;Informatique,
Facult&#233;s Universitaires Notre-Dame de la Paix, Namur, Belgique. 605 pages.
</p>
<p>BEAUFORT R., DUTOIT T. &amp; PAGEL V. (2002). Analyse syntaxique du fran&#231;ais. Pond&#233;ration
par trigrammes liss&#233;s et classes d&#8217;ambigu&#239;t&#233;s lexicales. In Actes des XXIVe Journ&#233;es d&#8217;Etudes
sur la Parole (JEP&#8217;02), p. 133&#8211;136.
</p>
<p>FONTENELLE T. (2006). Les nouveaux outils de correction linguistique de microsoft. In P.
MERTENS, C. FAIRON, A. DISTER &amp; G. PURNELLE, Eds., Actes de la 13e conf&#233;rence sur
le traitement automatique des langues naturelles (TALN&#8217;06), volume 1, p. 3&#8211;19, Louvain-la-
Neuve : Presses Universitaires de Louvain.
</p>
<p>GOOSSE A. (1991). La &#171; nouvelle &#187; orthographe, Expos&#233; et commentaires. Louvain-la-
Neuve : Duculot.
</p>
<p>KUICH W. &amp; SALOMAA A. (1986). Semirings, Automata, Languages, volume 5 of EATCS
Monographs on Theoretical Computer Science. Berlin, Germany : Springer-Verlag.
</p>
<p>MCNAUGHTON R. &amp; YAMADA H. (1960). Regular expressions and state graphs for automata.
IRE Transactions on Electronic Computers EC, 9(1), 39&#8211;47.
MOHRI M. (1996). On some applications of finite-state automata theory to natural language
processing. Journal of Natural Language Engineering, 2, 1&#8211;20.
E. ROCHE &amp; Y. SCHABES, Eds. (1997). Finite-State Language Processing. Cambridge,
Massachusetts : MIT Press.</p>

</div></div>
</body></html>