<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Profilage de candidatures assist&#233; par Relevance Feedback</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Profilage de candidatures assist&#233; par Relevance Feedback
</p>
<p>R&#233;my Kessler1 Nicolas B&#233;chet2 Juan-Manuel Torres-Moreno1
Mathieu Roche2 Marc El-B&#232;ze1
</p>
<p>(1) LIA / Universit&#233; d&#8217;Avignon, 339 chemin des Meinajari&#232;s, 84911 Avignon
(2) LIRMM - UMR 5506, CNRS - Universit&#233; Montpellier 2 - France
</p>
<p>{remy.kessler, juan-manuel.torres, marc.elbeze}@univ-avignon.fr
{nicolas.bechet,mathieu.roche}@lirmm.fr
</p>
<p>R&#233;sum&#233;. Le march&#233; d&#8217;offres d&#8217;emploi et des candidatures sur Internet conna&#238;t une crois-
sance exponentielle. Ceci implique des volumes d&#8217;information (majoritairement sous la forme
de texte libre) qu&#8217;il n&#8217;est plus possible de traiter manuellement. Une analyse et cat&#233;gorisation
assist&#233;es nous semble pertinente en r&#233;ponse &#224; cette probl&#233;matique. Nous proposons E-Gen, sys-
t&#232;me qui a pour but l&#8217;analyse et cat&#233;gorisation assist&#233;s d&#8217;offres d&#8217;emploi et des r&#233;ponses des
candidats. Dans cet article nous pr&#233;sentons plusieurs strat&#233;gies, reposant sur les mod&#232;les vecto-
riel et probabiliste, afin de r&#233;soudre la probl&#233;matique du profilage des candidatures en fonction
d&#8217;une offre pr&#233;cise. Nous avons &#233;valu&#233; une palette de mesures de similarit&#233; afin d&#8217;effectuer un
classement pertinent des candidatures au moyen des courbes ROC. L&#8217;utilisation d&#8217;une forme de
relevance feedback a permis de surpasser nos r&#233;sultats sur ce probl&#232;me difficile et sujet &#224; une
grande subjectivit&#233;.
Abstract. The market of online job search sites has grown exponentially. This implies
volumes of information (mostly in the form of free text) manually impossible to process. An
analysis and assisted categorization seems relevant to address this issue. We present E-Gen, a
system which aims to perform assisted analysis and categorization of job offers and the res-
ponses of candidates. This paper presents several strategies based on vectorial and probabilistic
models to solve the problem of profiling applications according to a specific job offer. We have
evaluated a range of measures of similarity to rank candidatures by using ROC curves. Rele-
vance feedback approach allows surpass our previous results on this task, difficult and higly
subjective.
Mots-cl&#233;s : Classification, recherche d&#8217;information, Ressources humaines, mod&#232;le pro-
babiliste, mesures de similarit&#233;, Relevance Feedback.
</p>
<p>Keywords: Classification,Information Retrieval, Human Ressources, Probabilistic Mo-
del, Similarity measure, Relevance Feedback.
</p>
<p>1 Introduction
</p>
<p>La croissance exponentielle d&#8217;Internet a permis le d&#233;veloppement d&#8217;un grand nombre de sites
d&#8217;emplois (Bizer &amp; Rainer, 2005; Rafter et al., 2000a) et d&#8217;un march&#233; du recrutement en ligne
en expansion significative (ao&#251;t 2003 : 177 000 offres, mai 2008 : 500 000 offres)1. Internet est
</p>
<p>1Site d&#8217;emploi www.keljob.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kessler, B&#233;chet, Torres-Moreno, Roche et El-B&#232;ze.
</p>
<p>devenu essentiel dans ce processus, car il permet une meilleure diffusion de l&#8217;information, que
ce soit par les sites de recherche d&#8217;emplois ou par les &#233;changes de courriels. Cependant divers
probl&#232;mes se posent dans son traitement notamment en raison de la grande quantit&#233; d&#8217;informa-
tion difficile &#224; g&#233;rer rapidement et efficacement pour les entreprises (Bourse et al., 2004; Rafter
et al., 2000b). En outre, si le navigateur Web est devenu un outil universel, facile &#224; employer
pour les utilisateurs, la n&#233;cessit&#233; fr&#233;quente pour les internautes d&#8217;entrer des donn&#233;es dans les
formulaires Web &#224; partir de sources papier, de &quot;copier et coller&quot; des donn&#233;es entre diff&#233;rentes
applications, est une probl&#233;matique fr&#233;quente lors de l&#8217;int&#233;gration de donn&#233;es communes. En
cons&#233;quence, il est n&#233;cessaire de traiter cette masse de documents d&#8217;une mani&#232;re automatique
ou assist&#233;e. Nous proposons le syst&#232;me E-Gen pour r&#233;soudre ce probl&#232;me. Il est compos&#233; de
trois modules principaux, chacun d&#8217;eux &#233;tant charg&#233;s de :
&#8211; Extraire de l&#8217;information &#224; partir de corpus de courriels provenant d&#8217;offres d&#8217;emplois extraites
</p>
<p>de la base de donn&#233;es d&#8217;Aktor2.
&#8211; Analyser les e-mails de r&#233;ponses des candidats pour distinguer lettre de motivation (LM) et
</p>
<p>curriculum vit&#230;(CV).
&#8211; Analyser et calculer un classement de pertinence des candidatures (LM et CV).
Nos pr&#233;c&#233;dents travaux pr&#233;sentaient le premier module (Kessler et al., 2007), l&#8217;identification des
parties d&#8217;une offre d&#8217;emploi et l&#8217;extraction d&#8217;informations pertinentes (contrat, salaire, locali-
sation, etc.). Le deuxi&#232;me module permet, &#224; l&#8217;aide d&#8217;une solution combinant r&#232;gles et m&#233;thodes
d&#8217;apprentissage (Machines &#224; Vecteurs Support MVS), de distinguer correctement les parties de
la candidature (CV ou LM) avec une pr&#233;cision de 0,98 et un rappel de 0,96 (Kessler et al.,
2008b). Cependant le flux de r&#233;ponses &#224; une offre d&#8217;emploi entra&#238;ne un long travail de lecture
des candidatures par les recruteurs. Afin de faciliter cette t&#226;che, nous souhaitons mettre en place
un syst&#232;me capable de fournir une premi&#232;re &#233;valuation automatis&#233;e des candidatures selon di-
vers crit&#232;res. Nous pr&#233;sentons ici les travaux concernant le dernier module du syst&#232;me E-Gen.
La section 2 pr&#233;sente un bref &#233;tat de l&#8217;art sur le traitement automatique des documents issus
du domaine des ressources humaines. La section 3 d&#233;crit l&#8217;architecture globale du syst&#232;me.
Nous pr&#233;sentons en sections 4 et 5 les strat&#233;gies pour le profilage des candidatures, le protocole
exp&#233;rimental, les statistiques sur le corpus et les r&#233;sultats obtenus.
</p>
<p>2 Etat de l&#8217;art
</p>
<p>Dans le but d&#8217;automatiser certains processus souvent longs et co&#251;teux li&#233;s &#224; la gestion des res-
sources humaines, divers travaux ont &#233;t&#233; men&#233;s. La sp&#233;cificit&#233; des informations contenues dans
les documents d&#8217;une candidature &#224; une offre d&#8217;emploi a permis le d&#233;veloppement de diff&#233;rentes
approches s&#233;mantiques. (Morin et al., 2004) proposent une m&#233;thode d&#8217;indexation s&#233;mantique
de CV fond&#233;e sur le syst&#232;me BONOM (Cazalens &amp; Lamarre, 2001). La m&#233;thode propos&#233;e
consiste &#224; exploiter les caract&#233;ristiques dispositionnelles du document afin d&#8217;identifier chacune
des parties et l&#8217;indexer en cons&#233;quence. Par ailleurs, une description d&#8217;une approche s&#233;mantique
du processus de recrutements et des diff&#233;rents impacts &#233;conomiques est propos&#233;e par (Bizer &amp;
Rainer, 2005; Tolksdorf et al., 2006) en partenariat avec le gouvernement allemand. (Rafter
et al., 2000a) d&#233;crivent les lacunes des syst&#232;mes actuels face &#224; la probl&#233;matique de recherche
d&#8217;emploi et proposent un syst&#232;me sur la base de filtre collaboratif (ACF) permettant d&#8217;effectuer
des profilages automatiques sur le site JobFinder. Mochol (Mocho et al., 2006) d&#233;crit l&#8217;impor-
tance d&#8217;une ontologie commune (HR ontology) afin de pouvoir traiter efficacement ce type de
</p>
<p>2Aktor Int&#233;ractive (www.aktor.fr)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Profilage de candidatures assist&#233; par Relevance Feedback
</p>
<p>documents et (Bourse et al., 2004) d&#233;crit un mod&#232;le de comp&#233;tence et un processus d&#233;di&#233; &#224; la
gestion des comp&#233;tences dans le cadre de l&#8217;e-recrutement (principalement des CV ou des offres
d&#8217;emploi). De la m&#234;me fa&#231;on, s&#8217;appuyant sur la technologie HR-XML mise en place par (Allen
&amp; Pilot, 2001), (Dorn et al., 2007; Dorn &amp; Naz, 2007) d&#233;crivent un prototype de m&#233;ta-moteur
sp&#233;cifique &#224; la recherche d&#8217;emploi. Celui-ci privil&#233;gie la r&#233;colte des informations importantes
(cat&#233;gorie de l&#8217;emploi, lieu du travail, comp&#233;tences recherch&#233;es, intervalle de salaire etc.) sur
un ensemble de sites web (Jobs.net, aftercollege.com, Directjobs.com etc.).
L&#8217;&#233;tude du document principal d&#8217;une candidature, le CV, a fait l&#8217;objet de diff&#233;rents travaux
afin de l&#8217;analyser de mani&#232;re automatique. (Clech &amp; Zighed, 2003) d&#233;crivent une approche de
fouille de donn&#233;es ayant pour but la mise au point d&#8217;automates capables d&#8217;apprendre &#224; identi-
fier des typologies de CV, de profils de candidats et/ou de postes. Les travaux pr&#233;sentent une
premi&#232;re approche limit&#233;e &#224; la cat&#233;gorisation de CV de cadres et de non cadres. La m&#233;thode
mise en &#339;uvre s&#8217;appuie sur sur l&#8217;extraction de termes sp&#233;cifiques permettant une cat&#233;gorisation
&#224; l&#8217;aide de C4.5 (Quilan, 1993) et un mod&#232;le &#224; base d&#8217;analyse discriminante. Cette m&#233;thode
permet de mettre en &#233;vidence la sp&#233;cificit&#233; de certains termes ou concepts (tel que le niveau
d&#8217;&#233;tude, les comp&#233;tences mises en avant) afin d&#8217;effectuer cette classification mais reste d&#233;ce-
vante au niveau des r&#233;sultats obtenus (environ 50- 60% de CV correctement class&#233;s). (Roche &amp;
Kodratoff, 2006; Roche &amp; Prince, 2008) d&#233;crivent une &#233;tude r&#233;alis&#233;e sur l&#8217;extraction de termi-
nologie sp&#233;cifique sur un corpus de CV3. Leur approche permet d&#8217;extraire un certain nombre
de collocations contenues dans les CV sur la base de patrons (tels que Nom-Nom, Adjectif-
Nom, Nom-pr&#233;position-Nom,etc.) et de les classer en fonction de leur pertinence en vue de la
construction d&#8217;une ontologie sp&#233;cialis&#233;e. Notre approche diff&#232;re des m&#233;thodes propos&#233;es par le
fait qu&#8217;elle s&#8217;appuie sur une combinaison de mesures de similarit&#233; afin d&#8217;effectuer un classe-
ment des candidatures avec une phase de Relevance Feedback. Ceci nous permet de prendre en
compte l&#8217;opinion de l&#8217;utilisateur.
</p>
<p>3 Vue d&#8217;ensemble du syst&#232;me
</p>
<p>Nous avons choisi de d&#233;velopper un syst&#232;me r&#233;pondant aux contraintes du march&#233; de recru-
tement en ligne. Dans ce but, une adresse &#233;lectronique a &#233;t&#233; cr&#233;&#233;e afin de recevoir les offres
d&#8217;emploi. Apr&#232;s l&#8217;identification de la langue par n-grammes de caract&#232;res, E-Gen analyse le
message afin d&#8217;extraire le texte pertinent de l&#8217;offre d&#8217;emploi du message ou du fichier attach&#233;
&#224; l&#8217;aide de deux modules externes : wvWare4 et pdftotext5. Apr&#232;s l&#8217;&#233;tape de filtrage et raci-
nisation, nous utilisons la repr&#233;sentation vectorielle pour chaque segment afin de lui attribuer
une &#233;tiquette en fonction de son r&#244;le dans l&#8217;annonce &#224; l&#8217;aide des MVS et des n-grammes de
mots. Cette s&#233;quence d&#8217;&#233;tiquettes, qui donne une repr&#233;sentation de l&#8217;encha&#238;nement des diff&#233;-
rents segments de l&#8217;annonce, est trait&#233;e par un processus correctif qui la valide ou qui propose
une meilleure s&#233;quence (t&#226;che 1) (Kessler et al., 2007). Lors de la publication d&#8217;une offre d&#8217;em-
ploi, Aktor g&#233;n&#232;re une adresse &#233;lectronique afin de r&#233;pondre a cette offre. Chaque courriel est
ainsi redirig&#233; vers un logiciel de ressources humaines, Gestmax6 afin d&#8217;&#234;tre lu par un consultant
en recrutement. Lors de la r&#233;ception d&#8217;une candidature, le syst&#232;me extrait le corps du message
ainsi que les pi&#232;ces jointes. Une version texte des documents contenus dans la candidature est
</p>
<p>3corpus fournis par la soci&#233;t&#233; Vedior Bis (http ://www.vediorbis.com)
4http://wvware.sourceforge.net. La segmentation de textes MS-Word &#233;tant un vrai casse t&#234;te, on
</p>
<p>a opt&#233; par un outil existant. Dans la majorit&#233; des cas, il sectionne en paragraphes le document.
5http ://www.bluem.net/downloads/pdftotext_en
6http ://www.gestmax.fr</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kessler, B&#233;chet, Torres-Moreno, Roche et El-B&#232;ze.
</p>
<p>FIG. 1 &#8211; Vue d&#8217;ensemble du syst&#232;me.
</p>
<p>alors produite. Diff&#233;rents processus de filtrage et racinisation permettent au syst&#232;me d&#8217;identifier
&#224; l&#8217;aide de MVS et de r&#232;gles le type du document (CV et/ou LM). Ce processus (t&#226;che 2) est
d&#233;taill&#233; dans (Kessler et al., 2008b). Une fois la LM et le CV identifi&#233;s, le syst&#232;me effectue un
profilage automatis&#233; de cette candidature &#224; l&#8217;aide de mesures de similarit&#233; en s&#8217;appuyant sur un
nombre de candidatures pr&#233;alablement valid&#233;es comme candidatures pertinentes par un consul-
tant en recrutement (t&#226;che 3). Le processus mis en &#339;uvre est d&#233;taill&#233; dans la section suivante.
La figure 1 r&#233;sume le processus global du syst&#232;me.
</p>
<p>4 Approches de classement des candidatures
</p>
<p>4.1 Pr&#233;traitements
</p>
<p>Dans un premier temps, nous avons effectu&#233; un pr&#233;-traitement des donn&#233;es textuelles (CV et
LM) permettant de supprimer des informations non pertinentes telles que les noms des candi-
dats, les adresses, les courriers &#233;lectroniques, les noms de villes. La suppression des accents et
des majuscules est &#233;galement effectu&#233;e. Nous avons par la suite utilis&#233; diff&#233;rents processus de
filtrage et racinisation sur la repr&#233;sentation en mots afin de r&#233;duire le lexique. Pour r&#233;duire le
bruit dans le mod&#232;le &#224; base de mots7, nous avons supprim&#233; les mots fonctionnels (&#234;tre, avoir,
pouvoir, falloir etc.), les expressions courantes (par exemple, c&#8217;est-&#224;-dire, chacun de, etc.), les
chiffres et nombres (num&#233;riques et/ou textuelles), les symboles comme &quot;$&quot;, &quot;#&quot;,&quot;*&quot;, ainsi que
les termes contenu dans un anti-dictionnaire. Enfin, nous avons ramen&#233; les verbes fl&#233;chis &#224; leur
racine et les adjectifs pluriels et/ou f&#233;minins &#224; une forme canonique &#224; l&#8217;aide d&#8217;un dictionnaire8.
</p>
<p>4.2 Comparaison Candidature/Offre d&#8217;emploi par mesure de similarit&#233;
</p>
<p>Nous avons transform&#233; chaque document en une repr&#233;sentation vectorielle (Salton, 1991) avec
des poids caract&#233;risant la fr&#233;quence des termes (Tf ) et le Tf-idf (Salton &amp; Mcgill, 1986). Nous
</p>
<p>7Ces pr&#233;-traitements ne sont pas appliqu&#233;s lors de la repr&#233;sentation en n-grammes d&#233;crites en section 4.3.2
8Ainsi les mots d&#233;veloppe, d&#233;veloppent, d&#233;velopp&#233;, d&#233;velopperont, d&#233;veloppement et &#233;ventuellement d&#233;velop-
</p>
<p>peur seront ramen&#233;s &#224; la m&#234;me forme.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Profilage de candidatures assist&#233; par Relevance Feedback
</p>
<p>avons mis en place une approche par mesure de similarit&#233;, afin de pouvoir ordonner automa-
tiquement l&#8217;ensemble des candidatures par rapport aux offres d&#8217;emploi propos&#233;es. Nous avons
combin&#233; pour cela un certain nombre de mesures de similarit&#233; entre les candidatures et l&#8217;offre
d&#8217;emploi associ&#233;e. Les mesures de similarit&#233; que nous avons utilis&#233;es dans nos travaux sont d&#233;-
crites dans (Bernstein et al., 2005) : cosinus (formule 1) qui permet de calculer l&#8217;angle entre
l&#8217;offre d&#8217;emploi et la r&#233;ponse de chaque candidat, les distances de Minkowski (formule 2)
(p = 1 pour Manhattan, p = 2 pour la distance euclidienne). Une autre mesure utilis&#233;e est
Okabis (formule 3). Cette mesure est une version simplifi&#233; de la formule Okapi, souvent uti-
lis&#233;e en Recherche d&#8217;Information, qui permet d&#8217;obtenir de meilleures performances (Bellot &amp;
El-B&#232;ze, 2001) :
</p>
<p>simcosine(j, d) =
&#8721;n
</p>
<p>i=1 ji &#183; di&#8730;&#8721;n
i=1 j
</p>
<p>2
</p>
<p>i &#183;
&#8721;n
</p>
<p>i=1 d
2
</p>
<p>i
</p>
<p>(1)
</p>
<p>simMinkowski(j, d) =
1
</p>
<p>1 + (
&#8721;n
</p>
<p>i=1 |ji &#8722; di|p)
1
</p>
<p>p
</p>
<p>(2)
</p>
<p>Okabis(d, j) =
&#8721;
</p>
<p>i&#8712;d&#8745;j
</p>
<p>&#8721;n
i=1 ji &#183; di
</p>
<p>&#8721;n
i=1 ji &#183; di +
</p>
<p>&#8730;
|d|
</p>
<p>Md
</p>
<p>(3)
</p>
<p>Avec j une offre d&#8217;emploi, d la candidature, i un terme, ji et di le nombre d&#8217;occurrences de
i respectivement dans j et d et Md leur taille moyenne. D&#8217;autres mesures (Overlap, Enertex,
Needleman-Wunsch, Jaro-Winkler) ont &#233;t&#233; exp&#233;riment&#233;es, mais n&#8217;ont pas &#233;t&#233; prises en compte
suite aux r&#233;sultats obtenus. Les mesures utilis&#233;es ainsi que leur combinaison sont d&#233;taill&#233;es dans
(Kessler et al., 2008a).
</p>
<p>4.3 Extraction des descripteurs
</p>
<p>Dans les sections suivantes, nous d&#233;crivons un certain nombre de descripteurs qui seront utili-
s&#233;s pour repr&#233;senter les documents. Ces descripteurs s&#8217;appuient sur des informations gramma-
ticales, des informations lexicales et des informations s&#233;mantiques avec un calcul de retour de
pertinence.
</p>
<p>4.3.1 Filtrage et pond&#233;ration des mots selon leur &#233;tiquette grammaticale
</p>
<p>Afin d&#8217;am&#233;liorer les r&#233;sultats obtenus par les mesures de similarit&#233; (section 4.2), nous avons ef-
fectu&#233; une extraction d&#8217;informations grammaticales du corpus &#224; l&#8217;aide du TreeTagger9 (Schmid,
1994). (Roche &amp; Kodratoff, 2006) et nos observations du corpus &#224; partir des donn&#233;es textuelles
montrent que les CV sont des documents courts (le plus souvent ne d&#233;passant pas une page) et
syntaxiquement pauvres : peu de sujets et de verbes dans les phrases, phrases sous forme de r&#233;-
sum&#233;, nombreuses &#233;num&#233;rations de noms et d&#8217;adjectifs, etc. Les mots respectant des &#233;tiquettes
grammaticales sp&#233;cifiques peuvent donc &#234;tre int&#233;ressants. Nous proposons donc d&#8217;extraire les
mots suivants : N (Nom) A(adjectif) V(Verbe). Ces seuls mots s&#233;lectionn&#233;s seront la base de la
repr&#233;sentation vectorielle des documents. Par ailleurs, diff&#233;rentes combinaisons et pond&#233;rations
ont &#233;t&#233; exp&#233;riment&#233;es.
</p>
<p>9http ://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger/ : Treetagger est un syst&#232;me d&#8217;&#233;tiquetage gram-
matical des mots</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kessler, B&#233;chet, Torres-Moreno, Roche et El-B&#232;ze.
</p>
<p>4.3.2 N-grammes de caract&#232;res
</p>
<p>Utilis&#233;e principalement en reconnaissance de la parole, la notion de n-grammes de caract&#232;res
prit davantage d&#8217;importance avec les travaux de (Damashek, 1995) sur le traitement de l&#8217;&#233;crit.
Ils montrent que ce d&#233;coupage ne fait pas perdre d&#8217;information. De nombreux travaux depuis
ont montr&#233; l&#8217;efficacit&#233; des n-grammes comme m&#233;thode de repr&#233;sentation des textes (Mayfield
&amp; Mcnamee, 1998; Hurault-Plantet et al., 2005). Un n-gramme est une s&#233;quence de n symboles
cons&#233;cutifs. Pour un document quelconque, l&#8217;ensemble des n-grammes que l&#8217;on peut g&#233;n&#233;rer
est le r&#233;sultat que nous obtenons en d&#233;pla&#231;ant une fen&#234;tre de n cases sur le corps de texte. Ce d&#233;-
placement se d&#233;roule par &#233;tapes, une &#233;tape correspondant &#224; un caract&#232;re. Ensuite les fr&#233;quences
des n-grammes trouv&#233;s sont calcul&#233;es. Notons qu&#8217;aucun des pr&#233;traitements pr&#233;sent&#233; en 4.1 ne
sont utilis&#233; dans cette repr&#233;sentation. Par exemple, la phrase &quot;D&#233;veloppeur php mysql&quot; est re-
pr&#233;sent&#233; avec des 3-grammes par [dev, eve, vel, elo, lop, opp, ppe, eur, ur_, r_p, _ph, php, hp_,
p_m, _my, mys, ysq, sql]. Nous repr&#233;sentons les n-grammes en utilisant le caract&#232;re &quot;_&quot; pour
caract&#233;riser les espaces. L&#8217;int&#233;r&#234;t de cette repr&#233;sentation est qu&#8217;elle permet de capturer auto-
matiquement les racines des mots les plus fr&#233;quents (Greffenstette, 1995). Un tel processus ne
n&#233;cessite pas d&#8217;&#233;tape de recherche des racines lexicales. Le second int&#233;r&#234;t de cette repr&#233;senta-
tion est sa tol&#233;rance aux fautes d&#8217;orthographe et aux erreurs typographiques souvent pr&#233;sentes
dans les CV et LM10. Nous avons test&#233; diff&#233;rents n-grammes (3/4/5/6-grammes).
</p>
<p>4.3.3 Enrichissement s&#233;mantique de la mission et relevance feedback
</p>
<p>L&#8217;observation des mots ayant le plus d&#8217;influence lors du calcul de la mesure de similarit&#233;, nous
a conduit &#224; envisager un enrichissement du contenu de la mission &#224; l&#8217;aide de connaissances
s&#233;mantiques obtenues &#224; partir de la base ROME11 de l&#8217;ANPE12. Ainsi, pour chaque mission,
nous effectuons un enrichissement de celle-ci &#224; l&#8217;aide des comp&#233;tences et niveaux d&#8217;&#233;tudes n&#233;-
cessaires afin de remplir cette fonction13. Les r&#233;sultats de ces tests sont pr&#233;sent&#233;s en section
5.2 sous l&#8217;appellation Mission enrichie. Ceux-ci n&#8217;apportant pas toujours d&#8217;am&#233;lioration, nous
avons modifi&#233; le syst&#232;me afin d&#8217;int&#233;grer un processus de retour de pertinence (Relevance Feed-
back) (Sp&#228;rck Jones, 1970). (Rafter et al., 2000a) propose l&#8217;utilisation du Relevance Feedback
afin de guider l&#8217;internaute dans sa recherche d&#8217;emploi &#224; partir d&#8217;informations r&#233;colt&#233;es sur le site
JobFinder14. Dans notre syst&#232;me, la m&#233;thode Relevance Feedback permet de prendre en compte
les choix du recruteur lors d&#8217;une premi&#232;re &#233;valuation de quelques CV. Cette approche repose
sur l&#8217;exploitation des documents retourn&#233;s en r&#233;ponse &#224; une premi&#232;re requ&#234;te pour am&#233;liorer
le r&#233;sultat de la recherche (Salton &amp; Buckley, 1990). Dans notre contexte, nous effectuons un
tirage al&#233;atoire de quelques candidatures (de une &#224; six dans nos exp&#233;rimentations) parmi l&#8217;en-
semble des candidatures &#233;tiquet&#233;es comme pertinentes. Celles-ci sont ajout&#233;es &#224; la Mission.
Nous enrichissons ainsi l&#8217;espace vectoriel par les termes appartenant &#224; des candidatures jug&#233;es
pertinentes par un consultant en recrutement. Ceci nous permet d&#8217;effectuer un nouveau calcul
de similarit&#233; entre la candidature que nous &#233;valuons et la mission enrichie de l&#8217;opinion du recru-
</p>
<p>10Par exemple, un syst&#232;me fond&#233; sur les mots aura des difficult&#233;s &#224; reconna&#238;tre le mot &quot;D&#233;velopeur&quot; mal ortho-
graphi&#233; (avec un seul p).
</p>
<p>11R&#233;pertoire Op&#233;rationnel des M&#233;tiers et des Emplois
12http ://www.anpe.fr/espacecandidat/romeligne/RliIndex.do
13Exemple : 32321/d&#233;veloppeur/Bac+2 &#224; Bac+4 en informatique CFPA, BTS, DUT ;Participe au d&#233;veloppe-
</p>
<p>ment et &#224; la maintenance des applications informatiques,l&#8217;analyse fonctionnelle, la conception technique, le
codage, la mise au point et la documentation des programmes etc.
</p>
<p>14JobFinder (jobfinder.com)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Profilage de candidatures assist&#233; par Relevance Feedback
</p>
<p>teur. Les r&#233;sultats obtenus sont pr&#233;sent&#233;s en section 5.2 sous l&#8217;appellation Relevance Feedback.
</p>
<p>5 Exp&#233;rimentations
</p>
<p>Nous avons s&#233;lectionn&#233; un sous-corpus de la base de donn&#233;es d&#8217;Aktor. Le Corpus Mission,
d&#8217;environ 10Mo, est un ensemble d&#8217;offres d&#8217;emploi avec des th&#233;matiques diff&#233;rentes (emplois
en comptabilit&#233;, commercial, informatique, etc) associ&#233;es aux r&#233;ponses des candidats. Chaque
candidature est identifi&#233;e comme pertinente ou non pertinente. Une &#233;valuation pertinente
correspond &#224; un candidat potentiellement int&#233;ressant pour un emploi donn&#233; et une valeur non
pertinente a &#233;t&#233; attribu&#233;e &#224; une candidature rejet&#233;e selon l&#8217;avis d&#8217;un consultant en recrutement.
Le tableau 1 pr&#233;sente quelques statistiques de ce corpus (Kessler et al., 2008b; Kessler et al.,
2008a).
</p>
<p>Nombre de Candidatures
Num&#233;ro Mission Candidatures pertinentes non pertinentes
34990 collaborateur comptable 32 7 25
34861 ing&#233;nieur commercial(e) 40 14 26
31702 comptable, d&#233;partement fournisseurs 55 23 32
32461 d&#233;veloppeur web php/mysql 60 7 53
33633 ing&#233;nieur commercial 65 18 47
34865 assistant comptable 67 10 57
34783 assistant comptable 108 9 99
33746 3 chefs de cuisine 116 60 56
33553 un d&#233;l&#233;gu&#233; commercial 117 17 100
33725 conseiller commercial urbain 118 43 75
31022 assistant(e) en recrutement 221 28 193
31274 assistant comptable junior 224 26 198
34119 assistant commercial 257 10 247
31767 assistant comptable junior 437 51 386
Total 1917 323 1594
</p>
<p>TAB. 1 &#8211; Statistiques du Corpus Mission.
</p>
<p>5.1 Protocole exp&#233;rimental
</p>
<p>Nous souhaitons mesurer la similarit&#233; entre une offre d&#8217;emploi et ses candidatures. Le Corpus
Mission contient 14 offres d&#8217;emploi associ&#233;es &#224; au moins sept candidatures pertinentes. Pour
&#233;valuer la qualit&#233; des classements, nous construisons des courbes ROC (Ferri et al., 2002) utili-
s&#233;es &#224; l&#8217;origine dans le traitement du signal. On trouve en abscisses d&#8217;une courbe ROC le taux
de faux positifs et les ordonn&#233;es sont relatives aux taux de vrais positifs. La surface sous la
courbe ROC ainsi cr&#233;&#233;e est appel&#233;e AUC (Area Under the Curve). Le principal avantage des
courbes ROC est leur r&#233;sistance au d&#233;s&#233;quilibre entre les exemples positifs et n&#233;gatifs (Roche &amp;
Kodratoff, 2006). Pour chaque offre d&#8217;emploi du corpus, nous &#233;valuons la qualit&#233; du classement
avec cette m&#233;thode. Les candidatures &#233;tudi&#233;es sont celles compos&#233;es d&#8217;un CV et d&#8217;une LM.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kessler, B&#233;chet, Torres-Moreno, Roche et El-B&#232;ze.
</p>
<p>5.2 R&#233;sultats
</p>
<p>Le tableau 2 pr&#233;sentent un comparatif des meilleurs r&#233;sultats obtenus par chaque m&#233;thode.
Chaque test a &#233;t&#233; effectu&#233; une centaine de fois avec une distribution al&#233;atoire des candidatures
pertinentes ajout&#233;s au Relevance Feedback. Nous effectuons une moyenne des AUC obtenues
pour chaque mesure. TF montre les r&#233;sultats obtenus &#224; partir d&#8217;une repr&#233;sentation en fr&#233;quence
de termes. TF-IDF utilise le produit de la fr&#233;quence des termes et de leur fr&#233;quence inverse
en documents. Les repr&#233;sentations TF et TF-IDF donnent des r&#233;sultats sensiblement similaires
avec des scores AUC de 0,64, la taille r&#233;duite de nos corpus pouvant expliquer ces r&#233;sultats.
</p>
<p>N -grams Offre d&#8217;emploi
enrichie TF TF-IDF
</p>
<p>&#201;tiquettes
grammaticales
</p>
<p>Relevance
Feedback
</p>
<p>Offre d&#8217;Emploi
/CV et LM 0,60 0,62 0,64 0,64 0,64 0,66
</p>
<p>TAB. 2 &#8211; Comparaison entre les scores AUC obtenues par chaque m&#233;thode.
</p>
<p>Les combinaisons et pond&#233;rations d&#8217;&#233;tiquettes grammaticales (voir section 4.3.1) ne semblent
pas apporter d&#8217;am&#233;lioration (&#201;tiquettes grammaticales). Les r&#233;sultats N-grams sont obtenus &#224;
partir des 5-grammes. Avec un score AUC de 0,6 au mieux, ceux- ci restent relativement faibles.
Dans de futurs travaux, nous envisageons d&#8217;&#233;tudier les raisons pr&#233;cises de la faible performance
obtenue avec les n-grammes. Diff&#233;rents post-processus dans le but d&#8217;&#233;liminer les s&#233;quences de
caract&#232;res trop fr&#233;quentes ou non significatives ont &#233;t&#233; envisag&#233;s mais sans r&#233;ellement d&#8217;am&#233;-
lioration majeure. Avec un score AUC de 0,62, l&#8217;enrichissement s&#233;mantique (Offre d&#8217;emploi
enrichie) ne semble pas am&#233;liorer la performance g&#233;n&#233;rale du syst&#232;me. Nous observons cepen-
dant une am&#233;lioration des r&#233;sultats obtenus avec le retour de pertinence. La figure pr&#233;sente les
r&#233;sultats pour chaque taille de Relevance Feedback (RF1 correspond &#224; une candidature ajout&#233;s
a la mission, RF2 deux, etc.). RF1 obtient une moyenne de 0,65 et RF6 de 0,66. Nous utilisons
actuellement la m&#233;thode residual ranking (Billerbeck &amp; Zobel, 2006) : les documents utilis&#233;s
pour le Relevance Feedback sont retir&#233;s de la collection avant d&#8217;effectuer la requ&#234;te reformul&#233;e.
</p>
<p>                                                    
</p>
<p>                                                    
</p>
<p>                                                    
</p>
<p>                                                    
</p>
<p>                                                    
</p>
<p>                                                    
</p>
<p>                                                    
</p>
<p>                                                    
</p>
<p>RF1 RF2 RF3 RF4 RF5 RF6
0,59
</p>
<p>0,60
</p>
<p>0,61
</p>
<p>0,62
</p>
<p>0,63
</p>
<p>0,64
</p>
<p>0,65
</p>
<p>0,66
</p>
<p>0,67
</p>
<p>Mission Enrichie
</p>
<p>TF 
TF-IDF
Etiquettes-
Grammaticales
</p>
<p>N-grammes
</p>
<p> 
</p>
<p> 
</p>
<p>sc
o
</p>
<p>re
 
</p>
<p>AU
C 
</p>
<p>Taille de Relevance Feedback
</p>
<p>Relevance Feedback
</p>
<p>FIG. 2 &#8211; Comparaison entre les scores AUC pour chaque m&#233;thode.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Profilage de candidatures assist&#233; par Relevance Feedback
</p>
<p>6 Conclusion et perspectives
</p>
<p>Le traitement des offres d&#8217;emploi est une t&#226;che extr&#234;mement difficile car l&#8217;information est en
format libre malgr&#233; une structure conventionnelle. Ces travaux ont mis en avant le module de
traitement des r&#233;ponses &#224; des offres d&#8217;emplois, troisi&#232;me module du projet E-Gen, syst&#232;me pour
le traitement des offres d&#8217;emploi sur Internet. Celui-ci a pour but la mise en place d&#8217;un syst&#232;me
d&#8217;aide &#224; la d&#233;cision pour le recruteur, ce dernier effectue une &#233;valuation des premi&#232;res candida-
tures afin de guider le syst&#232;me par la suite. Apr&#232;s diff&#233;rentes &#233;tapes de filtrage et de racinisation
afin de produire une repr&#233;sentation vectorielle, nous effectuons un classement des candidatures
&#224; l&#8217;aide de mesures de similarit&#233; et diverses repr&#233;sentations des documents. Les premiers r&#233;-
sultats &#224; l&#8217;aide du retour de pertinence montrent une am&#233;lioration des AUC obtenues. Nous
envisageons quelques tests compl&#233;mentaires (recherche de crit&#232;res discriminants sur les candi-
datures identifi&#233;es comme non pertinentes, pond&#233;ration en fonction de l&#8217;importance de chacune
des parties de la mission, etc.) pouvant apporter de nouvelles am&#233;liorations. Nous souhaitons
par ailleurs inclure d&#8217;autres param&#232;tres tels que la richesse du vocabulaire et l&#8217;orthographe afin
d&#8217;&#233;valuer la lettre de motivation, ceux-ci &#233;tant &#224; l&#8217;heure actuelle faiblement exploit&#233;s lors de la
prise de d&#233;cision par les recruteurs. Nous envisageons par ailleurs la mise en place d&#8217;un syst&#232;me
d&#8217;&#233;valuation de CV sur le portail jobmanager15 afin d&#8217;effectuer l&#8217;op&#233;ration inverse (le candidat
d&#233;pose son CV et le syst&#232;me lui propose les missions les plus adapt&#233;es &#224; son profil).
</p>
<p>R&#233;f&#233;rences
ALLEN C. &amp; PILOT L. (2001). Hr-xml : Enabling pervasive hr- e-business. In XML Europe
2001, Int. Congress Centrum (ICC), Berlin, Germany.
BELLOT P. &amp; EL-B&#200;ZE M. (2001). Classification et segmentation de textes par arbres de
d&#233;cision. In Technique et Science Informatiques (TSI), volume 20, p. 107&#8211;134. Herm&#232;s.
BERNSTEIN A., KAUFMANN E., KIEFER C. &amp; B&#220;RKI C. (2005). SimPack : A Generic Java
Library for Similarity Measures in Ontologies. Rapport interne, University of Zurich.
BILLERBECK B. &amp; ZOBEL J. (2006). Efficient query expansion with auxiliary data structures.
Inf. Syst., (7), 573&#8211;584.
BIZER R. H. &amp; RAINER E. (2005). Impact of Semantic web on the job recruitment Process.
International Conference Wirtschaftsinformatik.
BOURSE M., LECL&#200;RE M., MORIN E. &amp; TRICHET F. (2004). Human resource management
and semantic web technologies. In ICTTA, p. 641&#8211;642.
CAZALENS S. &amp; LAMARRE P. (2001). An organization of internet agents based on a hierarchy
of information domains. In Proceedings MAAMAW.
CLECH J. &amp; ZIGHED D. A. (2003). Data mining et analyse des cv : une exp&#233;rience et des
perspectives. In Extraction et la Gestion des Connaissances, EGC&#8217;03, p. 189&#8211;200.
DAMASHEK M. (1995). Gauging similarity with n-grams : Language-independent categori-
zation of text. Science 1995 ; 267, p. 843&#8211;848.
DORN J. &amp; NAZ T. (2007). Meta-search in human resource management. In in Proceedings
of 4th International Conference on Knowledge Systems ICKS&#8217;07 Bangkok,Thailand, p. 105 &#8211;
110.
</p>
<p>15http ://www.jobmanager.fr</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kessler, B&#233;chet, Torres-Moreno, Roche et El-B&#232;ze.
</p>
<p>DORN J., NAZ T. &amp; PICHLMAIR M. (2007). Ontology development for human resource
management. In International Conference on Knowledge Management Vienna, p. 109&#8211;120.
FERRI C., FLACH P. &amp; HERNANDEZ-ORALLO J. (2002). Learning decision trees using the
area under the ROC curve. In Proceedings of ICML&#8217;02, p. 139&#8211;146.
GREFFENSTETTE G. (1995). Comparing two language identification schemes. Communica-
tions JADT 1995, p. 85&#8211;96.
HURAULT-PLANTET M., JARDINO M. &amp; ILLLOUZ G. (2005). Mod&#232;les de langage n-
grammes et segmentation th&#233;matique. Actes TALN &amp; RECITAL, vol 2, p. 135&#8211;144.
KESSLER R., B&#201;CHET N., ROCHE M., EL-B&#200;ZE M. &amp; TORRES-MORENO J. M. (2008a).
Automatic profiling system for ranking candidates answers in human resources. In OTM&#8217;08,
Monterrey, Mexico, p. 625&#8211;634.
KESSLER R., TORRES-MORENO J. M. &amp; EL-B&#200;ZE M. (2007). E-Gen : Automatic Job Offer
Processing system for Human Ressources. MICAI 2007, Aguscalientes, Mexique, pp 985-995.
KESSLER R., TORRES-MORENO J. M. &amp; EL-B&#200;ZE M. (2008b). E-Gen : Profilage automa-
tique de candidatures. TALN 2008, Avignon, France, p. 370&#8211;379.
MAYFIELD J. &amp; MCNAMEE P. (1998). Indexing using both n-grams and words. NIST Special
Publication, p. 500&#8211;242.
MOCHO M., PASLARU E. &amp; SIMPERL B. (2006). Practical Guidelines for Building Semantic
eRecruitment Applications. I-Know&#8217;06 Special track on Advanced Semantic Technologies.
MORIN E., LECL&#200;RE M. &amp; TRICHET F. (2004). The semantic web in e-recruitment (2004).
In The First European Symposium of Semantic Web (ESWS&#8217;2004).
QUILAN J. (1993). C4.5 : Programs for machine learning. In Kaufmann, San Mateo, CA.
RAFTER R., BRADLEY K. &amp; SMYT B. (2000a). Automated Collaborative Filtering Applica-
tions for Online Recruitment Services. p. 363&#8211;368.
RAFTER R., SMYTH B. &amp; BRADLEY K. (2000b). Inferring Relevance Feedback from Server
Logs : A Case Study in Online Recruitment.
ROCHE M. &amp; KODRATOFF Y. (2006). Pruning Terminology Extracted from a Specialized
Corpus for CV Ontology Acquisition. In OTM&#8217;06, Montpellier, France, p. 1107&#8211;1116.
ROCHE M. &amp; PRINCE V. (2008). Evaluation et d&#233;termination de la pertinence pour des
syntagmes candidats &#224; la collocation. In JADT2008, p. 1009&#8211;1020.
SALTON G. (1991). Developments in automatic text retrieval. Science 253, p. 974&#8211;979.
SALTON G. &amp; BUCKLEY C. (1990). Improving retrieval performance by relevance feedback.
Journal of the American Society for Information Science, p. 288&#8211;297.
SALTON G. &amp; MCGILL M. J. (1986). Introduction to Modern Information Retrieval. New
York, NY, USA : McGraw-Hill, Inc.
SCHMID G. (1994). Treetagger - a language independent part-of-speech tagger. In Procee-
dings of EACL-SIGDAT 1995. Dublin, Ireland., p. 44&#8211;49.
SP&#196;RCK JONES K. (1970). Some thoughts on classification for retrieval. Journal of Docu-
mentation, 26, 89&#8211;101.
TOLKSDORF R., MOCHO M., HEESE R., OLDAKOWSKI R. &amp; CHRISTIAN B. (2006).
Semantic-Web-Technologien im Arbeitsvermittlungsprozess. International Conference Wirt-
schaftsinformatik, p. 17&#8211;26.</p>

</div></div>
</body></html>