<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Cat&#233;gorisation s&#233;mantico-discursive des &#233;valuations exprim&#233;es dans la blogosph&#232;re</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Cat&#233;gorisation s&#233;mantico-discursive des &#233;valuations
exprim&#233;es dans la blogosph&#232;re
</p>
<p>Matthieu Vernier1 Laura Monceaux1 B&#233;atrice Daille1 Estelle Dubreil1
</p>
<p>(1) LINA / CNRS UMR 6241, Universit&#233; de Nantes
{Prenom.Nom}@univ-nantes.fr
</p>
<p>R&#233;sum&#233;. Les blogs constituent un support d&#8217;observations id&#233;al pour des applications li&#233;es
&#224; la fouille d&#8217;opinion. Toutefois, ils imposent de nouvelles probl&#233;matiques et de nouveaux d&#233;fis
au regard des m&#233;thodes traditionnelles du domaine. De ce fait, nous proposons une m&#233;thode
automatique pour la d&#233;tection et la cat&#233;gorisation des &#233;valuations localement exprim&#233;es dans
un corpus de blogs multi-domaine. Celle-ci rend compte des sp&#233;cificit&#233;s du langage &#233;valuatif
d&#233;crites dans deux th&#233;ories linguistiques. L&#8217;outil d&#233;velopp&#233; au sein de la plateforme UIMA vise
d&#8217;une part &#224; construire automatiquement une grammaire du langage &#233;valuatif, et d&#8217;autre part
&#224; utiliser cette grammaire pour la d&#233;tection et la cat&#233;gorisation des passages &#233;valuatifs d&#8217;un
texte. La cat&#233;gorisation traite en particulier l&#8217;aspect axiologique de l&#8217;&#233;valuation, sa configura-
tion d&#8217;&#233;nonciation et sa modalit&#233; dans le discours.
</p>
<p>Abstract. Blogs are an ideal observation for applications related to the opinion mining
task. However, they impose new problems and new challenges in this field. Therefore, we pro-
pose a method for automatic detection and classification of appraisal locally expressed in a
multi-domain blogs corpus. It reflects the specific aspects of appraisal language described in
two linguistic theories. The tool developed within the UIMA platform aims both to automati-
cally build a grammar of the appraisal language, and the other part to use this grammar for the
detection and categorization of evaluative segments in a text. Categorization especially deals
with axiological aspect of an evaluative segments, enunciative configuration and its attitude in
discourse.
</p>
<p>Mots-cl&#233;s : fouille d&#8217;opinion, langage &#233;valuatif, cat&#233;gorisation des &#233;valuations.
</p>
<p>Keywords: opinion mining, appraisal language, appraisal classification.
</p>
<p>1 Introduction
</p>
<p>Ces derni&#232;res ann&#233;es, les blogs ont conquis leur place &#224; c&#244;t&#233; des m&#233;dias traditionnels et
deviennent une source d&#8217;informations incontournable. Les blogueurs l&#8217;utilisent majoritairement
&#224; des fins d&#8217;auto-repr&#233;sentation, et la plupart se forment autour des affects ou des id&#233;es propres
&#224; leur auteur. Le blog est souvent construit autour d&#8217;une strat&#233;gie argumentative o&#249; l&#8217;auteur
cherche &#224; convaincre, plus ou moins intens&#233;ment, ses lecteurs d&#8217;adopter son point de vue ou sa
fa&#231;on d&#8217;&#233;valuer le monde. De par la force et la rapidit&#233; des &#233;changes sur le Web, un blog peut
devenir c&#233;l&#232;bre au sein de la communaut&#233; &#224; laquelle il appartient en tr&#232;s peu de temps. Certains
blogs sont d&#8217;ailleurs si influents que les informations qui en sont issues semblent se propager
aux autres blogs pour cr&#233;er des ph&#233;nom&#232;nes de buzz ou de sujets &#233;mergents dont les &#233;volutions
peuvent &#234;tre observ&#233;es au fil des jours ou des semaines.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vernier et al.
</p>
<p>Dans le cadre de la blogosph&#232;re, les recherches en fouille d&#8217;opinion suscitent un int&#233;r&#234;t majeur,
notamment afin de caract&#233;riser la fa&#231;on dont l&#8217;un de ces sujets &#233;mergents est &#233;valu&#233; : est-il
&#233;valu&#233; globalement positivement ou n&#233;gativement ? Sur quels aspects est-il positivement ou
n&#233;gativement &#233;valu&#233; ? Selon les sujets &#233;mergents, les domaines d&#8217;applications sont particuli&#232;re-
ment nombreux : la sociologie, la politique, le marketing, la cr&#233;ation de r&#233;seaux sociaux autour
d&#8217;opinions communes, etc. La quantit&#233; des blogs, leur qualit&#233; grandissante et leur r&#233;activit&#233; vis
&#224; vis de l&#8217;actualit&#233; mondiale sugg&#232;rent la possibilit&#233; d&#8217;analyser en temps r&#233;el l&#8217;&#233;volution des
avis port&#233;s sur un m&#234;me sujet cible. L&#8217;enjeu pour la recherche en traitement de la langue et un
des verrous technologiques de cette probl&#233;matique r&#233;sident principalement sur la fa&#231;on de d&#233;-
tecter et cat&#233;goriser automatiquement l&#8217;expression d&#8217;une opinion dans la langue. D&#8217;un point de
vue terminologique, nous pr&#233;f&#233;rons adopter le terme d&#8217;&#233;valuation et de langage &#233;valuatif pour
faire r&#233;f&#233;rence aux diff&#233;rentes modalit&#233;s linguistiques possibles pour exprimer l&#8217;opinion, l&#8217;ap-
pr&#233;ciation, le jugement, l&#8217;&#233;motion, l&#8217;accord, le d&#233;saccord port&#233; sur un sujet. Nous justifions cet
emploi en adoptant le point de vue des th&#233;ories linguistiques anglo-saxonnes (Martin &amp; White,
2005) et fran&#231;aises (Charaudeau, 1992; Galatanu, 2000).
</p>
<p>Les billets publi&#233;s sur les blogs par les auteurs, et les commentaires qui y sont associ&#233;s, sont
particuli&#232;rement h&#233;t&#233;rog&#232;nes &#224; la fois dans la diversit&#233; des th&#232;mes abord&#233;s et dans leur forme
discursive. Un billet peut parler d&#8217;un seul concept ou, dans la majorit&#233; des cas, &#233;voquer plusieurs
concepts bien distincts. L&#8217;auteur peut &#234;tre pr&#233;sent ou absent dans l&#8217;&#233;nonciation (utilisation du
pronom &#171; je &#187;) ; sa strat&#233;gie argumentative peut chercher &#224; cr&#233;er une atmosph&#232;re volontaire-
ment subjective ou, au contraire, cr&#233;er une fausse impression d&#8217;objectivit&#233;. Notre objectif est
d&#8217;aboutir &#224; une m&#233;thode pour la fouille d&#8217;opinion qui tienne compte de la diversit&#233; possible
des th&#233;matiques et des formes discursives des textes. Nous cherchons ainsi &#224; d&#233;tecter les &#233;va-
luations exprim&#233;es localement dans les blogs et &#224; cat&#233;goriser leur modalit&#233;, leur configuration
d&#8217;&#233;nonciation et leur axiologie (positive ou n&#233;gative).
</p>
<p>Dans cet article, nous pr&#233;sentons l&#8217;&#233;volution des probl&#233;matiques du domaine afin de pr&#233;ciser
en quoi les m&#233;thodes existantes en fouille d&#8217;opinion ne sont pas pr&#233;cis&#233;ment adapt&#233;es &#224; nos
objectifs (section 2). Pour caract&#233;riser du mieux possible le ph&#233;nom&#232;ne complexe de l&#8217;&#233;valua-
tion, nous nous appuyons sur deux mod&#232;les linguistiques pour proposer un sch&#233;ma d&#8217;annotation
(section 3). A partir d&#8217;un corpus annot&#233; manuellement, notre approche consiste &#224; apprendre au-
tomatiquement une grammaire de l&#8217;&#233;valuation et &#224; utiliser celle-ci a posteriori pour d&#233;tecter et
cat&#233;goriser la modalit&#233;, la configuration d&#8217;&#233;nonciation et l&#8217;axiologie des &#233;valuations issues des
blogs (section 4). Nous exp&#233;rimentons et &#233;valuons notre m&#233;thode sur un corpus test &#224; travers
deux exemples d&#8217;applications (section 5).
</p>
<p>2 &#201;volution des probl&#233;matiques en fouille d&#8217;opinion
</p>
<p>L&#8217;&#233;volution des travaux en fouille d&#8217;opinion depuis une dizaine d&#8217;ann&#233;es semble guid&#233;e par
deux courants : comment adapter des m&#233;thodes pour traiter du monodomaine &#224; du multido-
maine sans repasser par une phase d&#8217;entra&#238;nement co&#251;teuse ? comment adapter des m&#233;thodes
qui analysent un texte dans sa globalit&#233; vers des m&#233;thodes qui analysent s&#233;parement diff&#233;rents
passages d&#8217;un texte ? Ces deux axes sont &#233;galement deux de nos pr&#233;occupations induites par
notre support d&#8217;observations : les blogs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cat&#233;gorisation s&#233;mantico-discursive des &#233;valuations dans la blogosph&#232;re
</p>
<p>2.1 Du mono-th&#233;matique au multi-th&#233;matique
</p>
<p>Quelques travaux en fouille d&#8217;opinion prenant les blogs comme support d&#8217;&#233;tude (Mishne &amp;
Glance, 2006; Mullen &amp; Malouf, 2006) se sont limit&#233;s &#224; analyser les blogs d&#8217;une m&#234;me th&#233;-
matique : le cin&#233;ma ou la politique notamment. Par opposition, notre objectif est de prendre
en compte le plus large &#233;ventail possible de domaines discut&#233;s sur les blogs. Ce point soul&#232;ve
une probl&#233;matique qui prend sa source dans les travaux pionniers de la fouille d&#8217;opinion. De
nombreux travaux proposent des m&#233;thodes par apprentissage supervis&#233; pour classer automati-
quement des textes &#224; partir d&#8217;un corpus homog&#232;ne th&#233;matiquement : des critiques de films, de
livres, de t&#233;l&#233;phones, d&#8217;appareil photos ou de voyages (Pang et al., 2002; Dave et al., 2003;
Maurel et al., 2008). Pour chaque domaine d&#8217;application, ces m&#233;thodes b&#233;n&#233;ficient de l&#8217;exis-
tence de ressources exploitables : les sites de critiques en ligne o&#249; chaque texte est associ&#233; &#224; une
note attribu&#233;e en amont par les utilisateurs du site. Ces m&#233;thodes permettent d&#8217;extraire statisti-
quement des unit&#233;s textuelles (mots, n-grammes) associ&#233;es &#224; une polarit&#233; positive ou n&#233;gative
selon leur fr&#233;quence d&#8217;apparition dans les textes not&#233;s positivement ou n&#233;gativement. Souvent
ces indices textuels ne font sens que dans le seul domaine &#233;tudi&#233;, voire uniquement dans le
corpus d&#8217;&#233;tude. Ainsi, (Aue &amp; Gamon, 2005) montre que le terme le plastique est n&#233;gatif lors-
qu&#8217;on &#233;value une cuisine et qu&#8217;il n&#8217;a aucune polarit&#233; selon les classifieurs entra&#238;n&#233;s sur d&#8217;autres
domaines.
</p>
<p>Des travaux plus r&#233;cents (Aue &amp; Gamon, 2005; Blitzer et al., 2007) proposent des m&#233;-
thodes pour comparer les unit&#233;s textuelles extraites statistiquement sur plusieurs corpus mono-
th&#233;matiques et conserver uniquement celles qui font sens dans plusieurs domaines. Ces unit&#233;s
textuelles sont ainsi consid&#233;r&#233;es comme suffisament g&#233;n&#233;riques pour pouvoir s&#8217;adapter &#224; des
textes d&#8217;un domaine o&#249; il n&#8217;existe pas de corpus d&#8217;entra&#238;nement disponible. Toutefois, &#224; notre
connaissance tr&#232;s peu d&#8217;exp&#233;riences ont &#233;t&#233; men&#233;es &#224; grande &#233;chelle sur des corpus r&#233;ellement
multi-th&#233;matiques. Le besoin d&#8217;envisager d&#8217;autres m&#233;thodes en suppl&#233;ment des classifieurs su-
pervis&#233;s classiques s&#8217;exprime de plus en plus avec les nouveaux besoins applicatifs en fouille
d&#8217;opinion.
</p>
<p>2.2 De la cat&#233;gorisation de texte &#224; la cat&#233;gorisation des &#233;valuations
</p>
<p>Un deuxi&#232;me aspect qui distingue notre objectif des probl&#233;matiques habituelles en fouille
d&#8217;opinion r&#233;side dans le constat suivant : un billet ou un commentaire publi&#233; sur un blog parle,
dans la majorit&#233; des cas, de plusieurs concepts bien distincts. Chaque concept peut &#234;tre &#233;valu&#233;
diff&#233;remment. Il n&#8217;est donc pas pertinent de chercher &#224; cat&#233;goriser positivement ou n&#233;gative-
ment un blog dans sa globalit&#233;. D&#8217;autres travaux font ce m&#234;me constat et envisagent diff&#233;rentes
strat&#233;gies. (Nigam &amp; Hurst, 2006) commence par extraire les groupes de phrases d&#8217;un corpus
qui traitent d&#8217;une m&#234;me th&#233;matique sp&#233;cifi&#233;e en amont pour ainsi se replacer dans les condi-
tions d&#8217;une classification mono-th&#233;matique. Selon le m&#234;me principe, mais avec un niveau de
granularit&#233; plus fin, (Hu &amp; Liu, 2004) cat&#233;gorise les phrases une par une &#224; partir des adjectifs
pr&#233;sents dans la phrase. Citons &#233;galement (Whitelaw et al., 2005) qui s&#8217;int&#233;resse &#224; caract&#233;riser
les &#233;valuations &#224; un niveau intra-phrastique (very good, not terribly funny) &#224; partir de la th&#233;orie
de l&#8217;&#233;valuation anglo-saxonne (Martin &amp; White, 2005). Nous nous inscrivons davantage dans
ce dernier axe de recherche en nous questionnant sur la d&#233;finition d&#8217;une &#233;valuation, quelles sont
ses diff&#233;rentes formes et ses diff&#233;rents marqueurs linguistiques qui permettraient d&#8217;aboutir &#224;
une m&#233;thode robuste pour la d&#233;tection et la cat&#233;gorisation des &#233;valuations.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vernier et al.
</p>
<p>3 Langage &#233;valuatif
</p>
<p>3.1 Th&#233;ories linguistiques
</p>
<p>L&#8217;&#233;valuation est d&#233;finie par (Lavelle, 1950) comme l&#8217;acte de rupture de l&#8217;indiff&#233;rence par
laquelle nous mettons toutes les choses sur le m&#234;me plan et consid&#233;rons toutes les actions
comme &#233;quivalentes. Tout acte de langage r&#233;v&#233;lant une rupture d&#8217;indiff&#233;rence rel&#232;ve donc du
ph&#233;nom&#232;ne &#233;valuatif. Ces actes mettent en jeu des m&#233;canismes s&#233;mantiques, pragmatiques ou
&#233;nonciatifs complexes faisant l&#8217;objet de nombreuses &#233;tudes (Kerbrat-Orecchioni, 1997; Ans-
combre &amp; Ducrot, 1983). (Charaudeau, 1992) montre qu&#8217;il existe cinq modalit&#233;s permettant &#224;
un locuteur d&#8217;exprimer une &#233;valuation (l&#8217;opinion, l&#8217;accord ou le d&#233;saccord, l&#8217;acceptation ou
le refus, le jugement et l&#8217;appr&#233;ciation). Chacune de ces modalit&#233;s r&#233;v&#232;le une attitude particu-
li&#232;re du locuteur : sa croyance plus ou moins certaine par rapport &#224; l&#8217;&#233;valuation qu&#8217;il exprime,
le champ d&#8217;exp&#233;rience dans lequel il se positionne (&#233;thique, moral, intellectuel, esth&#233;tique, etc),
sa position par rapport &#224; son &#233;nonc&#233; (pr&#233;sence ou absence du &#171; je &#187;). Selon Charaudeau, il existe
des marqueurs lexicaux et des structures linguistiques sp&#233;cifiques &#224; ces modalit&#233;s (Tab. 1).
</p>
<p>Marqueurs Modalit&#233;
&#234;tre sceptique, douter, croire, penser, &#234;tre convaincu Opinion (conviction faible &#224; forte)
</p>
<p>effectivement, d&#8217;accord, non, &#234;tre faux Accord ou D&#233;saccord
courageux, int&#233;ressant, l&#226;che, mentir Jugement (&#233;thique, moral, intellectuel)
</p>
<p>adorer, ha&#239;r, joli, triste Appr&#233;ciation (affect, h&#233;donique)
</p>
<p>TAB. 1 &#8211; Exemples de marqueurs lexicaux pour les modalit&#233;s de l&#8217;&#233;valuation
</p>
<p>La th&#233;orie de (Galatanu, 2000) sur l&#8217;&#233;valuation compl&#232;te le mod&#232;le de Chauraudeau en hi&#233;rar-
chisant les modalit&#233;s sur une &#233;chelle de subjectivit&#233;. Lorsqu&#8217;un locuteur organise son &#233;nonc&#233;, il
peut choisir d&#8217;objectiver ou de subjectiver son discours en activant certaines modalit&#233;s ou par la
configuration &#233;nonciative des modalit&#233;s qu&#8217;il active. Dans les exemples Tab. 2, la valeur mise en
jeu &#171;mentir &#187; (modalit&#233; de jugement) intervient dans une strat&#233;gie argumentative diff&#233;rente. Le
locuteur dissimule sa pr&#233;sence (configuration implicite) et &#233;ventuellement sur-modalise l&#8217;&#233;va-
luation en marquant qu&#8217;il s&#8217;agit d&#8217;une opinion ou d&#8217;une appr&#233;ciation. Ces exemples ont un
impact diff&#233;rent sur l&#8217;effet d&#8217;objectivit&#233; ou de subjectivit&#233; de l&#8217;&#233;nonc&#233;.
</p>
<p>Exemple Sur-modalit&#233; Modalit&#233;
Je doute qu&#8217;il mente Opinion faible explicite Jugement implicite
</p>
<p>Il est &#233;vident qu&#8217;il ment Opinion forte implicite Jugement implicite
Oui, c&#8217;est un menteur Accord Jugement implicite
</p>
<p>Il ment Jugement implicite
Je n&#8217;aime pas qu&#8217;il mente Appr&#233;ciation explicite Jugement implicite
</p>
<p>TAB. 2 &#8211; Exemple de discours &#233;valuatif diff&#233;rent pour la m&#234;me valeur mentir
</p>
<p>3.2 Langage &#233;valuatif sur les blogs
</p>
<p>&#192; des fins d&#8217;apprentissage et de test, nous annotons les &#233;valuations exprim&#233;es dans un corpus
de blogs &#224; partir d&#8217;un sch&#233;ma d&#8217;annotations en ad&#233;quation avec les th&#233;ories linguistiques pr&#233;-
sent&#233;es. Pour chaque &#233;valuation annot&#233;e, nous pr&#233;cisons sa modalit&#233;, sa configuration d&#8217;&#233;non-
ciation, son axiologie et le concept &#233;valu&#233;. Nous renvoyons &#224; (Dubreil et al., 2008) pour une
description plus pr&#233;cise de la m&#233;thodologie d&#8217;annotation. Le corpus d&#8217;entra&#238;nement annot&#233;
est compos&#233; de 200 billets de blogs associ&#233;s aux commentaires post&#233;s par les lecteurs sur ce</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cat&#233;gorisation s&#233;mantico-discursive des &#233;valuations dans la blogosph&#232;re
</p>
<p>billet. Ils sont extraits automatiquement de la plateforme de blogs OverBlog et appartiennent
volontairement &#224; des th&#233;matiques les plus vari&#233;es possibles (actualit&#233;, artiste, famille, gastrono-
mie, internet, sant&#233;, science, voyage, etc), en excluant les billets qui ne contiennent pas ou tr&#232;s
peu de texte. 4945 passages &#233;valuatifs ont ainsi &#233;t&#233; annot&#233;s manuellement. Par ailleurs, nous
constituons semi-manuellement trois ressources lexico-s&#233;mantiques :
&#8211; un lexique de l&#8217;&#233;valuation (1115 entr&#233;es), d&#233;velopp&#233; par Sinequa (Stern, 2008), contenant
les termes &#233;valuatifs fr&#233;quents dans le corpus, associ&#233;es &#224; leur cat&#233;gorie grammaticale, leur
modalit&#233;, leur &#233;nonciation et leur axiologie. ex : machiste, chapeau bas, douter,
</p>
<p>&#8211; un lexique de l&#8217;intensit&#233; (21 entr&#233;es) ex : particuli&#232;rement, tr&#232;s,
&#8211; un lexique de la n&#233;gation (15 entr&#233;es) ex : pas, aucun,
Le corpus d&#8217;entra&#238;nement et les ressources lexicales sont &#224; la base de notre m&#233;thode pour
construire automatiquement une grammaire du langage &#233;valuatif.
</p>
<p>4 M&#233;thode symbolique pour cat&#233;goriser les &#233;valuations
</p>
<p>Notre approche consiste &#224; apprendre automatiquement les structures du langage qui sont sp&#233;-
cifiquement utilis&#233;es pour &#233;valuer et utiliser la g&#233;n&#233;ricit&#233; des structures apprises pour d&#233;tecter
et cat&#233;goriser les &#233;valuations dans de nouveaux textes. Nous partons de l&#8217;id&#233;e de Chauraudeau
qu&#8217;il existe des structures lexicales, grammaticales et s&#233;mantiques pour chaque modalit&#233; d&#8217;&#233;va-
luation. Par exemple, j&#8217;en doute et nous en sommes persuad&#233;s sont des &#233;valuations de modalit&#233;
d&#8217;opinion g&#233;n&#233;ralisables car : douter et &#234;tre persuad&#233; ont la m&#234;me classe s&#233;mantique (verbes
marqueurs d&#8217;opinion), je et nous ont la m&#234;me fonction grammaticale et impliquent explicite-
ment le locuteur.
</p>
<p>4.1 Apprentissage automatique des structures &#233;valuatives
</p>
<p>Plateforme pour le TAL Nous tirons profit de la plateforme pour le TAL UIMA1 pour
construire une cha&#238;ne de traitements linguistiques. Cette plateforme permet de traiter des textes
non structur&#233;s et d&#8217;y ajouter des annotations dans un format normalis&#233; assurant la r&#233;utilisabilit&#233;
des composants et l&#8217;&#233;change des annotations entre composants.
</p>
<p>Pr&#233;-traitements L&#8217;apprentissage des structures &#233;valuatives (Fig. 1) est r&#233;alis&#233; &#224; partir du cor-
pus d&#8217;entra&#238;nement annot&#233; manuellement, pr&#233;sent&#233; dans la section pr&#233;c&#233;dente. Les composants
de pr&#233;-traitements annotent des informations morpho-syntaxiques et s&#233;mantiques &#224; partir de
ressources ext&#233;rieures (TreeTagger et lexiques). Ces annotations portent sur des mots ou des
suites de mots, nous utilisons le terme abstrait symbole pour nommer ce niveau de granularit&#233;.
D&#232;s lors, le flux de donn&#233;es qui transite entre composants est constitu&#233; d&#8217;une suite de symboles,
chacun associ&#233; &#224; des traits :
&#8211; lexico-grammaticaux : forme, lemme (lem), cat&#233;gorie grammaticale (pos),
&#8211; s&#233;mantiques : type (&#233;valuation (eval), intensit&#233; (int), n&#233;gation (neg), autre (mot)), moda-
lit&#233; (appr&#233;ciation (app), opinion (op), accord-d&#233;saccord (acc)), configuration d&#8217;&#233;nonciation
(exclamative (excl), explicite (exp), implicite) (imp), axiologie (positif, n&#233;gatif, ambigu).
1Unstructured Information Management Architecture : d&#233;velopp&#233;e par IBM et Apache. http ://incuba-
</p>
<p>tor.apache.org/uima/.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vernier et al.
</p>
<p>FIG. 1 &#8211; Cha&#238;ne de traitements pour l&#8217;apprentissage de structures &#233;valuatives
</p>
<p>Cha&#238;nes symboliques et g&#233;n&#233;ralisation &#192; partir des 4945 passages &#233;valuatifs annot&#233;s ma-
nuellement dans le corpus, et des cha&#238;nes symboliques correspondantes, il s&#8217;agit de gagner en
g&#233;n&#233;ricit&#233; en sp&#233;cifiant automatiquement les valeurs de trait qui peuvent &#234;tre substitu&#233;es par
une autre valeur2, ceci afin de rep&#233;rer plus d&#8217;&#233;valuations. La figure 2 repr&#233;sente la cha&#238;ne de
symboles g&#233;n&#233;riques construite &#224; partir de l&#8217;exemple d&#8217;&#233;valuation n&#8217;est-ce pas plus original.
</p>
<p>26666666666664
</p>
<p>lex
</p>
<p>&quot;
forme &#8217;X&#8217;
lem &#8217;X&#8217;
</p>
<p>#
gram
</p>
<p>h
pos &#8217;adv&#8217;
</p>
<p>i
</p>
<p>sem
</p>
<p>26664
type &#8217;neg&#8217;
modal &#8217; &#8217;
config &#8217; &#8217;
axiol &#8217; &#8217;
</p>
<p>37775
</p>
<p>37777777777775
</p>
<p>26666666666664
</p>
<p>lex
</p>
<p>&quot;
forme &#8217;X&#8217;
lem &#8217;&#234;tre&#8217;
</p>
<p>#
gram
</p>
<p>h
pos &#8217;ver&#8217;
</p>
<p>i
</p>
<p>sem
</p>
<p>26664
type &#8217;mot&#8217;
modal &#8217; &#8217;
config &#8217; &#8217;
axiol &#8217; &#8217;
</p>
<p>37775
</p>
<p>37777777777775
</p>
<p>26666666666664
</p>
<p>lex
</p>
<p>&quot;
forme &#8217;X&#8217;
lem &#8217;ce&#8217;
</p>
<p>#
gram
</p>
<p>h
pos &#8217;pro&#8217;
</p>
<p>i
</p>
<p>sem
</p>
<p>26664
type &#8217;mot&#8217;
modal &#8217; &#8217;
config &#8217; &#8217;
axiol &#8217; &#8217;
</p>
<p>37775
</p>
<p>37777777777775
</p>
<p>26666666666664
</p>
<p>lex
</p>
<p>&quot;
forme &#8217;X&#8217;
lem &#8217;X&#8217;
</p>
<p>#
gram
</p>
<p>h
pos &#8217;adv&#8217;
</p>
<p>i
</p>
<p>sem
</p>
<p>26664
type &#8217;neg&#8217;
modal &#8217; &#8217;
config &#8217; &#8217;
axiol &#8217; &#8217;
</p>
<p>37775
</p>
<p>37777777777775
</p>
<p>26666666666664
</p>
<p>lex
</p>
<p>&quot;
forme &#8217;X&#8217;
lem &#8217;plus&#8217;
</p>
<p>#
gram
</p>
<p>h
pos &#8217;adv&#8217;
</p>
<p>i
</p>
<p>sem
</p>
<p>26664
type &#8217;mot&#8217;
modal &#8217; &#8217;
config &#8217; &#8217;
axiol &#8217; &#8217;
</p>
<p>37775
</p>
<p>37777777777775
</p>
<p>26666666666664
</p>
<p>lex
</p>
<p>&quot;
forme &#8217;Y&#8217;
lem &#8217;Y&#8217;
</p>
<p>#
gram
</p>
<p>h
pos &#8217;adj&#8217;
</p>
<p>i
</p>
<p>sem
</p>
<p>26664
type &#8217;eval.&#8217;
modal &#8217;app.&#8217;
config &#8217;imp.&#8217;
axiol &#8217;Y&#8217;
</p>
<p>37775
</p>
<p>37777777777775
</p>
<p>FIG. 2 &#8211; Structure g&#233;n&#233;rique extraite &#224; partir de l&#8217;exemple n&#8217;est-ce pas plus original.
</p>
<p>Nos r&#232;gles de g&#233;n&#233;ralisation sont les suivantes :
&#8211; G&#233;n&#233;ralisation de la valeur des traits axiol, forme et de lemme (Y sur la fig. 2) pour tous les
symboles de type &#233;valuation et de modalit&#233; appr&#233;ciation,
</p>
<p>&#8211; G&#233;n&#233;ralisation de la valeur du trait lex (X sur la fig. 2) pour certains symboles (adverbe,
pronom ...) ainsi que le trait lem pour les symboles de type adverbe
</p>
<p>&#8211; Ajout de l&#8217;op&#233;rateur standard * sur les symboles de type intensit&#233; et g&#233;n&#233;ralisation de la
valeur des traits forme et de lemme de ces symboles,
</p>
<p>&#8211; Ajout de l&#8217;op&#233;rateur standard + (une ou plusieurs fois) pour les symboles de config explicite
et de pos pronom et g&#233;n&#233;ralisation de la valeur des traits forme et de lemme de ces symboles.
</p>
<p>Ce processus de cr&#233;ation de structure g&#233;n&#233;rique permet de distinguer des tournures &#233;valuatives
tr&#232;s proches mais dont la signification peut &#234;tre radicalement diff&#233;rente : n&#8217;est-ce pas plus origi-
nal est positif, n&#8217;est pas plus original est n&#233;gatif et ne semble pas plus original est n&#233;gatif mais
avec une opinion de conviction moyenne. Le processus de g&#233;n&#233;ralisation permet &#233;galement de
regrouper certaines &#233;valuations ayant la m&#234;me structure &#233;valuative (c&#8217;est g&#233;nial, c&#8217;est super)
d&#8217;o&#249; une r&#233;duction des 4945 structures annot&#233;es manuellement &#224; 2830 structures apprises dans
notre grammaire.
</p>
<p>Grammaire du langage &#233;valuatif Nous stockons chaque structure &#233;valuative g&#233;n&#233;rique ainsi
extraite dans une ressource au format XML. Pour chacune d&#8217;elle, le dernier composant de la
cha&#238;ne ajoute des m&#233;ta-donn&#233;es qui serviront lors de la cat&#233;gorisation : le nombre d&#8217;occurences
de la structure dans le corpus d&#8217;entra&#238;nement, le nombre d&#8217;occurences par modalit&#233;, le nombre
d&#8217;occurences par configuration d&#8217;&#233;nonciation et la tournure de la structure. Nous entendons par
tournure, le fait que certaines structures peuvent &#234;tre :
</p>
<p>2Traits ayant pour valeur &#8217; ?&#8217; dans Fig.2</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cat&#233;gorisation s&#233;mantico-discursive des &#233;valuations dans la blogosph&#232;re
</p>
<p>&#8211; directes : pour notre plus grand plaisir, pour notre plus grand malheur,
&#8211; inversives : loin d&#8217;&#234;tre g&#233;nial, loin d&#8217;&#234;tre mauvais,
&#8211; fig&#233;es positives : faire taire la critique, marcher nickel,
&#8211; fig&#233;es n&#233;gatives : &#233;quipe de bras cass&#233;, c&#8217;est l&#224; o&#249; le b&#226;t blesse.
</p>
<p>4.2 Cat&#233;gorisation semantico-discursive des &#233;valuations
</p>
<p>Il s&#8217;agit ensuite d&#8217;utiliser la grammaire du langage &#233;valuatif g&#233;n&#233;r&#233;e pour d&#233;tecter et cat&#233;go-
riser les &#233;valuations dans de nouveaux textes.
</p>
<p>FIG. 3 &#8211; Cha&#238;ne de traitements pour la d&#233;tection et la cat&#233;gorisation de structures &#233;valuatives
</p>
<p>D&#233;tection La t&#226;che de d&#233;tection consiste &#224; annoter les segments &#233;valuatifs sans les cat&#233;go-
riser. Nous consid&#233;rons que ces segments sont d&#8217;un niveau intra-phrastique. Les phrases d&#8217;un
document sont donc trait&#233;es une par une. La strat&#233;gie du composant de d&#233;tection consiste &#224; :
&#8211; extraire les symboles de la phrase (et leurs traits) pour constituer une cha&#238;ne symbolique,
&#8211; tester l&#8217;unification des sous-cha&#238;nes symboliques avec les structures apprises, en commen&#231;ant
par les sous-cha&#238;nes les plus longues possibles et par le d&#233;but de la phrase,
</p>
<p>&#8211; cr&#233;er une annotation lorsqu&#8217;une cha&#238;ne s&#8217;unifie avec une structure (Si) de la grammaire.
Nous calculons un coefficient de confiance pour cette t&#226;che &#224; l&#8217;aide des m&#233;ta-donn&#233;es de Si
contenues dans la grammaire.
</p>
<p>&#945;detection(Si) =
Eval(Si)
</p>
<p>Eval(Si)+NonEval(Si)
</p>
<p>Eval(Si) : nombre d&#8217;occurrences de Si annot&#233;es dans le corpus d&#8217;entra&#238;nement
NonEval(Si) : nombre d&#8217;occurrences de Si non annot&#233;es dans le corpus d&#8217;entra&#238;nement
</p>
<p>Cat&#233;gorisation La cat&#233;gorisation consiste &#224; d&#233;terminer la modalit&#233;, la configuration &#233;noncia-
tive et l&#8217;axiologie de l&#8217;&#233;valuation d&#233;tect&#233;e pr&#233;alablement. Les m&#233;ta-donn&#233;es de Si stock&#233;es dans
la grammaire permet de calculer la meilleure probabilit&#233; pour la modalit&#233; et l&#8217;&#233;nonciation :
</p>
<p>&#945;catModalite(Si,Mj) =
Eval(Si,Mj)
</p>
<p>Eval(Si,Mj)+NonEval(Si,Mj)
</p>
<p>&#945;catConfigEnon(Si, appreciation, CEj) =
Eval(Si,appreciation,CEj)
</p>
<p>Eval(Si,appreciation,CEj)+NonEval(Si,appreciation,CEj)
</p>
<p>Eval(Si,Mj) : nombre d&#8217;occurrences de Si de modalit&#233;Mj lors de d&#8217;entra&#238;nement
NonEval(Si,Mj) : nombre d&#8217;occurrences de Si d&#8217;une autre modalit&#233; lors de l&#8217;entra&#238;nement
</p>
<p>Eval(Si, appreciation, CEj) : nombre d&#8217;occurrences de Si de type appr&#233;ciation ayant une configuration
d&#8217;&#233;nonciation CEj lors de d&#8217;entra&#238;nement</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vernier et al.
</p>
<p>La tournure de Si est donn&#233;e dans la grammaire, le composant d&#233;termine alors l&#8217;axiologie de
l&#8217;instance de Si rencontr&#233;e :
&#8211; structure directe : la polarit&#233; axiologique est identique &#224; celle du symbole axiologis&#233;,
&#8211; structure inverse : la polarit&#233; axiologique est inverse &#224; celle du symbole axiologis&#233;,
&#8211; structure fig&#233;e : la polarit&#233; axiologique est indiqu&#233;e dans les m&#233;ta-donn&#233;es de la structure.
Par exemple, Pas la plus belle est inversive, belle est positif donc l&#8217;&#233;valuation est n&#233;gative.
</p>
<p>5 Exp&#233;riences et r&#233;sultats
</p>
<p>Corpus Test Afin d&#8217;&#233;valuer la d&#233;tection et la cat&#233;gorisation des structures &#233;valuatives, un
corpus test a &#233;t&#233; &#233;labor&#233; et annot&#233; en se focalisant essentiellement sur les modalit&#233;s d&#8217;opinion,
d&#8217;accord-d&#233;saccord et d&#8217;appr&#233;ciation3. Les billets de ce corpus test ont &#233;t&#233; extraits &#224; partir de
l&#8217;utilisation des mots cl&#233;s suivants : Sarah Palin (25 billets) et Sushi (25 billets). Comme pour
le corpus d&#8217;entra&#238;nement, le corpus a &#233;t&#233; annot&#233; manuellement par un linguiste avec les m&#234;mes
contraintes : on d&#233;note 955 instances d&#8217;&#233;valuation. Dans la suite, nous allons &#233;valuer chaque
composant de notre outil de d&#233;tection et cat&#233;gorisation des &#233;valuations.
</p>
<p>D&#233;tection des &#233;valuations Dans un premier temps, nous &#233;valuons l&#8217;&#233;tape de d&#233;tection des
&#233;valuations sur le corpus test, sachant que nous n&#8217;avons aucune connaissance lexicale en amont
sur ce corpus. Nous consid&#233;rons une &#233;valuation comme correctement d&#233;tect&#233;e si l&#8217;&#233;valuation
est correctement d&#233;limit&#233;e (m&#234;me d&#233;limitation manuelle) ou si l&#8217;une des deux bornes est erro-
n&#233;e &#224; un ou deux mots d&#8217;&#233;carts par rapport &#224; l&#8217;annotation manuelle (l&#8217;accord inter-annotateur
sur les bornes n&#8217;est pas repr&#233;sentatif). Les structures symboliques apprises semblent &#234;tre des
indicateurs assez pr&#233;cis (88.4 % de pr&#233;cision) pour d&#233;tecter les &#233;valuations. Cependant de ma-
ni&#232;re pr&#233;visible, le rappel (50,1 %) chute fortement. Cela peut s&#8217;expliquer par la grande vari&#233;t&#233;
orthographique pr&#233;sente dans les blogs pour accentuer les &#233;valuations (ex : j&#8217;ad&#212;ooore), ou
par l&#8217;absence de connaissances s&#233;mantiques sur des adjectifs &#233;valuatifs non pr&#233;sents dans le
lexique de l&#8217;&#233;valuation (ex : t&#233;l&#233;g&#233;nique, puritaine) ou encore par la non connaissance de cer-
taines structures fig&#233;es particuli&#232;rement pr&#233;sentes dans les textes de Sarah Palin (ex : pittbull
aux l&#232;vres rouges, fibre &#233;colo).
</p>
<p>T&#226;che Pr&#233;cision Rappel
DETECTION 88,4% (478/541) 50,1% (478/955)
CATEGORISATION MODALITE - -
Opinion 88,0% (44/50) 100,0% (44/44)
Appreciation 100,0% (393/393) 99,0% (393/397)
Accord/D&#233;saccord 100,0% (35/35) 94,6% (35/37)
CATEGORISATION CONFIG. ENONCIATIVE - -
Explicite 89,6% (60/67) 96,8% (60/62)
Implicite 97,6% (290/297) 97,9% (290/296)
Exclamative 100,0% (29/29) 82,9% (29/35)
CATEGORISATION AXIOLOGIQUE - -
Favorable 93,3% (279/299) 97,6% (279/286)
D&#233;favorable 96,5% (83/86) 77,6% (83/107)
Ambigu&#235; 8 occurences
</p>
<p>TAB. 3 &#8211; Mesure des r&#233;sultats obtenus par l&#8217;outil d&#8217;analyse des blogs sur le corpus test.
</p>
<p>Cat&#233;gorisation de la modalit&#233; Dans un deuxi&#232;me temps, nous &#233;valuons l&#8217;outil de cat&#233;gori-
sation &#224; partir des &#233;valuations correctement d&#233;tect&#233;es. Nous observons (voir fig. 3) qu&#8217;il y a tr&#232;s
</p>
<p>3Nous regroupons les jugements et les appr&#233;ciations sous cette modalit&#233; de par leur forte proximit&#233; s&#233;mantique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cat&#233;gorisation s&#233;mantico-discursive des &#233;valuations dans la blogosph&#232;re
</p>
<p>peu d&#8217;ambigu&#239;t&#233; entre les diff&#233;rentes modalit&#233;s annot&#233;es. Les structures et les entit&#233;s lexicales
qui composent ces diff&#233;rents types d&#8217;&#233;valuation sont assez bien distincts. De ce fait, les r&#233;sultats
obtenus sont presque maximaux et viennent corroborer les d&#233;finitions th&#233;oriques donn&#233;es par
Charaudeau.
</p>
<p>Cat&#233;gorisation de la configuration d&#8217;&#233;nonciation La t&#226;che de cat&#233;gorisation de la configu-
ration d&#8217;&#233;nonciation des appr&#233;ciations fournit de bons r&#233;sultats (voir Tab.3). On ne s&#8217;int&#233;resse
ici qu&#8217;aux appr&#233;ciations correctement d&#233;tect&#233;es. Comme pour les modalit&#233;s, les structures sym-
boliques sont particuli&#232;rement diff&#233;rentes entre les appr&#233;ciations implicites et explicites. En
effet, l&#8217;absence de pronoms ou de verbes d&#8217;appr&#233;ciation implique souvent le fait que l&#8217;appr&#233;-
ciation soit implicite. L&#8217;ambigu&#239;t&#233; se situe plut&#244;t sur les appr&#233;ciations exclamatives puisque
souvent une phrase exclamative ne contient pas qu&#8217;une seule appr&#233;ciation d&#8217;o&#249; la difficult&#233; de
rattacher l&#8217;exclamation &#224; une seule ou toutes les appr&#233;ciations.
</p>
<p>Cat&#233;gorisation axiologique La t&#226;che de cat&#233;gorisation axiologique des appr&#233;ciations correc-
tement d&#233;tect&#233;es fournit &#233;galement des r&#233;sultats encourageants (voir fig.3). Suite &#224; la phase
d&#8217;entra&#238;nement, nous avions constat&#233; qu&#8217;il y avait en effet peu d&#8217;ambigu&#239;t&#233;s entre une tournure
inversive et une tournure directe des structures symboliques. Les r&#233;sultats montrent toutefois
que le rappel des appr&#233;ciations d&#233;favorables est plus faible, ce qui est d&#251; essentiellement &#224;
des structures inversives non apprises (ex : ce n&#8217;est pas chose facile) et &#224; la pr&#233;sence de cas
d&#8217;&#233;valuations ironiques (ex : Toujours aussi passionnant).
</p>
<p>6 Conclusion et perspectives
</p>
<p>L&#8217;outil de cat&#233;gorisation des &#233;valuations est tr&#232;s satisfaisant. Le plus difficile reste la d&#233;tec-
tion de celles ci, n&#233;cessitant notamment une am&#233;lioration automatique de la couverture lexicale.
Pour r&#233;aliser cet objectif, nous envisageons une m&#233;thode non supervis&#233;e pour apprendre de nou-
veaux termes et de nouvelles expressions fig&#233;es utilis&#233;es pour &#233;valuer. L&#8217;association fr&#233;quente
d&#8217;un terme ou d&#8217;une expression avec certaines structures grammaticales apprises (ex : c&#8217;est un
v&#233;ritable + NOM) est un indice permettant d&#8217;induire leur r&#244;le &#233;valuatif. En s&#8217;inspirant de Hat-
zivassiloglou et McKeown (1997), il est &#233;galement possible de d&#233;terminer automatiquement
la polarit&#233; axiologique des termes ainsi extraits. Un deuxi&#232;me axe de perspectives consiste &#224;
rechercher le concept sur lequel porte l&#8217;&#233;valuation en cherchant les groupes nominaux ou les
noms propres les plus pertinents dans le co-texte selon un algorithme proche de la r&#233;solution
d&#8217;anaphore. La m&#233;thode symbolique pour la fouille d&#8217;opinion pr&#233;sent&#233;e dans cet article permet
de d&#233;tecter et cat&#233;goriser l&#8217;axiologie positive ou n&#233;gative et le r&#244;le discursif des &#233;valuations ex-
prim&#233;es localement dans les blogs avec une bonne pr&#233;cision. La grammaire du langage &#233;valuatif
construite automatiquement contient environ 2800 r&#232;gles et permet de faire la distinction entre
des structures &#233;valuatives assez proches pouvant induire en erreur les approches sac-de-mots
classiques en fouille d&#8217;opinion. Les r&#232;gles de grammaire et les ressources lexicales d&#233;velopp&#233;es
peuvent ainsi &#234;tre appliqu&#233;es sur des corpus dont la th&#233;matique n&#8217;est pas fix&#233;e en amont sans
perdre en pr&#233;cision. Ces travaux s&#8217;inscrivent dans le projet BLOGOSCOPIE, soutenu par le
programme Technologies Logicielles 2006 de l&#8217;ANR et r&#233;alis&#233; en collaboration avec Syllabs,
Sinequa et Over-Blog.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vernier et al.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ANSCOMBRE J. &amp; DUCROT O. (1983). L&#8217;argumentation dans la langue. Pierre Mardag.
AUE A. &amp; GAMON M. (2005). Customizing sentiment classifiers to new domains : A case
study. In Recent Advances in Natural Language Processing (RANLP).
BLITZER J., DREDZE M. &amp; PEREIRA F. (2007). Biographies, Bollywood, boom-boxes and
blenders : Domain adaptation for sentiment classification. In Proceedings of the 45th Annual
Meeting of the Association for Computational Linguistics (ACL 2007), p. 440&#8211;447.
CHARAUDEAU P. (1992). Grammaire du sens et de l&#8217;expression. Hachette Education, COM-
MUNICATION, PARA UNIVERSITAIRE.
DAVE K., LAWRENCE S. &amp; PENNOCK D. M. (2003). Mining the peanut gallery : Opinion
extraction and semantic classification of product reviews. In Proceedings of the 12th World
Wide Web Conference (WWW 2003), p. 519&#8211;528.
DUBREIL E., VERNIER M., MONCEAUX L. &amp; DAILLE B. (2008). Annotating opinion -
evaluation of blogs. In Workshop of LREC 2008 Conference, Sentiment Analysis : Metaphor,
Ontology and Terminology (EMOT-08), p. 124.
GALATANU O. (2000). Signification, sens, formation. In Education et Formation, Biennales
de l&#8217;&#233;ducation, (sous la direction de Jean-Marie Barbier, d&#8217;Olga Galatanu), Paris : PUF.
HU M. &amp; LIU B. (2004). Mining opinion features in customer reviews. In Proceedings of
the 19th National Conference on Artificial Intelligence, p. 755&#8211;760 : AAAI Press / The MIT
Press.
KERBRAT-ORECCHIONI C. (1997). L&#8217;&#233;nonciation, de la subjectivit&#233; dans le langage. Colin
(&#233;dition 2002).
LAVELLE L. (1950). Trait&#233; des valeurs, volume tome 1. PUF.
MARTIN J. &amp; WHITE P. (2005). The Language of Evaluation, Appraisal in English. Palgrave
Macmillan.
MAUREL S., CURTONI P. &amp; DINI L. (2008). L&#8217;analyse des sentiments dans les forums. In
actes de l&#8217;atelier FODOP&#8217;08 (fouille de donn&#233;es d&#8217;opinions) (INFORSID&#8217;08), p. 111&#8211;117.
MISHNE G. &amp; GLANCE N. (2006). Predicting movie sales from blogger sentiment. In AAAI
Symposium on Computational Approaches to Analysing Weblogs (AAAI-CAAW), p. 155&#8211;158.
MULLEN T. &amp; MALOUF R. (2006). A preliminary investigation into sentiment analysis of
informal political discourse. In AAAI Symposium on Computational Approaches to Analysing
Weblogs (AAAI-CAAW), p. 159&#8211;162.
NIGAM K. &amp; HURST M. (2006). Towards a robust metric of polarity. In J. G. SHANAHAN,
Y. QU &amp; J. WIEBE, Eds., Computing Attitude and Affect in Text : Theories and Applications,
number 20 in the Information Retrieval Series : Springer.
PANG B., LEE L. &amp; VAITHYANATHAN S. (2002). Thumbs up ? sentiment classification using
machine learning techniques. In Proceedings of the Conference on Empirical Methods in
Natural Language Processing (EMNLP 2002), p. 79&#8211;86.
STERN R. (2008). Constitution d&#8217;un lexique de sentiment. InM&#233;moire deMaster de Recherche
Linguistique-Informatique : Universit&#233; Paris 7.
WHITELAW C., GARG N. &amp; ARGAMON S. (2005). Using appraisal groups for sentiment
analysis. In Proceedings of the ACM SIGIR Conference on Information and Knowledge Ma-
nagement (CIKM), p. 625&#8211;631 : ACM.</p>

</div></div>
</body></html>