<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une m&#233;thodologie d&#8217;annotation des entit&#233;s nomm&#233;es en corpus ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Vers une m&#233;thodologie d&#8217;annotation des entit&#233;s nomm&#233;es en
corpus ?
</p>
<p>Kar&#235;n Fort1, 3 Maud Ehrmann2 Adeline Nazarenko3
</p>
<p>(1) INIST, 2 all&#233;e du Parc de Brabois, 54500 Vandoeuvre-l&#232;s-Nancy
karen.fort@inist.fr
</p>
<p>(2) XRCE, 6 Chemin de Maupertuis, 38240 Meylan
maud.ehrmann@xrce.xerox.com
</p>
<p>(3) LIPN, Universit&#233; Paris 13 &amp; CNRS, 99 av. J.B. Cl&#233;ment, 93430
Villetaneuse
</p>
<p>adeline.nazarenko@lipn.univ-paris13.fr
</p>
<p>R&#233;sum&#233;. La t&#226;che, aujourd&#8217;hui consid&#233;r&#233;e comme fondamentale, de reconnaissance d&#8217;en-
tit&#233;s nomm&#233;es, pr&#233;sente des difficult&#233;s sp&#233;cifiques en mati&#232;re d&#8217;annotation. Nous les pr&#233;cisons
ici, en les illustrant par des exp&#233;riences d&#8217;annotation manuelle dans le domaine de la microbi-
ologie. Ces probl&#232;mes nous am&#232;nent &#224; reposer la question fondamentale de ce que les anno-
tateurs doivent annoter et surtout, pour quoi faire. Nous identifions pour cela les applications
n&#233;cessitant l&#8217;extraction d&#8217;entit&#233;s nomm&#233;es et, en fonction des besoins de ces applications, nous
proposons de d&#233;finir s&#233;mantiquement les &#233;l&#233;ments &#224; annoter. Nous pr&#233;sentons ensuite un cer-
tain nombre de recommandations m&#233;thodologiques permettant d&#8217;assurer un cadre d&#8217;annotation
coh&#233;rent et &#233;valuable.
</p>
<p>Abstract. Today, the named entity recognition task is considered as fundamental, but it
involves some specific difficulties in terms of annotation. We list them here, with illustrations
taken from manual annotation experiments in microbiology. Those issues lead us to ask the fun-
damental question of what the annotators should annotate and, even more important, for which
purpose. We thus identify the applications using named entity recognition and, according to the
real needs of those applications, we propose to semantically define the elements to annotate.
Finally, we put forward a number of methodological recommendations to ensure a coherent and
reliable annotation scheme.
</p>
<p>Mots-cl&#233;s : annotation, reconnaissance d&#8217;entit&#233;s nomm&#233;es.
</p>
<p>Keywords : annotation, named entities extraction.
</p>
<p>1 Introduction
</p>
<p>Si l&#8217;extraction d&#8217;entit&#233;s nomm&#233;es (EN), apparue au milieu des ann&#233;es 1990 &#224; la faveur des
derni&#232;res conf&#233;rences MUC1, fait aujourd&#8217;hui figure d&#8217;incontournable en Traitement Automa-
tique des Langues (TAL), l&#8217;annotation de corpus qui la sous-tend est encore peu &#233;tudi&#233;e en tant
</p>
<p>1Message Understanding Conferences, (MUC, 1995), (MUC, 1998)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Maud Ehrmann, Adeline Nazarenko
</p>
<p>que telle. Les enjeux de l&#8217;annotation manuelle sont pourtant importants. Qu&#8217;il s&#8217;agisse de la
performance des syst&#232;mes mis au point (&#224; partir d&#8217;un travail de mod&#233;lisation ou d&#8217;apprentis-
sage automatique sur corpus), de l&#8217;&#233;valuation de ces derniers, ou encore de la bonne r&#233;ponse
apport&#233;e &#224; des besoins applicatifs, l&#8217;annotation de corpus est une composante fondamentale.
Au c&#339;ur des divers processus constituant la reconnaissance d&#8217;entit&#233;s nomm&#233;es (REN), nous
souhaitons examiner de plus pr&#232;s la probl&#233;matique de l&#8217;annotation manuelle, laquelle conduit &#224;
s&#8217;interroger sur ce que sont les entit&#233;s nomm&#233;es et ce &#224; quoi elles servent.
</p>
<p>Nous pr&#233;sentons cette pratique &#233;tablie qu&#8217;est aujourd&#8217;hui l&#8217;annotation d&#8217;EN (2) puis nous en
d&#233;taillons les principales difficult&#233;s (3), aussi bien sur des textes de langue g&#233;n&#233;rale que de
sp&#233;cialit&#233;. Nous examinons ensuite les applications dans lesquelles les EN sont utilis&#233;es et en
d&#233;duisons les diff&#233;rents types d&#8217;annotation (4). Enfin, nous proposons des recommandations
m&#233;thodologiques permettant d&#8217;assurer un cadre d&#8217;annotation coh&#233;rent et &#233;valuable (5).
</p>
<p>2 Annotation d&#8217;entit&#233;s nomm&#233;es, une pratique &#233;tablie
</p>
<p>La reconnaissance d&#8217;entit&#233;s nomm&#233;es est une t&#226;che bien connue : initi&#233;e il y a une ving-
taine d&#8217;ann&#233;es &#224; l&#8217;occasion des conf&#233;rences am&#233;ricaines MUC, elle fut rapidement reprise lors
d&#8217;autres campagnes d&#8217;&#233;valuation, suscitant des travaux toujours plus nombreux. Sans revenir
ici sur le &#8220; succ&#232;s&#8221; de cette t&#226;che (Nadeau &amp; Sekine, 2007), on peut retracer son &#233;volution selon
trois directions principales. La premi&#232;re correspond &#224; des travaux dans le domaine &#8220; g&#233;n&#233;ral &#8221;,
avec la poursuite de la t&#226;che d&#233;finie par MUC pour d&#8217;autres langues que l&#8217;anglais, selon un
jeu de cat&#233;gories plus ou moins revisit&#233; et pour annoter des entit&#233;s dans des corpus de nature
journalistique essentiellement2. La seconde direction concerne des travaux dans des domaines
dits &#8220; de sp&#233;cialit&#233; &#8221;, avec la reconnaissance d&#8217;entit&#233;s dans les domaines de la m&#233;decine, de la
chimie ou de la microbiologie. Il fut ainsi propos&#233; de reconna&#238;tre des noms de g&#232;nes, de pro-
t&#233;ines, etc. dans de la litt&#233;rature sp&#233;cialis&#233;e, lors des campagnes JNLPBA (Kim et al., 2004) et
BioCreAtIvE (Hirschman et al., 2005). La derni&#232;re direction, transversale aux domaines g&#233;n&#233;ral
et de sp&#233;cialit&#233;, correspond &#224; des travaux sur la d&#233;sambigu&#239;sation : r&#233;solution de m&#233;tonymie des
EN dans SemEval2007 (Markert &amp; Nissim, 2007) et d&#233;sambigu&#239;sation de noms de personnes
(Artiles et al., 2007)3.
</p>
<p>A l&#8217;occasion de chacune de ces campagnes, des corpus furent constitu&#233;s et annot&#233;s manuelle-
ment. De mani&#232;re g&#233;n&#233;rale, ces corpus annot&#233;s servent &#224; la mise au point d&#8217;outils d&#8217;annotation
automatique. &quot;Mise au point&quot; est &#224; entendre ici au sens large : il s&#8217;agit de d&#233;crire le plus pr&#233;cis&#233;-
ment possible ce que les syst&#232;mes doivent faire pour guider le travail d&#8217;&#233;criture des r&#232;gles sur
lesquelles ils reposent, pour apprendre automatiquement ces r&#232;gles de fonctionnement ou des
crit&#232;res de d&#233;cision et, enfin, pour &#233;valuer les r&#233;sultats obtenus en les confrontant &#224; une analyse
de r&#233;f&#233;rence. Le processus d&#8217;annotation met en jeu deux acteurs, un annotateur et un texte, et
aboutit &#224; une annotation du texte dont la qualit&#233; doit r&#233;pondre &#224; une m&#233;thodologie et supporter
un protocole d&#8217;&#233;valuation, et le contenu suivre un guide d&#8217;annotation.
</p>
<p>Pour le domaine g&#233;n&#233;ral, les campagnes MUC, CoNLL et ACE ont travaill&#233; avec des cor-
pus issus de la presse. Ces campagnes semblent avoir port&#233; attention au processus d&#8217;annota-
tion manuelle des EN, avec la r&#233;daction de guides d&#8217;annotation et des calculs d&#8217;accord inter-
annotateurs (mais non intra-annotateur), proc&#233;dant par allers-retours entre le corpus &#224; annoter et
</p>
<p>2Voir les campagnes d&#8217;&#233;valuation MET, IREX, CoNNL, ACE, ESTER et HAREM (Ehrmann, 2008, pp. 19-21).
3La campagne Web People Search fut par la suite r&#233;&#233;dit&#233;e, voir http://nlp.uned.es/weps/.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une m&#233;thodologie d&#8217;annotation des entit&#233;s nomm&#233;es en corpus ?
</p>
<p>le guide d&#8217;annotation &#224; r&#233;viser, mais des points d&#8217;h&#233;sitations ont perdur&#233; quant &#224; l&#8217;annotation,
dus principalement &#224; &#8220; different interpretations of vague portions of the guidelines &#8221; (Sundheim,
1995) o&#249; &#224; des ph&#233;nom&#232;nes de superposition de sens (Doddington et al., 2004). Dans les do-
maines de la biologie et de la biomedecine, des textes des bases de donn&#233;es de publications
scientifiques (PubMed et MedLine4) ont &#233;t&#233; annot&#233;s : on observe que les guides d&#8217;annotation &#8211;
quand ils existent5 &#8211; laissent des zones d&#8217;ombre quant &#224; la mani&#232;re d&#8217;annoter les entit&#233;s et que
peu d&#8217;&#233;tudes ont port&#233; sur la qualit&#233; de l&#8217;annotation. Que ce soit pour les corpus GENIA (Kim
et al., 2003), PennBioIE (Kulick et al., 2004) ou GENETAG (Tanabe et al., 2005), aucun accord
inter ou intra-annotateur n&#8217;est rapport&#233;. A la fin de leur exp&#233;rience d&#8217;annotation, les auteurs de
(Tanabe et al., 2005) constatent que &#8220; a more detailed definition of a gene/protein name, as well
as additional annotation rules, could improve interannotator agreement and help solve some of
the tagging inconsistencies &#8221;.
</p>
<p>On observe par ailleurs des pratiques d&#8217;annotation manuelle et une r&#233;flexion m&#233;thodologique
int&#233;ressantes dans d&#8217;autres domaine du TAL, notamment dans les travaux issus de la commu-
naut&#233; parole (Gut &amp; Bayerl, 2004). La campagne EVALDA MEDIA (Bonneau-Maynard et al.,
2005), par exemple, a mis en oeuvre une annotation manuelle de corpus en deux passes, la pre-
mi&#232;re sur un &#233;chantillon pour faire le point sur les &#233;ventuels d&#233;saccords entre annotateurs, et
une seconde grandeur nature, apr&#232;s r&#233;ajustement des guides d&#8217;annotation.
</p>
<p>3 Difficult&#233;s rencontr&#233;es dans l&#8217;annotation
</p>
<p>Pour les corpus de langue g&#233;n&#233;rale, un certain nombre de difficult&#233;s sont identifi&#233;es (Ehrmann,
2008). La premi&#232;re concerne le choix des cat&#233;gories et la d&#233;termination de ce qu&#8217;elles recou-
vrent. En effet, au-del&#224; de la triade &#8220;universelle&#8221; d&#233;finie par MUC (PERSONNE, LIEU et ORGAN-
ISATION), l&#8217;inventaire des cat&#233;gories &#224; annoter est difficile &#224; stabiliser et &#224; d&#233;finir. Prenons l&#8217;ex-
emple de la cat&#233;gorie PERSONNE : s&#8217;il est &#233;vident qu&#8217;un nom d&#8217;individu tel que Lionel Jospin
est &#224; annoter &#224; l&#8217;aide de cette cat&#233;gorie, que faut-il faire des Kennedys, de Zorro, des D&#233;mocrates
ou de St. Nicolas ? Pour les autres cat&#233;gories, il est &#233;galement difficile de choisir la granular-
it&#233; des cat&#233;gories et de d&#233;terminer ce qu&#8217;elles recouvrent vraiment. Un autre type de difficut&#233;
concerne la s&#233;lection des mentions &#224; annoter ainsi que la d&#233;limitation des fronti&#232;res des EN.
A titre d&#8217;exemple, consid&#233;rons l&#8217;EN &#8220;Barack Obama&#8221; et les diverses unit&#233;s lexicales suivantes
permettant d&#8217;y faire r&#233;f&#233;rence : Barack Obama, Monsieur Obama, le Pr&#233;sident des Etats-Unis,
le nouveau pr&#233;sident, il. Faut-il annoter les noms propres uniquement, ou peut-on &#233;galement
consid&#233;rer les descriptions d&#233;finies permettant d&#8217;identifier cette personne, voire les pronoms
qui, contextuellement, y renvoient ? Et que fait-on des diff&#233;rents attributs accompagnant l&#8217;EN
(&#8220;monsieur&#8221; et &#8220;pr&#233;sident&#8221;) ? De nombreux autres cas, plus ou moins compliqu&#233;s (la Maire du
7e arrondissement de Paris et Garde des Sceaux Rachida Dati) se rencontrent en corpus. Dans
le m&#234;me ordre d&#8217;id&#233;e, des ph&#233;nom&#232;nes de coordination et d&#8217;imbrication peuvent poser prob-
l&#232;me aux annotateurs (une ou plusieurs entit&#233;s pour Bill et Hillary Clinton et l&#8217;Universit&#233; de
Corte ?). Enfin, une derni&#232;re difficult&#233; r&#233;sulte de ph&#233;nom&#232;nes de pluralit&#233; r&#233;f&#233;rentielle, avec des
EN homonymes (Orange ville et Orange compagnie) et des glissements m&#233;tonymiques, parfois
difficiles &#224; distinguer (France en tant que lieu g&#233;ographique, gouvernement ou &#233;quipe sportive).
M&#234;me si elles sont surmontables gr&#226;ce aux guides d&#8217;annotation, ces difficult&#233;s entra&#238;nent un
co&#251;t suppl&#233;mentaire et une baisse de qualit&#233; de l&#8217;annotation.
</p>
<p>4Respectivement : http://www.ncbi.nlm.nih.gov/pubmed/ et http://medline.cos.com/
5Certaines campagnes comme JNLPBA et BioCreAtIvE I n&#8217;en ont pas fourni.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Maud Ehrmann, Adeline Nazarenko
</p>
<p>Notre exp&#233;rience en microbiologie montre que ces difficult&#233;s sont plus aigu&#235;s encore dans les
langues de sp&#233;cialit&#233;. Une exp&#233;rience d&#8217;annotation a &#233;t&#233; r&#233;alis&#233;e &#224; l&#8217;INIST pour le programme
Quaero, en collaboration avec l&#8217;&#233;quipe MIG. Un corpus anglais de 499 notices PubMed (titres
et r&#233;sum&#233;s, soit environ 110 000 &#8220;mots&#8221;), pr&#233;-annot&#233;es par application d&#8217;un dictionnaire et d&#8217;un
anti-dictionnaire, a &#233;t&#233; fourni &#224; deux experts de l&#8217;INIST, dont le travail a consist&#233; en une r&#233;vision
de ces pr&#233;-annotations. La principale difficult&#233; rencontr&#233;e a concern&#233; la distinction qui &#233;tait de-
mand&#233;e entre noms propres et noms communs, la limite morphologique entre les deux &#233;tant peu
marqu&#233;e dans ces domaines o&#249; les noms communs sont souvent reclass&#233;s comme &quot;noms pro-
pres&quot;, comme en atteste la pr&#233;sence de ces noms dans des nomenclatures (&#8220;small, acid-soluble
spore protein A&#8221; est ici un cas extr&#234;me) ou les ph&#233;nom&#232;nes d&#8217;acronymisation (on trouve par
exemple &quot;across the outer membrane (OM)&quot;). Dans ces cas, la consigne donn&#233;e aux annota-
teurs &#233;tait de se r&#233;f&#233;rer &#224; des listes d&#8217;autorit&#233;, telle que Swiss-Prot6, ce qui entra&#238;ne une perte de
temps cons&#233;quente. La d&#233;limitation des fronti&#232;res des &#233;l&#233;ments &#224; annoter a elle-aussi soulev&#233; de
nombreux questionnements, les annotateurs se demandant ce qu&#8217;il fallait inclure ou non dans le
segment annot&#233;. On peut ainsi choisir d&#8217;annoter &#8220;nifh messenger RNA&quot; si on consid&#232;re que la
mention de l&#8217;&#233;tat &quot;messenger RNA&quot; entre dans la d&#233;termination de la r&#233;f&#233;rence, ou seulement
&#8220;nifh&#8221;, si on consid&#232;re que le nom propre suffit &#224; construire la r&#233;f&#233;rence. Le typage s&#233;mantique
choisi a aussi pos&#233; probl&#232;me aux annotateurs, notamment pour les &#233;l&#233;ments g&#233;n&#233;tiques mobiles,
comme les plasmides ou les transposons. En effet, ceux-ci devaient &#234;tre annot&#233;s dans les taxons
et non dans les genes alors que ce sont des fragments d&#8217;ADN, donc des parties de g&#233;nome. Une
directive particuli&#232;rement perturbante pour les annotateurs a &#233;t&#233; d&#8217;annoter l&#8217;acronyme &#8220;KGFR&#8221;
comme nom propre et sa forme d&#233;velopp&#233;e &#8220;keratinocyte growth factor receptor&#8221; comme nom
commun. Ce type de consigne, pr&#233;conis&#233;e au d&#233;part pour entra&#238;ner plus efficacement les outils
de REN (N&#233;dellec et al., 2006), est difficile &#224; appr&#233;hender et aurait d&#251; &#234;tre mieux document&#233;e.
</p>
<p>Ces probl&#232;mes se traduisent par un co&#251;t d&#8217;annotation &#233;lev&#233;, des guides d&#8217;annotation de taille
trop grande par rapport au corpus et trop d&#8217;h&#233;sitations de la part des annotateurs, ce qui induit
des incoh&#233;rences et une qualit&#233; moindre de l&#8217;annotation. Cette exp&#233;rience nous a ainsi permis
de reposer la question de ce que les annotateurs doivent annoter et surtout, pour quoi faire.
</p>
<p>4 Annoter quoi ?
</p>
<p>Pour mieux comprendre &quot;quoi annoter dans quel texte&quot;, nous revenons sur les crit&#232;res linguis-
tiques qui permettent de d&#233;finir la notion d&#8217;EN : l&#8217;importance de ces crit&#232;res varie d&#8217;une appli-
cation &#224; l&#8217;autre et les annotations r&#233;sultantes en d&#233;pendent.
</p>
<p>4.1 Diff&#233;rents crit&#232;res d&#233;finitoires
</p>
<p>(Ehrmann, 2008) propose une analyse linguistique de la notion d&#8217;EN qu&#8217;elle pr&#233;sente comme
une &quot;cr&#233;ation&quot; du TAL. Dans ce qui suit, nous reprenons la distinction introduite dans (LDC,
2004) : les EN sont des &quot;mentions&quot; qui renvoient &#224; des &quot;entit&#233;s&quot; du domaine, ces mentions
pouvant relever de diff&#233;rentes cat&#233;gories linguistiques : des noms propres (&quot;Rabelais&quot;), mais
aussi les pronoms (&quot;il&quot;), et plus largement des descriptions d&#233;finies (&quot;le p&#232;re de Gargantua&quot;).
On peut identifier plusieurs crit&#232;res d&#233;finitoires des EN.
</p>
<p>6http://www.expasy.org/sprot/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une m&#233;thodologie d&#8217;annotation des entit&#233;s nomm&#233;es en corpus ?
</p>
<p>Unicit&#233; r&#233;f&#233;rentielle L&#8217;une des caract&#233;ristiques principales des noms propres est leur fonction-
nement r&#233;f&#233;rentiel : un nom propre renvoie &#224; une entit&#233; r&#233;f&#233;rentielle unique, m&#234;me si cette
unicit&#233; est contextelle. A la diff&#233;rence de (Poibeau, 2005), nous consid&#233;rons que cette propri&#233;t&#233;
est essentielle dans l&#8217;utilisation que fait le TAL des EN.
</p>
<p>Autonomie r&#233;f&#233;rentielle Les EN sont de surcro&#238;t autonomes du point de vue r&#233;f&#233;rentiel. C&#8217;est
&#233;vident dans le cas du nom propre qui permet &#224; lui seul l&#8217;identification du r&#233;f&#233;rent, tout au moins
dans une situation de communication donn&#233;e (Eurotunnel). Le cas des descriptions d&#233;finies
(l&#8217;op&#233;rateur du tunnel sous la Manche) est un peu diff&#233;rent : si elles suffisent &#224; identifier le
r&#233;f&#233;rent, c&#8217;est par le truchement de connaissances ext&#233;rieures.
</p>
<p>Stabilit&#233; d&#233;nominative Les noms propres sont &#233;galement des d&#233;nominations stables. M&#234;me s&#8217;il
y a des variations (Angela Merkel/Mme Merkel/A. Merkel), elles sont plus r&#233;guli&#232;res et moins
nombreuses que pour les autres syntagmes nominaux7.
</p>
<p>Relativit&#233; r&#233;f&#233;rentielle L&#8217;interpr&#233;tation se fait toujours relativement &#224; un mod&#232;le du domaine,
qui peut &#234;tre implicite dans les cas simples (on suppose une connaissance partag&#233;e de ce qu&#8217;est
une personne ou un pays) mais qui doit &#234;tre explicit&#233; d&#232;s que la diversit&#233; des entit&#233;s &#224; prendre
en compte s&#8217;accro&#238;t (il faut au moins une typologie pour les cat&#233;goriser).
</p>
<p>4.2 Diff&#233;rentes vis&#233;es applicatives
</p>
<p>La REN voit le jour dans un cadre d&#8217;extraction d&#8217;information o&#249; il s&#8217;agit d&#8217;identifier les actants
de certaines situations (des attentats aux interactions g&#233;niques), cette situation &#233;tant d&#233;crite par
un formulaire &#224; instancier avec les informations extraites du texte. La s&#233;mantique sous-jacente
est clairement r&#233;f&#233;rentielle : on identifie dans le texte les &quot;mentions&quot; des &quot;entit&#233;s&quot; qui jouent un
r&#244;le dans les situations consid&#233;r&#233;es (LDC, 2004). Dans les syst&#232;mes de questions/r&#233;ponses, les
EN jouent le m&#234;me r&#244;le mais on a souvent recours &#224; des typologies plus fines8.
</p>
<p>Les EN sont &#233;galement utilis&#233;es comme &quot;descripteurs&quot; dans de nombreuses applications d&#8217;in-
dexation. On a des index de noms propres dans certains ouvrages et moteurs de recherche et on
sait qu&#8217;une importante proportion des requ&#234;tes adress&#233;es aux moteurs de recherche sont des EN.
On surligne les EN pour aider la lecture ou la navigation dans de gros volumes documentaires.
On utilise enfin la REN pour construire et mettre &#224; jour des nomenclatures (Tran &amp; Maurel,
2006) utilis&#233;es pour l&#8217;indexation, la traduction, etc. Dans ce deuxi&#232;me type d&#8217;application aussi,
la s&#233;mantique sous-jacente est r&#233;f&#233;rentielle : si les EN sont de bons descripteurs, c&#8217;est qu&#8217;elles
fonctionnent comme des ancres r&#233;f&#233;rentielles qui permettent de situer ce &#224; quoi le texte fait
r&#233;f&#233;rence9. En revanche, on s&#8217;int&#233;resse exclusivement aux mentions de type nom propre.
</p>
<p>Troisi&#232;me type d&#8217;applications, les EN sont utilis&#233;es pour l&#8217;int&#233;gration de donn&#233;es. Cela con-
cerne &#224; la fois l&#8217;analyse des bases documentaires (suivi de th&#232;mes, d&#233;couverte de communaut&#233;s
de pratiques (Li &amp; Liu, 2005) et l&#8217;articulation des documents avec d&#8217;autres sources de connais-
sances (bases de donn&#233;es, bases d&#8217;images, etc.) pour interroger les unes et les autres de mani&#232;re
homog&#232;ne et naviguer facilement de l&#8217;une &#224; l&#8217;autre (Dragos &amp; Nazarenko, 2009). On s&#8217;appuie
alors sur les EN r&#233;f&#233;renc&#233;es dans les bases de donn&#233;es pour &#233;tablir des liens entre les diff&#233;rentes
sources. Pour ces t&#226;ches d&#8217;int&#233;gration, on se contente des EN qui figurent dans les nomencla-
</p>
<p>7Ceci explique a contrario l&#8217;importance du rep&#233;rage de la synonymie dans les domaines o&#249; les d&#233;nominations
sont peu stables (la g&#233;nomique, par exemple).
</p>
<p>8Ce qui pose des probl&#232;mes de d&#233;sambigu&#239;sation et de r&#233;solution des m&#233;tonymies.
9Deux noms propres (AZF et septembre 2001) suffisent souvent &#224; faire comprendre de quoi parle une d&#233;p&#234;che !</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Maud Ehrmann, Adeline Nazarenko
</p>
<p>tures, l&#8217;objectif &#233;tant d&#8217;articuler les sources entre elles et pas d&#8217;en d&#233;crire le contenu : il suffit
de savoir qu&#8217;une d&#233;p&#234;che parle de Nelson Mandela, inutile de trouver toutes les mentions qui
en sont faites dans le texte.
</p>
<p>L&#8217;anonymisation des documents est un quatri&#232;me champ d&#8217;application (Plamondon et al., 2004).
On veut &#233;viter qu&#8217;on puisse identifier des entit&#233;s (des personnes, notamment) &#224; partir des men-
tions qui en sont faites dans le texte. Il faut rep&#233;rer toutes les formes de mentions (la ville qui a
re&#231;u la premi&#232;re bombe atomique) et pas seulement les noms propres.
</p>
<p>Derni&#232;re famille d&#8217;applications, la REN est utilis&#233;e pour &quot;peupler&quot; des ontologies. Il s&#8217;agit alors
de mod&#233;liser un domaine, et le mod&#232;le formel des ontologies impose de distinguer les entit&#233;s
du domaine, qui sont repr&#233;sent&#233;es comme des instances, des concepts ou classes auxquelles
ces instances se rattachent. La REN est alors utilis&#233;e pour enrichir la structure conceptuelle
avec des instances de concepts ou de r&#244;les (relations entre instances) (Amardeilh et al., 2005).
Selon les cas, on privil&#233;gie les entit&#233;s nomm&#233;es ou on s&#8217;int&#233;resse &#224; toutes les mentions d&#8217;entit&#233;s.
Dans le premier cas, l&#8217;ontologie r&#233;sultante peut &#234;tre vue comme une nomenclature hi&#233;rarchis&#233;e
ou comme un thesaurus formalis&#233;. Dans le second, on cherche &#224; mod&#233;liser un domaine en
identifiant les entit&#233;s qui le composent et les relations qu&#8217;elles entretiennent. Dans les deux
cas, le typage des EN est essentiel parce qu&#8217;on doit relier l&#8217;instance nomm&#233;e &#224; un concept de
l&#8217;ontologie.
</p>
<p>4.3 Des perspectives d&#8217;annotation diff&#233;rentes
</p>
<p>Les crit&#232;res d&#233;finitoires cit&#233;s en 4.1 ne jouent pas tous le m&#234;me r&#244;le pour toutes les applica-
tions. Dans certains cas (indexation et int&#233;gration de connaissances), on s&#8217;int&#233;resse &#224; des entit&#233;s
r&#233;f&#233;rentielles qui sont d&#233;sign&#233;es par des descripteurs stables et non ambigus. Ce sont donc les
EN de type noms propres ou &quot;catalogables&quot; qui sont &#224; retenir et il est important de les normaliser
pour s&#8217;affranchir des variations qui peuvent appara&#238;tre malgr&#233; leur stabilit&#233; r&#233;f&#233;rentielle. Pour
ce type d&#8217;application, l&#8217;essentiel n&#8217;est pas de rep&#233;rer toutes les mentions de telle entit&#233; dans un
document mais de rep&#233;rer que ce document mentionne telle entit&#233;. Il faut donc privil&#233;gier la
pr&#233;cision sur le rappel de l&#8217;annotation.
</p>
<p>A l&#8217;autre extr&#234;me, on trouve les t&#226;ches d&#8217;extraction d&#8217;information et de mod&#233;lisation du do-
maine o&#249; toutes les mentions sont importantes &#224; rep&#233;rer, y compris celles qui sont des descrip-
tions d&#233;finies (il faut d&#8217;ailleurs rep&#233;rer des relations de cor&#233;f&#233;rence entre les mentions qui ne
sont pas suffisamment autonomes r&#233;f&#233;rentiellement). La figure 1 montre l&#8217;impact de ces deux
perspectives d&#8217;annotation sur les r&#233;sultats de l&#8217;annotation d&#8217;un tout petit exemple10.
</p>
<p>Comme il est impossible de rep&#233;rer les mentions de toutes les entit&#233;s r&#233;f&#233;rentielles, le mod&#232;le
du domaine d&#233;termine quelles sont les entit&#233;s &quot;d&#8217;int&#233;r&#234;t&quot; et la limite entre ce qui doit ou non
&#234;tre annot&#233;. Illustrons ce point sur un exemple. Quand un directeur des ressources humaines
s&#8217;int&#233;resse aux grilles salariales de son organisation, il raisonne sur des cat&#233;gories de personnels
et pas sur les personnes physiques que sont les employ&#233;s. Cela se refl&#232;te dans le mod&#232;le du
domaine : les diff&#233;rentes cat&#233;gories de personnes (techniciens, ing&#233;nieurs, etc.) sont mod&#233;lis&#233;es
comme des instances rattach&#233;es au concept CAT-DE-PERSONNEL et les personnes physiques ne
sont pas repr&#233;sent&#233;es. A l&#8217;inverse, quand il s&#8217;occupe des fiches de paye et de la progression
des employ&#233;s, il s&#8217;int&#233;resse aux individus. Dans ce cas, le mod&#232;le doit consid&#233;rer les personnes
comme instances et les cat&#233;gories de personnels comme des concepts. Le m&#234;me probl&#232;me se
</p>
<p>10http ://www.ncbi.nlm.nih.gov/pubmed/1331532</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une m&#233;thodologie d&#8217;annotation des entit&#233;s nomm&#233;es en corpus ?
</p>
<p>ANNOTATION D&#8217;INDEXATION ; types gene et protein
We conclude that &lt;gene&gt;3CDproM&lt;/gene&gt; can process both structural and nonstructural precursors of the &lt;EukVirus
uncertainty-type=&quot;too-generic&quot;&gt;poliovirus polyprotein&lt;/EukVirus&gt; and that it is active against a synthetic peptide substrate.
</p>
<p>ANNOTATION DE MOD&#201;LISATION ; types taxon, gene et protein
We conclude that &lt;EukVirus&gt;3CDproM&lt;/EukVirus&gt; can process both structural and nonstructural precursors of the &lt;EukVirus
uncertainty-type=&quot;too-generic&quot;&gt;&lt;taxon&gt;poliovirus&lt;/taxon&gt; polyprotein&lt;/EukVirus&gt; and that &lt;EukVirus&gt;it&lt;/EukVirus&gt; is active
against a synthetic peptide substrate.
</p>
<p>FIG. 1 &#8211; Exemple d&#8217;annotation en biologie. La premi&#232;re annotation est moins riche que la seconde qui
consid&#232;re plus de types s&#233;mantiques (taxon) avec une granularit&#233; plus fine (EuKVirus is a subtype
of gene), ce qui introduit des ench&#226;ssements de balises. Par ailleurs, toutes les mentions sont annot&#233;es
dans la seconde annotation alors que seuls les assimil&#233;s noms propres le sont dans la premi&#232;re.
</p>
<p>rencontre en biologie o&#249; la mention du g&#232;ne G peut renvoyer au g&#232;ne G de l&#8217;esp&#232;ce E, au g&#232;ne
G d&#8217;un individu de l&#8217;esp&#232;ce E ou &#224; un g&#232;ne particulier parmi les g&#232;nes G de cet individu.
</p>
<p>Mod&#233;liser suppose de faire des choix explicites l&#224; o&#249; les textes peuvent &#234;tre flous et m&#234;ler les
points de vue. Il est donc impossible d&#8217;annoter les EN d&#8217;un texte ind&#233;pendamment d&#8217;un mod&#232;le
de r&#233;f&#233;rence. Dans le cas de l&#8217;exp&#233;rience d&#233;crite plus haut, le mod&#232;le &#233;tait, comme souvent,
simplement d&#233;crit par une liste de concepts : il fallait nommer les g&#232;nes et prot&#233;ines, mais aussi
leurs familles, compositions, et composants. Par ailleurs, comme la REN doit servir &#224; mod&#233;liser
le r&#233;seau d&#8217;interactions entre g&#232;nes, il &#233;tait essentiel de rep&#233;rer toutes les mentions des entit&#233;s
consid&#233;r&#233;es, chacune pouvant contribuer &#224; enrichir sa mod&#233;lisation.
</p>
<p>5 Recommandations m&#233;thodologiques
</p>
<p>Annoter est difficile. Il faut donc guider le travail des annotateurs, ce qui passe par des guides
et des outils d&#8217;annotation, mais aussi par l&#8217;&#233;valuation de la qualit&#233; des annotations.
</p>
<p>Guides d&#8217;annotations Comme le type d&#8217;annotation &#224; produire d&#233;pend de ce qu&#8217;on cherche &#224;
annoter et de ce &#224; quoi cette annotation doit servir, il est essentiel de fournir aux annotateurs des
guides (ou conventions) d&#8217;annotation qui indiquent ce qu&#8217;il faut annoter plut&#244;t que comment
annoter. Trop souvent en effet, les contraintes de faisabilit&#233; prennent le pas sur les crit&#232;res
s&#233;mantiques11 ce qui brouille l&#8217;objectif pour les annotateurs. Par ailleurs, il est important de
prendre la mesure de la t&#226;che dans toute sa complexit&#233; sans exclure a priori ce qui serait douteux
ou trop difficile &#224; reproduire automatiquement. C&#8217;est m&#234;me l&#8217;int&#233;r&#234;t de l&#8217;annotation manuelle
que de donner une id&#233;e de l&#8217;ampleur de la t&#226;che d&#8217;annotation.
</p>
<p>Il faut donner aux annotateurs une vision claire de l&#8217;application vis&#233;e. Cette vision doit s&#8217;ap-
puyer sur un mod&#232;le de r&#233;f&#233;rence explicite, du type de celui donn&#233; dans la campagne GENIA,
avec des d&#233;finitions pr&#233;cises et des explications sur les choix m&#233;thodologiques r&#233;alis&#233;s (cat&#233;-
gories, typage s&#233;mantique, etc.). Des exemples peuvent &#234;tre ajout&#233;s &#224; titre d&#8217;illustration mais ils
ne doivent pas se substituer &#224; la d&#233;finition des objectifs. Ces informations permettont de limiter
les incompr&#233;hensions, mais aussi de responsabiliser et de motiver les annotateurs en leur don-
nant acc&#232;s &#224; la logique sous-jacente. On entre ainsi dans une d&#233;marche didactique, permettant
de passer d&#8217;un &#8220;rapport de p&#232;re &#224; un rapport de pair&quot; (Akrich &amp; Boullier, 1991), ce qui est
d&#8217;autant plus n&#233;cessaire que l&#8217;annotation porte sur des corpus sp&#233;cialis&#233;s, les annotateurs &#233;tant
</p>
<p>11&quot;In [src homology 2 and 3], it seems excessive to require an NER program to recognize the entire fragment,
however, 3 alone is not a valid gene name.&quot; (Tanabe et al., 2005).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Maud Ehrmann, Adeline Nazarenko
</p>
<p>des experts &#224; qui on a int&#233;r&#234;t &#224; donner la plus grande autonomie possible. Dans certains cas, la
t&#226;che d&#8217;annotation &#233;tant trop complexe, on doit se restreindre &#224; une annotation exploitable pour
l&#8217;apprentissage automatique &#8211; en se limitant par exemple aux noms propres &#8211; mais cela doit &#234;tre
fait de mani&#232;re explicite pour que les annotateurs aient une vue claire des choix &#224; faire.
</p>
<p>Outils d&#8217;annotation Le travail d&#8217;annotation doit &#234;tre outill&#233;. On utilise des dispositifs tech-
niques pour annoter les textes mais aussi pour pr&#233;parer le travail d&#8217;annotation par une pr&#233;-
annotation (projection d&#8217;un dictionnaire, par exemple). Ces outils sont cependant &#224; manier avec
pr&#233;caution du fait des biais qu&#8217;ils introduisent. Dans l&#8217;exp&#233;rience que nous avons men&#233;e, le
corpus d&#8217;annotation avait &#233;t&#233; pr&#233;-annot&#233; par projection d&#8217;un dictionnaire de noms de g&#232;nes et
de prot&#233;ines, pour all&#233;ger le travail des annotateurs, mais cette pr&#233;-annotation a influenc&#233; l&#8217;an-
notation. Elle a introduit un biais en faveur de la correction des pr&#233;-annotations, au d&#233;triment de
la recherche de nouvelles EN. Une solution consiste &#224; proc&#233;der en deux temps, en &#233;tiquetant &#224;
la main un &#233;chantillon du corpus, puis en le pr&#233;-annotant pour comparer les r&#233;sultats et &#233;valuer
le biais introduit. On peut ensuite faire une annotation &#224; plus grande &#233;chelle, pr&#233;c&#233;d&#233;e par une
pr&#233;-annotation dont on conna&#238;tra cette fois les biais.
</p>
<p>En ce qui concerne le processus d&#8217;annotation lui-m&#234;me, s&#8217;il existe aujourd&#8217;hui de nombreux
outils d&#8217;aide &#224; l&#8217;annotation manuelle, peu sont effectivement disponibles, c&#8217;est-&#224;-dire gratuits,
t&#233;l&#233;chargeables et utilisables . On peut citer, entre autres, Callisto, MMAX2, Knowtator ou en-
core Cadixe12 qui a &#233;t&#233; utilis&#233; dans notre exp&#233;rience. Les fonctionnalit&#233;s et l&#8217;expressivit&#233; du
langage d&#8217;annotation doivent &#234;tre adapt&#233;es &#224; la t&#226;che d&#8217;annotation vis&#233;e : selon les cas, il faut
typer des segments de textes ou les mettre en relation, on a des annotations concurrentes, dis-
jointes ou superposables, etc. Dans notre exp&#233;rience en microbiologie, par exemple, le fait de
ne pas pouvoir annoter les coordinations d&#8217;EN a pos&#233; probl&#232;me. Les crit&#232;res ergonomiques sont
&#233;galement importants : on sait que les fonctionnalit&#233;s difficiles d&#8217;acc&#232;s ne sont pas utilis&#233;es, ce
qui biaise l&#224; aussi les r&#233;sultats. Dans notre cas, les annotateurs ont souvent n&#233;glig&#233; de mention-
ner leur incertitude parce qu&#8217;ajouter l&#8217;attribut correspondant &#224; leurs annotations &#233;tait malais&#233;.
</p>
<p>&#201;valuation de l&#8217;annotation Il est important de mesurer la qualit&#233; de l&#8217;annotation. (Gut &amp; Bay-
erl, 2004) distingue l&#8217;accord inter-annotateur, qui permet de mesurer la stabilit&#233; de l&#8217;annotation,
et l&#8217;accord intra-annotateur, qui donne une indication de la reproductibilit&#233; de l&#8217;annotation. S&#8217;il
est important de calculer l&#8217;accord inter-annotateur, il n&#8217;est pas n&#233;cessaire de le r&#233;aliser sur tout
le corpus, ne serait-ce que pour des raisons de co&#251;t. Il est en revanche conseill&#233; de le calculer
t&#244;t, afin d&#8217;identifier les probl&#232;mes rapidement et de modifier l&#8217;annotation en cons&#233;quence. Il en
va de m&#234;me en ce qui concerne l&#8217;accord intra-annoteur.
</p>
<p>Un autre moyen d&#8217;&#233;valuation consiste &#224; faire ajouter &#224; l&#8217;annotateur, si n&#233;cessaire, une note d&#8217;in-
certitude, de pr&#233;f&#233;rence typ&#233;e, sur ses annotations. En l&#8217;absence de calcul de l&#8217;accord inter ou
intra-annotateur pour cette annotation nous avons ainsi fait annoter les incertitudes des anno-
tateurs a posteriori sur un sous-ensemble du corpus. Pour s&#8217;assurer de la repr&#233;sentativit&#233; de
l&#8217;&#233;chantillon, les annotateurs ont identifi&#233; une typologie des fichiers du corpus (six &#8220;types&#8221;).
Nous avons ensuite extrait 25 fichiers de types vari&#233;s parmi les 499 notices du corpus (soit 5%).
L&#8217;objectif de cette seconde validation &#233;tant d&#8217;&#233;valuer la confiance des annotateurs en leur val-
idation, nous avons choisi de profiter du tag uncertainty propos&#233; dans Cadixe et de l&#8217;utiliser
de mani&#232;re syst&#233;matique en cas de doute. Nous avons donc red&#233;fini les types d&#8217;uncertainty en
fonction de l&#8217;exp&#233;rience des annotateurs. Cette &#233;valuation n&#8217;a n&#233;cessit&#233; que quelques heures de
travail et nous a permis de mieux qualifier et quantifier leurs doutes. Au final, sur 555 tags, les
</p>
<p>12respectivement : http://callisto.mitre.org/, http://mmax2.sourceforge.net/, http:
//knowtator.sourceforge.net/, http://caderige.imag.fr/Cadixe/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une m&#233;thodologie d&#8217;annotation des entit&#233;s nomm&#233;es en corpus ?
</p>
<p>annotateurs ont d&#233;clar&#233; 113 uncertainty, soit environ 20% des tags. On observe que plus de 75%
des incertitudes concernent les noms communs de type bacteria, et que ces incertitudes sont tr&#232;s
largement (77%) li&#233;es &#224; une difficult&#233; &#224; distinguer les noms communs des noms propres.
</p>
<p>Plus g&#233;n&#233;ralement, pour s&#8217;assurer &#224; la fois de la qualit&#233; du guide d&#8217;annotation et des possibilit&#233;s
d&#8217;&#233;valuation, une bonne m&#233;thode consiste, en tout d&#233;but de projet, &#224; faire travailler les annota-
teurs chacun de leur c&#244;t&#233; sur un &#233;chantillon du corpus. Cela permet d&#8217;identifier rapidement les
d&#233;saccords, puis de les trancher, soit en faisant intervenir un autre expert, soit par concertation
des annotateurs. Ces d&#233;cisions sont ensuite report&#233;es dans le guide d&#8217;annotation.
</p>
<p>6 Conclusion et perspectives
</p>
<p>Au final, une d&#233;marche rigoureuse et efficace d&#8217;annotation d&#8217;EN en corpus doit pr&#234;ter attention
principalement &#224; deux points. Au regard du contenu tout d&#8217;abord, il importe de se focaliser non
pas tant sur comment annoter, mais sur quoi annoter, en fonction de l&#8217;application vis&#233;e. Nous
avons vu que chaque famille d&#8217;application sp&#233;cifie un certain nombre de crit&#232;res linguistiques,
et que les mentions &#224; annoter diff&#232;rent relativement &#224; ces derniers. Une fois sp&#233;cifi&#233; ce qu&#8217;il faut
annoter, il faut &#234;tre prudent en termes de m&#233;thodologie et envisager d&#232;s le d&#233;part l&#8217;&#233;valuation de
l&#8217;annotation. Il est avantageux, du point de vue de la qualit&#233; de l&#8217;annotation, de r&#233;aliser un ou
plusieurs galops d&#8217;essai, afin d&#8217;ajuster certains &#233;l&#233;ments du guide d&#8217;annotation et d&#8217;&#233;valuer les
biais &#233;ventuels introduits par l&#8217;outil d&#8217;annotation et/ou une mauvaise compr&#233;hension de la t&#226;che
par les annotateurs. Relativement aux enjeux et aux difficult&#233;s de l&#8217;annotation des EN en corpus,
l&#8217;attention port&#233;e &#224; la sp&#233;cification du contenu et au respect d&#8217;une m&#233;thodologie d&#8217;annotation
permet d&#8217;assurer un cadre de travail stable et coh&#233;rent &#224; chacune des &#233;tapes de la t&#226;che de REN.
Nous comptons appliquer cette m&#233;thodologie dans le cadre des campagnes d&#8217;annotation de
Quaero, en pharmacologie et en &#233;conomie. Couvrant la terminologie et l&#8217;extraction de relations
s&#233;mantiques, ces campagnes d&#233;passent largement le cadre des EN, nous allons donc &#233;largir
notre m&#233;thode &#224; ces applications.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; r&#233;alis&#233; en partie dans le cadre du programme Quaero 13, financ&#233; par OSEO,
agence nationale de valorisation de la recherche. Nous en remercions les participants, en par-
ticulier l&#8217;&#233;quipe MIG de l&#8217;INRA. Nous remercions &#233;galement F. Tisserand et B. Taliercio, les
annotateurs experts de l&#8217;INIST.
</p>
<p>R&#233;f&#233;rences
</p>
<p>(1995). Proc. of the 6th Message Understanding Conference. Morgan Kaufmann Publishers.
</p>
<p>(1998). Proc. of the 7th Message Understanding Conference. Morgan Kaufmann Publishers.
</p>
<p>AKRICH M. &amp; BOULLIER D. (1991). Savoir faire et pouvoir transmettre, chapter Le mode
d&#8217;emploi, gen&#232;se, forme et usage, p. 113&#8211;131. &#233;d. de la MSH (coll. Ethnologie de la France).
</p>
<p>13http://www.quaero.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Maud Ehrmann, Adeline Nazarenko
</p>
<p>AMARDEILH F., LAUBLET P. &amp; MINEL J.-L. (2005). Document annotation and ontology
population from linguistic extractions. In Proc. of K-CAP&#8217;05, p. 161&#8211;168, New York : ACM.
ARTILES J., GONZALO J. &amp; SEKINE S. (2007). The semeval-2007 WePS evaluation : estab-
lishing a benchmark for the web people search task. In Proc. of SemEval, ACL, Prague.
BONNEAU-MAYNARD H., ROSSET S., AYACHE C., KUHN A. &amp; MOSTEFA D. (2005). Se-
mantic annotation of the french media dialog corpus. In InterSpeech, Lisbonne, Portugal.
DODDINGTON G., MITCHELL A., PRZYBOCKI M., RAMSHAW L., STRASSEL S. &amp;
WEISCHEDEL R. (2004). The ACE program tasks, data, and evaluation. In Proc. of LREC&#8217;04,
Lisbonne, Portugal.
DRAGOS V. &amp; NAZARENKO A. (2009). Towards a semantic model to enhance knowledge
sharing and discovery in organic chemistry. In Proc. of the IADIS IS&#8217;09, Barcelone, Espagne.
EHRMANN M. (2008). Les entit&#233;s nomm&#233;es, de la linguistique au TAL : statut th&#233;orique et
m&#233;thodes de d&#233;sambigu&#239;sation. PhD thesis, Universit&#233; Paris 7.
GUT U. &amp; BAYERL P. S. (2004). Measuring the reliability of manual annotations of speech
corpora. In Proc. of Speech Prosody, p. 565&#8211;568, Nara, Japon.
HIRSCHMAN L., YEH A., BLASCHKE C. &amp; VALENCIA A. (2005). Overview of biocreative :
critical assessment of information extraction for biology. BMC Bioinformatics, 6(1).
KIM J.-D., OHTA T., TATEISI Y. &amp; TSUJII J. (2003). Genia corpus&#8211;a semantically annotated
corpus for bio-textmining. Bioinformatics, 19, 180&#8211;182.
KIM J.-D., OHTA T., TSURUOKA Y., TATEISI Y. &amp; COLLIER N. (2004). Introduction to the
bio-entity recognition task at JNLPBA. In Proc. of JNLPBA COLING&#8217;04 Workshop, p. 70&#8211;75.
KULICK S., BIES A., LIBERMAN M., MANDEL M., MCDONALD R., PALMER M., SCHEIN
A. &amp; UNGAR L. (2004). Integrated annotation for biomedical information extraction. In HLT-
NAACL 2004 Workshop : Biolink : ACL.
LDC (2004). ACE (Automatic Content Extraction) English Annotation Guidelines for Entities.
Livrable version 5.6.1 2005.05.23, Linguistic Data Consortium.
LI X. &amp; LIU B. (2005). Mining community structure of named entities from free text. In
Proc. of CIKM&#8217;05, p. 275&#8211;276, New York, NY, USA : ACM Press.
MARKERT K. &amp; NISSIM M. (2007). Semeval-2007 task 08 : Metonymy resolution at semeval-
2007. In Proc. of SemEval, ACL, Prague.
NADEAU D. &amp; SEKINE S. (2007). A survey of named entity recognition and classification.
Linguisticae Investigaciones, 30(1), 3&#8211;26.
N&#201;DELLEC C., BESSI&#200;RES P., BOSSY R., KOTOUJANSKY A. &amp; MANINE A.-P. (2006).
Annotation guidelines for machine learning-based named entity recognition in microbiology.
In Proc. of the Data and text mining in integrative biology workshop, p. 40&#8211;54, Berlin.
PLAMONDON L., LAPALME G. &amp; PELLETIER F. (2004). Anonymisation de d&#233;cisions de
justice. In Proc. of TALN&#8217;04, p. 367&#8211;376, F&#232;s, Maroc.
POIBEAU T. (2005). Sur le statut r&#233;f&#233;rentiel des entit&#233;s nomm&#233;es. In Proc. of TALN&#8217;05, p.
173&#8211;182, Dourdan, France.
SUNDHEIM B. (1995). Overview of results of the MUC-6 evaluation. In (MUC, 1995).
TANABE L., XIE N., THOM L., MATTEN W. &amp; WILBUR1 J. (2005). Genetag : a tagged
corpus for gene/protein named entity recognition. Bioinformatics, 6.
TRAN M. &amp; MAUREL D. (2006). Prolexbase : un dictionnaire relationnel multilingue de
noms propres. TAL, 47(3), 115&#8211;139.</p>

</div></div>
</body></html>