<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apport d&#8217;un corpus comparable d&#233;s&#233;quilibr&#233; &#224; l&#8217;extraction de lexiques bilingues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Apport d&#8217;un corpus comparable d&#233;s&#233;quilibr&#233; &#224;
l&#8217;extraction de lexiques bilingues
</p>
<p>Emmanuel Morin
Universit&#233; de Nantes, LINA - UMR CNRS 6241
</p>
<p>2 rue de la Houssini&#232;re, BP 92208, 44322 Nantes Cedex 03
emmanuel.morin@univ-nantes.fr
</p>
<p>R&#233;sum&#233;. Les principaux travaux en extraction de lexiques bilingues &#224; partir de corpus
comparables reposent sur l&#8217;hypoth&#232;se implicite que ces corpus sont &#233;quilibr&#233;s. Cependant, les
diff&#233;rentes m&#233;thodes computationnelles associ&#233;es sont relativement insensibles &#224; la taille de
chaque partie du corpus. Dans ce contexte, nous &#233;tudions l&#8217;influence que peut avoir un corpus
comparable d&#233;s&#233;quilibr&#233; sur la qualit&#233; des terminologies bilingues extraites &#224; travers diff&#233;rentes
exp&#233;riences. Nos r&#233;sultats montrent que sous certaines conditions l&#8217;utilisation d&#8217;un corpus com-
parable d&#233;s&#233;quilibr&#233; peut engendrer un gain significatif dans la qualit&#233; des lexiques extraits.
</p>
<p>Abstract. The main work in bilingual lexicon extraction from comparable corpora is ba-
sed on the implicit hypothesis that corpora are balanced. However, the different related ap-
proaches are relatively insensitive to sizes of each part of the comparable corpus. Within this
context, we study the influence of unbalanced comparable corpora on the quality of bilingual
terminology extraction through different experiments. Our results show the conditions under
which the use of an unbalanced comparable corpus can induce a significant gain in the quality
of extracted lexicons.
</p>
<p>Mots-cl&#233;s : Multilinguisme, corpus comparable, extraction de lexiques bilingues.
Keywords: Multilingualism, comparable corpus, bilingual lexicon extraction.
</p>
<p>1 Contexte
</p>
<p>L&#8217;extraction de lexiques bilingues &#224; partir de corpus a initialement &#233;t&#233; entreprise en consid&#233;-
rant des corpus parall&#232;les (i.e. des textes en correspondance de traduction). Cependant, et en
d&#233;pit des bons r&#233;sultats obtenus avec ces corpus, ces derniers demeurent des ressources rares,
notamment pour les domaines sp&#233;cialis&#233;s et pour des couples de langues ne faisant pas interve-
nir l&#8217;anglais. Pour ces diff&#233;rentes raisons, les recherches en extraction de lexiques bilingues se
sont pench&#233;es sur une autre sorte de corpus bilingue compos&#233; de documents partageant diff&#233;-
rentes caract&#233;ristiques telles que le domaine, le genre, la p&#233;riode... sans &#234;tre en correspondance
de traduction. Ces corpus, bien connus maintenant sous le nom de corpus comparables, ont
&#233;t&#233; originellement qualifi&#233;s de corpus non parall&#232;les (non-parallel corpora dans Fung (1995)
et Rapp (1995)) ou encore de corpus non align&#233;s (non-aligned corpora dans Tanaka &amp; Iwa-
saki (1996)). Cette filiation entre les corpus parall&#232;les et comparables a visiblement conduit &#224;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin
</p>
<p>travailler implicitement avec des corpus comparables &#233;quilibr&#233;s (i.e. des corpus comportant la
m&#234;me quantit&#233; de donn&#233;es en langues source et cible).
En extraction de lexiques bilingues &#224; partir de corpus comparables, deux directions de recherche
peuvent &#234;tre observ&#233;es. La premi&#232;re exploite des corpus comparables volumineux de langue
g&#233;n&#233;rale pour extraire des couples de traductions. Ainsi, Fung &amp; McKeown (1997) utilisent
un corpus journalistique anglais-japonais compos&#233; de 49 millions d&#8217;octets issus du Wall Street
Journal et de 127 millions d&#8217;octets issus du Nikkei Financial News (&#233;quivalent &#224; environ 60 mil-
lions d&#8217;octets en anglais en raison du codage des caract&#232;res japonais), tandis que Rapp (1999)
s&#8217;appuie sur un corpus journalistique allemand-anglais compos&#233; de 135 millions de mots ex-
traits du Frankfurter Allgemeine Zeitung et de 163 millions de mots extraits du Guardian. Dans
les deux cas, les corpus comparables exploit&#233;s sont relativement bien &#233;quilibr&#233;s puisque le ratio
de donn&#233;es entre les deux langues est de 1,2. La seconde direction s&#8217;int&#233;resse quant &#224; elle &#224;
l&#8217;exploitation de corpus comparables de domaines sp&#233;cialis&#233;s qui sont par nature de taille plus
r&#233;duite. Ainsi, Chiao &amp; Zweigenbaum (2002b) construisent un corpus m&#233;dical par consulta-
tion de CISMeF pour la partie fran&#231;aise (591 594 mots) et de CliniWeb pour la partie anglaise
(608 320 mots), D&#233;jean &amp; Gaussier (2002) constituent un corpus allemand-anglais compos&#233;
d&#8217;environ 700 r&#233;sum&#233;s d&#8217;articles scientifiques issus de MEDLINE (chaque partie contenant en-
viron 100 000 mots), Morin et al. (2007) s&#233;lectionnent des documents fran&#231;ais et japonais sur
le web pour construire un corpus m&#233;dical restreint &#224; la th&#233;matique du diab&#232;te et de l&#8217;alimenta-
tion (693 666 mots pour la partie fran&#231;aise et 807 287 mots pour la partie japonaise). Ici encore,
les corpus comparables sont bien &#233;quilibr&#233;s avec un ratio de donn&#233;es compris entre 1 et 1,2.
Lorsque l&#8217;on se place dans la perspective de travailler avec un corpus comparable &#233;quilibr&#233;,
la quantit&#233; de donn&#233;es de la partie du corpus la plus importante doit &#234;tre ramen&#233;e &#224; la plus
faible. Cet aspect est pr&#233;judiciable pour des corpus comparables sp&#233;cialis&#233;s, notamment lors-
qu&#8217;ils comportent des donn&#233;es en langue anglaise pour laquelle de nombreux documents sont
souvent disponibles en raison de sa position dominante comme standard international pour les
communications scientifiques.
</p>
<p>La m&#233;thode par traduction directe associ&#233;e &#224; ces travaux n&#8217;impose pas de contraintes sur la taille
de chaque partie du corpus comparable. Chaque partie est vue comme un ensemble clos sur
lequel des statistiques de distributions lexicales bas&#233;es sur le contexte des mots sont calcul&#233;es.
En fait, plus nombreux seront les contextes lexicaux, plus fiables seront les associations entre
mots. En ce sens, un corpus comparable &#233;quilibr&#233; n&#8217;est pas requis pour l&#8217;extraction de lexiques
bilingues.
</p>
<p>Aucune attention, &#224; notre connaissance, n&#8217;a &#233;t&#233; port&#233;e sur l&#8217;utilisation de corpus comparables
d&#233;s&#233;quilibr&#233;s pour l&#8217;extraction de lexiques bilingues. Cet article vise pr&#233;cis&#233;ment cet objectif
en se concentrant sur les corpus comparables sp&#233;cialis&#233;s.
</p>
<p>2 M&#233;thode par traduction directe
</p>
<p>Les principaux travaux en extraction de lexiques bilingues &#224; partir de corpus comparables re-
posent sur la simple observation qu&#8217;un mot et sa traduction ont tendance &#224; appara&#238;tre dans les
m&#234;mes environnements lexicaux. La mise en &#339;uvre de cette observation repose en premier lieu
sur l&#8217;identification d&#8217;affinit&#233;s du premier ordre dans les langues source et cible : &#171; First-order
affinities describe what other words are likely to be found in the immediate vicinity of a given</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport d&#8217;un corpus comparable d&#233;s&#233;quilibr&#233; &#224; l&#8217;extraction de lexiques bilingues
</p>
<p>word1 &#187; (Grefenstette, 1994a, p. 279). Ces affinit&#233;s peuvent &#234;tre repr&#233;sent&#233;es sous la forme de
vecteurs de contexte o&#249; chaque &#233;l&#233;ment du vecteur est un mot qui appara&#238;t dans la fen&#234;tre du
mot &#224; traduire. Par exemple une fen&#234;tre de sept mots (3 mots et avant et apr&#232;s le mot vis&#233;) per-
met d&#8217;identifier des d&#233;pendances syntaxiques. Afin d&#8217;identifier les mots les plus significatifs des
vecteurs de contexte et de r&#233;duire l&#8217;influence des mots fr&#233;quents, les vecteurs de contexte sont
normalis&#233;s au moyen d&#8217;une mesure d&#8217;association. Ensuite, la traduction d&#8217;un mot est obtenue
en comparant son vecteur de contexte, dont les &#233;l&#233;ments ont &#233;t&#233; pr&#233;alablement traduits &#224; l&#8217;aide
d&#8217;un dictionnaire bilingue, &#224; l&#8217;ensemble des vecteurs de la langue cible.
</p>
<p>Notre impl&#233;mentation de la m&#233;thode par traduction directe se d&#233;compose de la mani&#232;re suivante
(Rapp, 1995; Fung &amp; McKeown, 1997) :
Identification des contextes lexicaux
</p>
<p>Pour chaque partie du corpus comparable, le contexte de chaque mot &#0; est extrait en
rep&#233;rant les mots qui apparaissent autour de lui dans une fen&#234;tre contextuelle de &#1; mots2.
Afin d&#8217;identifier les mots caract&#233;ristiques des contextes lexicaux et de supprimer l&#8217;effet
induit par la fr&#233;quence des mots, nous normalisons l&#8217;association entre les mots sur la
base d&#8217;une mesure de r&#233;currence contextuelle comme l&#8217;Information Mutuelle - IM (Fano,
1961) ou le Taux de vraisemblance - TV (Dunning, 1993) (cf. les &#233;quations 1 et 2 et la
table 1). Apr&#232;s normalisation, &#224; chaque &#233;l&#233;ment &#2; du vecteur de contexte du mot &#0; nous
attachons le taux d&#8217;association &#3;&#5;&#4;&#6;&#4;&#8;&#7;&#6;&#9;&#11;&#10; &#0;&#13;&#12; &#2;&#5;&#14; .
</p>
<p>Transfert d&#8217;un mot &#224; traduire
Le transfert d&#8217;un mot &#15; &#224; traduire de la langue source &#224; la langue cible repose sur la tra-
duction de chacun des &#233;l&#233;ments de son vecteur de contexte au moyen d&#8217;un dictionnaire
bilingue. Si le dictionnaire propose plusieurs traductions pour un &#233;l&#233;ment, nous ajoutons
au vecteur de contexte de &#15; l&#8217;ensemble des traductions propos&#233;es3 (lesquelles sont pon-
d&#233;r&#233;es par la fr&#233;quence de la traduction en langue cible). Dans le cas o&#249; l&#8217;&#233;l&#233;ment n&#8217;est
pas pr&#233;sent dans le dictionnaire, il ne sera pas exploit&#233; dans le processus de traduction.
</p>
<p>Identification des vecteurs proches du mot &#224; traduire
Le vecteur de contexte &#16;&#11;&#17; ainsi traduit est ensuite compar&#233; &#224; l&#8217;ensemble des vecteurs de la
langue cible en s&#8217;appuyant sur une mesure de distance vectorielle comme Cosinus (Salton
&amp; Lesk, 1968) ou Jaccard pond&#233;r&#233; (Grefenstette, 1994b) (cf. les &#233;quations 3 et 4).
</p>
<p>Obtention des traductions candidates
En fonction des pr&#233;c&#233;dentes valeurs de similarit&#233;, nous obtenons une liste ordonn&#233;e de
traductions candidates pour le mot &#15; .
</p>
<p>&#2; &#18;&#19;&#2;
</p>
<p>&#0;
</p>
<p>&#3;&#21;&#20;&#22;&#7;&#6;&#9;&#23;&#9;&#24;&#10;
</p>
<p>&#0;&#25;&#12;
</p>
<p>&#2;&#5;&#14; &#26;ff&#20;fi&#7;&#6;&#9;fl&#9;&#11;&#10;
</p>
<p>&#0;&#13;&#12;
</p>
<p>&#18;&#19;&#2;&#5;&#14;
</p>
<p>&#18;
</p>
<p>&#0;
</p>
<p>&#9;ffi&#20;&#22;&#7;&#6;&#9;&#23;&#9;&#24;&#10;&#31;&#18;
</p>
<p>&#0;&#13;&#12;
</p>
<p>&#2; &#14; !&quot;&#20;#&#7;&#24;&#9;fl&#9;&#11;&#10;$&#18;
</p>
<p>&#0;&#13;&#12;
</p>
<p>&#18;&#19;&#2;&#5;&#14;
</p>
<p>TAB. 1 &#8211; Table de contingence
</p>
<p>% &amp;
</p>
<p>&#10;
</p>
<p>&#0;&#13;&#12;
</p>
<p>&#2;&#5;&#14;'&#20;&#22;()&#7;+*
</p>
<p>&#3;
</p>
<p>&#10;,&#3;.-/&#26;fl&#14;&#23;&#10;$&#3;.-0&#9;1&#14;
</p>
<p>(1)
1&#171; Les affinit&#233;s du premier ordre d&#233;crivent les mots qui sont susceptibles d&#8217;&#234;tre trouv&#233;s dans le voisinage
</p>
<p>imm&#233;diat d&#8217;un mot donn&#233;. &#187;
2En ce qui concerne les mots agrammaticaux, ils ne sont pas exploit&#233;s dans le processus d&#8217;alignement.
3Cette technique correspond &#224; l&#8217;approche couramment adopt&#233;e lorsque les traductions ne sont pas ordonn&#233;es
</p>
<p>dans le dictionnaire bilingue.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin
</p>
<p>&#0;&#2;&#1;
</p>
<p>&#10;
</p>
<p>&#0;&#13;&#12;
</p>
<p>&#2; &#14; &#20; &#3;&#4;&#3;&#6;&#5;&#8;&#7; &#10;$&#3;&#5;&#14;&#19;-/&#26;&#9;&#3;&#6;&#5;&#10;&#7; &#10;$&#26;fl&#14; -/&#9;&#11;&#3;&#12;&#5;&#10;&#7; &#10;,&#9;1&#14;&#19;-0!&#4;&#3;&#6;&#5;&#8;&#7; &#10;$!&#5;&#14;
</p>
<p>- &#10;,&#3;.-0&#26; -/&#9; -0!&#5;&#14;&#13;&#3;&#6;&#5;&#10;&#7; &#10;$&#3; -0&#26; -/&#9; -/!&#5;&#14;&#15;&#14;#&#10;$&#3; -/&#26;fl&#14;&#13;&#3;&#6;&#5;&#10;&#7; &#10;$&#3;.-0&#26;fl&#14;
</p>
<p>&#14;&#21;&#10;,&#3; -/&#9;&#23;&#14;&#13;&#3;&#6;&#5;&#10;&#7; &#10;$&#3; -0&#9;1&#14;&#15;&#14; &#10;$&#26; -0! &#14;&#13;&#3;&#12;&#5;&#10;&#7; &#10;,&#26; -/!&#5;&#14;&#15;&#14; &#10;,&#9; -/!&#5;&#14;&#13;&#3;&#12;&#5;&#10;&#7; &#10;,&#9;'-/!&#5;&#14;
</p>
<p>(2)
</p>
<p>&#16;
</p>
<p>&#7;&#24;&#4;
</p>
<p>&#0;
</p>
<p>&#1;&#18;&#17; &#4;&#20;&#19;&#22;&#21;
</p>
<p>&#19;&#24;&#23;
</p>
<p>&#20;
</p>
<p>&#25;ff&#26;
</p>
<p>&#3;&#5;&#4;+&#4;+&#7;&#6;&#9;flfi
</p>
<p>&#26;
</p>
<p>&#3;&#5;&#4;+&#4;&#8;&#7;&#24;&#9;
</p>
<p>&#17;
</p>
<p>&#26;
</p>
<p>ffi
</p>
<p>&#25;&#31;&#26;
</p>
<p>&#3;&#5;&#4;+&#4;&#8;&#7;&#24;&#9;
</p>
<p>fi
</p>
<p>&#26;! 
</p>
<p>ffi
</p>
<p>&#25;&#31;&#26;
</p>
<p>&#3;&#5;&#4;+&#4;+&#7;&#6;&#9;
</p>
<p>&#17;
</p>
<p>&#26;&quot; 
</p>
<p>(3)
</p>
<p>#
</p>
<p>&#3;&#5;&#9;fl&#9;fl&#3;%$&#24;!'&amp; &#7;&#6;&#1; !)(
</p>
<p>*
</p>
<p>$+(
</p>
<p>*
</p>
<p>&#19; &#21;
</p>
<p>&#19;&#24;&#23;
</p>
<p>&#20;
</p>
<p>&#25;
</p>
<p>&#26;-,
</p>
<p>&#0;
</p>
<p>&#1; &#10;$&#3;&#5;&#4;+&#4;+&#7;&#6;&#9; fi
</p>
<p>&#26;
</p>
<p>&#12;
</p>
<p>&#3; &#4;+&#4;&#8;&#7;&#6;&#9;
</p>
<p>&#17;
</p>
<p>&#26;
</p>
<p>&#14;
</p>
<p>&#25;
</p>
<p>&#26;&#8;,
</p>
<p>&#3;&#10;. &#10;$&#3;&#5;&#4;+&#4;&#8;&#7;&#24;&#9;
</p>
<p>fi
</p>
<p>&#26;
</p>
<p>&#12;
</p>
<p>&#3;&#5;&#4;+&#4;&#8;&#7;&#24;&#9;
</p>
<p>&#17;
</p>
<p>&#26;
</p>
<p>&#14;
</p>
<p>(4)
</p>
<p>En fonction de l&#8217;ad&#233;quation du dictionnaire bilingue avec le corpus d&#8217;&#233;tude, un nombre plus ou
moins important d&#8217;&#233;l&#233;ments du vecteur de contexte sera traduit. Le mot &#224; traduire sera d&#8217;autant
plus informatif en langue cible que le nombre d&#8217;&#233;l&#233;ments traduits de son vecteur de contexte
sera important. Les difficult&#233;s de traduction des &#233;l&#233;ments des vecteurs de contexte peuvent
&#234;tre partiellement contourn&#233;es : i) en combinant un dictionnaire de langue g&#233;n&#233;rale avec un
dictionnaire sp&#233;cialis&#233; ou un thesaurus multilingue (Chiao &amp; Zweigenbaum, 2003; D&#233;jean et al.,
2002) ou ii) en utilisant la m&#233;thode par similarit&#233; interlangue (D&#233;jean &amp; Gaussier, 2002; Daille
&amp; Morin, 2005).
</p>
<p>3 Exp&#233;riences et r&#233;sultats
</p>
<p>3.1 Ressources linguistiques
</p>
<p>Dans le cadre de cette &#233;tude, nous avons construit un corpus comparable sp&#233;cialis&#233; fran&#231;ais-
anglais &#224; partir de documents extraits du portail Elsevier4. L&#8217;ensemble des documents collect&#233;s
rel&#232;ve du domaine m&#233;dical restreint &#224; la th&#233;matique du &#171; cancer du sein &#187;. Nous avons utilis&#233;
l&#8217;interface de recherche du portail pour s&#233;lectionner les publications scientifiques comportant
dans le titre ou les mots cl&#233;s le terme cancer du sein en fran&#231;ais et breast cancer en anglais pour
la p&#233;riode de 2001 &#224; 2008. Nous avons ainsi automatiquement collect&#233; 130 documents (environ
530 000 mots) pour le fran&#231;ais et 1 640 documents (environ 7,4 millions de mots) pour l&#8217;anglais.
Les documents anglais ont &#233;t&#233; divis&#233;s en 14 parties contenant chacune environ 530 000 mots.
L&#8217;ensemble des documents ont &#233;t&#233; nettoy&#233;s et normalis&#233;s &#224; travers les traitements suivants :
segmentation en occurrences de formes, &#233;tiquetage morpho-syntaxique et lemmatisation. Enfin,
les mots agrammaticaux ont &#233;t&#233; supprim&#233;s et les mots apparaissant moins de deux fois dans
la partie fran&#231;aise et dans chaque partie anglaise &#233;cart&#233;s. Le tableau 2 pr&#233;sente les principales
caract&#233;ristiques des diff&#233;rentes parties apr&#232;s ces &#233;tapes &#224; savoir le nombre de documents (# do-
cuments) et le nombre de mots distincts (# mots distincts). Dans la suite de cet article, nous
d&#233;signons par / corpus &#0;10 le corpus comparable construit en s&#8217;appuyant sur la partie fran&#231;aise et
la partie anglaise &#0; ( &#0;+2 /43 &#12; 3&quot;5 0 ).
Le dictionnaire fran&#231;ais-anglais n&#233;cessaire &#224; l&#8217;&#233;tape de traduction de la m&#233;thode directe a &#233;t&#233;
construit &#224; partir de diff&#233;rentes ressources disponibles sur le web. Il comporte, apr&#232;s normali-
sation, 22 300 mots pour le fran&#231;ais avec en moyenne 1,6 traductions par entr&#233;e. Il s&#8217;agit d&#8217;un
</p>
<p>4www.elsevier.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport d&#8217;un corpus comparable d&#233;s&#233;quilibr&#233; &#224; l&#8217;extraction de lexiques bilingues
</p>
<p># documents # mots distincts
Fran&#231;ais
Partie 1 130 7 376
Anglais
Partie 1 118 8 214
Partie 2 114 7 788
Partie 3 101 8 370
Partie 4 114 7 992
Partie 5 119 7 958
Partie 6 117 8 230
Partie 7 109 8 035
Partie 8 116 8 008
Partie 9 129 8 334
Partie 10 114 7 978
Partie 11 126 8 373
Partie 12 137 8 065
Partie 13 123 7 847
Partie 14 103 8 457
</p>
<p>TAB. 2 &#8211; Caract&#233;ristiques des corpus collect&#233;s
</p>
<p>dictionnaire de langue g&#233;n&#233;rale qui ne contient que peu de termes en rapport avec le domaine
m&#233;dical.
</p>
<p>En extraction de lexiques bilingues &#224; partir de corpus comparables sp&#233;cialis&#233;s, le lexique de
r&#233;f&#233;rence n&#233;cessaire pour &#233;valuer les performances de la m&#233;thode d&#8217;alignement est souvent
compos&#233; d&#8217;une centaine de mots (180 dans D&#233;jean &amp; Gaussier (2002), 95 dans Chiao &amp; Zwei-
genbaum (2002a), ou encore 100 mots simples dans Daille &amp; Morin (2005)). Afin de construire
notre lexique de r&#233;f&#233;rence, nous avons s&#233;lectionn&#233; 400 couples de mots simples fran&#231;ais-anglais
&#224; partir du meta-thesaurus UMLS5 et du Grand dictionnaire terminologique6. Nous n&#8217;avons en-
suite retenu que les couples pour lesquels le mot fran&#231;ais appara&#238;t au moins cinq fois dans la
partie fran&#231;aise et sa traduction au moins cinq fois dans chaque partie anglaise &#0; . Au terme de
ce processus de s&#233;lection, nous disposons d&#8217;une liste de r&#233;f&#233;rence compos&#233;e de 122 couples de
termes simples fran&#231;ais-anglais.
</p>
<p>3.2 Exp&#233;riences pr&#233;liminaires
</p>
<p>Afin d&#8217;&#233;valuer l&#8217;influence d&#8217;un corpus comparable d&#233;s&#233;quilibr&#233; sur l&#8217;extraction de lexiques
bilingues diff&#233;rentes exp&#233;riences sont r&#233;alis&#233;es. Dans un premier temps, nous utilisons chaque
/ corpus &#0;10 &#233;quilibr&#233; ind&#233;pendamment des autres. Puis, nous faisons varier la taille de la partie
anglaise du corpus comparable de 530 000 &#224; 7,4 millions de mots suivant un pas de 530 000
mots. Dans ces diff&#233;rentes exp&#233;riences, ainsi que dans toutes celles qui vont suivre, la taille
&#1; de la fen&#234;tre contextuelle est fix&#233;e &#224; 7 mots (3 mots et avant et apr&#232;s le mot vis&#233;) et les
param&#232;tres indiqu&#233;s (mesures d&#8217;association et de similarit&#233;) sont ceux qui donnent en moyenne
</p>
<p>5www.nlm.nih.gov/research/umls
6www.granddictionnaire.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin
</p>
<p>&#0;&#2;&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#4;&#5;&#1;
</p>
<p>&#6;&#2;&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>&#8;&#2;&#1;
</p>
<p>1 2 3 4 5 6 7 8 9 10 11 12 13 14
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;
</p>
<p>&#9;&#10;&#9;
</p>
<p>&#215;
</p>
<p>&#215;
</p>
<p>&#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215; &#215;
</p>
<p>&#215;
</p>
<p>&#215; &#215;
&#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215;
</p>
<p>P
</p>
<p>corpus
&#0;&#11;&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#4;&#2;&#1;
</p>
<p>&#6;&#11;&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>&#8;&#11;&#1;
</p>
<p>14 13 12 11 10 9 8 7 6 5 4 3 2 1
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;&#10;&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#12;
</p>
<p>&#215;
&#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215; &#215;
</p>
<p>&#215;
</p>
<p>&#215; &#215;
&#215;
</p>
<p>&#215;
</p>
<p>&#215;
</p>
<p>&#215;
</p>
<p>&#215;
</p>
<p>P
</p>
<p>corpus
</p>
<p>FIG. 1 &#8211; Pr&#233;cision des traductions obtenues pour la direction fran&#231;ais-anglais (param&#232;tres : IM
et cosinus)
</p>
<p>&#0;&#2;&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#4;&#5;&#1;
</p>
<p>&#6;&#2;&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>&#8;&#2;&#1;
</p>
<p>1 2 3 4 5 6 7 8 9 10 11 12 13 14
</p>
<p>&#13;
</p>
<p>&#13;
</p>
<p>&#13;
</p>
<p>&#13;
</p>
<p>&#13;
</p>
<p>&#13;
</p>
<p>&#13;
</p>
<p>&#13;
</p>
<p>&#13;
</p>
<p>&#13;&#14;&#13;
</p>
<p>&#13;&#14;&#13;
</p>
<p>&#13;
</p>
<p>&#215; &#215;
&#215; &#215;
</p>
<p>&#215;
</p>
<p>&#215;
&#215; &#215; &#215; &#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215; &#215;
</p>
<p>P
</p>
<p>corpus
&#0;&#11;&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#4;&#2;&#1;
</p>
<p>&#6;&#11;&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>&#8;&#11;&#1;
</p>
<p>14 13 12 11 10 9 8 7 6 5 4 3 2 1
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#15;&#14;&#15;
</p>
<p>&#15;
</p>
<p>&#15;
</p>
<p>&#215; &#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215;
&#215; &#215; &#215;
</p>
<p>&#215;
</p>
<p>&#215;
&#215; &#215;
</p>
<p>&#215; &#215;
</p>
<p>P
</p>
<p>corpus
</p>
<p>FIG. 2 &#8211; Pr&#233;cision des traductions obtenues pour la direction anglais-fran&#231;ais (param&#232;tres : TV
et jaccard pond&#233;r&#233;)
</p>
<p>les meilleurs r&#233;sultats sur les corpus comparables &#233;quilibr&#233;s.
</p>
<p>Les figures7 1 et 2 pr&#233;sentent les r&#233;sultats de ces exp&#233;riences &#233;valu&#233;es au niveau de la pr&#233;cision
du top 20 (c&#8217;est-&#224;-dire que la bonne traduction est identifi&#233;e dans la liste ordonn&#233;e des vingt
premi&#232;res traductions candidates) pour les termes de la liste de r&#233;f&#233;rence suivant les directions
fran&#231;ais-anglais et anglais-fran&#231;ais et pour deux configurations distinctes du corpus comparable
d&#233;s&#233;quilibr&#233;. Par exemple, la valeur 3 sur l&#8217;axe des abscisses du graphique gauche de la figure 1
indique pour la direction fran&#231;ais-anglais la pr&#233;cision obtenue pour un corpus comparable com-
pos&#233; i) seulement du / corpus 3 0 (43,4 % - &#16; ) et ii) des / corpus 1, 2 et 3 0 (49,2 % - &#17; ).
Comme remarque pr&#233;liminaire, nous pouvons constater que les r&#233;sultats varient sensiblement
suivant les corpus comparables utilis&#233;s individuellement. Ce ph&#233;nom&#232;ne est plus visible quand
la langue source est le fran&#231;ais (variation entre 43,4 et 54,9 %) que l&#8217;anglais (variation entre
49,2 et 56,6 %). En outre, pour n&#8217;importe quel corpus comparable &#233;quilibr&#233; les r&#233;sultats obtenus
avec l&#8217;anglais comme langue source sont toujours sup&#233;rieurs &#224; ceux obtenus avec le fran&#231;ais.
Globalement, nos r&#233;sultats sont conformes &#224; ceux relev&#233;s dans la litt&#233;rature avec la m&#233;thode
par traduction directe pour des corpus comparables ayant une taille et un domaine semblables.
&#192; titre de comparaison, Chiao &amp; Zweigenbaum (2002a) affichent une pr&#233;cision autour de 60 %
pour le top 20 en exploitant un corpus comparable fran&#231;ais-anglais de 1,2 millions de mots
et une liste de r&#233;f&#233;rence compos&#233;e de 95 mots (chaque terme fran&#231;ais ayant une fr&#233;quence
</p>
<p>7Dans toutes les figures pr&#233;sent&#233;es dans cet article, les courbes en pointill&#233;s d&#233;signent un corpus comparable
&#233;quilibr&#233; et les courbes pleines un corpus comparable d&#233;s&#233;quilibr&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport d&#8217;un corpus comparable d&#233;s&#233;quilibr&#233; &#224; l&#8217;extraction de lexiques bilingues
</p>
<p>&#0; &#1;
</p>
<p>&#1;&#5;&#1;
</p>
<p>&#0;&#2;&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#4;&#5;&#1;
</p>
<p>&#6;&#2;&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>1 2 3 4 5 6 7 8 9 10 11 12 13 14
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#215; &#215;
&#215; &#215;
</p>
<p>&#215;
</p>
<p>&#215;
&#215; &#215; &#215; &#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215; &#215;
</p>
<p>P
</p>
<p>corpus
&#0; &#1;
</p>
<p>&#1;&#2;&#1;
</p>
<p>&#0;&#11;&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#4;&#2;&#1;
</p>
<p>&#6;&#11;&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>14 13 12 11 10 9 8 7 6 5 4 3 2 1
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;&#4;&#3;
</p>
<p>&#3;
</p>
<p>&#3;&#5;&#3;
</p>
<p>&#215; &#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215;
&#215; &#215; &#215;
</p>
<p>&#215;
</p>
<p>&#215;
&#215; &#215;
</p>
<p>&#215; &#215;
</p>
<p>P
</p>
<p>corpus
</p>
<p>FIG. 3 &#8211; Pr&#233;cision des traductions obtenues pour la direction anglais-fran&#231;ais (param&#232;tres pour
les courbes en pointill&#233;s : IM en langue source, IM3 en langue cible et jaccard pond&#233;r&#233;)
</p>
<p>sup&#233;rieure &#224; 100 occurrences dans ce travail).
Quand le fran&#231;ais est la langue source et que nous faisons varier la taille du corpus comparable,
il est difficile de discerner une tendance commune entre les deux exp&#233;riences de la figure 1.
Le seul ph&#233;nom&#232;ne vraiment visible est une chute importante de la pr&#233;cision quand le corpus
devient fortement d&#233;s&#233;quilibr&#233;.
</p>
<p>Maintenant quand l&#8217;anglais est la langue source, nous pouvons observer la m&#234;me tendance entre
les deux graphiques de la figure 2. Ainsi lorsque le corpus comparable est faiblement d&#233;s&#233;quili-
br&#233; (ratio entre 2:1 et 6:1), la pr&#233;cision obtenue est toujours sup&#233;rieure &#224; celle de n&#8217;importe quel
corpus comparable &#233;quilibr&#233;. La pr&#233;cision pouvant &#234;tre am&#233;lior&#233;e jusqu&#8217;&#224; 11 points lorsque le
ratio est de 3:1 par comparaison avec la meilleure pr&#233;cision obtenue avec les corpus compa-
rables &#233;quilibr&#233;s. D&#8217;un autre c&#244;t&#233;, nous observons la m&#234;me chute de pr&#233;cision que pr&#233;c&#233;dem-
ment, bien que moins importante, lorsque le corpus comparable devient fortement d&#233;s&#233;quilibr&#233;
(ratio sup&#233;rieur &#224; 8:1).
</p>
<p>3.3 Combinaison de mesures
</p>
<p>Dans les exp&#233;riences pr&#233;c&#233;dentes, les r&#233;sultats obtenus lorsque le corpus comparable est for-
tement d&#233;s&#233;quilibr&#233; sont relativement surprenants. En fait, nous appliquons la m&#234;me strat&#233;gie
(i.e. les m&#234;mes mesures d&#8217;association) pour les langues source et cible quelle que soit la taille
de la partie anglaise du corpus comparable. Or lorsque la taille de la partie anglaise augmente,
l&#8217;association entre les mots des vecteurs de contexte est plus fiable. Ainsi, une mesure d&#8217;asso-
ciation inadapt&#233;e pour une partie anglaise de taille r&#233;duite peut se r&#233;v&#233;ler pertinente pour une
taille plus grande.
</p>
<p>Nous avons explor&#233; cette hypoth&#232;se en utilisant une mesure d&#8217;association distincte entre les
langues source et cible. Les r&#233;sultats les plus int&#233;ressants ont &#233;t&#233; obtenus en associant l&#8217;IM3
(information mutuelle au cube8) (Daille, 1995) pour la partie fran&#231;aise et l&#8217;IM pour la partie
anglaise. La figure 3 pr&#233;sente les r&#233;sultats obtenus pour cette configuration pour la direction
anglais-fran&#231;ais. Comme nous pouvons le constater, les r&#233;sultats que nous obtenons s&#8217;am&#233;-
</p>
<p>8L&#8217;IM3 est similaire &#224; la mesure d&#8217;IM (cf. &#233;quation 1), mais avec le num&#233;rateur &#233;lev&#233; &#224; la puissance 3. Alors
que l&#8217;IM a tendance &#224; surdimensionner les mots rares, l&#8217;IM3 r&#233;duit cette tendance.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin
</p>
<p>&#0;&#2;&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#4;&#5;&#1;
</p>
<p>&#6;&#2;&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>&#8;&#2;&#1;
</p>
<p>1 2 3 4 5 6 7 8 9 10 11 12 13 14
</p>
<p>&#0;&#1;
</p>
<p>&#0;&#1;
</p>
<p>&#0;&#1;
</p>
<p>&#0;&#1; &#0;&#1;
</p>
<p>&#0;&#1; &#0;&#1;
</p>
<p>&#0;&#1;
</p>
<p>&#0;&#1; &#0;&#1; &#0;&#1;
</p>
<p>&#0;&#1; &#0;&#1;
</p>
<p>&#0;&#1;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#2;&#3;&#2;&#4;&#2;&#3;&#2;&#4;&#2;&#3;&#2;&#4;&#2;
</p>
<p>&#215;
</p>
<p>&#215;
</p>
<p>&#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215; &#215;
</p>
<p>&#215;
</p>
<p>&#215; &#215;
&#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215;
</p>
<p>P
</p>
<p>corpus
&#0;&#2;&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#4;&#5;&#1;
</p>
<p>&#6;&#2;&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>&#8;&#2;&#1;
</p>
<p>1 2 3 4 5 6 7 8 9 10 11 12 13 14
</p>
<p>&#5;&#6;
</p>
<p>&#5;&#6;
</p>
<p>&#5;&#6;
</p>
<p>&#5;&#6;
</p>
<p>&#5;&#6;
</p>
<p>&#5;&#6; &#5;&#6; &#5;&#6;
</p>
<p>&#5;&#6;
</p>
<p>&#5;&#6; &#5;&#6; &#5;&#6;
</p>
<p>&#5;&#6;
</p>
<p>&#5;&#6;
</p>
<p>&#7;
</p>
<p>&#7;
</p>
<p>&#7;&#3;&#7;&#4;&#7;
</p>
<p>&#7;
</p>
<p>&#7;
</p>
<p>&#7;&#3;&#7;&#4;&#7;
</p>
<p>&#7;
</p>
<p>&#7;
</p>
<p>&#7;&#4;&#7;
</p>
<p>&#215; &#215;
&#215; &#215;
</p>
<p>&#215;
</p>
<p>&#215;
&#215; &#215; &#215; &#215;
</p>
<p>&#215;
&#215;
</p>
<p>&#215; &#215;
</p>
<p>P
</p>
<p>corpus
</p>
<p>FIG. 4 &#8211; Pr&#233;cision des traductions obtenues par combinaison de r&#233;sultats pour les directions
fran&#231;ais-anglais &#224; gauche et anglais-fran&#231;ais &#224; droite (moyennes arithm&#233;tique &#8; et harmonique &#9; )
</p>
<p>liorent en fonction de la taille de la partie anglaise du corpus comparable. En outre, lorsque
le ratio entre la partie anglaise et la partie fran&#231;aise devient sup&#233;rieur &#224; 8:1, la pr&#233;cision obte-
nue est sup&#233;rieure &#224; n&#8217;importe quel corpus comparable &#233;quilibr&#233;. La pr&#233;cision est am&#233;lior&#233;e au
mieux de 6 points par comparaison &#224; la meilleure pr&#233;cision obtenue avec les corpus comparables
&#233;quilibr&#233;s.
</p>
<p>3.4 Combinaison de r&#233;sultats
</p>
<p>Comme cela est rappel&#233; dans l&#8217;article de synth&#232;se sur les corpus comparables de Zweigen-
baum &amp; Habert (2006, p. 36) : &#171; Lorsque l&#8217;on dispose de plusieurs m&#233;thodes pour r&#233;soudre un
probl&#232;me, il est souvent plus productif de chercher &#224; les combiner &#187;. Puisque nous disposons
de plusieurs corpus comparables &#233;quilibr&#233;s qui indiquent des variations dans les r&#233;sultats, nous
pouvons appliquer ce propos &#224; notre travail en combinant les r&#233;sultats obtenus pour ces diff&#233;-
rents corpus. Cette technique correspond finalement &#224; une autre mani&#232;re d&#8217;exploiter un corpus
comparable d&#233;s&#233;quilibr&#233;. Nous avons donc explor&#233; cette voie &#224; travers diff&#233;rentes combinai-
sons de r&#233;sultats. Les r&#233;sultats les plus int&#233;ressants ont &#233;t&#233; obtenus en utilisant pour un mot &#224;
traduire i) la moyenne arithm&#233;tique des scores de similarit&#233; des traductions candidates et ii) la
moyenne harmonique des positions des traductions candidates relev&#233;s pour les diff&#233;rents corpus
comparables &#233;quilibr&#233;s.
</p>
<p>La figure 4 pr&#233;sente les r&#233;sultats obtenus avec ces mesures pour les deux directions de tra-
duction. Nous pouvons constater que la combinaison des r&#233;sultats obtenus pour chaque corpus
&#233;quilibr&#233; permet d&#8217;am&#233;liorer significativement la qualit&#233; des traductions identifi&#233;es pour les
deux directions de traduction. Lorsque le fran&#231;ais est la langue source et que le ratio de donn&#233;es
entre les deux langues devient sup&#233;rieur &#224; 3:1, la pr&#233;cision obtenue est sup&#233;rieure au meilleur
r&#233;sultat relev&#233; avec les corpus &#233;quilibr&#233;s avec la moyenne harmonique. En outre, &#224; partir du
ratio 8:1 et pour la m&#234;me mesure, la pr&#233;cision atteint son maximum (67,2 %), soit un gain de
11 points par rapport au meilleur r&#233;sultat obtenu avec les corpus &#233;quilibr&#233;s. En ce qui concerne
la seconde direction de traduction, les r&#233;sultats sont toujours sup&#233;rieurs &#224; ceux relev&#233;s avec les
corpus &#233;quilibr&#233;s utilis&#233;s individuellement. Ici, la pr&#233;cision atteint au mieux 69,7 %, soit un gain
de 13 points par rapport au meilleur r&#233;sultat obtenu avec les corpus &#233;quilibr&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport d&#8217;un corpus comparable d&#233;s&#233;quilibr&#233; &#224; l&#8217;extraction de lexiques bilingues
</p>
<p>4 Conclusion
</p>
<p>Les travaux fondateurs en extraction de lexiques bilingues &#224; partir de corpus comparables ont
&#233;t&#233; entrepris pour suppl&#233;er aux difficult&#233;s rencontr&#233;es avec les corpus parall&#232;les, notamment en
ce qui concerne leur disponibilit&#233;. Partant de ce constat, nous avons &#233;mis l&#8217;hypoth&#232;se que la
filiation entre ces deux sortes de corpus bilingues avait visiblement conduit &#224; travailler avec des
corpus &#233;quilibr&#233;s. En domaines sp&#233;cialis&#233;s, pour lesquels les donn&#233;es disponibles sont moins
volumineuses, le respect de l&#8217;&#233;quilibre du corpus implique de ramener la taille de la partie du
corpus la plus importante &#224; la plus faible. Cette strat&#233;gie ne permet pas de tirer profit de la plus
grande masse de donn&#233;es disponible, notamment lorsque le corpus comporte des donn&#233;es en
langue anglaise pour laquelle de nombreux documents sp&#233;cialis&#233;s sont accessibles.
</p>
<p>Nous avons donc cherch&#233; dans cet article &#224; &#233;tudier l&#8217;influence que pouvait avoir un corpus
comparable sp&#233;cialis&#233; d&#233;s&#233;quilibr&#233; sur la qualit&#233; des lexiques bilingues extraits. Les diff&#233;rentes
exp&#233;riences que nous avons r&#233;alis&#233;es montrent sous quelles conditions un corpus comparable
d&#233;s&#233;quilibr&#233; am&#233;liore la pr&#233;cision des traductions. Ainsi, lorsque la langue source est celle qui
dispose de la plus grande quantit&#233; de donn&#233;es, un corpus faiblement d&#233;s&#233;quilibr&#233; (ratio entre
2:1 et 6:1) permet d&#8217;obtenir un gain significatif qui peut atteindre 11 points ; et un corpus
fortement d&#233;s&#233;quilibr&#233; (ratio sup&#233;rieur &#224; 8:1) un gain de 6 points. En outre, une autre strat&#233;gie
d&#8217;exploitation d&#8217;un corpus d&#233;s&#233;quilibr&#233; consiste &#224; combiner les r&#233;sultats obtenus pour diff&#233;rents
corpus &#233;quilibr&#233;s. Dans ce cas, le gain peut atteindre 13 points.
</p>
<p>D&#8217;autres exp&#233;riences seront n&#233;cessaires pour confirmer ces premiers r&#233;sultats. N&#233;anmoins, nous
esp&#233;rons que ce travail ouvrira la voie &#224; l&#8217;utilisation de corpus comparables sp&#233;cialis&#233;s d&#233;s&#233;qui-
libr&#233;s pour l&#8217;extraction de lexiques bilingues.
</p>
<p>Remerciements
</p>
<p>Ce travail qui s&#8217;inscrit dans le cadre du projet METRICC (www.metricc.com) a b&#233;n&#233;fici&#233;
d&#8217;une aide de l&#8217;Agence Nationale de la Recherche portant la r&#233;f&#233;rence ANR-08-CORD-009.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CHIAO Y.-C. &amp; ZWEIGENBAUM P. (2002a). Looking for candidate translational equivalents
in specialized, comparable corpora. In Proceedings of the 19th International Conference on
Computational Linguistics (COLING&#8217;02), p. 1208&#8211;1212, Tapei, Taiwan.
CHIAO Y.-C. &amp; ZWEIGENBAUM P. (2002b). Looking for French-English Translations in
Comparable Medical Corpora. Journal of the American Society for Information Science, 8,
150&#8211;154.
</p>
<p>CHIAO Y.-C. &amp; ZWEIGENBAUM P. (2003). The Effect of a General Lexicon in Corpus-
Based Identification of French-English Medical Word Translations. In R. BAUD, M. FIESCHI,
P. LE BEUX &amp; P. RUCH, Eds., The New Navigators: from Professionals to Patients, Actes
Medical Informatics Europe, volume 95 of Studies in Health Technology and Informatics, p.
397&#8211;402, Amsterdam: IOS Press.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin
</p>
<p>DAILLE B. (1995). Combined approach for terminology extraction: lexical statistics and
linguistic filtering. Rapport interne 5, Unit for Computer Research on the English (UCREL),
Lancaster University.
DAILLE B. &amp; MORIN E. (2005). French-English Terminology Extraction from Comparable
Corpora. In Proceedings of the 2nd International Joint Conference on Natural Language
Processing (IJCLNP&#8217;05), p. 707&#8211;718, Jeju Island, Korea.
D&#201;JEAN H. &amp; GAUSSIER E. (2002). Une nouvelle approche &#224; l&#8217;extraction de lexiques bi-
lingues &#224; partir de corpus comparables. Lexicometrica, Alignement lexical dans les corpus
multilingues, p. 1&#8211;22.
D&#201;JEAN H., SADAT F. &amp; GAUSSIER E. (2002). An approach based on multilingual thesauri
and model combination for bilingual lexicon extraction. In Proceedings of the 19th Interna-
tional Conference on Computational Linguistics (COLING&#8217;02), p. 218&#8211;224, Tapei, Taiwan.
DUNNING T. (1993). Accurate Methods for the Statistics of Surprise and Coincidence. Com-
putational Linguistics, 19(1), 61&#8211;74.
FANO R. M. (1961). Transmission of Information: A Statistical Theory of Communications.
Cambridge, MA, USA: MIT Press.
FUNG P. (1995). Compiling Bilingual Lexicon Entries from a non-Parallel English-Chinese
Corpus. In Proceedings of the 3rd Annual Workshop on Very Large Corpora (VLC&#8217;95), p.
173&#8211;183, Cambridge, MA, USA.
FUNG P. &amp; MCKEOWN K. (1997). Finding Terminology Translations from Non-parallel
Corpora. In Proceedings of the 5th Annual Workshop on Very Large Corpora (VLC&#8217;97), p.
192&#8211;202, Hong Kong.
GREFENSTETTE G. (1994a). Corpus-Derived First, Second and Third-Order Word Affini-
ties. In Proceedings of the 6th Congress of the European Association for Lexicography (EUR-
ALEX&#8217;94), p. 279&#8211;290, Amsterdam, The Netherlands.
GREFENSTETTE G. (1994b). Explorations in Automatic Thesaurus Discovery. Boston, MA,
USA: Kluwer Academic Publisher.
MORIN E., DAILLE B., TAKEUCHI K. &amp; KAGEURA K. (2007). Bilingual Terminology Mi-
ning &#8211; Using Brain, not brawn comparable corpora. In Proceedings of the 45th Annual Meeting
of the Association for Computational Linguistics (ACL&#8217;07), p. 664&#8211;671, Prague, Czech Repu-
blic.
RAPP R. (1995). Identify Word Translations in Non-Parallel Texts. In Proceedings of the
35th Annual Meeting of the Association for Computational Linguistics (ACL&#8217;95), p. 320&#8211;322,
Boston, MA, USA.
RAPP R. (1999). Automatic Identification of Word Translations from Unrelated English and
German Corpora. In Proceedings of the 37th Annual Meeting of the Association for Compu-
tational Linguistics (ACL&#8217;99), p. 519&#8211;526, College Park, MD, USA.
SALTON G. &amp; LESK M. E. (1968). Computer evaluation of indexing and text processing.
Journal of the Association for Computational Machinery, 15(1), 8&#8211;36.
TANAKA K. &amp; IWASAKI H. (1996). Extraction of Lexical Translations from Non-Aligned
Corpora. In Proceedings of the 16th International Conference on Computational Linguistics
(COLING&#8217;96), volume 2, p. 580&#8211;585, Copenhagen, Denmark.
ZWEIGENBAUM P. &amp; HABERT B. (2006). Faire se rencontrer les parall&#232;les : regards croi-
s&#233;s sur l&#8217;acquisition lexicale monolingue et multilingue. Revue de sociolinguistique en ligne
GLOTTOPOL, 8, 22&#8211;44.</p>

</div></div>
</body></html>