<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Exploitation du terrain commun pour la production d&#8217;expressions r&#233;f&#233;rentielles dans les syst&#232;mes de dialogue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Exploitation du terrain commun pour la production
d&#8217;expressions r&#233;f&#233;rentielles dans les syst&#232;mes de dialogue
</p>
<p>Alexandre Denis Matthieu Quignard
UMR 7503 LORIA/CNRS &#8211; Campus scientifique
</p>
<p>56 506 Vandoeuvre-l&#232;s-Nancy Cedex
alexandre.denis@loria.fr, matthieu.quignard@loria.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente un moyen de contraindre la production d&#8217;expressions r&#233;-
f&#233;rentielles par un syst&#232;me de dialogue en fonction du terrain commun. Cette capacit&#233;, fonda-
mentale pour atteindre la compr&#233;hension mutuelle, est trop souvent oubli&#233;e dans les syst&#232;mes de
dialogue. Le mod&#232;le que nous proposons s&#8217;appuie sur une mod&#233;lisation du processus d&#8217;ancrage
(grounding process) en proposant un raffinement du statut d&#8217;ancrage appliqu&#233; &#224; la description
des r&#233;f&#233;rents. Il d&#233;crit quand et comment ce statut doit &#234;tre r&#233;vis&#233; en fonction des jugements
de compr&#233;hension des deux participants ainsi que son influence dans le choix d&#8217;une description
partag&#233;e destin&#233;e &#224; la g&#233;n&#233;ration d&#8217;une expression r&#233;f&#233;rentielle.
</p>
<p>Abstract. This paper presents a way to constraint the production of referring expressions
by a dialogue system according to the common ground. This ability &#8211; fundamental for reaching
mutual understanding &#8211; is often neglected in dialogue system design. The proposed model is
based on a view of the grounding process and offering a refinement of the grounding status
concerning the referent description. It explains how and when this status should be revised with
respect to how participants evaluate their understanding and how this status may help to choose
a shared description with which a referring expression can be generated.
</p>
<p>Mots-cl&#233;s : Compr&#233;hension mutuelle, processus d&#8217;ancrage, r&#233;f&#233;rence, g&#233;n&#233;ration.
</p>
<p>Keywords: Mutual understanding, grounding process, referring expression, generation.
</p>
<p>1 Probl&#233;matique
</p>
<p>Nous soulevons dans cet article la question de la prise en compte de l&#8217;utilisateur par les sys-
t&#232;mes de dialogue gr&#226;ce &#224; la construction d&#8217;un terrain commun, et plus particuli&#232;rement celle
du statut d&#8217;un &#233;nonc&#233; relativement au terrain commun. Le terrain commun est avant tout une
notion propos&#233;e par les philosophes pour rassembler sous un m&#234;me concept l&#8217;ensemble des
connaissances partag&#233;es et permettre de d&#233;crire leur influence dans la communication, que ce
soit sous la forme de conventions (Lewis, 1969), ou de pr&#233;suppositions (Stalnaker, 1978).
</p>
<p>Les syst&#232;mes de dialogue sont des interfaces fragiles dont la robustesse se heurte &#224; la com-
plexit&#233; de la langue et de l&#8217;interaction. Or, la gestion du terrain commun peut &#234;tre une solution
&#224; ces difficult&#233;s : par le dialogue, le syst&#232;me peut construire un terrain commun facilitant la
communication ult&#233;rieure. Cependant, deux conceptions de la nature du terrain commun et de
son utilisation s&#8217;opposent. D&#8217;un c&#244;t&#233;, le terrain commun est un ensemble explicite de connais-
sances/croyances : les participants construisent explicitement cet ensemble de connaissances</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>partag&#233;es en consid&#233;rant le point de vue d&#8217;autrui. Afin de produire un &#233;nonc&#233;, ils s&#8217;appuient sur
cet ensemble de mani&#232;re &#224; d&#233;terminer les expressions les plus susceptibles d&#8217;&#234;tre comprises.
Dans cette perspective, issue des travaux de (Clark, 1996; Lewis, 1969; Stalnaker, 1978), le
terrain commun est repr&#233;sent&#233; comme un ensemble infini de croyances r&#233;ciproques &#233;ventuelle-
ment g&#233;n&#233;r&#233; &#224; partir d&#8217;une base partag&#233;e ou d&#8217;une repr&#233;sentation r&#233;cursive (Barwise, 1988).
</p>
<p>Toutefois, d&#8217;autres auteurs soul&#232;vent la question du co&#251;t cognitif d&#8217;une repr&#233;sentation explicite
du point de vue d&#8217;autrui et opposent alors &#224; cette approche le fait que l&#8217;interpr&#233;tation ou la
production d&#8217;un &#233;nonc&#233; est r&#233;alis&#233;e avant tout d&#8217;un point de vue &#233;gocentrique. Ainsi, Horton &amp;
Keysar (1996) montrent que la prise en compte d&#8217;autrui est conditionn&#233;e par l&#8217;absence de pres-
sion temporelle, ou encore Barr (2004) sugg&#232;re qu&#8217;une croyance mutuelle n&#8217;est pas n&#233;cessaire
pour prendre en compte autrui. Cette approche qui ne n&#233;cessite pas une repr&#233;sentation explicite
du point de vue d&#8217;autrui, conduit &#224; une construction implicite du terrain commun. Dans (Gar-
rod &amp; Pickering, 2004), l&#8217;utilisation d&#8217;une expression linguistique provoque l&#8217;alignement des
repr&#233;sentations (au niveau lexical, syntaxique, conceptuel) par un m&#233;canisme de saillance. Par
exemple l&#8217;emploi par A d&#8217;une certaine description pour r&#233;f&#233;rer &#224; un objet rend cette description
saillante et favorise alors la reprise de cette description par B pour r&#233;f&#233;rer au m&#234;me objet. En
cons&#233;quence, la coordination des deux participants dans l&#8217;exp&#233;rience de Clark &amp; Wilkes-Gibbs
(1986) ne serait pas d&#251;e &#224; la repr&#233;sentation explicite de la capacit&#233; d&#8217;interpr&#233;tation d&#8217;autrui
mais &#224; la saillance d&#8217;une description utilis&#233;e avec succ&#232;s. On retrouve ce point de vue dans les
travaux r&#233;cents de Larsson (2007) et de Mills &amp; Healey (2008) sous le concept de plasticit&#233;
s&#233;mantique : d&#8217;une part les participants peuvent s&#8217;aligner sur les m&#234;mes moyens de d&#233;crire les
objets, mais en outre ces moyens peuvent &#233;voluer et faire l&#8217;objet en particulier d&#8217;optimisations
facilitant la communication.
</p>
<p>Nous proposons dans cet article un mod&#232;le computationnel de l&#8217;ancrage qui int&#232;gre une compo-
sante implicite similaire &#224; l&#8217;alignement par la prise en compte d&#8217;un statut d&#8217;ancrage portant sur
les descriptions conceptuelles. L&#8217;exemple ci-dessous (figure 1) illustre les probl&#232;mes de coor-
dination en l&#8217;absence de prise en compte d&#8217;autrui. Il s&#8217;agit d&#8217;un exemple issu d&#8217;une &#233;valuation
du processus d&#8217;ancrage par simulation que nous avons conduite dans (Denis, 2008). Le but &#233;tait
de faire dialoguer deux syst&#232;mes dot&#233;s de capacit&#233;s d&#8217;ancrage &#224; propos de l&#8217;interpr&#233;tation d&#8217;un
&#233;nonc&#233; afin de v&#233;rifier dans quelle mesure ils &#233;taient capables de converger. L&#8217;int&#233;r&#234;t de cette
&#233;valuation est d&#8217;avoir permis de soulever de nombreux probl&#232;mes de mod&#233;lisation de l&#8217;ancrage,
en consid&#233;rant le syst&#232;me &#224; la fois comme celui qui soul&#232;ve les probl&#232;mes et &#224; la fois celui qui
les r&#233;sout. Elle a permis en particulier de conclure &#224; la n&#233;cessit&#233; d&#8217;un ancrage plus fin.
</p>
<p>C80 &#8212; ok, interpr&#232;te &#8220;et le troisi&#232;me&#8221;
T81 &#8212; ok, l&#8217;h&#244;tel des Lilas
C82 &#8212; non, l&#8217;h&#244;tel EtapHotel
T83 &#8212; je ne comprends pas &#8220;l&#8217;h&#244;tel&#8221;. C&#8217;est ambigu.
</p>
<p>Le Lilas ou la Chapelle ou l&#8217;h&#244;tel Etap, lequel h&#244;tel
C84 &#8212; l&#8217;h&#244;tel EtapHotel
T85 &#8212; je ne comprends pas &#8220;l&#8217;h&#244;tel&#8221;. C&#8217;est ambigu.
</p>
<p>Le Lilas ou la Chapelle ou l&#8217;h&#244;tel Etap, lequel h&#244;tel
C86 &#8212; laisse tomber
</p>
<p>FIG. 1 &#8211; Exemple de probl&#232;me de coordination (miroir 712, Denis, 2008)
</p>
<p>Le probl&#232;me, ici, provient de l&#8217;expression &#171; l&#8217;h&#244;tel EtapHotel &#187; (C82), qui n&#8217;est pas comprise par
T et qui fait l&#8217;objet d&#8217;une question de clarification en T83. Le syst&#232;me C r&#233;pond effectivement
&#224; la question mais en adoptant son propre point de vue au lieu de consid&#233;rer que l&#8217;expression</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation du terrain commun pour la production d&#8217;expressions r&#233;f&#233;rentielles
</p>
<p>&#171; l&#8217;h&#244;tel EtapHotel &#187; est probl&#233;matique pour C. Deux indices au moins peuvent pourtant le
guider dans la formulation de sa r&#233;ponse : d&#8217;abord l&#8217;existence m&#234;me d&#8217;une non-compr&#233;hension
par T sugg&#232;re que l&#8217;expression probl&#233;matique ne devrait pas &#234;tre r&#233;utilis&#233;e, ensuite la mention
de &#171; l&#8217;h&#244;tel Etap &#187; par T en T83 devrait permettre au syst&#232;me C de pr&#233;f&#233;rer cette formulation.
</p>
<p>2 Mod&#232;les computationnels d&#8217;ancrage
</p>
<p>La probl&#233;matique de l&#8217;ancrage dans les syst&#232;mes de dialogue consiste &#224; apporter une r&#233;ponse
computationnelle &#224; ces trois questions : que met-on dans le terrain commun ? comment modifie-
t-on le terrain commun ? et comment utilise-t-on le terrain commun ?
</p>
<p>Les r&#233;ponses computationnelles &#224; ces questions sont en g&#233;n&#233;ral des d&#233;veloppements dans le
cadre du mod&#232;le collaboratif de (Clark &amp;Wilkes-Gibbs, 1986; Clark &amp; Schaefer, 1989), appel&#233;
&#233;galement mod&#232;le des contributions. A l&#8217;origine, ce mod&#232;le part d&#8217;une critique de Stalnaker
(1978) &#224; propos des conditions que doit satisfaire un &#233;nonc&#233; pour appartenir au terrain com-
mun. Chez Stalnaker, un &#233;nonc&#233; peut rejoindre le terrain commun s&#8217;il n&#8217;est pas contredit. Mais
cette condition ne rend, &#224; elle seule, pas compte des preuves de compr&#233;hension positives (tels
les &#171; Ok &#187;1). Afin d&#8217;expliquer ces preuves de compr&#233;hension, le mod&#232;le des contributions s&#8217;ap-
puie sur un crit&#232;re appel&#233; grounding criterion (crit&#232;re d&#8217;ancrage) que les participants cherchent
&#224; atteindre : &#171; le locuteur et ses interlocuteurs croient mutuellement que les interlocuteurs ont
compris suffisamment le locuteur &#187;. Dans une perspective &#233;pist&#233;mique classique, la croyance
mutuelle est un ensemble infini de croyances r&#233;ciproques (voir (Clark &amp; Marshall, 1981; Bar-
wise, 1988)). Le crit&#232;re motive alors l&#8217;expression de preuves positives de compr&#233;hension par
l&#8217;interlocuteur. Ce crit&#232;re et le statut d&#8217;ancrage associ&#233; sont alors binaires, soit les participants
croient mutuellement &#224; la bonne compr&#233;hension, soit ils n&#8217;y croient pas. On dira qu&#8217;un &#233;nonc&#233;
est ancr&#233; (grounded) lorsque ce crit&#232;re est satisfait et on dira que son statut est G.
</p>
<p>Le statut d&#8217;ancrage prend une importance particuli&#232;re dans un des premiers mod&#232;les computa-
tionnels s&#8217;inspirant du mod&#232;le des contributions, le mod&#232;le des grounding acts (Traum, 1994).
De la m&#234;me mani&#232;re que le mod&#232;le des contributions, le mod&#232;le des grounding acts suppose
que les participants cherchent &#224; atteindre le statut G. Cependant, contrairement au mod&#232;le des
contributions, l&#8217;ancrage n&#8217;est pas binaire. Chaque unit&#233; de discours est associ&#233;e &#224; un &#233;tat relatif
&#224; l&#8217;ancrage, un &#233;tat interm&#233;diaire avant d&#8217;atteindre l&#8217;&#233;tat G. Par exemple : r&#233;ception d&#8217;une de-
mande de clarification, d&#8217;une r&#233;paration, d&#8217;une confirmation, etc. Le statut d&#8217;ancrage peut alors
&#234;tre directement associ&#233; aux actes n&#233;cessaires pour atteindre l&#8217;&#233;tatG. Cette d&#233;finition permet de
donner une mod&#233;lisation computationnelle de l&#8217;ancrage &#233;tant donn&#233; que le syst&#232;me sait quels
actes il doit produire pour ancrer une unit&#233; de discours. Le mod&#232;le est en l&#8217;occurrence d&#233;fini
sous forme d&#8217;automate &#224; &#233;tats finis. En revanche, comme Bunt le note (Bunt et al., 2007), le
mod&#232;le des grounding acts ne d&#233;crit pas comment le contenu lui-m&#234;me peut &#234;tre ancr&#233;. Il ne
d&#233;crit pas non plus pr&#233;cisemment l&#8217;influence de ces diff&#233;rents &#233;tats sur le choix des contenus &#224;
produire (par exemple au niveau des expressions r&#233;f&#233;rentielles).
</p>
<p>Dans Poesio &amp; Traum (1997), le contenu des contributions fait l&#8217;objet d&#8217;un ancrage fin gr&#226;ce &#224; la
prise en compte de micro-&#233;v&#233;nements conversationnels. Ces micro-&#233;v&#233;nements correspondant
&#224; l&#8217;&#233;nonciation de mots ou de groupes de mots, l&#8217;ancrage des diff&#233;rentes parties d&#8217;une forme s&#233;-
mantique devient possible. Le statut d&#8217;ancrage lui-m&#234;me d&#233;rive du mod&#232;le des grounding acts
</p>
<p>1Cette critique vaut par ailleurs pour des approches plus r&#233;centes, qui s&#8217;inspirent de (Allwood, 1995) comme
(Larsson, 2002; Ginzburg, 2007).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>mais la traduction des effets des diff&#233;rents grounding acts est incompl&#232;te. Seuls deux statuts
sont consid&#233;r&#233;s : G et G, l&#8217;initiation d&#8217;un &#233;v&#233;nement conversationnel, sa continuation ou r&#233;pa-
ration entra&#238;nant un statut G et la r&#233;ception d&#8217;une confirmation un statut G. D&#8217;autres travaux
s&#8217;attachent &#224; d&#233;finir &#233;galement le statut d&#8217;ancrage, en particulier pour un groupe d&#8217;individus
(Gaudou et al., 2006), mais ces travaux ne consid&#232;rent pas les ph&#233;nom&#232;nes d&#8217;incompr&#233;hension,
la non-compr&#233;hension ou la mauvaise compr&#233;hension (Hirst et al., 1994).
</p>
<p>Cependant, d&#8217;une part le contenu m&#234;me des contributions doit &#234;tre pris en compte dans un
mod&#232;le computationnel et d&#8217;autre part un statut d&#8217;ancrage binaire ne peut pas &#234;tre suffisant pour
d&#233;crire la relation entre une information et le terrain commun. Nous supposons que le choix
d&#8217;une bonne formulation n&#233;cessite d&#8217;affiner le statut d&#8217;ancrage en distinguant les informations
que le syst&#232;me croit partag&#233;es (le statutG), des informations qu&#8217;il croit ne pas &#234;tre partag&#233;es (le
statut G) et des informations dont il ignore si elles sont effectivement partag&#233;es (le statut G&#771;).
</p>
<p>3 Notre proposition
</p>
<p>Notre contribution se situe au niveau de la d&#233;finition du crit&#232;re et du statut d&#8217;ancrage et de son
utilisation pour le choix d&#8217;une description &#224; produire. Nous distinguons trois &#233;tapes. D&#8217;abord
on doit &#234;tre capable de d&#233;terminer quand et comment d&#233;clarer un &#233;nonc&#233; ancr&#233;. Ensuite, on
doit &#234;tre capable d&#8217;associer le statut d&#8217;ancrage non pas &#224; un &#233;nonc&#233; entier mais &#224; des fragments
de l&#8217;&#233;nonc&#233; (par exemple au niveau r&#233;f&#233;rentiel). Enfin on doit &#234;tre capable de s&#8217;appuyer sur le
statut d&#8217;ancrage courant afin de d&#233;terminer la forme de l&#8217;&#233;nonc&#233; suivant. Nous d&#233;taillons ici ces
trois &#233;tapes et illustrons le mod&#232;le sur un exemple.
</p>
<p>3.1 D&#233;termination du statut d&#8217;ancrage
</p>
<p>Dans (Denis, 2008; Denis &amp; Quignard, 2008), nous avons propos&#233; un mod&#232;le d&#8217;ancrage fond&#233;
sur la notion de jugement de compr&#233;hension. Les jugements de compr&#233;hension correspondent
&#224; une repr&#233;sentation de l&#8217;attitude mentale des deux participants &#224; propos de la convergence de
l&#8217;interpr&#233;tation d&#8217;un &#233;nonc&#233;. Nous repr&#233;sentons la convergence interpr&#233;tative par la proposition
UndX Yi, c&#8217;est-&#224;-dire &#171;X comprend l&#8217;&#233;nonc&#233; Yi comme Y &#187;. Un jugement de compr&#233;hension
est alors l&#8217;estimation de la v&#233;rit&#233; de cette proposition pour un &#233;nonc&#233; donn&#233;, par un participant
donn&#233;, et nous notons XY (Zi) l&#8217;estimation par X de UndY (Zi). La combinatoire permet alors
de distinguer quatre types de jugements (en appelant les deux participants S pour Self etO pour
Other) :
</p>
<p>&#8211; SS(Oi) : est-ce que selon moi UndS Oi est vraie ?
&#8211; OS(Oi) : est-ce que selon mon partenaire UndS Oi est vraie (selon moi) ?
&#8211; SO(Sj) : est-ce que selon moi UndO Sj est vraie ?
&#8211; OO(Sj) : est-ce que selon mon partenaire UndO Sj est vraie (selon moi) ?
</p>
<p>Nous reprenons la notation introduite par Cahn (1992) pour d&#233;crire la valeur de ces jugements.
Pour les jugements positifs ou n&#233;gatifs d&#8217;un individu sur sa propre interpr&#233;tation SS et OO,
autrement dit est-ce que je (S ou O) crois comprendre (est-ce que l&#8217;&#233;nonc&#233; semble analys&#233;
correctement, sans ambigu&#239;t&#233; ou incertitude ?), cette valeur sera not&#233;e U ou U , pour UNDERS-
TOOD. Pour les jugements d&#8217;un individu sur l&#8217;interpr&#233;tation de son partenaire OS et SO, au-
trement dit est-ce que je (S ou O) crois que tu comprends (est-ce que tu as interpr&#233;t&#233; l&#8217;&#233;nonc&#233;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation du terrain commun pour la production d&#8217;expressions r&#233;f&#233;rentielles
</p>
<p>comme moi ?), elle sera not&#233;e R ou R, pour RELEVANT - ici RELEVANT correspond seulement
au niveau de la compr&#233;hension et pas &#224; un niveau plus g&#233;n&#233;ral de pertinence.
</p>
<p>Dans cette perspective, l&#8217;ancrage d&#8217;un &#233;nonc&#233; revient &#224; &#233;tablir des jugements positifs. Ainsi :
</p>
<p>&#8211; Oi est ancr&#233; selon S : GS(Oi) &#8801; (SS(Oi) = U &#8743;OS(Oi) = R)
&#8211; Sj est ancr&#233; selon S : GS(Sj) &#8801; (OO(Sj) = U &#8743; SO(Sj) = R)
Ce crit&#232;re d&#8217;ancrage nous permet de consid&#233;rer l&#8217;influence de la non-compr&#233;hension (U ) ou de
la mauvaise compr&#233;hension (R) qu&#8217;elle provienne de soi ou d&#8217;autrui, et de motiver la manifes-
tation de preuves positives de compr&#233;hension. Il permet d&#8217;autre part de r&#233;soudre le probl&#232;me de
l&#8217;acceptation r&#233;cursive en consid&#233;rant que la prise en compte d&#8217;une preuve de compr&#233;hension,
et alors de ses effets sur les &#233;nonc&#233;s ant&#233;rieurs ne n&#233;cessite qu&#8217;une estimation propre de com-
pr&#233;hension (SS(Oi) = U ) et pas son ancrage comme Traum (1999) le laisse entendre dans sa
formulation du probl&#232;me2.
</p>
<p>Atteindre le crit&#232;re d&#8217;ancrage n&#233;cessite alors de prendre en compte aussi bien son propre juge-
ment (SS et SO) que les jugements d&#8217;autrui (OO et OS) gr&#226;ce aux preuves de compr&#233;hension
que ce dernier manifeste dans ses &#233;nonc&#233;s ult&#233;rieurs. Par exemple, une question de clarification
traduit un jugement OO n&#233;gatif, tandis qu&#8217;un &#233;nonc&#233; du type &#171; non je voulais dire... &#187; corres-
pond &#224; un jugement OS n&#233;gatif. Cependant, &#233;tant donn&#233; que les preuves de compr&#233;hension
ne visent pas seulement &#224; manifester la compr&#233;hension de l&#8217;&#233;nonc&#233; qui pr&#233;c&#232;de (penser par
exemple aux questions de clarification qui entra&#238;nent un ancrage diff&#233;r&#233; de l&#8217;&#233;nonc&#233; clarifi&#233;),
les jugements seuls sont insuffisants pour la gestion compl&#232;te de l&#8217;ancrage. Nous avons propos&#233;
dans (Denis &amp; Quignard, 2008) de repr&#233;senter les d&#233;pendances entre &#233;nonc&#233;s sous la forme
d&#8217;une structure de dialogue, dans l&#8217;esprit de (Cahn, 1992). Les preuves de compr&#233;hension sont
vues alors comme des op&#233;rateurs de mise &#224; jour de la structure et de d&#233;clenchement de r&#233;inter-
pr&#233;tations. Nous ne d&#233;taillons cependant pas ici, ni la construction des jugements, ni la mise &#224;
jour de la structure (voir (Denis, 2008)) mais l&#8217;illustrons sur un exemple.
</p>
<p>O1 &#8212; &#224; combien est cet h&#244;tel ?
S2 &#8212; quel h&#244;tel ?
O3 &#8212; l&#8217;h&#244;tel Ibis
S4 &#8212; les chambres &#224; l&#8217;h&#244;tel Ibis sont &#224; 20 euros
</p>
<p>FIG. 2 &#8211; Exemple de non-compr&#233;hension, manifest&#233;e en S2
</p>
<p>Dans l&#8217;exemple de non-compr&#233;hension (figure 2), S manifeste un jugement SS n&#233;gatif (U )
dans son &#233;nonc&#233; S2 &#224; propos de la convergence interpr&#233;tative de O1 ; O1 ne peut alors &#234;tre
ancr&#233;. Lorsque S re&#231;oit O3, &#233;nonc&#233; qu&#8217;il juge U puisqu&#8217;il estime le comprendre et R puisqu&#8217;il
estime que O a effectivement compris S2, il peut r&#233;interpr&#233;ter O1 et consid&#233;rer d&#233;sormais que
SS(O1) = U . Il ignore en revanche le jugement OS(O1) : il est tout &#224; fait possible en effet
qu&#8217;il interpr&#232;te de mani&#232;re erron&#233;e la r&#233;ponse fournie enO3 et r&#233;interpr&#232;te malO1. Notre crit&#232;re
consid&#232;re qu&#8217;il n&#8217;a pas de preuve suffisante pour &#233;tablir le statut d&#8217;ancrage. En revanche, lorsque
son propre &#233;nonc&#233; S2 re&#231;oit une r&#233;ponse pertinente en O3 jug&#233;e UR, S peut estimer que d&#8217;une
part O n&#8217;a vraisemblablement pas de probl&#232;me de non-compr&#233;hension avec S2 (c&#8217;est-&#224;-dire
OO(S2) = U ), et d&#8217;autre part que O semble effectivement bien avoir compris S2 (c&#8217;est-&#224;-dire
SO(S2) = R). Selon lui, les preuves sont alors suffisantes pour que S2 soit ancr&#233;.
</p>
<p>2Plus pr&#233;cisemment, il est seulement n&#233;cessaire que le jugement de compr&#233;hension SS soit positif au niveau
de la preuve, afin que celle-ci puisse jouer des effets relatifs &#224; l&#8217;ancrage (voir (Traum, 1999) pour la distinction
entre niveau de la preuve et contenu propositionnel).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>3.2 Raffinement du statut d&#8217;ancrage
</p>
<p>Le crit&#232;re d&#8217;ancrage que nous venons de d&#233;crire permet de consid&#233;rer les statuts G ou G d&#8217;un
&#233;nonc&#233; entier. Ce statut est toutefois insuffisant pour g&#233;rer correctement l&#8217;exemple de la fi-
gure 1 comme nous l&#8217;avons indiqu&#233;. Nous proposons alors deux types de raffinement du statut.
D&#8217;abord, nous proposons de consid&#233;rer un statut interm&#233;diaire G&#771; correspondant &#224; l&#8217;estimation
propre de compr&#233;hension, c&#8217;est-&#224;-dire &#224; la premi&#232;re partie du crit&#232;re d&#8217;ancrage (en cons&#233;quence
G&#8658; G&#771;). Ce statut nous permet de mettre en &#339;uvre des actions qui ont seulement besoin d&#8217;une
estimation de bonne compr&#233;hension et pas de l&#8217;ancrage. C&#8217;est le cas, en particulier, de la r&#233;uti-
lisation de l&#8217;expression &#171; l&#8217;h&#244;tel Etap &#187; dans l&#8217;exemple 1. Nous d&#233;finissons alors :
</p>
<p>&#8211; Oi est pr&#233;-ancr&#233; selon S : G&#771;(Oi) &#8801; (SS(Oi) = U)
&#8211; Sj est pr&#233;-ancr&#233; selon S : G&#771;(Sj) &#8801; (OO(Sj) = U)
Le second type de raffinement concerne les objets sur lesquels s&#8217;appliquent les statuts et les
jugements de compr&#233;hension. Nous proposons d&#8217;appliquer les jugements sur des parties de
description et d&#8217;introduire des unit&#233;s de granularit&#233; plus fine que les &#233;nonc&#233;s. On repr&#233;sente
chaque r&#233;f&#233;rent comme un ensemble de descripteurs o&#249; chaque descripteur est un pr&#233;dicat
binaire. Par exemple, une description s&#233;mantique d&#8217;une chambre double &#224; 50 euros d&#8217;identifiant
r1 pourrait &#234;tre :
</p>
<p>{objet(r1 chambre), type(r1 double), prix(r1 50)}
Nous d&#233;finissons ensuite le pr&#233;dicat referX(DY , F ) vrai si selon le participantX le descripteur
DY utilis&#233; par le participant Y peut effectivement &#234;tre utilis&#233; pour acc&#233;der au r&#233;f&#233;rent F (voir
Kleiber (1994, p. 56) pour l&#8217;accessibilit&#233; r&#233;f&#233;rentielle). Cette proposition remplace la proposi-
tion de convergence interpr&#233;tative introduite pr&#233;c&#233;demment et son estimation par chacun des
deux participants peut &#234;tre utilis&#233;e pour &#233;tablir des jugements sur les descripteurs :
</p>
<p>&#8211; SS(DO, F ) : est-ce que selon moi referS(DO, F ) ?
&#8211; OS(DO, F ) : est-ce que selon mon partenaire referS(DO, F ) (selon moi) ?
&#8211; SO(DS, F ) : est-ce que selon moi referO(DS, F ) ?
&#8211; OO(DS, F ) : est-ce que selon mon partenaire referO(DS, F ) (selon moi) ?
</p>
<p>On peut consid&#233;rer de la m&#234;me fa&#231;on les valeurs de ces jugements pour d&#233;terminer le statut
d&#8217;ancrage d&#8217;un descripteur en tant qu&#8217;acc&#232;s &#224; un r&#233;f&#233;rent F :
</p>
<p>&#8211; l&#8217;acc&#232;s de DO &#224; F est ancr&#233; selon S : GS(DO, F ) &#8801; (SS(DO, F ) = U &#8743;OS(DO, F ) = R)
&#8211; l&#8217;acc&#232;s de DS &#224; F est ancr&#233; selon S : GS(DS, F ) &#8801; (OO(DS, F ) = U &#8743; SO(DS, F ) = R)
&#8211; l&#8217;acc&#232;s de DO &#224; F est pr&#233;-ancr&#233; selon S : G&#771;S(DO, F ) &#8801; (SS(DO, F ) = U)
&#8211; l&#8217;acc&#232;s de DS &#224; F est pr&#233;-ancr&#233; selon S : G&#771;S(DS, F ) &#8801; (OO(DS, F ) = U)
</p>
<p>3.3 Exploitation du terrain commun pour la g&#233;n&#233;ration
</p>
<p>Etant donn&#233; qu&#8217;on est capable d&#8217;associer un statut d&#8217;ancrage aux descripteurs, on peut s&#8217;ap-
puyer sur ce statut pour d&#233;terminer si un descripteur potentiel d&#8217;un r&#233;f&#233;rent, du point de vue
de celui qui en produit une r&#233;f&#233;rence, sera oui ou non bien compris par son partenaire. Nous
ne d&#233;crivons pas ici un algorithme g&#233;n&#233;rique de g&#233;n&#233;ration (Dale &amp; Reiter, 1995), mais d&#233;cri-
vons seulement l&#8217;influence du statut d&#8217;ancrage dans le choix des descripteurs. On peut alors
supposer qu&#8217;une premi&#232;re phase de g&#233;n&#233;ration filtre l&#8217;ensemble de la description afin de s&#233;-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation du terrain commun pour la production d&#8217;expressions r&#233;f&#233;rentielles
</p>
<p>lectionner les ensembles de descripteurs discriminants. A l&#8217;issue de cette premi&#232;re phase, on
obtient alors un ensemble d&#8217;ensembles de descripteurs, c&#8217;est-&#224;-dire E = {E1..En} o&#249; chaque
Ei est un ensemble de descripteurs.
</p>
<p>Dans le cas d&#8217;une premi&#232;re mention &#224; un r&#233;f&#233;rent, on ignore le statut d&#8217;ancrage des descrip-
teurs, on supposera alors qu&#8217;ils sont tous potentiellement utilisables pour la g&#233;n&#233;ration d&#8217;une
expression. Dans les autres cas, le filtre peut s&#8217;appuyer sur le statut d&#8217;ancrage :
</p>
<p>1. R := {E &#8712; E/&#8704;D &#8712; E,GS(D,F )}, c&#8217;est-&#224;-dire qu&#8217;on ne retient d&#8217;abord que tous les
ensembles de descripteurs qui satisfont tous GS ,
</p>
<p>2. si R = &#8709;, R := {E &#8712; E/&#8704;D &#8712; E, G&#771;S(D,F )}, c&#8217;est-&#224;-dire s&#8217;il n&#8217;y a aucun ensemble
de descripteurs satisfaisant GS , on retient tous les ensembles de descripteurs qui satisfont
tous G&#771;S ,
</p>
<p>3. siR = &#8709;, sortir une erreur, il n&#8217;existe aucune expression qui ne soit pas probl&#233;matique, il
est alors n&#233;cessaire d&#8217;employer une strat&#233;gie alternative comme un ordinal &#171; le premier &#187;,
une alt&#233;rit&#233; &#171; l&#8217;autre &#187; ou s&#8217;appuyer sur une autre modalit&#233; telle le geste.
</p>
<p>3.4 Exemple
</p>
<p>Nous partons d&#8217;une version r&#233;vis&#233;e/simplifi&#233;e du dialogue dans laquelle S et O parviennent &#224;
se comprendre gr&#226;ce &#224; la prise en compte du point de vue de O par S.
</p>
<p>Enonc&#233; Statuts du point de vue de S
</p>
<p>S1 &#8212; l&#8217;h&#244;tel EtapHotel
O2 &#8212; le Lilas ou l&#8217;h&#244;tel Etap, SS(nom(h1Etap), h1) = U
</p>
<p>quel h&#244;tel ? OO(objet(h1 hotel), h1) = U
SO(objet(h1 hotel), h1) = R
OO(nom(h1EtapHotel), h1) = U
</p>
<p>S3 &#8212; l&#8217;h&#244;tel Etap
O4 &#8212; ok donc l&#8217;h&#244;tel Etap OS(nom(h1Etap), h1) = R
</p>
<p>FIG. 3 &#8211; Extrait simplifi&#233;
</p>
<p>Nous nous pla&#231;ons du point de vue de S, qui conna&#238;t les deux noms possibles de l&#8217;h&#244;tel Eta-
pHotel (EtapHotel ou Etap). Celui-ci produit une r&#233;f&#233;rence &#224; l&#8217;h&#244;tel EtapHotel (h1) en utili-
sant deux descripteurs objet(h1 hotel) et nom(h1EtapHotel). On suppose qu&#8217;il ignore l&#8217;an-
crage de ces descripteurs et qu&#8217;il ignore alors si l&#8217;expression &#171; l&#8217;h&#244;tel EtapHotel &#187; sera com-
prise par O. Or O manifeste en O2 sa non-compr&#233;hension. Cette non-compr&#233;hension est pr&#233;-
sent&#233;e en deux temps, d&#8217;abord par une alternative puis par une question de clarification. La
mention de l&#8217;expression &#171; l&#8217;h&#244;tel Etap &#187;, comprise par S, le conduit &#224; construire le jugement
SS(nom(h1Etap), h1) = U .
</p>
<p>Ensuite, la question de clarification &#171; quel h&#244;tel ? &#187; a deux cons&#233;quences. Elle permet d&#8217;une part
d&#8217;&#233;tablir queO comprend effectivement que &#171; l&#8217;h&#244;tel EtapHotel &#187; r&#233;f&#232;re &#224; un h&#244;tel. S peut donc
construire les jugements :
</p>
<p>OO(objet(h1 hotel), h1) = U SO(objet(h1 hotel), h1) = R
</p>
<p>On notera que le descripteur objet(h1 hotel) atteint alors le statut G.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>D&#8217;autre part puisque l&#8217;expression employ&#233;e en S1 ne mobilise que deux descripteurs, S peut
inf&#233;rer que la non-compr&#233;hension porte sur le descripteur du nom. S peut donc construire le
jugement OO(nom(h1EtapHotel), h1) = U .
</p>
<p>Lorsqu&#8217;&#224; son tour, S cherche &#224; produire une r&#233;f&#233;rence &#224; h1 en S3, il est amen&#233; &#224; consid&#233;rer les
deux ensembles de descripteurs :
</p>
<p>E1 = {objet(h1 hotel), nom(h1EtapHotel)} E2 = {objet(h1 hotel), nom(h1Etap)}
</p>
<p>Puisque seul le descripteur objet(h1 hotel) a le statut G, aucun de ces ensembles ne satisfait la
premi&#232;re hypoth&#232;se du filtre.
</p>
<p>Le filtre teste alors la seconde hypoth&#232;se (G&#771;). Cette hypoth&#232;se conduit alors &#224; s&#233;lectionner l&#8217;en-
semble E2 &#233;tant donn&#233; que G&#771;S(nom(h1Etap), h1) et que G&#771;S(objet(h1 hotel), h1)). Ce choix
entra&#238;ne la g&#233;n&#233;ration de l&#8217;expression &#171; l&#8217;h&#244;tel Etap &#187;.
</p>
<p>Cette expression est bien comprise par O qui manifeste sa bonne compr&#233;hension en O4, entra&#238;-
nant alors le jugement OS(nom(h1Etap), h1) = R et donc l&#8217;ancrage de ce descripteur. Par la
suite, si S veut &#224; nouveau r&#233;f&#233;rer &#224; cet h&#244;tel, il pr&#233;ferera alors syst&#233;matiquement ce descripteur.
</p>
<p>4 Discussion
</p>
<p>Le mod&#232;le propos&#233; int&#232;gre une forme d&#8217;ancrage implicite gr&#226;ce &#224; la prise en compte des juge-
ments propres : il suffit de comprendre un descripteur utilis&#233; par autrui pour pouvoir le r&#233;utiliser.
D&#8217;autre part, le mod&#232;le int&#232;gre &#233;galement une forme d&#8217;ancrage explicite par la prise en compte
des jugements d&#8217;autrui : autrui peut manifester sa non-compr&#233;hension ou la mauvaise compr&#233;-
hension. L&#8217;approche peut &#234;tre &#233;valu&#233;e dans le m&#234;me paradigme de simulation que nous avons
utilis&#233; pour d&#233;tecter le probl&#232;me d&#8217;alignement (Denis, 2008). On peut cependant d&#8217;ores-et-d&#233;j&#224;
envisager deux directions pour am&#233;liorer le mod&#232;le.
</p>
<p>D&#8217;abord, nous nous sommes limit&#233;s &#224; affiner le statut de l&#8217;ancrage en &#233;tablissant des jugements
au niveau de la description mais sans consid&#233;rer la saillance des descripteurs pourtant n&#233;ces-
saire dans un mod&#232;le du type (Pickering &amp; Garrod, 2004). Ainsi, deux descripteurs ancr&#233;s sont
autant disponibles l&#8217;un que l&#8217;autre pour la g&#233;n&#233;ration de l&#8217;expression. On peut alors am&#233;liorer
le mod&#232;le en consid&#233;rant la r&#233;cence ou la saillance comme facteur suppl&#233;mentaire de choix.
</p>
<p>D&#8217;autre part, &#233;tablir des jugements au niveau des descripteurs n&#8217;est pas suffisant lorsque la
s&#233;mantique m&#234;me des descripteurs pose probl&#232;me. L&#8217;exemple ci-dessous illustre la n&#233;cessit&#233;
d&#8217;&#233;tablir un statut d&#8217;ancrage encore plus fin :
</p>
<p>Enonc&#233; Statuts du point de vue de S
</p>
<p>S1 &#8212; J&#8217;ai un schnauzer
O2 &#8212;Qu&#8217;est-ce qu&#8217;un schnauzer ? OO(schnauzer) = U
</p>
<p>FIG. 4 &#8211; Non-compr&#233;hension du concept de SCHNAUZER
</p>
<p>Dans cet exemple, ce n&#8217;est pas le fait que le r&#233;f&#233;rent rel&#232;ve du concept SCHNAUZER qui pose
probl&#232;me mais le concept de SCHNAUZER lui-m&#234;me. Afin de le traiter correctement, il est
n&#233;cessaire &#224; la fois d&#8217;&#233;tablir le statut n&#233;gatif de la compr&#233;hension du concept mais &#233;galement le
statut positif de la connaissance du mot &#171; schnauzer &#187;. En effet, S doit &#234;tre capable de consid&#233;rer</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation du terrain commun pour la production d&#8217;expressions r&#233;f&#233;rentielles
</p>
<p>queO parvient &#224; int&#233;grer que &#171; schnauzer &#187; est un nom commun pour pouvoir r&#233;pondre quelque
chose du type &#171; un schnauzer est un chien &#187;. Nous estimons que l&#8217;approche adopt&#233;e dans cet
article, &#224; l&#8217;aide de jugements de compr&#233;hension, &#233;tendue ici aux jugements d&#8217;acc&#232;s, peut &#234;tre
&#233;galement &#233;tendue au niveau lexical ou ontologique (voir par ailleurs au niveau ontologique
l&#8217;approche de (Beun &amp; van Eijk, 2007)).
</p>
<p>5 Conclusion
</p>
<p>Le processus d&#8217;ancrage est un m&#233;canisme fondamental pour la gestion de la compr&#233;hension
mutuelle dans le dialogue. Nos travaux pr&#233;c&#233;dents ont montr&#233; que la connaissance du statut
d&#8217;ancrage d&#8217;un &#233;nonc&#233; permet de mettre en &#339;uvre des phases de clarification visant &#224; augmen-
ter le terrain commun et atteindre la compr&#233;hension mutuelle. Pour autant, nous avons montr&#233;
&#224; l&#8217;aide d&#8217;un exemple que la connaissance du statut d&#8217;ancrage d&#8217;un &#233;nonc&#233; est insuffisante pour
que, du point de vue de la g&#233;n&#233;ration, la phase de clarification atteigne son but. Nous avons
donc &#233;tendu notre mod&#232;le du processus d&#8217;ancrage &#224; un niveau plus fin et montr&#233; sur le pro-
bl&#232;me de la compr&#233;hension des expressions r&#233;f&#233;rentielles que la connaissance des jugements
de compr&#233;hension sur les descripteurs mobilis&#233;s pour r&#233;f&#233;rer permet de construire des expres-
sions r&#233;f&#233;rentielles plus fiables, parce qu&#8217;elles prennent en compte la compr&#233;hension d&#8217;autrui.
Nous d&#233;sirons actuellement &#224; mettre en &#339;uvre ce mod&#232;le au sein de notre syst&#232;me de dialogue
(AGREE) d&#233;velopp&#233; pour &#233;valuer les capacit&#233;s de gestion dialogique de la compr&#233;hension des
expressions r&#233;f&#233;rentielles.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALLWOOD J. (1995). An activity based approach to pragmatics. In B. BUNT, H. &amp; BLACK,
Ed., Abduction, Belief and Context in Dialogue: Studies in Computational Pragmatics, p. 47&#8211;
80. Amsterdam: John Benjamins.
</p>
<p>BARR D. J. (2004). Establishing conventional communication systems: Is common know-
ledge necessary ? Cognitive Science, 28(6), 937&#8211;962.
</p>
<p>BARWISE J. (1988). Three views of common knowledge. In M. YARDI, Ed., Proceedings of
the Second Conference on Theoretical Aspects of Reasoning About Knowledge, p. 365&#8211;379:
San Francisco: Morgan Kaufman.
</p>
<p>BEUN R. &amp; VAN EIJK R. (2007). Repairing conceptual mismatches in human-computer
interaction. Discourse Processes, 44(3), 1&#8211;31.
</p>
<p>BUNT H., MORANTE R. &amp; KEIZER S. (2007). An empirically based computational model
of grounding in dialogue. In Proceedings of the 8th SIGDIAL Workshop on Discourse and
Dialogue, p. 283&#8211;290, Anvers, Belgique.
</p>
<p>CAHN J. (1992). A Computational Architecture for Mutual Understanding in Dialog. Rapport
interne, Music and Cognition Group, M.I.T. Media Laboratory.
</p>
<p>CLARK H. (1996). Using Language. Cambridge University Press.
</p>
<p>CLARK H. &amp; SCHAEFER E. (1989). Contributing to discourse. Cognitive Science, 13, 259&#8211;
294.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>CLARK H. H. &amp; MARSHALL C. R. (1981). Definite reference and mutual knowledge. In
A. K. JOSHI, B. WEBBER &amp; I. SAGS, Eds., Elements of Discourse Understanding, p. 10&#8211;63.
Cambridge: Cambridge University Press.
CLARK H. H. &amp; WILKES-GIBBS D. (1986). Referring as a collaborative process. Cognition,
22, 1&#8211;39.
DALE R. &amp; REITER E. (1995). Computational interpretations of the gricean maxims in the
generation of referring expressions. Cognitive Science, 19(2), 233&#8211;263.
DENIS A. (2008). Robustesse dans les syst&#232;mes de dialogue finalis&#233;s : mod&#233;lisation et &#233;va-
luation du processus d&#8217;ancrage pour la gestion de l&#8217;incompr&#233;hension. PhD thesis, Universit&#233;
Henri Poincar&#233;, Nancy.
DENIS A. &amp; QUIGNARD M. (2008). Mod&#233;lisation du principe d&#8217;ancrage pour la robustesse
des syst&#232;mes de dialogue homme-machine finalis&#233;s. In Actes de la Conf&#233;rence sur le Traite-
ment Automatique des Langues Naturelles (TALN), p. 89&#8211;98, Avignon.
GARROD S. &amp; PICKERING M. J. (2004). Why is conversation so easy ? Trends in Cognitive
Sciences, 8, 8&#8211;11.
GAUDOU B., HERZIG A. &amp; LONGIN D. (2006). Grounding and the expression of belief. In
P. DOHERTY, J. MYLOPOULOS &amp; C. A. WELTY, Eds., Proceedings of the 10th Internatio-
nal Conference on Principles on Principles of Knowledge Representation and Reasoning (KR
2006), p. 211&#8211;229, Windermere, UK: AAAI Press.
GINZBURG J. (2007). Semantics and Interaction in Dialogue. CSLI Publications and Univer-
sity of Chicago Press.
HIRST G., MCROY S., HEEMAN P., EDMONDS P. &amp; HORTON D. (1994). Repairing conver-
sational misunderstandings and non-understandings. Speech Communication, 15, 213&#8211;230.
HORTON W. &amp; KEYSAR B. (1996). When do speakers take into account common ground ?
Cognition, 59, 91&#8211;117.
KLEIBER G. (1994). Anaphores et pronoms. Duculot.
LARSSON S. (2002). Issue-based Dialogue Management. PhD thesis, Goteborg University,
Sweden.
LARSSON S. (2007). Coordinating on ad-hoc semantic systems in dialogue. In ARTSTEIN &amp;
VIEU, Eds., Proceedings of the 11th Workshop on the Semantics and Pragmatics of Dialogue
(DECALOG 2007), Rovereto.
LEWIS D. (1969). Convention: A Philosophical Study. Harvard University Press.
MILLS G. &amp; HEALEY P. (2008). Semantic negotiation in dialogue: mechanisms of alignment.
In Proceedings of the 8th SIGdial workshop on Discourse and Dialogue.
PICKERING M. J. &amp; GARROD S. (2004). Toward a mechanistic psychology of dialogue.
Behavioral and Brain Sciences, 27, 169&#8211;226.
POESIO M. &amp; TRAUM D. R. (1997). Conversational actions and discourse situations. Com-
putational Intelligence, 13(3), 309&#8211;347.
STALNAKER R. C. (1978). Assertion. In COLE, Ed., Pragmatics. New-York : Academic
Press.
TRAUM D. R. (1994). A Computational Theory of Grounding in Natural Language Conver-
sation. PhD thesis, Rochester.
TRAUM D. R. (1999). Computational models of grounding in collaborative systems. In
Working Papers of the AAAI., p. 124&#8211;131, Menlo Park, California: AAAI.</p>

</div></div>
</body></html>