<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitement automatique de disfluences dans un corpus linguistiquement contraint</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009 
</p>
<p>Traitement automatique de disfluences dans un corpus 
linguistiquement contraint 
</p>
<p>Jean-Leon Bouraoui (1), Nadine Vigouroux (2) 
</p>
<p>(1) IRIT &#8211; Paul Sabatier, 118, route de Narbonne, 31062 Toulouse, France 
{bouraoui,vigourou}@irit.fr 
</p>
<p>R&#233;sum&#233; Cet article pr&#233;sente un travail de mod&#233;lisation et de d&#233;tection des ph&#233;nom&#232;nes de 
disfluence. Une des sp&#233;cificit&#233; de ce travail est le cadre dans lequel il se situe: le contr&#244;le de la 
navigation a&#233;rienne. Nous montrons ce que ce cadre particulier implique certains choix 
concernant la mod&#233;lisation et l'impl&#233;mentation. Ainsi, nous constatons que la mod&#233;lisation 
fond&#233;e sur la syntaxe, souvent utilis&#233;e dans le traitement des langues naturelles, n'est pas la 
plus appropri&#233;e ici. Nous expliquons la fa&#231;on dont l'impl&#233;mentation a &#233;t&#233; r&#233;alis&#233;e. Dans une 
derni&#232;re partie, nous pr&#233;sentons la validation de ce dispositif, effectu&#233;e sur 400 &#233;nonc&#233;s. 
</p>
<p>Abstract This article presents a work of modeling and detection of phenomena 
disfluences. One of the specificity of this work is its framework: the air traffic control. 
We show that this particular framework implies certain choices about modeling and 
implementation. Thus, we find that modeling based on the syntax, often used in natural 
language processing, is not the most appropriate here. We explain how the implementation 
has been completed. In a final section, we present the validation of this device, made of 400 
utterances. 
</p>
<p>Mots-cl&#233;s :   Dialogue oral spontan&#233;, Analyse linguistique de corpus, Compr&#233;hension 
robuste, Contr&#244;le A&#233;rien, Phras&#233;ologie, Disfluences, Mod&#232;les de langage, Traitement 
Automatique du Langage Naturel 
Keywords: Spontaneous speech dialog, corpus  linguistic analysis,  robust understanding, 
Air  Traffic  Control,  phraseology,  disfluencies,  language  models,  Natural  Language 
Processing  
</p>
<p>  
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Leon Bouraoui, Nadine Vigouroux 
</p>
<p> 
</p>
<p>1 Introduction 
Les disfluences sont un ph&#233;nom&#232;ne apparaissant fr&#233;quemment dans toute production orale 
spontan&#233;e. Elles ont donn&#233; lieu &#224; de nombreuses &#233;tudes, que ce soit dans le domaine du 
Traitement Automatique de la Parole, ou celui du Traitement Automatique du Langage 
Naturel. En effet, leur &#233;tude et leur identification pr&#233;cise est primordiale. Sur le plan 
th&#233;orique, pour mieux comprendre et mod&#233;liser les probl&#232;mes pouvant advenir lors de toute 
communication orale. Sur le plan applicatif, pour am&#233;liorer la robustesse des syst&#232;mes 
automatiques de dialogue oral. 
</p>
<p>Or, la prise en compte des disfluences dans le cadre du TALN est particuli&#232;rement difficile. 
En effet, il s&#8217;agit de ph&#233;nom&#232;nes se manifestant, en apparence, de mani&#232;re totalement 
d&#233;sordonn&#233;e ; de plus leur apparition provoque g&#233;n&#233;ralement des perturbations dans la 
r&#233;gularit&#233; de la production orale. Malgr&#233; tout, leur traitement automatis&#233; fait l&#8217;objet de 
plusieurs travaux, cependant encore assez rares.  
</p>
<p>Cet article pr&#233;sente lui aussi un travail de ce type. Une de ses sp&#233;cificit&#233;s est qu&#8217;il est men&#233; 
dans le cadre d&#8217;une t&#226;che particuli&#232;rement contrainte, notamment d&#8217;un point de vue 
linguistique, par l&#8217;utilisation d&#8217;une phras&#233;ologie sp&#233;cifique : le Contr&#244;le de Trafic A&#233;rien. 
Comme cet article le montre, cela implique un certain nombre de choix th&#233;oriques et 
pratiques. 
</p>
<p>La pr&#233;sentation de notre travail se fait en quatre temps. D&#8217;abord, la description du corpus et de 
ses caract&#233;ristiques. Ensuite, la pr&#233;sentation des diff&#233;rents types de disfluences relev&#233;es dans 
le corpus1, et la mani&#232;re dont ils ont &#233;t&#233; mod&#233;lis&#233;s. Enfin, nous donnons les principes de 
l&#8217;impl&#233;mentation obtenue, avant de pr&#233;senter la validation que nous avons mis en &#339;uvre, ainsi 
que les r&#233;sultats obtenus.  
</p>
<p>2 Pr&#233;sentation du corpus d'&#233;tude 
</p>
<p>2.1 Les communications entre contr&#244;leurs et pseudo-pilotes 
</p>
<p>Le corpus utilis&#233; notre &#233;tude est constitu&#233; d'enregistrements de dialogues oraux spontan&#233;s 
entre des contr&#244;leurs a&#233;riens en formation et des &#171; pseudos-pilotes &#187;. Ces derniers sont des 
instructeurs simulant le r&#244;le de pilotes en exercice. Deux langues sont utilis&#233;es : le fran&#231;ais 
(majoritaire) et l'anglais. Le but des exercices enregistr&#233;s est d'entra&#238;ner les apprentis 
contr&#244;leurs, et ensuite de les &#233;valuer. Il s'agit pour eux de g&#233;rer plusieurs avions situ&#233;s dans la 
zone contr&#244;l&#233;e, par exemple en leur assignant une vitesse et/ou une position donn&#233;es. Le canal 
audio ne peut &#234;tre &#171; occup&#233; &#187; que par un seul locuteur &#224; la fois, ce qui emp&#234;che tout 
recouvrement de parole. 
</p>
<p>Les productions orales des contr&#244;leurs et des pilotes sont gouvern&#233;es par une stricte 
phras&#233;ologie1. Celle-ci d&#233;crit, par exemple, la mani&#232;re dont les locuteurs doivent prononcer 
les identifiants des avions, ou bien l&#8217;ordre que doivent observer les diff&#233;rentes parties d&#8217;un 
                                                 
</p>
<p>1
 D&#233;crite dans l'arr&#234;t&#233; du 27 juin 2000 relatif aux proc&#233;dures de radiot&#233;l&#233;phonie &#224; l'usage de la circulation 
</p>
<p>a&#233;rienne g&#233;n&#233;rale (J.O n&#176; 171 du 26 juillet 2000, p. 11501) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement automatique de disfluences dans un corpus linguistiquement contraint 
</p>
<p> 
</p>
<p>message. Durant la formation, ainsi d&#8217;ailleurs que dans des conditions r&#233;elles de travail, la 
phras&#233;ologie n&#8217;est pas toujours syst&#233;matiquement appliqu&#233;e. Le cadre g&#233;n&#233;ral qu&#8217;elle fixe est 
cependant respect&#233;. 
</p>
<p>Il est &#233;galement important de noter que les dialogues enregistr&#233;s appartiennent bien &#224; la 
cat&#233;gorie du discours oral spontan&#233;. Nous tenons &#224; le pr&#233;ciser car le r&#244;le pr&#233;pond&#233;rant tenu 
par la phras&#233;ologie pourrait laisser &#224; penser que tous les &#233;nonc&#233;s produits sont d&#233;j&#224; planifi&#233;s &#224; 
l&#8217;avance. Or, ce n&#8217;est pas le cas : ni les contr&#244;leurs, ni les pilotes ne savent &#224; l&#8217;avance ce qu&#8217;ils 
vont avoir &#224; dire. La phras&#233;ologie d&#233;finit seulement le cadre g&#233;n&#233;ral de production des 
&#233;nonc&#233;s ; ce qui est dit repose sur l&#8217;interaction dynamique entre un contr&#244;leur et un pilote ou 
pseudo-pilote donn&#233;s, en fonction d&#8217;une situation variable. 
</p>
<p>2.2 Caract&#233;ristiques du corpus d'&#233;tude 
</p>
<p>Nous avons proc&#233;d&#233; &#224; la transcription et l&#8217;annotation des dialogues selon les sp&#233;cifications de 
(Coullon et al., 2000). 
</p>
<p>Ces sp&#233;cifications ont pour but de d&#233;terminer les &#233;l&#233;ments &#224; transcrire, d&#8217;obtenir 
l&#8217;homog&#233;n&#233;it&#233; des transcriptions dans le cas o&#249; plusieurs annotateurs se succ&#232;dent.  
</p>
<p>Les enregistrements ont &#233;t&#233; effectu&#233;s avec un DAT (Digital Audio Tape), et &#233;chantillonn&#233;s &#224; 
16 kHz (16 bits). Pour des raisons d&#8217;enregistrement, la qualit&#233; sonore souffre parfois de 
probl&#232;mes r&#233;sultants de la saturation ou de bruits tels que les interf&#233;rences ; cependant, les 
dialogues sont intelligibles. Le corpus dure 36h50mn, et comprend 76 306 mots ; 16 locuteurs 
diff&#233;rents ont particip&#233; &#224; sa production. 
</p>
<p>3 Mod&#233;lisation propos&#233;e 
Pour prendre en compte les disfluences, nous avons proc&#233;d&#233; en deux grandes &#233;tapes. Dans un 
premier temps, il a fallu identifier pr&#233;cis&#233;ment les ph&#233;nom&#232;nes &#224; traiter. Une fois cela fait, 
nous avons ensuite pu proc&#233;der &#224; la mod&#233;lisation de leurs patterns d&#8217;apparition. Ce processus 
est d&#233;crit dans les deux sous sections suivantes. 
</p>
<p>3.1 Identification des ph&#233;nom&#232;nes de disfluences 
</p>
<p>La t&#226;che n&#8217;est pas aussi triviale qu&#8217;il n&#8217;y para&#238;t, surtout lorsqu&#8217;il s&#8217;agit des disfluences. En 
effet, dans la litt&#233;rature consacr&#233;e &#224; ce ph&#233;nom&#232;ne, les termes utilis&#233;s pour d&#233;signer un 
ph&#233;nom&#232;ne donn&#233; varient souvent d&#8217;un auteur &#224; l&#8217;autre (cf. par exemple (Cand&#233;a, 2000), 
(Henry et al. 2004), (Kurdi, 2003) ou encore (Schriberg, 1994)).  
</p>
<p>Nous avons d&#233;fini 7 cat&#233;gories de disfluences. Lorsque cela est n&#233;cessaire, nous donnons des 
exemples pour illustrer notre propos (en mettant la disfluence en gras). Pour les comparaisons 
avec d&#8217;autres terminologies, ainsi que les distributions de chaque cat&#233;gorie, nous renvoyons &#224; 
(Bouraoui et al., 2006). 
</p>
<p>&#8226; H&#233;sitation : d&#233;signe l&#8217;interjection &#171; euh &#187;. Exemple: 
maintenons niveau 1 0 0 Poitiers Amboise euh Lacan </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Leon Bouraoui, Nadine Vigouroux 
</p>
<p> 
</p>
<p>&#8226; R&#233;p&#233;tition : un mot (ou un groupe de mots) appara&#238;t au moins deux fois &#224; la suite. 
Nous n&#8217;avons pas pris en compte la r&#233;p&#233;tition de disfluences. Exemple: 
</p>
<p>station station calling euh repeat your callsign 
</p>
<p>&#8226; Amorce : l&#8217;arr&#234;t de la production d&#8217;un mot avant la fin normale de celui-ci. Dans 
notre terminologie, une amorce correspond toujours &#224; un fragment de mot que l&#8217;on 
peut identifier (gr&#226;ce &#224; la connaissance de la phras&#233;ologie). Exemple (l&#8217;amorce est 
entre crochets) : 
</p>
<p>speed euh 200 Kts [mak] euh minimum 
</p>
<p>Le contexte et la phras&#233;ologie aident &#224; comprendre que le contr&#244;leur commence &#224; prononcer 
&#171; maximum &#187;. Il se rend compte que cela ne convient pas et s&#8217;interrompt (&#171; mak &#187;). Enfin, il 
dit le mot correct : &#171; minimum &#187;.  
</p>
<p>&#8226; Auto-correction : le locuteur fait une ou plusieurs erreurs, et se corrige dans le m&#234;me 
&#233;nonc&#233;. La diff&#233;rence avec les amorces est que le mot (ou les mots) erron&#233; est 
prononc&#233; compl&#232;tement. 
</p>
<p>France Air Force 900 893 
</p>
<p>&#8226; Fragment de mot : un ou plusieurs phon&#232;mes inidentifiables (par opposition aux 
amorces). Exemple (le fragment est entre crochets) : 
</p>
<p>due to [ou] due traffic euh descend level 9 0 
</p>
<p>&#8226; Allongement : l&#8217;allongement d&#8217;une unit&#233; phon&#233;tique d&#8217;un mot, sup&#233;rieur &#224; 0,5 
seconde ; peut &#234;tre combin&#233; aux h&#233;sitations.  
</p>
<p>&#8226; Pause longue : toute pause sup&#233;rieure &#224; 0,5 seconde et comprise &#224; l&#8217;int&#233;rieur un tour 
de parole. 
</p>
<p>3.2 Mod&#233;lisation des ph&#233;nom&#232;nes 
</p>
<p>Dans la majorit&#233; des &#233;tudes sur les disfluences, la mod&#233;lisation, lorsqu&#8217;elle est faite, repose 
sur la repr&#233;sentation syntaxique et/ou s&#233;mantique des ph&#233;nom&#232;nes. Or, nous consid&#233;rons que, 
compte tenu de la nature linguistique tr&#232;s particuli&#232;re induite par la phras&#233;ologie et ses 
restrictions, il est inutile, voire contre-productif, de nous lancer dans une mod&#233;lisation bas&#233;e 
sur les relations lexico-syntaxiques. En effet, les contraintes pos&#233;es par la phras&#233;ologie 
permettent en grande partie de d&#233;crire le syst&#232;me linguistique form&#233; par celle-ci, 
ind&#233;pendamment ou presque des &#171; parties du discours &#187; auxquelles appartiennent les 
&#233;l&#233;ments. 
</p>
<p>Plus concr&#232;tement, nous cherchons un langage de repr&#233;sentation qui pr&#233;sente au moins les 
caract&#233;ristiques suivantes : adapt&#233; &#224; l&#8217;objet d&#8217;&#233;tude (disfluences), grande capacit&#233; 
d&#8217;expression et de repr&#233;sentation, simplicit&#233; des patrons obtenus, et enfin modularisation 
selon les besoins de l&#8217;utilisateur. Nous avons trouv&#233; r&#233;unies ces propri&#233;t&#233;s dans le sch&#233;ma 
d&#8217;annotation propos&#233; par (Bear et al. 1993), utilis&#233; dans un contexte relativement identique au 
n&#244;tre par (Kurdi, 2003, notamment p.72-75).  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement automatique de disfluences dans un corpus linguistiquement contraint 
</p>
<p> 
</p>
<p>Le but de ce sch&#233;ma est de pouvoir rendre compte de certains ph&#233;nom&#232;nes de l&#8217;oral spontan&#233;, 
par exemple dans des transcriptions, en les &#233;tiquetant. Les auteurs d&#233;signent les ph&#233;nom&#232;nes 
en question par le terme g&#233;n&#233;rique de repairs. Ce terme correspond, dans les grandes lignes, &#224; 
ce que nous avons appel&#233; r&#233;p&#233;titions, amorces, et auto-corrections. Mais le sch&#233;ma peut 
&#233;galement rendre compte d&#8217;autres disfluences. 
</p>
<p>Les auteurs proposent tout un ensemble de symboles g&#233;n&#233;riques permettant de repr&#233;senter la 
majorit&#233; des disfluences. Par exemple, FP (Filled Pauses) pour les h&#233;sitations, C (Cues) pour 
des mots tels que &#171; d&#233;sol&#233; &#187;, etc. Chaque occurrence d&#8217;un symbole est associ&#233;e &#224; un index 
num&#233;rique qui permet le cas &#233;ch&#233;ant de la distinguer dans un m&#234;me &#233;nonc&#233;. 
</p>
<p>Le sch&#233;ma permet &#233;galement de rendre compte des diff&#233;rentes zones impliqu&#233;es dans les 
disfluences plus complexes telles que les r&#233;p&#233;titions ou les auto-corrections. Pour cela, les 
auteurs utilisent la barre verticale (&#171; | &#187;) pour indiquer la position du point d&#8217;&#233;dition. Il s&#8217;agit 
du &#171; lieu &#187; suivant l&#8217;apparition de la disfluence, &#224; partir duquel le locuteur se rend compte 
qu&#8217;il y a un probl&#232;me dans sa production orale, et tente d&#8217;y rem&#233;dier. Soit par exemple 
l&#8217;&#233;nonc&#233; suivant, comportant une auto-correction (en gras) : 
</p>
<p>montez niveau maintenez niveau 
</p>
<p>Sa repr&#233;sentation selon le sch&#233;ma de Bear et al. sera : 
</p>
<p>R1 M1 | R1 M1 
o&#249; le symbole R correspond au remplacement d&#8217;un mot par un autre de part et d&#8217;autre du point 
d&#8217;&#233;dition (respectivement, l&#8217;erreur et la correction) et M (Matching Words) indique que le 
m&#234;me mot est utilis&#233; des c&#244;t&#233;s du point d&#8217;&#233;dition. 
</p>
<p>A l&#8217;aide de ce sch&#233;ma d&#8217;annotation, que nous avons augment&#233; de certains symboles plus 
sp&#233;cifiques &#224; la t&#226;che de contr&#244;le a&#233;rien, nous avons syst&#233;matiquement mod&#233;lis&#233; toutes les 
occurrences de disfluences de notre corpus. A partir des repr&#233;sentations obtenues nous avons 
d&#233;gag&#233; des patrons plus g&#233;n&#233;raux, qui nous ont &#233;t&#233; utiles pour la derni&#232;re partie de ce travail : 
l&#8217;impl&#233;mentation. 
</p>
<p>4 Impl&#233;mentation 
</p>
<p>4.1 Cadre d&#8217;impl&#233;mentation 
</p>
<p>Le syst&#232;me dans lequel nous int&#233;grons notre mod&#232;le a &#233;t&#233; d&#233;velopp&#233; dans le cadre du projet 
VOICE, et est d&#233;crit dans (Truillet et al., 2005).  
</p>
<p>Plus pr&#233;cis&#233;ment, le but de ce syst&#232;me est de g&#233;rer les entr&#233;es vocales pouvant &#234;tre produites 
par les pseudo-pilotes, en extraire le sens, et l&#8217;interpr&#233;ter de mani&#232;re &#224; ce que les ordres re&#231;us 
soient ex&#233;cut&#233;s. Il a d&#233;j&#224; fonctionn&#233; dans des conditions de simulation du contr&#244;le a&#233;rien, 
m&#234;me si un certain nombre de contraintes restent &#224; prendre en compte, dont la gestion des 
disfluences ! 
</p>
<p>Le syst&#232;me VOICE dispose d&#8217;une architecture modulaire de composants logiciels 
communiquant entre eux. Ces derniers sont d&#233;di&#233;s chacun &#224; une sous-t&#226;che. Notamment, l&#8217;un 
d&#8217;eux g&#232;re la reconnaissance de la parole. A partir des r&#233;sultats fournis par celui-ci, un autre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Leon Bouraoui, Nadine Vigouroux 
</p>
<p> 
</p>
<p>choisit la solution la plus probable, en fonction du contexte du dialogue (historique, 
connaissances de la t&#226;che, etc.). Enfin, la d&#233;cision prise est ajout&#233;e &#224; l&#8217;historique. Nous 
renvoyons &#224; (Truillet et al., 2005) pour une description d&#233;taill&#233;e des autres composants, et du 
r&#244;le de chacun.  
</p>
<p>Le syst&#232;me VOICE fonctionne &#224; partir d&#8217;une grammaire de type CFG (Context Free 
Grammar), modifi&#233;e p&#233;riodiquement en fonction du contexte d&#8217;interaction. Elle se pr&#233;sente 
sous la forme de r&#232;gles de r&#233;&#233;criture, non probabilis&#233;es. Ce formalisme est particuli&#232;rement 
bien adapt&#233; &#224; la phras&#233;ologie du contr&#244;le a&#233;rien, compte tenu de la standardisation des 
productions et du faible nombre de sch&#233;mas lexico-syntaxiques utilis&#233;s2. Par contre, ces r&#232;gles 
ne prenaient pas encore en compte la mod&#233;lisation des disfluences que nous avons d&#233;crit ci-
dessus; de plus, certaines disfluences complexes ne peuvent &#234;tre trait&#233;es uniquement par des 
r&#232;gles de CFG. De ce fait, un traitement suppl&#233;mentaire est n&#233;cessaire, que nous d&#233;crivons 
dans la section suivante. 
</p>
<p>4.2 Mod&#233;lisation computationnelle et traitement informatique 
</p>
<p>Nous distinguons deux types de ph&#233;nom&#232;nes &#224; traiter. D&#8217;une part les disfluences 
&#171; ponctuelles &#187;. Nous rangeons dans cette cat&#233;gorie les h&#233;sitations, et les fragments de mots. 
Nous les appelons &#171; ponctuelles &#187; car elles ne remettent pas en cause, &#224; elles seules, 
l&#8217;organisation de la suite de mots dans laquelle elles apparaissent3. Nous consid&#233;rons donc 
que seules l&#8217;identification de leurs occurrences est n&#233;cessaire et suffisante pour un traitement 
automatique (quelle que soit l&#8217;utilisation faite par la suite de leur identification). 
</p>
<p>Ce n&#8217;est pas la m&#234;me chose avec les disfluences plus complexes que sont les amorces, les 
r&#233;p&#233;titions, et les auto-corrections. Elles affectent en effet un empan plus important en termes 
de taille que la seule position dans laquelle elles apparaissent. Les concernant, il faut non 
seulement identifier leurs occurrences, mais &#233;galement distinguer les &#233;l&#233;ments r&#233;p&#233;t&#233;s (dans le 
cas des amorces, distinguer l&#8217;&#233;l&#233;ment corrig&#233; de la correction). 
</p>
<p>Que nous apprend l&#8217;analyse des diff&#233;rents patrons de ces disfluences ? Dans la majorit&#233; des 
cas, nous constatons une sym&#233;trie des composants situ&#233;s de part et d&#8217;autre du point d&#8217;&#233;dition. 
Cette observation va nous servir de point d&#8217;achoppement pour la mise en &#339;uvre pour 
l&#8217;impl&#233;mentation. Nous ne d&#233;crivons pas ici la totalit&#233; des algorithmes, mais les principes 
g&#233;n&#233;raux qui les sous-tendent et dont ils ne sont que le d&#233;veloppement : 
</p>
<p>&#8226; Dans un premier temps, associer &#224; chaque &#233;l&#233;ment lexical de l&#8217;&#233;nonc&#233; &#224; traiter une 
classe de mot correspondant. Cela est assur&#233; par la CFG utilis&#233;e dans VOICE, 
moyennant quelques modifications (par exemple la d&#233;finition de classes de mot, afin 
d'ajouter un niveau &#171; s&#233;mantique &#187;. Ainsi, au verbe &#171; descendez &#187; serait associ&#233; la 
classe &#171; verbe_niveau &#187;). C&#8217;est &#224; ce niveau que se situe le traitement des disfluences 
&#171; ponctuelles &#187;. Si on a affaire &#224; une disfluence plus complexe, un traitement plus 
approfondi s&#8217;impose ; 
</p>
<p>                                                 
</p>
<p>2
  Pour plus de d&#233;tails sur les caract&#233;ristiques linguistiques de la phras&#233;ologie, voir notamment (Falzon, 1989). 
</p>
<p>3
 On pourrait objecter ici que l&#8217;apparition de ce type de disfluences est souvent concomitante avec des 
</p>
<p>perturbations plus larges du contexte o&#249; elles apparaissent. Cependant, ces relations sont-elles de cause ou de 
cons&#233;quence ? La question reste &#224; trancher&#8230; En attendant, nous adoptons comme hypoth&#232;se de travail 
l&#8217;ind&#233;pendance de causalit&#233; des ph&#233;nom&#232;nes entre eux. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement automatique de disfluences dans un corpus linguistiquement contraint 
</p>
<p> 
</p>
<p>&#8226; &#171; Parser &#187; l&#8217;&#233;nonc&#233; avec une fen&#234;tre coulissante. Celle-ci, d&#8217;une taille maximale de 
10 &#233;l&#233;ments lexicaux, se d&#233;place de gauche &#224; droite de l&#8217;&#233;nonc&#233;. Le principe est de 
d&#233;tecter, dans l&#8217;intervalle de la fen&#234;tre, l&#8217;occurrence d&#8217;une r&#233;p&#233;tition d&#8217;un patron 
(classe de mots ou mot du lexique, correspondant au sch&#233;ma de ). Lorsque cela 
arrive, le d&#233;placement de la fen&#234;tre stoppe, le temps de proc&#233;der &#224; plusieurs 
traitements &#224; l&#8217;int&#233;rieur de celle-ci :  
</p>
<p>1. T
rouver la position du point d&#8217;&#233;dition. Pour cela, on lance une analyse par r&#232;gle 
de CFG &#224; partir du d&#233;but de la fen&#234;tre, sur l'ensemble du contenu de celle-ci, 
comme s'il s'agissait d'un &#233;nonc&#233; &#224; part enti&#232;re. Lorsque l&#8217;analyse se termine 
avant que l&#8217;un des &#233;l&#233;ments terminaux de la CFG n&#8217;ait &#233;t&#233; atteint, cela indique 
avec certitude la pr&#233;sence du point d&#8217;&#233;dition  
</p>
<p>2. L
e point d&#8217;&#233;dition trouv&#233;, nous avons &#224; distinguer les &#233;l&#233;ments r&#233;p&#233;t&#233;s entre eux 
(ou les &#233;l&#233;ments corrig&#233;s de leur correction). On fait la comparaison entre les 
&#233;l&#233;ments situ&#233;s &#224; gauche du point d&#8217;&#233;dition et ceux de droite ; les &#233;l&#233;ments 
r&#233;p&#233;t&#233;s (d&#8217;un point de vue lexical) correspondent... &#224; des r&#233;p&#233;titions, tandis que 
les &#233;l&#233;ments r&#233;p&#233;t&#233;s (au niveau de la classe de mot) correspondent 
respectivement &#224; une erreur et &#224; sa correction.  
</p>
<p>&#8226; Enfin, le d&#233;placement de la fen&#234;tre est r&#233;amorc&#233;, &#224; partir de l&#8217;&#233;l&#233;ment situ&#233; le plus &#224; 
droite lors de sa derni&#232;re instance. 
</p>
<p>Nous avons donn&#233; les grandes lignes du traitement informatique propos&#233;. Ne figurent pas par 
exemple, les processus n&#233;cessaires pour distinguer, par exemple, une r&#233;p&#233;tition disfluente 
d&#8217;une r&#233;p&#233;tition &#171; normale &#187;, ainsi que d&#8217;autres probl&#232;mes de ce genre. 
</p>
<p>5 Evaluation 
</p>
<p>5.1 M&#233;thodologie d'&#233;valuation 
</p>
<p>Nous retenons les param&#232;tres suivants comme pertinents pour la validation du module que 
nous proposons :  
</p>
<p>&#8226; Temps d&#8217;ex&#233;cution : ce param&#232;tre permet de d&#233;terminer si le dispositif que nous 
proposons est raisonnablement int&#233;grable dans un syst&#232;me visant &#224; fonctionner en 
temps r&#233;el. En effet, au-del&#224; d&#8217;un certain seuil, la question du rapport entre le gain 
apport&#233; par le dispositif et la perte qu&#8217;il occasionne en temps de calcul se poserait ;  
</p>
<p>&#8226; Taux de pr&#233;cision : il permet d&#8217;&#233;tablir le nombre de d&#233;tections correctes par rapport 
au nombre total de d&#233;tections (y compris les &#171; faux positifs &#187;) ;  
</p>
<p>&#8226; Taux de rappel : il d&#233;termine le nombre de disfluences correctement d&#233;tect&#233;es par 
rapport au nombre total d&#8217;occurrences ;  
</p>
<p>&#8226; D&#233;limitation : la d&#233;limitation des fronti&#232;res de d&#233;but et de fin des disfluences est une 
des t&#226;ches accomplies par notre module. Il est par cons&#233;quent important de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Leon Bouraoui, Nadine Vigouroux 
</p>
<p> 
</p>
<p>d&#233;terminer les performances dans l&#8217;accomplissement de celle-ci. Pour cette mesure 
&#233;galement, nous utilisons les taux de pr&#233;cision (ici, nombre de d&#233;limitations correctes 
par rapport au nombre total de d&#233;limitations effectu&#233;es) et de rappel (nombre de 
d&#233;limitations correctes par rapport au nombre total de disfluences) ;  
</p>
<p>&#8226; Identification de la bonne cat&#233;gorie : il s&#8217;agit de d&#233;terminer si une disfluence, m&#234;me 
d&#233;tect&#233;e et d&#233;limit&#233;e correctement, est &#233;galement correctement cat&#233;goris&#233;e. Il peut, 
par exemple, arriver qu&#8217;une r&#233;p&#233;tition soit &#233;tiquet&#233;e comme &#233;tant une auto-
correction, ou r&#233;ciproquement. Ce risque est d&#8217;autant plus important que notre 
algorithme de d&#233;tection est bas&#233; sur l&#8217;occurrence de r&#233;p&#233;titions, que ce soit au niveau 
lexical ou s&#233;mantique. La performance pour ce param&#232;tre est importante : d&#233;tecter et 
&#233;tiqueter correctement un lex&#232;me donn&#233; de la zone disfluente est le premier pas pour 
pouvoir ensuite corriger celle-ci (par exemple, supprimer les r&#233;p&#233;titions 
surnum&#233;raires, ou remplacer un mot corrig&#233; par sa correction).  
</p>
<p>5.2 Constitution du corpus d'&#233;valuation 
</p>
<p>Pour l'&#233;valuation, il nous a &#233;t&#233; n&#233;cessaire de nous procurer un deuxi&#232;me corpus, ind&#233;pendant 
de celui, pr&#233;sent&#233; plus haut, &#224; partir duquel a &#233;t&#233; effectu&#233;e la mod&#233;lisation. Il est tr&#232;s difficile 
de se procurer des corpus oraux de dialogues de contr&#244;le a&#233;rien, pour des raisons li&#233;es au 
caract&#232;re sensible de ce travail. De ce fait, nous avons d&#251; produire &#171; artificiellement &#187; un 
corpus de disfluences apparaissant dans ce contexte. Pour cela, nous nous somme inspir&#233;e de 
la campagne &#171; par d&#233;fi &#187; du GDR I34 (Antoine et al. 2002). Elle consiste &#224; s&#233;lectionner un 
ensemble d&#8217;&#233;nonc&#233;s, consid&#233;r&#233;s comme repr&#233;sentatifs du domaine de t&#226;che &#233;tudi&#233; (Antoine et 
al. 2002, p. 563). A partir de ces &#233;nonc&#233;s de base, des &#233;nonc&#233;s d&#233;riv&#233;s sont construits. Le 
processus de d&#233;rivation consiste &#224; transformer chaque &#233;nonc&#233; initial de mani&#232;re &#224; ce qu&#8217;il 
contienne un ph&#233;nom&#232;ne pouvant poser probl&#232;me &#224; un syst&#232;me de compr&#233;hension donn&#233;. 
</p>
<p>Nous avons &#233;t&#233; contraints d&#8217;op&#233;rer quelques modifications &#224; cette m&#233;thodologie afin de 
l'adapter &#224; notre contexte d&#8217;&#233;tude. Dans un premier temps, nous avons s&#233;lectionn&#233; un 
ensemble d&#8217;&#233;nonc&#233;s de notre corpus d'&#233;tude, choisis parce qu'ils ne comportent aucune 
disfluence. A partir de chacun de ces &#233;nonc&#233;s, nous avons construit manuellement 6 &#233;nonc&#233;s 
comportant chacun une disfluence (h&#233;sitation, r&#233;p&#233;tition, ou auto-correction). Nous avons 
g&#233;n&#233;r&#233; de cette mani&#232;re 306 &#233;nonc&#233;s. Nous avons &#233;galement ajout&#233; &#224; ce corpus principal deux 
autres sous-ensemble. D'une part, les 51 &#233;nonc&#233;s de base ne comportant aucune disfluence. il 
nous a en effet paru int&#233;ressant de les faire traiter par notre module, afin de d&#233;terminer si 
celui-ci ne provoque pas de &#171; faux positifs &#187;. D'autre part, 43 &#233;nonc&#233;s, comportant au moins 
une disfluence, provenant de transcriptions de dialogues de contr&#244;le a&#233;rien enregistr&#233;s en 
situation &#171; r&#233;elle &#187; (et non en situation d'apprentissage, contrairement &#224; notre corpus d'&#233;tude). 
Au total, notre corpus de validation comporte donc 400 &#233;nonc&#233;s diff&#233;rents, r&#233;partis en quatre 
sous-ensembles diff&#233;rents (chaque sous-ensemble correspondant &#224; la v&#233;rification d'une ou 
plusieurs hypoth&#232;ses)5. Les &#233;nonc&#233;s sont pr&#233;sent&#233;s au module sous forme &#233;crite (et non orale): 
on &#233;vite ainsi tout biais li&#233; &#224; des probl&#232;mes de reconnaissance vocale, pour se concentrer sur 
la validation des capacit&#233;s d'identification de notre module. 
</p>
<p>                                                 
</p>
<p>4
 Groupement De Recherche &#171; Information - Interaction - Intelligence &#187; ; http://www.irit.fr/GDR-I3/. 
</p>
<p>5
 Faute de place, nous ne pouvons d&#233;crire ici en d&#233;tail les hypoth&#232;ses en question. Nous renvoyons pour cela &#224; 
</p>
<p>(Bouraoui, 2008). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement automatique de disfluences dans un corpus linguistiquement contraint 
</p>
<p> 
</p>
<p>5.3 R&#233;sultats 
</p>
<p>Par manque de place, nous ne pouvons pr&#233;senter ici l'int&#233;gralit&#233; des r&#233;sultats que nous avons 
obtenus. Nous n'indiquons donc que les plus repr&#233;sentatifs, et renvoyons &#224; nouveau &#224; 
(Bouraoui, 2008) pour plus de d&#233;tails.  
</p>
<p>Globalement, les r&#233;sultats obtenus sont satisfaisants et valident le module. Ainsi, le temps 
d&#8217;ex&#233;cution est tr&#232;s rapide: le temps maximum d'ex&#233;cution est inf&#233;rieur &#224; 5 millisecondes. En 
termes de d&#233;tection des disfluences, les performances sont elles aussi bonnes voire tr&#232;s bonnes 
selon le sous-ensemble consid&#233;r&#233; du corpus : le taux de pr&#233;cision varie en effet entre 84% et 
95%, et le taux de rappel entre 56% et 93%. Concernant ce dernier r&#233;sultat, le taux de 56% 
observ&#233; correspond &#224; une difficult&#233; du module pour la t&#226;che de d&#233;limitation des auto-
corrections, sur des disfluences particuli&#232;rement complexes.  
</p>
<p>Enfin, la comparaison avec les performances d&#8217;autres d'autres dispositifs de d&#233;tection des 
disfluences, d&#233;crits dans la litt&#233;rature, permet de d&#233;terminer que nos r&#233;sultats se situent dans 
la &#171; moyenne sup&#233;rieure &#187;.  
</p>
<p>6 Conclusions et perspectives 
Nous avons d&#233;crit dans cet article le processus complet de traitement automatique que nous 
proposons pour prendre en compte les disfluences dans des dialogues oraux spontan&#233;s de 
contr&#244;le a&#233;rien.  
</p>
<p>Il a consist&#233; dans un premier temps en une analyse fine du contexte, et des disfluences 
observ&#233;es. Nous avons ensuite proc&#233;d&#233; &#224; l&#8217;impl&#233;mentation du dit mod&#232;le, dans le cadre d&#8217;un 
syst&#232;me existant d&#233;j&#224;, mais ne permettant pas de traiter ce type de ph&#233;nom&#232;nes. Enfin,  nous  
avons  valid&#233;  le  module  d&#8217;identification  des  disfluences  que  nous  avons con&#231;u. Il 
appara&#238;t que notre module obtient de bonnes, voire tr&#232;s bonnes  performances,  et  est  robuste.  
Notre  hypoth&#232;se  sur  la  sp&#233;cificit&#233;  du  traitement automatique  des  disfluences  dans  la  
phras&#233;ologie  est  confirm&#233;e  elle  aussi.  L'&#233;valuation  montre &#233;galement que  le dispositif que 
nous proposons est  tr&#232;s bien adapt&#233;, aussi bien &#224; la mod&#233;lisation qu&#8217;au traitement 
automatique des disfluences dans un langage contraint.   
</p>
<p>Le traitement propos&#233; n&#8217;est pas exhaustif puisque certains cas tr&#232;s complexes ne sont pas pris 
en compte ; n&#233;anmoins, il couvre th&#233;oriquement une grande part des disfluences. A plus long 
terme, nous envisageons d&#8217;&#233;tudier dans quel mesure le mod&#232;le propos&#233; peut &#234;tre appliqu&#233; &#224; 
d&#8217;autres types de t&#226;ches que le seul contr&#244;le a&#233;rien. Nous sommes en effet persuad&#233;s qu&#8217;au 
moins une partie des traitements que nous avons propos&#233;s sont applicables &#233;galement dans 
d&#8217;autres contextes, m&#234;me moins restreints que celui de la phras&#233;ologie. 
</p>
<p>R&#233;f&#233;rences  
ANTOINE J-Y., BOUSQUET C., GOULIAN J., ZAKARIA KURDI, M., ROSSET S., VIGOUROUX N., 
VILLANEAU J., (2002) &#8220;Predictive and objective evaluation of speech understanding: the 
&#8216;challenge&#8217; evaluation campaign of the I3 workgroup of the French CNRS&#8221;, Third 
International Conference on Language Resources and Evaluation (LREC&#8217;02), Las Palmas, 
Espagne, Vol. II, p. 529-536, 2002. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Leon Bouraoui, Nadine Vigouroux 
</p>
<p> 
</p>
<p>BEAR J., DOWDING J., SHRIBERG E. (1993) &#8220;A System for Labeling Self-Repairs in Speech.&#8221; 
Technical Note 522, Stanford Research International. 
</p>
<p>BOURAOUI J.-L., VIGOUROUX N. (2006) &#171; Etude de disfluences dans un corpus 
linguistiquement contraint &#187;. Journ&#233;es d'Etudes sur la Parole (JEP 2006), Dinard, p. 429-432. 
</p>
<p>BOURAOUI J.-L. (2008)  Analyse,  mod&#233;lisation,  et  d&#233;tection  automatique  des  disfluences  
dans  le dialogue oral spontan&#233; contraint :  le cas du Contr&#244;le A&#233;rien, Th&#232;se de doctorat, 
Universit&#233; Paul Sabatier.  
</p>
<p>CANDEA M. (2000) Contribution &#224; l'&#233;tude des pauses silencieuses et des ph&#233;nom&#232;nes dits 
&quot;d'h&#233;sitation&quot; en fran&#231;ais oral spontan&#233;. Th&#232;se d'&#201;tat, Universit&#233; Paris III (Sorbonne 
Nouvelle). 
</p>
<p>COULLON I., GRAGLIA L. (2000) Sp&#233;cifications de la base de donn&#233;es pour l&#8217;analyse des 
communications VHF en route. CENA internal report. 
</p>
<p>FALZON P. (1989) Ergonomie cognitive du dialogue. Presses Universitaires de Grenoble. 
</p>
<p>HENRY S., Campione E., V&#233;ronis J. (2004) &#171; R&#233;p&#233;titions et pauses (silencieuses et remplies) 
en fran&#231;ais spontan&#233; &#187;, JEP'04, p.261-264, F&#232;s, Maroc. 
</p>
<p>KURDI M.- Z. (2003) Contribution &#224; l&#8217;analyse du langage oral spontan&#233;. Th&#232;se de doctorat, 
Universit&#233; J. Fourier, Grenoble, France. 
</p>
<p>SHRIBERG E. (1994) Preliminaries to a theory of speech disfluencies. Ph.D. thesis, University 
of Berkeley, California. 
</p>
<p>TRUILLET P., BOTHOREL G. (2005) &#171; VOICE : une plate-forme pour la formation au contr&#244;le 
a&#233;rien &#187;, IHM 2005, p. 67-80, Toulouse. </p>

</div></div>
</body></html>