<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Dispersion s&#233;mantique dans des familles morpho-phonologiques : &#233;l&#233;ments th&#233;oriques et empiriques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Dispersion s&#233;mantique dans des familles
morpho-phonologiques : &#233;l&#233;ments th&#233;oriques et empiriques
</p>
<p>N. Gala1 V. Rey2 L. Tichit3
(1) LIF, Marseille, CNRS UMR 6166
</p>
<p>(2) SHADYC, Marseille, CNRS et EHESS, UMR 8562
(3) IML, Marseille, CNRS UMR 6206
</p>
<p>nuria.gala@lif.univ-mrs.fr, veronique.rey@univ-provence.fr,
tichit@iml.univ-mrs.fr
</p>
<p>R&#233;sum&#233;. Traditionnellement, la morphologie lexicale a &#233;t&#233; diachronique et a permis de
proposer le concept de famille de mots. Ce dernier est repris dans les &#233;tudes en synchronie et
repose sur une forte coh&#233;rence s&#233;mantique entre les mots d&#8217;une m&#234;me famille. Dans cet arti-
cle, nous proposons une approche en synchronie fond&#233;e sur la notion de continuit&#233; &#224; la fois
phonologique et s&#233;mantique. Nous nous int&#233;ressons, d&#8217;une part, &#224; la morpho-phonologie et,
d&#8217;autre part, &#224; la dispersion s&#233;mantique des mots dans les familles. Une premi&#232;re &#233;tude (Gala &amp;
Rey, 2008) montrait que les familles de mots obtenues pr&#233;sentaient des espaces s&#233;mantiques soit
de grande coh&#233;sion soit de grande dispersion. Afin de valider ces observations, nous pr&#233;sentons
ici une m&#233;thode empirique qui permet de pond&#233;rer automatiquement les unit&#233;s de sens d&#8217;un
mot et d&#8217;une famille. Une exp&#233;rience men&#233;e aupr&#232;s de 30 locuteurs natifs valide notre approche
et ouvre la voie pour une &#233;tude approfondie du lexique sur ces bases phonologiques et s&#233;man-
tiques.
</p>
<p>Abstract. Traditionally, lexical morphology has been diachronic and has established the
notion of word families. This notion is reused in synchronic studies and implies strong seman-
tic coherence within the words of a same family. In this paper, we propose an approach in
synchrony which highlights phonological and semantic continuity. Our interests go on morpho-
phonology and on the semantic dispersion of words in a family. A first study (Gala &amp; Rey, 2008)
showed that the semantic spaces of the families displayed either a strong semantic cohesion or a
strong dispersion. In order to validate this observation, we present here a corpus-based method
that automatically weights the semantic units of a word and a family. An experience carried out
with 30 native speakers validates our approach and allows us to foresee a thorough study of the
lexicon based on phonological and semantic basis.
</p>
<p>Mots-cl&#233;s : morpho-phonologie lexicale, traitement automatique des familles d&#233;riva-
tionnelles, espaces s&#233;mantiques.
</p>
<p>Keywords: lexical morpho-phonology, derivational families processing, semantic spaces.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nuria Gala, V&#233;ronique Rey, Laurent Tichit
</p>
<p>1 Introduction
</p>
<p>Il existe &#224; l&#8217;heure actuelle des ressources linguistiques ayant comme particularit&#233; commune le
regroupement de mots en familles. L&#8217;objectif de ces outils est fondamentalement p&#233;dagogique ;
cependant, la construction et la constitution de telles ressources pr&#233;sente des int&#233;r&#234;ts ind&#233;niables
pour le traitement automatique des langues. Parmi ces ressources, la notion de &#8217;famille&#8217; est
prise en compte selon des points de vue tr&#232;s vari&#233;s : &#233;tymologique (dictionnaire de familles
de mots de Synapse1), analogique (outil p&#233;dagogique du Centre Coll&#233;gial de D&#233;veloppement
de Mat&#233;riel Didactique du Qu&#233;bec2) ou encore th&#233;matique (JeuxdeMots 3(Lafourcade, 2007)).
Notre contribution illustre une quatri&#232;me approche, celle des familles morpho-phonologiques, et
permet d&#8217;apporter un &#233;clairage nouveau dans l&#8217;analyse morphologique et s&#233;mantique du lexique
du fran&#231;ais.
</p>
<p>Notre int&#233;r&#234;t porte sur la morphologie lexicale. Les approches fond&#233;es sur les regroupements de
synonymes et les associations th&#233;matiques s&#8217;&#233;cartent de nos objectifs du fait que les mots appar-
tenant &#224; une m&#234;me famille ne partagent pas de lien de forme. La premi&#232;re approche s&#8217;&#233;loigne
&#233;galement de notre d&#233;marche. En effet, en d&#233;pit d&#8217;une continuit&#233; de sens entre des formes
voisines (d&#233;rivation r&#233;guli&#232;re), notre proposition est compl&#232;tement en synchronie et s&#8217;ancre
dans une th&#233;orie de la morphologie lexicale qui tient compte de la phonologie (Kiparsky, 1982).
Ainsi, nos familles morpho-phonologiques partagent une continuit&#233; de forme et de sens, ce
sens pouvant parfois &#234;tre tr&#232;s proche (&quot;table&quot; vs &quot;tablette&quot;) ou bien tr&#232;s dispers&#233; (&quot;lune&quot; vs
&quot;lunettes&quot;).
Dans la suite de cet article (section 2) nous d&#233;crirons la notion de &#8217;famille morpho-phonologique&#8217;
et nous nous int&#233;resserons &#224; l&#8217;impact de la phonologie dans la morphologie d&#233;rivationnelle, tout
en pr&#233;servant la notion de continuit&#233; de forme et de sens dans les familles. La section 3 d&#233;crit
une m&#233;thode qui utilise des corpus structur&#233;s et permet l&#8217;ajout d&#8217;informations s&#233;mantiques as-
soci&#233;es aux mots. Enfin, la section 4 &#233;tudie la dispersion s&#233;mantique de quelques familles de
mots et compare les r&#233;sultats obtenus empiriquement &#224; ceux obtenus suite &#224; une exp&#233;rience
men&#233;e avec 30 locuteurs natifs.
</p>
<p>2 &#201;l&#233;ments th&#233;oriques
Le principe est de rassembler les mots dans une m&#234;me famille. Nous proposons de d&#233;finir le
mot non pas comme une unit&#233; qui &quot;manque de rigueur&quot; (Dubois et al., 1994) , mais comme une
unit&#233; de d&#233;signation d&#8217;un objet, d&#8217;une r&#233;alit&#233;, d&#8217;un &#233;tat, d&#8217;une action, d&#8217;une qualit&#233; : le mot, en
associant une forme sonore &#224; un &quot;morceau&quot; de r&#233;alit&#233;, est une unit&#233; qui montre quelque chose.
De nombreux morph&#232;mes (les clitiques, les pr&#233;positions, ...) ne sont pas alors des mots. Dans
la suite de ce travail, le terme &quot;mot&quot; est pr&#233;f&#233;r&#233; au terme &quot;lex&#232;me&quot;.
</p>
<p>Le concept de famille de mots n&#8217;est pas en soi tr&#232;s novateur. La m&#233;thodologie morpho-pho-
nologique requise est, elle, plus novatrice. A la suite des travaux de Corbin (Corbin, 1987), la
description synchronique des structures morphologiques cherche &#224; segmenter les morph&#232;mes
constituant un mot. Cependant l&#8217;objectif n&#8217;est pas de d&#233;gager des r&#232;gles g&#233;n&#233;ratrices de nou-
velles constructions morphologiques. Classiquement, les formes diff&#233;rentes attest&#233;es pour un
</p>
<p>1http ://www.synapse-fr.com/produits/Famille.htm
2http ://www.ccdmd.qc.ca/fr/jeux_pedagogiques/id=1089&amp;action=animer
3http ://www.jeuxdemots.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dispersion s&#233;mantique dans des familles morpho-phonologiques
</p>
<p>mot ne sont pas li&#233;es &#224; la d&#233;rivation mais &#224; des &#233;l&#233;ments grammaticaux (genre, nombre, conju-
gaison...). Or, au moment des constructions d&#233;rivationnelles, les mots sont aussi transform&#233;es
par des principes d&#8217;alternances consonantiques ou vocaliques. &quot;Chaleur&quot; et &quot;chaud&quot; appartien-
nent &#224; la m&#234;me famille ; ils pr&#233;sentent une alternance al/au que l&#8217;on retrouve dans d&#8217;autres
familles (&quot;cheval&quot;, &quot;chevaucher&quot;). Sur ce point, notre approche rejoint la th&#233;orie de la morpholo-
gie et de la phonologie lexicale (Lexical morphology and phonology theory) (Kiparsky, 1982).
Trois principes sont &#233;tablis : 1/ les r&#232;gles de la formation des mots et les r&#232;gles phonologiques
s&#8217;appliquent ensemble dans un m&#234;me composant isol&#233; ; 2/ la p&#233;riodicit&#233; est une propri&#233;t&#233; des
r&#232;gles phonologiques ; l&#8217;application cyclique est un mode d&#8217;application qui n&#8217;est pas une pro-
pri&#233;t&#233; inh&#233;rente de la grammaire ; 3/ l&#8217;application cyclique des r&#232;gles phonologiques devrait
s&#8217;&#233;tablir &#224; partir de l&#8217;organisation du lexique. Parall&#232;lement, Corbin (Corbin, 1987) d&#233;montre
que les mots n&#8217;&#233;puisent pas toutes les constructions potentielles : certaines d&#233;rivations pour-
raient exister, mais elles ne sont pas attest&#233;es dans la langue (&quot;refaire&quot; existe, mais &quot;redanser&quot;
n&#8217;est pas attest&#233;). Nous retenons deux &#233;l&#233;ments : la morpho-phonologie a toute sa pertinence
pour appr&#233;hender les constructions d&#233;rivationnelles ; cependant, les mots, refl&#233;tant des pratiques
sociales h&#233;t&#233;rog&#232;nes, ne permettent pas l&#8217;application &quot;aveugle&quot; de d&#233;rivation phonologique cy-
clique et syst&#233;matique. Deux crit&#232;res m&#233;thodologiques sont alors retenus : la continuit&#233; s&#233;man-
tique entre deux mots et les variations phonologiques participant &#224; la construction d&#8217;une famille
de mots.
</p>
<p>L&#8217;analyse permet de rendre compte que de nombreux mots sont construits avec des syllabes sans
signification. Par exemple, &quot;soustraction&quot;, &quot;abstraction&quot;, &quot;tracter&quot;, &quot;tracteur&quot; ont-ils un radical
commun ? La technique de la commutation (garder le plus petit minimum commun) conduit &#224;
proposer &quot;tract&quot;. Comment cela est-il possible ? Premier r&#233;flexe, ce rassemblement est erron&#233; et
ne veut rien dire. Deuxi&#232;me r&#233;flexe, en regardant l&#8217;histoire &#233;crite de la langue, des attestations
peuvent ou non accr&#233;diter cette approche. Troisi&#232;me r&#233;flexe, cela pose un probl&#232;me linguistique
en synchronie, car ce sont les usagers qui fabriquent, emploient, modifient les formes des mots
et leur sens. Par cons&#233;quent, nous ne retiendrons pas l&#8217;approche diachronique des dictionnaires.
Notre propos est de rendre compte d&#8217;une organisation lexicale de la langue fran&#231;aise contem-
poraine sur un double principe organisationnel : phonologique et s&#233;mantique.
</p>
<p>3 &#201;l&#233;ments empiriques
3.1 Le rideau est rid&#233; : justifications phonologiques et s&#233;mantiques
Nous avons appliqu&#233; une grille d&#8217;analyse pour construire des familles de mots sur un principe
morpho-phonologique. Le r&#233;sultat est une ressource lexicale, Polymots, permettant la consul-
tation des familles &#224; partir de mots ou d&#8217;affixes (Gala &amp; Rey, 2008). L&#8217;analyse mise en oeuvre
a montr&#233; qu&#8217;effectivement les familles obtenues contiennent une moyenne de 10 mots pour un
m&#234;me radical ou mot base (pouvant aller jusqu&#8217;&#224; plus de 50). De plus, beaucoup de mots sont
construits &#224; l&#8217;aide d&#8217;un radical sans signification lorsqu&#8217;il est isol&#233; -nous l&#8217;appelons mot base
opaque- (1/3 des entr&#233;es, exemples &quot;clam&quot;, &quot;duct&quot;, &quot;dict&quot;, &quot;opt&quot;, etc.).
Une fois r&#233;solu le traitement morpho-phonologique des unit&#233;s, la question de la variation lexica-
le au sein d&#8217;une m&#234;me famille est alors pos&#233;e : avons-nous le droit de rassembler dans une m&#234;me
famille, des mots partageant un m&#234;me radical morpho-phonologique mais appartenant &#224; des
champs s&#233;mantiques apparemment diff&#233;rents (comme &quot;abstraction&quot; et &quot;soustraction&quot;) ? Si oui,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nuria Gala, V&#233;ronique Rey, Laurent Tichit
</p>
<p>pourquoi ? Si le concept de famille de mots repose sur un radical commun et une signification
commune, alors il s&#8217;agit, d&#8217;apr&#232;s nous, d&#8217;une construction tr&#232;s r&#233;ductrice. En effet, comme
unit&#233; de d&#233;signation, le mot peut comporter plusieurs traits s&#233;mantiques (dans une perspective
structuraliste) g&#233;n&#233;rant des mots tr&#232;s diff&#233;rents. Ce ph&#233;nom&#232;ne est tr&#232;s bien document&#233; d&#8217;un
point de vue historique. Il suffit pour cela de lire les tr&#232;s belles pages du dictionnaire historique
de langue fran&#231;aise de A. Rey. Notre hypoth&#232;se est qu&#8217;il en est de m&#234;me dans l&#8217;actualit&#233; de la
langue.
</p>
<p>Entre les mots &quot;boule&quot;, &quot;boulotte&quot; et &quot;boulon&quot;, le trait s&#233;mantique de &#8217;rondeur&#8217; est commun ;
cela est donc relativement transparent pour le lecteur. Cependant, le mot &quot;bouleverser&quot; pose
question : il y a bien la forme &quot;boule&quot; ; il y a &#233;galement la forme &quot;verse&quot; qui indique un mouve-
ment de retournement (on ne peut verser que vers le bas). La construction de ces deux mots, si
on accepte cette analyse, conduit &#224; la d&#233;signation d&#8217;un &#233;tat d&#8217;&#226;me. Le regroupement de mots sur
un principe morpho-phonologique interroge donc la continuit&#233; s&#233;mantique4. Tel est le propos
de cette &#233;tude.
</p>
<p>3.2 Acquisition d&#8217;informations s&#233;mantiques
</p>
<p>La question qui nous int&#233;resse est l&#8217;&#233;tude de la &#8217;dispersion s&#233;mantique&#8217; d&#8217;une famille de mots ;
l&#8217;id&#233;e est d&#8217;associer &#224; chaque entr&#233;e lexicale de Polymots un ensemble de termes constituant
son &#8217;espace s&#233;mantique&#8217;. La constitution et l&#8217;enrichissement de ressources reste une t&#226;che parti-
culi&#232;rement difficile en ce qui concerne la m&#233;thode mise en &#339;uvre. Sans &#233;voquer les ressources
construites manuellement (dont le co&#251;t est significatif), il existe un certain nombre de m&#233;thodes
semi-automatiques qui se servent des ressources existantes (dictionnaires, listes de synonymes,
ontologies comme WordNet, etc.). Beaucoup d&#8217;entre elles utilisent plus particuli&#232;rement les
d&#233;finitions de dictionnaires pour diff&#233;rents objectifs (Ide &amp; V&#233;ronis, 1990), (Brun et al., 2001),
(L&#8217;Homme, 2003). Les d&#233;finitions ont &#233;t&#233;, aussi, notre point de d&#233;part.
</p>
<p>3.2.1 M&#233;thode g&#233;n&#233;rale
</p>
<p>Dans un souci de diversification de corpus, mais confront&#233;s &#224; la difficult&#233; d&#8217;obtenir facilement
des ressources structur&#233;es, nous avons choisi d&#8217;utiliser des sources lexicographiques et ency-
clop&#233;diques accessibles librement, &#224; savoir, Wiktionnaire et Wikip&#233;dia. Nous avions aussi &#224;
notre disposition le disctionnaire Hachette-XML. La m&#233;thodologie que nous avons utilis&#233;e re-
pose sur l&#8217;extraction semi-automatique des d&#233;finitions (hors exemples) dans le cas des diction-
naires et du texte introductif (avant la table de mati&#232;res) dans le cas de Wikip&#233;dia. Nous avons
fait l&#8217;hypoth&#232;se de la pr&#233;sence de termes significatifs dans ces extraits5, c&#8217;est-&#224;-dire des termes
que nous appellerons par la suite des unit&#233;s de sens, caract&#233;risant s&#233;mantiquement chaque mot
m donn&#233;. Par exemple, &#224; partir de la premi&#232;re d&#233;finition de &quot;bras&quot; du Wiktionnaire :
</p>
<p>&quot;(Anatomie) Partie du membre superieur des humains (et des bip&#232;des en g&#233;n&#233;ral) qui s&#8217;&#233;tend
depuis l&#8217;&#233;paule jusqu&#8217;au coude&quot;
nous obtenons &quot;partie, membre, sup&#233;rieur, humains, bip&#232;des&quot; etc.
</p>
<p>4Nous attirons l&#8217;attention sur le fait que la d&#233;rivation flexionnelle permet une &#233;conomie mn&#233;sique car le locuteur
peut cr&#233;er des n&#233;ologismes &#224; partir de mots connus. Ceci n&#8217;est pas possible dans toutes les langues.
</p>
<p>5Noms (hors gloses et autres termes lexicographiques), verbes, adjectifs, quelques adverbes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dispersion s&#233;mantique dans des familles morpho-phonologiques
</p>
<p>La liste obtenue est appel&#233;e l&#8217;espace s&#233;mantique du mot et est not&#233;e &#945;(m). Soit un corpus (fil-
tr&#233; avec un &#8217;antidictionnaire&#8217; et lemmatis&#233; avec TreeTagger) constitu&#233; de plusieurs d&#233;finitions
lexicographiques et d&#8217;informations encyclop&#233;diques concernant un multi-ensembleM de mots
(qui peuvent &#234;tre des mots base ou des mots d&#233;riv&#233;s). Il s&#8217;agit, pour chaque mot m &#8712; M,
d&#8217;extraire sa liste &#945;(m) d&#8217;unit&#233;s de sens :
</p>
<p>&#945;(m) = (u1, u2, . . . , ui, . . . , un)
</p>
<p>3.2.2 Pond&#233;ration
</p>
<p>Nous attribuons &#224; chaque unit&#233; de sens ui pr&#233;sente dans &#945;(m) un poids &#969;(ui) en fonction de
la distance de chaque unit&#233; ui au mot m, et en tenant compte du nombre total de mots n dans
chaque d&#233;finition, avec 0 &#8804; i &lt; n :
</p>
<p>&#8704;ui &#8712; &#945;(m), &#969;(ui) = 1&#8722; i/n
</p>
<p>Nous consid&#233;rons que l&#8217;importance d&#8217;une unit&#233; de sens ui diminue en fonction de sa distance au
mot m. De fait, l&#8217;unit&#233; de sens la plus proche de m aura un poids de 1, et &#224; chaque &#233;loignement
d&#8217;une unit&#233; de sens, le poids &#969; de l&#8217;unit&#233; de sens suivante sera divis&#233; selon un &#233;cart constant
(exemple, 1/4 si la d&#233;finition contient quatre unit&#233;s de sens, etc.). Nous obtenons donc, pour
chaque mot m, un espace s&#233;mantique &#946;(m) pond&#233;r&#233;.
</p>
<p>&#946;(m) = {(u1, &#969;(u1)), (u2, &#969;(u2)), . . . , (ui, &#969;(ui)), . . . , (un, &#969;(un))}
</p>
<p>3.2.3 Sommation et harmonisation
</p>
<p>Il est courant que le m&#234;me mot apparaisse plusieurs fois dans le corpus initial, constitu&#233; de d&#233;fi-
nitions extraites de plusieurs sources.M est donc multi-ensemble. Chaque occurrence mj de m
aura donc son propre espace s&#233;mantique pond&#233;r&#233; &#946;(mj), compos&#233; de couples (u, &#969;j(u)). Pour
obtenir le poids global &#8486; d&#8217;une unit&#233; de sens d&#8217;un mot m donn&#233;, il est donc n&#233;cessaire d&#8217;addi-
tionner, pour chaque unit&#233; de sens u donn&#233;e, les poids &#969;j(u). Soit p le nombre d&#8217;occurences du
mot m dans M :
</p>
<p>&#8704;u &#8712;
p&#8899;
</p>
<p>j=1
</p>
<p>&#945;(mj),&#8486;(u) =
p&#8721;
</p>
<p>j=1
</p>
<p>&#969;j(u)
</p>
<p>Afin de pouvoir comparer les valeurs des poids entre diff&#233;rents mots donn&#233;s, nous consid&#233;rons
que le poids maximal d&#8217;une unit&#233; de sens doit &#234;tre &#233;gal &#224; 1 (le terme u est tr&#232;s porteur de sens
pour m), et le poids minimum strictement sup&#233;rieur &#224; 0. Nous harmonisons donc, pour chaque
mot m, les poids calcul&#233;s en divisant l&#8217;ensemble des valeurs par le poids maximal. Gr&#226;ce &#224; ce
type de normalisation, notre m&#233;thode poss&#232;de l&#8217;avantage d&#8217;&#234;tre ind&#233;pendante de la taille globale
du corpus. La figure 1 illustre le d&#233;but de l&#8217;espace s&#233;mantique obtenu pour &quot;embrasser&quot; :
</p>
<p>[serrer 1] [contenir 0.666] [saisir 0.666] [bras 0.585] [attacher
0.444] [entourer 0.444] [&#233;tendre 0.314] [regard 0.314] [adopter
0.296] [baiser 0.248] [englober 0.166][&#233;treindre 0.148] ...
</p>
<p>FIG. 1 &#8211; Extrait du r&#233;sultat pour le mot &quot;embrasser&quot;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nuria Gala, V&#233;ronique Rey, Laurent Tichit
</p>
<p>Les espaces s&#233;mantiques obtenus contiennent une moyenne de 105 unit&#233;s de sens. Comme l&#8217;il-
lustre la Figure 1 pour &quot;embrasser&quot;, on y retrouve des termes synonymes (&quot;serrer&quot;, &quot;englober&quot;,
&quot;&#233;treindre&quot; etc.) et des termes li&#233;s th&#233;matiquement (&quot;bras&quot;, &quot;regard&quot;, &quot;baiser&quot;)6.
</p>
<p>4 Dispersion s&#233;mantique
</p>
<p>4.1 D&#233;finition et principe
</p>
<p>Nous d&#233;finissons la dispersion s&#233;mantique comme la pr&#233;sence tr&#232;s faible, voire l&#8217;absence, du
mot base dans l&#8217;espace s&#233;mantique d&#8217;un mot d&#233;riv&#233; de sa famille. Le sens des unit&#233;s lexicales
avec une forte dispersion s&#233;mantique a &#233;volu&#233; par rapport au mot base, cette &#233;volution se faisant
&#224; la mani&#232;re de la d&#233;rivation par m&#233;taphore &#233;voqu&#233;e par (Picoche, 1999) (sens figur&#233;s : &quot;vache&quot;
dans le sens &#8217;mechancet&#233;&#8217;, &quot;mine&quot; dans le sens &#8217;explosif&#8217;), ou bien par extension d&#8217;un seul des
traits s&#233;mantiques du mot base. Par exemple, d&#8217;apr&#232;s nos r&#233;sultats, le mot base &quot;fil&quot; a un poids
de 0,12 dans &quot;d&#233;filer&quot;, ce qui montre bien une dispersion s&#233;mantique du mot d&#233;riv&#233; par rapport
aux autres membres de la famille (&quot;fil&quot; dans &quot;faufiler&quot; a un poids de 0.50). Pour &quot;d&#233;filer&quot;, la
continuit&#233; s&#233;mantique existe n&#233;anmoins dans la mesure o&#249; il est possible d&#8217;identifier des traits
s&#233;mantiques communs (&quot;long&quot; avec 0.32 dans &quot;d&#233;fil&#233;&quot; et 0.19 dans &quot;fil&quot;). &#192; l&#8217;inverse, il existe
des familles avec tr&#232;s peu de dispersion s&#233;mantique : il y a donc une forte continuit&#233; de sens.
Dans ces cas, la d&#233;rivation a conserv&#233; les traits s&#233;mantiques &#8217;principaux&#8217; du mot base ; la famille
de &quot;terre&quot; ou de &quot;bras&quot; en sont des exemples (cf. Figure 1, &quot;bras&quot; dans &quot;embrasser&quot;).
</p>
<p>4.2 &#201;valuation des r&#233;sultats
30 locuteurs francophones ont &#233;t&#233; test&#233;s sur un jugement de dispersion s&#233;mantique de mots
relevant d&#8217;une m&#234;me famille. Ils devaient donner un score entre 0 et 1 pour caract&#233;riser la
dispersion s&#233;mantique entre la forme de base et le mot d&#233;riv&#233; : 0 indique une grande dispersion
s&#233;mantique (peu de rapport entre deux mots) et 1 une tr&#232;s faible dispersion (un rapport fort). Le
tableau 1 pr&#233;sente les r&#233;sultats pour six familles morpho-phonologiques. Pour chaque couple
de mots, nous donnons les moyennes &#233;tablies par les locuteurs (L) et par le corpus (C). Pour
une m&#234;me famille, la dispersion s&#233;mantique per&#231;ue par les locuteurs est mise en &#233;vidence par
l&#8217;ordre des colonnes (&#224; gauche forte dispersion, sens &#233;loign&#233; ; &#224; droite faible dispersion, sens
proche) :
</p>
<p>L C L C L C
arme-alarme 0.17 0.71 arme-armoire 0.41 - arme-armure 0.90 1
court-courtois 0.22 - court-raccourcir 0.77 0.37 court-&#233;courter 0.88 0.88
vache-avachir 0.26 - vache-vacherin 0.66 0.20 vache-vacherie 0.74 1
fil-faufiler 0.49 0.50 fil-d&#233;filer 0.69 0.12 fil-filiation 0.74 0.25
bras-embrasser 0.57 0.58 bras-bracelet 0.77 0.36 bras-brassard 0.95 1
terre-terrasse 0.70 0.51 terre-enterrement 0.81 0.43 terre-territoire 0.89 0.58
</p>
<p>TAB. 1 &#8211; Dispersion s&#233;mantique per&#231;ue par des locuteurs et sur corpus.
</p>
<p>6Pour les homonymes, les diff&#233;rents sens sont explicites (&quot;mine&quot; : &quot;aspect&quot;, &quot;galerie&quot;, &quot;explosif&quot;, etc.)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dispersion s&#233;mantique dans des familles morpho-phonologiques
</p>
<p>Il s&#8217;av&#232;re que si le mot base a des traits s&#233;mantiques homog&#232;nes (par exemple &quot;terre&quot; avec
&#8217;espace&#8217;, &#8217;surface&#8217;, &#8217;mati&#232;re&#8217;, etc.) la dispersion s&#233;mantique dans la famille est faible ; le mot
base a, d&#8217;ailleurs, des poids importants dans les espaces s&#233;mantiques de ses d&#233;riv&#233;s (par exem-
ple, 0.58 de &quot;terre&quot; dans &quot;territoire&quot;, 0.51 dans &quot;terrasse&quot;, etc.). Si, en revanche, le mot base a
plusieurs traits s&#233;mantiques (comme &quot;val&quot; qui peut indiquer une forme ou une descente) alors
la dispersion est forte. Ainsi, entre &quot;arme&quot; et &quot;alarme&quot; les locuteurs per&#231;oivent mal la continuit&#233;
s&#233;mantique (pr&#233;sente n&#233;anmoins dans la d&#233;finition du dictionnaire et rendue &#233;vidente gr&#226;ce aux
corpus). En effet, le mot &quot;alarme&quot; pr&#233;sente des traits s&#233;mantiques li&#233;s &#224; &#8217;signal&#8217;, &#8217;alerte&#8217;, etc. et
non pas des traits li&#233;s &#224; &#8217;militaire&#8217;, &#8217;guerre&#8217; ; c&#233;pendant, les traits &#8217;dispositif&#8217; et &#8217;prot&#233;ger&#8217; sont
communs.
</p>
<p>Une comparaison des r&#233;sultats obtenus gr&#226;ce aux locuteurs avec ceux obtenus gr&#226;ce &#224; l&#8217;extrac-
tion semi-automatique &#224; partir de corpus confirme la m&#234;me tendance L-C pour des mots de la
famille &quot;vache&quot; et &quot;court&quot;, et tr&#232;s similaire pour &quot;bras&quot; et &quot;terre&quot; : il s&#8217;agit de familles avec peu
de dispersion s&#233;mantique. Dans certains cas comme &quot;fil&quot; et &quot;arme&quot; les r&#233;sultats sont l&#233;g&#232;rement
diff&#233;rents entre L et C soit par l&#8217;absence du mot base dans l&#8217;espace s&#233;mantique d&#8217;un des mots
d&#233;riv&#233;s (&quot;arme&quot; dans &quot;amoire&quot;), soit &#224; cause de la perception de certains mots : &quot;d&#233;filer&quot; est
fortement dispers&#233; selon le corpus (0.12) et peu selon la perception des locuteurs (0.69).
Enfin, le mot base est absent dans tous les mots de type opaque (&quot;val&quot; dans &quot;vall&#233;e&quot;) ou dans
certains mots transparents (&quot;court&quot; dans &quot;courtois&quot;). Dans ces cas-l&#224;, des traits s&#233;mantiques
r&#233;currents sont n&#233;anmoins pr&#233;sents dans les espaces s&#233;mantiques (&#8217;descendre&#8217; dans &quot;avaler&quot; et
&quot;d&#233;valer&quot;, &#8217;fort&#8217; dans &quot;glu&quot; et &quot;gluten&quot;, etc.).
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; une &#233;tude de la morphologie lexicale du fran&#231;ais fond&#233;e sur la notion de
continuit&#233; de forme et de sens. Dans le cas de familles peu dispers&#233;es s&#233;mantiquement, la per-
ception des locuteurs et les r&#233;sultats obtenus empiriquement sont tr&#232;s coh&#233;rents, ce qui permet
de valider notre approche. Pour les mots (ou les familles) avec une dispersion s&#233;mantique im-
portante, la cr&#233;ation d&#8217;espaces s&#233;mantiques &#224; l&#8217;aide de corpus s&#8217;av&#232;re moins &#233;vidente. Ceci nous
am&#232;ne &#224; prendre en compte les limites de notre approche : d&#8217;une part, l&#8217;influence de la qualit&#233;
et de la taille des corpus lexicographiques et encyclop&#233;diques, ainsi que l&#8217;impact des erreurs
du TreeTagger ; d&#8217;autre part, le traitement principalement statistique des corpus. Ainsi, nous
envisageons l&#8217;ajout de traitements linguistiques plus approfondis (extraction de d&#233;pendances
syntaxiques, prise en compte de la n&#233;gation, etc.) pour une meilleure attribution des poids dans
des cas de constructions particuli&#232;res : n&#233;gations, phrases relatives, cliv&#233;es, etc. (&#8217;sans vigueur&#8217;,
&#8217;qui a peu de longueur&#8217;, &#8217;ce qui est s&#233;par&#233; d&#8217;un ensemble&#8217;, etc.).
Enfin, outre l&#8217;adaptation et l&#8217;incorporation des espaces s&#233;mantiques dans la base Polymots, nous
travaillons &#224; une caract&#233;risation s&#233;mantique approfondie des familles morpho-phonologiques
qui tient compte du r&#244;le des affixes et des mots base dans la construction des unit&#233;s lexicales.
</p>
<p>Remerciements
</p>
<p>Nous remercions les trois relecteurs anonymes pour leurs remarques et critiques pertinentes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nuria Gala, V&#233;ronique Rey, Laurent Tichit
</p>
<p>R&#233;f&#233;rences
BRUN C., JACQUEMIN B. &amp; SEGOND F. (2001). Exploitation de dictionnaires &#233;lectroniques
pour la d&#233;sambigu&#239;sation s&#233;mantique. Traitement Automatique des Langues, 42(3), 667&#8211;691.
CORBIN D. (1987). Morphologie d&#233;rivationnelle et structuration du lexique, volume 1 &amp; 2.
Tubingen : Max Niemeyer, Verlag.
J. DUBOIS, M. GIACOMO, L. GUESPIN, C. MARCELLESI &amp; J. P. M&#201;VEL, Eds. (1994).
Dictionnaire de la linguistique et des sciences du langage. Paris, Larousse.
GALA N. &amp; REY V. (2008). Polymots : une base de donn&#233;es de constructions d&#233;rivation-
nelles en fran&#231;ais &#225; partir de radicaux phonologiques. In Traitement Automatique des Langues
Naturelles, TALN 2008, Avignon.
IDE N. &amp; V&#201;RONIS J. (1990). Word sense disambiguation with very large neural networks
extracted from machine readable dictionnaries. In 13th International Conference on Compu-
tational Linguistics, COLING 90, volume 2, p. 389&#8211;394, Helsinki.
KIPARSKY P. (1982). From cyclic Phonology to lexical Phonology, In The structure of Phono-
logical Representations, volume 1, p. 131&#8211;175. V. H. and S. N. New York : Dordrecht.
LAFOURCADE M. (2007). Making people play for lexical acquisition. In 7th Symposium on
Natural Language Processing, SNLP 2007, Pattaya, Thailande.
L&#8217;HOMME M. C. (2003). Acquisition de liens conceptuels entre termes &#224; partir de leur d&#233;fi-
nition. Cahiers de lexicographie, 83(2), 19&#8211;34.
PICOCHE J. (1999). Dialogue autour de l&#8217;enseignement du vocabulaire. &#201;tudes de linguistique
appliqu&#233;e, 16, 421&#8211;434.</p>

</div></div>
</body></html>