<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apport de la syntaxe dans un syst&#232;me de question-r&#233;ponse : &#233;tude du syst&#232;me FIDJI.</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Apport de la syntaxe dans un syst&#232;me de question-r&#233;ponse :
&#233;tude du syst&#232;me FIDJI.
</p>
<p>V&#233;ronique Moriceau Xavier Tannier
Universit&#233; Paris-Sud 11 / LIMSI-CNRS
</p>
<p>BP 133, 91403 Orsay Cedex, France
{moriceau, xtannier}@limsi.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente une s&#233;rie d&#8217;&#233;valuations visant &#224; &#233;tudier l&#8217;apport d&#8217;une ana-
lyse syntaxique robuste des questions et des documents dans un syst&#232;me de questions-r&#233;ponses.
Ces &#233;valuations ont &#233;t&#233; effectu&#233;es sur le syst&#232;me FIDJI, qui utilise &#224; la fois des informations
syntaxiques et des techniques plus &#8220;traditionnelles&#8221;.
La s&#233;lection des documents, l&#8217;extraction de la r&#233;ponse ainsi que le comportement selon les
diff&#233;rents types de questions ont &#233;t&#233; &#233;tudi&#233;s.
</p>
<p>Abstract. This paper presents some experiments aiming at estimating the contribution
of a syntactic parser on both questions and documents in a question-answering system. This
evaluation has been performed with the system FIDJI, which makes use of both syntactic infor-
mation and more &#8220;traditional&#8221; techniques.
Document selection, answer extraction as well as system behaviour on different types of ques-
tions have been experimented.
</p>
<p>Mots-cl&#233;s : Syst&#232;mes de questions-r&#233;ponses, analyse syntaxique, &#233;valuation.
Keywords: Question-answering, syntactic analysis, evaluation.
</p>
<p>1 Introduction
</p>
<p>Nous pr&#233;sentons ici les r&#233;sultats d&#8217;une s&#233;rie d&#8217;&#233;valuations sur le syst&#232;me FIDJI1 (Finding In
Documents Justifications and Inferences), un syst&#232;me de questions-r&#233;ponses en domaine ouvert
pour le fran&#231;ais, utilisant notamment l&#8217;analyse syntaxique des textes et des questions.
</p>
<p>Les objectifs de cet article sont les suivants :
&#8211; Montrer que la syntaxe, exploit&#233;e en compl&#233;ment de techniques plus &#8220;traditionnelles&#8221; de
</p>
<p>questions-r&#233;ponses, peut conduire &#224; une am&#233;lioration notable des r&#233;sultats globaux ;
&#8211; &#201;tudier &#224; quelles &#233;tapes du traitement et pour quels types de questions l&#8217;utilisation de l&#8217;ana-
</p>
<p>lyse syntaxique peut apporter une r&#233;elle plus-value.
</p>
<p>Dans un premier temps, la section 2 r&#233;sume l&#8217;architecture et le fonctionnement du syst&#232;me
FIDJI. Puis l&#8217;&#233;valuation modulaire, c&#339;ur de cet article, est pr&#233;sent&#233;e &#224; la section 3, avec une
pr&#233;sentation globale des r&#233;sultats, puis des &#233;tudes sur l&#8217;apport de l&#8217;analyse syntaxique lors de
</p>
<p>1Ce travail est financ&#233; partiellement par le projet CONIQUE ANR-05-BLAN-008501 et par OSEO dans le
cadre du programme Quaero.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Moriceau, Xavier Tannier
</p>
<p>la phase de s&#233;lection des documents, de l&#8217;extraction de la r&#233;ponse, et enfin sur les diff&#233;rences
entre les diff&#233;rents types de questions.
</p>
<p>2 Une approche syntaxique pour la validation de r&#233;ponses
</p>
<p>2.1 Pr&#233;sentation de FIDJI
</p>
<p>La plupart des syst&#232;mes de questions-r&#233;ponses peut extraire une r&#233;ponse &#224; une question factuelle
quand celle-ci est explicitement pr&#233;sente dans le texte, mais ils ne sont pas capables de combiner
plusieurs informations pour produire une r&#233;ponse.
</p>
<p>Le syst&#232;me de questions-r&#233;ponses FIDJI vise &#224; introduire des m&#233;canismes de compr&#233;hension
reposant sur des inf&#233;rences. L&#8217;objectif est de produire des r&#233;ponses qui sont enti&#232;rement valid&#233;es
par des extraits de textes (des passages).
Pour la premi&#232;re &#233;tape de d&#233;veloppement de ce syst&#232;me, nous avons introduit l&#8217;utilisation d&#8217;un
analyseur syntaxique robuste, d&#8217;une part pour le traitement et la d&#233;composition des questions et
d&#8217;autre part pour l&#8217;analyse des documents.
</p>
<p>L&#8217;ajout d&#8217;informations syntaxiques a plusieurs buts :
&#8211; Faciliter l&#8217;obtention des caract&#233;ristiques port&#233;es par la question : type de la question, de la
</p>
<p>r&#233;ponse attendue, entit&#233;s nomm&#233;es, etc.
&#8211; D&#233;composer &#233;ventuellement la question avec pour objectif de valider une r&#233;ponse potentielle
</p>
<p>dans plusieurs documents.
&#8211; S&#233;lectionner des passages candidats (i.e. contenant peut-&#234;tre la r&#233;ponse) de fa&#231;on plus pr&#233;cise,
</p>
<p>en utilisant non plus des mots-cl&#233;s simples, mais des d&#233;pendances syntaxiques.
&#8211; Enfin, extraire la r&#233;ponse de ces passages &#224; partir de la combinaison des informations issues
</p>
<p>de la question et des phrases &#233;tudi&#233;es.
</p>
<p>Beaucoup de syst&#232;mes de questions-r&#233;ponses utilisent des informations syntaxiques, en particu-
lier les relations de d&#233;pendance, principalement pour l&#8217;extraction des r&#233;ponses. Deux approches
&#233;mergent : la premi&#232;re consiste &#224; rechercher un appariement exact entre les relations de d&#233;pen-
dance de la question et celles d&#8217;un passage (Katz &amp; Lin, 2003), tandis que la seconde approche
calcule une distance d&#8217;&#233;dition entre les arbres repr&#233;sentant la question et le passage (Ligozat,
2007). En ce qui concerne la d&#233;composition des questions, les strat&#233;gies propos&#233;es se posi-
tionnent &#224; un niveau &#224; la fois syntaxique et s&#233;mantique (Katz et al., 2005; Hartrumpf et al.,
2008).
Notre but est d&#8217;extraire et de valider des r&#233;ponses en allant au-del&#224; d&#8217;un appariement syntaxique
exact entre la question et le passage, et cela sans utiliser de ressources s&#233;mantiques. Dans ce
contexte de validation de r&#233;ponse, nous avons remarqu&#233; que la strat&#233;gie de validation &#224; appliquer
(validation par un seul ou plusieurs documents) peut &#234;tre guid&#233;e par la question, et en particulier
par le type de r&#233;ponse attendu.
</p>
<p>Une pr&#233;sentation d&#233;taill&#233;e du fonctionnement de FIDJI et de chacun de ses modules est donn&#233;e
dans (Moriceau et al., 2009).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport de la syntaxe dans un syst&#232;me de question-r&#233;ponse
</p>
<p>FIG. 1 &#8211; Architecture de FIDJI
</p>
<p>2.2 Principe g&#233;n&#233;ral
</p>
<p>Nous pr&#233;sentons ici l&#8217;architecture g&#233;n&#233;rale ainsi que deux exemples : 1) l&#8217;extraction d&#8217;une r&#233;-
ponse et la validation de son type dans le document s&#233;lectionn&#233;, et 2) l&#8217;extraction d&#8217;une r&#233;ponse
et la validation de son type dans plusieurs documents.
</p>
<p>La figure 1 pr&#233;sente l&#8217;architecture de FIDJI. L&#8217;ensemble des documents est index&#233; par le mo-
teur de recherche Lucene (Hatcher &amp; Gospodnetic&#769;, 2004). On extrait de la question les relations
syntaxiques &#224; rechercher, le type de la question (liste, d&#233;finition, fait. . .) ainsi que le type de la
r&#233;ponse (type d&#8217;entit&#233; nomm&#233;e ou type plus sp&#233;cifique &#8211; voir l&#8217;exemple 2) et les mots-cl&#233;s signi-
ficatifs2. L&#8217;index est interrog&#233; avec ces mots-cl&#233;s et les 100 premiers documents sont conserv&#233;s.
</p>
<p>L&#8217;approche consiste &#224; d&#233;terminer, pour une question donn&#233;e, si toutes les caract&#233;ristiques de
la question (en l&#8217;occurrence les d&#233;pendances syntaxiques) peuvent &#234;tre trouv&#233;es dans un ou
plusieurs documents. Notre syst&#232;me s&#8217;appuie sur les analyses syntaxiques produites par Syn-
tex (Bourigault &amp; Fabre, 2000), un analyseur robuste pour le fran&#231;ais.
</p>
<p>2.2.1 Exemple 1
</p>
<p>Dans un premier temps, l&#8217;analyse de la question fournit les relations de d&#233;pendance syntaxique,
le type de la question et le type de r&#233;ponse attendu. Par exemple :
</p>
<p>2C&#8217;est-&#224;-dire les mots &#233;tiquet&#233;s comme nom, verbe, adjectif ou adverbe par l&#8217;analyseur syntaxique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Moriceau, Xavier Tannier
</p>
<p>Question : Quelle ville a &#233;t&#233; secou&#233;e par un tremblement de terre le 17 janvier ?
D&#233;pendances : DATE(17 janvier)
</p>
<p>attribut_de(tremblement, terre)
SUJ(secouer, REPONSE)
AUX(&#234;tre, secouer)
modif_par(secouer, tremblement)
</p>
<p>Type de la question : factuelle
Type de r&#233;ponse attendu : ville (entit&#233; nomm&#233;e)
</p>
<p>Les phrases contenant le plus de relations en commun avec la question sont ensuite s&#233;lection-
n&#233;es dans un sous-ensemble de documents de la collection. Par exemple :
</p>
<p>Passage : Le tremblement de terre qui a secou&#233;, &lt;date&gt;lundi 17 janvier&lt;/date&gt;, &lt;ville&gt;Los An-
geles&lt;/ville&gt; ne serait pas associ&#233; directement &#224; la fameuse faille...
</p>
<p>DATE(17 janvier)
attribut_de(tremblement, terre)
SUJ(secouer, tremblement)
OBJ(secouer, Los Angeles)
SUJ(secouer, Los Angeles)
AUX(&#234;tre, secouer)
modif_par(secouer,tremblement)
...
</p>
<p>Ici, toutes les relations de la question sont pr&#233;sentes dans l&#8217;analyse du passage (on note qu&#8217;ici,
les relations en italique ont &#233;t&#233; obtenues par une r&#232;gle de r&#233;&#233;criture de la voix active vers la voix
passive). Par unification avec la variable r&#233;ponse de la question, la r&#233;ponse potentielle qui est
extraite est donc Los Angeles. Il reste alors &#224; v&#233;rifier que le type de cette r&#233;ponse correspond
bien au type de r&#233;ponse attendu (ville).
Pour cela, les entit&#233;s nomm&#233;es des documents ont &#233;t&#233; pr&#233;alablement &#233;tiquet&#233;es en utilisant un
ensemble d&#8217;environ 160 types (Rosset et al., 2007) (e.g. personne, organisation, lieu, nationa-
lit&#233;, date, nombre, etc.). Ainsi, le passage &#233;tiquet&#233; en entit&#233;s nomm&#233;es permet de valider le type
de la r&#233;ponse candidate extraite (Los Angeles).
</p>
<p>2.2.2 Exemple 2
</p>
<p>Soit la question : Quel premier ministre s&#8217;est suicid&#233; en 1993 ?
D&#233;pendances :
</p>
<p>DATE(se suicider, 1993)
SUJ(se suicider, REPONSE)
attribut(REPONSE, ministre)
attribut(ministre, premier)
</p>
<p>Type de la question : factuelle
Type de r&#233;ponse attendu : personne (type pr&#233;cis : premier ministre)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport de la syntaxe dans un syst&#232;me de question-r&#233;ponse
</p>
<p>Et la phrase s&#233;lectionn&#233;e suivante :
&lt;personne&gt;Pierre B&#233;r&#233;govoy&lt;/personne&gt; s&#8217;est suicid&#233; en 1993.
</p>
<p>DATE(se suicider, 1993)
SUJ(se suicider, Pierre B&#233;r&#233;govoy)
</p>
<p>La variable REPONSE s&#8217;unifie avec Pierre B&#233;r&#233;govoy qui devient une r&#233;ponse candidate : le
type d&#8217;entit&#233; nomm&#233;e et les deux premi&#232;res d&#233;pendances de la question sont ainsi v&#233;rifi&#233;s dans
cette phrase. Il manque les deux d&#233;pendances suivantes, concernant le type pr&#233;cis de la r&#233;ponse
(Pierre B&#233;r&#233;govoy &#233;tait-il premier ministre ?).
Une nouvelle question est donc construite pour valider la r&#233;ponse candidate. La validation est
op&#233;r&#233;e en deux &#233;tapes. Tout d&#8217;abord, le syst&#232;me v&#233;rifie que la r&#233;ponse candidate est bien un
ministre, en recherchant une relation &#8217;attribut&#8217; (attribut(B&#233;r&#233;govoy, ministre)) dans
l&#8217;ensemble des documents. Si cela est confirm&#233;, le type &#233;tendu est &#233;galement v&#233;rifi&#233; et les deux
relations attribut(B&#233;r&#233;govoy, ministre) et attribut(fran&#231;ais, ministre) sont
attendues dans la m&#234;me phrase.
</p>
<p>Dans les cas o&#249; la variable REPONSE n&#8217;existe pas ou n&#8217;est pas instanci&#233;e par des relations
du passage, le syst&#232;me recherche un ou plusieurs candidats dans la phrase parmi les entit&#233;s
nomm&#233;es du type attendu.
</p>
<p>3 Apport de la syntaxe dans FIDJI
</p>
<p>Comme nous l&#8217;avons indiqu&#233;, si les r&#233;sultats g&#233;n&#233;raux ont de l&#8217;int&#233;r&#234;t, nous nous sommes sur-
tout attach&#233;s &#224; l&#8217;estimation du r&#244;le de la phase d&#8217;analyse syntaxique dans notre syst&#232;me. En
effet, il est important d&#8217;&#233;valuer le b&#233;n&#233;fice de la syntaxe par rapport aux techniques plus clas-
siques, et ce ind&#233;pendamment des autres caract&#233;ristiques propres &#224; un syst&#232;me donn&#233;.
</p>
<p>Plusieurs points sont ici &#233;valu&#233;s :
&#8211; les performances d&#8217;une approche syntaxique associ&#233;e &#224; des techniques classiques en question-
</p>
<p>r&#233;ponse,
&#8211; l&#8217;apport de la strat&#233;gie de d&#233;composition des questions,
&#8211; l&#8217;apport de la syntaxe pour la s&#233;lection des documents,
&#8211; l&#8217;apport de la syntaxe pour l&#8217;extraction des r&#233;ponses,
&#8211; les diff&#233;rences concernant l&#8217;extraction des r&#233;ponses selon le type de la question.
</p>
<p>Nous avons &#233;valu&#233; le syst&#232;me sur les donn&#233;es de test de la campagne d&#8217;&#233;valuation CLEF
2005 (Vallin et al., 2005). La collection de documents est compos&#233;e d&#8217;environ 177000 articles
de journaux en fran&#231;ais (Le Monde et ATS 1994-1995 (environ 2 Go)). Ces documents sont
cens&#233;s &#234;tre syntaxiquement corrects. Les questions sont factuelles ou de type d&#233;finition. Lors
de cette campagne, les syst&#232;mes sont autoris&#233;s &#224; proposer 3 r&#233;ponses pour chaque question, ces
r&#233;ponses devant &#234;tre class&#233;es par ordre de confiance.
</p>
<p>La m&#233;thodologie employ&#233;e et les r&#233;sultats obtenus sont d&#233;crits dans les sections suivantes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Moriceau, Xavier Tannier
</p>
<p>3.1 Performances globales de FIDJI
</p>
<p>Le tableau 1 pr&#233;sente les r&#233;sultats obtenus par FIDJI sur les donn&#233;es de CLEF 2005 (nombre
de r&#233;ponses correctes propos&#233;es en premi&#232;re position). Nous comparons ces r&#233;sultats avec ceux
de QRISTAL (Laurent et al., 2005; Laurent et al., 2006), le meilleur syst&#232;me de questions-
r&#233;ponses pour le fran&#231;ais lors de ces campagnes.
</p>
<p>Type de question FIDJI QRISTAL
Factuelle 53 % 59 %
D&#233;finition 78 % 86 %
TOTAL 58.5 % 64 %
</p>
<p>TAB. 1 &#8211; R&#233;sultats de FIDJI sur les donn&#233;es de CLEF 2005.
</p>
<p>Le nombre de r&#233;ponses correctes s&#8217;&#233;l&#232;ve &#224; 58.5 % pour les r&#233;ponses donn&#233;es en rang 1 et &#224;
70 % si l&#8217;on consid&#232;re les rangs 1 &#224; 3.
</p>
<p>Les r&#233;sultats de FIDJI sont inf&#233;rieurs &#224; ceux de QRISTAL qui utilise aussi une approche syn-
taxique mais qui b&#233;n&#233;ficie de l&#8217;utilisation de nombreuses ressources telles que des diction-
naires et des ontologies. Cependant, notre syst&#232;me se place &quot;virtuellement&quot; &#224; la deuxi&#232;me place
puisque le syst&#232;me qui a atteint la deuxi&#232;me place lors de CLEF 2005 a obtenu un score de
35 % de r&#233;ponses correctes.
</p>
<p>Nous &#233;valuons maintenant l&#8217;apport de la strat&#233;gie de d&#233;composition syntaxique des questions
dans le but de valider une r&#233;ponse gr&#226;ce &#224; plusieurs passages.
</p>
<p>Dans l&#8217;ensemble de questions de CLEF 2005, sur les 51 questions qui peuvent &#234;tre d&#233;compo-
s&#233;es en sous-questions en appliquant notre strat&#233;gie, FIDJI trouve une r&#233;ponse correcte (sans
tenir compte du rang) pour 32 questions. Rappelons que chaque fois que la d&#233;composition des
questions est appliqu&#233;e, le syst&#232;me peut rechercher des justifications &#224; la r&#233;ponse dans des do-
cuments diff&#233;rents. Parmi ces 32 r&#233;ponses correctes, 22 % ont une justification dans plusieurs
documents. En revanche, si FIDJI n&#8217;utilise pas la strat&#233;gie de d&#233;composition et de validation
par plusieurs documents, seulement 64 % des r&#233;ponses sont correctes (au lieu de 70 %).
Le tableau 2 montre le nombre de r&#233;ponses correctes dont la justification a &#233;t&#233; trouv&#233;e dans un
ou plusieurs documents.
</p>
<p>R&#233;ponses correctes en rang 1 &#224; 3 CLEF 2005
Avec justification dans 1 document 78 %
Avec justification dans plusieurs documents 22 %
Sans validation multi-documents 64 %
Avec validation multi-documents 70 %
</p>
<p>TAB. 2 &#8211; Evaluation de la strat&#233;gie de d&#233;composition des questions.
</p>
<p>Ces r&#233;sultats montrent une am&#233;lioration des performances du syst&#232;me lorsque l&#8217;on utilise une
strat&#233;gie de d&#233;composition des questions afin de valider les r&#233;ponses par l&#8217;interm&#233;diaire de
plusieurs documents (Moriceau et al., 2009).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport de la syntaxe dans un syst&#232;me de question-r&#233;ponse
</p>
<p>3.2 Apport de la syntaxe pour la s&#233;lection des passages
</p>
<p>Dans les syst&#232;mes de questions-r&#233;ponses, la s&#233;lection des passages candidats est g&#233;n&#233;ralement
effectu&#233;e en prenant en compte les mots de la question. Dans FIDJI, nous nous situons au niveau
des d&#233;pendances syntaxiques, en s&#233;lectionnant les phrases comportant le plus de d&#233;pendances
(nom de la relation et arguments) en commun avec la question.
Pour &#233;valuer l&#8217;apport de cette technique, nous l&#8217;avons compar&#233;e avec une s&#233;lection des phrases
comportant simplement le maximum de mots-cl&#233;s de la question (d&#233;sactivation du module not&#233;
&#192; dans la figure 1).
L&#8217;&#233;valuation est effectu&#233;e sur la collection de CLEF 2005 et les r&#233;sultats sont reproduits dans le
tableau 3. La progression du nombre de bons passages (passages contenant la r&#233;ponse en rang 1)
est tout &#224; fait significative (+8,1 %). Mais le nombre de bonnes r&#233;ponses en rang 1 augmente
encore plus (+15,8 %). Ainsi, la syntaxe ne permet pas seulement de r&#233;cup&#233;rer plus de bons
passages candidats, mais ces passages sont m&#234;me plus pertinents pour une extraction efficace
de la r&#233;ponse.
</p>
<p>Par ailleurs, on constate que le progr&#232;s pour les rangs 1 &#224; 3 est plus faible. Cela semble montrer
que les passages renvoy&#233;s sont comparables, mais que l&#8217;utilisation des relations syntaxiques en
am&#233;liore le classement.
</p>
<p>Mots-cl&#233;s D&#233;pendances
R&#233;ponses correctes en rang 1 50.5 % 58.5 %
R&#233;ponses correctes en rang 1 &#224; 3 68.5 % 70 %
Passages contenant la r&#233;ponse en rang 1 62.6 % 67.7 %
Passages contenant la r&#233;ponse en rang 1 &#224; 3 72.7 % 75.8 %
</p>
<p>TAB. 3 &#8211; Apport de l&#8217;utilisation de la syntaxe pour la s&#233;lection des passages candidats.
</p>
<p>3.3 Apport de la syntaxe pour l&#8217;extraction des r&#233;ponses
</p>
<p>L&#8217;&#233;valuation de l&#8217;apport de la syntaxe lors de l&#8217;extraction de la r&#233;ponse est effectu&#233;e en n&#8217;appli-
quant pas la technique d&#8217;unification de la variable r&#233;ponse d&#233;crite &#224; la section 2.2.1 (d&#233;sactiva-
tion du module not&#233; &#193; dans la figure 1).
Les r&#233;sultats sont pr&#233;sent&#233;s dans le tableau 4. Ils montrent une hausse de 34,5 % du nombre
de bonnes r&#233;ponses en rang 1 en pr&#233;sence du module syntaxique. Enfin, le tableau 5 donne les
r&#233;sultats obtenus par le syst&#232;me en n&#8217;appliquant aucune technique d&#8217;ordre syntaxique (d&#233;sacti-
vation des modules &#192; et &#193; de la figure 1).
Si la progression obtenue est importante, il faut noter que pour un certain nombre de ques-
tions, aucune m&#233;thode &#8220;de secours&#8221;, c&#8217;est-&#224;-dire n&#8217;utilisant pas la syntaxe, n&#8217;est pr&#233;vue. C&#8217;est
pourquoi il est n&#233;cessaire de comparer les r&#233;sultats en distinguant les types de questions ; c&#8217;est
l&#8217;objectif des exp&#233;rimentations d&#233;crites dans la section suivante.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Moriceau, Xavier Tannier
</p>
<p>Sans Avec
unification unification
</p>
<p>R&#233;ponses correctes en rang 1 43.5 % 58.5 %
R&#233;ponses correctes en rang 1 &#224; 3 55.5 % 70 %
Passages contenant la r&#233;ponse en rang 1 55.6 % 67.7 %
Passages contenant la r&#233;ponse en rang 1 &#224; 3 64.6 % 75.8 %
</p>
<p>TAB. 4 &#8211; Apport de l&#8217;utilisation de la syntaxe pour l&#8217;extraction des r&#233;ponses.
</p>
<p>Sans syntaxe Avec syntaxe
R&#233;ponses correctes en rang 1 36 % 58.5 %
R&#233;ponses correctes en rang 1 &#224; 3 51.5 % 70 %
Passages contenant la r&#233;ponse en rang 1 47 % 67.7 %
Passages contenant la r&#233;ponse en rang 1 &#224; 3 61.1 % 75.8 %
</p>
<p>TAB. 5 &#8211; Apport de l&#8217;utilisation de la syntaxe pour l&#8217;extraction des r&#233;ponses.
</p>
<p>3.4 Apport de la syntaxe selon les types de r&#233;ponses
</p>
<p>Dans le but d&#8217;&#233;valuer de fa&#231;on plus pr&#233;cise l&#8217;apport du module d&#8217;extraction de la r&#233;ponse par
unification des relations syntaxiques, nous avons isol&#233; les questions pour lesquelles le syst&#232;me
identifie un type d&#8217;entit&#233; nomm&#233;e (EN) &#224; rechercher. En effet, pour ces questions, en l&#8217;absence
du module &#193;, le syst&#232;me va simplement rechercher une entit&#233; nomm&#233;e du bon type dans le
passage s&#233;lectionn&#233;. En revanche, pour les autres questions, l&#8217;unification syntaxique &#233;tant le
seul moyen d&#8217;extraire une r&#233;ponse candidate, le d&#233;branchement du module conduit &#224; une ab-
sence de r&#233;ponse. La progression globale constat&#233;e d&#233;pend donc fortement de la finesse de la
classification en entit&#233;s nomm&#233;es et de l&#8217;analyse des questions correspondante.
</p>
<p>Sur les 200 questions de la campagne CLEF 2005, 169 ont &#233;t&#233; identifi&#233;es comme attendant
une entit&#233; nomm&#233;e3. Par ailleurs, il est &#233;galement int&#233;ressant de distinguer les questions dites
factuelles des questions de d&#233;finition.
</p>
<p>Le tableau 6 r&#233;sume les r&#233;sultats sur ces trois classes (non mutuellement exclusives) de ques-
tions, en comparant les proportions de bonnes r&#233;ponses renvoy&#233;es en premi&#232;re position. Il est
particuli&#232;rement notable que m&#234;me lorsque l&#8217;information sur l&#8217;EN attendue est pr&#233;sente, l&#8217;ana-
lyse syntaxique permet un gain de 14,6 %.
</p>
<p>Sans unification Avec unification
Questions sur une EN 52.7 % 60.4 %
Questions factuelles 48.3 % 53 %
Questions d&#233;finition 35.3 % 78 %
</p>
<p>TAB. 6 &#8211; Apport de l&#8217;utilisation de la syntaxe par types de questions (r&#233;ponses en rang 1).
</p>
<p>3Ce chiffre peut varier fortement selon des syst&#232;mes o&#249; la typologie des EN utilis&#233;es et l&#8217;analyse des questions
peuvent &#234;tre radicalement diff&#233;rentes. Ainsi, la question Qui est Javier Solana ? attend des EN de type &#8220;fonction&#8221;,
&#8220;profession&#8221;, etc. car l&#8217;&#233;tiqueteur est en mesure de les d&#233;tecter (Rosset et al., 2007).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport de la syntaxe dans un syst&#232;me de question-r&#233;ponse
</p>
<p>3.5 Conclusion
</p>
<p>Le syst&#232;me FIDJI pr&#233;sente une architecture et un fonctionnement repr&#233;sentatifs des briques
classiques utilis&#233;es par les syst&#232;mes de questions-r&#233;ponses classiques, &#224; ceci pr&#232;s qu&#8217;il fait ap-
pel en compl&#233;ment &#224; des connaissances d&#8217;ordre syntaxique sur les documents interrog&#233;s et les
questions pos&#233;es.
</p>
<p>Il est ainsi int&#233;ressant de proc&#233;der &#224; une &#233;valuation d&#233;taill&#233;e de l&#8217;apport de l&#8217;analyse syntaxique,
d&#8217;une part &#224; diff&#233;rents niveaux de la cha&#238;ne de questions-r&#233;ponses (s&#233;lection des documents,
puis extraction de la r&#233;ponse), mais &#233;galement selon les diff&#233;rents types de questions.
Nous avons pr&#233;sent&#233; dans cet article une s&#233;rie d&#8217;exp&#233;rimentations montrant que l&#8217;analyse syn-
taxique, combin&#233;e &#224; des m&#233;thodes robustes et plus classiques (moteur de recherche, &#233;tiquetage
en entit&#233;s nomm&#233;es. . .), pouvait conduire &#224; une progression tout &#224; fait significative &#224; chaque
&#233;tape du traitement.
</p>
<p>La prochaine &#233;tape va consister, dans le cadre du projet Quaero4, &#224; tester notre syst&#232;me sur une
collection de documents provenant du Web (2 millions de pages) et ainsi &#233;valuer ses perfor-
mances sur de tr&#232;s grandes collections de documents de styles et de formes tr&#232;s diff&#233;rents.
</p>
<p>R&#233;f&#233;rences
BOURIGAULT D. &amp; FABRE C. (2000). Approche linguistique pour l&#8217;analyse syntaxique de
corpus. Cahiers de Grammaire, 25.
HARTRUMPF S., GL&#214;CKNER I. &amp; LEVELING J. (2008). University of hagen at qa@clef
2008 : Efficient question answering with question decomposition and multiple answer streams.
In P. FORNER, A. PE&#209;AS, I. ALEGRIA, C. FORASCU, N. MOREAU, P. OSENOVA, P. PRO-
KOPIDIS, P. ROCHA, B. SACALEANU, R. SUTCLIFFE &amp; E. T. K. SANG, Eds., Working Notes
for the CLEF 2008 Workshop, Aarhus, Denmark.
HATCHER E. &amp; GOSPODNETI &#180;C O. (2004). Lucene in Action. Manning.
KATZ B., BORCHARDT G. &amp; FELSHIN S. (2005). Syntactic and semantic decomposition
strategies for question answering from multiple resources. In Actes de AAAI 2005 Workshop
on Inference for Textual Question Answering, Pittsburgh.
KATZ B. &amp; LIN J. (2003). Selectively using relations to improve precision in question answe-
ring. In Actes de Workshop on Natural Language Processing for Question Answering, EACL,
Budapest.
LAURENT D., S&#201;GU&#201;LA P. &amp; N&#200;GRE S. (2005). Cross lingual question answering using
qristal for clef 2005. In Working Notes QA@CLEF, Vienna.
LAURENT D., S&#201;GU&#201;LA P. &amp; N&#200;GRE S. (2006). Cross lingual question answering using
qristal for clef 2006. In Working Notes QA@CLEF, Alicante.
LIGOZAT A. (2007). Apport de l&#8217;analyse syntaxique des phrases dans un syst&#232;me de
questions-r&#233;ponses. Traitement Automatique des Langues, 46.
MORICEAU V., TANNIER X. &amp; GRAU B. (2009). Utilisation de la syntaxe pour valider
les r&#233;ponses &#224; des questions par plusieurs documents. In Actes COnf&#233;rence en Recherche
d&#8217;Information et Applications, CORIA, Presqu&#8217;&#238;le de Giens.
</p>
<p>4http ://www.quaero.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Moriceau, Xavier Tannier
</p>
<p>ROSSET S., GALIBERT O., ADDA G. &amp; BILINSKI E. (2007). The limsi qast systems : compa-
rison between human and automatic rules generation for question-answering on speech trans-
criptions. In ASRU, Kyoto.
VALLIN A., GIAMPICCOLO D., AUNIMO L., AYACHE C., OSENOVA P., PE&#209;AS A.,
DE RIJKE M., SACALEANU B., SANTOS D. &amp; SUTCLIFFE R. (2005). Overview of the
clef 2005 multilingual question answering track. In Working Notes QA@CLEF, Vienna.</p>

</div></div>
</body></html>