<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>CIFLI-SurviTra, deux facettes : d&#233;monstrateur de composants de TA fond&#233;e sur UNL, et phrasebook multilingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>CIFLI-SurviTra, deux facettes : d&#233;monstrateur de composants de 
TA fond&#233;e sur UNL, et phrasebook multilingue 
</p>
<p>Georges FAFIOTTE, Achille FALAISE, J&#233;r&#244;me GOULIAN 
</p>
<p>LIG-GETALP, UJF Grenoble 1     BP 53, 38041 &#8211; GRENOBLE cedex 9 
{georges.fafiotte, achille.falaise, jerome.goulian}@imag.fr 
</p>
<p>R&#233;sum&#233;   CIFLI-SurviTra (&quot;Survival Translation&quot; assistant) est une plate-forme destin&#233;e &#224; 
favoriser l'ing&#233;nierie et la mise au point de composants UNL de TA, &#224; partir d'une m&#233;moire 
de traduction form&#233;e de livres de phrases multilingues avec variables lexicales. SurviTra est 
aussi un phrasebook digital multilingue, assistant linguistique pour voyageurs monolingues 
(fran&#231;ais, hindi, tamoul, anglais) en situation de &quot;survie linguistique&quot;. Le corpus d&#8217;un 
domaine-pilote (&quot;Restaurant&quot;) a &#233;t&#233; structur&#233; et construit : sous-domaines de phrases align&#233;es 
et classes lexicales de locutions quadrilingues, graphes UNL, dictionnaires UW++/fran&#231;ais et 
UW++/hindi par domaines. L&#8217;approche, g&#233;n&#233;rique, est applicable &#224; d&#8217;autres langues. Le 
prototype d&#8217;assistant linguistique (application Web, &#224; interface textuelle) peut &#233;voluer vers 
une application UNL embarqu&#233;e sur SmartPhone, avec Traitement de Parole et multimodalit&#233;. 
</p>
<p>Mots-cl&#233;s :  TA via UNL, d&#233;monstrateur de composants UNL, assistant linguistique sur le 
Web, phrasebook digital multilingue, m&#233;moire de traduction, collecte collaborative de corpus 
</p>
<p>1 CIFLI, objectifs, contexte 
UNL (Universal Networking Language) est un formalisme lexico-s&#233;mantique interlingue, 
exprimant de mani&#232;re non ambigu&#235; tout &#233;nonc&#233; textuel d&#8217;une langue naturelle. Un &#233;nonc&#233; y 
est repr&#233;sent&#233; par un graphe, dont les arcs sont des &quot;relations s&#233;mantiques UNL&quot;, et les n&#339;uds 
sont des &quot;UWs&quot; (Universal Words, acceptions appartenant &#224; une Base de Connaissances UNL 
et &#224; des dictionnaires d&#8217;UWs pour chaque langue), UWs eux-m&#234;mes qualifi&#233;s par des 
&quot;attributs UNL&quot;. Cette approche pivot favorise les m&#233;thodologies collaboratives de 
construction de composants de TA, notamment pour les langues &quot;peu dot&#233;es&quot; (pi-languages).  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1. Graphe UNL d&#8217;un &#233;nonc&#233; du corpus SurviTra (fran&#231;ais-hindi-anglais) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Fafiotte, A. Falaise, J. Goulian 
</p>
<p>Le protoypage de SurviTra s&#8217;inscrit dans un projet franco-indien en ing&#233;nierie de la TA 
fond&#233;e sur UNL, CIFLI (Communication sur Internet en Fran&#231;ais et Langues Indiennes), entre 
LIG-GETALP (pilote), CFILT d&#8217;IIT-Bombay (coordinateur indien), Pondicherry University. 
</p>
<p>2 L&#8217;assistant linguistique SurviTra, phrasebook multilingue 
L&#8217;application-pilote SurviTra est un phrasebook (livre de phrases) digital multilingue, 
assistant de &quot;survie linguistique&quot; pour voyageurs monolingues, fonctionnant &#224; la fois comme 
&quot;m&#233;moire de traduction&quot;, et comme d&#233;monstrateur de composants UNL de TA. Il est fond&#233; 
sur un corpus multilingue structur&#233; (domaines, sous-domaines de phrases, classes lexicales de 
lexies), align&#233; (fran&#231;ais, hindi, tamoul, anglais), avec extension dynamique mod&#233;r&#233;e, en ligne. 
Avec le prototype Survitra-1, pour illustrer la facette &quot;application-h&#244;te&quot; en mode &quot;assistant 
de base&quot; (hors UNL), sont pr&#233;sent&#233;s, dans le cadre d&#8217;une interaction entre un touriste 
(survivor) et un interlocuteur (helper), fran&#231;ais ou indiens : la recherche de phrase dans le 
phrasebook (par configuration de mots-cl&#233;s, par sous-domaine, ou combinaison des deux), le 
traitement de &quot;phrases &#224; trou(s)&quot; (phrases avec variants lexicaux, que l&#8217;utilisateur instancie, 
comme dans un phrasebook), l&#8217;appel de la m&#233;moire de traduction (quadrilingue) pour une 
phrase trouv&#233;e du domaine-pilote cibl&#233; (Restaurant), le traitement d&#8217;une phrase non trouv&#233;e 
(ajout dynamique pour enrichissement ult&#233;rieur de la base de phrases multilingue), et les 
possibilit&#233;s actuelles d&#8217;enrichissement de corpus en mode &quot;bac &#224; sable&quot;, facilitant la gestion 
contributive des ressources lexicales utiles pour la facette &quot;TA via UNL&quot; du projet. 
</p>
<p>     
Figure 2.  Question &quot;&#224; variable lexicale&quot; du survivor fran&#231;ais, traduite en hindi pour le helper 
</p>
<p>3 SurviTra, d&#233;monstrateur de composants UNL 
En mode &quot;d&#233;monstrateur UNL&quot; bilingue (fran&#231;ais-hindi), l&#8217;environnement SurviTra permet 
d&#8217;activer/d&#8217;inhiber les enconversions (Langue&#61664;UNL) et d&#233;conversions (UNL&#61664;Langue) 
disponibles, en plug-in. Il fonctionne en banc d&#8217;essai-test-r&#233;glage de ces composants, tout ce 
qui est produit &#233;tant enregistr&#233; pour analyse et validation. Ce choix fonctionnel r&#233;pond &#224; la 
complexit&#233; de r&#233;alisation et de mise au point des d&#233;conversions et des enconversions : dans la 
r&#233;alit&#233; des r&#233;alisations de TA via UNL, celles-ci ne sont pas disponibles en m&#234;me temps ni 
avec une m&#234;me couverture syntaxique pour chaque langue. La plate-forme fonctionne soit 
avec la m&#233;moire de traduction (utilisant la base de phrases multilingue, dot&#233;e de graphes UNL </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CIFLI-SurviTra, d&#233;monstrateur de composants de TA fond&#233;e sur UNL, phasebook multilingue 
</p>
<p>produits manuellement), soit par traitement effectif UNL, selon les composants disponibles. 
SurviTra-1 privil&#233;gie l&#8217;approche support Web monoposte. Il est op&#233;rationnel en m&#233;moire de 
traduction sur un premier domaine cibl&#233;, et en cours de finalisation pour le plug-in des 
composants UNL disponibles (avec une couverture variable en fran&#231;ais et hindi). Le 
d&#233;veloppement incr&#233;mentiel permet de pr&#233;senter ici, pour des phrases du domaine-pilote 
&quot;Restaurant, en Inde et en France&quot;, les composants d&#8217;enconversion Fran&#231;ais&#61664;UNL, 
d&#233;conversion UNL&#61664;Hindi, d&#233;conversion UNL&#61664;Fran&#231;ais (r&#233;tro-traduction de validation). 
</p>
<p>4 Bilan, &#233;volution 
Work in progress : Le corpus SurviTra comporte &#224; ce jour 25 sous-domaines et 40 classes 
lexicales, 200 phrases et 400 lexies, en fran&#231;ais, hindi, tamoul et anglais. L&#8217;extension est en 
cours, en couverture du premier domaine-pilote et en construction d&#8217;autres domaines. 
L&#8217;unification des dictionnaires (UW-fran&#231;ais 45 000 entr&#233;es, UW-hindi 116 000 entr&#233;es fond&#233; 
sur WordNet indien), au standard UW++, donne lieu &#224; une recherche sp&#233;cifique au CFILT 
(IIT-Bombay). Le dictionnaire UW++ de r&#233;f&#233;rence, bas&#233; sur WordNet 2.1 (200 000 entr&#233;es 
hors-langue), est d&#233;velopp&#233; par les UNL Language Centers espagnol et russe. Une approche 
pragmatique s&#8217;attache parall&#232;lement (lors de la cr&#233;ation manuelle des graphes UNL de la base 
de phrases SurviTra) &#224; produire semi-automatiquement des sous-dictionnaires bilingues &quot;par 
domaines cibl&#233;s&quot; UW++/fran&#231;ais/hindi. Le travail sur le corpus tamoul a commenc&#233;. Pour la 
TA via UNL, la d&#233;conversion du fran&#231;ais est disponible &#224; 75% de couverture syntaxique, 
l&#8217;enconversion &#224; 20%. La d&#233;conversion de l&#8217;hindi progresse au CFILT. SurviTra-1 peut 
accueillir des logiciels de TA substitutive hors UNL (pour les langues o&#249; ils sont disponibles), 
en alternative aux modules UNL et pour favoriser les situations d&#8217;extension de corpus. 
</p>
<p>Evolution : L&#8217;approche g&#233;n&#233;rique SurviTra (structuration de corpus sp&#233;cifi&#233;e, extensibilit&#233; 
multilingue, modularit&#233;) est tout &#224; fait applicable &#224; d&#8217;autres langues, d&#8217;abord en m&#233;moire de 
traduction, puis pour autant que soit r&#233;alis&#233; l&#8217;important travail d&#8217;enconversion-d&#233;conversion 
et sur les dictionnaires UNL. Un projet reprend la logique de SurviTra-1, en la ciblant (en plus 
du support Web) sur une application UNL embarqu&#233;e pour SmartPhone ou PDA, avec multi-
modalit&#233;, parole multi-accents, Traitement de Parole, &#233;cran tactile, photos illustrant des lexies. 
</p>
<p>Remerciements   Recherche financ&#233;e par ARCUS (R&#233;gion Rh&#244;ne-Alpes, Minist&#232;re des 
Affaires Etrang&#232;res fran&#231;ais). Merci &#224; tous les contributeurs (Grenoble, Bombay, Pondich&#233;ry). 
</p>
<p>R&#233;f&#233;rences 
BEKIOS J., BOGUSLAVSKY I., CARDE&#209;OSA J., GALLARDO C. (2007). Automatic Construction 
of an Interlingual Dictionary for Multilingual Lexicography. Proceedings, International Conf. 
on Machine Learning: Models, Technologies &amp; Applications (MLMTA'07), 215-220. 
</p>
<p>BOITET C., BHATTACHARYYA P., BLANC E., MEENA S., BOUDHH S., FAFIOTTE G., FALAISE 
A., VACHANI V. (2007). Building Hindi-French-English-UNL resources for SurviTra-CIFLI, 
linguistic survival system under construction. SNLP &#8217;07, Tha&#239;lande. 
</p>
<p>SINGH S., DALAL M., VACHANI V., BHATTACHARYYA P., DAMANI O. (2007). Hindi 
Generation from Interlingua. Actes de Machine Translation Summit. Copenhague, 421-428. </p>

</div></div>
</body></html>