<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une exp&#233;rience de fusion pour l&#8217;annotation d'entit&#233;s nomm&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>Une exp&#233;rience de fusion pour l&#8217;annotation d'entit&#233;s nomm&#233;es 
</p>
<p>Caroline Brun(5), Nicolas Dessaigne(1), Maud Ehrmann(5), Baptiste 
Gaillard(4), Sylvie Guillemin-Lanne(3), Guillaume Jacquet(5), Aaron 
</p>
<p>Kaplan(5), Marianna Kucharski(3), Claude Martineau(2), Aur&#233;lie Migeotte(1), 
Takuya Nakamura(2), Stavroula Voyatzi(2) 
</p>
<p>(1) Arisem &#8211; 1-5 rue Carnot- 91883 Massy cedex  
{Nicolas.Dessaigne, Aurelie.Migeotte}@arisem.com 
</p>
<p>(2) IGM-LabInfo Universit&#233; Paris-Est &#8211; 77454 Marne-la-Vall&#233;e Cedex 2 
{claude.martineau, takuya.nakamura, stavroula.voyatzi}@univ-mlv.fr 
</p>
<p>(3) Temis &#8211;Tour Gamma B -193-197 rue de Bercy, 75582 Paris Cedex 
{sylvie.guillemin-lanne, marianna.kucharski}@temis.com 
</p>
<p>(4) Thales Communication &#8211; 1-5 Avenue Carnot, 91883 Massy 
Baptiste.gaillard@fr.thalesgroup.com 
</p>
<p>(5) XRCE &#8211; 6 chemin de Maupertuis, 38240 Meylan 
{Caroline.Brun, Maud.Ehrmann, Guillaume.Jacquet, Aaron.Kaplan}@xrce.xerox.com 
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons une exp&#233;rience de fusion d&#8217;annotations d&#8217;entit&#233;s nomm&#233;es provenant de 
diff&#233;rents annotateurs. Ce travail a &#233;t&#233; r&#233;alis&#233; dans le cadre du projet Infom@gic, projet visant &#224; 
l&#8217;int&#233;gration et &#224; la validation d&#8217;applications op&#233;rationnelles autour de l&#8217;ing&#233;nierie des connaissances 
et de l&#8217;analyse de l&#8217;information, et soutenu par le p&#244;le de comp&#233;titivit&#233; Cap Digital &#171; Image, 
MultiM&#233;dia et Vie Num&#233;rique &#187;. Nous d&#233;crivons tout d&#8217;abord les quatre annotateurs d&#8217;entit&#233;s 
nomm&#233;es &#224; l&#8217;origine de cette exp&#233;rience. Chacun d&#8217;entre eux fournit des annotations d&#8217;entit&#233;s 
conformes &#224; une norme d&#233;velopp&#233;e dans le cadre du projet Infom@gic. L&#8217;algorithme de fusion des 
annotations est ensuite pr&#233;sent&#233; ; il permet de g&#233;rer la compatibilit&#233; entre annotations et de mettre en 
&#233;vidence les conflits, et ainsi de fournir des informations plus fiables. Nous concluons en pr&#233;sentant et 
interpr&#233;tant les r&#233;sultats de la fusion, obtenus sur un corpus de r&#233;f&#233;rence annot&#233; manuellement. 
</p>
<p>Abstract In this paper, we present an experiment aimed at merging named entity annotations 
provided by different annotators. This work has been performed as part of the Infom@gic project, 
whose goal is the integration and validation of knowledge engineering and information analysis 
applications, and which is supported by the pole of competitiveness Cap Digital &#171; Image, MultiM&#233;dia 
et Vie Num&#233;rique &#187;. We first describe the four annotators, which provide named entity annotations 
that conform to guidelines defined in the Infom@gic project. Then we present an algorithm for 
merging the different annotations. It uses information about the compatibility of various annotations 
and can point out conflicts, and thus yields annotations that are more reliable than those of any single 
annotator. We conclude by describing and interpreting the merging results obtained on a manually 
annotated reference corpus.  
</p>
<p>Mots-cl&#233;s :   Entit&#233;s nomm&#233;es, fusion d&#8217;annotations, UIMA 
Keywords:   Named entities, fusion of annotations, UIMA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Brun et al. 
 
</p>
<p>                                                
</p>
<p>1 Introduction : le projet Infom@gic 
Infom@gic est un projet de Recherche et D&#233;veloppement dans le domaine de l'Analyse de 
l'Information, cofinanc&#233; par des entreprises, des universit&#233;s et des laboratoires d'Ile-de-
France, ainsi que par la D&#233;l&#233;gation G&#233;n&#233;rale des Entreprises, dans le cadre du P&#244;le de 
Comp&#233;titivit&#233; CAP DIGITAL1. Port&#233; par Thales Communication, il regroupe un consortium 
de 29 partenaires. Son objectif, sur trois ans, est d&#8217;identifier et de d&#233;velopper les technologies 
cl&#233;s dans le domaine de l&#8217;analyse de l&#8217;information et de l&#8217;extraction de connaissances, afin de 
fournir des outils permettant de naviguer ais&#233;ment dans de gros volumes de donn&#233;es 
multim&#233;dia. Etant donn&#233;e l&#8217;approche multimodale du projet, l&#8217;ensemble des composants 
d&#8217;annotation, d&#8217;extraction, d&#8217;analyse, de transcription et de recherche a pour vocation d&#8217;&#234;tre 
coupl&#233; dans des cha&#238;nes de traitement de l&#8217;information. Ces cha&#238;nes sont f&#233;d&#233;r&#233;es au sein 
d&#8217;outils standardis&#233;s et sp&#233;cialis&#233;s constituant une plate-forme logicielle d&#8217;int&#233;gration de 
traitement de l&#8217;information. L&#8217;interop&#233;rabilit&#233; est assur&#233;e au moyen d&#8217;une plateforme 
commune UIMA (cf. section 3). 
</p>
<p>Parmi les diff&#233;rents cas d&#8217;usage du projet INFOM@GIC, le cas d&#8217;usage Annotation et fusion 
des entit&#233;s nomm&#233;es entre dans le sous projet d&#8217;extraction d&#8217;information dans les documents. 
Il r&#233;unit Arisem, IGM, TEMIS et XRCE qui ont mis en commun leurs annotateurs 
d&#8217;extraction d&#8217;entit&#233;s nomm&#233;es, leur exp&#233;rience et leur savoir-faire. Les annotateurs 
identifient dans les documents issus du web des entit&#233;s nomm&#233;es et transf&#232;rent ces 
annotations aux composants auxquels la plateforme est connect&#233;e. Suite au succ&#232;s de cette 
&#233;tape, il s&#8217;est av&#233;r&#233; utile de b&#226;tir un outil de fusion des annotations d&#8217;entit&#233;s nomm&#233;es afin, 
d&#8217;une part, de g&#233;rer les doublons d&#8217;annotations issues des diff&#233;rents annotateurs et, d&#8217;autre 
part, de r&#233;gler certains &#171; conflits &#187; d&#8217;annotations.  
</p>
<p>Cet article rend compte de notre exp&#233;rience de fusion d&#8217;annotation d&#8217;entit&#233;s nomm&#233;es (EN 
dans la suite du document). Nous revenons tout d&#8217;abord sur les travaux existants pour la 
fusion d&#8217;annotation (section 2) puis d&#233;crivons rapidement la plateforme UIMA (section 3) 
ainsi que les diff&#233;rents annotateurs impliqu&#233;s (section 4). Nous pr&#233;cisons ensuite la m&#233;thode 
de fusion adopt&#233;e (section 5) et pr&#233;sentons, enfin, les r&#233;sultats obtenus lors de l&#8217;&#233;valuation de 
ce retour d&#8217;exp&#233;rience (section 6). 
</p>
<p>2 La fusion d&#8217;annotations : &#233;tat de l&#8217;art 
En apprentissage automatique, il est d&#233;sormais bien &#233;tabli que la combinaison d'un ensemble 
de m&#233;thodes ou de syst&#232;mes d'apprentissage permet souvent d'obtenir de meilleurs r&#233;sultats 
qu'avec une m&#233;thode ou un syst&#232;me pris isol&#233;ment. L&#8217;un des algorithmes tr&#232;s prometteurs qui 
fait actuellement l'objet de travaux de recherche importants est l'algorithme Adaboost 
(Schwenk, 1999) qui consiste &#224; entra&#238;ner une cascade de syst&#232;mes similaires, chacun &#233;tant 
charg&#233; de traiter les erreurs laiss&#233;es par les syst&#232;mes pr&#233;c&#233;dents. 
</p>
<p>Ce principe trouve ses origines dans les exp&#233;riences ROVER (Recognizer Output Voting 
Error Recognition) (Fiscus, 1997) qui ont &#233;t&#233; effectu&#233;es pendant les campagnes d'&#233;valuation 
am&#233;ricaines pour la reconnaissance automatique de la parole. Il consiste &#224; combiner les 
donn&#233;es produites par les syst&#232;mes &#224; l'aide d'une simple strat&#233;gie de vote pour diminuer le 
</p>
<p> 
1 Ce travail a &#233;t&#233; labellis&#233; par le p&#244;le de comp&#233;titivit&#233; CAP DIGITAL et financ&#233; en partie par la DGE et la Mairie 
</p>
<p>de Paris. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une exp&#233;rience de fusion pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>nombre d'erreurs. Plus pr&#233;cis&#233;ment, les votes s'appuient sur les fr&#233;quences maximales 
d'occurrence et une valeur seuil du score de confiance (les sorties des syst&#232;mes de 
transcription avaient &#233;t&#233; annot&#233;es avec un score de confiance (Chase, 1997)). 
</p>
<p>Pour ce qui est de l'annotation morpho-syntaxique, le principe de la combinaison de syst&#232;mes 
a &#233;t&#233; utilis&#233; dans le pass&#233; par (Padro et Marquez, 1998) qui ont combin&#233; deux syst&#232;mes 
d'annotation pour marquer un corpus et par (Tufis, 1999) qui a propos&#233; d'utiliser plusieurs 
versions d'un m&#234;me syst&#232;me, chacune entra&#238;n&#233;e sur des donn&#233;es de type diff&#233;rent. Cette 
approche a d&#233;j&#224; connu de nombreux succ&#232;s en d&#233;sambigu&#239;sation du sens des mots (Pedersen, 
2000), et en analyse syntaxique (Henderson et Brill, 1999, Monceaux et Robba, 2003). Par 
ailleurs, le projet &#171; Passage &#187; (Paroubek et al., &#224; para&#238;tre) vise &#224; utiliser plusieurs cha&#238;nes de 
traitement pour produire des annotations syntaxiques sur un corpus fran&#231;ais d'au moins cent 
millions de mots, pour combiner ces annotations &#224; l'aide de techniques de vote par majorit&#233; et 
pour utiliser ces annotations combin&#233;es pour des t&#226;ches d'acquisition de connaissances 
lexicales. 
</p>
<p>Enfin, pour ce qui est de la reconnaissance des EN, la m&#233;thode de vote par majorit&#233; a &#233;t&#233; 
utilis&#233;e pour l&#8217;anglais par (Borthwick et al. 1998) et, plus r&#233;cemment, par (Kozareva et al., 
2007) qui ont combin&#233; trois syst&#232;mes s&#8217;appuyant sur diff&#233;rentes m&#233;thodes d&#8217;apprentissage 
automatique pour annoter un corpus espagnol. Le syst&#232;me composite r&#233;sultant a eu de 
meilleures performances (en pr&#233;cision) que n'importe lequel de ses modules &#233;l&#233;mentaires.  
</p>
<p>Notre exp&#233;rimentation se situe dans le m&#234;me esprit que les deux derniers travaux. Une des 
singularit&#233;s de notre approche est d&#8217;avoir mis en place une plateforme commune &#224; tous les 
partenaires o&#249; les quatre annotateurs ainsi que le module de fusion sont int&#233;gr&#233;s. Cette 
plateforme a &#233;t&#233; d&#233;velopp&#233;e en vue d&#8217;une exploitation par d&#8217;autres outils d&#8217;extraction ou de 
recherche d&#8217;information. La cha&#238;ne de traitement impl&#233;ment&#233;e traite du corpus web (avec tous 
les probl&#232;mes que cela peut poser). Enfin, nous rendons compte dans notre algorithme de 
fusion de cas d&#8217;inclusion ou de chevauchement d&#8217;annotations, qui constitue un apport 
nouveau vis-&#224;-vis des pr&#233;c&#233;dents travaux. 
</p>
<p>3 La plateforme UIMA 
UIMA (Unstructured Information Management Architecture) est une plateforme pour la 
gestion, l&#8217;organisation, et la coordination de l'information non-structur&#233;e (Ferrucci, Lally, 
2004). Son d&#233;veloppement a commenc&#233; chez IBM, et continue aujourd'hui en &quot;open source&quot; 
sous l&#8217;autorit&#233; de la fondation Apache (http://incubator.apache.org/uima/). Cette plateforme a 
&#233;t&#233; pr&#233;cis&#233;ment d&#233;velopp&#233;e pour la gestion d'outils de TAL ; l'exemple donn&#233; par Ferrucci et 
Lally est notamment de faciliter une int&#233;gration rapide d'un analyseur syntaxique avec un 
syst&#232;me de reconnaissance d'entit&#233;s nomm&#233;es. L'objectif d&#233;clar&#233; de cette plateforme est 
d'acc&#233;l&#233;rer les progr&#232;s scientifiques en permettant une combinaison rapide de technologies de 
traitement d'information non-structur&#233;e, dites UIM (Unstructured Information Management). 
UIMA a &#233;t&#233; choisi dans le cadre du projet Infom@gic pour faciliter l'interaction entre les 
technologies d&#233;velopp&#233;es par les diff&#233;rents partenaires du projet. Chaque partenaire d&#233;crit 
dans la section suivante son annotateur qu&#8217;il a adapt&#233; au format UIMA afin d&#8217;interagir au sein 
de la m&#234;me cha&#238;ne de traitement et d'y int&#233;grer un nouveau module de fusion.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Brun et al. 
 
</p>
<p>4 Les diff&#233;rents annotateurs d&#8217;EN 
Dans cette section, les annotateurs d&#8217;entit&#233;s nomm&#233;es des diff&#233;rents partenaires sont pr&#233;sent&#233;s 
avec leurs sp&#233;cificit&#233;s. Ces syst&#232;mes ont &#233;t&#233; mis &#224; jour selon les directives d&#8217;annotation mises 
au point dans le cadre du projet Infom@gic (c.f. livrable Infom@gic D2.11-5) 
</p>
<p>4.1 L&#8217;Annotateur d&#8217;Arisem 
</p>
<p>Arisem utilise une m&#233;thode symbolique pour la d&#233;tection des entit&#233;s nomm&#233;es et de leurs 
relations. Des grammaires locales d&#233;crivent des r&#232;gles lexico-syntactico-s&#233;mantiques faisant 
r&#233;f&#233;rence &#224; des informations issues de dictionnaires et d'ontologies. Ces ressources sont 
exploit&#233;es par le moteur d'analyse HST (High Speed Transducer) qui les compile en 
automates afin d'optimiser le processus d'analyse s&#233;mantique. 
</p>
<p>L'annotateur Arisem se distingue par sa capacit&#233; &#224; prendre en compte des connaissances 
m&#233;tiers disponibles sous forme d'ontologies. Il est &#233;galement capable d'utiliser ces 
connaissances pour r&#233;soudre des cas d'ambigu&#239;t&#233;s s&#233;mantiques sur les entit&#233;s nomm&#233;es. Dans 
le cadre du projet, une normalisation des expressions num&#233;riques a &#233;galement &#233;t&#233; d&#233;velopp&#233;e 
(ex. : &quot;trois mille dollars&quot; =&gt; num:3.0e+3USD). L'annotateur Arisem supporte &#224; ce jour le 
fran&#231;ais, l'anglais, l'italien, l'espagnol, le portugais et l'allemand. 
</p>
<p>4.2 L&#8217;Annotateur de l&#8217;IGM 
</p>
<p>L&#8217;annotateur de l&#8217;IGM utilise l&#8217;environnement de d&#233;veloppement Open Source multilingue et 
multiplateforme Unitex (Paumier 2003). Il utilise une m&#233;thode symbolique et dispose de deux 
types de ressources. D&#8217;une part des dictionnaires &#233;lectroniques au format DELA (Courtois 
1990) g&#233;n&#233;raux et sp&#233;cialis&#233;s, notamment toponymiques (Maurel et al. 1996) et, d&#8217;autre part 
de grammaires locales faisant appel &#224; ces dictionnaires. Toutes ces grammaires utilisent le 
formalisme RTN (Recursif Transition Network) qui permet de cr&#233;er ais&#233;ment des sous-
grammaires d&#233;di&#233;es au traitement de chaque type d&#8217;Entit&#233;s Nomm&#233;es recherch&#233;es. 
</p>
<p>L&#8217;annotateur IGM permet de reconna&#238;tre et identifier les EN dans les textes, extraire certains 
attributs d&#8217;EN (ex. : la fonction ou l&#8217;ethnonyme associ&#233;s &#224; une EN de type &#171; Person &#187;) afin de 
les reformuler ou les normaliser. La t&#226;che de normalisation touche plus particuli&#232;rement les 
EN mettant en jeu des donn&#233;es num&#233;riques. Une date ou une monnaie pouvant s&#8217;exprimer 
diversement, il est souvent utile d&#8217;en garder une repr&#233;sentation unique : sa forme normalis&#233;e. 
Ainsi, les EN 12 f&#233;vrier 2009 et 35 &#8364; ont pour formes normalis&#233;es respectives 2009-02-12 
(norme ISO8601) et 35 EUR (norme ISO4217). Ces normes facilitent la comparaison, le tri et 
les requ&#234;tes sur des donn&#233;es num&#233;riques. 
</p>
<p>4.3 L&#8217;annotateur de Temis Insight Discoverer&#8482; Extractor 
</p>
<p>Contraction de Text Mining Solutions, TEMIS con&#231;oit des applications d&#233;di&#233;es &#224; l&#8217;analyse et 
&#224; la fouille de donn&#233;es textuelles. TEMIS dispose d&#8217;un serveur d&#8217;extraction d&#8217;information 
Insight Discoverer&#8482; Extractor coupl&#233; &#224; des Skill Cartridge&#8482; L&#8217;ensemble fournit des 
applications d&#233;di&#233;es &#224; la veille strat&#233;gique et concurrentielle, &#224; la gestion de la relation clients, 
de la connaissance, des savoir-faire et des ressources humaines.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une exp&#233;rience de fusion pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>L&#8217;information &#224; extraire est mod&#233;lis&#233;e et organis&#233;e selon une hi&#233;rarchie de composants de 
connaissance modulaires int&#233;grables &#224; diff&#233;rents domaines d'activit&#233; et/ou langues, appel&#233;e 
Skill Cartridge&#61668;. Un composant de connaissance peut avoir la forme d&#8217;un ou de plusieurs 
dictionnaire(s) ou d&#8217;un ensemble de r&#232;gles d&#8217;extraction. L&#8217;objectif est de construire des 
patrons d&#8217;extraction (Yangarber et Grishman, 1997) suivant une approche guid&#233;e par le but 
(Appelt, 1993) (Poibeau, 2002). Le module d&#8217;extraction utilise la technologie des 
transducteurs (Hobbs 1997). Les Skill Cartridge&#8482; d&#233;velopp&#233;es au sein de TEMIS sont 
th&#233;matiques (intelligence &#233;conomique, reconnaissance d&#8217;entit&#233;s nomm&#233;es), ou sp&#233;cialis&#233;es 
par domaine d&#8217;activit&#233; (industrie pharmaceutique) (Aubry et al, 2002), l&#8217;information extraite 
peut servir d&#8217;entr&#233;e &#224; des applications sp&#233;cifiques m&#233;tier (Guillemin-Lanne et Six, 2006). 
</p>
<p>4.4 L&#8217;annotateur de XRCE 
</p>
<p>XIP (Ait-Mokthar et al. 2002) est un analyseur d&#233;velopp&#233; au centre de recherche XRCE, dont 
l'objectif est d'extraire des d&#233;pendances syntaxiques profondes de fa&#231;on robuste. Le 
formalisme propos&#233; par XIP permet d'exprimer un large &#233;ventail de r&#232;gles, de la 
d&#233;sambigu&#239;sation cat&#233;gorielle &#224; la construction de d&#233;pendances (Sujet, Objet, modifieurs, 
attributs etc.), en passant par la constitution de syntagmes noyaux.  
</p>
<p>Un syst&#232;me de d&#233;tection des EN a &#233;t&#233; d&#233;velopp&#233; au sein de l&#8217;analyseur XIP. Il permet de 
d&#233;tecter les types &#171; standards &#187; d&#8217;entit&#233;s nomm&#233;es (dates, lieux, personnes, organisations, 
monnaies &#8230;). Il s&#8217;agit d&#8217;un syst&#232;me symbolique, consistant en un ensemble de r&#232;gles locales 
qui utilisent de l&#8217;information lexicale combin&#233;e &#224; de l&#8217;information contextuelle sur les 
cat&#233;gories syntaxiques. Ces r&#232;gles locales sont tr&#232;s similaires &#224; des r&#232;gles d&#8217;identification de 
syntagmes noyaux, mais op&#233;rant au niveau du nom. Ce syst&#232;me de d&#233;tection des entit&#233;s 
nomm&#233;es est int&#233;gr&#233; aux diff&#233;rentes grammaires syntaxiques. R&#233;cemment, les travaux 
conduits au sein du XRCE se sont orient&#233;s vers des m&#233;thodes de d&#233;sambigu&#239;sation des EN et 
de r&#233;solution de m&#233;tonymie des EN (Brun, Ehrmann et Jacquet 2007).  
</p>
<p>5 La fusion d&#8217;annotations 
L&#8217;objectif de cette fusion est de coordonner l&#8217;ensemble des annotations provenant des 
diff&#233;rents partenaires afin d&#8217;obtenir un annotateur unique b&#233;n&#233;ficiant des qualit&#233;s sp&#233;cifiques 
&#224; chaque annotateur. De nombreuses difficult&#233;s sont &#224; surmonter. La premi&#232;re, &#233;voqu&#233;e en 
introduction de la section 4, consiste &#224; harmoniser les annotations : l&#8217;ensemble des partenaires 
doit se mettre d&#8217;accord sur un sch&#233;ma d&#8217;annotation commun. Cette &#233;tape a fait l&#8217;objet d&#8217;un 
livrable (c.f. livrable Infom@gic D2.11-5). Toutefois l&#8217;annotation manuelle de notre corpus 
d&#8217;&#233;valuation nous a confirm&#233;, si besoin &#233;tait, la difficult&#233; de cette harmonisation. La 
deuxi&#232;me difficult&#233; consiste &#224; &#233;viter les doublons dans l&#8217;annotation fusionn&#233;e. D&#8217;apparence 
triviale, les cas de doublons correspondent tout de m&#234;me &#224; six cas diff&#233;rents r&#233;pertori&#233;s dans 
l&#8217;algorithme ci-dessous (1.a, 1.b, 2.a, 2.b, 3.a, 3.b). Enfin, la r&#233;solution de conflits constitue 
une autre difficult&#233; (cf. section 5.2). 
</p>
<p>5.1 Algorithme 
</p>
<p>L&#8217;algorithme de fusion a &#233;t&#233; mis au point par les diff&#233;rents partenaires, suite &#224; une &#233;tude 
tenant compte des diff&#233;rents cas de figures concernant les annotations, &#224; savoir :  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Brun et al. 
 
</p>
<p>                                                
</p>
<p>1. EN ayant le m&#234;me offset de d&#233;but et de fin (A = B) : 
a. M&#234;me type pour tous les annotateurs &#61664; Fusion directe. 
b. EN de types diff&#233;rents mais dans la m&#234;me hi&#233;rarchie sans conflit de sous type &#61664; 
</p>
<p>Le type le plus fin est s&#233;lectionn&#233;. 
c. EN de types diff&#233;rents mais dans la m&#234;me hi&#233;rarchie avec conflit de sous type &#61664; 
</p>
<p>Le type commun de plus haut niveau est s&#233;lectionn&#233;. 
d. Types diff&#233;rents mais pas dans la m&#234;me hi&#233;rarchie &#61664; Supprimer les deux entit&#233;s.  
</p>
<p>2. Inclusion de l&#8217;EN A dans l&#8217;EN B (A= Giscard, B=Giscard D&#8217;Estaing ou A= D&#8217;Estaing, 
B=Giscard D&#8217;Estaing ou A= Giscard, B=Valery Giscard D&#8217;Estaing) 
</p>
<p>a. M&#234;me type pour tous les annotateurs &#61664; Seule l&#8217;entit&#233; B est conserv&#233;e. 
b. Types diff&#233;rents mais dans m&#234;me hi&#233;rarchie &#61664; Seule l&#8217;EN B est conserv&#233;e avec 
</p>
<p>son type 
c. Types diff&#233;rents mais pas dans m&#234;me hi&#233;rarchie&#61664; Les EN A et B sont conserv&#233;es. 
</p>
<p>3. Chevauchement de AB et BC (AB= Valery Giscard, BC=Giscard D&#8217;Estaing) 
a. M&#234;me type pour tous les annotateurs&#61664; Fusion de ABC. 
b. Types diff&#233;rents mais dans m&#234;me hi&#233;rarchie &#61664; Fusion de ABC avec le type de 
</p>
<p>plus haut niveau. 
c. Types diff&#233;rents mais pas dans m&#234;me hi&#233;rarchie&#61664; Les EN AB et BC sont 
</p>
<p>conserv&#233;es. 
 
</p>
<p>Dans les r&#233;sultats ci-dessous, nous souhaitons privil&#233;gier une fusion qui am&#233;liore la pr&#233;cision 
plut&#244;t que le rappel, c&#8217;est pourquoi nous avons choisi de ne garder que les annotations 
provenant d&#8217;au moins deux annotateurs diff&#233;rents. Cependant, les r&#233;sultats de la fusion ne 
sont pas, de facto, &#233;gaux ou meilleurs que le meilleur annotateur. Par exemple, dans la phrase 
&#171; Cette ville que, d&#8217;apr&#232;s Cartier, les Iroquois nomment Canada. &#187;, si deux annotateurs 
annotent Cartier en tant qu&#8217;&lt;Organisation&gt; et qu&#8217;un seul annotateur fourni l&#8217;annotation 
&lt;Personne&gt;, alors la fusion donnera l&#8217;annotation &lt;Organisation&gt;. 
</p>
<p>5.2 Exemples et discussion 
</p>
<p>Nous proposons d&#8217;illustrer quelques cas de conflits. Consid&#233;rons le cas 1.b : A et B ont les 
m&#234;mes offsets, et A &#61683; &lt;Location&gt;Lyon&lt;/Location&gt;2, B &#61683; &lt;City&gt;Lyon&lt;/City&gt;. Dans ce 
cas, nous choisissons l&#8217;annotation la plus fine &lt;City&gt;Lyon&lt;/City&gt;. En revanche dans le cas 
1.c, A et B ont les m&#234;mes offsets et les annotations sont A &#61683; &lt;Country&gt;Andorre&lt;/Country&gt; 
et B &#61683; &lt;City&gt;Andorre&lt;/City&gt;. Dans ce cas, les deux annotations sont conflictuelles, mais 
elles ont un parent en commun (diff&#233;rent de &lt;NamedEntity&gt;) : &lt;Location&gt;. C&#8217;est cette 
derni&#232;re annotation qui sera conserv&#233;e. 
</p>
<p>Dans le cas 1.d, les annotations de A et B (dans les faits un ensemble d&#8217;annotations) sont 
conflictuelles et plusieurs choix s&#8217;offrent &#224; nous : conserver les deux annotations en gardant 
l&#8217;information qu&#8217;il y a un cas de conflit entre annotateurs, supprimer les deux annotations en 
consid&#233;rant que l&#8217;une des deux est n&#233;cessairement fausse et qu&#8217;il n&#8217;est pas possible de savoir 
laquelle. Nous avons choisi une troisi&#232;me strat&#233;gie qui est le vote majoritaire : si plus de la 
moiti&#233; des annotateurs s&#8217;exprimant proposent la m&#234;me annotation, celle-ci est gard&#233;e, sinon 
nous supprimons les deux annotations A et B (toutes les annotations conflictuelles). Ce choix 
va aussi dans le sens de privil&#233;gier la pr&#233;cision au d&#233;triment du rappel. 
</p>
<p> 
2 La liste compl&#232;te des types d&#8217;annotation utilis&#233;s se trouve dans le Tableau 1. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une exp&#233;rience de fusion pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>Le cas 2.c. peut-&#234;tre illustr&#233; par l&#8217;expression &#171; Association couleurs de Chine &#187;. Dans ce cas, 
il est possible d&#8217;avoir l&#8217;annotation &lt;Organisation&gt; pour &#171; Association couleurs de Chine &#187; et 
l&#8217;annotation &lt;Country&gt; pour &#171; Chine &#187;. Dans un cadre applicatif, il nous semble int&#233;ressant 
de conserver les deux annotations. En revanche, dans le cadre de notre &#233;valuation, nous 
n&#8217;avons pas annot&#233; les entit&#233;s incluses dans une autre entit&#233; (seule &lt;Organisation&gt; a &#233;t&#233; 
retenue). 
</p>
<p>6 Evaluation 
Afin d&#8217;&#233;valuer les performances de l&#8217;annotateur de fusion, les partenaires ont constitu&#233; un 
corpus de r&#233;f&#233;rence annot&#233; manuellement selon les crit&#232;res d&#8217;annotation d&#233;finis dans le cadre 
d&#8217;Infom@gic. Dans la mesure o&#249; l&#8217;objectif est de pouvoir int&#233;grer les annotateurs &#224; un moteur 
de recherche s&#233;mantique (cf. livrable Infom@gic D1-11.22), ce corpus est constitu&#233; de 
donn&#233;es issues du web. Le sch&#233;ma d&#8217;annotation se conforme &#224; une hi&#233;rarchie de types 
constitu&#233;e par les partenaires, laquelle correspond &#224; une synth&#232;se de l&#8217;expression des besoins 
applicatifs des diff&#233;rents partenaires ainsi que ceux du projet Infom@gic. Le Tableau 1 en est 
une simplification : 
</p>
<p>Annotations g&#233;n&#233;rales Annotations fines correspondantes 
ContactInformation Address ; Email ; TelFax ; URL 
Event MilitaryEvent ; SportEvent ; CulturalEvent 
Location Continent ; Country ; Region ; City ; Microtoponym ; Hydronym ; Building 
NumericalExpression Area ; Length ; Money ; Percent ; Temperature 
Organisation Company ; SportOrganisation ; PoliticalOrganisation 
Person   
TemporalExpression Date ; Interval ; Time 
Work Product. Sous-type de Product : Vehicle 
</p>
<p>Tableau 1: synth&#232;se de la hi&#233;rarchie de types 
Le corpus de r&#233;f&#233;rence contient 3548 entit&#233;s ; il est constitu&#233; de 4 fichiers, deux articles de 
Wikip&#233;dia (corpus &#171; endurance &#187; et &#171; canada &#187; ci-dessous) et deux pages de sites touristiques 
(corpus &#171; lyon-evian &#187; et &#171; sete &#187;).  
</p>
<p>Afin de bien interpr&#233;ter les r&#233;sultats de l&#8217;&#233;valuation, il importe de souligner deux points. Le 
premier est relatif &#224; la nature des corpus : issus du web, ces derniers sont au format XHTML 
et ne sont par cons&#233;quent pas aussi &#171; propres &#187; que les corpus sur lesquels les annotateurs 
travaillent habituellement. Malgr&#233; un ensemble de pr&#233;traitements (conversion de format, 
validation, correction/suppression de balises) r&#233;alis&#233;s automatiquement en amont au sein de la 
plateforme UIMA, les annotateurs ont &#233;t&#233; confront&#233;s &#224; des difficult&#233;s sp&#233;cifiques li&#233;es au 
format des corpus. Le second point est relatif &#224; l&#8217;annotation manuelle des corpus : r&#233;alis&#233;e par 
les partenaires eux-m&#234;mes, elle n&#8217;est par cons&#233;quent peut-&#234;tre pas totalement &#171; objective &#187;. 
Conscients de ce biais, nous avons cherch&#233; &#224; le contr&#244;ler, en compl&#233;tant l&#8217;&#233;valuation de la 
fusion de l&#8217;ensemble des annotateurs sur l&#8217;ensemble des fichiers par une &#233;valuation o&#249;, pour 
chaque fichier, nous avons exclu de la fusion l&#8217;annotateur provenant du partenaire ayant 
annot&#233; manuellement ce m&#234;me fichier (cf. colonne &#171; fusion test &#187; du Tableau 2). 
</p>
<p>Nous avons calcul&#233;, pour chaque fichier ainsi que globalement, les taux de pr&#233;cision, de 
rappel et la F-mesure. Nous pr&#233;sentons les r&#233;sultats obtenus pour les types sup&#233;rieurs de la 
hi&#233;rarchie (niveau &#171; g&#233;n&#233;ral &#187;, Tableau 2), et ceux obtenus pour les sous-types plus 
sp&#233;cifiques (niveau &#171; fin &#187;, Tableau 3). L&#8217;&#233;valuation peut &#234;tre consid&#233;r&#233;e comme stricte dans 
la mesure o&#249; si un annotateur fournit la bonne annotation mais fait une erreur de fronti&#232;re, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Brun et al. 
 
</p>
<p>l&#8217;annotation est consid&#233;r&#233;e comme fausse. Concernant l&#8217;&#233;valuation sur les annotations 
g&#233;n&#233;rales, si un annotateur fourni une annotation fine, celle-ci est rapport&#233;e &#224; l&#8217;annotation 
g&#233;n&#233;rale dont elle est le sous-type. Pour l&#8217;&#233;valuation sur les annotations fines, les annotations 
g&#233;n&#233;rales ne sont pas &#233;valu&#233;es : elles sont ignor&#233;es dans le corpus de test tout comme dans les 
r&#233;ponses des annotateurs. 
</p>
<p>   Annot. 1 Annot. 2 Annot. 3 Annot. 4 Fusion Fusion test 
P 74.80 73.28 76.79 74.95 81.80 82.42 
R 61.58 41.00 51.61 66.88 65.76 60.29 
</p>
<p>niveau 
d'annotation 
g&#233;n&#233;ral 
</p>
<p>fichier 1 : 
canada 
</p>
<p>F2 67.55 52.58 61.73 70.69 72.91 69.64 
  P 72.52 79.94 66.96 67.83 79.50 78.21 
  R 62.40 54.84 44.38 49.03 68.41 62.60 
  
</p>
<p>fichier 2 : 
endurance 
</p>
<p>F2 67.08 65.06 53.38 56.92 73.54 69.54 
  P 63.36 57.06 74.24 74.89 78.11 79.29 
  R 59.52 42.77 50.95 68.03 62.68 61.81 
  
</p>
<p>fichier 3 : 
sete 
</p>
<p>F2 61.38 48.89 60.43 71.30 69.55 69.47 
  P 69.94 53.73 71.66 81.72 85.07 83.09 
  R 62.91 43.67 46.45 75.91 69.15 59.62 
  
</p>
<p>fichier 4 : 
lyon-evian 
</p>
<p>F2 66.24 48.18 56.36 78.71 76.29 69.42 
  TOTAL P 67.53 61.85 73.24 75.23 80.10 80.23 
   Pour niveau R 60.85 44.36 49.38 66.35 65.11 61.30 
   &#8220;g&#233;n&#233;ral&#8221; F2 64.02 51.67 58.99 70.51 71.83 69.50 
</p>
<p>Tableau 2: r&#233;sultats de la fusion pour le niveau d&#8217;annotation &quot;g&#233;n&#233;ral&quot; 
   Annot. 1 Annot. 2 Annot. 3 Annot. 4 Fusion 
</p>
<p>Continent P 71.79 70.37 93.33 76.47 82.61 
  R 93.33 63.33 46.67 43.33 63.33 
</p>
<p>niveau 
d'annotation 
fin 
</p>
<p>  F2 81.16 66.67 62.22 55.32 71.70 
  City P 68.31 66.36 0.00 82.58 85.13 
    R 40.79 53.81 0.00 80.34 66.09 
    F2 51.08 59.43 0.00 81.44 74.41 
  Microtoponym P 0.00 46.43 0.00 0.00 66.67 
    R 0.00 34.21 0.00 0.00 10.53 
    F2 0.00 39.39 0.00 0.00 18.18 
  Region P 0.00 50.51 0.00 39.29 50.70 
    R 0.00 29.07 0.00 44.77 20.93 
    F2 0.00 36.90 0.00 41.85 29.63 
  Country P 84.96 79.35 77.46 86.12 93.72 
    R 81.36 30.93 80.08 89.41 88.56 
    F2 83.12 44.51 78.75 87.73 91.07 
  Hydronym P 0.00 53.97 0.00 64.06 63.33 
    R 0.00 66.67 0.00 80.39 74.51 
    F2 0.00 59.65 0.00 71.30 68.47 
  Building P 0.00 21.05 0.00 49.25 56.10 
    R 0.00 4.94 0.00 40.74 28.40 
    F2 0.00 8.00 0.00 44.59 37.70 
  P 70.56 60.13 73.94 72.38 78.46 
  R 49.10 43.76 32.25 65.98 61.69 
  
</p>
<p>tous les sous-
types de 
&quot;Location&quot; 
</p>
<p>F2 57.91 50.66 44.91 69.04 69.07 
P 69.14 59.27 73.04 72.87 77.60 
R 53.59 45.05 37.22 64.70 62.82 
</p>
<p>  TOTAL 
Pour niveau 
&#8220;fin&#8221; 
</p>
<p>F2 60.38 51.19 49.31 68.54 69.43 
</p>
<p>Tableau 3: r&#233;sultats de la fusion pour le niveau d&#8217;annotation &quot;fin&quot; 
</p>
<p>Pour &#233;valuer l&#8217;apport de la fusion, nous avons adopt&#233; le principe suivant : l&#8217;annotateur de 
fusion est consid&#233;r&#233; comme meilleur si sa pr&#233;cision est sup&#233;rieure &#224; celle du meilleur 
annotateur et si sa F-mesure n&#8217;est pas inf&#233;rieure &#224; celle du meilleur annotateur. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une exp&#233;rience de fusion pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>Le Tableau 2 nous montre que, pour chaque fichier, la pr&#233;cision de la fusion est toujours 
sup&#233;rieure &#224; celle du meilleur annotateur (ou &#233;quivalente pour le fichier 2) et que la F-mesure 
reste &#224; plus ou moins deux points. La colonne &#171; fusion test &#187; montre les r&#233;sultats obtenus sur 
chaque fichier en excluant de la fusion l&#8217;annotateur du partenaire ayant annot&#233; manuellement 
ce fichier. Nous pouvons constater que les r&#233;sultats restent stables : la fusion reste meilleure 
en pr&#233;cision et en F-mesure que les trois annotateurs restants et les r&#233;sultats d&#8217;ensemble sont 
comparables &#224; ceux de la fusion classique. Cela montre une certaine robustesse des r&#233;sultats 
de cette fusion. Si l&#8217;on examine (cf. Tableau 3) les r&#233;sultats obtenus &#224; un niveau plus fin (ici, 
pour le type &lt;Location&gt; et ses sous-types), nous constatons &#233;galement une meilleure 
performance de l&#8217;annotateur de fusion, avec une hausse de la pr&#233;cision par rapport &#224; celle du 
meilleur annotateur et une F-mesure au moins &#233;quivalente. A ce niveau plus fin, il est 
int&#233;ressant de noter la compl&#233;mentarit&#233; des partenaires : chaque annotateur pr&#233;sente de 
bonnes performances pour certains sous-types et non pour d&#8217;autres, mais la fusion permet 
d&#8217;allier les qualit&#233;s de chaque annotateur et, au final, d&#8217;obtenir de meilleurs r&#233;sultats3. 
</p>
<p>Ainsi, tant pour le niveau d&#8217;annotation &#171; g&#233;n&#233;ral &#187; que &#171; fin &#187;, la fusion permet d&#8217;am&#233;liorer 
les r&#233;sultats, avec une pr&#233;cision nettement sup&#233;rieure &#224; celle du meilleur annotateur (+ 4,87 
pts pour l&#8217;annotation &#171; g&#233;n&#233;rale &#187;, + 4,56 pts pour l&#8217;annotation &#171; fine &#187;), et une F-mesure 
l&#233;g&#232;rement sup&#233;rieure (respectivement + 1,32 points et +0,89 points). 
</p>
<p>7 Conclusion 
L&#8217;objectif de nos travaux consistait &#224; r&#233;unir nos annotateurs afin d'am&#233;liorer et d'enrichir 
l'annotation des entit&#233;s nomm&#233;es. L'utilisation d'une architecture UIMA nous a permis 
d'assurer l'interop&#233;rabilit&#233; entre les diff&#233;rents syst&#232;mes ; la r&#233;alisation d'un module de fusion 
nous a ensuite permis de f&#233;d&#233;rer les annotations. Une des singularit&#233;s de notre processus a &#233;t&#233; 
de traiter les conflits de fronti&#232;re d&#8217;annotation lors de la fusion. L&#8217;&#233;valuation finale, op&#233;r&#233;e 
sur des documents Web, montre qu&#8217;en f&#233;d&#233;rant les r&#233;sultats des annotateurs nous am&#233;liorons 
la reconnaissance des entit&#233;s nomm&#233;es en tirant parti des atouts sp&#233;cifiques &#224; chacun. Dans le 
cadre d&#8217;Infom@gic, les annotations d&#8217;entit&#233;s nomm&#233;es provenant de notre plateforme sont 
int&#233;gr&#233;es &#224; un outil de recherche s&#233;mantique sur le web, d&#233;velopp&#233; par la soci&#233;t&#233; Pertimm, 
dont l&#8217;objectif est de travailler sur de tr&#232;s gros volumes de documents textuels. 
</p>
<p>R&#233;f&#233;rences  
A&#1031;T-Mokthar S., CHANOD J.P., ROUX C. (2002). Robustness beyond Shallowness: Incremental 
Dependency Parsing. Special issue of NLE Journal.  
AUBRY C., GRIVEL L., GUILLEMIN-LANNE S., LAUTIER C. (2002) &#171; Aide &#224; la construction de 
composants de connaissance pour l&#8217;extraction d&#8217;information : m&#233;thodologie et 
environnement&#187; CIFT 2002, Hammamet- Tunisie.  
BORTHWICK. A., STERLING J., AGICHTEIN E. ET GRISHMAN R. (1998). Exploiting diverse 
knowledge sources via maximum entropy in named entity recognition, Actes du 6th 
Workshop on Very Large Corpora, 152-160. 
                                                 
3 Pour le sous-type &#171; Microtoponym &#187; les r&#233;sultats de la fusion sont non-nuls, pourtant un seul annotateur affiche 
</p>
<p>des r&#233;sultats non nuls. Ceci s&#8217;explique par le fait qu&#8217;il n&#8217;y a qu&#8217;un seul annotateur ayant donn&#233; des r&#233;ponses 
justes, les autres ont fourni les bonnes annotations mais ont fait des erreurs de fronti&#232;res et ont donc des 
r&#233;sultats nuls. Ceci correspond au cas 2.a. de l&#8217;algorithme (cf. section 5.1) et explique les r&#233;sultats de la fusion. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Brun et al. 
 
</p>
<p>BRUN C., EHRMANN M., JACQUET G. (2007). XRCE-M: A Hybrid System for Named Entity 
Metonymy Resolution. Actes de SemEval 2007.  
CHASE L. L. (1997). Word and Acoustic Condence Annotation for Large Vocabulary Speech 
Recognition, Actes de Eurospeech 1997, 815-818. 
COURTOIS B. (1990). Un syst&#232;me de dictionnaires &#233;lectroniques pour les mots simples du 
fran&#231;ais, In Courtois B. et Silberztein M. (&#233;ds), Dictionnaires &#233;lectroniques du fran&#231;ais, 
Langue Fran&#231;aise, 87, Larousse, Paris, 11-22. 
FERRUCCI D., LALLY A. (2004). UIMA: an architectural approach to unstructured information 
processing in the corporate research environment. Natural Language Engineering, 327-348. 
FISCUS G. J. (1997). A Post-Processing System To Yield Reduced Word Error Rates: 
Recognizer Output Voting Error Reduction (ROVER), Actes de IEEE Workshop on 
Automatic Speech Recognition and Understanding, 347-354. 
GUILLEMIN-LANNE S., SIX A. (2007) La normalisation : nouveau challenge en extraction 
d&#8217;information. Actes de VSST 2006. 
HENDERSON C. J. et BRILL E. (1999). Exploiting Diversity in Natural Language Processing: 
Combining Parsers. Actes de EMNLP-99, 187-194. 
HOBBS J. R. ET AL. (1997). FASTUS : A Cascaded Finite-State Transducers for Extracting 
Information from Natural-Language Text. dans E. Roche et Y. Schabes (eds.), Finite-State 
Language Processing. Cambridge MA: MIT Press. (1997) 
INFOM@GIC &#8211; Livrable D1-11.22. (2008). Int&#233;gration des annotateurs s&#233;mantiques.  
INFOM@GIC &#8211; Livrable D2-11.5. (2006). Sp&#233;cifications d&#8217;une norme de repr&#233;sentation des 
entit&#233;s nomm&#233;es.  
KOZAREVA Z., FERRANDEZ O., MONTOYO A., MU&#209;OZ R. et SUAREZ A. (2007). Combining 
Data-Driven Systems for Improving Named Entity Systems, Data &amp; Knowledge Engineering, 
61:3, Elsevier Science Publishers B.V., Amsterdam, The Netherlands, 449-466. 
MAUREL D., BELLEIL C., EGGERT E. et PITON O. (1996). Le projet PROLEX : r&#233;alisation d&#8217;un 
dictionnaire &#233;lectronique relationnel des noms propres du fran&#231;ais, Actes de GDR-PRC 
Communication Homme-Machine S&#233;minaire Lexique, 164-175. 
MONCEAUX L. et ROBBA I. (2002), Les analyseurs syntaxiques : atouts pour une analyse des 
questions dans un syst&#232;me de question-r&#233;ponse ?, Actes de TALN&#8217;02, 195-204. 
PADRO L. et MARQUEZ L.. (1998). On the evaluation and comparison of taggers: the effect of 
noise in test corpora, Actes de COLING/ACL&#8217;98, Canada. 
PAROUBEK P., DE LA CLERGERIE E., LOISEAU S., VILNAT A. et FRANCOPOULO G. (&#224; para&#238;tre). 
The PASSAGE Syntactic Representation, Actes de LT7. 
PAUMIER S. (2003). De la reconnaissance de formes linguistiques &#224; l&#8217;analyse syntaxique, 
Th&#232;se de doctorat, Universit&#233; de Marne-la-Vall&#233;e. 
PEDERSEN T. (2000). A Simple Approach to Building Ensembles of Naive Bayesian 
Classifiers for Word Sense Disambigusation, Actes de NAACL, 63-69. 
POIBEAU T. (2002) : Extraction d&#8217;information &#224; base de connaissances hybrides, Th&#232;se de 
Doctorat, Universit&#233; Paris XIII. 
SCHWENK H. (1999). Using boosting to improve a hybrid Hmm/Neural Network speech 
recognizer, Actes de ICASSP, 1009-1012. 
TUFI&#350; D. (1999). Tiered Tagging and Combined Classifiers , In Jelinek F. et E. N&#246;th (&#233;ds.), 
Text, Speech and Dialogue, Lecture Notes in AI, vol. 1692, Springer, 28-33. 
YANGARBER R., GRICHMAN R. (1997), Customisation of Information Extraction Systems. 
Dans Pazienza M. T., editor, Information Extraction: A Multidisciplinary Approach to an 
Emerging Information Technology, Springer Verlag, Heildelberg, 1-11. </p>

</div></div>
</body></html>