<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apache UIMA pour le Traitement Automatique des Langues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Apache UIMA pour le Traitement Automatique des Langues
</p>
<p>Nicolas Hernandez, Fabien Poulard, Stergos Afantenos, Matthieu Vernier et
J&#233;r&#244;me Rocheteau
</p>
<p>LINA (CNRS - UMR 6241)
2 rue de la Houssini&#232;re &#8211; B.P. 92208, 44322 NANTES Cedex 3
</p>
<p>{prenom.nom}@univ-nantes.fr
</p>
<p>R&#233;sum&#233;. L&#8217;objectif de la d&#233;monstration est d&#8217;une part de faire un retour d&#8217;exp&#233;rience sur
la solution logicielle Apache UIMA comme infrastructure de d&#233;veloppement d&#8217;applications
distribu&#233;es de TAL, et d&#8217;autre part de pr&#233;senter les d&#233;veloppements r&#233;alis&#233;s par l&#8217;&#233;quipe TALN
du LINA pour permettre &#224; la communaut&#233; de s&#8217;approprier ce &#171; framework &#187;.
</p>
<p>Abstract. Our objectives are twofold : First, based on some common use cases, we will
discuss the interest of using UIMA as a middleware solution for developing Natural Language
Processing systems. Second, we will present various preprocessing tools we have developed in
order to facilitate the access to the framework for the French community.
</p>
<p>Mots-cl&#233;s : Apache UIMA, Applications du TAL, Infrastructure logicielle.
</p>
<p>Keywords: Apache UIMA, NLP applications, Middleware.
</p>
<p>1 Contexte et objectifs
</p>
<p>Plus que jamais, il est important que la communaut&#233; scientifique en Traitement Automatique
des Langues (TAL) porte son attention sur les questions de conception et de d&#233;veloppement
d&#8217;applications de TAL et les enjeux d&#8217;ing&#233;nierie qui en d&#233;coulent tels que la r&#233;utilisation, l&#8217;in-
terop&#233;rabilit&#233;, le passage &#224; l&#8217;&#233;chelle, la s&#233;rialisation (Leidner, 2003). Les motivations sont nom-
breuses : d&#233;velopper des applications distribu&#233;es de traitement d&#8217;informations semi-structur&#233;es
multimedias et multilingues de plus en plus complexes, faciliter les &#233;changes intra-&#233;quipe ainsi
qu&#8217;entre partenaires acad&#233;miques et industriels, capitaliser les savoir-faire et les produits d&#233;ve-
lopp&#233;s, se donner la capacit&#233; de d&#233;passer le cadre du prototypage pour offrir des solutions de
force industrielle, gagner en r&#233;activit&#233; face aux appels &#224; projets nationaux et internationaux...
</p>
<p>Dans le paysage des solutions logicielles existantes qui offrent des moyens d&#8217;int&#233;gration, de d&#233;-
veloppement et de d&#233;ploiement, le &#171; framework &#187; Apache UIMA1 (Unstructured Information
Management Architecture) constitue l&#8217;une des solutions les plus avanc&#233;es et des plus promet-
teuses. Son objectif est de permettre l&#8217;utilisation et la construction d&#8217;applications distribu&#233;es
visant l&#8217;analyse de contenus multim&#233;dias non structur&#233;s.
</p>
<p>UIMA pr&#233;sente de nombreux atouts qui proviennent d&#8217;une part d&#8217;une dissociation tr&#232;s claire des
consid&#233;rations de l&#8217;utilisateur de cha&#238;nes de traitement, du d&#233;veloppeur de composants m&#233;tiers
</p>
<p>1incubator.apache.org/uima</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas Hernandez, Fabien Poulard, Stergos Afantenos, Matthieu Vernier, et J&#233;r&#244;me Rocheteau
</p>
<p>et du d&#233;veloppeur de l&#8217;infrastructure logicielle (&#171; middleware &#187; ) des applications et du frame-
work ; et d&#8217;autre part, des efforts de normalisation propos&#233;s pour la r&#233;solution de probl&#232;mes li&#233;s
&#224; ces diff&#233;rentes consid&#233;rations.
</p>
<p>Initi&#233; par IBM (Ferrucci &amp; Lally, 2004), l&#8217;impl&#233;mentation d&#8217;UIMA est aujourd&#8217;hui un projet
en incubation au sein de l&#8217;ASF (Apache Software Foundation). Les principes de gestion de
l&#8217;information non structur&#233;e (recherche s&#233;mantique et analyse de contenu) font l&#8217;objet d&#8217;un
effort de standardisation de la part d&#8217;un comit&#233; technique de l&#8217;OASIS2 (Organization for the
Advancement of Structured Information Standards). UIMA b&#233;n&#233;ficie d&#8217;une communaut&#233; in-
ternationale active notamment dans le monde du logiciel libre. Sa distribution sous licence
libre Apache n&#8217;interdit pas son utilisation au sein de produits commerciaux. Outre son fra-
mework pour la manipulation de donn&#233;es non structur&#233;es, ses outils (SDK (Sofware Develop-
ment Kit)) d&#233;velopp&#233;s par Apache pour faciliter son utilisation ou le d&#233;veloppement de com-
posants (notamment par le biais d&#8217;extensions pour l&#8217;IDE (Integrated Developement Environ-
ment) Eclipse), UIMA apporte des solutions techniques pour les questions de composition de
cha&#238;ne de traitement (&#171; workflow &#187; ), de d&#233;ploiement distribu&#233; (sur plusieurs processus ou sur
des machines distantes), d&#8217;interop&#233;rabilit&#233; (par l&#8217;utilisation des standards pour la communica-
tion inter-composants par exemple via des services webs), de persistance possibles (stockage
en XMI (XML Metadata Interchange), langage XML cr&#233;&#233; et standardis&#233; par l&#8217;OMG3 (Object
Management Group) pour l&#8217;&#233;change de m&#233;tadonn&#233;es UML)...
</p>
<p>L&#8217;&#233;quipe TALN du LINA a beaucoup travaill&#233; pour s&#8217;approprier cette architecture logicielle
notamment en d&#233;veloppant des composants connecteurs pour des outils ext&#233;rieurs, en portant
ses outils existants, en cr&#233;ant des paquets Debian du framework, en &#233;crivant des tutoriaux, en
organisant de formations internes pour les membres de l&#8217;&#233;quipe, en l&#8217;utilisant comme outil
p&#233;dagogique dans les cours de Master et projets &#233;tudiants.
</p>
<p>UIMA est d&#233;sormais utilis&#233; dans plusieurs de nos projets4 pour f&#233;d&#233;rer ou fournir des services
de traitement &#224; nos partenaires acad&#233;miques et industriels : Dans l&#8217;ANR PIITHIE 2006-08 nous
utilisons l&#8217;environnement UIMA pour d&#233;velopper et d&#233;ployer des analyseurs s&#233;mantiques et
discursifs comme services web de type REST de fa&#231;on &#224; d&#233;tecter la r&#233;utilisation de textes. Dans
l&#8217;ANR Blogoscopie 2006-08 nous d&#233;veloppons un composant UIMA d&#8217;analyse d&#8217;opinions dans
les blogs. Dans l&#8217;ANR C-Mantic 2007-09 nous avons pour objectif de d&#233;velopper un moteur
de recherche s&#233;mantique avec UIMA pour la gestion des analyses s&#233;mantiques. Dans le projet
r&#233;gional Miles &#171; Pays de Loire &#187; 2007-09, nous utiliserons UIMA comme base architecturale
pour connecter des composants distribu&#233;s g&#233;ographiquement d&#233;di&#233;s &#224; la reconnaissance de lo-
cuteurs dans des textes transcrits.
</p>
<p>Cette d&#233;monstration rentre dans le cadre des travaux r&#233;alis&#233;s par l&#8217;&#233;quipe TALN du LINA pour
la construction d&#8217;une communaut&#233; francophone5 de partenaires industriels et acad&#233;miques no-
tamment dans les domaines du traitement du langage naturel et de la parole autour de la solution
logicielle Apache UIMA. Notre objectif est d&#8217;une part de faire un retour d&#8217;exp&#233;rience sur la so-
lution logicielle UIMA comme infrastructure de d&#233;veloppement et d&#8217;&#233;change, et d&#8217;autre part de
pr&#233;senter les d&#233;veloppements r&#233;alis&#233;s (et en cours de r&#233;alisation) par l&#8217;&#233;quipe pour permettre &#224;
la communaut&#233; de s&#8217;approprier l&#8217;environnement.
</p>
<p>2www.oasis-open.org/committees/uima
3www.omg.org
4www.piithie.com ; www.blogoscopie.org ; www.c-mantic.org
5www.uima-fr.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apache UIMA pour le Traitement Automatique des Langues
</p>
<p>2 Contenu de la d&#233;monstration
</p>
<p>La d&#233;monstration portera sur trois axes. Tout d&#8217;abord nous effectuerons une pr&#233;sentation des ou-
tils de pr&#233;-traitement d&#233;velopp&#233;s par le LINA. Ceux-ci couvrent les op&#233;rations de pr&#233;-traitement
traditionnelles : reconnaissance du type MIME des fichiers manipul&#233;s, extraction des zones tex-
tuelles, reconnaissance de l&#8217;encodage d&#8217;un texte, de sa langue, segmentation en mots et phrases,
analyse morphologique et syntaxique. Lors de ces travaux, nous avons cherch&#233; avant tout &#224;
r&#233;utiliser l&#8217;existant. Ainsi nous comptons parmi les composants d&#233;velopp&#233;s des connecteurs
pour les outils comme l&#8217;analyseur morphosyntaxique Tree-tagger de H. Schmid, l&#8217;&#233;tiqueteur
grammatical de E. Brill, le lemmatiseur Flemm de F. Nammer, le projet Apache Lucene Tika. . .
</p>
<p>Dans un deuxi&#232;me axe, nous produirons un retour d&#8217;exp&#233;rience sur l&#8217;utilisation de UIMA au
travers de cas d&#8217;usage r&#233;currents &#224; nos projets de recherche tels que le d&#233;ploiement en service
web d&#8217;une cha&#238;ne de traitement, l&#8217;int&#233;gration d&#8217;outils h&#233;t&#233;rog&#232;nes, le d&#233;ploiement sur plusieurs
machines d&#8217;une application distribu&#233;e multi-composants... Ces utilisations seront illustr&#233;es &#224;
partir de syst&#232;mes que nous avons d&#233;velopp&#233;s comme notre syst&#232;me de reconnaissance d&#8217;entit&#233;s
nomm&#233;es, Nemesis (Fourour, 2002), et d&#8217;extraction terminologique, ACABIT (Daille, 2003).
</p>
<p>Enfin, nous ouvrirons la discussion sur les questions d&#8217;interop&#233;rabilit&#233; en montrant comment
des personnees d&#233;sireuses d&#8217;adopter UIMA peuvent collaborer et &#233;changer le r&#233;sultat de leurs
traitements (Hernandez et al., ; Hahn et al., 2007).
</p>
<p>3 Moyens techniques demand&#233;s pour la pr&#233;sentation
</p>
<p>Pour cette d&#233;monstration, nous aurions besoin &#224; minima d&#8217;une table. Pour un meilleur rendu,
nous appr&#233;cierons un vid&#233;oprojecteur et son &#233;cran (ou bien un grand &#233;cran de PC), &#233;ventuelle-
ment une connexion Internet (cabl&#233;e ou par wifi) et un support &#224; poster.
</p>
<p>R&#233;f&#233;rences
</p>
<p>DAILLE B. (2003). Conceptual structuring through term variations. In F. Bond, A. Korhonen,
D. MacCarthy and A. Villacicencio (eds.), Proceedings ACL 2003 Workshop on Multiword
Expressions : Analysis, Acquisition and Treatment, p. 9&#8211;16.
FERRUCCI D. &amp; LALLY A. (2004). Uima : an architectural approach to unstructured infor-
mation processing in the corporate research environment. Natural Language Engineering,
10(3-4), 327&#8211;348.
FOUROUR N. (2002). Nemesis, un syst&#232;me de reconnaissance incr&#233;mentielle des entit&#233;s nom-
m&#233;es pour le fran&#231;ais. In Actes de TALN, p. 265&#8211;274, Nancy.
HAHN U., BUYKO E., TOMANEK K., PIAO S., MCNAUGHT J., TSURUOKA Y. &amp; ANA-
NIADOU S. (2007). An annotation type system for a data-driven nlp pipeline. In LAW at
ACL, p. 33&#8211;40 : Prague, Czech Republic, June 28-29, 2007. Stroudsburg, PA : Association for
Computational Linguistics.
HERNANDEZ N., POULARD F., AFANTENOS S., VERNIER M. &amp; ROCHETEAU J. Not yet
another annotation framework but engineering-sensitive rules to design (uima) type systems.
In A para&#238;tre.
LEIDNER J. L. (2003). Current issues in software engineering for natural language processing.
In SEALTS at HLT/NAACL, p. 45&#8211;50, Edmonton, Alberta, Canada.</p>

</div></div>
</body></html>