<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L'analyseur syntaxique Cordial dans Passage</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009
</p>
<p>L'analyseur syntaxique Cordial dans Passage1
</p>
<p>Dominique Laurent, Sophie N&#232;gre, Patrick S&#233;gu&#233;la (1)
</p>
<p>(1)  Synapse D&#233;veloppement
dlaurent, sophie.negre, patrick.seguela@synapse-fr.com
</p>
<p>R&#233;sum&#233; : Cordial est un analyseur syntaxique et s&#233;mantique d&#233;velopp&#233; par la soci&#233;t&#233;
Synapse D&#233;veloppement. Largement utilis&#233; par les laboratoires de TALN depuis plus de dix
ans, cet analyseur participe &#224; la campagne Passage (&quot;Produire des Annotations Syntaxiques &#224;
Grande &#201;chelle&quot;). Comment fonctionne cet analyseur ? Quels r&#233;sultats a-t-il obtenu lors de la
premi&#232;re phase d'&#233;valuation de cette campagne ? Au-del&#224; de ces questions, cet article montre
en quoi les contraintes industrielles fa&#231;onnent les outils d'analyse automatique du langage
naturel.
</p>
<p>Abstract : Cordial is a syntactic and semantic parser developed by Synapse
D&#233;veloppement. Widely used by the laboratories of NLP for over ten years, this analyzer is
involved in the Passage campaign (&quot;Producing Syntactic Annotations on a Large Scale&quot;). How
does this parser work? What were the results obtained during the first phase of the evaluation?
Beyond these issues, this article shows how the industrial constraints condition the tools for
Natural Language Procesing.
</p>
<p>Mots-cl&#233;s :   Analyse syntaxique, analyse s&#233;mantique, &#233;valuation, Passage
Keywords:  Parsing, semantic analysis, evaluation
</p>
<p>                                               
1 cf. http://atoll.inria.fr/passage/eval1.fr.html, et http://atoll.inria.fr/passage/articles.fr.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dominique Laurent, Sophie N&#232;gre, Patrick S&#233;gu&#233;la
</p>
<p>1 Introduction
</p>
<p>1.1 Cordial
</p>
<p>Cordial (acronyme de CORrecteur D'Impr&#233;cisions et Analyseur Lexico-s&#233;mantique) est un
analyseur syntaxique con&#231;u &#224; l'origine pour la correction orthographique et grammaticale.
D&#233;velopp&#233; au d&#233;but des ann&#233;es 90 mais constamment maintenu et enrichi depuis, Cordial est le
fondement de nombreux d&#233;veloppements : composants linguistiques de nettoyage automatique
de texte, extracteur de mots-cl&#233;s et de phrases-cl&#233;s, extracteur de th&#232;mes et de concepts,
extracteur de terminologie et d'entit&#233;s nomm&#233;es, moteur de question-r&#233;ponse.
</p>
<p>D&#233;velopp&#233; sous Windows, Cordial est &#233;galement disponible sous Linux, en librairie d'analyse
et de correction. Une version sp&#233;cifique pour la recherche, &quot;Cordial Analyseur&quot;, est utilis&#233;e par
plus d'une centaine de laboratoires dans le monde. Con&#231;u pour la langue fran&#231;aise, Cordial
devient bilingue, l'analyseur syntaxique et de nombreuses ressources ayant &#233;t&#233; progressivement
adapt&#233;es pour la langue anglaise.
</p>
<p>1.2 Easy et Passage
</p>
<p>De 1994 &#224; 1998 a eu lieu la campagne d'&#233;valuation GRACE (Grammaire et Ressources pour
les Analyseurs de Corpus et leur &#201;valuation). Notre analyseur, tout juste commercialis&#233;, a
obtenu d'excellentes notes lors de la phase pr&#233;paratoire. Il n'a malheureusement pas pu
participer &#224; l'&#233;valuation finale, celle-ci ayant &#233;t&#233; pr&#233;vue pour des syst&#232;mes sous Unix et notre
syst&#232;me &#233;tant &#224; l'&#233;poque uniquement sous Windows.
</p>
<p>Dans le cadre du projet Technolangue-Evalda, une campagne d'&#233;valuation EASY (pour
&#201;valuation des Analyseurs SYntaxiques) s'est d&#233;roul&#233;e entre 2003 et 2006. Plus ambitieuse
que GRACE, cette campagne visait &#224; &#233;valuer l'analyse syntaxique en composants et en
relations. Cordial a &#233;galement particip&#233; &#224; cette campagne, avec d'excellents r&#233;sultats fournis
plus bas (&#167; 3).
</p>
<p>De 2007 &#224; 2009, dans le cadre du projet PASSAGE (&quot;Produire des Annotations Syntaxiques &#192;
Grande &#201;chelle&quot;), une pr&#233;-&#233;valuation a eu lieu fin 2007 et une &#233;valuation aura lieu cette ann&#233;e.
Nous participons &#233;galement &#224; cette campagne.
</p>
<p>2 L'analyseur syntaxique Cordial
Comme mentionn&#233; supra, Cordial est un analyseur con&#231;u pour la correction. Afin d'analyser le
mieux possible un texte comportant &#233;ventuellement des fautes d'accord ou d'autres fautes, il est
difficilement envisageable d'utiliser une grammaire formelle, qui fait le plus souvent appel &#224; des
r&#232;gles d'appariement de groupes privil&#233;giant le genre et le nombre. Nous avons donc associ&#233; &#224;
des r&#232;gles g&#233;n&#233;rales et tr&#232;s peu li&#233;es aux attributs de genre et de nombre (analyseur &#224;
rel&#226;chement de contraintes) un ensemble d'outils statistiques, en particulier pour effectuer la
d&#233;sambigu&#239;sation grammaticale.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'analyseur syntaxique Cordial dans Passage
</p>
<p>2.1 La d&#233;sambigu&#239;sation grammaticale
</p>
<p>Dans un dictionnaire, la proportion de mots polysyntaxiques, par exemple noms et adjectifs
(bonne, politique, vert...), formes verbales et noms (avions, boucher, foule, &#233;t&#233;...), est faible.
Elle repr&#233;sente moins de 5% des entr&#233;es, donc des lemmes, m&#234;me pour un dictionnaire
classique, et moins de 2% des formes (si on ne consid&#232;re pas les ambigu&#239;t&#233;s entre formes
verbales). Dans la r&#233;alit&#233; de la langue, cette proportion est consid&#233;rable puisqu'en moyenne
plus de 50% des mots d'une phrase sont ambigus grammaticalement. Cette proportion tr&#232;s
&#233;lev&#233;e r&#233;sulte d'une part de l'ambigu&#239;t&#233; de nombreux mots-outils (le, la, les, d&#233;terminants et
pronoms personnels, des, du, d&#233;terminants simples et contract&#233;s, etc.) et, d'autre part, du fait
que les mots les plus courants sont souvent les plus ambigus.
</p>
<p>Cette ambigu&#239;t&#233; constitue un probl&#232;me majeur pour tout analyseur syntaxique car toute erreur
de d&#233;sambigu&#239;sation grammaticale est tr&#232;s p&#233;nalisante pour les &#233;tapes ult&#233;rieures : groupage,
recherche des relations, analyse s&#233;mantique. Ainsi dans l'exemple classique &quot;le pilote ferme la
porte&quot;, en admettant que &quot;le pilote&quot; est consid&#233;r&#233; comme d&#233;terminant + nom et non comme
personnel + verbe le choix de l'adjectif pour &quot;ferme&quot; induit personnel + verbe pour &quot;la porte&quot;
alors que le choix de la forme verbale induit d&#233;terminant + nom pour le groupe &quot;la porte&quot;.
</p>
<p>La d&#233;sambigu&#239;sation grammaticale se situe dans notre analyseur apr&#232;s la consultation des
dictionnaires et la correction orthographique. La consultation des dictionnaires affecte &#224;
chaque mot l'ensemble des types grammaticaux possibles, y compris les diff&#233;rentes formes
verbales. La correction orthographique, remplace les mots inconnus par la meilleure
suggestion. Ce remplacement n'est effectu&#233; que si la premi&#232;re suggestion a une probabilit&#233;
nettement sup&#233;rieure &#224; la seconde et selon le param&#233;trage utilisateur. Ce traitement est
optionnel. Les entit&#233;s nomm&#233;es figurant dans nos dictionnaires sont &#233;galement group&#233;es &#224;
cette &#233;tape. La d&#233;tection des entit&#233;s nomm&#233;es s'appuie sur les dictionnaires tr&#232;s complets
d&#233;velopp&#233;s pour Cordial, &#224; notre connaissance, les plus complets en fran&#231;ais (plus de un
million de lemmes pour plus de 2 millions de mots, noms communs et noms propres r&#233;unis,
plus de 100 000 expressions). De plus, avant la d&#233;sambigu&#239;sation, un premier groupement des
expressions est effectu&#233;. &#192; ce stade, les expressions pr&#233;positionnelles sont privil&#233;gi&#233;es car leur
non-d&#233;termination p&#232;se fortement sur les analyses ult&#233;rieures. Pour la totalit&#233; des verbes et
pour un grand nombre d'autres mots (au total environ 150 000 lemmes), un dictionnaire
&quot;grammatical&quot; fournit de 8 (pour un adverbe) &#224; 147 traits (pour un verbe courant), traits
s&#233;mantiques (type s&#233;mantique du sujet, du COD, du COI, par exemple) ou traits syntaxiques
(compl&#233;tive possible, infinitive peut suivre, etc.)
</p>
<p>L'application de quelques dizaines de r&#232;gles simples permet d'&#233;liminer environ 12 % des
ambigu&#239;t&#233;s grammaticales. Ainsi &quot;le&quot; ou &quot;la&quot; pr&#233;c&#233;d&#233; d'un pronom personnel sujet (&quot;je&quot;, &quot;il&quot;...)
non reli&#233; &#224; une forme verbale le pr&#233;c&#233;dant est toujours un pronom personnel, &quot;mien&quot; ou &quot;sien&quot;
pr&#233;c&#233;d&#233; d'un d&#233;terminant est toujours un pronom possessif, etc. Ces r&#232;gles sont toutefois
moins simples que d&#233;crit ci-dessus car la robustesse n&#233;cessaire d'un correcteur impose ses lois
&#224; l'analyseur. Par exemple le trait d'union reliant le pronom personnel sujet &#224; la forme verbale le
pr&#233;c&#233;dant a pu &#234;tre oubli&#233;, il faut donc v&#233;rifier si ce pronom personnel est pr&#233;c&#233;d&#233; d'une forme
verbale &#233;ventuelle, etc.
</p>
<p>Apr&#232;s l'application de ces r&#232;gles, la proportion de mots ambigus grammaticalement reste
encore tr&#232;s importante. Pour r&#233;soudre ces ambigu&#239;t&#233;s, nous utilisons une table de bigrammes et
une table de trigrammes. La table de bigrammes croise 70 cat&#233;gories grammaticales
correspondant aux diff&#233;rents types grammaticaux avec leur genre et leur nombre s'ils existent.
Pour les formes conjugu&#233;es, seule la personne est prise en compte (le mode et le temps sont</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dominique Laurent, Sophie N&#232;gre, Patrick S&#233;gu&#233;la
</p>
<p>d&#233;sambigu&#239;s&#233;s ult&#233;rieurement). 6 cat&#233;gories concernent la ponctuation (point ou fin de phrase,
virgule, point virgule, deux points, parenth&#232;se ouvrante ou fermante). Pour certaines
cat&#233;gories peu fr&#233;quentes, comme le pronom possessif ou l'adjectif ind&#233;fini, aucune
diff&#233;renciation n'est effectu&#233;e, ni de genre, ni de nombre. La table de trigrammes croise 10
cat&#233;gories soit 10x10x10 (en fait 10x10x11 avec les effectifs cumul&#233;s). Ces 10 cat&#233;gories sont
les grandes bases de d&#233;sambigu&#239;sation : adjectifs, adverbes, d&#233;terminants, conjonctions,
pr&#233;positions, noms, pronoms, verbes, ponctuations faibles, ponctuations fortes.
</p>
<p>Ces tables ont &#233;t&#233; construites en 1992 &#224; partir de petits corpus annot&#233;s manuellement d'environ
50 000 mots. Depuis ces corpus ont &#233;t&#233; enrichis, &#224; travers les campagnes d'&#233;valuation mais
&#233;galement par correction manuelle de nos sorties et portent maintenant sur plus de deux
millions de mots. Les tables de bigrammes et trigrammes sont mises &#224; jour au fur et &#224; mesure
de l'&#233;volution de ce corpus annot&#233; (en fait tous les deux ans en moyenne). Les textes utilis&#233;s
sont des textes &quot;propres&quot;, a priori exempts de fautes, ce qui p&#232;se parfois sur les choix effectu&#233;s
lors de l'analyse de textes d&#233;grad&#233;s. Ainsi de l'oubli de l'accent grave sur &quot;a&quot; qui, en passant ce
mot d'une cat&#233;gorie de pr&#233;position &#224; une forme verbale ou un nom, contamine la
d&#233;sambigu&#239;sation des termes voisins.
</p>
<p>La table de bigrammes est appliqu&#233;e sur le mot pr&#233;c&#233;dent et le mot ambigu, ainsi que sur le
mot ambigu et le mot suivant. La table de trigrammes est appliqu&#233;e sur les deux mots
pr&#233;c&#233;dents et le mot ambigu, sur le mot pr&#233;c&#233;dent, le mot suivant et le mot ambigu, sur le mot
ambigu et les deux mots suivants. Les probabilit&#233;s obtenues sont combin&#233;es selon une formule
prenant &#233;galement en compte les ambigu&#239;t&#233;s possibles des mots pr&#233;c&#233;dents et suivants ainsi
que la fr&#233;quence dans la langue des diff&#233;rentes formes de chaque mot, par exemple le fait que
la forme verbale &quot;foule&quot; est beaucoup moins fr&#233;quente que le substantif ou le fait que la forme
verbale &quot;&#233;t&#233;&quot; est nettement plus fr&#233;quente que le substantif. Ces statistiques de fr&#233;quence ont
&#233;t&#233; &#233;labor&#233;es au d&#233;part &#224; partir d'un corpus de 500 millions de mots, elles ont &#233;t&#233; revues l'an
dernier &#224; partir d'un corpus de 1,2 milliard de mots.  La d&#233;sambigu&#239;sation &#233;tant effectu&#233;e de
gauche &#224; droite, un poids plus &#233;lev&#233; est donn&#233; aux probabilit&#233;s avec le ou les mots pr&#233;c&#233;dents.
</p>
<p>Tous les mots sont alors &quot;d&#233;sambigu&#239;s&#233;s&quot; grammaticalement. En fait, le tableau des formes
grammaticales possibles pour chaque mot est conserv&#233; jusqu'&#224; la fin de l'analyse, de m&#234;me que
la probabilit&#233; de chaque forme grammaticale, permettant des changements jusqu'&#224; la phase de
d&#233;tection des relations. Un module sp&#233;cifique traite alors les ambigu&#239;t&#233;s &quot;lourdes&quot;, c'est-&#224;-dire
celles constitu&#233;es d'au moins deux mots ambigus, pour lesquelles les tables sont parfois
insuffisantes et qui n&#233;cessitent la prise en compte d'un contexte sup&#233;rieur &#224; quatre mots. C'est
le cas des couples adjectif/nom, nom/adjectif (&quot;bonne alerte&quot;), d&#233;terminant/nom ou
personnel/verbe (&quot;l'aide&quot;, &quot;les avions&quot;).
</p>
<p>Une premi&#232;re phase de d&#233;sambigu&#239;sation s&#233;mantique est alors effectu&#233;e. Elle se base
essentiellement sur le contexte gauche et droit pour affecter une probabilit&#233; &#224; chacun des sens
possibles des mots polys&#233;miques. Nous prenons en compte environ 25 000 sens pour 9 000
mots polys&#233;miques, ce qui est un peu inf&#233;rieur &#224; un dictionnaire papier, le but &#233;tant de s&#233;parer
des sens correspondant &#224; des usages syntaxiques h&#233;t&#233;rog&#232;nes et surtout &#224; des concepts
nettement diff&#233;renci&#233;s. Ainsi &quot;abdomen&quot; est monos&#233;mique pour Cordial alors que de nombreux
dictionnaires distinguent la r&#233;gion inf&#233;rieure du corps des mammif&#232;res et la partie post&#233;rieure
du corps des arthropodes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'analyseur syntaxique Cordial dans Passage
</p>
<p>2.2 Le groupage en constituants
</p>
<p>La premi&#232;re phase du groupage en constituants consiste &#224; regrouper les expressions (verbales,
nominales, adjectivales, adverbiales...). Ce regroupement utilise la probabilit&#233; de coh&#233;rence de
l'expression (cod&#233;e de 1 &#224; 9 dans nos lexiques) et r&#233;applique les tables de bigrammes et de
trigrammes entre l'expression potentielle et les mots ou expressions pr&#233;c&#233;dents et suivants. De
fait 92 % des expressions potentielles sont regroup&#233;es mais certaines expressions &#224; faible
coh&#233;rence comme &quot;bien que&quot; sont moins fr&#233;quemment group&#233;es.
</p>
<p>Le groupage en constituants s'effectue en quatre phases : constitution des groupes verbaux,
puis des groupes nominaux, puis des groupes adjectivaux, enfin traitement des mots r&#233;siduels,
en particulier des adverbes, raccord&#233;s ou non &#224; un groupe existant. Une fois les groupes de
base constitu&#233;s, un module recherche les d&#233;pendances de groupes. Il raccorde par exemple
&quot;des f&#234;tes&quot; &#224; &quot;comit&#233;&quot; et &quot;du comit&#233;&quot; &#224; &quot;pr&#233;sident&quot; dans &quot;pr&#233;sident du comit&#233; des f&#234;tes&quot;.
Rappelons que le groupage en constituants s'effectue avec une prise en compte minimale du
genre et du nombre, le but &#233;tant de corriger d'&#233;ventuelles erreurs d'accord.
</p>
<p>2.3 La d&#233;termination des relations
</p>
<p>Les groupes &#233;tant d&#233;limit&#233;s et d&#233;finis, il devient possible de d&#233;terminer les relations entre ces
groupes. Avant cela, il est toutefois n&#233;cessaire de d&#233;couper la phrase en propositions. Cette
phase est beaucoup plus complexe qu'il n'y para&#238;t, les d&#233;limiteurs de proposition comme &quot;que&quot;
ou &quot;et&quot; pouvant &#233;galement &#234;tre souvent des unificateurs de groupes, et les propositions
pouvant &#234;tre constitu&#233;es de diff&#233;rents fragments (&quot;l'homme qui vous parle et la femme qui
vous regarde sont de fait mari et femme&quot;). Cette d&#233;coupe en propositions s'effectue &#224; partir
des groupes verbaux &#224; la fois vers la gauche et la droite, elle prend en compte les contraintes
syntaxiques et s&#233;mantiques des verbes, par exemple le type s&#233;mantique du sujet, de l'attribut,
du COD. Le typage des propositions (principale, ind&#233;pendante, incise, etc.) est effectu&#233; durant
cette phase de d&#233;coupe, les d&#233;limiteurs potentiels &#233;tant conserv&#233;s pour d'&#233;ventuelles
corrections ult&#233;rieures.
</p>
<p>Apr&#232;s la relation sujet-verbe, c'est la relation verbe-attribut qui est recherch&#233;e, si elle existe.
Ces deux relations sont en effet les deux plus importantes sources de fautes de grammaire, hors
accord interne des groupes en genre et en nombre. Puis, les autres relations, COD, COI,
apposition, etc. sont recherch&#233;es pour chacun des groupes. Avant cette recherche, une
d&#233;termination de la nature r&#233;elle des d&#233;terminants &quot;de la&quot; &quot;du&quot; et &quot;des&quot; est effectu&#233;e car elle
conditionne la cat&#233;gorisation en objet direct ou indirect (&quot;il vend de la toile de Jouy&quot;, &quot;il vend
de bourg en bourg&quot;). Un traitement final v&#233;rifie l'affectation des adjectifs entre ponctuations ou
en fin de groupe nominal compos&#233; afin de d&#233;terminer au mieux le rattachement de ces
adjectifs. Enfin est alors effectu&#233;e la d&#233;sambigu&#239;sation des modes et temps verbaux (indicatif
ou subjonctif, par exemple), m&#234;me si certaines formes comme l'imp&#233;ratif sont souvent d&#233;j&#224;
d&#233;sambigu&#239;s&#233;es &#224; ce stade (absence de sujet).
</p>
<p>La d&#233;termination des relations s'appuie avant tout sur la nature des groupes constituant la
proposition et leur position dans la phrase, mais elle prend en compte l'ensemble des donn&#233;es
stock&#233;es dans notre dictionnaire grammatical. Enfin une deuxi&#232;me phase de la
d&#233;sambigu&#239;sation s&#233;mantique est alors effectu&#233;e, qui prend en compte l'ensemble des
contraintes syntaxiques et s&#233;mantiques des &#233;tapes ant&#233;rieures. Cette seconde d&#233;sambigu&#239;sation
est encore susceptible d'amener une r&#233;vision des mises en relation et parfois m&#234;me de la
d&#233;sambigu&#239;sation grammaticale.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dominique Laurent, Sophie N&#232;gre, Patrick S&#233;gu&#233;la
</p>
<p>2.4 En fin d'analyse
</p>
<p>Lorsque l'analyseur est utilis&#233; pour la correction, application premi&#232;re de Cordial, c'est &#224; ce
stade que se situe l'application des r&#232;gles d'accord intra-groupes ou inter-groupes. Certaines
r&#232;gles font l'objet de modules sp&#233;cifiques, en particulier l'accord du participe pass&#233; et la
concordance des temps.
</p>
<p>La r&#233;solution des anaphores et la d&#233;tection des entit&#233;s nomm&#233;es d&#233;passent un peu le cadre de
l'analyseur proprement dit, mais se situent apr&#232;s cette phase de correction. Les r&#233;f&#233;rents
potentiels sont collationn&#233;s au fil de l'analyse et la r&#233;solution des anaphores pronominales et
adjectivales (adjectifs possessifs) utilise ces r&#233;f&#233;rents pour d&#233;terminer auquel se r&#233;f&#232;re
l'anaphore, en fonction de crit&#232;res essentiellement s&#233;mantiques et statistiques, sachant par
exemple que les pronoms d&#233;monstratifs r&#233;f&#232;rent le plus souvent &#224; des r&#233;f&#233;rents tr&#232;s proches,
que le pronom personnel &quot;en&quot; peut r&#233;f&#233;rer &#224; une phrase enti&#232;re plut&#244;t qu'&#224; un groupe nominal
ou une entit&#233; nomm&#233;e, etc.
</p>
<p>La d&#233;tection des entit&#233;s nomm&#233;es ne figurant pas dans nos dictionnaires  s'appuie sur l'analyse
syntaxique et les donn&#233;es s&#233;mantiques r&#233;unies sur chaque terme. Elle permet de regrouper de
nombreuses entit&#233;s ne figurant pas dans nos dictionnaires et op&#232;re surtout une
d&#233;sambigu&#239;sation de ces entit&#233;s nomm&#233;es (&quot;France&quot; r&#233;f&#232;re-t-il &#224; une femme, &#224; un pays comme
lieu ou comme organisation, &#224; un bateau, etc.).
</p>
<p>Les utilisations industrielles de notre analyseur imposent des contraintes fortes de robustesse et
de rapidit&#233;. Con&#231;u pour la correction, Cordial est particuli&#232;rement adapt&#233; pour l'analyse de
corpus d&#233;grad&#233;s et de corpus oraux. L'imp&#233;ratif de rapidit&#233; a &#233;galement impos&#233; ses lois sur la
conception d'ensemble de l'analyseur. La r&#233;cursivit&#233; et les r&#233;analyses sont pratiquement
bannies, m&#234;me si les nombreuses variables probabilistes permettent des rectifications en cours
d'analyse. Toutes les routines ont &#233;t&#233; &#233;crites en langage C optimis&#233;. La vitesse d'analyse est
d'environ 10 000 mots par seconde, en int&#233;grant les fonctions optionnelles de correction, de
recherche des anaphores et de marquage des entit&#233;s nomm&#233;es.
</p>
<p>3 Easy
Participer &#224; une &#233;valuation d'analyseurs syntaxiques, c'est &#233;valuer la valeur de son analyseur
mais aussi &#233;valuer l'aptitude de ses d&#233;veloppeurs &#224; se conformer &#224; une norme. Pour Easy et
pour Passage, cette norme est sophistiqu&#233;e et complexe, assez &#233;loign&#233;e du format de travail de
Cordial. Ainsi l'&#233;valuation d&#233;finissait un petit lexique d'expressions accept&#233;es, tr&#232;s &#233;loign&#233; en
taille de notre dictionnaire, ce qui nous a oblig&#233; &#224; effectuer des traitements sp&#233;cifiques
cons&#233;quents, des modules entiers de notre analyseur devant &#234;tre neutralis&#233;s ou modifi&#233;s.
</p>
<p>Nos r&#233;sultats sont excellents pour l'analyse en constituants : 1er en pr&#233;cision, 1er en rappel et
1er en f-mesure avec un taux moyen de 0,89 (syst&#232;me A10 dans les tableaux fournis par
Paroubek 2008). Pour l'analyse en relations, nous obtenons la meilleure f-mesure (0,58), un
syst&#232;me ayant une meilleure pr&#233;cision et un autre syst&#232;me ayant un meilleur rappel. Notre
syst&#232;me traitait l'ensemble des corpus et des relations. Il s'est montr&#233; tr&#232;s r&#233;gulier pour les
corpus, ne perdant qu'environ 5% de pr&#233;cision et rappel en constituants, et moins de 10% de
pr&#233;cision et rappel en relations pour les corpus de mails et oral, les plus difficiles.
</p>
<p>Notons ici que la complexit&#233; du codage en constituants et en relations s'est traduite par des
taux d'erreur &#233;lev&#233;s tant dans les corpus de d&#233;veloppement que dans les corpus de tests, taux</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'analyseur syntaxique Cordial dans Passage
</p>
<p>&#233;valu&#233;s &#224; pr&#232;s de 5% sur les constituants et au moins 20 % sur les relations. Pour la campagne
Passage, ces corpus ont &#233;t&#233; r&#233;vis&#233;s et le guide d'annotation a &#233;t&#233; r&#233;vis&#233; mais les taux d'erreurs
restent non n&#233;gligeables.
</p>
<p>4 Pr&#233;-campagne Passage
Cette campagne vient &#224; la suite des campagnes GRACE et EASY et reprend plusieurs des
protocoles d'&#233;valuation de cette derni&#232;re campagne, avec des corpus sensiblement diff&#233;rents et
plus &#233;tendus.
</p>
<p>4.1 Objectifs et d&#233;roulement
</p>
<p>Les principaux objectifs de cette campagne soutenue par l'ANR sont les suivants :
&#61623; &#233;valuer les analyseurs fran&#231;ais ;
&#61623; am&#233;liorer l'exactitude et la robustesse des analyseurs fran&#231;ais sur des corpus &#224; grande
</p>
<p>&#233;chelle (270 millions de mots) ;
&#61623; exploiter les annotations syntaxiques r&#233;sultantes pour cr&#233;er une ressource linguistique
</p>
<p>plus riche et plus &#233;tendue : un treebank pour le Fran&#231;ais.
</p>
<p>Six types de constituants ont &#233;t&#233; choisis pour cette campagne : Groupe nominal, Noyau verbal,
Groupe adjectival, Groupe adverbial, Groupe pr&#233;positionnel et Groupe pr&#233;positionnel &#224; noyau
verbal.
</p>
<p>Les relations &#224; relever sont les suivantes : d&#233;pendance sujet-verbe (SUJ-V), d&#233;pendance
auxiliaire-verbe (AUX-V), objet direct (COD-V), autres compl&#233;ments du verbe (CPL-V),
modifieurs du verbe (MOD-V), subordonn&#233;s (COMP), attribut du sujet ou de l'objet (ATB-
SO), modifieur du nom (MOD-N), modifieur de l&#8217;adjectif (MOD-A), modifieur de l&#8217;adverbe
(MOD-R), modifieur de la pr&#233;position (MOD-P), coordination (COORD), apposition
(APPOS) et juxtaposition (JUXT).
</p>
<p>Lors de la premi&#232;re &#233;valuation de la campagne Passage qui s&#8217;est d&#233;roul&#233;e fin 2007, 10
analyseurs ont fourni leurs r&#233;sultats en constituants et seulement 7 ont pu &#234;tre &#233;valu&#233;s sur les
relations.
</p>
<p>4.2 Cordial dans la campagne Passage1
</p>
<p>Pour cette campagne, un serveur d'&#233;valuation a &#233;t&#233; mis en place, qui permet aux participants
de tester leur syst&#232;me sur un corpus d'entra&#238;nement. Ce serveur d'&#233;valuation, en permettant
autant d'it&#233;rations que d&#233;sir&#233; et durant plusieurs mois, a &#233;t&#233; et reste d'un grand int&#233;r&#234;t pour
l'am&#233;lioration des syst&#232;mes. A titre indicatif, apr&#232;s un mois et demi d'am&#233;liorations sur la
d&#233;limitation des constituants (novembre-d&#233;cembre 2007), l'analyseur Cordial offre un taux de
performance compris entre 96% et 99% selon les corpus. Pour les relations, apr&#232;s un mois
d'&#233;valuations comparatives (mi-janvier &#224; mi-f&#233;vrier 2008), l'analyseur Cordial offre des
performances comprises entre 70% et 80% selon les corpus. Ces performances sont
naturellement tr&#232;s diff&#233;rentes selon le type des relations.
</p>
<p>L'analyseur Cordial a de bonnes ou de tr&#232;s bonnes performances (80% &#224; 100%) sur les
relations li&#233;es aux accords (sujet-verbe, verbe-attribut, auxiliaire-verbe, verbe-cod, modifieur
de nom), il obtient par contre des r&#233;sultats inf&#233;rieurs sur d'autres types de relations comme les</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dominique Laurent, Sophie N&#232;gre, Patrick S&#233;gu&#233;la
</p>
<p>appositions ou les juxtapositions. Une autre cons&#233;quence de l'am&#233;lioration gr&#226;ce au serveur
d'&#233;valuation est la convergence progressive des courbes de pr&#233;cision et de rappel : comme
l'ensemble des syst&#232;mes, l'analyseur Cordial offrait au d&#233;part une pr&#233;cision sup&#233;rieure au
rappel. Cette diff&#233;rence a &#233;t&#233; progressivement gomm&#233;e.
</p>
<p>Une &#233;valuation a eu lieu fin 2007. Lors de cette &#233;valuation, Cordial a obtenu des r&#233;sultats
similaires &#224; ceux de la campagne EASY : 1er en pr&#233;cision, en rappel et en f-mesure pour les
composants, 1er en rappel, 2e en pr&#233;cision et en f-mesure :
</p>
<p>Constituants Relations
Pr&#233;cision Rappel F-mesure Pr&#233;cision Rappel F-mesure
</p>
<p>0.96 0.97 0.96 0.69 0.65 0.67
Figure 1 : r&#233;sultats de la pr&#233;-campagne Passage (arrondis &#224; 2 d&#233;cimales)
</p>
<p>On notera que nos r&#233;sultats sont nettement meilleurs en constituants que lors d'EASY, le taux
d'erreurs &#233;tant inf&#233;rieur &#224; 4% contre 11% lors d'EASY. Concernant les relations, nos r&#233;sultats
sont &#233;galement meilleurs que pour EASY : plus de 10 % d'am&#233;lioration.
</p>
<p>Constituants Relations
Pr&#233;cision Rappel F-mesure Pr&#233;cision Rappel F-mesure
</p>
<p>Corpus complet 0,96 0,97 0,96 0,69 0,65 0,67
Elda 0,97 0,98 0,97 0,76 0,69 0,72
</p>
<p>Le Monde 0,96 0,97 0,96 0,66 0,63 0,64
Litt&#233;raire 0,96 0,96 0,96 0,70 0,65 0,68
</p>
<p>Mail 0,91 0,95 0,93 0,65 0,57 0,60
M&#233;dical 0,95 0,96 0,95 0,67 0,67 0,67
</p>
<p>Delic 1,00 1,00 1,00 1,00 0,50 0,67
Parlement 0,96 0,97 0,97 0,68 0,67 0,68
Questions 0,97 0,98 0,98 0,67 0,66 0,67
</p>
<p>Figure 2 : r&#233;sultats par corpus de la pr&#233;-campagne Passage (arrondis &#224; 2 d&#233;cimales)
</p>
<p>On remarquera aussi une certaine irr&#233;gularit&#233; des r&#233;sultats de Cordial selon le type de corpus &#224;
analyser. Ainsi, en ce qui concerne l&#8217;analyse des constituants, les r&#233;sultats sont assez largement
inf&#233;rieurs &#224; la moyenne pour les corpus Oral, Mail et M&#233;dical. On peut expliquer cet &#233;tat de fait
en consid&#233;rant que les corpus Oral et Mail pr&#233;sentent de nombreuses constructions peu
grammaticales, parfois une absence ou une profusion de ponctuations, des disfluences, etc . Les
relatives difficult&#233;s d&#8217;analyse concernant le langage de sp&#233;cialit&#233; (M&#233;dical), tendent &#224; prouver
qu&#8217;il poss&#232;de des tournures propres. &#192; noter que, pour les constituants, les r&#233;sultats fournis
par Cordial, qui annote plus de 10 000 mots par seconde, sont tr&#232;s voisins du taux de
concordance entre des annotateurs humains, annotant quelques mots par minute.
</p>
<p>Une analyse des erreurs commises par type de constituants montre que les principales erreurs
sont li&#233;es &#224; la confusion entre adjectif et participe pass&#233; ainsi qu'&#224; de mauvais raccordements
de groupes nominaux soit vers d'autres groupes nominaux soit vers des verbes.
</p>
<p>En ce qui concerne les relations, les corpus les plus difficiles &#224; analyser par Cordial sont l&#8217;Oral,
les Mails et la Litt&#233;raire, ce qui n&#8217;est gu&#232;re surprenant. En effet, la difficult&#233; d&#8217;identifier de
mani&#232;re pr&#233;cise les constituants dans les phrases pour les corpus Oral et Mail implique un fort</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'analyseur syntaxique Cordial dans Passage
</p>
<p>taux d&#8217;erreurs lors de l&#8217;analyse des relations dans ces corpus. En outre, les phrases longues et
complexes dans certaines &#339;uvres litt&#233;raires, du XVIIIe ou du XIXe si&#232;cle, complexifient la
t&#226;che d&#8217;analyse. Notons aussi que lors des &#233;valuations, tant sur le corpus de d&#233;veloppement
que sur celui de test, si Cordial est arriv&#233; second en analyse de relations, par contre le syst&#232;me
class&#233; premier n&#8217;&#233;tait pas le m&#234;me.
</p>
<p>Les r&#233;sultats par relation sont les suivants :
</p>
<p>Pr&#233;cision Rappel F-mesure Pr&#233;cision Rappel F-mesure
SUJ_V 0,83 0,85 0,84 MOD_N 0,75 0,71 0,73
AUX_V 0,97 0,96 0,97 MOD_A 0,72 0,49 0,58
COD_V 0,68 0,66 0,67 MOD_R 0,43 0,57 0,49
CPL_V 0,57 0,63 0,60 MOD_P 0,00 0,00 0,00
MOD_V 0,61 0,46 0,52 COORD 0,55 0,46 0,50
COMP 0,65 0,53 0,58 APPOS 0,08 0,10 0,09
ATB_SO 0,52 0,52 0,52 JUXT 0,18 0,14 0,16
</p>
<p>Figure 3 : r&#233;sultats par relation de la pr&#233;-campagne Passage (arrondis &#224; 2 d&#233;cimales)
</p>
<p>Par rapport aux autres participants de cette pr&#233;-&#233;valuation, notre classement pour les
diff&#233;rentes relations est le suivant :
</p>
<p>- 1er pour Suj-V, Aux-V, Comp, Mod-A et Coord
- 2nd pour Cod-V, Cpl-V, Mod-V, Atb-So, Mod-N et Appos
- 3e pour Mod-R et Juxt
</p>
<p>On notera que pour la relation Sujet-Verbe, qui demeure la plus importante tant pour la
correction grammaticale que pour l'analyse s&#233;mantique de la phrase, notre score est excellent,
d'autant que le meilleur de nos concurrents sur cette relation obtient 0,785583 de f-mesure.
Pour la relation COD-verbe notre score est un peu inf&#233;rieur au premier syst&#232;me qui obtient
0,687386 et pour la relation attribut du sujet, notre score est un peu plus &#233;loign&#233; du premier de
nos concurrents qui obtient 0,595890. Si l'on prend en compte les relations les plus
importantes (sujet-verbe, auxiliaire-verbe, attribut du sujet, cod-verbe), notre syst&#232;me a les
meilleurs r&#233;sultats globaux.
</p>
<p>5 Conclusion
Toutes les bases th&#233;oriques et conceptuelles de cet analyseur ont &#233;t&#233; pos&#233;es en 1990 et 1991.
Pr&#232;s de vingt ans plus tard, elles ne semblent pas devoir &#234;tre remises en cause et les
d&#233;veloppements r&#233;cents effectu&#233;s sur la langue anglaise nous ont montr&#233; que ces postulats
pouvant s'appliquer &#224; d'autres langues avec des r&#233;sultats comparables, m&#234;me si les ressources
linguistiques cr&#233;&#233;es pour l'anglais ne sont pas encore au niveau de celles cr&#233;&#233;es pour le
fran&#231;ais.
</p>
<p>Cordial est un analyseur &#224; approche essentiellement statistique et probabiliste, m&#234;me s'il utilise
quelques r&#232;gles pour la d&#233;sambigu&#239;sation grammaticale et surtout de tr&#232;s nombreuses r&#232;gles
pour la correction grammaticale. Les r&#232;gles les plus importantes sont souvent des r&#232;gles
implicites, comme le fait qu'&#224; un verbe ne saurait correspondre qu'un seul attribut ou un seul
COD au maximum. Ces r&#232;gles sont de fait induites par le code, qui n'accepte pas d'&#233;tiqueter
plus d'un attribut ou d'un COD par verbe !</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dominique Laurent, Sophie N&#232;gre, Patrick S&#233;gu&#233;la
</p>
<p>Cordial est un analyseur syntaxique d'une grande robustesse et d'une extr&#234;me rapidit&#233;, deux
qualit&#233;s capitales pour une exploitation industrielle. &#192; la base de nombreux composants
linguistiques, il constitue une brique de base de haut niveau, autorisant des traitements
s&#233;mantiques en profondeur. Ses r&#233;sultats, lors des r&#233;centes &#233;valuations, montrent clairement sa
sup&#233;riorit&#233; en d&#233;tection des constituants et en d&#233;tection des relations s&#233;mantiquement fortes. Il
reste toutefois perfectible et nous travaillons constamment &#224; l'am&#233;liorer.
</p>
<p>R&#233;f&#233;rences
BENZITOUN C., VERONIS J. (2005) &#171; Probl&#232;mes d&#8217;annotation d&#8217;un corpus oral dans le cadre de
la campagne EASY &#187;, Actes des Ateliers de la 12e Conf&#233;rence annuelle sur le Traitement
Automatique des Langues Naturelles (TALN 2005).
</p>
<p>DE LA CLERGERIE &#201;. (2007) &#171; PASSAGE, Produire des Annotations Syntaxiques &#224; Grande
&#201;chelle &#187;, Grand Colloque STIC 2007.
</p>
<p>DE LA CLERGERIE &#201;., HAMON T., MOSTEFA D., AYACHE C., PAROUBEK P., VILNAT A. (2008),
&#171; PASSAGE: from French Parser Evaluation to Large Sized Treebank &#187; Proceedings of
LREC, Marrakech, 28-30 mai 2008
</p>
<p>HAMON O., POPESCU-BELIS A., CHOUKRI K., DABBADIE M., HARTLEY A., MUSTAFA EL HADI
W., RAJMAN M., TIMIMI I. (2006) &#171; CESTA: First Conclusions of the Technolangue MT
Evaluation Campaign &#187;, Proceedings of the 5th International Conference on Language
Resources and Evaluation.
</p>
<p>LAURENT D., NEGRE S. (2006). Cordial, le TAL et les aides &#224; la r&#233;daction. Journ&#233;es de
l'ATALA, Paris, 3 juin 2006.
</p>
<p>MAKHOUL J., KUBALA F., SCHWARTZ R. AND WEISCHEDEL R. (1999) &#171; Performance measures
for information extraction &#187;, Proceedings of DARPA Broadcast News Workshop.
</p>
<p>PAROUBEK P., ROBBA I., VILNAT A., POUILLOT L.-G. (2005) &#171; Easy : Campagne d&#8217;&#233;valuation
des analyseurs syntaxiques &#187;, Actes des Ateliers de la 12e Conf&#233;rence annuelle sur le
Traitement Automatique des Langues Naturelles (TALN 2005).
</p>
<p>PAROUBEK P, ROBBA I, VILNAT A., AYACHE C. (2006) &#171; Data, Annotations and Measures in
EASY - the Evaluation Campaign for Parsers of French &#187;, In proceedings of the fifth
international conference on Language Resources and Evaluation (LREC 2006).
</p>
<p>PAROUBEK P., VINAT A., ROBBA I., AYACHE C. (2007). Les r&#233;sultats de la campagne Easy
d'&#233;valuation des analyseurs syntaxiques du fran&#231;ais. TALN Toulouse
</p>
<p>PAROUBEK P., ROBBA I., VINAT A. (2008). EASY : La campagne d'&#233;valuation des analyseurs
syntaxiques.in &quot;L'&#233;valuation des technologies de traitement de la langue&quot;, IC2, Herm&#232;s,
Lavoisier, 2008, p. 117-140.
</p>
<p>VERONIS J. (1998). Annotation automatique de corpus : &#233;tat de la technique, Colloque
International &quot;Questions de m&#233;thode dans la linguistique de corpus&quot; Perpignan (France), p. 7-
9.</p>

</div></div>
</body></html>