<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La plate-forme Glozz : environnement d&#8217;annotation et d&#8217;exploration de corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>La plate-forme Glozz :
environnement d&#8217;annotation et d&#8217;exploration de corpus
</p>
<p>Antoine Widl&#246;cher Yann Mathet
Laboratoire GREYC, CNRS UMR 6072, Universit&#233; de Caen
</p>
<p>{antoine.widlocher,yann.mathet}@info.unicaen.fr
</p>
<p>R&#233;sum&#233;. La n&#233;cessit&#233; d&#8217;une interaction syst&#233;matique entre mod&#232;les, traitements et corpus
impose la disponibilit&#233; d&#8217;annotations de r&#233;f&#233;rence auxquelles mod&#232;les et traitements pourront
&#234;tre confront&#233;s. Or l&#8217;&#233;tablissement de telles annotations requiert un cadre formel permettant
la repr&#233;sentation d&#8217;objets linguistiques vari&#233;s, et des applications permettant &#224; l&#8217;annotateur de
localiser sur corpus et de caract&#233;riser les occurrences des ph&#233;nom&#232;nes observ&#233;s. Si diff&#233;rents
outils d&#8217;annotation ont vu le jour, ils demeurent souvent fortement li&#233;s &#224; un mod&#232;le th&#233;orique et
&#224; des objets linguistiques particuliers, et ne permettent que marginalement d&#8217;explorer certaines
structures plus r&#233;cemment appr&#233;hend&#233;es exp&#233;rimentalement, notamment &#224; granularit&#233; &#233;lev&#233;e et
en mati&#232;re d&#8217;analyse du discours. La plate-forme Glozz r&#233;pond &#224; ces diff&#233;rentes contraintes et
propose un environnement d&#8217;exploration de corpus et d&#8217;annotation fortement configurable et
non limit&#233; a priori au contexte discursif dans lequel elle a initialement vu le jour.
</p>
<p>Abstract. The need for a systematic confrontation between models and corpora make it
necessary to have - and consequently, to produce - reference annotations to which linguistic
models could be compared. Creating such annotations requires both a formal framework which
copes with various linguistic objects, and specific manual annotation tools, in order to make it
possible to locate, identify and feature linguistic phenomena in texts. Though several annotation
tools do already exist, they are mostly dedicated to a given theory and to a given set of structures.
The Glozz platform, described in this paper, tries to address all of these needs, and provides a
highly versatile corpus exploration and annotation framework.
</p>
<p>Mots-cl&#233;s : Linguistique de corpus, Annotation, Plate-forme logicielle.
</p>
<p>Keywords: Corpus Linguistics, Annotation, Software Framework.
</p>
<p>1 Introduction
</p>
<p>De plus en plus de travaux en linguistique, en linguistique computationnelle et en Traitement
Automatique des Langues manifestent un int&#233;r&#234;t croissant pour les &#233;tudes sur corpus. &#192; travers
une importante diversit&#233; d&#8217;approches, la n&#233;cessit&#233; d&#8217;une interaction syst&#233;matique entre mod&#232;les,
traitements et corpus rend n&#233;cessaire la disponibilit&#233; - et donc l&#8217;&#233;tablissement - d&#8217;annotations de
r&#233;f&#233;rence auxquelles les mod&#232;les et les traitements pourront &#234;tre confront&#233;s, pour leur &#233;labora-
tion ou pour leur &#233;valuation. Or la mise en place de telles annotations est un processus complexe
qui requiert &#224; la fois un cadre formel permettant la repr&#233;sentation d&#8217;objets linguistiques vari&#233;s,
et des applications d&#233;di&#233;es &#224; l&#8217;annotation manuelle proprement dite, permettant &#224; l&#8217;annotateur
de localiser sur corpus et de caract&#233;riser les occurrences du ph&#233;nom&#232;ne observ&#233;. Or, si diff&#233;-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher, Yann Mathet
</p>
<p>rents outils d&#8217;annotation ont cons&#233;quemment vu le jour, il convient de remarquer, d&#8217;une part
qu&#8217;ils demeurent souvent fortement li&#233;s &#224; un mod&#232;le th&#233;orique et &#224; des objets linguistiques par-
ticuliers, et d&#8217;autre part qu&#8217;ils ne permettent que marginalement d&#8217;explorer certaines structures
plus r&#233;cemment appr&#233;hend&#233;es exp&#233;rimentalement, notamment &#224; granularit&#233; &#233;lev&#233;e et en mati&#232;re
d&#8217;analyse du discours.
</p>
<p>La plate-forme Glozz r&#233;pond &#224; ces diff&#233;rentes contraintes et propose un environnement d&#8217;ex-
ploration et d&#8217;annotation de corpus fortement configurable et non limit&#233; a priori au contexte
discursif dans lequel elle a initialement vu le jour. Dans la pr&#233;sente introduction, nous pr&#233;cise-
rons les &#233;l&#233;ments essentiels devant &#234;tre pris en compte pour l&#8217;&#233;tablissement d&#8217;un environnement
adapt&#233; &#224; l&#8217;exploration et &#224; l&#8217;annotation de corpus, dans des contextes th&#233;oriques vari&#233;s, et utili-
sable notamment en analyse du discours. Nous montrerons alors que les outils disponibles dans
la communaut&#233; ne satisfont pas pleinement les exigences ainsi mises au jour. Dans une seconde
partie, nous mettrons en lumi&#232;re certains des principes fondamentaux auxquels la plate-forme
Glozz est adoss&#233;e avant d&#8217;exposer, dans un troisi&#232;me temps, les modalit&#233;s de sa mise en &#339;uvre.
Dans une derni&#232;re partie, nous pr&#233;senterons les campagnes d&#8217;annotation initi&#233;es &#224; l&#8217;aide de cet
environnement, et indiquerons certaines des orientations de nos d&#233;veloppements actuels.
</p>
<p>1.1 Probl&#233;matique
</p>
<p>La mise en place de la plate-forme d&#8217;annotation que nous pr&#233;sentons ici trouve son origine
dans le projet ANR Annodis (P&#233;ry-Woodley et al., 2009), qui vise notamment la mise en place
d&#8217;un corpus de r&#233;f&#233;rence en mati&#232;re d&#8217;analyse du discours. Cependant, si la plate-forme r&#233;-
pond cons&#233;quemment &#224; certaines contraintes propres &#224; ce niveau d&#8217;analyse, elle a d&#8217;embl&#233;e &#233;t&#233;
con&#231;ue pour ne pas s&#8217;y limiter. De cette double exigence - d&#8217;utilisabilit&#233; au niveau discours et
de g&#233;n&#233;ricit&#233; - il ressort en particulier la n&#233;cessit&#233; de prendre en compte les &#233;l&#233;ments suivants.
</p>
<p>Il importe tout d&#8217;abord de pouvoir annoter des objets linguistiques appartenant &#224; des cat&#233;gories
structurelles vari&#233;es, dont l&#8217;organisation discursive fait distinctement usage. Ainsi, il sera certes
n&#233;cessaire de pouvoir d&#233;limiter des segments textuels (ensembles de sous-unit&#233;s cons&#233;cutives)
tels que mots et syntagmes, mais &#233;galement indispensable de rendre compte de l&#8217;organisation
relationnelle op&#233;rant sur diff&#233;rents plans (relations syntaxiques, rh&#233;toriques, de cor&#233;f&#233;rence...).
</p>
<p>D&#8217;autre part, nous ne souhaitons pas limiter l&#8217;annotation &#224; une &#233;chelle particuli&#232;re, mais per-
mettre au contraire la prise en compte de ph&#233;nom&#232;nes linguistiques op&#233;rant &#224; des niveaux vari&#233;s
pouvant aller du local (caract&#232;res, mots, syntagmes...) au macroscopique (paragraphes, seg-
ments, sections...). Notons &#224; cet &#233;gard que l&#8217;annotation discursive exige doublement une telle
souplesse, d&#8217;une part parce que les ph&#233;nom&#232;nes de cet ordre sont observables &#224; diff&#233;rentes
&#233;chelles, et d&#8217;autre part parce qu&#8217;ils reposent sur des m&#233;canismes indiciaires impliquant des
objets op&#233;rant &#224; diff&#233;rents niveaux (connecteurs de discours, expressions indicatives, unit&#233;s ar-
gumentatives...), que l&#8217;on souhaitera &#233;galement annoter.
</p>
<p>La contrainte de g&#233;n&#233;ricit&#233; impose par ailleurs que l&#8217;environnement d&#8217;annotation utilis&#233; ne
repose pas sur un mod&#232;le d&#8217;annotation limit&#233; &#224; certains types d&#8217;objets linguistiques ou &#224; un
mod&#232;le th&#233;orique particulier. Il est toutefois n&#233;cessaire d&#8217;encadrer une campagne d&#8217;annotation
en d&#233;finissant les objets identifiables et en contraignant les caract&#233;risations qui devront en &#234;tre
donn&#233;es. Aussi, l&#8217;environnement d&#8217;annotation devra pouvoir &#234;tre param&#233;tr&#233; par un mod&#232;le d&#8217;an-
notation, par rapport auquel il demeurera fondamentalement abstrait, gr&#226;ce &#224; l&#8217;utilisation d&#8217;un
m&#233;ta-mod&#232;le articulant des cat&#233;gories structurelles suffisamment g&#233;n&#233;riques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La plate-forme Glozz
</p>
<p>De plus, il conviendra de maximiser l&#8217;expressivit&#233; dudit m&#233;ta-mod&#232;le, en int&#233;grant notamment
la possibilit&#233; de faire cohabiter des &#171; couches &#187; d&#8217;annotation mutliples pouvant provenir d&#8217;ori-
gines diverses et porter sur des zones identiques, en autorisant chevauchement et imbrication
entre les annotations, et en pr&#233;voyant des configurations &#171; topologiques &#187; assez peu classiques,
mais fr&#233;quentes au niveau discours, qui permettront par exemple de rendre compte de l&#8217;incerti-
tude sur la position des bornes d&#8217;un segment.
</p>
<p>Aux objets identifi&#233;s, on souhaitera associer des caract&#233;risations permettant de repr&#233;senter for-
mellement leur statut linguistique ou l&#8217;information pertinente (cat&#233;gorie morphologique, valeur
s&#233;mantique...) dont ils sont porteurs. On distinguera ainsi le marquage proprement dit (locali-
sation d&#8217;un objet dans le texte), et cette caract&#233;risation, l&#8217;ensemble constituant l&#8217;annotation.
</p>
<p>Annoter un corpus, c&#8217;est aussi assur&#233;ment prendre en consid&#233;ration l&#8217;information dont il est
d&#233;j&#224; porteur. Il est certes indispensable d&#8217;acc&#233;der &#224; son contenu textuel brut, mais aussi &#224; des
indications additionnelles pouvant r&#233;sulter de sa structuration typo-dispositionnelle ou d&#8217;un trai-
tement pr&#233;alable, manuel ou automatique, ayant permis d&#8217;identifier des &#233;l&#233;ments qui pourront
jouer le r&#244;le d&#8217;&#171; indices &#187; dans la phase d&#8217;annotation.
</p>
<p>Enfin, le processus d&#8217;annotation requiert &#233;videmment la possibilit&#233; d&#8217;explorer le corpus, en
qu&#234;te des indications pouvant r&#233;v&#233;ler l&#8217;occurrence d&#8217;un ph&#233;nom&#232;ne &#233;tudi&#233;. Cela suppose en
particulier la possibilit&#233; de mettre en &#233;vidence l&#8217;information indiciaire pertinente et de mas-
quer celle qui demeure insignifiante, pour une t&#226;che donn&#233;e. Cela rend &#233;galement n&#233;cessaire
la disponibilit&#233; de vues vari&#233;es sur le texte annot&#233;, qui r&#233;v&#233;leront les configurations indiciaires
(visualisation in situ, concordanciers, repr&#233;sentation arborescente, indications statistiques...).
D&#8217;autre part, la navigation dans le corpus devra s&#8217;appuyer sur des outils de recherche permet-
tant d&#8217;acc&#233;der rapidement &#224; des zones textuelles porteuses des indications attendues.
</p>
<p>1.2 &#201;tat de l&#8217;art
</p>
<p>Diff&#233;rentes &#233;tudes et manifestations scientifiques r&#233;v&#232;lent l&#8217;importance de la question de l&#8217;anno-
tation pour les communaut&#233;s scientifiques auxquelles nous appartenons. &#201;voquons par exemple
la tenue de l&#8217;atelier XBRAC (Witt et al., 2004), et diff&#233;rentes tentatives de synth&#232;se telles
que (Dipper et al., 2004) auxquelles il a donn&#233; lieu. Plus directement li&#233;s aux probl&#233;matiques
propres &#224; l&#8217;analyse du discours, les travaux pr&#233;sent&#233;s &#224; l&#8217;occasion de (Webber &amp; Bryon, 2004)
mettent &#233;galement la question de l&#8217;annotation au premier plan.
</p>
<p>Faisant face &#224; la n&#233;cessit&#233; d&#8217;&#233;tablir des corpus de r&#233;f&#233;rence, divers travaux ont d&#8217;ores et d&#233;j&#224;
permis la mise en place de m&#233;thodes et d&#8217;environnements logiciels permettant l&#8217;exploration
et l&#8217;annotation manuelle des corpus. La plate-forme GATE (Cunningham et al., 2002), bien
connue de la communaut&#233; en tant qu&#8217;environnement de traitement automatique, int&#232;gre ainsi un
module d&#8217;annotation manuelle. Au rang de ses avantages, on &#233;voquera sa forte int&#233;gration dans
l&#8217;environnement d&#8217;exp&#233;rimentation, ainsi que la possibilit&#233; de guider l&#8217;annotation en d&#233;finissant
des sch&#233;mas d&#8217;annotation. Au rang des limites, on notera que l&#8217;outil est prioritairement destin&#233; &#224;
la d&#233;limitation d&#8217;unit&#233;s textuelles, l&#8217;annotation de relations ne pouvant faire l&#8217;objet d&#8217;une saisie
&#171; graphique &#187;. De plus, l&#8217;ergonomie de l&#8217;outil et les modalit&#233;s de visualisation manifestent un
clair privil&#232;ge &#224; l&#8217;annotation d&#8217;objets relativement locaux, &#224; l&#8217;&#233;chelle du mot ou du syntagme.
</p>
<p>Ouvertement d&#233;di&#233; &#224; l&#8217;annotation manuelle, Wordfreak (Morton &amp; LaCivita, 2003) accorde &#233;ga-
lement un net privil&#232;ge &#224; l&#8217;annotation d&#8217;objets locaux et r&#233;v&#232;le &#233;galement une faible int&#233;gration
de la notion de relation, dont la repr&#233;sentation se limite &#224; des jeux d&#8217;identifiants. On appr&#233;ciera</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher, Yann Mathet
</p>
<p>toutefois la variabilit&#233; des vues possibles sur le texte (repr&#233;sentation au fil du texte, concordan-
cier, repr&#233;sentation arborescente...). L&#8217;absence d&#8217;&#233;volution r&#233;cente de cet outil prometteur pose
cependant avec force la question de sa p&#233;rennit&#233;.
</p>
<p>Notons &#233;galement l&#8217;existence d&#8217;un plugin pour l&#8217;environnement Prot&#233;g&#233;1 d&#233;di&#233; &#224; l&#8217;annotation
manuelle (Ogren, 2006). B&#233;n&#233;ficiant de la puissance de Prot&#233;g&#233; pour l&#8217;&#233;dition et la manipulation
d&#8217;ontologies, Knowtator permet l&#8217;&#233;laboration de sch&#233;mas d&#8217;annotation complexes adoss&#233;s &#224; de
telles ontologies. Explicitement d&#233;di&#233; au traitement de l&#8217;information biom&#233;dicale, cet outil se
limite, lui aussi, &#224; l&#8217;annotation d&#8217;unit&#233;s locales, et s&#8217;av&#232;re donc peu utile pour l&#8217;annotation
d&#8217;objets macroscopiques et/ou de relations.
</p>
<p>Int&#233;grant clairement la notion de relation, MMAX (M&#252;ller &amp; Strube, 2001) propose un environ-
nement graphique et un mod&#232;le d&#8217;annotation g&#233;n&#233;riques et configurables permettant, en th&#233;orie,
une annotation multi-&#233;chelle. Il permet la d&#233;limitation de segments, la sp&#233;cification de relations,
et l&#8217;association d&#8217;attributs aux objets marqu&#233;s, le tout pouvant &#234;tre r&#233;alis&#233; graphiquement, sur
la base d&#8217;un sch&#233;ma d&#8217;annotation d&#233;fini par l&#8217;utilisateur. On notera toutefois que les modalit&#233;s
d&#8217;annotation et de repr&#233;sentation rendent difficile l&#8217;annotation &#224; des &#233;chelles macroscopiques.
Certes, des relations peuvent &#234;tre tiss&#233;es entre des objets assez fortement distants - c&#8217;est no-
tamment le cas des cha&#238;nes cor&#233;f&#233;rentielles, qui ont &#233;t&#233; particuli&#232;rement explor&#233;es &#224; l&#8217;aide de
MMAX -, mais ces objets demeurent en eux-m&#234;mes pr&#233;f&#233;rentiellement locaux et peu embo&#238;t&#233;s.
</p>
<p>Fortement li&#233;, lui aussi, &#224; la probl&#233;matique sp&#233;cifique de l&#8217;annotation des cha&#238;nes de cor&#233;-
f&#233;rence, PALinkA (Ora&#774;san, 2003) reprend et g&#233;n&#233;ralise certains principes d&#233;j&#224; utilis&#233;s dans
CLinkA (Ora&#774;san, 2000). Alors que ce dernier &#233;tait irr&#233;ductiblement li&#233; &#224; la question de la co-
r&#233;f&#233;rence, PALinkA autorise la d&#233;finition, par l&#8217;utilisateur, d&#8217;un sch&#233;ma d&#8217;annotation. Il permet
de plus la prise en compte d&#8217;annotations pr&#233;existantes, de diff&#233;rentes natures. S&#8217;il a effective-
ment fait l&#8217;objet d&#8217;utilisations sur des ph&#233;nom&#232;nes linguistiques vari&#233;s, reste que les relations ne
donnent pas lieu &#224; une visualisation graphique ad&#233;quate, et que les segments reli&#233;s demeurent
in&#233;vitablement locaux, faute, l&#224; encore, de repr&#233;sentations idoines.
</p>
<p>UAM Corpus Tool2, h&#233;ritier de Systemic Coder et initialement d&#233;di&#233; &#224; la linguistique syst&#233;-
mique, offre un environnement d&#8217;annotation ais&#233;ment configurable. Il permet &#224; l&#8217;utilisateur de
d&#233;finir des sch&#233;mas d&#8217;annotation hi&#233;rarchiques complexes qui orienteront les phases ult&#233;rieures
d&#8217;annotation. On appreciera la disponibilit&#233; d&#8217;outils statistiques fort utiles pour l&#8217;exploration de
corpus. Sa plus grande faiblesse, du point de vue qui nous occupe ici, est l&#8217;impossibilit&#233; d&#8217;an-
noter des relations. D&#8217;autre part, les modalit&#233;s d&#8217;annotation et de visualisation des segments
rendent certes possible la d&#233;limitation d&#8217;unit&#233;s macroscopiques embo&#238;t&#233;es ou se chevauchant,
mais en exposant l&#8217;utilisateur &#224; d&#8217;importantes difficult&#233;s de lecture et d&#8217;interpr&#233;tation.
</p>
<p>Int&#233;gralement d&#233;di&#233; au mod&#232;le th&#233;orique de la Rhetorical Structure Theory, RSTTool (O&#8217;Don-
nell, 2000) permet bien entendu l&#8217;annotation des relations, qui sont au c&#339;ur de cette th&#233;orie. Il
permet en outre la segmentation du texte en unit&#233;s qui consitueront les termes de ces relations.
Il s&#8217;appuie toutefois exclusivement sur un mod&#232;le d&#8217;annotation et une repr&#233;sentation graphique
arborescente, conformes &#224; la th&#233;orie et au formalisme RST, qui le rendent pour ainsi dire inuti-
lisable dans une autre perspective th&#233;orique.
</p>
<p>De la confrontation entre ces diff&#233;rents travaux et outils et les exigences pr&#233;sent&#233;es auparavant,
il ressort distinctement que ces derni&#232;res ne sont pas pleinement satisfaites, et que la mise en
place d&#8217;un nouvel environnement est justifi&#233;e et souhaitable.
</p>
<p>1http://protege.stanford.edu.
2http://www.wagsoft.com/CorpusTool/.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La plate-forme Glozz
</p>
<p>2 Principes fondamentaux
</p>
<p>La plate-forme Glozz repose essentiellement sur les principes suivants, qui visent &#224; la fois &#224;
garantir sa g&#233;n&#233;ricit&#233; et &#224; permettre l&#8217;annotation d&#8217;objets linguistiques, en particulier discursifs,
difficiles &#224; manipuler avec les outils existants.
</p>
<p>&#192; la n&#233;cessit&#233; de prendre en charge des configurations structurellement vari&#233;es, la plate-forme
r&#233;pond en s&#8217;appuyant sur un m&#233;ta-mod&#232;le g&#233;n&#233;rique de l&#8217;organisation du discours, issu de
(Widl&#246;cher, 2008). Ce m&#233;ta-mod&#232;le repose sur l&#8217;articulation entre les notions d&#8217;unit&#233;, de re-
lation et de sch&#233;ma, dont l&#8217;hyperonyme commun est le concept d&#8217;&#233;l&#233;ment. Par unit&#233;, nous
d&#233;signons, par simplification, une s&#233;quence d&#8217;&#233;l&#233;ments textuels adjacents, sans pr&#233;suppos&#233;
d&#8217;&#233;chelle. Mots, syntagmes, propositions, paragraphes, unit&#233;s th&#233;matiques ou document r&#233;-
pondent &#224; cette d&#233;finition. Par relation, nous d&#233;signons, par simplification, un rapport binaire
entre deux unit&#233;s, sans pr&#233;suppos&#233; d&#8217;ordre ou de distance. Relations syntaxiques, rh&#233;toriques
ou de cor&#233;f&#233;rence rel&#232;vent de cette notion. &#192; ces cat&#233;gories classiques, nous ajoutons la notion
de sch&#233;ma, qui d&#233;signe une configuration textuelle complexe r&#233;currente impliquant unit&#233;s et
relations, dont la structure &#233;num&#233;rative, compos&#233;e d&#8217;une amorce, d&#8217;items et de relations hyper-
onymiques entre amorce et items est un exemple. Ce m&#233;ta-mod&#232;le autorise &#233;galement l&#8217;asso-
ciation, &#224; chaque instance de l&#8217;une ou l&#8217;autre de ces cat&#233;gories, d&#8217;une caract&#233;risation exprim&#233;e
par un type et une repr&#233;sentation symbolique, sous forme d&#8217;une structure de traits.
</p>
<p>Glozz repose sur ce m&#233;ta-mod&#232;le et ne fait aucune hypoth&#232;se a priori sur la nature linguistique
des objets qui seront effectivement annot&#233;s, qui devront simplement pouvoir &#234;tre rapport&#233;s &#224;
l&#8217;un ou l&#8217;autre de ces types d&#8217;&#233;l&#233;ments. La sp&#233;cification du mod&#232;le linguistique particulier pour
lequel on souhaite produire une annotation repose sur la d&#233;finition d&#8217;un mod&#232;le d&#8217;annotation,
pouvant param&#233;trer l&#8217;application et guider l&#8217;annotateur, mais par rapport auquel elle demeure
fondamentalement abstraite. Pouvant &#234;tre d&#233;crit de mani&#232;re d&#233;clarative (cf. infra), un tel mod&#232;le
d&#8217;annotation d&#233;finit notamment, pour chaque cat&#233;gorie structurelle (unit&#233;, relation et sch&#233;ma),
les types qui pourront faire l&#8217;objet d&#8217;une annotation, en pr&#233;cisant, pour chacun, le format des
repr&#233;sentations symboliques qui en seront donn&#233;es.
</p>
<p>Il est important de pr&#233;ciser que, du point de vue de l&#8217;environnement d&#8217;annotation, rien n&#8217;existe
hors de ce m&#233;ta-mod&#232;le abstrait et de ses r&#233;alisations particuli&#232;res. Du point de vue de Glozz,
&#171; tout est annotation &#187; ; toute information utilisable doit pouvoir &#234;tre exprim&#233;e dans les termes
du m&#233;ta-mod&#232;le. Cela vaut, &#233;videmment, pour tous les objets qui seront annot&#233;s par son tru-
chement. Mais c&#8217;est &#233;galement vrai de toutes les informations pouvant r&#233;sulter d&#8217;un traitement
pr&#233;alable, manuel ou automatique, ainsi que des indications typo-dispositionnelles (structura-
tion en sections, paragraphes...) qui ne font pas davantage l&#8217;objet d&#8217;un traitement ad hoc. Il en
r&#233;sulte en particulier que les diff&#233;rents objets pourront &#234;tre manipul&#233;s et observ&#233;s de mani&#232;re
uniforme, quelle qu&#8217;en soit la nature.
</p>
<p>Nous insistons d&#8217;autre part sur le fait qu&#8217;une information adjointe au corpus n&#8217;y est pas rendue,
ipso facto, fatalement observable. Elle doit &#234;tre consid&#233;r&#233;e comme principalement &#171; dispo-
nible &#187;, sa visibilit&#233; n&#8217;&#233;tant rendue effective qu&#8217;&#224; la faveur de la sp&#233;cification d&#8217;un point de vue
sur le texte, sp&#233;cification indissolublement li&#233;e &#224; une t&#226;che d&#8217;annotation particuli&#232;re, qui, seule,
rend les informations disponibles signifiantes et leur observabilit&#233; cons&#233;quemment opportune.
</p>
<p>Enfin, Glozz repose sur une annotation d&#233;port&#233;e (stand-off ). La localisation des unit&#233;s renvoie
&#224; la position de leurs bornes dans le texte et celle des relations et des sch&#233;mas repose sur la
r&#233;f&#233;rence aux identifiants des constituants impliqu&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher, Yann Mathet
</p>
<p>3 R&#233;alisation
</p>
<p>12
3
</p>
<p>6
</p>
<p>4
</p>
<p>5
</p>
<p>7
</p>
<p>FIG. 1 &#8211; Interface principale de Glozz
</p>
<p>3.1 G&#233;n&#233;ricit&#233;, m&#233;ta-mod&#232;le et mod&#232;le d&#8217;annotation
</p>
<p>La plate-forme Glozz peut &#234;tre adapt&#233;e &#224; un mod&#232;le d&#8217;annotation quelconque, pour peu que
ce dernier puisse se conformer au m&#233;ta-mod&#232;le dont nous avons fait &#233;tat dans la partie pr&#233;c&#233;-
dente : pour une campagne d&#8217;annotation donn&#233;e, la premi&#232;re t&#226;che consiste &#224; d&#233;finir les unit&#233;s,
les relations et les &#233;ventuels sch&#233;mas que l&#8217;on souhaite manipuler. La d&#233;finition de ce mod&#232;le
se fait de mani&#232;re d&#233;clarative, conform&#233;ment &#224; un sch&#233;ma XML relativement simple, compre-
nant notamment les &#233;l&#233;ments units, relations et schemas, qui permettent de d&#233;finir les
diff&#233;rentes cat&#233;gories d&#8217;objets disponibles, ainsi que le format de la structure de traits attendue
pour chacune d&#8217;entre elles. &#192; titre d&#8217;exemple, la d&#233;finition d&#8217;un mod&#232;le d&#8217;annotation utilisable
en mati&#232;re argumentative pourrait ressembler &#224; ceci :
</p>
<p>&lt;annotationModel&gt;
&lt;units&gt;
</p>
<p>&lt;type name=&quot;Introduction&quot;&gt;
&lt; featureSet &gt;
</p>
<p>&lt; feature name=&quot;scope&quot;&gt;&lt;value type=&quot;free&quot; default=&quot;section &quot; /&gt;&lt;/ feature &gt;
&lt; feature name=&quot;document&#8722;boundary&quot;&gt;&lt;value type=&quot;boolean&quot; default=&quot;false&quot; /&gt;&lt;/feature&gt;
&lt; feature name=&quot;main&#8722;topic&quot;&gt;&lt;value type=&quot;free&quot; default=&quot;&quot; /&gt;&lt;/ feature &gt;
</p>
<p>&lt;/ featureSet &gt;
&lt;/type&gt;
&lt;type name=&quot;Conclusion&quot;&gt; [...] &lt;/type&gt;
[...]
</p>
<p>&lt;/ units &gt;
[...]
</p>
<p>&lt;annotationModel&gt;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La plate-forme Glozz
</p>
<p>Deux cat&#233;gories d&#8217;unit&#233;s, Introduction et Conclusion, sont d&#233;finies. Les instances de la premi&#232;re
cat&#233;gorie poss&#232;deront les traits scope, document-boundary et main-topic. Certains de ces traits
se voient attribuer une valeur par d&#233;faut telle que section pour le trait scope ou false pour le trait
document-boundary. Parmi les diff&#233;rents types de valeurs possibles, qui permettront d&#8217;adapter
les masques de saisie offerts &#224; l&#8217;annotateur, citons free pour le texte libre, boolean pour les
valeurs bool&#233;ennes, enum pour les ensembles finis de valeurs possibles, ou encore int pour les
valeurs enti&#232;res. La suite du document d&#233;crit les types de cat&#233;gories et les structures de traits at-
tendues pour les relations et les sch&#233;mas. L&#8217;&#233;criture de ce descripteur XML se fait actuellement
de fa&#231;on manuelle, mais une interface graphique d&#8217;&#233;dition est en cours de r&#233;alisation.
</p>
<p>Une fois charg&#233; dans la plate-forme, le mod&#232;le d&#8217;annotation appara&#238;t en zone (5) (cf. figure
1), sous forme de listes de cat&#233;gories. L&#8217;annotateur dispose alors d&#8217;une palette de types, et
peut annoter le texte selon le paradigme impos&#233; par ce mod&#232;le. La zone (4) fait appara&#238;tre la
caract&#233;risation de l&#8217;objet annot&#233; s&#233;lectionn&#233;, et en permet l&#8217;&#233;dition.
</p>
<p>3.2 Acc&#232;s multi-&#233;chelle au contenu textuel
</p>
<p>Le processus d&#8217;annotation nous conduit &#224; consid&#233;rer le texte &#224; diff&#233;rentes &#233;chelles, et ce pour
au moins deux raisons. La premi&#232;re concerne la navigation : il est essentiel de disposer d&#8217;une
vision synth&#233;tique (&#224; grande &#233;chelle) du texte, permettant un acc&#232;s rapide aux zones porteuses
d&#8217;indices, dont le d&#233;tail doit pouvoir &#234;tre explor&#233; &#224; une &#233;chelle plus restreinte. La seconde
raison, plus fondamentale, renvoie &#224; la fois &#224; la granularit&#233; des ph&#233;nom&#232;nes observ&#233;s et au
processus m&#234;me d&#8217;annotation, qui requiert souvent un point de vue et un grain de visualisation
particuliers, pour qu&#8217;&#233;mergent les &#233;l&#233;ments signifiants. Par exemple, si une relation de contraste
peut appara&#238;tre &#224; un grain assez fin, entre deux propositions, elle peut aussi se manifester &#224; un
niveau macroscopique, entre le premier et le dernier paragraphe du texte, qui devront pouvoir
&#234;tre appr&#233;hend&#233;s d&#8217;un m&#234;me regard. Glozz propose donc une vue double et simultan&#233;e sur le
texte. La vue principale, en zone (1), permet la lecture du texte et la saisie d&#8217;annotations. Une
seconde vue, nomm&#233;e &#171; ruban &#187; et situ&#233;e en zone (2), propose une vue globale du corpus,
simplifiant la navigation entre ses diff&#233;rentes zones, et au sein de laquelle les indices annot&#233;s
disponibles pourront &#234;tre rapidement identifi&#233;s, gr&#226;ce aux param&#232;tres de repr&#233;sentation visuelle
fix&#233;s par la feuille de style (cf. infra). Les vues locale et macroscopique peuvent &#234;tre utilis&#233;es
conjointement. Si l&#8217;on souhaite par exemple &#233;tablir une relation entre deux unit&#233;s distantes, on
pourra rep&#233;rer les deux unit&#233;s en zone (2), et les s&#233;lectionner pr&#233;cis&#233;ment en zone (1).
</p>
<p>3.3 Annotation visuelle
</p>
<p>Glozz propose diff&#233;rents outils permettant de voir, mais aussi de cr&#233;er directement sur le texte, &#224;
la souris, les diff&#233;rents types d&#8217;annotations. Les unit&#233;s apparaissent sous forme de blocs color&#233;s,
conform&#233;ment &#224; la feuille de style choisie (cf. infra), encadrant la zone textuelle d&#233;limit&#233;e.
L&#8217;une des forces de la plate-forme est d&#8217;autoriser chevauchement et imbrication entre unit&#233;s
et d&#8217;en proposer un rendu visuel : lorsqu&#8217;une unit&#233; est comprise dans une autre, le cadre qui
la repr&#233;sente se trouve graphiquement embo&#238;t&#233; dans le cadre mat&#233;rialisant l&#8217;unit&#233; englobante.
De ce fait, m&#234;me en pr&#233;sence d&#8217;un fort taux d&#8217;imbrication, les unit&#233;s restent toujours visibles
et accessibles. Les relations apparaissent pour leur part sous forme de lignes trac&#233;es entre les
unit&#233;s reli&#233;es, dont la couleur est donn&#233;e, ici encore, par la feuille de style utilis&#233;e. Enfin, les
sch&#233;mas sont repr&#233;sent&#233;s par un sur-encadrement des unit&#233;s et relations qui les composent.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher, Yann Mathet
</p>
<p>Une palette pr&#233;sente en zone (3) permet de choisir un mode d&#8217;action parmi cr&#233;ation ou &#233;dition
d&#8217;unit&#233;s, de relations, ou de sch&#233;mas. Une fois le mode s&#233;lectionn&#233;, le travail s&#8217;effectue princi-
palement en zone (1), les zones (5) et (4) offrant pour leur part un aper&#231;u actualis&#233; et &#233;ditable
des types de cat&#233;gories et des structures de traits. Un mode &#171; glue note &#187; permet l&#8217;adjonction
de commentaires en texte libre, positionn&#233;s dans le texte et ancr&#233;s visuellement &#224; l&#8217;aide d&#8217;un
drapeau.
</p>
<p>3.4 Repr&#233;sentation formelle des annotations
</p>
<p>Parall&#232;lement &#224; cette &#233;dition graphique, une repr&#233;sentation de tous les objets annot&#233;s par des
expressions formelles d&#8217;inspiration logique, proche des notations utilis&#233;es par exemple en RST
ou en SDRT, est donn&#233;e en zone (6). Dans cette notation, un &#233;l&#233;ment est ancr&#233; dans le texte, soit
par la position de ses bornes (dans le cas des unit&#233;s), soit par les identifiants de ses termes ou
constituants (dans le cas des relations et des sch&#233;mas). Ainsi, une relation d&#8217;&#233;laboration entre
les unit&#233;s d&#8217;identifiants respectifs 2 et 4 sera not&#233;e par exemple r_Elaboration(2,4). Ce
second paradigme s&#8217;av&#232;re plus adapt&#233; et plus rapide pour certaines t&#226;ches d&#8217;annotation (cr&#233;ation
de sch&#233;mas, annotation &#224; un niveau tr&#232;s local...). Par ailleurs, m&#234;me quand l&#8217;&#233;dition graphique
est pr&#233;f&#233;r&#233;e, il est souvent utile de disposer de la liste des objets cr&#233;&#233;s, tri&#233;s par type ou par date
de cr&#233;ation, liste permettant du reste de naviguer, dans le texte, entre ces objets. Une ligne de
commande permet la saisie directe de ces expressions, qui se traduit par la cr&#233;ation de l&#8217;objet
textuel correspondant. Cette saisie est contrainte par une compl&#233;tion automatique supervis&#233;e,
qui interdit l&#8217;expression d&#8217;une formule inconsistante. La plate-forme permet l&#8217;utilisation simul-
tan&#233;e des deux paradigmes de cr&#233;ation et de visualisation, graphique et formel.
</p>
<p>3.5 Outils de recherche avanc&#233;e
</p>
<p>Deux moteurs de recherche sont int&#233;gr&#233;s &#224; la plate-forme, en zone (6), l&#8217;un portant sur le
contenu textuel, l&#8217;autre sur les annotations. Le premier fonctionne en mode plein texte, les
diff&#233;rentes occurrences d&#8217;une suite de caract&#232;res &#233;tant recherch&#233;es. Il est de plus possible de
restreindre la recherche &#224; des contextes particuliers, en sp&#233;cifiant le type des unit&#233;s d&#233;limitant
ces contextes, unit&#233;s choisies parmi les annotations disponibles. Par exemple, on pourra recher-
cher la s&#233;quence &#171; amertume &#187; dans des passages annot&#233;s en tant qu&#8217;Introductions. L&#8217;outil de
recherche d&#8217;unit&#233;s s&#8217;appuie pour sa part exclusivement sur les annotations disponibles et permet
de naviguer entre les objets d&#8217;un certain type. La port&#233;e de la recherche peut &#234;tre restreinte en
fixant des valeurs auxquelles les structures de traits des unit&#233;s recherch&#233;es devront se confor-
mer. On pourra ainsi, par exemple, naviguer entre les unit&#233;s de type Introduction dont l&#8217;attribut
main-topic poss&#232;de la valeur amertume.
</p>
<p>3.6 D&#233;finition d&#8217;un point de vue sur le texte
</p>
<p>Le processus d&#8217;annotation &#233;tant souvent incr&#233;mental, au sens o&#249; une certaine &#233;tape d&#8217;annota-
tion s&#8217;appuie non seulement sur le texte, mais aussi sur les annotations d&#233;j&#224; produites, il est
int&#233;ressant de pouvoir param&#233;trer la repr&#233;sentation de ces derni&#232;res, pour mettre en lumi&#232;re les
informations pertinentes pour une t&#226;che d&#8217;annotation donn&#233;e et occulter les autres. Ce r&#233;glage
de la vue doit du reste pouvoir &#234;tre modifi&#233; &#224; tout moment, les diff&#233;rentes phases d&#8217;annotation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La plate-forme Glozz
</p>
<p>pouvant n&#233;cessiter de faire varier le point de vue sur le mat&#233;riau textuel. Glozz propose deux
outils compl&#233;mentaires de configuration du rendu visuel. L&#8217;&#233;diteur de style, en zone (7), permet
de choisir la couleur de chaque type d&#8217;unit&#233; et de relation, et permet par ailleurs de d&#233;termi-
ner, pour chacun d&#8217;entre eux, si ses occurrences sont visibles ou non. D&#8217;autre part, le s&#233;lecteur
de profondeur, disponible en zone (6), permet de r&#233;gler les niveaux d&#8217;imbrication minimal et
maximal des unit&#233;s que l&#8217;on souhaite visualiser. Par exemple, en r&#233;glant ces seuils respective-
ment sur 2 et 3, on ne voit que les unit&#233;s qui sont doublement ou triplement imbriqu&#233;es. Ce
r&#233;glage s&#8217;av&#232;re particuli&#232;rement utile dans les zones de texte fortement embo&#238;t&#233;es, afin de ne
plus r&#233;v&#233;ler que certaines unit&#233;s localement pertinentes, pour un grain d&#8217;imbrication donn&#233;.
</p>
<p>4 Exploitation et perspectives
</p>
<p>La conception de Glozz a d&#233;but&#233; en janvier 2008, et son d&#233;veloppement &#224; l&#8217;&#233;t&#233; 2008. La plate-
forme est arriv&#233;e &#224; un niveau de maturit&#233; et de stabilit&#233; suffisants pour &#234;tre d&#8217;ores et d&#233;j&#224; exploi-
t&#233;e. Comme il a &#233;t&#233; dit, son &#233;laboration a &#233;t&#233; initi&#233;e dans le cadre du projet ANR Annodis, pour
faire face &#224; l&#8217;absence d&#8217;outils r&#233;pondant &#224; son cahier des charges3. Ce projet implique linguistes
et informaticiens, et a pour particularit&#233; de proc&#233;der &#224; une annotation discursive &#224; des niveaux
de granularit&#233; tr&#232;s vari&#233;s. C&#8217;est donc une mise &#224; l&#8217;&#233;preuve tant th&#233;orique que pratique qui a com-
menc&#233; d&#232;s le mois de d&#233;cembre 2008, et qui implique d&#233;sormais une vingtaine de chercheurs
dans une phase d&#8217;annotation manuelle d&#233;but&#233;e en mars 2009. Insistons sur le fait que l&#8217;outil est
exploit&#233; non seulement par des utilisateurs aux profils diff&#233;rents (linguistes et informaticiens),
mais aussi selon deux approches radicalement diff&#233;rentes, l&#8217;une, ascendante, partant d&#8217;unit&#233;s de
grain fin, et l&#8217;autre, descendante, partant de structures discursives de haut niveau. Glozz semble
r&#233;pondre aux attentes des deux approches, au sein d&#8217;une m&#234;me plate-forme, et permettra donc
&#224; ces deux derni&#232;res de converger dans un corpus conjointement annot&#233;.
</p>
<p>&#201;tant con&#231;u autour d&#8217;un m&#233;ta-mod&#232;le &#224; vocation g&#233;n&#233;rique, Glozz devrait cependant trouver
un usage dans des t&#226;ches d&#8217;annotations tr&#232;s diverses, &#224; diff&#233;rents niveaux de granularit&#233; et au-
del&#224; du projet Annodis. Citons par exemple l&#8217;annotation de structures temporelles it&#233;ratives,
r&#233;cemment initi&#233;e dans le cadre d&#8217;un projet caennais, ou encore l&#8217;annotation d&#8217;expressions &#233;va-
luatives, envisag&#233;e dans le cadre d&#8217;un projet consacr&#233; &#224; la veille d&#8217;opinon.
</p>
<p>Cependant, nombre d&#8217;am&#233;liorations et d&#8217;&#233;volutions sont pr&#233;vues, qui devraient n&#233;cessiter en-
core six &#224; douze mois de d&#233;veloppement dans un premier temps. En premier lieu, le mod&#232;le
de relation actuellement impl&#233;ment&#233; est une simplification de notre mod&#232;le th&#233;orique ne per-
mettant de mettre en relation que deux unit&#233;s. Les d&#233;veloppements actuels visent &#224; en faire
une impl&#233;mentation compl&#232;te qui d&#233;cuplera le pouvoir expressif de la plate-forme, en permet-
tant de mettre r&#233;cursivement en relation, non plus seulement les unit&#233;s, mais tous les types
d&#8217;&#233;l&#233;ments (unit&#233;s, relations et sch&#233;mas). Si cela r&#233;pond &#224; un besoin exprim&#233; par les linguistes
travaillant dans le cadre de la SDRT, ce gain en expressivit&#233; sera &#233;galement important pour
d&#8217;autres approches th&#233;oriques. En second lieu, les deux paradigmes d&#8217;appr&#233;hension des anno-
tations actuellement pr&#233;sents dans Glozz sont le texte graphiquement annot&#233; d&#8217;une part et la
repr&#233;sentation formelle des annotations d&#8217;autre part. Un troisi&#232;me paradigme, reposant sur une
repr&#233;sentation sous forme de graphe, viendra bient&#244;t enrichir la plate-forme, pour permettre une
&#233;dition des annotations conforme aux notations habituellement utilis&#233;es dans certaines th&#233;ories
</p>
<p>3Pour une pr&#233;sentation pr&#233;cise des objectifs de ce projet et de l&#8217;utilisation de Glozz dans son contexte particu-
lier, on pourra se reporter &#224; (P&#233;ry-Woodley et al., 2009).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher, Yann Mathet
</p>
<p>(RST, SDRT...). Certes, d&#8217;autres outils proposent d&#233;j&#224; une telle repr&#233;sentation, mais sa d&#233;cli-
naison dans Glozz b&#233;n&#233;ficiera d&#8217;un triple avantage. Tout d&#8217;abord il sera possible d&#8217;exploiter
conjointement ces trois paradigmes compl&#233;mentaires de repr&#233;sentation, en fonction des ph&#233;-
nom&#232;nes observ&#233;s. De plus, cette repr&#233;sentation sera toujours bas&#233;e sur une s&#233;lection faite par
l&#8217;annotateur et non sur la totalit&#233; du texte, ce qui permettra d&#8217;obtenir des graphes ais&#233;ment
interpr&#233;tables. Enfin, le travail d&#8217;annotation effectu&#233; dans l&#8217;un des paradigmes sera toujours
r&#233;percut&#233; dans les autres.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CUNNINGHAM H., MAYNARD D., BONTCHEVA K. &amp; TABLAN V. (2002). GATE : A Fra-
mework and Graphical Development Environment for Robust NLP Tools and Applications. In
Proceedings of the 40th Meeting of the Association for Computational Linguistics, p. 168&#8211;175,
Philadelphia, USA.
DIPPER S., G&#214;TZE M. &amp; SETDE M. (2004). Simple annotation tools for complex annotation
tasks : an evaluation. In (Witt et al., 2004).
MORTON T. &amp; LACIVITA J. (2003). WordFreak : An Open Tool for Linguistic Annotation.
In Proceedings of Human Language Technology (HLT) and North American Chapter of the
Association for Computational Linguistics (NAACL), p. 17&#8211;18, Edmonton, Canada.
M&#220;LLER C. &amp; STRUBE M. (2001). MMAX : A tool for the annotation of multi-modal cor-
pora. In Proceedings of the 2nd IJCAI Workshop on Knowledge and Reasoning in Practical
Dialogue Systems, Seattle, WA, Etats-Unis.
O&#8217;DONNELL M. (2000). RSTTool 2.4 &#8211; A Markup Tool for Rhetorical Structure Theory. In
Proceedings of the International Natural Language Generation Conference (INLG&#8217;2000), p.
253 &#8211; 256, Mitzpe Ramon, Israel.
OGREN P. V. (2006). Knowtator : A Prot&#233;g&#233; plug-in for annotated corpus construction. In
Proceedings of Human Language Technology (HLT) and North American Chapter of the As-
sociation for Computational Linguistics (NAACL), New-York, &#201;tats-Unis.
ORA&#774;SAN C. (2000). CLinkA a coreferential links annotator. In Proceedings of LREC&#8217;2000,
p. 491&#8211;496, Athens, Greece.
ORA&#774;SAN C. (2003). PALinkA : a highly customizable tool for discourse annotation. In
Proceedings of the 4th SIGdial Workshop on Discourse and Dialog, p. 39&#8211;43, Sapporo, Japan.
P&#201;RY-WOODLEY M.-P., ASHER N., ENJALBERT P., BENAMARA F., BRAS M., FABRE C.,
FERRARI S., HO-DAC L.-M., LE DRAOULEC A., MATHET Y., MULLER P., PR&#201;VOT L.,
REBEYROLLE J., TANGUY L., VERGEZ-COURET M., VIEU L. &amp; WIDL&#214;CHER A. (2009).
ANNODIS : une approche outill&#233;e de l&#8217;annotation de structures discursives. In Actes de la
16e Conf&#233;rence Traitement Automatique des Langues Naturelles (TALN&#8217;09), session poster,
Senlis, France.
B. WEBBER &amp; D. BRYON, Eds. (2004). Proc. of the ACL 2004 Workshop on Discourse
Annotation., Barcelone, Espagne.
WIDL&#214;CHER A. (2008). Analyse macro-s&#233;mantique des structures rh&#233;toriques du discours -
Cadre th&#233;orique et mod&#232;le op&#233;ratoire. PhD thesis, Universit&#233; de Caen Basse-Normandie.
A. WITT, U. HEID, H. S. THOMPSON, J. CARLETTA &amp; P. WITTENBURG, Eds. (2004).
Workshop on XML-based richly annotated corpora (XBRAC), Lisbonne, Portugal. Conf&#233;rence
LREC 2004.</p>

</div></div>
</body></html>