<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Proposition de caract&#233;risation et de typage des expressions temporelles en contexte</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Proposition de caract&#233;risation et de typage des expressions
temporelles en contexte
</p>
<p>Maud Ehrmann, Caroline Hag&#232;ge
Xerox Research Center Europe - XRCE
6, Chemin de Maupertuis, 38240 Meylan
</p>
<p>{Maud.Ehrmann, Caroline.Hagege}@xrce.xerox.com
</p>
<p>R&#233;sum&#233;. Nous assistons actuellement en TAL &#224; un regain d&#8217;int&#233;r&#234;t pour le traitement de
la temporalit&#233; v&#233;hicul&#233;e par les textes. Dans cet article, nous pr&#233;sentons une proposition de ca-
ract&#233;risation et de typage des expressions temporelles tenant compte des travaux effectu&#233;s dans
ce domaine tout en cherchant &#224; pallier les manques et incompl&#233;tudes de certains de ces travaux.
Nous explicitons comment nous nous situons par rapport &#224; l&#8217;existant et les raisons pour lesquelles
parfois nous nous en d&#233;marquons. Le typage que nous d&#233;finissons met en &#233;vidence de r&#233;elles
diff&#233;rences dans l&#8217;interpr&#233;tation et le mode de r&#233;solution r&#233;f&#233;rentielle d&#8217;expressions qui, en sur-
face, paraissent similaires ou identiques. Nous proposons un ensemble des crit&#232;res objectifs et
linguistiquement motiv&#233;s permettant de reconna&#238;tre, de segmenter et de typer ces expressions.
Nous verrons que cela ne peut se r&#233;aliser sans consid&#233;rer les proc&#232;s auxquels ces expressions sont
associ&#233;es et un contexte parfois &#233;loign&#233;.
</p>
<p>Abstract. Temporal processing in texts is a topic of renewed interest in NLP. In this paper
we present a new way of typing temporal expressions that takes into account both the state of
the art of this domain and that also tries to be more precise and accurate that some of the current
proposals. We explain into what extent our proposal is compatible and comparable with the state-
of-the art and why sometimes we stray from it. The typing system that we define highlights real
differences in the interpretation and reference calculus of these expressions. At the same time,
by offering objective criteria, it fulfils the necessity of high inter-agreement between annotators.
After having defined what we consider as temporal expressions, we will show that tokenization,
characterization and typing of those expressions can only be done having into account processes
to which these expressions are linked.
</p>
<p>Mots-cl&#233;s : Temporalit&#233;, typage et caract&#233;risation des expressions temporelles.
</p>
<p>Keywords : temporal processing, temporal expressions characterization and typing.
</p>
<p>1 Introduction
</p>
<p>Le travail que nous pr&#233;sentons s&#8217;inscrit dans la perspective de l&#8217;analyse temporelle des textes, qui
comprend g&#233;n&#233;ralement les &#233;tapes suivantes :
</p>
<p>&#8211; reconnaissance et caract&#233;risation des expressions temporelles
&#8211; r&#233;solution r&#233;f&#233;rentielle et normalisation des expressions temporelles
&#8211; reconnaissance des &#233;v&#233;nements (avec temps et aspect associ&#233;)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maud Ehrmann, Caroline Hag&#232;ge
</p>
<p>&#8211; mise en relation &#233;v&#233;nement-expressions temporelles ou &#233;v&#233;nement-&#233;v&#233;nement
&#8211; inf&#233;rence temporelle
</p>
<p>La d&#233;finition de ces &#233;tapes est arbitraire et, si elle s&#8217;av&#232;re utile pour structurer nos discours sur
l&#8217;analyse temporelle, il importe d&#8217;avoir &#224; l&#8217;esprit le fait qu&#8217;elles sont n&#233;cessairement interd&#233;pen-
dantes. Nous adh&#233;rons &#224; la position de (Gosselin, 1996) qui indique que &#8220; ... les marques tempo-
relles et aspectuelles se r&#233;partissent sur divers &#233;l&#233;ments de l&#8217;&#233;nonc&#233; (le verbe, le temps verbal,
les compl&#233;ments du verbe, les circonstanciels, les constructions syntaxiques etc.) qui paraissent
interagir les uns avec les autres de telle sorte que la valeur de certains marqueurs semble ne pou-
voir &#234;tre fix&#233;e ind&#233;pendamment du calcul global de la valeur du tout &#8221;. Dans notre proposition,
nous nous int&#233;ressons seulement &#224; la premi&#232;re des t&#226;ches mentionn&#233;es ci-dessus, tout en gardant
&#224; l&#8217;esprit qu&#8217;elle ne peut pas &#234;tre dissoci&#233;e des autres.
</p>
<p>Plusieurs travaux de TAL s&#8217;int&#233;ressent au traitement de la temporalit&#233; dans les textes. On citera la
r&#233;f&#233;rence que constitue la norme TimeML (Saur&#237; et al., 2006), laquelle propose un ensemble d&#8217;an-
notations des expressions temporelles et des proc&#232;s. Cette norme est actuellement adapt&#233;e pour le
fran&#231;ais (Bittar, 2008) et plus ou moins fid&#232;lement observ&#233;e dans plusieurs travaux pour le traite-
ment automatique de la temporalit&#233;, parmi lesquels (Parent et al., 2008) pour le fran&#231;ais et, pour
l&#8217;anglais, (Hag&#232;ge &amp; Tannier, 2008) ainsi que d&#8217;autres syst&#232;mes ayant particip&#233; &#224; la campagne
TempEval1. (Battistelli et al., 2006) se distingue de cette mouvance TimeML en proposant une
caract&#233;risation fine d&#8217;une sous-classe d&#8217;expressions temporelles du fran&#231;ais (les expressions ca-
lendaires) &#224; l&#8217;aide d&#8217;op&#233;rateurs. Cette approche appara&#238;t comme compl&#233;mentaire de celle adopt&#233;e
dans TimeML puisque, d&#8217;une part, elle n&#8217;envisage qu&#8217;un sous-ensemble des expressions tempo-
relles et que, d&#8217;autre part, elle compl&#233;mente et pr&#233;cise, pour ce sous-ensemble, le typage de plus
haut niveau propos&#233; par TimeML. Il s&#8217;av&#232;re cependant que de nombreuses difficult&#233;s persistent
relativement &#224; la d&#233;limitation et au typage des expressions temporelles. Dans cet article, nous pro-
posons un syst&#232;me de typage des expressions temporelles (ET dans la suite du document) visant
&#224; pallier certains probl&#232;mes que nous avons pu relever dans la norme existante (TimeML), tout en
cherchant &#224; rester compatible avec les travaux actuellement men&#233;s dans le domaine.
</p>
<p>Dans la premi&#232;re section, nous pr&#233;sentons les principaux &#233;l&#233;ments ayant motiv&#233;s notre travail
ainsi que nos objectifs. Nous d&#233;taillons ensuite notre d&#233;finition et notre typage des ET. Le typage
propos&#233; a pour objectif du contribuer au projet plus ambitieux de la mise en place d&#8217;un syst&#232;me
d&#8217;annotation automatique de la chronologie des proc&#232;s apparaissant dans les textes. Nous verrons
qu&#8217;un des points clefs de notre travail de caract&#233;risation est que celle-ci ne peut se faire sans une
prise en compte d&#8217;un contexte parfois &#233;tendu.
</p>
<p>2 Motivations et objectifs
</p>
<p>Deux points essentiellement motivent notre proposition de caract&#233;risation et de typage des ET.
Le premier est relatif au fait qu&#8217;il est, en pratique, souvent difficile de typer des expressions
temporelles. En effet, si des expressions comme le 15 janvier 2008, mardi prochain ou encore
pendant 2 jours sont consid&#233;r&#233;es sans grande discussion comme des dates (pour les deux premiers)
et une dur&#233;e, il en est d&#8217;autres plus difficiles &#224; typer, comme dans les exemples suivants (en gras) :
</p>
<p>(1) Pendant ces quelques jours, Lyon vit aux couleurs du Sirha, grand messe de la Gastrono-
mie !
</p>
<p>1http://timeml.org/tempeval</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Proposition de aract&#233;risation et de typage des expressions temporelles en contexte
</p>
<p>(2) L&#8217;entr&#233;e &#233;ventuelle de la Turquie dans l&#8217;UE, c&#8217;est au moins dans quinze ans.
(3) Le matin, il prend son petit-d&#233;jeuner et part travailler.
</p>
<p>Dans bien des cas, les expressions temporelles demandent, pour leur caract&#233;risation, la connais-
sance d&#8217;un contexte allant bien au-del&#224; de la simple expression. La solution &#224; de telles difficult&#233;s
pourrait appara&#238;tre dans les normes existantes (TimeML et TIDES) or, et c&#8217;est le deuxi&#232;me &#233;l&#233;-
ment motivant notre proposition, il est possible d&#8217;observer certaines impr&#233;cisions dans ces der-
ni&#232;res. Au regard du typage des ET tout d&#8217;abord : TimeML impose la d&#233;termination d&#8217;un type,
pouvant prendre les valeurs DATE, TIME, DURATION et SET, mais le guide ne donne pas de cri-
t&#232;res pr&#233;cis pour ce typage (Saur&#237; et al., 2006). En effet, chaque type re&#231;oit une description non
d&#233;finitoire ainsi qu&#8217;une courte liste d&#8217;exemples non contextualis&#233;s pour la plupart. Cette descrip-
tion est insuffisante pour l&#8217;annotation de cas &#8220;difficiles&#8221; trouv&#233;s dans les textes. Un autre type
d&#8217;impr&#233;cision observable dans TimeML et TIDES concerne la segmentation des ET : les ET de
type entre le 3 janvier et le 5 janvier sont segment&#233;es en deux parties (Saur&#237; et al., 2006; Ferro
et al., 2005) et, autre exemple, TIDES consid&#232;re l&#8217;expression 8 :00 pm. Friday comme un seul
segment mais l&#8217;expression at 8 :00 p.m. on Friday comme deux segments. Cela est d&#251; au fait
que ces normes ont adopt&#233; comme r&#232;gle d&#8217;or de ne pas int&#233;grer les introducteurs d&#8217;expressions
temporelles dans les ET ; nous nous distinguons de cette position (voir ci-apr&#232;s la section 3.2).
Enfin, dans TimeML, certains cas d&#8217;annotation ne font pas une distinction claire entre annotation
pour la caract&#233;risation et annotation des &#233;tapes de calculs. Par exemple, dans John left 2 days
before yesterday, une &#233;tape d&#8217;annotation interm&#233;diaire consid&#232;re 2 days comme une DUR&#201;E et
yesterday comme une DATE, avant l&#8217;adoption d&#8217;une annotation finale normalisant l&#8217;ensemble de
l&#8217;expression 2 days before yesterday sous forme d&#8217;une balise TIMEX3 vide. Ces annotations &#8220;in-
term&#233;diaires&#8221; relevant du calcul et non de la caract&#233;risation n&#8217;ont &#224; notre sens pas lieu d&#8217;&#234;tre dans
un guide d&#8217;annotation.
</p>
<p>Ces observations nous ont conduit &#224; vouloir proposer un typage des ET fond&#233; sur des crit&#232;res
rigoureux tout en restant le plus possible compatible avec les normes actuelles. Ce typage se-
rait int&#233;grable dans des campagnes d&#8217;annotation d&#8217;entit&#233;s nomm&#233;es (Ester II et HAREM2), qui
consid&#232;rent de plus en plus l&#8217;annotation des ET comme une extension naturelle de l&#8217;annotation de
la cat&#233;gorie DATE (traditionnellement pr&#233;sente dans le jeu d&#8217;&#233;tiquettes standard des entit&#233;s nom-
m&#233;es) mais dans lesquelles la complexit&#233; du travail d&#8217;annotation des ET est souvent sous-estim&#233;e.
</p>
<p>3 D&#233;finition des expressions temporelles
</p>
<p>Une ET correspond &#224; toute expression linguistique faisant r&#233;f&#233;rence &#224; une &#8220; &#233;tendue de temps &#8221; et
respectant les crit&#232;res d&#8217;indentification, de d&#233;limitation et de segmentation pr&#233;sent&#233;s ci-apr&#232;s.
</p>
<p>3.1 Crit&#232;res pour l&#8217;identification
</p>
<p>Les crit&#232;res que nous d&#233;finissons pour l&#8217;identification des ET sont les suivants : une suite linguis-
tique est une ET si elle satisfait conjointement le crit&#232;re 1, au moins un des sous-crit&#232;res list&#233;s
dans le crit&#232;re 2, et le crit&#232;re 33.
</p>
<p>2Respectivement, Evaluation des Syst&#232;mes de Transcription enrichie d&#8217;Emissions Radiophoniques (http:
//www.afcp-parole.org/ester/) et Campagne d&#8217;&#233;valuation des EN du portugais (http://www.
linguateca.pt/HAREM/).
</p>
<p>3Ces crit&#232;res sont pour partie inspir&#233;s de (Baptista et al., 2008).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maud Ehrmann, Caroline Hag&#232;ge
</p>
<p>Crit&#232;re 1 : une ET permet, en contexte, de r&#233;pondre &#224; une des questions suivantes : (prep)
Quand ?, (prep) Combien de temps ?, ou A quelle fr&#233;quence ?
</p>
<p>Crit&#232;re 2 : une ET est constitu&#233;e d&#8217;un ou d&#8217;une suite de syntagmes noyaux4. Chacun de ces
syntagmes noyaux doit contenir au minimum une des unit&#233;s lexicales list&#233;es ci-dessous et
qui fonctionnent comme t&#234;te syntaxique de ce syntagme :
</p>
<p>2. 1 : un patron num&#233;rique &#8220; temporel &#8221; caract&#233;ristique, tel que 20/02/2009 ou 8 :00 EST.
Notons qu&#8217;une partie de ce patron peut &#234;tre omis (ex : Il arrive le 3).
</p>
<p>2. 2 : une unit&#233; de mesure temporelle (seconde, jour, ann&#233;e, etc.) ou un adverbe en -ment
d&#233;riv&#233; de ces expressions (quotidiennement, mensuellement, etc.)
</p>
<p>2. 3 : un substantif nommant un &#233;l&#233;ment calendaire (lundi, mars, etc.), une saison (&#233;t&#233; etc.)
ou correspondant &#224; une f&#234;te du calendrier de r&#233;f&#233;rence (No&#235;l etc.)
</p>
<p>2. 4 : un nom d&#233;signant un moment particulier de la journ&#233;e (matin&#233;e, soir). On adjoint &#233;ga-
lement des noms g&#233;n&#233;riques de p&#233;riode temporelle comme &#233;poque, moment, instant,
etc.
</p>
<p>2. 5 : un indexical &#8220; temporel &#8221;, soit un adverbe de temps simple (non d&#233;riv&#233;) ou un nom
&#8220; situant les faits dans la dur&#233;e par rapport au moment de la parole ou un autre rep&#232;re &#8221;
(Grevisse &amp; Goosse, 1986). Par exemple, jadis, hier pour les adverbes et veille et
surlendemain pour les noms.
</p>
<p>2. 6 : un groupe pr&#233;positionnel compl&#233;ment d&#8217;un nom &#233;v&#233;nementiel form&#233; de &lt;NUM+Ntemp&gt;
(un voyage de 5 jours). Il convient d&#8217;&#234;tre attentif au caract&#232;re &#233;v&#233;nementiel du nom ;
en cas d&#8217;h&#233;sitation, nous proposons le test suivant : remplacer le groupe pr&#233;position-
nel par une subordonn&#233;e relative introduite par &#8220; qui &lt;forme du verbe durer&gt; &lt;NUM&gt;
&lt;Ntemp&gt; &#8221;. De la sorte, &#8220; 4 ans &#8221; est bien une ET dans un projet de 4 ans , mais non
dans un enfant de 4 ans (*un enfant qui a dur&#233; 4 ans).
</p>
<p>2. 7 : une expression de fr&#233;quence de type de temps en temps, quelques fois, fr&#233;quemment
et faisant r&#233;f&#233;rence &#224; une fr&#233;quence.
</p>
<p>2. 8 : une expression construite avec un pr&#233;sentatif (il y a, cela fait) et un des &#233;l&#233;ments list&#233;s
ci-dessus (il y a cinq ans)
</p>
<p>Pour chacun des points list&#233;s ci-dessus, nous avons &#233;tabli des listes ferm&#233;es issues de (Gre-
visse &amp; Goosse, 1986) et d&#8217;exemples rencontr&#233;s dans les textes. Ces listes ne sont pas don-
n&#233;es ici faute de place mais sont partie int&#233;grante d&#8217;un guide d&#8217;annotation et absolument
indispensables pour l&#8217;application de ce crit&#232;re.
</p>
<p>Crit&#232;re 3 : une ET ne peut pas se paraphraser en &#8220;l&#8217;&#233;v&#233;nement qui s&#8217;est produit (prep)+ET &#8221;. En
cas d&#8217;ambigu&#239;t&#233;, c&#8217;est la lecture &#233;v&#233;nementielle qui prime.
</p>
<p>L&#8217;association de ces trois crit&#232;res permet d&#8217;identifier de mani&#232;re pr&#233;cise un ensemble de suites
linguistiques correspondant &#224; des ET ; ces derni&#232;res se trouvent, le plus souvent, dans une posi-
tion adverbiale. Le crit&#232;re 3 permet notamment de ne pas consid&#233;rer comme ET des expressions
r&#233;pondant aux crit&#232;res 1 et 2 mais dont la r&#233;f&#233;rence est &#233;v&#233;nementielle (usage m&#233;tonymique d&#8217;une
ET en tant que nom d&#8217;&#233;v&#233;nement). Ainsi, pour les exemples suivants :
</p>
<p>(4) Apr&#232;s le 11 Septembre 2001, le Congr&#232;s am&#233;ricain a adopt&#233; plusieurs lois.
(5) Apr&#232;s les attentats du 11 Septembre 2001, le Congr&#232;s am&#233;ricain a adopt&#233; plusieurs lois.
</p>
<p>4On utilise syntagme noyau comme traduction de chunk.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Proposition de aract&#233;risation et de typage des expressions temporelles en contexte
</p>
<p>l&#8217;expression &#8220;Apr&#232;s le 11 Septembre 2001 &#8221; du premier exemple ne sera pas annot&#233;e comme ET
puisque, m&#234;me si elle respecte les crit&#232;res 1 et 2, elle est en contexte paraphrasable par Apr&#232;s
l&#8217;&#233;v&#233;nement qui s&#8217;est produit le 11 Septembre 2001. Dans le deuxi&#232;me cas, &#8220; du 11 Septembre
2001 &#8221; est annot&#233;e comme une ET : elle respecte les crit&#232;res 1, 2 et 3 (ici l&#8217;expression ne d&#233;note
pas l&#8217;&#233;v&#233;nement mais bien la date &#224; laquelle se sont produits les attentats).
</p>
<p>Nous souhaitons apporter quelques pr&#233;cisions concernant des cas potentiellement &#8220; incertains &#8221; :
&#8211; expressions g&#233;n&#233;riques : non respect du crit&#232;re 1 pour &#8220; hiver &#8221; dans L&#8217;hiver est rude dans
</p>
<p>cette r&#233;gion ; il ne s&#8217;agit pas d&#8217;une ET puisque la question permettant d&#8217;extraire l&#8217;expression &#224;
partir de l&#8217;exemple est Qu&#8217;est-ce qui est rude dans cette r&#233;gion ?
</p>
<p>&#8211; expressions fig&#233;es : en d&#233;pit du respect des crit&#232;res 1 et 2 et 3, nous choisissons de ne pas
consid&#233;rer comme ET des expressions du type l&#8217;heure du crime ou le jour du seigneur et ce
en raison de leur sens non compositionnel. Des expressions telles que l&#8217;heure du d&#233;jeuner ou
l&#8217;heure de la pause, dot&#233;es d&#8217;un sens compositionnel, sont en revanche des ET.
</p>
<p>&#8211; expressions &#233;v&#233;nementielles5 : ces expressions peuvent ou non ob&#233;ir aux crit&#232;res 1, 2 et 3.
Par exemple F&#234;te des M&#232;res ne respecte pas le crit&#232;re 2 alors que Journ&#233;e Internationale de
la Femme le respecte. Dans tous les cas cependant, ces expressions (qui correspondent &#224; des
&#233;v&#233;nements) ont la forme syntaxique NP1 prep NP2 et on peut leur appliquer le test suivant :
&#8220; expression c&#233;l&#232;bre NP2 &#8221;. (ex. &#8220; La Journ&#233;e Internationale de la Femme c&#233;l&#232;bre la femme &#8221;,
&#8220; le Bicentennaire de la R&#233;volution c&#233;l&#232;bre la R&#233;volution &#8221;, etc.) On choisit, m&#234;me si ces ex-
pressions ont une forte connotation temporelle, de ne pas les inclure dans les ET6.
</p>
<p>3.2 Crit&#232;res pour la d&#233;limitation
</p>
<p>Une fois identifi&#233;es, il importe de d&#233;limiter les ET. Pour ce qui est de la borne gauche des ET, nous
consid&#233;rons tous les d&#233;pendants syntaxiques &#224; gauche de la t&#234;te de l&#8217;ET (telle que d&#233;finie dans le
crit&#232;re 2 section 3.1) comme faisant partie int&#233;grante de l&#8217;ET. Ce choix est diff&#233;rent de ce qui est
pratiqu&#233; dans TimeML. Il nous semble en effet important de conserver des informations capitales
concernant aussi bien le typage des ET (il y a trois ans vs. pendant trois ans) que le calcul de la
r&#233;f&#233;rence temporelle (ce lundi vs. le lundi). Cela permet par ailleurs de dissocier le probl&#232;me de
l&#8217;analyse syntaxique (avec notamment la difficile analyse des rattachements pr&#233;positionnels) de
celui de l&#8217;analyse des ET. Ainsi, dans la phrases suivantes, l&#8217;ET est constitu&#233;e de la suite en gras :
</p>
<p>(6) Depuis bient&#244;t plus d&#8217;un an, les d&#233;bats autour de la classification d&#8217;&#226;ge pour les livres
jeunesse en Angleterre ont fait rage.
</p>
<p>Cherchant &#224; conserver le plus d&#8217;information possible, cette large d&#233;limitation &#224; gauche des expres-
sions temporelles est compatible avec les travaux de (Battistelli et al., 2006). Concernant la borne
droite des ET, nous consid&#233;rons tous les d&#233;pendants &#224; droite s&#8217;il s&#8217;agit d&#8217;adjectifs, d&#8217;adverbes, de
pr&#233;positions ou de noms faisant partie des listes d&#233;finies par le crit&#232;re 2. Nous consid&#233;rons ainsi
les expressions suivantes :
</p>
<p>(7) Il part au printemps de l&#8217;ann&#233;e prochaine.
(8) Au troisi&#232;me jour de sa visite d&#8217;&#233;tat en Chine, que faut-il conclure ?7
(9) 900 passagers bloqu&#233;s 6 heures durant.
</p>
<p>5Une amorce de r&#233;flexion sur les &#8220; dates &#233;v&#233;nementielles &#8221; est presente dans (Battistelli et al., 2006). Cette ques-
tion a par ailleurs &#233;t&#233; &#233;voqu&#233;e lors de la soumission du projet ANR FilTempo lors de discussions entre les partenaires
(plus particuli&#232;rement Delphine Battistelli de MoDyCo et Xavier Tannier du Limsi).
</p>
<p>6On considerera donc La journ&#233;e de la visite du maire comme ET car le test mentionn&#233; ne peut &#234;tre appliqu&#233;.
7Notons que ce crit&#232;re de borne droite impose de consid&#233;rer seulement l&#8217;unit&#233; &#8220; l&#8217;heure &#8221; dans l&#8217;heure du d&#233;jeuner</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maud Ehrmann, Caroline Hag&#232;ge
</p>
<p>3.3 Crit&#232;res pour la segmentation des ET complexes
</p>
<p>Les crit&#232;res que nous avons adopt&#233;s pour la segmentation des ET sont introduits dans (Hag&#232;ge &amp;
Tannier, 2008). D&#233;finis pour l&#8217;anglais, ils sont, ainsi que nous avons pu le v&#233;rifier, parfaitement
applicables aux ET du fran&#231;ais. Nous les pr&#233;sentons ci-dessous et les illustrons par des exemples.
</p>
<p>Une ET complexe doit &#234;tre segment&#233;e en ETminimales si et seulement si les deux crit&#232;res suivants
sont v&#233;rifi&#233;s simultan&#233;ment :
</p>
<p>Crit&#232;re 1 (syntaxique) : toutes les combinaisons proc&#232;s-ET minimale sont valides syntaxique-
ment.
</p>
<p>Crit&#232;re 2 (s&#233;mantique) : la combinaison proc&#232;s-ET complexe implique logiquement toutes les
combinaisons proc&#232;s-ET minimale.
</p>
<p>Dans les exemples suivants, nous montrons le r&#233;sultat de l&#8217;application des crit&#232;res de segmentation
sur les ET complexes marqu&#233;es en gras.
</p>
<p>(10) Il est parti pendant deux jours avant No&#235;l.
</p>
<p>Les combinaisons Il est parti pendant deux jours et Il est parti avant No&#235;l sont toutes deux syn-
taxiquement valides (crit&#232;re 1 v&#233;rifi&#233;). Par ailleurs, si nous admettons que la valeur de v&#233;rit&#233; de
(10) est VRAI, alors les valeurs de v&#233;rit&#233; des deux combinaisons proc&#232;s-ET minimale qui sont Il
est parti pendant deux jours et Il est parti avant No&#235;l sont &#233;galement VRAI (crit&#232;re 2 est v&#233;rifi&#233;).
Dans ce contexte, nous devons donc segmenter la suite pendant deux jours avant No&#235;l en deux
ET, pendant deux jours d&#8217;une part et avant No&#235;l d&#8217;autre part. Consid&#233;rons un autre exemple :
</p>
<p>(11) Il est tomb&#233; deux jours avant No&#235;l.
</p>
<p>La combinaison *Il est tomb&#233; deux jours n&#8217;est pas syntaxiquement valide m&#234;me si Il est tomb&#233;
avant No&#235;l l&#8217;est. Le crit&#232;re 1 n&#8217;&#233;tant pas v&#233;rifi&#233;, on ne peut, dans ce contexte, segmenter l&#8217;expres-
sion. Pour illustrer l&#8217;importance de la consid&#233;ration du contexte, examinons &#224; pr&#233;sent l&#8217;exemple
suivant :
</p>
<p>(12) Il est parti deux jours avant No&#235;l.
</p>
<p>Les suites Il est parti deux jours et Il est parti avant No&#235;l sont valides syntaxiquement : ici le
crit&#232;re 1 s&#8217;applique. Le crit&#232;re 2 n&#8217;est, en revanche, pas v&#233;rifi&#233;. En effet, admettons que Il est
parti deux jours avant No&#235;l soit VRAI et consid&#233;rons ici que la phrase est paraphrasable par Il
est parti le 23 d&#233;cembre (hors de tout contexte, interpr&#233;tation privil&#233;gi&#233;e m&#234;me si une ambiguit&#233;
existe). Il est parti avant No&#235;l est alors &#233;galement VRAI, mais nous ne pouvons pas inf&#233;rer que Il
est parti deux jours soit VRAI. Nous devons donc consid&#233;rer la suite comme une et une seule ET8.
</p>
<p>4 Caract&#233;risation des ET et proposition de typage
</p>
<p>Nous proposons un ensemble de types pour caract&#233;riser les ET. Chaque type est d&#233;termin&#233; selon
des crit&#232;res pr&#233;cis que nous pensons pouvoir &#234;tre des crit&#232;res intersubjectifs. Avant de pr&#233;senter
ces types, nous souhaitons souligner deux points. Le premier est que toute ET est repr&#233;sent&#233;e
</p>
<p>ou l&#8217;heure de la pause, laquelle est ensuite analysable en fonction de l&#8217;&#233;v&#233;nement &#8220; d&#233;jeuner &#8221; ou &#8220; pause &#8221; auquel
elle se rapporte.
</p>
<p>8Notons que les expressions complexes segmentables d&#8217;apr&#232;s nos crit&#232;res correspondent aux cas o&#249; il est possible
linguistiquement d&#8217;avoir le d&#233;placement dans la phrase d&#8217;une des sous-expressions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Proposition de aract&#233;risation et de typage des expressions temporelles en contexte
</p>
<p>par un intervalle ou ensemble d&#8217;intervalles (au sens math&#233;matique) qui peuvent &#234;tre born&#233;s ou
non born&#233;s et extr&#234;mement petits. Nous pr&#233;f&#233;rons ne pas travailler &#224; la fois avec des points et
des intervalles, et ce afin de ne pas devoir pr&#233;supposer d&#8217;une granularit&#233; minimum de l&#8217;&#233;tendue
temporelle. Ainsi, il n&#8217;y a plus lieu de distinguer un type DATE d&#8217;un type HEURE ainsi que le
fait TimeML. Le second point est relatif &#224; l&#8217;objectif du typage des expressions temporelles, lequel
n&#8217;est pas consid&#233;r&#233; comme une fin en soi. Notre but est de pouvoir ordonner temporellement selon
un ordre partiel des proc&#232;s apparaissant dans les textes. Le typage des expressions temporelles
est un des &#233;l&#233;ments qui permettra de sp&#233;cifier et d&#8217;ancrer sur une ligne temporelle les proc&#232;s
auxquels elles sont rattach&#233;es. La notion d&#8217;ancrage sur le calendrier et de grandeur de l&#8217;intervalle
correspondant aux ET est donc cruciale pour nous.
</p>
<p>4.1 Typage de premier niveau
</p>
<p>Le crit&#232;re permettant de distinguer &#224; quel type une ET doit &#234;tre associ&#233;e est celui de l&#8217;ancrage
possible de cette expression dans un calendrier et du nombre d&#8217;occurrences de cet ancrage. Nous
proposons, en plus de cette notion d&#8217;ancrage, un test linguistique aidant &#224; la cat&#233;gorisation :
l&#8217;utilisation d&#8217;une interrogative form&#233;e &#224; partir du proc&#232;s auquel l&#8217;ET est rattach&#233;e et qui permet
d&#8217;extraire l&#8217;ET. Ce test des interrogatives doit &#234;tre ordonn&#233; strictement, selon l&#8217;ordre indiqu&#233; dans
le tableau 1 ci-dessous, pr&#233;sentant les diff&#233;rents types que nous consid&#233;rons.
</p>
<p>Type Repr&#233;sentation Ancrage sur ligne tempo-
relle
</p>
<p>Interrogative
</p>
<p>DATE Intervalle 1 ancrage unique (prep) Quand ?
DUR&#201;E Intervalle pas d&#8217;ancrage (prep) Combien de temps ?
FR&#201;QUENCE Ensemble d&#8217;intervalles ancrage multiple A quelle fr&#233;quence ? ou
</p>
<p>Quand ?
</p>
<p>TAB. 1 &#8211; Expressions temporelles : typage de premier niveau.
</p>
<p>DATE Le crit&#232;re principal pour d&#233;terminer si une ET est de type DATE est celui de la possibi-
lit&#233; d&#8217;ancrage de l&#8217;expression sur une ligne temporelle divis&#233;e selon un certain calendrier. Si cet
ancrage est possible et s&#8217;il est unique, alors nous avons affaire &#224; une expression de type DATE.
Sous le type de premier niveau DATE sont regroup&#233;es des expressions comme le 23 janvier 2003
mais aussi depuis 2 mois dans un contexte comme Lia est partie depuis deux mois. En effet, il
est possible, d&#8217;une part, de poser la question &#8220;Depuis quand Lia est-elle partie ? &#8221; (correspondant
&#224; la r&#233;ponse &#8220; depuis deux mois &#8221;) et, d&#8217;autre part, de placer sur un calendrier l&#8217;intervalle corres-
pondant &#224; l&#8217;ET, moyennant la connaissance du moment de l&#8217;&#233;nonciation, cet intervalle n&#8217;&#233;tant pas
born&#233; &#224; droite. Dans cette cat&#233;gorie, nous avons &#233;galement des expressions telle que entre le 2 et
le 3 janvier (Elle arrivera entre le 2 et le 3 janvier) qui, selon nos crit&#232;res de segmentation doit
&#234;tre consid&#233;r&#233;e comme une seule expression, constitue un intervalle ancrable de mani&#232;re unique
sur une ligne temporelle et peut r&#233;pondre au test de l&#8217;interrogative en (prep) Quand ?. Nous nous
distinguons donc ici clairement de l&#8217;annotation de TIDES et de TimeML sur cet exemple. Nous
consid&#233;rons &#233;galement comme DATE une expression comme toute la journ&#233;e dans le contexte du
titre du journal Lib&#233;ration du 10 f&#233;vrier 2009 suivant : Gr&#232;ve SNCF : Trafic perturb&#233; toute la
journ&#233;e. Il y a en effet ancrage de l&#8217;ET puisque toute la journ&#233;e correspond ici &#224; la date de paru-
tion du journal d&#8217;o&#249; le titre est extrait, soit le 10 f&#233;vrier 2009. Enfin, dans l&#8217;exemple il est arriv&#233; &#224;
midi, l&#8217;expression en gras est &#233;galement de type DATE car nous pensons qu&#8217;il n&#8217;y a aucune bonne</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maud Ehrmann, Caroline Hag&#232;ge
</p>
<p>raison de distinguer les ET dont la granularit&#233; serait sup&#233;rieure ou &#233;gale au jour des ET dont la
granularit&#233; serait l&#8217;heure du point de vue de la caract&#233;risation.
</p>
<p>DUR&#201;E Les ET de type DUR&#201;E sont &#233;galement repr&#233;sent&#233;es par un intervalle born&#233; au moins d&#8217;un
cot&#233;. Cependant, &#224; la diff&#233;rence des DATES, l&#8217;intervalle repr&#233;sentant l&#8217;ET n&#8217;est pas ancrable sur
une ligne de temps dans le contexte proc&#232;s-ET. Un exemple typique de dur&#233;e est &#8220; pendant deux
mois &#8221; dans Elle a travaill&#233; &#224; la Poste pendant deux mois. En effet, l&#8217;ET permet bien de d&#233;limiter
une &#8220; &#233;tendue de temps &#8221; de 2 mois, mais rien, ni dans l&#8217;expression elle-m&#234;me, ni dans le contexte
de son association avec le proc&#232;s, ne nous donne un indice pour ancrer cet intervalle sur une
ligne temporelle. Le test de l&#8217;interrogative dans ce cas prototypique est bien celui indiqu&#233; dans le
tableau, l&#8217;exemple permet en effet de r&#233;pondre &#224; la question &#8220;Combien de temps a-t-elle travaill&#233;
&#224; la Poste &#8221; mais en aucun cas &#224; la question &#8220;Quand a-t-elle travaill&#233; ? &#8221;. Autre exemple d&#8217;ET de
type DUR&#201;E :
</p>
<p>(13) Elle a &#233;t&#233; mari&#233;e trois mois.
</p>
<p>FR&#201;QUENCE Il s&#8217;agit ici d&#8217;ET qui d&#233;finissent non plus un intervalle mais un ensemble d&#8217;inter-
valles temporels, avec dans ce cas un ancrage multiple. Ainsi, &#8220; le dimanche &#8221; dans Le Dimanche
il a pour habitude de se promener dans les bois, est un cas de fr&#233;quence ; l&#8217;ET ne d&#233;finit pas
un dimanche particulier, mais bien un ensemble de dimanches. Quelques exemples d&#8217;ET de type
FR&#201;QUENCE :
</p>
<p>(14) Il va &#224; la campagne tous les week-ends.
(15) Elle assure une permanence un dimanche par mois.
</p>
<p>4.2 Typage de deuxi&#232;me niveau
</p>
<p>Au-del&#224; du typage de premier niveau pr&#233;sent&#233; ci-avant, il est possible de raffiner les types DATE
et DUR&#201;E selon le degr&#233; de pr&#233;cision de l&#8217;ancrage sur la ligne temporelle et suivant le type de
r&#233;f&#233;rence n&#233;cessaire pour le calcul de cet ancrage. Le tableau 2 synth&#233;tise les sous-types de DATE
et de DUR&#201;E que nous avons consid&#233;r&#233;s9.
</p>
<p>Les dates absolues sont des dates pour lesquelles un positionnement sur le calendrier est possible
en consid&#233;rant la seule ET en dehors de tout contexte. On estime que l&#8217;on a positionnement sur le
calendrier &#224; partir du moment o&#249; la mention de l&#8217;ann&#233;e, au moins, est pr&#233;sente dans la date. Les
dates relatives &#224; l&#8217;&#233;nonciation sont celles pour lesquelles il est n&#233;cessaire de conna&#238;tre le moment
de l&#8217;&#233;nonciation pour pouvoir les positionner sur le calendrier. Les dates relatives &#224; une r&#233;f&#233;rence
textuelle sont celles qui sont positionnables connaissant un moment de r&#233;f&#233;rence dans le texte.
Dans ce cas des dates relatives &#224; une r&#233;f&#233;rence textuelle, il est possible de distinguer deux sous-
types. Le premier correspond aux dates anaphoriques, pour lesquelles un positionnement temporel
ne sera possible que par le biais d&#8217;une situation d&#233;crite par le texte. Le second cas correspond aux
dates incompl&#232;tes. Ces dates sont des dates comprenant un &#233;l&#233;ment calendaire d&#8217;indication de
jour et/ou de mois mais pas d&#8217;ann&#233;e. Leur rep&#233;rage est &#233;galement effectu&#233; par un contexte pr&#233;sent
dans le texte. Il s&#8217;agit en g&#233;n&#233;ral d&#8217;un renvoi &#224; une autre ET mentionn&#233;e auparavant10. Enfin, les
dates ind&#233;termin&#233;es11 qui sont, en tant que dates, ancrables sur une ligne temporelle, mais avec
</p>
<p>9Nous retrouvons dans nos sous-types des notions pr&#233;sentes dans TimeML comme le type de r&#233;f&#233;rence des ex-
pressions r&#233;f&#233;rentielles. Nous compl&#233;tons TimeML en introduisant deux types de r&#233;f&#233;rence textuelle et les dates
intd&#233;termin&#233;es.
</p>
<p>10Cette distinction est pr&#233;sente dans (Gosselin, 1996).
11Nous utilisons &#233;galement ici la terminologie de Gosselin.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Proposition de aract&#233;risation et de typage des expressions temporelles en contexte
</p>
<p>Sous-type de DATE Type d&#8217;ancrage
Date absolue Directement calculable &#224; partir de l&#8217;expression. ex : Il est parti en juin
</p>
<p>2004.
Date relative &#224; l&#8217;&#233;nonciation Calculable connaissant la date du moment de l&#8217;&#233;nonciation ex : Il vien-
</p>
<p>dra demain.
Date relative &#224; r&#233;f&#233;rence
textuelle
</p>
<p>Calculable &#224; partir d&#8217;un temps de r&#233;f&#233;rence dans le texte.
dates anaphoriques le lendemain
(anaphore), le 3&#232;me jour de gr&#232;ve
(cataphore)
</p>
<p>dates incompl&#232;tes le 3 juin
</p>
<p>Dates ind&#233;termin&#233;es il y a ancrage mais il reste ind&#233;termin&#233;. ex : Un jour, elle partira.
</p>
<p>Sous-type de DUR&#201;E Valeur de l&#8217;intervalle
Dur&#233;e d&#233;termin&#233;e Valeur connue. ex : Il a travaill&#233; pendant deux heures.
Dur&#233;e ind&#233;termin&#233;e Valeur ind&#233;termin&#233;e. ex : Il a &#233;t&#233; malade pendant un certain temps.
</p>
<p>TAB. 2 &#8211; Expressions temporelles : typage de deuxi&#232;me niveau.
</p>
<p>un fort degr&#233; d&#8217;ind&#233;termination qu&#8217;aucun contexte ne peut compl&#233;ter.
</p>
<p>Nous n&#8217;avons consid&#233;r&#233; que deux sous-types de DUR&#201;E. Les dur&#233;es d&#233;termin&#233;es, pour lesquelles
on peut d&#233;terminer la longueur de l&#8217;intervalle en fonction d&#8217;une unit&#233; du calendrier, et les dur&#233;es
ind&#233;termin&#233;es, pour lesquelles la longueur de l&#8217;intervalle reste vague et ind&#233;termin&#233;e.
</p>
<p>5 Illustration et conclusion
</p>
<p>Nous illustrons la n&#233;cessit&#233; de consid&#233;rer l&#8217;ET dans son contexte pour pouvoir la caract&#233;riser
convenablement par les exemples suivants.
</p>
<p>(16) Mon fils de 28 mois a de gros coups de fatigue le matin.
(17) Un matin, il prit son balluchon et quitta la maison.
(18) L&#8217;hospitalisation a dur&#233; un matin.
(19) Le matin il avait pris son petit d&#233;jeuner dans la h&#226;te.
(20) Le matin de son d&#233;part, elle pleura toutes les larmes de son corps.
(21) Le matin est un moment propice &#224; la r&#233;flexion
</p>
<p>Le premier exemple est un cas de FR&#201;QUENCE, il y a en effet ancrage multiple (r&#233;p&#233;tition des
coups de fatigue sur la ligne du temps). En (17), il s&#8217;agit d&#8217;une DATE ind&#233;termin&#233;e : il y a bien
un ancrage unique sur la ligne du temps pour ce proc&#232;s via l&#8217;ET, cet ancrage reste vague. En (18)
nous avons une DUR&#201;E : la question ici est combien de temps ? et non quand ? et il n&#8217;y a pas
d&#8217;ancrage du proc&#232;s auquel l&#8217;ET est associ&#233;e. L&#8217;exemple suivant est un cas de DATE &#224; ref&#233;rence
textuelle anaphorique (la r&#233;f&#233;rence n&#8217;est pas explicite dans la phrase mais est donn&#233;e par un
contexte ant&#233;rieur). (20) illustre lui aussi un cas de DATE &#224; r&#233;f&#233;rence textuelle anaphorique mais,
ici, la r&#233;f&#233;rence est explicite (son d&#233;part) et il s&#8217;agit d&#8217;une cataphore. Enfin, le dernier exemple
montre un cas d&#8217;emploi g&#233;n&#233;rique de Le matin ; les questions quand ? et combien de temps ? ne
peuvent &#234;tre pos&#233;es.
</p>
<p>Les diff&#233;rentes interpr&#233;tations de ces ET qui en surface sont identiques ou tr&#232;s proches sont moti-
v&#233;es par plusieurs facteurs linguistiques comme la d&#233;termination, l&#8217;aspect verbal du proc&#232;s auquel
est associ&#233;e l&#8217;ET ou encore la s&#233;mantique lexicale du proc&#232;s. La combinaison de tous ces &#233;l&#233;ments</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maud Ehrmann, Caroline Hag&#232;ge
</p>
<p>devra &#234;tre prise en consid&#233;ration pour un traitement complet de la temporalit&#233;.
</p>
<p>Nous avons par ailleurs tent&#233; de mettre en application les directives propos&#233;es dans cet article en
les appliquant &#224; l&#8217;annotion des ET de deux textes. Le premier est une transcription manuelle de
l&#8217;oral provenant de la campagne Ester II12, le deuxi&#232;me est un article de Wikip&#233;dia relatant une
exp&#233;dition polaire. Pour ces deux textes, les deux auteurs ont annot&#233; de mani&#232;re ind&#233;pendante les
expressions temporelles selon la typologie pr&#233;sent&#233;e. Pour les deux textes, 175 expressions sont
en surface de potentielles expressions temporelles (comportent des &#233;l&#233;ments lexicaux mentionn&#233;s
dans le crit&#232;re 2 de reconnaissance des ET). Sur ces 175 expressions, 147 sont annot&#233;es comme
ET par les deux annotateurs, 11 sont annot&#233;es comme n&#8217;&#233;tant pas des ET par les deux annotateurs
(soit donc un accord dans plus de 90% des cas). 16 expressions sont annot&#233;es comme ET par les
deux parties mais avec des diff&#233;rences de type et enfin, une seule expression est annot&#233;e comme
ET par une partie et non ET par l&#8217;autre. Pour l&#8217;ensemble des cas litigieux (17 cas au total), les
deux annotateurs sont parvenues &#224; un accord apr&#232;s discussion.
</p>
<p>Pour conclure, nous pensons donc que cette proposition de caract&#233;risation et de typage permet
d&#8217;effacer certaines zones d&#8217;ombres rencontr&#233;es sur le terrain lors de l&#8217;annotation des expressions
temporelles. Elle peut &#234;tre adopt&#233;e dans le cadre de campagnes d&#8217;annotation d&#8217;entit&#233;s nomm&#233;es et
constitue un premier pas vers la t&#226;che plus ambitieuse de l&#8217;analyse automatique de la temporalit&#233;
dans les textes, &#224; laquelle nous nous sommes attel&#233;es pour le fran&#231;ais.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BAPTISTA J., HAG&#200;GE C. &amp; MAMEDE N. (2008). Proposta de anota&#231;&#227;o e normaliza&#231;&#227;o de
express&#245;es temporais da categor&#237;a TEMPO para o HAREM II. In Actes de Encontros do Segundo
HAREM, Aveiro, Portugal.
</p>
<p>BATTISTELLI D., MINEL J.-L. &amp; SCHWER S. (2006). Repr&#233;sentation des expressions calen-
daires dans les textes : vers une application &#224; la lecture assist&#233;e de biographies. Traitement
Automatique des Langues, p. 11&#8211;37.
</p>
<p>BITTAR A. (2008). Annotation des informations temporelles dans des textes en fran&#231;ais. In
Actes de RECITAL 2008, Avignon.
</p>
<p>FERRO L., GERBER L., MANI I., SUNDHEIM B. &amp; WILSON G. (2005). TIDES 2005 Standard
for the Annotation of Temporal Expressions. Rapport interne, MITRE.
</p>
<p>GOSSELIN L. (1996). S&#233;mantique de la temporalit&#233; en fran&#231;ais. Un mod&#232;le calculatoire et
cognitif du temps et de l&#8217;aspect. Louvain-la-Neuve : Duculot.
</p>
<p>GREVISSE M. &amp; GOOSSE A. (1986). Le Bon Usage. Louvain-la-Neuve : Duculot.
</p>
<p>HAG&#200;GE C. &amp; TANNIER X. (2008). XTM : A robust temporal text processor. In Actes de
CICLing 2008, Ha&#239;fa, Isra&#235;l.
</p>
<p>PARENT G., GAGNON M. &amp; MULLER P. (2008). Annotation d&#8217;expressions temporelles et
d&#8217;&#233;v&#233;nements en fran&#231;ais. In Actes de TALN, Avignon.
</p>
<p>SAUR&#205; R., LITTMAN J., KNIPPEN B., GAIZAUSKAS R., SETZER A. &amp; PUSTEJOVSKY J.
(2006). TimeML Annotation Guidelines Version 1.2.1.
</p>
<p>12http://www.afcp-parole.org/ester/</p>

</div></div>
</body></html>