<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>ANNODIS: une approche outill&#233;e de l'annotation de structures discursives</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009 
</p>
<p>ANNODIS: une approche outill&#233;e  
de l'annotation de structures discursives  
</p>
<p>Marie-Paule P&#233;ry-Woodley (1), Nicholas Asher (2), Patrice Enjalbert (3),  
Farah Benamara(2), Myriam Bras (1), C&#233;cile Fabre (1), St&#233;phane Ferrari (3),  
</p>
<p>Lydia-Mai Ho-Dac (1), Anne Le Draoulec (1), Yann Mathet (3), Philippe 
Muller (2), Laurent Pr&#233;vot (4), Josette Rebeyrolle (1), Ludovic Tanguy (1), 
</p>
<p>Marianne Vergez-Couret (1), Laure Vieu (2), Antoine Widl&#246;cher (3) 
 
</p>
<p>(1) CLLE-ERSS &#8211; Universit&#233; de Toulouse UTM  
{pery,bras,cecile.fabre,hodac,draoulec,rebeyrol,vergez}@univ-tlse2.fr 
</p>
<p>(2) IRIT &#8211; Universit&#233; de Toulouse UPS 
{asher,benamara,philippe.muller,vieu}@irit.fr 
</p>
<p>(3) GREYC &#8211; Universit&#233; de Caen 
{patrice.enjalbert,stephane.ferrari,mathet,awidloch}@info.unicaen.fr 
</p>
<p>(4) Laboratoire Parole et Langage &#8211; Universit&#233; de Provence 
laurent.prevot@lpl-aix.fr 
</p>
<p>R&#233;sum&#233;. 
Le projet ANNODIS vise la construction d&#8217;un corpus de textes annot&#233;s au niveau discursif 
ainsi que le d&#233;veloppement d'outils pour l&#8217;annotation et l&#8217;exploitation de corpus. Les 
annotations adoptent deux points de vue compl&#233;mentaires : une perspective ascendante part 
d'unit&#233;s de discours minimales pour construire des structures complexes via un jeu de 
relations de discours ; une perspective descendante aborde le texte dans son entier et se base 
sur des indices pr&#233;-identifi&#233;s pour d&#233;tecter des structures discursives de haut niveau. La 
construction du corpus est associ&#233;e &#224; la cr&#233;ation de deux interfaces : la premi&#232;re assiste 
l'annotation manuelle des relations et structures discursives en permettant une visualisation du 
marquage issu des pr&#233;traitements ; une seconde sera destin&#233;e &#224; l'exploitation des annotations. 
Nous pr&#233;sentons les mod&#232;les et protocoles d'annotation &#233;labor&#233;s pour mettre en &#339;uvre, au 
travers de l'interface d&#233;di&#233;e, la campagne d'annotation.  
</p>
<p>Abstract  
The ANNODIS project has two interconnected objectives: to produce a corpus of texts 
annotated at discourse-level, and to develop tools for corpus annotation and exploitation. Two 
sets of annotations are proposed, representing two complementary perspectives on discourse 
organisation: a bottom-up approach starting from minimal discourse units and building 
complex structures via a set of discourse relations; a top-down approach envisaging the text as 
a whole and using pre-identified cues to detect discourse macro-structures. The construction 
of the corpus goes hand in hand with the development of two interfaces: the first one supports 
manual annotation of discourse structures, and allows different views of the texts using NLP-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M-P. P&#233;ry-Woodley, N. Asher et P. Enjalbert 
</p>
<p>based pre-processing; another interface will support the exploitation of the annotations. We 
present the discourse models and annotation protocols, and the interface which embodies 
them. 
</p>
<p>Mots-cl&#233;s : 
annotation de corpus, structures de discours, interface d'annotation 
</p>
<p>Keywords:  
corpus annotation, discourse structures, annotation tools 
</p>
<p>1. ANNODIS : annotation discursive de corpus 
Le projet ANNODIS1 vise la constitution d&#8217;un corpus de fran&#231;ais &#233;crit enrichi d&#8217;annotations 
concernant le niveau discursif. Tout en se situant dans le sillage de projets d&#8217;annotation de 
relations et structures de discours existants pour l&#8217;anglais &#8211; e.g. Penn Discourse Treebank 
(Prasad et al., 2006) &#8211; il s&#8217;en d&#233;marque sur plusieurs points : sa principale originalit&#233; est 
d&#8217;aborder l&#8217;organisation discursive &#224; partir de deux approches compl&#233;mentaires &#8211; ascendante 
et descendante (macro-structures) ; deuxi&#232;mement, les annotations s&#8217;appliquent &#224; un corpus 
diversifi&#233; pour permettre la prise en compte de r&#233;alisations discursives vari&#233;es ; ce corpus fait 
l&#8217;objet de pr&#233;traitements automatiques pour guider les annotations ; enfin, le d&#233;veloppement 
d&#8217;outils d&#8217;aide &#224; l&#8217;annotation et &#224; la navigation constitue un objectif majeur du projet.  
Les sections 2 et 3 pr&#233;sentent les deux points de vue th&#233;oriques et les choix m&#233;thodologiques 
sur lesquels se fondent les annotations ascendantes et descendantes respectivement. La section 
4 est consacr&#233;e &#224; l&#8217;interface, au c&#339;ur du dispositif puisqu&#8217;elle donne corps aux deux mod&#232;les 
d&#8217;annotation, et permettra leur mise en relation.  
</p>
<p>2. Annoter des relations de discours : l&#8217;approche ascendante 
</p>
<p>Le point de vue &#171; ascendant &#187; s&#8217;inscrit dans le cadre des th&#233;ories du discours qui s'attachent &#224; 
construire une structure compl&#232;te d'un discours, essentiellement vu comme un ensemble 
d'unit&#233;s &#233;l&#233;mentaires reli&#233;es par des relations de coh&#233;rence (dites rh&#233;toriques). Cette vision 
th&#233;orique du discours rassemble principalement les travaux de la RST (Mann et Thompson, 
1987), la LDM (Polanyi et al., 2004 ; Wolf et Gibson, 2005), DLTAG (Forbes et al, 2003), le 
PDTB cit&#233; ci-dessus, et la SDRT de (Asher et Lascarides, 2003), qui a servi de point de d&#233;part 
&#224; cette partie du projet. Les relations de coh&#233;rence consid&#233;r&#233;es se divisent g&#233;n&#233;ralement en 
plusieurs groupes (causalit&#233;, structuration, discours rapport&#233;, &#233;laboration, etc.). La plupart de 
ces th&#233;ories permettent de d&#233;finir des structures hi&#233;rarchiques en cr&#233;ant des segments 
complexes &#224; partir de segments &#233;l&#233;mentaires de fa&#231;on r&#233;cursive. La SDRT permet de plus 
d'avoir une structure de graphe plus expressive.  
</p>
<p>                                                 
</p>
<p>1
   Projet financ&#233; pour 3 ans par l&#8217;ANR Programme Sciences Humaines et Sociales Appel 2007 Corpus et 
</p>
<p>outils de la recherche en sciences humaines et sociales. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANNODIS : annotation de structures discursives 
 
</p>
<p>Le point de vue ascendant est focalis&#233; sur la repr&#233;sentation pr&#233;cise et compl&#232;te de la structure 
d'un texte et est donc plus adapt&#233; sur des textes ou des unit&#233;s textuelles de petite &#224; moyenne 
taille, et vise donc &#224; s'articuler avec la repr&#233;sentation descendante pr&#233;sent&#233;e dans la section 
suivante.  
</p>
<p>L&#8217;annotation dans le point de vue &#171; ascendant &#187; commence avec la segmentation d&#8217;un texte en 
unit&#233;s de discours &#233;l&#233;mentaires. Nous avons d&#233;velopp&#233; un manuel d'annotation qui indique 
comment trouver ces unit&#233;s &#233;l&#233;mentaires. Ces segments correspondent aux propositions, mais 
&#233;galement aux syntagmes pr&#233;positionnels, adverbiaux d&#233;tach&#233;s &#224; gauche (par ex. les 
adverbiaux temporels et spatiaux) et incises. S&#233;mantiquement, il est important que chaque 
segment contienne la description d&#8217;une &#233;ventualit&#233; (&#233;v&#232;nement ou &#233;tat). Pour les relations de 
base, nous avons pris un ensemble restreint, c&#8217;est &#224; dire les relations &#224; peu pr&#232;s communes &#224; 
toutes les th&#233;ories de discours. Nous avons utilis&#233; les r&#233;sultats de travaux ant&#233;rieurs sur ces 
relations et leurs d&#233;clencheurs, ainsi que sur les adverbiaux temporels, les temps verbaux, les 
changements aspectuels, pour guider le choix de la relation et du point d&#8217;attachement, et 
pr&#233;ciser les relations et leurs indices. Notre manuel d'annotation contient des descriptions pour 
chacune de ces relations. Nous avons commenc&#233; une campagne pr&#233;liminaire d'annotation avec 
deux &#233;tudiants en linguistique de l'universit&#233; de Toulouse pour raffiner notre manuel 
d'annotation et faire des premiers tests d'accord inter-annotateurs.  
</p>
<p>Nous avons aussi commenc&#233; &#224; d&#233;velopper un segmenteur automatique fond&#233; sur des indices 
lexicaux et syntaxiques, pour pr&#233;parer le travail des annotateurs et &#224; terme les soulager 
compl&#232;tement de cette partie de la t&#226;che. D'un point de vue proc&#233;dural, on peut s&#233;parer le 
probl&#232;me de l'annotation ascendante en trois t&#226;ches : le rep&#233;rage des segments, la 
d&#233;termination des paires de segments &#224; relier, et le typage de la relation entre ces paires de 
segments reli&#233;s (sous certaines contraintes pragmatiques globales).  
</p>
<p>3. Annoter des structures discursives : l&#8217;approche descendante 
</p>
<p>L'approche &#171; descendante &#187; vise l'annotation de structures discursives de haut niveau. Elle 
s&#8217;ancre dans les recherches sur les indices de discontinuit&#233; qui d&#233;limitent des segments &#224; 
diff&#233;rents niveaux de grain, segments qui sont susceptibles d&#8217;&#234;tre mis en relation avec une 
organisation fonctionnelle. Les textes sont envisag&#233;s dans leur dimension de document (cf. 
P&#233;ry-Woodley et Scott, 2006) et nous nous int&#233;ressons sp&#233;cifiquement &#224; leur mise en texte (y 
compris dans ses aspects visuels, ou mise en espace (cf. Luc et Virbel, 2001)). La mise en 
texte est premi&#232;rement abord&#233;e &#224; partir d&#8217;une caract&#233;ristique incontournable : la s&#233;quentialit&#233;. 
Du point de vue de la s&#233;quentialit&#233;, deux strat&#233;gies sont possibles &#224; tout moment du texte 
(pour le scripteur, et partant, pour le lecteur) : continuation avec ce qui pr&#233;c&#232;de ou 
rupture/transition (shift). La continuation &#233;tant la strat&#233;gie par d&#233;faut, les ruptures/transitions 
doivent faire l&#8217;objet d&#8217;une signalisation. Ainsi les indices typographiques et dispositionnels 
mettent &#224; part une citation, un &#233;l&#233;ment de discours rapport&#233;, un titre&#8230; Plus int&#233;gr&#233;s dans le 
texte, les indices de discontinuit&#233; lexico-syntaxiques (marqueurs de segmentation (Bestgen, 
2000) ; shift signals (Goutsos, 1996)) avertissent le lecteur d&#8217;un changement th&#233;matique ou 
rh&#233;torique : adverbiaux d&#233;tach&#233;s &#224; l&#8217;initiale (cf. notion de cadre de discours (Charolles et 
Vigier, 2005)), red&#233;nominations (Schnedecker, 1997).  
</p>
<p>Le mod&#232;le d'annotation pour l&#8217;annotation descendante est centr&#233; essentiellement sur une m&#233;ta-
structure : la structure &#233;num&#233;rative. Strat&#233;gie de base de la mise en texte &#224; diff&#233;rents niveaux </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M-P. P&#233;ry-Woodley, N. Asher et P. Enjalbert 
</p>
<p>de grain, la structure &#233;num&#233;rative ne peut se d&#233;finir et s&#8217;interpr&#233;ter qu&#8217;&#224; partir des indices qui 
la signalent (Luc et Virbel, 2001). Elle est pourtant loin d&#8217;&#234;tre une simple question de 
formatage, et la multiplicit&#233; de ses r&#233;alisations et de ses r&#244;les fonctionnels en fait un bon point 
d&#8217;entr&#233;e dans la complexit&#233; de l'organisation discursive2 : listes format&#233;es, d&#233;coupage en 
sections, en paragraphes, listes &#171; plates &#187; &#224; l'int&#233;rieur des paragraphes, autant de d&#233;clinaisons 
d&#8217;une structure o&#249; chaque item (unit&#233; &#233;num&#233;r&#233;e) est caract&#233;ris&#233; par une continuit&#233;, et se 
trouve en discontinuit&#233; par rapport &#224; ses items voisins. A un niveau plus global, une structure 
&#233;num&#233;rative constitue un segment caract&#233;ris&#233; par une continuit&#233; tant au plan de la mise en 
texte qu&#8217;au plan th&#233;matique.  
</p>
<p>L&#8217;annotation manuelle se base sur une visualisation des textes enrichis d&#8217;indices potentiels 
des structures recherch&#233;es : indices typographiques et dispositionnels (titres de sections, listes, 
changement de paragraphe) ; indices lexico-syntaxiques (expressions co-r&#233;f&#233;rentielles, 
adverbiaux ou connecteurs d&#233;tach&#233;s &#224; l&#8217;initiale des phrases, paragraphes ou sections) ; 
red&#233;nominations d&#233;monstratives (y compris m&#233;tadiscursives e.g. cette analyse) ; marqueurs 
d&#8217;&#233;num&#233;ration ; parall&#233;lismes structurels. Ce marquage est fond&#233; sur diff&#233;rentes proc&#233;dures de 
rep&#233;rage automatique qui s&#8217;appuient sur la structure de document, ainsi que sur les sorties 
d&#8217;un &#233;tiquetage morpho-syntaxique (TreeTagger) et d&#8217;une analyse syntaxique (SYNTEX 
(Bourigault, 2007)). L&#8217;annotateur doit pouvoir dans un premier temps &#171; scanner &#187; le texte 
dans une approche globale, &#224; la recherche de zones de concentration d'indices de 
discontinuit&#233;, pour, dans un second temps, d&#233;limiter pr&#233;cis&#233;ment les segments par une lecture 
plus ou moins pr&#233;cise. 
</p>
<p>4. L&#8217;interface d&#8217;annotation 
Il d&#233;coule de ce qui pr&#233;c&#232;de qu&#8217;un imp&#233;ratif du projet ANNODIS est de disposer d&#8217;un outil 
d&#8217;annotation manuelle du discours permettant de travailler &#224; diff&#233;rents niveaux de grain sur un 
m&#234;me document, et assez souple pour s&#8217;adapter &#224; diff&#233;rentes campagnes d&#8217;annotation. Aucun 
outil ne r&#233;pondant &#224; notre connaissance &#224; ce cahier des charges, nous avons allou&#233; une partie 
de nos ressources &#224; la conception et au d&#233;veloppement d&#8217;un tel logiciel. 
</p>
<p>La plateforme Glozz qui en r&#233;sulte est suffisamment g&#233;n&#233;rique pour s&#8217;adapter aux mod&#232;les 
d&#8217;annotation utilis&#233;s dans les diff&#233;rentes campagnes d&#8217;ANNODIS, et pourra probablement 
&#234;tre utilis&#233;e &#224; d&#8217;autres fins &#224; l&#8217;issue de ce projet. Les quatre points suivants permettent d&#8217;en 
comprendre les principes : 
</p>
<p>- Nous disposons simultan&#233;ment de deux &#171; vues &#187; sur le texte de travail. La vue principale [1] 
est la fen&#234;tre de travail, dans laquelle les annotations sont saisies &#224; la souris, tandis que la vue 
[2], appel&#233;e &#171; ruban &#187;, pr&#233;sente le texte 'vu de haut'. Dans ces deux vues, les indices pr&#233;-
d&#233;finis sont associ&#233;s &#224; des styles. De tels styles sont &#233;galement appliqu&#233;s aux annotations 
effectu&#233;es. Ainsi, la vue &quot;ruban&quot; permet une appr&#233;hension globale du marquage, et la 
navigation rapide au sein des zones de concentration d&#8217;indices. 
</p>
<p>- Une bo&#238;te &#224; outils [3] permet de choisir parmi les trois types d&#8217;objets d&#8217;annotation. Les 
&#171; unit&#233;s &#187; sont des blocs (apparaissant sous forme de cadres color&#233;s dans [1] et [2]). Les 
                                                 
</p>
<p>2
  D&#8217;autres sch&#233;mas structurels pourront &#234;tre ult&#233;rieurement pris en compte. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANNODIS : annotation de structures discursives 
 
</p>
<p>&#171; relations &#187; permettent de relier deux unit&#233;s (apparaissant sous forme de lignes transverses 
dans [1] et [2]), et les &#171; sch&#233;mas &#187; permettent d&#8217;agglom&#233;rer unit&#233;s et relations en une m&#234;me 
entit&#233;. Par exemple, pour repr&#233;senter une cha&#238;ne r&#233;f&#233;rentielle, on pourrait cr&#233;er autant d&#8217;unit&#233;s 
que de marques anaphoriques, puis mettre en relation les diff&#233;rentes marques, et enfin cr&#233;er un 
sch&#233;ma int&#233;grant toutes ces marques et leurs relations. 
</p>
<p>- Pour une campagne donn&#233;e, ou pour l&#8217;une de ses sous-t&#226;ches, un mod&#232;le d&#8217;annotation peut 
&#234;tre charg&#233; afin de d&#233;finir les cat&#233;gories disponibles pour chacun des trois types d&#8217;objet (par 
exemple des unit&#233;s de cat&#233;gorie &#171; Amorce &#187;, des relations de cat&#233;gorie &#171; Elaboration &#187;, des 
sch&#233;mas de cat&#233;gorie &#171; Structure &#233;num&#233;rative &#187; etc.). Ces cat&#233;gories apparaissent dans les 
trois colonnes de [5], qui permettent d&#8217;assigner la cat&#233;gorie souhait&#233;e &#224; chaque annotation. Le 
mod&#232;le d&#8217;annotation pr&#233;voit aussi d&#8217;associer un jeu d&#8217;attributs/valeurs &#224; chaque cat&#233;gorie, 
lequel peut &#234;tre vu et modifi&#233; dans la fen&#234;tre [4]. Des styles (notamment des couleurs) sont 
associ&#233;s aux diff&#233;rents types, et peuvent &#234;tre modifi&#233;s gr&#226;ce &#224; l&#8217;interface [7]. 
</p>
<p>- Le document trait&#233; peut &#234;tre enrichi d&#8217;un marquage pr&#233;alable, qui peut &#234;tre issu d&#8217;une 
segmentation ou d&#8217;un rep&#233;rage automatique d&#8217;indices ou de structures comme expos&#233; en 3 ; 
ou r&#233;sulter d&#8217;une pr&#233;c&#233;dente campagne d&#8217;annotation que l&#8217;on souhaite enrichir ou sur laquelle 
on souhaite s&#8217;appuyer pour &#233;tudier de nouvelles structures. 
</p>
<p>Enfin, diff&#233;rents outils de recherche et de navigation [6] peuvent &#234;tre ajout&#233;s ou retir&#233;s &#224; la 
demande. 
</p>
<p> 
</p>
<p>Figure 1 : La plateforme d&#8217;annotation Glozz 
</p>
<p>5. Enjeux et retomb&#233;es  
La constitution d&#8217;un corpus de textes diversifi&#233;s, dont beaucoup sont longs et complexes sur 
le plan de la structure de document, avec prise en compte de cette structure &#171; logique &#187; et 
</p>
<p>4 
</p>
<p>4 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M-P. P&#233;ry-Woodley, N. Asher et P. Enjalbert 
</p>
<p>pr&#233;servation de la mise en forme mat&#233;rielle est en soi novateur. L&#8217;annotation syst&#233;matique de 
relations et de structures discursives dans ce corpus diversifi&#233; fournira des donn&#233;es pr&#233;cieuses 
pour la description linguistique et la th&#233;orisation des fonctionnements discursifs. D&#233;j&#224; la 
r&#233;daction des guides d&#8217;annotation a conduit &#224; un travail consid&#233;rable d&#8217;affinement et de 
pr&#233;cision des mod&#232;les. La construction d&#8217;outils logiciels satisfaisant aux exigences des deux 
approches ascendante et descendante a exig&#233; une mod&#233;lisation qui en garantit la robustesse et 
la g&#233;n&#233;ricit&#233;. Enfin, la confrontation/fusion des deux approches &#224; travers cette double 
annotation est un enjeu majeur du projet. 
</p>
<p>R&#233;f&#233;rences  
ASHER, N., LASCARIDES, A. (2003). Logics of conversation. Cambridge; New York: 
Cambridge University Press. 
</p>
<p>BESTGEN, Y., VONK, W. (2000). The role of temporal segmentation markers in discourse 
processing. Disourse Processes 19, 385-406. 
</p>
<p>BOURIGAULT D. (2007) Un analyseur syntaxique op&#233;rationnel : SYNTEX. M&#233;moire d'HDR en 
sciences du langage, Universit&#233; de Toulouse 2, France. 
</p>
<p>CHAROLLES, M., &amp; VIGIER, D. (2005). Les adverbiaux en position pr&#233;verbale: port&#233;e cadrative 
et organisation des discours. Langue Fran&#231;aise 148, 9-30. 
</p>
<p>FORBES, K., MILTSAKAKI, E., PRASAD, R., SARKAR, A., JOSHI, A., WEBBER, B. (2003). D-
LTAG System: Discourse parsing with a lexicalized tree-adjoining grammar. Journal of 
Logic, Language and Information, 12(3), 261-279. 
GOUTSOS, D. (1996). A model of sequential relations in expository text. Text 16(4), 501-533. 
</p>
<p>LUC, C., VIRBEL, J. (2001). Le mod&#232;le d'architecture textuelle : fondements et 
exp&#233;rimentation. VERBUM 23(1), 103-123. 
</p>
<p>MANN, W., THOMPSON, S. (1987). Rhetorical Structure Theory: a theory of text organization. 
Information Science Institute.  
</p>
<p>P&#201;RY-WOODLEY, M.-P., SCOTT, D. (2006). Computational Approaches to Discourse and 
Document Processing. TAL 47(2), 7-19. 
</p>
<p>POLANYI, L., VAN DEN BERG, M., CULY, C., THIONE, G. L., AHN, D. (2004). A Rule Based 
Approach to Discourse Parsing. Actes de SIGDIAL 2004. Boston.  
</p>
<p>PRASAD, R., MILTSAKAKI, E., DINESH, N., LEE, A. JOSHI, A. (2006). The Penn Discourse 
TreeBank 1.0 Annotation Manual. http://www.seas.upenn.edu/~pdtb/papers/pdtb-1.0-
annotation-manual.pdf 
</p>
<p>SCHNEDECKER, C. (1997). Nom propre et cha&#238;nes de r&#233;f&#233;rence. Paris: Klincksieck. 
WOLF, F., &amp; GIBSON, E. (2005). Representing Discourse Coherence: A Corpus Based Study. 
Computational Linguistics, 31(2), 249&#8211;287. </p>

</div></div>
</body></html>