<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Morfetik, ressource lexicale pour le TAL</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009 
</p>
<p>Morfetik, ressource lexicale pour le TAL 
</p>
<p>Pierre-Andr&#233; Buvet, Emmanuel Cartier, Fabrice Issac, Yassine Madiouni, 
Michel Mathieu-Colas, Salah Mejri 
</p>
<p>(1) CNRS LDI UMR 7187 &#8211; Universit&#233; Paris 13, 99 avenue Jean-Baptiste 
Cl&#233;ment, 93430 Villetaneuse  
</p>
<p>{pabuvet,ecartier,fissac,ymadiouni, mmathieu-colas,smejri}@ldi.univ-
paris13.fr 
</p>
<p>R&#233;sum&#233;  
Le traitement automatique des langues exige un recensement lexical aussi rigoureux que possible. Dans ce but, 
nous avons d&#233;velopp&#233; un dictionnaire morphologique du fran&#231;ais, con&#231;u comme le point de d&#233;part d&#8217;un syst&#232;me 
modulaire (Morfetik)  incluant un moteur de flexion, des interfaces de consultation et d&#8217;interrogation et des 
outils d&#8217;exploitation. Nous pr&#233;sentons dans cet article, apr&#232;s une br&#232;ve description du dictionnaire de base 
(lexique des mots simples), quelques-uns des outils informatiques li&#233;s &#224; cette ressource : un moteur de recherche 
des lemmes et des formes fl&#233;chies ; un moteur de flexion XML et MySQL ; des outils NLP permettant 
d&#8217;exploiter le dictionnaire ainsi g&#233;n&#233;r&#233; ; nous pr&#233;sentons notamment un analyseur linguistique d&#233;velopp&#233; dans 
notre laboratoire. Nous comparons dans une derni&#232;re partie Morfetik avec d&#8217;autres ressources analogues du 
fran&#231;ais : Morphalou, Lexique3 et le DELAF. 
</p>
<p>Abstract  
Automatic language processing requires as rigorous a lexical inventory as possible. For this purpose, we have 
developed a morphological dictionary for French, conceived as the starting point of a modular system (Morfetik) 
which includes an inflection generator, user interfaces and operating tools. In this paper, we briefly describe the 
basic dictionary (lexicon of simple words) and detail some of the computing tools based on the dictionary.  The 
computing tools built on this resource include: a lemma / inflected forms search engine; an XML and MySQL 
engine to build the inflected forms; the generated dictionary can then be used by various NLP Tools; in this 
article, we present the use of the dictionary in a linguistic analyser developed at the laboratory. Finally, we 
compare Morfetik to similar resources : Morphalou, Lexique3 and DELAF. 
</p>
<p>Mots-cl&#233;s :   dictionnaire morphologique du fran&#231;ais, CMLF, analyse linguistique des 
textes 
Keywords:   French morphological dictionary, XML, CMLF, Linguistical analysis, 
Morfetik 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>P.-A. Buvet, E. Cartier, F. Issac, Y. Madiouni, M. Mathieu-Colas, S. Mejri 
 
</p>
<p>1 Structuration des donn&#233;es linguistiques 
La ressource lexicale vis&#233;e par le projet Morfetik est un dictionnaire morphologique du 
fran&#231;ais. Cette ressource est le r&#233;sultat du travail d&#8217;une vingtaine d&#8217;ann&#233;es de collecte et de 
description, sous la direction de Michel Mathieu-Colas. Nous pr&#233;sentons ci-dessous les 
informations essentielles sur cette ressource. Pour une pr&#233;sentation linguistique d&#233;taill&#233;e, voir 
(Mathieu-Colas, 2009).  
</p>
<p>1.1 Sources d&#8217;information 
</p>
<p>Le recensement lexical a fait appel &#224; de nombreuses sources lexicographiques. Pour ce qui est 
de la langue g&#233;n&#233;rale, les dictionnaires les plus courants ont &#233;t&#233; pris en compte (y compris des 
dictionnaires bilingues). En cas de d&#233;saccord (variantes graphiques), toutes les formes 
attest&#233;es ont &#233;t&#233; retenues. Les principales sources consult&#233;es sont : le DELAS (Dictionnaire 
&#233;lectronique du LADL, cf. B. COURTOIS 1990) ; le Petit et le Grand Robert ; 
le Petit Larousse illustr&#233;, le Lexis, le Grand Larousse encyclop&#233;dique et le Grand 
Dictionnaire encyclop&#233;dique Larousse (GDEL) ; le Tr&#233;sor de la langue fran&#231;aise ; le 
Harrap's et le Robert &amp; Collins ; des dictionnaires d'argot ; des tables de conjugaison (dont le 
Bescherelle et les Verbes logiques de A. DUGAS); Le Bon Usage de GREVISSE et des 
dictionnaires de &#171; difficult&#233;s &#187; pour le traitement des cas probl&#233;matiques. S&#8217;agissant des 
termes sp&#233;cialis&#233;s, l&#8217;exploration s&#8217;est &#233;tendue relativement loin. D&#8217;une part, des dictionnaires 
encyclop&#233;diques ont &#233;t&#233; consult&#233;s : c&#8217;est ainsi qu&#8217;une partie non n&#233;gligeable de la 
nomenclature du GDEL a &#233;t&#233; int&#233;gr&#233;e. D&#8217;autre part, certaines sp&#233;cialit&#233;s ont donn&#233; lieu &#224; une 
recherche plus approfondie (par exemple la m&#233;decine et la min&#233;ralogie).  
</p>
<p>Au total, 106 884 mots simples ont ainsi &#233;t&#233; identifi&#233;s, r&#233;partis comme suit : 
</p>
<p>noms : 69950 
</p>
<p>adjectifs : 24405 
</p>
<p>d&#233;terminants  59 
</p>
<p>pronoms : 68 
</p>
<p>verbes : 10232 
</p>
<p>adverbes : 1894 
</p>
<p>pr&#233;positions : 58 
</p>
<p>conjonctions : 18 
</p>
<p>interjections : 200 
</p>
<p>Naturellement, l&#8217;inventaire n&#8217;est pas clos. Il devra se poursuivre par l&#8217;ajout de n&#233;ologismes et 
l&#8217;int&#233;gration de nouvelles sp&#233;cialit&#233;s. En outre, la confrontation avec le vocabulaire du Web, 
rendue possible par les programmes li&#233;s &#224; Morfetik, permettra de compl&#233;ter les lacunes et 
d&#8217;enrichir la terminologie. 
</p>
<p>1.2 Description des entr&#233;es : tables de lemmes et tables de flexions 
</p>
<p>La structure des tables &#233;tant diff&#233;rente selon les cat&#233;gories morphosyntaxiques, nous avons 
mis en place cinq groupes distincts. Si, pour certains types de mots (par exemple les 
adverbes), un simple listage suffit, pour d&#8217;autres cat&#233;gories &#8211; noms, adjectifs et verbes &#8211;, il 
convient d&#8217;&#233;laborer deux tables compl&#233;mentaires : d'une part des tables de flexion permettant 
d&#8217;identifier et de coder tous les types flexionnels, d'autre part des tables attribuant &#224; chaque 
lemme le code flexionnel correspondant. Ce sont ces tables qui seront ensuite utilis&#233;es par le 
moteur de flexion pour produire l'ensemble de toutes les formes fl&#233;chies.  
</p>
<p>A titre d&#8217;exemple, nous pr&#233;senterons ici les encodages retenus pour les verbes, de loin la 
partie du discours morphologiquement la plus complexe en fran&#231;ais. Dans ce cadre, la table </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morfetik, ressource lexicale pour le TAL 
</p>
<p>des lemmes va comprendre, pour chaque lemme, un identifiant vers son code de flexion. Dans 
la table des flexions, on trouvera les diff&#233;rentes informations li&#233;es &#224; chaque flexion, ainsi que 
la forme &#224; ajouter. 
</p>
<p>Au total, 222 codes de flexion ont &#233;t&#233; d&#233;finis, et la table des flexions comprend les champs 
suivants : 
</p>
<p>CHAMPS EXEMPLE 
num&#233;ro de code 036 
</p>
<p>exemple-mod&#232;le ACQUERIR 
</p>
<p>radical (nombre de caract&#232;res &#224; soustraire de la forme canonique) -4 
</p>
<p>radical-mod&#232;le ACQU 
</p>
<p>d&#233;sinences de l'infinitif Erir 
</p>
<p>d&#233;sinences des formes conjugu&#233;es (45 champs) iers, iers, iert, &#233;rons... 
</p>
<p>d&#233;sinences des participes (5 champs) &#233;rant, is, ise, is, ises 
</p>
<p>Table 1 : structure de la table de flexion des verbes 
</p>
<p>Les &#171; radicaux &#187; et &#171; d&#233;sinences &#187; ainsi d&#233;crits ne correspondent pas n&#233;cessairement au 
d&#233;coupage morphologique. Afin de faciliter le traitement automatique, le radical est d&#233;fini 
comme le plus petit d&#233;nominateur commun : SER- pour SERVIR (pour construire sers et sert), 
V- pour VOULOIR (&#224; cause de veux et veut), etc. A la limite, le radical peut &#234;tre une forme vide 
(&#234;tre, avoir, aller). 
</p>
<p>De mani&#232;re compl&#233;mentaire, les d&#233;sinences s'ajoutent au radical pour construire les formes 
fl&#233;chies. Le signe = symbolise les d&#233;sinences z&#233;ro (forme fl&#233;chie identique au radical, par ex. 
v&#234;t ou rend). En cas d'inexistence d'une forme (d&#233;fectivit&#233;), la d&#233;sinence est remplac&#233;e par un 
tiret. 
</p>
<p>Il est int&#233;ressant de noter que certains mod&#232;les int&#232;grent des variantes (elles sont s&#233;par&#233;es par 
des points-virgules dans les tables de codes). Il peut s'agir par exemple d'une forme isol&#233;e 
(ECLORE [100.1] :  ind. pr&#233;s. [3s] = il &#233;cl&#244;t ou il &#233;clot), ou d'un ensemble de formes (ASSEOIR 
[059] : assois ou assieds, assoyais ou asseyais, assoirai ou assi&#233;rai, etc., avec m&#233;langes 
possibles pour un m&#234;me locuteur : je m'assois, nous nous asseyons, ils s'assoient, assieds-
toi...). 
</p>
<p>Nous renvoyons &#224; (Mathieu-Colas, 2009) pour une pr&#233;sentation exhaustive des tables li&#233;es &#224; 
chaque partie du discours. 
</p>
<p>1.3 Conclusion 
</p>
<p>Le syst&#232;me ainsi con&#231;u permet de g&#233;n&#233;rer automatiquement l&#8217;ensemble des formes simples du 
fran&#231;ais &#8211; environ 520 000 graphies correspondant &#224; plus de 760 000 valeurs (compte tenu 
des homographies), en l&#8217;&#233;tat actuel de la description. A terme, d'autres informations seront 
int&#233;gr&#233;es &#224; cette base, qu'il s'agisse de la nomenclature (ajout de n&#233;ologismes et de termes 
sp&#233;cialis&#233;s) ou d&#8217;informations descriptives compl&#233;mentaires. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>P.-A. Buvet, E. Cartier, F. Issac, Y. Madiouni, M. Mathieu-Colas, S. Mejri 
 
Nous pr&#233;parons, dans le m&#234;me esprit, un module consacr&#233; aux unit&#233;s polylexicales (plus de 
100 000 lemmes complexes). Morfetik constitue ainsi un ensemble &#233;volutif destin&#233; &#224; 
s&#8217;enrichir progressivement afin d&#8217;am&#233;liorer la cha&#238;ne de traitement des donn&#233;es textuelles. 
</p>
<p>2 Exploitations informatiques de la ressource linguistique 
La ressource linguistique bri&#232;vement pr&#233;sent&#233;e ci-dessus est exploit&#233;e informatiquement. Le 
sch&#233;ma ci-dessous synth&#233;tise les diff&#233;rentes exploitations du syst&#232;me :  
</p>
<p> 
</p>
<p>Figure 1 : architecture g&#233;n&#233;rale (Morfetik et ses outils) 
</p>
<p>2.1 Le moteur de flexion : Morfetik Engine 
</p>
<p>Morfetik Engine est la composante du syst&#232;me qui prend en charge l'interpr&#233;tation de 
Morfetik Tables pour g&#233;n&#233;rer le lexique des formes fl&#233;chies, Morfetik Flex. Il comprend un 
moteur principal ainsi que des modules. Le moteur principal se charge de la collecte des 
informations dans les tables, de la cr&#233;ation des formes fl&#233;chies &#224; partir du lemme et du code 
de flexion appropri&#233;, de l'attribution des cat&#233;gories grammaticales correspondantes (genre, 
nombre, etc.) et des autres m&#233;tadonn&#233;es (par exemple raret&#233;), et enfin il centralise l'ex&#233;cution 
des modules. Ces modules sont de plusieurs ordres. On trouve tout d'abord les modules g&#233;rant 
les diff&#233;rents formats de sortie : actuellement, il existe un module pour g&#233;n&#233;rer une table 
mysql des formes, et un autre pour g&#233;n&#233;rer un fichier au format XML. Ensuite, chaque partie 
du discours n&#233;cessitant une flexion dispose d'un module sp&#233;cifique permettant de g&#233;rer 
finement les particularit&#233;s des tables qui lui correspondent, comme les diff&#233;rents types de 
codes pour la raret&#233;, ainsi que les diff&#233;rents moyens de signaler les formes d&#233;fectives ou les 
variantes. On trouve donc &#224; l'heure actuelle un module [Nom], un module [Adjectif] et un 
module [Verbe]. Cette architecture modulaire permet de pouvoir assez facilement envisager la 
r&#233;utilisation du moteur pour d'autres langues ou d'autres ressources. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morfetik, ressource lexicale pour le TAL 
</p>
<p>2.2 Morfetik Flex : l'ensemble des formes fl&#233;chies 
</p>
<p>Morfetik Flex est la ressource linguistique la plus directement utilisable par des applications 
informatiques puisqu'elle consiste en l'ensemble des formes fl&#233;chies de la ressource. A chaque 
forme sont associ&#233;s un lemme ainsi que diff&#233;rentes informations de cat&#233;gorie, de genre et de 
nombre (noms, adjectifs) ou de temps, de mode, de personne et de genre (verbes).  
</p>
<p>Cette ressource ayant pour vocation &#224; &#234;tre partag&#233;e, il &#233;tait important de choisir un format 
d'&#233;change respectueux des normes.  C&#8217;est ainsi que nous avons notamment d&#233;cid&#233; de g&#233;n&#233;rer 
Morfetik Flex dans un format XML utilisant une DTD proche de celle propos&#233;e par le lexique 
Morphalou (cf. infra), cette DTD s&#8217;appuyant  elle-m&#234;me sur la norme LMF (Lexical Markup 
Framework). 
</p>
<p>2.3 Navigation et interrogation de Morfetik Flex 
</p>
<p>Un ensemble d&#8217;outils de navigation et de consultation de la ressource sont actuellement en 
finalisation de d&#233;veloppement et seront mis  &#224; la disposition du public au premier semestre 
2009 :  
</p>
<p>- outil de lemmatisation de formes : &#224; partir d&#8217;une forme quelconque, l&#8217;outil renvoie 
l&#8217;ensemble des lemmes pouvant y correspondre; cette lemmatisation est &#233;galement utilis&#233;e par 
les analyseurs d&#233;velopp&#233;s au laboratoire (cf. section 2.5.) ; par exemple, si nous tapons 
&#171; marche &#187;, en prenant l&#8217;option &#171; &#233;tendre la recherche en enlevant/ajoutant les accents &#187;, 
l&#8217;interface nous renverra le tableau suivant, qui exhibe les diff&#233;rentes analyses possibles de la 
forme : 
</p>
<p> 
</p>
<p>Figure 2 : r&#233;sultat d&#8217;analyse pour la forme &#171; march&#233; &#187; 
</p>
<p>- outil de g&#233;n&#233;ration des flexions : &#224; partir d&#8217;une zone permettant de saisir une forme, l&#8217;outil 
fournit les diff&#233;rentes lemmes possibles, puis les diff&#233;rentes formes li&#233;es &#224; chaque lemme; par 
exemple, si nous donnons au g&#233;n&#233;rateur la forme &#171; &#234;tre &#187;, il nous renvoie &#224; la fois la forme 
nominale et la forme verbale. Ensuite, l&#8217;utilisateur peut cliquer sur l&#8217;une des formes pour 
obtenir les formes correspondantes  : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>P.-A. Buvet, E. Cartier, F. Issac, Y. Madiouni, M. Mathieu-Colas, S. Mejri 
 
</p>
<p> 
</p>
<p>Figure 3 : r&#233;sultat de la recherche pour &#234;tre(2) 
</p>
<p>- moteur de recherche sur les formes et/ou les flexions : enfin, un moteur de recherche permet 
de lancer des recherches classiques sur l&#8217;ensemble des champs disponibles dans la base, par 
exemple pour rechercher tous les noms qui finissent par &#171; on &#187; ou encore les noms masculins 
qui sont aussi des verbes, etc. L&#8217;id&#233;e est de proposer aux chercheurs un moteur de recherche 
permettant d&#8217;effectuer des recherches complexes sur la base lexicographique. 
</p>
<p>2.4 Interface de maintenance 
</p>
<p>Actuellement, la maintenance, comme pr&#233;sent&#233;e dans l&#8217;architecture, a lieu sur les tables de 
lemmes et de flexions, et non pas sur les r&#233;sultats flexionnels. De ce fait, l&#8217;interface de 
maintenance concerne les deux s&#233;ries de tables propres &#224; chaque partie du discours. 
Actuellement, la base est h&#233;berg&#233;e sous mysql, avec des connecteurs permettant de travailler 
&#224; partir de masque ACCESS, ou bien directement via les masques propos&#233;s par phpmyadmin.  
</p>
<p>2.5 Exploitation dans d&#8217;autres outils  
</p>
<p>Morfetik Flex est l&#8217;outil principal pouvant &#234;tre exploit&#233; de diff&#233;rentes fa&#231;ons. Dans le 
laboratoire, trois applications principales ont actuellement &#233;t&#233; d&#233;velopp&#233;es : 1/ int&#233;gration de 
la ressource dans un outil d&#8217;analyse linguistique des textes (TextBox) ; 2/ int&#233;gration dans une 
cha&#238;ne de rep&#233;rage des n&#233;ologismes d&#8217;une langue (Telanaut) ; 3/ int&#233;gration dans un 
g&#233;n&#233;rateur automatique d&#8217;exercices de fran&#231;ais dans une plateforme de e-learning (GEF). 
Nous pr&#233;sentons dans la section suivante l&#8217;exploitation de Morfetik Flex dans TextBox. 
</p>
<p>2.5.1 Morfetik comme ressource pour l&#8217;analyse morphologique des textes : TextBox  
</p>
<p>La ressource Morfetik est actuellement utilis&#233;e par un analyseur linguistique des textes 
d&#233;velopp&#233; au laboratoire, appel&#233; TextBox (Cartier, 2007 ; Cartier, 2008). Cet analyseur 
permet, &#224; l&#8217;aide de ressources linguistiques externes, d&#8217;effectuer l&#8217;analyse de textes 
num&#233;riques en plusieurs &#233;tapes : normalisation des textes en XML, segmentation en phrases </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morfetik, ressource lexicale pour le TAL 
</p>
<p>et en mots, analyse morphologique, puis analyse syntactico-s&#233;mantique. Chacune des &#233;tapes 
recourt &#224; des ressources linguistiques externes : d&#233;finition des &#171; mots &#187; et des &#171; phrases &#187; 
sous forme de listes d&#8217;expressions r&#233;guli&#232;res pour l&#8217;&#233;tape de segmentation, dictionnaire 
morpho-syntaxique des formes pour la seconde &#233;tape. Dans ce cadre, TextBox a recours, pour 
le fran&#231;ais, au dictionnaire Morfetik. TextBox annote, &#224; chaque &#233;tape de l&#8217;analyse, le texte de 
nouvelles informations, sous forme d&#8217;&#233;l&#233;ments XML avec d&#8217;&#233;ventuels attributs. Voici, &#224; titre 
d&#8217;exemple, le r&#233;sultat de l&#8217;analyse de la s&#233;quence Lorsque Renault est entr&#233; dans le capital de 
Nissan : 
</p>
<p> 
</p>
<p>Figure 4 : exemple d&#8217;analyse par TextBox-Morfetik 
</p>
<p>Cet exemple explicite, pour chaque &#171; token &#187; (c&#8217;est-&#224;-dire chaque &#171; mot &#187; typographique 
reconnu dans la phase de segmentation), les diff&#233;rentes analyses morphologiques, hors 
contexte, contenues dans le dictionnaire morphologique ; chaque analyse d&#233;bute par un 
&#233;l&#233;ment &#171; morph &#187; dot&#233; d&#8217;attributs correspondant aux propri&#233;t&#233;s morpho-syntaxiques 
attach&#233;es &#224; chaque forme : c&#8217;est ainsi que lorsque est une conjonction de subordination 
(cat=conjs), et que son lemme est &#8216;lorsque&#8217; ; par contre, la forme est dispose de deux 
analyses possibles : comme nom et comme verbe ; de m&#234;me pour capital, qui peut &#234;tre 
adjectif ou nom.  
</p>
<p>Actuellement, une interface permet de visualiser, &#224; partir des analyses morphologiques de 
Textbox et de Morfetik, les analyses possibles pour chaque mot, ainsi que les mots 
&#171; inconnus &#187; du dictionnaire (voir figure 7) : on constate &#233;videmment que les noms 
propres seront inconnus, ainsi que de nombreux compos&#233;s (en cours d&#8217;introduction dans 
Morfetik) et mots pr&#233;fix&#233;s. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>P.-A. Buvet, E. Cartier, F. Issac, Y. Madiouni, M. Mathieu-Colas, S. Mejri 
 
</p>
<p> 
</p>
<p>Figure 5 : Interface de TextBox pour debugger Morfetik 
</p>
<p>3 Comparaison avec d&#8217;autres ressources linguistiques du 
fran&#231;ais 
</p>
<p>La pr&#233;sente section effectue une br&#232;ve comparaison entre Morfetik et d'autres ressources 
linguistiques analogues. On trouvera en fin de section un tableau r&#233;capitulatif sur les 
diff&#233;rentes propri&#233;t&#233;s des ressources cit&#233;es ici. 
</p>
<p>3.1 Morphalou 
</p>
<p>Morphalou est une ressource comparable &#224; Morfetik Flex. Ce lexique comprend des formes 
complexes, ce qui n'est pas encore le cas de Morfetik. Sa couverture est cependant moindre 
d'environ 220 000 termes. Les approches des deux ressources concernant le genre des noms 
sont similaires (s&#233;paration des genres). Morphalou maintient cependant un lien entre les noms 
masculins et f&#233;minins, lien qui n'est pas encore mis en place dans Morfetik. Les indications de 
raret&#233; pr&#233;sentes dans Morfetik permettent, quant &#224; elles, de d&#233;signer de nombreuses formes 
peu courantes mais attest&#233;es comme rares, plut&#244;t que de les consid&#233;rer comme d&#233;fectives. 
D&#8217;autre part, comme les deux ressources partagent des DTD tr&#232;s semblables, on peut dire 
qu'elles r&#233;pondent &#224; des sc&#233;narios d'utilisation similaires. De nombreuses diff&#233;rences fines 
existent toutefois, bien qu&#8217;elles d&#233;passent le cadre de cet article. Notons seulement une 
diff&#233;rence importance dans la m&#233;thode de constitution du lexique, puisque Morphalou 
fonctionne par extraction des formes fl&#233;chies du TLF, puis correction des erreurs g&#233;n&#233;r&#233;es, &#224; 
la main ou automatiquement. En revanche, Morfetik Flex est g&#233;n&#233;r&#233; de mani&#232;re syst&#233;matique 
&#224; partir de ses ressources Morfetik Tables, sans intervention manuelle. Quand un bug 
appara&#238;t, les corrections sont apport&#233;es aux donn&#233;es sources ou bien au moteur lui-m&#234;me, 
jamais au lexique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morfetik, ressource lexicale pour le TAL 
</p>
<p>3.2 Lexique 3 
</p>
<p>Lexique 3 est &#233;galement une base lexicale regroupant des formes fl&#233;chies avec de nombreuses 
informations les concernant. Si la quantit&#233; de formes pr&#233;sentes est inf&#233;rieure &#224; celle de 
Morfetik, Lexique se distingue en revanche par la pr&#233;sence de nombreux autres 
renseignements (phonologie et fr&#233;quences entre autres). De plus, il dispose d'un &#233;ventail 
int&#233;ressant d'outils connexes comme la recherche de cooccurrences sur corpus ou la 
conversion vers le formalisme de Morphalou. 
</p>
<p>Nom Mots 
simples 
</p>
<p>Mots 
compos&#233;s 
</p>
<p>Indic.  De 
Fr&#233;quence 
</p>
<p>Mode de 
cr&#233;ation/origine 
</p>
<p>Format Licence Outils 
</p>
<p>Morfetik 758 152 Env. 
140 000 
(dont 
120000 
noms) 
Travail en 
cours 
</p>
<p>Marqueur de 
raret&#233; 
</p>
<p>Automatique &#224; partir 
de tables de lemmes 
et de flexions 
</p>
<p>XML-LMF En 
cours 
de 
d&#233;finiti
on 
</p>
<p>Outil de 
consultat
ion en 
ligne 
</p>
<p>Morphalou 524 725 Tr&#232;s peu 
(moins de 
1%) 
</p>
<p>Non Ad hoc &#224; partir du 
TLF 
</p>
<p>XML-LMF Licence 
sp&#233;cifiq
ue 
autorisa
nt la 
r&#233;utilisa
tion 
</p>
<p>Non 
</p>
<p>Lexique3 150000 Tr&#232;s peu 
(moins de 
1%) 
</p>
<p>Oui Ad hoc  Tabulaire Appare
nt&#233; &#224; la 
GPL 
</p>
<p>Scripts 
</p>
<p>DELAF 683 824  108 436  Non Automatiquement &#224; 
partir du DELAS 
</p>
<p>XML LGPLL
R 
(appare
nt&#233; &#224; 
GPL) 
</p>
<p>Non 
</p>
<p> 
</p>
<p>3.3 DELAF 
</p>
<p>Le dictionnaire DELAF (flexions d&#233;riv&#233;es du DELAS) est sans doute, pour les formes 
fl&#233;chies du  fran&#231;ais, la ressource lexicale de large couverture la plus ancienne. Elle a 
sp&#233;cifiquement &#233;t&#233; d&#233;velopp&#233;e pour &#234;tre utilis&#233;e dans le cadre d'une application informatique. 
La version XML est disponible sur Internet (http://infolingu.univ-mlv.fr/). Bien que Morfetik 
ait pris en compte, dans son &#233;laboration, les acquis du DELAS, les diff&#233;rences concernent &#224; la 
fois l'&#233;tablissement de la nomenclature (sources utilis&#233;es) et la structuration des donn&#233;es 
(repr&#233;sentation des noms, marquage des formes verbales rares, etc.). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>P.-A. Buvet, E. Cartier, F. Issac, Y. Madiouni, M. Mathieu-Colas, S. Mejri 
 
Conclusion 
Morfetik est actuellement la ressource morphologique du fran&#231;ais la plus exhaustive. Cette 
ressource dispose de diff&#233;rents modules qui en permettent la maintenance et l&#8217;exploitation : 
tout d&#8217;abord la ressource elle-m&#234;me est g&#233;r&#233;e au laboratoire par le biais d&#8217;une base de 
donn&#233;es MySql qui est accessible via une interface web ou via des masques MS Access. 
Ensuite, cette ressource dispose d&#8217;un g&#233;n&#233;rateur de formes qui permet de disposer de 
l&#8217;ensemble des formes fl&#233;chies au format XML (CMLF). Pour les chercheurs, un premier 
acc&#232;s est prochainement pr&#233;vu pour visualiser et naviguer dans la base. Cette ressource XML 
peut ensuite &#234;tre exploit&#233;e par des outils de TAL, et nous avons pr&#233;sent&#233; dans cet article un 
analyseur qui int&#232;gre cette ressource. Morfetik sera consultable d&#232;s septembre 2009 &#224; 
l&#8217;adresse suivante : http://extranet-ldi.univ-paris13.fr/Morf. On pourra &#233;galement consulter &#224; 
l&#8217;adresse http://extranet-ldi.univ-paris13.fr/ecartier/textbox une interface pr&#233;sentant un certain 
nombre d&#8217;analyses textuelles automatiques effectu&#233;es par TextBox &#224; partir de Morfetik. 
</p>
<p>R&#233;f&#233;rences 
BUVET PIERRE-ANDRE, CARTIER EMMANUEL, ISSAC FABRICE, MEJRI SALAH (2007) : 
&#171; Dictionnaires &#233;lectroniques et &#233;tiquetage syntactico-s&#233;mantique &#187;, in HATHOUT Nabil, 
MULLER PHILIPPE (eds), Actes des 14e Journ&#233;es sur le Traitement Automatique des Langues 
Naturelles, pp. 239-248, Toulouse, IRIT Press. 
</p>
<p>CARTIER EMMANUEL (2007), &#171; TextBox, a Written Corpus Tool for Linguistic Analysis &#187;, 
Web As Corpus 2007, Louvain-la-Neuve, sept. 2007. 
</p>
<p>CARTIER EMMANUEL (2008), Int&#233;gration des pr&#233;dicats verbaux dans l&#8217;analyseur s&#233;mantique 
TextBox : l&#8217;exemple des verbes de cognition &#187;, Verbum, num&#233;ro sp&#233;cial sur les pr&#233;dicats 
verbaux, Paris. 
</p>
<p>COURTOIS BLANDINE (1990). &#171; Un syst&#232;me de dictionnaires &#233;lectroniques pour les mots 
simples du fran&#231;ais &#187;, in COURTOIS Blandine, SILBERZTEIN Max (eds), Dictionnaires 
&#233;lectroniques du fran&#231;ais, Langue fran&#231;aise, n&#176;87, Paris, Larousse, pp. 11-22. 
</p>
<p>COURTOIS BLANDINE, SILBERZTEIN MAX (1990). Dictionnaires &#233;lectroniques du 
fran&#231;ais, Langue fran&#231;aise n&#176; 87, Paris, Larousse. 
</p>
<p>FRANCOPOULO G., MONTE G. (2006). Lexical Markup Framework (LMF aka ISO-24613), CD 
revision 9 : 15 mars 2006. 
</p>
<p>MATHIEU-COLAS MICHEL  (1996-2006). Dictionnaire morphologique du fran&#231;ais, I. 
Formes simples, Rapport technique du LLI, Villetaneuse, Universit&#233; Paris 13. 
</p>
<p>MATHIEU-COLAS MICHEL  (2009, &#224; para&#238;tre). Morfetik, une ressource lexicale pour le 
TAL, Cahiers de Lexicologie, Paris. 
</p>
<p>NEW B. (2006), Lexique 3 : Une nouvelle base de donn&#233;es lexicales. Actes de la Conf&#233;rence 
Traitement Automatique des Langues Naturelles (TALN 2006), avril 2006, Louvain, 
Belgique. 
</p>
<p>ROMARY L., SALMON-ALT S., FRANCOPOULO G. (2004). Standards going concrete : from 
LMF to Morphalou. </p>

</div></div>
</body></html>