<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Rep&#233;rer automatiquement les segments obsolescents &#224; l&#8217;aide d&#8217;indices s&#233;mantiques et discursifs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Rep&#233;rer automatiquement les segments obsolescents &#224; l&#8217;aide
d&#8217;indices s&#233;mantiques et discursifs
</p>
<p>Marion Laignelet1 Fran&#231;ois Rioult2
</p>
<p>(1) CLLE-ERSS / Universit&#233; de Toulouse 2 Le Mirail
(2) GREYC (CNRS UMR6072), Universit&#233; de Caen Basse-Normandie
</p>
<p>marion.laignelet@univ-tlse2.fr, Francois.Rioult@info.unicaen.fr
</p>
<p>R&#233;sum&#233;. Cet article vise la description et le rep&#233;rage automatique des segments d&#8217;obsoles-
cence dans les documents de type encyclop&#233;dique. Nous supposons que des indices s&#233;mantiques
et discursifs peuvent permettre le rep&#233;rage de tels segments. Pour ce faire, nous travaillons sur
un corpus annot&#233; manuellement par des experts sur lequel nous projetons des indices rep&#233;r&#233;s au-
tomatiquement. Les techniques statistiques de base ne permettent pas d&#8217;expliquer ce ph&#233;nom&#232;ne
complexe. Nous proposons l&#8217;utilisation de techniques de fouille de donn&#233;es pour le caract&#233;riser
et nous &#233;valuons le pouvoir pr&#233;dictif de nos indices. Nous montrons, &#224; l&#8217;aide de techniques de
classification supervis&#233;e et de calcul de l&#8217;aire sous la courbe ROC, que nos hypoth&#232;ses sont
pertinentes.
</p>
<p>Abstract. This paper deals with the description and automatic tracking of obsolescence in
encyclopedic type of documents. We suppose that semantic and discursive cues may allow the
tracking of these segments. For that purpose, we have worked on an expert manually annotated
corpus, on which we have projected automatically tracked cues. Basic statistic techniques can
not account for this complex phenomenon. We propose the use of techniques of data mining to
characterize it, and we evaluate the predictive power of our cues. We show, using techniques of
supervised classification and area under the ROC curve, that our hypotheses are relevant.
</p>
<p>Mots-cl&#233;s : rep&#233;rage automatique de l&#8217;obsolescence, indices s&#233;mantiques et discursifs,
textes encyclop&#233;diques, classification supervis&#233;e, aire sous la courbe ROC.
</p>
<p>Keywords: automatic tracking of obsolescence, semantic and discursive cues, encyclo-
pedic type of documents, supervised classification, area under the ROC curve.
</p>
<p>1 Introduction
</p>
<p>Cet article s&#8217;inscrit dans le cadre d&#8217;un projet de recherche visant la description et le rep&#233;rage
automatique de segments obsolescents dans des documents de type encyclop&#233;dique. La vis&#233;e
applicative de ce travail consiste en la cr&#233;ation d&#8217;un outil d&#8217;aide &#224; la mise &#224; jour de textes
encyclop&#233;diques pour l&#8217;&#233;dition. C&#8217;est &#224; travers la notion de mise &#224; jour que celle d&#8217;obsolescence
prend son sens : un segment d&#8217;obsolescence est un segment textuel qui contient de l&#8217;information
susceptible d&#8217;&#233;voluer dans le temps.
</p>
<p>Nous supposons que des indices s&#233;mantiques et discursifs peuvent permettre le rep&#233;rage des
segments d&#8217;obsolescence. Le syst&#232;me mis en &#339;uvre a pour objectif de rep&#233;rer des combinaisons</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion Laignelet, Fran&#231;ois Rioult
</p>
<p>d&#8217;indices qui fonctionneront alors comme des marqueurs de l&#8217;obsolescence. Ce travail s&#8217;appuie
sur les recherches men&#233;es autour des notions de marqueurs textuels et discursifs comme les
mots-rep&#232;res ou les mots-titres, notions d&#233;j&#224; envisag&#233;es par (Edmundson, 1969), les cue phrases
(Grosz &amp; Sidner, 1986) ou encore les &#233;l&#233;ments participant de l&#8217;analyse de la structure de texte
(Marcu, 2000). De plus, consid&#233;rant le caract&#232;re multifonctionnel des marqueurs de surface
(Grosz &amp; Sidner, 1986), nous nous focalisons sur leur fonction pragmatique, i.e. leur aptitude
&#224; d&#233;terminer un segment d&#8217;information &#233;volutive. Enfin, les aspects discursifs des documents
&#224; travers les titres (Ho-Dac et al., 2004), les cadres de discours (Charolles, 1997) ou encore la
position dans le document occupent une place importante dans nos recherches. Nous travaillons
sur un corpus annot&#233; manuellement par des experts sur lequel nous projetons des indices rep&#233;r&#233;s
automatiquement.
</p>
<p>Pour &#233;valuer la pertinence de notre approche, nous utilisons une technique d&#8217;apprentissage au-
tomatique, la classification supervis&#233;e. Cette d&#233;marche permet &#224; la fois de v&#233;rifier si une ma-
chine peut d&#233;tecter les segments obsolescents &#224; l&#8217;aide de nos indices, et de valider leur int&#233;r&#234;t.
De plus, l&#8217;apprentissage fournit un mod&#232;le des donn&#233;es, par exemple sous forme de r&#232;gles,
que l&#8217;expert peut analyser, dans une optique de d&#233;couverte de connaissances, puis discuter,
dans le but d&#8217;int&#233;grer sa propre connaissance m&#233;tier. La classification automatique de textes est
une t&#226;che aujourd&#8217;hui bien ma&#238;tris&#233;e, comme en t&#233;moignent les derni&#232;res campagnes du D&#201;fi
Fouille de Texte. Les approches les plus courantes sont num&#233;riques et fond&#233;es sur la d&#233;tection de
n-grammes. Les indices sont dans ce cas homog&#232;nes puisqu&#8217;ils caract&#233;risent une mesure d&#8217;ap-
parition des formes de surface. Ce type de donn&#233;es est naturellement valoris&#233; par des m&#233;thodes
d&#8217;apprentissage &#224; noyaux comme les S&#233;parateurs &#224; Vaste Marge (SVM). Cependant, le mod&#232;le
fourni sous forme de combinaisons de poids est peu intelligible et n&#8217;incite pas &#224; l&#8217;interaction
avec l&#8217;expert.
</p>
<p>A contrario, notre approche est orient&#233;e vers des indices de type s&#233;mantique et discursif car
l&#8217;obsolescence n&#8217;est pas li&#233;e &#224; des formes de surface. De plus, nos indices caract&#233;risent des
propri&#233;t&#233;s tr&#232;s h&#233;t&#233;rog&#232;nes, ce qui rend d&#233;licat l&#8217;usage de SVM. Enfin, nous abordons l&#8217;appren-
tissage automatique selon une d&#233;marche exploratoire visant &#224; d&#233;terminer les indices potentiel-
lement int&#233;ressants et nous souhaitons obtenir un mod&#232;le interpr&#233;table. C&#8217;est pour ces raisons
que nous utilisons une m&#233;thode de classification supervis&#233;e &#224; base de r&#232;gles d&#8217;association. La
fouille de motifs permet en effet d&#8217;extraire de la connaissance, sous forme de r&#232;gles, sans faire
d&#8217;hypoth&#232;se sur le mod&#232;le des donn&#233;es, ni choisir a priori les descripteurs int&#233;ressants. Outre
sa vocation exploratoire, cette technique offre l&#8217;avantage de fournir un mod&#232;le interpr&#233;table &#224;
l&#8217;expert. La m&#233;thode de d&#233;cision n&#8217;est plus une bo&#238;te noire et les interactions entre expert et
fouilleur sont bien plus vivantes.
</p>
<p>La premi&#232;re section est consacr&#233;e &#224; la description de notre corpus annot&#233; manuellement, des
segments contenant de l&#8217;information obsolescente et de la d&#233;finition de la notion d&#8217;obsolescence
(section 2). Dans une seconde partie, nous d&#233;crivons quels indices linguistiques (s&#233;mantiques et
discursifs) sont utilis&#233;s (section 3). La section 4 discute de la performance de nos indices pour
une t&#226;che de classification supervis&#233;e et des connaissances obtenues.
</p>
<p>2 Donn&#233;es et Ph&#233;nom&#232;ne observ&#233;
</p>
<p>Cette section rassemble les &#233;l&#233;ments n&#233;cessaires &#224; la compr&#233;hension de l&#8217;article. Nous d&#233;cri-
vons d&#8217;abord les donn&#233;es textuelles &#224; notre disposition, puis nous expliquons le ph&#233;nom&#232;ne</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de l&#8217;obsolescence
</p>
<p>d&#8217;obsolescence.
</p>
<p>Notre corpus compte 10 000 phrases. Il est compos&#233; de deux sous-corpus : ATLAS, qui regroupe
des fiches encyclop&#233;diques &#233;dit&#233;es par les &#233;ditions Atlas, et LAROUSSE qui est constitu&#233; par
entr&#233;es des encyclop&#233;dies des &#201;ditions Larousse (le Grand Larousse Informatis&#233; et le Grand
Universel Larousse). Puisque les textes sont de type encyclop&#233;dique, ils sont r&#233;f&#233;renc&#233;s sous
des rubriques : g&#233;ographie, histoire, faune et flore, sciences et techniques, sport, &#233;conomie, etc.
Ces deux sous-corpus ont &#233;t&#233; annot&#233;s manuellement en fonction du caract&#232;re obsolescent ou
non des segments : un expert linguiste1 a annot&#233; le corpus ATLAS et le corpus LAROUSSE, ce
dernier ayant &#233;t&#233; &#233;galement annot&#233; par trois experts r&#233;dacteurs2.
</p>
<p>L&#8217;obsolescence est un ph&#233;nom&#232;ne non linguistique, cr&#233;&#233; par l&#8217;usage : les segments d&#8217;obsoles-
cence se d&#233;finissent d&#8217;abord par rapport &#224; un besoin r&#233;el, &#224; savoir la mise &#224; jour &#233;ditoriale. Ils
pr&#233;sentent ainsi la particularit&#233; de contenir de l&#8217;information susceptible d&#8217;&#233;voluer dans le temps.
</p>
<p>Nous distinguons deux types de segments d&#8217;obsolescence : d&#8217;un c&#244;t&#233; ceux dont l&#8217;information
est devenue fausse du fait de l&#8217;&#233;volution temporelle et/ou des connaissances, de l&#8217;autre, ceux
dont l&#8217;information n&#8217;est plus pertinente, plus actuelle au moment o&#249; elle est lue. Comparons les
segments obsolescents dans les deux exemples construits suivants :
</p>
<p>(1) Aujourd&#8217;hui, le PIB par habitant de la France est de 27 600 dollars.
</p>
<p>(2) En 2004, le PIB par habitant de la France est de 27 600 euros.
</p>
<p>Dans l&#8217;exemple (1), sachant qu&#8217;on est actuellement en 2009, et que le lecteur va naturellement
interpr&#233;ter l&#8217;adverbial &#171; aujourd&#8217;hui &#187; comme &#233;tant l&#8217;ann&#233;e en cours, l&#8217;information est fausse
puisque le PIB de la France le plus actuel (chiffres de 2008) est de 33 800 dollars. &#192; l&#8217;inverse,
l&#8217;exemple (2) montre un cas o&#249; l&#8217;information restera toujours vraie : en 2004, le PIB par habitant
de la France sera toujours de 27 600 dollars. Une mise &#224; jour &#233;ditoriale sera cependant n&#233;cessaire
si l&#8217;objectif du r&#233;dacteur est de fournir les r&#233;sultats les plus r&#233;cents par rapport &#224; la date en cours :
il faudra donc actualiser &#224; la fois la r&#233;f&#233;rence temporelle (&#171; En 2009 &#187;) et la valeur du PIB. Ce
cas est tr&#232;s fr&#233;quent dans les fiches/entr&#233;es du domaine g&#233;ographique.
</p>
<p>Afin de d&#233;limiter et de mieux comprendre la t&#226;che de mise &#224; jour, nous avons demand&#233; &#224; quatre
annotateurs de juger de l&#8217;obsolescence des phrases du sous-corpus LAROUSSE. Il en ressort que
ce sous-corpus est en moyenne compos&#233; de 10 &#224; 15 % de segments obsol&#232;tes par annotateur.
L&#8217;accord observ&#233; entre chacun de ces juges se situe entre 87 et 92 %.
</p>
<p>Lorsqu&#8217;on utilise le coefficient Kappa, le taux d&#8217;accord est situ&#233; entre 0.35 et 0.50 : ce score
tr&#232;s faible est directement li&#233; au fait que les segments obsolescents ne repr&#233;sentent au mieux
que 15 % de l&#8217;ensemble du sous-corpus, soit une classe minoritaire dans le corpus. L&#8217;accord
entre les juges est mieux traduit par le coefficient r de Finn3 (Hripcsak &amp; Heitjan, 2002) car il
met l&#8217;accent sur la classe minoritaire vis&#233;e : le score varie de 0.74 pour l&#8217;accord le plus bas (les
codeurs 2 et 4) &#224; 0.83 pour l&#8217;accord le plus haut (codeurs 1 et 3). Ces r&#233;sultats montrent que
l&#8217;accord entre nos experts est plut&#244;t bon m&#234;me s&#8217;il reste malgr&#233; tout une zone floue, que nous
attribuons au caract&#232;re parfois subjectif de la notion d&#8217;obsolescence.
</p>
<p>1l&#8217;un des auteurs de cet article, Marion Laignelet.
2de la soci&#233;t&#233; Larousse.
3Nous utilisons l&#8217;algorithme existant dans le logiciel R.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion Laignelet, Fran&#231;ois Rioult
</p>
<p>3 Conception des indices s&#233;mantiques et discursifs
</p>
<p>Cette section pr&#233;cise la d&#233;marche linguistique employ&#233;e pour concevoir des indices s&#233;mantiques
et discursifs potentiellement pertinents pour la caract&#233;risation de l&#8217;obsolescence.
</p>
<p>3.1 M&#233;thodologie
</p>
<p>Notre intuition et notre comp&#233;tence de linguiste nous ont naturellement amen&#233; &#224; orienter nos
recherches sur les indices de type temporels comme marqueurs potentiels de l&#8217;obsolescence.
Par ailleurs, notre int&#233;r&#234;t de longue date pour les travaux en discours nous a entra&#238;n&#233; vers l&#8217;ex-
ploitation d&#8217;indices &#224; plus grande granularit&#233; tels que les titres ou la position des paragraphes
au sein des documents. Enfin, &#224; la lumi&#232;re des annotations r&#233;elles de nos experts, nous avons
&#233;largi nos types d&#8217;indices vers la prise en compte d&#8217;entit&#233;s nomm&#233;es, de valeurs chiffr&#233;es ou
encore de l&#8217;expression du point de vue du locuteur comme indicateurs de l&#8217;obsolescence.
</p>
<p>Aujourd&#8217;hui, nous disposons d&#8217;environ 150 types d&#8217;indices. Leur rep&#233;rage et leur annotation
s&#233;mantique sont effectu&#233;s de mani&#232;re automatique avec l&#8217;outil ALIDIS (Laignelet, &#224; para&#238;tre)
d&#233;velopp&#233; &#224; l&#8217;aide de la plateforme LinguaStream4 (Widlocher &amp; Bilhaut, 2005). Si l&#8217;on consi-
d&#232;re l&#8217;ensemble des indices annot&#233;s, leur &#233;valuation indique un taux de pr&#233;cision de 93 % et un
taux de rappel de 85 %. La section suivante pr&#233;sente les classes g&#233;n&#233;rales des indices linguis-
tiques pris en compte.
</p>
<p>3.2 Description des indices potentiels de l&#8217;obsolescence
</p>
<p>En plus de leur diversit&#233;, ces indices pr&#233;sentent la caract&#233;ristique d&#8217;&#234;tre multi-&#233;chelle (i.e. d&#8217;ap-
para&#238;tre &#224; diff&#233;rents niveaux textuels).
</p>
<p>Les indices de type intra-phrastique. Une premi&#232;re classe d&#8217;indices concerne les expres-
sions temporelles. Le temps joue un r&#244;le pr&#233;pond&#233;rant dans les segments d&#8217;obsolescence. Notre
analyseur temporel rep&#232;re et annote s&#233;mantiquement les adverbiaux temporels : des syntagmes
pr&#233;positionnels (&#171; dans les ann&#233;es trente &#187;, &#171; de 1980 &#224; 2000 &#187;), des adverbes (&#171; aujourd&#8217;hui &#187;),
des syntagmes nominaux (&#171; les ann&#233;es 20 &#187;). La s&#233;mantique temporelle que nous avons mise
en &#339;uvre est tr&#232;s simple et exploite un d&#233;coupage temporel extr&#234;mement simplifi&#233;. En effet,
&#233;tant donn&#233;e notre t&#226;che, il nous semble qu&#8217;il n&#8217;est pas n&#233;cessaire de faire appel &#224; des mo-
d&#232;les plus complexes qui refl&#232;tent mieux la r&#233;alit&#233; temporelle tels que celui de (Reichenbach,
1966 1&#232;re &#233;dition 1947) ou de (Gosselin, 2005). Ainsi, nous exploitons deux types d&#8217;infor-
mation. Tout d&#8217;abord, la nature de l&#8217;expression. Elle est &#233;valu&#233;e selon les valeurs suivantes :
anaphorique si l&#8217;expression temporelle doit &#234;tre calcul&#233;e en fonction du contexte (&#171; trois jour
avant &#187;), d&#233;ictique si la date doit &#234;tre calcul&#233;e selon le moment d&#8217;&#233;nonciation (&#171; aujourd&#8217;hui &#187;),
de dur&#233;e si l&#8217;expression exprime une dur&#233;e (&#171; en trente ans &#187;), de type it&#233;ration si le processus
est it&#233;ratif (&#171; tous les ans &#187;), ponctuel (&#171; En 2008 &#187;) et enfin elle peut &#234;tre de type inachev&#233;
lorsque la fronti&#232;re finale de l&#8217;intervalle n&#8217;est potentiellement pas referm&#233;e (&#171; depuis 1997 &#187;).
Le second trait concerne le d&#233;coupage temporel. Nous consid&#233;rons simplement les cinq valeurs
suivantes : ant&#233;riorit&#233;++ pour les dates ant&#233;rieures &#224; 1949, ant&#233;riorit&#233; pour les dates de 1950
</p>
<p>4http ://www.linguastream.org : c&#8217;est une plateforme de d&#233;veloppement d&#233;di&#233;e au T.A.L.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de l&#8217;obsolescence
</p>
<p>&#224; 1989, co&#239;ncidence pour les dates de 1990 &#224; 2008, post&#233;riorit&#233; pour les dates apr&#232;s 2009 et
ind&#233;termin&#233; pour les expressions qu&#8217;on ne peut pas calculer comme les anaphoriques.
</p>
<p>En relation avec les notions de temps, nous prenons &#233;galement en compte les indices aspectuels
et modaux &#224; travers, entre autres, le rep&#233;rage de p&#233;riphrases verbales et des temps verbaux.
Ainsi, nous exploitons les expressions verbales pr&#233;sentant une action dont l&#8217;accomplissement
d&#233;bute, est en cours ou achev&#233;. Par exemple, une expression comme &#171; des recherches sont en
cours &#187; sera annot&#233;e comme une p&#233;riphrase verbale dont l&#8217;accomplissement est en cours.
</p>
<p>Les entit&#233;s nomm&#233;es semblent &#233;galement jouer un r&#244;le important dans les segments d&#8217;obsoles-
cence. Ce que nous entendons par entit&#233; nomm&#233;e est relativement vaste : nous y englobons des
expressions de mesure (&#171; 130 hab./km2 &#187;), de lieu (&#171; &#224; Paris &#187;), de personne (des noms propres
principalement), des sigles.
</p>
<p>Enfin, une derni&#232;re grande classe d&#8217;indices qui semble susceptible de marquer l&#8217;obsolescence
concerne les expressions exprimant un point de vue. Le point de vue peut prendre diff&#233;rentes
valeurs selon que l&#8217;&#233;nonciateur se distancie des propos qu&#8217;il tient, se les approprie, les juge
importants, nouveaux, etc. Par exemple, un syntagme pr&#233;positionnel comme &#171; Selon les esti-
mations de l&#8217;INSEE &#187; sera annot&#233; comme &#233;tant de type source puisqu&#8217;une source pr&#233;cise est
indiqu&#233;e, une expression comme &#171; on suppose &#187; sera annot&#233;e comme &#233;tant de type jugement, un
syntagme nominal comme &#171; les nouveaux formats de compression des donn&#233;es &#187; sera annot&#233;
comme &#233;tant de type r&#233;cence du fait de la pr&#233;sence de l&#8217;adjectif &#171; nouveau &#187;.
</p>
<p>Les indices positionnels. Ils sont de deux types. Les indices positionnels phrastiques rendent
compte de la position des indices intra-phrastiques au sein de l&#8217;unit&#233; phrase (d&#233;but et fin de
phrase). Les indices positionnels textuels rendent compte de la position des unit&#233;s phrases au
sein des paragraphes (premi&#232;re phrase ou derni&#232;re phrase du paragraphe) et des unit&#233;s para-
graphe au sein du document (premier paragraphe ou dernier paragraphe de la section, sous
section, etc.) ou encore du niveau de hi&#233;rarchie dans le document (par exemple les niveaux des
titres).
</p>
<p>Les indices hi&#233;rarchiques correspondent au fait qu&#8217;une phrase peut &#234;tre sous la d&#233;pendance
d&#8217;une autre unit&#233;, le titre. Dans notre protocole d&#8217;annotation, un titre ne peut pas faire partie
d&#8217;un segment d&#8217;obsolescence. En revanche, il peut &#234;tre un bon pr&#233;dicteur d&#8217;obsolescence pour
les phrases qui sont sous sa d&#233;pendance. Ainsi, les indices que nous projetons sur les phrases
sont &#233;galement projet&#233;s sur les titres ; les traits s&#233;mantiques des titres sont ensuite h&#233;rit&#233;s par
les phrases de la section du-dit titre.
</p>
<p>Les indices externes concernent par exemple le type de document ou le domaine pour lequel
le document est r&#233;dig&#233;. Nous exploitons une dizaine de rubriques diff&#233;rentes (histoire, g&#233;ogra-
phie, faune et flore, etc).
</p>
<p>3.3 Vers des configurations d&#8217;indices
</p>
<p>Afin de savoir si les indices que nous prenons en compte apparaissent de mani&#232;re significative
dans des segments obsolescents ou non, nous avons effectu&#233; un calcul de Chi Carr&#233; (&#967;2). Nous
constatons que sur 146 indices, 63 sont significatifs &#224; p &lt; .05 (41 le sont positivement, 22 le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion Laignelet, Fran&#231;ois Rioult
</p>
<p>sont n&#233;gativement), 36 sont non significatifs et enfin pour 47 d&#8217;entre eux, il n&#8217;y a pas suffisam-
ment d&#8217;occurrences pour que le test du &#967;2 soit valide. Comme nous le supposions d&#233;j&#224; dans
(Laignelet, 2006b), la faiblesse d&#8217;occurrence de chaque indice pris isol&#233;ment invalide l&#8217;&#233;valua-
tion de nos indices par des tests simples de corr&#233;lation tels que le test du &#967;2. Nous avons donc
mis au point un syst&#232;me de fouille de donn&#233;es qui nous permet de traiter ces indices en termes
de combinaison d&#8217;indices.
</p>
<p>3.4 Classification supervis&#233;e &#224; base de r&#232;gles d&#8217;association
</p>
<p>On dispose depuis une douzaine d&#8217;ann&#233;es d&#8217;algorithmes performants pour extraire les motifs
fr&#233;quents (i.e. les motifs pr&#233;sents dans un nombre minimum d&#8217;objets) et construire des r&#232;gles
d&#8217;association. Une r&#232;gle X &#8594; c, de pr&#233;misse X (une conjonction d&#8217;indices), et de conclusion c
(une valeur de classe), indique que les phrases contenant la combinaison d&#8217;indice X sont de la
classe c. Cette association est mesur&#233;e par une fr&#233;quence (nombre d&#8217;objets contenant X et c) et
la confiance (probabilit&#233; conditionnelle d&#8217;apparition de c connaissant celle de X).
</p>
<p>Pour classer &#224; partir de ces r&#232;gles, diverses m&#233;thodes existent (par exemple (Liu et al., 1998; Li
et al., 2001)), aux performances comparables, qui suivent le d&#233;roulement suivant :
</p>
<p>1. extraction de r&#232;gles d&#8217;association non redondantes (i.e. &#224; pr&#233;misse minimale au sens de
l&#8217;inclusion), &#224; support et confiance minimum fix&#233;s ;
</p>
<p>2. pond&#233;ration des r&#232;gles par une mesure, par exemple un &#967;2 ;
</p>
<p>3. s&#233;lection des r&#232;gles suivant leur mesure et leur repr&#233;sentativit&#233; pour les classes minori-
taires ;
</p>
<p>4. un nouvel exemple est class&#233; &#224; l&#8217;issue d&#8217;un vote r&#233;alis&#233; par toutes les r&#232;gles qui s&#8217;ap-
pliquent, selon leur poids.
</p>
<p>Pour nos exp&#233;riences, nous avons impl&#233;ment&#233; une adaptation de (Li et al., 2001), capable de
consid&#233;rer diff&#233;rents types de r&#232;gles (Rioult et al., 2008) &#224; des fins exploratoires :
&#8211; des r&#232;gles d&#8217;associations classiques ;
&#8211; des r&#232;gles d&#8217;association g&#233;n&#233;ralis&#233;es (ou disjonctives), qui couvrent les mod&#232;les utilisant des
</p>
<p>r&#232;gles de forme quelconque : r&#232;gles prescrivant une classe, excluant une classe, ou contenant
des attributs n&#233;gatifs en pr&#233;misse ;
</p>
<p>&#8211; des r&#232;gles construites sur des motifs &#233;mergents : ces motifs indiquent un contraste entre les
classes, car ils sont significativement plus pr&#233;sents dans l&#8217;une que dans les autres.
</p>
<p>L&#8217;&#233;valuation de la performance d&#8217;un classifieur automatique se fait g&#233;n&#233;ralement &#224; l&#8217;aide du
score de classification, c&#8217;est-&#224;-dire la proportion d&#8217;objets bien class&#233;s. Pourtant, cet indice a
peu de sens lorsque les classes ne sont pas &#233;quilibr&#233;es, comme c&#8217;est le cas pour notre probl&#232;me.
Pour chaque classe, les mesures de rappel (proportion d&#8217;exemples d&#233;couverts), de pr&#233;cision
(proportion d&#8217;exemples correctement attribu&#233;s) et leur moyenne harmonique, le F-score sont
des scores traditionnellement utilis&#233;s dans les syst&#232;mes de recherche d&#8217;information. Dans notre
cas, pour la classe obsolescente, le rappel est de 78 % et la pr&#233;cision de 34 % : ce r&#233;sultat est
encourageant, d&#8217;autant plus que dans un contexte encyclop&#233;dique, il vaut mieux favoriser le rap-
pel que la pr&#233;cision, car le fait d&#8217;oublier une r&#233;vision est plus grave que d&#8217;indiquer inutilement
un paragraphe &#224; r&#233;viser. Compte tenu de ces performances et des proportions de classe, notre
m&#233;thode permet de diminuer de deux tiers la t&#226;che du correcteur humain.
</p>
<p>Cependant, le rappel et la pr&#233;cision sont caract&#233;ristiques d&#8217;une classe et non de l&#8217;ensemble. Ces
mesures &#233;valuent la performance statique du classifieur, qui peut &#234;tre variablement interpr&#233;t&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de l&#8217;obsolescence
</p>
<p>En faisant &#233;voluer la confiance accord&#233;e au classifieur, il est possible de construire une courbe
dite de ROC (Fawcett, 2003), qui repr&#233;sente pour chaque seuil de confiance le taux de vrais po-
sitifs (proportion d&#8217;&#233;l&#233;ments bien class&#233;es pour la classe positive) et de faux positifs (proportion
d&#8217;&#233;l&#233;ments mal class&#233;es). Cette courbe permet d&#8217;optimiser, au choix, le rappel ou la pr&#233;cision,
selon les besoins de l&#8217;application. De plus, elle offre l&#8217;avantage de fournir une mesure ind&#233;pen-
dante de la r&#233;partition des classes. La mesure de l&#8217;aire qu&#8217;elle d&#233;finit est un indicateur fiable de
la performance du classifieur.
</p>
<p>4 &#201;valuation - Discussion
</p>
<p>Dans cette section, nous &#233;valuons la pertinence de nos indices &#224; l&#8217;aide d&#8217;une m&#233;thode de classi-
fication supervis&#233;e &#224; base d&#8217;associations. La mesure de l&#8217;aire sous la courbe ROC du classifieur
obtenu est un indicateur fiable de la capacit&#233; de ces indices &#224; pr&#233;dire l&#8217;obsolescence. Nous
analysons ensuite les connaissances d&#233;couvertes et discutons de leur int&#233;r&#234;t d&#8217;un point de vue
linguistique.
</p>
<p>4.1 R&#233;sultats en classification supervis&#233;e
</p>
<p>Comme indiqu&#233; &#224; la section 3.4, nous avons exp&#233;riment&#233; trois types de r&#232;gles pour construire
un classifieur &#224; partir de nos indices. L&#8217;aire sous la courbe ROC obtenue est la suivante :
</p>
<p>&#8211; pour les r&#232;gles d&#8217;association classique : 79, 8%
&#8211; pour les r&#232;gles g&#233;n&#233;ralis&#233;es (dont les pr&#233;misses contiennent entre autres des attributs n&#233;ga-
</p>
<p>tifs) : 79, 2%
&#8211; pour les motifs &#233;mergents : 76, 5%
</p>
<p>Les trois courbes correspondantes sont repr&#233;sent&#233;es &#224; la figure 1. La diagonale repr&#233;sente la
performance d&#8217;un classifieur al&#233;atoire.
</p>
<p> 0
</p>
<p> 0.2
</p>
<p> 0.4
</p>
<p> 0.6
</p>
<p> 0.8
</p>
<p> 1
</p>
<p> 0  0.2  0.4  0.6  0.8  1
</p>
<p>r&#232;gles avec n&#233;gations
al&#233;atoire
</p>
<p>r&#232;gles classiques
motifs &#233;mergents
</p>
<p>FIG. 1 &#8211; Courbes ROC des diff&#233;rents classifieurs. En abscisse le taux de faux positifs, en ordonn&#233;e
le taux de vrais positifs. Chaque point est obtenu en seuillant la probabilit&#233; indiqu&#233;e par le classifieur.
</p>
<p>Ces r&#233;sultats (autour de 79% quand l&#8217;al&#233;atoire donne 50%) montrent que nos indices s&#233;man-
tiques et linguistiques sont pertinents pour la caract&#233;risation de l&#8217;obsolescence. On constate que
les &#233;carts de performance sont marginaux et que les r&#232;gles classiques obtiennent les meilleures
performances. Dans la suite de la discussion, nous analysons donc la connaissance indiqu&#233;e par
ces r&#232;gles.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion Laignelet, Fran&#231;ois Rioult
</p>
<p>4.2 Analyse des connaissances obtenues
</p>
<p>Avant de d&#233;crire les r&#232;gles apprises par le classifieur et pertinentes pour la description et la
pr&#233;diction de l&#8217;obsolescence, en voici un exemple :
</p>
<p>entiteNom.classe :mesure ;sousClasse :geopolitique&#8743;title.entiteNom.classe :geopolitique &#8722;&#8594; classe :obsolescence
</p>
<p>Cette r&#232;gle stipule qu&#8217;une entit&#233; nomm&#233;e de type mesure geopolitique (&#171; 3000 habitants &#187;) as-
soci&#233; &#224; la pr&#233;sence dans un titre d&#8217;une entit&#233; nomm&#233;e de type g&#233;opolitique (&#171; taux de natalit&#233; &#187;)
sont importantes pour le rep&#233;rage des phrases obsolescentes.
</p>
<p>Parmi les r&#232;gles g&#233;n&#233;r&#233;es, l&#8217;association entre des indices hi&#233;rarchiques et des indices intra-
phrastiques est relativement fr&#233;quente. Ainsi, les titres comprenant une expression de type
g&#233;opolitique (&#171; La population &#187;) sont fr&#233;quemment associ&#233;s &#224; un indice de plus bas niveau
comme une entit&#233; nomm&#233;e de type g&#233;opolitique (&#171; 100 000 hab. &#187;), mesure (&#171; 78 % &#187;) ou
lieu (&#171; Madrid &#187;, &#171; Barcelone &#187;) ou encore une expression temporelle d&#233;ictique et de type
co&#239;ncidence. La relation est forte &#233;galement entre des titres contenant un verbe au conditionnel
et des phrases dans lesquelles se trouve une entit&#233; nomm&#233;e de type lieu.
</p>
<p>(4) La population
&#167; [...] Une quarantaine de villes ont plus de 100 000 hab., domin&#233;es par les p&#244;les de Madrid et
Barcelone.
</p>
<p>Nous observons &#233;galement une forte attraction entre des indices positionnels textuels et des
indices intra-phrastiques : le premier paragraphe d&#8217;une division associ&#233; &#224; une expression tem-
porelle d&#233;ictique et de type co&#239;ncidence (&#171; aujourd&#8217;hui &#187;) ou &#224; une entit&#233; nomm&#233;e de type g&#233;o-
politique entra&#238;neront souvent l&#8217;obsolescence du segment dans lequel l&#8217;indice intra-phrastique
appara&#238;t. Il en est de m&#234;me lorsque qu&#8217;une entit&#233; nomm&#233;e de type mesure &#233;volutive appara&#238;t
dans le dernier paragraphe d&#8217;une section.
</p>
<p>Concernant la position des phrases au sein des paragraphes, les premi&#232;res phrases de para-
graphe contiennent souvent des indices temporels d&#233;ictiques de type co&#239;ncidence ou des entit&#233;s
nomm&#233;es de type mesure &#233;volutive lorsqu&#8217;elles sont obsolescentes. De plus, lorsqu&#8217;un verbe au
conditionnel associ&#233; &#224; une entit&#233; nomm&#233;e de type g&#233;opolitique sont en fin de paragraphe, alors
la mise &#224; jour du segment est fortement pr&#233;visible.
</p>
<p>(5) &#167; L&#8217;Union europ&#233;enne &#224; elle seule se serait d&#233;poss&#233;d&#233;e d&#8217;un patrimoine de 215 milliards de
dollars.
</p>
<p>L&#8217;obsolescence est &#233;galement mise en valeur par l&#8217;association marqu&#233;e entre plusieurs indices
intra-phrastiques. Ainsi, une phrase sera obsolescente si une expression temporelle d&#233;ictique
de type co&#239;ncidence cooccurre avec une entit&#233; nomm&#233;e de type g&#233;opolitique ou de type mesure
&#233;volutive.
</p>
<p>(6) &#167; Les Noirs repr&#233;sentent aujourd&#8217;hui 12 % de la population ; plus de 50 % d&#8217;entre eux sont
encore concentr&#233;s dans le Sud historique.
</p>
<p>La pr&#233;sence conjointe d&#8217;une entit&#233; nomm&#233;e de type g&#233;opolitique avec une entit&#233; nomm&#233;e de
type mesure &#233;volutive ou de type lieu ou encore de type g&#233;opolitique est &#233;galement pertinente
pour le rep&#233;rage des segments obsolescents.
</p>
<p>(7) &#167; Les industries de pointe (11 % des emplois salari&#233;s dans les activit&#233;s high-tech) sont bien
repr&#233;sent&#233;es &#224; Lyon et &#224; Grenoble (&#233;lectronique, micro- et nanotechnologies).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de l&#8217;obsolescence
</p>
<p>Des r&#232;gles mettant en relation trois niveaux diff&#233;rents d&#8217;indices sont apprises par le syst&#232;me.
Ainsi, une phrase sera consid&#233;r&#233;e comme obsolescente si (i) elle est la derni&#232;re du paragraphe,
si (ii) le paragraphe est en premi&#232;re position dans la division ou en fin de division et si (iii) le
titre de la section contient une entit&#233; nomm&#233;e de type g&#233;opolitique. Il est est de m&#234;me pour une
phrase (i) contenant une entit&#233; nomm&#233;e de lieu r&#233;f&#233;rant &#224; une ville, (ii) qui est situ&#233;e en derni&#232;re
position de paragraphe et (iii) le titre chapeautant la section contient une entit&#233; nomm&#233;e de type
g&#233;opolitique.
</p>
<p>Les r&#233;sultats montrent enfin qu&#8217;un indice de type externe comme le domaine peut jouer un r&#244;le
important. Ainsi, une entr&#233;e de type g&#233;ographie va &#234;tre productive en phrases obsolescentes si
la phrase contient une entit&#233; nomm&#233;e de type mesure g&#233;opolitique.
</p>
<p>4.3 Discussion
</p>
<p>Les r&#232;gles que nous venons de d&#233;crire confirment nos intuitions concernant la prise en consi-
d&#233;ration d&#8217;indices de types diff&#233;rents, de granularit&#233; variable ainsi que le fait de les envisager
en termes de faisceau, de configuration et non de mani&#232;re isol&#233;e. Nos conclusions vont ainsi
dans le sens, entre autres travaux, des r&#233;sultats de (Marcu, 2000) sur l&#8217;importance de la position
dans les documents mais &#233;galement de (HoDac, 2007) et de (Bouffier, 2008) concernant la prise
en compte d&#8217;indices combin&#233;s et &#224; granularit&#233; variable. Les travaux de (Teufel, 1999) mettent
&#233;galement en relation des indices de types aussi vari&#233;s que ceux que nous exploitons dans le
but de rep&#233;rer automatiquement les phrases importantes (argumentative zoning) dans des &#233;crits
scientifiques &#224; des fins de g&#233;n&#233;ration automatique de r&#233;sum&#233;s d&#8217;article.
</p>
<p>Une derni&#232;re remarque concernant la position des indices au sein des phrases nous semble
importante &#224; mettre en &#233;vidence. En effet, nous sommes surpris de ne pas trouver de relation
forte entre la position des indices &#224; l&#8217;initiale de la phrase et le fait que les segments soient
obsolescents. Contrairement &#224; nos attentes, c&#8217;est m&#234;me la position de fin de phrase qui est
pertinente, notamment lorsque cette position est occup&#233;e par une entit&#233; nomm&#233;e de type mesure.
Ces r&#233;sultats (quantitatifs) vont &#224; l&#8217;encontre des hypoth&#232;ses que nous avions formul&#233;es dans
(Laignelet, 2006a) concernant le potentiel structurant des introducteurs de cadre (Charolles,
1997).
</p>
<p>5 Conclusion - Perspectives
</p>
<p>Le ph&#233;nom&#232;ne de l&#8217;obsolescence est un ph&#233;nom&#232;ne rare (entre 10 et 15 % du nombre de phrases
de notre corpus) et relativement flou (le consensus entre les annotateurs n&#8217;est pas total). Les
indices s&#233;mantiques et discursifs que nous rep&#233;rons et annotons de mani&#232;re automatique se
r&#233;v&#232;lent, &#224; travers l&#8217;aire sous la courbe ROC, &#234;tre de bons indices pour r&#233;pondre &#224; notre t&#226;che
de recherche de segments obsolescents.
</p>
<p>Les r&#232;gles d&#8217;association produites par l&#8217;outil de classification automatique nous encouragent
dans l&#8217;id&#233;e que la combinaison d&#8217;indices est pertinente pour le rep&#233;rage automatique de l&#8217;ob-
solescence : d&#8217;un c&#244;t&#233; ces r&#232;gles s&#8217;inscrivent dans la lign&#233;e des travaux en linguistique et en
T.A.L., de l&#8217;autre, les scores fournis (entre 76 et 80 % d&#8217;aire sous la courbe ROC selon les types
de r&#232;gles, cf. 3.4) valident la pertinence de nos indices. Parall&#232;lement &#224; ce constat, ces r&#233;sultats
nous confirment dans nos choix m&#233;thodologiques &#224; consid&#233;rer des indices de types diff&#233;rents,
de niveaux de granularit&#233; vari&#233;s, du mot au discours.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion Laignelet, Fran&#231;ois Rioult
</p>
<p>Ce travail ouvre nos perspectives selon deux axes principaux. D&#8217;un c&#244;t&#233;, il nous semble impor-
tant d&#8217;affiner les indices, de les regrouper par valeurs s&#233;mantiques (par exemple cr&#233;er un indice
d&#233;ictique qui regrouperait des adverbiaux de type ponctuel et inachev&#233;) dans le but de rendre le
mod&#232;le plus pertinent et plus efficace. D&#8217;un autre c&#244;t&#233;, il sera n&#233;cessaire de projeter les r&#232;gles
apprises automatiquement sur un corpus non annot&#233; manuellement afin de rep&#233;rer les segments
d&#8217;obsolescence et de les soumettre &#224; des experts afin qu&#8217;ils puissent juger de leur pertinence par
rapport &#224; la t&#226;che originelle, &#224; savoir l&#8217;aide &#224; la mise &#224; jour de contenus de type encyclop&#233;dique.
</p>
<p>R&#233;f&#233;rences
BOUFFIER A. (2008). Analyse discursive automatique de textes - Application &#224; la mod&#233;lisation de
textes incitatifs. PhD thesis, Universit&#233; Paris Nord - Villetaneuse.
</p>
<p>CHAROLLES M. (1997). L&#8217;encadrement du discours, univers, champs, domaine et espaces. Cahiers de
Recherche linguistique, 6.
EDMUNDSON H. (1969). New methods in automatic abstracting. Journal of ACM, 16(2), p. 264&#8211;285.
FAWCETT T. (2003). ROC Graphs : Notes and Practical Considerations for Researchers. Rapport
interne, HP Laboratories.
</p>
<p>GOSSELIN L. (2005). Temporalit&#233; et modalit&#233;. de Boeck.Duculot.
</p>
<p>GROSZ J. &amp; SIDNER A. (1986). Attention, intentions, and the structure of discourse. Computational
linguistics, 3(12).
HO-DAC M., JACQUES M.-P. &amp; REBEYROLLES J. (2004). Sur la fonction discursive des titres.
Chypre : Actes des 4&#232;mes Journ&#233;es de Linguistique de Corpus Perspectives.
</p>
<p>HODAC M. (2007). La position initiale dans l&#8217;organisation du discours : une exploration en corpus.
PhD thesis, Universit&#233; de Toulouse 2 - Le Mirail.
</p>
<p>HRIPCSAK G. &amp; HEITJAN D. (2002). Measuring agreement in medical informatics reliability studies.
Journal of Biomedical Informatics, 35(2), 99&#8211;110.
LAIGNELET M. (2006a). Les titres et les introducteurs de cadre comme indices pour le rep&#233;rage de
segments d&#8217;information &#233;volutive. In ISDD, Caen, France.
</p>
<p>LAIGNELET M. (2006b). Rep&#233;rage de segments d&#8217;information &#233;volutive dans des documents de type
encyclop&#233;dique. In Actes de la 13&#232;me conf&#233;rence RECITAL.
</p>
<p>LAIGNELET M. (&#224; para&#238;tre). Associer analyse syntaxique et analyse discursive dans un syst&#232;me d&#8217;aide
&#224; la mise &#224; jour de documents encyclop&#233;diques. Rapport interne, Universit&#233; de Toulouse 2 - Le Mirail.
</p>
<p>LI W., HAN J. &amp; PEI J. (2001). Cmar : Accurate and efficient classification based on multiple class-
association rules. In IEEE International Conference on Data Mining.
</p>
<p>LIU B., HSU W. &amp; MA Y. (1998). Integrating classification and association rules mining. In Interna-
tional Conference on Knowledge Discovery and Data Mining, p. 80&#8211;86.
</p>
<p>MARCU D. (2000). The rhetorical parsing of unrestricted texts : A surface-based approach. Computa-
tional Linguistics, 26.
REICHENBACH (1966 (1&#232;re &#233;dition 1947)). Elements of symbolic logic New- york. Free-Press,.
</p>
<p>RIOULT F., ZANUTTINI B. &amp; CR&#201;MILLEUX B. (2008). Apport de la n&#233;gation pour la classification
supervis&#233;e &#224; l&#8217;aide d&#8217;associations. In F. D&#8217;ALCH&#201; BUC, Ed., Conf&#233;rence francophone d&#8217;Apprentissage
Automatique (CAP 2008), p. 183&#8211;196 : C&#233;padu&#232;s.
</p>
<p>TEUFEL S. (1999). Argumentative Zoning. PhD thesis, Universit&#233; de Edimbourg.
</p>
<p>WIDLOCHER A. &amp; BILHAUT F. (2005). La plate-forme linguastream : un outil d&#8217;exploration linguis-
tique sur corpus. In Actes de la 12e Conference TALN, Dourdan, France.</p>

</div></div>
</body></html>