<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;tection des contradictions dans les annotations s&#233;mantiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>D&#233;tection des contradictions
dans les annotations s&#233;mantiques &#8727;
</p>
<p>Yue Ma, Laurent Audibert
Laboratoire d&#8217;Informatique de l&#8217;universit&#233; Paris-Nord (LIPN) - UMR 7030
</p>
<p>Universit&#233; Paris 13 - CNRS
99, avenue Jean-Baptiste Cl&#233;ment - F-93430 Villetaneuse, France
</p>
<p>first-name.family-name@lipn.univ-paris13.fr
</p>
<p>R&#233;sum&#233;. L&#8217;annotation s&#233;mantique a pour objectif d&#8217;apporter au texte une repr&#233;sentation
explicite de son interpr&#233;tation s&#233;mantique. Dans un pr&#233;c&#233;dent article, nous avons propos&#233; d&#8217;&#233;tendre
les ontologies par des r&#232;gles d&#8217;annotation s&#233;mantique. Ces r&#232;gles sont utilis&#233;es pour l&#8217;annotation
s&#233;mantique d&#8217;un texte au regard d&#8217;une ontologie dans le cadre d&#8217;une plate-forme d&#8217;annotation
linguistique automatique. Nous pr&#233;sentons dans cet article une mesure, bas&#233;e sur la valeur de
Shapley, permettant d&#8217;identifier les r&#232;gles qui sont sources de contradiction dans l&#8217;annotation
s&#233;mantique. Par rapport aux classiques mesures de pr&#233;cision et de rappel, l&#8217;int&#233;r&#234;t de cette me-
sure est de ne pas n&#233;cessiter de corpus manuellement annot&#233;, d&#8217;&#234;tre enti&#232;rement automatisable
et de permettre l&#8217;identification des r&#232;gles qui posent probl&#232;me.
</p>
<p>Abstract. The semantic annotation has the objective to bring to a text an explicit repre-
sentation of its semantic interpretation. In a preceding article, we suggested extending ontolo-
gies by semantic annotation rules. These rules are used for the semantic annotation of a text
with respect to an ontology within the framework of an automated linguistic annotation plat-
form. We present in this article a measure, based on the Shapley value, allowing to identify the
rules which are sources of contradictions in the semantic annotation. With regard to the clas-
sic measures, precision and recall, the interest of this measure is without the requirement of
manually annotated corpus, completely automated and its ability to identify rules which raise
problems.
</p>
<p>Mots-cl&#233;s : Annotation s&#233;mantique, valeur de Shapley, plate-forme d&#8217;annotation.
</p>
<p>Keywords: Semantic annotation, Shapley value, annotation platform.
</p>
<p>1 Introduction
</p>
<p>La mod&#233;lisation des connaissances d&#8217;un domaine de sp&#233;cialit&#233; par le biais des ontologies et
l&#8217;annotation linguistique de documents textuels, constituent deux probl&#233;matiques cruciales de
l&#8217;ing&#233;nieurie des connaissances et du traitement automatique des langues. Ces deux probl&#233;ma-
tiques ont &#233;t&#233; largement &#233;tudi&#233;es ind&#233;pendamment, mais la litt&#233;rature concernant l&#8217;annotation
s&#233;mantique au regard d&#8217;une ontologie n&#8217;est pas tr&#232;s importante. Les travaux dans ce domaine
</p>
<p>&#8727; Ce travail a &#233;t&#233; r&#233;alis&#233; dans le cadre du programme Quaero, financ&#233; par OSEO, agence nationale de valori-
sation de la recherche.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y. MA, L. Audibert
</p>
<p>s&#8217;appuient g&#233;n&#233;ralement sur des ontologies enrichies de connaissances linguistiques permettant
de mettre en correspondance des &#233;l&#233;ments de l&#8217;ontologie avec des fragments de textes.
</p>
<p>Dans un pr&#233;c&#233;dent article (Ma et al., 2009), nous avons propos&#233; d&#8217;&#233;tendre les ontologies par
des r&#232;gles d&#8217;annotation s&#233;mantique plut&#244;t que par l&#8217;ajout d&#8217;un niveau linguistique. Cette solu-
tion s&#8217;int&#232;gre mieux dans le cadre des plates-formes d&#8217;annotation puisqu&#8217;elle s&#8217;appuie sur les
&#233;tages inf&#233;rieurs d&#8217;annotations linguistiques de la plate-forme. Cette solution pr&#233;sente &#233;gale-
ment l&#8217;avantage de distinguer clairement le processus d&#8217;analyse linguistique et la t&#226;che d&#8217;inter-
pr&#233;tation s&#233;mantique, qui seule met l&#8217;ontologie en jeu.
</p>
<p>L&#8217;un des int&#233;r&#234;ts de cette extension &#224; base de r&#232;gles est que ces derni&#232;res sont inf&#233;rables par un
ordinateur pour pouvoir &#234;tre apprises (semi-)automatiquement &#224; partir d&#8217;un corpus s&#233;mantique-
ment annot&#233; selon l&#8217;ontologie &#224; &#233;tendre. Cependant, un apprentissage automatique de ces r&#232;gles
g&#233;n&#233;rera in&#233;vitablement du bruit qui se traduira par des erreurs d&#8217;annotation. L&#8217;objectif du pr&#233;-
sent article est justement de pr&#233;senter une mesure, bas&#233;e sur la valeur de Shapley, permettant
d&#8217;identifier automatiquement les r&#232;gles qui sont sources de contradiction dans les annotations
s&#233;mantiques.
</p>
<p>2 Extension &#224; base de r&#232;gles d&#8217;annotation
</p>
<p>2.1 Diff&#233;rents types d&#8217;annotation
</p>
<p>FIG. 1 &#8211; Exemple d&#8217;annotation de &quot;Marie lit une pi&#232;ce de th&#233;&#226;tre de Moli&#232;re&quot;
</p>
<p>Nous distinguons les types d&#8217;annotations s&#233;mantiques selon la nature de l&#8217;&#233;l&#233;ment ontologique
auquel elles se rattachent.
</p>
<p>Certains mots ou expressions renvoient &#224; des instances de concepts. On les d&#233;signe traditionnel-
lement sous le terme d&#8217;entit&#233;s nomm&#233;es car ils renvoient &#224; des entit&#233;s r&#233;f&#233;rentielles de mani&#232;re
autonome et conventionnelle, comme le mot Marie dans l&#8217;exemple de la figure 1. Le processus
d&#8217;annotation consiste &#224; cr&#233;er des instances de concepts et &#224; leur rattacher ces entit&#233;s nomm&#233;es.
</p>
<p>Certains mots ou expressions d&#233;notent des concepts. Ils constituent g&#233;n&#233;ralement le vocabulaire
sp&#233;cialis&#233; du domaine consid&#233;r&#233;, i.e. la terminologie du domaine. Ces termes (par ex. pi&#232;ce de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection des contradictions dans les annotations s&#233;mantiques
</p>
<p>th&#233;&#226;tre) sont souvent compos&#233;s de plusieurs mots et ils sont importants &#224; rep&#233;rer parce qu&#8217;ils
sont s&#233;mantiquement plus pertinents que les mots qui les composent.
</p>
<p>Certains mots ou expressions d&#233;notent des r&#244;les conceptuels. De m&#234;me que les termes peuvent
&#234;tre rattach&#233;s &#224; des concepts dans le processus d&#8217;annotation, ils peuvent &#234;tre rattach&#233;s &#224; des
r&#244;les si les notions sous-jacentes ont &#233;t&#233; mod&#233;lis&#233;es sous la forme de r&#244;les plut&#244;t que comme
concepts. C&#8217;est le cas de lit dans l&#8217;exemple de la figure 1, mais le fragment de texte annot&#233; est
souvent plus large, les r&#244;les s&#8217;exprimant souvent par tournures de phrases qui ne se r&#233;duisent
pas &#224; un mot-clef.
</p>
<p>Certains fragments de texte renvoient &#224; des relations entre instances : une pi&#232;ce de th&#233;&#226;tre de
Moli&#232;re dans l&#8217;exemple de la figure 1. C&#8217;est souvent un large fragment qui est annot&#233; comme
une relation entre instances.
</p>
<p>Certains fragments textuels, enfin, expriment des axiomes ontologiques. Si on &#233;tait capable
d&#8217;analyser une phrase comme les pi&#232;ces de th&#233;&#226;tre sont toujours &#233;crites par quelqu&#8217;un, on
pourrait de la m&#234;me mani&#232;re l&#8217;associer &#224; un axiome exprimant une restriction de cardinalit&#233; du
r&#244;le a-pour-auteur.
</p>
<p>2.2 D&#233;finition de l&#8217;extension
</p>
<p>Soit O = &#12296;C,R, I,RI,A&#12297; une ontologie compos&#233;e d&#8217;un ensemble de concepts (C), de r&#244;les
(R), d&#8217;instances (I), de relations entre instances (RI) et d&#8217;axiomes (A) etR = &#12296;RC ,RR,RI ,
RRI ,RA&#12297;, un ensemble de r&#232;gles permettant d&#8217;annoter des fragments de textes en les reliant
&#224; des concepts (RC), des r&#244;les (RR), des instances (RI), des relations entre instances (RRI)
ou des axiomes (RA). Une r&#232;gle est la donn&#233;e d&#8217;un couple (P,C) o&#249; P (Pr&#233;misse) d&#233;crit les
conditions qu&#8217;un segment de texte doit v&#233;rifier pour &#234;tre annot&#233; et C (Conclusion) indique
comment annoter le segment. Nous disons qu&#8217;une ontologie OR est &#233;tendue si et seulement si :
&#8211; pour chaque concept c de C il existe un couple de r&#232;gles (Cc, Ic) concluant sur c et telles que
Cc &#8712; RC et Ci &#8712; RI ;
</p>
<p>&#8211; pour chaque r&#244;le r de R il existe un couple de r&#232;gles (Rr, RIr) concluant sur r et telles que
Rr &#8712; RI et RIr &#8712; RRI ;
</p>
<p>&#8211; pour chaque axiome a de A il existe une r&#232;gle Aa &#8712; RA concluant sur a.
</p>
<p>2.3 Expression des r&#232;gles
</p>
<p>La pr&#233;misse d&#8217;une r&#232;gle peut &#234;tre repr&#233;sent&#233;e par un ensemble de patrons qui s&#8217;appliquent sur un
corpus. S&#8217;il a &#233;t&#233; pr&#233;alablement analys&#233; par certains modules d&#8217;annotation (&#233;tiquetage morpho-
syntaxique, reconnaissance d&#8217;entit&#233;s nomm&#233;es, &#233;tiquetage terminologique, par exemple) celui-
ci porte d&#233;j&#224; des annotations linguistiques. Un patron est une expression qui s&#8217;appuie sur ces
diff&#233;rents niveaux d&#8217;annotations. L&#8217;application d&#8217;un patron sur un corpus est une op&#233;ration qui
retourne un ensemble de segments du corpus &#224; annoter selon la conclusion de la r&#232;gle.
</p>
<p>A titre d&#8217;illustration, voici trois exemples distincts de patrons, &#233;crits dans un pseudo langage
pour en faciliter la compr&#233;hension, pour rep&#233;rer dans le texte des occurrences du concept infor-
matique Syst&#232;me d&#8217;exploitation :
</p>
<p>1. [texte=&quot;syst&#232;me d&#8217;exploitation&quot;]
</p>
<p>2. [lemme=&quot;syst&#232;me&quot;][lemme=&quot;de&quot;][lemme=&quot;exploitation&quot;]</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y. MA, L. Audibert
</p>
<p>3. [terme=&quot;syst&#232;me d&#8217;exploitation&quot;]
</p>
<p>texte correspond &#224; la forme brute du texte, lemme &#224; la forme lemmatis&#233;e des mots et terme
aux annotations de l&#8217;extracteur de termes. Ces trois patrons montrent l&#8217;int&#233;r&#234;t de l&#8217;utilisation des
diff&#233;rents types d&#8217;annotations de la plate-forme. En effet, le premier patron n&#8217;est pas g&#233;n&#233;rique
et ne peut pas reconna&#238;tre de simples variations comme Syst&#232;me d&#8217;exploitation ou syst&#232;mes
d&#8217;exploitation. Le second est plus g&#233;n&#233;rique car insensible &#224; la casse et au nombre. Le dernier
est encore plus g&#233;n&#233;rique car, selon l&#8217;extracteur de termes utilis&#233;, il peut reconna&#238;tre des cha&#238;nes
comme OS pour lesquelles l&#8217;extracteur proposera la forme canonique syst&#232;me d&#8217;exploitation.
</p>
<p>3 Contradictions dans les annotations s&#233;mantiques
</p>
<p>L&#8217;objectif d&#8217;une extension d&#8217;ontologie par des r&#232;gles d&#8217;annotation, comme nous venons de le
d&#233;crire, est de r&#233;aliser de l&#8217;annotation s&#233;mantique automatique dans le cadre d&#8217;une plate-forme
d&#8217;annotation. Cette annotation permet de proposer une interpr&#233;tation ontologique du texte an-
not&#233;. In&#233;vitablement, certaines annotations seront sources de contradictions au regard de l&#8217;on-
tologie. La cause r&#233;elle d&#8217;une contradiction peut venir du texte lui-m&#234;me, de l&#8217;ontologie ou
encore des r&#232;gles d&#8217;annotations.
</p>
<p>Dans cet article, nous ne cherchons pas &#224; remettre en question la coh&#233;rence du texte. D&#8217;autre
part, une ontologie est g&#233;n&#233;ralement constitu&#233;e manuellement, ou partiellement manuellement
et fait l&#8217;objet d&#8217;une attention particuli&#232;re (v&#233;rifications, &#233;volutions. . .). Par contre, les r&#232;gles
d&#8217;annotation ne feront probablement pas l&#8217;objet d&#8217;autant d&#8217;attention, entre autres parce qu&#8217;elles
sont bien plus nombreuses que les &#233;l&#233;ments constitutifs de l&#8217;ontologie, et que leur validation
doit se faire au regard de corpus de taille importante. Notre intention est d&#8217;ailleurs d&#8217;acqu&#233;rir
ces r&#232;gles par une proc&#233;dure aussi automatis&#233;e que possible. Ainsi, lorsqu&#8217;une contradiction est
d&#233;tect&#233;e, la cause la plus probable est bien entendu &#224; chercher dans les r&#232;gles.
</p>
<p>Commen&#231;ons par formaliser le r&#233;sultat d&#8217;une annotation s&#233;mantique.
</p>
<p>Definition 1 (Annotation) Une annotation est la donn&#233;e d&#8217;une paire d&#233;not&#233;e Anno d&#233;finie de
la mani&#232;re suivante :
&#8211; si t est un segment de texte reconnu par une r&#232;gle Cc &#8712; RC concluant sur c &#8712; C, alors
Anno = (t &#8801; c, Cc) ;
</p>
<p>&#8211; si t est un segment de texte reconnu par une r&#232;gle Ic &#8712; RI concluant sur c &#8712; C, alors
Anno = (c(t), Ic) ;
</p>
<p>&#8211; si t est un segment de texte reconnu par une r&#232;gle Rr &#8712; RR concluant sur r &#8712; R, alors
Anno = (t &#8801; r, Rr) ;
</p>
<p>&#8211; si t1 et t2 sont deux segments de texte reconnus par une r&#232;gle RIr &#8712; RRI concluant sur
r &#8712; R, alors Anno = (r(t1, t2), RIr) ;
</p>
<p>Le processus d&#8217;annotation s&#233;mantique produit donc un ensemble d&#8217;annotations ANNT d&#233;fini
par :
</p>
<p>ANNT = {Anno | Anno est une annotation}.
</p>
<p>Soit Anno une annotation constitu&#233;e de la paire (ax, ru), nous d&#233;finissons deux fonctions de
projections p1(.) et p2(.) telles que p1(Anno) = ax et p2(Anno) = ru. Concr&#232;tement, p1(.)
et p2(.) permettent respectivement de faire r&#233;f&#233;rence au premier &#233;l&#233;ment (i.e. l&#8217;annotation pro-
prement dite) ou au deuxi&#232;me &#233;l&#233;ment (i.e.. la r&#232;gle d&#8217;annotation) d&#8217;une annotation. Par un</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection des contradictions dans les annotations s&#233;mantiques
</p>
<p>petit abus de notation, si ANNT d&#233;signe un ensemble d&#8217;annotations, nous d&#233;finissons &#233;galement
p1(ANNT) = {p1(Anno) | Anno &#8712; ANNT} et p2(ANNT) = {p2(Anno) | Anno &#8712; ANNT}.
Nous pouvons maintenant donner une d&#233;finition formelle &#224; la notion d&#8217;annotations s&#233;mantiques
contradictoires en nous appuyant sur la notion de coh&#233;rence des logiques de description. Nous
rappelons qu&#8217;une ontologie O est incoh&#233;rente (ou insatisfiable) si elle ne poss&#232;de pas de mod&#232;le
(Baader et al., 2003). Un exemple tr&#232;s simple d&#8217;ontologie incoh&#233;rente est O = {A(a),&#172;A(a)}
qui repr&#233;sente deux faits inconciliables qui sont qu&#8217;une instance a d&#8217;un conceptA est &#233;galement
une instance de sa n&#233;gation.
</p>
<p>Definition 2 (Annotations et R&#232;gles incoh&#233;rentes) Soit ANNT un ensemble d&#8217;annotations s&#233;-
mantiques d&#8217;un corpus T selon une ontologie &#233;tendue O. Si p1(ANNT) &#8746; O est incoh&#233;rent,
nous dirons que l&#8217;ensemble d&#8217;annotations ANNT est incoh&#233;rent et que l&#8217;ensemble de r&#232;gles
p2(ANNT) est incoh&#233;rent au regard du corpus T . Dans le cas contraire, ANNT est dit coh&#233;rent
et p2(ANNT) est dit coh&#233;rent au regard du corpus T .
</p>
<p>IJUPE = ([texte=&quot;une jupe&quot;], JUPE),
CHOMME = ([terme=&quot;homme&quot;], HOMME),
IHOMME = ({X | X est un homme}, HOMME),
CFEMME = ([terme=&quot;femme&quot;], FEMME),
IFEMME = ({X | X . . .porte une jupe}, FEMME)
</p>
<p>Remarque : Ces r&#232;gles sont &#233;crites dans un pseudo langage
tr&#232;s simplifi&#233; et informel pour en faciliter la compr&#233;hension.
</p>
<p>FIG. 2 &#8211; Exemple d&#8217;annotations s&#233;mantiques incoh&#233;rentes.
</p>
<p>La figure 2 illustre un exemple d&#8217;annotations s&#233;mantiques incoh&#233;rentes. Dans cet exemple,
ANNT = { (JUPE(t1), IJUPE), (HOMME(t2), IHOMME), (FEMME(t2), IFEMME), (t3 &#8801;
HOMME,CHOMME)} o&#249; t1, t2, t3 correspondent respectivement aux segments de texte &quot;une
jupe&quot;, &quot;Bob&quot; et &quot;homme&quot;. L&#8217;assertion que HOMME et FEMME sont des concepts dis-
joints dans l&#8217;ontologie O rend p1(ANNT)&#8746;O incoh&#233;rent. Donc l&#8217;ensemble d&#8217;annotations ANNT
est incoh&#233;rent et l&#8217;ensemble de r&#232;gles p2(ANNT)={IJUPE , IHOMME , IFEMME , CHOMME} est
incoh&#233;rent au regard de la phrase.
</p>
<p>4 D&#233;tection des contradictions et des r&#232;gles fautives
</p>
<p>Par d&#233;finition, un ensemble d&#8217;annotations ANNT est incoh&#233;rent si et seulement si p1(ANNT)&#8746;O
est incoh&#233;rent. V&#233;rifier la coh&#233;rence de p1(ANNT) &#8746; O est une t&#226;che classique &#224; la port&#233;e des
raisonneurs propos&#233;s par la plupart des outils de manipulation d&#8217;ontologies1.
</p>
<p>Nous introduisons la mesure draconienne de coh&#233;rence d&#8217;un ensemble de r&#232;gles p2(ANNT) au
regard d&#8217;un corpus annot&#233; s&#233;mantiquement (ANNT) de la mani&#232;re suivante :
</p>
<p>I(p2(ANNT)) =
{
</p>
<p>0 si p2(ANNT) est coh&#233;rent au regard du corpus annot&#233; s&#233;mantiquement,
1 si p2(ANNT) est incoh&#233;rent au regard du corpus annot&#233; s&#233;mantiquement.
</p>
<p>1 http://www.cs.man.ac.uk/~sattler/reasoners.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y. MA, L. Audibert
</p>
<p>Nous aimerions maintenant identifier quelles sont les r&#232;gles responsables de l&#8217;incoh&#233;rence avec,
si possible, une mesure de la responsabilit&#233; de chacune. Pour cela, nous allons utiliser la mesure
de Shapley (Shapley, 1953; Hunter &amp; Konieczny, 2006) emprunt&#233;e &#224; la th&#233;orie des jeux.
</p>
<p>Definition 3 (Mesure de coh&#233;rence de Shapley d&#8217;une r&#232;gle) Pour chaque r&#232;gle r d&#8217;un ensemble
de r&#232;gles p2(ANNT) issu d&#8217;un ensemble d&#8217;annotations ANNT, nous d&#233;finissons la mesure de co-
h&#233;rence de Shapley, not&#233;e SI(r), comme suit :
</p>
<p>SI(r) =
&#8721;
</p>
<p>R&#8838;p2(ANNT)
</p>
<p>(card(R)&#8722; 1)!(card(p2(ANNT))&#8722; card(R))!
card(p2(ANNT))!
</p>
<p>(I(R)&#8722; I(R \ r)). (1)
</p>
<p>Ainsi, au plus la mesure de coh&#233;rence de Shapley d&#8217;une r&#232;gle est &#233;lev&#233;e, au plus l&#8217;implication
de la r&#232;gle dans les incoh&#233;rences g&#233;n&#233;r&#233;es est importante. Il faut donc revoir en premier lieu les
r&#232;gles qui poss&#232;dent une mesure de coh&#233;rence de Shapley &#233;lev&#233;e.
</p>
<p>En appliquant cette mesure sur l&#8217;exemple de la figure 2, nous obtenons :
</p>
<p>SI(IJUPE) = 0, SI(CHOMME) = 0, SI(IHOMME) =
1
</p>
<p>2
, SI(IFEMME) =
</p>
<p>1
</p>
<p>2
.
</p>
<p>Nous pouvons en conclure que les r&#232;gles IJUPE et CHOMME ne posent pas de probl&#232;me tan-
dis que les r&#232;gles IHOMME et IFEMME sont toutes deux impliqu&#233;es de mani&#232;re &#233;gale dans le
probl&#232;me d&#8217;incoh&#233;rence. C&#8217;est donc du c&#244;t&#233; de ces deux r&#232;gles qu&#8217;il faut chercher la source du
probl&#232;me.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Dans un pr&#233;c&#233;dent article, nous avons propos&#233; d&#8217;&#233;tendre les ontologies par des r&#232;gles d&#8217;anno-
tation s&#233;mantique. Dans cet article, en nous appuyant sur la th&#233;orie de la valeur de Shapley,
nous proposons un moyen de quantifier l&#8217;implication respectives des r&#232;gles dans la produc-
tion d&#8217;annotations s&#233;mantiques incoh&#233;rentes. L&#8217;avantage de cette mesure est d&#8217;&#234;tre enti&#232;rement
automatis&#233;e et de permettre d&#8217;assister le processus de r&#233;vision des r&#232;gles, dans la perspective
d&#8217;am&#233;liorer la coh&#233;rence des annotations, en mettant en avant les r&#232;gles &#224; modifier en priorit&#233;.
Cette approche doit maintenant &#234;tre test&#233;e et &#233;valu&#233;e. Nous projetons de le faire dans la plate-
forme d&#8217;annotation s&#233;mantique qui doit &#234;tre d&#233;velopp&#233;e dans le cadre du programme Quaero.
</p>
<p>R&#233;f&#233;rences
</p>
<p>F. BAADER, D. CALVANESE, D. L. MCGUINNESS, D. NARDI &amp; P. F. PATEL-SCHNEIDER,
Eds. (2003). The Description Logic Handbook : Theory, Implementation, and Applications.
Cambridge University Press.
HUNTER A. &amp; KONIECZNY S. (2006). Shapley inconsistency values. In P. DOHERTY, J.
MYLOPOULOS &amp; C. A. WELTY, Eds., KR, p. 249&#8211;259 : AAAI Press.
MA Y., AUDIBERT L. &amp; NAZARENKO A. (2009). Ontologies &#233;tendues pour l&#8217;annotation
s&#233;mantique. 20&#232;mes Journ&#233;es Francophones d&#8217;Ing&#233;nierie des Connaissances.
SHAPLEY L. S. (1953). A value for n-person games. In H. KUHN &amp; A. TUCKER, Eds.,
In Contributions to the Theory of Games (Annals of Mathematical Studies 28), p. 307&#8211;317 :
Princeton University Press.</p>

</div></div>
</body></html>