<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>ACOLAD un environnement pour l&#8217;&#233;dition de corpus de d&#233;pendances</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>ACOLAD  
un environnement pour l&#8217;&#233;dition de corpus de d&#233;pendances 
</p>
<p>Francis Brunet-Manquat, J&#233;r&#244;me Goulian 
</p>
<p>LIG-GETALP 
BP 53 
</p>
<p>38041 Grenoble cedex 9, FRANCE 
{Francis.Brunet-Manquat, Jerome.Goulian}@imag.fr 
</p>
<p>R&#233;sum&#233; 
Dans cette d&#233;monstration, nous pr&#233;sentons le prototype d&#8217;un environnement open-source 
pour l&#8217;&#233;dition de corpus de d&#233;pendances. Cet environnement, nomm&#233; ACOLAD (Annotation 
de COrpus Linguistique pour l&#8217;Analyse de d&#233;pendances), propose des services manuels de 
segmentation et d&#8217;annotation multi-niveaux (segmentation en mots et en syntagmes minimaux 
(chunks), annotation morphosyntaxique des mots, annotation syntaxique des chunks et 
annotation syntaxique des d&#233;pendances entre mots ou entre chunks).  
</p>
<p>Mots-cl&#233;s : d&#233;pendances, chunk, &#233;dition 
</p>
<p>Int&#233;r&#234;ts 
L&#8217;id&#233;e est de proposer dans un m&#234;me environnement une palette de services permettant la 
cr&#233;ation de corpus annot&#233;s pour les besoins classiques de d&#233;veloppement d&#8217;outils 
linguistiques. Les int&#233;r&#234;ts de notre environnement sont les suivants : 
</p>
<p>&#8226; visualisation et &#233;dition graphique simple des annotations ; 
&#8226; &#233;dition manuelle configurable : 
</p>
<p>&#8226; choix entre diff&#233;rentes granularit&#233;s d&#8217;unit&#233;s d&#8217;annotations (d&#233;pendances entre mots 
et/ou entre chunks) ; 
</p>
<p>&#8226; possibilit&#233; d&#8217;utiliser diff&#233;rents jeux d&#8217;&#233;tiquettes (grammaticales, syntaxiques au niveau 
des chunks et des d&#233;pendances) pour tenir compte des sp&#233;cificit&#233;s de chaque corpus 
(&#233;crit, oral transcrit ou oral issu de la reconnaissance de parole par exemple) et des 
besoins en terme d&#8217;exploitation future du corpus [Valli et V&#233;ronis, 1999] ; 
</p>
<p>&#8226; choix des contraintes structurelles de d&#233;pendances &#224; associer &#224; l&#8217;&#233;dition en cours 
(projectivit&#233; ou non projectivit&#233;, analyse totale ou partielle) ; 
</p>
<p>&#8226; possibilit&#233; d&#8217;&#233;diter simultan&#233;ment les ambigu&#239;t&#233;s d&#8217;analyse tant au niveau mots, chunks, 
qu&#8217;au niveau des d&#233;pendances syntaxiques. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Francis Brunet-Manquat, J&#233;r&#244;me Goulian  
</p>
<p>Aper&#231;u de la d&#233;monstration 
La d&#233;monstration vise &#224; pr&#233;senter les diff&#233;rentes &#233;tapes permettant la cr&#233;ation d&#8217;analyses de 
d&#233;pendances : de la segmentation d&#8217;une phrase en mots (voir figure 1) &#224; la cr&#233;ation d&#8217;une ou 
plusieurs analyses de d&#233;pendances pour cette phrase (voir figure 2). 
</p>
<p> 
Figure 1 : segmentation d&#8217;une phrase en mots 
</p>
<p> 
Figure 2 : cr&#233;ation d&#8217;une analyse de d&#233;pendances 
</p>
<p>Nous pr&#233;senterons &#233;galement les services permettant d&#8217;importer des segmentations et/ou des 
annotations pr&#233;existantes et la possibilit&#233; d&#8217;exporter nos r&#233;sultats sous forme XML. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>&#201;quipement 
La d&#233;monstration ne demandera pas d&#8217;&#233;quipement particulier. Les participants auront le 
mat&#233;riel n&#233;cessaire et les logiciels install&#233;s pour pr&#233;senter l&#8217;environnement d&#8217;&#233;dition de 
corpus de d&#233;pendances ACOLAD. 
</p>
<p>Disponibilit&#233; 
Notre environnement est propos&#233; &#224; la communaut&#233; sous licence publique g&#233;n&#233;rale limit&#233;e 
GNU (GNU Lesser General Public License). 
</p>
<p>Perspectives 
ACOLAD propose de nombreux services manuels permettant de segmenter une phrase ou de 
produire des analyses de d&#233;pendances. Cet environnement est actuellement utilis&#233; pour 
produire des analyses de d&#233;pendances pour le fran&#231;ais. Mais cet outil, par son formalisme de 
d&#233;pendances et son aspect configurable (choix des jeux d'&#233;tiquettes, choix des contraintes 
structurelles de d&#233;pendances -- en particulier pour tenir compte de la variabilit&#233; faible ou forte 
de l'ordre des mots selon la langue [Holan, 2000]), a un potentiel multilingue.  
</p>
<p>Des exp&#233;rimentations sont actuellement men&#233;es pour int&#233;grer les premiers r&#233;sultats 
d&#8217;ACOLAD dans nos travaux sur l&#8217;analyse syntaxique automatique et la production de 
documents auto-explicatifs [Blanchon et al., 2006]. 
</p>
<p>Les services propos&#233;s par ACOLAD pourront &#233;galement &#234;tre int&#233;gr&#233;s &#224; des environnements 
tel que Sectra_w, un syst&#232;me collaboratif permettant d&#8217;&#233;valuer, de pr&#233;senter, d&#8217;exploiter et de 
r&#233;viser des corpus de traduction automatique [Huynh et al., 2008], par exemple pour proposer 
l&#8217;ajout de d&#233;pendances syntaxiques. 
</p>
<p>Enfin, ACOLAD pourra &#234;tre propos&#233; dans le cadre de campagne d&#8217;&#233;valuation d&#8217;analyseurs 
syntaxiques de d&#233;pendances pour aider &#224; fabriquer les analyses r&#233;f&#233;rences. 
</p>
<p>R&#233;f&#233;rences 
BLANCHON, H., BOITET, C. AND CHOUMANE, A. (2006). Traduction automatis&#233;e fond&#233;e sur le 
dialogue et documents auto-explicatifs: bilan du projet LIDIA. in TAL. vol. 47(3): 30 p.  
</p>
<p>HOLAN T., KUBON, OLIVA K., PLATEK M. (2000). On complexity of word order, in TAL., 
41(1), pp. 273-300, Herm&#232;s, Paris, France.  
</p>
<p>HUYNH C.-P., BOITET C. &amp; BLANCHON H. (2008). SECTra_w : an Online Collaborative 
System for Evaluating, Post-editing and Presenting MT Translation Corpora. Proc. LREC-08, 
Marrakech, 27-31/5/08, ELRA/ELDA, ed., 8 p.  
</p>
<p>VALLI, A. ET VERONIS, J. (1999). Etiquetage grammatical des corpus de parole : probl&#232;mes et 
perspectives. Revue Fran&#231;aise de Linguistique Appliqu&#233;e, IV(2), 113-133. (dossier : l'oral 
spontan&#233;) </p>

</div></div>
</body></html>