<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Gestion de dialogue oral Homme-machine en arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009 
</p>
<p>Gestion de dialogue oral Homme-machine en arabe 
</p>
<p>Youn&#232;s Bahou (1), Amine Bayoudhi (2), Lamia Hadrich Belguith (3) 
(1) bahou_younes@yahoo.fr, (2) bayoudhi.amine@gmail.com, 
</p>
<p>(3) l.belguith@fsegs.rnu.tn 
Laboratoire LARIS-MIRACL, FSEGS &#8211; Universit&#233; de Sfax, Tunisie. 
</p>
<p>R&#233;sum&#233;. Dans le pr&#233;sent papier, nous pr&#233;sentons nos travaux sur la gestion du dialogue 
oral arabe Homme-machine. Ces travaux entrent dans le cadre de la r&#233;alisation du serveur 
vocal interactif SARF (Bahou et al., 2008) offrant des renseignements sur le transport 
ferroviaire tunisien en langue arabe standard moderne. Le gestionnaire de dialogue que nous 
proposons est bas&#233; sur une approche structurelle et est compos&#233; de deux mod&#232;les &#224; savoir, le 
mod&#232;le de t&#226;che et le mod&#232;le de dialogue. Le premier mod&#232;le permet de i) compl&#233;ter et 
v&#233;rifier l&#8217;incoh&#233;rence des structures s&#233;mantiques repr&#233;sentant les sens utiles des &#233;nonc&#233;s,  
ii) g&#233;n&#233;rer une requ&#234;te vers l&#8217;application et iii) r&#233;cup&#233;rer le r&#233;sultat et de formuler une r&#233;ponse 
&#224; l&#8217;utilisateur en langage naturel. Quant au mod&#232;le de dialogue, il assure l&#8217;avancement du 
dialogue avec l&#8217;utilisateur et l&#8217;identification de ses intentions. L&#8217;interaction entre ces deux 
mod&#232;les est assur&#233;e gr&#226;ce &#224; un contexte du dialogue permettant le suivi et la mise &#224; jour de 
l&#8217;historique du dialogue. 
</p>
<p>Abstract. In this paper, we present our research work on Human-machine Arabic oral 
dialogue management. This work enters in the context of SARF system (Bahou et al., 2008) 
an interactive vocal server that provides information on Tunisian railway using modern 
standard Arabic. The dialogue manager that we propose is based on a structural approach and 
consists of two models namely, the task model and the dialogue model. The first model is 
used to i) complete and verify the incoherence of semantic structures representing the useful 
meaning of utterances, ii) generate a query to the application and iii) get back the results and 
formulate an answer to the user in natural language. As for the dialogue model, it assures the 
dialogue progress with the user and the identification of her or his intentions. The interaction 
between these two models is assured by a dialogue context that allows monitoring and 
updating the dialogue history. 
</p>
<p>Mots-cl&#233;s: gestion du dialogue Homme-machine, dialogue oral arabe, mod&#232;le de t&#226;che, 
mod&#232;le de dialogue. 
</p>
<p>Keywords: Human-machine dialogue management, Arabic oral dialogue, task model, 
dialogue model. 
</p>
<p>1 Introduction 
L&#8217;objectif des Syst&#232;mes de Dialogue Oral Homme-Machine (SDOHM) est de rendre la 
machine capable de dialoguer d&#8217;une mani&#232;re naturelle avec l&#8217;Homme. Pour ce faire, ces 
syst&#232;mes doivent &#234;tre dot&#233;s d&#8217;un gestionnaire de dialogue qui occupe une place tr&#232;s 
importante dans ce type de syst&#232;mes. Le domaine de la gestion de dialogue oral en langues 
Latines a b&#233;n&#233;fici&#233; de plusieurs travaux de recherche permettant le d&#233;veloppement et 
l&#8217;&#233;volution de ce domaine. Cependant, la gestion de dialogue en langue arabe n&#8217;a pas eu le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Amine Bayoudhi, Lamia Hadrich Belguith 
</p>
<p>m&#234;me sort. Ce retard est expliqu&#233; d&#8217;un c&#244;t&#233; par la complexit&#233; et la diversit&#233; dialectale de la 
langue arabe et d&#8217;un autre c&#244;t&#233; par la manque d&#8217;outils aidant &#224; la r&#233;alisation de ces syst&#232;mes 
(i.e., corpus, syst&#232;me de reconnaissance vocale, etc.) 
</p>
<p>Pour cela, nous avons fix&#233; comme objectif la conception et la r&#233;alisation d&#8217;un gestionnaire de 
dialogue en langue arabe. Nous projetons de mettre notre syst&#232;me &#224; la disposition des 
chercheurs afin d&#8217;encourager les travaux sur ce domaine et d&#8217;aboutir au d&#233;veloppement des 
SDOHM destin&#233;s &#224; la communaut&#233; arabe. Nous avons choisi la langue Arabe standard 
moderne afin de viser toute la communaut&#233; arabe vu qu&#8217;elle peut &#234;tre parl&#233;e par tous les 
arabes. Cependant, les dialectes arabes sont tr&#232;s vari&#233;s et diff&#232;res d&#8217;un pays &#224; un autre, voire 
m&#234;me d&#8217;une r&#233;gion &#224; une autre au sein du m&#234;me pays. 
</p>
<p>Ce travail entre dans le cadre de la r&#233;alisation du serveur vocal interactif SARF  
(Bahou et al., 2008) offrant des renseignements sur le transport ferroviaire tunisien en langue 
arabe standard moderne. Nous visons, &#224; travers le pr&#233;sent travail, &#224; appliquer et &#224; tester 
l&#8217;approche structurelle dans notre m&#233;thode de gestion de dialogue en arabe. 
</p>
<p> Cet article s&#8217;articule autour de deux parties principales. La section 2 pr&#233;sente un bref aper&#231;u 
des approches de gestion de dialogue. La section 3 d&#233;taille la m&#233;thode que nous proposons 
pour la gestion de dialogue en arabe. 
</p>
<p>2 Principales approches de gestion de dialogue 
La gestion de dialogue cherche &#224; assurer une communication fiable et efficace avec 
l&#8217;utilisateur. Cette communication, pour atteindre ces qualit&#233;s, doit &#234;tre bien entretenue et bien 
mod&#233;lis&#233;e, probl&#232;me majeur dans la gestion du dialogue. Dans cette section, nous pr&#233;sentons 
les solutions propos&#233;es pour r&#233;soudre ce probl&#232;me &#224; travers l&#8217;illustration des principales 
approches de gestion de dialogue. 
</p>
<p>Notons que plusieurs m&#233;thodes et de nombreuses classifications de ces derni&#232;res ont &#233;t&#233; cit&#233;es 
dans la litt&#233;rature. Nous proposons de classifier les diff&#233;rentes m&#233;thodes en quatre approches : 
l&#8217;approche structurelle, l&#8217;approche intentionnelle, l&#8217;approche orient&#233;e plan et l&#8217;approche 
conventionnelle. 
</p>
<p>2.1 Approche structurelle 
</p>
<p>Cette approche prend son origine du mod&#232;le genevois (Roulet et al., 1991) &#224; partir duquel 
plusieurs travaux ont &#233;t&#233; inspir&#233;s et ont apport&#233; en contrepartie des am&#233;liorations 
remarquables en offrant &#224; ce mod&#232;le la dynamique qui lui manque. Parmi ces travaux, nous 
citons ceux de Luzzati (Luzzati, 1989), de Rosset et Lamel (Rosset, Lamel, 2001) et de 
Minker et Bennacef (Minker, Bennacef, 2004). 
</p>
<p>L&#8217;id&#233;e fondamentale sur laquelle se base l&#8217;approche structurelle est l&#8217;existence d&#8217;une structure 
&#224; l&#8217;int&#233;rieur de laquelle le dialogue peut se tisser (Caelen, Xuereb, 2007). Cette structure 
d&#233;crit autour d&#8217;elle des unit&#233;s hi&#233;rarchiques plus complexes entretenant des relations 
fonctionnelles. La d&#233;finition de ces deux niveaux d&#8217;analyse hi&#233;rarchique et fonctionnelle 
donne naissance &#224; une grammaire hors-contexte d&#233;crivant les r&#233;gularit&#233;s des &#233;changes dans le 
dialogue. 
</p>
<p>Un des mod&#232;les les plus importants dans l&#8217;approche structurelle, est celui propos&#233; par Luzzati 
(Luzzati, 1989). Ce mod&#232;le constitue une extension tr&#232;s int&#233;ressante du mod&#232;le genevois dans 
le sens o&#249; il a introduit l&#8217;aspect dynamique avec l&#8217;utilisation de deux axes d&#8217;analyse. Le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gestion de dialogue oral Homme-machine en arabe&#160;
</p>
<p>premier est un axe r&#233;gissant qui permet de faire progresser la t&#226;che quand cela est possible et 
le deuxi&#232;me est un axe incident qui permet de traiter les incidences telles que les demandes de 
pr&#233;cision, d&#8217;explication, de confirmation ou de reformulation. 
</p>
<p>Les mod&#232;les de l&#8217;approche structurelle se basent sur l&#8217;id&#233;e de l&#8217;existence d&#8217;une grammaire 
g&#233;n&#233;rative capable de d&#233;crire le dialogue &#224; partir des marqueurs linguistiques et des indices 
pragmatiques. Ainsi, n&#8217;importe quel dialogue peut &#234;tre soumis aux r&#232;gles impos&#233;es par cette 
structure descriptive. Or, on est sens&#233; mod&#233;liser un dialogue faisant intervenir deux 
interlocuteurs, donc il n&#8217;y a pas de raison pour percevoir leurs interventions d&#8217;une mani&#232;re 
identique et objective, surtout que l&#8217;un des deux interlocuteurs est une machine. D&#8217;autre part, 
l&#8217;objectif de la mod&#233;lisation du dialogue est de d&#233;crire et &#233;tudier le fonctionnement des 
conversations, non de doter les syst&#232;mes informatiques d&#8217;une comp&#233;tence conversationnelle. 
</p>
<p>2.2 Approche orient&#233;e plan 
</p>
<p>Contrairement &#224; l&#8217;approche structurelle, l&#8217;approche fond&#233;e sur la planification ne s&#8217;est 
int&#233;ress&#233;e ni au dialogue lui-m&#234;me ni &#224; sa structure, mais elle s&#8217;est int&#233;ress&#233;e aux 
interlocuteurs produisant ce dialogue. En effet, les mod&#232;les de l&#8217;approche orient&#233;e plan 
consid&#232;rent que chaque interlocuteur s&#8217;engageant dans la conversation a un comportement 
rationnel qui l&#8217;am&#232;ne &#224; &#233;tablir des plans lui permettant d&#8217;atteindre ses buts. Ces plans sont 
d&#233;finis comme &#233;tant un ensemble d&#8217;actions ordonn&#233;es amenant &#224; r&#233;aliser un but donn&#233;. L&#8217;id&#233;e 
centrale de l&#8217;approche orient&#233;e plan consiste donc &#224; pr&#233;&#233;tablir l&#8217;ensemble des plans possibles 
de la t&#226;che puis &#224; reconna&#238;tre le plan de l&#8217;interlocuteur parmi ces plans. 
</p>
<p>Les travaux effectu&#233;s autour de cette approche sont inspir&#233;s de la th&#233;orie de planification 
(Nilson, 1980) et nous pouvons citer &#224; titre d&#8217;exemple les travaux de Rickel et al. sur le 
remplissage des pages Web multimodales (Rickel et al., 2001) et de Sidner et al. sur la 
r&#233;alisation d&#8217;un robot &#224; guide (Sidner et al., 2003). 
</p>
<p>Mais bien que la planification soit une approche efficace pour guider l&#8217;utilisateur &#224; franchir 
les obstacles qui l&#8217;emp&#234;chent de r&#233;aliser ses buts, elle reste une approche incapable d&#8217;aborder 
les probl&#232;mes rencontr&#233;s dans les syst&#232;mes de dialogue surtout au niveau de la mod&#233;lisation 
des r&#232;gles conversationnelles et surtout qu&#8217;il n&#8217;y a aucune distinction entre les actions li&#233;es &#224; 
la t&#226;che et celles &#224; la communication. En plus, cette efficacit&#233; peut co&#251;ter tr&#232;s cher puisque les 
syst&#232;mes deviennent tr&#232;s rigides (i.e., on ne peut traiter que des dialogues qui sont dirig&#233;s par 
la t&#226;che et dont le but est connu).  Aussi, les incidences hors t&#226;che du dialogue sont quasiment 
impossibles &#224; traiter (Caelen, Xuereb, 2007). De m&#234;me, l&#8217;hypoth&#232;se sur laquelle se base cette 
approche admet un nombre limit&#233; de plans pr&#233;d&#233;finis &#224; l&#8217;avance, ce qui n&#8217;est pas le cas 
r&#233;ellement. Et m&#234;me si c&#8217;est le cas, le nombre d&#8217;inf&#233;rences utilis&#233;es dans le processus de 
reconnaissance des plans est &#233;lev&#233;, ce qui peut ralentir les syst&#232;mes surtout avec la complexit&#233; 
des m&#233;thodes heuristiques. 
</p>
<p>2.3 Approche intentionnelle 
</p>
<p>L&#8217;approche intentionnelle est en r&#233;alit&#233; une extension de l&#8217;approche orient&#233;e plan. Seulement, 
elle a la faveur d&#8217;ajouter un niveau cognitif &#224; la mod&#233;lisation du dialogue car il ne suffit pas 
de viser l&#8217;organisation de la t&#226;che et du discours pour bien adapter la r&#233;ponse, mais il faut 
prendre en consid&#233;ration les intentions de l&#8217;interlocuteur. Ainsi, cette approche se d&#233;veloppe 
autour de la logique intentionnelle &#233;volu&#233;e avec l&#8217;apparition des mod&#232;les BDI (Belief, Desire, 
Intention) en intelligence artificielle. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Amine Bayoudhi, Lamia Hadrich Belguith 
</p>
<p>Les premiers travaux dans ce courant sont ceux de Cohen, Perrault et Allen  
(Cohen, Perrault, 1979) (Allen, Perrault, 1980) qui sont ensuite repris et raffin&#233;s par Sadek 
dans le d&#233;veloppement du syst&#232;me ARTIMIS/AGS pour la consultation de l&#8217;annuaire des 
services audiotel (emploi et m&#233;t&#233;o) par t&#233;l&#233;phone (Sadek, 1996). 
</p>
<p>Les mod&#232;les de l&#8217;approche intentionnels ont bien pouss&#233; les r&#233;sultats dans le domaine du 
dialogue Homme-machine puisqu&#8217;ils sont caract&#233;ris&#233;s par une mod&#233;lisation assez compl&#232;te. 
Le probl&#232;me reste dans l&#8217;hypoth&#232;se de rationalit&#233; et dans la pertinence de la logique des 
mod&#232;les BDI vis-&#224;-vis le comportement instable humain. Ce qui rend cette approche plus 
efficace et plus convenable pour les syst&#232;mes multi-agents que pour les humains. Une autre 
limite est au niveau de la mise en &#339;uvre de la reconnaissance des intentions des interlocuteurs 
qui semble &#234;tre tr&#232;s difficile et complexe. 
</p>
<p>2.4 Approche conventionnelle 
</p>
<p>L&#8217;approche conventionnelle est bas&#233;e sur la th&#233;orie des jeux de dialogues conventionnels 
(Husltin, 2000). Cette th&#233;orie suppose que chacun des interlocuteurs est engag&#233; dans un jeu 
social dont les tours de parole repr&#233;sentent les coups. L&#8217;enjeu se manifeste dans la pertinence 
de ces coups, c'est-&#224;-dire, chacun va tenter essentiellement de maximiser ses gains et r&#233;duire 
ses pertes en suivant les r&#232;gles du jeu. Le probl&#232;me peut se ramener ainsi &#224; la gestion des buts 
qui sont trait&#233;s selon des strat&#233;gies prenant en consid&#233;ration l&#8217;&#233;tat des interlocuteurs et l&#8217;&#233;tat 
du dialogue. 
</p>
<p>Parmi les travaux les plus persistants dans cette approche, nous citons ceux de Rouillard pour 
le syst&#232;me HALPIN d&#233;di&#233; &#224; la recherche d'information en utilisant l'hyper-dialogue en 
Fran&#231;ais (Rouillard, 2000) et les travaux de Nguyen pour le syst&#232;me MELINA pour 
l&#8217;organisation des r&#233;unions (Nguyen, 2005). 
</p>
<p>L&#8217;approche conventionnelle a connu aussi d&#8217;autres travaux qui ont &#233;t&#233; class&#233;s comme &#233;tant 
soit des mod&#232;les argumentatifs (Baker, 1994) ou soit orient&#233;s interaction (Dessales, 1993). 
Mais ces mod&#232;les ont &#233;t&#233; consid&#233;r&#233;s explicatifs de l&#8217;interaction humaine et n&#8217;ont pas &#233;t&#233; 
adapt&#233; dans le dialogue Homme-machine. 
</p>
<p>Les points forts de cette approche se situent surtout dans le calcul de pertinence qui permet 
d&#8217;&#233;valuer l&#8217;ad&#233;quation d&#8217;un acte de dialogue par rapport au but du locuteur. Cependant, la 
d&#233;finition des r&#232;gles sociales reste un probl&#232;me dans ces mod&#232;les car le comportement 
humain face &#224; la machine n&#8217;ob&#233;it pas en g&#233;n&#233;ral &#224; ces r&#232;gles (Caelen, Xuereb, 2007). 
</p>
<p>3 M&#233;thode propos&#233;e pour la gestion de dialogue 
Dans cette section nous proposons une m&#233;thode pour la gestion de dialogue oral Homme-
machine utilisant la langue arabe standard moderne. Ainsi, la m&#233;thode propos&#233;e est inspir&#233;e 
des premiers travaux de Roulet (Roulet et al., 1991) qui ont fondu les principes des analyses 
hi&#233;rarchiques et fonctionnelles pour rendre compte des r&#233;gularit&#233;s  des &#233;changes dans les 
dialogues. Cette m&#233;thode se base sur l&#8217;approche structurelle et permet de g&#233;rer l&#8217;interaction 
avec les utilisateurs et de r&#233;pondre &#224; leurs demandes d&#8217;informations. 
</p>
<p>Avant d&#8217;exposer les &#233;tapes de notre m&#233;thode, nous tenons &#224; signaler que nous avons utilis&#233;  
notre propre corpus d&#8217;&#233;tude construit selon la technique du Magicien d&#8217;Oz. Ce corpus nous a 
permis le recensement des actes de dialogues, des marqueurs linguistiques et l&#8217;ensemble des 
r&#232;gles de r&#233;&#233;criture du dialogue composant notre grammaire formelle. Le tableau suivant 
r&#233;sume quelques informations sur le corpus d&#8217;&#233;tude que nous avons utilis&#233;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gestion de dialogue oral Homme-machine en arabe&#160;
</p>
<p>Nombre de 
locuteurs 
</p>
<p>Nombre de 
dialogues Taille en heures Nombre de mots 
</p>
<p>Nombre 
d&#8217;&#233;nonc&#233;s 
</p>
<p>50 300 11 92598 7590 
</p>
<p>Tableau 1 : Caract&#233;ristiques du corpus d&#8217;&#233;tude utilis&#233; 
La m&#233;thode propos&#233;e est constitu&#233;e principalement par deux mod&#232;les : mod&#232;le de t&#226;che et 
mod&#232;le de dialogue (voir figure 1). Le premier mod&#232;le s&#8217;occupe d&#8217;ex&#233;cuter les t&#226;ches 
convi&#233;es &#224; la machine &#224; savoir interpr&#233;ter et compl&#233;ter les demandes des utilisateurs, formuler 
les requ&#234;tes &#224; communiquer &#224; la base de donn&#233;es de l&#8217;application et g&#233;n&#233;rer les r&#233;ponses &#224; 
l&#8217;utilisateur. Tandis que le deuxi&#232;me prend en charge toutes les interactions avec les 
utilisateurs en identifiant leurs actes de dialogue, en d&#233;cidant la nature de l&#8217;intervention 
machine ad&#233;quate et en assurant le suivi et l&#8217;avancement du dialogue en cas d&#8217;incidence ou de 
rupture. L&#8217;interaction entre ces deux mod&#232;les est assur&#233;e gr&#226;ce &#224; un contexte du dialogue 
permettant le suivi du dialogue et la mise &#224; jour de l&#8217;historique. 
</p>
<p> 
</p>
<p>Figure 1 : Les &#233;tapes de la m&#233;thode propos&#233;e pour la gestion de dialogue 
</p>
<p>Nous pr&#233;sentons dans ce qui suit le fonctionnement de chacun de ces deux mod&#232;les ainsi que 
les ressources requises dans chaque &#233;tape de la m&#233;thode propos&#233;e. 
</p>
<p>3.1 Le mod&#232;le de t&#226;che 
</p>
<p>Le r&#244;le principal du mod&#232;le de t&#226;che est de compl&#233;ter la structure s&#233;mantique (un sch&#233;ma 
dans notre cas) g&#233;n&#233;r&#233;e par le syst&#232;me de compr&#233;hension et de v&#233;rifier sa coh&#233;rence afin d&#8217;en 
extraire les informations n&#233;cessaires &#224; la g&#233;n&#233;ration des requ&#234;tes vers l&#8217;application. Ensuite, il 
exploite les informations retourn&#233;es par l&#8217;application pour formuler des r&#233;ponses vers 
l&#8217;utilisateur. N&#233;anmoins, la validation du sch&#233;ma s&#233;mantique reste la t&#226;che la plus d&#233;licate du 
mod&#232;le de t&#226;che. En effet, un sch&#233;ma doit passer par cinq &#233;tapes de validation avant d&#8217;&#234;tre 
jug&#233; comme un sch&#233;ma complet et valide. Ces &#233;tapes sont (voir figure 2) : l&#8217;interpr&#233;tation, 
l&#8217;instanciation des attributs &#224; partir de l&#8217;historique, l&#8217;instanciation des attributs par des valeurs 
par d&#233;faut, la v&#233;rification de la coh&#233;rence et la v&#233;rification de la compl&#233;tude. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Amine Bayoudhi, Lamia Hadrich Belguith 
</p>
<p>&#160;
</p>
<p>Figure 2 : Repr&#233;sentation d&#233;taill&#233;e du mod&#232;le de t&#226;che 
</p>
<p>Dans ces &#233;tapes, le mod&#232;le de t&#226;che utilise deux principales ressources &#224; savoir, les structures 
t&#226;ches et les structures plans (Minker, Bennacef, 2004). Les structures t&#226;ches (voir figure 3.a) 
contiennent les r&#232;gles relatives &#224; l&#8217;interpr&#233;tation, la formulation des commandes et la 
g&#233;n&#233;ration de r&#233;ponses. Quant aux structures plans (voir figure 3.b), elles regroupent les 
r&#232;gles de coh&#233;rence et les r&#232;gles de compl&#233;tude des sch&#233;mas. 
</p>
<p>T&#226;che horaire  Plan horaire 
INTERPRETATIONS 
if(ville_arrivee= &quot;&#1605;&#1589;&#1575;&#1593;&#1577;&quot;  [EASmp] (capitale) ) 
        Then(ville_arrivee= &quot;&#1587;&#1606;&#1608;&#1578;&quot;  [twns] (Tunis) )  
</p>
<p>COMMANDES 
</p>
<p>SELECT heure_depart, heure_arrivee 
FROM voyage 
WHERE ville_depart=@ville_depart 
AND ville_arrivee=@ville_arrivee AND &#8230; 
</p>
<p>REPONSES 
</p>
<p>if (resultat) Then 
</p>
<p>( &#1607; &#1585;&#1575;&#1591;&#1602;&#1604;&#1575; &#1602;&#1604;&#1575;&#1591;&#1606;&#1575; &#1583;&#1610;&#1593;&#1575;&#1608;&#1605;&#1610;&#1578;&#1604;&#1570;&#1575;&#1570; &#1610; ... : ) 
                     [mwAEyd AnTlAq AlqTAr hy kAl|ty: ...] 
</p>
<p>(Les horaires de d&#233;part du train sont comme suit:&#8230;) 
</p>
<p> PLANS 
if(!ville_arrivee) Then 
</p>
<p>ville_arrivee :                      ( &#1567; &#1585;&#1601;&#1587;&#1604;&#1575; &#1583;&#1610;&#1585;&#1578; &#1577;&#1606;&#1610;&#1583;&#1605; &#1610;&#1571; &#1609;&#1604;&#1573;) 
                                      [IlY Oy mdynp tryd Alsfr ] 
                               (C&#8217;est quoi votre destination ?) 
if( ! heure_depart_relatif) Then 
heure_depart_relatif :             ( &#1567;&#1585;&#1601;&#1587;&#1604;&#1575; &#1583;&#1610;&#1585;&#1578; &#1578;&#1602;&#1608; &#1610;&#1571; &#1610;&#1601; ) 
                                               [fy Oy wqt tryd Alsfr] 
             (Dans quelle heure voulez-vous voyager ?) 
</p>
<p>REGLES DE COHERENCE 
</p>
<p>if(ville_depart= @ville_arrivee) Then 
                              (&#1602;&#1604;&#1575;&#1591;&#1606;&#1604;&#1575;&#1575; &#1577;&#1606;&#1610;&#1583;&#1605; &#1575;&#1607;&#1587;&#1601;&#1606; &#1610;&#1607; &#1604;&#1608;&#1589;&#1608;&#1604;&#1575; &#1577;&#1606;&#1610;&#1583;&#1605;) 
             [mdynp AlwSwl hy nfshA mdynp AlAnTlAq] 
   (La ville de d&#233;part est la m&#234;me que celle d&#8217;arriv&#233;e) 
</p>
<p>a- Structure t&#226;che horaire simplifi&#233;e  b- Structure plan horaire simplifi&#233;e 
Figure 3 : Repr&#233;sentations simplifi&#233;es des structures t&#226;che et plan horaire 
</p>
<p>Dans les sections suivantes, nous exposons en d&#233;tail les &#233;tapes du mod&#232;le de t&#226;che. Afin 
d&#8217;expliquer chaque &#233;tape, nous prenons l&#8217;exemple du sch&#233;ma horaire de la figure 4.a obtenu 
par notre syst&#232;me de compr&#233;hension suite &#224; la demande d&#8217;un utilisateur l&#8217;heure de d&#233;part du 
premier &quot;&#1604;&#1608;&#1571;&quot;  [Owl] train express &quot;&#1593;&#1610;&#1585;&#1587;&quot;  [sryE] &#224; destination de la capitale &quot;&#1577;&#1605;&#1589;&#1575;&#1593;&quot;  [EASmp]. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gestion de dialogue oral Homme-machine en arabe&#160;
</p>
<p> 
</p>
<p>Figure 4 : Sch&#233;mas horaire et prix g&#233;n&#233;r&#233;s par notre syst&#232;me de compr&#233;hension suite &#224; deux 
&#233;nonc&#233;s du m&#234;me dialogue 
</p>
<p>&#8226; Interpr&#233;tation du sch&#233;ma s&#233;mantique : le sch&#233;ma s&#233;mantique g&#233;n&#233;r&#233; par notre syst&#232;me 
de compr&#233;hension peut contenir plusieurs expressions qui n&#233;cessitent des reformulations pour 
qu&#8217;elles soient acceptables par le SGBD. Ainsi, une &#233;tape d&#8217;interpr&#233;tation du sch&#233;ma s&#8217;av&#232;re 
n&#233;cessaire pour reformuler et standardiser ces expressions. Cette &#233;tape utilise un ensemble de 
r&#232;gles d&#8217;interpr&#233;tation d&#233;gag&#233;es &#224; partir de notre corpus d&#8217;&#233;tude. Ces r&#232;gles sont regroup&#233;es 
dans les structures t&#226;ches. 
</p>
<p>Prenons &#224; titre d&#8217;exemple le sch&#233;ma horaire de la figure 4.a, la valeur assign&#233;e &#224; l&#8217;attribut 
ville d&#8217;arriv&#233;e est &quot;&#1577;&#1605;&#1589;&#1575;&#1593;&quot;  [EASmp] (capitale) necessite une interpretation afin d&#8217;&#234;tre chang&#233;e 
en &quot;&#1587;&#1606;&#1608;&#1578;&quot;  [twns] (Tunis). Aussi, la valeur du rang du train &quot;&#1604;&#1608;&#1571;&quot;  [Owl] (premier) sera convertie 
en nombre 1. 
</p>
<p>&#8226; Instanciation des attributs &#224; partir de l&#8217;historique : &#233;tant donn&#233; la continuit&#233; de l&#8217;aspect 
dialogique, l&#8217;utilisateur peut omettre quelques d&#233;tails qu&#8217;il a d&#233;j&#224; mentionn&#233;s dans ses 
interventions pr&#233;c&#233;dentes. Ce qui se traduit au niveau de l&#8217;&#233;nonc&#233; sous forme d&#8217;ellipses et 
d&#8217;anaphores et entraine la pr&#233;sence d&#8217;attributs avec des valeurs vides dans le sch&#233;ma 
s&#233;mantique. Cette &#233;tape vise &#224; r&#233;soudre les ellipses et les anaphores par l&#8217;utilisation de 
l&#8217;historique du dialogue afin de rechercher des instances possibles aux attributs vides. Dans le 
cas o&#249; la recherche &#233;tait fructueuse, l&#8217;instance trouv&#233;e est automatiquement accord&#233;e &#224; 
l&#8217;attribut en question. 
</p>
<p>Prenons &#224; titre d&#8217;exemple le sch&#233;ma prix illustr&#233; par la figure 4.b. Ce sch&#233;ma comporte des 
attributs non instanci&#233;s par le syst&#232;me de compr&#233;hension comme la ville de d&#233;part, la ville 
d&#8217;arriv&#233;e, le type du train et le jour du voyage. Ces informations sont volontairement omises 
par l&#8217;utilisateur vu qu&#8217;il les a d&#233;j&#224; precis&#233;es lors de sa question precedante (sch&#233;ma horaire de 
la figure 4.a). Ainsi, dans cette &#233;tape, le sch&#233;ma prix sera compl&#233;t&#233; &#224; partir du sch&#233;ma horaire 
d&#233;j&#224; complet&#233;, valid&#233; et stock&#233; dans l&#8217;historique du dialogue puisque ces deux sch&#233;mas font 
partie du m&#234;me dialogue. 
</p>
<p>&#8226; Instanciation des attributs par des valeurs par d&#233;faut : une deuxi&#232;me cause qui 
explique l&#8217;omission de l&#8217;utilisateur de certains d&#233;tails dans sa demande, est que celui-ci les 
consid&#232;re comme &#233;tant &#233;vidents. Pour cela, cette &#233;tape permet d&#8217;instancier quelques attributs 
par des valeurs par d&#233;faut (i.e., connues d&#8217;avance). Ces attributs et leurs valeurs sont recens&#233;s 
&#224; partir du corpus d&#8217;&#233;tude et sont stock&#233;s dans les structures t&#226;ches. 
</p>
<p>Par exemple, l&#8217;attribut jour de d&#233;part du sch&#233;ma horaire de la figure 4.a peut &#234;tre instanci&#233; par 
la valeur du jour syst&#232;me. Aussi, l&#8217;attribut ville de d&#233;part peut &#234;tre instanci&#233; par la valeur de la 
ville par d&#233;faut (i.e., le syst&#232;me est install&#233; dans la station de la gare de cette ville). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Amine Bayoudhi, Lamia Hadrich Belguith 
</p>
<p>&#8226; V&#233;rification de la coh&#233;rence : cette v&#233;rification est n&#233;cessaire pour valider la coh&#233;rence 
des informations apport&#233;es par le sch&#233;ma. Elle permet d&#8217;alerter l&#8217;utilisateur sur les erreurs de 
coh&#233;rence pouvant &#234;tre commises par manque d&#8217;attention lors de la formulation de sa 
demande. La d&#233;couverte de ces erreurs se fait gr&#226;ce &#224; un ensemble de r&#232;gles de coh&#233;rence 
recens&#233;es &#224; partir du corpus d&#8217;&#233;tude et stock&#233;es dans les structures plan. Dans le cas de 
pr&#233;sence des incoh&#233;rences, des demandes de confirmation seront g&#233;n&#233;r&#233;es &#224; l&#8217;utilisateur pour 
corriger les informations donn&#233;es &#224; la machine. 
</p>
<p>A titre d&#8217;exemple par le sch&#233;ma prix de la figure 4.b l&#8217;utilisateur cherche &#224; savoir le prix d&#8217;un 
billet pour la deuxi&#232;me classe dans le train express. Or, les trains express en Tunisie ne 
contiennent que la classe confort. Donc un message sera g&#233;n&#233;r&#233; &#224; l&#8217;utilisateur pour l&#8217;alerter de 
l&#8217;erreur. 
</p>
<p>&#8226; V&#233;rification de la compl&#233;tude : Cette &#233;tape permet de v&#233;rifier l&#8217;existence, dans le sch&#233;ma 
courant, de toutes les informations n&#233;cessaires permettant la g&#233;n&#233;ration d&#8217;une requ&#234;te valide 
vers l&#8217;application. Dans le cas &#233;ch&#233;ant, des demandes de pr&#233;cisions seront g&#233;n&#233;r&#233;es vers 
l&#8217;utilisateur afin qu&#8217;il puisse compl&#233;ter les informations qu&#8217;il a oubli&#233;es. Pour cela, chaque 
t&#226;che est dot&#233;e d&#8217;un plan contenant une liste ordonn&#233;e des attributs n&#233;cessaires et des 
messages de demande de pr&#233;cisions des attributs omis par l&#8217;utilisateur. 
</p>
<p>Une fois le sch&#233;ma s&#233;mantique compl&#233;t&#233;, une requ&#234;te SQL est g&#233;n&#233;r&#233;e vers la base de 
donn&#233;es de l&#8217;application afin de d&#233;gager les informations recherch&#233;es par l&#8217;utilisateur. Ces 
informations sont ensuite reformul&#233;es sous forme des r&#233;ponses en langage naturel et envoy&#233;es 
&#224; l&#8217;utilisateur. Notons que les interventions de la machine peuvent &#234;tre aussi sous forme de 
demandes de confirmations qui ne sont pas directement communiqu&#233;es &#224; l&#8217;utilisateur mais 
elles passent &#224; travers le mod&#232;le de dialogue que nous exposons dans la section suivante. 
</p>
<p>3.2 Le mod&#232;le de dialogue 
</p>
<p>Le mod&#232;le de dialogue s&#8217;occupe des interactions avec l&#8217;utilisateur (voir figure 5). Il permet de 
g&#233;rer le dialogue et d&#8217;assurer sa continuation en identifiant les intentions et en pr&#233;voyant les 
solutions convenables pour les situations critiques comme la rupture de dialogue, Il permet 
aussi de communiquer avec le mod&#232;le de t&#226;che afin de r&#233;cup&#233;rer les questions ainsi que les 
r&#233;ponses &#224; g&#233;n&#233;rer &#224; l&#8217;utilisateur. 
</p>
<p> 
Figure 5 : Repr&#233;sentation d&#233;taill&#233;e du mod&#232;le de dialogue </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gestion de dialogue oral Homme-machine en arabe&#160;
</p>
<p>Le r&#244;le principal du mod&#232;le de dialogue est de reconna&#238;tre l&#8217;acte de dialogue, qui constitue la 
plus petite unit&#233; du dialogue, dans l&#8217;intervention de l&#8217;utilisateur. L&#8217;identification des actes est 
effectu&#233;e gr&#226;ce &#224; des marqueurs linguistiques et des indices pragmatiques que nous avons 
recens&#233;s &#224; partir de notre corpus d&#8217;&#233;tude et qui sont stock&#233;s dans un fichier de correspondance 
&#233;tiquette &#8211; acte. Ce fichier regroupe un ensemble de paires 
&#233;tiquette s&#233;mantique / acte de dialogue utiles lors de l&#8217;identification des actes de dialogue 
utilisateur. 
</p>
<p>Les actes de dialogue sont regroup&#233;s dans des structures plus complexes appel&#233;s les sous-
dialogues et sont ensuite rassembl&#233;s dans une grammaire formelle d&#233;crivant l&#8217;ensemble des 
r&#232;gles de r&#233;&#233;criture du dialogue. Cette grammaire permet de poursuivre et de contr&#244;ler 
l&#8217;&#233;volution du dialogue pour faciliter l&#8217;identification des actes d&#8217;une part et pour d&#233;tecter les 
incidences d&#8217;autre part. 
</p>
<p>En plus des marqueurs linguistiques et de la grammaire formelle, le mod&#232;le de dialogue utilise 
des r&#232;gles pour l&#8217;identification des actes de dialogue utilisateur. Par exemple, Si le dernier 
acte de dialogue est un acte de demande de pr&#233;cision, de reformulation ou de confirmation 
alors l&#8217;acte de dialogue courant est une r&#233;ponse. 
</p>
<p>Selon l&#8217;acte de dialogue utilisateur identifi&#233;, le mod&#232;le de dialogue d&#233;cide du traitement que 
doit subir le sch&#233;ma s&#233;mantique provenant du syst&#232;me de compr&#233;hension (voir figure 5). Si 
l&#8217;acte de dialogue est une formalit&#233; d&#8217;ouverture ou de fermeture de dialogue ou un acte de 
relance, alors le mod&#232;le de dialogue g&#233;n&#232;re l&#8217;acte machine et le message correspondant en 
utilisant un fichier de correspondance acte-message. Dans le cas o&#249; l&#8217;acte identifi&#233; est 
diff&#233;rent de ces trois actes, le sch&#233;ma s&#233;mantique est envoy&#233; vers le mod&#232;le de t&#226;che pour &#234;tre 
trait&#233; comme nous l&#8217;avons expliqu&#233; dans la section 3.1. 
</p>
<p>4 Conclusion 
Dans ce papier, nous avons propos&#233; une m&#233;thode pour la gestion de dialogue oral en arabe 
standard moderne. Cette m&#233;thode est bas&#233;e sur l&#8217;approche structurelle et repose sur deux 
mod&#232;les &#224; savoir, le mod&#232;le de t&#226;che et le mod&#232;le de dialogue. Le mod&#232;le de t&#226;che permet 
d&#8217;interpr&#233;ter et de compl&#233;ter les demandes des utilisateurs, formuler les requ&#234;tes &#224; communiquer &#224; la 
base de donn&#233;es de l&#8217;application et g&#233;n&#233;rer les r&#233;ponses &#224; l&#8217;utilisateur. Le mod&#232;le de dialogue permet 
l&#8217;identifiant des actes de dialogue, d&#233;cide la nature de l&#8217;intervention machine ad&#233;quate et assure le 
suivi et l&#8217;avancement du dialogue en cas d&#8217;incidence ou de rupture. 
</p>
<p>Comme perspectives, nous envisageons d&#8217;&#233;tendre les deux mod&#232;les de dialogue pour couvrir 
certains probl&#232;mes non r&#233;solus par notre syst&#232;me de compr&#233;hension &#224; savoir, le traitement des 
disfluences complexes et imbriqu&#233;es, ainsi que le traitement des mots consid&#233;r&#233;s comme hors-
vocabulaire par le syst&#232;me de compr&#233;hension. 
</p>
<p>R&#233;f&#233;rences 
Allen J. F., Perrault C. R. (1980). Analysing intention in dialogues. Artificial Intelligence, 
volume 15, N&#176;3, Pages 23-46. 
</p>
<p>Bahou Y., Belguith Hadrich L., Ben Hamadou A. (2008). Towards a Human-Machine Spoken 
Dialogue in Arabic. LREC&#8217;08, Workshop HLT within the Arabic World: Arabic Language 
and local languages processing Status Updates and Prospects, Marrakech, Maroc. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Amine Bayoudhi, Lamia Hadrich Belguith 
</p>
<p>Baker M. (1994). A model for negocition in teaching-learning dialogues. Journal of Artificial 
Intelligence in Education, Volume 5, N&#176;2, Pages 199-254. 
</p>
<p>Caelen J., Xuereb A. (2007). Interaction et pragmatique: jeux de dialogue et de langage. 
Paris : Herm&#232;s-Lavoisier. 
</p>
<p>Cohen P. R., Perrault C. R. (1979). Elements of a plan based theory of speech acts. Cognitive 
science, volume 3, Pages 177-212. 
</p>
<p>Dessales J. L. (1993). Mod&#232;le cognitif de la conversation spontan&#233;e appliqu&#233; &#224; 
l&#8217;apprentissage. Th&#232;se de doctorat, ENST, Paris, France. 
</p>
<p>Husltin J. (2000). Dialogue model fors for inquiry and transaction. Th&#232;se de doctorat, 
Universit&#233; de Twente, Pays-Bas. 
</p>
<p>Luzzati D. (1989). Recherches sur le dialogue homme-machine: mod&#232;les linguistiques et 
traitement automatique. Th&#232;se d&#8217;Etat, Paris III, France. 
</p>
<p>Minker W., Bennacef S. (2004). Speech And Human-Machine Dialog. Pays-Bas : Kluwer 
Academic Publishers Group. 
</p>
<p>Nguyen H. (2005). Dialogue homme-machine : mod&#233;lisation de multisessions. Th&#232;se de 
doctorat, Universit&#233; Joseph Fourier, France. 
</p>
<p>Nilson N. J. (1980). Principles of artificial intelligence. San Francisco : Morgan Kaufmann 
Publishers Inc. 
</p>
<p>Rickel J., Lesh N., Rich C., Sidner C. L., Gertner A. (2001). Using a model of collaborative 
dialogue to teach procedural tasks. Workshop on Tutorial Dialog Systems, AIED, San 
Antonio, Texas, USA. 
</p>
<p>Rosset S., Lamel L. (2001). Gestionnaire de dialogue pour un syst&#232;me d&#8217;informations &#224; 
reconnaissance vocale. TALN&#8217;01, Tours, France. 
</p>
<p>Rouillard J. (2000). Hyperdialogue sur Internet: Le syst&#232;me HALPIN. Th&#232;se de doctorat, 
Universit&#233; Grenoble I, France. 
</p>
<p>Roulet E., Auchlin A., Moeschler J., Rubattel C., Schelling M. (1991). L&#8217;articulation du 
discours en fran&#231;ais contemporain. 3&#232;me &#233;d. Berne : Peter Lang. 
</p>
<p>Sadek D. (1996). Le dialogue homme-machine: de l&#8217;ergonomie des interfaces &#224; l&#8217;agent 
intelligent dialoguant. OFTA, ARAGO 18 Nouvelles interfaces homme-Machine, Pages 277-
321. 
</p>
<p>Sidner C. L., Lee C. H., Lesh N. (2003). The Role of Dialog in Human Robot Interaction. 
International Workshop on Language Understanding and Agents for Real World Interaction, 
Sapporo, Japan. </p>

</div></div>
</body></html>