<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Des relations d&#8217;alignement pour d&#233;crire l&#8217;interaction des domaines linguistiques : vers des Grammaires Multimodales</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des Grammaires Multimodales 
</p>
<p>Des relations d&#8217;alignement pour d&#233;crire l&#8217;interaction des 
domaines linguistiques : vers des Grammaires Multimodales 
</p>
<p> 
</p>
<p>Philippe Blache 
 
</p>
<p> Laboratoire Parole et Langage 
CNRS &amp; Universit&#233; de Provence 
</p>
<p>blache@lpl-aix.fr 
</p>
<p>R&#233;sum&#233;  
Un des probl&#232;mes majeurs de la linguistique aujourd&#8217;hui r&#233;side dans la prise en compte de 
ph&#233;nom&#232;nes relevant de domaines et de modalit&#233;s diff&#233;rentes. Dans la litt&#233;rature, la r&#233;ponse 
consiste &#224; repr&#233;senter les relations pouvant exister entre ces domaines de fa&#231;on externe, en 
termes de relation de structure &#224; structure, s&#8217;appuyant donc sur une description distincte de 
chaque domaine ou chaque modalit&#233;. Nous proposons dans cet article une approche diff&#233;rente 
permettant repr&#233;senter ces ph&#233;nom&#232;nes dans un cadre formel unique, permettant de rendre 
compte au sein d&#8217;une m&#234;me grammaire tous les ph&#233;nom&#232;nes concern&#233;s. Cette repr&#233;sentation 
pr&#233;cise de l&#8217;interaction entre domaines et modalit&#233;s s&#8217;appuie sur la d&#233;finition de relations 
d&#8217;alignement.  
</p>
<p>Abstract 
Linguistics is now faced with the question of representing information coming from different 
domains or modalities. The classical answer consists in representing separately each of these 
domains, building for each of them an independent structure, and then representing domain 
interaction in terms of relation between structures. We propose n this paper a different 
approach in which all information is represented within a unique and homogeneous 
framework, making it possible to represent into a same grammar all interaction phenomena. 
This precise representation of interaction relies on the definition of a new notion of alignment 
relations. 
</p>
<p>Mots-cl&#233;s :   Multimodalit&#233;, interaction entre domaines, grammaire, corpus 
multimodaux 
Keywords:   Multimodality, domains interaction, grammar, multimodal corpora 
</p>
<p>1 Introduction 
La linguistique est confront&#233;e &#224; la n&#233;cessit&#233; de d&#233;velopper un cadre th&#233;orique prenant en 
compte l&#8217;ensemble de ses domaines d&#8217;information que sont la prosodie, la syntaxe, la 
pragmatique, etc. De nombreuses &#233;tudes d&#233;crivent les interactions pouvant exister entre eux, 
en particulier concernant l&#8217;interaction prosodie/syntaxe (voir par exemple [Hirst96], 
[Selkirk84], [Doetjes02], [Delais-Roussarie08], etc.). Cependant, ces &#233;tudes sont presque </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache 
</p>
<p>syst&#233;matiquement abord&#233;es en termes d&#8217;interaction entre structures (par exemple entre arbre 
syntaxique et structure prosodique) et s&#8217;appuient donc sur une conception des domaines 
ind&#233;pendants les uns des autres. Chaque domaine dispose dans cette perspective de sa propre 
repr&#233;sentation (accessoirement de sa propre th&#233;orie et de sa propre grammaire). Or, ce type 
d&#8217;explication, qui s&#8217;appuie de fait sur une recherche de congruence entre structures, s&#8217;av&#232;re 
trop rigide lorsqu&#8217;elle est mise &#224; l&#8217;&#233;preuve de donn&#233;es r&#233;elles. La complexit&#233; du probl&#232;me se 
renforce encore d&#232;s lors qu&#8217;on tente de d&#233;crire les interactions entre diff&#233;rentes modalit&#233;s (par 
exemple entre le geste et la parole, voir [McNeil05]). On sait aujourd&#8217;hui que la 
compr&#233;hension des m&#233;canismes d&#8217;&#233;laboration d&#8217;un message (donc de la communication) 
passe par la description de ces ph&#233;nom&#232;nes.  
</p>
<p>Le but de cet article est de proposer une nouvelle approche proposant de repr&#233;senter ces 
ph&#233;nom&#232;nes dans un cadre formel unique, permettant de rendre compte au sein d&#8217;une m&#234;me 
grammaire tous les ph&#233;nom&#232;nes concern&#233;s. Cette repr&#233;sentation pr&#233;cise de l&#8217;interaction entre 
domaines et modalit&#233;s s&#8217;appuie sur la d&#233;finition de relations d&#8217;alignement. Nous exposerons 
dans une premi&#232;re partie un ensemble de ph&#233;nom&#232;nes d&#8217;alignement observ&#233;s dans un corpus 
multimodal qui nous permettront, dans une seconde partie, de d&#233;finir ces relations 
d&#8217;alignement. Nous en proposerons dans la derni&#232;re section une repr&#233;sentation sous forme de 
contraintes et terminerons par une discussion des r&#233;sultats. 
</p>
<p>2 L&#8217;annotation de corpus multimodaux 
Plusieurs projets internationaux portant  sur la question des donn&#233;es multimodales ont &#233;t&#233; mis 
en place ces derni&#232;res ann&#233;es. Il s&#8217;agit en particulier des projets MATE (Multilevel 
Annotation, Tools Engineering, [Dybkjaer98]), ATLAS (Architecture and Tools for 
Linguistic Analysis System, [Bird00]), NITE (Natural Interactivity Tools Engineering), Map 
Task (conduit au HCRC), DAMSL (Dialog Act Markup in Several Layers, [Core97]) ou 
encore Verbmobil. Il n&#8217;existe cependant que peu d&#8217;initiatives portant sur la constitution de 
corpus multimodaux visant une certaine exhaustivit&#233; dans les annotations. La principale 
ressource d&#233;velopp&#233;e dans ce domaine est le corpus AMI (voir [Carletta05]) qui contient 
100h de r&#233;unions film&#233;es qui ont &#233;t&#233; transcrites et annot&#233;es principalement pour les gestes et 
la structure de l&#8217;information.  
</p>
<p>Pour le fran&#231;ais, le projet OTIM (Outils de traitement d&#8217;information multimodale)1 se fixe 
pour objectif de d&#233;velopper une ressource de ce type mais pour laquelle l&#8217;ensemble des 
domaines est annot&#233; aussi pr&#233;cis&#233;ment que possible. Le CID (Corpus of Interactional Data, 
cf. [Bertrand09]) est la premi&#232;re ressource r&#233;alis&#233;e dans ce cadre. Il est compos&#233; de 8 
dialogues de 1h, repr&#233;sentant environ 100.000 mots. Le corpus est totalement transcrit 
orthographiquement, phon&#233;tiquement et toutes les annotations sont align&#233;es sur le signal 
acoustique, offrant ainsi la possibilit&#233; d&#8217;une &#233;tude pr&#233;cise des ph&#233;nom&#232;nes d&#8217;interaction. Les 
transcriptions orthographiques et phon&#233;tiques permettent la production d&#8217;annotations de plus 
haut niveau (morphologie, syntaxe, prosodie, pragmatique, etc.) elles-m&#234;mes align&#233;es sur le 
signal. Il s&#8217;agit d&#8217;une ressource unique en son genre pour le fran&#231;ais tant par sa taille que par 
la pr&#233;cision des annotations. A notre connaissance, aucune autre ressource comparable par la 
taille et le niveau d&#8217;information n&#8217;est disponible pour une autre langue. Il ouvre la possibilit&#233; 
de nouveaux types de recherches sur de la parole spontan&#233;e.  
</p>
<p>                                                 
</p>
<p>1
 Projet ANR conduit par le LPL en partenariat avec les laboratoires LIMSI, LSIS, LIA, RFC et LLING. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des Grammaires Multimodales 
</p>
<p>Les enrichissements du CID concernent &#224; ce jour : transcription orthographique, transcription 
phon&#233;tique, unit&#233;s interpausales, unit&#233;s prosodiques, fonctions prosodiques, backchannels, 
unit&#233;s de constructions de tours, gestes, &#233;tiquettes morpho-syntaxiques, chunks, segments 
syntaxiques (ou pseudo-phrases). Une partie du corpus (trois dialogues) a &#233;t&#233; &#233;galement 
annot&#233;e pour ce qui concerne les ph&#233;nom&#232;nes de d&#233;tachement. Ces transcriptions ou 
annotations ont &#233;t&#233; produites automatiquement lorsque les outils existaient. Par exemple, le 
traitement de la transcription orthographique (segmentation, &#233;tiquetage, chunking) a &#233;t&#233; 
r&#233;alis&#233; &#224; l&#8217;aide d&#8217;outils d&#233;velopp&#233;s au LPL (&#233;valu&#233;s dans le cadre des campagnes Easy et 
Passage, cf. [Blache08]). Le reste a &#233;t&#233; produit manuellement par des experts. 
</p>
<p>3 Interactions entre domaines observ&#233;es dans le corpus 
Nous proposons dans cette section une illustration du type d&#8217;information portant sur 
l&#8217;interaction de plusieurs domaines (et donc plusieurs niveaux d&#8217;annotations) qu&#8217;il devient 
possible d&#8217;extraire gr&#226;ce &#224; ce type de corpus. Nous nous sommes appuy&#233;s pour identifier la 
cooccurrence d&#8217;&#233;v&#233;nements sur une synchronisation relative des fronti&#232;res droites des unit&#233;s 
annot&#233;s. Cette synchronisation a &#233;t&#233; calcul&#233;e avec une marge variable de recouvrement entre 
unit&#233;s en fonction du type de ph&#233;nom&#232;ne et de la fa&#231;on dont il a &#233;t&#233; annot&#233; (automatiquement, 
ou manuellement). Ainsi, les unit&#233;s syntaxiques, g&#233;n&#233;r&#233;es par l&#8217;analyseur, sont align&#233;es 
exactement sur le signal gr&#226;ce &#224; la synchronisation des transcriptions phon&#233;tiques et 
orthographiques. En revanche, les unit&#233;s prosodiques ou les d&#233;tachements ayant &#233;t&#233; annot&#233;s 
manuellement, il y a donc une marge d&#8217;erreur.  
</p>
<p>3.1 Unit&#233;s prosodiques et syntaxiques 
</p>
<p>La description de la structure prosodique repose sur l&#8217;identification d&#8217;unit&#233;s constituant la 
structure prosodique (cf. [Jun02]) : le syntagme accentuel (AP) et le syntagme intonatif (IP), 
caract&#233;ris&#233;s par des contours2 prosodiques particuliers. Le CID a &#233;t&#233; annot&#233; en utilisant les 
contours prosodiques suivants : mr (mont&#233;e mineure), m0 (autres contours mineurs),  RMC 
(continuation majeure), ENUM (contour d&#8217;&#233;num&#233;ration), fl (contour plat), F (contour 
descendant), R (contour montant), RF1 (contour montant-descendant), RF2 (contour 
descendant depuis la p&#233;nulti&#232;me), RQ (mont&#233;e de question), RT (mont&#233;e terminale). 
</p>
<p>334
</p>
<p>1627
</p>
<p>111
</p>
<p>993
</p>
<p>78 76 38
136
</p>
<p>913
</p>
<p>99
188
</p>
<p>0
</p>
<p>200
</p>
<p>400
</p>
<p>600
</p>
<p>800
</p>
<p>1000
</p>
<p>1200
</p>
<p>1400
</p>
<p>1600
</p>
<p>1800
</p>
<p>m0 mr F fl REM RENUM RF1 RF2 RMC RQ RT
</p>
<p>AP IP
</p>
<p> 
</p>
<p>Figure 1 : R&#233;partition des contours  prosodiques par type d&#8217;unit&#233; 
</p>
<p>                                                 
</p>
<p>2
 Un contour est un mouvement m&#233;lodique g&#233;n&#233;ralement caract&#233;ris&#233; par une direction (montant, descendant, 
</p>
<p>etc.), une position (finale, p&#233;nulti&#232;me, etc.) et une fonction (conclusif, continuatif). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache 
</p>
<p>Un des probl&#232;mes pos&#233;s pour l&#8217;analyse de la structure prosodique, une fois les contours 
d&#233;tect&#233;s, est celui de l&#8217;identification des fronti&#232;res des constituants. La figure (1) illustre le 
type de contours observ&#233;s sur une heure de corpus. Ces r&#233;sultats pr&#233;sentent l&#8217;int&#233;r&#234;t de porter 
sur des donn&#233;es r&#233;elles, permettant de confirmer les observations &#233;tablies dans la litt&#233;rature 
sur la base de donn&#233;es construites. On constate que le contour /mr/3 est de loin le plus utilis&#233; 
pour les AP tandis que les contours des IP sont concentr&#233;s autour de deux r&#233;alisations : /fl/ et 
/RMC/.  Bien entendu, le style de discours utilis&#233; dans ce corpus (majoritairement narratif) 
influence &#233;galement la r&#233;partition des contours r&#233;alis&#233;s. Ce sch&#233;ma n&#8217;est donc pas totalement 
g&#233;n&#233;ralisable, mais suffisamment marqu&#233; pour en proposer une premi&#232;re relation existant 
entre /AP/ et /mr/ d&#8217;une part et /IP/ et {/RMC/, /fl/} d&#8217;autre part.  
Nous avons ensuite recherch&#233; les relations pouvant exister entre unit&#233;s prosodiques et 
syntaxiques. Nous avons pour cela utilis&#233; une analyse en chunks r&#233;alis&#233;e par un des parseurs 
du LPL (cf. Blache08) et fournissant un d&#233;coupage en unit&#233;s syntaxiques non r&#233;cursives 
suivant la d&#233;finition propos&#233;e dans le cadre de la campagne Easy. Les groupes utilis&#233;s ici 
sont : GA (groupe adjectival), GN (nominal), GP (pr&#233;positionnel), GR (adverbial), NV (noyau 
verbal), PV (groupe verbal pr&#233;positionnel). La figure suivante pr&#233;sente pour chaque unit&#233; 
syntaxique le type d&#8217;unit&#233; prosodique correspondant. Deux groupes pr&#233;sentent des 
particularit&#233;s : le GR qui est r&#233;alis&#233; principalement comme fronti&#232;re droite d&#8217;un IP et le NV 
qui, &#224; la diff&#233;rence des autres groupes, est majoritairement reli&#233; &#224; un AP. Cette observation 
confirme sur une plus grande &#233;chelle une observation sur un extrait de corpus faite dans 
Bertrand07 relevant une r&#233;alisation des contours mineurs en fin de construction verbale, ou 
entre deux constituants r&#233;gis par le verbe (sujet ou compl&#233;ment). Une analyse de la r&#233;partition 
des contours par chunks, pr&#233;sent&#233;e dans la figure suivante, montre une relation forte entre le 
/NV/ et le contour /mr/ de m&#234;me qu&#8217;entre /GR/ et le contour /fl/. En revanche, les autres 
contours semblent proportionnellement mieux r&#233;partis pour les groupes.  
</p>
<p>28
</p>
<p>125
86
</p>
<p>190
</p>
<p>301
</p>
<p>28
</p>
<p>74
</p>
<p>173 184
</p>
<p>452
</p>
<p>208
</p>
<p>13
0
</p>
<p>50
</p>
<p>100
</p>
<p>150
</p>
<p>200
</p>
<p>250
</p>
<p>300
</p>
<p>350
</p>
<p>400
</p>
<p>450
</p>
<p>500
</p>
<p>GA GN GP GR NV PV
</p>
<p>AP
IP
</p>
<p>0
</p>
<p>50
</p>
<p>100
</p>
<p>GA
GN
GP
GR
NV
PV
</p>
<p>GA 5 23 19 6 0 0 9 28 4 6
GN 15 110 28 39 4 0 8 76 7 10
GP 9 77 26 29 0 2 8 96 9 13
GR 33 155 40 280 5 4 24 61 13 22
NV 56 244 25 49 4 4 14 78 19 13
PV 1 27 1 1 1 0 2 6 2 0
</p>
<p>m0 mr F fl REM RF1 RF2 RMC RQ RT
AP IP
</p>
<p> 
</p>
<p>Figure 2 : R&#233;partition des contours prosodiques par unit&#233;s syntaxiques 
</p>
<p>Nous n&#8217;entrons pas ici dans l&#8217;interpr&#233;tation des relations observ&#233;es, ce travail faisant l&#8217;objet 
d&#8217;une &#233;tude linguistique en cours. En revanche, il est utile, notamment dans une perspective 
de cat&#233;gorisation ou de d&#233;sambigu&#239;sation lors du processus d&#8217;analyse, de disposer de ces 
informations : la connaissance du contour prosodiques permettra de favoriser  certaines 
cat&#233;gories au d&#233;triment d&#8217;autres. 
</p>
<p>                                                 
</p>
<p>3
 On note dans le reste de l&#8217;article les &#233;tiquettes entre barres obliques. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des Grammaires Multimodales 
</p>
<p>3.2 Deux ph&#233;nom&#232;nes : d&#233;tachements et backchannels 
</p>
<p>Nous pr&#233;sentons dans cette section deux types d&#8217;annotations de plus haut niveau, effectu&#233;e 
manuellement par des experts4 et permettant d&#8217;illustrer l&#8217;int&#233;r&#234;t de ce type de ressources. Ces 
annotations portent sur les constructions d&#233;tach&#233;es (ph&#233;nom&#232;nes consistant &#224; d&#233;tacher un 
&#233;l&#233;ment de la phrase et le r&#233;aliser g&#233;n&#233;ralement avant elle) et les backchannels (ph&#233;nom&#232;nes 
discursifs, vocaux ou gestuels, de r&#233;action de l&#8217;interlocuteur au discours d&#8217;un locuteur). 
L&#8217;annotation des structures d&#233;tach&#233;es a port&#233; sur les ph&#233;nom&#232;nes suivants : SbjD (sujet 
lexicalis&#233; disloqu&#233;), SbjProD (pronom sujet disloqu&#233;), DirObjD (objet direct lexicalis&#233; 
disloqu&#233;), DirObjProD (pronom objet disloqu&#233;), IndObjD (objet indirect lexicalis&#233; 
disloqu&#233;), IndObjProD (pronom objet indirect disloqu&#233;). De plus, les sujets lexicalis&#233;s ont 
&#233;galement &#233;t&#233; rep&#233;r&#233;s (&#233;tiquet&#233;s /Sbj/, sujet lexicaux), dans la perspective d&#8217;une &#233;tude 
comparative sur le redoublement clitique. 
</p>
<p>Le premier tableau de la figure 3 indique la r&#233;partition des contours utilis&#233;s sur ces 
constructions, tous types confondus. Il est important de souligner que le niveau d&#8217;information 
est ici tr&#232;s g&#233;n&#233;ral dans la mesure o&#249; il cumule tous les types de d&#233;tachement. Il n&#8217;est donc 
pas possible ici de rechercher des relations directes qui permettraient d&#8217;associer un type de 
contour &#224; un type de d&#233;tachement. Par ailleurs, il faut rappeler que les unit&#233;s syntaxiques 
g&#233;n&#233;r&#233;es sont des chunks non r&#233;cursifs. L&#8217;alignement, obtenu automatiquement, indique les 
relations entre l&#8217;&#233;l&#233;ment disloqu&#233; (nous y reviendrons plus loin) et le dernier chunk le 
composant (qui n&#8217;est pas n&#233;cessairement l&#8217;unit&#233; syntaxique de plus haut niveau qui 
correspondrait au segment &#233;tudi&#233;, mais simplement la derni&#232;re), expliquant par exemple la 
proportion importante de GR report&#233;e dans le tableau. Nous sommes cependant dans cet 
article essentiellement int&#233;ress&#233;s par les aspects quantitatifs de la corr&#233;lation entre domaines. 
Les informations fournies sont de ce point de vue fiables. 
</p>
<p> 
</p>
<p>0
</p>
<p>5
</p>
<p>10
</p>
<p>15
</p>
<p>20
</p>
<p>25
</p>
<p>30
</p>
<p>35
</p>
<p>40
</p>
<p>45
</p>
<p>50
</p>
<p>m0 mr F fl REM RF1 RF2 RMC RQ RT
</p>
<p>AP IP
</p>
<p>0
</p>
<p>5
</p>
<p>10
</p>
<p>15
</p>
<p>20
</p>
<p>25
</p>
<p>Sbj
SbjD
SbjProD
</p>
<p>Sbj 3 15 1 8
SbjD 2 19 4 1 4 7 3
SbjProD 6 21 1 3 3 1 6 1 1
</p>
<p>m0 mr F fl REM RF1 RF2 RMC RQ RT
AP IP
</p>
<p> 
</p>
<p>Figure 3 : R&#233;partition des contours prosodiques par types de d&#233;tachement 
</p>
<p>Du point de vue de la r&#233;partition globale des contours, on constate pour les d&#233;tachements une 
r&#233;partition identique &#224; celle des donn&#233;es globales de la figure 1. En particulier, le contour le 
plus fr&#233;quent est /mr/. On constate en revanche la faible proportion de contours d&#8217;IP, r&#233;v&#233;lant 
une relation syntaxique forte entre l&#8217;&#233;l&#233;ment d&#233;tach&#233; et le reste de la phrase. Les donn&#233;es plus 
pr&#233;cises du second tableau indiquent quant &#224; elles un fonctionnement tr&#232;s homog&#232;ne des types 
concern&#233;s, y compris pour les sujets lexicalis&#233;s5. Il s&#8217;agit l&#224; d&#8217;une information int&#233;ressante 
                                                 
</p>
<p>4
 Roxane Bertrand (LPL), Ga&#235;lle Ferr&#233; (LLING) et Lisa Brunetti (LPL) ont effectu&#233; ces annotations. 
</p>
<p>5
 Il s&#8217;agit de sujets construits de fa&#231;on canonique comme dans la phrase &#171; Le livre est int&#233;ressant &#187;, &#224; la 
</p>
<p>diff&#233;rence de sujets disloqu&#233;s comme dans &#171; Le livre, il est int&#233;ressant &#187;. On constate dans nos corpus, 
comme le tableau 3 l&#8217;indique, une proportion relativement faible de ce type de sujets dans les corpus oraux. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache 
</p>
<p>tendant &#224; montrer que ce type de sujets a un fonctionnement marqu&#233; prosodiquement et 
proche de celui des sujets disloqu&#233;s. 
Le second ph&#233;nom&#232;ne d&#8217;alignement que nous avons choisi concerne les backchannels. Il 
s&#8217;agit plus pr&#233;cis&#233;ment de signaux vocaux ou gestuels &#233;mis par l&#8217;interlocuteur pour montrer 
son &#233;coute, sa compr&#233;hension, son accord, etc. Les &#233;l&#233;ments fournis ici sont repris de l&#8217;&#233;tude 
pr&#233;sent&#233;e dans Bertrand09 qui a montr&#233; que ces ph&#233;nom&#232;nes &#233;taient favoris&#233;s par des 
&#233;v&#233;nements prosodiques ou discursifs. En effet, nous avons montr&#233; que les backchannels 
interviennent de fa&#231;on tout &#224; fait pr&#233;pond&#233;rante apr&#232;s des IP (en particulier apr&#232;s des contours 
plats /fl/). De m&#234;me, du point de vue discursif, trois types de tours conversationnels ont &#233;t&#233; 
annot&#233;s : les tours ayant un caract&#232;re complet du point de vue syntaxique, s&#233;mantique et 
pragmatiques (appel&#233;s tours finaux et not&#233;s /f/), les composants incomplets (not&#233;s /nf/) et les 
cas o&#249; le narrateur atteint un point de compl&#233;tude de son discours et marque une volont&#233; de 
passer le tour de parole (appel&#233;s tours de continuation et not&#233;s /cont/). De ce point de vue, 
les backchannels apparaissent pr&#233;f&#233;rentiellement apr&#232;s des tours /f/. Le tableau de la figure 4 
r&#233;capitule ces diff&#233;rentes informations et indique (en pourcentage) les proportions d&#8217;objets 
apr&#232;s lesquels des backchannels apparaissent. 
</p>
<p>0
</p>
<p>10
</p>
<p>20
</p>
<p>30
</p>
<p>40
</p>
<p>50
</p>
<p>60
</p>
<p>70
</p>
<p>80
</p>
<p>AP IP cont f nf R RMC RT fl m0 mr 
</p>
<p>Unit&#233;s intonatives Unit&#233;s conversationnelles Contours intonatifs 
 
</p>
<p>Figure 4 : R&#233;partition des backchannels  
</p>
<p>4 Informations n&#233;cessaires &#224; la repr&#233;sentation de l&#8217;alignement  
Nous revenons dans cette section sur les observations propos&#233;es dans la section pr&#233;c&#233;dente. Il 
s&#8217;agit ici de d&#233;terminer les informations qu&#8217;il sera n&#233;cessaire d&#8217;utiliser pour d&#233;crire les 
ph&#233;nom&#232;nes d&#8217;alignement dans une grammaire multimodale.  
</p>
<p>Concr&#232;tement, ces relations se manifestent par une synchronisation des &#233;v&#233;nements. Bien 
entendu, la synchronisation de deux &#233;v&#233;nements ne signifie pas n&#233;cessairement leur 
interaction. Elle est cependant une contrainte forte dans le cas o&#249; l&#8217;interaction est av&#233;r&#233;e. 
C&#8217;est vrai &#224; l&#8217;int&#233;rieur d&#8217;une m&#234;me modalit&#233; (par exemple pour les interactions entre tons et 
contours intonatifs, relevant tous deux d&#8217;informations v&#233;hicul&#233;es par le signal acoustique), 
mais &#233;galement entre diff&#233;rentes modalit&#233;s. L&#8217;interaction geste/parole est par exemple 
synchronis&#233;e lorsqu&#8217;elle est r&#233;alis&#233;e dans le cadre d&#8217;une expression r&#233;f&#233;rentielle. Dans ce cas, 
un geste d&#233;ictique pourra &#234;tre synchronis&#233; par exemple avec un pronom. L&#8217;alignement 
temporel d&#233;pend par ailleurs du type d&#8217;interaction observ&#233;. Nous trouverons en effet dans 
certains cas (g&#233;n&#233;ralement &#224; l&#8217;int&#233;rieur d&#8217;une m&#234;me modalit&#233;) des synchronisations strictes, 
imposant des fronti&#232;res temporelles identiques (ou tr&#232;s proches) pour les objets en interaction. 
Dans d&#8217;autres cas en revanche (par exemple pour l&#8217;interaction geste/parole), une simple 
intersection temporelle sera suffisante. Il est ainsi n&#233;cessaire de repr&#233;senter par la suite le type 
d&#8217;alignement (strict ou l&#226;che) de la relation.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des Grammaires Multimodales 
</p>
<p>Par ailleurs, deux grands types de relation d&#8217;interactions peuvent &#234;tre distingu&#233;s. Le premier 
concerne des relations exprimant un caract&#232;re obligatoire et constitutif de la construction 
analys&#233;e. Par exemple, les constructions &#233;num&#233;ratives ont une double contrainte syntaxique et 
prosodique requ&#233;rant g&#233;n&#233;ralement la reprise d&#8217;un constituant syntaxique et d&#8217;un contour 
m&#233;lodique de m&#234;me type. De m&#234;me, les constructions interrogatives non marqu&#233;es 
syntaxiquement requi&#232;rent un contour m&#233;lodique ascendant. En revanche, certaines relations 
d&#8217;alignement sont ind&#233;pendantes d&#8217;une construction sp&#233;cifique. C&#8217;est le cas par exemple des 
backchannels vocaux qui apparaissent toujours apr&#232;s des IPs. De m&#234;me, l&#8217;observation faite 
dans la section pr&#233;c&#233;dente sur l&#8217;interaction entre contours intonatifs et cat&#233;gories syntaxiques 
montre que le contour /mr/ appara&#238;t de fa&#231;on privil&#233;gi&#233;e avec certaines cat&#233;gories syntaxiques 
comme  /NV/ ou, dans une moindre mesure, /GR/. Ces secondes relations d&#8217;interaction sont 
plus g&#233;n&#233;rales dans le sens o&#249; elles portent sur des objets de diff&#233;rents domaines, 
ind&#233;pendamment d&#8217;un type de construction ou d&#8217;un ph&#233;nom&#232;ne particulier. On remarquera 
par ailleurs que les relations peuvent &#233;galement &#234;tre n&#233;gatives. Par exemple, les backchannels 
n&#8217;apparaissent pas apr&#232;s les connecteurs. Nous proposons donc de distinguer deux types de 
contraintes d&#8217;alignement : 
</p>
<p>&#8226; Contraintes d&#8217;alignement locales : caract&#233;ristiques d&#8217;une construction particuli&#232;re, 
elles ont un caract&#232;re fort, voire obligatoire  
</p>
<p>&#8226; Contraintes d&#8217;alignement globales : indiquant une relation entre deux objets, 
ind&#233;pendamment d&#8217;une construction pr&#233;cise 
</p>
<p>En termes de repr&#233;sentation, d&#232;s lors qu&#8217;il est possible selon le formalisme choisi d&#8217;associer 
une contrainte &#224; une construction, ces deux types de contraintes d&#8217;alignement ne diff&#232;reront 
donc que par l&#8217;identification de la construction ainsi que par le caract&#232;re plus ou moins 
imp&#233;ratif de la relation. Pour r&#233;capituler, voici les informations caract&#233;ristiques d&#8217;une 
contrainte d&#8217;alignement : 
</p>
<p>&#8226; Type : indique le caract&#232;re n&#233;cessaire ou interdit de la relation 
&#8226; Niveau : contrainte globale ou locale &#224; une construction  
&#8226; Objets : sp&#233;cification des objets en interaction 
&#8226; Construction : sp&#233;cification dans le cas de contrainte locale de la construction 
</p>
<p>concern&#233;e 
&#8226; Poids : degr&#233; d&#8217;obligation de la contrainte. A minima, distinction entre contrainte 
</p>
<p>imp&#233;rative (hard) et rel&#226;chable (soft) 
&#8226; Synchronisation : alignement strict ou l&#226;che des fronti&#232;res temporelles des objets 
</p>
<p>5 Proposition de repr&#233;sentation 
Les Grammaires de Propri&#233;t&#233;s (dor&#233;navant GP) se pr&#234;tent facilement &#224; la repr&#233;sentation de ce 
type d&#8217;information. Nous allons dans ce qui suit poursuivre la description en utilisant cette 
formalisation. Sans entrer dans les d&#233;tails (on pourra pour cela se reporter &#224; [Blache01]), 
rappelons qu&#8217;en GP, toutes les informations sont repr&#233;sent&#233;es sous la forme de contraintes. 
Une construction, qui peut &#234;tre un objet linguistique de n&#8217;importe quel niveau (syntagme, 
proposition, ph&#233;nom&#232;ne particulier), est d&#233;finie par un ensemble de contraintes. La 
particularit&#233; des GP est que les contraintes contiennent la totalit&#233; de l&#8217;information. Elles sont 
de fait ind&#233;pendantes les unes des autres et il est possible de les &#233;valuer s&#233;par&#233;ment. Il est 
donc tout aussi possible d&#8217;ajouter dans la description d&#8217;une construction des contraintes 
relevant de domaines diff&#233;rents.  
</p>
<p>Prenons l&#8217;exemple des contraintes globales cit&#233;es plus haut. La premi&#232;re stipule que les 
contours de type /mr/ correspondent en g&#233;n&#233;ral &#224; une unit&#233; accentuelle /AP/. Cette relation est </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache 
</p>
<p>orient&#233;e dans la mesure o&#249; la r&#233;ciproque n&#8217;est pas vraie. Dans la terminologie des GP, il s&#8217;agit 
donc d&#8217;une contrainte d&#8217;exigence qu&#8217;il est possible de repr&#233;senter de la fa&#231;on suivante : 
</p>
<p>P1[GLOBAL] : mr[PROSO] -&gt;[soft, strict] AP[PROSO] 
</p>
<p>On retrouve dans cette contrainte les diff&#233;rentes informations stipul&#233;es pr&#233;c&#233;demment : il 
s&#8217;agit d&#8217;une contrainte globale, reliant les objets /mr/ et /AP/ (relevant du domaine 
prosodique) par une contrainte d&#8217;alignement faible (dans la mesure o&#249; elle n&#8217;est pas 
imp&#233;rative) et synchronis&#233;e strictement.  
La contrainte P2 stipule quant &#224; elle une relation non imp&#233;rative et synchronis&#233;e de fa&#231;on 
stricte indiquant une r&#233;alisation pr&#233;f&#233;rentielle de contour /mr/ avec des /NV/. On remarque au 
passage l&#8217;int&#233;r&#234;t potentiel de ce type de contrainte dans une perspective de d&#233;sambigu&#239;sation. 
</p>
<p> P2[GLOBAL] : NV[SYNT] -&gt;[soft, strict] mr[PROSO] 
</p>
<p>Le troisi&#232;me exemple de contrainte globale indique que les backchannels vocaux sont r&#233;alis&#233;s 
pr&#233;f&#233;rentiellement apr&#232;s des IPs. La contrainte P4, plus sp&#233;cifique, indique les contours 
prosodiques favorisant leur apparition. La contrainte P5, enfin, d&#233;crit la relation entre 
backchannel et tour final. Ces trois contraintes reposent sur une relation de pr&#233;c&#233;dence. Il 
s&#8217;agit l&#224; encore d&#8217;une contrainte non imp&#233;rative (soft) et pour laquelle la synchronisation 
peut &#234;tre l&#226;che (fuzzy). 
</p>
<p>P3[GLOBAL] : VocBC[DISC] &gt;[soft, fuzzy] IP[PROSO] 
P4[GLOBAL] : VocBC[DISC] &gt;[soft, fuzzy] {RF1, RF2, RT}[PROSO] 
P5[GLOBAL] : VocBC[DISC] &gt;[soft, fuzzy] TCU_f[DISC] 
</p>
<p>Prenons maintenant des exemples de contraintes locales, qui sont donc rattach&#233;es &#224; des 
constructions. Pour illustrer plus pr&#233;cis&#233;ment la repr&#233;sentation des constructions, l&#8217;exemple 
suivant d&#233;crit le cas de la dislocation6. 
</p>
<p>P6[DISLOC] : Const = {S1[SYNT], S2[SYNT], mr[PROSO]} 
P7[DISLOC] : S1[SYNT] &gt; S2[SYNT] 
P8[DISLOC] : S1[SYNT] =&gt; S2[SYNT] 
P9[DISLOC] : S1[SYNT] --&gt;&gt; S2[SYNT]//Clit 
P10[DISLOC] : S1[SYNT] -&gt;[soft, strict] mr[PROSO] 
</p>
<p>Cet ensemble de contraintes permet de d&#233;crire les informations de base d&#8217;un type simple de 
dislocation. Cette construction est form&#233;e de deux unit&#233;s syntaxiques S1 et S2, qui 
apparaissent dans cet ordre (contrainte P7) et qui sont obligatoirement cooccurrentes (P8). De 
plus, S1 est en relation anaphorique avec un clitique r&#233;alis&#233; dans S27. Cette description est 
compl&#233;t&#233;e par une contrainte d&#8217;alignement (P9) stipulant une r&#233;alisation de S1 
pr&#233;f&#233;rentiellement associ&#233;e &#224; un contour /mr/.  Dans le m&#234;me ordre d&#8217;id&#233;e, la construction 
&#233;num&#233;rative peut &#234;tre d&#233;crite comme la r&#233;p&#233;tition de plusieurs syntagmes de m&#234;me type, tous 
align&#233;s (P12) avec un contour sp&#233;cifique. 
                                                 
</p>
<p>6
 Les dislocations sont ces constructions d&#233;tachant un &#233;l&#233;ment (souvent un SN) &#224; gauche de la phrase 
</p>
<p>(quelquefois en fin) avec une possibilit&#233; de reprise anaphorique de cet &#233;l&#233;ment par un clitique dans la phrase. 
Exemple : &#171; Le chocolat, j&#8217;aime &#231;a &#187;.  
</p>
<p>7
 On utilise l&#8217;op&#233;rateur // (emprunt&#233; &#224; XPATH) pour indiquer un &#233;l&#233;ment situ&#233; &#224; un niveau quelconque &#224; 
</p>
<p>l&#8217;int&#233;rieur d&#8217;un autre. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des Grammaires Multimodales 
</p>
<p>P11[ENUM] : Const = {SX*[SYNT], ENUM[PROSO]} 
P12[ENUM] : SX[SYNT] -&gt;[soft, strict] ENUM[PROSO] 
</p>
<p>L&#8217;exemple suivant propose une contrainte isol&#233;e permettant la description d&#8217;une question 
form&#233;e d&#8217;une phrase sans marque interrogative particuli&#232;re (donc &#224; l&#8217;affirmatif) align&#233;e avec 
un contour montant sp&#233;cifique &#224; l&#8217;interrogation. Nous sommes ainsi en mesure de d&#233;crire une 
tournure particuli&#232;re dont l&#8217;interpr&#233;tation ne peut provenir que de la r&#233;alisation conjointe de 
ces deux &#233;l&#233;ments. Il s&#8217;agit d&#8217;une contrainte d&#8217;alignement imp&#233;rative,  l&#8217;absence de 
r&#233;alisation du contour /RQ/ emp&#234;chant en effet l&#8217;interpr&#233;tation interrogative 
</p>
<p>P13[QUEST] : P[SYNT] -&gt;[hard, strict] RQ[PROSO] 
</p>
<p>6 Discussion 
Les relations d&#8217;alignement entre les diff&#233;rents domaines sont d&#8217;une importance fondamentale. 
Elles permettent une description tr&#232;s pr&#233;cise du niveau de l&#8217;interaction, mais &#233;galement de 
son type. Elles permettent de plus de d&#233;crire des relations entre des types d&#8217;objets de 
granularit&#233; diff&#233;rentes pouvant &#234;tre g&#233;n&#233;raux (des constructions enti&#232;res) ou au contraire 
sp&#233;cifiques (des sous-cat&#233;gories, du type consonne occlusive sourde ou verbe &#224; l&#8217;infinitif). Il 
est ainsi possible de d&#233;crire des ph&#233;nom&#232;nes d&#8217;interaction ponctuels, ou &#224; l&#8217;inverse des 
relations entre des cat&#233;gories de plus haut niveau voire des m&#233;ta-cat&#233;gories. Par ailleurs, la 
distinction de niveau entre relations locales et globales offre une grande souplesse de 
description, rendant possible la repr&#233;sentation de relations tr&#232;s g&#233;n&#233;rales (&#233;ventuellement 
universelles), ou au contraire sp&#233;cifiques &#224; une construction.  
Une des difficult&#233;s dans la repr&#233;sentation de ces informations r&#233;side dans la grande variabilit&#233; 
des ph&#233;nom&#232;nes observ&#233;s, par exemple pour ce qui concerne la prosodie, allant jusqu&#8217;&#224; faire 
coexister des ph&#233;nom&#232;nes pouvant appara&#238;tre comme contradictoires. Nous avons propos&#233; 
ailleurs (cf. [Blache04]) une explication de la variabilit&#233; s&#8217;appuyant sur la quantit&#233; 
d&#8217;information v&#233;hicul&#233;e par chaque domaine linguistique. En tout &#233;tat de cause, il est 
n&#233;cessaire d&#8217;indiquer le poids de la relation pour repr&#233;senter son degr&#233; d&#8217;exigence : certaines 
relations sont imp&#233;ratives, d&#8217;autres le sont moins. De m&#234;me, le type de synchronisation 
(stricte ou l&#226;che) est sp&#233;cifique &#224; chaque relation. Il est donc n&#233;cessaire de proposer une 
repr&#233;sentation permettant de pr&#233;ciser des informations sp&#233;cifiques &#224; chaque contrainte. 
</p>
<p>Une approche totalement bas&#233;e sur les contraintes du type de celle propos&#233;e ici r&#233;pond &#224; ces 
besoins. Chaque relation d&#8217;alignement est repr&#233;sent&#233;e dans la grammaire par une contrainte 
sp&#233;cifique. De plus, respectant ainsi l&#8217;id&#233;e de base des GP, toutes ces contraintes peuvent &#234;tre 
&#233;valu&#233;es s&#233;par&#233;ment, sans avoir besoin au pr&#233;alable de construire une quelconque structure. 
Nous disposons ainsi d&#8217;un cadre formel nous permettant de nous affranchir d&#8217;une explication 
de l&#8217;interaction entre domaines linguistiques en termes de superposition de structures (par 
exemple insertion d&#8217;&#233;v&#233;nements prosodiques &#224; l&#8217;int&#233;rieur d&#8217;arbres syntaxiques), requ&#233;rant la 
construction pr&#233;alable des structures de chaque domaine avant d&#8217;en pouvoir d&#233;terminer les 
interactions. Ce type d&#8217;explication est la plupart du temps utilis&#233; dans la litt&#233;rature. Elle ne 
rend cependant pas compte de la r&#233;alit&#233; du ph&#233;nom&#232;ne, ou de fa&#231;on tr&#232;s limit&#233;e. En revanche, 
la possibilit&#233; de d&#233;crire dans la grammaire des relations pouvant &#234;tre g&#233;n&#233;rales ou sp&#233;cifiques, 
imp&#233;ratives ou permissives, permet de repr&#233;senter avec pr&#233;cision l&#8217;interaction. Nous sommes 
ainsi en mesure de proposer un cadre permettant le d&#233;veloppement de v&#233;ritables grammaires 
multimodales. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache 
</p>
<p>R&#233;f&#233;rences 
Bertrand R., Ferr&#233; G., Blache P., Espesser R. &amp; Rauzy S. (2007) &#171;Backchannels revisited from a 
</p>
<p>multimodal perspective&#187;, Proceedings of Auditory-visual Speech Processing Hilvarenbeek, The 
Netherlands. 
</p>
<p>Bertrand R. , P. Blache, R. Espesser, G. Ferr&#233;, C. Meunier, B. Priego-Valverde, S. Rauzy (2009) Le 
Cid - Corpus of Interactional Data - Annotation et Exploitation Multimodale de Parole 
Conversationnelle, in revue TAL 49:3 
</p>
<p>Bertrand R., Portes C. &amp; Sabio F. (2007) &#171;Distribution syntaxique, discursive et interactionnelle des 
contours intonatifs du fran&#231;ais dans un corpus de conversation&#187;, TRANEL, 47, 2007 
</p>
<p>Bird S., Day D., Garofolo J., Henderson J., Laprun C. &amp; Liberman M. (2000) &#171;ATLAS : A Flexible 
and Extensible Architecture for Linguistic Annotation&#187;, Proceedings of the Second International 
Conference on Language Resources and Evaluation 
</p>
<p>Blache P. (2001) Les Grammaires de Propri&#233;t&#233;s : Des contraintes pour le traitement automatique des 
langues naturelles, Herm&#232;s. 
</p>
<p>Blache P. A. Di Cristo (2002), &#171; Variabilit&#233; et d&#233;pendances des composants linguistiques &#187;, in Actes 
de TALN&#8217;02. 
</p>
<p>Blache P. &amp; Rauzy S. (2008) &#171;Influence de la qualit&#233; de l'&#233;tiquetage sur le chunking : une corr&#233;lation 
d&#233;pendant de la taille des chunks&#187;, Actes de TALN08 
</p>
<p>Carletta J. et al. (2005) &#171;The AMI Meetings Corpus&#187;, Proceedings of the Measuring Behavior 2005 
symposium on Annotating and measuring Meeting Behavior, 
</p>
<p>Carletta, J. (2006) Announcing the AMI Meeting Corpus. The ELRA Newsletter 11(1) 
de la Clergerie E., Ayache C., de Chalandar G., Francopoulo G., Gardent C. &amp; Paroubek P. (2008) 
</p>
<p>&#171;Large Scale Production of Syntactic Annotations for French&#187;, Proceedings of the International 
Workshop on Automated Syntactic Annotations for Interoperable Language Ressources. 
</p>
<p>Delais-Roussarie, E et B. Post (2008) &#171; Unit&#233;s prosodiques et grammaire de l'intonation : vers une 
nouvelle approche &#187;, in actes des XXVII&#232;me Journ&#233;es d'&#201;tudes sur la Parole 
</p>
<p>Doetjes J., E. Delais-Roussarie &amp; P. Sleeman (2002) &#8220;The Prosody of Left Detached Constituent in 
French&#8221;, in proceedings of Speech Prosody 2002. 
</p>
<p>Gendner V., Illouz G., Jardino M., Monceaux L., Paroubek P., Robba I. &amp; Vilnat A. (2003) &#171;PEAS, 
the first instantiation of a comparative framework for evaluating parsers of French&#187;, Research 
Notes of EACL 2003 
</p>
<p>Hirst D. &amp; Di Cristo A., Intonation Systems, Cambridge University Press, 1998. 
Jun S.-A. &amp; Fougeron C. (2002) &#171;Realizations of accentual phrase in French intonation&#187;, Probus 14 
Kipp M. (2006) Anvil 4.0. Annotation of Video and Spoken Language. 
</p>
<p>(http://www.dfki.de/~kipp/anvil) 
McNeill D. (2005) Gesture and Thought. University of Chicago Press 
MUMIN : A Nordic Network for MUltiModal Interfaces (http://www.cst.dk/mumin/) 
NITE : Natural Interactivity Tools Engineering (http://nite.nis.sdu.dk/) 
Paroubek P., Robba I., Vilnat A. &amp; Ayache C. (2006) &#171;Data Annotations and Measures in EASY the 
</p>
<p>Evaluation Campaign for Parsers in French&#187;, Proceedings of the 5th International Conference on 
Language Resources and Evaluation 
</p>
<p>Portes C., Bertrand R. &amp; Espesser R. (2007) &#171;Contribution to a grammar of intonation in French. 
Form and function of three rising patterns&#187;, Nouveaux Cahiers de Linguistique Fran&#231;aise, 28 
</p>
<p>Rauzy S. &amp; Blache P. (2007) &#171;Un lexique syntaxique des verbes du fran&#231;ais : VfrLPL&#187;, Rapport de 
recherche RAU-3055, Laboratoire Parole et Langage. 
</p>
<p>Selkirk E. (1984) Phonology and Syntax: the Relation between Sound and Structure, MIT Press. 
VERBMOBIL : Alexandersson J., Buschbeck-Wolf B., Fujinami T., Kipp M., Koch S., Maier E., 
</p>
<p>Reithinger N., Schmitz B. &amp; Siegel M. Dialogue Acts in VERBMOBIL-2 - Second Edition. Rapport 
interne, 1998, DFKI GmbH. </p>

</div></div>
</body></html>