<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La compl&#233;mentarit&#233; des approches manuelle et automatique en acquisition lexicale</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>La compl&#233;mentarit&#233; des approches manuelle et automatique
en acquisition lexicale
</p>
<p>C&#233;dric Messiant 1,Takuya Nakamura2, Stavroula Voyatzi2
</p>
<p>(1) Laboratoire d&#8217;Informatique de Paris-Nord
CNRS UMR 7030 et Universit&#233; Paris 13
</p>
<p>99, avenue Jean-Baptiste Cl&#233;ment, F-93430 Villetaneuse France
(2) Laboratoire d&#8217;Informatique Gaspard-Monge
</p>
<p>CNRS UMR 8049 IGM-LabInfo et Universit&#233; de Marne-la-Vall&#233;e
5 Bd Descartes, Champs-sur-Marne
</p>
<p>77454 Marne-la-Vall&#233;e Cedex 2
cedric.messiant@lipn.univ-paris13.fr, takuya.nakamura@univ-mlv.fr,
</p>
<p>voyatzi@univ-mlv.fr
</p>
<p>R&#233;sum&#233;. Les ressources lexicales sont essentielles pour obtenir des syst&#232;mes de traitement
des langues performants. Ces ressources peuvent &#234;tre soit construites &#224; la main, soit acquises
automatiquement &#224; partir de gros corpus. Dans cet article, nous montrons la compl&#233;menta-
rit&#233; de ces deux approches. Pour ce faire, nous utilisons l&#8217;exemple de la sous-cat&#233;gorisation
verbale en comparant un lexique acquis par des m&#233;thodes automatiques (LexSchem) avec un
lexique construit manuellement (Le Lexique-Grammaire). Nous montrons que les informations
acquises par ces deux m&#233;thodes sont bien distinctes et qu&#8217;elles peuvent s&#8217;enrichir mutuellement.
</p>
<p>Abstract. Lexical resources are essentially created to obtain efficient text-processing sys-
tems. These resources can be constructed either manually or automatically from large cor-
pora. In this paper, we show the complementarity of these two types of approaches, compa-
ring an automatically constructed lexicon (LexSchem) to a manually constructed one (Lexique-
Grammaire), on examples of verbal subcategorization. The results show that the information
retained by these two resources is in fact different and that they can be mutually enhanced.
</p>
<p>Mots-cl&#233;s : verbe, syntaxe, lexique, sous-cat&#233;gorisation.
</p>
<p>Keywords: verb, syntax, lexicon, subcategorization.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Messiant, Takuya Nakamura, Stavroula Voyatzi
</p>
<p>1 Introduction
</p>
<p>Les applications de traitement automatique des langues (TAL) ont de plus en plus besoin d&#8217;in-
formations lexicales. La disponibilit&#233; de telles ressources et leur utilisabilit&#233; dans les applica-
tions de TAL restent pourtant relatives.
</p>
<p>Deux approches sont possibles pour la constitution de telles ressources : la construction de
lexiques &#8220;&#224; la main&#8221; et l&#8217;acquisition automatique de ressources &#224; partir de corpus. Le plus
souvent, ces deux approches sont oppos&#233;es et il existe &#224; l&#8217;heure actuelle peu de collaborations
pour &#233;tudier les diff&#233;rences dans les informations obtenues et ce que les approches pourraient
apporter l&#8217;une &#224; l&#8217;autre. L&#8217;objectif de ce travail est de confronter les approches automatiques aux
besoins des linguistes. Pour ce faire, nous utilisons l&#8217;exemple de la sous-cat&#233;gorisation verbale
en comparant un lexique acquis par des m&#233;thodes automatiques (LexSchem (Messiant et al.,
2008)) avec un lexique construit manuellement (Le Lexique-Grammaire (Gross, 1975)). Nous
avons observ&#233; leurs diff&#233;rences et leurs similitudes pour 20 verbes vari&#233;s du fran&#231;ais.
</p>
<p>Apr&#232;s avoir dress&#233; un bref &#233;tat de l&#8217;art des lexiques et des m&#233;thodes d&#8217;acquisition existantes,
nous pr&#233;sentons les deux ressources qui ont &#233;t&#233; choisies pour cette &#233;tude. La section 4 montre
que ces deux approches sont compl&#233;mentaires. La conclusion donne des perspectives pour l&#8217;uti-
lisation conjointe de ces approches.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>La constitution de ressources lexicales a &#233;t&#233; dans un premier temps manuelle mais des m&#233;thodes
d&#8217;acquisition automatique ont &#233;t&#233; par la suite explor&#233;es.
</p>
<p>2.1 Les lexiques existants pour le fran&#231;ais
</p>
<p>Plusieurs ressources lexicales syntaxiques pour le fran&#231;ais ont &#233;t&#233; d&#233;velopp&#233;es depuis de nom-
breuses ann&#233;es. Les objectifs de ces lexiques sont de d&#233;finir, pour chaque lemme verbal donn&#233;,
ses diff&#233;rents emplois et, pour chacun de ces emplois, son (ou ses) cadre(s) de sous-cat&#233;gorisation
sp&#233;cifiant le nombre et le type de ses arguments, et les informations compl&#233;mentaires qui s&#8217;y
rapportent.
</p>
<p>Le dictionnaire syntaxique des verbes fran&#231;ais cr&#233;&#233; par Jean Dubois et Fran&#231;oise Dubois-
Charlier (Dubois &amp; Dubois-Charlier, 1997), mis &#224; la disposition du grand public sur le site
internet du laboratoire MoDyCo, est une classification s&#233;mantico-syntaxique des verbes ma-
nuellement construite par ces deux linguistes, dont les principes sont proches de ceux du LG.
On compte dans ce dictionnaire 12 130 verbes et 25 610 entr&#233;es (chaque entr&#233;e correspond &#224; un
couple verbe - sch&#233;ma de sous-cat&#233;gorisation).
</p>
<p>DicoValence (van den Eynde &amp; Mertens, 2006), successeur du lexique PROTON, est un diction-
naire syntaxique manuellement construit dans le cadre m&#233;thodologique de l&#8217;Approche Prono-
minale (van den Eynde &amp; Blanche-Benveniste, 1978). Pour identifier la valence d&#8217;un pr&#233;dicat,
i.e. ses d&#233;pendants et leurs caract&#233;ristiques, l&#8217;Approche Pronominale exploite la relation qui
existe entre les d&#233;pendants dits lexicalis&#233;s (r&#233;alis&#233;s sous forme de syntagmes) et les pronoms
qui couvrent &#171; en intention &#187; ces lexicalisations possibles. DicoValence comporte les cadres</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La compl&#233;mentarit&#233; des approches manuelle et automatique en acquisition lexicale
</p>
<p>de valence de 3 738 verbes, r&#233;partis en 8 313 entr&#233;es. Nous pouvons &#233;galement mentionner
d&#8217;autres ressources comme LexValf (Salkoff &amp; Valli, 2005) dont les principes de base sont
ceux de grammaire en cha&#238;ne, DiCo-LAF (Mel&#180;cuk &amp; Polgu&#232;re, 2006), centr&#233; sur la mod&#233;lisa-
tion formelle des collocations et de la d&#233;rivation s&#233;mantique du fran&#231;ais, DicoLPL (Vanrullen
et al., 2005) ou encore le Tr&#233;sor de la Langue Fran&#231;aise informatis&#233; (TLFI) (Dendien &amp;
Pierrel, 2003).
</p>
<p>Des ressources lexicales ont &#233;galement &#233;t&#233; acquises semi-automatiquement. C&#8217;est le cas notam-
ment de TreeLex (Kups&#769;c&#769;, 2007), acquis automatiquement &#224; partir du corpus arbor&#233; de Paris 7
(Abeill&#233; et al., 2003) ou du Lefff 2 (lexique des formes fl&#233;chies du fran&#231;ais) (Sagot et al., 2006).
SynLex (Gardent et al., 2006) est un lexique de sous-cat&#233;gorisation verbale du fran&#231;ais, cr&#233;&#233; &#224;
partir des tables du LexiqueGrammaire, et compl&#233;t&#233; manuellement.
</p>
<p>2.2 Les m&#233;thodes d&#8217;acquisition automatique de ressources
</p>
<p>Depuis le d&#233;but des ann&#233;es 90, des chercheurs en traitement automatique des langues ont ex-
plor&#233; des m&#233;thodes d&#8217;acquisition d&#8217;informations lexicales &#224; partir de corpus et en particulier de
lexiques de sch&#233;mas de sous-cat&#233;gorisation (Brent, 1993; Manning, 1993; Briscoe &amp; Carroll,
1997).
</p>
<p>Dans un premier temps, ces m&#233;thodes ne permettaient d&#8217;acqu&#233;rir qu&#8217;un nombre r&#233;duit de sch&#233;-
mas contenant peu d&#8217;informations sur les arguments. La disponibilit&#233; de corpus de taille cons&#233;-
quente et les performances des analyseurs syntaxiques ont permis &#224; ces m&#233;thodes de devenir
de plus en plus efficaces et d&#8217;obtenir des informations plus d&#233;taill&#233;es sur les arguments (Preiss
et al., 2007). En effet, la plupart de ces m&#233;thodes consistent &#224; acqu&#233;rir des sch&#233;mas de sous-
cat&#233;gorisation &#224; partir des sorties d&#8217;un analyseur syntaxique et d&#8217;en filtrer les erreurs par des
m&#233;thodes statistiques. La principale difficult&#233; provient alors des erreurs effectu&#233;es par l&#8217;analy-
seur syntaxique et de la mise en place du filtrage ad&#233;quat.
</p>
<p>Dans un premier temps, ces m&#233;thodes ne permettaient d&#8217;acqu&#233;rir qu&#8217;un nombre r&#233;duit de sch&#233;-
mas contenant peu d&#8217;informations sur les arguments. La disponibilit&#233; de corpus de taille cons&#233;-
quente et les performances des analyseurs syntaxiques ont permis &#224; ces m&#233;thodes de devenir de
plus en plus efficaces et d&#8217;obtenir des informations plus d&#233;taill&#233;es sur les arguments (Korho-
nen et al., 2000; Preiss et al., 2007). En effet, la plupart de ces m&#233;thodes consistent &#224; acqu&#233;rir
des sch&#233;mas de sous-cat&#233;gorisation &#224; partir des sorties d&#8217;un analyseur syntaxique et d&#8217;en fil-
trer les erreurs par des m&#233;thodes statistiques. La principale difficult&#233; provient alors des erreurs
effectu&#233;es par l&#8217;analyseur syntaxique et de la mise en place du filtrage ad&#233;quat.
</p>
<p>Si la plupart des travaux ont d&#8217;abord port&#233; sur l&#8217;anglais, ces m&#233;thodes ont &#233;galement &#233;t&#233; utilis&#233;es
pour acqu&#233;rir des informations lexicales pour d&#8217;autres langues, comme l&#8217;allemand (Schulte im
Walde, 2002) ou l&#8217;italien (Dino Ienco &amp; Bosco, 2008). Jusqu&#8217;en 2006, il y avait peu d&#8217;&#233;tudes de
ce type pour le fran&#231;ais. Le premier travail publi&#233; est celui de Paula Chesley et Suzanne Salmon-
Alt (Chesley &amp; Salmon-Alt, 2006). Cependant, cette &#233;tude ne concernait qu&#8217;une centaine de
verbes et n&#8217;a, &#224; notre connnaissance, pas &#233;t&#233; poursuivie.
</p>
<p>Les ressources acquises &#224; partir de corpus ne sont pas aussi compl&#232;tes et pr&#233;cises que les res-
sources construites &#224; la main mais elles apportent des informations qui ne sont souvent pas
disponibles dans les travaux manuels comme par exemple la fr&#233;quence des sch&#233;mas de sous-
cat&#233;gorisation en corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Messiant, Takuya Nakamura, Stavroula Voyatzi
</p>
<p>3 Une exp&#233;rience &#224; partir du Lexique-Grammaire et de Lex-
Schem
</p>
<p>Afin d&#8217;explorer la compl&#233;mentarit&#233; de l&#8217;approche manuelle et de l&#8217;approche automatique, nous
avons travaill&#233; sur deux ressources : le Lexique-Grammaire et LexSchem.
</p>
<p>3.1 Le Lexique-Grammaire
</p>
<p>Le lexique syntaxique du Lexique-Grammaire 1 (LG) est un dictionnaire syntaxique constitu&#233;
d&#8217;un ensemble de tables (matrices binaires). Chaque table regroupe les &#233;l&#233;ments pr&#233;dicatifs
(verbes, adjectifs, noms), qui partagent tous la propi&#233;t&#233; de base d&#8217;entrer dans une structure de
phrase simple d&#233;finitoire de la table (construction type). Une phrase simple est d&#233;finie par le
nombre et la nature morpho-syntactique et s&#233;mantique des arguments. Chaque table comprend
&#233;galement un ensemble de propri&#233;t&#233;s distributionnelles, transformationnelles et s&#233;mantiques,
que v&#233;rifient (+), ou non (-), les &#233;l&#233;ments pr&#233;dicatifs qui figurent en en-t&#234;tes des lignes.
</p>
<p>A peu pr&#232;s 6 000 verbes simples graphiquement diff&#233;rents ont &#233;t&#233; examin&#233;s pour le fran&#231;ais et
donnent lieu &#224; environ 11 000 emplois verbaux simples (ou entr&#233;es), dont :
&#8211; 3 000 emplois verbaux simples &#224; constructions compl&#233;tives r&#233;partis dans 18 tables,
&#8211; 8 000 emplois verbaux simples &#224; constructions non compl&#233;tives r&#233;partis dans 43 tables.
Une s&#233;lection des tables du LG du fran&#231;ais (60%) est mise &#224; disposition du grand public 2 sous
la licence LGPL-LR : en ce qui concerne les verbes simples, on peut compter plus de 7 000
entr&#233;es qui proviennent de 35 tables diff&#233;rentes.
</p>
<p>3.2 LexSchem
</p>
<p>Nous avons mis au point une m&#233;thode d&#8217;acquisition automatique de sch&#233;mas de sous-cat&#233;gorisation
&#224; partir de corpus pour le fran&#231;ais (Messiant, 2008). Notre syst&#232;me d&#8217;acquisition, appel&#233; ASSCI,
prend en entr&#233;e un corpus analys&#233; par l&#8217;analyseur syntaxique Syntex (Bourigault et al., 2005)
et produit un lexique de sous-cat&#233;gorisation de verbes.
</p>
<p>Une premi&#232;re exp&#233;rience, men&#233;e sur le corpus LM10 (10 ans du journal Le Monde) a per-
mis d&#8217;acqu&#233;rir LexSchem, un lexique de sch&#233;mas de sous-cat&#233;gorisation de verbes fran&#231;ais
(Messiant et al., 2008). Le lexique est compos&#233; de plus de 11000 entr&#233;es qui correspondent &#224;
des couples verbe - sch&#233;ma. LexSchem concerne plus de 3200 verbes fran&#231;ais et pr&#232;s de 300
sch&#233;mas de sous-cat&#233;gorisation diff&#233;rents. Le lexique est t&#233;l&#233;chargeable librement et une inter-
face web permet de le consulter facilement3. Pour chacune des entr&#233;es, le lexique fournit son
nombre d&#8217;occurences en corpus, sa fr&#233;quence relative (fr&#233;quence d&#8217;apparition dans le corpus
d&#8217;un sch&#233;ma de sous-cat&#233;gorisation pour un verbe) ainsi que 5 exemples tir&#233;s du corpus. Nous
avons compar&#233; les entr&#233;es de ce lexique pour 25 verbes fran&#231;ais choisis pour leur h&#233;t&#233;rog&#233;n&#233;it&#233;
</p>
<p>1Le lexique-grammaire est une th&#233;orie et une pratique de la description exhaustive des langues, inspir&#233;e de
la th&#233;orie distributionnelle et transformationnelle de Zellig S. Harris. La description du fran&#231;ais a d&#8217;abord &#233;t&#233;
d&#233;velopp&#233;e au LADL par une &#233;quipe de linguistes et d&#8217;informaticiens dirig&#233;e par Maurice Gross depuis la fin
des ann&#233;es 1960, et continue d&#8217;&#234;tre maintenue et enrichie par une &#233;quipe informatique-linguistique de l&#8217;Institut
Gaspard-Monge de l&#8217;Universit&#233; Paris-Est Marne-la-Vall&#233;e.
</p>
<p>2http://infolingu.univ-mlv.fr
3http://www-lipn.univ-paris13.fr/~messiant/lexschem.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La compl&#233;mentarit&#233; des approches manuelle et automatique en acquisition lexicale
</p>
<p>avec une ressource r&#233;f&#233;rence construite &#224; partir du TLFI 4. Nous avons choisi le TLFI car il est
librement disponible et que son format permettait de rapidement produire une r&#233;f&#233;rence pour un
nombre limit&#233; de verbes 5. Cette &#233;valuation a donn&#233; une pr&#233;cision de 0.83, un rappel de 0.59 et
une F-mesure de 0.69. Ces r&#233;sultats correspondent &#224; ceux de l&#8217;&#233;tat de l&#8217;art pour des exp&#233;riences
comparables (par exemple, (Preiss et al., 2007) malgr&#233; les diff&#233;rences li&#233;es &#224; la langue ). N&#233;an-
moins, de tels r&#233;sultats posent la question de l&#8217;utilisabilit&#233; d&#8217;une ressource avec environ 30%
d&#8217;erreurs. Les erreurs observ&#233;es dans LexSchem proviennent de sources vari&#233;es : pr&#233;sence de
modifieurs dans le sch&#233;ma, erreurs d&#8217;analyse syntaxique, etc... Certaines de ces erreurs seront
d&#233;taill&#233;es dans la section 4.1.
</p>
<p>4 Limites et compl&#233;mentarit&#233; des deux approches
</p>
<p>Nous avons compar&#233; les entr&#233;es de LexSchem6 avec celles du LG pour 15 verbes s&#233;par&#233;s en
3 groupes selon leur productivit&#233; dans LM10 : haute, moyenne et basse fr&#233;quence. Nous avons
ensuite choisi 5 verbes pour chacun de ces groupes : savoir, demander, appeler, tourner et tra-
vailler pour les verbes &#224; haute fr&#233;quence ; d&#233;cerner, fasciner, appuyer, r&#233;mun&#233;rer et valider
pour les verbes &#224; fr&#233;quence moyenne ; contrecarrer, fluctuer, approvisionner, ins&#233;rer et cerner
pour les verbes &#224; basse fr&#233;quence. Nous avons &#233;galement ajout&#233; &#224; cette liste cinq verbes sus-
ceptibles d&#8217;&#234;tre utilis&#233;s dans le domaine &#233;conomique et boursier (augmenter, baisser, chuter,
cl&#244;turer et fluctuer).
</p>
<p>Cette comparaison nous a permis de mettre en &#233;vidence les limites des deux approches. Elle
nous a aussi montr&#233; pourquoi ces approches sont compl&#233;mentaires et comment elles peuvent
s&#8217;enrichir mutuellement.
</p>
<p>4.1 Les limites de l&#8217;acquisition &#224; partir de corpus et de LexSchem
</p>
<p>Malgr&#233; les progr&#232;s r&#233;cents, l&#8217;acquisition de ressources lexicales &#224; partir de corpus produit un
grand nombre d&#8217;erreurs (voir section 3.2). La confrontation des lexiques extraits par ces m&#233;-
thodes &#224; des ressources construites manuellement permet de mettre en &#233;vidence les sources des
erreurs et les lacunes de l&#8217;approche automatique.
</p>
<p>De nombreuses erreurs d&#8217;&#233;tiquetage morpho-syntaxique ou d&#8217;analyse syntaxique sont r&#233;percu-
t&#233;es dans le lexique. Pour ce qui concerne les erreurs d&#8217;&#233;tiquetage, il s&#8217;agit dans la plupart des
cas de noms &#233;tiquet&#233;s verbe. Par exemple, dans le groupe nominal le programme d&#8217;armement,
le mot programme est &#233;tiquet&#233; verbe et ASSCI produit alors le sch&#233;ma de sous-cat&#233;gorisation
SUJ:SN_P-OBJ:SP[de+SN]. Autre exemple, le CERNA (Centre d&#8217;&#233;conomie industrielle et
de finance de MINES ParisTech) appara&#238;t dans les exemples pour le verbe cerner. Notons que
ces exemples sont suffisamment fr&#233;quents pour produire des sch&#233;mas de sous-cat&#233;gorisation
incorrects.
</p>
<p>4http://atilf.atilf.fr/tlf.htm
5Une &#233;tude sur 25 verbes n&#8217;est pas suffisante. C&#8217;est pourquoi nous travaillons actuellement &#224; l&#8217;&#233;valuation de
</p>
<p>LexSchem sur environ 1500 verbes fran&#231;ais en utilisant TreeLex comme ressource r&#233;f&#233;rence.
6La version de LexSchem utilis&#233;e pour les exp&#233;riences de cette section n&#8217;est pas celle qui est t&#233;l&#233;chargeable et
</p>
<p>consultable &#224; l&#8217;adresse donn&#233;e &#224; la section 3.2. Les am&#233;liorations de cette nouvelle version comprennent notam-
ment l&#8217;int&#233;gration des fonctions syntaxiques aux sch&#233;mas de sous-cat&#233;gorisation et le traitement de cas jusqu&#8217;alors
mal trait&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Messiant, Takuya Nakamura, Stavroula Voyatzi
</p>
<p>Par ailleurs, de nombreuses erreurs proviennent de l&#8217;analyse syntaxique. Par exemple, les pro-
nominalisations sont souvent mal trait&#233;es par l&#8217;analyseur comme dans Leurs obsessions nous
cernent qui produit le sch&#233;ma SUJ:SN (c&#8217;est-&#224;-dire une construction de type intransitive). Il
existe plus g&#233;n&#233;ralement de nombreux compl&#233;ments d&#8217;objets non rattach&#233;s, notamment quand
des incises brouillent l&#8217;analyse. Ce probl&#232;me est tr&#232;s fr&#233;quent et on pourrait imaginer un trai-
tement a posteriori pour tenter de rattacher ces compl&#233;ments au verbe. Cependant, un tel post-
traitement poserait alors la question de la &#8220;g&#233;n&#233;ricit&#233;&#8221; de la m&#233;thode et de son ind&#233;pendance
par rapport &#224; l&#8217;analyseur syntaxique utilis&#233;.
</p>
<p>Certains ph&#233;nom&#232;nes linguistiques sont assez difficiles &#224; prendre en compte par un syst&#232;me
d&#8217;acquisition qui se fonde sur des indices de surface. C&#8217;est le cas notamment des adverbes (qui
sont souvent des modifieurs mais qui sont susceptibles d&#8217;&#234;tre inclus dans la structure argumen-
tale comme dans Le couteau coupe bien) ou les propositions interrogatives indirectes. En effet,
comment diff&#233;rencier Il se demande qui est pass&#233; en premier. de Le pr&#233;sident nomme qui est le
plus m&#233;ritant. de mani&#232;re automatique ?
</p>
<p>La prise en compte de ces ph&#233;nom&#232;nes par un syst&#232;me d&#8217;acquisition automatique est possible
mais n&#233;cessiterait d&#8217;introduire la notion de classe s&#233;mantique sur le verbe (verbe de type interro-
gation) pour acqu&#233;rir les bonnes informations. Cet exemple montre bien les limites de l&#8217;acquisi-
tion automatique : lorsqu&#8217;on conna&#238;t les verbes concern&#233;s par un ph&#233;nom&#232;ne pr&#233;cis, n&#8217;est-il pas
pr&#233;f&#233;rable de corriger la ressource a posteriori plut&#244;t que d&#8217;ajouter des informations a priori ?
</p>
<p>Certains sch&#233;mas de sous-cat&#233;gorisation sont valides mais n&#233;cessiteraient d&#8217;&#234;tre accompagn&#233;s
d&#8217;informations sur les restrictions de s&#233;lection. Par exemple, le verbe tourner accepte un em-
ploi absolu (sans compl&#233;ment) comme dans Le vent tourne ou Le lait tourne mais cet emploi
impose des restrictions quant &#224; la s&#233;mantique du nom en position sujet. M&#234;me si les principales
t&#234;tes nominales apparaissant dans les diff&#233;rentes positions argumentales sont conserv&#233;es par
ASSCI, aucun calcul n&#8217;est effectu&#233; &#224; l&#8217;heure actuelle pour rep&#233;rer les restrictions de s&#233;lection
(on envisage de donner une approximation de ce degr&#233; de figement &#224; partir des informations
enregistr&#233;es par le syst&#232;me). Dans le LG, chacune de ces expressions est consid&#233;r&#233;e comme
fig&#233;e et est r&#233;pertori&#233;e dans une table qui lui est propre (voir section 4.2).
</p>
<p>Les informations disponibles dans un lexique acquis &#224; partir de corpus ne sont pas aussi riches
que celles qu&#8217;on trouve dans une ressource comme le LG. En particulier, LexSchem ne four-
nit aucune information sur la s&#233;mantique des arguments du verbe dans les sch&#233;mas de sous-
cat&#233;gorisation. Par exemple, dans le LG, le verbe savoir a un sch&#233;ma N0hum V Vinf (le
sujet du verbe doit dans ce cas avoir le trait &#8220;humain&#8221;). Ce type d&#8217;information est totalement
absent d&#8217;un lexique acquis automatiquement comme LexSchem et il semble pour l&#8217;instant dif-
ficile de l&#8217;ajouter sans intervention humaine. Toutefois, ce type d&#8217;information n&#8217;est pas sans
poser de probl&#232;me dans le cas de m&#233;tonymies ou de m&#233;taphores.
</p>
<p>4.2 Les limites des approches manuelles et du Lexique-Grammaire
</p>
<p>La cr&#233;ation des donn&#233;es syntaxiques du LG est enti&#232;rement manuelle. Ind&#233;pendamment de la
question de co&#251;ts humains et temporels, cette m&#233;thode rec&#232;le quelques probl&#232;mes. Nous en
discutons quelques uns :
</p>
<p>&#8211; Il est relativement difficile de maintenir la coh&#233;rence de classification : par souci d&#8217;exhaus-
tivit&#233;, la strat&#233;gie de classification &#233;tait de conserver, plut&#244;t que d&#8217;exclure. Ainsi, un m&#234;me
verbe risque de se retrouver dans deux classes diff&#233;rentes. Par exemple, le verbe savoir qui</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La compl&#233;mentarit&#233; des approches manuelle et automatique en acquisition lexicale
</p>
<p>s&#233;lectionne une compl&#233;tive directe poss&#232;de deux emplois : l&#8217;un class&#233; dans la construction
N0hum V Que P = : Luc sait que L&#233;a est &#224; Paris, et l&#8217;autre class&#233; dans la table 10, entrant
dans la construction N0hum V par N2hum Que P = : Luc a su par Max que L&#233;a est &#224;
Paris. S&#8217;agit-il vraiment d&#8217;homonymie ? Nous ne pouvons pas entrer dans le d&#233;tail mais en
tout cas, pour l&#8217;acquisition automatique de valence, les deux emplois sont regroup&#233;s sous un
seul.
</p>
<p>&#8211; La distinction en plusieurs emplois doit &#234;tre minutieusement contr&#244;l&#233;e, sinon elle cr&#233;era des
homonymes &#224; profusion. Les crit&#232;res essentiels sont, par d&#233;finition, formels, de telle sorte
que l&#8217;ensemble de propri&#233;t&#233;s v&#233;rifi&#233;es par un verbe donn&#233; doit &#234;tre clairement distinct de
celui de son (ou ses) homonyme(s), si le verbe poss&#232;de plusieurs emplois. Ce crit&#232;re peut
&#234;tre difficile &#224; respecter s&#8217;il s&#8217;agit d&#8217;un simple verbe bi-valent, par exemple. Ainsi, pour le
verbe tr&#232;s courant comme travailler, le LG dispose de 15 emplois diff&#233;rents dont quatre
appartiennent &#224; la classe appel&#233;e 32R3 (classe de constructions transitives r&#233;siduelles). Les
quatre emplois du verbe travailler class&#233;s dans 32R3 sont tous distingu&#233;s par diff&#233;rents objets
directs lexicaux :
</p>
<p>(1) Max travaille la balle
(2) Max travaille son texte
(3) Max travaille cette discipline
(4) Max travaille l&#8217;opinion publique
</p>
<p>Le sens du verbe travailler est certes diff&#233;rent dans chaque cas, mais les crit&#232;res syntaxiques
qui les diff&#233;rencient sont minces. Ce sont des exemples &#224; la fronti&#232;re des expressions libres-
expressions fig&#233;es. &#193; propos de ce verbe, LexSchem donne simplement deux sous-cat&#233;gorisations
possibles : SUJ:SN_OBJ:SN et SUJ:SN. Il manque totalement d&#8217;exemple transitif simple.
Cela &#233;tant, on peut se poser la question l&#233;gitime de savoir si cette &quot;finesse&quot; de distinction en
plusieurs emplois d&#8217;une construction transitive est n&#233;cessaire pour les besoins du TAL ?
</p>
<p>&#8211; Par ailleurs, les classes dites &quot;r&#233;siduelles&quot;, marqu&#233;es par R comme 32R3, ont tendance &#224;
regrouper tous les exemples qui n&#8217;ob&#233;issent pas strictement &#224; des crit&#232;res de classification.
Elles servent un peu de &quot;fourre-tout&quot; du LG. G&#233;n&#233;ralement les exemples accumul&#233;s dans
cette classe attendent d&#8217;&#234;tre reclass&#233;s dans d&#8217;autres classes. Seule l&#8217;am&#233;lioration continue du
LG all&#233;gera ce probl&#232;me.
</p>
<p>4.3 La compl&#233;mentarit&#233; des m&#233;thodes
</p>
<p>Le plus souvent, les ressources construites &#224; la main ne comprennent aucune information sur
la fr&#233;quence des sch&#233;mas de sous-cat&#233;gorisation. Il est possible d&#8217;utiliser des m&#233;thodes d&#8217;ac-
quisition automatique pour acqu&#233;rir ces informations statistiques sur la langue et inclure ces
informations dans des ressources manuelles.
</p>
<p>Lors de la comparaison de LexSchem et du LG, nous avons remarqu&#233; que les sch&#233;mas de
sous-cat&#233;gorisation recens&#233;s dans les deux ressources ne sont pas toujours les m&#234;mes. Dans la
plupart des cas, ces sch&#233;mas sont pr&#233;sents dans le LG et absents de LexSchem. Par exemple,
dans LexSchem, le verbe valider est assorti de trois sch&#233;mas de sous-cat&#233;gorisation, dont deux
correspondent aux constructions respectivement du passif SUJ:SN_P-OBJ:SP[par+SN],
et du participe pass&#233; support&#233; par le verbe &#234;tre SUJ:SN. LexSchem, ne pouvant pas diff&#233;ren-
cier de mani&#232;re automatique ce type de variantes transformationnelles des variantes formelles
significatives pour la valence verbale, il produit syst&#233;matiquement ces deux cadres de sous-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Messiant, Takuya Nakamura, Stavroula Voyatzi
</p>
<p>cat&#233;gorisation pour tous les verbes v&#233;rifiant ces constructions dans le corpus. En revanche, dans
le LG, le verbe valider est repr&#233;sent&#233; dans deux classes diff&#233;rentes qui sont d&#233;finies par les
constructions type :
</p>
<p>&#8211; Table 6 N0 V N1, avec N1 = : Qu P + si P + N
= : L&#8217;entreprise va valider (que vos comp&#233;tences sont adapt&#233;es &#224; son projet + si vos comp&#233;-
tences sont adapt&#233;es &#224; son projet + vos comp&#233;tences)
</p>
<p>&#8211; Table 32RA N0 V N1 (E + de N2), avec V = : rendre (E + plus) adjectif
= : Le tuteur a valid&#233; le certificat de stage d&#8217;un tampon
</p>
<p>N&#233;anmoins, il arrive &#233;galement qu&#8217;on d&#233;tecte un sch&#233;ma de sous-cat&#233;gorisation valide (se-
lon les exemples extraits du corpus) dans LexSchem mais absent du LG. Par exemple, dans
LexSchem, le verbe tourner produit quatre sch&#233;mas de sous-cat&#233;gorisation, dont le sch&#233;ma
SUJ:SN_P-OBJ:SP[autour de+SN] = : Le d&#233;ficit public tournera autour des 2% du
PIB. (le verbe tourner a ici le sens de se d&#233;rouler, &#233;voluer). Mais, cette construction est absente
du LG. L&#8217;utilisation conjointe des deux approches permettrait donc d&#8217;obtenir un lexique plus
complet.
</p>
<p>Des &#233;tudes pour l&#8217;anglais ont montr&#233; que les sch&#233;mas de sous-cat&#233;gorisation d&#8217;un verbe pou-
vaient varier lorsque ce verbe est employ&#233; dans une langue de sp&#233;cialit&#233; (Wattarujeekrit et al.,
2004). En observant le verbe fluctuer, nous avons remarqu&#233; que certains sch&#233;mas de sous-
cat&#233;gorisation &#233;taient pr&#233;sents dans LexSchem mais pas dans le LG. Ce sch&#233;ma est absent du
LG en raison de sa nature sp&#233;cifique au domaine boursier. Une exp&#233;rience sur cinq verbes uti-
lis&#233;s le plus souvent dans un cadre &#233;conomique ou boursier dans le corpus LM10 (augmenter,
baisser, chuter, cl&#244;turer et fluctuer) nous a permis de v&#233;rifier cette hypoth&#232;se. &#201;tant donn&#233; la
nature et l&#8217;objectif de cette t&#226;che, nous avons modifi&#233; les param&#232;tres d&#8217;ASSCI afin qu&#8217;il soit
plus &#8220;permissif&#8221; et qu&#8217;il fournisse un plus grand nombre de sch&#233;mas de sous-cat&#233;gorisation
pour ces verbes. Ainsi, nous avons pu observer dans quelles proportions l&#8217;&#233;tude &#224; partir de cor-
pus diff&#232;re de la construction manuelle de ressources dans le cadre d&#8217;un domaine pr&#233;cis de la
langue.
</p>
<p>Les verbes &#233;conomiques examin&#233;s ont ceci de particulier qu&#8217;ils expriment &#224; peu pr&#232;s tous la
variation en quantit&#233; ou en nombre. Les compl&#233;ments pr&#233;positionnels qui les accompagnent ne
sont pas des compl&#233;ments essentiels au sens strict du terme : pratiquement tous sont des adver-
biaux. Ils &#233;chappent, par cons&#233;quent, &#224; la grille de compl&#233;ments essentiels qui d&#233;finit une struc-
ture de phrase du LG. Par cons&#233;quent, la m&#233;thode statistique qui puisse les d&#233;tecter est com-
pl&#233;mentaire de la m&#233;thode manuelle, du point de vue de leur d&#233;tection. Il n&#8217;en reste pas moins
qu&#8217;il est difficile de les valider d&#8217;embl&#233;e comme compl&#233;ments sous-cat&#233;goris&#233;s pour plusieurs
raisons. Ils r&#233;alisent souvent des arguments s&#233;mantiques et la correspondance entre forme et no-
tion s&#233;mantique n&#8217;est pas bi-univoque : &#224; un argument peut correspondre plusieurs formes. On
peut &#233;num&#233;rer, &#224; propos des verbes examin&#233;s, des arguments s&#233;mantiques comme &#8220;mesure rela-
tive&#8221;, &#8220;mesure absolue&#8221;, etc. Par exemple, un verbe fonci&#232;rement intransitif comme augmenter
est souvent accompagn&#233; d&#8217;un compl&#233;ment de mesure relative adverbiale, mais ce dernier peut
prendre plusieurs formes, &#224; part la r&#233;alisation canonique sous forme de de DetNum\% :
</p>
<p>(1) La valeur X a augment&#233; de 5%.
</p>
<p>(2) La valeur X augmente &#224; un rythme annuel de 4%.
</p>
<p>de 5% et &#224; un rythme annuel de 4% sont, plus ou moins, des variantes formelles de l&#8217;argument</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La compl&#233;mentarit&#233; des approches manuelle et automatique en acquisition lexicale
</p>
<p>de mesure relative, la diff&#233;rence de formes n&#8217;est pas fonci&#232;rement significative du point de
vue de la valence du verbe augmenter. Pour le LexSchem, ils sont deux sous-cat&#233;gorisations
diff&#233;rentes, cependant. L&#8217;intervention manuelle pour regrouper ce genre de variantes formelles
semble n&#233;cessaire.
</p>
<p>Cette &#233;tude devra &#234;tre approfondie, notamment par l&#8217;acquisition de sch&#233;mas de sous-cat&#233;gorisation
&#224; partir d&#8217;un corpus de sp&#233;cialit&#233; comme le droit ou la m&#233;decine. Cette ressource pourra fournir
une base de travail &#224; des linguistes qui pourront la valider, l&#8217;enrichir et l&#8217;affiner.
</p>
<p>5 Conclusion
</p>
<p>Nous avons montr&#233; que la construction manuelle de ressources lexicales et l&#8217;acquisition au-
tomatique de ressources sont deux approches compl&#233;mentaires. Plut&#244;t que d&#8217;opposer ces ap-
proches, il peut &#234;tre b&#233;n&#233;fique de travailler &#224; un rapprochement des approches. Les ressources
manuelles peuvent servir &#224; valider les lexiques acquis automatiquement et &#224; leur apporter des
informations qu&#8217;il est difficile d&#8217;acqu&#233;rir &#224; partir de corpus (par exemple, le r&#244;le s&#233;mantique des
arguments, ...). Les ressources acquises &#224; partir de corpus peuvent constituer une base de travail
pour la constitution de ressources pour un domaine de sp&#233;cialit&#233; ou pour enrichir des lexiques
construits &#224; la main avec des informations statistiques par exemple.
</p>
<p>A la suite de cette &#233;tude, les perspectives sont multiples : d&#233;finition d&#8217;une m&#233;thode pour fa-
ciliter l&#8217;utilisation conjointe des deux approches, par exemple par la mise en place d&#8217;une &#8220;in-
terface d&#8217;enrichissement de ressource&#8221; ou harmonisation des formats utilis&#233;s. &#201;tant donn&#233; les
diff&#233;rences notables observ&#233;es entre LexSchem et le Lexique-Grammaire pour des verbes du
domaine &#233;conomique ou boursier, nous envisagons d&#8217;acqu&#233;rir automatiquement une ressource
&#224; partir d&#8217;un corpus de sp&#233;cialit&#233;.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A., CL&#201;MENT L. &amp; TOUSSENEL F. (2003). Building a Treebank for French, In
A. ABEILL&#201;, Ed., Treebanks : Building and Using Parsed Corpora, p. 165&#8211;187. Kluwer
Academic Publishers : Dordrecht.
</p>
<p>BOURIGAULT D., JACQUES M.-P., FABRE C., FR&#201;ROT C. &amp; OZDOWSKA S. (2005). Syntex,
analyseur syntaxique de corpus. In Actes des 12&#232;mes journ&#233;es sur le Traitement Automatique
des Langues Naturelles, Dourdan.
</p>
<p>BRENT M. R. (1993). From grammar to lexicon : Unsupervised learning of lexical syntax.
Computational Linguistics, 19, 203&#8211;222.
BRISCOE T. &amp; CARROLL J. (1997). Automatic extraction of subcategorization from corpora.
In Proceedings of the 5th ACL Conference on Applied Natural Language Processing, p. 356&#8211;
363, Washington, DC.
</p>
<p>CHESLEY P. &amp; SALMON-ALT S. (2006). Automatic extraction of subcategorization frames
for french. In Language Resources and Evaluation Conference (LREC), Genua (Italy).
</p>
<p>DENDIEN J. &amp; PIERREL J.-M. (2003). Le tr&#233;sor de la langue fran&#231;aise informatis&#233; : un
exemple d&#8217;informatisation d&#8217;un dictionnaire de langue de r&#233;f&#233;rence. Traitement Automatique
des Langues, 44 (2).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Messiant, Takuya Nakamura, Stavroula Voyatzi
</p>
<p>DINO IENCO S. V. &amp; BOSCO C. (2008). Automatic extraction of subcategorization frames
for italian. In E. L. R. A. (ELRA), Ed., Proceedings of the Sixth International Language
Resources and Evaluation (LREC&#8217;08), Marrakech, Morocco.
DUBOIS J. &amp; DUBOIS-CHARLIER F. (1997). Les verbes fran&#231;ais. Paris : Larousse.
GARDENT C., GUILLAUME B., PERRIER G. &amp; FALK I. (2006). Extraction d&#8217;information
de sous-cat&#233;gorisation &#224; partir des tables du ladl. In Actes de Traitement Automatique des
Langues Naturelles, Louvain, Belgique.
GROSS M. (1975). M&#233;thodes en syntaxe. Paris : Hermann.
KORHONEN A., GORRELL G. &amp; MCCARTHY D. (2000). Statistical filtering and subcatego-
rization frame acquisition. In Proceedings of the Conference on Empirical Methods in Natural
Language Processing and Very Large Corpora, Hong Kong.
KUPS&#769;C&#769; A. (2007). Extraction automatique de cadres de sous-cat&#233;gorisation verbale pour le
fran&#231;ais &#224; partir d&#8217;un corpus arbor&#233;. In TALN 2007, Toulouse.
MANNING C. D. (1993). Automatic acquisition of a large subcategorization dictionary from
corpora. In Meeting of the Association for Computational Linguistics, p. 235&#8211;242.
MEL&#180;CUK I. &amp; POLGU&#200;RE A. (2006). D&#233;rivations s&#233;mantiques et collocations dans le
DiCo/LAF. Langue fran&#231;aise, 150, 66&#8211;83.
MESSIANT C. (2008). A subcategorization acquisition system for French verbs. In Procee-
dings of the ACL-08 : HLT Student Research Workshop, p. 55&#8211;60, Columbus, Ohio : Associa-
tion for Computational Linguistics.
MESSIANT C., KORHONEN A. &amp; POIBEAU T. (2008). Lexschem : A large subcategoriza-
tion lexicon for french verbs. In Language Resources and Evaluation Conference (LREC),
Marrakech.
PREISS J., BRISCOE T. &amp; KORHONEN A. (2007). A system for large-scale acquisition of
verbal, nominal and adjectival subcategorization frames from corpora. In Meeting of the As-
sociation for Computational Linguistics, p. 912&#8211;918, Prague.
SAGOT B., CL&#201;MENT L., DE LA CLERGERIE E. &amp; BOULLIER P. (2006). The Lefff 2 syn-
tactic lexicon for French : architecture, acquisition, use. In Proceedings of the Language
Resources and Evaluation Conference (LREC), Genua (Italy).
SALKOFF M. &amp; VALLI A. (2005). A dictionary of french verbal complementation. In Actes de
Language and Technology Conference. Human Language and Technologies as a Challenge for
Computer Science and Linguistics. In memory of M. Gross and A. Zampolli, Poznan, Poland.
SCHULTE IM WALDE S. (2002). A Subcategorisation Lexicon for German Verbs induced
from a Lexicalised PCFG. In Proceedings of the 3rd Conference on Language Resources and
Evaluation, volume IV, p. 1351&#8211;1357, Las Palmas de Gran Canaria, Spain.
VAN DEN EYNDE K. &amp; BLANCHE-BENVENISTE C. (1978). Syntaxe et m&#233;canismes descrip-
tifs : pr&#233;sentation de l&#8217;approche pronominale. Cahiers de Lexicologie, 32, 3&#8211;27.
VAN DEN EYNDE K. &amp; MERTENS P. (2006). Le dictionnaire de valence Dicovalence : manuel
d&#8217;utilisation. Leuven : Manuscript.
VANRULLEN T., BLACHE P., PORTES C., RAUZY S., MAEYHIEUX J.-F., GU&#201;NOT M.-L.,
JEAN-MARIE-BALFOURIER &amp; BELLENGIER E. (2005). Une plateforme pour l&#8217;acquisition,
la maintenance et la validation de ressources lexicales. In Actes des 12&#232;mes journ&#233;es sur le
Traitement Automatique des Langues Naturelles, Dourdan.
WATTARUJEEKRIT T., SHAH P. K. &amp; COLLIER N. (2004). Pasbio : predicate-argument
structures for event extraction in molecular biology. BMC Bioinformatics, 5.</p>

</div></div>
</body></html>