<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un Analyseur S&#233;mantique pour le DHM Mod&#233;lisation &#8211; R&#233;alisation &#8211; &#201;valuation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009 
</p>
<p>Un Analyseur S&#233;mantique pour le DHM 
Mod&#233;lisation &#8211; R&#233;alisation &#8211; &#201;valuation 
</p>
<p>J&#233;r&#244;me Lehuen (1), Thierry Lemeunier (2) 
 
</p>
<p>LIUM - Universit&#233; du Maine 
Avenue La&#235;nnec, 72085 Le Mans Cedex 9 
(1) Jerome.Lehuen@lium.univ-lemans.fr 
</p>
<p>(2) Thierry.Lemeunier@lium.univ-lemans.fr 
</p>
<p>R&#233;sum&#233; Cet article d&#233;crit un mod&#232;le de langage d&#233;di&#233; au dialogue homme-machine, son 
impl&#233;mentation en CLIPS, ainsi qu&#8217;une &#233;valuation comparative. Notre probl&#233;matique n&#8217;est ni 
d&#8217;analyser des grands corpus, ni de proposer une grammaire &#224; grande couverture. Notre 
objectif est de produire des repr&#233;sentations s&#233;mantiques utilisables par un module de dialogue 
&#224; partir d&#8217;&#233;nonc&#233;s oraux courts, le plus souvent agrammaticaux. Une d&#233;marche pragmatique 
nous a conduit &#224; fonder l&#8217;analyse sur des principes simples mais efficaces dans le cadre que 
nous nous sommes fix&#233;. L&#8217;algorithme retenu s&#8217;inspire de l&#8217;analyse tabulaire. L&#8217;&#233;valuation que 
nous pr&#233;sentons repose sur le corpus MEDIA qui a fait l&#8217;objet d&#8217;une annotation s&#233;mantique 
manuelle de r&#233;f&#233;rence pour une campagne d&#8217;&#233;valuation d&#8217;analyseurs s&#233;mantiques pour le 
dialogue. Les r&#233;sultats que nous obtenons place notre analyseur dans le trio de t&#234;te des 
syst&#232;mes &#233;valu&#233;s lors de la campagne de juin 2005, et nous confortent dans nos choix 
d&#8217;algorithme et de repr&#233;sentation des connaissances. 
</p>
<p>Abstract This article describes a natural language model dedicated to man-machine 
dialogue, its implementation in CLIPS, as well as a comparative evaluation. Our problematic 
is neither to analyze large corpora nor to propose a large-coverage grammar. Our objective is 
to produce semantic representations usable for a dialog module from short oral utterances that 
are rather often ungrammatical. A pragmatic approach leads us to base parsing on simple but 
efficient principles within the man-machine dialog framework. Chart parsing influences the 
algorithm we have chosen. The evaluation that we present here uses the MEDIA corpora. It 
has been manually annotated and represents a standard usable in an evaluation campaign for 
semantic parsers dedicated to the dialog. With the results that we obtain our parser is in the 
three bests of the systems evaluated in the June 2005 campaign. It confirms our choices of 
algorithm and of knowledge representation. 
</p>
<p>Mots-cl&#233;s :   Analyse s&#233;mantique tabulaire, contexte dialogique, &#233;valuation. 
Keywords:   Semantic chart parsing, dialogue context, evaluation. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lehuen et Lemeunier 
</p>
<p>1 Introduction 
Cet article d&#233;crit un analyseur s&#233;mantique destin&#233; &#224; &#234;tre int&#233;gr&#233; dans un syst&#232;me de dialogue 
homme-machine avec entr&#233;e vocale. La langue orale spontan&#233;e pr&#233;sente un certain nombre de 
sp&#233;cificit&#233;s que l&#8217;on ne trouve pas dans les textes &#233;crits (Blanche-Benveniste et al., 1990). 
Elle se distingue d&#8217;abord par sa lin&#233;arit&#233; : toute correction ou reprise perturbe l&#8217;&#233;nonciation. 
Elle admet une plus grande souplesse syntaxique : elle comporte ellipses, structures cliv&#233;es et 
autres disfluences qui perturbent les outils d&#8217;analyse sensibles &#224; l&#8217;agrammaticalit&#233;. Une 
d&#233;marche pragmatique nous a conduit &#224; fonder l&#8217;analyse sur des principes simples mais 
efficaces, capables d&#8217;appr&#233;hender ces types d&#8217;&#233;nonc&#233;s oraux. Afin de ne pas faire reposer 
l&#8217;interpr&#233;tation s&#233;mantique sur le succ&#232;s d&#8217;une analyse syntaxique, nous avons cherch&#233; &#224; 
int&#233;grer des aspects syntaxiques et s&#233;mantiques au sein d&#8217;un m&#234;me mod&#232;le, ce qui permet de 
faire collaborer harmonieusement ces deux dimensions. De plus, notre mod&#232;le permet des 
analyses partielles ainsi que la g&#233;n&#233;ration de certaines hypoth&#232;ses de rattachement entre 
constituants. 
</p>
<p>Nous justifions aussi nos choix par rapport &#224; la suite du projet, &#224; savoir l&#8217;int&#233;gration avec un 
module de reconnaissance de la parole. L&#8217;entr&#233;e de notre analyseur pourrait &#234;tre, non plus une 
chaine de caract&#232;res, mais un treillis de mots ou un r&#233;seau de confusion, qui pr&#233;sente un 
ensemble de possibilit&#233;s. La probl&#233;matique sera alors d&#8217;utiliser les contraintes s&#233;mantiques 
afin de d&#233;partager deux mots de scores &#233;quivalents. 
</p>
<p>Le contexte de notre recherche et les contraintes que nous avons &#233;voqu&#233; dans cette 
introduction nous ont conduit &#224; d&#233;velopper d&#8217;une part une grammaire syntaxico-s&#233;mantique et 
d&#8217;autre part un processus de type analyse tabulaire. Dans la suite de l&#8217;article nous pr&#233;sentons 
tout d&#8217;abord notre mod&#232;le des connaissances syntaxico-s&#233;mantiques. Dans la deuxi&#232;me partie 
nous pr&#233;sentons une impl&#233;mentation de ce mod&#232;le. Dans une troisi&#232;me partie, nous 
pr&#233;sentons les r&#233;sultats obtenus suite &#224; une &#233;valuation fond&#233;e sur le corpus MEDIA (Maynard 
et al., 2005). 
</p>
<p>2 Mod&#233;lisation 
Les connaissances se pr&#233;sentent sous la forme d&#8217;un ensemble d&#8217;unit&#233;s lexicales d&#233;finies &#224; la 
fois syntaxiquement et s&#233;mantiquement. Chaque lexie est caract&#233;ris&#233;e par un nom, par un 
syst&#232;me d&#8217;offres et d&#8217;attentes, et par au moins une forme d&#8217;usage langagi&#232;re (Figure 1). Cela 
forme une association signifi&#233;/signifiant. Les offres et les attentes sont des traits s&#233;mantiques. 
Ils permettent de lier s&#233;mantiquement les lexies entre elles. Les formes d&#8217;usage sont des 
structures syntaxiques compos&#233;es de mots (symboles terminaux) et/ou de relations de 
d&#233;pendance faisant r&#233;f&#233;rence aux attentes de la lexie (symboles non-terminaux), comme par 
exemple &#171; A1 chambre A2 &#187; o&#249; A1 et A2 font r&#233;f&#233;rence &#224; des attentes de la lexie [chambre]. 
On obtient ainsi une sorte de grammaire non contextuelle utilisable pour l&#8217;analyse et pour la 
g&#233;n&#233;ration (Lehuen, 2008). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un Analyseur S&#233;mantique pour le DHM 
</p>
<p> 
</p>
<p>Figure 1 : Mod&#232;le de lexie &#224; deux attentes 
</p>
<p>Les exemples de cet article sont extraits de la grammaire &#233;crite &#224; partir du corpus MEDIA. La 
s&#233;mantique &#233;tant impos&#233;e par l&#8217;annotation manuelle, les offres et les attentes des lexies sont 
g&#233;n&#233;ralement r&#233;duites &#224; une cat&#233;gorie de l&#8217;ontologie MEDIA. Il est n&#233;anmoins possible de 
d&#233;crire les lexies de fa&#231;on plus fine, en rempla&#231;ant la cat&#233;gorie par plusieurs traits, ce qui 
permet &#224; l&#8217;algorithme d&#8217;analyse d&#8217;utiliser le principe d&#8217;isotopie (Rastier, 1987). Dans le texte 
qui suit, les lexies sont not&#233;es entre crochet et les traits, qui constituent les offres et les 
attentes, sont not&#233;s entre accolades. 
</p>
<p>2.1 De la lexie au granule 
La repr&#233;sentation s&#233;mantique d&#8217;un &#233;nonc&#233; consiste en une structure de d&#233;pendances 
(Tesni&#232;re, 1959) qui couvre les mots de l&#8217;&#233;nonc&#233; correspondant &#224; des formes d&#8217;usage 
reconnues. Les n&#339;uds du graphe &#8211; les granules &#8211; correspondent &#224; des lexies instanci&#233;es dans 
le contexte de l&#8217;&#233;nonc&#233; (Figure 2). Cette repr&#233;sentation est destin&#233;e &#224; &#234;tre r&#233;interpr&#233;t&#233;e dans le 
double contexte du dialogue et de l&#8217;application. La connexit&#233; du graphe, qui d&#233;pend de la 
grammaire et de l&#8217;&#233;nonc&#233;, peut &#234;tre modifi&#233;e. 
</p>
<p> 
</p>
<p>Figure 2 : Des lexies &#224; la structure de granules 
</p>
<p>La lexie [chambre] comporte cinq attentes dont une associ&#233;e &#224; un r&#244;le (Figure 3). Cet attribut 
r&#244;le permet de contextualiser une lexie instanci&#233;e. Ainsi, une lexie ayant pour trait {nombre} 
dans le contexte d&#8217;une lexie [chambre] est interpr&#233;t&#233;e comme un granule ayant un trait 
{nombre-chambre}. Ce m&#233;canisme d&#8217;actualisation (Rastier, 1987) permet d&#8217;interpr&#233;ter un 
&#233;nonc&#233; comme &#171; je voudrais r&#233;server du 15 au 18 &#187; o&#249; les nombres 15 et 18 endossent 
respectivement les r&#244;les temps-jour-mois-debut et temps-jour-mois-fin. 
&lt;lexie nom=&quot;chambre&quot; offres=&quot;objet&quot;&gt;    
 &lt;attente code=&quot;A1&quot; traits=&quot;nombre&quot; role=&quot;nombre-chambre&quot;/&gt; 
 &lt;attente code=&quot;A2&quot; traits=&quot;chambre-type&quot;/&gt; 
 &lt;attente code=&quot;A3&quot; traits=&quot;chambre-fumeur&quot;/&gt; 
 &lt;attente code=&quot;A4&quot; traits=&quot;chambre-equipement&quot;/&gt; 
 &lt;attente code=&quot;A5&quot; traits=&quot;chambre-standing&quot;/&gt; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lehuen et Lemeunier 
</p>
<p> &lt;syntaxe pattern=&quot;chambre(s)&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 chambre(s)&quot; exemple=&quot;deux chambres&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 chambre(s) A2&quot; exemple=&quot;deux chambres simples&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 chambre(s) A3&quot; exemple=&quot;deux chambres non fumeur&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 chambre(s) A2 A3&quot; exemple=&quot;deux chambres simples non fumeur&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 A2&quot; exemple=&quot;deux singles&quot;/&gt; 
&lt;/lexie&gt; 
</p>
<p>Figure 3 : Lexie [chambre] et quelques formes d&#8217;usage 
</p>
<p>Certaines lexies &#171; anonymes &#187; n&#8217;existent que pour permettre de contextualiser des lexies plus 
g&#233;n&#233;rales gr&#226;ce &#224; des formes d&#8217;usages particuli&#232;res. Ces lexies peuvent ou non avoir des 
offres selon que l&#8217;on souhaite ou non les rattacher &#224; d&#8217;autres lexies. Par exemple, la lexie 
d&#233;crite Figure 4 permet de contextualiser une lexie ayant pour trait {nombre} gr&#226;ce au r&#244;le 
sejour-nbPersonne, sans avoir &#224; d&#233;finir une lexie [personne]. 
&lt;lexie offres=&quot;infosejour&quot;&gt; 
  &lt;attente code=&quot;A1&quot; traits=&quot;nombre&quot; role=&quot;sejour-nbPersonne&quot;/&gt; 
  &lt;syntaxe pattern=&quot;A1 personne(s)&quot;/&gt; 
  &lt;syntaxe pattern=&quot;pour A1 personne(s)&quot;/&gt; 
&lt;/lexie&gt; 
</p>
<p>Figure 4 : Exemple de lexie anonyme 
</p>
<p>2.2 Interrogation et n&#233;gation 
Les questions en tant qu&#8217;actes de langage ne sont pas toujours exprim&#233;es par des phrases 
interrogatives. Certaines assertions peuvent m&#234;me &#234;tre interpr&#233;t&#233;es comme des questions 
(Kerbrat-Orecchioni, 1991). De plus, comme les &#233;nonc&#233;s oraux qui nous int&#233;ressent ne sont 
pas toujours analysables de fa&#231;on globale, il faut plut&#244;t chercher des marqueurs interrogatifs 
plut&#244;t que des structures grammaticalement correctes. Les questions peuvent &#234;tre marqu&#233;es 
par des s&#233;quences pr&#233;liminaires comme &#171; (je peux) (vous) poser une question &#187;. Certaines 
expressions comme &#171; (je voudrais) savoir si&#8230; &#187;, &#171; (pouvez-vous) me dire si&#8230; &#187; ainsi que des 
assertions modalis&#233;es comme &#171; je suppose que&#8230; &#187;, &#171; il para&#238;t que&#8230; &#187; d&#233;notent &#233;galement 
des questions. M&#234;me des assertions comme &#171; je peux amener mon chien &#187; ou &#171; les chiens ne 
sont pas accept&#233;s &#187; peuvent &#234;tre interpr&#233;t&#233;es comme des questions selon le contexte. 
&lt;lexie nom=&quot;questionner&quot; offres=&quot;acte&quot;&gt; 
 &lt;attente code=&quot;A1&quot; traits=&quot;questionnable&quot;/&gt; 
 &lt;syntaxe pattern=&quot;savoir si&quot;/&gt; 
 &lt;syntaxe pattern=&quot;est ce que&quot;/&gt; 
 &lt;syntaxe pattern=&quot;savoir si A1&quot; exemple=&quot;savoir si les chiens sont accept&#233;s&quot;/&gt; 
 &lt;syntaxe pattern=&quot;est ce que A1&quot; exemple=&quot;est ce que les chiens sont accept&#233;s&quot;/&gt; 
&lt;/lexie&gt; 
 
&lt;lexie nom=&quot;service-animaux&quot; offres=&quot;hotel-service questionnable&quot;&gt; 
 &lt;attente code=&quot;A1&quot; traits=&quot;animaux&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1&quot; exemple=&quot;les chiens&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 sont accept&#233;s&quot; exemple=&quot;les chiens sont accept&#233;s&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 sont ils accept&#233;s&quot; traits=&quot;inter&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 ne sont pas accept&#233;s&quot; traits=&quot;neg&quot;/&gt; 
&lt;/lexie&gt; 
 
&lt;lexie offres=&quot;animaux&quot;&gt; 
 &lt;attente code=&quot;A1&quot; traits=&quot;determinant&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 animal/animaux&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 chien(s)&quot;/&gt; 
 &lt;syntaxe pattern=&quot;A1 chat(s)&quot;/&gt; 
&lt;/lexie&gt; 
</p>
<p>Figure 5 : Fragment de grammaire traitant quelques formes interrogatives </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un Analyseur S&#233;mantique pour le DHM 
</p>
<p>Avec notre mod&#232;le, les questions sont analysables de plusieurs fa&#231;ons. La premi&#232;re consiste &#224; 
utiliser des lexies d&#233;di&#233;es comme [questionner] qui offre un trait {acte} (de langage) et qui 
attend une lexie optionnelle avec le trait {questionnable} (Figure 5). Ainsi, m&#234;me si la lexie 
sur laquelle porte la question n&#8217;est pas rep&#233;rable, le module de dialogue sait qu&#8217;une question a 
&#233;t&#233; pos&#233;e. Si une lexie [questionner] pr&#233;c&#232;de une lexie avec le trait {questionnable} alors 
qu&#8217;elles ne sont pas rattach&#233;es, le module de dialogue peut inf&#233;rer un rattachement 
hypoth&#233;tique et agir en cons&#233;quence. 
</p>
<p>Une deuxi&#232;me fa&#231;on de traiter les questions est d&#8217;utiliser des formes d&#8217;usage interrogatives 
(exemple de la lexie [service-animaux] de la Figure 5). En effet, le mod&#232;le permet d&#8217;associer 
&#224; chaque forme d&#8217;usage des traits sp&#233;cifiques &#224; celle-ci qui viennent s&#8217;ajouter aux traits de la 
lexie. Ainsi, un &#233;nonc&#233; comme &#171; les chiens sont-ils accept&#233;s &#187; est analys&#233; comme une 
question au travers du trait inter sur le granule [service-animaux] (Figure 6).  
</p>
<p>Ces deux fa&#231;ons de prendre en compte l&#8217;interrogation peuvent se superposer si la grammaire 
le permet. Certaines formes n&#233;gatives, qui sont aussi prises en compte au niveau des formes 
d&#8217;usage, peuvent &#233;galement &#234;tre interpr&#233;t&#233;es comme des questions, selon le contexte. La 
m&#233;thode utilis&#233;e pour identifier certaines formes interrogatives et n&#233;gatives est facilement 
r&#233;utilisable pour identifier et repr&#233;senter d&#8217;autre forme morphosyntaxique et/ou illocutoire, 
comme le niveau de langage ou de politesse par exemple. 
</p>
<p> 
Figure 6 : Deux fa&#231;ons de prendre en compte l&#8217;interrogation 
</p>
<p>3 R&#233;alisation 
L&#8217;architecture de l&#8217;analyseur que nous avons d&#233;velopp&#233; est fond&#233;e sur le principe de l&#8217;analyse 
tabulaire ou chart parsing (Kay, 1986). L&#8217;id&#233;e est de d&#233;velopper et de garder en m&#234;me temps 
plusieurs hypoth&#232;ses ainsi que les conclusions partielles de l&#8217;analyse en utilisant la technique 
de m&#233;mo&#239;sation. Plusieurs algorithmes et am&#233;liorations visant &#224; am&#233;liorer leur efficacit&#233; ont 
&#233;t&#233; propos&#233;s (Younger, 1967), (Earley, 1970). En ce qui nous concerne, le choix de l&#8217;analyse 
tabulaire a &#233;t&#233; motiv&#233;, d&#8217;une part par les caract&#233;ristiques des donn&#233;es (&#233;nonc&#233;s oraux), d&#8217;autre 
part par notre mod&#232;le de connaissances (grammaire non contextuelle). En effet, la structure de 
chart permet d&#8217;appliquer efficacement une grammaire de ce type sur un &#233;nonc&#233; partiellement 
grammatical, et cela sans backtracking, puisque les possibilit&#233;s d&#8217;analyse sont construites et 
conserv&#233;es jusqu&#8217;&#224; ce qu&#8217;elles soient supprim&#233;es. 
</p>
<p>Le choix de l&#8217;analyse tabulaire est aussi justifi&#233; par la poursuite de notre projet, puisque notre 
objectif est d&#8217;ins&#233;rer notre module d&#8217;analyse s&#233;mantique dans un syst&#232;me de dialogue oral 
comprenant un module de reconnaissance de la parole qui produit, non pas une cha&#238;ne de 
caract&#232;res, mais un treillis de mots, un r&#233;seau de confusion, ou une liste des n-best 
hypoth&#232;ses. La caract&#233;ristique de ces sorties est de pr&#233;senter plusieurs possibilit&#233;s o&#249; chaque 
possibilit&#233; est associ&#233;e &#224; un score. Le module d&#8217;analyse devra &#234;tre en mesure de renforcer ou 
de diminuer un score en fonction de contraintes s&#233;mantiques non prises en compte au niveau 
de la reconnaissance de parole. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lehuen et Lemeunier 
</p>
<p>3.1 Analyse tabulaire 
La premi&#232;re &#233;tape consiste &#224; instancier des granules &#224; partir des mots (symboles terminaux) et 
des granules (symboles non-terminaux) pr&#233;sents dans la m&#233;moire de travail. Cette &#233;tape peut 
donner lieu &#224; des conflits. Pour chaque granule, un score est calcul&#233; en fonction du nombre de 
mots et de ses &#233;ventuels constituants. La deuxi&#232;me &#233;tape &#8211; la r&#233;solution de conflits &#8211; consiste 
&#224; d&#233;partager les granules conflictuels sur la base de leurs scores respectifs (certains conflits 
peuvent &#234;tre r&#233;solus d&#232;s la premi&#232;re &#233;tape afin de limiter la combinatoire). La troisi&#232;me &#233;tape 
consiste &#224; rattacher certains granules isol&#233;s sur la base des offres et des attentes. Cette &#233;tape 
permet de contourner certaines structures agrammaticales, ou non d&#233;crites dans la grammaire.  
</p>
<p>La figure suivante (Figure 7) repr&#233;sente l&#8217;analyse de l&#8217;&#233;nonc&#233; &#171; alors il me faudrait deux 
chambres doubles et une simple &#187;. Les granules supprim&#233;s sont marqu&#233;s d&#8217;une croix et les 
granules-racines d&#8217;un point. Ceux en pointill&#233;s seront omis lors de la projection (cf. &#167; 4.2). 
</p>
<p> 
Figure 7 : Exemples d&#8217;analyse tabulaire et de sa structure de granules 
</p>
<p>3.2 Plateforme de programmation 
Notre algorithme d&#8217;analyse tabulaire repose en r&#233;alit&#233; sur l&#8217;algorithme RETE (Forgy, 1982) 
qui intervient dans l&#8217;impl&#233;mentation de syst&#232;mes &#224; base de faits et de r&#232;gles de production, tel 
que CLIPS. L&#8217;algorithme RETE compile les r&#232;gles sous la forme d&#8217;un r&#233;seau de n&#339;uds que 
les faits vont devoir parcourir. Le principe des &#171; r&#232;gles point&#233;es &#187; de l&#8217;analyse tabulaire est 
directement pris en compte par le moteur d&#8217;inf&#233;rence : &#224; chaque fait ajout&#233; dans la base, c&#8217;est-
&#224;-dire &#224; chaque reconnaissance d&#8217;un symbole non-terminal ou terminal, l&#8217;ensemble des r&#232;gles 
qui peuvent &#224; nouveau s&#8217;appliquer sont activ&#233;es dans l&#8217;agenda du moteur d&#8217;inf&#233;rence. Cet 
algorithme, qui tend &#224; sacrifier la m&#233;moire au profit de la vitesse, s&#8217;est r&#233;v&#233;l&#233; particuli&#232;rement 
efficace pour impl&#233;menter notre grammaire. Concr&#232;tement, les formes d&#8217;usage cod&#233;es en 
XML sont d&#8217;abord traduites sous la forme de r&#232;gles CLIPS &#224; l&#8217;aide de transformations XSLT, 
puis compil&#233;es par l&#8217;algorithme RETE. Il y a une r&#232;gle CLIPS par forme d&#8217;usage, soit plus de 
1000 r&#232;gles pour la grammaire du corpus MEDIA. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un Analyseur S&#233;mantique pour le DHM 
</p>
<p>4 &#201;valuation 
Afin d&#8217;&#233;valuer les performances de notre analyseur, nous avons &#233;crit une grammaire &#224; partir 
des donn&#233;es du corpus MEDIA, ce qui nous a permis de positionner notre syst&#232;me par rapport 
aux cinq autres ayant particip&#233; &#224; la campagne d&#8217;&#233;valuation MEDIA-EVALDA de 2005. 
</p>
<p>La m&#233;thode d&#8217;&#233;valuation s&#8217;appuie, d&#8217;une part sur une repr&#233;sentation s&#233;mantique de r&#233;f&#233;rence, 
d&#8217;autre part sur un corpus annot&#233; manuellement selon cette repr&#233;sentation (Maynard et al., 
2004, 2005). L&#8217;&#233;valuation d&#8217;un analyseur consiste alors &#224; comparer l&#8217;analyse d&#8217;un corpus de 
test (utilis&#233; uniquement pour l&#8217;&#233;valuation) aux r&#233;sultats annot&#233;s manuellement. 
</p>
<p>Le corpus se pr&#233;sente sous la forme de fichiers XML regroupant 1257 dialogues, soit plus de 
15000 &#233;nonc&#233;s, dont 3000 d&#233;di&#233;s &#224; la phase d&#8217;&#233;valuation. Si nous avons pris le temps 
d&#8217;am&#233;liorer notre approche, nous avons respect&#233; le protocole de la campagne d&#8217;&#233;valuation 
afin d&#8217;obtenir des r&#233;sultats comparables &#224; ceux des participants. Comme ces derniers, nous 
avons d&#233;velopp&#233; un module de projection de notre propre repr&#233;sentation vers la repr&#233;sentation 
de r&#233;f&#233;rence. Dans les paragraphes suivants, nous d&#233;crivons le mod&#232;le de r&#233;f&#233;rence, notre 
m&#233;thode de projection, et les r&#233;sultats que nous obtenons. 
</p>
<p>4.1 Le mod&#232;le des triplets de MEDIA 
Le choix de la repr&#233;sentation de r&#233;f&#233;rence a &#233;t&#233; guid&#233; par des contraintes li&#233;es &#224; l&#8217;annotation 
manuelle. Premi&#232;rement, les repr&#233;sentations hi&#233;rarchiques ont &#233;t&#233; &#233;cart&#233;es au b&#233;n&#233;fice d&#8217;une 
repr&#233;sentation plate qui suit l&#8217;ordre d&#8217;apparition des mots. Deuxi&#232;mement, il a &#233;t&#233; d&#233;cid&#233; de 
ne repr&#233;senter que les segments porteurs de sens pour l&#8217;application, et non tous les mots de 
l&#8217;&#233;nonc&#233;. 
</p>
<p>Chaque segment est repr&#233;sent&#233; par un triplet &lt;mode:attribut:valeur&gt;. Le mode indique si le 
segment correspond &#224; une affirmation, &#224; une n&#233;gation, &#224; une interrogation ou &#224; une 
possibilit&#233;. L&#8217;attribut correspond &#224; un concept simple ou compos&#233; de l&#8217;ontologie MEDIA. La 
valeur correspond &#224; une instanciation du concept dans l&#8217;&#233;nonc&#233;. L&#8217;ontologie contient 83 
concepts simples, 19 sp&#233;cifieurs et au total 1121 concepts simples et compos&#233;s (c&#8217;est-&#224;-dire 
avec sp&#233;cifieurs). Le tableau suivant contient la repr&#233;sentation sous forme de triplets de 
l&#8217;&#233;nonc&#233; &#171; alors il me faudrait deux chambres doubles et une simple &#187;. 
</p>
<p>Mots Mode Attribut Valeur 
</p>
<p>deux chambres + nombre-chambre 2 
</p>
<p>doubles + chambre-type double 
</p>
<p>et + connectProp addition 
</p>
<p>une + nombre-chambre 1 
</p>
<p>simple + chambre-type simple 
</p>
<p>Tableau 1 : Exemple de repr&#233;sentation selon le mod&#232;le des triplets de MEDIA </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lehuen et Lemeunier 
</p>
<p>4.2 Projection sur le mod&#232;le des triplets 
La projection est l&#8217;op&#233;ration qui consiste &#224; instancier une liste ordonn&#233;e de triplets &#224; partir 
d&#8217;une structure de granules, connexe ou non. Nous avons identifi&#233; deux cas de projection 
(Figure 8) et quelques transformations. 
</p>
<p>Le cas g&#233;n&#233;ral consiste &#224; transformer les traits de la lexie en attributs, les noms des lexies en 
valeurs normalis&#233;es, et les traits sp&#233;cifiques aux formes d&#8217;usage (f-traits) en modes. Par 
exemple, la projection des granules de l&#8217;&#233;nonc&#233; &#171; les chiens sont-ils accept&#233;s &#187; (Figure 6) 
produit le triplet &lt;?:hotel-service:service-animaux&gt;, le granule anonyme de trait {animaux} 
n&#8217;&#233;tant pas projet&#233;. 
</p>
<p>Les granules dot&#233;s d&#8217;un r&#244;le sont projet&#233;s diff&#233;remment, le r&#244;le &#233;tant pr&#233;dominant sur le trait. 
Par exemple, la projection des granules de l&#8217;&#233;nonc&#233; &#171; une chambre double&#187; (Figure 2) produit 
les triplets &lt;+:nombre-chambre:1&gt; et &lt;+:chambre-type:double&gt;, le triplet &lt;+:objet:chambre&gt; 
&#233;tant supprim&#233; par respect des consignes d&#8217;annotation. 
</p>
<p> 
Figure 8 : Deux cas de projection des granules vers les triplets 
</p>
<p>Apr&#232;s la premi&#232;re &#233;tape de passage des granules vers le mod&#232;le des triplets, une seconde &#233;tape 
de transformation des triplets finalise le r&#233;sultat, selon les consignes de l&#8217;annotation manuelle. 
Nous d&#233;crivons ci-dessous les transformations les plus significatives : l&#8217;inf&#233;rence de mode et 
l&#8217;inf&#233;rence de sp&#233;cifieur. 
</p>
<p>Le cas de l&#8217;&#233;nonc&#233; &#171; est ce que je peux amener mon chien &#187; est un exemple de modification 
d&#8217;un mode par un granule p&#232;re. Les granules produits par notre analyse (Figure 6) sont 
projet&#233;s dans un premier temps en deux triplets : &lt;+:acte:questionner&gt; et &lt;+:hotel-
services:service-animaux&gt;, le granule anonyme de trait {animaux} n&#8217;&#233;tant pas projet&#233;. La 
lexie [questionner] ne faisant pas partie de l&#8217;ontologie MEDIA, le triplet correspondant ne 
sera pas conserv&#233;. Mais avant de dispara&#238;tre, il agira sur le mode du triplet correspondant au 
granule fils [service-animaux]. Il ne restera que le triplet &lt;?:hotel-services:service-animaux&gt;. 
</p>
<p>Le cas de l&#8217;&#233;nonc&#233; &#171; je voudrais r&#233;server une chambre double du premier au 6 d&#233;cembre &#187; 
illustre le principe de propagation de sp&#233;cifieur. Les triplets produits lors de l&#8217;&#233;tape n&#176;1 sont : 
&lt;+:command-tache:reservation&gt;, &lt;+:nombre-chambre:1&gt;, &lt;+:chambre-type:double&gt;, 
&lt;+:temps-date-debut:01/12&gt; et &lt;+:temps-date-fin:06/12&gt;. Le manuel d&#8217;annotation1 stipule 
                                                 
1 http://www.limsi.fr/Individu/hbm/manuel_annotation_11_04.html (acc&#233;d&#233; le 06/03/09). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un Analyseur S&#233;mantique pour le DHM 
</p>
<p>que si l&#8217;action de r&#233;server est exprim&#233;e, on propage un sp&#233;cifieur &#171; reservation &#187; sur certains 
attributs (dont nombre-chambre, temps-date-debut et temps-date-fin). Le triplet &lt;+:nombre-
chambre:1&gt; devient alors &lt;+:nombre-chambre-reservation:1&gt;, le triplet &lt;+:temps-date-debut: 
01/12&gt; devient alors &lt;+:temps-date-debut-reservation:01/12&gt;, etc. 
</p>
<p>4.3 R&#233;sultats 
L&#8217;&#233;valuation consiste en un taux d&#8217;erreur calcul&#233; &#224; partir de l&#8217;alignement du r&#233;sultat obtenu et 
du r&#233;sultat de r&#233;f&#233;rence. Ce taux est &#233;gal &#224; SUB + DEL + INS / TOT o&#249; SUB est le nombre de 
triplets modifi&#233;s, DEL le nombre de triplets supprim&#233;s, INS le nombre de triplets ajout&#233;s, et 
TOT le nombre de triplets &#224; identifier. Quatre taux sont calcul&#233;s selon que l&#8217;on tient compte 
des quatre modes ou seulement des modes affirmatif et n&#233;gatif, et selon que l&#8217;on n&#8217;utilise que 
les concepts de base (relax scoring) ou si l&#8217;on fait usage des sp&#233;cifieurs (full scoring). 
</p>
<p>Full 4 modes Full 2 modes Relax 4 modes Relax 2 modes 
</p>
<p>LIMSI-1 : 29,0 LIMSI-2 : 23,2 LIMSI-1 : 27,0 LIMSI-2 : 19,6 
</p>
<p>LIMSI-2 : 30,3 LIMSI-1 : 23,8 LIMSI-2 : 27,2 LIMSI-1 : 21,6 
</p>
<p>LIUM : 34,7 LORIA : 28,9 LIA : 29,8 LIA : 24,1 
</p>
<p>LORIA : 36,3 LIUM : 30,0 LIUM : 31,9 LORIA : 24,6 
</p>
<p>VALORIA : 37,8 VOLORIA : 30,6 LORIA : 32,3 LIUM : 26,9 
</p>
<p>LIA : 41,3 LIA : 36,4 VALORIA : 35,1 VALORIA : 27,6 
</p>
<p>Tableau 2 : Tableau comparatif des taux d&#8217;erreurs 
</p>
<p>Nous obtenons un score relativement bon dans le mode le plus exigeant (full 4 modes). Les 
&#233;carts de 4,7% et 5% constat&#233;s entre les taux &#171; 2 modes &#187; et &#171; 4 modes &#187; correspondent &#224; 
l&#8217;identification des interrogations et des demandes de possibilit&#233;, difficiles &#224; traiter sans prise 
en compte du contexte de l&#8217;application. Cet &#233;cart &#233;tant en moyenne de 6,57% pour les autres 
syst&#232;mes, notre analyseur serait plus pr&#233;cis sur cet aspect. Nous constatons un &#233;cart moyen de 
2,9% entre les taux &#171; relax &#187; et &#171; full &#187;. Cela peut s&#8217;expliquer par la relative proximit&#233; de 
notre repr&#233;sentation s&#233;mantique avec celle de MEDIA, ce qui permet d&#8217;&#233;viter certaines 
erreurs de projection. En tenant compte des deux &#233;carts pr&#233;c&#233;dents, on peut dire que sur les 
34,7% du mode &#171; full 4 modes &#187;, il reste environ 27% d&#8217;erreurs dont les causes ont 
principalement pour origine des probl&#232;mes d&#8217;identification des expressions r&#233;f&#233;rentielles et 
des connecteurs (&#233;galement une source d&#8217;erreurs pour les autres syst&#232;mes). Enfin, nous avons 
retrouv&#233; une source d&#8217;erreurs identifi&#233;e dans (Villaneau, Lamprier, 2005) li&#233;e &#224; la projection 
d&#8217;une repr&#233;sentation hi&#233;rarchique vers une repr&#233;sentation lin&#233;aire. En effet, les triplets suivent 
l&#8217;ordre d&#8217;apparition des mots, alors que nos structures de granules ne sont pas d&#233;pendantes de 
cet ordre. Quelque soit la m&#233;thode de projection, nous obtenons des inversions par rapport &#224; 
l&#8217;ordre attendu, qui augmentent conjointement les taux de substitutions et d&#8217;insertions. 
</p>
<p>5 Conclusion 
Le mod&#232;le s&#233;mantique, ainsi que le principe d&#8217;analyse pour le dialogue homme-machine que 
nous pr&#233;sentons dans cet article, ont &#233;t&#233; d&#233;velopp&#233;s avant le choix du corpus MEDIA pour 
leur &#233;valuation. Ils ne sont donc pas ad hoc. Nous retenons de cette exp&#233;rience qu&#8217;avec un 
mod&#232;le linguistique simple (une grammaire s&#233;mantique non contextuelle), mais adapt&#233; &#224; notre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lehuen et Lemeunier 
</p>
<p>probl&#233;matique, un algorithme et une architecture minimalistes (nous ne faisons reposer notre 
interpr&#233;tation sur aucun dictionnaire, ni segmentation morphosyntaxique), nous obtenons des 
r&#233;sultats comparables &#224; ceux des autres syst&#232;mes, en particulier sur les modes d&#8217;&#233;valuation les 
plus exigeants. Ceci dit, les probl&#232;mes qui ont contribu&#233;s &#224; faire monter nos taux d&#8217;erreurs 
semblent pr&#233;cis&#233;ment li&#233;s &#224; un manque de pr&#233;-segmentation de l&#8217;&#233;nonc&#233; (identification des 
groupes nominaux, des relatives, etc.). Comme d&#8217;autres participants, nous avons regrett&#233; les 
limites du mod&#232;le s&#233;mantique de r&#233;f&#233;rence, qui nous a contraint &#224; perdre la dimension 
hi&#233;rarchique lors de l&#8217;&#233;tape de projection, tout en induisant une source importante d&#8217;erreurs. 
</p>
<p>R&#233;f&#233;rences 
BLANCHE-BENVENISTE C., BILGER M., ROUGET C., VAN DEN EYNDE K. (1990). Le Fran&#231;ais 
parl&#233; : &#233;tudes grammaticales. Paris : CNRS Editions. 
</p>
<p>BONNEAU-MAYNARD H., ROSSET S., AYACHE C., KUHN A., MOSTEFA D. (2005). Semantic 
Annotation of the French MEDIA dialog corpus. Proceedings of Eurospeech 05, Lisboa. 
</p>
<p>BONNEAU-MAYNARD H., AYACHE C., BECHET F., DENIS A., KUHN A., LEFEVRE F., MOSTEFA 
D., QUIGNARD M., ROSSET S., SEVRAN C., VILLANEAU J. (2006). Results of the french 
EVALDA-MEDIA evaluation campaign for literal understanding. Actes de LREC 2006, 
G&#234;nes, Italie, 2054&#8211;2059. 
</p>
<p>EARLEY J. (1970). An efficient context-free parsing algorithm. Communications of the 
Association for Computing Machinery 13(2), 94-102. 
</p>
<p>FORGY, C.L. (1982). Rete: A Fast Algorithm for the Many Pattern/Many Object Pattern 
Match Problem. Artificial Intelligence (19), 17-37. 
</p>
<p>KAY M. (1986). Algorithms chemata and data structures in syntactic processing. Readings in 
natural  language processing. San Francisco, CA, USA : Morgan Kaufmann Publishers Inc. 
</p>
<p>KERBRAT-ORECCHIONI C. (1991). L&#8217;acte de question et l&#8217;acte d&#8217;assertion : opposition discr&#232;te 
ou continuum ?, La Question. Presses Universitaires de Lyon, 87-111. 
</p>
<p>LEHUEN J. (2008). Un mod&#232;le de langage pour le DHM : la Grammaire S&#233;mantique 
R&#233;versible, Actes de TALN&#8217;08, 9-13 juin 2008, Avignon (France). 
</p>
<p>RASTIER F. (1987). S&#233;mantique interpr&#233;tative. Paris : PUF. 
</p>
<p>TESNI&#200;RE L. (1988). El&#233;ments de syntaxe structurale. Paris : Editions Klincksieck. 
</p>
<p>VILLANEAU J., LAMPRIER S. (2005). Corpus de dialogue homme/machine : annotation 
s&#233;mantique et compr&#233;hension. Actes des Journ&#233;es Internationales de Linguistique de Corpus 
2005, Lorient, France, 221-229. 
</p>
<p>YOUNGER D. (1967). Recognition and parsing of context-free languages in time n3. 
Information and Control 10(2), 189&#8211;208. </p>

</div></div>
</body></html>