<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>EXCOM : Plate-forme d'annotation s&#233;mantique de textes multilingues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>EXCOM : Plate-forme d'annotation s&#233;mantique  
</p>
<p>de textes multilingues 
</p>
<p>Motasem Alrahabi (1), Jean-Pierre Descl&#233;s (2) 
</p>
<p>Laboratoire LaLIC &#8211; Universit&#233; Paris-Sorbonne 
(1) motasem.alrahabi@paris4.sorbonne.fr 
(2) jean-pierre.descles@paris-sorbonne.fr 
</p>
<p>R&#233;sum&#233; Nous proposons une plateforme d&#8223;annotation s&#233;mantique, appel&#233;e &#171; EXCOM &#187;. 
Bas&#233;e sur la m&#233;thode de l&#8223; &#171; Exploration Contextuelle &#187;, elle permet, &#224; travers une diversit&#233; de 
langues, de proc&#233;der &#224; des annotations automatiques de segments textuels par l'analyse des 
</p>
<p>formes de surface dans leur contexte. Les textes sont trait&#233;s selon des &#171; points de vue &#187; 
</p>
<p>discursifs dont les valeurs sont organis&#233;es dans une &#171; carte s&#233;mantique &#187;. L&#8223;annotation se base 
sur un ensemble de r&#232;gles linguistiques, &#233;crites par un analyste, qui permettent d&#8223;identifier les 
repr&#233;sentations textuelles sous-jacentes aux diff&#233;rentes cat&#233;gories de la carte. Le syst&#232;me 
</p>
<p>offre, &#224; travers deux types d&#8223;interfaces (d&#233;veloppeur ou utilisateur), une cha&#238;ne de traitements 
automatiques de textes qui comprend la segmentation, l&#8223;annotation et d&#8223;autres fonctionnalit&#233;s 
de post-traitement. Les documents annot&#233;s peuvent &#234;tre utilis&#233;s, par exemple, pour des 
</p>
<p>syst&#232;mes de recherche d&#8223;information, de veille, de classification ou de r&#233;sum&#233; automatique. 
</p>
<p>Abstract We propose a platform for semantic annotation, called &#8220;EXCOM&#8221;. Based on the 
&#8220;Contextual Exploration&#8221; method, it enables, across a great range of languages, to perform 
automatic annotations of textual segments by analyzing surface forms in their context. Texts 
</p>
<p>are approached through discursive &#8220;points of view&#8221;, of which values are organized into a 
&#8220;semantic map&#8221;. The annotation is based on a set of linguistic rules, manually constructed by 
an analyst, and that enables to automatically identify the textual representations underlying the 
</p>
<p>different semantic categories of the map. The system provides through two sorts of user-
</p>
<p>friendly interfaces (analyst or end-user) a complete pipeline of automatic text processing 
</p>
<p>which consists of segmentation, annotation and other post-processing functionalities. 
</p>
<p>Annotated documents can be used, for instance, for information retrieval systems, 
</p>
<p>classification or automatic summarization. 
</p>
<p>Mots-cl&#233;s : Plate-forme, Annotation automatique, Exploration Contextuelle, analyse 
s&#233;mantique, marqueurs discursifs, carte s&#233;mantique, multilinguisme. 
Keywords: Platform, automatic annotation, Contextual Exploration, semantic analysis, 
discoursive markers, Semantic Map, multilingual approach. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Motasem Alrahabi, Jean-Pierre Descl&#233;s 
</p>
<p>Quelques principes th&#233;oriques 
</p>
<p>Les outils d'annotation s&#233;mantique existants sont bas&#233;s de mani&#232;re g&#233;n&#233;rale sur deux types de 
</p>
<p>techniques : une technique &#224; base de r&#232;gles (ex. MUSE, SemTag), et une technique &#224; base 
</p>
<p>d'apprentissage (MnM, Ont-O-Mat/Amilcare&#8230;). Ces techniques n&#233;cessitent souvent une 
phase de pr&#233;traitement qui comporte une tokenisation, une analyse morpho-syntaxique, une 
</p>
<p>reconnaissance d'entit&#233;s nomm&#233;es (voir la cha&#238;ne de traitement ANNIE de Gate). Notons aussi 
</p>
<p>que l&#8223;approche &#8222;s&#233;mantique&#8223; dans ces plateformes consid&#232;re la langue comme un syst&#232;me de 
nomenclatures, &#8222;nettoy&#233;e&#8223;  des mots &#8222;vides&#8223;, et compos&#233; essentiellement de syntagmes 
nominaux. Notre approche, bas&#233;e sur la m&#233;thode de l&#8223;Exploration Contextuelle (EC) (Descl&#233;s, 
2006), consiste plut&#244;t &#224; appr&#233;hender la langue comme un syst&#232;me d&#8223;op&#233;rations portant sur des 
entit&#233;s et sur des relations entre des entit&#233;s. Ces relations sont exprim&#233;es par des pr&#233;dicats 
</p>
<p>verbaux, des pr&#233;positions, des d&#233;terminants, des adjectifs, etc. La plateforme que nous 
</p>
<p>proposons, EXCOM (EXploration COntextuelle Multilingue), offre le moyen d&#8223;annoter des 
&#8222;relations&#8223; s&#233;mantiques li&#233;es &#224; la composante discursive de la langue et qui correspondent &#224; 
des &#8222;points de vue&#8223; (pdv) de fouille (Qui a rencontr&#233; qui ?, Quelle est la cause de tel fait ?, 
Comment tel objet est-il appr&#233;ci&#233; par un tel public ? etc.) ou &#224; des pdv de mise en texte (id&#233;es 
</p>
<p>principales d&#8223;un article, conclusions, hypoth&#232;ses, r&#233;sultats etc.). Les marqueurs des pdv 
discursifs sont des unit&#233;s linguistiques observables, relativement ind&#233;pendants d&#8223;un domaine 
particulier. Ils sont analys&#233;s dans leur contexte &#224; l&#8223;aide d&#8223;un syst&#232;me de r&#232;gles linguistiques 
&#233;crites par l&#8223;analyste (linguiste ou expert du domaine). Notre technique ne se base pas sur des  
principes probabilistes ou d&#8223;apprentissage, et ne fait aucun appel &#224; des pr&#233;traitements morpho-
syntaxiques. Un pdv est mis en &#339;uvre par l'analyse et la mod&#233;lisation de besoins concrets 
d'utilisateurs, et par l'organisation des concepts et notions sous-jacents dans une &#8222;carte 
s&#233;mantique&#8223; (une ontologie). Les n&#339;uds de la carte sont interli&#233;s par diff&#233;rents types de 
relations (ex. sp&#233;cification, composition, incompatibilit&#233;, etc.). Chaque n&#339;ud de la carte 
correspond &#224; une valeur s&#233;mantique unique dont les occurrences sont repr&#233;sent&#233;es dans les 
</p>
<p>textes par des unit&#233;s linguistiques que nous appelons &#8222;indicateurs&#8223; d&#8223;un pdv. Or, un indicateur 
n&#8223;est pas toujours suffisant pour souligner de mani&#232;re biunivoque une relation s&#233;mantique 
(ambigu&#239;t&#233;, ind&#233;termination, polys&#233;mie&#8230;), d'o&#249; le besoin de recourir &#224; d'autres unit&#233;s 
compl&#233;mentaires dans le contexte, appel&#233;s &#8222;indices&#8223;. Les indicateurs et indices peuvent &#234;tre de 
toute cat&#233;gorie lexicale (verbes, noms, adverbes&#8230;). Les indices sont soit &#8222;positifs&#8223;, soit 
&#8222;n&#233;gatifs&#8223;, et peuvent ainsi, respectivement, confirmer ou infirmer la plausibilit&#233; -signal&#233;e par 
la pr&#233;sence de l&#8223;indicateur- du statut de la relation s&#233;mantique. L&#8223;analyse de textes permet de 
d&#233;crire l'agencement des indicateurs et des indices discursifs li&#233;s &#224; une cat&#233;gorie donn&#233;e par 
</p>
<p>des constructions qui ne se r&#233;duisent pas &#224; de simples sch&#233;mas syntaxiques, et de les exprimer 
</p>
<p>dans un formalisme de r&#232;gles d&#8223;EC. 
</p>
<p>Cha&#238;ne de traitements 
</p>
<p>La nouvelle version d&#8223;EXCOM (Alrahabi, Descl&#233;s 2008)1 est compos&#233;e d&#8223;un moteur 
d&#8223;annotation, connect&#233; &#224; plusieurs modules suppl&#233;mentaires de pr&#233;traitement et de post-
traitement de donn&#233;es linguistiques (les techniques utilis&#233;es sont principalement JAVA et 
</p>
<p>XML). Le pr&#233;traitement consiste &#224; segmenter le corpus trait&#233; afin d&#8223;avoir une structure 
homog&#232;ne de textes, dans laquelle sont d&#233;finis les &#8222;espaces de recherche&#8223; des unit&#233;s 
linguistiques ainsi que les espaces destin&#233;s &#224; &#234;tre annot&#233;s. Le module de segmentation permet 
</p>
<p>                                                 
1
 La premi&#232;re version d&#8223;EXCOM (Djioua et al., 2006) prend la suite des plateformes SERAPHIN et SAFIR pour 
</p>
<p>le r&#233;sum&#233; automatique et de ContextO pour la fouille de textes. Voir par exemple (Descl&#233;s, Minel, 2004). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXCOM : Plate-forme d'annotation s&#233;mantique de textes multilingues 
</p>
<p>ainsi de d&#233;finir, dans des fichiers en format de texte brut, les titres, sections, paragraphes et 
</p>
<p>segments (phrases), et de produire des fichiers XML (DTD DocBook). La segmentation prend 
</p>
<p>en compte le caract&#232;re multilingue des donn&#233;es, comme l&#8223;absence de majuscules ou d&#8223;espaces 
dans certaines langues ou le besoin de d&#233;sambigu&#239;ser certains signes polys&#233;miques, comme le 
</p>
<p>point, dans d&#8223;autres. Les textes sont ensuite annot&#233;s selon la carte s&#233;mantique du pdv trait&#233;. 
La pr&#233;sence d&#8223;un indicateur dans un espace de recherche d&#233;clenche l&#8223;ex&#233;cution des r&#232;gles 
d&#8223;EC associ&#233;es : les pr&#233;misses de la r&#232;gle sont alors v&#233;rifi&#233;es (pr&#233;sence, absence, position 
et/ou ordre des indices dans le contexte). Si toutes les conditions sont satisfaites, une 
</p>
<p>annotation est alors attribu&#233;e &#224; l&#8223;espace destin&#233; &#224; &#234;tre annot&#233;. L&#8223;annotation porte des 
informations comme le nom de la cat&#233;gorie s&#233;mantique et son positionnement dans la carte, 
</p>
<p>les coordonn&#233;es du segment annot&#233; dans le texte d&#8223;origine, etc. Le moteur d&#8223;EXCOM (Figure 
1) manipule diff&#233;rents types de r&#232;gles, en fonction du format de l&#8223;indicateur (unit&#233; 
linguistique, expression r&#233;guli&#232;re ou annotation d&#233;j&#224; attribu&#233;e) ; de l&#8223;espace de recherche 
continu ou discontinu (ex. entre titre et paragraphe suivant) et de l&#8223;espace destin&#233; &#224; &#234;tre annot&#233; 
(segment ou titre, ou bien un bloc sup&#233;rieur). Un ordre de priorit&#233; peut &#234;tre pr&#233;cis&#233; dans le 
</p>
<p>d&#233;clenchement des r&#232;gles selon leur importance. Le syst&#232;me permet, apr&#232;s l&#8223;annotation du 
corpus, de visualiser le graphe de la carte avec, sur chaque n&#339;ud, un lien vers une base 
d&#8223;annotations attribu&#233;es &#224; cette cat&#233;gorie. Un autre 
outil (en cours) permettra la recherche de mots-clefs 
</p>
<p>au sein de ces bases d&#8223;annotations. Deux types 
d&#8223;interface sont disponibles sous EXCOM : des 
interfaces d&#233;di&#233;es &#224; l&#8223;analyste qui effectue la 
construction et l&#8223;int&#233;gration des ressources 
linguistiques (marqueurs et r&#232;gles au format XML), 
</p>
<p>l&#8223;organisation de la carte et qui effectue les tests et 
&#233;valuations du syst&#232;me ; d&#8223;autre part, EXCOM peut 
&#234;tre utilis&#233; par un utilisateur &#8222;final&#8223;, qui, &#224; l&#8223;aide 
d&#8223;autres interfaces, exploite les pdv d&#233;j&#224; 
impl&#233;ment&#233;s. Celui-ci n&#8223;intervient pas dans la cha&#238;ne 
du traitement, il a juste &#224; choisir un corpus dans une 
</p>
<p>langue ou dans une autre, y lancer l&#8223;annotation en 
fonction des pdv disponibles dans le syst&#232;me, 
</p>
<p>consulter les r&#233;sultats du traitement et/ou les filtrer &#224; 
</p>
<p>l&#8223;aide de mots-cl&#233;s. Une version basique d&#8223;EXCOM 
est librement accessible &#224; l&#8223;adresse 
http://www.excom.fr/, o&#249; l&#8223;on trouve aussi des 
publications renvoyant aux diff&#233;rents pdv discursifs d&#233;velopp&#233;s dans plusieurs langues 
</p>
<p>(causalit&#233;, &#233;v&#233;nements, hypoth&#232;ses, biblios&#233;mantique, rencontres, r&#233;sum&#233;s, etc.). Notre 
</p>
<p>d&#233;monstration portera notamment sur un pdv qui consiste &#224; identifier et cat&#233;goriser les 
</p>
<p>citations en arabe, en fran&#231;ais et en cor&#233;en, selon une carte s&#233;mantique organis&#233;e autour de la 
</p>
<p>notion de prise en charge &#233;nonciative. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>DESCLES J.-P. (2006). Contextual Exploration Processing for Discourse Automatic 
</p>
<p>Annotations of Texts. Actes de FLAIRS 2006, 281-284. 
</p>
<p>ALRAHABI M., DESCLES J.-P. (2008). Automatic annotation of direct reported speech in 
</p>
<p>Arabic and French, according to semantic map of enunciative modalities. Actes de GOTAL 
</p>
<p>2008, 40-51. </p>

</div></div>
</body></html>