<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>CETLEF.fr - diagnostic automatique des erreurs de d&#233;clinaison tch&#232;que dans un outil ELAO</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>CETLEF.fr - diagnostic automatique des erreurs de d&#233;clinaison 
tch&#232;que dans un outil ELAO 
</p>
<p>Ivan &#352;milauer 
</p>
<p>INALCO, LaLIC-CERTAL, 49bis avenue de la Belle Gabrielle, 75012 Paris 
smilauer@cetlef.fr 
</p>
<p>R&#233;sum&#233; CETLEF.fr &#8211; une application Web dynamique &#8211; propose des exercices de 
d&#233;clinaison tch&#232;que avec un diagnostic automatique des erreurs. Le diagnostic a n&#233;cessit&#233; 
l'&#233;laboration d'un mod&#232;le formel sp&#233;cifique de la d&#233;clinaison contenant un classement des 
types paradigmatiques et des r&#232;gles pour la r&#233;alisation des alternances morph&#233;matiques. 
Ce mod&#232;le est employ&#233; pour l'annotation des formes requises, n&#233;cessaire pour le diagnostic, 
mais &#233;galement pour une pr&#233;sentation didactique sur la plateforme apprenant. Le diagnostic 
est effectu&#233; par comparaison d'une production erron&#233;e avec des formes hypoth&#233;tiques 
g&#233;n&#233;r&#233;es &#224; partir du radical de la forme requise et des diff&#233;rentes d&#233;sinences casuelles. S'il 
existe une correspondance, l'erreur est interpr&#233;t&#233;e d'apr&#232;s les diff&#233;rences dans les traits 
morphologiques de la forme requise et de la forme hypoth&#233;tique. La majorit&#233; des erreurs 
commises peut &#234;tre interpr&#233;t&#233;e &#224; l'aide de cette technique. 
</p>
<p>Abstract CETLEF.fr &#8211; a dynamic Web application &#8211; contains fill-in-the-blank exercises 
on Czech declension with an automatic error diagnosis. The diagnosis rendered necessary 
the definition of a specific formal model of nominal inflection containing a classification of 
the paradigms and the rules for the realization of morphemic alternations. This model has 
been employed for the morphological annotation of required forms, necessary for the error 
diagnosis as well as for a didactic presentation on the learning platform. Diagnosis is carried 
out by the comparison of an erroneous production with hypothetical forms generated from 
the radical of the required form and various haphazard endings. If a correspondence is found, 
the error is interpreted according to the differences in the morphological features of the 
required form and the hypothetical form. The majority of errors can be interpreted with the 
aid of this technique. 
</p>
<p>Mots-cl&#233;s : morphologie flexionnelle, d&#233;clinaison tch&#232;que, acquisition d'une langue 
&#233;trang&#232;re, diagnostic des erreurs et feedback, ELAO 
Keywords: inflectional morphology, Czech declension, second language acquisition, 
error diagnosis and feedback, CALL 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ivan &#352;milauer 
 
</p>
<p>1 Erreur de d&#233;clinaison sur CETLEF.fr 
CETLEF.fr1 est un outil d'enseignement de langue assist&#233; par ordinateur (ELAO) proposant 
des exercices de d&#233;clinaison tch&#232;que : la t&#226;che de l&#8217;apprenant est de cr&#233;er la forme fl&#233;chie 
d&#8217;un lemme en fonction de son contexte syntaxique au sein d'une proposition donn&#233;e. Une 
erreur commise dans une telle t&#226;che est appel&#233;e erreur de d&#233;clinaison. Notre objectif a &#233;t&#233; de 
concevoir un diagnostic des productions erron&#233;es issues de ces exercices.  
</p>
<p>Une erreur de d&#233;clinaison est consid&#233;r&#233;e non pas comme un ph&#233;nom&#232;ne al&#233;atoire mais 
comme le r&#233;sultat d'une activit&#233; succombant &#224; des r&#232;gles d'ordre linguistique et cognitif. Dans 
la perspective de la linguistique contrastive, les erreurs de d&#233;clinaison peuvent &#234;tre expliqu&#233;es 
par la comparaison du syst&#232;me nominal tch&#232;que et fran&#231;ais : la d&#233;clinaison repr&#233;sente pour 
tout apprenant francophone une sorte d'idiosyncrasie et elle est in&#233;vitablement une source 
d'erreurs.  
</p>
<p>L'hypoth&#232;se sous-jacente au diagnostic des erreurs est que les erreurs de d&#233;clinaison sont 
calculables : une forme erron&#233;e peut &#234;tre g&#233;n&#233;r&#233;e &#224; partir du lemme de la forme requise 
au sein d&#8217;une t&#226;che &#224; l'aide des op&#233;rations d&#8217;ordre linguistique. Ainsi, pour le diagnostic d&#8217;une 
forme erron&#233;e, nous proposons de prendre en compte une d&#233;faillance dans une ou plusieurs 
des op&#233;rations suivantes : (1) choix des valeurs de la cat&#233;gorie du cas, du nombre et du genre ; 
(2) classement du lex&#232;me dans le paradigme appropri&#233; et le choix de la d&#233;sinence 
correspondante aux valeurs des cat&#233;gories grammaticales ; (3) r&#233;alisation des alternances 
vocaliques et consonantiques. 
</p>
<p>2 Diagnostic des erreurs 
Les diff&#233;rentes mod&#233;lisations de la d&#233;clinaison tch&#232;que impl&#233;ment&#233;es dans des applications 
de TAL existantes, cf. par exemple (Haji&#269;, 2004), ne correspondaient pas &#224; notre objectif 
&#224; cause d&#8217;une orientation fonctionnelle sur un traitement informatique qui ne prenait pas en 
compte le processus &#171; cognitif &#187; de g&#233;n&#233;ration des formes casuelles envisag&#233; par un humain. 
Nous avons donc &#233;labor&#233; un mod&#232;le formel contenant un classement des paradigmes, d&#233;finis 
uniquement par les ensembles de morph&#232;mes, et les r&#232;gles pour la r&#233;alisation des alternances 
en fonction des propri&#233;t&#233;s morph&#233;matiques et phono-graph&#233;miques du radical et de la 
d&#233;sinence. Ce mod&#232;le sert comme la base d'une annotation sp&#233;cifiant la cat&#233;gorie lexicale, les 
cat&#233;gories morphologiques, les types paradigmatiques de d&#233;clinaison et les alternances 
&#224; r&#233;aliser pour chaque forme requise. L&#8217;annotation, attribu&#233;e &#224; l&#8217;aide d&#8217;un &#233;tiqueteur 
rudimentaire, est &#233;galement utilis&#233;e pour une pr&#233;sentation didactique sur la plateforme 
apprenant.  
</p>
<p>Au cours du traitement automatique, l'annotation de chaque forme requise est repr&#233;sent&#233;e par 
une structure de traits. Pour chaque forme requise, un ensemble de formes hypoth&#233;tiques, qui 
pourraient &#234;tre produites par un apprenant, est g&#233;n&#233;r&#233; &#224; partir de son lemme. Il s'agit : (1) des 
formes casuelles exprimant d'autres valeurs des cat&#233;gories grammaticales que celles 
                                                
1  Conna&#238;tre, Comprendre, Corriger les Erreurs en Tch&#232;que Langue &#201;trang&#232;re pour les Francophones, 
</p>
<p>disponible sur http://www.cetlef.fr. Pour plus de d&#233;tails voir (&#352;milauer, 2008). Les moyens techniques 
employ&#233;s sont PhP, MySQL, Javascript, HTML et XML. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CETLEF.fr - diagnostic automatique des erreurs de d&#233;clinaison tch&#232;que dans un outil ELAO 
</p>
<p>demand&#233;es dans la forme requise, (2) des formes qui sont le r&#233;sultat de la combinaison du 
radical avec une d&#233;sinence qui n'appartient pas &#224; son paradigme et (3) les formes sans la 
r&#233;alisation des alternances vocaliques ou consonantiques obligatoires.  
</p>
<p>&#192; chacune de ces formes hypoth&#233;tiques peut &#234;tre assign&#233;e au moins une structure de traits 
(son interpr&#233;tation). Une production erron&#233;e peut avoir une interpr&#233;tation morphologique si 
elle correspond au moins &#224; une des formes hypoth&#233;tiques g&#233;n&#233;r&#233;es pour le lemme de la forme 
requise donn&#233;e. Les attributs communs portant des valeurs diff&#233;rentes dans les structures des 
deux formes servent pour la d&#233;finition du type d'erreur. 
</p>
<p>L'ensemble des diff&#233;rentes interpr&#233;tations morphologiques d'une production erron&#233;e est 
d&#233;termin&#233; par l'homonymie des formes casuelles existantes, mais &#233;galement par toutes les 
combinaisons du radical et des d&#233;sinences, appartenant m&#234;me aux autres paradigmes, ainsi 
que par la r&#233;alisation ou non des alternances &#233;ventuelles. Le filtrage des diff&#233;rentes 
interpr&#233;tations (seulement deux interpr&#233;tations sont retenues pour le feedback destin&#233; &#224; 
l'apprenant) est effectu&#233; &#224; l'aide des r&#232;gles qui d&#233;terminent la priorit&#233; entre les diff&#233;rentes 
interpr&#233;tations : par exemple, interpr&#233;ter une production en tant qu'une erreur de nombre est 
consid&#233;r&#233; comme plus pertinent qu'une erreur de cas. 
</p>
<p>3 &#201;valuation et application de CETLEF.fr 
Une &#233;tude visant &#224; tester l'efficacit&#233; du diagnostic avec des productions authentiques 
recueillies depuis juin 2008 a approuv&#233;e notre hypoth&#232;se de d&#233;part : environ 85 % des erreurs 
peuvent &#234;tre diagnostiqu&#233;es par un calcul morphologique comme une combinaison illicite du 
radical de la forme requise et d'une d&#233;sinence.  
</p>
<p>CETLEF.fr illustre les possibilit&#233;s d'un riche mod&#232;le morphologique et des techniques de 
TAL employ&#233;es dans un outil d'enseignement de langue assist&#233; par ordinateur &#8211; une approche 
pr&#233;conis&#233;e notamment par (Heift &amp; Schulze, 2007). Dans une perspective p&#233;dagogique, un 
feedback personnalis&#233; bas&#233; sur le diagnostic permet d'attirer l'attention des apprenants sur les 
&#233;l&#233;ments probl&#233;matiques. 
</p>
<p>Du point de vue d'une recherche sur l'acquisition de langue &#233;trang&#232;re, CETLEF.fr sert comme 
un outil pour la compilation d'un corpus d'erreurs. Par rapport aux productions libres, 
l&#8217;analyse des erreurs recueillies au sein des exercices grammaticaux permet un meilleur 
contr&#244;le sur le volume de donn&#233;es pertinentes, car les productions doivent n&#233;cessairement 
contenir les ph&#233;nom&#232;nes qui ont &#233;t&#233; &#233;tablis comme l'objet de l'investigation. L'annotation 
morphologique et la typologie formelle des erreurs facilitent cette analyse. 
</p>
<p>R&#233;f&#233;rences  
HAJI&#268; J. (2004). Disambiguation of Rich Inflection. Computational Morphology of Czech. 
Prague : Karolinum.  
</p>
<p>HEIFT T. &amp; SCHULZE M. (2007). Errors and Intelligence in Computer-Assisted Language 
Learning : Parsers and Pedagogues. UK : Routledge.  
</p>
<p>&#352;MILAUER I. (2008). Acquisition du tch&#232;que par les francophones : analyse automatique des 
erreurs de d&#233;clinaison. The Prague Bulletin of Mathematical Linguistics 90, 33-56. </p>

</div></div>
</body></html>