<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Int&#233;grer les tables du Lexique-Grammaire &#224; un analyseur syntaxique robuste &#224; grande &#233;chelle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Int&#233;grer les tables du Lexique-Grammaire
&#224; un analyseur syntaxique robuste &#224; grande &#233;chelle
</p>
<p>Beno&#238;t Sagot1 Elsa Tolone2
</p>
<p>(1) Alpage, INRIA / Paris 7, 30 rue du Ch. des rentiers, 75013 Paris, France
(2) IGM, Universit&#233; Paris-Est, 77454 Marne-la-Vall&#233;e Cedex, France
</p>
<p>benoit.sagot@inria.fr, elsa.tolone@univ-paris-est.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous montrons comment nous avons converti les tables du
Lexique-Grammaire en un format TAL, celui du lexique Lefff, permettant ainsi son int&#233;gration
dans l&#8217;analyseur syntaxique FRMG. Nous pr&#233;sentons les fondements linguistiques de ce proces-
sus de conversion et le lexique obtenu. Nous validons le lexique obtenu en &#233;valuant l&#8217;analyseur
syntaxique FRMG sur le corpus de r&#233;f&#233;rence de la campagne EASy selon qu&#8217;il utilise les entr&#233;es
verbales du Lefff ou celles des tables des verbes du Lexique-Grammaire ainsi converties.
</p>
<p>Abstract. In this paper, we describe how we converted the lexicon-grammar tables into
an NLP format, that of the Lefff lexicon, which allowed us to integrate it into the FRMG parser.
We decribe the linguistic basis of this conversion process, and the resulting lexicon. We validate
the resulting lexicon by evaluating the FRMG parser on the EASy reference corpus depending
on the set of verbal entries it relies on, namely those of the Lefff or those of the converted
lexicon-grammar verb tables.
</p>
<p>Mots-cl&#233;s : Lexiques syntaxiques, Lexique-Grammaire, analyse syntaxique.
</p>
<p>Keywords: Syntactic lexica, Lexicon-Grammar, parsing.
</p>
<p>1 Introduction
</p>
<p>Les tables du Lexique-Grammaire constituent aujourd&#8217;hui une des principales sources d&#8217;infor-
mations lexicales syntaxiques pour le fran&#231;ais. Leur d&#233;veloppement a &#233;t&#233; initi&#233; d&#232;s les ann&#233;es
1970 par Maurice Gross, au sein du LADL puis de l&#8217;IGM (Universit&#233; Paris-Est) (Gross, 1975;
Boons et al., 1976; Guillet &amp; Lecl&#232;re, 1992). Ces informations se pr&#233;sentent sous la forme de
tables. Chaque table regroupe les &#233;l&#233;ments d&#8217;une cat&#233;gorie donn&#233;e partageant certaines pro-
pri&#233;t&#233;s d&#233;finitoires, qui rel&#232;vent g&#233;n&#233;ralement de la sous-cat&#233;gorisation. Ces &#233;l&#233;ments forment
une classe. Une table se pr&#233;sente sous forme de matrice : en lignes, les &#233;l&#233;ments lexicaux de
la classe correspondante ; en colonnes, les propri&#233;t&#233;s qui ne sont pas forc&#233;ment respect&#233;es par
tous les &#233;l&#233;ments de la classe ; &#224; la crois&#233;e d&#8217;une ligne et d&#8217;une colonne le signe + ou &#8722; selon
que l&#8217;entr&#233;e lexicale d&#233;crite par la ligne accepte ou non la propri&#233;t&#233; d&#233;crite par la colonne.
</p>
<p>Les tables actuelles souffrent de diverses formes d&#8217;incoh&#233;rence et d&#8217;incompl&#233;tude. En particu-
lier, les propri&#233;t&#233;s d&#233;finitoires ne sont pas repr&#233;sent&#233;es dans les tables1. Pour y rem&#233;dier, des
</p>
<p>1Ceci a &#233;galement motiv&#233; les travaux de (Gardent et al., 2005). Nous renvoyons &#224; (Constant &amp; Tolone, 2008)
pour une comparaison entre la version texte des tables, utilis&#233;e ici, et le travail pr&#233;sent&#233; par (Gardent et al., 2005).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Elsa Tolone
</p>
<p>tables des classes sont en d&#233;veloppement &#224; l&#8217;IGM pour chaque cat&#233;gorie, qui associent &#224; chaque
classe l&#8217;ensemble de ses propri&#233;t&#233;s d&#233;finitoires (Paumier, 2003). C&#8217;est en particulier le cas des
verbes simples, pour lesquels une table des classes est d&#233;velopp&#233;e actuellement, en compl&#233;ment
des 61 tables correspondantes.
</p>
<p>Les r&#233;sultats pr&#233;liminaires de ce travail de fond nous ont permis d&#8217;envisager l&#8217;utilisation des
tables du Lexique-Grammaire des verbes simples dans un analyseur syntaxique &#224; grande &#233;chelle,
l&#8217;analyseur FRMG (Thomasset &amp; de la Clergerie, 2005). Mais une telle int&#233;gration suppose
d&#8217;interpr&#233;ter et de convertir les concepts linguistiques et les donn&#233;es lexicales des tables du
Lexique-Grammaire dans le formalisme lexical utilis&#233; par FRMG, celui du lexique syntaxique
Lefff (Sagot et al., 2006). C&#8217;est ce travail que nous d&#233;crivons dans cet article. Le r&#233;sultat en est
un lexique au format Lefff encodant aussi bien que possible les donn&#233;es lexicales des tables.
Nous validons notre processus de conversion par l&#8217;&#233;valuation pr&#233;liminaire des performances de
FRMG lorsqu&#8217;il est coupl&#233; &#224; ce lexique.
</p>
<p>L&#8217;article est organis&#233; comme suit. La section 2 d&#233;crit le lexique lglex construit gr&#226;ce &#224; la table
des classes des verbes &#224; partir des diff&#233;rentes tables. La section 3 d&#233;crit le format du lexique syn-
taxique Lefff. La section 4 pr&#233;sente les fondements linguistiques et la m&#233;thodologie pratique de
conversion de lglex au format Lefff et le lexique obtenu. La section 5 compare les performances
de l&#8217;analyseur FRMG selon qu&#8217;il utilise les entr&#233;es verbales du Lefff ou de lglex.
</p>
<p>2 Le lexique verbal lglex
</p>
<p>Une table des classes regroupe en colonnes l&#8217;ensemble de toutes les propri&#233;t&#233;s syntaxiques
r&#233;pertori&#233;es pour la cat&#233;gorie concern&#233;e, et liste en lignes l&#8217;ensemble des classes d&#233;finies pour
cette m&#234;me cat&#233;gorie. &#192; l&#8217;intersection d&#8217;une ligne et d&#8217;une colonne, le symbole + (resp. &#8722;)
indique que la propri&#233;t&#233; correspondante est v&#233;rifi&#233;e (resp. non v&#233;rifi&#233;e) par tous les &#233;l&#233;ments de
la classe (c&#8217;est-&#224;-dire par toutes les entr&#233;es de la table correspondante). Le symbole o indique
que la propri&#233;t&#233; est explicitement cod&#233;e dans la table concern&#233;e, car elle est v&#233;rifi&#233;e par certaines
de ses entr&#233;es mais pas toutes. Enfin, le symbole ? indique une cellule non encore renseign&#233;e.
</p>
<p>Le d&#233;veloppement de la table des classes des verbes est bien avanc&#233; (Constant &amp; Tolone, 2008).
Toutes les propri&#233;t&#233;s d&#233;finitoires des classes de verbes y ont &#233;t&#233; cod&#233;es, par des + et des &#8722;,
rendant ainsi explicites les informations sous-entendues dans les tables elles-m&#234;mes. Toutes les
cellules correspondant aux propri&#233;t&#233;s cod&#233;es dans les tables sont cod&#233;es o. Seules les propri&#233;t&#233;s
encore non &#233;tudi&#233;es pour certaines classes de verbes peuvent faire l&#8217;objet d&#8217;un codage par ?.
</p>
<p>Gr&#226;ce &#224; ces travaux de mise en coh&#233;rence et d&#8217;explicitation des propri&#233;t&#233;s syntaxiques des
verbes dans les tables du Lexique-Grammaire, il a &#233;t&#233; possible de construire une version struc-
tur&#233;e des tables du Lexique-Grammaire, disponible en un format textuel et en un format XML,
et appel&#233; lexique lglex (Constant &amp; Tolone, 2008)2. La sous-partie de ce lexique qui reproduit
les entr&#233;es verbales des tables librement distribu&#233;es est elle-m&#234;me librement distribu&#233;e3.
</p>
<p>La construction de lglex repose sur l&#8217;outil LGExtract, qui prend en entr&#233;e les tables d&#8217;une
cat&#233;gorie donn&#233;e, la table des classes de cette cat&#233;gorie, et un fichier de configuration. Ce fichier
</p>
<p>2Certains des probl&#232;mes ainsi r&#233;solus ont d&#8217;ailleurs &#233;t&#233; d&#233;tect&#233;s gr&#226;ce &#224; l&#8217;exploitation de lglex au cours du
travail d&#233;crit ici.
</p>
<p>3Distribution partielle sous license LGPL-LR &#224; l&#8217;adresse http://infolingu.univ-mlv.fr, Donn&#233;es
Linguistiques &gt; Lexique-Grammaire &gt; Visualisation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;grer les tables du Lexique-Grammaire &#224; un analyseur syntaxique
</p>
<p>d&#233;finit comment chaque propri&#233;t&#233; (issue de la table des classes ou, dans le cas de propri&#233;t&#233;s qui
y sont cod&#233;es o, de la table correspondante) contribue &#224; la construction de l&#8217;entr&#233;e lglex.
</p>
<p>Dans le lexique lglex, les informations syntaxiques sont repr&#233;sent&#233;es de fa&#231;on partiellement
formalis&#233;e. Dans sa version textuelle, une entr&#233;e de lglex se pr&#233;sente comme suit :
&#8211; l&#8217;entr&#233;e commence par un identifiant indiquant sa cat&#233;gorie, la table dont il provient et le
num&#233;ro de l&#8217;entr&#233;e dans cette table ;
</p>
<p>&#8211; la section lexical-info indique les informations lexicales li&#233;es &#224; l&#8217;entr&#233;e : lemme, mais &#233;gale-
ment auxiliaire(s) et pr&#233;positions associ&#233;es &#224; certains arguments ; les pr&#233;positions possibles
&#224; la place de l&#8217;indication Pr&#233;p (resp. Loc) sont dans la partie pr&#233;positions (resp. locs) ;
</p>
<p>&#8211; la section args d&#233;crit les distributions des diff&#233;rents arguments (sujet et compl&#233;ments, r&#233;partis
en sous-sections const dont la position est rep&#233;r&#233;e par l&#8217;&#233;l&#233;ment pos) ; une distribution donn&#233;e
(&#233;l&#233;ment comp) indique sa cat&#233;gorie grammaticale (comp pour une compl&#233;tive, NP pour
un syntagme nominal, etc.), son introducteur (&#233;l&#233;ment introd-prep ou introd-loc), des traits
s&#233;mantiques (hum, nothum, et d&#8217;autres), des traits compl&#233;mentaires (mood dans le cas d&#8217;une
compl&#233;tive, etc), et l&#8217;intitul&#233; complet des colonnes ayant contribu&#233; &#224; d&#233;finir cette distribution,
qui sont toutes de la forme argument = : r&#233;alisation ; cette section est donc bien formalis&#233;e ;
</p>
<p>&#8211; la section all-constructions liste diff&#233;rentes constructions dans lesquelles l&#8217;entr&#233;e peut prendre
part ; ces constructions sont r&#233;parties en constructions absolues (&#233;l&#233;ment absolute), qui sont
nomm&#233;es de fa&#231;on compl&#232;te (p.ex. N0 V N1), et constructions relatives (&#233;l&#233;ment relative)
qui sont des noms de redistributions (p.ex. [passif par]) ; les constructions cod&#233;es + dans la
table des classes sont pr&#233;c&#233;d&#233;es de la mention true::, les autres sont pr&#233;c&#233;d&#233;es de la mention
o:: ; cette section est donc bien moins bien formalis&#233;e que la pr&#233;c&#233;dente, et les informations
qu&#8217;elle contient ne sont pas directement exploitables informatiquement.
</p>
<p>&#8211; la section exemple illustre l&#8217;entr&#233;e.
&#192; titre d&#8217;exemple, voici au format lglex l&#8217;entr&#233;e du verbe ruisseler dans la table 35L.
ID=V_35L_242
lexical-info=[locs=(loc=[id=&quot;1&quot;,list=()],loc=[id=&quot;2&quot;,list=()]),cat=&quot;verb&quot;,verb=[lemma=&quot;ruisseler&quot;],
</p>
<p>aux-list=(),prepositions=()]
args=(
</p>
<p>const=[dist=(comp=[cat=&quot;NP&quot;,source=&quot;true&quot;,introd-prep=(),origine=(orig=&quot;Loc N1 =: de N1 source&quot;),
introd-loc=(prep=&quot;de&quot;)]),pos=&quot;1&quot;],
</p>
<p>const=[dist=(comp=[cat=&quot;NP&quot;,introd-prep=(),origine=(orig=&quot;Loc N2 =: vers N2 destination&quot;,
orig=&quot;Loc N2 =: dans N2 destination&quot;),introd-loc=(prep=&quot;vers&quot;,prep=&quot;dans&quot;),destination=&quot;true&quot;]),pos=&quot;2&quot;],
</p>
<p>const=[pos=&quot;0&quot;,dist=(comp=[cat=&quot;NP&quot;,introd-prep=(),nothum=&quot;true&quot;,origine=(orig=&quot;N0 =: N-hum&quot;),
introd-loc=()])])
</p>
<p>all-constructions=[absolute=(construction=&quot;o::N0 V Loc N1 source Loc N2 destination&quot;,construction=&quot;o::N0 V&quot;,
construction=&quot;o::N0 &#234;tre V-ant&quot;,construction=&quot;true::N0 V Loc N1&quot;),
relative=(construction=&quot;Ppv =: y&quot;,construction=&quot;Ppv =: en&quot;,construction=&quot;[extrap]&quot;)]
</p>
<p>example=[example=&quot;L&#8217;eau ruisselle de la goutti&#232;re sur les passants&quot;]
</p>
<p>3 Le Lefff et le format Alexina
</p>
<p>Le Lefff (Lexique des formes fl&#233;chies du fran&#231;ais) est un lexique syntaxique &#224; large couverture
pour le fran&#231;ais librement distribu&#233; (Sagot et al., 2006; Sagot &amp; Danlos, 2007)4.
</p>
<p>4Distribution sous license LGPL-LR &#224; l&#8217;adresse http://gforge.inria.fr/projects/alexina/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Elsa Tolone
</p>
<p>Il repose sur l&#8217;architecture Alexina d&#8217;acquisition et de mod&#233;lisation de lexiques morphologiques
et syntaxiques. Un lexique intensionnel associe &#224; chaque entr&#233;e un cadre de sous-cat&#233;gorisation
canonique et liste les redistributions possibles &#224; partir de ce cadre. La compilation du lexique in-
tensionnel en lexique extensionnel construit alors diff&#233;rentes entr&#233;es pour chaque forme fl&#233;chie
du lemme et chaque redistribution possible. Soit l&#8217;entr&#233;e intensionnelle simplifi&#233;e suivante :
clarifier1 Lemma;v;&lt;arg0:Suj:cln|scompl|sinf|sn,arg1:Obj:(cla|scompl|sn)&gt;;
</p>
<p>%ppp_employ&#233;_comme_adj,%actif,%se_moyen_impersonnel,
%passif_impersonnel,%passif
</p>
<p>Elle d&#233;crit une entr&#233;e du lemme verbal clarifier, qui est transitive directe (deux arguments r&#233;a-
lis&#233;s canoniquement par les fonctions syntaxiques Suj et Obj d&#233;crites entre les chevrons), et qui
admet les redistributions fonctionnelles (pr&#233;fix&#233;es par le symbole %) participe pass&#233; employ&#233;
comme adjectif, actif (la distribution par d&#233;faut), se moyen impersonnel (il s&#8217;est clarifi&#233; de nom-
breuses choses &#224; cette r&#233;union), passif impersonnel (il a &#233;t&#233; clarifi&#233; par Pierre que Luc &#233;tait le
coupable), et passif. &#192; titre d&#8217;exemple, l&#8217;entr&#233;e extensionnelle pour la forme fl&#233;chie clarifi&#233;s et
la redistribution passif a la forme (simplifi&#233;e) suivante :
clarifi&#233;s v [pred=&#8217;clarifier1&lt;arg1:Suj:cln|scompl|sn,arg0:Obl2:(par-sn)&gt;&#8217;,
</p>
<p>@passive,@pers,@Kmp]; %passif
</p>
<p>Les fonctions syntaxiques sont d&#233;finies dans le Lefff par des crit&#232;res proches de ceux de DI-
COVALENCE (Van den Eynde &amp; Mertens, 2006). L&#8217;inventaire des fonctions syntaxiques est le
suivant : Suj (sujet), Obj (objet direct), Obj&#224; (objet indirect introduit canoniquement par la pr&#233;-
position &#224;), Objde (objet indirect introduit canoniquement par la pr&#233;position de), Loc (locatif),
Dloc (d&#233;locatif), Att (attribut), Obl ou Obl2 (autres arguments obliques). Les crit&#232;res d&#233;fini-
toires de ces fonctions sont d&#233;crits dans (Sagot &amp; Danlos, 2007).
</p>
<p>Chaque fonction syntaxique peut &#234;tre r&#233;alis&#233;e par trois types de r&#233;alisations : pronoms clitiques,
syntagme direct (syntagme nominal (sn), adjectival (sa), infinitif (sinf), phrastique fini (scompl),
interrogative indirecte (qcompl)) et syntagme pr&#233;positionnel (syntagme direct pr&#233;c&#233;d&#233; d&#8217;une
pr&#233;position, comme de-sn, &#224;-sinf ou pour-sa5. Enfin, une fonction dont la r&#233;alisation est facul-
tative voit sa liste de r&#233;alisations possibles mise entre parenth&#232;ses.
</p>
<p>Des informations syntaxiques compl&#233;mentaires (contr&#244;le, mode des compl&#233;tives, etc.) sont no-
t&#233;es par des macros (@CtrlSujObj, @ComplSubj, etc.) dont l&#8217;interpr&#233;tation formalis&#233;e d&#233;pend
du contexte d&#8217;utilisation. Une mod&#233;lisation de ces macros en LFG est fournie avec le Lefff.
</p>
<p>4 Conversion des tables de verbes simples au format Lefff
</p>
<p>4.1 D&#233;coupage en entr&#233;es : la construction de base et ses variantes
</p>
<p>Chaque entr&#233;e de lglex est associ&#233;e &#224; des constructions dont on peut distinguer plusieurs types :
</p>
<p>1. la (ou les) construction(s) dites &#171; de base &#187;, c&#8217;est-&#224;-dire d&#233;finitoires de la classe d&#8217;origine
de l&#8217;entr&#233;e ; elles sont identifi&#233;es dans le format lglex par la mention true:: ;
</p>
<p>2. les constructions &#171; de base &#233;tendues &#187;, obtenues par adjonction d&#8217;arguments &#224; la construc-
tion de base6 ; nous faisons l&#8217;hypoth&#232;se (v&#233;rifi&#233;e en pratique) que ces constructions sont
</p>
<p>5&#224;-scompl et de-scompl repr&#233;sentent les r&#233;alisations en &#224;/de ce que P.
6La situation est en r&#233;alit&#233; plus complexe. En effet, certains de ces arguments suppl&#233;mentaires ne prennent part
</p>
<p>&#224; aucune des constructions, et ne sont connues que par leur description dans la section args de l&#8217;entr&#233;e. Nous les</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;grer les tables du Lexique-Grammaire &#224; un analyseur syntaxique
</p>
<p>toutes des interm&#233;diaires entre la construction de base et une construction dite &#171; de base
maximalement &#233;tendue &#187; ou CBME ; par exemple, l&#8217;entr&#233;e de rassembler dans la table
32PL (Max a rassembl&#233; ses articles (dans un ouvrage)) a pour construction de base la
construction transitive simple N0 V N1, mais la possibilit&#233; d&#8217;ajouter un compl&#233;ment en
Loc N2 conduit &#224; une CBME de la forme N0 V N1 Loc N2 ;
</p>
<p>3. les constructions qui sont des variantes de la construction de base, obtenues par efface-
ment d&#8217;un ou de plusieurs arguments ou par changement de type de r&#233;alisation (Qu P
devenant Viinf W, par exemple) ;
</p>
<p>4. les constructions qui sont en r&#233;alit&#233; des redistributions (constructions relatives telles que
[passif de], constructions absolues de type N1 est Vpp de ce Qu P) ;
</p>
<p>5. les constructions dont il semble qu&#8217;elles auraient d&#251; conduire &#224; des entr&#233;es distinctes,
dites &#171; entr&#233;es secondaires &#187;, telles que les constructions neutres ou les transformations
de type N1 se V de ce Qu P (cf. Luc se f&#233;licite d&#8217;avoir r&#233;ussi &#224; s&#233;duire L&#233;a vs. Max
f&#233;licite Luc qu&#8217;il ait r&#233;ussi &#224; s&#233;duire L&#233;a).
</p>
<p>De par leur origine, les informations pr&#233;sentes dans la section args d&#8217;une entr&#233;e lglex participent
&#224; la d&#233;finition de constructions qui sont des variantes de la construction de base, &#233;tendue ou non
(cas 2 et 3). Pour identifier les entr&#233;es au format Lefff &#224; cr&#233;er &#224; partir d&#8217;une entr&#233;e lglex, il faut
donc identifier, parmi les constructions list&#233;es dans la section all-constructions, la construction
de base maximalement &#233;tendue (CBME), ainsi que les constructions qui rel&#232;vent du cas 5.
</p>
<p>Nous avons d&#233;velopp&#233; une m&#233;thode permettant d&#8217;aligner deux constructions, c&#8217;est-&#224;-dire de
construire des correspondances entre arguments, malgr&#233; leurs diff&#233;rences de surface7 et leur
possible effacement. Cette m&#233;thode nous permet d&#8217;identifier et d&#8217;aligner la CBME et ses va-
riantes, rassembl&#233;es pour former une entr&#233;e unique du lexique final, dite entr&#233;e canonique8.
Pour chaque variante, nous construisons une s&#233;quence d&#8217;op&#233;rations &#233;l&#233;mentaires permettant de
la reconstituer &#224; partir de la CBME. Ces op&#233;rations permettront de construire, pour chaque
argument, la liste de ses r&#233;alisations possibles, et de d&#233;terminer si elles sont effa&#231;ables.
</p>
<p>Parmi les autres constructions (qui ne sont donc pas des variantes de la CBME), celles qui
correspondent &#224; des redistributions standard ([passif par], [extrap]. . .) induisent l&#8217;ajout &#224; l&#8217;entr&#233;e
finale de la redistribution correspondante. Les autres induisent la cr&#233;ation d&#8217;entr&#233;es distinctes
dites secondaires, qu&#8217;elles rel&#232;vent du cas 5 ou qu&#8217;elles correspondent &#224; des redistributions non
encore r&#233;pertori&#233;es par le format Alexina.
</p>
<p>Reprenons l&#8217;exemple ci-dessus. L&#8217;entr&#233;e indique les constructions suivantes :
all-constructions=[absolute=(construction=&quot;o::N0 V Loc N1 source Loc N2 destination&quot;,construction=&quot;o::N0 V&quot;,
</p>
<p>construction=&quot;o::N0 &#234;tre V-ant&quot;,construction=&quot;true::N0 V Loc N1&quot;),
relative=(construction=&quot;Ppv =: y&quot;,construction=&quot;Ppv =: en&quot;,construction=&quot;[extrap]&quot;)]
</p>
<p>La construction de base est donc N0 V Loc N1 (cas 1). La construction N0 V Loc N1 source
Loc N2 destination en &#233;tant l&#8217;unique extension, il s&#8217;agit de la CBME (cas 2). Les indications
s&#233;mantiques de type source et destination &#233;tant ignor&#233;es, la construction de base devient une
variante de la CBME, par effacement de l&#8217;argument 2. La construction N0 V est &#233;galement
identifi&#233;e comme une variante de la CBME, par double effacement (cas 3). La construction
</p>
<p>prenons en compte correctement.
7Par exemple,Qu P vs.N1, ou encore &#224; N1 vs. Pr&#233;p N1 si l&#8217;on sait par ailleurs, gr&#226;ce &#224; la section lexical-info
</p>
<p>ou &#224; la distribution concern&#233;e, que la Pr&#233;p peut &#234;tre &#224;.
8&#192; l&#8217;exception de certaines constructions relatives, telles que Ppv = : y, pour lesquelles la description de la
</p>
<p>variante correspondante est obtenue directement.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Elsa Tolone
</p>
<p>N0 &#234;tre V-ant est laiss&#233;e de c&#244;t&#233; pour l&#8217;instant. Du c&#244;t&#233; des constructions relatives, on trouve
la construction Ppv = : y (resp. Ppv = : en) qui permettra d&#8217;ajouter y (resp. en) &#224; la liste des
r&#233;alisations de l&#8217;argument locatif (resp. d&#233;locatif) (cas 3). Enfin, la construction [extrap] induira
l&#8217;adjonction d&#8217;une redistribution impersonnelle (%actif_impersonnel) &#224; l&#8217;entr&#233;e (cas 4).
</p>
<p>4.2 Construction des cadres de sous-cat&#233;gorisation
</p>
<p>Une fois r&#233;pertori&#233;es les entr&#233;es &#224; produire, les cadres de sous-cat&#233;gorisation sont construits.
Pour cela, on calcule d&#8217;abord le cadre correspondant &#224; la construction maximale de chaque
entr&#233;e (la CBME pour l&#8217;entr&#233;e canonique, ou l&#8217;unique construction des entr&#233;es secondaires).
</p>
<p>La fonction syntaxique de chaque argument est d&#233;termin&#233;e au moyen d&#8217;heuristiques, ainsi que
sa r&#233;alisation canonique. Les fonctions syntaxiques sont obtenues de la fa&#231;on suivante. Tout
d&#8217;abord, le premier argument re&#231;oit toujours la fonction Suj9. Le premier argument post-verbal,
s&#8217;il est direct, se voit attribuer la fonction Obj, sauf pour les entr&#233;es de la table 32NM10. Ensuite,
un argument introduit par &#224; (resp. de) re&#231;oit la fonction syntaxique Obj&#224; (resp. Objde), sauf si un
indice compl&#233;mentaire vient contredire ce choix (par exemple, pour un argument N1 introduit
par &#224;, la propri&#233;t&#233; &#224; N1 = Ppv = : le lui conf&#232;rera fonction syntaxique Obj, ex. : Il apprend &#224;
conduire / Il l&#8217;apprend). Les arguments introduits par Loc ont la fonction syntaxique Loc, sauf
ceux de la forme Loc Ni source ou v&#233;rifiant Loc Ni = : de Ni source, qui ont la fonction
syntaxique Dloc. Enfin, les autres arguments sont consid&#233;r&#233;s comme des Att s&#8217;ils sont directs,
et comme des Obl s&#8217;ils sont introduits par une pr&#233;position (Obl2 si un Obl existe d&#233;j&#224;).
</p>
<p>Les r&#233;alisations de ces fonctions sont construites en deux temps. Tout d&#8217;abord, le type de syn-
tagme (nominal, infinitif, phrastique,. . .) est d&#233;termin&#233;. Par exemple, la r&#233;alisation scompl cor-
respond aux distributions de cat&#233;gorie comp et ceComp et aux arguments dans les constructions
en Qu P. Ceci &#233;tant fait, il reste &#224; lister les introducteurs possibles11. Nous ne rentrerons pas
dans les d&#233;tails, mais l&#8217;ensemble des pr&#233;positions et autres introducteurs (p.ex. et) sont pris en
compte. Le r&#233;sulat de ces heuristiques est le cadre de sous-cat&#233;gorisation au format Lefff pour
la construction maximale de l&#8217;entr&#233;e. Ainsi, la CBME de l&#8217;exemple pr&#233;c&#233;dent devient
&lt;Suj:sn|cln,Dloc:sn,Loc:sn&gt;.
</p>
<p>L&#8217;entr&#233;e canonique doit alors &#234;tre compl&#233;t&#233;e pour inclure les variantes de la CBME. Pour cela,
nous ajoutons tout d&#8217;abord les r&#233;alisations issues de constructions telles que Loc N1 = Ppv
= : y. Nous r&#233;percutons ensuite pour chaque variante de la CBME la s&#233;quence d&#8217;op&#233;rations &#233;l&#233;-
mentaires permettant de la d&#233;river de la CBME : tout effacement d&#8217;un argument rend l&#8217;argument
facultatif ; tout changement de r&#233;alisation induit une nouvelle r&#233;alisation possible de la fonction
syntaxique concern&#233;e12. Le r&#233;sultat de ce processus est un cadre de sous-cat&#233;gorisation avec
</p>
<p>9Les constructions impersonnelles sont toutes obtenues sous forme de redistributions, puisque la table 38I n&#8217;est
pas prise en compte dans le lexique lglex.
</p>
<p>10Elle rassemble les verbes &#224; pseudo-objet de type peser (Le sac p&#232;se 10 kg) ou sentir (Cette pi&#232;ce sent la fum&#233;e).
11De plus, la r&#233;alisation cln (clitique nominatif) est ajout&#233;e syst&#233;matiquement &#224; la fonction syntaxique Suj.
12Les d&#233;pendances entre ces op&#233;rations (par exemple, tel argument est effa&#231;able seulement si tel autre l&#8217;est
</p>
<p>aussi) sont perdues : tout effacement est consid&#233;r&#233; comme possible sans condition, alors m&#234;me qu&#8217;il peut ne ve-
nir que d&#8217;une seule construction. De m&#234;me, toute r&#233;alisation d&#8217;un argument autoris&#233;e par une construction devient
possible quelles que soient les r&#233;alisations des autres arguments. Il s&#8217;agit d&#8217;une approximation des donn&#233;es linguis-
tiques pr&#233;sentes dans les tables. Cette approximation, qui n&#8217;a pas de cons&#233;quences importantes pour l&#8217;utilisation
du lexique produit, a le m&#233;rite de permettre de diminuer au maximum le nombre d&#8217;entr&#233;es. De plus, elle est lin-
guistiquement acceptable, puisqu&#8217;elle est par exemple &#233;galement adopt&#233;e par le mod&#232;le de la valence mis en &#339;uvre
par le lexique DICOVALENCE (Van den Eynde &amp; Mertens, 2006).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;grer les tables du Lexique-Grammaire &#224; un analyseur syntaxique
</p>
<p>alternatives et arguments optionnels. Le cadre construit pour l&#8217;entr&#233;e canonique de l&#8217;exemple
pr&#233;c&#233;dent est alors
&lt;Suj:cln|sn,Dloc:(de-sn|en),Loc:(vers-sn|dans-sn|y)&gt;.
</p>
<p>4.3 Identification des redistributions admissibles
</p>
<p>Le cadre de sous-cat&#233;gorisation de base construit &#224; la section pr&#233;c&#233;dente est le cadre dit pro-
fond, car il rel&#232;ve de la syntaxe profonde. N&#233;anmoins, la table 38I des verbes impersonnels
intrins&#232;ques et autonomes ayant &#233;t&#233; &#233;cart&#233;e du lexique lglex, ce cadre profond correspond tou-
jours &#224; un cadre de surface, celui de la (re)distribution active (%actif). Toutes les entr&#233;es se
voient donc attribuer au moins cette (re)distribution.
</p>
<p>Les autres redistributions admissibles sont identifi&#233;es parmi les constructions r&#233;pertori&#233;es dans
la section all-constructions de l&#8217;entr&#233;e lglex. Ainsi, [passif par] et [passif de] correspondent
aux redistributions %passif et %passif_de, alors que [extrap] et [extrap][passif] correspondent
aux redistributions %actif_impersonnel et %passif_impersonnel13. Comme &#233;tudi&#233; par (Danlos
&amp; Sagot, 2008), les redistributions pronominales (de type se moyennes et se neutres) &#233;tant
mal cod&#233;es dans le Lexique-Grammaire, nous ne les avons pas prises en compte en tant que
redistributions. Le r&#233;sultat de cette extraction pour l&#8217;exemple pr&#233;c&#233;dent est ainsi
&lt;Suj:cln|sn,Dloc:(de-sn|en),Loc:(vers-sn|dans-sn|y)&gt;;;%actif.
</p>
<p>Un exemple plus riche, tel que celui de l&#8217;entr&#233;e de b&#233;n&#233;ficier dans la table 8 (Max b&#233;n&#233;ficie de
ce que Luc est parti), devient quant &#224; lui14
</p>
<p>&lt;Suj:cln|scompl|sinf|sn,Objde:de-scompl|de-sinf|de-sn|en&gt;;;
%actif,%passif_impersonnel,%actif_impersonnel.
</p>
<p>4.4 Prise en compte des informations compl&#233;mentaires
</p>
<p>D&#8217;autres types d&#8217;informations sont alors ajout&#233;es, pour former l&#8217;entr&#233;e finale. Tout d&#8217;abord,
le pr&#233;dicat s&#233;mantique correspondant &#224; l&#8217;entr&#233;e, qui est le plus souvent Lemma (c&#8217;est-&#224;-dire
identique au lemme verbal), peut &#234;tre compl&#233;t&#233; (par exemple en se Lemma, ne pas Lemma, etc)
en fonction d&#8217;informations pr&#233;sentes dans la section lexical-info de l&#8217;entr&#233;e lglex (ppvse=&quot;true&quot;,
neg=&quot;true&quot;, etc). Le lemme verbal lui-m&#234;me, en-t&#234;te de l&#8217;entr&#233;e, est extrait du champ lemma,
et compl&#233;t&#233; par le num&#233;ro de la table dont est issue l&#8217;entr&#233;e, ainsi que du num&#233;ro d&#8217;entr&#233;e
dans cette table. Ainsi, m&#234;me lorsqu&#8217;une entr&#233;e lglex donne lieu &#224; plusieurs entr&#233;es au format
Lefff, ces entr&#233;es partagent un m&#234;me identifiant. Par ailleurs, la classe de fr&#233;quence de l&#8217;entr&#233;e
est r&#233;cup&#233;r&#233;e dans le DELA, et est traduite en un poids de la fa&#231;on suivante : les entr&#233;es z1
re&#231;oivent un poids standard de 100, les entr&#233;es z2 (resp. z3) re&#231;oivent un poids de 70 (resp. 50).
</p>
<p>Les informations syntaxiques compl&#233;mentaires les plus int&#233;ressantes sont repr&#233;sent&#233;es sous
forme de macros. Il s&#8217;agit des informations suivantes :
&#8211; auxiliaire de conjugaison, r&#233;cup&#233;r&#233; dans le champ aux-list, qui induit l&#8217;ajout de la macro
</p>
<p>@avoir ou de la macro @&#234;tre ;
</p>
<p>13Rappelons que la table des classes explicite toutes les propri&#233;t&#233;s v&#233;rifi&#233;es par toutes les entr&#233;es d&#8217;une table.
Ainsi, le fait que toute entr&#233;e &#224; compl&#233;ment direct ne faisant pas partie de la table 32NM (c&#8217;est-&#224;-dire toute entr&#233;e
recevant une fonction syntaxique Obj) soit passivable est cod&#233; dans la table des classes par un + &#224; l&#8217;intersection
des lignes concern&#233;es et de la colonne [extrap].
</p>
<p>14On note que la validit&#233; des redistributions impersonnelles est discutable.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Elsa Tolone
</p>
<p>&#8211; caract&#232;re (essentiellement) pronominal (ppvse=&quot;true&quot;, macro @pron) ;
&#8211; caract&#232;re obligatoirement n&#233;gatif (neg=&quot;true&quot;, macro @neg) ;
&#8211; mode des compl&#233;tives possibles (champ mood de la distribution correspondante), indiqu&#233;e
sous la forme de macros de type @fM , o&#249; f vaut respectivement SComp, Comp, AComp et
DeComp pour les compl&#233;tives de fonction syntaxique Suj, Obj, Obj&#224; et Objde, et o&#249; M est
Ind ou Subj (ex. : @CompInd) ;
</p>
<p>&#8211; informations de contr&#244;le, extraites des champs contr des distributions ou du nombre i dans
les arguments de type Viinf au sein des constructions, et qui sont repr&#233;sent&#233;es par des macros
de la forme @Ctrlf1f2, o&#249; f1 est la fonction syntaxique du contr&#244;leur et f2 celle du contr&#244;l&#233;
(exemple : @CtrlSujObj).
</p>
<p>Enfin, la table de conjugaison &#224; associer &#224; l&#8217;entr&#233;e est r&#233;cup&#233;r&#233;e dans le Lefff, permettant ainsi
la compilation du lexique obtenu avec la description morphologique du fran&#231;ais du Lefff.
</p>
<p>Pour l&#8217;entr&#233;e de ruisseler dans la table 35L, que nous suivons depuis le d&#233;but de cet article, le
r&#233;sultat final est alors le suivant :
ruisseler 35L242 v-er:std 100;Lemma;v;&lt;Suj:cln|sn,Dloc:(de-sn|en),Loc:(vers-sn|dans-sn|y)&gt;;cat=v;%actif
</p>
<p>Pour l&#8217;entr&#233;e de b&#233;n&#233;ficier dans la table 8, mentionn&#233;e ci-dessus, le r&#233;sultat est :
b&#233;n&#233;ficier 810 v-er:std 100;Lemma;v;&lt;Suj:cln|scompl|sinf|sn,Objde:de-scompl|de-sinf|de-sn|en&gt;;
</p>
<p>cat=v,@DeCompInd,@CtrlSujObjde;%actif,%passif_impersonnel,%actif_impersonnel_compl
</p>
<p>4.5 R&#233;sultats
</p>
<p>Le lexique verbal obtenu contient 16 903 entr&#233;es pour 5 694 lemmes verbaux diff&#233;rents, c&#8217;est-
&#224;-dire un nombre moyen d&#8217;entr&#233;es par lemme de 2,96. &#192; titre de comparaison, le Lefff contient
seulement 7072 entr&#233;es verbales pour 6818 lemmes verbaux distincts, soit un nombre moyen
d&#8217;entr&#233;es par lemme de 1,04. Le lexique issu de lglex, quoique d&#233;crivant moins de lemmes
verbaux, est donc beaucoup plus couvrant en termes de constructions syntaxiques et donc beau-
coup plus ambigu. Les lemmes verbaux les plus ambigus dans le Lefff sont tenir et (re)faire (6
entr&#233;es) alors que dans le lexique extrait de lglex il s&#8217;agit des lemmes tenir (53 entr&#233;es), jouer
(44 entr&#233;es) et prendre (35 entr&#233;es). Au niveau extensionnel, le Lefff contient 361 268 entr&#233;es,
alors que le lexique extrait de lglex en contient 763 555.
</p>
<p>L&#8217;obtention de ce lexique &#224; partir de lglex par le processus d&#233;crit ici est r&#233;alis&#233;e par un script
perl de moins de 1 000 lignes. La conversion proprement dite, c&#8217;est-&#224;-dire l&#8217;ex&#233;cution du script
sur l&#8217;ensemble de lglex, prend moins d&#8217;une minute. Si donc une nouvelle version des tables et
de la table des classes sont publi&#233;es, la construction du lexique correspondant au format Lefff
est quasiment instantan&#233;e, et ne n&#233;cessite aucun nouveau d&#233;veloppement.
</p>
<p>5 Int&#233;gration dans FRMG : &#233;valuation et discussion
</p>
<p>La motivation de ce travail est de permettre aux donn&#233;es linguistiques cod&#233;es dans les tables
du Lexique-Grammaire de servir de base de donn&#233;es lexicales pour un analyseur syntaxique
automatique du fran&#231;ais. Parmi les analyseurs qui prennent en entr&#233;e un lexique au format
Lefff, nous avons choisi l&#8217;analyseur FRMG (Thomasset &amp; de la Clergerie, 2005). Il s&#8217;appuie
sur une Grammaire d&#8217;Adjonction d&#8217;Arbres (TAG) compacte du fran&#231;ais g&#233;n&#233;r&#233;e &#224; partir d&#8217;une
m&#233;tagrammaire, et sur le Lefff. La compilation et l&#8217;ex&#233;cution de l&#8217;analyseur se d&#233;roule dans</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;grer les tables du Lexique-Grammaire &#224; un analyseur syntaxique
</p>
<p>le cadre du syst&#232;me DYALOG (de la Clergerie, 2005). Il utilise comme entr&#233;e le r&#233;sultat de la
cha&#238;ne de traitement pr&#233;syntaxique SXPipe (Sagot &amp; Boullier, 2008), qui convertit un texte brut
en suite de treillis de formes connues15.
</p>
<p>L&#8217;int&#233;gration du lexique au format Lefff extrait de lglex dans l&#8217;analyseur FRMG est imm&#233;diate :
le lexeur de l&#8217;analyseur fait appel &#224; une base de donn&#233;es lexicales construite &#224; partir du Lefff.
Il suffit de remplacer les entr&#233;es verbales du Lefff par le lexique construit &#224; partir de lglex, de
conserver les autres entr&#233;es du Lefff, de construire la base de donn&#233;es lexicales correspondantes,
et de sp&#233;cifier &#224; FRMG d&#8217;utiliser cette derni&#232;re. Le r&#233;sultat est une variante de l&#8217;analyseur FRMG,
que nous noterons FRMGlglex, par opposition &#224; la variante standard not&#233;e FRMGLefff .
</p>
<p>Nous avons &#233;valu&#233; FRMGLefff et FRMGlglex en analysant la partie annot&#233;e manuellement du cor-
pus EASy (Paroubek et al., 2005), soit 4 306 phrases de styles vari&#233;s (journalistique, m&#233;dical,
oral, questions, litt&#233;raire. . .), et en utilisant la m&#233;trique d&#8217;&#233;valuation EASy (les chunks et les
&#171; relations &#187; EASy, c&#8217;est-&#224;-dire approximativement les d&#233;pendances entre mots pleins). Les r&#233;-
sultats d&#233;taill&#233;s de cette &#233;valuation seront publi&#233;s par ailleurs. Globalement, on observe que les
r&#233;sultats sont pour l&#8217;instant l&#233;g&#232;rement meilleurs pour FRMGLefff . Par exemple, la f-mesure glo-
bale sur les chunks est de 84,4 % pour FRMGLefff contre 82,2 % pour FRMGlglex, et celle sur les
relations est de 59,9 % pour FRMGLefff contre 56,1 % pour FRMGlglex. Nous ne pensons pas que
ce r&#233;sultat remette en question la pertinence de l&#8217;utilisation des tables du Lexique-Grammaire
en analyse syntaxique, pour plusieurs raisons : d&#8217;une part, le processus de conversion d&#233;crit
ici et son impl&#233;mentation en sont encore &#224; une version pr&#233;liminaire ; d&#8217;autre part, le d&#233;velop-
pement du Lefff a &#233;t&#233; r&#233;alis&#233; en parall&#232;le avec celui de FRMG et les &#233;valuations EASy ; enfin,
le lexique issu des tables a d&#251; &#234;tre compl&#233;t&#233; par certaines entr&#233;es manquantes (auxiliaires et
semi-auxiliaires, verbes impersonnels, etc. . .), mais certaines autres manquent peut-&#234;tre encore.
Du reste, nous avons d&#233;j&#224; identifi&#233; des probl&#232;mes syst&#233;matiques dans les donn&#233;es de d&#233;part
(telle que la passivabilit&#233; incompl&#232;tement cod&#233;e dans la table des classes) dont l&#8217;impact sur les
r&#233;sultats est tr&#232;s important. Une fois ces probl&#232;mes r&#233;solus, nous esp&#233;rons que FRMGlglex aura
des r&#233;sultats significativement meilleurs que FRMGLefff .
</p>
<p>Il est int&#233;ressant de constater que, d&#232;s &#224; pr&#233;sent, la couverture des deux analyseurs est assez
compl&#233;mentaire. Par exemple, sur le sous-corpus general_lemonde, 177 phrases sont en-
ti&#232;rement reconnues par les deux analyseurs, 85 seulement par FRMGLefff , 76 seulement par
FRMGlglex, et 111 par aucun des deux. Cette compl&#233;mentarit&#233; est prometteuse. En particulier, il
sera int&#233;ressant d&#8217;&#233;tudier les diff&#233;rences entre les erreurs faites par chacun de ces deux analy-
seurs, y compris au moyen de techniques automatiques telles que celles d&#233;crites dans (Sagot &amp;
de La Clergerie, 2008). Ceci pourrait permettre d&#8217;am&#233;liorer les diff&#233;rentes ressources, voire de
d&#233;tecter automatiquement des erreurs dans les lexiques. Dans le cas de lglex, nous nous atten-
dons &#224; ce que la plupart de ces erreurs proviennent du processus de conversion, mais certaines
proviendront peut-&#234;tre d&#8217;erreurs dans les tables du Lexique-Grammaire, et permettront donc
d&#8217;am&#233;liorer ces derni&#232;res.
</p>
<p>6 Conclusion et perspectives
</p>
<p>Nous avons d&#233;velopp&#233; une m&#233;thodologie et un outil permettant de convertir la version textuelle
des tables du Lexique-Grammaire en un lexique TAL utilisant le formalisme lexical du Lefff, et
</p>
<p>15SXPipe comprend entre autres des modules de segmentation en phrases, de tokenization et correction ortho-
graphique, de d&#233;tection d&#8217;entit&#233;s nomm&#233;es, et d&#8217;identification non d&#233;terministe des mots compos&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Elsa Tolone
</p>
<p>donc utilisable par l&#8217;analyseur syntaxique FRMG. La pertinence du lexique obtenu a &#233;t&#233; valid&#233;e
par son utilisation pour l&#8217;analyse syntaxique automatique du corpus d&#8217;&#233;valuation EASy.
</p>
<p>Ce premier travail nous a permis d&#8217;identifier un certain nombre de probl&#232;mes dans les donn&#233;es
de d&#233;part (tables et table des classes), mais nous a conduit &#233;galement &#224; un certain nombre
de simplifications et d&#8217;approximations dans le processus de conversion. Il y a donc la place
pour des am&#233;liorations importantes, qui pourraient permettre &#224; terme de construire un lexique
syntaxique pour le TAL &#224; partir des tables du Lexique-Grammaire dont l&#8217;utilisation am&#233;liorera
la qualit&#233; des outils et des ressources existants, par exemple par fusion avec d&#8217;autres ressources
lexicales ou par int&#233;gration dans un analyseur syntaxique op&#233;rationnel.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOONS J.-P., GUILLET A. &amp; LECL&#200;RE C. (1976). La structure des phrases simples en
fran&#231;ais, Constructions intransitives. Gen&#232;ve : Droz.
CONSTANT M. &amp; TOLONE E. (2008). A generic tool to generate a lexicon for nlp from
lexicon-grammar tables. In Actes du 27&#232;me Colloque Lexique et Grammaire, L&#8217;Aquila, Italie.
DANLOS L. &amp; SAGOT B. (2008). Constructions pronominales dans dicovalence et le lexique-
grammaire &#8211; int&#233;gration dans le Lefff. In Actes du 27&#232;me Colloque Lexique et Grammaire,
L&#8217;Aquila, Italie.
DE LA CLERGERIE E. (2005). DyALog : a tabular logic programming based environment
for NLP. In Proceedings of 2nd International Workshop on Constraint Solving and Language
Processing (CSLP&#8217;05), Barcelona, Spain.
GARDENT C., GUILLAUME B., PERRIER G. &amp; FALK I. (2005). Maurice Gross&#8217; grammar
lexicon and natural language processing. In Proc. of the 2nd LTC, Poznan&#769;, Poland.
GROSS M. (1975). M&#233;thodes en syntaxe. Paris, France : Hermann.
GUILLET A. &amp; LECL&#200;RE C. (1992). La structure des phrases simples en fran&#231;ais : Les
constructions transitives locatives. Gen&#232;ve : Droz.
PAROUBEK P., POUILLOT L.-G., ROBBA I. &amp; VILNAT A. (2005). EASy : campagne d&#8217;&#233;va-
luation des analyseurs syntaxiques. In Proceedings of the EASy workshop of TALN 2005,
Dourdan, France.
PAUMIER S. (2003). De la reconnaissance de formes linguistiques &#224; l&#8217;analyse syntaxique.
PhD thesis, Universit&#233; Paris-Est Marne-la-Vall&#233;e.
SAGOT B. &amp; BOULLIER P. (2008). SXPipe 2 : architecture pour le traitement pr&#233;syntaxique
de corpus bruts. Traitement Automatique des Langues (T.A.L.), 49(2). &#192; para&#238;tre.
SAGOT B., CL&#201;MENT L., DE LA CLERGERIE E. &amp; BOULLIER P. (2006). The Lefff 2 syn-
tactic lexicon for French : architecture, acquisition, use. In Proc. of LREC&#8217;06.
SAGOT B. &amp; DANLOS L. (2007). Am&#233;liorer un lexique syntaxique &#224; l&#8217;aide des tables du
lexique-grammaire &#8211; Constructions impersonnelles. Cahiers du Cental.
SAGOT B. &amp; DE LA CLERGERIE &#201;. (2008). Fouille d&#8217;erreurs sur les sorties d&#8217;analyseurs
syntaxiques. Traitement Automatique des Langues (T.A.L.), 49(1).
THOMASSET F. &amp; DE LA CLERGERIE E. (2005). Comment obtenir plus des m&#233;ta-
grammaires. In Proceedings of TALN&#8217;05, Dourdan, France : ATALA.
VAN DEN EYNDE K. &amp; MERTENS P. (2006). Le dictionnaire de valence DICOVALENCE :
manuel d&#8217;utilisation. http ://bach.arts.kuleuven.be/dicovalence/manuel_061117.pdf.</p>

</div></div>
</body></html>