<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>SAGACE-v3.3 ; Analyseur de corpus pour langues non flexionnelles</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009
</p>
<p>SAGACE-v3.3 ; Analyseur de corpus pour langues non 
flexionnelles
</p>
<p>Blin Raoul 
</p>
<p>CRLAO - CNRS ,  54 Raspail 75006 Paris
 blin@ehess.fr 
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons la derni&#232;re version du logiciel SAGACE, analyseur de corpus 
pour langues faiblement flexionnelles (par exemple japonais ou chinois). Ce logiciel est 
distribu&#233; avec un lexique o&#249; les cat&#233;gories sont exprim&#233;es &#224; l'aide de syst&#232;mes de traits.
</p>
<p>Abstract  We present  a software program named SAGACE, designed to search for and 
extract word strings from a large corpus. It has been conceived for poor flexional languages, 
such as Japanese or Chinese.  It is associated with a lexicon where categories are expressed 
with feature systems.
</p>
<p>Mots-cl&#233;s :   corpus , lexique , analyseur, japonais , chinois
Keywords:   corpus, lexicon , analyzer , japanese , chinese
</p>
<p>SAGACE est un logiciel d'analyse de corpus destin&#233; plus particuli&#232;rement &#224; l'&#233;tude de langues 
faiblement  flexionnelles.  Il  est  actuellement  exploit&#233;  entre  autres  pour  la  recherche  sur  le 
japonais, sur un corpus de grande taille (26 millions de phrases) non balis&#233;. Il est distribu&#233;1 
gratuitement sous licence CECILL. 
</p>
<p>Nous pr&#233;sentons ici ses principales fonctionnalit&#233;s et caract&#233;ristiques.
</p>
<p>1 Conceptions et fonctionnalit&#233;s de base du logiciel
Le logiciel  est  constitu&#233; d'un moteur  de recherche,  qui  associ&#233;  &#224;  un lexique  manipule  des 
corpus tagu&#233;s ou non. Le moteur assure deux fonctions : 
</p>
<p>1) Concordancier
</p>
<p>Extraction d'une cha&#238;ne et de son contexte, affichage dans diff&#233;rents formats, dont KWIC. Les 
segments  de textes  extraits  sont  de toutes  natures  et  ma&#238;trisables  par  l'utilisateur : phrase, 
paragraphe, autres. Ces segments sont d&#233;finis gr&#226;ce &#224; des marques d'arr&#234;t comme par exemple 
</p>
<p>1 ljp.homelinux.net</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Raoul Blin
</p>
<p>un rond (marque  de fin de phrase  en japonais),  un  saut  de ligne,  tout  autre  marque  dont 
&#233;ventuellement une balise ins&#233;r&#233;e par l'utilisateur dans le corpus.
</p>
<p>2) Extraction et comptage de collocations
</p>
<p>2 Lexique
Les  lexiques  exploit&#233;s  par  SAGACE sont  des  listes  d'entr&#233;es  dot&#233;es  d&#8217;une  repr&#233;sentation 
syntaxique exprim&#233;e &#224; l'aide d&#8217;une formule propositionnelle de traits.  
</p>
<p>ex :    &#31169; [[ pronom &amp; lecture:&quot;watasi&quot; &amp; lecture:origine:&quot;japonais&quot; ...]]
</p>
<p>SAGACE dispose  de  plusieurs  fonctions  de manipulations  du lexique :  listage  du  contenu 
(recherche d'un lemme particulier, listage du contenu d'une cat&#233;gorie etc.), insertion d'entr&#233;e. 
La fonction d'insertion &#233;vite une ouverture manuelle du lexique. Elle permet aussi de g&#233;rer les 
droits d'acc&#232;s au lexique. 
</p>
<p>Il existe actuellement deux lexiques imm&#233;diatement exploitables par SAGACE. Le premier, 
LEXS-J-&#61538;3.0.0 comporte  380.000 entr&#233;es pour  le japonais  et  le second LEXS-CHS-&#61472;&#61538;1.0.0 
comporte 40.000 entr&#233;es pour le chinois simplifi&#233;. Ils sont librement distribu&#233;s2. 
</p>
<p>3 Nature des cha&#238;nes recherch&#233;es et description 
Le  logiciel  cherche  des  cha&#238;nes  de  lemmes.  Il  ne  travaille  pas  sur  des  syntagmes  et  se 
d&#233;marque en cela de logiciels comme UNITEX ou NOOJ, entre autres.
</p>
<p>Une  cha&#238;ne  &#224;  chercher  est  d&#233;crite  composant  par  composant,  en  indiquant  la  valeur  du 
composant et diff&#233;rentes options de recherches. 
</p>
<p>Chaque composant de la cha&#238;ne &#224; chercher est soit un lemme donn&#233; (exemple :   &#31169; (watasi, 
je)), soit  n'importe  quel lemme d'une cat&#233;gorie  donn&#233;e (exemple : pronom) d&#233;crite  &#224;  l'aide 
d'une formule propositionnelle de traits. Avec ce langage, il est aussi possible de composer de 
nouvelles  cat&#233;gories  &#224;  partir  des  cat&#233;gories  existantes.  Par  exemple :  combiner  deux  ou 
plusieurs cat&#233;gories en une seule (par  disjonction), exclure une sous cat&#233;gorie (usage de la 
n&#233;gation etc.), cr&#233;er un sous-ensemble (par conjonction). Le langage offre ainsi la possibilit&#233; &#224; 
l'utilisateur de d&#233;crire des nouvelles cat&#233;gories sans avoir &#224; modifier le contenu du lexique. 
</p>
<p>Les  cha&#238;nes  manipul&#233;es  peuvent  &#234;tre  discontinues.  Il  est  possible  de  rechercher  des 
morph&#232;mes disjoints.
</p>
<p>Il est enfin possible de chercher des lemmes &quot;inconnus&quot;, compris entre deux lemmes connus. 
Cette fonction permet  par  exemple de relever  tous les morph&#232;mes qui  occupent  une place 
donn&#233;e dans la cha&#238;ne (entre deux &#233;l&#233;ments connus). 
</p>
<p>2 ljp.homelinux.net</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SAGACE-v3.3 ; Analyseur de corpus pour langues non flexionnelles
</p>
<p>4 Les corpus manipul&#233;s
Le  logiciel  travaille  sur  des  textes  non  balis&#233;s  ou  comportant  des  balises  structurelles 
(distinctions titre/corps de texte) au format xml. L'int&#233;r&#234;t du texte non balis&#233; est de pouvoir 
effectuer une &#233;tude sans n&#233;cessiter aucun pr&#233;traitement. 
</p>
<p>Il est possible depuis la version 3.3 de prendre en compte la structure du texte en distinguant 
les titres et leur niveau d'imbrication, et le corps du texte. Cette fonction permet de faire des 
recherches conditionn&#233;es, comme par exemple de limiter la recherche &#224; du texte situ&#233; dans la 
port&#233;e d'un titre remplissant certaines conditions. 
</p>
<p>Pr&#233;sentement,  le logiciel  est utilisable  en ligne et travaille  avec un corpus non-tagu&#233; de 26 
millions de phrases japonaises (en majorit&#233; extraites du web). 
</p>
<p>Un corpus avec balisage de la structure du texte est actuellement en cours de constitution. 
</p>
<p>5 Conclusion
SAGACE est distribu&#233; pour installation sur poste individuel et une version est utilisable en 
ligne3 pour  simplifier  au  maximum l'utilisation  et  pour  mutualiser  les  donn&#233;es  (lexique  et 
corpus). 
</p>
<p>Le logiciel est avant tout destin&#233; &#224; l'usage scientifique (aide &#224; l'analyse linguistique) mais il est 
con&#231;u aussi pour entrer dans des cha&#238;nes de traitement plus complexes. En l'occurrence, un 
travail  est  en cours  pour  concevoir  un prototype  d'analyseur  d'opinion : cet  analyseur,  qui 
repose  sur  l'analyse  linguistique  effectu&#233;e  par  SAGACE,  permettra  par  exemple  &#224;  un 
utilisateur fran&#231;ais de conna&#238;tre l'image/r&#233;putation d'un objet donn&#233; (un produit, une marque, 
etc.) sur le web japonais.
</p>
<p>Mat&#233;riel demand&#233; : tableau, panneau pour poster, connection internet
</p>
<p>3 http://ljp.homelinux.net</p>

</div></div>
</body></html>