<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse automatique des noms d&#233;verbaux compos&#233;s : pourquoi et comment faire interagir analogie et syst&#232;me de r&#232;gles</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009 
</p>
<p>Analyse automatique des noms d&#233;verbaux compos&#233;s : pourquoi et 
comment faire interagir analogie et syst&#232;me de r&#232;gles 
</p>
<p>Fiammetta Namer 
</p>
<p>UMR 7118 &#171; ATILF &#187; - Nancy Universit&#233; 
fiammetta.namer@univ-nancy2.fr 
</p>
<p>R&#233;sum&#233; : Cet article aborde deux probl&#232;mes d&#8217;analyse morpho-s&#233;mantique du lexique : 
(1) attribuer automatiquement une d&#233;finition &#224; des noms et verbes morphologiquement 
construits inconnus des dictionnaires mais pr&#233;sents dans les textes ; (2) proposer une analyse 
combinant r&#232;gles et analogie, deux techniques g&#233;n&#233;ralement contradictoires.  
Les noms analys&#233;s sont apparemment suffix&#233;s et compos&#233;s (HYDROMASSAGE). La plupart 
d&#8217;entre eux, massivement attest&#233;s dans les documents (journaux, Internet) sont absents des 
dictionnaires. Ils sont souvent reli&#233;s &#224; des verbes (HYDROMASSER) &#233;galement n&#233;ologiques. Le 
nombre de ces noms et verbes est estim&#233; &#224; 5.400. L&#8217;analyse propos&#233;e leur attribue une 
d&#233;finition par rapport &#224; leur base, et enrichit un lexique de r&#233;f&#233;rence pour le TALN au moyen 
de cette base, si elle est n&#233;ologique. L&#8217;impl&#233;mentation des contraintes linguistiques qui 
r&#233;gissent ces formations est reproductible dans d&#8217;autres langues europ&#233;ennes o&#249; sont 
rencontr&#233;s les m&#234;mes types de donn&#233;es dont l&#8217;analyse refl&#232;te le m&#234;me raisonnement que pour 
le fran&#231;ais.  
</p>
<p>Abstract: This paper addresses two morpho-semantic parsing issues: (1) to automatically 
provide morphologically complex unknown nouns and verbs with a definition; (2) to propose 
a methodology combining both rules and analogy, which are techniques usually seen as 
inconsistent with eachother.  
</p>
<p>The analysed nouns look like both suffixed and compounded (HYDROMASSAGE). Most of them 
are not stored in dictionaries, although they are very frequent in newspapers or online 
documents. They are often related to verbs (HYDROMASSER), also lacking from dictionaries. 
The estimated amount of these nouns and verbs is 5,400. The proposed analysis assigns them 
a definition calculated according to their base meaning, and it increases the existing reference 
lexicon content with this base, from the moment that it is a new-coined form. The 
implementation of linguistic constraints which govern this word formations is reproducible in 
other West-European languages, where the same data type is found, subject to the same kind 
of analysis. 
</p>
<p>Mots-cl&#233;s : Analyse morphologique, Annotation s&#233;mantique, Composition savante, Noms 
d&#233;verbaux, R&#232;gles, Analogie 
Keywords: Morphological parsing, Semantic annotation, Neo-classical compounds, 
Deverbal nouns, Rules, Analogy 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fiammetta Namer 
</p>
<p>1 Introduction 
Les noms compos&#233;s et suffix&#233;s de la forme YXSfxN (A&#201;ROCONTAMINATION, HYDROMASSAGE) 
forment un lexique de taille importante, estim&#233; &#224; 4.600 noms (cf. &#167;.2.2). Dans ces noms, Y 
d&#233;signe une racine grecque ou latine (a&#233;r(o), hydr(o)), XV un th&#232;me verbal (contaminat, mass) 
et Sfx est l&#8217;un des exposants de r&#232;gles formatrices de noms d&#233;verbaux de proc&#232;s, pour 
l&#8217;essentiel l&#8217;un des suffixes : -ion, -age, -ment, -ance. Nous posons ici la question de leur 
analyse automatique, et, corr&#233;lativement, de celle des verbes YXV (A&#201;ROCONTAMINER, 
HYDROMASSER), &#233;galement nombreux dans les documents (cf. &#167;.2.2), auxquels ces noms sont 
apparent&#233;s. 
</p>
<p>Pour tout syst&#232;me d&#8217;analyse non- (ou semi-)supervis&#233;, ind&#233;pendant des connaissances 
linguistiques et visant l&#8217;identification des mots partageant une s&#233;quence commune, cette 
question ne se pose pas : n&#8217;importe quel d&#233;coupage conduit &#224; reconstituer la &#171; famille &#187; du 
nom. YXSfxN va &#234;tre indiff&#233;remment analys&#233; sur XSfxN (CONTAMINATION, MASSAGE), ou 
YXV (A&#201;ROCONTAMINER, HYDROMASSER), de mani&#232;re &#224; &#234;tre reli&#233;, finalement, &#224; XV 
(CONTAMINER, MASSER). 
</p>
<p>Cependant, l&#8217;analyseur dont il est question ici (cf. &#167;.3) se donne pour objectif la production 
d&#8217;un lexique annot&#233; des traits syntaxico-s&#233;mantiques que la morphologie peut fournir, 
c&#8217;est-&#224;-dire au moins la pseudo-d&#233;finition du lex&#232;me analys&#233;, calcul&#233;e par rapport au sens de 
sa base. L&#8217;analyse des donn&#233;es est donc fondamentalement guid&#233;e par la conformit&#233; aux 
principes linguistiques. Or, ceux-ci pr&#233;conisent qu&#8217;une seule analyse est possible (cf. &#167;.2.2) : 
contrairement &#224; ce qu&#8217;une d&#233;composition lin&#233;aire laisserait croire, le verbe compos&#233; YXV 
(HYDROMASSER) est d&#233;nominal, et sa &#171; base &#187; YXSfxN (HYDROMASSAGE) est compos&#233;e sur 
YSfxN (MASSAGE), ce nom &#233;tant lui-m&#234;me d&#233;riv&#233; de XV (MASSER). L&#8217;obtention de r&#233;sultats 
linguistiquement motiv&#233;s se heurte, comme on le voit, &#224; une difficult&#233; m&#233;thodologique, 
puisque les verbes compos&#233;s s&#8217;analysent sur une base lin&#233;airement plus complexe. 
</p>
<p>Cet article aborde en d&#8217;autres termes la r&#233;solution simultan&#233;e de deux probl&#232;mes : produire 
une analyse morpho-s&#233;mantique de donn&#233;es nominales et verbales, morphologiquement 
construites, quantitativement importantes, mais g&#233;n&#233;ralement absentes de dictionnaires ; 
mettre au point une approche analytique devant combiner deux techniques g&#233;n&#233;ralement 
contradictoires. L&#8217;article d&#233;bute par l&#8217;exposition des donn&#233;es et des m&#233;thodes &#224; mettre en 
oeuvre (&#167;.2). Nous d&#233;crivons tout d&#8217;abord la mani&#232;re dont le corpus a &#233;t&#233; constitu&#233;, et son 
int&#233;r&#234;t en TALN (&#167;.2.1) ; nous montrons au &#167;.2.2 pourquoi l&#8217;analyse par r&#232;gles de 
(d&#233;)suffixation et (d&#233;)composition des noms YXSfxN, et des verbes apparent&#233;s, est au mieux 
insuffisante, au pire impossible ; et quelle analyse, au contraire, appara&#238;t &#224; la fois 
linguistiquement plus motiv&#233;e et algorithmiquement plus &#233;conomique. Ensuite, le &#167;.3 aborde 
la mise en oeuvre pratique de ces constats : tout d&#8217;abord (&#167;.3.1), nous d&#233;crivons l&#8217;analyseur 
morphologique D&#233;riF, en rappelant les caract&#233;ristiques principales de son fonctionnement, et 
des informations produites lors de chaque analyse. Nous mettrons l&#8217;accent sur 
l&#8217;incompatibilit&#233; apparente entre l&#8217;approche de D&#233;riF et le raisonnement analogique 
n&#233;cessaire &#224; la prise en compte des verbes YXV. Enfin (&#167;.3.2) nous montrons et illustrons par 
des exemples comment l&#8217;int&#233;gration de ce raisonnement dans D&#233;riF est rendu possible gr&#226;ce 
aux sp&#233;cificit&#233;s des donn&#233;es &#224; analyser. Avant de conclure (&#167;.4), des perspectives d&#8217;&#233;volution 
&#224; court terme sont propos&#233;s (&#167;.3.3). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique de noms d&#233;verbaux compos&#233;s  
</p>
<p>2 Donn&#233;es et m&#233;thode 
2.1 Collecte des donn&#233;es 
Les noms de la forme YXSfxN sont &#224; la fois compos&#233;s et suffix&#233;s. Le suffixe est pour 
l&#8217;essentiel l&#8217;une des s&#233;quences -ion, -age, -ment et -ance. Le constituant XV est un verbe, et le 
constituant Y est une base nominale dite &#8216;non autonome&#8217;, car il s&#8217;agit d&#8217;une forme issue du 
grec ou du latin et ne constitue pas un atome pour la syntaxe. Les valeurs les plus fr&#233;quentes 
de YN dans les exemples de YXSfxN observ&#233;s dans le TLFnome sont reproduites en (1). Le 
fait qu&#8217;elles aient un sens r&#233;f&#233;rentiel d&#233;notatif est l&#8217;une des raisons qui conduisent &#224; analyser 
les formes de (1) comme des bases suppl&#233;tives de lex&#232;mes, et non pas comme des pr&#233;fixes : 
ces formes renvoient &#224; des entit&#233;s, ce qui justifie qu&#8217;on leur attribue la cat&#233;gorie nominale.  
</p>
<p>(1) abdomino, a&#233;ro, bathy, bio, cardio, cryo, cuti, dermo, domo, &#233;lectro, gastro, h&#233;mo, 
hydro, immuno, lacto, lat&#233;ro, neuro, ophtalmo, osmo, oxydo, photo, radio, rhino, 
g&#233;o, pyro, thermo 
</p>
<p>Les YXSfxN ne constituent que 2% des noms morphologiquement construits pr&#233;sents parmi 
les nomenclatures du TLFi ou TLFnome1. Ils sont plus fr&#233;quents dans les corpus 
journalistiques (d&#8217;apr&#232;s une recherche effectu&#233;e dans les recueils de textes &#233;lectroniques issus 
de Le Monde 1995 et 1999, et de L&#8217;Est R&#233;publicain 2002) et leur pr&#233;sence est largement 
attest&#233;e dans les documents en ligne, comme en t&#233;moigne le r&#233;sultat de l&#8217;estimation relat&#233;e 
dans ce qui suit. &#192; partir des 2.200 noms d&#233;verbaux de la forme XionN contenus dans le 
TLFnome, nous avons automatiquement g&#233;n&#233;r&#233; l&#8217;ensemble des s&#233;quences de la forme 
hydroXion, et absentes du TLFnome. L&#8217;une apr&#232;s l&#8217;autre, ces s&#233;quences ont servi de requ&#234;te 
via Yahoo au moyen du robot WaliM (Namer, 2003a). Apr&#232;s &#233;viction manuelle des r&#233;sultats 
erron&#233;s, cette recherche en ligne conduit &#224; une liste de 237 formes diff&#233;rentes. La m&#234;me 
m&#233;thode est r&#233;p&#233;t&#233;e en rempla&#231;ant hydro par chacune des autres bases de (1). On obtient un 
total 3.400 noms, ce qui m&#232;ne &#224; la conclusion que les YXionN sont presque 27 fois plus 
nombreux que ce que le contenu du TLFnome ne laisserait croire. De l&#224;, en examinant le 
nombre (moins important) des noms compos&#233;s suffix&#233;s par -age, -ment et -ance, il est 
possible d&#8217;estimer &#224; 4.600 le nombre total des YXSfxN &#224; analyser. La m&#234;me succession 
automatique de requ&#234;tes via Yahoo est r&#233;alis&#233;e sur la base des candidats verbes YXV g&#233;n&#233;r&#233;s 
au pr&#233;alable &#224; partir des 3.400 YXionN. Seuls 800 d&#8217;entre eux renvoient des r&#233;sultats non 
nuls2. Les raisons qui expliquent la diff&#233;rence quantitative entre les YXV et les YXSfxN sont 
avanc&#233;es au &#167;.2.2.  
</p>
<p>Comme le montre le Tab.1, le nom YXSfxN est analysable comme compos&#233; savant3 (1a, 2a), 
tout en &#233;tant apparent&#233; &#224; YXV (1b) ; la fr&#233;quence d&#8217;attestation de YXV dans les textes varie 
</p>
<p>                                                                                                                                                  
1 Les nomenclatures du TLFi qui nous servent de r&#233;f&#233;rentiel pour la langue g&#233;n&#233;rale comportent plus de 
</p>
<p>99.000 lemmes cat&#233;goris&#233;s NOM, VERBE, ADVERBE et ADJECTIF.  
2  La requ&#234;te a port&#233; sur la disjonction de l&#8217;infinitif, des participes et des formes sigulier et 3e pp des temps de 
</p>
<p>l&#8217;indicatif et du pr&#233;sent du subjonctif. 
3  Contrairement &#224; la suffixation et &#224; la pr&#233;fixation, qui consistent en l&#8217;application d&#8217;une r&#232;gle &#224; une base, la 
</p>
<p>composition est un proc&#233;d&#233; de formation lexicale qui fait intervenir deux unit&#233;s poss&#233;dant un sens r&#233;f&#233;rentiel. 
Traditionnellement, un compos&#233; savant ou n&#233;oclassique YX comporte au moins un constituant d&#8217;origine 
grecque ou latine ; dans les cas qui nous int&#233;ressent, le compos&#233; YX s&#8217;interpr&#232;te comme un hyponyme de X. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;un verbe &#224; l&#8217;autre (1b versus 2b) ; XV est, lui, un verbe enregistr&#233; dans le TLF. Les nombres 
entre parenth&#232;ses quantifient les occurrences recueillies sur La Toile lors de la collecte 
automatique relat&#233;e supra. Le cas &#233;ch&#233;ant, l&#8217;attestation de YXSfxN dans le TLF est indiqu&#233;e.  
</p>
<p> YXSfxN (# occ) / XSfxN YXV (# occ) / XV 
1 (a) hydromassage (148000) / massage  
</p>
<p>thermor&#233;gulation (TLF) / r&#233;gulation 
(b) hydromasser (3) / masser 
thermor&#233;guler (9340) / r&#233;guler 
</p>
<p>2 (a) h&#233;mocoagulation (#) / coagulation (b) *h&#233;mocoaguler (0) / coaguler 
Tab. 1 - Noms en YXSfx, et verbes apparent&#233;s  
</p>
<p>2.2 Analyse &#8220;classique&#8221; ? 
Au vu des donn&#233;es expos&#233;es ci-dessus, le choix &#224; op&#233;rer r&#233;side dans la mani&#232;re dont 
l&#8217;analyseur doit rattacher YXSfxN, YXV et le verbe XV. Comme cela a &#233;t&#233; &#233;voqu&#233; au &#167;.1, cette 
d&#233;cision est sans objet pour toute approche dont l&#8217;objectif est de r&#233;unir des formes suppos&#233;es 
appartenir &#224; une m&#234;me famille pour am&#233;liorer des syst&#232;mes de recherche d&#8217;information. C&#8217;est 
le cas des raciniseurs (Porter, 1980, Savoy, 1999), ou des syst&#232;mes bas&#233;s sur l&#8217;apprentissage 
(Bernhard, 2007, Claveau et L'Homme, 2005, Gaussier et al., 2000, Hathout, 2003, Moreau et 
Claveau, 2006, Zweigenbaum et al., 2003). Mais l&#8217;analyse pr&#233;sent&#233;e ici a pour finalit&#233; 
l&#8217;annotation s&#233;mantique des lex&#232;mes construits, et en particulier la pr&#233;diction de la relation 
s&#233;mantique que tisse le lex&#232;me analys&#233; avec sa base. Pour cette raison, l&#8217;identification d&#8217;une 
orientation linguistiquement motiv&#233;e est n&#233;cessaire pour l&#8217;analyse de YXSfxN et YXV. Suivant 
cette perspective, deux obstacles s&#8217;opposent au sch&#233;ma (2), pourtant intuitif. 
</p>
<p>(2) *YXSfxN &lt; YXV &lt; XV 
Tout d&#8217;abord, si un nom YXSfxN (HYDRODISTILLATION) &#233;tait d&#233;riv&#233; d&#8217;un verbe compos&#233; 
YXV, alors l&#8217;existence de YXSfxN impliquerait n&#233;cessairement celle de YXV. Or la 
comparaison des fr&#233;quences des YXV avec celles des YXSfxN est tr&#232;s en d&#233;faveur des verbes, 
ce qui contredit cette hypoth&#232;se. En r&#233;alit&#233;, certaines contraintes, portant sur la relation entre 
YN et XV, dictent les conditions de bonne formation de YXV, alors qu&#8217;elles n&#8217;affectent pas la 
formation de YXSfxN (cf. 2a versus 2b, Tab.1). L&#8217;observation de ces contraintes, qui 
d&#233;passent le cadre de cet article et dont il ne sera pas question ici, suffit n&#233;anmoins &#224; 
d&#233;montrer que YXSfxN (e.g. CARDIOR&#201;SISTANCE, CUTIR&#201;ACTION), dont l&#8217;existence et la bonne 
formation ne sont pas tributaires de celles de YXV (*THERMOR&#201;SISTER, *CUTIR&#201;AGIR), n&#8217;est 
pas d&#233;riv&#233; de YXV. Ajoutons que les YXV sont syst&#233;matiquement absents du TLF (alors que 
les YXSfxN peuvent y figurer), et qu&#8217;ils sont d&#233;fectifs : les seules formes rencontr&#233;es sur la 
Toile sont l&#8217;infinitif, les 3&#232;mes personnes singulier et pluriel du pr&#233;sent, et les participes. 
</p>
<p>Le deuxi&#232;me obstacle concerne la formation de YXV. Ce verbe semble r&#233;sulter d&#8217;un proc&#233;d&#233; 
de composition &#224; partir du verbe XV par incorporation du nom Y (HYDRO(=eau)+DISTILLER &gt; 
HYDRODISTILLER). Or, le proc&#233;d&#233; dit d&#8217;incorporation (Baker, 1988, Mithun, 1984), n&#8217;est pas 
un moyen de construction disponible dans les langues europ&#233;ennes (Creissels, 2005, 
Haspelmath, 2002) : par exemple, le verbe HYDROMASSER ne s&#8217;analyse pas comme le r&#233;sultat 
de l&#8217;incorporation de la base suppl&#233;tive nominale &#176;hydro=EAU au verbe MASSER. 
</p>
<p>En termes d&#8217;analyse automatique, ces deux remarques impliquent que l&#8217;encha&#238;nement (2) est 
ill&#233;gitime puisque l&#8217;&#233;tape YXSfxN &lt; YXV est contredite par les donn&#233;es, et que l&#8217;&#233;tape YXV &lt; 
XV est ill&#233;gale dans le syst&#232;me morphologique du fran&#231;ais. Ces deux probl&#232;mes disparaissent 
quand on examine c&#8217;est l&#8217;analyse inverse (3). Elle suppose que YXV est construit &#224; partir de 
YXSfxN par r&#233;troformation : le construit est une s&#233;quence plus &#171; courte &#187; que la base (Becker, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique de noms d&#233;verbaux compos&#233;s  
</p>
<p>1993, Nagano, 2007). Le nom &#171; de base &#187; YXSfxN s&#8217;analyse, lui, sur XSfxN par composition 
savante. XSfxN est naturellement form&#233; sur base verbale XV : 
</p>
<p>(3) YXV &lt; YXSfxN &lt; XSfxN &lt; XV  
En synth&#232;se, l&#8217;application des r&#232;gles classiques de (d&#233;s)affixation/(d&#233;)composition pour 
l&#8217;analyse des noms YXSfxN de notre corpus est inadapt&#233;e, puisque ces r&#232;gles ne sont pas en 
mesure d&#8217;analyser YXV, qui n&#8217;est ni le produit d&#8217;une affixation, ni celle d&#8217;une composition. 
En revanche, un autre raisonnement, utilis&#233; en TALN (il constitue le principe fondamental des 
syst&#232;mes bas&#233;s sur l&#8217;apprentissage de r&#232;gles, cf. supra), constitue un moyen &#233;l&#233;gant de 
prendre en compte la r&#233;troformation : il s&#8217;agit de l&#8217;analogie proportionnelle. Ce raisonnement 
stipule que YXV est &#224; YXSfxN ce que XV est &#224; XSfxN (sur l&#8217;analogie en morphologie, voir 
(Dal, 2008, Skousen et al., 2002)).  
</p>
<p>Il faut donc mettre au point d&#8217;une m&#233;thodologie d&#8217;analyse, qui active un raisonnement 
analogique pour analyser les verbes de la forme YXV, et exclusivement dans ce cas. Ce 
module particulier doit &#234;tre int&#233;gr&#233; dans un syst&#232;me de r&#232;gles, donc apparemment 
algorithmiquement incompatible. Dans la suite, apr&#232;s un bref rappel des propri&#233;t&#233;s de 
l&#8217;analyseur utilis&#233;, nous examinons la mani&#232;re dont un module d&#8217;analyse par analogie a 
n&#233;anmoins pu &#234;tre int&#233;gr&#233; au syst&#232;me. 
</p>
<p>3 Mise en oeuvre de la m&#233;thode 
3.1 Analyseur D&#233;riF 
D&#233;riF (Namer, 2002, Namer, 2003b) est un analyseur morphologique du fran&#231;ais bas&#233; sur 
l&#8217;application de r&#232;gles et s&#8217;inspirant du courant lex&#233;matique de la morphologie (Fradin, 2003). 
En cela, il se sert de connaissances externes et s&#8217;oppose aux syst&#232;mes non-supervis&#233;s comme 
ceux de (Gaussier et al., 2000, Goldsmith, 2001, Moreau et Claveau, 2006) par exemple. Les 
r&#232;gles sont motiv&#233;es linguistiquement et diff&#232;rent en cela des raciniseurs/d&#233;saffixeurs qui ont 
surtout &#233;t&#233; d&#233;velopp&#233;s pour l&#8217;anglais (Hull, 1996). L&#8217;application de ces r&#232;gles garantit la 
pr&#233;diction syst&#233;matique de relations s&#233;mantiques entre les lex&#232;mes apparent&#233;s lors d&#8217;une 
analyse, et de l&#8217;attribution de traits syntaxiques et s&#233;mantiques sur ces m&#234;mes lex&#232;mes. 
</p>
<p>L&#8217;entr&#233;e d&#8217;une r&#232;gle est une unit&#233; lexicale non fl&#233;chie munie d&#8217;une cat&#233;gorie grammaticale 
(un lex&#232;me). La sortie consiste en l&#8217;analyse compl&#232;te de ce lex&#232;me jusqu&#8217;&#224; obtention d&#8217;une 
nouvelle unit&#233; non d&#233;composable (le simple). Cette analyse, dont les &#233;tapes sont retrac&#233;es 
sous forme d&#8217;historique (4a), consiste en la construction de la famille morphologique reliant 
le lex&#232;me analys&#233; au simple (4b), en la d&#233;finition du lex&#232;me analys&#233; en fonction de la valeur 
du lex&#232;me de base (i.e. celui avec lequel il est directement reli&#233; morphologiquement) et des 
propri&#233;t&#233;s de la r&#232;gle qui relie ces deux unit&#233;s (4c). Enfin, l&#8217;analyse conduit &#233;galement &#224; 
attribuer automatiquement &#224; chaque &#233;l&#233;ment de la famille morphologique l&#8217;ensemble des 
traits qui refl&#232;tent les contraintes impos&#233;es aux lex&#232;mes par chaque r&#232;gle morphologique 
reconnue lors de l&#8217;analyse (la technique utilis&#233;e est d&#233;crite dans (Namer, 2002)). En (4d), la 
r&#232;gle reliant STIMULATEUR &#224; STIMULER dit du premier qu&#8217;il d&#233;signe un instrument ou un 
agent, et du second qu&#8217;il instancie un pr&#233;dicat dynamique et agentif.  
</p>
<p>(4) a cardio-stimulateur/N =&gt; [[card N*] [ [stimuler V] eur N] N]  
 b  (cardio-stimulateur/N , [card,N*]:stimulateur/N , stimuler/V ) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> c  &quot; Type particulier de stimulateur en rapport avec le coeur &quot; 
 d  stimuler/V : [ aspect=dynamique, sous_cat = &lt;NPagent, ...&gt; ] 
</p>
<p>stimulateur/N : [concret=oui, comptable=oui] 
Le principe fondamental de D&#233;riF (qui illustre d&#8217;une certaine mani&#232;re celui de tous les 
analyseurs &#224; base de r&#232;gles) est que l&#8217;activation d&#8217;une r&#232;gle d&#8217;analyse d&#233;pend de la d&#233;tection 
formelle ou cat&#233;gorielle d&#8217;un lex&#232;me morphologiquement construit. La d&#233;marche g&#233;n&#233;rale de 
d&#233;tection consiste pour l&#8217;essentiel en trois types de t&#226;ches, qui sont activ&#233;es r&#233;cursivement.  
</p>
<p>Type1 : rep&#233;rage d&#8217;une s&#233;quence identifiable comme un suffixe (e.g. -able), sur un lex&#232;me 
muni de la cat&#233;gorie appropri&#233;e &#224; ce suffixe (D&#201;TECTABLEA), et appel du module d&#8217;analyse du 
lex&#232;me (D&#201;TECTABLEA &lt; D&#201;TECTERV) ; chaque module pr&#233;voit, lorsque cela est 
linguistiquement motiv&#233;, le d&#233;clenchement des proc&#233;d&#233;s d&#8217;analyse de la pr&#233;fixation 
(IND&#201;TECTABLEA &lt; D&#201;TECTABLE mais RECONSTRUCTEURN &#8814;4 CONSTRUCTEURN) ou de la 
composition (THERMOD&#201;TECTEURN &lt; D&#201;TECTEURN &lt; D&#201;TECTERV mais PHOTOSENSIBILISERV &#8814; 
SENSIBILISERV). 
</p>
<p>Type2 : rep&#233;rage d&#8217;un suffixe, mais sur un lex&#232;me appartenant &#224; une cat&#233;gorie incompatible 
(PORTABLEN), et appel du module d&#8217;analyse par conversion produisant la cat&#233;gorie appropri&#233;e 
(PORTABLEN &lt; PORTABLEA). De l&#224;, les t&#226;ches de Type1 peuvent &#234;tre r&#233;envisag&#233;es. 
</p>
<p>Type3 : En l&#8217;absence de suffixe, identification d&#8217;un proc&#233;d&#233; de pr&#233;fixation (D&#201;SHERBERV &lt; 
HERBEN) ou de composition (HYDROC&#201;PHALEA &lt; &#176;c&#233;phale=T&#202;TEN), &#224; condition &#233;videmment 
que cette analyse formelle soit conforme au rapport cat&#233;goriel attendu par la r&#232;gle. 
</p>
<p>L&#8217;existence de chaque r&#233;sultat calcul&#233; est v&#233;rifi&#233;e dans un lexique de r&#233;f&#233;rence, qui regroupe 
l&#8217;ensemble des nomenclatures du TLF, et qu&#8217;enrichit un ensemble de lex&#232;mes collect&#233;s dans 
divers corpus (au total : 99.093 noms, adjectifs et verbes). Ce lexique est compl&#233;t&#233; par une 
table des &#233;l&#233;ments de formation, qui r&#233;unit la liste des 1.370 radicaux suppl&#233;tifs gr&#233;co-latins 
nominaux ou verbaux auxquels la construction du vocabulaire savant sait souvent appel. Quel 
que soit le type du module d&#8217;analyse mis &#224; contribution, il ob&#233;it &#224; deux principes : 
</p>
<p>(5) a le r&#233;sultat doit &#234;tre attest&#233; dans le lexique de r&#233;f&#233;rence 
 b l&#8217;activation d&#8217;une analyse se traduit par une &#171; d&#233;saffixation &#187; ou une 
</p>
<p>&#171; d&#233;composition &#187; (Type 1,3) ou un changement de cat&#233;gorie (Type2). 
L&#8217;analyse par r&#233;troformation des verbes compos&#233;s YXV est paralys&#233;e par (5b) qui refl&#232;te les 
fondements th&#233;oriques de l&#8217;analyseur. De surcro&#238;t, (5a) bloque la reconnaissance de leur 
&#171; base &#187; YXSfxN, &#224; chaque fois que le nom est absent du dictionnaire (ce qui souvent le cas, 
cf. &#167;.2.1).  
</p>
<p>La technique expos&#233;e au &#167;.3.2 est mise en &#339;uvre pour am&#233;liorer le syst&#232;me d&#8217;origine et 
prendre en compte ces donn&#233;es. L&#8217;int&#233;gration du module d&#8217;analyse par analogie conduit &#224; 
contourner (5a) et (5b), mais dans des circonstances contr&#244;l&#233;es par les propri&#233;t&#233;s formelles 
des unit&#233;s analys&#233;es. 
</p>
<p>                                                                                                                                                  
4  CONSTRUIT &#8814; BASE signifie que CONSTRUIT ne s&#8217;analyse pas comme d&#233;riv&#233; de BASE (cf. note 5). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique de noms d&#233;verbaux compos&#233;s  
</p>
<p>3.2 R&#233;sultats : Analyse de YXSfxN et de YXV 
Les YXSfxN pris en compte par D&#233;riF sont suffix&#233;s par -ion. En effet, ce sont ces noms de 
base qui servent le plus souvent &#224; construire les verbes YXV. Ce choix garantit donc la 
manipulation d&#8217;un corpus important pour la r&#233;alisation de l&#8217;exp&#233;rience. Pour ces YXionN, la 
seule analyse (YN + XSfxN) se d&#233;roule comme d&#233;crit au &#167;.3.1 (Type 1), puisque YXSfxN ne 
s&#8217;interpr&#232;te que comme compos&#233;. Ensuite, D&#233;riF se r&#233;applique sur le r&#233;sultat obtenu : le 
constituant t&#234;te XSfxN est reconnu comme d&#233;riv&#233; de XV. Ci-dessous, l&#8217;exemple (6) r&#233;sume la 
suite d&#8217;&#233;tapes d&#8217;analyse reliant YXSfxN &#224; XV.  
</p>
<p>Les verbes en YXV issus de la collecte d&#233;crite au &#167;.2.1 constituent, quant &#224; eux, des instances 
de formation r&#233;gressive, que D&#233;riF va donc traiter au moyen d&#8217;un raisonnement analogique. 
&#201;tant donn&#233; l&#8217;approche g&#233;n&#233;rale de D&#233;riF, ce m&#233;canisme n&#8217;est envisageable ici que gr&#226;ce aux 
particularit&#233;s des composants Y et X, qui facilitent les t&#226;ches d&#8217;identification (et d&#8217;analyse) 
des compos&#233;s &#224; traiter par analogie. La technique consiste en la succession de trois t&#226;ches :  
</p>
<p>(T1) la reconnaissance d&#8217;un verbe de la forme YX, c&#8217;est-&#224;-dire commen&#231;ant par une s&#233;quence 
appartenant &#224; la liste des &#233;l&#233;ments de formation de cat&#233;gorie nominale r&#233;unis en (1), cf. &#167;.2.1 ; 
</p>
<p>(T2) l&#8217;isolation de YN et XV ;  
</p>
<p>(T3) la reconstitution de XSfxN.  
</p>
<p>Si la suite (T1)-(T3) conduit &#224; un r&#233;sultat non nul, alors la derni&#232;re t&#226;che consiste &#224; 
concat&#233;ner YN, isol&#233; en (T2), &#224; XSfxN, reconstitu&#233; en (T3), pour former la &#171; base &#187; du 
compos&#233; verbal YXV, c&#8217;est-&#224;-dire le nom YXSfxN. Ce nom est consid&#233;r&#233; comme toujours 
possible : s&#8217;il n&#8217;est pas enregistr&#233; dans le lexique de r&#233;f&#233;rence de D&#233;riF, le syst&#232;me l&#8217;ajoute &#224; 
une liste compl&#233;mentaire. Comme l&#8217;illustre (7), l&#8217;analyse s&#8217;accompagne de la glose 
&#171; Proc&#233;der &#224; YXSfxN &#187;. Finalement, le d&#233;roulement complet de l&#8217;analyse de 
HYDRODISTILLERV donn&#233; en (8) est la succession des &#233;tapes (7) puis (6) : 
</p>
<p>(6) hydrodistillation/N =&gt; (hydrodistillation/N , [hydr,N*]:distillation/N , 
distiller/V ), &quot; Type particulier de distillation en rapport avec le(s) eau &quot; 
</p>
<p>(7) hydrodistiller/V=&gt; (hydrodistiller/V, hydrodistillation/N) &quot; Proc&#233;der &#224; 
le&#8212;la hydrodistillation &quot; 
</p>
<p>(8)  hydrodistiller/V=&gt; (hydrodistiller/V, hydrodistillation/N, 
[hydr,N*]:distillation/N, distiller/V) &quot; Proc&#233;der &#224; le&#8212;la hydrodistillation &quot;  
</p>
<p>Dans la suite (T1)-(T3), une seule t&#226;che semble pr&#233;senter quelque difficult&#233;, il s&#8217;agit de la 
reconstitution de XSfxN &#224; partir de XV. En effet, le th&#232;me (ou radical) verbal que l&#8217;on retrouve 
dans un nom &#233;v&#233;nementiel diff&#232;re du th&#232;me verbal de l&#8217;infinitif, comme en t&#233;moignent les 
exemples dans le Tab. 2, o&#249; le nom est suffix&#233; par -ion. Dans ce cas (Bonami et Boy&#233;, 2003, 
Bonami et al., 2009), le th&#232;me d&#8217;un verbe XV s&#233;lectionn&#233; par la RCL-ion, dit th&#232;me cach&#233;, 
correspond par d&#233;faut au radical du supin du verbe latin dont est issu XV, et n&#8217;est jamais 
s&#233;lectionn&#233; en flexion.  
</p>
<p>Th&#232;me du verbe &#224; l&#8217;infinitif Th&#232;me utilis&#233; par la RCL-ion 
distill (DISTILLER) distillat (DISTILLATION) 
r&#233;dui (R&#201;DUIRE) r&#233;duct (R&#201;DUCTION) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>fl&#233;chi (FL&#201;CHIR) flex (FLEXION) 
Tab. 2 : Correspondance entre le th&#232;me de X &#224; l&#8217;infinitif et son th&#232;me cach&#233;  
</p>
<p>La r&#233;solution de ce probl&#232;me d&#8217;appariement est facilit&#233; par le fait que D&#233;riF dispose d&#233;j&#224; 
d&#8217;une table de correspondances, dont le Tab. 2 constitue un &#233;chantillon. Cette table, inspir&#233;e 
de la liste Verbaction (Hathout, 2001, Hathout, 2003) comporte environ 2.200 paires form&#233;es 
d&#8217;un verbe &#224; l&#8217;infinitif et de son th&#232;me cach&#233;, et est utilis&#233;e pour l&#8217;analyse des noms en -ion et 
en -eur, comme en t&#233;moignent, respectivement, la relation formelle entre STIMULATEURN et 
STIMULERV en (4), et celle qu&#8217;&#233;tablissent DISTILLATIONN et DISTILLERV en (8). La seule 
op&#233;ration &#224; effectuer pour r&#233;aliser (T3) est par cons&#233;quent la consultation de la table de 
correspondances invers&#233;e.  
</p>
<p>En somme, l&#8217;analyse des YXV contrevient aux principes de D&#233;riF &#233;dict&#233;s en (5) : les noms de 
base en YXSfxN absents du r&#233;f&#233;rentiel servent &#224; incr&#233;menter celui-ci (ce qui s&#8217;oppose &#224; 5a), et 
l&#8217;activation de l&#8217;analyse consiste en la reconstitution du d&#233;verbal suffix&#233; YXSfxN, par 
analogie avec le rapport identifiable entre XV et XSfxN (ce qui contourne 5b). Le 
d&#233;clenchement du module d&#8217;analyse par analogie &#233;tant ma&#238;tris&#233; par l&#8217;identification formelle 
d&#8217;un &#233;l&#233;ment de formation YN sur une forme YXV, les risques du surg&#233;n&#233;ration (ou de boucle 
infinie) sont &#233;cart&#233;s.  
</p>
<p>3.3 Bilan, Perspectives 
Pour valider int&#233;gralement cette &#233;tude, dont les r&#233;sultats n&#8217;ont &#233;t&#233; obtenus que pour le corpus 
compos&#233; des 3.400 noms en -ion et des 800 verbes apparent&#233;s, il est n&#233;cessaire de r&#233;it&#233;rer le 
processus de collecte pour les noms en YXageN, YXmentN, YXanceN de mani&#232;re &#224; v&#233;rifier que 
le nombre de ces donn&#233;es corrobore l&#8217;estimation propos&#233;e au &#167;.2.1. Il appara&#238;t, lors de 
premi&#232;res exp&#233;riences, que les noms d&#233;riv&#233;s de verbes statifs (ABONDANCE, EXISTANCE) sont 
des composants le plus souvent impropres &#224; la formation de YXSfxN (G&#201;OAPPARTENANCE 
constitue l&#8217;une des rares exceptions). On constate &#233;galement que d&#8217;autres classes s&#233;mantiques 
de pr&#233;dicats, comme les verbes d&#8217;apparition ou d&#8217;&#233;mission de substance, cf. (Levin, 1995) 
sont des bases possibles pour les noms en YXSfxN (&#201;LECTRO&#201;MISSION) mais le verbe YXV 
apparent&#233; n&#8217;existe pas. Ces observations nous portent &#224; formuler des hypoth&#232;ses sur les 
conditions de formation de YXV, qui, si elles sont av&#233;r&#233;es, conduisent en retour &#224; pr&#233;dire les 
propri&#233;t&#233;s aspectuelles du verbe XV qui en est &#224; l&#8217;origine. Ainsi, on peut d&#8217;ores et d&#233;j&#224; inf&#233;rer 
la dynamicit&#233; du pr&#233;dicat incarn&#233; par XV de l&#8217;existence de YXSfxN. Une &#233;tude plus compl&#232;te, 
portant sur l&#8217;ensemble des YXV et des YXSfxN r&#233;pertori&#233;s sur la Toile, doit permettre de 
pr&#233;dire, suivant l&#8217;attestation ou non du verbe et/ou du nom compos&#233;, des valeurs plus pr&#233;cises 
portant sur l&#8217;aspect et la transitivit&#233; pour le verbe XV dont d&#233;rivent ces compos&#233;s. Une autre 
source d&#8217;information est apport&#233;e par les relations actantielles que tisse YN avec XV, et la 
fr&#233;quence avec laquelle chaque relation est observ&#233;e : YN joue-t-il majoritairement le r&#244;le du 
patient de XV (CUTI-R&#201;ACTION, HYDROPOMPAGE, THERMOR&#201;GULER) ? Dans ce cas, on peut 
pr&#233;sager que XV est soit transitif, soit inaccusatif. YN fonctionne-t-il au contraire 
essentiellement comme ajout instrumental de XV (THERMOCOMPRIMER, 
&#201;LECTRONETTOYAGE) ? Cela pourrait signifier que XV d&#233;signe un accomplissement (la finalit&#233; 
du pr&#233;dicat n&#233;cessitant l&#8217;intervention de cet instrument). En somme, le croisement des 
informations apport&#233;es par l&#8217;existence et la fr&#233;quence des YXV et des YXSfxN, avec celles 
d&#233;duites de la structure interne de ces compos&#233;s va servir &#224; enrichir le potentiel d&#8217;annotations 
syntaxico-s&#233;mantiques sur XV, suivant le m&#233;canisme d&#8217;affectation de traits appliqu&#233; lors de 
chaque analyse par D&#233;riF sur le construit et sa base, comme cela est illustr&#233; au &#167;.3.1, exemple 
(4d). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse automatique de noms d&#233;verbaux compos&#233;s  
</p>
<p>4 Conclusion 
Nous avons propos&#233; une exp&#233;rience d&#8217;analyse de noms et verbes morphologiquement 
complexes, le plus souvent n&#233;ologiques, formant un corpus estim&#233; &#224; 5.400 unit&#233;s. En marge 
de l&#8217;analyse de ces lex&#232;mes, qui combine d&#233;composition morphologique et annotation 
s&#233;mantique, le syst&#232;me r&#233;alise en outre l&#8217;enrichissement automatique d&#8217;un lexique de 
r&#233;f&#233;rence au moyen des bases calcul&#233;es par l&#8217;analyseur, quand elles sont n&#233;ologiques. Cet 
ajout automatique refl&#232;te la disponibilit&#233; syst&#233;matique de la base, en tant que lex&#232;me que le 
locuteur peut vouloir cr&#233;er &#224; tout moment. L&#8217;originalit&#233; de l&#8217;approche pr&#233;sent&#233;e r&#233;side dans le 
fait qu&#8217;analogie et r&#232;gles collaborent, ce, gr&#226;ce &#224; l&#8217;identification de marqueurs formels 
caract&#233;risant les donn&#233;es &#224; traiter. L&#8217;objectif est de fournir &#224; ces donn&#233;es une analyse 
linguistiquement motiv&#233;e accompagn&#233;e d&#8217;une d&#233;finition calcul&#233;e &#224; partir du sens de leur base 
morphologique. Les m&#233;thodes et r&#233;sultats pr&#233;sent&#233;s dans cet article nous ont permis de 
confirmer une fois de plus le r&#244;le de la Toile dans la d&#233;couverte de donn&#233;es lexicales 
massives (Hathout et al., 2009)5, donn&#233;es qui pourtant illustrent des ph&#233;nom&#232;nes peu pris en 
compte en traitement automatique, et consid&#233;r&#233;s comme p&#233;riph&#233;riques par les th&#233;ories 
morphologiques. La coop&#233;ration, m&#234;me limit&#233;e, entre analogie et r&#232;gles indique comment un 
syst&#232;me peut mettre en &#339;uvre un raisonnement psycholinguistiquement plausible, tout en 
privil&#233;giant autant que possible les solutions d&#8217;analyse les plus efficaces. 
</p>
<p>Enfin, il est int&#233;ressant de remarquer que les noms et verbes compos&#233;s dont il a &#233;t&#233; question 
ici partagent deux propri&#233;t&#233;s qui se recoupent : (1) ils appartiennent le plus souvent, en tant 
que compos&#233;s n&#233;oclassiques, &#224; des vocabulaires sp&#233;cialis&#233;s vari&#233;s (m&#233;decine, chimie, 
botanique, a&#233;ronautique, etc&#8230;) ; (2) ils existent dans plusieurs langues romanes (voire de 
toute l&#8217;Europe de l&#8217;ouest), avec la m&#234;me structure, la m&#234;me fr&#233;quence d&#8217;apparition, les 
m&#234;mes conditions de formation, les m&#234;mes sp&#233;cificit&#233;s morphos&#233;mantiques. De ce fait, le 
raisonnement analogique mis en pratique pour le fran&#231;ais devrait &#234;tre ais&#233;ment g&#233;n&#233;ralisable.  
</p>
<p>R&#233;f&#233;rences 
BAKER M.C. (1988). Incorporation A theory of Grammatical Function Changing. Chicago: 
UCP. 
BECKER T. (1993). Back-formation, cross-formation, and 'bracketing paradoxes' in 
paradigmatic morphology. Yearbook of Morphology 1992:1-27. 
BERNHARD D. (2007). Apprentissage non supervis&#233; de familles morphologiques par 
classification ascendante hi&#233;rarchique. TALN-2007, Toulouse:367-376. 
BONAMI O., BOY&#201; G. (2003). Suppl&#233;tion et classes flexionnelles. Langages 152:103-126. 
BONAMI O., BOY&#201; G., KERLEROUX F. (2009). L'allomorphie radicale et la relation flexion-
construction. In Aper&#231;us de Morphologie du fran&#231;ais, eds. B. Fradin, F. Kerleroux &amp; M. 
Pl&#233;nat, Paris: Presses Universitaires de Vincennes, 103-126. 
CLAVEAU V., L'HOMME M.-C. (2005). Apprentissage par analogie pour la structuration de 
terminologie - Utilisation compar&#233;e de ressources endog&#232;nes et exog&#232;nes. TIA, Rouen. 
</p>
<p>                                                                                                                                                  
5  Au sujet les discussions portant sur l&#8217;usage de la Toile comme corpus et les pr&#233;cautions &#224; prendre, voir entre 
</p>
<p>autres (Grefenstette, 1999, L&#252;deling et al., 2007, Resnik et Elkiss, 2005). Sur l&#8217;usage de la Toile dans une 
perspective d&#8217;acquisition morphologique, se r&#233;f&#233;rer par exemple &#224; (Namer, 2003a) ou (Hathout et Tanguy, 
2005). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CREISSELS D. (2005). Syntaxe G&#233;n&#233;rale, une introduction typologique 2 : la phrase: Langues 
et syntaxe. Paris: Herm&#232;s-Lavoisier. 
DAL G. (2008). L'analogie dans le domaine du lexique construit : un retour ? 1er Colloque 
Mondial de Linguistique Fran&#231;aise, Paris:1575-1587. 
FRADIN B. (2003). Nouvelles approches en morphologie. Paris: PUF. 
GAUSSIER E., GREFENSTETTE G., HULL A. D., ROUX C. (2000). Recherche d'information et 
traitement automatique des langues. Traitement Automatique des Langues 41:473-493. 
GOLDSMITH J. (2001). Unsupervised Learning of Morphology of a Natural Language. 
Computational Linguistics 27:153-198. 
GREFENSTETTE G. (1999). The WWW as a Resource for Example-Based MT Tasks. ASLIB 
'Translating and the Computer' Conference, London. 
HASPELMATH M. (2002). Understanding Morphology: Understanding Language. London: 
Arnold. 
HATHOUT N. (2001). Analogies morpho-synonymiques. Une m&#233;thode d'acquisition 
automatique de liens morphologiques &#224; partir d'un dictionnaire de synonymes. TALN-2001, 
Tours. 
HATHOUT N. (2003). L'analogie, un moyen de croiser les contraintes et les paradigmes. Revue 
d'Intelligence Artificielle:923-934. 
HATHOUT N., TANGUY L. (2005). Webaffix : une bo&#238;te &#224; outils d'acquisition lexicale &#224; partir 
du Web. Revue Qu&#233;becoise de Linguistique 32:61-84. 
HATHOUT N., NAMER F., PL&#201;NAT M., TANGUY L. (2009). La collecte et l'utilisation des 
donn&#233;es en morphologie. In Aper&#231;us de Morphologie du fran&#231;ais, eds. B. Fradin, F. 
Kerleroux &amp; M. Pl&#233;nat, Paris: Presses Universitaires de Vincennes, 267-287. 
HULL A. D. (1996). Stemming Algorithms - A case study for detailed evaluation. Journal of 
the American Society of Information Science 47:70-84. 
LEVIN B., RAPPAPORT HOVAV M. (1995). Unaccusativity. Cambridge, MA: MIT Press. 
L&#220;DELING A., EVERT S., BARONI M. (2007). Using Web Data for Linguistic Purposes. In 
Corpus Linguistics and the Web, eds. M. Hundt, N. Nesselhauf &amp; C. Biewer, Amsterdam: 
Rodopi, 7-24. 
MITHUN M. (1984). The evolution of noun incorporation. Language 60:847-894. 
MOREAU F., CLAVEAU V. (2006). Extension de requ&#234;tes par relations morphologiques 
acquises automatiquement. Revue I3 (Information - Interaction - Intelligence) 6:31-50. 
NAGANO A. (2007). Marchand's analysis of back-formation revisited: back-formation as a 
type of conversion. Acta Linguistica Hungarica 54:33-72. 
NAMER F. (2002). Acquisition automatique de sens &#224; partir d'op&#233;rations morphologiques en 
fran&#231;ais : &#233;tudes de cas. TALN-2002, Nancy, France:235-244. 
NAMER F. (2003a). WaliM : valider les unit&#233;s morphologiquement complexes par le Web. In 
Silexicales 3 : les unit&#233;s morphologiques, eds. B. Fradin et al., Villeneuve d'Ascq: Presses 
Universitaires du Septentrion, 142-150. 
NAMER F. (2003b). Automatiser l'analyse morpho-s&#233;mantique non affixale : le syst&#232;me D&#233;riF 
In Cahiers de Grammaire, eds. N. Hathout, M. Roch&#233; &amp; N. Serna, Toulouse: ERSS, 31-48. 
PORTER M. F. (1980). An algorithm for suffix stripping. Program 14:130-137. 
RESNIK P., ELKISS A. (2005). The linguist&#8217;s search engine: an overview. 43rd Association for 
Computational Linguistics (ACL), Ann Arbor, MI:33-36. 
SAVOY J. (1999). A stemming procedure and stopword list for general French corpora. 
Journal of the American Society for Information Science 50:944 - 952. 
SKOUSEN R., LONSDALE D., PARKINSON D. B. eds. (2002). Analogical Modeling. 
Amsterdam/Philadelphia: Benjamins. 
ZWEIGENBAUM P., HADOUCHE F., GRABAR N. (2003). Apprentissage de relations 
morphologiques en corpus. TALN-2003, Batz-sur-Mer:285-294. </p>

</div></div>
</body></html>