<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers des contraintes plus linguistiques en r&#233;solution de cor&#233;f&#233;rences</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Vers des contraintes plus linguistiques en r&#233;solution de
cor&#233;f&#233;rences
</p>
<p>&#201;tienne Ailloud Manfred Klenner
Institute of Computational Linguistics
</p>
<p>Zurich University
Zurich, Switzerland
</p>
<p>{ailloud,klenner}@cl.uzh.ch
</p>
<p>R&#233;sum&#233;. Nous proposons un mod&#232;le filtrant de r&#233;solution de cor&#233;f&#233;rences bas&#233; sur les
notions de transitivit&#233; et d&#8217;exclusivit&#233; linguistique. &#192; partir de l&#8217;hypoth&#232;se g&#233;n&#233;rale que les
cha&#238;nes de cor&#233;f&#233;rence demeurent coh&#233;rentes tout au long d&#8217;un texte, notre mod&#232;le assure le
respect de certaines contraintes linguistiques (via des filtres) quant &#224; la cor&#233;f&#233;rence, ce qui
am&#233;liore la r&#233;solution globale. Le filtrage a lieu &#224; diff&#233;rentes &#233;tapes de l&#8217;approche standard
(c-&#224;-d. par apprentissage automatique), y compris avant l&#8217;apprentissage et avant la classification,
acc&#233;l&#233;rant et am&#233;liorant ce processus.
</p>
<p>Abstract. We propose a filter model of coreference resolution that is based on the notions
of transitivity and linguistic exclusivity. Starting from the general assumption that coreference
sets remain coherent throughout a text, our model enforces the checking of some compatibil-
ity criteria (filters) between coreference candidates, thereby improving resolution performance.
This filtering is achieved at different stages of the workflow of machine-learning-based corefer-
ence resolution, including at the standard learning and testing steps, where it may help reduce
the computational load and better distribute the actual occurrences to be learned.
</p>
<p>Mots-cl&#233;s : R&#233;solution de cor&#233;f&#233;rences, apprentissage automatique, linguistique infor-
matique par contraintes.
</p>
<p>Keywords: Coreference resolution, Machine learning, Constraint-based NLP.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tienne Ailloud, Manfred Klenner
</p>
<p>1 Introduction
</p>
<p>La r&#233;solution de cor&#233;f&#233;rences est une t&#226;che utile dans de nombreuses applications de traitement
du langage naturel, par exemple l&#8217;extraction d&#8217;informations. Pour identifier une entit&#233; parmi
un ensemble de documents, il est crucial de pouvoir identifier les diverses expressions pouvant
y r&#233;f&#233;rer, y compris les expressions anaphoriques (p. ex.des pronoms). Trouver un ant&#233;c&#233;dent
&#224; chacune de celles-ci se nomme la r&#233;solution d&#8217;anaphores, trouver toutes les occurrences de
la m&#234;me entit&#233; est la r&#233;solution de cor&#233;f&#233;rences, plus g&#233;n&#233;rale. Mais m&#234;me pour la r&#233;solution
d&#8217;anaphores comme sous-t&#226;che, les syst&#232;mes actuels ont encore des performances insatisfai-
santes (entre 55% et 70% pour la F-mesure sur donn&#233;es r&#233;elles). L&#8217;approche standard consiste
&#224; entra&#238;ner un mod&#232;le d&#8217;apprentissage automatique &#224; produire des d&#233;cisions binaires (des r&#233;-
ponses &#224; &#171; L&#8217;expression a cor&#233;f&#232;re-t-elle avec l&#8217;expression b ? &#187;).
</p>
<p>Le probl&#232;me majeur dans l&#8217;approche informatique de la r&#233;solution de cor&#233;f&#233;rences est son
manque de contraintes : l&#8217;&#233;ventail des contraintes qui r&#233;gissent le ph&#233;nom&#232;ne de cor&#233;f&#233;rence
est plus large que ce qui peut &#234;tre correctement mod&#233;lis&#233; &#224; l&#8217;heure actuelle. Par exemple, se
restreindre aux seules contraintes morpho-syntaxiques jouant sur diff&#233;rentes expressions lin-
guistiques ne suffit pas, dans beaucoup de langues (m&#234;me celles morphologiquement marqu&#233;es
comme l&#8217;allemand), &#224; discriminer suffisamment entre diff&#233;rent candidats potentiellement r&#233;f&#233;-
rents (les markables). Les contraintes n&#233;cessaires ici sont issues d&#8217;autres couches du traitement
du langage : s&#233;mantique, pragmatique. En l&#8217;absence de ces contraintes de haut niveau, la r&#233;solu-
tion de cor&#233;f&#233;rences devient un probl&#232;me combinatoire : l&#8217;&#233;num&#233;ration de toutes les possibilit&#233;s
(c-&#224;-d. toutes les paires de markables) occupe vite trop d&#8217;espace en m&#233;moire. Aussi la r&#233;duction
de l&#8217;espace de recherche constitue-t-elle la pierre d&#8217;achoppement de la plupart des approches
d&#8217;apprentissage automatique : pour rester r&#233;alisables, celles-ci sont restreintes par des heuris-
tiques qui font que seulement une partie des possibilit&#233;s est explor&#233;e. Par exemple, on se limite
g&#233;n&#233;ralement &#224; des paires de markables (en se fondant sur le postulat usuel que l&#8217;observation
binaire est suffisante pour capturer le ph&#233;nom&#232;ne de cor&#233;f&#233;rence) ; la r&#233;solution de cor&#233;f&#233;rences
est g&#233;n&#233;ralement restreinte en port&#233;e, &#233;galement : en utilisant p. ex. des fen&#234;tres mobiles (la
derni&#232;re r&#233;f&#233;rence &#224; une entit&#233; connue &#233;tant susceptible d&#8217;appara&#238;tre dans un contexte r&#233;cent).
</p>
<p>Consid&#233;rons l&#8217;exemple en allemand suivant, dans lequel diff&#233;rents constituants nominaux mas-
culins font r&#233;f&#233;rence &#224; deux entit&#233;s diff&#233;rentes :
</p>
<p>[Der jugoslawische Pr&#228;sident]i ist in diesem Sinne kalt, denn [er]j kennt [[seinen]k
Westen]l. [Er]m hat [ihn]n dort studiert, wo [er]p am westlichsten ist, als Banker in
New York.
[The Yugoslavian president]i is in this sense cold, for [he]j knows [[his]k western
society]l. [He]m studied [it]n where [it]p is at its most west-like, as a banker in New
York.
</p>
<p>La traduction anglaise de ces phrases r&#233;v&#232;le imm&#233;diatement les cor&#233;f&#233;rences, &#224; travers l&#8217;op-
position masculin/neutre. Cependant, la morphologie allemande ne permet pas de distinguer
ces syntagmes les uns des autres, tous de m&#234;me genre, nombre et personne, alors que la lec-
ture pr&#233;f&#233;r&#233;e donne i &#8801; j &#8801; k &#8801; m 6&#8801; l &#8801; n &#8801; p (ou, comme cha&#238;nes de cor&#233;f&#233;rence :
{{i, j, k,m}, {l, n, p}}).
On peut aussi formuler des restrictions de port&#233;e plus g&#233;n&#233;rale (non locale), p. ex. la transitivit&#233;.
Celle-ci permet, coupl&#233;e avec l&#8217;exclusivit&#233;, d&#8217;exclure des paires de cor&#233;f&#233;rence impossibles (en
consid&#233;rant la partition en classes d&#8217;&#233;quivalence selon la relation &#8801;) : Sachant que j 6&#8801; l1,
</p>
<p>1. &#171; A non-reflexive pronoun must not be coindexed with a c-commanding NP within the minimal NP or S that</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des contraintes plus linguistiques en r&#233;solution de cor&#233;f&#233;rences
</p>
<p>chercher &#224; lier [Er]m dans la phrase pr&#233;c&#233;dente oblige &#224; choisir (de mani&#232;re exclusive) soit
m &#8801; j, soit m &#8801; l. Cette observation simple limite le choix de cha&#238;nes de cor&#233;f&#233;rence &#224; deux
possibilit&#233;s (pour les trois markables consid&#233;r&#233;s) : {{j,m}, {l}} et {{j}, {l,m}} ; Pourtant
un classifieur automatique, limit&#233; dans sa vision binaire, peut &#233;ventuellement produire &#224; la
fois m &#8801; j et m &#8801; l, induisant par transitivit&#233; la cha&#238;ne de cor&#233;f&#233;rence {{m, j, l}}. Celle-
ci est inconsistante en ce qu&#8217;elle implique que j &#8801; l, bien que la paire (j, l) n&#8217;ait jamais &#233;t&#233;
consid&#233;r&#233;e elle-m&#234;me (car elle contredit l&#8217;exclusivit&#233; du sujet j et de l&#8217;objet non-r&#233;flexif l).
Nous y reviendrons en partie 3.
</p>
<p>La transitivit&#233; et l&#8217;exclusivit&#233; sont deux restrictions dures, la premi&#232;re &#233;tant m&#234;me ind&#233;pen-
dante d&#8217;une quelconque th&#233;orie syntaxique : c&#8217;est plut&#244;t au manque de consistance logique
qu&#8217;elle s&#8217;attaque. Ceci n&#8217;a pas &#233;t&#233; r&#233;ellement abord&#233; dans la litt&#233;rature (voir cependant (Finkel
&amp; Manning, 2008) ou (Denis &amp; Baldridge, 2008a)), alors que nous montrons qu&#8217;elle peut am&#233;-
liorer les performances globales de la r&#233;solution de cor&#233;f&#233;rences. L&#8217;&#233;limination des paires de
markables qui contredisent la transitivit&#233;, coupl&#233;e &#224; une notion d&#8217;exclusivit&#233; adapt&#233;e, constitue
une sorte de filtre de consistance.
</p>
<p>Dans la prochaine partie nous d&#233;crirons le contexte g&#233;n&#233;ral de l&#8217;apprentissage automatique o&#249;
se situe notre mod&#232;le. Puis la partie 3 ira plus en d&#233;tails dans les concepts-cl&#233;s de transitivit&#233; et
d&#8217;exclusivit&#233;, conduisant &#224; la description du mod&#232;le lui-m&#234;me en partie 4. Nous pr&#233;senterons
des r&#233;sultats exp&#233;rimentaux &#224; l&#8217;appui en partie 5, et des approches comparables en partie 6.
</p>
<p>2 Apprentissage automatique de paires de cor&#233;f&#233;rence
</p>
<p>En partant d&#8217;une liste demarkables&#8212;les objets linguistiques se r&#233;f&#233;rant potentiellement aux en-
tit&#233;s du discours&#8212;et des informations s&#8217;y rapportant (leurs traits linguistiques, p. ex.), l&#8217;objectif
est de pr&#233;dire lesquels sont cor&#233;f&#233;rents parmi des markables non vus. La plupart des approches
sont bas&#233;es sur l&#8217;apprentissage automatique de paires de markables. Une seconde phase agr&#232;ge
les markables cor&#233;f&#233;rents en classes d&#8217;&#233;quivalence (les cha&#238;nes de cor&#233;f&#233;rence).
</p>
<p>Traits Le classifieur extrait l&#8217;information qui lui est utile d&#8217;un ensemble de traits, d&#233;termin&#233;s
&#224; partir des markables ou de paires d&#8217;iceux en utilisant l&#8217;information linguistique accessible ; ils
sont relatifs &#224; : la structure superficielle (p. ex. la distance entre deux markables), la morpho-
syntaxe (p. ex. leur fonction grammaticale), de la s&#233;mantique basique (p. ex. la compatibilit&#233;
ontologique des markables). D&#8217;un point de vue linguistique, certains traits encodent en fait
peu d&#8217;information, comme la distance entre deux markables ; certains sont plus ou moins une
transcription directe de l&#8217;information fournie (p. ex. quand les cat&#233;gories lexicales elles-m&#234;mes
sont utilis&#233;es comme traits).
</p>
<p>Phase d&#8217;agr&#233;gation Une cons&#233;quence importante de la production de paires de markables
est qu&#8217;un post-traitement est n&#233;cessaire pour acc&#233;der aux cha&#238;nes de cor&#233;f&#233;rence. Celles-ci sont
obtenues en fusionnant les paires de markables cor&#233;f&#233;rents en classes d&#8217;&#233;quivalence. Leur im-
portance, par opposition aux seules paires en sortie, se refl&#232;te aussi dans le sch&#233;ma d&#8217;&#233;valuation :
la mesure standard MUC (Vilain et al., 1995), de m&#234;me que son extension B3 (Bagga &amp; Bald-
win, 1998), mesure l&#8217;harmonie des r&#233;sultats avec le gold standard plut&#244;t sur le plan des cha&#238;nes
</p>
<p>contains it. &#187; (cf. (Chierchia &amp; McConnell-Ginet, 1990))</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tienne Ailloud, Manfred Klenner
</p>
<p>que des paires. Ceci est d&#8217;autant plus vrai pour la nouvelle mesure ECM (introduite dans (Luo,
2005)), qui cherche d&#8217;abord &#224; aligner les cha&#238;nes de cor&#233;f&#233;rence avec le standard et ensuite
seulement calcule les r&#233;sultats.
</p>
<p>L&#8217;exemple de l&#8217;introduction illustre le probl&#232;me majeur dans le traitement binaire de la cor&#233;f&#233;-
rence : L&#8217;agr&#233;gation canonique de markables &#224; partir de paires, par simple fusionnement (c-&#224;-d.
quand deux markables appartiennent &#224; la m&#234;me cha&#238;ne ss&#8217;ils forment une paire cor&#233;f&#233;rente),
induit une inconsistance dans les cha&#238;nes de cor&#233;f&#233;rence.2 Cette inconsistance est in&#233;vitable, car
le classifieur binaire consid&#232;re les paires de markables comme des &#233;v&#233;nements ind&#233;pendants : il
ne peut pas apprendre &#224; faire le rapprochement entre deux paires, m&#234;me si elles ont un &#233;l&#233;ment
en commun&#8212;il ne peut pas apprendre la transitivit&#233;.
</p>
<p>D&#8217;autres proc&#233;d&#233;s d&#8217;agr&#233;gation plus sophistiqu&#233;s produisent de l&#8217;inconsistance de la m&#234;me ma-
ni&#232;re. Ils fonctionnent de gauche &#224; droite de mani&#232;re incr&#233;mentielle, en assignant &#224; chaque
&#171; anaphore &#187; un &#171; ant&#233;c&#233;dent &#187; idoine parmi les markables la pr&#233;c&#233;dant.3 L&#8217;agr&#233;gation closest-
first consiste &#224; prendre pour cela le premier markable satisfaisant dans le contexte gauche de
l&#8217;anaphore (voir p. ex. (Soon et al., 2001)). L&#8217;agr&#233;gation best-first constitue tout d&#8217;abord une
liste de candidats &#224; l&#8217;ant&#233;c&#233;dence dans le contexte gauche, puis s&#233;lectionne parmi ceux-ci ce-
lui qui, avec l&#8217;anaphore, maximise une certaine probabilit&#233; de cor&#233;f&#233;rence (voir p. ex. (Ng &amp;
Cardie, 2002)). Typiquement, un classifieur produit non seulement une d&#233;cision binaire mais
aussi un poids associ&#233; &#224; cette d&#233;cision, ce dernier mesurant ladite probabilit&#233;. La construc-
tion de cha&#238;nes d&#8217;entit&#233;s cor&#233;f&#233;rentes commune &#224; ces deux proc&#233;d&#233;s est incr&#233;mentielle et glou-
tonne ; nous appelons ces approches &#171; na&#239;ves &#187;. L&#8217;agr&#233;gation na&#239;ve (comptant aussi la canonique
aggressive-merging) ne garantit pas la consistance. Une prise en compte globale de la transiti-
vit&#233; comme nous le proposons est un moyen d&#8217;y rem&#233;dier.
</p>
<p>3 Transitivit&#233; et exclusivit&#233;
</p>
<p>Comme requis pour la consistance (logique), nous consid&#233;rons la relation de cor&#233;f&#233;rence com-
me une relation math&#233;matique, dont les cha&#238;nes de cor&#233;f&#233;rence sont les classes d&#8217;&#233;quivalence.
L&#8217;exemple a montr&#233; plus haut que l&#8217;apprentissage automatique binaire suivi d&#8217;une agr&#233;gation
na&#239;ve sont vou&#233;s &#224; produire des cha&#238;nes inconsistantes. Une solution est d&#8217;agr&#233;ger diff&#233;remment
les paires de markables en cha&#238;nes, en autorisant le mod&#232;le &#224; r&#233;viser ces d&#233;cisions binaires afin
de garantir transitivit&#233; et exclusivit&#233;. Cette approche est plut&#244;t rare dans la litt&#233;rature, sans doute
&#224; cause de la complexit&#233; de mod&#233;lisation : la transitivit&#233; est une contrainte globale, &#224; valider
sur la totalit&#233; d&#8217;un texte/paragraphe/unit&#233; de discours. La prendre en compte exhaustivement
implique une complexit&#233; de calcul &#233;lev&#233;e.4
</p>
<p>On peut distinguer deux types d&#8217;entorse &#224; la consistance :
</p>
<p>1. Auto-contradiction : une r&#232;gle d&#8217;exclusivit&#233; est enfreinte. Ceci constitue une forme faible
</p>
<p>2. Dans l&#8217;exemple et son traitement putatif du texte &#171; [. . .] er kennt seinen Westen. Er [. . .] &#187; par apprentissage
automatique, ceci reviendrait &#224; fusionner les deux d&#233;cisions binaires {[seinen Westen]l, [Er]m} et {[er]j , [Er]m} en
la cha&#238;ne de cor&#233;f&#233;rence {[er]j , [seinen Westen]l, [Er]m}&#8212;inconsistante parce que j 6&#8801; l.
</p>
<p>3. Ils sont traditionnellement nomm&#233;s ainsi par souci de g&#233;n&#233;ralit&#233;, mais une relation cataphorique, p. ex., sera
bien s&#251;r orient&#233;e dans l&#8217;autre direction. N&#233;anmoins, la phase d&#8217;agr&#233;gation ne conna&#238;t qu&#8217;une direction.
</p>
<p>4. &#201;tant donn&#233;s n markables, il y a n(n&#8722;1)(n&#8722;2)2 possibilit&#233;s d&#8217;exprimer la transitivit&#233; entre trois quelconques
d&#8217;entre eux, comme dans : &#171; si i et j sont cor&#233;f&#233;rents et j et k aussi, alors i et k aussi &#187;. La contrainte de transitivit&#233;
est donc cubiquement quantifi&#233;e en le nombre de markables, ce qui implique que, pour &#234;tre exhaustif, la complexit&#233;
de tout algorithme traitant de mani&#232;re extensionnelle ces contraintes doit &#234;tre major&#233;e par un exposant trois.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des contraintes plus linguistiques en r&#233;solution de cor&#233;f&#233;rences
</p>
<p>(et linguistique) d&#8217;inconsistance, puisqu&#8217;elle pourrait &#233;ventuellement &#234;tre d&#233;tect&#233;e et &#233;vi-
t&#233;e par un classifieur automatique. Un exemple est de poser j &#8801; l dans l&#8217;exemple plus
haut ;
</p>
<p>2. Contradiction indirecte : l&#8217;exclusivit&#233; et la transitivit&#233; se contredisent. Dans ce cas la
paire fautive n&#8217;est m&#234;me pas g&#233;n&#233;r&#233;e (par le classifieur), mais appara&#238;t implicitement par
transitivit&#233;. C&#8217;est cela-m&#234;me que notre mod&#232;le vise principalement &#224; am&#233;liorer : l&#8217;incon-
sistance ne peut &#234;tre lev&#233;e m&#234;me avec des filtres durs (cf. partie 4), qui eux aussi sont
locaux et confin&#233;s &#224; leur perspective binaire.
</p>
<p>Dans le cas de deux paires transitivement inconsistantes, la question se pose quant &#224; laquelle
instantier positivement. Ceci met au jour la non-localit&#233; du processus de d&#233;cision : pour r&#233;soudre
exactement ce probl&#232;me, il faudrait effectuer une optimisation globale ; les poids de paires iso-
l&#233;es ne suffisent pas pour fournir la solution globalement optimale. En fait, il faudrait pond&#233;rer
des partitions enti&#232;res de cha&#238;nes de cor&#233;f&#233;rence pour y acc&#233;der, et optimiser sur toutes les ma-
ni&#232;res de partitionner un ensemble de markables. Ceci se trouve &#234;tre l&#8217;espace de recherche de la
r&#233;solution de cor&#233;f&#233;rences, l&#8217;arbre de Bell. Malheureusement sa taille est r&#233;dhibitoire, limitant
son exploration &#224; des heuristiques (comme dans (Luo et al., 2004), o&#249; l&#8217;arbre est &#233;lagu&#233; selon
un mod&#232;le statistique, qui n&#8217;a plus alors le b&#233;n&#233;fice de l&#8217;optimalit&#233;).
</p>
<p>Notre mod&#232;le constitue de m&#234;me une solution alternative (gloutonne) &#224; l&#8217;optimisation. Il con-
siste &#224; r&#233;organiser l&#8217;espace de recherche (comme heuristique) : en permettant aux d&#233;cisions les
plus fiables d&#8217;&#234;tre &#233;valu&#233;es d&#8217;abord. Il pallie la non-localit&#233; par une approche incr&#233;mentielle qui
aborde la transitivit&#233; de mani&#232;re intensionnelle ; nous le pr&#233;sentons dans la prochaine partie.
</p>
<p>4 Notre mod&#232;le filtrant
</p>
<p>Dans cette partie nous d&#233;crivons la r&#233;duction des possibilit&#233;s op&#233;r&#233;e par notre mod&#232;le au moyen
de filtres appliqu&#233;s sur les paires apprises et classifi&#233;es et pendant l&#8217;agr&#233;gation. L&#8217;exclusivit&#233; est
r&#233;alis&#233;e par ce filtrage sur la g&#233;n&#233;ration de vecteurs puis sur l&#8217;agr&#233;gation, la transitivit&#233; par
l&#8217;incr&#233;mentialit&#233; de l&#8217;agr&#233;gation.
</p>
<p>Filtrage de la g&#233;n&#233;ration de vecteurs La premi&#232;re &#233;tape consiste &#224; s&#233;lectionner les donn&#233;es
&#224; passer par l&#8217;apprentissage automatique : Nous utilisons des filtres durs pour r&#233;duire le nombre
de ces instances (repr&#233;sent&#233;es par des vecteurs de traits)&#8212;en apprentissage et en classification.
Ils &#233;liminent beaucoup d&#8217;improbables instances de cor&#233;f&#233;rence en se basant sur des crit&#232;res
imm&#233;diats comme l&#8217;accord (morpho-syntaxique). Ils font respecter l&#8217;exclusivit&#233; linguistique et
en tant que tels &#233;liminent le premier type d&#8217;exclusivit&#233; &#233;voqu&#233; en partie 3. Ceux utilis&#233;s ici as-
surent l&#8217;exclusivit&#233; de deux configurations, entre autres : d&#8217;abord la clause-boundness, v&#233;rifi&#233;e
par deux markables s&#8217;ils apparaissent de mani&#232;re non-appositive dans la m&#234;me proposition, au-
cun n&#8217;&#233;tant un pronom r&#233;flexif ou adjectif possessif (p. ex. dans &#171; [He]m studied [it]n &#187;, [He]m
et [it]n sont clause-bound, la paire (m,n) n&#8217;est donc m&#234;me pas g&#233;n&#233;r&#233;e pour l&#8217;apprentissage).
Ensuite l&#8217;exclusivit&#233; de la NP-boundness assure que deux markables ne soient pas cor&#233;f&#233;rents
s&#8217;ils apparaissent dans le m&#234;me syntagme nominal.
</p>
<p>Le filtrage est d&#8217;autant plus important pour la phase d&#8217;apprentissage que la relation de cor&#233;f&#233;-
rence est un ph&#233;nom&#232;ne dispers&#233; : la grande majorit&#233; des paires-instances sont en fait n&#233;gatives
(non-cor&#233;f&#233;rentes), de sorte que le mod&#232;le apprend plut&#244;t un certain concept de non-cor&#233;f&#233;-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tienne Ailloud, Manfred Klenner
</p>
<p>rence. Le downsampling, la r&#233;duction du rapport d&#8217;instances n&#233;gatives aux instances posi-
tives, peut lui faire mieux cerner les v&#233;ritables relations entre markables cor&#233;f&#233;rents. Les filtres
s&#8217;av&#232;rent &#233;galement utiles en phase de test : un mod&#232;le de classification recentr&#233; sur les moins
nombreuses instances positives pourra aussi classifier plus vite, d&#8217;o&#249; un gain de temps.
</p>
<p>Apprentissage automatique L&#8217;apprentissage est ensuite lanc&#233; sur ces vecteurs filtr&#233;s, com-
me en partie 2. Le mod&#232;le utilise ici des traits classiquement utilis&#233;s dans les mod&#232;les actuels
(cf. (Soon et al., 2001) pour un exemple tr&#232;s suivi) ; Voici par exemple un vecteur g&#233;n&#233;r&#233; pour
la paire ([Der jugoslawische Pr&#228;sident]i, [ihn]n), dans lequel apparaissent distances entre mar-
kables, &#233;tiquettes individuelles, comparaisons entre les markables, l&#8217;extension du mot pour les
pronoms et mesures de salience individuelles (bas&#233;es sur la fr&#233;quence) :
&#12296; 0 6 NN PPER SUBJ OBJA false false noun ihn 3 4 unknown &#12297;
distance en POS fonction matching cha&#238;ne pronom salience classes
</p>
<p>phrases
markables
</p>
<p>i n i n strict fuzzy i n i n
s&#233;mantiques
compatibles
</p>
<p>Nous utilisons le classifieur &#224; m&#233;moire &#171; lazy &#187; TiMBL (Daelemans et al., 2004) pour l&#8217;ap-
prentissage ; il produit pour chaque instance une pr&#233;diction bool&#233;enne, bas&#233;e sur les nombres
d&#8217;instances positives et n&#233;gatives trouv&#233;es similaires &#224; l&#8217;instance test&#233;e (la mesure de similarit&#233;
&#233;tant le produit de l&#8217;apprentissage).
</p>
<p>Pond&#233;ration On assigne ensuite aux instances pr&#233;dites positives un poids fonction de ces
nombres ; il mod&#233;lise le co&#251;t de consid&#233;rer une instance un bon candidat &#224; la cor&#233;f&#233;rence :
</p>
<p>wij =
</p>
<p>{
0 si nij = 0
nij
</p>
<p>nij+pij
sinon o&#249;
</p>
<p>nij est le nombre d&#8217;instances n&#233;gatives similaires &#224; (i, j)
pij est le nombre d&#8217;instances positives similaires &#224; (i, j)
</p>
<p>Une instance qui ne conna&#238;t que des instances similaires positives est un candidat s&#251;r, elle re&#231;oit
donc un poids nul. Une qui n&#8217;a au contraire que des instances similaires n&#233;gatives re&#231;oit le poids
maximum 1. Les instances pr&#233;dites positives sont celles qui ont au moins autant d&#8217;instances
similaires positives que n&#233;gatives (c-&#224;-d. un poids d&#8217;au plus 1/2).
</p>
<p>Une fois les instances pond&#233;r&#233;es, le coeur de notre algorithme consiste &#224; consid&#233;rer d&#8217;abord
les meilleurs candidats, induisant par-l&#224; un ordre sur les paires positives produites par TiMBL,
inspir&#233; de l&#8217;algorithme de Balas (Balas, 1965) :O&#8804;1/2 = Cij, Ckl, . . . pour wij &#8804; wkl &#8804; . . . &#8804; 12 .
</p>
<p>Agr&#233;gation Cette &#233;tape met en oeuvre le principe &#233;bauch&#233; en partie 3. Elle va plus loin que
l&#8217;agr&#233;gation canonique (cf. partie 2) en ce qu&#8217;elle autorise une d&#233;cision binaire produite par
TiMBL &#224; &#234;tre r&#233;vis&#233;e : &#192; chaque it&#233;ration, la compatibilit&#233; d&#8217;une nouvelle paire (i, j) de O&#8804;1/2
est test&#233;e par rapport &#224; toutes les cha&#238;nes construites jusqu&#8217;alors qui contiennent i et j. &#192; savoir :
si Si et Sj sont des cha&#238;nes contenant i et j, respectivement, chaque &#233;l&#233;ment de Si est successi-
vement compar&#233; &#224; chaque &#233;l&#233;ment de Sj . Si un seul de ces tests &#233;choue, (i, j) n&#8217;est plus retenue
comme bon candidat&#8212;c&#8217;est une paire inconsistante avec les cha&#238;nes en cours de construction.
C&#8217;est l&#224; que l&#8217;ordre de Balas a son importance, lorsque les meilleurs candidats sont test&#233;s en
premier (d&#8217;autres ordres se sont effectivement av&#233;r&#233;s moins performants, comme montr&#233; dans
(Klenner &amp; Ailloud, 2008)).
</p>
<p>Notre d&#233;finition de la compatibilit&#233; implique le m&#234;me filtrage que pendant la g&#233;n&#233;ration des
vecteurs. En particulier, ces filtres instantient diff&#233;rentes couches de crit&#232;res linguistiques :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des contraintes plus linguistiques en r&#233;solution de cor&#233;f&#233;rences
</p>
<p>&#8211; exclusivit&#233; : Les deux pr&#233;dicats intraphrasaux vus plus haut jouent ici leur r&#244;le : G&#233;n&#233;ra-
lement, deux markables clause-bound sont exclusifs ; de m&#234;me, deux markables NP-bound
sont exclusifs aussi5.
</p>
<p>&#8211; accord morpho-syntaxique : Ceci d&#233;pend en grande partie de la cat&#233;gorie lexicale de l&#8217;&#233;l&#233;-
ment anaphorique ; en allemand, par exemple, le pronom relatif s&#8217;accorde en genre, nombre
et personne avec son ant&#233;c&#233;dent ;
</p>
<p>&#8211; accord s&#233;mantique : L&#8217;ant&#233;c&#233;dent nominal d&#8217;une anaphore nominale doit avoir la m&#234;me (ou
compatible) classe s&#233;mantique.
</p>
<p>Dans les exp&#233;riences, pour investiguer sur diff&#233;rents comportements linguistiques, nous appli-
quons ou neutralisons plusieurs de ces filtres &#224; l&#8217;agr&#233;gation (cf. partie 5).
</p>
<p>Notre approche de l&#8217;agr&#233;gation repr&#233;sente donc un compromis entre l&#8217;approche na&#239;ve enti&#232;re-
ment gloutonne (rejeter sur la base d&#8217;une probabilit&#233; plus faible une de deux paires-instances
qui transgressent la transitivit&#233;) et la strat&#233;gie d&#8217;exploration exhaustive de l&#8217;espace de recherche
(l&#8217;arbre de Bell, cf. partie 3) lourde en calcul (&#233;quivalente &#224; un backtracking total) qui trouve la
partition optimale. Notre algorithme impose donc transitivement toute contrainte d&#8217;exclusivit&#233;
appel&#233;e par le test de compatibilit&#233;&#8212;ces deux principes sont trait&#233;s intensionnellement.
</p>
<p>Extensions du mod&#232;le Des exp&#233;riences actuelles avec le mod&#232;le impliquent des contraintes
qui ne sont ni transitives ni exclusives ; nous les appelons contraintes de liage d&#8217;entit&#233;s, au sens
o&#249; elles obligent une entit&#233; anaphorique donn&#233;e &#224; avoir un ant&#233;c&#233;dent. Par exemple, on pourrait
&#233;dicter que &#171; tout pronom possessif doit &#234;tre li&#233; &#187;, ou bien qu&#8217;&#171; un syntagme nominal d&#233;mons-
tratif doit &#234;tre li&#233; au maximum trois phrases en arri&#232;re &#187;. Techniquement, de telles contraintes
requi&#232;rent des outils algorithmiques plus &#233;labor&#233;s qu&#8217;un simple test d&#8217;exclusivit&#233; de paire.
</p>
<p>On pourrait aussi songer &#224; des filtres d&#8217;exclusivit&#233; &#171; techniques &#187;, excluant des configurations
comme celle entre un pronom r&#233;flexif (sans indication de genre ou nombre en allemand) et un
markable le suivant, cf. j et k dans &#171; [Er]i hat [sich]j am&#252;siert. [Sie]k nicht. &#187; (&#171; [Il]i [s&#8217;]jest
bien amus&#233;. [Elle]k pas. &#187;) Ce filtre permettrait d&#8217;exclure j &#8801; k, par laquelle l&#8217;erreur pourrait
se propager : par transitivit&#233;, les hypoth&#232;ses correctes i &#8801; j et j &#8801; k (c-&#224;-d. les paires sont
compatibles) am&#232;nent i &#8801; k, qui constitue une paire exclusive. Bien que j et k puissent &#234;tre
pr&#233;dits cor&#233;f&#233;rents, ils ne forment pas une relation anaphorique ; l&#8217;apprentissage gagnerait donc
&#224; se passer de cette paire.
</p>
<p>Dans une configuration en apparence semblable : &#171; [Mr. Clinton]i [. . .] [Clinton]j [. . .] [She]k &#187;,
les deux paires (i, j) et (j, k) sont bien compatibles, mais on ne peut pas appliquer un filtre tel
que celui plus haut, car [Clinton]j pourrait r&#233;ellement &#234;tre l&#8217;ant&#233;c&#233;dent de l&#8217;anaphore [She]k.
Nous appelons ceci un pont d&#8217;inconsistance via j ; l&#8217;exclusivit&#233; seule n&#8217;y rem&#233;die pas, cette
fois. Dans une telle configuration, il n&#8217;y a pas d&#8217;autre solution que de faire jouer la transitivit&#233; ;
celle-ci reste donc n&#233;cessaire, aussi pr&#233;cis que soient les filtres d&#8217;exclusivit&#233;. Ce dernier exemple
montre bien qu&#8217;il est important de repasser par les filtres durant l&#8217;agr&#233;gation, pour &#233;liminer les
&#233;ventuels ponts d&#8217;inconsistance.
</p>
<p>5. Il y a quelques exceptions, notamment l&#8217;usage attributif (adjectival) de syntagmes verbaux imbriqu&#233;s, o&#249;
un pronom r&#233;flexif peut &#234;tre co-index&#233; avec le syntagme nominal entier : cf. [das [sich]i am&#252;sierende M&#228;dchen]i
([la fille qui [s&#8217;]i amuse]i)&#8212;le verbe allemand sich am&#252;sieren &#233;tant aussi r&#233;flexif. Mais comme les markables
imbriqu&#233;s ne sont pas annot&#233;s pour la cor&#233;f&#233;rence dans notre gold standard, (cf. partie 5), le filtre plus restrictif est
quand m&#234;me utilis&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tienne Ailloud, Manfred Klenner
</p>
<p>5 R&#233;sultats
</p>
<p>Dans cette partie nous montrons que la transitivit&#233; et l&#8217;exclusivit&#233; peuvent am&#233;liorer la phase
d&#8217;agr&#233;gation. Notre gold standard, le Corpus arbor&#233; d&#8217;allemand &#233;crit de T&#252;bingen (Telljohann
et al., 2005, T&#252;Ba), se compose d&#8217;articles de journaux en allemand ; annot&#233;s en structure syn-
taxique et en cor&#233;f&#233;rence. Celle-ci couvre plus de 1 100 textes pour plus de 23 000 phrases.
</p>
<p>&#201;talon Nous avons utilis&#233; 80% des textes du corpus pour la phase d&#8217;apprentissage et le reste
(soit 217 textes) pour la classification. Notre syst&#232;me-&#233;talon consiste &#224; lancer TiMBL dans ces
conditions, les vecteurs soumis au classifieur ainsi que le gold standard ayant pass&#233; au pr&#233;a-
lable nos filtres durs. Ceci implique que l&#8217;&#233;valuation doit &#234;tre interpr&#233;t&#233;e modulo les filtres de
vecteurs : seules les configurations qu&#8217;ils acceptent explicitement se retrouvent dans les paires
&#224; classifier et celles du gold standard. Par exemple, les configurations impliquant es (pronom
personnel neutre 3e pers.), majoritairement expl&#233;tif, sont ignor&#233;es. Les donn&#233;es apr&#232;s filtrage re-
pr&#233;sentent 60 414 (resp. 15 659) paires d&#8217;instance pour l&#8217;entra&#238;nement (resp. la classification).
Nos r&#233;sultats reposent sur les seulesmentions r&#233;elles (les markables r&#233;ellement cor&#233;f&#233;rents avec
un autre) ; ceci permet de concentrer l&#8217;&#233;tude sur un ph&#233;nom&#232;ne particulier ((Luo et al., 2004)
p. ex. utilise &#233;galement cette restriction), comme ici le gain apport&#233; par l&#8217;agr&#233;gation filtrante.
</p>
<p>Param&#232;tre &#201;TALON MORPH MORPH+EXCL MORPH+EXCL+S&#201;M
Pr&#233;cision 73.61 78.13 79.23 82.02
Rappel 63.36 65.76 66.09 68.27
F-mesure 68.10 71.41 72.07 74.52
</p>
<p>TAB. 1 &#8211; Exp&#233;rience : contribution des diff&#233;rentes couches filtrantes &#224; l&#8217;agr&#233;gation consistante.
</p>
<p>Param&#232;tres exp&#233;rimentaux du filtrage Le tableau 1 pr&#233;sente les progr&#232;s atteints par rapport
&#224; l&#8217;&#233;talon : diff&#233;rentes couches filtrantes y sont ajout&#233;es (morpho-syntaxe, exclusivit&#233; intraphra-
sale, s&#233;mantique) dans le but de montrer l&#8217;effet de la transitivit&#233; combin&#233;e aux filtres d&#8217;exclusi-
vit&#233;. L&#8217;effet de l&#8217;exclusivit&#233; sur une base morphologique (r&#232;gles d&#8217;accords) appara&#238;t en troisi&#232;me
colonne, avec d&#233;j&#224; un gain de 3,31% en F-mesure (+4,52% en pr&#233;cision et +2,4% en rappel).
La colonne suivante pr&#233;sente l&#8217;effet combin&#233; avec l&#8217;exclusivit&#233; &#171; pure &#187; (c-&#224;-d. intraphrasale)
en sus, soit une nouvelle augmentation, de 0,72%, de la F-mesure. Globalement, l&#8217;agr&#233;gation
transitive qui propage l&#8217;exclusivit&#233; apporte pour nos donn&#233;es une am&#233;lioration de 6,42%. On
peut voir que l&#8217;exclusivit&#233; et les crit&#232;res morpho-syntaxiques contribuent grandement &#224; rendre
consistantes les cha&#238;nes de cor&#233;f&#233;rence implicitement produites par TiMBL. L&#8217;efficacit&#233; du cri-
t&#232;re s&#233;mantique peut &#234;tre interpr&#233;t&#233;e par la suppression des ponts d&#8217;inconsistance.
</p>
<p>Notre &#233;valuation fait usage de la mesure de cor&#233;f&#233;rence ECM (pr&#233;sent&#233;e dans (Luo, 2005)),
qui met l&#8217;accent sur les cha&#238;nes de cor&#233;f&#233;rence plut&#244;t que de comparer simplement le nombre
de paires en accord avec le gold standard. Ceci peut expliquer l&#8217;augmentation du rappel en
colonnes 3, 4 et 5, alors que notre algorithme ne peut que rejeter une paire incompatible en
la r&#233;visant. C&#8217;est que la mesure ECM cherche &#224; aligner les cha&#238;nes de cor&#233;f&#233;rence avec le
gold standard : la suppression &#224; raison d&#8217;un maillon peut engendrer une cha&#238;ne suppl&#233;mentaire
align&#233;e avec succ&#232;s, ce qui augmente le rappel. La mesure ECM offre plusieurs avantages par
rapport au traditionnel MUC, comme d&#233;crit p. ex. dans (Luo, 2005).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers des contraintes plus linguistiques en r&#233;solution de cor&#233;f&#233;rences
</p>
<p>6 Travaux ant&#233;rieurs
</p>
<p>Il y a eu d&#8217;importants efforts de recherche sur l&#8217;apprentissage automatique de la r&#233;solution de
cor&#233;f&#233;rences ; on a r&#233;cemment commenc&#233; &#224; aborder les limites de port&#233;e inh&#233;rentes aux mo-
d&#232;les binaires. Par exemple, le mod&#232;le propos&#233; dans (Yang et al., 2004) incorpore des traits
&#233;tendus, qui prennent non seulement en compte les paires de markables mais aussi les cha&#238;nes
de cor&#233;f&#233;rence partielles construites durant l&#8217;agr&#233;gation. Cependant le mod&#232;le ne fait pas &#233;tat de
contraintes dures sur ces cha&#238;nes et reste dans la lign&#233;e standard. Comme mentionn&#233; en partie 2,
l&#8217;arbre de Bell ne peut pas &#234;tre explor&#233; dans son int&#233;gralit&#233;. Dans (Luo et al., 2004), un mo-
d&#232;le statistique y apporte une solution en &#233;laguant l&#8217;arbre selon les scores obtenus sur ses che-
mins, perdant la garantie d&#8217;optimalit&#233;. Cette approche reste &#233;galement purement statistique&#8212;
elle n&#8217;apporte pas de contraintes suppl&#233;mentaires en dehors du classifieur. Une autre perspective
est abord&#233;e dans (Denis &amp; Baldridge, 2008b), o&#249; des mod&#232;les diff&#233;renci&#233;s sont entra&#238;n&#233;s selon
les diff&#233;rentes cat&#233;gories de markables (susceptibles d&#8217;exhiber diff&#233;rents motifs de cor&#233;f&#233;rence).
</p>
<p>On a plus r&#233;cemment insist&#233; sur l&#8217;importance de la transitivit&#233; en r&#233;solution de cor&#233;f&#233;rences.
Les mod&#232;les dans (Denis &amp; Baldridge, 2008a) et (Finkel &amp; Manning, 2008) font tous deux res-
pecter cette contrainte globale par programmation lin&#233;aire enti&#232;re (ILP), ce faisant assurant une
certaine notion d&#8217;optimalit&#233; aux cha&#238;nes produites. Aucun toutefois n&#8217;y combine des contraintes
d&#8217;exclusivit&#233; qui pourraient l&#8217;utiliser pour se propager (bien que la combinaison avec la recon-
naissance d&#8217;entit&#233;s nomm&#233;es dans le mod&#232;le similaire de Denis &amp; Baldridge (2008a) engendre
une propagation mutuelle des deux t&#226;ches). De plus, l&#8217;ILP impose l&#8217;extentionnalisation des
contraintes, ce qui affecte la clart&#233;, voire la faisabilit&#233; dans le cas de longs textes, pour la tran-
sitivit&#233;.
</p>
<p>7 Conclusion et travaux futurs
</p>
<p>Nous avons propos&#233; un mod&#232;le de r&#233;solution de cor&#233;f&#233;rences, b&#226;ti autour d&#8217;un mod&#232;le binaire
d&#8217;apprentissage automatique et se basant sur des filtres pour imposer transitivit&#233; et exclusivit&#233;.
Nous avons montr&#233; que le filtrage transitif pendant la phase d&#8217;agr&#233;gation fournit de meilleurs
r&#233;sultats de par la consistance des cha&#238;nes de cor&#233;f&#233;rence produites, ce qui constitue une am&#233;-
lioration par rapport aux approches binaires classiques.
</p>
<p>Dans des travaux ult&#233;rieurs nous chercherons &#224; trouver de nouveaux filtres d&#8217;exclusivit&#233;, afin
de coller&#8212;&#224; terme&#8212;au plus pr&#232;s des donn&#233;es empiriques: ceux-ci devront &#234;tre d&#8217;inspiration
linguistique et n&#233;cessiteront probablement peu d&#8217;adaptation &#224; d&#8217;autres langues (de plus, la tran-
sitivit&#233; est une contrainte universelle). En outre nous voulons continuer &#224; exp&#233;rimenter sur des
contraintes, en particulier celles qui imposent le liage d&#8217;entit&#233;s, bien que celles-ci modifient
quelque peu l&#8217;architecture du mod&#232;le.
</p>
<p>Remerciements
</p>
<p>La recherche effectu&#233;e dans le cadre de ce travail est financ&#233;e par le projet no 105211&#8211;118108/1
du Fonds National Suisse. Nous tenons &#224; remercier Anne Goehring ainsi que les deux relecteurs
anonymes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;tienne Ailloud, Manfred Klenner
</p>
<p>R&#233;f&#233;rences
</p>
<p>BAGGA A. &amp; BALDWIN B. (1998). Algorithms for scoring coreference chains. In Pro-
ceedings of the Linguistic Coreference Workshop at The First International Conference on
Language Resources and Evaluation (LREC&#8217;98), p. 563&#8211;566.
</p>
<p>BALAS E. (1965). An additive algorithm for solving linear programs with zero-one variables.
Operations Research, 13(4), 517&#8211;546.
CHIERCHIA G. &amp; MCCONNELL-GINET S. (1990). Meaning and Grammar, An Introduction
to Semantics. MIT Press, Cambridge.
</p>
<p>DAELEMANS W., ZAVREL J., VAN DER SLOOT K. &amp; VAN DEN BOSCH A. (2004). TiMBL:
Tilburg Memory-Based Learner.
</p>
<p>DENIS P. &amp; BALDRIDGE J. (2008a). Coreference with named entity classification and transi-
tivity constraints and evaluation with MUC, B-CUBED, and CEAF. In Proceedings of Corpus-
Based Approaches to Coreference Resolution in Romance Languages (CBA 2008), Barcelona,
Spain. &#192; para&#238;tre.
</p>
<p>DENIS P. &amp; BALDRIDGE J. (2008b). Specialized models and ranking for coreference reso-
lution. In Proceedings of the Empirical Methods in Natural Language Processing (EMNLP
2008), Hawaii, USA. &#192; para&#238;tre.
</p>
<p>FINKEL J. &amp; MANNING C. (2008). Enforcing transitivity in coreference resolution. In Pro-
ceedings of the Annual Meeting of the Association for Computational Linguistics - Human
Language Technology Conference, p. 45&#8211;48: Association for Computational Linguistics.
</p>
<p>KLENNER M. &amp; AILLOUD E. (2008). Enhancing coreference clustering. In C. JOHANSSON,
Ed., Proc. of the Second Workshop on Anaphora Resolution (WAR II), volume 2 of NEALT
Proceedings Series, p. 31&#8211;40, Bergen, Norway.
</p>
<p>LUO X. (2005). On coreference resolution performance metrics. In Proceedings of the confe-
rence on Human Language Technology and Empirical Methods in Natural Language Proces-
sing, p. 25&#8211;32: Association for Computational Linguistics Morristown, NJ, USA.
</p>
<p>LUO X., ITTYCHERIAH A., JING H., KAMBHATLA N. &amp; ROUKOS S. (2004). A mention-
synchronous coreference resolution algorithm based on the Bell tree. Proceedings of the 42nd
Annual Meeting on Association for Computational Linguistics.
</p>
<p>NG V. &amp; CARDIE C. (2002). Improving machine learning approaches to coreference resolu-
tion. Proceedings of the 40th Annual Meeting of the Association for Computational Linguis-
tics, p. 104&#8211;111.
</p>
<p>SOON W., NG H. &amp; LIM D. (2001). A machine learning approach to coreference resolution
of noun phrases. Computational Linguistics, 27(4), 521&#8211;544.
TELLJOHANN H., HINRICHS E., K&#220;BLER S. &amp; ZINSMEISTER H. (2005). Stylebook for the
T&#252;bingen treebank of written German (T&#252;Ba-D/Z). Seminar fur Sprachwissenschaft, Univer-
sit&#228;t T&#252;bingen, T&#252;bingen, Germany.
</p>
<p>VILAIN M., BURGER J., ABERDEEN J., CONNOLLY D. &amp; HIRSCHMAN L. (1995). A model-
theoretic coreference scoring scheme. In Proceedings of the 6th conference on Message un-
derstanding, p. 45&#8211;52: Association for Computational Linguistics Morristown, NJ, USA.
</p>
<p>YANG X., SU J., ZHOU G. &amp; TAN C. (2004). An NP-cluster based approach to coreference
resolution. Proceedings of COLING.</p>

</div></div>
</body></html>