<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Sens et usages d&#8217;un terme dans un r&#233;seau lexical &#233;volutif</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009 
</p>
<p> 
</p>
<p>Sens et usages d&#8217;un terme dans un r&#233;seau lexical &#233;volutif 
</p>
<p>Mathieu Lafourcade, Alain Joubert, St&#233;phane Riou 
</p>
<p>LIRMM &#8211; Universit&#233; Montpellier 2 - CNRS 
Laboratoire d&#8217;Informatique, Robotique et Micro&#233;lectronique de Montpellier 
</p>
<p>161, rue Ada 
F-34392 Montpellier cedex 5 
</p>
<p>{lafourcade, joubert}@lirmm.fr 
</p>
<p>R&#233;sum&#233;  L&#8217;obtention d&#8217;informations lexicales fiables est un enjeu primordial en TALN, mais 
cette collecte peut s&#8217;av&#233;rer difficile. L&#8217;approche pr&#233;sent&#233;e ici vise &#224; pallier les &#233;cueils de cette 
difficult&#233; en faisant participer un grand nombre de personnes &#224; un projet contributif via des jeux 
accessibles sur le web. Ainsi, les joueurs vont construire le r&#233;seau lexical, en fournissant de plusieurs 
mani&#232;res possibles des associations de termes &#224; partir d'un terme cible et d'une consigne correspondant 
&#224; une relation typ&#233;e. Le r&#233;seau lexical ainsi produit est de grande taille et comporte une trentaine de 
types de relations. A partir de cette ressource, nous abordons la question de la d&#233;termination des 
diff&#233;rents sens et usages d&#8217;un terme. Ceci est r&#233;alis&#233; en analysant les relations entre ce terme et ses 
voisins imm&#233;diats dans le r&#233;seau et en calculant des cliques ou des quasi-cliques. Ceci nous am&#232;ne 
naturellement &#224; introduire la notion de similarit&#233; entre cliques, que nous interpr&#233;tons comme une 
mesure de similarit&#233; entre ces diff&#233;rents sens et usages. Nous pouvons ainsi construire pour un terme 
son arbre des usages, qui est une structure de donn&#233;es exploitable en d&#233;sambigu&#239;sation de sens. Nous 
pr&#233;sentons quelques r&#233;sultats obtenus en soulignant leur caract&#232;re &#233;volutif. 
</p>
<p>Abstract  Obtaining reliable lexical information is an essential task in NLP, but it can prove a 
difficult task. The approach we present here aims at lessening the difficulty: it consists in having 
people take part in a collective project by offering them playful applications accessible on the web. 
The players themselves thus build the lexical network, by supplying (in various possible ways) 
associations between terms from a target term and an instruction concerning a typed relation. The 
lexical network thus obtained is large and it includes about thirty types of relations. From this network, 
we then discuss the question of meaning and word usage determination for a term, by searching 
relations between this term and its neighbours in the network and by computing cliques or quasi-
cliques. This leads us to introduce the notion of similarity between cliques, which can be interpreted as 
a measure of similarity between these different meanings and word usages. We are thus able to build 
the tree of word usages for a term: it is a data structure that can be used to disambiguate meaning. 
Finally, we briefly present some of the results obtained, putting the emphasis on their evolutionary 
aspect. 
</p>
<p>Mots-cl&#233;s : Traitement Automatique du Langage Naturel, r&#233;seau lexical &#233;volutif, relations typ&#233;es 
pond&#233;r&#233;es, similarit&#233; entre sens et usages, arbre des usages. 
</p>
<p>Keywords:  Natural Language Processing, evolutionary lexical network, typed and weighted 
relations, meaning and word usage similarity, tree of word usages. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT, St&#233;phane RIOU 
</p>
<p> 
</p>
<p>1. Introduction 
L&#8217;obtention de relations lexicales ou fonctionnelles fiables entre termes est un enjeu 
</p>
<p>primordial en Traitement Automatique des Langues (TAL). En effet, de telles relations sont 
n&#233;cessaires dans un grand nombre d&#8217;applications. Ces relations que l&#8217;on trouve g&#233;n&#233;ralement 
dans des th&#233;saurus ou des ontologies peuvent &#234;tre mises en &#233;vidence de fa&#231;on manuelle ; il est 
possible de citer ici, par exemple, l&#8217;un des plus anciens th&#233;saurus, le (Roget, 1852) ou l&#8217;un des 
plus c&#233;l&#232;bres r&#233;seaux lexicaux, WordNet (Miller et al., 1990) auquel (Boyd-Graber et al., 
2006) ont r&#233;cemment ajout&#233; des liens associatifs pond&#233;r&#233;s. Il est &#233;galement possible de 
d&#233;terminer automatiquement de telles relations &#224; partir de corpus de textes, par exemple  
(Robertson et Spark Jones, 1976) ou (Lapata et Keller, 2005), dans lesquels sont effectu&#233;es 
des &#233;tudes statistiques sur les distributions de mots. La m&#233;thode Latent Semantic Analysis 
(Dumais, 1994) ou (Landauer et Dumais, 1997) s&#8217;appuie &#233;galement sur des ensembles de 
textes ; elle permet de calculer une proximit&#233; s&#233;mantique entre mots et ainsi produire des 
nuages de termes appartenant &#224; un m&#234;me champ s&#233;mantique. L&#8217;&#233;tablissement de telles 
relations, s&#8217;il est effectu&#233; manuellement par un ensemble d&#8217;experts, n&#233;cessite des ressources 
(en dur&#233;e et en personnel) qui peuvent &#234;tre prohibitives, alors que leur extraction automatique 
sur un corpus de textes semble beaucoup trop d&#233;pendante du domaine des textes choisis. 
Contrairement &#224; ces m&#233;thodes classiques qui permettent d&#8217;acqu&#233;rir des informations lexicales 
g&#233;n&#233;ralement statiques, le prototype introduit ici, o&#249; ce sont les utilisateurs qui font &#233;voluer la 
base, r&#233;alise l&#8217;acquisition d&#8217;informations lexicales &#233;volutives. 
</p>
<p>Dans cet article, nous rappelons bri&#232;vement les principes de deux jeux visant &#224; construire 
une base de relations entre termes. Le premier de ces deux jeux (JeuxDeMots1) permet la 
construction d&#8217;un r&#233;seau lexical : c&#8217;est un jeu ouvert gr&#226;ce auquel les utilisateurs fournissent 
des associations entre termes, en proposant des termes destination &#224; partir d&#8217;un terme origine 
et d&#8217;une consigne correspondant &#224; une relation typ&#233;e. Le deuxi&#232;me jeu (PtiClic1) permet aux 
utilisateurs de consolider les associations acquises gr&#226;ce &#224; JeuxDeMots en leur proposant de 
valider, ou non, des associations potentielles entre termes : c&#8217;est un jeu ferm&#233;, les utilisateurs 
ne proposant pas de terme. L&#8217;objectif poursuivi concerne avant tout la fiabilit&#233; et la qualit&#233; 
des informations recueillies aupr&#232;s des utilisateurs, l&#8217;un des &#233;l&#233;ments-cl&#233;s &#233;tant qu&#8217;une 
relation ne peut &#234;tre valid&#233;e que si elle est propos&#233;e par au moins deux utilisateurs. Dans une 
deuxi&#232;me partie, utilisant le r&#233;seau ainsi obtenu, nous abordons la probl&#233;matique de la 
d&#233;termination de la polys&#233;mie d&#8217;usage. La similarit&#233; entre les diff&#233;rents usages d&#8217;un m&#234;me 
terme est abord&#233;e dans une troisi&#232;me partie ; elle nous permet de construire l&#8217;arbre des usages 
d&#8217;un terme constituant un raffinement dans la diff&#233;rentiation de ses usages. Enfin, nous 
pr&#233;sentons quelques r&#233;sultats, en soulignant le caract&#232;re &#233;volutif du r&#233;seau lexical obtenu. 
</p>
<p>2. R&#233;seau lexical : principe et construction 
2.1. Principe du logiciel initial : JeuxDeMots 
</p>
<p>Le principe de base du logiciel, le d&#233;roulement d&#8217;une partie, ainsi que la construction 
progressive du r&#233;seau lexical, ont d&#233;j&#224; &#233;t&#233; d&#233;crit par (Lafourcade et Joubert, 2008). Une partie 
se d&#233;roule entre deux joueurs, en asynchrone. Lorsqu&#8217;un premier joueur (A) d&#233;bute une 
partie, un terme2 T tir&#233; al&#233;atoirement dans une base de mots est affich&#233;, ainsi qu&#8217;une consigne 
concernant un type de comp&#233;tence (synonymes, domaines, association libre&#8230;). Ce joueur (A) 
a alors un temps limit&#233; pour r&#233;pondre en proposant un nombre limit&#233; de termes 
correspondant, selon lui, &#224; la consigne appliqu&#233;e au terme T. Ce m&#234;me terme, avec cette 
m&#234;me consigne, est propos&#233; par la suite &#224; un joueur (B) ; le processus est identique. Pour ce 
terme cible T, nous m&#233;morisons les r&#233;ponses communes aux joueurs (A) et (B). Les 
validations sont donc faites par concordance des propositions entre paires de joueurs. Ce 
                                                 
</p>
<p>1
 JeuxDeMots et PtiClic sont accessibles &#224; l&#8217;adresse http://jeuxdemots.org et http://pticlic.org. Il existe &#233;galement 
</p>
<p>une version anglaise, ainsi qu&#8217;une version tha&#239; et une version japonaise (toutes deux en cours de d&#233;veloppement), 
&#224; l&#8217;adresse http://www.lirmm.fr/jeuxdemots/world-of-jeuxdemots.php  
2
  Un terme peut &#234;tre constitu&#233; de plusieurs mots (par exemple : pomme de terre). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sens et usages d&#8217;un terme dans un r&#233;seau lexical &#233;volutif 
</p>
<p> 
</p>
<p>processus de validation rappelle celui utilis&#233; par (von Ahn et Dabbish, 2004) pour 
l&#8217;indexation d&#8217;images ou plus r&#233;cemment par (Lieberman et al., 2007) pour la collecte de 
&#8243;connaissances de bon sens&#8243;. A notre connaissance, il n&#8217;a jamais &#233;t&#233; mis en &#339;uvre dans le 
domaine des r&#233;seaux lexicaux. 
</p>
<p>Les propositions faites par les joueurs (A) et (B) vont permettre d&#8217;&#233;tablir des relations entre 
termes. Pour une m&#234;me partie, notons : 
</p>
<p>  x1, x2, &#8230; xi &#8230; , xn les propositions de (A) 
 et y1, y2, &#8230; yj &#8230; , ym les propositions de (B)  
Pour tous les couples (i,j) tels que xi = yj , la relation R : T &#8594; xi est valid&#233;e. 
Le logiciel d&#233;velopp&#233; permet la construction d&#8217;un r&#233;seau lexical reliant les termes par des 
</p>
<p>relations typ&#233;es et pond&#233;r&#233;es, valid&#233;es par paires de joueurs. Ces relations sont typ&#233;es par la 
consigne impos&#233;e aux joueurs ; elles sont pond&#233;r&#233;es en fonction du nombre de paires de 
joueurs qui les ont propos&#233;es. La structure du r&#233;seau lexical que nous cherchons ainsi &#224; 
obtenir s&#8217;appuie sur les notions de n&#339;uds et de relations entre n&#339;uds, selon un mod&#232;le 
initialement pr&#233;sent&#233; vers la fin des ann&#233;es 1960 par (Collins et Quillian, 1969) et plus 
r&#233;cemment explicit&#233; par (Polgu&#232;re, 2006). Cette structure s&#8217;apparente &#224; celle du r&#233;seau obtenu 
pour la relation de synonymie par (Ploux et Victorri, 1998) pour la constitution du 
Dictionnaire &#233;lectronique des synonymes. Chaque n&#339;ud du r&#233;seau est constitu&#233; d&#8217;une unit&#233; 
lexicale (terme ou expression) regroupant toutes ses lexies et les relations entre n&#339;uds 
traduisent des fonctions lexicales, telles que pr&#233;sent&#233;es par (Mel&#8217;&#269;uk et al., 1995). La figure 1 
pr&#233;sente une partie des relations acquises pour le terme ciel.  
 
</p>
<p>'ciel' 
</p>
<p>136 relations ==&gt; 
</p>
<p>  
</p>
<p>ciel ---r_lieu:760--&gt; nuage 
</p>
<p>ciel ---r_lieu:750--&gt; oiseau 
</p>
<p>ciel ---r_lieu:660--&gt; avion 
</p>
<p>ciel ---r_associated:470--&gt; bleu 
</p>
<p>ciel ---r_associated:430--&gt; nuage 
</p>
<p>ciel ---r_lieu_action:290--&gt; voler 
</p>
<p>ciel ---r_lieu_action:270--&gt; planer 
</p>
<p>ciel ---r_has_part:60--&gt; nuage 
</p>
<p>ciel ---r_has_part:60--&gt; &#233;toile 
</p>
<p>ciel ---r_carac:60--&gt; clair 
</p>
<p>ciel ---r_antimagn:60--&gt; plafond 
</p>
<p>ciel ---r_hypo:50--&gt; baldaquin 
</p>
<p>ciel ---r_locution:50--&gt; monter au ciel 
</p>
<p>&#8230; 
</p>
<p> 
</p>
<p>113 relations &lt;==  
</p>
<p> 
</p>
<p>bleu ---r_associated:760--&gt; ciel 
</p>
<p>voie lact&#233;e ---r_associated:520--&gt; ciel 
</p>
<p>arc-en-ciel ---r_associated:300--&gt; ciel 
</p>
<p>nuage ---r_associated:240--&gt; ciel 
</p>
<p>&#233;toile ---r_lieu:210--&gt; ciel 
</p>
<p>&#233;toile ---r_holo:210--&gt; ciel 
</p>
<p>voler ---r_action_lieu:120--&gt; ciel 
</p>
<p>bleu ---r_carac:100--&gt; ciel 
</p>
<p>regarder ---r_patient:80--&gt; ciel 
</p>
<p>avion ---r_domain:50--&gt; ciel 
</p>
<p>trou noir ---r_has_part:50--&gt; ciel 
</p>
<p>univers ---r_isa:50--&gt; ciel 
</p>
<p>&#8230; 
</p>
<p> 
</p>
<p>Figure 1 : Ensemble (partiel) des relations acquises pour le terme ciel. Sont  pr&#233;sent&#233;es tout 
d&#8217;abord les relations dont le terme ciel est origine, puis celles pour lesquelles le terme ciel est 
destinataire. Pour chacune de ces relations, on a en outre son type (&quot;lieu caract&#233;ristique&quot;, 
&quot;id&#233;e associ&#233;e&quot;&#8230;) ainsi que son poids. Les relations sont ici pr&#233;sent&#233;es par ordre de poids 
d&#233;croissant.3 
</p>
<p>2.2. Consolidation du r&#233;seau lexical : logiciel PtiClic 
Tout comme pour JeuxDeMots (JDM), une partie de PtiClic se d&#233;roule en asynchrone 
</p>
<p>entre deux joueurs. Un premier joueur (A) se voit proposer un terme cible T, ainsi qu&#8217;un 
nuage de mots provenant de l&#8217;ensemble des termes reli&#233;s &#224; T dans le r&#233;seau lexical produit par 
JDM. Plusieurs consignes correspondant &#224; des types de relations sont &#233;galement affich&#233;es. Le 
joueur associe, par cliquer-glisser, des mots du nuage aux consignes auxquelles il pense qu&#8217;ils 
correspondent. Ce m&#234;me terme T, ainsi que le m&#234;me nuage de mots et les m&#234;mes consignes, 
sont &#233;galement propos&#233;es &#224; un joueur (B). Selon un principe analogue &#224; celui mis en place 
                                                 
</p>
<p>3
  Ces relations sont accessibles &#224; l&#8217;adresse http://jeuxdemots.org/rezo.php. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT, St&#233;phane RIOU 
</p>
<p> 
</p>
<p>pour JDM, les propositions de (B) sont compar&#233;es &#224; celles faites par (A) et seules leurs 
propositions communes sont prises en compte, renfor&#231;ant ainsi les relations du r&#233;seau lexical. 
</p>
<p>Contrairement &#224; JDM, PtiClic est un jeu ferm&#233; o&#249; les utilisateurs ne peuvent pas proposer 
de nouveaux termes, mais sont contraints de choisir parmi ceux affich&#233;s. Ce choix de 
conception doit permettre de r&#233;duire le bruit d&#251; aux termes mal orthographi&#233;s ou aux 
confusions de sens. PtiClic r&#233;alise donc une consolidation des relations produites par JDM et 
permet de densifier le r&#233;seau lexical.   
</p>
<p>Afin de r&#233;duire le silence correspondant aux termes non propos&#233;s par les utilisateurs de 
JDM, (Zampa et Lafourcade, 2009) ont sugg&#233;r&#233; de g&#233;n&#233;rer le nuage de mots &#224; l&#8217;aide de LSA. 
Cette solution permet d&#8217;augmenter le r&#233;seau lexical par l&#8217;ajout de nouvelles relations, en 
particulier de relations non sym&#233;triques dans JDM (exemple : ciel &#8594; aigle, mais la relation 
inverse n&#8217;existant pas actuellement, aucune clique du terme ciel ne comporte le terme aigle).  
</p>
<p>3. D&#233;termination des sens d&#8217;usage 
3.1. Principe g&#233;n&#233;ral 
</p>
<p>Lorsqu&#8217;un terme T est polys&#233;mique, les termes qui lui sont directement reli&#233;s forment 
plusieurs groupes distincts, chacun de ces groupes constituant un sens d&#8217;usage de T. Nous 
faisons ici la distinction entre les notions de sens d&#8217;usage et de sens. La notion de sens 
d&#8217;usage (appel&#233;e plus commun&#233;ment usage) est beaucoup plus fine que celle de sens qui, 
comme l&#8217;a montr&#233; (V&#233;ronis, 2001), est relativement pauvre lorsqu&#8217;on se r&#233;f&#232;re aux 
dictionnaires traditionnels ou &#224; des ressources comme WordNet. L&#8217;usage est donc en TALN 
une notion plus importante que le sens. Pour ne citer qu&#8217;un exemple, ciel-nuage-pluie-gris et 
ciel-nuage-soleil-pluie constituent deux usages distincts du terme ciel, alors qu&#8217;il s&#8217;agit 
manifestement du m&#234;me sens de ce terme. 
</p>
<p>3.2. D&#233;termination des cliques et calcul de leur pertinence 
Comment d&#233;terminer une clique ? C&#8217;est un ensemble de termes &#171; fortement &#187; reli&#233;s entre 
</p>
<p>eux constituant un sous-graphe induit complet (ou clique) dans le r&#233;seau lexical. Les liens qui 
sont consid&#233;r&#233;s ici sont uniquement des relations de type &quot;id&#233;e associ&#233;e&quot; sym&#233;trique. Nous 
faisons abstraction des autres types de relation (&quot;tout de&quot;, &quot;partie de&quot;, &#8230;) en raison de leur 
caract&#232;re non sym&#233;trique.  
</p>
<p>Dans le r&#233;seau lexical, un terme T est directement reli&#233; &#224; n termes : T1,&#8230;,Ti,&#8230;,Tj,&#8230;,Tn. 
Nous nous attachons ici aux diff&#233;rents usages de ce terme T ; le but est donc de regrouper ces 
n termes en un ou plusieurs groupes, chacun constituant un usage de T. Les termes Ti1, &#8230; ,Tim 
, reli&#233;s &#224; T, constituent le i&#232;me usage de T si les (m+1)*m/2 relations entre ces (m+1) termes 
existent. Ainsi, un terme Tj , reli&#233; &#224; T, n&#8217;appartiendra pas &#224; ce i&#232;me usage de T si au moins une 
des relations entre ce terme Tj et l&#8217;un des termes Ti1, &#8230; ,Tim n&#8217;existe pas. 
</p>
<p>Evaluer la pertinence d&#8217;un usage consiste &#224; obtenir une mesure de son importance &#224; la fois 
en fr&#233;quence d&#8217;utilisation mais aussi en couverture lexicale. On &#233;mettra l&#8217;hypoth&#232;se que pour 
un terme donn&#233; et en dehors de tout contexte sp&#233;cifique, l&#8217;usage le plus pertinent est celui 
auquel on pense en premier en g&#233;n&#233;ral. Ainsi donc, lors d&#8217;une analyse s&#233;mantique de texte, 
les usages peuvent &#234;tre pond&#233;r&#233;s par d&#233;faut en fonction de leur pertinence a priori. Compte 
tenu du principe de la pond&#233;ration des relations dans notre r&#233;seau lexical, le poids d&#8217;un usage 
est corr&#233;l&#233; aux poids des relations entre les termes de la clique qui caract&#233;rise cet usage. 
Ainsi, pour une clique C de m termes et comprenant le terme T, la pertinence (Rel) de l&#8217;usage 
correspondant sera &#233;gale &#224; : 
</p>
<p> Rel(C) = Ln(m) * P(C) / [m*(m -1)]  o&#249;  P(C) =  &#8721;i,j poids(Ti-Tj) 
Le terme poids(Ti-Tj) est le poids de la relation entre Ti etTj. La pertinence est la moyenne 
</p>
<p>des poids des relations existant entre les termes, valeur qui exprime la coh&#233;rence de la clique, 
que multiplie le logarithme du nombre de termes impliqu&#233;s dans la clique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sens et usages d&#8217;un terme dans un r&#233;seau lexical &#233;volutif 
</p>
<p> 
</p>
<p>Il est &#224; noter que la pertinence est une valeur relative entre cliques d&#8217;un m&#234;me terme, et 
non une valeur absolue permettant la comparaison entre cliques de termes diff&#233;rents, car les 
poids des relations &#224; partir d&#8217;un terme cible d&#233;pendent du nombre de fois o&#249; ce terme a &#233;t&#233; 
jou&#233;. 
</p>
<p>La figure 2 pr&#233;sente les diff&#233;rents usages obtenus pour le terme ciel, ainsi que la pertinence 
de chacun de ces usages. 
0: 'ciel' 'bleu'      (P = 1230 / nl = 2 / moy = 615 / REL = 426)  
</p>
<p>1: 'ciel' 'nuage' 'pluie' 'gris'     (P = 2410 / nl = 12 / moy = 201 / REL = 278)  
</p>
<p>2: 'ciel' 'nuage' 'soleil' 'pluie'    (P = 2720 / nl = 12 / moy = 227 / REL = 314)  
</p>
<p>3: 'ciel' 'soleil' '&#233;toile' 'lune'     (P = 1980 / nl = 12 / moy = 165 / REL = 229)  
</p>
<p>4: 'ciel' '&#233;toile' 'lune' 'espace'     (P = 1370 / nl = 12 / moy = 114 / REL = 158)  
</p>
<p>5: 'ciel' 'soleil' 'pluie' 'arc-en-ciel'    (P = 2070 / nl = 12 / moy = 173 / REL = 239)  
</p>
<p>6: 'ciel' 'soleil' 'lune' 'astronomie'    (P = 1420 / nl = 12 / moy = 118 / REL = 164)  
</p>
<p>7: 'ciel' 'lune' 'espace' 'astronomie'    (P = 980 / nl = 12 / moy = 82 / REL = 113)  
</p>
<p>8: 'ciel' 'oiseau' 'air'     (P = 470 / nl = 6 / moy = 78 / REL = 86)  
</p>
<p>9: 'ciel' 'avion' 'air'     (P = 590 / nl = 6 / moy = 98 / REL = 108)  
</p>
<p>10: 'ciel' 'avion' 'nuages'     (P = 680 / nl = 6 / moy = 113 / REL = 125)  
</p>
<p>11: 'ciel' 'pluie' 'nuages' 'gris'    (P = 1100 / nl = 12 / moy = 92 / REL = 127)  
</p>
<p>12: 'ciel' '&#233;toiles' 'espace' 'astronomie'   (P = 960 / nl = 12 / moy = 80 / REL = 111)  
</p>
<p>13: 'ciel' 'espace' 'astronomie' 'univers'   (P = 930 / nl = 12 / moy = 78 / REL = 107)  
</p>
<p>14: 'ciel' 'gris' 'noir'     (P = 580 / nl = 6 / moy = 97 / REL = 106)  
</p>
<p>15: 'ciel' 'paradis'      (P = 120 / nl = 2 / moy = 60 / REL = 42)  
</p>
<p>Figure 2 : Cette figure montre les 16 usages du terme ciel actuellement d&#233;cel&#233;s. 
Pour chacun de ces usages du terme ciel figure &#233;galement une &#233;valuation de sa pertinence 
(valeur REL). Le terme ciel est polys&#233;mique, les 16 usages ci-dessus correspondent &#224; 
plusieurs sens distincts des domaines : m&#233;t&#233;orologie, astronomie, a&#233;ronautique et religion.  
</p>
<p>4. Similarit&#233; entre cliques : arbre des usages 
4.1. D&#233;finition 
</p>
<p>Nous venons de d&#233;finir les usages d&#8217;un terme par la notion de cliques dans le r&#233;seau 
lexical. L&#8217;exemple ci-dessus montre clairement que, pour un m&#234;me terme, certaines cliques 
correspondent &#224; des usages s&#233;mantiquement plus proches que d&#8217;autres. Il s&#8217;agit donc de 
d&#233;finir un coefficient, compris entre 0 et 1, qui traduira la proximit&#233; s&#233;mantique de deux 
usages. Plus l&#8217;intersection entre deux cliques sera importante, plus le coefficient de similarit&#233; 
sera proche de 1. De nombreux travaux ont &#233;t&#233; r&#233;alis&#233;s sur la similarit&#233;. (Tversky, 1977) 
d&#233;finit la similarit&#233; de deux objets comme &#233;tant fonction de leurs caract&#233;ristiques communes 
par rapport &#224; l&#8217;ensemble de leurs caract&#233;ristiques. En TALN, on trouve plusieurs d&#233;finitions 
de la similarit&#233;, par exemple (Manning et Sch&#252;tze, 1999), ou plus r&#233;cemment (Fairon et Ho, 
2004). PROX, d&#233;velopp&#233; par (Gaume, 2004), &#233;tablit une distance entre termes &#224; partir d&#8217;un 
graphe de dictionnaire, en calculant des similarit&#233;s entre ses sommets (les entr&#233;es du 
dictionnaire en question). En particulier, dans un certain nombre de mod&#233;lisations une 
repr&#233;sentation vectorielle ou matricielle est utilis&#233;e ; la fonction cosinus est alors couramment 
employ&#233;e pour exprimer la similarit&#233; entre deux vecteurs. Dans notre cas, elle correspond au 
rapport du poids de l&#8217;intersection de deux cliques sur la moyenne g&#233;om&#233;trique des poids de 
ces deux cliques. En consid&#233;rant chaque clique comme un ensemble de relations pond&#233;r&#233;es, la 
similarit&#233; entre deux cliques C1 et C2 s&#8217;&#233;crira : 
</p>
<p>    Sim(C1,C2) = &#8721;C1&#8745;C2 Poids(relations)  
         /   [ &#8721;C1 Poids(relations) * &#8721; C2 Poids(relations)] &#189; 
</p>
<p>ou, en utilisant les notations ci-dessus : 
    Sim(C1,C2) = P(C1&#8745;C2)   /   [ P(C1) * P(C2)] &#189; 
o&#249; P(C) d&#233;signe la somme des poids des relations composant la clique C. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT, St&#233;phane RIOU 
</p>
<p> 
</p>
<p>4.2. Regroupement des usages : d&#233;termination des sens 
Comme vu &#224; la section 3, chaque clique correspond &#224; un usage d&#8217;un terme. Pour un terme, 
</p>
<p>deux cliques voisines correspondent &#224; deux usages voisins de ce terme : plus le coefficient de 
similarit&#233; est proche de 1, plus proches s&#233;mantiquement sont les cliques. En utilisant le 
coefficient de similarit&#233;, il est possible de regrouper les diff&#233;rents usages d&#8217;un m&#234;me terme : il 
est possible d&#8217;estimer qu&#8217;au-del&#224; d&#8217;un certain seuil du coefficient de similarit&#233;, proche de 1, 
deux cliques d&#8217;un m&#234;me terme correspondent en fait &#224; deux raffinements d&#8217;un m&#234;me usage de 
ce terme. Il est d&#8217;ailleurs probable qu&#8217;&#224; terme deux cliques tr&#232;s voisines puissent fusionner, 
dans une &#233;volution ult&#233;rieure du r&#233;seau, en fonction de l&#8217;activit&#233; des joueurs. 
</p>
<p>Par exemple, dans l&#8217;&#233;tat actuel de notre r&#233;seau, le terme soleil poss&#232;de 28 cliques. La 
figure 3 pr&#233;sente un extrait de cet ensemble de cliques. 
 &#8230; 
</p>
<p>Clique 4: 'soleil' '&#233;toile' 'lune' 'plan&#232;te' 'ciel'   (P = 2650 / nl = 20 / moy = 133 / REL = 213)  
</p>
<p>Clique 5: 'soleil' '&#233;toile' 'astre' 'plan&#232;te' 'galaxie'  (P = 2660 / nl = 20 / moy = 133 / REL = 214)  
</p>
<p>Clique 6: 'soleil' '&#233;toile' 'astre' 'lune' 'plan&#232;te'   (P = 2470 / nl = 20 / moy = 124 / REL = 199)  
</p>
<p> &#8230; 
</p>
<p>Clique 9: 'soleil' 'astre' 'astronomie' 'galaxie'   (P = 1120 / nl = 12 / moy = 93 / REL = 129)  
</p>
<p> &#8230; 
</p>
<p>Clique11: 'soleil' 'plan&#232;te' 'galaxie' 'syst&#232;me solaire'  (P = 1190 / nl = 12 / moy = 99 / REL = 137)  
</p>
<p> &#8230;  
</p>
<p>Clique 23: 'soleil' 'ciel' 'nuage' 'pluie'    (P = 2720 / nl = 12 / moy = 227 / REL = 314)  
</p>
<p> &#8230; 
</p>
<p>Figure 3 : Extrait de la liste des cliques du terme soleil. 
-  Clique 4 =&gt; soleil : &#233;toile gravitant dans le ciel avec les plan&#232;tes et la lune 
-  Clique 5 =&gt; soleil : &#233;toile d&#8217;un syst&#232;me plan&#233;taire de la galaxie 
-  Clique 6 =&gt; soleil : dans le sens astre, comme la lune et les plan&#232;tes 
-  Clique 9 =&gt; aspect plus scientifique (astronomie) de l&#8217;astre soleil 
-  Clique 11 =&gt; soleil parmi les objets c&#233;lestes, avec &#233;chelle des tailles : plan&#232;te &#8211; soleil &#8211; 
syst&#232;me solaire &#8211; galaxie 
-  Clique 23 =&gt; soleil en tant qu&#8217;&#233;l&#233;ment de m&#233;t&#233;orologie  
</p>
<p>Les cinq premi&#232;res cliques reproduites ici correspondent &#224; cinq usages du terme soleil dans 
le sens &#233;toile. Les autres cliques du terme soleil correspondent &#224; des usages centr&#233;s sur des 
sens de chaleur, lumi&#232;re, vacances ou m&#233;t&#233;orologie, comme par exemple la clique 23. Nous 
avons calcul&#233; les similarit&#233;s entre ces cliques ; en voici quelques valeurs :   
Sim(C4,C5) = 0,339  Sim(C4,C6) = 0.583  Sim(C4,C23) = 0,171 
Sim(C5,C6) = 0,664  Sim(C5,C23) = 0  Sim(C6,C23) = 0 
Les cliques C4-C5-C6 d&#8217;une part, et C23 d&#8217;autre part, correspondent manifestement &#224; deux 
sens diff&#233;rents du terme soleil. Remarquons toutefois que notre r&#233;seau est &#233;volutif : il est 
possible que certaines cliques existantes puissent fusionner, et de nouvelles cliques peuvent 
apparaitre. 
</p>
<p>Il est &#233;galement possible d&#8217;envisager qu&#8217;il existe un second seuil du coefficient de 
similarit&#233;, relativement faible, en de&#231;&#224; duquel deux cliques d&#8217;un m&#234;me terme correspondent &#224; 
deux sens distincts de ce terme. Comme mentionn&#233; &#224; la section 3.1, la notion de sens est 
beaucoup plus large que celle d&#8217;usage, un sens regroupant g&#233;n&#233;ralement plusieurs usages. En 
particulier, deux cliques d&#8217;un m&#234;me terme ne poss&#233;dant que ce terme en commun 
correspondront fort probablement &#224; deux sens distincts de ce terme. Par exemple, le terme 
barreau poss&#232;de trois cliques (voir la figure 4). Ces trois cliques correspondent 
manifestement &#224; trois sens distincts du terme barreau. 
Clique 0: 'barreau' 'avocat' 'justice'    (P = 760 / nl = 6 / moy = 127 / REL = 139)  
</p>
<p>Clique 1: 'barreau' 'prison' 'prisonnier'    (P = 900 / nl = 6 / moy = 150 / REL = 165)  
</p>
<p>Clique 2: 'barreau' 'chaise'     (P = 150 / nl = 2 / moy = 75 / REL = 52)  
</p>
<p>Figure 4 : Les trois cliques du terme barreau 
-  Clique 0 =&gt; barreau : ordre professionnel des avocats </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sens et usages d&#8217;un terme dans un r&#233;seau lexical &#233;volutif 
</p>
<p> 
</p>
<p>-  Clique 1 =&gt; barreau : barre m&#233;tallique dans une prison 
-  Clique 2 =&gt; barreau : &#233;l&#233;ment d&#8217;une chaise 
</p>
<p>Ces trois cliques n&#8217;ayant que le terme barreau en commun, leurs similarit&#233;s seront nulles. 
</p>
<p>4.3. Arbre des usages 
</p>
<p>Notre objectif est d&#8217;obtenir une repr&#233;sentation des diff&#233;rents usages d&#8217;un terme T sous 
forme d&#8217;un arbre, la racine regroupant tous les sens de T, les branches correspondant &#224; ses 
diff&#233;rents usages. La figure 5 illustre la construction de cet arbre sur un exemple simple : le 
terme blaireau. Ce terme poss&#232;de actuellement trois cliques disjointes, leurs similarit&#233;s sont 
nulles ; le terme blaireau pr&#233;sente donc trois usages. Son arbre des usages, pr&#233;sent&#233; &#224; la figure 
5, est constitu&#233; d&#8217;une racine  regroupant tous ses usages et de trois branches simples 
correspondant chacune &#224; un usage.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 5 : R&#233;seau lexical r&#233;duit aux cliques du terme blaireau et l&#8217;arbre des usages 
correspondant. 
</p>
<p>De mani&#232;re g&#233;n&#233;rale, la plupart des termes poss&#232;dent plusieurs cliques non disjointes. Dans 
ce cas, l&#8217;arbre des usages est plus complexe que celui de l&#8217;exemple ci-dessus : plus on 
s&#8217;&#233;loigne de la racine, plus on rencontre des distinctions fines d&#8217;usages. En r&#233;alit&#233;, nous 
construisons l&#8217;arbre des usages d&#8217;un terme T depuis l&#8217;ensemble de ses cliques, c&#8217;est-&#224;-dire 
depuis ses feuilles en remontant jusqu&#8217;&#224; sa racine qui regroupe tous les sens de T. Pour cela, 
nous fusionnons ces cliques, deux &#224; deux, en commen&#231;ant par celles dont le coefficient de 
similarit&#233; est le plus &#233;lev&#233; : nous constituons ainsi des quasi-cliques repr&#233;sentant des 
regroupements d&#8217;usages. L&#8217;algorithme de fusion s&#8217;arr&#234;te lorsque tous les coefficients de 
similarit&#233; sont nuls ; nous faisons l&#8217;hypoth&#232;se que les quasi-cliques obtenues alors pourraient 
correspondre aux diff&#233;rents sens de T, tels qu&#8217;on pourrait les trouver dans un dictionnaire. La 
figure 6 montre, pour le terme &#233;toile, l&#8217;ensemble des termes constituant ses six cliques. Pour 
ce terme, nous avons calcul&#233; son arbre des usages ; celui-ci est pr&#233;sent&#233; &#224; la figure 7. 
</p>
<p>L&#8217;arbre des usages d&#8217;un terme est une structure exprimant les raffinements de ses 
diff&#233;rents sens. Il constitue donc un arbre de d&#233;cision, structure de donn&#233;es qui pourra &#234;tre 
exploitable en d&#233;sambigu&#239;sation. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT, St&#233;phane RIOU 
</p>
<p> 
</p>
<p> 
</p>
<p>Clique 0: 388 '&#233;toile' 'ciel' 'espace'     (P = 940 / nl = 6 / moy = 157 / REL = 172)  
</p>
<p>Clique 1: 448 '&#233;toile' 'ciel' 'soleil'     (P = 1400 / nl = 6 / moy = 233 / REL = 256)  
</p>
<p>Clique 2: 331 '&#233;toile' 'soleil' 'astre' 'galaxie' 'plan&#232;te'   (P = 2670 / nl = 20 / moy = 134 / REL = 215)  
</p>
<p>Clique 3: 288 '&#233;toile' 'star'      (P = 270 / nl = 2 / moy = 135 / REL = 94)  
</p>
<p>Clique 4: 271 '&#233;toile' 'astre' 'espace' 'galaxie' 'plan&#232;te'   (P = 2650 / nl = 20 / moy = 133 / REL = 213)  
</p>
<p>Clique 5: 272 '&#233;toile' 'nuit'      (P = 310 / nl = 2 / moy = 155 / REL = 107)  
</p>
<p>Figure 6 : R&#233;seau lexical r&#233;duit aux cliques du terme &#233;toile, ainsi que la liste de ces cliques 
(pr&#233;c&#233;d&#233;es de leur num&#233;ro). 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 7 : Arbre des usages du terme &#233;toile. Les valeurs num&#233;riques correspondent aux 
num&#233;ros des diff&#233;rentes cliques ou quasi-cliques. Les termes les constituants n&#8217;ont &#233;t&#233; 
indiqu&#233;s qu&#8217;aux feuilles de l&#8217;arbre, afin de ne pas surcharger la figure. 
</p>
<p>L&#8217;arbre des usages d&#8217;un terme est une structure exprimant les raffinements de ses 
diff&#233;rents sens. Il constitue donc un arbre de d&#233;cision, structure de donn&#233;es qui pourra &#234;tre 
exploitable en d&#233;sambigu&#239;sation. 
</p>
<p>5. R&#233;sultats et &#233;volution du r&#233;seau lexical obtenu 
Le but recherch&#233; est d&#8217;inciter les joueurs &#224; revenir r&#233;guli&#232;rement sur le site, et donc 
</p>
<p>d&#8217;augmenter d&#8217;autant le nombre de relations acquises : c&#8217;est l&#8217;int&#233;r&#234;t majeur de cette approche 
jeu par rapport &#224; un logiciel qui se contenterait de demander des relations &#224; des utilisateurs 
qui, certes, auraient plus conscience de leur r&#244;le d&#8217;&#171;experts &#187;, mais qui, probablement, y 
consacreraient moins de temps. 
</p>
<p>Le lancement de JeuxDeMots a eu lieu en juillet 20074. Depuis environ un an et demi, plus 
de 1600 joueurs se sont enregistr&#233;s et une bonne proportion d&#8217;entre eux se connectent 
plusieurs fois par semaine. Plus de 130.000 parties ont &#233;t&#233; jou&#233;es : elles ont fait &#233;merger plus 
de 180.000 relations, en progression quasi constante d&#8217;environ 10.000 relations 
suppl&#233;mentaires par mois. Il y a une &#233;mergence rapide des relations et on constate que les 
                                                 
</p>
<p>4
 Le lancement de PtiClic est beaucoup trop r&#233;cent (janvier 2009) pour que son influence sur le r&#233;seau lexical ait 
</p>
<p>pu &#234;tre objectivement mesur&#233;e. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sens et usages d&#8217;un terme dans un r&#233;seau lexical &#233;volutif 
</p>
<p> 
</p>
<p>plus fortes (celles qui viennent le plus spontan&#233;ment &#224; l&#8217;esprit des joueurs) sont 
statistiquement cr&#233;&#233;es en premier. Sans que cela soit une surprise, nous avons constat&#233; qu&#8217;il y 
a une corr&#233;lation tr&#232;s forte entre le poids d&#8217;une relation et son rang de cr&#233;ation parmi les 
autres relations pour un m&#234;me terme cible. L&#8217;&#233;volution de la base de termes est 
n&#233;cessairement plus lente : elle compte &#224; ce jour environ 165.000 termes ; les joueurs y ont 
d&#233;j&#224; ajout&#233; pr&#232;s de 10.000 nouveaux termes, principalement conjoncturels ou li&#233;s &#224; l&#8217;actualit&#233;.  
</p>
<p>Dans JeuxDeMots, approximativement 20.000 termes ont des relations sortantes et plus de 
30.000 termes poss&#232;dent au moins une relation entrante ; de tr&#232;s nombreux termes ne sont 
reli&#233;s &#224; aucun autre, ce qui montre que notre r&#233;seau est loin d&#8217;&#234;tre &quot;complet&quot;5. Le r&#233;seau 
lexical actuellement obtenu poss&#232;de une volumineuse composante connexe regroupant pr&#232;s de 
40.000 termes, plusieurs centaines de composantes connexes ne comportant que quelques 
termes, ainsi que plus de 100.000 termes isol&#233;s. 
</p>
<p>En ce qui concerne la d&#233;termination des usages d&#8217;un terme, les figures pr&#233;c&#233;dentes 
montrent des exemples de cliques d&#233;tect&#233;es dans le r&#233;seau lexical, avec leurs poids respectifs 
(poids total de chaque clique, ainsi que sa pertinence, telle que d&#233;finie en section 3.2). La 
figure 8 montre l&#8217;&#233;volution des cliques du terme ciel sur plusieurs mois, depuis la cr&#233;ation du 
r&#233;seau lexical. On y constate l&#8217;augmentation du nombre de cliques, ainsi que celle de leurs 
pertinences.  
</p>
<p>Cliques du terme &quot;CIEL&quot;
</p>
<p>0
50
</p>
<p>100
150
200
250
300
350
400
450
</p>
<p>0 5 10 15 20
temps (mois)
</p>
<p>Pe
rti
</p>
<p>ne
nc
</p>
<p>e 
 
</p>
<p>ce
</p>
<p>Cliques
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 8 : Evolution des cliques du terme ciel. Sur ce graphique, l&#8217;origine de l&#8217;axe du temps 
est fix&#233;e &#224; juillet 2007, mois de lancement du prototype de JeuxDeMots. Le nombre et la 
pertinence des cliques du terme ciel ont &#233;t&#233; d&#233;termin&#233;s &#224; quatre dates diff&#233;rentes, entre 
f&#233;vrier 2008 et f&#233;vrier 2009. 
</p>
<p>6. Conclusion 
A partir d&#8217;une base de termes pr&#233;existante n&#233;cessaire pour amorcer le processus, les jeux 
</p>
<p>en ligne JeuxDeMots et PtiClic permettent la construction d&#8217;un r&#233;seau lexical &#233;volutif. 
L&#8217;&#233;mergence de relations typ&#233;es et pond&#233;r&#233;es entre termes s&#8217;effectue gr&#226;ce au concours d&#8217;un 
grand nombre d&#8217;utilisateurs dont l&#8217;activit&#233; ludique a pour effet de bord la construction de ce 
r&#233;seau. Ces utilisateurs ne sont certes pas des linguistes, mais nous pensons que leur nombre 
permettra d&#8217;obtenir un r&#233;seau &#233;volutif de bonne qualit&#233;, avec une couverture satisfaisante de 
l&#8217;ensemble des connaissances g&#233;n&#233;rales. Notre but n&#8217;est pas la constitution d&#8217;une base 
d&#8217;experts, mais d&#8217;une base de connaissances &#8243;moyennes&#8243;, repr&#233;sentant une culture g&#233;n&#233;rale 
commune, quelque peu biais&#233;e, nous le reconnaissons, par le fait que JeuxDeMots et PtiClic 
&#233;tant des jeux en ligne, les utilisateurs ont donc essentiellement un profil d&#8217;internaute. 
</p>
<p>De plus, au vu des r&#233;sultats actuels, bien que n&#233;cessairement partiels, nous pensons arriver 
&#224; identifier les diff&#233;rents sens d&#8217;usage parmi ceux repr&#233;sent&#233;s pour chaque terme du r&#233;seau. 
Ce dernier travail n&#8217;en est qu&#8217;&#224; ses d&#233;buts : pourquoi ne pas consid&#233;rer &#233;galement les quasi-
cliques dans la d&#233;termination des usages d&#8217;un terme ? Faut-il descendre jusqu&#8217;aux feuilles de 
l&#8217;arbre des usages d&#8217;un terme pour en d&#233;terminer les usages ? Pour un m&#234;me terme, deux 
cliques pour lesquelles le coefficient de similarit&#233; est proche de 1 correspondent-elles 
r&#233;ellement &#224; deux usages distincts de ce terme ? Ces questions restent actuellement ouvertes : 
                                                 
</p>
<p>5
 Compte tenu de l&#8217;&#233;volution de notre r&#233;seau depuis sa cr&#233;ation il y a 18 mois, et en supposant que cette 
</p>
<p>&#233;volution se poursuive au m&#234;me rythme, notre r&#233;seau pourrait &#234;tre &quot;complet&quot; au bout &#8230; d&#8217;une dizaine d&#8217;ann&#233;es, 
mais il compterait alors pr&#232;s de 1,5 million de relations. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT, St&#233;phane RIOU 
</p>
<p> 
</p>
<p>il est possible que, malgr&#233; l&#8217;&#233;volution de notre r&#233;seau, des cliques actuellement s&#233;par&#233;es ne 
fusionneront pas, alors qu&#8217;on peut manifestement les consid&#233;rer comme un m&#234;me usage. Par 
exemple, pour le terme ciel, parmi les cliques existantes on trouve ciel-nuage-pluie-gris et 
ciel-nuage-soleil-pluie qui, bien que tr&#232;s proches, ne fusionneront probablement pas, car la 
relation soleil-gris a peu de chances d&#8217;&#233;merger. Ce biais est-il induit par notre m&#233;thodologie 
ou est-il d&#251; &#224; la repr&#233;sentation en r&#233;seau lexical ? 
</p>
<p>R&#233;f&#233;rences 
VONAHN L., DABBISH L. (2004) Labelling Images with a Computer Game, ACM Conference 
</p>
<p>on Human Factors in Computing Systems (CHI), pp. 319-326. 
BOYD-GRABER J., FELLBAUM C., OSHERSON D., SCHAPIRE R. (2006) Adding dense, 
</p>
<p>weighted connections to WordNet, Proceedings of the third Global WordNet Meeting, Jeju 
Island, Korea 
</p>
<p>COLLINS A., QUILLIAN M.R. (1969) Retrieval time from semantic memory, Journal of verbal 
learning and verbal behaviour, 8 (2), pp. 240-248 
</p>
<p>DUMAIS S.T. (1994) Latent Semantic Indexing (LSI) and TREC-2, The Second Text REtrieval 
Conference, National Institute of Standards and Technology Special Publication, vol 500, 
n&#176;215, pp. 105-116 
</p>
<p>FAIRON C., HO N.D. (2004) Quantit&#233; d&#8217;information &#233;chang&#233;e : une nouvelle mesure de la 
similarit&#233; des mots, Journ&#233;es internationales d&#8217;Analyse statistiques des Donn&#233;es Textuelles 
(JADT&#8217;04), Louvain-la-Neuve (Belgique) 
</p>
<p>GAUME B. (2004) Balades al&#233;atoires dans les Petits Mondes Lexicaux, I3 Information 
Interaction Intelligence, vol. 4, n&#176;2, Cepadues Ed. 
</p>
<p>LAFOURCADE M., JOUBERT A. (2008)  D&#233;termination des sens d&#8217;usage dans un r&#233;seau lexical 
construit gr&#226;ce &#224; un jeu en ligne, Conf&#233;rence sur le Traitement Automatique des Langues 
Naturelles (TALN&#8217;08), Avignon, pp.189-199 
</p>
<p>LANDAUER T.K., DUMAIS S.T. (1997) A solution to Plato&#8217;s problem : the Latent Semantic 
Analysis theory of acquisition, induction and representation of knowledge, Psychological 
Review, 104, pp. 211-240 
</p>
<p>LAPATA M., KELLER F. (2005) Web-based Models for Natural Language Processing,  ACM 
Transactions on Speech and Language Processing, vol.2, n&#176;1, pp. 1-30. 
</p>
<p>LIEBERMAN H., SMITH D.A., TEETERS A. (2007) Common Consensus: a web-based game for 
collecting commonsense goals, International Conference on Intelligent User Interfaces 
(IUI&#8217;07), Hawaii, USA 
</p>
<p>MANNING C.D., SCH&#220;TZE H. (1999) Foundations of Statistical Natural Language Processing, 
MIT Press, Cambridge 
</p>
<p>MEL&#8217;CUK I.A., CLAS A., POLGUERE A. (1995) Introduction &#224; la lexicologie explicative et 
combinatoire, Editions Duculot AUPELF-UREF 
</p>
<p>MILLER G.A., BECKWITH R., FELLBAUM C., GROSS D., MILLER K.J. (1990) Introduction to 
WordNet: an on-line lexical database, International Journal of Lexicography 3 (4), pp. 
235-244. 
</p>
<p>PLOUX S., VICTORRI B. (1998) Construction d&#8217;espaces s&#233;mantiques &#224; l&#8217;aide de dictionnaires 
de synonymes, Traitement Automatique des Langues, 39, n&#176;1, pp. 161-182 
</p>
<p>POLGU&#200;RE A. (2006) Structural properties of Lexical Systems: Monolingual and Multilingual 
Perspectives, Proceedings of the Workshop on Multilingual Language Resources and 
Interoperability (COLING/ACL 2006), Sydney, pp. 50-59. 
</p>
<p>ROBERTSON S. et SPARK JONES K. (1976) Relevance weighting of search terms, Journal of the 
American Society for Information Science, n&#176; 27, pp. 129-146. 
</p>
<p>ROGET (1852) Thesaurus of English Words and Phrases, Longman, London 
SALTON G. (1968) Automatic Information Organization and Retrieval, Mac Graw Hill, NY. 
TVERSKY A. (1977) Features of similarity, Psychological Review, 84, pp.327-352 
V&#201;RONIS J. (2001) Sense tagging: does it make sense?, Corpus linguistics&#8217; 2001 Conference, 
</p>
<p>Lancaster, U.K. 
ZAMPA V. et LAFOURCADE M. (2009) Evaluations compar&#233;es de deux m&#233;thodes 
</p>
<p>d&#8217;acquisitions lexicale et ontologique : JeuxDeMots vs Latent Semantic Analysis, XVI&#232;mes 
rencontres de Rochebrune : ontologie et dynamique des syst&#232;mes complexes, perspectives 
interdisciplinaires. </p>

</div></div>
</body></html>