<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Int&#233;gration des constructions &#224; verbe support dans TimeML</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters , Senlis, 24&#8211;26 juin 2009
</p>
<p>Int&#233;gration des constructions &#224; verbe support dans TimeML
</p>
<p>Andr&#233; Bittar et Laurence Danlos
ALPAGE, INRIA Rocquencourt, 78150 Le Chesnay
</p>
<p>Universit&#233; Paris Diderot, 75013 Paris
andre.bittar@linguist.jussieu.fr, laurence.danlos@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. Le langage TimeML a &#233;t&#233; con&#231;u pour l&#8217;annotation des informations temporelles
dans les textes, notamment les &#233;v&#233;nements, les expressions de temps et les relations entre les
deux. Des consignes d&#8217;annotation g&#233;n&#233;rales ont &#233;t&#233; &#233;labor&#233;es afin de guider l&#8217;annotateur dans
cette t&#226;che, mais certains ph&#233;nom&#232;nes linguistiques restent &#224; traiter en d&#233;tail. Un probl&#232;me
commun dans les t&#226;ches de TAL, que ce soit en traduction, en g&#233;n&#233;ration ou en compr&#233;hension,
est celui de l&#8217;encodage des constructions &#224; verbe support. Relativement peu d&#8217;attention a &#233;t&#233;
port&#233;e, jusqu&#8217;&#224; maintenant, sur ce probl&#232;me dans le cadre du langage TimeML. Dans cet article,
nous proposons des consignes d&#8217;annotation pour les constructions &#224; verbe support.
</p>
<p>Abstract. TimeML is a markup language developed for the annotation of temporal infor-
mation in texts, in particular events, temporal expressions and the relations which hold between
the two. General annotation guidelines have been developed to guide the annotator in this task,
but certain linguistic phenomena have yet to be dealt with in detail. A common problem in NLP
tasks, whether in translation, generation or understanding, is that of the encoding of light verb
constructions. Relatively little attention has been paid to this problem, until now, in the TimeML
framework. In this article, we propose annotation guidelines for light verb constructions.
</p>
<p>Mots-cl&#233;s : TimeML, verbes support, discours, s&#233;mantique.
</p>
<p>Keywords: TimeML, light verbs, discourse, semantics.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar et Laurence Danlos
</p>
<p>1 Introduction
</p>
<p>TimeML1 est un langage d&#8217;annotation qui a pour objectif l&#8217;explicitation des informations tem-
porelles contenues dans des textes, en se focalisant sur l&#8217;annotation de crit&#232;res de surface, c&#8217;est-
&#224;-dire ce qui est lexicalis&#233; dans le texte. Ce langage permet d&#8217;annoter les unit&#233;s linguistiques
r&#233;alisant des &#233;v&#233;nements, les expressions temporelles, les marqueurs de relation (typiquement
des pr&#233;positions comme avant ou apr&#232;s) ainsi que les relations aspectuelles, temporelles ou de
subordination qui peuvent exister entre &#233;v&#233;nements et expressions temporelles. Sont consid&#233;r&#233;s
basiquement comme des &#233;v&#233;nements introduisant une balise &lt;EVENT&gt; des verbes &quot;ordinaires&quot;
comme &#233;crire ou commettre dans (1).
</p>
<p>(1)a. Luc a &#233;crit ce livre.
b. Luc a commis ce film.
</p>
<p>Sont aussi consid&#233;r&#233;s basiquement comme des &#233;v&#233;nements introduisant une balise &lt;EVENT&gt;
des noms comme destruction ou agression dans (2). Pour de telles phrases, TimeML codera
&#224; raison deux &#233;v&#233;nements : l&#8217;&#233;v&#233;nement d&#233;crit par le verbe &quot;ordinaire&quot; (d&#233;crire ou filmer) et
l&#8217;&#233;v&#233;nement d&#233;crit par l&#8217;objet de ces verbes (destruction ou agression).
</p>
<p>(2)a. Luc a d&#233;crit la destruction de Rome (par Brutus).
b. Max a film&#233; l&#8217;agression de Luc contre Marie.
</p>
<p>Mais qu&#8217;en est-il pour les constructions &#224; &#8220;verbe support&#8221; illustr&#233;es dans les exemples (3) ?
</p>
<p>(3)a. Luc a commis une agression contre Marie.
b. Marie a subi une agression de la part de Luc.
</p>
<p>Pour (3a), un codage o&#249; le verbe commettre introduit une balise &lt;EVENT&gt; comme en (1b) et
o&#249; le nom agression introduit ind&#233;pendamment une autre balise &lt;EVENT&gt; comme en (2b) n&#8217;est
pas, en soi, totalement correct : un seul &#233;v&#233;nement est en jeu dans une construction &#224; verbe
support comme (3a), qui peut &#234;tre paraphras&#233;e par une phrase &#224; verbe &quot;ordinaire&quot; Luc a agress&#233;
Marie qui ne met en jeu qu&#8217;un seul &#233;v&#233;nement. De m&#234;me pour (3b) qui peut &#234;tre paraphras&#233; par
Marie a &#233;t&#233; agress&#233;e par Luc.
</p>
<p>Cet article se propose donc d&#8217;examiner le codage des constructions &#224; verbe support en fran&#231;ais
dans TimeML, ce qui n&#8217;a pas &#233;t&#233; fait de fa&#231;on d&#233;taill&#233;e pour les autres langues couvertes par
TimeML (l&#8217;anglais, l&#8217;italien, le cor&#233;en et le chinois) &#224; notre connaissance. La Section 2 pr&#233;sen-
tera une introduction &#224; TimeML, ses enjeux et sa m&#233;thodologie. La Section 3 pr&#233;sentera les
principales donn&#233;es linguistiques concernant les constructions &#224; verbe support. La Section 4
proposera un codage linguistiquement justifi&#233; des constructions &#224; verbe support dans TimeML.
Enfin, la Section 5 portera sur des questions de faisabilit&#233; et de m&#233;thodologie.
</p>
<p>2 Pr&#233;sentation de TimeML
</p>
<p>TimeML (Pustejovsky et al., 2003) est un langage de sp&#233;cification con&#231;u pour l&#8217;annotation et
la normalisation d&#8217;informations temporelles dans des textes. Il a principalement &#233;t&#233; &#233;labor&#233;
</p>
<p>1La version de TimeML que l&#8217;on prend en compte ici est celle &#233;labor&#233;e dans les consignes de l&#8217;ISO (Lee et al.,
2007), effectivement ISO-TimeML.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;gration des constructions &#224; verbe support dans TimeML
</p>
<p>dans le cadre de l&#8217;am&#233;lioration de syst&#232;mes questions-r&#233;ponses en leur permettant de traiter des
questions d&#8217;ordre temporel sur les entit&#233;s et les &#233;v&#233;nements. Le sch&#233;ma d&#8217;annotation pr&#233;voit
les fonctionnalit&#233;s suivantes : l&#8217;annotation des &#233;v&#233;nements, l&#8217;&#233;tiquetage des expressions tem-
porelles et la normalisation de leur valeur2, ainsi que la mise en &#233;vidence des relations as-
pectuelles, temporelles ou de subordination qui peuvent exister entre ces deux types d&#8217;entit&#233;s
temporelles. Les marqueurs de relations peuvent &#233;galement &#234;tre annot&#233;s.
</p>
<p>TimeML adopte une conception large des &#233;v&#233;nements qui regroupe les &#233;v&#233;nements et certains
&#233;tats, ce qui correspond plus &#224; la notion d&#8217;&#233;ventualit&#233; (Bach, 1986). La balise &lt;EVENT&gt; permet
de classifier un &#233;v&#233;nement annot&#233; selon une ontologie pr&#233;d&#233;finie. L&#8217;ontologie TimeML compte
7 classes d&#8217;&#233;v&#233;nements diff&#233;rents : ASPECTUAL (commencer, continuer, terminer...), I_ACTION
(nier, permettre, emp&#234;cher...), I_STATE (vouloir, croire, aimer...), PERCEPTION (voir, enten-
dre, percevoir...), REPORTING (dire, citer, affirmer...), STATE (&#234;tre + ADJ), et OCCURRENCE (les
&#233;v&#233;nements qui ne rentrent pas dans l&#8217;une des autres classes). Nous orientons le lecteur vers
(Saur&#237; et al., 2005) pour une description de ces classes. La balise &lt;EVENT&gt; comporte des at-
tributs permettant de repr&#233;senter les informations grammaticales comme la partie du discours,
d&#8217;&#233;ventuels temps et modes verbaux, la pr&#233;sence d&#8217;une n&#233;gation, ainsi que les propri&#233;t&#233;s as-
pectuelles d&#8217;un &#233;v&#233;nement donn&#233;. Les consignes d&#8217;annotation pr&#233;cisent que l&#8217;on marque de
cette balise la t&#234;te lexicale du constituant qui d&#233;note l&#8217;&#233;v&#233;nement.
</p>
<p>Les expressions temporelles sont marqu&#233;es par la balise &lt;TIMEX3&gt;. Elles se divisent en qua-
tre classes : les dates (type DATE, le 15 janvier, 15.01.2008), les heures (type TIME, 15h20,
l&#8217;apr&#232;s-midi), les dur&#233;es (type DURATION, 5 jours, deux ans) et les ensembles (type SET, tous
les jours, hebdomadaire, anuellement). TimeML permet aussi de raisonner avec des expressions
temporelles sous-sp&#233;cifi&#233;es, comme lundi prochain et l&#8217;ann&#233;e derni&#232;re, dont la valeur doit &#234;tre
d&#233;termin&#233;e par rapport &#224; un point temporel de r&#233;f&#233;rence.
</p>
<p>Les &#233;v&#233;nements et les expressions temporelles sont mis en relation par trois sortes de liens
(links) : liens temporels (TLINK), aspectuels (ALINK) et de subordination (SLINK). La premi&#232;re
sorte capture des relations temporelles entre deux entit&#233;s (EVENT-EVENT, TIMEX3-TIMEX3, ou
EVENT-TIMEX3), la deuxi&#232;me capture les phases dans le d&#233;roulement d&#8217;un &#233;v&#233;nement, enfin la
troisi&#232;me est essentielle pour les raisonnements qui d&#233;pendent de la v&#233;racit&#233; ou la certitude des
propositions qui d&#233;notent des &#233;v&#233;nements. Les mots fonctionnels qui signalent explicitement
un de ces liens sont annot&#233;s avec la balise SIGNAL. Le plus souvent ce sont des pr&#233;positions
comme avant, apr&#232;s, pendant ou lors de.
</p>
<p>3 Pr&#233;sentation des constructions &#224; verbe support
</p>
<p>La notion de verbe support est traditionnellement utilis&#233;e (Gross, 1981) pour un verbe (not&#233;
Vsup) qui a comme objet (direct ou indirect) un nom pr&#233;dicatif (Npred) d&#233;notant une &#233;ventual-
it&#233;, comme sujet un participant &#224; cette &#233;ventualit&#233; &#8211; en gros, le participant qui est le sujet du
verbe morphologiquement associ&#233; auNpred s&#8217;il existe &#8211; et comme objet oblique &#233;ventuel l&#8217;autre
participant s&#8217;il y en a un, voir (4a). Cette notion &#224; &#233;t&#233; &#233;largie pour couvrir les verbes support
converses (Vconv) o&#249;, &#224; l&#8217;instar des constructions passives, les r&#244;les syntaxiques des participants
sont invers&#233;s, voir (4b) (Gross, 1982). Enfin, elle peut &#234;tre &#233;largie aux verbes supports inverses
(Vinv) o&#249; le Npred se trouve en position sujet, voir (4c) (Danlos, 2009).
</p>
<p>2La valeur &#233;tant la repr&#233;sentation codifi&#233;e de l&#8217;intervalle ou point temporel pr&#233;cis d&#233;sign&#233; par l&#8217;expression.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar et Laurence Danlos
</p>
<p>(4)a. Ce politicien a men&#233; une attaque contre le lib&#233;ralisme [Vsup]
(Ce politicien a attaqu&#233; le lib&#233;ralisme)
</p>
<p>b. Le lib&#233;ralisme a fait l&#8217;objet d&#8217;une attaque de la part de ce politicien [Vconv]
(Le lib&#233;ralisme a &#233;t&#233; attaqu&#233; par ce politicien)
</p>
<p>c. Un cri a &#233;chapp&#233; &#224; Luc [Vinv]
(Luc a cri&#233;)
</p>
<p>Dans les exemples (4), un seul &#233;v&#233;nement est en jeu, comme en t&#233;moigne la (pseudo-)paraphrase
avec une phrase &#224; verbe ordinaire donn&#233;e entre parenth&#232;ses. Nous verrons &#224; la Section 4.1 com-
ment prendre en compte ce ph&#233;nom&#232;ne en TimeML.
</p>
<p>Les verbes support de (4) ont un aspect neutre dans la mesure o&#249; aucune phase de l&#8217;&#233;ventualit&#233;
d&#233;not&#233;e par le Npred n&#8217;est mise en &#233;vidence. Ceci n&#8217;est pas le cas dans l&#8217;exemple (5) o&#249; lancer,
verbe support &#224; aspect non neutre, indique qu&#8217;on s&#8217;int&#233;resse au d&#233;but de l&#8217;attaque.
</p>
<p>(5) Ce politicien a lanc&#233; une attaque contre le lib&#233;ralisme [Vasp]
</p>
<p>Dans une construction &#224; verbe support, le Npred est la t&#234;te d&#8217;un GN et en tant que tel il peut &#234;tre
quantifi&#233;, (6a), la quantification portant le nombre d&#8217;occurrences de l&#8217;&#233;ventualit&#233; concern&#233;e, ou
modifi&#233;, par exemple, par des adjectifs temporels, (6b), ou de fr&#233;quence, (6c).
</p>
<p>(6)a. Ce politicien a lanc&#233; (quatre + plusieurs) attaques contre le lib&#233;ralisme.
b. Luc a fait un voyage nocturne.
c. Luc faisait une visite hebdomadaire &#224; sa m&#232;re.
</p>
<p>4 Int&#233;gration des verbes support dans TimeML
</p>
<p>Nous pr&#233;sentons maintenant notre solution pour le traitement des constructions &#224; verbe support
dans le cadre de l&#8217;annotation TimeML.
</p>
<p>4.1 Ph&#233;nom&#232;nes de base
</p>
<p>Avant de pr&#233;senter notre solution, nous devons expliquer comment TimeML permet de capturer
les relations aspectuelles. D&#8217;abord celles qui existent entre un verbe matrice aspectuel et son
compl&#233;ment &#233;v&#233;nementiel sous forme de verbe infinitif, voir (7a), ou de groupe nominal, voir
(7b). Il s&#8217;agit ici de verbes tels que commencer, entamer, continuer, poursuivre, terminer ou ar-
r&#234;ter qui indiquent la phase initiale, m&#233;diane ou terminale dans le d&#233;roulement d&#8217;un &#233;v&#233;nement
introduit comme compl&#233;ment. Pour l&#8217;exemple (7a), l&#8217;annotation est donn&#233;e ci-dessous.
</p>
<p>(7)a. Luc a commenc&#233; &#224; pr&#233;parer une choucroute.
b. Luc a commenc&#233; la pr&#233;paration d&#8217;une choucroute.
</p>
<p>Luc a &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;ASPECTUAL&quot; pos=&quot;VERB&quot;
tense=&quot;PAST&quot;&gt;commenc&#233;&lt;/EVENT&gt; &#224; &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot;
class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot; vform=&quot;INFINITIVE&quot;&gt;pr&#233;parer&lt;/EVENT&gt; une
choucroute.
&lt;ALINK lid=&quot;l1&quot; eventInstanceID=&quot;ei1&quot; relatedToEventInstance=&quot;ei2&quot;
relType=&quot;INITIATES&quot;/&gt;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;gration des constructions &#224; verbe support dans TimeML
</p>
<p>Le verbe commencer est balis&#233; &lt;EVENT&gt;. Il re&#231;oit la classe ASPECTUAL et les valeurs VERB et
PAST pour ses traits grammaticaux de cat&#233;gorie (pos pour part-of-speech) et de temps verbal
(attribut tense) respectivement. Le verbe pr&#233;parer est lui aussi marqu&#233; par la balise &lt;EVENT&gt;.
Il est de classe OCCURRENCE, et sa balise contient un attribut vform qui capture le fait qu&#8217;il
s&#8217;agit d&#8217;un infinitif. Les deux balises &lt;EVENT&gt; contiennent des attributs eid et eiid, qui ser-
vent &#224; identifier les &#233;v&#233;nements et leurs instances. La derni&#232;re balise est un &lt;ALINK&gt; &#8212; identi-
fi&#233; par l&#8217;attribut lid &#8212; qui d&#233;signe une relation aspectuelle. Ses attributs eventInstanceID
et relatedToEventInstance s&#233;lectionnent les instances des &#233;v&#233;nements concern&#233;s : ei1
pour le verbe commencer et ei2 pour le verbe pr&#233;parer. L&#8217;attribut relType pr&#233;cise le type de
relation aspectuelle en jeu, ici INITIATES, qui indique que ei1 se situe au d&#233;but de ei2.
</p>
<p>Pour (7b), la seconde balise &lt;EVENT&gt; est plac&#233;e autour du nom et seule la valeur de l&#8217;attribut
pos change (cette balise ne contient pas l&#8217;attribut vform).
</p>
<p>Luc a &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;ASPECTUAL&quot; pos=&quot;VERB&quot;
tense=&quot;PAST&quot;&gt;commenc&#233;&lt;/EVENT&gt; la &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot;
class=&quot;OCCURRENCE&quot; pos=&quot;NOUN&quot;&gt;pr&#233;paration&lt;/EVENT&gt; d&#8217;une choucroute.
&lt;ALINK lid=&quot;l1&quot; eventInstanceID=&quot;ei1&quot; relatedToEventInstance=&quot;ei2&quot;
relType=&quot;INITIATES&quot;/&gt;
</p>
<p>Consid&#233;rons maintenant les phrases &#224; verbe support donn&#233;es en (8), (8a) &#233;tant construite autour
de lancer &#224; valeur aspectuelle inchoative (de classe TimeML ASPECTUAL), (8b) autour de mener
&#224; valeur aspectuelle neutre (de classe TimeML OCCURRENCE).
</p>
<p>(8)a. Une m&#232;re de famille a lanc&#233; une proc&#233;dure contre une institutrice &#224; Bourges.
b. Une m&#232;re de famille a men&#233; une proc&#233;dure contre une institutrice &#224; Bourges.
</p>
<p>&#201;tant donn&#233; leur similitude formelle et s&#233;mantique, (7b) et (8a) doivent recevoir des annota-
tions similaires. En cons&#233;quence, l&#8217;annotation de (8a) doit comprendre deux balises &lt;EVENT&gt;
qui sont reli&#233;es par l&#8217;interm&#233;diaire d&#8217;un &lt;ALINK&gt; indiquant une relation aspectuelle de type
INITIATES entre le verbe support lancer, de classe ASPECTUAL, et son compl&#233;ment nominal.
</p>
<p>Maintenant, les annotations de (8a) et (8b) doivent &#234;tre identiques sauf pour la relation aspectuo-
temporelle entre le verbe support et son compl&#233;ment nominal et la classe du verbe. Pour un
verbe support &#224; valeur aspectuelle neutre, c&#8217;est-&#224;-dire de classe OCCURRENCE, nous proposons
que cette relation aspectuelle soit de type IDENTITY, comme cela a &#233;t&#233; fait dans (Pustejovsky
et al., 2005) pour l&#8217;anglais et dans (Caselli, 2008) pour l&#8217;italien &#8212; cependant, dans les deux cas
sans argumentation pouss&#233;e. Nous obtenons donc l&#8217;annotation suivante pour (8b).
</p>
<p>Une m&#232;re de famille a &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;OCCURRENCE&quot;
pos=&quot;VERB&quot; tense=&quot;PAST&quot;&gt;men&#233;&lt;/EVENT&gt; une &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot;
pos=&quot;NOUN&quot;&gt;proc&#233;dure&lt;/EVENT&gt; contre une institutrice &#224; Bourges.
&lt;TLINK lid=&quot;l1&quot; eventInstanceID=&quot;ei1&quot; relatedToEventInstance=&quot;ei2&quot;
relType=&quot;IDENTITY&quot;/&gt;
</p>
<p>En conclusion, nous proposons que les phrases &#224; verbe support re&#231;oivent des annotations com-
portant deux balises &lt;EVENT&gt;, l&#8217;une pour le Vsup, l&#8217;autre pour leNpred. Pour un verbe support &#224;
valeur aspectuelle non neutre, ces deux balises sont reli&#233;es par un &lt;ALINK&gt; pr&#233;cisant le type de
relation aspectuelle entre le verbe support et son compl&#233;ment nominal. Pour un verbe support
&#224; valeur aspectuelle neutre, ces deux balises sont reli&#233;es par un &lt;TLINK&gt; de type IDENTITY.
Nous allons maintenant examiner d&#8217;autres ph&#233;nom&#232;nes concernant les phrases &#224; verbe support.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar et Laurence Danlos
</p>
<p>4.2 Quantification d&#8217;occurrences
</p>
<p>Tout groupe nominal &#233;v&#233;nementiel ordinaire porte une quantification et c&#8217;est bien le cas du GN
construit autour du Npred dans les constructions &#224; verbe support, cf Section 3. Dans les versions
ant&#233;rieures de TimeML (Saur&#237; et al., 2006), l&#8217;attribut cardinality servait &#224; capturer la valeur
des quantifications adverbiales, comme dans (9a). Ces consignes ne prenaient pas en compte la
quantification des occurrences d&#8217;&#233;v&#233;nements nominaux (9b).
</p>
<p>(9)a. Max a voyag&#233; en Tanzanie deux fois.
b. Deux violents s&#233;ismes ont fait des centaines de morts au Japon.
</p>
<p>D&#8217;un point de vue temporel, il peut &#234;tre pertinent d&#8217;annoter la quantification d&#8217;&#233;v&#233;nements nom-
inaux. C&#8217;est le cas dans les exemples de (10), qui pr&#233;cisent qu&#8217;un certain nombre d&#8217;accidents
ont eu lieu sur une p&#233;riode donn&#233;e. Il est &#233;galement important de capturer la quantification
d&#8217;occurrences dans les constructions &#224; verbe support, voir (12).
</p>
<p>(10)a. 934 accidents ont endeuill&#233; le pays au mois de mars.
b. Plusieurs accidents ont endeuill&#233; le pays au mois de mars.
c. Aucun accident n&#8217;a endeuill&#233; le pays au mois de mars.
</p>
<p>L&#8217;emploi de l&#8217;attribut cardinality n&#8217;est pas tr&#232;s d&#233;taill&#233; dans les consignes d&#8217;annotation
TimeML actuelles. Nous proposons d&#8217;employer cet attribut pour capturer la quantification d&#8217;oc-
currences (diff&#233;rente d&#8217;une valeur de 1) sur tout nom &#233;v&#233;nementiel marquable par une balise
&lt;EVENT&gt;. Les &#233;v&#233;nements de cardinalit&#233; 1 n&#8217;auront pas cet attribut. Nous proposons que le
domaine des valeurs soit des chiffres pour des expressions num&#233;riques pr&#233;cises (934, aucun)
comme dans (10a) et (10c) et des expressions &#224; op&#233;rateur unaire pour les valeurs vagues, comme
&gt;1 pour plusieurs dans (10b).
</p>
<p>L&#8217;annotation du nom &#233;v&#233;nementiel dans (10a) serait alors :
</p>
<p>934 &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;OCCURRENCE&quot; pos=&quot;NOUN&quot;
cardinality=&quot;934&quot;&gt;accidents&lt;/EVENT&gt; ont endeuill&#233; le pays au mois de mars.
</p>
<p>Prenons maintenant les deux phrases &#224; verbe ordinaire (11a) et (11b). (11a) comporte une quan-
tification adverbiale d&#8217;occurrence et (11b) comporte une quantification adverbiale de fr&#233;quence
d&#8217;occurrence.
</p>
<p>(11)a. Max a voyag&#233; en Tanzanie deux fois.
b. Max a voyag&#233; en Tanzanie deux fois par an.
</p>
<p>Dans (11a), la quantification adverbiale deux fois porte sur l&#8217;&#233;v&#233;nement d&#233;crit par le verbe voy-
ager. La version actuelle de TimeML traite ce genre de phrase de la fa&#231;on suivante. La quantifi-
cation adverbiale est captur&#233;e dans une balise &lt;TIMEX3&gt; exprimant la fr&#233;quence (freq=&quot;2X&quot;
pour deux fois). Un &lt;TLINK&gt; explicite la relation entre l&#8217;&#233;v&#233;nement et l&#8217;expression temporelle.
</p>
<p>Max a &lt;EVENT eid=&quot;e1&quot; eid=&quot;ei1&quot; class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot;
tense=&quot;PAST&quot;&gt;voyag&#233;&lt;/EVENT&gt; en Tanzanie &lt;TIMEX3 tid=&quot;t1&quot; type=&quot;SET&quot;
freq=&quot;2X&quot;&gt;deux fois&lt;/TIMEX3&gt;.
&lt;TLINK lid=&quot;l1&quot; eventInstanceID=&quot;ei1&quot; relatedToTime=&quot;t1&quot;
relType=&quot;IS_INCLUDED&quot;/&gt;
</p>
<p>Selon TimeML l&#8217;annotation de (11b) sera la suivante. La quantification adverbiale de fr&#233;quence
deux fois par an est captur&#233;e dans une seule balise &lt;TIMEX3&gt; de type SET qui d&#233;signe un
ensemble de valeurs. L&#8217;intervalle temporel est captur&#233; dans l&#8217;attribut value de valeur P1Y
(period of one year). L&#8217;attribut freq capture la fr&#233;quence.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;gration des constructions &#224; verbe support dans TimeML
</p>
<p>Max a &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot;
tense=&quot;PAST&quot;&gt;voyag&#233;&lt;/EVENT&gt; en Tanzanie &lt;TIMEX3 tid=&quot;t1&quot; type=&quot;SET&quot;
value=&quot;P1Y&quot; freq=&quot;2X&quot;&gt;deux fois par an&lt;/TIMEX3&gt;. &lt;TLINK lid=&quot;l1&quot;
eventInstanceID=&quot;ei1&quot; relatedToTime=&quot;t1&quot; relType=&quot;IS_INCLUDED&quot;/&gt;
</p>
<p>Venons-en maintenant au cas des constructions &#224; verbe support (12a-d).
(12)a. Max a fait un voyage en Tanzanie.
</p>
<p>b. Max a fait deux voyages en Tanzanie.
c. Max a fait un voyage en Tanzanie deux fois par an.
d. Max a fait deux voyages en Tanzanie par an.
</p>
<p>(12a) est annot&#233; selon les consignes que nous avons pr&#233;sent&#233;es dans la Section 4.1 pour les
verbes support &#224; valeur aspectuelle neutre. Pour (12b), qui comporte une quantification sur le
Npred, la balise &lt;EVENT&gt; du Npred a l&#8217;attribut cardinality de valeur 2.
</p>
<p>Max a &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot;
tense=&quot;PAST&quot;&gt;fait&lt;/EVENT&gt; deux &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot; pos=&quot;NOUN&quot;
cardinality=&quot;2&quot;&gt;voyages&lt;/EVENT&gt; en Tanzanie.
&lt;TLINK lid=&quot;l1&quot; eventInstanceID=&quot;ei1&quot; relatedToEventInstance=&quot;ei2&quot;
relType=&quot;IDENTITY&quot;/&gt;
</p>
<p>L&#8217;annotation de (12c), avec une quantification adverbiale de fr&#233;quence d&#8217;occurrence, peut &#234;tre
obtenue de fa&#231;on &#8220;compositionnelle&#8221; &#224; partir de (11b) et (12a). L&#8217;annotation est analogue &#224;
l&#8217;annotation pour (11b) sauf qu&#8217;il s&#8217;agit d&#8217;une construction &#224; verbe support. Le Npred est alors
annot&#233; par une balise &lt;EVENT&gt; et un &lt;TLINK&gt; explicite la relation entre le Vsup et le Npred.
</p>
<p>Max a &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot;
tense=&quot;PAST&quot;&gt;fait&lt;/EVENT&gt; un &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot;
pos=&quot;NOUN&quot;&gt;voyage&lt;/EVENT&gt; en Tanzanie &lt;TIMEX3 tid=&quot;t1&quot; type=&quot;SET&quot;
value=&quot;P1Y&quot; freq=&quot;2&quot;&gt;deux fois par an&lt;/TIMEX3&gt;.
&lt;TLINK lid=&quot;l1&quot; eventInstanceID=&quot;ei1&quot; relatedToEventInstance=&quot;ei2&quot;
relType=&quot;IDENTITY&quot;/&gt;
&lt;TLINK lid=&quot;l2&quot; eventInstanceID=&quot;ei1&quot; relatedToTime=&quot;t1&quot;
relType=&quot;IS_INCLUDED&quot;/&gt;
</p>
<p>Enfin passons &#224; l&#8217;annotation de (12d), o&#249; il y a une quantification sur le Npred ainsi qu&#8217;une
expression de fr&#233;quence par an rattach&#233;e au groupe nominal. Le verbe support est marqu&#233;
par une balise &lt;EVENT&gt;. Le Npred comporte &#233;galement une balise &lt;EVENT&gt;, avec un attribut
cardinality pour la quantification d&#8217;occurrences. Maintenant une difficult&#233; se pr&#233;sente lorsque
l&#8217;on doit annoter l&#8217;expression de fr&#233;quence. Les consignes TimeML (Lee et al., 2007) pr&#233;cisent
que l&#8217;&#233;tendue de la balise &lt;TIMEX3&gt; doit correspondre soit &#224; un groupe nominal (ex. deux fois
par an), soit un groupe adjectival (ex. annuel), soit un groupe adverbial (ex. annuellement), ce
qui n&#8217;est pas le cas de l&#8217;expression de fr&#233;quence ici en forme d&#8217;un groupe pr&#233;positionnel. De
plus, comme nous montre l&#8217;agrammaticalit&#233; dans (13a), l&#8217;expression de fr&#233;quence seule ne peut
appara&#238;tre dans les constructions &#224; verbe ordinaire &#224; la place d&#8217;un adverbe comme annuellement.
On ne saurait non plus l&#8217;annoter au m&#234;me titre qu&#8217;un adjectif, comme annuel (13b) et (13c), qui
repr&#233;sente &#224; la fois la quantification et la fr&#233;quence d&#8217;occurrence (par synonymie avec une fois
par an). Effectivement, le groupe pr&#233;positionnel qui exprime la fr&#233;quence ne peut &#234;tre s&#233;par&#233;
du groupe nominal quantifi&#233; qu&#8217;il modifie.
</p>
<p>(13)a. Max a voyag&#233; annuellement / *par an.
b. Le voyage annuel / *par an de Max.
c. Le voyage de Max &#233;tait annuel / *par an.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar et Laurence Danlos
</p>
<p>Il est alors difficile de savoir comment arriver &#224; une annotation ad&#233;quate dans le cadre du
langage TimeML actuel. La solution qui nous semble la mieux adapt&#233;e &#224; cette situation est
celle d&#8217;&#233;tendre le langage TimeML pour capturer non seulement la quantification mais aussi
la fr&#233;quence d&#8217;occurrence des &#233;v&#233;nements nominaux dans la balise &lt;EVENT&gt;. Nous proposons
l&#8217;attribut periodicity (pour ne pas reprendre freq qui sert dans la balise &lt;TIMEX3&gt;), qui
prend la valeur normalis&#233;e de l&#8217;intervalle temporel en question. Ainsi, pour la phrase (12d) nous
proposons une annotation similaire &#224; celle pour (12b) mais cette fois avec l&#8217;attribut periodicity
de valeur P1Y (period - one year).
</p>
<p>Max a &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot;
tense=&quot;PAST&quot;&gt;fait&lt;/EVENT&gt; deux &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot; pos=&quot;NOUN&quot;
cardinality=&quot;2&quot; periodicity=&quot;P1Y&quot;&gt;voyages&lt;/EVENT&gt; en Tanzanie par an.
&lt;TLINK lid=&quot;l1&quot; eventInstanceID=&quot;ei1&quot; relatedToEventInstance=&quot;ei2&quot;
relType=&quot;IDENTITY&quot;/&gt;
</p>
<p>L&#8217;introduction de l&#8217;attribut periodicity permet une annotation linguistiquement coh&#233;rente
des phrases &#224; verbe support avec quantification et fr&#233;quence d&#8217;occurrences sur le Npred.
</p>
<p>5 Faisabilit&#233; et m&#233;thodologie
</p>
<p>Afin de pouvoir effectuer une annotation automatique des ph&#233;nom&#232;nes pr&#233;sent&#233;s ici, un sys-
t&#232;me doit disposer de certaines ressources lexicales, notamment pour d&#233;terminer quelle balise
(&lt;ALINK&gt; ou &lt;TLINK&gt;) il faut utiliser pour expliciter la relation entre un Vsup et son Npred,
voir Section 4.1. Un lexique sp&#233;cifiant les Vsup possibles pour un Npred donn&#233;, ainsi que la
variante aspectuelle (inchoatif ou neutre) de la construction, semble indispensable. Des travaux
sur la reconnaissance des constructions &#224; verbe support sont d&#233;crits dans (Laporte et al., 2008),
mais &#224; notre connaissance les lexiques r&#233;sultants ne contient pas d&#8217;information sur la valeur
aspectuelle du verbe dans ces constructions.
Une possibilit&#233; pour palier ce manque de ressources lexicales est de recourrir &#224; des approx-
imations, par exemple en choisissant la relation uniquement en fonction du verbe. Ainsi, les
verbes ayant habituellement une valeur aspectuelle non neutre (commencer, lancer, terminer,
...) lorsqu&#8217;ils ont un objet direct &#233;v&#233;nementiel, imposeraient l&#8217;utilisation de la balise &lt;ALINK&gt;.
Les autres verbes imposeraient l&#8217;utilisation d&#8217;une balise &lt;TLINK&gt; pour expliciter la relation
avec leur argument &#233;v&#233;nementiel. La faiblesse de cette approximation r&#233;side dans le fait que
les verbes de cette deuxi&#232;me classe peuvent aussi avoir une valeur aspectuelle lorsqu&#8217;ils se
combinent avec certains noms &#233;v&#233;nementiels. Nous citons le cas de prendre, qui a une valeur
aspectuelle inchoative dans (14a) et une valeur neutre dans (14b).
</p>
<p>(14)a. L&#8217;&#233;conomie a pris son essor.
b. Luc a pris une revanche sur Marie.
</p>
<p>Malgr&#233; cette faiblesse, l&#8217;impl&#233;mentation de ces simples heuristiques permettrait de constituer
automatiquement un lexique de pairs Vsup&#8212;Npred corr&#233;l&#233;es avec leur classe aspectuelle en ef-
fectuant une correction manuelle pour rendre compte des cas comme 14. Nous entreprenons
actuellement une impl&#233;mentation de cette approximation dans le cadre des modules que nous
d&#233;veloppons pour l&#8217;annotation TimeML automatique. Nous orientons le lecteur vers (Bittar,
2008) pour les d&#233;tails sur ces modules. Nous nous servirons des r&#233;sultats pour &#233;valuer &#224; la fois
la fr&#233;quence du ph&#233;nom&#232;ne linguistique en question et la couverture des heuristiques propos&#233;es
pour son traitement.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;gration des constructions &#224; verbe support dans TimeML
</p>
<p>6 Conclusion
</p>
<p>Une extension des consignes d&#8217;annotation du langage TimeML s&#8217;est av&#233;r&#233;e n&#233;cessaire pour
l&#8217;annotation correcte des constructions &#224; verbe support. Premi&#232;rement, pour rendre compte des
variantes aspectuelles des Vsup et, deuxi&#232;mement, pour capturer la quantification et la fr&#233;quence
d&#8217;occurrenecs des Npred. De fait, nous avons &#233;labor&#233; des consignes linguistiquement motiv&#233;es
pour la bonne annotation des ph&#233;nom&#232;nes en question. Cependant, pour arriver &#224; une impl&#233;men-
tation exacte de ces consignes, le d&#233;veloppement de ressources lexicales demeure une n&#233;cessit&#233;.
Dans un premier temps, une impl&#233;mentation approximative est envisag&#233;e. Une premi&#232;re &#233;valu-
ation de ce syst&#232;me permettra de jauger le potentiel apport des ressources lexicales propos&#233;es.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BACH E. (1986). The Algebra of Events. Linguistics and Philosophy, 9(1), 5&#8211;16.
BITTAR A. (2008). Annotation des informations temporelles dans des textes en fran&#231;ais. In
Actes de RECITAL 2008, Avignon, France.
</p>
<p>CASELLI T. (2008). It-TimeML : TimeML Annotation Guidelines for Italian, Version 1.0.
Rapport interne, Instituto di Linguistica Computazionale, C.N.R.
</p>
<p>DANLOS L. (2009). Extension de la notion de verbe support. In Supports et pr&#233;dicats non
verbaux dans les langues du monde. Paris.
</p>
<p>GROSS G. (1982). Un cas de constructions inverses : donner et recevoir. Langages, 136,
41&#8211;52.
</p>
<p>GROSS M. (1981). Les bases empiriques de la notion de pr&#233;dicat s&#233;mantique. Langages, 63,
7&#8211;52.
</p>
<p>LAPORTE E., RANCHHOD E. &amp; YANNACOPOULOU A. (2008). Syntactic variation of support
verb constructions. Lingvisticae Investigationes, 31(2).
LEE K., PUSTEJOVSKY J., BUNT H., BOGURAEV B. &amp; IDE N. (2007). Lan-
guage resource management - Semantic annotation framework (SemAF) - Part 1 :
Time and events. International Organization for Standardization, Geneva, Switzerland.
http ://lirics.loria.fr/doc_pub/SemAFCD24617-1Rev12.pdf.
</p>
<p>PUSTEJOVSKY J., MEYERS A., PALMER M. &amp; POESIO M. (2005). Merging PropBank,
NomBank, Timebank, Penn Discourse Treebank and Coreference. In ACL 2005 Workshop on
Frontiers in Corpus Annotations II : Pie in the Sky, Ann Arbor, Michigan, USA.
</p>
<p>PUSTEJOVSKY J., NO J. C., INGRIA R., SAUR&#205; R., GAIZAUSKAS R., SETZER A. &amp; KATZ
G. (2003). TimeML : Robust Specification of Event and Temporal Expressions in Text. In
Proceedings of IWCS-5, Fifth International Workshop on Computational Semantics.
</p>
<p>SAUR&#205; R., KNIPPEN R., VERHAGEN M. &amp; PUSTEJOVSKY J. (2005). Evita : A Robust Event
Recognizer for QA Systems. In Proceedings of HLT/EMNLP 2005, p. 700&#8211;707.
</p>
<p>SAUR&#205; R., LITTMAN J., KNIPPEN B., GAIZAUSKAS R., SETZER A. &amp; PUSTEJOVSKY J.
(2006). TimeML Annotation Guidelines Version 1.2.1.</p>

</div></div>
</body></html>