<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Les adjectifs relationnels dans les lexiques informatis&#233;s : formalisation et exploitation dans un contexte multilingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>Les adjectifs relationnels dans les lexiques informatis&#233;s : 
formalisation et exploitation dans un contexte multilingue 
</p>
<p>Bruno Cartoni 
</p>
<p>Universit&#233; de Gen&#232;ve 
cartonib@gmail.com 
</p>
<p> 
</p>
<p>R&#233;sum&#233; Dans cet article, nous nous int&#233;ressons aux adjectifs dits relationnels et &#224; leur 
statut en traitement automatique des langues naturelles (TALN). Nous montrons qu&#8217;ils 
constituent une &#171; sous-classe &#187; d&#8217;adjectifs rarement explicit&#233;e et donc rarement repr&#233;sent&#233;e 
dans les lexiques sur lesquels reposent les applications du TALN, alors qu&#8217;ils jouent un r&#244;le 
important dans de nombreuses applications. Leur formation morphologique est source 
d&#8217;importantes divergences entre diff&#233;rentes langues, et c&#8217;est pourquoi ces adjectifs sont un 
v&#233;ritable d&#233;fi pour les applications informatiques multilingues. Dans une partie plus pratique, 
nous proposons une formalisation de ces adjectifs permettant de rendre compte de leurs liens 
avec leur base nominale. Nous tentons d&#8217;extraire ces informations dans les lexiques 
informatis&#233;s existants, puis nous les exploitons pour traduire les adjectifs relationnels pr&#233;fix&#233;s 
de l&#8217;italien en fran&#231;ais. 
</p>
<p>Abstract This article focuses on a particular type of adjectives, relational adjectives, and 
especially on the way they are processed in natural language processing systems. We show 
that this class of adjectives is barely recorded in an explicit manner in computer lexicons. 
There is an important discrepancy in the way those adjectives are morphologically 
constructed in different languages, and therefore, they are a real challenge for multilingual 
computing applications. On a more practical side, we propose a formalisation for the 
adjectives that shows their semantic link with their nominal base. We make an attempt to 
extract this kind of information in existing machine lexica, and we exploit their semantic links 
in the translation of prefixed relational adjectives from Italian into French.  
</p>
<p>Mots-cl&#233;s :   Adjectifs relationnels, ressources lexicales, morphologie constructionnelle 
Keywords:   Relational adjectives, lexical resources, constructional morphology 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Bruno Cartoni 
</p>
<p>1 Introduction 
Cet article s&#8217;interroge sur l&#8217;attention que le TALN a port&#233; aux adjectifs d&#8217;un genre 
particulier : les adjectifs relationnels. Nous montrons que ces adjectifs, de par la relation 
(morphologique et s&#233;mantique) qu&#8217;ils entretiennent avec leur base nominale, repr&#233;sentent une 
information importante pour de nombreuses applications du TALN, et que les lexiques 
informatis&#233;s n&#233;gligent, &#224; tort, ce type d&#8217;information.  
</p>
<p>Dans cette optique, nous avons proc&#233;d&#233; &#224; une exp&#233;rience d&#8217;extension semi-automatique de 
deux lexiques informatis&#233;s, pour pouvoir ensuite exploiter les informations relatives aux 
adjectifs relationnels dans une application pr&#233;cise : un syst&#232;me de traduction automatique 
(TA) des mots morphologiquement construits. 
</p>
<p>Dans un premier temps, nous resituons la question des adjectifs relationnels, en pr&#233;cisant les 
diff&#233;rentes caract&#233;ristiques qui les d&#233;finissent, puis nous montrons (section 2) comment les 
informations morphos&#233;mantiques qu&#8217;ils contiennent (c&#8217;est-&#224;-dire le lien qu&#8217;ils entretiennent 
avec la base nominale sur laquelle ils sont construits) constituent une information que l&#8217;on 
peut acqu&#233;rir facilement de mani&#232;re automatique. 
</p>
<p>Dans la seconde partie, nous pr&#233;sentons notre prototype de traducteur automatique des mots 
construits, pour lequel une extension des lexiques a &#233;t&#233; r&#233;alis&#233;e. Nous montrons que 
l&#8217;information &#171; adjectif relationnel &#187; est particuli&#232;rement importante dans un contexte 
multilingue, car ces adjectifs sont souvent la source de nombreuses divergences.  
</p>
<p>2 Les adjectifs relationnels 
Les adjectifs relationnels sont souvent d&#233;crits dans les &#233;tudes linguistiques comme un type 
d&#8217;adjectif &#224; part, qui poss&#232;de un certain nombre de propri&#233;t&#233;s bien connues (m&#234;me si elles ont 
toutes &#233;t&#233; nuanc&#233;es &#224; plusieurs reprises), &#224; savoir (M&#233;lis-Puchulu, 1991) : 
</p>
<p>&#8226; Ils sont morphologiquement construits sur une base nominale par suffixation 
(pr&#233;sident &#61664; pr&#233;sidentiel), parfois avec la forme suppl&#233;tive de cette base (c&#339;ur &#61664; 
cardiaque). 
</p>
<p>&#8226; Ils poss&#232;dent un certain nombre de caract&#233;ristiques syntaxiques (impossibilit&#233; d&#8217;&#234;tre 
utilis&#233;s comme attribut *elle est pr&#233;sidentielle, non-gradabilit&#233; *une &#233;lection tr&#232;s 
pr&#233;sidentielle, &#8230;). 
</p>
<p>&#8226; Quand ils sont employ&#233;s avec un nom, ils instaurent une relation entre le sens du 
nom recteur du groupe nominal et le nom base de l&#8217;adjectif. Ainsi, la s&#233;quence 
&#233;lection pr&#233;sidentielle peut &#234;tre paraphras&#233;e par &#233;lection du pr&#233;sident. 
</p>
<p>&#8226; Comme l&#8217;a r&#233;cemment montr&#233; (Fradin (2008), les adjectifs relationnels poss&#232;dent la 
m&#234;me repr&#233;sentation s&#233;mantique que leur base nominale.  
</p>
<p>A ces caract&#233;ristiques bien connues, s&#8217;ajoute un &#171; comportement &#187; tr&#232;s particulier, qu&#8217;il nous 
faut ici souligner : les adjectifs relationnels sont tr&#232;s souvent employ&#233;s comme base dans des 
r&#232;gles de pr&#233;fixation qui permettent la formation de lex&#232;mes dont le sens construit est un peu 
particulier. Dans ce type de pr&#233;fixation, &#171; la signification du lex&#232;me construit r&#233;sulte de la </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les adjectifs relationnels dans les lexiques informatis&#233;s 
</p>
<p>combinaison du lex&#232;me-base et du pr&#233;fixe, et non de la combinaison du lex&#232;me-suffix&#233; et du 
pr&#233;fixe &#187; (Fradin, 2003). Ainsi, anticonstitutionnel qualifie le fait d&#8217;&#234;tre contre la 
constitution ; l&#8217;instruction s&#233;mantique de la r&#232;gle de pr&#233;fixation porte donc sur la base 
constitution de l&#8217;adjectif relationnel (qui lui sert de base formelle). Ce ph&#233;nom&#232;ne est 
&#233;troitement li&#233; au fait que les adjectifs relationnels d&#233;signent une relation entre l&#8217;entit&#233; 
d&#233;not&#233;e par leur nom base et l&#8217;entit&#233; modifi&#233;e. Dans la s&#233;quence loi anticonstitutionnelle, 
l&#8217;adjectif relationnel permet de d&#233;signer la relation entre loi et le fait d&#8217;&#234;tre contre la 
constitution. 
De plus, c&#8217;est dans les r&#232;gles de pr&#233;fixation que l&#8217;adjectif relationnel se r&#233;v&#232;le &#234;tre le plus 
proche de sa base nominale. Ainsi, il existe des cas o&#249; la base nominale peut &#234;tre utilis&#233;e 
comme input formel de la r&#232;gle de pr&#233;fixation (un traitement anticancer). Ces cas surviennent 
g&#233;n&#233;ralement lorsque l&#8217;adjectif relationnel n&#8217;existe pas (un plan antidrogue, drogue n&#8217;ayant 
pas d&#8217;adjectif relationnel possible en fran&#231;ais), mais parfois les deux possibilit&#233;s de formation 
semblent interchangeables (un traitement anticanc&#233;reux). 
</p>
<p>3 Les adjectifs relationnels en TALN 
En traitement automatique des langues, les adjectifs relationnels ont plusieurs fois &#233;t&#233; &#233;tudi&#233;s, 
notamment dans le cadre de l&#8217;extraction terminologique, par exemple dans (Daille 1999). En 
effet, les termes complexes sont souvent compos&#233;s d&#8217;un nom recteur et d&#8217;un adjectif 
relationnel, et leur traitement permet de rep&#233;rer des liens entre diff&#233;rentes variantes d&#8217;un 
m&#234;me terme, comme entre production de c&#233;r&#233;ales et production c&#233;r&#233;ali&#232;re (l&#8217;exemple est 
&#233;galement tir&#233; de (Daille, 1999)). Tout le travail est alors ici, pour l&#8217;analyseur de l&#8217;extracteur 
de terme, de d&#233;construire l&#8217;adjectif afin de retrouver sa base nominale. Si cette t&#226;che est &#224; 
effectuer &#224; chaque extraction, cela veut dire que les lexiques sur lesquels reposent ces 
analyseurs ne poss&#232;dent pas cette information, alors que, comme nous le montrons dans la 
suite, cette information peut facilement &#234;tre acquise, m&#234;me avec un minimum de ressources. 
</p>
<p>3.1 Extension automatique d&#8217;un lexique informatis&#233; 
Pour les besoins de notre exp&#233;rience (la construction d&#8217;un prototype de traducteur 
automatique de mots construits), dont nous d&#233;crivons les tenants et aboutissants dans la 
deuxi&#232;me partie de ce travail, nous avons besoin de l&#8217;information lexicale d&#233;crite ci-dessus, &#224; 
savoir le lien entre les adjectifs relationnels et leur base nominale, et ce pour les deux langues 
de notre syst&#232;me, l&#8217;italien et le fran&#231;ais. Notre syst&#232;me de TA repose sur un lexique bilingue 
et deux lexiques monolingues utilis&#233;s par l&#8217;analyseur morphosyntaxique Mmorph (Bouillon, 
Lehmann et al. 1998). D&#8217;un point de vue quantitatif, le lexique fran&#231;ais contient 279 007 
formes fl&#233;chies, et le lexique italien 739 000 formes fl&#233;chies. Nous d&#233;crivons dans cette 
section l&#8217;extension effectu&#233;e pour le lexique de l&#8217;italien, celle du lexique fran&#231;ais ayant suivi 
les m&#234;mes principes. 
</p>
<p>Pour &#233;tendre le lexique sur lequel repose l&#8217;analyse, nous avons cherch&#233; la base nominale 
potentielle de tous les adjectifs relationnels. Ainsi, nous avons impl&#233;ment&#233; une routine bas&#233;e 
sur les suffixes typiques des adjectifs relationnels de l&#8217;italien : -ale, -are, -ario, -ano, -ico, 
-ile, -ino, -ivo, -orio, -esco, -asco, -iero, -izio, -aceo (Wanddruszka, 2004). Cette routine 
recherche, pour chaque adjectif se terminant par l&#8217;un de ces suffixes, une possible base 
nominale en op&#233;rant une sorte de &#171; fuzzy matching &#187; (en d&#233;suffixant l&#8217;adjectif puis en 
effectuant une s&#233;rie de calcul sur la cha&#238;ne de caract&#232;re restante pour retrouver une base </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Bruno Cartoni 
</p>
<p>potentielle enregistr&#233;e dans le lexique). L&#8217;extracteur, propos&#233; par (Daille, 1999), v&#233;rifiait 
ensuite la pr&#233;sence de la base nominale trouv&#233;e dans le corpus analys&#233;, ce qui emp&#234;chait le 
rep&#233;rage de &#171; monstre &#187;. Dans notre contexte d&#8217;extension du lexique, nous avons d&#251; v&#233;rifier 
toutes les paires &#171; adj_rel&#8211;nom &#187; manuellement. 
</p>
<p>Dans un deuxi&#232;me temps, nous avons &#233;valu&#233; le nombre de cas dans lesquels l'appariement 
&#171; adj_rel&#8211;nom &#187; &#233;tait correct, afin d&#8217;avoir une id&#233;e du fonctionnement d&#8217;une routine aussi 
simple. Si certains suffixes donnent d'excellents r&#233;sultats avec une pr&#233;cision sup&#233;rieure &#224; 
90 %, d'autres sont beaucoup plus ambigus et provoquent trop de bruit &#8212; c&#8217;est notamment le 
cas de -ile, -ano, -iano, -iario. Pour ces derniers, la correction manuelle est donc tr&#232;s 
importante. 
</p>
<p>Cette impl&#233;mentation fort simple nous a permis d&#8217;ajouter au lexique 8 466 liens entre des 
adjectifs relationnels et des noms dans le lexique italien et 1 822 dans le lexique fran&#231;ais. Nos 
deux lexiques sont ainsi enrichis d&#8217;une information suppl&#233;mentaire, qui sera ensuite exploit&#233;e 
dans notre syst&#232;me de TA (cf. section 4). 
</p>
<p>Malheureusement, ce type d&#8217;impl&#233;mentation bas&#233;e uniquement sur une approche d&#8217;extension 
automatique (comme d&#233;crit dans (Gdaniec et Manandise, 2000)), ne permet pas de retrouver 
des paires &#171; adj_rel&#8211;nom &#187; o&#249; l&#8217;adjectif est construit sur une forme suppl&#233;tive du nom (c&#339;ur 
&#61664; cardiaque). Pour ce type de formation, il faut alors envisager la cr&#233;ation d&#8217;une ressource 
ad hoc contenant tous les suppl&#233;tifs n&#233;cessaires, comme l&#8217;a d&#8217;ailleurs fait (Namer, 2005) dans 
son analyseur D&#233;rif. 
</p>
<p>4 Exploitation des adjectifs relationnels dans un contexte 
multilingue 
</p>
<p>Comme nous l&#8217;avons d&#233;j&#224; mentionn&#233;, l&#8217;information &#171; adjectifs relationnels &#187; peut jouer un 
r&#244;le important dans de nombreuses applications du TALN. Dans cette section, nous 
pr&#233;sentons l&#8217;application pour laquelle l&#8217;extension du lexique pr&#233;sent&#233;e ci-dessus a &#233;t&#233; 
r&#233;alis&#233;e : un syst&#232;me de traduction automatique des n&#233;ologismes construits. Ce syst&#232;me, et les 
diff&#233;rentes &#233;tudes qui en sont d&#233;coul&#233;es, ont d&#233;j&#224; &#233;t&#233; pr&#233;sent&#233;, notamment dans (Cartoni, 
2005) et (Cartoni, &#224; para&#238;tre). 
</p>
<p>4.1 Un syst&#232;me de TA des n&#233;ologismes construits 
Le syst&#232;me dans lequel s&#8217;inscrit cette &#233;tude est un syst&#232;me de traduction automatique des 
n&#233;ologismes construits, qui est encore &#224; l&#8217;&#233;tat de prototype. Il repose sur le pr&#233;suppos&#233; que les 
proc&#233;d&#233;s de construction des n&#233;ologismes peuvent &#234;tre transpos&#233;s d&#8217;une langue &#224; l&#8217;autre et 
ainsi &#234;tre &#171; traduit &#187;, palliant ainsi l&#8217;absence de ces mots dans les lexiques. Ainsi, pour tout 
mot n&#233;ologique dans une langue (p. ex. ricostruire en italien), le syst&#232;me (i) proc&#232;de d&#8217;abord 
&#224; une analyse morphologique, permettant de retrouver la r&#232;gle qui a produit le mot inconnu 
(ri+costruire), puis (ii) par l&#8217;interm&#233;diaire de r&#232;gles de transfert morphologique (ici la r&#232;gle </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les adjectifs relationnels dans les lexiques informatis&#233;s 
</p>
<p>de r&#233;it&#233;ration), produit un &#233;quivalent de traduction, soit en reconstruisant un &#233;quivalent de 
traduction (reconstruire) ou en proposant une glose (construire &#224; nouveau).1 
</p>
<p>Ce syst&#232;me repose donc sur un ensemble de R&#232;gles de Construction des Lex&#232;mes (RCL) 
bilingues, qui permettent d&#8217;analyser les n&#233;ologismes construits dans une langue et de 
transf&#233;rer les informations morphos&#233;mantiques dans l&#8217;autre langue pour g&#233;n&#233;rer une 
traduction possible. En outre, le syst&#232;me repose, comme nous l&#8217;avons mentionn&#233;, sur un 
lexique bilingue construit semi-automatiquement pour les besoins de l&#8217;exp&#233;rience, et sur deux 
lexiques monolingues de l&#8217;italien et du fran&#231;ais.  
</p>
<p>Le sch&#233;ma ci-dessous repr&#233;sente le fonctionnement global de ce syst&#232;me et les deux types de 
ressources impliqu&#233;es (les RCL et les lexiques). 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Pour ce syst&#232;me, nous avons impl&#233;ment&#233; plus d&#8217;une centaine de RCL bilingues, permettant 
d&#8217;analyser la plupart des n&#233;ologismes construits par pr&#233;fixation. Avant leur impl&#233;mentation 
dans les programmes d&#8217;analyse de transfert, les RCL bilingues ont &#233;t&#233; formalis&#233;es en suivant 
le mod&#232;le propos&#233; par (Fradin, 2003). Nous reproduisons dans la figure 2 ci-dessous la RCL 
bilingue de r&#233;it&#233;rativit&#233;. 
</p>
<p> italien  fran&#231;ais 
 input  input 
</p>
<p>(G) X  Y 
(F) /X/  /Y/ 
</p>
<p>(SX) cat :v  cat :v 
(S) X'(...)  Y'(...) 
</p>
<p> &#61490;  &#61489;  &#61490;  
 output  output 
</p>
<p>(G) riX  reY 
(F) /ri/&#8853;/X/  /R&#1241;/&#8853;/Y/ 
</p>
<p>(SX) cat :v  cat :v  
(S) r&#233;it&#233;rativit&#233; (X'(...))  r&#233;it&#233;rativit&#233; (Y'(...)) 
</p>
<p>o&#249; X' = Y', &#233;quivalent de traduction 
</p>
<p>Figure 2: RCL bilingue de r&#233;it&#233;rativit&#233; 
Dans ce formalisme, un lex&#232;me est repr&#233;sent&#233; par 4 rubriques (2 formelles : sa forme 
graphique (G) et sa forme phonologique (F), et 2 profondes : la structure syntaxique (SX) et la 
</p>
<p>                                                
1 Le syst&#232;me a &#233;t&#233; con&#231;u pour deux langues proches, le fran&#231;ais et l&#8217;italien, dans le but de pouvoir individualiser 
</p>
<p>les probl&#232;mes m&#233;thodologiques d&#8217;une telle approche. L&#8217;extension &#224; d&#8217;autres langues est &#233;galement 
envisag&#233;e. 
</p>
<p>n&#233;ologisme IT 
</p>
<p>n&#233;ologisme FR 
</p>
<p>analyse 
</p>
<p>RCL 
</p>
<p>g&#233;n&#233;ration 
</p>
<p>Lexiques 
</p>
<p>Figure 1: Le syst&#232;me de traduction automatique des n&#233;ologismes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Bruno Cartoni 
</p>
<p>repr&#233;sentation s&#233;mantique (S))2. La RCL applique sur une ou plusieurs rubriques du lex&#232;me-
base (input) une s&#233;rie d&#8217;instructions simultan&#233;es et ind&#233;pendantes pour construire un lex&#232;me 
d&#233;riv&#233; (output). La r&#232;gle ci-dessus propose donc de mettre en &#171; &#233;quivalence &#187; les RCL 
monolingues de l&#8217;italien et du fran&#231;ais (les deux colonnes) pour former une RCL bilingue. 
</p>
<p>4.2 Les r&#232;gles de formalisation bilingues des adjectifs relationnels pr&#233;fix&#233;s 
Comme nous l&#8217;avons d&#233;j&#224; mentionn&#233;, les adjectifs relationnels sont tr&#232;s souvent impliqu&#233;s 
dans des r&#232;gles de pr&#233;fixation. En outre, le proc&#233;d&#233; de formation des adjectifs relationnels 
n&#8217;est pas toujours identique dans les deux langues de notre travail. Le mod&#232;le pr&#233;sent&#233; ci-
dessus doit donc &#234;tre adapt&#233; pour repr&#233;senter ce type de pr&#233;fixation et les diff&#233;rentes 
possibilit&#233;s de s&#233;lection de la base. Mais avant de pr&#233;senter les RCL bilingues pour les 
pr&#233;fixations d&#8217;adjectifs relationnels (section 4.2.2), nous pr&#233;sentons une petite &#233;tude sur les 
divergences entre les langues dans la formation de ces adjectifs. 
</p>
<p>4.2.1 Divergences entre les langues 
</p>
<p>Dans les deux langues de notre exp&#233;rience, l&#8217;italien et le fran&#231;ais, les adjectifs relationnels 
sont fortement pr&#233;sents dans les proc&#233;d&#233;s de pr&#233;fixation. De m&#234;me, il existe, dans les deux 
langues, la possibilit&#233; d&#8217;utiliser alternativement les adjectifs relationnels ou leur 
&#171; &#233;quivalent &#187; base nominale (par exemple, en italien : trattamento antiparassiti / trattamento 
antiparassitario). 
En revanche, la possibilit&#233; de former des adjectifs relationnels n&#8217;est pas pr&#233;sente de mani&#232;re 
&#233;gale dans les deux langues. Une &#233;valuation effectu&#233;e sur le dictionnaire bilingue italien-
fran&#231;ais Garzanti (2006) nous a permis d&#8217;estimer &#224; plus de 1 000 les adjectifs relationnels de 
l&#8217;italien qui ne disposaient pas d&#8217;&#233;quivalent en fran&#231;ais. Pour tous ces adjectifs, un &#233;quivalent 
sous forme de locution pr&#233;positionnelle est &#224; chaque fois propos&#233;e, comme le montrent les 
exemples suivants :  
</p>
<p>&#8226; aziendale &#61664; de l&#8217;entreprise  
</p>
<p>&#8226; creditizio &#61664; de cr&#233;dit 
</p>
<p>&#8226; gattesco &#61664; de chat 
</p>
<p>&#8226; partitico &#61664; de parti 
</p>
<p>&#8226; congressuale &#61664; du congr&#232;s 
</p>
<p>Ainsi, d&#8217;un point de vue formel tout comme d&#8217;un point de vue traductionnel, la RCL bilingue 
doit rendre compte de cette divergence, et garantir l&#8217;acc&#232;s &#224; la base nominale et permettre la 
g&#233;n&#233;ration d&#8217;une traduction dans la langue qui n&#8217;aurait pas d&#8217;adjectif relationnel. 
</p>
<p>                                                
2 Dans cet exemple, nous d&#233;crivons uniquement les informations utilis&#233;es dans notre syst&#232;me. Il va de soi que les 
</p>
<p>diff&#233;rentes rubriques du mod&#232;le de B Fradin peuvent contenir des informations plus complexes. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les adjectifs relationnels dans les lexiques informatis&#233;s 
</p>
<p>4.2.2 Des RCL bilingues pour la pr&#233;fixation des adjectifs relationnels 
</p>
<p>Pour formaliser les RCL impliquant un adjectif relationnel, la RCL bilingue doit pouvoir 
rendre compte de la double possibilit&#233; des bases dans les deux langues (bases nominales et 
bases adjectivales, les deux partageant la m&#234;me s&#233;mantique). Ce ph&#233;nom&#232;ne est pr&#233;sent dans 
un certain nombre de RCL, &#224; savoir :  
</p>
<p>&#8226; Les r&#232;gles de pr&#233;fixation quantitative (par exemple en italien : pluri, poli, tri, uni, 
mono, multi, bi, di) 
</p>
<p>&#8226; Les r&#232;gles de pr&#233;fixation locative (par exemple en italien : neo, oltre, para, ex, extra, 
inter, intra, meta, post, pre, pro, sopra, sovra, sotto, sub, super, trans) 
</p>
<p>&#8226; Quelques r&#232;gles de pr&#233;fixation n&#233;gative (par exemple, en italien : a, anti). 
</p>
<p>La proposition de r&#232;gle pr&#233;sent&#233;e dans la figure 3 pour la pr&#233;fixation temporelle APR&#200;S, 
permet, par exemple, de rendre compte de la double possibilit&#233; de base (input). Elle contient, 
pour chaque langue, deux input - l&#8217;un adjectival, construit sur une base nominale (par 
exemple Xsfx pour l&#8217;italien), et l&#8217;autre nominal (X) qui partagent la m&#234;me repr&#233;sentation 
s&#233;mantique (X&#8217;). La repr&#233;sentation s&#233;mantique de l&#8217;output est &#233;galement identique, quelque 
soit sa repr&#233;sentation formelle (APRES (X) pour les formes postXsfxIT et postX). 
</p>
<p> italien    fran&#231;ais   
 INPUT1  INPUT2  INPUT1  INPUT2 
</p>
<p>(G) XsfxIT  X  YsfxFR  Y 
(F) /XsfxIT/  /X/  /YsfxFR/  /Y/ 
</p>
<p>(SX) cat :a  cat:n  cat :a  cat:n 
(S) X&#8217;  X&#8217;  Y&#8217;  Y&#8217; 
</p>
<p> &#61490;                 ou &#61490; &#61489; &#61490; ou &#61490; 
 OUTPUT1  OUTPUT2  OUTPUT1  OUTPUT2 
</p>
<p>(G) post XsfxIT  postX  postYsfxFR  postY 
(F) /p&#7440;st/&#8853;/XsfxIT/  /p&#7440;st/&#8853;/X/  /p&#7440;st/&#8853;/YsfxFR/   /p&#7440;st/&#8853;/Y/ 
</p>
<p>(SX) cat :a  cat :a  cat :a  cat :a 
(S) APRES (X&#8217;)  APRES (X&#8217;)  APRES (Y&#8217;)  APRES (Y&#8217;) 
</p>
<p> 
o&#249; X&#8217;=Y&#8217;, &#233;quivalents de traduction 
o&#249; sfxIT et sfxIT repr&#233;sentent l&#8217;ensemble des suffixes permettant de former des adjectifs 
relationnels sur des bases nominales. 
</p>
<p>Figure 3: RCL bilingue de position temporelle APR&#200;S 
Une telle r&#232;gle permet donc de passer d&#8217;une forme italienne de type pfxXsfxIT (comme post-
adolescienzale) &#224; une forme fran&#231;aise pfxX (post-adolescence), les deux formes &#233;tant 
construites s&#233;mantiquement sur la base nominale X. Une fois formalis&#233;es, ces r&#232;gles sont 
impl&#233;ment&#233;es dans notre prototype de syst&#232;me de TA, mais le m&#233;canisme de traduction doit 
encore &#234;tre adapt&#233; en cons&#233;quence. 
</p>
<p>4.3 M&#233;canisme de traduction  
Pour tout n&#233;ologisme pr&#233;fix&#233; impliquant un adjectif relationnel, les r&#232;gles de traduction tirent 
profit du lexique &#171; &#233;tendu &#187;, notamment quand l&#8217;adjectif relationnel n&#8217;existe pas dans l&#8217;une 
des deux langues. La figure 4 ci-dessous d&#233;crit le traitement des adjectifs relationnels pr&#233;fix&#233;s 
dans notre syst&#232;me de TA. Quand un n&#233;ologisme construit arrive dans le syst&#232;me (ici 
anticostituzionale), il est analys&#233; par la partie &#171; analyse &#187; de la r&#232;gle, et la base formelle (c.-&#224;-
d. l&#8217;adjectif) est recherch&#233;e dans le lexique bilingue (Biling_lex - &#233;tape 1). Si cette base est 
pr&#233;sente dans ce lexique, le n&#233;ologisme est directement g&#233;n&#233;r&#233; en fran&#231;ais. Dans le cas </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Bruno Cartoni 
</p>
<p>contraire, le syst&#232;me recherche la base nominale de l&#8217;adjectif dans le lexique italien &#233;tendu 
(costituzione - &#233;tape 2). Si celle-ci est retrouv&#233;e, la base nominale peut &#234;tre recherch&#233;e dans le 
lexique bilingue (&#233;tape 3). Ensuite, deux options sont possibles : soit la traduction est g&#233;n&#233;r&#233;e 
en reconstruisant un adjectif sur une base nominale (&#233;tape 4 : anticonstitution), soit l&#8217;adjectif 
relationnel fran&#231;ais est retrouv&#233; &#224; partir de la base nominale dans le lexique fran&#231;ais (&#233;tape 5 : 
constitution &#61664; constitutionnel), et un n&#233;ologisme est g&#233;n&#233;r&#233; en fran&#231;ais (&#233;tape 6 : 
anticonstitutionnel). 
</p>
<p> 
</p>
<p>Figure 4: M&#233;canisme de traduction des adjectifs relationnels pr&#233;fix&#233;s 
Dans certain cas, le lexique &#233;tendu permet de proposer une traduction sous la forme d&#8217;un 
lex&#232;me pr&#233;fix&#233; sur une base nominale quand l&#8217;adjectif relationnel est possible en fran&#231;ais, 
mais, pour d&#8217;autres raisons, est absent du dictionnaire bilingue. Ainsi, le n&#233;ologisme italien 
antileucemico est construit sur l&#8217;adjectif relationnel leucemico qui d&#233;rive du nom leucemia. 
Le dictionnaire bilingue ne contenait pas d&#8217;entr&#233;e pour leucemico, mais seulement pour le 
nom (leucemia=leuc&#233;mie) et gr&#226;ce au lexique &#233;tendu et aux nouvelles informations qu&#8217;il 
fournit, le syst&#232;me a pu au moins g&#233;n&#233;rer l&#8217;&#233;quivalent antileuc&#233;mie construit sur la base 
nominale. 
</p>
<p>5 &#201;valuation 
Pour &#233;valuer plus globalement ce syst&#232;me, nous avons extrait du corpus italien La Reppublica 
(Baroni, Bernardini, et al. 2009) un ensemble de 24 247 mots inconnus qui &#233;taient 
potentiellement des n&#233;ologismes prefix&#233;s. Le syst&#232;me de traduction &#171; avant extension des 
lexiques &#187; traduisait 17 034 n&#233;ologismes (68,7%). Parmi eux, 5 025 &#233;taient construits avec un 
pr&#233;fixe qui peut potentiellement entrer dans une pr&#233;fixation d&#8217;une base adjectif relationnel 
(cf. liste section 4.2.2). Parmi ces derniers, le lexique &#233;tendu a &#233;t&#233; capable d&#8217;identifier 1 783 
</p>
<p>Mot inconnu 
anticostituzionale IT 
</p>
<p>D&#233;comp. m&#233;canique + analyse base 
costituzionale IT &#8712; Biling_Lex 
</p>
<p>non 
</p>
<p>oui G&#233;n&#233;ration traduction 
anticonstitutionnel FR 
</p>
<p>Analyse de la base (lexique IT &#233;tendu) 
costituzionale IT = adj_rel (costituzione IT) 
</p>
<p>G&#233;n&#233;ration traduction 
anticonstitution FR 
</p>
<p>Base nominal dans le lexique bilingue 
costituzione IT &#8712; Biling_Lex 
</p>
<p>Adjectif relationnel dans lexique FR 
adj_rel (constitution FR) = constitutionnel FR 
</p>
<p>G&#233;n&#233;ration traduction 
anticonstitutionnel FR 
</p>
<p>1 
</p>
<p>2 
</p>
<p>3 
</p>
<p>5 
</p>
<p>6 
</p>
<p>4 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les adjectifs relationnels dans les lexiques informatis&#233;s 
</p>
<p>adjectifs relationnels, ce qui constitue d&#233;j&#224; en soi une am&#233;lioration significative en termes de 
qualit&#233; de l&#8217;analyse. 
</p>
<p>Par exemple, gr&#226;ce au lexique &#233;tendu, l&#8217;analyse propose d&#233;sormais une d&#233;composition 
m&#233;canique telle que :  
</p>
<p>&#8226; multidisciplinare &#61664; multi#disciplinareA/disciplinaN 
</p>
<p>&#8226; sottoministeriali &#61664; sotto#ministerialiA/ministeroN  
</p>
<p>&#8226; antidemocratico &#61664; anti#democraticoA/democraziaN 
</p>
<p>Du point de vue de la g&#233;n&#233;ration, tous les n&#233;ologismes ont &#233;t&#233; traduits. Une majorit&#233; d&#8217;entre 
eux (1 570) par un adjectif relationnel pr&#233;fix&#233; et le reste (213) par une construction sur une 
base nominale en fran&#231;ais, soit parce que l&#8217;adjectif n&#8217;&#233;tait pas dans le dictionnaire bilingue, 
soit parce qu&#8217;il n&#8217;est tout simplement pas possible en fran&#231;ais.  
</p>
<p>Parmi ce dernier groupe, il est int&#233;ressant de noter les exemples suivants, qui soulignent bien 
les divergences de construction entre les deux langues :  
</p>
<p>&#8226; precongressuale &#61664; pr&#233;congr&#232;s 
</p>
<p>&#8226; post-transfuzionale &#61664; post-transfusion 
</p>
<p>&#8226; predibatimentale&#61664; pr&#233;d&#233;bat 
</p>
<p>Ainsi, l&#8217;extension de nos lexiques avec l&#8217;information sur les adjectifs relationnels pr&#233;sente 
deux avantages. Premi&#232;rement, les adjectifs relationnels sont mieux analys&#233;s, et 
deuxi&#232;mement, quand la base n&#8217;est pas dans le lexique bilingue, cette analyse plus 
&#171; profonde &#187; permet de produire une traduction tout &#224; fait satisfaisante. 
</p>
<p>6 Discussion et perspectives 
L&#8217;application pr&#233;sent&#233;e ici n&#8217;est sans doute pas la plus prototypique des utilisations du TALN, 
mais cette exp&#233;rience a le m&#233;rite de montrer que les adjectifs relationnels sont &#224; l&#8217;origine de 
nombreuses divergences entre les langues, m&#234;me proches historiquement. De plus, nous 
avons vu qu&#8217;un traitement formel ces proc&#233;d&#233;s de construction permet d&#8217;am&#233;liorer non 
seulement la qualit&#233; des lexiques, mais leur robustesse dans un contexte multilingue. A ce 
titre, l&#8217;information acquise s&#8217;av&#232;re essentielle pour traiter un nombre important de 
n&#233;ologismes construits en TA. 
</p>
<p>Par ailleurs, l&#8217;exploitation de  cette information pour la traduction des adjectifs relationnels 
pr&#233;fix&#233;s a permis de confirmer l&#8217;ampleur de la divergence, et a apport&#233; une certaine validation 
&#224; la proposition de B. Fradin de d&#233;finir les adjectifs relationnels comme une simple forme 
suppl&#233;tive de leur noyau nominal. Cette exp&#233;rience a &#233;galement montr&#233; que le traitement des 
adjectifs relationnels par une formalisation du lien qu&#8217;ils entretiennent avec leur base 
nominale est une solution tr&#232;s int&#233;ressante, qui m&#233;riterait d&#8217;&#234;tre impl&#233;ment&#233;e de mani&#232;re plus 
fine et plus syst&#233;matique dans tous les lexiques informatis&#233;s. Ce lien fournit des informations 
morphos&#233;mantiques r&#233;guli&#232;res non n&#233;gligeables pour un traitement &#171; intelligent &#187; des langues 
naturelles. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Bruno Cartoni 
</p>
<p>Mes remerciements vont &#224; ma coll&#232;gue Selja Sepp&#228;ll&#228; pour sa relecture attentive et ses 
conseils, ainsi qu&#8217;aux relecteurs anonymes pour leurs pr&#233;cieux commentaires. Evidemment, 
les erreurs qui devraient rester dans la pr&#233;sente version sont miennes. 
</p>
<p>R&#233;f&#233;rences 
(2006) Garzanti francese : francese-italiano, italiano-francese. I grandi dizionari Garzanti. 
Milano, Garzanti Linguistica. 
</p>
<p>BARONI, M., S. BERNARDINI, F. COMASTRI, L. PICCIONI, A. VOLPI, G. ASTON et 
M. MAZZOLENI (2004) Introducing the &#171; La Repubblica &#187; corpus: A large, annotated, 
TEI(XML)-compliant corpus of newspaper Italian. Actes de LREC 2004, Lisbon : 1771-1774. 
</p>
<p>BOUILLON P., S. LEHMANN, S. MANZI et D. PETITPIERRE (1998) D&#233;veloppement de lexiques &#224; 
grande &#233;chelle. Actes de Colloque des journ&#233;es LTT de TUNIS, Tunis : 71-80. 
</p>
<p>CARTONI, B. (2005) Traduction de r&#232;gles de construction des mots pour r&#233;soudre les 
probl&#232;mes d'incompl&#233;tude lexicale en traduction automatique &#201;tude de cas. Actes de 
RECITAL 2005, Dourdan, Atala : 565-574. 
</p>
<p>CARTONI, B. (&#224; para&#238;tre) Lexical Morphology in Machine Translation: a Feasibility Study. 
Actes de EACL 2009, Ath&#232;nes 
</p>
<p>DAILLE, B. (1999) Identification des adjectifs relationnels en corpus. Actes de TALN 1999, 
Carg&#232;se :105-114. 
</p>
<p>FRADIN, B. (2003) Nouvelles approches en morphologie. Paris, Puf. 
</p>
<p>FRADIN, B. (2008) On the semantics of Denominal Adjectives. Actes de 6th Mediterranean 
Morphology Meeting, Ithaca 
</p>
<p>GDANIEC, C. et E. MANANDISE (2000) Using word formation rules to extend MT lexicons. 
Actes de 5th conference of the Association for Machine Translation in the Americas, AMTA 
2000, Tiburon, CA, USA, Springer Verlag : 64-73. 
</p>
<p>MELIS-PUCHULU A. (1991) Les adjectifs d&#233;nominaux: des adjectifs de &#171; relation &#187;. 
Lexique 10 : 33-60. 
</p>
<p>NAMER F. (2005) Morphos&#233;mantique pour l'appariement de termes dans le vocabulaire 
m&#233;dical: approche multilingue. Actes de TALN 2005 Dourdan : 63-72. 
</p>
<p>WANDRUSZKA U. (2004) Derivazione aggettivale. La Formazione delle Parole in Italiano. 
M. Grossman et F. Rainer(&#233;ds). T&#252;bingen, Niemeyer. 
</p>
<p> 
</p>
<p> </p>

</div></div>
</body></html>