<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Exploitation d&#8217;un corpus bilingue pour la cr&#233;ation d&#8217;un syst&#232;me de traduction probabiliste Vietnamien - Fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>Exploitation d&#8217;un corpus bilingue pour la cr&#233;ation d&#8217;un syst&#232;me 
de traduction probabiliste Vietnamien - Fran&#231;ais 
</p>
<p>Thi-Ngoc-Diep Do (1,2), Viet-Bac Le (1), Brigitte Bigi(1),  
Laurent Besacier (1), Eric Castelli (2) 
</p>
<p>(1)Laboratoire LIG, GETALP, Grenoble, France  
(2) Centre MICA, CNRS/UMI-2954, Hanoi, Vietnam 
</p>
<p>thi-ngoc-diep.do@imag.fr 
</p>
<p>R&#233;sum&#233; Cet article pr&#233;sente nos premiers travaux en vue de la construction d&#8217;un syst&#232;me de 
traduction probabiliste pour le couple de langue vietnamien-fran&#231;ais. La langue vietnamienne 
&#233;tant consid&#233;r&#233;e comme une langue peu dot&#233;e, une des difficult&#233;s r&#233;side dans la constitution 
des corpus parall&#232;les, indispensable &#224; l&#8217;apprentissage des mod&#232;les. Nous nous concentrons sur 
la constitution d&#8217;un grand corpus parall&#232;le vietnamien-fran&#231;ais. La m&#233;thode d&#8217;identification 
automatique des paires de documents parall&#232;les fond&#233;e sur la date de publication, les mots 
sp&#233;ciaux et les scores d&#8217;alignements des phrases est appliqu&#233;e. Cet article pr&#233;sente &#233;galement 
la construction d&#8217;un premier syst&#232;me de traduction automatique probabiliste vietnamien-
fran&#231;ais et fran&#231;ais-vietnamien &#224; partir de ce corpus et discute l&#8217;opportunit&#233; d&#8217;utiliser des 
unit&#233;s lexicales ou sous-lexicales pour le vietnamien (syllabes, mots, ou leurs combinaisons). 
Les performances du syst&#232;me sont encourageantes et se comparent avantageusement &#224; celles 
du syst&#232;me de Google. 
</p>
<p>Abstract This paper presents our first attempt at constructing a Vietnamese-French 
statistical machine translation system. Since Vietnamese is considered as an under-resourced 
language, one of the difficulties is building a large Vietnamese-French parallel corpus, which 
is indispensable to train the models. We concentrate on building a large Vietnamese-French 
parallel corpus. The document alignment method based on publication date, special words and 
sentence alignment result is applied. The paper also presents an application of the obtained 
parallel corpus to the construction of a Vietnamese-French statistical machine translation 
system, where the use of different units for Vietnamese (syllables, words, or their 
combinations) is discussed. The performance of the system is encouraging and it compares 
favourably to that of Google Translate.
</p>
<p>Mots-cl&#233;s : traduction probabiliste, corpus bilingue, alignement de documents, table de 
traduction
Keywords: statistical machine translation, bilingual corpus, document alignment, phrase 
table </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>T.-N.-D. Do, V.-B. Le, B. Bigi, L. Besacier, E. Castelli 
</p>
<p>1 Introduction 
Les syst&#232;mes de traduction automatique (TA) obtiennent aujourd&#8217;hui de bons r&#233;sultats sur 
certains couples de langue comme anglais-fran&#231;ais, anglais-allemand, anglais-japonais, etc. 
Toutefois, pour les langues peu dot&#233;es, on trouve encore peu de syst&#232;mes performants 
disponibles. Par exemple, bien que la langue vietnamienne soit parl&#233;e par environ 85 millions 
de personnes dans le monde1, il n&#8217;existe pas beaucoup de recherches sur la TA de la langue 
vietnamienne.  
Le premier syst&#232;me de TA de la langue vietnamienne est le syst&#232;me de &#171; Logos 
Corporation &#187; des ann&#233;es 1970. Ce syst&#232;me a &#233;t&#233; d&#233;velopp&#233; pour traduire des manuels 
d&#8217;utilisation en a&#233;ronautique de l&#8217;anglais vers le vietnamien (Hutchins, 2001). Au Vietnam, 
jusqu&#8217;&#224; pr&#233;sent, on compte peu de groupes de recherche travaillant sur la TA vietnamien - 
anglais (Ho, 2005) et les r&#233;sultats obtenus par les syst&#232;mes sont modestes. La recherche sur la 
TA vietnamien-fran&#231;ais est encore plus rare. (Doan, 2001) a propos&#233; un module de traduction 
pour le vietnamien dans ITS3, un syst&#232;me de TA multilingue bas&#233; sur l&#8217;approche par analyse-
transfert-g&#233;n&#233;ration. (Nguyen, 2006) a &#233;tudi&#233; la langue vietnamienne et l&#8217;alignement des 
textes vietnamien-fran&#231;ais. Mais, aucun syst&#232;me de TA n&#8217;a &#233;t&#233; propos&#233; &#224; ce jour.  
Il existe de nombreuses approches de TA : des approches expertes fond&#233;es sur des r&#232;gles 
linguistiques, des approches empiriques fond&#233;es sur l&#8217;apprentissage automatique &#224; partir de 
corpus bilingues, ainsi que des approches hybrides. Nous nous concentrons dans cet article sur 
la construction d&#8217;un syst&#232;me de traduction probabiliste pour le couple de langue vietnamien-
fran&#231;ais. Une telle approche n&#233;cessite un corpus parall&#232;le bilingue pour les langues source et 
cible. Ce corpus sert &#224; construire les mod&#232;les statistiques (mod&#232;le de traduction et mod&#232;le de 
langage). Ensuite, ces deux mod&#232;les et un module de recherche sont utilis&#233;s pour d&#233;coder la 
meilleure hypoth&#232;se de traduction &#224; partir d&#8217;un texte inconnu (Brown et al., 1993 ; Koehn et 
al., 2003).  
La t&#226;che de construction d&#8217;un grand corpus bilingue parall&#232;le est tr&#232;s importante pour la TA 
probabiliste. Ce corpus est d&#233;crit comme un ensemble de paires de phrases bilingues. 
Aujourd&#8217;hui, un tel corpus parall&#232;le vietnamien-fran&#231;ais n&#8217;est pas disponible. (Nguyen, 2006) 
a collect&#233; un corpus parall&#232;le vietnamien-fran&#231;ais de documents de droit et d&#8217;&#233;conomie. 
Cependant, l&#8217;objectif de notre travail &#233;tant de construire un syst&#232;me de TA probabiliste dans 
le domaine des nouvelles journalistiques (news), nous nous concentrons &#224; exploiter un corpus 
bilingue d&#8217;actualit&#233;s vietnamien-fran&#231;ais collect&#233; &#224; partir du Web.  
L&#8217;organisation de cet article est la suivante : la section 2 pr&#233;sente la m&#233;thodologie g&#233;n&#233;rale 
d&#8217;exploitation d&#8217;un corpus bilingue de texte pour obtenir un corpus parall&#232;le. Nous pr&#233;sentons 
une vue d&#8217;ensemble des m&#233;thodes d&#8217;alignement de document, d&#8217;alignement de phrases et 
discutons de la m&#233;thode d&#8217;identification automatique des paires de documents parall&#232;les bas&#233;e 
sur la date de publication, les mots sp&#233;ciaux et les scores d&#8217;alignements des phrases. La 
section 3 d&#233;crit nos exp&#233;riences sur l&#8217;exploitation automatique d&#8217;un site Web multilingue 
d&#8217;actualit&#233;s vietnamien-fran&#231;ais. La section 4 pr&#233;sente la construction de notre syst&#232;me de 
traduction vietnamien-fran&#231;ais &#224; partir du corpus parall&#232;le obtenu. Nous discutons &#233;galement 
l&#8217;utilisation de diff&#233;rentes unit&#233;s lexicales c&#244;t&#233; vietnamien (mots, syllabes, ou combinaison de 
deux unit&#233;s). Finalement, la section 5 donne quelques conclusions et perspectives. 
</p>
<p>                                                
</p>
<p>1
 Source : Bureau national de statistique du Vietnam - http://www.gso.gov.vn </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation d&#8217;un corpus bilingue pour la cr&#233;ation d&#8217;un syst&#232;me de traduction probabiliste 
Vietnamien - Fran&#231;ais 
2 Exploitation d&#8217;un corpus bilingue de texte 
(Munteanu et Marcu, 2006) pr&#233;sentent une m&#233;thode pour l&#8217;extraction des fragments parall&#232;les 
de phrases &#224; partir de corpus comparables. Cependant, leur m&#233;thode n&#233;cessite un corpus 
bilingue parall&#232;le initial pour construire le syst&#232;me, qui n&#8217;est pas disponible pour le couple de 
langue fran&#231;ais-vietnamien, en particulier dans le domaine des news.  
G&#233;n&#233;ralement, le processus d&#8217;exploitation d&#8217;un corpus de texte bilingue pour la traduction 
automatique se d&#233;compose en cinq &#233;tapes (Koehn, 2005) : la collection de donn&#233;es brutes, 
l&#8217;alignement des documents, la segmentation en phrases, la normalisation des &#233;critures, 
l&#8217;alignement de phrases. Cette section pr&#233;sente les deux &#233;tapes principales : l&#8217;alignement de 
documents et l&#8217;alignement de phrases. Nous proposons et discutons &#233;galement dans cette 
section une m&#233;thode qui combine l&#8217;alignement de phrases dans l&#8217;alignement de documents. 
</p>
<p>2.1 Alignement de documents 
Soient S1, l&#8217;ensemble des documents dans la langue L1, et S2 l&#8217;ensemble des documents dans 
la langue L2. L&#8217;extraction des paires de documents parall&#232;les (PDPs) ou l&#8217;alignement de 
documents &#224; partir de deux ensembles S1, S2 consiste &#224; trouver la traduction D2, dans 
l&#8217;ensemble S2, d&#8217;un document D1, dans l&#8217;ensemble S1. Apr&#232;s cette phase d&#8217;alignement, on 
obtient la paire de documents parall&#232;le (PDP) D1-D2.  
Pour collecter les donn&#233;es de texte bilingue, le Web est une source possible (Kilgarriff et 
Grefenstette, 2003). Pour ce type de donn&#233;es, certaines m&#233;thodes d&#8217;alignement de documents 
ont &#233;t&#233; propos&#233;es. Les documents peuvent &#234;tre align&#233;s simplement en utilisant les liens, 
l&#8217;information dans les URLs (Ma et Liberman, 1999) ou la structure de la page (Resnik et 
Smith, 2003). Toutefois, ces informations ne sont pas toujours disponibles ou fid&#232;les. 
(Rosi&#324;ska, 2007) a cit&#233; que ces m&#233;thodes ne sont pas vraiment efficaces dans la cas o&#249; le 
couple de langue n&#8217;est pas bien repr&#233;sent&#233; sur Internet ou si les URLs changent. On peut 
&#233;galement utiliser les titres des documents (Yang et Li, 2002), mais ils sont parfois totalement 
diff&#233;rents. Une autre source d&#8217;information utile est la pr&#233;sence de mots ou symboles invariants 
d&#8217;une langue &#224; l&#8217;autre, comme par exemple les entit&#233;s nomm&#233;es, les dates et les nombres, qui 
sont souvent pr&#233;sents dans des donn&#233;es de type &#171; news &#187;. Ces mots invariants seront 
d&#233;nomm&#233;s mots sp&#233;ciaux dans cet article. (Patry et Langlais, 2005) ont utilis&#233; des nombres, 
des marques de ponctuation, et des noms d&#8217;entit&#233;s nomm&#233;es pour mesurer le degr&#233; de 
parall&#233;lisme entre deux documents.  
</p>
<p>2.2 Alignement de phrases 
A partir d&#8217;une paire D1-D2, le processus d&#8217;alignement de paires de phrases parall&#232;les (PPPs) 
entre deux documents D1 et D2 est appliqu&#233;. Pour chaque paire D1-D2, nous avons un 
ensemble SenAlignmentD1-D2 qui contient toutes les PPPs. 
SenAlignmentD1-D2 = {&#171; sen1-sen2 &#187; | sen1 est z&#233;ro, une ou plusieurs phrase(s) dans le document D1, 
sen2 est z&#233;ro, une ou plusieurs phrase(s) dans le document D2, &#171; sen1-sen2 &#187; est consid&#233;r&#233; comme 
une PPP}. 
Nous appelons sen1-sen2 un alignement du type m : n quand sen1 contient m phrases 
cons&#233;cutives et sen2 contient n phrases cons&#233;cutives. Plusieurs approches pour l&#8217;alignement 
automatique au niveau de la phrase ont &#233;t&#233; propos&#233;es. Elles utilisent la longueur de la phrase 
(Brown et al., 1991) ou des informations lexicales (Kay et Roscheisen, 1993). Une approche 
statistique est pr&#233;sent&#233;e dans (Gale et Church, 1993), dont l&#8217;id&#233;e principale est que les phrases 
plus longues (resp. courtes) dans une langue ont tendance &#224; &#234;tre traduites en phrases longues </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>T.-N.-D. Do, V.-B. Le, B. Bigi, L. Besacier, E. Castelli 
(resp. courtes) dans l&#8217;autre langue. Certains outils tels que Hunalign2 et Vanille3 sont bas&#233;s sur 
ces approches. Toutefois, ils sont plus efficaces lorsque les documents D1 et D2 contiennent 
peu de suppressions ou d&#8217;insertions, et contiennent principalement des PPPs du type 1 : 1. 
(Ma, 2006) a propos&#233; un logiciel appel&#233; Champollion4 pour r&#233;soudre cette limitation. 
Champollion permet l&#8217;alignement de type m : n (m, n = 0, 1, 2, 3, 4). Champollion peut 
utiliser &#233;galement des informations lexicales (lex&#232;mes, mots vides, dictionnaire bilingue, etc.) 
pour aligner les phrases. Il peut aussi &#234;tre adapt&#233; facilement &#224; de nouveaux couples de 
langues. A l&#8217;heure actuelle, les couples de langues disponibles dans Champollion sont anglais-
arabe et anglais-chinois (Ma, 2006). 
2.3 M&#233;thode de combinaison 
La figure 1 d&#233;crit notre m&#233;thode d&#8217;alignement de documents en combinant avec l&#8217;alignement 
de phrases. Pour chaque document D1 dans l&#8217;ensemble S1, on trouve le document align&#233; D2
dans l&#8217;ensemble S2. Nous proposons d&#8217;utiliser la date de publication, les mots sp&#233;ciaux et les 
scores d&#8217;alignements des phrases pour d&#233;couvrir des PDPs. D&#8217;abord, la date de publication est 
utilis&#233;e pour limiter le nombre de documents possibles D2. Ensuite, nous utilisons un filtrage 
bas&#233; sur des mots sp&#233;ciaux contenus dans le document pour d&#233;terminer les candidats D2. 
Enfin, les informations de longueur et de lexique du document, qui sont extraites &#224; partir des 
scores d&#8217;alignements des phrases, sont utilis&#233;es pour extraire des documents candidats D2. Le 
d&#233;tail de chaque &#233;tape est donn&#233; dans les sous-sections suivantes. 
</p>
<p>Figure 1 : M&#233;thode d&#8217;alignement de documents 
</p>
<p>2.3.1 Premier filtrage : la date de publication 
Nous supposons que le document est traduit et publi&#233; au plus d jours apr&#232;s la date de 
publication du document original. Dans la mesure o&#249; nous ignorons si D1 ou D2 est le 
document original, nous supposons que le document D2 est publi&#233; d jours avant ou apr&#232;s le 
document D1. Apr&#232;s ce filtrage, on obtient un ensemble S2&#8217; contenant un ensemble de 
documents possibles de D2.  
2.3.2 Deuxi&#232;me filtrage : les mots sp&#233;ciaux 
Nous d&#233;finissons les mots sp&#233;ciaux comme &#233;tant des nombres ou des entit&#233;s nomm&#233;es. Non 
seulement les nombres, mais aussi les symboles joints (&#8216;$&#8217;, &#8216;%&#8217;, &#8216;&#8240;&#8217;, &#8216;.&#8217;, &#8216;,&#8217; ...) sont extraits &#224; 
partir des documents, par exemple: &#171; 12.000 $ &#187;, &#171; 13,45 &#187;, &#171; 50% &#187;... Les entit&#233;s nomm&#233;es 
sont pour l&#8217;instant pr&#233;cis&#233;es par une cha&#238;ne de mots dans laquelle tout mot commence par une 
lettre majuscule, par exemple, &#171; Paris &#187;, &#171; Nations Unies &#187; en fran&#231;ais. Nous envisageons de 
remplacer cette approche rudimentaire par une v&#233;ritable d&#233;tection d&#8217;entit&#233;s nomm&#233;es dans le 
futur. Bien que les entit&#233;s nomm&#233;es dans la langue L1 sont g&#233;n&#233;ralement traduites dans les 
entit&#233;s correspondantes dans la langue L2, dans certains cas, les entit&#233;s nomm&#233;es dans la 
langue L1 (tels que les noms de personnes ou les noms de organisations) ne changent pas dans 
</p>
<p>                                                
</p>
<p>2
 http://mokk.bme.hu/resources/hunalign 
</p>
<p>3
 http://nl.ijs.si/telri/Vanilla 
</p>
<p>4
 http://champollion.sourceforge.net 
</p>
<p>S1 S2
</p>
<p>S2&#8217; S2&#8217;&#8217;
</p>
<p>S2&#8217;&#8217;D2         
 }ent{SenAlignm D2-D1
</p>
<p>&#8712;
</p>
<p>D1 D2
Filtrer par date 
de publication
</p>
<p>sen2}-{sen1
D2}-{D1  
</p>
<p>Filtrer 
SenAlignment
</p>
<p>Filtrer avec les 
mots sp&#233;ciaux 
</p>
<p>Aligner les 
phrases </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation d&#8217;un corpus bilingue pour la cr&#233;ation d&#8217;un syst&#232;me de traduction probabiliste 
Vietnamien - Fran&#231;ais 
la langue L2. En particulier, les noms en vietnamien sont souvent traduits dans l&#8217;autre langue 
en supprimant juste les diacritiques. Par exemple, le nom en vietnamien &#171; N&#244;ng &#240;&#7913;c M&#7841;nh &#187; 
est traduit en fran&#231;ais &#171; Nong Duc Manh &#187;, le nom &#171; &#240;i&#7879;n Bi&#234;n &#187; est traduit &#171; Dien Bien &#187;). &#192; 
partir du document D1, tous les mots sp&#233;ciaux sont extraits et on obtient une liste de mots 
sp&#233;ciaux w1, w2,...,wn. Pour chaque mot wi, on recherche dans l&#8217;ensemble S2&#8217; les documents 
D2 qui contiennent ce mot. Pour chaque mot, on obtient encore une liste de documents D2. Le 
document D2 qui appara&#238;t le plus dans toutes les listes est choisi. C&#8217;est le document contenant 
le plus grand nombre de mots sp&#233;ciaux. Nous pouvons trouver z&#233;ro, un ou plusieurs 
documents qui satisfont cette condition. Nous appelons cet ensemble de documents S2&#8217;&#8217; (voir 
la figure 2).  
Notre utilisation des mots sp&#233;ciaux est diff&#233;rente de celle pr&#233;sent&#233;s dans (Patry et Langlais, 
2005). Par exemple, nous n&#8217;utilisons pas de ponctuation ; nous utilisons par ailleurs les 
symboles joints avec les nombres. Enfin, dans (Patry et Langlais, 2005), l&#8217;ordre des mots 
sp&#233;ciaux dans les documents est utilis&#233; comme crit&#232;re important. Cependant, cet ordre n&#8217;est 
pas toujours respect&#233; dans une PDP, particuli&#232;rement dans le domaine des nouvelles 
journalistiques. Donc, notre m&#233;thode ne pris pas en compte l&#8217;ordre des mots sp&#233;ciaux dans les 
documents, et si un mot appara&#238;t plusieurs fois dans un document, ceci n&#8217;affecte pas le 
r&#233;sultat. 
</p>
<p>Figure 2 : Utiliser les mots sp&#233;ciaux pour filtrer les documents D2 
</p>
<p>2.3.3 Troisi&#232;me filtrage : alignement en phrases 
Pour chaque document D1, nous d&#233;couvrons un ensemble S2&#8217;&#8217;, qui contient z&#233;ro, un ou 
plusieurs documents D2. Si certains couples de documents sont mal appari&#233;s (i.e. s&#8217;ils ne 
correspondent pas au m&#234;me contenu), lorsque nous alignons ces documents en phrases, nous 
obtenons des PPPs de faible qualit&#233;. Les r&#233;sultats de l&#8217;alignement en phrases nous permettent 
donc de filtrer les documents de D2. Apr&#232;s avoir align&#233; les documents en phrases, nous avons 
donc un ensemble de PPPs, SenAlignmentD1-D2, pour chaque PDP D1-D2. Nous ajoutons alors 
deux seuils &#945; et &#946; pour filtrer les documents D2.  
Dans le premier seuil, le nombre de PPPs dans l&#8217;ensemble SenAlignmentD1-D2 est nomm&#233; 
card(SenAlignmentD1-D2). Le nombre de phrases qui ne peuvent pas trouver leur partenaire 
(quand sen1 ou sen2 est &#171; null &#187;) est not&#233; nbr_omitted (SenAlignmentD1-D2). Lorsque le rapport 
[nbr_omitted (SenAlignmentD1-D2) / card(SenAlignmentD1-D2)] est sup&#233;rieur &#224; un seuil &#945; , le 
candidat PDP D1-D2 est &#233;limin&#233;.  
Pour chaque PPP, nous ajoutons deux scores xL1 et xL2 pour les phrases sen1 et sen2 avec xLi = 
nombre_de_mots_traduits_dans_seni / nombre_de_mots_dans_seni. Les mots traduits sont les 
mots invariants ou les mots qui ont des &#233;quivalents dans l&#8217;autre phrase (nous utilisons un 
dictionnaire bilingue pour d&#233;terminer ces mots). Lorsque tous les PPPs dans SenAlignmentD1-
D2 ont les deux scores xL1 et xL2 qui sont plus petits que &#946;, le PDP D1-D2 est &#233;limin&#233;. Ce seuil 
&#233;limine les PDPs de mauvaise qualit&#233; qui g&#233;n&#232;rent des PPPs de faible qualit&#233;. Apr&#232;s avoir 
utilis&#233; ces trois filtrages, nous obtenons un corpus de PDPs, et aussi un corpus de PPPs 
correspondant. 
</p>
<p>D1
</p>
<p>w1&#8230;wn  Extraire les 
mots sp&#233;ciaux
</p>
<p>doc1: 1 fois
doc3: 3 fois
doc4: 1 fois
doc5: 3 fois
</p>
<p>compter
S2&#8217;&#8217; 
</p>
<p>{doc3, 
doc5}
</p>
<p>max
trouver w1 dans S2&#8217; &#1; doc1, doc3, doc5
trouver w2 dans S2&#8217; &#1; doc3, doc4, doc5
trouver w3 dans S2&#8217; &#1; doc3, doc5 
 &#8230;                           &#1; &#8230;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>T.-N.-D. Do, V.-B. Le, B. Bigi, L. Besacier, E. Castelli 
3 Exp&#233;riences 
3.1 Quelques caract&#233;ristiques de la langue vietnamienne
L&#8217;unit&#233; de base de la langue vietnamienne est la syllabe. A l&#8217;&#233;crit, les syllabes sont s&#233;par&#233;es 
par un espace. Un mot correspond &#224; une ou plusieurs syllabes (Nguyen, 2006). Par exemple, la 
phrase vietnamienne en syllable &#171; Th&#224;nh ph&#7889; hy v&#7885;ng s&#7869; &#241;&#243;n nh&#7853;n kho&#7843;ng 3 tri&#7879;u kh&#225;ch du 
l&#7883;ch n&#432;&#7899;c ngo&#224;i trong n&#259;m nay &#187; peut &#234;tre segment&#233;e en mots comme suit : &#171; Th&#224;nh_ph&#7889;| 
hy_v&#7885;ng| s&#7869;| &#241;&#243;n_nh&#7853;n| kho&#7843;ng| 3| tri&#7879;u| kh&#225;ch_du_l&#7883;ch| n&#432;&#7899;c_ngo&#224;i| trong| n&#259;m| nay &#187;. En 
ce qui concerne la morphologie du vietnamien, les verbes, noms et adjectifs peuvent &#234;tre 
modifi&#233;s par d&#8217;autres unit&#233;s (syllabe ou mots) qu&#8217;on leur juxtapose comme &#171; nh&#7919;ng &#187;, &#171; c&#225;c &#187; 
pour exprimer le pluriel, &#171; &#241;&#227; &#187; et &#171; s&#7869; &#187; pour exprimer le pass&#233; et l&#8217;avenir. Les fonctions 
syntaxiques sont &#233;galement d&#233;termin&#233;es par l&#8217;ordre des mots dans la phrase (Nguyen, 2006).  
3.2 Collection et pr&#233;traitement des donn&#233;es 
En vue de la construction d&#8217;un corpus de texte parall&#232;le vietnamien-fran&#231;ais, nous avons 
appliqu&#233; notre m&#233;thodologie d&#8217;alignement pour exploiter un corpus de textes &#224; partir d&#8217;un site 
Web multilingue d&#8217;actualit&#233;s, le Vietnam News Agency5 (VNA). Ce site contient des articles 
de presse &#233;crits en quatre langues (vietnamien, anglais, fran&#231;ais et espagnol). Cependant, tous 
les articles vietnamiens n&#8217;ont pas &#233;t&#233; traduits dans les trois autres langues. Il n&#8217;y a pas de lien 
ou d&#8217;information dans les URLs pour d&#233;couvrir la relation entre les articles traduits. En plus, 
les articles traduits sont partiellement parall&#232;les, ils contiennent le texte non identifi&#233;. La 
r&#233;partition de la quantit&#233; de donn&#233;es dans les quatre langues est diff&#233;rente (40% en 
vietnamien, 27% en anglais, 20% en fran&#231;ais et 13% en espagnol). Chaque document est 
obtenu via un lien URL depuis le site Web VNA. &#192; ce jour, nous avons obtenu environ 
121000 documents dans les quatre langues, qui ont &#233;t&#233; r&#233;cup&#233;r&#233;s entre le 12 avril 2006 et le 
14 ao&#251;t 2008 ; chaque document contient en moyenne 10 phrases, avec environ 30-35 mots 
par phrase. 
Nous avons s&#233;par&#233; les donn&#233;es en deux ensembles. Le premier ensemble contient 1000 
documents, nomm&#233; E1k, dont l&#8217;appariement correct fran&#231;ais-vietnamien est connu, suite &#224; une 
annotation manuelle. Il a &#233;t&#233; utilis&#233; pour r&#233;gler les param&#232;tres du syst&#232;me de filtrage d&#233;crit 
pr&#233;c&#233;demment. Le reste des donn&#233;es est appel&#233; Eall, dans ce cas les param&#232;tres du syst&#232;me de 
filtrage, r&#233;gl&#233;s sur E1k ont &#233;t&#233; appliqu&#233;s pour construire le corpus parall&#232;le entier. Nous avons 
appliqu&#233; le processus de traitement ci-dessous pour chaque ensemble E1k et Eall : (1) Extraire 
le contenu des documents, (2) Classer automatiquement les documents par langue, en utilisant 
l&#8217;outil TextCat6, un outil d&#8217;identification des langues fond&#233; sur les n-grammes de mots, (3) 
Traiter et nettoyer les documents vietnamiens et fran&#231;ais en utilisant l&#8217;outil CLIPS-Text-Tk 
(LE et al., 2003) : convertir les documents html en documents textes, convertir le code des 
caract&#232;res, segmenter en phrases, segmenter en mots. Les corpus obtenus sont nomm&#233;s S1, 
pour le fran&#231;ais et S2, pour le vietnamien. 
</p>
<p>3.3 Estimation des param&#232;tres de filtrage sur E1k
Notre m&#233;thode d&#8217;alignement a &#233;t&#233; appliqu&#233;e sur les corpus S1 et S2 qui sont extraits &#224; partir 
de l&#8217;ensemble E1k. Selon de notre corpus, nous avons suppos&#233; que d = 2. Le deuxi&#232;me filtrage 
a &#233;t&#233; r&#233;alis&#233; sur l&#8217;ensemble S1 et l&#8217;ensemble S2* qui a &#233;t&#233; cr&#233;&#233; en supprimant les diacritiques 
depuis l&#8217;ensemble S2 (dans le cas du vietnamien). Apr&#232;s l&#8217;utilisation des deux filtrages, on 
obtient les donn&#233;es indiqu&#233;es dans le tableau 1. 
</p>
<p>                                                
</p>
<p>5
 http://www.vnagency.com.vn/ 
</p>
<p>6
 http://www.let.rug.nl/~vannoord/TextCat/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation d&#8217;un corpus bilingue pour la cr&#233;ation d&#8217;un syst&#232;me de traduction probabiliste 
Vietnamien - Fran&#231;ais 
Le processus d&#8217;alignement en phrases a &#233;t&#233; r&#233;alis&#233; en utilisant les ensembles S1, S2 et l&#8217;outil 
Champollion. Nous avons adapt&#233; les param&#232;tres de Champollion au couple de langue 
vietnamien-fran&#231;ais. Le troisi&#232;me filtrage a ensuite &#233;t&#233; appliqu&#233; en faisant varier le param&#232;tre 
&#945; (0,4 ; 0,5 ; 0,6 ; 0,7) et le param&#232;tre &#946; (0,1 ; 0,15 ; 0,2 ; 0,25 ; 0,3 ; 0,35 ; 0,4). La F-mesure 
(F1 score) est donn&#233;e dans le tableau 2. 
</p>
<p>E 1
k
</p>
<p>Nbr. de doc. : 1000 
Nbr. de doc. en fran&#231;ais : 173 
Nbr. de doc. en vietnamien : 348 
Nbr. de PDPs vrais : 129 
</p>
<p>S2
&#8217;
</p>
<p>&#8217;
 
</p>
<p>Nbr. de PDP d&#233;couverts : 379 
Nbr de PDP corrects : 129 
Pr&#233;cision = 34,04% 
Rappel = 100% 
</p>
<p>Tableau 1 : Pr&#233;cision/Rappel apr&#232;s 
utilisation des deux premiers filtrages 
</p>
<p>&#946;     &#945; 0,4 0,5 0,6 0,7 
0,1 0,69 0,76 0,77 0,75 
0,15 0,71 0,79 0,83 0,84 
0,2 0,71 0,77 0,82 0,83 
0,25 0,60 0,65 0,70 0,73 
0,3 0,48 0,52 0,56 0,59 
0,35 0,36 0,39 0,41 0,44 
0,4 0,21 0,23 0,26 0,27 
</p>
<p>Tableau 2 : F-mesure pour des valeurs 
diff&#233;rentes de &#945; et &#946;
</p>
<p>3.4 Application sur le corpus entier Eall
Nous avons appliqu&#233; la m&#233;thode avec les param&#232;tres estim&#233;s dans la section 3.3 sur 
l&#8217;ensemble Eall. Au vu des r&#233;sultats obtenus sur E1k, nous choisissons les param&#232;tres &#945;=0,7 et 
&#946;=0,15. Les caract&#233;ristiques du corpus entier trait&#233; sont pr&#233;sent&#233;es dans le tableau 3. Nous 
obtenons un total de 50k phrases parall&#232;les qui constitue le corpus parall&#232;le pour 
l&#8217;apprentissage d&#8217;un mod&#232;le de traduction fran&#231;ais-vietnamien. 
</p>
<p>Eall Nombre de documents : 120218 
Nombre de documents en fran&#231;ais : 20884 
Nombre de documents en vietnamien : 54406 
</p>
<p>Corpus parall&#232;le 
obtenu 
</p>
<p>Nombre de PDPs : 12108 
Nombre de PPPs : 50322 
</p>
<p>Tableau 3 : Caract&#233;ristiques du corpus parall&#232;le obtenu 
</p>
<p>4 Application : syst&#232;me de traduction probabiliste pour le couple de 
langue vietnamien-fran&#231;ais 
</p>
<p>Nous avons construit un syst&#232;me de TA probabiliste vietnamien-fran&#231;ais &#224; partir du corpus 
parall&#232;le obtenu en utilisant les outils libres GIZA++ (Och et Ney, 2003) et Moses (Koehn et 
al., 2007). Les scripts fournis avec Moses nous permettent de construire un mod&#232;le de 
traduction fond&#233; sur des s&#233;quences de mots (phrase table). Il contient &#233;galement des outils 
pour r&#233;gler les param&#232;tres des mod&#232;les et pour &#233;valuer la qualit&#233; de traduction avec le score 
BLEU. 
</p>
<p>4.1 Pr&#233;paration des donn&#233;es 
A partir du corpus entier, nous avons choisi 50 PDPs pour le d&#233;veloppement (Dev : 351 PPPs) 
et le r&#233;glage des param&#232;tres du syst&#232;me de traduction (MERT), 50 PDPs pour le test (Tst : 384 
PPPs), et le reste est r&#233;serv&#233; pour l&#8217;apprentissage (Trn : 49587 PPPs). En ce qui concerne les 
ensembles de d&#233;veloppement et de test, ceux-cis ont &#233;t&#233; v&#233;rifi&#233;s manuellement et nous avons 
&#233;limin&#233; les PPPs de faible qualit&#233;. Au final, on obtient 198 PPPs de bonne qualit&#233; pour le 
d&#233;veloppement et 210 PPPs de bonne qualit&#233; pour le test. Les donn&#233;es qui ont servi pour cr&#233;er 
les mod&#232;les de traduction et de langage ont &#233;t&#233; extraites automatiquement depuis les 49587 
PPPs de l&#8217;ensemble d&#8217;apprentissage, non v&#233;rifi&#233;es manuellement. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>T.-N.-D. Do, V.-B. Le, B. Bigi, L. Besacier, E. Castelli 
4.2 Syst&#232;mes de r&#233;f&#233;rence 
Nous avons construit des syst&#232;mes de TA dans les deux sens : fran&#231;ais vers vietnamien 
(F&#1;V) et vietnamien vers fran&#231;ais (V&#1;F). Les donn&#233;es en vietnamien ont &#233;t&#233; segment&#233;es en 
syllabes et en mots. La segmentation en mots est fond&#233;e sur l&#8217;algorithme de &#171; longest 
matching&#187; &#224; partir d&#8217;un dictionnaire monolingue de mots vietnamiens. Nous avons au total 
quatre syst&#232;mes de TA. Nous avons supprim&#233; les phrases qui sont plus longues que 100 
mots/syllabes dans l&#8217;ensemble Trn et l&#8217;ensemble Dev, ainsi le nombre de PPPs utilis&#233;s pour 
chaque ensemble est l&#233;g&#232;rement diff&#233;rent entre les syst&#232;mes. Tous les mots trouv&#233;s sont 
implicitement ajout&#233;s au vocabulaire du mod&#232;le de langage. 
</p>
<p>Segmentation 
du vietnamien
</p>
<p>Nombre de 
PPPs par 
ensemble 
</p>
<p>Langue Taille du 
vocabulaire (K)
</p>
<p>Nombre de 
mots/syllabes 
</p>
<p>(K)  
Fr 38,6 1783,6 Trn : 47081 
Vn 21,9 2190,2 
Fr 1,8 6,3 Dev :    198 
Vn 1,2 6,9 
Fr 1,9 6,4 
</p>
<p>Syllabe 
Syst&#232;me S1FV 
(F&#1;V) 
Syst&#232;me S1VF 
(V&#1;F) Tst :      210 
</p>
<p>Vn 1,3 7,1 
Fr 39,7 1893,0 Trn : 48864 
Vn 33,4 1629,0 
Fr 1,8 6,3 Dev :    198 
Vn 1,5 4,8 
Fr 1,9 6,3 
</p>
<p>Mot  
Syst&#232;me S2FV 
(F&#1;V) 
Syst&#232;me S2VF 
(V&#1;F) Tst :      210 
</p>
<p>Vn 1,6 4,9 
Tableau 4 : Nos quatre syst&#232;mes de TA 
</p>
<p>BLEU (%)
S1FV 40,09
S1VF 31,73
S2FV 40,59
S2VF 30,58
</p>
<p>Tableau 5 : Evaluation 
des syst&#232;mes de TA sur 
l&#8217;ensemble de test 
</p>
<p>Nous obtenons les performances pr&#233;sent&#233;es dans le tableau 5 pour tous ces syst&#232;mes. Dans le 
cas de syst&#232;mes o&#249; le texte vietnamien a &#233;t&#233; segment&#233; en mots, les phrases traduites en 
vietnamien sont re-segment&#233;es en syllabes avant de calculer le score BLEU, ceci afin que tous 
les scores BLEU &#233;valu&#233;s soient comparables. Les scores BLEU pour le sens de traduction 
fran&#231;ais vers vietnamien sont environ 40% et pour le sens vietnamien vers fran&#231;ais environ 
31%, ce qui est encourageant pour un premier r&#233;sultat. De plus, une seule r&#233;f&#233;rence a &#233;t&#233; 
utilis&#233;e pour estimer les scores BLEU dans nos exp&#233;riences. Il est &#233;galement int&#233;ressant de 
noter que la segmentation des phrases vietnamiennes en syllabes ou en mots ne modifie pas 
sensiblement la performance des deux sens de traduction.  
</p>
<p>4.3 Combinaison des syst&#232;mes fond&#233;s sur mot et syllabe en vietnamien 
Nous avons effectu&#233; un autre test sur la combinaison des unit&#233;s lexicales (syllabes et mots) sur 
le vietnamien. Nous avons r&#233;alis&#233; le test dans le sens de traduction vietnamien vers fran&#231;ais. 
En fait, l&#8217;outil Moses permet la combinaison des tables de traduction. Les tables de traduction 
du syst&#232;me S1VF (Tsyl) et du syst&#232;me S2VF (Tmot) ont &#233;t&#233; utilis&#233;es. Une autre table (Tmot*) a 
&#233;t&#233; cr&#233;&#233;e &#224; partir de la table Tmot, dans laquelle tous les mots ont &#233;t&#233; re-transform&#233;s en syllabe 
(dans ce dernier cas, la segmentation en mot a &#233;t&#233; utilis&#233;e durant le processus d&#8217;alignement et 
de construction de la table de traduction, mais la partie en vietnamien de la table finale est re-
segment&#233;e en syllabes). Les combinaisons de ces trois tables de traduction ont &#233;galement &#233;t&#233; 
cr&#233;&#233;es. Les entr&#233;es en vietnamien, pour cette exp&#233;rience, &#233;taient segment&#233;es soit en mot soit 
en syllabe. Comme pr&#233;c&#233;demment, l&#8217;ensemble de d&#233;veloppement a &#233;t&#233; utilis&#233; pour r&#233;gler des 
param&#232;tres et l&#8217;ensemble de test a &#233;t&#233; utilis&#233; pour estimer le score BLEU. Les r&#233;sultats 
obtenus sont pr&#233;sent&#233;s dans le tableau 6. Des cellules sont marqu&#233;es par X car certaines 
combinaisons n&#8217;ont pas de sens (par exemple la combinaison entre l&#8217;entr&#233;e en mots et la table 
de traduction en syllabes). Ces r&#233;sultats montrent que la performance peut &#234;tre am&#233;lior&#233;e en 
combinant les informations de mots et de syllabes du c&#244;t&#233; vietnamien. Le score BLEU est </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation d&#8217;un corpus bilingue pour la cr&#233;ation d&#8217;un syst&#232;me de traduction probabiliste 
Vietnamien - Fran&#231;ais 
am&#233;lior&#233; de 35,30% &#224; 38,02% sur l&#8217;ensemble Dev et de 31,73% &#224; 32,08% sur l&#8217;ensemble Tst. 
&#192; l&#8217;avenir, nous allons analyser plus en d&#233;tails la combinaison entre les unit&#233;s lexicales 
syllabes et mots pour les syst&#232;mes de TA vietnamiens et nous allons &#233;tudier l&#8217;utilisation d&#8217;un 
r&#233;seau de confusion comme entr&#233;e du syst&#232;me de TA, qui offre l&#8217;avantage de conserver les 
deux segmentations (en mots et en syllabes) dans une m&#234;me structure. 
</p>
<p>Entr&#233;e en syllabe Entr&#233;e en mots Tables de 
traductions utilis&#233;es Dev Tst Dev Tst 
</p>
<p>Tsyl 35,30 31,73 X X 
Tmot X X 35,70 30,58 
Tmot* 37,31 31,76 X X 
</p>
<p>Tsyl + Tmot 35,30 31,43 36,80 30,68 
Tsyl + Tmot* 38,02 32,08 X X V
</p>
<p>N
 
</p>
<p>v
er
</p>
<p>s 
FR
</p>
<p>Tmot + Tmot* 37,42 30,23 36,67 30,21 
</p>
<p>Tableau 6 : Scores BLEU (%) obtenus depuis les combinaisons entre les tables de traduction 
(calcul&#233;s sur l&#8217;ensemble de d&#233;veloppement et l&#8217;ensemble de test)  
</p>
<p>4.4 Comparaison avec le syst&#232;me de TA de Google7
</p>
<p>Le syst&#232;me de TA Google Translate a r&#233;cemment ajout&#233; la langue vietnamienne &#224; sa liste de 
langues trait&#233;es. Dans la plupart des cas, il utilise l&#8217;anglais comme une langue interm&#233;diaire. 
Pour la premi&#232;re &#233;valuation comparative, un test simple a &#233;t&#233; r&#233;alis&#233;. Deux ensembles de 
donn&#233;es ont &#233;t&#233; utilis&#233;s : un dans le domaine des actualit&#233;s (l&#8217;ensemble Tst de la section 4.2), 
et un hors du domaine des actualit&#233;s. Ce dernier a &#233;t&#233; obtenu &#224; partir du site Web bilingue 
vietnamien-fran&#231;ais de l&#8217;Ambassade de France au Vietnam8. Apr&#232;s avoir trait&#233; pr&#233;alablement 
et align&#233; manuellement, nous avons obtenu 100 PPPs pour l&#8217;ensemble hors du domaine de 
donn&#233;es. Les phrases vietnamiennes ont &#233;t&#233; segment&#233;es en syllabes. Les deux ensembles de 
donn&#233;es ont &#233;t&#233; trait&#233;s par nos syst&#232;mes de TA (S1FV, S1VF) et le syst&#232;me de TA de Google. 
Les r&#233;sultats des syst&#232;mes ont &#233;t&#233; post-trait&#233;s (passage en minuscule) et les scores BLEU ont 
&#233;t&#233; estim&#233;s. Le tableau 7 pr&#233;sente les r&#233;sultats de ce test. Bien que notre syst&#232;me soit 
logiquement meilleur sur l&#8217;ensemble de donn&#233;es dans le domaine, il est &#233;galement l&#233;g&#232;rement 
meilleur que le syst&#232;me de TA de Google sur l&#8217;ensemble de donn&#233;es hors domaine (pour le 
couple de langue vietnamien-fran&#231;ais). 
</p>
<p>Le score BLEU (%)  Sens de 
traduction Notre syst&#232;me Google 
</p>
<p>F&#1;V 40,09 24,82 Dans le domaine news 
(210 PPPs) V&#1;F 32,08 15,63 
</p>
<p>F&#1;V 25,00 24,38 Hors du domaine 
(100 PPPs) V&#1;F 20,22 15,82 
</p>
<p>Tableau 7 : Comparer avec le syst&#232;me de TA de Google 
</p>
<p>5 Conclusions et perspectives 
Dans cet article, nous avons pr&#233;sent&#233; notre travail sur l&#8217;exploitation d&#8217;un corpus bilingue pour 
construire des syst&#232;mes de traduction probabilistes pour le couple de langue vietnamien-
fran&#231;ais. Nous avons d&#233;crit la m&#233;thode d&#8217;alignement de documents, qui est bas&#233;e sur la date 
de publication, des mots sp&#233;ciaux et l&#8217;utilisation des r&#233;sultats de l&#8217;alignement en phrases. La 
m&#233;thode propos&#233;e est appliqu&#233;e aux donn&#233;es vietnamiennes et fran&#231;aises r&#233;cup&#233;r&#233;s depuis un 
site Web multilingue d&#8217;actualit&#233;s. Nous avons obtenu pr&#232;s de 12100 paires de documents 
parall&#232;les et 50300 paires de phrases bilingues. Nous avons construit des syst&#232;mes de TA 
</p>
<p>                                                
</p>
<p>7
 http://translate.google.com 
</p>
<p>8
 http://www.ambafrance-vn.org </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>T.-N.-D. Do, V.-B. Le, B. Bigi, L. Besacier, E. Castelli 
utilisant l&#8217;outil Moses. Les scores BLEU pour le syst&#232;me de traduction fran&#231;ais vers 
vietnamien est de 40,09% et vietnamien vers fran&#231;ais est de 32,08%. De plus, la combinaison 
des informations entre les mots et les syllabes vietnamiennes peut &#234;tre utile pour am&#233;liorer les 
performances du syst&#232;mes de TA vietnamien. Dans l&#8217;avenir, nous allons augmenter la taille 
du corpus et &#233;tudier l&#8217;utilisation d&#8217;unit&#233;s lexicales diff&#233;rentes de la langue vietnamienne 
(syllabes, mots) dans un syst&#232;me de TA, ainsi que proposer des m&#233;thodes d&#8217;apprentissage 
non-supervis&#233; pour am&#233;liorer notre syst&#232;me. 
</p>
<p>R&#233;f&#233;rences 
BROWN P.F., LAI J.C. ET MERCER R.L. (1991). Aligning sentences in parallel corpora. Proceedings of 47th 
Annual Meeting of the Association for Computational Linguistics. 
BROWN P.F., PIETRA S.A.D., PIETRA V.J.D. ET MERCER R.L. (1993). The Mathematics of Statistical Machine 
Translation: Parameter Estimation. Computational Linguistics. Vol. 19, no. 2.
DOAN N.H. (2001). Generation of Vietnamese for French-Vietnamese and English-Vietnamese Machine 
Translation. ACL, Proceedings of the 8th European workshop on Natural Language Generation. 
GALE W.A. ET CHURCH K.W. (1993). A program for aligning sentences in bilingual corpora. Proceedings of the 
29th annual meeting on Association for Computational Linguistics. 
HO T.B. (2005). Current Status of Machine Translation Research in Vietnam Towards Asian wide multi language 
machine translation project. Vietnamese Language and Speech Processing Workshop. 
HUTCHINS W.J. (2001). Machine translation over fifty years. Histoire, epistemologie, langage: HEL, ISSN 0750-
8069, Vol. 23, N&#186; 1, 2001.  
KAY M. ET ROSCHEISEN M. (1993). Text - translation alignment. Association for Computational Linguistics.
KILGARRIFF A. ET GREFENSTETTE G. (2003). Introduction to the Special Issue on the Web as Corpus.
Computational Linguistics, volume 29. 
KOEHN P., OCH F.J. ET MARCU D. (2003). Statistical phrase-based translation. Conference of the North American 
Chapter of the Association for Computational Linguistics on Human Language Technology - Volume 1.
KOEHN P. (2005). Europarl: A Parallel Corpus for Statistical Machine Translation. Machine Translation Summit.  
KOEHN P., HOANG H., BIRCH A., CALLISON-BURCH C., ZENS R., FEDERICO M., BERTOLDI N., COWAN B., SHEN 
W. ET MORAN C. (2007). Moses: Open Source Toolkit for Statistical Machine Translation. Proceedings of the 
ACL.  
LE V.B., BIGI B., BESACIER L. ET CASTELLI E. (2003). Using the Web for fast language model construction in 
minority languages. Eurospeech&#8217;03. 
MA X. (2006). Champollion: A Robust Parallel Text Sentence Aligner. LREC: Fifth International Conference on 
Language Resources and Evaluation.  
MA X. ET LIBERMAN M. (1999). Bits: A method for bilingual text search over the web. Machine Translation 
Summit VII.  
MUNTEANU D.S. ET MARCU D. (2006). Extracting parallel sub-sentential fragments from non-parallel corpora . 
44th annual meeting of the Association for Computational Linguistics
NGUYEN T.M.H. (2006). Outils et ressources linguistiques pour l&#8217;alignement de textes multilingues fran&#231;ais-
vietnamiens. Th&#232;se pr&#233;sent&#233;e pour l&#8217;obtention du titre de Docteur de l&#8217;Universit&#233; Henri Poincar&#233;, Nancy 1 en 
Informatique.  
OCH F. J. ET NEY H. (2003). A systematic comparison of various statistical alignment models. Computational 
Linguistics. Vol. 29. 
PATRY A. ET LANGLAIS P. (2005). Paradocs: un syst&#232;me d&#8217;identification automatique de documents parall&#232;les. 
12e Conference sur le Traitement Automatique des Langues Naturelles. Dourdan, France.  
RESNIK P. ET SMITH N.A. (2003). The Web as a Parallel Corpus. Computational Linguistics. 
ROSI&#323;SKA M. (2007). Collecting polish-german parallel corpora in the internet. Proc. of the International 
Multiconference on Computer Science and Information Technology.
YANG C.C. ET LI P.W. (2002). Mining English/Chinese Parallel Documents from the World Wide Web. 
Proceedings of the 11th International World Wide Web Conference, Honolulu, USA.  </p>

</div></div>
</body></html>