<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un chunker multilingue endog&#232;ne</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24-26 juin 2009 
</p>
<p>Un chunker multilingue endog&#232;ne 
</p>
<p>d&#233;monstration 
Jacques Vergne 
</p>
<p>GREYC &#8211; Universit&#233; de Caen, campus 2 - BP 5186, F-14032 CAEN cedex 
Jacques.Vergne@info.unicaen.fr 
</p>
<p>R&#233;sum&#233;  
Le chunking consiste &#224; segmenter un texte en chunks, segments sous-phrastiques qu'Abney a 
d&#233;fini approximativement comme des groupes accentuels. Traditionnellement, le chunking 
utilise des ressources monolingues, le plus souvent exhaustives, quelquefois partielles : des 
mots grammaticaux et des ponctuations, qui marquent souvent des d&#233;buts et fins de chunk. 
Mais cette m&#233;thode, si l'on veut l'&#233;tendre &#224; de nombreuses langues, n&#233;cessite de multiplier les 
ressources monolingues. Nous pr&#233;sentons une nouvelle m&#233;thode : le chunking endog&#232;ne, qui 
n'utilise aucune ressource hormis le texte analys&#233; lui-m&#234;me. Cette m&#233;thode prolonge les 
travaux de Zipf : la minimisation de l'effort de communication conduit les locuteurs &#224; 
raccourcir les mots fr&#233;quents. On peut alors caract&#233;riser un chunk comme &#233;tant la p&#233;riode des 
fonctions p&#233;riodiques correll&#233;es longueur et effectif des mots sur l'axe syntagmatique. Cette 
m&#233;thode originale pr&#233;sente l'avantage de s'appliquer &#224; un grand nombre de langues d'&#233;criture 
alphab&#233;tique, avec le m&#234;me algorithme, sans aucune ressource. 
</p>
<p>Abstract  
Chunking is segmenting a text into chunks, sub-sentential segments, that Abney 
approximately defined as stress groups. Chunking usually uses monolingual resources, most 
often exhaustive, sometimes partial : function words and punctuations, which often mark 
beginnings and ends of chunks. But, to extend this method to other languages, monolingual 
resources have to be multiplied. We present a new method : endogenous chunking, which 
uses no other resource than the text to be parsed itself. The idea of this method comes from 
Zipf : to make the least communication effort, speakers are driven to shorten frequent words. 
A chunk then can be characterised as the period of the periodic correlated functions length 
and frequency of words on the syntagmatic axis. This original method takes its advantage to 
be applied to a great number of languages of alphabetic script, with the same algorithm, 
without any resource. 
</p>
<p>Mots-cl&#233;s : chunking, multilingue, endog&#232;ne, longueur des mots, effectif des mots 
Keywords: chunking, multilingual, endogenous, word length, word frequency 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jacques Vergne 
</p>
<p>1 Le concept de chunk selon Abney et selon D&#233;jean 
Le concept de chunk a &#233;t&#233; propos&#233; par Steve Abney (1991). Il est fond&#233; sur des propri&#233;t&#233;s de 
la parole : Abney l'a d&#233;fini approximativement comme un groupe accentuel. La parole &#233;tant 
contrainte par l'appareil vocal, invariant selon les langues, le chunk est alors un concept 
g&#233;n&#233;rique portant sur les langues, un concept du langage. Herv&#233; D&#233;jean (1998) en a propos&#233; 
un mod&#232;le de structure : des d&#233;buts et des fins de chunk (mots ou morph&#232;mes) entourant un 
noyau (D&#233;jean 1998, page 117); notre m&#233;thode utilise ce mod&#232;le. 
</p>
<p>2 Principes du chunking endog&#232;ne 
La m&#233;thode que nous proposons est fond&#233;e sur les propri&#233;t&#233;s des fonctions longueur et 
effectif des mots sur l'axe syntagmatique. Ces deux fonctions sont correll&#233;es : p&#233;riodiques, 
synchrones, en opposition de phase, et leur p&#233;riode est le chunk. Sur une p&#233;riode, la fonction 
longueur est monotone croissante, et la fonction effectif est monotone d&#233;croissante. Ces 
concepts prolongent les travaux de Zipf : la minimisation de l'effort de communication 
conduit le locuteur &#224; raccourcir les mots fr&#233;quents (Zipf 1949). La m&#233;trique de longueur 
utilis&#233;e par Zipf est le nombre de caract&#232;res de la graphie; la m&#233;trique de notre m&#233;thode est le 
nombre de syllabes, ou plus exactement le nombre de noyaux vocaliques, calculable sur la 
graphie; cette m&#233;trique est enracin&#233;e dans l'origine orale du concept de chunk. L'effectif des 
mots est mesur&#233; dans le texte &#224; segmenter.  
</p>
<p>L'algorithme exploite une hypoth&#232;se et deux propri&#233;t&#233;s contextuelles. Voici l'hypoth&#232;se : dans 
un m&#234;me texte, &#224; 1 graphie correspond 1 mot; donc tous les contextes d'une m&#234;me graphie 
informent sur le m&#234;me mot dans un m&#234;me texte. La premi&#232;re propri&#233;t&#233; contextuelle est la 
suivante : le &quot;virgulot&quot; est d&#233;fini comme segment d&#233;limit&#233; par 2 ponctuations; il a &#233;t&#233; propos&#233; 
par Herv&#233; D&#233;jean (&quot;entre-ponctuations&quot;) et renomm&#233; &quot;virgulot&quot; par Nadine Lucas. Propri&#233;t&#233; : 
le chunk est un constituant du virgulot; donc un mot attest&#233; en d&#233;but de virgulot est un d&#233;but 
de chunk, et un mot attest&#233; en fin de virgulot est une fin de chunk. La deuxi&#232;me propri&#233;t&#233; 
exploite la propri&#233;t&#233; du chunk (&#224; l'int&#233;rieur d'un virgulot) d'&#234;tre la p&#233;riode des fonctions 
p&#233;riodiques longueur et effectif des mots, et leur caract&#233;ristique de croissance ou d&#233;croissance 
monotones.  
</p>
<p>Du fait de l'hypoth&#232;se de biunivocit&#233; graphie - mot, tous les contextes d'une m&#234;me graphie 
informent sur le m&#234;me mot dans un m&#234;me texte; donc d&#233;but et fin de chunk sont des attributs 
des mots du dictionnaire du texte et non pas des attributs des mots occurrences du texte. Pour 
chaque propri&#233;t&#233; contextuelle, l'algorithme consiste en un parcours du texte pour relever les 
contextes attest&#233;s, et renseigner les mots du dictionnaire, puis sort les r&#233;sultats en informant 
les mots occurrences &#224; partir des mots du dictionnaire. L'ordre d'application des deux 
propri&#233;t&#233;s est indiff&#233;rent car elles sont ind&#233;pendantes.  
</p>
<p>3 Quelques fragments segment&#233;s en chunks 
Le corpus de validation de la m&#233;thode est compos&#233; de communiqu&#233;s de presse (environ 1000 
mots chacun) du site de l'Union Europ&#233;enne (http://europa.eu/rapid/), chaque communiqu&#233; 
&#233;tant r&#233;dig&#233; en 1 &#224; 22 langues. Les fragments suivants sont extraits du communiqu&#233; 
IP/05/1018 de 2005 : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un chunker multilingue endog&#232;ne 
</p>
<p>[ Die Laichgr&#252;nde ] [ der Aale ] befinden ] [ sich [ im Sargassosee ] [ im mittleren 
Westatlantik ] . 
</p>
<p>[ Eels spawn ] [ in [ the Sargasso Sea [ in [ the western central Atlantic ] Ocean ] . 
</p>
<p>[ Las [ anguilas ] desovan ] [ en [ el Mar [ de [ los Sargazos ] , [ en [ las aguas ] centro-
occidentales ] [ del Oc&#233;ano Atl&#225;ntico ] . 
</p>
<p>[ La zone  [ de frai ] [ de l&#8217;anguille ] [ se situe  [ en mer ] [ des Sargasses ] , [ dans [ la partie 
centre-ouest ] [ de l&#8217;oc&#233;an Atlantique ] . 
</p>
<p>[ Le anguille ] [ si riproducono ] [ nel mar [ dei Sargassi ] , [ nell&#8217;Atlantico centro-
occidentale ] . 
</p>
<p>4 Conclusion 
En caract&#233;risant le chunk de mani&#232;re purement num&#233;rique, comme p&#233;riode des fonctions 
longueur et effectif des mots sur l'axe syntagmatique, cette m&#233;thode originale consiste en des 
calculs sur le texte &#224; segmenter; elle a l'avantage de s'appliquer &#224; un grand nombre de langues, 
avec le m&#234;me algorithme, sans aucune ressource monolingue : des langues d'&#233;criture 
alphab&#233;tique, avec une pratique du mot &#233;crit qui s&#233;pare les mots grammaticaux des mots 
lexicaux, et compatibles avec un mod&#232;le de structure de chunk o&#249; les mots grammaticaux sont 
g&#233;n&#233;ralement ant&#233;pos&#233;s aux mots lexicaux; la m&#233;thode est prometteuse pour les 22 langues de 
la Communaut&#233; Europ&#233;enne, hormis le finnois1.  
</p>
<p>&#201;tant ind&#233;pendante des sp&#233;cificit&#233;s de chaque langue, cette m&#233;thode n'est pas &quot;multilangue&quot;, 
ni &quot;multi-monolangue&quot;, mais comme elle exploite des propri&#233;t&#233;s g&#233;n&#233;riques des langues, 
c'est-&#224;-dire des propri&#233;t&#233;s du langage, en tant qu'abstraction des langues, on pourrait 
simplement l'appeler m&#233;thode &quot;linguistique&quot;. 
</p>
<p>R&#233;f&#233;rences  
STEVEN ABNEY (1991). Parsing By Chunks, in Principle-Based Parsing, 257-278, Kluwer 
Academic Publishers. 
</p>
<p>HERVE DEJEAN (1998). Concepts et algorithmes pour la d&#233;couverte des structures 
formelles des langues. Th&#232;se de doctorat de l'universit&#233; de Caen. 
</p>
<p>JACQUES VERGNE (2001). Analyse syntaxique automatique de langues : du combinatoire au 
calculatoire (communication invit&#233;e), Actes de TALN 2001, 15-29. 
</p>
<p>GEORGE K. ZIPF (1949) Human Behavior and the Principle of Least-Effort. Addison-Wesley. 
</p>
<p>                                                
1 Voir des r&#233;sultats sur : http://www.info.unicaen.fr/~jvergne/chunking_multilingue_endogene/ </p>

</div></div>
</body></html>