<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un analyseur de surface non d&#233;terministe pour le fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Un analyseur de surface non d&#233;terministe pour le fran&#231;ais
</p>
<p>Fran&#231;ois Trouilleux
LRL, Universit&#233; Blaise-Pascal
</p>
<p>http://www.univ-bpclermont.fr/LABOS/lrl/
</p>
<p>R&#233;sum&#233;. Les analyseurs syntaxiques de surface &#224; base de r&#232;gles se caract&#233;risent par un
processus en deux temps : d&#233;sambigu&#239;sation lexicale, puis reconnaissance de patrons. Consid&#233;-
rant que ces deux &#233;tapes introduisent une certaine redondance dans la description linguistique
et une dilution des heuristiques dans les diff&#233;rents processus, nous proposons de d&#233;finir un ana-
lyseur de surface qui fonctionne sur une entr&#233;e non d&#233;sambigu&#239;s&#233;e et produise l&#8217;ensemble des
analyses possibles en termes de syntagmes noyau (chunks). L&#8217;analyseur, implant&#233; avec NooJ,
repose sur la d&#233;finition de patrons &#233;tendus qui annotent des s&#233;quences de syntagmes noyau.
Les r&#233;sultats obtenus sur un corpus de d&#233;veloppement d&#8217;environ 22 500 mots, avec un rappel
proche de 100 %, montrent la faisabilit&#233; de l&#8217;approche et signalent quelques points d&#8217;ambigu&#239;t&#233;
&#224; &#233;tudier plus particuli&#232;rement pour am&#233;liorer la pr&#233;cision.
</p>
<p>Abstract. Rule-based chunkers are characterized by a two-tier process : part-of-speech
disambiguation, and pattern matching. Considering that these two stages introduce some redun-
dancy in the linguistic description and a dilution of heuristics over the different processes, we
propose to define a chunker which parses a non-disambiguated input, and produces all possible
analysis in terms of chunks. The parser, implemented with NooJ, relies on the definition of ex-
tended patterns, which annotate sequences of chunks. The results obtained on an approx. 22500
word corpus, with almost 100 % recall, demonstrate the feasability of the approach, and signal
which ambiguities should be further studied in order to improve precision.
</p>
<p>Mots-cl&#233;s : Analyse syntaxique de surface, automates &#224; &#233;tats finis, d&#233;terminisme, d&#233;sa-
mbigu&#239;sation.
</p>
<p>Keywords: Chunking, finite-state automata, determinism, disambiguation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Trouilleux
</p>
<p>1 Introduction
</p>
<p>Dans un r&#233;cent article, M. Cori (2008) distingue deux grands types de m&#233;thodes en TAL. Le
&#171; TAL th&#233;orique &#187; y est caract&#233;ris&#233; par r&#233;f&#233;rence aux diff&#233;rents mod&#232;les de grammaires syntag-
matiques, tandis qu&#8217;un logiciel de &#171; TAL robuste &#187; y est caract&#233;ris&#233; par une s&#233;rie de crit&#232;res: il
traite du texte &#171; tout venant &#187;, il produit toujours une analyse, il s&#233;lectionne l&#8217;analyse suppo-
s&#233;e la meilleure, et il se pr&#234;te &#224; des proc&#233;dures d&#8217;&#233;valuation quantitative de ses performances.
L&#8217;article oppose par ailleurs TAL th&#233;orique et TAL robuste sur leurs objectifs d&#8217;analyse, en
soulignant que le TAL robuste vise souvent une analyse syntaxique partielle, typiquement en
syntagmes noyau (chunks).
En jouant sur l&#8217;un ou l&#8217;autre des crit&#232;res identifi&#233;s par Cori pour le TAL robuste, on peut cher-
cher de nouvelles fronti&#232;res entre les deux pratiques. Le travail pr&#233;sent&#233; dans cet article trouve
son origine dans la volont&#233; de faire varier le param&#232;tre qui consiste &#224; ne produire qu&#8217;une analyse
en s&#233;lectionnant la meilleure. On a ainsi tent&#233; de d&#233;velopper un analyseur de surface (chunker)
pour le fran&#231;ais, capable de traiter du texte tout venant, qui produise toujours une analyse, mais
qui, pour chaque phrase du texte analys&#233;, produise un ensemble d&#8217;analyses possibles en termes
de syntagmes noyau, &#233;tant donn&#233; une description de chaque mod&#232;le de syntagme noyau.
</p>
<p>Notre analyseur s&#8217;&#233;carte de deux pratiques omnipr&#233;sentes dans les analyseurs de surface: le d&#233;-
terminisme et l&#8217;incr&#233;mentalit&#233;. Nous justifierons ce choix en le mettant en perspective avec ces
pratiques canoniques (alin&#233;a 2.1), puis nous exposerons les probl&#232;mes pos&#233;s par l&#8217;application
directe de la reconnaissance de patrons sur une entr&#233;e ambig&#252;e (alin&#233;a 2.2). Notre analyseur,
implant&#233; avec NooJ, propose une solution &#224; ces probl&#232;mes gr&#226;ce &#224; l&#8217;utilisation de patrons &#233;ten-
dus annotant des s&#233;quences de syntagmes noyau (alin&#233;a 3). Les r&#233;sultats obtenus sur un corpus
de d&#233;veloppement de 22 500 mots sont pr&#233;sent&#233;s dans l&#8217;alin&#233;a 4.
</p>
<p>2 Probl&#233;matique
</p>
<p>Les analyseurs syntaxiques de surface robustes &#224; base de r&#232;gles 1 se caract&#233;risent par le fait
qu&#8217;ils sont d&#233;terministes, dans le sens o&#249; ils ne produisent qu&#8217;une seule analyse, et mettent en
&#339;uvre un processus d&#8217;analyse incr&#233;mental. Par ailleurs, dans ces syst&#232;mes, les r&#232;gles sont en
g&#233;n&#233;ral appliqu&#233;es selon le mode de la reconnaissance de patrons.
</p>
<p>2.1 D&#233;terminisme et incr&#233;mentalit&#233;
</p>
<p>De mani&#232;re g&#233;n&#233;rale, l&#8217;argument en faveur du d&#233;terminisme de l&#8217;analyseur est utilitaire. Ainsi,
Hindle (1994, p. 107) consid&#232;re qu&#8217;&#171; une sortie unique facilite grandement l&#8217;utilisation d&#8217;un
analyseur. Si un analyseur devait produire plusieurs analyses, pour la plupart des t&#226;ches d&#8217;ana-
lyse textuelle il serait n&#233;cessaire de choisir parmi les alternatives avant d&#8217;utiliser les r&#233;sultats &#187;.
Hindle pr&#233;cise que le d&#233;terminisme n&#8217;est pas une n&#233;cessit&#233; ; notre projet est de l&#8217;&#233;viter. La
cons&#233;quence de ce choix est que l&#8217;int&#233;r&#234;t de notre analyseur ne r&#233;sidera pas dans ses apports
&#224; une chaine de traitements globale, mais dans le fait qu&#8217;il fournira une sortie propre &#224; mettre
en lumi&#232;re les difficult&#233;s de l&#8217;analyse linguistique. Notre analyseur se veut un outil d&#8217;&#233;tude
linguistique, plut&#244;t qu&#8217;un composant d&#8217;une application.
</p>
<p>1. On laisse de c&#244;t&#233; dans cet article les approches &#224; base de mod&#232;les statistiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un analyseur de surface non d&#233;terministe pour le fran&#231;ais
</p>
<p>Les syst&#232;mes de TAL robustes sont &#233;valu&#233;s de fa&#231;on uniquement quantitative, ce qui conduit
les linguistes qui les d&#233;finissent &#224; faire des choix motiv&#233;s par des consid&#233;rations statistiques.
Ainsi la plupart de ces syst&#232;mes &#233;choueront &#224; analyser correctement la phrase suivante, parce
que statistiquement un des en d&#233;but de phrase est le plus souvent un d&#233;terminant:
</p>
<p>(1) Des p&#233;tunias en bordure de l&#8217;all&#233;e montait par bouff&#233;e une odeur de cassis.
Une de nos motivations est de pouvoir rep&#233;rer dans des corpus des configurations telles que
celle qu&#8217;on observe dans cet exemple.
</p>
<p>Les analyseurs syntaxiques de surface &#224; base de r&#232;gles se caract&#233;risent par un processus en
deux temps: d&#233;sambigu&#239;sation lexicale, puis applications de r&#232;gles. On pourrait multiplier les
exemples de tels analyseurs: (Hindle, 1994), (Kinyon, 2001), (A&#239;t-Mokhtar et al., 2002), (Bou-
rigault et al., 2005), etc. On notera &#233;galement que le Natural Language Toolkit, dont on peut
penser que, en tant que &#171; boite &#224; outils &#187;, il met en &#339;uvre des approches paradigmatiques, d&#233;finit
un analyseur syntaxique de surface en ces termes:
</p>
<p>A chunker finds contiguous, non-overlapping spans of related tokens and groups
them together into chunks. Chunkers often operate on tagged texts, and use the tags
to make chunking decisions. (Bird et al., 2009, alin&#233;a 7.2)
</p>
<p>De fait, le syst&#232;me de segmentation en syntagmes noyau du NLTK fonctionne par application
d&#8217;expressions r&#233;guli&#232;res sur du texte &#233;tiquet&#233; de fa&#231;on non ambig&#252;e.
</p>
<p>L&#8217;utilisation d&#8217;un tagger pour d&#233;sambigu&#239;ser les unit&#233;s lexicales est avant tout, comme le d&#233;-
terminisme, utilitaire: les taggers, qu&#8217;ils soient &#224; base de r&#232;gles ou statistiques, sont en g&#233;n&#233;ral
extr&#234;mement rapides et permettent de r&#233;duire sensiblement la complexit&#233; du processus d&#8217;ana-
lyse global. Ainsi, (Roussanaly et al., 2005) justifient l&#8217;inclusion d&#8217;un tagger dans la chaine de
traitement mise en &#339;uvre pour leur participation &#224; la campagne EASY par les &#171; temps d&#8217;analyse
r&#233;dhibitoires &#187; provoqu&#233;s par &#171; des ambigu&#239;t&#233;s multiples &#187;.
</p>
<p>Une alternative &#224; la d&#233;sambigu&#239;sation lexicale est propos&#233;e par (Vergne, 1999), dont l&#8217;analyseur
fonctionne sur des unit&#233;s lexicales ayant explicitement une cat&#233;gorie par d&#233;faut. L&#8217;objectif est
&#233;galement de r&#233;duire les possibilit&#233;s combinatoires pour la suite de l&#8217;analyse.
</p>
<p>Le principal inconv&#233;nient d&#8217;un processus d&#8217;analyse en deux temps est bien connu: les erreurs
d&#8217;analyse au premier niveau vont affecter le second. Or il est g&#233;n&#233;ralement admis que l&#8217;infor-
mation utilis&#233;e par les taggers est trop limit&#233;e pour permettre une analyse toujours correcte. On
abandonne ainsi le traitement de certaines ambigu&#239;t&#233;s, celle du des de (1), par exemple. Cela
&#233;tant, nous voyons dans l&#8217;utilisation d&#8217;un tagger deux autres inconv&#233;nients.
</p>
<p>Le premier est que dans l&#8217;approche &#224; deux &#233;tapes, on a une description linguistique redondante,
dans le sens o&#249; on dira souvent deux fois la m&#234;me chose 2. Par exemple, au premier niveau on
aura une r&#232;gle ou une statistique qui dira qu&#8217;un clitique est plus probable qu&#8217;un article ou un
nom apr&#232;s la forme ne, et au deuxi&#232;me niveau on aura un automate ou une expression r&#233;guli&#232;re
sp&#233;cifiant des syntagmes NV qui int&#232;grera la m&#234;me information.
</p>
<p>Le second inconv&#233;nient est qu&#8217;en r&#233;partissant le processus d&#8217;analyse sur deux niveaux, on abou-
tit &#224; une dilution des heuristiques. Des choix statistiques (plus ou moins explicites) sont faits aux
deux niveaux et on ne sait plus forc&#233;ment dans l&#8217;&#233;valuation globale du syst&#232;me d&#8217;o&#249; viennent
</p>
<p>2. Et non dans le sens o&#249; deux informations diff&#233;rentes permettraient d&#8217;aboutir &#224; une m&#234;me conclusion, ce qui
serait positif.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Trouilleux
</p>
<p>les erreurs. Nous pensons qu&#8217;un analyseur produisant une segmentation en syntagmes noyau
ambig&#252;e permettra de sp&#233;cifier par la suite et d&#8217;&#233;valuer clairement les heuristiques &#224; mettre en
&#339;uvre pour d&#233;sambigu&#239;ser cette sortie. L&#8217;analyseur que nous proposons d&#233;sambigu&#239;sera cer-
taines formes, mais seulement sur la base de la structure interne des syntagmes noyau.
</p>
<p>2.2 Limites de la reconnaissance de patrons
</p>
<p>Bon nombre d&#8217;analyseurs robustes tirent leur robustesse du fait que les r&#232;gles qu&#8217;ils implantent
sont appliqu&#233;es selon le mode de la &#171; reconnaissance de patrons &#187;. L&#8217;algorithme qui parcourt la
chaine d&#8217;entr&#233;e ne cherche pas &#224; associer une analyse axiomatique &#224; l&#8217;ensemble de la chaine,
mais se contente de reconnaitre que des fragments de cette chaine satisfont aux r&#232;gles sp&#233;ci-
fi&#233;es. Cet aspect de l&#8217;algorithme est essentiel parce que c&#8217;est lui qui permet de passer outre des
mots inconnus, toujours pr&#233;sents dans les corpus. NooJ (Silberztein, 2004), logiciel que nous
utilisons, permet de d&#233;clarer des automates servant &#224; la reconnaissance de patrons. Trois modes
de reconnaissance des patrons d&#233;finis par une grammaire sont disponibles: la plus courte, la
plus longue ou toutes les correspondances.
</p>
<p>Consid&#233;rons en premier lieu un mod&#232;le simple qu&#8217;on notera ainsi:
Main = :GN + :GP + :NV + :PV + :GR + :GA ;
</p>
<p>o&#249; les suites :GN, :GP, etc. identifient chacune un automate &#224; &#233;tats finis d&#233;finissant respective-
ment l&#8217;ensemble des GN, GP, etc. possibles 3.
</p>
<p>Avec une telle grammaire, les deux premiers modes sont clairement inadapt&#233;s &#224; notre projet.
Ils sont d&#233;terministes, et il est facile de trouver des exemples o&#249; ils &#233;choueront. En voici deux,
pour la s&#233;lection de la plus longue et de la plus courte correspondance, respectivement:
(2)a. &lt;GN&gt;La petite ferme&lt;/GN&gt; &lt;GN&gt;les yeux&lt;/GN&gt;.
</p>
<p>b. &lt;GN&gt;La petite&lt;/GN&gt; &lt;GN&gt;fille&lt;/GN&gt; le &lt;NV&gt;regarde&lt;/NV&gt;.
Notons que ces deux exemples d&#233;montrent qu&#8217;on ne peut appliquer une reconnaissance de pa-
trons simples de fa&#231;on d&#233;terministe sur une entr&#233;e ambig&#252;e. Cette observation jette une nou-
velle lumi&#232;re sur le processus mis en &#339;uvre dans les analyseurs robustes &#224; base d&#8217;expressions
r&#233;guli&#232;res ou d&#8217;automates finis: d&#233;sambigu&#239;ser le texte avant d&#8217;appliquer la reconnaissance de
patrons n&#8217;est pas uniquement motiv&#233; par une question d&#8217;efficacit&#233;, c&#8217;est une n&#233;cessit&#233;.
</p>
<p>Reste le mode &#171; toutes les correspondances &#187;. Il pr&#233;sente l&#8217;inconv&#233;nient de surg&#233;n&#233;rer exag&#233;r&#233;-
ment. Deux cas de figure m&#233;ritent en particulier l&#8217;attention.
</p>
<p>Le premier est illustr&#233; par l&#8217;exemple suivant, o&#249; une phrase compos&#233;e d&#8217;un seul syntagme NV,
donne lieu &#224; quatre analyses.
</p>
<p>(3) &lt;NV&gt;Il &lt;NV&gt;le &lt;NV&gt;lui &lt;NV&gt;donne&lt;/NV&gt;&lt;/NV&gt;&lt;/NV&gt;&lt;/NV&gt;.
Le propre de la reconnaissance de patrons est de pouvoir ignorer des mots ; ici on voudrait
pouvoir dire au syst&#232;me de ne pas laisser hors d&#8217;un syntagme les mots qu&#8217;il peut int&#233;grer.
</p>
<p>Le second peut &#234;tre illustr&#233; par la s&#233;quence suivante:
(4) &lt;GP&gt;Pour cent francs&lt;/GP&gt; &lt;GP&gt;par an&lt;/GP&gt;
</p>
<p>Pour les cinq unit&#233;s lexicales de cette s&#233;quence, notre dictionnaire a les cat&#233;gories suivantes:
Pour,PREP|N cent,NUM francs,ADJ|N par,PREP|N an,N
</p>
<p>3. On utilise les cat&#233;gories de la campagne d&#8217;&#233;valuation EASY (cf. (Gendner &amp; Vilnat, 2004)).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un analyseur de surface non d&#233;terministe pour le fran&#231;ais
</p>
<p>Demander la reconnaissance de toutes les correspondances possibles avec cette entr&#233;e ambig&#252;e
aboutira &#224; de multiples analyses, parmi lesquelles on trouvera par exemple:
</p>
<p>(5) &lt;GN&gt;Pour&lt;/GN&gt; &lt;GN&gt;cent&lt;/GN&gt; &lt;GN&gt;francs&lt;/GN&gt;
&lt;GN&gt;par&lt;/GN&gt; &lt;GN&gt;an&lt;/GN&gt;
</p>
<p>Ici, il semble raisonnable de privil&#233;gier les lectures de pour et par comme pr&#233;positions, et leur
association avec le nom qui les suit. L&#8217;analyseur que nous pr&#233;sentons par la suite permettra
d&#8217;exprimer cela.
</p>
<p>3 Un analyseur de surface non d&#233;terministe avec NooJ
</p>
<p>Nous avons montr&#233; que la reconnaissance de patrons d&#233;finissant des syntagmes noyau ne pou-
vait s&#8217;appliquer directement sur une entr&#233;e ambig&#252;e. N&#233;anmoins, nous avons pu implanter avec
NooJ un analyseur qui satisfasse notre objectif de non-d&#233;terminisme et qui fonctionne en mode
reconnaissance de patrons, donc avec une certaine robustesse. La mod&#233;lisation s&#8217;appuie d&#8217;une
part sur les caract&#233;ristiques fondamentales des syntagmes noyau en fran&#231;ais, d&#8217;autre part sur la
possibilit&#233; de d&#233;finir dans NooJ des patrons qui identifient des s&#233;quences de syntagmes noyau.
</p>
<p>3.1 Caract&#233;ristiques des syntagmes noyau
</p>
<p>On s&#8217;appuie dans ce travail sur la d&#233;finition des syntagmes noyau de (Abney, 1991). Si l&#8217;on
prend cette d&#233;finition 4 au pied de la lettre, il faut reconnaitre deux mod&#232;les de syntagmes noyau
possibles:
</p>
<p>1. un mot lexical seul,
2. et une suite de un ou plusieurs mots lexicaux, pr&#233;c&#233;d&#233;e et/ou suivie de un ou plusieurs
</p>
<p>mots fonctionnels.
Dans la pratique, on s&#8217;&#233;carte un peu de cette d&#233;finition en consid&#233;rant aussi comme un syntagme
nominal noyau une suite comme belle marquise ou pauvre petit gar&#231;on, parce qu&#8217;on y reconnait
des s&#233;quences qui int&#232;greraient un m&#234;me syntagme nominal noyau si elles &#233;taient pr&#233;c&#233;d&#233;es
d&#8217;un d&#233;terminant.
</p>
<p>Muni de cette d&#233;finition stricte, on peut faire sur le fran&#231;ais deux observations int&#233;ressantes:
1. un mot fonctionnel &#224; droite du syntagme doit en principe &#234;tre li&#233; au mot lexical qui le
</p>
<p>pr&#233;c&#232;de par un tiret (donne-le-moi, ce gar&#231;on-l&#224;) 5,
2. il y a seulement deux cas o&#249; un syntagme noyau contient plusieurs mots lexicaux:
</p>
<p>(a) un adverbe dans un syntagme verbal &#224; l&#8217;infinitif (ex. pour mieux labourer),
(b) un GN ou GP avec adjectif ant&#233;pos&#233; au noyau (ex. avec la petite fille)
</p>
<p>Une cons&#233;quence qu&#8217;on peut tirer de la premi&#232;re observation est que, s&#8217;il n&#8217;est pas rattach&#233;
par un tiret &#224; sa gauche, un mot fonctionnel ouvre un syntagme noyau ou s&#8217;int&#232;gre dans un
syntagme noyau ouvert par un autre mot fonctionnel. Si on veut privil&#233;gier la lecture des mots
</p>
<p>4. I define chunks in terms of major heads. Major heads are all content words except those that appear between
a function word f and the content word that f selects. For example, proud is a major head in a man proud of his
son, but proud is not a major head in the proud man, because it appears between the function word the and the
content word man selected by the.
</p>
<p>5. Cela vaut si on analyse des mots comme durant ou except&#233; comme des participes, ce que nous faisons.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Trouilleux
</p>
<p>fonctionnels comme tels (cf. l&#8217;exemple 5), une strat&#233;gie de type &#171; reconnaissance de la plus
longue chaine &#187; sera adapt&#233;e: par exemple, &#233;tant donn&#233; avec la fille, on &#233;vitera de fermer un
syntagme apr&#232;s avec ou la. Notons que cette propri&#233;t&#233; des mots fonctionnels est &#224; la base de
l&#8217;algorithme de (Kinyon, 2001).
En ce qui concerne la deuxi&#232;me observation, nous manquons de donn&#233;es pour commenter le
premier cas, et nous nous concentrerons donc par la suite sur le second, beaucoup plus fr&#233;quent.
Pour l&#8217;heure, le point important est que la pr&#233;sence de plusieurs mots lexicaux est susceptible
de conduire &#224; une ambigu&#239;t&#233; de segmentation au niveau de la limite droite du syntagme, avant
ou apr&#232;s un mot lexical, comme brise dans l&#8217;exemple classique La petite brise la glace.
</p>
<p>3.2 Des patrons pour des s&#233;quences de syntagmes noyau
</p>
<p>NooJ permet de d&#233;clarer des automates servant &#224; la reconnaissance de patrons. Un apport es-
sentiel de NooJ dans le syst&#232;me d&#8217;analyse que nous pr&#233;sentons ici est qu&#8217;il distingue les patrons
sp&#233;cifi&#233;s par un automate et le ou les patrons annot&#233;s par cet automate. Les patrons sp&#233;cifi&#233;s
sont ceux qui &#233;tiquettent un chemin complet de l&#8217;automate (de l&#8217;&#233;tat initial &#224; l&#8217;&#233;tat final), un
patron annot&#233; est un sous-chemin commen&#231;ant par un &#233;tat &#233;tiquet&#233; &lt;X et se terminant par un
&#233;tat &#233;tiquet&#233; &gt;, avec X la cat&#233;gorie qu&#8217;on souhaite donner au syntagme 6.
Le petit automate ci-contre illustre cette possibilit&#233;: il
sp&#233;cifie le patron &lt;qui&gt; &lt;V&gt;, mais annote seulement
le patron &lt;V&gt; comme un syntagme de cat&#233;gorie NV.
Notre grammaire d&#233;finit ainsi un automate qui sp&#233;cifie des patrons annotant plusieurs syntagmes
noyau cons&#233;cutifs, en int&#233;grant les ambigu&#239;t&#233;s de segmentation possibles. La figure 1 illustre
le principe de construction de cette grammaire. On y voit l&#8217;un des graphes principaux de la
grammaire, qui non seulement annote comme PV ou NV des syntagmes, mais annote &#233;galement
d&#8217;autres syntagmes &#224; droite de ces syntagmes par les graphes PP, GNb, GR, NVb, et GA-PP.
Ces cinq graphes annotent eux-m&#234;mes selon les cas un &#224; trois autres syntagmes:
</p>
<p>&#8211; PP annote un ou deux syntagmes: un participe pass&#233;, optionnellement pr&#233;c&#233;d&#233; d&#8217;un ad-
verbe (GR), ou d&#8217;une forme du pronom tout (GN),
</p>
<p>&#8211; GNb annote un seul syntagme: un nom qui n&#8217;est pas ambigu avec un mot fonctionnel,
optionnellement pr&#233;c&#233;d&#233; d&#8217;un adjectif pr&#233;f&#233;rentiellement ant&#233;pos&#233;, lui-m&#234;me optionnel-
lement pr&#233;c&#233;d&#233; d&#8217;un adverbe,
</p>
<p>&#8211; NVb annote un syntagme NV compos&#233; d&#8217;un verbe, suivi optionnellement de clitiques,
plus, optionnellement et si le verbe est un auxiliaire, des syntagmes du graphe PP,
</p>
<p>&#8211; GR annote un syntagme compos&#233; d&#8217;un seul adverbe,
&#8211; GA-PP annote un syntagme compos&#233; d&#8217;un seul adjectif ou participe pass&#233;.
</p>
<p>Le graphe PP a pour fonction de d&#233;finir la relation sp&#233;cifique entre auxiliaire et participe pass&#233;.
Les quatre autres graphes ont pour fonction de d&#233;finir les syntagmes ne commen&#231;ant pas par un
mot fonctionnel, qu&#8217;on appellera &#171; syntagmes B &#187;. C&#8217;est avant ou apr&#232;s les mots composants
ces syntagmes qu&#8217;on peut observer une ambigu&#239;t&#233; de segmentation du type &#233;voqu&#233; dans notre
deuxi&#232;me observation ci-dessus (fin de l&#8217;alin&#233;a 3.1).
</p>
<p>6. En fait, on note &lt;E&gt;/&lt;X et &lt;E&gt;/&gt; pour indiquer qu&#8217;on a d&#8217;une part la chaine vide (&lt;E&gt;) dans la chaine
d&#8217;entr&#233;e, d&#8217;autre part le parenth&#233;sage d&#8217;un syntagme en sortie.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un analyseur de surface non d&#233;terministe pour le fran&#231;ais
</p>
<p>FIG. 1 &#8211; Graphe annotant les PV et NV infinitif + des syntagmes unaires optionnels &#224; droite
</p>
<p>Si on fait abstraction du graphe PP, la grammaire sp&#233;cifie des patrons qui annotent un syntagme
noyau commen&#231;ant par un mot fonctionnel ou non (un &#171; syntagme A &#187;), suivi optionnellement
d&#8217;un syntagme B. Ce mod&#232;le est appliqu&#233; en mode &#171; reconnaissance de la plus longue chaine &#187; ;
la grammaire d&#233;finit les transitions possibles entre syntagmes A et syntagmes B, en faisant en
sorte que les analyses qu&#8217;on veut privil&#233;gier correspondent &#224; un chemin complet plus long,
tandis que celles pour lesquelles on veut des annotations ambig&#252;es soient de m&#234;me longueur.
</p>
<p>Apr&#232;s un groupe verbal (NV ou PV) ou adverbial (GR), la grammaire autorise une transition
vers tout type de syntagme 7. Pour les autres types de syntagmes (GA, GN et GP), les conditions
qui r&#233;gissent les transitions sont les suivantes:
</p>
<p>1. Un syntagme A ayant pour noyau un mot ambigu avec un mot fonctionnel 8 n&#8217;admet pas
de transition vers un syntagme B ; on privil&#233;gie ainsi l&#8217;interpr&#233;tation de ces mots comme
fonctionnels si on peut construire un syntagme A avec eux. Par exemple, la, nom potentiel
(la note de musique), ne peut &#234;tre noyau d&#8217;un GP dans de la porte.
</p>
<p>2. Pour les syntagmes &#224; noyau nominal ou adjectival, qui sont ceux o&#249; l&#8217;ambigu&#239;t&#233; de seg-
mentation &#224; droite est possible, les transitions sont r&#233;sum&#233;es dans le tableau 1:
</p>
<p>(a) pas de transition vers un GNb apr&#232;s un GA ou apr&#232;s un GN ou GP ayant pour
noyau un adjectif (&lt;ADJ&gt;) ou une forme du pronom tout, (p.ex. on exclut &lt;GN&gt;la
petite&lt;/GN&gt; &lt;GN&gt;brise&lt;/GN&gt; ou &lt;GN&gt;tout&lt;/GN&gt; &lt;GN&gt;homme&lt;/GN&gt;)
</p>
<p>(b) si un GN ou GP n&#8217;a pas d&#8217;&#233;pith&#232;te ant&#233;pos&#233;e 9 et a pour noyau un nom non ambigu
avec un mot fonctionnel, toutes les transitions sont permises,
</p>
<p>(c) si un GN ou GP contient une &#233;pith&#232;te ant&#233;pos&#233;e &#224; un noyau nominal, l&#8217;automate
n&#8217;enregistre pas de transition vers un GNb ; on fait ainsi en sorte qu&#8217;un tel syntagme
ait la m&#234;me longueur qu&#8217;une s&#233;quence syntagme A + syntagme B. Par exemple,
</p>
<p>7. Les cat&#233;gories utilis&#233;es ici sont celles de (Gendner &amp; Vilnat, 2004), modulo les adaptations suivantes:
&#8211; on traite les NV avec participe pass&#233; (PP) comme les adjectifs ; les deux cat&#233;gories ont des distributions
proches et les NV avec participe pass&#233; sont toujours unaires ;
&#8211; NVb = groupe verbal sans mot fonctionnel &#224; gauche ;
&#8211; GNb = groupe nominal sans mot fonctionnel ni num&#233;ral ;
&#8211; GN = groupe nominal avec au moins un mot fonctionnel ou num&#233;ral.
&#8211; GP0 et GPA: voir la suite du texte.
</p>
<p>8. Information cod&#233;e dans le lexique par l&#8217;ajout d&#8217;un trait +fble pour ces mots. La contrainte n&#8217;a pas &#233;t&#233;
implant&#233;e pour les verbes mais s&#8217;applique aux adverbes (GR).
</p>
<p>9. Par &#233;pith&#232;te ant&#233;pos&#233;e, on veut dire tout type de groupe adjectival ant&#233;pos&#233; au noyau du syntagme nominal,
par exemple tr&#232;s bonne dans une tr&#232;s bonne id&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Trouilleux
</p>
<p>NVb GNb GA-PP GR
GA-PP + &#8211; + +
GN &#8211; GP &#8211; &lt;tout,PRO&gt; + &#8211; + +
</p>
<p>&#8211; &lt;ADJ&gt; + &#8211; + +
&#8211; &lt;N-fble&gt; + + + +
&#8211; &#233;pith&#232;te &lt;N&gt; &#8211; &#8211; &#8211; &#8211;
</p>
<p>GP0 &#8211; &#8211; &#8211; &#8211;
GPA &#8211; &#8211; &#8211; &#8211;
</p>
<p>TAB. 1 &#8211; Transitions entre syntagmes A &#224; noyau nominal ou adjectival (lignes) et syntagmes B
(colonnes).
</p>
<p>&lt;GN&gt;la petite brise&lt;/GN&gt; (sans transition vers un syntagme B) a la m&#234;me
longueur que &lt;GN&gt;la petite&lt;/GN&gt; &lt;NV&gt;brise&lt;/NV&gt; (synt. A + synt. B).
</p>
<p>3. On distingue par ailleurs deux cat&#233;gories de syntagmes sp&#233;cifiques:
(a) GP0 = groupes pr&#233;positionnels compos&#233;s d&#8217;une seule pr&#233;position, &#233;ventuellement
</p>
<p>pr&#233;c&#233;d&#233;e de de, par exemple il &#233;tait &lt;GP0&gt;derri&#232;re&lt;/GP0&gt; ;
ceux-ci seraient analys&#233;s comme GR dans EASY ;
</p>
<p>(b) GPA = construction du type &lt;GN&gt;un fils&lt;/GN&gt; &lt;GPA&gt;de malade&lt;/GPA&gt;,
analys&#233;e dans EASY comme &lt;GN&gt;un fils&lt;/GN&gt; de &lt;GA&gt;malade&lt;/GA&gt;.
</p>
<p>On n&#8217;enregistre aucune transition apr&#232;s ces syntagmes, c&#8217;est-&#224;-dire qu&#8217;on ne les admet
que si on ne peut pas interpr&#233;ter la s&#233;quence comme le d&#233;but d&#8217;un GP plus long.
</p>
<p>A cela s&#8217;ajoute un cas particulier: apr&#232;s une forme du pronom tout, on admet une transition sup-
pl&#233;mentaire vers un syntagme NV compos&#233; d&#8217;un clitique le et d&#8217;un verbe. Par ailleurs, pour tout
GN ou GP ayant un noyau autre que adjectif ou nom commun (adverbe, nom propre, pronom,
num&#233;ral ou participe pass&#233;), l&#8217;automate n&#8217;enregistre pas de transition vers un syntagme B.
Les transitions ont &#233;t&#233; &#233;tablies exp&#233;rimentalement sur un corpus d&#233;crit ci-apr&#232;s. Pour r&#233;sumer,
on peut dire qu&#8217;elles ont essentiellement deux fonctions: privil&#233;gier la construction des syn-
tagmes associant les mots fonctionnels &#224; un mot lexical (cf. les exemples 3, 4 et 5 ci-dessus) et
g&#233;rer les ambigu&#239;t&#233;s de segmentation &#224; droite (cf. l&#8217;exemple 2).
</p>
<p>4 Analyse de corpus
</p>
<p>Pour d&#233;finir cet analyseur, nous nous sommes appuy&#233;s sur un corpus de 22 557 mots (word
forms de NooJ), en quatre parties: Un c&#339;ur simple de Flaubert (11 581 mots, 51 %), 157
exemples extraits de l&#8217;entr&#233;e de du TLF (5 309 mots, 23,5 %), la transcription de la cassette
de Jean-Claude Mery (3 449 mots, 15,5 %), et neuf articles du journal La Tribune (2 218 mots,
10 %). Le tableau 2 donne les mesures de rappel et pr&#233;cision obtenues sur ce corpus. Il ne
s&#8217;agit en aucun cas d&#8217;une &#233;valuation globale du syst&#232;me sur texte inconnu telle qu&#8217;on la pra-
tique habituellement, mais simplement d&#8217;observations faites dans une situation contr&#244;l&#233;e sur le
corpus de d&#233;veloppement. En particulier, on s&#8217;est donn&#233; un dictionnaire id&#233;al en ajoutant les
noms propres et mots inconnus du corpus, et, comme on le voit sur le tableau, on s&#8217;est attach&#233;
&#224; obtenir un rappel le plus proche possible de 100 %. L&#8217;id&#233;e, on le rappelle, est d&#233;velopper un
outil qui permettra d&#8217;observer les ambigu&#239;t&#233;s au niveau des syntagmes noyau.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un analyseur de surface non d&#233;terministe pour le fran&#231;ais
</p>
<p>total GA-PP GN GNb GP GP0 GPA GR NV PV
possible 11144 1205 2716 175 3064 16 9 877 2754 328
effectif 14744 1334 4053 1196 3568 17 66 1140 3037 333
correct 11140 1205 2713 174 3064 16 9 877 2754 328
rappel 99,96 100 99,89 99,43 100 100 100 100 100 100
pr&#233;cision 75,56 90,33 66,94 14,55 85,87 94,12 13,64 76,93 90,68 98,50
</p>
<p>TAB. 2 &#8211; Mesures observ&#233;es sur le corpus de d&#233;veloppement.
</p>
<p>On rel&#232;ve quatre erreurs de rappel, toutes au niveau des GN-GNb. Une est anecdotique (un titre
en anglais), les trois autres se manifestent dans les deux exemples suivants:
</p>
<p>(6) En voil&#224; &lt;GN&gt;une Mme Lehoussais&lt;/GN&gt;, qui au lieu de prendre un jeune homme. . .
(7) &lt;GP&gt;De tels arguments&lt;/GP&gt; paraissent &#233;tonnants
</p>
<p>En (6) le syst&#232;me identifie un GN l&#224; o&#249; il en faudrait deux. Nous n&#8217;avons pas travaill&#233; sur cette
erreur parce qu&#8217;un syntagme compos&#233; d&#8217;un ind&#233;fini suivi d&#8217;un nom propre est possible (p.ex.
un Picasso), et surtout, on a l&#224; une phrase qui &#224; l&#8217;oral serait dite avec une intonation propre
&#224; s&#233;parer une et Mme Lehoussais, si bien qu&#8217;on serait en droit d&#8217;attendre une virgule &#224; cet
endroit. On atteint l&#224;, nous semble-t-il, le point de conflit entre exemple attest&#233; et jugement de
bonne formation. Cela &#233;tant ce cas est le seul o&#249; l&#8217;association d&#8217;un mot fonctionnel (une) &#224; un
mot lexicale est une erreur. La strat&#233;gie consistant &#224; privil&#233;gier la construction des syntagmes
associant les mots fonctionnels est donc globalement bonne 10.
</p>
<p>En (7), le syst&#232;me identifie un GP alors qu&#8217;on aurait voulu une analyse ambig&#252;e GN-GP. La
source de cette erreur est l&#8217;ambigu&#239;t&#233; de tels, DET ou ADJ. L&#8217;analyse de la s&#233;quence comme
GN est bien pr&#233;vue, mais comme il y a un adjectif ant&#233;pos&#233;, il n&#8217;y a pas &#224; sa droite de transition
vers un syntagme B, alors que l&#8217;analyse GP peut se faire avec une s&#233;quence PREP + DET +
N, qui admet une transition vers un syntagme B (ici le NV paraissent), et est donc privil&#233;gi&#233;e.
La construction de &lt;ADJ+pl&gt; &lt;N+pl&gt;, en ce qu&#8217;elle exige la combinaison de de et l&#8217;&#233;pith&#232;te
pour former un GN, pourrait peut-&#234;tre donner lieu &#224; une exception.
</p>
<p>Le chiffre de la pr&#233;cision donne une id&#233;e du r&#233;sultat qu&#8217;on peut obtenir avec une information
limit&#233;e &#224; la seule constitution interne des syntagmes, &#224; savoir un bruit assez important. La place
manque ici pour analyser les erreurs en d&#233;tail, mais on peut d&#233;j&#224; noter deux causes principales:
</p>
<p>&#8211; l&#8217;ambigu&#239;t&#233; des syntagmes commen&#231;ant par des, de ou du (GN, ou GP, ou GPA), respon-
sable d&#8217;environ 38,5% du bruit,
</p>
<p>&#8211; l&#8217;ambigu&#239;t&#233; adjectif/nom, assez syst&#233;matique dans le dictionnaire utilis&#233;: on trouve 547
GA analys&#233; comme GNb, et 238 analyses scindant un syntagme nominal avec &#233;pith&#232;te
en deux, de type &lt;GN&gt;un jeune&lt;/GN&gt; &lt;GNb&gt;homme&lt;/GNb&gt;, avec jeune comme nom.
Ces derni&#232;res erreurs produisant deux erreurs de pr&#233;cision, l&#8217;ambigu&#239;t&#233; adjectif/nom est
responsable de plus de 28% du bruit.
</p>
<p>Signalons &#233;galement que la faible pr&#233;cision obtenue pour les GR est due principalement &#224; l&#8217;am-
bigu&#239;t&#233; de comme et des interrogatifs, la grammaire ne traitant pas les conjonctions et autres
introducteurs de propositions.
</p>
<p>10. Les 100% de rappel obtenus pour GP0 en t&#233;moignent &#233;galement. On notera que la seule erreur observ&#233;e
pour les GP0 l&#8217;est dans un cas limite, o&#249; le d&#233;coupage en syntagmes noyau sans ench&#226;ssement n&#8217;est plus possible:
avec, quand m&#234;me, un probl&#232;me (cf. (Gendner &amp; Vilnat, 2004, alin&#233;a B.3)).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Trouilleux
</p>
<p>5 Conclusion
</p>
<p>Le travail que nous avons pr&#233;sent&#233; ici a mis en lumi&#232;re la difficult&#233; de la reconnaissance de
patrons sur une entr&#233;e ambig&#252;e, tout en proposant une voie d&#8217;&#233;tude alternative &#224; l&#8217;approche
paradigmatique d&#233;terministe et incr&#233;mentale de l&#8217;analyse de surface. On obtient un outil pour
l&#8217;analyse linguistique dont on esp&#232;re qu&#8217;il permettra de poser un regard neuf sur l&#8217;ambigu&#239;t&#233;
cat&#233;gorielle en pla&#231;ant l&#8217;analyse au niveau des syntagmes noyau plut&#244;t qu&#8217;au niveau des unit&#233;s
lexicales.
</p>
<p>Au-del&#224;, ce travail sugg&#232;re aussi une piste d&#8217;am&#233;lioration des logiciels. Nous avons vu que
la reconnaissance de la plus longue chaine &#233;tait adapt&#233;e pour les mots fonctionnels (cf. les
exemples 3 et 4), tandis que la reconnaissance de toutes les correspondances serait souhaitable
au niveau des mots lexicaux (cf. la petite brise la glace). On pourrait alors imaginer un nouveau
mode de reconnaissance de patrons, hybride, caract&#233;risable comme la reconnaissance de toutes
les correspondances en privil&#233;giant le rattachement des mots fonctionnels. Ces derniers pouvant
&#234;tre sp&#233;cifi&#233;s d&#233;clarativement comme une liste de cat&#233;gories particuli&#232;res, on aurait alors un
algorithme qui prendrait mieux en compte les propri&#233;t&#233;s de l&#8217;objet qu&#8217;il vise &#224; analyser.
</p>
<p>R&#233;f&#233;rences
ABNEY S. (1991). Parsing by chunks. In R. BERWICK, S. ABNEY &amp; C. TENNY, Eds.,
Principle-Based Parsing. Dordrecht: Kluwer Academic Publishers.
A&#207;T-MOKHTAR S., CHANOD J.-P. &amp; ROUX C. (2002). Robustness beyond shallowness:
incremental dependency parsing. Natural Language Engineering, 8, 121&#8211;144.
BIRD S., KLEIN E. &amp; LOPER E. (2009). Analyzing Text with Python and the Natural Lan-
guage Toolkit. http://www.nltk.org/book.
BOURIGAULT D., FABRE C., FR&#201;ROT C., JACQUES M.-P. &amp; OZDOWSKA S. (2005). Syntex,
analyseur syntaxique de corpus. In (Jardino, 2005).
CORI M. (2008). Des m&#233;thodes de traitement automatique aux linguistiques fond&#233;es sur les
corpus. Langages, 171.
GENDNER V. &amp; VILNAT A. (2004). Les annotations syntaxiques de r&#233;f&#233;rence PEAS.
http://www.limsi.fr/Recherche/CORVAL/easy/.
HINDLE D. (1994). A parser for text corpora. In B. ATKINS &amp; A. ZAMPOLLI, Eds., Compu-
tational Approaches to the Lexicon, p. 103&#8211;151. Oxford: Clarendon Press.
M. JARDINO, Ed. (2005). Actes de TALN 2005 (Traitement automatique des langues natu-
relles), Dourdan. ATALA, LIMSI.
KINYON A. (2001). A language-independent shallow-parser compiler. In ACL, p. 322&#8211;329.
ROUSSANALY A., CRABB&#201; B. &amp; PERRIN J. (2005). Premier bilan de la participation du
LORIA &#224; la campagne d&#8217;&#233;valuation EASY. In (Jardino, 2005), p. 49&#8211;52.
SILBERZTEIN M. (2004). Nooj : an oriented object approach. In J. ROYAUT&#201; &amp; M. SILBERZ-
TEIN, Eds., INTEX pour la Linguistique et le Traitement Automatique des Langues. Presses
Universitaires de Franche-Comt&#233;. http://www.nooj4nlp.net
VERGNE J. (1999). Etude et mod&#233;lisation de la syntaxe des langues &#224; l&#8217;aide de l&#8217;ordina-
teur. Analyse syntaxique automatique non combinatoire. Dossier d&#8217;habilitation &#224; diriger des
recherches. Universit&#233; de Caen.</p>

</div></div>
</body></html>