<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;tection des &#233;motions &#224; partir du contenu linguistique d&#8217;&#233;nonc&#233;s oraux : application &#224; un robot compagnon pour enfants fragilis&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009 &#8211; Session posters, Senlis, 24-26 juin 2009
</p>
<p>D&#233;tection des &#233;motions &#224; partir du contenu linguistique d&#8217;&#233;nonc&#233;s
oraux : application &#224; un robot compagnon pour enfants fragilis&#233;s
</p>
<p>Marc Le Tallec(1), Jeanne Villaneau(2), Jean-Yves Antoine(1), Agata Savary(1),
Arielle Syssau-Vaccarella(3)
</p>
<p>(1) Universit&#233; Fran&#231;ois Rabelais Tours &#8211; LI
(2) Universit&#233; Europ&#233;enne de Bretagne &#8211; VALORIA
</p>
<p>(3) Universit&#233; Montpellier 3
</p>
<p>Marc.letallec@univ-tours.fr
</p>
<p>R&#233;sum&#233; &#8211; Le projet ANR Emotirob aborde la question de la d&#233;tection des &#233;motions sous
un cadre original : concevoir un robot compagnon &#233;motionnel pour enfants fragilis&#233;s. Notre
approche consiste &#224;  combiner d&#233;tection linguistique et prosodie. Nos exp&#233;riences montrent
qu'un sujet humain peut estimer de mani&#232;re fiable la valence &#233;motionnelle d'un &#233;nonc&#233; &#224; partir
de son contenu propositionnel. Nous avons donc d&#233;velopp&#233; un premier mod&#232;le de d&#233;tection
linguistique qui repose sur le principe de compositionnalit&#233; des &#233;motions : les mots simples
ont une valence &#233;motionnelle donn&#233;e et les pr&#233;dicats modifient la valence de leurs arguments.
Apr&#232;s une description succincte du syst&#232;me logique de compr&#233;hension dont les sorties sont
utilis&#233;es pour le calcul global de l'&#233;motion, cet article pr&#233;sente la construction d'une norme
&#233;motionnelle lexicale de r&#233;f&#233;rence, ainsi que d'une ontologie de classes &#233;motionnelles de
pr&#233;dicats, pour des enfants de 5 et 7 ans.
</p>
<p>Abstract &#8211; Project ANR Emotirob aims at detecting emotions from an original point of
view: realizing an emotional companion robot for weakened children. In our approach,
linguistic detection and prosodie are combined. Our experiments show that human beings can
estimate the emotional value of an utterance from its propositional content in a reliable way.
So we have implemented a first model of linguistic detection, based on the principle that
emotions can be compound: lexical words have an emotional value while predicates can
modify emotional values of their arguments. This paper presents a short description of the
logical understanding system, the outputs of which are used for the final emotional value
calculus. Then, the creation of a lexical emotional reference standard is presented with an
ontology of emotional predicate classes for children, aged between 5 and 7.
</p>
<p>Mots-cl&#233;s &#8211; Emotion ; valence &#233;motionnelle ; norme lexicale &#233;motionnelle ;  robot
compagnon ; compr&#233;hension de parole
</p>
<p>Keywords &#8211; Emotion; Emotional valency; Emotional lexical standard; companion robot;
spoken language understanding</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le Tallec, Villaneau, Antoine, Savary, Syssau
</p>
<p>1. Projet EmotiRob : robot compagnon &#233;motionnel
Des exp&#233;riences men&#233;es au Japon (Wada et al., 2004) et poursuivies par nos soins au Centre
de Kerpape ont montr&#233; le r&#233;confort que pouvait apporter un robot compagnon (Paro :
www.paro.jp) &#224; des personnes &#226;g&#233;es ou malades. Le projet EmotiRob vise &#224; cr&#233;er un robot
compagnon peluche destin&#233; &#224; de jeunes enfants (5/7 ans) fragilis&#233;s en hospitalisation longue.
Il vise &#224; corriger la principale faiblesse relev&#233;e lors de ces exp&#233;riences: l'absence
d'expressivit&#233; du robot. Tenue dans les bras, la peluche r&#233;agit par des &#233;motions faciales et des
sons. Capable d'exprimer des &#233;motions &#233;l&#233;mentaires, le robot doit &#171;comprendre&#187; les propos de
l'enfant et d&#233;terminer son &#233;tat &#233;motionnel, pour apporter la r&#233;ponse la plus appropri&#233;e. Cet
article se concentre sur la d&#233;tection par le robot peluche des &#233;motions de l&#8217;enfant.
</p>
<p>2. D&#233;tection des &#233;motions : d&#233;finitions et &#233;tat de l&#8217;art
Tr&#232;s &#233;tudi&#233;es en psychologie cognitive, les &#233;motions n&#8217;ont retenu l&#8217;attention du TAL que dans
les ann&#233;es 70 (synth&#232;se de parole puis animation 3D). Plus r&#233;cemment, le d&#233;veloppement des
interfaces affectives a remis en avant cette question. En DHM, l&#8217;id&#233;e est d&#8217;identifier l&#8217;&#233;tat
&#233;motionnel de l&#8217;utilisateur pour adapter au mieux la r&#233;ponse du syst&#232;me : par exemple,
transf&#233;rer un appel vers un op&#233;rateur humain en cas d&#8217;&#233;nervement. En r&#232;gle g&#233;n&#233;rale, la
d&#233;tection de l&#8217;&#233;tat &#233;motionnel revient &#224; caract&#233;riser sa valence et sa modalit&#233;.
</p>
<p>2.1. Emotions : valence et modalit&#233;
</p>
<p>Il n&#8217;existe toujours pas de consensus sur la d&#233;finition d&#8217;&#233;motion ni sur sa caract&#233;risation. Il
faut souligner ici la difficult&#233; d&#8217;appr&#233;hender l&#8217;&#233;motion, &#233;tat cognitif complexe influenc&#233; par le
contexte &#224; court-terme (contexte et historique de l&#8217;interaction) comme &#224; long terme (v&#233;cu
personnel et culturel). Deux approches principales sont toutefois envisag&#233;es pour caract&#233;riser
les &#233;motions. La premi&#232;re &#233;tablit une cat&#233;gorisation nominale en classes souvent appel&#233;es
modalit&#233;s &#233;motionnelles. Ces classes varient suivant les auteurs, mais on retrouve toujours
sept modalit&#233;s principales (Ekman, 1999; Cowie, Cornelius, 2003): ce sont la col&#232;re, la joie,
le d&#233;gout, la peur, la surprise et la tristesse. La seconde approche r&#233;alise une cat&#233;gorisation
ordinale dans un espace multidimensionnel. Parmi les &#233;chelles de valeurs retenues, on trouve
le degr&#233; d&#8217;excitation ou la valence &#233;motionnelle (positif/n&#233;gatif). Cette derni&#232;re retient
l&#8217;attention des psycholinguistes qui ont montr&#233; qu&#8217;elle peut biaiser les r&#233;sultats
exp&#233;rimentaux.
</p>
<p>Deux constats peuvent &#234;tre relev&#233;es des travaux sur la cat&#233;gorisation en &#233;motions (Forbes-
Riley et al., 2004; Devillers et al., 2005; Lee, Narayanan, 2005; Callejas, Lopez-Cozar,
2008) :
1. En interaction r&#233;elle, les tours de parole ne portent majoritairement aucune &#233;motion
</p>
<p>perceptible : plus de 80% des &#233;nonc&#233;s peuvent ainsi &#234;tre qualifi&#233;s de neutres
</p>
<p>2. La perception des &#233;motions varie de mani&#232;re sensible d&#8217;une personne &#224; l&#8217;autre. Toutes les
exp&#233;riences d&#8217;annotation pr&#233;sentent des accords inter-annotateurs faibles avec des valeurs
de Kappa (Landis, Koch, 1977) comprises entre 0,32 et 0,55. Au final, une annotation de
r&#233;f&#233;rence ne peut &#234;tre obtenue que par vote majoritaire entre multiples experts.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection des &#233;motions &#224; partir du contenu linguistique d&#8217;&#233;nonc&#233;s oraux
</p>
<p>2.2. D&#233;tection des &#233;motions sur des corpus oraux ou multim&#233;dias.
</p>
<p>Au vu de cette variabilit&#233; inter-annotateur, on saisit la difficult&#233; que repr&#233;sente la d&#233;tection
automatique des &#233;motions. Les m&#233;thodes de d&#233;tection actuelles (Ververidis, Kotropoulos,
2006 ; Schuller et al., 2007) reposent sur des classifieurs qui travaillent sur des indices
paralinguistiques (acoustique, prosodie). Hormis quelques marques de disfluences, les indices
linguistiques sont rarement consid&#233;r&#233;s. Au mieux, les mots de l&#8217;&#233;nonc&#233; ne sont consid&#233;r&#233;s que
comme marqueurs lexicaux isol&#233;s. L&#8217;int&#233;gration d&#8217;indices linguistiques am&#233;liore pourtant
toujours les performances (Schuller et al., 2007). Celles-ci demeurent toutefois perfectibles :
une pertinence de 75% et une F-mesure de 0,6 constituent d&#233;j&#224; des performances de pointe.
</p>
<p>3. D&#233;tection linguistique des &#233;motions : validation d&#8217;un principe
Ainsi, la d&#233;tection linguistique des &#233;motions constitue une voie peu explor&#233;e. L&#8217;objectif de ce
projet est d&#8217;&#233;tudier si l&#8217;&#233;tude de la structure linguistique des &#233;nonc&#233;s ne pourrait pas conduire
&#224; une am&#233;lioration des performances. Nous nous limitons pour l&#8217;instant &#224; la d&#233;tection d'une
valence &#233;motionnelle positive/n&#233;gative, suivant une &#233;chelle centr&#233;e de 5 valeurs [-2 ; +2].
Nous avons cherch&#233; &#224; v&#233;rifier exp&#233;rimentalement si une telle cat&#233;gorisation linguistique &#233;tait
r&#233;alisable par un&#234;tre humain dans le contexte applicatif qui nous int&#233;resse. Aucun robot r&#233;actif
&#233;motionnel n'&#233;tant &#224; ce jour disponible, nous avons proc&#233;d&#233; au recueil d&#8217;un corpus pilote.
Collect&#233; par le laboratoire AdiCore, ce corpus se compose d&#8217;une vingtaine d&#8217;historiettes
imagin&#233;es et racont&#233;es par les enfants de CE1. Les transcriptions ont &#233;t&#233; annot&#233;es en valence
&#233;motionnelle sans &#233;coute audio, par 9 annotateurs repr&#233;sentant des groupes adulte, adolescent
et enfantin (5 &#224; 9ans). Afin d&#8217;&#233;tudier l&#8217;effet du contexte (Callejas, Lopez-Cozar, 2008), deux
annotations ont &#233;t&#233; r&#233;alis&#233;es : dans un premier temps, les &#233;nonc&#233;s ont &#233;t&#233; pr&#233;sent&#233;s dans un
ordre al&#233;atoire, ensuite ils ont &#233;t&#233; propos&#233;s en contexte en suivant la progression du r&#233;cit.
</p>
<p>Une premi&#232;re &#233;tude statistique a consist&#233; &#224; calculer le coefficient alpha de Cronbach
(Cronbach, 1951), qui teste si les annotateurs ont le m&#234;me objectif d&#8217;annotation. Dans notre
cas, sa valeur est de 0,90. Elle d&#233;montre la coh&#233;rence de l'annotation par rapport &#224; l'&#233;chelle de
valeurs choisie : c&#8217;est bien la m&#234;me r&#233;alit&#233; (la valence &#233;motionnelle) qu&#8217;ont annot&#233;e les sujets.
L&#8217;analyse des annotations montre que les adultes sont pond&#233;r&#233;s dans leur cat&#233;gorisation: 67%
des &#233;nonc&#233;s sont consid&#233;r&#233;s comme neutres. A l&#8217;oppos&#233;, les cat&#233;gorisations enfantines sont
tr&#232;s marqu&#233;es : les classes extr&#234;mes repr&#233;sentent 55% des annotations. L&#8217;influence de l&#8217;&#226;ge
sur la perception des &#233;motions est donc manifeste. Bien connue en psychologie, elle semble
ignor&#233;e en TALN. Ce r&#233;sultat se retrouve dans la mesure de l&#8217;accord inter-annotateur.   
</p>
<p>Nos classes d&#8217;annotation n&#8217;&#233;tant pas ind&#233;pendantes (&#233;chelle multivalu&#233;e), nous utilisons un
Kappa pond&#233;r&#233; : une m&#234;me annotation contribue pour 1 &#224; l&#8217;accord global, un &#233;cart d&#8217;une
&#233;chelle (exemple : neutre = 0 et positif = 1) pour 0,5, tandis qu&#8217;un &#233;cart plus grand repr&#233;sente
un d&#233;saccord. L&#8217;effet de l&#8217;&#226;ge sur l&#8217;annotation est clair : le Kappa commun &#224; l&#8217;ensemble des
sujets est faible, mais les accords g&#233;n&#233;rationnels sont bons. Chez les adultes, on observe un
Kappa moyen de 0,86 hors contexte et 0,84 en contexte. Ici, les d&#233;saccords concernent
exclusivement l'intensit&#233; de l'&#233;motion : un &#233;nonc&#233; jug&#233; positif n&#8217;est jamais jug&#233; n&#233;gatif par un
autre adulte. Le contexte semble peu influer sur la cat&#233;gorisation. Ces analyses se retrouvent
chez les adolescents, o&#249; l&#8217;accord est de 0,76 hors et en contexte. Chez les enfants, on observe
au contraire une forte variation de cat&#233;gorisation. Le Kappa est de 0,49 hors contexte et 0,38</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le Tallec, Villaneau, Antoine, Savary, Syssau
</p>
<p>en contexte. Des d&#233;saccords extr&#234;mes existent, du type -2 / +2. Ce r&#233;sultat s&#8217;explique par le
fait que l&#8217;&#226;ge des sujets variait de 5 &#224; 9 ans. Des &#233;tudes psycholinguistiques sur des normes
lexicales &#233;motionnelles (Syssau, Monnier, 2009) ont en effet montr&#233; une bascule &#233;motionnelle
marqu&#233;e &#224; 7 ans chez les filles et 9 ans chez les gar&#231;ons.
</p>
<p>Au final, ces r&#233;sultats montrent qu&#8217;un accord g&#233;n&#233;rationnel est possible, mais qu&#8217;il est
important de d&#233;velopper des syst&#232;mes adapt&#233;s &#224; des tranches d'&#226;ge assez fines.
</p>
<p>4. Mod&#232;le de d&#233;tection linguistique des &#233;motions
Il apparait ainsi qu&#8217;un humain peut d&#233;tecter de mani&#232;re assez fiable l&#8217;&#233;motion port&#233;e par un
&#233;nonc&#233; en ne consid&#233;rant que son contenu linguistique. D&#8217;o&#249; notre recherche d&#8217;une d&#233;tection
s&#8217;appuyant fortement sur ce contenu linguistique. Plus pr&#233;cis&#233;ment : (i) un mod&#232;le de
d&#233;tection linguistique consid&#232;re l&#8217;&#233;nonc&#233; dans sa dimension structurale et non pas comme un
simple sac de marqueurs lexicaux, (ii) en parall&#232;le, des indices acoustiques et prosodiques
seront consid&#233;r&#233;s par un module de d&#233;tection paralinguistique des &#233;motions non d&#233;crit dans
cet article. &#192; l&#8217;oppos&#233; d&#8217;une int&#233;gration pr&#233;coce des indices paralinguistiques et linguistiques,
nous privil&#233;gions une fusion des sorties des modules paralinguistique et linguistique.
</p>
<p>Notre mod&#232;le de d&#233;tection linguistique s&#8217;appuie sur un principe de compositionnalit&#233; de
l&#8217;&#233;motion. Nous postulons en effet que la valence &#233;motionnelle d&#8217;un &#233;nonc&#233; d&#233;pend de la
valence des mots qui le composent et de leurs relations s&#233;mantiques. On distingue : (i) les
lex&#232;mes &#233;motionnellement &#233;l&#233;mentaires, qui portent une valence donn&#233;e ; ces valences sont
d&#233;crites par une norme lexicale &#233;motionnelle pr&#233;sent&#233;e au paragraphe 5, (ii) les lex&#232;mes
pr&#233;dicatifs, dont le comportement &#233;motionnel est de modifier la valence de leurs arguments.
Le paragraphe 6 pr&#233;sente la m&#233;thodologie suivie pour leur construction. La caract&#233;risation des
relations entre les pr&#233;dicats et arguments suppose qu&#8217;on ait &#233;tabli la structure s&#233;mantique de
l&#8217;&#233;nonc&#233;. C&#8217;est la t&#226;che du syst&#232;me LOGUS pr&#233;sent&#233; au paragraphe 7.
</p>
<p>5. Norme lexicale &#233;motionnelle pour enfants de 5 &#224; 7 ans
&#192; la base de notre mod&#232;le &#233;motionnel, nous avons besoin de conna&#238;tre la valence
&#233;motionnelle qu&#8217;associent les enfants &#224; chaque mot de leur lexique. C&#8217;est l&#8217;objet des normes
lexicales &#233;motionnelles, utilis&#233;es de longue date en psychologie exp&#233;rimentale. Les normes
lexicales &#233;motionnelles compilent les &#233;valuations subjectives d&#8217;une population de juges &#224;
propos d&#8217;une ou plusieurs caract&#233;ristiques &#233;motionnelles des mots. Certaines normes
concernent des caract&#233;ristiques &#233;motionnelles originales comme l&#8217;&#233;valuation de la dur&#233;e de
l&#8217;&#233;motion &#233;voqu&#233;e par le mot (Niedenthal et al., 2004 ; Zammuner, 1998) ou encore la
dominance, c&#8217;est-&#224;-dire le fait d&#8217;&#234;tre sous le contr&#244;le de l&#8217;&#233;motion ou de contr&#244;ler l&#8217;&#233;motion
&#233;voqu&#233;e par le mot (Bradley, Lang, 1999). Mais dans toutes les normes lexicales
&#233;motionnelles, deux caract&#233;ristiques sont syst&#233;matiquement &#233;valu&#233;es : la valence et
l&#8217;intensit&#233;.
</p>
<p>Ces deux caract&#233;ristiques sont majoritairement &#233;valu&#233;es par une population adulte sur des
&#233;chelles de jugement nominales (positif, neutre, n&#233;gatif) ou ordinales (i.e., -5 tr&#232;s n&#233;gatif &#224; +5
tr&#232;s positif). A notre connaissance, seules deux normes r&#233;centes compilent les &#233;valuations
faites par de jeunes enfants : celle de Vasa, Carlino, London et Min (2006) pour l&#8217;anglais, et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection des &#233;motions &#224; partir du contenu linguistique d&#8217;&#233;nonc&#233;s oraux
</p>
<p>celle de Syssau et Monnier (2009) en langue fran&#231;aise (enfants &#226;g&#233;s de 5, 7 et 9 ans). Les
&#233;chelles de r&#233;ponse utilis&#233;es ici sont les m&#234;mes que celles utilis&#233;es avec les adultes avec de
l&#233;g&#232;res modifications. Le nombre de modalit&#233;s est r&#233;duit (3 pour l&#8217;&#233;tude de Syssau et
Monnier) et chaque modalit&#233; de r&#233;ponse est &#224; associ&#233;e &#224; un dessin repr&#233;sentant un visage
souriant, triste ou neutre. L&#8217;examen des r&#233;sultats montrent que d&#232;s 5 ans, les enfants sont
capables de juger avec un accord inter juge cons&#233;quent la valence &#233;motionnelle des mots.
Dans le cadre du projet EmotiRob, nous compl&#233;tons la norme de Syssau et Monnier par
l&#8217;&#233;valuation de la valence &#233;motionnelle de 80 nouveaux mots par des enfants de 5 et 7 ans.
Dans la norme originelle, les mots sont class&#233;s par &#226;ge d&#8217;acquisition et sont essentiellement
des noms et des adjectifs. Nous ajoutons ici de nouveaux mots extraits du lexique compil&#233; par
(Bassano et al., 2005) : cette extension pr&#233;sente l&#8217;int&#233;r&#234;t de proposer aux enfants des mots
caract&#233;ristiques de leur &#226;ge (e.g., gronder, &#233;crabouiller, rigolo) et surtout des verbes, qui
n&#8217;ont encore jamais &#233;t&#233; &#233;valu&#233;s par des enfants du point de vue de la valence &#233;motionnelle.
Pour les enfants de 5 ans, les mots ajout&#233;s sont divis&#233;s en 2 listes de 40 mots &#233;valu&#233;es dans
deux sessions diff&#233;rentes. Pour ceux de 7 ans, la liste est &#233;valu&#233;e en une seule session. A
chaque &#226;ge, deux ordres al&#233;atoires de pr&#233;sentation des mots sont d&#233;finis, chaque ordre &#233;tant
pr&#233;sent&#233; &#224; la moiti&#233; des participants. Ces exp&#233;rimentations ont &#233;t&#233; r&#233;alis&#233;es dans 4 &#233;coles &#224;
Lorient et &#224; Blois. Pour plus de renseignement sur le protocole exp&#233;rimental, on se r&#233;f&#233;rera &#224;
(Syssau, Monnier, 2009). Ces exp&#233;rimentations prendront fin en avril 2009. Nous disposerons
&#224; cette date d&#8217;une norme lexicale de r&#233;f&#233;rence pour le fran&#231;ais et pr&#233;sentant une large
couverture par rapport aux productions enfantines attendues.
</p>
<p>6. Classes de pr&#233;dicats &#233;motionnels
Une &#233;tude pilote a &#233;t&#233; r&#233;alis&#233;e pour tester la validit&#233; de notre principe de combinaison
pr&#233;dicat-argument au niveau &#233;motionnel. Nous avons extrait du corpus pr&#233;sent&#233; au paragraphe
3 un ensemble de n-uplets pr&#233;dicats-arguments (e.g., la sorci&#232;re est enferm&#233;e dans une
prison) qui ont &#233;t&#233; annot&#233;s en valence &#233;motionnelle par 4 sujets adultes. L&#8217;accord inter-
annotateur obtenu, avec le Kappa de 0,52, est tr&#232;s acceptable en classification &#233;motionnelle.
Dans notre mod&#232;le, les pr&#233;dicats sont d&#233;crits par leur comportement &#233;motionnel, i.e. leur
influence sur la valence de leurs arguments. Ainsi, le pr&#233;dicat &#233;nerv&#233; d&#233;cale la valence de son
sujet vers le c&#244;t&#233; n&#233;gatif, tandis que m&#233;chant impose la valence n&#233;gative &#224; l&#8217;&#233;nonc&#233;, quel que
soit l&#8217;argument. Nous avons recens&#233; huit classes de comportement &#233;motionnel (tableau 1).
Une fois stabilis&#233;e, cette cat&#233;gorisation sera valid&#233;e avec une cohorte d&#8217;annotateurs.
</p>
<p>Classe Exemple Calcul de la valence r&#233;sultante
Pr&#233;dicats conservant la valence d&#8217;un argument donner Val(x) = v  &#8658; Val(pred(x)) = v
Pr&#233;dicats inversant la valence d&#8217;un argument tuer Val(x) = v  &#8658; Val(pred(x)) = - v
Pr&#233;dicats renfor&#231;ant la valence d&#8217;un argument vrai Val(x) = v  &#8658; Val(pred(x)) =  2 * v
Pr&#233;dicats r&#233;duisant la valence d&#8217;un argument petit Val(x) = v  &#8658; Val(pred(x)) = v / 2
Pr&#233;dicats d&#233;calant positivement la valence aimable Val(x) = v  &#8658; Val(pred(x)) =  v + 1
Pr&#233;dicats d&#233;calant n&#233;gativement la valence &#233;nerv&#233; Val(x) = v  &#8658; Val(pred(x)) =  v &#8211; 1
Pr&#233;dicats imposant une valence positive gentil
</p>
<p> &#8704;x Val(pred(x)) = 1 | 2
Pr&#233;dicats imposant une valence n&#233;gative m&#233;chant
</p>
<p> &#8704;x Val(pred(x)) = -1 | -2
Tableau 1 &#8211; Classes pr&#233;dicatives de comportement &#233;motionnel</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le Tallec, Villaneau, Antoine, Savary, Syssau
</p>
<p>Notons enfin que le principe de combinaison pr&#233;dicats-arguments peut r&#233;soudre le probl&#232;me
de la polys&#233;mie (Le Pesant, Mathieu-Colas,1998), et donc &#233;galement celui de la d&#233;termination
de l&#8217;&#233;motion associ&#233;e &#224; un mot polys&#233;mique.
</p>
<p>7. Compr&#233;hension de la parole : adaptation du syst&#232;me LOGUS
Notre mod&#232;le de d&#233;tection linguistique des &#233;motions suppose que soient caract&#233;ris&#233;es les
relations pr&#233;dicatives internes &#224; l&#8217;&#233;nonc&#233;.  Les productions de l&#8217;enfant ne sont pas restreintes
alors que la plupart des syst&#232;mes de compr&#233;hension de parole actuels sont destin&#233;s &#224; des
applications tr&#232;s finalis&#233;es : la t&#226;che peut donc, a priori, sembler hors de port&#233;e. N&#233;anmoins, le
public concern&#233; (tr&#232;s jeunes enfants) permet de restreindre la taille du vocabulaire. Par
ailleurs, le robot &#233;motionnel ne vise pas une compr&#233;hension parfaite : on peut esp&#233;rer que la
prosodie suppl&#233;e la compr&#233;hension dans le cas de propos peu ou mal compris.
Pour r&#233;aliser cette t&#226;che, nous utilisons le syst&#232;me LOGUS fond&#233; sur une approche logique
permettant une compr&#233;hension robuste sur des t&#226;ches complexes (Villaneau et al., 2004).
LOGUS n'utilise pas de patrons s&#233;mantiques pr&#233;d&#233;finis : les associations possibles entre
concepts reposent sur une connaissance s&#233;mantique qui autorise ou non leur regroupement. Le
syst&#232;me &#233;tant originellement d&#233;di&#233; au renseignement touristique, la construction d&#8217;une
ontologie du domaine couvert par le projet EmotiRob a &#233;t&#233; effectu&#233;e. Le syst&#232;me peut
d&#233;sormais analyser la plupart des &#233;nonc&#233;s de notre corpus de d&#233;veloppement. Nous travaillons
actuellement &#224; l&#8217;impl&#233;mentation du module de calcul de valence &#233;motionnelle.
</p>
<p>8. Conclusion
Nos &#233;tudes exp&#233;rimentales sugg&#232;rent que le contenu linguistique d'un &#233;nonc&#233; peut porter une
valeur &#233;motionnelle mesurable. Nous avons mis en place les &#233;l&#233;ments n&#233;cessaires &#224; sa
d&#233;tection automatique. Il convient encore de comparer diff&#233;rents mod&#232;les de calcul global et
de v&#233;rifier nos hypoth&#232;ses sur un corpus repr&#233;sentatif. Ce module linguistique de d&#233;tection
&#233;motionnelle pourra alors &#234;tre coupl&#233; avec une analyse prosodique.
</p>
<p>Remerciements
Ce projet est financ&#233; par l&#8217;Agence Nationale de la Recherche (projet PSIROB06_174281).
</p>
<p>R&#233;f&#233;rences
BASSANO D., LABRELL F., CHAMPAUD C., et al. (2005). Le DLPF, un nouvel outil pour
l&#8217;evaluation du developpement du langage de production en francais. Enfance, 2(5):171&#8211;208.
Bradley, M. M., &amp; Lang, P. J. (1999). Fearfulness and affective evaluations of pictures.
Motivation and Emotion, 23, 1-13.CALLEJAS Z., LOPEZ-COZAR R. (2008) Influence of
contextual information in emotion annotation for spoken dialogue systems. Speech
Communication. 50. 416-433.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection des &#233;motions &#224; partir du contenu linguistique d&#8217;&#233;nonc&#233;s oraux
</p>
<p>COWIE R., CORNELIUS R. (2003) Describing the emotional states that are expressed in speech.
Speech Communication. 40. 5-32.
</p>
<p>CRONBACH L. J. (1951). Describing Coefficient alpha and the internal structure of tests.
Psychometrika. 16(3), 297-334.
DEVILLERS L., VIDRASCU L., VASILESCU I. (2005) Emotion detection in task-oriented spoken
dialogs. Journal of Neural Networks. 18(4).
EKMAN P. (1999) Patterns of  emotions: New Analysis of Anxiety and Emotion . Plenum Press.
FORBES-RILEY K., LITMAN L. (2004). Predicting emotion in spoken dialogue from multiple
knowledge sources. Proc. HLT/NAACL&#8217;2004.
</p>
<p>LANDIS J., AND KOCH G. (1977) The measurement of observer agreement for categorical data.
Biometrics, 33. 159-174.
</p>
<p>LEE C.M., NARAYANAN S. (2005) Towards detecting emotions in spoken dialogs. IEEE
Transactions On Speech and Audio Processing. 13(3). 293-303.
LE PESANT D., MATHIEU-COLAS M. (1998). Introduction aux classes d&#8217;objets. Langages
(131), Larousse, Paris, France. 6-33.
NIEDENTHAL P. M., AUXIETTE C., NUGIER A., DALLE N., BONIN P., FAYOL M. (2004). A
prototype analysis of the French category &#8220;&#233;motion&#8221;. Cognition and Emotion, 18. 289-312.
</p>
<p>SCHULLER B. et al. (2007) The Relevance of Feature Type for the Automatic Classification of
Emotional User States. Proc. Interspeech&#8217;2007, Anvers, Belgique. 2253-2256.
</p>
<p>SYSSAU A., MONNIER C. (2009). Children's emotional norms for six hundred French words.
Behavior, Research, and Methods, 41, 213-219.
</p>
<p>VERVERIDIS D., KOTROPOULOS C. (2006) Emotional Speech Recognition: Resources, features
and methods, Speech communication, 48(9). 1162-1181.
VASA R. A., CARLINO A. R., LONDON K., MIN C. (2006). Valence ratings of emotional and
non-emotional words in children. Personality and Individual Differences, 41, 1169-1180.
VILLANEAU J., RIDOUX O. ANTOINE J-Y. (2004) Logus : compr&#233;hension de l'oral spontan&#233;
Revue d'Intelligence Artificielle, 18(5-6). 709-742
WADA K., SHIBATA T., SAITO T., TANIE K.. (2004) Effects of robot-assistance activity for
elderly people and nurse at day service center. 11TH IEEE, 92:1780&#8211;1788.
</p>
<p>ZAMMUNER V.L. (1998). Concepts of emotion: Emotioness and dimensional rating of italian
emotion words. Cognition and emotion, 12, (2), 243-272.</p>

</div></div>
</body></html>