<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>ASSIST : un moteur de recherche sp&#233;cialis&#233; pour l&#8217;analyse des cadres d&#8217;exp&#233;riences</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>ASSIST : un moteur de recherche sp&#233;cialis&#233; pour l&#8217;analyse
des cadres d&#8217;exp&#233;riences
</p>
<p>Davy Weissenbacher1 Elisa Pieri2 Sophia Ananiadou1 Brian Rea1
</p>
<p>Farida Vis2 Yuwei Lin2 Rob Procter2 Peter Halfpenny2
</p>
<p>(1) National Centre for Text Mining, University of Manchester, 131 Princess
Street, M1 7DN UK
</p>
<p>(2) National Centre for e-Social Science, University of Manchester, Oxford
Rd, Manchester M13 9PL,UK
</p>
<p>{prenom.nom}@manchester.ac.uk
</p>
<p>R&#233;sum&#233;. L&#8217;analyse qualitative des donn&#233;es demande au sociologue un important tra-
vail de s&#233;lection et d&#8217;interpr&#233;tation des documents. Afin de faciliter ce travail, cette commu-
naut&#233; c&#8217;est dot&#233;e d&#8217;outils informatique mais leur fonctionnalit&#233;s sont encore limit&#233;es. Le projet
ASSIST1 est une &#233;tude exploratoire pour pr&#233;ciser les modules de traitement automatique des
langues (TAL) permettant d&#8217;assister le sociologue dans son travail d&#8217;analyse. Nous pr&#233;sentons
le moteur de recherche r&#233;alis&#233; et nous justifions le choix des composants de TAL int&#233;gr&#233;s au
prototype.
</p>
<p>Abstract. Qualitative data analysis requiers from the sociologist an important work of
selection and interpretation of the documents. To facilitate this work, several software have
been created but their functionalities are still limitated. The ASSIST project is a preliminary
work to define the natural language processing modules for helping the sociologist. We present
the search engine realised and justify the NLP modules integrated in the prototype.
</p>
<p>Mots-cl&#233;s : Recherche d&#8217;information, Extraction d&#8217;information, Terminologie.
</p>
<p>Keywords: Information Retrieval, Information Extraction, Terminology.
</p>
<p>1 L&#8217;analyse qualitative de donn&#233;es assist&#233;e par ordinateur
</p>
<p>L&#8217;analyse des &#8220;cadres de l&#8217;exp&#233;rience&#8221;, ou Frame Analysis, est une m&#233;thodologie employ&#233;e par
la sociologie. Elle a pour objet l&#8217;&#233;tude qualitative de la rh&#233;torique employ&#233;e par les diff&#233;rents
acteurs d&#8217;un d&#233;bat. Cette analyse demande un important travail d&#8217;interpr&#233;tation au sociologue.
La premi&#232;re t&#226;che consiste &#224; rassembler et &#224; trier les documents2 pertinents pour le sujet qu&#8217;il
s&#8217;est assign&#233;. Puis, au travers un processus de lectures r&#233;p&#233;t&#233;es des documents, le sociologue
construit r&#233;cursivement un ensemble d&#8217;annotations s&#233;mantiques qu&#8217;il associe manuellement aux
fragments de textes appropri&#233;s. Ces annotations sont de natures h&#233;t&#233;rog&#232;nes et peuvent &#234;tre
regroup&#233;es par ensembles coh&#233;rents. Une fois interpr&#233;t&#233;es par le sociologue, elles forment les
</p>
<p>1Voir http ://www.nactem.ac.uk/assist/ pour une pr&#233;sentation du projet.
2Le sociologue construit un corpus selon ses besoins. Le corpus peut &#234;tre compos&#233; des documents &#233;crits, audio
</p>
<p>et vid&#233;o. Notre &#233;tude se limite aux documents &#233;crits uniquement.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Weissenbacher, E. Pieri, S. Ananiadou, B. Rea, F. Vis, Y. Lin, R. Procter, P. Halfpenny
</p>
<p>cadres de lectures ou frames. Par exemple, la frame surveillance de l&#8217;&#233;tat, isol&#233;e au cours de
l&#8217;&#233;tude du d&#233;bat caus&#233; par l&#8217;introduction des cartes d&#8217;identit&#233; au Royaume-Uni3 r&#233;alis&#233;e durant
le projet ASSIST (Pieri, 2009), se voit instanti&#233;e dans le texte par les annotations Control,
Tracking, Conspiracy, ....
</p>
<p>Afin de faciliter ce travail d&#8217;interpr&#233;tation cette communaut&#233; s&#8217;est dot&#233;e d&#8217;outils informatiques
regroup&#233;s sous l&#8217;acronyme Computer Assisted Qualitative Data Analysis (CAQDAS)4. Bien
que ce soient des outils diff&#233;rents et poss&#233;dant des caract&#233;ristiques propres, ils proposent trois
fonctionnalit&#233;s communes et essentielles. La premi&#232;re est le stockage et l&#8217;administration de
documents num&#233;riques pour une &#233;tude donn&#233;e. La seconde est la mise &#224; disposition d&#8217;une in-
terface conviviale pour l&#8217;annotation des documents. La derni&#232;re fonctionnalit&#233; est fournie par
des interfaces compl&#233;mentaires qui permettent de rechercher, lier et visualiser les annotations.
</p>
<p>Si ces outils offrent des interfaces de gestions des documents et des annotations n&#233;cessaires
au travail d&#8217;interpr&#233;tation du sociologue, ils sont con&#231;us pour un traitement humain des docu-
ments. Alors que le sociologue souhaiterait &#233;tudier un nombre toujours croissant de documents
num&#233;riques, la gestion de corpus de tailles importantes (i.e. plus de 1000 documents) est diffi-
cilement support&#233;e par ces logiciels. De plus, ces logiciels int&#232;grent encore peu de techniques
issues du TAL pour automatiser ou assister le sociologue dans son travail d&#8217;annotation5. Le
projet ASSIST est une &#233;tude exploratoire afin de caract&#233;riser et d&#8217;&#233;valuer les modules du TAL
pouvant assister le sociologue dans son travail d&#8217;analyse. La section suivante d&#233;crit le syst&#232;me
r&#233;alis&#233;.
</p>
<p>2 Un moteur de recherche sp&#233;cialis&#233; pour l&#8217;analyse des frames
</p>
<p>Pour &#233;tudier la pol&#233;mique soulev&#233;e par l&#8217;introduction des cartes d&#8217;identit&#233; au Royaume-Uni,
nous avons extrait 4889 articles de journaux nationaux de la base documentaire LexisNexis6.
Notre corpus couvre la p&#233;riode 2003-2008 et a &#233;t&#233; construit &#224; partir de la requ&#234;te &#8220;ID card, Iden-
tity card, National Identity Register, National Identity scheme&#8221;. Le syst&#232;me r&#233;alis&#233; lors du projet
ASSIST est un moteur de recherche int&#233;grant diff&#233;rents modules de TAL (Rea &amp; Ananiadou,
2007). Lucene7 est au c&#339;ur de notre syst&#232;me. L&#8217;API de ce moteur de recherche offre les op&#233;ra-
teurs usuels de requ&#234;tage, i.e. les op&#233;rateurs bool&#233;ens et les caract&#232;res joker. Nous avons d&#233;fini
de nouveaux op&#233;rateurs capables de requ&#234;ter les m&#233;tadonn&#233;es extraites des articles (i.e. titres,
auteurs, dates de publication et sources) et d&#8217;interroger les informations s&#233;mantiques ajout&#233;es
par les modules de TAL. Lingo, un algorithme de clustering non-supervis&#233;8 , a &#233;t&#233; ajout&#233; pour
classer les documents retourn&#233;s en r&#233;ponse &#224; une requ&#234;te donn&#233;e. Ces deux composants sont
importants puisqu&#8217;ils simplifient le travail initial de filtrage des documents pour toute nouvelle
&#233;tude. Un module de reconnaissance des Entit&#233;s Nomm&#233;es (EN) a &#233;t&#233; int&#233;gr&#233; au syst&#232;me en
vue de faciliter la lecture du sociologue en r&#233;v&#233;lant les acteurs et les lieux principaux des do-
</p>
<p>3Un r&#233;sum&#233; de l&#8217;&#233;tude est disponible &#224; l&#8217;adresse : http ://www.ncess.ac.uk/research/hub_research/idcards/
4Un inventaire des outils peut &#234;tre consult&#233; &#224; l&#8217;adresse http ://caqdas.soc.surrey.ac.uk/
5A notre connaissance, le plus complet est l&#8217;add-on Wordstat adjoint au logiciel QDA Miner. Gr&#226;ce &#224; un anti-
</p>
<p>dictionnaire de mots outils, une lemmatisation et un clustering des documents, l&#8217;add-on am&#233;liore le calcul des
fr&#233;quences des mots et facilite la recherche des annotations.
</p>
<p>6Sous r&#233;serve du respect des droits de propri&#233;t&#233; intellectuelle, cette base est accessible &#224; l&#8217;adresse
http ://w3.nexis.com/sources/
</p>
<p>7Une documentation de l&#8217;API est disponible &#224; l&#8217;adresse http ://lucene.apache.org/java/docs/
8Nous avons utilis&#233; l&#8217;impl&#233;mentation de l&#8217;algorithme disponible dans l&#8217;API Carrot2, largement document&#233;e &#224;
</p>
<p>l&#8217;adresse http ://project.carrot2.org/.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ASSIST: un moteur de recherche sp&#233;cialis&#233; pour l&#8217;analyse des cadres d&#8217;exp&#233;riences
</p>
<p>cuments. Les classes de l&#8217;enamex9 sont trop g&#233;n&#233;rales pour d&#233;finir des op&#233;rateurs s&#233;mantiques
pr&#233;cis et utiles. Nous avons donc s&#233;lectionn&#233; un sous-ensemble de cat&#233;gories adapt&#233;es &#224; notre
sujet10 parmi les cat&#233;gories d&#8217;EN d&#233;finies par (Sekine &amp; Nobata, 2004). Nous avons ensuite en-
tra&#238;n&#233; un module de reconnaissance d&#8217;EN probabiliste reposant sur les Champs Conditionnels
Al&#233;atoires (Okanohara et al., 2006) pour annoter et indexer les EN de notre corpus. Un module
d&#8217;extraction de termes, TerMine(Frantzi et al., 2000), vient compl&#233;ter le pr&#233;c&#233;dant module en
calculant les concepts les plus saillants dans notre corpus (ex. &#8220;illegal immigration&#8221; ou &#8220;DNA
database&#8221;). Les termes traduisent les th&#232;mes des documents et sont, de fait, appropri&#233;s pour
la classification et la recherche de documents similaires. Le module d&#8217;analyse des sentiments,
nomm&#233; HYSEAS (Piao et al., 2009), est employ&#233; pour estimer automatiquement l&#8217;opinion de
l&#8217;auteur regardant un fait ou un &#233;v&#233;nement narr&#233; dans son article. Le module applique un lexique
subjectif pour reconna&#238;tre la tonalit&#233; des mots pr&#233;sents dans une phrase (ex. intrude : fortement
n&#233;gatif, achieve : faiblement positif) et utilise un scoreur pour attribuer un score g&#233;n&#233;ral &#224; la
phrase. Ce module souligne les passages r&#233;thoriques d&#8217;un document et, dans le contexte de
cette &#233;tude, devrait faciliter l&#8217;&#233;tude des arguments avanc&#233;s par les opposants et les partisans de
la carte d&#8217;identit&#233;.
</p>
<p>3 Conclusion
</p>
<p>Dans cet article nous signalons le besoin de logiciels adapt&#233;s &#224; l&#8217;analyse qualitative de do-
cuments textuels. Le projet ASSIST est une premi&#232;re r&#233;ponse. Travaillant sur une application
concr&#232;te, l&#8217;analyse du d&#233;bat autour de l&#8217;introduction des cartes d&#8217;identit&#233; au Royaume-Uni, nous
avons s&#233;lectionn&#233; puis int&#233;gr&#233; &#224; un moteur de recherche un ensemble de modules de TAL pour
faciliter l&#8217;acc&#232;s au contenu des documents. Le syst&#232;me est actuellement en cours d&#8217;&#233;valuation.
</p>
<p>R&#233;f&#233;rences
</p>
<p>FRANTZI K., ANANIADOU S. &amp; MIMA H. (2000). Automatic recognition of multi-word
terms. International Journal of Digital Libraries, 3(2), pp.117&#8211;132.
OKANOHARA D., MIYAO Y., TSURUOKA Y. &amp; TSUJII J. (2006). Improving the scalability
of semi-markov conditional random fields for named entity recognition. In Proceedings of
COLING/ACL.
</p>
<p>PIAO S., TSURUOKA Y. &amp; ANANIADOU S. (2009). HYSEAS : A HYbrid SEntiment Analysis
System. Rapport interne, National Center for Text Mining (NaCTeM).
</p>
<p>PIERI E. (2009). The introduction of id cards in the uk : A snapshot of the debate in the press.
In Panel on Media, Communication and Cultural Studies Association Conference (MeCCSA).
</p>
<p>REA B. &amp; ANANIADOU S. (2007). Text mining services to support e-research. In UK e-
Science All Hands Meeting.
</p>
<p>SEKINE S. &amp; NOBATA C. (2004). Definition, dictionaries and tagger for extended named
entity hierarchy. In Conference on Language Resources and Evaluation.
</p>
<p>9e.i. les noms de personnes, d&#8217;organisations, de lieux et les r&#233;f&#233;rences num&#233;riques.
10Par exemple la classes des c&#233;l&#233;brit&#233;s comme Tony Blair ou celle des personnages de fiction comme Big Brother
</p>
<p>qui occupent un r&#244;le important dans notre corpus.</p>

</div></div>
</body></html>