<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Donn&#233;es bilingues pour la TAS fran&#231;ais-anglais : impact de la langue source et direction de traduction originales sur la qualit&#233; de la traduction</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Donn&#233;es bilingues pour la TAS fran&#231;ais-anglais : impact de la
langue source et direction de traduction originales sur la
</p>
<p>qualit&#233; de la traduction
</p>
<p>Sylwia Ozdowska
National Centre for Language Technology &#8211; Dublin City University
</p>
<p>Glasnevin, Dublin 9, Ireland
sozdowska@computing.dcu.ie
</p>
<p>R&#233;sum&#233;. Dans cet article, nous prenons position par rapport &#224; la question de la qualit&#233; des
donn&#233;es bilingues destin&#233;es &#224; la traduction automatique statistique en terme de langue source
et direction de traduction originales &#224; l&#8217;&#233;gard d&#8217;une t&#226;che de traduction fran&#231;ais-anglais. Nous
montrons que l&#8217;entra&#238;nement sur un corpus contenant des textes qui ont &#233;t&#233; &#224; l&#8217;origine traduits
du fran&#231;ais vers l&#8217;anglais am&#233;liore la qualit&#233; de la traduction. Inversement, l&#8217;entra&#238;nement sur
un corpus contenant exclusivement des textes dont la langue source originale n&#8217;est ni le fran&#231;ais
ni l&#8217;anglais d&#233;grade la traduction.
</p>
<p>Abstract. In this paper, we argue about the quality of bilingual data for statistical machine
translation in terms of the original source language and translation direction in the context of
a French to English translation task. We show that data containing original French and English
translated from French improves translation quality. Conversely, using data comprising exclusi-
vely French and English translated from several other languages results in a clear-cut decrease
in translation quality.
</p>
<p>Mots-cl&#233;s : Traduction automatique statistique, corpus bilingue, direction de la traduc-
tion, langue source, langue cible.
</p>
<p>Keywords: Statistical machine translation, bilingual corpus, translation direction, source
language, target language.
</p>
<p>1 Introduction
</p>
<p>La traduction automatique statistique (TAS) s&#8217;appuie sur l&#8217;id&#233;e qu&#8217;il est possible d&#8217;apprendre
&#224; partir de corpus les donn&#233;es n&#233;cessaires &#224; la traduction automatique sous forme d&#8217;un mod&#232;le
de langue et d&#8217;un mod&#232;le de traduction. Le mod&#232;le de langue est estim&#233; &#224; partir d&#8217;un corpus
monolingue dans la langue vers laquelle s&#8217;effectue la traduction. Le mod&#232;le de traduction est
estim&#233; &#224; partir d&#8217;un corpus bilingue qui contient des textes en relation de traduction. Aucune
importance ne semble &#234;tre accord&#233;e &#224; l&#8217;ad&#233;quation entre la direction de traduction repr&#233;sent&#233;e
dans le corpus d&#8217;apprentissage et la direction de traduction dans laquelle le syst&#232;me est destin&#233;
&#224; op&#233;rer. Dans cet article, nous nous positionnons par rapport la pertinence de cette question
dans le cadre de l&#8217;entra&#238;nement d&#8217;un syst&#232;me de TAS traduisant du fran&#231;ais vers l&#8217;anglais. Nous
faisons le point sur la composition des corpus bilingues en terme de langue originale et de
direction de traduction (section 2) avant de voir quel &#233;cho ces notions trouvent dans le contexte</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylwia Ozdowska
</p>
<p>de la recherche en TAS et dans celui des &#233;tudes sur la traduction (section 3). Ensuite, nous
situons notre cadre exp&#233;rimental (section 4) et pr&#233;sentons les r&#233;sultats d&#8217;exp&#233;riences (section 5)
sur lesquels nous nous appuyons pour prendre position et conclure (section 6).
</p>
<p>2 Corpus bilingue
</p>
<p>Du point de vue des langues en pr&#233;sence dans le corpus, dans le cas le plus simple le corpus
bilingue est compos&#233; de textes qui ont &#233;t&#233; originellement traduits de la langue A vers la langue B
de sorte que la partie B du corpus est la traduction directe de la partie A. On dira dans ce cas que
A est la langue source (LS) originale, B &#233;tant la langue cible (LC) par rapport &#224; A. Dans des cas
plus complexes, il peut arriver que certains textes aient &#233;t&#233; &#224; l&#8217;origine traduits de la langue A vers
la langue B et certains autres dans la direction oppos&#233;e, &#224; savoir de B vers A, et/ou que d&#8217;autres
langues aient &#233;t&#233; impliqu&#233;es dans le processus de traduction de sorte que tout ou partie des textes
en langue A et tout ou partie des textes en langue B ont &#233;t&#233; traduits &#224; partir d&#8217;une ou plusieurs
autres langues. Dans ce cas, la partie du corpus correspondant &#224; la langue A (resp. B) m&#233;lange
LS originale A (resp. B), langue A (resp. B) cible de B (resp. A) et langue A (resp. B) cible
d&#8217;une autre langue que B (resp. A). Les corpus multilingues de langues europ&#233;ennes comme
Europarl (Koehn, 2005)1 ou l&#8217;Acquis Communautaire (Steinberger et al., 2006)2, largement
exploit&#233;s dans le domaine de la TAS, rel&#232;vent de ce cas de figure. Ils rassemblent en effet
des textes produits au sein d&#8217;institutions europ&#233;ennes ; ces textes peuvent avoir &#233;t&#233; formul&#233;s
&#224; l&#8217;origine dans n&#8217;importe laquelle des langues officielles avant d&#8217;&#234;tre traduits dans toutes les
autres langues.
</p>
<p>Du point de vue de la TAS, &#233;tant donn&#233; un corpus bilingue contenant des textes en langue A
et une version correspondante en langue B, l&#8217;entra&#238;nement d&#8217;un syst&#232;me visant &#224; traduire de la
langue A vers la langue B s&#8217;effectue en posant A comme LS et B comme LC ind&#233;pendemment
du statut de ces deux langues dans le processus de traduction original (LS originale et LC en
relation de traduction directe, langues cibles d&#8217;une LS tierce en relation de traduction indirecte)
et donc dans le corpus d&#8217;entra&#238;nement. Autremement dit, pour apprendre &#224; traduire de A vers B,
un syst&#232;me de traduction ne s&#8217;appuie pas n&#233;cessairement sur des textes effectivement traduits
de A vers B. Cela revient &#224; dire que la qualit&#233; de la traduction automatique d&#8217;une langue A vers
une langue B ne serait pas corr&#233;l&#233;e avec le statut effectif des langues A et B dans le corpus
d&#8217;apprentissage, i.e. la direction de traduction originale telle que refl&#233;t&#233;e dans le corpus. Cette
non prise en compte de la composition des corpus bilingues en terme du statut des langues
transpara&#238;t dans l&#8217;absence de r&#233;ferences &#224; la question dans le contexte de la recherche en TAS.
</p>
<p>3 Travaux apparent&#233;s
</p>
<p>Bien que la th&#233;matique de la langue originale vs. langue de traduction, et plus largement celle
de la directionnalit&#233; et reversibilit&#233; du processus traduction, occupe une place importante dans
les travaux sur la traduction, elle semble avoir &#233;t&#233; presque compl&#232;tement n&#233;glig&#233;e dans le do-
maine de la recherche en TAS. Dans ce dernier, les seuls travaux que l&#8217;on pourrait rattacher &#224; la
question pos&#233;e dans cet article sont ceux portant sur la mise au point de syst&#232;mes de TAS par
pivot, notamment dans le cas de langues pour lesquelles il n&#8217;existe que peu ou pas de donn&#233;es
</p>
<p>1http://www.iccs.inf.ed.ac.uk/\~pkoehn/publications/europarl/
2http://wt.jrc.it/lt/Acquis/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Donn&#233;es bilingues pour la TAS fran&#231;ais-anglais
</p>
<p>bilingues (Wu &amp; Wang, 2007). Le principe est de construire un mod&#232;le de traduction pour A et
B &#224; partir d&#8217;un mod&#232;le de traduction pour A et P et d&#8217;un mod&#232;le de traduction pour P et B. Bien
qu&#8217;il n&#8217;en soit fait aucune mention, ce type de travaux semble sugg&#233;rer que pour traduire entre
deux langues, l&#8217;existence d&#8217;un lien de traduction direct (et orient&#233; dans le m&#234;me sens que celui
vis&#233; par la traduction) entre ces langues dans les donn&#233;es d&#8217;apprentissage n&#8217;est pas essentiel.
</p>
<p>Dans le contexte des recherches sur la traduction, W. Teubert (1996) souligne qu&#8217;&#233;tant donn&#233; un
texte en langue A et ses traductions en langues B et C, chacune de ces derni&#232;res est susceptible
de pr&#233;senter plus de similitudes (syntaxiques, lexicales et s&#233;mantiques) avec la version A qu&#8217;il
n&#8217;y en aurait entre elles. Globalement, il semble y avoir un consensus par rapport au fait que
les textes traduits ne devraient pas &#234;tre consid&#233;r&#233;es comme des ressources bidirectionnelles et
r&#233;versibles (Bowker, 2003), ce qui laisse &#224; penser que le statut des langues dans les donn&#233;es
bilingues pourrait avoir un impact sur la qualit&#233; de la TAS.
</p>
<p>La question de l&#8217;ad&#233;quation des donn&#233;es d&#8217;apprentissage vis a vis de la t&#226;che de traduction vi-
s&#233;e du point de vue du lien de traduction (direct ou indirect) entre les langues en pr&#233;sence et de
son orientation semble donc l&#233;gitime. &#192; cet &#233;gard, l&#8217;hypoth&#232;se en faveur de laquelle nous argu-
mentons et prenons position en nous appuyant sur des r&#233;sultats d&#8217;exp&#233;riences en TAS va dans le
sens des propos de W. Teubert mention&#233;s ci-dessus. Nous pensons en effet que le recours &#224; des
donn&#233;es bilingues dans lesquelles le statut traductionnel des langues A et B est en ad&#233;quation
avec la direction de traduction test&#233;e constituent les conditions d&#8217;entra&#238;nement optimales pour
ce qui est de la qualit&#233; de la TAS de A vers B telle que mesur&#233;e automatiquement &#224; l&#8217;aide de
m&#233;triques quantitatives standard. Dans ce qui suit, la qualit&#233; des donn&#233;es n&#8217;est pas envisag&#233;e
per se mais &#224; l&#8217;&#233;gard des r&#233;sultats d&#8217;une t&#226;che de traduction de A vers B &#233;valu&#233;e automatique-
ment ; nous partons donc du principe que des donn&#233;es qui am&#233;liorent les scores de traduction
sont de meilleure qualit&#233; pour la t&#226;che de traduction envisag&#233;e.
</p>
<p>Pour v&#233;rifier cette hyptoh&#232;se et justifier notre prise de position, nous mettons en place un cadre
exp&#233;rimental qui nous permet de comparer plusieurs configurations d&#8217;un m&#234;me syst&#232;me de
TAS &#233;tat de l&#8217;art &#224; base de segments. Ces configurations ne diff&#232;rent qu&#8217;en terme de la LS
originale en fonction de laquelle sont selectionn&#233;es les donn&#233;es d&#8217;apprentissage et de test. La
comparaison se fait sur la base de la qualit&#233; de la traduction du fran&#231;ais vers l&#8217;anglais obtenue
avec les diff&#233;rentes configurations et mesur&#233;e automatiquement.
</p>
<p>4 Donn&#233;es et outils de l&#8217;exp&#233;rience
</p>
<p>Les exp&#233;riences que nous pr&#233;sentons s&#8217;appuient sur une version des parties fran&#231;aise et anglaise
du corpus Europarl. Pour chaque couple de phrases align&#233;es, nous disposons de l&#8217;information
indiquant la langue dans laquelle la phrase a &#233;t&#233; originellement produite. Ainsi, sur les 1 391 222
bi-phrases du corpus, 164 648 au minimum ont &#233;t&#233; &#224; l&#8217;origine traduites du fran&#231;ais vers l&#8217;anglais
et 235 102 au minimum dans le sens inverse3. &#192; partir de ce corpus, nous avons extrait quatre
sous-corpus selon diff&#233;rents crit&#232;res quant &#224; la LS originale et entra&#238;n&#233; les configurations de
TAS fran&#231;ais-anglais correspondantes.
</p>
<p>config-1 Aucune condition sur la LS originale n&#8217;a &#233;t&#233; impos&#233;e, autrement dit la partie fran&#231;aise
du sous-corpus et la partie anglaise correspondante contiennent respectivement:
&#8211; du fran&#231;ais traduit d&#8217;une langue autre que l&#8217;anglais, du fran&#231;ais traduit directement de l&#8217;an-
</p>
<p>glais ainsi que du fran&#231;ais original ;
</p>
<p>3La LS originale n&#8217;est pas connue ou sp&#233;cifi&#233;e pour toutes les bi-phrases.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylwia Ozdowska
</p>
<p>&#8211; de l&#8217;anglais traduit d&#8217;une langue autre que le fran&#231;ais, de l&#8217;anglais traduit directement de
l&#8217;anglais ainsi que de l&#8217;anglais original.
</p>
<p>config-2 La LS originale n&#8217;est ni le fran&#231;ais ni l&#8217;anglais, i.e. le corpus contient :
&#8211; du fran&#231;ais traduit d&#8217;une langue autre que l&#8217;anglais ;
&#8211; de l&#8217;anglais traduit d&#8217;une langue autre que le fran&#231;ais.
</p>
<p>config-3 La LS originale est l&#8217;anglais, i.e. le corpus contient :
&#8211; du fran&#231;ais traduit directement de l&#8217;anglais ;
&#8211; de l&#8217;anglais original.
</p>
<p>config-4 La LS originale est le fran&#231;ais, i.e. le corpus contient :
&#8211; du fran&#231;ais original ;
&#8211; de l&#8217;anglais traduit directement un fran&#231;ais.
</p>
<p>Chaque configuration est entra&#238;n&#233;e sur 100 000 phrases et test&#233;e sur 500 phrases. Les deux
ensembles sont disjoints. Le m&#234;me crit&#232;re de s&#233;lection en terme de LS originale vaut pour
les donn&#233;es d&#8217;entra&#238;nement et de test. Chaque configuration dispose donc de donn&#233;es de test
individuelles qui lui sont propres et qui sont diff&#233;rentes de celles des autres configurations ; nous
les appelons test-500. Dans un second temps, nous &#233;valuons &#233;galement chaque configuration sur
un m&#234;me jeu de test r&#233;sultant de l&#8217;union des tests individuels et contenant 2000 phrases. Nous
parlerons dans ce cas de test-2000.
</p>
<p>Toutes nos exp&#233;riences de traduction du fran&#231;ais &#224; l&#8217;anglais sont effectu&#233;es avec des outils &#233;tat
de l&#8217;art disponibles publiquement. Les bi-phrases de chaque corpus d&#8217;entra&#238;nement sont ali-
gn&#233;es au niveau des mots suivant le mod&#232;le IBM 4 (Brown et al., 1993; Och &amp; Ney, 2003) im-
pl&#233;ment&#233; dans GIZA++4. Le mod&#232;le de traduction est extrait sur la base de ces alignements avec
le syst&#232;me Moses (Koehn et al., 2003; Koehn et al., 2007)5. Le mod&#232;le de langue 5-grammes
pour l&#8217;anglais est obtenu gr&#226;ce &#224; l&#8217;outil SRLIM (Stolcke, 2002)6. Le d&#233;codage est effectu&#233; avec
Moses. La qualit&#233; de la traduction est &#233;valu&#233;e automatiquement avec trois m&#233;triques standard :
BLEU (Papineni et al., 2002), NIST (Doddington, 2002) et METEOR (Banerjee &amp; Lavie, 2005).
</p>
<p>5 R&#233;sultats de l&#8217;exp&#233;rience
</p>
<p>Comme dit pr&#233;c&#233;demment, nous nous int&#233;ressons &#224; l&#8217;impact de l&#8217;utilisation en TAS de corpus
bilingues dont la partie source en langue A contient effectivement des textes produits &#224; l&#8217;origine
dans la langue A, i.e. il y dans ce cas ad&#233;quation entre la direction de traduction originale et
la direction de traduction pour laquelle le syst&#232;me est entra&#238;n&#233;, vs. des corpus bilingues dans
lesquels cette condition d&#8217;ad&#233;quation n&#8217;est que partiellement ou pas v&#233;rifi&#233;e.
</p>
<p>Le tableau 1 pr&#233;sente les r&#233;sultats de nos exp&#233;riences sur test-500 et test-2000 (la r&#233;f&#233;rence
est unique ; les scores maximum sont en gras et les scores minimum en italique). Nous analy-
sons tout d&#8217;abord les r&#233;sultats obtenus par chaque configuration sur son test-500 respectif. Les
tendances observ&#233;es restent les m&#234;mes quels que soient le syst&#232;me et la m&#233;trique d&#8217;&#233;valuation
consid&#233;r&#233;s. En terme de BLEU par exemple, on observe une consid&#233;rable augmentation abso-
lue en qualit&#233; de traduction, soit 0.0956, lorsque l&#8217;on passe de config-2 &#224; config-4. Config-2,
qui est la moins performante, correspond &#224; un entra&#238;nement sur le corpus dont les deux parties
</p>
<p>4http://www.clsp.jhu.edu/ws99/projects/mt/toolkit/
5http://www.statmt.org/moses/
6http://www.speech.sri.com/projects/srilm/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Donn&#233;es bilingues pour la TAS fran&#231;ais-anglais
</p>
<p>test-500 test-2000
configuration BLEU NIST METEOR BLEU NIST METEOR
config-1 0.2608 5.9771 0.5758 0.2542 6.4797 0.5646
config-2 0.2008 5.1531 0.4867 0.2424 6.3211 0.5525
config-3 0.2857 6.4717 0.6082 0.2520 6.5385 0.5558
config-4 0.2964 6.5502 0.6162 0.2500 6.4331 0.5681
</p>
<p>TAB. 1 &#8211; &#201;valuation sur les tests individuels test-500 et le test unique test-2000
</p>
<p>fran&#231;aise et anglaise sont traduites &#224; partir de plusieurs langues tierces. Config-4, qui est la plus
performante, a &#233;t&#233; entra&#238;n&#233;e sur un corpus dans lequel l&#8217;anglais est une traduction directe du
fran&#231;ais. Ces r&#233;sultats tendent &#224; confirmer notre hypoth&#232;se, &#224; savoir que des donn&#233;es dont la
LS originale est le fran&#231;ais sont optimales pour entra&#238;ner un syst&#232;me de TAS du fran&#231;ais vers
l&#8217;anglais. Par ailleurs, il semblerait que le recours &#224; des donn&#233;es comprenant du fran&#231;ais et de
l&#8217;anglais en relation de traduction indirecte constituent les moins bonnes conditions d&#8217;entra&#238;ne-
ment. On peut supposer que le statut de langue traduite, qui de plus est &#224; partir de diff&#233;rentes
langues sources, conf&#232;re au corpus des caract&#233;ristiques particuli&#232;res, par exemple en termes de
r&#233;gularit&#233;s et divergeances entre les deux langues en pr&#233;sence, qui rendent la g&#233;n&#233;ralisation sur
les donn&#233;es plus ardue et affecte donc la qualit&#233; de l&#8217;apprentissage.
</p>
<p>Si on regarde maintenant les r&#233;sultats sur test-2000, on remarque premi&#232;rement que les diff&#233;-
rentes m&#233;triques donnent des r&#233;sultats conflictuels. Le seul r&#233;sultat coh&#233;rent d&#8217;une m&#233;trique &#224;
l&#8217;autre, ainsi qu&#8217;avec les &#233;valuations individuelles, est celui concernant config-2 qui obtient les
moins bonnes performances, &#224; savoir 0.2424 BLEU. Pour ce qui est de config-4, elle se classe
premi&#232;re uniquement en fonction de METEOR. Autrement dit, config-3 produit de meilleurs
r&#233;sultats que config-4 si on ne tient pas compte de METEOR et config-1 produit de meilleurs
r&#233;sultats que config-3 si on ne tient pas compte de NIST. Cependant, les meilleurs scores sur
test-2000 restent inf&#233;rieurs aux scores obtenus par config-4 sur son test individuel, par exemple
0.2542 vs. 0.2964 pour le meilleur BLEU.
</p>
<p>6 Conclusion
</p>
<p>Nous avons soulev&#233; la question de la relation entre la qualit&#233; des donn&#233;es bilingues destin&#233;es
&#224; la TAS en terme de langue source et direction de la traduction originales et la qualit&#233; de la
traduction automatique fran&#231;ais-anglais issue de l&#8217;entra&#238;nement sur ces donn&#233;es. Les r&#233;sultats
montrent que le recours &#224; des donn&#233;es o&#249; les parties fran&#231;aise et anglaise ne sont pas en relation
de traduction directe d&#233;gradent la qualit&#233; de la traduction. Le recours &#224; des donn&#233;es produites
originellement dans la m&#234;me direction de traduction que celle effectu&#233;e par le syst&#233;me s&#8217;av&#232;re
optimal dans le cas de l&#8217;&#233;valuation sur des tests individuels s&#233;lectionn&#233;s sur les m&#234;mes crit&#232;res
de langue source originale que les donn&#233;es d&#8217;entra&#238;nement. Les r&#233;sultats sur le test unique ne
sont cependant pas conclusifs.
</p>
<p>Les r&#233;sultats obtenus sugg&#232;rent que les syst&#232;mes de TAS pourraient b&#233;n&#233;ficier d&#8217;un l&#8217;entra&#238;ne-
ment sur des donn&#233;es qui respectent la m&#234;me direction de traduction que celle dans laquelle ils
sont cens&#233;s op&#233;rer. M&#234;me si elles indiquent une piste int&#233;ressante, les diff&#233;rences quantitatives
dans les scores ne sauraient &#234;tre r&#233;ellement interpr&#233;t&#233;es comme un mieux au niveau de la qualit&#233;
de la traduction que gr&#226;ce &#224; une v&#233;ritable &#233;tude qualitative des r&#233;sultats, incluant une corr&#233;lation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylwia Ozdowska
</p>
<p>avec des &#233;valuations humaines, pour identifier et expliquer les ph&#233;nom&#232;nes en jeu.
</p>
<p>Jusque-l&#224; n&#233;glig&#233;e, la question de l&#8217;impact de la qualit&#233; des donn&#233;es d&#8217;entra&#238;nement sur les
performances de la TAS devrait selon nous &#234;tre &#233;tudi&#233;e au m&#234;me titre que celui de leur quantit&#233;.
Elle ouvre en effet des perspectives de recherche int&#233;ressantes, autant dans de la domaine de
la TAS que dans celui des &#233;tudes sur la traduction. On peut notamment se demander pourquoi,
d&#8217;un point de vue traductionnel, la relation d&#8217;&#233;quivalence n&#8217;est pas tout &#224; fait r&#233;versible ou
encore pourquoi les syst&#232;mes de TAS sont sensibles &#224; cette dyssym&#233;trie.
</p>
<p>R&#233;f&#233;rences
BANERJEE S. &amp; LAVIE A. (2005). METEOR: An Automatic Metric for MT Evaluation with Im-
proved Correlation with Human Judgments. In Proceedings of Workshop on Intrinsic and Extrinsic
Evaluation Measures for MT and/or Summarization at the 43th Annual Meeting of the Association of
Computational Linguistics (ACL-05), p. 65&#8211;72, Ann Arbor, MT.
</p>
<p>BOWKER L. (2003). Investigate &#8216;reversible&#8217; translation resources: are they equally useful in both
translation directions ? In L. P. GONZ&#193;LES, Ed., Speaking in Tongues: Language across Contexts
and Users, p. 201&#8211;224.
</p>
<p>BROWN P. F., PIETRA S. A. D., PIETRA V. J. D. &amp; MERCER R. L. (1993). The Mathematics of
Statistical Machine Translation: Parameter Estimation. Computational Linguistics, 19(2), 263&#8211;311.
DODDINGTON G. (2002). Automatic Evaluation of Machine Translation Quality Using N-gram Co-
Occurrence Statistics. In Human Language Technology: Notebook Proceedings, p. 128&#8211;132, San Diego,
CA.
</p>
<p>KOEHN P. (2005). Europarl: A Parallel Corpus for Statistical Machine Translation. In Proceedings of
the 10th Machine Translation Summit, p. 79&#8211;86, Phuket, Tha&#239;lande.
</p>
<p>KOEHN P., HOANG H., BIRCH A., CALLISON-BURCH C., FEDERICO M., BERTOLDI N., B. CO-
WAN W. S., MORAN C., ZENS R., DYER C., BOJAR O., CONSTANTIN A., &amp; HERBST E. (2007).
Moses: Open source toolkit for statistical machine translation. In Annual Meeting of the Association for
Computational Linguistics (ACL), demonstration session, p. 177&#8211;180, Prague, R&#233;publique Tch&#232;que.
</p>
<p>KOEHN P., OCH F. &amp; MARCU D. (2003). Statistical Phrase-Based Translation. In Proceedings of the
Conference of the North American Chapter of the Association for Computational Linguistics on Human
Language Technology (NAACL&#8217;03), p. 48&#8211;54, Edmonton, Canada.
</p>
<p>OCH F. J. &amp; NEY H. (2003). A Systematic Comparison of Various Statistical Alignment Models.
Computational Linguistics, 1(29), 19&#8211;51.
PAPINENI K., ROUKOS S., WARD T. &amp; ZHU W.-J. (2002). BLEU: A Method for Automatic Eva-
luation of Machine Translation. In Proceedings of the 40th Annual Meeting of the Association for
Computational Linguistics, p. 311&#8211;318, Philadelphie, &#201;tats-Unis.
</p>
<p>STEINBERGER R., POULIQUEN B., WIDIGER A., IGNAT C., ERJAVEC T., TUFIS&#807; D. &amp; VARGA D.
(2006). The JRC-Acquis: A multilingual Aligned Parallel Corpus with 20+ Languages. In Proceedings
of the 5th International Conference on Language Resources and Evaluation (LREC&#8217;06), p. 2142&#8211;2147,
Genoa, Italie.
</p>
<p>STOLCKE A. (2002). SRILM: an Extensible Language Modeling Toolkit. In Proceedings of the Inter-
national Conference on Spoken Language Processing, p. 901&#8211;904, Denver, CO.
</p>
<p>TEUBERT W. (1996). Comparable or Parallel Corpora ? International Journal of Lexicography, 9(3),
239&#8211;264.
</p>
<p>WU H. &amp; WANG H. (2007). Pivot language approach for phrase-based statistical machine translation.
Machine Translation, 21(3), 165&#8211;181.</p>

</div></div>
</body></html>