<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse syntaxique du fran&#231;ais : des constituants aux d&#233;pendances</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Analyse syntaxique du fran&#231;ais : des constituants aux
d&#233;pendances
</p>
<p>Marie Candito1 Beno&#238;t Crabb&#233;1 Pascal Denis2 Fran&#231;ois Gu&#233;rin2
(1) Universit&#233; Paris 7/INRIA (Alpage),
</p>
<p>30 rue du Ch&#226;teau des Rentiers, 75013 Paris
(2) INRIA (Alpage),
</p>
<p>Domaine de Voluceau Rocquencourt - B.P. 105 78153 Le Chesnay
mcandito/bcrabbe@linguist.jussieu.fr, pascal.denis/francois.guerin@inria.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente une technique d&#8217;analyse syntaxique statistique &#224; la fois en
constituants et en d&#233;pendances. L&#8217;analyse proc&#232;de en ajoutant des &#233;tiquettes fonctionnelles aux
sorties d&#8217;un analyseur en constituants, entra&#238;n&#233; sur le French Treebank, pour permettre l&#8217;extrac-
tion de d&#233;pendances typ&#233;es. D&#8217;une part, nous sp&#233;cifions d&#8217;un point de vue formel et linguistique
les structures de d&#233;pendances &#224; produire, ainsi que la proc&#233;dure de conversion du corpus en
constituants (le French Treebank) vers un corpus cible annot&#233; en d&#233;pendances, et partiellement
valid&#233;. D&#8217;autre part, nous d&#233;crivons l&#8217;approche algorithmique qui permet de r&#233;aliser automa-
tiquement le typage des d&#233;pendances. En particulier, nous nous focalisons sur les m&#233;thodes
d&#8217;apprentissage discriminantes d&#8217;&#233;tiquetage en fonctions grammaticales.
</p>
<p>Abstract. This paper describes a technique for both constituent and dependency parsing.
Parsing proceeds by adding functional labels to the output of a constituent parser trained on the
French Treebank in order to further extract typed dependencies. On the one hand we specify on
formal and linguistic grounds the nature of the dependencies to output as well as the conversion
algorithm from the French Treebank to this dependency representation. On the other hand, we
describe a class of algorithms that allows to perform the automatic labeling of the functions
from the output of a constituent based parser. We specifically focus on discriminative learning
methods for functional labelling.
</p>
<p>Mots-cl&#233;s : Analyseur syntaxique statistique, analyse en constituants/d&#233;pendances, &#233;ti-
quetage en fonctions grammaticales.
</p>
<p>Keywords: Statistical parsing, constituent/dependency parsing, grammatical function
labeling.
</p>
<p>1 Probl&#233;matique
</p>
<p>Le probl&#232;me que nous nous posons ici est de produire une analyse syntaxique statistique &#224; la
fois en constituants et en d&#233;pendances pour le Fran&#231;ais. Si les constituants permettent d&#8217;ex-
primer des g&#233;n&#233;ralisations structurales &#233;videntes, les d&#233;pendances ont l&#8217;avantage de permettre
une extraction plus directe des structures argumentales. Elles constituent &#233;galement un format
linguistiquement plus neutre pour l&#8217;&#233;valuation de la t&#226;che d&#8217;analyse syntaxique, qu&#8217;il s&#8217;agisse</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Candito, Crabb&#233;, Denis, Gu&#233;rin
</p>
<p>d&#8217;une &#233;valuation entre analyseurs ou d&#8217;une &#233;valuation intrins&#232;que : la mesure Parseval habi-
tuellement utilis&#233;e pour les constituants (on y compte rappel et pr&#233;cision sur les constituants,
o&#249; un constituant est correct si son type et ses fronti&#232;res sont correctes) est connue comme tr&#232;s
sensible au sch&#233;ma d&#8217;annotation et au ratio nombre de terminaux / nombre de non-terminaux
(Lin, 1995). Une motivation suppl&#233;mentaire pour obtenir &#224; la fois des constituants et des d&#233;pen-
dances est d&#8217;ordre pratique : dans la litt&#233;rature de parsing statistique de l&#8217;anglais, l&#8217;extraction de
d&#233;pendances non typ&#233;es &#224; partir d&#8217;arbres de constituants semble plus performante que la pro-
duction directe d&#8217;arbres de d&#233;pendances (McDonald et al., 2005). Pour la production d&#8217;arbres
de d&#233;pendances typ&#233;es, on manque de comparaison entre production directe et production via
une analyse en constituants.
</p>
<p>L&#8217;approche pratique pour obtenir cette analyse statistique est de s&#8217;appuyer sur un analyseur
statistique en constituants, d&#233;crit par (Crabb&#233; &amp; Candito, 2008), entra&#238;n&#233; sur le French Treebank
(Abeill&#233; et al., 2003) ci-apr&#232;s FTB. Un module suppl&#233;mentaire prend en entr&#233;e les sorties en
constituants de cet analyseur et les convertit en d&#233;pendances typ&#233;es comme illustr&#233; en Figure 1.
</p>
<p>S
NP
</p>
<p>D
</p>
<p>une
</p>
<p>N
lettre
</p>
<p>VN
V
</p>
<p>avait
</p>
<p>V
&#233;t&#233;
</p>
<p>V
envoy&#233;e
</p>
<p>NP
D
</p>
<p>la
N
</p>
<p>semaine
</p>
<p>A
derni&#232;re
</p>
<p>PP
</p>
<p>P
</p>
<p>aux
</p>
<p>NP
N
</p>
<p>salari&#233;s
une lettre avait &#233;t&#233; envoy&#233;e la semaine derni&#232;re aux salari&#233;s
</p>
<p>det
</p>
<p>suj
au
</p>
<p>x-tp
s
</p>
<p>au
x-
</p>
<p>pa
ss mod
</p>
<p>det
mod
</p>
<p>a-obj
obj
</p>
<p>FIG. 1 &#8211; Entr&#233;es et sorties de la t&#226;che trait&#233;e
</p>
<p>Les structures syntagmatiques fournies par l&#8217;analyseur statistique en constituants suivent le
sch&#233;ma d&#8217;annotation du FTB, moins les annotations fonctionnelles. Or, sans ces annotations, la
fonction des d&#233;pendants n&#8217;est pas directement d&#233;ductible de la forme des arbres (par exemple,
dans la Figure 1, le NP postverbal la semaine derni&#232;re est un modifieur temporel mais pourrait
structurellement &#234;tre un objet). C&#8217;est bien pour cette raison que les auteurs du FTB ont encod&#233;
sur les constituants la fonction des d&#233;pendants de verbes, les autres cas &#233;tant consid&#233;r&#233;s comme
d&#233;ductibles de la seule structure syntagmatique (Abeill&#233; &amp; Barrier, 2004).
Le propos de cet article est de montrer comment tirer parti de cette information suppl&#233;mentaire
pour extraire une analyse en d&#233;pendances &#224; partir de l&#8217;analyse en constituants. Nous sp&#233;cifions
en section 2 la repr&#233;sentation en d&#233;pendances vis&#233;es, et la proc&#233;dure de conversion du FTB vers
des d&#233;pendances. La section 3 d&#233;taille l&#8217;architecture d&#8217;analyse, et motive un processus en deux
&#233;tapes. La section 4 pr&#233;sente plus particuli&#232;rement la t&#226;che d&#8217;&#233;tiquetage fonctionnel. Nous ter-
minons avec des comparaisons avec l&#8217;existant et des perspectives d&#8217;am&#233;lioration.
</p>
<p>2 Annotation en d&#233;pendances
</p>
<p>Il existe de multiples sch&#233;mas d&#8217;annotation en d&#233;pendances, comme le sch&#233;ma EASy (Parou-
bek et al., 2005), ou des standards internationaux tels le sch&#233;ma GR (Carroll et al., 1998),
d&#233;fini comme un format plus adapt&#233; &#224; l&#8217;&#233;valuation de parsers, le sch&#233;ma Stanford Dependen-
cies (catherine De Marneffe et al., 2006), issu d&#8217;une conversion automatique du Penn TreeBank,
ou le sch&#233;ma PARC 700 (King et al., 2003), inspir&#233; des structures fonctionnelles de LFG. La
multiplicit&#233; de ces sch&#233;mas d&#8217;annotation tient pour partie &#224; des choix linguistiques et pratiques
diff&#233;rents, notamment sur le caract&#232;re surfacique ou pas des d&#233;pendances. Ainsi par exemple les</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique du fran&#231;ais : des constituants aux d&#233;pendances
</p>
<p>relations de contr&#244;le sont sens&#233;es &#234;tre encod&#233;es pour les 4 formats cit&#233;s, mais les d&#233;pendances
sur mots s&#233;mantiquement vides n&#8217;apparaissent que pour GR et Stanford. Nous avons pr&#233;f&#233;r&#233;
d&#233;finir un sch&#233;ma d&#8217;annotation uniquement en d&#233;pendances, et en d&#233;pendances purement de
surface, dont le format soit un pivot convertible vers les diff&#233;rents standards cit&#233;s, et un pivot
enrichissable ou convertible en d&#233;pendances plus profondes.
</p>
<p>L&#8217;objectif pratique &#224; court terme &#233;tait de convertir vers ce format en d&#233;pendances les arbres
syntagmatiques du FTB, et plus g&#233;n&#233;ralement les analyses fournies par les parsers appris sur
le FTB, ce qui permet d&#8217;&#233;valuer les derni&#232;res sur les premi&#232;res. Nous d&#233;crivons ici le sch&#233;ma
d&#8217;annotation en d&#233;pendances choisi, la proc&#233;dure de conversion du FTB vers ce sch&#233;ma, et
l&#8217;&#233;cart entre l&#8217;annotation vis&#233;e et l&#8217;annotation obtenue automatiquement.
</p>
<p>2.1 Caract&#233;ristiques linguistiques et formelles
</p>
<p>Caract&#233;ristiques linguistiques g&#233;n&#233;rales : On entend ici sp&#233;cifier des d&#233;pendances : la d&#233;pen-
dance syntaxique repr&#233;sente le fait que la pr&#233;sence d&#8217;un mot1 est l&#233;gitim&#233;e par un autre mot,
son gouverneur2. De plus il s&#8217;agit de d&#233;pendances &#8220;surfaciques&#8221;, c&#8217;est-&#224;-dire des relations entre
formes fl&#233;chies, o&#249; toute forme fl&#233;chie, m&#234;me s&#233;mantiquement vide, est repr&#233;sent&#233;e, et a un et
un seul gouverneur, sauf pour la forme t&#234;te de la phrase3. Donc, par exemple, les relations de
contr&#244;le ne sont pas encod&#233;es dans ce sch&#233;ma.
</p>
<p>Caract&#233;ristiques formelles : Formellement, ces caract&#233;ristiques linguistiques impliquent que
la structure de d&#233;pendance associ&#233;e &#224; une phrase est un arbre orient&#233; - un graphe acyclique et
connexe - dont les noeuds correspondent aux tokens de la phrase, et dont les arcs correspondent
aux d&#233;pendances et sont &#233;tiquet&#233;s par une relation de d&#233;pendance. Les noeuds sont &#233;tiquet&#233;s
par une forme fl&#233;chie, un lemme et sa cat&#233;gorie syntaxique. Les cat&#233;gories sont celles du FTB.
L&#8217;ordre lin&#233;aire de la phrase est encod&#233; par un identifiant sur les noeuds, de type entier, local &#224;
chaque phrase. A noter que le sch&#233;ma d&#8217;annotation n&#8217;impose pas la projectivit&#233; : la projection
d&#8217;un noeud4 peut correspondre &#224; un segment discontinu de la phrase. L&#8217;arbre de d&#233;pendances
pour une phrase est encod&#233; avec un format parenth&#233;s&#233;, o&#249; les d&#233;pendances apparaissent sous la
forme de triplets relation ( gouverneur~id lin&#233;aire , d&#233;pendant~id lin&#233;aire ).
Sp&#233;cifications pour le fran&#231;ais : Nous d&#233;finissons un sch&#233;ma d&#8217;annotation en d&#233;pendances de
surface pour le fran&#231;ais (ci-apr&#232;s l&#8217;annotation deps), qui suit largement l&#8217;annotation en consti-
tuants pr&#233;conis&#233;e dans le FTB, avec toutefois quelques cas o&#249; l&#8217;annotation en constituants n&#8217;est
pas assez pr&#233;cise, et des cas de divergences5. En comparaison du format standard fran&#231;ais EASy
(Paroubek et al., 2005), le propos est d&#8217;obtenir un format enti&#232;rement en d&#233;pendances, et clai-
rement de surface.
</p>
<p>La liste des relations utilis&#233;es comprend les fonctions d&#233;finies dans le FTB (o&#249; les fonctions ne
sont annot&#233;es que pour les d&#233;pendants de verbes). Nous &#233;tendons l&#8217;utilisation de ces fonctions
dans deux cas, non annot&#233;s dans le FTB : (i) les d&#233;pendants dans une participiale pass&#233;e et (ii)
les d&#233;pendants adverbiaux r&#233;duits &#224; un seul mot comme dans ils sont l&#224;. On ajoute par ailleurs
</p>
<p>1Ou plut&#244;t du groupe de mots incluant celui-ci et tous ses d&#233;pendants.
2Voir (Kahane, 2001) pour un historique de la repr&#233;sentation en d&#233;pendances.
3Pour obtenir que tout mot a exactement un gouverneur, on ajoute un noeud root comme gouverneur de la t&#234;te.
4La projection d&#8217;un noeud N est d&#233;finie comme les noeuds du sous-arbre de N. Les mots correspondant &#224; ces
</p>
<p>noeuds peuvent &#234;tre ordonn&#233;s selon l&#8217;ordre lin&#233;aire de la phrase.
5Les sp&#233;cifications compl&#232;tes sont disponibles &#224; l&#8217;adresse : http://www.linguist.
</p>
<p>univ-paris-diderot.fr/~mcandito/Rech/FTBDeps.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Candito, Crabb&#233;, Denis, Gu&#233;rin
</p>
<p>les relations aux_tps, aux_pass, aux_caus pour les auxiliaires et aff pour les clitiques fig&#233;s.
Pour les autres cat&#233;gories de gouverneurs, on utilise les relations mod, mod_rel, coord, arg,
arg_coord, arg_comp, arg_cons, det et ponct. On ne g&#232;re pas la sous-cat&#233;gorisation des t&#234;tes
non verbales. Donc, dans le cas de d&#233;pendants pr&#233;positionnels, pour un gouverneur non verbal,
on ne distingue pas les arguments et les ajouts, et on utilise la relation g&#233;n&#233;rique dep par d&#233;faut.
On choisit pour la coordination un sch&#233;ma o&#249; le premier conjoint gouverne le coordonnant,
et le coordonnant gouverne la suite de la coordination (Exemple (d) en Figure 2). Concernant
les pr&#233;positions, on choisit d&#8217;encoder la pr&#233;position comme gouverneur, que l&#8217;objet de la pr&#233;-
position soit nominal ou infinitival, et que la pr&#233;position soit s&#233;mantiquement pleine ou vide.
A noter que le FTB encode comme pr&#233;position les cas de de ou &#224; introduisant une infinitive
directe, comme dans Paul promet de partir. Nous gardons la cat&#233;gorie prep du FTB et codons
obj(promet~1,de~2), obj(de~2,partir~3). Pour les conjonctions introduisant une phrase, on uni-
formise &#233;galement le traitement, que la conjonction soit s&#233;mantiquement pleine ou vide : la
conjonction est gouverneur du verbe de la phrase qu&#8217;elle introduit (ou autre cat&#233;gorie de syn-
tagme en cas d&#8217;ellipse), avec une d&#233;pendance de type obj.
</p>
<p>(a)
</p>
<p>trop rapide pour &#234;tre durable
</p>
<p>mo
d
</p>
<p>arg
_cons
</p>
<p>obj
ats
</p>
<p>(b)
</p>
<p>plus grand que toi
</p>
<p>mo
d
</p>
<p>arg
_comp
</p>
<p>obj
(c)
</p>
<p>de 1998 &#224; 2001
</p>
<p>obj
</p>
<p>arg
obj (d)
</p>
<p>pour Paris et pour Rome
</p>
<p>obj
</p>
<p>coord
</p>
<p>arg
_coord
</p>
<p>obj
</p>
<p>FIG. 2 &#8211; Exemples d&#8217;arbres de d&#233;pendances
</p>
<p>Cas de non-projectivit&#233; : Les cas de non projectivit&#233; recens&#233;s actuellement sont au nombre
de quatre : Extraction : Dans A ces cinq d&#233;parts, trois autres sont susceptibles de s&#8217;ajouter, le
gouverneur de d&#233;parts est ajouter ; Extraction hors du SN (clitique en) : Pour afin d&#8217;en am&#233;-
liorer l&#8217;efficacit&#233;, le gouverneur de en est efficacit&#233;. Extraction hors du SN (relatif dont). Il y a
non projectivit&#233; dans le cas o&#249; le SN est objet dans la relative : dans Lyonnaise Espana, dont
le groupe fran&#231;ais ne d&#233;tiendra plus que 51%, le gouverneur de dont est %. Comparatives : on
choisit de faire d&#233;pendre la comparative de l&#8217;adverbe comparatif. Aussi on aura non projectivit&#233;
d&#232;s une discontinuit&#233; entre l&#8217;adverbe et la comparative : Dans La croissance est actuellement
plus faible que ce qu&#8217;il pr&#233;voyait, le gouverneur de que est plus. M&#234;me principe pour les infini-
tives cons&#233;cutives comme dans trop rapide pour &#234;tre durable (exemple (a) en figure 2).
</p>
<p>2.2 Conversion du FTB
</p>
<p>On d&#233;crit ici la conversion d&#8217;un arbre syntagmatique de type FTB (on parlera dans la suite
de type ftb-f ) vers le sch&#233;ma deps d&#233;fini ci-dessus. La conversion se fait en trois &#233;tapes, dont
les deux premi&#232;res sont automatiques et la troisi&#232;me est manuelle. Pour faciliter la lecture, on
nomme les formats interm&#233;diaires, et on peut d&#233;crire la conversion par : ftb-f =auto&#8658; deps-
ftb =auto&#8658; deps-ftb-f+ =manuel&#8658; deps.
Isomorphie constituants/d&#233;pendances (ftb-f &#8658; deps-ftb) : Dans cette premi&#232;re &#233;tape on com-
mence par un marquage automatique de la t&#234;te de chaque constituant, en utilisant une table de
propagation de t&#234;tes (initialement propos&#233;e par (Magerman, 1995), nous utilisons une table
modifi&#233;e &#224; partir de (Arun &amp; Keller, 2005)). Cette table contient des r&#232;gles du type &#8220;pour un</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique du fran&#231;ais : des constituants aux d&#233;pendances
</p>
<p>constituant NP, la t&#234;te est le premier N en partant de la gauche s&#8217;il existe, sinon le premier A,
sinon ...&#8221;. Ceci permet de remonter sur chaque noeud syntagmatique sa t&#234;te lexicale. Ensuite
les d&#233;pendances peuvent &#234;tre extraites ainsi : pour chaque constituant C, dont le fils t&#234;te est un
noeud H, annot&#233; avec la t&#234;te lexicale h, pour chaque noeud F, fr&#232;re du noeud H, annot&#233; avec
la t&#234;te lexicale f, on extrait la d&#233;pendance dep(h, f). Si en outre le noeud F porte une &#233;tiquette
fonctionnelle func, alors on type la d&#233;pendance extraite : func(h, f). Cette &#233;tape produit des d&#233;-
pendances partiellement sous-sp&#233;cifi&#233;es (deps-ftb), i.e. o&#249; le type de d&#233;pendance n&#8217;est renseign&#233;
que pour les cas o&#249; une &#233;tiquette fonctionnelle est pr&#233;sente dans l&#8217;entr&#233;e syntagmatique.
</p>
<p>Typage des d&#233;pendances non typ&#233;es dans le FTB (deps-ftb &#8658; deps-ftb-f+) : Une deuxi&#232;me
&#233;tape consiste &#224; pr&#233;ciser les types de d&#233;pendances pour les cas non renseign&#233;s par l&#8217;&#233;tape pr&#233;-
c&#233;dente. Nous utilisons des heuristiques, initialement &#233;crites par Mathieu Falco6, utilisant sim-
plement la structure syntagmatique et la structure de d&#233;pendances partielles.
</p>
<p>R&#233;vision manuelle (deps-ftb-f+&#8658; deps) : Les deux &#233;tapes pr&#233;c&#233;dentes ne peuvent, en l&#8217;&#233;tat
actuel des heuristiques, coder certaines sp&#233;cifications de l&#8217;annotation deps, notamment pour
les cas de non projectivit&#233; cit&#233;s supra : la conversion ne cr&#233;e jamais de non-projectivit&#233;. Pour
&#233;valuer la qualit&#233; des d&#233;pendances produites automatiquement, et l&#8217;&#233;cart par rapport &#224; l&#8217;anno-
tation vis&#233;e, et juger de l&#8217;opportunit&#233; d&#8217;une phase de r&#233;vision manuelle de tout le corpus, nous
avons corrig&#233; manuellement la conversion de 120 phrases cons&#233;cutives du FTB. Ce sous-corpus
(ci-apr&#232;s P7-120) comporte 2894 mots7 sans compter la ponctuation.
Evaluation : L&#8217;&#233;valuation consiste &#224; calculer rappel, pr&#233;cision et F-score des d&#233;pendances
produites automatiquement par rapport &#224; celles r&#233;vis&#233;es manuellement, pour le sous-corpus
P7-120. On ignore les cas o&#249; la d&#233;pendance dans la r&#233;f&#233;rence est de type ponct. On obtient
F1=98.00% en d&#233;pendances typ&#233;es8, et F1=98.78% en d&#233;pendances non typ&#233;es (i.e. en ignorant
le type de d&#233;pendances pour compter les d&#233;pendances correctes, mais toujours en &#233;cartant les
d&#233;pendances de type ponct). Cela permet de conclure que le P7-120 ne contient pas plus de
1,22% de d&#233;pendances non projectives9. Les erreurs suppl&#233;mentaires de typage sont dues au
caract&#232;re trop grossier des heuristiques.
</p>
<p>Le r&#233;sultat de la conversion automatique du FTB, et le sous-corpus manuellement valid&#233;s sont
disponibles sous r&#233;serve de licence du FTB. Le corpus complet, correspond &#224; une &#8220;pseudo-
r&#233;f&#233;rence&#8221; en d&#233;pendances de surface, qui, si l&#8217;on projette l&#8217;&#233;valuation du P7-120, contient
environ 2% d&#8217;erreurs.
</p>
<p>3 Analyse syntaxique automatique
</p>
<p>Dans le cadre de l&#8217;analyse syntaxique automatique, on peut adapter la proc&#233;dure de conversion
de treebank donn&#233;e pr&#233;c&#233;demment en faisant produire &#224; l&#8217;analyseur automatique une sortie
analogue &#224; l&#8217;entr&#233;e de la proc&#233;dure de conversion en d&#233;pendances sur le French Treebank. Pour
</p>
<p>6Dans le cadre d&#8217;un stage de master 1.
7Les mots compos&#233;s sont cod&#233;s comme un seul token, comme d&#233;crit dans (Crabb&#233; &amp; Candito, 2008).
8Dans le cas pr&#233;sent avec exactement une d&#233;pendance par mot, rappel et pr&#233;cision se confondent, et valent le
</p>
<p>pourcentage de mots qui re&#231;oivent le bon gouverneur, avec le bon type de d&#233;pendances.
9Une analyse des 34 erreurs, i.e. des 34 mots qui ne re&#231;oivent pas le bon gouverneur par la proc&#233;dure automa-
</p>
<p>tique de conversion, donne 18 erreurs dues &#224; des d&#233;pendances non projectives (dont, en, extraction non born&#233;e),
8 erreurs dues &#224; un manque de pr&#233;cision de la table de propagation des t&#234;tes, et 8 erreurs dans l&#8217;annotation en
constituants initiale.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Candito, Crabb&#233;, Denis, Gu&#233;rin
</p>
<p>cela, il faut pouvoir ajouter les &#233;tiquettes fonctionnelles sur les d&#233;pendants verbaux. Dans ce
qui suit nous utilisons le protocole exp&#233;rimental d&#233;crit par (Crabb&#233; &amp; Candito, 2008) qui divise
le corpus en trois parties : entrainement : 80% , d&#233;veloppement 10% et test 10%. L&#8217;analyseur
en constituants utilis&#233; est l&#8217;analyseur faiblement lexicalis&#233; de Berkeley (d&#233;crit pour le Fran&#231;ais
par (Candito et al., 2009) comme sup&#233;rieur, en constituants et en d&#233;pendances non typ&#233;es, aux
analyseurs dits lexicalis&#233;s).
Analyse int&#233;gr&#233;e La mani&#232;re la plus &#233;vidente de r&#233;aliser cela, c&#8217;est d&#8217;apprendre une grammaire
dont les symboles ne sont pas uniquement des constituants (comme NP) mais des symboles int&#233;-
grant l&#8217;information fonctionelle (comme NP-SUJ) pour les noeuds comportant cette annotation
dans le treebank. Cette approche, bien que simple et directe, donne un mauvais r&#233;sultat : le F-
Score de l&#8217;analyse en constituants chute de 86.4 &#224; 78.8. Cette d&#233;gradation de r&#233;sultats est peut
&#234;tre due &#224; deux facteurs : premi&#232;rement la division des symboles non terminaux comme NP
en symboles plus raffin&#233;s (comme NP-SUJ, NP-OBJ,NP-MOD...) entra&#238;ne une d&#233;multi-
plication du nombre de r&#232;gles et par cons&#233;quent un accroissement des effets de dispersion de
donn&#233;es. La seconde explication est que les informations fonctionnelles attach&#233;es aux d&#233;pen-
dants verbaux encodent la sous-cat&#233;gorisation verbale. La t&#234;te verbale a un r&#244;le pr&#233;pond&#233;rant
pour d&#233;cider de la fonction du d&#233;pendant. Or l&#8217;approche int&#233;gr&#233;e ne mod&#233;lise pas la sous-
cat&#233;gorisation, car la r&#232;gle de grammaire suppos&#233;e &#233;mettre les d&#233;pendants est &#233;mise ind&#233;pen-
damment de la t&#234;te verbale, par d&#233;finition de PCFG et par configuration des arbres du treebank.
</p>
<p>Analyse s&#233;quentielle Pour rem&#233;dier &#224; ces deux probl&#232;mes, on opte ici pour une analyse en
s&#233;quence : une premi&#232;re passe proc&#232;de &#224; l&#8217;analyse en constituants d&#233;pourvue d&#8217;&#233;tiquettes fonc-
tionnelles en utilisant un mod&#232;le faiblement lexicalis&#233; qui se r&#233;v&#232;le meilleur pour mod&#233;liser la
constituance. Une seconde passe d&#8217;&#233;tiquetage fonctionnel proc&#232;de &#224; l&#8217;ajout des &#233;tiquettes de
fonction en utilisant un mod&#232;le lexicalis&#233;, c&#8217;est-&#224;-dire un mod&#232;le o&#249; les fonctions sont &#233;mises
en tenant compte (entre autres) de la t&#234;te verbale. L&#8217;analyse s&#233;quentielle permet de pr&#233;server un
meilleur F-Score en constituants : ainsi le F-score obtenu avec le meilleur mod&#232;le s&#233;quentialis&#233;
d&#233;crit ci-dessous est de 83.3 compar&#233; &#224; 78.8 pour l&#8217;approche int&#233;gr&#233;e.
</p>
<p>4 Mod&#232;les discriminants pour l&#8217;&#233;tiquetage fonctionnel
</p>
<p>Cette section d&#233;crit un syst&#232;me automatique d&#8217;&#233;tiquetage en fonctions grammaticales qui op&#232;re
en aval de l&#8217;analyse en constituants. Ce syst&#232;me repose sur des m&#233;thodes d&#8217;apprentissage super-
vis&#233;, en particulier des mod&#232;les discriminants. Ces mod&#232;les sont plus expressifs que PCFG car
ils permettent de prendre des d&#233;cisions sur base de traits non locaux &#224; une r&#232;gle de grammaire.
10
</p>
<p>Notre syst&#232;me cible les relations de d&#233;pendance entre un pr&#233;dicat verbal et les syntagmes qui
apparaissent comme fr&#232;res du noeud verbal dans le FTB 11. On appellera gouverneur (ou g) le
verbe et d&#233;pendant (ou d) le noeud syntagmatique reli&#233; au verbe. Le FTB distingue huit types
distincts de fonctions grammaticales, &#224; savoir : SUJ, OBJ, A-OBJ, DE-OBJ, P-OBJ, MOD,
ATS, ATO.
</p>
<p>De mani&#232;re g&#233;n&#233;rale, la t&#226;che d&#8217;&#233;tiquetage fonctionnel consiste &#224; pr&#233;dire une s&#233;quence de n
10Leur utilisation lors de l&#8217;analyse est cepedendant difficile, car ils ne construisent pas de structure (ou alors de
</p>
<p>mani&#232;re beaucoup trop co&#251;teuse en temps) contrairement &#224; un mod&#232;le g&#233;n&#233;ratif comme PCFG.
11Nous suivons en cela le guide d&#8217;annotation du FTB, puisque seuls les noeuds fr&#232;res de VN, &#224; l&#8217;exclusion des
</p>
<p>noeuds COORD, sont en effet &#233;ligibles pour un &#233;tiquetage fonctionnel.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique du fran&#231;ais : des constituants aux d&#233;pendances
</p>
<p>fonctions grammaticales {f1, . . . , fn} &#233;tant donn&#233; un gouverneur g et une s&#233;quence de n d&#233;-
pendants {d1, . . . , dn}. Vu en termes probabilistes, le but de l&#8217;apprentissage revient &#224; estimer la
probabilit&#233; conditionnelle suivante : p({f1, . . . , fn}|g, {d1, . . . , dn}). Il est bien entendu impos-
sible d&#8217;estimer correctement de telles probabilit&#233;s pour des probl&#232;mes &#233;vidents de dispersion
des donn&#233;es. En pratique, on peut n&#233;anmoins simplifier le probl&#232;me en faisant l&#8217;hypoth&#232;se
d&#8217;ind&#233;pendance suivante :
</p>
<p>p({f1, . . . , fn}|g, {d1, . . . , dn}) &#8776;
n&#8719;
</p>
<p>i=1
</p>
<p>p(fi|g, di) (1)
</p>
<p>Ce qui revient &#224; supposer que les &#233;tiquetages de chaque fonction fi grammaticale &#224; un d&#233;pendant
di se font ind&#233;pendamment les unes des autres. La t&#226;che d&#8217;&#233;tiquetage fonctionnel se r&#233;duit alors
&#224; un simple probl&#232;me de classification (o&#249; chaque d&#233;pendant se voit assigner une fonction
syntaxique unique). La t&#226;che d&#8217;apprentissage revient, quant &#224; elle, &#224; apprendre une fonction
de D dans F , o&#249; D repr&#233;sente l&#8217;ensemble des d&#233;pendants et F l&#8217;ensemble des 8 fonctions
grammaticales mentionn&#233;es. Concr&#232;tement, chaque d&#233;pendant est repr&#233;sent&#233; par un vecteur de
traits, qui d&#233;crit le d&#233;pendant, son contexte, et sa relation au gouverneur. Les diff&#233;rents sch&#233;mas
de traits utilis&#233;s sont r&#233;sum&#233;s dans le tableau 1. Le processus d&#8217;extraction de ces diff&#233;rents traits
&#224; partir des structures de consistuance est pr&#233;sent&#233; dans la figure 3.
</p>
<p>Trait Description
CN cat&#233;gorie du noeud &#224; classifier
CD cat. synt. de la t&#234;te du noeud d&#233;pendant
CH cat. synt. de la t&#234;te
WD forme lexicale stemm&#233;e du d&#233;pendant
WH forme lexicale stemm&#233;e de la t&#234;te verbale
dist distance en nombre de mots entre la t&#234;te du d&#233;pendant et la t&#234;te verbale
span longueur en nombre de mots de la chaine domin&#233;e par le noeud d&#233;pendant
CP cat. synt. du noeud parent (noeud dominant le noeud &#224; classifier)
LCD cat. synt. du noeud gauche imm&#233;diatement adjacent &#224; D (-STOP- s&#8217;il n&#8217;existe pas)
RCD cat. synt. du noeud droit imm&#233;diatement adjacent &#224; D (-STOP- s&#8217;il n&#8217;existe pas)
CCH cat. synt. de la co-t&#234;te (-NONE- si la co-t&#234;te n&#8217;existe pas)
WCH forme lexicale stemm&#233;e de la co-t&#234;te (-NONE- si la co-t&#234;te n&#8217;existe pas)
MH mode de la t&#234;te syntaxique de la phrase
rank indice du d&#233;pendant di dans la s&#233;quence d0, . . . , dn
wh la phrase est une phrase interrogative (1 ou 0)
rel la phrase est relative (1 ou 0)
etre le verbe est conjugu&#233; avec &#234;tre (1 ou 0)
inv le verbe est construit avec une inversion clitique (1 ou 0)
</p>
<p>TAB. 1 &#8211; Principaux traits utilis&#233;s par le classificateur
</p>
<p>Les traits WD,WH , CD, CH , CCH ,WCH capturent des d&#233;pendances bilexicales entre le mot
t&#234;te et le mot d&#233;pendant en incluant de la redondance, comme les cat&#233;gories, pour obtenir des
comptes de granularit&#233;s vari&#233;es analogues aux mod&#232;les de lissage de (Collins, 1999; Charniak,
2000) pour l&#8217;analyse en constituants de l&#8217;anglais reposant sur des mod&#232;les bay&#233;siens. Ne dis-
posant pas de lemmatiseur d&#233;terministe, nous avons proc&#233;d&#233; pour WD et WH &#224; un stemmage
brutal : &#224; savoir, les 4 premiers caract&#232;res. Les hapax dans le corpus d&#8217;entra&#238;nement sont rempla-
c&#233;s par un symbole unique, permettant ainsi de g&#233;rer les mots inconnus. Notons encore que les
valeurs des traits dist et span ont &#233;t&#233; discr&#233;tis&#233;es &#233;galement de mani&#232;re &#224; r&#233;duire la dispersion
des donn&#233;es.
</p>
<p>Les traits CP , LCD, RCD, dist, span,MH , rank, wh, rel, etre, inv capturent, quant &#224; eux, des
informations configurationnelles. Par exemple plus un d&#233;pendant est &#233;loign&#233; de la t&#234;te, plus il
a tendance &#224; &#234;tre un modifieur, les trait LCD, RCD vont par exemple permettre d&#8217;identifier si
le d&#233;pendant est pr&#233;c&#233;d&#233; ou suivi d&#8217;une ponctuation. Un d&#233;pendant s&#233;par&#233; de la t&#234;te par une</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Candito, Crabb&#233;, Denis, Gu&#233;rin
</p>
<p>ponctuation sera plut&#244;t un modifieur. Le mode permet par exemple de p&#233;naliser l&#8217;assignation de
sujets &#224; l&#8217;infinitif ou &#224; l&#8217;imp&#233;ratif. L&#8217;auxiliaire &#234;tre est une approximation grossi&#232;re du passif, et
doit favoriser l&#8217;&#233;tiquetage d&#8217;une fonction P-OBJ (fonction du compl&#233;ment d&#8217;agent), etc.
</p>
<p>S
</p>
<p>NP
</p>
<p>une lettre
</p>
<p>VN
</p>
<p>V
</p>
<p>&#233;tait
</p>
<p>V
</p>
<p>envoy&#233;e
</p>
<p>NP
</p>
<p>Det
</p>
<p>la
</p>
<p>N
</p>
<p>semaine
</p>
<p>AP
</p>
<p>ADJ
</p>
<p>derni&#232;re
</p>
<p>PP
</p>
<p>aux employ&#233;s
</p>
<p>CN
</p>
<p>span
</p>
<p>WD
</p>
<p>CD
</p>
<p>CH
WH
</p>
<p>MH
</p>
<p>dist
</p>
<p>CP RCD
LCD
</p>
<p>FIG. 3 &#8211; Extraction des traits pour l&#8217;&#233;tiquetage fonctionnel
</p>
<p>Pour l&#8217;apprentissage, nous avons eu recours &#224; des mod&#232;les log-lin&#233;raires (encore appel&#233;s mo-
d&#232;les par maximum d&#8217;entropie) (Berger et al., 1996)12. Largement utilis&#233; en TAL, ce type de
mod&#232;les permet en effet d&#8217;incorporer de nombreux traits potentiellement inter-d&#233;pendants sans
pour cela faire d&#8217;hypoth&#232;se d&#8217;ind&#233;pendance.13 Pour nos exp&#233;riences, nous utilisons le d&#233;cou-
page du FTB de (Crabb&#233; &amp; Candito, 2008) en trois parties, modulo le fait que le corpus de test
n&#8217;est pas l&#8217;enti&#232;re partie 3, mais seulement une sous-partie : le corpus P7-120 r&#233;vis&#233; manuelle-
ment pour les d&#233;pendances (section 2). Nous entra&#238;nons sur la partie (1), nous avons d&#233;velopp&#233;
sur la partie (2) et nous testons sur P7-120. 14
</p>
<p>GF Pr&#233;cision Rappel F1
SUJ 0.972 0.963 0.967
OBJ 0.898 0.911 0.904
A_OBJ 0.787 0.747 0.767
DE_OBJ 0.826 0.665 0.737
P_OBJ 0.816 0.213 0.338
ATS 0.852 0.876 0.864
ATO 0.7 0.206 0.318
MOD 0.818 0.9 0.857
</p>
<p>TAB. 2 &#8211; Performances par
fonction
</p>
<p>Evaluation du classifieur Une premi&#232;re &#233;valuation consiste
&#224; &#233;valuer l&#8217;&#233;tiquetage fonctionnel seul, en comptant parmi
les noeuds &#233;ligibles pour un &#233;tiquetage fonctionnel, combien
re&#231;oivent la bonne &#233;tiquette. Nous obtenons une exactitude
(angl. accuracy) de 87.9 sur la partie test (88.1% sur la partie
d&#233;veloppement).15 Les scores de pr&#233;cision, rappel et F1 pour
les diff&#233;rentes fonctions sur le test sont fournis en table 2.
Evaluation de la cha&#238;ne d&#8217;analyse : Une seconde &#233;valuation
concerne la cha&#238;ne int&#233;gr&#233;e : analyse en constituants, premier
&#233;tiquetage fonctionnel des fonctions de d&#233;pendants verbaux,
puis conversion en d&#233;pendances et &#233;tiquetage par heuristiques des autres fonctions (cf. section
2). L&#8217;&#233;valuation se fait avec le protocole d&#233;crit section 2 pour l&#8217;&#233;valuation de la proc&#233;dure de
conversion. Nous obtenons sur le P7-120 une pr&#233;cision F1=86.56% en d&#233;pendances typ&#233;es.
Evaluation EASy Enfin, une troisi&#232;me &#233;valuation consiste &#224; &#233;valuer l&#8217;analyseur sur le corpus
EASy (Paroubek et al., 2005). Pour cela, un module de conversion, r&#233;alis&#233; par Fran&#231;ois Gu&#233;-
rin, convertit les d&#233;pendances de surface d&#233;crites section 2, vers les relations et chunks EASy.
Les r&#233;sultats pr&#233;liminaires de cette cha&#238;ne d&#8217;analyse donne un F1 de 64% sur les relations de la
</p>
<p>12L&#8217;impl&#233;mentation utilis&#233;e est Megam : www.cs.utah.edu/~hal/megam.
13Notons n&#233;anmoins que ces mod&#232;les ne mod&#233;lisent pas explicitement l&#8217;interaction entre traits. Aussi, il est
</p>
<p>souvent d&#8217;usage d&#8217;introduire de nouveaux traits complexes pour mod&#233;liser ces interactions &#8212;ce qui n&#8217;a pas encore
&#233;t&#233; fait ici. De mani&#232;re g&#233;n&#233;rale, les traits pr&#233;sent&#233;s ci-dessus restent encore tr&#232;s rudimentaires, tentant simplement
de capturer nos principales intuitions linguistiques. Une exploration plus d&#233;taill&#233;e des traits pertinents fera l&#8217;objet
de recherches futures. Nous n&#8217;avons pas non plus cherch&#233; &#224; optimiser le param&#232;tre de lissage gaussien.
</p>
<p>14Le nombre de d&#233;pendants/s&#233;quences dans ces sous-corpus sont, respectivement, de : 51865/20623, 6979/2850,
7119/2953.
</p>
<p>15Les scores de pr&#233;cision pour la s&#233;quence enti&#232;re sont, respectivement, de 74.6% et 74.8%. Les longueurs
moyennes des s&#233;quences est de 2.41/2.45 d&#233;pendants.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique du fran&#231;ais : des constituants aux d&#233;pendances
</p>
<p>partie &#8220;Le Monde&#8221; du corpus EASy.
</p>
<p>5 Travaux ant&#233;rieurs et reli&#233;s
</p>
<p>(Abeill&#233; &amp; Barrier, 2004) d&#233;crivent la t&#226;che d&#8217;annotation fonctionnelle du FTB, pour laquelle ils
ont utilis&#233; une annotation automatique, faite par r&#232;gles, pr&#233;alable &#224; une r&#233;vision manuelle. Les
auteurs annoncent un rappel et une pr&#233;cision de 89.69% et 89.27%16, comparables aux r&#233;sultats
obtenus ici par approche statistique.
</p>
<p>(Schluter &amp; van Genabith, 2008) proposent une architecture de parsing statistique &#8217;profond&#8217;
du fran&#231;ais, avec un parser appris sur le &#8217;modified French Treebank&#8217; : un corpus comprenant
environ la moiti&#233; des phrases du FTB, avec modification du sch&#233;ma d&#8217;annotation, correction
manuelle, et ajout de chemins fonctionnels encodant les d&#233;pendances non born&#233;es. Le parser
appris produit des couples structure-c/structure-f de type LFG. Les auteurs &#233;valuent leur parser
en rappel/pr&#233;cision/F1 sur les traits des structures fonctionnelles produites. Ils relatent un F1 de
86.73%, pour un parsing avec tagging parfait pr&#233;alable. Ces r&#233;sultats ne sont pas exactement
comparables aux n&#244;tres : d&#8217;un c&#244;t&#233; le tagging parfait augmentent leur score, d&#8217;un autre c&#244;t&#233;,
les d&#233;pendances encod&#233;es dans les structures fonctionnelles sont moins surfaciques et donc
constituent une t&#226;che plus difficile.
</p>
<p>Plus directement comparables sont les r&#233;sultats de la campagne d&#8217;&#233;valuation EASy (Paroubek
et al., 2005). Le meilleur analyseur, Syntex (Bourigault et al., 2005) donne un F1=66%17 sur
sous-corpus Le Monde compris dans EASy, score &#233;quivalent &#224; ceux obtenus ici. Cependant, le
parser statistique pr&#233;sent&#233; ici a des performances nettement moins bonnes lorsque l&#8217;on change
de domaine (par exemple F1=61% sur le corpus m&#233;dical, contre F1=70% pour l&#8217;analyseur Syn-
tex).
</p>
<p>6 Conclusions et perspectives
</p>
<p>Cet article pr&#233;sente une architecture pour l&#8217;analyse syntaxique statistique du fran&#231;ais journa-
listique, qui repose sur un processus s&#233;quentiel : analyse en constituants d&#8217;abord, extraction de
d&#233;pendances ensuite.
</p>
<p>Du point de vue de la mod&#233;lisation, l&#8217;architecture pr&#233;sent&#233;e ici fait deux hypoth&#232;ses simplifi-
catrices essentielles : le mod&#232;le g&#233;n&#233;ratif en constituants est vu comme ind&#233;pendant du mod&#232;le
discriminant d&#8217;analyse fonctionnelle et l&#8217;&#233;tiquetage fonctionnel assigne les fonctions ind&#233;pen-
damment &#224; chaque d&#233;pendant alors qu&#8217;on sait qu&#8217;il s&#8217;agit d&#8217;un probl&#232;me de s&#233;quence, qui doit
mod&#233;liser une notion de sous-cat&#233;gorisation. Il reste &#224; investiguer comment lever ces deux hy-
poth&#232;ses. La premi&#232;re pourrait &#234;tre lev&#233;e en reformulant le mod&#232;le discriminant comme un
mod&#232;le de reranking sur une analyse en constituants int&#233;gr&#233;e. La seconde demande de mod&#233;li-
ser explicitement des s&#233;quences de d&#233;pendants (incluant arguments et modifieurs) de mani&#232;re &#224;
mod&#233;liser des cadres de sous-cat&#233;gorisation.
</p>
<p>Du point de vue plus linguistique cette fois, il s&#8217;agira d&#8217;exploiter les d&#233;pendances de surface
16Evaluation sur mille phrases du FTB.
17Scores disponibles sous http://w3.erss.univ-tlse2.fr:8080/index.jsp?perso=
</p>
<p>bourigault&amp;subURL=syntex.html.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Candito, Crabb&#233;, Denis, Gu&#233;rin
</p>
<p>(issues de la conversion du FTB ou bien du r&#233;sultat du parser) pour obtenir des d&#233;pendances
plus profondes (relations de contr&#244;le, suppression des mots s&#233;mantiquement vides...).
</p>
<p>R&#233;f&#233;rences
ABEILL&#201; A. &amp; BARRIER N. (2004). Enriching a french treebank. In LREC 2004, Lisbon.
ABEILL&#201; A., CL&#201;MENT L. &amp; TOUSSENEL F. (2003). Building a treebank for French, In
Treebanks. Kluwer : Dordrecht.
ARUN A. &amp; KELLER F. (2005). Lexicalization in crosslinguistic probabilistic parsing : The
case of french. In ACL 2005, p. 306&#8211;313, Ann Arbor, MI.
BERGER A., PIETRA S. D. &amp; PIETRA V. D. (1996). A maximum entropy approach to natural
language processing. Computational Linguistics, 22(1), 39&#8211;71.
BOURIGAULT D., FABRE C., FR&#201;ROT C., JACQUES M.-P. &amp; OZDOWSKA S. (2005). Syntex,
un analyseur syntaxique de corpus. In TALN 2005, Atelier EASy : campagne d&#8217;&#233;valuation des
analyseurs syntaxiques, Dourdan.
CANDITO M., CRABB&#201; B. &amp; SEDDAH D. (2009). On statistical parsing of french with su-
pervised and semi-supervised strategies. In EACL 2009 Workshop Grammatical inference for
Computational Linguistics, Athens.
CARROLL J., BRISCOE T. &amp; SANFILIPPO A. (1998). Parser evaluation : a survey and a new
proposal. In LREC 1998, Granada.
CATHERINE DE MARNEFFE M., MACCARTNEY B. &amp; MANNING C. D. (2006). Generating
typed dependency parses from phrase structure parses. In LREC 2006.
CHARNIAK E. (2000). A maximum entropy inspired parser. In NAACL 2000, p. 132&#8211;139,
Seattle, WA.
COLLINS M. (1999). Head driven statistical models for natural language parsing. PhD thesis,
University of Pennsylvania, Philadelphia.
CRABB&#201; B. &amp; CANDITO M. (2008). Exp&#233;riences d&#8217;analyse syntaxique statistique du fran&#231;ais.
In TALN 2008, p. 45&#8211;54, Avignon.
KAHANE S. (2001). Grammaires de d&#233;pendances formelles et th&#233;orie sens-texte. In TALN
2001, Tours, France.
KING T., CROUCH R., RIEZLER S., DALRYMPLE M. &amp; KAPLAN R. (2003). The parc 700
dependency bank. In EACL workshop on Linguistically Interpreted Corpora, Budapest.
LIN D. (1995). A dependency-based method for evaluating broad-coverage parsers. In IJ-
CAI 1995, p. 1420&#8211;1425, Montreal.
MAGERMAN D. (1995). Statistical decision-tree models for parsing. In ACL 1995, p. 276&#8211;
283, Morristown.
MCDONALD R., CRAMMER K. &amp; PEREIRA F. (2005). Spanning Tree Methods for Dis-
criminative Training of Dependency Parsers. UPenn CIS Technical Report MS-CIS-05-11,
University of Pennsylvania.
PAROUBEK P., POUILLOT L.-G., ROBBA I. &amp; VILNAT A. (2005). Easy : campagne d&#8217;&#233;valua-
tion des analyseurs syntaxiques. In Actes de TALN&#8217;05, Atelier EASy : campagne d&#8217;&#233;valuation
des analyseurs syntaxiques, Dourdan.
SCHLUTER N. &amp; VAN GENABITH J. (2008). Treebank-based acquisition of LFG parsing
resources for french. In LREC 2008, Marrakech, Morocco.</p>

</div></div>
</body></html>