<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un ensemble de ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais : FRANTEXT, TLFi, Dictionnaires de l&#8217;Acad&#233;mie et logiciel Stella, pr&#233;sentation et apprentissage de leurs exploitations</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Un ensemble de ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude 
du fran&#231;ais : FRANTEXT, TLFi, Dictionnaires de l&#8217;Acad&#233;mie et 
</p>
<p>logiciel Stella, pr&#233;sentation et apprentissage de leurs exploitations1 
</p>
<p> 
</p>
<p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
contact@inalf.fr 
</p>
<p>ATILF-CNRS (Analyse et Traitement Informatique de la Langue Fran&#231;aise) 
44 Avenue de la Lib&#233;ration BP30687 F-54063 Nancy-Cedex 
</p>
<p>R&#233;sum&#233;  
</p>
<p>Nous proposons de pr&#233;senter quelques-unes des ressources linguistiques informatis&#233;es que le 
laboratoire ATILF propose sur la toile et leurs diversit&#233;s d&#8217;exploitation potentielle. 
Ces importantes ressources sur la langue fran&#231;aise regroupent un ensemble de divers 
dictionnaires et lexiques, et de bases de donn&#233;es dont les plus importants sont le TLFi (Tr&#233;sor 
de la Langue Fran&#231;aise informatis&#233;) et Frantext (plus de 3500 textes, dont la plupart 
cat&#233;goris&#233;s). Elles exploitent, pour la plupart, les fonctionnalit&#233;s du logiciel Stella, qui 
correspond &#224; un v&#233;ritable moteur de recherche d&#233;di&#233; aux bases textuelles s&#8217;appuyant sur une 
nouvelle th&#233;orie des objets textuels. Tous les sp&#233;cialistes de traitement automatique de la 
langue ainsi que tous les linguistes, syntacticiens aussi bien que s&#233;manticiens, stylisticiens et 
autres peuvent exploiter avec bonheur les possibilit&#233;s offertes par Stella sur le TLFi et autres 
ressources offertes par l&#8217;ATILF. 
Ces recherches peuvent s&#8217;articuler autour des axes suivants : &#233;tudes en vue de rep&#233;rer des 
cooccurrences et collocations, extraction de sous-lexiques, &#233;tudes morphologiques, &#233;tudes de 
syntaxe locale, &#233;tudes de s&#233;mantique, &#233;tudes de stylistique, etc. 
Nous proposons de d&#233;mystifier le maniement des requ&#234;tes sur le TLFi, FRANTEXT et nos 
autres ressources &#224; l&#8217;aide du logiciel Stella, et d&#8217;expliquer et de montrer comment interroger 
au mieux ces ressources et utiliser l&#8217;hyper-navigation mise en place entre ces ressources pour 
en tirer les meilleurs b&#233;n&#233;fices. 
</p>
<p>Mots Cl&#233;s 
</p>
<p>Ressources linguistiques, corpus, dictionnaires, lexiques, Frantext, TLFi, Stella 
</p>
<p>                                                 
1 Ce support de tutorial est inspir&#233; (pour FRANTEXT) de celui propos&#233; par l&#8217;URFIST de Bordeaux, site 
</p>
<p>http://www.montesquieu.u-bordeaux.fr/urfist/niveau2/frantext/frantext0.htm 
</p>
<p>3 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>1. Pr&#233;sentation des ressources textuelles 
</p>
<p>1.1. La base Frantext 
</p>
<p>La base Frantext (1992) peut &#234;tre d&#233;finie comme l&#8217;association d&#8217;une part d&#8217;un vaste corpus de 
textes litt&#233;raires fran&#231;ais, et d&#8217;autre part d&#8217;un logiciel offrant une interface Web avec des 
possibilit&#233;s d&#8217;interrogation de consultation et d&#8217;hyper-navigation. Historiquement, le but 
premier de ce corpus textuel &#233;tait de permettre la constitution d&#8217;une base d&#8217;exemples destin&#233;e 
aux r&#233;dacteurs des articles du TLF. 
La base Frantext contient 3417 textes appartenant aux domaines des sciences, des arts, de la 
litt&#233;rature, des techniques, qui couvrent 5 si&#232;cles de litt&#233;rature (Du 16&#176; au 20&#176;). Elle est 
accessible sur Internet, moyennant un abonnement ou des accords sp&#233;ciaux. En cette ann&#233;e 
2002, il existe une sous-base constitu&#233;e de 30 textes de Victor Hugo, qui est en acc&#232;s libre sur 
le Web. De m&#234;me, une sous-base constitu&#233;e des textes de l&#8217;Agr&#233;gation. Deux versions de 
Frantext sont propos&#233;es : 
- L&#8217;int&#233;gralit&#233; de la base (3417 textes, environ 209 millions d&#8217;occurrences, environ un millier 
d&#8217;auteurs). Les &#339;uvres se r&#233;partissent pour 80% d&#8217;&#339;uvres litt&#233;raires et 20% d&#8217;&#339;uvres 
scientifiques ou techniques. 
- Une sous-partie constitu&#233;e de 1940 textes, soit environ 127 millions d&#8217;occurrences, qui ont 
fait l&#8217;objet d&#8217;un codage grammatical selon les Parties du Discours. Aux fonctionnalit&#233;s du 
Frantext int&#233;gral, ont &#233;t&#233; ajout&#233;es des possibilit&#233;s de requ&#234;tes portant sur les codes 
grammaticaux. 
Pour plus de renseignements se connecter au site : http://www.inalf.fr/frantext si vous &#234;tes 
abonn&#233;s, ou sinon, au site  http://www.inalf.fr/atilf , qui est le site d&#8217;accueil du laboratoire. 
</p>
<p>1.2. Le Tr&#233;sor de la Langue Fran&#231;aise informatis&#233; 
</p>
<p>Le TLFi (Dendien, 1996) est la suite logique du TLF (CNRS, 1976-1994) lequel avait 
d&#233;marr&#233; dans les ann&#233;es 60 avec Frantext (projet qui, &#224; l&#8217;&#233;poque, lui &#233;tait associ&#233;). Le TLFi 
peut &#234;tre vu comme une base de donn&#233;es lexicales en m&#234;me temps qu&#8217;une base de 
connaissances finement structur&#233;e. Son originalit&#233; est fond&#233;e sur des sp&#233;cificit&#233;s li&#233;es &#224; : 
</p>
<p>Son contenu : 
&#8226; Sa nomenclature qui est riche d&#8217;environ 100000 entr&#233;es (vedettes ou sous-vedettes) 
</p>
<p>toutes pr&#233;sentes dans nos fonds et dictionnaires. Original aussi le traitement de 
morph&#232;mes grammaticaux au m&#234;me titre que les autres mots 
</p>
<p>&#8226; Sa liste d&#8217;objets m&#233;tatextuels sur lesquels repose la structuration de l&#8217;article du 
dictionnaire : vedettes, codes grammaticaux, d&#233;finitions, indicateurs stylistiques 
et/ou s&#233;mantiques, constructions , exemples etc.. En tout environ 40 objets 
m&#233;tatextuels. 
</p>
<p>&#8226; Sa grande quantit&#233; d&#8217;exemples r&#233;f&#233;renc&#233;s : environ 430000. 
&#8226; La grande diversit&#233; des rubriques propos&#233;es, concernant l&#8217;&#233;tymologie, la 
</p>
<p>prononciation, la bibliographie etc. 
</p>
<p>Sa structure : 
&#8226; Le dictionnaire a &#233;t&#233; balis&#233; en XML et des balises sp&#233;ciales ont &#233;t&#233; inject&#233;es pour 
</p>
<p>pouvoir d&#233;limiter et atteindre chaque type d&#8217;objet textuel. Ainsi, si la recherche plein 
</p>
<p>4 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>texte sur la totalit&#233; du contenu du dictionnaire reste toujours permise, il est possible 
aussi d&#8217;&#233;liminer le &#171; bruit &#187; inh&#233;rent &#224; un tel type de requ&#234;tes. Il est en effet possible 
de restreindre cette recherche plein texte &#224; une recherche plus &#171; pointue &#187; sur un type 
particulier d&#8217;objet textuel. 
</p>
<p>&#8226; De plus, une seconde dimension a &#233;t&#233; introduite : ces objets textuels ont &#233;t&#233; 
hi&#233;rarchis&#233;s, &#224; l&#8217;aide d&#8217;une s&#233;rie de balises sp&#233;cifiques et d&#8217;une grammaire de 
contr&#244;le. 
</p>
<p>De par le traitement hautement &#233;labor&#233; qui a permis de d&#233;composer le texte du TLF en objets 
&#233;l&#233;mentaires (d&#233;finitions, exemples, indicateurs de domaine technique, indicateurs 
s&#233;mantiques, grammaticaux, stylistiques, etc.) et d'analyser les relations hi&#233;rarchiques liant 
ces objets, il r&#233;sulte des possibilit&#233;s d'interrogation virtuellement illimit&#233;es. 
</p>
<p>1.3. Les Dictionnaires de l&#8217;Acad&#233;mie 
</p>
<p>Il existe &#224; l&#8217;ATILF, parmi les Dictionnaires anciens, 5 versions des Dictionnaires de 
l&#8217;Acad&#233;mie Fran&#231;aise. Trois ont &#233;t&#233; &#233;tablies en coop&#233;ration avec ARTFL (Acad&#233;mie 1e 
&#233;dition 1694, Acad&#233;mie 5e &#233;dition 1798, Acad&#233;mie 6e &#233;dition 1835). Les deux autres 
(Acad&#233;mie 8e &#233;dition 1932-35, et Acad&#233;mie 9e &#233;dition &#8211;volume paru en 1992) se trouvent &#224; la 
fois sur le site de l&#8217;Acad&#233;mie Fran&#231;aise et sur le site de l&#8217;ATILF 
http://www.inalf.fr/academie8 et http://www.inalf.fr/academie9. Ces deux derni&#232;res ont &#233;t&#233; 
trait&#233;es et pr&#233;par&#233;es &#224; l&#8217;ATILF, et font partie des bases accessibles via le logiciel Stella. Par 
exemple, la huiti&#232;me &#233;dition a &#233;t&#233; num&#233;ris&#233;e &#224; partir de l&#8217;original, puis relue, puis balis&#233;e, le 
codage ayant suivi les sp&#233;cifications &#233;labor&#233;es au cours de l&#8217;Atelier de balisage de Limoges 
(Leroy-Turcan, DictA1998). Pour de plus amples renseignements, se reporter au site de 
l&#8217;ATILF/Dictionnaires anciens. 
</p>
<p>Ces importantes ressources sur la langue fran&#231;aise exploitent les fonctionnalit&#233;s du logiciel 
Stella, qui correspond &#224; un v&#233;ritable moteur de recherche d&#233;di&#233; aux bases textuelles. Le 
logiciel Stella propose des formulaires de requ&#234;tes, et une riche aide en ligne pour 
accompagner l&#8217;utilisateur tout au long de son parcours dans les bases, et pour l&#8217;aider dans son 
hyper-navigation &#224; travers ces richesses. (Pour tirer le meilleur parti de nos ressources, 
l&#8217;utilisateur est cens&#233; conna&#238;tre les principes de base du World Wide Web ainsi que les 
sp&#233;cificit&#233;s du navigateur qu&#8217;il utilise. Il est donc inutile de chercher dans l&#8217;aide en ligne les 
informations relevant de ces connaissances) 
</p>
<p>2. Le Logiciel Stella 
</p>
<p>2.1. Pr&#233;sentation g&#233;n&#233;rale : 
</p>
<p>Stella (Dendien, 1991 ; Bernard et al. 2002) est le logiciel qui anime la base de donn&#233;es 
Frantext, le TLFi, ainsi que les versions informatis&#233;es de deux des &#233;ditions des Dictionnaires 
de l&#8217;Acad&#233;mie Fran&#231;aise ( 8e &#233;dition de 1935 et 9e &#233;dition (en cours)). Ce logiciel qui a &#233;t&#233; 
int&#233;gralement d&#233;velopp&#233; &#224; l&#8217;ATILF a longtemps travaill&#233; sur un balisage &#171; maison &#187;. Il a 
&#233;volu&#233; et consomme (et produit) maintenant du XML. Il peut s&#8217;appliquer &#224; tout ensemble de 
donn&#233;es textuelles, structur&#233;es ou non. Le logiciel Stella se pr&#233;sente comme une bo&#238;te &#224; outils 
(C++) comportant diff&#233;rents volets : 
</p>
<p>5 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>&#8226; Des utilitaires divers incluant tris, traitement des expressions r&#233;guli&#232;res, et surtout une 
base de donn&#233;es fond&#233;e sur la nomenclature du TLF permettant des op&#233;rations de 
flexion ou de lemmatisation. 
</p>
<p>&#8226; Une interface Web permettant la mise en &#339;uvre facile d&#8217;interfaces utilisateur, des 
fonctions de gestion de &#8220; sessions utilisateur &#8221; et de gestion d&#8217;espace de travail sur le 
serveur. 
</p>
<p>&#8226; Une solution permettant une hyper-navigation entre les diff&#233;rentes applications g&#233;r&#233;es 
par Stella, qu&#8217;elles r&#233;sident ou non sur un m&#234;me serveur. L&#8217;hyper-navigation permet 
une liaison dynamique entre les diff&#233;rentes ressources textuelles : une m&#234;me requ&#234;te 
via une des ressources peut ainsi &#234;tre compl&#233;t&#233;e par l&#8217;hyper-navigation dans les autres 
ressources ; il est ainsi possible, en cliquant sur n&#8217;importe quel mot d&#8217;une page 
affich&#233;e par l&#8217;une des bases g&#233;r&#233;es par Stella de d&#233;clencher l&#8217;apparition d&#8217;un menu 
d&#233;roulant proposant de le rechercher dans n&#8217;importe laquelle des autres bases.  
</p>
<p>&#8226; Un syst&#232;me complet de gestion de base textuelle  assurant &#224; la fois les fonctions de 
stockage et d&#8217;acc&#232;s &#224; l&#8217;information. 
</p>
<p>2.2. Les sp&#233;cificit&#233;s de Stella 
</p>
<p>La conception de Stella, en tant que logiciel de gestion de base textuelle, repose sur des 
principes math&#233;matiques rigoureux (Dendien, 1991) : 
</p>
<p>2 .2.1. Fonctions de &#8220; bas niveau &#8221; 
</p>
<p>Ces fonctions permettent de fabriquer et de g&#233;rer les structures de stockage de l&#8217;information. 
Elles reposent sur un syst&#232;me d&#8217;indexation garantissant un stockage optimal des donn&#233;es en 
terme d&#8217;encombrement.  Ce sont elles qui permettent de localiser rapidement les occurrences 
d&#8217;un objet textuel &#233;l&#233;mentaire (mot) au sein du corpus. 
</p>
<p>2.2.2. Fonction de &#8220; haut niveau &#8221; 
</p>
<p>Les fonctions de haut niveau permettent de s&#8217;attaquer au m&#234;me probl&#232;me pour la localisation 
d&#8217;objets textuels beaucoup plus complexes. Ces fonctions de haut niveau reposent sur une 
th&#233;orie des objets textuels dont les principes sont les suivants : tout objet textuel est 
manipulable par des m&#233;thodes standard permettant d&#8217;impl&#233;menter son moteur de recherche ; 
un ensemble de lois de composition (dont les plus simples sont les listes et les s&#233;quences) 
permet de fabriquer des objets textuels nouveaux, dits objets composites, &#224; l&#8217;aide d&#8217;objets 
&#233;l&#233;mentaires ou d&#8217;autres objets composites.  
</p>
<p>De ces principes, on peut d&#233;duire les cons&#233;quences suivantes : 
</p>
<p>&#8226; Il est possible de fabriquer des objets composites d&#8217;une complexit&#233; arbitrairement 
&#233;lev&#233;e en appliquant successivement les lois de composition autant de fois que l&#8217;on 
veut. 
</p>
<p>6 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>&#8226; Tout objet composite est automatiquement muni de son moteur de recherche, qui se 
d&#233;duit des moteurs de recherche de ses composants, et, par r&#233;cursivit&#233;, des moteurs 
de recherche des objets &#233;l&#233;mentaires &#224; l&#8217;origine de sa construction. 
</p>
<p>&#8226; Il est possible de fabriquer des objets &#233;l&#233;mentaires nouveaux, dits objets natifs, de 
mani&#232;re tout &#224; fait arbitraire : il suffit pour cela de les doter des m&#233;thodes standard. 
Ces objets natifs pourront &#224; leur tour rentrer comme &#233;l&#233;ments de fabrication d&#8217;objets 
composites. Par exemple, si on d&#233;finit un objet &#8220; joker &#8221; muni de m&#233;thodes de 
localisation (particuli&#232;rement faciles &#224; impl&#233;menter car elles expriment que ce joker 
est un objet situ&#233; n&#8217;importe o&#249;), il devient possible de d&#233;finir un objet composite de 
type &#8220; s&#233;quence &#8221; comportant successivement le mot &#8220; un &#8221;, le joker, et le mot 
&#8220; homme &#8221; pour localiser toutes les occurrences de &#8220; un XX homme &#8221;, dans laquelle 
XX d&#233;signe un mot quelconque. Un autre exemple de constructeur d&#8217;objet natif 
admettant comme param&#232;tre l&#8217;infinitif d&#8217;un verbe, consiste &#224; fabriquer la liste 
compos&#233;e des objets &#233;l&#233;mentaires correspondant &#224; chacune de ses formes fl&#233;chies. 
Le moteur de recherche de cet objet localisera l&#8217;ensemble de formes fl&#233;chies du 
verbe donn&#233; en param&#232;tre. 
</p>
<p>Ce m&#233;canisme de cr&#233;ation d&#8217;objets composites ou natifs conf&#232;re &#224; Stella une architecture 
totalement ouverte &#224; bien des &#233;gards. L&#8217;ensemble des lois de composition est ouvert : 
l&#8217;impl&#233;mentation de lois nouvelles permet la cr&#233;ation d&#8217;objets composites nouveaux. Par 
exemple, si un texte a &#233;t&#233; segment&#233; et &#233;tiquet&#233; &#224; l&#8217;aide d'un analyseur morpho-syntaxique, il 
est possible de cr&#233;er (comme cela est fait dans Frantext) un objet composite repr&#233;sentant &#224; la 
fois le contenu textuel et les attributs grammaticaux associ&#233;s (par ex. contenu &#8220; tire-bouchon &#8221; 
et attribut &#8220; substantif &#8221;). L&#8217;ensemble des objets natifs peut s&#8217;enrichir &#224; l&#8217;infini. Tout nouvel 
objet natif peut entrer dans la fabrication d&#8217;objets composites, d&#233;multipliant ainsi leur 
combinatoire. Les objets natifs nouveaux (on l&#8217;a vu plus haut dans l&#8217;impl&#233;mentation des 
formes fl&#233;chies d&#8217;un verbe) permettent d&#8217;introduire facilement un &#8220; savoir linguistique &#8221;. Par 
exemple, rien n&#8217;est plus facile que d&#8217;introduire, si on le d&#233;sire, les d&#233;clinaisons latines. 
</p>
<p>Ce qui permet &#224; Stella de g&#233;rer des bases aussi diverses que le TLFi, Frantext, les 
Dictionnaires de l&#8217;Acad&#233;mie, et de permettre une hyper-navigation instantan&#233;e &#224; travers 
toutes ces bases. Une aide en ligne est associ&#233;e &#224; chaque &#233;tape de la requ&#234;te, pour expliquer &#224; 
l&#8217;utilisateur les possibilit&#233;s de choix, la &#171; syntaxe &#187; de la requ&#234;te, la marche &#224; suivre&#8230; 
</p>
<p>2.3. Stella et Frantext 
</p>
<p> 
Les principes d&#8217;interrogation dans les deux bases sont les m&#234;mes : vous entrez dans la base et 
vous cliquez sur Menu de Frantext, puis vous vous laissez guider. 
</p>
<p>3.3.1. Principes de base du travail sur Frantext  :  
</p>
<p>On peut distinguer 2 phases fondamentales dans le travail : choix des textes que l&#8217;on veut 
&#233;tudier, puis S&#233;rie d&#8217;&#233;tudes portant sur les textes choisis. La recherche d&#233;bute donc par la 
cr&#233;ation du corpus de travail. Il est ensuite possible de le visualiser, d'effectuer des 
recherches puis de t&#233;l&#233;charger les donn&#233;es.  
</p>
<p>1&#232;re &#233;tape : La s&#233;lection du corpus de travail peut s&#8217;effectuer sur :  
</p>
<p>7 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>- L&#8217;ensemble des textes de la base  
- Un ou plusieurs auteurs  
</p>
<p>Recherche d&#8217;un auteur : saisie en minuscule.  (Exemple zola,flaubert,hugo)  
Saisie de plusieurs auteurs : utiliser la virgule pour s&#233;parer les noms. Les noms 
peuvent &#234;tre donn&#233;s de mani&#232;re fragmentaire. (Exemple : auber suffit pour 
s&#233;lectionner Flaubert)  
</p>
<p>- Une &#339;uvre : 
Recherche d'un titre   En minuscule. (Exemple : La saisie de &quot;dame&quot; s&#233;lectionne &quot;Au 
bonheur des dames&quot;, &quot;Notre Dame de Paris&quot;, etc...) 
</p>
<p>- Un ou plusieurs genres litt&#233;raires  
- Une tranche chronologique  
- La combinaison de plusieurs crit&#232;res 
Pendant une session(12 heures), la recherche s'effectue sur le corpus s&#233;lectionn&#233;. Si l'on 
souhaite s&#233;lectionner un nouveau corpus, il est n&#233;cessaire de r&#233;activer Frantext. 
</p>
<p>2&#232;me &#233;tape : les requ&#234;tes sur le corpus de travail  
</p>
<p>La nouvelle version du logiciel poss&#232;de des fonctionnalit&#233;s qui permettent &#224; l&#8217;utilisateur de 
formuler des requ&#234;tes complexes. Certaines sont simples &#224; mettre en &#339;uvre, d&#8217;autres sont plus 
compliqu&#233;es. Une aide en ligne accompagne chaque service.   
Recherches simples : une graphie ; une phrase ; plusieurs graphies en cooccurrence dans une 
ou plusieurs phrases. 
Recherches plus complexes :  
</p>
<p>- les formes fl&#233;chies d&#8217;un verbe, d&#8217;un substantif ou d&#8217;un adjectif ;  
- des formes tronqu&#233;es : les mots suffix&#233;s en &quot; ette &quot; par ex. ;  
- des listes de mots ;  
- des expressions &#224; choix multiples en une seule requ&#234;te. Par ex. &quot;maison (blanche | 
</p>
<p>verte | jaune)&quot; recherchera maison blanche, maison verte, maison jaune ;  
- des statistiques sur la fr&#233;quence des mots ;  
- des &#233;tudes de vocabulaire autour d&#8217;un mot pivot (par ex. le vocabulaire employ&#233; 
</p>
<p>dans les phrases contenant le mot &quot;abeille&quot;) ;  
- des ph&#233;nom&#232;nes linguistiques complexes tels que la quantification, les constructions 
</p>
<p>pronominales, les temps compos&#233;s, etc. ; ce type de recherche est rendu possible 
gr&#226;ce &#224; l&#8217;&#233;criture de grammaires formelles constitu&#233;es de r&#232;gles param&#233;trables. Ces 
grammaires permettent de rechercher des contextes arbitrairement complexes sur le 
corpus.  
</p>
<p> 
Il est possible au terme de sa recherche de t&#233;l&#233;charger les r&#233;sultats. La proc&#233;dure d&#233;pend du 
navigateur Internet utilis&#233; par le chercheur. Il suffit d&#8217;enregistrer les r&#233;sultats dans un fichier 
sur son disque dur. On peut ensuite ouvrir ce fichier &#224; l&#8217;aide d&#8217;un &#233;diteur de texte. Les 
r&#233;sultats sont encod&#233;s suivant la norme ISO 8859-1. Cette norme d&#233;finit la grille de codes des 
caract&#232;res. Elle est compatible avec les usages en vigueur sur les principaux syst&#232;mes (MS-
Windows, Unix, Mac-OS, &#8230;). 
</p>
<p>La longueur des contextes obtenus dans la base FRANTEXT est limit&#233;e &#224; trois pages pour les 
textes libres de droits, et &#224; une courte citation de 300 signes pour les textes prot&#233;g&#233;s. 
</p>
<p>8 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>2.3.2. Les principes de recherche :  
</p>
<p>Les crit&#232;res de recherches peuvent &#234;tre :  
&#8226; saisis au cours d'un session (recherche simple avec saisie d'expressions de s&#233;quence),  
&#8226; saisis dans une liste pr&#233;par&#233;e avant d'effectuer un recherche : &quot;cr&#233;ation/&#233;dition de 
</p>
<p>listes de mots&quot;, ou en utilisant une &quot;grammaire&quot; pr&#233;d&#233;finie  
2.3.2.1.  Les r&#232;gles de saisie d'une expression de s&#233;quence : 
Une expression de s&#233;quence a pour but de rechercher des contextes contenant une suite de 
mots cons&#233;cutifs (d'o&#249; le terme s&#233;quence) tels que maison blanche ou le chien noir de la 
ferme ou des choses beaucoup plus &#233;labor&#233;es.  
La saisie d'une expression de s&#233;quence est effectu&#233;e sur le formulaire disponible sous l'option 
&quot;recherche dans les textes&quot;. 
La saisie d'une s&#233;quence : consiste &#224; saisir une suite de mots cons&#233;cutifs. Une expression de 
s&#233;quence est constitu&#233;e de N sous-expressions. 
</p>
<p>Pour &#233;crire une expression de s&#233;quence : 
</p>
<p>&#8226; Op&#233;rateur ET, mat&#233;rialis&#233; par la juxtaposition de deux mots : 
Ex. : maison blanche cherche maison blanche 
&#8226; Op&#233;rateur OU, mat&#233;rialis&#233; par la barre verticale | et les parenth&#232;ses) 
Ex. : (maison|palais) d&#8217;un (blanc|bleu)sale va chercher maison d&#8217;un blanc sale, maison 
</p>
<p>d&#8217;un bleu sale, palais d&#8217;un blanc sale, palais d&#8217;un bleu sale.  
&#8226; Verbe fl&#233;chi : &amp;c 
Ex. : &amp;caimer va chercher toutes les formes du verbe aimer, conjugu&#233;es ou non. 
&#8226; Substantif ou Adjectif fl&#233;chi : &amp;m 
Ex. : &amp;m bocal va chercher bocal bocaux 
</p>
<p>  &amp;m grand va chercher grand, grande, grandes, grands 
&#8226; Sous-expressions optionnelles : &amp; ? et &#233;ventuellement des parenth&#232;ses. 
Ex. :  un&amp; ?grand homme cherche un homme ou un grand homme 
</p>
<p>  un &amp; ?(tr&#232;s grand) homme cherchera un homme ou un tr&#232;s grand homme 
&#8226; Mot quelconque : &amp;q   introduisant une discontinuit&#233; dans la s&#233;quence.  
Ex. : Un &amp;qhomme cherchera une s&#233;quence Un (&#8230;) homme avec un mot entre un et homme 
</p>
<p>Un &amp;q(0,2) homme cherchera une s&#233;quence avec 0, 1 ou 2 mots entre un et homme. 
&#8226; La n&#233;gation: ^ 
Ex. : homme ^tr&#232;s grand qui est une expression de s&#233;quence qui va chercher tous les 
contextes du genre homme XXX grand qui tels que XXX ne soit pas &#233;gal &#224; tr&#232;s.  
</p>
<p>homme ^(tr&#232;s grand) est une expression de s&#233;quence qui va chercher tous les contextes 
du genre homme XXX tels que ou bien XXX est diff&#233;rent de tr&#232;s, ou bien XXX est &#233;gal &#224; tr&#232;s 
et le mot suivant est diff&#233;rent de grand (autrement dit XXX n'est pas le point de d&#233;part d'une 
s&#233;quence tr&#232;s grand).  
</p>
<p>&amp;carriver ^&amp;e(g=A) &#224; est une expression de s&#233;quence qui va s&#233;lectionner des 
contextes tels que arriveront vite &#224;, mais pas un contexte tel que arrivaient en m&#234;me temps &#224;. 
En effet ^&amp;e(g=A) d&#233;signe une graphie qui n'est pas un adjectif, mais ne d&#233;signe pas une 
entit&#233; cat&#233;goris&#233;e qui n'est pas un adjectif : cette derni&#232;re d&#233;signation se noterait en effet 
&amp;e(g!=A). On prendra donc bien garde &#224; ne pas confondre ^&amp;e(g=A) et &amp;e(g!=A).  
</p>
<p>Exemples de remplissage de formulaire : 
</p>
<p>Exemple 1 : On d&#233;sire rechercher le mot cheval au singulier. Il suffit de taper cheval dans le 
cadre s&#233;quence 1 et de soumettre la demande.  
</p>
<p>9 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>Exemple 2 : On d&#233;sire rechercher le mot cheval au singulier ou au pluriel. Il suffit de taper 
&amp;mcheval dans le cadre s&#233;quence 1 et de soumettre la demande.  
</p>
<p>Exemple 3 : On d&#233;sire rechercher le mot cheval au singulier ou au pluriel lorsque ce mot 
appara&#238;t dans la m&#234;me phrase que le mot selle. Il suffit :  
</p>
<p>de taper &amp;mcheval dans le cadre s&#233;quence 1  
de taper selle dans le cadre s&#233;quence 2  
</p>
<p>Exemple 4 : On d&#233;sire chercher les phrases qui contiennent le mot femme, sans que le mot 
homme n'apparaisse &#224; droite du mot femme &#224; moins de 10 mots. Il suffit de  :  
taper femme dans le cadre s&#233;quence 1  
taper homme dans le cadre s&#233;quence 2 et de choisir sur la m&#234;me ligne l'option Exclu  
choisir dans &quot;Positions relatives des s&#233;quences 1 et 2 &quot; l'option 1 AVANT 2 et sur la m&#234;me 
ligne de remplir le cadre &quot;distance maximale&quot; avec la valeur 10  
</p>
<p>En ce qui concerne les expressions cat&#233;goris&#233;es, les diff&#233;rentes syntaxes sont :  
</p>
<p>&amp;e(g=yyy) d&#233;signe une entit&#233; ayant le code grammatical pr&#233;cis&#233; par yyy, o&#249; yyy est une 
cha&#238;ne de caract&#232;res form&#233;e par un ou plusieurs codes grammaticaux.  
Exemples : 
&amp;e(g=S) d&#233;signe un substantif.  
&amp;e(g=S A) d&#233;signe un substantif ou un adjectif. (On se reportera &#224; la liste des codes 
disponibles pour conna&#238;tre l'ensemble des codes existants).  
</p>
<p>&amp;e(g!=yyy) d&#233;signe une entit&#233; n'ayant pas le code grammatical pr&#233;cis&#233; par yyy. 
Exemples : 
&amp;e(g!=S) d&#233;signe une entit&#233; autre que substantif.  
&amp;e(g!=S A) d&#233;signe une entit&#233; autre que substantif ou adjectif. 
</p>
<p>&amp;e(c=expression) d&#233;signe une entit&#233; cat&#233;goris&#233;e ayant un contenu textuel conforme &#224; 
expression. Une expression de contenu textuel est une expression de s&#233;quence qui ne comporte 
aucune expression &amp;e(xxx) : en effet, les graphies contenues dans une entit&#233; cat&#233;goris&#233;e ne 
sont pas elles-m&#234;mes cat&#233;goris&#233;es. 
</p>
<p>Exemples : 
&amp;e(c=tire-) recherche les entit&#233;s cat&#233;goris&#233;es contenant tire-  
&amp;e(c=(&amp;mdemi &amp;q|&amp;q &amp;mdemi)) recherche les entit&#233;s cat&#233;goris&#233;es contenant au moins deux 
mots, dont demi, demis, demie ou demies  
&amp;e(c!=expression) est une entit&#233; n'ayant pas le contenu indiqu&#233; par expression. 
 
Expressions d'entit&#233;s composites : toutes les possibilit&#233;s ci-dessus peuvent se combiner entre 
elles. 
Exemple :  
&amp;e(c=(&amp;mdemi &amp;q | &amp;q &amp;mdemi) c!=&amp;mheure g=S) d&#233;signe une entit&#233; comportant au moins 
deux mots (dont demi fl&#233;chi), mais ne contenant ni heure, ni heures, et qui de surcro&#238;t soit un 
substantif. 
</p>
<p>On notera que l'ordre des expressions c=..., g=... au sein d'une m&#234;me entit&#233; cat&#233;goris&#233;e est 
indiff&#233;rent. On aurait pu &#233;crire l'entit&#233; ci-dessus sous la forme strictement &#233;quivalente : 
&amp;e(g=S c!=&amp;mheure c=(&amp;mdemi &amp;q | &amp;q &amp;mdemi)) 
</p>
<p>10 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>2.3.2.2. Les listes 
Il est possible de d&#233;finir au pr&#233;alable une liste de mots qui servira ensuite de crit&#232;re de 
recherche sur le corpus s&#233;lectionn&#233;. Les listes de mots sont des fichiers stock&#233;s sur un espace 
disque temporaire du centre serveur. Les listes sont disponibles tant que votre session 
FRANTEXT est en cours.  
</p>
<p>La cr&#233;ation de listes : 
Plusieurs possibilit&#233;s sont offertes :  
</p>
<p>- La cr&#233;ation manuelle d'une liste  
- La cr&#233;ation d'une liste par flexion d'un lemme  
- La cr&#233;ation d'une liste extraite de l'ensemble des graphies du corpus de travail  
</p>
<p>Vous pouvez relire ou &#233;diter une liste d&#233;j&#224; cr&#233;&#233;e. 
</p>
<p>Cr&#233;ation d'une liste par flexion d'un lemme  
Il suffit de saisir l'infinitif s'il s'agit d'un verbe, le singulier s'il s'agit d'un substantif, le 
masculin singulier s'il s'agit d'un adjectif.  
</p>
<p>Cr&#233;ation d'une liste &#224; partir des graphies du corpus de travail  
Le crit&#232;re de s&#233;lection vous permet de d&#233;finir quelles graphies du corpus de travail seront 
s&#233;lectionn&#233;es. Par exemple, le crit&#232;re .*ismes? s&#233;lectionne tous les mots se terminant par isme 
ou ismes. 
</p>
<p>La syntaxe g&#233;n&#233;rale d'un crit&#232;re est la suivante :  
&#8226; Le symbole . (point) d&#233;signe n'importe quel caract&#232;re.  
</p>
<p>Ex. : .oule s&#233;lectionnera les mots boule, coule, foule, etc. 
</p>
<p>&#8226; Une expression telle que [abcd] d&#233;signe un caract&#232;re qui est soit a, soit b, soit c, soit d.  
Ex. : coule[sr] s&#233;lectionnera les mots coules ou couler. 
</p>
<p>&#8226; Une expression telle que [^abcd] d&#233;signe un caract&#232;re quelconque, &#224; condition qu'il soit 
diff&#233;rent de a ,b,c ou d.  
Ex. : [^cr]oule s&#233;lectionnera les mots foule, houle, poule, etc. mais pas les mots coule et roule. 
</p>
<p>&#8226; Les parenth&#232;ses servent &#224; d&#233;limiter un groupe de caract&#232;res. Un groupe peut &#234;tre subdivis&#233; en 
plusieurs sous-groupes par le symbole |. Ce symbole signifie qu'il y a alternative.  
</p>
<p>Ex. : cheva(l|ux) s&#233;lectionnera cheval ou chevaux. 
&#8226; Les parenth&#232;ses peuvent &#234;tre imbriqu&#233;es &#224; plusieurs niveaux :  
</p>
<p>Ex. (crainti(f|ve)|peureu(x|se)) s&#233;lectionnera craintif, craintive, peureux, peureuse. 
</p>
<p>&#8226; Symboles de modification.  
Le symbole * plac&#233; derri&#232;re un caract&#232;re ou un groupe signifie que ce caract&#232;re ou groupe peut 
&#234;tre absent ou se r&#233;p&#233;ter un nombre quelconque de fois. Ce symbole peut se placer derri&#232;re 
n'importe quel caract&#232;re ou groupe, mais il est en fait tr&#232;s pratique lorsqu'il est associ&#233; au 
symbole . (point) d&#233;signant n'importe quel caract&#232;re.  
Ex. : .*form.* s&#233;lectionnera les mots contenant la cha&#238;ne &quot;form&quot; tels que form&#233;e, r&#233;forme, 
informel etc. 
Ex. : bla(bla)* s&#233;lectionnera bla, blabla, blablabla, ... 
</p>
<p>&#8226; Le symbole + plac&#233; derri&#232;re un caract&#232;re ou un groupe signifie que ce caract&#232;re ou groupe 
peut se r&#233;p&#233;ter un nombre quelconque de fois (mais au moins une fois).  
</p>
<p>11 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>Ex. : .+form.* s&#233;lectionnera les mots contenant la cha&#238;ne &quot;form&quot; pr&#233;c&#233;d&#233;e d'au moins un 
caract&#232;re.  
Ex. : bla(bla)+ s&#233;lectionnera blabla, blablabla, ... 
</p>
<p>&#8226; Le symbole ? plac&#233; derri&#232;re un caract&#232;re ou un groupe signifie que ce caract&#232;re ou groupe est 
optionnel.  
Ex. : a?politiques? s&#233;lectionnera les mots politique, politiques, apolitique et 
apolitiques.  
Ex. cin&#233;ma(tograph(e|ique))?s? s&#233;lectionnera : cin&#233;ma, cin&#233;mas, cin&#233;matographe, 
cin&#233;matographes,cin&#233;matographique, cin&#233;matographiques. 
</p>
<p>L'utilisation des listes pour la recherche sur le corpus : 
</p>
<p>Sur le formulaire de recherche saisir : &amp;lxxx, o&#249; xxx d&#233;signe le nom de la liste cr&#233;&#233;e.  
Exemple : Si, dans une liste de nom couleur on a les mots rouge, vert, jaune, on peut &#233;crire 
l'expression de s&#233;quence suivante : volet &amp;lcouleur pour chercher volet rouge, volet vert, 
volet jaune. 
</p>
<p>2.3.2.3. Les grammaires :  
Les grammaires permettent de formuler des expressions de recherche capables de localiser 
dans un corpus des occurrences de ph&#233;nom&#232;nes multiformes : par exemple, une r&#233;f&#233;rence &#224; 
une p&#233;riode peut prendre la forme d&#232;s 1954, ou en juillet dernier/prochain, la semaine 
derni&#232;re/prochaine, etc. Les grammaires (au sens de la th&#233;orie des langages) ne sont pas &#224; 
confondre avec les grammaires des langues naturelles. En revanche, elles permettent de 
rechercher des ph&#233;nom&#232;nes (par exemple une construction pronominale de verbe) qui peuvent 
se manifester sous des formes tr&#232;s variables en raison des r&#232;gles syntaxiques du fran&#231;ais.  
</p>
<p>L'int&#233;r&#234;t des grammaires est triple :  
Une grammaire est un recueil d'expression de s&#233;quences tap&#233;es une fois pour toutes par 
l'utilisateur.  
Les expressions de s&#233;quences peuvent &#234;tre param&#233;tr&#233;es, ce qui permet de les utiliser pour des 
recherches multiples.  
Une grammaire permet d'&#233;laborer facilement des expressions de s&#233;quences d'une complexit&#233; 
arbitrairement &#233;lev&#233;e.  
Une grammaire est un fichier qui peut &#234;tre saisi par l'utilisateur gr&#226;ce au service de cr&#233;ation 
de grammaire.  
</p>
<p>Qu'est-ce qu'une grammaire ? 
Une grammaire est un fichier qui contient est une suite de r&#232;gles. Chaque r&#232;gle de grammaire 
a un nom et un corps.  
</p>
<p>Le nom d'une r&#232;gle est une cha&#238;ne de caract&#232;res compos&#233;e des caract&#232;res de a &#224; z (majuscule 
ou minuscule), de chiffres de 0 &#224; 9, et des caract&#232;res - (moins) et _ (tiret de soulignement). Il 
doit &#234;tre suivi d&#8217;un blanc puis du caract&#232;re : puis d'un retour &#224; la ligne.  
Le corps de la r&#232;gle peut s'&#233;tendre sur plusieurs lignes : un retour &#224; la ligne dans le corps 
d'une r&#232;gle n'a aucune signification.  
</p>
<p>a) Exemple de grammaire appel&#233;e &quot;essai&quot; : (en italique : le nom de la r&#232;gle, et en gras : le 
corps de la r&#232;gle ) 
</p>
<p>12 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>quantifieur : tr&#232;s|assez|plus|excessivement  
qualifieur : grand|gros||petit  
qualification : &amp;rqualifieur|&amp;rquantifieur &amp;rqualifieur 
</p>
<p>La grammaire est ensuite utilis&#233;e (ou invoqu&#233;e) pour rechercher sur le corpus pr&#233;d&#233;fini. 
Dans notre exemple, il suffit de saisir sur le formulaire de recherche : &amp;rqualifieur,essai 
homme, ce qui permet d'invoquer la grammaire appel&#233;e &quot;essai&quot; et de rechercher des 
expressions comme &quot;grand homme, petit homme, gros homme&quot;. 
On peut aussi saisir sur le formulaire de recherche : &amp;rqualification,essai homme, ce qui 
permet d'invoquer la grammaire appel&#233;e &quot;essai&quot; et de rechercher des expressions comme &quot;tr&#232;s 
grand homme, petit homme, plus gros homme&quot;. 
 
b) Elaboration d&#8217;une grammaire : nous voyons ci-dessous en d&#233;tail l&#8217;&#233;laboration d'une 
grammaire capable de rechercher les contextes contenant des constructions pronominales de 
verbes. Par simplification, les phrases interrogatives sont laiss&#233;es de c&#244;t&#233; et nous supposerons 
que le sujet du verbe est un pronom.  
</p>
<p>Les usages pronominaux sont :  
temps simple : je me/m' (ou tu te/t', il/elle/ils/elles/on/qui se/s', nous nous, vous vous) + une 
forme verbale 
 temps compos&#233; : je me/m' (ou tu te/t', il/elle/ils/elles/on/qui se/s', nous nous, vous vous) + 
auxiliaire &#234;tre +participe pass&#233;  
temps simple avec n&#233;gation : je ne me/m' (ou tu ne te/t', il/elle/ils/elles/on/qui ne se/s', nous ne 
nous, vous ne vous) + une forme verbale + pas/plus/jamais/gu&#232;re/point/mie/etc.  
temps compos&#233; avec n&#233;gation : je ne me/m' (ou tu ne te/t', il/elle/ils/elles/on/qui ne se/s', nous 
ne nous, vous ne vous) + auxiliaire &#234;tre + pas/plus/jamais/gu&#232;re/point/mie/etc. + participe 
pass&#233;  
</p>
<p>On constate que temps simple et temps compos&#233; (sans n&#233;gation) commencent de la m&#234;me 
fa&#231;on, que nous pouvons d&#233;crire avec une premi&#232;re r&#232;gle de grammaire de nom affirmatif : 
</p>
<p>affirmatif : 
je (me|m') | tu(te|t') | (il|elle|ils|elles|on|qui) (se|s') |nous nous | vous vous  
Remarque : le corps d'une r&#232;gle peut s'&#233;tendre sur plusieurs lignes (un retour &#224; la ligne 
</p>
<p>n'a aucune signification).  
Il  est maintenant facile d'&#233;crire la r&#232;gle temps_simple_affirmatif pour les temps simples :  
</p>
<p>temps_simple_affirmatif : 
&amp;raffirmatif &amp;e(g=V)  
</p>
<p>De m&#234;me nous pouvons &#233;crire la r&#232;gle temps_compose_affirmatif pour les temps compos&#233;s :  
temps_compose_affirmatif : 
&amp;raffirmatif &amp;c&#234;tre &amp;e(g=Ps)  
</p>
<p>De la m&#234;me fa&#231;on, nous &#233;crivons la suite de la grammaire :  
negatif : 
je ne (me|m') | tu ne (te | t') | (il|elle|ils|elles|on|qui) ne (se|s') |nous ne nous | vous ne vous  
temps_simple_negatif : 
&amp;rnegatif &amp;e(g=V) &amp;rfin_negation  
</p>
<p>Remarque : nous pr&#233;ciserons plus loin que la r&#232;gle fin_negation correspond &#224; 
pas/plus/jamais/gu&#232;re/point/mie/etc.  
</p>
<p>temps_compose_negatif : 
&amp;rnegatif &amp;c&#234;tre &amp;rfin_negation &amp;e(g=Ps)  
fin_negation : 
pas|plus|jamais|gu&#232;re|mie|point  
</p>
<p>13 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>Enfin, il  reste &#224; r&#233;unir les quatre cas de figure en une seule r&#232;gle : 
usage_pronominal : 
&amp;rtemps_simple_affirmatif | &amp;rtemps_compose_affirmatif |&amp;rtemps_simple_negatif | 
&amp;rtemps_compose_negatif  
</p>
<p>Voici la grammaire construite :  
affirmatif : 
je (me|m') | tu(te|t') | (il|elle|ils|elles|on|qui) (se|s') | nous nous | vous vous  
temps_simple_affirmatif : 
&amp;raffirmatif &amp;e(g=V)  
temps_compose_affirmatif : 
&amp;raffirmatif &amp;c&#234;tre &amp;e(g=Ps)  
negatif : 
je ne (me|m') | tu ne (te|t') |(il|elle|ils|elles|on|qui) ne (se|s') | nous ne nous | vous ne vous  
temps_simple_negatif : 
&amp;rnegatif &amp;e(g=V) &amp;rfin_negation  
temps_compose_negatif : 
&amp;rnegatif &amp;c&#234;tre &amp;rfin_negation &amp;e(g=Ps)  
fin_negation : 
pas|plus|jamais|gu&#232;re|mie|point  
usage_pronominal : 
&amp;rtemps_simple_affirmatif | &amp;rtemps_compose_affirmatif |&amp;rtemps_simple_negatif |  
&amp;rtemps_compose_negatif 
</p>
<p>Cette grammaire a &#233;t&#233; &#233;crite pour fonctionner avec tous les verbes. Elle donne 501 r&#233;sultats 
sur le corpus Hugo/Travailleurs de la Mer. 
</p>
<p>Supposons maintenant que nous voulions une grammaire similaire, mais qui ne s'appliquerait 
qu'au verbe dire.  
</p>
<p>A chaque expression &amp;e(g=V) (forme verbale quelconque) , il convient de substituer &amp;cdire 
(forme verbale du verbe dire).  
De m&#234;me, &#224; chaque expression &amp;e(g=Ps) (participe pass&#233; d'un verbe quelconque), il convient 
de substituer &amp;e(g=Ps c=&amp;cdire) (participe pass&#233; du verbe dire). 
</p>
<p>Nous obtenons donc la grammaire suivante :  
affirmatif : 
je (me|m') | tu(te|t') | (il|elle|ils|elles|on|qui) (se|s') | nous nous | vous vous  
temps_simple_affirmatif : 
&amp;raffirmatif &amp;cdire  
temps_compose_affirmatif : 
&amp;raffirmatif &amp;c&#234;tre &amp;e(g=Ps c=&amp;cdire)  
negatif : 
je ne (me|m') | tu ne (te|t') |(il|elle|ils|elles|on|qui) ne (se|s') | nous ne nous | vous ne vous  
temps_simple_negatif : 
&amp;rnegatif &amp;cdire &amp;rfin_negation  
temps_compose_negatif : 
&amp;rnegatif &amp;c&#234;tre &amp;rfin_negation &amp;e(g=Ps c=&amp;cdire)  
fin_negation : 
pas|plus|jamais|gu&#232;re|mie|point  
usage_pronominal : 
&amp;rtemps_simple_affirmatif | &amp;rtemps_compose_affirmatif |&amp;rtemps_simple_negatif | 
&amp;rtemps_compose_negatif  
</p>
<p>14 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>Cette grammaire fournit 13 r&#233;sultats sur le m&#234;me corpus Hugo/Travailleurs de la Mer. 
</p>
<p>La premi&#232;re objection qui vient &#224; l'esprit est la suivante : vais-je devoir &#233;crire une grammaire 
diff&#233;rente pour chaque verbe que je veux &#233;tudier ? Ce serait &#233;videmment tr&#232;s f&#226;cheux si un 
nouveau m&#233;canisme n'&#233;tait pas introduit : les r&#232;gles avec param&#232;tres. 
</p>
<p>c) Les r&#232;gles avec param&#232;tres : 
</p>
<p>Nous allons &#233;largir la syntaxe des expressions d'invocation de r&#232;gles avec la possibilit&#233; 
suivante : &amp;rXXX(P1,P2,...,Pn),YYY  
</p>
<p>Cette expression invoque la r&#232;gle XXX de la grammaire YYY. 
P1,P2,...,Pn sont des cha&#238;nes de caract&#232;res qui sont transmises &#224; la r&#232;gle XXX, c'est-&#224;-dire 
que, dans l'&#233;criture du corps de XXX, nous pourrons faire r&#233;f&#233;rence &#224; ces param&#232;tres.  
</p>
<p>c1) Le plus facile est d'&#233;tudier un exemple tr&#232;s simple :  
</p>
<p>Supposons que nous voulions successivement chercher les usages de toute une s&#233;rie de verbes 
donn&#233;s (aimer, danser, boire, ...) &#224; la premi&#232;re personne du pluriel.  
</p>
<p>Il serait possible de formuler la requ&#234;te suivante : (nous &amp;caimer | nous n'&amp;caimer | nous 
&amp;cavoir &amp;e(g=Ps c=&amp;caimer) | nous n'&amp;cavoir &amp;q &amp;e(g=Ps c=&amp;caimer) | &amp;caimer-
nous) autant de fois qu'il y a de verbes &#224; &#233;tudier.  
Une autre possibilit&#233; serait d'&#233;crire une grammaire pour le verbe aimer, puis de la modifier 
pour danser, etc.  
</p>
<p>L'une et l'autre de ces solutions sont &#233;galement fastidieuses. Au lieu de cela nous allons &#233;crire 
la grammaire G suivante  
</p>
<p>auxiliaire : 
&amp;cavoir | &amp;c&#234;tre  
verbe : 
nous &amp;c&amp;1 | nous (ne|n')&amp;c&amp;1 | nous &amp;rauxiliaire &amp;e(g=Ps c=&amp;c&amp;1) |nous (ne|n')  
&amp;rauxiliaire &amp;q &amp;e(g=Ps c=&amp;c&amp;1) | &amp;c&amp;1-nous  
</p>
<p>On remarquera dans cette grammaire, un nouvel &#233;l&#233;ment de syntaxe : &amp;1.  Cette expression 
signifie que la r&#232;gle verbe doit &#234;tre appel&#233;e avec au moins un param&#232;tre, et que ce param&#232;tre 
se substituera &#224; &amp;1. Autrement dit, &amp;1 est une mani&#232;re g&#233;n&#233;rique de d&#233;signer le premier 
param&#232;tre avec lequel la r&#232;gle verbe est invoqu&#233;e.  
</p>
<p>Si maintenant, nous tapons l'expression de recherche : &amp;rverbe(aimer),G   la r&#232;gle verbe est 
&#233;quivalente &#224; :  
nous &amp;caimer | nous (ne|n')&amp;caimer | nous &amp;rauxiliaire &amp;e(g=Ps c=&amp;caimer) | nous 
(ne|n') &amp;rauxiliaire &amp;q &amp;e(g=Ps c=&amp;caimer) | &amp;caimer-nous et on proc&#233;dera donc &#224; la 
recherche des emplois de aimer &#224; la premi&#232;re personne du pluriel.  
</p>
<p>Bien entendu, une r&#232;gle peut avoir plusieurs param&#232;tres. Il seront respectivement d&#233;sign&#233;s 
dans le corps de la r&#232;gle par &amp;1,&amp;2, &amp;3, etc.  
Une r&#232;gle peut transmettre &#224; une autre r&#232;gle un ou plusieurs des param&#232;tres qu'elle a re&#231;us.  
 
</p>
<p>15 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>c2) Pour illustrer ceci, voyons comment nous pouvons modifier la grammaire cherchant les 
usages pronominaux pour la faire fonctionner sur un verbe pass&#233; en param&#232;tre.  
 
</p>
<p>La r&#232;gle usage_pronominal doit recevoir n&#233;cessairement un param&#232;tre : le verbe &#224; &#233;tudier. 
Elle devra retransmettre ce param&#232;tre &#224; la r&#232;gle temps_simple_affirmatif qui en a besoin pour 
savoir quel verbe il doit conjuguer. De m&#234;me, la r&#232;gle usage_pronominal devra transmettre 
son param&#232;tre aux autres r&#232;gles qu'elle invoque.  
</p>
<p>La grammaire devient ainsi :  
affirmatif : 
je (me|m') | tu(te|t') | (il|elle|ils|elles|on|qui) (se|s') | nous nous | vous vous  
temps_simple_affirmatif : 
&amp;raffirmatif &amp;c&amp;1  
temps_compose_affirmatif : 
&amp;raffirmatif &amp;c&#234;tre &amp;e(g=Ps c=&amp;c&amp;1)  
negatif : 
je ne (me|m') | tu ne (te|t') |(il|elle|ils|elles|on|qui) ne (se|s') | nous ne nous | vous ne vous  
temps_simple_negatif : 
&amp;rnegatif &amp;c&amp;1 &amp;rfin_negation  
 
temps_compose_negatif : 
&amp;rnegatif &amp;c&#234;tre &amp;rfin_negation &amp;e(g=Ps c=&amp;c&amp;1)  
fin_negation : 
pas|plus|jamais|gu&#232;re|mie|point  
usage_pronominal : 
&amp;rtemps_simple_affirmatif(&amp;1) | &amp;rtemps_compose_affirmatif(&amp;1)  
|&amp;rtemps_simple_negatif(&amp;1) | &amp;rtemps_compose_negatif(&amp;1)  
</p>
<p>c3) Essayons enfin de faire encore plus fort en r&#233;&#233;crivant la grammaire ci-dessus pour 
qu'elle fonctionne, au choix, ou bien sur tous les verbes ou bien sur un verbe pass&#233; en 
param&#232;tre. Pour obtenir ceci, il faut que certaines r&#232;gles changent de comportement en 
fonction des param&#232;tres qui lui sont pass&#233;s.  
</p>
<p>Par exemple, si nous consid&#233;rons la r&#232;gle temps_simple_affirmatif, son corps devrait &#234;tre :  
</p>
<p>tant&#244;t du genre &amp;raffirmatif &amp;e(g=V) tant&#244;t du genre &amp;raffirmatif &amp;cXXX avec 
XXX=verbe &#224; conjuguer.  
</p>
<p>Supposons que nous &#233;crivions cette r&#232;gle sous la forme :  
temps_simple_affirmatif : 
&amp;raffirmatif &amp;rverbe_&amp;1(&amp;2)  
</p>
<p>Si maintenant, nous invoquons cette r&#232;gle en lui passant deux param&#232;tres particulier et laver, 
alors son corps devient &#233;quivalent &#224; : 
</p>
<p>&amp;raffirmatif &amp;rverbe_particulier(laver)  
</p>
<p>Maintenant nous ajoutons &#224; la grammaire la r&#232;gle : 
verbe_particulier : &amp;c&amp;1  
</p>
<p>Alors, la cha&#238;ne laver est transmise &#224; la r&#232;gle verbe_particulier et nous obtenons un 
fonctionnement correct pour un verbe particulier.  
</p>
<p>16 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>Si au contraire, nous invoquons la r&#232;gle temps_simple_affirmatif en lui passant deux 
param&#232;tres general et n'importe quoi, son corps devient &#233;quivalent &#224; : &amp;raffirmatif 
&amp;rverbe_general(n'importe quoi)  
</p>
<p>Maintenant, ajoutons &#224; la grammaire la r&#232;gle : 
verbe_general :  
&amp;e(g=V)  
</p>
<p>Le param&#232;tre n'importe quoi sera ignor&#233; par cette r&#232;gle et nous obtenons un fonctionnement 
correct pour le cas g&#233;n&#233;ral.  
</p>
<p>Nous voyons ainsi qu'il est possible de passer en param&#232;tre absolument tout ce que l'on veut, 
y compris des noms ou des parties de noms de r&#232;gles. Ceci permet d'&#233;crire des r&#232;gles qui vont 
invoquer telle ou telle r&#232;gle en fonction des param&#232;tres avec lesquels elles sont invoqu&#233;es, et 
d'obtenir ainsi des grammaires d'une tr&#232;s grande souplesse.  
</p>
<p>En syst&#233;matisant ce raisonnement, nous obtenons finalement la grammaire suivante :  
affirmatif : 
je (me|m') | tu(te|t') | (il|elle|ils|elles|on|qui) (se|s') | nous nous | vous vous  
temps_simple_affirmatif : 
&amp;raffirmatif &amp;rverbe_&amp;1(&amp;2)  
temps_compose_affirmatif : 
&amp;raffirmatif &amp;c&#234;tre &amp;rparticipe_&amp;1(&amp;2)  
negatif : 
je ne (me|m') | tu ne (te|t') |(il|elle|ils|elles|on|qui) ne (se|s') | nous ne nous | vous ne vous  
temps_simple_negatif : 
&amp;rnegatif &amp;rverbe_&amp;1(&amp;2) &amp;rfin_negation  
temps_compose_negatif : 
&amp;rnegatif &amp;c&#234;tre &amp;rfin_negation &amp;rparticipe_&amp;1(&amp;2)  
fin_negation : 
pas|plus|jamais|gu&#232;re|mie|point  
usage_pronominal : 
&amp;rtemps_simple_affirmatif(&amp;1,&amp;2) | &amp;rtemps_compose_affirmatif(&amp;1,&amp;2)  
|&amp;rtemps_simple_negatif(&amp;1,&amp;2) | &amp;rtemps_compose_negatif(&amp;1,&amp;2)  
verbe_general : 
&amp;e(g=V)  
participe_general : 
&amp;e(g=Ps)  
verbe_particulier : 
&amp;c&amp;1  
participe_particulier : 
&amp;e(g=Ps c=&amp;c&amp;1)  
</p>
<p>Si maintenant, nous lan&#231;ons une recherche avec les invocations :  
&amp;rusage_pronominal(particulier,agir), alors nous recherchons des usages pronominaux du 
verbe agir.   (5 r&#233;sultats avec le verbe agir,1 r&#233;sultat avec le verbe moquer, etc.). 
&amp;rusage_pronominal(general,) alors nous recherchons des usages pronominaux de n'importe 
quel verbe.   (501 r&#233;ponses sur le corpus Hugo/Travailleurs de la mer) 
</p>
<p>Remarque : on notera dans l'invocation ci-dessus que le second param&#232;tre est une cha&#238;ne vide 
(ce param&#232;tre est en effet ignor&#233; si le premier param&#232;tre est general. Mais ne pas oublier la 
virgule derri&#232;re general). 
</p>
<p>17 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>Invocation d'une r&#232;gle de grammaire : 
La syntaxe &#224; respecter pour invoquer des grammaires :  
</p>
<p>&amp;rXXX (invocation de la r&#232;gle XXX de la grammaire courante)  
&amp;rXXX,GGG (invocation de la r&#232;gle XXX de la grammaire GGG)  
&amp;rXXX(P1,P2,...,Pn) (invocation de la r&#232;gle XXX de la grammaire courante avec 
passage de param&#232;tres)  
&amp;rXXX(P1,P2,...,Pn),GGG (invocation de la r&#232;gle XXX de la grammaire GGG avec 
passage de param&#232;tres) 
</p>
<p>Les r&#232;gles peuvent appara&#238;tre dans n'importe quel ordre. En particulier, le corps d'une r&#232;gle 
peut invoquer une autre r&#232;gle qui ne sera &#233;crite que plus loin dans la grammaire.  
&amp;1,&amp;2,&amp;3,... mani&#232;re g&#233;n&#233;rique de d&#233;signer, dans une r&#232;gle de grammaire, le premier, le 
second, le troisi&#232;me,... param&#232;tre. 
</p>
<p>2.3.2.4. Calcul de fr&#233;quences 
La fr&#233;quence d'un mot est &#233;gale &#224; son nombre d'occurrences dans le corpus de travail. Pour 
calculer des fr&#233;quences, vous disposez de services vous permettant :  
</p>
<p>&#8226; d'extraire du corpus de travail les mots conformes &#224; un profil (suffixe, pr&#233;fixe, infixe 
donn&#233;s) et de calculer la fr&#233;quence de chacun d'eux.. Les principes de saisie de votre 
requ&#234;te sont identiques &#224; ceux d&#233;crits au chapitre concernant la  cr&#233;ation d&#8217;une liste &#224; 
partir des graphies du corpus de travail. 
</p>
<p>&#8226; de calculer la fr&#233;quence d'un mot ou de chaque mot d'une liste. Si vous choisissez 
cette derni&#232;re possibilit&#233;, il vous faudra fabriquer la liste de mots avant de lancer le 
service de calcul de fr&#233;quences. (voir le service de cr&#233;ation de listes de mots).  
</p>
<p>&#8226; de calculer la distribution des fr&#233;quences d'un mot ou de chaque mot d'une liste. 
Ce service vous permet de d&#233;couper votre corpus de travail en &quot;tranches&quot; et d'obtenir un 
tableau comparatif de la fr&#233;quence d'un mot donn&#233; (ou de la somme des fr&#233;quences des mots 
d'une liste donn&#233;e) dans chaque tranche.  
Vous pouvez d&#233;finir les tranches de diff&#233;rentes fa&#231;ons :  
1).Une tranche = l'oeuvre d'un auteur. Les r&#233;sultats vous permettent alors de comparer 
l'emploi que font d'un mot (ou des mots d'une liste) les diff&#233;rents auteurs.  
2) Une tranche = une r&#233;f&#233;rence bibliographique. Les r&#233;sultats vous permettent alors de 
comparer l'emploi de mots donn&#233;s dans les diff&#233;rentes oeuvres.  
3) Une tranche = une p&#233;riode de X ann&#233;es (vous pouvez choisir la valeur de X). Les r&#233;sultats 
vous permettent alors de comparer l'emploi de mots donn&#233;s &#224; diff&#233;rentes &#233;poques. 
</p>
<p>Pr&#233;sentation des r&#233;sultats : 
</p>
<p>Suivant les cas, les r&#233;sultats peuvent &#234;tre tri&#233;s : 
Cas 1) par ordre d&#233;croissant des fr&#233;quences (les auteurs utilisant le plus fr&#233;quemment 
les mots donn&#233;s sont sortis en premier) ou par ordre alphab&#233;tique des auteurs.  
Cas 2) par ordre d&#233;croissant des fr&#233;quences (les oeuvres attestant le plus fr&#233;quemment 
les mots donn&#233;s sont sorties en premier) ou par ordre alphab&#233;tique des r&#233;f&#233;rences.  
Cas 3) par ordre d&#233;croissant des fr&#233;quences (les tranches chronologiques pendant 
lesquelles les mots donn&#233;s sont le plus fr&#233;quemment employ&#233;s sont sorties en premier) 
ou par ordre chronologique des tranches. 
</p>
<p>Les r&#233;sultats sont pr&#233;sent&#233;s sous forme d'un histogramme. 
</p>
<p>18 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>L'&#233;tude de la distribution des fr&#233;quences peut &#234;tre, au choix, r&#233;alis&#233;e en utilisant les 
fr&#233;quences absolues (fr&#233;quence absolue d'un mot dans une tranche = le nombre d'occurrences 
du mot dans la tranche) ou en utilisant les fr&#233;quences relatives (fr&#233;quence relative d'un mot 
dans une tranche = le nombre d'occurrences du mot dans la tranche divis&#233; par le nombre total 
d'occurrences dans la tranche). 
</p>
<p>2.3.2.5. Etude du vocabulaire au voisinage des occurrences d'un mot  
Ce service vous permet d'&#233;tudier, dans le corpus de travail, le vocabulaire employ&#233; dans le 
voisinage des occurrences d'un mot donn&#233; ou des mots d'une liste donn&#233;e.  
Appelons pivot une occurrence du mot donn&#233; (ou d'un des mots de la liste donn&#233;e). Le 
voisinage peut &#234;tre d&#233;fini, au choix, comme la phrase contenant le pivot (en y ajoutant 
&#233;ventuellement plusieurs phrases &#224; gauche ou &#224; droite) ou comme une portion de texte 
contenant X mots avant et Y mots apr&#232;s le pivot (X et Y &#224; votre choix).  
Par exemple, il est possible d'&#233;tudier le vocabulaire employ&#233; dans les phrases contenant le 
mot &quot;abeille&quot;.  
Le r&#233;sultat d'une telle &#233;tude est d'&#233;tablir la liste de tous les mots trouv&#233;s dans les voisinages 
du pivot. Chaque mot est fourni avec sa fr&#233;quence. La liste peut &#234;tre class&#233;e au choix par 
ordre alphab&#233;tique ou par ordre croissant ou d&#233;croissant des fr&#233;quences. 
</p>
<p>TEMPS D'EXECUTION : 
Ce service met en jeu des moyens de traitement tr&#232;s importants. Il doit donc &#234;tre utilis&#233; avec mesure. 
Pour cette raison, ce programme s'arr&#234;te automatiquement lorsque de nombre d'occurrences d&#233;passe 
10000. Dans ce cas, les r&#233;sultats sont quand m&#234;me obtenus, mais ne correspondent qu'au 
d&#233;pouillement des 10000 premiers voisinages.  
Il est donc prudent de s'assurer de la fr&#233;quence du pivot gr&#226;ce au service calcul de la fr&#233;quence d'un 
mot ou de chaque mot d'une liste. 
</p>
<p>2.4. Stella et le TLFi 
</p>
<p>L&#8217;acc&#232;s aux possibilit&#233;s les plus raffin&#233;es exige &#224; la fois la connaissance de la structure du 
TLF et la compr&#233;hension des concepts permettant de mettre en oeuvre des recherches tr&#232;s 
puissantes. 
</p>
<p>Trois niveaux d'utilisation de puissance croissante sont propos&#233;s : 
La consultation simple des articles, qui apporte d'embl&#233;e des facilit&#233;s de lecture tr&#232;s 
int&#233;ressantes. Sa mise en oeuvre ne demande aucune connaissance particuli&#232;re et ne 
n&#233;cessite la lecture d'aucune documentation.  
Les recherches assist&#233;es, qui fournissent des possibilit&#233;s &#233;tonnantes de consultation 
du TLF, et dont la mise en oeuvre ne demande que l'examen de quelques exemples 
types tr&#232;s simples.  
Les recherches complexes, qui offrent les possibilit&#233;s maximales d'investigation. Elles 
demandent la consultation d'une documentation pr&#233;sentant de mani&#232;re imag&#233;e les 
diff&#233;rents objets rencontr&#233;s dans le TLF et les concepts (l'&#233;quivalent de 4 &#224; 5 pages 
dactylographi&#233;es) permettant d'exprimer les recherches les plus raffin&#233;es.  
</p>
<p>L'utilisateur press&#233; pourra se contenter des deux premiers niveaux d'utilisation. Qu'il sache 
cependant qu'il a en r&#233;serve un potentiel consid&#233;rable. Il pourra aussi jouer avec la nouvelle 
fonctionnalit&#233; qu&#8217;est la recherche phon&#233;tique s&#8217;il est brouill&#233; avec l&#8217; orthographe. Il pourra 
</p>
<p>19 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>aussi tester l&#8217;hyper-navigation &#224; travers les bases g&#233;r&#233;es par Stella, ce qui apporte un plus 
r&#233;el &#224; la connaissance. 
</p>
<p>2.4.1. Interrogation simple 
</p>
<p>Il s&#8217;agit de la &#171; visualisation simple &#187; d&#8217;un article, qui se fait en deux &#233;tapes : 
o Choix de la tranche alphab&#233;tique dans laquelle se situe le mot cherch&#233; 
</p>
<p>Exemple : DISSOLU &#224; DOMINOTERIE 
o Choix du mot dans la tranche retenue 
</p>
<p>Exemple DITON 
</p>
<p>Important :  Ce type d&#8217;interrogation permet d&#8217;atteindre toutes les &#171; vedettes &#187; d&#8217;articles. Mais 
attention, le mot cherch&#233; peut se trouver &#224; l&#8217;int&#233;rieur de l&#8217;article, dans un bloc de hi&#233;rarchie 
inf&#233;rieure. Il se peut aussi qu&#8217;il soit un &#171; mot cach&#233; &#187; apparaissant sous une autre vedette que 
la sienne. Si la visualisation s&#233;lective ne donne pas de r&#233;sultat, essayer l&#8217;une des 
interrogations plus avanc&#233;es : 
</p>
<p>Par exemple : on peut chercher  l&#8217;article concernant LOTOPHAGE. 
La r&#233;ponse est &#171; aucune solution trouv&#233;e &#187;. 
Or il existe une solution, cach&#233;e, et accessible par la recherche assist&#233;e. 
</p>
<p>2.4.2. Interrogation assist&#233;e 
</p>
<p>Encore appel&#233;e Requ&#234;te assist&#233;e, elle se fait par l&#8217;interm&#233;diaire d&#8217;un formulaire de recherche, 
ce formulaire propose de restreindre la recherche 
</p>
<p>o Aux vedettes contenant une graphie 
Exemple  carnage 
</p>
<p>o Aux vedettes contenant un code grammatical 
Exemple  onomatop&#233;e 
</p>
<p>o A un domaine technique particulier 
Exemple  horticulture 
</p>
<p>o A un indicateur d&#8217;emploi 
Exemple  p&#233;joratif 
</p>
<p>o A un objet textuel de type &#224; choisir dans un menu d&#233;roulant. Si l&#8217;on se sert de cette 
proposition, il faut imp&#233;rativement sp&#233;cifier quelque chose de son contenu et remplir 
une ou plusieurs  des cases Mot1, Mot2, Mot3 
Exemple indiff&#233;rent avec mot 1 contenant lotophage et petite case coch&#233;e (pour sing. 
et plur.) permet de trouver ce mot cach&#233; sous un autre, accompagn&#233; de sa d&#233;finition 
</p>
<p>La recherche peut &#234;tre restreinte &#224; l&#8217;une de ces possibilit&#233;s, ou en croiser plusieurs : 
o Vedette contenant age et code grammatical = substantif 
o Vedette contenant &#233;e et code grammatical = substantif et domaine = horticulture 
o Code = substantif et et indicateur= populaire et objet4 = auteur d&#8217;exemple avec mot1 
</p>
<p>= hugo. (Ce qui permet de savoir quels sont les substantifs qui dans un emploi 
populaire, ont &#233;t&#233; illustr&#233;s par un exemple de Hugo) 
</p>
<p>20 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>2. 4.3. Interrogation  avanc&#233;e 
</p>
<p>encore appel&#233;e Requ&#234;te complexe, elle se fait par un formulaire de recherche sp&#233;cifique. 
</p>
<p>2.4.3.1. La Requ&#234;te complexe 
Les requ&#234;tes peuvent &#234;tre &#233;l&#233;mentaires (un seul objet recherch&#233;) ou multi-objets.  
</p>
<p>Requ&#234;tes &#233;l&#233;mentaires 
Les requ&#234;tes les plus simples portent sur un seul objet. 
Vous avez imp&#233;rativement &#224; sp&#233;cifier le type de l'objet que vous recherchez, et 
&#233;ventuellement &#224; lui imposer un contenu textuel. (Voir ci-dessous le &#167; 4.3.2  concernant les 
objets textuels et leurs types, le &#167; 4.3.3. concernant la notion de contenu, et le &#167; 4.3.5. 
concernant la notion de listes de mots) 
Ainsi, vous pouvez rechercher les d&#233;finitions qui contiennent le mot &quot;instrument&quot;. Pour cela, 
il suffit de remplir un formulaire vous permettant de d&#233;finir le type et le contenu de l'objet. 
Cliquez alors sur le bouton &quot;EXECUTION&quot; pour ex&#233;cuter la recherche. 
Le formulaire est accessible depuis le menu principal (rubrique Recherche complexe) 
</p>
<p>Requ&#234;tes multi-objets 
Il est possible de faire porter une requ&#234;te sur plusieurs objets. (Voir ci-dessous le &#167; 4.3.2. 
concernant les objets textuels et leurs types, le &#167; 4.3.3 concernant la notion de contenu, et le &#167; 
4.3.5 concernant les listes de mots). 
Par exemple, on d&#233;sire rechercher les d&#233;finitions emprunt&#233;es au dictionnaire de l'Acad&#233;mie 
qui contiennent le mot instrument. 
</p>
<p>Une telle requ&#234;te met en jeu deux objets : 
1)Un objet de type &quot;D&#233;finition emprunt&#233;e&quot; ayant le contenu textuel &quot;instrument&quot; 
2)Un objet de type &quot;Source&quot; ayant le contenu textuel &quot;Acad&#233;mie&quot;. 
</p>
<p>On comprend ais&#233;ment que pour exprimer une requ&#234;te complexe, il ne suffit pas d'&#233;num&#233;rer 
les objets qu'elle met en jeu. Il faut &#233;galement indiquer quels sont les liens logiques entre les 
objets. 
Dans l'exemple ci-dessus, il ne suffit pas d'exprimer que l'on s'int&#233;resse d'une part aux 
d&#233;finitions contenant &quot;instrument&quot; et, d'autre part, &#224; l'ensemble des sources contenant 
&quot;Acad&#233;mie&quot;. 
Il reste &#224; exprimer un lien logique essentiel : l'objet 2 est la source de l'objet 1. 
Autrement dit, il faut exprimer la nature du lien entre les objets 1 et 2.  (Voir le &#167; 4.3.4 
concernant la notion de liens). 
</p>
<p>2.4.3.2. Les objets textuels et leur type 
Les articles d'un dictionnaire sont constitu&#233;s d'objets &#233;l&#233;mentaires de diff&#233;rents types 
(d&#233;finitions, exemples, indicateurs de domaine technique, indicateurs grammaticaux, etc.). 
Le TLF a donc &#233;t&#233; d&#233;compos&#233; en de tels objets textuels. Ceci va vous permettre d'effectuer 
des recherches portant sur tel ou tel type d'objet. 
Par exemple, il vous sera possible de chercher les objets de type &quot;d&#233;finition&quot; qui contiennent 
le mot instrument. 
Pour obtenir une description compl&#232;te des types d'objets du TLF, voir l&#8217;aide en ligne qui, en 
plus du tableau ci-dessous, renvoie &#224; des exemples pour chacun des objets. 
</p>
<p>21 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>Article Toute portion de texte consacr&#233;e &#224; l'&#233;tude d'un mot. Un &quot;article&quot; est un article principal ou un article d&#233;riv&#233; ou un article mot form&#233;.  
Article principal Article correspondant &#224; une vedette principale du TLF.  
</p>
<p>Article d&#233;riv&#233; Article correspondant &#224; un mot cit&#233; dans une rubrique &quot;remarque&quot; ou une rubrique &quot;d&#233;riv&#233;&quot;.  
</p>
<p>Article mot form&#233; Article correspondant &#224; un mot cit&#233; dans un article principal dont la vedette est un &#233;l&#233;ment formant ou de composition, un pr&#233;fixe ou un suffixe.  
Auteur d'exemple Auteur d'un exemple cit&#233;.  
Code grammatical Code grammatical (verbe, substantif, etc.) associ&#233; &#224; un mot cit&#233; en vedette.  
Construction Indication des conditions syntaxiques d'emploi de la vedette.  
Crochets Condition d'emploi de la vedette (du genre &quot;le compl&#233;ment d'objet est un inanim&#233;&quot;, etc.)  
Date d'exemple Date d'un exemple cit&#233;.  
D&#233;finition D&#233;finition de la vedette, elle peut &#234;tre emprunt&#233;e &#224; un autre dictionnaire ou &#234;tre &quot;maison&quot;. 
D&#233;finition emprunt&#233;e D&#233;finition emprunt&#233;e &#224; un autre dictionnaire.  
D&#233;finition TLF D&#233;finition &quot;maison&quot;  
</p>
<p>Discours Portion d'article d&#233;butant derri&#232;re un sigle de structure (I,A,a, etc...) et se terminant au sigle de structure suivant.  
Domaine technique Indication du domaine technique dans lequel s'emploie la vedette.  
Domaine g&#233;n&#233;ral Indication de domaine non technique (par ex. Domaine des sens, de l'esth&#233;tique, etc...).  
</p>
<p>El&#233;ment formant Partie de la vedette correspondant &#224; l'&#233;l&#233;ment formant (ou au pr&#233;fixe/suffixe) ayant servi &#224; la forger.  
Entr&#233;e Couple vedette-code grammatical d'un article principal ou d&#233;riv&#233; ou form&#233;.  
Entr&#233;e principale Couple vedette-code grammatical d'un article principal.  
Entr&#233;e de mot d&#233;riv&#233; Couple vedette-code grammatical d'un article d&#233;riv&#233;.  
Entr&#233;e de mot form&#233; Couple vedette-code grammatical d'un article form&#233;.  
Exemple Exemple cit&#233;. Il peut &#234;tre d&#233;tach&#233; ou encha&#238;n&#233;.  
</p>
<p>Exemple d&#233;tach&#233; Exemple cit&#233; particuli&#232;rement illustratif (apparaissant dans le TLF dans un paragraphe s&#233;par&#233; du reste du texte).  
Exemple encha&#238;n&#233; Exemple cit&#233; autre que exemple d&#233;tach&#233;.  
Indicateur Indication de type grammatical, stylistique ou s&#233;mantique.  
Langue emprunt&#233;e Mention de la langue dont vient la vedette principale de l'article.  
Localisation 
d'exemple Localisation de l'exemple dans l'oeuvre (page, chapitre, etc...).  
</p>
<p>Mot vedette Mot vedette d'un article principal ou d&#233;riv&#233; ou form&#233;.  
Paragraphe Paragraphe quelconque du TLF.  
</p>
<p>Paragraphe syntagme 
Suite de syntagmes faisant l'objet d'une mise en &#233;vidence sous forme d'un paragraphe 
s&#233;par&#233; du reste du texte. Le paragraphe syntagme est un sous-cas du type &quot;syntagme&quot; 
(voir plus loin).  
</p>
<p>Sigle hi&#233;rarchique Sigle de structure(I,A,1,a,etc...).  
</p>
<p>Source Source bibliographique d'une d&#233;finition emprunt&#233;e ou d'un syntagme cit&#233;s dans d'autres ouvrages.  
Synonyme/antonyme Liste des synonymes ou antonymes de la vedette.  
Syntagme Paragraphe syntagme (voir plus haut) ou syntagme encha&#238;n&#233; (voir ci-dessous).  
Syntagme encha&#238;n&#233; Syntagme form&#233; &#224; partir de la vedette, ne se trouvant pas dans un paragraphe syntagme.  
</p>
<p>22 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>Titre d'exemple Titre de l'oeuvre dont est tir&#233; un exemple cit&#233;.  
</p>
<p>2.4.3.3. La notion de contenu : 
Vous pouvez imposer aux objets que vous recherchez de contenir tel ou tel &#233;l&#233;ment textuel. 
Par exemple, vous pouvez rechercher les objets de type &quot;D&#233;finition&quot; contenant le mot 
&quot;instrument&quot;, mais pas le mot &quot;optique&quot;.  
Nous allons voir que vous pouvez d&#233;finir un contenu avec une grande richesse de possibilit&#233;s.  
</p>
<p>2.4.3.3.1. Contenu unique 
</p>
<p>a) Description du contenu 
Chaque mot d'un contenu peut &#234;tre sp&#233;cifi&#233; sous plusieurs formes : 
</p>
<p>&#8226; Forme 1-Par sa graphie exacte 
&#8226; Forme 2-Par une indication de conjugaison sous la forme &amp;cINFINITIF. 
</p>
<p>Exemple :&amp;caimer 
&#8226; Forme 3-Par une indication de flexion pour les adjectifs et substantifs &amp;mMOT, o&#249; 
</p>
<p>MOT d&#233;signe le mot au singulier (pour les substantifs) et au masculin singulier (pour 
les adjectifs). 
Exemple :&amp;mvert 
</p>
<p>&#8226; Forme 4-Par une indication de liste de mots sous la forme &amp;lNOM_DE_LISTE. (Voir 
le service Gestion de listes de mots) 
</p>
<p>&#8226; Forme 5-Par une indication de mot quelconque sous la forme &amp;q  
</p>
<p>b) N&#233;gation d'un &#233;l&#233;ment de contenu 
Chacune de ces mani&#232;res de sp&#233;cifier un mot (sauf la forme 5 =  &amp;q) peut &#234;tre 
pr&#233;c&#233;d&#233;e du symbole de n&#233;gation ^. Le sens de cette n&#233;gation sera illustr&#233; par les 
exemples ci-dessous. 
</p>
<p>c) Exemples de contenus 
Exemple 1 : Le contenu &amp;caimer la nature recherche les occurrences d'une forme 
flexionnelle du verbe aimer, suivie des mots &quot;la&quot; et &quot;nature&quot;. 
Exemple 2 : Le contenu ^&amp;cruer dans les brancards recherche les occurrences d'un 
mot qui n'est pas une forme du verbe ruer, suivi des mots &quot;dans&quot;, &quot;les&quot; et &quot;brancards&quot;. 
Exemple 3 : Le contenu un &amp;q jour recherche les occurrences du mot &quot;un&quot;, suivi d'un 
mot quelconque, puis du mot &quot;jour&quot;. 
Exemple 4 : Le contenu &amp;credouter un &amp;lexemple recherche les occurrences d'une 
forme du verbe &quot;redouter&quot;, suivie du mot &quot;un&quot;, suivi d'un mot appartenant &#224; la liste 
&quot;exemple&quot;. (Voir le service Gestion de listes de mots). 
Exemple 5 : Le contenu &amp;ccouper &amp;q &amp;mt&#234;te recherche les occurrences d'une forme 
du verbe &quot;couper&quot;, suivie d'un mot quelconque, suivi de t&#234;te ou t&#234;tes. 
</p>
<p>Note importante : Un contenu, comme on le voit dans les exemples ci-dessus, est une 
suite d'&#233;l&#233;ments (&#233;ventuellement un seul) sp&#233;cifi&#233;s sous une des formes 1, 2, 3, 4, 5. 
Une expression de contenu qui ne contiendrait que la sp&#233;cification &amp;q n'a aucun sens 
(Que signifierait en effet de rechercher les d&#233;finitions contenant un mot quelconque ?). 
Il en va de m&#234;me pour un contenu qui ne contiendrait que des sp&#233;cifications ni&#233;es avec 
le symbole ^ (Que signifierait en effet de rechercher les d&#233;finitions contenant un mot 
qui n'est pas &quot;homme&quot; ?) . 
</p>
<p>23 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>Nous en d&#233;duisons la r&#232;gle suivante : pour qu'un contenu soit acceptable, il faut qu'il 
contienne au moins une sp&#233;cification de la forme 1,2,3 ou 4 non pr&#233;c&#233;d&#233;e du symbole 
de n&#233;gation ^. 
</p>
<p>d) Exclusion d'un contenu 
Le fait d'indiquer &amp;n en t&#234;te d'une expression de contenu signifie que l'on &#233;limine les 
objets textuels qui le contiennent. 
Par exemple, si l'objet textuel est une d&#233;finition, et si on s'int&#233;resse aux seules 
d&#233;finitions qui ne contiennent pas le mot &quot;homme&quot;, on &#233;crira le contenu suivant : &amp;n 
homme 
On prendra garde &#224; ne pas confondre &quot;^homme&quot; qui signifie &quot;je veux que l'objet 
contienne un mot qui soit diff&#233;rent de &quot;homme&quot; avec &quot;&amp;n homme&quot; qui signifie &quot;je 
veux que tous les mots du contenu soient diff&#233;rents de &quot;homme&quot;.  
</p>
<p>e) Position du contenu textuel dans l'objet 
Il est possible d'imposer que le contenu soit &#224; une distance maximale (exprim&#233;e en nombre de 
mots) du d&#233;but et/ou de la fin de l'objet. 
</p>
<p>Exemple 1 : &amp;d3 un homme signifie que &quot;un homme&quot; doit &#234;tre trouv&#233; &#224; 3 mots au 
plus du d&#233;but de l'objet textuel. 
</p>
<p>Exemple 2 : &amp;f4 un homme signifie que &quot;un homme&quot; doit &#234;tre trouv&#233; &#224; 4 mots au 
plus de la fin de l'objet textuel. 
</p>
<p>Exemple 3 &amp;d3 &amp;f4 un homme signifie que &quot;un homme&quot; doit &#234;tre trouv&#233; &#224; 3 mots au 
plus du d&#233;but de l'objet textuel et &#224; 4 mots au plus de sa fin. 
</p>
<p>Exemple 4 : &amp;n &amp;d3 un homme signifie que &quot;un homme&quot; ne doit pas &#234;tre trouv&#233; &#224; 
moins de 3 mots du d&#233;but de l'objet textuel. 
</p>
<p>2.4.3.3.2. Contenu multiple 
Il est possible de sp&#233;cifier qu'un objet doit, ou ne doit pas avoir simultan&#233;ment plusieurs 
contenus. Il suffit pour cela d'&#233;crire plusieurs contenus simples (sous n'importe laquelle des 
formes d&#233;crites ci-dessus) en les s&#233;parant par le caract&#232;re |  
</p>
<p>Exemple 1 :  homme|femme signifie que l'objet doit contenir homme et femme 
</p>
<p>Exemple 2 : homme|&amp;n femme signifie que l'objet doit contenir homme, mais pas 
femme 
</p>
<p>Exemple 3 : &amp;d3 homme|&amp;n &amp;f4 femme|enfant signifie que l'objet doit contenir 
homme &#224; moins de 3 mots de son d&#233;but, ne pas contenir femme &#224; moins de 4 mots de 
sa fin, et contenir enfant. 
</p>
<p>2.4.3.4. La notion de liens 
Nous avons dit qu&#8217;il est possible de faire porter une requ&#234;te sur plusieurs objets. (Voir plus 
haut, &#167; 4.1.) 
</p>
<p>24 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>Pour exprimer une requ&#234;te complexe, il ne suffit pas d'&#233;num&#233;rer les objets qu'elle met en jeu. 
Il faut &#233;galement indiquer quels sont les liens logiques entre les objets. 
Nous allons voir que les liens entre deux objets sont de deux natures distinctes.  
</p>
<p>4.3.4.1. Lien &quot;objet X inclus dans objet Y&quot;. 
</p>
<p>Si on consid&#232;re une d&#233;finition emprunt&#233;e, on constate qu'elle a la structure suivante : 
 Sorte d'instrument dont on se sert pour enfoncer les pilotis en terre et qu'on 
</p>
<p>appelle autrement mouton (Ac. 1935).   
  
</p>
<p>avec : 
 
et marquant le d&#233;but et la fin de la d&#233;finition. 
 
et marquant le d&#233;but et la fin de la source. 
</p>
<p>On voit que l'objet d&#233;finition contient &#224; la fois l'&#233;nonc&#233; de la d&#233;finition et la source. 
Autrement dit l'objet &quot;Source&quot; est inclus dans l'objet &quot;D&#233;finition emprunt&#233;e&quot;. 
</p>
<p>Dans notre exemple, il suffit donc de sp&#233;cifier que l'objet 2 est inclus dans l'objet 1 pour 
expliciter le fait que l'objet 2 est bien la source de l'objet 1. 
Pour indiquer que l'objet 2 est &#224; l'int&#233;rieur de l'objet 1, il suffit de cliquer dans la fen&#234;tre 
&quot;Liens&quot; associ&#233;e &#224; l'objet 2 du formulaire sur l'entr&#233;e &quot;inclus dans l'objet 1&quot; qui signifie est 
inclus dans l'objet 1.  
</p>
<p>Autre exemple expliquant comment remplir le formulaire de requ&#234;te : 
</p>
<p>Chercher les exemples de Zola contenant le mot &quot;amour&quot; 
Objet 1 : type &quot;Exemple&quot;, contenu &quot;amour&quot; 
Objet 2 : type &quot;Auteur d'exemple&quot;, contenu &quot;Zola&quot;, lien &quot;inclus dans l'objet 1&quot; 
</p>
<p>ou, ce qui est strictement &#233;quivalent: 
</p>
<p>Objet 1 : type &quot;Auteur d'exemple&quot;, contenu &quot;Zola&quot;, lien &quot;inclus dans l'objet 2&quot; 
Objet 2 : type &quot;Exemple&quot;, contenu &quot;amour&quot; 
</p>
<p>NOTA : le document donnant la description des objets trouv&#233;s dans le TLF permet de 
savoir quel type d'objet est susceptible de contenir tel ou tel autre type d'objet. 
</p>
<p>2.4.3.4.2. Lien &quot;objet X d&#233;pendant de l'objet Y&quot;. 
</p>
<p>Prenons l'exemple d'un passage du TLF tel que celui-ci : 
A)MARINE, rare  
</p>
<p>1)Emploi singulier  
....  
</p>
<p>D&#233;finition 1  
....  
</p>
<p>2)Emploi pluriel  
...  
</p>
<p>D&#233;finition 2  
...  
</p>
<p>B)ASTRONOMIE  
....  
</p>
<p>25 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>D&#233;finition 3  
....  
</p>
<p>Etc.  
</p>
<p>Il est clair pour le lecteur que les propri&#233;t&#233;s suivantes sont v&#233;rifi&#233;es: 
a) La d&#233;finition 1 et la d&#233;finition 2 sont valables dans le domaine technique 
</p>
<p>&quot;Marine&quot;. 
b) La d&#233;finition 1 est relative &#224; un emploi singulier de la vedette. 
c) La d&#233;finition 2 est relative &#224; un emploi pluriel de la vedette. 
d) La d&#233;finition 3 n'est pas relative &#224; la marine. 
</p>
<p> 
Ceci d&#233;coule du fait qu'une mention telle que &quot;MARINE&quot; est valable pour le niveau 
hi&#233;rarchique o&#249; elle appara&#238;t (donc &quot;MARINE&quot; est valable pour l'indicateur &quot;rare&quot;) et pour les 
niveaux hi&#233;rarchiques inf&#233;rieurs (donc pour les indicateurs &quot;emploi singulier&quot; et &quot;emploi 
pluriel&quot; ainsi que pour les d&#233;finitions 1 et 2)  
</p>
<p>Nous dirons q'un objet X est d&#233;pendant d'un objet Y si X est hi&#233;rarchiquement inf&#233;rieur ou 
&#233;gal &#224; X. Il est clair que les propri&#233;t&#233;s a, b, c, d ci-dessus sont v&#233;rifi&#233;es parce que : 
</p>
<p>a) L'objet &quot;D&#233;finition&quot; 1 et l'objet &quot;D&#233;finition&quot; 2 sont d&#233;pendants de l'objet &quot;Domaine 
technique&quot; MARINE. 
</p>
<p>b) L'objet &quot;D&#233;finition&quot; 1 est d&#233;pendant de l'objet &quot;Indicateur&quot; emploi singulier. 
c) L'objet &quot;D&#233;finition&quot; 2 est d&#233;pendant de l'objet &quot;Indicateur&quot; emploi pluriel. 
d) L'objet &quot;D&#233;finition&quot; 3 n'est pas d&#233;pendant l'objet &quot;Domaine technique&quot; MARINE. 
</p>
<p>Le nouveau lien &quot;l'objet X est d&#233;pendant de l'objet Y&quot; est exprimable dans le formulaire de 
requ&#234;tes. Il va apporter &#224; l'interrogation du dictionnaire une puissance consid&#233;rable. 
</p>
<p>NOTE : La vedette d'un article, ainsi que toute information qui appara&#238;t au d&#233;but de l'article 
avant que ne commence la num&#233;rotation des niveaux hi&#233;rarchiques, sont de toute &#233;vidence 
hi&#233;rarchiquement sup&#233;rieures &#224; tout autre objet de l'article. Par convention, tout objet de 
l'article est donc consid&#233;r&#233; comme d&#233;pendant de la vedette, ou des informations de d&#233;but. 
</p>
<p>Voyons, &#224; travers quelques exemples, la puissance que conf&#232;re aux recherche la notion de 
d&#233;pendance hi&#233;rarchique des objets : 
</p>
<p>1)Quelles sont les d&#233;finitions contenant le mot &quot;mets&quot;, utilis&#233;es dans le domaine de l'art 
culinaire, et illustr&#233;es par des exemples de Zola ? 
</p>
<p>Objet 1 : type &quot;d&#233;finition&quot;, contenu &quot;mets&quot;, lien &quot;d&#233;pendant de l'objet 2&quot;  
Objet 2 : type &quot;Domaine technique&quot;, contenu &quot;art culinaire&quot; 
Objet 3 : type &quot;Auteur d'exemple&quot;, contenu &quot;Zola&quot; , lien &quot;d&#233;pendant de l'objet 1&quot; (on estime 
raisonnablement qu'un exemple d&#233;pendant d'une d&#233;finition illustre cette d&#233;finition) 
</p>
<p>2)Quels sont les substantifs emprunt&#233;s &#224; une langue &#233;trang&#232;re (non pr&#233;cis&#233;e) et qui, lorsqu'ils 
sont employ&#233;s dans le domaine de l&#8217;art culinaire, sont illustr&#233;s par une d&#233;finition emprunt&#233;e &#224; 
l'Acad&#233;mie ? 
</p>
<p>Objet 1 : type &quot;Entr&#233;e&quot; 
Objet 2 : type &quot;Code grammatical&quot;, contenu &quot;substantif&quot;, lien &quot;inclus dans l'objet 1&quot; 
Objet 3 : type &quot;Domaine technique&quot;, contenu &quot;art culinaire&quot;, lien &quot;d&#233;pendant de l'objet 1&quot; 
Objet 4 : type &quot;D&#233;finition emprunt&#233;e&quot;, lien &quot;d&#233;pendant de l'objet 3&quot; 
Objet 5 : type &quot;Source&quot;, contenu &quot;Acad&#233;mie&quot;, lien &quot;inclus dans l'objet 4&quot; 
</p>
<p>26 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>Objet 6 : type &quot;Langue emprunt&#233;e&quot;, contenu (non pr&#233;cis&#233;) lien &quot;d&#233;pendant de l'objet 1&quot; 
</p>
<p>Explications : 
- Le lien &quot;inclus dans l'objet 1&quot; de l'objet 2 exprime que l'entr&#233;e est un substantif. 
- Le lien &quot;d&#233;pendant de l'objet 1&quot; de l'objet 3 exprime que l'indication de domaine 
</p>
<p>technique est dans la port&#233;e de l'objet 1 (l'entr&#233;e), et se trouve donc dans l'article 
consacr&#233; &#224; cette entr&#233;e.  
</p>
<p>- Le lien &quot;d&#233;pendant de l'objet 3&quot; de l'objet 4 exprime que la d&#233;finition est valable 
dans le domaine de la g&#233;ographie. 
</p>
<p>- Le lien &quot;inclus dans l'objet 4&quot; de l'objet 5 exprime que la source de la d&#233;finition est 
l'Acad&#233;mie. 
</p>
<p>- Le lien &quot;d&#233;pendant de l'objet 1&quot; de l'objet 6 exprime que l'objet &quot;langue 
emprunt&#233;e&quot; est dans l'article dont l'entr&#233;e est l'objet 1. 
</p>
<p>NOTE : Plusieurs liens peuvent &#234;tre attach&#233;s &#224; un m&#234;me objet, comme le montre l'exemple ci-
dessous : 
Quelles sont les locutions populaires ayant trait &#224; la religion ?  
</p>
<p>Objet 1 : type &quot;Indicateur&quot;, contenu &quot;populaire&quot; 
Objet 2 : type &quot;Domaine&quot;, contenu &quot;religion&quot; 
Objet 3 : type &quot;Indicateur&quot;, contenu &quot;locution&quot;, liens &quot;d&#233;pendant de l'objet 1&quot; et &quot;d&#233;pendant 
de l'objet 2&quot; 
</p>
<p>Le double lien &quot;d&#233;pendant de l'objet 1&quot; et &quot;d&#233;pendant de l'objet 2&quot; indique que la locution est 
&#224; la fois sous l'influence de &quot;populaire&quot; et de &quot;religion&quot;. 
</p>
<p> 
M&#233;thodologie pour remplir un formulaire 
Les exemples expos&#233;s ci-dessus peuvent donner l'impression que le remplissage d'un 
formulaire est d'une grande complexit&#233;. Il n'en est rien : il suffit de se laisser guider par les 
termes de la question pos&#233;e.  
</p>
<p>Reprenons par exemple la question : 
Quels sont les substantifs emprunt&#233;s &#224; une langue (non pr&#233;cis&#233;e) et qui, lorsqu'ils sont 
employ&#233;s dans le domaine de l&#8217;art culinaire, sont illustr&#233;s par une d&#233;finition emprunt&#233;e &#224; 
l'Acad&#233;mie ? 
</p>
<p>Laissons-nous guider par l'&#233;nonc&#233; : 
o Quels sont les substantifs se traduit par : 
</p>
<p>Objet 1 : type &quot;Code grammatical&quot;, contenu &quot;substantif&quot;. 
o emprunt&#233;s &#224; une langue quelconque (non pr&#233;cis&#233;e) se traduit par : 
</p>
<p>Objet 2 : type &quot;Langue emprunt&#233;e&quot;, contenu (non pr&#233;cis&#233;) 
Puisqu'on introduit un deuxi&#232;me objet, il convient de se demander par quel lien il se rattache &#224; 
un objet pr&#233;c&#233;demment d&#233;fini. La r&#233;ponse &#224; cette question est toujours tr&#232;s simple : ou bien le 
nouvel objet est inclus dans un objet pr&#233;c&#233;demment d&#233;fini, ou bien il en est d&#233;pendant, ou bien 
c'est un objet pr&#233;c&#233;demment d&#233;fini qui est d&#233;pendant du nouvel objet. 
Dans notre cas; il est clair que l'objet 2 est d&#233;pendant de l'objet 1 (l'indication &quot;verbe&quot; &#233;tant 
valable pour tout l'article). 
</p>
<p>o qui, lorsqu'il sont employ&#233;s dans le domaine de l&#8217;art culinaire se traduit par : 
Objet 3 : type &quot;Domaine technique&quot;, contenu &quot;art culinaire&quot;. 
En ce qui concerne l'&#233;tablissement d'un lien avec l'un des objets pr&#233;c&#233;dents 1 ou 2, il ne peut 
s'agir que d'une d&#233;pendance hi&#233;rarchique par rapport &#224; la mention &quot;substantif&quot; : le lien &#224; &#233;tablir 
pour l'objet 3 est donc &quot;d&#233;pendant de l'objet 4&quot;. 
</p>
<p>o sont illustr&#233;s par une d&#233;finition emprunt&#233;e se traduit par : 
</p>
<p>27 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>Objet 4 : type &quot;D&#233;finition emprunt&#233;e&quot; 
Lien : Objet 4 &quot;d&#233;pendant de l'objet 1&quot;. 
</p>
<p>o &#224; l'Acad&#233;mie se traduit par : 
Objet 5 : type &quot;Source&quot;, contenu &quot;Acad&#233;mie&quot;. 
Lien : objet 5 &quot;inclus dans l'objet 4&quot;.  
</p>
<p>Pour montrer que le remplissage du formulaire est uniquement guid&#233; par les termes de la 
question, reprenons la m&#234;me question, formul&#233;e autrement : 
Pour moi qui m'int&#233;resse aux d&#233;finitions de l'Acad&#233;mie, je voudrais savoir celles qui sont 
utilis&#233;es pour des verbes emprunt&#233;s &#224; l'anglais et utilis&#233;s en physique. 
Reprenons la d&#233;marche : 
 
</p>
<p>o Pour moi qui m'int&#233;resse aux d&#233;finitions se traduit par : 
Objet 1 : type &quot;D&#233;finition emprunt&#233;e&quot;  
</p>
<p>o de l'Acad&#233;mie se traduit par : 
Objet 2 : type &quot;Source&quot; contenu&quot;Acad&#233;mie&quot; 
En ce qui concerne le lien &#224; &#233;tablir : objet 2 &quot;inclus dans l'objet1&quot;.  
</p>
<p>o je voudrais savoir celles qui sont utilis&#233;es pour des substantifs se traduit par : 
Objet 3 : type &quot;Code grammatical&quot; contenu&quot;substantif&quot; 
Lien &#224; &#233;tablir : objet 1 (mais variante tout aussi valable : objet 2) &quot;d&#233;pendant de l'objet 3&quot;. 
</p>
<p>o emprunt&#233;s &#224; une langue se traduit par : 
Objet 4 : type &quot;Langue emprunt&#233;e&quot; contenu(non pr&#233;cis&#233;) 
Lien : objet 4 &quot;d&#233;pendant de l'objet 3&quot;  
</p>
<p>o et utilis&#233;s en g&#233;ographie se traduit par : 
Objet 5 : type &quot;Domaine technique&quot;contenu&quot;art culinaire&quot; 
Lien : objet 5 : &quot;d&#233;pendant de l'objet 3&quot;.  
</p>
<p>En r&#233;sum&#233; : les deux expressions de recherche ci-dessus sont s&#233;mantiquement &#233;quivalentes. 
Elles correspondent &#224; deux fa&#231;ons diff&#233;rentes de remplir le formulaire, mais donneront 
strictement les m&#234;mes r&#233;sultats. Le remplissage du formulaire ne vous impose pas de penser 
dans tel ou tel ordre : vous ne faites que d&#233;crire une collection d'objets, dans l'ordre o&#249; ils 
vous viennent &#224; l'esprit, en &#233;non&#231;ant des liens logiques simples qui les unissent. 
</p>
<p>2.4.3.4.3. Connexit&#233; d'une requ&#234;te. 
Imaginons une requ&#234;te comme une collection d'objets ponctuels pesants (chaque objet de la 
requ&#234;te est un point) reli&#233;s par des fils (il y a un fil entre le point X et le point Y si on a 
exprim&#233; un lien entre les objets X et Y correspondants). 
</p>
<p>Supposons que l'on soul&#232;ve au hasard un des objets. Deux cas peuvent se pr&#233;senter : 
a) On soul&#232;ve l'ensemble des autres objets. 
b) Un objet, ou un paquet d'objets reste sur la table. 
Dans le cas b) il existe au moins deux &quot;paquets&quot; d'objets P1 et P2 sans aucun lien entre eux. 
Cette situation est anormale, car elle signifie qu'aucun lien logique n'a &#233;t&#233; sp&#233;cifi&#233; entre P1 et 
P2 et que, par cons&#233;quent, la requ&#234;te n'a aucun sens. 
Nous dirons dans ce cas que l'ensemble des objets est non connexe. Cette anomalie est 
d&#233;tect&#233;e lors de la soumission de la requ&#234;te qui sera alors rejet&#233;e. 
</p>
<p>Examinons un exemple de non connexit&#233; : 
Supposons que l'on veuille savoir quels sont les verbes cit&#233;s en d&#233;riv&#233;s dans le TLF, d&#233;rivant 
de substantifs. On &#233;labore la requ&#234;te suivante : 
</p>
<p>28 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>Objet 1 : type &quot;Entr&#233;e principale&quot; 
Objet 2 : type &quot;Code grammatical&quot;, contenu &quot;substantif&quot;, lien &quot;inclus dans l'objet 1&quot; 
Objet 3 : type &quot;Entr&#233;e d&#233;riv&#233;e&quot; 
Objet 4 : type &quot;Code grammatical&quot;, contenu &quot;verbe&quot;, lien &quot;inclus dans l'objet 3&quot; 
</p>
<p>On cr&#233;e alors 2 paquets ind&#233;pendants : d'une part les objets 1 et 2, et d'autre part les objets 3 
et 4. La requ&#234;te est non connexe. Il manque le lien &quot;d&#233;pendant de l'objet 1&quot; &#224; l'objet 3 pour 
exprimer que l'objet 3 est une entr&#233;e d&#233;riv&#233;e de l'entr&#233;e principale et r&#233;tablir ainsi la 
connexit&#233;. 
</p>
<p>2.4.3.5. La notion de liste de mot 
Les listes de mots peuvent &#234;tre cr&#233;&#233;es manuellement, ou cr&#233;&#233;es par flexion de lemmes, ou 
cr&#233;&#233;es &#224; partir de l&#8217;ensemble des graphies du TLF. Elles peuvent &#234;tre modifi&#233;es elles peuvent 
&#234;tre d&#233;truites. 
</p>
<p>Pour la cr&#233;ation &#224; partir des graphies du TLF, le crit&#232;re de s&#233;lection permet de d&#233;finir quelles 
graphies seront s&#233;lectionn&#233;es. Par exemple, le crit&#232;re .*isme s&#233;lectionne tous les mots se 
terminant par &#8211;isme, et le crit&#232;re .*isme ? s&#233;lectionne tous les mots se terminant par &#8211;isme ou 
&#8211;ismes. 
</p>
<p>La syntaxe g&#233;n&#233;rale d&#8217;un crit&#232;re est la suivante 
</p>
<p>&#8226; Le symbole . (point) d&#233;signe n'importe quel caract&#232;re. 
Ex. : .oule s&#233;lectionnera les mots boule, coule, foule, etc.  
</p>
<p>&#8226; Une expression telle que [abcd] d&#233;signe un caract&#232;re qui est soit a, soit b, soit c, soit d. 
Ex. : coule[sr] s&#233;lectionnera les mots coules ou couler.  
</p>
<p>&#8226; Une expression telle que [^abcd] d&#233;signe un caract&#232;re quelconque, &#224; condition qu'il soit 
diff&#233;rent de a ,b,c ou d. 
Ex. : [^cr]oule s&#233;lectionnera les mots foule, houle, poule, etc. mais pas les mots coule et roule.  
</p>
<p>&#8226; Les parenth&#232;ses servent &#224; d&#233;limiter un groupe de caract&#232;res. Un groupe peut &#234;tre subdivis&#233; en 
plusieurs sous-groupes par le symbole |. Ce symbole signifie qu'il y a alternative. 
Ex. : cheva(l|ux) s&#233;lectionnera cheval ou chevaux. 
Les parenth&#232;ses peuvent &#234;tre imbriqu&#233;es &#224; plusieurs niveaux : 
Ex. (crainti(f|ve)|peureu(x|se)) s&#233;lectionnera craintif, craintive, peureux, peureuse.  
</p>
<p>&#8226; Symboles de modification.  
&#8226; Le symbole * plac&#233; derri&#232;re un caract&#232;re ou un groupe signifie que ce caract&#232;re ou groupe 
</p>
<p>peut &#234;tre absent ou se r&#233;p&#233;ter un nombre quelconque de fois. Ce symbole peut se placer 
derri&#232;re n'importe quel caract&#232;re ou groupe, mais il est en fait tr&#232;s pratique lorsqu'il est associ&#233; 
au symbole . (point) d&#233;signant n'importe quel caract&#232;re. 
Ex. : .*form.* s&#233;lectionnera les mots contenant la cha&#238;ne &quot;form&quot; tels que form&#233;e, r&#233;forme, 
informel, etc. 
Ex. : bla(bla)* s&#233;lectionnera bla, blabla, blablabla, ...  
</p>
<p>&#8226; Le symbole + plac&#233; derri&#232;re un caract&#232;re ou un groupe signifie que ce caract&#232;re ou groupe 
peut se r&#233;p&#233;ter un nombre quelconque de fois (mais au moins une fois). 
Ex. : .+form.* s&#233;lectionnera les mots contenant la cha&#238;ne &quot;form&quot; pr&#233;c&#233;d&#233;e d'au moins un 
caract&#232;re. 
Ex. : bla(bla)+ s&#233;lectionnera blabla, blablabla, ...  
</p>
<p>&#8226; Le symbole ? plac&#233; derri&#232;re un caract&#232;re ou un groupe signifie que ce caract&#232;re ou groupe est 
optionnel. 
Ex. : a?politiques? s&#233;lectionnera les mots politique, politiques, apolitique et apolitiques. 
</p>
<p>29 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>Ex. cin&#233;ma(tograph(e|ique))?s? s&#233;lectionnera : cin&#233;ma, cin&#233;mas, cin&#233;matographe, 
cin&#233;matographes, cin&#233;matographique, cin&#233;matographiques.  
</p>
<p>2.5. Stella et l&#8217;Acad&#233;mie 
</p>
<p>Nous parlons ici des Dictionnaires de l&#8217;Acad&#233;mie Fran&#231;aise, 8&#232;me et 9&#232;me &#233;ditions, qui sont 
g&#233;r&#233;s par Stella, et que l&#8217;on peut atteindre, soit directement, soit par hyper-navigation. 
</p>
<p>L&#8217;aide en ligne est en cours d&#8217;harmonisation avec l&#8217;aide en ligne de Frantext et du TLFi. Le 
principe d&#8217;interrogation repose sur le fait que l&#8217;on peut rechercher des articles comprenant un 
champ ayant un contenu textuel impos&#233;, ou contenant simultan&#233;ment plusieurs champs ayant 
un contenu textuel impos&#233;. Pour interroger efficacement le dictionnaire, il convient de choisir 
soigneusement le (ou les) champs que l&#8217;on veut interroger, et de lui (ou leur) imposer le 
contenu textuel voulu. Voir pour cela les aides &#224; la recherche qui expliquent comment 
proc&#233;der (expressions Stella, expressions r&#233;guli&#232;res, s&#233;lections multiples, expressions de 
fourchette). Une recherche phon&#233;tique est possible, tout comme dans Frantext et le TLFi. 
La personnalisation de l&#8217;environnement est la m&#234;me pour les deux &#233;ditions. 
</p>
<p>3. Exemples d&#8217;exploitation de nos ressources 
</p>
<p>3.1. Dans les deux bases Frantext : 
</p>
<p>3.1.1. Recherche d&#8217;occurrences 
</p>
<p>3.1.1.1. Recherche simples 
Dans Frantext int&#233;gral, on peut rechercher un mot, une s&#233;quence de mots. Par exemple : les 
occurrences du mot mer chez Balzac ou la s&#233;quence oreille de li&#232;vre dans la totalit&#233; de la base 
(demander s&#233;quence 1 =&amp;moreille de &amp;mli&#232;vre pour rechercher ces occurrences au singulier 
ou au pluriel) Il y a des solutions ! Dans Frantext cat&#233;goris&#233;, on peut rechercher un mot 
associ&#233; &#224; un code grammatical donn&#233;. Par exemple, demander les occurrences du substantif 
d&#233;jeuner (s&#233;quence 1 =  &amp;e(g=S,c=d&#233;jeuner), ce qui am&#232;ne 3338 r&#233;ponses 
</p>
<p>3.1.1.2. Recherches par liste de mots 
</p>
<p>Recherche des formes d&#8217;un verbe 
On peut vouloir par ce biais rechercher toutes les formes du verbe g&#233;sir, puis, visualiser cette 
liste, et faire une recherche dans Frantext &#224; partir de cette liste pour confronter les r&#233;sultats &#224; 
la liste th&#233;orique&#8230; 
Recherche des adjectifs de couleur  
A partir d&#8217;une liste manuelle contenant les adjectifs de couleurs.. 
</p>
<p>3.1.1.3. Recherche par grammaire 
La grammaire G4 est la reprise de la grammaire d&#233;taill&#233;e au &#167;2.3.2.3, pour retrouver toutes les 
formes du verbe &quot;se plaindre&quot; dans les phrases affirmatives et n&#233;gatives chez Hugo 
</p>
<p>1) s&#233;lectionner le corpus Hugo 
2) &#233;crire la grammaire suivante, et la sauvegarder sous le nom de G4 
</p>
<p>preamb_aff : 
je(me|m')|tu(te|t')|(se|s')nous nous|vous vous 
</p>
<p>30 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>t_simpl_aff : 
&amp;rpreamb_aff&amp;cplaindre 
t_comp_aff : 
&amp;rpreamb_aff&amp;c&#234;tre&amp;rpart_pass 
part_pass : 
plaint|plainte|plaintes|plaints 
preamb_neg : 
je ne(me|m')|tu ne(te|t')|ne (se|s')nous ne nous|vous ne vous 
t_simpl_neg : 
&amp;rpreamb_neg&amp;cplaindre&amp;rfin_neg 
t_comp_neg : 
&amp;rpreamb_neg&amp;c&#234;tre&amp;rfin_neg&amp;rpart_pass 
fin_neg : 
pas|plus|jamais|mie|gu&#232;re|point 
usage_pronominal : 
&amp;rt_simpl_aff|&amp;rt_comp_aff|&amp;rt_simpl_neg|&amp;rt_comp_neg 
</p>
<p>Lors de la requ&#234;te, demander en s&#233;quence 1 : &amp;rusage_pronominal,G4 
</p>
<p>3.1.2. Recherche de cooccurrences  
3.1.2.1. S&#8217;int&#233;resse-t-on aux fruits ?   
On peut demander les cooccurrences de abricot et cerise dans une m&#234;me phrase (avec 
s&#233;quence 1 =&amp;mabricot et s&#233;quence 2 = &amp;mcerise ) 
</p>
<p>3.1.2.2. S&#8217;int&#233;resse-t-on aux constructions factitives ? 
Dans Frantext cat&#233;goris&#233;, on peut demander les cooccurrences du verbe faire avec un verbe 
infinitif (s&#233;quence 1 =  &amp;cfaire &amp;e(g=Inf), ce qui am&#232;ne plus de 50000 r&#233;ponses. 
</p>
<p>On peut aussi le faire en demandant comme suit : 
D&#233;finition de la s&#233;quence 1 : &amp;cfaire 
D&#233;finition de la s&#233;quence 2 : &amp;e(g=Inf, c=faire) 
D&#233;finition de la s&#233;quence 3 : &amp;e(g=Adv) 
</p>
<p>Position relative des s&#233;quences 1 et 2 : 1 avant2 Distance maximale : 2 
Position relative des s&#233;quences 1 et 3 : 1 avant3 Distance maximale : 2 
Position relative des s&#233;quences 2 et 3 : indiff&#233;rente Distance maximale : 1 
</p>
<p>3.1.3. Extraction de sous-lexiques 
</p>
<p>L&#8217;utilisateur pourra s&#8217;essayer &#224; utiliser le service Calcul de fr&#233;quence pour &#233;tudier le 
vocabulaire utilis&#233; par Hugo dans &quot;Les Travailleurs de la mer&quot;. 
Apr&#232;s avoir d&#233;fini le corpus de travail (auteur et titre), passer par le service liste de mots, 
&quot;cr&#233;ation &#224; partir des graphies de la base&quot;, avec le crit&#232;re .* (= point suivi d&#8217;ast&#233;risque). 
Donner &#224; cette liste un nom (mot-mer) et la sauvegarder (il y a 16600 graphies dans cette 
liste).. 
Ensuite, retourner au menu principal pour aller vers Calculs de fr&#233;quence/&quot;calcul de 
fr&#233;quence&quot;, et remplir le cadre2 du formulaire, en s&#233;lectionnant le nom de la liste &#224; prendre en 
compte, et en choisissant une des options (par exemple par fr&#233;quence d&#233;croissante). En 
</p>
<p>31 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>cliquant sur le bouton Calcul de fr&#233;quence, on obtient la liste des mots utilis&#233;s, accompagn&#233;s 
de leur fr&#233;quence. 
</p>
<p>3.1.4.Etudes morphologiques 
</p>
<p>Par les listes de mots, on pourra rep&#233;rer tous les mots de la base suffix&#233;s par &#8211;ette ou pr&#233;fix&#233;s 
par  anti-. Ou encore tous les mots compos&#233;s &#224; partir de homme- 
</p>
<p>3.1.5. Etudes de syntaxe locale 
</p>
<p>L&#8217;utilisateur pourra essayer d&#8217;&#233;crire des grammaires pour rechercher : 
</p>
<p>3.1.5.1. Des contextes/concordances 
Par exemple des concordances mot &#8211;2 &#224; mot+2 pour un mot donn&#233; par exemple le mot effroi : 
</p>
<p>a)La grammaire G1 qui cherche les concordance &#8211;2 +2 d&#8217;un mot donn&#233; en param&#232;tre 
reg1 : 
&amp;q &amp;q &amp;1 &amp;q &amp;q 
</p>
<p>et demander dans le formulaire de requ&#234;tes, en s&#233;quence 1 :   &amp;rreg1(effroi),G1 
 (plus de 2200 r&#233;ponses sur Frantext cat&#233;goris&#233;.) 
</p>
<p>b) La grammaire G2 qui sort les contextes du mot effroi suivi d&#8217;un adjectif&#8230;. 
reg3 : 
&amp;1 &amp;e(g=&amp;2) 
reg4 : 
&amp;q &amp;q &amp;rreg3(&amp;1,&amp;2)&amp;q &amp;q 
</p>
<p>demander dans le formulaire de requ&#234;tes, en s&#233;quence 1   &amp;rreg3(effroi, A),G2 
</p>
<p>3.1.5.2. Des sch&#233;mas &#233;num&#233;ratifs 
Il s&#8217;agit d&#8217;une grammaire G3 pour une &#233;tude d'&#233;num&#233;rations (dans Frantext cat&#233;goris&#233;). On 
pourra par exemple l&#8217;utiliser pour reconna&#238;tre des s&#233;quences it&#233;ratives chez Hugo ou chez 
Zola. 
La r&#232;gle &quot;item&quot; d&#233;finit l'item textuel qui va se r&#233;p&#233;ter. Elle admet deux param&#232;tres &amp;1 et &amp;2, 
remplac&#233;s par leurs valeurs effectives correspondantes lors de l'invocation de la r&#232;gle. 
Par exemple: 
1) &amp;ritem(en,S) invoque la r&#232;gle item en passant &quot;en&quot; et &quot;S&quot; en param&#232;tre. La r&#232;gle item 
devient alors &#233;quivalente &#224; &quot;en &amp;e(g=S)&quot; ce qui signifie &quot;en&quot; suivi d'un substantif. 
2) &amp;ritem(,A) invoque la r&#232;gle item en passant un premier param&#232;tre vide et  &quot;A&quot; en second 
param&#232;tre. La r&#232;gle item devient alors &#233;quivalente &#224; &quot;&amp;e(g=A)&quot; ce qui d&#233;signe un adjectif. 
</p>
<p>La r&#232;gle &quot;repetition&quot; exprime que l'item textuel doit se r&#233;p&#233;ter deux fois ( sous-expression 
&quot;&amp;ritem(&amp;1,&amp;2) , &amp;ritem(&amp;1,&amp;2)&quot; plus un nombre (sup&#233;rieur ou &#233;gal &#224; 1) quelconque de 
fois (sous expression  &quot;&amp;+(, &amp;ritem(&amp;1,&amp;2))&quot; ). L'item doit donc se r&#233;p&#233;ter 3 fois ou plus. 
Elle permet de rechercher un item textuel se r&#233;p&#233;tant au moins 3 fois avec une virgule 
intercalaire. 
</p>
<p>item : 
  &amp;1 &amp;e(g=&amp;2) 
repetition : 
  &amp;ritem(&amp;1,&amp;2) , &amp;ritem(&amp;1,&amp;2) &amp;+(, &amp;ritem(&amp;1,&amp;2)) 
</p>
<p>32 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>Pour utiliser cette grammaire G3, il suffit d'invoquer la r&#232;gle &quot;repetition&quot; en lui passant les 
deux param&#232;tres qu'elle transmettra &#224; la r&#232;gle &quot;item&quot;. Voici &#224; titre d&#8217;exemple quelques 
r&#233;sultats fournis par cette grammaire sur des textes de Zola : 
</p>
<p>&amp;rrepetition(,A),G3  d&#233;tecte : &quot;beau, jeune, amoureux, &#233;cervel&#233;&quot; (La cur&#233;e); 
&quot;liberticide, anticonstitutionnel, r&#233;volutionnaire&quot; (Le ventre de Paris) ; &quot;rouges, jaunes, 
mauves, blanches&quot; (La faute  de l'abb&#233; Mouret), etc. 
</p>
<p>&amp;rrepetition(en,S),G3  d&#233;tecte : &quot;en rumeurs, en rires, en applaudissements&quot; (Nana) ; 
&quot;en coeurs, en festons, en m&#233;daillons&quot; (L'&#339;uvre) ; &quot;en vertu, en g&#233;nie, en crime, en 
ivrognerie, en saintet&#233;&quot; (Le docteur Pascal), etc. 
</p>
<p>&amp;rrepetition(,V),G3  d&#233;tecte : &quot;chancelait, glissait, tombait&quot; (La conqu&#234;te de 
Plassans) ; &quot;d&#233;battait, mordait, &#233;gratignait&quot; (La joie de vivre) ; &quot;rampait, descendait, 
remontait&quot; (Germinal), etc. 
</p>
<p>3.1.5.3. Des sch&#233;mas syntaxiques 
Voici par exemple une grammaire G4, pour rep&#233;rer toutes les s&#233;quences du genre avoir (peur, 
faim, chaud, etc.), avec possibilit&#233; d&#8217;avoir un adverbe ou un adjectif ins&#233;r&#233; entre les deux :   
</p>
<p>avoir : 
&amp;e(g=V c=&amp;cavoir) 
inser: 
&amp;e(g=Adv A) 
loc : 
&amp;ravoir &amp;rinser &amp;1 
</p>
<p>et  sur le formulaire de requ&#234;te, demander en s&#233;quence 1 &amp;rloc(peur), G4  o&#249; le param&#232;tre &amp;1 
est remplac&#233; par  la valeur peur 
</p>
<p>3.2. dans le TLFi 
</p>
<p>3.2.1. Recherche phon&#233;tique 
</p>
<p>L&#8217;utilisateur pourra rechercher &#224; partir des deux moyens propos&#233;s, des s&#233;quences phon&#233;tiques 
telles que  &#233;tik, ou  psikiatre, ou ouagon 
</p>
<p>3.2.2. Visualisation simple 
</p>
<p>On pourra rechercher par exemple le mot indulgence. L&#8217;article n&#8217;est pas visible dans sa 
totalit&#233;. Il faut donc, de l&#224;, partir explorer le Panneau de r&#233;glage, puis, n&#8217;y ayant pas trouv&#233; la 
solution, retourner au menu principal pour acc&#233;der au service Personnalisation du 
fonctionnement, o&#249; l&#8217;on trouve ce qui nous int&#233;resse, c&#8217;est &#224; dire la Taille des contextes. 
A partir de la visualisation de l&#8217;article, on pourra aussi jouer avec l&#8217;hyper-navigation. 
</p>
<p>3.2.3. Interrogation assist&#233;e 
</p>
<p>On peut demander par exemple quelles entr&#233;es ont re&#231;u un code de verbe transitif et dans un 
emploi populaire, ont une d&#233;finition qui contient le mot manger. 10 r&#233;ponses instructives ! 
</p>
<p>33 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>3.2.4. Interrogation avanc&#233;e 
</p>
<p>3.2.4.1. Etude de vocabulaire chez un auteur :  
Existe-t-il des exemples de Hugo contenant le mot &#171; contemplation &#187; (au singulier ou au 
pluriel), mais PAS extraits des Contemplations ?) 
</p>
<p>Objet 1 = exemple,  contenu = &amp;mcontemplation 
Objet 2 = auteur, lien=inclus dans objet 1, contenu = hugo 
Objet 3 = titre d&#8217;exemple, lien = inclus dans objet 1, contenu= &amp;ncontemplations 
</p>
<p>5 r&#233;ponses. Visualiser la 3 , puis lancer l&#8217;hyper-navigation vers Frantext domaine public. 
 Ce mot a &#233;t&#233; utilis&#233; par 133 auteurs dont la liste s&#8217;affiche. 
 Si on clique sur Hugo =&gt; &#339;uvres dans lesquelles ce mot a &#233;t&#233; employ&#233;, dont Les 
Contemplations. Les contextes s&#8217;affichent dans la fen&#234;tre. 
</p>
<p>3.2.4.2. Etude &#171; morpho-s&#233;mantique &#187; :  
On cherche les entr&#233;es termin&#233;es en &#8211;oir, dont les d&#233;finitions contiennent le mot &#171; outil &#187; en 
position 1 ou 2.  
</p>
<p>On voudrait les entr&#233;es en &#8211;oir, contenant &amp;d2 outil . Mais il est impossible de demander 
directement Objet 1 = Entr&#233;e, contenu = .*oir . Il faut passer par les listes de mots. 
</p>
<p>Donc Gestion de liste de mots &#224; partir du TLFi , crit&#232;re = .*oir, nom de liste = oir  (593 
graphies).  
</p>
<p>Puis ensuite Recherche complexe avec  
Objet 1 = entr&#233;e, contenu =  &amp;loir 
Objet 2  = d&#233;finition, lien = d&#233;pendant de objet 1, contenu = &amp;d2 outil  (54 r&#233;ponses) 
</p>
<p>3.2.4.3. Etude de vocabulaire chez un auteur  (bis) : 
 On cherche les entr&#233;es dont les exemples encha&#238;n&#233;s contiennent une forme conjugu&#233;e du 
verbe aimer 
</p>
<p>Attention : &amp;caimer donne toutes les formes du verbe, conjugu&#233;es ou non. Une requ&#234;te faite 
simplement sur &amp;caimer am&#232;ne 4036 r&#233;ponses. 
</p>
<p>Pour restreindre la requ&#234;te aux formes conjugu&#233;es, on passe par les requ&#234;tes complexes. 
Il y a plusieurs fa&#231;ons d&#8217;afficher le contenu : soit en listant les formes non d&#233;sir&#233;es, ce qui est 
un peu fastidieux, soit en utilisant un raccourci. 
Voici trois variantes : 
</p>
<p>&#131; On peut &#233;crire la requ&#234;te complexe de la fa&#231;on suivante : 
Objet 1 = entr&#233;e 
Objet 2 = exemple encha&#238;n&#233;, lien = d&#233;pendant de objet 1, avec  
</p>
<p>contenu = &amp;caimer | &amp;naimer | &amp;naimant    suivant les formes &#224; &#233;liminer 
(l&#8217;objet 2 doit contenir les formes de aimer, et  non les formes pr&#233;cis&#233;es = l&#8217;infinitif et 
la forme en &#8211;ant. Dans ce cas pr&#233;cis, on obtient 3296 r&#233;ponses (= les formes 
conjugu&#233;es et les participes pass&#233;s). 
</p>
<p>34 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ressources informatis&#233;es et int&#233;gr&#233;es pour l&#8217;&#233;tude du fran&#231;ais 
</p>
<p>&#131; On peut aussi &#233;crire cette requ&#234;te complexe  de la fa&#231;on suivante : 
Objet 1 = entr&#233;e 
Objet 2 = exemple encha&#238;n&#233;, lien = d&#233;pendant de objet 1, avec contenu = 
&amp;caimer | &amp;n &amp;maimer, ce qui &#233;limine toutes les formes non conjugu&#233;es. 
</p>
<p>On obtient 2600 r&#233;sultats. 
</p>
<p>&#131; Variante de ci-dessus : recherche des formes conjugu&#233;es du verbe aimer dans les 
exemples de Colette : 
</p>
<p>Objet 1 = exemple encha&#238;n&#233;, contenu = &amp;caimer | &amp;n &amp;maimer 
Objet 2 = auteur d&#8217;exemple, lien = inclus dans objet 1, avec contenu = colette  
</p>
<p>Il y a 56 r&#233;ponses. 
</p>
<p>3.2.4.4.Recherche  de sch&#233;mas syntaxiques : 
 Par exemple, on cherche les verbes qui se construisent avec la pr&#233;position &#171; de &#187;.) 
Voici deux variantes pour rep&#233;rer  tous les verbes se construisant avec une compl&#233;mentation 
en de 
1&#232;re variante, qui am&#232;ne 29 solutions 
</p>
<p>objet 1 = entr&#233;e 
objet 2 = code grammatical, lien = inclus dans objet 1, contenu = verbe pronominal 
objet 3 = construction, lien = d&#233;pendant de 2, contenu = de 
</p>
<p>2&#232;me variante, qui am&#232;ne 9 solutions 
objet 1 = entr&#233;e 
objet 2 = code grammatical, lien = inclus dans objet 1, contenu = verbe pronominal 
objet 3 = construction, lien = d&#233;pendant de 2, contenu = de+ 
</p>
<p>Il est int&#233;ressant de comparer les deux r&#233;sultats, pour comprendre comment raffiner ses 
requ&#234;tes. 
</p>
<p>4. Perspectives 
</p>
<p>Frantext, TLFi, Dictionnaires de l&#8217;Acad&#233;mie informatis&#233;s et logiciel d&#8217;exploitation Stella 
forment un ensemble, mais ne sont pas ferm&#233;s sur eux-m&#234;mes. Cet ensemble de ressources 
(corpus et dictionnaires) ouvert &#224; toutes sortes d&#8217;utilisations dans tous les domaines, ne 
repr&#233;sente qu&#8217;une partie des richesses de l&#8217;ATILF dont on peut trouver une pr&#233;sentation plus 
g&#233;n&#233;rale dans (Bernard et al., 2001). 
</p>
<p>Cet ensemble de ressources est mis &#224; la disposition de la Communaut&#233; scientifique car il peut 
&#234;tre le fondement de projets divers et vari&#233;s, en particulier la constitution de lexiques d&#233;riv&#233;s, 
&#224; partir d&#8217;&#233;tudes portant sur les synonymes, ou sur les collocations. Plusieurs projets de 
collaboration sont &#224; l&#8217;&#233;tude, entre l&#8217;ATILF et des partenaires int&#233;ress&#233;s, visant de nouveaux 
objectifs scientifiques &#224; partir des ressources offertes. Conscients que ces ressources 
constituent un patrimoine important financ&#233; essentiellement par le CNRS, nous avons le 
souhait de les mettre le plus possible &#224; disposition de la communaut&#233; de recherche &#224; travers 
des projets coop&#233;ratifs de recherche. Toute nouvelle proposition de coop&#233;ration, portant tant 
</p>
<p>35 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascale Bernard, Jacques Dendien, Josette Lecomte, Jean-Marie Pierrel 
</p>
<p>36 
</p>
<p>sur le contenu de ces ressources que sur l&#8217;interface utilisateur des syst&#232;mes propos&#233;s est 
vivement souhait&#233;e et sera &#233;tudi&#233;e avec soin. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Bernard P., Bernet C., Dendien J, Pierrel J.M., Souvay G et Tucsnak Z (2001) &#171; Un serveur 
de ressources linguistiques informatis&#233;es via le Web &#187;, Actes de TALN 2001, Tours, Juillet 
2001, pages 333-338. 
</p>
<p>Bernard P., Dendien J, Lecomte J., Pierrel J.M. (2002) Les ressources de l&#8217;ATILF pour 
l&#8217;analyse lexicale et textuelle : TLFi, Frantext et le logiciel Stella, 8&#232;mes Journ&#233;es 
Internationales d&#8217;Analyse Statistique des Donn&#233;es Textuelles JADT 2002, pages 137-149 
</p>
<p>Bernard P., Lecomte J., Dendien J, Pierrel J.M. (2002) Computerized linguistic resources of 
the research laboratory ATILF for lexical and textual analysis: TLFi, Frantext and the 
software Stella, LREC-2002. 
</p>
<p>Dendien J. (1991) Access to information in a textual database: access functions and optimal 
indexes, Oxford, Clarendon press. 
</p>
<p>Dendien J. (1996). Le projet d&#8217;informatisation du TLF, in Lexicographie et informatique, 
pages 25-34. 
</p>
<p>Leroy-Turcan I.(1998). Balisage formel ou balisage fin pour les dictionnaires anciens 
informatis&#233;s: objectifs et implications m&#233;thodologiques. DictA1998, at 
http://www.inalf.fr/academie8, sous Atelier de balisage de Limoges 
</p>
<p>CNRS (1976-1994) TLF, Dictionnaire de la langue du 19e et 20e si&#232;cle, CNRS, Gallimard, 
Paris.  
</p>
<p> </p>

</div></div>
</body></html>