<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une M&#233;taGrammaire pour les adjectifs du fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Une M&#233;taGrammaire pour les adjectifs du fran&#231;ais
</p>
<p>Nicolas BARRIER
Laboratoire LLF - Universit&#233; Paris VII
</p>
<p>UFR de Linguistique, case 7003
2, place Jussieu
</p>
<p>75251 Paris Cedex 05 - FRANCE
nbarrier@linguist.jussieu.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Grammaires d&#8217;arbres adjoints, M&#233;taGrammaire, D&#233;veloppement, Constructions adjectivales
Tree-Adjoining Grammars, MetaGrammar, Development, French Adjectival constructions
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Initialement d&#233;velopp&#233;e au sein de l&#8217;universit&#233; Paris VII depuis maintenant pr&#232;s de quinze ans, la grammaire FTAG,
une impl&#233;mentation du mod&#232;le des grammaires d&#8217;arbres adjoints pour le fran&#231;ais, a connu ses derni&#232;res ann&#233;es,
diverses &#233;volutions majeures. (Candito, 1996) a ainsi r&#233;alis&#233; l&#8217;int&#233;gration d&#8217;un mod&#232;le de repr&#233;sentation compact
et hi&#233;rarchique d&#8217;informations redondantes que peut contenir une grammaire, au sein d&#8217;un syst&#232;me d&#233;j&#224; existant.
Ce mod&#232;le, que nous appelons M&#233;taGammaire (MG) nous a permis, en pratique, de g&#233;n&#233;rer semi-automatiquement
des arbres &#233;l&#233;mentaires, et par l&#224; m&#234;me, d&#8217;augmenter de fa&#231;on consid&#233;rable les diff&#233;rents ph&#233;nom&#232;nes syntaxiques
couverts par notre grammaire. Un soin tout particulier a donc &#233;t&#233; apport&#233; pour traiter les pr&#233;dicats verbaux, en
laissant cependant (partiellement) de c&#244;t&#233; le pr&#233;dicat adjectival. Nous pr&#233;sentons donc ici une nouvelle impl&#233;men-
tation de ce pr&#233;dicat dans le cadre d&#8217;une extension de la grammaire FTAG existante.
</p>
<p>We present here a new implementation of the adjectival predicate for the FTAG grammar, a french implementation
of the Tree Adjoining Grammar model. FTAG has known over the years many improvements. (Candito, 1996)
hence integrated an additional layer of syntactic representation within the system. The layer, we called Meta-
Grammar (MG) let us improve the syntactic coverage of our grammar by generating semi-automatically dozens of
new elementary trees.
</p>
<p>1 Principes g&#233;n&#233;raux
</p>
<p>La grammaire FTAG s&#8217;inscrit dans le cadre du d&#233;veloppement de grammaires d&#8217;arbres adjoints lexicalis&#233;s &#224; large
couverture pour le fran&#231;ais. Elle a comme particularit&#233; d&#8217;&#234;tre g&#233;n&#233;r&#233;e semi-automatiquementt &#224; partir d&#8217;une M&#233;ta-
Grammaire ind&#233;pendamment de toutes applications vis&#233;es ou domaines particuliers. Comme toute grammaire, elle
est li&#233;e aux comp&#233;tences du locuteur. Nous pr&#233;sentons dans cette section les bases du formalisme, et le concept
m&#234;me de MG.
</p>
<p>1.1 Le formalisme LTAG
</p>
<p>Le mod&#232;le des grammaires d&#8217;arbres adjoints tire son nom de l&#8217;utilisation d&#8217;arbres syntagmatiques, et non de r&#232;gles
de r&#233;&#233;criture classiques, comme c&#8217;est le cas avec les grammaires hors-contexte. Ces arbres &#233;l&#233;mentaires, auxiliaires
ou initiaux, sont utilis&#233;s comme &#233;l&#233;ments atomiques combin&#233;s &#224; l&#8217;aide de deux op&#233;rations : l&#8217;une sp&#233;cifique au
formalisme TAG nomm&#233;e adjonction, l&#8217;autre plus classique nomm&#233;e substitution.
</p>
<p>351</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas BARRIER
</p>
<p>Ces arbres sont tous lexicalis&#233;s, c&#8217;est-&#224;-dire qu&#8217;au moins une de leurs feuilles est occup&#233;e par un &#233;l&#233;ment du
vocabulaire terminal, diff&#233;rent de la cha&#238;ne vide. Cette contrainte permet de mieux rendre compte du fait que
d&#8217;une part, les propri&#233;t&#233;s associ&#233;es aux mots d&#233;pendent du contexte et que d&#8217;autre part, les propri&#233;t&#233;s associ&#233;es
aux syntagmes d&#233;pendent du type d&#8217;&#233;l&#233;ments lexicaux mis en jeu. Tout arbre &#233;l&#233;mentaire lexicalis&#233; doit avoir au
niveau de ses feuilles au moins un n&#339;ud servant d&#8217;ancre lexicale.
</p>
<p>Chaque n&#339;ud d&#8217;un arbre &#233;l&#233;mentaire est &#233;galement renseign&#233; par deux structures de traits top et bottom, utilis&#233;es
comme contraintes. On trouve en partie top, les traits indiquant les relations du n&#339;ud avec les n&#339;uds qui le domi-
nent, ou du m&#234;me niveau ; en partie bottom, les traits indiquant les relations du n&#339;ud avec ceux qu&#8217;il domine. Ces
structures de traits sont mises &#224; jour par unification lors de la combinaison des arbres entre eux. Nous renvoyons &#224;
(Joshi et al., 1975) pour davantage de d&#233;tails.
</p>
<p>1.2 Le concept de M&#233;taGrammaire
</p>
<p>La M&#233;taGrammaire, mise au point par M.H Candito1, suivant la proposition de (Vijay-Shanker et Schabes, 1992),
est un r&#233;seau d&#8217;h&#233;ritage multiple, un m&#233;canisme de partage de propri&#233;t&#233;s syntaxiques entre des unit&#233;s structur&#233;es
dans une hi&#233;rarchie &#224; trois dimensions qui induit un raisonnement quasi-monotone. Chaque propri&#233;t&#233; syntaxique de
cette hi&#233;rarchie est d&#233;clar&#233;e comme un ensemble de descriptions partielles d&#8217;arbres - des &quot;bouts&quot; d&#8217;arbres -, telles
qu&#8217;elles ont &#233;t&#233; expos&#233;es dans (Rogers et Vijay-Shanker, 1994) 2. Ces d&#233;finitions peuvent laisser sous-sp&#233;cifi&#233;es
certaines relations entre n&#339;uds - chaque sous-classe du r&#233;seau venant alors enrichir ces contraintes, en sp&#233;cifiant
certaines de ces relations.
</p>
<p>Afin de construire des structures d&#8217;arbres pr&#233;-lexicalis&#233;es respectant le principe de co-occurence pr&#233;dicat/argument
et de grouper les structures appartenant &#224; la m&#234;me famille d&#8217;arbres, la MG utilise, en plus des descriptions par-
tielles, des fonctions syntaxiques. La sous-cat&#233;gorisation est exprim&#233;e comme une liste de parties du discours
possible &#224; laquelle est associ&#233;e une liste de fonctions. Cette sous-cat&#233;gorisation initiale est celle du cas non mar-
qu&#233;, qu&#8217;une redistribution peut venir modifier, rendant ainsi l&#8217;h&#233;ritage non monotone 3. Les arbres &#233;l&#233;mentaires
partageant la m&#234;me sous-cat&#233;gorisation initiale ne diff&#232;rent que par la r&#233;alisation de surface de leurs fonctions syn-
taxiques, et leurs redistributions. Chaque classe rel&#232;ve donc n&#233;cessairement d&#8217;une des trois dimensions suivantes :
</p>
<p>&#0; Dimension 1 : Sous-cat&#233;gorisation initiale
</p>
<p>&#0; Dimension 2 : Redistribution des fonctions syntaxiques
</p>
<p>&#0; Dimension 3 : R&#233;alisation de surface des fonctions syntaxiques
</p>
<p>A partir de cette hi&#233;rarchie &#224; trois dimensions &#233;crite &#224; la main, un compilateur g&#233;n&#232;re automatiquement les arbres
&#233;l&#233;mentaires associ&#233;s aux descriptions partielles dans un processus &#224; deux &#233;tapes. Le compilateur commence par
engendrer toutes les classes crois&#233;es pour les traduire ensuite en arbre(s) &#233;l&#233;mentaire(s) en sp&#233;cifiant totalement les
relations de dominance et de pr&#233;c&#233;dence lin&#233;aire laiss&#233;es sous-sp&#233;cifi&#233;es dans les descriptions partielles. Chaque
classe crois&#233;e h&#233;rite pr&#233;cis&#233;ment d&#8217;une classe terminale de dimension 1, puis d&#8217;une classe terminale de dimen-
sion 2, puis d&#8217;autant de classes terminales de dimension 3 qu&#8217;il n&#8217;y a de fonctions syntaxiques &#224; r&#233;aliser issues de
dimension 14.
</p>
<p>Par exemple, &#224; partir des informations issues des classes repr&#233;sent&#233;es en FIG. 1, le compilateur g&#233;n&#232;re automa-
tiquement l&#8217;arbre &#233;l&#233;mentaire de la figure5. La logique de description de ces classes utilise un langage de type
d&#233;claratif. Concr&#233;tement, les informations s&#8217;organisent autour de variables (globales) auxquelles est associ&#233;e une
liste possible de cat&#233;gories du discours, de fonctions (syntaxiques), et &#233;ventuellement d&#8217;index - chaque variable
d&#233;signant un n&#339;ud de l&#8217;arbre. Ces variables sont utilis&#233;es comme &#233;l&#233;ments atomiques permettant une description
partielle d&#8217;arbres, dans une notation p&#232;re-fils. Ces variables peuvent &#233;galement se voir renseign&#233;es d&#8217;une liste
d&#8217;&#233;quations, que l&#8217;on peut venir r&#233;viser.
</p>
<p>1La M&#233;taGrammaire a d&#8217;abord &#233;t&#233; impl&#233;ment&#233;e sous Lucid Common Lisp 4.1 par M.H Candito, mais le portage CLISP, tout comme
l&#8217;int&#233;gration d&#8217;un module de g&#233;n&#233;ration &quot;XML&quot;, est de notre fait. Le programme est donc maintenant disponible pour un grand nombre
d&#8217;architectures (y compris les plus r&#233;centes).
</p>
<p>2Dominance imm&#233;diate, parent&#233;, et pr&#233;c&#233;dence.
3La topologie des descriptions partielles est en revanche monotone.
4Le concepteur de la MG est donc ainsi amen&#233; &#224; d&#233;clarer explicitement une classe interm&#233;diaire de dimension 2 pour toute composition de
</p>
<p>redistributions, comme c&#8217;est par exemple le cas, dans le cadre d&#8217;une construction causative/passive. Mais d&#8217;autres impl&#233;mentations n&#8217;ont pas
cette limitation (Xia et al., 1998).
</p>
<p>5Les indices associ&#233;s aux arguments repr&#233;sentent les fonctions initiales des arguments avant redistribution, et non la position de l&#8217;argument
pour sa fonction finale.
</p>
<p>352</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une M&#233;taGrammaire pour les adjectifs du fran&#231;ais
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>&#2;
</p>
<p>&#0;&#1;&#2;&#3;&#4;&#5;&#1;&#6;&#4;&#0; &#4;&#1;&#7;&#2;&#8;&#3;&#4;&#0;&#3;
</p>
<p>&#0;&#1;&#2;&#3;&#4;&#5;&#1;&#6;&#4;&#4; &#9;&#6;&#10;&#11;&#12;&#6;&#13;&#6;&#14;&#1;&#3; &#15;&#16;&#17;&#5;&#16;&#18;&#1;&#19;&#3;
</p>
<p>&#0;&#1;&#2;&#3;&#4;&#5;&#1;&#6;&#4;&#5;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#20;&#17;&#21;&#3;&#18; &#20;&#17;&#21;&#3;&#18; &#4;&#6;&#2;&#1;&#4;&#16;&#13;
</p>
<p>&#22;&#23;&#21;&#3;&#18; &#22;&#23;&#21;&#3;&#18; &#15;&#13;&#1;&#18;&#1;&#24;&#17;&#3;
</p>
<p>&#0;&#3; &#6;&#23;&#21;&#3;&#18; &#0;&#3; &#6;&#23;&#21;&#3;&#18; &#6;&#2;&#1;&#5;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#3;
</p>
<p>&#4;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#6;
</p>
<p>&#6;&#1;
</p>
<p>&#20;
</p>
<p>&#25;
</p>
<p>&#0;&#1;&#2;&#3;
</p>
<p>&#2;
</p>
<p>&#26;
</p>
<p>&#4;
</p>
<p>&#27;&#13;
</p>
<p>&#0;
</p>
<p>&#2; &#26; &#2;
</p>
<p>&#7;&#0;
</p>
<p>Figure 1: Exemple
</p>
<p>Chaque classe comporte &#233;galement une liste (ordonn&#233;e) de super-classes directes. Les relations entre ces classes
peuvent &#234;tre contraintes &#224; l&#8217;aide de quatre op&#233;rations diff&#233;rentes. Les deux premi&#232;res imposent des contraintes
d&#8217;h&#233;ritage positif et n&#233;gatif ; les derni&#232;res sont plus sp&#233;cifiques : l&#8217;une permet d&#8217;interdire tout croisement entre
classes h&#233;ritant d&#8217;une m&#234;me super-classe (cf. extraction, argument relativis&#233; vs cliv&#233;), tandis que l&#8217;autre autorise
des croisements du type &quot;si une classe h&#233;rite de B et de C alors elle doit &#233;galement h&#233;riter de A&quot;.
</p>
<p>Pour autant, des probl&#232;mes sp&#233;cifiques li&#233;s &#224; l&#8217;impl&#233;mentation actuelle de notre syst&#232;me viennent se greffer &#224; la
difficult&#233; de d&#233;crire correctement la grammaire d&#8217;une langue. De par l&#8217;utilisation de variables globales, et non
locales, organiser un ensemble d&#8217;informations syntaxiques au sein d&#8217;un r&#233;seau d&#8217;h&#233;ritage multiple rend parfois
l&#8217;&#233;criture d&#8217;une classe d&#233;licate, l&#8217;aspect de la hi&#233;rarchie se voyant modifi&#233; par l&#8217;introduction de classes interm&#233;-
diaires qui n&#8217;ont pas n&#233;cessairement lieu d&#8217;&#234;tre, et qui remettent ainsi en cause la notion m&#234;me d&#8217;h&#233;ritage. Ceci
dit, il existe &#233;galement des probl&#232;mes d&#8217;ordonnancement des diff&#233;rents arguments entre eux et de partage des
informations, mais ceci d&#233;passe le cadre de cet article.
</p>
<p>2 Une M&#233;taGrammaire pour les adjectifs
Il para&#238;t important de noter ici qu&#8217;il ne s&#8217;agit pas de r&#233;aliser une description du pr&#233;dicat adjectival en particulier,
mais plut&#244;t d&#8217;exposer une nouvelle impl&#233;mentation de l&#8217;adjectif dans le cadre d&#8217;une extension de la grammaire
FTAG existante. En ce sens, le lecteur devra se tourner vers d&#8217;autres r&#233;f&#233;rences pour une &#233;tude pr&#233;cise sur le
sujet. Citons par exemple (Taln Atelier, 1999), (Noailly, 1999) et (Boonen, 2000). Nous tenons &#233;galement &#224;
signaler que les choix linguistiques g&#233;n&#233;raux impos&#233;s par cette nouvelle impl&#233;mentation suivent ceux d&#233;j&#224; d&#233;finis
par (Abeill&#233;, 1991) et (Candito, 1999), pour leur propre impl&#233;mentation d&#8217;une grammaire TAG. Nous renvoyons
le lecteur &#224; (Abeill&#233; et Candito, 2000) pour tout renseignement concernant la grammaire FTAG 6.
Suivant la proposition de (Boonen, 2001), qui a &#233;galement r&#233;alis&#233; l&#8217;int&#233;gration d&#8217;un lexique syntaxique adjectival
pour la grammaire FTAG et &#233;tendu le syst&#232;me de gabarit existant, nous avons choisi de ne plus dissocier les
constructions &#224; attribut du sujet des autres constructions adjectivales. Nous pouvons ainsi maintenant encoder des
relatives, ou des clitiques pour les diff&#233;rents types de compl&#233;ments de l&#8217;adjectif, chose d&#233;licate auparavant avec
les choix op&#233;r&#233;s7 (ces constructions auraient n&#233;cessit&#233; l&#8217;utilisation des multicomponent TAG). Nous consid&#233;rons
l&#8217;adjectif comme la t&#234;te du pr&#233;dicat adjectival, qu&#8217;il se trouve en position d&#8217;&#233;pith&#232;te ou dans une construction avec
copule, et les constructions &#224; attribut de l&#8217;objet, comme une variante des constructions causatives. Nous d&#233;finissons
&#233;galement la notion de sujet comme la cat&#233;gorie modifi&#233;e par l&#8217;adjectif.
</p>
<p>2.1 Sous cat&#233;gorisation initiale
</p>
<p>L&#8217;organisation pr&#233;c&#233;dente de la grammaire, r&#233;alis&#233;e par (Candito, 1999), faisait r&#233;f&#233;rence &#224; cinq familles de
sch&#232;mes diff&#233;rentes pour encoder le pr&#233;dicat adjectival. Quatre d&#8217;entre elles &#233;taient d&#233;di&#233;es &#224; l&#8217;encodage des
adjectifs employ&#233;s comme &#233;pith&#232;tes8, alors que la derni&#232;re seulement, r&#233;alisait l&#8217;int&#233;gration des constructions &#224;
attribut du sujet9.
L&#8217;extension propos&#233;e d&#233;finit seize sch&#233;mas de sous-cat&#233;gorisation diff&#233;rents, sur le mod&#232;le de ceux dej&#224; d&#233;finis
pour les verbes. Le sujet peut y &#234;tre de type nominal ou phrastique, de m&#234;me que ses compl&#233;ments, introduits par
</p>
<p>6Une page web en cours de d&#233;veloppement, est &#233;galement disponible [http://ftag.linguist.jussieu.fr]
7L&#8217;adjectif &#233;tait substitu&#233; dans l&#8217;arbre du verbe attributif
8n0A [4 arbres], n0Apn1 [2 arbres], n0Aps1 [2 arbres], et n0Ades1 [7 arbres].
9n0Va1 [32 arbres].
</p>
<p>353</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas BARRIER
</p>
<p>la pr&#233;position &#224; ou de. Nous avons &#233;galement ajout&#233; des familles pour des adjectifs qui prennent un compl&#233;ment,
phrastique ou nominal, introduit par une pr&#233;position sous-sp&#233;cifi&#233;e 10. Cette pr&#233;position, d&#233;sign&#233;e par la lettre
p, est alors renseign&#233;e au cas par cas pour chaque adjectif, dans les lexiques syntaxiques. La raison d&#8217;une telle
distinction est fonction du fait qu&#8217;un syntagme pr&#233;positionnel introduit par une pr&#233;position autre que &#224; ou de, ne
peut &#234;tre cliticis&#233;.
</p>
<p>Le tableau 1 donne pour chaque sous-cat&#233;gorisation initiale un exemple de r&#233;alisation possible. Les noms des
familles sont normalement transparents et suivent le sch&#233;ma d&#8217;oblicit&#233; des arguments par rapport &#224; la t&#234;te. La
cat&#233;gorie de l&#8217;ancre est indiqu&#233;e en majuscule. On note le sujet avec l&#8217;indice 0 et les compl&#233;ments de 1 &#224; 2.
Les syntagmes nominaux sont renseign&#233;s par n, et les compl&#233;ments phrastiques par s. Sont entre parenth&#232;ses, les
arguments optionnels.
</p>
<p>Famille Exemple
n0A Jean est barbu
n0A(pn1) Jean est fort en histoire
n0A(&#224;n1) Jean est sourd &#224; cette proposition
n0A(den1) Jean est amoureux de Marie
n0A(&#224;n1)(pn2) Jean est sup&#233;rieur &#224; Paul en math&#233;matiques
n0A(&#224;n1)(den2) Jean est redevable &#224; Paul de 100 francs
n0A(den1)(pn2) Jean est quitte de ses dettes envers la societ&#233;
n0A(ps1) Le caf&#233; est bon pour rester &#233;veill&#233;
n0A(&#224;s1) Jean est attentif &#224; ce que tout se passe bien
n0A(des1) Jean est certain de pouvoir assister &#224; la r&#233;union
n0A(&#224;n1)(des2) Jean est reconnaissant &#224; Paul d&#8217;&#234;tre venu
s0A Faire des erreurs est inacceptable
s0A(pn1) Arr&#234;ter de fumer est bon pour la sant&#233;
s0A(ps1) Faire du sport est bon pour &#233;viter les crises cardiaques
s0A(an1) Faire du sport est n&#233;cessaire au corps
s0A(den1) Faire du sport est ind&#233;pendant de vos autres activit&#233;s
</p>
<p>Table 1: Sous cat&#233;gorisation initiale des adjectifs du fran&#231;ais : exemples
</p>
<p>Nous distinguons pour chaque argument de l&#8217;adjectif, les fonctions initiales suivantes : sujet, prep-objet, &#224;-objet,
de-objet, prep-objet-second, et de-objet-second. Ces fonctions pourront se voir modifi&#233;es dans le cadre d&#8217;une
redistribution syntaxique intervenant en dimension 2. Comparativement &#224; la hi&#233;rarchie verbale d&#233;j&#224; d&#233;finie, la
sous-cat&#233;gorisation initiale pour les constructions adjectivales se trouve donc plus r&#233;duite, et fait appel &#224; un jeu de
fonctions plus restreint (pas d&#8217;objet direct, ni de locatif).
</p>
<p>2.2 Redistribution
</p>
<p>La M&#233;taGrammaire des adjectifs pour le fran&#231;ais couvre les ph&#233;nom&#232;nes suivants de redistribution : &#233;pith&#232;te,
attribut du sujet, causatif et impersonnel. Parmi les constructions causatives, on distingue le causatif actif, le
causatif passif et le causatif passif impersonnel sans agent.
</p>
<p>1. un homme heureux [Epith&#232;te]
2. Jean est barbu [Attribut du sujet]
3. Il est inacceptable de commettre des erreurs [Impersonnel]
4. A. Poulain rend les gens heureux [Causatif actif]
5. Des gens sont rendus heureux par A. Poulain [Causatif passif]
6. Il est rendu impossible de faire cela [Causatif passif impersonnel]
</p>
<p>Le Tableau 2 montre les diff&#233;rentes r&#232;gles lexicales mises en jeu dans chaque redistribution pour le passage d&#8217;une
fonction syntaxique dite initiale &#224; une fonction syntaxique dite finale. Par exemple, dans le cadre d&#8217;une construction
</p>
<p>10Autre que &#224; ou de.
</p>
<p>354</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une M&#233;taGrammaire pour les adjectifs du fran&#231;ais
</p>
<p>impersonnelle, le sujet phrastique initial devient compl&#233;ment phrastique indirect final de l&#8217;adjectif, et le clitique il
est promu sujet. Une contrainte est &#233;galement ajout&#233;e, puisqu&#8217;il est impossible d&#8217;op&#233;rer cette construction, lorsque
le sujet est de type nominal (ou clitique) :
</p>
<p>1. Faire du sport est bon pour le corps / Il est bon pour le corps de faire du sport
</p>
<p>2. Le sport est bon pour le corps / * Il est bon pour le corps le sport
</p>
<p>Sujet initial
Construction N Cl S Redistribution
Attribut + + + Aucune
Causatif actif + + - Sujet initial devient objet
</p>
<p>Introduction d&#8217;un sujet causateur
Causatif passif + + + Sujet causateur devient agent causateur
</p>
<p>Objet devient sujet
Causatif passif + + + Agent causateur omis
Impersonnel sans Agent Introduction d&#8217;un clitique sujet fig&#233; impersonnel
Epith&#232;te + - - Sujet initial devient Sujet &#233;pith&#232;te
Impersonnel - - + Sujet initial devient Compl&#233;ment phrastique indirect
</p>
<p>Introduction d&#8217;un clitique sujet fig&#233; impersonnel
</p>
<p>Table 2: Redistributions avec contraintes
</p>
<p>2.3 R&#233;alisation de surface des fonctions syntaxiques
</p>
<p>Les diff&#233;rentes fonctions grammaticales que nous distinguons pour repr&#233;senter la sous-cat&#233;gorisation initiale ont
&#233;t&#233; exhib&#233;es lors de la description de la dimension 1 en section 2.1. Pour la sous-cat&#233;gorisation finale, nous avons
introduit en section 2.2, les fonctions objet, pour les constructions causatives, par-objet, pour les constructions
causatives passives, et cpl-phr-indirect, pour les constructions impersonnelles. Les classes terminales de la di-
mension 3 sont obtenues &#224; partir de deux sources d&#8217;information : les fonctions syntaxiques finales de l&#8217;argument
sous-cat&#233;goris&#233; et les constructions qui peuvent lui &#234;tre associ&#233;es. Nous donnons en TAB. 3, la liste des principales
r&#233;alisations de surface que nous avons impl&#233;ment&#233;es11, pour les quelques fonctions syntaxiques d&#233;finies.
</p>
<p>R&#233;alisation de surface
Nominal Clitique Cliv&#233; Phrastique Relativis&#233; Non r&#233;alis&#233;
</p>
<p>SUJET Canonique X Nominal X qui
Invers&#233; Phrastique
</p>
<p>PREP-OBJET X Nominal X qui, lequel X
Phrastique quoi
</p>
<p>&#192;-OBJET X X Nominal X qui, lequel X
Phrastique quoi
</p>
<p>DE-OBJET X X Nominal X dont X
Phrastique
</p>
<p>PREP-OBJET-SECOND X Nominal qui, lequel X
quoi
</p>
<p>DE-OBJET-SECOND X X Nominal X dont X
CPL-PHR-INDIRECT X
OBJET Ant&#233;pos&#233; X
</p>
<p>Post-pos&#233;
PAR-OBJET X X
</p>
<p>Table 3: R&#233;alisation de surface des fonctions syntaxiques
</p>
<p>La FIG. 2 montre deux exemples de r&#233;alisation de sch&#233;mas d&#8217;arbre avec argument extrait pour le pr&#233;dicat adjectival.
Dans le premier arbre, le premier compl&#233;ment &#25;
</p>
<p>&#1;
</p>
<p>de l&#8217;adjectif est relativis&#233; ; dans le second, il est cliv&#233;. Ces
arguments sont r&#233;alis&#233;s &#224; l&#8217;int&#233;rieur de l&#8217;arbre r&#233;gi par l&#8217;ancre adjectivale. Nous donnons pour information d&#8217;autres
sch&#233;mas d&#8217;arbre disponibles en ligne &#224; l&#8217;adresse suivante http://www.linguist.jussieu.fr/&#7;&#4;&#23;&#16;&#10;&#10;&#1;&#3;&#10;&#28;&#4;&#1;&#7;_&#8;&#3;&#4;&#0;_
</p>
<p>11Les arguments questionn&#233;s seront prochainement int&#233;gr&#233;s &#224; la hi&#233;rarchie.
</p>
<p>355</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas BARRIER
</p>
<p>&#25;
</p>
<p>&#5;
</p>
<p>&#25;
</p>
<p>&#1;
</p>
<p>&#3; &#20;
</p>
<p>&#5;
</p>
<p>&#27;
</p>
<p>&#8;&#6;&#4;&#18;
</p>
<p>&#20;
</p>
<p>&#25;
</p>
<p>&#0;
</p>
<p>&#2; &#26; &#2;
</p>
<p>&#7;&#0;
</p>
<p>&#20;
</p>
<p>&#4;
</p>
<p>&#26;
</p>
<p>&#4;&#6;
</p>
<p>&#27;&#13;
</p>
<p>&#6;
</p>
<p>&#15;&#3;
</p>
<p>&#26;
</p>
<p>&#6;
</p>
<p>&#2;
</p>
<p>&#20;&#29;
</p>
<p>&#1;
</p>
<p>&#29; &#10;&#3;&#11;
</p>
<p>&#1;
</p>
<p>&#8;&#3;&#0;
</p>
<p>&#25;
</p>
<p>&#1;
</p>
<p>&#2;
</p>
<p>&#20;
</p>
<p>&#5;
</p>
<p>&#27;
</p>
<p>&#24;&#17;&#3;
</p>
<p>&#20;
</p>
<p>&#25;
</p>
<p>&#0;
</p>
<p>&#2; &#26; &#2;
</p>
<p>&#7;&#0;
</p>
<p>&#30;&#31; La femme dont Jean est amoureux &#30;&#31; C&#8217;est de Marie que Jean est amoureux
</p>
<p>Figure 2: Arbres &#233;l&#233;mentaires avec argument extrait
</p>
<p>Conclusion
</p>
<p>L&#8217;impl&#233;mentation d&#8217;une hi&#233;rarchie pour le pr&#233;dicat adjectival en FTAG n&#8217;a pas pos&#233; sp&#233;cifiquement de probl&#232;mes,
si ce n&#8217;est qu&#8217;il a fallu r&#233;aliser ce travail au sein d&#8217;un syst&#232;me existant, et par l&#224; m&#234;me, respecter les conventions
pr&#233;c&#233;demment adopt&#233;es. Le principal &#233;cueil se situait dans la r&#233;alisation des diff&#233;rents arguments, ou plus pr&#233;-
cis&#233;ment de leur position entre eux. Le point de vue adopt&#233; pour FTAG est de disposer de structures relativement
plates, ce qui n&#8217;est pas pour faciliter l&#8217;impl&#233;mentation. Le d&#233;veloppement de cette M&#233;taGrammaire s&#8217;est fait de
fa&#231;on incr&#233;mentale, avec r&#233;vision partielle des donn&#233;es, ie que l&#8217;on a commenc&#233; &#224; s&#8217;int&#233;resser &#224; la r&#233;alisation
des premiers arguments de l&#8217;adjectif (sujet vs SP1), pour ensuite venir compl&#233;ter ces premi&#232;res descriptions par
d&#8217;autres compl&#233;ments. Peu &#224; peu, d&#8217;autres ph&#233;nom&#232;nes ont &#233;t&#233; int&#233;gr&#233;s.
</p>
<p>En r&#233;sum&#233;, cette hi&#233;rarchie adjectivale contient approximativement 80 classes terminales pour 16 sch&#233;mas de sous
cat&#233;gorisation initiale et 5 redistributions. Au total, ce ne sont pas moins de 2690 nouveaux sch&#233;mas d&#8217;arbre qui
sont venus s&#8217;ajouter aux 5250 arbres existants. Ce travail reste cependant incomplet, dans la mesure o&#249; celui-ci
n&#8217;a pas encore fait l&#8217;objet d&#8217;une &#233;valuation sur corpus. Il faudra plus particuli&#232;rement s&#8217;attacher aux structures
de trait associ&#233;es aux n&#339;uds et veiller &#224; les enrichir. Il conviendra enfin d&#8217;effectuer un travail similaire pour les
noms en position d&#8217;adjectif.
</p>
<p>References
</p>
<p>Taln , Atelier (1999). Description des adjectifs pour les traitements informatiques. Organis&#233; par Pierrette Bouillon
et Evelyne Viegas.
</p>
<p>Abeill&#233;, A. (1991). &#171; Une grammaire lexicalis&#233;e d&#8217;arbres adjoints pour le fran&#231;ais &#187;. PhD thesis, Universit&#233;
Paris VII.
</p>
<p>Abeill&#233;, A. et Candito, M.-H. (2000). &#171; FTAG: A Lexicalized Tree Adjoining Grammar for French &#187;, pages 305&#8211;
329. CSLI Publications. Edited by Anne Abeill&#233; and Owen Rambow.
</p>
<p>Boonen, D. (2000). &#171; Typologie syntaxique des constructions adjectivales en fran&#231;ais &#187;. Master&#8217;s thesis,
Katholieke Universiteit Leuven.
</p>
<p>Boonen, D. (2001). &#171; Le pr&#233;dicat adjectival en FTAG &#187;. DEA Universit&#233; Paris VII.
Candito, M.-H. (1996). &#171; A principle-based hierarchical representationn of LTAGs &#187;. Dans Proceedings of
COLING-96.
</p>
<p>Candito, M.-H. (1999). &#171; Repr&#233;sentation modulaire et param&#233;trable de grammaires &#233;lectroniques lexicalis&#233;es &#187;.
PhD thesis, Universit&#233; Paris VII. Application au fran&#231;ais et &#224; l&#8217;italien.
Joshi, A., Levi, L., et Takahashi, M. (1975). &#171; Tree adjunct grammars &#187;. Dans Journal of the Computer and
System Sciences.
</p>
<p>Noailly, M. (1999). L&#8217;adjectif en fran&#231;ais. Ophrys.
Rogers, J. et Vijay-Shanker, K. (1994). &#171; Obtaining Trees from their Descriptions: An application to Tree Ad-
joining Grammars &#187;.
</p>
<p>356</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une M&#233;taGrammaire pour les adjectifs du fran&#231;ais
</p>
<p>Vijay-Shanker, K. et Schabes, Y. (1992). &#171; Structure sharing in lexicalized tree adjoining grammar &#187;. Dans
Proceedings of COLING-92.
</p>
<p>Xia, F., Palmer, M., Vijay-Shanker, K., et Rosenzweig, J. (1998). &#171; Consistent Grammar Development Using
Partial-Tree Descriptions for Lexicalized Tree-Adjoining Grammars &#187;. Dans TAG+4 Proceedings.
</p>
<p>357</p>

</div></div>
</body></html>