<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>G&#233;n&#233;ration automatique d&#8217;exercices contextuels de vocabulaire</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>G&#233;n&#233;ration automatique d&#8217;exercices contextuels de vocabulaire 
</p>
<p>Thierry Selva 
 
</p>
<p>ILT &#8211; K.U. Leuven 
Dekenstraat 6  
</p>
<p>3000 Leuven, Belgique 
thierry.selva@ilt.kuleuven.ac.be 
</p>
<p> 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Cet article explore l&#8217;utilisation de ressources lexicales et textuelles ainsi que d&#8217;outils issus du 
TAL dans le domaine de l&#8217;apprentissage des langues assist&#233; par ordinateur (ALAO). Il aborde 
le probl&#232;me de la g&#233;n&#233;ration automatique ou semi-automatique d&#8217;exercices contextuels de 
vocabulaire &#224; partir d&#8217;un corpus de textes et de donn&#233;es lexicales au moyen d&#8217;un &#233;tiqueteur et 
d&#8217;un parseur. Sont &#233;tudi&#233;es les caract&#233;ristiques et les limites de ces exercices. 
</p>
<p>This paper examines the use of lexical and textual resources and NLP tools in Computer-
Assisted Language Learning (CALL). It tackles the issue of automatic or semi-automatic 
generation of contextual vocabulary exercises from a corpus of texts and lexical data by 
means of a tagger and a parser. It studies the characteristics and limits of these exercises. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
</p>
<p>Exercices contextuels, lexique, corpus, ALAO. 
Contextual exercises, lexicon, corpus, CALL. 
</p>
<p>1 Introduction 
</p>
<p>Les activit&#233;s p&#233;dagogiques concernant le vocabulaire sont d&#233;sormais tr&#232;s nombreuses sur 
Internet (Jaser 2002, Didier 2002, La Passerelle 2002, etc., pour ne citer que ces sites). Le 
plus souvent, il s&#8217;agit d&#8217;exercices &#224; trous ou de QCM, con&#231;us &#224; l&#8217;aide de syst&#232;mes auteur, un 
des plus connu &#233;tant Hot Potatoes. On peut aussi trouver des jeux sous forme de mots crois&#233;s 
ou bien des exercices d&#8217;appariement entre une image graphique et le nom de l&#8217;objet dessin&#233;. 
Toutes ces activit&#233;s ont un point commun : ce sont des transpositions &#224; l&#8217;&#233;cran d&#8217;exercices 
con&#231;us et r&#233;dig&#233;s &#224; l&#8217;origine sur le papier. L&#8217;unique int&#233;r&#234;t de l&#8217;ordinateur est l&#8217;interactivit&#233; 
</p>
<p>185 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Selva 
</p>
<p>qu&#8217;il procure, c&#8217;est-&#224;-dire qu&#8217;il compare les r&#233;ponses donn&#233;es avec celles qu&#8217;il a en m&#233;moire 
et attribue sur-le-champ un score. 
</p>
<p>L&#8217;objet de notre travail est d&#8217;&#233;tudier les exercices qu&#8217;il est possible de g&#233;n&#233;rer 
automatiquement &#224; partir de ressources lexicales et textuelles (dictionnaire et corpus) et des 
outils TAL d&#8217;analyse textuelle (analyseur syntaxique et &#233;tiqueteur). Ce travail est r&#233;alis&#233; dans 
le cadre du projet ALFALEX (Active Leeromgeving Frans voor Anderstaligen Lexicon, 
environnement d'apprentissage lexical interactif pour apprenants du fran&#231;ais), en cours de 
d&#233;veloppement &#224; la K.U.Leuven. A c&#244;t&#233; du module de g&#233;n&#233;ration d&#8217;exercices que nous allons 
pr&#233;senter, l&#8217;environnement comprend un dictionnaire &#233;lectronique pour apprenants, le 
DAFLES1 (Selva et al., 2002), et le corpus GRELEP2 (Verlinde, Selva, 2001 et 2002). 
</p>
<p>Les exercices que nous cherchons &#224; g&#233;n&#233;rer sont des exercices contextuels, c&#8217;est-&#224;-dire des 
activit&#233;s dans lesquelles le vocable3 est entour&#233; de son contexte (la phrase, dans le cadre de ce 
projet). Le contexte permet en effet de pr&#233;ciser le sens du vocable et d&#8217;&#233;tudier comment celui-
ci s&#8217;emploie et fonctionne dans la cha&#238;ne discursive. Les diff&#233;rentes propri&#233;t&#233;s du vocable 
sont ainsi illustr&#233;es de mani&#232;re plus compl&#232;te et plus naturelle que lors d&#8217;activit&#233;s hors 
contexte. D&#8217;autre part, le contexte facilite la pratique d&#8217;inf&#233;rences, une strat&#233;gie essentielle en 
apprentissage des langues. 
</p>
<p>L'int&#233;r&#234;t de la g&#233;n&#233;ration automatique ou semi-automatique r&#233;side dans le fait que les 
exercices peuvent porter potentiellement sur tout le lexique (et donc en particulier, dans le cas 
de l'auto-apprentissage, sur celui que l'apprenant est en train de travailler) et peuvent &#234;tre 
refaits avec de nouvelles &#233;preuves, de nouvelles phrases, sans intervention (manuelle) de la 
part des concepteurs. En outre, le syst&#232;me poss&#232;de des informations sur les &#233;nonc&#233;s qui, 
coupl&#233;es avec des ressources lexicales, lui permettent de retourner un diagnostic sur la 
r&#233;ponse un peu plus &#233;labor&#233; que le classique vrai ou faux4. Par ailleurs, en dotant le syst&#232;me 
d&#8217;une &#171; m&#233;moire &#187;, en l'occurrence un dictionnaire personnalis&#233; dans lequel sont consign&#233;es 
les annotations des apprenants et le d&#233;tails de leurs r&#233;sultats, on parvient &#224; une meilleure 
gestion des &#233;nonc&#233;s en &#233;vitant, par exemple, de reposer une &#233;preuve qui a d&#233;j&#224; &#233;t&#233; r&#233;solue 
avec succ&#232;s. Ainsi un tel environnement permet une plus grande individualisation de 
l&#8217;apprentissage. 
</p>
<p>Nous allons maintenant &#233;tudier les exercices obtenus en les classant en deux cat&#233;gories : les 
exercices contextuels g&#233;n&#233;r&#233;s automatiquement et ceux g&#233;n&#233;r&#233;s semi-automatiquement. 
</p>
<p>                                                 
1  Dictionnaire d&#8217;Apprentissage du Fran&#231;ais Langue Seconde ou &#201;trang&#232;re. La nomenclature pr&#233;vue est 
</p>
<p>d&#8217;environ 12 000 entr&#233;es (mai 2002, un tiers des entr&#233;es sont d&#233;crites). Il s&#8217;agit d&#8217;un dictionnaire en ligne 
(http://www.kuleuven.ac.be/dafles) qui n&#8217;est pas d&#233;riv&#233; d&#8217;une version papier et dont l&#8217;interface, gr&#226;ce &#224; des 
scripts PHP, tente d&#8217;apporter plus d&#8217;interactivit&#233; et d&#8217;efficacit&#233; dans la consultation. Le dictionnaire repose 
sur une base de donn&#233;es relationnelle MySQL, ce qui permet d&#8217;extraire ais&#233;ment les donn&#233;es et de les 
r&#233;utiliser dans d&#8217;autres applications. 
</p>
<p>2  Ce corpus, qui regroupe une ann&#233;e (1998) des quotidiens Le Monde (France) et Le Soir (Belgique) et deux 
ann&#233;es (1998 et 1999) du quotidien Le Devoir (Qu&#233;bec), contient pr&#232;s de 80 millions de mots lemmatis&#233;s par 
l&#8217;analyseur Cordial Analyseur version 7 (Cordial, 2002). 
</p>
<p>3  Mot polys&#233;mique ou monos&#233;mique qui regroupe un ensemble coh&#233;rent d&#8217;acceptions. voler fait r&#233;f&#233;rence &#224; 
deux vocables. 
</p>
<p>4  Il ne s&#8217;agit pas ici uniquement de d&#233;tecter des coquilles ou des erreurs d&#8217;accent mais de d&#233;terminer et 
d&#8217;accepter des r&#233;ponses approchantes, gr&#226;ce &#224; l&#8217;utilisation d&#8217;un dictionnaire de synonymes par exemple. 
</p>
<p>186 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration automatique d&#8217;exercices contextuels de vocabulaire 
</p>
<p>L&#8217;article expose les caract&#233;ristiques et les limites de ces exercices. Ceux-ci sont disponibles 
en ligne &#224; l&#8217;adresse Internet : http://www.kuleuven.ac.be/alfalex. 
</p>
<p>2 Exercices contextuels g&#233;n&#233;r&#233;s automatiquement 
</p>
<p>Les trois premiers exercices, qui sont des exercices contextuels, ont &#233;t&#233; obtenus en faisant 
analyser les sorties de Cordial par des ex&#233;cutables en C. Ces programmes ont produit des 
&#233;nonc&#233;s qui ont &#233;t&#233; stock&#233;s dans la base de donn&#233;es du syst&#232;me et qui sont ensuite affich&#233;s 
par des scripts PHP. 
</p>
<p>Quant au quatri&#232;me, il s&#8217;agit d&#8217;un exercice automatique hors contexte. Il permet d&#8217;&#233;tudier les 
relations d&#8217;actance entre plusieurs vocables (ou plus pr&#233;cis&#233;ment entre leurs sens, les lexies). 
</p>
<p>2.1 Exercice de morphologie 
</p>
<p>Dans cet exercice, l'apprenant doit fl&#233;chir correctement un adjectif ou un nom donn&#233; en 
indiquant le f&#233;minin singulier, le masculin pluriel ou le f&#233;minin pluriel suivant le contexte de 
la phrase, c&#8217;est-&#224;-dire, dans le cas de l&#8217;adjectif, le genre et le nombre du nom qu&#8217;il qualifie, et 
dans celui d&#8217;un nom, la marque du pluriel. L'exercice ne traite que les flexions &#171; irr&#233;guli&#232;res &#187; 
(f&#233;minin diff&#233;rent de +e et pluriel diff&#233;rent de +(e)s). L&#8217;inventaire de ces terminaisons a &#233;t&#233; 
effectu&#233; &#224; partir des codages morphologiques du DAFLES. On obtient en tout une trentaine 
de terminaisons pertinentes pour l&#8217;exercice (cr&#233;atrices, travaux, longue, aigu&#235;, europ&#233;ennes, 
etc.), au stade de la description du dictionnaire (4000 mots). Le questionnaire comprend une 
dizaine de phrases &#224; compl&#233;ter, chacune proposant une terminaison diff&#233;rente. 
</p>
<p> 
</p>
<p>Figure 1 : extrait de l'exercice de morphologie 
</p>
<p>Cet exercice a &#233;t&#233; produit &#224; partir d&#8217;une portion du corpus de 700 000 mots. Une fois les 
textes &#233;tiquet&#233;s, chacun de ces mots s&#8217;est vu attribuer un codage morphologique par une 
jointure externe sous MySQL avec la table de morphologie du DAFLES. Ensuite, pour 
diminuer la taille des donn&#233;es et les rendre plus maniables, ont seules &#233;t&#233; retenues les phrases 
contenant au moins une terminaison pertinente, avec un maximum de trente phrases pour 
chaque terminaison. Au total, on obtient ainsi une table de 48 600 enregistrements. Par la 
suite, le script PHP tire al&#233;atoirement une dizaine de terminaisons, recherche les phrases qui 
</p>
<p>187 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Selva 
</p>
<p>les contiennent, effectue un deuxi&#232;me tirage al&#233;atoire parmi elles et les affiche. Du fait des 
accords article-nom et adjectif-nom dans la phrase, il est toujours possible de savoir d&#8217;apr&#232;s le 
contexte le genre et le nombre du mot &#224; compl&#233;ter et il n&#8217;y a pas d&#8217;ambigu&#239;t&#233;. La marque du 
pluriel &#233;tant facilement rep&#233;rable, le seul probl&#232;me peut provenir, dans le cas d&#8217;un adjectif, du 
genre du nom qu&#8217;il qualifie. Par exemple, dans la phrase 5 de la figure 1, l&#8217;adjectif dernier se 
rapporte &#224; liasse. Ce nom n&#8217;&#233;tant pas tr&#232;s fr&#233;quent, l&#8217;apprenant peut fl&#233;chir convenablement 
dernier, mais se tromper sur le genre. Le syst&#232;me doit donc &#233;mettre un diagnostic en deux 
parties : l&#8217;adjectif est-il correctement fl&#233;chi (i.e. la terminaison indiqu&#233;e fait-elle partie des 
quatre possibles) ? Si non, y a-t-il une erreur de genre ? 
</p>
<p>Pour &#233;viter ce probl&#232;me, une possibilit&#233; consisterait &#224; contr&#244;ler les noms que qualifient les 
adjectifs &#224; fl&#233;chir. On pourrait facilement appliquer des crit&#232;res de fr&#233;quence, information 
contenue dans le DAFLES, et afficher des phrases avec des mots compris dans telle ou telle 
tranche de fr&#233;quence, en fonction du niveau souhait&#233;. Mais il faudrait alors d&#233;terminer que 
l&#8217;adjectif s&#8217;accorde avec le nom en question, ce que ne peut faire le lemmatiseur. La solution 
consiste alors &#224; utiliser l&#8217;analyseur syntaxique de Cordial. C&#8217;est ce que nous avons fait pour 
l&#8217;exercice suivant qui porte sur le genre. 
</p>
<p>2.2 Exercice sur le genre 
</p>
<p>Dans cet exercice, l&#8217;apprenant doit retrouver le genre des noms en compl&#233;tant l&#8217;article et/ou 
l&#8217;adjectif qui s&#8217;accorde avec le nom. Le syst&#232;me contient une liste de 32 noms communs 
(aspect, dialogue, probl&#232;me, interview, loi, programme, voix, etc.) sur lesquels les &#233;tudiants 
n&#233;erlandophones font de fr&#233;quentes erreurs de genre. Les caract&#232;res qu&#8217;il faut retrouver sont, 
pour chaque mot, les d&#233;sinences des diverses formes du masculin, f&#233;minin et pluriel. On 
enl&#232;ve &#233;galement la derni&#232;re lettre du radical pour obliger l&#8217;utilisateur &#224; taper au moins une 
lettre afin qu&#8217;il n&#8217;obtienne pas une bonne r&#233;ponse en laissant le champ vide. 
</p>
<p> 
</p>
<p>Figure 2 : extrait de l'exercice sur le genre des noms 
</p>
<p>Pour produire ces &#233;nonc&#233;s, une partie du corpus a &#233;t&#233; analys&#233;e par le parseur de Cordial. 
Outre le lemme et la cat&#233;gorie grammaticale, le logiciel indique le groupe syntagmatique du 
mot ainsi que le pivot du syntagme nominal. L&#8217;interrogation porte alors sur les adjectifs et les 
articles de ce syntagme, du moins ceux qui pr&#233;sentent une variation morphologique sur le 
</p>
<p>188 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration automatique d&#8217;exercices contextuels de vocabulaire 
</p>
<p>genre. Ainsi ne sont pas pris en compte les mots invariables en genre (chaque, souple, les, 
deuxi&#232;me, etc.). Il faut aussi consid&#233;rer les d&#233;pendances plus lointaines comme les cas o&#249; 
l&#8217;adjectif est attribut du sujet. 
</p>
<p>La production de l&#8217;exercice est d&#233;pendante des erreurs d&#8217;analyse du parseur. Les erreurs 
concernent la mauvaise constitution du syntagme nominal, le plus souvent &#224; cause d&#8217;une 
erreur de cat&#233;gorie grammaticale. Le groupe nominal &#171; cass&#233; &#187;, il n&#8217;est plus possible de 
d&#233;terminer les mots qui s&#8217;accordent avec le nom en question et l&#8217;&#233;nonc&#233; peut indirectement 
donner la r&#233;ponse. C&#8217;est le cas de la phrase :  
</p>
<p>Le r&#233;cit s&#8217;attarde sur l'aspect &quot;flou&quot;, &quot;glauque&quot;, &quot;trouble&quot; ou &quot;diffus&quot; 
de certaines surfaces. 
</p>
<p>dans laquelle trouble est &#233;tiquet&#233; comme verbe. A ce moment-l&#224;, diffus ne fait plus partie du 
syntagme d&#8217;aspect, sa terminaison n&#8217;est pas occult&#233;e et il est possible de savoir que le mot 
qu&#8217;il qualifie est masculin. D&#8217;autres erreurs de cat&#233;gorie grammaticale peuvent produire des 
&#233;nonc&#233;s d&#233;viants. C&#8217;est le cas de &#171; Le jour de l&#8217;&#233;lection, chaque Allemand vote deux fois &#187; o&#249; 
vote est consid&#233;r&#233; comme nom et Allemand comme adjectif (le syst&#232;me demande alors 
d&#8217;accorder Allemand &#224; vote). Ces cas sont difficiles &#224; pr&#233;voir mais sont n&#233;anmoins 
marginaux. Les &#233;nonc&#233;s d&#233;viants peuvent aussi &#234;tre produits lorsqu&#8217;il y a une ambigu&#239;t&#233; 
syntaxique. C&#8217;est le cas des mots &#224; la fois nom et adjectif comme futur. Dans la phrase 
&#171; C&#8217;est un futur laur&#233;at &#187;, futur peut aussi bien &#234;tre nom qu&#8217;adjectif car le mot avec lequel il 
s&#8217;accorde, laur&#233;at, est lui aussi ambigu. S&#8217;il l&#8217;on veut exclure ces cas, la seule solution 
consiste &#224; contr&#244;ler manuellement les occurrences des mots pouvant avoir une double 
cat&#233;gorie grammaticale. 
</p>
<p>Un autre probl&#232;me concerne les cas d&#8217;anaphore dans des phrases comme 
</p>
<p>Les lampes donneraient aux automobilistes une impression de s&#233;curit&#233; 
largement illusoire, au m&#234;me titre que le syst&#232;me ABS quand il est mal 
ma&#238;tris&#233;. 
</p>
<p>ou bien le fameux accord du participe pass&#233; plac&#233; apr&#232;s le COD, qui hante nos m&#233;moires 
d&#8217;&#233;coliers, dans la phrase &#171; Tout est parti d&#8217;une interview que mon entra&#238;neur a donn&#233;e &#187;. 
Dans les deux cas, Cordial n&#8217;indique pas que ma&#238;tris&#233; et il r&#233;f&#232;rent &#224; syst&#232;me et donn&#233;e &#224; 
interview, ce qui laisse ces mots tels quels dans l&#8217;&#233;nonc&#233; et permet de d&#233;duire le genre du 
nom ant&#233;c&#233;dent. L&#224; encore, il est difficile de pr&#233;voir ces cas et de retirer ces concordances. 
Cependant, d&#8217;un point de vue didactique, il n&#8217;est pas inint&#233;ressant de voir si l&#8217;apprenant est 
capable de tirer parti de ces mots anaphoriques pour r&#233;soudre son probl&#232;me, si toutefois 
l&#8217;information pertinente n&#8217;est pas plac&#233;e juste &#224; c&#244;t&#233; de l&#8217;ant&#233;c&#233;dent. 
</p>
<p>2.3 Exercice sur les collocations 
</p>
<p>Le but de l&#8217;exercice est de compl&#233;ter une des composantes d&#8217;une collocation1 &#224; partir du 
contexte (et donc du reste de la collocation). &#201;tant donn&#233; le caract&#232;re plus libre des 
collocations par rapport &#224; d&#8217;autres unit&#233;s polylexicales comme les locutions ou les 
</p>
<p>                                                 
1  Association privil&#233;gi&#233;e de plusieurs vocables (poser une question, travailler dur, petit boulot, etc.) 
</p>
<p>189 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Selva 
</p>
<p>expressions semi-fig&#233;es, l&#8217;&#233;nonc&#233; est suivi d&#8217;une indication sous la forme d&#8217;une fonction 
lexicale (Mel&#8217;&#269;uk et al., 1995) et de son argument pour aiguiller l&#8217;apprenant vers la bonne 
solution. Pour l&#8217;instant ont &#233;t&#233; s&#233;lectionn&#233;es les fonctions Magn (intensification) et Oper et 
Func (verbe support s&#233;mantique vide), car elles sont de loin les plus r&#233;pandues et les plus 
faciles &#224; comprendre. Pour d&#8217;autres fonctions, l&#8217;&#233;nonc&#233; risquerait d&#8217;&#234;tre trop ambigu et 
rendrait difficile un diagnostic pr&#233;cis. Par exemple, question peut se combiner avec poser, qui 
est le verbe support s&#233;mantiquement vide, mais aussi avec aborder, r&#233;soudre, soulever, etc. 
qui apportent une nuance et qui sont exprim&#233;s par d&#8217;autres fonctions lexicales (Incep, Real, 
etc.) moins intuitives. Ceci n&#8217;exclut pas pour Magn et Oper les cas de synonymie et la 
possibilit&#233; de pouvoir donner plusieurs r&#233;ponses exactes (on peut tout aussi bien jouer un 
match que le disputer). Pour &#233;tablir un diagnostic ad&#233;quat, le syst&#232;me explore les 
informations consign&#233;es dans le DAFLES, et compare la r&#233;ponse de l&#8217;apprenant avec tous les 
verbes support pour le mot en question. Si elle en fait partie, elle sera accept&#233;e m&#234;me si ce 
n&#8217;est pas le verbe effectivement employ&#233; dans la phrase d&#8217;origine. 
</p>
<p> 
</p>
<p>Figure 3 : extrait de l'exercice sur les collocations 
</p>
<p>En raison de la variation des collocations (flexion des composantes, transformations 
syntaxiques), il n&#8217;est pas possible d&#8217;extraire directement les phrases o&#249; elles occurrent. Il faut 
passer par un codage interm&#233;diaire inspir&#233; de (Segond, Tapanainen, 1995) qui est ensuite 
interpr&#233;t&#233; par le programme d&#8217;extraction des phrases du corpus. Ainsi, nous avons opt&#233; pour 
un codage simple indiquant les parties fixes (pr&#233;c&#233;d&#233;es de +), variables (laiss&#233;es telles 
quelles) et optionnelles (pr&#233;c&#233;d&#233;es de :). De m&#234;me, nous indiquons quel est le mot &#224; retrouver 
(c&#8217;est-&#224;-dire soit le verbe support, soit l&#8217;intensificateur) par le symbole * : 
</p>
<p>&#8226; *gagner :ADV POSS +vie (gagner sa vie, ADV adverbe optionnel, POSS adjectif 
possessif et vie singulier) 
</p>
<p>&#8226; *jouer DET match (DET article, d&#233;monstratif, adjectif possessif, etc.) 
&#8226; *+bonne +partie +de (intensification de partie) 
</p>
<p>Bien entendu, ce codage suit l&#8217;ordre lin&#233;aire des mots dans les phrases et ne rend pas compte 
d&#8217;&#233;ventuelles transformations syntaxiques pour les collocations verbales comme les 
passivations ou les mises en relative. Ainsi, le programme ne rep&#232;rera pas poser une question 
dans &#171; la question que je me suis pos&#233;e &#187;. N&#233;anmoins, ce probl&#232;me n&#8217;est pas g&#234;nant car la 
majorit&#233; des occurrences des collocations suivent a priori l&#8217;ordre &#171; simple &#187; du codage et 
</p>
<p>190 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration automatique d&#8217;exercices contextuels de vocabulaire 
</p>
<p>nous ne cherchons pas &#224; extraire toutes les occurrences mais un nombre suffisant (une 
trentaine) pour avoir une certaine vari&#233;t&#233; dans les phrases exemples. Le probl&#232;me est plus 
ennuyeux lorsqu&#8217;il s&#8217;agit de compter les collocations (pour que l&#8217;exercice ne soit pas trop 
difficile, seules les dix1 collocations les plus fr&#233;quentes sont utilis&#233;es) car il n&#8217;est pas possible 
d&#8217;avoir un compte exact. N&#233;anmoins, on obtient un comptage relatif qui permet d&#8217;&#233;tablir une 
liste de fr&#233;quence des collocations plus ou moins exacte2. 
</p>
<p>2.4 Exercice hors contexte sur les sch&#233;mas actanciels 
</p>
<p>L&#8217;exercice consiste &#224; explorer l&#8217;axe syntagmatique et paradigmatique du lexique en 
demandant &#224; l&#8217;apprenant quels sont les actions, sujets, compl&#233;ments, etc. prototypiques d&#8217;un 
verbe donn&#233;. Il reprend en cela les sch&#233;mas actanciels pr&#233;sents dans le DAFLES. L&#8217;&#233;l&#233;ment 
innovant de cet exercice est la fonction d&#8217;aide qui appara&#238;t lorsqu&#8217;on prom&#232;ne la souris sur 
l&#8217;un des formulaires HTML et qui pose une question en langage naturel. Ainsi, dans la figure 
4, on demande &#224; l&#8217;apprenant le sujet prototypique du verbe construire (constructeur) dans le 
sens 2, r&#233;aliser un appareil.  
</p>
<p> 
</p>
<p>Figure 4 : exercice sur le sch&#233;ma actanciel de construire 
</p>
<p>Ces questions sont disponibles pour l&#8217;action et le sujet du verbe. Elle sont g&#233;n&#233;r&#233;es 
automatiquement par le syst&#232;me et exploitent la syst&#233;maticit&#233; des d&#233;finitions du DAFLES. 
Celles-ci sont sous forme de phrases dans le style r&#233;dactionnel du Collins COBUILD 
(Sinclair, 1995). Elles explicitent la construction syntaxique du verbe et ses actants, 
notamment le sujet. La question est compos&#233;e de deux parties : les compl&#233;ments du verbe, s&#8217;il 
y en a, qui sont tir&#233;s de la d&#233;finition du verbe, et son sujet, tir&#233; de la d&#233;finition de la lexie 
d&#233;crite comme sujet par les sch&#233;mas actanciels. Ainsi pour l&#8217;exemple de la figure 4, on a 
(constructeur &#233;tant d&#233;clar&#233; sujet de construire dans le DAFLES) : 
</p>
<p>construire (sens 2) : lorsqu'une personne ou une entreprise construit un appareil (une 
machine, une voiture, un avion), elle le r&#233;alise en assemblant les diff&#233;rents &#233;l&#233;ments qui le 
composent selon un plan pr&#233;&#233;tabli. 
</p>
<p>                                                 
1  Sur un petit &#233;chantillon de 200 collocations Magn et Oper extraites du DAFLES. 
2  D&#8217;apr&#232;s un comptage portant sur une dizaine de collocations, la proportion de passivations et de mises en 
</p>
<p>relative est de l&#8217;ordre de 5 &#224; 20 % suivant les cas. 
</p>
<p>191 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Selva 
</p>
<p>constructeur (sens 2) : un constructeur est une personne ou une entreprise qui r&#233;alise des 
appareils (une machine, une voiture, un avion, un ordinateur) en assemblant les diff&#233;rents 
&#233;l&#233;ments qui les composent selon un plan pr&#233;&#233;tabli. 
</p>
<p>La question est alors g&#233;n&#233;r&#233;e de la mani&#232;re suivante : 
</p>
<p>&#171; Comment appelle-t-on &#187; + [compl&#233;ment de l&#8217;actant sujet] + &#171; qui &#187; + [verbe conjugu&#233;] + 
[compl&#233;ment du verbe] ? 
</p>
<p>soit (les articles ind&#233;finis du sujet sont remplac&#233;s par les articles d&#233;finis) : 
</p>
<p>Comment appelle-t-on la personne ou l&#8217;entreprise qui construit un appareil (une machine, 
une voiture, un avion) ? 
</p>
<p>Dans ce cas pr&#233;cis, il n&#8217;est pas n&#233;cessaire de tirer l&#8217;information une personne ou une 
entreprise de l&#8217;actant sujet, &#233;tant donn&#233; qu&#8217;elle figure d&#233;j&#224; dans la d&#233;finition de construire. 
Cependant le sujet dans la d&#233;finition du verbe n&#8217;est pas toujours un hyperonyme, et il faut 
alors le chercher dans celle du sujet. Par exemple, pour la d&#233;finition d&#8217;un des sens de jouer : 
lorsqu&#8217;un musicien joue un morceau de musique, c&#8217;est la d&#233;finition de musicien qui indique 
qu&#8217;il s&#8217;agit d&#8217;une personne. 
</p>
<p>Quant aux compl&#233;ments &#224; d&#233;couvrir (colonne N2 de la figure), il est plus d&#233;licat de formuler 
des questions. Plut&#244;t que de poser une question, l&#8217;aide alors propos&#233;e est en fait la d&#233;finition 
avec le mot &#224; d&#233;couvrir masqu&#233;. 
</p>
<p>L&#8217;un des probl&#232;mes est que la r&#233;ponse au compl&#233;ment N2 se trouve parfois dans la glose 
portant sur le sujet. Ainsi dans l&#8217;exemple de la figure 4, en lisant la question pour le sujet, on 
peut ais&#233;ment savoir que ce qu&#8217;on construit est un appareil (machine peut aussi &#234;tre accept&#233; 
en exploitant l&#8217;axe paradigmatique par le biais des liens de synonymie ou d&#8217;hyper/hyponymie 
d&#233;crits dans le DAFLES). Ce cas n&#8217;est toutefois pas syst&#233;matique et l&#224; aussi, comme dans 
l&#8217;exercice sur le genre, il n&#8217;est pas inint&#233;ressant de v&#233;rifier que l&#8217;apprenant utilise 
l&#8217;information &#224; sa disposition pour r&#233;soudre l&#8217;exercice. 
</p>
<p>3 Exercices contextuels semi-automatiques 
</p>
<p>Contrairement aux pr&#233;c&#233;dents, les trois exercices suivants (d&#233;j&#224; abord&#233;s dans (Selva, Chanier, 
2000)) ne peuvent &#234;tre g&#233;n&#233;r&#233;s automatiquement car ils n&#233;cessitent une d&#233;sambigu&#239;sation 
s&#233;mantique du vocable dans les phrases de contexte. D&#232;s lors, les &#233;nonc&#233;s de base sont 
extraits du corpus manuellement &#224; l&#8217;aide d&#8217;un concordanceur et mis dans la base de donn&#233;es. 
Pour plus de vari&#233;t&#233;, chaque lexie poss&#232;de une ou plusieurs phrases exemple en fonction du 
rang de fr&#233;quence du vocable. Naturellement les m&#234;mes phrases sont utilis&#233;es dans les trois 
exercices, ce qui diminue la charge de travail d&#8217;extraction et rentabilise un peu l&#8217;op&#233;ration. 
Ces exercices mettent en jeu les synonymes, les d&#233;riv&#233;s et, de mani&#232;re classique, les 
traductions. Toutes ces informations sont consign&#233;es dans le DAFLES. Pour les synonymes et 
les d&#233;riv&#233;s, le principe est le suivant : &#224; partir d&#8217;un mot donn&#233; ou plut&#244;t d&#8217;une lexie donn&#233;e, 
s&#233;lectionn&#233;e par l&#8217;apprenant ou par l&#8217;enseignant, le syst&#232;me parcourt le dictionnaire pour en 
extraire les synonymes ou les d&#233;riv&#233;s. Ensuite, il extrait du corpus les phrases qui contiennent 
ces mots dans le sens ad&#233;quat et les affiche en enlevant les occurrences des mots de d&#233;part. 
L&#8217;apprenant doit donc replacer les synonymes ou les d&#233;riv&#233;s suivant le cas en fonction du 
</p>
<p>192 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration automatique d&#8217;exercices contextuels de vocabulaire 
</p>
<p>contexte des phrases. Pour les traductions, c&#8217;est le m&#234;me principe, sauf que les mots ne sont 
pas forc&#233;ment reli&#233;s par une relation synonymique ou d&#233;rivationnelle. Ce dernier exercice est 
plut&#244;t destin&#233; &#224; des vocables un peu &#171; isol&#233;s &#187; dans les graphes s&#233;mantiques et d&#233;rivationnels 
ou qui ne sont pas reli&#233;s les uns aux autres (pour r&#233;capituler le travail d&#8217;une session par 
exemple). 
</p>
<p> 
</p>
<p>Figure 5 : exercice sur les synonymes 
</p>
<p>4 Conclusion 
</p>
<p>L&#8217;article s&#8217;est principalement focalis&#233; sur la g&#233;n&#233;ration des &#233;nonc&#233;s, ce qui correspond en fait 
&#224; l&#8217;avancement des travaux. Pour l&#8217;instant donc, ces exercices sont essentiellement des tests 
qui ne font que v&#233;rifier la ma&#238;trise par l&#8217;apprenant des vocables en jeu et de leurs propri&#233;t&#233;s 
morphologiques, syntaxiques et s&#233;mantiques. Comme &#233;voqu&#233;e dans l&#8217;introduction, l&#8217;&#233;tape 
suivante consiste &#224; faire en sorte que le syst&#232;me puisse &#233;tablir un diagnostic &#171; &#233;volu&#233; &#187; en 
discernant des fautes de frappe ou en d&#233;tectant des r&#233;ponses approchantes (comme des 
synonymes) par exemple. Le syst&#232;me doit &#233;galement donner des &#233;l&#233;ments d&#8217;aide partiels mais 
significatifs sur la forme et le sens des mots (d&#233;finitions, partie de d&#233;finitions, concordances, 
informations rentr&#233;es dans un dictionnaire personnel, etc.) de mani&#232;re &#224; faciliter l&#8217;inf&#233;rence et 
&#224; aiguiller l&#8217;apprenant vers la bonne solution. D&#232;s lors, ces exercices ne seront plus de 
simples tests mais de v&#233;ritables activit&#233;s p&#233;dagogiques favorisant l&#8217;apprentissage lexical du 
fran&#231;ais. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>COBUILD. Sinclair J. (&#233;d.) (1995) : Collins Cobuild English Dictionary. London, Harper 
Collins. 
</p>
<p>Cordial (2002), Cordial Analyseur, version 7.0, Synapse D&#233;veloppement : 
http://www.synapse-fr.com 
</p>
<p>Didier (2002), Accord, exercices autocorrectifs, consult&#233; en f&#233;vrier 2002 : 
http://www.didieraccord.com 
</p>
<p>Jaser (2002), Chez Jaser, consult&#233; en f&#233;vrier 2002 : http://site.ifrance.com/jaser/ 
</p>
<p>193 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Selva 
</p>
<p>194 
</p>
<p>La Passerelle (2002), The Half-Baked Interactive Tests, consult&#233; en f&#233;vrier 2002 : 
http://lapasserelle.com/lm/pagespeciales/half.baked/halfbakedtests.index.html 
</p>
<p>Mel&#8217;&#269;uk I., Clas A., Polgu&#232;re A. (1995), Introduction &#224; la lexicologie explicative et 
combinatoire, Louvain-la-Neuve, Duculot. 
</p>
<p>Segond F., Tapanainen P. (1995), Using a finite-state based formalism to identify and 
generate multiword expressions, MLTT Technical Report Rank Xerox Research Center, 
http://www.xrce.xerox.com/publis/mltt/mltttech.html 
</p>
<p>Selva T., Chanier T. (2000), G&#233;n&#233;ration automatique d&#8217;activit&#233;s lexicales dans le syst&#232;me 
ALEXIA, Sciences et Techniques &#201;ducatives, Vol. 7 n&#176;2, pp. 385-411. 
</p>
<p>Selva T., Verlinde S., Binon J. (2002), Le DAFLES, un nouveau dictionnaire pour apprenants 
du fran&#231;ais, Actes du 10e congr&#232;s international EURALEX&#8217;2002 (European Association for 
Lexicography), &#224; para&#238;tre. 
</p>
<p>Verlinde S., Selva T. (2001), Corpus-based vs intuition-based lexicography: Defining a word 
list for a French learner's dictionary, Proceedings Corpus Linguistics 2001, Lancaster, pp. 
594-598. 
</p>
<p>Verlinde S., Selva T. (2002), Nomenclature de dictionnaire et analyse de corpus, Cahiers de 
Lexicologie, &#224; para&#238;tre. </p>

</div></div>
</body></html>