<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Etude des relations entre pauses et ponctuations pour la synth&#232;se de la parole &#224; partir de texte</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Etude des relations entre pauses et ponctuations 
 pour la synth&#232;se de la parole &#224; partir de texte 
</p>
<p>Estelle Campione, Jean V&#233;ronis 
</p>
<p>Equipe DELIC, Universit&#233; de Provence  
29, Avenue Robert Schuman 
</p>
<p>13621 Aix-en-Provence Cedex 1 
Estelle.Campione@up.univ-aix.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Nous pr&#233;sentons dans cette communication la premi&#232;re &#233;tude &#224; grande &#233;chelle de la relation 
entre pauses et ponctuations, &#224; l&#8217;aide de l&#8217;analyse de plusieurs milliers de pauses dans un 
corpus comportant pr&#232;s de 5 heures de parole lue en cinq langues, faisant intervenir 50 
locuteurs des deux sexes. Nos r&#233;sultats remettent en cause l&#8217;id&#233;e re&#231;ue de rapports bi-
univoques entre pauses et ponctuations. Nous mettons en &#233;vidence une proportion importante 
de pauses hors ponctuation, qui d&#233;limitent des constituants, mais aussi un pourcentage &#233;lev&#233; 
de ponctuations faibles r&#233;alis&#233;es sans pauses. Nous notons &#233;galement une tr&#232;s grande 
variabilit&#233; inter-locuteur, ainsi que des diff&#233;rences importantes entre langues. Enfin, nous 
montrons que la dur&#233;e des pauses est li&#233;e au sexe des locuteurs. 
</p>
<p>We present in this paper the first large-scale study of pause-punctuation relationships, based 
on the analysis of several thousand pauses in a corpus consisting of nearly 5 hours of read 
speech involving 50 male and female readers in five languages. Our results call into question 
the generally accepted idea of a one-to-one relationship between pauses and punctuation. We 
observe a large proportion of pauses outside punctuations (which mark phrases), but also a 
high percentage of weak punctuations with no pause. We also note a very high interspeaker 
variability, as well as important differences among languages. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
</p>
<p>Synth&#232;se de la parole &#224; partir de textes, pauses, ponctuation. 
 
Text-to-speech synthesis, pauses, punctuation. 
</p>
<p>175 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Estelle Campione, Jean V&#233;ronis 
</p>
<p>1 Introduction 
</p>
<p>La g&#233;n&#233;ration de pauses est absolument n&#233;cessaire &#224; la synth&#232;se de la parole, et le r&#233;alisme de 
leur dur&#233;e et de leur position est indispensable &#224; la qualit&#233; de la synth&#232;se r&#233;sultante. Pendant 
longtemps, les syst&#232;mes de synth&#232;se &#224; partir de texte ont pu, &#233;tant donn&#233; les qualit&#233;s 
segmentale et intonative tr&#232;s moyennes que l&#8217;&#233;tat de la technique permettait d&#8217;atteindre, se 
satisfaire d&#8217;heuristiques grossi&#232;res pour la g&#233;n&#233;ration des pauses. On a vu ainsi de nombreux 
syst&#232;mes utiliser deux niveaux de pauses, br&#232;ves et longues, les premi&#232;res &#233;tant associ&#233;es aux 
ponctuations &#171; faibles &#187; (internes aux phrases), les secondes aux ponctuations &#171; fortes &#187; (entre 
phrases). Maintenant que la qualit&#233; segmentale et intonative s&#8217;est tr&#232;s largement am&#233;lior&#233;e, 
d&#8217;autres param&#232;tres, comme les pauses (mais aussi le rythme, le d&#233;bit, l&#8217;intensit&#233;), m&#233;ritent 
une &#233;tude approfondie et des strat&#233;gies moins rustiques, permettant d&#8217;accro&#238;tre le naturel et 
l&#8217;acceptabilit&#233; des syst&#232;mes. Bien s&#251;r, d&#8217;autres informations que la simple ponctuation, et en 
particulier l&#8217;analyse syntaxique, sont utiles pour la g&#233;n&#233;ration des pauses, mais, dans l&#8217;&#233;tat 
actuel de la technique, l&#8217;analyse syntaxique est co&#251;teuse et peu fiable. Les ponctuations 
(d&#8217;ailleurs partiellement corr&#233;l&#233;es aux structures syntaxiques) restent donc des indices 
pr&#233;cieux pour la synth&#232;se de la parole &#224; partir de texte,  &#224; condition d&#8217;en conna&#238;tre mieux le 
fonctionnement lors de la lecture. 
</p>
<p>Or, si les &#233;tudes sur les pauses sont nombreuses (Grosjean &amp; Deschamps, 1972, 1973, 1975 ; 
Duez, 1991 ; Cand&#233;a, 2000 ; etc. &#8212; pour une revue &#233;tendue, voir Zellner, 1994), on dispose 
de tr&#232;s peu de donn&#233;es empiriques sur les pauses dans la parole lue et leur relation avec les 
ponctuations. On ne dispose gu&#232;re par exemple pour le fran&#231;ais que de l&#8217;&#233;tude faite par 
Vannier (1999), dans laquelle on peut constater qu&#8217;il ne renvoie lui-m&#234;me &#224; aucune &#233;tude 
ant&#233;rieure. La question se complique encore dans un cadre de la synth&#232;se multilingue, le peu 
de donn&#233;es dont on dispose (comme d&#8217;ailleurs l&#8217;ensemble des &#233;tudes sur les pauses en 
g&#233;n&#233;ral) &#233;tant difficile &#224; comparer entre les langues (diff&#233;rences de m&#233;thodologie, de types de 
parole, de techniques d&#8217;analyses, etc.). Ainsi, Vannier (1999) trouve (sur le fran&#231;ais) que 64% 
des pauses correspondent &#224; une ponctuation, alors que O&#8217;Connell &amp; Kowal (1983) affirment 
(&#224; propos de l&#8217;allemand) que ce sont 91% des pauses qui correspondent &#224; une ponctuation. 
Ces diff&#233;rences proviennent-elles de la langue, ou bien des locuteurs particuliers1, du type de 
texte et de lecture2, ou bien encore de la m&#233;thodologie d&#8217;analyse3 ? 
</p>
<p>Nous proposons dans cette communication une &#233;tude &#224; grande &#233;chelle, portant sur l&#8217;analyse 
de plusieurs milliers de pauses dans pr&#232;s de 5 heures de parole lue en cinq langues et faisant 
intervenir 50 locuteurs des deux sexes. Les donn&#233;es que nous publions permettent d&#8217;avoir 
pour la premi&#232;re fois une image pr&#233;cise de la relation entre pauses et ponctuations, qui 
bouscule d&#8217;ailleurs quelque peu les id&#233;es re&#231;ues, ainsi qu&#8217;un point de vue contrastif sur les 
diff&#233;rences de fonctionnement entre langues.  
</p>
<p>                                                 
1  L&#8217;&#233;tude de O&#8217;Connell &amp; Kowal fait intervenir quatre locuteurs, celle de Vannier un seul. 
</p>
<p>2  Les corpus sont tr&#232;s diff&#233;rents (sermons radiophoniques pour O&#8217;Connell &amp; Kowal, lecture du Monde pour 
Vannier). 
</p>
<p>3  Voir par exemple la question des seuils ci-apr&#232;s. 
</p>
<p>176 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude des relations entre pauses et ponctuations pour la synth&#232;se de la parole 
</p>
<p>2 Corpus 
</p>
<p>Le corpus que nous avons utilis&#233; est le &#171; Few Talker Set &#187; de la base de donn&#233;es EUROM1 
produite dans le cadre du projet Esprit SAM (Chan et al., 1995), totalisant 4h et demie de 
parole. Ce corpus est constitu&#233; de passages de cinq phrases chacun, lus dans diff&#233;rentes 
langues, parmi lesquelles nous avons s&#233;lectionn&#233; pour cette &#233;tude l&#8217;allemand, l&#8217;anglais, 
l&#8217;espagnol, le fran&#231;ais et l&#8217;italien. Les passages dans les diff&#233;rentes langues sont la traduction 
de la version originale anglaise. Cette traduction a &#233;t&#233; r&#233;alis&#233;e de fa&#231;on libre, puisqu'elle 
devait refl&#233;ter non seulement une bonne adaptation de la version anglaise dans la langue de 
destination, mais aussi la culture propre &#224; celle-ci  (Figure 1). 
</p>
<p>Anglais 
I have a problem with my water softener. The water-level is too high and the overflow keeps dripping. Could 
you arrange to send an engineer on Tuesday morning please? It's the only day I can manage this week. I'd be 
grateful if you could confirm the arrangement in writing.  
</p>
<p>Allemand 
Ich habe da ein Problem mit meinem Boiler. Das &#220;berdruckventil tropft st&#228;ndig, weil der Wasserstand wohl zu 
hoch ist. K&#246;nnten sie mir bitte Dienstag fr&#252;h einen Klempner schicken? Das ist leider der einzige Tag in dieser 
Woche, an dem ich Zeit habe. Ich w&#228;re ihnen dankbar, wenn sie mir den Termin schriftlich best&#228;tigen w&#252;rden. 
</p>
<p>Espagnol 
Tengo un problema con mi descalcificador. El nivel de agua es demasiado alto y el rebosadero gotea 
constantemente. &#191;Por favor, podr&#237;a enviarme un t&#233;cnico el martes por la tarde? Es el &#250;nico d&#237;a que me va bien 
esta semana. &#191;Me podr&#237;an llamar por tel&#233;fono antes de venir? 
</p>
<p>Fran&#231;ais 
J'ai des probl&#232;mes avec mon adoucisseur d'eau : le niveau d'eau est toujours trop haut, ce qui fait que le trop-
plein coule sans arr&#234;t. Vous pourriez pas m'envoyer un r&#233;parateur mardi matin ? C'est le seul jour de la semaine 
que j'ai de libre. Si vous &#234;tes d'accord, soyez gentil de me confirmer le rendez-vous par &#233;crit.  
</p>
<p>Italien 
Il mio depuratore dell'acqua non funziona. Il livello dell'acqua &#232; troppo alto e l'acqua comincia a traboccare. 
Pu&#242; mandarmi un idraulico marted&#236; mattina per favore? &#200; l'unico giorno della settimana possibile per me. Pu&#242; 
mandarmi una risposta scritta? Grazie. 
</p>
<p>Figure 1. Exemple de passage du corpus 
</p>
<p>Chaque passage a &#233;t&#233; lu par plusieurs locuteurs, 50 au total (25 hommes et 25 femmes). Les 
enregistrements sont de haute qualit&#233; acoustique (vitesse d&#8217;&#233;chantillonnage de 20 KHz, 
&#233;chantillonnage &#224; 16 bits, enregistrement en chambre an&#233;cho&#239;que). Les lecteurs avaient pour 
instruction de lire les passages de la fa&#231;on la plus naturelle possible, et le mat&#233;riel enregistr&#233; a 
&#233;t&#233; contr&#244;l&#233; durant les acquisitions afin que les acquisitions de mauvaise qualit&#233; (bruit, ou 
phrases mal lues) soient directement annul&#233;es et r&#233;p&#233;t&#233;es. 
</p>
<p>Nous avons marqu&#233; manuellement la totalit&#233; des pauses du corpus. Contrairement &#224; la plupart 
des &#233;tudes sur les pauses (Grosjean &amp; Deschamps, 1972, 1973, 1975 ; Duez, 1991 ; Cand&#233;a, 
2000 ; etc.), aucun seuil, ni inf&#233;rieur, ni sup&#233;rieur, n&#8217;a &#233;t&#233; retenu, et toutes les pauses ont &#233;t&#233; 
comptabilis&#233;es et mesur&#233;es, quelle que soit leur dur&#233;e4. En effet, nous avons montr&#233; ailleurs 
que l&#8217;utilisation de seuils peut avoir des effets dramatiques sur les r&#233;sultats, conduisant &#224; des 
conclusions parfois strictement inverses &#224; la r&#233;alit&#233; (Campione &amp; V&#233;ronis, 2002). On voit par 
exemple sur la Figure 2 que le nombre de pauses tr&#232;s br&#232;ves (&lt; 200 ms) est important (jusqu&#8217;&#224; 
17,9% en italien), et que les n&#233;gliger ne serait pas sans cons&#233;quences. 
</p>
<p>                                                 
4  Chaque pause a &#233;t&#233; minutieusement v&#233;rifi&#233;e auditivement pour &#233;viter des confusions avec les occlusives. 
</p>
<p>177 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Estelle Campione, Jean V&#233;ronis 
</p>
<p> 
</p>
<p>Langue  (%) 
en 3,9 
fr 11,3 
ge 4,8 
it 17,9 
sp 2,9 
Total 8,2  
</p>
<p>Ponct. Proportion 
. 3128
? 440
! 78
... 2
</p>
<p>Total 3648 
</p>
<p>Ponct. Proportio
n 
</p>
<p>, 1820
: 105
; 23
( 6
) 6
</p>
<p>Total 1960 
Figure 2. Pauses &lt; 200 ms Figure 3. Ponctuations fortes Figure 4. Ponctuations faibles 
</p>
<p> 
</p>
<p>La Figure 3 et la Figure 4 donnent la r&#233;partition des types de ponctuations dans le corpus. 
</p>
<p>3 Position des pauses 
</p>
<p>3.1 Pauses hors ponctuation 
</p>
<p>On note une proportion assez importante de pauses hors ponctuations, de l&#8217;ordre de 15,7% en 
moyenne sur l&#8217;ensemble des cinq langues, avec une variabilit&#233; importante entre celles-ci, 
puisque la proportion varie entre 7,5% pour l&#8217;anglais et 33,7% pour l&#8217;italien (Figure 5). S&#8217;il 
est &#224; peu pr&#232;s du m&#234;me ordre que celui publi&#233; par O&#8217;Connell &amp; Kowal (1983) pour 
l&#8217;allemand (9%), ce chiffre est tr&#232;s inf&#233;rieur &#224; celui donn&#233; par Vannier (1999) pour le fran&#231;ais 
(36%).  
</p>
<p>Langue Absence de 
ponct. 
</p>
<p>en 6,4 
fr 11,9 
ge 11,0 
it 33,7 
sp 14,0 
Moyenne 15,4 
</p>
<p>Figure 5. Pauses hors ponctuation (%) 
</p>
<p>La Figure 6 montre un exemple de passage en italien, o&#249; les pauses hors ponctuations sont 
particuli&#232;rement nombreuses. Celles-ci marquent, comme l&#8217;on peut s&#8217;y attendre, des ruptures 
syntaxiques importantes, mais on voit qu&#8217;elles sont &#224; peu pr&#232;s toutes facultatives. 
</p>
<p>178 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude des relations entre pauses et ponctuations pour la synth&#232;se de la parole 
</p>
<p> 
Texte Locuteur 
 ba bf bl au 
Mia sorella (+) (+)  (+) 
e terrorizzata dal buio (+) (+) (+) (+) 
e rifiuta (+)    
assolutamente (+)    
di uscire sola (+)    
la notte . + + + + 
Vuole sempre qualcuno con se . +  + + 
Mio padre (+) (+)   
l'ha consigliata (+)    
di portare il cane (+) (+) (+) (+) 
che almeno  (+)   
la proteggerebbe abbaiando (+)    
se qualcuno la molestasse . + + + + 
</p>
<p>Figure 6. Pauses hors ponctuations (+) 
</p>
<p>Les diff&#233;rences entre langues ne peuvent &#234;tre expliqu&#233;es par des diff&#233;rences de densit&#233;s de 
ponctuations dans les textes. En effet, la Figure 7 montre que le pourcentage de ponctuations 
par mots est &#224; peu pr&#232;s constant entre les langues et de l&#8217;ordre de 13,5 %. Ceci ne peut donc 
rendre compte de la forte tendance de l&#8217;italien &#224; placer des pauses hors ponctuation, et de la 
tendance moindre de l&#8217;anglais. 
</p>
<p>Langue Total R&#233;partition 
  Faibles Fortes 
en 12,5 28,4 71,6 
fr 13,8 50,6 49,4 
ge 14,5 36,7 63,3 
it 13,0 20,2 79,8 
sp 13,6 36,6 63,4 
Moyenne 13,5 34,5 65,5 
</p>
<p>Figure 7. Nombre de ponctuations par mot (%) 
</p>
<p>On peut &#233;galement constater sur la Figure 6 que la variabilit&#233; inter-locuteur est grande, allant 
d&#8217;un style tr&#232;s scand&#233; (locuteur ba) &#224; un style tr&#232;s li&#233; (locuteur bl). Cette variabilit&#233; est 
r&#233;sum&#233;e par la Figure 8. On voit que l&#8217;italien se distingue des autres langues par une tr&#232;s 
grande variabilit&#233; inter-locuteurs, certains locuteurs allant jusqu&#8217;&#224; placer 2/3 des pauses hors 
ponctuation. Pour le fran&#231;ais, le chiffre de 36% donn&#233; par Vannier (1999) est tr&#232;s largement 
hors de l&#8217;intervalle de variation que nous observons (le maximum parmi nos locuteurs est de 
16% ; le chiffre de Vannier se situe &#224; 6,28 &#233;carts-types de notre moyenne). Il se pourrait donc 
que le locuteur (unique) choisi par Vannier soit totalement atypique ou bien que le style de 
lecture soit totalement diff&#233;rent. 
</p>
<p> 
</p>
<p>179 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Estelle Campione, Jean V&#233;ronis 
</p>
<p>Max
Min
Moy.+Ec.Type
Moy.-Ec.Type
Moy.
</p>
<p>Pauses sans ponctuation
</p>
<p>LANGUE
</p>
<p>PS
PC
</p>
<p>T
</p>
<p>0,0
</p>
<p>0,2
</p>
<p>0,4
</p>
<p>0,6
</p>
<p>0,8
</p>
<p>1,0
</p>
<p>en fr ge it sp
</p>
<p> 
</p>
<p>Figure 8. Pauses hors ponctuation : variabilit&#233; inter-locuteur 
</p>
<p>3.2 Ponctuations sans pauses 
</p>
<p>Inversement, de nombreuses ponctuations n&#8217;ont pas &#233;t&#233; r&#233;alis&#233;es avec une pause. En ce qui 
concerne les ponctuations fortes, ce ph&#233;nom&#232;ne est marginal. Absent en fran&#231;ais et en 
espagnol, il concerne seulement quelques cas dans les autres langues (Figure 9).  
</p>
<p>Langue Faible Forte Total 
en 56,7 1,9 20,1 
fr 33,1 0,0 18,7 
ge 55,1 2,4 24,6 
it 38,9 2,7 11,5 
sp 46,4 0,0 19,6 
Moyenne 46,0 1,6 19,0 
</p>
<p>Figure 9. Ponctuations sans pause (%)5 
</p>
<p>On observe des situations o&#249; les locuteurs ont encha&#238;n&#233; des phrases longues sans pause 
comme dans l&#8217;exemple ci-dessous, o&#249; un segment de plus de 9 secondes est prononc&#233; sans 
aucune pause (le signe &#248; marque l&#8217;absence de pause) : 
</p>
<p>Schicken sie so schnell wie m&#246;glich einen krankenwagen in die gro&#223;garage in der hopfengasse. &#248; 
Ein alter mann ist auf dem eis ausgerutscht, &#248; hat sich das bein gebrochen und kann nicht bewegt 
werden . 
</p>
<p>Ce type de prononciation n&#8217;est pas n&#233;cessairement un mod&#232;le &#224; reproduire en synth&#232;se, et est 
g&#233;n&#233;ralement contredit par les r&#233;alisations d&#8217;autres locuteurs sur le m&#234;me passage.  
</p>
<p>En ce qui concerne les ponctuations faibles, la proportion de r&#233;alisations sans pause est 
presque de moiti&#233; (46,0%) ; elle atteint 56,7% en anglais. Ces cas concernent &#224; peu pr&#232;s 
exclusivement les virgules (949 sur 962). Les d&#233;marcations prosodiques sont alors marqu&#233;es 
par les mouvements m&#233;lodiques seuls : 
</p>
<p>                                                 
5  Nous n&#8217;avons pas inclus les ponctuations finales des diff&#233;rents passages dans ce d&#233;compte. 
</p>
<p>180 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude des relations entre pauses et ponctuations pour la synth&#232;se de la parole 
</p>
<p>She has a series of meetings, &#248; 9am to 5pm, &#248; in Paris, &#248; Bruges, &#248; Frankfurt, &#248; Rome, &#248; and 
Hamburg on consecutive days. 
Quiere pon&#233;rselas todas de una vez , &#248; el mismo d&#237;a. 
Avec ce que je gagne, &#248; je peux tout juste me payer une paire de chaussures neuves. 
</p>
<p>Des &#233;tudes plus approfondies seront n&#233;cessaires pour d&#233;terminer dans quelles circonstances 
syntaxiques il est pr&#233;f&#233;rable d&#8217;omettre les pauses correspondant aux ponctuations faibles, 
mais il est certain que leur r&#233;alisation par des pauses syst&#233;matiques aboutit &#224; une sensation de 
parole hach&#233;e, trop scand&#233;e par rapport &#224; la parole naturelle. 
</p>
<p>A nouveau, on observe une forte variabilit&#233; inter-locuteurs (Figure 10). Pour Vannier, 4,6 % 
des ponctuations (faibles et fortes confondues) ne donnent pas lieu &#224; des pauses en fran&#231;ais. 
Ce chiffre est beaucoup moins &#233;lev&#233; que notre moyenne (19,0 %) et en dessous du minimum 
pour nos locuteurs fran&#231;ais (6,4%). L&#8217;&#233;cart entre le chiffre de Vannier est toutefois seulement 
de 1,44 &#233;cart-types, ce qui est nettement moins important que dans le cas pr&#233;c&#233;dent. 
</p>
<p>Max
Min
Moy.+Ec.Type
Moy.-Ec.Type
Moy.
</p>
<p>Ponctuations faibles sans pause
</p>
<p>LANG
</p>
<p>PF
_S
</p>
<p>_P
SE
</p>
<p>0,0
</p>
<p>0,2
</p>
<p>0,4
</p>
<p>0,6
</p>
<p>0,8
</p>
<p>1,0
</p>
<p>en fr ge it sp
</p>
<p> 
</p>
<p>Figure 10. Ponctuations faibles sans pause : variabilit&#233; inter-locuteur 
</p>
<p>3.3 Dur&#233;es 
</p>
<p>La distribution des dur&#233;es de pause est fortement asym&#233;trique, d&#8217;allure log-normale (Figure 
11), comme il appara&#238;t dans toutes les &#233;tudes sur les pauses. L&#8217;utilisation de la moyenne et de 
l&#8217;&#233;cart-type sur les donn&#233;es non transform&#233;es peut donner une repr&#233;sentation biais&#233;e des 
donn&#233;es, et surtout rendre erron&#233;e l&#8217;application de tests comme l&#8217;analyse de variance, qui 
reposent sur des hypoth&#232;ses de normalit&#233; et d&#8217;homog&#233;n&#233;it&#233; des variances. Nous travaillons 
donc sur les logarithmes des dur&#233;es, ou, ce qui revient au m&#234;me, nous en exploitons les 
moyennes g&#233;om&#233;triques et non arithm&#233;tiques. 
</p>
<p>181 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Estelle Campione, Jean V&#233;ronis 
</p>
<p>Distribution des dur&#233;es de pauses (EUROM)
 y = 4614 * 61,56666 * lognorm (x; 6,136544; 0,536548)
</p>
<p>DUREE
</p>
<p>N
om
</p>
<p>br
e 
</p>
<p>d'
O
</p>
<p>bs
 
</p>
<p>0
37
74
</p>
<p>111
148
185
222
259
296
333
370
407
444
481
518
555
</p>
<p>0 500 1000 1500 2000
</p>
<p> 
</p>
<p>Figure 11. Distribution des dur&#233;es de pause 
</p>
<p>L&#8217;analyse de variance sur les trois facteurs langue, sexe et type de pause r&#233;v&#232;le que la dur&#233;e 
(logarithmique) des pauses d&#233;pend significativement de la langue6, mais aussi qu&#8217;elle d&#233;pend 
fortement du type de ponctuation o&#249; elles interviennent [ F(2, 4420)=1154,56; p&lt;10-4 ]. En 
l&#8217;absence de ponctuation, la moyenne (g&#233;om&#233;trique) des pauses se situe &#224; 289 ms. Elle passe 
&#224; 336 ms pour les ponctuations faibles et &#224; 598 ms pour les ponctuations fortes (Figure 13).  
</p>
<p>Trac&#233; de Moy. (non pond.)
LANG Effet Princ.
</p>
<p>F(4,4420)=40,50; p&lt;0,000
</p>
<p>LANGUE
</p>
<p>LO
G
</p>
<p>D
U
</p>
<p>R
EE
</p>
<p>2,52
</p>
<p>2,54
</p>
<p>2,56
</p>
<p>2,58
</p>
<p>2,60
</p>
<p>2,62
</p>
<p>2,64
</p>
<p>2,66
</p>
<p>2,68
</p>
<p>en fr ge it sp
</p>
<p> 
</p>
<p>Figure 12. Dur&#233;e moyenne des pauses en fonction de la langue 
</p>
<p>Ponctuation log10 ms ms 
(moy. g&#233;o)
</p>
<p>aucune 2,46 289 
faible 2,53 336 
forte 2,78 598 
</p>
<p>Figure 13. Dur&#233;e moyenne des pauses en fonction de  la ponctuation associ&#233;e 
</p>
<p>                                                 
6  Cet effet peut &#234;tre mis en relation avec des diff&#233;rences de d&#233;bit dans chaque langue (Campione, 2001). 
</p>
<p>182 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude des relations entre pauses et ponctuations pour la synth&#232;se de la parole 
</p>
<p>L&#8217;&#233;tude des interactions montre que les femmes et les hommes s&#8217;opposent de fa&#231;on 
significative  [ F(2, 803)= 247,06; p&lt;10-4 ]. Si les dur&#233;es de pauses sont quasiment identiques 
pour les hommes et les femmes en pr&#233;sence de ponctuations fortes, les comparaisons post-hoc 
(test HSD de Tukey) montrent des diff&#233;rences tr&#232;s significatives (p&lt;10-4)  pour les dur&#233;es de 
pauses en l&#8217;absence de ponctuation et en pr&#233;sence de ponctuation faible (Figure 14). Des 
&#233;tudes ult&#233;rieures seront n&#233;cessaires pour comprendre cet effet. Une hypoth&#232;se (&#224; manier avec 
pr&#233;caution) pourrait tenir &#224; des raisons physiologiques (volume respiratoire) pouvant amener 
&#224; une organisation diff&#233;rente des prises de souffle. En tous cas, cette diff&#233;rence pourrait &#234;tre 
prise en compte dans la mod&#233;lisation de locuteurs de sexes diff&#233;rents dans la synth&#232;se de la 
parole. 
</p>
<p>200
</p>
<p>250
</p>
<p>300
</p>
<p>350
</p>
<p>400
</p>
<p>450
</p>
<p>500
</p>
<p>550
</p>
<p>600
</p>
<p>aucune faible forte
TYPE PONCTUATION
</p>
<p>D
U
</p>
<p>R
E
</p>
<p>E
 (m
</p>
<p>s)
</p>
<p>Femmes
Hommes
Tous
</p>
<p> 
</p>
<p>Figure 14. Dur&#233;e des pauses en fonction du type de ponctuation 
</p>
<p>Les dur&#233;es de pauses annonc&#233;es par Vannier (1999) sont plus &#233;lev&#233;es que celles que nous 
trouvons, puisque Vannier situe les dur&#233;es moyennes (arithm&#233;tiques) &#224; environ 450 ms pour 
les ponctuations faibles et 1600 ms pour les ponctuations fortes, alors que celles que nous 
observons sont respectivement de 391 ms et 708 ms7. Si le chiffre de Vannier se situe pour les 
ponctuations faibles dans l&#8217;intervalle de variation de nos locuteurs fran&#231;ais (258 &#8211; 569 ms), il 
se situe largement au-del&#224; pour les ponctuations fortes (567 &#8211; 1028 ms). Les textes de 
Vannier sont plus longs (500 mots), et il suffirait de quelques pauses tr&#232;s longues &#224; des 
ruptures de paragraphes pour expliquer les dur&#233;es moyennes plus &#233;lev&#233;es pour les 
ponctuations fortes. Nous n&#8217;avons pas le d&#233;tail de la distribution des pauses qu&#8217;il observe. 
</p>
<p>4 Conclusion 
</p>
<p>Nous pr&#233;sentons dans cette communication la premi&#232;re &#233;tude &#224; grande &#233;chelle de la relation 
entre pauses et ponctuations, &#224; l&#8217;aide de l&#8217;analyse de plusieurs milliers de pauses dans un 
corpus multilingue comportant pr&#232;s de 5 heures de parole lue en cinq langues faisant 
intervenir 50 locuteurs des deux sexes. Nos r&#233;sultats remettent en cause l&#8217;id&#233;e re&#231;ue de 
rapports bi-univoques entre pauses et ponctuations. Nous mettons en &#233;vidence une proportion 
</p>
<p>                                                 
7  Nous avons ici calcul&#233; des moyennes arithm&#233;tiques pour rendre les chiffres comparables avec ceux de 
</p>
<p>Vannier. 
</p>
<p>183 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Estelle Campione, Jean V&#233;ronis 
</p>
<p>184 
</p>
<p>importante de pauses hors ponctuation, qui d&#233;limitent des constituants, mais aussi un 
pourcentage &#233;lev&#233; de ponctuations faibles r&#233;alis&#233;es sans pauses. Nous notons &#233;galement une 
tr&#232;s grande variabilit&#233; inter-locuteurs, ainsi que des diff&#233;rences importantes entre langues. 
Enfin, nous montrons que la dur&#233;e des pauses est li&#233;e au sexe des locuteurs. Ces constatations 
pourront &#234;tre utilis&#233;es pour am&#233;liorer la variabilit&#233; et le naturel des syst&#232;mes de synth&#232;se de la 
parole &#224; partir de texte. Il va de soi que cette &#233;tude devra &#234;tre compl&#233;t&#233;e par d&#8217;autres, et en 
particulier par un examen syst&#233;matique des positions syntaxiques dans les diff&#233;rentes langues. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Campione E., V&#233;ronis J. (2002), A large-scale multilingual study of silent pause duration, 
Actes de Speech Prosody 2002, Aix-en-Provence [&#224; para&#238;tre]. 
</p>
<p>Campione E. (2001), &#201;tiquetage automatique de la prosodie dans les corpus oraux : 
algorithmes et m&#233;thodologie, Th&#232;se de l&#8217;Universit&#233; de Provence, Aix-en-Provence. 
</p>
<p>Cand&#233;a M. (2000). Contribution &#224; l'&#233;tude des pauses silencieuses et des ph&#233;nom&#232;nes dits 
&#171; d'h&#233;sitation &#187; en fran&#231;ais oral spontan&#233;, Th&#232;se de l&#8217;Universit&#233; Paris III, Paris. 
</p>
<p>Chan D., Fourcin A., Gibbon D., Granstr&#246;m B., Huckvale M., Kokkinakis G., Kvale K., 
Lamel L., Lindberg B., Moreno A., Mouropoulos J., Senia F., Trancoso I., Veld C., Zeiliger J. 
(1995), Eurom - A Spoken Language Resource for the EU, Proceedings of the 4th European 
Conference on Speech Communication and Speech Technology (Eurospeech'95), 867-870. 
</p>
<p>Duez D. (1991), La pause dans la parole de l'homme politique, Paris, Editions du Centre 
National de la Recherche Scientifique. 
</p>
<p>Grosjean F., Deschamps A. (1972), Analyse des variables temporelles du fran&#231;ais spontan&#233;, 
Phonetica, vol. 26, pp. 130-156. 
</p>
<p>Grosjean F., Deschamps A. (1973), Analyse des variables temporelles du fran&#231;ais spontan&#233;, 
Phonetica, vol. 28, pp. 191-226. 
</p>
<p>Grosjean F., Deschamps A. (1975), Analyse contrastive des variables temporelles de l'anglais 
et du fran&#231;ais, Phonetica, vol. 31, pp. 144-184. 
</p>
<p>O'Connell D. C., Kowal, S. H. (1986), Use of punctuation for pausing: oral readings by 
german radio homilists, Psychological Research, vol. 48, pp. 93-98. 
</p>
<p>Vannier G. (1999), &#201;tude des contributions des structures textuelles et syntaxiques pour la 
prosodie : application &#224; un syst&#232;me de synth&#232;se vocale &#224; partir de texte, Th&#232;se de l&#8217;Universit&#233; 
de Caen/Basse-Normandie, Caen. 
</p>
<p>Zellner B. (1994), Pauses and the temporal structure of speech, In E. Keller (Ed.), 
Fundamentals of speech synthesis and speech recognition (pp. 41-62), Chichester: John 
Wiley. </p>

</div></div>
</body></html>