<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Accentuation de mots inconnus : application au thesaurus biom&#233;dical MeSH</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Accentuation de mots inconnus : application au thesaurus
biom&#233;dical MeSH&#0;
</p>
<p>Pierre Zweigenbaum, Natalia Grabar
DIAM &#8212; STIM/DSI, Assistance Publique &#8211; H&#244;pitaux de Paris
</p>
<p>&amp; D&#233;partement de Biomath&#233;matiques, Universit&#233; Paris 6
&#0;pz,ngr&#1;@biomath.jussieu.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>R&#233;accentuation, mots inconnus, &#233;tiquetage, langue de sp&#233;cialit&#233;, m&#233;decine
Reaccenting, unknown words, tagging, specialized language, medicine
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Certaines ressources textuelles ou terminologiques sont &#233;crites sans signes diacritiques, ce qui
freine leur utilisation pour le traitement automatique des langues. Dans un domaine sp&#233;cialis&#233;
comme la m&#233;decine, il est fr&#233;quent que les mots rencontr&#233;s ne se trouvent pas dans les lexiques
&#233;lectroniques disponibles. Se pose alors la question de l&#8217;accentuation de mots inconnus : c&#8217;est
le sujet de ce travail.
Nous proposons deux m&#233;thodes d&#8217;accentuation de mots inconnus fond&#233;es sur un apprentissage
par observation des contextes d&#8217;occurrence des lettres &#224; accentuer dans un ensemble de mots
d&#8217;entra&#238;nement, l&#8217;une adapt&#233;e de l&#8217;&#233;tiquetage morphosyntaxique, l&#8217;autre adapt&#233;e d&#8217;une m&#233;thode
d&#8217;apprentissage de r&#232;gles morphologiques. Nous pr&#233;sentons des r&#233;sultats exp&#233;rimentaux pour
la lettre e sur un thesaurus biom&#233;dical en fran&#231;ais : le MeSH. Ces m&#233;thodes obtiennent une
pr&#233;cision de 86 &#224; 96 % (&#1;4 %) pour un rappel allant de 72 &#224; 86 %.
Some textual or terminological resources are written without diacritic marks, which hinders
their use for natural language processing. Moreover, in a specialized domain such as medicine,
all words are not always found in the available lexicons. The issue of accenting unknown words
then arises. This is the subject of the present work.
We propose two accentuation methods which both rely on a learning process, based on the ob-
servation of the contexts of occurrence of the accentuable letters in a training corpus. One is
adapted from a part-of-speech tagging method, the other from a method for learning morpho-
logical rules. We present experimental results for letter e on a French biomedical thesaurus: the
MeSH. These methods obtain a precision which ranges from 86 to 96% (&#1;4 %) and a recall
from 72 to 86%.
</p>
<p>&#0;Ce travail prolonge une premi&#232;re exp&#233;rience pr&#233;sent&#233;e au workshop &#171; NLP in Biomedical Applications &#187;.
</p>
<p>53</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Natalia Grabar
</p>
<p>1 Introduction
</p>
<p>De nombreuses langues emploient l&#8217;alphabet dit latin avec des signes diacritiques : le fran&#231;ais
emploie ainsi quatre e accentu&#233;s (&#233;&#232;&#234;&#235;) en plus de la forme non accentu&#233;e e. La prise en
compte correcte de ces lettres accentu&#233;es au-del&#224; de l&#8217;ASCII am&#233;ricain n&#8217;a pas &#233;t&#233; imm&#233;di-
ate et g&#233;n&#233;rale. De nos jours, une panoplie d&#8217;encodages de caract&#232;res appropri&#233;s sont en usage
quasi-universel, comme la famille ISO-latin ou Unicode. Cependant, certains textes et certaines
ressources terminologiques sont encore, pour des raisons historiques, &#233;crits en &#171; typographie
pauvre &#187;. Par exemple, la version fran&#231;aise du thesaurus MeSH (Medical Subject Headings,
(INSERM, 2000), quelque 29 000 termes), est &#233;crite en majuscules non accentu&#233;es1. C&#8217;est une
source de difficult&#233; lorsque l&#8217;on veut utiliser ces termes dans des interfaces en langue naturelle
ou pour l&#8217;indexation automatique de documents textuels: un mot non accentu&#233; peut correspon-
dre &#224; plusieurs mots, produisant des ambigu&#239;t&#233;s artificielles comme cote (c&#244;te, c&#244;t&#233;, cote).
Une fa&#231;on simple de traiter ce probl&#232;me est de supprimer tous les accents de toutes les inter-
faces... Cela simplifie l&#8217;appariement, mais accro&#238;t l&#8217;ambigu&#239;t&#233;, dont les syst&#232;mes de traitement
automatique des langues ont d&#233;j&#224; leur content. L&#8217;un de nos objectifs, par ailleurs, est de con-
struire des ressources langagi&#232;res (lexiques, bases de connaissances morphologiques, etc.) pour
le domaine m&#233;dical (Zweigenbaum, 2001) et d&#8217;acqu&#233;rir des connaissances linguistiques &#224; partir
de terminologies et de corpus, dont le MeSH (Grabar &amp; Zweigenbaum, 1999). Meilleure est la
qualit&#233; des donn&#233;es source, meilleures seront les chances d&#8217;apprendre des mod&#232;les de donn&#233;es
linguistiques pertinents. Tous ces points militent en faveur de sources accentu&#233;es.
</p>
<p>Nous avons donc entrepris de produire une version accentu&#233;e du MeSH fran&#231;ais. Ce thesaurus
comprend 19 971 termes et 9 151 synonymes, avec 21 475 formes de mots diff&#233;rentes. Sa
r&#233;accentuation manuelle compl&#232;te n&#8217;est donc pas une petite t&#226;che. Il serait bien s&#251;r pr&#233;f&#233;rable
de disposer d&#8217;une m&#233;thode qui g&#233;n&#232;re automatiquement une forme accentu&#233;e de chaque mot,
de l&#8217;appliquer au MeSH et de valider ses r&#233;sultats. Une fois une telle m&#233;thode applicable, elle
pourrait de plus s&#8217;appliquer &#224; d&#8217;autres textes et terminologies. Et de fait, l&#8217;exp&#233;rience de la
pr&#233;paration de corpus &#233;tiquet&#233;s ou arbor&#233;s montre qu&#8217;il est g&#233;n&#233;ralement plus efficace pour
quelqu&#8217;un de corriger une premi&#232;re annotation que d&#8217;en produire une &#224; partir de z&#233;ro. Une
accentuation de termes techniques effectu&#233;e directement &#224; la main est par ailleurs quelquefois
irr&#233;guli&#232;re, et ce type de m&#233;thode assist&#233;e peut aider &#224; obtenir une accentuation plus stable.
</p>
<p>L&#8217;&#233;quipe CISMeF du CHU de Rouen a d&#233;j&#224; accentu&#233; plus de 5 500 termes MeSH, qui sont util-
is&#233;s dans le catalogue CISMeF des sites m&#233;dicaux francophones (Darmoni et al., 2000) (www.
chu-rouen.fr/cismef). D&#8217;une part, une quantit&#233; moindre de termes a besoin d&#8217;&#234;tre ac-
centu&#233;e. Cela produit d&#8217;autre part une base d&#8217;entra&#238;nement pour une proc&#233;dure d&#8217;apprentissage.
En fait, en commen&#231;ant &#224; accentuer manuellement des mots du MeSH, nous avons pu v&#233;rifier
que des r&#233;gularit&#233;s d&#8217;accentuation de certaines parties de mots se retrouvaient dans un certain
nombre de cas &#8211; par exemple, reac se r&#233;accentue en r&#233;ac dans r&#233;accentuation ou r&#233;action.
Cela nous a encourag&#233;s &#224; regarder plus loin dans cette direction, et &#224; chercher des m&#233;thodes
d&#8217;accentuation de termes non accentu&#233;s. Cependant, les m&#233;thodes que nous avons trouv&#233;es
dans la litt&#233;rature ne traitent pas le cas des mots &#171; inconnus &#187;, c&#8217;est-&#224;-dire qui ne se trouvent pas
dans le lexique utilis&#233; par le syst&#232;me concern&#233;. Malgr&#233; l&#8217;emploi de lexiques g&#233;n&#233;raux et sp&#233;-
cialis&#233;s, un nombre important des mots du MeSH sont dans ce cas2. On peut bien s&#251;r avancer
</p>
<p>1Il semble que ce soit une tradition tenace en Sciences de l&#8217;information.
2Citons par exemple cachectine, cadherines, caenorhabditis, caeruleine, calcifiante, calcimedine, cal-
</p>
<p>cimedines, calcineurine, calciphylaxie, calcoaceticus, calelectrine, calelectrines, calendula.
</p>
<p>54</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Accentuation de mots inconnus : application au thesaurus biom&#233;dical MeSH
</p>
<p>que la constitution d&#8217;un lexique plus complet devrait r&#233;duire la proportion de ces mots. Mais il
s&#8217;agit pour la plupart de mots sp&#233;cialis&#233;s et rares, dont nous avons eu du mal &#224; trouver certains
m&#234;me dans un grand dictionnaire m&#233;dical de r&#233;f&#233;rence (Garnier &amp; Delamare, 1992). Il est donc
pertinent de chercher &#224; accentuer automatiquement ces mots inconnus.
</p>
<p>Apr&#232;s une br&#232;ve revue de m&#233;thodes existantes (section 2), nous abordons donc la question de
la g&#233;n&#233;ration d&#8217;une forme accentu&#233;e pour des mots inconnus. Nous pr&#233;sentons deux m&#233;thodes
(section 3) fond&#233;es sur un entra&#238;nement sur un ensemble de mots accentu&#233;s. Nous montrons des
r&#233;sultats exp&#233;rimentaux pour la lettre e sur le MeSH fran&#231;ais (section 4) : de l&#8217;ordre de 86 %
des mots contenant au moins un e sont correctement accentu&#233;s (y compris correctement laiss&#233;s
sans accent) ; et la seconde m&#233;thode permet de d&#233;limiter une portion de l&#8217;ensemble de mots &#224;
accentuer (ici, 72&#8211;75 %) sur laquelle elle obtient une accentuation plus s&#251;re (ici, de 95 %).
</p>
<p>2 &#201;tat de l&#8217;art
Des travaux ant&#233;rieurs se sont attaqu&#233;s &#224; l&#8217;accentuation de textes, par exemple, (Spriet &amp; El-
B&#232;ze, 1997), ou le projet R&#233;acc (www-rali.iro.umontreal.ca, (Simard, 1998)). Ils
traitent le cas o&#249; tous les mots possibles sont suppos&#233;s connus : ils sont recens&#233;s dans le lexique.
Le probl&#232;me est alors de d&#233;sambigu&#239;ser un mot non accentu&#233; lorsqu&#8217;il correspond &#224; plusieurs
formes du lexique &#8211; l&#8217;exemple cote de l&#8217;introduction. Cette d&#233;sambigu&#239;sation s&#8217;appuie sur les
techniques de la d&#233;sambigu&#239;sation morphosyntaxique : si l&#8217;ambigu&#239;t&#233; d&#8217;une occurrence de mot
d&#233;saccentu&#233; est corr&#233;l&#233;e &#224; une ambigu&#239;t&#233; morphosyntaxique, l&#8217;examen du contexte permet la
plupart du temps de d&#233;terminer la forme accentu&#233;e correcte de cette occurrence.
</p>
<p>En revanche, nous n&#8217;avons trouv&#233; aucune r&#233;f&#233;rence sur l&#8217;accentuation de mots inconnus : une
m&#233;thode qui propose une version accentu&#233;e des mots hors du lexique. Nous avons tout d&#8217;abord
cherch&#233; &#224; &#233;liminer de ce traitement les mots que l&#8217;on peut trouver dans des lexiques ou corpus
accentu&#233;s. Mais cette technique est limit&#233;e par la taille du corpus qui serait n&#233;cessaire pour
que des mots &#171; rares &#187; y apparaissent, et par l&#8217;indisponibilit&#233; de lexiques &#233;lectroniques sp&#233;-
cialis&#233;s pour notre domaine. Nous avons alors cherch&#233; &#224; mettre au point, par des techniques
d&#8217;apprentissage, des r&#232;gles d&#8217;accentuation qui puissent &#234;tre appliqu&#233;es &#224; un mot non accentu&#233;
pour g&#233;n&#233;rer une forme accentu&#233;e de ce mot. Nous les d&#233;crivons ci-dessous.
</p>
<p>3 Accentuer des mots inconnus
</p>
<p>3.1 Des mots &#171; inconnus &#187;
</p>
<p>Le MeSH fran&#231;ais a &#233;t&#233; bri&#232;vement pr&#233;sent&#233; dans l&#8217;introduction ; nous travaillons avec sa ver-
sion 2001 (il est mis &#224; jour annuellement). La portion accentu&#233;e et mise en casse mixte par
l&#8217;&#233;quipe CISMeF est celle de novembre 2001. Comme de nouvelles ressources sont r&#233;guli&#232;re-
ment ajout&#233;es dans CISMeF et peuvent utiliser des termes MeSH suppl&#233;mentaires, un nombre
plus grand de termes accentu&#233;s est maintenant disponible. La liste des mots qui apparaissent
dans les termes accentu&#233;s de novembre 2001, soit 4 861 formes, nous sert de lexique de base.
Nous avons retir&#233; de cette liste les quelques &#171; mots &#187; contenant des chiffres, ceux ne contenant
qu&#8217;une ou deux lettres (abr&#233;viations), et nous les avons mis en minuscules. Le lexique r&#233;sultant
compte 4 763 mots (4 756 diff&#233;rents une fois d&#233;saccentu&#233;s). Ce lexique contient des mots sim-
</p>
<p>55</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Natalia Grabar
</p>
<p>ples : il ne cherche pas &#224; recenser des unit&#233;s polylexicales comme infarctus du myocarde, mais
les d&#233;coupe en infarctus et myocarde. En tout, on y trouve 6 670 occurrences de la lettre e, dont
1 789 accentu&#233;es. 1 522 mots contiennent au moins un e accentu&#233; ; 106 mots contiennent au
moins une lettre accentu&#233;e autre que e.
</p>
<p>Un mot est consid&#233;r&#233; comme inconnu lorsqu&#8217;il n&#8217;est pas list&#233; dans notre lexique. Une premi&#232;re
pr&#233;occupation consiste &#224; ajouter davantage de mots connus dans ce lexique, dans l&#8217;espoir qu&#8217;ils
finissent par couvrir la plupart des mots du MeSH. La question est alors de trouver des sources
appropri&#233;es de mots suppl&#233;mentaires. Nous avons utilis&#233; pour cela plusieurs listes de mots
sp&#233;cialis&#233;s trouv&#233;es sur le Web (lexique sur le cancer, lexique m&#233;dical g&#233;n&#233;ral), ainsi que le
lexique &#233;lectronique de l&#8217;ABU (abu.cnam.fr/DICO), qui contient quelque 300,000 entr&#233;es
pour le fran&#231;ais &#171; g&#233;n&#233;ral &#187;. Plusieurs corpus ont fourni des sources accentu&#233;es pour &#233;tendre ce
lexique avec des mots m&#233;dicaux (cardiologie, h&#233;matologie, r&#233;animation, tir&#233;s de l&#8217;&#233;tat courant
du corpus CLEF (Habert et al., 2001), et notices de m&#233;dicaments). Le lexique r&#233;sultant compte
276 445 formes diff&#233;rentes.
</p>
<p>Apr&#232;s application de cette liste au MeSH, 7 407 mots restaient non reconnus. Nous avons &#233;gale-
ment mis en minuscules les mots de cette liste, nous en avons retir&#233; ceux ne contenant qu&#8217;une
ou deux lettres, ceux contenant des chiffres et plus g&#233;n&#233;ralement n&#8217;importe quel caract&#232;re hors
de l&#8217;ensemble des minuscules non accentu&#233;es (il restait quelques s&#233;parateurs et quelques mots
qui &#233;taient d&#233;j&#224; accentu&#233;s). La liste r&#233;sultante compte 6 868 mots non accentu&#233;s. Parmi ceux-ci,
5 188 comprennent au moins une fois la lettre e ; les exemples de la note 2 sont tir&#233;s de cette
liste. Comme on peut s&#8217;en rendre compte, il ne s&#8217;agit pas en g&#233;n&#233;ral de mots que l&#8217;on trouve
dans un dictionnaire de langue g&#233;n&#233;rale. Ce sont ces mots qu&#8217;il s&#8217;agit d&#8217;accentuer.
</p>
<p>3.2 Repr&#233;senter le contexte d&#8217;une lettre &#224; accentuer
</p>
<p>Nous avons cherch&#233; &#224; mettre au point des r&#232;gles d&#8217;accentuation de lettres non accentu&#233;es
fond&#233;es sur l&#8217;hypoth&#232;se suivante : le contexte dans lequel appara&#238;t cette lettre (les lettres
voisines) va permettre de d&#233;cider de son accentuation.
Se pose alors la question de trouver une description appropri&#233;e du contexte d&#8217;une lettre pivot
dans un mot, par exemple la lettre &#233; dans excis&#233;e. Une solution pourrait &#234;tre de fixer un nombre
de lettres autour du pivot. Des s&#233;quences de deux ou trois lettres (bigrammes, trigrammes) sont
souvent choisies comme base pour des m&#233;thodes d&#8217;apprentissage (par exemple, l&#8217;&#233;tiquetage
probabiliste (Weischedel et al., 1993)). Mais il semble qu&#8217;un contexte plus large soit souvent
n&#233;cessaire ; par exemple, eme s&#8217;accentue g&#233;n&#233;ralement en &#232;me &#224; la fin d&#8217;un mot (emphys&#232;me,
quatri&#232;me, probl&#232;me), alors qu&#8217;il s&#8217;&#171; accentue &#187; en eme lorsqu&#8217;il est suivi d&#8217;un n (arrachement,
infarcissement, sexuellement). De plus, le contexte pertinent autour d&#8217;une lettre pivot peut
s&#8217;&#233;tendre &#224; la fois &#224; gauche et &#224; droite du pivot ; par exemple, pour la s&#233;rie des e, &#234;tre suivi
d&#8217;un x est un indice fort d&#8217;un e sans accent (exemple, flexion), comme l&#8217;est le fait de suivre un &#233;
(laryng&#233;e, calcan&#233;en, cas&#233;eux ; seuls quelques mots fran&#231;ais comme cr&#233;&#233; ont deux &#233; &#224; la suite).
Nous avons repris deux fa&#231;ons de repr&#233;senter le contexte d&#8217;une lettre. D&#8217;une part, la repr&#233;sen-
tation employ&#233;e par l&#8217;&#233;tiqueteur de Brill (Brill, 1995) d&#233;crit des contraintes sur le voisinage
d&#8217;un mot dans une phrase ; nous l&#8217;avons transpos&#233;e au voisinage d&#8217;une lettre dans un mot (sec-
tion 3.3). D&#8217;autre part, une notion de contexte mixte a &#233;t&#233; pr&#233;sent&#233;e dans (Theron &amp; Cloete,
1997) pour apprendre des r&#232;gles morphologiques &#224; partir d&#8217;exemples. Cette notion permet de
repr&#233;senter des contextes &#224; longueur variable qui s&#8217;&#233;tendent des deux c&#244;t&#233;s d&#8217;une lettre pivot
</p>
<p>56</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Accentuation de mots inconnus : application au thesaurus biom&#233;dical MeSH
</p>
<p>(section 3.4). Elle prend la forme de cha&#238;nes de caract&#232;res repli&#233;es, que l&#8217;on peut &#233;galement
mettre sous forme de transducteurs &#224; &#233;tats finis.
</p>
<p>3.3 L&#8217;accentuation comme un &#233;tiquetage contextuel
</p>
<p>Cette premi&#232;re m&#233;thode est fond&#233;e sur l&#8217;emploi d&#8217;un &#233;tiqueteur morphosyntaxique : celui de
Brill (Brill, 1995). Nous consid&#233;rons chaque mot comme une &#171; phrase de lettres &#187; : chaque let-
tre constitue un mot, et la suite des lettres d&#8217;un mot constitue une phrase. L&#8217;&#233;tiquette d&#8217;une lettre
est la forme accentu&#233;e de cette lettre, ou la m&#234;me lettre si celle-ci n&#8217;est pas accentu&#233;e. Par exem-
ple, pour le mot endometre &#224; accentuer en endom&#232;tre, la &#171; phrase &#187; est e/e n/n d/d o/o m/m e/&#232; t/t
r/r e/e (dans le format de l&#8217;&#233;tiqueteur de Brill). L&#8217;apprentissage habituel de l&#8217;&#233;tiqueteur permet
alors d&#8217;apprendre des r&#232;gles contextuelles d&#8217;accentuation, dont les premi&#232;res sont indiqu&#233;es sur
le tableau 1. Par exemple, lors de l&#8217;accentuation du mot flexion, la r&#232;gle (1) s&#8217;applique d&#8217;abord
</p>
<p>Format Brill Glose Format Brill Glose
(1) e &#233; NEXT2TAG i e.i&#0; e&#1; &#233; (2) e &#233; NEXT1OR2TAG o e.?o&#0; e&#1; &#233;
(3) e &#233; NEXT1OR2TAG a e.?a&#0; e&#1; &#233; (4) e &#233; NEXT1OR2WD e e.?e&#0; e&#1; &#233;
(5) e &#233; NEXT2TAG h e.h&#0; e&#1; &#233; (6) &#233; &#232; NEXTBIGRAM n e &#233;ne&#0; &#233;&#1; &#232;
(7) &#233; e NEXTBIGRAM m e &#233;me&#0; &#233;&#1; e (8) e &#233; NEXTBIGRAM t r etr&#0; e&#1; &#233;
(9) &#233; e NEXT1OR2OR3TAG x &#233;.?.?x&#0; &#233;&#1; e (10) e &#233; NEXT1OR2TAG y e.?y&#0; e&#1; &#233;
(11) e &#233; NEXT2TAG u e.u&#0; e&#1; &#233; (12) e &#233; SURROUNDTAG t i tei&#0; e&#1; &#233;
(13) &#233; &#232; NEXTBIGRAM s e &#233;se&#0; &#233;&#1; &#232; (14) &#233; e NEXT1OR2OR3TAG x (bis) &#233;.?.?x&#0; &#233;&#1; e
(15) &#233; e PREVTAG o o&#233;&#0; &#233;&#1; e (16) &#233; e PREVBIGRAM y p yp&#233;&#0; &#233;&#1; e
</p>
<p>Table 1: R&#232;gles de correction d&#8217;accentuation.
</p>
<p>et accentue le e pour donner fl&#233;xion (comme dans ...&#233;mie). La r&#232;gle (9) s&#8217;applique ensuite pour
corriger cette accentuation devant un x, ce qui redonne flexion. Ces r&#232;gles correspondent &#224;
une repr&#233;sentation du contexte d&#8217;occurrence d&#8217;une lettre. Cette repr&#233;sentation est mixte (con-
textes gauche et droite peuvent &#234;tre combin&#233;s, par exemple dans SURROUNDTAG), et peut aller
jusqu&#8217;&#224; une distance de trois lettres &#224; gauche et &#224; droite, mais avec des combinaisons con-
traintes. Contrairement &#224; la m&#233;thode suivante, il s&#8217;agit ici de r&#232;gles successives de correction
de l&#8217;accentuation initiale la plus probable, qui consiste &#224; n&#8217;accentuer aucun e.
</p>
<p>3.4 Le voisinage d&#8217;une lettre en une cha&#238;ne de caract&#232;res
</p>
<p>La repr&#233;sentation par un contexte mixte employ&#233;e dans (Theron &amp; Cloete, 1997) a l&#8217;int&#233;r&#234;t de
ne pas mettre de limite au nombre de caract&#232;res qui peuvent &#234;tre pris en compte. Elle replie
les lettres d&#8217;un mot autour de la lettre pivot consid&#233;r&#233;e, en collectant alternativement la lettre
suivante sur la droite puis sur la gauche, jusqu&#8217;&#224; ce que les deux extr&#233;mit&#233;s du mot soient
atteintes. Ces extr&#233;mit&#233;s sont marqu&#233;es par des symboles sp&#233;ciaux (ici, &#0; pour le d&#233;but du mot,
et $ pour la fin du mot)3. Par exemple, le premier e de excis&#233;e est repr&#233;sent&#233; par le contexte
mixte de la colonne de droite de la premi&#232;re ligne du tableau 2. La colonne de gauche montre
l&#8217;ordre dans lequel les lettres du mot sont &#233;num&#233;r&#233;es. Les deux lignes suivantes indiquent les
repr&#233;sentations en contexte mixte pour les deux autres e de ce mot.
</p>
<p>3Theron &amp; Cloete r&#233;p&#232;tent de plus un symbole &#171; hors-mot &#187; lorsqu&#8217;une extr&#233;mit&#233; a &#233;t&#233; atteinte mais pas l&#8217;autre.
</p>
<p>57</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Natalia Grabar
</p>
<p>Mot Contexte mixte=Cible
&#0; e x c i s &#233; e $
2 . 1 3 4 5 6 7 8 x
</p>
<p>&#0; c i s e e $= e
&#0; e x c i s &#233; e $
8 7 6 5 4 2 . 1 3 e s $ i c x e
</p>
<p>&#0;
</p>
<p>= &#233;
&#0; e x c i s &#233; e $
8 7 6 5 4 3 2 . 1 $ e s i c x e
</p>
<p>&#0;
</p>
<p>= e
</p>
<p>Table 2: Un mot et les repr&#233;sentations en contexte mixte de ses e.
</p>
<p>Chacun de ces contextes est d&#233;saccentu&#233;, car il a pour vocation d&#8217;&#234;tre compar&#233; &#224; des repr&#233;sen-
tations de mots non accentu&#233;s. La forme originale de la lettre pivot est associ&#233;e au contexte
sous forme d&#8217;une &#171; sortie &#187; (nous utilisons le symbole &#171; = &#187; pour noter cette sortie). Chaque
contexte est donc converti en un transducteur : l&#8217;entr&#233;e est le contexte mixte autour d&#8217;une lettre
pivot, et la sortie est la lettre (accentu&#233;e ou pas) appropri&#233;e parmi les lettres possibles.
L&#8217;&#233;tape suivante consiste &#224; d&#233;terminer des contextes discriminants minimaux. Pour cela, nous
fusionnons tous les transducteurs produits sur l&#8217;ensemble de mots d&#8217;entra&#238;nement (op&#233;ration
OU) en mettant en facteur leurs pr&#233;fixes communs en un arbre lexicographique. Nous obtenons
ainsi un transducteur d&#233;terministe qui repr&#233;sente exactement l&#8217;ensemble d&#8217;apprentissage. Nous
calculons ensuite, pour chaque &#233;tat de ce transducteur et pour chaque sortie possible (lettre de
l&#8217;ensemble e&#233;&#232;&#234;&#235;) atteignable &#224; partir de cet &#233;tat, le nombre de chemins qui m&#232;nent de cet &#233;tat &#224;
cette sortie. Nous appelons non ambigu un &#233;tat dont tous les chemins sortants m&#232;nent &#224; la m&#234;me
sortie. Dans ce cas, pour nos besoins, ces chemins peuvent &#234;tre remplac&#233;s par un raccourci vers
cette sortie commune. Cela revient &#224; g&#233;n&#233;raliser l&#8217;ensemble des contextes en les rempla&#231;ant par
un ensemble de contextes minimaux discriminants.
</p>
<p>&#201;tant donn&#233; un mot &#224; accentuer, la premi&#232;re &#233;tape est de repr&#233;senter le contexte de chacune
de ses lettres pivot. Par exemple, le mot r&#233;el contient deux e dont les contextes mixtes sont
erl&#0;$ et le$r&#0;. Le transducteur est appliqu&#233; &#224; chaque contexte pour trouver le plus long chemin
partant de son &#233;tat de d&#233;part qui corresponde &#224; un pr&#233;fixe de ce contexte. Si ce chemin m&#232;ne &#224;
un &#233;tat de sortie, la sortie est la forme accentu&#233;e propos&#233;e pour la lettre pivot. Si l&#8217;appariement
se termine plus t&#244;t, nous sommes en pr&#233;sence d&#8217;une ambigu&#239;t&#233; : plusieurs &#233;tats de sortie peu-
vent &#234;tre atteints, et nous ne prenons pas de d&#233;cision4. Le nombre d&#8217;exemples de l&#8217;ensemble
d&#8217;apprentissage qui ont pris le m&#234;me chemin peut donner une &#233;valuation du support (niveau
de confiance) &#233;tayant un &#233;tat de sortie donn&#233; (une d&#233;cision d&#8217;accentuation). La proc&#233;dure
d&#8217;accentuation peut choisir de prendre une d&#233;cision d&#8217;accentuation seulement lorsque le support
pour cette d&#233;cision est au-dessus d&#8217;un certain seuil.
</p>
<p>Le tableau 3 montre quelques contextes discriminants minimaux appris sur les mots accentu&#233;s
du MeSH. Les trois premiers permettent d&#8217;accentuer les trois e de excis&#233;e5. Notons que d&#8217;autres
repr&#233;sentations des contextes pourraient &#234;tre employ&#233;es. Nous avons examin&#233; des contextes
droits (une cha&#238;ne de longueur variable de lettres contigu&#235;s situ&#233;es &#224; droite du pivot) et des
contextes gauches (idem &#224; gauche) ; chacun donne des r&#233;sultats inf&#233;rieurs aux contextes mixtes.
</p>
<p>4Notons qu&#8217;il serait possible dans ce dernier cas de prendre en compte les fr&#233;quences relatives d&#8217;occurrence de
ces chemins alternatifs dans l&#8217;ensemble d&#8217;apprentissage, et de prendre des d&#233;cisions probabilistes sur cette base
(Zweigenbaum &amp; Grabar, 2002). Dans les exp&#233;riences pr&#233;sent&#233;es ici, seuls les cas non ambigus sont trait&#233;s.
</p>
<p>5On remarquera que le contexte -&#233;e- n&#8217;est pas propos&#233; ; en effet, l&#8217;ensemble d&#8217;entra&#238;nement contient des mots
anglais comme feed qui le rendent ambigu.
</p>
<p>58</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Accentuation de mots inconnus : application au thesaurus biom&#233;dical MeSH
</p>
<p>Contexte Support D&#233;pli&#233; Exemples
x=e 68 -ex- &#0;exanth&#232;me$, &#0;anorexie$, &#0;cortex$
es=&#233; 11 -s&#233;e- &#0;naus&#233;e$, &#0;m&#233;dicalis&#233;e$
$e=e 53 -&#233;e &#0;am&#233;norrh&#233;e$, &#0;apn&#233;e$, &#0;assist&#233;e$
mho&#0;=&#233; 22 &#0;h&#233;mo- &#0;h&#233;modiafiltration$
</p>
<p>Table 3: Des contextes discriminants minimaux.
</p>
<p>3.5 &#201;valuation
Nous avons entra&#238;n&#233; les deux m&#233;thodes sur deux ensembles d&#8217;entra&#238;nement : les 4 763 mots de
la partie accentu&#233;e du MeSH (section 3.1) et les 54 291 lemmes du lexique ABU. Pour v&#233;rifier la
validit&#233; des r&#232;gles, nous les avons appliqu&#233;es aux m&#234;mes mots du MeSH d&#233;saccentu&#233;s (4 756).
Cela permet de mesurer un taux de rappel (mots correctement accentu&#233;s / mots &#224; accentuer) et
de pr&#233;cision (mots correctement accentu&#233;s / mots accentu&#233;s). La m&#233;thode des contextes a &#233;t&#233;
appliqu&#233;e avec une s&#233;rie de seuils diff&#233;rents (0, 2, 5, 10, 20, 50). On s&#8217;attend &#224; ce qu&#8217;un seuil
plus haut am&#233;liore la pr&#233;cision au d&#233;triment du rappel.
</p>
<p>On a indiqu&#233; que la m&#233;thode des contextes prend individuellement pour chaque lettre une d&#233;-
cision d&#8217;accentuation. Elle sait donc pour quelle proportion des e d&#8217;un mot elle a pu d&#233;cider.
Nous r&#233;partissons alors les mots trait&#233;s en trois classes : d&#233;cision pour toutes les lettres [com-
pl&#232;te], d&#233;cision pour une partie des lettres [partielle], d&#233;cision pour [aucune] des lettres. Nous
verrons que la pr&#233;cision est nettement meilleure sur la classe [compl&#232;te]. Une strat&#233;gie possible
est alors de n&#8217;accepter que les r&#233;sultats pour cette classe, ce qui augmente la pr&#233;cision mais
diminue le rappel. Nous donnons donc aussi une mesure individuelle pour cette classe.
</p>
<p>Nous avons enfin appliqu&#233; les deux m&#233;thodes sur les 5 188 mots &#171; inconnus &#187; accentuables
du MeSH (section 3.1). Aucun &#233;talon n&#8217;est disponible pour valider cette accentuation : une
validation humaine &#233;tait donc n&#233;cessaire. Pour l&#8217;effectuer, nous avons pr&#233;lev&#233; au hasard des
&#233;chantillons dans chacune des trois classes [compl&#232;te], [partielle] et [aucune], et reconstitu&#233;
un &#233;chantillon global form&#233; de mots de ces trois classes au prorata de leurs tailles relatives.
Ces &#233;chantillons ont &#233;t&#233; revus par l&#8217;&#233;quipe CISMeF. Du fait de l&#8217;&#233;chantillonnage, les mesures
de pr&#233;cision doivent ici inclure un intervalle de confiance. Nous nous sommes servis de cette
estimation de la pr&#233;cision pour calculer une estimation du rappel attendu pour chaque classe
(taille relative de la classe &#2; pr&#233;cision pour cette classe).
Les programmes ont &#233;t&#233; &#233;crits en Perl5. Ils comprennent un paquetage de manipulation
d&#8217;arbres lexicographiques que nous avons &#233;crit en &#233;tendant le paquetage Tree::Trie en
ligne sur le &#171; Comprehensive Perl Archive Network &#187; (www.cpan.org).
</p>
<p>4 R&#233;sultats
</p>
<p>L&#8217;&#233;tiqueteur de Brill apprend 80 (MeSH) ou 208 (ABU) r&#232;gles contextuelles. La m&#233;thode des
contextes apprend 1 740 (MeSH) ou 15 925 (ABU) contextes minimaux au seuil 0.
Le tableau 4 r&#233;sume les r&#233;sultats de la v&#233;rification sur les mots d&#8217;entra&#238;nement &#171; MeSH &#187; : la
pr&#233;cision globale est tr&#232;s bonne pour Brill (89&#8211;91 %). Pour la m&#233;thode des contextes entra&#238;n&#233;e
sur MeSH, elle est excellente au seuil 0 avec les deux ensembles d&#8217;apprentissage (93&#8211;99,6 %),
</p>
<p>59</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Natalia Grabar
</p>
<p>mais elle d&#233;cro&#238;t lorsque le seuil augmente. Les chiffres de la classe [compl&#232;te] peuvent expli-
quer ce fait : l&#8217;accentuation est parfaite pour cette classe, mais sa taille d&#233;cro&#238;t lorsque le seuil
cro&#238;t ; les classes [partielle] et [aucune] voient donc leur taille augmenter, et ont chacune une
pr&#233;cision moindre. Entra&#238;n&#233;e sur ABU, la m&#233;thode des contextes donne &#233;galement de tr&#232;s bons
r&#233;sultats globaux au seuil 0, qui d&#232;s le seuil 2 sont meilleurs que ceux pour MeSH ; par ailleurs,
la pr&#233;cision pour la classe [compl&#232;te] est excellente (96 %) et augmente, elle, avec le seuil ;
mais ici aussi, son rappel diminue lorsque ce seuil augmente.
</p>
<p>Apprentissage Brill M&#233;thode des contextes
seuil : &#8211; 0 2 5 10 20 50
</p>
<p>MeSH &#0; 0,91 0,996 0,87 0,80 0,74 0,70 0,68
(globale) &#1; 0,92 0,995 0,87 0,80 0,74 0,70 0,68
MeSH &#0; 1 1 1 1 1 1
[compl&#232;te] &#1; 0,84 0,57 0,41 0,28 0,18 0,10
ABU &#0; 0,89 0,93 0,89 0,84 0,79 0,75 0,71
(globale) &#1; 0,89 0,93 0,89 0,84 0,79 0,75 0,71
ABU &#0; 0,96 0,985 0,990 0,990 0,994 0,998
[compl&#232;te] &#1; 0,70 0,52 0,39 0,29 0,19 0,10
</p>
<p>Table 4: Test sur la partie accentu&#233;e du MeSH.
</p>
<p>Le seuillage ne nous semble donc pas pertinent ; nous ne l&#8217;appliquerons pas par la suite. On
observe que l&#8217;entra&#238;nement sur le MeSH, s&#8217;il obtient g&#233;n&#233;ralement des r&#233;sultats un peu meilleurs
qu&#8217;ABU, ne s&#8217;en distingue pas fortement. Il aurait donc probablement &#233;t&#233; possible d&#8217;employer
cette m&#233;thode d&#8217;accentuation, entra&#238;n&#233;e sur ABU, pour pr&#233;parer l&#8217;accentuation de cette partie
du MeSH. Nous avons effectu&#233; les m&#234;mes tests avec des contextes droits (pr&#233;cision moyenne
76 %) et gauches (70 %). Leur accentuation [compl&#232;te] est elle aussi pr&#233;cise (93 et 94 % au
seuil 0), mais avec un rappel tr&#232;s faible (3 et 22 %). Ces deux m&#233;thodes ont donc &#233;t&#233; d&#233;laiss&#233;es.
L&#8217;accentuation des 5 188 mots &#171; inconnus &#187; du MeSH donne les r&#233;sultats indiqu&#233;s sur le
tableau 5 (seuil 0). La colonne de droite (Base) indique la proportion de mots ne contenant
aucun accent. Cette proportion correspond &#224; la pr&#233;cision qu&#8217;aurait une proc&#233;dure choisissant
syst&#233;matiquement de laisser tous les e non accentu&#233;s.
</p>
<p>D&#233;cision Entra&#238;n.t Nb % total &#201;ch. Cor. Pr&#233;cision&#1;IC Rappel&#1;IC Base
Brill MeSH 5 188 100 250 215 0,86&#1;0,04 0,86&#1;0,04 0,68
Brill ABU 5 188 100 250 215 0,86&#1;0,04 0,86&#1;0,04
total MeSH 5 188 100 250 215 0,86&#1;0,04 0,86&#1;0,04 0,71
total ABU 5 188 100 250 206 0,82&#1;0,05 0,82&#1;0,05
[compl&#232;te] MeSH 3 898 75 180 172 0,96&#1;0,03 0,72&#1;0,02 0,74
[compl&#232;te] ABU 3 734 72 142 135 0,95&#1;0,04 0,68&#1;0,03
[partielle] MeSH 784 15 86 39 0,45&#1;0,11 0,07&#1;0,02 0,40&#8211;5
[partielle] ABU 823 16 38 21 0,55&#1;0,16 0,09&#1;0,03
[aucune] MeSH 506 10 71 64 0,90&#1;0,07 0,09&#1;0,01 0,90&#8211;6
[aucune] ABU 631 12 20 19 0,95&#1;0,10 0,12&#1;0,01
</p>
<p>Table 5: Accentuation des mots inconnus (seuil = 0, pr&#233;cision sur &#233;chantillons &#201;ch.).
</p>
<p>60</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Accentuation de mots inconnus : application au thesaurus biom&#233;dical MeSH
</p>
<p>On constate que les r&#233;sultats globaux de l&#8217;&#233;tiqueteur de Brill (MeSH ou ABU) et de la m&#233;thode
des contextes (MeSH) sur l&#8217;&#233;chantillon de test sont identiques &#8211; les r&#233;sultats sont un peu moins
bons pour la m&#233;thode des contextes entra&#238;n&#233;e sur ABU. Si l&#8217;on distingue les trois classes de
d&#233;cisions, les r&#233;sultats sont en revanche tr&#232;s tranch&#233;s. La pr&#233;cision est excellente (95&#8211;96 %)
lorsque la d&#233;cision est compl&#232;te, mauvaise (45&#8211;55 %) lorsque la d&#233;cision est partielle, et bonne
de nouveau (90&#8211;95 %) lorsqu&#8217;aucune d&#233;cision n&#8217;a pu &#234;tre prise. On peut donc obtenir une
pr&#233;cision de 95 % pour un rappel de 72 % ([compl&#232;te]), ou encore une pr&#233;cision &#224; peine moins
bonne (&#3;93 %) pour un rappel de 81 % ([compl&#232;te] + [aucune]).
Sur la classe [partielle], Brill obtient une pr&#233;cision de 65&#1;10 % (MeSH, hors tableau), net-
tement meilleure que celle de la m&#233;thode des contextes sur cette classe. Une combinaison
avantageuse consisterait &#224; utiliser d&#8217;abord la m&#233;thode des contextes, d&#233;coupant l&#8217;ensemble de
mots en trois classes ; &#224; conserver ses r&#233;sultats pour les classes [compl&#232;te] et [aucune] ; et &#224;
appliquer l&#8217;accentuation par Brill sur la classe [partielle]. On pourrait en attendre un gain en
pr&#233;cision globale de l&#8217;ordre de 3 % (MeSH : +20 % &#2; proportion de [partielle] = 0,15).
</p>
<p>5 Bilan
</p>
<p>Les m&#233;thodes d&#8217;accentuation pr&#233;sent&#233;es ici permettent d&#8217;obtenir des performances absolues
honorables. Il faut &#233;galement juger de leur utilit&#233; dans le cadre d&#8217;une t&#226;che d&#8217;assistance &#224;
l&#8217;accentuation humaine. La strat&#233;gie de combinaison des deux m&#233;thodes propos&#233;e dans la
section pr&#233;c&#233;dente devrait faciliter le travail de l&#8217;accentueur-correcteur humain : la correction
d&#8217;une classe de mots ([compl&#232;te], ici, pr&#232;s des trois quarts) ne contenant potentiellement que
peu d&#8217;erreurs (&#3;5 %), d&#8217;une classe de mots ([aucune], &#3;12 %) laiss&#233;s non accentu&#233;s et dont
probablement peu sont accentuables (&#3;5 %), et la correction d&#8217;une classe de mots ([partielle],
&#3;15 %) dont on s&#8217;attend &#224; ce qu&#8217;elle contienne davantage d&#8217;erreurs d&#8217;accentuation (&#3;40 %).
Notons que l&#8217;&#233;valuation a &#233;t&#233; faite sur mots entiers. Une autre &#233;valuation serait possible en
distinguant l&#8217;accentuation individuelle de chaque e; ces d&#233;cisions d&#8217;accentuation individuelles
pourraient &#234;tre rendues visibles dans une interface de validation.
</p>
<p>Nous n&#8217;avons pas cherch&#233; &#224; prendre en compte un d&#233;coupage des mots en morph&#232;mes. Ce d&#233;-
coupage serait sans doute pertinent pour une partie des mots (par exemple, endom&#232;tre, thermo-
m&#232;tre), et pourrait peut-&#234;tre pr&#233;dire avec plus de certitude l&#8217;accentuation de ces mots, sur la base
des morph&#232;mes ainsi segment&#233;s. Certains des contextes appris sont certes li&#233;s &#224; ces morph&#232;mes
(par exemple, &#0;h&#233;mo-, vu plus haut, ou tmh&#0;yl$=&#233; pour le mot m&#233;thyl). N&#233;anmoins, un con-
texte incluant un marqueur de d&#233;but de mot ne permet pas lui-m&#234;me d&#8217;accentuer un morph&#232;me
en milieu de mot (par exemple, phenylmethylsulfonyle). Un marquage des fronti&#232;res de mor-
ph&#232;mes et un apprentissage de contextes s&#8217;arr&#234;tant &#224; ces fronti&#232;res fonctionnerait dans ce cas,
et s&#8217;appliquerait sans doute de fa&#231;on plus g&#233;n&#233;rale. D&#8217;ailleurs, il semble qu&#8217;une part importante
de la classe [partielle] soient des mots compos&#233;s longs comme celui de cet exemple.
Une partie des mots mal accentu&#233;s sont des mots anglais (acad&#233;mic, cl&#233;avage) qui se trouvent
dans certains termes du MeSH fran&#231;ais. On pourrait tenter de les rep&#233;rer par l&#8217;emploi d&#8217;un
lexique anglais. Mais ce n&#8217;est pas si simple dans le contexte o&#249; nous op&#233;rons, car un certain
nombre de mots anglais ont une graphie identique &#224; celle de mots fran&#231;ais d&#233;saccentu&#233;s. Enfin,
nous avons trait&#233; seulement la lettre e. Il serait sans doute h&#226;tif de g&#233;n&#233;raliser les r&#233;sultats
obtenus ici aux autres lettres accentu&#233;es (aiou&#231;). En effet, la r&#233;gularit&#233; observ&#233;e pour le e
est sans doute li&#233;e &#224; la traduction graph&#233;mique de r&#232;gles phonologiques. La distribution des
</p>
<p>61</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Natalia Grabar
</p>
<p>lettres &#226;&#238;&#239;&#231; et peut-&#234;tre encore davantage des &#249;&#228;&#252;&#246; risque d&#8217;&#234;tre plus idiosyncrasique et li&#233;e &#224;
des lex&#232;mes particuliers.
</p>
<p>Ceci &#233;tant pos&#233;, nous pensons que ces m&#233;thodes devraient aider &#224; r&#233;duire substantiellement le
temps humain n&#233;cessaire &#224; accentuer non seulement le MeSH, mais aussi d&#8217;autres ressources.
Par exemple, la base de connaissances ADM en ligne &#224; l&#8217;Universit&#233; de Rennes (Seka et al.,
1997) est un autre corpus m&#233;dical pr&#233;cieux qui reste &#233;crit en majuscules non accentu&#233;es.
</p>
<p>Remerciements
</p>
<p>Nous remercions Magaly Douy&#232;re, Beno&#238;t Thirion et St&#233;fan Darmoni, de l&#8217;&#233;quipe CISMeF,
d&#8217;avoir mis &#224; notre disposition les termes accentu&#233;s du MeSH, et pour leur aide dans la valida-
tion des r&#233;sultats de l&#8217;accentuation.
</p>
<p>R&#233;f&#233;rences
BRILL E. (1995). Transformation-based error-driven learning and natural language processing: A case
study in part-of-speech tagging. Computational Linguistics, 21(4), 543&#8211;565.
DARMONI S. J., LEROY J.-P., THIRION B., BAUDIC F., DOUY&#200;RE M. &amp; PIOT J. (2000). CISMeF: a
structured health resource guide. Methods Inf Med, 39(1), 30&#8211;35.
GARNIER M. &amp; DELAMARE V. (1992). Dictionnaire des Termes de M&#233;decine. Paris: Maloine.
GRABAR N. &amp; ZWEIGENBAUM P. (1999). Acquisition automatique de connaissances morphologiques
sur le vocabulaire m&#233;dical. In P. AMSILI, Ed., Actes de TALN 1999 (Traitement automatique des langues
naturelles), p. 175&#8211;184, Carg&#232;se: ATALA.
HABERT B., GRABAR N., JACQUEMART P. &amp; ZWEIGENBAUM P. (2001). Building a text corpus for
representing the variety of medical language. In Corpus Linguistics 2001, Lancaster.
INSERM (2000). Th&#233;saurus Biom&#233;dical Fran&#231;ais/Anglais. Institut National de la Sant&#233; et de la
Recherche M&#233;dicale, Paris.
SEKA L., COURTIN C. &amp; LE BEUX P. (1997). ADM-INDEX: an automated system for indexing and
retrieval of medical texts. In Stud Health Technol Inform, volume 43 Pt A, p. 406&#8211;410: Reidel.
SIMARD M. (1998). Automatic insertion of accents in French text. In Proceedings of the Third Confer-
ence on Empirical Methods in Natural Language Processing, Grenade.
SPRIET T. &amp; EL-B&#200;ZE M. (1997). R&#233;accentuation automatique de textes. In FRACTAL 97, Besan&#231;on.
THERON P. &amp; CLOETE I. (1997). Automatic acquisition of two-level morphological rules. In R. GR-
ISHMAN, Ed., Proceedings of the Fifth Conference on Applied Natural Language Processing, p. 103&#8211;
110, Washington, DC: ACL.
WEISCHEDEL R., MEETER M., SCHWARTZ R., RAMSHAW L. &amp; PALMUCCI J. (1993). Coping with
ambiguity and unknown words through probabilistic models. Computational Linguistics, 19(2), 359&#8211;
382. Special Issue on Using Large Corpora: II.
ZWEIGENBAUM P. (2001). Ressources pour le domaine m&#233;dical : terminologies, lexiques et corpus
m&#233;dicaux. Lettre de l&#8217;ELRA, 6(4), 8&#8211;11.
ZWEIGENBAUM P. &amp; GRABAR N. (2002). Accenting unknown words in a specialized language. In ACL
Workshop Natural Language Processing in the Biomedical Domain, Philadelphie: ACL. &#192; para&#238;tre.
</p>
<p>62</p>

</div></div>
</body></html>