<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Recherche de la r&#233;ponse fond&#233;e sur la reconnaissance du focus de la question</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27 juin 2002 
</p>
<p>Recherche de la r&#233;ponse fond&#233;e sur la reconnaissance 
du focus de la question 
</p>
<p>Olivier Ferret, Brigitte Grau, Martine Hurault-Plantet, Gabriel Illouz, Laura 
Monceaux, Isabelle Robba, et Anne Vilnat  
</p>
<p>LIMSI-CNRS BP 133, 91403 Orsay 
{ferret, bg, mhp, gabrieli, monceaux, robba, anne}@limsi.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
</p>
<p>Le syst&#232;me de question-r&#233;ponse QALC utilise les documents s&#233;lectionn&#233;s par un moteur de 
recherche pour la question pos&#233;e, les s&#233;pare en phrases afin de comparer chaque phrase avec 
la question, puis localise la r&#233;ponse soit en d&#233;tectant l'entit&#233; nomm&#233;e recherch&#233;e, soit en 
appliquant des patrons syntaxiques d'extraction de la r&#233;ponse, sortes de sch&#233;mas fig&#233;s de 
r&#233;ponse pour un type donn&#233; de question. Les patrons d'extraction que nous avons d&#233;finis se 
fondent sur la notion de focus, qui est l'&#233;l&#233;ment important de la question, celui qui devra se 
trouver dans la phrase r&#233;ponse. Dans cet article, nous d&#233;crirons comment nous d&#233;terminons le 
focus dans la question, puis comment nous l'utilisons dans l'appariement question-phrase et 
pour la localisation de la r&#233;ponse dans les phrases les plus pertinentes retenues. 
</p>
<p>The QALC question answering system we are developing uses a search engine to select 
documents responding to the question, matches each sentence of the selected documents with 
the question, then extracts the answer from the more relevant sentences, either by locating the 
expected named entity, or by applying extraction patterns. Patterns are based on the focus, 
which is the main concept in the question and is expected to be present in an answer sentence. 
In this paper, we will describe the way we determine the focus of the question, and the way 
that we use it in the question-answer pairing and answer location processes. 
</p>
<p>Mots Cl&#233;s &#8211; Keywords 
</p>
<p>Recherche d&#8217;information, syst&#232;me de question-r&#233;ponse, focus, patron d&#8217;extraction. 
Information retrieval, question answering system, focus, extraction pattern. 
</p>
<p>1 Introduction 
</p>
<p>Nous pr&#233;sentons dans cet article le syst&#232;me de question-r&#233;ponse QALC qui participe depuis 
trois ans &#224; la t&#226;che Question-R&#233;ponse des campagnes d'&#233;valuation de la conf&#233;rence TREC 
(Text REtrieval Conference). Dans son principe, un syst&#232;me de question-r&#233;ponse permet de 
trouver la r&#233;ponse pr&#233;cise &#224; une question dans un corpus de documents. La r&#233;ponse doit &#234;tre 
</p>
<p>307 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ferret O., Grau B., Hurault-Plantet M., Illouz G., Monceaux L., Robba I., Vilnat A.  
</p>
<p>concise - c'est l'information demand&#233;e qui doit &#234;tre fournie et non un document dans son 
entier -, et le corpus doit &#234;tre suffisamment vaste pour esp&#233;rer y trouver une r&#233;ponse. La t&#226;che 
Question-R&#233;ponse de TREC consiste &#224; trouver des r&#233;ponses de taille limit&#233;e (50 caract&#232;res 
maximum) &#224; un ensemble d'environ 500 questions de type factuel ou encyclop&#233;dique. Les 
r&#233;ponses doivent &#234;tre recherch&#233;es dans un corpus d'environ un million d'articles de journaux 
tels que le Wall Street Journal et le Los Angeles Times. 
</p>
<p>Deux &#233;tapes sont essentielles dans la recherche de la r&#233;ponse : tout d'abord restreindre le 
champ de recherche par la s&#233;lection d'un sous-ensemble de textes pertinents par rapport &#224; la 
question, puis ensuite localiser la r&#233;ponse dans cet ensemble restreint. Pour s&#233;lectionner des 
textes pertinents, on peut utiliser un moteur de recherche classique qui s&#233;lectionnera les 
documents pertinents pour la question pos&#233;e (Alpha et al., 2001), ou bien adapter un moteur &#224; 
la recherche de passages pertinents dans les documents comme le fait le syst&#232;me LCC 
(Harabagiu et al., 2001). En dernier ressort, c'est chaque phrase du document ou du passage 
(ou une fen&#234;tre plus petite, de 50 caract&#232;res par exemple) qui sera compar&#233;e &#224; la question 
pour localiser la r&#233;ponse. L'appariement entre la phrase du document et la question fait en 
g&#233;n&#233;ral intervenir les termes simples et les multi-termes de la question ainsi que leurs 
variantes morphologiques et s&#233;mantiques. Mais la localisation de la r&#233;ponse dans la phrase 
demande des informations suppl&#233;mentaires. Ainsi, tous les syst&#232;mes de question-r&#233;ponse 
d&#233;terminent si la r&#233;ponse attendue correspond &#224; une entit&#233; nomm&#233;e (par exemple une 
Personne ou une Ville), ou &#224; une entit&#233; num&#233;rique (montant financier, longueur, poids &#8230;). 
Dans ce cas en effet, la localisation de la r&#233;ponse revient &#224; la d&#233;tection de la pr&#233;sence dans la 
phrase de l'entit&#233; nomm&#233;e recherch&#233;e. Une autre information importante est la connaissance 
des d&#233;pendances syntaxiques entre les diff&#233;rents groupes syntaxiques de la question. La 
d&#233;tection des m&#234;mes d&#233;pendances dans la phrase du document aidera la localisation de la 
r&#233;ponse (Hovy et al., 2001). Mais cette d&#233;tection demande un bon analyseur syntaxique, 
traitant en particulier les questions. Une solution plus robuste consiste dans l'utilisation de 
patrons d'extraction de la r&#233;ponse, sortes de sch&#233;mas fig&#233;s de r&#233;ponse pour un type donn&#233; de 
question. Certains syst&#232;mes utilisent exclusivement cette solution (Soubbotin et al., 2001), 
d'autres ne l'utilisent que pour les types de questions o&#249; les d&#233;pendances syntaxiques sont peu 
utilisables. Le syst&#232;me LCC (Harabagiu et al., 2001) par exemple utilise des patrons 
d'extraction pour les questions qui sont des demandes de d&#233;finition d'un terme, comme 
&#171; Qu'est-ce qu&#8217;un micron ?&#187;, mais utilise les d&#233;pendances syntaxiques pour d'autres types de 
question. 
</p>
<p>Le syst&#232;me QALC utilise les documents s&#233;lectionn&#233;s par un moteur de recherche, les s&#233;pare 
en phrases afin de comparer chaque phrase avec la question, puis localise la r&#233;ponse soit en 
d&#233;tectant l'entit&#233; nomm&#233;e recherch&#233;e, soit en appliquant des patrons syntaxiques d'extraction 
de la r&#233;ponse. Les patrons d'extraction que nous avons d&#233;finis se fondent sur la notion de 
focus de la question. Cette notion a &#233;t&#233; introduite par Wendy Lehnert (1979) puis largement 
reprise et red&#233;finie par la suite. Pour Lehnert, le focus de la question est le concept dans la 
question qui englobe les attentes d&#8217;information exprim&#233;es par la question. Pour nous, c'est le 
mot (ou le groupe nominal) de la question repr&#233;sentant l&#8217;entit&#233; sur laquelle on d&#233;sire une 
information et qui g&#233;n&#233;ralement se trouve dans les phrases contenant la r&#233;ponse.  
</p>
<p>Dans cet article, apr&#232;s une br&#232;ve pr&#233;sentation du syst&#232;me QALC, nous d&#233;taillerons l'analyse 
de la question et les informations qu'elle fournit, puis nous d&#233;crirons les processus 
d'appariement question-phrase et de localisation de la r&#233;ponse qui s'appuient sur le focus 
d&#233;termin&#233;. 
</p>
<p>308 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche de la r&#233;ponse fond&#233;e sur la reconnaissance du focus de la question 
</p>
<p>2 Architecture du syst&#232;me QALC 
</p>
<p>Le syst&#232;me QALC est compos&#233; de trois modules principaux : le premier est d&#233;di&#233; au 
traitement des questions, le deuxi&#232;me s&#233;lectionne et traite les documents du corpus et le 
dernier module est charg&#233; de produire la r&#233;ponse. Chacun de ces modules est compos&#233; de 
plusieurs processus (cf. Figure 1). 
</p>
<p> 
</p>
<p> 
</p>
<p>Traitement des 
Questions 
</p>
<p>Moteur de 
recherche 
</p>
<p>R&#233;-indexation et s&#233;lection des 
documents (FASTR) 
Reconnaissance des entit&#233;s nomm&#233;es
dans les documents s&#233;lectionn&#233;s 
</p>
<p> Recherche de la r&#233;ponse : 
 
 
 
</p>
<p>QUESTIONS CORPUS de 
DOCUMENTS 
</p>
<p>Cat&#233;gories des 
questions, Focus, 
</p>
<p>Type de la r&#233;ponse 
Vocabulaire &amp; 
</p>
<p>fr&#233;quences 
</p>
<p>Traitement des documents : 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
S&#233;quences ordonn&#233;es de 50 
</p>
<p>caract&#232;res  
</p>
<p>F
</p>
<p>Le module de traitement des q
extracteur de termes. L'extracteur
les groupes nominaux. Le groupe
plausibles de moindre longueur q
</p>
<p>L'analyse de la question se fonde
plu rmations de la ques
l&#8217;extraction de la r&#233;ponse. Cette p
</p>
<p>Le module de traitement des doc
l'application d&#8217;un moteur de rec
l&#8217;ensemble des questions de l&#8217;&#233;va
par le syst&#232;me FASTR (Jacqu
reconna&#238;t les occurrences et les 
                                                 
1  Le NIST est l&#8217;organisateur des conf&#233;</p>

</div><div>
</div><div>
</div><div><p>       Reconnaissance du focus 
       Appariement Question/Phrase 
       Extraction de la r&#233;ponse </p>

</div><div><p>igure 1 : Le syst&#232;me QALC 
</p>
<p>n module d'analyse de la question et un 
 de termes est bas&#233; sur des patrons syntaxiques qui d&#233;crivent 
 de longueur maximale est produit ainsi que tous les groupes 
ui le forment. 
</p>
<p> sur l'utilisation d'un analyseur robuste dans le bu re 
tion, informations utiles pour la s&#233;lection de phra ur </p>

</div><div>sieurs info</p>

</div><div>
artie sera d&#233;velopp&#233;e dans la section suivante. 
</p>
<p>uments utilise les sorties fournies par le NIST1,
herche de type vectoriel sur le corpus de docu
luation TREC. Les 200 meilleurs documents son
emin, 1999), analyseur transformationnel de 
variantes des termes produits par le module d'ex
</p>
<p>rences TREC. 
</p>
<p>309 </p>

</div><div><p>t d'extrai
ses ou po</p>

</div><div>
</div><div>
</div><div>
</div><div><p>uestions regroupe u</p>

</div><div><p> r&#233;sultat de 
ments pour 
t r&#233;-index&#233;s 
surface qui 
traction de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ferret O., Grau B., Hurault-Plantet M., Illouz G., Monceaux L., Robba I., Vilnat A.  
</p>
<p>termes. Chaque occurrence ou variante constitue un index qui est ensuite utilis&#233;  dans le 
processus de classement des documents. En effet, ces index permettent &#224; QALC de 
r&#233;ordonner les documents et de s&#233;lectionner les plus pertinents (Ferret et al. 2001). Le module 
de reconnaissance des entit&#233;s nomm&#233;es est ensuite appliqu&#233; sur les documents s&#233;lectionn&#233;s. 
</p>
<p>Le module de recherche de la r&#233;ponse r&#233;alise deux op&#233;rations : la s&#233;lection des phrases 
candidates et l'extraction de la r&#233;ponse, en utilisant les informations extraites de la question 
ainsi que les documents &#233;tiquet&#233;s retenus. 
</p>
<p>3 L'analyse de la question 
</p>
<p>L'analyse de la question est r&#233;alis&#233;e afin d'extraire des questions certaines caract&#233;ristiques qui 
pourront &#234;tre utilis&#233;es dans le module de recherche de la r&#233;ponse. Les caract&#233;ristiques de la 
question que nous d&#233;tectons sont le type attendu de la r&#233;ponse, le focus, et la cat&#233;gorie de la 
question. Pour les trouver, nous utilisons des connaissances syntaxiques et s&#233;mantiques. Les 
informations syntaxiques sont fournies par un analyseur syntaxique robuste (A&#239;t-Mokhtar et 
al., 1997) appliqu&#233; &#224; toutes les questions. Cet analyseur renvoie une segmentation en groupes 
pour chaque question ainsi qu&#8217;un ensemble de relations syntaxiques entre ces groupes. Les 
r&#232;gles pour trouver le focus, le type de la question et le type attendu de la r&#233;ponse ont &#233;t&#233; 
&#233;crites &#224; partir de ces repr&#233;sentations syntaxiques. Les connaissances s&#233;mantiques, provenant 
de WordNet (Fellbaum, 1998), permettent de compl&#233;ter les lexiques correspondant &#224; chaque 
type d'entit&#233; nomm&#233;e et d&#8217;am&#233;liorer la d&#233;termination du type attendu de la r&#233;ponse. 
</p>
<p>&#8226; Le type attendu de la r&#233;ponse 
Dans un premier temps, le module d'analyse essaie de trouver si le type attendu de la r&#233;ponse 
correspond &#224; une ou plusieurs entit&#233;s nomm&#233;es class&#233;es par ordre d'importance. Les entit&#233;s 
nomm&#233;es d&#233;tect&#233;es font partie d'une hi&#233;rarchie organis&#233;e en 22 classes s&#233;mantiques 
(Organisation, Ville, Poids...). Les r&#232;gles de reconnaissance utilisent essentiellement le type 
de l&#8217;interrogatif et l&#8217;appartenance du nom sur lequel il porte &#224; l&#8217;une des listes constitu&#233;es pour 
chaque cat&#233;gorie. Pour la conf&#233;rence d'&#233;valuation TREC10, notre module de question trouve 
environ 90,5 % de types d&#8217;entit&#233;s nomm&#233;es attendus corrects. 
</p>
<p>Exemple :  Question : Who developed the Macintosh Computer ?  
(Qui a con&#231;u l&#8217;ordinateur Macintosh ?) 
Type attendu EN de la r&#233;ponse  = { PERSONNE , ORGANISATION } 
</p>
<p>Ensuite, si le type de la r&#233;ponse n&#8217;est pas une entit&#233; nomm&#233;e, QALC essaiera de d&#233;terminer 
un type s&#233;mantique plus g&#233;n&#233;ral correspondant au nom sur lequel porte l&#8217;interrogatif si ce 
nom est une entr&#233;e de WordNet. Pour la conf&#233;rence d'&#233;valuation TREC10, notre module de 
question a trouv&#233; 87 % de types attendus g&#233;n&#233;raux corrects. 
</p>
<p>Exemple :  Question : What metal has the highest melting point ?  
(Quel m&#233;tal a le plus haut point de fusion ?) 
Type attendu g&#233;n&#233;ral de la r&#233;ponse = m&#233;tal 
</p>
<p>&#8226; Le focus de la question 
</p>
<p>310 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche de la r&#233;ponse fond&#233;e sur la reconnaissance du focus de la question 
</p>
<p>Le focus de la question correspond &#224; un nom de la question qui id&#233;alement devrait &#234;tre 
pr&#233;sent dans la phrase r&#233;ponse. Pour chaque question, nous d&#233;terminons donc le focus, ainsi 
que ses modifieurs (adjectif, compl&#233;ment du nom...) qui interviendront &#233;galement dans la 
recherche de la r&#233;ponse. Les r&#232;gles d&#233;terminant le focus d&#233;pendent essentiellement de la 
forme de la question, et celui-ci correspond souvent au sujet. Pour le corpus de la conf&#233;rence 
d'&#233;valuation TREC10, notre module de question trouve 85 % de focus corrects. 
</p>
<p>Exemple :  Question: Who was the first governor of Alaska? 
 (Qui a &#233;t&#233; le premier gouverneur de l&#8217;Alaska ?) 
</p>
<p>Groupe nominal du focus = the first governor of Alaska 
Focus = governor 
Modifieurs du focus = ADJ first, COMP Alaska 
</p>
<p>&#8226; La cat&#233;gorie de la question 
La d&#233;tection de la cat&#233;gorie de la question nous permet de diff&#233;rencier les patrons syntaxiques 
d&#8217;extraction &#224; appliquer aux phrases candidates &#224; la r&#233;ponse. La cat&#233;gorie de la question 
correspond &#224; la forme syntaxique de la question, plus ou moins d&#233;taill&#233;e. Par exemple : 
</p>
<p>Question: What do bats eat? (Que mangent les chauves-souris ?)  
Cat&#233;gorie de la question  = What-Do-GN-VB2 
</p>
<p>Question: When was Rosa Park born? (Quand Rosa Park est-elle n&#233;e ?) 
Cat&#233;gorie de la question = When-Be-NP-born 
</p>
<p>Apr&#232;s avoir &#233;tudi&#233; les questions des conf&#233;rences TREC8 et TREC9 accompagn&#233;es des 
diff&#233;rentes phrases contenant les r&#233;ponses, nous avons trouv&#233; 82 formes syntaxiques de 
questions. 
</p>
<p>4 La recherche de la r&#233;ponse 
</p>
<p>4.1 La reconnaissance du focus dans les documents 
</p>
<p>Pour chaque question, le module d&#8217;analyse nous a fourni le nom repr&#233;sentant le focus et ses 
modifieurs. Le syst&#232;me QALC cherche &#224; les localiser dans les phrases des documents 
s&#233;lectionn&#233;s, en d&#233;tectant d&#8217;abord le focus, puis en identifiant le groupe nominal qui le 
contient. Nous avons d&#233;fini une grammaire locale pour d&#233;tecter les fronti&#232;res du groupe 
nominal. Cette grammaire se fonde sur l&#8217;&#233;tiquetage produit par le Tree-Tagger  (Smidt, 1999). 
</p>
<p>Exemple : Question:  Who is the creator of the Muppets?   
(Quel est le cr&#233;ateur des Muppets ?) 
</p>
<p>Focus =  creator 
Modifieur du focus = COMP Muppets 
</p>
<p>                                                 
2  GN signifie groupe nominal, VB signifie verbe, et NP, nom propre. 
</p>
<p>311 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ferret O., Grau B., Hurault-Plantet M., Illouz G., Monceaux L., Robba I., Vilnat A.  
</p>
<p>Pour cette question, nous avons trouv&#233; dans l&#8217;un des documents s&#233;lectionn&#233;s le groupe 
nominal late Muppets creator Jim Henson, qui correspond &#224; l&#8217;expression :  
</p>
<p>Adjectif + Nom Pluriel + Nom + Nom Propre + Nom Propre 
</p>
<p>QALC recherche aussi les groupes nominaux contenant des synonymes du focus, synonymes 
d&#233;termin&#233;s par FASTR. Lorsqu&#8217;on ne trouve le focus dans aucune des phrases des documents 
s&#233;lectionn&#233;s pour la question, QALC recherche dans les phrases des groupes nominaux 
contenant les noms propres de la question, s&#8217;il y en a. Les noms propres font partie des 
&#233;l&#233;ments qu&#8217;une phrase r&#233;ponse a de grande chance de mentionner. 
</p>
<p>QALC associe un poids &#224; chaque groupe nominal trouv&#233;. Ce poids prend en compte l&#8217;origine 
du groupe nominal (focus, synonyme du focus, ou nom propre), ainsi que les modifieurs 
trouv&#233;s dans la question. Lorsque le groupe nominal contient un ou plusieurs modifieurs, le 
poids est augment&#233; en proportion des modifieurs trouv&#233;s. Le poids le plus fort est obtenu 
lorsque tous les modifieurs sont pr&#233;sents. Dans l&#8217;exemple d&#233;crit plus haut, le poids est 
maximal : le groupe nominal a &#233;t&#233; obtenu &#224; partir du focus creator, et le modifieur Muppets 
est pr&#233;sent. Lorsque le groupe nominal est obtenu &#224; partir d&#8217;un synonyme du focus, le poids 
est l&#233;g&#232;rement baiss&#233;, il l&#8217;est encore plus lorsque le groupe nominal est obtenu &#224; partir d&#8217;un 
nom propre. Par exemple, le poids attribu&#233; au groupe nominal their copy of the 13th century 
Magna Carta trouv&#233; pour la question Which king signed the Magna Carta ?, n&#8217;aura pas le 
poids maximal  car il n&#8217;a pas &#233;t&#233; obtenu &#224; partir du focus king, mais &#224; partir du nom propre 
Magna Carta. D&#8217;une mani&#232;re g&#233;n&#233;rale, l&#8217;algorithme de pond&#233;ration tient toujours compte du 
rapport entre le nombre de mots significatifs de la question, et le nombre de ces mots 
retrouv&#233;s dans le groupe nominal s&#233;lectionn&#233; dans le document. 
</p>
<p>Pour chaque phrase du document s&#233;lectionn&#233;, le syst&#232;me QALC &#233;tiquette tous les groupes 
nominaux pertinents suivant les crit&#232;res d&#233;crits, avec leurs poids. Seuls les groupes nominaux 
obtenant les plus forts poids sont gard&#233;s, fournissant un crit&#232;re d&#8217;&#233;valuation de la phrase. 
</p>
<p>4.2 La s&#233;lection des phrases 
</p>
<p>La m&#233;thode que nous avons adopt&#233;e dans cette version de QALC pour s&#233;lectionner les 
phrases susceptibles de contenir une r&#233;ponse &#224; la question pos&#233;e reprend globalement celle 
d&#233;finie pour ses versions pr&#233;c&#233;dentes : gr&#226;ce &#224; une fonction de comparaison entre phrases 
d&#233;terminant leur proximit&#233; relative par rapport &#224; une question, QALC parcourt phrase par 
phrase les documents s&#233;lectionn&#233;s pour une question et retient les N phrases les plus proches 
de celle-ci3. Cette fonction de comparaison repose sur les caract&#233;ristiques de la question 
consid&#233;r&#233;e qui sont identifi&#233;es dans les phrases des documents par les modules linguistiques 
expos&#233;s pr&#233;c&#233;demment. Ces caract&#233;ristiques sont 1) les termes de la question, 2) le focus et 
ses modifieurs, 3) le type de la r&#233;ponse attendue, que l&#8217;on retrouve au niveau des phrases des 
documents sous la forme d&#8217;entit&#233;s nomm&#233;es. 
</p>
<p>                                                 
3  N est au moins &#233;gal &#224; 5. Les phrases s&#233;lectionn&#233;es sont class&#233;es par ordre de similarit&#233; d&#233;croissante avec la 
</p>
<p>question. 
</p>
<p>312 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche de la r&#233;ponse fond&#233;e sur la reconnaissance du focus de la question 
</p>
<p>Un score sp&#233;cifique est associ&#233; &#224; chacun de ces traits et le score de la phrase correspond &#224; une 
combinaison lin&#233;aire de ces poids. Le principal crit&#232;re de s&#233;lection repose sur  la pr&#233;sence 
d&#8217;un maximum de mots de la question dans la phrase, sachant que l&#8217;on privil&#233;gie les phrases 
contenant le nom focus. Le crit&#232;re portant sur la pr&#233;sence des entit&#233;s nomm&#233;es est utilis&#233; pour 
renforcer l&#8217;importance d&#8217;une phrase, mais non comme crit&#232;re premier de s&#233;lection. Un dernier 
crit&#232;re, utilis&#233; pour d&#233;partager les phrases ex &#230;quo, favorise les phrases dont le taux de 
dispersion des termes de la question est le plus faible. Ce taux est donn&#233; par la taille de la plus 
petite partie de la phrase contenant tous les termes reconnus de la question. Le d&#233;tail de la 
m&#233;thode de s&#233;lection peut &#234;tre trouv&#233;e dans (Ferret et al., 2001). 
</p>
<p>4.3 L&#8217;extraction de la r&#233;ponse 
</p>
<p>Le processus d&#8217;extraction est diff&#233;rent selon que le type attendu de la r&#233;ponse est une entit&#233; 
nomm&#233;e ou non. En effet, lorsque la r&#233;ponse est une entit&#233; nomm&#233;e, l&#8217;extraction consiste &#224; 
localiser l&#8217;entit&#233; nomm&#233;e dans la phrase candidate &#224; la r&#233;ponse. Elle repose donc 
essentiellement sur les r&#233;sultats du module de reconnaissance des entit&#233;s nomm&#233;es dans les 
documents. En revanche, lorsque la r&#233;ponse n&#8217;est pas une entit&#233; nomm&#233;e, le processus 
d&#8217;extraction repose alors sur la reconnaissance du focus de la question et consiste &#224; 
reconna&#238;tre, dans la phrase, les patrons d&#8217;extraction de la r&#233;ponse. 
</p>
<p>4.3.1 Les r&#233;ponses caract&#233;ris&#233;es par une entit&#233; nomm&#233;e 
</p>
<p>Lorsque le syst&#232;me QALC peut pr&#233;dire le type de la r&#233;ponse en terme d&#8217;entit&#233; nomm&#233;e, le 
processus d&#8217;extraction recherche dans la phrase candidate toutes les expressions &#233;tiquet&#233;es 
par le type attendu. Lorsque plusieurs expressions sont trouv&#233;es, QALC s&#233;lectionne la plus 
proche, en terme de distance, du focus, si celui-ci a &#233;t&#233; reconnu dans la phrase, ou la premi&#232;re 
rencontr&#233;e sinon. Si aucune expression du type attendu n&#8217;a &#233;t&#233; trouv&#233;e, QALC g&#233;n&#233;ralise le 
type recherch&#233; en utilisant la hi&#233;rarchie des entit&#233;s nomm&#233;es que nous avons d&#233;finie. Par 
exemple, le type PERSONNE est g&#233;n&#233;ralis&#233; par le type NOM PROPRE, et le type 
LONGUEUR par le type NOMBRE. 
</p>
<p>4.3.2 Les r&#233;ponses de type &#171; noms communs &#187; et &#171; groupe verbal &#187; 
</p>
<p>Lorsque le type attendu de la r&#233;ponse n&#8217;est pas une entit&#233; nomm&#233;e, le syst&#232;me QALC 
d&#233;termine la position de la r&#233;ponse dans la phrase &#224; l&#8217;aide de patrons syntaxiques d&#8217;extraction 
de la r&#233;ponse. Un patron syntaxique d&#8217;extraction est une structure qui comporte le groupe 
nominal du focus dans la phrase candidate et le groupe nominal de la r&#233;ponse, &#233;ventuellement 
s&#233;par&#233;s par d&#8217;autres &#233;l&#233;ments tels que virgules, guillemets, verbe ou pr&#233;position. Le patron 
d&#8217;extraction comporte toujours le focus de la question. Pour pouvoir reconna&#238;tre dans la 
phrase candidate un patron d&#8217;extraction, il faut donc que le focus de la question ait &#233;t&#233; 
pr&#233;alablement d&#233;termin&#233; par le module d&#8217;analyse des questions.  Prenons par exemple la 
question suivante : 
</p>
<p>Question : What do Knight Ridder publish? (Que publie Knight Ridder ?) 
</p>
<p>313 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ferret O., Grau B., Hurault-Plantet M., Illouz G., Monceaux L., Robba I., Vilnat A.  
</p>
<p>Cette question a une structure syntaxique du type : What-do-GN-VB, Knight Ridder &#233;tant le 
groupe nominal (GN) et publish le verbe (VB). Le focus, d&#233;termin&#233; par les r&#232;gles du module 
d&#8217;analyse de la question, est Knight Ridder. 
</p>
<p>Pour ce type de question, un des patrons que nous avons retenu correspond &#224; la s&#233;quence 
grammaticale suivante : 
</p>
<p>GNfocus VB GNr&#233;ponse 
</p>
<p>Le GNfocus est le groupe nominal du focus dans la phrase-r&#233;ponse. Il est suivi d&#8217;un 
s&#233;parateur qui est ici le verbe publish, puis d&#8217;un groupe nominal qui est suppos&#233; contenir la 
r&#233;ponse &#224; la question, appel&#233; GNr&#233;ponse. La r&#233;ponse suivante, r&#233;sultant de l&#8217;application de ce 
patron, a &#233;t&#233; trouv&#233;e dans le corpus : 
</p>
<p>Knight Ridder publishes 30 daily newspapers ... , extraite de la phrase : 
</p>
<p>Knight Ridder publishes 30 daily newspapers, including the Miami Herald and the Philadelphia Inquirer, owns 
and operates eight television stations and is a join venture partner in cable television and newsprint 
manufacturing operations.   
</p>
<p>(Knight Ridder publie 30 quotidiens, dont le Miami Herald et le Philadelphia Inquirer,il poss&#232;de et g&#232;re 8 
cha&#238;nes de t&#233;l&#233;vision et est partie prenante dans des op&#233;rations li&#233;es &#224; la t&#233;l&#233;vision cabl&#233;e et &#224; la fabrication de 
papier journal.)  
</p>
<p>Dans le paragraphe 3.3, nous avons vu qu&#8217;environ 80 cat&#233;gories de questions ont &#233;t&#233; 
r&#233;pertori&#233;es. Parmi celles-ci, 45 n&#8217;attendent pas en r&#233;ponse une entit&#233; nomm&#233;e. Pour chacune 
de ces 45 cat&#233;gories de question, nous avons construit des patrons syntaxiques d&#8217;extraction. 
Les diff&#233;rents patrons, ainsi que les diff&#233;rentes cat&#233;gories de question, ont &#233;t&#233; d&#233;termin&#233;s par 
l&#8217;&#233;tude des corpus de questions et de r&#233;ponses fournis par les campagnes d&#8217;&#233;valuation des 
conf&#233;rences TREC8 et TREC9. En tout, nous avons retenu 24 patrons d&#8217;extraction. Le 
nombre de patrons par cat&#233;gorie de question va de 2 &#224; 20, avec une moyenne de 10 par 
cat&#233;gorie de question. Les diff&#233;rentes cat&#233;gories de questions ont donc plusieurs patrons en 
commun.  
</p>
<p>Les patrons d&#8217;extraction sont plus difficiles &#224; &#233;tablir pour certaines cat&#233;gories de question que 
pour d&#8217;autres. Cela peut &#234;tre en raison de leur raret&#233; dans le corpus ou en raison de la vari&#233;t&#233; 
grammaticale des r&#233;ponses. Les questions de type Why  (Pourquoi), comme Why can&#8217;t 
ostrishes fly ? (Pourquoi les autruches ne peuvent-elles voler ?) sont rares dans le corpus 
(seulement 4) ainsi que les questions en How VB  (Comment Verbe) (4 &#233;galement), comme 
How did Socrates die ? (Comment Socrate est-il mort ?). De plus, les r&#233;ponses &#224; ces questions 
sont difficiles &#224; mod&#233;liser sous la forme d&#8217;un patron syntaxique. Il est difficile &#233;galement de 
trouver des r&#233;gularit&#233;s grammaticales dans les r&#233;ponses aux questions du type What-GN-be-
GN , comme What format was VHS&#8217;s main competition ?  (Quel &#233;tait le principal concurrent 
du format VHS ?) ou encore What nationality was Jackson Pollock ?  (Quelle &#233;tait la 
nationalit&#233; de Jackson Pollock ?). Suivant les cas, c&#8217;est le premier GN (format) ou le 
deuxi&#232;me (Jackson Pollock) qui joue un r&#244;le pr&#233;pond&#233;rant dans le patron d&#8217;extraction. 
</p>
<p>314 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche de la r&#233;ponse fond&#233;e sur la reconnaissance du focus de la question 
</p>
<p>5 Analyse des r&#233;sultats 
</p>
<p>Nous avons r&#233;alis&#233; une &#233;valuation des r&#233;ponses que nous trouvons sur le corpus de la 
conf&#233;rence TREC10, suivant que la question appartient &#224; une cat&#233;gorie d&#233;finie par une entit&#233; 
nomm&#233;e ou non. Cela nous permet d'&#233;valuer ind&#233;pendamment l'un de l'autre le processus de 
localisation de l'entit&#233; nomm&#233;e attendue en r&#233;ponse et le processus qui utilise les patrons 
d'extraction. L&#8217;&#233;valuation a d&#8217;abord &#233;t&#233; faite sur les phrases candidates &#224; la r&#233;ponse puis sur 
les r&#233;ponses &#224; 50 caract&#232;res, afin de mesurer la performance des deux modules constituant la 
recherche de la r&#233;ponse dans les documents s&#233;lectionn&#233;s. Le tableau de la Figure 2 montre 
que QALC a de meilleures performances sur les cat&#233;gories d&#233;finies par une entit&#233; nomm&#233;e. 
En effet, ce type de question comporte en g&#233;n&#233;ral plusieurs termes, ce qui facilite la s&#233;lection 
des phrases candidates par rapport aux questions du type demande de d&#233;finition qui ne 
comportent g&#233;n&#233;ralement qu&#8217;un seul terme. Par ailleurs, l&#8217;extraction de la r&#233;ponse est facilit&#233;e 
par l&#8217;&#233;tiquetage des entit&#233;s nomm&#233;es dans les documents. 
</p>
<p>Questions Nombre de 
questions 
</p>
<p>Nombre de r&#233;ponses 
correctes (phrases) 
</p>
<p>Nombre de r&#233;ponses 
correctes (50 car.) 
</p>
<p>Extraction correcte 
(phrase -&gt; 50 car.) 
</p>
<p>Cat&#233;gorie d&#233;finie par 
une entit&#233; nomm&#233;e 
</p>
<p>229 96 (42 %) 82 (36 %) 85 % 
</p>
<p>Autre cat&#233;gorie 263 103 (39 %) 63 (24 %) 61 % 
</p>
<p>Figure 2 : Les r&#233;ponses suivant la cat&#233;gorie de question 
</p>
<p>QALC a obtenu 0.18 &#224; l&#8217;&#233;valuation TREC10. La version TREC10 du syst&#232;me QALC a 
obtenu de meilleurs r&#233;sultats que la version pr&#233;c&#233;dente pour les cat&#233;gories de question qui ne 
sont pas d&#233;finies par une entit&#233; nomm&#233;e. En effet, on obtient une r&#233;ponse correcte pour 24% 
de ces questions, contre seulement 10% dans la version pr&#233;c&#233;dente. 
</p>
<p>6 Conclusion 
</p>
<p>Le syst&#232;me QALC, que nous venons de d&#233;crire, s&#233;lectionne d&#8217;abord les 10 premi&#232;res phrases 
qui r&#233;pondent &#224; la question pos&#233;e, pour en extraire ensuite une r&#233;ponse pr&#233;cise. Ce principe 
est efficace lorsque les phrases trouv&#233;es ont des poids tr&#232;s diff&#233;rents les uns des autres. Dans 
ce cas, en effet, la r&#233;ponse a de fortes chances de se trouver dans les 10 premi&#232;res phrases 
s&#233;lectionn&#233;es. En revanche, lorsqu&#8217;un grand nombre de phrases ont le m&#234;me poids, la r&#233;ponse 
peut se trouver aussi bien dans l&#8217;une des derni&#232;res phrases que dans la premi&#232;re. C'est plus 
particuli&#232;rement le cas des questions de type d&#233;finition comme Qu&#8217;est-ce qu&#8217;un micron ? , qui 
n'ont qu'un seul terme caract&#233;ristique et n'attendent pas d'entit&#233; nomm&#233;e en r&#233;ponse. Dans ce 
cas, il sera probablement plus efficace d'appliquer les patrons d'extraction &#224; un nombre 
important de phrases, afin de les discriminer par ces patrons et non par les termes. 
</p>
<p>Une autre difficult&#233; que nous avons rencontr&#233;e dans l&#8217;extraction de la r&#233;ponse est la 
constitution  m&#234;me des patrons syntaxiques d&#8217;extraction. Ces patrons &#233;mergent des corpus de 
questions/r&#233;ponses, et n&#233;cessitent donc d&#8217;abord la constitution de grands corpus. Par ailleurs, 
certaines cat&#233;gories de questions se pr&#234;tent moins bien que d&#8217;autres &#224; la d&#233;finition de patrons. 
Pour ces cat&#233;gories, il faudra trouver d&#8217;autres solutions. L&#8217;une d&#8217;entre elles consiste &#224; utiliser 
la hi&#233;rarchie des cat&#233;gories s&#233;mantiques de Wordnet pour les questions dont le type g&#233;n&#233;ral 
</p>
<p>315 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ferret O., Grau B., Hurault-Plantet M., Illouz G., Monceaux L., Robba I., Vilnat A.  
</p>
<p>316 
</p>
<p>de la r&#233;ponse attendue peut &#234;tre d&#233;termin&#233;. En effet, la connaissance du type attendu de la 
r&#233;ponse (lorsqu&#8217;il existe) facilite la recherche de la r&#233;ponse dans la phrase. Actuellement, seul 
le type correspondant &#224; une entit&#233; nomm&#233;e est utilis&#233;, et non le type s&#233;mantique g&#233;n&#233;ral. Par 
exemple, la question What language is mostly spoken in Brazil ? (Quelle langue est la plus 
parl&#233;e au Br&#233;sil ?) attend en r&#233;ponse le nom d&#8217;une langue. Ce type n&#8217;&#233;tant pas &#233;tiquet&#233; dans 
le corpus, QALC ne peut pas le localiser dans les phrases candidates. En revanche, nous 
avons test&#233; l&#8217;utilisation de WordNet pour v&#233;rifier si un mot de la phrase candidate est du type 
langue. En effet, la r&#233;ponse dans notre exemple est  le portugais , qui fait partie des 
hyponymes de langue  dans WordNet. 
</p>
<p>Nous serons donc de plus en plus amen&#233;s &#224; adopter des strat&#233;gies diff&#233;rentes suivant la 
cat&#233;gorie de la question. Nous devrons alors sp&#233;cifier plus pr&#233;cis&#233;ment les cat&#233;gories de 
questions, ainsi que les patrons d'extraction de la r&#233;ponse qui leur sont associ&#233;s afin 
d&#8217;am&#233;liorer l'application de ces patrons. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Alpha S., Dixon P., Liao C., Yang C. (2001), Oracle at TREC10, Actes de TREC10, 419-428. 
</p>
<p>A&#239;t-Mokhtar S. and Chanod J. (1997), Incremental Finite-State Parsing, Actes de ANLP-97. 
</p>
<p>Ferret O., Grau B., Hurault-Plantet M., Illouz G., Jacquemin C. (2001), Document selection 
refinement based on linguistic features for QALC, a question answering system, Actes de 
RANLP 2001. 
</p>
<p>Ferret O., Grau B., Hurault-Plantet M., Monceaux, L., Robba, I., Vilnat, A., (2001), Finding 
an answer based on the question focus, Text retrieval conference, TREC 10. 
</p>
<p>Fellbaum C. (1998), WordNet: An Electronic Lexical Database, MIT Press, Cambridge, MA. 
</p>
<p>Harabagiu S., Moldovan D., Pasca M., Surdeanu M., Mihalcea R., Girju R., Rus V., Lacatusu 
F., Morarescu P., Bunescu R. (2001), Answering complex, list and context questions with 
LCC&#8217;s Question-Answering Server, Actes de TREC10. 
</p>
<p>Hovy E., Hermjakob U., Lin C. (2001), Actes de TREC10, 166-174. 
</p>
<p>Jacquemin, C. (1999), Syntagmatic and paradigmatic representations of term variation, Actes 
de ACL'99, University of Maryland, 341-348. 
</p>
<p>Lehnert W. (1979),The process of question answering, Lawrence Erlbaum Associates, 1979. 
</p>
<p>Schmid H. (1999), Improvements in Part-of-Speech Tagging with an Application To German, 
Dordrecht, Editeurs Armstrong S., Church K.W., Isabelle P., Manzi S., Tzoukermann E., and 
Yarowsky D., Natural Language Processing Using Very Large Corpora, Kluwer Academic 
Publishers. 
</p>
<p>Soubbotin M.M., Soubbotin S.M. (2001), Patterns of Potential Answer expressions as Clues 
to the Right Answers, Actes de TREC10, 175-182. </p>

</div></div>
</body></html>