<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>TALN 2002, Nancy, 24-27 juin 2002
</p>
<p> 
</p>
<p>37
</p>
<p> 
</p>
<p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p> 
</p>
<p>Alain Polgu&#232;re
</p>
<p>OLST &#8212; D&#233;partement de linguistique et de traduction
Universit&#233; de Montr&#233;al
</p>
<p>C. P. 6128, Succ. Centre-Ville
Montr&#233;al (Qu&#233;bec)  H3C 3J7
</p>
<p>Canada
alain.polguere@umontreal.ca
</p>
<p> 
</p>
<p>R&#233;sum&#233; &#8212; Abstract
</p>
<p> 
</p>
<p>Ce tutoriel est une introduction &#224; la mod&#233;lisation lexicographique des liens lexicaux au moyen
des fonctions lexicales de la th&#233;orie Sens-Texte. Il s&#8217;agit donc d&#8217;examiner un sous-ensemble des
t&#226;ches effectu&#233;es en lexicographie formelle bas&#233;e sur la lexicologie explicative et combinatoire.
Plut&#244;t que de viser l&#8217;introduction de toutes les fonctions lexicales identifi&#233;es par la th&#233;orie Sens-
Texte, je vais m&#8217;attacher &#224; introduire la notion de fonction lexicale de fa&#231;on m&#233;thodique, en pr&#233;-
sentant d&#8217;abord les notions linguistiques plus g&#233;n&#233;rales sur lesquelles elle s&#8217;appuie (lexie, pr&#233;-
dicat, actant, d&#233;rivation s&#233;mantique, collocation, etc.). Ce document vise essentiellement &#224;
r&#233;capituler les d&#233;finitions des notions linguistiques qui vont &#234;tre vues dans le tutoriel de fa&#231;on
pratique, par le biais d&#8217;exercices &#224; caract&#232;re lexicographique.
</p>
<p>This tutorial is an introduction to the modeling of lexical relations by means of Meaning-Text
lexical functions. In other words, it presents a specific aspect of formal lexicography as prac-
ticed within the framework of explanatory combinatorial lexicology. Only a subset of Meaning-
Text lexical functions will be introduced. My goal is to methodically presents the notion of lex-
ical function itself, based on the introduction of more general linguistic notions it presupposes
(lexie, actant, semantic derivation, collocation, etc.). The present document summarizes defini-
tions of notions that will be applied in lexicographic exercises during the tutorial.
</p>
<p> 
</p>
<p>Mots cl&#233;s &#8212; Keywords
</p>
<p> 
</p>
<p>Fonction lexicale, lexicologie explicative et combinatoire, th&#233;orie Sens-Texte, lexicographie
formelle.
Lexical function, explanatory combinatorial lexicology, Meaning-Text theory, formal lexicog-
raphy.
</p>
<p> 
</p>
<p>1 Introduction
</p>
<p> 
</p>
<p>L&#8217;identification et la mod&#233;lisation des liens lexicaux sont des t&#226;ches centrales dans un grand
nombre d&#8217;applications de la linguistique, par exemple : lexicographie, construction de lexiques
formels pour le TALN et enseignement des connaissances lexicales (langue maternelle ou lan-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Alain Polgu&#232;re
</p>
<p> 
</p>
<p>38
</p>
<p>gue seconde). On peut appeler 
</p>
<p> 
</p>
<p>lien lexical
</p>
<p> 
</p>
<p> deux types de connexions entre les unit&#233;s lexicales
de la langue :
</p>
<p>1. Liens s&#233;mantiques tr&#232;s g&#233;n&#233;raux de nature paradigmatique appel&#233;s 
</p>
<p> 
</p>
<p>D&#201;RIVATIONS
</p>
<p>S&#201;MANTIQUES
</p>
<p> 
</p>
<p>, par exemple
</p>
<p>- synonymie et quasi-synonymie &#8212; 
</p>
<p> 
</p>
<p>manger 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>ingurgiter
</p>
<p> 
</p>
<p>, 
</p>
<p> 
</p>
<p>comprim&#233; 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>pilule
</p>
<p> 
</p>
<p> ;
- antonymie et quasi-antonymie &#8212; 
</p>
<p> 
</p>
<p>majorit&#233;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>minorit&#233;
</p>
<p> 
</p>
<p>, 
</p>
<p> 
</p>
<p>richesse
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>pauvret&#233;
</p>
<p> 
</p>
<p> ;
- nominalisation &#8212; 
</p>
<p> 
</p>
<p>lourd 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>lourdeur
</p>
<p> 
</p>
<p>, 
</p>
<p> 
</p>
<p>tomber 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>chute
</p>
<p> 
</p>
<p> ;
- noms actanciels &#8212; 
</p>
<p> 
</p>
<p>manger
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>mangeur
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>nourriture
</p>
<p> 
</p>
<p>, 
</p>
<p> 
</p>
<p>livre
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>auteur
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>lecteur
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>&#8764;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>con-
tenu
</p>
<p> 
</p>
<p>.
</p>
<p>2. affinit&#233;s de combinatoire lexicale au sein d&#8217;expressions semi-idiomatiques appel&#233;es 
</p>
<p> 
</p>
<p>COL-
</p>
<p>LOCATIONS
</p>
<p> 
</p>
<p>, par exemple
</p>
<p>- intensificateurs types &#8212; 
</p>
<p> 
</p>
<p>gros
</p>
<p> 
</p>
<p>/
</p>
<p> 
</p>
<p>profond soupir
</p>
<p> 
</p>
<p> ;
- &#171; att&#233;nuateurs &#187; types &#8212; 
</p>
<p> 
</p>
<p>faible
</p>
<p> 
</p>
<p>/
</p>
<p> 
</p>
<p>l&#233;ger soupir
</p>
<p> 
</p>
<p> ;
- verbes supports &#8212; 
</p>
<p> 
</p>
<p>&#233;mettre
</p>
<p> 
</p>
<p>/
</p>
<p> 
</p>
<p>laisser &#233;chapper
</p>
<p> 
</p>
<p>/
</p>
<p> 
</p>
<p>pousser un soupir
</p>
<p> 
</p>
<p> ;
- verbes causatifs &#8212; 
</p>
<p> 
</p>
<p>arracher un soupir &#224; qqn.
</p>
<p> 
</p>
<p>Les 
</p>
<p> 
</p>
<p>FONCTIONS
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>LEXICALES
</p>
<p> 
</p>
<p>, l&#8217;objet de ce tutoriel, sont un outil notionnel extr&#234;mement puissant
pour comprendre, mod&#233;liser, encoder, apprendre et enseigner ces ph&#233;nom&#232;nes. La notion de
</p>
<p> 
</p>
<p>FONCTION
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>LEXICALE
</p>
<p> 
</p>
<p>, &#233;labor&#233;e dans le cadre de la 
</p>
<p> 
</p>
<p>TH&#201;ORIE
</p>
<p> 
</p>
<p> S
</p>
<p> 
</p>
<p>ENS
</p>
<p> 
</p>
<p>-T
</p>
<p> 
</p>
<p>EXTE
</p>
<p> 
</p>
<p>, est maintenant un
concept bien connu en lexicologie, lexicographie et TALN. Elle demeure cependant peu utilis&#233;e
en regard de son int&#233;r&#234;t pratique et th&#233;orique. Ce tutoriel vise &#224; donner un meilleur acc&#232;s &#224; cette
notion que ce qui peut &#234;tre pr&#233;sentement obtenu par la seule &#233;tude des diff&#233;rentes publications
sur le sujet. Il ne s&#8217;adresse pas aux linguistes d&#233;j&#224; familiaris&#233;s avec la th&#233;orie Sens-Texte mais
cherche au contraire &#224; rendre la notion accessible &#224; un public aussi large possible. De plus, il ne
s&#8217;agit pas tant de pr&#233;senter un formalisme que de mettre en &#233;vidence la nature profonde des
fonctions lexicales et donc, de permettre leur utilisation dans des contextes aussi vari&#233;s que la
lexicographie, le TALN ou l&#8217;enseignement des langues.
</p>
<p>La base th&#233;orique sur laquelle repose ce tutoriel, qui se veut surtout orient&#233; vers la pratique lexi-
cographique, est la 
</p>
<p> 
</p>
<p>LEXICOLOGIE
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>EXPLICATIVE
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>ET
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>COMBINATOIRE
</p>
<p> 
</p>
<p>, la branche lexicale de la
th&#233;orie Sens-Texte. Je n&#8217;introduirai que les notions th&#233;oriques dont nous avons besoin ici. Les
deux articles (Mel&#8217;
</p>
<p> 
</p>
<p>&#269;
</p>
<p> 
</p>
<p>uk, 1997) et (Polgu&#232;re, 1998) offrent une introduction g&#233;n&#233;rale &#224; la th&#233;orie
Sens-Texte, sous une forme relativement compacte. On trouvera une introduction d&#233;taill&#233;e &#224; la
lexicologie explicative et combinatoire dans (Mel&#8217;
</p>
<p> 
</p>
<p>&#269;
</p>
<p> 
</p>
<p>uk 
</p>
<p> 
</p>
<p>et al.
</p>
<p> 
</p>
<p>, 1995). Certains passages du pr&#233;-
sent document ont &#233;t&#233; extraits et adapt&#233;s de (Polgu&#232;re, 2000a) et (Polgu&#232;re, &#224; para&#238;tre).
</p>
<p>Le tutoriel est structur&#233; en trois parties : d&#233;finition de certaines notions linguistiques de base
pr&#233;suppos&#233;es par les fonctions lexicales, pr&#233;sentation de la notion de fonction lexicale propre-
ment dite et travail pratique sur un sous-ensemble des fonctions lexicales dites &#171; standard &#187;
identifi&#233;es par la th&#233;orie Sens-Texte.
</p>
<p>&#2;
</p>
<p> 
</p>
<p>L&#8217;approche de l&#8217;&#233;tude du lexique adopt&#233;e ici est purement synchronique : on ne va pas
examiner comment mod&#233;liser les liens lexicaux du point de vue de l&#8217;&#233;volution de la
langue ; la langue est &#233;tudi&#233;e &#224; un moment donn&#233; de son &#233;volution. La langue de r&#233;f&#233;-
rence pour ce tutoriel est le fran&#231;ais contemporain, tel que parl&#233; en France. Mais je</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p> 
</p>
<p>39
</p>
<p>m&#8217;appuierai aussi, bien entendu, sur des exemples emprunt&#233;s &#224; d&#8217;autres langues (no-
tamment l&#8217;anglais) et &#224; des variantes dialectales (fran&#231;ais de France 
</p>
<p> 
</p>
<p>vs
</p>
<p> 
</p>
<p> du Qu&#233;bec, an-
glais britannique 
</p>
<p> 
</p>
<p>vs
</p>
<p> 
</p>
<p> am&#233;ricain).
</p>
<p> 
</p>
<p>2 Quelques notions de s&#233;mantique et de syntaxe n&#233;cessaires &#224; la 
bonne ma&#238;trise des fonctions lexicales
</p>
<p> 
</p>
<p>Il est n&#233;cessaire de d&#233;finir, au besoin approximativement, plusieurs notions linguistiques de
base avant de s&#8217;attaquer au fonctions lexicales proprement dites. Les fonctions lexicales ne peu-
vent &#234;tre comprises en profondeur et, donc, utilis&#233;es de fa&#231;on concr&#232;te avec coh&#233;rence, sans que
l&#8217;on ait d&#233;fini au pr&#233;alable la terminologie de base n&#233;cessaire &#224; l&#8217;&#233;tude du lexique. La situation
est exactement la m&#234;me en syntaxe, par exemple, &#224; la diff&#233;rence pr&#232;s que les notions de base de
syntaxe formelle sont en g&#233;n&#233;ral mieux connues que les notions bases utilis&#233;es en lexicologie
et lexicographie formelles. Notez que je vais profiter de l&#8217;introduction des notions de base pour
pr&#233;senter quelques conventions d&#8217;&#233;criture qui seront utilis&#233;es dans le tutoriel.
</p>
<p> 
</p>
<p>2.1 Lexie, vocable
</p>
<p> 
</p>
<p>On peut consid&#233;rer que chaque langue est constitu&#233;e de deux ensembles de connaissances dis-
tincts. Il y a tout d&#8217;abord le 
</p>
<p> 
</p>
<p>LEXIQUE
</p>
<p> 
</p>
<p>, qui est un ensemble tr&#232;s vaste, &#224; la structure relativement
anarchique et qui peut &#234;tre vu comme le r&#233;pertoire des sens de base de la langue avec leur moyen
d&#8217;expression associ&#233;. Il y a ensuite la 
</p>
<p> 
</p>
<p>GRAMMAIRE
</p>
<p> 
</p>
<p>, qui est un ensemble de taille beaucoup plus
modeste, comportant des r&#232;gles g&#233;n&#233;rales permettant de combiner entre eux les &#233;l&#233;ments du
lexique afin de produire des &#233;nonc&#233;s bien form&#233;s.
</p>
<p>Ce tutoriel s&#8217;int&#233;resse aux liens unissant les &#233;l&#233;ments du lexique entre eux et, &#233;ventuellement,
aux liens unissant les &#233;l&#233;ments du lexique &#224; des expressions &#171; toutes faites &#187; de la langue. Pour
d&#233;signer les &#233;l&#233;ments du lexique, nous n&#8217;utiliserons pas le terme 
</p>
<p> 
</p>
<p>mot
</p>
<p> 
</p>
<p>, qui est trop ambigu et ne
rel&#232;ve pas d&#8217;une terminologie linguistique bien d&#233;finie.
</p>
<p> 
</p>
<p>On appellera 
</p>
<p> 
</p>
<p>UNIT&#201;
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>LEXICALE
</p>
<p> 
</p>
<p>, ou 
</p>
<p> 
</p>
<p>LEXIE
</p>
<p> 
</p>
<p>, un &#233;l&#233;ment de base du lexique. Chaque lexie
de la langue est associ&#233;e &#224; un sens particulier, unique, d&#233;finissable et &#224; un ensemble
</p>
<p> 
</p>
<p>de formes correspondant aux variantes flexionnelles du signifiant de la lexie.
</p>
<p>Je vais toujours &#233;crire en petites majuscules les noms de lexies. Les sens seront donn&#233;s entre
guillemets simples (dits 
</p>
<p> 
</p>
<p>guillemets s&#233;mantiques
</p>
<p> 
</p>
<p>) et les signifiants en italique. Par exemple, on
peut &#233;crire que la lexie 
</p>
<p> 
</p>
<p>CHAT
</p>
<p> 
</p>
<p> &#224; pour sens 
</p>
<p> 
</p>
<p>(
</p>
<p> 
</p>
<p>chat
</p>
<p> 
</p>
<p>)
</p>
<p> 
</p>
<p> = 
</p>
<p> 
</p>
<p>(
</p>
<p> 
</p>
<p>animal domestique de petite taille&#8230;
</p>
<p> 
</p>
<p>)
</p>
<p> 
</p>
<p> et est
associ&#233;e aux signifiants 
</p>
<p> 
</p>
<p>chat
</p>
<p> 
</p>
<p> (singulier de 
</p>
<p> 
</p>
<p>CHAT
</p>
<p> 
</p>
<p>) et 
</p>
<p> 
</p>
<p>chats
</p>
<p> 
</p>
<p> (pluriel).
</p>
<p>Les m&#234;mes signifiants sont tr&#232;s souvent utilis&#233;s dans la langue en association avec plus d&#8217;une
seule lexie. Il servent &#224; exprimer des sens lexicaux li&#233;s de fa&#231;on m&#233;taphorique, m&#233;tonymique,
etc. :
</p>
<p> 
</p>
<p>Un 
</p>
<p> 
</p>
<p>VOCABLE
</p>
<p> 
</p>
<p> est un ensemble de lexies associ&#233;es aux m&#234;mes signifiants et dont les
</p>
<p> 
</p>
<p>sens pr&#233;sentent une intersection non triviale.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Alain Polgu&#232;re
</p>
<p> 
</p>
<p>40
</p>
<p>Dans les dictionnaires, dans les travaux de recherche en lexicologie et lexicographie, etc., il est
de coutume de num&#233;roter les lexies d&#8217;un m&#234;me vocable. Par exemple, le 
</p>
<p> 
</p>
<p>Nouveau Petit Robert
</p>
<p> 
</p>
<p>d&#233;crit le vocable fran&#231;ais 
</p>
<p> 
</p>
<p>PORC
</p>
<p> 
</p>
<p> comme &#233;tant constitu&#233; de quatre lexies : 
</p>
<p> 
</p>
<p>PORC
</p>
<p> 
</p>
<p>1
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>(
</p>
<p> 
</p>
<p>animal domes-
tique &#8230;
</p>
<p> 
</p>
<p>)
</p>
<p> 
</p>
<p>, 
</p>
<p> 
</p>
<p>PORC
</p>
<p> 
</p>
<p>2
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>(
</p>
<p> 
</p>
<p>individu sale &#8230;
</p>
<p> 
</p>
<p>)
</p>
<p> 
</p>
<p>, PORC3 (viande de porc1 &#8230;) et PORC4 (peau du porc1 &#8230;).
</p>
<p>Les lexies d&#8217;un vocable sont souvent appel&#233;es ACCEPTIONS de ce vocable. La POLYS&#201;MIE est la
propri&#233;t&#233; d&#8217;un vocable donn&#233; telle qu&#8217;il contient plus d&#8217;une lexie. Ainsi, le vocable PORC est
polys&#233;mique, comme nous venons de le voir, alors que le vocable PHACOCH&#200;RE (pour rester
dans le m&#234;me domaine) est monos&#233;mique. 
</p>
<p>Il peut arriver que deux lexies distinctes soient associ&#233;es aux m&#234;mes signifiants alors qu&#8217;elles
n&#8217;entretiennent aucune relation de sens ; il s&#8217;agit d&#8217;un cas d&#8217;HOMONYMIE. Les dictionnaires dis-
tinguent fr&#233;quemment les lexies homonymes par des num&#233;ros mis en exposant, et c&#8217;est aussi la
notation adopt&#233;e en lexicologie explicative et combinatoire. Par exemple :
</p>
<p>ADRESSE1 [Il fait preuve de beaucoup d&#8217;adresse.]
~
ADRESSE2 [Est-ce que tu connais son adresse en France ?]
</p>
<p>L&#8217;approche adopt&#233;e pour le tutoriel &#233;tant synchronique (voir ci-dessus, page 38), nous devons
nous baser sur la pr&#233;sence ou l&#8217;absence d&#8217;un lien s&#233;mantique en fran&#231;ais (en anglais, etc.) con-
temporain pour d&#233;cider si nous sommes en pr&#233;sence d&#8217;homonymes ou de lexies d&#8217;un m&#234;me vo-
cable. S&#8217;il existe un lien &#233;tymologique mais que ce lien n&#8217;est plus concr&#233;tis&#233; par une relation de
sens couramment per&#231;ue par les locuteurs, nous devrons l&#8217;ignorer.
</p>
<p>&#3; Il existe des techniques permettant d&#8217;identifier les acceptions d&#8217;un vocable dans un
corpus. Nous allons les examiner en faisant quelques exercices pratiques d&#8217;analyse de
corpus.
</p>
<p>2.2 Pr&#233;dicat s&#233;mantique, actant s&#233;mantique et syntaxique
</p>
<p>On peut consid&#233;rer que les sens lexicaux se divisent en deux grandes classes : pr&#233;dicats s&#233;-
mantiques vs objets s&#233;mantiques.
</p>
<p>Les PR&#201;DICATS S&#201;MANTIQUES sont des sens de lexies qui d&#233;notent des faits ou des en-
tit&#233;s impliquant au moins un &#171; participant &#187; appel&#233; ACTANT S&#201;MANTIQUE. Les actants
sont habituellement d&#233;sign&#233;s par des variables du type X, Y, Z, etc. &#8212; (X mange Y),
(X donne Y &#224; Z), ([X est] petit), (amour de X pour Y), &#8230;
</p>
<p>On associe g&#233;n&#233;ralement les lexies pr&#233;dicatives &#224; des faits (actions, &#233;v&#233;nements, &#233;tats, etc.). Il
est cependant tr&#232;s important de garder &#224; l&#8217;esprit qu&#8217;elles peuvent aussi d&#233;noter des entit&#233;s. Ain-
si, la lexie NEZ [Il a un tout petit nez.], comme toutes les lexies d&#233;notant des parties du corps, est un
exemple de lexie pr&#233;dicative d&#233;notant une entit&#233; (et non un fait). Un nez est n&#233;cessairement le
nez de quelqu&#8217;un et la mention de la personne &#224; qui appartient le nez &#8212; le nez de Cl&#233;op&#226;tre &#8212;
permet d&#8217;exprimer l&#8217;actant s&#233;mantique de ce pr&#233;dicat (un participant n&#233;cessaire de la situation
&#171; avoir un nez &#187;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>41
</p>
<p>Les OBJETS S&#201;MANTIQUES sont des sens de lexies qui d&#233;notent des entit&#233;s n&#8217;impli-
quant intrins&#232;quement aucun participant &#8212; (tomate), (sable), (&#201;mile Zola), &#8230;
</p>
<p>Les pr&#233;dicats s&#233;mantiques types sont des verbes. En fait, un verbe est n&#233;cessairement un pr&#233;di-
cat s&#233;mantique. Cependant, les adjectifs et les adverbes sont eux aussi des pr&#233;dicats. Des lexies
comme GROGNON ou M&#201;CHAMMENT signifient n&#233;cessairement ([quelqu&#8217;un est] grognon) et ([quel-
que chose est fait] m&#233;chamment).
</p>
<p>On voit donc que le fait d&#8217;&#234;tre un pr&#233;dicat est une propri&#233;t&#233; s&#233;mantique de ces trois parties du
discours. Cependant, les noms peuvent aussi &#234;tre des pr&#233;dicats ; ils le sont m&#234;me tr&#232;s fr&#233;quem-
ment. Ainsi, lorsqu&#8217;on emploie la lexie AMOUR, on sous-entend, voir (1a) ci-dessous, ou on ex-
prime explicitement, voir (1b), deux actants de ce pr&#233;dicat : celui qui &#233;prouve de l&#8217;amour et la
personne pour laquelle ce sentiment est &#233;prouv&#233; :
</p>
<p>(1) a. C&#8217;est un amour platonique.
</p>
<p>b. L&#8217;amour de L&#233;once pour Justine est platonique.
</p>
<p>M&#234;me si ni L&#233;once ni Justine ne sont mentionn&#233;s dans (1a), on sait que deux &#171; participants &#187;
sont n&#233;cessairement impliqu&#233;s dans la situation dont il est question. Cette information nous est
communiqu&#233;e par le sens m&#234;me du lex&#232;me AMOUR, dont une caract&#233;ristique est d&#8217;&#234;tre un pr&#233;-
dicat &#224; deux actants. On peut ainsi contraster (amour) avec un autre pr&#233;dicat nominal, &#224; quatre
actants celui-l&#224; :
</p>
<p>(2) a. La vente a eu lieu dans la matin&#233;e.
</p>
<p>b. La vente par l&#8217;agence[= X] de la maison[= Y] au client impatient[= Z] pour une somme 
astronomique[= W] a eu lieu dans la matin&#233;e.
</p>
<p>&#2; Il est impossible de d&#233;crire correctement une lexie sans consid&#233;rer sa nature de pr&#233;dicat
s&#233;mantique. Cela concerne tous les aspects de la caract&#233;risation de la lexie : sens, com-
portement dans la phrase, etc. Notamment, il est impossible de bien mod&#233;liser les re-
lations lexicales sans avoir effectu&#233; un minimum d&#8217;analyse s&#233;mantique des lexies
concern&#233;es. L&#8217;outil des fonctions lexicales nous force &#224; effectuer cette analyse s&#233;-
mantique lexicale, tout en nous aidant, de fa&#231;on parall&#232;le, &#224; mener &#224; bien cette analyse.
</p>
<p>Cet aspect crucial du fonctionnement et de l&#8217;utilisation des fonctions lexicales va peu &#224; peu
s&#8217;&#233;claircir, au fur et &#224; mesure que nous progresserons dans le tutoriel.
</p>
<p>Notons finalement que, dans la th&#233;orie Sens-Texte, les liens qui unissent un pr&#233;dicat &#224; ses ac-
tants sont simplement distingu&#233;s par une num&#233;rotation, en chiffres arabes. On n&#8217;utilise pas de
marqueurs de r&#244;le s&#233;mantique (du type &#171; agent &#187;, &#171; patient &#187;, etc.) dans la mesure o&#249; la relation
entre le pr&#233;dicat et ses actants est mod&#233;lis&#233;e d&#8217;une autre fa&#231;on, beaucoup plus compl&#232;te : dans
la d&#233;finition lexicographique (voir Section 2.5 ci-dessous), qui explicite les liens simplement
d&#233;sign&#233;s dans le reste de l&#8217;article de dictionnaire au moyen de chiffres. Les structures s&#233;-
mantiques associ&#233;es aux lexies des exemples (1a-b) et (2a-b) ci-dessus sont donc :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>42
</p>
<p>2.3 Diath&#232;se d&#8217;une lexie
</p>
<p>La th&#233;orie Sens-Texte appelle ACTANT SYNTAXIQUES d&#8217;une lexie les &#233;l&#233;ments de la
phrase dont l&#8217;emploi est r&#233;gi par la lexie. La DIATH&#200;SE d&#8217;une lexie, quant &#224; elle, est la
correspondance entre les actants s&#233;mantiques et les actants syntaxiques de cette lexie.
</p>
<p>Ceci est une caract&#233;risation extr&#234;mement simplifi&#233;e des notions d&#8217;actant syntaxique et de dia-
th&#232;se. Je ne vais pas entrer dans le d&#233;tail de la pr&#233;sentation de ces notions. Elles rel&#232;vent d&#8217;un
cours de syntaxe et l&#8217;approche syntaxique Sens-Texte, qui s&#8217;appuie sur la SYNTAXE DE D&#201;-
PENDANCE telle que th&#233;oris&#233;e dans (Tesni&#232;re, 1959), a &#233;t&#233; introduite l&#8217;ann&#233;e derni&#232;re dans un
tutoriel de cette m&#234;me conf&#233;rence (Kahane, 2001). Je vais me contenter de donner ici quelques
exemples.
</p>
<p>La diath&#232;se d&#8217;une lexie peut se repr&#233;senter au moyen de tableaux, appel&#233;s TABLEAUX DE R&#201;GI-
ME, montrant explicitement la correspondance entre les actants s&#233;mantiques, les actants syntaxi-
ques dits &#171; profonds &#187; &#8212; num&#233;rot&#233;s au moyen de chiffres romains &#8212; et leur r&#233;alisation dans la
phrase &#224; un niveau syntaxique de surface. La num&#233;rotation des actants syntaxiques refl&#232;te la
hi&#233;rarchie relative des structures r&#233;gies.Ainsi, l&#8217;actant syntaxique d&#8217;un verbe qui correspond au
sujet est num&#233;rot&#233; I, le premier compl&#233;ment d&#8217;objet (direct ou indirect) est num&#233;rot&#233; II, etc.
</p>
<p>Voici les tableaux de r&#233;gime des lexies AIMER et VENTE :
</p>
<p>Figure 1 : R&#233;gime de AIMER
</p>
<p>Figure 2 : R&#233;gime de VENTE
</p>
<p>X = I Y = II
</p>
<p>1. N 1. N
</p>
<p>X = I Y = II Z = III W = IV
</p>
<p>1. de N
</p>
<p>2. par N
</p>
<p>3. Aposs
</p>
<p>1. de N
</p>
<p>2. Aposs
</p>
<p>1. &#224; N 1. pour N
</p>
<p>2. d&#8217;un montant de N
</p>
<p>(amour)
&#186;
</p>
<p>&#186;
(X)
</p>
<p>&#186;
(Y)
</p>
<p>21
</p>
<p>(vente)
&#186;
</p>
<p>&#186;
(X)
</p>
<p>&#186;
(Z)
</p>
<p>31 2
</p>
<p>&#186;
(Y)
</p>
<p>&#186;
(W)
</p>
<p>4</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>43
</p>
<p>Il existe bien entendu plusieurs lexies AIMER et plusieurs lexies VENTE ; en d&#8217;autres termes, les
vocables AIMER et VENTE sont polys&#233;miques. N&#233;anmoins, je ne distinguerai pas les lexies au
moyen d&#8217;une num&#233;rotation lorsque cela ne sera pas pertinent pour la discussion.
</p>
<p>La correspondance entre actants s&#233;mantiques et actants syntaxiques n&#8217;est pas toujours aussi di-
recte que dans les deux exemples qui viennent d&#8217;&#234;tre donn&#233;s. Notamment, une m&#234;me lexie peut
avoir plus d&#8217;un r&#233;gime, comme dans le cas suivant :
</p>
<p>Figure 3 : R&#233;gimes de AMOUR
</p>
<p>2.4 Paraphrase et sens
</p>
<p>Deux expressions linguistiques ayant (approximativement) le m&#234;me sens sont appel&#233;es des PA-
RAPHRASES. Il n&#8217;y a pratiquement pas d&#8217;autre fa&#231;on naturelle de proc&#233;der pour d&#233;crire le sens
que de faire appel &#224; des paraphrases. C&#8217;est d&#8217;ailleurs ainsi que fonctionnent les d&#233;finitions de la
plupart des dictionnaires. Cela nous am&#232;ne &#224; d&#233;finir le sens linguistique de la fa&#231;on suivante :
</p>
<p>Le SENS d&#8217;une expression linguistique est la seule propri&#233;t&#233; qu&#8217;elle partage avec toutes
ses paraphrases.
</p>
<p>Cette d&#233;finition pourrait para&#238;tre circulaire dans la mesure o&#249; elle revient grosso modo &#224; dire
que le sens d&#8217;une expression linguistique est la seule propri&#233;t&#233; que partage cette expression avec
toutes les autres expressions ayant le m&#234;me sens. Cependant, cette circularit&#233; n&#8217;est
qu&#8217;apparente : avoir le m&#234;me sens (ou &#234;tre une paraphrase) est, comme &#234;tre grammaticalement
correct, un concept primitif (c&#8217;est-&#224;-dire, ind&#233;finissable) de la langue. En tant que locuteurs du
fran&#231;ais, nous pouvons imm&#233;diatement dire si les trois phrases fran&#231;aises (3a-c) ci-dessous sont
des paraphrases &#8212; si elles ont le m&#234;me sens &#8212;, et cela sans avoir besoin de suivre un cours de
linguistique :
</p>
<p>(3) a. Je pense donc je suis.
</p>
<p>b. Le fait que je pense d&#233;montre que j&#8217;existe.
</p>
<p>c. Ma pens&#233;e est la preuve de mon existence.
</p>
<p>Une des caract&#233;ristiques de la langue, qui l&#8217;oppose &#224; bien des syst&#232;mes s&#233;miotiques
&#171; artificiels &#187; comme la logique formelle, les langages de programmation, etc., est d&#8217;offrir &#224; la
personne qui l&#8217;emploie un tr&#232;s grand nombre d&#8217;options plus ou moins &#233;quivalentes pour expri-
mer un contenu donn&#233;. La relation de paraphrase est en quelque sorte une donn&#233;e premi&#232;re du
</p>
<p>R&#233;gime 1 R&#233;gime 2
</p>
<p>X = I Y = II X+Y = I
</p>
<p>1. de N
</p>
<p>2. Aposs
</p>
<p>1. envers N
</p>
<p>2. pour N
</p>
<p>1. de N et N
</p>
<p>2. entre N et N
</p>
<p>3. Aposs</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>44
</p>
<p>sens, quelque chose que nous n&#8217;allons pas d&#233;finir mais que nous prendrons comme un concept
primitif permettant de d&#233;finir la notion de sens elle-m&#234;me.
</p>
<p>Le lien de paraphrase est cependant de nature tr&#232;s complexe, m&#234;me si sa perception par le locu-
teur se fait de fa&#231;on instantan&#233;e. Il faut notamment distinguer la paraphrase exacte, qui est fina-
lement assez difficile &#224; obtenir, et diff&#233;rentes vari&#233;t&#233;s de paraphrases approximatives. Le lien
de paraphrase renvoie en fait &#224; un continuum ; c&#8217;est ce qu&#8217;illustrent les exemples suivants, o&#249;
se manifeste un &#233;cart s&#233;mantique croissant par rapport &#224; la phrase de r&#233;f&#233;rence (4a) :
</p>
<p>(4) a. Cette pierre est tr&#232;s lourde.
</p>
<p>b. Cette pierre p&#232;se tr&#232;s lourd.
</p>
<p>c. Le poids de cette pierre est &#233;lev&#233;.
</p>
<p>d. Cette pierre est difficile &#224; transporter.
</p>
<p>La phrase (4b) peut &#234;tre consid&#233;r&#233;e comme une paraphrase exacte de (4a), le remplacement de
&#202;TRE par PESER n&#8217;introduisant aucune nuance de sens. Par comparaison, (4c) s&#8217;&#233;carte l&#233;g&#232;re-
ment du sens initial, notamment parce que la structure de la seconde phrase, o&#249; POIDS est le sujet
grammatical et &#201;LEV&#201; attribut, diminue l&#8217;importance de PIERRE, qui &#233;tait sujet dans la premi&#232;re
phrase : (4a) dit quelque chose &#224; propos d&#8217;une pierre alors que (4c) dit quelque chose &#224; propos
du poids de cette pierre. Bien entendu, il est clair que ce sont les m&#234;mes informations qui sont
communiqu&#233;es, et donc que l&#8217;on a bien affaire &#224; deux paraphrases. Mais une nuance existe tout
de m&#234;me au niveau de la fa&#231;on dont l&#8217;information communiqu&#233;e est &#171; emball&#233;e &#187; dans la phra-
se. On dira que (4a) et (4c) n&#8217;ont pas la m&#234;me STRUCTURE COMMUNICATIVE. La notion de struc-
ture communicative est &#233;tudi&#233;e en d&#233;tail dans le cadre de la th&#233;orie Sens-Texte dans (Mel&#8217;&#269;uk,
2001). Finalement, on remarque que la phrase (4d) n&#8217;est pas d&#233;j&#224; plus une paraphrase linguisti-
que v&#233;ritable de (4a) ; on pourrait la consid&#233;rer comme &#233;tant une paraphrase &#171; conceptuelle &#187;.
</p>
<p>Si j&#8217;ai introduit ici la notion de paraphrase c&#8217;est d&#8217;une part parce qu&#8217;elle est au c&#339;ur de la mo-
d&#233;lisation du sens et, d&#8217;autre part, parce que les fonctions lexicales sont, justement, des outils
descriptifs permettant de mod&#233;liser de fa&#231;on &#233;l&#233;gante les choix paraphrastiques qui s&#8217;offrent au
locuteur lorsqu&#8217;il veut exprimer un message donn&#233;.
</p>
<p>2.5 D&#233;finition lexicale par genre prochain et diff&#233;rences sp&#233;cifiques
</p>
<p>Les sens lexicaux sont d&#233;crits en lexicologie explicative et combinatoire au moyen de d&#233;fini-
tions lexicographiques pr&#233;sentant les trois caract&#233;ristiques suivantes :
</p>
<p>1. elles proposent une paraphrase du sens de la lexie d&#233;finie ;
</p>
<p>2. elles sont constitu&#233;es de sens lexicaux plus simples que celui de la lexie d&#233;finie ;
</p>
<p>3. elles ont une composante s&#233;mantique centrale appel&#233;e GENRE PROCHAIN &#8212; qui est en
quelque sorte une paraphrase approximative minimale du sens de la lexie d&#233;finie &#8212; et
des composantes s&#233;mantiques p&#233;riph&#233;riques appel&#233;es DIFF&#201;RENCES SP&#201;CIFIQUES &#8212; qui
correspondent aux composantes s&#233;mantiques sp&#233;cifiques au sens de la lexie d&#233;finie.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>45
</p>
<p>La derni&#232;re caract&#233;ristique mentionn&#233;e ci-dessus donne son nom au type de d&#233;finition en
question : la D&#201;FINITION PAR GENRE PROCHAIN ET DIFF&#201;RENCES SP&#201;CIFIQUES, que l&#8217;on peut
aussi appeler D&#201;FINITION ANALYTIQUE. Cette terminologie est tr&#232;s ancienne puisqu&#8217;elle pro-
vient du Livre V de l&#8217;Organon d&#8217;Aristote : Les Topiques.
</p>
<p>La d&#233;finition (5a) ci-dessous est une d&#233;finition analytique telle qu&#8217;on pourrait la trouver dans
un dictionnaire comme le Nouveau Petit Robert. Par contraste, (5b) est, plut&#244;t qu&#8217;une d&#233;finition,
une simple &#233;num&#233;ration de synonymes approximatifs :
</p>
<p>(5) a. LABEUR travail[genre prochain] long et p&#233;nible[diff. sp&#233;cifiques]
</p>
<p>b. LABEUR travail, corv&#233;e, besogne.
</p>
<p>La plupart des dictionnaires de langue proposent des d&#233;finitions analytiques, mais ils ne le font
pas toujours de fa&#231;on syst&#233;matique. Dans la pratique, il faut &#234;tre capable d&#8217;&#233;baucher des d&#233;fini-
tions lexicales analytiques pour bien mod&#233;liser les relations de fonction lexicale, qui, comme
nous le verrons bient&#244;t, sont toutes ancr&#233;es dans le contenu s&#233;mantique de la lexie.
</p>
<p>&#3; Nous allons faire rapidement une &#233;bauche de d&#233;finition lexicale analytique en tentant
de proc&#233;der par &#233;tapes logiques : 1) identification de la nature pr&#233;dicative de la lexie,
2) identification du genre prochain, 3) caract&#233;risation s&#233;mantique des actants, 4) iden-
tification des diff&#233;rences sp&#233;cifiques et 5) validation de la d&#233;finition.
</p>
<p>2.6 Idiomaticit&#233;
</p>
<p>En th&#233;orie, les &#233;nonc&#233;s ob&#233;issent au principe dit de COMPOSITIONALIT&#201; S&#201;MANTIQUE voulant
que le sens d&#8217;un &#233;nonc&#233; soit la r&#233;sultante de la composition du sens des &#233;l&#233;ments qui le consti-
tuent. Ce principe rend compte du fait que le sens d&#8217;une phrase comme
</p>
<p>(6) Les invit&#233;s sont arriv&#233;s.
</p>
<p>est directement calculable &#224; partir du sens de chacune des lexies qui le composent. Pour pouvoir
calculer le sens de la phrase (6), il suffit de conna&#238;tre :
</p>
<p>&#8226; le sens des lexies LE, INVIT&#201;, ARRIVER ;
</p>
<p>&#8226; les sens grammaticaux de pluriel et de pass&#233; ;
</p>
<p>&#8226; les r&#232;gles grammaticales du fran&#231;ais.
</p>
<p>Les &#233;nonc&#233;s sont cependant truff&#233;s de cas qui contredisent ce principe g&#233;n&#233;ral et qui manifestent
d&#8217;une fa&#231;on ou d&#8217;une autre une certaine IDIOMATICIT&#201;. L&#8217;idiomaticit&#233;, qui est une transgression
du principe de compositionalit&#233; s&#233;mantique, est un ph&#233;nom&#232;ne graduel, comme l&#8217;illustre la s&#233;-
rie d&#8217;exemples ci-dessous, o&#249; les expressions qui nous int&#233;ressent sont en gras :
</p>
<p>(7) Sylvain a lev&#233; le rocher avec un treuil.
</p>
<p>Expression respectant enti&#232;rement le principe de compositionalit&#233; s&#233;mantique. C&#8217;est une
EXPRESSION LIBRE.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>46
</p>
<p>(8) Le chien a lev&#233; la patte en passant pr&#232;s du r&#233;verb&#232;re.
</p>
<p>Expression quasi fig&#233;e signifiant (uriner en levant la patte). Elle est mod&#233;lis&#233;e en tant que
lexie dans la th&#233;orie Sens-Texte sous le nom de QUASI-PHRAS&#200;ME. Dire qu&#8217;une telle ex-
pression est une lexie implique qu&#8217;elle doit poss&#233;der sa propre entr&#233;e dans le dictionnaire
de la langue.
</p>
<p>(9) Sylvain a lev&#233; la s&#233;ance.
</p>
<p>Expression linguistique semi-idiomatique non lexicalis&#233;e, appel&#233;e collocation ou semi-
phras&#232;me. Les collocations sont pr&#233;sent&#233;es plus en d&#233;tail dans la Section 3.1.2 ci-dessous.
</p>
<p>(10) Sylvain travaille trop. Il devrait lever le pied un peu.
</p>
<p>C&#8217;est une EXPRESSION FIG&#201;E, c&#8217;est-&#224;-dire enti&#232;rement non compositionelle, signifiant
(ralentir, en faire moins). Les expression fig&#233;es sont des lexies de la langue et doivent &#234;tre
d&#233;crites comme telles. Elles sont appel&#233;es LOCUTION dans la terminologie traditionnelle
(locution verbale, nominale, etc.) et PHRAS&#200;ME COMPLET dans le cadre de la th&#233;orie Sens-
Texte. Noter qu&#8217;une lexie qui n&#8217;est pas phras&#233;mique, c&#8217;est-&#224;-dire qui est formellement
constitu&#233;e d&#8217;un seul &#233;l&#233;ment lexical (CHAT, ADRESSE1, ADRESSE2, AIMER, etc.) est appel&#233;e
LEX&#200;ME. Lorsque l&#8217;on parle de lexie, on a souvent tendance &#224; ne penser, par d&#233;faut,
qu&#8217;aux lex&#232;mes. Cependant, les phras&#232;mes sont en nombre consid&#233;rable dans toute lan-
gue naturelle. Leur description, dans les dictionnaires de langue courants, est malheureu-
sement souvent ench&#226;ss&#233;e dans l&#8217;entr&#233;e d&#8217;un des &#233;l&#233;ments lexicaux les constituant.
</p>
<p>&#2; Les noms de lexies qui sont des quasi-phras&#232;mes ou des phras&#232;mes complets (locu-
tions) seront &#233;crits en petites majuscules (comme pour toutes les lexies), encadr&#233;s par
des coins relev&#233;s : kLEVER LA PATTE l et kLEVER LE PIED l. Noter qu&#8217;il serait incorrect
d&#8217;&#233;crire *kLEVER LA S&#201;ANCE l puisqu&#8217;une telle lexie n&#8217;existe pas : seule existe l&#8217;expres-
sion semi-idiomatique &#8212; la collocation &#8212; lever la s&#233;ance. On trouvera dans (Mel&#8217;&#269;uk,
1995) une pr&#233;sentation d&#233;taill&#233;e des diff&#233;rents types de phras&#232;mes en langue.
</p>
<p>Nous en avons termin&#233; avec la pr&#233;sentation des notions linguistiques dont la ma&#238;trise est pr&#233;-
suppos&#233;e par la notion de fonction lexicale. Nous pouvons maintenant entrer dans le vif du sujet.
</p>
<p>3 La notion de fonction lexicale
</p>
<p>Pour pr&#233;senter les FONCTIONS LEXICALES (dor&#233;navant FL), je vais commencer par introduire
plus pr&#233;cis&#233;ment les deux types de ph&#233;nom&#232;nes qu&#8217;elles permettent de mod&#233;liser : les d&#233;riva-
tions s&#233;mantiques et les collocations (dont la pr&#233;sentation vient d&#8217;&#234;tre &#233;bauch&#233;e). Nous passe-
rons ensuite &#224; la d&#233;finition pr&#233;cise de la notion de FL, puis examinerons le langage formel
d&#8217;encodage des liens de FL.
</p>
<p>3.1 Les liens lexicaux : d&#233;rivation s&#233;mantique vs lien collocationnel
</p>
<p>3.1.1 Les d&#233;rivations s&#233;mantiques
</p>
<p>Les d&#233;rivations s&#233;mantiques sont des LIENS PARADIGMATIQUES entre lexies :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>47
</p>
<p>La lexie L2 est un D&#201;RIV&#201; S&#201;MANTIQUE de la lexie L1 si L1 et L2 sont li&#233;es par une
relation s&#233;mantique r&#233;currente en langue.
</p>
<p>On peut identifier trois grandes classes de d&#233;rivations s&#233;mantiques :
</p>
<p>1. La relation s&#233;mantique entre L1 et L2 peut &#234;tre l&#8217;&#233;galit&#233; exacte ou approximative, ce qui
est un cas un peu extr&#234;me de d&#233;rivation s&#233;mantique. Il s&#8217;agit ici notamment des synony-
mes ou, plus fr&#233;quemment, des quasi-synonymes : COMPLIMENT &#8764; &#201;LOGE. Entrent aussi
dans cette classe les conversifs &#8212; DONNER &#8764; RECEVOIR &#8212;, les nominalisations &#8212;
REGRETTER &#8764; REGRET &#8212;, verbalisations, adjectivisations et adverbialisations, ainsi que
les termes g&#233;n&#233;riques &#8212; SENTIMENT pour COL&#200;RE.
</p>
<p>2. L1 et L2 peuvent avoir des sens oppos&#233;s : ce sont des (quasi-)antonymes &#8212; GRAND &#8764;
PETIT.
</p>
<p>3. Finalement, L2 peut d&#233;noter un &#233;l&#233;ment de la situation d&#233;not&#233;e par L1 : un participant &#8212;
VENDEUR pour VENDRE &#8212;, un circonstant &#8212; ARME [du crime] pour CRIME &#8212;, ou une
caract&#233;ristique d&#8217;un participant/circonstant &#8212; SOUP&#199;ONNEUX [= (qui tend &#224; soup&#231;onner)]
pour SOUP&#199;ONNER.
</p>
<p>On doit employer ici le terme sp&#233;cifique de d&#233;rivation s&#233;mantique pour &#233;viter la confusion avec
l&#8217;interpr&#233;tation courante du terme d&#233;rivation, qui implique g&#233;n&#233;ralement une relation morpho-
logique entre lexies. La d&#233;rivation s&#233;mantique couvre un &#233;ventail beaucoup plus large de rela-
tions paradigmatiques entre lexies puisque L1 et L2 ne doivent pas n&#233;cessairement &#234;tre li&#233;es
morphologiquement pour qu&#8217;existe entre elles un lien de d&#233;rivation s&#233;mantique (voir, par exem-
ple, TOMBER et sa nominalisation &#171; suppl&#233;tive &#187; CHUTE).
</p>
<p>3.1.2 Les liens collocationnels
</p>
<p>La notion de collocation a &#233;t&#233; &#233;tudi&#233;e dans un des tutoriels de TALN 2001 (Daille, 2001) et
(Williams, 2001). Il importe de noter que je ne consid&#232;re ici que la notion de collocation telle
que d&#233;finie dans le cadre de la th&#233;orie Sens-Texte. En effet, on trouve dans la litt&#233;rature le terme
collocation utilis&#233; pour d&#233;noter au moins deux notions assez distinctes.
</p>
<p>1. Tout d&#8217;abord, la collocation est fr&#233;quemment d&#233;finie sur une base statistique : une com-
binaison de mots dont la fr&#233;quence d&#8217;occurrence dans les corpus est significativement
&#233;lev&#233;e. Selon cette d&#233;finition, qui tire son origine d&#8217;une interpr&#233;tation strictement quanti-
tative de la notion propos&#233;e par (Firth, 1957), une expression telle que manger un g&#226;teau
pourrait &#234;tre consid&#233;r&#233;e comme &#233;tant un meilleur candidat au statut de collocation que
manger un coup, si les mesures statistiques d&#233;montrent que, proportionnellement, man-
ger tend &#224; appara&#238;tre plus fr&#233;quemment des les corpus de r&#233;f&#233;rence avec g&#226;teau qu&#8217;avec
coup. Or, dans le cadre de la lexicologie explicative et combinatoire, les mesures statisti-
ques peuvent aider &#224; rep&#233;rer les collocations mais elles ne sont pas d&#233;finitoires. Sans
qu&#8217;il soit n&#233;cessaire de faire de calculs statistiques, on dira que manger un g&#226;teau est une</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>48
</p>
<p>expression libre alors que manger un coup est une collocation mettant en jeu la FL
Oper2 :
</p>
<p>Oper2(coup) = recevoir, fam encaisser, fam manger [ART ~].
</p>
<p>2. Dans le cadre de la lexicologie explicative et combinatoire, la d&#233;finition de la notion de
collocation ne fait donc pas r&#233;f&#233;rence &#224; la fr&#233;quence d&#8217;apparition d&#8217;une expression mais
1) &#224; la fa&#231;on dont elle est &#171; fabriqu&#233;e &#187; par le locuteur et 2) &#224; sa nature semi-
idiomatique :
</p>
<p>L&#8217;expression AB (ou BA), form&#233;e des lexies A et B, est une COLLOCATION si la lexie
A est s&#233;lectionn&#233;e librement &#8212; strictement d&#8217;apr&#232;s son sens (A) &#8212;,   alors que la lexie
B est s&#233;lectionn&#233;e pour exprimer un sens (C) en fonction de A. Dans un tel cas, on dira
qu&#8217;il existe un lien collocationnel allant de A &#224; B.
</p>
<p>Voici quelques exemples de collocations en fran&#231;ais :
</p>
<p>(11) a. grosse[= B] temp&#234;te[= A]
</p>
<p>b. dormir[= A] profond&#233;ment[= B]
</p>
<p>c. pleuvoir[= A] des cordes[= B]
</p>
<p>Une collocation est contr&#244;l&#233;e par l&#8217;&#233;l&#233;ment qui retient son sens dans la collocation et qui est
choisi librement : il s&#8217;agit de la BASE de la collocation. Dans les exemples ci-dessus, les bases
des collocations sont les &#233;l&#233;ments &#233;tiquet&#233;s A. Les &#233;l&#233;ments &#233;tiquet&#233;s B sont appel&#233;s COLLOCA-
TIFS. Pour m&#233;moire, notons que les trois collocations ci-dessus s&#8217;analysent au moyen de la FL
Magn.
</p>
<p>On dit que la base contr&#244;le la collocation car, du point de vue du locuteur, c&#8217;est le collocatif qui
est choisi en fonction de la base, et non l&#8217;inverse. Si j&#8217;entre dans une pi&#232;ce mal &#233;clair&#233;e et que
je veux signaler ce fait, je peux dire, par exemple, (12a) ou (12b) :
</p>
<p>(12) a. Il fait noir ici.
</p>
<p>b. Il fait sombre ici.
</p>
<p>Cependant, si je veux revenir sur ce que je viens de dire, pour le modifier et insister sur le fait
qu&#8217;on n&#8217;y voit vraiment rien, mon choix initial va contraindre la fa&#231;on dont je peux maintenant
m&#8217;exprimer :
</p>
<p>(13) a. Il fait m&#234;me noir comme dans un four.
</p>
<p>b. Il fait m&#234;me vraiment tr&#232;s sombre.
</p>
<p>c. *Il fait m&#234;me sombre comme dans un four.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>49
</p>
<p>Il n&#8217;y a aucune raison logique pour que (13a) soit correcte et non (13c), si ce n&#8217;est le fait que la
locution kFAIRE NOIR l admet comme dans un four comme collocatif, ce que n&#8217;admet pas la lo-
cution kFAIRE SOMBRE l.
</p>
<p>Les collocations, en tant que ph&#233;nom&#232;ne linguistique, poss&#232;dent les trois caract&#233;ristiques
suivantes :
</p>
<p>1. Elles sont universellement pr&#233;sentes dans toutes les langues.
</p>
<p>2. Elles sont omnipr&#233;sentes dans les textes, qu&#8217;ils soient oraux ou &#233;crits.
</p>
<p>3. Elles semblent plus ou moins arbitraires, ne peuvent pas se traduire mot &#224; mot d&#8217;une lan-
gue &#224; l&#8217;autre et sont donc tr&#232;s difficiles &#224; acqu&#233;rir.
</p>
<p>Toutes ces caract&#233;ristiques montrent qu&#8217;il est primordial de disposer d&#8217;un m&#233;canisme qui nous
permette non seulement de d&#233;crire les collocations de fa&#231;on rigoureuse, mais aussi de faire des
pr&#233;dictions &#224; leur propos. C&#8217;est ici que les FL vont intervenir.
</p>
<p>Notons finalement que les collocations sont g&#233;n&#233;ralement assez mal trait&#233;es dans les dictionnai-
res de langue. Elles ne sont pas d&#233;crites en tant que telles ; seules quelques unes, parmi les col-
locations les plus &#171; courantes &#187;, apparaissent mentionn&#233;es dans les articles de dictionnaire des
lexies qui en sont la base. Il existe bien entendu des dictionnaires sp&#233;cialement d&#233;di&#233;s &#224; la pr&#233;-
sentation des collocations, par exemple : (Beauchesne, 2001) pour le fran&#231;ais et (Benson et al.,
1997) pour l&#8217;anglais. Il existe aussi des dictionnaires dits &#171; de locutions &#187; ou &#171; d&#8217;expressions
idiomatiques &#187;, qui contiennent en g&#233;n&#233;ral les descriptions de nombreuses collocations, m&#233;-
lang&#233;es aux descriptions de v&#233;ritables locutions ; voir, par exemple, (Rey, Chantreau, 1997),
pour un ouvrage de r&#233;f&#233;rence, et (Kirk-Greene, 1997), pour un outil p&#233;dagogique destin&#233; aux
anglophones apprenant le fran&#231;ais.
</p>
<p>3.2 G&#233;n&#233;ralisation des liens lexicaux : d&#233;finition de la notion de FL
</p>
<p>Les FL servent &#224; mod&#233;liser les liens de d&#233;rivation s&#233;mantique et les liens collocationnels. On
peut proc&#233;der en deux &#233;tapes pour d&#233;finir la notion de FL : d&#8217;abord d&#233;finir ce qu&#8217;est une FL au
sens large, puis d&#233;finir la FL type, appel&#233;e FL STANDARD.
</p>
<p>&#2; La pr&#233;sentation ci-dessous, sous forme de d&#233;finitions comment&#233;es, ne fait qu&#8217;&#233;num&#233;rer
les faits &#171; th&#233;oriques &#187;. Il nous faut voir ensemble des donn&#233;es concr&#232;tes pour com-
prendre l&#8217;int&#233;r&#234;t v&#233;ritable de ce qui est pr&#233;sent&#233; de fa&#231;on relativement s&#232;che ici. On
trouvera une pr&#233;sentation d&#233;taill&#233;e de la notion de FL &#8212; d&#233;finition, exemples, impli-
cations pratiques, etc. &#8212; dans (Mel&#8217;&#269;uk, 1996). Une description succincte est faite
dans (Mel&#8217;&#269;uk, 1997) et (Polgu&#232;re, 1998).
</p>
<p>3.2.1 La notion de FL au sens large
</p>
<p>La notion de FL est relativement complexe et sa d&#233;finition l&#8217;est tout autant. Nous allons &#233;tudier
une d&#233;finition structur&#233;e en composantes qui sont clairement identifi&#233;es par un nom (Fonction-
nent, Statut linguistique, etc.) et dont la pertinence sera examin&#233;e au fur et &#224; mesure de leur in-
troduction (points &#233;num&#233;r&#233;s apr&#232;s les &#171; &#8658; &#187; ci-dessous.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>50
</p>
<p>Une fonction lexicale f est une correspondance (sur le mod&#232;le des fonctions math&#233;ma-
tiques) ayant les propri&#233;t&#233;s suivantes :
</p>
<p>Fonctionnement Au sein d&#8217;une langue donn&#233;e L , elle associe &#224; toute unit&#233; lexi-
cale L &#224; laquelle elle peut logiquement s&#8217;appliquer &#8212; appel&#233;e
MOT-CL&#201; de f &#8212; un ensemble relativement petit (et &#233;ventuel-
lement vide) d&#8217;expressions lexicales de L  appel&#233; VALEUR de
l&#8217;application de f &#224; L : f(L) = {Lvaleur}.
</p>
<p>&#8658; Connexions &#224; l&#8217;int&#233;rieur d&#8217;une langue donn&#233;e, et non d&#8217;une langue &#224; l&#8217;autre.
&#8658; Valeur non vide anticip&#233;e pour un grand nombre de lexies pour une FL &#171; normale &#187;.
&#8658; f s&#233;lectionne un sous-ensemble du lexique auquel elle peut s&#8217;appliquer.
</p>
<p>Statut linguistique L&#8217;application f(L) se caract&#233;rise en fonction de son contenu,
qui est soit une relation s&#233;mantique liant f(L) &#224; L soit un r&#244;le
s&#233;mantico-syntaxique que f(L) peut jouer relativement &#224; L au
niveau syntaxique profond.
</p>
<p>&#8658; FL PARADIGMATIQUE pour un contenu qui est une d&#233;rivation s&#233;mantique.
&#8658; FL SYNTAGMATIQUE pour un contenu qui est un lien collocationnel.
&#8658; Le contenu s&#233;mantique d&#8217;une FL s&#8217;applique toujours &#224; une composante donn&#233;e de la d&#233;-
</p>
<p>finition du mot-cl&#233;, y compris pour les FL syntagmatiques.
</p>
<p>Condition g&#233;n&#233;rale Pour toute paire f(L1) et f(L2), tous les &#233;l&#233;ments de f(L1) et
tous les &#233;l&#233;ments de f(L2) sont li&#233;s de fa&#231;on identique &#224; L1 et
L2 respectivement, ce lien correspondant au contenu de f(L)
tel que d&#233;crit dans le Statut linguistique.
</p>
<p>&#8658; Les FL permettent d&#8217;&#233;tablir des g&#233;n&#233;ralisations et de mod&#233;liser la paraphrase, voir
(Mel&#8217;&#269;uk, 1988).
Condition de validit&#233; Dans une langue donn&#233;e L , il existe des cas o&#249; deux applica-
</p>
<p>tions f(L1) et f(L2) retournent deux ensembles non vides dis-
tincts et une telle diff&#233;rence ne peut pas &#234;tre anticip&#233;e.
</p>
<p>&#8658; Seuls les liens pr&#233;sentant un caract&#232;re irr&#233;gulier correspondent &#224; une FL v&#233;ritable.
</p>
<p>Cette d&#233;finition ne fait en r&#233;alit&#233; que pr&#233;parer le terrain pour la d&#233;finition de la notion de FL
&#171; v&#233;ritable &#187;, c&#8217;est &#224; dire la FL standard. En fait, c&#8217;est uniquement lorsque l&#8217;on a &#224; notre dispo-
sition un ensemble, m&#234;me limit&#233;, de FL standard que l&#8217;on peut bien saisir toute la valeur de la
notion de FL au sens large.
</p>
<p>3.2.2 FL standard vs FL non-standard
</p>
<p>Les FL se subdivisent, en fonction de leur degr&#233; de g&#233;n&#233;ralit&#233;, en FL standard vs FL non-stan-
dard.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>51
</p>
<p>Une FL f est une FL STANDARD si elle poss&#232;de les propri&#233;t&#233;s suivantes :
Statut linguistique L&#8217;application f(L) est un cas particulier de &#171; lex&#232;me
</p>
<p>g&#233;n&#233;ralis&#233; &#187; qui n&#8217;appara&#238;t qu&#8217;au niveau de repr&#233;sentation
syntaxique profond des &#233;nonc&#233;s. f est une FL STANDARD SIM-
PLE si c&#8217;est un &#233;l&#233;ment de base du langage descriptif formel
des FL; autrement, il s&#8217;agit d&#8217;une FL COMPLEXE.
</p>
<p>&#8658; Les FL sont des entit&#233;s abstraites, des sortes de m&#233;talexies ; par exemple, Magn(dormir)
vaut pour toutes les expressions qui permettent d&#8217;exprimer l&#8217;intensification aupr&#232;s de la
lexie DORMIR.
</p>
<p>&#8658; La distinction entre niveau syntaxique profond et de surface est n&#233;cessaire pour bien com-
prendre le fonctionnement des FL.
</p>
<p>Couverture Il existe un grand nombre de lexies L pour lesquelles l&#8217;appli-
cation f(L) peut &#234;tre logiquement consid&#233;r&#233;e. De plus, il existe
un grand nombre d&#8217;applications logiquement possibles f(L)
qui retournent une valeur non vide.
</p>
<p>&#8658; S&#233;lection d&#8217;un nombre important de mots-cl&#233;s potentiels.
&#8658; Au moins une centaine d&#8217;applications f(L) dans chaque langue retournent une valeur non
</p>
<p>vide.
&#8658; Cette condition est satisfaite du fait du contenu s&#233;mantique tr&#232;s vague de toute FL standard.
</p>
<p>Elle est de plus li&#233;e directement au caract&#232;re universel des FL standard.
</p>
<p>Diversit&#233; Il existe une assez grande diversit&#233; parmi toutes les valeurs re-
tourn&#233;es pour f(L) dans chaque langue donn&#233;e L .
</p>
<p>&#8658; Pour chaque langue donn&#233;e L , on doit trouver au moins une douzaine de valeur distinctes
de f(L).
</p>
<p>Autrement, f est consid&#233;r&#233;e comme &#233;tant une FONCTION LEXICALE NON-STANDARD du
fait d&#8217;un des &#233;checs suivants
</p>
<p>&#201;chec partiel La condition de diversit&#233; n&#8217;est pas remplie.
</p>
<p>&#201;chec complet La condition de couverture n&#8217;est pas remplie, ce qui implique
que la condition de diversit&#233; ne l&#8217;est pas non plus. Si la condi-
tion de couverture n&#8217;est pas remplie au point que f ne peut
s&#8217;appliquer qu&#8217;&#224; une seule lexie (ou &#224; deux ou trois lexies s&#233;-
mantiquement tr&#232;s proches), f est appel&#233;e une PSEUDO-FL.
</p>
<p>&#2; Tel que mentionn&#233; plus haut, la notion de FL est essentiellement orient&#233;e vers celle de
FL standard. Une FL non-standard peut &#234;tre vue comme une FL qui &#171; n&#8217;a pas r&#233;ussi &#187;
&#224; &#234;tre une FL standard ; notamment, elle n&#8217;a pas le caract&#232;re universel d&#8217;une FL stan-
dard.
</p>
<p>3.3 Le langage formel descriptif des FL
</p>
<p>Je ne fais ici qu&#8217;&#233;num&#233;rer les principales caract&#233;ristiques du langage formel des FL, qui sera vu
de fa&#231;on pratique au cours du tutoriel. On pourra notamment examiner les encodages pr&#233;sents
dans l&#8217;extrait d&#8217;article lexicographique pour CHAT, donn&#233; plus bas (Section 4.2). Pour une dis-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>52
</p>
<p>cussion des probl&#232;mes pos&#233;s par ce langage et pour des alternatives, voir (Kahane, Polgu&#232;re,
2001).
</p>
<p>3.3.1 Les noms de FL standard simples
</p>
<p>Les noms de FL standard simples sont normalement des formes abr&#233;g&#233;es de mots latins (Magn
pour magnus, Bon pour bonus, etc.), ceci afin de refl&#233;ter le caract&#232;re universel de ces FL.
</p>
<p>3.3.2 Les noms de FL non-standard
</p>
<p>Les noms de FL non-standard sont des paraphrases en langue naturelle du lien encod&#233;. La lan-
gue utilis&#233;e &#233;tant bien entendu normalement celle dont on d&#233;crit le lexique. Par exemple, on
trouve dans l&#8217;article de CHAT (Section 4.2) les jolies d&#233;rivations s&#233;mantiques suivantes :
</p>
<p>Excr&#233;ment du C. : crotte [de ~]; fam pipi, fam pisse [de ~]
Gravier sp&#233;cial
sur lequel le C.
fait ses besoins : liti&#232;re
</p>
<p>Une FL peut &#234;tre semi-standard. Dans ce cas, la formule d&#8217;encodage est hybride, incorporant
une partie formalis&#233;e et une partie qui est une paraphrase en langue naturelle de la composante
non-standard du lien de FL. Par exemple :
</p>
<p>essayer de
Oper2(compliment) = rechercher [ART ~] | C. surtout au pl
</p>
<p>&#2; Comme on peut le voir dans les exemples ci-dessus, il est souvent n&#233;cessaire de donner
dans la description de la valeur de f(L) non seulement les lexies li&#233;es elles-m&#234;mes,
mais aussi les structures syntaxiques qu&#8217;elles contr&#244;lent. Il s&#8217;agit du R&#201;GIME de chaque
&#233;l&#233;ment de la valeur. Celui-ci est indiqu&#233; entre crochets.
</p>
<p>3.3.3 Les FL complexes
</p>
<p>Chaque FL doit &#234;tre d&#233;crite en fonction de son contenu, bien entendu, mais aussi en fonction de
sa combinatoire avec d&#8217;autres FL. Les FL standard simples se combinent en effet naturellement
pour former ce que l&#8217;on appelle des FL COMPLEXES. Par exemple, dans l&#8217;article de
ABANDONI.2b (&#233;tat d&#8217;un lieu) :
</p>
<p>Oper1 : &#234;tre [&#224; l&#8217;~]/[dans ART ~ | avec modificateur]
PermOper1 : laisser [NY &#224; l&#8217;~]
IncepOper1 : tomber [dans ART ~]
PermIncepOper1 : laisser aller [NY &#224; l&#8217;~]
</p>
<p>3.3.4 Les configurations de FL
</p>
<p>Il peut arrive qu&#8217;un lien de FL soit bas&#233; non sur la combinaison de plusieurs FL formant une FL
complexe, comme ci-dessus, mais sur l&#8217;application simultan&#233;e et de fa&#231;on parall&#232;le de plusieurs
FL au m&#234;me mot-cl&#233;. Par exemple :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>53
</p>
<p>Magnquant+Oper12(compliment) = se r&#233;pandre [en ~s aupr&#232;s de NY], prodiguer [ART 
~s &#224; NY]
</p>
<p>indique que les collocations en question signifient &#224; la fois &#171; faire &#187; des compliments (la FL
Oper12) et que ces compliment son nombreux (la FL Magnquant).
</p>
<p>3.3.5 Les valeurs fusionn&#233;es de FL
</p>
<p>La fronti&#232;re entre FL paradigmatique et FL syntagmatique n&#8217;est pas &#233;tanche. Une FL syntag-
matique peut servir &#224; connecter deux lexies qui sont en fait li&#233;es par un lien de d&#233;rivation s&#233;-
mantique. Le lien collocationnel est &#224; ce moment comme int&#233;gr&#233; au sens de lexie retourn&#233;e par
la FL. On parle dans un tel cas de VALEUR FUSIONN&#201;E de la FL. Les valeurs fusionn&#233;es appa-
raissent &#224; droite du symbole / dans les encodages de liens de FL. Par exemple :
</p>
<p>Magn(victoire) = grande | ant&#233;pos; claire, compl&#232;te, &#233;clatante, &#233;crasante, 
retentissante /triomphe.
</p>
<p>Dans la liste de valeurs ci-dessus, le symbole / nous indique que TRIOMPHE est un cas de fusion
du Magn : triomphe = victoire + Magn(victoire). En d&#8217;autres termes, TRIOMPHE, en tant que
valeur de Magn, ne correspond pas ici &#224; un cas de collocation, mais plut&#244;t &#224; un cas de d&#233;rivation
s&#233;mantique ; on aurait pu aussi bien encoder la relation entre VICTOIRE et TRIOMPHE par la for-
mule suivante :
</p>
<p>Syn&#8835;(victoire) = triomphe,
</p>
<p>o&#249; l&#8217;indice &#8835; indique que le synonyme est s&#233;mantiquement plus riche.
</p>
<p>Il faut noter qu&#8217;une valeur est consid&#233;r&#233;e comme fusionn&#233;e m&#234;me si elle correspond tout de
m&#234;me &#224; un collocatif v&#233;ritable dans le cas o&#249; elle se trouve en fait gouverner syntaxiquement la
base de la collocation alors que la FL impliqu&#233;e fonctionne normalement de fa&#231;on inverse :
</p>
<p>Magnquant(injure) = /chapelet [d&#8217;~s] &lt; torrent [d&#8217;~s]
</p>
<p>Magn(L) est normalement un modificateur de L et pourtant la valeur ci-dessus est constitu&#233;e
de noms r&#233;gissant syntaxiquement la base, d&#8217;o&#249; l&#8217;utilisation du symbole de fusion.
</p>
<p>4 Un sous-ensemble du syst&#232;me des fonctions lexicales
</p>
<p>Cette section constitue la partie centrale du tutoriel, l&#224; o&#249; est enseign&#233; un sous-ensemble repr&#233;-
sentatif du syst&#232;me des fonctions lexicales et o&#249; sont mises en pratique les d&#233;finitions ci-dessus.
L&#8217;essentiel du travail va se faire sur la base de travaux pratiques visant la mod&#233;lisation de liens
lexicaux &#224; partir de donn&#233;es textuelles.
</p>
<p>4.1 Analyse de donn&#233;es
</p>
<p>L&#8217;analyse de donn&#233;es peut prendre au moins deux formes, que l&#8217;on examinera tour &#224; tour durant
le tutoriel :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>54
</p>
<p>1. On peut analyser les donn&#233;es linguistiques trouv&#233;es dans des corpus &#233;lectroniques dans
le cadre de la r&#233;daction de descriptions lexicographiques. Dans ce cas, on utilise surtout
des concordances.
</p>
<p>&#3; Exercice d&#8217;&#233;bauche d&#8217;un article de dictionnaire du type DiCo (Polgu&#232;re, 2000b) avec
recours &#224; un corpus &#233;lectronique.
</p>
<p>2. Les FL permettent d&#8217;analyser certains proc&#233;d&#233;s linguistiques utilis&#233;s dans des textes. Il
peut s&#8217;agir de textes litt&#233;raires ou, m&#234;me, de textes d&#8217;&#233;l&#232;ves (dont on cherche &#224; am&#233;liorer
la ma&#238;trise de la langue).
</p>
<p>&#3; On peut par exemple chercher &#224; identifier tous les liens de FL mis en jeu dans le pas-
sage suivant :
</p>
<p>On s&#8217;est mis en rang et notre chef nous a compt&#233;s. &#171; Onze ! il a dit. Il en manque un ! &#187; C&#8217;&#233;tait
Paulin, qui &#233;tait assis dans l&#8217;eau et qui ne voulait pas en sortir.
</p>
<p>&#8212; Je veux rester dans l&#8217;eau ! il criait. Si je sors, je vais avoir froid ! Je veux rester !
Le chef, qui avait l&#8217;air de s&#8217;&#233;nerver, l&#8217;a ramen&#233; en le tirant par le bras et Paulin criait qu&#8217;il vou-
</p>
<p>lait rentrer chez son papa, chez sa maman, et dans l&#8217;eau.
</p>
<p>Semp&#233; J.-J., Goscinny R. (1997), Les vacances du petit Nicolas, Folio Junior, &#201;dition sp&#233;ciale,
n&#186; 457, Paris, Gallimard Jeunesse.
</p>
<p>4.2 Importance des fonctions lexicales non standard
</p>
<p>M&#234;me si les FL non-standard sont en quelque sorte des FL &#171; anormales &#187; du point de vue la no-
tion th&#233;orique de FL elle-m&#234;me, elles ont une importance pratique (descriptive) consid&#233;rable. Il
est pratiquement impossible de trouver une lexie contr&#244;lant un ensemble assez riche de FL qui
soient toutes standard. Il y aura toujours parmi les FL associ&#233;es &#224; une lexie au moins quelques
FL non-standard. Certaines lexies, notamment celles d&#233;notant des entit&#233;s concr&#232;tes, ont m&#234;me
tendance &#224; contr&#244;ler un tr&#232;s grand nombre de liens non standard ou semi-standard. Voici par
exemple la zone de FL de l&#8217;article CHAT du DiCo &#8212; pour une description des formalismes pro-
pres au DiCo, voir (Polgu&#232;re, 2000b) :
</p>
<p>{QSyn} matou, minet, minou, &#8220;vieilli&#8221; mistigri, &#8220;arg&#8221; greffier
{Gener} animal domestique; animal de compagnie; f&#233;lin-n
{Connotation} agilit&#233;, souplesse; d&#233;licatesse, prudence; paresse
{Femelle} chatte
{Petit du C.} chaton
{A0} de [~] //f&#233;lin-adj [&#8220;une d&#233;marche de chat &lt;f&#233;line&gt;&#8221;]
     /*Nom pour X*/
{S1} ma&#238;tre, propri&#233;taire [de ART ~]
     /*De grande taille*/
{Magn} gros | postpos &lt; &#233;norme
     /*Qui n&#8217;a plus de X &lt;Qui vit &#224; l&#8217;&#233;tat sauvage&gt;*/
{sans X AntiVer} abandonn&#233;, errant, &#8220;rare&#8221; haret-adj, sauvage
                 | postpos //&#8220;rare&#8221; haret-n
{Recherch&#233; par X} perdu | postpos
{D&#8217;une esp&#232;ce
 particuli&#232;re} de goutti&#232;re, europ&#233;en | postpos; birman, persan
               | postpos; abyssin-adj/n, angora-adj/n, siamois-adj/n
               | postpos si adj //chartreux</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>55
</p>
<p>{Dont le pelage est ray&#233;} tigr&#233; | postpos
{Dont le pelage est de trois couleurs} tricolore | postpos
{Dont le pelage est en mauvais &#233;tat} galeux, pel&#233; | postpos
{Qui a &#233;t&#233; rendu st&#233;rile [=&#402;1]} op&#233;r&#233; | postpos; castr&#233;,
                                ch&#226;tr&#233; | postpos
{[X] faire en sorte que &#402;1} faire castrer/op&#233;rer/st&#233;riliser [ART ~]
{[C. femelle] en rut} _en chaleur_, _en chasse_
{Qui chasse les animaux N} tueur [de N-pl] [&#8220;un chat tueur de rats&#8221;]
     /*Faire des caresses &#224; un C.*/
{Real&#9674;-caresse} c&#226;liner, caresser, gratter [ART ~]
     /*C. fait des mouvements*/
{Fact0-mouvement} _faire le gros dos_; s&#8217;&#233;tirer; se pelotonner, 
                  se mettre/rouler _en boule_, se rouler _en pelote_;
                  se raccourcir [pour sauter]
     /*C. se nettoie le pelage*/
{Fact0-nettoyage} se laver, se l&#233;cher, se lustrer, faire sa toilette
     /*C. gratte un meuble &lt;une surface&gt; avec ses griffes*/
{Fact0-gratter} faire ses griffes, se faire les griffes
     /*C. se repose*/
{NonFact0} faire la sieste, se pr&#233;lasser
     /*C. chasse l&#8217;animal N*/
{Fact0-chasser} chasser [N], faire la chasse [&#224; N]
     /*Animal que chassent habituellement les C.*/
{S2Fact0-chasser} oiseau, souris, rat
     /*C. attaque N*/
{AntiBonInvolv} griffer, mordre [N]
     /*C. prend une attitude mena&#231;ante*/
{PreparAntiBon2Involv} sortir ses griffes
     /*C. cesse d&#8217;avoir une attitude mena&#231;ante*/
{LiquPreparAntiBon2Involv} rentrer ses griffes; _faire patte de
                           velours_
     /*C. boit*/
{Fact0-boire} laper
     /*Ce qu&#8217;aiment boire les C.*/
{S2--usualFact0-boire} lait#b
     /*C. &#233;met un cri*/
{Son-cri} miauler; feuler | pour exprimer la col&#232;re ou la menace
     /*Cri du C.*/
{S0Son-cri} miaulement, &#171; Miaou ! &#187;; feulement
     /*C. &#233;met un son de gorge exprimant le plaisir [=&#402;2]*/
{Son-plaisir} &#8220;enfantin&#8221; faire ronron, ronronner
     /*Nom pour &#402;2*/
{S0Son-plaisir} ronron, ronronnement
     /*C. &#233;met un son de gorge exprimant la menace*/
{Son-menace} cracher
{&#201;l&#233;ment du corps d&#8217;un C.} moustaches; queue; coussinet, griffe,
                           patte; poil, fourrure, pelage, robe
{Caract&#233;ristique de la langue des C.} r&#226;peuse
{Excr&#233;ment du C.} crotte [de ~]; &#8220;fam&#8221; pipi, &#8220;fam&#8221; pisse [de ~]
{Gravier sp&#233;cial
 sur lequel le C. fait ses besoins} liti&#232;re
{Contenant dans lequel le C. fait ses besoins} bac (&#224; liti&#232;re)
{Petite ouverture pratiqu&#233;e en bas
 d&#8217;une porte qui permet &#224; un C. d&#8217;entrer et sortir} chati&#232;re
{Ce que l&#8217;on dit pour appeler un C.} &#171; Minet ! &#187;, &#171; Minou ! &#187;,
                                     &#171; Petit, petit ! &#187;
{Nom propre typique des C.} Gris-Gris, Mistigri</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>56
</p>
<p>{Nom de personnage de C.
 dans la litt&#233;rature} _le Chat bott&#233;_, Raminagrobis
</p>
<p>4.3 Le probl&#232;me de la variation individuelle et dialectale
</p>
<p>L&#8217;encodage des liens de FL nous oblige &#224; faire face au probl&#232;me de la variation individuelle et
dialectale. Un francophone de France aura par exemple beaucoup de mal &#224; enseigner de fa&#231;on
pratique les FL au Qu&#233;bec, s&#8217;il n&#8217;est pas d&#233;j&#224; familiaris&#233; avec le fran&#231;ais qu&#233;b&#233;cois. Beaucoup
de ses exemples tomberont &#224; plat et il devra les adapter en fonction de son public. L&#8217;inverse est
bien entendu tout aussi vrai. Un dictionnaire de collocations comme (Benson et al., 1997), par
exemple, qui vise un public europ&#233;en aussi bien qu&#8217;am&#233;ricain, va tr&#232;s souvent avoir recours aux
marques d&#8217;usage BE (pour British English) et AE (pour American English) dans ses articles.
</p>
<p>Si la variation dialectale pose probl&#232;me pour la mod&#233;lisation du lexique, on notera cependant
que les FL peuvent justement &#234;tre un outil performant pour rendre compte des &#233;carts dialectaux.
Elles permettent notamment de bien distinguer les variations qui rel&#232;vent d&#8217;une diff&#233;rence au
niveau du stock lexical vs d&#8217;une diff&#233;rence au niveau de la combinatoire des lexies. Par exem-
ple, la fameuse expression qu&#233;b&#233;coise tomber en amour ne devrait pas se d&#233;crire par le biais de
l&#8217;introduction d&#8217;une nouvelle lexie TOMBER propre au fran&#231;ais qu&#233;b&#233;cois (comme on le voit fai-
re parfois), mais bien en tant que collocation de AMOUR :
</p>
<p>IncepOper1(amour) = Qu&#233;b tomber [en ~].
</p>
<p>Pour un exemple d&#8217;utilisation des FL dans la mesure des &#233;carts dialectaux, voir (Lim, Polgu&#232;re,
1992).
</p>
<p>4.4 R&#233;capitulatif des fonctions lexicales introduites
</p>
<p>Je ne r&#233;capitule ici que les principales FL standard qui auront &#233;t&#233; examin&#233;es durant le tutoriel.
On trouvera dans (Me&#8217;&#269;uk, 1996) la liste compl&#232;te des FL standard simples. Celle-ci est aussi
disponible dans les volumes du Dictionnaire explicatif et combinatoire du fran&#231;ais contempo-
rain, notamment le Volume IV (Mel&#8217;&#269;uk et al., 1999).
</p>
<p>4.4.1 Principales FL paradigmatiques examin&#233;es
</p>
<p>1. Syn (du latin synonymum) est la FL qui associe &#224; une lexie ses synonymes exacts ou
approximatifs :
</p>
<p>Syn(voiture) = automobile, fam auto, Qu&#233;b fam char
Syn(individu) = fam gars, fam type, fam mec
Syn&#8834;(avion) = appareil3
</p>
<p>APPAREIL3 est un synonyme moins riche (un hyperonyme) de AVION : son sens est inclus
dans celui de AVION, comme l&#8217;indique le symbole d&#8217;inclusion mis en indice.
</p>
<p>Syn&#8835;(appareil3) = avion
&#192; l&#8217;oppos&#233;, AVION est un synonyme plus riche (un hyponyme) de APPAREIL3 : son sens
inclut celui de APPAREIL3, comme l&#8217;indique le symbole d&#8217;inclusion inverse.
</p>
<p>Syn&#8745;(jouer) = s&#8217;amuser
S&#8217;AMUSER est un synonyme &#171; &#224; intersection &#187; de JOUER : son sens poss&#232;de une intersec-
tion significative avec celui de JOUER, comme l&#8217;indique le symbole d&#8217;intersection. Ceci
est d&#233;montr&#233; par le fait que, bien que les lexies JOUER et S&#8217;AMUSER peuvent &#234;tre substi-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>57
</p>
<p>tu&#233;es l&#8217;une &#224; l&#8217;autre dans de nombreux contextes, on peut tout &#224; fait jouer sans s&#8217;amuser
et, &#224; l&#8217;inverse, s&#8217;amuser sans jouer. Il y a donc ici intersection et non inclusion de sens.
</p>
<p>2. Anti (du latin antonymum) est la FL qui associe &#224; une lexie ses antonymes :
</p>
<p>Anti(petit) = grand
Anti(hautAdj) = basAdj
</p>
<p>3. Convijk (du latin conversivum) est la FL qui associe &#224; une lexie ses conversifs. La suite
ijk identifie la permutation des actants :
</p>
<p>Conv321(donner) = recevoir
[Actant1 donne Actant2 &#224; Actant3 &#8801; Actant3 re&#231;oit Actant2 de Actant1]
</p>
<p>4. S0 (S pour substantif) est la FL qui associe &#224; une lexie verbale, adjectivale ou adverbiale
sa contrepartie nominale :
</p>
<p>S0(courir) = course
S0(dormir) = sommeil
</p>
<p>5. V0 est le pendant verbal de S0, qui associe donc &#224; une lexie nominale, adjectivale ou
adverbiale sa contrepartie verbale :
</p>
<p>V0(sommeil) = dormir
</p>
<p>6. S1, S2, &#8230; lient une lexie pr&#233;dicative au nom standard de son premier, deuxi&#232;me, &#8230;
actant :
</p>
<p>S1(courir) = coureur
S1(dormir) = dormeur
S1(voler) = voleur, coupable
S2(voler) = butin
S3(voler) = victime
</p>
<p>4.4.2 Principales FL syntagmatiques examin&#233;es
</p>
<p>1. Magn (du latin magnus (grand)) associe &#224; une lexie l&#8217;ensemble des lexies ou expressions
linguistiques qui expriment aupr&#232;s d&#8217;elle l&#8217;intensification, c&#8217;est-&#224;-dire le sens g&#233;n&#233;ral
(intense), (tr&#232;s), (beaucoup), etc. :
</p>
<p>Magn(chagrin) = grand, gros &lt; &#233;norme, immense
Magn(amour) = grand &lt; immense
Magn(courir) = vite &lt; k&#224; fond de train l, k&#224; perdre haleine l
AntiMagn(chagrin) = petit
</p>
<p>Dans les exemples ci-dessus, le symbole &#171; inf&#233;rieur &#224; &#187; indique une gradation entre les
diff&#233;rents &#233;l&#233;ments de la valeur retourn&#233;e. Ainsi, un &#233;norme chagrin est plus &#171; intense &#187;
qu&#8217;un gros chagrin.
</p>
<p>2. Bon (du latin bonus (bon)) associe &#224; une lexie l&#8217;ensemble des lexies ou expressions lin-
guistiques qui expriment aupr&#232;s d&#8217;elle le sens g&#233;n&#233;ral (bon), (bien), etc. &#8212; c&#8217;est-&#224;-dire,
l&#8217;&#233;valuation positive/l&#8217;approbation du locuteur :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>58
</p>
<p>Bon(col&#232;re) = saine, sainte
Bon(compliment) = bien tourn&#233;
</p>
<p>Les trois FL suivantes permettent de d&#233;crire les constructions dites &#224; VERBE SUPPORT.
</p>
<p>3. Operi (du latin operari (faire)) associe &#224; une lexie L un verbe s&#233;mantiquement vide qui
prend L comme premier compl&#233;ment et le i&#232;me actant de L comme sujet grammatical
pour donner une construction qui est fonctionnellement &#233;quivalente &#224; une verbalisation
de L :
</p>
<p>Oper1(coup) = ass&#233;ner, donner, fam flanquer [ART ~]
[ass&#233;ner/donner/flanquer un coup &#8801; frapper]
</p>
<p>Oper2(coup) = fam encaisser, prendre, recevoir [ART ~]
[encaisser/prendre/recevoir un coup &#8801; &#234;tre frapp&#233;]
</p>
<p>4. Funci (du latin (de cuisine) functionare (fonctionner)) associe &#224; une lexie L un verbe
s&#233;mantiquement vide qui prend L comme sujet grammatical et le i&#232;me actant de L comme
premier compl&#233;ment ; i = 0 si Func ne prend pas de compl&#233;ment :
</p>
<p>Func0(pluie) = tomber
Func1(&#233;loge) = provenir, venir [de NX]
</p>
<p>5. Laborij (du latin laborare (travailler)) associe &#224; une lexie L un verbe s&#233;mantiquement
vide qui prend le i&#232;me actant de L comme sujet grammatical, le j&#232;me actant de L comme
premier compl&#233;ment et L comme second compl&#233;ment :
</p>
<p>Labor12(aversion) = avoir, tenir [NY en ~]
Labor21(effroi) = remplir, saisir &lt; glacer [NX d&#8217;~]
</p>
<p>Les Operi, Funci et Laborij, qui sont s&#233;mantiquement vides, s&#8217;opposent aux verbes dits de
&#171; r&#233;alisation &#187;, mod&#233;lis&#233;s par les FL Reali, Facti et Labrealij. Ces verbes contr&#244;lent les m&#234;-
mes structures syntaxiques que les FL de verbes supports, mais ont un contenu s&#233;mantique ; ce-
lui-ci peut &#234;tre caract&#233;ris&#233; de fa&#231;on tr&#232;s vague comme &#233;tant la r&#233;alisation, la satisfaction de la
situation d&#233;not&#233;e par le mot-cl&#233; de cette FL.
</p>
<p>6. Reali (du latin realis (r&#233;el)) est le verbe de r&#233;alisation correspondant (syntaxiquement) &#224;
Operi :
</p>
<p>Real1(projet) = accomplir, concr&#233;tiser, r&#233;aliser [ART ~]
Real2(avertissement) = kprendre en consid&#233;ration l, kprendre en compte l, suivre 
</p>
<p>[ART ~], ktenir compte l [de ART ~]; &#233;couter, entendre [ART ~]
Real1(v&#234;tement) = porter [ART ~]
</p>
<p>7. Facti (du latin factum (fait)) est le verbe de r&#233;alisation correspondant (syntaxiquement) &#224;
Funci :
</p>
<p>Fact0(stratag&#232;me) = marcher, r&#233;ussir, fonctionner
AntiFact0(stratag&#232;me) = &#233;chouer
Fact0(rem&#232;de) = agir
Fact1(rem&#232;de) = gu&#233;rir, soigner [NX]</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des liens lexicaux au moyen des fonctions lexicales
</p>
<p>59
</p>
<p>Fact2(rem&#232;de) = aider [contre NY], combattre [NY]
</p>
<p>8. Labrealij (nom hybride de Labor et Real) est le verbe de r&#233;alisation correspondant
(syntaxiquement) &#224; Laborij :
</p>
<p>Labreal12(gratitude) = assurer [NY de ART ~]
Labreal12(pelle) = creuser [NY avec ART ~]; remuer [NY avec ART ~]; ramasser 
</p>
<p>[NY &#224; la ~ &lt;avec ART ~&gt;] /pelleter [NY]
Labreal21(excuse) = donner, kfaire valoir l, invoquer [NX comme/en ~] &lt; brandir [NX 
</p>
<p>comme ~]; saisir [NX comme ~] /all&#233;guer [que PROPX]
</p>
<p>R&#233;f&#233;rences
</p>
<p>Une adresse de site Internet est donn&#233;e pour les textes dont une version &#233;lectronique peut &#234;tre
t&#233;l&#233;charg&#233;e.
</p>
<p>Daille B. (2001), Extractions de collocations &#224; partir de textes, Actes de TALN 2001, Tome 2,
Tours, pp. 3-8.
</p>
<p>Firth J. (1957), Modes of Meaning (1951), in Papers in Linguistics 1934-1951, Oxford, Oxford
University Press, pp. 190-215.
</p>
<p>Kahane S. (2001), Grammaires de d&#233;pendance formelles et th&#233;orie Sens-Texte, Actes de TALN
2001, Tome 2, Tours, pp. 17-76.
</p>
<p>Kahane S., Polgu&#232;re A. (2001), Formal foundation of lexical functions, Actes de COLLOCA-
TION: Computational Extraction, Analysis and Exploitation, 39th Annual Meeting and 10th
</p>
<p>Conference of the European Chapter of the Association for Computational Linguistics, Toulou-
se, pp. 8-15.
</p>
<p>[http://www.fas.umontreal.ca/ling/olst/FrEng/SKAPolColloc.pdf]
</p>
<p>Lim G., Polgu&#232;re A. (1992) Can Lexical Functions Help to Characterize Singapore English?, in
A. Pakir (r&#233;d.) : Words in a Cultural Context, Singapour, UniPress, pp. 154-171.
</p>
<p>Mel&#8217;&#269;uk I. (1988), Paraphrase et lexique dans la th&#233;orie linguistique Sens-Texte &#8212; Vingt ans
apr&#232;s, Revue internationale de lexicologie et lexicographie, Vol. 52/53, pp. 5-50/5-53.
</p>
<p>Mel&#8217;&#269;uk I. (1995), Phrasemes in Language and Phraseology in Linguistics, in M. Everaert, E.-
J. van der Linden, A. Schenk and R. Schreuder (r&#233;d.) : Idioms. Structural and Psychological
Perspectives, Hillsdale/Hove, Lawrence Erlbaum Associates, pp. 167-232.
</p>
<p>Mel&#8217;&#269;uk I. (1996), Lexical Functions: A Tool for the Description of Lexical Relations in a Lex-
icon, in L. Wanner (r&#233;d.) : Lexical Functions in Lexicography and Natural Language Process-
ing, Amsterdam/Philadelphia, Benjamins, pp. 37-102.
</p>
<p>Mel&#8217;&#269;uk I. (1997), Vers une linguistique Sens-Texte. Le&#231;on inaugurale (faite le Vendredi 10
janvier 1997), Coll&#232;ge de France, Chaire internationale.
</p>
<p>[http://www.fas.umontreal.ca/ling/olst/FrEng/MelcukColldeFr.pdf]
</p>
<p>Mel&#8217;&#269;uk I. (2001), Communicative Organization in Natural Language: The semantic-commu-
nicative structure of sentences, Amsterdam/Philadelphia, Benjamins.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain Polgu&#232;re
</p>
<p>60
</p>
<p>Mel&#8217;&#269;uk I., Clas A., Polgu&#232;re A. (1995), Introduction &#224; la lexicologie explicative et combina-
toire, Louvain-la-Neuve, AUPELF-UREF/Duculot.
</p>
<p>Polgu&#232;re A. (1998), La th&#233;orie Sens-Texte, Dialangue, Vol. 8-9, pp. 9-30.
[http://www.fas.umontreal.ca/ling/olst/FrEng/PolgIntroTST.pdf]
</p>
<p>Polgu&#232;re A. (2000a), Une base de donn&#233;es lexicales du fran&#231;ais et ses applications possibles en
didactique, Revue de Linguistique et de Didactique des Langues (LIDIL), Vol. 21, pp. 75-97.
</p>
<p>Polgu&#232;re A. (2000b), Towards a theoretically-motivated general public dictionary of semantic
derivations and collocations for French, Actes de EURALEX&#8217;2000, Stuttgart, pp. 517-527.
</p>
<p>[http://www.fas.umontreal.ca/ling/olst/FrEng/APolEURALEX.pdf]
</p>
<p>Polgu&#232;re A. (&#224; para&#238;tre), L&#8217;&#233;tude du lexique : Syst&#232;me de notions de base en lexicologie et s&#233;-
mantique.
</p>
<p>Tesni&#232;re L. (1959), &#201;l&#233;ments de syntaxe structurale, Paris, Klincksieck.
</p>
<p>Williams G. (2001), Sur les caract&#233;ristiques de la collocation, Actes de TALN 2001, Tome 2,
Tours, pp. 9-16.
</p>
<p>Dictionnaires cit&#233;s :
</p>
<p>Beauchesne J. (2001), Dictionnaire des cooccurrences, Montr&#233;al, Gu&#233;rin.
</p>
<p>Benson M., Benson E., Ilson R. (1997), The BBI dictionary of English word combinations,
Amsterdam/Philadelphia, Benjamins.
</p>
<p>Kirk-Greene C. (1997), French Idioms and Expressions, Londres et al., Foulsham.
</p>
<p>Nouveau Petit Robert (1993), Paris, Dictionnaires Le Robert.
</p>
<p>Mel&#8217;&#269;uk I. et al. (1984, 1988, 1992, 1999), Dictionnaire explicatif et combinatoire du fran&#231;ais
contemporain: Recherches lexico-s&#233;mantiques I, II, III, IV. Montr&#233;al, Presses de l'Universit&#233; de
Montr&#233;al.
</p>
<p>Rey A., Chantreau S. (1997), Dictionnaire des expressions et locutions, Les usuels du Robert,
Paris, Dictionnaires Le Robert.</p>

</div></div>
</body></html>