<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Maurice Gross : une refondation de la linguistique au crible de l'analyse automatique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Maurice Gross : 
 une refondation de la linguistique  
au crible de l'analyse automatique 
</p>
<p>Amr Helmy IBRAHIM 
</p>
<p>Professeur des Universit&#233;s 
</p>
<p>amr.ibrahim1@libertysurf.fr 
</p>
<p>Qu'il s'adresse &#224; un Prix Nobel ou &#224; un &#233;tudiant de premi&#232;re ann&#233;e Maurice Gross ne craignait 
jamais d'&#234;tre trop &#233;l&#233;mentaire. C'&#233;tait &#224; chaque fois comme si, entreprenant d'&#233;crire un livre de 
math&#233;matiques il ne pouvait rien d&#233;montrer avant d'avoir reconstruit les donn&#233;es les plus 
primitives du calcul et du raisonnement qui l'accompagne. Et il arrivait souvent que ceux qui 
l'&#233;coutaient ou le lisaient pour la premi&#232;re fois, manquant par leur impatience le d&#233;tail qui 
faisait que ses &#233;vidences n'avaient rien d'&#233;vident, s'imaginent qu'il les prenait pour des 
imb&#233;ciles. 
</p>
<p>Parce qu'il avait l'expression litt&#233;raire et philosophique, la langue du style, la forme de 
l'&#233;motion, dans les tripes &#8211; il pouvait citer sans discontinuer des po&#232;tes fran&#231;ais ou anglais du 
XVIe si&#232;cle &#224; nos jours et discuter longuement des formulations exactes d'un Ren&#233; Descartes 
ou d'un Charles Sanders Pierce, deux de ses deux philosophes pr&#233;f&#233;r&#233;s - il n'a jamais fait 
recette aupr&#232;s des litt&#233;raires, des psycho-socios, des s&#233;mio-machins, des politiques et des 
pouvoirs acad&#233;miques chez qui le raccourci, la connotation, le clin d'&#339;il, dont tout le monde a 
oubli&#233; sur quelles complicit&#233;s exactes ils se fondent, tiennent lieu de d&#233;couverte quand ce 
n'est pas de pens&#233;e. 
</p>
<p>La complexit&#233; qui l'int&#233;ressait &#233;tait d'une tout autre nature et autrement plus complexe. Elle 
avait pour horizon la phrase simple. M&#234;me pas l'&#233;nonc&#233;, juste la phrase. Et simple c'est-&#224;-dire 
constitu&#233;e d'une seule proposition. Contrairement &#224; ceux qui voyaient dans les processus de 
r&#233;cursivit&#233; propositionnelle &#8211; relatives notamment -- une source de complexit&#233; et de 
cr&#233;ativit&#233;, il y voyait un m&#233;canisme tr&#232;s banal1. La vraie complexit&#233;, celle qu'aucune machine 
construite &#224; ce jour ne contr&#244;le vraiment, il l'a expos&#233;e avec une simplicit&#233; d&#233;sarmante en un 
peu moins de deux pages au d&#233;but de M&#233;thodes en syntaxe (1975: 17-19) dans le chapitre 
intitul&#233; La cr&#233;ativit&#233; du langage. Elle porte sur les combinaisons possibles ou impossibles au 
sein d'une structure de neuf constituants formant une phrase simple. Mais ces possibilit&#233;s 
                                                 
1 &quot;les m&#233;canismes syntaxiques r&#233;currents qui allongent les phrases (les transformations binaires) ne semblent pas 
</p>
<p>apporter une contribution quelconque &#224; la cr&#233;ativit&#233;. Dans leur quasi totalit&#233;, il est possible de les d&#233;crire 
comme des concat&#233;nations de phrases simples &#224; contenus ind&#233;pendants. Il existe n&#233;anmoins des contraintes 
entre phrases simples qui subissent une transformation binaire, mais comme Harris 68 [Mathematical 
Structures of Language] l'a montr&#233;, ces contraintes sont s&#233;mantiques, voire culturelles, et bien qu'elles soient 
de type fini, elles contribuent de mani&#232;re fondamentale &#224; rendre le langage &quot;cr&#233;atif&quot;&quot;. 
</p>
<p>5 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>&quot;limit&#233;es &#224; 1050 cas&quot; et qui peuvent donc &quot;&#234;tre consid&#233;r&#233;es comme intuitivement infinies&quot; sans 
qu'il soit n&#233;cessaire &quot;de faire appel &#224; des m&#233;canismes infinis pour rendre compte de leur 
richesse&quot; ne sont qu'un horizon virtuel. 
</p>
<p>1. Taxinomies, Compl&#233;tives et Classes d'&#233;quivalence  
L'&#339;uvre de Maurice Gross et son enseignement s'emploieront &#224; r&#233;v&#233;ler et &#224; d&#233;crire le 
fonctionnement d'un autre niveau de complexit&#233; qui limite cette combinatoire virtuelle sans 
pour autant la simplifier et auquel on ne peut acc&#233;der qu'&#224; travers une taxinomie (ou 
taxonomie). Mais cette taxinomie n'est pas celle dont les classements b&#234;tes et m&#233;chants sont 
h&#233;rit&#233;s d'un distributionalisme primitif conceptuellement ant&#233;rieur &#224; la r&#233;volution introduite 
dans la pens&#233;e scientifique et dans la pens&#233;e tout court par la d&#233;couverte du principe de 
conservation de la mati&#232;re. Cette taxinomie, soumise &#224; l'imp&#233;ratif cat&#233;gorique de conservation 
de la mati&#232;re, est motiv&#233;e, orient&#233;e et au besoin corrig&#233;e par l'obligation de d&#233;couvrir et de 
reconstruire toutes les classes d'&#233;quivalence qui existent au sein d'une langue et par del&#224; parmi 
toutes les langues et au sein du langage humain. Le principe universel de conservation de la 
mati&#232;re, celui-l&#224; m&#234;me qui gouverne la m&#233;canique newtonienne et dont la reformulation par 
Lavoisier constitue le fondement non seulement de la chimie mais de toute pens&#233;e dynamique 
moderne &#224; savoir que &quot;Rien ne se cr&#233;e, ni dans les op&#233;rations de l'art, ni dans celles de la 
nature, et l'on peut poser en principe que, dans toute op&#233;ration, il y a une &#233;gale quantit&#233; de 
mati&#232;re avant et apr&#232;s l'op&#233;ration; que la qualit&#233; et la quantit&#233; des principes sont les m&#234;mes 
et qu'il n'y a que des changements, desmodifications&quot; , ce principe est aussi, dans l'&#233;conomie 
g&#233;n&#233;rale de sa m&#233;thode, tout &#224; la fois un principe d'organisation et un principe de s&#233;lection des 
propri&#233;t&#233;s classificatoires qui sont susceptibles de devenir des propri&#233;t&#233;s pertinentes, c'est-&#224;-
dire des propri&#233;t&#233;s qui contribuent &#224; rendre &quot;intelligible&quot; le fonctionnement de la langue. De 
la m&#234;me mani&#232;re que les propri&#233;t&#233;s li&#233;es aux syst&#232;mes de reproduction justifient les 
classements de Carl von Linn&#233;. Maurice Gross qui donnait volontiers comme mod&#232;le 
m&#233;thodologique &#224; ses &#233;tudiants l'&#339;uvre du fondateur de l'histoire naturelle moderne aurait en 
effet pu appliquer &#224; la description des langues cette d&#233;finition de Linn&#233; dans sa Philosophia 
botanica de 1751: &quot;La description est l'ensemble des caract&#232;res naturels de la plante; elle en 
fait conna&#238;tre toutes les parties ext&#233;rieures; elle doit comprendre pour chaque organe le 
nombre, la forme, la proportion et la position; &#234;tre faite dans l'ordre de succession des 
organes; &#234;tre divis&#233;e en autant de paragraphes s&#233;par&#233;s qu'il y a de parties distinctes et n'&#234;tre 
ni trop longue ni trop succinte&quot; puis, plus loin, cette petite remarque conclusive qui, au terme 
de tr&#232;s longs et fastidieux inventaires deviendra l'une des d&#233;couvertes majeures de l'histoire 
naturelle &quot;la disposition des v&#233;g&#233;taux la plus recommandable doit &#234;tre tir&#233;e du nombre, de la 
figure, de la proportion et de la situation de toutes les parties diff&#233;rentes de la fructification&quot;.  
</p>
<p>Et l'on pourrait dire de Maurice Gross, &#224; une ou deux substitutions pr&#232;s, ce qui a &#233;t&#233; dit de 
Carl von Linne2: son &quot;g&#233;nie se situe dans le positivisme du regard qu'il porte sur la cr&#233;ation 
[la langue]; il est le don de percevoir les &#234;tres [les unit&#233;s de la langue] dans leur sp&#233;cificit&#233; 
mais aussi dans leurs rapports r&#233;ciproques. Par la vertu du regard, la classification, fond&#233;e 
sur le choix de rep&#232;res artificiels, semble rejoindre un ordre naturel. La syst&#233;matique 
appara&#238;t ainsi comme une ph&#233;nom&#233;nologie et une morphologie. Nommer un &#234;tre [une unit&#233; de 
la langue] c'est le mettre en place dans l'ensemble des &#234;tres. La taxinomie n'est pas une 
mn&#233;motechnique, mais une v&#233;ritable science.&quot; 
</p>
<p>                                                 
</p>
<p>2 Georges Gusdorf dans l'Encyclop&#233;die Universalis (1995, T.13 p. 863) 
</p>
<p>6  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>Mais quel &#233;tait, &#224; l'instar du nombre, de la figure, de la proportion et de la situation de toutes 
les parties diff&#233;rentes de la fructification de Linn&#233;, le fil directeur de l'entreprise 
classificatrice de Maurice Gross mat&#233;rialis&#233;e par ces fameuses tables de propri&#233;t&#233;s o&#249; l'on voit 
des listes de verbes sur la gauche, des propri&#233;t&#233;s structurelles qui se succ&#232;dent, parfois en 
escalier et en lignes serr&#233;es sur le haut et cette myriade de plus et de moins &#224; l'intersection des 
deux? C'&#233;tait la nature de la s&#233;quence en position de compl&#233;ment d'objet direct des quelque 
six mille verbes transitifs du fran&#231;ais. Plus pr&#233;cis&#233;ment l'observation qu'une distribution du 
type: 
</p>
<p> Chlo&#233; aime  la danse 
 Lo&#239;c voit  la danse de Chlo&#233; 
 Chlo&#233; aime  danser 
 Lo&#239;c voit  danser Chlo&#233; 
 Lo&#238;c se voit  danser 
</p>
<p> Chlo&#233; aime qu'on danse, que je danse, que tu danses, qu'elle danse. 
 Lo&#238;c voit qu'on danse, que je danse, que tu danses, qu'il danse. 
</p>
<p> Chlo&#233; aime  ceux qui dansent 
Lo&#239;c voit Chlo&#233; (qui danse + dansant) 
</p>
<p> Chlo&#233; aime  ce qui danse et ce qui se danse. 
</p>
<p>Lo&#239;c voit  des choses qui dansent. 
Lo&#239;c voit  les danses qui se dansent 
</p>
<p>pr&#233;sente une une gamme de possiblit&#233;s qu'il est indispensable de pouvoir relier puisqu'elles 
remplissent toutes la m&#234;me fonction par rapport au verbe principal conjugu&#233; et qu'elles sont 
toutes d&#233;rivables, au minimum deux &#224; deux, l'une de l'autre. Mais on voit vite que d'une part 
l'ensemble des &#233;l&#233;ments de la gamme n'appartiennent pas au m&#234;me paradigme distributionnel, 
d'autre part qu'il est tr&#232;s difficile de les relier par une r&#232;gle transformationnelle stricto sensu 
du fait de l'h&#233;t&#233;rog&#233;n&#233;it&#233; des param&#232;tres qui gouvernent l'&#233;quivalence: nature du verbe 
principal,  cor&#233;f&#233;rence ou non de l'agent du noyau pr&#233;dicatif principal et du noyau pr&#233;dicatif 
compl&#233;ment, contraintes sur la possibilit&#233; ou non de nominaliser le noyau pr&#233;dicatif 
compl&#233;ment, relation de la proposition subordonn&#233;e compl&#233;tive &#224; sa transform&#233;e infinitive ou 
nominale, &#233;quivalence ou non de cette compl&#233;tive avec un type particulier de relatives, nature 
du sujet du verbe principal, &#224; savoir s'il s'agit ou non du r&#233;sultat d'une mont&#233;e du sujet du 
noyau pr&#233;dicatif compl&#233;ment ou de son extraposition, nature des contraintes d'ordre dans la 
succession des deux noyaux pr&#233;dicatifs et corr&#233;lation de ces contraintes avec la possibilit&#233; ou 
non de nominaliser ces deux noyaux, enfin, last but not least, la question de savoir si les 
variations de temps, d'interpr&#233;tation aspectuelle et d'assignation des d&#233;terminants appropri&#233;s 
sont, au cours de ces changements, d&#233;terminantes ou secondaires, c'est-&#224;-dire rectrices ou 
d&#233;pendantes des propri&#233;t&#233;s pr&#233;c&#233;dentes. 
</p>
<p>Maurice Gross voit vite que toutes ces questions peuvent &#234;tre pos&#233;es d'une mani&#232;re 
extr&#234;mement pr&#233;cise et efficace &#224; travers l'analyse d'une petite structure qui a la forme: 
 (Det) N&#176; V V-inf  (Det) N 
&#224; la condition expresse que cette analyse soit exhaustive et qu'elle soit centr&#233;e en priorit&#233;  sur 
une propri&#233;t&#233;, &#224; savoir la relation de cette structure &#224; la structure  
</p>
<p>7  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p> (Det) N&#176; V Que P 
autrement dit c'est le R&#233;gime des constructions compl&#233;tives sous-titre de M&#233;thodes en syntaxe 
qui sera positivement ou par d&#233;faut, le point de d&#233;part, le principe organisateur du lexique-
grammaire, l'&#233;quivalent du syst&#232;me de fructification qui organise l'ensemble de la taxinomie 
de Carl von Linn&#233;. 
</p>
<p>Tout linguiste qu'il soit chercheur ou enseignant s'en rendra vite compte s'il prend la peine de 
construire un exercice d'analyse transformationnelle &#224; partir de ces deux structures avec un 
public de jeunes pr&#233;alablement entra&#238;n&#233;s &#224; un minimum de manipulations syntaxiques: la 
quasi totalit&#233; de la grammaire de la langue y passe. Un tr&#232;s grand nombre des vrais probl&#232;mes 
de syntaxe avec les probl&#232;mes s&#233;mantiques qui s'y attachent et qui ont donn&#233; lieu &#224; de 
nombreux articles et livres &#233;crits dans toutes sortes de perspectives th&#233;oriques sont clairement 
pos&#233;s et pour certains expliqu&#233;s par les diff&#233;rences de comportement de ces deux structures 
selon les unit&#233;s lexicales &#224; valeur pr&#233;dicative qui s'y ins&#232;rent. On voit ainsi d&#233;montr&#233; avec une 
rigueur et une simplicit&#233; sans pr&#233;c&#233;dent dans l'histoire de la linguistique comment et pourquoi 
il est impossible de ne pas faire partir les m&#233;canismes g&#233;n&#233;raux, en nombre fini et de nature 
simple de la grammaire ou de la syntaxe des diff&#233;renciations tr&#232;s complexes et a priori non 
finies du lexique. On comprend alors mieux l'affirmation de Maurice Gross selon laquelle la 
moyenne de r&#233;gularit&#233; &#8211; c'est-&#224;-dire le nombre moyen d'unit&#233;s ayant exactement le m&#234;me 
comportement au sein d'une classe &#8211; des classes verbales du fran&#231;ais est d'un verbe et demi. 
On comprend mieux aussi les raisons de ce pav&#233; dans la mare, &quot;On the failure of generative 
grammar&quot; qu'il publie en 1979 (Vo. 55, n&#176;4, pp. 859-885) dans l'une des plus grandes revues 
de linguistique du monde, Language, l'organe de la Linguistic Society of America, &#224; un 
moment o&#249; la grammaire g&#233;n&#233;rative est encore au mieux de sa forme. 
</p>
<p>La justification de ce choix, &#224; savoir de faire de l'&#233;tude du groupe objet et &#224; l'int&#233;rieur de ce 
groupe du r&#233;gime des compl&#233;tives le pivot d'une taxinomie qui devait progressivement 
couvrir toutes les unit&#233;s de la langue est expos&#233;e dans un ouvrage qu'un grand historien de la 
grammaire fran&#231;aise qui est aussi le meilleur sp&#233;cialiste de l'histoire de la notion d'objet, Jean-
Claude Chevalier, consid&#232;re comme l'un des deux meilleurs livres de linguistique qu'il 
connaisse: Grammaire transformationnelle du fran&#231;ais: le verbe publi&#233; chez Larousse en 
1968. La date a ici une importance particuli&#232;re. La m&#234;me ann&#233;e para&#238;t aux presses du MIT 
The Grammar of English Predicate Complement Constructions de P.S. Rosenbaum qui 
reprend une th&#232;se soutenue au MIT en 1965 sous la direction de Noam Chomsky. D'octobre 
1964 &#224; juin 1965 Maurice Gross est charg&#233; de cours &#224; l'Universit&#233; de Pennsylvanie chez 
Zellig Sabbetai Harris, fondateur du premier d&#233;partement de linguistique aux Etats-Unis et 
professeur de Noam Chomsky. La diff&#233;rence de traitement du m&#234;me sujet dans les deux 
ouvrages s&#233;pare d&#233;j&#224; et s&#233;pare encore aujourd'hui ceux pour qui, comme pour Maurice Gross, 
les r&#232;gles de la grammaire ne peuvent pas exister en dehors de propri&#233;t&#233;s lexicales tr&#232;s 
sp&#233;cifiques de tous ceux qui pensent que des r&#232;gles d'une forme X peuvent &#234;tre assez 
g&#233;n&#233;rales pour accueillir les unit&#233;s lexicales ind&#233;pendammant de leurs particularit&#233;s. 
</p>
<p>Objecterait-on &#224; cette comparaison que l'entreprise de Maurice Gross, quelque g&#233;niale qu'elle 
puisse &#234;tre, ne s'est appliqu&#233;e qu'&#224; une langue parmi quelques milliers de langues parl&#233;es 
encore &#224; ce jour sur notre plan&#232;te que je r&#233;pondrais que nous sommes aujourd'hui quelques 
dizaines de chercheurs qu'il a form&#233;s de par le monde &#224; affirmer qu'elle a &#233;t&#233; appliqu&#233;e avec 
succ&#232;s et qu'elle restera longtemps applicable &#224; toutes les langues que nous connaissons. S'il 
existe une approche qui, dans son universalit&#233;, soit aux langues, ce que les approches de 
Newton, de Lavoisier ou de Linn&#233; ont &#233;t&#233; aux sciences exactes qui fondent la dignit&#233; de notre 
esp&#232;ce, c'est bien celle de Maurice Gross. 
</p>
<p>8  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>Une combinatoire virtuellement infinie mais effectivement corrig&#233;e et pour ainsi dire 
reconfigur&#233;e par une taxinomie elle-m&#234;me gouvern&#233;e et hi&#233;rarchis&#233;e par la s&#233;lection de 
propri&#233;t&#233;s centrales dont on peut d&#233;montrer, via un mode particulier de gestion des classes 
d'&#233;quivalence, la pertinence. Voil&#224; l'infrastructure de la m&#233;thode. 
</p>
<p>Pour se la repr&#233;senter plus pr&#233;cis&#233;ment, il faut maintenant savoir ce que nous entendons 
pr&#233;cis&#233;ment par un mode particulier de gestion des classes d'&#233;quivalence. 
</p>
<p>Il est g&#233;n&#233;ralement admis qu'en langue une transformation qui v&#233;rifie le principe de 
conservation de la mati&#232;re est un changement structurel et lexical qui pr&#233;serve une 
&#233;quivalence fonctionnelle ou s&#233;mantique voire fonctionnelle et s&#233;mantique entre l'&#233;nonc&#233; 
source et l'&#233;nonc&#233; transform&#233;. Il est d'autre part implicitement admis, sans qu'il y ait 
r&#233;ellement une th&#233;orisation et une mod&#233;lisation qui le prouvent, que le calcul des 
&#233;quivalences, toujours plus difficile en langue que dans d'autres domaines du monde 
physique, ne peut se faire s&#233;rieusement qu'&#224; la condition expresse que les transformations ne 
portent que sur des changements de structure ou des changements morpho-acoustiques dont la 
tra&#231;abilit&#233; -- ou la reconstructibilit&#233; -- est garantie par des constantes d&#233;rivationnelles ou des 
associations fig&#233;es consign&#233;es dans le dictionnaire. Ainsi tout le monde acceptera qu'il y a 
&#233;quivalence entre 
[a] A l'heure qu'il est la voiture des voisins a s&#251;rement d&#233;fonc&#233; la vitrine de ton magasin 
 et 
[a'] A l'heure qu'il est la vitrine de ton magasin a s&#251;rement &#233;t&#233; d&#233;fonc&#233;e par la voiture des 
voisins 
 ou m&#234;me 
[b] Il a &#233;t&#233; tu&#233; par la racaille pendant qu'il dormait 
 et  
[b'] La racaille l'a tu&#233; pendant son sommeil 
mais on aura, &#224; tort ou &#224; raison l&#224; n'est pas pour le moment la question, beaucoup plus de mal 
&#224; admettre qu'il y a la m&#234;me &#233;quivalence entre [a] et 
[c] Au moment o&#249; je te parle la vitrine de ton magasin a sans aucun doute &#233;t&#233;  enfonc&#233;e par 
l'auto des gens d'&#224; c&#244;t&#233; 
ou entre [b'] et 
[d] On l'a but&#233;. La racaille. Il roupillait. 
</p>
<p>Pour la m&#234;me raison et bien qu'il y ait une &#233;quivalence fonctionnelle indiscutable entre les 
deux &#233;nonc&#233;s: 
 [e] mais il  se fait tard   et  [f] mais il est temps de partir 
 produits avec &#224; leur gauche 
 [g] Je serais bien rest&#233; encore une heure 
 et &#224; leur droite 
 [g] et je n'aime pas conduire la nuit. 
 [e] et [f], situationnellement &#233;quivalents, ne sont g&#233;n&#233;ralement pas consid&#233;r&#233;s comme tels 
linguistiquement.  
</p>
<p>Ces restrictions n'ont rien d'absurde et ne doivent pas &#234;tre confondues avec on ne sait quelle 
m&#233;fiance vis-&#224;-vis des intuitions s&#233;mantiques. Il n'y a pas d'analyse reproductible de la langue 
comme d'ailleurs de n'importe quel autre objet qui ne porte sur des formes pr&#233;cis&#233;ment 
identifiables. Pas d'analyse fiable dont la tra&#231;abilit&#233; des op&#233;rations, leur reconstruction, ne soit 
pas parfaite. Les &#233;quivalences dict&#233;es par l'intuition s&#233;mantique sont fondamentales mais elles 
doivent &#234;tre trait&#233;es avec une grande d&#233;licatesse et une conscience aigue de la totalit&#233; de leurs 
</p>
<p>9  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>effets. Maurice Gross y a toujours fait appel, dans son enseignement comme dans ses &#233;crits. 
Pas pour les exclure ou les disqualifier mais au contraire pour en expliciter toute la gamme. 
Pour montrer que si on n'est pas, en la mati&#232;re, exhaustif, on ne peut que se tromper sur la part 
qu'on a retenue arbitrairement. Une l&#233;gende qui a la peau dure parce qu'elle est r&#233;guli&#232;rement 
aliment&#233;e par des s&#233;manticiens jaloux d'en avoir fait moins avec leur s&#233;mantique pour le 
d&#233;veloppement de la s&#233;mantique que n'en a fait Maurice avec le seul lexique-grammaire, 
voudrait que Maurice Gross, dans le sillage d'un certain nombre de distributionalistes et de 
g&#233;n&#233;rativistes ait exclu m&#233;thodologiquement la s&#233;mantique de ses analyses. C'est absolument 
faux. L'un des principaux articles de Maurice et celui que je consid&#232;re personnellement 
comme l'un des plus importants pour qui veut vraiment comprendre l'orientation qu'il a 
donn&#233;e au Lexique-grammaire , l'article livre (45 pages) qu'il a publi&#233; en 1981 dans le num&#233;ro 
63 de la revue Langages pr&#233;par&#233; sous la direction d'Alain Guillet et Christian Lecl&#232;re sur le 
th&#232;me Formes syntaxiques et pr&#233;dicats s&#233;mantiques s'intitulait &quot;Les bases empiriques de la 
notion de pr&#233;dicat s&#233;mantique&quot;. De la premi&#232;re &#224; la derni&#232;re page, cet article discute la 
question majeure qui agite, depuis Aristote, la r&#233;flexion sur le rapport exact entre la 
disposition de formes appartenant &#224; un nombre fini de cat&#233;gories et le d&#233;ploiement de 
l'information qui en r&#233;sulte et qui construit le sens en langue. Il le fait en d&#233;ployant les 
diff&#233;rentes configurations d'une relation g&#233;n&#233;rale op&#233;rateur / argument &#224; travers laquelle on 
reconna&#238;t la quasi totalit&#233; des probl&#232;mes soulev&#233;s par les s&#233;mantiques de l'actance, des 
niveaux d'&#233;nonciation, des grammaires de cas, de r&#244;les et j'en passe. Il montre ensuite 
comment en fonction du nombre et de la nature des arguments coupl&#233;s &#224; la nature de 
l'op&#233;rateur on passe progressivement et selon un continuum dont la complexit&#233; refl&#232;te 
magistralement les m&#233;andres emprunt&#233;s par les langues naturelles pour nuancer et modaliser 
l'expression de l'information, &#224; une inversion de la relation pr&#233;dicative dont le foyer devient le 
nom et le verbe un simple support du pr&#233;dicat nominal. 
</p>
<p>La d&#233;monstration de Maurice Gross dans cet article n'est possible, reproductible et cr&#233;dible 
que parce que l'assise formelle des &#233;quivalences auxquelles elle a recours respecte 
scrupuleusement la fronti&#232;re que vous avons signal&#233;e plus haut entre d'une part les 
&#233;quivalences qui ne retiennent que les transformations de structure et les modifications 
morpho-acoustiques qui s'appuient sur des constantes d&#233;rivationnelles inscrites dans la 
structure du lexique, d'autre part les &#233;quivalences fonctionnelles ou s&#233;mantiques plus 
g&#233;n&#233;rales qui se contentent d'une ad&#233;quation situationnelle. 
</p>
<p>Mais sa d&#233;monstration ne serait pas non plus possible s'il n'y avait pas recours de mani&#232;re 
quasi syst&#233;matique &#224; un concept formellement nouveau: celui de restructuration. 
</p>
<p>2. Les restructurations  
Maurice Gross les mentionne pour la premi&#232;re fois dans  M&#233;thodes en syntaxe (1975 : 142-
143) parmi les transformations nouvelles qu&#8217;il propose pour &#171;condenser en une seule entr&#233;e 
de nombreuses paires de constructions qui autrement devraient &#234;tre consid&#233;r&#233;es comme non 
apparent&#233;es&#187;. Il signale qu&#8217;elles ont leur origine conceptuelle dans la transformation de 
mont&#233;e du sujet [raising]: 
</p>
<p> Il semble que Marie travaille &#8594; Marie semble travailler 
 mais aussi dans des constructions du type: 
</p>
<p>Paul voit que Marie travaille &#8594; Paul voit Marie travailler 
 ou  
</p>
<p>Paul emp&#234;che que la table tombe &#8594; Paul emp&#234;che la table de tomber 
</p>
<p>10  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>et propose de les g&#233;n&#233;raliser &#224; des paires du type: 
Paul admire les qualit&#233;s de Marie &#8594; Paul admire Marie pour ses qualit&#233;s 
</p>
<p>ou 
Paul r&#233;fr&#232;ne les &#233;lans de Marie &#8594;Paul r&#233;fr&#232;ne Marie dans ses &#233;lans 
</p>
<p>ou encore 
Paul r&#233;compense le geste de Marie &#8594; Paul r&#233;compense Marie de son geste. 
</p>
<p>Il ajoute que cette relation pourrait &#234;tre &#233;tendue &#224; des phrases &#171;s&#233;mantiquement voisines&#187; 
comme Paul ch&#226;tie Marie d&#8217;avoir faut&#233; et Paul ch&#226;tie la faute de Marie et qu&#8217; &#171;une partie de 
la diversit&#233; que l&#8217;on observe dans les contraintes s&#233;mantiques entre les N et les V pourrait 
donc &#234;tre d&#233;crite au moyen de telles transformations et non pas au moyen de r&#232;gles de 
s&#233;lection&#187; et poursuit: &#171; Nous aurions pour nos exemples : 
</p>
<p>N&#176; V  
</p>
<p>                                                
</p>
<p>N-app de N -hum &#8594; No V N -hum Pr&#233;p N -app               
et   Prep N-app serait &#233;ventuellement effa&#231;able, y compris avec un N -nr   comme  dans 
</p>
<p>Paul loue sa chemise (E + pour sa solidit&#233;) &#8594; Paul loue sa solidit&#233;. 
A l&#8217;&#233;poque il remarquait que si &#171;de telles op&#233;rations modifient consid&#233;rablement la structure 
des phrases sur lesquelles elles op&#232;rent&#187;, &#171;leurs d&#233;tails de fonctionnement sont encore mal 
connus&#187;. 
</p>
<p>De fait, ces m&#233;canismes avaient fait l'objet d'un grand d&#233;bat aux Etats-Unis, amorc&#233; en grande 
partie par la circulation plus ou moins informelle, dans un prolongement critique de Aspects of 
the the Theory of Syntax de Noam Chomsky, paru en 1965, de ce qu'on appelle outre-
atlantique un underground classic: le texte de George Lakoff On the Nature of Syntactic 
Irregularity3. Con&#231;u au d&#233;part comme une r&#233;flexion strictement interne aux hypoth&#232;ses 
chomskyennes, le texte, selon l'expression utilis&#233;e par James Mc Cawely dans la pr&#233;face, 
&quot;pr&#233;sente un large &#233;ventail d'analyses autoris&#233;es par Aspects (&#8230;) mais qui conduisent &#224; 
postuler des structures profondes consid&#233;rablement plus transparentes s&#233;mantiquement que 
celles qui avaient &#233;t&#233; propos&#233;es jusque l&#224;&quot; et aboutit &#224; au moins quatre conclusions: 
</p>
<p>(1) Le sens d'un &#233;nonc&#233; de surface peut &#234;tre reconstruit enti&#232;rement &#224; partir de sa 
structure profonde &#224; condition que les faits d'interpr&#233;tation s&#233;mantique soient trait&#233;s 
sur un pied d'&#233;galit&#233; avec les jugements de grammaticalit&#233;. 
</p>
<p>(2) Le recours aux faits d'interpr&#233;tation s&#233;mantique permet de maintenir au strict 
minimum le nombre de cat&#233;gories grammaticales que les analyses 
transformationnelles avaient tendance &#224; multiplier. 
</p>
<p>(3) La notion d'exception, m&#234;me relative &#8211; celle qu'on traiterait aujourd'hui sous la forme 
d'une r&#232;gle ou d'une grammaire &quot;locale&quot; --, peut et doit dispara&#238;tre avec l'int&#233;gration &#224; 
la grammaire des g&#233;n&#233;ralisations d'ordre s&#233;mantique. 
</p>
<p>(4) Certaines entr&#233;es lexicales doivent &#234;tre consid&#233;r&#233;es comme &quot;complexes&quot;. Ainsi un 
verbe comme entrer doit &#234;tre trait&#233; &quot;as a verb synonymus with in but obligatorly 
combined with the inchoative pro-verb &lt;become&gt; (or whatever the basic inchoative 
element is called). Ce pro-verb &quot;is part of the meaning of enter and still have clauses 
</p>
<p> 
3 Publi&#233; en 1970 par Holt, Rinehart and Winston sous le titre Irregularity in Syntax. 
</p>
<p>11  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>with enter derived through an application of the inchoative transformation or rather 
the more general transformation of &quot;predicate raising&quot; of which &quot;inchoative&quot; and 
&quot;causative&quot; are special cases&quot;. 
</p>
<p>R&#233;trospectivement on voit bien que si les deux premi&#232;res conclusions sont &#224; la fois tr&#232;s 
g&#233;n&#233;rales et tr&#232;s d&#233;pendantes du cadre th&#233;orique et m&#233;thodologique choisi, donc d'une port&#233;e 
relativement limit&#233;e dans la r&#233;solution des probl&#232;mes universels de la description des langues, 
les deux derni&#232;res, quoique d'une apparence beaucoup plus technique, exc&#232;dent largement le 
champ des pol&#233;miques propres au champ transformationnel. Les questions qu'elles ont 
soulev&#233;es sont d'ailleurs aujourd'hui au c&#339;ur de pratiquement toutes les approches qui se 
proposent une description unifi&#233;e des langues et du langage. Et ce n'est pas un hasard si 
l'&#339;uvre de Maurice Gross y apporte des r&#233;ponses claires. 
</p>
<p>L'ensemble des travaux de Maurice Gross s'oppose nettement &#224; la troisi&#232;me conclusion: 
aucune g&#233;n&#233;ralisation d'ordre s&#233;mantique ne peut &#234;tre int&#233;gr&#233;e &#224; la grammaire de telle sorte 
qu'on n'ait pas besoin de postuler l'existence de ces micro-climats que sont les grammaires 
locales. Pour Maurice Gross la notion m&#234;me d'une grammaire universelle des langues 
naturelles &#233;trang&#232;re aux exceptions, qu'elle soit exprim&#233;e en termes purement formels &#8211; on 
dirait aujourd'hui purement linguistiques &#8211; ou en termes formels et s&#233;mantiques &#8211; on dirait 
aujourd'hui cognitifs et gestaltiens &#8211; est l'&#233;ternel miroir aux alouettes qui a entrav&#233; les progr&#232;s 
r&#233;els d'une science authentique du langage m&#234;me si les th&#233;ories formul&#233;es dans cette direction 
ont pu parfois donner l'impression d'avoir accompli une r&#233;volution &#233;pist&#233;mologique. Sur ce 
point, comme sur quelques autres mais de moindre importance, ses recherches l'opposeront 
toujours tout aussi bien &#224; Noam Chomsky et &#224; tous ceux qui se maintiennent dans sa 
perspective strictement computationnelle qu'&#224; George Lakoff et &#224; tous les tenants pass&#233;s ou 
pr&#233;sents d'une s&#233;mantique g&#233;n&#233;rative ou d'un cognitivisme strict. Je ne sais pas si Maurice 
Gross a lu l'ouvrage de Steven Pinker Words and Rules (1999) produit, si l'on en croit son 
auteur, d'une douzaine d'ann&#233;es de recherches sur les seuls verbes irr&#233;guliers de l'anglais et de 
l'allemand dans le but de s'expliquer comment se fait-il que les enfants qui ont pour langue 
maternelle ces deux langues ma&#238;trisent assez rapidement cette jungle d'irr&#233;gularit&#233;s et 
comment doit-on s'expliquer les erreurs qu'ils commettent et que commettent les adultes en 
les utilisant, comment se fait-il que ces verbes ont, dans les deux langues, une fr&#233;quence 
d'occurrence beaucoup plus &#233;lev&#233;e que celle des verbes r&#233;guliers mais qu'aussi bien les verbes 
rares que les n&#233;ologismes y sont, par contre, form&#233;s sur le mod&#232;le des verbes r&#233;guliers et 
enfin, surtout, comment se fait-il qu'il existe, pour peu qu'on prenne la peine d'y regarder de 
plus pr&#232;s, une constante dans la formation des irr&#233;guliers, que ce soit en allemand, en anglais 
ou dans six autres langues: une r&#232;gle de placement d'un infixe&#8230;(Pinker 99: 211-239). 
Autrement dit que le fonctionnement des langues s'accomode parfaitement bien de la 
coexistence de &quot;a mental dictionary of memorized words and a mental grammar of creative 
rules&quot;. Je pense qu'ayant pass&#233; sa vie &#224; &#233;tablir dans leurs moindres d&#233;tails les modalit&#233;s de 
cette cohabitation il aurait tout au moins appr&#233;ci&#233; que le probl&#232;me soit pos&#233; en ces termes. 
Reste &#224; d&#233;terminer naturellement la configuration sous laquelle les mots sont m&#233;moris&#233;s et la 
nature des constantes qui permettent d'acc&#233;der &#224; cette configuration. C'est-&#224;-dire les 
conditions qui rendent possible un traitement formel automatisable. Et ceci nous m&#232;ne tout 
naturellement &#224; la position de Maurice Gross vis-&#224;-vis de la quatri&#232;me conclusion. 
</p>
<p>Maurice Gross n'a jamais rejet&#233; l'id&#233;e qu'il puisse exister des entr&#233;es de dictionnaire qui 
synth&#233;tisent des entr&#233;es plus simples. Il n'a donc jamais rejet&#233; l'id&#233;e qu'une entr&#233;e de 
dictionnaire ayant une forme simple soit en fait une entr&#233;e complexe mais il n'a jamais 
accept&#233; la forme de complexit&#233; postul&#233;e par la s&#233;mantique g&#233;n&#233;rative. Il a vu imm&#233;diatement 
</p>
<p>12  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>ce que tout le monde, y compris les promoteurs de l'id&#233;e finiront par voir, &#224; savoir l'absence 
d'isotopie entre les pr&#233;dicats s&#233;mantiques simples plus ou moins g&#233;n&#233;riques et abstraits et leur 
r&#233;alisation effective dans une langue et a fortiori dans difff&#233;rentes langues. En effet, 
contrairement aux relations d'encha&#238;nement ou aux relations combinatoires entre op&#233;rateurs 
autonomes o&#249; rien ne s'oppose &#224; l'existence d'une s&#233;mantique universelle dans la mesure o&#249; 
l'universalit&#233; concerne la relation ou la fonction elle-m&#234;me, les unit&#233;s lexicales, m&#234;me quand 
elles sont interpr&#233;tables en termes de relations ou d'encha&#238;nements entre op&#233;rateurs 
constituent, &#224; chaque fois, une capture et un figement particuliers non seulement de cette 
relation ou de cet encha&#238;nement mais aussi de l'historique, de la g&#233;n&#233;alogie tr&#232;s particuli&#232;re et 
tout &#224; fait al&#233;atoire de cette capture. C'est ce qui explique que deux mots d'une m&#234;me langue 
et de sens tr&#232;s proches voire identiques &#8211; par exemple: se rappeler et se souvenir dans Je me 
(rappelle + souviens) de lui comme si c'&#233;tait hier --  restent tout &#224; fait distincts dans certaines 
constructions sans que ce qui a expliqu&#233; leur sens par d&#233;composition s&#233;mantique g&#233;n&#233;rique 
puisse expliquer la diff&#233;rence &#8211; par exemple &#199;a me rappelle quelque chose oppos&#233; &#224; *&#199;a me 
souvient quelque chose et Il me souvient de te l'avoir d&#233;j&#224; dit oppos&#233; &#224; *Il me rappelle de te 
l'avoir d&#233;j&#224; dit. Et ce qui est vrai &#224; l'int&#233;rieur de la m&#234;me langue l'est encore plus entre 
plusieurs langues. 
</p>
<p>Dans le cadre du lexique-grammaire de Maurice Gross ce type de diff&#233;rence s'explique &#224; la 
fois plus naturellement et plus formellement par le fait qu'&#224; un Je me souviens de peut 
correspondre un J'ai le souvenir de alors que pour un Je me rappelle de il n'existe pas un *J'ai 
le rappel de correspondant et que, parall&#232;lement, il existe une &#233;quivalence naturelle entre 
Nous lui avons &#233;crit pour lui rappeler que pass&#233; le 30 avril ce serait le tribunal s'il ne 
s'ex&#233;cutait pas et Nous lui avons envoy&#233; un rappel comme quoi pass&#233; le 30 avril ce serait le 
tribunal s'il ne s'ex&#233;cutait pas mais qu'on ne retrouverait pas d'&#233;quivalence comparable avec 
souvenir si l'&#233;nonc&#233; de d&#233;part, au demeurant tout &#224; fait plausible, &#233;tait Nous lui avons &#233;crit 
pour qu'il se souvienne que pass&#233; le 30 avril ce serait le tribunal s'il ne s'ex&#233;cutait pas. Enfin 
qu'il est clair que dans une langue comme le fran&#231;ais il y a syntaxiquement et s&#233;mantiquement 
une m&#233;moire qui revient et qui construit le champ lexico-grammatical du souvenir et une 
m&#233;moire qu'on sollicite et qui construit le champ lexico-grammatical du rappel, qu'il peut y 
avoir intersection entre les d&#233;riv&#233;s verbaux et certaines de leurs constructions mais que 
l'&#233;conomie g&#233;n&#233;rale de l'imbrication des deux champs n'a pas &#233;t&#233; donn&#233;e par la logique de 
leur interpr&#233;tation s&#233;mantique mais par l'historique des figements partiels et asym&#233;triques, des 
sp&#233;cialisations, dict&#233;s par l'usage. Ce qui est n&#233;anmoins remarquable c'est l'existence, partout 
et toujours au sein de ces ph&#233;nom&#232;nes de classes d'&#233;quivalences et de points de neutralisation 
des contraintes. A condition de respecter les faits de langue et de ne n&#233;gliger aucun des &#233;tats, 
aucune des transformations possibles d'une forme, il existera toujours un lieu d'&#233;quivalence 
s&#233;mantique entre deux formes morpho-syntaxiquement diff&#233;rentes o&#249; ces deux formes 
s'&#233;quilibreront &#8211; ou se neutraliseront --  montrant du m&#234;me coup le ou les param&#232;tre(s), parmi 
leurs constituants et les conditions de stabilit&#233; de la configuration, dont une l&#233;g&#232;re variation 
entra&#238;ne une importante diff&#233;rence de sens. D'o&#249; l'importance cruciale des restructurations. 
</p>
<p>La quatri&#232;me conclusion du texte de George Lakoff fait &#233;tat d'une transformation inchoative 
qui ne serait qu'un cas particulier d'une transformation plus g&#233;n&#233;rale de mont&#233;e du sujet celle-
l&#224; m&#234;me donc dans laquelle Maurice Gross voit l'origine conceptuelle des restructurations 
comme nous l'avons signal&#233; plus haut. Cette convergence entre deux auteurs et deux &#233;coles 
qui, par ailleurs, divergent sur presque tout n'est ni inconsciente ni fortuite et permet de tracer 
tr&#232;s pr&#233;cis&#233;ment la ligne de d&#233;marcation qui les s&#233;pare et qui repose enti&#232;rement sur la 
conception que chaque camp se fait de la nature du lexique et de son r&#244;le dans les processus 
</p>
<p>13  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>grammaticaux et dans l'interpr&#233;tation s&#233;mantique qui en d&#233;coule. En effet, la transformation 
de mont&#233;e du sujet [raising] est, malgr&#233; l'extension de son domaine d'application &#8211; l'existence 
d'une litt&#233;rature abondante et ancienne dans et sur diff&#233;rentes langues n'emp&#234;che pas qu'on lui 
trouve encore de nouveaux champs d'application4-, une transformation &#233;troitement li&#233;e aux 
classes de verbes qui l'autorisent mais ces classes n'appartiennent pas, loin de l&#224;, &#224; un 
ensemble s&#233;mantiquement homog&#232;ne. Elles n'appartiennent pas non plus &#224; un ensemble 
grammaticalement coh&#233;rent qui d&#233;finirait une forme ou une autre de grammaire locale ou de 
classe linguistiquement naturelle sous quelque forme que ce soit. L'ensemble des verbes qui 
autorisent une mont&#233;e du sujet se retrouvent dans diff&#233;rentes tables de construction et la 
mont&#233;e du sujet n'est une propri&#233;t&#233; d&#233;finitoire pour aucune de ces tables. On a donc affaire &#224; 
un m&#233;canisme assez paradoxal: &#224; la fois lexicalement d&#233;pendant et s&#233;mantiquement 
ind&#233;pendant de ce lexique dont il d&#233;pend. Ce n'est pas le moindre des m&#233;rites de Maurice 
Gross d'avoir compris &#224; quel point ce paradoxe &#233;tait constitutif des langues naturelles et 
n'avait aucun &#233;quivalent en dehors d'elles. C'est un autre de ses m&#233;rites, qu'il doit &#224; sa 
formation math&#233;matique, d'avoir compris qu'&#224; condition de ne pas s'appuyer sur une base 
logique ou cognitive, l'analyse formelle des langues naturelles et l'analyse automatique qui en 
d&#233;coule, pouvaient surmonter ce paradoxe. Plut&#244;t que d'essayer de d&#233;passer le paradoxe 
linguistique en l'incluant dans une probl&#233;matique cognitive qui lui est ext&#233;rieure m&#234;me si elle 
le subsume &#8211; ce que faisait George Lakoff &#224; l'&#233;poque et qu'il continue encore &#224; faire 
aujourd'hui en incluant tous les m&#233;canismes de la langue &#224; l'int&#233;rieur d'une forme de 
m&#233;taphore g&#233;n&#233;ralis&#233;e &#8211; Maurice Gross va construire deux espaces linguistiques &#224; la fois 
distincts et &#233;troitement d&#233;pendants: d'une part, un dictionnaire dont l'architecture est le produit 
d'une entreprise de classement de tr&#232;s longue haleine et o&#249; les crit&#232;res de classement 
d&#233;coulent tous d'une mani&#232;re particuli&#232;re de construire des classes d'&#233;quivalence; d'autre part 
un algorithme auquel on a appris &#224; utiliser le dictionnaire avec des outils exclusivement 
linguistiques c'est-&#224;-dire avec les structures et les contraintes de la grammaire et avec elles 
seules. Que l'analyse descriptive vise &#224; extraire de l'information ou &#224; traduire elle adopte la 
forme d'un itin&#233;raire d'applications ordonn&#233;es d'op&#233;rateurs &#224; des arguments. Lorsque ces 
applications ne sont pas, dans la r&#233;alit&#233; des usages des langues naturelles, lin&#233;aires, ce qui est 
fr&#233;quemment le cas, l'algorithme doit les lin&#233;ariser par une d&#233;composition des contraintes via 
la construction de classes d'&#233;quivalences. Concr&#232;tement cela implique soit un retour au 
dictionnaire pour y trouver les composants les plus &#233;l&#233;mentaires dont la combinatoire non 
contrainte ou fig&#233;e donnera l'&#233;quivalent de la contrainte complexe &#224; analyser, soit, lorsque le 
dictionnaire ne r&#233;pond pas, la construction d'un parcours lin&#233;aire simple &#233;quivalent au 
parcours non lin&#233;aire complexe. Mais dans le second cas, l'algorithme ne pouvant inventer  
l'&#233;quivalence elle doit avoir &#233;t&#233; pr&#233;vue par le programme. C'est l'une des raisons pour 
                                                 
4 En fran&#231;ais, on doit le premier article important sur le sujet &#224; Nicolas Ruwet, ancien ami de Maurice Gross, 
</p>
<p>mort une semaine avant lui. L'article a &#233;t&#233; publi&#233; &#224; une &#233;poque o&#249; les deux hommes enseignaient dans le 
m&#234;me d&#233;partement de la m&#234;me Universit&#233; de Paris 8-Vincennes, celui-l&#224; m&#234;me dont Noam Chomsky devait 
dire que c'&#233;tait le meilleur d&#233;partement de linguistique au monde en dehors des Etats-Unis: &quot;Note sur la 
syntaxe du pronom en et d'autres sujets apparent&#233;s&quot;, Langue fran&#231;aise 6, 1970: 70-83; il sera repris sous une 
version remani&#233;e et augment&#233;e sous le titre &quot;La syntaxe du pronom en et la transformation de mont&#233;e du sujet&quot; 
in Ruwet 72: 48-86. La mont&#233;e du sujet est l'un des outils qui nous ont permis tr&#232;s r&#233;cemment et &#224; partir 
d'observations d'inspiration guilaumienne de Jacqueline Picoche, des travaux de Robert D. Van Valin &amp; 
Randy J. LaPolla dans le cadre de la Role and Reference Grammar, des recherches de Jacques Fran&#231;ois (BSLP 
99) et de nos propres travaux sur les supports, d'isoler une nouvelle cat&#233;gorie de verbes, les verbes supports de 
point de vue (&quot;Une nouvelle cat&#233;gorie de supports: les verbes supports de point de vue&quot;, Communication au 
21&#232;me colloque international Grammaires et lexiques compar&#233;s, Bari / Monopoli du 19 au 23 septembre 2002 
&amp; &#224; para&#238;tre). 
</p>
<p>14  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>lesquelles il est imp&#233;ratif de conna&#238;tre dans chaque langue toutes les restructurations 
possibles.  
</p>
<p>Cette approche, tr&#232;s fortement marqu&#233;e par l'enseignement de Zellig Sabbetai Harris &#224; 
l'&#233;poque o&#249; il &#233;labore Mathematical Structures of Language qui para&#238;t en 1968 mais dont la 
pr&#233;paration co&#239;ncide en partie avec la pr&#233;sence de Maurice Gross &#224; l'Universit&#233; de 
Pennsylvanie, ne se confond cependant pas avec l'approche harrisienne. Il l'&#233;crit clairement 
dans M&#233;thodes en syntaxe : &quot;Le point de vue que nous avons adopt&#233; pour l'objet des 
descriptions est encore diff&#233;rent de celui de Harris. Harris consid&#232;re que le sens ou 
l'information sont limit&#233;s aux phrases noyaux, et que les variations de formes (i.e. les 
transformations) constituent &quot;un bruit&quot; qu'il est n&#233;cessaire d'&#233;liminer pour atteindre le sens. 
Il met donc l'accent sur les transformations qui, appliqu&#233;es aux phrases complexes, 
permettent de les analyser en phrases simples. Harris obtient donc la description des phrases 
simples comme une simple cons&#233;quence (un r&#233;sidu) de la description transformationnelle&quot; 
alors que pour Maurice Gross &quot;divers faits de langue fondamentaux (peuvent) ne pas se situer 
dans les m&#233;canismes r&#233;currents, mais au niveau des phrases simples&quot; (Gross 75: 18-19). D'o&#249; 
l'importance voire la priorit&#233; de la construction pr&#233;alable d'un dictionnaire, ce dont Zellig S. 
Harris ne s'est jamais occup&#233;. 
</p>
<p>D'o&#249; aussi l'enthousiasme finalement plut&#244;t mod&#233;r&#233; de Maurice Gross pour d'autres 
d&#233;veloppements issus de la mouvance harrissienne comme les grammaires en cha&#238;ne de 
Morris Salkoff ou compatibles avec certains de ses principaux principes transformationnels 
comme les Tree Adjoining Grammars (TAG) de Aravind K. Joshi qui a travaill&#233; &#224; l'Universit&#233; 
de Pennsylvanie et exerc&#233; une grande influence sur la linguistique computationnelle5. Ces 
travaux  ne tiennent pas compte de ces fameux &quot;faits de langue fondamentaux&quot; qui se jouent 
exclusivement au niveau de la phrase simple, ont une assise strictement lexicale mais 
interviennent n&#233;anmoins dans bon nombre de restructurations et m&#234;me de transformations 
sans qu'il soit possible ou raisonnable de les r&#233;duire &#224; des bruits ou &#224; des r&#233;sidus, m&#234;me si a 
priori , &#224; premi&#232;re vue, ils ne paient pas de mine et semblent n'&#234;tre que des ph&#233;nom&#232;nes 
secondaires, voire marginaux. Parmi eux des ph&#233;nom&#232;nes comme ceux qui se jouent &#224; 
l'int&#233;rieur de ce qu'il est g&#233;n&#233;ralement convenu d'appeler aujourd'hui les pr&#233;dicats complexes 
ou ceux qui sont impliqu&#233;s par ce que certains appellent la pr&#233;dication seconde. Autrement 
dit la nature m&#234;me de la pr&#233;dication, qu'il attaque de front dans l'article de 1981 auquel nous 
faisions allusion plus haut avant d'aborder la question des restructurations et sur laquelle nous 
reviendrons tout &#224; l'heure. 
</p>
<p>Rappelons simplement que la p&#233;riode o&#249; il &#233;labore cet outil et acquiert la conviction que les 
questions les plus importantes de la description linguistique sont  aussi celles qui permettront 
de faire faire des progr&#232;s d&#233;cisifs &#224; l'analyse automatique en cernant la vraie source de 
l'irr&#233;gularit&#233; grammaticale, co&#239;ncide en grande partie avec sa p&#233;riode la plus am&#233;ricaine et que 
celle-ci, par un hasard de l'histoire, est aussi l'une de celles o&#249; le d&#233;bat sur la forme des r&#232;gles 
de grammaire, le statut de l'exception et la relation des deux au lexique atteint une qualit&#233;, une 
intensit&#233; et une richesse sans pr&#233;c&#233;dent et qu'on n'a pas encore retrouv&#233;es depuis. 
</p>
<p> 
                                                 
5 Les principaux travaux &#224; l'initiative de A. K. Joshi ou inspir&#233;s par lui s'&#233;tendent de 1975 &#224; 1992. Ils ont &#233;t&#233; 
</p>
<p>introduits en France et appliqu&#233;s au fran&#231;ais &#224; partir de la th&#232;se d'Anne Abeill&#233; Une grammaire lexicalis&#233;e 
d'arbres adjoints pour le fran&#231;ais. 
</p>
<p>15  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>Maurice Gross passera toujours, pendant pr&#232;s de quarante ans, au moins un mois, souvent 
deux, en Am&#233;rique du Nord, mais d'octobre 1961, date &#224; laquelle il commence un stage de 
recherches au Massachussetts Institute of Technology et &#224; l'Universit&#233; de Harvard sous la 
direction de Noam Chomsky, avec une bourse de l'UNESCO, &#224; octobre 1968 lorsqu'il est 
nomm&#233; Ma&#238;tre de Conf&#233;rences &#224; l'Universit&#233; Paris VIII, son activit&#233; de recherche s'effectue 
principalement dans les universit&#233;s am&#233;ricaines, au MIT et &#224; Harvard mais &#233;galement &#224; 
l'Universit&#233; de Pennsylvanie, &#224; l'Universit&#233; de Californie &#224; Los Angeles, &#224; l'Universit&#233; de 
Californie &#224; San Diego et &#224; l'Universit&#233; de l'Illinois &#224; Champaign-Urbana. A deux reprises, en 
1966 &#224; Los Angeles et en 1968 &#224; Champaign-Urbana, il est conf&#233;rencier invit&#233; au plus 
important rassemblement annuel, &#224; l'&#233;poque, de linguistes de la plan&#232;te, l'&#233;cole d'&#233;t&#233; de la 
Linguistic Society of America. 
</p>
<p>Si on oublie un peu ce c&#244;t&#233; am&#233;ricain de Maurice Gross c'est que c'est &#233;galement &#224; cette 
&#233;poque que paraissent en France et en fran&#231;ais ses deux premiers ouvrages fondamentaux. Le 
fameux Notions sur les grammaires formelles &#233;crit avec Andr&#233; Lentin. Traduit peu apr&#232;s sa 
parution en 1966 en anglais, allemand, russe, japonais et espagnol, l'ouvrage devient vite une 
r&#233;f&#233;rence absolue en mati&#232;re de traitement formel des langues naturelles. Deux ans plus tard 
para&#238;t le non moins fameux Grammaire transformationnelle du fran&#231;ais: syntaxe du verbe, 
traduction du fruit de son travail avec Zellig S. Harris Transformational Analysis of French 
Verbal Constructions achev&#233; en 1966. Entre les deux ouvrages il trouve le temps de soutenir 
en Sorbonne, en 1967, un doctorat de 3&#232;me cycle de traitement automatique des langues 
naturelles, sur le th&#232;me Analyse formelle compar&#233;e des compl&#233;tives en fran&#231;ais et en anglais. 
De fait, l'une des p&#233;riodes les plus productives et les plus d&#233;cisives de son parcours a co&#239;ncid&#233; 
tr&#232;s exactement avec les ann&#233;es o&#249; la grande majorit&#233; des linguistes les plus actifs pour ne pas 
dire des meilleurs donnaient dans l'espace o&#249; il travaillait le meilleur d'eux-m&#234;mes. 
</p>
<p>C'est dans ce contexte qu'ayant m&#251;ri les choix &#233;pist&#233;mologiques et m&#233;thodologiques que nous 
avons en grande partie &#233;voqu&#233;s, et qui se condensent dans le mot compos&#233; Lexique-
grammaire dont il a baptis&#233; son travail pour montrer qu'il ne peut y avoir de discontinuit&#233; 
entre le lexique et la grammaire, qu'il cr&#233;e en 1968 le LAboratoire d'Automatique 
Documentaire et Linguistique (LADL), l'un des premiers, sinon le premier v&#233;ritable 
laboratoire de linguistique en France et qui va devenir une &#233;quipe du CNRS autour d'un noyau 
d'informaticiens et de linguistes. Compagnons de la premi&#232;re heure et qui lui resteront fid&#232;les 
jusqu'au bout de leur vie ou de la sienne: Morris Salkoff qui l'a suivi des Etats-Unis, Jean-Paul 
Boons, auteur de l'un des articles les plus g&#233;niaux et les plus courts de l'histoire de la 
linguistique fran&#231;aise, &quot;M&#233;taphore et baisse de la redondance&quot;6 o&#249; il lie le caract&#232;re facultatif 
ou obligatoire de l&#8217;objet interne d&#8217;une classe de verbes au fait que l&#8217;&#233;nonc&#233; soit pris au sens 
propre (objet interne facultatif) ou figur&#233; (objet interne obligatoire) et le montre par le biais 
d&#8217;un type particulier de paraphrases aux &#233;quivalences imparfaites o&#249; la possibilit&#233; ou non   
d&#8217;effacer ou de reconstruire le verbe mettre joue un r&#244;le central et qui sont toutes des 
restructurations: 
</p>
<p> Pierre a  truff&#233; le terrain &#8596; Pierre a mis des truffes dans le terrain 
Pierre a truff&#233; le terrain d&#8217;explosifs &#8592; *Pierre a mis des truffes dans le terrain d&#8217;explosifs &#8592; 
Pierre a mis des explosifs dans le terrain comme on y mettrait des truffes. 
</p>
<p>                                                 
6 Langue fran&#231;aise 11, Paris:Larousse, 1971: 15-16. 
</p>
<p>16  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>Pierre a farci la dinde. 
Pierre a farci la dinde de riz &#8596; Pierre a mis une farce de riz dans la dinde. 
</p>
<p>*?Pierre a farci son texte. 
Pierre a farci son texte de citations &#8592; *?Pierre a mis une farce de citations dans son texte &#8592; 
Pierre a mis des citations dans son texte comme s&#8217;il le farcissait d&#8217;une farce. 
</p>
<p>Christian Lecl&#232;re, auteur de &quot;Datifs syntaxiques et datif &#233;thique&quot;7, l'une des contributions 
choisies par Maurice Gross et Jean-Claude Chevalier pour figurer dans le recueil appel&#233; &#224; 
devenir un livre-culte M&#233;thodes en grammaire fran&#231;aise destin&#233; &#224; servir de mod&#232;le &#224; ce que 
peuvent &#234;tre des &#233;tudes modernes qui se d&#233;marquent des &#233;tudes traditionnelles &quot;par le 
caract&#232;re formel des m&#233;thodes employ&#233;es&quot;, 
</p>
<p>Alain Guillet qui publiera avec les deux pr&#233;c&#233;dents La structure des phrases simples du 
fran&#231;ais: constructions intransitives (1976) puis, avec Christian Lecl&#232;re La structure des 
phrases simples du fran&#231;ais: constructions transitives locatives (1992), deux volumes qui 
constituent le prolongement naturel de M&#233;thodes en syntaxe et o&#249; les restructurations trouvent 
un champ d&#8217;application important et prennent une extension consid&#233;rable. D&#8217;abord dans le 
travail sur les verbes intransitifs (1976: 242-249) lorsque les auteurs estiment indispensable de 
relier une structure qu&#8217;il baptiseront standard de type 
</p>
<p>Ni V Loc Nj     Les abeilles pullulent dans le jardin / L&#8217;eau d&#233;gouline du toit  
</p>
<p>&#224; une structure qu&#8217;ils baptiseront crois&#233;e de type 
</p>
<p>Nj V de Ni Le jardin pullule d&#8217;abeilles / Le toit d&#233;gouline d&#8217;eau 
</p>
<p>tout en constatant que cette relation ne se v&#233;rifie qu&#8217;avec certains verbes et qu&#8217;un examen 
exhaustif du lexique verbal ne permet pas de faire co&#239;ncider le sous-ensemble pour lequel 
cette relation se v&#233;rifie avec un sous-ensemble s&#233;mantique clairement d&#233;finissable. Ensuite 
lorsqu' Alain Guillet &amp; Christian Lecl&#232;re souligneront dans leur livre de 1992 le caract&#232;re 
central de la relation  relation standard / crois&#233;e 8 pour &#233;tudier la relation des actants aux 
lieux, la paire type  (pp 27 &#224; 31) &#233;tant: 
</p>
<p> Max charge le camion de caisses &#8594; Max charge des caisses dans le camion 
 Le doigt de Max parcourt la page &#8594;  Max parcourt la page du doigt 
Si on ajoute &#224; ces trois ouvrages fondamentaux, avec leurs tables de propri&#233;t&#233;s, les travaux de 
quelques autres membres du LADL ou associ&#233;s &#224; ce laboratoire et qui ont tous fait leur travail 
sous la direction de Maurice Gross on a une couverture quasi exhaustive des principales 
propri&#233;t&#233;s grammaticales de la quasi totalit&#233; des verbes du fran&#231;ais, ce qui n'avait jamais &#233;t&#233; 
fait pour aucune langue naturelle: les deux livres de Jacqueline Giry-Schneider sur le verbe 
faire, le livre de Gaston Gross sur le verbe donner, les travaux de Jacques Labelle sur le verbe 
</p>
<p>                                                 
7 in CHEVALIER, Jean-Claude &amp; GROSS, Maurice (&#233;ds), 1976: 72-96. 
</p>
<p>8 Que nous avons nous-m&#234;me longuement &#233;tudi&#233;e (Ibrahim 79 &amp; 84) dans le sillage de leurs travaux ant&#233;rieurs &#224; 
la publication de l'ouvrage de 1992 [Rapports LADL et communications personnelles]. 
</p>
<p>17  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>avoir, ceux de Robert Viv&#232;s sur prendre et perdre dans leur fonction d'extensions aspectuelles 
du verbe support avoir, ceux de Dominique de N&#233;groni, Laurence Danlos et Annie Meunier 
traitant de constructions impliquant le verbe &#234;tre, enfin la th&#232;se d'Anne Daladier, premi&#232;re 
&#233;tude formelle du noyau dur des verbes supports (1978). 
</p>
<p>3. Groupes nominaux, Pr&#233;dicats complexes et Verbes supports 
L'ann&#233;e m&#234;me o&#249; para&#238;t M&#233;thodes en syntaxe, commence &#224; circuler un texte de Maurice 
Gross - le rapport n&#176;6 du LADL intitul&#233; &quot;Sur quelques groupes nominaux complexes&quot; &#8211; dont 
il ne mesure peut-&#234;tre pas encore lui-m&#234;me &#224; l'&#233;poque l'importance mais dont la publication 
l'ann&#233;e suivante dans M&#233;thodes en grammaire fran&#231;aise9 sera vite salu&#233;e par nombre de 
chercheurs comme une authentique d&#233;couverte. En comparant deux &#233;nonc&#233;s de m&#234;me 
structure et qui ne diff&#232;rent que par leur verbe conjugu&#233; Maurice Gross remarque que seul un 
des deux est justiciable d'une double analyse et que cette diff&#233;rence peut &#234;tre constat&#233;e pour 
une s&#233;rie solidaire de propri&#233;t&#233;s: la transformation passive, l'extraction, la permutation de 
longueur, la relativation, l'extraposition, la transformation de se-moyen, la cor&#233;f&#233;rence du 
sujet du verbe avec son compl&#233;ment. Les verbes responsables de ce diff&#233;rentiel: commettre 
(dans commettre une agression), exercer (dans exercer une pression), accuser (dans accuser 
une diff&#233;rence), passer (dans passer un accord), faire (dans faire une &#233;tude de), &#234;tre (dans 
&#234;tre en contradiction avec), avoir, &#233;prouver, ressentir (dans avoir, &#233;prouver, ressentir de la 
haine pour) mais aussi quelques autres pour lesquels la double analyse porte sur des 
propri&#233;t&#233;s diff&#233;rentes comme r&#233;pandre (dans r&#233;pandre la rumeur), accepter (dans accepter 
l'id&#233;e) et donner (dans donner l'impression), ont en commun de soulever &quot;un ensemble de 
probl&#232;mes (qui) se pose en termes de structure du groupe nominal&quot; (76: 117). A l'&#233;poque 
l'id&#233;e de structure est &#233;troitement associ&#233;e au groupe verbal et si l'id&#233;e fait son chemin que le 
groupe nominal a lui aussi une structure et que cette derni&#232;re peut &#234;tre suffisamment 
pr&#233;gnante pour r&#233;gir la structure de l'ensemble de l'&#233;nonc&#233;, y compris le verbe, l'&#233;tat 
d'avancement des descriptions et a fortiori l'h&#233;ritage grammatical ne fournissent pas beaucoup 
d'informations sur la nature, le fonctionnement et les contraintes de ces &#233;nonc&#233;s r&#233;gis par leur 
structure nominale. Sur le plan terminologique mais peut-&#234;tre aussi sur le plan conceptuel on 
ne trouve encore aucune trace de l'expression pr&#233;dicat nominal qui qualifierait aujourd'hui 
tout naturellement agression dans commettre une agression ou accord dans passer un accord, 
etc..Maurice Gross lui-m&#234;me n'appelle pas encore ainsi les noms qui constituent le foyer des 
structures nominales qu'il &#233;tudie, pas plus d'ailleurs qu'il n'appelle encore supports les verbes 
responsables du diff&#233;rentiel qu'il &#233;tudie. De fait, il n'appelle m&#234;me pas par son nom, dans cet 
article, la double analyse qu'il vient de pr&#233;senter&#8230; Et lorsqu'il reprend les conclusions de cet 
article dans la derni&#232;re partie &quot;Recherches nouvelles sur la nature du groupe nominal&quot; de son 
livre de l'ann&#233;e suivante sur le nom10 il parle de &quot;Groupes nominaux &#224; structure double&quot;, 
n'aborde toujours pas la question de la pr&#233;dication nominale en tant que telle et continue &#224; 
voir globalement dans les verbes supports un type particulier d'op&#233;rateurs. Il franchit 
n&#233;anmoins une &#233;tape par rapport &#224; l'article de 1976 et distingue des op&#233;rateurs de 
nominalisation, verbes &quot;(relativement) vides de sens&quot; (1977: 217) qu'il qualifie d'op&#233;rateurs 
supports de temps puis de verbes supports  comme commettre dans commettre une agression 
et des op&#233;rateurs &#224; extensions non vides de sens comme avoir, pr&#233;senter, accuser, montrer, 
enregistrer dans (avoir+pr&#233;senter+accuser+montrer+enregistrer) de la ressemblance avec 
(1977: 218). La terminologie actuelle qui tend &#224; clarifier la fonction et la solidarit&#233; d'un 
                                                 
9 1976: 97-119. 
10 1977: 215-233. 
</p>
<p>18  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>ensemble de propri&#233;t&#233;s syntaxiques en les regroupant sous le qualificatif de double analyse, &#224; 
montrer leur lien avec un processus sp&#233;cifique de construction de l'information autour de la 
pr&#233;dication nominale au moyen d'un ensemble de verbes qui troquent leur fonction 
pr&#233;dicative pour une fonction grammaticale et actualisatrice, les verbes supports ne sera 
vraiment en place avec les enjeux qu'elle soul&#232;ve qu'apr&#232;s l'article de Jacqueline Giry-
Schneider sur l' &quot;Interpr&#233;ation aspectuelle des constructions verbales &#224; double analyse&quot; 
(1978), la th&#232;se soutenue la m&#234;me ann&#233;e par Anne Daladier et surtout le num&#233;ro de Langages 
63 avec les deux articles majeurs d'une part de Maurice Gross sur &quot;Les bases empiriques de la 
notion de pr&#233;dicat s&#233;mantique&quot;, d'autre part d'Alain Guillet et Christian Lecl&#232;re sur la 
&quot;Restructuration du groupe nominal&quot;. 
</p>
<p>Par del&#224; la terminologie et les in&#233;vitables divergences &#224; l'int&#233;rieur m&#234;me du LADL puis entre 
le LADL et les laboratoires qui en seront issus en France et de par le monde, c'est &#224; un 
profond bouleversement des habitudes et de nos r&#233;flexes qu'invitent les remarques de Maurice 
Gross de 1976 sur quelques groupes nominaux complexes. Il ne croit pas si bien dire lorsqu'il 
&#233;crit: &quot;Nos exemples montrent en tout cas que cette &#233;ventuelle structure (du groupe nominal)  
est loin d'&#234;tre aussi simple que celle que l'on admet de fa&#231;on r&#233;pandue. Ces exemples ne sont 
pas en effet des cas exceptionnels, mais des constructions tr&#232;s communes, et nombreuses en 
termes des &#233;l&#233;ments lexicaux en jeu (noms et verbes), seulement elles n'ont pas &#233;t&#233; analys&#233;es 
&#224; ce jour. Bien d'autres ph&#233;nom&#232;nes indiquent que la notion simpliste de groupe nominal qui 
figure dans les grammaires g&#233;n&#233;ratives risque de n'&#234;tre qu'un cas particulier peu int&#233;ressant 
et peu r&#233;v&#233;lateur de l'organisation syntaxique que l'on a l'habitude de centrer autour du 
nom.&quot; (p. 117). 
</p>
<p>Il est en effet pour le moins paradoxal de placer l'inconnue de la complexit&#233; dans ce qui 
semblait jusque l&#224; tellement indiff&#233;rent &#224; la grammaire qu'on n'imaginait m&#234;me pas qu'il 
puisse avoir une structure: le groupe nominal. Encore plus paradoxal que ce soit le descripteur 
attitr&#233; de ce foyer reconnu de la complexit&#233; qu'est le verbe qui le fasse. Avec les travaux sur 
les verbes on montre au LADL que la moyenne de r&#233;gularit&#233; absolue pour cette cat&#233;gorie 
n'exc&#232;de pas 1,5 verbe par classe. Autrement dit que les r&#233;gularit&#233;s enseign&#233;es &#224; l'&#233;cole pour 
la partie r&#233;put&#233;e la plus centrale et la plus ouvertement combinatoire des fameuses parties du 
discours sont essentiellement morphologiques et sans grand rapport ni avec la grammaire ni 
avec le s&#233;mantisme des unit&#233;s qui forment la cat&#233;gorie. Cette constatation suscite dans l'esprit 
de Maurice Gross une conclusion et une interrogation. Il en conclut qu'il est impossible que la 
langue soit construite dans sa totalit&#233; ou m&#234;me dans ses grandes lignes par un petit nombre de 
r&#232;gles syntaxiques et grammaticales ou par une forme quelconque de combinatoire logique 
que ce soit au sens de la logique des pr&#233;dicats ou dans un sens plus large. Mais en m&#234;me 
temps il se pose la question de savoir pourquoi la langue en est l&#224;&#8230; 
</p>
<p>Maurice Gross nous a toujours enseign&#233; un principe qu'il avait en commun avec Zellig S. 
Harris. En langue une relation entre deux unit&#233;s ne doit jamais &#234;tre repr&#233;sent&#233;e par une fl&#232;che 
simple [ &#8594; ou &#8592; ]si ce n'est pour des raisons de commodit&#233; qui ne porteraient pas &#224; 
cons&#233;quence. Une repr&#233;sentation soigneuse de cette relation doit &#234;tre marqu&#233;e par une fl&#232;che 
double [ &#8596; ]. En clair, un &#233;l&#233;ment ne peut vraiment en r&#233;gir un autre que si cet autre appelle 
l'&#233;l&#233;ment qui le r&#233;git. Les relations entre les unit&#233;s linguistiques sont plus des relations 
d'appropriation plus ou moins pr&#233;-d&#233;finies avec des dominances tr&#232;s relatives que des 
applications de fonctions o&#249; ce qui s'applique choisit ce &#224; quoi il s'applique ind&#233;pendamment 
de lui &#224; la mani&#232;re d'une construction ou d'une destruction absolues. Tout en reconnaissant la 
profondeur des intuitions des grammairiens de Port-Royal et en rendant hommage au &quot;cadre 
</p>
<p>19  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>transformationnel sous-jacent &#224; leur pens&#233;e&quot; il a toujours tenu en grande suspicion leur 
conception binaire orient&#233;e de la pr&#233;dication et ce depuis son article c&#233;l&#232;bre de Langages 7: 
&quot;Sur une r&#232;gle de cacophonie&quot; (1967) o&#249; il montre la nature de l'interd&#233;pendance &#233;troite du 
verbe, du d&#233;terminant, du nom d&#233;termin&#233; et de l'incidence de ces d&#233;pendances r&#233;ciproques sur 
la pr&#233;sence ou non d'une pr&#233;position dans le lien du verbe et du nom. 
</p>
<p>Transpos&#233; &#224; la relation du verbe &#224; ses arguments le principe signifie clairement que 
l'irr&#233;gularit&#233; des constructions verbales pourrait &#234;tre induite par une irr&#233;gularit&#233; de l'influence 
des arguments sur le verbe. Il va donc s'int&#233;resser au nom et plus particuli&#232;rement &#224; ce qui 
n'avait jamais &#233;t&#233; fait avant lui d'une mani&#232;re quelque peu syst&#233;matique, &#224; sa syntaxe. Dans 
l'article de 1976 qui reprend, il faut le rappeler, une recherche de 1975, le titre du livre de 
1977 Grammaire transformationnelle du fran&#231;ais: syntaxe du nom serait parfaitement 
saugrenu. Le livre est d'ailleurs tr&#232;s mal re&#231;u et jusqu'aujourd'hui c'est indiscutablement l'une 
de ses productions scientifiques les moins cit&#233;es y compris parmi ses propres disciples. Et 
pourtant&#8230; De la Grammaire g&#233;n&#233;rale de Nicolas Beauz&#233;e (1767) au dernier article de S. Y. 
Kuroda (1977) en passant par les articles de Robert Martin sur m&#234;me (1969) et peu (1975) ou 
celui d'Oswald Ducrot sur peu et un peu (1970), les travaux de Noam Chomsky ou de Paul 
Postal, le travail de Sandfeld ou de Ross, Maurice Gross cite et discute tout ce qui a &#233;t&#233; &#233;crit 
en rapport avec le sujet. Mais c'est pour montrer l'impossibilit&#233; d'une quelconque 
syst&#233;matisation. M&#234;me en utilisant les restructurations les plus imaginatives les donn&#233;es 
r&#233;sistent au traitement. Les exceptions sont partout. Les relations d'appropriation sont 
totalement impr&#233;visibles. Il n'y a m&#234;me plus mati&#232;re &#224; faire des tables de propri&#233;t&#233;s. A une 
&#233;poque o&#249; beaucoup de chercheurs mais surtout la quasi totalit&#233; des d&#233;cideurs voient dans le 
perfectionnement de la formalisation des combinatoires logiques la cl&#233; non seulement du 
progr&#232;s mais de l'acc&#232;s &#224; la compr&#233;hension du fonctionnement de tout et de rien, cette 
avalanche d'irr&#233;gularit&#233;s fruit d'une observation d'entomologiste doubl&#233;e d'une argumentation 
de math&#233;maticien, provoque un certain d&#233;couragement. Les adversaires de l'&#233;poque parleront 
m&#234;me d'une trahison. Ils iront jusqu'&#224; accuser Maurice d'avoir &quot;d&#233;moli le champ&quot;. D'avoir fait 
fuir les &#233;tudiants et les cr&#233;dits. Beaucoup de disciples ignoreront purement et simplement le 
livre an arguant de sa difficult&#233; ou de leur fatigue...Ce sera d'ailleurs son dernier ouvrage chez 
Larousse et l'un des derniers de la fameuse collection blanche Langue et Langages. 
</p>
<p>En fait, l'ouvrage est une mine et les donn&#233;es qui s'y trouvent permettent et ont permis &#224; ceux 
qui souhaitent r&#233;ellement faire progresser l'automatisation des proc&#233;dures de reconnaissance 
formelle d'&#233;viter bon nombre d'&#233;cueils et de suivre des pistes gagnantes mais &#224; condition 
d'op&#233;rer un aggiornamento de leurs r&#233;flexes descriptifs et interpr&#233;tatifs. 19 ans plus tard, dans 
un article o&#249; il remet en cause le bien fond&#233; de la s&#233;paration par les grammaires fran&#231;aises des 
constructions passives et des constructions d'ajectifs en &#8211;able11 Maurice Gross &#233;crit: &quot;La 
reconnaissance des verbes supports permet de comprendre de nombreuses observations sur 
la structure d'argument des substantifs et en particulier sur les pr&#233;positions qui r&#233;gissent les 
compl&#233;ments de noms&quot; et un peu plus loin &quot;Ainsi donc, le r&#233;gime des compl&#233;ments du 
                                                 
11 1996, &quot;Les verbes supports d'adjectifs et le passif&quot;, Langages 121, Les supports, Amr Helmy Ibrahim &#233;d.: &quot;On 
</p>
<p>voit ainsi comment une r&#233;analyse simple de la forme passive conduit &#224; repositionner certains concepts de base 
des grammaires courantes. L'exemple des adjectifs en &#8211;able d&#233;riv&#233;s de verbes est typique. Alors que ces 
structures sont clairement analogues &#224; celles du passif et que leur distribution dans le lexique est &#224; peu pr&#232;s la 
m&#234;me que celle du passif, ces formes n'ont pas re&#231;u d'appellation propre et et sont tout juste signal&#233;es. Cette 
remarque pose un probl&#232;me plus g&#233;n&#233;ral, celui de la mani&#232;re dont les chapitres des grammaires courantes ont 
&#233;t&#233; choisis&quot; (p.18). 
</p>
<p>20  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>substantif est exactement celui des verbes supports associ&#233;s, et il n'a rien &#224; voir avec celui des 
verbes &#233;ventuellement apparent&#233;s. Autrement dit, les irr&#233;gularit&#233;s de r&#233;gime des noms sont 
les variations d'emploi des verbes supports sous-jacents. Les r&#232;gles de formation des 
groupes nominaux &#224; partir des phrases &#224; V-sup sont r&#233;guli&#232;res, alors que la combinatoire 
des V-sup et de leur nom l'est beaucoup moins. Elle doit donc &#234;tre d&#233;crite nom par nom dans 
un lexique-grammaire d'une certaine complexit&#233;. (C'est nous qui soulignons)&quot; (1996: 8-9). 
</p>
<p>La notion de verbe support n'a pas &#233;t&#233; &quot;invent&#233;e&quot; par Maurice Gross. C'est une reformulation 
fran&#231;aise de la notion allemande de funktionsverben dont la premi&#232;re description linguistique 
moderne remonte &#224; un article de 1963 de Peter von Polenz o&#249; l'auteur envisage une forme de 
double analyse mais sans la syst&#233;matiser et surtout sans la relier d'une quelconque mani&#232;re &#224; 
d'autres ensembles de propri&#233;t&#233;s transformationnelles et lexico-s&#233;mantiques comme le feront 
Maurice Gross et ceux qui travailleront dans sa mouvance. Cette notion &#233;voluera 
progressivement &#224; la suite des travaux de Wolfgang Klein (1968), Hans-J&#252;rgen Herringer 
(1968), Bernhard Engelen (1968), Wolfgang Herrlitz (1973), Heide G&#252;nther et Sabine Pape 
(1976), H. Esau (1976) et Gerhard Helbig (1979), vers la notion de Funktionsverbgef&#252;ge 
(litt&#233;ralement: cha&#238;nes &#224; verbe fonctionnel) &#224; laquelle toute bonne grammaire de l'allemand, 
par exemple celle de Peter Eisenberg (1994) consacrera un chapitre. Si Maurice Gross n'a, &#224; 
ma connaissance, jamais cit&#233; ces auteurs, c'est que, d'une part il ne s'est jamais pr&#233;valu de faits 
de langue dans une langue autre que le fran&#231;ais pour justifier un choix descriptif ou 
interpr&#233;tatif concernant le fran&#231;ais, d'autre part il n'a cit&#233; parmi les travaux effectu&#233;s sur des 
langues &#233;trang&#232;res que ceux dont les m&#233;thodes de traitement des faits linguistiques 
concernaient ses propres choix m&#233;thodologiques. Or les m&#233;thodes de ces auteurs sont rest&#233;es 
longtemps globalement incompatibles avec les traitements formels du LADL. La question a 
d'ailleurs besoin d'&#234;tre reprise dans le cadre d'une comparaison syst&#233;matique des donn&#233;es en 
allemand et en fran&#231;ais par r&#233;f&#233;rence aux donn&#233;es du persan o&#249; les verbes compos&#233;s 
pr&#233;sentent quelques analogies avec les funktionsverbgef&#252;ge et &#224; celles de l'arabe o&#249;, comme 
en allemand, l'opposition pour un m&#234;me verbe, entre une construction &#224; support ou une 
construction distributionnelle, d&#233;pend de l'absence ou de la pr&#233;sence d'une pr&#233;position. Il est 
clair que la probl&#233;matique telle qu'elle &#233;tait pos&#233;e par les auteurs allemands faisait du 
ph&#233;nom&#232;ne une particularit&#233; allemande sans enjeu d&#233;terminant ni sur la description g&#233;n&#233;rale 
du fonctionnement de l'allemand ni, a fortiori, sur l'analyse de l'ensemble des langues 
naturelles. 
</p>
<p>Quant aux linguistes de langue anglaise, en dehors de Zellig S. Harris, ils ne prennent 
conscience de l'importance du ph&#233;nom&#232;ne qu'assez tardivement malgr&#233; des observations 
ponctuelles pertinentes mais sans suite dans une grammaire de H. Poutsma (1914-1926) puis 
chez Otto Jespersen (1965) qui donnera aux verbes supports le nom qu'ils ont gard&#233; depuis en 
anglais light verbs. C'est seulement en 1984, que para&#238;t dans une perspective g&#233;n&#233;rative, le 
travail de Ray Cattell qui cite bien un article de Maurice Gross de 1976 mais sans rapport 
avec la double analyse ainsi que deux publications de 1978 de Jacqueline Giry-Schneider: son 
article sur la double analyse et son premier livre sur faire. Les citations que fait Ray Cattell de 
Zellig Harris sont tr&#232;s anciennes et tr&#232;s incompl&#232;tes et la probl&#233;matique au point de maturit&#233; 
o&#249; l'avait amen&#233;e le LADL en 1981 est purement et simplement ignor&#233;e. Ray Cattell ne 
poursuivra pas ses recherches sur cette voie12 et la floraison de travaux sur les pr&#233;dicats 
</p>
<p>                                                 
12 Ses derni&#232;res publications portent sur l'acquisition du langage par les enfants et le rapport entre le 
</p>
<p>fonctionnement de la langue et celui du cerveau. 
</p>
<p>21  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>complexes ou pr&#233;dicats composites depuis la fin des ann&#233;es 80 qu'il s'agisse de l'anglais ou 
d'autres langues comme le japonais ou l'ourdou13 ne le citent pas beaucoup. Et pourtant son 
travail fournit sur l'anglais une somme impressionnante de donn&#233;es et soul&#232;ve quantit&#233; de 
probl&#232;mes qui, bien qu'insuffissamment rapport&#233;s &#224; la structure du lexique, ne peuvent &#234;tre 
trait&#233;s efficacement que dans le cadre &#233;labor&#233; par Maurice Gross.  
</p>
<p>4. Th&#233;orisation, M&#233;thodologie et Automatisation 
L'analyse formelle, telle que Maurice Gross la concevait et au vu des applications que cette 
conception lui permettra de mettre en &#339;uvre n'est ni la traduction du sens pr&#233;sum&#233; des 
contraintes grammaticales ni l'interpr&#233;tation des relations cat&#233;gorielles d'une grammaire 
sp&#233;cifique, ce n'est pas non plus une &#232;ni&#232;me tentative d'associer de mani&#232;re bijective un 
ensemble de formes morpho-syntaxiques &#224; un ensemble savamment configur&#233; de traits 
s&#233;mantiques, c'est plut&#244;t une mani&#232;re de tourner la contrainte grammaticale, de court-circuiter 
la grammaire par le biais d'une succession aussi longue que n&#233;cessaire de ces 
bouleversements cat&#233;goriels dans l'&#233;quivalence que Charles Bally appelle transpositions, 
Lucien Tesni&#232;re translations et Zellig Sabbetai Harris report. Ces changements relativisent, 
voire neutralisent le sens que l'on serait tent&#233; d'attribuer aux cat&#233;gories grammaticales, ils 
d&#233;plient et d&#233;font ce que la grammaire t&#233;lescope et condense. Ils lib&#232;rent des composants 
&#233;l&#233;mentaires que la gramaire avait contract&#233;s en &#233;l&#233;ments plus complexes quoique 
d'apparence plus &#233;conomique, plus br&#232;ve et plus fonctionnelle. Les changements n'ont plus 
d'objet lorsqu'on atteint partout des noms simples avec leurs prolongements appropri&#233;s, leurs 
supports, leur format minimal en de&#231;a duquel il n'y a plus de sens. 
</p>
<p>Mais encore plus que Harris, Maurice Gross a une m&#233;fiance visc&#233;rale, s'agissant de la langue, 
des principes universels, des r&#232;gles. Ce n'est pas une allergie purement id&#233;ologique mais la 
cons&#233;quence naturelle du fait que la combinatoire in fine doit &#234;tre d&#233;crite nom par nom et que 
non seulement il n'y a pas deux noms qui se ressemblent mais qu'on ne peut pas pr&#233;voir les 
verbes supports qui les actualisent. 
</p>
<p>&quot;La reconnaissance des verbes supports&quot; n'&#233;tait pas automatis&#233;e en 1996, dix-neuf ans apr&#232;s la 
d&#233;couverte de l'ensemble de propri&#233;t&#233;s connu par la suite sous le nom de double analyse et 
elle ne l'est toujours pas aujourd'hui. Maurice Gross avait donc vu juste et sa d&#233;couverte 
ajoute une propri&#233;t&#233; suppl&#233;mentaire &#224; la liste des treize propri&#233;t&#233;s constitutives des langues 
naturelles &#233;tablie par Charles F. Hocket en 1960 et l&#233;g&#232;rement modifi&#233;e ou r&#233;orgarnis&#233;e 
depuis14. En effet, le r&#244;le des supports dans l'&#233;conomie de la grammaire est tr&#232;s certainement 
l'un des universaux de l'actualisation du langage dans les langues naturelles et ce n'est pas le 
moindre des m&#233;rites de Maurice Gross de l'avoir d&#233;couvert en poussant jusqu'en ses derniers 
retranchements la logique d'une automatisation parfaite d'une description exhaustive et 
totalement formelle d'une langue naturelle. Seul un projet s&#233;rieux, honn&#234;te et coh&#233;rent 
d'automatisation v&#233;ritable des langues peut d&#233;partager ce qui en elles rel&#232;ve de la m&#233;canique 
computationnelle, de ce qui appartient &#224; des s&#233;dimentations historiques al&#233;atoires ou &#224; des 
ph&#233;nom&#232;nes affectifs, cognitifs ou sociaux irr&#233;ductibles aux formes strictement cart&#233;siennes 
de l'intelligence. Et c'est par la recherche de solutions purement formelles et automatisables, 
c'est-&#224;-dire en l'occurrence reproductibles, aux obstacles rencontr&#233;s au cours de cette 
entreprise que l'on peut comprendre et ma&#238;triser la vraie nature des langues naturelles. 
                                                 
13 Cf Brinton &amp; Akimoto 99, Miyamoto 99 &amp; Butt 95 
14 Cf notamment Hauser 96 &amp; Carstairs-McCarthy 99. 
</p>
<p>22  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>Il n'est donc pas &#233;tonnant que tous les ph&#233;nom&#232;nes mis &#224; jour par Maurice Gross sur le 
fran&#231;ais aient &#233;t&#233; modulo les transpositions techniques n&#233;cessaires et dont les progr&#232;s de la 
linguistique compar&#233;e et de la typologie sont aujourd'hui familiers, retrouv&#233;s, pos&#233;s &#224; peu de 
chose pr&#232;s dans les m&#234;mes termes, dans des langues aussi diff&#233;rentes que l'arabe15 ou le 
cor&#233;en16, le persan, le chinois ou le japonais17, en plus, naturellement, de quelques langues 
romanes ou germaniques. 
</p>
<p>Comme ailleurs, mais plus particuli&#232;rement dans l'&#233;tude des langues naturelles, les 
&quot;d&#233;couvertes&quot; ne courent pas les rues m&#234;me si, dans le domaine de l'interpr&#233;tation du 
fonctionnement des langues, la multiplication des &quot;th&#233;ories&quot; a atteint, au cours du dernier 
si&#232;cle, un seuil de saturation. On a beaucoup reproch&#233; &#224; Maurice Gross de ne pas avoir de 
th&#233;orie et il est vrai que le Lexique-grammaire est beaucoup plus un type d'approche, 
essentiellement descriptif, et un ensemble de m&#233;thodes et de proc&#233;dures qu'une th&#233;orie 
proprement dite. Certes l'approche repose sur, si l'on peut dire, quelques grands faits 
conceptuels. Certains ont &#233;t&#233; explicit&#233;s et argument&#233;s par Maurice Gross &#224; diff&#233;rents endroits 
de son &#339;uvre comme l'existence des classes d'&#233;quivalence ou le fait qu'il n'existe pas en 
langue de valeurs absolues mais uniquement des valeurs diff&#233;rentielles. D'autres sont plus 
rarement invoqu&#233;s mais restent sous-jacents &#224; l'ensemble des choix m&#233;thodologiques comme 
le fait que la m&#233;talangue des descriptions doit &#234;tre incluse dans la langue d&#233;crite, qu' il 
n'existe pas de relation bijective entre la forme et le sens ou qu'une relation d'application est 
n&#233;cessairement bi-directionnelle. Mais l'ensemble de ces constantes ne forme pas vraiment 
une th&#233;orie au sens des th&#233;ories qui se disputent depuis un peu plus d'un si&#232;cle le terrain sur le 
march&#233; de la linguistique. C'est probablement pourquoi, et que ceux qui n'en sont pas d'accord 
me pardonnent la brutalit&#233; de la formulation: le travail de Maurice Gross appara&#238;t 
r&#233;trospectivement non pas comme une orientation parmi d'autres pour interpr&#233;ter les faits de 
langues mais comme une partie tr&#232;s importante &#8211; il reviendra un jour &#224; de savants 
encyclop&#233;distes de d&#233;terminer la proportion &#8211; du socle sans lequel il ne peut pas y avoir de 
linguistique c'est-&#224;-dire de conscience des vrais probl&#232;mes pos&#233;s par les faits de langue, donc 
sans lequel aucune th&#233;orie, quelque brillante et s&#233;duisante qu'elle soit, ne peut avoir de sens. 
</p>
<p>Non seulement Maurice Gross se moquait &#233;perdument d'associer son nom &#224; une quelconque 
th&#233;orie mais il se refusait cat&#233;goriquement &#224; cr&#233;er de nouveaux mots, nous r&#233;p&#233;tant qu'il n'y 
avait rien de plus &#233;tranger &#224; l'esprit scientifique que la prolif&#233;ration canc&#233;reuse d'un 
quelconque jargon. Tendu de toutes ses forces vers la d&#233;couverte de l'un des secrets les mieux 
gard&#233;s du vivant, la vraie nature et le vrai fonctionnement des langues naturelles, son 
ambition ne pouvait se satisfaire de la vanit&#233; d'avoir &#233;t&#233; le premier &#224; nommer une diff&#233;rence 
per&#231;ue confus&#233;ment et qui peut s'av&#233;rer, pour peu qu'on s'y int&#233;resse avec un minimum de 
m&#233;thode, n'&#234;tre qu'un trompe-l'&#339;il. Il ne savait que trop que les d&#233;nominations, quand elles 
pr&#233;c&#232;dent une analyse formelle exhaustive, entra&#238;nent des cat&#233;gorisations qui peuvent g&#234;ner 
consid&#233;rablement la recherche d'une configuration optimale, c'est-&#224;-dire susceptible d'&#234;tre 
explicative, des propri&#233;t&#233;s. L'histoire de la grammaire traditionnelle, dont les cat&#233;gories ne 
sont pas toujours d'un grand secours pour parvenir &#224; des analyses formelles automatisables, 
&#233;tait l&#224; pour en t&#233;moigner. 
</p>
<p>                                                 
15 Nos propres travaux (Ibrahim 78, 79, 97, 98 &amp; 02) mais &#233;galement des travaux au Maroc (notamment 
</p>
<p>Mohamed El Hannach), en Tunisie (notamment Salah Kchaou), en Libye (Adel Ahna&#239;ba) et dans d'autres pays 
arabes. 
</p>
<p>16 Cf notamment les travaux de Jee-Sun Nam (Langages 126 &#8211; Juin 97) et Chai Song Hong (1985 &amp; 1987). 
17 Respectivement et &#224; titre d'exemple Parivash Safa, Cheng Tin Au et Kozu&#233; Ogata. 
</p>
<p>23  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>Depuis une douzaine d'ann&#233;es, Maurice Gross et Max Silberztein ont d&#233;velopp&#233; et 
perfectionn&#233; des automates finis (ou  d'&#233;tats finis &#8211; Finite-State Automata) ou plus 
pr&#233;cis&#233;ment des transducteurs finis. Les propri&#233;t&#233;s et les possibilit&#233;s de ces automates, 
consid&#233;r&#233;s comme les moins puissants parmi les cat&#233;gories d'automates et comme 
susceptibles de traiter uniquement les r&#232;gles de r&#233;&#233;criture &#233;labor&#233;es par Noam Chomsky dans 
les ann&#233;es cinquante, ont &#233;t&#233; revues &#224; la hausse avec l'introduction puis la g&#233;n&#233;ralisation dans 
les descriptions linguistiques des grammaires locales dont la r&#233;gularit&#233; permet au programme 
de fonctionner ind&#233;pendamment du contexte. Alors que l'on &#233;tait sur le point de consid&#233;rer 
que ces automates &#233;taient impropres &#224; la description des langues, Maurice Gross et Max 
Silberztein ont d&#233;montr&#233; la viabilit&#233; d'un syst&#232;me d'analyse automatique ayant la forme d'un 
automate d'&#233;tats finis &#224; condition de le coupler &#224; un dictionnaire &#233;lectronique construit selon 
les principes du lexique-grammaire: c'&#233;tait l'acte de naissance du syst&#232;me INTEX (1993). Leur 
d&#233;marche n'a pas &#233;t&#233; isol&#233;e. En t&#233;moigne un ouvrage collectif paru aux presses du MIT en 
1997, Finite-State Language Processing18 . Les 21 contributeurs, dont beaucoup ont soutenu 
leur th&#232;se sous la direction de Maurice Gross sont tous des chercheurs de haut niveau que ce 
soit dans les universit&#233;s fran&#231;aises ou am&#233;ricaines ou dans de grands groupes industriels. 
</p>
<p>Dans l'un de ses deux derniers articles parus, &quot;Les ambiguit&#233;s&quot;, Maurice revient, comme &#224; son 
habitude, avec une patience qu'on n'imagine plus de ce monde, sur des questions qu'il se 
posait et nous posait il y a plus de trente ans: comment reconna&#238;tre, distinguer, repr&#233;senter et 
traiter les homographes, les homophones, les homonymes, comment d&#233;couper une s&#233;quence. 
Pourquoi une ou plusieurs entr&#233;es du m&#234;me mot dans un dictionnaire et pourquoi il ne sert &#224; 
rien d'opposer un sens propre &#224; un sens r&#233;put&#233; m&#233;taphorique. Pourquoi mots simples et mots 
compos&#233;s n'ont pas le m&#234;me type d'ambiguit&#233;. Pourquoi ambiguit&#233; et synonymie font mauvais 
m&#233;nage. Pourquoi finalement les arbres de d&#233;pendances informelles de Lucien Tesni&#232;re 
valent bien ou m&#234;me valent mieux que ceux de Chomsky. Pourquoi on n'&#233;limine pas une 
ambiguit&#233; dans une langue naturelle aussi facilement que dans un langage de programmation 
m&#234;me quand les deux manipulent le m&#234;me type d'unit&#233;s. Pourquoi la mani&#232;re de repr&#233;senter 
des propri&#233;t&#233;s transformationnelles peut expliciter ou non une diff&#233;rence de sens. Quand les 
transformations permettent de r&#233;soudre une ambiguit&#233; et quand il ne faut pas les utiliser &#224; 
cette fin. Mais aussi, quel rapport tout cela peut-il avoir avec la diff&#233;rence de production des 
accents sur les claviers fran&#231;ais et les claviers belges ou avec la fonction de la barre oblique 
(le slash). Enfin, mais cela il ne le disait pas il y a trente ans parce que toutes ces questions il 
ne les avait jamais pos&#233;es dans cet ordre ni d'une seule traite: comment ces questions, lorsque 
l'on couple des dictionnaires &#233;lectroniques pr&#233;cis avec des graphes, sugg&#232;rent des solutions 
qui impliquent des reconstructions d'effacements, des red&#233;coupages, des recat&#233;gorisations 
auxquelles on n'aurait certainement pas pens&#233; si on ne s'&#233;tait pas mis en t&#234;te d'alimenter un 
automate. 
</p>
<p>5. LA PATRIE RECONNAISSANTE 
J'ai vu Noam Chomsky pour la premi&#232;re fois au d&#233;but du printemps dernier &#224; Harvard. Quand 
je l'ai d'abord crois&#233; sortant des toilettes, en route pour une table ronde sur la nature et 
l'&#233;volution des langues, mon mouvement press&#233; s'est suspendu moins d'un instant mais 
comme on &#233;tait tr&#232;s proches j'ai senti dans son regard, l'espace de rien, une inqui&#233;tude. Il avait 
la d&#233;marche de Maurice et portait une veste qui ne pouvait &#234;tre que celle de Maurice. D&#232;s les 
                                                 
18 &#201;dit&#233; par Emmanuel Roche et Yves Schabes. 
</p>
<p>24  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p>premiers mots j'ai &#233;t&#233; frapp&#233; par la douceur de la voix mais aussi par la facilit&#233; avec laquelle 
cette voix portait sans jamais monter, sans effort apparent. Peut-&#234;tre un peu moins tra&#238;nante 
que celle de Maurice mais comme elle vou&#233;e &#224; la construction d'un univers de persuasion. J'ai 
&#233;t&#233; conquis, comme il y a trente ans, par la m&#234;me gentillesse dans l'art de vous retourner votre 
question. Mais c'est quand il a cherch&#233;, pour prendre des notes, un stylo au revers de la m&#234;me 
veste que le monde a vacill&#233;. 
</p>
<p>Enseignant &#224; Harvard et travaillant sur l'anglais la notori&#233;t&#233; de Maurice aurait s&#251;rement &#233;gal&#233; 
ou d&#233;pass&#233; celui dont le nom se confond, pour beaucoup de non linguistes, aux Etats-Unis 
comme dans beaucoup d'autres pays, avec toute la linguistique moderne. Mais cela aurait &#233;t&#233; 
tragique, parce que je ne l'aurais peut-&#234;tre jamais connu et que la France n'aurait pas pu 
s'ennorgueillir, non seulement d'avoir eu ce grand parmi les grands, mais d'avoir la langue, 
gr&#226;ce &#224; lui, la mieux d&#233;crite du monde19. 
</p>
<p> 
</p>
<p>R&#233;f&#233;rences 
Boons, Jean-Paul, 1971, &quot;M&#233;taphore et baisse de la redondance&quot;, Langue fran&#231;aise 11, Paris: 
</p>
<p>Larousse, 15-16. 
</p>
<p>Boons, Jean-Paul, Guillet, Alain, Lecl&#232;re, Christian, 1976, La structure des phrases simples en 
fran&#231;ais: constructions intransitives, Gen&#232;ve-Paris: Droz. 
</p>
<p>Brinton, Laurel J. &amp; Akimoto, Minoji, 1999, Collocational and idiomatic Aspects of Composite 
Pr&#233;dicates in the History of English, Amsterdam/Philadelphia: John Benjamins. 
</p>
<p>Butt, Miriam, 1995, The Structure of Complex Predicates in Urdu, Stanford: CSLI Publications. 
</p>
<p>Carstairs-McCarthy, Andrew, 1999, The Origins of Complex Language, Oxford: Oxford University 
Press. 
</p>
<p>Cattell, Ray, 1984, Composite Predicates in English, Sydney/London/&#8230;: Academic Press. 
</p>
<p>Chomsky, Noam, 1956, &quot;Three models for the description of language&quot;, IRE Transactions on 
Information Theory, vol. IT-2, Proceedings of the symposium on Information Theory. 
</p>
<p> 1965, Aspects of the Theory of Syntax, Cambridge Mass.: MIT Press. 
</p>
<p>Chomsky, Noam &amp; Sch&#252;tzenberger, M-P, 1963, &quot;The Algebraic Theory of Context-Free Languages&quot;, 
Computer Programming and Formal Systems (Braffort, P. &amp; Hirschberg, L. eds), North 
Holland Pub. Co. 
</p>
<p>                                                 
19 &quot;Maurice's finite state computational grammar, implemented by his group at LADL, constitutes the most 
</p>
<p>complete syntax based computationally implemented lexicon of French available. It also seems to be the most 
complete computational model of any language&quot; (Ray Dougherty, Professeur de linguistique &#8211; g&#233;n&#233;rative -- &#224; 
l'Universit&#233; de New York dans l'hommage qu'il lui a rendu et qui est consultable sur son site 
http://www.nyu.edu/pages/linguistics/kaleidoscope Il ajoute &quot;I think Maurice was one of the most creative, 
imaginative, and talented linguists of our age (&#8230;) Maurice developped functioning products using existing 
resources that set new standards for accuracy, efficiency, and elegance&quot;. 
</p>
<p>25  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>Daladier, Anne, 1978, Quelques probl&#232;mes d'analyse d'un type de nominalisation et de certains 
groupes nominaux fran&#231;ais, Th&#232;se de 3&#232;me cycle, Universit&#233; Paris 7. 
</p>
<p>Danlos, Laurence, 1980, Repr&#233;sentation d'informations linguistiques: constructions N &#234;tre Prep X, 
Th&#232;se de 3&#232;me cycle, Universit&#233; Paris 7. 
</p>
<p>Eisenberg, Peter, 1994, Grundriss der deutshen Grammatik, 3, &#220;berarbeitete Auflage, 
Stuttgart/Weimar: Metzler. 
</p>
<p>Engelen, Bernhard, 1968, &quot;Zum System der Funktionsverbgef&#252;ge&quot;, Wirkendes Wort 18, 289-303. 
</p>
<p>Esau, H., 1976, &quot;Funktionsverbgef&#252;ge revisited&quot;, Folia Linguistica 9, 135-160. 
</p>
<p>Giry-Schneider, Jacqueline, 1978, &quot;Interpr&#233;tation aspectuelle des constructions verbales &#224; double 
analyse&quot;, Linguisticae Investigationes II:23-54, Amsterdam / Philadelphia: John Benjamins, 
23-53. 
</p>
<p> 1978, Les Nominalisations en fran&#231;ais: l'op&#233;rateur faire dans le lexique, Gen&#232;ve-Paris: Droz. 
</p>
<p> 1987, Les pr&#233;dicats nominaux en fran&#231;ais: les phrases simples &#224; verbes supports, Gen&#232;ve-
Paris: Droz. 
</p>
<p>Gross, Gaston, 1989, Les constructions converses du fran&#231;ais, Gen&#232;ve-Paris: Droz. 
</p>
<p>Gross, Maurice, 1967, &quot;Sur une r&#232;gle de cacophonie&quot;, Langages 7, repris dans La Grammaire, 1970 
(Arriv&#233; M. &amp; Chevalier J-C. &#233;d.) Paris: Klinckieck, 277-293 sous le titre &quot;Exemple d'analyse 
transformationnelle: une transformation d'effacement&quot;. 
</p>
<p> 1967b, Analyse formelle compar&#233;e des compl&#233;tives en fran&#231;ais et en anglais, Th&#232;se de 3&#232;me 
cycle, Universit&#233; de la Sorbonne. 
</p>
<p> 1968, Grammaire transformationnelle du fran&#231;ais: syntaxe du verbe, Paris: Larousse &#8211; 
R&#233;&#233;dit&#233; en 1971 et r&#233;imprim&#233; par les &#233;ditions Cantil&#232;ne. [Traduction de Transformational 
Analysis of French Verbal Constructions, 1966, Philadelphia: University of Pennsylvania ]. 
</p>
<p> 1972, Mathematical models of Language, New York: Prentice Hall. [Trad. en portugais &amp; 
cor&#233;en] 
</p>
<p> 1973, &quot;Remarques sur la m&#233;thodologie de la grammaire g&#233;n&#233;rative transformationnelle&quot;, The 
formal Analysis of Natural Languages (Gross, M., Halle, M. &amp; Sch&#252;tzenberger M.-P. &#233;d.), 
The Hague: Mouton, 251-264. 
</p>
<p> 1975, M&#233;thodes en syntaxe, Paris: Hermann [Reprend le Doctorat d'&#201;tat Lexique des 
constructions compl&#233;tives soutenu en 1969 &#224; l'Universit&#233; Paris 7]. 
</p>
<p> 1976, &quot;Sur quelques groupes nominaux complexes&quot;, M&#233;thodes en grammaire fran&#231;aise 
(Chevalier, J-C. &amp; Gross, M. &#233;ds), Paris: Klincksieck [Reprend Rapport LADL n&#176;6 - 1975]. 
</p>
<p> 1976b, &quot;La notion de r&#232;gle et d'exception: l'exemple des groupes nominaux compl&#233;ments 
directs sans d&#233;terminant&quot;, Cahiers de linguistique, d'orientalisme et de slavistique, juillet, 
M&#233;langes de linguistique et de stylistique en hommage &#224; Georges Mounin, Universit&#233; de 
Provence, 41-52. 
</p>
<p> 1977, Grammaire transformationnelle du fran&#231;ais: syntaxe du nom, Paris: Larousse. 
</p>
<p>26  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p> 1979, &quot;On the failure of generative grammar&quot;, Language vol. 55, n&#176;4, 859-885. 
</p>
<p> 1981, &quot;Les bases empiriques de la notion de pr&#233;dicat s&#233;mantique&quot;, Langages 63, Formes 
syntaxiques et pr&#233;dicats s&#233;mantiques (Guillet, A. &amp; Lecl&#232;re Ch. &#233;ds), Septembre, Paris: 
Larousse. 7-52. 
</p>
<p> 1983, &quot;Syntaxe et localisation de l'information&quot;, Information et communication, 
(Lichnerowicz, A., Perroux, F., Gadoffre G., &#233;d.), Paris: Maloine, 85-109. 
</p>
<p> 1996, &quot;Les verbes supports d'adjectifs et le passif&quot;, Langages 121, Les supports (Ibrahim, A. 
H. &#233;d.), mars, Paris: Larousse, 8-18. 
</p>
<p> 1997, &quot;The Construction of Local Grammars&quot;, Finite-State Language Processing, (Roche, E. 
&amp; Schabes, Y. eds), Cambridge / London: MIT Press, 329-354. 
</p>
<p> 2001, &quot;Les ambiguit&#233;s&quot;, Linguisticae Investigationes Tome XXIV, Fas. 1, Description et lev&#233;e 
des ambiguit&#233;s (Laporte, &#201;. &#201;d.), Amsterdam: John Benjamins. 
</p>
<p>Gross, Maurice &amp; Lentin, Andr&#233;, 1966, Notions sur les grammaires formelles, Paris: Gauthier-Villars. 
</p>
<p>Gross, Maurice &amp; Sch&#252;tzenberger, M-P, 1970, Compte rendu de Mathematical Structures of 
Language de Zellig Sabbetai Harris, American Scientist vol. 58 [R&#233;impr. Transformationnelle 
Analyse. Die Transformationstheorie von Zellig Harris und Ihre Entwicklung (Pl&#246;tz, S. &#201;d.) 
1972, Frankfurt am Main: Athen&#228;um, 307-312. 
</p>
<p>Guillet, Alain, Lecl&#232;re, Christian, 1992, La structure des phrases simples en fran&#231;ais: constructions 
transitives locatives, Gen&#232;ve-Paris: Droz. 
</p>
<p>G&#252;nther, Heide, Pape, Sabine, 1976, &quot;Funktionsverbgef&#252;ge als Problem der Beschreibung komplexer 
Verben in der Valenstheorie&quot;, Untersuchungen zur Verbvalenz (Schumacher H. Hrsg.), 
T&#252;bingen, 92-128. 
</p>
<p>Harris, Zellig Sabbetai, 1968, Mathematical Structures of Language, New York: John Wiley &amp; Sons. 
</p>
<p> 1969, &quot;The two systems of Grammar: Report and Paraphrase&quot;, in 1970, Papers in structural 
and transformational linguistics, Dordrecht: D. Reidel, 612-692. 
</p>
<p>Helbig, Gerhard, 1979, &quot;Probleme des Beschreibung von Funktionsverbgef&#252;gen im Deutschen&quot;, Daf 
16, 273-285. 
</p>
<p>Herringer, Hans-J&#252;rgen, 1968, Die Opposition von kommen und bringen als Funktionsverben, 
D&#252;sseldorf. 
</p>
<p>Herrlitz, Wolfgang, 1973, Funktionsverbgef&#252;ge vom Typ in Erfahrung bringen, T&#252;bingen. 
</p>
<p>Hocket, Charles F., 1960, &quot;The Origin of Speech&quot;, Scientific American 203/3, september. 
</p>
<p>Ibrahim, Amr Helmy, 1978 &quot;La structure de base des compl&#233;tives en arabe &#233;gyptien et en arabe 
moderne compar&#233;e &#224; celle du fran&#231;ais&quot;, Linguisticae Investigationes II:2, Amsterdam: John 
Benjamins, 277-330. 
</p>
<p>1979, &#201;tude compar&#233;e des syst&#232;mes verbaux de l'arabe &#233;gyptien, de l'arabe moderne et du 
fran&#231;ais, Doctorat d'&#201;tat pr&#233;par&#233; sous la direction de Maurice Gross, Universit&#233; Paris 7. 
</p>
<p>27  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>1984, &quot;Sur le statut de quelques accidents syntactico-s&#233;mantiques&quot;, De la syntaxe &#224; la 
pragmatique, (Attal, P. &amp; Muller, C. &#233;d.), Linguisticae Investigationes Supplementa, 
Amsterdam / Philadelphia: John Benjamins, 241-259. 
</p>
<p>1994, &quot;Th&#233;orie g&#233;n&#233;rale: de la nature du support de neutralit&#233; articulant l'arbitraire et le motiv&#233; 
dans les langues&quot;, Op&#233;rateurs, supports, dur&#233;es, (Ibrahim, A. H. &#233;d.), Annales litt&#233;raires de 
l'Universit&#233; de Besan&#231;on 516, Paris: Les Belles Lettres, 15-61. 
</p>
<p>1996a, &quot;Les supports: le terme, la notion et les approches&quot;, Langages 121, Les supports, 
(Ibrahim, A. H. &#233;d.), mars, Paris: Larousse, 3-8. 
</p>
<p> 1996b, &quot;La forme d'une th&#233;orie du langage ax&#233;e sur les termes supports&quot;, Langages 121, Les 
supports, (Ibrahim, A. H. &#233;d.), mars, Paris: Larousse, 99-120. 
</p>
<p> 1997a, &quot;Les supports lexico-syntaxiques du non-fini en fran&#231;ais et en arabe&quot;, Semiotics 
around the World: Synthesis in Diversity, New York / Berlin: Mouton de Gruyter, 203-207. 
</p>
<p> 1997b, &quot;Pour une d&#233;finition matricielle du lexique&quot;, Cahiers de lexicologie, Vol. 71 &#8211; 2, Paris: 
Didier Erudition, 155-170. 
</p>
<p> 1998a, &quot;Peut-on reconna&#238;tre automatiquement les supports du non-fini en fran&#231;ais et en 
arabe?&quot;, BULAG (BUlletin de Linguistique Appliqu&#233;e et G&#233;n&#233;rale) n&#176;23, Besan&#231;on: 
Universit&#233; de Franche-Comt&#233;, 245-273. 
</p>
<p> 1998b, &quot;La m&#233;moire cin&#233;tique des termes supports&quot;, La m&#233;moire des mots (Clas A., Mejri S. 
&amp; Baccouche T. &#233;d.), Tunis / Montr&#233;al: Serviced / Aupelf, 235-243. 
</p>
<p> 1999a, &quot;Constructions fig&#233;es et constructions &#224; supports&quot;, Le figement lexical, (Mejri S., Clas 
A., Gross G. &amp; Baccouche T. &#233;d.), Tunis: Universit&#233; de Tunis 1 &#8211; CERES, 373-387. 
</p>
<p> 1999b, &quot;Les pr&#233;positions comme trace ou &#233;quivalent d'un support&quot;, Revue de S&#233;mantique et de 
Pragmatique 6, Approches s&#233;mantiques des pr&#233;positions, Orl&#233;ans: Presses Universitaires 
d'Orl&#233;ans, 89-102. 
</p>
<p> 2000, &quot;Constantes et variables de la grammaire des supports dans quelques langues romanes&quot;, 
De la grammaire des formes &#224; la grammaire du sens, Vol. VI des Actes du XXIIe Congr&#232;s 
international de Linguistique et de Philologie Romanes, T&#252;bingen: Max Niemeyer Verlag, 
241-250. 
</p>
<p> 2001, &quot;Une classification des verbes en 6 classes asym&#233;triques hi&#233;rarchis&#233;es&quot;, Syntaxe et 
S&#233;mantique 2, S&#233;mantique du lexique verbal, Caen: Presses Universitaires de Caen, 81-98. 
</p>
<p> 2002 (&#224; para&#238;tre), &quot;Les verbes supports en arabe&quot;, Bulletin de la Soci&#233;t&#233; de Linguistique de 
Paris, Tome XCVII/1, Louvain: Peeters. 
</p>
<p>Joshi, Aravind K., 1987, &quot;An introduction to tree adjoining grammars&quot;, Mathematics of Language, 
(Manaster-Ramer, A. ed.), Amsterdam: John Benjamins, 87-114. 
</p>
<p>Klein, Wolfgang, 1968, &quot;Zur Kategorisierung der Funktionsverben&quot;, Beitr&#228;ge zur Linguistik und 
Informationsverarbeitung 13, 7-37. 
</p>
<p>Labelle, Jacques, 1974, &#201;tude de constructions avec op&#233;rateur avoir (nominalisations et extensons), 
Th&#232;se de 3&#232;me cycle, Universit&#233; Paris 7. 
</p>
<p>28  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maurice Gross: une refondation de la linguistique au crible de l'analyse automatique 
</p>
<p> 1983, &quot;Verbes suports et op&#233;rateurs dans les constructions en avoir &#224; un ou deux 
compl&#233;ments&quot;, Linguisticae Investigationes VII:2, Amsterdam / Philadelphia: John 
Benjamins, 237-260. 
</p>
<p>Lakoff, George, 1970, Irregularity in Syntax, New York: Holt, Rinehart &amp; Winston. 
</p>
<p>Meunier, Annie, 1981, Nominalisations d'adjectifs par verbes supports, Th&#232;se de 3&#232;me cycle, 
Universit&#233; Paris 7. 
</p>
<p>Meydan, Metiy&#233;, 1995, Transformations des constructions verbales et adjectivales en fran&#231;ais &#8211; 
&#201;laboration du Lexique-Grammaire des adjectifs d&#233;verbaux, Th&#232;se de doctorat NR, 
Universit&#233; Paris 7. 
</p>
<p>Miyamoto, Tadao, 1999, The Light Verb Construction in Japanese. The Role of the Verbal Noun, 
Amsterdam / Philadelphia: John Benjamins. 
</p>
<p>Mohri, Mehryar, 1993, Analayse et repr&#233;sentation par automates de structures syntaxiques 
compos&#233;es: applications aux compl&#233;tives, Th&#232;se de doctorat NR, Universit&#233; Paris 7. 
</p>
<p> 1997, &quot;On the Use of Sequential Tansducers in Natural Language Processing&quot;, in Roche E. &amp; 
Schabes Y. 97, 355-378. 
</p>
<p>Nam, Jee-Sun, 1997, &quot;Lexique-grammaire des adjectifs cor&#233;ens et analyse syntaxique automatique&quot;, 
Langages 126, La description syntaxique des adjectifs pour les traitements informatiques 
(Nam, J-S. &#233;d.), Paris: Larousse, 105-123. 
</p>
<p>N&#233;groni-Peyre, Dominique de, 1978, &quot;Nominalisations par &#234;tre et r&#233;flexivation (admiration, 
opposition, r&#233;volte et rage), Linguisticae Investigationes II:1, Amsterdam: John Benjamins, 
127-163. 
</p>
<p>Ogata, Kozu&#233;, 1987, La notion de verbe support &#224; travers les constructions fran&#231;aises en faire et 
japonaises en suru, Th&#232;se de 3&#232;me cycle, Universit&#233; Paris 7. 
</p>
<p>Pinker, Steven, 1999, Words and Rules, New York: Basic Books. 
</p>
<p>Polenz von, Peter, 1963, &quot;Funktionsverben im heutingen Deutsch&quot;, Wirkendes Wort, Beiheft 5, 
D&#252;sseldorf. 
</p>
<p> 1964, &quot;erfolgen als Funktionsverb substantivischer Geschehensbezeichnungen&quot;, Zeitschrift f&#252;r 
deutsche Sprache 20, 1-19. 
</p>
<p>Roche, Emmanuel &amp; Schabes, Yves, (Eds), 1997, Finite-State Language Processing, Cambridge / 
London: The MIT Press. 
</p>
<p>Rosenbaum, Peter S, 1968, The Grammar of English Predicate Constructions, Cambridge Mass.: MIT 
Press. 
</p>
<p>Ruwet, Nicolas, 1970, &quot;Note sur la syntaxe du pronom en et d'autres sujets apparent&#233;s&quot;, Langue 
fran&#231;aise 6, Paris: Larousse, 70-83. 
</p>
<p>1972, &quot;La syntaxe du pronom en et la transformation de mont&#233;e du sujet&quot;, Th&#233;orie 
syntaxique et syntaxe du fran&#231;ais, Paris: Seuil, 48-86 [Version remani&#233;e et augment&#233;e 
de Ruwet 70].. 
</p>
<p>29  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Amr Helmy IBRAHIM 
</p>
<p>30  
</p>
<p>Safa, Parivash, 1994, &quot;La fonction aspectuelle du verbe support en persan&quot;, Supports, Op&#233;rateurs, 
Dur&#233;es, (Ibrahim, A. H. &#233;d.), Annales litt&#233;raires de l'Universit&#233; de Besan&#231;on 516, Paris: Les 
Belles Lettres, 207-219. 
</p>
<p> 1995, L'expression de l'inchoativit&#233; en fran&#231;ais et en persan, Th&#232;se de doctorat NR pr&#233;par&#233;e 
sous la direction de Amr Helmy Ibrahim, Universit&#233; de Franche-Comt&#233;. 
</p>
<p>Silberztein, Max D., 1993, Dictionnaires &#233;lectroniques et analyse automatique de textes. Le syst&#232;me 
INTEX, Paris: Masson. 
</p>
<p> 1997, &quot;The Lexical Analysis of Natural Languages&quot; in Roche E. &amp; Schabes Y. 97, 175-
201. 
</p>
<p>Tesni&#232;re, Lucien, 1959, &#201;l&#233;ments de syntaxe structurale, Paris: Klincksieck. 
</p>
<p>Viv&#232;s, Robert, 1982, &quot;Une analyse possible de certains compl&#233;ments pr&#233;positionnels&quot;, Linguisticae 
Investigationes VI:1, Amsterdam / Philadelphia: John Benjamins, 277-233. 
</p>
<p>1983, Avoir, prendre, perdre: constructions &#224; verbe support et extensions aspectuelles, Th&#232;se 
de 3&#232;me cycle, Universit&#233; Paris 7. 
</p>
<p>1988, &quot;Verbes supports et nominalisations&quot;, Lexique 6, Lille: Presses Universitaires de Lille, 
139-159. </p>

</div></div>
</body></html>