<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un mod&#232;le de dialogue par les attentes du locuteur</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Un mod&#232;le de dialogue par les attentes du locuteur 
</p>
<p>Yannick Fouquet 
</p>
<p>Laboratoire CLIPS/IMAG, &#233;quipe GEOD 
385 rue de la Biblioth&#232;que, BP53 &#8211; 38041 Grenoble Cedex 9, France 
</p>
<p>T&#233;l.: ++33 (0)4 76 63 55 91 - Fax: ++33 (0)4 76 63 55 52 
mel : Yannick.Fouquet@imag.fr - http://www-geod.imag.fr/fouquet 
</p>
<p>R&#233;sum&#233; - Abstract 
</p>
<p>Dans cet article, nous aborderons la notion d&#8217;attentes, vue du c&#244;t&#233; du locuteur, afin 
d&#8217;am&#233;liorer la mod&#233;lisation du dialogue. Nous pr&#233;senterons notre d&#233;finition des attentes ainsi 
que notre notation, fond&#233;e sur une approche pragmatique du dialogue. Nous comparerons 
deux approches, l&#8217;une (uniquement stochastique) fond&#233;e sur la pr&#233;diction d&#8217;actes de parole, 
l&#8217;autre mettant en jeu les attentes du locuteur et leur gestion. 
</p>
<p>In this paper, we will discuss about a generic dialog model. We will demonstrate the 
importance of a expectations based approach which consider them from user&#8217;s side. We will 
present our definition of expectations and their notation based on a pragmatic approach of 
dialog. Thus, we will compare this approach (expectations and their management), and 
another stochastic approach which simply consist of act prediction.  
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
</p>
<p>Dialogue, attentes, pragmatique, analyse, statistique, aspects cognitifs 
Dialog, expectations, pragmatics, analysis, statistics, cognitive aspects  
</p>
<p>1 Introduction 
</p>
<p>Nous nous int&#233;ressons dans cet article au dialogue oral, qu&#8217;il soit inter-humain ou homme-
machine. Nous nous pencherons particuli&#232;rement sur l&#8217;apport de la mod&#233;lisation des attentes 
orient&#233;es utilisateur. Nous pr&#233;senterons, dans une premi&#232;re partie, notre approche fond&#233;e sur 
la mod&#233;lisation des attentes de l&#8217;utilisateur. Puis nous nous appuierons sur l&#8217;&#233;tude (Fouquet, 
2001) du corpus de renseignement touristique (Besacier et al., 2001) pour proposer une 
premi&#232;re estimation de ce que seront pour nous les attentes en situation, que nous validerons 
et affinerons en terme de probabilit&#233;s associ&#233;es &#224; chaque attente par une analyse plus 
approfondie. Enfin, nous comparerons cette nouvelle approche avec une approche, 
uniquement stochastique, fond&#233;e sur la pr&#233;diction d&#8217;actes de parole. 
</p>
<p>371 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yannick Fouquet 
</p>
<p>2 Un mod&#232;le de dialogue fond&#233; sur les attentes du locuteur 
</p>
<p>Dans le cadre du dialogue, (Lehuen, 1997), (Lemeunier, 2000) ou (Vilnat, 1997) proposent 
d&#8217;introduire la notion d&#8217;attentes : pour Lehuen, ces attentes sont &quot;ce qui est attendu par le 
syst&#232;me au regard de l&#8217;&#233;tat courant de la t&#226;che&quot;. Il les d&#233;finit donc en terme d&#8217; &quot;objets du 
domaine d&#8217;application et d&#8217;actes de dialogue orient&#233;s par la t&#226;che&quot; ; pour Vilnat, ce sont &quot;ce 
que l'utilisateur est susceptible de dire (ce qui implique qu'il n'est pas oblig&#233; de le dire), en 
raison des buts et des plans en cours de d&#233;veloppement&quot; ; pour Lemeunier ce sont &quot;des entit&#233;s 
pragmatiques manipul&#233;es par le syst&#232;me qui correspondent &#224; ce que l'utilisateur est cens&#233; dire 
et ce &#224; quoi le syst&#232;me est donc cens&#233; s'attendre&quot;. Ces attentes sont donc tr&#232;s li&#233;es &#224; la t&#226;che 
d&#8217;une part et consid&#233;r&#233;es du point de vue du syst&#232;me d&#8217;autre part.  
</p>
<p>Pour notre part, nous consid&#233;rons les attentes du point de vue du locuteur, comme les r&#233;sultats 
esp&#233;r&#233;s de ses actes. En effet, un locuteur engag&#233; dans un dialogue entend poursuivre ses buts 
(Vernant, 1992) et obtenir des effets positifs de ses actes. Il projette donc un certain plan sur 
son interlocuteur qu&#8217;il consid&#232;re comme coop&#233;ratif et en attend en retour un certain 
comportement. Les attentes se construisent au cours du dialogue, en fonction des buts et 
actions des interlocuteurs ; ce sont essentiellement des hypoth&#232;ses r&#233;flexive construites par 
chacun des interlocuteurs. Par exemple, si le locuteur B ne se montre pas coop&#233;ratif, la 
strat&#233;gie du locuteur A, guid&#233;e par ses attentes va certainement &#234;tre davantage directive pour 
forcer B &#224; adopter les buts de A ; ce qui se formalise par : si B est coop&#233;ratif alors FA(p) &#198; 
FB(p), si on constate F&#8217;B(p) alors B n&#8217;est certainement pas coop&#233;ratif. Notre mod&#233;lisation 
s&#8217;appuie donc sur l&#8217;id&#233;e de contexte. En effet, un certain acte (ici FA(p)), devrait fournir, selon 
le contexte (B coop&#233;ratif), tel autre acte en r&#233;ponse (FB(p)) r&#233;pondant aux attentes de A. 
</p>
<p>Inspir&#233; de (Austin, 1962) et (Searle, 1972) sur les actes de langage, (Vanderveken, 1990) 
d&#233;finit la force illocutoire F(p) comme un acte de force F s&#8217;appuyant sur le locutoire 
repr&#233;sent&#233; par le contenu propositionnel p. Celui-ci d&#233;coupe ses actes illocutoires en cinq 
cat&#233;gories (d&#233;claratif, directif, assertif, promissif, expressif). Nous pensons que ce d&#233;coupage 
peut &#234;tre affin&#233; &#224; l&#8217;aide des modaux s&#233;miotiques de (Greimas, 1966). Ainsi, un acte sera pour 
nous une combinaison de faire, savoir, croire, devoir, pouvoir. Soulignant (Austin, 1962), 
chaque acte d&#233;bute par un faire, la pr&#233;cision de la force &#233;tant fournie en exposant ; Ffs(p) pour 
un faire-faire-savoir de contenu p. Nous aurons donc des actes de la forme F(p), Ff(p), Fs(p), 
Fc(p), Ffs(p), Fd(p), Fp(p), Ffc(p), Ffd(p), Ffp(p).  
</p>
<p>Cette notation pragmatique en actes permet, selon nous, de mieux appr&#233;hender les 
irr&#233;gularit&#233;s soulev&#233;es dans (Fouquet, 2001) et leurs effets (ruptures, r&#233;parations, demande de 
pr&#233;cision ; Bilange, 1992). Souhaitant tenir compte des aspects intentionnel (Colineau, 1997), 
cognitif (Sperber, Wilson, 1989) et surtout social (Goffman, 1974) (souvent mis de c&#244;t&#233;), les 
attentes sont donc, pour nous, cod&#233;es par l&#8217;&#233;tat mental (d&#8217;un locuteur) qui contient les buts (et 
les engagements), les connaissances (sur le monde et sur la t&#226;che), les r&#232;gles de conversation 
et les r&#244;les des participants. 
</p>
<p>Ainsi, lorsque le locuteur A propose un acte de faire-faire-savoir (FfsA(p)), les attentes seront, 
par exemple, une r&#233;ponse de l&#8217;allocutaire (FsB(p)) ou une demande de pr&#233;cision de celui-ci 
(FfsB(p)) ; FfsA(p) &#198; FsB(p) | FfsB(q). Les attentes correspondraient alors dans ce cadre aux 
actes de B,{F&#8217;nB(p)} possibles en r&#233;ponse &#224; l&#8217;acte du locuteur A, FA(p). Parmi ces actes 
possibles (les attentes) se trouvera l&#8217;acte que l&#8217;allocutaire choisira effectivement : F&#8217;iB(q).  
</p>
<p>372 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un mod&#232;le de dialogue par les attentes du locuteur 
</p>
<p>3 Actes et attentes (vers une approche stochastique) 
</p>
<p>Notre but, ici, sera la comparaison de deux approches possibles tenant compte des actes en 
situation, l&#8217;une consiste &#224; pr&#233;dire l&#8217;acte suivant &#224; partir de l&#8217;acte en cours tandis que l&#8217;autre, 
plus fine, se fonde sur les attentes et leur gestion pour d&#233;terminer l&#8217;acte suivant. 
</p>
<p>3.1 Pr&#233;diction des actes 
</p>
<p>Nous adoptons ici la d&#233;marche stochastique qui, &#224; partir des actes annot&#233;s sur notre corpus, 
nous permet d&#8217;associer des probabilit&#233;s aux bigrammes {Acte-courant, Acte-suivant}, par la 
formule de probabilit&#233; conditionnelle de Bayes : P(An+1 | A1,&#8230;,An) = P(A1,&#8230;,An, An+1) / 
P(A1,&#8230;,An). Nous employons en revanche, dans notre &#233;tude, uniquement l&#8217;acte courant 
comme historique (n=1) : 
</p>
<p>P(Acte-suivant | Acte-courant) = P(Acte-courant, Acte-suivant) / P(Acte-courant) 
</p>
<p>Nous avons donc regroup&#233; les 30 premiers dialogues du corpus afin de d&#233;finir la fr&#233;quence de 
cooccurrence de chaque acte. Nous avons obtenu 4315 actes dont 3582 actes en r&#233;ponse 
(actes formul&#233;s par l&#8217;allocutaire en r&#233;ponse au locuteur). La matrice de cooccurrence des 
bigrammes {Acte-en-cours, Acte-suivant} nous fournit la probabilit&#233; de cooccurrence P(Acte-
courant, Acte-suivant) et celle d&#8217;apparition des actes P(Acte-courant) de l&#8217;agent et du client. 
Par la formule de Bayes, nous obtenons donc la probabilit&#233; d&#8217;apparition de chaque acte en 
contexte, P(Acte-suivant | Acte-courant) que nous observons sur la (Figure 1) pr&#233;sentant la 
fr&#233;quence d&#8217;apparition de chaque Acte-suivant (en colonne) en rapport &#224; l&#8217;acte &#233;nonc&#233; (en 
ligne). 
</p>
<p>Acte\s FA(p) FdA(p) FfA(p) FfdA(p) FfsA(p) FpA(p) FsA(p) FC(p) FdC(p) FfC(p) FfdC(p) FfpC(p) FfsC(p) FpC(p) FsC(p) Debut fin
FA(p) 0 0 9,20 1,15 1,15 1,15 9,20 2,30 1,15 2,30 0,00 0 8,05 0 52,87 0 11,49
FdA(p) 1,39 0 0 0 1,39 0 16,67 0 0 1,39 2,78 0 8,33 4,17 63,89 0 0 
FfA(p) 2,90 0 0 7,25 1,45 1,45 18,84 52,17 0 0 1,45 0 0,00 0 14,49 0 0 
FfdA(p) 0 0 0 0 0 0 3,09 1,03 85,57 0 0 0 3,09 0 7,22 0 0 
FfsA(p) 0 0 0 0 3,03 3,03 3,64 0 0,61 0,61 0 0 4,24 1,21 83,64 0 0 
FpA(p) 0,65 0 0 0,65 1,30 0,65 7,14 9,09 1,30 0,65 1,30 0 5,84 28,57 42,21 0 0,65 
FsA(p) 1,63 0,20 1,29 1,23 3,34 1,97 6,06 0,54 2,18 0,82 1,84 0,07 10,48 1,02 67,26 0 0,07 
FC(p) 9,09 0 7,58 15,15 1,52 4,55 31,82 0 1,52 0 0 0 0 1,52 4,55 0 22,73
FdC(p) 4,00 0 2,40 4,80 11,20 2,40 60,00 0 0 0 0,80 0 1,60 1,60 11,20 0 0 
FfC(p) 68,00 0 0 0 8,00 0 16,00 0 0 0 0 0 0 0 8,00 0 0 
FfdC(p) 0 89,36 0 0 0 2,13 2,13 0 0 0 0 0 2,13 2,13 0 0 2,13 
FfpC(p) 0 0 0 0 0 0 0 0 0 0 0 0 100 0 0 0 0 
FfsC(p) 0,31 0,31 0,31 3,38 6,77 2,15 76,92 0 0 0 0,62 0 6,46 0,92 1,85 0 0 
FpC(p) 11,34 2,06 0 2,06 1,03 35,05 21,65 0 0 0 2,06 0 13,40 2,06 7,22 0 2,06 
FsC(p) 1,30 1,65 2,27 2,95 4,53 3,43 65,52 0,34 0,34 0,55 0,62 0 6,80 1,24 8,45 0 0 
debut 0 0 0 0 0 61,29 3,23 0 0 0 3,23 0 6,45 19,35 3,23 3,23 0
</p>
<p>fin 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 100 0 
</p>
<p>Figure 1 : pourcentages d&#8217;actes suivant par rapport &#224; chaque acte 
</p>
<p>D&#232;s lors, nous pouvons proposer un mod&#232;le simple de pr&#233;diction d&#8217;acte &#224; partir de l&#8217;acte 
&#233;nonc&#233;. Ainsi, l&#8217;acte pr&#233;dit est simplement celui qui maximise la probabilit&#233; (acte suivant le 
plus probable) : Acte-pr&#233;dit = argmaxacte&#8712;{Ens. Actes} P(Acte-suivant | Acte-courant). La 
</p>
<p>373 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yannick Fouquet 
</p>
<p>pr&#233;diction sera, par exemple, FsC(p) si l&#8217;on a FfsA(p) car cet acte obtient 83,64% de probabilit&#233; 
de succ&#233;der &#224; l&#8217;acte courant.  
</p>
<p>3.2 G&#233;n&#233;ration et gestion des attentes 
</p>
<p>Consid&#233;rant l&#8217;approche de pr&#233;diction d&#8217;acte suivant insuffisante en dialogue, nous avons 
affin&#233; ce mod&#232;le avec notre notion d&#8217;attentes. En effet, les actes qui posent des buts n&#8217;ont pas 
la m&#234;me importance que les autres. Ils ont, pour nous, un lien tr&#232;s fort avec l&#8217;acte fournit en 
r&#233;ponse (cf. Figure 1 ci-dessus ; bigrammes {FA(p), FB(p)} et {FB(p), FA(p)}). Lorsque je 
demande une information, je souhaite que l&#8217;allocutaire me fournisse la r&#233;ponse. Inversement, 
lorsque je donne une information, je n&#8217;ai pas d&#8217;attentes vis-&#224;-vis de mon allocutaire mais je 
r&#233;ponds davantage aux siennes. Nous formulons donc l&#8217;hypoth&#232;se que lorsque l&#8217;acte courant 
pose un but (donc des attentes) &#224; savoir Ff(p), Ffs(p), Ffd(p) ou Ffp(p), l&#8217;acte imm&#233;diat de 
l&#8217;allocutaire doit &#234;tre, dans un dialogue coop&#233;ratif, un acte parmi les attentes du locuteur 
(respectant ainsi les maximes de Grice). 
</p>
<p>Acte\su FA(p) FdA(p) FfA(p) FfdA(p) FfsA(p) FpA(p) FsA(p) FC(p) FdC(p) FfC(p) FfdC(p) FfpC(p) FfsC(p) FpC(p) FsC(p)
FfA(p)      76,60 0,00 0,00 2,13 0,00 0,00 0,00 21,28
FfdA(p)        1,06 88,30 0,00 0,00 0,00 3,19 0,00 7,45 
FfsA(p)        0,00 0,67 0,67 0,00 0,00 4,70 1,34 92,62 
FfC(p) 73,91 0,00 0,00 0,00 8,70 0,00 17,39         
FfdC(p) 0,00 95,45 0,00 0,00 0,00 2,27 2,27         
FfsC(p) 0,34 0,34 0,34 3,75 7,51 2,39 85,32         
debut 0,00 0,00 0,00 0,00 0,00 63,33 3,33 0,00 0,00 0,00 3,33 0,00 6,67 20,00 3,33
</p>
<p>Figure 2 : pourcentages d&#8217;attentes par rapport &#224; chaque acte posant un but 
</p>
<p>A partir de cette g&#233;n&#233;ration d&#8217;attentes (Figure 2), nous avons adopt&#233; un m&#233;canisme de gestion 
des attentes suivant celui des buts. Ainsi, chaque acte qui pose un but, pose ses attentes 
associ&#233;es dans une pile. Par exemple, lorsque je propose un FfsA(p), mes attentes sont, si je 
suis un agent {FsB(p), FfsB(p), FpB(p) FfB(p), FfdB(p)}. Lorsque le but est satisfait ou 
abandonn&#233;, les attentes sont d&#233;pil&#233;es. Ces attentes seront donc d&#233;pil&#233;es lorsque un des actes 
attendus est propos&#233; (avec, l&#8217;exemple pr&#233;c&#233;dent, FsB(p) permet de d&#233;piler simplement les 
attentes). Ainsi, les F(p), Fs(p), Fd(p) et Fp(p) ne g&#233;n&#232;rent-ils pas d&#8217;attentes mais permettent 
d&#8217;avantage de les d&#233;piler. Nous pouvons voir un exemple de r&#232;gles de gestion simplifi&#233;es ci-
dessous ( ? pour poser un but, + pour l&#8217;atteindre, ++ pour le satisfaire et @ pour 
l&#8217;abandonner ; s pour un sous but) : 
</p>
<p>But = &#8709; &#8743; Acte = FfsY(p) =&gt; ?SX(p) &#8743; Empile(FsX(p) &#8744; FfsX(q)) 
But = SX(p) &#8743; Acte = FsY(p) =&gt; +SX(p) &#8743; Empile(FsX(+ SX(p))&#8744; (FfsX(q) &#8743; SX(q) &#8800; SX(p))) 
But = SX(p) &#8743; Acte = FfsY(q) &#8743; SY(q) = sSX(p) =&gt; -SX(p) &#8743; ?SY(q) &#8743; Empile(FsX(q) &#8744; FfsX(q)) 
But = SX(p) &#8743; Acte = FfsY(q) &#8743; SY(q) &#8800; sSX(p) =&gt; @SX(p) &#8743; ?SY(q) &#8743; D&#233;pile &#8743; Empile(FsX(q) &#8744; FfsX(q)) 
But = SX(p) &#8743; Acte = FsY(q) &#8743; q = +SX(p) =&gt; ++SX(p) &#8743; D&#233;pile 
But = SX(p) &#8743; Acte = FfsY(q) &#8743; +SX(p) &#8743; SX(q) &#8800; SX(p) =&gt; ++SX(p) &#8743; ?SX(q) &#8743; D&#233;pile &#8743; Empile(FsY(q) &#8744; FfsY(q)) 
</p>
<p>Empiler un but ( ?) revient donc &#224; empiler ses attentes associ&#233;es, et inversement, le d&#233;piler 
(++ ou @) revient &#224; d&#233;piler les attentes de leur satisfaction. Atteindre un but permet d&#8217;empiler 
les attentes li&#233;es &#224; la satisfaction du but. Selon ce m&#233;canisme et &#224; partir de notre analyse du 
corpus, nous formulons des r&#232;gles de la forme FfsA(p) &#198; FsB(p)(85,96%) | FfsB(q)(10,53%) | 
FfdB(q)(3,51%) ; lorsque l&#8217;acte FfsA(p) appara&#238;t, les attentes du locuteur A sont FsB(p) &#224; 
85,96% ou FfsB(q) &#224; 10,53% ou encore FfdB(q) &#224; 3,51%. Ainsi, nous n&#8217;empilons pas seulement 
</p>
<p>374 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un mod&#232;le de dialogue par les attentes du locuteur 
</p>
<p>les attentes mais aussi leur probabilit&#233; d&#8217;apparition. Cette pond&#233;ration (qui refl&#232;te les r&#244;les 
des participants) permet de tenir compte de l&#8217;aspect social du dialogue. D&#232;s lors nous 
pouvons proposer un mod&#232;le opportuniste qui, consid&#233;rant l&#8217;acte g&#233;n&#233;r&#233;, propose les attentes 
associ&#233;es. 
</p>
<p>3.3 Test : Comparaison des deux approches 
</p>
<p>Nous avons &#233;mis l&#8217;hypoth&#232;se que le deuxi&#232;me syst&#232;me devrait offrir de meilleures 
performance que le premier, consid&#233;rant que la compr&#233;hension est plus fine. Nous avons donc 
analys&#233; le 31i&#232;me dialogue (consid&#233;r&#233; donc comme dialogue de test) selon le m&#234;me protocole 
que pr&#233;c&#233;demment. 
</p>
<p>Acte\s FA(p) FdA(p) FfA(p) FfdA(p) FfsA(p) FpA(p) FsA(p) FC(p) FdC(p) FfC(p) FfdC(p) FfpC(p) FfsC(p) A C A+C 
FA(p)      1 1 1
FdA(p)       1    1  1 3 3
FfA(p)        2      2 2
FfdA(p)         2     2 2
FfsA(p)             4 4 4
FpA(p)            3  3 3
FsA(p) 1  1  1 1 2    2  14 22 22
FC(p)    2   2 2
FdC(p)       1      1 2 2
FfdC(p)  2    1        3 3
FfsC(p)       4       4 4
FpC(p)  1    1 1       3 3
FsC(p)   1  3  13   2 1 1 2 23 23
debut      1  1
</p>
<p>  37 37 75
</p>
<p>Figure 3 : matrice de cooccurrence des bigrammes {Acte-courant, Acte-suivant} dans le 
31i&#232;me dialogue de notre corpus 
</p>
<p>La (Figure 3) nous permet de comparer l&#8217;acte effectivement produit apr&#232;s chaque acte et celui 
pr&#233;dit. En s&#233;lectionnant l&#8217;acte suivant le plus probable, nous obtenons 45 actes correctement 
pr&#233;dits contre 30 moins probables. Le taux d&#8217;erreur de 40% semble montrer que l&#8217;approche 
par pr&#233;diction d&#8217;acte n&#8217;est peut-&#234;tre pas la plus pertinente et qu&#8217;elle m&#233;riterait d&#8217;&#234;tre affin&#233;e. 
Pour tester nos attentes, nous ne conserverons que les actes qui posent des attentes : Ff(p), 
Ffd(p), Ffp(p) et Ffs(p). L&#8217;attente la plus probable est donc respectivement F(p), Fd(p), Fp(p) et 
Fs(p). Nous obtenons alors 14 actes corrects contre 1 moins probable. Avec un taux d&#8217;erreur 
de 6,67%, cette deuxi&#232;me m&#233;thode, associ&#233;e au m&#233;canisme de gestion des attentes, refl&#233;tant 
plus finement le d&#233;roulement du dialogue, offre donc des r&#233;sultats plus pertinents (l&#8217;efficacit&#233; 
de la gestion des attentes &#233;tant plut&#244;t li&#233;e &#224; celle de la gestion des buts). En outre, nous ne 
conservions ici que l&#8217;acte le plus probable mais &#233;viter d&#8217;&#233;carter les interventions moins 
pr&#233;visibles permet d&#8217;am&#233;liorer la pr&#233;diction des interventions non par la restriction des actes 
possibles mais par une pond&#233;ration de cette possibilit&#233;. 
</p>
<p>4 Conclusion 
</p>
<p>Dans cet article, nous nous sommes int&#233;ress&#233; aux dialogues coop&#233;ratifs de renseignement 
touristique avec des r&#244;les non &#233;quivalents. D&#232;s lors, l&#8217;acte suivant correspond le plus souvent 
</p>
<p>375 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yannick Fouquet 
</p>
<p>&#224; l&#8217;attente la plus probable. Dans le cadre du dialogue homme-machine, cet acte serait, si 
possible, choisi, engendrant parfois quelques erreurs. Associ&#233; &#224; un m&#233;canisme de gestion des 
attentes, nous disposons en revanche d&#8217;une plus grande flexibilit&#233; dans la compr&#233;hension de 
l&#8217;&#233;nonc&#233;. D&#232;s lors, les actes moins probables sont envisageables, le premier n&#8217;&#233;tant pas 
toujours possible (nous ne comprenons pas tout). En dialogue interhumains m&#233;diatis&#233;, nous 
pouvons proposer toutes les attentes avec leur probabilit&#233; d&#8217;apparition et affiner 
r&#233;troactivement le contexte (intentionnel, cognitif et social) avec l&#8217;acte effectivement choisi. 
Cette approche nous permet ainsi de mod&#233;liser le dialogue de mani&#232;re plus &#8216;humaine&#8217;.  
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Austin J.L. (1962), How To Do Things With Words, Oxford U.P. 
</p>
<p>Besacier L., Blanchon H., Fouquet Y.,  Guilbaud J.P., Helme S., Mazenot S., Moraru D., 
Vaufreydaz D. (2001), Speech Translation for French in the NESPOLE ! European Project, 
Actes de Eurospeech. 
</p>
<p>Bilange E. (1992) Dialogue Personne-Machine : Mod&#233;lisation et r&#233;alisation informatique, 
Paris, Herm&#232;s. 
</p>
<p>Colineau N. (1997), &#201;tude Des Marqueurs Discursifs Dans Le Dialogue Finalis&#233;, Th&#232;se De 
Doctorat De Sciences Cognitives, Universit&#233; Grenoble 1. 
</p>
<p>Fouquet Y. (2001), De l&#8217;&#233;tude de dialogues oraux unilingues dans une langue non maternelle, 
Acte de Quatri&#232;me Rencontre Jeunes Chercheurs &#8211; Parole, 42- 44 
</p>
<p>Goffman E. (1974), Les rites d&#8217;interaction, &#201;ditions de Minuit, Paris. 
</p>
<p>Greimas A. J. (1966), S&#233;mantique structurale, Paris, Seuil. 
</p>
<p>Lehuen J. (1997), Un Mod&#232;le De Dialogue Dynamique Et G&#233;n&#233;rique Int&#233;grant L&#8217;acquisition 
De Sa Comp&#233;tence : Le Syst&#232;me Coala. Th&#232;se De Doctorat, Universit&#233; De Caen 
</p>
<p>Lemeunier T. (2000), L&#8217;intentionalit&#233; communicative dans le dialogue homme-machine en 
langue naturelle, Th&#232;se de doctorat, Universit&#233; du Mans.  
</p>
<p>Searle J.R (1972). Les Actes De Langage : Essai De Philosophie Du Langage (Trad. 
Fran&#231;aise Par H. Pauchard), Paris, Hermann. 
</p>
<p>Sperber D., Wilson. D. (1989), La pertinence, communication et cognition, Paris, Les 
&#201;ditions de Minuit. 
</p>
<p>Vanderveken D. (1990), La logique illocutoire, Bruxelles, Mandarga &#233;d.. 
</p>
<p>Vernant D. (1992), Approche Actionnelle Et Mod&#232;le Projectif Du Dialogue Informatif. Du 
Dialogue, Recherches Sur La Philosophie Du Langage, Paris, Vrin N&#176; 14, 295-314. 
</p>
<p>Vernant D. (1997), Du Discours A L&#8217;action : Etudes Pragmatiques, Paris, Presses 
Universitaires De France. 
</p>
<p>376 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un mod&#232;le de dialogue par les attentes du locuteur 
</p>
<p>377 
</p>
<p>Vilnat A. (1997), Quels Processus Pour Les Dialogues Homme-Machine ? In Sabah, G., 
Vivier, J., Vilnat, A., Pierrel, J.M.,  Romary, L., Nicolle, A., Machine, Langage Et Dialogue, 
Figures De L'interaction, Paris, L'harmattan. </p>

</div></div>
</body></html>