<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Acquisition automatique de sens &#224; partir d'op&#233;rations morphologiques en fran&#231;ais : &#233;tudes de cas</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Acquisition automatique de sens &#224; partir d'op&#233;rations 
morphologiques en fran&#231;ais : &#233;tudes de cas 
</p>
<p>Fiammetta NAMER 
</p>
<p>ATILF &#8211; Universit&#233; Nancy 2 
CLSH &#8211; BP3397 &#8211; 54015 Nancy Cedex 
</p>
<p>namer@univ-nancy2.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract * 
</p>
<p>Cet article propose une m&#233;thode de codage automatique de traits lexicaux s&#233;mantiques en 
fran&#231;ais. Cette approche exploite les relations fix&#233;es par l'instruction s&#233;mantique d'un 
op&#233;rateur de construction morphologique entre la base et le mot construit. En cela, la 
r&#233;flexion s'inspire des travaux de Marc Light (Light 1996) tout en exploitant le 
fonctionnement d&#8217;un syst&#232;me d'analyse morphologique existant : l&#8217;analyseur D&#233;riF. A ce jour, 
l'analyse de 12 types morphologiques conduit &#224; l'&#233;tiquetage d&#8217;environ 10 % d'un lexique 
compos&#233; de 99000 lemmes. L&#8217;article s'ach&#232;ve par la description de deux techniques utilis&#233;es 
pour valider les traits s&#233;mantiques. 
</p>
<p>This paper presents an approach which aims at automatically tagging a French lexicon with 
semantic features. This approach makes use of correspondences which are fixed by the 
semantic instruction of morphological operators, between the base and the derived word. It is 
partly inspired by Light (1996) work, and makes use of an existing morphological parser : the 
DeriF system. So far, 12 morphological types have been analysed, enabling the semantic 
tagging of circa 10 % of a lexicon made up of 99000 lemmas. The paper ends up with the 
description of two techniques that have been applied to validate the semantic features. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
</p>
<p>Morphologie d&#233;rivationnelle - affixation et conversion - acquisition de traits s&#233;mantiques 
</p>
<p>Derivational Morphology - affixation and conversion -Semantic feature acquisition  
</p>
<p>1 Introduction 
</p>
<p>L'information s&#233;mantique est cruciale pour l'ensemble des applications en TALN. Cette 
information, cependant, n'est pas toujours accessible : le codage s&#233;mantique est une t&#226;che 
complexe, donc &#224; co&#251;t &#233;lev&#233;. Nous allons voir comment la morphologie peut &#234;tre utilis&#233;e pour 
                                                 
* Je remercie les relecteurs anonymes pour leurs commentaires et suggestions, qui m'ont aid&#233;e dans la r&#233;daction 
</p>
<p>de la deuxi&#232;me version de cet article 
</p>
<p>235 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Namer Fiammetta 
</p>
<p>amorcer le codage d&#8217;un lexique d&#8217;environ 99000 lemmes cat&#233;goris&#233;s au moyen de traits 
s&#233;mantiques. L&#8217;exp&#233;rience relat&#233;e se fonde sur les hypoth&#232;ses linguistiques &#233;nonc&#233;es &#224; 
l&#8217;origine dans (Corbin, 1987) et tire parti du fonctionnement d&#8217;un analyseur de mots 
construits existant : le syst&#232;me D&#233;riF (Namer, 1999). A la section 2, nous situons notre 
approche dans le cadre des travaux d&#8217;acquisition de s&#233;mantique lexicale. Ensuite, la section 3 
illustre par des exemples le r&#244;le des contraintes s&#233;mantiques dans des op&#233;rations de 
construction lexicale par suffixation, pr&#233;fixation et conversion. Une partie de ces contraintes 
est mise en &#339;uvre, au d&#233;but de la section 4, dans le programme D&#233;riF pour annoter 
automatiquement certaines bases et d&#233;riv&#233;s au moyen des traits pertinents. La fin de la section 
4 pr&#233;sente enfin une m&#233;thode de validation de ces traits, bas&#233;e sur deux approches : filtre 
automatique, et recherche sur Internet.  
</p>
<p>2 Sens et ressources lexicales 
</p>
<p>Disposer de ressources lexicales munies d&#8217;informations s&#233;mantiques &#224; la fois facilement 
exploitables et publiquement disponibles est un atout pr&#233;cieux dans l&#8217;&#233;laboration de corpus 
annot&#233;s s&#233;mantiquement, t&#226;che primordiale dans de nombreuses applications TALN : 
l&#8217;anglais dispose du r&#233;seau WordNet, d&#233;velopp&#233; &#224; Princeton ((Miller, 1995), (Fellbaum, 
1998)). Le consortium EuroWordNet (Vossen, 1998) a r&#233;alis&#233; des r&#233;seaux s&#233;mantiques en 
n&#233;erlandais, italien, espagnol, fran&#231;ais, allemand, tch&#232;que et estonien, en lien avec WordNet. 
La base lexicale du fran&#231;ais pr&#233;sente cependant des lacunes : seules les cat&#233;gories noms et 
verbes y sont repr&#233;sent&#233;es, et les seules relations disponibles sont la synonymie, 
l&#8217;hyperonymie et l&#8217;hyponymie. De nombreux travaux r&#233;cents portant sur l'&#233;tiquetage 
s&#233;mantique des corpus d&#233;crivent des m&#233;thodes d&#8217;acquisition de relations s&#233;mantiques 
compl&#233;mentaires, comme par exemple la structure argumentale et les contraintes de s&#233;lection 
des verbes, ce que r&#233;alise pour l'anglais (MacCarthy et al. 2001). Parmi les travaux 
concernant le fran&#231;ais, Fabre et Jacquemin (2000) proposent le codage manuel d'un ensemble 
minimal de traits verbaux binaires de mani&#232;re &#224; accro&#238;tre la pr&#233;cision dans l'appariement de 
variantes teminologiques. 
</p>
<p>Cet article propose une m&#233;thode de codage automatique de traits lexicaux s&#233;mantiques en 
fran&#231;ais qui se veut compl&#233;mentaire &#224; la fois d'EuroWordNet, pour la nature des traits cod&#233;s, 
et de (Fabre &amp; Jacquemin, 2000), pour la m&#233;thode d'acquisition de ces informations : en effet, 
les traits s&#233;mantiques qui codent les entr&#233;es lexicales sont d&#233;duites de contraintes s&#233;mantiques 
associ&#233;es aux op&#233;rations de construction de mots, s'exer&#231;ant tant sur la base que sur le d&#233;riv&#233;. 
Cette m&#233;thode s'inspire des travaux de Light (1996) ; cependant, ce syst&#232;me d'acquisition 
s'appuie sur un programme d'analyse automatique du lexique construit en fran&#231;ais, effectuant 
&#224; ce jour l'analyse compl&#232;te de 18500 mots construits appartenant &#224; divers types 
morphologiques. En cela, notre approche s'&#233;loigne des pr&#233;occupations de M. Light, dont 
l'objectif est d'associer pour l'anglais &#224; chaque op&#233;ration morphologique la repr&#233;sentation 
s&#233;mantique la plus probable de la base et du d&#233;riv&#233;. Son souci &#233;tant de pr&#233;server un &#233;quilibre 
entre pr&#233;cision et rappel, un taux d'erreur non nul est in&#233;vitable (il varie de 0% pour 
l'assignation de l'&#233;tiquette &quot;changement d'&#233;tat&quot; aux d&#233;riv&#233;s en &#8211;en, &#224;  80% pour l'assignation 
du trait &quot;&#233;tat final oppos&#233; &#224; la base&quot; aux d&#233;riv&#233;s en de-). A l&#8217;inverse, notre objectif est de 
privil&#233;gier les op&#233;rations morphologiques conduisant &#224; un codage s&#233;mantique d&#8217;une pr&#233;cision 
proche de 100%. L'approche propos&#233;e ici est illustr&#233;e par l'&#233;tude de quelques op&#233;rations de 
construction de mots (suffixation, pr&#233;fixation ou conversion) s&#233;lectionn&#233;es pour leur 
r&#233;gularit&#233; et, si possible, leur productivit&#233;, et donc les plus pertinentes du point de vue 
</p>
<p>236 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition automatique de sens &#224; partir d'op&#233;rations morphologiques en fran&#231;ais 
</p>
<p>qualitatif (les op&#233;rateurs r&#233;guliers affichant un taux &#233;lev&#233; de pr&#233;cision dans l'assignation des 
traits s&#233;mantiques &#224; la base et au d&#233;riv&#233;) et, le cas &#233;ch&#233;ant, quantitatif (les op&#233;rateurs 
productifs garantissant un nombre &#233;lev&#233; d'entr&#233;es cod&#233;es dans la base). 
</p>
<p>3 Cadre th&#233;orique 
</p>
<p>Le cadre th&#233;orique dans lequel se situent les analyses linguistiques propos&#233;es dans cette 
section est d&#233;crit essentiellement dans (Corbin, 1987), o&#249; la morphologie d&#233;rivationnelle est 
con&#231;ue comme le calcul conjoint de la structure et du sens des unit&#233;s lexicales. Cette 
perspective &#8220; associative &#8221; donne &#224; analyser un mot comme construit s&#8217;il a une structure 
construite et un sens construit qui soit calculable &#224; partir de celle-l&#224;. 
</p>
<p>3.1 Op&#233;rateurs constructionnels et contraintes s&#233;mantiques  
</p>
<p>Outre la composition, qui met en jeu deux unit&#233;s lexicales &#224; sens r&#233;f&#233;rentiel, les op&#233;rations de 
construction de mots rel&#232;vent de deux types possibles de proc&#233;d&#233;s : l'affixation (application 
d'un suffixe ou un pr&#233;fixe &#224; une base) associe sens et forme, alors que la conversion (appel&#233;e 
aussi &quot;d&#233;rivation impropre&quot;, comme le rel&#232;vent, entre autre Arriv&#233; et al. (1986)) met en 
relation deux cat&#233;gories grammaticales sans l'entremise de mat&#233;riel lexical. Les op&#233;rations qui 
nous int&#233;ressent ici doivent avoir, comme propri&#233;t&#233; commune, la facult&#233; d'exercer des 
contraintes s&#233;lectionnelles sp&#233;cifiques et r&#233;guli&#232;res sur la base et/ou le d&#233;riv&#233; qu'elles relient. 
De cette mani&#232;re, le calcul automatique des traits s&#233;mantiques sur les entr&#233;es de la base sera 
pr&#233;cis, le nombre d&#8217;exceptions limit&#233;, et l&#8217;amor&#231;age du codage s&#233;mantique qui en r&#233;sultera 
sera qualitativement pertinent. Un certain nombre d&#8217;op&#233;rations v&#233;rifient ces conditions, qu&#8217;il 
s&#8217;agisse d&#8217;affixation ou de conversion. Nous laissons volontairement de c&#244;t&#233; l'&#233;tude th&#233;orique 
des noms d&#233;verbaux de proc&#232;s ; soit parce que le typage du d&#233;riv&#233; en tant que nom abstrait est 
une propri&#233;t&#233; connue (cf. -age (repassage) ou &#8211;ment (gonflement)) et que toute sp&#233;cification 
suppl&#233;mentaire est impossible en l'absence de traits s&#233;mantiques sur le verbe ; soit parce que 
le typage du d&#233;riv&#233; est non d&#233;terministe, et d&#233;pend de l'aspect t&#233;lique du verbe de base (ainsi, 
les noms en &#8211;tion d&#233;signent &#224; la fois un proc&#232;s, et soit une manifestation de ce proc&#232;s 
(destruction) soit l'entit&#233; concr&#232;te r&#233;sultante (construction)) ; pour les m&#234;mes raisons, nous ne 
dirons rien des noms abstraits de propri&#233;t&#233; construits par -it&#233; 1 . En revanche, nous examinons 
quelques op&#233;rateurs peut-&#234;tre moins connus, mais dont l'instruction s&#233;mantique permet 
d&#8217;&#233;tiqueter de fa&#231;on fine des noms , des verbes, et, plus rarement, des adjectifs. 
</p>
<p>3.1.1 Typage des noms 
</p>
<p>Chacun &#224; sa mani&#232;re, les suffixes &#8211;aille, -aie, et -oir(e) entra&#238;nent un typage s&#233;mantique 
homog&#232;ne du nom en position de base et/ou du nom construit.  
</p>
<p>Il existe deux suffixes &#8211;aille (Aliquot-Suengas, 1999), qui s&#233;lectionnent des bases concr&#232;tes, 
mais qui construisent des noms (&#233;galement concrets) ayant des caract&#233;ristiques diff&#233;rentes. 
</p>
<p>                                                 
1 Pour le typage des nominalisation en &#8211;tion, on pourra se r&#233;f&#233;rer &#224; (Jacquey 2002). En ce qui concerne &#8211;ment et 
</p>
<p>&#8211;age, cf. (Kelling 2001) ; enfin, voir (Dal et al, 1999) au sujet de &#8211;it&#233;. 
</p>
<p>237 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Namer Fiammetta 
</p>
<p>On distingue en effet une majorit&#233; de noms en &#8211;aille collectifs &#224; valeur &#233;valuative (flicaille ou 
ferraille sont marqu&#233;s n&#233;gativement), qui d&#233;signent des agglom&#233;rats dont il est impossible de 
distinguer les morceaux, qu'ils soient comptables (flic) ou massifs (fer), et les noms en &#8211;aille 
&#224; valeur &#233;nonciative argotique non p&#233;jorative, qui ne sont pas des collectifs (jupaille). Seuls 
les premiers sont pertinents dans un lexique de la langue g&#233;n&#233;rale. Comme -aille, le suffixe -
aie, (cf. Aliquot-Suengas, 1996), est un constructeur de noms concrets collectifs qui 
s&#233;lectionne exclusivement des bases d&#233;signant des esp&#232;ces v&#233;g&#233;tales, et programme le nom 
qu'il construit &#224; d&#233;crire un tout (ormaie, bananeraie), o&#249; chaque entit&#233; qui le constitue (orme, 
bananier) est ind&#233;pendante des autres, contrairement, par exemple, &#224; ce que l'on a observ&#233; 
avec -aille formateur d'&#233;valuatifs. Contrairement aux deux premiers, enfin, le suffixe -oir(e) 
s&#233;lectionne des bases verbales et construit des noms concrets d&#233;signant le lieu (fumoir) ou 
l&#8217;instrument (hachoir) participant au d&#233;roulement du proc&#232;s que d&#233;crit la base. Souvent, le 
nom peut d&#233;signer une entit&#233; qui sert &#224; la fois de lieu et d&#8217;instrument (abreuvoir). 
</p>
<p>3.1.2 Typage crois&#233; de verbes et adjectifs 
</p>
<p>L'ensemble des op&#233;rations de construction de verbes d&#233;sadjectivaux (affixation et conversion) 
produisent par essence des pr&#233;dicats de changement d'&#233;tat, l'&#233;tat final &#233;tant d&#233;crit par l'adjectif 
en position de base, qui de ce fait exprime une propri&#233;t&#233; que l'on peut qualifier d'extrins&#232;que 2.  
Quand a- fabrique un verbe &#224; partir d'une base adjectivale (aplatir, allonger), celui-ci est, 
causatif, transitif et le r&#233;f&#233;rent de son objet direct se retrouve dans l'&#233;tat d&#233;crit par l'adjectif &#224; 
la fin du d&#233;roulement du proc&#232;s. A quelques exceptions pr&#232;s (brutaliser, b&#234;tifier), il en est de 
m&#234;me pour -is(er) et &#8211;ifi(er).  Quant aux verbes d&#233;sadjectivaux construits par conversion, ils 
sont soit causatifs, transitifs (vider) soit r&#233;sultatifs intransitifs (bl&#234;mir). Certains admettent les 
deux constructions : c'est notamment le cas des verbes &#224; base adjectivale chromatique (rougir, 
brunir).  
</p>
<p>Un autre cas de typage verbal homog&#232;ne s&#8217;observe par exemple avec les bases s&#233;lectionn&#233;es 
par le suffixe -able formateur d&#8217;adjectifs (cf. (Pl&#233;nat, 1988), repris et mod&#233;lis&#233; dans (Dal et 
al., 1999)). En effet, quand ce suffixe construit un adjectif d&#233;verbal, celui-ci d&#233;signe une 
aptitude, une propri&#233;t&#233; intrins&#232;que, et la base verbale est g&#233;n&#233;ralement transitive. Quand elle 
ne l'est pas, elle d&#233;signe un pr&#233;dicat intransitif de mouvement se construisant avec modifieur 
exprimant la surface sur laquelle s'effectue le mouvement : circulable, skiable, navigable, 
roulable, surfable. 
</p>
<p>On remarquera (Dal et Namer, 2000) que la propri&#233;t&#233; extrins&#232;que observ&#233;e sur les adjectifs 
s&#233;lectionn&#233;s par les op&#233;rateurs formateurs de verbes est incompatible avec la propri&#233;t&#233; 
intrins&#232;que des adjectifs en &#8211;able, ce qui explique que ces derniers sont des bases tr&#232;s 
improbables pour des verbes d&#233;sadjectivaux de changement d'&#233;tat, comme l'illustrent les 
exemples agrammaticaux suivants : *lavabiliser, *imperm&#233;abl(ir|er), *aportabl(ir|er), 
*croyabilifier. 
</p>
<p>                                                 
2 A l'exclusion de d&#233;-, qui marque la suppression, l'annulation pour le th&#232;me du verbe, de l'&#233;tat d&#233;crit par 
</p>
<p>l'adjectif, &#224; la fin du d&#233;roulement du proc&#232;s (d&#233;niaiser, d&#233;lasser). 
</p>
<p>238 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition automatique de sens &#224; partir d'op&#233;rations morphologiques en fran&#231;ais 
</p>
<p>3.1.3 Typage crois&#233; de verbes et noms 
</p>
<p>Le dernier exemple concerne le pr&#233;fixe &#233;-, illustrant le cas des verbes d&#233;nominaux 
construits 3. Aurnague et Pl&#233;nat (1997) d&#233;crivent &#233;- comme un marqueur de dissociation entre 
une partie concr&#232;te le plus souvent inanim&#233;e, d&#233;sign&#233;e par ce &#224; quoi r&#233;f&#232;re la base, et le tout 
(l'objet direct du verbe construit, qui par cons&#233;quent est un causatif transitif). Ils proposent 
une tripartition de ces verbes selon que la partie est (1) un constituant naturel du tout 
(effeuiller une plante, &#233;p&#233;piner un raisin), (2) produite &#224; partir du tout &#224; l'issue du proc&#232;s, et 
ne pr&#233;existant pas &#224; celui-ci (effranger un tapis), (3) un parasite du tout (&#233;pouiller un chien, 
&#233;pousseter un meuble). 
</p>
<p>3.2 Traits cod&#233;s 
</p>
<p>Il est possible de d&#233;duire un ensemble de traits &#224; partir des descriptions pr&#233;sent&#233;es en 3.1. 
Bien sur, le nombre de ces traits ainsi que leur structuration sera vraisemblablement remis en 
cause avec l'analyse de nouveaux types morphologiques. Nous avons alors pr&#233;f&#233;r&#233; dans un 
premier temps adopter une typologie all&#233;g&#233;e, parfois h&#233;t&#233;rog&#232;ne, de mani&#232;re &#224; simplifier les 
m&#233;thodes de traitement. C'est ainsi que le codage des adjectifs se limite &#224; l'opposition 
extrins&#232;que/intrins&#232;que. En ce qui concerne le codage des noms et des verbes, il a &#233;t&#233; proc&#233;d&#233; 
&#224; chaque fois &#224; une structuration minimale sous forme de listes de trois champs. Tout champ 
non pertinent est cod&#233; xxx. Ainsi, un nom est soit concret, soit abstrait, trait qui constitue le 
premier champ de la liste. Le second sp&#233;cifie les noms concrets : inanim&#233;, que l'on oppose &#224; 
anim&#233;. Cette position reste sous-sp&#233;cifi&#233;e pour les noms abstraits. La troisi&#232;me position est 
occup&#233;e par la caract&#233;risation ult&#233;rieure du nom : collectif, lieu, esp&#232;ce-v&#233;g&#233;tale, instrument, 
pour les noms concrets, et propri&#233;t&#233; ou proc&#232;s pour les abstraits. En ce qui concerne les 
verbes, on oppose d'abord causatif et r&#233;sultatif, puis transitif et intransitif. Le troisi&#232;me champ 
d&#233;crit la structure argumentale correspondante, &#233;tiquet&#233;e th&#233;matiquement. Le Tableau 1 &#224; la 
section 4.1.2. illustre la structuration choisie.  
</p>
<p>4 Mise en oeuvre : programme et r&#233;sultats 
</p>
<p>Le calcul automatique de traits s&#233;mantiques sur les entr&#233;es d'un lexique de lemmes &#233;tiquet&#233;s, 
inspir&#233; des hypoth&#232;ses th&#233;oriques expos&#233;es en 3, tire profit de l'existence d'un programme 
d'analyse automatique de mots construits, baptis&#233; D&#233;riF (&quot;D&#233;rivation en Fran&#231;ais&quot;). Dans 
</p>
<p>                                                 
3 Je ne parlerai par contre ni de suffixation (les bases des verbes d&#233;nominaux construits par &#8211;is(er) et &#8211;ifi(er) 
</p>
<p>appartiennent &#224; des types s&#233;mantiques vari&#233;s (vampiriser vs r&#233;volveriser, momifier vs baronifier) refl&#233;tant 
les variantes de l'instruction s&#233;mantique du suffixe) ni de conversion N-&gt;V. En effet, cette op&#233;ration 
s&#233;lectionne aussi bien des noms d&#8217;instrument ou lieu concrets  (hache/hacher, coffre/coffrer) que abstraits 
(force/forcer) (Corbin, &#224; para&#238;tre). La base peut &#233;galement faire r&#233;f&#233;rence &#224; un humain, jouant alors le r&#244;le 
d&#8217;agent typique (singe/singer), alors m&#234;me que l&#8217;op&#233;ration de conversion inverse, produisant essentiellement 
des noms de (r&#233;sultat ou manifestation de) proc&#232;s (voler/vol, chuter/chute), peut conduire aussi &#224; la 
construction de noms d&#8217;agents (garder/garde) (Corbin, 1987). On le voit, le choix des crit&#232;res &#224; prendre en 
compte pour d&#233;terminer les contraintes sous-jacentes &#224; l&#8217;op&#233;ration de conversion N/V et &#224; son orientation 
n&#233;cessite une r&#233;flexion qu&#8217;abordent entre autre Kerleroux (1996, 1997) et qui d&#233;passe le cadre de cet expos&#233;. 
Il est n&#233;anmoins clair que la conversion N-&gt;V n&#8217;est pas homog&#232;ne du point de vue de l&#8217;&#233;tiquetage 
s&#233;mantique du nom ou du verbe. 
</p>
<p>239 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Namer Fiammetta 
</p>
<p>cette derni&#232;re section, et &#224; la suite d'une br&#232;ve description du fonctionnement du programme, 
ainsi que de l'extension permettant le codage s&#233;mantique, nous examinerons les r&#233;sultats 
auxquels nous parvenons au moyen de ce syst&#232;me. 
</p>
<p>4.1 Etiquetage s&#233;mantique 
</p>
<p>4.1.1 D&#233;riF 
</p>
<p>Le programme d'analyse morphologique D&#233;riF est d&#233;velopp&#233; dans le cadre du  projet 
MorTAL (cf. (Namer, 1999) et (Hathout et al, &#224; para&#238;tre)). A ce jour, D&#233;riF effectue l'analyse 
morphologique compl&#232;te des mots construits au moyen des suffixes &#8211;able, &#8211;it&#233;, &#8211;et(te), &#8211;
is(er) et &#8211;ifi(er), ainsi que des pr&#233;fix&#233;s en d&#233;&#8211;, in&#8211;. L'&#233;tude d'autres affixes est partiellement 
r&#233;alis&#233;e : les noms d&#233;nominaux en &#8211;aie et &#8211;aille, les verbes d&#233;verbaux pr&#233;fix&#233;s par re&#8211;, les 
noms d&#233;verbaux suffix&#233;s par &#8211;age, -oir, &#8211;tion, -ment et &#8211;eur, les verbes d&#233;sadjectivaux et 
d&#233;nominaux construits au moyen des pr&#233;fixes &#233;- (&#233;barber, &#233;clairer) et  a- (aplatir, allonger, 
atterrir). De m&#234;me, les op&#233;rations de conversion N-&gt;V et A-&gt;V sont en cours de r&#233;alisation. 
La conception de D&#233;riF ob&#233;it aux hypoth&#232;ses linguistiques qui sous-tendent le mod&#232;le 
morphologique pr&#233;sent&#233; &#224; la section 3 : l'objectif vis&#233; &#233;tant la r&#233;alisation d'une base lexicale 
dont chaque entr&#233;e est munie d'informations morpho-s&#233;mantiques avec un taux d'erreur nul, 
des validations humaines sont n&#233;cessaires, et entra&#238;nent, le cas &#233;ch&#233;ant, des versions 
successives du syst&#232;me. D&#233;riF est appliqu&#233; &#224; un lexique de lemmes &#233;tiquet&#233;s extraits de la 
compilation effectu&#233;e &#224; partir des nomenclatures du TLF et du Robert &#233;lectronique, et 
totalisant quelque 99000 entr&#233;es : 18500 lemmes de ce lexique correspondent aux s&#233;quences 
ci-dessus, et sont analys&#233;s par D&#233;riF. 
</p>
<p>D&#233;riF calcule l'arbre d'analyse de chaque entr&#233;e : cette repr&#233;sentation crochet&#233;e est reprise 
sous forme de famille ordonnant l'ensemble des bases successives reconnues par l'analyseur ; 
le troisi&#232;me composant du r&#233;sultat est une glose en langue naturelle exprimant l'op&#233;ration 
s&#233;mantique induite par l'affixe s'&#233;tant appliqu&#233; en dernier (ex. (1)). D&#233;riF est r&#233;cursif et 
calcule donc toute la famille d'un mot construit (ex (2)). Quand un mot est le produit de 
plusieurs op&#233;rations de construction, l&#8217;analyseur proc&#232;de &#224; un traitement hi&#233;rarchis&#233; 
correspondant aux port&#233;es respectives de ces op&#233;rations :  (3a) vs (3b) illustrent l'ordre entre 
conversion et affixation, (3c) vs (3d), la port&#233;e relative du suffixe et du pr&#233;fixe. D&#233;riF 
manipule les donn&#233;es et les r&#233;sultats sous forme de listes, et est donc capable de g&#233;n&#233;rer 
autant de solutions qu&#8217;il y a d&#8217;ambigu&#239;t&#233;s &#233;ventuelles dans l&#8217;analyse d&#8217;un mot construit (ex. 
(4)). Enfin, de par sa conception, D&#233;riF est capable d'analyser des mots inconnus (possibles et 
non attest&#233;es), comme le montre l'exemple (5).  
</p>
<p>1) continuit&#233;, N =&gt; [ [ continu A] it&#233; N] (continuit&#233;/N, continu/A) :: &quot;facult&#233; d'&#234;tre continu&quot;  
2) explicabilit&#233;, N =&gt; [ [ [ expliquer V] able A] it&#233; N] (explicabilit&#233;/N, explicable/A, expliquer/V) 
</p>
<p>:: &quot;facult&#233; d'&#234;tre explicable&quot;  
3a) ragrafer, V =&gt; [ re [ [ agrafe N] (er) V ] V]  (ragrafer/V, agrafer/V, agrafe/N) ::agrafer une 
</p>
<p>nouvelle fois 
3b) portable, N =&gt; [ [ [ porter V] able A] N ] (portable/N, portable/A, porter/V) :: &quot;entit&#233; ayant 
</p>
<p>pour propri&#233;t&#233; principale d'&#234;tre portable&quot; 
3c) introuvable, A =&gt;[in[[trouver V] able A]A] (introuvable/A, trouvable/A, trouver/V) :: &quot;non 
</p>
<p>trouvable&quot;  
</p>
<p>240 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition automatique de sens &#224; partir d'op&#233;rations morphologiques en fran&#231;ais 
</p>
<p>3d) d&#233;sossable, A =&gt; [ [ d&#233; [os N] V] able A] (d&#233;sossable/A, d&#233;sosser/V, os/N) :: &quot;que l&#8217;on peut 
d&#233;sosser&quot;  
</p>
<p>4) d&#233;coller,V =&gt; [ d&#233;1 [cou N ] V]  (d&#233;coller/V, cou/N) ::(Enlever | (Faire) sortir de) cou 
 d&#233;coller,V =&gt; [ d&#233;1 [colle N] V]  (d&#233;coller/V, colle/N)  ::(Enlever | (Faire) sortir de) colle 
5) adh&#233;rette, N =&gt; [ [ adh&#233;rer V] ette N] (adh&#233;rette/N, adh&#233;rer/V) :: &quot;objet de ou instrument pour 
</p>
<p>adh&#233;rer&quot;  
</p>
<p>4.1.2 Annotation de la base au moyen de traits s&#233;mantiques 
</p>
<p>Les types morphologiques d&#233;crits en 3.1. auxquels s&#8217;ajoutent les noms d&#233;verbaux en &#8211;age et &#8211;
ment, et les noms d&#233;sadjectivaux en &#8211;it&#233; donnent lieu au codage automatique d&#8217;environ 9000 
entr&#233;es, soit 9% du lexique de d&#233;part. Quand les op&#233;rations morphologiques d&#233;crites &#224; la 
section 3 sont activ&#233;es lors de l'analyse d'un lemme L du corpus, la t&#226;che de codage 
s&#233;mantique est d&#233;clench&#233;e en parall&#232;le sur une copie du corpus, o&#249; la description de L est 
enrichie au moyen du ou des traits d&#233;pendants de l'instruction s&#233;mantique de l'op&#233;rateur, ainsi 
qu'en t&#233;moigne l'&#233;chantillon cod&#233; dans le Tableau 1, o&#249; sont indiqu&#233;s (en colonne 5) les traits 
calcul&#233;s pour L (apparaissant dans la colonne 4) en tant que base ou d&#233;riv&#233; (indiqu&#233; par &#171; B &#187; 
ou &#171; D &#187;, colonne 3) de l'op&#233;ration morphologique qui s'est appliqu&#233;e (report&#233;e dans la 
colonne 2). Les traits cod&#233;s sont parfois sous-d&#233;termin&#233;s (ligne 2, 4), parfois erron&#233;s (ligne 3). 
Le fait que L accumule plusieurs s&#233;ries de traits est d&#251; soit au codage en soi (ligne 4), soit &#224; 
l'implication de L dans plusieurs op&#233;rations morphologiques (ligne 7). 
</p>
<p> Op. (D)&#233;riv&#233; 
/ (B)ase 
</p>
<p>Lemme  
Etiquet&#233; 
</p>
<p>Traits Cod&#233;s 
</p>
<p>1 a- D aplatir/VERBE (causatif, transitif, [cause, th&#232;me]) 
</p>
<p>2 A-&gt;V D bl&#234;mir/VERBE (causatif, transitif, [cause, th&#232;me]), (r&#233;sultatif, intransitif, [th&#232;me]) 
</p>
<p>3 -ifi(er) D b&#234;tifier/VERBE (causatif,transitif, [cause, th&#232;me]) 
</p>
<p>4 -able B skier/VERBE (xxx, transitif, [agent, th&#232;me]),  (xxx, intransitif, [agent, (lieu(sur))]) 
5 -oir D abreuvoir/NOM (concret, inanim&#233;, lieu),  (concret, inanim&#233;, instrument) 
6 -it&#233; D loyaut&#233;/NOM (abstrait, xxx, propri&#233;t&#233;) 
</p>
<p>7 &#233;- 
-aille 
</p>
<p>B 
D 
</p>
<p>tripaille/NOM 
tripaille/NOM 
</p>
<p>(concret, inanim&#233;, xxx) 
(concret, xxx, collectif) 
</p>
<p>Tableau 1 
</p>
<p>4.2 Validation des traits 
</p>
<p>Comme l'illustre le Tableau 1, une partie des traits cod&#233;s automatiquement va n&#233;cessiter une 
v&#233;rification, et, le cas &#233;ch&#233;ant, une correction. En effet 1547 entr&#233;es sont munies d'un codage 
ambigu (c'est le cas des bases verbales des adjectifs en -able, des noms d&#233;verbaux en &#8211;oir, et 
des verbes d&#233;sadjectivaux obtenus par conversion) ; on s'attend &#224; ce que la phase de 
validation permette de lever certaines ambigu&#239;t&#233;s. A l'inverse, il est vraisemblable que 
certains codages soient erron&#233;s (ainsi, parmi les 425 verbes en &#8211;iser, les 58 verbes en &#8211;ifier et 
</p>
<p>241 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Namer Fiammetta 
</p>
<p>les 90 verbes en a- analys&#233;s par d&#233;faut comme &#233;tant causatifs transitifs, une partie 
d'entre eux poss&#232;de une construction exclusivement intransitive) ; la validation a ici pour 
objectif de guider vers le rep&#233;rage de ces entr&#233;es mal cod&#233;es, dont la correction in fine sera 
manuelle. D&#8217;autres traits erron&#233;s sont par contre ind&#233;tectables automatiquement : c&#8217;est le cas 
de quelques noms de type anim&#233; d&#233;signant des parasites (chenille, pou, puce, taupe) en 
position de base des verbes en &#233;- et cod&#233;s par d&#233;faut - &#224; tort - inanim&#233; (cf. section 3.1.3). 
Ces v&#233;rifications vont &#234;tre r&#233;alis&#233;es automatiquement au moyen de deux techniques. 
</p>
<p>4.2.1 Validation par filtrage :  
</p>
<p>C'est tout d'abord au moyen de filtres automatiques que sont rep&#233;r&#233;s les codages des lemmes 
qui sont le fait d&#8217;op&#233;rateurs diff&#233;rents ; ces filtres comparent les informations co-occurrentes, 
de mani&#232;re &#224; relever les traits compl&#233;mentaires ou unifiables. A l'heure actuelle, la mise en 
&#339;uvre de cette m&#233;thode n'apporte pas de r&#233;sultats spectaculaires, en raison du nombre encore 
faible de types morphologiques trait&#233;s. Seuls 83 lemmes re&#231;oivent leur codage s&#233;mantique &#224; 
partir de deux op&#233;rations morphologiques distinctes : c'est le cas des bases verbales 
construites dans les adjectifs en &#8211;able qui se retrouvent avec une double s&#233;rie de traits, dont le 
filtre v&#233;rifie la compatibilit&#233;. Par exemple, sur les verbes convertis (ex. 6), le filtre &#233;limine la 
derni&#232;re s&#233;rie de traits, incompatible avec le type de base verbale, et unifie les 1&#232;re et 3&#232;me 
s&#233;ries (la 1&#232;re &#233;tant un cas particulier de la 3&#232;me).  
</p>
<p>6) pr&#233;ciser/VERBE  (causatif, transitif, [cause, th&#232;me]), (r&#233;sultatif, intransitif, [th&#232;me]), 
(xxx, transitif, [agent, th&#232;me]), (xxx, intransitif, [agent, (lieu(sur))) 
</p>
<p>L'autre type de codage valid&#233; par filtre est celui de lemmes comme le nom tripaille, (cf. 
Tableau 1), qui poss&#232;de deux s&#233;ries de traits compl&#233;mentaires : cette entr&#233;e r&#233;unit &#224; la fois les 
contraintes des bases nominales s&#233;lectionn&#233;es par &#233;- (cf. 3.1.3) et les propri&#233;t&#233;s des noms 
construits au moyen de &#8211;aille (cf. 3.1.1). Le filtre remplace automatiquement dans l'une des 
listes de traits, la valeur vide (&quot;xxx&quot;) par l'instance occupant la m&#234;me place dans l'autre liste, 
aboutissant &#224; la fin au codage : (concret, inanim&#233;, collectif). On peut pr&#233;dire 
qu'avec l'&#233;largissement de la couverture en termes d'op&#233;rations morphologiques, la 
juxtaposition des traits rep&#233;r&#233;e automatiquement au moyen de filtres pourra mettre en lumi&#232;re 
des ph&#233;nom&#232;nes int&#233;ressants : si les traits se contredisent, cela pourra signifier la pr&#233;sence 
d'exceptions &#224; des r&#232;gles de formation de mots bien s&#251;r, mais aussi l'existence d'acceptions 
multiples pour une entr&#233;e lexicale ; ainsi, quand l'analyseur traitera les noms suffix&#233;s en &#8211;ure 
et en &#8211;ier on peut supposer que l'entr&#233;e nominale avocat recevra &#224; la fois le trait (concret, 
inanim&#233;, xxx) quand il est analys&#233; &#224; partir de avocatier et (concret, humain, 
profession) quand il est reli&#233; &#224; avocature 4. L'incompatibilit&#233; entre inanim&#233; et humain 
t&#233;moigne ici de l'existence de deux homonymes : le fruit et l'individu. A l'inverse, on peut 
aussi imaginer que les traits calcul&#233;s sur une entr&#233;e sp&#233;cifieront l'instruction s&#233;mantique d'un 
op&#233;rateur acc&#233;dant &#224; cette base. C'est ce qu'on est en droit de s'attendre avec le verbe 
accessoiriser, actuellement analys&#233; au moyen d'une disjonction de gloses (cf. note 3), que 
l'&#233;tiquetage instrumental du nom accessoire, permettra de r&#233;duire &#224; : &quot;munir de 
accessoire&quot;. 
</p>
<p>                                                 
4 Les contraintes s&#233;mantiques des suffixes &#8211;ier et &#8211;ure sont d&#233;crites, respectivement, dans (Corbin &amp; Corbin 
</p>
<p>1991) et (Lecomte 1997). 
</p>
<p>242 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition automatique de sens &#224; partir d'op&#233;rations morphologiques en fran&#231;ais 
</p>
<p>4.2.2 Validation par Internet:  
</p>
<p>La sp&#233;cification des informations s&#233;mantiques peut tirer profit des r&#233;sultats d'une autre 
approche de validation. Cette approche, d&#233;j&#224; mise en &#339;uvre dans (Dal &amp; Namer 2000), 
consiste &#224; tester l'existence sur Internet de termes g&#233;n&#233;r&#233;s morphologiquement et pr&#233;sentant a 
priori les propri&#233;t&#233;s s&#233;mantiques dont on veut tester la validit&#233;. La d&#233;marche est la suivante : 
1800 verbes obtenus par conversion A-&gt;V, suffixation (-is(er), -ifi(er)) ou pr&#233;fixation (a-, &#233;-) 
sont utilis&#233;s comme base pour g&#233;n&#233;rer des adjectifs en &#8211;able absents du lexique d'origine ; ces 
adjectifs sont ensuite employ&#233;s comme requ&#234;te par un robot interrogeant trois moteurs de 
recherche (Yahoo, Francit&#233; et Altavista) : les r&#233;sultats (absence/pr&#233;sence de documents 
r&#233;pondant &#224; la requ&#234;te, nombre de documents retourn&#233;s, similarit&#233; des r&#233;ponses obtenues par 
les trois moteurs) ont une double utilit&#233; : tout d'abord, ils permettent d'enrichir 
automatiquement le lexique d'origine au moyen de l'ensemble des adjectifs en &#8211;able retrouv&#233;s 
par les trois moteurs, soit pr&#232;s de 500 &quot;n&#233;ologismes&quot; (e.g. trivialisable, rigidifiable, 
amochable). Ensuite et surtout, ils servent de guide pour la post-&#233;dition des traits cod&#233;s 
automatiquement sur les verbes-bases. Ainsi, le fait de ne pas retrouver sur Internet un 
adjectif construit en &#8211;able (e.g. bl&#234;missable, b&#234;tifiable, fraternisable) peut signifier que la 
construction de celui-ci est ill&#233;gitime, et donc que sa base est non transitive 5. De telles bases 
verbales sont donc revues manuellement, ce qui peut conduire &#224; d&#233;sambigu&#239;ser le codage de 
verbes construits par conversion, qui ne sont que r&#233;sultatifs (e.g. bl&#234;mir), ou &#224; corriger le trait 
transitif des autres verbes d&#233;sadjectivaux (e.g. b&#234;tifier, fraterniser).  
</p>
<p>5 Conclusion 
</p>
<p>Le travail pr&#233;sent&#233; propose une m&#233;thode pour coder automatiquement des traits s&#233;mantiques 
lexicaux en se servant des contraintes impos&#233;es par les op&#233;rateurs de construction de mots. 
Seuls quelques traits s&#233;mantiques sont accessibles par cette m&#233;thode, et seule une partie du 
lexique est cod&#233;e &#224; ce jour. Il est pr&#233;visible que l'&#233;volution de l'analyseur entra&#238;ne un 
enrichissement du codage pour les noms et les verbes. Mais m&#234;me partiels, ces r&#233;sultats sont 
n&#233;anmoins utilisables d'ores et d&#233;j&#224; en analyse morphologique pour expliciter des exceptions 
ou sp&#233;cifier des gloses. Ils sont &#233;galement exploitables pour s&#233;lectionner les bases candidates 
&#224; la g&#233;n&#233;ration automatique de mots construits : ainsi, les traits codant les verbes en &#233;- ou en 
a- en font des bases potentielles pour des adjectifs en &#8211;able. Enfin, l'approche pr&#233;sent&#233;e peut 
servir, dans un syst&#232;me d'analyse automatique, &#224; la caract&#233;risation s&#233;mantique des mots 
construits qui sont absents des dictionnaires de langue parce qu'ils appartiennent &#224; un type 
morphologique trop productif, ou parce qu'il s'agit de n&#233;ologismes : la nature r&#233;guli&#232;re des 
n&#233;ologismes construits laisse en effet pr&#233;sager une bonne capacit&#233; pr&#233;dictive du syst&#232;me 
d'assignation des traits. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Arriv&#233;, M, Gadet F. et Galmiche M., 1986 , La Grammaire d'Aujourd'hui, Paris, Flammarion. 
</p>
<p>                                                 
5 La prudence face aux r&#233;sultats, et contr&#244;le manuel de ceux-ci est rendue n&#233;cessaire du fait de l'instabilit&#233; bien 
</p>
<p>connue des informations sur Internet. 
</p>
<p>243 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Namer Fiammetta 
</p>
<p>244 
</p>
<p>Aliquot-Suengas S., 1996, R&#233;f&#233;rence collective / sens collectif. La cat&#233;gorie du collectif dans 
les noms suffix&#233;s du lexique fran&#231;ais, Th&#232;se de doctorat, Universit&#233; de Lille III. 
</p>
<p>Aliquot-Suengas S., 1999, De la poiscaille dans la piscaille. Les noms d&#233;nominaux &#233;valuatifs 
construits avec une forme suffixale -ail(le), Silexicales, n&#176;2, Lille. 
</p>
<p>Aurnague, M. et Pl&#233;nat, M., 1997, Manifestations morphologiques de la relation 
d&#8217;attachement habituel, Silexicales N&#176;1, Lille 
</p>
<p>Corbin D., 1987, Morphologie d&#233;rivationnelle et structuration du lexique, 2 vol., T&#252;bingen, 
Max Niemeyer Verlag ; 2e &#233;d., Villeneuve d'Ascq, Presses Universitaires de Lille, 1991. 
</p>
<p>Corbin D., &#224; para&#238;tre, French (Indo-european : Romance), in G. Booij, C. Lehmann &amp; J. 
Mugdan eds, Morphology. A Handbook on Inflection and Word Formation, Berlin/New 
York, Walter de Gruyter [article n&#176; 121]. 
</p>
<p>Corbin D. &amp; Corbin P., 1991, Un traitement unifi&#233; du suffixe -ier(e),  Lexique 10, pp. 61-145. 
Dal, G., Hathout, N. et Namer, F., 1999, Construire un lexique d&#233;rivationnel : th&#233;orie et 
</p>
<p>r&#233;alisations, Actes de TALN 1999, Carg&#232;se.  
Dal, G., et Namer, F., 2000, G&#233;n&#233;ration et analyse automatiques de ressources lexicales 
</p>
<p>construites utilisables en recherche d&#8217;informations, TAL 41-2, pp. 423-446. 
Fabre, C. et Jacquemin, Ch., 2000, Boosting Variant Recognition with Light Semantics, in 
</p>
<p>Proceedings of COLING2000, Saarbr&#252;cken. 
Fellbaum, C. 1998, WordNet, An Electronic Lexical Database, MIT Press.  
Hathout, N., Dal, G. et Namer, F., &#224; para&#238;tre, Une base de donn&#233;es constructionnelles 
</p>
<p>exp&#233;rimentale : le projet MorTAL, in P. Boucher ed., Many Morphologies, Cambridge 
Mass., Cascadilla Press. 
</p>
<p>Jacquey E., 2002, Les d&#233;verbaux d&#8217;action en fran&#231;ais : quel type d&#8217;ambigu&#239;t&#233; et quelle 
cat&#233;gorie conceptuelle, &#224; para&#238;tre dans les Actes de la conf&#233;rence Repr&#233;sentations du sens 
linguistique, Lincom Europa. 
</p>
<p>Kelling C., 2001, Agentivity and Suffix Selection, in M. Butt,T. H. King (eds): Proceedings 
LFG 2001, Stanford: CSLI Publications. 
</p>
<p>Kerleroux, F., 1996, La coupure invisible, Presses Universitaires du Septentrion, Lille. 
Kerleroux, F., 1997, De la limitation de l&#8217;homonymie entre noms d&#233;verbaux convertis et 
</p>
<p>apocopes de noms d&#233;verbaux suffix&#233;s, Lexicales N&#176;1, Lille p. 163-172 
Lecomte E., 1997 : Tous les mots possibles en &#8211;ure existent-ils?&#8221;, Silexicales N&#176;1, Lille. 
Light, M., 1996, Morphological Cues for Lexical Semantics, Proceedings of the 34th ACL. 
McCarthy, D., J. Carroll and J. Preiss (2001) Disambiguating noun and verb senses using 
</p>
<p>automatically acquired selectional preferences, In Proceedings of the SENSEVAL-2 
Workshop at ACL/EACL'01 , Toulouse, France. 
</p>
<p>Miller, G.A. 1995, WordNet: A Lexical Database, Communication of the ACM, vol 38: N&#176;11. 
Namer, F., 1999, Traitement automatique de la d&#233;rivation: le cas des noms et adjectifs en &#8211;
</p>
<p>et(te), Silexicales n&#176;2, Lille. 
Pl&#233;nat, M., 1988, Morphologie des adjectifs en -able, Cahiers de grammaire 13, pp. 101-132.  
Vossen P. (Ed.) (1998), EuroWordNet A Multilingual Database with Lexical Semantic 
</p>
<p>Networks. Kluwer Academic publishers. </p>

</div></div>
</body></html>