<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Compr&#233;hension Automatique de la Parole et TAL : une approche syntaxico-s&#233;mantique pour le traitement des inattendus structuraux du fran&#231;ais parl&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Compr&#233;hension Automatique de la Parole et TAL :
une approche syntaxico-s&#233;mantique pour le traitement des
</p>
<p>inattendus structuraux du fran&#231;ais parl&#233;
</p>
<p>J&#233;r&#244;me Goulian, Jean-Yves Antoine, Franck Poirier
VALORIA , EA2593 &#8211; Universit&#233; de Bretagne Sud
Site de Tohannic, rue Yves Mainguy, 56000 Vannes
</p>
<p>jerome.goulian@univ-ubs.fr
</p>
<p>R&#233;sum&#233; - Abstract
Dans cet article, nous pr&#233;sentons un syst&#232;me de Compr&#233;hension Automatique de la Parole dont
l&#8217;un des objectifs est de permettre un traitement fiable et robuste des inattendus structuraux du
fran&#231;ais parl&#233; (h&#233;sitations, r&#233;p&#233;titions et corrections). L&#8217;analyse d&#8217;un &#233;nonc&#233; s&#8217;effectue en deux
&#233;tapes : une premi&#232;re &#233;tape g&#233;n&#233;rique d&#8217;analyse syntaxique de surface suivie d&#8217;une seconde
&#233;tape d&#8217;analyse s&#233;mantico-pragmatique, d&#233;pendante du domaine d&#8217;application et reposant sur
un formalisme lexicalis&#233; : les grammaires de liens. Les r&#233;sultats de l&#8217;&#233;valuation de ce syst&#232;me
lors de la campagne d&#8217;&#233;valuation du Groupe de Travail Compr&#233;hension Robuste du GDR I3 du
CNRS nous permettent de discuter de l&#8217;int&#233;r&#234;t et des limitations de l&#8217;approche adopt&#233;e.
</p>
<p>This paper discusses the issue of how a speech understanding system can be made robust against
spontaneous speech phenomena (hesitations and repairs). We present a spoken French under-
standing system. It implements speech understanding in a two-stage process. The first stage
achieves a finite-state shallow parsing that consists in segmenting the recognized sentence into
basic units (spoken-adapted chunks). The second one, a Link Grammar parser, looks for inter-
chunks dependencies in order to build a rich representation of the semantic structure of the
utterance. These dependencies are mainly investigated at a pragmatic level through the con-
sideration of a task concept hierarchy. Discussion about the approach adopted is based on the
results of the system&#8217;s assessment in an evaluation campaign held by the CNRS.
</p>
<p>Mots-clefs &#8211; Keywords
communication orale homme-machine, compr&#233;hension automatique de la parole, r&#233;p&#233;titions,
corrections, analyse syntaxique partielle, grammaires de liens.
spoken man-machine dialog, speech understanding, repairs, shallow parsing, link grammars.
</p>
<p>1 Introduction
Parmi les probl&#232;mes auxquels sont confront&#233;s les syst&#232;mes de traitement automatique de la
langue parl&#233;e se trouvent incontestablement les inattendus structuraux dus au caract&#232;re spontan&#233;
des productions orales. D&#8217;un point de vue purement descriptif, citons parmi ces ph&#233;nom&#232;nes :
</p>
<p>&#0; Les h&#233;sitations. Ce sont les manifestations les plus courantes des recherches de d&#233;no-
mination. Les plus simples vont de la courte pause dans la prononciation &#224; des pauses
plus longues combl&#233;es par des interjections (euh) ou des appuis du discours (donc, alors).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>J&#233;r&#244;me Goulian, Jean-Yves Antoine, Franck Poirier
</p>
<p>&#0; Les r&#233;p&#233;titions et les corrections. Qu&#8217;il s&#8217;agisse pour le locuteur de pr&#233;ciser sa pens&#233;e
ou de se corriger, ces ph&#233;nom&#232;nes se caract&#233;risent par un ph&#233;nom&#232;ne d&#8217;entasssement
paradigmatique (Blanche-Benveniste, 1990), illustr&#233; par l&#8217;exemple suivant :
</p>
<p>je cherche un
un restaurant euh
un restaurant fran&#231;ais pr&#232;s de
</p>
<p>pr&#232;s de la gare
</p>
<p>On en distingue deux types suivant la pr&#233;sence ou non d&#8217;&#233;l&#233;ments (interjections ou appuis
du discours) entre le ou les groupes de mots r&#233;p&#233;t&#233;s ou repris. Notons par ailleurs que
l&#8217;enrichissement successif d&#8217;un lex&#232;me pr&#233;alablement prononc&#233;, est un ph&#233;nom&#232;ne de
recherche de d&#233;nomination fr&#233;quemment utilis&#233;.
</p>
<p>Le traitement de ces ph&#233;nom&#232;nes oraux s&#8217;est envisag&#233;, &#224; la suite des travaux de Hindle (Hindle,
1983), par des &#233;tapes de pr&#233;-analyse, ayant pour objectifs la d&#233;tection puis le filtrage ou la cor-
rection automatique des reprises et r&#233;p&#233;titions orales. Ont ainsi &#233;t&#233; d&#233;velopp&#233;s des techniques
robustes de d&#233;tection automatique de motifs fond&#233;s sur les mots et leurs cat&#233;gories syntaxiques
(Bear et al., 1992) ou des mod&#232;les de langage stochastiques sp&#233;cifiques prenant en compte mar-
queurs lexicaux et informations acoustiques (Heeman &amp; Allen, 1999). Ces approches ont donn&#233;
d&#8217;assez bons r&#233;sultats pour la d&#233;tection d&#8217;une grande majorit&#233; de ces ph&#233;nom&#232;nes ; cependant,
leurs concepteurs reconnaissent la n&#233;cessit&#233; d&#8217;une intervention plus importante d&#8217;informations
syntaxiques et s&#233;mantiques pour d&#8217;une part &#233;viter la surg&#233;n&#233;rativit&#233; et l&#8217;&#233;limination abusive de
structures informatives sciemment utilis&#233;es par le locuteur1, et d&#8217;autre part assurer un traitement
correct de l&#8217;ensemble de ces ph&#233;nom&#232;nes. Cet article pr&#233;sente un syst&#232;me de compr&#233;hension
de la parole, ROMUS, dans le cadre d&#8217;une communication homme-machine finalis&#233;e portant
sur le renseignement touristique. Ce syst&#232;me n&#8217;int&#232;gre pas d&#8217;&#233;tape de pr&#233;-traitement de ces
ph&#233;nom&#232;nes. Leur traitement est envisag&#233; au cours du processus d&#8217;analyse du sens de l&#8217;&#233;nonc&#233;
; processus qui prend en compte des connaissances syntaxiques et s&#233;mantiques.
</p>
<p>2 Le syst&#232;me ROMUS
Notre syst&#232;me de compr&#233;hension adopte une d&#233;marche identique &#224; celle des outils d&#8217;analyse
syntaxique robuste d&#233;velopp&#233;s pour le TAL. Ces syst&#232;mes s&#8217;articulent en g&#233;n&#233;ral en deux
&#233;tapes : une premi&#232;re &#233;tape rep&#233;rant des structures minimales et une seconde &#233;tape calculant
des structures ou relations plus complexes (Ejerhed, 1993). Nous adaptons ainsi le principe de
chunking (i.e. segmentation en constitutants minimaux non-r&#233;cursifs (Abney, 1991)) &#224; l&#8217;analyse
des &#233;nonc&#233;s oraux. Cette premi&#232;re &#233;tape repose uniquement sur des informations grammati-
cales et syntaxiques encod&#233;es au moyen d&#8217;automates &#224; &#233;tats finis. Elle est donc enti&#232;rement
portable d&#8217;une application &#224; une autre ; notre syst&#232;me r&#233;pondant ainsi en partie &#224; la question
de la g&#233;n&#233;ricit&#233; des syst&#232;mes actuels de compr&#233;hension de la parole (Hirschman, 1998). Les
segments extraits sont ensuite mis en relation les uns avec les autres par une analyse reposant
sur une grammaire de liens. Les d&#233;pendances entre segments sont cette fois principalement
envisag&#233;es &#224; un niveau s&#233;mantico-pragmatique2.
</p>
<p>2.1 Segmentation syntaxique partielle
Etiquetage Chaque mot de l&#8217;&#233;nonc&#233; fourni par le module de reconnaissance de la parole re&#231;oit
pr&#233;alablement une &#233;tiquette correspondant &#224; sa cat&#233;gorie grammaticale. Le lexique est repr&#233;sent&#233;
</p>
<p>1C&#8217;est le cas par exemple des enrichissements lexicaux. Un exemple en est donn&#233; (Bear et al., 1992) par la
structure suivante flights daily flihts dans l&#8217;&#233;nonc&#233; show me flights daily flights, qui peut &#234;tre faussement d&#233;tect&#233;e
comme une r&#233;p&#233;tition suivant le motif (M1 X M1).
</p>
<p>2Nous faisons ici r&#233;f&#233;rence au domaine de l&#8217;application et non &#224; la prise en compte du dialogue.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement syntaxico-s&#233;mantique des inattendus structuraux de la parole
</p>
<p>sous forme d&#8217;un automate &#224; &#233;tats finis d&#233;terministe permettant un temps d&#8217;acc&#232;s r&#233;duit et un
faible volume de stockage. Il comporte actuellement environ 45000 mots. Un ensemble r&#233;-
duit de 25 &#233;tiquettes grammaticales est utilis&#233; pour la segmentation. Certaines informations
morphologiques encod&#233;es dans le lexique, comme le temps des verbes, sont n&#233;anmoins con-
serv&#233;es. L&#8217;ambigu&#239;t&#233; lexicale est g&#233;r&#233;e par l&#8217;application de r&#232;gles de d&#233;sambigu&#239;sation con-
textuelles encod&#233;es au moyen de transducteurs. Une attention particuli&#232;re a &#233;t&#233; port&#233;e &#224; la
d&#233;sambiguisation d&#8217;expressions fr&#233;quentes &#224; l&#8217;oral (le mot quoi par exemple, employ&#233; comme
interjection). Toutefois, une trop forte d&#233;sambigu&#239;sation &#224; cette &#233;tape risque d&#8217;entra&#238;ner des er-
reurs tr&#232;s p&#233;nalisantes pour la suite de l&#8217;analyse. La version actuelle de notre syst&#232;me pr&#233;sente
un compromis acceptable (taux de d&#233;cision de 86.4%3 contre 95% pour l&#8217;&#233;tiqueteur utilis&#233; au
moment de l&#8217;&#233;valuation). En cas d&#8217;ambigu&#239;t&#233;, les diff&#233;rentes s&#233;quences sont conserv&#233;es.
Segmentation Outre les chunks classiques (chunks nominaux, chunks verbaux, etc.), nous
avons choisi de caract&#233;riser deux types de segments minimaux : les expressions langagi&#232;res
sp&#233;cifiques et ind&#233;pendantes de l&#8217;application (date, heure, prix), et les segments constitu&#233;s des
marques (interjections, appuis du discours) des inattendus structuraux de l&#8217;oral. Chacun de ces
segments peut &#234;tre d&#233;crit par des expressions r&#233;guli&#232;res mettant en jeu les &#233;tiquettes grammati-
cales pr&#233;c&#233;demment &#233;voqu&#233;es. Ces expressions sont compil&#233;es en transducteurs que l&#8217;on rend
d&#233;terministes (Roche &amp; Schabes, 1997). Chacun de ces transducteurs est utilis&#233; en cascade pour
introduire dans l&#8217;&#233;nonc&#233; des marqueurs de d&#233;limitation autour de ces groupes. La t&#234;te lexicale
des segments grammaticaux classiques est &#233;galement marqu&#233;e lors de cette &#233;tape. L&#8217;ambigu&#239;t&#233;
de segmentation est g&#233;r&#233;e par l&#8217;heuristique de maximisation des segments d&#233;tect&#233;s. Chacune
des s&#233;quences de l&#8217;&#233;tape de pr&#233;-&#233;tiquetage est ainsi segment&#233;e et conserv&#233;e pour &#234;tre trait&#233;e
en parall&#232;le par les niveaux suivants de l&#8217;analyse. &#192; l&#8217;int&#233;rieur d&#8217;une s&#233;quence, les mots non
int&#233;gr&#233;s dans des groupements sont &#233;limin&#233;s.
[je&#0;&#0;
</p>
<p>&#0;&#1;
</p>
<p>] [cherche&#0;&#0;
&#2;&#3;&#1;&#4;&#5;&#6;&#7;&#8;&#0;&#1;&#0;&#9;&#10;&#9;&#6;&#11;
</p>
<p>] un&#0;
&#12;&#1;&#11;&#1;&#13;&#6;&#14;&#0;&#9;&#15;&#13;&#6;&#13;
</p>
<p>[un&#0;
&#12;&#1;&#11;&#1;&#13;&#6;&#14;
</p>
<p>restaurant&#0;&#0;
&#6;
</p>
<p>] [euh&#0;
&#16;&#9;&#10;
</p>
<p>]
[un&#0;
</p>
<p>&#12;&#1;&#11;&#1;&#13;&#6;&#14;
</p>
<p>restaurant&#0;&#0;
&#6;
</p>
<p>] [fran&#231;ais&#0;&#0;
&#12;&#14;&#7;
</p>
<p>] pr&#232;s-de&#0;
&#0;&#1;&#9;&#0;
</p>
<p>[pr&#232;s-de&#0;&#0;
&#0;&#1;&#9;&#0;
</p>
<p>la&#0;
&#12;&#1;&#11;&#1;&#14;&#9;&#15;
</p>
<p>gare&#0;
&#6;
</p>
<p>]
</p>
<p>Figure 1: Segmentation de l&#8217;&#233;nonc&#233; &#8220;je cherche un un restaurant euh un restaurant fran&#231;ais pr&#232;s de pr&#232;s de la gare&#8221;. Les segments sont
repr&#233;sent&#233;s entre crochets. Les &#233;tiquettes utilis&#233;es pour la segmentation sont indiqu&#233;es apr&#232;s l&#8217;anti-slash. La t&#234;te lexicale est marqu&#233;e par&#0;.
</p>
<p>2.2 Analyse s&#233;mantico-pragmatique par grammaire de liens
Extraction des d&#233;pendances locales Afin de pouvoir envisager le rattachement de ces dif-
f&#233;rents segments selon des crit&#232;res s&#233;mantico-pragmatiques, ceux-ci sont transform&#233;s en struc-
tures arborescentes qui rendent compte de mani&#232;re compacte de toutes les informations extraites
par l&#8217;analyse pr&#233;c&#233;dente. La racine de ces arbres est compos&#233;e d&#8217;un triplet &#0; &#1;&#2;&#3; &#4;&#3;&#5; &#6;. &#0;&#1;
est le R&#244;le S&#233;mantique du groupement vis &#224; vis de l&#8217;application ; ce r&#244;le est d&#233;riv&#233;, en premi&#232;re
approximation, de la cat&#233;gorie grammaticale du segment4 : un groupe nominal aura le r&#244;le s&#233;-
mantique d&#8217;Objet, un groupe adjectival celui de Propri&#233;t&#233;, etc. &#2; correspond &#224; la T&#234;te lexicale
du segment. Les groupes &#8220;des h&#244;tels&#8221; et &#8220;une pizzeria&#8221; auront respectivement pour &#2; les mots
h&#244;tel (la t&#234;te lexicale) et restaurant (une pizzeria n&#8217;est pour l&#8217;application qu&#8217;un &#233;tablissement
de restauration particulier). &#3; est l&#8217;ensemble des propri&#233;t&#233;s Morphologiques qui pourront in-
tervenir dans le rattachement des constituants. Les autres informations (la propri&#233;t&#233; Sp&#233;cialit&#233; :
pizza par exemple) sont exprim&#233;es sous forme de d&#233;pendances (feuilles ou noeuds de l&#8217;arbre).
Elles n&#8217;interviendront pas dans le rattachement.
</p>
<p>3La pr&#233;cision, &#233;valu&#233;e sur un &#233;chantillon similaire de 1200 &#233;nonc&#233;s, est de 96.7%
4Cette cat&#233;gorisation s&#233;mantique d&#233;pend en partie de l&#8217;application. Ainsi le groupe pr&#233;positionnel &#8220;proche-de
</p>
<p>la gare&#8221; se verra attribuer le r&#244;le de &#8220;Propri&#233;t&#233;-Localisation&#8221; car le seul autre r&#244;le de proche-de dans l&#8217;application,
&#224; savoir un ordre de grandeur sur un prix (proche-de 5 euros) aurait &#233;t&#233; pr&#233;alablement &#233;tiquet&#233; comme tel.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>J&#233;r&#244;me Goulian, Jean-Yves Antoine, Franck Poirier
</p>
<p>Chunk RS T M D&#233;pendances locales
</p>
<p>Verbal Acte-Modal savoir temps:conditionnel
vouloir
</p>
<p>Modalit&#233;
</p>
<p>voudrais savoir
</p>
<p>Nominal Objet restaurant ind&#233;fini 1 pizza
&#0;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>Quantit&#233; &#1;&#1;
&#1;
</p>
<p>Sp&#233;cialit&#233;
</p>
<p>une pizzeria
</p>
<p>Pr&#233;positionnel Propri&#233;t&#233;-Localisation pr&#232;s-de d&#233;fini gare
Obj-Loc
</p>
<p>pr&#232;s-de la gare
</p>
<p>Prep. Heure Propri&#233;t&#233;-Heure avant &#1;
15 0
&#2;
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>Val-heure &#1;&#1;
&#1;
</p>
<p>Val-minute
</p>
<p>avant 15 heures
</p>
<p>Table 1: Triplets &#0; &#1;&#2;&#3; &#4;&#3;&#5; &#6; et d&#233;pendances locales associ&#233;es &#224; diff&#233;rents segments.
</p>
<p>Rattachement s&#233;mantico-pragmatique Il est le r&#233;sultat d&#8217;une analyse lexicalis&#233;e caract&#233;risant
les relations de d&#233;pendances entre segments. Celles-ci vont correspondre aux relations pr&#233;dicat-
argument de la repr&#233;sentation s&#233;mantique finale. Notre analyse utilise une grammaire de liens
(Sleator &amp; Temperley, 1991). Les liens entre segments, repr&#233;sent&#233;s par les triplets &#0; &#1;&#2;&#3; &#4;&#3;&#5; &#6;,
s&#8217;expriment au moyen de connecteurs &#233;tiquet&#233;s et orient&#233;s qui peuvent s&#8217;associer deux &#224; deux
pour former une relation valide. &#192; chaque entr&#233;e du dictionnaire est associ&#233;e une formule
d&#233;crivant les relations autoris&#233;es entre l&#8217;&#233;l&#233;ment concern&#233; et les &#233;l&#233;ments situ&#233;s &#224; sa droite et &#224; sa
gauche dans l&#8217;&#233;nonc&#233;. Les deux entr&#233;es suivantes signifient que l&#8217;&#233;l&#233;ment &#4;
</p>
<p>&#0;
</p>
<p>doit entretenir une
relation&#0; avec un autre &#233;l&#233;ment situ&#233; soit &#224; sa gauche dans l&#8217;&#233;nonc&#233; soit &#224; sa droite (op&#233;rateurs&#0;
et &#1; respectivement). La succession &#8211;&#4;
</p>
<p>&#0;
</p>
<p>&#4;
</p>
<p>&#2;
</p>
<p>&#8211; est en ce sens valide car ces deux &#233;l&#233;ments (dans
cet ordre) peuvent &#234;tre reli&#233;s par &#0;.
</p>
<p>&#0;&#4;
</p>
<p>&#2;
</p>
<p>&#1; &#5; &#1;&#0;
</p>
<p>&#2;
</p>
<p>&#6; &#2;
</p>
<p>&#2;
</p>
<p>&#6; &#7;
</p>
<p>&#2;
</p>
<p>&#8;&#2; &#0;
</p>
<p>&#0;
</p>
<p>&#3; &#0;&#4;
</p>
<p>&#0;
</p>
<p>&#1; &#5; &#1;&#0;
</p>
<p>&#0;
</p>
<p>&#6; &#2;
</p>
<p>&#0;
</p>
<p>&#6; &#7;
</p>
<p>&#0;
</p>
<p>&#8;&#2; &#0;
</p>
<p>&#0;
</p>
<p>&#9;&#10; &#0;
</p>
<p>&#1;
</p>
<p>&#3;
</p>
<p>On distingue deux types de relations principales :
&#0; les relations sp&#233;cifiques &#224; l&#8217;application comme par exemple la relation cat&#233;gorie qui
</p>
<p>peut lier les deux segments minimaux &#5; &#11;&#12;&#13;&#14;&#15;&#6; &#16;&#9;&#15;&#14;&#17;&#6; &#18;&#19;&#20; &#8; et &#5; &#11;&#12;&#13;&#14;&#15;&#6; &#14;&#15;&#9;&#18;&#17;&#14;&#6; &#20;&#14;&#21; &#8; ;
&#0; les relations exprimant des constructions syntaxiques g&#233;n&#233;riques comme le traitement des
</p>
<p>coordinations, des relatives, des proc&#233;d&#233;s d&#8217;extraction. Par exemple, l&#8217;entr&#233;e du diction-
naire correspondant &#224; la coordination logique et est de la forme :
</p>
<p>&#5; &#22;&#9;&#9;&#6; &#14;&#15;&#6; &#1; &#8;&#2; &#0;&#22;&#11;&#11;
</p>
<p>&#0;
</p>
<p>&#7;
</p>
<p>&#0;
</p>
<p>&#23;&#19;&#20; &#22;&#11;&#11;
</p>
<p>&#1;
</p>
<p>&#7;
</p>
<p>&#1;
</p>
<p>&#1; &#23;&#19;&#20; &#24;
</p>
<p>&#0;
</p>
<p>&#3;
</p>
<p>o&#249; &#24;&#4;&#6; &#24;&#5; &#2; &#24; d&#233;notent des relations Et-compatibles au sens de &#24; . Dans l&#8217;&#233;nonc&#233; je
voudrais une chambre double et avec douche, le marqueur et peut relier double et avec
douche car les deux relations Cat&#233;gorie-chambre (entre chambre et double) et TypeBain-
chambre (entre chambre et douche) sont compatibles pour la coordination logique et selon
la relation &#24; englobante Propri&#233;t&#233;-chambre. Les entr&#233;es du dictionnaire de ces mar-
queurs sont g&#233;n&#233;r&#233;es automatiquement &#224; partir des diff&#233;rents ensembles Et-compatibles.
</p>
<p>Notre dictionnaire comporte environ 1000 entr&#233;es, rendant compte de 36 requ&#234;tes (demande de
tarif, d&#8217;horaire, etc.) et 158 concepts (objets et propri&#233;t&#233;s de l&#8217;application).
L&#8217;algorithme d&#8217;analyse est fond&#233; sur une exploration dynamique de tous les liens possibles cal-
cul&#233;s &#224; partir de l&#8217;ensemble des disjonctions associ&#233;es &#224; chaque &#233;l&#233;ment de l&#8217;&#233;nonc&#233;. Il est
gouvern&#233; par une contrainte de planarit&#233;. Cette analyse est partielle : elle autorise la forma-
tion d&#8217;&#238;lots (au moins deux &#233;l&#233;ments reli&#233;s entre eux mais pas avec le reste de l&#8217;&#233;nonc&#233;). Un
syst&#232;me de co&#251;t permet de classer les diff&#233;rents graphes valides. Nous privil&#233;gions, par ordre</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement syntaxico-s&#233;mantique des inattendus structuraux de la parole
</p>
<p>de co&#251;t d&#233;croissant, les analyses compl&#232;tes, les analyses partielles avec &#238;lots puis les analyses
partielles avec des &#233;l&#233;ments isol&#233;s. En cas d&#8217;&#233;galit&#233;, un heuristique privil&#233;gie les analyses ayant
caract&#233;ris&#233; le moins de d&#233;pendances longue-distance.
</p>
<p>Construction de la repr&#233;sentation s&#233;mantique finale Elle d&#233;coule du parcours du graphe
non-orient&#233; obtenu. Cette &#233;tape participe &#233;galement au traitement des inattendus (cf. 3).
3 ROMUS et le traitement des inattendus structuraux
R&#233;p&#233;titions et corrections de mots La segmentation syntaxique partielle de l&#8217;&#233;nonc&#233; permet
un premier traitement de quelques r&#233;p&#233;titions : les mots qui ne sont pas int&#233;gr&#233;s dans un segment
&#224; l&#8217;issue de cette &#233;tape sont &#233;limin&#233;s. Ce &#8220;filtrage&#8221; n&#8217;est pas d&#251; au hasard : chaque reprise
d&#8217;un syntagme s&#8217;effectue syst&#233;matiquement au d&#233;but de celui-ci (d&#233;terminants et pr&#233;positions
toujours repris). Il est donc justifi&#233; de ne pas tenir compte de ces amorces de syntagmes. Le fait
de conserver les diff&#233;rentes s&#233;quences &#224; l&#8217;issue de l&#8217;&#233;tiquetage grammatical permet de d&#233;l&#233;guer
aux niveaux sup&#233;rieurs de l&#8217;analyse le traitement correct de certaines structures particuli&#232;res
comme un des h&#244;tels, qu&#8217;il faudrait comprendre comme un h&#244;tel parmi plusieurs 5.
R&#233;p&#233;titions et corrections non marqu&#233;es portant sur des segments Leur traitement s&#8217;effec-
tue en deux &#233;tapes. L&#8217;analyseur s&#233;mantique se contente d&#8217;identifier les relations s&#233;mantiques
entre les segments en pr&#233;sence. La grammaire de liens utilis&#233;e permet d&#8217;exprimer le ph&#233;nom&#232;ne
d&#8217;entassement paradigmatique au moyen d&#8217;un op&#233;rateur sp&#233;cifique. Par exemple, le segment
une chambre peut &#234;tre reli&#233; avec plusieurs &#233;l&#233;ments selon la relation TypeBain-chambre6. Lors-
qu&#8217;un &#233;l&#233;ment est reli&#233; &#224; plusieurs autres selon la m&#234;me relation, il s&#8217;agit d&#8217;une r&#233;p&#233;tition, d&#8217;une
correction ou d&#8217;une &#233;num&#233;ration. Cette ambigu&#239;t&#233; peut &#234;tre lev&#233;e lors du parcours du graphe :
</p>
<p>&#0; Si les triplets &#5; &#0;&#1;&#6; &#2;&#6;&#3; &#8; des deux &#233;l&#233;ments sont &#233;quivalents, une r&#233;p&#233;tition est iden-
tifi&#233;e. Dans le cas d&#8217;un enrichissement lexical, le parcours du graphe permet la fusion des
propri&#233;t&#233;s des deux &#233;l&#233;ments si elles sont Et-compatibles.
</p>
<p>&#0; Si les relations en jeu ne sont pas Et-compatibles, une correction est identifi&#233;e. L&#8217;ordre
des segments intervient alors : seul le second est conserv&#233;.
</p>
<p>Ce traitement se fonde ainsi &#224; la fois sur les informations extraites par l&#8217;&#233;tape syntaxique et sur
des connaissances li&#233;es &#224; l&#8217;application. Lorsqu&#8217;il n&#8217;est pas possible, l&#8217;ambigu&#239;t&#233; est conserv&#233;e
dans la rep&#233;sentation s&#233;mantique pour &#234;tre lev&#233;e le cas &#233;ch&#233;ant par l&#8217;interpr&#233;tation contextuelle.
</p>
<p>R&#233;p&#233;titions et corrections marqu&#233;es portant sur des segments Le m&#234;me m&#233;canisme est
utilis&#233;. Toutefois, leur traitement est facilit&#233; par l&#8217;exploitation, d&#232;s la construction des liens, des
marques des h&#233;sitations et des corrections. Celles-ci sont en effet trait&#233;es de la m&#234;me mani&#232;re
que les coordinations. Pour que des liens soient b&#226;tis, il faut que les relations en jeu soient
compatibles selon ces diff&#233;rentes marques : non, euh, etc. Elles permettent par ailleurs une
restriction des analyses possibles et l&#8217;instanciation plus ais&#233;e du ph&#233;nom&#232;ne concern&#233;7.
</p>
<p>4 &#201;valuation
Une premi&#232;re version du syst&#232;me ROMUS a &#233;t&#233; &#233;valu&#233;e lors de la campagne d&#8217;&#233;valuation &#8220;par
d&#233;fi&#8221;, du groupe de travail 5.1 &#8220;compr&#233;hension robuste&#8221; du GDR I3 du CNRS8. Le but essentiel
</p>
<p>5Dans ce cas, le mot un est &#233;tiquet&#233; soit comme article soit comme adjectif num&#233;ral. Les qualificatifs associ&#233;s
&#224; ce genre de structure (parmi ..., dont vous ..., etc.) permettent entre autre le classement prioritaire des analyses
construites &#224; partir de la seconde hypoth&#232;se.
</p>
<p>6C&#8217;est ce m&#234;me m&#233;canisme qui permet &#233;galement d&#8217;exprimer les objets de requ&#234;tes multiples. La compr&#233;hen-
sion de ce type de requ&#234;tes &#233;tant rarement int&#233;gr&#233;e dans les syst&#232;mes de compr&#233;hension actuels.
</p>
<p>7La marque euh ne suffit toutefois pas seule &#224; lever l&#8217;ambigu&#239;t&#233; entre &#233;um&#233;ration et correction.
8GDR-PRC-I3, P&#244;le Parole, G.T. 5.1., http://www.univ-ubs.fr/valoria/antoine/Gt51/Eval_defi.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>J&#233;r&#244;me Goulian, Jean-Yves Antoine, Franck Poirier
</p>
<p>de cette campagne d&#8217;&#233;valuation est de pouvoir porter un diagnostic sur les syst&#232;mes des dif-
f&#233;rents participants en regard des approches adopt&#233;es ; l&#8217;&#233;valuation se veut donc essentiellement
qualitative mais reste n&#233;anmoins objective (Antoine et al., 2002). Chaque syst&#232;me a &#233;t&#233; &#233;valu&#233;
sur un ensemble de 1200 &#233;nonc&#233;s, int&#233;grant des ph&#233;nom&#232;nes linguistiques difficiles &#224; traiter.
La comparaison directe des r&#233;sultats entre les diff&#233;rents syst&#232;mes participants n&#8217;est toutefois
pas ais&#233;e ; chacun des syst&#232;mes adressant un domaine d&#8217;application diff&#233;rent9. La version de
ROMUS test&#233;e a obtenu un taux global d&#8217;erreur de 15%. L&#8217;analyse des sources d&#8217;erreurs permet
de dresser un premier bilan des limitations et avantages de l&#8217;approche adopt&#233;e.
</p>
<p>&#0; Avec 20% des erreurs constat&#233;es, le syst&#232;me a &#233;t&#233; tr&#232;s sensible aux erreurs de reconnais-
sance simul&#233;es, notamment dans les cas de substitution ou de suppression d&#8217;une pr&#233;posi-
tion. Dans 75% des cas ces perturbations sont intervenues &#224; l&#8217;int&#233;rieur d&#8217;un chunk, cas-
sant ainsi sa r&#233;gularit&#233;10 sans que celui-ci soit enti&#232;rement repris dans le reste de l&#8217;&#233;nonc&#233;
comme c&#8217;est le cas g&#233;n&#233;ralement lors de perturbations dues au locuteur. En dehors de ces
cas, la segmentation syntaxique est rarement &#224; l&#8217;origine des erreurs observ&#233;es.
</p>
<p>&#0; Le syst&#232;me a &#233;t&#233; particuli&#232;rement robuste face aux ph&#233;nom&#232;nes de mouvement des con-
stituants et aux structures complexes (requ&#234;tes multiples, extractions, etc.) avec moins de
5% d&#8217;erreurs sur chacun de ces ph&#233;nom&#232;nes.
</p>
<p>&#0; Les r&#233;sultats sont enfin prometteurs en ce qui concerne la tol&#233;rance face aux inattendus
structuraux. 8% des &#233;nonc&#233;s qui en contenaient (sur 525) ont &#233;t&#233; mal compris. Ces er-
reurs, proviennent majoritairement d&#8217;erreurs dans l&#8217;&#233;tiquetage grammatical des mots de
l&#8217;&#233;nonc&#233;. La version du syst&#232;me test&#233;e reposait sur un &#233;tiqueteur priviligiant la d&#233;ci-
sion, les r&#233;p&#233;titions et surtout les faux-d&#233;parts ont entra&#238;n&#233; des erreurs d&#8217;&#233;tiquetage tr&#232;s
p&#233;nalisantes. Les r&#232;gles de d&#233;sambigu&#239;sation actuellement utilis&#233;es sont plus souples.
</p>
<p>R&#233;f&#233;rences
ABNEY S. (1991). Parsing by chunks. In Principle Based Parsing. In R.Berwick, S.Abney and C.Tenny,
Eds., Kluwer Academic Publishers.
ANTOINE J.-Y. et al. (2002). Predictive and objective evaluation of speech understanding: the challenge
evaluation campaign of the i3 speech workgroup of the french cnrs. In LREC&#8217;02. &#224; para&#238;tre.
BEAR J., DOWDING J. &amp; SHRIBERG E. (1992). Integrating multiple knowledge sources for detection
and correction of repairs in human-computer dialogue. In ACL&#8217;92, p. 56&#8211;63.
BLANCHE-BENVENISTE C. (1990). Le fran&#231;ais parl&#233; ; &#233;tudes grammaticales. CNRS Editions, Paris.
EJERHED E. (1993). Nouveaux courants en analyse syntaxique. T.A.L., 34.1, 61&#8211;82.
HEEMAN P. &amp; ALLEN J. (1999). Speech repairs, intentional phrases and discourse markers : modeling
speakers&#8217; utterances in spoken dialogue. In Computational Linguistics, 25(4), p. 527&#8211;573.
HINDLE D. (1983). Deterministic parsing of syntactic nonfluencies. In 21st Annual Meeting of the
Association for Computational Linguistics, ACL&#8217;83, p. 123&#8211;128.
HIRSCHMAN L. (1998). Language understanding evaluation: lessons learned from muc and atis. In
Actes de LREC&#8217;98, Grenade, Espagne, p. 117&#8211;122.
ROCHE E. &amp; SCHABES Y. (1997). Finite state Language Processing, chapter Deterministic Part-of-
Speech Tagging with Finite State Transducers, p. 205&#8211;239. MIT Press.
SLEATOR D. &amp; TEMPERLEY D. (1991). Parsing English with a Link Grammar. Rapport interne,
CMU-CS-91-196, CMU, USA.
</p>
<p>9Pour une comparaison plus directe, nous envisageons d&#8217;utiliser la m&#233;thodologie DCR.
10Les m&#233;thodes stochastiques &#8211;rep&#233;rage de segments conceptuels&#8211; connaissent les m&#234;mes probl&#232;mes.</p>

</div></div>
</body></html>