<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Groupes pr&#233;positionnels arguments ou circonstants : vers un rep&#233;rage automatique en corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27 juin 2002
</p>
<p>Groupes pr&#233;positionnels arguments ou circonstants : vers un
rep&#233;rage automatique en corpus
</p>
<p>C&#233;cile Fabre et C&#233;cile Fr&#233;rot
</p>
<p>ERSS, UMR 5610, Universit&#233; Toulouse-Le Mirail
cfabre@univ-tlse2.fr, cessfrerot@aol.com
</p>
<p>R&#233;sum&#233; &#8211; Abstract
Dans cette &#233;tude, men&#233;e dans le cadre de la r&#233;alisation d&#8217;un analyseur syntaxique de corpus
sp&#233;cialis&#233;s, nous nous int&#233;ressons &#224; la question des arguments et circonstants et &#224; leur
rep&#233;rage automatique en corpus. Nous proposons une mesure simple pour distinguer
automatiquement, au sein des groupes pr&#233;positionnels rattach&#233;s au verbe, des types de
compl&#233;ments diff&#233;rents. Nous r&#233;alisons cette distinction sur corpus, en mettant en oeuvre une
strat&#233;gie endog&#232;ne, et en utilisant deux mesures de productivit&#233; : la productivit&#233; du recteur
verbal vis &#224; vis de la pr&#233;position &#233;value le degr&#233; de coh&#233;sion entre le verbe et son groupe
pr&#233;positionnel (GP), tandis que la productivit&#233; du r&#233;gi vis &#224; vis de la pr&#233;position permet
d'&#233;valuer le degr&#233; de coh&#233;sion interne du GP. Cet article pr&#233;sente ces deux mesures,
commente les donn&#233;es obtenues, et d&#233;termine dans quelle mesure cette partition recouvre la
distinction traditionnelle entre arguments et circonstants.
</p>
<p>This paper addresses the issue of the automatic distinction between arguments and adjuncts
within the framework of a corpus-based parser. We propose a simple measure aimed at
distinguishing automatically different types of complements among prepositional phrases
(PP) attached to the verb. This corpus-based approach relies on an endogeneous technique as
well as two measures of productivity. The productivity of a governor and its preposition
determines the degree of cohesion between a verb and its PP. Conversely, the productivity of
a governee assesses the degree of autonomy of a PP. After presenting both measures, we
comment on the output data and determine whether this division characterises the traditional
distinction between arguments and adjuncts.
</p>
<p>Mots Cl&#233;s &#8211; Keywords
analyse syntaxique automatique, analyse endog&#232;ne, productivit&#233;, argument, circonstant
</p>
<p>automatic parsing, endogeneous analysis, productivity, argument, adjunct</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fabre, C&#233;cile Fr&#233;rot
</p>
<p>1&#1; Objectif
Dans le domaine de l'analyse syntaxique automatique, les syst&#232;mes &#233;lucident &#224; des degr&#233;s tr&#232;s
divers la structure relationnelle des phrases d'un texte. Entre l'analyse syntaxique superficielle,
qui effectue un simple parenth&#233;sage des composants maximaux, et l'analyse compl&#232;te qui vise
&#224; construire l'arbre syntaxique de la phrase, il est possible d'aller plus ou moins loin dans la
r&#233;solution des liens syntaxiques, en fonction des informations que l'on souhaite acqu&#233;rir pour
une application donn&#233;e : relations de d&#233;pendance binaire pour l'analyse distributionnelle et la
structuration de terminologie (Nazarenko et al., 2001) (Bourigault, Lame, 2002), cadres de
sous-cat&#233;gorisation pour la constitution de lexiques (Federici et al., 1998) (Briscoe, Carroll,
1997), etc.
Notre cadre de travail est la construction d'un outil d'analyse syntaxique de corpus, Syntex
(Bourigault, Fabre, 2000). Dans ce contexte, nous nous int&#233;ressons ici &#224; la question du
rattachement pr&#233;positionnel, et cherchons &#224; d&#233;terminer une strat&#233;gie qui permette d'aller au-
del&#224; de la d&#233;cision simple de rattachement (&#224; quel recteur se rattache une pr&#233;position) pour
rendre possible une typologie des compl&#233;ments. En l'&#233;tat, l'analyseur d&#233;termine &#224; quelle t&#234;te
se rattache un groupe pr&#233;positionnel. On constate alors que les GP ainsi rattach&#233;s ont des
statuts tr&#232;s divers et manifestent au moins deux grands types de d&#233;pendance lexicale avec leur
recteur, lorsque celui-ci est un verbe (Fabre, Bourigault, 2001). Le r&#233;gi peut &#234;tre de nature
argumentale (ressembler &#224; un crat&#232;re) ou circonstancielle (&#1;&#2;&#3;&#4;&#5;&#6;&#5;&#7;&#8;&#6;&#9;&#10; &#1;&#5;&#11;&#3;&#10; &#12;&#9;&#10; &#13;&#14;&#15;&#16;&#16;&#6;&#9;).
Rappelons, avant de d&#233;velopper ce point en 2.1, que la distinction entre arguments et
circonstants oppose des compl&#233;ments essentiels &#233;troitement li&#233;s au verbe du point de vue
syntaxique et s&#233;mantique, et des compl&#233;ments satellites caract&#233;risant secondairement les
circonstances du proc&#232;s d&#233;crit par le verbe (Miller, 1997).
Nous faisons l'hypoth&#232;se que ces deux types de relations doivent &#234;tre pris en compte pour
contribuer conjointement &#224; la t&#226;che de construction de classes s&#233;mantiques : les mots peuvent
en effet &#234;tre regroup&#233;s parce qu'ils partagent des arguments ou sont arguments des m&#234;mes
unit&#233;s, mais des relations non argumentales permettent &#233;galement de mettre au jour des
ensembles homog&#232;nes de mots. Par exemple, dans notre corpus de g&#233;omorphologie1, les mots
(lemmes) nappe, rigole, film qui entretiennent tous les trois une relation circonstancielle de
mani&#232;re avec le verbe ruisseler (ruisseler en nappe, ~ rigole, ~ film) pr&#233;sentent une affinit&#233;
s&#233;mantique. De m&#234;me les mots bassin, gouffre, lac, puits, qui entretiennent avec le verbe
dispara&#238;tre une relation de type locatif (dispara&#238;tre dans un bassin, ~ un gouffre, ~ un lac, ~
un puits). Par ailleurs, l'identification des relations circonstancielles qui structurent un texte
(relations d'ordre locatif par exemple, dans notre corpus, comme on va le voir) fournit des
indications pr&#233;cieuses sur le contenu du texte. Loin de n&#233;gliger ce type de compl&#233;mentation,
nous cherchons donc &#224; l'identifier au m&#234;me titre que la relation argumentale, tout en les
distinguant dans la mesure o&#249; leur contribution s&#233;mantique est tr&#232;s diff&#233;rente. Ces deux types
de relation ne peuvent donc pas &#234;tre simplement combin&#233;s, cumul&#233;s. L'apport s&#233;mantique de
chacun doit &#234;tre distingu&#233;. Est-il possible d'op&#233;rer cette distinction de mani&#232;re endog&#232;ne
(Bourigault, 1994), c&#8217;est-&#224;-dire gr&#226;ce aux seules informations acquises au sein du corpus
analys&#233; ?
</p>
<p>                                                
</p>
<p>1
 Les exemples pr&#233;sent&#233;s dans cet article sont tir&#233;s d'un corpus de g&#233;omorphologie. Nous remercions
</p>
<p>vivement Dani&#232;le Candel, de l'Institut National de la Langue Fran&#231;aise, d'avoir mis &#224; la disposition de
l'&#233;quipe ce corpus, extrait de la base SCITECH.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Groupes pr&#233;positionnels arguments ou circonstants : vers un rep&#233;rage automatique en corpus
</p>
<p>2&#1; Distinction argument - circonstant. Etat de l'art
L&#8217;opposition argument-circonstant, traditionnelle en linguistique, s&#8217;av&#232;re &#233;galement cruciale
en TAL : la description de la structure argumentale des verbes est une dimension majeure de
l&#8217;activit&#233; de construction de ressources lexicales, car elle guide l&#8217;analyse syntaxique, et
permet en particulier d'identifier les relations actancielles qui structurent un texte, donn&#233;es
fondamentales pour les syst&#232;mes d'extraction d'information. Les recherches s&#8217;orientent vers
l&#8217;acquisition automatique de ces informations &#224; partir de textes, dans la mesure o&#249; la forte
variabilit&#233; des cadres de sous-cat&#233;gorisation d&#8217;un type de texte &#224; l&#8217;autre rend inefficace le
recours &#224; des ressources lexicales g&#233;n&#233;rales (Basili et al., 1997). Nous faisons le point sur les
crit&#232;res d&#233;finis jusqu&#8217;&#224; pr&#233;sent pour distinguer ces deux types de compl&#233;ments.
</p>
<p>2.1&#1; Crit&#232;res linguistiques
</p>
<p>La distinction argument-circonstant est classique et a &#233;t&#233; abondamment &#233;tudi&#233;e. Elle appara&#238;t,
sous divers vocables (compl&#233;ments de verbe, essentiels, r&#233;gis, sous-cat&#233;goris&#233;s vs modifieurs,
ajouts, satellites, etc.), dans la plupart des th&#233;ories linguistiques. Pour (Borillo, 1990), il s&#8217;agit
d&#8217;&#233;tablir une distinction entre  &#171; les compl&#233;ments qui s&#8217;attachent [au verbe] dans des
combinaisons bien r&#233;gl&#233;es &#187; et font partie de son &#171; sch&#233;ma de construction &#187;, et celles &#171; qui
apparaissent dans son environnement mais qui ne d&#233;pendent pas directement de ses propri&#233;t&#233;s
structurelles &#187;. (Miller, 1997) oppose selon le m&#234;me principe des compl&#233;ments r&#233;gis par le
verbe, dont les &#171; propri&#233;t&#233;s sont r&#233;gies de fa&#231;on &#233;troite par celui-ci &#187;, et des circonstants, dont
&#171; le statut est ind&#233;pendant de celui du verbe &#187;. Les synth&#232;ses, particuli&#232;rement claires, de
(Miller, 1997) et (Bonami, 1999) rappellent la diversit&#233; des crit&#232;res linguistiques mis en
&#339;uvre pour cerner cette opposition : obligatorit&#233; syntaxique et s&#233;mantique, d&#233;placement en
t&#234;te de phrase, it&#233;rabilit&#233;, passivation, topicalisation, degr&#233; de s&#233;lection par le verbe, etc. La
plupart de ces crit&#232;res sont difficiles &#224; int&#233;grer dans une proc&#233;dure automatique, dans la
mesure o&#249; ils mettent en jeu des jugements s&#233;mantiques et de grammaticalit&#233;. Parmi ces
crit&#232;res cependant, trois nous semblent facilement testables en corpus :
</p>
<p>- le caract&#232;re obligatoire ou facultatif  (Il consiste {en une recristallisation| *&#8709; } vs Il se
d&#233;double {sur la zone |&#8709;}).
- la d&#233;termination exerc&#233;e par le verbe &#224; l&#8217;&#233;gard de la pr&#233;position : le verbe contraint
fortement la pr&#233;position de son argument (Il consiste {en|*&#8709;|*&#224;|*sur) une recristallisation), il
contraint faiblement celle de son circonstant (Il se d&#233;double {sur|dans|sous|pr&#232;s de|autour
de} la zone).
</p>
<p>- le d&#233;placement du GP en t&#234;te de phrase : *En une recristallisation, il consiste vs Pr&#232;s de la
zone, il se d&#233;double.
</p>
<p>Les deux auteurs s&#8217;accordent cependant sur l&#8217;absence de crit&#232;re universel permettant
d&#8217;opposer ces deux types de compl&#233;ments, ainsi que sur les r&#233;sultats contradictoires de
certains crit&#232;res. Pour Miller, on peut tout au plus d&#233;finir une classe d&#8217;arguments et de
circonstants prototypiques, qui sont respectivement les objets directs et les compl&#233;ments
locatifs ou temporels.
</p>
<p>Nous sommes donc confront&#233;es &#224; une notion essentielle sur le plan linguistique, mais qui
repose sur une caract&#233;risation floue, mal assur&#233;e, sugg&#233;rant plut&#244;t un continuum qu&#8217;une</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fabre, C&#233;cile Fr&#233;rot
</p>
<p>rupture franche entre les deux types de compl&#233;ments. A l&#8217;inverse, les options prises en TAL
cherchent &#224; maintenir, comme on va le voir, l&#8217;hypoth&#232;se d&#8217;une opposition binaire.
</p>
<p>2.2&#1; Crit&#232;res automatiques
</p>
<p>Les recherches orient&#233;es vers l'acquisition de ressources lexicales visent &#224; identifier dans les
textes les arguments des verbes de mani&#232;re &#224; les int&#233;grer dans des dictionnaires et &#224; alimenter
des analyseurs (Manning, 1993) (Meyers et al., 1994) (Briscoe, Carroll, 1997). Peu de travaux
mettent sp&#233;cifiquement l&#8217;accent sur la distinction entre arguments et circonstants, qui reste
bien souvent implicite. Ceux qui mentionnent n&#233;anmoins ce probl&#232;me sont bas&#233;s sur deux
types de techniques : le partage entre les deux types de compl&#233;ments est r&#233;alis&#233; &#224; partir de
corpus annot&#233;s syntaxiquement &#8211; typiquement, le Penn Treebank (Buchholz, 1998). En
l&#8217;absence de donn&#233;es d&#8217;apprentissage, c&#8217;est la fr&#233;quence de l&#8217;association entre le verbe et son
compl&#233;ment qui est propos&#233;e comme crit&#232;re (Brent, 1993) ou la pr&#233;sence c&#244;te &#224; c&#244;te du verbe
et de son compl&#233;ment (Federici et al., 1998). Consid&#233;rons tout d&#8217;abord le crit&#232;re de la
fr&#233;quence : (Basili et al., 1999) estiment &#224; l'inverse de Brent que cette distinction ne peut pas
&#234;tre r&#233;alis&#233;e de mani&#232;re automatique, dans la mesure o&#249; les compl&#233;ments adjoints contribuent
au m&#234;me titre que les arguments &#224; la s&#233;mantique du verbe et lui sont associ&#233;s avec la m&#234;me
r&#233;gularit&#233; (&#171; usually accidental (i.e. not argumental), though frequently observed with some
verb &#187;, (Basili et al., 1997)). Les observations faites sur notre corpus vont dans ce sens : s&#8217;il
est vrai que les fr&#233;quences hautes correspondent &#224; des liens argumentaux, on constate que les
fr&#233;quences moyennes (entre 3 et 10 occurrences) m&#234;lent indistinctement arguments et
circonstants. Le deuxi&#232;me crit&#232;re, celui de l&#8217;apparition c&#244;te &#224; c&#244;te du verbe et de son
compl&#233;ment, correspond au crit&#232;re exploit&#233; par notre analyseur pour d&#233;terminer les contextes
d&#8217;acquisition d&#8217;une relation syntaxique : les contextes ambigus (ex : creuse des gorges dans
la lave), qui offrent plusieurs recteurs possibles pour une pr&#233;position, sont r&#233;solus &#224; partir de
l&#8217;observation de contextes non ambigus (ex : creus&#233; dans la lave). N&#233;anmoins, on s&#8217;aper&#231;oit
que l&#8217;apparition du compl&#233;ment dans le voisinage imm&#233;diat du verbe est un indice fiable pour
d&#233;terminer son rattachement &#224; celui-ci, mais pas pour d&#233;terminer la nature de ce compl&#233;ment,
puisque les circonstants peuvent &#233;galement figurer dans cette position. Nous proposons donc
de nous appuyer plus nettement sur la caract&#233;risation linguistique de ces deux types de
compl&#233;ments de mani&#232;re &#224; d&#233;finir une nouvelle m&#233;thode pour les distinguer en corpus.
</p>
<p>3&#1; Distinguer automatiquement arguments et circonstants
En l&#8217;absence d&#8217;informations sur la valence du verbe (dictionnaire ou corpus annot&#233;), nous
cherchons des moyens d&#8217;&#233;prouver le degr&#233; de coh&#233;sion syntaxique et s&#233;mantique entre le
verbe et son compl&#233;ment : les crit&#232;res linguistiques propos&#233;s (capacit&#233; du circonstant &#224;
s&#8217;effacer, se d&#233;placer) visent en effet &#224; tester l&#8217;autonomie vs la d&#233;pendance du GP vis &#224; vis du
verbe. Les circonstants manifestent une certaine ind&#233;pendance par rapport au verbe, dans la
mesure o&#249; ni leur position ni leur interpr&#233;tation n&#8217;est conditionn&#233;e par lui. A l&#8217;inverse, les
arguments sont contraints formellement et s&#233;mantiquement par le verbe (Miller, 1997). Nous
allons voir que le corpus offre un espace au sein duquel la coh&#233;sion du GP peut &#234;tre mesur&#233;e
selon des crit&#232;res nouveaux.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Groupes pr&#233;positionnels arguments ou circonstants : vers un rep&#233;rage automatique en corpus
</p>
<p>3.1&#1; La productivit&#233; comme mesure de coh&#233;sion du GP
</p>
<p>Le rattachement automatique des groupes pr&#233;positionnels est effectu&#233; dans notre analyseur de
mani&#232;re endog&#232;ne, sur la base d&#8217;indices recueillis &#224; partir des contextes non ambigus du
corpus. Parmi ces indices, une mesure permet d&#8217;&#233;valuer le degr&#233; de coh&#233;sion du GP avec son
recteur : la productivit&#233; du couple recteur-pr&#233;position (d&#233;sormais prodRecteur). Une
prodRecteur &#233;lev&#233;e est l'indice que le recteur se construit r&#233;guli&#232;rement avec la pr&#233;position,
dans la mesure o&#249; les mots r&#233;gis par cette relation sont diversifi&#233;s. Par exemple, le couple
(alterner, avec) est productif, avec une prodRecteur de 7, parce qu&#8217;il gouverne sept r&#233;gis
diff&#233;rents : alterner avec+d&#233;t (cendre|crue|lit|masse|p&#233;riode|section|surface).
Jusqu&#8217;&#224; pr&#233;sent, nous avons utilis&#233; cette mesure pour d&#233;terminer &#224; quel recteur candidat se
rattache une pr&#233;position (Bourigault, Fabre, 2001). Si deux recteurs potentiels figurent dans la
zone de rection du verbe, l&#8217;analyseur choisit prioritairement (en combinaison avec d&#8217;autres
indices) celui dont la productivit&#233; avec la pr&#233;position est la plus forte. Nous proposons ici
d&#8217;utiliser cette mesure en la combinant &#224; une seconde mesure de productivit&#233; : la productivit&#233;
des couples pr&#233;position-r&#233;gi (d&#233;sormais prodR&#233;gi). Cette fois, le r&#233;gi est dit productif pour
une pr&#233;position donn&#233;e si le couple pr&#233;p-r&#233;gi est gouvern&#233; par une diversit&#233; de recteurs. Par
exemple, le couple  (&#224;+d&#233;t, quaternaire) est productif avec prodR&#233;gi = 3 parce qu&#8217;il est
gouvern&#233; par 3 verbes diff&#233;rents dans le corpus : (englacer|&#233;voluer|subir) au quaternaire.
L'exp&#233;rience que nous pr&#233;sentons est simple : elle consiste &#224; extraire automatiquement du
corpus l'ensemble des triplets recteur-relation pr&#233;positionnelle-r&#233;gi tels que le recteur est une
forme verbale (infinitif, participe, forme conjugu&#233;e), la relation pr&#233;positionnelle est une
s&#233;quence pr&#233;position + d&#233;t (d&#233;t pouvant &#234;tre vide), et le r&#233;gi est un nom ou un infinitif. Ces
triplets sont extraits de contextes non ambigus (c'est-&#224;-dire, sans ambigu&#239;t&#233; de rattachement)
dans lesquels la pr&#233;position est contigu&#235; au verbe (modulo un adverbe). Le r&#233;gi est alors la
premi&#232;re forme nominale ou infinitive que l'on trouve &#224; droite de la pr&#233;position. Ainsi, nous
extrayons de la phrase H Baulig insista sur le fixisme tectonique de vastes r&#233;gions &#224; des
&#233;poques r&#233;centes le triplet (insister, sur_le, fixisme). Les deux mesures de productivit&#233;
doivent nous permettre dans un deuxi&#232;me temps de r&#233;partir ces GP en deux groupes : les GP
pr&#233;sentant une coh&#233;sion forte avec le verbe, les GP pr&#233;sentant une coh&#233;sion forte en interne.
Cette r&#233;partition recoupe-t-elle la distinction argument-circonstant ?
</p>
<p>3.2&#1; Premiers r&#233;sultats
</p>
<p>Nous livrons ici un extrait des donn&#233;es brutes correspondant aux couples recteur-pr&#233;p et
pr&#233;p-r&#233;gi les plus productifs. Nous commentons ces premi&#232;res donn&#233;es avant d'&#233;tablir et
d'&#233;valuer une proc&#233;dure de calcul (3.3) qui vise &#224; d&#233;terminer automatiquement la nature
argumentale ou circonstancielle de la relation pr&#233;positionnelle.
</p>
<p>&#8226; Productivit&#233; forte du recteur
</p>
<p>Les couples suivants, num&#233;rot&#233;s de 1 &#224; 20, correspondent aux recteurs les plus productifs pour
une relation pr&#233;positionnelle donn&#233;e (valeur de ProdRecteur entre 15 et 163) :
</p>
<p> devoir &#224;+d&#233;t (1), expliquer par+d&#233;t (2), traduire par+d&#233;t (3), tendre &#224;+vinf (4),
correspondre &#224;+d&#233;t (5), caract&#233;riser par+d&#233;t (6), s&#233;parer par+d&#233;t (7),
reposer sur+d&#233;t (8), transformer en+d&#233;t (9), r&#233;duire &#224;+d&#233;t (10), trouver dans+d&#233;t
(11), aboutir &#224;+d&#233;t (12), donner &#224;+d&#233;t (13), appliquer &#224;+d&#233;t (14), renseigner sur+d&#233;t</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fabre, C&#233;cile Fr&#233;rot
</p>
<p>(15), attribuer &#224;+d&#233;t (16), continuer &#224;+vinf (17), commencer &#224;+vinf (18),
passer &#224;+d&#233;t (19), finir par+vinf (20)
</p>
<p>Si l'on s&#233;lectionne &#224; pr&#233;sent au hasard vingt couples correspondant &#224; une valeur plus modeste
de ProdRecteur (valeur 4 ou 5), on obtient la liste suivante :
</p>
<p>collaborer avec+d&#233;t (21), co&#239;ncider avec+d&#233;t (22), causer par+d&#233;t (23),
atteindre par+d&#233;t (24), affleurer sur+d&#233;t (25), obliger &#224;+vinf (26), destiner &#224;+vinf
(27), varier selon+d&#233;t (28), transporter par+vinf (29), tomber &#224;+d&#233;t (30),
tendre &#224;+d&#233;t (31), suivre par+d&#233;t (32), subdiviser en+d&#233;t (33), situer sous+d&#233;t (34),
retrouver sur+d&#233;t (35), renoncer &#224;+d&#233;t (36), r&#233;aliser par+d&#233;t (37), proc&#233;der par (38),
pr&#233;parer par+d&#233;t (39), prendre pour (40)
</p>
<p>Ces r&#233;sultats appellent plusieurs commentaires. Notons tout d&#8217;abord que la forme lemmatis&#233;e
annule la distinction forme conjugu&#233;e vs participe pass&#233;. Ainsi, les lemmes devoir, suivre,
r&#233;aliser, renvoient en fait &#224; des formes participiales (d&#251; &#224;, suivi par, r&#233;alis&#233; par). A la lecture
de ces deux listes, on constate qu&#8217;une proportion importante de ces couples expriment
effectivement une relation de nature argumentale :
</p>
<p>- 22 couples2 sont mentionn&#233;s dans le Tr&#233;sor de la Langue Fran&#231;aise comme construction du
verbe correspondant,
</p>
<p>- 11 autres couples nous semblent relever &#233;galement d&#8217;un rapport argumental (expliquer
par+d&#233;t, traduire par+d&#233;t, caract&#233;riser par+d&#233;t, s&#233;parer par+d&#233;t, renseigner sur+d&#233;t,
passer &#224; + d&#233;t, affleurer sur, varier selon, situer sous, retrouver sur+d&#233;t, proc&#233;der par). 3
d&#8217;entre eux apportent des indications locatives &#224; des proc&#232;s de type locatif,
</p>
<p>- 6 couples renvoient &#224; une relation agentive (compl&#233;ment en par d&#8217;une forme passive :
atteindre par, causer par+d&#233;t, transporter par+vinf, suivre par+d&#233;t, r&#233;aliser par+d&#233;t,
pr&#233;parer par+d&#233;t).
Au final, il reste donc seulement un couple dans cette liste dont le caract&#232;re coh&#233;sif est
douteux, ou en tout cas moins facilement interpr&#233;table : tomber &#224;+d&#233;t
(centim&#232;tre|dessous|valeur|vitesse). M&#234;me dans ce cas, l'observation des contextes nous fait
cependant pencher vers une lecture plut&#244;t argumentale (cette valeur tombe &#224; quelques
centim&#232;tres, on tombe d&#233;j&#224; &#224; des valeurs plus faibles).
A ce stade, nous n&#8217;avons pas encore les moyens de caract&#233;riser la relation ternaire entre un
verbe, une pr&#233;position et la t&#234;te du GP. La mesure prodRecteur nous permet donc seulement
de d&#233;terminer globalement une relation verbe + pr&#233;p, sachant qu&#8217;en r&#233;alit&#233; cette relation peut
&#234;tre h&#233;t&#233;rog&#232;ne. Ainsi, si la relation aboutir &#224;+d&#233;t X renvoie &#224; une relation argumentale pour
17 des 18 valeurs de X dans le corpus, on trouve une relation circonstancielle avec aboutir &#224;
leur tour. Le couple verbe-pr&#233;p ne suffit pas toujours &#224; caract&#233;riser la nature de la relation. La
mesure est donc encore insuffisante pour lever l&#8217;ambigu&#239;t&#233;.
</p>
<p>                                                
</p>
<p>2
 Couples 1, 4-5, 8-14, 16-18, 20-22, 26-27, 31, 33, 36 et 40.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Groupes pr&#233;positionnels arguments ou circonstants : vers un rep&#233;rage automatique en corpus
</p>
<p>&#8226; Productivit&#233; forte du r&#233;gi
</p>
<p>Nous nous int&#233;ressons &#224; pr&#233;sent au cas des GP rattach&#233;s &#224; une diversit&#233; de verbes (au
moins 3). Nous devrions avoir affaire &#224; des unit&#233;s peu coh&#233;sives avec les verbes qu&#8217;elles
modifient, et pr&#233;sentant une certaine autonomie s&#233;mantique. Voici la liste des vingt-cinq
premiers couples pr&#233;p-r&#233;gi extraits par cette m&#233;thode :
</p>
<p>dans la roche, par l'&#233;rosion, dans la r&#233;gion, par l'eau, dans la zone, &#224; la surface, sur
la pente, sous la forme, sur le fond, par l'action, au dessous, vers l'aval, sur le versant,
par l'&#233;rosion, &#224; l'&#233;poque, dans le cas, dans la vall&#233;e, par le courant, au sommet, dans
le sens, au niveau, &#224; l'&#233;rosion, au contraire, sous le climat, sous l'action
</p>
<p>La coh&#233;sion interne de ces groupes est tout d&#8217;abord attest&#233;e par la pr&#233;sence de locutions
adverbiales (au contraire) et pr&#233;positionnelles (dans le cas, dans le sens, au niveau, sous la
forme). Certaines s&#233;quences s'apparentent &#224; des locutions sans relever tout &#224; fait de cette
cat&#233;gorie. Ainsi, le groupe &#224; la surface (c&#8217;est vrai aussi des s&#233;quences au sommet, sur le fond)
fonctionne dans le corpus &#224; la fois seul - remonter &#224; la surface, arriver ~, accumuler ~, et
comme introducteur de groupe nominal - &#224; la surface de la terre, ~ de la glace. En dehors de
ces cas, cette liste regroupe des s&#233;quences qui peuvent fonctionner comme circonstants, et
expriment massivement une information de type spatial (dans la roche, sous le climat, sur le
versant, etc.) ou temporel (&#224; l&#8217;&#233;poque). On retrouve dans cette liste des groupes agentifs : par
l&#8217;&#233;rosion, par l&#8217;eau. Comme nous l&#8217;avons vu &#224; l&#8217;&#233;tape pr&#233;c&#233;dente pour les couples
recteur-pr&#233;p, ces s&#233;quences pr&#233;p-r&#233;gi peuvent &#233;galement appara&#238;tre dans des relations de
nature argumentale. Ainsi, le GP &#224; la surface entretient une relation circonstancielle avec 11
des 16 recteurs verbaux recens&#233;s, mais on trouve aussi les s&#233;quences s'int&#233;resser &#224; la surface,
s&#8217;attaquer &#224; la surface, etc.
Un cas reste difficilement interpr&#233;table, il s&#8217;agit de la s&#233;quence &#224; l&#8217;&#233;rosion. Il ne semble pas
autonome s&#233;mantiquement, dans la mesure o&#249;, en l&#8217;absence de recteur, il n&#8217;est pas possible de
caract&#233;riser en termes de fonction (agentive, locative, temporelle, etc.) l&#8217;indication qu&#8217;il
exprime. Observons la liste des verbes, au nombre de 10, qui gouvernent ce GP :
</p>
<p>&#17;&#18;&#1;&#9;&#6;&#19;&#10;&#1;&#9;&#20;&#14;&#2;&#6;&#19;&#10;&#9;&#21;&#4;&#14;&#3;&#9;&#6;&#19;&#10;&#16;&#14;&#15;&#6;&#11;&#2;&#6;&#19;&#10;&#2;&#22;&#22;&#15;&#11;&#2;&#3;&#9;&#6;&#19;&#10;&#14;&#16;&#16;&#6;&#2;&#6;&#19;&#10;&#4;&#9;&#6;&#22;&#9;&#8;&#8;&#6;&#9;&#19;&#10;&#4;&#6;&#18;&#3;&#9;&#11;&#8;&#9;&#6;&#19;&#10;&#6;&#18;&#3;&#2;&#3;&#8;&#9;&#6;&#19;&#10;&#3;&#14;&#15;&#22;&#9;&#8;&#8;&#6;&#9;
</p>
<p>On constate qu&#8217;il s&#8217;agit de verbes qui sous-cat&#233;gorisent un GP introduit par &#224;. On trouve
d&#8217;ailleurs, pour 5 de ces 10 verbes, une valeur prodRecteur forte avec cette pr&#233;position dans le
corpus. La valeur prodR&#233;gi ne peut donc &#234;tre utilis&#233;e ind&#233;pendamment de la valeur
prodRecteur. Nous introduisons par cons&#233;quent un test plus complet, qui croise les deux
mesures de productivit&#233; que nous venons de pr&#233;senter.
</p>
<p>3.3&#1; Croiser deux mesures de productivit&#233;
</p>
<p>Nous avons cherch&#233; &#224; affiner ce premier traitement et &#224; &#233;valuer les r&#233;sultats d&#8217;une m&#233;thode
combinant les mesures prodRecteur et prodR&#233;gi. Dans ce but, nous avons d&#233;fini une
proc&#233;dure qui d&#233;cide, pour un triplet recteur-pr&#233;p(+d&#233;t)-r&#233;gi donn&#233;, si l'on a affaire &#224; une
relation argumentale ou circonstancielle :
</p>
<p>Si, pour une pr&#233;position donn&#233;e, la productivit&#233; du recteur est forte (&gt; 2) et la productivit&#233; du
r&#233;gi est nulle, alors le groupe pr&#233;positionnel sera &#233;tiquet&#233; comme argument (fichier ARG).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fabre, C&#233;cile Fr&#233;rot
</p>
<p>Si, pour une pr&#233;position donn&#233;e, la productivit&#233; du r&#233;gi est forte (&gt; 2) et la productivit&#233; du
recteur est nulle, alors le groupe pr&#233;positionnel sera &#233;tiquet&#233; comme circonstant
(fichier CIRC).
Nous avons effectu&#233; ce calcul sur tous les triplets du fichier de d&#233;part. Les deux fichiers
r&#233;sultats sont compos&#233;s de 1365 triplets class&#233;s comme arguments et 525 triplets class&#233;s
comme circonstants. A titre d'exemple, le tableau 1 pr&#233;sente un extrait du r&#233;sultat,
correspondant aux 10 premiers verbes trouv&#233;s dans les deux s&#233;ries (par ordre alphab&#233;tique).
</p>
<p>ProdRecteur &gt; 2, prodR&#233;gi = 0 ProdR&#233;gi &gt; 2, prodRecteur = 0
aboutir &#224; l'aplanissement
accumuler dans la mouille
</p>
<p>adapter &#224; l'ondulation
affleurer sur les berges
</p>
<p>agir dans le canyon
alimenter en d&#233;bris
</p>
<p>aller jusqu'&#224; arracher
alterner avec la cendre
</p>
<p>appara&#238;tre dans le crat&#232;re
apparenter &#224; des gabros
</p>
<p>abandonner dans le sol
acc&#233;l&#233;rer sur la pente
accidenter en  g&#233;n&#233;ral
accorder dans le cas
</p>
<p>acqu&#233;rir dans la r&#233;gion
adapter dans le d&#233;tail
</p>
<p>affleurer &#224; nu
affouiller dans la roche
alimenter dans la zone
</p>
<p>allonger dans la direction
</p>
<p>Tableau 1 : &#233;chantillon des constructions verbales extraites (fichiers ARG et CIRC)
</p>
<p>3.4&#1; Evaluation
</p>
<p>Les r&#233;sultats ont &#233;t&#233; &#233;valu&#233;s par deux m&#233;thodes parall&#232;les (tableaux 2 et 3). 50 triplets ont &#233;t&#233;
s&#233;lectionn&#233;s al&#233;atoirement dans le fichier CIRC, 50 dans le fichier ARG. Les 100 triplets ainsi
retenus ont &#233;t&#233; tri&#233;s par ordre alphab&#233;tique et soumis dans leur contexte d&#8217;origine (limit&#233; &#224;
une phrase) &#224; une coll&#232;gue linguiste, qui a caract&#233;ris&#233; chaque GP comme argument ou
circonstant.
</p>
<p>fichier d&#8217;origine GP &#233;valu&#233; argument GP &#233;valu&#233; circonstant
</p>
<p>fichier ARG 88% 12%
</p>
<p>fichier CIRC 28% 72%
</p>
<p>Tableau 2 : r&#233;sultats de l&#8217;&#233;valuation manuelle
</p>
<p>Ce r&#233;sultat est corrobor&#233; par un deuxi&#232;me type d&#8217;&#233;valuation. Nous avons compar&#233; les
s&#233;quences test&#233;es avec les entr&#233;es du Tr&#233;sor de la Langue Fran&#231;aise, &#224; la recherche de la
mention du GP dans l&#8217;entr&#233;e du verbe, celle-ci pouvant figurer : i) dans une construction
verbe+prep ; ii) entre crochets ou parenth&#232;ses (la s&#233;paration est concr&#232;tement mat&#233;rialis&#233;e :
diviser (qch) en (parties&#8230;)) ; iii) dans le cas o&#249; seul l&#8217;emploi du verbe est sp&#233;cifi&#233;, au sein
d'un exemple (se d&#233;poser : emploi pronominal. Une broux de noix qui s&#8217;est d&#233;pos&#233;e dans les
plis de sa paume).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Groupes pr&#233;positionnels arguments ou circonstants : vers un rep&#233;rage automatique en corpus
</p>
<p>fichier d&#8217;origine GP d&#233;crit dans le TLF GP non d&#233;crit
</p>
<p>fichier ARG 84% 16%
</p>
<p>fichier CIRC 24% 76%
</p>
<p>Tableau 3 : comparaison des r&#233;sultats avec les donn&#233;es du TLF
</p>
<p>Le recours au dictionnaire ne rend bien entendu pas compte de certaines idiosyncrasies du
corpus. En effet, certains sens particuliers de verbes, associ&#233;s &#224; une construction donn&#233;e, sont
absents du TLF (s&#8217;encaisser dans le lit, &#234;tre exprim&#233; en m&#232;tres, modeler en creux, etc.).
</p>
<p>4&#1; Conclusion et perspectives
La mesure de productivit&#233; telle que nous l'avons d&#233;finie et mise en &#339;uvre sur corpus fournit
un nouvel outil pour caract&#233;riser l&#8217;opposition entre argument et circonstant. Nous nous
sommes ainsi dot&#233;es d&#8217;une mesure permettant d&#8217;&#233;valuer la coh&#233;sion d&#8217;un GP pour un verbe
donn&#233;. Les deux &#233;valuations que nous avons men&#233;es t&#233;moignent du bon taux de pr&#233;cision de
la m&#233;thode et par cons&#233;quent de la pertinence de la mesure de productivit&#233; pour caract&#233;riser le
lien de compl&#233;mentation entre un recteur et son GP. Cette premi&#232;re exp&#233;rience doit &#234;tre
prolong&#233;e &#224; plusieurs niveaux. Pour le moment, nous n&#8217;&#233;valuons que des s&#233;quences verbe+GP
pour lesquelles l&#8217;une des deux productivit&#233;s (recteur ou r&#233;gi) est nulle, ce qui impose une
contrainte forte sur les donn&#233;es susceptibles d'&#234;tre ainsi caract&#233;ris&#233;es. Nous projetons &#224; ce titre
d&#8217;&#233;tudier les cas interm&#233;diaires, ce qui pourrait nous engager vers une (meilleure)
caract&#233;risation du continuum dont font &#233;tat de nombreux auteurs. Par ailleurs, l&#8217;impact du
type de corpus sur la m&#233;thode doit &#234;tre &#233;valu&#233; afin de d&#233;terminer si son efficacit&#233; perdure &#224;
l&#8217;&#233;preuve d&#8217;un corpus moins &#171; technique &#187;, pr&#233;sentant moins de redondance. Enfin, nous
envisageons &#224; court terme d&#8217;exploiter d&#8217;autres pistes pour am&#233;liorer la description de ces GP,
et en particulier d'utiliser le crit&#232;re de d&#233;termination de la pr&#233;position par le verbe, un des tests
linguistiques dont nous avons rendu compte en 2.1.  D&#232;s &#224; pr&#233;sent, au vu de nos premi&#232;res
observations, nous constatons en effet une forte relation entre la productivit&#233; et l&#8217;association
d&#8217;un recteur &#224; une seule pr&#233;position (aboutir &#224;, prodRecteur = 11) ou &#224; plusieurs (d&#233;velopper
sur/sous/par/&#224;/dans, prodRecteur = 3), ce qui pourrait constituer un crit&#232;re suppl&#233;mentaire
pour mettre en &#233;vidence diff&#233;rents types de compl&#233;ments verbaux en corpus. L'impact de cette
diff&#233;renciation de contextes argumentaux et circonstanciels sur la mod&#233;lisation du contenu
des textes, et en particulier sur l'analyse distributionnelle, doit ensuite &#234;tre &#233;tudi&#233; et &#233;valu&#233;.
</p>
<p>Remerciements
Nous remercions Anne Le Draoulec d&#8217;avoir particip&#233; &#224; l&#8217;&#233;valuation de nos donn&#233;es ainsi que
Didier Bourigault pour sa relecture attentive de l&#8217;article.
</p>
<p>R&#233;f&#233;rences
Basili R. Pazienza M-T., Vindigni M. (1997), Corpus-driven Unsupervised Learning of Verb
Subcategorization Frames, Actes du 5&#232;me congr&#232;s AI*IA 97, Rome, M. Lenzerini (ed), Lecture
Notes in Artificial Intelligence, 1321, 159-170.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fabre, C&#233;cile Fr&#233;rot
</p>
<p>Bonami O. (1999), Les constructions du verbe : le cas des groupes pr&#233;positionnels
argumentaux, Th&#232;se de doctorat, Universit&#233; Paris 7.
</p>
<p>Borillo A. (1990), A propos de la localisation spatiale, Langue fran&#231;aise, Vol.86, pp.75-84.
Bourigault D. (1994), Lexter, un logiciel d&#8217;extraction de terminologie. Application &#224;
l&#8217;acquisition de connaissances &#224; partir de textes, Th&#232;se de l&#8217;Ecole des Hautes Etudes en
Sciences Sociales, Paris.
</p>
<p>Bourigault D., Fabre C. (2000), Approche linguistique pour l'analyse syntaxique de corpus.
Cahiers de grammaire, Vol.25, pp.131-151.
</p>
<p>Bourigault D., Lame G. (2002), Analyse distributionnelle et structuration de terminologie.
Application &#224; la construction d&#8217;une ontologie documentaire du Droit. T.A.L, Herm&#232;s,
Vol.43:1, &#224; para&#238;tre.
</p>
<p>Brent M-R. (1993), From Grammar to Lexicon : Unsupervised Learning of Lexical Syntax,
Computational Linguistics, Vol.19 : 2, pp.243-262.
</p>
<p>Briscoe T., Carroll J. (1997), Automatic Extraction of Subcategorization from Corpora, Actes
de 5 th Conference on Applied NLP, Washington, 356-363.
Buchholz S. (1998), Distinguishing complements from adjuncts using memory-based
learning, B. Keller (Ed.), Actes de ESSLLI-98 Workshop on Automated Acquisition of Syntax
and Parsing,  41-48.
</p>
<p>Fabre  C., Bourigault D. (2001), Linguistic clues for corpus-based acquisition of lexical
dependencies. Actes de Corpus Linguistics Conference, Lancaster, 176-184.
Federici  S., Montemagni  S., Pirrelli  V., Calzolari  N. (1998), Analogy-based Extraction of
Lexical Knowledge from Corpora: the SPARKLE Exp&#233;rience, Actes de LREC, Grenade,
75-82.
</p>
<p>Manning C. (1993), Automatic acquisition of a large subcategorization dictionary from
corpora, Actes de 31th meeting of the association for Computational Linguistics, ACL,
Morristown, 235-242.
</p>
<p>Miller  P. (1997), Compl&#233;ments et circonstants : une distinction syntaxique ou s&#233;mantique ?,
Actes du 37&#232;me Congr&#232;s de la SAES, &#233;dit&#233; sous la direction de J.-C. Souesme, 91-103, Presses
Universitaires de Nice, 1998.
</p>
<p>Meyers A., Macleod C., Grishman R. (1994), Standardization of the Complement/Adjunct
Distinction, Abstract, Proteus Project Memorandum 64, Computer Science Department, New-
York University.
</p>
<p>Nazarenko A., Zweigenbaum P., Habert B., Bouaud J. (2001), Corpus-based extension of a
terminological semantic lexicon. In Didier Bourigault, Christian Jacquemin, and Marie-
Claude L'Homme (eds), Recent Advances in Computational Terminology, chap. 16, pp.
327-351, John Benjamins, Amsterdam.</p>

</div></div>
</body></html>