<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;valuer l&#8217;acquisition semi-automatique de classes s&#233;mantiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27 juin 2002 
</p>
<p>&#201;valuer l&#8217;acquisition semi-automatique de classes s&#233;mantiques 
</p>
<p>Thierry Poibeau, Dominique Dutoit et Sophie Bizouard 
</p>
<p>(1) Thales et LIPN  
Domaine de Corbeville, 91404 Orsay, France 
</p>
<p>thierry.poibeau@thalesgroup.com 
(2) Memodata et CRISCO 
</p>
<p>17, rue Dumont d&#8217;Urville, 14 000 Caen, France  
memodata@wanadoo.fr 
</p>
<p>(3) Crim/Inalco 
2, rue de Lille, 75007 Paris, France 
sophie.bizouard@club-internet.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
Cet article vise &#224; &#233;valuer deux approches diff&#233;rentes pour la constitution de classes 
s&#233;mantiques. Une approche endog&#232;ne (acquisition &#224; partir d&#8217;un corpus) est contrast&#233;e 
avec une approche exog&#232;ne (&#224; travers un r&#233;seau s&#233;mantique riche). L&#8217;article pr&#233;sente 
une &#233;valuation fine de ces deux techniques. 
</p>
<p>This paper evaluates two different approaches for the elaboration of semantic classes. 
An endogeneous approach (corpus-based learning) is contrasted with a exogeneous one 
(the use of a large semantic network). The two techniques are finally evaluated. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
Classes s&#233;mantiques, &#201;valuation, Ressources, R&#233;seau s&#233;mantique 
Semantic classes, Evaluation, Resources, Semantic network 
</p>
<p>1 Introduction : ressources g&#233;n&#233;rales vs. ressources sp&#233;cifiques 
Cet article vise &#224; &#233;valuer deux approches pour la constitution de classes s&#233;mantiques. 
Nous nous pla&#231;ons dans la perspective d&#8217;une application d&#8217;extraction d&#8217;information, 
</p>
<p>255 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Poibeau, Dominique Dutoit et Sophie Bizouard 
</p>
<p>pour laquelle la notion de classe s&#233;mantique est primordiale1. Dans cette introduction, 
nous reprenons les deux principales approches g&#233;n&#233;ralement consid&#233;r&#233;es : l&#8217;acc&#232;s 
direct &#224; des ressources g&#233;n&#233;rales et l&#8217;&#233;laboration dynamique de ressources &#224; partir du 
corpus de travail.  
</p>
<p>Les ressources g&#233;n&#233;rales ont &#233;t&#233; fortement critiqu&#233;es ces derni&#232;res ann&#233;es. Les 
principales objections sont rappel&#233;es dans la th&#232;se de D. Dutoit (2000) :  
</p>
<p>&#8722; Les ressources linguistiques g&#233;n&#233;rales (en particulier les r&#233;seaux s&#233;mantiques larges 
et hors-domaine) sont difficilement utilisables en contexte car elles sont abstraites et 
encodent rarement les traits propres &#224; un domaine vis&#233;, qui sont pourtant essentiels &#224; 
l&#8217;analyse. 
</p>
<p>&#8722; M&#234;me si l&#8217;information pertinente a &#233;t&#233; mod&#233;lis&#233;e, elle est noy&#233;e au milieu de 
nombreuses informations non pertinentes pour la t&#226;che et elle est donc difficilement 
exploitable. 
</p>
<p>&#8722; L&#8217;information &#224; mod&#233;liser est si importante que la t&#226;che est infinie et donc vou&#233;e &#224; 
l&#8217;&#233;chec (Victorri, 1998). 
</p>
<p>L&#8217;utilisabilit&#233; d&#8217;une ressource vient en grande partie de la fa&#231;on dont elle est 
structur&#233;e. De ce point de vue, il faut noter que la plupart des critiques examin&#233;es ci-
dessus s&#8217;adressent en premier lieu au r&#233;seau WORDNET de Princeton (Fellbaum, 1998), 
qui souffre certainement d&#8217;un manque de structuration pour &#234;tre exploitable de fa&#231;on 
optimale dans une vis&#233;e applicative2. Sur un plan plus th&#233;orique, la compr&#233;hension est 
un ph&#233;nom&#232;ne qui met en jeu un r&#233;seau de connaissances a priori et l&#8217;usage d&#8217;un 
r&#233;seau s&#233;mantique, m&#234;me incomplet, permet de se rapprocher de cet &#233;tat de fait. Nul 
m&#233;canisme de compr&#233;hension ne peut se contenter d&#8217;une analyse purement endog&#232;ne, 
o&#249; toute la connaissance viendrait du contexte imm&#233;diat. 
</p>
<p>Il n&#8217;en demeure pas moins que certains chercheurs, refusant les arguments ci-dessus, se 
sont plut&#244;t tourn&#233;s vers l&#8217;acquisition de classes s&#233;mantiques &#224; partir de corpus 
(Hirschmann et al, 1975) (Grishman et Sterling, 1994). Les m&#233;thodes d&#8217;acquisition &#224; 
partir de corpus reposent pour la plupart sur une &#171; hypoth&#232;se distributionnaliste &#187; 
(Harris, 1951) : &#224; l&#8217;int&#233;rieur d&#8217;un sous-langage, le rep&#233;rage de structures syntaxiques 
r&#233;guli&#232;res permet de mettre en &#233;vidence des familles de mots apparaissant dans des 
contextes communs. Ces familles de mots servent &#224; former des classes s&#233;mantiques.  
</p>
<p>L&#8217;approche est s&#233;duisante, mais les r&#233;sultats sont nuanc&#233;s. La question de la taille du 
corpus, de sa nature et de sa variabilit&#233; se pose en effet de fa&#231;on cruciale. Cet aspect est 
relativement peu abord&#233; dans les comptes rendus d&#8217;exp&#233;riences, qui portent souvent sur 
</p>
<p>                                                 
1  Nous d&#233;taillerons ici l&#8217;&#233;valuation des classes s&#233;mantiques en elles-m&#234;mes, en prenant en compte leur 
</p>
<p>degr&#233; de recouvrement notamment. Par manque de place, nous ne pouvons ici pr&#233;senter une &#233;valuation et 
une discussion de leur influence sur le processus d&#8217;extraction lui-m&#234;me. Sur ce sujet, voir 
[Poibeau, 2002]. 
</p>
<p>2  Depuis, un mod&#232;le WORDNET plus complexe a &#233;t&#233; mis au point pour am&#233;liorer certains des points faibles 
du mod&#232;le initial : il s&#8217;agit de EUROWORDNET, qui a &#233;t&#233; con&#231;u lors de la cr&#233;ation de r&#233;seaux s&#233;mantiques 
multilingues pour plusieurs langues europ&#233;ennes (Vossen, 1998). 
</p>
<p>256 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuer l&#8217;acquisition semi-automatique de classes s&#233;mantiques 
</p>
<p>des corpus r&#233;guliers ou techniques (par exemple, Nazarenko  et al. (1997) proposent 
une exp&#233;rience sur le domaine m&#233;dical, Faure (2000) sur des recettes de cuisine). Plus 
fondamentalement, la plupart des &#233;tudes mentionnent que les classes obtenues 
automatiquement ne sont pas compl&#232;tement satisfaisantes (Nazarenko et al., 2001) : 
elles ne peuvent pas &#234;tre inject&#233;es directement dans une application. Plusieurs raisons 
bien connues expliquent cet &#233;tat de fait : 
</p>
<p>&#8722; M&#234;me &#224; l&#8217;int&#233;rieur d&#8217;un sous-langage, un sch&#233;ma syntaxique peut &#234;tre ambigu.  
&#8722; Les mots apparaissant dans un contexte donn&#233; entretiennent entre eux des relations 
</p>
<p>plus ou moins &#233;troites3.  
&#8722; Certains mots sont tr&#232;s g&#233;n&#233;raux et permettent l&#8217;induction de classes sans grande 
</p>
<p>pertinence.  
</p>
<p>Il est donc n&#233;cessaire d&#8217;injecter des connaissances dans le syst&#232;me d&#8217;acquisition 
pour en am&#233;liorer les r&#233;sultats et le rendre utilisable. L&#8217;apprentissage devient alors 
supervis&#233;, comme dans l&#8217;exp&#233;rience de Nazarenko et al. (2001) qui proposent d&#8217;adapter 
la nomenclature m&#233;dicale SNOMED au corpus MENELAS. Les auteurs projettent les 
cat&#233;gories de SNOMED sur le r&#233;sultat d&#8217;une analyse distributionnelle, ce qui contribue &#224; 
affiner les classes obtenues automatiquement. Morin et Jacquemin (1999) proc&#232;dent de 
mani&#232;re similaire pour sp&#233;cialiser un th&#233;saurus (AGROVOC) en fonction d&#8217;un corpus. 
</p>
<p>Le d&#233;bat est donc moins tranch&#233; qu&#8217;il pourrait le para&#238;tre de prime abord entre 
ressources g&#233;n&#233;rales et ressources sp&#233;cialis&#233;es. Nous proposons donc de reprendre cette 
question ici d&#8217;un point de vue applicatif, en comparant deux approches pour 
l&#8217;acquisition semi-automatique de classes s&#233;mantiques. Nous &#233;valuons d&#8217;abord le 
syst&#232;me ASIUM (Faure, 2000) proposant une acquisition automatique &#224; partir de corpus 
puis une phase de validation interactive (section 3). Nous effectuons ensuite la m&#234;me 
exp&#233;rience avec le r&#233;seau s&#233;mantique de MEMODATA (Dutoit, 2000), qui constitue &#224; 
notre connaissance le r&#233;seau s&#233;mantique le plus riche &#224; l&#8217;heure actuelle pour le fran&#231;ais 
(section 4). Nous pr&#233;sentons ensuite des conclusions sur le processus d&#8217;&#233;valuation en 
lui-m&#234;me (section 5). 
</p>
<p>2 Cadre de l&#8217;exp&#233;rience 
Les exp&#233;riences d&#233;crites ont &#233;t&#233; men&#233;es sur un corpus de d&#233;p&#234;ches financi&#232;res. 300 
d&#233;p&#234;ches traitant de rachat et de vente d&#8217;entreprises ont &#233;t&#233; retenues (corpus 
FirstInvest4). Cet ensemble de d&#233;p&#234;ches a &#233;t&#233; divis&#233; en deux parties : 57  d&#233;p&#234;ches pour 
le corpus de test, 243 autres pour le corpus d&#8217;entra&#238;nement. Un syst&#232;me d&#8217;extraction sur 
ce domaine a &#233;t&#233; d&#233;velopp&#233;. Les ressources &#233;labor&#233;es manuellement incluaient des 
</p>
<p>                                                 
3  Dans un corpus de cuisine, le verbe conserver (au) peut &#234;tre suivi de frais, froid, r&#233;frig&#233;rateur, sec, etc 
</p>
<p>[Faure, 2000]. M&#234;me pour l&#8217;expert, le d&#233;coupage n&#8217;est pas &#233;vident : faut-il consid&#233;rer que, dans le corpus, 
froid est synonyme de r&#233;frig&#233;rateur ? Les regroupements d&#233;pendent alors du degr&#233; de finesse recherch&#233; 
et peuvent difficilement &#234;tre d&#233;termin&#233;s automatiquement. 
</p>
<p>4  Firstinvest.com est un site financier sur Internet. La fourniture de ce corpus par FirstInvest a rendu ce 
travail possible.  
</p>
<p>257 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Poibeau, Dominique Dutoit et Sophie Bizouard 
</p>
<p>classes s&#233;mantiques qui ont constitu&#233; la r&#233;f&#233;rence pour les exp&#233;riences r&#233;alis&#233;es 
ensuite.  
</p>
<p>3 Acquisition automatique de familles s&#233;mantiques par 
apprentissage symbolique interactif  
</p>
<p>Nous avons entrepris d&#8217;&#233;valuer l&#8217;apport d&#8217;un outil d&#8217;apprentissage de connaissances &#224; 
partir de donn&#233;es textuelles pour &#233;laborer les ressources n&#233;cessaires &#224; un syst&#232;me 
d&#8217;extraction. Nous donnons ci-dessous une rapide description du syst&#232;me que nous 
avons utilis&#233;, ASIUM  (pour une description plus compl&#232;te, cf. (Faure et N&#233;dellec, 
1998), (Faure, 2000)).  
</p>
<p>3.1 Le syst&#232;me d&#8217;apprentissage ASIUM  
</p>
<p>Le syst&#232;me ASIUM  proc&#232;de &#224; un apprentissage symbolique non supervis&#233; &#224; partir de 
textes annot&#233;s syntaxiquement. ASIUM a pour objectif d&#8217;aider l&#8217;utilisateur &#224; cr&#233;er un 
ensemble de classes s&#233;mantiques pertinentes par rapport &#224; la t&#226;che et &#224; les formaliser en 
ontologies. Ces ontologies doivent permettre de faire appara&#238;tre clairement les relations 
existantes entre classes. L&#8217;originalit&#233; de la m&#233;thode r&#233;side essentiellement dans l&#8217;&#233;tape 
de validation interactive. L&#8217;approche repose sur une analyse distributionnelle, 
permettant de g&#233;n&#233;rer des classes de mots apparaissant dans des contextes similaires 
(les classes de base). La mesure de similarit&#233; d&#8217;ASIUM permet de calculer le 
recouvrement entre classes et de proposer le regroupement de classes ayant une 
similarit&#233; sup&#233;rieure &#224; un seuil fix&#233; par l&#8217;expert. Les classes de base sont 
successivement agr&#233;g&#233;es par une m&#233;thode coop&#233;rative, ascendante en largeur d&#8217;abord 
afin de former les concepts de l&#8217;ontologie niveau par niveau. Ce processus de 
cat&#233;gorisation ne se contente pas d&#8217;identifier des listes de noms apparaissant dans des 
contextes similaires, mais il augmente ces listes par induction. En effet, le 
rassemblement de deux classes de base (C1 et C2) trouv&#233;es apr&#232;s deux contextes 
diff&#233;rents CTXT1 et CTXT2 permet d&#8217;autoriser les s&#233;quences non attest&#233;es CTXT1 C2 et 
CTXT2 C1. Par exemple, imaginons que les mots acquisition et fusion aient &#233;t&#233; 
regroup&#233;s au sein d&#8217;une m&#234;me classe. Si proc&#233;der &#224; une acquisition est attest&#233;, le 
syst&#232;me va induire que proc&#233;der &#224; une fusion est une structure valide, m&#234;me si elle 
n&#8217;est pas attest&#233;e en corpus. Le r&#233;sultat est une g&#233;n&#233;ralisation des connaissances 
trouv&#233;es dans le corpus. ASIUM  requiert donc, &#224; ce stade, l&#8217;intervention d&#8217;un expert du 
domaine pour v&#233;rifier les classes une &#224; une, class&#233;es par mesure de similarit&#233; 
d&#233;croissante, jusqu&#8217;&#224; atteindre le seuil en-de&#231;&#224; duquel les classes ne sont plus 
pr&#233;sent&#233;es &#224; l&#8217;expert.  
</p>
<p>3.2 Apprentissage supervis&#233; ou non supervis&#233; ? 
</p>
<p>Les classes de base fournies par ASIUM n&#233;cessitent un important travail de validation. 
Du fait de la faible taille du corpus disponible, le seuil retenu pour les classes de base 
est obligatoirement bas et les rapprochements entre classes s&#8217;op&#232;rent sur un nombre 
d&#8217;&#233;l&#233;ments communs relativement peu important.  
</p>
<p>258 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuer l&#8217;acquisition semi-automatique de classes s&#233;mantiques 
</p>
<p>Deux exp&#233;riences ont &#233;t&#233; r&#233;alis&#233;es. Dans la premi&#232;re exp&#233;rience, ASIUM est utilis&#233; tel 
quel. Les rapprochements entre classes de base s&#8217;effectuent en mode non supervis&#233;5 : 
ils sont uniquement fond&#233;s sur le score obtenu entre les deux classes. Cette strat&#233;gie 
oblige &#224; valider ou &#224; refuser un nombre important de classes qui ont des &#233;l&#233;ments 
communs mais qui ne sont pas pertinentes pour le domaine. Une deuxi&#232;me exp&#233;rience a 
alors utilis&#233; une fonctionnalit&#233; d&#8217;ASIUM permettant de focaliser la recherche sur les 
seules classes comprenant des &#233;l&#233;ments du domaine, d&#233;finis d&#8217;apr&#232;s un ensemble de 
mots plac&#233;s dans un fichier jouant le r&#244;le de filtre. Par exemple, pour la recherche de la 
classe Op&#233;ration d&#8217;achat, le filtre comprenait les mots achat, fusion, scission ; pour 
la classe Entreprise, les mots entreprise, soci&#233;t&#233;, filiale. Cette strat&#233;gie d&#233;bouche sur 
un apprentissage de type supervis&#233;6, ce qui am&#233;liore notablement la pertinence du 
r&#233;sultat, &#224; condition de d&#233;finir &#224; chaque fois un ensemble de mots pertinents. Suivant la 
classe s&#233;mantique que l&#8217;analyste cherche &#224; mod&#233;liser, cet ensemble de mots n&#8217;est pas le 
m&#234;me. Il y a donc l&#224; un premier facteur de subjectivit&#233; dans l&#8217;&#233;valuation : la d&#233;finition 
du filtre est une op&#233;ration subjective qui influe notablement sur les r&#233;sultats. 
</p>
<p>3.3 Crit&#232;res pour l&#8217;&#233;laboration des classes 
</p>
<p>La mod&#233;lisation des classes n&#233;cessite un travail manuel significatif. M&#234;me avec un 
fichier jouant le r&#244;le de filtre, le nombre de classes de base propos&#233;es est important, 
puisqu&#8217;il a vari&#233; de 41 &#224; 576 suivant le nombre d&#8217;&#233;l&#233;ments contenus dans le filtre. La 
plupart du temps, la classe de base ASIUM la plus proche de la classe s&#233;mantique vis&#233;e 
contient moins de 30 % des &#233;l&#233;ments d&#233;sir&#233;s ; parall&#232;lement, il est rare que plus de 
30 % d&#8217;une classe de base soit jug&#233; pertinent. Le travail de nettoyage des classes et le 
nombre d&#8217;agr&#233;gations de classes n&#233;cessaires s&#8217;en trouvent d&#8217;autant accrus. Il n&#8217;est pas 
rare de trouver des classes s&#233;mantiques r&#233;parties sur 20 classes de base, n&#233;cessitant 
autant d&#8217;agr&#233;gations. Ce point peut poser probl&#232;me lors de la mise en &#339;uvre du 
syst&#232;me : il faut que l&#8217;expert accepte de passer du temps &#224; valider des classes 
initialement peu repr&#233;sentatives. 
</p>
<p>3.4 Mesurer l&#8217;apport de l&#8217;apprentissage pour l&#8217;acquisition de ressources 
</p>
<p>Le but de l&#8217;exp&#233;rience est de tenter de rep&#233;rer semi-automatiquement, gr&#226;ce &#224; ASIUM, 
les classes s&#233;mantiques qui sont utiles pour l&#8217;extraction. Dans le cadre de l&#8217;exp&#233;rience 
sur le corpus FirstInvest, l&#8217;&#233;valuation a port&#233; sur une comparaison des items figurant 
dans la classe pr&#233;alablement d&#233;finie par l&#8217;expert avec ceux obtenus par apprentissage.  
</p>
<p>                                                 
5  A ce stade, l&#8217;utilisateur n&#8217;est pas dans la boucle : il intervient juste pour valider les propositions faites par 
</p>
<p>le syst&#232;me. 
</p>
<p>6  Cette strat&#233;gie fait suite &#224; l&#8217;utilisation d&#8217;Asium dans des exp&#233;riences d&#8217;acquisition de ressources pour 
l&#8217;extraction. De fa&#231;on analogue, Riloff et Jones (1999) proposent une approche fond&#233;e sur un ensemble 
de mots-cl&#233;s initiaux dits seed words pour amorcer l&#8217;apprentissage de classes s&#233;mantiques. Ces 
exp&#233;riences ont montr&#233; qu&#8217;il &#233;tait n&#233;cessaire de mettre au point un moyen de superviser l&#8217;apprentissage, 
contrairement &#224; ce qui est recherch&#233; dans l&#8217;acquisition d&#8217;ontologies, qui porte g&#233;n&#233;ralement sur tout le 
texte. L&#8217;extraction ne s&#8217;int&#233;resse, rappelons-le, qu&#8217;&#224; une partie minime du texte. 
</p>
<p>259 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Poibeau, Dominique Dutoit et Sophie Bizouard 
</p>
<p>L&#8217;analyse d&#8217;ASIUM met en jeu la fr&#233;quence d&#8217;apparition des &#233;l&#233;ments : de fait, presque 
tous les &#233;l&#233;ments ayant une influence majeure sur le r&#233;sultat ont &#233;t&#233; trouv&#233;s. Les 
&#171; oublis &#187; portent sur des &#233;l&#233;ments rares, influen&#231;ant peu le r&#233;sultat final, comme 
&#233;change, &#233;mission, transaction. Il faut toutefois noter que certains &#233;l&#233;ments comme 
reprise ou vente n&#8217;ont pas &#233;t&#233; trouv&#233;s, bien qu&#8217;il s&#8217;agisse de mots fr&#233;quents7. L&#8217;analyse 
distributionnelle permet en outre de retrouver quelques &#233;l&#233;ments pertinents pour la 
t&#226;che, qui n&#8217;avaient pas &#233;t&#233; retenus lors du travail d&#8217;&#233;valuation manuel des ressources 
(d&#233;sengagement, regroupement, scission). Bien &#233;videmment aucun &#233;l&#233;ment 
n&#8217;apparaissant pas dans le corpus d&#8217;entra&#238;nement ne peut figurer dans une classe 
propos&#233;e par ASIUM.  
</p>
<p>Une fois affin&#233;es et valid&#233;es, les classes d&#233;finies semi-automatiquement permettent 
d&#8217;obtenir des r&#233;sultats globaux relativement bons. Nous avons affaire &#224; un corpus 
homog&#232;ne : malgr&#233; sa taille r&#233;duite (243 textes, soit 45 334 mots), le corpus 
d&#8217;entra&#238;nement permet d&#8217;obtenir des performances correctes sur le corpus de test (80 % 
de pr&#233;cision et 60 % de rappel en moyenne suivant les classes s&#233;mantiques vis&#233;es). 
L&#8217;utilisation d&#8217;ASIUM, accompagn&#233;e d&#8217;un important travail de validation, permet de 
bien couvrir le corpus d&#8217;entra&#238;nement.  
</p>
<p>L&#8217;outil permet d&#8217;&#233;tablir conjointement des listes de noms et de verbes associ&#233;s. Il offre 
donc un gain de temps par rapport &#224; la lecture du corpus. L&#8217;&#233;valuateur estime avoir 
pass&#233; 10 heures &#224; d&#233;finir des classes s&#233;mantiques avec ASIUM, &#224; comparer avec les 50 
heures consacr&#233;es &#224; lire le corpus lors du d&#233;veloppement manuel des ressources. Le 
filtrage d&#8217;apr&#232;s un ensemble de mots cl&#233;s permet d&#8217;obtenir des classes pertinentes d&#232;s 
le d&#233;but de la validation, ce qui offre un avantage important par rapport &#224; l&#8217;exp&#233;rience 
de Faure et Poibeau (2000) qui reposait sur un apprentissage non supervis&#233;. 
</p>
<p>4 Utilisation d&#8217;une ressource linguistique g&#233;n&#233;rale : le r&#233;seau 
s&#233;mantique de Memodata 
</p>
<p>Afin de contraster l&#8217;exp&#233;rience faite avec ASIUM, nous avons d&#233;cid&#233; de proc&#233;der &#224; la 
m&#234;me manipulation en partant d&#8217;un r&#233;seau s&#233;mantique de la langue g&#233;n&#233;rale. Nous 
avons retenu le r&#233;seau de MEMODATA, qui a d&#233;velopp&#233; depuis plus de 10 ans un outil 
tr&#232;s complet, le DICTIONNAIRE INTEGRAL, accompagn&#233; de fonctionnalit&#233;s accessibles 
via une interface de programmation (API, Application Programming Interface) (Dutoit, 
2000).  
</p>
<p>4.1 Le r&#233;seau s&#233;mantique : le DICTIONNAIRE INTEGRAL et les outils 
associ&#233;s 
</p>
<p>Le DICTIONNAIRE INTEGRAL est le nom du r&#233;seau s&#233;mantique d&#233;velopp&#233; par 
MEMODATA. Ce r&#233;seau est fond&#233; sur la notion de mots-sens, c&#8217;est-&#224;-dire sur les 
</p>
<p>                                                 
7  Bien qu&#8217;ils soient fr&#233;quents, ces mots ne sont pas retenus par l&#8217;analyse car ils se trouvent dans des 
</p>
<p>contextes diff&#233;rents des mots supportant la notion d&#8217;achat. 
</p>
<p>260 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuer l&#8217;acquisition semi-automatique de classes s&#233;mantiques 
</p>
<p>diff&#233;rents sens associ&#233;s &#224; un mot (une cha&#238;ne de caract&#232;re). Il est riche d&#8217;environ 
186 000 mots-sens : il est donc comparable par la taille &#224; WORDNET (Fellbaum, 1998), 
mais il en diff&#232;re notablement par la fa&#231;on dont l&#8217;information y est structur&#233;e. En effet, 
la d&#233;composition n&#8217;est pas seulement fond&#233;e sur une relation &#171; est-un &#187; et sur des 
pr&#233;suppos&#233;es psychologiques, mais aussi sur une d&#233;composition des mots-sens en 
s&#232;mes (analyse componentielle) structur&#233;s par des liens typ&#233;s.  
</p>
<p>Le r&#233;seau repose sur de nombreuses relations entre des &#233;l&#233;ments de cat&#233;gories 
syntaxiques diff&#233;rentes, &#224; l&#8217;instar de EUROWORDNET (Vossen, 1998). Cet aspect est 
bien &#233;videmment primordial pour la t&#226;che qui nous int&#233;resse, puisqu&#8217;il nous faut par 
exemple trouver aussi bien achat que acheter pour refl&#233;ter la notion d&#8217;acquisition. 
La couverture du DICTIONNAIRE INTEGRAL est plus large que celle du r&#233;seau 
s&#233;mantique au format EUROWORDNET existant pour le fran&#231;ais, une partie de 
l&#8217;information contenue dans le EUROWORDNET provenant d&#8217;ailleurs des bases de 
MEMODATA (le reste du r&#233;seau EUROWORDNET fran&#231;ais ayant &#233;t&#233; produit par 
l&#8217;Universit&#233; d&#8217;Avignon, responsable du projet pour la France). 
</p>
<p>4.2 Crit&#232;res pour l&#8217;&#233;laboration des classes 
</p>
<p>Pour &#233;laborer des classes s&#233;mantiques &#224; partir d&#8217;un r&#233;seau comme celui de Memodata, 
l&#8217;utilisateur doit choisir un mot-cl&#233; du domaine vis&#233; comme point d&#8217;entr&#233;e. La classe 
&#233;merge alors progressivement en suivant des liens dans ce r&#233;seau. 
</p>
<p>L&#8217;exp&#233;rience a pris en compte tous les mots reli&#233;s &#224; un mot-cl&#233; par un lien de type 
g&#233;n&#233;rique, sp&#233;cifique ou synonyme. La classe lexicale ainsi obtenue est affin&#233;e de 
mani&#232;re &#224; obtenir une classe s&#233;mantique relativement homog&#232;ne et pertinente (il s&#8217;agit 
essentiellement d&#8217;enlever les mots non pertinents pour la t&#226;che ou le domaine). Ainsi, 
en partant de achat, on acc&#232;de &#224; une classe comprenant les mots suivants : abonnement, 
accaparement, acheter, acqu&#233;rir, acquisition, appropriation, commande, prise de 
contr&#244;le, prise de participation, pr&#233;emption, t&#233;l&#233;achat&#8230;  Dans le contexte de rachat 
d&#8217;entreprise, il est douteux que abonnement ou t&#233;l&#233;achat soient pertinents. Ces mots 
doivent &#234;tre &#233;limin&#233;s &#224; la main.  
</p>
<p>A la diff&#233;rence de l&#8217;exp&#233;rience avec ASIUM, l&#8217;utilisateur n&#8217;a pas d&#8217;information sur la 
repr&#233;sentativit&#233; d&#8217;un mot par rapport &#224; son corpus : il ignore sa fr&#233;quence et ses 
contextes d&#8217;apparition ; le retour &#171; manuel &#187; au corpus est lourd et fastidieux. Nous 
verrons dans la section suivante que la repr&#233;sentativit&#233; des r&#233;sultats s&#8217;en ressent. 
L&#8217;arr&#234;t du processus d&#8217;acquisition intervient quand les liens examin&#233;s ne rapportent 
quasiment plus de mots pertinents. Les mots les plus &#233;loign&#233;s retenus sont 
g&#233;n&#233;ralement s&#233;par&#233;s de seulement 2 &#224; 3 n&#339;uds du mot-cl&#233; initial. Le r&#233;seau est 
homog&#232;ne : les sp&#233;cifiques des synonymes du mot-cl&#233; initial couvrent souvent quasi 
parfaitement les sp&#233;cifiques du mot-cl&#233; initial8. Dans les faits, les relations suivies 
</p>
<p>                                                 
8  Ceci est moins &#233;vident qu&#8217;il n&#8217;y para&#238;t : les liens de synonymie dans les r&#233;seaux sont rarement 
</p>
<p>r&#233;ciproques (un lien de synonymie peut exister de A vers B, mais pas de B vers A), contrairement &#224; une 
id&#233;e re&#231;ue. 
</p>
<p>261 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Poibeau, Dominique Dutoit et Sophie Bizouard 
</p>
<p>ram&#232;nent rapidement soit des ensemble de mots d&#233;j&#224; trouv&#233;s, soit des ensembles peu 
pertinents. Le processus d&#8217;acquisition s&#8217;arr&#234;te alors. 
</p>
<p>4.3 Mesurer l&#8217;apport de ressources g&#233;n&#233;rales pour l&#8217;acquisition de 
classes s&#233;mantiques                                        
</p>
<p>L&#8217;&#233;valuation de l&#8217;apport du DICTIONNAIRE INTEGRAL pour la d&#233;finition des classes 
s&#233;mantiques du domaine se rapproche partiellement de celle qui a &#233;t&#233; mise en &#339;uvre 
pour &#233;valuer ASIUM. Il s&#8217;agit en effet de comparer la couverture de classes obtenues &#224; 
partir de l&#8217;outil de MEMODATA avec la couverture des classes d&#233;finies manuellement. 
On constate toutefois quelques diff&#233;rences : l&#8217;outil de MEMODATA ne n&#233;cessite pas de 
travail de mod&#233;lisation ni de corpus d&#8217;entra&#238;nement. Plusieurs facteurs de subjectivit&#233; 
apparaissent aussi de mani&#232;re flagrante dans l&#8217;&#233;valuation. Ainsi, l&#8217;interrogation de 
l&#8217;outil de MEMODATA se fait &#224; partir d&#8217;un mot ou d&#8217;un ensemble de mots-cl&#233;s. Le point 
de d&#233;part (mot-cl&#233; servant de support &#224; l&#8217;interrogation) a une influence majeure sur les 
r&#233;sultats obtenus, du fait qu&#8217;un mot peut &#234;tre plus ou moins bien reli&#233; aux mots de sens 
proche, que le r&#233;seau lexical est plus dense dans certains domaines, etc.  
</p>
<p>On observe qu&#8217;en interrogeant le DICTIONNAIRE INTEGRAL avec 3 &#224; 5 mots seulement, 
il est possible de reconstituer int&#233;gralement n&#8217;importe laquelle des classes s&#233;mantiques 
sur lesquelles a port&#233; l&#8217;&#233;valuation. Toute la difficult&#233; consiste &#233;videmment &#224; bien 
choisir les mots-cl&#233;s initiaux (comme achat dans l&#8217;exemple du paragraphe pr&#233;c&#233;dent), 
qui sont d&#233;terminants pour la qualit&#233; du r&#233;sultat final. On retrouve ici le m&#234;me facteur 
de subjectivit&#233; que celui qui pr&#233;side &#224; l&#8217;&#233;laboration des filtres d&#8217;ASIUM. Le petit 
nombre d&#8217;&#233;l&#233;ments initiaux du DICTIONNAIRE INTEGRAL &#224; activer pour reconstituer les 
classes s&#233;mantiques vis&#233;es montrent toutefois l&#8217;homog&#233;n&#233;it&#233; des classes s&#233;mantiques 
d&#233;finies par MEMODATA. Pour &#233;viter la subjectivit&#233; qu&#8217;entra&#238;ne le choix d&#8217;une 
combinaison de mots-cl&#233;s, nous avons voulu faire l&#8217;&#233;valuation en ne prenant en compte 
qu&#8217;un seul mot comme point de d&#233;part, &#224; savoir le mot &#171; achat &#187;. La classe obtenue en 
activant simplement les liens directs de &#171; achat &#187; puis en validant les r&#233;sultats permet 
de d&#233;couvrir plus de 75 % de la classe s&#233;mantique vis&#233;e, si nous ne tenons pas compte 
de l&#8217;effectif dans le corpus de test des mots composant la classe. 60 % des &#233;l&#233;ments 
propos&#233;s par le DICTIONNAIRE INTEGRAL ont &#233;t&#233; retenus. Une large partie de la classe 
ainsi obtenue ne figurait pas dans la classe &#233;labor&#233;e manuellement (il y a en moyenne 
40 % d&#8217;&#233;l&#233;ments nouveaux dans les classes obtenues &#224; partir du DICTIONNAIRE 
INTEGRAL, compar&#233;es aux classes d&#233;finies manuellement). Autrement dit, le r&#233;seau de 
MEMODATA fourni beaucoup d&#8217;&#233;l&#233;ments auxquels un analyste n&#8217;aurait pas pens&#233; 
spontan&#233;ment. 
</p>
<p>Ces r&#233;sultats sont toutefois trompeurs et sont tr&#232;s diff&#233;rents si nous raisonnons en 
termes d&#8217;effectif. Des &#233;l&#233;ments cl&#233;s de la classe s&#233;mantique vis&#233;e n&#8217;ont pas &#233;t&#233; trouv&#233;s. 
Les chiffres tenant compte de l&#8217;effectif r&#233;v&#232;lent que la classe obtenue avec le 
DICTIONNAIRE INTEGRAL ne couvre que 45 % de la classe vis&#233;e, et les nouveaux 
&#233;l&#233;ments propos&#233;s ne contribuent qu&#8217;&#224; hauteur de 7 % &#224; l&#8217;am&#233;lioration de la 
couverture. Autrement dit, de nombreux termes propos&#233;s pourraient &#234;tre pertinents, 
mais ceux-ci ne sont pas pr&#233;sents dans le corpus de test. Nous retiendrons que, 
globalement, les classes propos&#233;es par le DICTIONNAIRE INTEGRAL sont de meilleure 
qualit&#233; que celles propos&#233;es par ASIUM et elles couvrent un spectre plus large 
</p>
<p>262 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuer l&#8217;acquisition semi-automatique de classes s&#233;mantiques 
</p>
<p>d&#8217;&#233;l&#233;ments, du fait qu&#8217;elles ne sont pas limit&#233;es au corpus d&#8217;entra&#238;nement. La m&#233;daille 
a h&#233;las un revers : des &#233;l&#233;ments cl&#233;s du corpus sont oubli&#233;s (30 % d&#8217;&#233;l&#233;ments non 
couverts repr&#233;sentent en fait 55 % des occurrences en corpus). Certains de ces &#233;l&#233;ments 
sont des &#233;l&#233;ments fr&#233;quents, ce qui contribue &#224; faire largement baisser le rappel global.  
</p>
<p>5 Les outils d&#8217;acquisition de ressources, une &#233;valuation difficile 
Les outils d&#8217;extraction offrent des possibilit&#233;s d&#8217;&#233;valuation relativement claires : une 
r&#233;f&#233;rence peut g&#233;n&#233;ralement &#234;tre &#233;tablie &#224; la main, et les r&#233;sultats de l&#8217;extraction sont 
compar&#233;s &#224; cette r&#233;f&#233;rence. Il en va tout autrement quand il s&#8217;agit d&#8217;acquisition de 
ressources. Les ressources d&#233;finies manuellement constituent une r&#233;f&#233;rence relative, 
que l&#8217;on sait largement imparfaite. L&#8217;&#233;valuation ne repose donc pas sur une r&#233;alit&#233; 
objective et incontestable. Les difficult&#233;s deviennent encore plus grandes quand on sait 
que l&#8217;&#233;laboration de ressources ne peut constituer une t&#226;che isol&#233;e et abstraite. En effet, 
le travail de mod&#233;lisation linguistique exige une connaissance du domaine et du corpus 
trait&#233;. Cette connaissance permet &#224; l&#8217;utilisateur de guider le syst&#232;me d&#8217;apprentissage en 
d&#233;finissant les &#171; bons &#187; filtres ou les &#171; bons &#187; mots-cl&#233;s. Mais, comme toute 
connaissance humaine, elle est difficile &#224; mod&#233;liser, comporte une part de non-dit et 
d&#8217;implicite.  
</p>
<p>Cette part de subjectivit&#233; est inh&#233;rente &#224; la t&#226;che et ne doit pas &#234;tre masqu&#233;e lors de 
l&#8217;&#233;valuation. On obtient alors des r&#233;sultats moins lisibles et moins clairs que lors d&#8217;une 
&#233;valuation de type &#171; bo&#238;te noire &#187;. Ce manque de nettet&#233; est souvent compens&#233; par une 
intuition de l&#8217;expert qui d&#233;veloppe ses propres strat&#233;gies d&#8217;analyse et d&#8217;utilisation des 
outils &#224; sa disposition. Il est donc n&#233;cessaire de proposer des guides lors de la mise en 
place de tels outils : guides des fonctionnalit&#233;s, mais aussi et surtout guides 
m&#233;thodologiques explicitant les strat&#233;gies d&#8217;analyse possibles en fonction de la taille 
du corpus, de son homog&#233;n&#233;it&#233;, de sa repr&#233;sentativit&#233; et du domaine consid&#233;r&#233;.  
</p>
<p>6 Conclusion 
Dans cet article, nous avons proc&#233;d&#233; &#224; l&#8217;&#233;valuation de deux sources de connaissances 
pour l&#8217;acquisition de classes s&#233;mantiques : le corpus lui-m&#234;me et un r&#233;seau s&#233;mantique 
g&#233;n&#233;ral. Les r&#233;sultats obtenus sont contrast&#233;s et nous avons montr&#233; que les deux 
sources de connaissances ne permettent pas d&#8217;obtenir les m&#234;me r&#233;sultats. L&#8217;acquisition 
&#224; partir du corpus est plus pr&#233;cise, tandis que le recours &#224; un r&#233;seau s&#233;mantique permet 
de couvrir plus &#171; large &#187;. La compl&#233;mentarit&#233; de ces deux sources de donn&#233;es reste 
maintenant &#224; &#234;tre mieux exploit&#233;e au sein d&#8217;une syst&#232;me coop&#233;ratif. 
</p>
<p>7 Bibliographie 
DUTOIT D. &#8211; Quelques op&#233;rations texte &#8594; sens et sens &#8594; texte utilisant une 
s&#233;mantique linguistique universaliste apriorique. Th&#232;se de Doctorat en Informatique, 
Universit&#233; de Caen, 2000.  
</p>
<p>263 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thierry Poibeau, Dominique Dutoit et Sophie Bizouard 
</p>
<p>264 
</p>
<p>FAURE D. &#8211; Conception de m&#233;thode d&#8217;apprentissage symbolique et automatique pour 
l&#8217;acquisition de cadres de sous-cat&#233;gorisation de verbes et de connaissances 
s&#233;mantiques &#224; partir de texte : le syst&#232;me ASIUM. Th&#232;se de Doctorat en Informatique, 
Universit&#233; Paris 11&#8211;Orsay, 2000.  
</p>
<p>FAURE D., N&#201;DELLEC C. &#8211; &#171; ASIUM: Learning subcategorization frames and 
restrictions of selection &#187;. In Proceedings of the ECML&#8217;98 Workshop on Text Mining, 
Chemnitz, 1998. 
</p>
<p>FAURE D. et POIBEAU T. &#8211; &#171; Extraction d'information utilisant INTEX et des 
connaissances s&#233;mantiques apprises par ASIUM, premi&#232;res exp&#233;rimentations &#187;. In Actes 
du 12&#232;me Congr&#232;s de Reconnaissance des Formes et Intelligence Artificielle 
(RFIA'2000), Paris, 2000, pp. 91&#8211;100. 
</p>
<p>FELLBAUM S. (&#233;d.)&#8211; WordNet: An Electronic Lexical Database. MIT Press, Cambridge, 
1998. 
</p>
<p>GRISHMAN R. et STERLING J. &#8211; &#171; Generalizing automatically generated selectional 
patterns &#187;. In Proceedings of the 15th International Conference on Computational 
Linguistics (COLING'94), Tokyo, 1994, pp. 742&#8211;747. 
HARRIS Z. &#8211; Structural Linguistics. University of Chicago Press, Chicago, 1951. 
HIRSCHMAN L., GRISHMAN R. et SAGER N. &#8211; &#171; Grammatically-based automatic word 
class formation &#187;. Information Processing and Management, vol. 11, 1975, pp. 39&#8211;57. 
MORIN E.et JACQUEMIN C. &#8211; &#171; Projecting corpus-based semantic links on a thesaurus &#187;. 
In Proceedings of the 37th Annual Meeting of the Association for Computational 
Linguistics (ACL&#8217;99), Universit&#233; du Maryland, 1999, pp. 389&#8211;396. 
NAZARENKO A., ZWEIGENBAUM P., BOUAUD J. et HABERT B. &#8211; &#171; Corpus-based 
identification and refinement of semantic classes &#187;. Journal of the American Medical 
Informatics Association, vol. 4, 1997, pp. 585&#8211;589. 
NAZARENKO A., ZWEIGENBAUM P., HABERT B. et BOUAUD J. &#8211; &#171; Corpus-based 
extension of a terminological semantic lexicon &#187;. In BOURIGAULT D., JACQUEMIN C. et 
L&#8217;HOMME M.-C. (&#233;ds.) &#8211; Recent advances in Computational Terminology. John 
Benjamins, Amsterdam, 2001, pp. 327&#8211;352.  
</p>
<p>POIBEAU T. &#8211; Extraction d&#8217;information &#224; base de connaissances hybrides. Th&#232;se de 
Doctorat en Informatique, Universit&#233; de Villetaneuse, 2002. 
</p>
<p>RILOFF E. et JONES R. &#8211; &#171; Learning Dictionaries for Information Extraction by Multi-Level 
Bootstrapping &#187;. In Proceedings of the 16th National Conference on Artificial Intelligence 
(AAAI&#8217;99), Orlando, 1999, pp. 474&#8211;479. 
</p>
<p>VICTORRI B. &#8211; &#171; La construction dynamique du sens &#187;. In Actes du 11&#232;me Congr&#232;s de 
Reconnaissance des Formes et Intelligence Artificielle (RFIA&#8217;1998), Clermont 
Ferrand, 1998, pp. 15&#8211;29. 
</p>
<p>VOSSEN, P. (&#233;d.) &#8211; EuroWordNet: A Multilingual Database with Lexical Semantic 
Networks. Kluwer Academic Publishers, Dordrecht, 1998. </p>

</div></div>
</body></html>