<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traduction automatique ancr&#233;e dans l&#8217;analyse linguistique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Traduction automatique ancr&#233;e dans l&#8217;analyse linguistique 
 
</p>
<p>Jessie Pinkham et Martine Smets 
Microsoft Research 
One Microsoft Way 
</p>
<p>Redmond, WA 98052, USA 
jessiep@microsoft.com 
</p>
<p>martines@microsoft.com 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
</p>
<p>Nous pr&#233;sentons dans cet article le syst&#232;me de traduction fran&#231;ais-anglais MSR-MT 
d&#233;velopp&#233; &#224; Microsoft dans le groupe de recherche sur le traitement du language (NLP). Ce 
syst&#232;me est bas&#233; sur des analyseurs sophistiqu&#233;s qui produisent des formes logiques, dans la 
langue source et la langue cible. Ces formes logiques sont align&#233;es pour produire la base de 
donn&#233;es du transfert, qui contient les correspondances entre langue source et langue cible, 
utilis&#233;es lors de la traduction. Nous pr&#233;sentons diff&#233;rents stages du d&#233;veloppement de notre 
syst&#232;me, commenc&#233; en novembre 2000. Nous montrons que les performances d&#8217;octobre 2001 
de notre syst&#232;me sont meilleures que celles du syst&#232;me commercial Systran, pour le domaine 
technique, et d&#233;crivons le travail linguistique qui nous a permis d&#8217;arriver &#224; cette performance. 
Nous pr&#233;sentons enfin les r&#233;sultats pr&#233;liminaires sur un corpus plus g&#233;n&#233;ral, les d&#233;bats 
parlementaires du corpus du Hansard. Quoique nos r&#233;sultats ne soient pas aussi concluants 
que pour le domaine technique, nous sommes convaincues que la r&#233;solution des probl&#232;mes 
d&#8217;analyse que nous avons identifi&#233;s nous permettra d&#8217;am&#233;liorer notre performance. 
</p>
<p>In this paper, we present an overview of the MSR-MT translation system for French-English, 
developed at Microsoft Research in the NLP group.  Our system is based on rule-based 
analysis which produces logical form representations of the source language and the target 
language. These are aligned to produce mappings then stored in an example-base. We 
examine the development of the system since November 2000, and show that by October 
2001, we had exceeded the quality of the commercial system Systran in the technical domain.  
We describe the linguistic work that allowed our system to improve. We present preliminary 
results on the Hansard parliamentary corpus.  While these results are less impressive 
currently, we are convinced that changes to linguistic analysis will allow the system 
performance to improve. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s  
</p>
<p>Traduction automatique, fran&#231;ais-anglais, base d&#8217;exemples.  
Automatic translation, French-English, example-base. 
</p>
<p>287 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jessie Pinkham et Martine Smets 
</p>
<p>1 Pr&#233;sentation du syst&#232;me de traduction 
</p>
<p>Les syst&#232;mes de traduction automatiques peuvent &#234;tre bas&#233;s sur des dictionnaires bilingues 
(Gerber 1997, voir Boitet 2001 sur l&#8217;importance des dictionnaires),et peuvent utiliser soit des 
r&#232;gles de transfert, des bases de donn&#233;es d&#8217;exemples de traduction (Kaji 92, Meyers 2000, 
Watanabe et al. 2000), une langue interm&#233;diaire pivot ou interlangue (Poyen et Vauquois 
1959, Vauquois 1968, Nyberg 1991, Dorr 1993) ou des mod&#232;le statistiques (Brown et al. 
1993, Al-Onaizan et al. 1999).  
</p>
<p>Le transfert dans notre syst&#232;me est bas&#233; sur les exemples;  le module de transfert est compos&#233; 
d&#8217;une base de donn&#233;es d&#8217;exemples de traduction appris durant l&#8217;alignement de textes 
bilingues pendant la phase d&#8217;apprentissage. L&#8217;alignement est effectu&#233; entre les formes 
logiques des langues source et cible, qui sont le r&#233;sultat de l&#8217;analyse des textes 
d&#8217;apprentissage. C&#8217;est donc dire l&#8217;importance que rev&#234;t l&#8217;analyse linguistique dans notre 
syst&#232;me.  Le syst&#232;me fran&#231;ais-anglais comprend les modules suivants:  
</p>
<p>&#8226; un analyseur du fran&#231;ais, &#224; base de r&#232;gles 
&#8226;  un dictionnaire monolingue fran&#231;ais  
&#8226; une base de donn&#233;es de transfert, compos&#233;e de textes align&#233;s  
&#8226; un dictionnaire bilingue fran&#231;ais-anglais automatiquement appris &#224; partir des textes de 
</p>
<p>la base de donn&#233;es du transfert  
</p>
<p>&#8226; un g&#233;n&#233;rateur de l&#8217;anglais, &#224; base de r&#232;gles  
&#8226;  un dictionnaire monolingue anglais. 
</p>
<p>Certains de ces modules existaient avant que nous ne commencions notre travail en traduction 
automatique : l&#8217;analyseur  et les dictionnaires monolingues ont &#233;t&#233; utilis&#233;s pour les 
correcteurs de grammaire, qui font partie des logiciels Word. Le g&#233;n&#233;rateur de l&#8217;anglais est 
utilis&#233; pour la traduction automatique d&#8217;autres langues vers l&#8217;anglais, par exemple l&#8217;espagnol, 
le japonais et le chinois.  
</p>
<p>Nous n&#8217;utilisons plus de dictionnaire bilingue g&#233;n&#233;ral traditionnel construit &#224; la main. Nous 
avons en effet remarqu&#233; (Pinkham et Smets 2002a) qu&#8217;un dictionnaire bilingue g&#233;n&#233;ral 
n&#8217;am&#233;liore pas la traduction, dans le type de syst&#232;me que nous avons, et peut m&#234;me nuire &#224; la 
qualit&#233; de la traduction. Nous avons donc d&#233;cid&#233; de n&#8217;utiliser qu&#8217;un dictionnaire bilingue 
appris automatiquement sur les corpus d&#8217;apprentissage.1 
</p>
<p>Dans le reste de cette section, nous pr&#233;sentons avec plus de d&#233;tails l&#8217;analyseur et le module de 
transfert. 
</p>
<p>                                                 
1  Le dictionnaire bilingue appris comprend 30,000 paires de mots dans le domaine technique.  Nous utilisons 
</p>
<p>un dictionnaire bilingue traditionnel de 500 mots pour les pr&#233;positions, conjonctions, et pronoms.  
</p>
<p>288 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction automatique ancr&#233;e dans l&#8217;analyse linguistique 
</p>
<p>1.1 Analyseur &#224; base de r&#232;gles 
</p>
<p>L&#8217;analyseur comprend trois modules diff&#233;rents : la grammaire syntaxique, le rattachement, et 
les r&#232;gles de la forme logique. 
</p>
<p>La grammaire est une grammaire syntagmatique augment&#233;e (augmented phrase structure 
grammar). Les r&#232;gles sont binaires (Jensen 1993), et expriment des contraintes et conditions 
sur leur application. Par exemple, la r&#232;gle ci-dessous introduit le compl&#233;ment d&#8217;un verbe : la 
contrainte exprim&#233;e sur le verbe  &#224; gauche de la fl&#232;che sp&#233;cifie qu&#8217;il doit &#234;tre transitif et 
l&#8217;action d&#233;clar&#233;e sur le syntagme verbal (SV) &#224; droite de la fl&#232;che d&#233;finit le syntagme nominal 
(SN) comme l&#8217;objet du verbe. Cette r&#232;gle est bien s&#251;r tr&#232;s simplifi&#233;e, mais illustre le type de 
r&#232;gle de la grammaire.  
</p>
<p>SV[Transitif] SN &#198; SV [Objet = SN] 
Il est n&#233;cessaire de pr&#233;ciser deux points importants : nous n&#8217;essayons pas de capturer une 
th&#233;orie linguistique pr&#233;cise en d&#233;veloppant la grammaire. Notre point de d&#233;part est empirique. 
Nous travaillons avec des corpus dont nous essayons de couvrir les constructions. Si nous 
pouvons adopter l&#8217;analyse d&#8217;un ph&#233;nom&#232;ne linguistique qui ait un fondement th&#233;orique et qui 
apporte une explication coh&#233;rente, nous le faisons volontiers. Mais notre but n&#8217;est pas 
d&#8217;essayer de d&#233;montrer la validit&#233; d&#8217;une approche th&#233;orique. De m&#234;me, nous n&#8217;excluons pas 
l&#8217;adoption de diff&#233;rentes approches th&#233;oriques dans notre grammaire, pour autant que ces 
approches rendent compte des faits linguistiques observ&#233;s. 
</p>
<p>Un deuxi&#232;me point important &#224; souligner est que nous n&#8217;essayons pas de contraindre la 
grammaire &#224; n&#8217;analyser que des phrases grammaticales (Heidorn 2000). C&#8217;est une grammaire 
d&#8217;analyse, et non de g&#233;n&#233;ration, et nous la voulons robuste. Les contraintes que nous ajoutons 
aux r&#232;gles ont pour but de bloquer les mauvaises analyses des phrases rencontr&#233;es dans les 
corpus, non pas d&#8217;&#233;liminer les analyses de phrases potentiellement &#233;mises mais non 
grammaticales. En d&#8217;autres mots, nous ne nous pr&#233;occupons pas de surg&#233;n&#233;ration. 
</p>
<p>Nous voulons une grammaire flexible, et qui puisse rendre compte des faits linguistiques 
rencontr&#233;s dans des corpus vari&#233;s. Notre grammaire est d&#8217;ailleurs &#224;  large couverture et tr&#232;s 
robuste. M&#234;me si l&#8217;analyse de la phrase compl&#232;te &#233;choue, nous obtenons quand m&#234;me une 
analyse partielle des syntagmes qui ont &#233;t&#233; analys&#233;s avec succ&#232;s. 
</p>
<p>Lors du d&#233;veloppement de la grammaire, nous nous assurons que nous n&#8217;introduisons pas de 
probl&#232;mes pour des constructions trait&#233;es pr&#233;c&#233;demment en maintenant des suites de 
r&#233;gression contenant plusieurs milliers de phrases (plus de 6000 phrases2 de corpus g&#233;n&#233;ral, et 
plus de 1000 phrases d&#8217;un corpus technique de manuels d&#8217;ordinateur). Nous venons de cr&#233;er 
un corpus suppl&#233;mentaire de plus de 18000 phrases que nous allons utiliser &#224; cette fin.  
</p>
<p>La grammaire produit ce que nous appelons le sketch : un arbre syntaxique, associ&#233; &#224; un 
agr&#233;gat d&#8217;attributs et de valeurs de ces attributs, qui d&#233;finissent les constituants de l&#8217;arbre. A 
ce niveau, nous n&#8217;avons pas r&#233;solu le probl&#232;me de l&#8217;attachement de certains constituants, tels 
que les post-modificateurs (groupes pr&#233;positionnels, adjectifs, propositions relatives). En 
</p>
<p>                                                 
2  L&#8217;analyse des 6000 phrases de notre corpus g&#233;n&#233;ral prend moins de deux minutes. 
</p>
<p>289 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jessie Pinkham et Martine Smets 
</p>
<p>effet, pour pouvoir avec certitude d&#233;terminer l&#8217;endroit o&#249; s&#8217;attachent ces constituants, on a 
souvent besoin de pouvoir consid&#233;rer l&#8217;arbre syntaxique dans sa totalit&#233; (donc, lorsque 
l&#8217;analyse en arbre est termin&#233;e). La strat&#233;gie adopt&#233;e est donc d&#8217;attacher ce type de 
constituant le plus bas et le plus &#224; droite possible dans l&#8217;arbre. Et c&#8217;est lors du stage suivant de 
l&#8217;analyse, lors du rattachement, que le site de l&#8217;attachement de ces post-modificateurs est 
d&#233;termin&#233;. 
</p>
<p>Le module de rattachement est compos&#233; d&#8217;un nombre limit&#233; de r&#232;gles qui rattachent des 
constituants au site estim&#233; correct. Ces r&#232;gles sont heuristiques et se basent sur des donn&#233;es 
morphologiques, syntaxiques et s&#233;mantiques.  Dans la phrase suivante, par exemple, la 
relative introduite par que est attach&#233;e dans le sketch &#224; commandes (Image 1). Une r&#232;gle de 
rattachement la rattache &#224; fichier, utilisant l&#8217;information que commandes  fait partie d&#8217;un 
syntagme pr&#233;positionnel introduit par  de et n&#8217;est pas pr&#233;c&#233;d&#233; d&#8217;un article (Image 2). Le 
syntagme nominal exprime donc, probablement, un type d&#8217;objet, et la relative devrait &#234;tre 
attach&#233;e &#224; la t&#234;te du syntagme nominal,  non au syntagme pr&#233;positionnel. Dans cette m&#234;me 
phrase, le syntagme pr&#233;positionnel introduit par avant est rattach&#233; au verbe. Pour tester nos 
r&#232;gles de rattachement, nous utilisons un corpus de r&#233;gressions de 18.000 phrases. 
</p>
<p>Vous ins&#233;rez la commande pause avant une section du fichier de commandes que vous ne 
voulez pas traiter. 
</p>
<p> 
</p>
<p>Image  1 
</p>
<p> 
</p>
<p>Image  2 
</p>
<p>290 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction automatique ancr&#233;e dans l&#8217;analyse linguistique 
</p>
<p>La forme logique repr&#233;sente l&#8217;analyse profonde de la phrase (les fonctions syntaxiques, par  
exemple, telles que le sujet profond), et certaines informations s&#233;mantiques (par exemple, la 
signification de certaines pr&#233;positions : temporelles, de lieu, etc.). La forme logique est un 
graphe orient&#233; &#233;tiquet&#233; non ordonn&#233;, qui doit d&#233;terminer les fonctions syntaxiques dans des 
constructions &#224; probl&#232;mes, telles que le contr&#244;leur dans les infinitives et les r&#244;les syntaxiques 
dans les constructions avec d&#233;pendances &#224; longue distance (par exemple,  l&#8217;objet dans la 
phrase  le fichier de commandes que vous voulez traiter). La forme logique relie les formes 
actives et passives en leur donnant  la m&#234;me repr&#233;sentation ; elle exprime &#233;galement la 
quantification, et les anaphores sont r&#233;solues dans la forme logique, mais seulement au niveau 
de la phrase.  
</p>
<p>L&#8217;image 3 repr&#233;sente  la forme logique de la phrase analys&#233;e dans les images 1 et 2. La 
relation exprim&#233;e par le syntagme pr&#233;positionnel est repr&#233;sent&#233; par l&#8217;attribut TmeAt ; la 
relative par l&#8217;attribut Attrib, qui introduit &#233;galement les adjectifs modificateurs. Le sujet 
profond de vouloir est indiqu&#233;, de m&#234;me que les compl&#233;ments de traiter. 
</p>
<p>La forme logique est le but de l&#8217;analyse syntaxique, et &#233;galement la base de notre composant 
de transfert: en effet, l&#8217;alignement  est bas&#233; sur les formes logiques des segments align&#233;s dans 
les deux langues. 
</p>
<p> 
</p>
<p>Image  3 
</p>
<p>1.2 Le composant de transfert 
</p>
<p>A la base du composant de transfert sont les formes logiques de la langue source et de la 
langue cible, ce qui souligne l&#8217;importance de l&#8217;analyse linguistique dans notre syst&#232;me. Les 
formes logiques r&#233;sultant de l&#8217;analyse des corpus bilingues sont align&#233;es, phrase par phrase, 
et des correspondances de traduction entre mots isol&#233;s, structures ancr&#233;es dans des mots 
sp&#233;cifiques, ou syntagmes sont d&#233;duites de ces alignements. L&#8217;algorithme d&#8217;alignement 
proc&#232;de en deux phases. Durant la premi&#232;re phase, des correspondances lexicales sont 
&#233;tablies entre n&#339;uds individuels des graphes de la langue source et de la langue cible, sur la 
base d&#8217;un dictionnaire appris automatiquement. Dans la seconde phase, les n&#339;uds sont 
align&#233;s sur la base de l&#8217;information structurale en plus de l&#8217;information lexicale. L&#8217;alignement 
se fait &#224; partir des n&#339;uds dont la correspondance lexicale est la plus &#233;troite (meilleur d&#8217;abord, 
&#8216;best&#8212;first&#8217;). Une s&#233;rie de r&#232;gles d&#8217;alignement bas&#233;es sur l&#8217;information linguistique sont 
utilis&#233;es dans cette deuxi&#232;me phase. Plus de d&#233;tails et des exemples sont donn&#233;s dans 
(Menezes et Richardson 2001). 
</p>
<p>Le dictionnaire bilingue utilis&#233; dans la premi&#232;re phase d&#8217;alignement est appris 
automatiquement d&#8217;apr&#232;s un algorithme d&#233;crit dans (Moore 2001), &#224; partir des corpus 
</p>
<p>291 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jessie Pinkham et Martine Smets 
</p>
<p>bilingues d&#8217;apprentissage. Les corpus bilingues utilis&#233;s pour l&#8217;alignement comportent un 
nombre de phrases important : plus de 200.000 pour le corpus technique, et 500.000 pour le 
corpus du Hansard. Le corpus du Hansard est beaucoup plus g&#233;n&#233;ral que notre corpus 
technique, ce qui explique la diff&#233;rence de taille. Les correspondances extraites de cet 
alignement sont repr&#233;sent&#233;es comme une base de donn&#233;es d&#8217;exemples pour la traduction. 
Durant la traduction, cette base de donn&#233;es est consult&#233;e pour la traduction de termes isol&#233;s 
ou de syntagmes entiers. 
</p>
<p>2 Evaluations du syst&#232;me de traduction 
</p>
<p>2.1 M&#233;thode d&#8217;&#233;valuation 
</p>
<p>La m&#233;thode dont nous nous servons a &#233;t&#233; d&#233;crite dans plusieurs articles r&#233;cents (Richardson et 
al. 2001, Pinkham et al. 2001).  Nous traduisons un ensemble de phrases non vues avec notre 
syst&#232;me de traduction, et avec le syst&#232;me de comparaison, en l&#8217;occurrence le syst&#232;me 
fran&#231;ais-anglais de Systran.  Nous associons &#224; ces paires de traduction la phrase traduite par 
un traducteur humain, donc suppos&#233;e correcte. Ce trio de phrases est pr&#233;sent&#233; &#224; plusieurs 
&#233;valuateurs (entre 5 et 7), et les traductions automatiques sont pr&#233;sent&#233;es au hasard de fa&#231;on &#224; 
ce que les &#233;valuateurs n&#8217;en sachent pas la provenance. La traduction humaine, ou traduction 
de r&#233;f&#233;rence est clairement indiqu&#233;e.  Les &#233;valuateurs comparent les traductions 
automatiques, et notent celle qui est la plus proche de la traduction humaine comme &#233;tant la 
meilleure.  Lors du calcul des scores, une pr&#233;f&#233;rence pour notre syst&#232;me se traduit par un 
score de 1 et une pr&#233;f&#233;rence pour Systran par un score de -1. Le score 0 indique que les 
syst&#232;mes sont &#233;quivalents.  Nous utilisons de 250 &#224; 400 phrases dans chaque &#233;valuation.  
</p>
<p>2.2 Traduction pour le domaine technique (informatique) 
</p>
<p>Les progr&#232;s de notre syst&#232;me sont illustr&#233;s dans la Tableau 1, o&#249; nous indiquons tous les 
scores de novembre 2000 &#224; janvier 2002. Le score de novembre 2000, par exemple, indique 
que la performance de notre syst&#232;me &#233;tait sensiblement inf&#233;rieure &#224; celle de Systran (-0,50 sur 
une &#233;chelle de -1 &#224; 1. L&#8217;expression +/- 0,1 indique l&#8217;intervalle de confiance).  
</p>
<p>Date de 
l&#8217;&#233;valuation 
</p>
<p>Description du 
syst&#232;me  
</p>
<p>Score vs. 
Systran 
</p>
<p>Nombre de 
phrases 
</p>
<p>Novembre 2000 Syst&#232;me de base -0,50 +/- 0,1 308 
</p>
<p>F&#233;vrier 2001 Dictionnaire am&#233;lior&#233; -0,18 +/- 0,1 250 
</p>
<p>Mars 2001  Lexique bilingue appris 
du domaine 
</p>
<p>-0,14 +/- 0,11 250 
</p>
<p>Octobre 2001 Am&#233;liorations 
linguistiques 
</p>
<p>+0,20 +/- 0,1 250 
</p>
<p>Janvier 2002 Dictionnaires appris 
automatiquement 
</p>
<p>+0,28 +/- 0,11 400 
</p>
<p>   Tableau 1 : Progr&#232;s du syst&#232;me technique 
</p>
<p>292 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction automatique ancr&#233;e dans l&#8217;analyse linguistique 
</p>
<p>En novembre 2000, les modules du syst&#232;me existaient, mais n&#8217;avaient pas &#233;t&#233; appliqu&#233;s au 
fran&#231;ais-anglais. Nous avons cr&#233;&#233; une base de donn&#233;e (&#8216;example-base&#8217;) contenant des 
exemples de transfert &#224; partir de 200 000 paires de phrases techniques bilingues align&#233;es.  
Une premi&#232;re version tr&#232;s rudimentaire d&#8217;un dictionnaire bilingue a &#233;t&#233; employ&#233;e.  Les 
r&#233;sultats par rapport &#224; Systran &#233;taient assez mauvais (-0,5).  En f&#233;vrier 2001, nous avons 
remplac&#233; la premi&#232;re version du dictionnaire bilingue par une version de meilleure qualit&#233;, et 
les r&#233;sultats sont devenus meilleurs car les alignements se sont am&#233;lior&#233;s.  En mars, nous 
avons ajout&#233; un lexique de paires de mots appris directement des textes d&#8217;apprentissage, ce 
qui a apport&#233; une am&#233;lioration &#224; peine significative.  Ces r&#233;sultats sont expliqu&#233;s en d&#233;tail 
dans l&#8217;article de Pinkham et Corston-Oliver (2001a).  Pour examiner la contribution de 
chaque module du syst&#232;me, nous avions d&#233;cid&#233; de ne pas faire de modifications linguistiques 
pour l&#8217;analyse du fran&#231;ais, et de ne pas faire non plus de changements &#224; la g&#233;n&#233;ration de 
l&#8217;anglais motiv&#233;s par les probl&#232;mes du fran&#231;ais.  
</p>
<p>Nous avons attaqu&#233; les probl&#232;mes d&#8217;analyse du fran&#231;ais &#224; partir d&#8217;ao&#251;t 2001. Les 
am&#233;liorations linguistiques nous ont permis de d&#233;passer la qualit&#233; de Systran en octobre 2001, 
avec un score de +0,20, qui montre que les &#233;valuateurs ont trouv&#233; notre syst&#232;me meilleur que 
Systran dans ce domaine technique.  Bien s&#251;r, nous savons que seul notre syst&#232;me avait &#233;t&#233; 
entra&#238;n&#233; dans ce domaine.  L&#8217;importance du r&#233;sultat n&#233;anmoins, est que nous avons pu, en 
moins d&#8217;un an, avec un personnel tr&#232;s r&#233;duit (2 personnes pour le fran&#231;ais), am&#233;liorer la 
performance de notre syst&#232;me de fa&#231;on importante. 
</p>
<p>Les syst&#232;mes &#233;valu&#233;s jusqu&#8217;en octobre comprenaient un dictionnaire bilingue traditionnel.  
Nous avons &#233;t&#233; amen&#233;es alors &#224; &#233;liminer ce dictionnaire pour nous servir uniquement de 
dictionnaires de traductions appris des corpus eux-m&#234;mes (Pinkham et Smets 2002a, Pinkham 
et Smets 2002b).  L&#8217;&#233;valuation de janvier donne les r&#233;sultats d&#8217;un syst&#232;me qui ne comprend 
pas de dictionnaire bilingue traditionnel. Ce r&#233;sultat de +0,28 repr&#233;sente notre meilleur 
r&#233;sultat jusqu&#8217;&#224; pr&#233;sent.  Le meilleur score pour MSR-MT est en espagnol-anglais (+0,48), et 
nous sommes persuad&#233;es qu&#8217;avec davantage de travail linguistique, nous atteindrions des 
r&#233;sultats semblables. 
</p>
<p>2.2.1 Exemples de modifications linguistiques dans le corpus technique 
</p>
<p>Dans cette section, nous discutons du travail linguistique qui a &#233;t&#233; n&#233;cessaire pour am&#233;liorer 
la qualit&#233; de la traduction dans le domaine technique. Nous avons remarqu&#233; qu&#8217;un probl&#232;me 
li&#233; au corpus technique est l&#8217;utilisation tr&#232;s fr&#233;quente de groupes nominaux avec fonction 
d&#8217;apposition. Ces groupes nominaux sont le plus souvent des noms de commandes ou de 
menus. Un exemple illustratif est le syntagme nominal la commande pause. Ce syntagme 
pourrait &#234;tre analys&#233; en syntagme verbal (le sujet la commande suivi du verbe pauser)  ou en 
syntagme nominal, avec pause apposition de commande. Nous avons d&#251; modifier la 
grammaire pour obtenir l&#8217;analyse  correcte, tout en nous assurant que nous n&#8217;adaptions pas la 
grammaire &#224; ce domaine sp&#233;cifique mais pr&#233;servions les analyses correctes de notre corpus de 
r&#233;gression. D&#8217;autres exemples d&#8217;apposition incluent des syntagmes du type la bo&#238;te de 
dialogue Ouvrir un fichier. Dans cet exemple, la difficult&#233; vient du fait que l&#8217;apposition est 
en fait un syntagme verbal, mais qui dans ce cas doit &#234;tre analys&#233; comme syntagme nominal. 
La majuscule est un indice que ce syntagme est un nom de menu, mais il n&#8217;est pas toujours 
ais&#233; de d&#233;terminer o&#249; se termine le nom de menu (1). La phrase (2) pr&#233;sente un probl&#232;me 
similaire, la pr&#233;sence d&#8217;un syntagme verbal qui doit &#234;tre interpr&#233;t&#233; comme syntagme nominal. 
Ces deux phrases sont maintenant correctement analys&#233;es par notre syst&#232;me.  
</p>
<p>293 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jessie Pinkham et Martine Smets 
</p>
<p>(1) Si Dr. Watson ne peut pas utiliser le chemin sp&#233;cifi&#233; pour cr&#233;er un fichier de vidage sur 
incident, la bo&#238;te de dialogue Ouvrir un fichier s'affiche pour vous permettre de sp&#233;cifier un 
nouveau chemin  
</p>
<p>(2) Si vous souhaitez toujours utiliser le rappel, cliquez sur Toujours me rappeler au(x) ou 
aux num&#233;ro(s) ci-dessous, et s&#233;lectionnez le modem ou le p&#233;riph&#233;rique &#224; rappeler. 
</p>
<p>Nous avons d&#251; &#233;galement r&#233;soudre des probl&#232;mes d&#8217;analyse plus g&#233;n&#233;raux afin d&#8217;am&#233;liorer 
notre performance, tels que d&#233;sambigu&#239;ser des, qui peut &#234;tre une pr&#233;position ou un 
d&#233;terminant, d&#233;sambigu&#239;ser entre participe pass&#233; et participe passif, etc. Enfin, nous nous 
sommes &#233;galement pench&#233;s sur la traduction d&#8217;idiomes tels que  mettre &#224; jour, mettre &#224; 
niveau, prendre en charge, etc. (Menezes et al. 2002) 
</p>
<p>Au niveau du rattachement, de nombreux syntagmes ont la structure SN de N SN (apposition) 
SA/SV, pour lesquels le syntagme adjectival (SA) ou verbal doit &#234;tre rattach&#233; &#224; la t&#234;te du 
premier groupe nominal. Par exemple, dans la phrase (3),  la participiale d&#233;fini dans&#8230; est 
rattach&#233;e &#224; protocole. La r&#232;gle de rattachement se base sur le fait que la structure SN de N 
sans d&#233;terminant indique un type d&#8217;objet (identifi&#233; par l&#8217;apposition) et qu&#8217;un modificateur 
suivant l&#8217;apposition est en g&#233;n&#233;ral attach&#233; &#224; la t&#234;te du  premier SN. 
</p>
<p>(3) Les serveurs d'acc&#232;s distant et leurs clients utilisent le protocole de configuration PPP 
IPXCP (IPX ///Configuration Protocol) d&#233;fini dans RFC 15552, &#171; The PPP Internetwork 
Packet Exchange Control Protocol (IPXCP) &#187; pour configurer la connexion d'acc&#232;s distant 
pour IPX.   
</p>
<p>En am&#233;liorant l&#8217;analyse de ce type de phrases, nous facilitons l&#8217;alignement des textes 
bilingues qui est n&#233;cessaire &#224; la cr&#233;ation de la base d&#8217;exemples de traduction. 
</p>
<p>2.3 Traduction pour le corpus du Hansard 
</p>
<p>Le corpus du Hansard est compos&#233; de d&#233;bats parlementaires canadiens.  Nous avons construit 
une base de donn&#233;es d&#8217;exemples (&#8216;example-base&#8217;) avec 500 000 phrases align&#233;es.  Ces 
phrases ont &#233;t&#233; prises au hasard dans les 1,3 million de phrases disponibles sur le site web de 
Ulrich Germann (http://www.isi.edu/natural-language/download/hansard/index.html).   
</p>
<p>Les r&#233;sultats de l&#8217;&#233;valuation sont pr&#233;sent&#233;s dans le Tableau 2. 
</p>
<p>Date de 
l&#8217;&#233;valuation 
</p>
<p>Description du 
syst&#232;me  
</p>
<p>Score vs. 
Systran 
</p>
<p>Nombre de 
phrases 
</p>
<p>Janvier 2002 Syst&#232;me de base sans 
changements 
</p>
<p>-0,16 +/- .12 250 
</p>
<p>Tableau 2: Traduction de texte Hansard 
</p>
<p>Le score de -0,16 montre que notre syst&#232;me g&#233;n&#233;ral est pour l&#8217;instant moins bon que Systran.  
Pour ce test, nous avons incorpor&#233; plusieurs dictionnaires sp&#233;cialis&#233;s de Systran (politique, 
&#233;conomique, etc.) et nous consid&#233;rons que le Hansard est un domaine g&#233;n&#233;ral o&#249; 
l&#8217;entra&#238;nement est moins avantageux.  Mais si nous comparons ce score au score technique, 
nous pouvons noter que nous &#233;tions au m&#234;me point en mars de 2001, et que nous avons r&#233;ussi 
</p>
<p>294 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction automatique ancr&#233;e dans l&#8217;analyse linguistique 
</p>
<p>&#224; am&#233;liorer le syst&#232;me en six mois.  Nous pensons donc que nous pourrons am&#233;liorer la 
traduction de la m&#234;me fa&#231;on. Les plus gros probl&#232;mes que nous voyons sont des probl&#232;mes 
d&#8217;analyse. 
</p>
<p>2.3.1 Exemples de probl&#232;mes linguistiques dans le corpus Hansard 
</p>
<p>Texte original R&#233;f&#233;rence MSR_MT Systran Classes de probl&#232;me 
</p>
<p>Monsieur le Pr&#233;sident, 
ma question 
suppl&#233;mentaire, qui 
s'adresse encore une 
fois au ministre, est 
tr&#232;s simple. 
</p>
<p>Mr. Speaker, my 
supplementary 
question again to 
the minister is very 
simple. 
</p>
<p>My supplementary 
question, which is 
once again to the 
minister, is very 
simple Mr. Speaker. 
</p>
<p>Mr. President, my 
additional 
question, which is 
addressed to the 
minister once 
again, is very 
simple 
</p>
<p> 
 
Vocatif 
</p>
<p>C'est la seule arme 
qu'il leur reste. 
</p>
<p>It is the only tool we 
have left. 
</p>
<p>It is the only weapon 
that it remains for 
them. 
</p>
<p>It is the only 
weapon that it 
remains for them. 
</p>
<p> 
Verbe impersonnel
</p>
<p>Le v&#233;ritable probl&#232;me, 
ce sont les 
r&#233;cidivistes. 
</p>
<p>The real problem is 
the repeat 
offenders. 
</p>
<p>The real problem, it is 
the recidivists. 
</p>
<p>The true problem, 
they are the 
recidivists. 
</p>
<p>Compl&#233;ment 
disloqu&#233; &#224; gauche
</p>
<p>Quand la ministre 
entend-elle agir? 
</p>
<p>When does the 
minister intend to 
act ? 
</p>
<p>When does the 
minister intend for it to 
act? 
</p>
<p>When the minister 
intend does to act? 
</p>
<p>Sujet double avec 
pronom dans les 
interrogatives 
</p>
<p>  Tableau 3 :  Classes d&#8217;erreurs &#224; corriger pour le domaine g&#233;n&#233;ral 
</p>
<p>Les exemples pr&#233;sent&#233;s dans le Tableau 3 illustrent certaines constructions o&#249; nous savons 
que nous pouvons faire des progr&#232;s en am&#233;liorant l&#8217;analyse du fran&#231;ais et de l&#8217;anglais si 
n&#233;cessaire.  Ces constructions sont typiques du style parl&#233;, ce qui explique que nous n&#8217;ayons 
pas rencontr&#233; beaucoup de cas jusqu&#8217;&#224; pr&#233;sent dans nos fichiers de r&#233;gression.   
</p>
<p>Le vocatif est tr&#232;s courant dans le corpus du Hansard. Lorsque le vocatif n&#8217;est pas reconnu 
comme tel par la grammaire, il risque de devenir l&#8217;objet direct ou indirect de la phrase par 
erreur.  Dans la traduction MSR-MT (ligne 1 du tableau), nous remarquons qu&#8217;il n&#8217;a pas &#233;t&#233; 
reconnu correctement, et n&#8217;est pas plac&#233; en t&#234;te de phrase.  Un autre exemple &#224; corriger dans 
notre repr&#233;sentation est la dislocation du nom &#224; gauche (ligne 3).  En corrigeant la forme 
logique, nous pourrons facilement arriver &#224; la traduction mod&#232;le de la r&#233;f&#233;rence, et donc 
d&#233;passer la qualit&#233; de la traduction de Systran.  Les autres erreurs, elles aussi typiques du 
langage parl&#233;, pourront &#234;tre corrig&#233;es dans notre syst&#232;me d&#8217;analyse. 
</p>
<p>3. Conclusion 
</p>
<p>La traduction de MSR-MT d&#233;passe la qualit&#233; de la traduction de Systran dans le domaine 
technique, gr&#226;ce en partie au travail linguistique sur les analyses du fran&#231;ais.  Nos r&#233;sultats 
dans un domaine plus g&#233;n&#233;ral (Hansard) montrent que la traduction est assez proche de la 
qualit&#233; de Systran, bien que nous n&#8217;ayons pour l&#8217;instant fait aucun travail sp&#233;cifique au 
domaine. Nous avons identifi&#233; des probl&#232;mes linguistiques auxquels nous devons nous 
adresser pour am&#233;liorer la qualit&#233; de notre traduction automatique dans ce nouveau domaine. 
</p>
<p>Bibliographie 
</p>
<p>295 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jessie Pinkham et Martine Smets 
</p>
<p>296 
</p>
<p>Al-Onaizan Y, Curin J., Jahr M., Knight K., Lafferty J., Melamed D., Och F-J, Purdy D., Smith N. A., 
Yarowsky D. (1999), Statistical Machine Translation: Final Report, Johns Hopkins University 1999 Summer 
Workshop on Language Engineering, Center for Speech and Language Processing, Baltimore, MD. 
</p>
<p>Boitet C. (2001), M&#233;thodes d'acquisition lexicale en TAO : des dictionnaires sp&#233;cialis&#233;s propri&#233;taires aux bases 
lexicales g&#233;n&#233;ralistes et ouvertes, Actes de l&#8217;Atelier sur la Traduction automatique et applications en 
grandeur r&#233;elle, TALN 2001. 
</p>
<p>Brown P., Della Pietra S., Della Pietra V., Mercer R. (1993), The mathematics of statistical machine translation, 
Computational Linguistics, 19, 263-312. 
</p>
<p>Dorr B. (1993), Interlingual Machine Translation: a Parameterized Approach,  Artificial Intelligence 63(1&amp;2), 
429-492. 
</p>
<p>Dorr Bonnie, Johnson P, Benoit J (1999), A Survey of Current Paradigms in Translation, Advances in 
Computers, Vol. 49, M. Zelkowitz (Ed), Academic Press, London, 1-68. 
</p>
<p>Kaji H., Kida Y., Morimoto Y. (1992), Learning Translation Templates from Bilingual Text, Actes de COLING 
1992, 672-678. 
</p>
<p>Heidorn G. (2000), Intelligent Writing Assistance, Handbook of Natural Language Processing, Robert Dale, 
Hermann Moisl et Harold Somers, eds., 181-207.  
</p>
<p>Hutchins W. J. (2001), Machine Translation over fifty years, Histoire Epist&#233;mologie Langage vol. 23 (1), 7-31. 
Jensen K  (1993), The PLNLP English grammar, Natural Language Processing: The PLNLP approach Jensen 
</p>
<p>K., Heidorn G. et Richardson S. eds. Boston: Kluwer Academic. 
Meyers A., Kosaka M., Grishman R. (2000), Chart-based transfer rule application in machine translation, Actes 
</p>
<p>de COLING 1998, 843-847. 
Menezes A., Richardson S. (2001), A best-first alignment algorithm for automatic extraction of transfer 
</p>
<p>mappings from bilingual corpora, Proceedings of the Workshop on Data-Driven Machine Translation, ACL 
Conference, 39-46. 
</p>
<p>Nyberg E., Mitamura T. (1991), An Efficient Interlingua Translation System for Multilingual Document 
Production, Actes de MT Summit III, 55-61. 
</p>
<p>Pinkham J. and Corston-Oliver M. (2001a), Adding Domain Specificity to an MT system, Proceedings of the 
Workshop on Data-Driven Machine Translation, ACL Conference, 103-110. 
</p>
<p>Pinkham J., Corston-Oliver M., Smets M., Pettenaro M. (2001b), Rapid assembly of a large-scale French-
English MT system,  Actes de MT Summit VIII, 277-282. 
</p>
<p>Pinkham.J., Smets M. (2002a), Machine Translation without a Bilingual Dictionary, Actes de TMI, 146-156. 
Pinkham J., Smets M. (2002b), Modular MT with a learned bilingual dictionary: rapid deployment of a new 
</p>
<p>language pair, A para&#238;tre dans  Actes de COLING 2002. 
Poyen J., Vauquois B. (1959), A propos d'un langage universel, IFIP Congress 1959, 132-137. 
Richardson S., Dolan W., Menezes A., Corston-Oliver M. (2001), Overcoming the Customisation Bottleneck 
</p>
<p>Using Example-Based MT, Proceedings of the Workshop on Data-Driven Machine Translation, ACL 
Conference, 9-16. 
</p>
<p>Menezes A., Pentheroudakis J., Smets M. (2002), Translation of verbal idioms, A para&#238;tre dans Proceedings of 
International Workshop on Computational Approaches to Collocations. 
</p>
<p>Moore R.C. (2001), Towards a Simple and Accurate Statistical Approach to Learning Translation Relationships 
among Words, Proceedings of the Workshop on Data-Driven Machine Translation, ACL Conference, 79-86 
</p>
<p>Vauquois B. (1968), A Survey of Formal Grammars and Algorithms for Recognition and Transformation in 
Machine Translation, IFIP Congress 68, 254-260. 
</p>
<p>Watanabe H., Kurohashi S. and Aramaki E. (2000), Finding Structural Correspondences from Bilingual Parsed 
Corpus for Corpus-based Translation, Actes de COLING 2000, 906-912. 
</p>
<p> </p>

</div></div>
</body></html>