<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Nemesis, un syst&#232;me de reconnaissance incr&#233;mentielle des entit&#233;s nomm&#233;es pour le fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Nemesis, un syst&#232;me de reconnaissance incr&#233;mentielle des
entit&#233;s nomm&#233;es pour le fran&#231;ais
</p>
<p>Nordine Fourour
Institut de Recherche en Informatique de Nantes - Universit&#233; de Nantes
</p>
<p>2, chemin de la Houssini&#232;re - BP 92208 - 44322 Nantes Cedex 3, France
fourour@irin.univ-nantes.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Entit&#233;s nomm&#233;es, reconnaissance incr&#233;mentielle, apprentissage, surcomposition r&#233;f&#233;rentielle
Name Entities, incremental recognition, learning processing, referential composition
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article pr&#233;sente une &#233;tude des conflits engendr&#233;s par la reconnaissance des entit&#233;s nomm&#233;es
(EN) pour le fran&#231;ais, ainsi que quelques indices pour les r&#233;soudre. Cette reconnaissance est
r&#233;alis&#233;e par le syst&#232;me Nemesis, dont les sp&#233;cifications ont &#233;t&#233; &#233;labor&#233;es cons&#233;quemment &#224; une
&#233;tude en corpus. Nemesis se base sur des r&#232;gles de grammaire, exploite des lexiques sp&#233;cial-
is&#233;s et comporte un module d&#8217;apprentissage. Les performances atteintes par Nemesis, sur les
anthroponymes et les toponymes, sont de 90 % pour le rappel et 95 % pour la pr&#233;cision.
</p>
<p>This paper presents an investigation of the conflicts generated by the recognition of the French
proper names (PN), and some indications to solve them. This recognition is carried out by
the Nemesis system, whose specifications have been elaborated through corpus investigation.
Nemesis is grammar-rule based, uses specialised lexicons, and includes a learning module. The
system performance, evaluated on the categories composing the anthroponym and the toponym
classes, achieves 95 % precision and 90 % recall.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nordine Fourour
</p>
<p>1 Introduction
</p>
<p>La reconnaissance des noms propres fran&#231;ais est un probl&#232;me qui se pose dans les diff&#233;rents
domaines du traitement automatique de la langue naturelle (TALN) : veille technologique, in-
dexation de textes ou traduction (Daille &amp; Morin, 2000). Cette reconnaissance a &#233;t&#233; convenable-
ment r&#233;alis&#233;e en extraction d&#8217;information (EI) pour des textes journalistiques anglais (pr&#233;cision
et rappel sup&#233;rieurs &#224; 90 %) (MUC-7, 1998).
Pour le fran&#231;ais, comme pour l&#8217;anglais (Wacholder et al., 1997), cette reconnaissance se heurte
aux probl&#232;mes d&#8217;ambigu&#239;t&#233; li&#233;s aux majuscules en d&#233;but de phrase (Mikheev, 1999) et &#224; la
localisation des limites &#224; droite du nom propre : modification adjectivale et attachement des
pr&#233;positions et des coordinations, possibilit&#233; que certains noms propres soient compos&#233;s en
quasi totalit&#233; de mots en minuscules. En plus de cette ambigu&#239;t&#233;, se posent les probl&#232;mes de
surcomposition : une EN complexe peut contenir une EN d&#8217;une autre cat&#233;gorie r&#233;f&#233;rentielle
(e.g. Guerre d&#8217;Alg&#233;rie, Universit&#233; de Nantes). Pour traiter ces probl&#232;mes, nous avons &#233;tudi&#233; les
conflits qu&#8217;ils engendraient sur la reconnaissance des EN et proposons des heuristiques pour les
traiter.
</p>
<p>Apr&#232;s une pr&#233;sentation de l&#8217;architecture logicielle de Nemesis (cf. section 2) pr&#233;cisant le r&#244;le
des lexiques et le formalisme retenu pour la conception des r&#232;gles, nous nous penchons sur la
d&#233;sambigu&#239;sation des conflits pos&#233;s par l&#8217;identification des bornes des entit&#233;s nomm&#233;es (EN)
et proposons deux m&#233;thodes pour l&#8217;inf&#233;rence de nouvelles r&#232;gles (cf. section 3). Enfin, nous
pr&#233;sentons nos conclusions et les perspectives qu&#8217;ouvre notre travail (cf. section 4).
</p>
<p>2 Architecture logicielle
</p>
<p>texte avec balisage
des entit&#233;s nomm&#233;es
</p>
<p>lexical Apprentissagedes EN
Reconnaissance
</p>
<p>(premi&#232;re passe) (deuxi&#232;me passe)
Reconnaissance
</p>
<p>des EN
</p>
<p>lexiques
</p>
<p>Pretraitement
</p>
<p>heuristiques
</p>
<p>texte brut
</p>
<p>r&#232;gles
</p>
<p>Figure 1: Architecture du syst&#232;me Nemesis
</p>
<p>Les sp&#233;cifications de notre syst&#232;me de reconnaissance des entit&#233;s nomm&#233;es ont &#233;t&#233; r&#233;alis&#233;es
&#224; la suite d&#8217;une &#233;tude en corpus (Daille et al., 2000) et s&#8217;appuient sur des crit&#232;res graphiques
et r&#233;f&#233;rentiels. Apr&#232;s avoir montr&#233;, dans cette &#233;tude, les limites de la cat&#233;gorisation &#224; quatre
classes exploit&#233;e dans le cadre des conf&#233;rences MUC (MUC-7, 1998), nous avons pr&#233;sent&#233; une
typologie g&#233;n&#233;rale la plus compl&#232;te possible, bas&#233;e sur celle de Grass (2000).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nemesis, un syst&#232;me de reconnaissance incr&#233;mentielle des entit&#233;s nomm&#233;es pour le fran&#231;ais
</p>
<p>Nemesis, &#233;labor&#233; cons&#233;quemment &#224; cette &#233;tude, est un syst&#232;me qui permet l&#8217;identification des
bornes des EN, ainsi que leur cat&#233;gorisation selon cette typologie. Son architecture, pr&#233;sent&#233;e &#224;
la figure 1, se compose de quatre modules qui effectuent un traitement s&#233;quentiel imm&#233;diat des
donn&#233;es : pr&#233;traitement lexical, premi&#232;re reconnaissance des entit&#233;s nomm&#233;es, apprentissage et
seconde reconnaissance des entit&#233;s nomm&#233;es.
</p>
<p>2.1 Pr&#233;traitement lexical
</p>
<p>Il s&#8217;agit d&#8217;un processus &#224; deux phases : segmentation du texte en phrases et en formes, puis
association des sigles et de leur forme &#233;tendue, &#233;tape bas&#233;e sur les travaux de Morin (1999).
Wolinski et al. (1995) et Wacholder et al. (1997) utilisent l&#8217;association entre les sigles et leur
forme &#233;tendue, mais uniquement pour les cor&#233;f&#233;rences en ce qui concerne Wacholder et al.
(1997).
</p>
<p>2.2 Premi&#232;re reconnaissance
</p>
<p>2.2.1 Projection des lexiques
</p>
<p>La projection a lieu en trois &#233;tapes : 1) passage du texte en fichier inverse (Salton &amp; McGill,
1983) pour limiter les acc&#232;s disque ; 2) projection : les &#233;tiquettes s&#233;mantiques li&#233;es aux lexiques
sont associ&#233;es aux diff&#233;rentes formes du texte ; 3) &#233;tiquetage des mots commen&#231;ant par une
majuscule et absents des lexiques par NP.
Il a &#233;t&#233; d&#233;montr&#233; que l&#8217;utilisation de lexiques sp&#233;cialis&#233;s &#233;tait la base de tout syst&#232;me de recon-
naissance des noms propres (McDonald, 1994; Wakao et al., 1996). Nos lexiques ont &#233;t&#233; con-
struits soit manuellement, soit automatiquement, en exploitant des ressources textuelles (pages
Web, etc.). Les &#233;l&#233;ments composant ces lexiques peuvent tenir un ou plusieurs r&#244;les : EN
(l&#8217;&#233;l&#233;ment est une entit&#233; nomm&#233;e connue : OMS, Alexandre, Canal+), mot d&#233;clencheur
(l&#8217;&#233;l&#233;ment fait partie de l&#8217;entit&#233; nomm&#233;e : F&#233;d&#233;ration, Boulevard), contexte (l&#8217;&#233;l&#233;ment ap-
partient au contexte gauche imm&#233;diat de l&#8217;EN, mais ne fait pas partie de celle-ci : philosophe,
fran&#231;ais), fin d&#8217;EN (l&#8217;&#233;l&#233;ment est la derni&#232;re forme composant l&#8217;entit&#233; nomm&#233;e : football,
r&#233;gional), &#233;l&#233;ment d&#8217;EN (il s&#8217;agit de tout les &#233;l&#233;ments lexicaux pouvant faire partie de l&#8217;EN,
mais sans en permettre la d&#233;limitation ou la cat&#233;gorisation).
</p>
<p>Patronymes Organisations Ensembles artistiques
</p>
<p>noms de pays
</p>
<p>PaysVilles &lt; Toponymes &lt; Pays
</p>
<p>4,5
</p>
<p>1,2,4,51,2,4,5
</p>
<p>4,5 4
</p>
<p>EthnonymesPatronymes
</p>
<p>noms de nationalit&#233;
</p>
<p>Organisations
</p>
<p>4,5
</p>
<p>1,23
</p>
<p>Figure 2: Deux lexiques et leur r&#244;les selon les cat&#233;gories r&#233;f&#233;rentielles
</p>
<p>Nous pouvons donc assigner des r&#244;les &#224; nos lexiques, en fonction des cat&#233;gories r&#233;f&#233;rentielles
dans lesquelles ils sont utilis&#233;s. Cette assignation peut &#234;tre visualis&#233;e sous deux angles :
en prenant comme point central, soit une cat&#233;gorie r&#233;f&#233;rentielle (e.g. la reconnaissance des
patronymes utilise les &#233;l&#233;ments du lexique des noms de pays comme fin d&#8217;EN ou &#233;l&#233;ment</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nordine Fourour
</p>
<p>d&#8217;EN (cf. figure 3)), soit un lexique (les &#233;l&#233;ments du lexique des noms de pays sont utilis&#233;s
uniquement comme fin d&#8217;EN pour la reconnaissance des ensembles artistiques (cf. figure 2)).
</p>
<p>1 EN
Mot D&#233;clencheur2
Contexte3
</p>
<p>4 Fin d&#8217;EN
&#201;l&#233;ment d&#8217;EN5
</p>
<p>P
A
T
R
O
N
Y
M
E
S
</p>
<p>adjectifs de nationalit&#233;
article en minuscules
</p>
<p>initiales
m&#233;tiers
</p>
<p>3
</p>
<p>2,5
</p>
<p>4
</p>
<p>3
</p>
<p>3
</p>
<p>3
</p>
<p>3
3
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
</p>
<p>4,5
4,5
</p>
<p>4,5
4,5
</p>
<p>3
</p>
<p>5
</p>
<p>3
</p>
<p>3
</p>
<p>3
2
3
</p>
<p>2,4,5
</p>
<p>titres religieux
</p>
<p>pr&#233;noms
points cardinaux
</p>
<p>numeros dynastiques
</p>
<p>titres administratifs
</p>
<p>titres de civilit&#233;
titres civils
</p>
<p>noms de departements
noms de continents
</p>
<p>noms de villes fran&#231;aises
noms de villes &#233;trang&#232;res
</p>
<p>noms de provinces canadiennes
noms de regions &lt; pays
noms de regions &gt; pays
</p>
<p>noms de regions fran&#231;aises
</p>
<p>noms d&#8217;hydronymes
</p>
<p>noms de rivi&#232;res
</p>
<p>noms de nationalit&#233;
noms d&#8217;oronymes
</p>
<p>noms de mers et d&#8217;oceans
</p>
<p>noms de pays
</p>
<p>nom d&#8217;etats am&#233;ricains
</p>
<p>titres militaires
</p>
<p>particules patronymiques en minuscules
particules patronymiques comman&#231;ant par une majuscule
</p>
<p>titres de noblesse
</p>
<p>Figure 3: R&#244;les des lexiques pour la reconnaissance des patronymes
</p>
<p>Chaque cat&#233;gorie r&#233;f&#233;rentielle utilise un nombre r&#233;duit de lexiques (cf. tableau 1). Sur nos 45
lexiques, regroupant 60 761 &#233;l&#233;ments, seuls les patronymes et les organisations utilisent plus
de 10 lexiques. Ce nombre plus important s&#8217;explique par la grande vari&#233;t&#233; de mots pouvant
composer les EN de ces deux cat&#233;gories.
</p>
<p>ANTHROPONYMES
Patronymes 29 Pr&#233;noms 1 Ethnonymes 3
Organisations 45 Ensembles artistiques 6
</p>
<p>TOPONYMES
Toponymes &#0; Pays 5 Pays 1 Villes &#1; Toponymes &#1; Pays 10
Villes 2 Microtoponymes 2 Hydronymes 4
Oronymes 3 Rues 2 &#201;difices 5
</p>
<p>Table 1: Nombre de lexiques utilis&#233;s par cat&#233;gorie r&#233;f&#233;rentielle
</p>
<p>2.2.2 Application des r&#232;gles
</p>
<p>Une fois la projection des lexiques r&#233;alis&#233;e, les r&#232;gles lexico-s&#233;mantiques de r&#233;&#233;criture sont
appliqu&#233;es, afin de permettre une premi&#232;re reconnaissance des entit&#233;s nomm&#233;es. Ces r&#232;gles
s&#8217;appuient essentiellement sur l&#8217;&#233;vidence interne d&#233;finie par McDonald (1994) et utilisent des
patrons bas&#233;s sur les &#233;tiquettes s&#233;mantiques correspondant aux lexiques. Voici le formalisme
retenu pour la conception de ces r&#232;gles :
</p>
<p>&#0; &#0; , une r&#232;gle de r&#233;&#233;criture ;
&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#1; &#2;&#3;&#4;&#0;&#5;&#6;&#7;&#8;&#9;&#5;
</p>
<p>&#2;
</p>
<p>, la forme g&#233;n&#233;rale de &#0; ;
&#0; &#1;
</p>
<p>&#2;
</p>
<p>, le patron de &#0; ;
&#0; &#2;&#3;&#4;&#0;&#5;&#6;&#7;&#8;&#9;&#5;
</p>
<p>&#2;
</p>
<p>, la cat&#233;gorie r&#233;f&#233;rentielle de la balise &#224; poser par &#0; (Patronyme, Pays, etc.) ;
&#0; &#1;&#10;
</p>
<p>&#0;
</p>
<p>&#2;
</p>
<p>&#11; &#10;
</p>
<p>&#3;
</p>
<p>&#2;
</p>
<p>&#2;, un intervalle discret, repr&#233;sentant &#1;
&#2;
</p>
<p>, avec &#10;&#0;
&#2;
</p>
<p>et &#10;&#3;
&#2;
</p>
<p>les &#233;l&#233;ments de d&#233;but et
de fin (resp.) du patron ;
</p>
<p>&#0; &#10;
</p>
<p>&#4;
</p>
<p>&#2;
</p>
<p>, le &#9;&#1;&#5;&#6;&#5; &#233;l&#233;ment de &#1;
&#2;
</p>
<p>, pouvant &#234;tre :
forme une forme quelconque (e.g. la forme &#233;quipe peut &#234;tre directement recherch&#233;e) ;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nemesis, un syst&#232;me de reconnaissance incr&#233;mentielle des entit&#233;s nomm&#233;es pour le fran&#231;ais
</p>
<p>balise une &#233;tiquette s&#233;mantique r&#233;f&#233;rant &#224; une forme appartenant &#224; un lexique (e.g. un
nom de pays, un m&#233;tier, un mot cl&#233; d&#8217;organisation, etc.) ;
</p>
<p>np une &#233;tiquette r&#233;f&#233;rant &#224; une forme n&#8217;appartenant pas &#224; un lexique, mais commen&#231;ant
par une majuscule.
</p>
<p>Au niveau de l&#8217;impl&#233;mentation (sous forme d&#8217;expressions r&#233;guli&#232;res), nous distinguons les
balises et les np des formes en faisant pr&#233;c&#233;der les premiers d&#8217;un dollar. &#192; chaque &#10;&#4;
</p>
<p>&#2;
</p>
<p>peut
&#234;tre associ&#233; un quantificateur : ? (0 ou 1 fois), + (1 fois ou plus), * (0 fois ou plus). La partie de
&#1;
</p>
<p>&#2;
</p>
<p>&#224; baliser est mise entre crochets. Certaines r&#232;gles sont &#171; factoris&#233;es &#187; : si plusieurs r&#232;gles
ont exactement la m&#234;me forme &#224; un &#10;&#4;
</p>
<p>&#2;
</p>
<p>pr&#234;t, elles sont unifi&#233;es en rempla&#231;ant le &#10;&#4;
&#2;
</p>
<p>diff&#233;rent
par une variable repr&#233;sentant l&#8217;un ou l&#8217;autre (&#12; &#13; &#14; &#1; &#14;&#3;&#4;
</p>
<p>&#0;
</p>
<p>et &#12; &#13; &#15; &#1; &#14;&#3;&#4;
&#0;
</p>
<p>donnent &#12; &#13;
&#14;&#7;&#16;&#15;&#1; &#14;&#3;&#4;
</p>
<p>&#0;
</p>
<p>).
&#192; chaque &#10;&#4;
</p>
<p>&#2;
</p>
<p>peut &#234;tre associ&#233; un r&#244;le. Les premiers &#233;l&#233;ments des patrons regroupent les
formes poss&#233;dant les r&#244;les de contexte ou de mot d&#233;clencheur, alors que les derniers ont
plut&#244;t pour r&#244;le fin d&#8217;EN. Ces derniers sont donc moins &#171; fiables &#187;, car ils ne permettent pas
de cat&#233;goriser les EN, ni d&#8217;en identifier la pr&#233;sence, mais simplement d&#8217;en d&#233;finir la limite &#224;
droite. Quant aux &#233;l&#233;ments de type &#233;l&#233;ment d&#8217;EN, ils sont encore moins fiables de par leur
nature. Nous avons con&#231;u 53 r&#232;gles de cette forme, comme :
$Cl&#233;_hydro $Article_min+ [$NP+] &#0; Hydronyme
(rives de la Kamogawa ou eaux du Yangtze Kiang).
$Titre_militaire $Adj_nationalit&#233;? [$Pr&#233;nom* $NP] &#0; Patronyme
(commandant Massoud ou g&#233;n&#233;ral bosno-serbe Ratko Mladic).
</p>
<p>2.3 Apprentissage et seconde reconnaissance
</p>
<p>La mise &#224; jour des lexiques a &#233;t&#233; abord&#233;e par certains syst&#232;mes (Poibeau, 1999; Cucchiarelli
et al., 1998), mais pose encore un grand nombre de probl&#232;mes. La mise en place d&#8217;un tel module
vise deux objectifs : la r&#233;solution de certaines cor&#233;f&#233;rences et l&#8217;identification de nouvelles
entit&#233;s.
</p>
<p>Pour am&#233;liorer les performances de notre syst&#232;me, nous avons mis au point une m&#233;thode bas&#233;e
sur des heuristiques, afin de cr&#233;er automatiquement de nouveaux lexiques (Fourour, 2001).Ces
heuristiques sont au nombre de 22 pour les patronymes et 3 pour les toponymes.
</p>
<p>Apr&#232;s avoir &#233;t&#233; ainsi obtenus, ces lexiques sont de nouveau projet&#233;s sur le corpus (c.f. section
pr&#233;c&#233;dente).
La mise en place de ce processus apporte une am&#233;lioration non n&#233;gligeable aux performances
de Nemesis (+0,6 % pour la pr&#233;cision et +5,3 % pour le rappel) tout en &#233;tant tr&#232;s fiable (Fourour,
2001).
</p>
<p>3 Conflits
</p>
<p>Les probl&#232;mes de conflits engendr&#233;s par la reconnaissance des entit&#233;s nomm&#233;es sont r&#233;currents
dans les syst&#232;mes que nous avons rencontr&#233;s. Poibeau (1999), s&#8217;il d&#233;finit trois heuristiques pour
l&#8217;application de ses r&#232;gles de r&#233;&#233;criture, ne g&#232;re pas la r&#233;solution des conflits. Trouilleux (1997)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nordine Fourour
</p>
<p>lui g&#232;re, a priori, quelques cas d&#8217;ambigu&#239;t&#233; (noms de lieu qui peuvent entrer dans la composition
de patronymes ou d&#8217;organisations) et de composition (pour les organisations). Friburger (2001)
d&#233;finit, a priori, un ordre &#224; l&#8217;application de ses transducteurs, afin de traiter le cas de l&#8217;ambigu&#239;t&#233;
de composition entre les noms de personne et d&#8217;organisation.
</p>
<p>&#192; partir des r&#232;gles lexico-s&#233;mantiques de r&#233;&#233;critures &#233;labor&#233;es, nous avons &#233;tudi&#233; les probl&#232;mes
que leur application peut engendrer : au niveau conceptuel tout d&#8217;abord (sur les patrons de
r&#232;gles), puis, au niveau exp&#233;rimental (sur les entit&#233;s nomm&#233;es reconnues).
</p>
<p>3.1 &#201;tude conceptuelle
Nous avons analys&#233; l&#8217;ensemble de nos r&#232;gles, afin d&#8217;identifier les diff&#233;rentes fa&#231;ons dont elles
pouvaient entrer en conflit et comment r&#233;duire a priori la r&#233;alisation de ces conflits sur les EN
reconnues (ambigu&#239;t&#233;s sur l&#8217;identification ou la cat&#233;gorisation).
Prenons comme exemple les deux r&#232;gles suivantes :
</p>
<p>&#1;&#10;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#11; &#10;
</p>
<p>&#3;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#2;&#1; &#2;&#3;&#4;&#0;&#5;&#6;&#7;&#8;&#9;&#5;
</p>
<p>&#0;
</p>
<p>(1)
&#1;&#10;
</p>
<p>&#0;
</p>
<p>&#2;
</p>
<p>&#11; &#10;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#2;
</p>
<p>&#2;&#1; &#2;&#3;&#4;&#0;&#5;&#6;&#7;&#8;&#9;&#5;
</p>
<p>&#2;
</p>
<p>(2)
</p>
<p>3.1.1 Chevauchement de patrons
</p>
<p>D&#233;finition 1 Il y a un conflit de chevauchement de patrons de (2) sur (1) &#2;&#3; &#4; &#9;,&#17; &#5; &#0; &#2;
(&#3; &#18; &#9; &#6; &#19;
</p>
<p>&#0;
</p>
<p>et &#3; &#6; &#17; &#18; &#19;
&#2;
</p>
<p>) tels que &#1;&#10;&#4;
&#0;
</p>
<p>&#11; &#10;
</p>
<p>&#3;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#2; &#4; &#1;&#10;
</p>
<p>&#0;
</p>
<p>&#2;
</p>
<p>&#11; &#10;
</p>
<p>&#7;
</p>
<p>&#2;
</p>
<p>&#2;.
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>n21 j
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>n11 i
</p>
<p>Figure 4: Chevauchement de (2) sur (1)
</p>
<p>Les conflits de ce type (cf. figure 4) apparaissent &#224; 43 occasions (moins de 1,6 % des conflits
possibles par calcul combinatoire) et concernent 26 r&#232;gles diff&#233;rentes (sur 53 r&#232;gles). Pour
chacune de ces 43 occurrences, le chevauchement n&#8217;a lieu que sur un seul &#233;l&#233;ment des patrons
(cas o&#249; &#9; &#4; &#19;
</p>
<p>&#0;
</p>
<p>et &#17; &#4; &#3;) qui est de type mot d&#233;clencheur ou EN pour (2) et fin d&#8217;EN ou EN
pour (1). Par cons&#233;quent, les conflits de chevauchement de patrons n&#8217;ont que peu de risques de
se concr&#233;tiser sur les entit&#233;s nomm&#233;es reconnues lors de l&#8217;application des r&#232;gles de r&#233;&#233;criture,
il semble peu probable de rencontrer en corpus une suite de formes qui corresponde &#224; la suite
d&#8217;&#233;l&#233;ments de patron &#5;&#10;&#0;
</p>
<p>&#0;
</p>
<p>&#11; &#20; &#20; &#20; &#11; &#10;
</p>
<p>&#3;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#4; &#10;
</p>
<p>&#0;
</p>
<p>&#2;
</p>
<p>&#11; &#20; &#20; &#20; &#11; &#10;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#2;
</p>
<p>&#6; :
&#0;
</p>
<p>&#5;Europe de l&#8217;
&#2;
</p>
<p>&#5;Est&#6;
&#0;
</p>
<p>de l&#8217;Afrique&#6;
&#2;
</p>
<p>ou
</p>
<p>&#0;
</p>
<p>&#5;XV de
&#2;
</p>
<p>&#5;France&#6;
&#0;
</p>
<p>m&#233;ridionale&#6;
&#2;
</p>
<p>.
</p>
<p>Au niveau de la conception de ces r&#232;gles, nous ne g&#233;rons pas encore la r&#233;solution de conflit,
mais pour limiter leur apparition nous r&#233;ordonnons les r&#232;gles en terme de priorit&#233; : lorsqu&#8217;un
conflit de chevauchement de patrons est identifi&#233; entre (1) et (2), nous choisirons d&#8217;appliquer
en priorit&#233; la r&#232;gle qui poss&#232;de le plus grand nombre d&#8217;&#233;l&#233;ments de types contexte et mot
d&#233;clencheur, car ils en font a priori la r&#232;gle la plus fiable1 (cf. section 2.2.2). Poibeau (1999)
</p>
<p>1Un poids plus fort pourrait &#233;galement &#234;tre donn&#233; aux lexiques utilis&#233;s pour une unique cat&#233;gorie.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nemesis, un syst&#232;me de reconnaissance incr&#233;mentielle des entit&#233;s nomm&#233;es pour le fran&#231;ais
</p>
<p>donne la priorit&#233; aux r&#232;gles les plus longues, sans se soucier des &#233;l&#233;ments qui les composent,
et, dans le cas de deux r&#232;gles de m&#234;me longueur, produit un r&#233;sultat al&#233;atoire.
</p>
<p>3.1.2 Inclusion de patrons
</p>
<p>D&#233;finition 2 Il y a un conflit d&#8217;inclusion de patrons de (2) dans (1)&#2;&#3; &#1;&#10;&#0;
&#2;
</p>
<p>&#11; &#10;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#2;
</p>
<p>&#2; &#7; &#1;&#10;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#11; &#10;
</p>
<p>&#3;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#2;.
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>1 n2
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>n11
</p>
<p>Figure 5: Inclusion de (2) dans (1)
</p>
<p>De tels conflits, dont les diff&#233;rents cas sont sch&#233;matis&#233;s &#224; la figure 5, se pr&#233;sentent &#224; 35 reprises
(moins de 1,3 % des conflits possibles) et concernent 28 r&#232;gles diff&#233;rentes. Ils correspondent au
cas o&#249; le patron d&#8217;une r&#232;gle est totalement inclus dans celui d&#8217;une autre r&#232;gle. Contrairement
aux conflits de chevauchement, les conflits d&#8217;inclusion vont certainement se concr&#233;tiser sur les
entit&#233;s nomm&#233;es reconnues lors de l&#8217;application des r&#232;gles de r&#233;&#233;criture sur corpus. En effet, si
&#1;
</p>
<p>&#0;
</p>
<p>est associ&#233; &#224; une s&#233;rie de formes, &#1;
&#2;
</p>
<p>, qui est inclus dans &#1;
&#0;
</p>
<p>, sera forc&#233;ment associ&#233; &#224; une
s&#233;rie de formes incluse dans la premi&#232;re.
</p>
<p>L&#224; encore, la constatation de tels conflits peut nous permettre de r&#233;ordonner les r&#232;gles en terme
de priorit&#233; : s&#8217;il existe un conflit d&#8217;inclusion de patrons de (2) dans (1), nous choisirons de
privil&#233;gier (1) sur (2). En effet, comme cette r&#232;gle a un patron qui poss&#232;de plus d&#8217;&#233;l&#233;ments,
notamment ceux de types contexte et mot d&#233;clencheur, la r&#232;gle (1) est la plus sp&#233;ci-
fique et poss&#232;de un niveau de fiabilit&#233; plus grand. Prenons les patrons
</p>
<p>&#2;
</p>
<p>&#0;$Pr&#233;nom* $NP+&#1;
&#2;
</p>
<p>et
&#0;
</p>
<p>&#0;$M&#233;tier $Adj_nationalit&#233;? [$Pr&#233;nom* $NP+]&#1;
&#0;
</p>
<p>qui correspondraient, par exem-
ple, &#224; la suite de formes
</p>
<p>&#0;
</p>
<p>&#5;philosophe fran&#231;ais
&#2;
</p>
<p>&#5;Ren&#233; Descartes&#6;
&#2;
</p>
<p>&#6;
</p>
<p>&#0;
</p>
<p>. Le patron de la r&#232;gle
(1) est le plus fiable du fait des &#233;l&#233;ments de type contexte (philosophe et fran&#231;ais). Nous
privil&#233;gions donc par d&#233;faut les entit&#233;s nomm&#233;es maximales, tout comme Friburger (2001).
</p>
<p>3.2 &#201;tude exp&#233;rimentale
Cette &#233;tude porte sur les anthroponymes et les toponymes, dont l&#8217;ensemble des cat&#233;gories
repr&#233;sente plus de 80 % des EN pr&#233;sentes dans nos corpus (Daille et al., 2000). Elle a &#233;t&#233;
r&#233;alis&#233;e sur un corpus extrait du Monde, compos&#233; de 13 368 mots et comportant environ 250
anthroponymes et 80 toponymes. L&#8217;observation des conflits qui apparaissent lors de la recon-
naissance des EN en corpus nous permet de v&#233;rifier si nos r&#232;gles sont correctement ordonn&#233;es.
Elle peut &#233;ventuellement permettre la mise au point d&#8217;heuristiques pour la d&#233;sambigu&#239;sation
des conflits. Parmi ces conflits, nous introduisons un nouveau type (accolement), qui n&#8217;existe
pas au niveau des r&#232;gles, mais s&#8217;observe lors de leur application sur le corpus.
</p>
<p>3.2.1 Chevauchement
</p>
<p>Nous n&#8217;avons relev&#233; aucun conflit de chevauchement sur les anthroponymes et les toponymes
reconnus. Si ce type de conflit apparaissait, il t&#233;moignerait tr&#232;s probablement d&#8217;un probl&#232;me</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nordine Fourour
</p>
<p>lors de la conception d&#8217;une, voire de deux r&#232;gles. Dans ce cas, diff&#233;rentes solutions s&#8217;offriraient
alors &#224; nous : 1) &#233;liminer l&#8217;une des deux r&#232;gles voire les deux ; 2) inverser la priorit&#233; sur ces
deux r&#232;gles ; 3) fusionner les deux r&#232;gles ; 4) cr&#233;er une troisi&#232;me r&#232;gle, prioritaire sur les deux
premi&#232;res.
</p>
<p>3.2.2 Inclusion
</p>
<p>Les conflits d&#8217;inclusion de patrons, eux, se concr&#233;tisent pendant la phase d&#8217;application des
r&#232;gles de r&#233;&#233;criture sur un corpus :
</p>
<p>&#0;
</p>
<p>&#5;Universit&#233; de
&#2;
</p>
<p>&#5;Nantes&#6;
&#2;
</p>
<p>&#6;
</p>
<p>&#0;
</p>
<p>,
&#0;
</p>
<p>&#5;Guerre d&#8217;
&#2;
</p>
<p>&#5;Alg&#233;rie&#6;
&#2;
</p>
<p>&#6;
</p>
<p>&#0;
</p>
<p>,
</p>
<p>&#0;
</p>
<p>&#5;Anatole
&#2;
</p>
<p>&#5;France&#6;
&#2;
</p>
<p>&#6;
</p>
<p>&#0;
</p>
<p>. Dans ce cas, nous gardons de pr&#233;f&#233;rence l&#8217;EN maximale, car c&#8217;est la
plus &#171; fiable &#187;. En effet, les formes qui la composent ont n&#233;cessit&#233; une correspondance avec
un plus grand nombre d&#8217;&#233;l&#233;ments lexicaux de type mot d&#233;clencheur (Universit&#233;, Guerre,
Anatole).
Par cons&#233;quent, la pr&#233;sence de tels conflits parmi les EN d&#8217;un corpus ne pose pas de prob-
l&#232;me d&#8217;ambigu&#239;t&#233;, mais peut indiquer la pr&#233;sence de surcompositions r&#233;f&#233;rentielles, comme
dans Universit&#233; de Nantes ou Guerre d&#8217;Alg&#233;rie. Pour prendre en compte cette &#233;ventualit&#233;, une
solution serait de se pencher sur l&#8217;EN la plus petite : si elle appara&#238;t seule dans le texte, nous
consid&#233;rons que nous nous trouvons devant une surcomposition r&#233;f&#233;rentielle.
</p>
<p>3.2.3 Accolement
</p>
<p>Ce type de conflit n&#8217;a de sens qu&#8217;en regard des entit&#233;s nomm&#233;es reconnues lors de l&#8217;application
des r&#232;gles. Il correspond au cas o&#249; deux entit&#233;s nomm&#233;es sont identifi&#233;es, l&#8217;une se situant
imm&#233;diatement &#224; la suite de l&#8217;autre. Il ne s&#8217;agit pas r&#233;ellement d&#8217;un conflit dans la mesure o&#249;
les deux EN sont distinctes. Cependant, il peut &#234;tre int&#233;ressant de rep&#233;rer ces cas, afin de voir
si nous n&#8217;avons pas commis une erreur. Jusqu&#8217;&#224; pr&#233;sent, dans nos corpus, ce cas n&#8217;appara&#238;t que
pour dix paires d&#8217;anthroponymes, soit 3,8 % des EN de cette classe. Il s&#8217;agit &#224; chaque fois d&#8217;un
ethnonyme suivi imm&#233;diatement d&#8217;un patronyme comme dans les
</p>
<p>&#0;
</p>
<p>&#5;Fran&#231;ais&#6;
&#0; &#2;
</p>
<p>&#5;Voltaire&#6;
&#2;
</p>
<p>,
</p>
<p>Rousseau et Baudelaire ou le
&#0;
</p>
<p>&#5;Br&#233;silien&#6;
&#0; &#2;
</p>
<p>&#5;Ricardo Bofill&#6;
&#2;
</p>
<p>. Dans cette circonstance, il n&#8217;y a
pas d&#8217;erreur ; cependant, nous pourrions avoir affaire &#224; une entit&#233; nomm&#233;e plus compl&#232;te dont
nous aurions mal identifi&#233; les limites :
</p>
<p>&#0;
</p>
<p>&#5;F&#233;d&#233;ration&#6;
&#0; &#2;
</p>
<p>&#5;Fran&#231;aise de football&#6;
&#2;
</p>
<p>qui devrait
&#234;tre une seule EN,
</p>
<p>&#0;
</p>
<p>&#5;Caisse Primaire d&#8217;&#6;
&#0; &#2;
</p>
<p>&#5;Assurance Maladie dans le rouge&#6;
&#2;
</p>
<p>qui devrait &#234;tre
regroup&#233;e en une seule EN priv&#233;e de la partie dans le rouge2. Dans de tels cas, il faudrait &#233;tudier
la pr&#233;sence de chacune des deux EN s&#233;par&#233;ment dans le texte (cf. tableau 2). Les solutions &#224;
apporter peuvent &#234;tre affin&#233;es en ne retenant pas syst&#233;matiquement l&#8217;EN la plus compl&#232;te, mais
&#233;ventuellement une sous-partie de celle-ci (comme pour satisfaire &#224; l&#8217;exemple pr&#233;c&#233;dent).
</p>
<p>Pr&#233;sence de l&#8217;EN 1 seule
oui non
</p>
<p>Pr&#233;sence de
l&#8217;EN 2 seule
</p>
<p>oui prendre les deux s&#233;par&#233;ment prendre l&#8217;EN 2 ou l&#8217;EN compl&#232;te
non prendre l&#8217;EN 1 ou l&#8217;EN compl&#232;te prendre l&#8217;EN compl&#232;te
</p>
<p>Table 2: D&#233;sambigu&#239;sation de l&#8217;accolement d&#8217;EN
</p>
<p>2Ces exemples restent hypoth&#233;tiques, car il n&#8217;est notamment pas possible &#224; Nemesis de reconna&#238;tre une EN
terminant par un d&#233;terminant (d&#8217;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nemesis, un syst&#232;me de reconnaissance incr&#233;mentielle des entit&#233;s nomm&#233;es pour le fran&#231;ais
</p>
<p>La d&#233;couverte de ce type de conflits et les solutions retenues pour les r&#233;soudre pourront na-
turellement nous conduire &#224; modifier nos r&#232;gles dans les m&#234;mes mesures que pour les conflits
de chevauchement de patrons (cf. section 3.2.1) : si l&#8217;EN compl&#232;te est retenue, nous pourrons
&#233;ventuellement g&#233;n&#233;raliser cette d&#233;cision et fusionner les deux r&#232;gles ou en cr&#233;er une troisi&#232;me
prioritaire sur les deux autres.
</p>
<p>3.3 Inf&#233;rence de nouvelles r&#232;gles
</p>
<p>D&#232;s lors que des situations de conflits sont identifi&#233;es entre les EN reconnues apr&#232;s une premi&#232;re
application des r&#232;gles de r&#233;&#233;criture, il nous est possible d&#8217;en inf&#233;rer de nouvelles :
</p>
<p>processus automatique en cr&#233;ant une r&#232;gle r&#233;sultant de la fusion de deux r&#232;gles. Nous in-
troduisons un op&#233;rateur de fusion &#8;, inspir&#233; de l&#8217;op&#233;rateur de fusion de r&#232;gles mor-
phologiques de Mikheev (1997) :
</p>
<p>&#5;&#3;&#6;&#8; &#5;&#7;&#6; &#4; &#5;&#10;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#11; &#20; &#20; &#20; &#11; &#10;
</p>
<p>&#4;
</p>
<p>&#0;
</p>
<p>&#11; &#10;
</p>
<p>&#7;
</p>
<p>&#2;
</p>
<p>&#11; &#20; &#20; &#20; &#11; &#10;
</p>
<p>&#3;&#2;
</p>
<p>&#2;
</p>
<p>&#6;&#1; &#2;&#3;&#4;&#0;&#5;&#6;&#7;&#8;&#9;&#5;
</p>
<p>&#0;
</p>
<p>avec les contraintes &#5;&#10;&#4;&#3;&#0;
&#0;
</p>
<p>&#11; &#20; &#20; &#20; &#11; &#10;
</p>
<p>&#3;&#0;
</p>
<p>&#0;
</p>
<p>&#6; &#4; &#5;&#10;
</p>
<p>&#0;
</p>
<p>&#2;
</p>
<p>&#11; &#20; &#20; &#20; &#11; &#10;
</p>
<p>&#7;&#0;&#0;
</p>
<p>&#2;
</p>
<p>&#6; ou &#5;&#9; &#4; &#19;
&#0;
</p>
<p>et &#17; &#4; &#3;&#6;
</p>
<p>Cet op&#233;rateur pouvant &#234;tre utilis&#233; dans le cas d&#8217;un chevauchement ou d&#8217;un accolement
d&#8217;EN, dont nous ne retrouverions pas de pr&#233;sence individuellement ;
</p>
<p>processus supervis&#233; en pointant les situations de conflit et en proposant un certain nombre de
r&#232;gles qui pourraient permettre de les r&#233;soudre. Dans ce cas, pourraient &#234;tre propos&#233;es
diff&#233;rentes solutions pour chaque conflit et une g&#233;n&#233;ralisation de la solution retenue par
l&#8217;utilisateur.
</p>
<p>Cette deuxi&#232;me m&#233;thode para&#238;t &#234;tre la plus efficace et comporter le moins de risques, dans
la mesure o&#249; nous ne sommes pas du tout s&#251;r des r&#232;gles inf&#233;r&#233;es par la premi&#232;re m&#233;thode et
que la deuxi&#232;me nous permet d&#8217;en proposer un plus grand nombre. De plus, l&#8217;apport de cette
approche est de laisser une plus grande marge de man&#339;uvre &#224; l&#8217;utilisateur et de l&#8217;int&#233;grer dans
le processus de reconnaissance : il n&#8217;a plus l&#8217;impression d&#8217;avoir affaire &#224; une bo&#238;te noire, il peut
interagir avec le syst&#232;me.
</p>
<p>Toutes les remarques faites en ce qui concerne la r&#233;&#233;valuation des priorit&#233;s sur les r&#232;gles, suiv-
ant les formes de conflits qu&#8217;elles peuvent engendrer dans leur conception ou leur application,
pourront nous permettre de d&#233;gager un algorithme d&#8217;insertion pour les nouvelles r&#232;gles induites
par un processus d&#8217;apprentissage.
</p>
<p>4 Conclusions et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; l&#8217;architecture logicielle de Nemesis, un syst&#232;me de reconnaissance des en-
tit&#233;s nomm&#233;es pour le fran&#231;ais. Nous nous sommes plus pr&#233;cis&#233;ment int&#233;ress&#233;s &#224; l&#8217;organisation
des lexiques, au formalisme des r&#232;gles de r&#233;&#233;criture et aux conflits que leur application pou-
vait engendrer. Les r&#233;sultats, sur l&#8217;ensemble des deux classes reconnues, sont de 95 % pour
la pr&#233;cision et 90 % pour le rappel. Ces r&#233;sultats regroupent ceux de Fourour (2001) sur les
anthroponymes et une &#233;valuation pour les toponymes avec les m&#234;mes modalit&#233;s et sur le m&#234;me
corpus (Le Monde, 13 368 mots, 528 anthroponymes et 137 toponymes).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nordine Fourour
</p>
<p>Pour am&#233;liorer Nemesis, notre &#233;tude des conflits (cf. section 3) devra nous amener &#224; mettre
en place un v&#233;ritable module de d&#233;sambigu&#239;sation. Parall&#232;lement, elle devra nous permettre
d&#8217;inf&#233;rer de nouvelles r&#232;gles (cf. 3.3) durant la premi&#232;re reconnaissance et de concevoir un
algorithme pour les ins&#233;rer parmi les r&#232;gles d&#233;j&#224; existantes. En outre, il nous faudra impl&#233;-
menter la reconnaissance des autres cat&#233;gories r&#233;f&#233;rentielles de notre typologie (comme cer-
taines sous-classes d&#8217;ergonymes et de praxonymes), gr&#226;ce notamment &#224; des r&#232;gles de surcom-
position r&#233;f&#233;rentielle.
</p>
<p>R&#233;f&#233;rences
CUCCHIARELLI A., LUZI D. &amp; PAOLA V. (1998). Using corpus evidence for automatic gazetteer
extension. In Proceedings of LREC&#8217;98, p. 83&#8211;89.
DAILLE B., FOUROUR N. &amp; MORIN E. (2000). Cat&#233;gorisation des noms propres : une &#233;tude en corpus.
Cahiers de Grammaire, 25, 115&#8211;129.
DAILLE B. &amp; MORIN E. (2000). Reconnaissance automatique des noms propres de la langue &#233;crite :
Les r&#233;centes r&#233;alisations. Traitement automatique des langues, 41(3), 601&#8211;621.
FOUROUR N. (2001). Identification et cat&#233;gorisation automatiques des anthroponymes du fran&#231;ais. In
Actes, TALN-R&#233;cital 2001, volume 1, p. 441&#8211;450.
FRIBURGER N. (2001). &#201;laboration d&#8217;une cascade de transducteurs pour l&#8217;extraction de motifs. In
Actes, TALN-R&#233;cital 2001, volume 1, p. 183&#8211;192.
GRASS T. (2000). Typologie et traductibilit&#233; des noms propres de l&#8217;allemand vers le fran&#231;ais. Traitement
automatique des langues, 41(3), 643&#8211;670.
MCDONALD D. D. (1994). Internal and external evidence in the identification and semantic categoriza-
tion of proper names. In Corpus Processing for Lexical Acquisition, chapter 2, p. 61&#8211;76.
MIKHEEV A. (1997). Automatic rule induction for unknown-word guessing. Computational Linguis-
tics, 23(3), 405&#8211;423.
MIKHEEV A. (1999). A knowledge-free method for capitalized word disambiguation. In Proceedings
of the 37th Annual Meeting of the ACL, p. 159&#8211;166, University of California, Maryland.
MORIN E. (1999). Extraction de liens s&#233;mantiques entre termes &#224; partir de corpus de textes techniques.
Th&#232;se en informatique, Institut de Recherche en Informatique de Nantes.
</p>
<p>MUC-7 (1998). Proceedings of the 7th seven Message Understanding Conference (MUC-7).
POIBEAU T. (1999). Rep&#233;rage des entit&#233;s nomm&#233;es : un enjeu pour les syst&#232;mes de veille. In Actes des
troisi&#232;mes rencontres de Terminologie et Intelligence Artificielle (TIA&#8217;99), volume 19, p. 43&#8211;51.
SALTON G. &amp; MCGILL M. (1983). Introduction to Modern Information Retrieval. McGraw-Hill.
TROUILLEUX F. (1997). Identification et classement automatique des noms propres dans des textes
fran&#231;ais. DEA linguistique, logique et informatique, Universit&#233; Blaise-Pascal Clermont II.
</p>
<p>WACHOLDER N., RAVIN Y. &amp; CHOI M. (1997). Disambiguation of proper names in text. In Procedings
of ANLP&#8217;97, p. 202&#8211;208.
WAKAO T., GAIZAUSKAS R. &amp; WILKS Y. (1996). Evaluation of an algorithm for the recognition and
classification of proper names. In Proceedings of COLING&#8217;96, volume 1, p. 418&#8211;423.
WOLINSKI F., VICHOT F. &amp; DILLET B. (1995). Automatic processing of proper names in texts. In
Proceedings of EACL&#8217;95, p. 23&#8211;30.</p>

</div></div>
</body></html>