<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L'analyse s&#233;mantique latente et l'identification des m&#233;taphores</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>L'analyse s&#233;mantique latente et l'identification des m&#233;taphores 
</p>
<p>Yves Bestgen et Anne-Fran&#231;oise Cabiaux 
</p>
<p>Fonds national de la recherche scientifique  Universit&#233; catholique de Louvain  
Place du Cardinal Mercier, 10 B1347 Louvain-la-Neuve Belgique 
</p>
<p>yves.bestgen@psp.ucl.ac.be 
</p>
<p>R&#233;sum&#233; 
</p>
<p>Apr&#232;s avoir pr&#233;sent&#233; le mod&#232;le computationnel de l'interpr&#233;tation de m&#233;taphores propos&#233; par 
Kintsch (2000), nous rapportons une &#233;tude pr&#233;liminaire qui &#233;value son efficacit&#233; dans le 
traitement de m&#233;taphores litt&#233;raires et la possibilit&#233; de l'employer pour leur identification. 
Having introduced Kintsch's computational model of metaphor comprehension (2000), we 
report a preliminary study aiming at determining its efficiency in modeling the processing of 
literary metaphors and its ability to detect them. 
</p>
<p>Mots Cl&#233;s 
</p>
<p>M&#233;taphore - Analyse s&#233;mantique latente - interpr&#233;tation et d&#233;tection - textes litt&#233;raires 
Metaphor - Latent semantic analysis - interpretation and detection - literary texts 
</p>
<p>1 Introduction 
</p>
<p>De nombreux auteurs ont soulign&#233; combien les &#233;nonc&#233;s que nous produisons 
quotidiennement contiennent un grand nombre d'expressions figuratives qui posent des 
probl&#232;mes tant aux mod&#232;les psychologiques de la compr&#233;hension du langage qu'aux 
approches linguistiques en traitement automatique de la langue (Gibbs, 1994; Martin, 1992). 
Durant ces dix derni&#232;res ann&#233;es, ces deux disciplines ont fait d'importants progr&#232;s tout 
particuli&#232;rement au niveau du traitement de la m&#233;taphore. De plus en plus de donn&#233;es 
empiriques sont venues &#233;tayer les hypoth&#232;ses des chercheurs quant &#224; la mani&#232;re dont nous 
comprenons une m&#233;taphore (Cacciari, Glucksberg, 1994; Kintsch, 2000). Simultan&#233;ment, des 
m&#233;thodes pour d&#233;tecter et interpr&#233;ter automatiquement les m&#233;taphores ont &#233;t&#233; propos&#233;es et 
impl&#233;ment&#233;es (Fass, 1991; Ferrari, 1996; Ferrari et al., 2000; Martin, 1992). Si ces disciplines 
sont loin de s'ignorer, leurs vis&#233;es tr&#232;s diff&#233;rentes n'ont jusqu'&#224; pr&#233;sent pas permis de r&#233;el 
rapprochement. R&#233;cemment toutefois, Kintsch (2000) a entrouvert la voie &#224; un tel 
rapprochement en proposant un &quot;mod&#232;le computationnel&quot; de l'interpr&#233;tation des &#233;nonc&#233;s 
m&#233;taphoriques. Apr&#232;s avoir d&#233;crit l'algorithme qu'il propose, nous pr&#233;sentons une &#233;tude 
pr&#233;liminaire qui confronte cet algorithme &#224; des m&#233;taphores vari&#233;es d'origine litt&#233;raire et qui 
teste la possibilit&#233; de l'appliquer &#224; leur d&#233;tection. 
</p>
<p>331 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Bestgen, Anne-Fran&#231;oise Cabiaux 
</p>
<p>2 Un mod&#232;le computationnel de l'interpr&#233;tation des m&#233;taphores bas&#233; sur 
l'analyse s&#233;mantique latente 
</p>
<p>Kintsch (2000) propose un mod&#232;le computationnel qui s'appuie sur la conception interactive 
de l'interpr&#233;tation des m&#233;taphores. Selon celle-ci, tant le v&#233;hicule1 que la topique contribuent 
au sens de la m&#233;taphore puisque le v&#233;hicule propose des propri&#233;t&#233;s parmi lesquelles la 
topique s&#233;lectionne celles qui sont acceptables et les adaptent en fonction de ses propri&#233;t&#233;s 
s&#233;mantiques. Par exemple, dans la m&#233;taphore reprise par Kintsch &#224; Glucksberg &quot;Mon avocat 
est un requin&quot;, avocat  (topique) s&#233;lectionne les traits de requin (v&#233;hicule) qui peuvent lui &#234;tre 
attribu&#233;s. Ce seront par exemple sanguinaire ou vicieux. Une caract&#233;ristique importante de 
cette conception est qu'elle peut &#234;tre &#233;tendue &#224; n'importe quelle pr&#233;dication, la topique y 
jouant le r&#244;le de l'argument que le v&#233;hicule-pr&#233;dicat enrichit de certaines de ses propri&#233;t&#233;s 
(Glucksberg, McGlone, 1999; Kintsch, 2001). Ceci rejoint la th&#232;se, actuellement privil&#233;gi&#233;e 
en psycholinguistique, selon laquelle une m&#233;taphore est comprise par les m&#234;mes processus 
mentaux que ceux qui s'appliquent aux &#233;nonc&#233;s dont le sens litt&#233;ral est pertinent (Gibbs, 
1994; Glucksberg et al., 1997; voir Martin (1992) pour un autre emploi de cette m&#234;me th&#232;se).  
</p>
<p>Pour impl&#233;menter cette conception, il est n&#233;cessaire de pouvoir identifier les traits 
s&#233;mantiques qui participeront au sens de la m&#233;taphore et de proposer un algorithme capable 
d'effectuer la s&#233;lection. La premi&#232;re composante est fournie par l'analyse s&#233;mantique latente 
(ASL). Issue de travaux sur l'indexation automatique de documents, cette technique vise &#224; 
construire un espace s&#233;mantique de tr&#232;s grandes dimensions &#224; partir de l'analyse statistique 
des cooccurrences dans un corpus de textes2. Le sens de chaque mot y est repr&#233;sent&#233; par un 
vecteur. Pour mesurer la similarit&#233; s&#233;mantique entre deux mots, on calcule le cosinus entre les 
vecteurs qui les repr&#233;sentent. Plus deux mots sont s&#233;mantiquement proches, plus les deux 
vecteurs qui les repr&#233;sentent pointent dans la m&#234;me direction et donc plus leur cosinus se 
rapproche de 1. Un cosinus de 0 indique une absence de similarit&#233; puisque les vecteurs 
correspondants sont orthogonaux. L'algorithme employ&#233; pour d&#233;terminer le sens d'une 
pr&#233;dication vise &#224; s&#233;lectionner parmi les &quot;traits&quot; du pr&#233;dicat ceux qui sont proches de 
l'argument. On proc&#232;de en recherchant parmi les n plus proches voisins du pr&#233;dicat les k plus 
proches voisins de l'argument. Afin de garantir que les termes s&#233;lectionn&#233;s sont suffisamment 
li&#233;s aux deux &#233;l&#233;ments de la pr&#233;dication, un seuil de proximit&#233; minimal est impos&#233; aux termes 
s&#233;lectionn&#233;s. Le sens de la pr&#233;dication est alors d&#233;termin&#233; en prenant le centro&#239;de du pr&#233;dicat, 
de l'argument et des k termes qui viennent d'&#234;tre s&#233;lectionn&#233;s, c'est-&#224;-dire en additionnant les 
vecteurs correspondants. L'ad&#233;quation du &quot;sens&quot; attribu&#233; par cette proc&#233;dure &#224; une 
pr&#233;dication, et donc aussi &#224; une m&#233;taphore, est &#233;valu&#233;e en d&#233;terminant la proximit&#233; entre ce 
nouveau vecteur et des points de rep&#232;res consid&#233;r&#233;s comme proches du sens de la m&#233;taphore 
(p.e., vicieux, sanguinaire pour la m&#233;taphore mon avocat est un requin). 
</p>
<p>Selon ce mod&#232;le, le seul facteur qui change lorsqu'on analyse, non un &#233;nonc&#233; litt&#233;ral, mais 
une m&#233;taphore, est le param&#232;tre n, c'est-&#224;-dire le nombre de voisins du pr&#233;dicat parmi lesquels 
on cherche les plus proches voisins de l'argument. Pour un &#233;nonc&#233; litt&#233;ral, on se limite aux 20 
plus proches voisins, alors que pour un &#233;nonc&#233; m&#233;taphorique, il faut aller jusqu'&#224; 200 voire 
</p>
<p>                                                 
1  Sur la base d'une d&#233;finition tr&#232;s g&#233;n&#233;rale de la m&#233;taphore comme une mani&#232;re d'expliquer quelque chose en 
</p>
<p>utilisant les termes d'autre chose, on d&#233;finira la topique comme la cible de la m&#233;taphore (ce dont on veut 
parler) et le v&#233;hicule comme la source de la m&#233;taphore (ce qui permet d'en parler). 
</p>
<p>2  Une description d&#233;taill&#233;e de la technique ASL (Latent semantic analysis &#8212; LSA) peut &#234;tre trouv&#233;e dans les 
nombreux articles t&#233;l&#233;chargeables &#224; l'adresse http://LSA.colorado.edu/ dont Landauer et al. (1998) 
</p>
<p>332 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'analyse s&#233;mantique latente et l'interpr&#233;tation des m&#233;taphores 
</p>
<p>500.  
</p>
<p>3 Notre recherche 
</p>
<p>Les arguments empiriques avanc&#233;s par Kintsch (2000, 2001) pour soutenir son mod&#232;le 
computationnel sont tr&#232;s r&#233;duits. Il n'a &#233;tudi&#233; qu'un tout petit nombre de m&#233;taphores (7), 
toutes issues d'un mat&#233;riel exp&#233;rimental et de type attributif. Par ailleurs, la possibilit&#233; 
d'appliquer cette technique &#224; l'identification d'&#233;nonc&#233;s m&#233;taphoriques n'a pas &#233;t&#233; envisag&#233;e. 
La pr&#233;sente recherche est un premier pas vers la prise en compte de ces limitations. Tout 
d'abord, nous analysons l'efficacit&#233; de l'algorithme lorsqu'il est appliqu&#233; &#224; des m&#233;taphores 
litt&#233;raires de diff&#233;rents types. Ensuite, nous prenons en compte l'id&#233;e centrale d'une continuit&#233; 
entre &#233;nonc&#233;s litt&#233;raux et m&#233;taphoriques en v&#233;rifiant que l'algorithme fonctionne avec des 
expressions per&#231;ues par des lecteurs comme tr&#232;s m&#233;taphoriques ou peu m&#233;taphoriques. Enfin, 
nous rapportons les r&#233;sultats d'une premi&#232;re tentative pour d&#233;river un indice de l'intensit&#233; 
figurative d'une pr&#233;dication sur la base de l'algorithme. 
</p>
<p>3.1 Mat&#233;riel 
</p>
<p>3.1.1 S&#233;lection des m&#233;taphores 
</p>
<p>Vingt phrases contenant des expressions m&#233;taphoriques ont &#233;t&#233; s&#233;lectionn&#233;es dans neuf 
contes de Maupassant. Dix phrases exprimaient une m&#233;taphore vive et 10 une m&#233;taphore 
morte. Ont &#233;t&#233; consid&#233;r&#233;es comme mortes les m&#233;taphores employant des mots dans un sens 
que le dictionnaire Petit Robert qualifie de figuratif alors que le sens des mots employ&#233;s dans 
les m&#233;taphores consid&#233;r&#233;es comme vives n'&#233;tait pas mentionn&#233; dans ce m&#234;me dictionnaire. La 
liste des expressions m&#233;taphoriques est donn&#233;e dans le Tableau 1. 
</p>
<p>3.1.2 Estimation de l'intensit&#233; figurative 
</p>
<p>Pour cette t&#226;che de jugement, le mat&#233;riel principal &#233;tait compos&#233; des 20 expressions 
m&#233;taphoriques. Toutefois, afin que les juges n'&#233;valuent pas que des &#233;nonc&#233;s a priori 
m&#233;taphoriques, une version litt&#233;rale de chaque &#233;nonc&#233; m&#233;taphorique a &#233;t&#233; &#233;crite. Par 
exemple, la version litt&#233;rale de &quot;la voix sourde et profonde du torrent &quot; &#233;tait &quot;le bruit sourd et 
profond du torrent&quot;. Au total, 40 personnes ont indiqu&#233; s'ils consid&#233;raient &quot;que la formulation 
de l'&#233;nonc&#233; est plut&#244;t litt&#233;rale ou plut&#244;t figur&#233;e&quot; en utilisant une &#233;chelle gradu&#233;e allant de tout 
&#224; fait litt&#233;ral (1) &#224; tout &#224; fait figur&#233; (7). Chaque juge a &#233;valu&#233; 20 expressions : 10 en version 
m&#233;taphorique et les 10 autres en version litt&#233;ralis&#233;e. Aucun juge n'a vu les deux versions d'un 
m&#234;me &#233;nonc&#233;. 
</p>
<p>Comme on pouvait s'y attendre, les juges ont &#233;t&#233; tr&#232;s sensibles &#224; l'opposition entre les 
expressions m&#233;taphoriques (score minimum de 4,4) et les expressions litt&#233;ralis&#233;es (score 
maximum de 3,8). L'accord inter-juges, mesur&#233; par l'alpha de Cronbach, pour l'ensemble des 
expressions est excellent (0,97) et reste acceptable lorsqu'on analyse les seuls &#233;nonc&#233;s 
m&#233;taphoriques (0,76). Comme on peut le voir dans le Tableau 1, les m&#233;taphores vives ont 
g&#233;n&#233;ralement &#233;t&#233; &#233;valu&#233;es comme plus figuratives que les m&#233;taphores mortes. La diff&#233;rence 
entre les valeurs moyennes pour les 10 m&#233;taphores vives (5,8) et celles pour les 10 
m&#233;taphores mortes (5,2) est tr&#232;s significative selon un test t pour &#233;chantillons ind&#233;pendants 
(t(1,18) = 3,07; p&lt;,01). On observe aussi que certaines expressions ont &#233;t&#233; jug&#233;es comme 
</p>
<p>333 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Bestgen, Anne-Fran&#231;oise Cabiaux 
</p>
<p>nettement plus figuratives que d'autres. 
</p>
<p>3.2 Constitution de l'espace s&#233;mantique 
</p>
<p>Le corpus de textes utilis&#233;s pour constituer l'espace s&#233;mantique est constitu&#233; de 206 contes de 
Maupassant, soit tous les contes que nous avons pu trouver en version &#233;lectronique, &#224; 
l'exception des neuf contes dans lesquels les m&#233;taphores ont &#233;t&#233; reprises. Au total, ce corpus 
contient 600 000 mots. Chaque conte a &#233;t&#233; segment&#233; en fonction des paragraphes. Toutefois, 
un paragraphe comptant moins de 50 mots &#233;tait r&#233;uni avec le ou les suivants jusqu'&#224; que cette 
taille minimale soit atteinte. On a ainsi obtenu 6567 segments. Les mots ont &#233;t&#233; lemmatis&#233;s 
par comparaison avec une liste de formes fl&#233;chies et des lemmes correspondants. Tous les 
mots dont la fr&#233;quence dans le corpus &#233;tait inf&#233;rieure &#224; 3 ont &#233;t&#233; supprim&#233;s. Apr&#232;s ces 
diff&#233;rents traitements, le corpus contenait 6067 mots diff&#233;rents. La matrice de cooccurrence 
des 6067 mots dans les 6567 segments a &#233;t&#233; soumise &#224; une d&#233;composition en valeurs 
singuli&#232;res r&#233;alis&#233;e par le programme SVDPACK (Berry, 1992) et les 150 premiers vecteurs 
propres ont &#233;t&#233; conserv&#233;s. 
</p>
<p> Expressions M&#233;taphoriques  Mots d&#233;crivant la m&#233;taphore Fig Top ASL Diff 
V un orage de sottises violent inattendu excessif &#233;norme 6,3 0,07 0,12 0,05 
V des fus&#233;es de gaiet&#233; explosion brusque &#233;clater violence 6,2 0,25 0,31 0,06 
V le palais de justice est l'&#233;gout des infamies vil &#233;c&#339;urement aboutir &#233;chouer 6,2 -0,03 0,04 0,07 
V l'abbaye est un feu d&#8217;artifice de pierre l&#233;ger superbe &#233;tonnant 6,1 0,10 0,25 0,15 
V la lune verse une pluie de lumi&#232;re g&#233;n&#233;reux r&#233;pandre distribuer 6,0 0,26 0,29 0,03 
V la voix sourde et profonde du torrent humain communication parole vibrer 6,0 0,07 0,25 0,18 
V les arbres bataillent contre le vent r&#233;sister volont&#233; difficile 5,9 0,07 0,25 0,18 
V cueillir les mots sur la bouche rechercher attraper d&#233;licat doux 5,9 0,22 0,29 0,07 
M le jour mourant fin tristesse agonie 5,6 0,20 0,32 0,12 
M voler l'&#339;il tendu vers quelque chose volont&#233; d&#233;sir attrait 5,6 0,20 0,22 0,02 
M vider le sac des arguments quantit&#233; paquet d&#233;sordre 5,5 0,13 0,23 0,10 
M &#234;tre clou&#233; &#224; son fauteuil impuissance souffrance p&#233;nible 5,5 0,16 0,23 0,07 
V la mer est perfide dangereux tra&#238;tre m&#233;chant sournois 5,4 0,18 0,22 0,04 
M s'&#233;crier d'une voix de tonnerre peur bruyant violent 5,2 0,17 0,26 0,09 
M &#234;tre soulev&#233; d'admiration intensit&#233; irr&#233;sistible &#233;motion force  5,0 0,19 0,33 0,14 
M porter son chagrin lourd fardeau p&#233;nible 5,0 0,15 0,34 0,19 
M la voix s'envole sans &#233;cho l&#233;ger libre monter 4,8 0,15 0,21 0,06 
M la reine des gibiers solennel important premier majest&#233; 4,8 0,11 0,15 0,04 
M jeter un aboiement furieux lancer brutal violent force 4,7 0,11 0,41 0,30 
V la nappe transparente de l&#8217;eau lisse vaste plat couvrir 4,4 0,33 0,37 0,04 
</p>
<p>Tableau 1 : Liste des m&#233;taphores vives (V) et mortes (M) analys&#233;es et r&#233;sultats obtenus : 
intensit&#233; figurative estim&#233;e par les juges (Fig), cosinus entre la topique et le &quot;sens&quot; (Top), 
cosinus entre le centro&#239;de pour l'ASL et le &quot;sens&quot; (ASL), diff&#233;rence entre ces deux cosinus 
</p>
<p>(Diff). La topique est en italique et le v&#233;hicule est soulign&#233;. Les m&#233;taphores sont rang&#233;es par 
ordre d&#233;croissant d'intensit&#233; figurative. 
</p>
<p>3.3 Analyses et r&#233;sultats 
</p>
<p>3.3.1 L'ASL permet-elle d'approximer le sens de la m&#233;taphore? 
</p>
<p>Pour r&#233;pondre &#224; cette question, nous avons employ&#233; la proc&#233;dure propos&#233;e par Kintsch. Nous 
</p>
<p>334 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'analyse s&#233;mantique latente et l'interpr&#233;tation des m&#233;taphores 
</p>
<p>avons calcul&#233; le cosinus entre le centro&#239;de construit par l'ASL (param&#232;tres : n=500, k=5 et un 
seuil minimum pour les cosinus de 0.216) et le centro&#239;de repr&#233;sentant le sens de la m&#233;taphore 
d&#233;termin&#233; sur la base de 3 &#224; 4 mots. Nous avons aussi calcul&#233; le cosinus entre la topique et ce 
m&#234;me centro&#239;de repr&#233;sentant le sens de la m&#233;taphore. Le Tableau 1 donne pour chaque paire 
V&#233;hicule&#8212;Topique, les mots qui repr&#233;sentent le sens de la m&#233;taphore. Si l'algorithme est 
capable d'approximer ce sens, le centro&#239;de qu'il construit devrait &#234;tre plus proche de celui-ci 
que ne l'est la topique. Le Tableau 1 donne les valeurs de ces deux cosinus et la diff&#233;rence 
obtenue en soustrayant le cosinus pour la topique du cosinus pour l'ASL. Toutes les 
diff&#233;rences sont positives, soulignant qu'&#224; chaque fois le centro&#239;de propos&#233; est plus proche 
que la topique du sens de la m&#233;taphore. En moyenne, cette diff&#233;rence est de 0,10, valeur tr&#232;s 
significativement diff&#233;rente de 0 (t(19)=6,31; p&gt;,0001). On notera toutefois que l'algorithme a 
&#233;t&#233; peu efficace lors de la recherche du sens de l'expression &quot;Le palais de justice est l'&#233;gout 
des infamies&quot; puisque le cosinus entre le centro&#239;de pour l'ASL et le sens attendu n'est que de 
0,04. 
</p>
<p>3.3.2 L'efficacit&#233; varie-t-elle selon l'intensit&#233; figurative des m&#233;taphores? 
</p>
<p>Nous avons essay&#233; de r&#233;pondre &#224; cette question de deux mani&#232;res. Tout d'abord, nous avons 
compar&#233; l'efficacit&#233; de l'ASL pour les m&#233;taphores vives et mortes. La r&#233;ponse &#224; cette question 
est clairement n&#233;gative. On n'observe aucune diff&#233;rence entre les cosinus moyens selon que 
les m&#233;taphores sont consid&#233;r&#233;es comme mortes ou comme vives. La deuxi&#232;me approche a 
consist&#233; &#224; comparer l'interpr&#233;tation propos&#233;e par l'ASL avec les &#233;valuations des juges. On 
observe une corr&#233;lation n&#233;gative significative (r = -0,45; p&lt;,05) entre l'efficacit&#233; de l'ASL et 
les &#233;valuations moyennes des juges. L'ASL approxime donc d'autant mieux le sens d'une 
m&#233;taphore que les juges l'ont jug&#233;e peu figurative. Ce r&#233;sultat semble &#224; premi&#232;re vue 
probl&#233;matique pour l'approche. Toutefois, on peut aussi le voir comme positif parce que plus 
un &#233;nonc&#233; est figuratif, plus les lecteurs ont des difficult&#233;s pour le comprendre (Miall, 
Kuiken, 1994). L'ASL peinerait donc l&#224; o&#249; les lecteurs rencontrent aussi des difficult&#233;s. 
</p>
<p>3.3.3 Peut-on distinguer les versions 
m&#233;taphoriques des versions 
litt&#233;rales? 
</p>
<p>Comme indiqu&#233; dans l'introduction, la 
proc&#233;dure propos&#233;e par Kintsch s'applique 
aussi bien aux &#233;nonc&#233;s litt&#233;raux que 
m&#233;taphoriques. La seule diff&#233;rence est qu'il 
est n&#233;cessaire pour un &#233;nonc&#233; m&#233;taphorique 
d'accro&#238;tre le nombre de voisins du pr&#233;dicat 
(v&#233;hicule) pris en compte pour trouver des 
concepts suffisamment associ&#233;s &#224; l'argument 
(topique). Dans le cas d'&#233;nonc&#233;s litt&#233;ralement 
vrais, on devrait trouver parmi les mots les 
plus proches du pr&#233;dicat des mots proches de l'argument. Par contre, dans le cas des &#233;nonc&#233;s 
m&#233;taphoriques, les mots proches du pr&#233;dicat devraient &#234;tre peu li&#233;s &#224; l'argument. Ce n'est que 
lorsqu'on prend en compte des mots de moins en moins associ&#233;s au pr&#233;dicat qu'on peut 
esp&#233;rer trouver pour la m&#233;taphore des mots suffisamment associ&#233;s &#224; l'argument. Sur la base 
</p>
<p>5004003002001000
0,1
</p>
<p>0,2
</p>
<p>0,3
</p>
<p>0,4
</p>
<p>0,5
Met
Lit
</p>
<p>Borne sup&#233;rieure
</p>
<p>C
os
</p>
<p>in
us
</p>
<p> m
oy
</p>
<p>en
</p>
<p>335 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Bestgen, Anne-Fran&#231;oise Cabiaux 
</p>
<p>de ce raisonnement, nous avons construit un test afin de d&#233;terminer si l'ASL est capable de 
distinguer les &#233;nonc&#233;s m&#233;taphoriques des &#233;nonc&#233;s litt&#233;raux. Le mat&#233;riel est compos&#233; des 
&#233;nonc&#233;s m&#233;taphoriques et des versions litt&#233;rales construites pour la t&#226;che de jugement. Pour 
chacun de ces &#233;nonc&#233;s, nous avons class&#233; les mots de la base par ordre d&#233;croissant de leur 
cosinus avec le pr&#233;dicat et nous avons analys&#233; les 5 tranches suivantes : les mots occupant les 
places de 1 &#224; 20, de 21 &#224; 50, de 51 &#224; 100, de 101 &#224;200 et de 201 &#224; 500. Dans chacune de ces 
tranches, nous avons recherch&#233;, suivant la proc&#233;dure habituelle, les 5 mots les plus fortement 
associ&#233;s &#224; l'argument. La Figure 1 repr&#233;sente le cosinus moyen entre les 5 associ&#233;s et 
l'argument pour les &#233;nonc&#233;s m&#233;taphoriques et litt&#233;raux. Les courbes sont en accord avec la 
pr&#233;diction. On observe une grande diff&#233;rence entre les &#233;nonc&#233;s m&#233;taphoriques et litt&#233;raux 
pour les premiers tron&#231;ons. Lorsque l'&#233;nonc&#233; est m&#233;taphorique, les mots les plus associ&#233;s au 
pr&#233;dicat (1-20, 21-50, 51-100) sont moins li&#233;s &#224; l'argument. Plus on accepte de prendre en 
compte des mots peu associ&#233;s au pr&#233;dicat (101-200, 201-500), plus cette diff&#233;rence se r&#233;duit. 
</p>
<p>4. Discussion et conclusion 
</p>
<p>Les r&#233;sultats rapport&#233;s ci-dessus semblent encourageants. L'algorithme de Kintsch permet 
d'approximer le sens de m&#233;taphores litt&#233;raires de diff&#233;rents types et il a &#233;t&#233; possible d'en 
d&#233;river un indice qui distingue les &#233;nonc&#233;s m&#233;taphoriques d'&#233;nonc&#233;s litt&#233;raux. Bien s&#251;r, on 
n'insistera jamais assez sur le caract&#232;re exploratoire de la pr&#233;sente &#233;tude. Il se marque dans le 
mat&#233;riel analys&#233; (choix du v&#233;hicule et de la topique pour des expressions m&#233;taphoriques 
complexes) et dans une s&#233;rie de d&#233;cisions arbitraires prises lors de la constitution du corpus 
pour l'espace s&#233;mantique (uniquement des contes de Maupassant segment&#233;s en paragraphe 
d'au moins 50 mots et lemmatis&#233;s) et lors de la d&#233;composition en valeurs singuli&#232;res (150 
dimensions). M&#234;me si les valeurs choisies correspondent aux recommandations issues 
d'&#233;tudes ant&#233;rieures (voir note 1), chacune de ces d&#233;cisions m&#233;riterait une &#233;tude empirique 
afin d'en d&#233;terminer l'impact sur l'efficacit&#233; de l'algorithme. La possibilit&#233; d'obtenir des 
r&#233;sultats positifs avec un corpus d'une taille assez modeste est en soi tr&#232;s encourageant. Nous 
sommes n&#233;anmoins encore tr&#232;s loin de disposer, par la pr&#233;sente approche, d'une proc&#233;dure 
automatique pour l'identification et l'interpr&#233;tation de m&#233;taphores et de nombreuses autres 
recherches sont n&#233;cessaires afin de r&#233;pliquer et d'&#233;tendre ces r&#233;sultats. 
</p>
<p>Remerciements 
</p>
<p>Yves Bestgen est chercheur qualifi&#233; du Fonds National belge de la recherche scientifique. 
Cette recherche a b&#233;n&#233;fici&#233; du soutien apport&#233; par un cr&#233;dit FRFC.  
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Berry M.W. (1992), Large scale singular value computation. International journal of 
Supercomputer Application, Vol. 6, pp. 13-49. 
Fass D. (1991), met*: A method for discriminating metonymy and metaphor by computer, 
Computational Linguistics, Vol. 17, pp. 49-90. 
Ferrari S. (1996), A corpus-based approach for metaphor processing, Proceedings of LEDAR 
Workshop on Language Engineering for Document Analysis and Recognition, pp 114-121. 
Ferrari S., Giguet E, Lucas N, Vergne J. (2000), Projet LINGUIX, recherche d'informations et 
traitements linguistiques : le cas des m&#233;taphores, Actes du 3&#232;me colloque international sur le 
</p>
<p>336 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'analyse s&#233;mantique latente et l'interpr&#233;tation des m&#233;taphores 
</p>
<p>337 
</p>
<p>document &#233;lectronique (CIDE 2000), pp. 279-293. 
Cacciari C., Glucksberg S. (1994), Understanding figurative language. In Gernsbacher (Ed.), 
Handbook of psycholinguistics (pp. 447-477), Academy Press.  
Gibbs W.R. (1994), Figurative Thought and Figurative Language. In M.A. Gernsbacher (Ed.), 
Handbook of psycholinguistics (pp. 411-446). Academy Press. 
Glucksberg S., McGlone M.S. (1999), When love is not a journey: What metaphors mean, 
Journal of Pragmatics, Vol. 31, pp. 1541-1558. 
Glucksberg S., McGlone M.S., Manfredi D. (1997), Property attribution in metaphor 
comprehension, Journal of Memory and Language, Vol. 36, pp.50-67. 
Kintsch W. (2000), Metaphor comprehension: A computational theory, Psychonomic Bulletin 
and Review, Vol. 7, pp. 257-266. 
Kintsch W. (2001), Predication, Cognitive Science, Vol. 25, pp. 173-202. 
Landauer T.K., Foltz P.W., Laham D. (1998), An introduction to Latent Semantic Analysis. 
Discourse Processes, Vol. 25, pp. 259-284. 
Martin J. (1992), Computer understanding of conventionnal metaphoric language, Cognitive 
Science, Vol. 16, pp. 233-270. 
Miall D.S., Kuiken D. (1994), Foregrounding, Defamiliarization, and Affect Response to 
Literary Stories, Poetics, Vol. 22, pp. 389-407 </p>

</div></div>
</body></html>