<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Descriptions d&#8217;arbres avec polarit&#233;s : les Grammaires d&#8217;Interaction</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Descriptions d&#8217;arbres avec polarit&#233;s :
les Grammaires d&#8217;Interaction
</p>
<p>Guy Perrier
LORIA, CNRS
</p>
<p>BP 239
54506 Vand&#339;uvre-l&#232;s-Nancy Cedex France
</p>
<p>perrier@loria.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Grammaire formelle, Grammaire Cat&#233;gorielle, Description d&#8217;arbres
Formal Grammar, Categorial Grammar, Tree description
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Nous pr&#233;sentons un nouveau formalisme linguistique, les Grammaires d&#8217;Interaction, dont les
objets syntaxiques de base sont des descriptions d&#8217;arbres, c&#8217;est-&#224;-dire des formules logiques
sp&#233;cifiant partiellement des arbres syntaxiques. Dans ce contexte, l&#8217;analyse syntaxique se
traduit par la construction de mod&#232;les de descriptions sous la forme d&#8217;arbres syntaxiques com-
pl&#232;tement sp&#233;cifi&#233;s. L&#8217;op&#233;ration de composition syntaxique qui permet cette construction pas &#224;
pas est contr&#244;l&#233;e par un syst&#232;me de traits polaris&#233;s agissant comme des charges &#233;lectrostatiques.
</p>
<p>We present a new linguistic formalism, Interaction Grammars. The basic syntactic objects are
tree descriptions, that is logical formulas which specify syntactic trees partially. In this context,
parsing consists in building models of descriptions which are completely specified syntactic
trees. The operation of syntactic composition which allows this construction to go step by step
is controlled by a system of polarized features acting as electrostatic charges.
</p>
<p>Introduction
</p>
<p>La notion de description d&#8217;arbre a &#233;t&#233; introduite par (Vijay-Shanker, 1992) pour rendre l&#8217;op&#233;ration
d&#8217;adjonction des Grammaires d&#8217;Arbres Adjoints (TAG) monotone. Elle a ensuite &#233;t&#233; formalis&#233;e
et &#233;tudi&#233;e d&#8217;un point de vue math&#233;matique par (Rogers &amp; Vijay-Shanker, 1992). Elle a enfin
&#233;t&#233; &#224; la base de nouveaux formalismes linguistiques (Kallmeyer, 1999; Rambow et al., 2001).
L&#8217;int&#233;r&#234;t est de remplacer la manipulation d&#8217;arbres syntaxiques compl&#232;tement sp&#233;cifi&#233;s par
la manipulation de sp&#233;cifications partielles de ces arbres. Ainsi ces propri&#233;t&#233;s peuvent &#234;tre</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>combin&#233;es librement pour exprimer toute la complexit&#233; et la souplesse d&#8217;une langue. Cela
permet entre autres une organisation modulaire et hi&#233;rarchique des grammaires dans laquelle
l&#8217;information est factoris&#233;e au maximum (Candito, 1999). Ceci est d&#233;cisif pour la gestion et la
maintenance des grammaires &#224; large couverture. Les descriptions d&#8217;arbres permettent aussi de
repr&#233;senter des structures sous-sp&#233;cifi&#233;es et d&#8217;exprimer simplement l&#8217;ambigu&#239;t&#233; d&#8217;une langue
(Egg et al., 1998; Muskens, 2001). Enfin, cette approche s&#8217;inscrit dans une remise en cause
plus g&#233;n&#233;rale de la syntaxe g&#233;n&#233;rative (Blache, 1999).
Dans cette approche, l&#8217;analyse syntaxique consiste &#224; chercher des mod&#232;les de descriptions
d&#8217;arbres sous forme d&#8217;arbres syntaxiques compl&#232;tement sp&#233;cifi&#233;s. Dans toute sa g&#233;n&#233;ralit&#233;,
ce processus est hautement ind&#233;terministe. Pour &#234;tre r&#233;aliste, tout formalisme linguistique bas&#233;
sur les descriptions d&#8217;arbres restreint cet ind&#233;terminisme en contraignant la syntaxe des descrip-
tions et en d&#233;finissant &#224; partir de l&#224; une op&#233;ration de composition syntaxique des descriptions
qui permette de construire pas &#224; pas des arbres syntaxiques compl&#233;tement sp&#233;cifi&#233;s.
Les Grammaires d&#8217;Interaction, si elles s&#8217;inscrivent dans ce cadre, trouvent leur originalit&#233; dans
le m&#233;canisme qui fonde leur op&#233;ration de composition syntaxique et qui est r&#233;gi par un syst&#232;me
de polarit&#233;s. Cette notion de polarit&#233; est li&#233;e &#224; la dualit&#233; besoins-ressources qui est &#224; la base
des Grammaires Cat&#233;gorielles (Retor&#233;, 2001). Les syntagmes y sont consid&#233;r&#233;s comme des
ressources consommables. Selon que ces ressources sont disponibles ou qu&#8217;elles repr&#233;sentent
un besoin, elles sont positives ou n&#233;gatives d&#8217;o&#249; le lien avec la notion de polarit&#233;. Dans le
processus de composition syntaxique, les ressources compl&#233;mentaires vont chercher &#224; se neu-
traliser. Par exemple, un verbe transitif se cherche un sujet et un objet, ce qui peut se traduire
par le fait qu&#8217;il est porteur de deux besoins ou deux polarit&#233;s n&#233;gatives. Un syntagme nominal
se pr&#233;sente lui comme une ressource disponible, c&#8217;est-&#224;-dire porteur d&#8217;une polarit&#233; positive. Il
va donc pouvoir venir satisfaire un des besoins port&#233; par le verbe transitif ou, en d&#8217;autres termes,
une polarit&#233; positive va pouvoir venir neutraliser une polarit&#233; n&#233;gative.
La logique lin&#233;aire (Retor&#233;, 2001) &#233;tant caract&#233;ris&#233;e comme une logique sensible aux ressources,
c&#8217;est vers elle que nous nous sommes tourn&#233;s pour &#233;baucher une premi&#232;re formalisation des
Grammaires d&#8217;Interaction (Perrier, 2000a; Perrier, 2000b). Dans ce papier, pour d&#233;finir formelle-
ment les Grammaires d&#8217;Interaction, nous adoptons un cadre plus familier puisqu&#8217;il s&#8217;agit de la
th&#233;orie des mod&#232;les de la logique classique.
</p>
<p>1 La forme des descriptions syntaxiques
</p>
<p>Les objets de base des Grammaires d&#8217;Interaction sont les descriptions syntaxiques. Celles-ci
sont construites &#224; partir d&#8217;une signature compos&#233;e d&#8217;un ensemble d&#233;nombrable &#0; de n&#339;uds
syntaxiques et d&#8217;une base de traits &#1; . Les n&#339;uds syntaxiques repr&#233;sentent des syntagmes et
les traits permettent d&#8217;exprimer les propri&#233;t&#233;s linguistiques de ces syntagmes. La base de traits
&#1; est un ensemble fini de couples &#0;&#0;&#1;&#2;
</p>
<p>&#0;
</p>
<p>&#1; form&#233;s d&#8217;un nom de trait &#0; auquel est associ&#233;
l&#8217;ensemble &#2;
</p>
<p>&#0;
</p>
<p>de toutes les valeurs atomiques possibles qu&#8217;il peut prendre. Par exemple, si
F=genre, &#2;
</p>
<p>&#0;
</p>
<p>={m,f}.
L&#8217;originalit&#233; des Grammaires d&#8217;Interaction est que les traits y sont polaris&#233;s. Ils sont positifs,
n&#233;gatifs ou neutres selon qu&#8217;ils repr&#233;sentent une ressource disponible, une ressource attendue
ou un &#233;l&#233;ment d&#8217;information qui n&#8217;est pas une ressource consommable. Par exemple, un nom
propre est porteur d&#8217;un trait positif cat avec la valeur sn qui exprime qu&#8217;il est une ressource
disponible en tant que syntagme nominal. En m&#234;me temps, il est porteur d&#8217;un trait n&#233;gatif fonct
avec une valeur ind&#233;termin&#233;e pour exprimer qu&#8217;il attend de recevoir une fonction syntaxique
dans la phrase. Par contre, un verbe transitif poss&#232;de dans sa repr&#233;sentation syntaxique un</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Descriptions d&#8217;arbres avec polarit&#233;s : les Grammaires d&#8217;Interaction
</p>
<p>n&#339;ud repr&#233;sentant son objet porteur d&#8217;un trait n&#233;gatif cat avec la valeur sn pour indiquer qu&#8217;il
attend un syntagme nominal. Ce n&#339;ud est pourvu en m&#234;me temps d&#8217;un trait positif fonct avec
la valeur obj pour indiquer que le verbe va fournir la fonction syntaxique objet &#224; ce syntagme
attendu. Les traits d&#8217;accord sont, quant &#224; eux, toujours des traits neutres.
D&#233;finissons formellement les notions de valeur de trait et de trait polaris&#233;.
</p>
<p>D&#233;finition 1.1 Si &#0; est un nom de trait tir&#233; de &#1; , une valeur du trait &#0; est une partie non vide
de &#2;
</p>
<p>&#0;
</p>
<p>, &#233;ventuellement accompagn&#233;e d&#8217;un indice entier.
Un trait polaris&#233; sur &#1; est un triplet form&#233; d&#8217;un nom de trait &#0; , d&#8217;une polarit&#233; qui est l&#8217;une des
valeurs -1, 0, +1, et d&#8217;une valeur du trait &#0; .
</p>
<p>Selon la polarit&#233; -1, 0, +1 d&#8217;un trait dont le nom est &#0; et la valeur &#3; , ce trait sera not&#233; &#0; &#2; &#3; ,
&#0; &#2; &#3; ou &#0; &#3; &#3; . Si &#3; est &#233;gale &#224; &#2;
</p>
<p>&#0;
</p>
<p>, elle est omise sinon elle est not&#233;e de fa&#231;on extensive
en indiquant ses &#233;l&#233;ments s&#233;par&#233;s par l&#8217;op&#233;rateur de disjonction &#4;. &#3; comporte un indice &#4;
quand on veut que cette valeur soit partag&#233;e par un autre trait comportant le m&#234;me indice &#4; . &#3;
est alors not&#233;e par &#5; &#4; &#6; suivie de la valeur effective.
Voici quelques exemples de traits polaris&#233;s:
</p>
<p>&#7;&#8;&#9;&#3; &#10;&#11;&#1; &#12;&#13;&#11;&#7;&#9;&#2;&#1; &#7;&#8;&#9;&#2;&#5; &#3; &#6; &#0;&#10;&#11; &#4; &#7;&#13;&#14;&#15;&#1;&#1; &#16;&#17;&#11;&#18;&#17; &#2; &#14;&#1; &#16;&#17;&#11;&#18;&#17; &#2;&#5; &#4; &#6;
</p>
<p>Venons en maintenant &#224; la d&#233;finition d&#8217;une description syntaxique.
</p>
<p>D&#233;finition 1.2 Une description syntaxique sur une signature (&#0; ,&#1; ) est une formule logique
classique &#2; d&#233;finie par la grammaire suivante:
</p>
<p>&#2; &#5;&#5;&#2; &#5; &#6; &#7; &#6; &#2; &#8;&#2; &#6; &#19; &#6; &#19; &#6; &#19; &#6;
</p>
<p>&#0;
</p>
<p>&#19; &#6; &#19; &#9; &#19; &#6; &#19; &#2; &#19; &#6; &#19; &#5; &#20;
</p>
<p>o&#249; &#19; repr&#233;sente un n&#339;ud quelconque de &#0; et &#20; un trait polaris&#233; quelconque sur &#1; .
</p>
<p>&#5; et &#7; sont les constantes logiques vrai et faux. Les relations &#6;, &#6;&#0; et &#5; repr&#233;sentent des
relations binaires de parent&#233; imm&#233;diate, domination et pr&#233;c&#233;dence sur &#0; . Pour composer des
descriptions, nous nous contentons d&#8217;utiliser la conjonction mais on peut enrichir la composition
avec la disjonction et m&#234;me la n&#233;gation.
La figure 1 donne un exemple de description syntaxique pr&#233;sent&#233;e sous une forme logique &#224;
</p>
<p>(sn2 sn1) (sn2 rel) (sn1  rel) 
</p>
<p>*(p1 obj1) 
(rel pro) (rel p1) (pro  p1) 
</p>
<p>(sn2: 
rel
</p>
<p>pro
</p>
<p>obj1
</p>
<p>cat = pro
phon = &quot;que&quot;
</p>
<p>phon = &quot;&quot;
</p>
<p>cat = rel
</p>
<p>gen =  &lt;1&gt;
num =  &lt;2&gt;
</p>
<p>num =  &lt;2&gt;
gen =  &lt;1&gt;
</p>
<p>gen =  &lt;1&gt;
num =  &lt;2&gt;
</p>
<p>sn2
</p>
<p>sn1
cat &lt;&#8722; sn
</p>
<p>cat &#8722;&gt; sn
</p>
<p>cat &#8722;&gt; sn
fonct &lt;&#8722; obj
</p>
<p>fonct &#8722;&gt; &lt;3&gt;
</p>
<p>fonct &lt;&#8722; &lt;3&gt;
</p>
<p>cat &lt;&#8722; p
p1
</p>
<p>cat &#8722;&gt; sn ) (sn2: fonct &lt;&#8722; &lt;3&gt; ) 
(sn2: gen =  &lt;1&gt; ) (sn2: num =  &lt;2&gt; ) 
(sn1: cat &lt;&#8722; sn ) (sn1: fonct &#8722;&gt; &lt;3&gt; ) 
(sn1: gen =  &lt;1&gt; ) (sn1: num =  &lt;2&gt; ) 
(rel: cat = rel ) 
(pro: cat = pro ) (pro: phon = &quot;que&quot; ) 
(p1: cat &lt;&#8722; p ) 
(obj1: cat &#8722;&gt; sn ) (obj1: fonct &lt;&#8722; obj ) 
(obj1: phon = &quot;&quot; ) (obj1: gen =  &lt;1&gt; ) (obj1: num =  &lt;2&gt; ) 
</p>
<p>Figure 1: Description syntaxique repr&#233;sentant une entr&#233;e lexicale possible pour le pronom re-
latif que
</p>
<p>gauche et graphique &#224; droite. Les relations de parent&#233; imm&#233;diate, domination et pr&#233;c&#233;dence
sont repr&#233;sent&#233;es respectivement par des traits continus, discontinus et par des fl&#232;ches.
Cette description exprime la configuration syntaxique dans laquelle doit s&#8217;inscrire le pronom
relatif que. Les n&#339;uds sn1 et p1 repr&#233;sentent le syntagme nominal et la proposition relative qui
sont attendus respectivement &#224; gauche et &#224; droite du pronom. Le n&#339;ud obj1 repr&#233;sente l&#8217;objet</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>qui est fourni par le pronom &#224; la relative. Cet objet peut &#234;tre compl&#233;ment du verbe qui est la
t&#234;te de la relative mais il peut aussi &#234;tre compl&#233;ment du verbe t&#234;te d&#8217;une compl&#233;tive ench&#226;ss&#233;e
plus ou moins profond&#233;ment dans la relative comme dans l&#8217;expression Marie que Jean pense
que Pierre souhaite rencontrer. C&#8217;est pourquoi la relation de domination entre p1 et obj1 est
non sp&#233;cifi&#233;e.
</p>
<p>2 Les arbres syntaxiques comme mod&#232;les minimaux et neu-
tres de descriptions syntaxiques
</p>
<p>Maintenant que l&#8217;on a camp&#233; les objets syntaxiques de base, les descriptions syntaxiques, on
peut d&#233;finir formellement une grammaire d&#8217;interaction1.
</p>
<p>D&#233;finition 2.1 Une grammaire d&#8217;interaction sur une signature (&#0; ,&#1; ) est d&#233;finie par son lex-
ique, c&#8217;est-&#224;-dire une fonction qui &#224; tout mot d&#8217;un vocabulaire &#10; associe un ensemble fini de
couples &#0;&#2;&#1;&#21;&#1; o&#249; &#2; est une description syntaxique sur (&#0; ,&#1; ) et &#21; est un n&#339;ud de &#2; distingu&#233;
comme ancre.
</p>
<p>Pour une grammaire d&#8217;interaction donn&#233;e, il s&#8217;agit maintenant de d&#233;finir le langage qu&#8217;elle
engendre. Cette d&#233;finition s&#8217;appuie sur la notion de mod&#232;le d&#8217;une description d&#8217;arbre, telle
quelle est &#233;tablie par (Rogers &amp; Vijay-Shanker, 1992). Cette notion est particularis&#233;e par une
condition de neutralit&#233; qui donne une s&#233;mantique &#224; la notion de polarit&#233;.
</p>
<p>D&#233;finition 2.2 Un mod&#232;le minimal et neutre d&#8217;une description syntaxique &#2; est un couple
form&#233; d&#8217;un arbre &#21; et d&#8217;une interpr&#233;tation &#4; .
&#21; est ordonn&#233; localement2 et ses n&#339;uds sont &#233;tiquet&#233;s par des structures de traits de la forme
&#0;&#0; &#5; &#3; &#1; o&#249; &#0; est un nom de trait issu de &#1; et &#3; est un &#233;l&#233;ment de &#2;
</p>
<p>&#0;
</p>
<p>.
</p>
<p>&#4; est une fonction de l&#8217;ensemble &#6;&#2;&#6; des n&#339;uds de &#2; dans l&#8217;ensemble &#6;&#21;&#6; des n&#339;uds de &#21; qui
v&#233;rifie les propri&#233;t&#233;s suivantes:
</p>
<p>1. Pour tout pr&#233;dicat &#0;&#19; &#5; &#20; &#1; qui compose &#2;, la structure de traits de &#4;&#0;&#19;&#1; comprend un
trait de m&#234;me nom que &#20; avec une valeur figurant dans &#20; .
</p>
<p>2. Si &#2; comporte deux pr&#233;dicats &#0;&#19;
&#0;
</p>
<p>&#5; &#20;
</p>
<p>&#0;
</p>
<p>&#1; et &#0;&#19;
&#1;
</p>
<p>&#5; &#20;
</p>
<p>&#1;
</p>
<p>&#1; o&#249; &#20;
&#0;
</p>
<p>et &#20;
&#1;
</p>
<p>sont des traits index&#233;s
par le m&#234;me entier, &#4;&#0;&#19;
</p>
<p>&#0;
</p>
<p>&#1; et &#4;&#0;&#19;
&#1;
</p>
<p>&#1; doivent avoir dans leurs structures de traits la m&#234;me
valeur pour les traits correspondants.
</p>
<p>3. (condition de neutralit&#233;) Pour tout n&#339;ud &#19; de &#21; et pour tout nom de trait &#0; pr&#233;sent
dans l&#8217;&#233;tiquette de &#19; , deux cas seulement sont possibles: soit il n&#8217;existe pas dans &#2; de
pr&#233;dicat de la forme &#0;&#19; &#1; &#5; &#0; &#3; &#3; &#1;&#1; ou &#0;&#19; &#1; &#5; &#0; &#2; &#3; &#1;&#1; tel que &#4;&#0;&#19; &#1;&#1; &#2; &#19; soit il existe
exactement un pr&#233;dicat de la forme &#0;&#19; &#1; &#5; &#0; &#3; &#3; &#1;&#1; tel que &#4;&#0;&#19; &#1;&#1; &#2; &#19; et un pr&#233;dicat de
la forme &#0;&#19; &#1;&#1; &#5; &#0; &#2; &#3; &#1;&#1;&#1; tel que &#4;&#0;&#19; &#1;&#1;&#1; &#2; &#19; .
</p>
<p>4. Si &#2; comporte une relation &#19;
&#0;
</p>
<p>&#6; &#19;
</p>
<p>&#1;
</p>
<p>, &#4;&#0;&#19;
&#0;
</p>
<p>&#1; est le p&#232;re de &#4;&#0;&#19;
&#1;
</p>
<p>&#1; dans &#21;.
1Nous avons choisi une pr&#233;sentation lexicalis&#233;e des Grammaires d&#8217;Interaction mais on peut tr&#232;s bien les d&#233;finir
</p>
<p>de fa&#231;on non lexicalis&#233;e en se donnant un ensemble de descriptions &#233;l&#233;mentaires.
2Un arbre localement ordonn&#233; est un arbre dans lequel chaque n&#339;ud a l&#8217;ensemble de ses fils qui est totalement
</p>
<p>ordonn&#233;. Cette relation d&#8217;ordre est &#233;tendue par h&#233;ritage.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Descriptions d&#8217;arbres avec polarit&#233;s : les Grammaires d&#8217;Interaction
</p>
<p>5. Si &#2; comporte une relation &#19;
&#0;
</p>
<p>&#6;
</p>
<p>&#0;
</p>
<p>&#19;
</p>
<p>&#1;
</p>
<p>, &#4;&#0;&#19;
&#0;
</p>
<p>&#1; est un anc&#234;tre de &#4;&#0;&#19;
&#1;
</p>
<p>&#1; ou &#233;gal &#224; &#4;&#0;&#19;
&#1;
</p>
<p>&#1;
</p>
<p>dans &#21;.
</p>
<p>6. Si &#2; comporte une relation &#19;
&#0;
</p>
<p>&#9; &#19;
</p>
<p>&#1;
</p>
<p>, &#4;&#0;&#19;
&#0;
</p>
<p>&#1; pr&#233;c&#232;de &#4;&#0;&#19;
&#1;
</p>
<p>&#1; dans &#21; pour l&#8217;ordre local
qui lui est attach&#233;.
</p>
<p>7. Si &#2; comporte une relation &#19;
&#0;
</p>
<p>&#2; &#19;
</p>
<p>&#1;
</p>
<p>, &#4;&#0;&#19;
&#0;
</p>
<p>&#1; est &#233;gal &#224; &#4;&#0;&#19;
&#1;
</p>
<p>&#1;.
</p>
<p>8. (condition de minimalit&#233;) Si &#19;
&#0;
</p>
<p>est le p&#232;re d&#8217;un n&#339;ud &#19;
&#1;
</p>
<p>dans &#21;, il existe au moins une
relation &#19; &#1;
</p>
<p>&#0;
</p>
<p>&#6; &#19;
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>dans &#2; telle que &#19;
&#0;
</p>
<p>&#2; &#4;&#0;&#19;
</p>
<p>&#1;
</p>
<p>&#0;
</p>
<p>&#1; et &#19;
&#1;
</p>
<p>&#2; &#4;&#0;&#19;
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>Une description syntaxique qui poss&#232;de un mod&#232;le minimal et neutre est dite valide.
</p>
<p>La notion de mod&#232;le minimal et neutre va nous permettre maintenant de caract&#233;riser les struc-
tures syntaxiques acceptables d&#8217;une grammaire d&#8217;interaction ainsi que les phrases grammati-
cales.
</p>
<p>D&#233;finition 2.3 Soit une grammaire d&#8217;interaction &#22; d&#233;finie sur un vocabulaire &#10; par son lex-
ique &#23;. Une phrase &#24;
</p>
<p>&#0;
</p>
<p>&#25; &#25; &#25; &#25; &#25;&#24;
</p>
<p>&#1;
</p>
<p>de &#10;&#0; est grammaticale si on peut trouver dans chaque entr&#233;e
lexicale&#23;&#0;&#24;
</p>
<p>&#2;
</p>
<p>&#1; un &#233;l&#233;ment &#0;&#2;
&#2;
</p>
<p>&#1; &#21;
</p>
<p>&#2;
</p>
<p>&#1; tel que la description &#2;
&#0;
</p>
<p>&#8; &#11; &#11; &#11; &#8; &#2;
</p>
<p>&#1;
</p>
<p>&#8; &#0;&#21;
</p>
<p>&#0;
</p>
<p>&#9; &#21;
</p>
<p>&#1;
</p>
<p>&#1; &#8; &#11; &#11; &#11; &#8;
</p>
<p>&#0;&#21;
</p>
<p>&#1;&#2;&#0;
</p>
<p>&#9; &#21;
</p>
<p>&#1;
</p>
<p>&#1;&#8; &#0;&#19; &#6;
</p>
<p>&#0;
</p>
<p>&#26;&#13;&#13;&#9;&#0;&#2;
</p>
<p>&#0;
</p>
<p>&#1;&#1;&#8; &#11; &#11; &#11; &#8; &#0;&#19; &#6;
</p>
<p>&#0;
</p>
<p>&#26;&#13;&#13;&#9;&#0;&#2;
</p>
<p>&#1;
</p>
<p>&#1;&#1;&#8; &#0;&#19; &#5; &#7;&#8;&#9;&#2; &#15;&#1;, o&#249; &#19; est un nom
de n&#339;ud ne figurant pas dans &#2;
</p>
<p>&#0;
</p>
<p>&#1; &#25; &#25; &#25; &#1; &#2;
</p>
<p>&#1;
</p>
<p>, soit valide 3.
Si c&#8217;est le cas, tout mod&#232;le de cette description repr&#233;sente un arbre syntaxique de la phrase
&#24;
</p>
<p>&#0;
</p>
<p>&#25; &#25; &#25; &#25; &#25;&#24;
</p>
<p>&#1;
</p>
<p>.
</p>
<p>La description qui est le centre de cette d&#233;finition peut &#234;tre d&#233;coup&#233;e en 3 parties:
</p>
<p>&#12; &#2;
</p>
<p>&#0;
</p>
<p>&#8; &#11; &#11; &#11; &#8;&#2;
</p>
<p>&#1;
</p>
<p>repr&#233;sente les ressources lexicales utilis&#233;es pour l&#8217;analyse;
</p>
<p>&#12; &#0;&#21;
</p>
<p>&#0;
</p>
<p>&#9; &#21;
</p>
<p>&#1;
</p>
<p>&#1; &#8; &#11; &#11; &#11; &#8; &#0;&#21;
</p>
<p>&#1;&#2;&#0;
</p>
<p>&#9; &#21;
</p>
<p>&#1;
</p>
<p>&#1; repr&#233;sente l&#8217;ordre de pr&#233;c&#233;dence entre les ancres qui
correspond &#224; l&#8217;ordre des mots dans la phrase.
</p>
<p>&#12; Enfin &#0;&#19; &#6;&#0; &#26;&#13;&#13;&#9;&#0;&#2;
&#0;
</p>
<p>&#1;&#1;&#8;&#11; &#11; &#11;&#8;&#0;&#19; &#6;
</p>
<p>&#0;
</p>
<p>&#26;&#13;&#13;&#9;&#0;&#2;
</p>
<p>&#1;
</p>
<p>&#1;&#1; &#8;&#0;&#19; &#5; &#7;&#8;&#9;&#2; &#15;&#1; permet de caract&#233;riser
le syntagme &#19; qui repr&#233;sente la phrase &#224; analyser. Il est la racine de la description
g&#233;n&#233;rale, ce que nous exprimons en introduisant pour chaque description &#2;
</p>
<p>&#2;
</p>
<p>une racine
&#26;&#13;&#13;&#9;&#0;&#2;
</p>
<p>&#2;
</p>
<p>&#1;. Par d&#233;finition,&#26;&#13;&#13;&#9;&#0;&#2;
&#2;
</p>
<p>&#1; est un n&#339;ud de &#2;
&#2;
</p>
<p>qui n&#8217;est pas domin&#233; et qui n&#8217;a pas
de p&#232;re. Nous supposons l&#8217;unicit&#233; d&#8217;un tel n&#339;ud mais cette hypoth&#232;se n&#8217;est pas vraiment
indispensable &#224; la d&#233;finition 2.3. Le pr&#233;dicat &#0;&#19; &#5; &#7;&#8;&#9; &#2; &#15;&#1; indique que le n&#339;ud &#19;
attend un syntagme de type proposition.
</p>
<p>Illustrons la d&#233;finition 2.3 par l&#8217;analyse de la phrase Marie que Jean a vue dort. La figure 2
pr&#233;sente la description syntaxique &#2;
</p>
<p>&#2;
</p>
<p>fournie par un lexique pour analyser cette phrase. On y
retrouve l&#8217;entr&#233;e lexicale du pronom relatif que pr&#233;sent&#233;e dans la figure 1. Pour simplifier la
description, nous supposons que a vue forme un seul mot. Dans l&#8217;entr&#233;e lexicale de celui-ci, on
peut pr&#233;voir que l&#8217;objet du verbe est plac&#233; avant &#233;tant donn&#233; le genre du participe pass&#233;. Cela
se traduit dans la description par le fait qu&#8217;on trouve &#224; la place canonique de l&#8217;objet une trace
(sa forme phonologique est vide) repr&#233;sent&#233;e par le n&#339;ud obj2. La figure 3 repr&#233;sente l&#8217;unique
mod&#232;le de la description &#2;
</p>
<p>&#2;
</p>
<p>qui constitue l&#8217;unique arbre syntaxique de la phrase Marie que
Jean a vue dort et qui d&#233;montre sa grammaticalit&#233;.
</p>
<p>3On suppose que les noms de n&#339;uds et les indices de traits pr&#233;sents dans les &#0;
&#0;
</p>
<p>sont locaux &#224; ces descriptions,
sinon on proc&#232;de &#224; un renommage.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>p4 cat &lt;&#8722; p
</p>
<p>Jean
</p>
<p>rel
</p>
<p>pro
</p>
<p>obj1
</p>
<p>cat = pro
phon = &quot;que&quot;
</p>
<p>phon = &quot;&quot;
</p>
<p>gen =  &lt;1&gt;
</p>
<p>gen =  &lt;1&gt;
</p>
<p>gen =  &lt;1&gt;
</p>
<p>nb =  &lt;2&gt;
</p>
<p>cat &lt;&#8722; sn
fonct &#8722;&gt; &lt;3&gt;
</p>
<p>cat &#8722;&gt; sn
fonct &lt;&#8722; &lt;3&gt;
</p>
<p>cat &lt;&#8722; p
</p>
<p>fonct &lt;&#8722; obj
cat &#8722;&gt; sn
</p>
<p>nb =  &lt;2&gt;
</p>
<p>phon = &quot;&quot;
</p>
<p>cat &lt;&#8722; sn
fonct &#8722;&gt; obj
</p>
<p>phon = &quot;a&quot;
cat = aux
</p>
<p>aux v0
</p>
<p>obj2
</p>
<p>suj2
</p>
<p>v3
</p>
<p>v4
</p>
<p>cat &#8722;&gt; v
</p>
<p>cat &lt;&#8722; v
cat &lt;&#8722; sn
</p>
<p>fonct &#8722;&gt; suj
</p>
<p>cat &lt;&#8722; pv1
</p>
<p>v2suj1
</p>
<p>cat &#8722;&gt; v mode = ind
temps = pass&#233;&#8722;comp
</p>
<p>p2
</p>
<p>p3
</p>
<p>mode = &lt;4&gt;
temps = &lt;5&gt;
</p>
<p>cat &lt;&#8722; p
</p>
<p>nb =  sg
</p>
<p>Marie
</p>
<p>que
</p>
<p>a vue
</p>
<p>cat &#8722;&gt; sn
fonct &lt;&#8722;
</p>
<p>cat = rel
</p>
<p>cat &lt;&#8722; sn
fonct &#8722;&gt; suj
</p>
<p>pers=3
nb =  sg
</p>
<p>cat = v
</p>
<p>phon = &quot;vue&quot;
nb =  sg
</p>
<p>nb =  sg
gen =  f
phon = &quot;Marie&quot;
</p>
<p>gen =  m
</p>
<p>cat &#8722;&gt; sn
fonct &lt;&#8722;
</p>
<p>phon = &quot;Jean&quot;
</p>
<p>nb =  sg
</p>
<p>mode = &lt;4&gt;
temps = &lt;5&gt;
</p>
<p>cat &lt;&#8722; v
</p>
<p>temps = &lt;5&gt;
mode = &lt;4&gt;
</p>
<p>dort
</p>
<p>pers = 3
</p>
<p>phon = &quot;dort&quot;mode = ind
temps = pr&#233;s
</p>
<p>mode = &lt;4&gt;
temps = &lt;5&gt;
</p>
<p>sn0
</p>
<p>sn1
</p>
<p>sn2
</p>
<p>sn3
</p>
<p>p1
gen =  f
</p>
<p>nb =  &lt;2&gt;
</p>
<p>Figure 2: Description syntaxique &#2;
&#2;
</p>
<p>utilis&#233;e pour l&#8217;analyse de la phrase Marie que Jean a vue
dort
</p>
<p>3 La composition syntaxique comme m&#233;canisme de neutral-
isation des traits polaris&#233;s
</p>
<p>La d&#233;finition 2.2, si elle fournit un moyen de reconna&#238;tre un mod&#232;le minimal et neutre d&#8217;une
description syntaxique, ne d&#233;crit pas de m&#233;canisme qui permette de construire un tel mod&#232;le.
Le lexique fournit un ensemble de descriptions syntaxiques &#2;
</p>
<p>&#0;
</p>
<p>&#1; &#25; &#25; &#25; &#1; &#2;
</p>
<p>&#1;
</p>
<p>correspondant aux dif-
f&#233;rents mots d&#8217;une phrase &#224; analyser. Celles-ci sont rassembl&#233;e en une seule description &#2; dont
il s&#8217;agit de trouver un mod&#232;le. De fait, les descriptions &#2;
</p>
<p>&#0;
</p>
<p>&#1; &#25; &#25; &#25; &#1; &#2;
</p>
<p>&#1;
</p>
<p>ne sont que juxtapos&#233;es au
sein de &#2;, ce qui laisse beaucoup d&#8217;ind&#233;terminisme quant &#224; la fa&#231;on de trouver un mod&#232;le de
&#2;. Un moyen de r&#233;duire cet ind&#233;terminisme est de d&#233;finir un m&#233;canisme de composition des
descriptions &#2;
</p>
<p>&#0;
</p>
<p>&#1; &#25; &#25; &#25; &#1; &#2;
</p>
<p>&#1;
</p>
<p>qui permette de pr&#233;ciser pas &#224; pas les contours d&#8217;un &#233;ventuel mod&#232;le
pour aboutir &#224; une description compl&#232;tement sp&#233;cifi&#233;e d&#8217;un arbre syntaxique telle que ce dernier
s&#8217;en d&#233;duise imm&#233;diatement. Il faut bien entendu que ce m&#233;canisme garantisse les propri&#233;t&#233;s
suivantes : si &#2; n&#8217;est pas valide, toute description qui est obtenue &#224; partir de &#2; par ce m&#233;can-
isme doit &#234;tre non valide et si &#2; est valide, il doit exister une fa&#231;on d&#8217;appliquer ce m&#233;canisme
qui aboutisse &#224; une description valide.
Tout formalisme qui s&#8217;exprime &#224; l&#8217;aide de descriptions d&#8217;arbres fournit en m&#234;me temps un tel
m&#233;canisme de composition syntaxique. Dans les TAG par exemple, il est constitu&#233; des deux
op&#233;rations de substitution et d&#8217;adjonction, la premi&#232;re pouvant s&#8217;exprimer &#224; l&#8217;aide de la sec-
onde.
Pour les Grammaires d&#8217;Interaction, nous allons nous appuyer sur l&#8217;exigence de neutralit&#233; des
</p>
<p>mod&#232;les pour d&#233;finir l&#8217;unique op&#233;ration qui va servir &#224; r&#233;aliser la composition syntaxique et que
nous appellerons neutralisation &#233;l&#233;mentaire.
</p>
<p>D&#233;finition 3.1 Si une description syntaxique &#2;
&#0;
</p>
<p>comporte deux pr&#233;dicats &#0;&#19;
&#0;
</p>
<p>&#5; &#0; &#3; &#3;
</p>
<p>&#0;
</p>
<p>&#1; et
&#0;&#19;
</p>
<p>&#1;
</p>
<p>&#5; &#0; &#2; &#3;
</p>
<p>&#1;
</p>
<p>&#1;, la description syntaxique &#2;
&#1;
</p>
<p>qui r&#233;sulte de la neutralisation &#233;l&#233;mentaire de ces
deux traits est d&#233;finie de la fa&#231;on suivante: si &#2;
</p>
<p>&#0;
</p>
<p>comporte deux pr&#233;dicats &#0;&#19;
&#0;
</p>
<p>&#5; &#0;
</p>
<p>&#1;
</p>
<p>&#15;&#13;&#27;
</p>
<p>&#0;
</p>
<p>&#3;
</p>
<p>&#0;
</p>
<p>&#1; et
&#0;&#19;
</p>
<p>&#1;
</p>
<p>&#5; &#0;
</p>
<p>&#1;
</p>
<p>&#15;&#13;&#27;
</p>
<p>&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#1; et si &#6;&#15;&#13;&#27;
&#0;
</p>
<p>&#6; &#15;&#13;&#27;
</p>
<p>&#1;
</p>
<p>&#6; &#6; &#7; ou si &#3;
&#0;
</p>
<p>&#13; &#3;
</p>
<p>&#1;
</p>
<p>&#2; &#14;, alors &#2;
&#1;
</p>
<p>&#2; &#7; sinon &#2;
&#1;
</p>
<p>s&#8217;obtient en
substituant&#19;
</p>
<p>&#0;
</p>
<p>&#224; &#19;
&#1;
</p>
<p>dans &#2;
&#0;
</p>
<p>et en rempla&#231;ant tous les pr&#233;dicats de la forme &#0;&#19;
&#0;
</p>
<p>&#5; &#0;
</p>
<p>&#1;
</p>
<p>&#15;&#13;&#27;
</p>
<p>&#0;
</p>
<p>&#3;
</p>
<p>&#0;
</p>
<p>&#1; et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Descriptions d&#8217;arbres avec polarit&#233;s : les Grammaires d&#8217;Interaction
</p>
<p>rel
</p>
<p>pro
</p>
<p>cat = rel
</p>
<p>aux v0
</p>
<p>cat = pro
phon = &quot;que&quot;
</p>
<p>gen =  f
</p>
<p>cat = sn
fonct =suj
</p>
<p>nb =  sg
</p>
<p>gen =  f
fonct =suj
</p>
<p>nb =  sg
</p>
<p>cat = sn
</p>
<p>Marie que Jean a vue dort
</p>
<p>pers = 3
</p>
<p>phon = &quot;Marie&quot;
</p>
<p>temps = pr&#233;s
mode = ind
</p>
<p>phon = &quot;dort&quot;
</p>
<p>cat = v
phon = &quot;vue&quot;
</p>
<p>cat = aux
phon = &quot;a&quot;
</p>
<p>nb =  sg
</p>
<p>phon = &quot;Jean&quot;
</p>
<p>mode = ind
temps = pass&#233;&#8722;comp
</p>
<p>fonct = obj
cat = sn
</p>
<p>phon = &quot;&quot;
</p>
<p>pers=3gen =  m
nb =  sg
</p>
<p>fonct = suj
cat = sn
</p>
<p>mode = ind
temps = pr&#233;s
</p>
<p>cat = v
</p>
<p>temps = pass&#233;&#8722;comp
mode = ind
</p>
<p>cat = p
</p>
<p>cat = p
</p>
<p>cat = v
</p>
<p>sn0&#8722;sn1
</p>
<p>sn2&#8722;suj2
</p>
<p>p3&#8722;p4
</p>
<p>v3&#8722;v4
</p>
<p>p1&#8722;p2
</p>
<p>sn3&#8722;suj1 obj1&#8722;obj2
</p>
<p>v1&#8722;v2
</p>
<p>gen =  f
</p>
<p>Figure 3: Arbre syntaxique de la phrase Marie que Jean a vue dort mod&#232;le de la description &#2;
&#2;
</p>
<p>&#0;&#19;
</p>
<p>&#1;
</p>
<p>&#5; &#0;
</p>
<p>&#1;
</p>
<p>&#15;&#13;&#27;
</p>
<p>&#1;
</p>
<p>&#3;
</p>
<p>&#1;
</p>
<p>&#1; par un unique pr&#233;dicat &#0;&#19;
&#0;
</p>
<p>&#5; &#0;
</p>
<p>&#1;
</p>
<p>&#0;&#15;&#13;&#27;
</p>
<p>&#0;
</p>
<p>&#6; &#15;&#13;&#27;
</p>
<p>&#1;
</p>
<p>&#1;&#3;
</p>
<p>&#0;
</p>
<p>&#13; &#3;
</p>
<p>&#1;
</p>
<p>&#1; et si &#3;
&#0;
</p>
<p>ou &#3;
&#1;
</p>
<p>comporte
des indices, on les conserve en les identifiant.
On note alors: &#2;
</p>
<p>&#0;
</p>
<p>&#3;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#3;&#3;
</p>
<p>&#1;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#1;
</p>
<p>.
</p>
<p>Une neutralisation &#233;l&#233;mentaire est donc une op&#233;ration qui consiste &#224; identifier deux n&#339;uds por-
teurs de traits duaux. Donnons en un exemple en reprenant la description &#2;
</p>
<p>&#2;
</p>
<p>de la figure 2. En
effectuant une neutralisation &#233;l&#233;mentaire du trait &#7;&#8;&#9; &#3; &#10;&#11; du n&#339;ud sn0 par le trait &#7;&#8;&#9; &#2; &#10;&#11;
du n&#339;ud sn1, on obtient la description &#2;
</p>
<p>&#0;
</p>
<p>dont la figure 4 pr&#233;sente la partie qui a &#233;t&#233; modifi&#233;e4.
A la suite d&#8217;une neutralisation &#233;l&#233;mentaire, il est utile de simplifier la description obtenue,
</p>
<p>Marie que
</p>
<p>p4 cat &lt;&#8722; p
</p>
<p>rel
</p>
<p>pro
</p>
<p>obj1
</p>
<p>cat = pro
phon = &quot;que&quot;
</p>
<p>phon = &quot;&quot;
</p>
<p>gen =  &lt;1&gt;
</p>
<p>cat &#8722;&gt; sn
fonct &lt;&#8722; &lt;3&gt;
</p>
<p>fonct &lt;&#8722; obj
cat &#8722;&gt; sn
</p>
<p>nb =  &lt;2&gt;
</p>
<p>cat = relgen =  &lt;1&gt;f
</p>
<p>cat = sn
fonct = &lt;3&gt;
</p>
<p>nb =  &lt;2&gt;sg
</p>
<p>sn2
</p>
<p>p1
</p>
<p>sn0&#8722;sn1
</p>
<p>gen =  &lt;1&gt;
nb =  &lt;2&gt;
</p>
<p>cat &lt;&#8722; p
</p>
<p>Figure 4: Vue partielle de la description syntaxique &#2;
&#0;
</p>
<p>r&#233;sultant d&#8217;une op&#233;ration de neutralisa-
tion &#233;l&#233;mentaire sur &#2;
</p>
<p>&#2;
</p>
<p>c&#8217;est-&#224;-dire de la remplacer par une description plus simple &#233;quivalente logiquement dans la
th&#233;orie des arbres localement ordonn&#233;s. Ainsi dans la description &#2;
</p>
<p>&#0;
</p>
<p>on peut supprimer toutes
les relations entre des n&#339;uds qui sont redondantes. Cela s&#8217;applique &#224; la relation de pr&#233;c&#233;dence
entre le n&#339;ud sn0-sn1 et le n&#339;ud pro et &#224; la relation de domination entre le n&#339;ud p4 et le n&#339;ud
</p>
<p>4Pour des raisons mn&#233;motechniques, on concat&#232;ne le nom des deux n&#339;uds qu&#8217;on identifie m&#234;me si on s&#8217;&#233;carte
l&#233;g&#232;rement du cadre syntaxique fix&#233; par la d&#233;finition 3.1.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>sn0-sn1. Simplifier une description, c&#8217;est aussi mettre &#224; jour les traits index&#233;s. Ainsi dans &#2;
&#0;
</p>
<p>,
</p>
<p>on instancie les traits gen et nb des n&#339;uds sn2 et obj1 par les valeurs f et sg.
Parfois, la simplification est plus subtile. Si par exemple, deux n&#339;uds ont un fils commun, on
peut les identifier car dans un arbre, un n&#339;ud a au plus un p&#232;re. Par contre, si deux n&#339;uds en
domine un troisi&#232;me, on peut dire qu&#8217;il sont en position de domination l&#8217;un par rapport &#224; l&#8217;autre
mais savoir dans quel sens.
L&#8217;op&#233;ration de neutralisation &#233;l&#233;mentaire comme op&#233;ration de base du processus de composi-
tion syntaxique trouve sa justification dans la proposition suivante dont la d&#233;monstration est
imm&#233;diate:
</p>
<p>Proposition 3.1 Si une description &#2;
&#0;
</p>
<p>qui comporte au moins un trait non neutre est valide, il
existe au moins une neutralisation &#233;l&#233;mentaire sur &#2;
</p>
<p>&#0;
</p>
<p>qui produise une description valide.
Si une description &#2;
</p>
<p>&#0;
</p>
<p>n&#8217;est pas valide, toute neutralisation &#233;l&#233;mentaire sur &#2;
&#0;
</p>
<p>produit une
description non valide.
</p>
<p>Cette proposition fonde un m&#233;canisme de construction d&#8217;un arbre syntaxique mod&#232;le d&#8217;une
description donn&#233;e qui consiste &#224; it&#233;rer l&#8217;op&#233;ration de neutralisation &#233;l&#233;mentaire. Cette it&#233;ration
est n&#233;cessairement finie et peut s&#8217;arr&#234;ter de 3 fa&#231;ons diff&#233;rentes:
</p>
<p>1. Il reste encore des traits &#224; neutraliser, ce qui signifie que les traits positifs n&#8217;&#233;quilibrent
pas les traits n&#233;gatifs et la description de d&#233;part n&#8217;est pas valide.
</p>
<p>2. On aboutit &#224; une description porteuse d&#8217;une contradiction et on ne peut rien conclure.
On peut avoir fait un mauvais choix quant aux neutralisations pr&#233;c&#233;dentes qui ont &#233;t&#233;
effectu&#233;es et il faut faire un retour arri&#232;re pour essayer de nouvelles neutralisations.
</p>
<p>3. On aboutit &#224; une description neutre. S&#8217;il existe un mod&#232;le d&#8217;une telle description, la de-
scription de d&#233;part est valide sinon il faut faire un retour arri&#232;re pour essayer de nouvelles
neutralisations.
</p>
<p>Dans le dernier cas, on se trouve dans la situation de chercher un mod&#232;le minimal d&#8217;une de-
scription d&#8217;arbre d&#8217;o&#249; les polarit&#233;s ont &#233;t&#233; &#233;limin&#233;es. Si on impose la contrainte suppl&#233;mentaire
que les relations de domination doivent &#234;tre r&#233;alis&#233;es directement ou indirectement par des
neutralisations, les seules descriptions auxquelles on aboutit dans ce cas sont celles d&#8217;arbres
syntaxiques o&#249; l&#8217;ind&#233;termination qui subsiste est celle concernant l&#8217;ordre local entre les fils des
diff&#233;rents n&#339;uds .
Le calcul qui vient d&#8217;&#234;tre d&#233;fini n&#8217;est bien entendu pas confluent. L&#8217;ambigu&#239;t&#233; syntaxique fait
qu&#8217;une m&#234;me description peut mener &#224; plusieurs arbres syntaxiques diff&#233;rents. Ce n&#8217;est pas le
cas de la description &#2;
</p>
<p>&#2;
</p>
<p>qui se r&#233;duit de la fa&#231;on suivante:
</p>
<p>&#2;
</p>
<p>&#2;
</p>
<p>&#4;&#1;&#2;
</p>
<p>&#1;&#2;&#3;
</p>
<p>&#3; &#4;&#1;&#0;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#0;
</p>
<p>&#4;&#1;&#4;
</p>
<p>&#1;&#2;&#3;
</p>
<p>&#3; &#4;&#5;&#6;&#0;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#1;
</p>
<p>&#7;&#0;
</p>
<p>&#1;&#2;&#3;
</p>
<p>&#3; &#7;&#1;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#4;
</p>
<p>&#8;&#9;&#6;&#0;
</p>
<p>&#4;&#5;&#6;&#1;&#3;
</p>
<p>&#3; &#8;&#9;&#6;&#1;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#5;
</p>
<p>&#4;&#1;&#1;
</p>
<p>&#1;&#2;&#3;
</p>
<p>&#3; &#4;&#5;&#6;&#1;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#6;
</p>
<p>&#7;&#5;
</p>
<p>&#1;&#2;&#3;
</p>
<p>&#3; &#7;&#4;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#7;
</p>
<p>&#10;&#0;
</p>
<p>&#1;&#2;&#3;
</p>
<p>&#3; &#10;&#1;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#8;
</p>
<p>&#10;&#4;
</p>
<p>&#1;&#2;&#3;
</p>
<p>&#3; &#10;&#5;
</p>
<p>&#15;&#3; &#2;
</p>
<p>&#9;
</p>
<p>L&#8217;ordre des neutralisations est libre mais on aboutit &#224; un seul r&#233;sultat, la description &#2;
&#9;
</p>
<p>qui est
une sp&#233;cification compl&#232;te de l&#8217;arbre syntaxique pr&#233;sent&#233;e dans la figure 3.
</p>
<p>4 Puissance d&#8217;expression de la composition syntaxique
</p>
<p>La plupart des formalismes grammaticaux bas&#233;s sur les arbres utilisent la substitution comme
op&#233;ration &#233;l&#233;mentaire dans la composition syntaxique. C&#8217;est le cas des grammaires alg&#233;briques</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Descriptions d&#8217;arbres avec polarit&#233;s : les Grammaires d&#8217;Interaction
</p>
<p>lexicalis&#233;es, des grammaires de d&#233;pendances lexicalis&#233;es (Nasr, 1995) mais c&#8217;est aussi le cas de
formalismes utilisant des m&#233;canismes plus complexes comme les TAG ou les Grammaires de
Descriptions d&#8217;Arbres (Rambow et al., 2001). Ainsi l&#8217;adjonction des TAG peut &#234;tre pr&#233;sent&#233;e
comme une double substitution.
La substitution est une op&#233;ration qui pr&#233;sente des limites dans le pouvoir d&#8217;expression qu&#8217;elle
permet. Du fait qu&#8217;elle consiste &#224; accrocher un arbre &#224; un n&#339;ud particulier d&#8217;un autre arbre, elle
ne permet d&#8217;imposer des contraintes que sur les propri&#233;t&#233;s du point de jonction attendu mais en
aucun cas sur le contexte syntaxique de ce dernier.
La linguistique nous montre que ceci est parfois n&#233;cessaire. De ce point de vue, l&#8217;op&#233;ration
de neutralisation &#233;l&#233;mentaire des Grammaires d&#8217;Interaction permet d&#8217;aller au-del&#224; de l&#8217;action
purement localis&#233;e de substitution. Les deux n&#339;uds qui sont identifi&#233;s dans une neutralisation
&#233;l&#233;mentaire ne sont pas forc&#233;ment une racine et une feuille mais ils peuvent occuper n&#8217;importe
quelle position dans leurs arbres respectifs et leur identification peut s&#8217;accompagner d&#8217;une su-
perposition partielle de ces arbres permettant d&#8217;exprimer des contraintes sur les contextes syn-
taxiques des n&#339;uds qui sont identifi&#233;s.
Prenons un exemple qui se situe dans le prolongement de l&#8217;analyse de la phrase Marie que Jean
a vue dort. Un des effets du pronom relatif que est qu&#8217;en r&#233;alisant l&#8217;objet du verbe de la relative,
il permet de rel&#226;cher l&#8217;ordre canonique sujet-verbe et on peut dire Marie qu&#8217;a vue Jean dort. Il
est possible d&#8217;exprimer cela en consid&#233;rant les nouvelles entr&#233;es lexicales pour que et a vue qui
sont pr&#233;sent&#233;es par la figure 5. Le n&#339;ud obj1 appara&#238;t maintenant comme compl&#233;ment d&#8217;objet
</p>
<p>que
</p>
<p>suj2
</p>
<p>rel
</p>
<p>pro
</p>
<p>cat = pro
phon = &quot;que&quot;
</p>
<p>gen =  &lt;1&gt;
</p>
<p>gen =  &lt;1&gt;
</p>
<p>type = decl
</p>
<p>nb =  &lt;2&gt;
</p>
<p>nn =  &lt;2&gt;
cat &lt;&#8722; sn
</p>
<p>fonct &#8722;&gt; &lt;3&gt;
</p>
<p>cat &#8722;&gt; sn
fonct &lt;&#8722; &lt;3&gt;
</p>
<p>cat &lt;&#8722; p
</p>
<p>phon = &quot;&quot;
</p>
<p>cat &lt;&#8722; sn
fonct &#8722;&gt; obj
</p>
<p>phon = &quot;a&quot;
cat = aux
</p>
<p>aux v0
</p>
<p>obj2
</p>
<p>v1
</p>
<p>v2suj1
</p>
<p>cat &#8722;&gt; v mode = ind
temps = pass&#233;&#8722;comp
</p>
<p>p2
mode = &lt;4&gt;
temps = &lt;5&gt;
</p>
<p>cat &lt;&#8722; p
</p>
<p>nb =  sg
</p>
<p>a vue
</p>
<p>cat = rel
</p>
<p>cat &lt;&#8722; sn
</p>
<p>pers=3
nb =  sg
</p>
<p>cat = v
</p>
<p>phon = &quot;vue&quot;
</p>
<p>mode = &lt;4&gt;
temps = &lt;5&gt;
</p>
<p>fonct = tete
cat &lt;&#8722; v
</p>
<p>sn1
</p>
<p>sn2
</p>
<p>p1
</p>
<p>fonct = suj
</p>
<p>obj1
</p>
<p>fonct &#8722;&gt; suj
cat = sn
</p>
<p>cat &#8722;&gt; sn
fonct &lt;&#8722; obj
</p>
<p>phon = &quot;&quot;
nb =  &lt;2&gt;
</p>
<p>gen =  &lt;1&gt;
</p>
<p>gen =  f
</p>
<p>Figure 5: Nouvelles entr&#233;es lexicales pour que et a vue
</p>
<p>direct du verbe de la relative car le pronom que commande uniquement l&#8217;inversion sujet verbe
dans la relative et pas dans une compl&#233;tive ench&#226;ss&#233;e. Le sujet de la relative est maintenant
repr&#233;sent&#233; explicitement par le n&#339;ud suj2. Le trait &#12;&#13;&#11;&#7;&#9; &#3; &#10;&#28;&#29; qu&#8217;il porte indique que cette
fonction est r&#233;alis&#233;e quelle que soit la position de suj2 par rapport aux autres syntagmes qui
composent la relative. Dans l&#8217;entr&#233;e lexicale de a vue, il n&#8217;y a pas plus de relation de pr&#233;c&#233;-
dence entre les n&#339;uds suj1 et v2 et le trait fonct avec la valeur suj est maintenant neutre ce
qui signifie que ce n&#8217;est plus l&#8217;ordre des syntagmes qui est en mesure de r&#233;aliser la fonction
sujet; celle-ci doit &#234;tre r&#233;alis&#233;e de fa&#231;on externe. Ces entr&#233;es vont permettre d&#8217;analyser comme
correctes les deux phrases Marie que Jean a vue dort et Marie qu&#8217;a vue Jean dort.
Dans un formalisme qui repose sur la substitution d&#8217;arbres comme op&#233;ration de base de compo-
sition syntaxique, le ph&#233;nom&#232;ne d&#8217;inversion du sujet dans une relative ne peut pas &#234;tre exprim&#233;
de cette fa&#231;on car la substitution ne permet la superposition d&#8217;arbres. Il ne peut pas &#234;tre exprim&#233;
dans l&#8217;entr&#233;e lexicale du pronom relatif mais il doit &#234;tre rattach&#233; &#224; l&#8217;entr&#233;e lexicale du verbe de
la relative (c&#8217;est ce qui se passe par exemple en TAG), ce qui a tendance &#224; alourdir le lexique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>Conclusion
</p>
<p>Dans ce papier, nous nous sommes attach&#233;s &#224; d&#233;finir formellement les Grammaires d&#8217;Interaction
et nous avons donn&#233; une id&#233;e du pouvoir d&#8217;expression du formalisme. Quand on sait que
pouvoir d&#8217;expression ne fait pas bon m&#233;nage avec efficacit&#233; computationnelle, on peut se de-
mander s&#8217;il est possible de concevoir des algorithmes d&#8217;analyse efficaces pour les Grammaires
d&#8217;Interaction. Cette question ne peut pas &#234;tre trait&#233;e s&#233;rieusement dans le cadre de ce papier
mais le syst&#232;me de polarit&#233;s qui fait l&#8217;originalit&#233; des Grammaires d&#8217;Interaction est un atout pour
cela. Ainsi, par exemple, on peut concevoir une analyse incr&#233;mentale guid&#233;e par une r&#232;gle de
maximisation des neutralisations &#233;l&#233;mentaires et de limitation des polarit&#233;s non neutralis&#233;es.
Un dernier atout des Grammaires d&#8217;Interaction que nous n&#8217;avons pas eu la place d&#8217;&#233;voquer est
celui de leur organisation modulaire et hi&#233;rarchis&#233;e qui doit permettre de construire de telles
grammaires avec une large couverture.
</p>
<p>References
</p>
<p>BLACHE P. (1999). &quot;Contraintes et th&#233;ories linguistiques : des Grammaires d&#8217;Unification aux
Grammaires de Propri&#233;t&#233;s&quot;. Habilitation &#224; diriger des recherches, Universit&#233; Paris 7.
</p>
<p>CANDITO M.-H. (1999). Organisation modulaire et param&#233;trable de grammaires &#233;lectron-
iques lexicalis&#233;es. Application au fran&#231;ais et &#224; l&#8217;italien. Th&#232;se de doctorat, Universit&#233; Paris
7.
</p>
<p>EGG M., NIEHREN J., RUHRBERG P. &amp; XU F. (1998). Constraints over lambda structures in
semantic underspecification. In COLING/ACL&#8217;98, Aug 98, Montreal, Quebec, Canada.
KALLMEYER L. (1999). Tree Description Grammars and Underspecified Representations.
PhD thesis, Universit&#228;t T&#252;bingen.
</p>
<p>MUSKENS R. (2001). Talking about trees and truth-conditions. Journal of Logic, Language,
and Information,, 10(4), 417&#8211;455.
NASR A. (1995). A formalism and a parser for Lexicalised Dependency Grammars. In 4th
Int. Workshop on Parsing Technologies: State University of NY Press.
</p>
<p>PERRIER G. (2000a). From intuitionistic proof nets to interaction grammars. In TAG+5, Paris,
p. 177&#8211;184.
</p>
<p>PERRIER G. (2000b). Interaction grammars. In CoLing &#8217;2000, Sarrebr&#252;cken, p. 600&#8211;606.
RAMBOW O., VIJAY-SHANKER K. &amp; WEIR D. (2001). D-tree Substitution Grammars. Com-
putational Linguistics, 27(1), 87&#8211;121.
RETOR&#201; C. (2001). Syst&#232;mes d&#233;ductifs et traitement des langues: un panorama des gram-
maires cat&#233;gorielles. Technique et Science Informatiques, 20(3), 301&#8211;336.
ROGERS J. &amp; VIJAY-SHANKER K. (1992). Reasoning with descriptions of trees. In 30th
Annual Meeting of the Association for Computational Linguistics, p. 72&#8211;80.
VIJAY-SHANKER K. (1992). Using Description of Trees in a Tree Adjoining Grammar. Com-
putational Linguistics, 18(4), 481&#8211;517.</p>

</div></div>
</body></html>