<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction d&#8217;informations &#224; partir de corpus d&#233;grad&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27 juin 2002 
</p>
<p>Extraction d&#8217;informations  
&#224; partir de corpus d&#233;grad&#233;s 
</p>
<p>Fabrice Even1, Chantal Enguehard 
</p>
<p>Institut de Recherche en Informatique de Nantes 
Universit&#233; de Nantes 
</p>
<p>Facult&#233; des Sciences et des Techniques 
2 rue de la Houssini&#232;re, BP 92208 
44322 NANTES cedex 3, France 
</p>
<p>{even,enguehard}@irin.univ-nantes.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Nous pr&#233;sentons une m&#233;thode automatique d&#8217;extraction d&#8217;information &#224; partir d&#8217;un corpus 
mono-domaine de mauvaise qualit&#233;, sur lequel il est impossible d&#8217;appliquer les m&#233;thodes 
classiques de traitement de la langue naturelle. Cette approche se fonde sur la construction 
d&#8217;une ontologie semi-formelle (mod&#233;lisant les informations contenues dans le corpus et les 
relations entre elles). Notre m&#233;thode se d&#233;roule en trois phases : 1) la normalisation du 
corpus, 2) la construction de l&#8217;ontologie, et 3) sa formalisation sous la forme d&#8217;une 
grammaire. L&#8217;extraction d&#8217;information &#224; proprement parler exploite un &#233;tiquetage utilisant les 
r&#232;gles d&#233;finies par la grammaire. Nous illustrons notre d&#233;marche d&#8217;une application sur un 
corpus bancaire. 
</p>
<p>We present an information extraction automatic method from poor quality specific-domain 
corpus (with which it is impossible to apply classical natural language methods). This 
approach is based on building a semi-formal ontology in order to modelise information 
present in the corpus and their relation. Our method happens in three stage : 1) corpus 
normalisation, 2) ontology building and 3) model formalisation in grammar. The information 
extraction itself is made by a tagging process using grammar rules. We illustrate our approach 
by an application working on a bank corpus. 
</p>
<p>Mots Cl&#233;s &#8211; Keywords  
</p>
<p>Extraction d&#8217;information, mod&#233;lisation, construction d&#8217;ontologie, corpus d&#233;grad&#233;s. 
Information extraction, modelling, building ontology, poor quality corpus.. 
</p>
<p>                                                 
1 Th&#232;se financ&#233;e par le Cr&#233;dit Mutuel Loire-Atlantique Centre-Ouest dans le cadre d&#8217;un contrat CIFRE 
</p>
<p>105 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Even, Chantal Enguehard 
</p>
<p>1 Introduction 
</p>
<p>Cette recherche est directement issue de la volont&#233; d&#8217;extraire des informations &#224; partir d&#8217;un 
corpus d&#233;grad&#233; (nombreuses abr&#233;viations, phrases asyntaxiques, ponctuation inexistante, 
etc.). L&#8217;extraction d&#8217;information est d&#233;finie comme un processus en deux &#233;tapes : la 
mod&#233;lisation des types d&#8217;informations recherch&#233;s et l&#8217;identification de leurs instances dans le 
corpus. La premi&#232;re &#233;tape utilise des sources de connaissances externes au corpus afin de 
b&#226;tir une ontologie semi-
formelle recouvrant une partie du domaine dans lequel s&#8217;inscrit le corpus. Seul le sous-
domaine limit&#233; &#224; la connaissance exprim&#233;e dans le corpus est effectivement mod&#233;lis&#233;. La 
deuxi&#232;me &#233;tape s&#8217;appuie sur cette ontologie afin d&#8217;extraire les informations du corpus. 
</p>
<p>Apr&#232;s une br&#232;ve pr&#233;sentation des m&#233;thodes de construction d&#8217;ontologie et leur confrontation &#224; 
des corpus d&#233;grad&#233;s, nous d&#233;taillons les diff&#233;rentes &#233;tapes de notre d&#233;marche : la construction 
de l&#8217;ontologie, sa repr&#233;sentation formelle sous forme d&#8217;une grammaire, puis l&#8217;extraction des 
informations &#224; l&#8217;aide de cette grammaire. Les r&#233;sultats de l&#8217;extraction sont &#233;valu&#233;s et 
analys&#233;s. 
</p>
<p>Nous travaillons sur un corpus compos&#233; de textes issus du milieu bancaire. Il est compos&#233; de 
textes relatant des entretiens pass&#233;s entre des clients et des employ&#233;s. Notre but est d&#8217;extraire 
automatiquement certains types d&#8217;informations d&#233;crites informellement, comme les diff&#233;rents 
projets des clients ou un changement dans leur situation familiale. Les informations extraites 
viendront enrichir une base de donn&#233;es.  
</p>
<p>Exemple : &#224; partir du texte suivant,  
</p>
<p>&#171; PRJ ACHT  STUDIO EN 12  01 PARIS POUR 400 KFRCS &#187;  [1]  
</p>
<p>le processus doit rep&#233;rer les projets d&#8217;achat du client et identifier ses param&#232;tres : 
l&#8217;objet (studio), la date (12/01), le lieu (Paris) et le montant (400KF). 
</p>
<p>2 M&#233;thodes de construction d&#8217;ontologie 
</p>
<p>De nombreuses m&#233;thodes visent &#224; construire des ontologies &#224; partir de corpus. La plupart se 
fondent sur le contenu des textes pour construire l&#8217;ontologie, les textes sont alors la source 
principale de connaissance pour l&#8217;acquisition d&#8217;information (Nob&#233;court, 2000). L&#8217;ensemble 
des concepts du mod&#232;le ainsi que leurs relations sont exclusivement issus d&#8217;une analyse des 
textes, sans apport de connaissance ext&#233;rieur. (Aussenac-Gilles et al., 2000) s&#8217;inscrivent dans 
cette d&#233;marche m&#234;me s&#8217;il est reconnu que les textes peuvent ne pas constituer l&#8217;unique source 
de connaissance. Cette approche endog&#232;ne se d&#233;compose en plusieurs &#233;tapes : l&#8217;extraction des 
termes se r&#233;f&#233;rant aux concepts de base (primitives conceptuelles (Nob&#233;court, 2000)), puis 
des relations lexicales qu&#8217;ils entretiennent (cr&#233;ation d&#8217;une base terminologique (Aussenac-
Gilles et al., 2000), (Lame, 2000)) afin de faire &#233;merger les premi&#232;res relations inter-concepts. 
L&#8217;&#233;tape suivante s&#8217;appuie sur l&#8217;analyse des relations s&#233;mantiques entre termes pour extraire 
de nouvelles relations entre les concepts ainsi que de nouveaux concepts afin d&#8217;aboutir &#224; un 
r&#233;seau s&#233;mantique de concepts. Le r&#233;seau s&#233;mantique doit &#234;tre valid&#233; par un expert du 
domaine afin de pr&#233;ciser les relations significatives (normalisation (Bouaud, Bachimont et al 
1995)). Le r&#233;sultat correspond &#224; la d&#233;finition de (Swartout et al., 1996) &#171; Une ontologie est 
</p>
<p>106 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;informations &#224; partir de corpus d&#233;grad&#233;s 
</p>
<p>une structure hi&#233;rarchique d&#8217;un ensemble de termes du domaine &#187;, soit une ontologie pouvant 
&#234;tre repr&#233;sent&#233;e de mani&#232;re formelle ou semi-formelle. 
</p>
<p>Les diff&#233;rentes &#233;tapes s&#8217;appuient sur des outils de TAL peu adapt&#233;s aux corpus de mauvaise 
qualit&#233;. La phase terminologique est envisageable apr&#232;s une correction des textes, mais 
l&#8217;extraction de relations lexicales et s&#233;mantiques se r&#233;v&#232;le peu efficace sur de tels corpus &#224; 
cause de leur tr&#232;s faible qualit&#233; syntaxique et lexicale. 
</p>
<p>3 Mod&#233;lisation du domaine 
</p>
<p>3.1 Pr&#233;traitements 
</p>
<p>Les textes de notre corpus sont si d&#233;grad&#233;s (incorrections typologiques ou orthographiques, 
emploi d'abr&#233;viations non normalis&#233;es) qu&#8217;il est n&#233;cessaire d&#8217;effectuer avant tout autre 
processus une correction et une normalisation du corpus. C&#8217;est &#224; partir de ce corpus corrig&#233; 
que nous proc&#233;dons &#224; la mod&#233;lisation puis &#224; l&#8217;extraction d&#8217;information &#224; proprement parler. 
Cette normalisation porte sur le format des valeurs (nombres avec unit&#233;s), les dates, les 
abr&#233;viations et la correction orthographique des fautes lexicales et typographiques. Ces 
pr&#233;traitements sont r&#233;alis&#233;s &#224; l&#8217;aide d&#8217;expressions r&#233;guli&#232;res &#233;crites en fonction du corpus. 
</p>
<p>Exemple : l&#8217;extrait [1] devient :  &#171; projet achat studio en 12/01 paris pour 400kf &#187;  [2] 
</p>
<p>3.2 Construction du mod&#232;le 
</p>
<p>D&#8217;apr&#232;s Bachimont (Bachimont 2001), il n&#8217;existe pas de concepts ind&#233;pendants du contexte 
ou du probl&#232;me trait&#233; permettant de construire toute la connaissance d&#8217;un domaine. Une 
ontologie fonctionne comme un cadre th&#233;orique du domaine construit en fonction du 
probl&#232;me trait&#233;. Le processus de mod&#233;lisation d&#233;crit ici est fond&#233; sur cette derni&#232;re d&#233;finition. 
Nous construisons l&#8217;ontologie en nous appuyant sur les connaissances pr&#233;sentes dans le 
corpus et des connaissances externes au corpus (experts).  
</p>
<p>3.2.1 D&#233;finition de l&#8217;ontologie initiale : expression des informations recherch&#233;es 
</p>
<p>Les informations &#224; rechercher, exprim&#233;es informellement, sont r&#233;&#233;crites sous la forme de 
pr&#233;dicats mod&#233;lis&#233;s par des patrons d&#8217;informations. Cette tache doit &#234;tre r&#233;alis&#233;e avec des 
experts du domaine ayant une bonne connaissance du corpus et sachant exprimer la nature des 
informations &#224; extraire. Cette phase aboutit &#224; la description d'un ensemble de hi&#233;rarchies de 
concepts constituant une premi&#232;re sous-ontologie (ontologie initiale). Cette ontologie met en 
jeu des relations argumentatives entre concepts (un concept est li&#233; &#224; un autre car il en est un 
argument). Les relations argumentatives respectent l&#8217;Attribute Consistency Postulate 
(Guarino 1992) : dans chaque relation argumentative, toute valeur d&#8217;un argument est une 
instance du concept correspondant &#224; cet argument. 
</p>
<p>107 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Even, Chantal Enguehard 
</p>
<p>3.2.2 D&#233;finition de la terminologie 
</p>
<p>Elle est issue d&#8217;une part d&#8217;une &#233;tude terminologique des textes par le logiciel, ANA 
(Enguehard, Pant&#233;ra 1995), caract&#233;ris&#233; par sa robustesse. Et d&#8217;autre part d&#8217;un ensemble de 
documents r&#233;f&#233;ren&#231;ant la terminologie sp&#233;cifique au domaine dans lequel nous trouvons une 
partie des termes potentiellement utilis&#233;s dans notre corpus.   
</p>
<p>3.2.3 Normalisation : Fusion de l&#8217;ontologie initiale et de la terminologie 
</p>
<p>A chaque terme ne correspond pas un concept de l&#8217;ontologie initiale. Il faut pouvoir relier les 
termes du corpus aux concepts d&#233;finis dans cette ontologie. Un processus de normalisation est 
n&#233;cessaire. Il se d&#233;roule en trois &#233;tapes : 1) extension de l'ontologie initiale, 2) d&#233;finition 
d'une semi-base terminologique et 3) unification des mod&#232;les ainsi d&#233;finis. 
</p>
<p>1. L&#8217;ontologie initiale est r&#233;vis&#233;e avec l'aide d'experts du domaine. De nouveaux 
concepts compl&#232;tent les hi&#233;rarchies (on parlera d'ontologie initiale &#233;tendue).  
</p>
<p>2. Gr&#226;ce aux m&#234;mes experts, et en nous appuyant sur des documents propres au 
domaine, nous sp&#233;cifions &#224; partir de la terminologie un autre ensemble de concepts, 
les concepts de base. R&#233;cursivement de nouveaux concepts sont d&#233;finis par h&#233;ritage 
&#224; partir des concepts de base. Le r&#233;sultat est un ensemble de petites hi&#233;rarchies ayant 
chacune un anc&#234;tre unique dont les derniers descendants sont des concepts de base. 
Ces hi&#233;rarchies sont norm&#233;es, c&#8217;est-&#224;-dire organis&#233;es de mani&#232;re syst&#233;matique, car 
chaque p&#232;re se d&#233;compose en fils selon un crit&#232;re unique. Elles respectent &#233;galement 
le crit&#232;re de rigidit&#233; de Guarino (Guarino 2000). 
</p>
<p>3. Les deux processus pr&#233;c&#233;dents donnent d'une part une ontologie li&#233;e au probl&#232;me 
trait&#233; et un ensemble de sous-hi&#233;rarchies directement li&#233;es &#224; la terminologie du texte. 
Nous proc&#233;dons &#224; l&#8217;unification des sous-hi&#233;rarchies et de l'ontologie initiale &#233;tendue 
en analysant si des concepts anc&#234;tres (p&#232;res) des sous-hi&#233;rachies sont d&#233;j&#224; pr&#233;sents 
dans l'ontologie ou si une relation peut &#234;tre d&#233;finie avec des concepts de cette 
ontologie.  
</p>
<p>Nous obtenons une mod&#233;lisation du domaine couvrant l&#8217;ensemble des concepts qui nous 
int&#233;ressent pour la recherche d&#8217;information. Cette mod&#233;lisation est d&#233;crite par un sch&#233;ma 
relationnel formalis&#233; par un ensemble de graphes orient&#233;s. Elle &#233;tablit une ontologie d&#233;crite 
de mani&#232;re semi-formelle car ind&#233;pendante d&#8217;un langage de repr&#233;sentation (Barry et al. 
2001).  
</p>
<p>3.3 Repr&#233;sentation formelle 
</p>
<p>Nous repr&#233;sentons la mod&#233;lisation pr&#233;c&#233;demment obtenue sous la forme d&#8217;une grammaire, 
afin de la rendre utilisable. Comme indiqu&#233; en 3.2, l'ontologie met en jeu deux types de 
relations entre concepts : des relations hi&#233;rarchiques et des relations &quot;argumentatives&quot;. Dans 
cette formalisation les relations hi&#233;rarchiques sont appel&#233;es relations constitutives car nous 
nous pla&#231;ons ici du point de vue de la base de chacune des hi&#233;rarchies et non pas de celui de 
son sommet. Lorsqu'une relation hi&#233;rarchique existe entre un concept p&#232;re A et un concept 
fils B, on dit que B constitue A (on part du fils pour remonter jusqu'au p&#232;re puis au p&#232;re du 
</p>
<p>108 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;informations &#224; partir de corpus d&#233;grad&#233;s 
</p>
<p>p&#232;re et ainsi de suite). Une telle relation peut s'apparenter &#224; une relation d'hyperonymie (A est 
un hyperonyme de B) ou &#224; l'inverse d'hyponymie (B est un hyponyme de A). Lorsque l&#8217;on a 
une relation de type argumentative entre deux concepts C et D, le concept D est un argument 
(dont le type d&#233;pend de la relation) du concept C. La grammaire doit donc pouvoir rendre 
compte de ces deux types de relations. Aussi nous d&#233;finissons pour celle-ci deux types de 
r&#232;gles : les r&#232;gles constitutives et les r&#232;gles pr&#233;dicatives. 
</p>
<p>3.3.1 R&#232;gles constitutives 
</p>
<p>Un concept A est d&#233;fini par un ensemble de r&#232;gles Def(a) impliquant des termes ou des 
concepts. Ces r&#232;gles sont dites constitutives car le concept A est d&#233;fini (constitu&#233;) par ces 
r&#232;gles. Quel que soit X appartenant &#224; Def(A), X ne peut d&#233;finir un autre concept que A. Ces 
r&#232;gles s'&#233;crivent A ::= Def(A) et sont de trois types : les r&#232;gles s&#233;lectives, les r&#232;gles 
conjonctives et les r&#232;gles disjonctives. 
</p>
<p>Les r&#232;gles s&#233;lectives sont du type A ::= B1 | B2 | &#8230; . L&#8217;op&#233;rateur &#171; | &#187; est &#233;quivalant au OU 
exclusif : la valeur de l&#8217;expression B1 | B2 est soit B1, soit B2 mais pas les deux.  
</p>
<p>Exemple : &lt;VEHICULE&gt; ::= &lt;AUTO&gt; | &lt;MOTO&gt; | &lt;DIV_VEHI&gt; 
</p>
<p>Les r&#232;gles conjonctives sont du type A ::= B1 + B2 + &#8230; . L'op&#233;rateur &#171; + &#187; est non 
commutatif et correspond &#224; la conjonction classique : la valeur de l&#8217;expression B1 + B2 est 
exclusivement &quot;B1 ET B2&quot;. 
</p>
<p>Exemple : &lt;P_AUTO&gt; ::= &lt;DC_PRET&gt; + &lt;VEHICULE&gt; 
</p>
<p>Les r&#232;gles disjonctives sont du type A ::= B1 v B2 v &#8230; . L&#8217;op&#233;rateur &#171; v &#187; &#233;quivaut &#224; la 
disjonction classique : la valeur de l&#8217;expression B1 v B2 est soit B1, soit B2, soit les deux. 
</p>
<p>Exemple : &lt;PERSONNE&gt; ::=  &lt;NOM&gt; v &lt;PRENOM&gt; 
</p>
<p>3.3.2 R&#232;gles pr&#233;dicatives 
</p>
<p>Ces r&#232;gles d&#233;crivent les concepts-pr&#233;dicats (appel&#233;s aussi pr&#233;dicats), c'est-&#224;-dire les concepts 
mettant en jeu une ou plusieurs relations argumentatives. Elles d&#233;finissent un pr&#233;dicat P par 
un descripteur et un objet. Le descripteur est un concept unique (un concept ne pouvant &#234;tre le 
descripteur de plus d&#8217;une r&#232;gle). L&#8217;objet est un concept pris parmi un certain nombre de 
concepts possibles, ceux ci &#233;tant d&#233;duits de la mod&#233;lisation.  
</p>
<p>Ces r&#232;gles peuvent &#233;galement s&#8217;accompagner d&#8217;un ou plusieurs arguments suppl&#233;mentaires 
dits options. Ceux ci lorsqu&#8217;ils sont valu&#233;s donnent plus d&#8217;informations sur le pr&#233;dicat P mais 
ne sont ni n&#233;cessaires, ni suffisants pour le d&#233;finir.  
</p>
<p>Les r&#232;gles pr&#233;dicatives s&#8217;expriment de la forme P ::= (descripteur = D ; objet = O1 | O2 | O3 
&#8230; ; option 1 = A1 | A2 | A3 &#8230; ;  option 2 = B1 | B2 &#8230; ;  &#8230;.).  
</p>
<p>Exemple :  &lt;ACHAT&gt; ::= ( 
descripteur = &lt;DC_ACHAT&gt; ; 
objet = &lt;IMMOBILIER&gt; | &lt;VEHICULE&gt; | &lt;PROD_BANCAIRE&gt; ; 
</p>
<p>109 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Even, Chantal Enguehard 
</p>
<p>date = &lt;DATE&gt; ;  
montant = &lt;SOMME&gt;) 
</p>
<p>4 Moteur d'extraction 
</p>
<p>Le moteur d'extraction s'appuie sur la grammaire mod&#233;lisant le domaine (la grammaire issue 
de l&#8217;ontologie). Il comprend quatre phases : l&#8217;alimentation d&#8217;une base de r&#232;gle, deux 
&#233;tiquetages successifs et le recueil des informations alimentant la base de donn&#233;es.  
</p>
<p>La base de r&#232;gles se compose de deux sous-ensembles de r&#232;gles (les r&#232;gles constitutives et les 
r&#232;gles pr&#233;dicatives) d&#233;duites de la grammaire. L&#8217;&#233;tiquetage constitutif du corpus s&#8217;appuie sur 
les r&#232;gles constitutives de la base (chaque terme est &#233;tiquet&#233; par le concept qui lui est associ&#233;, 
et chaque concept est lui-m&#234;me &#233;tiquet&#233; en fonction de sa description dans la grammaire). Le 
second &#233;tiquetage s&#8217;appuie sur les r&#232;gles pr&#233;dicatives pour instancier les pr&#233;dicats. Apr&#232;s ce 
double &#233;tiquetage, le processus de recueil d&#8217;information est directement op&#233;rationnel. Son 
r&#233;sultat alimente la base de donn&#233;es. 
</p>
<p>4.1 Construction de la base de r&#232;gles 
</p>
<p>Les r&#232;gles de la base sont d&#233;duites de la grammaire, directement pour les r&#232;gles pr&#233;dicatives, 
apr&#232;s transformation pour les r&#232;gles constitutives. 
</p>
<p>&#8226; les r&#232;gles s&#233;lectives permettant d&#8217;identifier les concepts de base &#224; partir des termes 
sont transform&#233;es en ensemble de r&#232;gles simples du type A ::= terme (r&#232;gles 
s&#233;lectives terminales).  
</p>
<p>&#8226; les r&#232;gles s&#233;lectives sur les concepts sont transform&#233;es en un ensemble de r&#232;gles 
simples A ::= B. Les r&#232;gles conjonctives et disjonctives sont adapt&#233;es afin de se 
conformer &#224; la syntaxe du corpus. Cette adaptation consiste &#224; adjoindre &#224; ces r&#232;gles 
une notion d&#8217;ordre (l&#8217;op&#233;rateur + n&#8217;&#233;tant pas commutatif) et de proximit&#233;. 
L&#8217;ensemble de ces r&#232;gles transform&#233;es forme l&#8217;ensemble des r&#232;gles conceptuelles. 
</p>
<p>4.2 Etiquetage constitutif 
</p>
<p>L&#8217;&#233;tiquetage constitutif rep&#232;re dans le texte les diff&#233;rents termes puis les concepts en 
appliquant r&#233;cursivement les r&#232;gles constitutives. A chaque fois qu&#8217;un concept est rep&#233;r&#233;, il 
est marqu&#233; par une balise. Certains concepts tr&#232;s sp&#233;cifiques (dont la syntaxe r&#233;pond &#224; un 
formalisme connu) comme les dates, les montants ou les sommes sont trait&#233;s au pr&#233;alable. 
Ensuite l&#8217;&#233;tiquetage se d&#233;roule en deux &#233;tapes : 1) l&#8217;&#233;tiquetage des termes et 2) la propagation 
des concepts. 
</p>
<p>1. Les r&#232;gles s&#233;lectives terminales sont appliqu&#233;es sur le corpus. Lorsque toutes les 
r&#232;gles sont appliqu&#233;es, tous les termes reconnus par la grammaire sont &#233;tiquet&#233;s par 
des concepts (exemple 3). 
</p>
<p>2. La propagation des concepts permet de d&#233;tecter de nouveaux concepts. La r&#232;gle 
A ::= B permet de rep&#233;rer le concept A en  rajoutant les balises de A &#224; celles 
</p>
<p>110 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;informations &#224; partir de corpus d&#233;grad&#233;s 
</p>
<p>identifiant B. Les r&#232;gles conceptuelles sont appliqu&#233;es sur le corpus autant de fois 
qu&#8217;il est possible de le faire. Le processus s&#8217;arr&#234;te lorsque plus aucune d&#8217;entre elles 
n&#8217;est applicable. A ce point, le corpus est enti&#232;rement &#233;tiquet&#233; par les r&#232;gles 
constitutives (exemple 4). 
</p>
<p>Exemple 3 Exemple 4
</p>
<p>4.3 Etiquetage pr&#233;dicatif 
</p>
<p>Les r&#232;gles pr&#233;dicatives rep&#232;rent les instances des pr&#233;dicats d&#233;crits dans la grammaire. Elles 
sont appliqu&#233;es sur le corpus en recherchant pour chaque descripteur de concept trouv&#233;, un 
des concepts objets possibles du pr&#233;dicat mis en jeu. On cherche &#224; instancier les pr&#233;dicats 
jusqu&#8217;&#224; ce qu&#8217;il soit impossible de le faire en proc&#233;dant de la fa&#231;on suivante. Le texte est 
parcouru de gauche &#224; droite. Lorsqu&#8217;un descripteur de pr&#233;dicat est reconnu, on recherche un 
argument objet (concept ou pr&#233;dicat) valable pour ce pr&#233;dicat avant le prochain descripteur de 
pr&#233;dicat non trait&#233;. Si c&#8217;est le cas l&#8217;objet est valu&#233;, puis le syst&#232;me cherche &#224; valuer les 
&#233;ventuels autres arguments et passe au prochain descripteur du texte. Sinon ce descripteur est 
laiss&#233; de cot&#233; et le syst&#232;me passe au suivant. Cela est fait jusqu&#8217;&#224; l&#8217;extr&#233;mit&#233; du texte. S&#8217;il 
reste des descripteurs non trait&#233;s, c&#8217;est &#224; dire d&#233;crivant des pr&#233;dicats dont l&#8217;objet n&#8217;a pu &#234;tre 
valu&#233;, le processus est r&#233;p&#233;t&#233; &#224; partir du d&#233;but du texte. Cette op&#233;ration est r&#233;it&#233;r&#233;e jusqu&#8217;&#224; ce 
qu&#8217;il ne reste plus de descripteurs &#224; traiter ou que ceux qui restent ne peuvent plus l&#8217;&#234;tre. Dans 
ce dernier cas ils seront marqu&#233;s comme d&#233;crivant des instances de pr&#233;dicats vides (sans 
objet). Un pr&#233;dicat peut &#234;tre objet d&#8217;un autre pr&#233;dicat. Dans ce cas les arguments du dernier 
pr&#233;dicat sont v ue cela est possible par ceux du p cat. </p>

</div><div>alu&#233;s lorsq</p>

</div><div><p>Exemple 5 
</p>
<p>111 </p>

</div><div><p>remier pr&#233;di</p>

</div><div><p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Even, Chantal Enguehard 
</p>
<p>Les instanciations de pr&#233;dicats se traduisent par un balisage du texte (exemple 5). Le 
descripteur est &#233;tiquet&#233; par la r&#233;f&#233;rence du pr&#233;dicat, c&#8217;est &#224; dire son nom et un num&#233;ro 
d&#8217;instance (pour les cas ou un m&#234;me pr&#233;dicat peut &#234;tre instanci&#233; plusieurs fois dans le texte). 
Chaque concept argument d&#8217;un pr&#233;dicat est balis&#233; par la r&#233;f&#233;rence du pr&#233;dicat dont il est 
argument et par son type (Objet, Date, &#8230;). 
</p>
<p>4.4 Recueil des informations 
</p>
<p>Les concepts ainsi que leurs relations apparaissent clairement dans le corpus gr&#226;ce aux 
balises. Lors de la phase d&#8217;extraction, il suffit de sp&#233;cifier les concepts &#224; rechercher. Les 
balises permettent de localiser ces concepts ainsi que leurs diff&#233;rents arguments. Ces 
informations nourrissent une base de donn&#233;es dont les tables correspondent aux pr&#233;dicats de 
la grammaire.  
</p>
<p>5 R&#233;sultats 
</p>
<p>Le corpus est constitu&#233; d&#8217;un million d&#8217;enregistrements. Chaque enregistrement est issu d&#8217;un 
entretien d&#8217;un employ&#233; d&#8217;une agence de la banque avec un client. Il se pr&#233;sente sous la forme 
d&#8217;une ligne constitu&#233;e d&#8217;un ent&#234;te num&#233;rique et d&#8217;un champ texte. L&#8217;ent&#234;te contient le 
num&#233;ro d&#8217;identifiant et la date de l&#8217;enregistrement. Le champ texte contient le texte saisi par 
le banquier rendant compte de l&#8217;entretien. Le nombre de mots de ce champ varie d&#8217;un 
enregistrement &#224; l&#8217;autre : de quelques mots &#224; plus d&#8217;une trentaine. Avant toute analyse, ce 
champ est soumis &#224; un traitement pour le mettre en conformit&#233; avec les r&#232;gles de la CNIL. 
L&#8217;extraction terminologique avec ANA (Enguehard, Pant&#233;ra 1995) d&#233;finit 15000 candidats-
termes. Apr&#232;s &#233;cr&#233;mage (rassemblement des candidats-termes et &#233;limination des parasites), il 
reste 1300 termes. Sur les 350 termes qu&#8217;ils contiennent, les documents terminologiques ont 
fourni 200 nouveaux termes suppl&#233;mentaires. 
</p>
<p>5.1 M&#233;thode d&#8217;&#233;valuation 
</p>
<p>Le but de la recherche est d&#8217;extraire automatiquement les &#233;v&#232;nements concernant les clients, 
c&#8217;est-&#224;-dire leurs projets et les refus de proposition (de leur part ou de celle de la banque). Le 
r&#233;sultat est un ensemble d&#8217;instances du pr&#233;dicat recherch&#233;. Comme ces pr&#233;dicats ont plusieurs 
arguments, nous d&#233;finissons 3 degr&#233;s de validit&#233; en fonction de la mani&#232;re dont sont valu&#233;s 
ces arguments : 
</p>
<p>1. Une instance d&#8217;un pr&#233;dicat est dite valide si les arguments valu&#233;s le sont par les 
bonnes valeurs. Le taux de validit&#233; est le nombre d&#8217;instances valides par rapport au 
nombre d&#8217;instances trouv&#233;es ; 
</p>
<p>2. Une instance valide est dite totalement valide si tous ses arguments sont valu&#233;s, et  
partiellement valide si au moins un de ces arguments n&#8217;est pas valu&#233; ; 
</p>
<p>3. Une instance partiellement valide est dite incompl&#232;te lorsqu'au moins un argument 
n&#8217;est pas valu&#233; &#224; cause d&#8217;un manquement du processus, et compl&#232;te lorsque la 
totalit&#233; des arguments non valu&#233;s est due &#224; l&#8217;absence des informations 
correspondantes dans le texte. 
</p>
<p>112 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;informations &#224; partir de corpus d&#233;grad&#233;s 
</p>
<p>5.2 Exp&#233;rimentation 
</p>
<p>Notre premi&#232;re exp&#233;rimentation porte sur un &#233;chantillon de 4000 enregistrements pris au 
hasard dans le corpus. Il s&#8217;agit d&#8217;extraire les projets pr&#233;sents dans cet &#233;chantillon. Les 
r&#233;sultats trouv&#233;s ont &#233;t&#233; valid&#233;s manuellement par les experts qui ont align&#233; l&#8217;&#233;chantillon avec 
les instances de la table PROJET cr&#233;&#233;es par notre application. D'apr&#232;s les experts, 265 projets 
sont  pr&#233;sents dans cet &#233;chantillon dans lequel 253 instances sont d&#233;tect&#233;es. Nous obtenons 
les r&#233;sultats d&#233;crits par la figure 1. 
</p>
<p> 
</p>
<p>Figure 1 : R&#233;sultats 
</p>
<p>5.3 Analyse des r&#233;sultats 
</p>
<p>Le taux de couverture n&#8217;est pas significatif car de nombreux enregistrements ne contiennent 
pas de projets (95 %). Les taux de rappel (correspondant au nombre d&#8217;instances trouv&#233;es par 
rapport &#224; celle pr&#233;sentes et &#233;gal &#224; 95,4 %) et de validit&#233; (92,5 %) sont tr&#232;s satisfaisants mais 
nombre d&#8217;instances ne sont que partiellement valides (90 % des projets valides). 73,4 % de 
celles-ci le sont en raison de l&#8217;incompl&#233;tude du corpus qui ne peut nous d&#233;livrer toutes les 
informations mais le reste est du au processus. Une analyse des enregistrements dans lesquels 
ces cas sont observ&#233;s fait appara&#238;tre deux principaux probl&#232;mes :  
</p>
<p>&#8226; un tr&#232;s grand nombre de dates sont pr&#233;sentes sous une forme litt&#233;rale de mani&#232;re plus 
ou moins floue (au prochain semestre, dans quelques mois) et ne sont pas d&#233;tect&#233;es. 
</p>
<p>&#8226; des arguments d&#8217;un pr&#233;dicat d&#233;crit par un descripteur X peuvent se trouver avant lui 
dans le texte ou en dehors de la fen&#234;tre de recherche et ne sont pas pris en compte. 
</p>
<p>Nous travaillons actuellement au r&#232;glement de ces deux probl&#232;mes. Pour le 2&#232;me nous 
proposons de modifier le processus d&#8217;&#233;tiquetage pr&#233;dicatif pour d&#233;tecter les arguments 
pr&#233;sents &#224; gauche d&#8217;un descripteur de pr&#233;dicat. Quant aux dates, nous introduisons la notion 
de date floue associ&#233;e &#224; un degr&#233;. 
</p>
<p>6 Conclusion et Perspectives 
</p>
<p>Nous avons d&#233;crit une m&#233;thode permettant d&#8217;extraire des informations &#224; partir de textes de 
qualit&#233; d&#233;grad&#233;e, sur lesquels sont inop&#233;rants les processus d&#8217;extraction d&#8217;information 
</p>
<p>113 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Even, Chantal Enguehard 
</p>
<p>existants. Cette approche s&#8217;appuie sur la construction d&#8217;une ontologie, guid&#233;e par la nature 
des informations &#224; rechercher dans les textes. Nous obtenons avec cette approche de tr&#232;s bons 
r&#233;sultats avec une couverture tr&#232;s importante des informations pr&#233;sentes dans chaque 
enregistrement. De plus m&#234;me quand celle-ci est minimale, le syst&#232;me permet de rep&#233;rer les 
enregistrements dans lesquels est pr&#233;sente une information. Cette m&#233;thode peut s&#8217;appliquer &#224; 
d&#8217;autres corpus d&#8217;autres domaines. La mod&#233;lisation du domaine et les pr&#233;traitements sont li&#233;s 
aux textes, mais le reste du processus est g&#233;n&#233;rique et ne n&#233;cessite pas de modification du 
syst&#232;me. Une exp&#233;rimentation en ce sens est en cours sur des corpus concernant un domaine 
proche de celui de notre corpus actuel (textes de nature similaire d&#8217;une autre banque). 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Aussenac-Gilles N., Bi&#233;bow B., Szulman S. (2000), Corpus analysis for conceptual 
modelling, Proceeding of EKAW&#8217;2000, 13-20. 
</p>
<p>Aussenac-Gilles N., Bourigault D., Condamines A., Gross C. (1995), How can knowledge 
acquisition benefit from terminology ?, Proceedings of  EKAW&#8217;95. 
</p>
<p>Bachimont B. (2001), Mod&#233;lisation linguistique et mod&#233;lisation logique des ontologies : 
l&#8217;apport de l&#8217;ontologie formelle, Actes d&#8217;IC 2001, 349-368 
</p>
<p>Barry C., Cormier C., Kassel G., Nob&#233;court J. (2001), Evaluation de langages op&#233;rationnels 
de repr&#233;sentation d&#8217;ontologies, Actes d&#8217;IC&#8217;2001, 309-327. 
</p>
<p>Bi&#233;bow B., Szulman S. (1998), Une approche terminologique pour cat&#233;goriser les concepts 
d&#8217;une ontologie, Actes d&#8217;IC&#8217;98, 51-58. 
</p>
<p>Bouaud J., Bachimont B., Charlet J., Zweigenbaum P. (1995), Methodological Principles for 
Structuring an Ontology, Proceedings of IJCAI-95  
</p>
<p>Enguehard C., Pant&#233;ra L. (1995), Automatic Natural Acquisition of a Terminology, Journal 
of quantitative linguistics, Vol. 2, n&#176;1, pp.27-32. 
</p>
<p>Guarino N., Welty W. (2000), A Formal Ontology of Properties, Proceedings of the ICAI-00 
Workshop on Applications of Ontologies and Problem-Solving Methods, 12/1-12/8. 
</p>
<p>Guarino N. (1992), Concepts, Attributes and Arbitrary Relations : Some Linguistic and 
Ontological Criteria for Structuring Knowledge Bases, Data &amp; Knowledge Bases 
Engineering, 8(2) : 249-261. 
</p>
<p>Lame G. (2000), Knowledge acquisition from texts towards an ontology of French law, 
Proceedings of EKAW&#8217;2000, 53-62. 
</p>
<p>Nob&#233;court J. (2000), A method to build formal ontologies from texts, Proceedings of 
EKAW&#8217;2000, 21-27. 
</p>
<p>Nestorov S. &amp; al. (1997), Representative objects : concise representation of semistructured, 
hierarchical data., Proceedings of International Conference on Data Engineering, 79-90. 
</p>
<p>114 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;informations &#224; partir de corpus d&#233;grad&#233;s 
</p>
<p>115 
</p>
<p>Riloff E. (1996), Automatically Generating Extraction Patterns from Untagged Text, 
Proceedings of Thirteenth National Conference on Artificial Intelligence, 1044-1049. 
</p>
<p>Soderland S. (1997), Learning Text Analysis Rules for Domain-specific Natural Language 
Processing, Ph.D. thesis, University of Massachusetts, Amherst. </p>

</div></div>
</body></html>