<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;valuation des taux de synonymie et de polys&#233;mie dans un texte</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>&#201;valuation des taux de synonymie et de polys&#233;mie dans un texte 
</p>
<p>Claude de Loupy (1) 
</p>
<p>(1) Sinequa 
loupy@sinequa.com 
</p>
<p>51-54, rue Ledru-Rollin 
94200 Ivry-sur-Seine 
</p>
<p>France 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>La polys&#233;mie et la synonymie sont deux aspects fondamentaux de la langue. Nous pr&#233;sentons 
ici une &#233;valuation de l&#8217;importance de ces deux ph&#233;nom&#232;nes &#224; l&#8217;aide de statistiques bas&#233;es sur 
le lexique WordNet et sur le SemCor. Ainsi, on a un taux de polys&#233;mie th&#233;orique de 5 sens 
par mot dans le SemCor. Mais si on regarde les occurrences r&#233;elles, moins de 50 % des sens 
possibles sont utilis&#233;s. De m&#234;me, s&#8217;il y a, en moyenne, 2,7 mots possibles pour d&#233;signer un 
concept qui appara&#238;t dans le corpus, plus de la moiti&#233; d&#8217;entre eux ne sont jamais utilis&#233;s. Ces 
r&#233;sultats relativisent l&#8217;utilit&#233; de telles ressources s&#233;mantiques pour le traitement de la langue.  
 
Polysemy and synonymy are two basic problems for natural language processing. In this 
paper, an evaluation of the importance of these phenomena is presented. It is based on the 
semantic lexicon WordNet and its associated corpus SemCor. Thus, when there are, in 
average, 5 possible senses for each word in the corpus, only half of them are really used. 
Similarly, if 2,7 words can be used to designate a concept, more than half of them are never 
used. These results tend to put the usefulness of such a resource in perspective.  
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
</p>
<p>taux de polys&#233;mie, taux de synonymie, lexiques s&#233;mantiques, WordNet, SemCor 
polysemy rate, synonymy rate, semantic lexicon, WordNet, SemCor 
</p>
<p>1 Introduction 
</p>
<p>La synonymie et la polys&#233;mie sont deux ph&#233;nom&#232;nes fondamentaux des langues humaines 
qu&#8217;il convient de consid&#233;rer avec attention dans presque toutes les applications de Traitement 
Automatique de la Langue (TAL). Ils sont essentiels au bon fonctionnement de la langue mais 
posent de grandes difficult&#233;s aux syst&#232;mes : en traduction automatique (traduction du mot 
anglais bank par banque ou rive), en recherche documentaire (sens de table dans &#171; table de 
logarithmes &#187; et &#171; table de cuisine &#187;), en synth&#232;se de la parole (prononciation du mot fils dans 
la phrase &#171; Les fils de la couturi&#232;re sont en soie &#187;). L&#8217;utilisation de lexiques s&#233;mantiques 
permet de r&#233;soudre (ou tenter de r&#233;soudre) certaines de ces difficult&#233;s. Mais quelle est 
</p>
<p>225 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claude de Loupy 
</p>
<p>l&#8217;ampleur du probl&#232;me ? Sommes-nous si souvent confront&#233;s &#224; la polys&#233;mie et &#224; la 
synonymie ? Dans les sections qui suivent, nous pr&#233;sentons une &#233;valuation statistique de ces 
ph&#233;nom&#232;nes, &#224; la fois par rapport &#224; un lexique et par rapport &#224; un corpus de texte. Pour cela, 
nous utilisons les informations pr&#233;sentes dans WordNet (Miller et al., 1990) De plus, la 
signification des statistiques fournies est illustr&#233;es par leur impact dans le cadre d&#8217;une 
application type recherche documentaire (RD). En effet, l&#8217;utilisation de connaissances et de 
traitements s&#233;mantiques en RD est fortement controvers&#233;e (CUSIRF, 2002).  
</p>
<p>2 La polys&#233;mie et WordNet 
</p>
<p>2.1 Pr&#233;sentation de WordNet 
</p>
<p>WordNet est un thesaurus pour l&#8217;anglais qui regroupe les termes par classes de synonymie et 
fournit des relations s&#233;mantiques (synonymie, hyponymie, m&#233;ronymie, etc.). Les concepts 
d&#233;finis dans WordNet, c&#8217;est-&#224;-dire les groupes de synonymes ou synsets, sont au nombre de 
91 591, correspondant &#224; 126 525 lemmes. Le nombre de couples mots-sens (association entre 
un lemme et l&#8217;un de ses sens possibles) est de 168 141, c&#8217;est-&#224;-dire qu&#8217;il y a, en moyenne, 1,3 
sens par lemme dans WordNet. De plus, chaque terme est r&#233;parti au sein de 45 classes 
s&#233;mantiques (animaux, actions, etc.).  
Bien s&#251;r, WordNet pr&#233;sente bien des d&#233;fauts et a &#233;t&#233; bien souvent critiqu&#233;. En particulier, 
dans le cas d&#8217;une RD, la finesse des sens (41 sens pour run) est tr&#232;s difficile &#224; utiliser, bien 
que nous ayons montr&#233; certaines am&#233;liorations quand on utilise WordNet dans un tel syst&#232;me 
(Loupy, 2000 ; Loupy &amp; El-B&#232;ze, 2002). D'un autre c&#244;t&#233;, le mot derby est consid&#233;r&#233; non 
ambigu et renvoie au sens de chapeau melon. La course de chevaux est totalement ignor&#233;e 
(Sch&#252;tze &amp; Pedersen, 1995). Or, cette distinction est fondamentale si on consid&#232;re un corpus 
de r&#233;sultats sportifs sur les courses de chevaux. Par ailleurs, la repr&#233;sentation s&#233;mantique par 
les classes s&#233;mantiques est trop grossi&#232;re. N&#233;anmoins, WordNet pr&#233;sente d&#233;j&#224; l&#8217;int&#233;r&#234;t 
d&#8217;exister et permet d&#8217;aborder les textes selon un aspect s&#233;mantique qui n&#8217;&#233;tait que 
difficilement accessible pr&#233;c&#233;demment. Cela est d&#8217;autant plus vrai que la couverture de 
WordNet est relativement bonne (Loupy et al., 1998). WordNet nous permet ainsi d&#8217;&#233;valuer 
les taux de polys&#233;mie et de synonymie pr&#233;sents dans les textes. Les chiffres donn&#233;s par la 
suite ont &#233;t&#233; &#233;valu&#233;s &#224; l&#8217;aide du SemCor, un corpus &#233;tiquet&#233; manuellement avec WordNet.  
</p>
<p>2.2 Pr&#233;sentation du SemCor 
</p>
<p>Le SemCor (Miller et al., 1993) est un extrait du Brown corpus de 171 documents diff&#233;rents 
contenant 197 360 mots dont 106 850 mots pleins, r&#233;partis en 11 182 phrases (la plus longue 
a 119 mots dont 65 mots pleins) et 3 056 paragraphes (le plus long contient 1 113 mots au 
total dont 537 mots pleins). Chaque mot plein a &#233;t&#233; &#233;tiquet&#233; manuellement &#224; l&#8217;aide des sens 
fournis dans WordNet. Selon le manuel fourni avec le corpus, le taux d'erreur de l&#8217;&#233;tiquetage 
serait de 13 % (SemCor, 1995). En fait, il est toujours difficile d&#8217;&#233;valuer la qualit&#233; d&#8217;un 
&#233;tiquetage et nous pr&#233;cisons ces chiffres pour que le lecteur se fasse sa propre id&#233;e de la 
pertinence des r&#233;sultats qui suivent. Nous pensons qu&#8217;ils restent valable malgr&#233; la confiance 
relative de l&#8217;annotation du fait du caract&#232;re tr&#232;s marqu&#233; des statistiques rapport&#233;es.  
</p>
<p>226 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation des taux de synonymie et de polys&#233;mie dans un texte 
</p>
<p>2.3 Importance de la polys&#233;mie 
</p>
<p>2.3.1 &#201;valuation du taux de polys&#233;mie dans le SemCor 
</p>
<p>En moyenne, il y a 1,3 sens par lemme dans WordNet. Cette ambigu&#239;t&#233; n'est pas importante et 
l'on pourrait alors penser que la t&#226;che de d&#233;sambigu&#239;sation est simple puisque l'ambigu&#239;t&#233; est 
assez faible et que 82 % des entr&#233;es sont non ambigu&#235;s. Mais ce taux d&#8217;ambigu&#239;t&#233; doit &#234;tre 
&#233;valu&#233; sur un corpus. Sur les 16 609 entr&#233;es WordNet utilis&#233;es dans le SemCor, seules 8 137 
d'entre elles sont non ambigu&#235;s, et elles ne repr&#233;sentent que 23 171 occurrences (22 %) dans 
le corpus qui en comporte 106 850. Le rapport est donc invers&#233; par rapport au lexique puisque 
l'on passe de 82 % de termes non ambigus &#224; seulement 22 %. Le taux d&#8217;ambigu&#239;t&#233; peut &#234;tre 
estim&#233; en rapportant la somme de tous les sens possibles au nombre d'occurrences des 
</p>
<p>lemmes dans le corpus : &#8721;
&#8721;
</p>
<p>&#922;
&#925;&#8901;&#922;
</p>
<p>&#955;
</p>
<p>&#955; &#955;
&#955;&#955;
</p>
<p>)(
</p>
<p>)()(
o&#249; ( )&#955;K  repr&#233;sente le nombre d'occurrences du 
</p>
<p>lemme &#955; dans le SemCor et ( )&#955;N  son nombre de sens dans WordNet. Ce qui donne une 
polys&#233;mie moyenne de 5 sens pour tous les lemmes et de 6,2 sens pour les lemmes ambigus.  
</p>
<p>2.3.2 Lien entre le nombre de sens et la fr&#233;quence d&#8217;occurrence 
</p>
<p>La Figure 1 indique la r&#233;partition des mots par nombre de sens dans WordNet et le SemCor.  
</p>
<p>1
</p>
<p>10
</p>
<p>100
</p>
<p>1000
</p>
<p>10000
</p>
<p>100000
</p>
<p>1000000
</p>
<p>1 3 5 7 9 11 13 15 17 19 21 25 27 29 33 41
</p>
<p>nb. occ. (WordNet)
</p>
<p>nb. occ. (SemCor)
</p>
<p>moy. occ. (SemCor)
</p>
<p>nb . sens
</p>
<p>nb . occ.
</p>
<p> 
</p>
<p>Figure 1 : Courbe de r&#233;partition des entr&#233;es WordNet selon leur nombre de sens 
</p>
<p>La premi&#232;re courbe (nb. occ. - WordNet) indique la r&#233;partition par nombre de sens dans 
WordNet. On voit qu&#8217;elle d&#233;cro&#238;t tr&#232;s rapidement. La deuxi&#232;me (nb. occ. - SemCor) indique 
cette r&#233;partition dans le SemCor (chaque occurrence d&#8217;un terme est compt&#233;e une fois). La 
aussi, la courbe d&#233;cro&#238;t mais de fa&#231;on beaucoup moins marqu&#233;e. Enfin, la derni&#232;re courbe 
(moy. occ. - SemCor) indique le nombre moyen d&#8217;occurrences des termes en fonction de leur 
nombre de sens dans le SemCor. Cette fois, la courbe cro&#238;t avec le nombre de sens 
(grossi&#232;rement). Cette courbe suit donc le principe de Zipf (1945) selon lequel plus un terme 
est fr&#233;quent, plus il a tendance &#224; &#234;tre ambigu. Or, la difficult&#233; de la lev&#233;e de l&#8217;ambigu&#239;t&#233; 
s&#233;mantique dans le SemCor vient principalement de termes hautement polys&#233;miques dont la 
fr&#233;quence est &#233;lev&#233;e : le verbe run a 41 sens diff&#233;rents et appara&#238;t 59 fois et le verbe have a 21 
sens et son nombre d'occurrences est 604. 
</p>
<p>227 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claude de Loupy 
</p>
<p>Mais il convient de remarquer aussi que, en RD, on consid&#232;re presque toujours que les termes 
les plus fr&#233;quents sont les moins informatifs, conform&#233;ment aux th&#233;ories de l&#8217;information 
classiques. Puisque les termes les plus fr&#233;quents sont les plus ambigus et que nous en tenons 
moins compte que les termes moins fr&#233;quents, il conviendrait de s&#8217;int&#233;resser &#224; des termes 
moins fr&#233;quents et donc moins polys&#233;miques. Cela diminue donc la complexit&#233; de l&#8217;op&#233;ration 
de d&#233;sambigu&#239;sation. Des exp&#233;riences en ce sens seraient sans doute int&#233;ressantes.  
Le Tableau 1 donne, dans le bloc de gauche, les 15 lemmes les plus fr&#233;quents (lemme, 
cat&#233;gorie grammaticale, nombre de sens, fr&#233;quence d&#8217;occurrence dans le SemCor), dans le 
bloc central, les 15 couples lemme/sens les plus fr&#233;quents (lemme/sens, cat&#233;gorie 
grammaticale, fr&#233;quence) et dans le dernier bloc, les 15 synsets les plus fr&#233;quents (synset, 
cat&#233;gorie grammaticale, fr&#233;quence). 
 
Lemme C nb. sens fr&#233;q. Lemme, Sens C
</p>
<p>fr&#233;q
. Synset C fr&#233;q. 
</p>
<p>be v 12 4623 person (&#234;tre humain) n 3853 person, individual, someone, mortal, human, soul n 3906 
</p>
<p>person n 3 3853 be (occuper une certaine position) v 2920
be, occupy certain position, 
</p>
<p>occupy certain area v 2920 
</p>
<p>not r 1 928 not (n&#233;gation) r 928 not, n&#8217;t r 1306 
</p>
<p>group n 3 838 group (entit&#233;s consid&#233;r&#233;es comme une unit&#233;) n 838 group, grouping n 838 
</p>
<p>location n 4 613 be (constituer, repr&#233;senter) v 804 constitute, represent, make up, be v 816 
</p>
<p>have v 21 604 location (un point ou une &#233;tendue) n 610 location n 610 
</p>
<p>say v 9 580 say (exprimer une id&#233;e, etc.) v 504 state, say, tell v 577 
one a 9 430 have (poss&#233;der) v 437 have, have got, hold v 445 
n&#8217;t r 1 378 one (une seule unit&#233;) a 419 look, appear, seem v 298 
</p>
<p>man n 10 356 n&#8217;t (n&#233;gation) r 378 man, adult male n 290 
only r 6 344 two (cardinal) a 304 one, 1, i, ane  288 
make v 31 324 man (une personne m&#226;le adulte) n 290 effect, carry out, make, do v 284 
see v 19 318 be (&#234;tre &#233;gal) v 269 two, 2, ii a 282 
</p>
<p>more r 3 318 be (avoir lieu) v 269 equal, be identical to, be v 272 
two a 1 304 make (se lancer dans) v 263 be, occur v 269 
</p>
<p>Tableau 1 : Lemmes, sens et synsets les plus fr&#233;quents dans le Semcor 
</p>
<p>Parmi les 15 lemmes les plus fr&#233;quents, la plupart figurent dans les 15 lemmes-sens et les 15 
synsets les plus fr&#233;quents. Le verbe be (qui est le lemme le plus fr&#233;quent) appara&#238;t dans 4 des 
15 lemmes-sens les plus fr&#233;quents. De plus, il fait partie de 4 des 15 synsets les plus 
fr&#233;quents. En fait, si l'on consid&#232;re le recouvrement entre les 15 lemmes et les 15 lemmes-
sens les plus fr&#233;quents, on peut avoir une id&#233;e de l'effet de la polys&#233;mie dans les mots 
fr&#233;quents. Dans ce cas, on peut facilement calculer que, dans 83 % des cas, c'est le sens le 
plus courant qui est employ&#233; pour ces mots. De m&#234;me, si l'on calcule le recouvrement entre 
les lemmes-sens et les synsets les plus fr&#233;quents, on peut avoir une id&#233;e de l'effet de la 
synonymie. On trouve alors que, pour les synsets les plus fr&#233;quents, le m&#234;me repr&#233;sentant est 
utilis&#233; dans 97 % des cas. Ce r&#233;sultat tend &#224; prouver que l'influence de la synonymie est faible 
par rapport &#224; celle de la polys&#233;mie. Il convient de relativiser cette affirmation car elle n&#8217;est 
faite qu&#8217;&#224; partir de l&#8217;observation des termes tr&#232;s fr&#233;quents.  
Une cons&#233;quence de ces observations est que la r&#233;partition des sens et celle des mots sont 
intimement li&#233;es. On constate que les 4 premi&#232;res occurrences de lemmes correspondent 
exactement aux 4 premi&#232;res occurrences de lemmes-sens et aux 4 premi&#232;res occurrences de 
synsets. Ces observations ont d&#233;j&#224; &#233;t&#233; faites par Biber et al. (1994) et montrent qu&#8217;il est 
</p>
<p>228 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation des taux de synonymie et de polys&#233;mie dans un texte 
</p>
<p>important de conna&#238;tre la r&#233;partition r&#233;elle des sens dans l&#8217;utilisation du mot en plus de 
conna&#238;tre ses diff&#233;rents sens possibles. 
</p>
<p>2.3.3 Statistiques g&#233;n&#233;rales 
</p>
<p>Les tableaux 2 et 3 donnent certains r&#233;sultats statistiques sur WordNet et le SemCor. Chaque 
information est &#233;valu&#233;e sur tous les mots et par cat&#233;gorie grammaticale.  
 
</p>
<p> Tout Adjectifs Adverbes Noms Verbes 
Nb. de lemmes 126 525 19 101 5 050 87 647 14 727 
</p>
<p>Nb.lemmes ambigus 22 283 5 303 771 11 515 4 694 
Nb. de synsets 91 591 16 428 3 243 60 557 11 363 
</p>
<p>Nb. de mots-sens 168 217 28 762 6 203 107 484 25 768 
Polys&#233;mie moy. (tous lemmes) 1,33 1,51 1,23 1,23 1,75 
</p>
<p>Polys&#233;mie moy. (lemmes ambigus) 2,87 2,82 2,49 2,72 3,35 
</p>
<p>Tableau 2 : Comportement statistique des synsets dans WordNet 
</p>
<p> Tout Adjectifs Adverbes Noms Verbes 
Nb. lemmes diff&#233;rents 17 098 4 043 1 308 8 451 3 296 
Nb. lemmes ambigus 8 708 2 136 393 4 018 2 161 
</p>
<p>Nb. occurrences de lemmes 106 850 19 753 11 804 48 606 26 687 
Nb. occurrences lemmes ambigus 82 688 14 195 6 565 37 513 24 415 
</p>
<p>Nb. de synsets 19 119 4 480 1 108 9 675 3 880 
Nb. de mots-sens 23 930 5 317 1 627 11 379 5 607 
</p>
<p>Polys&#233;mie moy. (tous les lemmes) 5,02 4,25 2,56 3,98 8,58 
Polys&#233;mie moy. (lemmes 
</p>
<p>ambigus) 6,2 5,52 3,80 4,87 9,29 
</p>
<p>Tableau 3 : Comportement statistique des synsets dans le SemCor.  
</p>
<p>Les chiffres pr&#233;c&#233;dents montrent que le tableau (au sens figur&#233;) que l&#8217;on peut dresser &#224; partir 
d&#8217;un corpus est totalement diff&#233;rent de celui qu&#8217;on pourrait dresser &#224; partir du lexique, en 
particulier en ce qui concerne la r&#233;partition des concepts et des ambigu&#239;t&#233;s. Il y a 18,5 % 
d&#8217;adjectifs, 11 % d&#8217;adverbes, 45,5 % de noms et 25 % de verbes dans le SemCor (mots pleins 
uniquement). On peut aussi voir que la t&#226;che la plus difficile est l&#8217;&#233;tiquetage des verbes 
puisque le taux d&#8217;ambigu&#239;t&#233; dans cette cat&#233;gorie est de 8,58 sens par verbes.  
</p>
<p>2.4 Taux r&#233;el de polys&#233;mie 
</p>
<p>Les statistiques donn&#233;es dans la section pr&#233;c&#233;dente permettent de savoir combien il y a de 
sens possibles par mot dans le SemCor. Mais il serait int&#233;ressant de savoir aussi combien de 
ces sens sont r&#233;ellement utilis&#233;s. En effet, il ne suffit pas de savoir qu&#8217;un terme peut &#234;tre tr&#232;s 
ambigu selon le lexique, il faut aussi se demander avec quelles fr&#233;quence les diff&#233;rents sens 
possibles sont utils&#233;s. Le Tableau 4 donne les statistiques d&#8217;utilisation des sens des termes 
polys&#233;miques pr&#233;sents dans le SemCor.  
La deuxi&#232;me colonne donne la proportion des sens d&#8217;un terme qui sont utilis&#233;s dans le 
SemCor. La troisi&#232;me indique le pourcentage d&#8217;utilisation du sens le plus fr&#233;quent et la 
quatri&#232;me le minimum d&#8217;utilisation du sens le plus fr&#233;quent. On voit donc que moins d&#8217;un 
sens sur deux est r&#233;ellement utilis&#233;, ce qui rejoint les conclusions de Church et Mercer (1993) 
selon lesquelles la plupart des sens donn&#233;s dans un dictionnaire sont tr&#232;s peu utilis&#233;s. Ainsi, 
m&#234;me si le nombre moyen de sens associ&#233;s &#224; un mot dans le SemCor plaide en faveur de 
l&#8217;utilisation d&#8217;un syst&#232;me de d&#233;sambigu&#239;sation s&#233;mantique, le taux r&#233;el de polys&#233;mie diminue 
l&#8217;espoir que l&#8217;on pourrait mettre dans une telle solution. En particulier, dans le cas d&#8217;une 
</p>
<p>229 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claude de Loupy 
</p>
<p>recherche documentaire, une d&#233;sambigu&#239;sation s&#233;mantique ne serait utile que si le terme 
utilis&#233; dans la requ&#234;te est utilis&#233; dans un sens qui n&#8217;est pas son sens le plus fr&#233;quent.  
 
</p>
<p>Cat&#233;gorie 
grammaticale 
</p>
<p>Pourcentage de sens 
utilis&#233;s 
</p>
<p>Utilisation du sens le plus 
fr&#233;quent 
</p>
<p>Minimum d&#8217;utilisation du sens le plus 
fr&#233;quent 
</p>
<p>Tout 48,98 % 83,86 % 11,80 % 
Adjs 45,79 % 86,58 % 23,08 % 
Adv 65,99 % 84,17 % 36,84 % 
</p>
<p>Noms 49,75 % 84,91 % 20,69 % 
Verbes 48,41 % 79,17 % 11,80 % 
</p>
<p>Tableau 4 : Utilisation r&#233;elle des sens dans WordNet. 
</p>
<p>Cela est particuli&#232;rement important si l&#8217;on consid&#232;re les requ&#234;tes pos&#233;es dans l&#8217;&#233;valuation 
TREC (Harman, 1993). Les titres (1 &#224; 5 mots sens&#233;s repr&#233;senter le besoin informationnel) 
comporte des mots qui sont choisis pour &#234;tre le plus informatif et le moins ambigu possible. 
Les conclusions mises en avant &#224; l&#8217;aide de cet environnement montrent g&#233;n&#233;ralement le peu 
d&#8217;utilit&#233; d&#8217;outils de d&#233;sambigu&#239;sation s&#233;mantique et cela semble logique &#233;tant donn&#233;e la 
nature des requ&#234;tes. Malgr&#233; ce fait et malgr&#233; la non pertinence de WordNet pour une 
application en RD, il est tout de m&#234;me possible d&#8217;obtenir une am&#233;lioration des performances 
en utilisant un syst&#232;me de d&#233;sambigu&#239;sation s&#233;mantique (Loupy &amp; El-B&#232;ze, 2002).  
</p>
<p>3 La synonymie et WordNet 
</p>
<p>3.1 &#201;valuation du taux de synonymie dans le SemCor 
</p>
<p>WordNet permet d&#8217;&#233;valuer la difficult&#233; que repr&#233;sente la synonymie. Le Tableau 5 indique le 
taux de synonymie (c&#8217;est-&#224;-dire le nombre moyen de synonymes par mot) dans WordNet, 
&#233;valu&#233; sur le SemCor lorsque le sens du terme est connu (ligne Corp-desamb) et lorsque ce 
sens n'est pas connu (ligne Corp-amb) en fonction de la cat&#233;gorie grammaticale.  
 
</p>
<p>Cat&#233;gorie 
gram. Toutes Adjectifs Adverbes Noms Verbes
</p>
<p>WordNet 1,84 1,75 1,91 1,77 2,27 
Corp-d&#233;samb 2,68 2,14 3,32 2,51 3,08 
</p>
<p>Corp-amb 18,28 14,24 10,55 13,11 34,11 
</p>
<p>Tableau 5 : Taux de synonymie en utilisant WordNet 
</p>
<p>La connaissance du nombre de synonymes possibles lorsque le sens n&#8217;est pas connu est 
importante dans le cas de la recherche documentaire si l&#8217;on suppose un enrichissement sans 
d&#233;sambigu&#239;sation s&#233;mantique, c&#8217;est-&#224;-dire sans conna&#238;tre le sens des termes. La tr&#232;s grande 
diff&#233;rence entre les taux de synonymie lorsque l&#8217;on conna&#238;t le sens et lorsqu&#8217;il n&#8217;est pas 
connu se justifie tout &#224; fait si l&#8217;on consid&#232;re qu&#8217;un terme a, en moyenne, 5 sens dans le 
SemCor. Si l&#8217;on multiplie ce nombre par les 2,68 synonymes possibles par mot-sens, on se 
rapproche du taux de 18,28. On voit donc que le taux de synonymie moyen dans un texte est 
assez important puisque, selon ces chiffres, chaque mot pourrait &#234;tre remplac&#233; (selon 
WordNet) par presque deux autres si le sens est connu, par 18 autres sinon !  
La Figure 2 montre la fr&#233;quence moyenne des lemmes dans le SemCor en fonction de leur 
nombre de sens : plus le terme est polys&#233;mique, plus il est fr&#233;quent en moyenne.  
</p>
<p>230 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation des taux de synonymie et de polys&#233;mie dans un texte 
</p>
<p>0
</p>
<p>50
</p>
<p>100
</p>
<p>150
</p>
<p>200
</p>
<p>250
</p>
<p>300
</p>
<p>350
</p>
<p>0 10 20 30 40 50
nb . sens
</p>
<p>nb . occ.
</p>
<p> 
</p>
<p>Figure 2 : Nombre moyen d&#8217;occurrences des termes dans le SemCor en fonction du nombre 
de sens. 
</p>
<p>La Figure 3 montre la fr&#233;quence moyenne des concepts (synsets) dans le SemCor en fonction 
de leur nombre de synonymes. S&#8217;il y a aussi une certaine tendance &#224; l&#8217;accroissement de la 
fr&#233;quence en fonction du nombre d&#8217;&#233;l&#233;ments, en tout cas pour les groupes les moins 
nombreux, elle est beaucoup moins marqu&#233;e. Nous reviendrons sur ce point avec le Tableau 
6. 
Enfin, la Figure 4 montre le nombre moyen d&#8217;occurrences des lemmes dans le SemCor en 
fonction de leur nombre de synonymes (tous sens confondus). La tendance de la courbe ainsi 
dessin&#233;e correspond &#224; celle obtenue dans la Figure 2. On retrouve l&#8217;augmentation de la 
fr&#233;quence d&#8217;occurrence moyenne en fonction de l&#8217;augmentation du nombre de synonymes. 
On peut aussi constater qu&#8217;il y a une correspondance presque parfaite entre les deux courbes.   
 
</p>
<p>0
</p>
<p>5
</p>
<p>10
</p>
<p>15
</p>
<p>20
</p>
<p>25
</p>
<p>0 5 10 15 20
</p>
<p>nb . occ.
</p>
<p>nb . syn. /concept
</p>
<p>0
</p>
<p>100
</p>
<p>200
</p>
<p>300
</p>
<p>400
</p>
<p>500
</p>
<p>600
</p>
<p>700
</p>
<p>0 50 100 150 200
</p>
<p>nb . occ.
</p>
<p>nb . syn./ lem
 
</p>
<p>Figure 3 : Nombre moyen d&#8217;occurrences des 
mots-sens dans le SemCor en fonction du 
</p>
<p>nombre de synonymes. 
</p>
<p>Figure 4 : Fr&#233;quence moyenne des termes 
dans le SemCor en fonction du nombre de 
</p>
<p>synonymes (sens inconnu). 
 
Cette correspondance est logique. Un terme appartient &#224; autant de synsets qu&#8217;il a de sens. 
Chacun de ces synsets contenant un certain nombre d&#8217;&#233;l&#233;ments (en moyenne 2,68, cf. Tableau 
5), le lien entre nombre de synonymes possibles et nombre de sens est imm&#233;diat. En revanche, 
il n&#8217;en va pas de m&#234;me pour les synsets, ce qui est illustr&#233; dans le Tableau 6. Ce tableau 
donne les 15 lemmes qui ont le plus de sens (lemme, cat&#233;gorie grammaticale, nombre de sens, 
fr&#233;quence dans le SemCor), les 15 lemmes ayant le plus de synonymes possibles sans tenir 
compte du sens (lemme, cat&#233;gorie grammaticale, nombre de synonymes possibles, fr&#233;quence) 
et les 15 synsets ayant le plus d&#8217;&#233;l&#233;ments (synset, cat&#233;gorie grammaticale, nombre 
d&#8217;&#233;l&#233;ments, fr&#233;quence). On pourra comparer ces statistiques &#224; celles donn&#233;es dans le Tableau 
1. 
Sur ce tableau, on peut v&#233;rifier que les termes les plus ambigus sont aussi ceux qui ont le plus 
de synonymes possibles : entre les 15 lemmes les plus ambigus et les 15 lemmes ayant le plus 
</p>
<p>231 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claude de Loupy 
</p>
<p>de synonymes, il n&#8217;y a que 4 termes de chaque c&#244;t&#233; qui n&#8217;apparaissent pas dans l&#8217;autre 
colonne. De plus, la fr&#233;quence d&#8217;occurrence est &#233;lev&#233;e puisque le lemme le moins fr&#233;quent 
dans le SemCor appara&#238;t 11 fois (check) alors que la fr&#233;quence moyenne des lemmes est de 
6,25. Pour les synsets, la fr&#233;quence moyenne est de 5,6 et si on consid&#232;re les 8 concepts ayant 
10 &#233;l&#233;ments ou plus, seuls 3 d&#8217;entre eux ont une fr&#233;quence sup&#233;rieure &#224; la moyenne. Pour ce 
qui est des concepts ayant 9 &#233;l&#233;ments, il y en a en fait 67. Seuls les 12 plus fr&#233;quents sont 
pr&#233;sents dans le Tableau 6. Parmi ces 67 concepts, seuls 21 apparaissent plus souvent que la 
moyenne. De plus, on peut aussi voir que les termes les plus ambigus et ceux qui ont le plus 
de synonymes sont tr&#232;s majoritairement des verbes. Cette tendance est un peu moins marqu&#233;e 
pour les synsets. Enfin, il n&#8217;y a pas de correspondance entre les 20 lemmes les plus fr&#233;quents 
(cf. Tableau 1) et les 20 synsets ayant le plus d&#8217;&#233;l&#233;ments. Seuls only et know apparaissent 
dans l&#8217;un des synsets ayant le plus de synonymes. Cette constatation contredit l&#8217;affirmation de 
Voorhees (1993) selon laquelle les termes les plus fr&#233;quents sont ceux qui se trouvent dans 
les classes s&#233;mantiques les plus larges, c&#8217;est-&#224;-dire celles ayant le plus d&#8217;&#233;l&#233;ments. 
 
</p>
<p>15 lemmes les plus 
ambigus 
</p>
<p>15 lemmes ayant le 
plus de synonymes 15 synsets ayant le plus d&#8217;&#233;l&#233;ments 
</p>
<p>Lem. C se F Lem. C syn F Synset C EL. F 
run v 41 59 run v 149 59 botch, fumble, botch_up, muff, blow_it, flub, screw_up, ... v 17 5 
take v 35 161 take v 144 161 confuse, perplex, throw, fox, befuddle, fuddle, bedevil, ... v 16 11
draw v 33 36 pass v 123 42 love, make_love, sleep_with, get_laid, have_sex, know, ... v 16 2 
make v 31 324 make v 123 324 three, 3, iii, trio, threesome, tierce, leash, troika, triad, ... n 12 20
open a 29 41 go v 117 125 rebuke, rag, reproof, reprimand, jaw, dress_down, scold, ... v 11 3 
go v 28 125 break v 116 21 gorge, ingurgitate, overindulge, glut, englut, stuff, ... v 11 2 
</p>
<p>give v 27 210 give v 113 210 bang-up, bully, cool, corking, cracking, dandy, great, ... a 10 6 
line v 27 68 draw v 111 36 dress_up, fig_out, fig_up, deck_up, gussy_up, fancy_up, ... v 10 4 
</p>
<p>break v 27 21 have v 103 604 happen, hap, go_on, pass_off, occur, pass, ... v 9 96
good a 26 125 line n 98 68 perfectly, plumb, completely, entirely, totally, utterly, ... r 9 71
carry v 26 41 good a 91 125 presently, momentarily, in_a_moment, anon, soon, ... r 9 46
play v 25 63 open a 90 41 find, happen_upon, chance_upon, hit_upon, bump_into, ... v 9 43
pass v 25 42 cut v 88 12 dad, dada, daddy, old_man, pa, papa, pappa, pater, pop n 9 39
lift v 25 18 get v 88 158 end, terminate, close_over, cease, run_out, stop, ... v 9 28
</p>
<p>head v 23 94 check v 87 11 traverse, track, cover, cross, pass_over, get_over, .... v 9 19
</p>
<p>Tableau 6 : Lemmes ayant le plus de sens, concepts et lemmes ayant le plus de synonymes 
dans le SemCor. 
</p>
<p>3.2 Taux r&#233;el de synonymie 
</p>
<p>Les statistiques donn&#233;es dans le Tableau 5 indiquent le nombre moyen de termes possibles 
pour d&#233;signer les concepts apparaissant dans le SemCor et le nombre moyen de synonymes 
qui existent pour tous les lemmes qui apparaissent dans le SemCor. Mais, en fait, ce qu&#8217;il 
conviendrait de savoir, c&#8217;est la propension &#224; r&#233;ellement utiliser des synonymes. En effet, un 
terme peut avoir un synonyme mais celui-ci peut ne jamais &#234;tre utilis&#233;. Le Tableau 7 donne 
des statistiques d&#8217;utilisation de synonymes dans le SemCor pour l&#8217;ensemble des lemmes et 
selon leur cat&#233;gorie grammaticale. Ces donn&#233;es ont &#233;t&#233; calcul&#233;es &#224; partir des concepts utilis&#233;s 
dans le SemCor pour lesquels il existe plus d&#8217;un terme.  
 
</p>
<p>232 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation des taux de synonymie et de polys&#233;mie dans un texte 
</p>
<p>Cat&#233;gorie 
grammaticale 
</p>
<p>Pourcentage de 
synonymes utilis&#233;s 
</p>
<p>Utilisation du synonyme le 
plus fr&#233;quent 
</p>
<p>Minimum d&#8217;utilisation du synonyme 
le plus fr&#233;quent 
</p>
<p>Tout 45,6 % 89,6 % 20,0 % 
Adj. 42,9 % 89,4 % 20,0 % 
Adv. 51,9 % 87,4 % 28,6 % 
Noms 45,8 % 91,4 % 25,0 % 
Verb. 45,9 % 87,4 % 25,0 % 
</p>
<p>Tableau 7 : Utilisation des synonymes dans le SemCor. 
</p>
<p>La deuxi&#232;me colonne donne le pourcentage de termes utilis&#233;s pour d&#233;signer un concept 
rapport&#233; aux nombre de termes possibles. On constate que 54,4 % des termes possibles ne 
sont pas utilis&#233;s. Cela est grandement confirm&#233; par la troisi&#232;me colonne. Elle donne le 
pourcentage d&#8217;occurrence du terme le plus fr&#233;quemment utilis&#233; pour d&#233;signer un concept. 
Ainsi, on constate que, dans 89,6 % des cas, c&#8217;est le m&#234;me terme qui est utilis&#233; pour pointer 
un concept. Il s&#8217;agit d&#8217;un chiffre &#233;lev&#233; et les possibilit&#233;s de gain en terme de recherche 
documentaire sont donc limit&#233;s. Il y a peu de possibilit&#233;s d&#8217;accroissement des performances 
en RD par utilisation des synonymes si le terme utilis&#233; dans une requ&#234;te est le terme le plus 
fr&#233;quemment utilis&#233; pour repr&#233;senter un concept. Mais, bien s&#251;r, il ne s&#8217;agit que d&#8217;une 
moyenne. Si on consid&#232;re le concept 00014558, il est repr&#233;sent&#233; &#224; &#233;galit&#233; par ses deux 
&#233;l&#233;ments shape et form (5 fois chacun) dans le SemCor. Les performances sur une requ&#234;te qui 
contiendrait shape pourraient &#234;tre am&#233;lior&#233;es en utilisant aussi le nom form. Il convient donc 
de prendre en compte la r&#233;partition du concept sur ses diff&#233;rents &#233;l&#233;ments lors d&#8217;un 
enrichissement.  La connaissance de la r&#233;partition des termes sur les concepts permettrait de 
d&#233;terminer quels enrichissements auront un impact important sur les performances. Cela est 
d&#8217;autant plus int&#233;ressant que nous savons, suite &#224; de nombreuses publications (comme celle 
de Harman (1988)) que les performances sont am&#233;lior&#233;es lorsque l&#8217;utilisateur choisit un 
certain nombre de termes d&#8217;enrichissement parmi ceux que le syst&#232;me lui propose &#224; partir 
d&#8217;un thesaurus. Il serait donc possible de limiter ces propositions aux seuls termes qui 
peuvent avoir un impact important, soit parce qu&#8217;ils apparaissent de nombreuses fois dans la 
collection, soit parce que le terme d&#8217;origine n&#8217;est pas majoritaire dans sa classe de synonymie.  
</p>
<p>4 Conclusion 
</p>
<p>Dans cette article, nous effectuons une &#233;valuation des taux de polys&#233;mie et de synonymie 
pr&#233;sents dans un texte. Nous pouvons constater que, m&#234;me si les taux de polys&#233;mie et de 
synonymie th&#233;oriques sont importants, le taux r&#233;el d&#8217;utilisation des diff&#233;rents sens d&#8217;un terme 
et des diff&#233;rents mots possibles pour exprimer un concept donn&#233; est relativement faible. De 
plus, ces deux ph&#233;nom&#232;nes sont importants sur les mots ou les concepts les plus fr&#233;quents. 
Or, dans le cas de la recherche documentaire, par exemple, les termes les plus fr&#233;quents sont 
ceux qui apportent le moins d&#8217;information. Ils sont donc plus ou moins n&#233;glig&#233;s.  
Cette faible possibilit&#233; d&#8217;am&#233;lioration explique pourquoi les exp&#233;riences d&#8217;utilisation de 
connaissances s&#233;mantiques en recherche documentaire donnent des r&#233;sultats si 
contradictoires. On pourrait donc en conclure que ces deux ph&#233;nom&#232;nes ne posent pas 
r&#233;ellement de probl&#232;me &#224; un syst&#232;me de recherche documentaire (entre autre application). En 
fait, ce n&#8217;est pas le cas parce que, m&#234;me si les cas o&#249; ces informations sont indispensables ne 
sont pas tr&#232;s fr&#233;quent, un utilisateur acceptera difficilement d&#8217;&#234;tre confront&#233; &#224; des probl&#232;mes 
d&#8217;ambigu&#239;t&#233; (bruit des moteurs) ou de synonymie (silence des moteurs) alors que ces 
questions lui semble &#233;videntes. Et, m&#234;me s&#8217;il l&#8217;accepte, c&#8217;est aux d&#233;veloppeurs de tels 
syst&#232;mes de faire en sorte de lui faciliter la t&#226;che. Il est donc n&#233;cessaire d&#8217;&#233;tudier chaque mot 
selon ses caract&#233;ristiques (nombre de sens, nombre de synonymes, fr&#233;quence, fr&#233;quence du 
</p>
<p>233 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Claude de Loupy 
</p>
<p>234 
</p>
<p>sens le plus fr&#233;quent, fr&#233;quence par rapport &#224; celle du concept qu&#8217;il repr&#233;sente, etc.). En 
fonction de ces caract&#233;ristiques, des choix doivent &#234;tre pris afin de choisir la meilleure 
strat&#233;gie &#224; adopter. Un module de d&#233;sambigu&#239;sation s&#233;mantique peut alors &#234;tre utilis&#233;, ou un 
enrichissement par synonymie ou tout autre type de traitement s&#233;mantique selon le cas.  
Ces conclusions doivent encore &#234;tre confirm&#233;es par d&#8217;autres exp&#233;riences, en particulier en 
utilisant d&#8217;autres lexiques. WordNet n&#8217;est peut-&#234;tre pas le lexique le plus ad&#233;quat pour ce 
genre d&#8217;&#233;valuations statistiques. Mais il faut aussi confirmer ces r&#233;sultats sur d&#8217;autres corpus, 
d&#8217;autres langues, voire d&#8217;autres ph&#233;nom&#232;nes s&#233;mantiques (hyponymie, etc. ).  
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Biber D., Conrad S.,  Reppen R. (1994), Corpus-Based Approaches to Issues in Applied 
Linguistics, in Applied Linguistics, vol 15, pp. 169-189. 
Church K. W., Mercer R. L. (1993), Introduction to the special issue on computational 
linguistics using large corpora, Computational Linguistics, Vol. 19, No. 1, pp. 1-24. 
CUSIRF (2002), Creating and Using Semantics for Information Retrieval and Filtering State 
of the Art and Future Research, Atelier en marge de Third International Conference on 
Language Resources and Evaluation. 
Harman D. (1993), Overview of the First Text REtrieval Conference, National Institute of 
Standards and Technology Special Publication 500-207. 
Harman D. (1988), Towards interactive query expansion, Actes de 11th Annual International 
ACMSIGIR Conference on Research &amp; Development in Information Retrieval, pp. 321-331. 
Loupy C. de, El-B&#232;ze M., Marteau P.-F. (1998), Word Sense Disambiguation using HMM 
Tagger, Actes de First International Conference on Language Resources &amp; Evaluation, pp. 
1255-1258. 
Loupy C. de (2000), &#201;valuation de l&#8217;apport de connaissances linguistiques en 
d&#233;sambigu&#239;sation s&#233;mantique et recherche documentaire, M&#233;moire de Doctorat.  
Loupy C. de, El-B&#232;ze M. (2002, Managing Synonymy and Polysemy in a Document Retrieval 
System Using WordNet, Actes de Creating and Using Semantics for Information Retrieval 
and Filtering State of the Art and Future Research, Atelier en marge de Third International 
Conference on Language Resources and Evaluation.  
Miller G.A., Beckwith R., Fellbaum C., Gross D., Miller K. (1990), Introduction to WordNet: 
An online lexical database, International Journal of Lexicography, Vol. 3 (4), pp. 235-244. 
Miller G. A., Leacock C., Randee T., Bunker R. (1993) A semantic concordance, Actes de 
3rd DARPA Workshop on Human Language Technology, pp. 303-308. 
Sch&#252;tze H., Pedersen J. (1995), Information retrieval based on word senses, Actes de 4th 
Annual Symposium on Document Analysis and Information Retrieval, pp. 161-175. 
Semcor man pages (1995), SemCor - Discussion of semantic concordance of semantically 
tagged text, http://www.cosgi.princeton.edu/~wn/man/semcor.7WN.html. 
Strzalkowski T., Stein G. C., Wise G. B., Bagga A. (2000), Towards the Next Generation 
Information Retrieval, Actes de RIAO'2000. 
Voorhees E. M. (1993), Using WordNet to disambiguate word senses for text retrieval, Actes 
de 16th Annual International ACM SIGIR Conference on Research and Development in 
Information Retrieval, pp. 171-180. 
Zipf G.K. (1945), Themeaning-frequency relationship of words, Journal of general 
psychology 3, pp. 251-256. </p>

</div></div>
</body></html>