<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Distinguer les termes des collocations : &#233;tude sur corpus du patron &lt;Adjectif &#8211; Nom&gt; en anglais m&#233;dical</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Distinguer les termes des collocations : &#233;tude sur corpus du patron 
&lt;Adjectif &#8211; Nom&gt; en anglais m&#233;dical 
</p>
<p>Fran&#231;ois MANIEZ. 
</p>
<p>Centre de Recherche en Terminologie et en Traduction 
Universit&#233; Lumi&#232;re Lyon 2 
</p>
<p>fmaniez@wanadoo.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Un bon nombre des applications de traitement automatique des langues qui ont pour domaine 
les langues de sp&#233;cialit&#233; sont des outils d&#8217;extraction terminologique. Elles se concentrent 
donc naturellement sur l&#8217;identification des groupes nominaux et des groupes pr&#233;positionnels 
ou pr&#233;modificateurs qui leur sont associ&#233;s. En nous fondant sur un corpus compos&#233; d&#8217;articles 
de recherche m&#233;dicale de langue anglaise, nous proposons un mod&#232;le d&#8217;extraction 
phras&#233;ologique semi-automatis&#233;e. Afin de distinguer, dans le cas des expressions de patron 
syntaxique &lt;Adjectif &#8211; Nom&gt;, les termes de la langue m&#233;dicale des simples collocations, 
nous nous sommes livr&#233; au rep&#233;rage des adjectifs entrant en cooccurrence avec les adverbes. 
Cette m&#233;thode, qui permet l&#8217;&#233;limination de la plupart des adjectifs relationnels, s&#8217;av&#232;re 
efficace en termes de pr&#233;cision. L&#8217;am&#233;lioration de son rappel n&#233;cessite toutefois l&#8217;utilisation 
de corpus de grande taille ayant subi un &#233;tiquetage morpho-syntaxique pr&#233;alable. 
</p>
<p>Abstract 
</p>
<p>Many of the Natural Language Processing applications that deal with sublanguages are 
terminological extraction tools. They consequently tend to focus on the identification of noun 
and prepositional clauses and their modifiers. Using a corpus of English medical research 
articles, we suggest a semi-automatic phraseological extraction system. In order to separate 
terms from collocations within the category that fits the &lt;Adjective &#8211; Noun&gt; pattern, we 
experiment with the approach that consists in extracting adjectives that co-occur with 
adverbs. This method, which makes it possible to eliminate most relative adjectives, proves to 
provide good precision. However, the use of a larger POS-tagged corpus will be necessary in 
order to improve the method&#8217;s recall. 
</p>
<p>Mots Cl&#233;s 
</p>
<p>Termes, collocations, adjectifs, noms, corpus, anglais de sp&#233;cialit&#233;. 
</p>
<p>345 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maniez Fran&#231;ois 
</p>
<p>Keywords 
</p>
<p>Terms, collocations, adjectives, nouns, corpus, English for Specific Purposes. 
</p>
<p>1 Introduction 
</p>
<p>L&#8217;une des principales caract&#233;ristiques des langues de sp&#233;cialit&#233; est leur haute densit&#233; 
terminologique. Cette pr&#233;dominance quantitative de la terminologie fait de l&#8217;extraction 
terminologique un champ d&#8217;investigation privil&#233;gi&#233; en traitement automatique des langues. 
Mais l&#8217;un de ses effets est &#233;galement de rendre plus d&#233;licate l&#8217;extraction phras&#233;ologique et 
l&#8217;&#233;tude des collocations. Les expressions de patrons syntaxiques identiques (par exemple, 
celle du type &lt;Adjectif &#8211; Nom&gt; en anglais)1 peuvent &#234;tre rep&#233;r&#233;es automatiquement gr&#226;ce &#224; 
un &#233;tiquetage morpho-syntaxique, mais ce sont des caract&#233;ristiques s&#233;mantiques qui 
distinguent les termes des collocations. 
</p>
<p>L&#8217;&#233;tude des collocations en langue de sp&#233;cialit&#233; est une activit&#233; qui a &#233;t&#233; consid&#233;rablement 
facilit&#233;e par la mise au point de logiciels d&#8217;extraction et de concordance. Parmi les travaux les 
plus r&#233;cents, on peut citer ceux de G. Williams dans le domaine de la biologie v&#233;g&#233;tale et 
ceux de M-C. L&#8217;Homme dans le domaine de l&#8217;informatique. Williams (1998) recherche les 
cooccurrences significatives entre deux lex&#232;mes, non seulement afin d'extraire des bin&#244;mes 
ou des expression polylexicales mais aussi pour d&#233;terminer leur &#171; r&#244;le th&#233;matique, facteur de 
coh&#233;sion textuelle &#187;, ce qui l&#8217;am&#232;ne &#224; utiliser la notion de &#171; r&#233;seaux de collocations&#187;. 
L&#8217;Homme (1998) concentre principalement son &#233;tude sur les collocations &#224; base verbale, en 
particulier dans le domaine de l&#8217;informatique. Elle effectue la description des verbes 
sp&#233;cialis&#233;s dans une optique de traitement automatique et la situe &#224; diff&#233;rents niveaux 
(syntaxique, s&#233;mantique et combinatoire). 
</p>
<p>L&#8217;int&#233;r&#234;t que manifeste L&#8217;Homme pour la description des structures verbales se justifie 
pleinement dans le cadre du TALN, car si les progr&#232;s de l&#8217;extraction terminologique sont 
rapides, les probl&#232;mes que pose le traitement automatique du groupe verbal, notamment dans 
le cas de la traduction assist&#233;e par ordinateur, rendent cette formalisation indispensable. La 
description des collocations verbales en langue de sp&#233;cialit&#233; comporte cependant un certain 
nombre d&#8217;&#233;cueils. Le premier est la faible fr&#233;quence des formes verbales relativement aux 
groupes nominaux, qui implique l&#8217;utilisation de corpus de tr&#232;s grande taille si l&#8217;on souhaite 
atteindre la significativit&#233; statistique. Le second est la n&#233;cessit&#233; du recours &#224; un corpus arbor&#233; 
ou &#224; une analyse syntaxique pour la d&#233;tection de l&#8217;ensemble des structures faisant intervenir 
des syntagmes pr&#233;positionnels, la longueur des groupes nominaux objets n&#8217;assurant pas une 
proximit&#233; suffisante entre ces syntagmes pr&#233;positionnels et les verbes dont ils d&#233;pendent pour 
qu&#8217;une simple recherche de cooccurrents donne des r&#233;sultats fiables. 
</p>
<p>                                                 
1  Bourigault et Jacquemin (2000), soulignent la relative facilit&#233; de cette extraction dans une langue comme 
</p>
<p>l&#8217;anglais, qui construit ses termes complexes essentiellement par juxtaposition d&#8217;unit&#233;s lexicales pleines, 
alors que le fran&#231;ais use abondamment des pr&#233;positions et des d&#233;terminants, ph&#233;nom&#232;ne qui rend la 
distinction entre terme et syntagme libre plus difficile &#224; saisir par les outils automatiques. 
</p>
<p>346 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Distinguer les termes des collocations : &#233;tude sur corpus du patron &lt;Adjectif &#8211; Nom&gt; 
</p>
<p>2 L&#8217;acquisition automatique de collocations 
</p>
<p>Le rep&#233;rage de combinaisons lexicales correspondant &#224; un patron syntaxique donn&#233; est 
particuli&#232;rement adapt&#233; &#224; l'outil informatique, puisque celui-ci est d'une grande puissance 
pour la g&#233;n&#233;ration de collocations tir&#233;es de textes num&#233;ris&#233;s. Le probl&#232;me de l&#8217;automatisation 
du tri entre termes et collocations est l&#8217;une des difficult&#233;s rencontr&#233;es par les programmes 
d&#8217;extraction terminologique, pour lesquels des suites comme aspects observ&#233;s ou 
augmentation localis&#233;e font partie du bruit &#224; &#233;liminer. Nous allons tenter de d&#233;crire un 
mod&#232;le inverse, visant &#224; op&#233;rer l&#8217;extraction des seules collocations. Clas (1994) sugg&#232;re un 
classement des collocations lexicales en divers groupes bas&#233;s sur une fonction syntagmatique 
qui int&#232;gre les six cat&#233;gories suivantes (p. 578) : 
</p>
<p>1. verbe et nom, o&#249; le verbe a un contenu s&#233;mantique tr&#232;s g&#233;n&#233;ral proche simplement de 
&#171; faire &#187; (prononcer un discours) ; 
</p>
<p>2. nom et adjectif (rude &#233;preuve, marque distinctive) ; 
</p>
<p>3. adverbe et adjectif (vachement bon) ; 
</p>
<p>4. verbe et adverbe (boire goul&#251;ment) 
</p>
<p>5. nom (sujet) et verbe (la cloche sonne, le chat miaule, l&#8217;abeille bourdonne) ; 
</p>
<p>6. marquage de la quantit&#233; (unit&#233; ou collectif) du nom (essaim d&#8217;abeilles, troupeau de 
vaches, pinc&#233;e de sel, barre de chocolat). 
</p>
<p>Les exemples donn&#233;s ici correspondent &#224; des degr&#233;s de figement et de lexicalisation divers, et 
les restrictions s&#8217;appliquant &#224; certaines des cat&#233;gories d&#233;finies par Clas pourraient &#234;tre 
&#233;largies2. Par ailleurs, les associations d&#233;crites dans le cadre des quatre premi&#232;res cat&#233;gories 
semblent constituer un choix de combinatoire lexicale possible parmi d&#8217;autres, alors que 
celles des cat&#233;gories 5 et 6 ne peuvent s&#8217;accommoder de variations (le marquage de la 
quantit&#233; fait d&#8217;ailleurs l&#8217;objet d&#8217;explications et d&#8217;exercices dans la plupart des grammaires de 
l&#8217;anglais). La Figure 1 repr&#233;sente un sch&#233;ma combinatoire des diff&#233;rentes cat&#233;gories morpho-
syntaxiques, &#233;tabli &#224; partir des cat&#233;gories d&#233;crites plus haut. 
</p>
<p>          NOM  
</p>
<p>VERBE   ADJECTIF 
</p>
<p>             ADVERBE 
</p>
<p>Figure 1 : Combinatoire collocationnelle des cat&#233;gories morpho-syntaxiques.  
</p>
<p>                                                 
2  Par exemple, faut-il n&#233;cessairement limiter les collocations de la premi&#232;re cat&#233;gorie &#224; celles qui comprennent 
</p>
<p>un verbe support ? Dans le cas des collocations anglaises set / beat (ou break) / hold a record (&#233;tablir / battre 
/ d&#233;tenir un record), cela reviendrait &#224; n&#8217;accepter que la premi&#232;re et pas les autres dans cette cat&#233;gorie. 
</p>
<p>347 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maniez Fran&#231;ois 
</p>
<p>3 Outils informatiques utilis&#233;s et extraction des combinaisons 
&lt;Adjectif-Nom&gt; 
</p>
<p>Nous avons utilis&#233; pour tester notre technique d&#8217;extraction un corpus constitu&#233; de 58 articles 
du Journal of the American Medical Association. La longueur totale du corpus est de 134 000 
mots. Le calcul de l&#8217;indice de probabilit&#233; de cooccurrence des collocants a &#233;t&#233; effectu&#233; &#224; 
l&#8217;aide du logiciel Tact3. Nous avons test&#233; une m&#233;thode d&#8217;extraction correspondant &#224; l&#8217;un des 
deux acc&#232;s possibles aux collocations &lt;Adjectif &#8211; Nom&gt; en anglais selon la Figure 1, celle 
qui utilise comme point de d&#233;part les cooccurrents des adverbes (l&#8217;ordre suivi est alors 
Adverbe &#198; Adjectif &#198; Nom). Apr&#232;s avoir &#233;valu&#233; divers programmes d'&#233;tiquetage 
automatique, nous avons soumis notre corpus &#224; un &#233;tiquetage morpho-syntaxique selon les 
normes du corpus LOB (Lancaster-Oslo/Bergen)4. 
</p>
<p>La technique utilis&#233;e pour l&#8217;isolation des collocations des termes complexes repose sur une 
caract&#233;ristique connue des adjectifs relationnels, qui rentrent fr&#233;quemment dans la 
composition des termes de patron syntaxique &lt;Adjectif &#8211; Nom&gt;. Daille (2001) fait remarquer 
qu&#8217;outre les crit&#232;res de rep&#233;rage purement morphologiques, telle la pr&#233;sence majoritaire de 
certains suffixes de d&#233;rivation, on peut &#233;galement utiliser certaines caract&#233;ristiques 
syntaxiques ou s&#233;mantiques des adjectifs relationnels, par exemple le fait qu&#8217;ils ne sont pas 
combinables avec certains adverbes, en particulier les adverbes de degr&#233; (on ne dit pas *une 
production tr&#232;s laiti&#232;re). Nous avons donc tent&#233; de rep&#233;rer automatiquement les seuls 
adjectifs modifi&#233;s par des adverbes dans notre corpus, puis d&#8217;extraire les noms entrant en 
cooccurrence avec ces adjectifs, cette m&#233;thode ayant pour but d&#8217;&#233;liminer les combinaisons 
contenant des adjectifs relationnels tels que coronary ou pericardial, qui constituent le plus 
souvent des termes de la langue m&#233;dicale. 
</p>
<p>Nous avons donc isol&#233; les 1057 combinaisons &lt;Adverbe &#8211; Adjectif&gt; de notre corpus m&#233;dical. 
Apr&#232;s &#233;limination manuelle des suites contenant certains adjectifs relationnels (atherogenic, 
bactericidal, hyperinsulinemic, metastatic, occlusive, oral, vascular), de celles dont les 
adverbes ne modifiaient pas l&#8217;adjectif qu&#8217;ils pr&#233;c&#233;daient (therefore, still, thus, likewise, 
perhaps, also, once, enough, prior), et de celles contenant des adverbes pouvant pr&#233;c&#233;der des 
adjectifs relationnels5, il restait 869 occurrences d&#8217;un adjectif pr&#233;c&#233;d&#233; d&#8217;un adverbe6. Ces 
occurrences regroupaient 596 combinaisons distinctes, contenant 342 adjectifs distincts. Nous 
avons ensuite extrait du corpus 3121 occurrences du patron syntaxique &lt;Adjectif &#8211; Nom&gt; qui 
contenaient ces 342 adjectifs et formaient 2034 combinaisons distinctes. 
</p>
<p>Le Tableau 1 donne la liste des 67 s&#233;quences de fr&#233;quence sup&#233;rieure &#224; 6 dans notre corpus. 
La pr&#233;cision de cette m&#233;thode d&#8217;extraction des collocations est bonne, la liste contenant tr&#232;s 
                                                 
3  TACT (Copyright (c) 1989 John Bradley, University of Toronto), logiciel accessible &#224; l&#8217;URL suivante : 
</p>
<p>http://www.chass.utoronto.ca:8080/cch/tact.html 
4  Le projet AMALGAM (d&#233;crit par Atwell et al., 2000) met &#224; la disposition des internautes plusieurs programmes 
</p>
<p>d'&#233;tiquetage grammatical de l'anglais. Il est accessible &#224; l'adresse suivante : http://agora.leeds.ac.uk/amalgam/ 
5 Certains adverbes tels que largely semblent entrer en cooccurrence principalement avec les adjectifs 
</p>
<p>relationnels, dans des contextes tels que Ocular rosacea is largely vascular in its origin ou  The residual 
symptoms are largely cognitive / vegetative. 
</p>
<p>6 Nous avons retenu les deux classes d&#8217;adverbe &#233;tiquet&#233;es RB (correspondant aux adverbes &#224; d&#233;rivation en &#8211;ly) 
et QL (qualifier, contenant les adverbes too, least, very, as, so, more et less). 
</p>
<p>348 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Distinguer les termes des collocations : &#233;tude sur corpus du patron &lt;Adjectif &#8211; Nom&gt; 
</p>
<p>peu de termes complets7 (on rel&#232;ve cependant un certain nombre d&#8217;emplois de l&#8217;adjectif low 
pr&#233;c&#233;dant le premier terme d&#8217;une lexie complexe comme ejection fraction ou compliance 
rate). Quant &#224; son rappel, il est difficile &#224; &#233;valuer sans une exploitation manuelle int&#233;grale du 
corpus. La technique utilis&#233;e fait que le taux de rappel doit logiquement augmenter avec la 
taille du corpus, puisqu&#8217;il suffit d&#8217;une occurrence post-adverbiale d&#8217;un adjectif pour que 
celui-ci soit ajout&#233; &#224; la liste des &#233;ventuels cooccurrents des noms qui servent de base &#224; la 
deuxi&#232;me passe. 
</p>
<p> 
</p>
<p>                                                 
7  L&#8217;&#233;limination totale du bruit est difficile si l&#8217;on souhaite recenser toutes les collocations, car certains 
</p>
<p>adjectifs ont des emplois relationnels sans qu&#8217;ils entrent pour autant exclusivement dans la composition de 
termes. Par exemple, la combinaison la plus fr&#233;quente de notre liste, physical examination, est un terme, 
mais ce n&#8217;est pas n&#233;cessairement le cas de physical findings et de physical diagnosis. 
</p>
<p>Adjectif Nom Freq. 
physical examination 50 
increased risk 23 
clinical trials 22 
clinical probability 19 
predictive value 18 
diagnostic test 17 
relative risk 15 
clinical findings 15 
recent studies 11 
high risk 11 
clinical assessment 11 
toxic effects 10 
physical findings 10 
malignant effusions 10 
increased prevalence 10 
</p>
<p>high levels 10 
diagnostic tests 10 
higher levels 9 
adverse effects 9 
sensitive thromboplastins 8 
lower liver 8 
lower levels 8 
higher risk 8 
early detection 8 
controlled trials 8 
small number 7 
physical diagnosis 7 
lower edge 7 
low probability 7 
clinical presentation 7 
antimicrobial therapy 7 
</p>
<p>Tableau 1 : Combinaisons lexicales &lt;Adjectif &#8211; Nom&gt; dont l&#8217;adjectif entre en co-occurrence 
avec les adverbes du corpus m&#233;dical. 
</p>
<p>4 Conclusion 
</p>
<p>L&#8217;exploitation d&#8217;un corpus &#233;tiquet&#233; morpho-syntaxiquement permet des regroupements des 
ph&#233;nom&#232;nes de cooccurrence par patrons syntaxiques qui peuvent s&#8217;av&#233;rer utiles dans la 
d&#233;marche consistant &#224; s&#233;parer les candidats termes des &#171; candidats collocations &#187;, en 
particulier dans le cas des structures faisant intervenir la pr&#233;modification adjectivale du nom. 
La m&#233;thode que nous avons test&#233;e obtient une pr&#233;cision correcte, mais demande &#224; &#234;tre test&#233;e 
sur un corpus de taille sup&#233;rieure. L&#8217;am&#233;lioration de son rappel peut &#234;tre envisag&#233;e &#224; partir 
d&#8217;une liste de cooccurrents correspondant au patron syntaxique &lt;Adjectif &#8211; Nom&gt; n&#8217;ayant pas 
fait l&#8217;objet d&#8217;une s&#233;lection pr&#233;alable. La distinction entre termes et collocations de la langue 
sp&#233;cialis&#233;e reste parfois difficile &#224; op&#233;rer, et n&#233;cessite &#224; un stade ult&#233;rieur la prise en compte 
de traits s&#233;mantiques r&#233;glementant la combinatoire des noms et des adjectifs. Dans cette 
</p>
<p>349 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maniez Fran&#231;ois 
</p>
<p>optique, l&#8217;acc&#232;s &#224; la liste des candidats termes rejet&#233;s par les linguistes et les sp&#233;cialistes du 
domaine &#224; l&#8217;issue du processus de validation terminologique lors d&#8217;&#233;tudes ant&#233;rieures pourrait 
s&#8217;av&#233;rer pr&#233;cieux. 
</p>
<p>R&#233;f&#233;rences 
Atwell E. et al. (2000), &quot;A comparative evaluation of modern English corpus grammatical annotation 
schemes&quot; in ICAME Journal N&#176; 24, pp 7-23. 
</p>
<p>Bourigault  D., Jacquemin  C. (2000), Construction de ressources terminologiques, In J. PIERREL, 
Ed., Ing&#233;nierie des langues, Chapitre 9. Herm&#232;s. 
</p>
<p>Clas  A. (1994), &#171; Collocations et langues de sp&#233;cialit&#233; &#187;, in Meta, XXXIX, 4, pp. 576-580. 
</p>
<p>Daille  B. (2001), &#8220;Qualitative terminology extraction: Identifying relational adjectives&#8221; in Bourigault  
D., Jacquemin  C., L'Homme  M.-C., (eds) Recent advances in computational terminology, John 
Benjamins Publishing Company, Amsterdam, pp 149-166. 
</p>
<p>Fellbaum  C. (ed.) (1998), WordNet: An Electronic Lexical Database. MIT Press. 
</p>
<p>Gaussier  E. (2001), &#8220;General considerations on bilingual terminology extraction&#8221; in Bourigault  D., 
Jacquemin  C., L'Homme  M.-C., (eds) Recent advances in computational terminology, John 
Benjamins Publishing Company, Amsterdam, pp 167-184 
</p>
<p>Langlois L. et Plamondon P.(1998), &quot;Le r&#233;p&#233;rage automatique de collocations &#233;quivalentes &#224; partir de 
bitextes&quot; In Fontenelle  T., Hiligsmann P., Michiels A., Moulin A., Theissen S. (eds), Euralex'98: 
Proceedings of the Eighth Euralex International Congress Li&#232;ge, Universit&#233; de Li&#232;ge, pp 175-186.) 
</p>
<p>L&#8217;Homme  M.C. (1998), &#171; D&#233;finition du statut du verbe en langue de sp&#233;cialit&#233; et sa description 
lexicographique. &#187; Cahiers de lexicologie 73 (2), pp. 61-84. 
</p>
<p>Maniez  F. (1999), &#171; The use of electronic corpora and lexical frequency data in solving translation 
problems &#187;, in Altenberg  B. &amp; Granger S. (eds), Lexis in Contrast, Amsterdam, John Benjamins, 
2001. 
</p>
<p>Maniez  F. (2001), &#171; D&#233;sambigu&#239;sation syntaxique des groupes nominaux en langue sp&#233;cialis&#233;e : le 
cas des adjectifs en anglais. &#187; Actes du colloque TALN de Tours, 2-5 juillet 2001, Tome 1, pp. 273-
282. 
</p>
<p>Mel&#8217;cuk  I. (1984), Dictionnaire explicatif et combinatoire du fran&#231;ais contemporain, Montr&#233;al, Les 
Presses de l'Universit&#233; de Montr&#233;al. 
</p>
<p>Williams  G. (1998), &#8220;Collocational Networks : Interlocking Patterns of Lexis in a Corpus of Plant 
Biology Research Articles&#8221;. International Journal of Corpus Linguistics. Vol 3/1, pp. 151-171. 
</p>
<p>350 </p>

</div></div>
</body></html>