<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Les analyseurs syntaxiques : atouts pour une analyse des questions dans un syst&#232;me de question-r&#233;ponse ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Les analyseurs syntaxiques :  
atouts pour une analyse des questions  
</p>
<p>dans un syst&#232;me de question-r&#233;ponse  ? 
</p>
<p>Laura Monceaux, Isabelle Robba 
</p>
<p>LIMSI / CNRS  &#8211; Universit&#233; Paris XI 
Bat 508,  91403 Orsay Cedex 
</p>
<p>{Laura.Monceaux, Isabelle.Robba}@limsi.fr  
 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
</p>
<p>Cet article montre que pour une application telle qu&#8217;un syst&#232;me de question &#8211; r&#233;ponse, une 
analyse par mots cl&#233;s de la question est insuffisante et qu&#8217;une analyse plus d&#233;taill&#233;e passant 
par une analyse syntaxique permet de fournir des caract&#233;ristiques permettant une meilleure 
recherche de la r&#233;ponse.  
 
In this paper, we show that in a question-answer application, a light parsing using only 
keywords is not sufficient. A syntactico-semantic parsing of the question must be used and 
must be completed with some others characteristics, which will a best search for the good 
answer. 
</p>
<p>Mots Cl&#233;s &#8211; Keywords 
</p>
<p>Analyse syntaxique de questions, connaissances s&#233;mantiques, d&#233;tection du focus 
Syntactico-semantic parsing of questions, semantic knowledge, focus detection 
</p>
<p>1 Introduction 
</p>
<p>Pour le syst&#232;me de question-r&#233;ponse QALC (Ferret et al., 2001), que nous mettons au point 
au LIMSI dans le groupe LIR, le module d&#8217;analyse des questions est un module essentiel, car 
il a pour r&#244;le de d&#233;terminer avec pr&#233;cision les caract&#233;ristiques qui permettent de guider 
finement la recherche de la bonne r&#233;ponse. Dans cet article, nous exposons tout d&#8217;abord un 
exemple o&#249; nous soulignons toute l&#8217;importance d&#8217;une analyse syntaxique et s&#233;mantique de la 
question (&#167; 2). Puis nous pr&#233;sentons les diff&#233;rentes cat&#233;gories d&#8217;analyseurs robustes qui 
existent aujourd&#8217;hui (&#167; 3), et nous montrons &#224; travers quelques exemples les probl&#232;mes que 
peut poser leur utilisation (&#167; 4). Finalement (&#167; 5), nous d&#233;crivons en d&#233;tails le fonctionnement 
de notre module d&#8217;analyse de la question en d&#233;finissant les caract&#233;ristiques qui sont calcul&#233;es 
par ce module (focus, type attendu de la r&#233;ponse), et en indiquant en quoi elles peuvent 
contribuer &#224; une meilleure recherche de la r&#233;ponse.  
</p>
<p>195 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laura Monceaux et Isabelle Robba 
</p>
<p> 
</p>
<p>2 D&#8217;une analyse par mots cl&#233;s &#224; une analyse syntaxico-
s&#233;mantique des questions 
</p>
<p>Dans un syst&#232;me de question-r&#233;ponse, le module d&#8217;analyse des questions a pour r&#244;le de 
fournir aux autres modules des informations afin de leur faciliter la s&#233;lection des phrases 
candidates et d&#8217;en extraire la r&#233;ponse. G&#233;n&#233;ralement, ce module d&#8217;analyse de la question 
retourne deux types d&#8217;information : 
 
</p>
<p>&#8226; Le type attendu de la r&#233;ponse sous forme d&#8217;entit&#233; nomm&#233;e : une Personne, un 
Nombre, un Lieu &#8230; 
</p>
<p>&#8226; Les termes les plus importants de la question : ceux qui devraient id&#233;alement se 
trouver dans la r&#233;ponse. 
</p>
<p> 
Cependant, apr&#232;s l&#8217;&#233;tude des r&#233;sultats obtenus par notre syst&#232;me QALC &#224; TREC-9, il s&#8217;est 
av&#233;r&#233; que la d&#233;tection seule des termes importants de la question ne suffisait pas toujours 
pour s&#233;lectionner les phrases contenant la bonne r&#233;ponse. Et que pour s&#233;lectionner celles-ci, 
les relations entre les mots, syntaxiques voire s&#233;mantiques, jouaient un r&#244;le primordial. 
Lorsque le domaine d&#8217;application, dans lequel on travaille, est ouvert, une analyse par mots 
cl&#233;s est g&#233;n&#233;ralement insuffisante. Prenons l&#8217;exemple issu de TREC-9 (figure 1), si une 
analyse par mots cl&#233;s est utilis&#233;e, le syst&#232;me s&#233;lectionnera indiff&#233;remment les deux phrases 
candidates pour extraire la r&#233;ponse. En revanche si le syst&#232;me utilise une analyse plus 
d&#233;taill&#233;e, c&#8217;est-&#224;-dire tenant compte des relations entre les mots, seule la premi&#232;re phrase sera 
s&#233;lectionn&#233;e. En effet, le module d&#8217;analyse d&#233;termine, dans ce cas, que l&#8217;on cherche une 
personne et que celle-ci doit avoir les caract&#233;ristiques suivantes : &#234;tre astronaute, &#234;tre de 
nationalit&#233; russe et &#234;tre la premi&#232;re &#224; avoir fait un voyage dans l&#8217;espace. Ainsi, si ces 
&#233;l&#233;ments sont pris en compte, la deuxi&#232;me phrase candidate est rejet&#233;e par le syst&#232;me &#224; cause 
de l&#8217;adjectif US du groupe nominal the first US woman,  en effet des connaissances 
s&#233;mantiques et pragmatiques peuvent &#234;tre utilis&#233;es pour d&#233;tecter que les deux adjectifs US 
et Russian sont contradictoires. La prise en compte des liens entre les mots permet donc de 
rejeter des phrases candidates : celles contenant des liens contradictoires par rapport aux liens 
exprim&#233;s dans la question. 
   
Question : &#8220; What was the name of the first Russian astronaut to do a spacewalk?&#8221; 
Phrase candidate n&#176;1 : The broad - shouldered but paunchy Leonov, who in 1965 became the first man to 
walk in space, signed autographs. He drew a dove beside his name for Amanda Clark, 8, of Altadena and pinned 
on his lapel a Russian-language button from a well-wisher reading &#171; Let us &#8230; 
Phrase candidate n&#176;2 : Sullivan was the first US woman to perform a spacewalk as she and fellow crewman 
David Leetsma demonstrated satellite refueling &#8230; 
</p>
<p>Figure 1 :  Phrases candidates pour une question donn&#233;e 
</p>
<p>Pour obtenir des connaissances sur les liens entre les mots, la premi&#232;re &#233;tape consiste &#224; 
utiliser un analyseur syntaxique. En effet celui-ci permet d&#8217;obtenir, dans un premier temps, un 
d&#233;coupage en groupes syntaxiques de la phrase : d&#233;tection des groupes nominaux (NP), des 
groupes pr&#233;positionnels (PP) &#8230; mais il peut &#233;galement parfois identifier des relations 
syntaxiques de d&#233;pendance entre ces diff&#233;rents groupes de mots ou directement entre les mots 
de la phrase comme les relations Sujet, Objet, Rattachement pr&#233;positionnel (voir la figure 2). 
</p>
<p>196 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les analyseurs syntaxiques : atouts pour une analyse des questions 
</p>
<p>Les r&#233;sultats de l&#8217;analyse syntaxique vont nous permettre de compl&#233;ter les informations 
obtenues par le module d&#8217;analyse de la question pour une meilleure s&#233;lection de la r&#233;ponse.  
 
Question: &#8220; What was the name of the first Russian astronaut to do a spacewalk?&#8221; 
Segmentation: [SC [NP What NP] : v was SC] [NP the name NP] [PP of the first Russian astronaut PP] [IV to 
do IV] [NP a spacewalk NP] ? 
Relations de d&#233;pendance: SUBJECT (what, was), ADJECTIVE (first, astronaut), ADJECTIVE (Russian, 
astronaut), etc. 
</p>
<p>Figure 2 :   R&#233;sultats de l&#8217;analyse syntaxique d&#8217;une question  
</p>
<p>Les r&#233;sultats obtenus par l&#8217;analyseur syntaxique peuvent &#233;galement &#234;tre utilis&#233;s pour faciliter 
l&#8217;extraction de la r&#233;ponse dans les phrases candidates. En effet, l&#8217;analyse de la question nous 
donne parfois des indices sur la fonction syntaxique de la r&#233;ponse attendue. Prenons 
l&#8217;exemple de la figure 3 (tir&#233; de Hovy 2001), les informations obtenues par l&#8217;analyse 
syntaxique de la question Who killed Lee Harvey Oswald? permettent non seulement de 
d&#233;terminer le type attendu de la r&#233;ponse : une Personne, mais &#233;galement de savoir que la 
personne cherch&#233;e est l&#8217;agent (qui est souvent le sujet) du verbe  kill  (ou un synonyme de 
celui-ci) et que l&#8217;objet de ce verbe doit &#234;tre Oswald. Cela permet donc de d&#233;terminer qu&#8217;ici la 
r&#233;ponse est Jack Ruby et non pas  J. F. Kennedy. 
  
</p>
<p>Question : &#8220; Who killed Lee Harvey Oswald ? &#8221;  
Analyse syntaxique de la question : Subject (who, kill) Object (kill, Oswald) &#198; Answer&#8217;s Function = Subject 
 
R&#233;ponse : &#8220;Jack Ruby, who killed J.F Kennedy assassin Lee Harvey Oswald&#8221;  
Analyse syntaxique de la r&#233;ponse : Subject (Ruby, kill), Object (kill Oswald), Noun-Modifier (assassin, 
Oswald), Noun-Modifier (Kennedy, assassin), etc. 
</p>
<p>Figure 3 :  Utilisation des relations de d&#233;pendances pour l&#8217;extraction de la bonne r&#233;ponse 
</p>
<p>L&#8217;analyse de la question n&#233;cessite donc des connaissances  syntaxiques et s&#233;mantiques et 
passe par une premi&#232;re &#233;tape qui est l&#8217;analyse syntaxique de la question. Ainsi, notre premier 
objectif est de choisir quel type d&#8217;analyseur est le mieux adapt&#233; pour une telle application et 
surtout dans un premier temps quel type d&#8217;analyseur syntaxique. 
</p>
<p>3 Les analyseurs syntaxiques robustes 
</p>
<p>Depuis quelques ann&#233;es, les analyseurs syntaxiques ont connu un important d&#233;veloppement. 
Alors que les premiers analyseurs avaient &#233;t&#233; d&#233;velopp&#233;s dans le but de reconna&#238;tre des 
ph&#233;nom&#232;nes linguistiques dans les diff&#233;rentes phrases &#233;tudi&#233;es, aujourd&#8217;hui les analyseurs 
syntaxiques sont dits plus &#171; r&#233;alistes &#187;, dans le sens o&#249; ils s&#8217;attaquent &#224; l&#8217;analyse de corpus 
r&#233;els, c&#8217;est-&#224;-dire qui peuvent contenir des phrases agrammaticales mais aussi des 
ph&#233;nom&#232;nes sp&#233;cifiques comme des marques d&#8217;h&#233;sitations (issues de dialogues), des liens 
HTML, des tags XML&#8230; La priorit&#233; de ces nouveaux analyseurs est donc la robustesse, d&#8217;o&#249; 
leur appellation d&#8217;analyseurs robustes. La robustesse est la capacit&#233; de retourner une analyse 
syntaxique (m&#234;me minimale) pour tout type d&#8217;entr&#233;es. Ces analyseurs robustes sont 
d&#233;terministes, incr&#233;mentaux et se diff&#233;rencient par les r&#233;sultats qu&#8217;ils 
retournent (segmentation minimale voire plus complexe et parfois d&#233;tection de relations 
syntaxiques) et par les heuristiques qu&#8217;ils utilisent pour extraire l&#8217;analyse la plus probable. 
Cependant, certains analyseurs peuvent produire plusieurs solutions, c&#8217;est par exemple le cas 
lors d&#8217;ambigu&#239;t&#233; dans les rattachements pr&#233;positionnels.  
</p>
<p>197 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laura Monceaux et Isabelle Robba 
</p>
<p> 
Nous pouvons distinguer deux types d&#8217;analyseurs robustes : les analyseurs linguistiques, 
fond&#233;s sur des formalismes grammaticaux, et les analyseurs probabilistes, fond&#233;s sur 
l&#8217;apprentissage &#224; partir de corpus. Dans un premier temps, nous avons choisi d&#8217;&#233;tudier les 
analyseurs linguistiques par rapport aux analyseurs probabilistes, car si ces derniers ont 
l&#8217;avantage d&#8217;&#234;tre entra&#238;n&#233;s sur des corpus, il n&#8217;en reste pas moins qu&#8217;il faut construire ces 
corpus de r&#233;f&#233;rence, et que des questions se posent alors : comment annoter ces corpus, de 
quelle taille doivent&#8211;ils &#234;tre ?  
 
Au d&#233;but de leur d&#233;veloppement, les analyseurs linguistiques se r&#233;partissaient en trois 
cat&#233;gories en fonction des r&#233;sultats qu&#8217;ils produisaient : 
</p>
<p>1. Les analyseurs fond&#233;s sur les constituants (SCOL d&#8217;Abney, 96 &#8211; IPS de Wehrli, 
92&#8230;) qui retournent essentiellement une segmentation en groupes. Dans un premier 
temps, la phrase est segment&#233;e en unit&#233;s lexicales, puis de fa&#231;on incr&#233;mentale en 
constituants. 
</p>
<p> 
2. Les analyseurs fond&#233;s sur les d&#233;pendances (Link Grammar de Sleator et Temperley, 
</p>
<p>91&#8230;) qui retournent les d&#233;pendances entre les mots. Le Link Grammar Parser (LGP 
par la suite) utilise un dictionnaire sp&#233;cifique dans lequel chaque mot correspond &#224; 
une formule logique qui sp&#233;cifie les liens que ce mot peut avoir avec les autres mots. 
Le but de cet analyseur est de construire un &#171; chemin de liens &#187; entre les mots de la 
phrase en respectant certaines propri&#233;t&#233;s : les liens entre les mots ne doivent pas se 
croiser et l&#8217;ensemble de ces liens doit &#234;tre connexe. 
</p>
<p> 
3. Les analyseurs fond&#233;s sur les constituants et les d&#233;pendances (IFSP d&#8217;A&#239;t-Mokthar et 
</p>
<p>Chanod 97 d&#233;velopp&#233; chez Xerox &#8211; Vergne, 97&#8230;) qui retournent une segmentation 
en groupes et des relations de d&#233;pendances entre ces groupes. Ces analyseurs ne sont 
pas monotones : certaines d&#233;cisions peuvent &#234;tre affin&#233;es ou remises en cause. 
Diff&#233;rentes strat&#233;gies sont utilis&#233;es, mais g&#233;n&#233;ralement ces analyseurs cherchent &#224; 
obtenir, dans un premier temps, une segmentation minimale de la phrase et des 
relations syntaxiques simples (comme le sujet) puis des informations plus complexes 
sur la segmentation et sur des relations syntaxiques plus d&#233;licates &#224; trouver.  
</p>
<p> 
Aujourd&#8217;hui la plupart des analyseurs robustes peuvent fournir la segmentation de la phrase et 
certaines relations de d&#233;pendances. Mais ce en quoi ils diff&#232;rent est le format de leurs 
r&#233;sultats et surtout les processus mis en &#339;uvre pour obtenir ces r&#233;sultats. Afin de choisir quel 
type d&#8217;analyseur est le plus ad&#233;quat pour notre application, nous avons &#233;tudi&#233; les analyseurs 
cit&#233;s ci-dessus sur un corpus de questions. 
</p>
<p>4 Les analyseurs robustes sont-ils adapt&#233;s au traitement des 
questions ? 
</p>
<p>Pour la conf&#233;rence d&#8217;&#233;valuation TREC-10, nous avons choisi d&#8217;utiliser l&#8217;analyseur IFSP pour 
notre module d&#8217;analyse de la question. Comme la plupart des analyseurs robustes, IFSP a &#233;t&#233; 
d&#233;velopp&#233; essentiellement pour des applications manipulant de grandes bases de donn&#233;es 
textuelles comme la recherche d&#8217;informations ou l&#8217;extraction terminologique. Et de ce fait, 
comme les autres analyseurs robustes, il n&#8217;est pas particuli&#232;rement adapt&#233; pour analyser des 
formes interrogatives.  
</p>
<p>198 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les analyseurs syntaxiques : atouts pour une analyse des questions 
</p>
<p>4.1 Exemples de probl&#232;mes rencontr&#233;s lors de l&#8217;analyse des questions 
</p>
<p>Dans les exemples suivants, nous pr&#233;sentons certaines formes syntaxiques de questions pour 
lesquelles l&#8217;analyse r&#233;alis&#233;e par IFSP est erron&#233;e et nous comparons cette analyse avec les 
r&#233;sultats obtenus par d&#8217;autres analyseurs. Pour une question de temps, mais aussi de 
complexit&#233;, nous n&#8217;avons pas &#233;labor&#233; une &#233;valuation approfondie sur tout le corpus1 de 
questions de TREC. Cette &#233;tude d&#8217;exemples a &#233;t&#233; faite &#224; partir d&#8217;erreurs d&#8217;analyse d&#8217;IFSP, il 
n&#8217;est donc pas surprenant que les r&#233;sultats, compar&#233;s &#224; ceux des autres analyseurs, 
n&#8217;apparaissent pas comme &#233;tant les meilleurs. Voici quelques exemples d&#8217;erreurs :  
 
</p>
<p>&#8226; Le verbe reconnu comme un nom : 
Dans l&#8217;exemple What year did the Titanic sink?, les quatre analyseurs test&#233;s (IFSP, IPS, LGP 
et SCOL) commettent la m&#234;me erreur : ils reconnaissent sink comme un nom alors qu&#8217;il s&#8217;agit 
ici d&#8217;un verbe. Mais dans l&#8217;exemple Why does the moon turn orange?,  seul LGP ne se 
trompe pas et reconna&#238;t bien turn comme un verbe. 
 
</p>
<p>&#8226; Le superlatif reconnu comme un nom : 
Dans l&#8217;exemple What metal has the highest melting point?, seul IFSP produit une analyse 
erron&#233;e : il segmente la phrase en 3 groupes de mots (un pour highest, un autre pour melting 
et un dernier pour point). 
 
</p>
<p>&#8226; L&#8217;adjectif reconnu comme un nom :  
Dans l&#8217;exemple Who is the Prime Minister of Canada?, l&#8217;utilisation d&#8217;une majuscule pour 
l&#8217;adjectif Prime entra&#238;ne une erreur pour IFSP et SCOL : l&#8217;adjectif n&#8217;est pas reconnu et le 
groupe nominal Prime Minister est segment&#233; en deux groupes nominaux distincts (un pour 
Prime, un autre pour Minister). 
 
Pour cette raison, notre module d&#8217;analyse de la question doit rattraper les erreurs provenant de 
l&#8217;analyse syntaxique, ce qui a &#233;t&#233; fait dans une certaine mesure par l&#8217;&#233;criture de r&#232;gles 
sp&#233;cifiques. Par exemple, concernant la premi&#232;re erreur &#8211; le verbe reconnu comme un nom &#8211; 
nous avons &#233;crit la r&#232;gle suivante : 
 
</p>
<p>Si la forme de la phrase est What/Why/When &#8230; auxiliary NP?,  
et si aucun verbe autre que l&#8217;auxiliaire n&#8217;a &#233;t&#233; reconnu  
alors le verbe est probablement le dernier &#233;l&#233;ment du NP 
</p>
<p> 
</p>
<p>Cette r&#232;gle a pu &#234;tre appliqu&#233;e &#224; un certain nombre de formes telles que : What year did [NP 
the Titanic sink NP] ?, When did [NP the Hindenberg crash NP] ?, mais elle s&#8217;est aussi 
parfois r&#233;v&#233;l&#233;e inefficace comme dans le cas de  Why does [NP the moon turn orange NP]? 
pour lequel une &#233;tude plus approfondie permettra d&#8217;&#233;crire de nouvelles r&#232;gles. 
 
Malgr&#233; ces exemples, IFSP pr&#233;sente un atout important : il retourne toute l&#8217;information 
n&#233;cessaire sans que l&#8217;on ait besoin de modifier ou d&#8217;ajouter de nouvelles connaissances ou de 
nouveaux processus. En effet, IFSP retourne d&#8217;une part la segmentation en constituants, et 
d&#8217;autre part des relations syntaxiques entre les termes, alors que IPS, SCOL ou LGP 
retournent une structure unique, dans laquelle les relations de d&#233;pendances ne sont pas 
</p>
<p>                                                 
1 Au LIMSI, dans le groupe LIR, un projet sur l&#8217;&#233;valuation des analyseurs syntaxiques (Gendner et al, 02) pour 
le fran&#231;ais est actuellement en cours de d&#233;veloppement et une partie du corpus retenu est constitu&#233; de 500 
formes interrogatives.  
</p>
<p>199 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laura Monceaux et Isabelle Robba 
</p>
<p>&#233;tiquet&#233;es. Certes, il est possible d&#8217;obtenir de SCOL ou de LGP l&#8217;&#233;tiquetage de ces relations, 
mais cela demande un travail de modification, c&#8217;est pourquoi dans une premi&#232;re approche, 
IFSP convenait mieux. 
</p>
<p>4.2 Vers une meilleure analyse syntaxique 
</p>
<p>Dans la mesure o&#249; les r&#233;sultats obtenus par notre module d&#8217;analyse des questions sont 
satisfaisants (les r&#233;sultats sont pr&#233;sent&#233;s &#167; 5.4), nous pourrions choisir de continuer dans la 
voie choisie jusqu&#8217;&#224; pr&#233;sent et donc de compl&#233;ter les r&#232;gles qui permettent le rattrapage des 
erreurs provenant de l&#8217;analyse. D&#8217;autant plus, que chez Xerox, XIP, un nouvel analyseur est 
aujourd&#8217;hui disponible pour le fran&#231;ais et est en cours de d&#233;veloppement pour l&#8217;anglais. XIP 
devrait &#234;tre plus performant que IFSP, notamment pour traiter les formes interrogatives. Mais 
d&#8217;autres solutions peuvent aussi &#234;tre &#233;tudi&#233;es : 
 
</p>
<p>&#8226; Modification des analyseurs syntaxiques  
Une possibilit&#233; est de choisir un analyseur pour lequel il est facile et rapide d&#8217;&#233;crire les r&#232;gles 
syntaxiques n&#233;cessaires &#224; l&#8217;analyse de formes interrogatives. SCOL, par exemple, a 
l&#8217;avantage d&#8217;avoir une grammaire facilement modifiable. De plus, les erreurs d&#8217;analyse 
peuvent parfois &#234;tre dues &#224; un mauvais &#233;tiquetage morpho-syntaxique. C&#8217;est en effet le cas du 
Tree Tagger qui ne reconna&#238;t pas par exemple turn ou die comme des verbes dans les phrases 
suivantes : Why does the moon turn orange? How did Janice Joplin die?. Dans l&#8217;analyseur 
SCOL, le marquage morpho-syntaxique n&#8217;est pas int&#233;gr&#233; dans le processus d&#8217;analyse, aussi il 
est possible de s&#233;parer les tests et de localiser les modules qui posent probl&#232;me.  
 
</p>
<p>&#8226; Utilisation d&#8217;un analyseur par apprentissage  
Contrairement &#224; notre premier choix, nous pouvons adopter la solution d&#8217;un analyseur 
probabiliste. Il faudra alors l&#8217;entra&#238;ner sur un corpus annot&#233; de formes interrogatives, celles 
de TREC (1300 tournures sont disponibles), mais &#233;galement d&#8217;autres que l&#8217;on extraira 
d&#8217;Internet &#8211; qui a pour int&#233;r&#234;t de proposer un &#233;chantillon tr&#232;s large de questions non 
artificielles. Pour leur syst&#232;me Webclopedia, Hovy et al. (2001) ont entra&#238;n&#233; leur analyseur, 
CONTEXT, sur environ 1150 questions obtenant ainsi une pr&#233;cision et un rappel de 89 %. 
 
</p>
<p>&#8226; D&#233;veloppement d&#8217;un analyseur int&#233;gr&#233; 
Nous pouvons aussi envisager une toute nouvelle approche consistant en l&#8217;&#233;laboration d&#8217;un 
processus complet, int&#233;grant &#224; la fois l&#8217;analyse de la question et l&#8217;extraction des informations 
qui sont sp&#233;cifiques &#224; la t&#226;che de question-r&#233;ponse (type de la question, focus de la 
question&#8230; voir &#167; 5). Il faut aussi noter que la r&#233;solution de la r&#233;f&#233;rence pourrait &#234;tre r&#233;alis&#233;e 
dans ce m&#234;me module. En effet dans la derni&#232;re session de TREC, une nouvelle t&#226;che a &#233;t&#233; 
propos&#233;e : la t&#226;che Contexte. Les syst&#232;mes qui participaient &#224; cette t&#226;che devaient identifier 
les objets du discours &#224; travers une s&#233;rie de questions comme : Which museum in Florence 
was damaged by a major bomb explosion in 1993? On what day did this happen? Which 
galleries were involved ?. Pour mener &#224; bien cette t&#226;che, les syst&#232;mes ont &#224; r&#233;soudre de 
nouveaux probl&#232;mes : les expressions r&#233;f&#233;rentielles doivent &#234;tre r&#233;solues &#8211; this r&#233;f&#232;re &#224; 
explosion &#8211;  et les relations entre les objets du discours doivent &#234;tre &#233;tablies &#8211;  comme la 
relation partie-de qui existe entre galleries et museum.  
 
Dans le but de participer &#224; la t&#226;che Contexte, la derni&#232;re solution, celle qui envisage le 
d&#233;veloppement d&#8217;un module d&#8217;analyse int&#233;gr&#233;, nous para&#238;t &#234;tre celle &#224; adopter m&#234;me si elle 
est probablement plus complexe &#224; mettre en &#339;uvre. 
</p>
<p>200 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les analyseurs syntaxiques : atouts pour une analyse des questions 
</p>
<p>5 Analyse d&#8217;une question en langage naturel 
</p>
<p>Pour la conf&#233;rence d&#8217;&#233;valuation TREC-10, l&#8217;analyse de la question est r&#233;alis&#233;e, comme nous 
l&#8217;avons vu, dans le but d&#8217;extraire les caract&#233;ristiques de la question qui sont utilis&#233;es dans le 
module de recherche de la r&#233;ponse. Gr&#226;ce aux r&#233;sultats obtenus par l&#8217;analyseur syntaxique, le 
module d&#8217;analyse de la question retourne plusieurs informations : 
 
</p>
<p>1. Le type de la question, auquel on peut associer une liste de patterns qui permettent 
une meilleure extraction de la r&#233;ponse.  
</p>
<p> 
</p>
<p>2. Le type attendu de la r&#233;ponse qui peut &#234;tre une entit&#233; nomm&#233;e ou un type s&#233;mantique 
plus g&#233;n&#233;ral qui permet de mieux localiser la r&#233;ponse dans les phrases candidates.  
</p>
<p> 
</p>
<p>3. Le focus de la question qui permet d&#8217;&#233;tablir des crit&#232;res pour la s&#233;lection des phrases 
candidates et qui aide &#224; l&#8217;extraction de la r&#233;ponse.  
</p>
<p>5.1 Type de la question 
</p>
<p>La d&#233;tection du type de la question &#8211; qui correspond &#224; sa forme syntaxique &#8211; donne un indice 
pour localiser la r&#233;ponse dans les phrases candidates, en effet &#224; chaque type de question 
correspond un ensemble de patterns de r&#233;ponse (Ferret et al., 2001). Cette d&#233;tection permet 
aussi l&#8217;extraction des autres caract&#233;ristiques de la question. Apr&#232;s avoir &#233;tudi&#233; les questions 
de TREC-8 et TREC-9 accompagn&#233;es de leurs r&#233;ponses, nous avons d&#233;termin&#233; 82 formes 
syntaxiques de question plus ou moins d&#233;taill&#233;es comme WhatbeGNofGN, HowADJ,  
WhatGNbeGN&#8230; qui nous permettent de classifier toutes les questions &#233;tudi&#233;es pour une 
meilleure s&#233;lection des autres caract&#233;ristiques de la question.   
 
Dans les autres syst&#232;mes de question-r&#233;ponse, la d&#233;termination du type de la question est plus 
ou moins complexe : par exemple dans le syst&#232;me d&#8217;Oracle (Alpha et al., 2001), le type 
correspond seulement &#224; un pronom interrogatif (who, where, &#8230;), alors que Soubbotin et al. 
(2001) utilisent un ensemble d&#8217;environ 35 types. La d&#233;termination plus ou moins complexe 
du type de la question d&#233;pend essentiellement de l&#8217;utilisation qui en est faite dans les autres 
modules.  
</p>
<p>5.2 Type attendu de la r&#233;ponse 
</p>
<p>Notre module d&#8217;analyse des questions assigne &#224; chaque question un type attendu de la 
r&#233;ponse, qui peut &#234;tre une entit&#233; nomm&#233;e ou un type s&#233;mantique plus g&#233;n&#233;ral.  
</p>
<p>5.2.1 Type Entit&#233; nomm&#233;e 
Dans un premier temps, le module cherche si le type attendu de la r&#233;ponse correspond &#224; une 
ou plusieurs entit&#233;s nomm&#233;es ; s&#8217;il y en a plusieurs, celles-ci sont class&#233;es par ordre 
d&#8217;importance. Les entit&#233;s nomm&#233;es sont organis&#233;es en une hi&#233;rarchie qui contient 22 classes 
s&#233;mantiques (Ferret et al, 2001) telles que Personne, Organisation, Ville, Date, Poids, 
P&#233;riode, Dur&#233;e&#8230;, nombre qui nous parait suffisant pour une bonne extraction de la r&#233;ponse 
sous forme d&#8217;entit&#233; nomm&#233;e. Dans ce but, des lexiques2 ont &#233;t&#233; construits &#224; l&#8217;aide de la base 
                                                 
2  Des lexiques de locutions sont &#233;galement necessaires. Par exemple les locutions life span et life expectancy  
doivent &#234;tre ins&#233;r&#233;es dans un lexique associ&#233; &#224; l&#8217;entit&#233;e nomm&#233;e Dur&#233;e, pour permettre de traiter des questions 
telles que What is the average life span for a chicken? et What is the life expectancy of a dollar bill? 
</p>
<p>201 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laura Monceaux et Isabelle Robba 
</p>
<p>lexicale WordNet (Fellbaum, 1998) : chacun de ces lexiques correspond &#224; une liste de mots 
qui caract&#233;rise une entit&#233; nomm&#233;e. Par exemple, le lexique LOCATION-CITY contient les 
mots suivants : capital, town, city, municipality&#8230;     
 
</p>
<p>La d&#233;tection des entit&#233;s nomm&#233;es a &#233;t&#233; r&#233;alis&#233;e gr&#226;ce &#224; l&#8217;&#233;criture de diff&#233;rentes r&#232;gles. Les 
conditions de ces r&#232;gles portent sur la structure syntaxique de la question et/ou l&#8217;appartenance 
d&#8217;un terme d&#233;fini &#224; un des lexiques d&#8217;entit&#233;s nomm&#233;es. 
</p>
<p> 
REGLE 1:  
</p>
<p>Si Forme syntaxique de la question = WhatBeGN1ofGN2? 
et la t&#234;te du GN1 appartient &#224; un des lexiques de EN 
Alors Entit&#233; Nomm&#233;e = EN qui correspond au lexique EN trouv&#233; 
 
</p>
<p>Par exemple, la question What is the capital of Bahamas? a pour forme syntaxique 
WhatBeGN1ofGN2 ? (condition de la r&#232;gle 1), son groupe nominal GN1 est the capital et son 
groupe nominal GN2 est Bahamas. La t&#234;te de GN1 capital appartient au lexique 
LOCATION-CITY, donc le type attendu de la r&#233;ponse &#224; cette question est LOCATION-
CITY. Quand aucune entit&#233; nomm&#233;e ne peut &#234;tre trouv&#233;e &#224; partir de la question, le module 
d&#8217;analyse de la question tente de d&#233;duire un type s&#233;mantique plus g&#233;n&#233;ral. 
</p>
<p>5.2.2 Type s&#233;mantique plus g&#233;n&#233;ral  
Le type g&#233;n&#233;ral que nous d&#233;finissons correspond &#224; un type s&#233;mantique appartenant &#224; la base 
lexicale WordNet. Quand un type g&#233;n&#233;ral est d&#233;fini par notre syst&#232;me, la r&#233;ponse doit &#234;tre un 
nom ou un groupe nominal, hyponyme de ce type. Pour obtenir ce type plus g&#233;n&#233;ral, nous 
avons &#233;crit des r&#232;gles qui utilisent la forme syntaxique de la question, par exemple : 
</p>
<p> 
REGLE 2: 
</p>
<p>Si Forme syntaxique de la question = WhatGN1haveGN2?  
Alors  Type de la r&#233;ponse  = Tete du GN1 
 
</p>
<p>Pour l&#8217;exemple suivant What metal has the highest melting point?, la r&#232;gle 2 peut &#234;tre 
appliqu&#233;e car la forme syntaxique de cette question correspond &#224; celle de la condition de cette 
r&#232;gle ; et l&#8217;on obtient metal pour type attendu de la r&#233;ponse. Ces diff&#233;rentes r&#232;gles ont &#233;t&#233; 
&#233;crites, apr&#232;s avoir &#233;tudi&#233; les questions de TREC-8 et TREC-9 ainsi que leurs r&#233;ponses. Cette 
&#233;tude nous a permis de d&#233;tecter des tournures sp&#233;cifiques de l&#8217;anglais telle que What city&#8217;s 
newspaper is called the Enquirer? o&#249; la pr&#233;sence du possessif implique l&#8217;&#233;criture de r&#232;gles 
suppl&#233;mentaires.    
</p>
<p>5.3 Focus de la question  
</p>
<p>Le focus est un groupe nominal de la question. Celui-ci permet une meilleure s&#233;lection des 
phrases candidates en attribuant un poids plus fort aux phrases qui le contiennent. De plus, il 
permet l&#8217;&#233;criture de patterns de r&#233;ponses qui d&#233;terminent la position de la r&#233;ponse par rapport 
&#224; lui. Nous d&#233;terminons donc pour chaque question : le focus, la t&#234;te du focus (le nom 
principal) et les modificateurs de cette t&#234;te (adjectif, compl&#233;ment&#8230;). Ces diff&#233;rentes 
caract&#233;ristiques sont obtenues &#224; partir d&#8217;un ensemble de r&#232;gles ordonn&#233;es qui utilisent des 
connaissances syntaxiques et s&#233;mantiques d&#233;crites dans notre module, un lexique des mots 
abstraits par exemple. 
</p>
<p> 
Pour la forme syntaxique WhatbeGN1prepGN2? :  
REGLE 3:  Si TETE-GN1 appartient au lexique Abstrait  
                           Alors FOCUS = GN2 et TETE-FOCUS = TETE-GN2  
</p>
<p>202 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les analyseurs syntaxiques : atouts pour une analyse des questions 
</p>
<p>REGLE 4: Si TETE-GN1 appartient aux lexiques Personne ou Organisation 
                           Alors FOCUS = GN1ofGN2 et TETE-FOCUS = TETE-GN1  
REGLE 5: Si TETE-GN1 appartient &#224; un autre lexique d&#8217;entit&#233; nomm&#233;e 
                           Alors  FOCUS = GN2 et TETE-FOCUS = TETE-GN2 
 
</p>
<p>Si la question est What is the abbreviation for Texas?, la condition de la r&#232;gle 3 est respect&#233;e, 
le focus de la question est Texas. En revanche pour la question What is the diameter of a golf 
ball?, la condition de la r&#232;gle 3 n&#8217;est pas respect&#233;e : diameter n&#8217;est pas un mot abstrait, 
cependant il appartient au lexique LENGTH donc la r&#232;gle 5 peut s&#8217;appliquer et le focus 
obtenu est : a golf  ball et la t&#234;te de ce focus : ball.  
Pour trouver si les conditions des r&#232;gles sont respect&#233;es, le syst&#232;me utilise les r&#233;sultats de 
l&#8217;analyseur IFSP avec nos modifications mais aussi des connaissances s&#233;mantiques gr&#226;ce &#224; la 
base lexicale WordNet. Notre syst&#232;me n&#8217;est pas le seul &#224; utiliser la notion de focus 
correspondant &#224; un ou plusieurs termes de la question : Soubbotin (2001), Alpha (2001) ou 
Hovy (2001) l&#8217;utilisent aussi. Mais l&#8217;originalit&#233; de notre approche est dans l&#8217;utilisation des 
relations syntaxiques qui existent entre la t&#234;te du focus et les autres termes de la question. 
</p>
<p>5.4 R&#233;sultats 
</p>
<p>Pour les questions de la conf&#233;rence d&#8217;&#233;valuation TREC-10, notre module d&#8217;analyse a obtenu : 
 
&#8226; Pour le type attendu de la r&#233;ponse : 90,5% d&#8217;entit&#233;s nomm&#233;es correctes et 87 % de 
</p>
<p>types plus g&#233;n&#233;raux eux aussi corrects 
&#8226; Pour l&#8217;identification du focus :  85 % de focus corrects, 89,6 % de t&#234;te de focus 
</p>
<p>corrects 
 
Les erreurs peuvent &#234;tre dues &#224; des lexiques incomplets, &#224; l&#8217;analyse syntaxique ou encore &#224; 
des r&#232;gles incompl&#232;tes ou manquantes.  
 
Il est alors int&#233;ressant d&#8217;&#233;tudier les r&#233;sultats en fonction du type de la question. En effet selon 
le type de la question, la reconnaissance du focus et du type attendu de la r&#233;ponse sont plus ou 
moins difficiles &#224; effectuer. On pourra prendre connaissance de r&#233;sultats plus complets dans 
Hurault-Plantet et Monceaux (2002). De plus, cette &#233;tude du type de la question permet de 
d&#233;tecter des r&#232;gles incompl&#232;tes ou erron&#233;es. Par exemple, pour les questions commen&#231;ant par 
How many, les r&#232;gles permettant la d&#233;tection de l&#8217;entit&#233; nomm&#233;e ne sont pas satisfaisantes, 
car les entit&#233;s nomm&#233;es comme Volume, ou Poids ne sont jamais d&#233;tect&#233;es, l&#8217;entit&#233; nomm&#233;e 
Nombre est toujours retourn&#233;e &#224; leur place ; comme pour la question How many liters in a 
gallon?  
</p>
<p>6 Conclusion 
</p>
<p>Suite &#224; l&#8217;&#233;tude des questions de TREC-8 et TREC-9 accompagn&#233;es de leurs r&#233;ponses, nous 
avons d&#233;termin&#233; qu&#8217;une analyse par mots cl&#233;s &#233;tait insuffisante pour s&#233;lectionner la bonne 
r&#233;ponse. L&#8217;utilisation de connaissances syntaxiques et s&#233;mantiques est alors apparue 
primordiale pour d&#8217;une part une meilleure s&#233;lection des phrases candidates et d&#8217;autre part une 
meilleure extraction de la r&#233;ponse. Dans un premier temps, nous avons donc &#233;tudi&#233; les 
analyseurs syntaxiques robustes : m&#234;me si ces analyseurs ne sont pas forc&#233;ment adapt&#233;s au 
traitement des formes interrogatives, ils apportent des informations essentielles (parfois 
modifiables quand elles sont erron&#233;es) pour notre module d&#8217;analyse. L&#8217;utilisation d&#8217;un 
</p>
<p>203 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laura Monceaux et Isabelle Robba 
</p>
<p>204 
</p>
<p>analyseur syntaxique nous a permis, pour TREC-10, de d&#233;terminer avec pr&#233;cision des 
caract&#233;ristiques telles que le focus et le type attendu de la r&#233;ponse afin de guider plus 
finement la recherche de cette r&#233;ponse.  
</p>
<p>Dans les ann&#233;es &#224; venir, nous envisageons d&#8217;am&#233;liorer notre module d&#8217;analyse par l&#8217;extension 
de la requ&#234;te gr&#226;ce aux autres relations s&#233;mantiques non encore utilis&#233;es de WordNet : la 
synonymie et la m&#233;ronymie. Nous travaillons actuellement sur les connaissances s&#233;mantiques 
voire pragmatiques qui sont n&#233;cessaires en fonction du type de la question. En effet nous 
pensons que certains types de question n&#233;cessitent une analyse plus approfondie : l&#8217;&#233;valuation 
des r&#233;sultats par type de question nous permettra cette &#233;tude. Par exemple, si la question est 
What is the population of New York?; il est pertinent de savoir que la r&#233;ponse est un nombre 
et que celui-ci est de l&#8217;ordre du million plut&#244;t que de la dizaine.   
</p>
<p>R&#233;f&#233;rences 
Abney S. (1996), Partial Parsing via Finite-State Cascades , Journal of Natural Language 
Engineering, Vol. 2, n&#176; 4, pp. 337-344. 
A&#239;t-Mokthar S., Chanod J. (1997), Incremental Finite-State Parsing, Actes de ANLP-97, 
Washington. 
Alpha S., Dixon P., Liao C., Yang C. (2001), Oracle at TREC-10, Actes de la conf&#233;rence 
d&#8217;&#233;valuation TREC-10, Gaithersburg. 
Fellbaum Ch. (ed). (1998) WordNet : An Electronical Database. Cambridge : MIT Press. 
Ferret O., Grau B., Hurault-Plantet M., Illouz G., Monceaux L., Robba I., Vilnat A. (2001), 
Finding an answer based on the recognition of the question focus, Actes de la conf&#233;rence 
TREC-10, Gaithersburg MN. 
Gendner V., Illouz G., Jardino M., Monceaux L., Paroubek P., Robba I., Vilnat A. (2002), A 
Protocol for Evaluating Analyzers of Syntax, LREC2002, Las Palmas, Spain. 
Hovy E., Hermjakob U., Lin C-Y. (2001), The Use of External Knowledge in Factoid QA, 
Actes de la conf&#233;rence d&#8217;&#233;valuation TREC-10, Gaithersburg. 
Hurault-Plantet M., Monceaux L. (2002), Cooperation between black box and glass box 
approaches for the evaluation of a question answering system, LREC2002, Las Palmas, Spain. 
Sleator D.D., Temperley D. (1991), Parsing English with a Link Grammar, Rapport 
technique CMU-CS-91-196, Carnegie Mellon University, School of Computer Science. 
Soubbotin M. M., Soubbotin S. M. (2001), Patterns of Potential Answer Expressions as Clues 
to the Right Answers, Actes de la conf&#233;rence d&#8217;&#233;valuation TREC-10, Gaithersburg. 
Vergne J. (1997) Syntactic analysis of unrestricted french. In proceedings of the International 
Conference on Recent Advances in NLP, RANLP-97, Tzigov Chark, Bulgaria. 
Wehrli E. (1992), The IPS system, Actes de Coling-92, Nantes, C. Boitet (&#233;d), 870-874. </p>

</div></div>
</body></html>