<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Corpus OTG et ECOLE_MASSY : vers la constitution d&#8217;une collection de corpus francophones de dialogue oral diffus&#233;s librement</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Corpus OTG et ECOLE_MASSY :  
vers la constitution d&#8217;une collection de corpus francophones de 
</p>
<p>dialogue oral diffus&#233;s librement 
</p>
<p>Jean-Yves Antoine(1), Sabine Letellier-Zarshenas(1), Pascale Nicolas(1), Igor 
Schadle(1), Jean Caelen(2) 
</p>
<p>(1) VALORIA , Universit&#233; de Bretagne Sud,  
rue Yves Mainguy, F-56 000, France 
</p>
<p> Mel = Jean-Yves.Antoine@univ-ubs.fr 
(2) CLIPS-IMAG , Universit&#233; Joseph Fourier,  
</p>
<p>BP 53, F-38041 Grenoble Cedex 9, France 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Cet article pr&#233;sente deux corpus francophones de dialogue oral (OTG et ECOLE_MASSY) 
mis librement &#224; la disposition de la communaut&#233; scientifique. Ces deux corpus constituent la 
premi&#232;re livraison du projet Parole Publique initi&#233; par le laboratoire VALORIA. Ce projet 
vise la constitution d&#8217;une collection de corpus de dialogue oral enrichis par annotation 
morpho-syntaxique. Ces corpus de dialogue finalis&#233; sont essentiellement destin&#233;s &#224; une 
utilisation en communication homme-machine.. 
 
This paper presents two corpora (OTG et ECOLE_MASSY) of French spoken dialogue which 
are the first delivery of the Parole_Publique (in English : Public Speech) project held by the 
VALORIA laboratory. This project aims at the achievement of a collection of spoken 
dialogue corpora that is freely distributed on the WWW. It is primarily intended for 
researches on man-machine communication. 
</p>
<p> 
</p>
<p>Mots Cl&#233;s &#8212; Keywords 
</p>
<p>ressources linguistiques francophones ; dialogue oral ; communication homme-machine 
 
French speaking linguistic ressources ; spoken dialogue ; man-machine communication. 
</p>
<p>319 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine et al. 
</p>
<p>1 Introduction 
</p>
<p>Le dialogue oral homme-machine (DOHM) a atteint au cours de la derni&#232;re d&#233;cennie un 
degr&#233; de maturit&#233; qui s&#8217;est traduite par le d&#233;veloppement d&#8217;applications commercialis&#233;es. 
Cette r&#233;ussite doit beaucoup &#224; la g&#233;n&#233;ralisation de m&#233;thodes empiriques bas&#233;es sur les 
donn&#233;es (estimation de mod&#232;les stochastiques sur de grands corpus). Les ressources 
linguistiques ont ainsi acquis un r&#244;le central en DOHM comme dans l&#8217;ing&#233;nierie des langues 
en g&#233;n&#233;ral. La repr&#233;sentativit&#233; de ces corpus &#233;tant pour partie fonction de leur taille, on 
observe une tendance g&#233;n&#233;rale &#224; la constitution de ressources linguistiques de plus en plus 
vastes.  
Le d&#233;veloppement de larges ressources linguistiques orales constitue donc un enjeu majeur du 
DOHM. Or, le retard du fran&#231;ais, et plus particuli&#232;rement du fran&#231;ais oral, est consid&#233;rable 
(V&#233;ronis 2000). L&#224; o&#249; le British National Corpus (Leech 1994) comprend plus de 10 millions 
de mots de parole transcrite, on ne peut citer au mieux qu&#8217;un corpus francophone d&#8217;un million 
de mots collect&#233; par le laboratoire DELIC (ex-GARS). Ce corpus n&#8217;est que partiellement 
informatis&#233; et ne concerne gu&#232;re le dialogue oral. De m&#234;me, le corpus r&#233;alis&#233; dans le cadre du 
projet ELICOP (un million de mots) ne semble pas comprendre de dialogues oraux. La 
plupart des corpus francophones de dialogue oral ne sont d&#8217;ailleurs pas distribu&#233;s. 
Dans cet article, nous pr&#233;sentons deux corpus francophones de dialogue oral (OTG et 
ECOLE_MASSY) distribu&#233;s librement. Ces corpus constituent la premi&#232;re livraison du projet 
Parole Publique du laboratoire VALORIA. Ce projet vise la constitution d&#8217;une collection de 
corpus de dialogue oral enrichis par annotation morpho-syntaxique destin&#233;s au DOHM. 
</p>
<p>2 Pr&#233;sentation g&#233;n&#233;rale des corpus 
</p>
<p>Les deux corpus ont &#233;t&#233; constitu&#233;s suivant une m&#233;thodologie commune de transcription et de 
codage d&#233;finie dans le cadre du projet Parole Publique. Dans cette section, nous d&#233;crivons les 
caract&#233;ristiques communes de ces corpus, pour revenir ult&#233;rieurement sur leurs sp&#233;cificit&#233;s. 
</p>
<p>2.1 Corpus pilotes 
</p>
<p>Les corpus OTG et ECOLE_MASSY sont des corpus pilotes de dialogue oral finalis&#233;. Un 
corpus pilote permet le recueil d&#8217;interactions r&#233;elles (dialogue homme-homme) mettant en 
&#233;vidence les ph&#233;nom&#232;nes linguistiques et dialogiques inh&#233;rents naturellement &#224; la t&#226;che 
consid&#233;r&#233;e (Caelen et al. 1997). L&#8217;int&#233;r&#234;t des corpus pilotes en DOHM r&#233;side dans cette 
analyse des usages et des besoins r&#233;els &#8212; voire &#171; id&#233;aux &#187;. Dans la perspective d&#8217;une mise en 
place de bonnes pratiques ing&#233;nieriques, ces analyses devraient &#234;tre utiles &#224; la conception de 
syst&#232;mes de dialogue oral mais aussi &#224; la pr&#233;paration de leur &#233;valuation (crit&#232;res de test). 
</p>
<p>2.2 Contenu des corpus distribu&#233;s 
</p>
<p>Chaque corpus regroupe un ensemble de dialogues. Tout dialogue donne lieu &#224; 
l&#8217;enregistrement d&#8217;un ou plusieurs (enregistrements sur pistes s&#233;par&#233;es) fichiers audio au 
format wav. Chaque dialogue est d&#233;crit par un fichier de transcription et d&#8217;annotation &#224; 
raison. La m&#233;thodologie de transcription et d&#8217;annotation que nous avons suivi reprend les 
normes les plus utilis&#233;es au sein de la communaut&#233; francophone, &#224; savoir : 
 
- conventions de transcription du fran&#231;ais parl&#233; utilis&#233;es par le laboratoire DELIC 
</p>
<p>(Blanche-Benveniste et Jeanjean 1987) et l&#233;g&#232;rement enrichies par certaines 
</p>
<p>320 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Corpus OTG et ECOLE_MASSY 
</p>
<p>recommandations issues du projet SPEECHDAT (Gibbon, Moore et Winski 1997), 
</p>
<p>- syst&#232;me d&#8217;annotation morphosyntaxique d&#233;fini par l&#8217;action GRACE (Adda et al. 1999), 
</p>
<p>- codage au format structur&#233; XML avec utilisation de l&#8217;alphabet Unicode cod&#233; sur 8 bit. 
</p>
<p>La transcription a &#233;t&#233; r&#233;alis&#233;e &#224; l&#8217;aide du logiciel libre Transcriber (Barras et al. 1998) dont 
nous reprenons la DTD XML en format de sortie. L&#8217;annotation morpho-syntaxique de nos 
corpus n&#8217;a pas encore &#233;t&#233; r&#233;alis&#233;e. Elle sera effectu&#233;e &#224; l&#8217;aide du logiciel Cordial Analyseur 
de la soci&#233;t&#233; Synapse avec post-validation par un expert. Les &#233;tudes de (Valli et V&#233;ronis 
1999) ont en effet montr&#233; que ce syst&#232;me, utilis&#233; en &#233;tiqueteur morpho-syntaxique, conservait 
une bonne  robustesse sur de l&#8217;oral spontan&#233;. Au final, les transcriptions sont distribu&#233;es 
suivant deux formats de sortie correspondant &#224; des usages potentiels diff&#233;rents : 
 
- codage XML avec ou sans (figure 1) annotation morpho-syntaxique . 
</p>
<p>- codage en format texte (ASCII) reprenant une structuration en tours de parole avec ou 
sans (figure  2) annotation morpho-syntaxique. On remarquera sur la figure 2 que les 
chevauchements restent repr&#233;sent&#233;s dans ce format. L&#8217;information d&#8217;alignement temporel 
des tours de parole n&#8217;est par contre par reprise ici.  
</p>
<p>Ces corpus peuvent &#234;tre librement r&#233;cup&#233;r&#233;s sur la Toile apr&#232;s signature d&#8217;une convention 
d&#8217;utilisation peu contraignante :  http://www.univ-ubs.fr/valoria/antoine/parole_publique. 
 
&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt; &lt;!DOCTYPE Trans SYSTEM &quot;trans-13.dtd&quot;&gt; 
&lt;Trans scribe=&quot;Nicolas&quot; audio_filename=&quot;1ag0365&quot; version=&quot;1&quot; version_date=&quot;011008&quot;&gt; 
&lt;Speakers&gt; 
&lt;Speaker id=&quot;spk1&quot; name=&quot;h&#244;tesse&quot; check=&quot;no&quot; type=&quot;female&quot; dialect=&quot;native&quot; accent=&quot;&quot; scope=&quot;local&quot;/&gt; 
&lt;Speaker id=&quot;spk2&quot; name=&quot;client&quot; check=&quot;no&quot; type=&quot;female&quot; dialect=&quot;native&quot; accent=&quot;&quot; scope=&quot;local&quot;/&gt; 
&lt;/Speakers&gt; 
&lt;Topics&gt;&lt;Topic id=&quot;to1&quot; desc=&quot;1ag0365&quot;/&gt;&lt;/Topics&gt; 
&lt;Episode&gt; 
&lt;Section type=&quot;report&quot; startTime=&quot;0&quot; endTime=&quot;5.980&quot; topic=&quot;to1&quot;&gt; 
&lt;Turn startTime=&quot;0&quot; endTime=&quot;0.629&quot; speaker=&quot;spk1&quot;&gt; 
&lt;Sync time=&quot;0&quot;/&gt; 
bonjour madame 
&lt;/Turn&gt; 
&lt;Turn speaker=&quot;spk2&quot; startTime=&quot;0.629&quot; endTime=&quot;3.420&quot;&gt; 
&lt;Sync time=&quot;0.629&quot;/&gt; 
bonjour est ce que vous avez le programme de oui e e je  
&lt;/Turn&gt; 
&lt;Turn speaker=&quot;spk1 spk2&quot; startTime=&quot;3.420&quot; endTime=&quot;3.856&quot;&gt; 
&lt;Sync time=&quot;3.420&quot;/&gt; 
&lt;Who nb=&quot;1&quot;/&gt; 
oui 
&lt;Who nb=&quot;2&quot;/&gt; 
connaissances 
&lt;/Turn&gt; 
&lt;Turn speaker=&quot;spk2&quot; startTime=&quot;3.856&quot; endTime=&quot;4.24&quot;&gt; 
&lt;Sync time=&quot;3.856&quot;/&gt; 
du monde 
&lt;/Turn&gt; 
</p>
<p>Figure 1 : Extrait du corpus OTG : transcription sans annotation (format XML)  
</p>
<p>321 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine et al. 
</p>
<p>fichier audio : 1ag0365 
&lt;001&gt; h&#244;tesse 
      h: bonjour madame 
&lt;002&gt; client 
      c: bonjour est ce que vous avez le programme de oui e e je 
&lt;003&gt; h&#244;tesse+client 
      h: oui 
      c: connaissances 
&lt;004&gt; client 
      c: du monde 
</p>
<p>Figure 2 : Extrait du corpus OTG : transcription sans annotation (format texte)  
</p>
<p>3 Corpus OTG (Office du Tourisme de Grenoble) 
Le corpus OTG (Office du Tourisme de Grenoble) a &#233;t&#233; constitu&#233; dans le cadre de l&#8217;ARC 
&#171; Dialogue Oral &#187; de l&#8217;AUF. Il a &#233;t&#233; enregistr&#233; par le laboratoire CLIPS-IMAG et transcrit 
par le VALORIA. Le cadre d&#8217;application &#233;tudi&#233; &#233;tait le renseignement touristique. 
</p>
<p>3.1 Enregistrement 
</p>
<p>Le corpus OTG a &#233;t&#233; enregistr&#233; &#224; la Maison du Tourisme de Grenoble. Les clients et l&#8217;agent 
n&#8217;ont &#233;t&#233; soumis &#224; aucune consigne. La prise de son s&#8217;est effectu&#233;e en conditions r&#233;elles par 
deux microphones directifs orient&#233;s l&#8217;un vers le client (masqu&#233;1) et l&#8217;autre vers l&#8217;agent. Les 
enregistrements ont &#233;t&#233; recueillis sur deux pistes s&#233;par&#233;es par un enregistreur DAT. On 
dispose donc de deux fichiers audio par dialogue. Au total, une s&#233;lection de 5 heures 
d'enregistrements a &#233;t&#233; conserv&#233;e pour la constitution du corpus audio. 
</p>
<p>3.2 Transcription : corpus distribu&#233; 
</p>
<p>Enregistr&#233; en conditions r&#233;elles, ce corpus pr&#233;sente un nombre important de transactions de 
m&#233;diocre qualit&#233; sonore. La transcription de ces dialogues s'est av&#233;r&#233;e difficile voire 
impossible, les transcripteurs ne parvenant pas &#224; s&#8217;accorder sur de nombreux passages. Les 
conventions de transcription du DELIC permettent la repr&#233;sentation de transcriptions 
alternatives. Compte tenu du nombre important de passages conflictuels dans certains 
dialogues, nous n&#8217;avons pas utilis&#233; cette possibilit&#233;. La transcription n&#8217;a ainsi &#233;t&#233; r&#233;alis&#233;e que 
sur des dialogues ne pr&#233;sentant aucune ambigu&#239;t&#233; d&#8217;&#233;coute. Certaines transactions retenues 
correspondaient &#224; des trilogues. Il s&#8217;est alors av&#233;r&#233; difficile de faire une distinction s&#251;re entre 
les productions des deux clients concern&#233;s. Ces dialogues n&#8217;ont donc pas &#233;t&#233; transcrits. 
Au total, 315 dialogues ont &#233;t&#233; transcrits, qui correspondent &#224; 2 heures d'enregistrement. Ce 
corpus a une taille globale &#224; 26 000 mots transcrits (tableau 1). A terme, le corpus atteindra 
une taille critique de 40 000 mots. 
 
Dur&#233;e &lt; 30s 30s &#8211; 1 mn 1 mn &#8211; 2 mn 2 mn-3 mn &gt; 3 mn 
Nbre de dialogues 294 77 36 2 0 
</p>
<p>Tableau 1 : Distribution des dialogues du corpus OTG suivant leur dur&#233;e. 
</p>
<p>                                                 
1  Ce n&#8217;est qu&#8217;&#224; la fin du dialogue que le client &#233;tait inform&#233; de l&#8217;exp&#233;rience. 
</p>
<p>322 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Corpus OTG et ECOLE_MASSY 
</p>
<p>4 Corpus ECOLE_MASSY 
</p>
<p>Le corpus ECOLE_MASSY a &#233;t&#233; enregistr&#233; et transcrit par le laboratoire VALORIA. Le 
cadre d&#8217;application relevait &#233;galement du renseignement touristique sur une t&#226;che plus 
pr&#233;cise : la planification d&#8217;activit&#233;s de loisirs. Ce corpus r&#233;pond &#224; une motivation scientifique 
sp&#233;cifique : l&#8217;&#233;tude diff&#233;rentielle des usages linguistique suivant le type d&#8217;utilisateur. La 
population &#233;tudi&#233;e ici &#233;tait de jeunes enfants de sept ans. De part ses motivations, ce corpus 
n&#8217;est pas directement utilisable pour la conception d&#8217;un syst&#232;me classique de dialogue adulte-
machine. Il int&#233;ressera surtout linguistes et chercheurs en sciences de l&#8217;&#233;ducation. 
L&#8217;adaptation des syst&#232;mes de dialogue oral &#224; des publics sp&#233;cifiques (personnes &#226;g&#233;es, 
handicap&#233;s, enfants&#8230;) repr&#233;sentera cependant une probl&#233;matique importante dans les ann&#233;es 
&#224; venir. Elle n&#233;cessitera alors le recours &#224; des observations sur des corpus tels que celui-ci.      
</p>
<p>4.1 Enregistrement 
</p>
<p>Le corpus ECOLE_MASSY a &#233;t&#233; enregistr&#233; en conditions r&#233;elles dans une classe de CE1 
d&#8217;une &#233;cole primaire de Massy. Les consignes fournies aux enfants concernaient uniquement 
l&#8217;objectif de la transaction : recherche d&#8217;une s&#233;ance de cin&#233;ma, puis planification libre de 
loisirs sur la r&#233;gion parisienne dans un second temps. A l&#8217;oppos&#233;, l&#8217;enseignant, qui jouait le 
r&#244;le de l&#8217;agent, avait pour consigne de simuler un dialogue relativement directif. Afin de 
garantir une certaine naturalit&#233;, les transactions se sont faites sur les possibilit&#233;s r&#233;elles de 
loisirs offertes au moment de l&#8217;enregistrement. A la demande de l&#8217;enseignant, les 
enregistrements ont &#233;t&#233; r&#233;alis&#233;s en l&#8217;absence d&#8217;op&#233;rateur de notre laboratoire. Aussi : 
 
- la prise de son a &#233;t&#233; effectu&#233;e sur un magn&#233;tophone sans enregistrement sur pistes 
</p>
<p>s&#233;par&#233;es (un fichier audio par dialogue),  
</p>
<p>- les productions des enfants, qui faisaient face &#224; leur enseignant, se sont traduites par une 
certaine perte de spontan&#233;it&#233;. Elles refl&#232;tent une adaptation langagi&#232;re qui peut &#234;tre 
rapproch&#233;e d&#8217;une forme de dialogue homme-machine (Sp&#233;randio et L&#233;tang-Fogeac 
1986).  
</p>
<p>La couverture s&#233;mantique du domaine par les enfants est rest&#233;e tr&#232;s libre, sans jamais sortir 
du p&#233;rim&#232;tre d&#233;fini par les consignes. Elle est donc repr&#233;sentative de la t&#226;che et pourrait &#234;tre 
compar&#233;e &#224; celle d&#8217;usagers adultes. Le corpus comprend 45 minutes d&#8217;enregistrement. 
</p>
<p>4.2 Transcription : corpus distribu&#233; 
</p>
<p>Contrairement au corpus OTG, l&#8217;int&#233;gralit&#233; du corpus ECOLE_MASSY a &#233;t&#233; transcrite. Elle 
regroupe 31 dialogues (tableau 2) correspondant &#224; environ 5 300 mots transcrits. 
 
Dur&#233;e &lt; 30s 30s &#8211; 1 mn 1 mn &#8211; 2 mn 2 mn-3 mn &gt; 3 mn 
Nbre de dialogues 2 6 16 7 0 
</p>
<p>Tableau 2 : Distribution des dialogues du corpus ECOLE_MASSY suivant leur dur&#233;e. 
</p>
<p>Une premi&#232;re analyse du corpus montre un taux tr&#232;s faible de chevauchements. Nous sommes 
donc en pr&#233;sence d&#8217;une parole plus contr&#244;l&#233;e que spontan&#233;e, qu&#8217;il serait int&#233;ressant de 
comparer aux genres oraux tels que ceux d&#233;finis par (Biber 1988). 
</p>
<p>323 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine et al. 
</p>
<p>324 
</p>
<p>5 Conclusion : le projet PAROLE PUBLIQUE 
</p>
<p>A eux seuls, ces deux corpus repr&#233;sentent une ressource linguistique relativement limit&#233;e. Ce 
travail ne prend tout son sens que dans le cadre du projet Parole Publique de collection d&#8217;un 
ensemble de corpus oraux restreints au seul champ du DOHM. Ce projet concernera : 
 
- diff&#233;rents types de dialogue (corpus pilotes, magiciens d&#8217;Oz, dialogue H-M r&#233;el) pouvant 
</p>
<p>&#234;tre utilis&#233;s &#224; diff&#233;rents stades de d&#233;veloppement des syst&#232;mes de dialogue oral. 
</p>
<p>- diff&#233;rents domaines d&#8217;application (renseignement touristique ou administratif, r&#233;servation 
h&#244;teli&#232;re, portail vocal) afin de r&#233;pondre &#224; l&#8217;importante question de la g&#233;n&#233;ricit&#233; des 
recherches en dialogue oral homme-machine. 
</p>
<p>- diff&#233;rents types d&#8217;usagers : personnes &#226;g&#233;es, enfants ou adolescents, handicap&#233;s&#8230; 
</p>
<p>La constitution de ce corpus d&#233;pendra des ressources budg&#233;taires de notre laboratoire. Cet 
effort demande donc &#224; &#234;tre poursuivi et relay&#233; dans d&#8217;autres laboratoires francophones. Aussi, 
un des objectifs de ce projet est-il de favoriser, par cette premi&#232;re diffusion libre de corpus, la 
constitution de larges ressources linguistiques francophones accessibles librement. La mise en 
place du projet ASILA (www.loria.fr/projets/asila/) &#8212; auquel contribue notre laboratoire par 
l&#8217;interm&#233;diaire de la distribution de ces deux corpus &#8212; constitue une initiative prometteuse 
de ce point de vue. 
</p>
<p>Remerciements 
</p>
<p>Le travail pr&#233;sent&#233; dans cet article a &#233;t&#233; partiellement financ&#233; par l&#8217;AUF dans le cadre de 
l&#8217;ARC &#171; Dialogue Oral &#187;, ainsi que par une bourse doctorale de la R&#233;gion Bretagne. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Adda G. et al. (1999), L&#8217;action GRACE d&#8217;&#233;valuation de l&#8217;assignation des parties du discours 
pour le fran&#231;ais, Langues 2(1), pp. 119-129. 
Barras C. et al. (1998), Transcriber : a free tool for segmenting, labeling and transcribing 
speech, Actes de LREC&#8217;98, Grenade, Espagne, pp. 1373-1376. 
Biber D. (1988), Variation across speech and writing, Cambridge, Cambridge Univ. Press. 
C. Blanche-Benveniste, C. Jeanjean (1987), Le fran&#231;ais parl&#233;, Paris,  Didier Erudition. 
Caelen J. et al. (1997), Les corpus pour l&#8217;&#233;valuation du dialogue homme-machine.  Actes de 
JST&#8217;97 FRANCIL, Avignon, France, pp. 215-222. 
Gibbon D., Moore R., Winski R. (Eds.) (1997) Handbook of standards and ressources for 
spoken language systems, Berlin, Mouton de Gruyter, pp. 825-834. 
Leech G. (1994), 100 million words of English : the British National Corpus, English Today, 
9(1). pp. 9-15. 
Sp&#233;randio J.-C., L&#233;tang-Figeac C. (1986), Simulation exp&#233;rimentale de dialogues oraux en 
communication homme-machine, rapport technique, GRECO Communication Parl&#233;e, CNRS. 
Valli A., V&#233;ronis J. (1999), Etiquetage grammatical des corpus de parole, Revue Fran&#231;aise de 
de Linguistique Appliqu&#233;e, RFLA, 4(2), pp. 113 :134. 
V&#233;ronis J. (2000), Annotation automatique de corpus, In Pierrel J.-M. (2000), Ing&#233;nierie des 
langues, Paris, Herm&#232;s Sciences., pp. 111-130. </p>

</div></div>
</body></html>