<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Discours et compositionnalit&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Discours et compositionnalit&#233;
</p>
<p>Laurent Roussarie &amp; Pascal Amsili
Talana / Lattice (CNRS UMR 8094) &#8211; Universit&#233; Paris 7
</p>
<p>UFRL &#8211; Case 7003 ; 2, place Jussieu ; 75251 Paris Cedex 05
{roussarie/amsili}@linguist.jussieu.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Analyse du discours, compositionnalit&#233;, &#0;-calcul, SDRT, actes de langage
Discourse analysis, compositionality, &#0;-calculus, SDRT, speech acts
</p>
<p>R&#233;sum&#233; &#8211; Abstract
</p>
<p>Partant du principe que certaines phrases peuvent r&#233;aliser plusieurs actes de langage, i.e., dans
une interface s&#233;mantique&#8211;pragmatique, plusieurs constituants de discours s&#233;par&#233;s, nous propo-
sons, dans le cadre de la SDRT, un algorithme de construction de repr&#233;sentations s&#233;mantiques
qui prend en compte tous les aspects discursifs d&#232;s que possible et de fa&#231;on compositionnelle.
</p>
<p>Assuming that some sentences realise several speech acts, and that, in a semantic&#8211;pragmatic
interface, they yield separate discourse constituents, we propose an algorithm, in the SDRT fra-
mework, which takes into account all discursive aspects as soon as possible and compositionaly.
</p>
<p>1 Introduction
</p>
<p>Depuis environ deux d&#233;cennies, de nombreux travaux sur l&#8217;analyse (et la g&#233;n&#233;ration) de discours
ont converg&#233; vers l&#8217;id&#233;e que la structure et la coh&#233;rence d&#8217;un texte pouvaient &#234;tre mod&#233;lis&#233;es au
moyen de relations rh&#233;toriques (Hobbs, 1979; Grosz &amp; Sidner, 1986; Mann &amp; Thompson, 1988;
Asher, 1993). Ces relations constituent un outillage pr&#233;cieux qui permet d&#8217;envisager l&#8217;objet lin-
guistique qu&#8217;est le discours sous diff&#233;rents angles : (i) elles fondent une &#171; super-syntaxe &#187; qui
hi&#233;rarchise le texte en connectant et regroupant les phrases ; (ii) elles produisent un compl&#233;ment
non compositionnel &#224; la s&#233;mantique de la phrase en r&#233;v&#233;lant les &#171; non-dits &#187; qui sous-tendent
la coh&#233;rence du texte ; (iii) elles &#233;tablissent un mod&#232;le pragmatique pour repr&#233;senter les organi-
sations argumentatives et/ou intentionnelles qui charpentent un discours.
</p>
<p>Cette polyvalence a rendu l&#8217;appareillage rh&#233;torique (au mieux) puissant, mais aussi souvent sur-
productif et th&#233;oriquement vague. Ainsi, les relations rh&#233;toriques (RR), vues au d&#233;part comme
des liens implicites entre des phrases formant un discours, ont &#233;t&#233; naturellement associ&#233;es &#224; des
connecteurs (mais, donc...), puis &#224; des subordonnants ou coordonnants (parce que, car...), voire
</p>
<p>383</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurent Roussarie, Pascal Amsili
</p>
<p>&#224; la relation entre pos&#233; et pr&#233;suppos&#233; (Asher &amp; Lascarides, 1998). Il d&#233;coule naturellement de
ce mouvement deux questions. D&#8217;une part, celle de la nature exacte des &#171; arguments &#187; des RR.
On a d&#233;j&#224; soulign&#233; ailleurs (Roussarie, 1998) l&#8217;absence de consensus solide et motiv&#233; quant au
statut th&#233;orique de ces arguments. On peut n&#233;anmoins d&#233;gager une position pragmatique qui
postule que les RR connectent des buts communicatifs (Moore &amp; Paris, 1993) et/ou des actes
de langage (Asher &amp; Lascarides, 1998). D&#8217;autre part, il faut admettre que certains &#233;l&#233;ments
lexicaux ou constructions syntaxiques (connecteurs, subordonnants, mais aussi d&#233;clencheurs de
pr&#233;suppositions...) ont une contribution &#224; la fois compositionnelle et discursive. Les RR font en
quelque sorte double jeu avec la composition syntactico-s&#233;mantique classique1. Se pose alors
la question de l&#8217;articulation de ces deux aspects.
</p>
<p>L&#8217;objet de cet article est d&#8217;&#233;tendre &#8212; dans des limites raisonnables &#8212; le principe de composi-
tionnalit&#233; au niveau de l&#8217;interface s&#233;mantique-pragmatique, notamment dans un cadre descriptif
o&#249; la notion de relation rh&#233;torique est pertinente. A cet &#233;gard, nous choisissons de nous placer
dans le cadre de la Th&#233;orie des Repr&#233;sentations de Discours Segment&#233;es (Segmented Discourse
Representation Theory ou SDRT, (Asher, 1993; Asher &amp; Lascarides, 1998)) car c&#8217;est un forma-
lisme pour l&#8217;interpr&#233;tation du discours issu de la s&#233;mantique dynamique compositionnelle qui
vise la mod&#233;lisation rigoureuse des interactions entre s&#233;mantique et pragmatique.
Il a &#233;t&#233; montr&#233; que l&#8217;analyse rh&#233;torique du discours n&#8217;est pas compositionnelle et qu&#8217;elle s&#8217;ap-
puie sur une logique de raisonnement non monotone (r&#233;visable). C&#8217;est pour cette raison que
la cha&#238;ne de traitement distingue deux &#233;tapes, l&#8217;une, compositionnelle, qui construit la repr&#233;-
sentation de chaque phrase, l&#8217;autre, non monotone, qui int&#232;gre cette repr&#233;sentation dans la re-
pr&#233;sentation du discours. Ce sch&#233;ma doit cependant &#234;tre r&#233;vis&#233;, d&#232;s lors que l&#8217;on admet que
les RR interviennent &#224; l&#8217;int&#233;rieur des phrases. En effet, dans ce cas, c&#8217;est d&#232;s la premi&#232;re &#233;tape
que la segmentation en unit&#233;s discursives peut et doit &#234;tre faite. Elle se fait alors sur la base de
propri&#233;t&#233;s lexicales et syntaxiques des &#233;l&#233;ments en jeu (connecteurs, d&#233;clencheurs de pr&#233;suppo-
sition...). Autrement dit, le d&#233;coupage est guid&#233; par l&#8217;analyse grammaticale (compositionnelle)
de la phrase. Ce que ne nous dit pas la grammaire, c&#8217;est comment ces unit&#233;s discursives se
connectent dans le discours : cette op&#233;ration d&#233;pend du contexte et de connaissances extra-
linguistiques, c&#8217;est l&#8217;affaire du m&#233;canisme de mise &#224; jour de la repr&#233;sentation du discours (mo-
dule non monotone). Mais la grammaire peut nous dire quelles parties de la phrase donnent
lieu &#224; des actes de langage individualis&#233;s pour l&#8217;analyse rh&#233;torique2. Il est donc n&#233;cessaire de
munir le traitement compositionnel de la premi&#232;re &#233;tape des moyens n&#233;cessaires pour fournir
au composant discursif ce dont il a besoin. C&#8217;est l&#8217;objectif que nous nous sommes fix&#233;s, et
dont nous pr&#233;sentons quelques aspects dans cet article. Nous verrons que cela n&#233;cessite de faire
divers choix et aussi de r&#233;soudre quelques probl&#232;mes techniques, que, faute de place, nous ne
pourrons pr&#233;senter en d&#233;tail.
</p>
<p>1Cf. (Mann &amp; Thompson, 1988; de Smedt et al., 1996; Asher &amp; Lascarides, 1998) pour d&#8217;autres exemples.
2Notons &#233;galement que la segmentation en actes de langage n&#8217;est pas la seule op&#233;ration de nature &#171; pr&#233;-
</p>
<p>rh&#233;torique &#187; qui peut &#234;tre d&#233;termin&#233;e par la grammaire. Certains items lexicaux, notamment des connecteurs et
des adverbiaux, indiquent quelle RR permet de rattacher au contexte le constituant analys&#233; (sans pour autant in-
diquer o&#249; dans le contexte le rattachement doit s&#8217;op&#233;rer). Par exemple, mais, cependant, bien que induisent la
relation Contrast ; aussi, de m&#234;me induisent Parallel ; si... alors... induit Condition. Il s&#8217;agit donc l&#224; aussi de cas
o&#249; une partie de l&#8217;analyse rh&#233;torique du discours est d&#233;ductible d&#8217;informations lexico-syntaxiques analysables par
la grammaire de la phrase. Or en SDRT, ces items ne contribuent pas directement et par eux-m&#234;mes &#224; l&#8217;analyse du
contenu s&#233;mantique ; ils sont simplement manipul&#233;s comme des cl&#233;s permettant d&#8217;inf&#233;rer des RR dans le composant
de raisonnement pragmatique non-monotone. Nous pensons qu&#8217;il n&#8217;est pas forc&#233;ment justifi&#233; de &#171; d&#233;poss&#233;der &#187;
ainsi le module de calcul des formes logiques de la contribution propre de certains connecteurs et adverbes. En ce
sens, d&#8217;ailleurs, nous convergeons sur le principe avec la position des travaux de Webber et al. (1999), mais sans
adh&#233;rer &#224; leur vision syntaxique de la repr&#233;sentation du discours.
</p>
<p>384</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Discours et compositionnalit&#233;
</p>
<p>2 Des mots au discours
</p>
<p>La SDRT se pr&#233;sente comme une extension de la DRT (Discourse Representation Theory, (Kamp
&amp; Reyle, 1993)) qui ajoute un niveau de hi&#233;rarchisation suppl&#233;mentaire dans la repr&#233;sentation
du discours au moyen de RR. Le processus d&#8217;analyse (i.e. de construction d&#8217;une repr&#233;sentation)
peut &#234;tre r&#233;sum&#233; de la fa&#231;on suivante : chaque constituant discursif &#171; de base &#187; re&#231;oit une
repr&#233;sentation s&#233;mantique (une DRS, Discourse Representation Structure) par le m&#233;canisme de
DRT compositionnelle ; ensuite, au lieu d&#8217;&#234;tre directement fusionn&#233; dans le contexte comme en
DRT, le constituant est pris en charge par un syst&#232;me de logique non-monotone (glue logic ou
DICE pour Discourse Interpretation in Commonsense Entailment (Asher &amp; Lascarides, 1998))
qui assure la mise &#224; jour (update) de la repr&#233;sentation du discours en inf&#233;rant les RR idoines.
Nous pr&#233;sentons d&#8217;abord bri&#232;vement le principe d&#8217;analyse compositionnelle de la DRT (&#0;-
DRT) telle qu&#8217;elle se d&#233;gage de divers travaux qui ont propos&#233; des algorithmes conciliant les
m&#233;canismes compositionnels montagoviens (&#0;-calcul) et la DRT (Asher, 1993; Bos et al., 1994;
Amsili &amp; Hathout, 1998; Amsili &amp; Bras, 1998; Blackburn &amp; Bos, 1999). Rappelons d&#8217;abord
qu&#8217;une DRS est un couple &#0;&#1;&#2;&#3;&#1;, o&#249; &#1; (l&#8217;univers) est un ensemble de r&#233;f&#233;rents de discours,
et &#3; (les conditions) est un ensemble de conditions. Les conditions sont par exemple de la
forme : &#4;&#0;&#5;
</p>
<p>&#0;
</p>
<p>&#2; &#6; &#6; &#6; &#2; &#5;
</p>
<p>&#0;
</p>
<p>&#1; (pr&#233;dicat &#224; &#7; places sur des r&#233;f&#233;rents), &#2;&#8;
&#0;
</p>
<p>(n&#233;gation d&#8217;une sous-DRS)
ou &#8;
</p>
<p>&#0;
</p>
<p>&#3; &#8;
</p>
<p>&#1;
</p>
<p>(implication de deux sous-DRS), etc. La &#0;-DRT fait correspondre &#224; chaque consti-
tuant de l&#8217;analyse syntaxique une &#0;-expression sur le langage de la DRT, i.e. une &#0;-DRS, cor-
respondant &#224; la contribution s&#233;mantique du constituant. La repr&#233;sentation finale de la phrase
s&#8217;obtient par &#9;-r&#233;ductions successives en combinant les &#0;-DRS suivant l&#8217;ordre syntaxique. &#192;
titre d&#8217;illustration, nous pr&#233;sentons &#224; la figure 1 les &#0;-DRS associ&#233;es &#224; chaque constituant, et
leur &#171; composition &#187; par &#9;-r&#233;ductions pour la phrase &#171; un singe danse &#187;.3
</p>
<p>(a) singe : &#0;&#1;
singe&#0;&#1;&#1; (b) danse : &#0;&#1; danse&#0;&#1;&#1; (c) un : &#0;&#2;&#0;&#3;
</p>
<p>&#4;
</p>
<p>&#0; &#2; &#0;&#4;&#1;&#0;&#3;&#0;&#4;&#1;
</p>
<p>un(singe)(danse) : &#0;&#2;&#0;&#3; &#4; &#0; &#2; &#0;&#4;&#1;&#0;&#3;&#0;&#4;&#1;
&#0;
</p>
<p>&#1;
</p>
<p>&#0;&#1;
</p>
<p>singe&#0;&#1;&#1;
</p>
<p>&#2;
</p>
<p>&#3;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#0;&#1; danse&#0;&#1;&#1;
</p>
<p>&#2;
</p>
<p>&#3;
</p>
<p>&#2;
</p>
<p>&#0;&#3;
</p>
<p>&#4;
</p>
<p>&#0;
</p>
<p>singe&#0;&#4;&#1; &#0;&#3;&#0;&#4;&#1;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#0;&#1; danse&#0;&#1;&#1;
</p>
<p>&#2;
</p>
<p>&#3;
</p>
<p>&#2;
</p>
<p>&#4;
</p>
<p>singe&#0;&#4;&#1; &#0; danse&#0;&#4;&#1; &#2;
&#4;
</p>
<p>singe&#0;&#4;&#1;
danse&#0;&#4;&#1;
</p>
<p>FIG. 1 &#8211; Exemple de &#0;-DRT
</p>
<p>Passons maintenant &#224; la SDRT : la representation d&#8217;une phrase simple est une SDRS qui encap-
sule la DRS associ&#233;e &#224; cette phrase en l&#8217;&#233;tiquetant par un r&#233;f&#233;rent d&#8217;acte de langage. Ainsi, si
une phrase re&#231;oit par &#0;-DRT la DRS &#8;, alors sa SDRS sera de la forme : &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#7;&#2;&#2;
</p>
<p>Notre objectif ici est de permettre &#224; la grammaire de produire directement de telles SDRS de
fa&#231;on compositionnelle. Pour ce faire, il est naturel d&#8217;envisager des &#0;-abstractions sur les mar-
queurs de type &#10;. Mais il est n&#233;cessaire alors de revenir sur la d&#233;finition de l&#8217;op&#233;ration de
fusion, pour r&#233;soudre des difficult&#233;s techniques que la place nous manque dans cet article pour
pr&#233;senter en d&#233;tail.
</p>
<p>Nous reprenons la d&#233;finition propos&#233;e par (Asher, 2000) d&#8217;une SDRS, laquelle s&#8217;appuie sur une
3Comme (Bos et al., 1994; Blackburn &amp; Bos, 1999), nous utilisons un op&#233;rateur &#0; de fusion de DRS dans les
</p>
<p>&#0;-expressions. La d&#233;finition de cet op&#233;rateur est sans surprise : &#1;&#8;&#6;&#9;&#2; &#0; &#1;&#10;&#6;&#11;&#2; &#2; &#1;&#8; &#3; &#10;&#6;&#9; &#3;&#11;&#2;
</p>
<p>385</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurent Roussarie, Pascal Amsili
</p>
<p>macrostructure &#2;, d&#233;finie &#224; partir d&#8217;un vocabulaire constitu&#233; d&#8217;un ensemble &#3; de DRS ; d&#8217;un
ensemble&#4; d&#8217;&#233;tiquettes pour les formes logiques ; et d&#8217;un ensemble&#4; de symboles relationnels
pour les RR :
&#8211; &#3; &#5; &#2; ;
&#8211; si R est une relation &#7;-aire de &#4;, et &#10;
</p>
<p>&#0;
</p>
<p>&#2; &#6; &#6; &#6; &#2; &#10;
</p>
<p>&#0;
</p>
<p>&#6; &#4;, alors R&#0;&#10;
&#0;
</p>
<p>&#2; &#6; &#6; &#6; &#2; &#10;
</p>
<p>&#0;
</p>
<p>&#1; &#6; &#2; ;
&#8211; si &#11;&#2; &#11;&#0; &#6; &#2;&#2; alors &#0;&#11; &#7; &#11;&#0;&#1; &#6; &#2; et &#2;&#11; &#6; &#2;
Alors une SDRS est un couple &#0;&#12;&#2;&#8;&#1;, o&#249; &#12; est un ensemble d&#8217;&#233;tiquettes (&#12; &#9; &#4;) et &#8; est une
fonction de &#12; vers &#2; (&#8; &#5; &#12; &#10;&#11; &#2;). Ainsi, dans la notation standard de la SDRT, la projection
&#8;&#0;&#10;&#1; &#6; &#8; se note par la condition d&#8217;&#233;tiquetage &#10; &#5; &#8;. Et cette d&#233;finition d&#8217;une SDRS impose
que chaque &#233;tiquette &#10; n&#8217;a qu&#8217;une seule image &#8;, puisque &#8; est une fonction. La fusion de
SDRS peut alors &#234;tre d&#233;finie &#224; condition de d&#233;finir la fusion de (certaines) fonctions.
&#12; &#171; Fusion &#187; fonctionnelle, &#0; : Soit &#13; et &#14; deux fonctions de &#12; vers &#15;, alors
&#13; &#0; &#14; &#5;&#12;&#11; &#15;
</p>
<p>&#5; &#13;&#11; &#13; &#0; &#14;&#0;&#5;&#1; &#6; &#13;&#0;&#5;&#1; &#14; &#14;&#0;&#5;&#1;
</p>
<p>o&#249; &#14; est l&#8217;op&#233;rateur de fusion appropri&#233; aux &#233;l&#233;ments de &#15;. Si &#15; est un ensemble d&#8217;ensembles,
alors &#14; &#6; &#15;, si c&#8217;est un ensemble de DRS, alors &#14; &#6; &#16;, si c&#8217;est un ensemble de termes ou de
propositions, alors &#14; &#6; &#7;.
</p>
<p>&#12; Fusion de SDRS, &#17; : &#0;&#12;
&#0;
</p>
<p>&#2;&#8;
</p>
<p>&#0;
</p>
<p>&#1; &#17; &#0;&#12;
</p>
<p>&#1;
</p>
<p>&#2;&#8;
</p>
<p>&#1;
</p>
<p>&#1; &#6; &#0;&#12;
</p>
<p>&#0;
</p>
<p>&#15; &#12;
</p>
<p>&#1;
</p>
<p>&#2;&#8;
</p>
<p>&#0;
</p>
<p>&#0; &#8;
</p>
<p>&#1;
</p>
<p>&#1;
</p>
<p>Nous pouvons &#224; pr&#233;sent d&#233;finir rigoureusement des &#0;-SDRS. Le principe g&#233;n&#233;ral que nous adop-
tons consiste &#224; consid&#233;rer que tout constituant syntaxique du discours sera associ&#233; &#224; une &#171; &#0;-
SDRS &#10;-pr&#233;dicative &#187; : &#0;&#5;&#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#7;&#2;&#2;. C&#8217;est-&#224;-dire que ce constituant contribue au contenu
propositionnel de l&#8217;acte de langage d&#233;sign&#233; par &#10;. La variable &#0;-abstraite &#10; sera satur&#233;e par
un constituant (ou un n&#339;ud de l&#8217;arbre syntaxique) qui pr&#233;cisera le statut illocutoire de l&#8217;acte
en question (assertion, hypoth&#232;se, pr&#233;supposition...). Tout ceci est illustr&#233; &#224; la figure 2, avec
le m&#234;me exemple que pr&#233;c&#233;demment (mais une notation plus compacte, pour des raisons de
place).
</p>
<p>un : &#0;&#2;&#0;&#3;&#0;&#5; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#4;&#2;&#6; &#1;&#2;&#2;&#2;&#2; &#4; &#2; &#0;&#5;&#1;&#0;&#4;&#1;&#4;&#3;&#0;&#5;&#1;&#0;&#4;&#1;
</p>
<p>singe : &#0;&#1;&#0;&#5;
&#0;
</p>
<p>&#1;&#1;&#5;
</p>
<p>&#0;
</p>
<p>&#2;&#6; &#1;&#5;
</p>
<p>&#0;
</p>
<p>&#3; &#1;&#1;&#2;&#6; &#1;singe&#0;&#1;&#1;&#2;&#2;&#2;&#2;
danse : &#0;&#12;&#0;&#5;
</p>
<p>&#1;
</p>
<p>&#1;&#1;&#5;
</p>
<p>&#1;
</p>
<p>&#2;&#6; &#1;&#5;
</p>
<p>&#1;
</p>
<p>&#3; &#1;&#1;&#2;&#6; &#1;danse&#0;&#12;&#1;&#2;&#2;&#2;&#2;
un singe : &#0;&#2;&#0;&#3;&#0;&#5; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#4;&#2;&#6; &#1;&#2;&#2;&#2;&#2; &#4; &#2; &#0;&#5;&#1;&#0;&#4;&#1;&#4;&#3;&#0;&#5;&#1;&#0;&#4;&#1; &#0;&#0;&#1;&#0;&#5;
</p>
<p>&#0;
</p>
<p>&#1;&#1;&#5;
</p>
<p>&#0;
</p>
<p>&#2;&#6; &#1;&#5;
</p>
<p>&#0;
</p>
<p>&#3; &#1;&#1;&#2;&#6; &#1;singe&#0;&#1;&#1;&#2;&#2;&#2;&#2;&#1; &#2;
&#0;&#3;&#0;&#5; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#4;&#2;&#6; &#1;&#2;&#2;&#2;&#2; &#4; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#2;&#6; &#1;singe&#0;&#4;&#1;&#2;&#2;&#2;&#2; &#4;&#3;&#0;&#5;&#1;&#0;&#4;&#1; &#2;
</p>
<p>&#0;&#3;&#0;&#5; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#4;&#2;&#6; &#1;&#2;&#2; &#0; &#1;&#1;&#2;&#6; &#1;singe&#0;&#4;&#1;&#2;&#2;&#2;&#2; &#4;&#3;&#0;&#5;&#1;&#0;&#4;&#1; &#2;
&#0;&#3;&#0;&#5; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#4;&#2;&#6; &#1;singe&#0;&#4;&#1;&#2;&#2;&#2;&#2; &#4;&#3;&#0;&#5;&#1;&#0;&#4;&#1;
</p>
<p>un singe danse : &#0;&#3;&#0;&#5; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#4;&#2;&#6; &#1;singe&#0;&#4;&#1;&#2;&#2;&#2;&#2; &#4;&#3;&#0;&#5;&#1;&#0;&#4;&#1; &#0;&#0;&#12;&#0;&#5;
&#1;
</p>
<p>&#1;&#1;&#5;
</p>
<p>&#1;
</p>
<p>&#2;&#6; &#1;&#5;
</p>
<p>&#1;
</p>
<p>&#3; &#1;&#1;&#2;&#6; &#1;danse&#0;&#12;&#1;&#2;&#2;&#2;&#2;&#1; &#2;
&#0;&#5; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#4;&#2;&#6; &#1;singe&#0;&#4;&#1;danse&#0;&#4;&#1;&#2;&#2;&#2;&#2;
</p>
<p>FIG. 2 &#8211; Exemple de &#0;-SDRT
</p>
<p>Les probl&#232;mes techniques de mise en &#339;uvre pour passer de la &#0;-DRT &#224; la &#0;-SDRT &#233;tant r&#233;solus,
il nous faut passer &#224; la mise en pratique de ce calcul qui doit donc pouvoir g&#233;rer les cas o&#249;
une m&#234;me phrase engendre plusieurs r&#233;f&#233;rents d&#8217;acte de langage et donc conjointement plu-
sieurs SDRS, sachant que ce &#171; d&#233;coupage pr&#233;-rh&#233;torique &#187; repose sur des informations lexico-
syntaxiques. Nous consid&#233;rons rapidement dans la section suivante divers cas de ce genre.
</p>
<p>386</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Discours et compositionnalit&#233;
</p>
<p>3 Applications
</p>
<p>Le premier cas que nous consid&#233;rons est celui de la pr&#233;supposition, que nous avons d&#233;j&#224; men-
tionn&#233;. Chaque phrase pr&#233;suppositionnelle r&#233;alise un acte d&#8217;assertion principale et un acte de
pr&#233;supposition (au moins). Il faut repr&#233;senter ces diff&#233;rents actes comme autant de SDRS au
cours de la construction, &#224; charge pour le module de mise &#224; jour d&#8217;int&#233;grer ces constituants
dans une repr&#233;sentation du discours. Nous proposons de ranger ces &#233;l&#233;ments dans une structure
que nous nommons T-SDRS (pour Trailer-SDRS). Une T-SDRS est un couple que nous notons
&#0;
</p>
<p>&#8; &#16;
</p>
<p>&#1;
</p>
<p>o&#249; &#8; est une SDRS et &#16; est un ensemble de SDRS.4 Lorsqu&#8217;une phrase P est repr&#233;sen-
t&#233;e par une T-SDRS
</p>
<p>&#0;
</p>
<p>&#8; &#8;
</p>
<p>&#0;
</p>
<p>&#7;&#8;
</p>
<p>&#1;
</p>
<p>&#7; &#6; &#6; &#6; &#7;&#8;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>cela signifie que&#8; d&#233;crit l&#8217;acte de langage principal
de P (ou la partie assert&#233;e) et &#8;
</p>
<p>&#0;
</p>
<p>&#7;&#8;
</p>
<p>&#1;
</p>
<p>&#7; &#6; &#6; &#6; &#7;&#8;
</p>
<p>&#0;
</p>
<p>sont les pr&#233;suppos&#233;s de P.
</p>
<p>Nous pouvons &#224; pr&#233;sent proposer une analyse des SN d&#233;finis qui tient compte de leur nature
pr&#233;suppositionnelle, que nous illustrons directement sur un exemple :5
</p>
<p>le : &#0;&#2;&#0;&#3;&#0;&#5; &#4;&#3;&#0;&#5;&#1;&#0;&#4;&#1; &#1;&#1;&#5;&#0;&#2;&#6; &#1;&#5;&#0; &#3; &#1;&#1;&#4;&#2;&#6; &#1;&#2;&#2;&#2;&#2; &#4; &#2; &#0;&#5;&#0;&#1;&#0;&#4;&#1;&#5;
</p>
<p>le singe : &#0;&#2;&#0;&#3;&#0;&#5; &#4;&#3;&#0;&#5;&#1;&#0;&#4;&#1; &#1;&#1;&#5;&#0;&#2;&#6; &#1;&#5;&#0; &#3; &#1;&#1;&#4;&#2;&#6; &#1;&#2;&#2;&#2;&#2; &#4; &#2; &#0;&#5;&#0;&#1;&#0;&#4;&#1;&#5; &#0;&#0;&#1;&#0;&#5;
&#0;
</p>
<p>&#1;&#1;&#5;
</p>
<p>&#0;
</p>
<p>&#2;&#6; &#1;&#5;
</p>
<p>&#0;
</p>
<p>&#3; &#1;&#1;&#2;&#6; &#1;singe&#0;&#1;&#1;&#2;&#2;&#2;&#2;&#1;
&#2; &#0;&#3;&#0;&#5;
</p>
<p>&#4;
</p>
<p>&#3;&#0;&#5;&#1;&#0;&#4;&#1; &#1;&#1;&#5;
</p>
<p>&#0;
</p>
<p>&#2;&#6; &#1;&#5;
</p>
<p>&#0;
</p>
<p>&#3; &#1;&#1;&#4;&#2;&#6; &#1;singe&#0;&#4;&#1;&#2;&#2;&#2;&#2;
&#5;
</p>
<p>le singe danse : &#0;&#5; &#4;&#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#2;&#6; &#1;danse&#0;&#4;&#1;&#2;&#2;&#2;&#2; &#1;&#1;&#5;&#0;&#2;&#6; &#1;&#5;&#0; &#3; &#1;&#1;&#4;&#2;&#6; &#1;singe&#0;&#4;&#1;&#2;&#2;&#2;&#2;&#5;
</p>
<p>Notre deuxi&#232;me cas d&#8217;application concerne la composition de propositions compl&#233;tives avec
des verbes &#233;pist&#233;miques dont certains sont factifs (pr&#233;suppositionnels) et d&#8217;autres non. Une
proposition compl&#233;tive de la forme que P ne constitue pas en soi un acte de langage. C&#8217;est le
contexte ench&#226;ssant qui lui donnera &#233;ventuellement un tel statut. Cela signifie qu&#8217;une construc-
tion que P correspond, dans la forme logique, simplement au contenu propositionnel exprim&#233;
par P et que le compl&#233;menteur supprime, d&#8217;une certaine mani&#232;re, l&#8217;ench&#226;ssement de la DRS
&#8; qui repr&#233;sente P. Ainsi, si P donne compositionnellement &#0;&#5;&#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#7;&#2;&#2; ; alors que + P
restitue &#8;. En fait, plus exactement, une compl&#233;tive &#233;tant un compl&#233;ment, que + P devra pro-
duire : &#0;&#0;
</p>
<p>&#1;
</p>
<p>&#0;&#10;
</p>
<p>&#1;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#0;&#10;
</p>
<p>&#1;
</p>
<p>&#1;&#0;&#8;&#1;. Obtenir de cette fa&#231;on la DRS d&#8217;une phrase &#224; partir de sa SDRS
&#10;-pr&#233;dicative est une op&#233;ration assez simple si l&#8217;on se souvient qu&#8217;une SDRS est un couple dont
le second membre est une fonction. En notant les SDRS comme suit : &#8; &#6; &#0;&#12;
</p>
<p>&#2;
</p>
<p>&#2;&#8;
</p>
<p>&#2;
</p>
<p>&#1;, alors
le contenu propositionnel (i.e. la DRS principale) de &#8; est &#8;
</p>
<p>&#2;
</p>
<p>&#0;&#10;&#1;. Et de ce fait, l&#8217;entr&#233;e du
compl&#233;menteur que sera :
</p>
<p>que : &#0;&#0;
&#0;
</p>
<p>&#0;&#0;
</p>
<p>&#1;
</p>
<p>&#0;&#10;
</p>
<p>&#1;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#0;&#10;
</p>
<p>&#1;
</p>
<p>&#1;&#0;&#8;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#3;&#1;
</p>
<p>&#0;
</p>
<p>&#4;
</p>
<p>&#0;&#10;
</p>
<p>&#0;
</p>
<p>&#1;&#1;
</p>
<p>Par la suite, le caract&#232;re pr&#233;suppositionnel de savoir vs. croire pourra &#234;tre indiqu&#233; par la gram-
maire au moyen de T-SDRS :
</p>
<p>croire : &#0;&#7;&#0;&#1;&#7;&#0;&#0;&#13;&#0;&#5; &#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#2;&#6; &#1;croire&#0;&#1;&#6; &#13;&#1;&#2;&#2;&#2;&#2;&#1;
</p>
<p>savoir : &#0;&#7;&#0;&#1;&#7;&#0;&#0;&#13;&#0;&#5; &#4;&#1;&#1;&#5;&#2;&#6; &#1;&#5; &#3; &#1;&#1;&#2;&#6; &#1;savoir&#0;&#1;&#6; &#13;&#1;&#2;&#2;&#2;&#2; &#1;&#1;&#5;&#0;&#2;&#6; &#1;&#5;&#0; &#3; &#13;&#2;&#2;&#5;&#1;
</p>
<p>4On peut trouver une inspiration pour cette repr&#233;sentation dans la notion de structured meaning de Krifka, ainsi
que plus directement dans les travaux r&#233;cents de (Kamp, 2001).
</p>
<p>5Il est n&#233;cessaire de d&#233;finir l&#8217;op&#233;ration de fusion d&#233;j&#224; sur cette nouvelle structure :
(a) &#4;&#4; &#4;&#4;
</p>
<p>&#0;
</p>
<p>&#4;
</p>
<p>&#1;
</p>
<p>&#5; &#14; &#14; &#14; &#5; &#4;
</p>
<p>&#0;
</p>
<p>&#5;
</p>
<p>&#2;
</p>
<p>&#4;
</p>
<p>&#0;&#4;&#4;&#4;
</p>
<p>&#0;
</p>
<p>&#1; &#4;
</p>
<p>&#1;
</p>
<p>&#5; &#14; &#14; &#14; &#5; &#4;
</p>
<p>&#0;
</p>
<p>&#5;
</p>
<p>(b) &#4;&#4;
&#0;
</p>
<p>&#4;
</p>
<p>&#1;
</p>
<p>&#5; &#14; &#14; &#14; &#5; &#4;
</p>
<p>&#0;
</p>
<p>&#5;
</p>
<p>&#4;&#4; &#2;
</p>
<p>&#4;
</p>
<p>&#0;&#4;
</p>
<p>&#0;
</p>
<p>&#4;&#4;&#1; &#4;
</p>
<p>&#1;
</p>
<p>&#5; &#14; &#14; &#14; &#5; &#4;
</p>
<p>&#0;
</p>
<p>&#5;
</p>
<p>(c) &#4;&#4;
&#0;
</p>
<p>&#4;
</p>
<p>&#1;
</p>
<p>&#5; &#14; &#14; &#14; &#5; &#4;
</p>
<p>&#0;
</p>
<p>&#5;
</p>
<p>&#4;
</p>
<p>&#4;
</p>
<p>&#4;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#4;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#5; &#14; &#14; &#14; &#5; &#4;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#5;
</p>
<p>&#2;
</p>
<p>&#4;
</p>
<p>&#0;&#4;
</p>
<p>&#0;
</p>
<p>&#4;&#4;
</p>
<p>&#0;
</p>
<p>&#0;
</p>
<p>&#1; &#4;
</p>
<p>&#1;
</p>
<p>&#5; &#14; &#14; &#14; &#5; &#4;
</p>
<p>&#0;
</p>
<p>&#5; &#4;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#5; &#14; &#14; &#14; &#5; &#4;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#5;
</p>
<p>387</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurent Roussarie, Pascal Amsili
</p>
<p>4 Conclusion
</p>
<p>L&#8217;algorithme de construction que nous avons propos&#233; comble le hiatus qui semblait se dessi-
ner entre l&#8217;analyse grammaticale et l&#8217;op&#233;ration de mise &#224; jour du discours, fondamentale dans
une th&#233;orie de l&#8217;interface s&#233;mantique&#8211;pragmatique comme la SDRT. En ce sens, cette &#0;-SDRT
contribue &#224; compl&#233;ter rigoureusement le traitement linguistique dans le formalisme, et ceci en
r&#233;tablissant le principe de compositionnalit&#233; autant que possible. Par ailleurs, le fait de donner
une vision sur la notion d&#8217;acte de langage d&#232;s l&#8217;analyse compositionnelle ouvre la voie &#224; une
analyse int&#233;ressante de ph&#233;nom&#232;nes relevant de la pragmatique mais n&#233;anmoins pr&#233;cis&#233;ment
grammaticalis&#233;s (comme l&#8217;&#233;videntialit&#233;, les constructions incidentes, les modalit&#233;s ou op&#233;ra-
teurs &#233;pist&#233;miques, le point de vue et le focus, etc.).
</p>
<p>R&#233;f&#233;rences
Amsili, P. et Bras, M. (1998). DRT et compositionnalit&#233;. t.a.l., 39(1), 131&#8211;160.
Amsili, P. et Hathout, N. (1998). Syst&#232;mes de types pour la (&#0;-)DRT ascendante. In Actes de la 5&#232;me
Conf&#233;rence sur le Traitement Automatique des Langues Naturelles (TALN 1998) (pp. 92&#8211;101). Paris.
Asher, N. (1993). Reference to Abstract Objects in Discourse. Dordrecht : Kluwer.
Asher, N. (2000). Computation and storage in discourse interpretation. In S. Nooteboom (&#233;d.), Compu-
tation and Storage in Linguistics. Kluwer Academic Publishers. (forthcoming).
Asher, N. et Lascarides, A. (1998). The semantics and pragmatics of presupposition. Journal of Seman-
tics, 15(3), 239&#8211;300.
Blackburn, P. et Bos, J. (1999). Working with Discourse Representation Structures, CSLI. (Ms).
Bos, J., Mastenboek, E., McGlashan, S., Millies, S., et Pinkal, M. (1994). A compositional DRS-based
formalism for NLP applications : &#0;-DRT. In H. Bunt, R. Muskens, et G. Rentier (&#233;ds.), Proceedings of
the International Workshop on Computational Semantics (IWCS&#8217;94) (pp. 21&#8211;31). Tilburg.
de Smedt, K., Horacek, H., et Zock, M. (1996). Architectures for natural language generation : Problems
and perspectives. In G. Adorni et M. Zock (&#233;ds.), Trends in Natural Language Generation. An Artificial
Intelligence Perspective. Proceedings of the 4th European Workshop, EWNLG&#8217;93, Pisa (pp. 17&#8211;46).
Berlin : Springer-Verlag.
Grosz, B. J. et Sidner, C. L. (1986). Attention, intention, and the structure of discourse. Computational
Linguistics, 12(3), 175&#8211;204.
Hobbs, J. R. (1979). Coherence and coreference. Cognitive Science, 3(1), 67&#8211;90.
Kamp, H. (2001). The importance of presupposition. In C. Rohrer, A. Ro&#223;deutscher, et H. Kamp (&#233;ds.),
Linguistic Form and its Computation. Stanford : CSLI Publications.
Kamp, H. et Reyle, U. (1993). From Discourse to Logic. Dordrecht : Kluwer Academic Publishers.
Mann, W. C. et Thompson, S. A. (1988). Rhetorical Structure Theory : Toward a functional theory of
text organization. Text, 8(3), 243&#8211;281.
Moore, J. D. et Paris, C. L. (1993). Planning text for advisory dialogues : Capturing intentional and
rhetorical information. Computational Linguistics, 19(4), 651&#8211;694.
Roussarie, L. (1998). Le probl&#232;me de la structuration et de la repr&#233;sentation du discours vu sous l&#8217;angle
de la g&#233;n&#233;ration automatique. &#8220;La g&#233;n&#233;ration de textes&#8221;, t.a.l., 39(2), 35&#8211;55.
Webber, B. L., Knott, A., et Joshi, A. K. (1999). Multiple discourse connectives in a lexicalized grammar
for discourse. In H. C. Bunt et E. G. C. Thijsse (&#233;ds.), Proceedings of the Third International Workshop
on Computational Semantics (IWCS-3) (pp. 309&#8211;325). Tilburg, The Netherlands.
</p>
<p>388</p>

</div></div>
</body></html>