<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Relatifs et r&#233;f&#233;rents inclus dans un SN : des param&#232;tres pour pr&#233;s&#233;lectionner la saisie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Relatifs et r&#233;f&#233;rents inclus dans un SN :  
des param&#232;tres pour pr&#233;s&#233;lectionner la saisie 
</p>
<p>Laurence Kister 
</p>
<p>ATILF - CNRS UMR 7118 
</p>
<p>IUT Nancy-Charlemagne - Universit&#233; Nancy 2 - D&#233;partement Info-Com 
</p>
<p>2ter, boulevard Charlemagne - 54000 Nancy 
</p>
<p>Laurence.Kister@univ-nancy2.fr 
</p>
<p>R&#233;sum&#233; 
</p>
<p>Notre objectif est de rep&#233;rer l&#8217;existence de r&#233;gularit&#233;s pour pr&#233;voir l&#8217;attachement du relatif et 
de son r&#233;f&#233;rent introduit par un SN de la forme d&#233;t. N1 de (d&#233;t.) N2 en vue d&#8217;un traitement 
automatique. Pour &#233;valuer les pr&#233;f&#233;rences, nous avons entrepris une analyse sur corpus. 
L&#8217;examen des occurrences examin&#233;es laisse entrevoir des variations  en fonction de 
param&#232;tres d&#8217;ordre fonctionnel, syntaxique et s&#233;mantiques : d&#233;terminants, traits s&#233;mantiques, 
saillance, relation &#233;tablie par l&#8217;utilisation de de, position grammaticale du SN qui introduit le 
r&#233;f&#233;rent dans le discours&#8230; 
</p>
<p>Mots cl&#233;s 
</p>
<p> 
</p>
<p>Anaphore - SN complexes - r&#233;f&#233;rence &#8211; pr&#233;position de &#8211; relatif qui  
</p>
<p>325 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence Kister 
 
</p>
<p>L&#8217;analyse sur corpus que nous proposons tend &#224; identifier les param&#232;tres qui permettent de 
pr&#233;voir l&#8217;attachement d&#8217;un relatif  et d&#8217;un r&#233;f&#233;rent introduit par un d&#233;t. N1 de (d&#233;t.) N2 en vue 
de l&#8217;automatisation du processus de reconnaissance des anaphores. Un rapide examen des 
occurrences rep&#233;r&#233;es laisse entrevoir des variations en fonction des d&#233;terminants, des traits 
s&#233;mantiques et de la position grammaticale du SN qui introduit le r&#233;f&#233;rent. Nous limitons 
l&#8217;analyse aux anaphores en qui pour deux raisons : des psycholinguistes ont montr&#233; une saisie 
pr&#233;f&#233;rentielle du N1 quand le r&#233;f&#233;rent est introduit par un SN (Mitchell, Cuetos, Zagar, 1990 - 
Zagar, 1995 - Zagar, Pinte, Rativeau, 1997, entre autres), des analyses d&#8217;ordre g&#233;n&#233;ral sur 
corpus (Baltazart, Kister, 2000) montrent que l&#8217;anaphore en qui d&#8217;un r&#233;f&#233;rent introduit par un 
SN complexe est tr&#232;s fr&#233;quente (48 %). Notre corpus se compose d&#8217;anaphores extraites d&#8217;un 
corpus constitu&#233; lors de travaux ant&#233;rieurs (Baltazart, Kister, 2000) et  d&#8217;occurrences rep&#233;r&#233;es 
sp&#233;cialement pour cette analyse. Il s&#8217;agit de textes scientifiques et techniques sous forme de 
monographies (&#233;conomie, math&#233;matiques, sciences de l&#8217;information, histoire de l&#8217;industrie et 
des techniques, arts, sciences de la terre, sport, chimie, philosophie et droit), de m&#233;moires, 
d&#8217;articles de revues sp&#233;cialis&#233;es (informatique, sciences de l&#8217;information et de la 
documentation), de rapports d&#8217;activit&#233;, de romans, d&#8217;articles (presse quotidienne, magazines 
de large diffusion, journaux d&#8217;information destin&#233;s &#224; des clients ou des adh&#233;rents,  presse 
interne d&#8217;entreprise) et de d&#233;p&#234;ches relatant des catastrophes naturelles. Il comporte 1613 
anaphores en qui dont le r&#233;f&#233;rent est introduit par un SN complexe. Comme l&#8217;anaphore sur SN 
simple c&#8217;est &#171; une expression dont l&#8217;interpr&#233;tation r&#233;f&#233;rentielle d&#233;pend d&#8217;une autre expression 
(ou d&#8217;autres expressions) mentionn&#233;e dans le contexte et g&#233;n&#233;ralement appel&#233;e son 
ant&#233;c&#233;dent &#187;. Il s&#8217;agit d&#8217;un &#171; processus qui indique une r&#233;f&#233;rence &#224; un r&#233;f&#233;rent d&#233;j&#224; connu par 
l&#8217;interlocuteur, c&#8217;est-&#224;-dire un r&#233;f&#233;rent &#171; pr&#233;sent &#187; ou d&#233;j&#224; manifeste dans la m&#233;moire 
imm&#233;diate &#187; (Kleiber, 94). Un examen rapide des r&#233;sultats permet de constater que m&#234;me si 
l'hypoth&#232;se du linguistic tuning1 propos&#233;e par les psycholinguistes parait v&#233;rifi&#233;e avec 57 % 
d'appariement du relatif &#224; l'ensemble du SN, on ne peut passer sous silence les variations dues 
aux param&#232;tres &#233;voqu&#233;s ci&#8211;dessus. Le tableau 1 reprend la r&#233;partition pour les sept 
combinaisons pr&#233;sentes au moins trente fois dans notre corpus. Si on s&#8217;int&#233;resse aux 
combinaisons retenues, on remarque que la reprise du SN est favoris&#233;e pour quatre 
constructions (Entre le traitement brut de la r&#233;alit&#233; et la fiction, le documentaire est la forme 
de t&#233;l&#233;vision qui s&#8217;approche le plus de la r&#233;alit&#233;) tandis que celle du N2 l'est pour trois autres 
(J&#8217;ai lu dans l&#8217;un de ces bouquins l&#8217;histoire d&#8217;une fille qui avait eu  la vocation d&#8217;aller 
soigner les l&#233;preux). Pour ces  SN le test du Chi 2 indique une corr&#233;lation entre le type de 
d&#233;terminant et l'attachement pr&#233;f&#233;r&#233;. On note trois formes pour lesquelles le N2 suit 
directement la pr&#233;position : un N1 de N2, ce N1 de N2 et le N1 de N2. Ce biais s'explique en 
partie par le fait que ces SN comportent des expressions lexicalis&#233;es (pomme de terre, lampe 
de poche&#8230;) o&#249; le N2 est un &#171; attribut &#187; du N1 et des structures &#171; partitives &#187; (un morceau de 
pain, une part de tarte&#8230;). Quand le N2 est pr&#233;c&#233;d&#233; d'un d&#233;fini (un N1 du N2 et le N1 du N2), 
l'attachement d&#233;pend du d&#233;terminant qui introduit le SN. Ainsi, pour un SN pr&#233;c&#233;d&#233; d&#8217;un 
ind&#233;fini, la saisie du SN est plus fr&#233;quente. La rupture discursive introduite par le SN 
complexe ind&#233;fini, comme pour les anaphores sur SN ind&#233;fini simple, traduit un nouveau 
th&#232;me de discours. 
</p>
<p>                                                 
</p>
<p>1  Il s&#8217;agit de l&#8217;&#233;valuation des mouvements oculaires et des temps de lecture lors des retours en arri&#232;re quand le 
texte lu pr&#233;sente des d&#8217;ambigu&#239;t&#233;s (le qui) et risque de conduire &#224; une mauvaise interpr&#233;tation de l&#8217;une des 
entit&#233;s linguistiques.  
</p>
<p>326 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Relatifs et r&#233;f&#233;rents inclus dans un SN : des param&#232;tres pour pr&#233;s&#233;lectionner la saisie  
</p>
<p>Type de SN Nb d&#8217;occurrences Reprise du SN Reprise du N2 
</p>
<p>le N du N 667 46 % 54 % 
</p>
<p>le N de N 395 76 %  24 % 
</p>
<p>le N d&#8217;un N 216 19 % 81 % 
</p>
<p>un N de N 181 91 % 9 % 
</p>
<p>un N du N 59 78 % 22 % 
</p>
<p>un N de ce N 36 14 % 86 % 
</p>
<p>ce N de N 30 87 % 13 % 
</p>
<p>Tableau 1 : R&#233;partition des anaphores selon le type de d&#233;t. N1 de (d&#233;t.) N2 
</p>
<p>L'ind&#233;fini a une valeur de pr&#233;sentation qui permet la premi&#232;re mention d&#8217;une entit&#233; qui 
acquiert le statut d&#8217;&#233;l&#233;ment saillant et peut faire l&#8217;objet d&#8217;une anaphore. Lorsque le SN est 
introduit par un d&#233;fini, le N2 fait, le plus souvent, l&#8217;objet d'une anaphore. Il fonctionne comme 
un d&#233;terminatif qui compl&#232;te un N1 insuffisamment d&#233;termin&#233; : le N2 permet d&#8217;identifier 
clairement le N1 et devient saillant. Un ind&#233;fini devant le N2 introduit un nouveau r&#233;f&#233;rent : il 
op&#232;re une rupture de la cha&#238;ne discursive et introduit ou change le th&#232;me de discours. Quand  
Flaux (1992) montre que la fermi&#232;re et la fille du fermier d&#233;signent un m&#234;me r&#233;f&#233;rent qui 
invite celui qui interpr&#232;te &#224; chercher dans le contexte un rep&#232;re pour l&#8217;identifier, elle explique 
en partie les r&#233;sultats des exp&#233;rimentations psycholinguistiques sur les relations pour 
lesquelles les deux N portent le trait anim&#233;. &#171; L&#8217;anaphore pr&#233;positionnelle &#187; est une  
cor&#233;f&#233;rence entre les deux SN qui autorise une reprise de fermi&#232;re ou sur fille. Pour le N1 d'un 
N2 l&#8217;argument de Flaux (1992) selon lequel le N1 d&#8217;un N2 peut faire l&#8217;objet d&#8217;une 
interpr&#233;tation ind&#233;finie et fonctionner comme un N peut &#234;tre utilis&#233;. Le SN introduit par un 
ind&#233;fini est suffisamment saillant pour faire l&#8217;objet d&#8217;une anaphore. Ainsi, l&#8217;anaphore porte 
respectivement sur le SN et le N2. Kleiber (1994) rappelle que les &#171; ind&#233;finis doivent &#234;tre 
consid&#233;r&#233;s comme les autres SN, ce sont des SN r&#233;f&#233;rentiels, dont l&#8217;objet de r&#233;f&#233;rence peut 
&#234;tre requis par une expression anaphorique &#187;. La construction un N1 de ce N2, quant &#224; elle, 
montre que l'emploi du d&#233;monstratif devant le N2 attire l'anaphore. Les propri&#233;t&#233;s 
s&#233;mantiques des N mis en relation par la pr&#233;position de ont une influence sur les possibilit&#233;s 
d'anaphores. Nous avons retenu les trois traits les plus fr&#233;quents : abstrait, anim&#233; et inanim&#233;. 
Les  SN o&#249; le N1 joue un r&#244;le de quantifieur (un groupe de gamins, une poign&#233;e de sable...) 
o&#249; le N1 quantifie le N2 et fonctionne comme un d&#233;terminant nominal (Buvet, 1993 et 1994, 
Flaux, 1997 &#8211; Benninger, 1993 et 1997) qui entra&#238;ne une saisie pr&#233;f&#233;rentielle du N2 (Kister, 
1995) ont &#233;t&#233; &#233;cart&#233;s. Il en va de m&#234;me pour les SN qui contiennent une date (la loi de 1957, 
la guerre de 1914/18...), un ou plusieurs noms propres (y compris sous forme de sigles), ou 
un num&#233;ral et un cardinal (un groupe de trois enfants, le premier de l&#8217;an...). Le tableau 2 
pr&#233;sente la r&#233;partition en fonction des traits s&#233;mantiques pour les combinaisons dont le 
nombre d&#8217;occurrences est d&#8217;au moins soixante dix neuf. 
</p>
<p>327 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence Kister 
 
</p>
<p>Traits s&#233;mantiques des  
N Nb d&#8217;occurrences Reprise du SN Reprise de N2 
</p>
<p>abstrait &#8211; abstrait 1049 59 % 41 % 
</p>
<p>abstrait &#8211; anim&#233; 234 24 % 76 % 
</p>
<p>abstrait &#8211; inanim&#233; 118 53 % 47 % 
</p>
<p>anim&#233; &#8211; abstrait 79 86 % 14 % 
</p>
<p>Tableau 2 : R&#233;partition selon les traits s&#233;mantiques des N inclus dans le SN 
</p>
<p>L'influence du trait anim&#233; para&#238;t &#233;vidente. Nos r&#233;sultats sont &#224; confronter &#224; l&#8217;hypoth&#232;se de 
Flaux (1997) qui montre que dans les groupes o&#249; le N1 est per&#231;u comme la t&#234;te de la structure 
pr&#233;positionnelle le N2 est d&#233;pourvu de v&#233;ritable r&#233;f&#233;rence : N2 a une valeur de caract&#233;risation 
(un visage de boxeur&#8230;). Ces constructions sont identifiables par la mise au pluriel : le N2 ne 
varie pas quand le nombre du N1 varie (des bols de soupe, ces cr&#233;tins d&#8217;automobiliste&#8230;). Elle 
distingue les N1 prep. N2 qui ont une &#171; t&#234;te concr&#232;te &#187; de ceux qui ont une t&#234;te &#171; abstraite &#187;. 
Dans les groupes &#224; &#171; t&#234;te concr&#232;te &#187; le N2 entretient avec le N1 une relation qui fait que le 
groupe r&#233;f&#232;re &#171; dans son entier &#187; et qu&#8217;il est &#171; unique &#187;. Ces constructions apparaissent au 
pluriel lorsque la relation se r&#233;p&#232;te : les &#233;poux de Marie (deux &#233;poux successifs), les maires 
de cette ville&#8230; L&#8217;unicit&#233; est plus fr&#233;quente pour les &#171; t&#234;tes abstraites &#187; qui d&#233;signent un 
&#233;v&#233;nement qui n&#8217;atteint un individu qu&#8217;une seule fois (la naissance de Pierre, l&#8217;&#233;lection de 
Jean (pour un mandat donn&#233;)) ou des faits li&#233;s &#224; des ph&#233;nom&#232;nes empiriques et des 
connaissances acquises (la d&#233;couverte de l&#8217;Am&#233;rique&#8230;).  
</p>
<p>L&#8217;id&#233;e d&#8217;observer un &#233;ventuel r&#244;le de la position grammaticale d&#233;coule des hypoth&#232;ses selon 
lesquelles l&#8217;anaphore privil&#233;gie les entit&#233;s qui occupent des positions identiques. Pour les 
occurrences s&#233;lectionn&#233;es qui est toujours sujet de la subordonn&#233;e : seule la position du SN 
est &#224;  examiner. Une pr&#233;f&#233;rence pour la saisie du SN appara&#238;t en positions sujet (15 %), objet 
direct (47 %) et objet indirect (14 %). La situation est invers&#233;e pour la cat&#233;gorie autres pour 
laquelle les diff&#233;rents compl&#233;ments doivent &#234;tre distingu&#233;s pour affiner l&#8217;analyse (Tableau 3).  
</p>
<p>Position du SN Nb d&#8217;occurrences Reprise du SN Reprise du N2 
</p>
<p>Objet direct 759 55 % 45 % 
</p>
<p>Sujet 241 74 % 26 % 
</p>
<p>Objet indirect 232 60 % 40 % 
</p>
<p>Autres 381 45 % 55 % 
</p>
<p>Tableau 3 : R&#233;partition en fonction de la position grammaticale du SN 
</p>
<p>Quand on associe les combinaisons de d&#233;terminants et les traits s&#233;mantiques des N, on obtient 
la r&#233;partition pr&#233;sent&#233;e par le tableau 4 qui prend en compte les r&#233;sultats pour les sept 
combinaisons de d&#233;terminants et les quatre combinaisons de traits repr&#233;sentatifs.  
</p>
<p>328 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Relatifs et r&#233;f&#233;rents inclus dans un SN : des param&#232;tres pour pr&#233;s&#233;lectionner la saisie  
</p>
<p> abstrait-abstrait abstrait-anim&#233; abstrait-inanim&#233; anim&#233;-abstrait 
</p>
<p> SN N2 SN N2 SN N2 SN N2 
</p>
<p>le N1 du N2 46 % 54 % 24 % 76 % 45 % 55 % 86 % 14 % 
</p>
<p>le N1de N2 80 % 20 % 39 % 61 % 78 % 22 % 11 % 89 % 
</p>
<p>le N1 d&#8217;un N2 22 % 78 % 9 % 91 % 14 % 86 % 67 % 33 % 
</p>
<p>un N1 de N2 93 % 7 % 44 % 56 % 67 % 33 % 90 % 10 % 
</p>
<p>un N1 du  N2 79 % 21 % 66 % 34 % 75 % 25 % 78 % 22 % 
</p>
<p> le N1 de ce N2 12 % 88 % - 100 % 50 % 50 % - - 
</p>
<p>ce N1 de N2 90 % 10 % - - 86 %  100 % - 
</p>
<p>Tableau 4 : R&#233;partition des reprises selon des traits s&#233;mantiques des N et les d&#233;terminants  
</p>
<p>Cette r&#233;partition nous conduit &#224; formuler plusieurs hypoth&#232;ses. Comme cela a &#233;t&#233; propos&#233; aux 
cours de travaux ant&#233;rieurs pour les anaphores sur SN simple (Ariel, 1990 &#8211; Charolles, 1991, 
entre autres), il existe une tendance &#224; rattacher le relatif &#224; l&#8217;&#233;l&#233;ment le plus saillant. Le biais 
d&#8217;attachement qu&#8217;on observe est sensible &#224; ce qu&#8217;on d&#233;signe par &#171; focalisation &#187;. Le 
processus d&#8217;interpr&#233;tation r&#233;f&#233;rentielle est alors un ph&#233;nom&#232;ne essentiellement pragmatique : 
les calculs inf&#233;rentiels s&#8217;effectuent &#224; partir du contexte et du savoir partag&#233; plut&#244;t que par des 
r&#232;gles fixes et conventionnelles (Reichler-Beguelin, 1988 et 1989 &#8211; Reboul, 1989a et b, 1990 
et 1991). Reboul signale que &#171; plus le sens (...) d&#8217;une expression r&#233;f&#233;rentielle est r&#233;duit et plus 
accessible ou saillant doit &#234;tre son r&#233;f&#233;rent &#187;. Le pronom est d&#233;pourvu de sens et renvoie &#224; un 
&#233;l&#233;ment saillant du contexte ant&#233;rieur : une analyse s&#233;mantique s&#8217;impose. Notre approche est 
confront&#233;e au m&#234;me type de probl&#232;mes que la plupart des travaux qui s&#8217;int&#233;ressent aux 
aspects linguistiques ou &#224; l&#8217;analyse en vue d&#8217;une application en &#171; intelligence &#187; humaine : elle 
occupe &#171; une position interm&#233;diaire entre des analyses quasiment linguistiques et les 
approches r&#233;solument pragmatiques &#187; (Kleiber, 1994). En effet, il est indispensable de 
prendre en compte des contraintes linguistiques et des facteurs structurels pour proposer des 
pr&#233;f&#233;rences. Les difficult&#233;s &#224; rendre compte des facteurs qui permettent d&#8217;identifier un 
r&#233;f&#233;rent inclus dans un d&#233;t. N1 de (d&#233;t.) N2 sont dues &#224; la multitude des structures 
anaphoriques qu&#8217;il est possible de rencontrer : la pr&#233;position de admet diff&#233;rentes valeurs 
d&#8217;o&#249; diff&#233;rents fonctionnements r&#233;f&#233;rentiels, les d&#233;terminants inclus dans la structure 
pr&#233;positionnelle permettent diff&#233;rents modes de donation du r&#233;f&#233;rent, la saillance d&#8217;un 
constituant ou de l&#8217;ensemble de la structure est possible, les traits s&#233;mantiques des N 
contribuent &#224; rendre saillant un constituant ou le SN, la position grammaticale de la structure 
complexe joue un r&#244;le&#8230; Afin de d&#233;terminer les param&#232;tres d&#8217;ordre s&#233;mantique et 
pragmatique il est n&#233;cessaire de s&#8217;int&#233;resser aux contextes gauche et droit (Apoth&#233;loz, 1995) : 
parfois, c&#8217;est l&#8217;emploi de certains verbes apr&#232;s le relatif qui permet d&#8217;effectuer la saisie du 
r&#233;f&#233;rent d&#8217;un anaphorique d&#8217;o&#249; la n&#233;cessit&#233; de s&#8217;int&#233;resser au pr&#233;dicat. 
</p>
<p>329 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence Kister 
 
</p>
<p>330 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Apoth&#233;loz D. (1995), R&#244;le et fonctionnement de l&#8217;anaphorique dans la dynamique textuelle, 
Langue et culture, Gen&#232;ve, Droz. 
Ariel M. (1990), Accessing noun phrase antecedent, London and New York, Routledge 
Baltazart D., Kister L. (2000), Is it possible to predetermine a referent included in a French N 
de N structure ?, Corpus-based and Computationel Approaches to Discourse Anaphora, 
S. Botley and A.M. McEnery &#233;ds, Studies in Corpus Linguistics, p. 65-80. 
Benninger C. (1993),  Les substantifs quantificateur en &#8211;&#233;e,  Le nombre, Faits de langue, 2, 
p. 79-84. 
Benninger C. (1997), De la quantit&#233; aux substantifs quantifieurs, Th&#232;se de Doctorat, 
Universit&#233; de Strasbourg. 
Buvet P.A. (1993), Les d&#233;terminants nominaux quantifieurs, Th&#232;se de Doctorat en 
Linguistique, Laboratoire de Linguistique informatique, Universit&#233; Paris XIII. 
Buvet P.A. (1994), D&#233;termination : les noms, Linguisticae Investigationes, XVIII, 1, p. 121-
150. 
Flaux N. (1992), Les syntagmes nominaux du type le fils d&#8217;un paysan : r&#233;f&#233;rence d&#233;finie ou 
ind&#233;finie ?, Le Fran&#231;ais Moderne, LX, 1 p. 23-45. 
Flaux N. (1997), Les d&#233;terminants et le nombre, Entre g&#233;n&#233;ral et particulier : les 
d&#233;terminants, N. Flaux, D. van de Velde et W. de Mulder &#233;ds, Etudes litt&#233;raires et 
linguistiques, Arras, Artois Presses Universit&#233;, p.15-82 
Kister L. (1999), Identification des cha&#238;nes de r&#233;f&#233;rence dans les syst&#232;mes automatiques : le 
cas des anaphores dans les N de N, VExTAL, 22-24 novembre 1999, Venise. 
Kister L. (1995), Accessibilit&#233; pronominale des d&#233;t. N1 de (d&#233;t.) N2 : le r&#244;le de la 
d&#233;termination, Linguisticae Investigationes, XIX, I, p. 107-121. 
Kleiber G. (1994), Anaphores et pronoms, Champs linguistiques, Louvain-la-Neuve, Editions 
Duculot 
Mitchell D.C., Cuetos F., Zagar D. (1990), Reading in Different Languages : is there a 
Universal Mechamism for Parsing Sentences, Comprehension Processus in Reading, 
D.A. Balota, G.B. Flores d&#8217;Arcais and K. Rayner (eds.). Hillsdale, Lawrence Erlbaum, 
Associates, Inc. 
Reboul A. (1989a), R&#233;solution de l&#8217;anaphore pronominale : s&#233;mantique et/ou pragmatique, 
Cahiers de linguistique fran&#231;aise, 10, pp. 77-100. 
Reboul A. (1989b), R&#233;solution automatique de l&#8217;anaphore pronominale, Mod&#232;les du discours. 
Recherches actuelles en Suisse romande, C. Rubattel &#233;d., Berne, Peter Lang, pp. 173-192. 
Reboul A. (1990), Pragmatique de l&#8217;anaphore pronominale, Sigma,12/13, pp. 197-231. 
Reboul A. (1991), Le syst&#232;me des pronoms personnels en fran&#231;ais contemporains, Tranel, 17, 
pp. 123-146. 
Reichler-B&#233;guelin M.J. (1988), Anaphore, cataphore et m&#233;moire discursive, Pratiques, 57, 
pp. 15-43. 
Reichler-B&#233;guelin M.J. (1989), Anaphore, connecteurs et processus inf&#233;rentiels, Mod&#232;les du 
discours. Recherches actuelles en Suisse romande, C. Rubattel &#233;d., Berne, Peter Lang, 
pp. 303-336. 
Zagar D. (1995), La lecture : processus de base, Habilitation &#224; diriger les recherches, U.F.R. 
de Sciences Humaines - Universit&#233; de Bourgogne, LEAD - CNRS Ura 1938. 
Zagar D., Pynte J., Rativeau S. (1997), Evidence for Early-closure Attachment on First-pas 
Reading Times in French, The Quaterly Journal of Exp&#233;rimental Psychology, 2, pp. 421-438. </p>

</div></div>
</body></html>