<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une m&#233;thode pour l'analyse descendante et calculatoire de corpus multilingues : application au calcul des relations sujet-verbe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24-27juin 2002 
</p>
<p>Une m&#233;thode pour l'analyse descendante et calculatoire  
de corpus multilingues :  
</p>
<p>application au calcul des relations sujet-verbe 
</p>
<p>Jacques Vergne 
</p>
<p>GREYC - Universit&#233; de Caen 
BP 5186 - 14032 Caen cedex 
</p>
<p>Jacques.Vergne@info.unicaen.fr 
http://www.info.unicaen.fr/~jvergne 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
</p>
<p>Nous pr&#233;sentons une m&#233;thode d'analyse descendante et calculatoire. La d&#233;marche d'analyse 
est descendante du document &#224; la proposition, en passant par la phrase. Le prototype pr&#233;sent&#233; 
prend en entr&#233;e des documents en anglais, fran&#231;ais, italien, espagnol, ou allemand. Il 
segmente les phrases en propositions, et calcule les relations sujet-verbe dans les propositions. 
Il est calculatoire, car il ex&#233;cute un petit nombre d'op&#233;rations sur les donn&#233;es. Il utilise tr&#232;s 
peu de ressources (environ 200 mots et locutions par langue), et le traitement de la phrase 
fait environ 60 Ko de Perl, ressources lexicales comprises. La m&#233;thode pr&#233;sent&#233;e se situe dans 
le cadre d'une recherche plus g&#233;n&#233;rale du Groupe Syntaxe et Ing&#233;nierie Multilingue du 
GREYC sur l'exploration de solutions minimales et multilingues, ajust&#233;es &#224; une t&#226;che donn&#233;e, 
exploitant peu de propri&#233;t&#233;s linguistiques profondes, la g&#233;n&#233;ricit&#233; allant de pair avec 
l'efficacit&#233;. 
</p>
<p>We present a method for top-down and calculatory parsing. The prototype we present is top-
down from the document to the clause, through the sentence. Its inputs are documents in 
English, French, Italian, Spanish, or German. It tokenises sentences into clauses, and 
computes subject-verb links inside clauses. It is calculatory, as it executes few operations on 
data. It uses very few resources (about 200 words or locutions per natural language), and the 
sentence processing size is about 60 Kb Perl, including lexical resources. This method takes 
place in the frame of more general researches of the &quot;Groupe Syntaxe et Ing&#233;nierie 
Multilingue du GREYC&quot; into exploring minimal and multilingual solutions, close fitted to a 
given task, exploiting few deep linguistic properties, presuming that genericity implies 
efficiency. 
</p>
<p>Mots Cl&#233;s &#8211; Keywords  
</p>
<p>analyse syntaxique, analyse descendante, analyse calculatoire, corpus multilingues 
top-down parsing, calculatory parsing, multilingual corpora 
</p>
<p>63 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jacques Vergne 
</p>
<p>1 Objectifs et cadre de cette recherche 
</p>
<p>Cette recherche se situe dans le cadre des travaux du groupe Syntaxe et Ing&#233;nierie 
Multilingue du GREYC. Nous cherchons et explorons des solutions minimales, c'est-&#224;-dire 
pour une t&#226;che donn&#233;e, ajuster et minimiser les moyens utilis&#233;s, trouver les moyens suffisants 
et n&#233;cessaires, avec l'ambition de qualit&#233; analogue ou meilleure que d'autres solutions 
actuelles. Nous pensons que la minimalit&#233; d'une solution est un signe de la bonne utilisation 
de quelques propri&#233;t&#233;s linguistiques profondes du mat&#233;riau trait&#233; (seulement celles qui 
servent aux calculs de la t&#226;che donn&#233;e) 1. Des telles solutions minimales ont des algorithmes 
simples, de complexit&#233; pratique lin&#233;aire en temps; nous les appelons &quot;calculatoires&quot; car elles 
explicitent des op&#233;rations sur les donn&#233;es, au lieu d'explorer une combinatoire d'attributs issue 
de ressources lexicales quasi-exhaustives et de filtrer cette combinatoire par des grammaires 
formelles 2. Ces solutions minimales utilisent tr&#232;s peu de ressources sp&#233;cifiques &#224; une 
langue donn&#233;e (pas de dictionnaire quasi-exhaustif), et ainsi facilitent les applications 
multilingues.  
</p>
<p>La conception et le d&#233;veloppement d'applications multilingues a un double int&#233;r&#234;t linguistique 
et informatique : du point de vue linguistique, on rejoint la pr&#233;occupation des linguistes 
d'abstraire la vari&#233;t&#233; apparente des langues pour faire &#233;merger des propri&#233;t&#233;s linguistiques 
ind&#233;pendantes des langues; du point de vue informatique, on est conduit &#224; dissocier le 
g&#233;n&#233;rique &#224; plusieurs langues du sp&#233;cifique &#224; une langue; et d'un point de vue applicatif, il 
para&#238;t difficile de ne pas avoir l'ambition de pouvoir traiter la vari&#233;t&#233; des langues pr&#233;sentes sur 
Internet (remarquons que les moteurs de recherche g&#233;n&#233;ralistes ont cette ambition). 
</p>
<p>Enfin, la d&#233;couverte des propri&#233;t&#233;s linguistiques, l'&#233;laboration et la mise au point et les tests 
de ces solutions n&#233;cessitent un important travail sur corpus multilingues, corpus amplement 
disponibles aujourd'hui sur Internet 3.  
</p>
<p>2 Une t&#226;che classique 
</p>
<p>Pour des raisons exp&#233;rimentale et p&#233;dagogique, nous avons choisi une t&#226;che limit&#233;e et 
(apparemment) simple : d&#233;tecter et relier sujets et verbes, t&#226;che classique qui permettra aux 
lecteurs des comparaisons avec des m&#233;thodes existantes. 
</p>
<p>Le prototype de notre &quot;analyseur-relieur&quot; est descendant du document &#224; la proposition, en 
passant par la phrase. Il est multilingue (anglais, fran&#231;ais, italien, espagnol, allemand). Il est 
</p>
<p>                                                 
1 Un autre exemple de ce type de travail, mais au niveau du document entier, est la solution minimale mise au 
</p>
<p>point pour la d&#233;tection automatique de la citation et du discours rapport&#233; (Lucas, Giguet, Vergne, 2001). 
</p>
<p>2 C'&#233;tait l'objet de notre conf&#233;rence invit&#233;e &#224; TALN 2001 (Vergne, 2001) : Analyse syntaxique automatique de 
langues : du combinatoire au calculatoire. 
</p>
<p>3 Nos corpus sont constitu&#233;s d'articles de presse : articles en fran&#231;ais de Ouest-France et du Courrier 
International, en anglais du Washington Post, en allemand du Spiegel, en espagnol de El Mundo, et en italien 
de La Stampa. Ces articles sont t&#233;l&#233;charg&#233;s du site de ces journaux dans le format html. On trouve par 
exemple de tr&#232;s nombreuses adresses sur le site de l'hebdomadaire &quot;Courrier International&quot; : 
</p>
<p>   http://www.courrierinternational.com/kiosk/kiosq.htm 
</p>
<p>64 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une m&#233;thode pour l'analyse descendante et calculatoire de corpus multilingues 
</p>
<p>&#233;crit en Perl (tr&#232;s bon outil de prototypage pour des applications de traitements de documents, 
en particulier gr&#226;ce aux expressions r&#233;guli&#232;res), et la partie &quot;analyse de phrase&quot; fait 40 Ko, 
avec des ressources sp&#233;cifiques aux 5 langues de 20 Ko environ au total.  
</p>
<p>Un pr&#233;-traitement (qui sera d&#233;crit dans un article ult&#233;rieur) extrait le texte &#224; analyser du 
fichier html (par comparaison des tables d'un ensemble de fichiers t&#233;l&#233;charg&#233;s d'une m&#234;me 
source et extraction des cellules apax), puis il le repr&#233;sente sous la forme d'une unique cha&#238;ne 
de caract&#232;res, le translitt&#232;re en un m&#234;me jeu de caract&#232;res (iso 8859-1 pour l'instant, iso 
10646/Unicode plus tard), en diagnostique la langue, et enfin le d&#233;coupe en phrases, segment 
d'entr&#233;e de l'&quot;analyseur-relieur&quot;. 
</p>
<p>3 Caract&#233;ristiques de la m&#233;thode 
</p>
<p>Appelons &quot;grain&quot; une classe de segments d'un document : on peut alors parler du grain-mot, 
du grain-phrase, du grain-paragraphe, etc. Ces grains peuvent former des hi&#233;rarchies 
inclusives, comme dans un fichier XML (ou en physique de la mati&#232;re, ou en astrophysique), 
et appartenir &#224; des hi&#233;rarchies diff&#233;rentes non r&#233;ductibles &#224; une seule hi&#233;rarchie inclusive : on 
peut distinguer les grains physiques (le donn&#233; de la typographie) des grains calcul&#233;s au cours 
du processus d'analyse. 
</p>
<p>On peut alors caract&#233;riser le processus d'analyse comme un processus de passage des grains 
physiques (en entr&#233;e) aux grains calcul&#233;s (en sortie) : traditionnellement, les grains physiques 
d'entr&#233;e sont la phrase et le mot, et le grain calcul&#233; en sortie est le syntagme. 
</p>
<p>Toute analyse commence par une segmentation physique de la donn&#233;e de d&#233;part (le 
document) en grains physiques d'entr&#233;e. Ensuite deux op&#233;rations sont possibles : soit le 
processus consiste &#224; regrouper des grains physiques (processus appel&#233; analyse montante), par 
exemple regrouper des mots en syntagmes, soit &#224; d&#233;couper des grains physiques (processus 
appel&#233; analyse descendante), par exemple d&#233;couper des phrases en propositions. Notons que 
les termes &quot;montante&quot; et &quot;descendante&quot; font implicitement allusion &#224; un haut et un bas d'une 
hi&#233;rarchie des grains o&#249; l'unique gros grain (le document par exemple) est plac&#233; en haut (on 
peut y voir une trace de l'&#233;tymologie du mot hi&#233;rarchie), ce qui donne conventionnellement un 
arbre avec la racine en haut. 
</p>
<p>La m&#233;thode pr&#233;sent&#233;e est une m&#233;thode d'analyse descendante :  
</p>
<p>&#8226; le grain physique de d&#233;part est la graphie de phrase, obtenue par segmentation de la 
graphie du document entier par expressions r&#233;guli&#232;res sur la ponctuation de fin de phrase ; 
</p>
<p>&#8226; le grain calcul&#233; en sortie est la proposition 4 et c'est le plus petit grain repr&#233;sent&#233; dans une 
structure r&#233;p&#233;titive de propositions ; la proposition est l'espace de calcul, et sa graphie en 
</p>
<p>                                                 
</p>
<p>4 Eva Ejerhed, dans (Ejerhed, 1996) a utilis&#233; cette strat&#233;gie d'analyse (mais avec dictionnaire). &#192; notre 
connaissance, elle n'a plus publi&#233; ult&#233;rieurement sur ce sujet, car, en 2000, son &quot;proc&#233;d&#233;&quot; &#233;tait sur le point 
d'&#234;tre brevet&#233;, pour &#234;tre utilis&#233; par la soci&#233;t&#233; de Language technology Hapax (www.hapax.com) qu'elle a 
cr&#233;&#233;e. On trouvera un autre exemple de cette strat&#233;gie d'analyse sur l'&#233;gyptien ancien dans (Rosmorduc, 
1994). 
</p>
<p>65 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jacques Vergne 
</p>
<p>sortie est balis&#233;e sur les chunks sujets et les chunks verbes 5. On ne tokenise pas jusqu'au 
grain chunk ni a fortiori jusqu'au grain mot 6 (ils ne sont pas repr&#233;sent&#233;s dans une 
structure r&#233;p&#233;titive de chunks ou de mots), mais les concepts de chunk et de mot sont 
utilis&#233;s dans le traitement : chunks et mots sont &quot;vus d'en haut&quot; du point de vue de la 
proposition (&#224; l'aide d'un balisage pos&#233; par des expressions r&#233;guli&#232;res). 
</p>
<p>C'est une analyse de corpus multilingues qui n&#233;cessite un diagnostic de la langue du 
document (suppos&#233; monolingue) pour choisir correctement les ressources sp&#233;cifiques &#224; cette 
langue. Ce diagnostic est simplement effectu&#233; par comptage des occurrences des graphies des 
ressources lexicales (sp&#233;cifiques &#224; chaque langue) dans le document; la langue du document 
est celle qui recueille le score le plus &#233;lev&#233;. Dans la mesure du possible, ce qui est sp&#233;cifique 
&#224; une langue se situe dans les ressources, et le traitement reste le plus g&#233;n&#233;rique possible (il y 
a actuellement quelques exceptions, surtout pour l'allemand qui permet d'utiliser des marques 
de fin de propositions qui lui sont propres). 
</p>
<p>4 Strat&#233;gie g&#233;n&#233;rale du processus d'analyse 
</p>
<p>Une graphie de phrase est d'abord soumise &#224; un &quot;processus standard&quot; qui, pour environ la 
moiti&#233; des phrases, suffit pour segmenter correctement en propositions et pour relier sujets et 
verbes. Le r&#233;sultat de ce processus est ensuite &#233;valu&#233;, pour d&#233;tecter la n&#233;cessit&#233; &#233;ventuelle 
d'un &quot;post-traitement&quot; de segmentation plus fine et/ou de mise en relation d'un couple sujet - 
verbe s&#233;par&#233;s par une proposition ench&#226;ss&#233;e. 
</p>
<p>4.1 Le processus standard 
</p>
<p>On part d'un document segment&#233; en phrases par le pr&#233;-traitement d&#233;crit en section 2. Des 
balises de d&#233;but de proposition (conjonctions de subordination et pronoms relatifs), de d&#233;but 
de chunks (pr&#233;positions et d&#233;terminants), d'auxiliaires conjugu&#233;s (avoir, &#234;tre et modaux) et de 
pronoms sujets, sont pos&#233;es dans la graphie de la phrase au moyen d'expressions r&#233;guli&#232;res 
(en prenant soin des fronti&#232;res des mots et locutions : espace, ponctuation). Ces mots et 
locutions constituent, avec les terminaisons verbales et les clitiques (D&#233;jean, 1998), 
l'int&#233;gralit&#233; des ressources lexicales sp&#233;cifiques &#224; une langue (environ 200 mots ou 
locutions par langue).  
</p>
<p>Puis la phrase est d&#233;coup&#233;e sur les d&#233;buts de proposition, d'o&#249; des segments nomm&#233;s &quot;proto-
propositions&quot;, qui constituent un grain jouant un r&#244;le d'interm&#233;diaire de calcul 7.  
</p>
<p>                                                 
</p>
<p>5 Le concept de &quot;chunk&quot; a &#233;t&#233; fond&#233; par (Abney, 1991) sur les formes orales et &#233;crites des langues; voir ensuite 
les th&#232;ses issues du Groupe Syntaxe : (D&#233;jean, 1998), (Giguet, 1998), (Vannier, 1999), et (Lebarb&#233;, 2002), 
ainsi que (Vergne, 2000) et (Vergne, 2001) page 26. Voir aussi le &quot;bunsetsu&quot; traditionnel japonais. 
</p>
<p>6 Un aspect de la minimalit&#233; de la solution consiste aussi &#224; ne pas tokeniser jusqu'au grain mot. 
</p>
<p>7 Cette &quot;proto-proposition&quot; est ainsi nomm&#233;e car elle n'est valid&#233;e comme proposition qu'&#224; la fin du traitement. 
Elle est analogue au &quot;segment&quot; de Thomas Lebarb&#233; (Lebarb&#233;, 2002). 
</p>
<p>66 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une m&#233;thode pour l'analyse descendante et calculatoire de corpus multilingues 
</p>
<p>Propri&#233;t&#233; exploit&#233;e : chaque proposition a un verbe et un sujet, qui sont le plus souvent 
connexes (et donc plac&#233;s dans la m&#234;me proto-proposition), mais quelquefois non connexes, 
car s&#233;par&#233;s par une proposition ench&#226;ss&#233;e (dans ce cas, sujet et verbe sont dans deux proto-
propositions diff&#233;rentes, ce qui n&#233;cessitera un post-traitement de mise en relation). 
</p>
<p>Ces proto-propositions sont &#233;tudi&#233;es une par une, et un traitement particulier est d&#233;clench&#233; 
selon le nombre d'auxiliaires et le nombre de pronoms sujets (personnel ou relatif) 8 : 
</p>
<p> aucun 
auxiliaire 
</p>
<p>1 auxiliaire &gt; 1 auxiliaires 
</p>
<p>aucun pronom 
sujet 
</p>
<p>chercher sujet 
et verbe 
</p>
<p>accord&#233;s [3] 
</p>
<p>chercher un 
sujet accord&#233; 
</p>
<p>[2] 
</p>
<p> couper en 2 
proto-
</p>
<p>propositions [4] 
</p>
<p>1 pronom sujet chercher un 
verbe accord&#233;
</p>
<p>[1] 
</p>
<p>pas de 
traitement   
</p>
<p>[0] 
</p>
<p>couper en 2 
proto-
</p>
<p>propositions [4] 
</p>
<p>&gt; 1 pronoms 
sujets 
</p>
<p>couper en 2 
proto-
</p>
<p>propositions [4]
</p>
<p>couper en 2 
proto-
</p>
<p>propositions [4]
</p>
<p>couper en 2 
proto-
</p>
<p>propositions [4] 
</p>
<p>Figure 1 : Traitements d&#233;clench&#233;s selon les attributs de la proto-proposition  
au cours du processus standard 
</p>
<p>Voici des exemples des diff&#233;rents cas de traitement d&#233;clench&#233; selon les attributs de la proto-
proposition, chacune subissant un seul des 5 traitements (les [num&#233;ros] r&#233;f&#232;rent au tableau ci-
dessus) : 
</p>
<p>[0] 1 pronom sujet et 1 auxiliaire =&gt; on a un verbe accord&#233; avec un pronom sujet 9 :  
</p>
<p>&lt;[&gt;|&lt;pp&gt;Il&#9674;|&lt;V&gt;a&#9674;fourni&#9674;&lt;p&gt;&#224;&#9674;l'Europe&lt;/p&gt;&#9674;&lt;d&gt;une&#9674;protection&lt;/d&gt;&#9674;tr&#232;s&#9674;forte&#9674; 
&lt;p&gt;contre&#9674;une&#9674;multitude&lt;/p&gt;&#9674;&lt;p&gt;d'&#233;v&#233;nements&lt;/p&gt;&#9674;  
</p>
<p>(sujet et verbe reli&#233;s sont marqu&#233;s par le signe | ) 
</p>
<p>                                                 
8 Environ la moiti&#233; des proto-propositions contiennent un auxiliaire, et environ un quart contiennent un pronom 
</p>
<p>sujet. La fr&#233;quence &#233;lev&#233;e de ces marques en fait une tr&#232;s bonne base de d&#233;part des calculs. 
</p>
<p>9 Pour faciliter la compr&#233;hension des r&#233;sultats du calcul, la proto-proposition (grain et espace du calcul du 
processus standard) est encadr&#233;e, les marques servant aux calculs sont en gras (dont certains espaces), le reste 
du texte est en gris&#233;, et les espaces sont marqu&#233;s par le signe : &#9674;  .  
Conventions des balises :  &lt;[&gt; : d&#233;but de proto-proposition marqu&#233; par le d&#233;but de phrase,  
&lt;pp&gt;il&#9674; : pronom personnel sujet,  
&lt;V&gt;a&#9674;fourni : d&#233;but de chunk Verbal conjugu&#233;,  
&lt;p&gt;&#224;&#9674;l'Europe&lt;/p&gt;&#9674; : chunk pr&#233;positionnel (partie masqu&#233;e entre les balises),  
&lt;d&gt;une&#9674;protection&lt;/d&gt;&#9674;tr&#232;s&#9674;forte&#9674; : chunk nominal commen&#231;ant par un d&#233;terminant (partie masqu&#233;e),  
&lt;[cs&gt;parce&#9674;qu'&lt;/cs&gt;&#9674; : d&#233;but de proto-proposition marqu&#233; par une conjonction de subordination ou un 
pronom relatif non sujet. 
</p>
<p>67 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jacques Vergne 
</p>
<p>&#8226; on v&#233;rifie qu'ils font partie du m&#234;me chunk verbal (=&gt; aucun traitement), sinon on a 
2 chunks verbaux et on est ramen&#233; au cas [4] 
</p>
<p>[1] 1 pronom sujet et pas d'auxiliaire =&gt; recherche d'un verbe accord&#233; pour ce pronom sujet  
</p>
<p>&lt;[&gt;Jetzt&#9674;|&lt;V&gt;&#252;bt&#9674;|&lt;pp&gt;er&#9674;sich&#9674;&lt;p&gt;im&#9674;Verschenken&lt;/p&gt;&#9674; 
</p>
<p>&#8226; pronom et verbe font partie du m&#234;me chunk verbal et le verbe est contigu au pronom 
</p>
<p>[2] pas de pronom sujet et 1 auxiliaire =&gt; recherche d'un sujet accord&#233; &#224; cet auxiliaire  
</p>
<p>&lt;[&gt;|&lt;d&gt;One&#9674;factor&lt;/d&gt;&#9674;restraining&#9674;previous&#9674;military&#9674;action&#9674;|&lt;V&gt;was&#9674;&lt;d&gt;an&#9674; 
emphasis&lt;/d&gt;&#9674;&lt;p&gt;on&#9674;zero&lt;/p&gt;&#9674;casualties&#9674; 
</p>
<p>&#8226; on cherche un groupe sujet commen&#231;ant par un d&#233;terminant ou constitu&#233; d'un nom 
propre; en g&#233;n&#233;ral, on le trouve avant, sauf en allemand, ou en fran&#231;ais dans certaines 
subordonn&#233;es 
</p>
<p>[3] ni pronom sujet ni auxiliaire =&gt; recherche d'un sujet et d'un verbe conjugu&#233; accord&#233;s 
</p>
<p>&#8226; sujet et verbe accord&#233;s sont recherch&#233;s par essais de motifs comprenant un couple 
d&#233;terminant et terminaison verbale : accord au singulier (par exemple L' -end en 
fran&#231;ais, die -e, das -t en allemand, La -&#243; en espagnol), au pluriel (ces -ent en fran&#231;ais, 
die -en en allemand), ou de nombre ind&#233;termin&#233; (par exemple en anglais : the -ed); la 
recherche de verbe &#224; l'aide de sa terminaison s'accompagne d'un masquage temporaire 
des chunks nominaux et pr&#233;positionnels pour &#233;viter d'y chercher un verbe; ce 
masquage est complet en allemand gr&#226;ce &#224; la majuscule des noms, et partiel dans les 4 
autres langues : 
</p>
<p>&lt;[&gt;|&lt;d&gt;L'euro&lt;/d&gt;&#9674;|&lt;V&gt;rend&#9674;d&#233;j&#224;&#9674;&lt;p&gt;d'&#233;minents&lt;/p&gt;&#9674;services&#9674; 
 
</p>
<p>&lt;[&gt;&lt;p&gt;Dans&#9674;les&#9674;deux&lt;/p&gt;&#9674;cas&#9674;|&lt;d&gt;ces&#9674;syst&#232;mes&lt;/d&gt;&#9674;&lt;p&gt;d'armes&lt;/p&gt;&#9674; 
|&lt;V&gt;disposent&#9674;&lt;p&gt;de&#9674;radars&lt;/p&gt; 
</p>
<p> 
</p>
<p>&lt;[&gt;|&lt;d&gt;La&#9674;Bolsa&lt;/d&gt;&#9674;&lt;p&gt;de&#9674;Tokio&lt;/p&gt;&#9674;|&lt;V&gt;cerr&#243;&#9674;ayer&#9674;&lt;p&gt;a&#9674;su&#9674;nivel&lt;/p&gt;&#9674;m&#225;s
&#9674; bajo&#9674;&lt;p&gt;en&#9674;17&lt;/p&gt;&#9674;a&#241;os&#9674; 
</p>
<p> 
</p>
<p>&lt;[&gt;|&lt;d&gt;Questo&#9674;tema&lt;/d&gt;&#9674;|&lt;V&gt;rischia&#9674;&lt;p&gt;di&#9674;essere&lt;/p&gt;&#9674;&lt;d&gt;la&#9674;questione&lt;/d&gt;&#9674; 
sociale&#9674;&lt;p&gt;del&#9674;futuro&lt;/p&gt; 
</p>
<p>&#8226; en anglais, on exploite la propri&#233;t&#233; (au pr&#233;sent) de la coupure entre sujet et verbe 
contigus, marqu&#233;e -non s / -s au singulier ou -s / -non s au pluriel : 
</p>
<p>&lt;[cc&gt;But&#9674;|&lt;d&gt;the&#9674;Pentagon&lt;/d&gt;&#9674;move&#9674;|&lt;V&gt;represents&#9674;&lt;d&gt;the&#9674;first&lt;/d&gt;&#9674;significa
nt&#9674; federal&#9674;call-up&#9674; 
</p>
<p> 
</p>
<p>&lt;[&gt;|&lt;d&gt;The&#9674;costs&lt;/d&gt;&#9674;|&lt;V&gt;mount&#9674;rapidly,&#9674;  
 
</p>
<p>&#8226; en allemand, la fronti&#232;re chunk nominal - chunk verbal est marqu&#233;e par le motif : 
mot &#224; initiale majuscule / mot en minuscule ; voici un premier exemple : l'ordre sujet-
verbe-compl&#233;ment qui fonctionne comme en fran&#231;ais : 
</p>
<p>68 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une m&#233;thode pour l'analyse descendante et calculatoire de corpus multilingues 
</p>
<p>&lt;[&gt;|&lt;d&gt;Das&#9674;Sternbild&lt;/d&gt;&#9674;n&#228;mlich&#9674;|&lt;V&gt;steht&#9674;&lt;p&gt;in&#9674;dieser&#9674;Jahreszeit&lt;/p&gt;&#9674; 
besonders&#9674;tief&#9674;&lt;p&gt;am&#9674;Himmel&lt;/p&gt;&#9674; 
</p>
<p> 
&#8226; et un deuxi&#232;me exemple : l'ordre compl&#233;ment-verbe-sujet tr&#232;s courant dans la 
principale en allemand : 
</p>
<p>&lt;[&gt;&lt;p&gt;Bis&#9674;Ende&#9674;Oktober&lt;/p&gt;&#9674;|&lt;V&gt;schlie&#223;t&#9674;sich&#9674;|&lt;d&gt;der&#9674;Reigen&lt;/d&gt;&#9674; 
&lt;p&gt;in&#9674;Connecticut&lt;/p&gt;,&#9674;Massachusetts&#9674;&lt;cc&gt;und&#9674;Rhode&#9674;Island&#9674; 
</p>
<p> 
&#8226; mais on trouve aussi l'ordre verbe-sujet dans certaines subordonn&#233;es en fran&#231;ais 10 : 
</p>
<p>&lt;[cs&gt;dont&#9674;&lt;/cs&gt;|&lt;V&gt;ne&#9674;disposent&#9674;pas&#9674;|&lt;d&gt;les&#9674;moyens&lt;/d&gt;&#9674;civils&#9674; 
actuellement&#9674;&lt;p&gt;en&#9674;service&lt;/p&gt;&#9674;  
</p>
<p> 
[4] plus d'un pronom sujet ou plus d'un auxiliaire =&gt; segmentation ult&#233;rieure 
</p>
<p>&#8226; dans le post-traitement, il faudra couper cette proto-proposition en 2, en recherchant 
une coupure ; 
</p>
<p>Le traitement de la phrase est termin&#233; si chaque proto-proposition a son couple sujet - verbe 
reli&#233;s, ce qui en fait une proposition, et si au moins une proposition principale a &#233;t&#233; d&#233;tect&#233;e. 
C'est le cas pour environ la moiti&#233; des phrases. Si ces conditions ne sont pas r&#233;unies, le post-
traitement est d&#233;clench&#233;.  
</p>
<p>4.2 Le post-traitement &#233;ventuel  
</p>
<p>Le post-traitement a deux fonctions non exclusives :  
</p>
<p>1. segmenter en 2 les proto-propositions o&#249; 2 verbes ont &#233;t&#233; d&#233;tect&#233;s, ou qu'il faut couper 
pour isoler la proposition principale,  
</p>
<p>2. relier sujet et verbe situ&#233;s dans 2 proto-propositions diff&#233;rentes s&#233;par&#233;es par une 
subordonn&#233;e ench&#226;ss&#233;e, par le processus &quot;ping-pong&quot; : &quot;ping&quot; du candidat sujet, &quot;pong&quot; 
du candidat verbe - voir en 5.2 de (Vergne, 2001) page 26. 
</p>
<p>Remarquons qu'on retrouve les 2 op&#233;rations fondamentales de l'analyse : segmenter ou bien 
r&#233;unir (dans ce cas, r&#233;unir des segments non connexes). 
</p>
<p>Processus : chaque proto-proposition est de nouveau &#233;tudi&#233;e dans l'ordre d'apparition dans la 
phrase : 
</p>
<p>1. segmentation : si la proto-proposition a &#233;t&#233; marqu&#233;e au cours du processus standard 
comme devant &#234;tre d&#233;coup&#233;e (cas [4] du processus standard), un point de coupure est 
recherch&#233;, et, s'il est trouv&#233;, la proto-proposition est remplac&#233;e par 2 proto-propositions 
qui subissent alors de nouveau chacune le processus standard, et &#233;ventuellement de 
nouveau le post-traitement ; ces segmentations n'ont pas &#233;t&#233; faites au d&#233;but du processus 
</p>
<p>                                                 
10 Voir &#224; ce sujet une &#233;tude sur corpus dans (Vergne, 1998). 
</p>
<p>69 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jacques Vergne 
</p>
<p>standard, car le nouveau point de coupure est contraint par l'&#233;tude de la proto-proposition 
dans le processus standard et la limitation de l'espace de recherche ; 
</p>
<p>2. mise en relation : si la proto-proposition est non r&#233;solue (elle n'a pas son couple sujet - 
verbe) :  
</p>
<p>- soit elle contient un sujet possible, il est alors mis en attente (&quot;ping&quot; du sujet); 
</p>
<p>- soit il y a un candidat sujet en attente, et la proto-proposition a un verbe possible 
accord&#233;, alors ces deux proto-propositions sont reli&#233;es car elles forment ensemble une 
proposition non connexe autour d'une ou plusieurs propositions ench&#226;ss&#233;es (&quot;pong&quot; du 
verbe). 
</p>
<p>4.2.1 Exemples de segmentation d'une proto-proposition  
</p>
<p>&#8226; Coupure sur le d&#233;but d'une proposition coordonn&#233;e, marqu&#233; par le motif coordination-
d&#233;terminant (processus standard puis post-traitement) 11 : 
</p>
<p> 0 : &lt;[&gt;&lt;d&gt;Toutes&#9674;ces&lt;/d&gt;&#9674;personnes&#9674;&lt;V&gt;ont&#9674;re&#231;u&#9674;&lt;d&gt;un&#9674;traitement&lt;/d&gt;&#9674; 
&lt;cc&gt;et&#9674;&lt;d&gt;aucune&#9674;&lt;/d&gt;&lt;V&gt;n'a&#9674;d&#233;velopp&#233;&#9674;&lt;d&gt;la&#9674;maladie&lt;/d&gt; 
 [nbV=2] 
</p>
<p> 1 : &lt;[.&gt;. 
 
</p>
<p> 0 : &lt;[&gt;|&lt;d&gt;Toutes&#9674;ces&lt;/d&gt;&#9674;personnes&#9674;|&lt;V&gt;ont&#9674;re&#231;u&#9674;&lt;d&gt;un&#9674;traitement&lt;/d&gt;&#9674; 
 [nbV=1 saturS=1] 
</p>
<p> 1 : &lt;[cc&gt;et&#9674;|&lt;d&gt;aucune&#9674;&lt;/d&gt;|&lt;V&gt;n'a&#9674;d&#233;velopp&#233;&#9674;&lt;d&gt;la&#9674;maladie&lt;/d&gt; 
 [nbV=1 saturS=1] 
</p>
<p> 2 : &lt;[.&gt;. 
 
</p>
<p>&#8226; Coupure sur le d&#233;but de la proposition citative, marqu&#233; par le motif virgule-d&#233;terminant 
(processus standard puis post-traitement) : 
</p>
<p> 0 : &lt;[&gt;&lt;d&gt;Several&#9674;thousand&lt;/d&gt;&#9674;reservists&#9674;&lt;p&gt;with&#9674;&quot;specialized&lt;/p&gt;&#9674;skills&quot;&#9674; 
&lt;V&gt;could&#9674;be&#9674;called&#9674;up&#9674;&lt;p&gt;in&#9674;the&#9674;next&lt;/p&gt;&#9674;few&#9674;days,&#9674;&lt;d&gt;the&#9674;official&lt;/d&gt;&#9674; 
&lt;V&gt;said 
 [nbV=2] 
</p>
<p> 1 : &lt;[.&gt;. 
 
</p>
<p> 0 : &lt;[&gt;|&lt;d&gt;Several&#9674;thousand&lt;/d&gt;&#9674;reservists&#9674;&lt;p&gt;with&#9674;&quot;specialized&lt;/p&gt;&#9674;skills&quot;&#9674; 
|&lt;V&gt;could&#9674;be&#9674;called&#9674;up&#9674;&lt;p&gt;in&#9674;the&#9674;next&lt;/p&gt;&#9674;few&#9674;days,  
 [nbV=1  saturS=1] 
</p>
<p>                                                 
11 Convention des balises et des attributs : [nbV=2] : 2 verbes d&#233;tect&#233;s (=&gt; segmentation du post-traitement),  
</p>
<p>[nbV=1 saturS=1] : 1 verbe d&#233;tect&#233;, saturation de la valence sujet = vraie,  
&lt;[cc&gt;et&#9674; : d&#233;but de proto-proposition avec une conjonction de coordination. 
</p>
<p>70 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une m&#233;thode pour l'analyse descendante et calculatoire de corpus multilingues 
</p>
<p> 1 : &lt;[&gt;|&lt;d&gt;the&#9674;official&lt;/d&gt;&#9674;|&lt;V&gt;said 
 [nbV=1  saturS=1] 
</p>
<p> 2 : &lt;[.&gt;. 
</p>
<p> 
&#8226; Coupure double : sur le d&#233;but de la proposition principale, marqu&#233; par le motif virgule-
d&#233;terminant, et sur le d&#233;but de la citative invers&#233;e, marqu&#233; par le motif guillemet-verbe 
(processus standard puis post-traitement) : 
</p>
<p> 0 : &lt;[&gt;&quot;&#9674;&lt;p&gt;Avec&#9674;des&lt;/p&gt;&#9674;frappes&#9674; 
 [nbV=0] 
</p>
<p> 1 : &lt;[cs&gt;comme&#9674;&lt;/cs&gt;celles-ci,&#9674;&lt;d&gt;les&#9674;taliban&lt;/d&gt;&#9674;&lt;V&gt;sont&#9674;rassur&#233;s&#9674;&quot;&#9674;&lt;V&gt;a&#9674; 
ironis&#233;&#9674;&lt;d&gt;le&#9674;commandant&lt;/d&gt;&#9674;Djan&#9674;Akhamat,&#9674;num&#233;ro&#9674;&lt;d&gt;deux&#9674;&lt;/d&gt;&lt;p&gt;d
es &#9674; forces&lt;/p&gt;&#9674;militaires&#9674;&lt;p&gt;du&#9674;Nord&lt;/p&gt;&#9674;&lt;p&gt;dans&#9674;la&#9674;plaine&lt;/p&gt;&#9674;&lt;p&gt;de&#9674; 
Shomali&lt;/p&gt; 
 [nbV=2] 
</p>
<p> 2 : &lt;[.&gt;. 
 
</p>
<p> 0 : &lt;[&gt;&quot;&#9674;&lt;p&gt;Avec&#9674;des&lt;/p&gt;&#9674;frappes&#9674; 
 [nbV=0] 
</p>
<p> 1 : &lt;[cs&gt;comme&#9674;&lt;/cs&gt;celles-ci,&#9674; 
 [nbV=0 saturS=0] 
</p>
<p> 2 : &lt;[&gt;|&lt;d&gt;les&#9674;taliban&lt;/d&gt;&#9674;|&lt;V&gt;sont&#9674;rassur&#233;s&#9674;&quot;&#9674; 
 [nbV=1 saturS=1] 
</p>
<p> 3 : &lt;[&gt;|&lt;V&gt;a&#9674;ironis&#233;&#9674;|&lt;d&gt;le&#9674;commandant&lt;/d&gt;&#9674;Djan&#9674;Akhamat,&#9674;num&#233;ro&#9674;&lt;d&gt;deux&#9674; 
&lt;/d&gt;&lt;p&gt;des&#9674;forces&lt;/p&gt;&#9674;militaires&#9674;&lt;p&gt;du&#9674;Nord&lt;/p&gt;&#9674;&lt;p&gt;dans&#9674;la&#9674;plaine&lt;/p
&gt;&#9674; &lt;p&gt;de&#9674;Shomali&lt;/p&gt; 
 [nbV=1 saturS=1] 
</p>
<p> 4 : &lt;[.&gt;. 
</p>
<p>4.2.2 Exemple de mise en relation de 2 proto-propositions  
</p>
<p>&#8226; Le processus standard a diagnostiqu&#233; qu'il n'y a pas de verbe dans la proto-proposition 0, ni 
dans la proto-proposition 2, autour de la (proto-)proposition relative 1 ench&#226;ss&#233;e (NB : die est 
un pronom relatif sujet - balis&#233; &lt;[pr&gt; - car il ne pr&#233;c&#232;de pas de nom, marqu&#233; par une 
majuscule en allemand) : 
</p>
<p> 0 : &lt;[&gt;&lt;d&gt;Eine&#9674;junge&#9674;S&#252;dafrikanerin&lt;/d&gt;,&#9674; 
 [nbV=0] 
</p>
<p> 1 : &lt;[pr&gt;die&#9674; &lt;/pr&gt;1969&#9674;&lt;d&gt;ein&#9674;neues&#9674;Herz&lt;/d&gt;&#9674;|&lt;V&gt;erhielt,&#9674; 
 [nbV=1   saturS=1] 
</p>
<p> 2 : &lt;[&gt;&#252;berlebte&#9674;damit&#9674;zw&#246;lf&#9674;Jahre 
 [nbV=0] 
</p>
<p>71 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jacques Vergne 
</p>
<p> 3 : &lt;[.&gt;. 
</p>
<p>&#8226; Le post-traitement provoque ensuite la mise en relation en mettant la proto-proposition 0 en 
attente comme candidat sujet singulier, puis en le reliant &#224; la proto-proposition 3 qui 
comporte un verbe singulier sans sujet (on se sert de l'accord au singulier du couple Eine -e) : 
</p>
<p> 0 : &lt;[&gt;|&lt;d&gt;Eine&#9674;junge&#9674;S&#252;dafrikanerin&lt;/d&gt;,&#9674; 
 [S_en_attente=0     lienS=2    nbV=0]  12 
</p>
<p> 1 : &lt;[pr&gt;die&#9674; &lt;/pr&gt;1969&#9674;&lt;d&gt;ein&#9674;neues&#9674;Herz&lt;/d&gt;&#9674;|&lt;V&gt;erhielt,&#9674; 
 [nbV=1   saturS=1] 
</p>
<p> 2 : &lt;[&gt;|&lt;V&gt;&#252;berlebte&#9674;damit&#9674;zw&#246;lf&#9674;Jahre 
 [lienS=0   nbV=1   saturS=1] 
</p>
<p> 3 : &lt;[.&gt;. 
</p>
<p>4.2.3 Segmentation d'une proto-proposition avec mise en relation de 2 proto-propositions  
</p>
<p>&#8226; Coupure sur le d&#233;but du chunk verbal de la principale (motif : verbe), avec mise en relation 
sujet-verbe autour d'une relative ench&#226;ss&#233;e (processus standard puis post-traitement) : 
</p>
<p> 0 : &lt;[&gt;&lt;d&gt;La&#9674;protection&lt;/d&gt; 
 [nbV=0] 
</p>
<p> 1 : &lt;[cs&gt;que&#9674;&lt;/cs&gt;&lt;pp&gt;nous&#9674;voulons&#9674;assurer&#9674;&lt;V&gt;est&#9674;&lt;d&gt;une&#9674;protection&lt;/d&gt;&#9674; 
&lt;p&gt;d'ensemble&lt;/p&gt; 
 [nbV=2] 
</p>
<p> 2 : &lt;[.&gt;. 
 
</p>
<p> 0 : &lt;[&gt;|&lt;d&gt;La&#9674;protection&lt;/d&gt;&#9674; 
 [S_en_attente=0    lienS=2    nbV=0] 
</p>
<p> 1 : &lt;[cs&gt;que&#9674;&lt;/cs&gt;&lt;pp&gt;nous&#9674;voulons&#9674;assurer&#9674; 
 [nbV=1 saturS=1] 
</p>
<p> 2 : &lt;[&gt;|&lt;V&gt;est&#9674;&lt;d&gt;une&#9674;protection&lt;/d&gt;&#9674;&lt;p&gt;d'ensemble&lt;/p&gt; 
 [lienS=0   nbV=1   saturS=1] 
</p>
<p> 3 : &lt;[.&gt;. 
</p>
<p>5 Conclusion 
</p>
<p>Nous avons pr&#233;sent&#233; une m&#233;thode pour l'analyse descendante et calculatoire de corpus 
multilingues, appliqu&#233;e au calcul des relations sujet - verbe dans les propositions. Les 
algorithmes utilis&#233;s consistent en des traitements r&#233;p&#233;titifs sur le grain minimal repr&#233;sent&#233; (ici 
la proto-proposition); ces traitements n'utilisent que les deux op&#233;rations de base des 
                                                 
12 Conventions des attributs : [S_en_attente=0 lienS=2 nbV=0] : cette proto-proposition est un sujet qui n'est 
</p>
<p>plus en attente et qui a &#233;t&#233; reli&#233; &#224; son verbe situ&#233; en proto-proposition 2. 
</p>
<p>72 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une m&#233;thode pour l'analyse descendante et calculatoire de corpus multilingues 
</p>
<p>expressions r&#233;guli&#232;res : la recherche de motif et le remplacement de motif dans le grain 
minimal repr&#233;sent&#233;. Cette m&#233;thode comporte la caract&#233;ristique tr&#232;s originale de n'utiliser que 
tr&#232;s peu de ressources lexicales et morphologiques (seulement 200 mots, locutions et 
morph&#232;mes par langue), ce qui facilite l'ajout d'une nouvelle langue. Cette nouvelle voie est 
int&#233;ressante et prometteuse : ces moyens tr&#232;s l&#233;gers ont d&#233;j&#224; abouti &#224; des r&#233;sultats de qualit&#233; 
r&#233;guli&#232;re et de bon niveau. Bien s&#251;r, il reste encore un important travail d'&#233;valuation 
comparative. Une limite actuelle est le fait que l'analyseur cherche syst&#233;matiquement une 
relation sujet-verbe, d'o&#249; des erreurs dans certaines phrases nominales. Nous pr&#233;voyons 
d'&#233;largir nos travaux &#224; des langues que nous ne connaissons pas, en dissociant le chercheur-
exp&#233;rimentateur de l'&#233;valuateur-locuteur de la langue &#233;tudi&#233;e. Les r&#233;sultats d&#233;j&#224; acquis nous 
confirment l'int&#233;r&#234;t d'ajuster au plus serr&#233; les moyens &#224; la t&#226;che, ce qui permet d'&#233;viter 
d'utiliser des outils trop g&#233;n&#233;raux ou trop volumineux, qui exploitent des propri&#233;t&#233;s et des 
donn&#233;es linguistiques disproportionn&#233;es &#224; la t&#226;che. Ainsi, nous repla&#231;ons l'&#233;tude linguistique 
pr&#233;liminaire en premi&#232;re position, &#233;tude qui doit faire &#233;merger les quelques propri&#233;t&#233;s 
n&#233;cessaires &#224; cette t&#226;che. Plus ces propri&#233;t&#233;s sont g&#233;n&#233;rales, profondes et ind&#233;pendantes des 
langues, plus la solution est robuste, rapide et facile &#224; mettre en &#339;uvre. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>Abney S. (1991), Parsing by Chunks, In : Robert Berwick, Steven Abney and Carol Tenny 
(eds.), Principle-Based Parsing, Dordrecht, Kluwer Academic Publishers. 
 (http://www.sfs.nphil.uni-tuebingen.de/~abney/Abney_90e.ps.gz) 
</p>
<p>D&#233;jean H. (1998), Concepts et algorithmes pour la d&#233;couverte des structures formelles des 
langues, Th&#232;se de doctorat de l'Universit&#233; de Caen.   
 (http://www.info.unicaen.fr/~dejean/these/) 
</p>
<p>Ejerhed E. (1996), Finite state segmentation of discourse into clauses, Actes de ECAI'96 
Workshop Extended finite state models of language, A. Kornai (Ed.), .24-33.  
 (http://www.kornai.com/ECAI/ejerhed.html) 
</p>
<p>Giguet E. (1998), M&#233;thode pour l'analyse automatique de structures formelle sur documents 
multilingues, Th&#232;se de doctorat de l'Universit&#233; de Caen. 
 (http://www.info.unicaen.fr/~giguet/these/) 
</p>
<p>Lebarb&#233; T. (2002), Hi&#233;rarchie Inclusive des Unit&#233;s Linguistiques en Analyse Syntaxique 
Coop&#233;rative ; Un &quot;segment&quot; entre chunk et phrase dans le traitement linguistique par syst&#232;me 
multi-agents, Th&#232;se de doctorat de l'Universit&#233; de Caen (soutenance pr&#233;vue en mai 2002). 
</p>
<p>Lucas N., Giguet E., Vergne J. (2001), D&#233;tection automatique de la citation et du discours 
rapport&#233; dans les textes informatifs, Actes de Le discours rapport&#233; dans tous ses &#233;tats : 
Question de fronti&#232;res, Bruxelles, &#224; para&#238;tre. 
</p>
<p>Rosmorduc, S. (1994). Analyse morpho-syntaxique de textes non ponctu&#233;s, application aux 
textes hi&#233;roglyphiques, Th&#232;se de doctorat de l'&#201;cole normale sup&#233;rieure de Cachan. 
</p>
<p>Vannier G. (1999), &#201;tude des contributions des structures textuelles et syntaxiques pour la 
prosodie : application &#224; un syst&#232;me de synth&#232;se vocale &#224; partir du texte, Th&#232;se de doctorat de 
l'Universit&#233; de Caen. 
</p>
<p>73 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jacques Vergne 
</p>
<p>74 
</p>
<p> (http://www.info.unicaen.fr/~vannier/Pages/Travail/these.htm) 
</p>
<p>Vergne J. (1998), Entre arbre de d&#233;pendance et ordre lin&#233;aire, les deux processus de 
transformation : lin&#233;arisation, puis reconstruction de l'arbre, Les Cahiers de Grammaire, n&#176; 
23, pp. 95-136. 
 (http://www.info.unicaen.fr/~jvergne/Cahiers_de_Grammaire_Vergne.pdf) 
</p>
<p>Vergne J. (2000), Trends in Robust Parsing, tutoriel du CoLing 2000, Nancy, Sarrebr&#252;ck. 
 (http://www.info.unicaen.fr/~jvergne/tutorialColing2000.html) 
</p>
<p>Vergne J. (2001), Analyse syntaxique automatique de langues : du combinatoire au 
calculatoire, Actes de TALN 2001, 15-29. 
 (http://www.info.unicaen.fr/~jvergne/TALN2001_JV.ppt.zip) </p>

</div></div>
</body></html>