<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Webaffix : un outil d&#8217;acquisition morphologique d&#233;rivationnelle &#224; partir duWeb</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Webaffix : un outil d&#8217;acquisition morphologique
d&#233;rivationnelle &#224; partir du Web
</p>
<p>Ludovic Tanguy &amp; Nabil Hathout
ERSS &#8211; CNRS &amp; Universit&#233; de Toulouse Le Mirail
</p>
<p>{tanguy, hathout}@univ-tlse2.fr
</p>
<p>R&#233;sum&#233; - Abstract
L&#8217;article pr&#233;sente Webaffix, un outil d&#8217;acquisition de couples de lex&#232;mes morphologiquement
apparent&#233;s &#224; partir du Web. La m&#233;thode utilis&#233; est inductive et ind&#233;pendante des langues parti-
culi&#232;res. Webaffix (1) utilise un moteur de recherche pour collecter des formes candidates qui
contiennent un suffixe graph&#233;mique donn&#233;, (2) pr&#233;dit les bases potentielles de ces candidats
et (3) recherche sur le Web des cooccurrences des candidats et de leurs bases pr&#233;dites. L&#8217;ou-
til a &#233;t&#233; utilis&#233; pour enrichir Verbaction, un lexique de liens entre verbes et noms d&#8217;action ou
d&#8217;&#233;v&#233;nement correspondants. L&#8217;article inclut une &#233;valuation des liens morphologiques acquis.
</p>
<p>This paper presents Webaffix, a tool for finding pairs of morphologically related words on the
Web. The method used is inductive and language-independent. Using the WWW as a corpus, the
Webaffix tool detects the occurrences of new derived lexemes based on a given graphemic suffix,
proposes a base lexeme, and then performs a compatibility test on the word pairs produced,
using the Web again, but as a source of cooccurrences. The resulting pairs of words are used to
enrich the Verbaction lexical database, which contains French verbs and their related nominals.
The results are described and evaluated.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Morphologie d&#233;rivationnelle, ressource lexicale, Web comme corpus, analogie.
Derivational morphology, lexical resource, Web as corpus, analogy.
</p>
<p>1 Introduction
Ce travail s&#8217;inscrit dans le cadre g&#233;n&#233;ral du d&#233;veloppement de ressources lexicales pouvant &#234;tre
utilis&#233;es dans diff&#233;rentes applications du TAL. L&#8217;exemple qui nous a servi de tremplin est le
lexique Verbaction1 qui contient 6 471 couples verbe:nom, tels que le nom est morphologique-
ment apparent&#233; au verbe et qu&#8217;il d&#233;note l&#8217;action ou l&#8217;&#233;v&#233;nement correspondant &#224; ce verbe. Il
s&#8217;agit d&#8217;une ressource lexicale g&#233;n&#233;rique dont des exemples d&#8217;utilisation seront pr&#233;sent&#233;s ci-
dessous. Notre but initial est d&#8217;&#233;tendre ce lexique, en y ajoutant des liens morphologiques entre
</p>
<p>1Ce lexique a &#233;t&#233; r&#233;alis&#233; &#224; l&#8217;INaLF (CNRS, USR705) &#224; partir de TLFnome, en 1997, par A. Berche, F. Mougin,
N. Hathout et J. Lecomte. TLFnome est un lexique de formes fl&#233;chies construit &#224; l&#8217;INaLF par J. Maucourt et M.
Papin, &#224; partir de la nomenclature du Tr&#233;sor de la Langue Fran&#231;aise (TLF).
</p>
<p>245</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ludovic Tanguy &amp; Nabil Hathout
</p>
<p>des lex&#232;mes moins courants, voire des n&#233;ologismes, et en travaillant pour ce faire sur corpus.
Mais plut&#244;t que d&#8217;exploiter un corpus &#171; traditionnel &#187; comme les archives &#233;lectroniques de jour-
naux (Le Monde, Lib&#233;ration, etc.), nous avons pr&#233;f&#233;r&#233; utiliser le Web comme corpus. Ce choix,
ais&#233;ment justifiable par la masse d&#8217;information textuelle disponible, rend toutefois n&#233;cessaire
de prendre un certain nombre de pr&#233;cautions, ce corpus &#233;tant caract&#233;ris&#233; par son h&#233;t&#233;rog&#233;n&#233;it&#233;
et le manque de contr&#244;le sur son contenu.
</p>
<p>2 Vue d&#8217;ensemble
</p>
<p>Recherche de
nouvelles formes
</p>
<p>Liste de formes candidates
</p>
<p>Pr&#233;diction des bases
</p>
<p>Liste de couples candidat:base&#8722;pr&#233;dite
</p>
<p>les cooccurrences
</p>
<p>WWW
</p>
<p>WWW
</p>
<p>Liste de couples filtr&#233;e
</p>
<p>Liste de r&#233;f&#233;rence
</p>
<p>Base d&#8217;amor&#231;age
</p>
<p>R&#232;gles de pr&#233;diction
</p>
<p>Filtrage par
</p>
<p>Lexique flexionnel
</p>
<p>FIG. 1 &#8211; Vue d&#8217;ensemble des modules de Webaffix.
</p>
<p>Notre m&#233;thode est repr&#233;sent&#233;e graphiquement en figure 1. Elle peut se r&#233;sumer de la fa&#231;on sui-
vante : nous recherchons sur le Web, &#224; l&#8217;aide d&#8217;un moteur de recherche g&#233;n&#233;raliste, des formes
lexicales nouvelles, en fonction de leur terminaison (en fait, d&#8217;un suffixe graph&#233;mique donn&#233;).
Par &#171; nouvelles &#187;, nous entendons simplement absentes d&#8217;une liste de r&#233;f&#233;rence, par exemple un
lexique &#233;lectronique. Les terminaisons s&#233;lectionn&#233;es pour l&#8217;enrichissement de Verbaction sont
les principaux suffixes qui permettent de construire des noms d&#8217;action et d&#8217;&#233;v&#233;nement &#224; partir
de verbes (-ade, -age, -ance, -ement, -ence, -erie, -tion). On trouve ainsi par exemple comme
formes candidates d&#233;rushage, h&#233;litreuillage pour -age, ou judiciarisation ou ic&#244;nification pour
-tion. Une fois ces nouvelles formes collect&#233;es, nous calculons pour chacune d&#8217;elles des formes
graph&#233;miques susceptibles d&#8217;&#234;tre des formes fl&#233;chies du lex&#232;me base du candidat. Cette pr&#233;-
diction est r&#233;alis&#233;e par analogie avec une base d&#233;rivationnelle existante (comme Verbaction),
ou bien &#224; l&#8217;aide d&#8217;un ensemble de r&#232;gles d&#8217;affixation apprises &#224; partir d&#8217;un lexique flexionnel,
par exemple, en utilisant la technique propos&#233;e dans D&#233;Cor (Dal et al. 1999). Dans le cas de
notre exp&#233;rience, les formes candidates sont suppos&#233;es nominales et les formes bases verbales
sont calcul&#233;es en utilisant Verbaction. Nous pr&#233;disons par exemple, pour le candidat ic&#244;nifica-
tion, les formes ic&#244;nifiait, ic&#244;nifiant, ic&#244;nifie, ic&#244;nifient, ic&#244;nifier, ic&#244;nifiera... de son lex&#232;me
base. Enfin, dans une troisi&#232;me &#233;tape, nous filtrons les couples lex&#232;me-candidat:lex&#232;me-base-
pr&#233;dit ainsi constitu&#233;s en recherchant, toujours sur le Web, &#224; l&#8217;aide d&#8217;un moteur de recherche,
des cooccurrences dans une m&#234;me page des formes des deux lex&#232;mes du couple candidat. Ne
retenant que les couples pour lesquels une telle cooccurrence a &#233;t&#233; trouv&#233;e, nous proc&#233;dons &#224;
une r&#233;vision manuelle finale, grandement facilit&#233;e par le fait que les contextes des formes co-
</p>
<p>246</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Webaffix
</p>
<p>occurrentes sont conserv&#233;s par la derni&#232;re &#233;tape. Notre but n&#8217;est pas ici d&#8217;obtenir, dans la base
de donn&#233;es construite in fine, une couverture la plus large possible, mais plut&#244;t de garantir une
bonne pr&#233;cision dans les r&#233;sultats obtenus.
</p>
<p>La m&#233;thode que nous proposons est assez proche de celle impl&#233;ment&#233;e dans G&#233;D&#233;riF (Dal et
Namer 2000). Cet outil g&#233;n&#232;re un ensemble de mots possibles candidats &#224; partir d&#8217;un lexique
puis les filtre pour ne conserver que ceux qui sont attest&#233;s en particulier sur le Web. Comme pour
Webaffix, le traitement comporte trois &#233;tapes : un ensemble de radicaux est constitu&#233; en analy-
sant les lemmes du lexique en -able et en -iser &#224; l&#8217;aide de l&#8217;analyseur morphologique D&#233;riF ; il
concat&#232;ne ensuite &#224; ces lemmes les -able, -iser et -it&#233; (compl&#233;mentaire avec la terminaison ori-
ginale du radical) ; G&#233;D&#233;riF filtre les candidats obtenus en recherchant leurs attestations &#233;ven-
tuelles dans des corpus textuels et sur le Web en utilisant le moteur www.yahoo.fr. L&#8217;objectif
de G&#233;D&#233;riF est plus th&#233;orique que le n&#244;tre dans la mesure o&#249; la construction de lex&#232;mes en -
abiliser, -abilit&#233;, -isable, -isabilit&#233;... vise autant &#224; valider les hypoth&#232;ses linguistiques propos&#233;es
par les autrices qu&#8217;&#224; construire un ensemble de micro-familles constructionnelles.
</p>
<p>Il est &#224; noter d&#232;s &#224; pr&#233;sent que cette m&#233;thode ne demande pour son &#233;tablissement que peu de
ressources : une liste de r&#233;f&#233;rence permettant de filtrer les unit&#233;s d&#233;j&#224; r&#233;pertori&#233;es pour la pre-
mi&#232;re &#233;tape ; et pour la deuxi&#232;me &#233;tape, un ensemble de r&#232;gles ou de sch&#233;mas d&#233;rivationnels
et flexionnels appris &#224; partir d&#8217;une &#233;ventuelle base existante et d&#8217;un lexique de formes fl&#233;chies.
Aucune connaissance linguistique n&#8217;&#233;tant impl&#233;ment&#233;e dans l&#8217;outil, il est adapt&#233; &#224; l&#8217;acquisition
d&#8217;autres types de liens morphologiques (nom:adjectif, adjectif:adverbe...), mais aussi d&#8217;autres
langues &#224; morphologie concat&#233;native comme les langues romanes et germaniques. Par ailleurs,
cette m&#233;thode est incr&#233;mentale : Webaffix est destin&#233; &#224; &#234;tre r&#233;guli&#232;rement appliqu&#233; sur le Web,
profitant de l&#8217;accumulation de l&#8217;information obtenue lors de passages pr&#233;c&#233;dents, et de la dyna-
mique des bases de documents index&#233;s par les moteurs de recherche.
</p>
<p>3 Le lexique Verbaction
</p>
<p>Les ressources que Webaffix permet de constituer sont du type du lexique Verbaction. Cette
base est avant tout une ressource pour le TAL destin&#233;e au traitement des variations morpho-
syntaxiques (Jacquemin 1997). Les hypoth&#232;ses th&#233;oriques sous-jacentes sont minimales. Au-
cune distinction n&#8217;est faite entre les conversions et les constructions suffixales dans la mesure
o&#249; la nature de converti ou de suffix&#233; n&#8217;est pas prise en compte par les syst&#232;mes qui utilisent
cette ressource (seule compte la relation s&#233;mantique entre le verbe et le nom). Les liens s&#233;man-
tiques sp&#233;cifiques entre noms et verbes ne sont pas explicit&#233;s. Le principe est ici seulement de
r&#233;pertorier des liens s&#233;mantiques entre un verbe et un nom d&#8217;action ou d&#8217;&#233;v&#233;nement auquel il
est d&#233;rivationnellement apparent&#233; comme &#233;lire:&#233;lection, d&#233;m&#233;nager:d&#233;m&#233;nagement... Ce type
de ressource est utile &#224; divers titres. Nous nous donnons ici quelques exemples de son utilisation.
</p>
<p>En recherche d&#8217;information, l&#8217;&#233;quivalence s&#233;mantique des variantes morpho-syntaxiques peut
ais&#233;ment &#234;tre utilis&#233;e pour l&#8217;extension de requ&#234;tes. Par exemple, rechercher &#233;lection pr&#233;siden-
tielle est &#233;quivalent, en RI, &#224; rechercher &#233;lire le pr&#233;sident.
</p>
<p>En analyse syntaxique automatique, certaines relations argumentales peuvent &#234;tre partag&#233;es
par les pr&#233;dicats nominaux et verbaux. L&#8217;analyseur syntaxique Syntex (Bourigault et Fabre
2000) utilise dans sa proc&#233;dure d&#8217;apprentissage endog&#232;ne les liens contenus dans le lexique
Verbaction pour rep&#233;rer ce type de partage. Par exemple, la pr&#233;sence d&#8217;un SN comme des ph&#233;-
nom&#232;nes de transport sur coussin d&#8217;air emprisonn&#233; est un indice en faveur du rattachement de
</p>
<p>247</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ludovic Tanguy &amp; Nabil Hathout
</p>
<p>sur le fond au verbe transporter dans les vagues transportent des sables sur le fond. 2
Toutes ces utilisations visent donc &#224; ajouter une annotation suppl&#233;mentaire d&#8217;un corpus (pr&#233;ala-
blement &#233;tiquet&#233; morphosyntaxiquement), et celle-ci sera d&#8217;autant plus compl&#232;te que le lexique
recensant ces relations morphologiques sera plus &#233;tendu.
</p>
<p>4 Le Web comme corpus
</p>
<p>Le corpus sur lequel porte notre &#233;tude, et notre recherche d&#8217;unit&#233;s et d&#8217;informations lexicales,
est le Web, et non un corpus classique. Comme le note Grefenstette (1999), nombre de lin-
guistes peuvent, &#224; juste titre, se montrer r&#233;ticents &#224; utiliser le Web comme source d&#8217;attestations,
&#233;tant donn&#233; l&#8217;impossibilit&#233; technique de caract&#233;riser les pages sur le plan du domaine, du genre,
du statut de l&#8217;auteur, de la validit&#233; du contenu, etc. Il n&#8217;en reste pas moins que le Web constitue
actuellement la masse textuelle accessible la plus importante.
</p>
<p>L&#8217;utilisation du Web comme corpus se g&#233;n&#233;ralise. Signalons, par exemple, le projet Web-
Corp (http://www.webcorp.org.uk) qui met la technologie de base d&#8217;un concordancier
&#224; l&#8217;&#233;chelle du Web, en se fiant &#224; plusieurs moteurs de recherche g&#233;n&#233;riques. Ces moteurs restent
de toute fa&#231;on le seul moyen d&#8217;acc&#232;s au Web, &#224; moins de d&#233;velopper un syst&#232;me de parcours
et d&#8217;indexation sp&#233;cifique, qui ne pourra de toute fa&#231;on pas pr&#233;tendre &#224; l&#8217;exhaustivit&#233; d&#8217;un
GoogleTM et autre AltaVistaTM. Notre approche n&#8217;&#233;chappe pas &#224; ce filtre, et nous ne travaillons,
comme tous les autres &#171; webolinguistes &#187;, que sur la partie du Web (dont la proportion est
d&#8217;ailleurs inconnue) index&#233;e par ces moteurs, et donc sur un sous-ensemble des pages acces-
sible qui varie avec le temps, et sur lequel aucun crit&#232;re de s&#233;lection fiable n&#8217;est applicable.
</p>
<p>La question se pose alors du type d&#8217;&#233;tudes sur corpus pour lesquelles le recours au Web est
justifi&#233;. Les &#233;tudes actuelles vont du rep&#233;rage d&#8217;entit&#233;s nomm&#233;es (Jacquemin et Bush 2000) &#224;
l&#8217;&#233;tude de textes parall&#232;les bilingues (Resnik 1999), et en r&#232;gle g&#233;n&#233;rale se limitent &#224; l&#8217;&#233;tude
d&#8217;unit&#233;s lexicales en utilisant des extracteurs de contextes et des mesures de cooccurrence. Il
para&#238;t en effet plus d&#233;licat de mener des &#233;tudes relevant de la syntaxe ou de la s&#233;mantique sur
un corpus aussi &#171; incontr&#244;lable &#187;, et pour lequel on dispose de si peu d&#8217;informations.
</p>
<p>Nous nous situons ici dans le cadre de la morphologie, avec comme but affich&#233; de constituer
des ressources facilement r&#233;utilisables. Nous proposons une m&#233;thode permettant de construire
des bases de donn&#233;es lexicales, dont la couverture va croissante, et dont le contenu peut &#234;tre
suppos&#233; ind&#233;pendant d&#8217;un domaine particulier3. Puisque nous nous concentrons sur des unit&#233;s
non r&#233;f&#233;renc&#233;es dans des dictionnaires usuels, les unit&#233;s que nous recueillons rel&#232;vent soit de
la cr&#233;ation lexicale spontan&#233;e et &#233;ph&#233;m&#232;re, soit de langues de sp&#233;cialit&#233;. Dans tous les cas, leur
description et leur accumulation, apr&#232;s r&#233;vision manuelle, constitue une ressource ais&#233;ment uti-
lisable et utile pour divers traitements des textes en TAL (cf. &#167;3). Notre hypoth&#232;se de travail sera
donc minimale, et ne suppose qu&#8217;un comportement linguistique tr&#232;s g&#233;n&#233;ral sur le mode de for-
mation et d&#8217;usage des unit&#233;s lexicales construites, ind&#233;pendante du type de texte et du domaine
dans lesquels ces constructions apparaissent (&#224; quelques exceptions pr&#232;s, certains documents
disponibles sur le Web ayant un statut particulier, comme nous l&#8217;explicitons en &#167;8).
</p>
<p>2Ces exemples sont emprunt&#233;s &#224; (Hathout et Fabre 2002).
3Il existe un biais dont nous devons prendre conscience : il est illusoire de penser que le Web serait un corpus
</p>
<p>de &#171; langue g&#233;n&#233;rale &#187;. Si la vari&#233;t&#233; des domaines abord&#233;s, et donc des sous-langages de sp&#233;cialit&#233; repr&#233;sent&#233;s peut
para&#238;tre suffisante, nous n&#8217;avons pas d&#8217;id&#233;e claire de la repr&#233;sentation de chacun de ces domaines. En attendant la
mise en place de proc&#233;dures g&#233;n&#233;riques de profilage et de caract&#233;risation des pages Web, comme celle propos&#233;e
que le projet TyPWEB (Beaudouin et al. 2001) nous nous contentons de ce qui est disponible.
</p>
<p>248</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Webaffix
</p>
<p>5 La cooccurrence des lex&#232;mes construits et des lex&#232;mes bases
(Baayen et Neijt 1997) ont montr&#233; que les contextes des mots d&#233;riv&#233;s contiennent fr&#233;quemment
des &#171; ancres &#187; c&#8217;est-&#224;-dire des indices qui facilitent leur interpr&#233;tation. C&#8217;est ainsi que les mots
d&#233;riv&#233;s apparaissent r&#233;guli&#232;rement pr&#233;c&#233;d&#233;s (et plus rarement suivis) d&#8217;une forme du lex&#232;me
sur lequel ils sont construits.
</p>
<p>La pr&#233;sence du lex&#232;me base dans le contexte peut relever de la coop&#233;ration conversationnelle :
il s&#8217;agit alors de fournir des &#233;l&#233;ments permettant d&#8217;interpr&#233;ter le d&#233;riv&#233; en le mettant en relation
avec sa base. Si la d&#233;rivation morphologique est un moyen d&#8217;exprimer des notions complexes
de mani&#232;re concise, on peut n&#233;anmoins supposer qu&#8217;en fran&#231;ais comme dans d&#8217;autres langues,
elle permet assurer la continuit&#233; th&#233;matique et r&#233;f&#233;rentielle dans le discours mais aussi d&#8217;&#233;viter
les r&#233;p&#233;titions et m&#234;me de varier la fa&#231;on dont les id&#233;es sont pr&#233;sent&#233;es et d&#233;velopp&#233;es. Dans
tous ces cas, on peut faire l&#8217;hypoth&#232;se que les lex&#232;mes construits peuvent &#234;tre utilis&#233;s pour pa-
raphraser leurs lex&#232;mes bases. La cooccurrence des deux lex&#232;mes est ainsi pr&#233;visible sans &#234;tre
syst&#233;matique. Cette observation a &#233;t&#233; exploit&#233;e en RI par (Xu et Croft 1998) pour filtrer des
appariements morphologiques produits par un raciniseur. Le filtrage est bas&#233; sur une variante
de la mesure d&#8217;information mutuelle attendue (EMIM ; Expected Mutual Information Measure)
calcul&#233;e entre des formes morphologiquement apparent&#233;es cooccurrentes dans des fen&#234;tres de
200 mots. En nous appuyant sur cette m&#234;me observation, nous proposons une technique simple
permettant des liens morphologiques, en l&#8217;occurrence des couples de lex&#232;mes d&#233;rivationnel-
lement apparent&#233;s. Il s&#8217;agit d&#8217;explorer le Web pour y chercher des pages qui contiennent des
formes des deux lex&#232;mes qui composent le lien.
</p>
<p>Les formes de la base potentielle &#233;tant pr&#233;dites (cf. &#167;7), leur attestation est un premier indice
du caract&#232;re construit du lex&#232;me candidat &#8212;Webaffix rejoint sur ce point G&#233;D&#233;riF. Par ailleurs,
la cooccurrence des formes du lex&#232;me candidat et de la base pr&#233;dite constitue un indice fort
de l&#8217;existence d&#8217;une relation s&#233;mantique entre ces deux unit&#233;s. La nature exacte de cette rela-
tion n&#8217;est cependant pas connue, m&#234;me s&#8217;il est probable qu&#8217;elle corresponde au sens associ&#233; &#224;
l&#8217;affixe dont on a fait l&#8217;hypoth&#232;se de la pr&#233;sence pour pr&#233;dire le lex&#232;me base.
</p>
<p>Dans les trois sections suivantes, nous d&#233;crivons en d&#233;tails la m&#233;thode employ&#233;e par Webaffix
pour collecter et filtrer des informations morphologiques d&#233;rivationnelle en explorant le Web.
</p>
<p>6 Premi&#232;re &#233;tape : recherche de nouvelles formes sur le Web
Le but de la premi&#232;re &#233;tape est de constituer un ensemble de formes se terminant par un suffixe
graph&#233;mique donn&#233;, et qui n&#8217;appartiennent pas un lexique de r&#233;f&#233;rence. Pour compl&#233;ter Ver-
baction, nous avons utilis&#233; le lexique TLFnome, mais l&#8217;on peut aussi partir des listes de formes
accessibles sur le Web. Webaffix peut aussi fonctionner sans lexique de r&#233;f&#233;rence mais un im-
portant travail de d&#233;pouillement initial est alors n&#233;cessaire ainsi qu&#8217;une application r&#233;p&#233;t&#233;e de
la m&#233;thode afin d&#8217;obtenir un noyau de base.
</p>
<p>Comme pour chaque utilisation du Web comme corpus, il est imp&#233;ratif de prendre en compte
les sp&#233;cificit&#233;s et les limites des moteurs de recherche. Dans notre cas, la recherche est bas&#233;e
uniquement sur la terminaison des formes. Peu de moteurs proposent cette fonctionnalit&#233;, tr&#232;s
co&#251;teuse en temps de calcul et d&#8217;une utilit&#233; jug&#233;e faible pour l&#8217;usage classique des moteurs par
les internautes. &#192; notre connaissance, seuls NorthernLightTM et AltaVista offrent un tel service4.
</p>
<p>4http://www.northernlight.com et http://www.altavista.com
</p>
<p>249</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ludovic Tanguy &amp; Nabil Hathout
</p>
<p>Ces deux moteurs imposent toutefois de sp&#233;cifier un nombre minimum de lettres &#224; l&#8217;initiale de
la cha&#238;ne recherch&#233;e : quatre pour NorthernLight et trois pour Altavista. Par exemple, pour
rechercher les formes en -tion, on doit soumettre dans le cas d&#8217;AltaVista un ensemble de sous-
requ&#234;tes : aba*tion, abc*tion, ..., zyt*tion. Les trigrammes initiaux peuvent &#234;tre g&#233;n&#233;r&#233;s
en &#233;num&#233;rant les 60 000 combinaisons de trois des caract&#232;res du fran&#231;ais (lettres accentu&#233;es
comprises). Une r&#233;ponse plus &#233;conomique consiste &#224; se limiter aux seules s&#233;quences qui se
trouvent &#224; l&#8217;initiale des entr&#233;es de notre lexique de r&#233;f&#233;rence, le nombre de trigrammes est ainsi
r&#233;duit &#224; 3 500. Les sous-requ&#234;tes sont compl&#233;t&#233;es en interdisant les r&#233;ponses d&#233;j&#224; pr&#233;sentes
dans notre liste de r&#233;f&#233;rence. Par exemple, nous interdisons la pr&#233;sence de la forme ablation
dans les pages ramen&#233;es par la sous-requ&#234;te abl*tion. Ce premier filtrage se fait en utilisant
les fonctionnalit&#233;s du langage de requ&#234;te du moteur AltaVista5. Enfin, nous restreignons la
recherche aux pages index&#233;es par le moteur comme &#233;tant r&#233;dig&#233;es en fran&#231;ais. Ce dernier crit&#232;re
n&#8217;est pas enti&#232;rement fiable, comme il sera pr&#233;cis&#233; en &#167;9.1.
Les pages fournies en r&#233;ponse par le moteur sont ensuite analys&#233;es une &#224; une. Pour chaque
sous-requ&#234;te, vingt pages sont consid&#233;r&#233;es au maximum. Elles sont rapatri&#233;es et analys&#233;es par
Webaffix, car le moteur ne fournit pas la forme qui a motiv&#233; leur s&#233;lection. Un filtrage im-
portant doit &#234;tre effectu&#233; sur ces r&#233;ponses pour &#233;liminer le bruit. Les erreurs ont des origines
diverses : fautes de frappe et d&#8217;orthographe ; segments de textes en langue &#233;trang&#232;re ; noms
propres ; adresses de courrier &#233;lectronique ; segments d&#8217;URL ; noms de variables ou de fonc-
tions des langages de scripts ; noms de fichiers ; extraits de code informatique... Des m&#233;thodes
sp&#233;cifiques sont employ&#233;es pour chacun de ces probl&#232;mes. Un mini-correcteur orthographique,
g&#233;rant essentiellement les probl&#232;mes d&#8217;accentuation, de redoublement de lettres, et de concat&#233;-
nation de mots, a &#233;t&#233; mis en place. Pour les noms propres et les variables de code, nous nous
appuyons sur la casse (nous ne retenons que les mots compos&#233;s uniquement en minuscule) et
sur les caract&#232;res environnants la cha&#238;ne rep&#233;r&#233;e (/, @, $...). Enfin, pour identifier les pages
et les segments r&#233;dig&#233;s dans des langues autres que le fran&#231;ais6, nous utilisons une proc&#233;dure
de d&#233;tection bas&#233;e sur le rep&#233;rage, dans le voisinage de la forme candidate, de mots-outils de
langues &#171; parasites &#187; &#8212;actuellement, l&#8217;anglais, l&#8217;allemand, l&#8217;espagnol et l&#8217;italien. Par ailleurs,
une partie non n&#233;gligeable des liens retourn&#233;s par le moteur de recherche sont obsol&#232;tes : page
inexistante ou ne contenant pas (ou plus) l&#8217;unit&#233; qui a servi &#224; l&#8217;indexer. C&#8217;est notamment le
cas des p&#233;riodiques en ligne, dont les pages changent r&#233;guli&#232;rement de contenu mais pas de
r&#233;f&#233;rence dans l&#8217;index.
</p>
<p>Le temps total de calcul n&#233;cessaire &#224; la collecte des formes candidates (cf. figure 1) est d&#8217;environ
40 heures par suffixe, le facteur limitant &#233;tant le d&#233;bit de la connexion Internet. Toutes les
donn&#233;es pr&#233;sent&#233;es dans le pr&#233;sent article ont &#233;t&#233; obtenues en interrogeant AltaVista entre le
28 Janvier et le 4 F&#233;vrier 2002. Le tableau 1 r&#233;sume les r&#233;sultats globaux de la premi&#232;re &#233;tape.
Les op&#233;rations de filtrage cit&#233;es plus haut &#233;liminent environs 60% des formes candidates. La
r&#233;partition des diff&#233;rentes causes de rejet de ces occurrences7 est pr&#233;sent&#233;e dans le tableau 2.
</p>
<p>5L&#8217;interdiction des formes de TLFnome peut bien s&#251;r entra&#238;ner le rejet de certaines occurrences, dans le cas
exceptionnel o&#249; une forme du lex&#232;me construit candidat appara&#238;t dans la m&#234;me page qu&#8217;une forme de la liste de
r&#233;f&#233;rence ayant les m&#234;mes lettres &#224; l&#8217;initiale et en finale. Toutefois, la r&#233;duction du rapport signal/bruit est telle
que nous pr&#233;f&#233;rons courir le risque de manquer ces quelques occurrences pour ne pas avoir &#224; en filtrer par la suite
plusieurs dizaines de milliers.
</p>
<p>6En effet, les moteurs de recherche n&#8217;attribuent qu&#8217;une seule langue &#224; chaque document index&#233;, et peuvent ainsi
d&#233;clarer comme francophones des pages bilingues, ou r&#233;dig&#233;es en latin, occitan, picard, ancien fran&#231;ais...
</p>
<p>7Dans les cas d&#8217;absence du candidat dans la page et de lien obsol&#232;te, nous consid&#233;rons que chaque r&#233;ponse
d&#8217;AltaVista concerne une occurrence seulement. Ceci n&#8217;est bien s&#251;r pas toujours le cas, certaines pages peuvent
contenir plusieurs occurrences de formes r&#233;pondant au sch&#233;ma recherch&#233;.
</p>
<p>250</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Webaffix
</p>
<p>Suffixe -ade -age -ance -ement -ence -erie -tion Total
Pages analys&#233;es 11 618 22 599 15 132 19 528 9 945 12 951 27 664 120 170
Occurrences retenues 2 507 9 962 4 093 10 857 3 503 2 979 12 162 47 429
Noms candidats 813 2 189 1 097 3 791 999 995 3 564 13 448
</p>
<p>TAB. 1 &#8211; R&#233;sultats globaux du premier module.
Suffixe -ade -age -ance -ement -ence -erie -tion Moyenne
Code informatique 6,0 7,2 12,5 3,2 8,0 2,7 5,2 6,3
Absence de la page 26,7 39,1 37,5 42,7 37,2 35,9 36,9 37,0
Mot en majuscules 57,0 39,8 37,8 34,0 39,5 50,1 40,7 41,9
Langue &#233;trang&#232;re 1,8 3,3 3,3 3,5 4,3 0,4 7,0 4,0
Liens obsol&#232;tes 8,1 7,9 7,6 10,4 9,5 8,6 8,0 8,4
Faute d&#8217;orthographe simple 0,3 2,7 1,4 6,1 1,6 2,4 2,3 2,5
</p>
<p>TAB. 2 &#8211; R&#233;partition par suffixe des op&#233;rations de filtrage (en pourcentage d&#8217;occurrences).
</p>
<p>7 Pr&#233;diction des formes des lex&#232;mes bases
(cr&#233;nelage OR cr&#233;nelages) AND (cr&#233;nela OR cr&#233;nelai OR cr&#233;nelaient OR
cr&#233;nelais OR cr&#233;nelait OR cr&#233;nelant OR ... OR cr&#233;neler OR cr&#233;nelez OR
cr&#233;neliez OR cr&#233;nelions OR cr&#233;nelle OR cr&#233;nellent OR cr&#233;nellera OR ...
OR cr&#233;nelleront OR cr&#233;nelles OR cr&#233;nelons OR ... OR cr&#233;nel&#233; OR cr&#233;nel&#233;e
OR cr&#233;nel&#233;es OR cr&#233;nel&#233;s OR cr&#233;n&#232;le OR cr&#233;n&#232;lent OR cr&#233;n&#232;lera OR ... OR
cr&#233;n&#232;leront OR cr&#233;n&#232;les)
</p>
<p>FIG. 2 &#8211; Requ&#234;te construite pour le candidat cr&#233;nelage par analogie avec agnelage:agneler.
</p>
<p>Le lexique Verbaction permet de pr&#233;dire les formes fl&#233;chies des verbes susceptibles d&#8217;&#234;tre les
bases des formes candidates fournies par le premier module. La pr&#233;diction s&#8217;appuie sur un en-
semble de sch&#233;mas de suffixation sp&#233;cifiques &#224; chaque suffixe, appris en extrayant de Verbaction
les couples de lemmes dont le nom se termine par ce suffixe ; on g&#233;n&#232;re ensuite l&#8217;ensemble des
couples de formes fl&#233;chies correspondant en utilisant TLFnome. Les membres de ces couples
sont munis de leurs cat&#233;gories morphosyntaxiques. On applique ensuite une technique similaire
&#224; celle de (Dal et al. 1999) : un ensemble de sch&#233;mas bruts est constitu&#233; en supprimant dans
chaque couple le pr&#233;fixe graph&#233;mique commun &#224; ses deux formes (le pr&#233;fixe doit comporter
au moins trois caract&#232;res) et on retient le sch&#233;ma brut le plus fr&#233;quent. Les sch&#233;mas retenus
sont alors appliqu&#233;s aux formes candidates. Pour chacune des cat&#233;gories morphosyntaxique
de formes &#224; pr&#233;dire, et pour chaque forme candidate, on identifie le plus long suffixe de cette
derni&#232;re qui appara&#238;t dans un sch&#233;ma de suffixation. On applique ensuite &#224; la forme candidate
l&#8217;ensemble des sch&#233;mas qui contiennent ce suffixe. Le choix de travailler directement sur des
formes fl&#233;chies pr&#233;sente un avantage important : il permet de pr&#233;dire pour une forme candidate
l&#8217;ensemble des allomorphies possibles de son &#233;ventuel lex&#232;me base comme cela est illustr&#233; en
figure 2.
</p>
<p>Une correction des approximations induites par l&#8217;apprentissage et l&#8217;application des sch&#233;mas
est effectu&#233;es lorsque l&#8217;on peut identifier le lemme correspondant dans TLFnome. Ainsi, si
pour un candidat, trois des formes pr&#233;dites au moins figurent dans TLFnome comme formes
fl&#233;chies d&#8217;un m&#234;me lemme, alors on remplace toutes les formes pr&#233;dites par les formes fl&#233;-
chies de ce lemme. Par ailleurs, on supprime dans tous les cas l&#8217;ensemble des formes pr&#233;dites
qui, dans TLFnome, appartiennent &#224; une cat&#233;gorie non verbale. On garantit ainsi que seules
</p>
<p>251</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ludovic Tanguy &amp; Nabil Hathout
</p>
<p>les formes verbales seront consid&#233;r&#233;es lors du filtrage par les cooccurrences. Cette r&#233;duction de
l&#8217;ensemble des formes pr&#233;dites a par exemple permis d&#8217;&#233;liminer un couple candidat comme affi-
cherie:afficher &#8212;afficherie est construit sur affiche&#8212; malgr&#233; le fait que les formes du substantif
affiche soient aussi des formes du verbe afficher.
</p>
<p>8 Filtrage des couples par recherche de cooccurrences
</p>
<p>Suffixe -ade -age -ance -ement -ence -erie -tion Total
Couples recherch&#233;s 813 2 189 1 097 3 791 999 995 3 564 13 448
Couples filtr&#233;es 55 450 154 385 81 85 611 1 821
Moyenne (%) 6,77 20,56 14,04 10,16 8,11 8,54 17,14 13,54
</p>
<p>TAB. 3 &#8211; R&#233;sultats quantitatifs du filtrage bas&#233; sur les cooccurrences.
</p>
<p>La troisi&#232;me &#233;tape projette sur le Web les liens construits par le deuxi&#232;me module pour ne
retenir que les couples de formes qui apparaissent simultan&#233;ment dans au moins une page Web.
Cette &#233;tape utilise Altavista car ce moteur accepte des requ&#234;tes longues, jusque 800 caract&#232;res.
On ne soumet ainsi qu&#8217;une requ&#234;te par lien, ce qui r&#233;duit le temps d&#8217;ex&#233;cution de cette &#233;tape8.
Les pages propos&#233;es par le moteur de recherche sont analys&#233;es pour v&#233;rifier, comme dans la
premi&#232;re &#233;tape, que les occurrences sont &#171; valides &#187;. Nous pr&#233;sentons dans le tableau 3 les
r&#233;sultats quantitatifs de cette &#233;tape pour chaque suffixe &#233;tudi&#233;.
</p>
<p>Notons, lors de ce traitement, l&#8217;apparition d&#8217;une nouvelle source de bruit, constitu&#233;e par des
pages qui ne sont pas des textes mais des listes de mots : dictionnaires et glossaires en ligne,
bases de donn&#233;es lexicales mises &#224; disposition sur le Web par des linguistes informaticiens, listes
de mots utilis&#233;es respectivement par les pirates informatiques et les responsables de s&#233;curit&#233;
pour attaquer (resp. prot&#233;ger) les mots de passe... Ces pages ne sont pas g&#234;nantes pour la collecte
des formes candidates par le premier module. Elles sont en revanche pr&#233;judiciables au bon
fonctionnement de notre filtrage par la cooccurrence : la pr&#233;sence simultan&#233;e de deux unit&#233;s
lexicales sur des bases purement lexicographiques ne peut pas servir de test linguistique. Nous
proc&#233;dons donc &#224; la d&#233;tection et au filtrage de ces pages Web, en v&#233;rifiant la pr&#233;sence d&#8217;unit&#233;s
lexicales graph&#233;miquement proches du candidat, ordonn&#233;es suivant l&#8217;ordre lexicographique.
</p>
<p>9 &#201;valuation des r&#233;sultats et discussion
Nous pr&#233;sentons ici une &#233;valuation des r&#233;sultats de Webaffix, obtenus apr&#232;s un &#233;tiquetage ma-
nuel des candidats et des couples produits par les des diff&#233;rents modules.
</p>
<p>9.1 Collecte des formes candidates
La qualit&#233; des r&#233;sultats &#224; la sortie du premier module a &#233;t&#233; &#233;valu&#233;e manuellement par les auteurs
en pr&#233;levant un &#233;chantillon al&#233;atoire de 100 occurrences pour chaque suffixe. L&#8217;&#233;valuation de la
qualit&#233; du premier module est r&#233;sum&#233;e dans le tableau 4. Sont consid&#233;r&#233;es correctes les formes
candidates nominales qui se terminent par le suffixe recherch&#233;, m&#234;me s&#8217;il ne s&#8217;agit pas d&#8217;un
d&#233;verbal. Si la forme n&#8217;est pas un nom commun, elle est &#233;tiquet&#233;e mauvaise cat&#233;gorie comme
</p>
<p>8Comme nous l&#8217;a signaler un relecteur anonyme, ces requ&#234;tes peuvent &#234;tre scind&#233;es en sous-requ&#234;tes plus
courtes que l&#8217;on pourrait soumettre &#224; d&#8217;autres moteurs, comme Google.
</p>
<p>252</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Webaffix
</p>
<p>Suffixe -ade -age -ance -ement -ence -erie -tion Moyenne
Candidat correct (%) 29 66 40 17 34 59 53 45
Mauvaise cat&#233;gorie (%) 14 1 5 23 2 10 1 8
Langue &#233;trang&#232;re (%) 36 7 14 6 11 11 18 12
Faute d&#8217;orthographe (%) 16 23 36 51 50 16 27 33
Code, URL, etc. (%) 5 3 5 3 3 4 1 3
</p>
<p>TAB. 4 &#8211; R&#233;partition des candidats noms dans les diff&#233;rentes cat&#233;gories
</p>
<p>dans le cas de vibratoirement qui est un adverbe9. Certains contextes en langues &#233;trang&#232;res
&#233;chappent au test pr&#233;sent&#233; pr&#233;c&#233;demment. Il s&#8217;agit de segments trop courts, souvent de cita-
tions (comme Parole d&#8217;alc&#244;ve et outrageous statement), de traductions partielles (comme &#171; Sept
jours pour expier &#187; (days of atonement)), d&#8217;ancien fran&#231;ais (oultrageusement) et divers parlers
romans, trop proches du fran&#231;ais moderne pour &#234;tre efficacement filtr&#233;s. De m&#234;me, les fautes
d&#8217;orthographe r&#233;siduelles sont trop complexes pour &#234;tre trait&#233;es efficacement. L&#8217;utilisation d&#8217;un
correcteur orthographique filtre la majorit&#233; des cr&#233;ations lexicales que nous recherchons ; cette
solution a donc &#233;t&#233; rejet&#233;e. Enfin, les codes informatiques vont de langages de programmation
&#224; faible ponctuation &#224; des textes parlant d&#8217;informatique (la fonction comptelement [...]).
Il est clair qu&#8217;une pr&#233;cision moyenne de 45% est assez faible &#224; ce stade, et pourrait &#234;tre am&#233;lio-
r&#233;e. Toutefois, le v&#233;ritable filtrage est effectu&#233; par le troisi&#232;me module, lors de la recherche de
cooccurrences. De plus, certaines finales ont plus de propension que d&#8217;autres &#224; appara&#238;tre dans
des contextes erron&#233;s : c&#8217;est le cas de ement qui permet aussi de construire des adverbes, et de
ade qui appara&#238;t dans de tr&#232;s nombreuses formes espagnoles.
</p>
<p>9.2 &#201;valuation des liens filtr&#233;s
Suffixe -ade -age -ance -ement -ence -erie -tion Total
Couples candidats 55 450 154 385 81 85 611 1 821
Corrects 13 355 31 123 9 14 415 960
Pr&#233;cision (%) 24 79 20 32 11 16 68 52.7
</p>
<p>TAB. 5 &#8211; &#201;valuation du filtrage par les cooccurrences
</p>
<p>La qualit&#233; des r&#233;sultats du troisi&#232;me module a &#233;galement &#233;t&#233; &#233;valu&#233;e manuellement10. Sont
consid&#233;r&#233;s comme corrects les liens tels que le lex&#232;me candidat est un nom d&#8217;action ou d&#8217;&#233;v&#233;-
nement correspondant au verbe pr&#233;dit. Nous avons aussi accept&#233; les couples dont le candidat
n&#8217;est pas construit par l&#8217;affixe mais l&#8217;est par conversion (cytoponction:cytoponctionner). L&#8217;&#233;va-
luation du filtrage par les cooccurrences est r&#233;sum&#233;e dans le tableau 5.
</p>
<p>10 Conclusion
Nous avons pr&#233;sent&#233; une m&#233;thode d&#8217;acquisition semi-automatique de connaissances d&#233;rivation-
nelles &#224; partir du Web. Cette m&#233;thode comporte trois phases : la collecte sur le Web de formes
</p>
<p>9L&#8217;utilisation d&#8217;un &#233;tiqueteur morphosyntaxique serait trop lourde pour la masse de donn&#233;es &#224; traiter, et les
&#233;tiqueteurs &#233;tant de toute fa&#231;on peu arm&#233;s pour cat&#233;goriser efficacement les n&#233;ologismes que nous recherchons.
</p>
<p>10Pour les suffixes -age, -ance, -ement et -tion les valeurs pr&#233;sent&#233;es sont extrapol&#233;es &#224; partir de l&#8217;&#233;valuation
d&#8217;&#233;chantillons al&#233;atoires de 100 lex&#232;mes candidats.
</p>
<p>253</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ludovic Tanguy &amp; Nabil Hathout
</p>
<p>candidates qui comportent un suffixe graph&#233;mique ; la pr&#233;diction des formes des bases que ces
candidats pourraient avoir ; le filtrage par la cooccurrence des couples ainsi constitu&#233;s. L&#8217;ar-
ticle pr&#233;sente une &#233;valuation des r&#233;sultats centr&#233;e sur la pr&#233;cision : elle constitue notre objectif
premier.
</p>
<p>Notre m&#233;thode pr&#233;sente plusieurs points forts que nous envisageons de d&#233;velopper prochai-
nement : elle ne met en &#339;uvre aucune connaissance linguistique, ce qui permet de l&#8217;utiliser
directement pour d&#8217;autres sch&#233;mas d&#233;rivationnels comme adjectif:adverbe, nom:adjectif... et
d&#8217;autres langues, par exemple pour compl&#233;ter la partie anglaise de la base morphologique CE-
LEX (Baayen et al. 1995). Cette m&#233;thode pourrait &#233;galement servir de base &#224; une approche plus
intuitive et moins applicative pour caract&#233;riser les pages Web en fonction des suffixes qu&#8217;elles
contiennent (en s&#8217;int&#233;ressant en particulier &#224; l&#8217;effet de sensibilisation aux r&#232;gles ou rule pri-
ming), en vue de d&#233;gager des affinit&#233;s entre certains param&#232;tres extra-linguistiques et la cr&#233;ation
lexicale.
</p>
<p>Remerciements
</p>
<p>Nous remercions Marc Pl&#233;nat (ERSS, CNRS &amp; Universit&#233; Toulouse le Mirail) pour l&#8217;id&#233;e qui
est &#224; l&#8217;origine de Webaffix, ainsi que Natalia Grabar (DIAM, SIM/AP-HP &amp; Universit&#233; Paris 6)
pour ses conseils techniques.
</p>
<p>R&#233;f&#233;rences
Baayen, R. H., Neijt, A. (1997), Productivity in context: a case study of a Dutch suffix, Linguistics, Vol.
35, 565-587.
Baayen, R. H., Piepenbrock, R., Gulikers, L. (1995), The CELEX Lexical Database (Release 2), CD-
ROM, Linguistic Data Consortium, University of Pennsylvania, USA.
Beaudouin, V., Fleury, S., Habert, B., Illiouz, G., Licoppe, C., Pasquier, M. (2001), TyPWeb : D&#233;crire la
Toile pour mieux comprendre les parcours. Actes de CIUST&#8217;01 : Colloque International sur les Usages
et les Services de T&#233;l&#233;communications, Paris.
Bourigault, D., Fabre, C. (2000), Approche linguistique pour l&#8217;analyse linguistique de corpus, Cahiers
de Grammaire, Vol. 25, 131-151.
Dal, G., Hathout, N., Namer, F. (1999), Construire un lexique d&#233;rivationnel : th&#233;orie et r&#233;alisation, Actes
de la 6econf&#233;rence sur le Traitement Automatique des Langues Naturelle, 115-124.
Dal, G., Namer, F. (2000), G&#233;n&#233;ration et analyse automatiques de ressources lexicales construites utili-
sables en recherche d&#8217;informations, T.A.L., Vol. 41, Num. 2, 423-446.
Grefenstette, G. (1999), The WWW as a Resource for Example-Based MT Tasks, Actes de ASLIB &#8216;Trans-
lating and the Computer&#8217; Conference, London.
Hathout, N., Fabre, C. (2002), Constitution et exploitation de lexiques de formes d&#233;verbales, Journ&#233;es
d&#8217;&#233;tudes sur les d&#233;verbaux, SILEX, Lille.
Jacquemin, C. (1997), Variation terminologique : Reconnaissance et acquisition automatique de termes
et de leurs variantes en corpus, M&#233;moire d&#8217;habilitation &#224; diriger des recherches, Universit&#233; de Nantes.
Jacquemin, C., Bush, C. (2000), Fouille du Web pour la collecte d&#8217;entit&#233;s nomm&#233;es, Actes de la
7eConf&#233;rence sur le Traitement Automatique des Langues Naturelles.
Resnik, P. (1999), Mining the Web for bilingual text, Acte de 37th Meeting of ACL, 527-534, Maryland,
USA.
Xu, J., Croft, W. B. (1998). Corpus-Based Stemming using Co-occurrence of Word Variants, ACM Tran-
saction on Information Systems, Vol. 16, Num. 1, 61-81.
</p>
<p>254</p>

</div></div>
</body></html>