<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La co&#233;dition langue&#8596;UNL pour partager la r&#233;vision entre les langues d'un document multilingue : un concept unificateur</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>La co&#233;dition langue&#8596;UNL pour partager la r&#233;vision entre les
langues d'un document multilingue : un concept unificateur
</p>
<p>Christian BOITET, TSAI Wang-Ju
</p>
<p>GETA, CLIPS, IMAG
385 rue de la Biblioth&#232;que, BP 53
38041 Grenoble cedex 9, France
</p>
<p>Christian.Boitet@imag.fr, Wang-Ju.Tsai@imag.fr
</p>
<p>R&#233;sum&#233; &#8211; Abstract
La co&#233;dition d'un texte en langue naturelle et de sa repr&#233;sentation dans une forme interlingue semble le moyen le meilleur et le
plus simple de partager la r&#233;vision du texte vers plusieurs langues. Pour diverses raisons, les graphes UNL sont les meilleurs
candidats dans ce contexte. Nous d&#233;veloppons un prototype o&#249;, dans le sc&#233;nario avec partage le plus simple, des utilisateurs
&quot;na&#239;fs&quot; interagissent directement avec le texte dans leur langue (L0), et indirectement avec le graphe associ&#233; pour corriger les
erreurs. Le graphe modifi&#233; est ensuite envoy&#233; au d&#233;convertisseur UNL-L0 et le r&#233;sultat est affich&#233;. S'il est satisfaisant, les
erreurs &#233;taient probablement dues au graphe et non au d&#233;convertisseur, et le graphe est envoy&#233; aux d&#233;convertisseurs vers
d'autres langues. Les versions dans certaines autres langues connues de l'utilisateur peuvent &#234;tre affich&#233;es, de sorte que le
partage de l'am&#233;lioration soit visible et encourageant. Comme les nouvelles versions sont ajout&#233;es dans le document multilingue
original avec des balises et des attributs appropri&#233;s, rien n'est jamais perdu, et le travail coop&#233;ratif sur un m&#234;me document est
rendu possible. Du c&#244;t&#233; interne, des liaisons sont &#233;tablies entre des &#233;l&#233;ments du texte et du graphe en utilisant des ressources
largement disponibles comme un dictionnaire L0-anglais, ou mieux L0-UNL, un analyseur morphosyntaxique de L0, et une
transformation canonique de graphe UNL &#224; arbre. On peut &#233;tablir une &quot;meilleure&quot; correspondance entre &quot;l'arbre-UNL+L0&quot; et la
&quot;structure MS-L0&quot;, une treille, en utilisant le dictionnaire et en cherchant &#224; aligner l'arbre et une trajectoire avec aussi peu que
possible de croisements de liaisons. Un but central de cette recherche est de fusionner les approches de la TA par pivot, de la TA
interactive, et de la g&#233;n&#233;ration multilingue de texte.
</p>
<p>Coedition of a natural language text and its representation in some interlingual form seems the best and simplest way to share
text revision across languages. For various reasons, UNL graphs are the best candidates in this context. We are developing a
prototype where, in the simplest sharing scenario, naive users interact directly with the text in their language (L0), and indirectly
with the associated graph, to correct errors. The modified graph is then sent to the UNL-L0 deconverter and the result shown. If
it is satisfactory, the errors were probably due to the graph, not to the deconverter, and the graph is sent to deconverters in other
languages. Versions in some other languages known by the user may be displayed, so that improvement sharing is visible and
encouraging. As new versions are added with appropriate tags and attributes in the original multilingual document, nothing is
ever lost, and cooperative working on a document is rendered feasible. On the internal side, liaisons are established between
elements of the text and the graph by using broadly available resources such as a L0-English or better a L0-UNL dictionary, a
morphosyntactic parser of L0, and a canonical graph2tree transformation. Establishing a &quot;best&quot; correspondence between the
&quot;UNL-tree+L0&quot; and the &quot;MS-L0 structure&quot;, a lattice, may be done using the dictionary and trying to align the tree and the
selected trajectory with as few crossing liaisons as possible. A central goal of this research is to merge approaches from pivot
MT, interactive MT, and multilingual text authoring.
</p>
<p>Mots-cl&#233;s &#8212; Keywords
Partage de r&#233;vision, repr&#233;sentation interlingue, co&#233;dition de texte et de graphe UNL, communication multilingue
Revision sharing, interlingual representation, coedition of text &amp; UNL graph, multilingual communication</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christian BOITET, TSAI Wang-Ju
</p>
<p>Introduction
Il est de plus en plus n&#233;cessaire de cr&#233;er et de maintenir des documents multilingues. Dans la pratique
courante, un document multilingue consiste en plusieurs fichiers monolingues parall&#232;les, qui peuvent &#234;tre
de la documentation technique aussi bien que des fichiers d'aide, des fichiers de messages, ou
simplement de l'information th&#233;matique mise sur la Toile et destin&#233;e &#224; une audience multilingue
(m&#233;decine, cuisine, voyage&#8230;).
La t&#226;che est difficile, m&#234;me pour un document g&#233;r&#233; de fa&#231;on centralis&#233;e. D'habitude, on le cr&#233;e d'abord
dans une unique langue source, puis on le traduit dans plusieurs langues cibles (au moins une trentaine
dans le cas de firmes comme IBM, HP ou Microsoft). Il faut avoir un moyen de garder trace des
modifications, qui peuvent parfois &#234;tre faites en diff&#233;rents lieux sur des versions en diff&#233;rentes langues.
De temps en temps, quelqu'un doit d&#233;cider des modifications &#224; int&#233;grer dans la nouvelle version du
document. Il faut pour cela traduire en langue source les modifications faites dans d'autres langues. La
nouvelle et l'ancienne version en langue source sont alors compar&#233;es en utilisant des techniques de
coincidence floue, de fa&#231;on &#224; ne faire traduire que de nouveaux segments.
</p>
<p>Le probl&#232;me est encore plus aigu si les documents ne sont pas g&#233;r&#233;s de fa&#231;on centralis&#233;e, car les fichiers
monolingues sont alors souvent dans des formats diff&#233;rents (Word, EgWord, Interleaf, FileMaker,
formats de divers SGBD&#8230;). A. Assimi (Al Assimi 2000, Al Assimi &amp; Boitet 2001) a montr&#233; comment
&quot;r&#233;aligner&quot; des documents parall&#232;les d&#233;centralis&#233;s et leur appliquer ensuite la m&#233;thodologie esquiss&#233;e
plus haut.
</p>
<p>Cependant, dans les deux cas, des traducteurs humains doivent retraduire les segments nouveaux ou
modifi&#233;s, ou les r&#233;viser s'ils sont traduits par un syst&#232;me de TA de qualit&#233;. Contrairement &#224; ce qu'on dit
souvent, la TA de qualit&#233; existe, mais seulement dans des contextes sp&#233;cifiques. Voir par exemple
(Vasconcellos &amp; Le&#243;n 1988).
Ce que nous aimerions, c'est faire en sorte que le travail de r&#233;vision puisse &#234;tre partag&#233; entre les langues,
quels que soient le domaine et le contexte.
</p>
<p>Il est clairement impossible de refl&#233;ter les changements sur un fichier en langue L0 dans les fichiers en
langues L1,&#8230; Ln automatiquement et fid&#232;lement, sans une structure interm&#233;diaire pour faire le pont, car
il faudrait au moins un aligneur parfait &#224; granularit&#233; tr&#232;s fine dans le cas simple d'un changment d'article
ou de nom (et encore, en supposant que le genre et le nombre restent les m&#234;mes dans chaque version Li).
Dans le cas du remplacement d'un verbe par un autre verbe ayant un r&#233;gime diff&#233;rent dans une langue
cible Li, il faudrait r&#233;analyser la phrase en Li, la transformer en cons&#233;quence, et la reg&#233;n&#233;rer sans
introduire de nouvelle erreur ou impr&#233;cision, tout en gardant les am&#233;liorations manuelles &#233;ventuellement
apport&#233;es lors de r&#233;visions pr&#233;c&#233;dentes. Ou bien, il faudrait disposer d'un syst&#232;me de TA plus que parfait,
&#224; savoir capable d'analyser l'&#233;nonc&#233; modifi&#233; en L0, de le transf&#233;rer, et de g&#233;n&#233;rerer un &#233;nonc&#233; aussi
proche que possible de l'&#233;nonc&#233; pr&#233;c&#233;dent en Li, toujours en supposant que celui-ci pourrait avoir &#233;t&#233;
am&#233;lior&#233; manuellement lors d'une &#233;tape pr&#233;c&#233;dente.
</p>
<p>L'approche la meilleure et la plus simple nous semble &#234;tre d'utiliser un interlingua formel IL et :
</p>
<p>&#8226; de r&#233;percuter les modifications de L0 vers l'IL,
&#8226; de reg&#233;n&#233;rer vers L1,&#8230; Ln depuis l'IL.
</p>
<p>Il faudra cependant permettre des am&#233;liorations manuelles, car la forme interlingue ne sera pas toujours
pr&#233;sente, ou pas assez am&#233;liorable par d&#233;faut d'expressivit&#233;, et les g&#233;n&#233;rateurs ne seront jamais parfaits.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La coo&#233;dition langue&#8596;UNL pour partager la r&#233;vision entre les langues d'un document multilingue
</p>
<p>Nous choisissons UNL (Blanc 2001, Boguslavsky, et al. 2000, S&#233;rasset &amp; Boitet 1999, 2000) comme
interlingua pour diff&#233;rentes raisons :
</p>
<p>(1) il est sp&#233;cialement con&#231;u pour le traitement linguistique et s&#233;mantique par ordinateur,
(2) il a &#233;t&#233; d&#233;riv&#233; avec beaucoup d'am&#233;liorations du langage pivot de H. Uchida utilis&#233; dans ATLAS-II
</p>
<p>de Fujitsu (Uchida 1989), toujours &#233;valu&#233; comme le syst&#232;me de TA anglais-japonais de meilleure
qualit&#233;, avec une tr&#232;s grande couverture (586.000 entr&#233;es par langue),
</p>
<p>(3) les participants du projet UNL1 ont construit des &quot;d&#233;convertisseurs&quot; d'UNL vers environ 12 langues,
parmi lesquels au moins ceux allant vers l'arabe, l'indon&#233;sien, l'italien, le fran&#231;ais, le russe, l'espagnol et
le tha&#239; sont librement accessibles pour l'exp&#233;rimentation au printemps 2002,
</p>
<p>(4) bien qu'ils soient de nature formelle, les graphes UNL (voir ci-dessous) sont assez simples &#224;
comprendre avec peu de formation et peuvent &#234;tre pr&#233;sent&#233;s de fa&#231;on localis&#233;e &#224; des utilisateurs &quot;na&#239;fs&quot;
en traduisant les symboles (relations s&#233;mantiques, attributs) et les lex&#232;mes du langage UNL par des
symboles et des lex&#232;mes de leur langue,
</p>
<p>(5) le projet UNL a d&#233;fini un format &quot;UNL-html&quot; int&#233;gr&#233; &#224; html pour des fichiers contenant un
document multilingue complet align&#233; au niveau des &#233;nonc&#233;s, et a produit un &quot;visualiseur&quot; qui
transforme un fichier dans ce format en autant de fichiers html que de langues, et les envoie &#224; n'importe
quel navigateur web.
</p>
<p>La repr&#233;sentation UNL d'un texte  en langue naturelle quelconque est une liste de &quot;graphes s&#233;mantiques&quot;
o&#249; chaque graphe exprime le sens d'un &#233;nonc&#233;. Les n&#339;uds contiennent chacun une unit&#233; lexicale et des
attributs, et les arcs portent chacun une relation s&#233;mantique. Un sous-graphe connexe par arcs peut &#234;tre
distingu&#233; comme &quot;port&#233;e&quot; (&quot;scope&quot;), de sorte qu'un graphe UNL peut &#234;tre en fait un hypergraphe.
Les unit&#233;s lexicales d'UNL (UW2) repr&#233;sentent des (ensembles de) sens de mots, quelque chose de moins
ambitieux que des concepts. Leurs d&#233;notations sont construites de fa&#231;on &#224; &#234;tre comprises intuitivement
par des d&#233;veloppeurs connaissant l'anglais, c'est &#224; dire par tous les d&#233;veloppeurs en TALN : une UW est
un terme anglais ou un symbole sp&#233;cial (nombre&#8230;) la plupart du temps compl&#233;t&#233; par des restrictions
s&#233;mantiques. Par exemple, l'UW &quot;process&quot; represente tous les sens de ce mot vu comme mot vedette (ici,
verbe ou nom), et &quot;process(icl&gt;do, agt&gt;person)&quot; couvre seulement les sens de traiter, travailler sur, etc.
Les attributs sont le nombre (s&#233;mantique), le sexe, le temps s&#233;mantique3, l'aspect, la modalit&#233;, etc., et les
quelques 40 relations s&#233;mantiques sont des &quot;cas profonds&quot; traditionnels comme l'agent, l'objet (profond),
le lieu, le but, le temps, etc.
</p>
<p>Un fa&#231;on de voir un graphe UNL correspondant &#224; un &#233;nonc&#233; dans la langue L est de dire qu'il repr&#233;sente
la structure abstraite d'un &#233;nonc&#233; anglais &#233;quivalent &quot;vu depuis L&quot;, c'est &#224; dire o&#249; les attributs
s&#233;mantiques non n&#233;cessairement exprim&#233;s en L peuvent &#234;tre absents (par exemple, l'aspect si l'on vient
du fran&#231;ais, la d&#233;termination si l'on vient du japonais, etc.).
La suite est organis&#233;e comme suit. D'abord, nous pr&#233;sentons des sc&#233;narios de complexit&#233; interne
croissante pour la situation o&#249; quelqu'un lit un document UNL dans sa langue, le corrige, et veut
transmettre que corrections aux fragments correspondants dans les autres langues. Nous &#233;tudions ensuite
plus pr&#233;cis&#233;ment la correspondance entre un texte en langue L0 et sa repr&#233;sentation en UNL, et montrons
</p>
<p>                                                      
</p>
<p>1
 http://unl.ias.unu.edu
</p>
<p>2
 Universal Word, ou Unit&#233; de Vocabulaire Virtuel
</p>
<p>3
 Time par opposition &#224; Tense</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christian BOITET, TSAI Wang-Ju
</p>
<p>l'avantage de la d&#233;couper en 3 parties : texte &#8596; treille ou &quot;carte&quot; morpho-syntaxique &#8596; &quot;arbre-UNL&quot;
abstrait &#8596; graphe UNL. Enfin, nous pr&#233;sentons l'&#233;tat actuel de ce travail (un site web pour
l'exp&#233;rimentation, une m&#233;thode pour &#233;tablir la seconde partie de la correspondance), et le situons par
rapport aux recherches voisines.
</p>
<p>1 Sc&#233;narios pour partager la r&#233;vision entre plusieurs langues
Supposons qu'une collection de documents multilingues est stock&#233;e sur un serveur comme une collection
de fichiers multilingues en format UNL-html, ou dans toute autre forme, par exemple dans une base de
donn&#233;es, &#224; condition (1) qu'il soit possible de produire facilement la version dans toute langue contenue
dans le document, (2) que les versions soient align&#233;es au niveau de segments du niveau des &#233;nonc&#233;s4, et
(3) que les graphes UNL puissent &#234;tre stock&#233;s et align&#233;s avec les segments.
Voici un exemple l&#233;g&#232;rement simplifi&#233; d'un fichier en format UNL-html.
</p>
<p>&lt;HTML&gt;&lt;HEAD&gt;&lt;TITLE&gt;
Example 1  El/UNL
&lt;/TITLE&gt;&lt;/HEAD&gt;&lt;BODY&gt;
[D:dn=Mar Example 1, on= UNL French,
mid=First.Author@here.com]
[P]
[S:1]
{org:el}I ran in the park yesterday.{/org}
{unl}
agt(run(icl&gt;do).@entry.@past,i(icl&gt;person))
plc(run(icl&gt;do).@entry.@past,park(icl&gt;place).@def)
tim(run(icl&gt;do).@entry.@past,yesterday)
{/unl}
{ab}{/ab}{cn dtime=20020130-2030, deco=man}
+1'*&amp;8:7,
</p>
<p>{/cn}
{de dtime=20020130-2035, deco=man}
Ich lief gestern im Park. {/de}
{el}{/el}{es dtime=20020130-2031, deco=UNL-SP}
Yo corri ayer en el parque.{/es}
{fr dtime=20020131-0805, deco=UNL-FR}
</p>
<p>J&#8217;ai couru dans le parc hier. {/fr}
{hd}{/hd}{id}{/id}{it}{/it}{jo}{/jo}{jp}{/jp}
{lv}{/lv}{mg}{/mg}{pg}{/pg}{ru}{/ru}{th}{/th}
[/S][S:2]
{org:el}My dog barked at me.{/org}
{unl}
agt(bark(icl&gt;do).@entry.@past,dog(icl&gt;animal))
gol(bark(icl&gt;do).@entry.@past,i(icl&gt;person))
pos(dog(icl&gt;animal),i(icl&gt;person))
{/unl}{ab}{/ab}
{cn} {/cn}
{de dtime=20020130-2036, deco=man}
Mein Hund bellte zu mir.{/de}{el}{/el}
{es}{/es}
{fr dtime=20020131-0806, deco=UNL-FR}
Mon chien aboya pour moi.
{/fr}{hd}{/hd}{id}{/id}{it}{/it}{jo}{/jo}{jp}{/jp}
{lv}{/lv}{mg}{/mg}{pg}{/pg}{ru}{/ru}{th}{/th}
[/S] [/P][/D]
&lt;/BODY&gt;&lt;/HTML&gt;
</p>
<p>Les versions fran&#231;aises ont &#233;t&#233; produites par d&#233;conversion automatique, tandis que les versions
allemandes et chinoises ont &#233;t&#233; traduites manuellement. Les autres sont absentes.
</p>
<p>Le r&#233;sultat du visualiseur UNL pour le fran&#231;ais est5 :
</p>
<p>&lt;HTML&gt;&lt;HEAD&gt;&lt;TITLE&gt;Example 1  El/UNL&lt;/TITLE&gt;&lt;/HEAD&gt;
&lt;BODY&gt;J&#8217;ai couru dans le parc hier. Mon chien aboya pour moi. &lt;/BODY&gt;&lt;/HTML&gt;
et sera probablement affich&#233; par un navigateur web comme :
</p>
<p>                                                      
</p>
<p>4
 Comme une phrase en Li peut correspondre &#224; 2 phrases en Lj, un segment peut contenir plus d'un &#233;nonc&#233;.
</p>
<p>5
 &quot;Example&quot; n'est pas contenu entre des balises UNL et n'est donc pas traduit.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La coo&#233;dition langue&#8596;UNL pour partager la r&#233;vision entre les langues d'un document multilingue
</p>
<p>Example 1  El/UNL
J&#8217;ai couru dans le parc hier. Mon chien aboya pour moi.
et de fa&#231;on similaire pour toutes les autres langues. Dans tous les sc&#233;narios, l'utilisateur est cens&#233; lire le
texte dans une vue normale, sans voir aucune balise, et vouloir &#224; un certain moment faire une
modification, par exemple d&#233;placer &quot;hier&quot; apr&#232;s &quot;couru&quot; et changer &quot;pour&quot; en &quot;vers&quot;. En activant un
bouton ou un item de menu, il arrive alors &#224; une interface de r&#233;vision.
</p>
<p>1.1 R&#233;vision multiple sans partage
Dans le premier sc&#233;nario, nous supposons qu'il n'y a pas de graphes UNL associ&#233;s aux segments. On ne
peut donc pas transmettre les modifications d'une langue aux autres. Le probl&#232;me consiste &#224; transmettre
les modifications pour les ajouter6 &#224; la forme originale du document multilingue. Mais c'est impossible
en &#233;ditant les documents html pr&#233;sent&#233;s &#224; l'&#233;cran, car ils n'ont pas de liens vers leur forme originale
(document UNL-html ou base de donn&#233;es). Il faut donc une interface diff&#233;rente de l'interface de lecture.
Le format UNL-html est ant&#233;rieur &#224; XML, d'o&#249; les balises sp&#233;ciales comme [S] et {unl}. Nous en avons
d&#233;riv&#233; un format XML &#233;quivalent, dit UNL-xml. Nous avons adapt&#233; un analyseur de UNL-html pour
transformer les fichiers UNL-html en UNL-xml. L'inverse peut se faire en XSLT. En utilisant DOM, on
peut alors produire diff&#233;rentes vues, comme celle du visualiseur UNL, une pr&#233;sentation bilingue ou
multilingue &#233;ditable, et une interface de r&#233;vision, o&#249; non seulement le texte, mais aussi le graphe UNL et
&#233;ventuellement d'autres structures peuvent &#234;tre manipul&#233;es directement. L'impl&#233;menation est en cours.
</p>
<p>Prenons un exemple venant d'une exp&#233;rience effectu&#233;e pour le &quot;Forum Barcelona 2004&quot; sur des
documents en espagnol, italien, russe, fran&#231;ais et hindi. Les parties en hindi et en russe ne sont pas
montr&#233;es ici, et on a ajout&#233; le japonais &#224; la main. La forme XML est simplifi&#233;e.
</p>
<p>                                                      
</p>
<p>6
 Pour des raisons de coh&#233;rence et de s&#233;curit&#233;, on ne peut pas envisager d'effacer les versions pr&#233;c&#233;dentes.
</p>
<p>&#192; partir de graphes UNL
corrects et complets, les
d&#233;convertisseurs actuels pro-
duisent le plus souvent des
phrases correctes.
</p>
<p>Supposons, donc pour les
besoins de l'illustration, qu'un
graphe UNL a &#233;t&#233; produit &#224;
partir du chinois et ne
contient pas d'information
d&#233;finitionnelle et aspectuelle.
</p>
<p>&lt;unl:S num=&quot;1&quot;&gt;
'/20$*&quot;)&amp;&lt;unl:org lg=&quot;cn&quot;&gt; -1.#%+(,  &lt;/unl:org&gt;
</p>
<p>&lt;unl:unl&gt;
&lt;unl:arc&gt; agt(retrieve(icl&gt;do).@entry.@future, city) &lt;/unl:arc&gt;
&lt;unl:arc&gt; tim(retrieve(icl&gt;do).@entry.@future, after) &lt;/unl:arc&gt;
&lt;unl:arc&gt; obj(after, Forum) &lt;/unl:arc&gt;
&lt;unl:arc&gt; obj(retrieve(icl&gt;do).@entry.@future, zone(icl&gt;place).@indef) &lt;/unl:arc&gt;
&lt;unl:arc&gt; mod(zone(icl&gt;place).@indef, coastal) &lt;/unl:arc&gt; &lt;/unl:unl&gt;
&lt;unl:cn&gt; '/20$*&quot;)&amp; -1.#%+(,  &lt;/unl:cn&gt;
&lt;unl:el&gt; After a Forum, a city will retrieve a coastal zone.&lt;/unl:el&gt;
&lt;unl:es&gt; Ciudad recobrar&#225; una zona de costal despu&#233;s Foro. &lt;/unl:es&gt;
&lt;unl:fr&gt; Une cit&#233; retrouvera une zone c&#244;ti&#232;re apr&#232;s un forum. &lt;/unl:fr&gt;
&lt;unl:it&gt; Citt&#224; ricuperar&#224; une zona costiera dopo Forum. &lt;/unl:it&gt;
&lt;unl:jp &#1;&#2;&#3;&#4;&#5;&#6;&#7;&#8;&#9;&#10004;&#11;&#12;&#13;&#14;&#15;&#16;&#17;&#18;&#19;&#20;&#21;&#22;&#23;&#24;&gt; &lt;/unl:jp&gt;
&lt;/unl:S&gt;
</p>
<p>Tous les r&#233;sultats de d&#233;conversion deviennent alors faux pour les articles, et certains pour les aspects.
L'interface ci-dessous, con&#231;ue pour &#234;tre utilis&#233;e dans le cas du partage, peut aussi &#234;tre utilis&#233;e  par un
lecteur connaissant plusieurs langues (affich&#233;es &#224; la demande) et d&#233;sirant pouvoir les modifier.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christian BOITET, TSAI Wang-Ju
</p>
<p>Par exemple, un hispa-
nophone natif sachant le
fran&#231;ais et l'anglais
mettrait les articles
corrects (&quot;La ciudad&quot;,
&quot;La cit&#233;&quot;, &quot;The city&quot;,
etc.) et l'aspect perfectif
(&quot;habra recobrado&quot;,
&quot;will have recovered&quot;).
Mais un francophone
natif ne corrigerait pro-
bablement pas l'aspect
en anglais et en espa-
gnol, car l'aspect est
souvent sous-sp&#233;cifi&#233; en
fran&#231;ais, comme dans
&quot;retrouvera&quot;.
</p>
<p>Original text
</p>
<p>Possible Modifications
</p>
<p>Second Deconversion
</p>
<p>Manual Insertion
</p>
<p>Une cit&#233; retrouvera une zone c&#244;ti&#232;re apr&#232;s un forum.
</p>
<p>Show Graph
</p>
<p>La cit&#233; retrouvera une zone c&#244;ti&#232;re apr&#232;s le Forum.
</p>
<p>Deconversion Find Lemma
</p>
<p>Une cit&#233; retrouvera une zone c&#244;ti&#232;re apr&#232;s un forum.
</p>
<p>English
After a Forum, a city will
retrieve a coastal zone.
</p>
<p>Spanish
Ciudad recobrar&#224; una zona
de costal despu&#233;s Foro.
</p>
<p>Italian
Citt&#224; ricuperar&#224; une zona
costiera dopo Forum.
</p>
<p>Japanese
&#1;&#2;&#3;&#4;&#5;&#6;&#7;&#8;&#9;&#10004;&#11;&#12;&#13;&#14;
&#15;&#16;&#17;&#18;&#19;&#20;&#21;
</p>
<p>Chinese
'/20$*&quot;)&amp;-1.
</p>
<p>#%+(,
</p>
<p> 
</p>
<p>QuitSave
</p>
<p>Find Correspondence Save Graph
</p>
<p>After the Forum, the city will
have recovered a coastal zone.
</p>
<p>La ciudad habr&#225; recobrado una
zona de costal despu&#233;s el Foro
</p>
<p>La citt&#224; ha ricuperar&#224; une
zona costiera dopo il Forum.
</p>
<p>&#1;&#2;&#3;&#4;&#5;&#6;&#7;&#8;&#9;&#10004;&#11;&#12;&#13;&#14;
&#15;&#16;&#17;&#18;&#19;&#20;&#21;&#22;&#25;&#26;&#18;
&#27;&#28;&#29;&#30;&#31;&#23;
</p>
<p>'/20$*&quot;)&amp;-1.
</p>
<p>#%+(,
</p>
<p> 
</p>
<p>Multiple text viewSimple text view
</p>
<p>1.2 R&#233;vision transparente avec partage
Dans le second sc&#233;nario, il y a un graphe UNL associ&#233; au segment modifi&#233;. Pour partager les r&#233;visions
entre les langues, il faut les refl&#233;ter sur le graphe UNL, i.e.
</p>
<p>&#8226; ajouter &quot;.@def&quot; sur les n&#339;uds contenant &quot;city&quot;, &quot;Forum&quot;.
&#8226; replacer &quot;retrieve&quot; par &quot;recover&quot; et ajouter &quot;.@complete&quot; sur le n&#339;ud le contenant.
</p>
<p>Il n'est pas possible en principe de d&#233;duire une modification sur le graphe d'une modification sur le texte.
Par example, le remplacement de &quot;un&quot; par &quot;le&quot; n'implique pas que le nom suivant soit d&#233;termin&#233; (.@def),
parce qu'il peut aussi &#234;tre g&#233;n&#233;rique (&quot;il aime la montagne&quot;). L'approche suivie est alors :
</p>
<p>&#8226; de ne pas faire la r&#233;vision en modifiant directement le texte, mais en utilisant des menus,
&#8226; de donner aux items de menu un &quot;c&#244;t&#233; langue&quot; visible et un &quot;c&#244;t&#233; UNL&quot; cach&#233;,
&#8226; quand un item de menu est choisi, de transformer seulement le graphe, de stocker l'action &#224;
</p>
<p>effectuer sur le texte, et de la montrer &#224; c&#244;t&#233; de son point d'application dans la zone &quot;To Do&quot;,
&#8226; de permettre &#224; tout moment d'envoyer le nouveau graphe au d&#233;convertisseur L0, et d'afficher le
</p>
<p>r&#233;sultat. S'il est satisfaisant, cela montrera que les erreurs &#233;taient dues au graphe et pas au
d&#233;convertisseur, et le graphe pourra &#234;tre envoy&#233; aux d&#233;convertisseurs d'autres langues. Les versions
dans des langues Li connues par l'utilisateur pourront &#234;tre affich&#233;es, de fa&#231;on que l'am&#233;lioration soit
visible et encourageante.
</p>
<p>Les nouvelles versions seront ajout&#233;es, avec des balises et des attributs appropri&#233;s, au document
multilingue original en format UNL-xml, ou dans un SGBD, de fa&#231;on que rien ne soit jamais perdu, et que
le travail coop&#233;ratif sur un document soit possible.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La co&#233;dition pour partager la post&#233;dition entre plusieurs langues&#8230;
</p>
<p>1.3 R&#233;vision sur plus que du texte
Pour que la m&#233;thode ci-dessus fonctionne, il faut que le texe ait &#233;t&#233; pr&#233;trait&#233;, au moins en calculant les
classes morphosyntaxiques (parties du discours et attributs d'actualisation) de fa&#231;on &#224; &#233;viter beaucoup de
menus parasites, en segmentant, et en lemmatisant. Comme nous d&#233;sirons que notre technique soit
largement applicable, ce pr&#233;traitement doit &#234;tre limit&#233;, pour pouvoir &#234;tre effectu&#233; par des outils &#224; large
couverture disponibles librement pour beaucoup de langues. C'est le cas pour les analyseurs
morphosyntaxiques (AMS), mais pas encore pour les analyseurs syntaxiques ou s&#233;mantiques, complets ou
m&#234;me superficiels (shallow).
Nous proposons aussi que l'interface de r&#233;vision permette d'acc&#233;der non seulement aux textes en
diff&#233;rentes langues, mais aussi &#224; une ou des repr&#233;sentations &#233;ditables du graphe UNL, du r&#233;sultat de
l'AMS, et de toute autre structure disponible telle qu'un arbre d&#233;riv&#233; du graphe UNL.
</p>
<p>QuitSaveMultiple text viewSimple text view
</p>
<p>Original text
</p>
<p>To Do
</p>
<p>Second Deconversion
</p>
<p>Manual Insertion
</p>
<p>Une cit&#233; retrouvera une zone c&#244;ti&#232;re apr&#232;s un forum.
</p>
<p> la
</p>
<p>Une cit&#233; retrouvera une zone c&#244;ti&#232;re apr&#232;s un forum.
</p>
<p>La cit&#233; retrouvera une zone c&#244;ti&#232;re apr&#232;s le Forum.
</p>
<p>Graph : correspondence
</p>
<p>un cit&#233; retrouver un zone c&#244;tier apr&#232;s Forumun
</p>
<p>a
dormitory
</p>
<p>city
retrieve
</p>
<p>find
</p>
<p>remember
</p>
<p>a a
</p>
<p>zone
</p>
<p>coastal after Forum
area
</p>
<p>retrieve (icl&gt;do)(.@entry.@future)
</p>
<p>city(agt)
</p>
<p>zone(icl&gt;place)(.@indef, obj) coastal(mod)
</p>
<p>after(tim) Forum(obj)
</p>
<p> indef art         noun               verb          indef art         noun             adj              prop         indef art     noun
  sin                  sin                future             sin               sin                sin                                sin             sin
</p>
<p>Show Graph Deconversion Find Lemma Find Correspondence Save Graph English
After a Forum, a city will
retrieve a coastal zone.
</p>
<p>Ciudad recobrar&#225; una zona
de costal despu&#233;s Foro.
</p>
<p>Citt&#224; ricuperar&#224; une zona
costiera dopo Forum.
</p>
<p>&#1;&#2;&#3;&#4;&#5;&#6;&#7;&#8;&#9;&#10004;&#11;&#12;&#13;&#14;
&#15;&#16;&#17;&#18;&#19;&#20;&#21;
</p>
<p>'/20$*&quot;)&amp;-1.
</p>
<p>#%+(,
</p>
<p> 
</p>
<p>After the Forum, the city will
have recovered a coastal zone.
</p>
<p>La ciudad habr&#225; recobrado una
zona de costal despu&#233;s el Foro.
</p>
<p>La citt&#224; ha ricuperato une
zona costiera dopo il Forum.
</p>
<p>&#1;&#2;&#3;&#4;&#5;&#6;&#7;&#8;&#9;&#10004;&#11;&#12;&#13;&#14;
&#15;&#16;&#17;&#18;&#19;&#20;&#21;&#22;&#25;&#26;&#18;
&#27;&#28;&#29;&#30;&#31;&#23;
</p>
<p>'/20$*&quot;)&amp;-1.
</p>
<p>#%+(,
</p>
<p> 
</p>
<p>Spanish
</p>
<p>Italian
</p>
<p>Japanese
</p>
<p>Chinese
le Maj
</p>
<p>Pour les utilisateurs ne souhaitant voir que du texte, le sc&#233;nario pr&#233;c&#233;dent sera toujours utilisable. Mais il y
a de bonnes raisons d'ouvrir la &quot;bo&#238;te noire&quot; :
</p>
<p>1) le groupe UNL espagnol a exp&#233;riment&#233; avec succ&#232;s une interface pour la cr&#233;ation interactive de
graphes UNL, en utilisant un AMS et un &#233;diteur de graphes montrant le graphe UNL sous une forme
&quot;localis&#233;e&quot; (les symboles et les lex&#232;mes UNL apparaissent en espagnol),
</p>
<p>2) il est parfois beaucoup plus rapide de changer quelque chose dans une repr&#233;sentation graphique : par
exemple, fusionner deux n&#339;uds pour changer &quot;Marie aime la fille de Marie&quot; en &quot;Marie aime sa fille&quot;,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christian BOITET, TSAI Wang-Ju
</p>
<p>3) cela peut m&#234;me &#234;tre n&#233;cessaire, si la correspondance est d&#233;fectueuse et ne peut pas &#234;tre am&#233;lior&#233;e
parce que le texte est tr&#232;s &#233;loign&#233; d'une d&#233;conversion raisonnablement obtenable &#224; partir du graphe,
</p>
<p>4) la technologie des interfaces utilisateur a fait beaucoup de progr&#232;s, et il existe des outils de
construction d'environnements conviviaux de manipulation directe,
</p>
<p>5) enfin, les jeunes manipulent des interfaces complexes de fa&#231;on tr&#232;s naturelle et experte, bien mieux
que leurs a&#238;n&#233;s !
</p>
<p>1.4 Ce qu'on peut et ne peut pas faire
</p>
<p>Nous identifions quatre types d'erreurs fr&#233;quents dans le corpus que nous avons analys&#233;s :
</p>
<p>1) des graphes contiennent de l'information fausse : mauvais attachement, mauvais choix d'UW, mauvais
attribut, mauvaise relation s&#233;mantique&#8230;
</p>
<p>2) de l'information manque dans des graphes, comme illustr&#233; ci-dessus,
3) il n'y a pas de texte parce que le graphe UNL est formellement incorrect (cela peut &#234;tre d&#251; &#224; une
</p>
<p>manipulation humaine erron&#233;e, &#224; une bogue dans le d&#233;convertisseur&#8230;) : parenth&#232;se manquante, absence
de n&#339;ud d'entr&#233;e dans un graphe ou un sous-graphe&#8230;,
</p>
<p>4) il y a des  erreurs de d&#233;conversion.
Notre m&#233;thode peut &#234;tre utilis&#233;e pour corriger les 2 premiers types d'erreur seulement. Si un graphe est
formellement incorrect, il peut &#234;tre affichable ou non. Dans le premier cas, il devrait &#234;tre possible de le
manipuler et de le corriger graphiquement, par exemple en connectant deux parties non reli&#233;es ou en
choisissant un n&#339;ud d'entr&#233;e. Dans le second cas, il est n&#233;cessaire de travailler sur une repr&#233;sentation
textuelle, mais c'est pour les experts (hackers) !
Si le d&#233;convertisseur vers Li est faux, changer le graphe ne servira sans doute &#224; rien.. Dans ce cas,
l'utilisateur peut encore corriger le texte &#224; la main (derni&#232;re zone). Ces cas devraient &#234;tre enregistr&#233;s
automatiquement (&quot;logu&#233;s&quot;) et envoy&#233;s plus tard comme retour (feed-back) aux d&#233;veloppeurs, avec
&#233;ventuellement des commentaires.
</p>
<p>2 &#201;tablissement d'une correspondance texte&#8596;graphe
</p>
<p>2.1 Nature des correspondances
</p>
<p>La correspondance entre un texte et un graphe UNL peut &#234;tre d&#233;compos&#233;e en liaisons moins complexes,
qui ne sont souvent pas de simples liens, m&#234;me entre mots et n&#339;uds. Nous avons trouv&#233; les types suivants.
</p>
<p>Niveau MS graphe UNL Niveau MS graphe UNL
lemme
arbre (fran&#231;ais)
</p>
<p>t&#234;te UW (headword)
&quot;tree&quot;
</p>
<p>particule
$&quot; &quot;(Chinese)
</p>
<p>attribut
.@complete
</p>
<p>lemme
&#202;&#194;&#204;&#203;&#218;&#184;&#210;fl (russe)
</p>
<p>UW compl&#232;te
marry(agt&gt;male)
</p>
<p>trait MS d'actualisation
plural
</p>
<p>attribut
.@pl
</p>
<p>morph&#232;me
-tion (fran&#231;ais, anglais)
-&quot; &quot; (chinois &quot;nan2&quot;)
</p>
<p>restriction d'UW
(icl&gt;action)
(agt&gt;male)
</p>
<p>trait s&#233;mantique MS
his
</p>
<p>relation
pos(*, he)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La co&#233;dition pour partager la post&#233;dition entre plusieurs langues&#8230;
</p>
<p>Il y a aussi des liaisons entre plusieurs mots non n&#233;cessairement connexes et un n&#339;ud (par exemple, un
verbe avec particule s&#233;parable), ainsi qu'entre des attributs d'un n&#339;ud et plusieurs &#233;l&#233;ments textuels
(temps+modalit&#233; et auxiliaires). On peut aussi &#233;tablir des liaisons entre syntagmes et sous-graphes.
</p>
<p>1.2 Division en trois sous-correspondances
</p>
<p>Nous avons d&#233;j&#224; commenc&#233; &#224; diviser la correspondance en deux parties: texte &#8596; structure-MS &#8596; graphe-
UNL. La structure MS peut toujours &#234;tre int&#233;gr&#233;e dans un graphe acyclique contenant l'information sur les
n&#339;uds (treille) ou sur les arcs (carte ou chart), de telle sorte que la premi&#232;re partie de la correpsondance
est consitu&#233;e de liaisons entre sous-cha&#238;nes (non n&#233;cessairement connexes) du texte et &#233;l&#233;ments (n&#339;uds ou
arcs) du chemin correspondant &#224; l'interpr&#233;tation pr&#233;f&#233;r&#233;e (en cas d'ambigu&#239;t&#233;).
Il est peut-&#234;tre possible de calculer une correspondence directe entre la structure MS et le graphe UNL,
mais on ne voit pas clairement comment repr&#233;senter les liaisons entre syntagmes et sous-graphes. Pour
cela, une structure d'arbre est bien meilleure. Comme on ne dispose pas (encore) d'analyseur syntaxo-
s&#233;mantique libre et &#224; large couverture, pour la grande majorit&#233; des langues, on ne peut m&#234;me pas utiliser
un arbre produit par un analyseur superficiel. Mais il est possible d'associer un &quot;arbre-UNL standard&quot; &#224;
tout graphe UNL par une transformation algorithmique r&#233;versible (Blanc 2001, Boguslavsky, et al. 2000,
S&#233;rasset &amp; Boitet 1999) : partant du n&#339;ud d'entr&#233;e ext&#233;rieur, parcourir le graphe et ses sous-graphes
(scopes) r&#233;cursivement, tout en cr&#233;ant des n&#339;uds auxiliaires pour les sous-graphes, des relations
s&#233;mantique &quot;inverses&quot; pour les arcs allant dans la &quot;mauvaise&quot; direction, et des symboles de coindexation
pour repr&#233;senter la r&#233;entrance sans duplication.
</p>
<p>On peut aussi tirer parti du fait qu'on a une structure de plus en l'enrichissant avec des unit&#233;s lexicales de
L0. La correspondance est maintenant divis&#233;e en 3 parties :
</p>
<p>&#8226; texte-L0 &#8596; MS-L0 (une treille ou une carte),
&#8226; MS-L0 &#8596; arbre-UNL+L0 (un arbre abstrait non ordonn&#233; proche d'un arbre de d&#233;pendance), et
&#8226;  arbre-UNL+L0 &#8596; graphe-UNL (les liaisons peuvent &#234;tre produites en modifiant la transformation
</p>
<p>r&#233;versible standard graphe&#8594;arbre).
Un autre avantage de l'introduction de cette structure d'arbre est que les correspondances entre les cha&#238;nes
et les arbres ont &#233;t&#233; beaucoup &#233;tudi&#233;es (Boitet &amp; Zaharin 1988, Vauquois &amp; Chappuy 1985, Zaharin
1986). Elles peuvent &#234;tre encod&#233;es par deux attributs exprimant ce qu'un n&#339;ud couvre lexicalement
(SNODE) et syntagmatiquement, en tant que racine d'un sous-arbre (STREE).
</p>
<p>3 &#201;tat d'avancement et recherches voisines
</p>
<p>3.1 Plate-forme exp&#233;rimentale
Nous avons impl&#233;ment&#233; un site web appel&#233; SWIIVRE-UNL (Site Web pour l'Initiation, l'Information, la
Validation, la Recherche et l'Exp&#233;rimentation sur UNL (Tsai 2001)) pour servir de base exp&#233;rimentale &#224;
notre recherche. Il permet pour l'instant :
</p>
<p>&#8226; d'obtenir de l'information dynamique sur les sites de d&#233;conversion UNL disponibles,
&#8226; d'acc&#233;der &#224; une collection de documents (sp&#233;cifications, articles&#8230;) sur UNL,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christian BOITET, TSAI Wang-Ju
</p>
<p>&#8226;  de parcourir une collection de phrases et de graphes UNL align&#233;s dans beaucoup de langues
(quoique FB2002 soit le seul sous-ensemble vraiment consistant) : chap&#238;tre de la Bible, aritcles de
journaux sur le football, Charte de l'ONU, documentation technique&#8230;
</p>
<p>&#8226;  d'exp&#233;rimenter la d&#233;conversion multilingue d'un graphe UNL en le collant simplement dans
d'essayer la premi&#232;re version d'un &#233;diteur de graphes UNL orient&#233; vers le web et XML, et
programm&#233; en utilisant plus de balises (UNL-xml-ed), DOM, et javascript  (Jitkue 2001).
L'interface de r&#233;vision esquiss&#233; ci-dessus est en construction par trois &#233;tudiants de DESS.
</p>
<p>3.2 Construction de la correspondance treille&#8596;arbre
</p>
<p>Voici la premi&#232;re m&#233;thode, en cours d'impl&#233;mentation, que nous avons trouv&#233;e pour &#233;tablir une
&quot;meilleure&quot; correspondance.
</p>
<p>On commence avec une treille MS-L0 reli&#233;e au texte et un arbre-UNL produit de fa&#231;on standard et reli&#233; au
graphe UNL. Le but est d'&#233;tablir des liaisons entre la treille et l'arbre, et d'ordonner l'arbre de fa&#231;on &#224; ce
qu'il soit &quot;maximalement align&#233;&quot; avec la treille, et donc avec le texte. Une liaison est simplement, comme
dans un diagramme entit&#233;-relation, une &quot;bo&#238;te de relation&quot; avec une liste ordonn&#233;e de liens vers la treille,
et une autre vers l'arbre. Supposons aussi, a minima, qu'on dispose seulement d'un dictionnaire L0-anglais,
et pas de dictionnaires L0-UNL.
</p>
<p>D'abord, on enrichit la treille avec les lemmes anglais et l'arbre avec des lemmes de L0, ce qui transforme
ces deux structures en MS-L0+EN et arbre-UNL+L0.
</p>
<p>Ensuite, on &#233;tablit des liens entre les n&#339;uds de la treille et de l'arbre ayant des lemmes en commun (en L0
ou en anglais), on calcule un score pour chaque chemin dans la treille, et on choisit le meilleur.
La phase suivante consiste &#224; aligner l'arbre avec ce chemin, en utilisant les liens &quot;s&#251;rs&quot; comme point de
d&#233;part, et les contraintes sur les liaisons STREE et SNODE : s'il y a des liens qui se croisent, ce qui est
possible si deux mots du texte ont des sens similaires, on donne la pr&#233;f&#233;rence au lien qui maximise la
proximit&#233; dans l'arbre et dans le texte.
</p>
<p>On &#233;tablit ensuite les liaisons des autres types : lex&#232;mes avec relations s&#233;mantiques (&#224;, dans&#8230; pour plc ou
plt ; de, depuis pour org ou plf&#8230;), lex&#232;mes avec attributs UNL, et attributs MS avec attributs UNL.
</p>
<p>3.3 Recherches voisines
</p>
<p>L'envoi automatique de retours aux d&#233;veloppeurs se fait d&#233;j&#224; dans certains syst&#232;mes de TA, en particulier
&#224; Taiwan (EKS) et &#224; la PAHO7 (Vasconcellos &amp; Le&#243;n 1988), mais devrait &#234;tre beaucoup plus pratiqu&#233;.
L'id&#233;e de la co&#233;dition n'est pas nouvelle : l'UPM (Madrid) l'utilise pour cr&#233;er des graphes UNL, Y. Lepage
&#224; ATR et Tand E. K. at l'USM (Penang) ont d&#233;velopp&#233; des &#233;diteurs de correspondances cha&#238;ne-arbre,
Watanabe &#224; IBM-Japon a montr&#233; une tr&#232;s jolie interface pour &#233;diter du texte &#224; partir de sa structure de
d&#233;pendance sous-jacente, le syst&#232;me MULTIMETEO (Coch &amp; Chevreau 2001) est en fait un syst&#232;me de
co&#233;dition pour les pr&#233;visions m&#233;t&#233;o et leurs structures s&#233;mantiques sous-jacentes, en six langues, et il y a
un projet &#224; Xerox visant la g&#233;n&#233;ration multilingue et la normalisation de textes libres dans des domaines et
des typologies restreints comme les notices pharmaceutiques.
</p>
<p>                                                      
</p>
<p>7
 Pan American Health Organization (Washington, D. C. et Gen&#232;ve)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La co&#233;dition pour partager la post&#233;dition entre plusieurs langues&#8230;
</p>
<p>Dans notre cas, il y a plusieurs diff&#233;rences majeures : (1) la co&#233;dition doit &#234;tre faite du c&#244;t&#233; du
consommateur, et pas, comme &#224; l'UPM, du c&#244;t&#233; du producteur ; (2) il n'y a pas de domaine ou de
typologie sp&#233;cifique ; (3) l'id&#233;e de d&#233;river un arbre s&#233;mantique abstrait d'un texte &#224; partir d'une
repr&#233;sentation interlingue en utilisant des techniques d'alignement et de satisfaction de contraintes, et pas
un syst&#232;me de r&#232;gles int&#233;gr&#233; &#224; un g&#233;n&#233;rateur, ni a fortiori quelque analyseur que ce soit, semble nouvelle.
</p>
<p>Conclusion
La co&#233;dition d'un texte en langue naturelle et de sa repr&#233;sentation dans une certaine forme interlingue
para&#238;t &#234;tre la meilleure fa&#231;on de partager la r&#233;vision entre plusieurs langues, ce qu'on n'a encore jamais
imagin&#233; pouvoir faire. Pour diff&#233;rentes raisons les graphes UNL sont les meilleurs candidats.
</p>
<p>Nous avons d&#233;crit une approche o&#249;, dans le sc&#233;nario avec partage le plus simple, des utilisateurs &quot;na&#239;fs&quot;
interagissent directement avec le texte dans leur langue (L0), et indirectement avec le graphe associ&#233; pour
corriger les erreurs. Le graphe modifi&#233; est ensuite envoy&#233; au d&#233;convertisseur UNL-L0 et le r&#233;sultat est
affich&#233;. S'il est satisfaisant, les erreurs &#233;taient probablement dues au graphe et non au d&#233;convertisseur, et
le graphe est envoy&#233; aux d&#233;convertisseurs vers d'autres langues. Les versions dans certaines autres langues
connues de l'utilisateur peuvent &#234;tre affich&#233;es, de sorte que le partage de l'am&#233;lioration soit visible et
encourageant. Comme les nouvelles versions sont ajout&#233;es dans le document multilingue original avec des
balises et des attributs appropri&#233;s, rien n'est jamais perdu, et le travail coop&#233;ratif sur un m&#234;me document
est rendu possible.
</p>
<p>Le prototype en cours d'impl&#233;mentation permettra un second sc&#233;nario, dans lequel on pourra aussi voir et
manipuler directement le graphe UNL donn&#233;, une treille ou une &quot;carte&quot; produite par tout analyseur
morphosyntaxique libre disponible pour L0, et un arbre abstrait produit non pas par analyse, mais par une
transformation standard du graphe UNL suivie par un enrichissement lexical en L0, et un alignement avec
la treille ou la carte, et donc avec le texte.
</p>
<p>Du c&#244;t&#233; interne, des liaisons sont &#233;tablies entre des &#233;l&#233;ments du texte et du graphe en utilisant des
ressources largement disponibles comme un dictionnaire L0-anglais, ou mieux L0-UNL, un analyseur
morphosyntaxique de L0, et une transformation canonique de graphe UNL &#224; arbre. On peut &#233;tablir une
&quot;meilleure&quot; correspondance entre &quot;l'arbre-UNL+L0&quot; et la &quot;structure MS-L0&quot;, une treille, en utilisant le
dictionnaire et en cherchant &#224; aligner l'arbre et un chemin avec aussi peu que possible de croisements de
liens.
</p>
<p>Un but central de cette recherche est de fusionner les approches de la TA par pivot, de la TA interactive, et
de la g&#233;n&#233;ration multilingue de texte. La co&#233;dition appara&#238;t comme le concept unificateur.
</p>
<p>R&#233;f&#233;rences
Al Assimi A.-B. (2000) Gestion de l'&#233;volution non centralis&#233;e de documents parall&#232;les multilingues.
</p>
<p>Nouvelle th&#232;se, UJF, Grenoble, 31/10/00, 200 p.
Al Assimi A.-B., &amp; Boitet C. (2001) Management of Non-Centralized Evolution of Parallel Multilingual
</p>
<p>Documents. Proc. of Internationalization Track, 10th International World Wide Web Conference, Hong
Kong, May 1-5, 2001, 7 p.
</p>
<p>Blanc E. (2001) From graph to tree : Processing  UNL graph using an existing MT system. Proc. of First
UNL Open Conference - Building Global Knowledge with UNL, Suzhou, China, 18-20 Nov. 2001,
UNDL (Geneva), 6 p.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christian BOITET, TSAI Wang-Ju
</p>
<p>Boguslavsky I., Frid N., Iomdin L., Kreidlin L., Sagalova I., &amp; Sizov V. (2000) Creating a Universal
Networking Language Module within an Advanced NLP System. Proc. of COLING-2000, Saarbr&#252;cken,
31/7&#8212;3/8/2000, ACL &amp; Morgan Kaufmann, 1/2, pp. 83-89.
</p>
<p>Boitet C., &amp; Zaharin Y. (1988) Representation trees and string-tree correspondences. Proc. of COLING-
88, Budapest, 22&#8211;27 Aug. 1988, ACL, pp. 59&#8212;64.
</p>
<p>Boitet C. (1999) A research perspective on how to democratize machine translation and translation aids
aiming at high quality final output. Proc. of MT Summit VII, Singapore, 13-17 September 1999, Asia
Pacific Ass. for MT, pp. 125&#8212;133.
</p>
<p>Boitet C. (2001) Four technical and organizational keys for handling more languages and improving
quality (on demand) in MT. Proc. of MTS2001 Workshop on &quot;MT2010 &#8212; Towards a Road Map for
MT&quot;, Santiago de Compostela, 18/9/01, IAMT, 8 p.
</p>
<p>Coch J., &amp; Chevreau K. (2001) Interactive Multilingual Generation. Proc. of CICLing-2001
(Computational Linguistics and Intelligent Text Processing), Mexico, February 2001, Springer, pp. 239-
250.
</p>
<p>Jitkue P. (2001) Participation au projet SWIIVRE-UNL et premi&#232;re version d&#8217;un environnement Web de
d&#233;conversion multilingue et d&#8217;&#233;diteur UNL de base. Rapport de stage de Ma&#238;trise d'informatique,
Universit&#233; Joseph Fourier, septembre 2001, 13 p.
</p>
<p>S&#233;rasset G., &amp; Boitet C. (1999) UNL-French deconversion as transfer &amp; generation from an interlingua
with possible quality enhancement through offline human interaction. Proc. of MT Summit VII,
Singapore, 13-17 September 1999, Asia Pacific Ass. for MT, pp. 220&#8212;228.
</p>
<p>S&#233;rasset G., &amp; Boitet C. (2000) On UNL as the future &quot;html of the linguistic content&quot; &amp; the reuse of
existing NLP components in UNL-related applications with the example of a UNL-French deconverter.
Proc. of COLING-2000, Saarbr&#252;cken, 31/7&#8212;3/8/2000, ACL &amp; Morgan Kaufmann, 2/2, pp. 768&#8212;774.
</p>
<p>Tsai W.-J. (2001) SWIIVRE &#8212; a web site for the Initiation, Information, Validation, Research and
Experimentation on UNL (Universal Networking Language). Proc. of First UNL Open Conference :
Building Global Knowledge with UNL, Suzhou, China, 18-20 Nov. 2001, UNDL (Geneva), 8 p.
</p>
<p>Uchida H. (1989) ATLAS. Proc. of MTS-II (MT Summit), Munich, 16-18 ao&#251;t 1989, pp. 152-157.
Vasconcellos M., &amp; Le&#243;n M. (1988) SPANAM and ENGSPAN : Machine Translation at the Pan
</p>
<p>American Health Organization. In Machine Translation systems, edited by Slocum, Cambridge Univ.
Press, pp. 187&#8212;236.
</p>
<p>Vauquois B., &amp; Chappuy S. (1985) Static grammars: a formalism for the description of linguistic models.
Proc. of TMI-85 (Conf. on theoretical and metholodogical issues in the Machine Translation of natural
languages), Aug. 1985, pp. 298-322.
</p>
<p>Zaharin Y. (1986) Strategies and heuristics in the analysis of a natural language in Machine Translation.
Proc. of COLING-86, Bonn, Aug. 1986, pp. 136&#8212;139.
</p>
<p>-o-o-o-o-o-o-o-o-o-</p>

</div></div>
</body></html>