<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Combinaison d'approches pour l'extraction automatique d'&#233;v&#233;nements</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 423&#8211;430,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Combinaison d&#8217;approches pour l&#8217;extraction automatique
d&#8217;&#233;v&#233;nements
</p>
<p>Laurie Serrano1, 2 Thierry Charnois1 Stephan Brunessaux2
</p>
<p>Bruno Grilheres2 Maroua Bouzid1
(1) Laboratoire GREYC, Universit&#233; de Caen Basse-Normandie
</p>
<p>Campus C&#244;te de Nacre, Boulevard du Mar&#233;chal Juin, BP 5186 - 14032 Caen
(2) D&#233;partement IPCC, Cassidian
</p>
<p>Parc d&#8217;Affaires des Portes - 27600 Val de Reuil
prenom.nom@unicaen.fr, prenom.nom@cassidian.com
</p>
<p>R&#201;SUM&#201;
Dans cet article, nous pr&#233;sentons un syst&#232;me d&#8217;extraction automatique d&#8217;&#233;v&#233;nements fond&#233;
sur deux approches actuelles en extraction d&#8217;information : la premi&#232;re s&#8217;appuie sur des r&#232;gles
linguistiques construites manuellement et la seconde se fonde sur un apprentissage automa-
tique de patrons linguistiques. Les exp&#233;rimentations r&#233;alis&#233;es montrent que combiner ces deux
m&#233;thodes d&#8217;extraction permet d&#8217;am&#233;liorer significativement la qualit&#233; des &#233;v&#233;nements extraits
(am&#233;lioration de pr&#232;s de 10 points de F-mesure).
</p>
<p>ABSTRACT
Automatic events extraction by combining multiple approaches
</p>
<p>In this paper, we present an automatic system for extracting events based on the combination of
two existing information extraction approaches : the first one is made of hand-crafted linguistic
rules and the second one is based on an automatic learning of linguistic patterns. We have shown
that this mixed approach leads to a significant improvement of extraction performances.
</p>
<p>MOTS-CL&#201;S : Extraction d&#8217;information, &#233;v&#233;nements, approche symbolique, apprentissage de
patrons linguistiques.
</p>
<p>KEYWORDS: Text mining, events, symbolic extraction, linguistic pattern learning.
</p>
<p>1 Introduction
</p>
<p>Face &#224; l&#8217;augmentation vertigineuse des informations disponibles librement (en particulier sur
le Web), rep&#233;rer efficacement celles qui peuvent nous int&#233;resser s&#8217;av&#232;re une t&#226;che longue et
complexe. En r&#233;ponse &#224; cela, l&#8217;&#233;quipe IPCC 1 d&#233;veloppe le WebLab 2, une plateforme d&#8217;int&#233;gration
de services de &quot;media mining&quot; 3 pour la d&#233;couverte de connaissances et l&#8217;aide &#224; la d&#233;cision. Nous
pr&#233;sentons dans cet article une &#233;tude comparative de trois approches d&#8217;extraction d&#8217;&#233;v&#233;nements :
une approche symbolique bas&#233;e sur des r&#232;gles linguistiques construites manuellement, une
m&#233;thode d&#8217;apprentissage de patrons linguistiques et une approche mixte. Les exp&#233;riences men&#233;es
</p>
<p>1. Information Processing, Control and Cognition, Cassidian
2. http://weblab-project.org/, consult&#233; le 21/03/2012
3. Fouille de documents multim&#233;dia
</p>
<p>423</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>montrent que la combinaison des deux premi&#232;res m&#233;thodes permet d&#8217;am&#233;liorer significativement
la qualit&#233; des &#233;v&#233;nements extraits. Les travaux pr&#233;sent&#233;s ici sont r&#233;alis&#233;s dans le cadre de l&#8217;&#233;labo-
ration d&#8217;un syst&#232;me plus global de capitalisation des connaissances exploitant les technologies
du Web s&#233;mantique (Serrano et al., 2012). Pr&#233;cisons &#233;galement que les &#233;v&#233;nements que nous
souhaitons extraire ont &#233;t&#233; au pr&#233;alable d&#233;finis dans une ontologie de domaine (nomm&#233;e WOO-
KIE 4). Nous proposons, dans un premier temps, un rapide tour d&#8217;horizon des travaux existants en
extraction d&#8217;&#233;v&#233;nements. Puis, nous d&#233;crivons les trois approches propos&#233;es, les exp&#233;rimentations
mises en place, nos premiers r&#233;sultats et les perspectives envisag&#233;es.
</p>
<p>2 Extraction des &#233;v&#233;nements : tour d&#8217;horizon
</p>
<p>L&#8217;extraction d&#8217;information est une discipline r&#233;cente qui consiste &#224; analyser un texte de mani&#232;re
automatique afin d&#8217;en extraire un ensemble d&#8217;informations jug&#233;es pertinentes (Poibeau, 2003).
Deux approches dites &quot;classiques&quot; &#233;mergent : l&#8217;extraction bas&#233;e sur des techniques linguistiques
et les syst&#232;mes statistiques. Les t&#226;ches les plus communes en extraction d&#8217;information sont l&#8217;ex-
traction d&#8217;entit&#233;s nomm&#233;es (Nadeau et Sekine, 2007), de relations entre entit&#233;s et d&#8217;&#233;v&#233;nements.
L&#8217;extraction d&#8217;&#233;v&#233;nements est particuli&#232;rement utilis&#233;e dans les activit&#233;s de veille &#233;conomique et
strat&#233;gique ((Capet et al., 2011) pour la d&#233;tection de crise). Celle-ci peut-&#234;tre con&#231;ue comme une
forme particuli&#232;re d&#8217;extraction de relations o&#249; une &quot;action&quot; est li&#233;e &#224; d&#8217;autres entit&#233;s telles qu&#8217;une
date, un lieu, des participants, etc. Plusieurs campagnes MUC 5 s&#8217;y sont int&#233;ress&#233; avec notamment
des t&#226;ches de remplissage automatique de formulaires (&quot;template filling&quot;). Comme en extraction
d&#8217;information de fa&#231;on g&#233;n&#233;rale, la litt&#233;rature du domaine offre &#224; la fois des travaux bas&#233;s sur
des approches symboliques et des techniques purement statistiques. (Aone et Ramos-Santacruz,
2000) d&#233;veloppe REES, un extracteur d&#8217;&#233;v&#233;nements bas&#233; sur des r&#232;gles linguistiques construites
manuellement coupl&#233;es &#224; une analyse syntagmatique. Dans la lign&#233;e, (Grishman et al., 2002)
s&#8217;int&#233;resse &#224; la d&#233;tection d&#8217;&#233;v&#233;nements &#233;pid&#233;miques au moyen d&#8217;un transducteur &#224; &#233;tats finis.
Toutefois, ces m&#233;thodes purement linguistiques, bien que g&#233;n&#233;ralement tr&#232;s pr&#233;cises, ont pour
principales faiblesses d&#8217;&#234;tre sp&#233;cifiques &#224; un domaine donn&#233;, d&#8217;avoir un taux de rappel plut&#244;t
faible et un co&#251;t de d&#233;veloppement manuel &#233;lev&#233;. Du c&#244;t&#233; des approches statistiques, (Ahn, 2006)
propose de combiner plusieurs classifieurs pour l&#8217;extraction des &#233;v&#233;nements dans la campagne
ACE. L&#8217;apprentissage statistique permet de pr&#233;voir de nombreux contextes d&#8217;apparition mais
n&#233;cessite une grande quantit&#233; de donn&#233;es annot&#233;es pour &#234;tre performant et construit un mod&#232;le
de type &quot;boite noire&quot; non-accessible et non-modifiable. Face &#224; cela, les m&#233;thodes d&#8217;apprentissage
de patrons ou les approches semi-supervis&#233;es apparaissent int&#233;ressantes comme par exemple
le syst&#232;me de (Xu et al., 2006). Observant que toutes ces approches prises s&#233;par&#233;ment restent
imparfaites, nous proposons d&#8217;&#233;laborer une approche hybride permettant d&#8217;exploiter les points
forts des m&#233;thodes &quot;classiques&quot;. Pour cela, nous avons choisi, de compl&#233;ter les performances d&#8217;un
extracteur d&#8217;&#233;v&#233;nements symbolique par un syst&#232;me d&#8217;apprentissage de patrons linguistiques.
</p>
<p>3 Mod&#233;lisation des &#233;v&#233;nements
</p>
<p>L&#8217;&#233;v&#233;nement &#233;tant l&#8217;objet central de nos travaux, il est n&#233;cessaire de d&#233;finir plus pr&#233;cis&#233;ment ce
concept. Consid&#233;r&#233; comme une entit&#233; aux propri&#233;t&#233;s sp&#233;cifiques, l&#8217;&#233;v&#233;nement a particuli&#232;rement
</p>
<p>4. Weblab Ontology for Open sources Knowledge and Intelligence Exploitation
5. Message Understanding Conference
</p>
<p>424</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#233;t&#233; &#233;tudi&#233; en philosophie (Davidson, 2001) et en linguistique (Van De Velde, 2006). Apr&#232;s avoir
consid&#233;r&#233; diff&#233;rents travaux, nous prenons pour point de d&#233;part la d&#233;finition de (Krieg-Planque,
2009) qui nous para&#238;t adapt&#233;e : &quot;un &#233;v&#233;nement est une occurrence per&#231;ue comme signifiante
dans un certain cadre&quot;. Afin de proposer une repr&#233;sentation plus formelle d&#8217;un &#233;v&#233;nement, nous
nous appuyons sur les travaux de (Saval et al., 2009) qui propose une extension s&#233;mantique pour
la mod&#233;lisation des &#233;v&#233;nements de type &quot;catastrophes naturelles&quot;. Celui-ci d&#233;finit un &#233;v&#233;nement E
comme la combinaison de 3 composantes : une propri&#233;t&#233; s&#233;mantique S, un intervalle temporel I ,
et une entit&#233; spatiale SP. Un &#233;v&#233;nement est donc repr&#233;sent&#233; sous la forme E&#9001;I , SP, S&#9002;. Dans notre
cas, la propri&#233;t&#233; s&#233;mantique est d&#233;finie par les diff&#233;rents types d&#8217;&#233;v&#233;nement de notre ontologie
(que nous d&#233;crivons plus loin), la composante temporelle constitue la date ou p&#233;riode d&#8217;occur-
rence d&#8217;un &#233;v&#233;nement et l&#8217;entit&#233; spatiale correspond &#224; son lieu d&#8217;occurrence. Nous proposons
d&#8217;adapter cette repr&#233;sentation &#224; notre domaine d&#8217;application en l&#8217;enrichissant d&#8217;une composante
suppl&#233;mentaire A correspondant aux diff&#233;rents participants impliqu&#233;s dans l&#8217;&#233;v&#233;nement. Nous
avons donc maintenant E&#9001;I , SP, S, A&#9002; o&#249; A est un ensemble de participants jouant un ou plusieurs
r&#244;le(s). Un participant est not&#233; Pi o&#249; 0&#8804; i &lt; n et un r&#244;le est not&#233; r j o&#249; 0&#8804; j &lt; k. La composante
A est donc d&#233;finie de la fa&#231;on suivante : A= {(P&#945;, r&#946;)} tel que le participant P&#945; joue le r&#244;le r&#946;
dans l&#8217;&#233;v&#233;nement en question. Cette mod&#233;lisation a &#233;t&#233; impl&#233;ment&#233;e au sein de notre ontologie
de domaine WOOKIE, centr&#233;e sur 5 classes sup&#233;rieures : &quot;Event&quot;, &quot;Person&quot;, &quot;Unit&quot;, &quot;Place&quot; et
&quot;Equipment&quot;. Les diff&#233;rentes approches compar&#233;es dans cet article visent &#224; extraire la vingtaine
d&#8217;&#233;v&#233;nements suivants : &quot;AttackEvent&quot;, &quot;BombingEvent&quot;, &quot;ShootingEvent&quot;, &quot;CrashEvent&quot;, &quot;Dama-
geEvent&quot;, &quot;DeathEvent&quot;, &quot;FightingEvent&quot;, &quot;InjureEvent&quot;, &quot;KidnappingEvent&quot;, &quot;MilitaryOperation&quot;,
&quot;ArrestOperation&quot;, &quot;HelpOperation&quot;, &quot;PeaceKeepingOperation&quot;, &quot;SearchOperation&quot;, &quot;Surveillan-
ceOperation&quot;, &quot;TrainingOperation&quot;, &quot;TroopMovementOperation&quot;, &quot;NuclearEvent&quot;, &quot;TrafficEvent&quot;.
</p>
<p>4 Extraction des &#233;v&#233;nements : approches propos&#233;es
</p>
<p>4.1 Approche &#224; base de r&#232;gles linguistiques
</p>
<p>L&#8217;approche que nous pr&#233;sentons ici a &#233;t&#233; impl&#233;ment&#233;e gr&#226;ce &#224; la plateforme d&#8217;ing&#233;nierie textuelle
GATE 6 et vise &#224; extraire un ensemble d&#8217;&#233;v&#233;nements tels que d&#233;finis ci-dessus ainsi que les
participants et circonstants suivants : la date de l&#8217;&#233;v&#233;nement, son lieu d&#8217;occurrence et les entit&#233;s
de type &quot;personne&quot; et &quot;organisation&quot; impliqu&#233;es. La figure 1 r&#233;sume les diff&#233;rentes &#233;tapes de notre
approche (le rep&#233;rage des r&#244;les ne sera pas trait&#233; dans cet article, pour une description d&#233;taill&#233;e se
r&#233;f&#233;rer &#224; (Serrano et al., 2011)). Notre syst&#232;me repose sur une chaine de traitement compos&#233;e de
diff&#233;rents modules d&#8217;analyse linguistique (&quot;tokenisation&quot;, d&#233;coupage en phrases, rep&#233;rage lexical,
&#233;tiquetage grammatical, analyse syntaxique, transducteur &#224; &#233;tats finis, etc.). Nous d&#233;finissons
tout d&#8217;abord un ensemble de termes consid&#233;r&#233;s comme possibles d&#233;clencheurs d&#8217;&#233;v&#233;nement
(dits &quot;noms d&#8217;&#233;v&#233;nement&quot;). Nous choisissons de nous limiter, pour l&#8217;instant, aux d&#233;clencheurs
verbaux et nominaux et de constituer des listes de lemmes, plus courtes et permettant d&#8217;&#233;tendre
le rep&#233;rage &#224; toutes les formes fl&#233;chies. Ces d&#233;clencheurs (139 lemmes actuellement) sont
r&#233;partis en diff&#233;rentes listes, chacune &#233;tant associ&#233;e &#224; un type d&#8217;&#233;v&#233;nement (c&#8217;est-&#224;-dire &#224; une
classe d&#8217;&#233;v&#233;nement de notre ontologie) afin d&#8217;&#234;tre rep&#233;r&#233;s et annot&#233;s dans le corpus &#224; analyser.
Nous associons ensuite &#224; ces &quot;noms d&#8217;&#233;v&#233;nement&quot; les diff&#233;rentes entit&#233;s qu&#8217;ils impliquent. Pour
</p>
<p>6. General Architecture for Text Engineering
</p>
<p>425</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>cela, nous effectuons, dans un premier temps, une extraction automatique d&#8217;entit&#233;s nomm&#233;es 7
</p>
<p>ainsi qu&#8217;une analyse en constituants syntaxiques (syntagmes verbaux, nominaux, etc.). Enfin,
ces diff&#233;rents &#233;l&#233;ments sont rattach&#233;s au &quot;nom d&#8217;&#233;v&#233;nement&quot; gr&#226;ce &#224; une analyse syntaxique
en d&#233;pendance (r&#233;alis&#233;e par le Stanford Parser 8) ainsi que des r&#232;gles de grammaire &#233;labor&#233;es
manuellement (dans le langage JAPE 9). A l&#8217;heure actuelle, nous obtenons une annotation
positionn&#233;e sur le &quot;nom d&#8217;&#233;v&#233;nement&quot; r&#233;sumant ses diff&#233;rents participants et circonstants et
indiquant pour chacun d&#8217;eux s&#8217;il correspond &#224; une entit&#233; nomm&#233;e d&#233;tect&#233;e pr&#233;c&#233;demment.
</p>
<p>FIGURE 1 &#8211; Chaine d&#8217;extraction d&#8217;&#233;v&#233;nements pour l&#8217;anglais
</p>
<p>4.2 Apprentissage de patrons linguistiques
</p>
<p>Par ailleurs, nous nous int&#233;ressons &#224; l&#8217;extraction d&#8217;&#233;v&#233;nements par une technique d&#8217;extraction
de motifs s&#233;quentiels fr&#233;quents. Ce type d&#8217;approche permet d&#8217;apprendre automatiquement des
patrons linguistiques compr&#233;hensibles et modifiables par un expert linguiste. La d&#233;couverte de
motifs s&#233;quentiels a &#233;t&#233; introduite par (Agrawal et al., 1993) dans le domaine du &quot;data mining&quot;
et adapt&#233;e par (Cellier et Charnois, 2010) &#224; l&#8217;extraction d&#8217;information dans les textes. Ceux-ci
s&#8217;int&#233;ressent en particulier &#224; l&#8217;extraction de motifs s&#233;quentiels d&#8217;itemsets. Il s&#8217;agit de rep&#233;rer,
dans un ensemble de s&#233;quences, des enchainements d&#8217;items ayant une fr&#233;quence d&#8217;apparition
sup&#233;rieure &#224; un seuil donn&#233; (dit &quot;support&quot;). La recherche de ces motifs s&#8217;effectue dans une base
de s&#233;quences ordonn&#233;es d&#8217;itemsets o&#249; chaque s&#233;quence correspond &#224; une unit&#233; de texte (ici
la phrase). Un itemset est un ensemble d&#8217;items d&#233;crivant un mot de cette s&#233;quence. Un item
correspond &#224; une caract&#233;ristique particuli&#232;re de ce mot telle que la cat&#233;gorie grammaticale,
le lemme, la forme fl&#233;chie, etc. Un certain nombre de param&#232;tres peuvent &#234;tre adapt&#233;s selon
l&#8217;application vis&#233;e : nature de la s&#233;quence et des items, nombre d&#8217;items, support, etc. La fouille
sur un ensemble de s&#233;quences d&#8217;itemsets permet l&#8217;extraction de motifs combinant plusieurs
types d&#8217;item et d&#8217;obtenir ainsi des patrons g&#233;n&#233;riques, sp&#233;cifiques ou mixant les informations (ce
qui n&#8217;est pas permis par les motifs d&#8217;items simples), comme par exemple les patrons suivants :
&lt;homme de culture&gt; &lt;homme de N&gt; &lt;N PRP N&gt; 10, etc. De plus, contrairement aux diff&#233;rentes
approches que nous venons de mentionner, l&#8217;apprentissage de patrons ne n&#233;cessite ni corpus
annot&#233; avec les entit&#233;s-cibles, ni analyse syntaxique. Cela constitue un r&#233;el avantage car, tout
</p>
<p>7. Extraction des dates, lieux, personnes et organisations r&#233;alis&#233;e par une chaine GATE (Serrano et al., 2011)
8. http://nlp.stanford.edu/software/lex-parser.shtml
9. Java Annotation Patterns Engine
</p>
<p>10. N pour la cat&#233;gorie nom, PRP pour pr&#233;position
</p>
<p>426</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;abord, l&#8217;annotation manuelle de corpus reste un effort important et l&#8217;analyse syntaxique est
encore une technologie aux performances in&#233;gales et peu disponible librement selon les langues.
Le point faible partag&#233; par toutes ces m&#233;thodes d&#8217;apprentissage symbolique reste le nombre
important de motifs extraits. Pour pallier ce probl&#232;me, (Cellier et Charnois, 2010) propose l&#8217;ajout
de contraintes pour diminuer la quantit&#233; de motifs retourn&#233;s. Dans la lign&#233;e de ces travaux, nous
utilisons l&#8217;outil d&#8217;extraction de motifs s&#233;quentiels d&#233;velopp&#233; au GREYC (B&#233;chet et al., 2012).
Celui-ci pr&#233;sente plusieurs points forts : il extrait uniquement des motifs dits &quot;clos&quot; (c&#8217;est-&#224;-dire
non redondants) et g&#233;n&#232;re ainsi moins de motifs que d&#8217;autres syst&#232;mes. De plus, ce logiciel s&#8217;av&#232;re
robuste et permet la fouille de s&#233;quences d&#8217;itemsets, fonctionnalit&#233; qui est rarement propos&#233;e
par les outils existants. Nous avons adapt&#233; la fouille de motifs &#224; notre domaine d&#8217;application et
au traitement de d&#233;p&#234;ches de presse dans le but d&#8217;obtenir des patrons linguistiques permettant
la d&#233;tection d&#8217;&#233;v&#233;nements. Ainsi, notre approche propose tout d&#8217;abord de pr&#233;-traiter un corpus
gr&#226;ce &#224; l&#8217;outil TreeTagger 11 afin d&#8217;obtenir un d&#233;coupage en s&#233;quences (ici en phrases) ainsi que
diff&#233;rents types d&#8217;items : forme fl&#233;chie, lemme, cat&#233;gorie grammaticale. Elle n&#233;cessite &#233;galement
une annotation s&#233;mantique en entit&#233;s nomm&#233;es. Enfin, nous effectuons un rep&#233;rage lexical
des &quot;noms d&#8217;&#233;v&#233;nement&quot; et de leur type. Comme pr&#233;vu, le nombre de motifs retourn&#233;s par
l&#8217;outil s&#8217;av&#232;re &#233;lev&#233;, nous introduisons donc un ensemble de contraintes sp&#233;cifiques &#224; notre
application : des contraintes linguistiques d&#8217;appartenance (nous pouvons par exemple choisir de
ne retourner que des motifs contenant au moins un &quot;nom d&#8217;&#233;v&#233;nement&quot; et une date) mais aussi
une contrainte dite de &quot;gap&quot; (Dong et Pei, 2007), autorisant l&#8217;extraction de motifs ne contenant
pas n&#233;cessairement des itemsets cons&#233;cutifs (contrairement aux n-grammes dont les &#233;l&#233;ments
sont strictement contigus). Ainsi un &quot;gap&quot; d&#8217;une valeur maximale n signifie qu&#8217;au maximum n
itemsets (mots) sont pr&#233;sents entre chaque itemset du motif dans les s&#233;quences correspondantes.
Cette approche non-supervis&#233;e n&#233;cessite une s&#233;lection manuelle des motifs pertinents. Pour cela,
nous utilisons l&#8217;outil Camelis (Ferr&#233;, 2009) permettant d&#8217;ordonner et visualiser les motifs des
plus g&#233;n&#233;raux aux plus sp&#233;cifiques puis de filtrer les plus pertinents. Les motifs ainsi s&#233;lectionn&#233;s
sont ensuite appliqu&#233;s sur un nouveau corpus afin d&#8217;en extraire les relations vis&#233;es.
</p>
<p>4.3 Vers une approche mixte
</p>
<p>Nous travaillons actuellement &#224; d&#233;finir une m&#233;thode d&#8217;hybridation qui permette d&#8217;exploiter
les forces de chacune des approches pr&#233;sent&#233;es. En effet, comme nous l&#8217;avons d&#233;j&#224; soulign&#233;,
l&#8217;extraction d&#8217;information &#224; base de r&#232;gles &#233;crites manuellement s&#8217;av&#232;re g&#233;n&#233;ralement tr&#232;s pr&#233;cise
mais peu couvrante alors que les techniques d&#8217;apprentissage montrent habituellement un meilleur
rappel. Nous proposons donc, dans un premier temps, d&#8217;effectuer une simple union des r&#233;sultats
des deux extracteurs afin de maximiser le rappel de notre approche mixte (les exp&#233;rimentations
report&#233;es dans cet article sont bas&#233;es sur cette approche).
</p>
<p>5 Exp&#233;rimentations
</p>
<p>Les exp&#233;rimentations pr&#233;sent&#233;es consistent &#224; extraire un ensemble d&#8217;&#233;v&#233;nements d&#8217;un corpus
journalistique en anglais et dont le th&#232;me est d&#8217;int&#233;r&#234;t pour le renseignement. Nous nous
focalisons sur une vingtaine de types d&#8217;&#233;v&#233;nement (cf section 3) et sur les relations suivantes : la
date de l&#8217;&#233;v&#233;nement, son lieu d&#8217;occurrence et les actants impliqu&#233;s (personnes et organisations).
</p>
<p>11. http://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger/
</p>
<p>427</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5.1 Corpus et param&#232;tres d&#8217;apprentissage
</p>
<p>Cette &#233;valuation a n&#233;cessit&#233; les deux corpus suivants :
&#8211; Le premier corpus est un corpus d&#8217;apprentissage n&#233;cessaire &#224; la mise en place de l&#8217;outil
</p>
<p>d&#8217;extraction de motifs s&#233;quentiels fr&#233;quents : il s&#8217;agit d&#8217;un corpus de textes anglais abordant
une th&#233;matique militaire et annot&#233; avec des entit&#233;s nomm&#233;es et des &quot;noms d&#8217;&#233;v&#233;nement&quot;.
Nous avons constitu&#233; ce corpus de mani&#232;re semi-automatique &#224; partir de 400 d&#233;p&#234;ches de
presse sur l&#8217;engagement du Canada en Afghanistan 12 et de 700 d&#233;p&#234;ches parues entre 2003 et
2009 sur le site de l&#8217;ISAF 13. Ce corpus a, dans un premier temps, &#233;t&#233; annot&#233; automatiquement
en entit&#233;s nomm&#233;es et &quot;noms d&#8217;&#233;v&#233;nement&quot; gr&#226;ce &#224; notre outil d&#8217;extraction bas&#233; sur GATE
(Serrano et al., 2011), puis nous avons revu manuellement ces annotations pour corriger les
&#233;ventuels erreurs/oublis et ainsi garantir la qualit&#233; des donn&#233;es d&#8217;apprentissage.
</p>
<p>&#8211; Le second corpus est un corpus de test permettant de comparer notre extraction d&#8217;&#233;v&#233;nements
par rapport &#224; une v&#233;rit&#233;-terrain. Pour cela nous avons choisi d&#8217;utiliser un corpus fourni dans
la campagne d&#8217;&#233;valuation MUC-4 et constitu&#233; de 100 d&#233;p&#234;ches de presse relatant des faits
terroristes en Am&#233;rique du Sud. Notre &#233;valuation porte sur une partie de ce corpus annot&#233;e
manuellement 14, soit environ 210 &#233;v&#233;nements et pr&#232;s de 240 relations (55 relations de type
&quot;date&quot;, 65 relations de type &quot;lieu&quot; et 120 relations de type &quot;participant&quot;).
</p>
<p>Pour mettre en place notre approche d&#8217;apprentissage symbolique, nous avons, tout d&#8217;abord, op&#233;r&#233;
un apprentissage de motifs s&#233;quentiels fr&#233;quents sur le premier corpus en consid&#233;rant quatre
caract&#233;ristiques (quatre types d&#8217;item) : la forme fl&#233;chie du mot, sa cat&#233;gorie grammaticale, son
lemme et sa classe s&#233;mantique (&quot;nom d&#8217;&#233;v&#233;nement&quot;, &quot;date&quot;, &quot;lieu&quot;, &quot;personne&quot; ou &quot;organisation&quot;).
Nous avons choisi de r&#233;aliser une t&#226;che d&#8217;apprentissage par type d&#8217;entit&#233; impliqu&#233;e en utilisant le
syst&#232;me des contraintes d&#8217;appartenance propos&#233; par l&#8217;outil de (B&#233;chet et al., 2012). Nous obtenons
donc quatre s&#233;ries de motifs de type &quot;nom d&#8217;&#233;v&#233;nement&quot;-&quot;date&quot;, &quot;nom d&#8217;&#233;v&#233;nement&quot;-&quot;lieu&quot;, &quot;nom
d&#8217;&#233;v&#233;nement&quot;-&quot;personne&quot; et &quot;nom d&#8217;&#233;v&#233;nement&quot;-&quot;organisation&quot;. Nous avons &#233;galement proc&#233;d&#233; &#224;
plusieurs essais de param&#233;trage et, au regard de ces tests, nous avons choisi de fixer un &quot;gap&quot;
maximal de 3 itemsets (correspondant &#224; 3 mots possibles entre chaque &#233;l&#233;ment du motif) et
un support absolu relativement bas (10 en valeur absolue, soit 6% des s&#233;quences pour tous les
types de relation) afin d&#8217;obtenir des motifs int&#233;ressants mais en nombre raisonnable pour une
exploration et une validation manuelles (environ 12000 motifs au total).
</p>
<p>5.2 R&#233;sultats et discussion
</p>
<p>Nous avons r&#233;alis&#233; manuellement une comparaison des extractions obtenues par chacune des
deux approches (appliqu&#233;e s&#233;par&#233;ment) et celles r&#233;sultant de l&#8217;approche mixte. Le tableau 1
pr&#233;sente les scores de pr&#233;cision, rappel et F-mesure de chaque approche, globalement et par
type de relation. Pr&#233;cisons que ces r&#233;sultats proviennent d&#8217;une extraction de relations fond&#233;e sur
l&#8217;annotation manuelle des entit&#233;s nomm&#233;es que nous avons r&#233;alis&#233;e sur le corpus de test (et non
pas sur une extraction automatique) afin d&#8217;&#233;viter que des erreurs dans l&#8217;extraction des entit&#233;s
viennent perturber l&#8217;extraction de relations. Nous pouvons constater que l&#8217;approche &#224; base de
r&#232;gles et l&#8217;apprentissage de motifs obtiennent tous deux une tr&#232;s bonne pr&#233;cision globale et que,
</p>
<p>12. http://www.afghanistan.gc.ca/canada-afghanistan, consult&#233; le 21/03/2012
13. http://www.nato.int/isaf/docu/pressreleases, consult&#233; le 21/03/2012
14. Nous avons choisi de ne pas r&#233;utiliser les &quot;templates&quot; de r&#233;f&#233;rence fournis avec le corpus car le nombre et le type des
</p>
<p>&#233;v&#233;nements ne correspondaient pas &#224; notre mod&#233;lisation et ne permettaient pas d&#8217;&#233;valuer la totalit&#233; de nos extractions.
</p>
<p>428</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Approche &#224; base de r&#232;gles manuelles Apprentissage de motifs Approche mixte
Pr&#233;cision Rappel F-mesure Pr&#233;cision Rappel F-mesure Pr&#233;cision Rappel F-mesure
</p>
<p>Date 0,93 0,25 0,39 0,90 0,64 0,75 0,90 0,68 0,78
Lieu 0,92 0,37 0,53 0,86 0,49 0,63 0,81 0,60 0,69
</p>
<p>Participants 0,97 0,49 0,42 0,93 0,32 0,47 0,92 0,51 0,66
Toutes relations 0,94 0,37 0,45 0,90 0,48 0,62 0,88 0,60 0,71
</p>
<p>TABLE 1 &#8211; Extraction d&#8217;&#233;v&#233;nements : &#233;valuation des trois approches
</p>
<p>comme attendu, le rappel est meilleur pour cette derni&#232;re approche. Par ailleurs, nous avons
&#233;t&#233; assez surpris par la bonne pr&#233;cision de la m&#233;thode par apprentissage, que nous expliquons
par une s&#233;lection manuelle restrictive et pr&#233;cise des motifs. Les taux de rappel obtenus sont peu
&#233;lev&#233;s : ce r&#233;sultat est conforme &#224; l&#8217;&#233;tat de l&#8217;art pour l&#8217;approche &#224; base de r&#232;gles. Pour l&#8217;approche
&#224; base d&#8217;apprentissage, l&#8217;utilisation d&#8217;un &quot;gap&quot; maximal trop restreint ne permet pas d&#8217;extraire
les relations distantes. Ce qu&#8217;il faut retenir de ces exp&#233;rimentations est que l&#8217;approche mixte
obtient une F-mesure nettement sup&#233;rieure (pr&#232;s de 10 points par rapport &#224; la meilleure des
deux approches), ce qui d&#233;note une am&#233;lioration globale de la qualit&#233; d&#8217;extraction pour tout type
de relation. De plus, nous remarquons que l&#8217;apprentissage de patrons compl&#232;te avec succ&#232;s notre
approche symbolique en augmentant sensiblement le taux global de rappel. Nous constatons
cependant une l&#233;g&#232;re perte de pr&#233;cision qui r&#233;sulte du nombre plus &#233;lev&#233; de r&#232;gles et patrons
linguistiques au sein de l&#8217;approche mixte entra&#238;nant une augmentation des faux positifs.
Apport de l&#8217;analyse syntaxique Parall&#232;lement &#224; ces r&#233;sultats, nous nous sommes int&#233;ress&#233;s &#224;
l&#8217;apport de l&#8217;analyse syntaxique au sein de notre approche mixte : les r&#233;sultats du tableau sont
issus de notre syst&#232;me avec analyse en d&#233;pendance, sans cela nous aurions eu une perte de
performances consid&#233;rable (11 points de F-mesure, 19 points de pr&#233;cision et 1 point de rappel).
Bien que les outils d&#8217;analyse syntaxique soient in&#233;galement disponibles selon les langues, cette
observation confirme l&#8217;int&#233;r&#234;t de cette technique pour l&#8217;extraction d&#8217;&#233;v&#233;nements.
R&#233;sultats avec rep&#233;rage automatique des entit&#233;s nomm&#233;es Pour compl&#233;ter les r&#233;sultats pr&#233;c&#233;-
dents bas&#233;s sur une annotation manuelle des entit&#233;s nomm&#233;es, nous avons &#233;valu&#233; notre approche
mixte avec une annotation automatique des entit&#233;s. Nous observons une baisse globale des
performances des trois approches et plus particuli&#232;rement du taux de rappel bien que les perfor-
mances restent acceptables (64% de F-mesure pour l&#8217;approche mixte). Ce point est important
car dans une application r&#233;elle d&#8217;extraction d&#8217;&#233;v&#233;nements, les entit&#233;s nomm&#233;es sont toujours
rep&#233;r&#233;es par des outils d&#8217;extraction automatique.
Am&#233;liorations Pour am&#233;liorer la combinaison, nous envisageons de tester plusieurs techniques
d&#8217;hybridation. Tout d&#8217;abord, afin d&#8217;obtenir de meilleurs r&#233;sultats de fa&#231;on plus globale (c&#8217;est-&#224;-dire
maximiser la F-mesure), nous exp&#233;rimenterons l&#8217;ajout d&#8217;un syst&#232;me d&#8217;estimation de confiance
au sein de nos extracteurs. Cela peut &#234;tre r&#233;alis&#233; par diff&#233;rents moyens : (1) faire &#233;valuer &#224; la
main par un expert linguiste chaque r&#232;gle/motif composant les deux approches pr&#233;c&#233;dentes
et reporter cette confiance sur les &#233;v&#233;nements/relations extraits ; (2) estimer la confiance de
chaque r&#232;gle/motif automatiquement en r&#233;alisant une &#233;valuation pr&#233;alable. Une derni&#232;re piste &#224;
explorer est l&#8217;apport des approches statistiques : nous souhaitons apprendre automatiquement
un mod&#232;le de performances qui permettrait une s&#233;lection contextuelle d&#8217;approche en sugg&#233;rant,
lors du traitement d&#8217;un corpus, la meilleure approche &#224; utiliser.
</p>
<p>6 Conclusion et perspectives
</p>
<p>Dans cet article nous avons propos&#233; une &#233;tude comparative de deux approches et de leur
combinaison pour l&#8217;extraction automatique d&#8217;&#233;v&#233;nements. Nos r&#233;sultats montrent que la m&#233;thode
</p>
<p>429</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>mixte am&#233;liore significativement la qualit&#233; des &#233;v&#233;nements extraits. Malgr&#233; une combinaison
plut&#244;t simple, ces r&#233;sultats sont encourageants et nous invitent &#224; explorer de nouveaux modes
d&#8217;hybridation afin de tirer le meilleur parti des deux premi&#232;res approches (am&#233;liorer le taux de
rappel sans perdre trop en pr&#233;cision).
</p>
<p>R&#233;f&#233;rences
</p>
<p>AGRAWAL, R., IMIELIN&#769;SKI, T. et SWAMI, A. (1993). Mining association rules between sets of items
in large databases. SIGMOD &#8217;93, New York. ACM.
</p>
<p>AHN, D. (2006). The stages of event extraction. ARTE &#8217;06, pages 1&#8211;8, Stroudsburg, USA. ACL.
</p>
<p>AONE, C. et RAMOS-SANTACRUZ, M. (2000). Rees : A large-scale relation and event extraction
system. In ANLP, pages 76&#8211;83.
</p>
<p>B&#201;CHET, N., CELLIER, P., CHARNOIS, T. et CR&#201;MILLEUX, B. (2012). Discovering linguistic patterns
using sequence mining. In CICLing (1), pages 154&#8211;165.
</p>
<p>CAPET, P., DELAVALLADE, T., G&#201;N&#201;REUX, M., POIBEAU, T., S&#193;NDOR, &#193;. et VOYATZI, S. (2011). Un
syst&#232;me de d&#233;tection de crise bas&#233; sur l&#8217;extraction automatique d&#8217;&#233;v&#233;nements. In et P. HOOGSTOEL,
M. C., &#233;diteur : S&#233;mantique et multimodalit&#233; en analyse de l&#8217;information, pages 293&#8211;313. Lavoisier.
</p>
<p>CELLIER, P. et CHARNOIS, T. (2010). Fouille de donn&#233;es s&#233;quentielle d&#8217;itemsets pour l&#8217;apprentissage
de patrons linguistiques. In TALN (short paper).
</p>
<p>DAVIDSON, D. (2001). Essays on Actions and Events. Oxford University Press.
</p>
<p>DONG, G. et PEI, J. (2007). Sequence Data Mining. Advances in Database Systems. Kluwer.
</p>
<p>FERR&#201;, S. (2009). Camelis : a logical information system to organize and browse a collection of
documents. In Int. J. General Systems, volume 38.
</p>
<p>GRISHMAN, R., HUTTUNEN, S. et YANGARBER, R. (2002). Information extraction for enhanced
access to disease outbreak reports. Journal of Biomedical Informatics, 35(4):236&#8211;246.
</p>
<p>KRIEG-PLANQUE, A. (2009). A propos des noms propres d&#8217;&#233;v&#233;nement, volume 11, pages 77&#8211;90. Les
carnets du Cediscor.
</p>
<p>NADEAU, D. et SEKINE, S. (2007). A survey of named entity recognition and classification.
Linguisticae Investigationes, 30(1):3&#8211;26. Publisher : John Benjamins Publishing Company.
</p>
<p>POIBEAU, T. (2003). Extraction automatique d&#8217;information : Du texte brut au web s&#233;mantique.
Lavoisier.
</p>
<p>SAVAL, A., BOUZID, M. et BRUNESSAUX, S. (2009). A semantic extension for event modelisation.
21st IEEE International Conference on Tools with Artificial Intelligence (ICTAI 2009).
</p>
<p>SERRANO, L., BOUZID, M., CHARNOIS, T. et GRILHERES, B. (2012). Vers un syst&#232;me de capitalisation
des connaissances : extraction d&#8217;&#233;v&#233;nements par combinaison de plusieurs approches. In
SOS-DLWD&#8217;2012 at EGC&#8217;2012.
</p>
<p>SERRANO, L., GRILHERES, B., BOUZID, M. et CHARNOIS, T. (2011). Extraction de connaissances
pour le renseignement en sources ouvertes. In SOS&#8217;2011 at EGC&#8217;2011.
</p>
<p>VAN DE VELDE, D. (2006). Grammaire des &#233;v&#233;nements. Presses Universitaires du Septentrion.
</p>
<p>XU, F., USZKOREIT, H. et LI, H. (2006). Automatic event and relation detection with seeds of
varying complexity. In AAAI Workshop Event Extraction and Synthesis, Boston.
</p>
<p>430</p>

</div></div>
</body></html>