<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;tude comparative entre trois approches de r&#233;sum&#233; automatique de documents arabes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 225&#8211;238,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p> 
</p>
<p>&#201;tude comparative entre trois approches de r&#233;sum&#233; 
automatique de documents arabes 
</p>
<p>Iskandar Keskes1,2  Mohamed Mahdi Boudabous1  Mohamed H&#233;di Maaloul1,3       
Lamia Hadrich Belguith1 
</p>
<p>(1) ANLP Research Group, Laboratoire MIRACL, Route de Tunis Km 10, BP 242, Sfax, Tunisie 
 (2) Laboratoire IRIT, 118 Route de Narbonne, F-31062 Toulouse Cedex 9, France 
(3) Laboratoire LPL, 5 avenue Pasteur, BP 80975, 13604 Aix-en-Provence, France 
</p>
<p>Keskes@irit.fr, mehdiboudabous@gmail.com  
mohamed.maaloul@lpl-aix.fr, l.belguith@fsegs.rnu.tn 
</p>
<p>R&#201;SUME____________________________________________________________________________________________________ 
</p>
<p>Dans cet article, nous proposons une &#233;tude comparative entre trois approches pour le 
r&#233;sum&#233; automatique de documents arabes. Ainsi, nous avons propos&#233; trois m&#233;thodes 
pour l&#8217;extraction des phrases les plus repr&#233;sentatives d'un document. La premi&#232;re 
m&#233;thode se base sur une approche symbolique, la deuxi&#232;me repose sur une approche 
num&#233;rique et la troisi&#232;me se base sur une approche hybride. Ces m&#233;thodes sont 
impl&#233;ment&#233;es respectivement par le syst&#232;me ARSTResume, le syst&#232;me R.I.A et le syst&#232;me 
HybridResume. Nous pr&#233;sentons, par la suite, les r&#233;sultats obtenus par les trois syst&#232;mes 
et nous proc&#233;dons &#224; une &#233;tude comparative entre les r&#233;sultats obtenus afin de souligner 
les avantages et les limites de chaque m&#233;thode. Les r&#233;sultats de l&#8217;&#233;valuation ont montr&#233; 
que l&#8216;approche num&#233;rique est plus performante que l&#8217;approche symbolique au niveau des 
textes longs. Mais, l&#8217;int&#233;gration de ces deux approches en une approche hybride aboutit 
aux r&#233;sultats les plus performants dans notre corpus de textes. 
</p>
<p>ABSTRACT________________________________________________________________________________________________ 
</p>
<p>Comparative study of three approaches to automatic summarization of Arabic documents 
</p>
<p>In this paper, we propose a comparative study between three approaches for automatic 
summarization of Arabic documents. Thus, we proposed three methods for extracting 
most representative sentences of a document. The first method is based on a symbolic 
approach, the second is relied on a numerical approach and the third is based on a 
hybrid approach. These methods are implemented respectively by the ARSTResume, 
R.I.A and HybridResume systems. Then, we present the results obtained by the three 
systems and we conduct a comparative study between the obtained results in order to 
highlight the advantages and limitations of each method. The evaluation results showed 
that the numerical approach has better performances than the symbolic approach. But, 
combining into a hybrid approach achieved the best results for our text corpus.  
</p>
<p>MOTS-CLES : R&#233;sum&#233; automatique, approche symbolique, approche num&#233;rique, approche 
hybride, document arabe. 
</p>
<p>KEYWORDS: Automatic summarization, symbolic approach, numerical approach, hybrid 
approach, Arabic document. 
</p>
<p>225</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>1 Introduction 
</p>
<p>Le Traitement Automatique du Langage Naturel (TALN) nous montre que les approches 
peuvent &#234;tre converg&#233;es pour r&#233;soudre le m&#234;me probl&#232;me. Chaque approche a ses 
propres avantages et inconv&#233;nients qui peuvent &#234;tre identifi&#233;s par une &#233;tude 
comparative. 
</p>
<p>Le pr&#233;sent travail pr&#233;sente une &#233;tude comparative entre diff&#233;rentes approches de TALN, 
dans le cadre du r&#233;sum&#233; automatique de textes.  
</p>
<p>Ce domaine aide &#224; contribuer &#224; une meilleure compr&#233;hension de la fa&#231;on dont les gens 
produisent et comprennent la langue, car il peut r&#233;soudre les besoins croissants 
d'information de synth&#232;se dans notre soci&#233;t&#233;. 
</p>
<p>La t&#226;che de r&#233;sum&#233; semble &#234;tre intrins&#232;quement interpr&#233;t&#233;e dans le sens o&#249; diff&#233;rentes 
personnes produisent g&#233;n&#233;ralement des r&#233;sum&#233;s tr&#232;s diff&#233;rents pour un texte donn&#233;. 
Ainsi, la qualit&#233; des r&#233;sum&#233;s peut &#234;tre jug&#233;e tr&#232;s diff&#233;remment (Iria et al., 2007). 
</p>
<p>En mati&#232;re de r&#233;sum&#233; automatique, on peut distinguer trois principales approches &#224; 
savoir, l&#8217;approche par compr&#233;hension appel&#233;e l&#8217;approche symbolique, l&#8217;approche par 
extraction appel&#233;e l&#8217;approche num&#233;rique et l&#8217;approche qui combine les deux approches 
pr&#233;c&#233;dentes appel&#233;e l&#8217;approche hybride. L&#8217;approche symbolique exploite un savoir 
purement linguistique, et plus pr&#233;cis&#233;ment s&#233;mantique pour extraire les phrases 
pertinentes d&#8217;un document (Azmi et Al-Thanyyan, 2012). Plusieurs th&#233;ories entrent dans 
le cadre de cette approche &#224; savoir : la Th&#233;orie de la Structure Rh&#233;torique (RST) (Mann 
et Thompson, 1988), la Th&#233;orie de la Repr&#233;sentation Discursive (DRT) (Kamp, 1981 ; 
Kamp et Reyle, 1993), la Th&#233;orie de la Repr&#233;sentation Discursive Segment&#233;e (SDRT) 
(Asher, 1993 ; Lascarides et Asher, 1993)&#8230; tandis que l&#8217;approche num&#233;rique repose sur 
un calcul de poids ou de scores associ&#233;s &#224; chaque phrase afin d&#8217;estimer son degr&#233; 
d&#8217;importance dans le texte. On distingue deux grandes techniques &#224; savoir : la technique 
statistique (mots des titres, position des phrases,&#8230;) et la technique d&#8217;apprentissage 
(apprentissage supervis&#233;, apprentissage semi-supervis&#233; et apprentissage non supervis&#233;) 
(Amini, 2001). L&#8217;extrait final contient les unit&#233;s textuelles qui ont les scores les plus 
&#233;lev&#233;s. Concernant l&#8217;approche hybride, elle utilise des m&#233;thodes linguistiques et 
num&#233;riques pour extraire les phrases du r&#233;sum&#233;. 
</p>
<p>Nous proposons dans cet article une &#233;tude comparative entre les trois approches 
(symbolique, num&#233;rique et hybride). Cette &#233;tude a pour objectif d&#8217;&#233;valuer la robustesse 
de chacune de ces approches ainsi que la mise en relief de leurs avantages et de leurs 
inconv&#233;nients pour le r&#233;sum&#233; automatique. 
</p>
<p>La suite de cet article se structure autour de cinq piliers. Le premier pilier pr&#233;sente la 
m&#233;thode symbolique pour le r&#233;sum&#233; automatique de documents arabes impl&#233;ment&#233;e 
dans le syst&#232;me ARSTResume. Le deuxi&#232;me pilier pr&#233;sente la m&#233;thode num&#233;rique pour le 
r&#233;sum&#233; automatique de documents arabes impl&#233;ment&#233;e dans le syst&#232;me R.I.A. Le 
troisi&#232;me pilier pr&#233;sente la m&#233;thode hybride pour le r&#233;sum&#233; automatique de documents 
arabes impl&#233;ment&#233;e dans le syst&#232;me HybridResume. Le quatri&#232;me pilier expose le corpus 
</p>
<p>226</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>d&#8217;&#233;valuation, l&#8217;&#233;valuation de ces trois syst&#232;mes et les r&#233;sultats obtenus. Enfin, le 
cinqui&#232;me, montre une &#233;tude comparative entre les trois approches. 
</p>
<p>2 M&#233;thode symbolique propos&#233;e 
</p>
<p>Dans cette section, nous pr&#233;sentons la m&#233;thode symbolique que nous proposons pour le 
r&#233;sum&#233; automatique de documents arabes, ainsi qu&#8217;une description d&#233;taill&#233;e des 
diff&#233;rentes &#233;tapes de cette m&#233;thode (Keskes, 2011). 
</p>
<p>2.1 Pr&#233;sentation 
</p>
<p>La m&#233;thode symbolique propos&#233;e pour le r&#233;sum&#233; automatique des documents arabes se 
base principalement sur des techniques d&#8217;extraction moyennant des crit&#232;res 
linguistiques. Elle repose sur la th&#233;orie de la structure rh&#233;torique (RST) (Mann et 
Thompson, 1988). Il s&#8217;agit de d&#233;tecter les relations s&#233;mantiques et les relations 
intentionnelles qui existent entre les segments d&#8217;un document. En effet, l&#8217;analyse 
rh&#233;torique a pour but d&#8217;&#233;tablir les relations et les d&#233;pendances ainsi que l&#8217;importance 
relative &#224; des phrases ou propositions les unes par rapport aux autres (Keskes et Ma&#226;loul, 
2010). Notre m&#233;thode se d&#233;roule en trois temps. D'abord, le rep&#233;rage des relations 
rh&#233;toriques entre les diff&#233;rentes unit&#233;s minimales du texte dont l&#8217;une poss&#232;de le statut de 
noyau &#8211; qui est le segment de texte primordial pour la coh&#233;rence &#8211; les autres ayant un 
statut de noyau ou de satellite, sont des segments optionnels. Ensuite, le dressage et la 
simplification de l&#8217;arbre RST. Enfin, la s&#233;lection des phrases noyaux formant le r&#233;sum&#233; 
final, selon type de relation rh&#233;torique choisi pour l&#8217;extrait. 
</p>
<p>&#192; l&#8217;issue de notre &#233;tude du corpus, form&#233; de cent textes en langue arabe annot&#233;s par trois 
linguistes (ces derniers ont s&#233;lectionn&#233; les phrases pertinentes), nous avons pu rep&#233;rer 
des frames de relations rh&#233;toriques. Ces frames sont des r&#232;gles rh&#233;toriques form&#233;es par 
des signaux linguistiques. Ces signaux sont principalement des marqueurs linguistiques 
ind&#233;pendants d&#8217;un domaine particulier pour le rep&#233;rage des relations rh&#233;toriques (Minel, 
2002). Toutefois, ces marqueurs peuvent &#234;tre r&#233;pertori&#233;s en deux types : indicateurs 
d&#233;clencheurs et indices compl&#233;mentaires. Les indicateurs d&#233;clencheurs &#233;noncent la 
pr&#233;sence d&#8217;une relation rh&#233;torique. Les indices compl&#233;mentaires sont recherch&#233;s dans un 
espace d&#233;fini &#224; partir de l&#8217;indicateur (dans le voisinage de l&#8217;indicateur). Ils peuvent ainsi 
agir, dans le contexte, afin de confirmer ou d'infirmer la relation rh&#233;torique &#233;nonc&#233;e par 
l&#8217;indicateur d&#233;clencheur. Ces r&#232;gles rh&#233;toriques sont appliqu&#233;es pour construire par la 
suite l&#8217;arbre rh&#233;torique. &#192; partir de notre corpus d&#8217;&#233;tude, nous avons &#233;num&#233;r&#233; vingt 
relations rh&#233;toriques. La table 1 pr&#233;sente quelques relations : 
</p>
<p>Liste des 
</p>
<p>relations 
</p>
<p>rh&#233;toriques 
</p>
<p>Condition /  &#1591;&#3;&#4;  
Concession /  &#1603;&#1575;&#1585;&#8;&#9;&#10;&#1575;  
Enum&#233;ration /  &#11;&#12;&#13;&#14;&#15;   
Restriction /  &#1569;&#17;&#18;&#19;&#9;&#10;&#1575;  
</p>
<p> Confirmation /  &#8;&#12;&#1570;&#21;&#15;  
R&#233;duction / &#11;&#12;&#22;&#23;&#15; 
</p>
<p>Joint /  &#24;&#25;&#1585;   
</p>
<p>227</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Evidence /  &#1577;&#8;&#27;&#17;&#28;  
N&#233;gation /  &#29;&#14;&#30;  
</p>
<p>TABLE1 -Exemples de relations rh&#233;toriques 
</p>
<p>Le frame suivant est utilis&#233; pour d&#233;tecter la relation rh&#233;torique n&#233;gation: 
</p>
<p>TABLE 2 -Frame de la relation rh&#233;torique n&#233;gation 
</p>
<p>2.2. Description d&#233;taill&#233;e de la m&#233;thode 
</p>
<p>La mise en &#339;uvre fonctionnelle de notre m&#233;thode est repr&#233;sent&#233;e par la figure 1. Elle 
repose sur une segmentation &#224; diff&#233;rents niveaux (titres, sections, paragraphes, phrases) 
ainsi que sur une recherche bas&#233;e sur les r&#232;gles rh&#233;toriques afin de d&#233;tecter les relations 
rh&#233;toriques. Ces r&#232;gles rh&#233;toriques sont utiles pour la construction de l&#8217;arbre rh&#233;torique. 
Enfin, &#224; travers le choix du type de r&#233;sum&#233; (i.e. r&#233;sum&#233; indicatif, r&#233;sum&#233; informatif, &#8230;), 
on pr&#233;c&#232;de &#224; la simplification de l&#8217;arbre et &#224; la s&#233;lection des phrases du r&#233;sum&#233;. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>FIGURE1-Principales &#233;tapes de la m&#233;thode symbolique 
</p>
<p>Nom de relation : {n&#233;gation /  &#29;&#14;&#30; } 
</p>
<p>Contrainte sur (1) : Contient un/des indice(s) compl&#233;mentaire(s){&#31;&#18; !, &quot;#&#18; !,  &#29;&#18;&#18; ! ,  $ ! } 
</p>
<p>Contrainte sur (2) : Contient l&#8217;indice d&#233;clencheur {&quot;!, &quot;!&#1608;  ,  $! ,  &amp;&#12;! ,  &#1575;&#21;'&#12;! ,  ('&#12;! } 
</p>
<p>Position de l&#8217;indice 
d&#233;clencheur  
</p>
<p>Milieu 
</p>
<p>Unit&#233; retenue  (1) 
</p>
<p> 
</p>
<p>Sch&#233;mas 
rh&#233;toriques 
</p>
<p>Segmentation du texte 
</p>
<p> 
</p>
<p>Construction de l&#8217;arbre RST 
</p>
<p>D&#233;termination des segments et leurs 
natures 
</p>
<p> 
</p>
<p>D&#233;tection des relations rh&#233;toriques 
</p>
<p>S&#233;lection des phrases du r&#233;sum&#233; 
</p>
<p>Extrait  
</p>
<p>Frames /r&#232;gles 
rh&#233;toriques 
</p>
<p>228</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>2.1.1 Segmentation du document source 
</p>
<p>La segmentation du document est une &#233;tape n&#233;cessaire pour la t&#226;che du r&#233;sum&#233; 
automatique. Cette &#233;tape consiste &#224; hi&#233;rarchiser et &#224; structurer le texte source en 
diff&#233;rentes unit&#233;s (titres, sections, paragraphes et phrases). 
</p>
<p>Signalons, &#224; ce niveau de traitement, une grande difficult&#233;. En effet, La segmentation des 
textes en langue arabe ne peut pas se reposer uniquement sur la ponctuation puisqu&#8217;elle 
utilise certaines particules telles que &quot; &#1608; &quot;  (waw) et &quot;&#1601;&quot; (f&#257;) et certains mots connecteurs 
pour s&#233;parer entre les phrases (Belguith et al., 2005). 
</p>
<p>Pour notre corpus constitu&#233; de textes en format HTML, nous utilisons une segmentation 
bas&#233;e sur les signes de ponctuation et sur un ensemble de balises HTML. Cette &#233;tape de 
segmentation fournit en sortie un texte en format XML enrichi avec des balises encadrant 
les titres : &lt;&#1606;&#1575;&#21;&#18;&#27;&gt;&#8230;&lt;/&#1606;&#1575;&#21;&#18;&#27;&gt;, les sections : &lt;&#1569;+,&gt;&#8230;&lt;/&#1569;+,&gt;, les paragraphes : &lt; 
&#1577;&#3;&#23;-&gt;&#8230;&lt;/  &#1577;&#3;&#23;- &gt; et les phrases : &lt;.&#22;/,&gt;&#8230;&lt;/.&#22;/,&gt;. 
</p>
<p>La deuxi&#232;me &#233;tape de la segmentation est la segmentation des phrases en unit&#233;s 
minimales, en utilisant les indicateurs principaux des r&#232;gles rh&#233;toriques, afin de 
descendre &#224; un niveau plus bas dans l'analyse et de mieux d&#233;gager les relations. Ces 
derni&#232;res sont encadr&#233;es par les balises &lt;&#1593;&#17;1&#28;&gt;&#8230;&lt;/&#1593;&#17;1&#28;&gt; (Tofiloski et al., 2009). 
</p>
<p>2.1.2 Application des r&#232;gles rh&#233;toriques 
</p>
<p>L&#8217;application des r&#232;gles rh&#233;toriques &#224; un double but : d&#233;terminer la nature des segments 
(noyau ou satellite) et d&#233;tecter les relations rh&#233;toriques entre ces segments. 
</p>
<p>2.1.2.1 D&#233;termination du segment Noyau et Satellite 
</p>
<p>Cette &#233;tape consiste &#224; rep&#233;rer les indicateurs principaux dans les phrases d&#233;j&#224; 
segment&#233;es et &#224; pr&#233;ciser leurs positions dans l'unit&#233; minimale afin d&#8217;appliquer les r&#232;gles 
rh&#233;toriques, en cherchant les indices compl&#233;mentaires. 
</p>
<p>Dans cette &#233;tape, nous allons donner, pour chaque unit&#233; minimale, un statut qui indique 
l'importance de cette unit&#233; par rapport &#224; la phrase ou pour lui donner plus d&#8217;importance 
par rapport &#224; une autre unit&#233; minimale. Le statut peut &#234;tre un noyau ou un satellite. 
</p>
<p>Le noyau est un segment de texte qui comporte une information tr&#232;s pertinente. C'est un 
&#233;l&#233;ment essentiel pour comprendre l'intention de l'auteur. Lorsqu'on &#233;limine le noyau, 
nous ne pouvons pas comprendre le sens de la phrase. De m&#234;me, un satellite est un 
segment de texte, mais qui comporte une information moins pertinente que le noyau. 
Donc, le noyau est un segment de texte primordial pour la coh&#233;rence et le satellite est un 
segment optionnel. 
</p>
<p>2.1.2.2 D&#233;tection des relations rh&#233;toriques 
</p>
<p>Cette &#233;tape consiste &#224; chercher les indices compl&#233;mentaires de validation au voisinage 
de l'indicateur principal, c'est-&#224;-dire le segment qui contient l'indicateur principal et le 
segment qui le pr&#233;c&#232;de. C'est l'indicateur principal qui signale la relation rh&#233;torique 
</p>
<p>229</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>entre ces deux segments et c'est le r&#244;le des indices compl&#233;mentaires de confirmer ou non 
cette relation et de valider aussi le statut des deux segments. 
</p>
<p>Cette technique nous permet une analyse plus profonde, en tenant compte de la 
sp&#233;cificit&#233; de la langue arabe sachant qu'on a des relations qui peuvent donner des sens 
proches comme les relations &quot;&#3;&#13;2&quot; et &quot;&#1569;&#17;&#18;&#19;&#9;&#10;&#1575;&quot; et aussi &quot;&#3;&#12;'&#14;&#15;&quot; et &quot;&#11;&#12;&#13;&#14;&#15;&quot;. 
</p>
<p>2.1.3 Construction de l&#8217;arbre RST 
</p>
<p>Une fois l&#8217;&#233;tape de d&#233;tection du type des unit&#233;s minimales et des diff&#233;rentes relations 
rh&#233;toriques existantes est achev&#233;e, nous ajoutons &#224; notre technique les sch&#233;mas 
rh&#233;toriques (Mann et Thompson, 1988) afin de sp&#233;cifier la composition structurale du 
texte et construire l'arbre RST. 
</p>
<p>Ces sch&#233;mas rh&#233;toriques d&#233;crivent l&#8217;organisation structurelle d&#8217;un texte, quelque soit le 
niveau hi&#233;rarchique de ce dernier. Ils permettent de lier un noyau et un satellite, deux 
ou plusieurs noyaux entre eux, et un noyau avec plusieurs satellites (Marcu, 1999).  
</p>
<p>Ainsi, les sch&#233;mas rh&#233;toriques se pr&#233;sentent sous la forme de cinq mod&#232;les de sch&#233;mas 
(figure 2) qui peuvent &#234;tre utilis&#233;s r&#233;cursivement pour d&#233;crire des textes de taille 
arbitraire.  
</p>
<p>G&#233;n&#233;ralement, le sch&#233;ma le plus utilis&#233; est celui liant un satellite unique &#224; un noyau 
unique repr&#233;sent&#233; dans la figure 3. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>FIGURE 2 -Sch&#233;ma rh&#233;torique de base de la technique RST (Mann et al., 1988) 
</p>
<p>En plus des sch&#233;mas rh&#233;toriques, nous avons utilis&#233; d'autres r&#232;gles que nous avons 
d&#233;gag&#233;es suite &#224; une &#233;tude empirique. Ces r&#232;gles ont &#233;t&#233; valid&#233;es par des linguistes. Elles 
permettent de traiter aussi les cas o&#249; nous n'avons pas de relations entre les phrases et 
assurent ainsi le maximum de couverture de texte que possible. 
</p>
<p>Afin de d&#233;terminer l'arbre RST le plus appropri&#233; pour le texte, nous avons essay&#233; 
d&#8217;&#233;tudier le texte et la mani&#232;re dont l'auteur l&#8217;a &#233;crit. En effet, les auteurs veulent 
principalement donner un message aux lecteurs. Ce message est mentionn&#233; comme 
plusieurs faits; cependant, l'&#233;tude que nous avons faite sur le corpus prouve que les 
auteurs tendent &#224; mentionner ces faits dans l'ordre, et chaque fait est suivi par des 
rapports qui le soutiennent. &#192; travers cette &#233;tude empirique, nous avons pu d&#233;gager des 
r&#232;gles de construction d&#8217;arbre RST repr&#233;sent&#233;es dans la table 3 : 
</p>
<p> 
</p>
<p>Rel          Rel        Rel    Rel  
</p>
<p>Rel  
N N 
</p>
<p>          Rel  
S N 
</p>
<p> 
</p>
<p>N N 
</p>
<p>S N S N N N 
</p>
<p>230</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Si (Indice principal est au d&#233;but de la phrase) alors  
</p>
<p>la relation d&#233;tect&#233;e relie cette phrase avec la phrase pr&#233;c&#233;dente. 
</p>
<p>R
&#232;g
</p>
<p>le
s 
</p>
<p>Si (Indice principal est &#224; la fin de la phrase) alors  
</p>
<p>le segment qui contient cet indice est le seul qui contribue &#224; la d&#233;finition de 
la relation. 
</p>
<p>Si (on a une ou plusieurs phrases qui n'admettent pas de relation entre elles) 
et (l&#8217;indice principal qui les suit est au d&#233;but de la phrase) alors  
</p>
<p>La relation relie toutes les phrases qui pr&#233;c&#232;dent cet indice avec la phrase o&#249; 
il se trouve. 
</p>
<p>TABLE3 &#8211;Exemple de r&#232;gles de construction d'arbres 
</p>
<p>Prenons par exemple la premi&#232;re r&#232;gle, elle exprime le fait que s&#8217;il existe un marqueur 
principal, qui d&#233;clenche une relation rh&#233;torique, situ&#233; au d&#233;but de la phrase, alors cette 
relation relie entre le segment qui contient le marqueur principal et la phrase qui la 
pr&#233;c&#232;de. Car, s&#233;mantiquement, cette relation doit &#234;tre subordonnante ou coordonnante 
de la relation rh&#233;torique qu&#8217;elle pr&#233;c&#232;de et non pas le segment qu&#8217;il pr&#233;c&#232;de (Keskes et 
al., 2010b). 
</p>
<p>2.1.4  S&#233;lection des phrases du r&#233;sum&#233; 
</p>
<p>Une fois l'arbre g&#233;n&#233;r&#233;, nous allons faire l'&#233;lagage (simplification de l'arbre) selon le type 
de r&#233;sum&#233; indicatif ou selon les relations choisies par l'utilisateur tout en tenant compte 
des segments noyaux. 
</p>
<p>Tous les noyaux ne sont pas d'&#233;gale importance. En effet, l&#8217;&#233;tape de s&#233;lection des unit&#233;s 
minimales importantes (noyaux), profite des relations entre les structures de discours 
pour d&#233;cider du degr&#233; de leur importance. L&#8217;extrait final affiche les unit&#233;s noyaux 
retenues apr&#232;s la simplification de l&#8217;arbre RST. 
</p>
<p>La simplification de l&#8217;arbre, prendra en consid&#233;ration la liste des relations retenues par 
l&#8217;utilisateur. Au cas o&#249; ce dernier ne pr&#233;cise aucun choix, le syst&#232;me d&#233;termine 
automatiquement les relations retenues pour le type de r&#233;sum&#233; indicatif. En effet, la 
r&#233;duction de l&#8217;arbre RST se fait par la suppression de tous les descendants qui viennent 
d&#8217;une relation rh&#233;torique non choisie par l&#8217;utilisateur (Keskes et al., 2010a). 
</p>
<p>Cette m&#233;thode propos&#233;e a &#233;t&#233; impl&#233;ment&#233;e dans le syst&#232;me ARSTResume. 
</p>
<p>231</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>3 M&#233;thode num&#233;rique propos&#233;e 
</p>
<p>Dans cette section nous pr&#233;sentons la m&#233;thode num&#233;rique propos&#233;e pour le r&#233;sum&#233; 
automatique de documents arabes, ainsi qu&#8217;une description d&#233;taill&#233;e des diff&#233;rentes 
&#233;tapes de cette m&#233;thode. 
</p>
<p>3.1 Pr&#233;sentation 
</p>
<p>La m&#233;thode num&#233;rique pour le r&#233;sum&#233; automatique, d&#8217;articles de journaux en langue 
arabe, se base sur une technique d'apprentissage. Plus pr&#233;cis&#233;ment, elle est bas&#233;e sur la 
technique d&#8217;apprentissage semi-supervis&#233;, qui se compose de deux phases &#224; savoir : 
</p>
<p>La phase d'apprentissage qui permet au syst&#232;me d'apprendre &#224; extraire les phrases du 
r&#233;sum&#233;. Cette phase se compose de deux &#233;tapes, une &#233;tape de segmentation et 
d&#8217;annotation, et une &#233;tape d&#8217;apprentissage. 
</p>
<p>La deuxi&#232;me phase est la phase d'utilisation qui permet aux utilisateurs de r&#233;sumer un 
nouveau document. Cette phase est compos&#233;e de deux &#233;tapes, une &#233;tape de segmentation 
et d&#8217;annotation et une &#233;tape de classification (Boudabous et al., 2010). 
</p>
<p>Les diff&#233;rentes phases de notre m&#233;thode sont illustr&#233;es dans la figure 3. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>FIGURE 3 -Principales &#233;tapes de la m&#233;thode num&#233;rique 
</p>
<p>3.2 Description d&#233;taill&#233;e de la m&#233;thode 
</p>
<p>3.2.1 Phase d&#8217;apprentissage 
</p>
<p>La phase d&#8217;apprentissage n&#233;cessite l&#8217;utilisation d&#8217;un corpus d&#8217;entra&#238;nement ainsi qu&#8217;une 
base de crit&#232;res d&#8217;extraction. 
</p>
<p>Le corpus d&#8217;entra&#238;nement est constitu&#233; de cent documents &#233;tiquet&#233;s (textes sources et 
leurs r&#233;sum&#233;s) en format HTML (au moyen de trois pages par document). Les r&#233;sum&#233;s de 
r&#233;f&#233;rence sont faits par trois experts humains afin d&#8217;apprendre au syst&#232;me comment 
produire des r&#233;sum&#233;s similaires &#224; ceux des experts humains de mani&#232;re automatique. 
</p>
<p>Les crit&#232;res d&#8217;extraction sont utilis&#233;s pour annoter les phrases des documents constituant 
notre corpus d&#8217;entra&#238;nement.  
</p>
<p> 
</p>
<p>232</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Nous avons class&#233; les crit&#232;res dans deux classes : les crit&#232;res positionnels et les crit&#232;res 
lexicaux. Ces derniers associent un score normalis&#233; &#224; chaque phrase, par contre les 
crit&#232;res positionnels classent les phrases selon leurs postions dans le texte, pr&#233;sent&#233;s dans 
la table 4. 
</p>
<p>C
ri
</p>
<p>t&#232;
re
</p>
<p>s 
po
</p>
<p>si
ti
</p>
<p>on
ne
</p>
<p>ls
 
</p>
<p>Position_ ph_texte Classe la phrase selon sa position dans le texte : 1 si la phrase est dans le 
</p>
<p>premier tiers du texte, 2 si elle est dans le deuxi&#232;me tiers et 3 autrement. 
</p>
<p>Position_ ph_sec Classe la phrase selon sa position dans la section : 1 si la phrase est dans le 
</p>
<p>premier tiers du texte, 2 si elle est dans le deuxi&#232;me tiers et 3 autrement. 
</p>
<p>C
ri
</p>
<p>t&#232;
re
</p>
<p>s 
le
</p>
<p>xi
ca
</p>
<p>ux
 Nb_mot_titre Calcule le nombre d&#8217;apparition des mots du titre dans la phrase. 
</p>
<p>Nb_exp_bonus Calcule le nombre d&#8217;expressions bonus dans la phrase. 
</p>
<p>Tf*Idf Calcule le score tf*idf de la phrase. 
</p>
<p>TABLE 4 -Crit&#232;res d&#8217;extraction 
</p>
<p>- Segmentation et annotation du corpus 
</p>
<p>Cette &#233;tape aboutit &#224; la construction d&#8217;un vecteur d&#8217;extraction pour chaque unit&#233; du 
texte. L&#8217;ensemble des vecteurs d&#8217;extraction forme un fichier d&#8217;entr&#233;e pour l&#8217;&#233;tape 
d&#8217;apprentissage. La sous &#233;tape segmentation a pour but de d&#233;couper le texte en unit&#233;s 
minimales. Nous avons adopt&#233; la m&#234;me segmentation utilis&#233;e dans la m&#233;thode 
symbolique. Concernant la sous &#233;tape d&#8217;annotation, l&#8217;acte annotatif consiste &#224; donner 
une valeur ou un jugement &#224; un segment du texte en se r&#233;f&#233;rant aux crit&#232;res d&#8217;extraction. 
Cette &#233;tape a pour but d&#8217;annoter chaque segment du texte selon les diff&#233;rents crit&#232;res 
d&#8217;extraction pr&#233;sent&#233;s pr&#233;c&#233;demment. Chaque phrase de la collection est d&#233;crite par 
vecteur d&#8217;extraction, o&#249; la valeur donn&#233;e d&#8217;un crit&#232;re correspond &#224; la valeur d&#8217;analyse de 
la phrase selon ce crit&#232;re. 
</p>
<p>- &#201;tape d&#8217;apprentissage 
</p>
<p>L&#8217;algorithme d&#8217;apprentissage utilis&#233; est l&#8217;algorithme SVM (Machines &#224; Vecteurs de 
Support). Le choix de cet algorithme se justifie par sa robustesse de classification binaire, 
sa vitesse d&#8217;ex&#233;cution et son adaptation aux probl&#232;mes non lin&#233;airement s&#233;parables. Cet 
algorithme g&#233;n&#232;re une seule r&#232;gle d&#8217;extraction appel&#233;e &#233;quation de l&#8217;hyperplan qui 
s&#233;pare les phrases pertinentes des phrases non pertinentes. Ainsi, l&#8217;algorithme 
d&#8217;apprentissage &#233;limine les crit&#232;res qui sont inutiles pour la phase d&#8217;apprentissage.  
</p>
<p>3.2.2 Phase d&#8217;utilisation 
</p>
<p>Cette phase permet &#224; l&#8217;utilisateur du syst&#232;me de b&#233;n&#233;ficier des r&#233;sultats de la phase 
d&#8217;apprentissage pour r&#233;sumer un nouveau document. Les &#233;tapes par lesquelles passe le 
</p>
<p>233</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>texte &#224; r&#233;sumer sont : l&#8217;&#233;tape de segmentation et d&#8217;annotation, et l&#8217;&#233;tape de classement. 
L&#8217;&#233;tape de classification prend comme entr&#233;es les vecteurs d&#8217;extraction g&#233;n&#233;r&#233;s par 
l&#8217;&#233;tape de segmentation et d&#8217;annotation et l&#8217;&#233;quation de l&#8217;hyperplan g&#233;n&#233;r&#233;e par la phase 
d&#8217;apprentissage. L&#8217;&#233;quation de l&#8217;hyperplan est utilis&#233;e pour calculer le score de chaque 
phrase en se basant sur les vecteurs d&#8217;extraction. Cette m&#233;thode a &#233;t&#233; impl&#233;ment&#233;e dans 
le syst&#232;me R&#233;sumeur Intelligent Arabe (R.I.A) (Boudabous et al., 2010). 
</p>
<p>4 M&#233;thode hybride propos&#233;e 
</p>
<p>Dans cette section, nous proposons une  m&#233;thode hybride pour le r&#233;sum&#233; automatique. 
Elle consiste &#224; coupler la m&#233;thode linguistique et la m&#233;thode num&#233;rique.  
</p>
<p>4.1 Pr&#233;sentation 
</p>
<p>La m&#233;thode hybride, pour le r&#233;sum&#233; automatique des documents arabes, consiste &#224; 
combiner la m&#233;thode symbolique bas&#233;e sur la RST et la m&#233;thode num&#233;rique &#224; base 
d&#8217;apprentissage. La figure 4 illustre le principe de cette m&#233;thode. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>FIGURE 4 -Principales phases de la m&#233;thode hybride 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Segmentation 
</p>
<p>Vecteurs 
d&#8217;extraction 
</p>
<p>Classement 
</p>
<p>Extrait 
XML 
</p>
<p>Classification 
</p>
<p>Construction de l&#8217;arbre RST 
</p>
<p>S&#233;lection 
des phrases 
du r&#233;sum&#233; 
</p>
<p>Extrait 
XML 
</p>
<p>Frames /r&#232;gles 
rh&#233;toriques 
</p>
<p>Sch&#233;mas 
rh&#233;torique
</p>
<p>R&#232;gles 
d&#8217;apprentissage 
</p>
<p>D&#233;termination des phrases communes 
</p>
<p>Extrait XML 
</p>
<p>G&#233;n&#233;ration 
du r&#233;sum&#233; 
</p>
<p>HTML/XML 
</p>
<p>D&#233;termination des 
segments et leurs natures 
</p>
<p>D&#233;tection des relations 
rh&#233;toriques 
</p>
<p>234</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>4.2 Description d&#233;taill&#233;e de la m&#233;thode hybride 
</p>
<p>La m&#233;thode hybride que nous proposons se base sur la m&#233;thode symbolique et la 
m&#233;thode num&#233;rique, qui ont en commun le corpus d&#8217;&#233;tude et l&#8217;&#233;tape de segmentation 
des textes. Ces deux m&#233;thodes sont ex&#233;cut&#233;es simultan&#233;ment (en parall&#232;le) comme nous 
l&#8217;avons d&#233;crit ci-dessus (section 2.2 et 3.2), puis, nous avons ajout&#233; une &#233;tape de 
combinaison des r&#233;sultats des deux m&#233;thodes. 
</p>
<p>L&#8217;&#233;tape de combinaison consiste &#224; s&#233;lectionner les phrases communes des deux r&#233;sum&#233;s 
g&#233;n&#233;r&#233;s par la m&#233;thode symbolique et la m&#233;thode num&#233;rique. Cette combinaison permet 
d&#8217;avoir un seul r&#233;sum&#233; pour chaque texte qui contient les phrases s&#233;lectionn&#233;es &#224; la fois 
par la m&#233;thode symbolique et par la m&#233;thode num&#233;rique. 
</p>
<p>L&#8217;impl&#233;mentation de cette m&#233;thode est bas&#233;e sur l&#8217;int&#233;gration des deux syst&#232;mes 
ARSTR&#233;sume et R.I.A., &#224; laquelle nous avons ajout&#233; l&#8217;&#233;tape de combinaison. Le syst&#232;me 
d&#233;velopp&#233; s&#8217;appelle HybridResume. 
</p>
<p>5 &#201;valuation 
</p>
<p>Le corpus d&#8217;&#233;valuation est form&#233; de cent articles de presse, en langue arabe, rapatri&#233;s du 
journal Dar El Hayet1 sans restriction quant a leurs contenu, taille, domaine et auteur. 
Ainsi, nous avons proc&#233;d&#233; &#224; l&#8217;&#233;valuation de la performance et de la pertinence des 
r&#233;sum&#233;s g&#233;n&#233;r&#233;s par les trois syst&#232;mes, &#224; l&#8217;aide d&#8217;une &#233;tude comparative qui mettra en 
jeu les r&#233;sultats g&#233;n&#233;r&#233;s par les syst&#232;mes avec ceux r&#233;alis&#233;s par trois experts humain. 
</p>
<p>Nous avons utilis&#233; le m&#234;me corpus d&#8217;&#233;valuation pour &#233;valuer les trois syst&#232;mes 
(ARSTResume, R.I.A et HybridResume). Notons que ces trois syst&#232;mes ont utilis&#233; le 
m&#234;me module de segmentation pour avoir le m&#234;me ensemble de phrases &#224; traiter. 
</p>
<p>Nous avons proc&#233;d&#233; &#224; trois exp&#233;rimentations pour &#233;valuer les trois syst&#232;mes. Chaque 
exp&#233;rimentation compare les r&#233;sum&#233;s de nos syst&#232;mes avec un r&#233;sum&#233; de l&#8217;expert. Le 
tableau suivant pr&#233;sente la moyenne de rappel, de pr&#233;cision et de f-mesure pour chacun 
des trois syst&#232;mes par rapport aux trois experts. 
</p>
<p> ARSTResume R.I.A. HybridResume 
</p>
<p>Rappel Pr&#233;cision F-mesure Rappel Pr&#233;cision F-mesure Rappel Pr&#233;cision F-mesure 
</p>
<p>Expert 1 0.52 0.58 0.52 0.59 0.62 0.6 0.52 0.66 0.63 
</p>
<p>Expert 2 0.39 0.62 0.46 0.53 0.7 0.6 0.58 0.74 0.7 
</p>
<p>Expert 3 0.5 0.59 0.51 0.63 0.7 0.66 0.6 0.79 0.71 
</p>
<p>Moyenne 0.47 0.6 0.5 0.58 0.67 0.62 0.57 0.73 0.68 
</p>
<p>TABLE 5 &#8211;R&#233;sultats d&#8217;&#233;valuation des trois syst&#232;mes 
</p>
<p>                                                    
</p>
<p>1 Source : http://www.daralhayat.com 
</p>
<p>235</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Nous remarquons que l'approche num&#233;rique est plus performante que l'approche 
symbolique et qu'HybridResume surclasse l'approche num&#233;rique sur ce corpus, et ce pour 
les 3 types de mesures effectu&#233;es. 
</p>
<p>6 Discussion des r&#233;sultats obtenus 
</p>
<p>Suite &#224; l&#8217;&#233;valuation des trois syst&#232;mes, nous avons obtenu comme valeurs moyennes de 
rappel, de pr&#233;cision et de F-Mesure respectivement : 47%, 60% et 50% pour le syst&#232;me 
ARSTR&#233;sume, 58%, 67% et 62% pour le syst&#232;me R.I.A et 57%, 73% et 68% pour le 
syst&#232;me HybridResume. Nous remarquons, que ces mesures diff&#233;rentes d&#8217;un syst&#232;me &#224; un 
autre et d&#8217;un expert &#224; l&#8217;autre. Cela se justifie par le fait que chaque syst&#232;me &#224; sa propre 
m&#233;thode, et que le r&#233;sum&#233; avec lequel nous faisons la comparaison d&#233;pend du jugement 
vis-&#224;-vis du domaine d&#8217;int&#233;r&#234;t de l&#8217;expert. 
</p>
<p>En comparant les mesures des trois syst&#232;mes simultan&#233;ment, nous avons remarqu&#233; que le 
syst&#232;me HybridResume pr&#233;sente toujours les mesures les plus &#233;lev&#233;es. Voyons d'o&#249; cela 
provient en comparant les deux syst&#232;mes ARSTR&#233;sume et R.I.A. 
</p>
<p>En examinant ses mesures calcul&#233;es sur le corpus d&#8217;&#233;valuation pour chacun des deux 
syst&#232;mes, ARSTR&#233;sueme et R.I.A, nous avons remarqu&#233; que plus le texte est long, plus le 
syst&#232;me ARSTR&#233;sume pr&#233;sente les mesures de rappel et de pr&#233;cision les plus &#233;lev&#233;es. En 
effet, cette d&#233;duction se justifie par le fait que plus le texte est long, plus il contient de 
marqueurs linguistiques et de relations rh&#233;toriques. Par cons&#233;quent, le syst&#232;me 
ARSTR&#233;sume fait le maximum de couverture pour g&#233;n&#233;rer un extrait semblable &#224; celui 
r&#233;alis&#233; par l&#8217;expert humain. 
</p>
<p>A contrario, le syst&#232;me R.I.A., pr&#233;sente ses mesures de rappel et de pr&#233;cision, les plus 
&#233;lev&#233;es lorsque le texte est court, car, plus le texte est long, plus nous avons un calcul 
complexe qui diminue la performance du syst&#232;me. 
</p>
<p>HybridResume se comporte mieux en moyenne sur un corpus de texte bien distribu&#233; 
entre textes longs et courts, ce qui justifie ses meilleures performances. 
</p>
<p>7 Conclusion 
</p>
<p>L'&#233;tude, que nous avons pr&#233;sent&#233;e, s'inscrit dans le cadre des travaux de recherche 
effectu&#233;s sur les r&#233;sum&#233;s automatiques de documents arabes. Dans ce contexte, nous 
avons pr&#233;sent&#233; trois m&#233;thodes diff&#233;rentes de r&#233;sum&#233; automatique (i.e. une m&#233;thode 
symbolique, une m&#233;thode num&#233;rique et une m&#233;thode hybride). Nous avons impl&#233;ment&#233; 
ces trois m&#233;thodes respectivement dans les trois syst&#232;mes ARSTResume, R.I.A et 
HybridResume. 
</p>
<p>Ces trois syst&#232;mes ont &#233;t&#233; &#233;valu&#233;s sur un m&#234;me corpus d&#8217;&#233;valuation compos&#233; de cent 
textes r&#233;sum&#233;s par trois experts. L&#8217;&#233;valuation, a montr&#233; que le syst&#232;me R.I.A produit des 
r&#233;sultats meilleurs que ceux produits par le syst&#232;me ARSTResume. En effet, les mesures 
de pr&#233;cision sont respectivement de 60% et 67% pour les syst&#232;mes ARSTResume et R.I.A. 
La performance relative au syst&#232;me R.I.A par rapport au syst&#232;me ARSTResume s&#8217;explique 
</p>
<p>236</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>par la difficult&#233; de l&#8217;analyse linguistique. En effet, l&#8217;absence de relations rh&#233;toriques, la 
pr&#233;sence des mots ambigus et le manque d&#8217;informations morphologiques ont une 
influence n&#233;gative sur les valeurs de rappel et de pr&#233;cision. Toutefois, le syst&#232;me 
HybridResume, qui impl&#233;mente une m&#233;thode hybride, donne les meilleurs r&#233;sultats 
(73% de pr&#233;cision). 
</p>
<p>Suite &#224; cette &#233;tude comparative, Nous avons conclu que l&#8217;approche num&#233;rique est plus 
robuste que l&#8217;approche symbolique, lorsque le texte est court et que l&#8217;approche 
symbolique est plus robuste lorsque le texte est long. Par cons&#233;quent, nous trouvons que 
la combinaison de ces deux approches en une approche hybride donne de meilleurs 
r&#233;sultats. 
</p>
<p>Comme perspective, nous envisageons d&#8217;introduire une analyse morphologique pour la 
m&#233;thode symbolique en vue de mieux rep&#233;rer les relations rh&#233;toriques et d&#8217;am&#233;liorer les 
performances des syst&#232;mes. 
</p>
<p>8 Bibliographie 
</p>
<p>AMINI M.R.(2001). Apprentissage Automatique et Recherche d&#8217;information: Application &#224; 
l&#8217;extraction d&#8217;information de surface et au r&#233;sum&#233; de texte. Th&#232;se de doctorat, universit&#233; 
Paris-6 France. 
</p>
<p>ASHER N.(1993). Reference to Abstract Objects in Discourse. Kluwer Academic 
Publishers, Netherlands. 
</p>
<p>Azmi A.M. et Al-Thanyyan S.(2012). A Text Summarizer for Arabic. Computer Speech &amp; 
Language.  ISSN :0885-2308. 
</p>
<p>BELGUITH H.L., BACCOUR L. et MOURAD G.(2005). Segmentation de textes arabes bas&#233;e sur 
l'analyse contextuelle des signes de ponctuations et de certaines particules. 12&#232;me 
conf&#233;rence sur le Traitement Automatique des Langues Naturelles (TALN&#8217;2005), 
Dourdan, France, 6-10 juin 2005, pp 451&#8211;456.  
</p>
<p>BOUDABOUS M.M., MAALOUL, M.H. et BELGUITH H. L.(2010). Digital Learning for 
Summarizing ARABIC Documents . IceTAL, Islande. 
</p>
<p>IRAKY K., ZAKAREYA A. et FARAWILA A.(2011). Arabic Discourse Segmentation Based on 
Rhetorical Methods. International Journal of Electric &amp; Computer Sciences IJECS-IJENS 
Vol: 11 No: 01. 
</p>
<p>IRIA C., SILVIA F., PATRICIA v., VIVALDI J., SANJUAN E. et TORRES-MORENO J. M.(2007). A 
new hybrid summarizer based on Vector Space Model, Statistical Physics and Linguistics. 
Lecture Notes in Computer Science 4827. 872-882. ISSN 0302-9743. 
</p>
<p>KAMP H. et REYEL U.(1993),  From Discourse To Logic , Dordrecht Kluwer. 
</p>
<p>KAMP H.(1981).  Ev&#233;nements, repr&#233;sentations discursives et r&#233;f&#233;rence temporelle. 
Langages, p 34-64. 
</p>
<p>237</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>KESKES I.(2011). R&#233;sum&#233; automatique de textes arabes bas&#233; sur une approche 
symbolique. Editeur : EUE. ISBN-13 : 978-3841780232 
</p>
<p>KESKES I. et MAALOUL M. H.(2010).  R&#233;sum&#233; automatique de documents arabes bas&#233; sur 
la technique RST . Conf&#233;rence international de Rencontre des &#201;tudiants Chercheurs en 
Informatique pour le Traitement Automatique des Langues (TALN /RECITAL 2010), 
12&#232;me edition, Montr&#233;al &#8211; Canada. 
</p>
<p>KESKES I., MAALOUL M. H. et BELGUITH L. H.(2010) ,(a).   &#1589;&#21;&#13;&#18;&#22;! &#29;!4&#1575; 5&#12;6&#22;&#9;!&#1575; 7&#22;&#27; &#1575;&#1583;&#17;/&#9;&#27;&#1575; .&#12;&#25;&#3;9!&#1575;
.&#12;:;&lt;!&#1575; .&#12;&#18;&lt;!&#1575; .=&#3;&gt;&#30; . International Computing Conference in Arabic, 6&#232;me &#233;dition, 
Hammamet &#8211; Tunisie, prix du Best Paper. 
</p>
<p>KESKES I., MA&#194;LOUL M. H., BELGUITH L. H. et BLACHE P.(2010), (b).  Automatic 
summarization of Arabic texts based on RST technique. International Conference on 
Enterprise Information Systems, 12&#232;me edition, Madeira &#8211; Portugal. 
</p>
<p>LASCARIDES A. et ASHER N.(1993),  Temporal Interpretation, Discourse Relations, and 
Commonsense Entailment , Linguistics and Philosophy, 16(5). 
</p>
<p>MA&#194;LOUL M. H.(2007).  Al Lakas El&#8217;eli / &#1589;&#17;6&#22;&#1617;!&#1575; &#29;!4&#1575; : Un syst&#232;me de r&#233;sum&#233; automatique 
de documents arabes . IBIMA. 
</p>
<p>MANN W. C. et THOMPSON S. A.(1988).  Rhetorical structure theory: Toward a functional 
theory of text organization . Text, 8(3), p 243 &#8211; 281. 
</p>
<p>MARCU D.(1999). Discourse trees are good indicator of importance in text, Advances in 
Automatic Text Summarization. p123 &#8211; 136. 
</p>
<p>MINEL J.L.( 2002). Filtrage s&#233;mantique : du r&#233;sum&#233; automatique &#224; la fouille de textes. 
Herm&#232;s Science Publications, Paris. 
</p>
<p>MOURAD G.(1999). La segmentation de textes par l&#8217;&#233;tude de la ponctuation. CIDE&#8217;99, 
Document Electronique Dynamique, p 155 &#8211; 171, Damas, Syrie. 
</p>
<p>NICOLAS U., AMINI M.R. et GALLINARI P.(2005).  R&#233;sum&#233; automatique de texte avec un 
algorithme d'ordonnancement . CORIA. 
</p>
<p>TOFILOSKI M., BROOKE J. et TABOADA M.(2009). A Syntactic and Lexical-Based Discourse 
Segmenter. In Proceedings of the 47th Annual Meeting of the Association for 
Computational Linguistics. 
</p>
<p> 
</p>
<p>238</p>

</div></div>
</body></html>