<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse des contextes et des candidats dans l'identification des &#233;quivalents terminologiques en corpus comparables</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 407&#8211;414,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Analyse des contextes et des candidats
dans l&#8217;identification des &#233;quivalents terminologiques
</p>
<p>en corpus comparables
</p>
<p>Audrey Laroche1
(1) RALI&#8211;DIRO, Universit&#233; de Montr&#233;al, C.P. 6128, Succ. Centre-Ville Montr&#233;al (Qu&#233;bec) H3C 3J7, Canada
audrey.laroche@umontreal.ca
</p>
<p>R&#201;SUM&#201;
L&#8217;approche standard d&#8217;identification d&#8217;&#233;quivalents terminologiques &#224; partir de corpus comparables
repose sur la comparaison de mots contextuels en langues source et cible et sur l&#8217;utilisation
d&#8217;un lexique bilingue. Nous analysons manuellement, selon des crit&#232;res linguistiques (parties
du discours, sp&#233;cificit&#233; et relations s&#233;mantiques), les propri&#233;t&#233;s des mots contextuels et des
erreurs commises par l&#8217;approche standard appliqu&#233;e &#224; la terminologie m&#233;dicale pour sugg&#233;rer
des am&#233;liorations bas&#233;es sur la s&#233;lection de mots contextuels.
</p>
<p>ABSTRACT
Analysis of contexts and candidates in term-translation spotting in comparable corpora
</p>
<p>The standard approach for identifying terminological equivalents from comparable corpora is ba-
sed on the comparison of source and target language context words using a bilingual lexicon. We
cary a manual analysis of the linguistic properties (parts of speech, specificity and semantic rela-
tions) of the context words and the inacurrate equivalents given by the standard approach applied
to medical terminology, in order to suggest improvements based on the selection of context words.
</p>
<p>MOTS-CL&#201;S : &#233;quivalents terminologiques, vecteurs contextuels, corpus comparables, termino-
logie m&#233;dicale, &#233;tude qualitative.
</p>
<p>KEYWORDS: terminological equivalents, contextual vectors, comparable corpora, medical termi-
nology, qualitative study.
</p>
<p>1 Introduction
</p>
<p>L&#8217;identification automatique d&#8217;&#233;quivalents de termes (comme accident vasculaire c&#233;r&#233;bral et
stroke) est un sujet qui int&#233;resse de nombreux chercheurs. Les applications potentielles en sont
multiples : aide &#224; la r&#233;daction de dictionnaires bilingues sp&#233;cialis&#233;s ou &#224; la traduction, recherche
d&#8217;information multilingue, traduction automatique, etc. (Rapp, 1999; Li et Gaussier, 2010).
La plupart des techniques propos&#233;es pour identifier des &#233;quivalents de termes reposent sur
l&#8217;hypoth&#232;se selon laquelle le contexte d&#8217;un mot en langue source est similaire au contexte de son
&#233;quivalent en langue cible (Rapp, 1999).
</p>
<p>Les &#233;quivalents terminologiques sont, dans l&#8217;approche dite standard (Rapp, 1999), rep&#233;r&#233;s en
</p>
<p>407</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>comparant, &#224; l&#8217;aide d&#8217;un lexique bilingue de projection, leurs vecteurs contextuels extraits de
corpus comparables 1. Parmi les travaux r&#233;cents s&#8217;inspirant de cette approche, mentionnons ceux
de (Rubino, 2011; Rubino et Linar&#232;s, 2011), qui combinent par vote trois niveaux de repr&#233;senta-
tion pour chaque terme (contexte, th&#232;me et graphie). (Morin et Prochasson, 2011) utilisent un
lexique de projection sp&#233;cialis&#233; form&#233; &#224; partir de phrases parall&#232;les extraites automatiquement
de corpus comparables. (Prochasson et Fung, 2011) combinent des vecteurs contextuels et des
mod&#232;les de cooccurrence entre mots pour trouver les &#233;quivalents de termes rares. (Li et Gaussier,
2010) et (Li et al., 2011) proposent deux m&#233;thodes pour am&#233;liorer le degr&#233; de comparabilit&#233; des
corpus, param&#232;tre &#233;galement &#233;tudi&#233; par (Prochasson, 2009). Toutes ces strat&#233;gies contribuent
&#224; am&#233;liorer la performance de l&#8217;identification d&#8217;&#233;quivalents terminologiques. Notons que la
majorit&#233; des travaux mentionn&#233;s portent sur le domaine m&#233;dical, qui fait aussi l&#8217;objet du pr&#233;sent
article.
</p>
<p>L&#8217;analyse de la performance de ces divers syst&#232;mes repose sur des mesures classiques comme la
pr&#233;cision et le rappel. Dans le pr&#233;sent article, nous analysons qualitativement les mots contextuels
pris en compte dans l&#8217;approche standard, notamment du point de vue de leur partie du discours,
de leur degr&#233; de sp&#233;cificit&#233; et de leur relation s&#233;mantique avec le terme en langue source. Cette
analyse servira &#233;ventuellement &#224; d&#233;terminer s&#8217;il est possible de s&#233;lectionner les mots du contexte
pour augmenter la performance de l&#8217;identification d&#8217;&#233;quivalents. De plus, nous examinons les
candidats &#233;quivalents erron&#233;s obtenus avec l&#8217;approche standard, de fa&#231;on &#224; cat&#233;goriser les erreurs
typiques et ainsi proposer des heuristiques pouvant am&#233;liorer la performance.
</p>
<p>2 Approche par projection de contextes
</p>
<p>L&#8217;approche standard d&#8217;extraction d&#8217;&#233;quivalents terminologiques &#224; partir de corpus comparables
est bas&#233;e sur la comparaison de vecteurs de mots contextuels tir&#233;s de corpus de langues source
et cible. Chaque terme dont on cherche l&#8217;&#233;quivalent est caract&#233;ris&#233; par ses mots voisins (la
d&#233;finition de voisinage variant d&#8217;une &#233;tude a l&#8217;autre) qui sont pond&#233;r&#233;s (&#224; l&#8217;aide d&#8217;une mesure
d&#8217;association) en fonction de leur fr&#233;quence de cooccurrence avec ce terme source. Les mots
voisins sont projet&#233;s dans la langue cible &#224; l&#8217;aide d&#8217;un lexique bilingue de projection (constitu&#233;
de mots sp&#233;cialis&#233;s ou g&#233;n&#233;raux), formant ainsi un vecteur projection. Ce dernier est compar&#233;
aux vecteurs de mots contextuels des termes extraits du corpus en langue cible : les candidats
&#233;quivalents sont ceux dont le vecteur contextuel ressemble le plus (selon une certaine mesure de
similarit&#233;) au vecteur projection.
</p>
<p>Cette approche par projection de contextes comporte plusieurs param&#232;tres de base. (Laroche
et Langlais, 2010) en ont fait une &#233;tude d&#233;taill&#233;e en utilisant des corpus comparables anglais
et fran&#231;ais tir&#233;s de Wikip&#233;dia avec NlGbAse (Charton et Torres-Moreno, 2010), ainsi que des
lexiques de projection contenant des mots g&#233;n&#233;raux (provenant de Freelang) et sp&#233;cialis&#233;s
(provenant du Multilingual glossary of technical and popular medical terms du Heymans Institute
of Pharmacology). Les exp&#233;riences portaient sur 5 000 termes nominaux simples et complexes 2
</p>
<p>1. Des corpus sont comparables s&#8217;ils ne sont pas des traductions l&#8217;un de l&#8217;autre, mais portent sur le m&#234;me domaine.
2. Une approche &#171; en amont &#187; (Morin, 2007) est utilis&#233;e pour extraire les contextes (mots simples seulement) des
</p>
<p>termes complexes sources ; les mots des vecteurs projections sont simples ou complexes, selon leur traduction dans
le lexique de projection. Des vecteurs contextuels sont extraits du corpus cible pour tous les mots simples et tous les
bigrammes compos&#233;s de deux mots lexicaux (99,5 % des &#233;quivalents de r&#233;f&#233;rence comptant au plus deux composantes).
</p>
<p>408</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>du domaine m&#233;dical tir&#233;s du MeSH 3. Les meilleures valeurs de param&#232;tres, selon les exp&#233;riences
de (Laroche et Langlais, 2010) sur 70 configurations diff&#233;rentes, sont :
&#8211; Longueur du contexte : la phrase 4.
&#8211; Mesure d&#8217;association : le ratio log-odds.
&#8211; Mesure de similarit&#233; entre vecteurs contextuels : le cosinus.
&#8211; Taille du lexique bilingue de projection : 9 000 termes (pour des corpus de 90 328 mots
</p>
<p>(source) et 38 929 mots (cible) en moyenne).
&#8211; Contenu du lexique de projection : mots g&#233;n&#233;raux et termes sp&#233;cialis&#233;s.
Tout comme (Prochasson, 2009), (Laroche et Langlais, 2010) ont observ&#233; que les mesures
d&#8217;association et de similarit&#233; sont les param&#232;tres ayant la plus grande influence sur la performance
et que les diff&#233;rents param&#232;tres s&#8217;influencent les uns les autres. D&#8217;autres param&#232;tres importants
ont fait l&#8217;objet d&#8217;articles, comme le degr&#233; de comparabilit&#233; des corpus (Li et Gaussier, 2010; Li
et al., 2011) et la fr&#233;quence d&#8217;occurrence des termes (Prochasson et Fung, 2011; Li et al., 2011).
Tel que mentionn&#233; en introduction, de nombreuses techniques ont r&#233;cemment &#233;t&#233; propos&#233;es
pour am&#233;liorer l&#8217;approche standard.
</p>
<p>3 Analyse des mots contextuels
</p>
<p>Nous avons analys&#233; manuellement le contenu des vecteurs projections de 30 termes nominaux
simples ou complexes choisis arbitrairement (mais commen&#231;ant par la lettre a 5), et ce, pour
quatre tailles de lexiques de projection diff&#233;rentes (5 000, 7 000, 9 000 et 11 000 entr&#233;es,
dont 2 000 du domaine m&#233;dical et le reste de langue g&#233;n&#233;rale) ; l&#8217;analyse porte donc sur 120
vecteurs projections. Ces vecteurs ont &#233;t&#233; obtenus en utilisant les ressources, l&#8217;impl&#233;mentation
et la configuration param&#233;trique optimale de (Laroche et Langlais, 2010). Rappelons que les
vecteurs projections correspondent aux mots voisins des termes en langue source qui sont projet&#233;s
vers la langue cible &#224; l&#8217;aide du lexique bilingue de projection. Le Tableau 1 pr&#233;sente le contenu
de quelques-uns des vecteurs &#233;tudi&#233;s (obtenus avec le lexique de projection de 5 000 entr&#233;es).
</p>
<p>Nous examinons la r&#233;partition des parties du discours de m&#234;me que le degr&#233; de sp&#233;cificit&#233;
(langue sp&#233;cialis&#233;e ou g&#233;n&#233;rale) et la s&#233;mantique des 20 plus forts mots contextuels des 30
termes fran&#231;ais 6. Ceci nous permet d&#8217;identifier des crit&#232;res pouvant am&#233;liorer la qualit&#233; de
l&#8217;identification d&#8217;&#233;quivalents. Cette analyse est compl&#233;mentaire &#224; l&#8217;inspection manuelle des mots
contextuels dans l&#8217;approche standard men&#233;e par (Morin, 2007) pour 100 termes simples du
domaine de la foresterie, qui est centr&#233;e sur l&#8217;apport des termes complexes dans les vecteurs
contextuels en langue source et les vecteurs projections. Ses r&#233;sultats ne peuvent pas &#234;tre
directement compar&#233;s aux n&#244;tres, puisque notre impl&#233;mentation n&#8217;extrait du corpus source que
des termes simples pour peupler les vecteurs contextuels.
</p>
<p>3. Les ressources utilis&#233;es dans l&#8217;&#233;tude en question sont disponibles sur http://olst.ling.umontreal.ca/
~audrey/coling2010
</p>
<p>4. Selon (Prochasson, 2009; Rubino et Linar&#232;s, 2011), la longueur optimale d&#233;pend de la fr&#233;quence du terme source.
5. Abc&#232;s (abscess), ac&#233;tyl&#232;ne (acetylene), ac&#233;tylcholine (acetylcholine), accident vasculaire c&#233;r&#233;bral (stroke), acide lactique
</p>
<p>(lactic acid), acides (acids), adh&#233;sifs (adhesives), aine (groin), albinisme (albinism), all&#232;les (alleles), alliages (alloys), alo&#232;s
(aloe), amiante (asbestos), amidon (starch), amn&#233;sie (amnesia), amph&#233;tamines (amphetamines), analyse harmonique
(Fourier analysis), anatomie (anatomy), anesth&#233;sie (anesthesia), anorexie mentale (anorexia nervosa), antigenes (antigens),
antioxydants (antioxidants), anxi&#233;t&#233; (anxiety), apn&#233;e (apnea), appendicite (appendicitis), art&#232;re pulmonaire (pulmonary
artery), art&#232;res (arteries), articulations (joints), atrophie (atrophy).
</p>
<p>6. (Laroche et Langlais, 2010) &#233;tudient en d&#233;tail la pond&#233;ration statistique des mots contextuels.
</p>
<p>409</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Terme source Vecteur projection
syndrome, Parkinsonism, deficit, hypoplasia, anomaly, ocular,
</p>
<p>albinisme corpus luteum, pigments, absence, mutation, origin, retina,
nystagmus, nobody, pigmentation, abatement, synthesis, lyophilisate
aorta, pulmonary, Parkinsonism, cardiac, coronary, circulation,
</p>
<p>art&#232;res infarction, fact, risk patient, vascular, fat, afterload, members,
network, hypertension, myelosuppression, myocardium, arterial,
lyophilisate, fabrics
pulmonary, cardiac, aorta, afterload, arterial, duct, ventricular,
</p>
<p>art&#232;re pulmonaire coronary, venous, hypertension, Parkinsonism, systolic, function,
stenosis, absence, fat, fact, circulation, diameter, anomaly
</p>
<p>TABLE 1 &#8211; Contenu des vecteurs projections
</p>
<p>3.1 Parties du discours
</p>
<p>Les noms sont fortement majoritaires dans les vecteurs projections. Par exemple, avec le lexique
de projection de 5 000 entr&#233;es, 80,9 % des mots contextuels dans les vecteurs sont des noms. Par
comparaison, ce m&#234;me lexique de projection compte 68,7 % de noms. Rappelons que dans nos
exp&#233;riences, les termes dont on cherche l&#8217;&#233;quivalent sont des noms ou des syntagmes nominaux
(de deux composants) ; il serait int&#233;ressant de voir, avec de nouveaux &#233;quivalents de r&#233;f&#233;rence, si
la majorit&#233; des mots contextuels seraient aussi des noms si les termes dont on cherche l&#8217;&#233;quivalent
&#233;taient d&#8217;une autre partie du discours.
</p>
<p>D&#8217;autre part, il n&#8217;y a pas de diff&#233;rence significative quant aux proportions des parties du discours
des mots contextuels selon que les termes dont on cherche l&#8217;&#233;quivalent sont simples (par ex.
art&#232;res) ou complexes (par ex. art&#232;re pulmonaire), ces deux types de termes &#233;tant trait&#233;s de la
m&#234;me fa&#231;on (c&#8217;est-&#224;-dire d&#8217;un seul bloc) dans notre impl&#233;mentation.
</p>
<p>3.2 Sp&#233;cificit&#233;
</p>
<p>Pour analyser le degr&#233; de sp&#233;cificit&#233; des mots contextuels dans les vecteurs projections, nous
avons class&#233; chacun d&#8217;entre eux dans l&#8217;une de trois cat&#233;gories : &#171; domaine m&#233;dical &#187;, &#171; langue
g&#233;n&#233;rale &#187; ou &#171; ambigu &#187;. Certains mots sont ambigus parce qu&#8217;ils appartiennent &#224; la fois &#224; la
langue g&#233;n&#233;rale et &#224; la langue m&#233;dicale. Par exemple, dans le vecteur projection d&#8217;anatomie se
trouve le mot fingers, que nous avons consid&#233;r&#233; comme ambigu. Cette t&#226;che est relativement
difficile &#233;tant donn&#233; que nous ne sommes ni sp&#233;cialiste du domaine m&#233;dical, ni terminologue, ni
anglophone ; certaines tendances se dessinent tout de m&#234;me (Figure 1).
</p>
<p>En moyenne, 57,5 % des mots contextuels sont du domaine m&#233;dical lorsque le lexique de
projection compte 5 000 entr&#233;es, bien que celui-ci contienne 36 % d&#8217;entr&#233;es du domaine m&#233;dical :
les mots contextuels projet&#233;s et qui ont un score d&#8217;association fort avec le terme source ont
donc tendance &#224; &#234;tre des mots sp&#233;cialis&#233;s. La quantit&#233; de termes sp&#233;cialis&#233;s dans les vecteurs
projections d&#233;pend tout de m&#234;me de la proportion de termes sp&#233;cialis&#233;s dans le lexique de
projection, comme le montre la Figure 1 (36 % des entr&#233;es sont du domaine m&#233;dical dans le
lexique de taille 5 000, contre 16 % dans le lexique de 11 000 entr&#233;es).
</p>
<p>410</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 1 &#8211; R&#233;partition des domaines dans les vecteurs projections (en %) selon la taille du
lexique de projection
</p>
<p>Avec notre &#233;chantillon de 30 termes en langue source, il n&#8217;y a pas de corr&#233;lation entre la propor-
tion de mots contextuels qui appartiennent au domaine m&#233;dical et le rang du bon &#233;quivalent.
Toutefois, en utilisant l&#8217;approche standard pour identifier les &#233;quivalents de 122 termes simples
du domaine m&#233;dical, (Morin et Prochasson, 2011) ont montr&#233; que les r&#233;sultats sont meilleurs
lorsque le lexique de projection contient des termes sp&#233;cialis&#233;s en plus de mots de la langue
g&#233;n&#233;rale. Puisque le contenu du lexique de projection a une influence directe sur le contenu des
vecteurs projections, il est possible qu&#8217;avec un &#233;chantillon de taille comparable nous observions
un effet analogue ; de plus amples analyses seraient n&#233;cessaires pour le v&#233;rifier.
</p>
<p>3.3 Relations s&#233;mantiques
</p>
<p>Les mots faisant partie du vecteur projection sont souvent s&#233;mantiquement li&#233;s au terme source.
Selon nos observations sur un sous-ensemble de 10 termes, les mots contextuels peuvent &#234;tre en
relation de collocation (amn&#233;sie et infantile), de synonymie (anorexie mentale et anorexia) ou
d&#8217;hyponymie (art&#232;res et aorta) avec le terme source, ils peuvent lui &#234;tre li&#233;s morphologiquement
(anatomie et anatomical), avoir un lien s&#233;mantique sp&#233;cifique au domaine m&#233;dical (par exemple
est un sympt&#244;me de ou autres relations plus difficiles &#224; caract&#233;riser comme celle entre albinisme
et pigmentation), n&#8217;&#234;tre pas li&#233;s s&#233;mantiquement au terme source ou encore &#234;tre trop g&#233;n&#233;riques.
Les relations sp&#233;cifiques au domaine m&#233;dical sont les plus fr&#233;quentes (moyenne de 7,3/20 mots
contextuels en utilisant le lexique bilingue de projection de 5 000 entr&#233;es), suivies des relations
de collocation (moyenne de 4,7/20). Les m&#234;mes mots contextuels de s&#233;mantisme faible (comme
nobody) ou qui ne sont pas li&#233;s s&#233;mantiquement au terme source reviennent dans plusieurs
vecteurs ; les premiers pourraient &#234;tre &#233;limin&#233;s en les incluant dans un antidictionnaire, et la
pr&#233;sence des seconds peut s&#8217;expliquer par certaines faiblesses de nos ressources, tel qu&#8217;expliqu&#233;
dans la prochaine section.
</p>
<p>411</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.4 Cas probl&#233;matiques
</p>
<p>Dans environ 10 % des vecteurs projections examin&#233;s, les domaines d&#8217;o&#249; proviennent les mots
contextuels sont tr&#232;s disparates. Par exemple, le vecteur projection obtenu pour aine (avec le
lexique de projection de 5 000 entr&#233;es) est form&#233; des mots : grand mal, meadow, radio, music,
region, quarter, network, yearly, policy, family, country, origin, population, venous, dance, diffusion,
orange, contest, prince, hockey. Les candidats &#233;quivalents pour aine sont &#224; leur tour tr&#232;s diversifi&#233;s
s&#233;mantiquement. Plusieurs &#233;l&#233;ments peuvent expliquer cette disparit&#233; : la fa&#231;on dont le corpus a
&#233;t&#233; construit, son contenu, la polys&#233;mie.
</p>
<p>Nous avons remarqu&#233;, au cours de l&#8217;analyse, certaines lacunes concernant le lexique bilingue de
projection (dans lequel les mots contextuels retenus figurent n&#233;cessairement). Dans ce lexique,
l&#8217;&#233;quivalent de maladie est Parkinsonism, celui de double est doubleblind, celui de mal est grand
mal, celui de corps est corpus luteum, celui de produit est lyophilisate, celui de risque est risk
patient. Ces &#233;quivalents du lexique bilingue de projection sont beaucoup plus sp&#233;cifiques que
les termes fran&#231;ais. Le mot Parkinsonism se retrouve ainsi dans plusieurs vecteurs projections
(comme ceux des trois exemples du Tableau 1), mais, &#233;tant donn&#233; qu&#8217;il est rare dans les corpus
anglais, il ne figure virtuellement pas dans les vecteurs contextuels des candidats &#233;quivalents.
La performance de l&#8217;identification d&#8217;&#233;quivalents pourrait sans doute &#234;tre am&#233;lior&#233;e si le lexique
bilingue de projection &#233;tait d&#8217;une meilleure qualit&#233; (Morin et Prochasson, 2011).
</p>
<p>Enfin, les mots contextuels sont parfois redondants, &#233;tant donn&#233; que, dans notre impl&#233;mentation,
ils ne sont pas lemmatis&#233;s (ceci afin de ne pas faire d&#233;pendre l&#8217;approche standard d&#8217;outils
externes qui ne sont pas entra&#238;n&#233;s sur des corpus m&#233;dicaux). Pratiquement tous les chercheurs
lemmatisent leur corpus avant de former les vecteurs contextuels, et notre examen manuel des
mots projet&#233;s leur donne raison.
</p>
<p>4 Analyse des candidats &#233;quivalents
</p>
<p>Nous avons analys&#233; manuellement les 20 premiers candidats &#233;quivalents de 30 termes fran&#231;ais
(les m&#234;mes que ceux de la section 3) obtenus avec diff&#233;rents param&#232;tres dans les exp&#233;riences de
(Laroche et Langlais, 2010), pour un total de 360 listes de 20 candidats. Avec la configuration
param&#233;trique optimale, pour 18 des 30 termes examin&#233;s, le bon &#233;quivalent n&#8217;est pas au premier
rang. On y trouve plut&#244;t 3 candidats correspondant &#224; une composante du terme complexe attendu
(acid pour acide lactique), 1 qui ne diff&#232;re de l&#8217;&#233;quivalent de r&#233;f&#233;rence que par la morphologie
(joint pour articulations), 11 qui sont s&#233;mantiquement li&#233;s &#224; l&#8217;&#233;quivalent de r&#233;f&#233;rence (eating
pour anorexie mentale), 2 qui sont des mots g&#233;n&#233;riques (causes pour albinisme et species pour
antioxydants) et 1 qui n&#8217;a aucun lien avec l&#8217;&#233;quivalent de r&#233;f&#233;rence (combo pour aine).
</p>
<p>Pour toutes les valeurs de param&#232;tres test&#233;es dans (Laroche et Langlais, 2010), il y a syst&#233;ma-
tiquement environ deux candidats sur 20 qui sont des termes complexes, et ce, peu importe si
l&#8217;&#233;quivalent de r&#233;f&#233;rence est simple ou complexe. Les termes &#233;quivalents d&#8217;une langue &#224; l&#8217;autre
n&#8217;ont pas toujours la m&#234;me complexit&#233; (accident vasculaire c&#233;r&#233;bral et stroke) (Morin et Daille,
2004). Mais le fait que, peu importe les valeurs des param&#232;tres, le syst&#232;me r&#233;cup&#232;re le m&#234;me
nombre de candidats &#233;quivalents complexes sugg&#232;re qu&#8217;il pourrait &#234;tre am&#233;lior&#233;, par exemple
en extrayant pr&#233;alablement les termes (simples et complexes) dans les corpus sources et cibles
(Daille et Morin, 2005). Par ailleurs, dans plusieurs cas, les composantes des termes complexes
</p>
<p>412</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(ex. fatty et acids) sont situ&#233;es &#224; de meilleurs rangs que l&#8217;&#233;quivalent de r&#233;f&#233;rence (fatty acids) dans
la liste des candidats &#233;quivalents. Ceci peut &#234;tre attribu&#233; &#224; notre impl&#233;mentation, dans laquelle
des vecteurs contextuels en langue cible sont construits &#224; la fois pour les termes complexes
(bigrammes) et pour chacune de leurs composantes. Une heuristique pourrait donner plus de
poids au terme complexe dans ces cas.
</p>
<p>Dans presque toutes les listes de candidats &#233;quivalents, de un &#224; cinq (environ) candidats parmi les
20 sont morphologiquement li&#233;s &#224; l&#8217;&#233;quivalent de r&#233;f&#233;rence. L&#8217;&#233;tiquetage des parties du discours
et la lemmatisation (que font plusieurs chercheurs) permettraient de regrouper les candidats
dont seule la flexion varie (par ex., acids et acid) pour ensuite proposer comme &#233;quivalent
le candidat qui a le m&#234;me nombre que le terme source. Le fait que l&#8217;approche par projection
permette de trouver des candidats li&#233;s morphologiquement (comme oxygen, oxidative, antioxidant
et reactive oxygen pour antioxydants) montre que les indices contextuels sont pertinents pour
trouver automatiquement les flexions et les d&#233;rivations d&#8217;un mot donn&#233;.
</p>
<p>Tous nos &#233;quivalents de r&#233;f&#233;rence sont des noms ou des syntagmes nominaux ; or, environ 25 %
des candidats &#233;quivalents ont une autre partie du discours. De fa&#231;on g&#233;n&#233;rale, les parties du
discours ne sont pas toujours identiques entre les termes &#233;quivalents dans les langues distinctes
(N&#233;v&#233;ol et Ozdowska, 2006), mais, &#233;tant donn&#233;s notre paire de langues source et cible (fran&#231;ais
et anglais) et notre domaine (le lexique m&#233;dical), il serait justifi&#233; de r&#233;ordonner les candidats
&#233;quivalents pour favoriser les termes nominaux.
</p>
<p>Enfin, dans pratiquement toutes les listes de candidats &#233;quivalents observ&#233;es, au moins 10 (et
souvent au-del&#224; de 15) des 20 candidats sont s&#233;mantiquement li&#233;s &#224; l&#8217;&#233;quivalent de r&#233;f&#233;rence.
Ces candidats seraient pertinents pour construire des th&#233;saurus, des dictionnaires de synonymes
ou d&#8217;analogies, etc. Parmi les autres candidats, ceux qui sont des mots g&#233;n&#233;riques comme process
et levels pourraient &#234;tre inclus dans un antidictionnaire. Si les candidats &#233;quivalents ne sont pas
g&#233;n&#233;riques, mais appartiennent &#224; des domaines tr&#232;s diff&#233;rents, cela indique que le terme source
est polys&#233;mique et devrait &#234;tre d&#233;sambigu&#239;s&#233;.
</p>
<p>5 Conclusion
</p>
<p>L&#8217;approche standard par projection de contextes pour l&#8217;identification d&#8217;&#233;quivalents terminolo-
giques en corpus comparables est une technique sur laquelle se basent plusieurs travaux r&#233;cents
qui proposent des strat&#233;gies pour am&#233;liorer la pr&#233;cision. Nous avons analys&#233; manuellement, selon
des crit&#232;res linguistiques, le contenu des vecteurs projections et les listes de candidats &#233;quivalents
obtenus avec l&#8217;impl&#233;mentation de (Laroche et Langlais, 2010) appliqu&#233;e &#224; 30 termes du domaine
m&#233;dical. Les mots contextuels ont souvent la m&#234;me partie du discours que le terme source, ils ont
tendance &#224; &#234;tre sp&#233;cialis&#233;s et &#224; &#234;tre li&#233;s au terme source par des relations sp&#233;cifiques au domaine
et par la collocation ; la qualit&#233; des ressources a une influence directe sur celle des vecteurs
projections. Parmi les candidats &#233;quivalents, ceux qui ont le m&#234;me nombre, le m&#234;me degr&#233; de
complexit&#233; et la m&#234;me partie du discours que le terme source sont &#224; privil&#233;gier (du moins pour le
domaine m&#233;dical). Le fait que la tr&#232;s grande majorit&#233; des candidats soient s&#233;mantiquement li&#233;s &#224;
l&#8217;&#233;quivalent de r&#233;f&#233;rence confirme l&#8217;int&#233;r&#234;t de l&#8217;approche bas&#233;e sur la projection de contextes. Les
travaux futurs v&#233;rifieront l&#8217;influence sur la performance des heuristiques propos&#233;es ici et de la
s&#233;lection de mots contextuels en fonction des caract&#233;ristiques que nous avons fait ressortir.
</p>
<p>413</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Remerciements
</p>
<p>Nous remercions Rapha&#235;l Rubino pour les ressources ainsi que Philippe Langlais, Patrick Drouin
et les relecteurs pour leurs commentaires pertinents. Nous reconnaissons le soutien du FQRSC.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CHARTON, E. et TORRES-MORENO, J.-M. (2010). Nlgbase : A free linguistic resource for natural
language processing systems. In Proceedings of the 7th International Conference on Language
Resources and Evaluation (LREC&#8217;10).
</p>
<p>DAILLE, B. et MORIN, E. (2005). French-English terminology extraction from comparable corpora.
In 2nd International Joint Conference on Natural Language Processing, pages 707&#8211;718.
</p>
<p>LAROCHE, A. et LANGLAIS, P. (2010). Revisiting context-based projection methods for term-
translation spotting in comparable corpora. In Proceedings of the 23rd International Conference
on Computational Linguistics, pages 617&#8211;625.
</p>
<p>LI, B. et GAUSSIER, E. (2010). Improving corpus comparability for bilingual lexicon extraction
from comparable corpora. In Proceedings of the 23rd International Conference on Computational
Linguistics, pages 644&#8211;652.
</p>
<p>LI, B., GAUSSIER, E., MORIN, E. et HAZEM, A. (2011). Degr&#233; de comparabilit&#233;, extraction lexicale
bilingue et recherche d&#8217;information interlingue. In Actes de TALN 2011.
</p>
<p>MORIN, E. (2007). Apport des termes complexes &#224; l&#8217;acquisition lexicale multilingue &#224; partir de
corpus comparables sp&#233;cialis&#233;s : entre intuition et r&#233;alit&#233;. In Actes, 7&#232;me Rencontres Terminologie
et Intelligence Artificielle, pages 11&#8211;20.
</p>
<p>MORIN, E. et DAILLE, B. (2004). Extraction de terminologies bilingues rtir de corpus comparables.
Traitement automatique des langues, 45(3):103&#8211;122.
</p>
<p>MORIN, E. et PROCHASSON, E. (2011). Bilingual lexicon extraction from comparable corpora
enhanced with parallel corpora. In Proceedings of the 4th Workshop on Building and Using
Comparable Corpora : Comparable Corpora and the Web, pages 27&#8211;34.
</p>
<p>N&#201;V&#201;OL, A. et OZDOWSKA, S. (2006). Terminologie m&#233;dicale bilingue anglais/fran&#231;ais : usages
cliniques et bilingues. Glottopol, 8.
</p>
<p>PROCHASSON, E. (2009). Alignement multilingue en corpus comparables spalis&#233;s : Caract&#233;risation
terminologique multilingue. Th&#232;se de doctorat, Universit&#233; de Nantes.
</p>
<p>PROCHASSON, E. et FUNG, P. (2011). Rare word translation extraction from aligned comparable
documents. In Proceedings of the 49th Annual Meeting of the Association for Computational
Linguistics : Human Language Technologies, pages 1327&#8211;1335.
</p>
<p>RAPP, R. (1999). Automatic identification of word translations from unrelated English and
German corpora. In 37th Annual Meeting of the Association for Computational Linguistics, pages
66&#8211;70.
</p>
<p>RUBINO, R. (2011). Traduction automatique statistique et adaptation &#224; un domaine sp&#233;cialis&#233;.
Th&#232;se de doctorat, Universit&#233; d&#8217;Avignon et des Pays de Vaucluse.
</p>
<p>RUBINO, R. et LINAR&#200;S, G. (2011). Une approche multi-vue pour l&#8217;extraction terminologique
bilingue. In Conf&#233;rence en Recherche d&#8217;Infomations et Applications, pages 97&#8211;111.
</p>
<p>414</p>

</div></div>
</body></html>