<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>SPPAS : segmentation, phon&#233;tisation, alignement, syllabation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 5: D&#233;monstrations, pages 9&#8211;10,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>SPPAS : segmentation, phon&#233;tisation, alignement, syllabation
</p>
<p>Brigitte Bigi
Laboratoire Parole et Langage, CNRS &amp; Aix-Marseille Universit&#233;,
</p>
<p>5 avenue Pasteur, BP80975, 13604 Aix-en-Provence France
brigitte.bigi&#8;lpl-aix.fr
</p>
<p>R&#201;SUM&#201;
SPPAS est le nouvel outil du LPL pour l&#8217;alignement texte/son. La segmentation s&#8217;op&#232;re en 4
&#233;tapes successives dans un processus enti&#232;rement automatique ou semi-automatique, &#224; partir
d&#8217;un fichier audio et d&#8217;une transcription. Le r&#233;sultat comprend la segmentation en unit&#233;s
inter-pausales, en mots, en syllabes et en phon&#232;mes. La version actuelle propose un ensemble
de ressources qui permettent le traitement du fran&#231;ais, de l&#8217;anglais, de l&#8217;italien et du chinois.
L&#8217;ajout de nouvelles langues est facilit&#233;e par la simplicit&#233; de l&#8217;architecture de l&#8217;outil et le respect
des formats de fichiers les plus usuels. L&#8217;outil b&#233;n&#233;ficie en outre d&#8217;une documentation en ligne
et d&#8217;une interface graphique afin d&#8217;en faciliter l&#8217;accessibilit&#233; aux non-informaticiens. Enfin,
SPPAS n&#8217;utilise et ne contient que des ressources et programmes sous licence libre GPL.
</p>
<p>ABSTRACT
SPPAS : a tool to perform text/speech alignment
</p>
<p>SPPAS is a new tool dedicated to phonetic alignments, from the LPL laboratory. SPPAS produces
automatically or semi-automatically annotations which include utterance, word, syllabic and
phonemic segmentations from a recorded speech sound and its transcription. SPPAS is currently
implemented for French, English, Italian and Chinese There is a very simple procedure to
add other languages in SPPAS : it is just needed to add related resources in the appropriate
directories. SPPAS can be used by a large community of users : accessibility and portability are
importants aspects in its development. The tools and resources will all be distributed with a
GPL license.
</p>
<p>MOTS-CL&#201;S : segmentation, phon&#233;tisation, alignement, syllabation.
</p>
<p>KEYWORDS: segmentation, phonetization, alignement, syllabification.
</p>
<p>Dans le vaste domaine de la segmentation texte/son, on trouve sur le web de nombreuses
&#171; bo&#238;tes &#224; outils &#187; pour r&#233;aliser diff&#233;rents niveaux de segmentations de la parole et l&#8217;appren-
tissage des mod&#232;les sous-jacents. Des ressources (dictionnaires, mod&#232;les, etc.) sont &#233;galement
disponibles pour pouvoir les exploiter. Pourtant, lorsqu&#8217;il s&#8217;agit d&#8217;effectuer des alignements (en
quantit&#233; raisonnable), la plupart des phon&#233;ticiens choisissent de le faire manuellement m&#234;me
si plusieurs heures sont souvent n&#233;cessaires pour n&#8217;aligner qu&#8217;une seule minute de signal. La
raison principalement &#233;voqu&#233;e concerne le fait que tr&#232;s peu d&#8217;outils sont &#224; la fois disponibles
librement, utilisables de fa&#231;on simple et ergonomique, multi-plateforme et, bien s&#251;r, qui traite
la langue souhait&#233;e. Ainsi, bien qu&#8217;elles soient tr&#232;s utilis&#233;es par les informaticiens, des bo&#238;tes &#224;
outils telles que, par exemple, HTK (Young, 1994), Sphinx (Carnegie Mellon University, 2011)
</p>
<p>9</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ou Julius (Lee et al., 2001), ne b&#233;n&#233;ficient toujours pas d&#8217;un d&#233;veloppement qui permette une
accessibilit&#233; &#224; une communaut&#233; plus large d&#8217;utilisateurs. D&#233;velopper un outil d&#8217;alignement au-
tomatique, s&#8217;appuyant uniquement sur des ressources libres (outils et donn&#233;es) et regroupant
les crit&#232;res n&#233;cessaire &#224; son accessibilit&#233; &#224; des non-informaticiens n&#8217;est pas uniquement un d&#233;fi
technique. On suppose en effet que si tel &#233;tait le cas, cet outil existerait d&#233;j&#224;.
</p>
<p>Le logiciel pr&#233;sent&#233; lors de la session de d&#233;monstration s&#8217;appelle SPPAS :
</p>
<p>http://www.lpl-aix.fr/~bigi/sppas/
</p>
<p>La segmentation en IPUs consiste &#224; aligner les macro-unit&#233;s d&#8217;un texte (segments, phrases, etc)
avec le son qui lui correspond. L&#8217;algorithme impl&#233;ment&#233; dans SPPAS s&#8217;appuie sur la recherche
des pauses dans le signal et leur alignement avec les unit&#233;s propos&#233;es dans la transcription (en
supposant qu&#8217;une pause s&#233;pare chaque unit&#233;).
</p>
<p>La phon&#233;tisation consiste &#224; repr&#233;senter les unit&#233;s (mots, syllabes) d&#8217;un texte par des symboles
phon&#233;tiques. SPPAS s&#8217;appuie uniquement sur la consultation d&#8217;un dictionnaire de prononcia-
tions et traite les deux cas suivants : 1/ une entr&#233;e peut se prononcer de diff&#233;rentes mani&#232;res
(homographes h&#233;t&#233;rophones, accents r&#233;gionaux, ph&#233;nom&#232;nes de r&#233;ductions propres &#224; l&#8217;oral...).
Dans ce cas, c&#8217;est l&#8217;aligneur qui choisit la phon&#233;tisation. 2/ une entr&#233;e peut &#234;tre absente du
dictionnaire. SPPAS produit une phon&#233;tisation automatique dont l&#8217;algorithme, ind&#233;pendant de
la langue, cherche les segments les plus longs dans le dictionnaire. Dans un processus semi-
automatique, l&#8217;utilisateur peut choisir/modifier la phon&#233;tisation.
</p>
<p>L&#8217;alignement en phon&#232;me consiste &#224; d&#233;terminer la localisation temporelle de chacun des
phon&#232;mes d&#8217;une unit&#233;. SPPAS fait appel &#224; Julius pour r&#233;aliser l&#8217;alignement. Pour r&#233;aliser l&#8217;aligne-
ment, Julius a besoin d&#8217;une grammaire et d&#8217;un mod&#232;le acoustique. La grammaire contient la (ou
les) prononciation(s) de chaque mot et l&#8217;indication des transitions entre les mots. L&#8217;alignement
requiert aussi un mod&#232;le acoustique qui doit &#234;tre au format HTK-ASCII.
</p>
<p>Concernant la syllabation, SPPAS encapsule le syllabeur du LPL (Bigi et al., 2010). Il consiste &#224;
d&#233;finir un ensemble de r&#232;gles de segmentation entre phon&#232;mes. Les phon&#232;mes sont regroup&#233;s
en classes et des r&#232;gles de segmentation entre ces classes sont &#233;tablies.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BIGI, B., MEUNIER, C., NESTERENKO, I. et BERTRAND, R. (2010). Automatic detection of syllable
boundaries in spontaneous speech. In Language Resource and Evaluation Conference, pages
3285&#8211;3292, La Valetta, Malta.
</p>
<p>CARNEGIE MELLON UNIVERSITY (2011). CMUSphinx : Open Source Toolkit For Speech Recogni-
tion. http ://cmusphinx.sourceforge.net.
</p>
<p>LEE, A., KAWAHARA, T. et SHIKANO., K. (2001). Julius &#8212; an open source real-time large vocab-
ulary recognition engine. In European Conference on Speech Communication and Technology,
pages 1691&#8211;1694.
</p>
<p>YOUNG, S. (1994). The HTK Hidden Markov Model Toolkit : Design and Philosophy. Entropic
Cambridge Research Laboratory, Ltd, 2:2&#8211;44.
</p>
<p>10</p>

</div></div>
</body></html>