<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Grew : un outil de r&#233;&#233;criture de graphes pour le TAL</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 5: D&#233;monstrations, pages 1&#8211;2,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Grew : un outil de r&#233;&#233;criture de graphes pour le TAL
</p>
<p>Bruno Guillaume1, 2 Guillame Bonfante1, 3 Paul Masson
Mathieu Morey4,5 Guy Perrier1, 3
</p>
<p>(1) LORIA - Campus Scientifique - BP 239 - 54506 Vand&#339;uvre-l&#232;s-Nancy cedex
(2) INRIA Grand Est - 615, rue du Jardin Botanique - 54600 Villers-l&#232;s-Nancy
</p>
<p>(3) Universit&#233; de Lorraine - 34, cours L&#233;opold - CS 25233 - 54502 Nancy cedex
(4) Laboratoire Parole et Langage, Aix-Marseille Universit&#233;
</p>
<p>(5) Linguistics and Multilingual Studies, Nanyang Technological University
</p>
<p>R&#201;SUM&#201;
Nous pr&#233;sentons un outil de r&#233;&#233;criture de graphes qui a &#233;t&#233; con&#231;u sp&#233;cifiquement pour des
applications au TAL. Il permet de d&#233;crire des graphes dont les n&#339;uds contiennent des structures
de traits et dont les arcs d&#233;crivent des relations entre ces n&#339;uds. Nous pr&#233;sentons ici la r&#233;&#233;criture
de graphes que l&#8217;on consid&#232;re, l&#8217;implantation existante et quelques exp&#233;rimentations.
</p>
<p>ABSTRACT
Grew: a Graph Rewriting Tool for NLP
</p>
<p>We present a Graph Rewriting Tool dedicated to NLP applications. Graph nodes contain fea-
ture structures and edges describe relations between nodes. We explain the Graph Rewriting
framework we use, the implemented system and some experiments.
</p>
<p>MOTS-CL&#201;S : r&#233;&#233;criture de graphes, interface syntaxe-s&#233;mantique.
</p>
<p>KEYWORDS: graph rewriting, syntax-semantics interface.
</p>
<p>1 R&#233;&#233;criture de graphes
</p>
<p>M&#234;me si la structure d&#8217;arbre est mise en avant pour les mod&#233;lisations linguistiques, elle est
souvent insuffisante, notamment pour les repr&#233;sentations s&#233;mantiques. M&#234;me en syntaxe, autour
d&#8217;une structure d&#8217;arbre, des m&#233;canismes comme la coindexation ou les structures de traits
r&#233;entrantes font appara&#238;tre des structures de graphes. Partant de ces observations, pour avoir
un cadre unique d&#8217;&#233;tude, nous avons pris le parti de consid&#233;rer toutes ces structures comme des
graphes. &#201;videmment, un cadre naturel pour d&#233;crire les calculs et les transformations sur les
graphes est la r&#233;&#233;criture de graphes. En effet, la r&#233;&#233;criture est un mod&#232;le de calcul qui permet de
d&#233;crire n&#8217;importe quelle transformation ; c&#8217;est &#233;galement un domaine tr&#232;s actif en informatique
th&#233;orique et de nombreux r&#233;sultats de confluence ou de terminaison existent.
</p>
<p>Par rapport &#224; la r&#233;&#233;criture de mots ou de termes, la r&#233;&#233;criture de graphes est plus d&#233;licate et il
n&#8217;existe pas de d&#233;finition canonique de cette r&#233;&#233;criture. Les travaux th&#233;oriques, utilisant la th&#233;orie
des cat&#233;gories, d&#233;crivent deux types de r&#233;&#233;criture (SPO et DPO) ; cependant ces d&#233;finitions,
math&#233;matiquement &#233;l&#233;gantes, sont peu pratiques pour &#233;crire effectivement des r&#232;gles. Nous
avons donc utilis&#233; une autre pr&#233;sentation qui d&#233;crit explicitement les transformations &#224; appliquer
au graphe &#224; l&#8217;aide d&#8217;une suite d&#8217;actions &#233;l&#233;mentaires.
</p>
<p>1</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 le logiciel Grew
</p>
<p>Nous donnons quelques d&#233;tails et particularit&#233;s de notre syst&#232;me ci-dessous. Plus d&#8217;informations
dont disponibles sur le site grew.loria.fr.
</p>
<p>Graphes. Les graphes que nous consid&#233;rons sont compos&#233;s d&#8217;un ensemble de n&#339;uds qui
contiennent des structures de traits non r&#233;cursives et d&#8217;un ensemble d&#8217;arcs &#233;tiquet&#233;s.
Ces arcs codent en fait des relations, ils v&#233;rifient donc toujours la contrainte qu&#8217;il n&#8217;y peut
pas y avoir deux arcs avec la m&#234;me &#233;tiquette, la m&#234;me source et le m&#234;me but. Dans les
exp&#233;rimentations, les relations utilis&#233;es sont des d&#233;pendances mais le syst&#232;me permet d&#8217;ex-
primer n&#8217;importe quel type de relations (comme la dominance dans un arbre syntagmatique
par exemple).
</p>
<p>R&#232;gles. Pour manipuler les graphes, nous utilisons des r&#232;gles de r&#233;&#233;criture. Une r&#232;gle de r&#233;&#233;cri-
ture est d&#233;finie en trois parties : un patron positif qui est un graphe qu&#8217;on va chercher &#224;
apparier avec une partie du graphe &#224; r&#233;&#233;crire ; un ensemble &#233;ventuellement vide de patrons
n&#233;gatifs qui peuvent bloquer l&#8217;application de la r&#232;gle ; une liste de commandes qui d&#233;crivent
les transformations &#224; apporter au graphe. Les commandes permettent d&#8217;ajouter, de modifier
ou de supprimer des traits, des n&#339;uds ou des arcs.
</p>
<p>Modules. Dans les applications, le nombre de r&#232;gles &#224; consid&#233;rer peut &#234;tre grand (plusieurs
centaines). Pour contr&#244;ler le comportement global du calcul et pour faciliter le d&#233;veloppe-
ment et la maintenance d&#8217;un syst&#232;me, les r&#232;gles sont r&#233;parties dans diff&#233;rents modules. &#192;
l&#8217;int&#233;rieur d&#8217;un module, les r&#232;gles ne sont pas ordonn&#233;es et tous les r&#233;sultats sont calcul&#233;s.
En revanche, les modules sont ordonn&#233;s et la r&#233;&#233;criture de l&#8217;ensemble du syst&#232;me se fait en
appliquant chaque module sur l&#8217;ensemble des r&#233;sultats du module pr&#233;c&#233;dent. Un syst&#232;me
de r&#232;gles organis&#233;es en modules s&#8217;appelle un GRS (pour Graph Rewriting System).
</p>
<p>Interfaces utilisateurs. Le logiciel GREW permet de d&#233;finir un GRS et de l&#8217;appliquer &#224; des
graphes. D&#8217;une part, une interface graphique permet de visualiser le d&#233;tail d&#8217;une r&#233;&#233;criture :
il est possible de visualiser l&#8217;ensemble des &#233;tapes de la r&#233;&#233;criture, r&#232;gle par r&#232;gle. D&#8217;autre
part, il est possible d&#8217;appliquer un GRS sur un ensemble de graphes (&#233;ventuellement sur un
cluster de calcul) et d&#8217;obtenir des statistiques sur l&#8217;ambigu&#239;t&#233; du calcul et sur les fr&#233;quences
d&#8217;utilisation des r&#232;gles ou des modules.
</p>
<p>Notre syst&#232;me a &#233;t&#233; exp&#233;riment&#233; (Guillaume et Perrier, 2012) sur des donn&#233;es de tailles r&#233;elles :
r&#233;&#233;criture de 12 000 graphes &#224; l&#8217;aide d&#8217;un syst&#232;me de 34 modules contenants plus de 400 r&#232;gles.
Parmi des fonctionnalit&#233;s r&#233;centes, on peut noter la possibilit&#233; de param&#233;trer les r&#232;gles avec des
informations lexicales et l&#8217;ajout un nouveau type de r&#232;gles qui filtrent les r&#233;sultats d&#8217;un module
pour ne garder que ceux qui respectent certains motifs. Ces deux nouveaut&#233;s permettent de
mieux factoriser les r&#232;gles et donc facilitent le d&#233;veloppement de plus grands syst&#232;mes de r&#232;gles.
</p>
<p>R&#233;f&#233;rences
</p>
<p>GUILLAUME, B. et PERRIER, G. (2012). Annotation s&#233;mantique du French Treebank &#224; l&#8217;aide de la
r&#233;&#233;criture modulaire de graphes. In Actes de TALN 2012 (Traitement automatique des langues
naturelles), Grenoble. ATALA.
</p>
<p>2</p>

</div></div>
</body></html>