<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La longueur des tours de parole comme crit&#232;re de s&#233;lection de conversations dans un centre d&#8217;appels</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 551&#8211;558,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>La longueur des tours de parole comme crit&#232;re de 
s&#233;lection de conversations dans un centre d&#8217;appels 
</p>
<p>Philippe Suignard1 Frederik Cailliau2  Ariane Cavet2 
(1) EDF R&amp;D, 1, avenue du G&#233;n&#233;ral de Gaulle, 92141, Clamart 
</p>
<p>(2) Sinequa, 12 rue d&#8217;Ath&#232;nes, 75009 Paris 
Philippe.Suignard@edf.fr, cailliau@sinequa.com, cavet@sinequa.com 
</p>
<p>RESUME ____________________________________________________________________________________________________________   
Cet article s&#8217;int&#233;resse aux conversations t&#233;l&#233;phoniques d&#8217;un Centre d&#8217;Appels EDF, 
automatiquement d&#233;coup&#233;es en &#171; tours de parole &#187; et automatiquement transcrites. Il fait 
appara&#238;tre une relation entre la longueur des tours de parole et leur contenu, en ce qui 
concerne le vocabulaire qui les compose et les sentiments qui y sont v&#233;hicul&#233;s. Apr&#232;s avoir 
montr&#233; qu&#8217;il y a un int&#233;r&#234;t &#224; &#233;tudier ces longs tours, l&#8217;article analyse leur contenu et liste 
quelques exemples autour des notions d&#8217;argumentation et de r&#233;clamation. Il montre ainsi 
que la longueur des tours de parole peut &#234;tre un crit&#232;re utile de s&#233;lection de conversations. 
ABSTRACT _________________________________________________________________________________________________________  
Turn-taking length as criterion to select call center conversations 
This article focuses on telephone conversations collected in an EDF Call Center, 
automatically segmented in &#8220;turn-taking&#8221; and automatically transcribed. It shows a 
relationship between the length of the turns and their content regarding the vocabulary and 
the feelings that are conveyed. After showing that there is an interest in studying these long 
turns, the article analyzes their content and lists some examples around the notions of 
argumentation and claim. It shows that the length of turns can be a useful criterion for 
selecting conversations. 
MOTS-CLES : Centre d&#8217;appels, Conversation, Tour de parole, Reconnaissance de Parole. 
KEYWORDS : Call Center, Conversation, Turn Taking, Automatic Speech Recognition. 
</p>
<p>1 Introduction 
Avec plus de 30 millions de clients et plusieurs milliers de conseillers en ligne, les Centres 
d&#8217;Appels constituent, pour EDF, un maillon important de la Gestion de la Relation Client et  
font l&#8217;objet d&#8217;un suivi permanent avec un focus sur la &#171; professionnalisation des 
conseillers &#187;, consistant &#224; am&#233;liorer leur pratique professionnelle afin de toujours mieux 
r&#233;pondre aux clients. Cette am&#233;lioration passant par des analyses qualitatives, seul un 
faible pourcentage peut &#234;tre retenu pour &#233;coute, d&#8217;o&#249; l&#8217;importance des crit&#232;res de s&#233;lection. 
C&#8217;est dans cet esprit qu&#8217;EDF R&amp;D a particip&#233; aux projets Infom@gic/Callsurf et Voxfactory. 
Le projet Callsurf (Garnier et al., 2008 ; Bozzi et al., 2009) consistait &#224; enregistrer et 
transcrire automatiquement les conversations entre clients et conseillers, pour ensuite les 
analyser. Le projet Voxfactory y ajoute la d&#233;tection automatique de l&#8217;&#233;motion v&#233;hicul&#233;e, &#224; 
partir du texte (Cailliau et Cavet, 2010), et par le signal (Devillers et al., 2010). 
Cet article s&#8217;int&#233;resse &#224; la notion de &#171; tours de parole &#187; (Sacks et al., 1974) et &#224; leur longueur 
mesur&#233;e en seconde, une information qui ne semble pas encore avoir fait l&#8217;objet d&#8217;&#233;tude, 
</p>
<p>551</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>contrairement &#224; la longueur des phrases, en nombre de mots, dans des donn&#233;es textuelles 
plus conventionnelles comme l&#8217;&#233;tude du th&#233;&#226;tre du XVIIe si&#232;cle par (Labb&#233; et Labb&#233;, 2010). 
La suite de l&#8217;article s&#8217;int&#233;resse &#224; la relation entre la longueur des tours de parole et le 
vocabulaire qui les compose, ainsi qu&#8217;&#224; la relation entre la longueur de ces tours et les 
sentiments qu&#8217;ils v&#233;hiculent. Elle montre que lorsque la longueur du tour a tendance &#224; 
augmenter, les informations trouv&#233;es semblent plus charg&#233;es &#233;motionnellement et le 
vocabulaire employ&#233; a tendance &#224; devenir plus pertinent d&#8217;un point de vue m&#233;tier. 
La partie 2 pr&#233;sente la notion de tour de parole et la partie 3 pr&#233;sente le corpus. La partie 4 
s&#8217;int&#233;resse &#224; la relation entre longueur du tour de parole et vocabulaire, tandis que la partie 
5 d&#233;crit la relation entre longueur et sentiment. La derni&#232;re partie analyse leur contenu et 
liste quelques exemples autour des notions d&#8217;argumentation et de r&#233;clamation. 
</p>
<p>2 Notion de tour de parole 
La notion de &#171; tour de parole &#187; (TDP) correspond &#224; la prise de parole par un locuteur et 
d&#233;signe le temps pendant lequel il garde cette parole. Au final, la suite ordonn&#233;e des TDP va 
constituer une conversation (Vincent, 2002). Le tour de parole semble donc &#234;tre une notion 
assez simple, mais bien que beaucoup utilis&#233; en &#171; analyse conversationnelle &#187;, il reste sujet 
&#224; interpr&#233;tation et beaucoup d&#8217;interrogations &#224; son sujet subsistent. Diff&#233;rents travaux se 
demandent encore &#171; Qu&#8217;est-ce que vraiment un TDP ? &#187; (Laforest, 2011). 
Sur la figure 1, l&#8217;exemple (1) semble pr&#233;senter trois TDP, mais l&#8217;intervention de &#171; l&#8217;agent &#187; 
n&#8217;est qu&#8217;un simple &#171; back-channel &#187; pour manifester son attention au client. En analyse 
conversationnelle, on pourrait regrouper ces trois tours en un seul et les consid&#233;rer comme 
&#233;tant une seule unit&#233;. Dans l&#8217;exemple (2), le client a du mal &#224; trouver le nom d&#8217;un terme 
m&#233;tier, que lui souffle l&#8217;agent. Ici aussi on peut consid&#233;rer qu&#8217;il s&#8217;agit d&#8217;un seul tour de 
parole et qu&#8217;il est co-construit par les deux locuteurs. 
(1) Client : &#171; &#8230; oui, je vous appelle&#8230; &#187; 
 Agent : &#171; oui &#187; 
 Client &#171; &#8230; pour un probl&#232;me&#8230; &#187; 
</p>
<p>(2) Client : &#171; &#8230; et quand je vais la recevoir, la &#8230; &#187; 
 Agent : &#171; la facture rectificative ? &#187; 
</p>
<p>FIGURE 1 - Deux exemples de tours de parole 
Sans vouloir &#233;luder la difficult&#233; de d&#233;finir pr&#233;cis&#233;ment ce &#171; tour de parole &#187;, nous nous en 
affranchissons un peu dans cette &#233;tude, dans la mesure o&#249; nous nous int&#233;ressons &#224; des 
conversations automatiquement d&#233;coup&#233;es en TDP par un segmenteur et retranscrites par 
un proc&#233;d&#233; de transcription automatique de la parole (Adda et al., 2011). Au final, le 
d&#233;coupage en TDP est imparfait mais refl&#232;te la r&#233;alit&#233; des conversations (r&#233;p&#233;titions, 
disfluences, parole superpos&#233;e, etc.) ainsi que les conditions d&#8217;enregistrement (voix sur un 
seul canal, bruit de fond, t&#233;l&#233;phone portable, etc.). 
Plusieurs raisons peuvent expliquer la variation de longueur des TDP : un client peut 
monopoliser la parole pour exprimer un probl&#232;me, une r&#233;clamation, une insatisfaction, 
etc., mais un conseiller peut &#233;galement monopoliser la parole et prendre du temps pour 
r&#233;pondre au client (parce qu&#8217;un probl&#232;me peut &#234;tre compliqu&#233; &#224; r&#233;soudre par exemple). 
Enfin, une discussion peut aussi contenir des passages &#171; serr&#233;s &#187; ou &#171; tendus &#187; (&#233;nervements, 
&#233;motions&#8230;), ce qui peut emp&#234;cher le segmenteur de d&#233;tecter le changement 
</p>
<p>552</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;interlocuteur. D&#8217;un certain point de vue, cela peut &#234;tre consid&#233;r&#233; comme un point faible 
du syst&#232;me, mais de l&#8217;autre c&#8217;est &#233;galement un marqueur du fait qu&#8217;il se passe quelque 
chose de particulier et qu&#8217;il s&#8217;agit donc d&#8217;un ph&#233;nom&#232;ne int&#233;ressant &#224; &#233;tudier. 
</p>
<p>3 Pr&#233;sentation du corpus 
Pour r&#233;aliser notre &#233;tude, un corpus de conversations t&#233;l&#233;phoniques a &#233;t&#233; enregistr&#233; dans le 
Centre d&#8217;Appels Bleu Ciel d&#8217;Aix-en-Provence. Les enregistrements ont eu lieu entre janvier 
et f&#233;vrier 2010, aupr&#232;s d&#8217;une quinzaine de conseillers volontaires. Comme la plupart des 
enregistreurs du march&#233;, l&#8217;enregistreur de conversation utilis&#233; est mono-canal, ce qui 
signifie que les deux signaux de parole du client et du conseiller se superposent quand ils 
parlent en m&#234;me temps. Une fois enregistr&#233;s, les appels font l&#8217;objet d&#8217;une s&#233;rie de 
traitements. D&#8217;abord intervient le &#171; segmenteur &#187;, qui a pour but de s&#233;parer le signal en 
segments qui, id&#233;alement, correspondent aux tours de parole du client et du conseiller. 
Ensuite, les TDP sont transcrits par un processus de transcription automatique (avec un 
taux d&#8217;erreur d&#8217;environ 30 %). 
Au total, ce corpus est constitu&#233; de 8 551 conversations, compos&#233;es de 800 596 tours de 
parole. La dur&#233;e moyenne d&#8217;un TDP est de 3,7 s, le plus long dure plus de 2 min. La 
r&#233;partition du nombre de tours en fonction de leur dur&#233;e est pr&#233;sent&#233;e en figure 2 (&#233;chelle 
lin&#233;aire &#224; gauche et logarithmique &#224; droite) : 
 
 
 
 
 
 
 
 
</p>
<p>FIGURE 2 - Distribution des tours de parole en fonction de leur dur&#233;e 
Ces courbes montrent que la tr&#232;s grande majorit&#233; des TDP dure moins de 10 s et que leur 
nombre chute fortement en fonction de la dur&#233;e. N&#233;anmoins, il y a quand m&#234;me des tours 
longs, voire tr&#232;s longs. Si l&#8217;on consid&#232;re les TDP dont la dur&#233;e est sup&#233;rieure &#224; 20 s, il n&#8217;y en 
a &#171; que &#187; 1,2 % en nombre mais 9 % en dur&#233;e. Pour un seuil de 40 s, on en trouve 0,12 % en 
nombre et 1,7% en dur&#233;e.  
Quand on regarde ces donn&#233;es au niveau des conversations, on s&#8217;aper&#231;oit que le nombre de 
conversations ayant au moins un tour de plus de 20 s est de 3 904 soit 45 % et que le 
nombre de conversations ayant au moins un tour de plus de 40 s est de 674 soit 7,9 %. En 
conclusion, on peut dire que les longs TDP sont peu fr&#233;quents par rapport &#224; l&#8217;ensemble des 
TDP, mais non n&#233;gligeables si on prend en compte leur dur&#233;e totale. 
</p>
<p>0
</p>
<p>50000
</p>
<p>100000
</p>
<p>150000
</p>
<p>200000
</p>
<p>250000
</p>
<p>0 10 20 30 40 50 60
</p>
<p>N
o
</p>
<p>m
b
</p>
<p>re
 d
</p>
<p>e
 t
</p>
<p>o
u
</p>
<p>rs
</p>
<p>Dur&#233;e des tours en seconde
</p>
<p>R&#233;partition des tours 
&#233;chelle lin&#233;aire
</p>
<p>1
</p>
<p>10
</p>
<p>100
</p>
<p>1000
</p>
<p>10000
</p>
<p>100000
</p>
<p>1000000
</p>
<p>0 10 20 30 40 50 60
</p>
<p>Dur&#233;e des tours en seconde
</p>
<p>R&#233;partition des tours 
&#233;chelle logarithmique
</p>
<p>553</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Longueur des tours et vocabulaire : une relation ? 
De mani&#232;re assez intuitive, les TDP tr&#232;s courts semblent peu porteurs d&#8217;information. Dans 
ceux-ci, on trouvera beaucoup de : &#171; oui &#187;, &#171; non &#187;, &#171; EDF bleu ciel bonjour &#187;, etc. Par contre, 
dans des TDP plus longs, une conversation peut s&#8217;installer, le client peut pr&#233;senter la raison 
de son appel, le conseiller va r&#233;pondre &#224; sa probl&#233;matique, faire des propositions, etc. La 
question qu&#8217;on se pose ici peut se r&#233;sumer de la mani&#232;re suivante : &#171; Est-ce que l&#8217;on parle 
des m&#234;mes choses dans les tours longs que dans les autres ? &#187; 
Pour r&#233;pondre &#224; cette question, la m&#233;thode va &#234;tre la suivante. Pour une dur&#233;e d donn&#233;e, on 
va constituer deux corpus : Tinf(d), le corpus constitu&#233; des TDP dont la dur&#233;e est inf&#233;rieure &#224; 
d et Tsup(d), le corpus constitu&#233; des TDP dont la dur&#233;e est sup&#233;rieure &#224; d. Puis, nous calculons 
la distance entre ces deux corpus comme d&#233;crit dans (Labb&#233; et Labb&#233;, 2003) : 
</p>
<p>&#55349;&#56401;&#55349;&#56406;&#55349;&#56416;&#55349;&#56417; &#55349;&#56401; =   &#55349;&#56403; &#55349;&#56410;, &#55349;&#56391;&#55349;&#56406;&#55349;&#56411;&#55349;&#56403; (&#55349;&#56401;) &#8722; &#55349;&#56403; &#55349;&#56410;, &#55349;&#56391;&#55349;&#56416;&#55349;&#56418;&#55349;&#56413; (&#55349;&#56401;)  
</p>
<p>m &#8712; Tinf(d) &#8746; Tsup(d)
</p>
<p>  &#55349;&#56402;&#55349;&#56417;  &#55349;&#56403; &#55349;&#56410;, &#55349;&#56391; &#55349;&#56401;  =
&#55349;&#56412;&#55349;&#56400;&#55349;&#56400;(&#55349;&#56410;,&#55349;&#56391; &#55349;&#56401; )
</p>
<p> &#55349;&#56391;(&#55349;&#56401;) 
 
</p>
<p>Avec f m, T d   la fr&#233;quence du mot m  dans le corpus T d , &#55349;&#56412;&#55349;&#56400;&#55349;&#56400;(&#55349;&#56410;, &#55349;&#56391; &#55349;&#56401; ) , le nombre 
d&#8217;occurrences du mot &#55349;&#56410;  dans le corpus &#55349;&#56391;(&#55349;&#56401;)  et  &#55349;&#56391;(&#55349;&#56401;) , le nombre total de mots dans le 
corpus &#55349;&#56391;(&#55349;&#56401;). Pour le calcul des mots &#55349;&#56410;, deux alternatives sont retenues : les unigrammes et 
les bigrammes &#233;tendus. 
Pour les unigrammes, on constitue la liste de tous les mots du corpus sauf ceux faisant 
partie d&#8217;une &#171; stop liste &#187;, comme &#171; le &#187;, &#171; la &#187;, &#171; les &#187;, etc. Pour les bigrammes &#233;tendus, on 
constitue la liste de toutes les suites de deux mots dont aucun des deux n&#8217;appartient &#224; la &#171; 
stop liste &#187; et de toutes les suites de trois mots compos&#233;es d&#8217;une pr&#233;position au milieu et 
dont les deux mots extr&#233;mit&#233;s sont absents de la &#171; stop liste &#187;. On d&#233;tecte ainsi les 
bigrammes comme &#171; heures pleines &#187;, &#171; relev&#233; de compteur &#187;, &#171; pompe &#224; chaleur &#187;, etc. 
</p>
<p> 
FIGURE 3 &#8211; Distance entre corpus inf&#233;rieur et sup&#233;rieur &#224; une certaine dur&#233;e 
</p>
<p>La figure 3 montre que les deux courbes de distance (pour les unigrammes et les 
bigrammes) ont globalement la m&#234;me allure. Quand le seuil de s&#233;paration entre les deux 
corpus est tr&#232;s petit, la distance entre les deux corpus est &#233;lev&#233;e ce qui semble normal, 
puisque dans les tours les plus courts, on trouve les &#171; oui &#187;, &#171; non &#187;, &#171; bonjour &#187;, etc. Ensuite 
cette distance d&#233;cro&#238;t pour atteindre un minimum situ&#233; entre 10 s et 20 s. Puis l&#8217;&#233;cart croit 
</p>
<p>0,000
</p>
<p>0,100
</p>
<p>0,200
</p>
<p>0,300
</p>
<p>0,400
</p>
<p>0,500
</p>
<p>0,600
</p>
<p>0,700
</p>
<p>0,800
</p>
<p>0,900
</p>
<p>0 10 20 30 40 50 60 70 80
</p>
<p>D
is
</p>
<p>ta
n
</p>
<p>ce
</p>
<p>Seuil en seconde 
</p>
<p>Distance entre corpus inf et corpus sup
</p>
<p>Bigrammes
</p>
<p>Unigrammes
</p>
<p>554</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de nouveau.  
Ce graphique montre qu&#8217;il y a bien une relation entre la longueur des TDP et le vocabulaire 
de ceux-ci. C&#8217;est vers 15 s que se situe une sorte d&#8217;&#233;quilibre, c'est-&#224;-dire que c&#8217;est pour un 
seuil de 15 s que le corpus des TDP inf&#233;rieurs &#224; cette dur&#233;e ressemble le plus au corpus des 
TDP sup&#233;rieurs &#224; cette dur&#233;e. Cela justifie &#233;galement l&#8217;id&#233;e d&#8217;aller &#233;tudier les tours ayant 
une dur&#233;e sup&#233;rieure &#224; 20 s pour y trouver des particularit&#233;s ou sp&#233;cificit&#233;s de vocabulaire. 
</p>
<p>5 Longueur des tours et sentiment : une relation ? 
5.1 Trouver du sentiment dans un tour de parole 
Notre analyse du sentiment est faite en trois phases : d&#233;tection et normalisation des 
expressions, calcul d&#8217;un poids positif et n&#233;gatif pour chaque tour de parole et calcul des 
zones positif et n&#233;gatif. Les deux premi&#232;res phases sont d&#233;taill&#233;es dans (Cailliau et Cavet, 
2010) et seront bri&#232;vement rappel&#233;es ici.  
Nous appliquons tout d&#8217;abord un ensemble de grammaires faites manuellement &#224; partir 
d&#8217;une fouille approfondie du corpus. Elles d&#233;tectent les mots et expressions porteurs de 
sentiment dans le cadre typique de la conversation t&#233;l&#233;phonique pour un total de 30 types 
d&#8217;entit&#233;s. A chaque type nous avons attribu&#233; un poids d&#233;termin&#233; de fa&#231;on empirique, ainsi 
qu&#8217;une orientation positive, n&#233;gative ou neutre. Ensuite chaque tour de parole obtient un 
score de polarit&#233; positif et un score de polarit&#233; n&#233;gatif correspondant &#224; la somme des poids 
des entit&#233;s rep&#233;r&#233;es dans le tour. Les poids des extractions neutres sont ajout&#233;s au plus haut 
score positif ou n&#233;gatif. L&#8217;exemple suivant d&#8217;un tour de parole contient plusieurs entit&#233;s, 
avec le calcul des poids positif et n&#233;gatif, illustr&#233; en figure 4. 
&#171; Oui oui mais il non mais c&#8217;est &#231;a OK tant mieux ailleurs parce que sinon &#231;a serait dur &#224; sortir &#187; 
</p>
<p>Extraction Classe et sous-classe Poids positif Poids n&#233;gatif 
OK Acceptation &#8211; Refus : acceptation 2 - 
tant mieux Appr&#233;ciation : favorable (&#233;motif) 4 - 
sinon Accord &#8211; D&#233;saccord : rectificatif - 1 
dur Appr&#233;ciation : d&#233;favorable (&#233;motif) - 4 
Poids total du TDP  6 5 
</p>
<p>FIGURE 4 &#8211; Poids des entit&#233;s rep&#233;r&#233;es dans le tour de parole 
</p>
<p>5.2 Du tour de parole au passage 
Comme le montrent ind&#233;pendamment (Cailliau et Cavet, 2010) et (Danesi et Clavel, 2010), 
le taux d&#8217;erreur de la transcription automatique d&#8217;environ 30 % impacte directement les 
extractions. Pour minimiser cet impact, nous privil&#233;gions le passage au TDP, en partant du 
principe qu&#8217;un TDP sentimentalement marqu&#233; appara&#238;t rarement isol&#233;. Pour ce faire, nous 
avons mis en place un lissage par une fen&#234;tre coulissante de 5 tours de parole. 
Un algorithme de zonage nous permet de transformer la courbe en zones neutre (  ), 
positive (  ), n&#233;gative (  ), et tr&#232;s n&#233;gative (  ). Les seuils ont &#233;t&#233; d&#233;finis de fa&#231;on 
empirique et la barre color&#233;e est obtenue par projection des zones sur l&#8217;&#233;chelle temporelle. 
</p>
<p>555</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La figure 5 pr&#233;sente les courbes positive et n&#233;gative obtenues sur une conversation apr&#232;s 
lissage sur l&#8217;&#233;chelle du tour de parole et sur l&#8217;&#233;chelle de temps, avec la barre color&#233;e 
correspondante. Le pic n&#233;gatif apparaissant au d&#233;but de la conversation occupe 
relativement peu de tours de parole (17 TDP sur 55, soit 30,9 %), mais il occupe beaucoup 
de temps sur la conversation (environ 300 s sur 590 s, soit 50,8 %). 
</p>
<p> 
 
 
 
 
</p>
<p>FIGURE 5 &#8211; Courbes positive et n&#233;gative d&#8217;une conversation et zones correspondantes 
</p>
<p>5.3 Longueur des tours de parole et couleur associ&#233;e 
Si on conserve les seuils de 20 s et 40 s utilis&#233;s en partie 3, on constate, en figure 6, que les 
TDP courts apparaissent tr&#232;s majoritairement dans des zones non marqu&#233;es (95 %). Le 
nombre de TDP dans des zones non neutres augmente fortement avec la longueur de ces 
TDP, au d&#233;triment du non marqu&#233;. Les TDP longs contiennent donc g&#233;n&#233;ralement plus 
d&#8217;expressions &#233;motionnelles que les TDP courts. Ces r&#233;sultats ne sont pas si surprenants : 
notre m&#233;thode de calcul privil&#233;gie les TDP plus longs car nous utilisons la somme des poids 
des entit&#233;s extraites pour calculer les poids positif et n&#233;gatif des TDP. On remarque 
&#233;galement qu&#8217;il ne suffit pas d&#8217;avoir un TDP long pour avoir du sentiment : 45 % d&#8217;entre 
eux sont neutres, et moins de 8 % sont marqu&#233;s comme &#171; tr&#232;s n&#233;gatifs &#187;.  
</p>
<p>Dur&#233;e des TDP Neutre Positif N&#233;gatif Tr&#232;s n&#233;gatif 
&lt;20 s 95,3 % 3,0 % 1,6 % 0,1 % 100 % 
entre 20 s et 40 s 74,8 % 13,1 % 10,4 % 1,7 % 100 % 
&gt;40 s 45,0 % 25,5 % 21,6 % 7,8 % 100 % 
</p>
<p>FIGURE 6 &#8211; Longueur des TDP et &#233;motion d&#233;tect&#233;e 
</p>
<p>6 Trouver la sp&#233;cificit&#233; de vocabulaire par r&#233;gression lin&#233;aire 
Les deux parties pr&#233;c&#233;dentes ont permis de montrer qu&#8217;il y avait une sp&#233;cificit&#233; des longs 
TDP par rapport aux autres : ils sont plus &#171; charg&#233;s &#187; en &#233;motion et ont une sp&#233;cificit&#233; en 
termes de vocabulaire. Dans cette partie, nous appliquons une m&#233;thode bas&#233;e sur la 
fr&#233;quence des mots pour identifier lesquels sont &#224; l&#8217;origine de cette sp&#233;cificit&#233;.  
</p>
<p>0
3
6
9
</p>
<p>12
</p>
<p>1 3 5 7 9 11 13 15 17 19 21 23 25 27 29 31 33 35 37 39 41 43 45 47 49 51 53 55
</p>
<p>S
c
</p>
<p>o
re
</p>
<p> d
e
</p>
<p> 
p
</p>
<p>o
la
</p>
<p>ri
t&#233;
</p>
<p>Score positif Score n&#233;gatif
</p>
<p>0
3
6
9
</p>
<p>12
</p>
<p>1
1
</p>
<p>5
2
</p>
<p>9
4
</p>
<p>3
5
</p>
<p>7
7
</p>
<p>1
8
</p>
<p>5
9
</p>
<p>9
1
</p>
<p>1
3
</p>
<p>1
2
</p>
<p>7
1
</p>
<p>4
1
</p>
<p>1
5
</p>
<p>5
1
</p>
<p>6
9
</p>
<p>1
8
</p>
<p>3
1
</p>
<p>9
7
</p>
<p>2
1
</p>
<p>1
2
</p>
<p>2
5
</p>
<p>2
3
</p>
<p>9
2
</p>
<p>5
3
</p>
<p>2
6
</p>
<p>7
2
</p>
<p>8
1
</p>
<p>2
9
</p>
<p>5
3
</p>
<p>0
9
</p>
<p>3
2
</p>
<p>3
3
</p>
<p>3
7
</p>
<p>3
5
</p>
<p>1
3
</p>
<p>6
5
</p>
<p>3
7
</p>
<p>9
3
</p>
<p>9
3
</p>
<p>4
0
</p>
<p>7
4
</p>
<p>2
1
</p>
<p>4
3
</p>
<p>5
4
</p>
<p>4
9
</p>
<p>4
6
</p>
<p>3
4
</p>
<p>7
7
</p>
<p>4
9
</p>
<p>1
5
</p>
<p>0
5
</p>
<p>5
1
</p>
<p>9
5
</p>
<p>3
3
</p>
<p>5
4
</p>
<p>7
5
</p>
<p>6
1
</p>
<p>5
7
</p>
<p>5
5
</p>
<p>8
9
</p>
<p>S
c
</p>
<p>o
re
</p>
<p> d
e
</p>
<p> 
p
</p>
<p>o
la
</p>
<p>ri
t&#233;
</p>
<p>Temps en secondes
</p>
<p>Tour de parole 
</p>
<p>556</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>On commence par &#233;liminer les tours tr&#232;s courts (inf&#233;rieurs &#224; 10 s, parce que tr&#232;s nombreux 
et tr&#232;s peu porteurs d&#8217;informations) et tr&#232;s longs (sup&#233;rieurs &#224; 80 s, parce que tr&#232;s peu 
nombreux et pouvant donc perturber fortement les r&#233;sultats) pour constituer 7 sous-
corpus : T10-20, T20-30, T30-40, T40-50, T50-60, T60-70, T70-80, T10-20 &#233;tant le corpus constitu&#233; des TDP dont 
la dur&#233;e est comprise entre 10 s et 20 s. Pour chaque sous-corpus, on calcule les fr&#233;quences 
des mots. On pratique une r&#233;gression lin&#233;aire pour trouver les mots pour lesquels 
l&#8217;augmentation de fr&#233;quence est la plus forte. Une analyse des mots pr&#233;sentant la plus forte 
augmentation permet de discerner deux sph&#232;res : la sph&#232;re de l&#8217;argumentation et la sph&#232;re 
de la r&#233;clamation. 
La sph&#232;re de l&#8217;argumentation est caract&#233;ris&#233;e par une forte pr&#233;sence d&#8217;adverbes comme &#171; 
effectivement &#187;, &#171; exactement &#187;, &#171; normalement &#187;, &#171; maintenant &#187;, &#171; directement &#187; et &#171; 
justement &#187;. Cette pr&#233;sence des adverbes s&#8217;explique par le fait que les longs TDP ont 
tendance &#224; &#234;tre d&#8217;avantage consacr&#233;s aux probl&#232;mes les plus complexes et qu&#8217;ils donnent 
lieu &#224; des &#233;changes argument&#233;s &#224; la fois du c&#244;t&#233; du client pour expliquer son probl&#232;me mais 
&#233;galement du c&#244;t&#233; du conseiller pour justifier une r&#233;ponse. Voici quelques extraits : 
</p>
<p>Agent : &#171; Avant, vous &#233;tiez dans une p&#233;riode o&#249; effectivement le client pouvait 
</p>
<p>choisir&#8230; effectivement ses heures creuses&#8230; &#187; 
</p>
<p>Agent : &#171; L&#8217;intervention co&#251;tera xx &#8364;, somme que vous n&#8217;aurez pas &#224; payer, elle 
</p>
<p>sera pr&#233;lev&#233;e effectivement sur la facture&#8230; &#187; 
</p>
<p>Agent : &#171; Une somme de x &#8364;, effectivement ce n&#8217;est pas n&#233;gligeable&#8230; &#187; 
</p>
<p>Client : &#171; &#8230; je suis propri&#233;taire mais la la locataire a d&#251; elle avait 
</p>
<p>t&#233;l&#233;phon&#233; justement &#224; edf pour r&#233;silier le contrat et moi en fait c&#8217;est 
</p>
<p>quelqu&#8217;un qui a sign&#233; de le jour que j&#8217;ai emm&#233;nag&#233; et justement pour couper edf 
</p>
<p>j&#8217;avais dit que justement j&#8217;avais fait l&#8217;ouverture sur internet&#8230; &#187;  
</p>
<p>La seconde sph&#232;re est celle de la r&#233;clamation, caract&#233;ris&#233;e par la pr&#233;sence de mots comme 
&#171; probl&#232;me &#187;, &#171; r&#233;ponse &#187;, ou directement &#171; r&#233;clamation &#187;, comme par exemple : 
</p>
<p>Agent : &#171; &#8230; d&#8217;accord avec tous les points o&#249; il y a eu un probl&#232;me d&#8217;accord 
</p>
<p>d&#8217;accord donc j&#8217;ai j&#8217;ai bien not&#233; que vous souhaitiez une r&#233;ponse par &#233;crit. &#187; 
</p>
<p>Ces r&#233;clamations vont porter &#224; la fois sur des probl&#232;mes techniques et sur des probl&#232;mes 
relationnels. Concernant les aspects techniques, on trouve des mots comme : &#171; technicien &#187;, 
&#171; technique &#187;, &#171; raccordement &#187;, &#171; disjoncteur &#187;, &#171; &#233;nergie &#187;, &#171; chauffage &#187;, &#171; hiver &#187;, 
&#171; index &#187;, &#171; chantier &#187;, &#171; c&#226;ble &#187;, etc. Ces extraits, concernant l&#8217;installation ou le 
raccordement d&#8217;un nouveau compteur, peuvent donner lieu &#224; des passages assez longs. 
</p>
<p>Agent : &#171; &#8230; elle est divis&#233; en 2 parties l&#8217;installation donc le r&#233;seau edf qui 
</p>
<p>va jusqu&#8217;&#224; la partie haute du disjoncteur donc tout ce qui est compteur et 
</p>
<p>disjoncteur c est edf par contre&#8230; &#187; 
</p>
<p>Concernant les aspects relationnels, on trouve des mots comme : &#171; courrier &#187;, 
&#171; fournisseur &#187;, &#171; mail &#187;, &#171; r&#233;ponse &#187;, &#171; client &#187;, &#171; rendez-vous &#187;, &#171; montant &#187;, etc. 
</p>
<p>Client : &#171; &#8230; donc premi&#232;rement on a on a on a insist&#233; d&#8217;avoir un rendez de 
</p>
<p>rendez-vous t&#233;l&#233;phonique premi&#232;rement&#8230; mais quand m&#234;me bon alors on a attendu 2 
</p>
<p>semaines pour ce rendez-vous t&#233;l&#233;phonique le monsieur il m&#8217;a appel&#233;&#8230; &#187; 
</p>
<p>Client : &#171; &#8230; &#231;a suffit je vais faire une r&#233;clamation concernant le le rendez-
</p>
<p>vous qui n&#8217;a pas &#233;coutez je n&#8217;habite pas sur place &#8230; &#187; 
</p>
<p>Agent : &#171; &#8230; en attendant la r&#233;ponse de notre service national consommateurs&#8230; &#187; 
</p>
<p>557</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>7 Conclusion 
Comme les Centres d&#8217;Appels repr&#233;sentent un maillon important de la Gestion de la Relation 
Client pour EDF, l&#8217;am&#233;lioration continue de leur performance est un enjeu majeur. Cette 
am&#233;lioration passant par des analyses qualitatives, seul un faible pourcentage peut &#234;tre 
retenu pour &#233;coute, d&#8217;o&#249; l&#8217;importance des crit&#232;res de s&#233;lection. En s&#8217;appuyant sur un corpus 
de conversations enregistr&#233;es dans un Centre d&#8217;Appels EDF et transcrites automatiquement, 
nous avons montr&#233; une relation entre la longueur des tours de parole et leur contenu, &#224; 
travers le vocabulaire qui les compose et les sentiments qui y sont v&#233;hicul&#233;s. Par 
cons&#233;quent, la longueur des tours de parole est un crit&#232;re utile de s&#233;lection de 
conversations. Il peut s&#8217;ajouter de fa&#231;on compl&#233;mentaire aux autres strat&#233;gies de s&#233;lection 
que sont les mots cl&#233;s (nom d&#8217;offre, entreprise concurrente, etc.), les th&#233;matiques, les 
sentiments, etc.  
R&#233;f&#233;rences 
ADDA, G., CAILLIAU, F., DAQUO, A-L, GARNIER-RIZET, M., GUILLEMIN-LANNE, S., SUIGNARD, P. et 
WAAST-RICHARD, C. (2011). La transcription automatique et la fouille de donn&#233;es 
conversationnelles pour l'analyse de la relation client. In M. Campedel et P. Hoogsto&#235;l 
(Ed.), S&#233;mantique et multimodalit&#233; en analyse de l'information. Hermes Lavoisier, Paris. 
BOZZI, L., SUIGNARD, P., WAAST-RICHARD, C. (2009). Segmentation et classification non 
supervis&#233;e de conversations t&#233;l&#233;phoniques automatiquement retranscrites. In Actes de 
TALN, Senlis. 
CAILLIAU, F., et CAVET, A. (2010). Analyse des sentiments et transcription automatique : 
mod&#233;lisation du d&#233;roulement de conversations t&#233;l&#233;phonique. In TAL, 51-3, ATALA. 
DANESI, C. et CLAVEL, C. (2010). Impact of spontaneous speech features on business concept 
detection: a study of call-centre data. In Proc. of SSCS '10, ACM, New York, NY, USA. 
DEVILLERS, L., VAUDABLE, C et CHASTAGNOL, C. (2010). Real-life emotion-related states 
detection in call centers: a cross-corpora study. In INTERSPEECH-2010, pages 2350-2353. 
GARNIER-RIZET, M., ADDA, G., CAILLIAU, F., GUILLEMIN-LANNE, G. et WAAST-RICHARD, C. 
(2008). CallSurf - Automatic transcription, indexing and structuration of call center 
conversational speech for knowledge extraction and query by content. In Actes de LREC 
2008. Marrakech. 
LABBE, C. et LABBE, D. (2003). La distance intertextuelle. In Corpus, d&#233;cembre 2003, 
http://corpus.revues.org/index31.html [consult&#233; le 20/12/2011]. 
LABBE, C. et LABBE, D. (2010). Ce que disent leurs phrases. In Proceedings of 10th 
International Conference Statistical Analysis of Textual Data, Rome, Italie. 
LAFOREST, M. (2011). Trois petits tours et puis s&#8217;en vont ou qu&#8217;est-ce qu&#8217;un tour de parole ? 
In Langues et linguistique, num&#233;ro sp&#233;cial Journ&#233;es de linguistique, pages 34-42. 
SACKS, H., SCHEGLOFF, E.A. et JEFFERSON, G. (1974). A simplest systematics for the 
organization of turn-taking for conversation. In Language, 50 (4), pages 696-735. 
VINCENT, D. (2002). Les enjeux de l&#8217;analyse conversationnelle et les enjeux de la 
conversation. In Revue qu&#233;b&#233;coise de linguistique, 30-1, pages 177-198. 
</p>
<p>558</p>

</div></div>
</body></html>