<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>M&#233;thodologie d'exploration de corpus et de formalisation de r&#232;gles grammaticales pour les langues des signes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 375&#8211;382,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>M&#233;thodologie d'exploration de corpus et de formalisation de r&#232;gles grammaticales pour les langues des signes
Michael Filhol   Annelies Braffort
</p>
<p>LIMSI-CNRS, Campus d'Orsay bat 508, BP133, 91403 Orsay cx
michael.filhol@limsi.fr, annelies.braffort@limsi.fr
</p>
<p>R&#201;SUM&#201;_________________________________________________________________________
Cet article pr&#233;sente une m&#233;thodologie visant, &#224; partir d'une observation de corpus vid&#233;o 
de  langue  des  signes,  &#224;  rep&#233;rer  puis  formaliser  les  r&#233;gularit&#233;s  de  structure  dans  les 
constructions  linguistiques.  Cette  m&#233;thodologie  est  applicable  &#224;  tous  les  niveaux  du 
langage, du sub-lexical &#224; l'&#233;nonc&#233; complet. En s'appuyant sur deux exemples, il pr&#233;sente 
une  application  de  cette  m&#233;thodologie  ainsi  que  le  mod&#232;le  AZee  qui,  int&#233;grant  la 
souplesse  n&#233;cessaire  en  termes  de  synchronisation  des  articulateurs,  permet  une 
formalisation des r&#232;gles rep&#233;r&#233;es.
ABSTRACT_______________________________________________________________________
Methodology  for  corpus  exploration  and  grammatical  rule  building  in  Sign 
Language
This paper presents a methodology for Sign Language video observation to extract and 
then formalise observed linguistic structure. This methodology is relevant to all linguistic 
layers from sub-lexical to discourse as a whole. Relying on two examples, we apply this 
methodology and describe the AZee model, which integrates the required flexibility for 
synchronising  articulators,  hence  enables  a  specification  of  any new systematic  rule 
observed.
MOTS-CL&#201;S : Langue des signes, analyse de corpus, mod&#232;le grammatical, synchronisation.
KEYWORDS : .Sign Language, corpus analysis, grammatical models, synchronisation.
</p>
<p>1 Introduction
Notre  objectif  g&#233;n&#233;ral  est  de repr&#233;senter  de  mani&#232;re  formelle  le  fonctionnement  des 
Langues des Signes (LS),  ses &#233;l&#233;ments et ses r&#232;gles. Ces repr&#233;sentations doivent nous 
permettre de g&#233;n&#233;rer des &#233;nonc&#233;s et produire automatiquement des animations en LS via 
un signeur virtuel (personnage virtuel en 3d s'exprimant en LS), et &#224; terme d'envisager la 
traduction d'une langue &#233;crite vers la LS (Filhol, 2011).
Les  LS  sont  des  langues  peu  dot&#233;es,  dont  les  ressources  (dictionnaires,  livres  de 
grammaire, m&#233;thodes p&#233;dagogiques,  corpus...) sont tr&#232;s limit&#233;es. En France, la LSF n'est 
reconnue comme langue  &#224;  part  enti&#232;re  que  depuis  20051.  Les  quelques  descriptions 
existantes2 sont sommaires et nous avons pu observer pour certaines d'entre-elles qu'elles 
ne r&#233;sistent pas &#224; la v&#233;rification sur corpus. C'est pourquoi notre d&#233;marche comporte 
1Loi 2005-102
2La langue des signes, Histoire et grammaire, IVT (ed) 1998 ; La LSF mode d'emploi, M. Companys (ed) 2003.
</p>
<p>375</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>l'annotation et l'analyse d'un corpus de LS pour identifier des r&#233;gularit&#233;s de forme qui 
conduiront  &#224;  la  description  de  r&#232;gles  grammaticales.  Ensuite,  nous  &#233;laborons  des 
mod&#232;les formels permettant de repr&#233;senter ces r&#232;gles.
Cet article d&#233;crit tout d'abord la m&#233;thodologie employ&#233;e pour mettre en &#233;vidence les 
ph&#233;nom&#232;nes syst&#233;matiques d'une LS puis d&#233;crit le nouveau formalisme &#171; AZee &#187; propos&#233; 
pour les repr&#233;senter, en s'appuyant sur deux exemples.
</p>
<p>2 La conception des r&#232;gles
Cette section pr&#233;sente la m&#233;thodologie et le r&#233;sultat d'une &#233;tude multilingue sur les LS 
fran&#231;aise (LSF), grecque (GSL), anglaise (BSL) et allemande (DGS), r&#233;alis&#233;e pendant le 
projet  europ&#233;en  Dicta-Sign3.  Une structure  linguistique  identifi&#233;e  est  celle  que  nous 
nommons la structure de &#171;qualification/d&#233;signation&#187;. C'est un exemple repr&#233;sentatif du 
type de r&#232;gle &#224; repr&#233;senter.
</p>
<p>2.1 M&#233;thodologie : de la forme &#224; la fonction, et r&#233;ciproquement
Deux  approches  sont  possibles  pour  d&#233;terminer  une  r&#232;gle  syst&#233;matique  entre  une 
structure  ou  une  relation  s&#233;mantique  d'une  part,  et  une  production  de  surface 
(phon&#233;tique) d'autre part : soit &#224; partir de la fonction s&#233;mantique, soit &#224; partir de la 
forme de la surface. La structure pr&#233;sent&#233;e ici a &#233;t&#233; d&#233;couverte au moyen de la deuxi&#232;me 
approche, qui a comport&#233; trois &#233;tapes :
(1) Choix des occurrences &#224; collecter dans le corpus : Nous avons tout d'abord rep&#233;r&#233; un 
grand nombre d'occurrences o&#249; la posture de la main domin&#233;e &#233;tait maintenue pendant 
que les gestes de la main dominante continuait, sans que les deux mains ne soient en 
relation  pour  des  raisons  g&#233;om&#233;trique  ou  topologique  (comme  lorsque  la  main 
dominante pointe vers la main domin&#233;e). Ceci nous a conduit &#224; d&#233;finir le crit&#232;re de 
rep&#233;rage  de  ces  structures  de  forme,  nomm&#233;  &#171;persistance  ind&#233;pendante  de  la  main 
domin&#233;e &#187;, comme suit :
</p>
<p>Un signe bimanuel s0, suivi par un ou plusieurs signes monomanuels de la main  
dominante,  pendant  que  la  posture  finale  de  s0  est  maintenue  par  la  main  
domin&#233;e.
Main dominante : |__ s0 __|  |__ signes monomanuels s' __ _ _
Main domin&#233;e :    |__ s0 ___________ maintenue ________ _ _
</p>
<p>(2) De la forme &#224; la fonction en LSF : Dans la partie LSF du corpus, nous avons recueilli 
un minimum de 150 occurrences claires de la forme de la surface d&#233;crite en (1), et nous  
avons constat&#233; que toutes correspondaient &#224; l'une des deux cat&#233;gories ci-dessous: 
</p>
<p>a) Qualification/d&#233;nomination : La suite s' r&#233;alis&#233;e par la main dominante qualifie le 
signe s0 tel un adjectif, le nomme avec un &#171; nom-signe &#187; (nom propre en LS), ou 
encore &#233;pelle un mot (avec la dactylologie) pour l'identifier. Cela peut &#234;tre une 
combinaison de ces r&#233;alisations.
</p>
<p>b) Conservation de l'activation :  s0 est tenu par la main domin&#233;e parce qu'il est &#224; 
3http://www.dictasign.eu/
</p>
<p>376</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>nouveau n&#233;cessaire, apr&#232;s la s&#233;quence monomanuelle de la main dominante (s0 
est souvent r&#233;p&#233;t&#233; ensuite). Cela peut &#234;tre consid&#233;r&#233; comme une parenth&#232;se dans 
un discours, au cours de laquelle s0 doit &#234;tre conserv&#233; &#171; actif &#187;
</p>
<p>(3) De la fonction &#224; la forme en diff&#233;rentes LSs : L'&#233;tape suivante a &#233;t&#233; de commencer un 
processus de v&#233;rification multilingue sur les parties LSF, DGS et GSL (respectivement LS 
fran&#231;aise,  allemande  et  grecque)  du  corpus  Dicta-Sign.  Toutes  les  langues  ont  &#233;t&#233; 
fouill&#233;es  pour  trouver  des  occurrences  de  la  fonction  s&#233;mantique  de 
qualification/d&#233;nomination (2a) et les formes correspondantes observ&#233;es. Les LS ont &#233;t&#233; 
analys&#233;es ind&#233;pendamment par des experts de chaque LS et les r&#233;sultats nous ont permis 
de confirmer nos observations sur la LSF et de proposer la r&#232;gle suivante, commune aux 
trois LSs :
</p>
<p>Lorsque s0 est un signe bimanuel suivi par un ou plusieurs signes monomanuels  
de qualification ou de d&#233;nomination, la main domin&#233;e a tendance &#224; garder de  
mani&#232;re  ferme  la  derni&#232;re  posture  de  s0,  tandis  que  les  autres  signes  sont  
effectu&#233;s avec la main domin&#233;e.
</p>
<p>Dans  l'exemple  LSF  montr&#233;  figure  1,  il  s'agit  d'une  qualification  suivie  d'une 
d&#233;nomination d'une ligne de m&#233;tro sur un plan : le locuteur identifie la ligne jaune U3. 
La  main  domin&#233;e  garde  tr&#232;s  clairement  la  posture  finale  du  premier  signe  et  est 
maintenue fermement tout au long des  trois  signes suivants,  jusqu'&#224; ce que les deux 
mains soient rel&#226;ch&#233;es.
</p>
<p>FIGURE 1 &#8211; Combinaison des quatre signes LIGNE JAUNE U 3.
</p>
<p>2.2 Discussion
Ces premiers  r&#233;sultats  doivent  &#234;tre  affin&#233;s,  que ce soit  sur  les  formes associ&#233;es  &#224;  la 
fonction ou sur les fonctions associ&#233;es &#224; la forme. Mais d&#232;s &#224; pr&#233;sent, ils nous permettent 
de mettre en lumi&#232;re un certain type de contraintes pouvant s'exercer sur les &#233;v&#233;nements 
manuels et qui sont probablement accompagn&#233;s d'autres contraintes &#224; d&#233;couvrir, sur des 
&#233;l&#233;ments non-manuels par exemple.
Nous avons remarqu&#233; la pr&#233;sence de ces structures (2a) dans la base de donn&#233;es de 
lexique de LSF construite pendant le projet. Dans cette base de donn&#233;es, chaque entr&#233;e 
est  une  unit&#233;  lexicale  lemmatis&#233;e,  associ&#233;e  &#224;  un  ou  plusieurs  concepts.  Une  entr&#233;e 
poss&#233;dant  une telle  structure  doit-elle  &#234;tre  consid&#233;r&#233;e  comme une unit&#233;  lexicale,  ou 
s'agit-il  d'une construction &#171; syntaxique &#187; &#224; laquelle  on peut associer un concept ? Le 
signe est-il une &#233;tape de la lexicalisation d'une structure, et comment trancher ? De plus, 
il est possible que des articulateurs non manuels soient porteurs d'une structure, comme 
</p>
<p>377</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>chez certaines observ&#233;es dans le projet DictaSign, et leur synchronisation peut devenir 
d'autant plus complexe. 
Pour en revenir &#224; notre motivation initiale de concevoir des mod&#232;les informatiques, ces 
consid&#233;rations plaident en faveur de repr&#233;sentations qui ne sont ni organis&#233;es autour de 
l'activit&#233; manuelle a priori, ni limit&#233;s &#224; des niveaux linguistiques sp&#233;cifiques (lexique, 
syntaxe, etc.) mais proposent un point de vue global.
</p>
<p>3 La repr&#233;sentation des r&#232;gles
Cette section pr&#233;sente un &#233;tat  des lieux des mod&#232;les  existants,  le  cahier  des charges 
auquel selon nous doit r&#233;pondre un mod&#232;le de description de la LS, puis le nouveau 
formalisme que nous proposons nomm&#233; AZee. 
</p>
<p>3.1 Mod&#232;les &#224; composante temporelle
Le projet le plus abouti reste celui &#233;labor&#233; durant le projet europ&#233;en ViSiCAST, bas&#233; sur 
HPSG  (Marshall,  2004).  Il  est  int&#233;gr&#233;  dans  un  syst&#232;me  de  g&#233;n&#233;ration  automatique 
d'&#233;nonc&#233;s en LS qui d&#233;finit  des s&#233;quences de mouvements ou de signes &#233;l&#233;mentaires 
s&#233;par&#233;s par des transitions de m&#234;me nature (Elliott, 2004). Ce type de repr&#233;sentation 
n'int&#232;gre pas de syst&#232;me de synchronisation suffisant pour repr&#233;senter les ph&#233;nom&#232;nes 
li&#233;s &#224; la multi-lin&#233;arit&#233; de la LSF.
Deux mod&#232;les  font  tout  de  m&#234;me appara&#238;tre  la  multi-lin&#233;arit&#233;  dans  les  descriptions. 
Liddell  &amp;  Johnson  (1989)  ont  montr&#233;  que  les  signes  &#233;taient  divisibles  en  unit&#233;s 
temporelles o&#249; les articulateurs du corps se synchronisaient en postures, s&#233;par&#233;es par des 
unit&#233;s de transition, alternant sur une ligne temporelle de description. Ce mod&#232;le reste en 
revanche comme ses pr&#233;d&#233;cesseurs port&#233; sur l'activit&#233; manuelle et la description lexicale 
dans sa forme de citation (dictionnaire), or les LS permettent la cr&#233;ation spontan&#233;e et 
s&#233;mantiquement productive d'unit&#233;s non r&#233;pertori&#233;es qui contrastent avec le vocabulaire 
fig&#233; (&#171; standard &#187;) en cela qu'elles mettent souvent en jeu de nombreux articulateurs non 
manuels (&#233;paules, buste, muscles faciaux, etc.) qu'il faut synchroniser.
Le mod&#232;le P/C de Huenerfauth (2006) permet de diviser par endroits une ligne de temps 
en  deux  lignes  parall&#232;les  pour  sp&#233;cifier  deux  activit&#233;s  simultan&#233;es.  L'&#233;nonc&#233;  peut  se 
repr&#233;senter sous la forme d'un arbre o&#249; les feuilles sont des signes lexicaux et les n&#339;uds 
interm&#233;diaires sont chacun :
</p>
<p>&#8226; soit de type C (constituant), dont les enfants sont des sous-parties de l'&#233;nonc&#233; &#224; 
concat&#233;ner ;
</p>
<p>&#8226; soit de type P (partition), dont les enfants sont des sous-parties de l'&#233;nonc&#233; &#224; 
parall&#233;liser.
</p>
<p>Le  probl&#232;me est  alors  que  les  n&#339;uds  P  et  C partagent  syst&#233;matiquement les  m&#234;mes 
bornes temporelles et ne peuvent se chevaucher librement &#224; moins d'utiliser des n&#339;uds 
sp&#233;ciaux  &#171; &#216; &#187;  qui  ne  repr&#233;sentent  rien  linguistiquement  et  rendent  les  descriptions 
fastidieuses.
</p>
<p>378</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.2 Cl&#233;s pour un nouveau mod&#232;le
Nous proposons un nouveau formalisme de description nomm&#233; Azee. En utilisant deux 
m&#233;thodes  de  synchronisation  combin&#233;es,  AZee  peut  d&#233;crire  n'importe  quel  motif  de 
synchronisation des articulateurs du corps en LS.
Dans le cas g&#233;n&#233;ral, un groupe d'articulateurs dans une production sign&#233;e a une p&#233;riode 
d'activit&#233;  pendant  laquelle  ils  concourent  &#224;  l'&#233;nonc&#233;  et  hors  de  laquelle  ils  sont  ou 
retournent dans une position de repos. Cette p&#233;riode est appel&#233;e &#171; intervalle &#187; et not&#233;e 
&#171; TI &#187; (time interval). Par exemple, le sch&#233;ma suivant  montre 5 TI synchronis&#233;s sur un 
axe temporel qui correspondant &#224; l'exemple de la figure 1.
</p>
<p>Main dominante :   |_LIGNE_|  |_JAUNE_|  |__U__|  |__3__|
Main domin&#233;e :      |_LIGNE__________________________ _ _ _
</p>
<p>Chaque  production  linguistique  met  en  jeu  un  certain  nombre  de  TI  qu'il  faut 
synchroniser, et chaque TI contient une partie de la signation qu'il faut sp&#233;cifier.
Notons  en  outre  que  l'observation  d'un  corpus  de  vid&#233;os  montre  que  pour  une 
construction linguistique donn&#233;e, tous les locuteurs ne synchronisent pas n&#233;cessairement 
les  TI  de  mani&#232;re  rigoureusement  identique.  On  remarque  que  le  maintien  de  la 
configuration finale du signe LIGNE par la main domin&#233;e peut varier dans sa dur&#233;e, mais 
que la synchronisation initiale des deux mains au d&#233;but du signe LIGNE reste identique 
pour tous les signeurs.
</p>
<p>&#192; propos de cette variabilit&#233; et en vue de sp&#233;cifier la structure linguistique, nous posons 
les trois objectifs suivants :
</p>
<p>&#8226; toute variabilit&#233; dans la production n'entra&#238;nant pas de modification du sens doit 
rester possible (pas de sur-sp&#233;cification) ;
</p>
<p>&#8226; tout changement entra&#238;nant une modification du sens de l'&#233;nonc&#233; fait l'objet d'un 
param&#232;tre de la r&#232;gle ;
</p>
<p>&#8226; toute sp&#233;cification valable quelle que soit le contexte et le signeur doit &#234;tre fix&#233; 
par la r&#232;gle (on appelle ces &#233;l&#233;ments les invariants de la structure).
</p>
<p>Pour traiter ce probl&#232;me, nous proposons :
&#8226; le recours &#224; des ensembles minimaux de contraintes (gestuelles et temporelles) 
</p>
<p>suffisantes pour &#233;noncer une r&#232;gle sans contraindre trop la signation ;
&#8226; la  possibilit&#233;  pour  les  &#233;l&#233;ments  de  sp&#233;cification  de  d&#233;pendre  de  variables 
</p>
<p>contextuelles non fix&#233;es par la r&#232;gle mais qui prendront une valeur selon leur 
utilisation.
</p>
<p>3.3 Le mod&#232;le AZee
Le mod&#232;le Azee permet de repr&#233;senter les contraintes n&#233;cessaires et suffisantes (CNS) de 
synchronisation et de r&#233;alisation d'un &#233;nonc&#233; en LS. Il est compos&#233; de deux mod&#232;les, 
Zebedee et Azalee.
</p>
<p>379</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Zebedee  est  un  langage  de  description  qui  impl&#233;mente  des  CNS  ainsi  que  des 
d&#233;pendances  contextuelles  pour  donner  aux  s&#233;quences  posture-transition  ces  m&#234;mes 
propri&#233;t&#233;s. Il a &#233;t&#233; initialement con&#231;u pour d&#233;crire les unit&#233;s lexicales de la LS. Nous ne 
d&#233;taillons pas ce formalisme ici mais une page web lui est d&#233;di&#233;e4.
Azalee est un formalisme capable de d&#233;crire tous types de synchronisation entre TI. En 
Azalee, les TI, g&#233;n&#233;ralement superpos&#233;s, doivent &#234;tre agenc&#233;s sur la ligne de temps selon 
des contraintes temporelles &#224; d&#233;terminer, puis chaque TI doit &#234;tre sp&#233;cifi&#233;, s&#233;par&#233;ment, 
sp&#233;cifiant ainsi la totalit&#233; de la structure.
Soit un ensemble de TI num&#233;rot&#233;s TI1, TI2, etc. concourant &#224; une structure linguistique.  
Azalee d&#233;crit cette structure en un &#171; azalisting &#187;, en les encapsulant comme suit :
</p>
<p>[[
r&#232;gle de synchro,   %% Liste des contraintes temporelles
r&#232;gle de synchro,   %% n&#233;cessaires et suffisantes agen&#231;ant
r&#232;gle de synchro... %% les TI sur l'axe temporel
</p>
<p>|| TI1 :
bloc de sp&#233;cification
</p>
<p>|| TI2 :
bloc de sp&#233;cification
</p>
<p>|| ... :
          %% etc. (un bloc pour chaque TI apparaissant dans le bloc de synchro)
]]
</p>
<p>&#192; l'instar des CNS de Zebedee, les TI sont agenc&#233;s sur l'axe temporel avec un ensemble 
minimal de contraintes temporelles n&#233;cessaires sur les bornes des intervalles (relations 
&lt;, =, &#8805;...) ou sur les intervalles tout entiers (Allen, 1983). Ces contraintes apparaissent 
dans la premi&#232;re section de l'azalisting, encadr&#233;es par &#171; [[ &#187; et le premier s&#233;parateur &#171; || &#187;. 
Nous en donnons quelques exemples ci-dessous :
</p>
<p>&#8226; |gaze = &lt;|pt &#8594; le d&#233;but du TI nomm&#233; &#171; gaze &#187; pr&#233;c&#232;de imm&#233;diatement le d&#233;but 
du TI &#171; pt &#187; (pointage manuel) ;
</p>
<p>&#8226; gaze| &lt; pt| &#8594; la fin de &#171; gaze &#187; pr&#233;c&#232;de celle de &#171; pt &#187; ;
&#8226; pt |d| md &#8594; le  TI  &#171; pt &#187;  est  inclus  dans  &#171; md &#187;  (p.  ex.  la  tenue  de  la  main 
</p>
<p>domin&#233;e) &#8211; le &#171; d &#187; est pour &#171; during &#187; ;
&#8226; |A = B| ~ C| &#8594; &#171; A &#187; d&#233;bute entre la fin de &#171; B &#187; et la fin de &#171; C &#187;.
</p>
<p>Chaque TI doit  ensuite &#234;tre sp&#233;cifi&#233; dans son propre bloc de sp&#233;cification. Cela peut 
repr&#233;senter un simple regard sur une cible, une suite de signes manuels, un geste des  
&#233;paules, du buste, des sourcils ou une combinaison de ceux-ci. Formellement, cela peut 
repr&#233;senter :
</p>
<p>&#8226; une simple liste de contraintes qui sera &#224; maintenir durant toute sa dur&#233;e, en 
utilisant des contraintes articulatoires &#233;l&#233;mentaires &#8211; ces contraintes ciblent les 
articulateurs  du  corps  comme  un  os  du  squelette  ou  un  muscle  du  visage, 
&#233;ventuellement param&#233;tr&#233;s par un num&#233;ro d'ordre (p.ex. la &#171; n-i&#232;me &#187; phalange 
</p>
<p>4http://perso.limsi.fr/filhol/zebedee
</p>
<p>380</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>du doigt) et/ou par un c&#244;t&#233; du corps (gauche/droit ou dominant/domin&#233;) ;
&#8226; une  synchronisation  de  postures  s&#233;par&#233;es  par  des  transitions,  en  utilisant  le 
</p>
<p>langage Zebedee pr&#233;vu &#224; cet effet ;
&#8226; une structure temporellement plus complexe, &#224; savoir un azalisting imbriqu&#233;, 
</p>
<p>r&#233;partissant ainsi les TI contenus sur le morceau de l'axe temporel d&#233;di&#233; au TI 
englobant.
</p>
<p>Les  deux  formalismes  Azalee  et  Zebedee,  et  ce  faisant  les  deux  strat&#233;gies  de 
synchronisation,  se  combinent  et  permettent  l'imbrication  libre  de  structures 
r&#233;utilisables.
Voici un exemple complet d'azalisting pour une structure activant une zone de l'espace 
de signation par un pointage dont le sch&#233;ma g&#233;n&#233;ral est d&#233;crit ci-dessous :
</p>
<p>&#8226; le regard pr&#233;c&#232;de toujours d'un temps tr&#232;s court le signe du pointage ;
&#8226; le regard et le pointage ciblent tous deux le m&#234;me point de l'espace qui d&#233;pend 
</p>
<p>de l'&#233;nonc&#233; ;
&#8226; si  le  regard  est  maintenu,  il  ne  d&#233;passe  jamais  la  r&#233;tractation  du  pointage 
</p>
<p>manuel.
AZOP &quot;activation + pointage de l'espace&quot;
  %% Ci-dessous, d&#233;claration d'une d&#233;pendance au contexte
  DEP spaceloc : Point  %% repr&#233;sente l'emplacement activ&#233;
 [[
</p>
<p> |gaze = &lt;|pt, %% regard d&#233;bute juste avant pointage
 gaze| &lt; pt|   %% regard termine avant la fin du pointage
</p>
<p>  || gaze:
  LOOK at [spaceloc]    %% regarder l'emplacement &#224; activer
</p>
<p>  || pt:
   SEQ &quot;pointage&quot; WITH  %% ce m&#234;me emplacement comme cible
     target = [spaceloc]
   END
</p>
<p> ]]
END
</p>
<p>o&#249;  &#8220;pointage&#8221; est  une  &#171; zebedescription &#187;  d&#233;finie  par  ailleurs  avec  une  d&#233;pendance 
contextuelle nomm&#233;e &#171; target &#187; qui repr&#233;sente la cible du pointage.
</p>
<p>4 Conclusion et perspectives
Cet article a  pr&#233;sent&#233; une m&#233;thodologie visant,  &#224;  partir  d'une observation de corpus 
vid&#233;o, &#224; rep&#233;rer puis formaliser les r&#233;gularit&#233;s de structure apparaissant entre le sens et  
la  forme  de  constructions  linguistiquement  motiv&#233;es.  Cette  m&#233;thodologie  se  veut  le 
moins  possible  empreinte  de  courant  linguistique  a  priori,  et  applicable  &#224;  tous  les 
niveaux  du  langage,  du  sub-lexical  &#224;  l'&#233;nonc&#233;  complet.  Le  rep&#233;rage  vid&#233;o  s'organise 
autour  de  deux  d&#233;marches  inverses  et  compl&#233;mentaires  :  rechercher  une  forme  et 
g&#233;n&#233;raliser sur le sens ou rechercher une valeur s&#233;mantique et en extraire les invariants  
</p>
<p>381</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>surfaciques. La formalisation de r&#232;gles de production &#224; partir de ces r&#233;gularit&#233;s observ&#233;es 
est rendue possible gr&#226;ce au mod&#232;le AZee, dont nous avons pr&#233;sent&#233; les bases. Celui-ci 
permet une combinaison des deux strat&#233;gies de synchronisation qu'offrent les langages 
Zebedee  et  Azalee,  respectivement  la  synchronisation  par  postures  et  celle  par 
agencement contraint d'intervalles temporels sur une ligne de temps.
Si la partie Zebedee de ce mod&#232;le est d&#233;j&#224; bien &#233;valu&#233;e (2000 signes LSF d&#233;crits), nous 
n'avons pour l'instant explor&#233; qu'une dizaine de structures. Les cinq heures de corpus 
DictaSign annot&#233;es5 devraient nous permettre de recueillir plus de ces structures, et plus 
d'occurrences pour chacune, et ainsi augmenter notre &#233;chantillon d'&#233;tude.
Nous  comptons  poursuivre  ce  travail  pour  multiplier  le  nombre  de  structures  ainsi 
d&#233;crites  et &#224;  terme pouvoir  conclure sur la  capacit&#233; d'AZee &#224; couvrir  l'ensemble des 
structures linguistiques mises en &#233;vidence. Notre hypoth&#232;se est qu'une fois combin&#233;es, 
ces r&#232;gles pourront permettre de d&#233;crire des &#233;nonc&#233;s complets en LS. Ceci sera le point 
de d&#233;part d'une &#233;valuation approfondie du mod&#232;le AZee et de sa mise en &#339;uvre au sein 
d'applications d&#233;di&#233;es &#224; la g&#233;n&#233;ration et LS et &#224; plus long terme &#224; la traduction du texte  
vers la LS, en utilisant les entr&#233;es de ces r&#232;gles comme sortie d'un syst&#232;me d'analyse 
textuelle.  Ces  r&#232;gles  pourront  aussi  faire  suite  au  travail  d&#233;j&#224;  entam&#233; avec  Zebedee 
(Gonzalez, 2012), pour &#233;tendre les travaux de reconnaissance des signes lexicaux aux 
structures plus larges des &#233;nonc&#233;s.
</p>
<p>5 Ref&#769;er&#769;ences
ALLEN, J. F. (1983). Maintaining Knowledge about Temporal Intervals. In Communications  
of the ACM 26:11, pp. 832&#8211;843, New-York, USA.
ELLIOTT, R., GLAUERT, J., JENNINGS V., KENNAWAY, R. (2004). An overview of SiGML notation 
and SiGMLSigning software system. In Proceedings of LREC 2004 (Language Resources and  
Evaluation Conference) workshop RPSL (Representation and Processing of Sign Languages) :  
From  SignWriting  to  Image  Processing.Information  techniques  and  their  implications  for  
teaching, documentation and communication, Lisbon, Portugal.
FILHOL,  M. (2011).  Text-sign  parallel  corpus  study  to  start  designing  an  automatic 
translation system. In proceedings of SLTAT workshop 2011 (Sign Language Translation and  
Avatar Technology), Dundee, Scotland.
GONZALEZ,  M.,  FILHOL,  M.,  COLLET,  C. (2012).  Semi-automatic  Sign  Language  corpora  
annotation  using  lexical  representations  of  signs,  Language  Resource  and  Evaluation 
Conference, Istanbul.
HUENERFAUTH,  M. (2006).  Generating  American  Sign  Language  classifier  predicates  for 
English-to-ASL machine translation. PhD thesis, University of Pennsylvania, USA.
LIDDELL, S. K., JOHNSON, R. E. (1989). American Sign Language, the phonological base. Sign 
Language studies 64, Cambridge University press.
</p>
<p>MARSHALL, I., S&#193;F&#193;R, &#201;. (2004). Sign Language Generation in an ALE HPSG . In proceedings  
of HPSG-11, Leuven, Belgique.
5http://www.sign-lang.uni-hamburg.de/dicta-sign/portal/
</p>
<p>382</p>

</div></div>
</body></html>