<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Synth&#232;se de texte avec le logiciel Syntox</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 5: D&#233;monstrations, pages 5&#8211;6,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Synth&#232;se de texte avec le logiciel Syntox
</p>
<p>Lionel Cl&#233;ment
Universit&#233; Bordeaux 1 &#8211; LaBRI (UMR 5800) &#8211; CLEE-ERSS (UMR 5263)
</p>
<p>lionel.clement@labri.fr
</p>
<p>R&#201;SUM&#201;
Le logiciel Syntox, dont une interface utilisateur en ligne ce trouve &#224; cette URL :
http://www.syntox.net, est une mise en application d&#8217;un mod&#232;le bas&#233; sur les grammaires
attribu&#233;es, dans le cadre de la synth&#232;se de texte. L&#8217;outil est une plateforme d&#8217;exp&#233;rimentation dont
l&#8217;ergonomie est simple. Syntox est capable de traiter des lexiques et des grammaires volumineux
sur des textes ambigus &#224; partir de la description explicite de ph&#233;nom&#232;nes linguistiques.
</p>
<p>ABSTRACT
Automated generation of text with Syntox
</p>
<p>Syntox, which includes an online user interface at URL http://www.syntox.net, is an
implementation of a model based on attribute grammars, in the context of automated generation
of text. The sofware is intended as a platform for experimentation with an ergonomic interface.
Syntox is usable with large vocabularies and grammars to produce ambiguous texts from an
explicit description of linguistic phenomena.
</p>
<p>MOTS-CL&#201;S : Synth&#232;se de texte, Grammaire attribu&#233;e, Syntaxe.
</p>
<p>KEYWORDS: Text generation, Attribute Grammars, Syntax.
</p>
<p>Introduction
</p>
<p>Le programme Syntox demande une grammaire, un lexique (ou une connexion &#224; un serveur
qui d&#233;livre ce lexique), et une structure de traits cens&#233;e correspondre &#224; une repr&#233;sentation de
la syntaxe d&#8217;un texte. Le logiciel produit une for&#234;t partag&#233;e. L&#8217;ensemble des textes engendr&#233;s
par cette for&#234;t est ensuite affich&#233; &#224; l&#8217;&#233;cran avec des &#233;l&#233;ments permettant la mise au point des
grammaires (for&#234;ts partielles, messages d&#8217;erreurs, &#233;tapes de synth&#232;se).
</p>
<p>Synth&#232;se de texte &#224; l&#8217;aide de grammaires attribu&#233;es
</p>
<p>Contrairement &#224; ce qui se fait dans les mod&#232;les habituels &#171;d&#8217;unification&#187;, comme PATR-II (Shieber,
1984), il n&#8217;est jamais question de marquer une contrainte d&#8217;&#233;galit&#233; A= B entre deux &#233;l&#233;ments
dont l&#8217;un entre dans la structure compositionnelle de l&#8217;autre. Nous rejetons syst&#233;matiquement
cette approche qui pose un probl&#232;me de complexit&#233; algorithmique (dont l&#8217;ind&#233;cidabilit&#233; dans le
cas g&#233;n&#233;ral) pour l&#8217;analyse ou la synth&#232;se lorsque A et B sont dans des rapports pluri-univoques
(homonymie, polys&#233;mie, synomynie). A cette approche qui se r&#233;sume &#224; r&#233;soudre par unification
</p>
<p>5</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>un syst&#232;me d&#8217;&#233;quations et qui donne son nom aux grammaires &#171;d&#8217;unification&#187;, nous opposons un
mod&#232;le o&#249; A et B sont dans une relation de d&#233;pendance, plus pr&#233;cis&#233;ment de copie.
</p>
<p>Le mod&#232;le utilis&#233; par Syntox est celui, bien connu et assez ancien des grammaires attri-
bu&#233;es(Knuth, 1968). En conformit&#233; avec celui-ci, Syntox impose la non circularit&#233; des calculs
sur les attributs pour la raison &#233;voqu&#233;e imm&#233;diatement. Ceci sera essentiel pour garantir la
d&#233;cidabilit&#233; des algorithmes qui mettent en correspondance les textes et les repr&#233;sentations
profondes de ces textes (ici la synth&#232;se de texte &#224; partir d&#8217;une repr&#233;sentation de la syntaxe).
</p>
<p>Pour nous approcher des formalismes utilis&#233;s en linguistique, notamment des grammaires
d&#8217;unification, les structures de traits, cens&#233;s contenir les repr&#233;sentations profondes des textes,
ont &#233;t&#233; choisies comme attributs de la grammaire. L&#8217;analyse syntagmatique est support&#233;e par la
grammaire hors-contexte sous-jacente de la grammaire attribu&#233;e.
</p>
<p>La grammaire d&#233;cline pour chaque syntagme, deux attributs, l&#8217;un synth&#233;tis&#233;, que je note &#8657;,
et l&#8217;autre h&#233;rit&#233; que je note &#8593;. Le premier est calcul&#233; en fonction des attributs des termes qui
composent le syntagme. Le second est calcul&#233; en fonction des attributs du terme qui le contient.
D&#8217;&#233;vidence les propri&#233;t&#233;s lexicales seront synth&#233;tis&#233;es, y compris celles qui ne sont pas locales,
les propri&#233;t&#233;s globales 1 seront h&#233;rit&#233;es.
</p>
<p>&#201;crire une grammaire jouet du fran&#231;ais
</p>
<p>Gr&#226;ce &#224; quelques exemples simples, on montre l&#8217;int&#233;r&#234;t de manipuler les deux types d&#8217;attributs
(synth&#233;tis&#233; et h&#233;rit&#233;s). Les ph&#233;nom&#232;nes lexicaux peuvent &#234;tre complexes. Je montre comment
faire avec Syntox pour qu&#8217;un pr&#233;dicat nominal s&#8217;articule avec un verbe support ou encore
comment un pr&#233;dicat impose des constantes dans le lemme ou les cat&#233;gories grammaticales de
ses compl&#233;ments.
</p>
<p>Sur l&#8217;exemple des adjectifs &#233;pith&#232;tes, je montre comment utiliser les listes d&#8217;ajouts et comment
r&#233;cup&#233;rer les attributs synth&#233;tis&#233;s de fa&#231;on r&#233;cursive pour traiter l&#8217;accord.
</p>
<p>Au del&#224; de la phrase En conclusion, je propose quelques exemples aux limites de l&#8217;outil avec
des textes qui mettent en oeuvre une ou plusieurs propositions. En aucune mani&#232;re, Syntox ne
permet de traiter la r&#233;solution des anaphores ou l&#8217;ellipse. Il conviendra alors de savoir articuler
Syntox dans un syst&#232;me de g&#233;n&#233;ration de texte pour ces probl&#232;mes en particulier.
</p>
<p>R&#233;f&#233;rences
</p>
<p>KNUTH, D. E. (1968). Semantics of context-free languages. Mathematical Systems Theory, 2(2):127&#8211;145.
</p>
<p>SHIEBER, S. M. (1984). The design of a computer language for linguistic information. In Proceedings of the
Tenth International Conference on Computational Linguistics, pages 362&#8211;366, Stanford University, Stanford,
California.
</p>
<p>1. Par propri&#233;t&#233;s globales, j&#8217;entends par exemple celles qui ne sont pas sujettes &#224; la variation.
</p>
<p>6</p>

</div></div>
</body></html>