<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Nomao : un moteur de recherche g&#233;olocalis&#233; sp&#233;cialis&#233; dans la recommandation de lieux et l&#8217;e-r&#233;putation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 5: D&#233;monstrations, pages 13&#8211;14,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Nomao : un moteur de recherche g&#233;olocalis&#233; sp&#233;cialis&#233; dans
la recommandation de lieux et l&#8217;e-r&#233;putation
</p>
<p>Estelle Delpech1,2 Laurent Candillier1,2
(1) NOMAO, 1 avenue Jean Rieux 31500 Toulouse, www.nomao.com
</p>
<p>(2) EBUZZING GROUP, 97 rue du cherche-midi 75006 Paris, www.ebuzzing.com
{prenom}@nomao.com, {prenom.nom}@ebuzzing.com
</p>
<p>R&#201;SUM&#201;
Cette d&#233;monstration pr&#233;sente NOMAO, un moteur de recherche g&#233;olocalis&#233; qui permet &#224; ses
utilisateurs de trouver des lieux (bars, magasins...) qui correspondent &#224; leurs go&#251;ts, &#224; ceux de
leurs amis et aux recommandations des internautes.
</p>
<p>ABSTRACT
Nomao : a geolocalized search engine dedicated to place recommendation and e-
reputation
</p>
<p>This demonstration showcases NOMAO, a geolocalized search engine which recommends places
(bars, shops...) based on the user&#8217;s and its friend&#8217;s tastes and on the web surfers&#8217; recommendations.
</p>
<p>MOTS-CL&#201;S : recherche d&#8217;information, analyse d&#8217;opinion, g&#233;n&#233;ration de texte, fouille du web.
</p>
<p>KEYWORDS: information retrieval, opinion mining, text generation, web mining.
</p>
<p>1 Nomao : recherche locale, recommandation et e-r&#233;putation
</p>
<p>Nomao est un moteur de recherche g&#233;olocalis&#233; sp&#233;cialis&#233; dans la recommandation de lieux et
l&#8217;e-r&#233;putation. Il r&#233;pond &#224; des requ&#234;tes portant sur un type de lieux (restaurant, m&#233;decin. . .) et
une zone g&#233;ographique donn&#233;e, par exemple : &#171; h&#244;tel bon march&#233; &#224; Grenoble &#187;. Dans sa page de
r&#233;sultats, Nomao favorise les lieux correspondant aux go&#251;ts de l&#8217;utilisateur (filtrage collaboratif),
aux recommandations de ses amis et des internautes.
</p>
<p>Nomao extrait ses donn&#233;es de sites de contenu g&#233;n&#233;r&#233;s par les utilisateurs et d&#8217;annuaires de lieux.
Il les agr&#232;ge, les enrichit et en pr&#233;sente une synth&#232;se personnalis&#233;e &#224; ses utilisateurs. Chaque
lieu est associ&#233; &#224; une fiche descriptive r&#233;sumant les opinions exprim&#233;es sur Internet &#224; son propos
ainsi que diverses informations factuelles : descripteurs (cuisine italienne, wifi gratuit), adresse,
no de t&#233;l&#233;phone, etc. Nomao fonctionne actuellement en 5 langues (allemand, anglais, espagnol,
fran&#231;ais, italien).
</p>
<p>13</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Traitement automatique des langues pour la recherche lo-
cale, la recommandation et l&#8217;e-r&#233;putation
</p>
<p>Nos axes de recherche et d&#233;veloppement en TAL &#233;margent sur plusieurs domaines :
</p>
<p>&#8226; Analyse d&#8217;opinion Nous cherchons &#224; analyser l&#8217;opinion &#224; deux niveaux de granularit&#233;. &#192;
granularit&#233; moyenne, chaque commentaire doit &#234;tre associ&#233; &#224; une tonalit&#233; positive, plut&#244;t positive,
n&#233;gative, plut&#244;t n&#233;gative ou neutre. &#192; granularit&#233; fine, les termes extraits des commentaires
doivent &#234;tre rattach&#233;s &#224; une cat&#233;gorie et leur tonalit&#233; identifi&#233;e :
</p>
<p>&quot;mousse au chocolat excellente&quot;&#8658; {CAT&#201;GORIE : dessert, TONALIT&#201; : positive}
</p>
<p>&#8226; G&#233;n&#233;ration automatique de textes Les informations associ&#233;es &#224; un lieu sont pr&#233;sentes
en base de donn&#233;es sous la forme de paires attribut/valeur. Afin d&#8217;en faciliter la lecture &#224; nos
utilisateurs, nous g&#233;n&#233;rons automatiquement des descriptifs en langue naturelle :
</p>
<p>{NOM : La Braisi&#232;re, TYPE : restaurant, DESCRIPTEURS : sud-ouest, tapas}
&#8658; &quot;La Braisi&#232;re est un restaurant sp&#233;cialis&#233; dans la cuisine du sud-ouest et les tapas.&quot;
</p>
<p>&#8226; Interpr&#233;tation de requ&#234;tes Nomao re&#231;oit deux types de requ&#234;tes : soit l&#8217;utilisateur cherche
un type de lieu dans une zone g&#233;ographique donn&#233;e (&#171; restaurant &#224; Paris &#187;), soit il cherche des
informations sur un lieu qu&#8217;il connait d&#233;j&#224; (&#171; restaurant &quot;La Gare&quot;, Paris &#187;). Les requ&#234;tes sont
donc ambigu&#235;s et il faut d&#233;terminer quels mots r&#233;f&#232;rent au nom du lieu, au type du lieu, &#224; sa
localisation et &#224; d&#8217;&#233;ventuels descripteurs :
</p>
<p>&quot;restaurant l&#8217;auberge en gascogne&quot;
&#8658; { TYPE : restaurant, NOM : auberge en gascogne, LOCALISATION : ;, DESCRIPTEURS : ; }
|| { TYPE : restaurant, NOM : ;, LOCALISATION : gascogne, DESCRIPTEURS : auberge }
</p>
<p>&#8226; Normalisation graphique et morphosyntaxique Les descripteurs associ&#233;s aux lieux sont
collect&#233;s &#224; partir de plusieurs sources et apparaissent sous des formes diff&#233;rentes qu&#8217;il convient
de normaliser (correction orthographique, lemmatisation) :
</p>
<p>{grillade, grillades, grilade}&#8658; grillades
</p>
<p>Il en est de m&#234;me pour les termes extraits des commentaires qui comportent des variations
morphosyntaxiques que nous souhaitons pouvoir identifier :
</p>
<p>{&quot;attente trop longue&quot;, &quot;attendre longtemps&quot;}&#8658; attente longue
</p>
<p>&#8226; Identification de relations s&#233;mantiques Le d&#233;veloppement d&#8217;un th&#233;saurus doit permettre
d&#8217;am&#233;liorer la normalisation des descripteurs et des termes :
</p>
<p>{bo&#238;te, discoth&#232;que}&#8658; discoth&#232;que
Les relations s&#233;mantiques peuvent &#234;tre utilis&#233;es pour &#233;tendre/affiner les requ&#234;tes et am&#233;liorer la
recommandation :
</p>
<p>&quot;restaurant v&#233;g&#233;tarien&quot;&#8658; &quot;restaurant v&#233;g&#233;tarien OR v&#233;g&#233;talien&quot;
</p>
<p>Enfin, les sources de donn&#233;es n&#8217;&#233;tant pas fiables &#224; 100%, il faut pouvoir d&#233;tecter automatiquement
les descripteurs incoh&#233;rents pour un lieu :
</p>
<p>{gastronomique, &#233;toil&#233;, haut de gamme, fast-food}&#8658; {gastronomique, &#233;toil&#233;, haut de gamme}
</p>
<p>14</p>

</div></div>
</body></html>