<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Quel est l'apport de la d&#233;tection d'entit&#233;s nomm&#233;es pour l'extraction d'information en domaine restreint ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 359&#8211;366,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Quel est l&#8217;apport de la d&#233;tection d&#8217;entit&#233;s nomm&#233;es pour
l&#8217;extraction d&#8217;information en domaine restreint ?
</p>
<p>Camille Dutrey1, 2, 3, Chlo&#233; Clavel1, Sophie Rosset2, Ioana Vasilescu2, Martine
Adda-Decker2, 3
</p>
<p>(1) EDF R&amp;D, 1 avenue du G&#233;n&#233;ral de Gaulle 92141 Clamart
(2) LIMSI-CNRS, rue John von Neumann 91403 Orsay
</p>
<p>(3) LPP, 19 rue des Bernardins 75005 Paris
camille.dutrey@{edf,limsi}.fr, chloe.clavel@edf.fr, sophie.rosset@limsi.fr,
</p>
<p>vasilescu@limsi.fr, madda@{univ-paris3,limsi}.fr
</p>
<p>R&#201;SUM&#201;
Les travaux li&#233;s &#224; la d&#233;finition et &#224; la reconnaissance des entit&#233;s nomm&#233;es sont g&#233;n&#233;ralement en-
visag&#233;s en domaine ouvert, &#224; travers la conception de cat&#233;gories g&#233;n&#233;riques (noms de personnes,
de lieux, etc.) et leur application &#224; des donn&#233;es textuelles issues de la presse (orale comme &#233;crite).
Par ailleurs, la fouille des donn&#233;es issues de centres d&#8217;appel est strat&#233;gique pour une entreprise
comme EDF, compte tenu du r&#244;le crucial jou&#233; par l&#8217;opinion pour les applications marketing, ce
qui passe par la d&#233;finition d&#8217;entit&#233;s d&#8217;int&#233;r&#234;t propres au domaine. Nous comparons les deux
types de mod&#232;les d&#8217;entit&#233;s &#8211; g&#233;n&#233;riques et sp&#233;cifiques &#224; un domaine pr&#233;cis &#8211; afin d&#8217;observer
leurs points de recouvrement, via l&#8217;annotation manuelle d&#8217;un corpus de conversations en centres
d&#8217;appel. Nous souhaitons ainsi &#233;tudier l&#8217;apport d&#8217;une d&#233;tection en entit&#233;s nomm&#233;es g&#233;n&#233;riques
pour l&#8217;extraction d&#8217;information m&#233;tier en domaine restreint.
</p>
<p>ABSTRACT
What is the contribution of named entities detection for information extraction in restric-
ted domain ?
</p>
<p>In the framework of general domain dialog corpora a particular focus is dedicated to Named
Entities definition and recognition, which are mostly very generic (personal names, locations,
etc.). Moreover, call-centre data mining is strategic for a company like EDF, the public opinion
analysis playing a significant role in EDF services quality evaluation and for marketing
applications. In this purpose a domain dependant definition of entities of interest is essential. In
this primary work we compare two types of entities models (generic and specific to the domain)
in order to observe their respective coverage. We annotated manually a sub-corpus extracted
from a large corpus of oral dialogs recorded in an EDF call-centre. The respective proportion of
generic vs domain-specific Named Entities is then estimated. Impact for future work on building
EDF domain-specific entities models is discussed.
</p>
<p>MOTS-CL&#201;S : entit&#233;s nomm&#233;es, concepts m&#233;tier, extraction d&#8217;information, donn&#233;es conversa-
tionnelles, annotation.
</p>
<p>KEYWORDS: named entities, business concept, information extraction, conversational data,
annotation.
</p>
<p>359</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>La fouille des donn&#233;es issues de centres d&#8217;appel est strat&#233;gique pour EDF, compte tenu du r&#244;le
crucial jou&#233; par l&#8217;opinion pour les applications marketing ; elle participe d&#8217;une am&#233;lioration de la
connaissance du client et de ce fait du d&#233;veloppement de sa fid&#233;lit&#233; vis &#224; vis de l&#8217;entreprise. Il est
de plus n&#233;cessaire de mettre en place des m&#233;thodes adapt&#233;es pour un traitement automatis&#233; afin
d&#8217;extraire et d&#8217;organiser efficacement le contenu informationnel de ces interactions t&#233;l&#233;phoniques.
</p>
<p>L&#8217;extraction d&#8217;information sur des transcriptions orales est g&#233;n&#233;ralement abord&#233;e du point de vue
de la d&#233;tection d&#8217;entit&#233;s nomm&#233;es (EN) et de la recherche d&#8217;information, avec des campagnes
d&#8217;&#233;valuation comme ESTER2 (ESTER2, 2008; Galliano et al., 2009). Ces campagnes sont toutefois
principalement bas&#233;es sur des donn&#233;es de type bulletins d&#8217;information et abordent peu la question
de l&#8217;extraction d&#8217;information d&#8217;une part sur des conversations t&#233;l&#233;phoniques, au sein desquelles
les sp&#233;cificit&#233;s de la parole spontan&#233;e sont plus fr&#233;quentes, et d&#8217;autre part sur des donn&#233;es
en domaine restreint. On peut tout de m&#234;me citer le projet Luna 1, ax&#233; sur la compr&#233;hension
temps-r&#233;el de la parole spontan&#233;e, et notamment sur la d&#233;tection de th&#232;mes dans un contexte de
dialogue homme-machine (corpus MEDIA, (Bonneau-Maynard et al., 2006)).
</p>
<p>Notre objectif est d&#8217;explorer la possible utilisation sur des donn&#233;es en domaine restreint de
typologies d&#8217;EN &#233;labor&#233;es pour des donn&#233;es en domaine ouvert, en se basant sur une comparaison
entre entit&#233;s g&#233;n&#233;riques et entit&#233;s sp&#233;cialis&#233;es. Nous nous focalisons dans cette &#233;tude sur des
transcriptions manuelles de conversations en centres d&#8217;appel. Nous avons pour cela annot&#233;
manuellement un corpus en entit&#233;s g&#233;n&#233;riques structur&#233;es d&#233;finies dans (Grouin et al., 2011)
pour le projet Quaero ainsi qu&#8217;en entit&#233;s m&#233;tier d&#233;finies par EDF. 2
</p>
<p>Apr&#232;s un aper&#231;u des travaux sur la d&#233;finition des EN ainsi qu&#8217;une description des mod&#232;les retenus
pour cette &#233;tude (section 2), nous d&#233;crivons les exp&#233;riences d&#8217;annotation que nous avons men&#233;es
autour de la comparaison d&#8217;entit&#233;s (section 3). Nous pr&#233;sentons ensuite les r&#233;sultats de cette
&#233;tude (section 4) puis nos perspectives de recherche (section 5).
</p>
<p>2 Entit&#233;s nomm&#233;es g&#233;n&#233;riques et entit&#233;s d&#8217;int&#233;r&#234;t sp&#233;cifiques
</p>
<p>2.1 Positionnement
</p>
<p>Les EN sont traditionnellement d&#233;finies en r&#233;f&#233;rence aux trois classes d&#233;velopp&#233;es pour la t&#226;che
de reconnaissance d&#8217;entit&#233;s de la conf&#233;rence MUC-6 3 : ENAMEX (noms de personnes, de lieux
et d&#8217;organisations), TIMEX (expressions temporelles) et NUMEX (expressions num&#233;riques de
pourcentages et de monnaies). Cette premi&#232;re d&#233;finition a depuis &#233;t&#233; &#233;largie : ainsi, les EN sont
pr&#233;sent&#233;es comme suit dans (ESTER2, 2008) : &#171; les EN sont des types particuliers d&#8217;unit&#233;s lexicales
(groupes de mots) qui font r&#233;f&#233;rence &#224; une entit&#233; du monde concret dans certains domaines
sp&#233;cifiques [. . .] et qui ont un nom (typiquement un nom propre ou un acronyme) &#187;. Cette
d&#233;finition a servi de base &#224; l&#8217;&#233;laboration des entit&#233;s structur&#233;es du projet Quaero (Grouin et al.,
</p>
<p>1. http://www.ist-luna.eu/project_description.htm
2. (Danesi et Clavel, 2010) ont abord&#233; la probl&#233;matique de la d&#233;tection d&#8217;entit&#233;s m&#233;tier EDF &#224; partir de transcriptions
</p>
<p>automatiques de conversations en centres d&#8217;appel, ce travail s&#8217;appuyant sur les transcriptions manuelles du m&#234;me corpus.
La question de l&#8217;impact des erreurs de reconnaissance automatique de la parole n&#8217;est pas abord&#233;e dans notre &#233;tude.
</p>
<p>3. http://www.cs.nyu.edu/cs/faculty/grishman/NEtask20.book_1.html
</p>
<p>360</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2011; Rosset et al., 2011), qui propose d&#8217;&#233;tendre leur port&#233;e &#224; des expressions ne comportant
pas de noms propres. (Sekine et al., 2002) proposent une typologie hi&#233;rarchique et &#233;tendue avec
pr&#232;s de 200 cat&#233;gories. Les trois classes d&#233;crites supra ont &#233;t&#233; enrichies d&#8217;autres types d&#8217;entit&#233;s,
comme les produits (Sekine et Nobata, 2004) ou les fonctions (Galliano et al., 2009). La notion
recouvrant une r&#233;alit&#233; s&#233;mantico-lexicale de plus en plus large, l&#8217;appellation m&#234;me d&#8217;&#171; entit&#233;
nomm&#233;e &#187; para&#238;t parfois restrictive. La campagne ESTER2, du fait de l&#8217;int&#233;gration des temps et
montants, parle d&#8217;&#171; entit&#233;s sp&#233;cifiques &#187;. Dans cette &#233;tude, nous pr&#233;f&#232;rerons le terme &#171; entit&#233;s
d&#8217;int&#233;r&#234;t &#187; &#224; &#171; entit&#233;s nomm&#233;es &#187;.
</p>
<p>(Ehrmann, 2008) analyse la probl&#233;matique des EN du point de vue th&#233;orique des difficult&#233;s
d&#233;finitoires et cat&#233;gorielles, proposant la d&#233;finition suivante : &#171; &#233;tant donn&#233;s un mod&#232;le applicatif
et un corpus, on appelle EN toute expression linguistique qui r&#233;f&#232;re &#224; une entit&#233; unique du
mod&#232;le de mani&#232;re autonome dans le corpus &#187;. Cette d&#233;finition d&#233;pendante d&#8217;un corpus fait
&#233;cho aux travaux de (Boufaden, 2004), celle-ci &#233;tudiant l&#8217;ad&#233;quation d&#8217;EN traditionnelles &#224; un
corpus sp&#233;cialis&#233; dans un cadre d&#8217;extraction d&#8217;information sur des transcriptions de conversations
t&#233;l&#233;phoniques. Cette &#233;tude met en avant la diff&#233;rence d&#8217;actualisation lexicale entre les EN
classiques et les entit&#233;s d&#8217;int&#233;r&#234;t en domaine restreint. Nous nous sommes pench&#233;s sur l&#8217;&#233;tude
d&#8217;une telle approche contrastive des EN dites g&#233;n&#233;riques &#8211; dans la mesure o&#249; leur d&#233;finition tend
vers une extension s&#233;mantique ind&#233;pendante d&#8217;un corpus sp&#233;cifique et d&#8217;un domaine pr&#233;cis &#8211; et
des entit&#233;s propres &#224; un domaine en confrontant le mod&#232;le Quaero &#224; un mod&#232;le issu du domaine
du corpus d&#8217;&#233;tude, la relation entre EDF et ses clients.
</p>
<p>2.2 Entit&#233;s g&#233;n&#233;riques : le mod&#232;le Quaero
</p>
<p>Le mod&#232;le d&#8217;entit&#233;s du projet Quaero, d&#233;fini dans (Grouin et al., 2011), se diff&#233;rencie des
d&#233;finitions classiques par deux aspects : i) les entit&#233;s sont &#233;tendues &#224; des expressions ne contenant
pas de noms propres et ii) les entit&#233;s sont structur&#233;es gr&#226;ce &#224; des sous-types et composants 4. Les
diff&#233;rents types et sous-types du mod&#232;le, d&#233;crits dans (Rosset et al., 2011), sont pr&#233;sent&#233;s dans
la table 1. Les composants d&#233;crits dans le mod&#232;le n&#8217;ont pas &#233;t&#233; utilis&#233;s pour notre &#233;tude.
</p>
<p>Types Sous-types et/ou Exemples
Personne individuelle, collective (ex. Bertrand Delano&#235;)
Fonction individuelle, collective (ex. le maire de Paris)
Organisation entreprise, administration (ex. le parti socialiste)
Localisation administrative, physique, voie, b&#226;timent, adresse (ex. Paris)
Production
humaine
</p>
<p>marque, &#339;uvre, production m&#233;diatique, produit financier, logiciel, prix, ligne de trans-
port, doctrine, loi/accord (ex. socialisme)
</p>
<p>Quantit&#233; (ex. un car de CRS)
Point dans le temps date absolue/relative, heure absolue/relative (ex. le second Empire)
&#201;v&#233;nement (ex. la coupe du monde)
</p>
<p>TABLE 1 &#8211; Entit&#233;s nomm&#233;es structur&#233;es du projet Quaero
</p>
<p>4. Par exemple, l&#8217;entit&#233; &#171; Bertrand Delano&#235; &#187; sera typ&#233;e personne individuelle et chacun de ses composants &#171; Bertrand &#187;
et &#171; Delano&#235; &#187; sera respectivement sous-typ&#233; pr&#233;nom et nom.
</p>
<p>361</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.3 Entit&#233;s d&#8217;int&#233;r&#234;t m&#233;tier : le mod&#232;le EDF
</p>
<p>Les entit&#233;s d&#233;finies &#224; l&#8217;EDF correspondent &#224; des concepts m&#233;tier identifi&#233;s par des experts du
domaine. Elles ne rel&#232;vent pas d&#8217;une terminologie globale &#224; l&#8217;&#233;chelle de l&#8217;entreprise, comme
le serait une ontologie, mais constituent une multitude de mod&#232;les &#233;labor&#233;s en fonction i)
d&#8217;un besoin applicatif (formation des conseillers client&#232;le, analyse marketing...) et ii) d&#8217;un type
de donn&#233;es (champs de commentaires r&#233;dig&#233;s par le conseiller suite &#224; un appel, enqu&#234;tes de
satisfaction...). De plus, tout comme les entit&#233;s Quaero &#233;largissent le champ des EN traditionnelles,
les entit&#233;s d&#8217;int&#233;r&#234;t EDF recouvrent une r&#233;alit&#233; lexicale de taille et de composition variables au
travers de segments correspondant aux expressions caract&#233;risant les concepts m&#233;tier. Nous avons
s&#233;lectionn&#233; un mod&#232;le d&#8217;entit&#233;s d&#8217;int&#233;r&#234;t tr&#232;s sp&#233;cifique &#233;labor&#233; afin d&#8217;identifier les motifs des
r&#233;clamations, des probl&#232;mes techniques aux probl&#232;mes de contact (pr&#233;sent&#233; en table 2).
</p>
<p>Concepts Sous-Concepts et/ou Exemples
Facturation Index (ex. facture estim&#233;e) ; Rel&#232;vement/Redressement (ex. facture rectificative) ;
</p>
<p>Recouvrement/Relance (ex. relance pour impay&#233;s) ; Paiement (ex. mensualisation)
Incident technique Assurance (ex. direct assurance) ; Panne (ex. l&#8217;ordinateur a grill&#233;) ; Sinistre (ex.
</p>
<p>temp&#234;te) ; Coupure/Surtension (ex. coupure de courant)
Intervention technique Rel&#232;ve (ex. l&#8217;agent de rel&#232;ve) ; Autre hors rel&#232;ve (ex. d&#233;pannage) ; Frais d&#8217;interven-
</p>
<p>tion (ex. frais de d&#233;dit)
</p>
<p>Contact Attente (ex. veuillez patienter) ; Accueil
Traitement de la demande D&#233;lai ; &#201;changes client-agent
Prix (ex. moins cher)
Contrat/Tarif (ex. Jours tempo)
Vente directe Offres EDF (ex. Suivi conso)
Agence en ligne (ex. site Internet EDF bleu ciel)
Concurrence (ex. Pow&#233;o)
</p>
<p>Autre Entit&#233;s d&#8217;int&#233;r&#234;t EDF ne relevant pas de la th&#233;matique r&#233;clamation
</p>
<p>TABLE 2 &#8211; Entit&#233;s d&#8217;int&#233;r&#234;t EDF orient&#233;es &#171; r&#233;clamation &#187;
</p>
<p>3 Exp&#233;riences
</p>
<p>Afin de confronter les deux mod&#232;les d&#8217;entit&#233;s d&#233;crits en section 2 sur un corpus li&#233; au mod&#232;le
sp&#233;cifique EDF, nous avons s&#233;lectionn&#233; un corpus compos&#233; de conversations issues de centres
d&#8217;appel (section 3.1) que nous avons annot&#233; manuellement en entit&#233;s Quaero et EDF (section 3.2).
</p>
<p>3.1 Le corpus CallSurf
</p>
<p>Dans le cadre du projet Infom@gic &#8211; CallSurf (Garnier-Rizet et al., 2008), EDF a effectu&#233; une
campagne d&#8217;enregistrement au sein d&#8217;un de ses centres d&#8217;appel : dix agents volontaires ont
&#233;t&#233; enregistr&#233;s durant quatre mois lors de leurs appels avec des clients professionnels. Cette
campagne a permis de constituer un large corpus de parole spontan&#233;e (5 755 appels, 620 heures
de conversations) dont les caract&#233;ristiques sont d&#233;taill&#233;es dans (Danesi et Clavel, 2010). Les
auteures ont relev&#233; les sp&#233;cificit&#233;s propres &#224; l&#8217;oral de ce corpus (par exemple les ph&#233;nom&#232;nes li&#233;s
au travail de mise en mots et les effets disfluents).
</p>
<p>362</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Notre corpus de d&#233;veloppement, le corpus Cal10, est compos&#233; de transcriptions manuelles pro-
duites &#224; l&#8217;aide de Transcriber (Barras et al., 1998). Le corpus Cal10 est compos&#233; de 90 appels
t&#233;l&#233;phoniques soit environ 10h de signal en langue fran&#231;aise ; ses principales caract&#233;ristiques
sont pr&#233;sent&#233;es en table 3.
</p>
<p>Nous en avons extrait &#8211; via un tirage al&#233;atoire &#8211; un sous-corpus Cal10a de 10 conversations, soit
environ 10 000 mots r&#233;partis sur 2 250 tours de parole.
</p>
<p>Nombre d&#8217;appels 90
Nombre de tours de parole 12 825 (moy. 142,5 / appel)
Nombre de locuteurs moy. 2,3 / appel
Nombre de mots 100 677 (moy. 1 118,6 / appel &#8211; 3,6 / sec.)
Dur&#233;e des tours de parole 08 : 22 : 16 (moy. 00 : 00 : 02)
Dur&#233;e totale retranscrite 08 : 51 : 20
</p>
<p>TABLE 3 &#8211; Caract&#233;ristiques g&#233;n&#233;rales du corpus Cal10
</p>
<p>3.2 Annotation manuelle en entit&#233;s d&#8217;int&#233;r&#234;t
</p>
<p>Deux annotateurs ont respectivement annot&#233; la totalit&#233; du corpus Cal10a en entit&#233;s Quaero et en
entit&#233;s EDF, avec la plateforme d&#8217;annotation Glozz (Widl&#246;cher et Mathet, 2009) 5. L&#8217;objectif de
cette &#233;tude consistant en une comparaison de la couverture d&#8217;un mod&#232;le d&#8217;entit&#233;s g&#233;n&#233;riques
et d&#8217;un mod&#232;le d&#8217;entit&#233;s sp&#233;cifiques sur un corpus en domaine restreint, nous avons cr&#233;&#233; deux
mod&#232;les d&#8217;annotation : l&#8217;un pour les entit&#233;s Quaero et l&#8217;autre pour les entit&#233;s d&#8217;int&#233;r&#234;t EDF. La
figure 1 pr&#233;sente un aper&#231;u de l&#8217;interface Glozz. Le texte annot&#233; comporte l&#8217;entit&#233; EDF &#171; il
y a pas les heures creuses &#187; (cat&#233;gorie contrat) recouvrant l&#8217;entit&#233; Quaero &#171; heures creuses &#187;
(cat&#233;gorie production humaine).
</p>
<p>FIGURE 1 &#8211; Aper&#231;u de Glozz cadrant un tour de parole annot&#233;
</p>
<p>4 R&#233;sultats
</p>
<p>Suite &#224; l&#8217;annotation manuelle du corpus, 368 entit&#233;s Quaero et 273 entit&#233;s EDF ont &#233;t&#233; identifi&#233;es
dans notre corpus, soit en moyenne 0,3 entit&#233;s Quaero et 0,2 entit&#233;s EDF par tour de parole
&#233;quivalent &#224; une entit&#233; Quaero tous les 31 mots environ et une entit&#233; EDF tous les 42 mots
environ. La figure 2 pr&#233;sente la r&#233;partition des entit&#233;s EDF et Quaero (les entit&#233;s absentes du
corpus ne sont pas apparentes), r&#233;partition in&#233;gale et ce au sein des deux mod&#232;les.
</p>
<p>5. Glozz permet l&#8217;annotation d&#8217;unit&#233;s de granularit&#233; variable (caract&#232;re, mot, phrase, paragraphe, etc.), de relations
entre ces unit&#233;s et de sch&#233;mas, constructions complexes de relations.
</p>
<p>363</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 2 &#8211; R&#233;partitions des entit&#233;s EDF et Quaero par cat&#233;gorie
</p>
<p>Concernant les entit&#233;s d&#8217;int&#233;r&#234;t EDF, la cat&#233;gorie autre est la plus pr&#233;sente (41% des entit&#233;s sont
de ce type) : cette cat&#233;gorie concerne des entit&#233;s d&#8217;int&#233;r&#234;t pour EDF ne rel&#232;vant pas du mod&#232;le
choisi ; l&#8217;on observe ainsi que la th&#233;matique de la r&#233;clamation clients ne repr&#233;sente qu&#8217;une partie
des termes m&#233;tier pr&#233;sents dans le corpus. Au sein du mod&#232;le, 32% des entit&#233;s concernent un
traitement de la demande ; les autres types d&#8217;entit&#233;s sont relativement peu pr&#233;sents dans notre
corpus. Concernant les entit&#233;s Quaero, la r&#233;partition est davantage homog&#232;ne : environ 25%
des entit&#233;s sont de type personne, ce qui est logique compte tenu de la teneur informationnelle
du corpus (l&#8217;agent est tenu de se pr&#233;senter ainsi que l&#8217;entreprise, et les r&#233;f&#233;rences client &#8211; y
compris son nom et le nom de son entreprise &#8211; sont fr&#233;quemment rappel&#233;es) 6. La forte pr&#233;sence
d&#8217;entit&#233;s de type localisation (19%) participe &#233;galement de cette teneur informationnelle. La
table 4 pr&#233;sente des informations concernant le chevauchement des deux mod&#232;les : le nombre
d&#8217;entit&#233;s relevant des deux mod&#232;les est relativement faible (respectivement 23,8% des entit&#233;s
EDF et 17,7% des entit&#233;s Quaero). Ce r&#233;sultat rel&#232;ve en fait d&#8217;un double aspect : certaines entit&#233;s
Quaero sont peu repr&#233;sent&#233;es dans notre corpus (fonction, &#233;v&#233;nement), en raison d&#8217;une diff&#233;rence
th&#233;matique justifi&#233;e, alors que d&#8217;autres parmi les plus fr&#233;quentes (personne) ne sont pas prises en
compte par le mod&#232;le EDF.
</p>
<p>Entit&#233;s EDF ayant au moins un mot en commun avec une entit&#233; Quaero 23,8 %
Entit&#233;s Quaero ayant au moins un mot en commun avec une entit&#233; EDF 17,7 %
Entit&#233;s EDF n&#8217;ayant aucun recouvrement avec le mod&#232;le Quaero 76,2 %
Entit&#233;s Quaero n&#8217;ayant aucun recouvrement avec le mod&#232;le EDF 82,3 %
</p>
<p>TABLE 4 &#8211; Recouvrement des mod&#232;les d&#8217;entit&#233;s Quaero et EDF sur le corpus EDF
</p>
<p>Le corpus ayant servi pour l&#8217;annotation comporte 11 429 mots, dont 2 413 ont &#233;t&#233; annot&#233;s (soit
environ 21% de la totalit&#233; du corpus).
</p>
<p>Les tables 5 et 6 pr&#233;sentent la couverture des deux mod&#232;les d&#8217;entit&#233;s ainsi que leur intersection
eu &#233;gard &#224; l&#8217;ensemble des mots du corpus (table 5) et &#224; l&#8217;ensemble des mots annot&#233;s dans le
corpus (table 6). Bien que davantage d&#8217;entit&#233;s Quaero aient &#233;t&#233; identifi&#233;es, elles concernent
seulement 6% des mots annot&#233;s ; de plus, elles sont en moyenne compos&#233;es de 1,8 mot (contre
</p>
<p>6. Les donn&#233;es ayant &#233;t&#233; anonymis&#233;es, en accord avec les exigences de la CNIL, l&#8217;annotation en noms de personnes a
&#233;t&#233; effectu&#233;e gr&#226;ce &#224; la pr&#233;sence de labels de remplacement tels NOMPERS, NOMSOCIETE, etc.
</p>
<p>364</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>6,9 pour les entit&#233;s EDF). Ces chiffres sont coh&#233;rents avec la d&#233;finition des deux mod&#232;les, les
entit&#233;s d&#8217;int&#233;r&#234;t EDF identifiant des expressions allant au del&#224; du syntagme nominal.
</p>
<p>Mod&#232;le Taux de mots annot&#233;s
EDF 15 %
Quaero 4,5 %
Intersection 1,5 %
Union 21 %
</p>
<p>TABLE 5 &#8211; Couverture des entit&#233;s relatives
&#224; l&#8217;ensemble des mots du corpus
</p>
<p>Mod&#232;le Taux de mots annot&#233;s
EDF 71,86 %
Quaero 21,59 %
Intersection 6,55 %
Union 100 %
</p>
<p>TABLE 6 &#8211; Couverture des entit&#233;s relatives
&#224; l&#8217;ensemble des mots annot&#233;s du corpus
</p>
<p>Une comparaison des d&#233;finitions des mod&#232;les permet d&#8217;&#233;tablir un rapprochement s&#233;mantique
entre certaines classes ; nous avons cherch&#233; &#224; savoir si ces classes s&#8217;actualisaient de la m&#234;me
mani&#232;re dans notre corpus. En prenant le mod&#232;le Quaero comme r&#233;f&#233;rence, nous observons
notamment que 15,3% des mots annot&#233;s point dans le temps &#233;taient &#233;galement annot&#233;s de-
mande/d&#233;lai dans le mod&#232;le EDF. De m&#234;me, 23,6% des mots annot&#233;s quantit&#233; rel&#232;vent des types
EDF vente ou prix. Enfin, 48,6% des mots annot&#233;s production humaine rel&#232;vent &#233;galement du type
EDF contrat. En revanche, seul 1,6% des mots relevant du mod&#232;le Quaero (tous types confondus)
fait partie de la classe autre du mod&#232;le EDF.
</p>
<p>5 Conclusions &amp; Perspectives
</p>
<p>Nous avons mis en avant la pr&#233;sence partielle d&#8217;un mod&#232;le d&#8217;entit&#233;s g&#233;n&#233;riques comme Quaero
d&#232;s lors qu&#8217;il est appliqu&#233; &#224; un corpus de textes issus d&#8217;un domaine pr&#233;cis, eu &#233;gard aux entit&#233;s
d&#8217;int&#233;r&#234;t m&#233;tier pour une entreprise.
</p>
<p>Notre &#233;tude laisse toutefois appara&#238;tre un lien non n&#233;gligeable entre les deux mod&#232;les consid&#233;r&#233;s,
gr&#226;ce au fort recouvrement entre certains types Quaero et EDF : nous souhaitons approfondir cet
aspect en &#233;tudiant les segments textuels identifi&#233;s dans chaque mod&#232;le, par types et sous-types.
Ces &#233;quivalences sont encourageantes pour la suite de nos travaux : nous souhaitons en effet
nous pencher sur la d&#233;tection d&#8217;EN en soutient &#224; l&#8217;extraction d&#8217;entit&#233;s m&#233;tier.
</p>
<p>Nous continuons cette d&#233;marche comparative doublement enrichissante pour affiner les th&#233;-
matiques propres au domaine mais aussi pour &#233;laborer des mod&#232;les facilement adaptables aux
diff&#233;rents volets du corpus analys&#233; ou &#224; d&#8217;autres corpus conversationnels, en mesurant plus
finement l&#8217;&#233;cart observ&#233; entre mod&#232;le g&#233;n&#233;rique et sp&#233;cifique.
</p>
<p>Par ailleurs, un volet essentiel que nous souhaitons &#233;tudier est l&#8217;impact des erreurs de reconnais-
sance automatique de la parole sur la d&#233;tection des entit&#233;s d&#8217;int&#233;r&#234;t EDF, dans la continuit&#233; des
travaux initi&#233;s par (Danesi et Clavel, 2010) : un travail de mise en rapport des r&#233;sultats de la
d&#233;tection d&#8217;entit&#233;s sur les transcriptions manuelles et automatiques repr&#233;sente un objectif crucial
du travail futur. Par exemple, de nombreuses erreurs d&#8217;analyse concernent les noms propres
(personnes, lieux...), comme en t&#233;moigne l&#8217;exemple suivant : &#171; j&#8217;habite &#224; Beauvoisin &#187; analys&#233;
&#171; j&#8217;habite &#224; vos voisins &#187;. Nous souhaitons &#233;tudier les m&#233;thodes existantes de reconnaissance des
EN afin de pallier ce type d&#8217;erreurs.
</p>
<p>365</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>BARRAS, C., GEOFFROIS, E., WU, Z. et LIBERMAN, M. (1998). Transcriber : a Free Tool for
Segmenting, Labeling and Transcribing Speech. In Proceedings of LREC&#8217;98.
</p>
<p>BONNEAU-MAYNARD, H., AYACHE, C., BECHET, F., DENIS, A., KUHN, A., LEFEVRE, F., MOSTEFA, D.,
QUIGNARD, M., ROSSET, S., SERVAN, C. et VILLANEAU, J. (2006). Results of the French Evalda-Media
evaluation campaign for literal understanding. In Proceedings of LREC&#8217;06.
</p>
<p>BOUFADEN, N. (2004). Extraction d&#8217;information &#224; partir de transcriptions de conversations
t&#233;l&#233;phoniques sp&#233;cialis&#233;es. Th&#232;se de doctorat, Universit&#233; de Montr&#233;al.
</p>
<p>DANESI, C. et CLAVEL, C. (2010). Impact of Spontaneous Speech Features on Business Concept
Detection : a Study of Call-Centre Data. In Proceedings of the ACM Multimedia SSCS Workshop.
</p>
<p>EHRMANN, M. (2008). Les Entit&#233;s Nomm&#233;es, de la linguistique au TAL : Statut th&#233;orique et
m&#233;thodes de d&#233;sambigu&#239;sation. Th&#232;se de doctorat, Universit&#233; Paris 7 &#8211; Denis Diderot.
</p>
<p>ESTER2 (2008). ESTER2, Convention d&#8217;annotation en Entit&#233;s Nomm&#233;es, Dates, heures et montants.
</p>
<p>GALLIANO, S., GRAVIER, G. et CHAUBARD, L. (2009). The ESTER 2 Evaluation Campaign for the
Rich Transcription of French Radio Broadcasts. In Proceedings of Interspeech&#8217;09.
</p>
<p>GARNIER-RIZET, M., ADDA, G., CAILLIAU, F., GAUVAIN, J.-L., GUILLEMIN-LANNE, S. et LAMEL, L. (2008).
Callsurf : Automatic transcription, indexing and structuration of call center conversational
speech for knowledge extraction and query by content. In Proceedings of LREC&#8217;08.
</p>
<p>GROUIN, C., ROSSET, S., ZWEIGENBAUM, P., FORT, K. et QUINTARD, L. (2011). Proposal for an
Extension of Traditional Named Entities : From Guidelines to Evaluation, an Overview. In
Proceedings of Linguistic Annotation Workshop.
</p>
<p>ROSSET, S., GROUIN, C. et ZWEIGENBAUM, P. (2011). Entit&#233;s nomm&#233;es structur&#233;es : guide d&#8217;annota-
tion Quaero. LIMSI-CNRS.
</p>
<p>SEKINE, S. et NOBATA, C. (2004). Definition, dictionaries and tagger for Extended Named Entity
Hierarchy. In Proceedings of LREC&#8217;04.
</p>
<p>SEKINE, S., SUDO, K. et NOBATA, C. (2002). Extended Named Entity Hierarchy. In Proceedings of
LREC&#8217;02.
</p>
<p>WIDL&#214;CHER, A. et MATHET, Y. (2009). La plateforme Glozz : environnement d&#8217;annotation et
d&#8217;exploration de corpus. In Actes de TALN&#8217;09.
</p>
<p>366</p>

</div></div>
</body></html>