<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Effacement de dimensions de similarit&#233; textuelle pour l&#8217;exploration de collections de rapports d&#8217;incidents a&#233;ronautiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 439&#8211;446,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Effacement de dimensions de similarit&#233; textuelle pour
l&#8217;exploration de collections de rapports d&#8217;incidents
</p>
<p>a&#233;ronautiques
</p>
<p>Tulechki Nikola1,2 Tanguy Ludovic1
(1) CLLE-ERSS : CNRS et Universit&#233; de Toulouse 2, 5 all&#233;es Antonio Machado, 31058 Toulouse CEDEX 9
</p>
<p>(2) Conseil en Facteurs Humains, 4 impasse Montcabrier. 31500 Toulouse
{tanguy,tulechki}@univ-tlse2.fr
</p>
<p>R&#201;SUM&#201;
Cet article &#233;tudie le lien entre la similarit&#233; textuelle et une classification extrins&#232;que dans des
collections de rapports d&#8217;incidents a&#233;ronautiques. Nous cherchons &#224; compl&#233;ter les strat&#233;gies
d&#8217;analyse de ces collections en &#233;tablissant automatiquement des liens de similarit&#233; entre les
documents de fa&#231;on &#224; ce qu&#8217;ils ne refl&#232;tent pas l&#8217;organisation des sch&#233;mas de codification utilis&#233;s
pour leur classement. Afin de mettre en &#233;vidence les dimensions de variation transversales &#224; la
classification, nous calculons un score de d&#233;pendance entre les termes et les classes et excluons
du calcul de similarit&#233; les termes les plus corr&#233;l&#233;s &#224; une classe donn&#233;e. Nous montrons par
une application sur 500 documents que cette m&#233;thode permet effectivement de d&#233;gager des
th&#233;matiques qui seraient pass&#233;es inaper&#231;ues au vu de la trop grande saillance des similarit&#233;s de
haut niveau.
</p>
<p>ABSTRACT
Deletion of dimensions of textual similarity for the exploration of collections of accident
reports in aviation
</p>
<p>In this paper we study the relationship between external classification and textual similarity
in collections of incident reports. Our goal is to complement the existing classification-based
analysis strategies by automatically establishing similarity links between documents in such a
way that they do not reflect the dominant organisation of the classification schemas. In order to
discover such transversal dimensions of similarity, we compute association scores between terms
and classes and exlude the most correlated terms from the similarity calculation. We demonstrate
on a 500 document corpus that by using this method, we can isolate topics that would otherwise
have been masked by the dominant dimensions of similarity in the collection.
</p>
<p>MOTS-CL&#201;S : similarit&#233; textuelle, classification de documents, corpus sp&#233;cialis&#233;.
</p>
<p>KEYWORDS: textual simliarity, document classification, specialised corpora.
</p>
<p>439</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction et contexte applicatif
</p>
<p>Dans toute industrie &#224; risque, le retour d&#8217;exp&#233;rience (REX) occupe une place capitale dans les
m&#233;canismes de gestion de la s&#251;ret&#233;. Des politiques de recueil, d&#8217;analyse et de stockage sont mises
en place afin de garder une trace de tout &#233;v&#232;nement qui s&#8217;&#233;carte de la norme, de tout incident ou
accident qui survient lors des op&#233;rations. Les informations ainsi recueillies servent ensuite de
support aux experts de s&#251;ret&#233; pour mettre &#224; jour les r&#232;gles et les proc&#233;dures d&#8217;exploitation en les
adaptant &#224; un contexte en perp&#233;tuelle &#233;volution.
</p>
<p>1.1 Texte et codification des rapports d&#8217;incidents a&#233;ronautiques
</p>
<p>L&#8217;objet de notre &#233;tude est un sous-ensemble particulier de REX, les rapports de type Aircraft
Safety Report (ASR) recueillis dans le service de s&#233;curit&#233; de la compagnie a&#233;rienne Air France.
Les ASR sont des textes relativement courts (105 mots en moyenne) r&#233;dig&#233;s par les pilotes
eux-m&#234;mes imm&#233;diatement ou peu apr&#232;s qu&#8217;un incident s&#8217;est produit, et d&#233;crivant celui-ci en
langage libre. Lorsqu&#8217;ils sont soumis, ces rapports sont saisis dans la base de donn&#233;es de la
compagnie et enrichis d&#8217;un certain nombre d&#8217;informations factuelles, telles que le mod&#232;le de
l&#8217;avion, les conditions m&#233;t&#233;o, la localisation ou encore le poids de l&#8217;appareil le jour de l&#8217;incident.
</p>
<p>Ensuite les rapports subissent une premi&#232;re analyse visant &#224; &#8220;coder&#8221; l&#8217;&#233;v&#232;nement suivant un
sch&#233;ma pr&#233;&#233;tabli. Un sch&#233;ma de codification est une abstraction d&#8217;un sc&#233;nario d&#8217;accident, com-
pos&#233;e de plusieurs taxonomies de codes en rapport avec diff&#233;rents aspects d&#8217;un accident. En
pratique, l&#8217;expert en charge du codage doit d&#233;crire l&#8217;&#233;v&#232;nement en utilisant quelques centaines de
codes, &#224; partir de listes ferm&#233;es. (Voir (Ponvert, 2009) pour les d&#233;tails de l&#8217;&#233;laboration et la mise
en place du sch&#233;ma de codification actuel d&#8217;Air France). Une fois cod&#233;s, les rapports sont stock&#233;s
dans la base de donn&#233;es et peuvent &#234;tre interrog&#233;s via des requ&#234;tes portant sur les informations
factuelles et la codification. Un expert peut ainsi, par exemple, extraire de la base l&#8217;ensemble
d&#8217;incidents, o&#249; il y a eu une panne du radar m&#233;t&#233;o, dans un Boeing 747 survenue lorsque l&#8217;avion
&#233;tait en phase de mont&#233;e initiale.
</p>
<p>1.2 Limites de la codification
</p>
<p>Avec du recul, on peut voir le proc&#233;d&#233; de codification comme un effort visant &#224; ma&#238;triser la
variation inh&#233;rente des rapports afin d&#8217;atteindre un niveau d&#8217;abstraction suffisamment stable
pour une exploitation informatis&#233;e d&#8217;une base de REX. Sans rentrer dans les d&#233;tails, nous dirons
que cet effort est n&#233;cessairement accompagn&#233; d&#8217;un appauvrissement du contenu informationnel
directement accessible aux experts. Le fait de r&#233;duire un texte &#224; un squelette pr&#233;d&#233;termin&#233; a pour
effet de ne garder que les &#233;l&#233;ments les plus saillants de l&#8217;&#233;v&#232;nement au d&#233;triment de subtilit&#233;s
qui, tout en &#233;tant pr&#233;sentes dans le texte original, ne trouvent pas leur place dans la codification.
</p>
<p>Une autre limite de ces strat&#233;gies est leur caract&#232;re intrins&#232;quement r&#233;actif. Un sch&#233;ma de
codification est une repr&#233;sentation de la r&#233;alit&#233; fig&#233;e &#224; un instant pr&#233;cis, alors que la r&#233;alit&#233;
qu&#8217;elle refl&#232;te est en perp&#233;tuelle &#233;volution. Toute changement majeur du contexte doit &#234;tre refl&#233;t&#233;
dans le sch&#233;ma, ce qui correspond &#224; un effort consid&#233;rable et prends un temps pr&#233;cieux aux
experts, pendant lequel un risque nouvellement apparu peut se trouver sans code associ&#233;.
</p>
<p>440</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1.3 Objectifs applicatifs
</p>
<p>Conscients des limites des strat&#233;gies d&#8217;analyse des REX par codification, notre objectif est de
concevoir des techniques et outils venant en compl&#233;ment de ces strat&#233;gies et permettant aux
experts d&#8217;explorer les collections de rapports en fonction des particularit&#233;s de leur contenu
textuel et de leur distribution chronologique. S&#8217;affranchissant de la rigidit&#233; de la codification,
dans l&#8217;id&#233;al ces outils devront &#234;tre capables d&#8217;alerter leurs usagers de configurations particuli&#232;res
d&#8217;&#233;v&#232;nements, de tendances &#233;mergentes ou encore d&#8217;&#233;v&#232;nements anormaux (Tulechki, 2011).
</p>
<p>2 Similarit&#233; textuelle
</p>
<p>Dans un premier temps nous avons cherch&#233; &#224; rapprocher les textes en fonction de leur contenu en
utilisant des m&#233;thodes classiques en recherche d&#8217;information (RI) : la similarit&#233; cosinus (Salton
et al., 1975), une mesure du recouvrement lexical qui attribue un score compris entre 0 et 1 &#224;
chaque paire de documents dans la collection. Un score de 0 signifie une absence de termes en
commun et un score de 1 une identit&#233; compl&#232;te du contenu lexical des deux textes. Ce score est
obtenu en calculant le cosinus entre deux vecteurs dans un espace &#224; n dimensions correspondant
aux termes pr&#233;sents dans la collection.
</p>
<p>En plus de son utilisation imm&#233;diate dans des applications de type moteur de recherche, ce
calcul permet de superposer automatiquement une couche de structure sur une collection et
transformer un mat&#233;riau symbolique et qualitatif en des donn&#233;es num&#233;riques et ouvre la voie &#224;
d&#8217;autres traitements comme l&#8217;apprentissage non supervis&#233; (Steinbach et al., 2000), ou encore
la d&#233;tection d&#8217;anomalies (Chandola et al., 2009) pour en citer quelques uns. Toutefois &#224; l&#8217;heure
actuelle, nous avons pr&#233;f&#233;r&#233; tout d&#8217;abord &#233;valuer l&#8217;apport per se de la similarit&#233; textuelle en
d&#233;veloppant un outil utilisant ce calcul et en le soumettant aux experts de s&#251;ret&#233;.
</p>
<p>FIGURE 1 &#8211; Similarit&#233; de rapports d&#8217;incidents de sur un axe chronologique
</p>
<p>441</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;outil timePlot pr&#233;sent&#233; en figure 1 permet, &#224; partir d&#8217;un rapport pivot, de visualiser les rapports
similaires et leur distribution dans le temps. Les rapports sont pr&#233;sent&#233;s &#224; l&#8217;utilisateur sur
un graphique interactif qui permet un acc&#232;s direct &#224; leur contenu. Diff&#233;rentes configurations
chronologiques peuvent appara&#238;tre, comme ici le pic de rapports associ&#233;s &#224; l&#8217;&#233;ruption volcanique
du printemps 2010, ou encore des ph&#233;nom&#232;nes saisonniers, comme par exemple des incidents
li&#233;s &#224; la neige qui, naturellement, apparaissent dans les p&#233;riodes de grand froid.
</p>
<p>2.1 Limites de la similarit&#233;
</p>
<p>L&#8217;approche par similarit&#233; textuelle a connu un succ&#232;s aupr&#232;s des experts qui ont appr&#233;ci&#233; son
cot&#233; intuitif et le potentiel de rapprochement de rapports dont le lien n&#8217;est nullement refl&#233;t&#233;
par un codage commun. La logique d&#8217;utilisation simplifi&#233;e et l&#8217;intuitivit&#233; de l&#8217;interface, con&#231;ue
d&#8217;embl&#233;e comme un support &#224; une exploration de la collection sans a priori, ont aussi contribu&#233;
&#224; la validation de cette approche par ses usagers.
</p>
<p>N&#233;anmoins, nous nous sommes vite aper&#231;us que le calcul de similarit&#233;, dans notre contexte
pr&#233;cis et compte tenu des sp&#233;cificit&#233;s du mat&#233;riau textuel auquel nous avons affaire, souffrait
d&#8217;un manque de finesse &#233;vident. &#201;tant donn&#233; que l&#8217;ensemble des textes sont issus d&#8217;un domaine
tr&#232;s circonscrit, celui de l&#8217;aviation civile, ils sont tous plus ou moins similaires, la plupart parlant
d&#8217;&#8220;avions&#8221;, de &#8220;pilotes&#8221; et de &#8220;vols&#8221;. Ce fond lexical commun est en partie g&#233;r&#233; par les techniques
de pond&#233;ration, comme le TF/IDF (Sp&#228;rck-Jones, 2004), mais compte tenu de la variation
lexicale inh&#233;rente du domaine, notamment la multitude de termes 1 d&#233;signant un m&#234;me objet
qui sont employ&#233;s par les r&#233;dacteurs, des rapprochements sont faits sans pour autant designer
des facteurs de similarit&#233; pertinents pour une analyse.
</p>
<p>Une autre limite directement li&#233;e &#224; la vis&#233;e applicative de nos travaux appara&#238;t aussi. On s&#8217;aper&#231;oit
de l&#8217;existence d&#8217;un fort recouvrement entre le codage des rapports et les regroupements mises &#224;
l&#8217;&#233;vidence par le calcul de similarit&#233; textuelle. Un lien entre le termes du texte et leur codage
existe dans le corpus. Il est clair que dans les rapports parlant de chocs aviaires 2, on trouve
des termes comme &#8220;oiseau&#8221;, &#8220;mouette&#8221;, et &#8220;aviaire&#8221;. Un rapprochement bas&#233; sur ces termes
retrouvera plus ou moins la cat&#233;gorie choc aviaire qui est d&#233;j&#224; mise en &#233;vidence dans le codage.
Dit autrement, la similarit&#233; textuelle &#224; tendance de retrouver les dimensions les plus saillantes
dans le corpus, dimensions qui sont pour la plupart d&#233;j&#224; bien identifi&#233;es et refl&#233;t&#233;es dans les
sch&#233;mas de codification.
</p>
<p>Par ailleurs, un syst&#232;me de classification automatique de ces donn&#233;es, permet d&#233;j&#224;, sur la base
du contenu textuel, de proposer des codes aux experts (Hermann et al., 2008). Or, un de nos
objectifs est notamment de chercher des facteurs communs plus subtils, pouvant rapprocher des
incidents sur des crit&#232;res diff&#233;rents et transversaux au codage.
</p>
<p>3 Dimensions de la similarit&#233; textuelle
</p>
<p>La similarit&#233; textuelle, telle qu&#8217;elle est calcul&#233;e, repr&#233;sente toute parent&#233; qui peut exister entre
deux textes sur une dimension unique, sans tenir compte des multiples facteurs qui peuvent
contribuer &#224; cette parent&#233;.
</p>
<p>1. Pour parler du pilote, on trouve dans les textes le terme &#8220;pilote&#8221;, mais aussi un ensemble de termes et d&#8217;acronymes
sp&#233;cifiques au domaine comme &#8220;cdb&#8221; (commandant de bord), &#8220;opl&#8221; (officier pilote de ligne), &#8220;copilote&#8221;, &#8220;copi&#8221;, &#8220;pf&#8221; (pilot
flying), &#8220;pnf&#8221; (pilote not flying) etc.
</p>
<p>2. Il arrive tr&#232;s fr&#233;quemment que les avions percutent des oiseaux.
</p>
<p>442</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une des th&#233;matiques actuelles en recherche d&#8217;information est de regrouper les r&#233;sultats des
moteurs de recherche par th&#232;me en utilisant des m&#233;thodes de clustering, afin de mettre en
&#233;vidence les diff&#233;rentes th&#233;matiques qui sont pr&#233;sentes dans la liste des r&#233;sultats. Une requ&#234;te
comme &#8220;japon&#8221; par exemple, peut ramener des documents traitant du tourisme au japon et de
gastronomie japonaise (Navarro et al., 2011). En se basant sur les similitudes entre ces documents
un syst&#232;me d&#8217;apprentissage non supervis&#233; regroupe ensuite ces r&#233;sultats en deux paquets et
permet &#224; l&#8217;utilisateur de focaliser sa recherche sur le sous-ensemble qui l&#8217;int&#233;resse. Ces m&#233;thodes,
tout en raffinant et classant les r&#233;sultats ne peuvent pas encore g&#233;rer des collections o&#249; les
th&#233;matiques varient simultan&#233;ment sur plusieurs dimensions. Les r&#233;sultats sur le japon peuvent
concerner des localisations diff&#233;rentes (&#8220;Tokyo&#8221; et &#8220;Osaka&#8221;, par exemple) sans qu&#8217;une localisation
soit particuli&#232;rement associ&#233;e &#224; un des th&#232;mes. Un syst&#232;me de clustering peinera &#224; isoler ces deux
dimensions de variation et &#224; proposer un d&#233;coupage des r&#233;sultats selon les deux crit&#232;res (th&#232;me
et localisation) simultan&#233;ment. De travaux sont en cours visant &#224; d&#233;velopper des m&#233;thodes
efficaces de clustering avec recouvrement 3, notamment pour r&#233;pondre &#224; l&#8217;unidimensionalit&#233; des
techniques actuelles.
</p>
<p>Principalement orient&#233;es vers un usage dans un moteur de recherche &#8220;classique&#8221; et sur des
collections larges de textes h&#233;t&#233;rog&#232;nes, ces m&#233;thodes n&#8217;assument pas une organisation &#224; priori
de la collection. Or dans un corpus sp&#233;cialis&#233;, comme les bases de rapports d&#8217;incidents, les
sch&#233;mas de codification visent justement &#224; organiser la collection, de fa&#231;on pertinente compte
tenu de sp&#233;cificit&#233;s de son contexte d&#8217;utilisation, tout en int&#233;grant l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; des facteurs
de similarit&#233; et en repr&#233;sentant. Illustrons ceci par les trois exemples suivants que nous avons
construit en nous inspirant de textes r&#233;els intitul&#233;s comme suit :
</p>
<p>1) Choc aviaire au d&#233;collage.
2) Turbulences au d&#233;collage.
3) Choc aviaire &#224; l&#8217;atterrissage.
</p>
<p>Entre ces trois textes un score de similarit&#233; comparable sera calcul&#233; entre 1) et 2) et entre 1)
et 3). Pourtant, les raisons de ce rapprochement sont diff&#233;rentes dans les deux cas. 1) et 3)
traitent d&#8217;un m&#234;me type d&#8217;incident, alors que 1) et 2) partagent les circonstances dans lesquels
sont survenus des incidents diff&#233;rents. Ces deux aspects sont pris en compte dans le sch&#233;ma de
codification, gr&#226;ce aux champs &#8220;type d&#8217;incident&#8221; et &#8220;phase de vol&#8221;. Le &#8220;type d&#8217;incident&#8221; pour 1)
et 3) sera choc aviaire et turbulences pour 2). La &#8220;phase de vol&#8221; sera d&#233;collage pour 1) et 2) et
atterrissage pour 3). Nous allons donc regarder de pr&#232;s comment mettre en &#233;vidence le lien entre
le codage des rapports et leur contenu textuel.
</p>
<p>3.1 Lien entre codage et contenu
</p>
<p>Nous avons d&#233;j&#224; vu que certains termes des textes &#233;taient fortement li&#233;s &#224; certaines classes du
sch&#233;ma de codification et que ces m&#234;mes termes font en sorte que la similarit&#233; textuelle retrouve
souvent les classes du sch&#233;ma.
</p>
<p>Afin d&#8217;&#233;tudier ce lien, nous avons constitu&#233; un corpus de test en prenant des rapports traitant de
chocs aviaires et de turbulences, survenus lors de l&#8217;atterrissage et lors du d&#233;collage, de mani&#232;re &#224;
avoir une collection &#233;quilibr&#233;e que nous savons varier sur deux dimensions, la phase de vol et le
type d&#8217;incident. Le corpus est constitu&#233; de 482 rapports que nous avons choisis en nous basant
sur le codage de leur champs type d&#8217;incident et phase de vol :
</p>
<p>3. Concr&#232;tement,une telle m&#233;thode doit &#234;tre capable de classer un m&#234;me document dans plusieurs classes, en fonction
de crit&#232;res de rapprochement diff&#233;rents.
</p>
<p>443</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Turbulences Choc aviaire Total
Atterrissage 118 133 251
D&#233;collage 107 124 231
Total 225 257 482
</p>
<p>Le premier test a consist&#233; &#224; mesurer le degr&#233; de recouvrement entre similarit&#233; et cat&#233;gorisation
dans le corpus. Pour cela nous avons, pour chaque document, automatiquement s&#233;lectionn&#233; les
30 documents les plus similaires et, pour chacun de ces documents, test&#233; s&#8217;il partage la m&#234;me
valeur pour les champs type d&#8217;incident et phase de vol. En moyenne, 89% des documents partagent
la cat&#233;gorie et 75% des documents partagent la phase de vol, alors que si aucun lien entre codage
et similarit&#233; n&#8217;existait, nous nous attendrions &#224; ce que ces valeurs avoisinent les 50%.
</p>
<p>3.2 Effacement des dimensions principales
</p>
<p>Afin d&#8217;isoler les dimensions de similarit&#233;, nous avons tout d&#8217;abord cherch&#233; les termes qui sont
les plus li&#233;s &#224; chacune d&#8217;entre elles en utilisant une mesure d&#8217;interd&#233;pendance statistique :
l&#8217;information mutuelle (IM), en nous inspirant des techniques de s&#233;lection de traits utilis&#233;es en
recherche d&#8217;information (voir 4 (Manning et al., 2008, Section 13.5.1) pour l&#8217;algorithme utilis&#233;).
En RI cette technique permet, pour une collection cat&#233;goris&#233;e, de r&#233;duire l&#8217;espace des termes en
ne s&#233;lectionnant que ceux qui sont statistiquement corr&#233;l&#233;s &#224; une classe donn&#233;e. L&#8217;IM est aussi
commun&#233;ment utilis&#233;e en classification automatique. &#201;tant donn&#233; un terme t et une classe C,
plus l&#8217;information mutuelle IM(t,C) est &#233;lev&#233;e, plus t permet de correctement pr&#233;dire C.
</p>
<p>Pour la RI, l&#8217;hypoth&#232;se sous-jacente qui justifie ce proc&#233;d&#233; est que ce sont typiquement les termes
d&#233;crivant au mieux la variation relative &#224; une organisation particuli&#232;re rep&#233;r&#233;e par un humain
via une classification donn&#233;e qui seront aussi les plus performants pour l&#8217;indexation de la m&#234;me
collection. Notre objectif est exactement inverse. Nous allons exclure ces termes du calcul de
similarit&#233;, afin qu&#8217;il ne refl&#232;te pas l&#8217;organisation d&#233;j&#224; pr&#233;sente dans le sch&#233;ma de codification.
</p>
<p>Nous avons calcul&#233; l&#8217;IM entre tous les termes d&#8217;un corpus de 4450 rapports, et les 4 classes que
nous avons isol&#233;es. Voici les 5 termes les plus corr&#233;l&#233;s par cat&#233;gorie.
</p>
<p>Turbulences Choc aviaire Atterrissage D&#233;collage
1 vent aviaire approche d&#233;collage
2 turbulence collision finale pouss&#233;e
3 gaz oiseau atterrissage rotation
4 arri&#232;re impact stabilisation t/o 5
</p>
<p>5 windshear 6 7 bird7 arrondir vr 8
</p>
<p>Nous avons de nouveau mesur&#233; la moyenne de recouvrement (MR) entre similarit&#233; et codification,
mais cette fois ci en excluant soit les 50 termes les plus associ&#233;s aux deux phases de vol (phVol),
soit les 50 termes les plus associ&#233;s aux types d&#8217;&#233;v&#232;nement (typEve). Nous avons aussi calcul&#233; un
taux de perturbation (TP) en regardant, pour chaque document le nombre de documents qui
apparaissent dans les 30 documents les plus similaires lors de l&#8217;application d&#8217;un filtrage.
</p>
<p>4. version disponible en ligne &#224; http://nlp.stanford.edu/IR-book/
5. Take-off (D&#233;collage)
6. Cisaillement du vent
7. Il est tr&#232;s courant que des termes anglais soient employ&#233;s dans ces textes pourtant &#233;crits en fran&#231;ais.
8. Vitesse de rotation
</p>
<p>444</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MR phVol MR typEve TP 9
</p>
<p>Sans filtre 75% 89% -
Filtre sur phVol 64% 84% 9,8
Filtre sut typEve 73% 69% 13,6
</p>
<p>On peut voir que le recouvrement entre la similarit&#233; textuelle et une dimension donn&#233;e varie en
fonction du filtrage des termes associ&#233;s &#224; cette m&#234;me dimension, alors que le recouvrement sur
l&#8217;autre dimension est moins affect&#233;. Apr&#232;s filtrage on trouve, en moyenne, respectivement 9,8 et
13,6 nouveaux documents dans la liste des 30 premiers, ce qui t&#233;moigne de l&#8217;effet du filtrage sur
le classement des r&#233;sultats.
</p>
<p>Concr&#232;tement ceci signifie que, pour un rapport traitant de turbulences au d&#233;collage, un filtrage
des termes associ&#233;s avec les phases de vol privil&#233;giera les rapports traitant de turbulences alors
qu&#8217;un filtrage des termes associ&#233;s avec le type d&#8217;&#233;v&#232;nement privil&#233;giera les rapports traitant
d&#8217;&#233;v&#232;nements survenus lors du d&#233;collage.
</p>
<p>3.3 Dimensions transversales
</p>
<p>En effa&#231;ant ces dimensions de similarit&#233;, le filtrage des termes associ&#233;s poss&#232;de la capacit&#233; de
mettre en &#233;vidence des facteurs de similarit&#233; secondaires. Voici un exemple d&#8217;une telle dimension
qui a &#233;merg&#233; de notre corpus. Le rapport suivant traite de turbulences &#224; l&#8217;atterrissage, mais
mentionne en plus un double pilotage 10 :
</p>
<p>INCURSION VFE SUITE CISAILLEMENT EN FINALE. [REPORT]. Fort cisaillement en
finale report&#233; par les avions pr&#233;c&#233;dents. La soudainet&#233; du ph&#233;nom&#232;ne surprend
l&#8217;OPL PF. L&#233;g&#232;re incursion dans la VFE (3 ou 4 kts). R&#233;ponse des commandes
par CDB (double pilotage pendant 1 &#224; 2 s.). Avion stabilis&#233;, l&#8217;OPL reprend
les commandes. Atterrissage sans probl&#232;me. -FIN-
</p>
<p>Lorsque nous regardons la liste des rapports similaires sans filtre, au premiers rangs nous trouvons
ceux qui &#233;voquent des turbulences &#224; l&#8217;atterrissage, comme par exemple :
</p>
<p>FORT CISAILLEMENT DE VENT EN FINALE 26R CDG. [REPORT]. FORT CISAILLEMENT DE
VENT EN FINALE. -FIN-
</p>
<p>Pour le m&#234;me document, lorsque l&#8217;on filtre les termes associ&#233;s avec la phase de vol et le type
d&#8217;&#233;v&#232;nement, les rapports parlant uniquement de turbulences &#224; l&#8217;atterrissage apparaissent plus
bas dans la liste des rapports similaires et on retrouvera leur place ceux qui partagent des termes
non associ&#233;s avec les phases et les types d&#8217;&#233;v&#232;nement, notamment des rapports traitant de double
pilotage, information qui n&#8217;est pas refl&#233;t&#233;e dans le codage. Ce facteur commun permet d&#8217;&#233;tablir
un lien entre ces deux rapports, qui dans certains cas peut s&#8217;av&#233;rer pertinent pour un expert.
</p>
<p>BREF DOUBLE PILOTAGE AU DECOLLAGE. [REPORT]. OPL PF au d&#233;collage. Vent travers
avec rafales. Br&#232;ve action r&#233;flexe en lat&#233;ral du CDB pour contrer rafale et
d&#233;but d&#8217;inclinaison &#224; droite. Prise de priorit&#233; peu pertinente pour effet
imm&#233;diat. -FIN-
</p>
<p>9. Les valeurs ici sont des moyennes pour les 482 documents.
10. Double pilotage signifie que les deux pilotes agissent simultan&#233;ment sur les commandes de l&#8217;avion.
</p>
<p>445</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Conclusion et perspectives
</p>
<p>La technique que nous avons pr&#233;sent&#233;e s&#8217;inscrit dans un effort global dont l&#8217;objectif est de
proposer des outils d&#8217;exploration de collections de documents et la mise en &#233;vidence de liens
de similarit&#233; &#8220;faibles&#8221; entre les documents qui seraient autrement masqu&#233;s par la dimension
de similarit&#233; la plus saillante. D&#8217;embl&#233;e con&#231;ues pour un usage par un utilisateur averti, notre
intention est d&#8217;en &#233;valuer l&#8217;apport applicatif en les proposant &#224; des experts en s&#251;ret&#233; a&#233;rienne
sous forme d&#8217;un outil de visualisation et d&#8217;exploration permettant dynamiquement &#224; l&#8217;utilisateur
de choisir les dimensions &#224; ne pas prendre en compte lors du calcul &#224; partir d&#8217;une liste des
dimensions les plus saillantes pour le sous-ensemble en cours d&#8217;analyse. Le fait de se baser sur la
codification assure que les choix de filtres qu&#8217;auront les experts refl&#232;tent des concepts qu&#8217;ils ont
l&#8217;habitude de manipuler dans leur activit&#233; d&#8217;analyse.
</p>
<p>Disposant &#224; l&#8217;heure actuelle d&#8217;une preuve de concept, nous comptons, dans les mois qui viennent,
passer &#224; l&#8217;&#233;chelle en prenant en compte l&#8217;int&#233;gralit&#233; de la codification des collections. S&#8217;agissant de
techniques exploratoires et fortement d&#233;pendantes du domaine et de leur objectif applicatif pr&#233;cis,
nous ne sommes pas en mesure de proposer un protocole d&#8217;&#233;valuation classique et comptons
sur un &#233;valuation par l&#8217;usage et un &#233;change constant avec les usagers pour pouvoir juger de la
pertinence de ces m&#233;thodes.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CHANDOLA, V., BANERJEE, A. et KUMAR, V. (2009). Anomaly detection : A survey. ACM Computing
Surveys (CSUR), 41(3):15.
HERMANN, E., LEBLOIS, S., MAZEAU, M., BOURIGAULT, D., FABRE, C., TRAVADEL, S., DURGEAT, P. et
NOUVEL, D. (2008). Outils de Traitement Automatique des Langues appliqu&#233;s aux comptes
rendus d&#8217;incidents et d&#8217;accidents. In 16e Congr&#232;s de Ma&#238;trise des Risques et de S&#251;ret&#233; de Fonction-
nement, Avignon.
MANNING, C. D., RAGHAVAN, P. et SCH&#220;TZE, H. (2008). Introduction to information retrieval.
Cambridge University Press, New York.
NAVARRO, E., CHUDY, Y., GAUME, B., CABANAC, G. et PINEL-SAUVAGNAT, K. (2011). Kodex ou
comment organiser les r&#233;sultats d&#8217;une recherche d&#8217;information par d&#233;tection de communaut&#233;s
sur un graphe biparti ? In Actes de Coria 2011 : Conf&#233;rence en Recherche d&#8217;Information et
Applications.
PONVERT, M. (2009). D&#233;finition des besoins n&#233;cessaires &#224; la mise en place d&#8217;un Data WareHouse
dans le cadre du SGS Air France. M&#233;moire de D.E.A., &#201;cole Nationale de l&#8217;Aviation Civile.
SALTON, G., WONG, A. et YANG, C. (1975). A vector space model for automatic indexing.
Communications of the ACM, 18(11):613&#8211;620.
SP&#196;RCK-JONES, K. (2004). A statistical interpretation of term specificity and its application in
retrieval. Journal of documentation, 60(5):493&#8211;502.
STEINBACH, M., KARYPIS, G., KUMAR, V. et al. (2000). A comparison of document clustering
techniques. In KDD workshop on text mining, volume 400, pages 525&#8211;526. Boston.
TULECHKI, N. (2011). Des outils de TAL en support aux experts de s&#251;ret&#233; industrielle pour
l&#8217;exploitation de bases de donn&#233;es de retour d&#8217;exp&#233;rience. In Actes des 13&#232;mes Rencontre des
&#201;tudiants Chercheurs en Informatique pour le Traitement Automatique des Langues (RECITAL
2011).
</p>
<p>446</p>

</div></div>
</body></html>