<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Calcul des cadres de sous cat&#233;gorisation des noms d&#233;verbaux fran&#231;ais (le cas du g&#233;nitif)</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 71&#8211;84,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Calcul des cadres de sous-cat&#233;gorisation des noms d&#233;verbaux
fran&#231;ais (le cas du g&#233;nitif)
</p>
<p>Ramadan Alfared Denis B&#233;chet Alexandre Dikovsky
LINA, Universit&#233; de Nantes, 2, rue de la Houssini&#232;re, 44000 Nantes
</p>
<p>Ramadan.Alfared@etu.univ-nantes.fr
Denis.Bechet@univ-nantes.fr
</p>
<p>Alexandre.Dikovsky@univ-nantes.fr
</p>
<p>R&#201;SUM&#201;
L&#8217;analyse syntaxique fine en d&#233;pendances n&#233;cessite la connaissance des cadres de sous-
cat&#233;gorisation des unit&#233;s lexicales. Le cas des verbes &#233;tant bien &#233;tudi&#233;, nous nous int&#233;ressons
dans cet article au cas des noms communs d&#233;riv&#233;s de verbes. Notre int&#233;r&#234;t principal est de
calculer le cadre de sous-cat&#233;gorisation des noms d&#233;verbaux &#224; partir de celui du verbe d&#8217;origine
pour le fran&#231;ais. Or, pour ce faire il faut disposer d&#8217;une liste repr&#233;sentative de noms d&#233;verbaux
fran&#231;ais. Pour calculer cette liste nous utilisons un algorithme simplifi&#233; de rep&#233;rage des noms
d&#233;verbaux, l&#8217;appliquons &#224; un corpus et comparons la liste obtenue avec la liste Verbaction des
d&#233;verbaux exprimant l&#8217;action ou l&#8217;activit&#233; du verbe. Pour les noms d&#233;verbaux ainsi obtenus
et attest&#233;s ensuite par une expertise linguistique, nous analysons la provenance des groupes
pr&#233;positionnels subordonn&#233;s des d&#233;verbaux dans des contextes diff&#233;rents en tenant compte du
verbe d&#8217;origine. L&#8217;analyse est effectu&#233;e sur le corpus Paris 7 et est limit&#233;e au cas le plus fr&#233;quent
du g&#233;nitif, c&#8217;est-&#224;-dire des groupes pr&#233;positionnels introduits par de, des, etc.
</p>
<p>ABSTRACT
On Computing Subcategorization Frames of French Deverbal Nouns (Case of Genitive)
</p>
<p>Fine dependency analysis needs exact information on the subcategoriziation frames of lexical
units. These frames being well studied for the verbs, we are interested in this paper by the case
of the noun deverbals. Our main goal is to calculate the subcategoriziation frame of deverbals
in French from that of the source verb. However, this task needs a representative list of French
deverbal nouns. To obtain such a list, we use a simplified algorithm detecting deverbal nouns
in texts. The obtained list attested by linguists is compared with the existing list Verbaction of
deverbals expressing the action/activity of French verbs. For these deverbal nouns, we analyse
the origin of their subordinate prepositional phrases in different contexts relative to their source
verbs. This analysis is carried out over the corpus Paris 7 and is limited to the most frequent cases
of the genitive, i.e. to the prepositional phrases headed by the prepositions de, des, etc.
</p>
<p>MOTS-CL&#201;S : nom d&#233;verbal, cadre de sous-cat&#233;gorisation, groupe pr&#233;positionnel, analyse en
d&#233;pendances.
</p>
<p>KEYWORDS: Deverbal Noun, Subcategorization Frame, Prepositional Phrase, Dependency Tree.
</p>
<p>71</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Comparons les trois phrases suivantes :
</p>
<p>(1) Le service de livraison est ferm&#233;.
(2) Le besoin de reconnaissance est un besoin fondamental de tous les &#234;tres humains.
(3) La livraison des commandes est assur&#233;e directement par le service de livraison du producteur.
(4) On attend l&#8217;abrogation d&#233;finitive de cette loi.
</p>
<p>Nous voyons que dans chaque phrase il y a au moins un groupe pr&#233;positionnel (GP) subordonn&#233;
&#224; un nom : e.g. de livraison est subordonn&#233; &#224; service, des commandes est subordonn&#233; &#224; livraison,
du producteur est subordonn&#233; &#224; une autre occurrence de livraison. Parmi ces d&#233;pendances entre
les noms gouverneurs et les pr&#233;positions t&#234;tes des GP, lesquelles sont attributives, lesquelles
sont d&#233;pendances d&#8217;objet ? On ne peut pas effectuer une analyse fine en d&#233;pendances sans savoir
r&#233;pondre &#224; cette question. En effet, dans la grammaire de d&#233;pendances il faut au moins faire
la distinction entre les d&#233;pendances obligatoires d&#8217;objet et les d&#233;pendances facultatives de
modifieurs en tout genre. Cette diff&#233;rence entre les deux types de d&#233;pendances correspond
aussi &#224; une diff&#233;rence fondamentale s&#233;mantique : dans le cas de d&#233;pendances attributives la
s&#233;mantique du GP d&#233;finit la valeur d&#8217;un attribut de la s&#233;mantique du nom gouverneur, tandis que
dans le cas de d&#233;pendances d&#8217;objet la s&#233;mantique du nom gouverneur est une fonction appliqu&#233;e
&#224; la s&#233;mantique du GP. Mais comment peut-on savoir dans quel cas de figure on se trouve ?
</p>
<p>On peut distinguer deux cat&#233;gories de substantifs :
(c1) ceux dont au moins un GP subordonn&#233; est un compl&#233;ment d&#8217;objet (c&#8217;est-&#224;-dire, correspond &#224;
un argument s&#233;mantique) 1 ,
(c2) et ceux qui n&#8217;en ont aucun.
</p>
<p>Les compl&#233;ments des substantifs de la cat&#233;gorie c1 ont le m&#234;me statut (par rapport au substantif)
que celui des &#233;l&#233;ments du cadre de sous-cat&#233;gorisation des verbes (par rapport aux verbes). Aussi
ces substantifs peuvent avoir des compl&#233;ments d&#8217;objet dans tous les contextes (ils peuvent aussi
avoir des GP attributifs). Parmi ces substantifs on trouve les nombres ind&#233;termin&#233;s exprimant
une quantit&#233; limit&#233;e et ind&#233;termin&#233;e d&#8217;objets, tels dizaine, douzaine, trentaine, etc. On y trouve
aussi les noms communs tels besoin, peur, marre, etc. qui avec un verbe l&#233;ger (e.g. avoir) forment
un phras&#232;me et qui en h&#233;ritent les compl&#233;ments d&#8217;objet (au g&#233;nitif). Mais surtout on y trouve de
tr&#232;s nombreux noms d&#233;verbaux. On s&#8217;int&#233;resse dans cet article surtout aux noms d&#233;verbaux parce
qu&#8217;il existe un certain nombre de r&#232;gles qui d&#233;finissent leurs arguments &#224; partir des arguments
des verbes d&#8217;origine.
</p>
<p>Les d&#233;verbaux h&#233;ritent du cadre de sous-cat&#233;gorisation du verbe d&#8217;origine et ils le transforment.
E.g. dans les phrases (1)-(4) nous trouvons les d&#233;verbaux reconnaissance, livraison, service,
producteur, abrogation.Comme on peut le voir dans les analyses 2 ci-dessous, service (cat&#233;gorie
(c2)) a un GP attributif de livraison, tandis que besoin et livraison (cat&#233;gorie (c1)) ont un GP
d&#8217;objet de reconnaissance dans la phrase (2), des commandes dans la phrase (3). Le d&#233;verbal
abrogation a un GP d&#8217;objet de cette loi dans la phrase (4). En m&#234;me temps, besoin peut aussi avoir
un GP attributif, e.g. de tous les &#234;tres humains dans la phrase (2).
</p>
<p>1. Comme tous les arguments s&#233;mantiques, ces arguments peuvent &#234;tre li&#233;s &#224; des &#233;l&#233;ments du contexte, ce qui
correspond &#224; l&#8217;ellipse de surface mais ne les prive pas du statut d&#8217;arguments obligatoires.
</p>
<p>2. Ces analyses sont obtenues avec l&#8217;analyseur syntaxique et en utilisant la grammaire cat&#233;gorielle de d&#233;pendance du
fran&#231;ais qui font partie du syst&#232;me CDG Lab (Alfared et al., 2011).
</p>
<p>72</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 1 &#8211; Analyses des phrases de l&#8217;introduction
</p>
<p>Les nombres ind&#233;termin&#233;s et les noms composant les phras&#232;mes ne posent pas de probl&#232;me parce
qu&#8217;ils sont peu nombreux. Par contre, la recherche des d&#233;verbaux n&#8217;est pas une t&#226;che simple
(surtout pour les verbes des deuxi&#232;mes et troisi&#232;mes groupes). Et les difficult&#233;s ne s&#8217;arr&#234;tent
pas l&#224; : le vrai probl&#232;me est de d&#233;terminer les cadres de sous-cat&#233;gorisation des d&#233;verbaux &#224;
partir des cadres de sous-cat&#233;gorisation des verbes. Ce sont les deux probl&#232;mes abord&#233;s dans cet
article. Par rapport au syst&#232;me CDG Lab mentionn&#233; ci-dessus, ces probl&#232;mes se traduisent par
des algorithmes de compl&#233;tion du lexique de la grammaire du fran&#231;ais pla&#231;ant les d&#233;verbaux
dans les classes lexicales qui correspondent &#224; leurs cadres de sous-cat&#233;gorisation. Cela explique
notre int&#233;r&#234;t pour cette probl&#233;matique.
</p>
<p>L&#8217;article est organis&#233; comme suit : la section 2 pr&#233;sente un algorithme de rep&#233;rage des noms
d&#233;verbaux ainsi que son &#233;valuation. La section suivante introduit le cadre th&#233;orique de l&#8217;article
sur les liens entre les cadres de sous-cat&#233;gorisation des noms d&#233;verbaux et des verbes d&#8217;origine.
La section 4 pr&#233;sente nos exp&#233;riences sur les r&#232;gles de transformation des cadres (du verbe au
d&#233;verbal). L&#8217;article se termine par une discussion et les perspectives de ce travail.
</p>
<p>2 Recherche des d&#233;verbaux
</p>
<p>En fran&#231;ais les noms d&#233;verbaux sont form&#233;s des verbes selon le sch&#233;ma :
BASE+TERMINAISON&#8658; var(BASE)+SUFFIXE,
</p>
<p>o&#249; var(BASE) est une variation de la base et SUFFIXE est un suffixe formateur (parfois vide : &#8722;0).
</p>
<p>73</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le plus simple est d&#8217;obtenir la liste plus ou moins compl&#232;te des suffixes formateurs cf. (Namer,
2009). En ce qui concerne les variations de la base, il s&#8217;av&#232;re difficile de trouver une source
o&#249; elles sont toutes pr&#233;sent&#233;es syst&#233;matiquement (en tout cas nous ne l&#8217;avons pas trouv&#233;e).
Heureusement, pour les verbes du premier groupe, auquel appartient la majorit&#233; absolue des
verbes fran&#231;ais, les variations sont tr&#232;s rares et on peut les n&#233;gliger (ou bien ne consid&#233;rer que
les plus simples). Cela rend possible d&#8217;appliquer aux verbes du premier groupe un algorithme
simpliste (appel&#233; ci-dessous proto-d&#233;verb) qui effectue la transformation :
</p>
<p>BASE+TERMINAISON&#8658; BASE+SUFFIXE
selon 17 r&#232;gles cit&#233;es dans la table 3. Nous avons appliqu&#233; proto-d&#233;verb &#224; deux corpus : un
d&#8217;arbres syntaxiques : le corpus Paris 7 (Abeill&#233; et al., 2003) 3, un autre textuel : le corpus GEOPO
(du CLLE-ERSS(Ho-Dac, 2007)). Proto-d&#233;verb pose plusieurs probl&#232;mes :
Probl&#232;me de faux d&#233;verbaux. L&#8217;algorithme proto-d&#233;verb peut construire des combinaisons
BASE+SUFFIXE qui ne sont pas des d&#233;verbaux. Par exemple, pour le suffixe -ence : scier&#8658; science,
pour le suffixe -tion : roter&#8658; rotation.
Probl&#232;me de fausse origine. La combinaison BASE+SUFFIXE construit par proto-d&#233;verb peut
&#234;tre un d&#233;verbal, mais provenir d&#8217;une autre base. Par exemple, pour le suffixe -ant : garer &#8658;
garant, tandis que garant est form&#233; du verbe garantir.
Probl&#232;me de fausse direction. Parfois le nom construit par proto-d&#233;verb n&#8217;est pas un d&#233;verbal,
mais c&#8217;est le verbe d&#8217;origine qui est d&#233;riv&#233; du nom. Par exemple, pour le suffixe -euse : mitrailler
&#8658; mitrailleuse (en fait, mitrailleuse&#8658; mitrailler). Pour ce genre de probl&#232;me il vaudrait mieux
parler de co-d&#233;verbaux, mais cette situation est assez rare et on peut aussi la n&#233;gliger.
</p>
<p>2.1 &#201;valuation de l&#8217;algorithme proto-d&#233;verb
</p>
<p>On voit que l&#8217;application de l&#8217;algorithme proto-d&#233;verb n&#233;cessite une expertise du r&#233;sultat de
son application. Notre d&#233;marche d&#8217;&#233;valuation consiste ici &#224; r&#233;aliser deux exp&#233;rimentations
ind&#233;pendantes ainsi qu&#8217;une comparaison directe avec la liste Verbaction de d&#233;verbaux d&#233;notant
l&#8217;action ou l&#8217;activit&#233; exprim&#233;e par le verbe. La premi&#232;re exp&#233;rimentation compare la liste des
d&#233;verbaux produit par proto-d&#233;verb avec une liste produite par un expert depuis une partie des
textes du corpus GEOPO(Ho-Dac, 2007). La seconde exp&#233;rimentation, effectu&#233;e sur le corpus
arbor&#233; de Paris 7 (Abeill&#233; et al., 2003), qui sera longuement pr&#233;sent&#233;e et comment&#233;e dans la
seconde partie de l&#8217;article consacr&#233; aux GP des d&#233;verbaux, permet d&#8217;obtenir, en la restreignant
&#224; la notion d&#8217;&#234;tre ou non un d&#233;verbal, une &#233;valuation des d&#233;verbaux propos&#233;s par l&#8217;algorithme
proto-d&#233;verb. Finalement, nous avons utilis&#233; la liste des d&#233;verbaux de Verbaction (Hathout et al.,
2002; Tanguy et Hathout, 2002) d&#233;velopp&#233;e &#224; l&#8217;INaLF/ATILF et &#224; l&#8217;ERSS pour la comparer avec
la liste produite par proto-d&#233;verb.
</p>
<p>2.2 &#201;valuation sur des textes du corpus GEOPO
</p>
<p>La premi&#232;re exp&#233;rience v&#233;rifie la pertinence de l&#8217;algorithme proto-d&#233;verb pour la construction
des couples d&#233;verbal/verbe sur des textes du corpus GEOPO. Ce corpus est constitu&#233; d&#8217;environ 270
000 mots. Il regroupe 32 textes longs qui sont des articles expositifs (informatifs et argumentatifs)
proposant des r&#233;flexions relatives &#224; notre monde d&#8217;aujourd&#8217;hui (la crise p&#233;troli&#232;re, la guerre contre
&quot;l&#8217;axe du mal&quot;, le terrorisme, l&#8217;explosion chinoise, la paix au moyen-orient, etc.) La m&#233;thodologie
</p>
<p>3. Parmi les 17 r&#232;gles seulement 12 de la table 2 ont &#233;t&#233; appliqu&#233;es au moins une fois dans ce corpus.
</p>
<p>74</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>utilis&#233;e pour l&#8217;&#233;valuation consiste &#224; rep&#233;rer automatiquement les s&#233;quences constitu&#233;es d&#8217;un nom
commun 4 suivi d&#8217;une des formes de la pr&#233;position de (de, d&#8217;, du ou des). Ensuite, les s&#233;quences
rep&#233;r&#233;es sont annot&#233;es &#224; la fois par l&#8217;algorithme proto-d&#233;verb et par un expert. L&#8217;annotation de
proto-d&#233;verb indique pour un nom commun s&#8217;il est un d&#233;verbal. Dans ce cas l&#8217;algorithme fournit
le verbe 5 dont il est d&#233;riv&#233;. L&#8217;expert indique de m&#234;me si les s&#233;quences rep&#233;r&#233;es correspondent &#224;
un d&#233;verbal (en particulier, le mot doit &#234;tre un nom commun dans la phrase). Dans ce cas, le
verbe d&#8217;origine est fourni par l&#8217;expert. Dans le cas contraire, l&#8217;annotateur indique la raison pour
laquelle le mot n&#8217;est pas un d&#233;verbal. Cela peut &#234;tre :
</p>
<p>1. le mot n&#8217;est pas un nom commun dans le contexte, comme par exemple parler dans plut&#244;t
que de parler de centralisation, [...],
</p>
<p>2. le nom fait partie d&#8217;une locution comme point dans ainsi, d&#8217;un point de vue l&#233;gislatif [...],
</p>
<p>3. le nom ne correspond pas (dans le sens de la phrase) &#224; un d&#233;verbal comme priorit&#233; dans Il
s&#8217;agit au contraire d&#8217;une priorit&#233; des pouvoirs publics,
</p>
<p>4. l&#8217;expert annotateur n&#8217;est pas s&#251;r que le nom soit un d&#233;verbal comme le nom poids pour le
verbe peser.
</p>
<p>L&#8217;algorithme proto-d&#233;verb ne pouvant pas d&#233;tecter les situations 1 et 2, nous avons &#233;limin&#233; les
s&#233;quences correspondantes des statistiques. Les cas 4 &#233;tant incertains, nous avons aussi pr&#233;f&#233;r&#233;
les supprimer. Nous n&#8217;avons donc gard&#233; que les s&#233;quences du point 3 et celles qui ont &#233;t&#233; annot&#233;es
par les experts comme des d&#233;verbaux.
</p>
<p>Sur les 286 s&#233;quences de phrases trait&#233;es, 220 ont &#233;t&#233; retenues par les experts (14 de statut
incertain (point 4) et 52 correspondant aux points 1 ou 2).
</p>
<p>D&#233;verbal (proto-d&#233;verb) Non d&#233;verbal (proto-d&#233;verb)
D&#233;verbal (expert) 28 (12,7%) 63 (28,6%)
Non d&#233;verbal (expert) 4 (1,8%) 125 (56,8%)
</p>
<p>TABLE 1 &#8211; Comparaison sur GEOPO entre proto-d&#233;verb et les experts annotateurs
</p>
<p>Ces r&#233;sultats sugg&#232;rent que les r&#232;gles utilis&#233;es par l&#8217;algorithme proto-d&#233;verb donnent pour la
grande majorit&#233; des occurrences de vrais d&#233;verbaux (28 contre 4) dans ce type de corpus. Par
contre, la couverture des r&#232;gles pourrait &#234;tre am&#233;lior&#233;e. En fait, l&#8217;algorithme simpliste proto-
d&#233;verb se contente de traiter les verbes du premier groupe. De plus, certaines r&#232;gles trop peu
pr&#233;cises n&#8217;ont pas &#233;t&#233; incluses dans cette version de l&#8217;algorithme comme la r&#232;gle qui supprime le
r final BASE+er&#8658; BASE+e et qui permet par exemple de g&#233;n&#233;rer le couple contr&#244;le/contr&#244;ler.
L&#8217;ajout de ce type de r&#232;gles aurait conduit &#224; une production d&#8217;un trop grand nombre de faux
couples d&#233;verbaux/verbes qui aurait complexifi&#233; la tache des experts sur le corpus Paris 7.
</p>
<p>2.3 &#201;valuation sur le corpus arbor&#233; Paris 7
</p>
<p>Pour compl&#233;ter ces statistiques, nous pouvons aussi utiliser une partie des r&#233;sultats de la se-
conde exp&#233;rience pour juger de la qualit&#233; de l&#8217;algorithme proto-d&#233;verb. Lors de cette seconde
</p>
<p>4. En fait, il s&#8217;agit des mots qui sont des noms communs dans le lexique Lefff (Sagot, 2010).
5. Exceptionnellement, l&#8217;algorithme peut fournir plusieurs verbes correspondant au mot. Par exemple, parade corres-
</p>
<p>pond &#224; parer et &#224; parader.
</p>
<p>75</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>exp&#233;rience nous avons rep&#233;r&#233;, dans le corpus d&#8217;arbres syntaxiques de Paris 7, les constructions
o&#249; un nom commun provenant d&#8217;une r&#232;gle de l&#8217;algorithme proto-d&#233;verb poss&#232;de un groupe
pr&#233;positionnel (GP) introduit par la pr&#233;position de. Sur ces &#233;l&#233;ments, nous avons demand&#233; &#224;
des experts annotateurs de rep&#233;rer les s&#233;quences qui contiennent effectivement le d&#233;verbal du
verbe donn&#233; par l&#8217;algorithme proto-d&#233;verb. Nous verrons dans la seconde partie de l&#8217;article sur
les compl&#233;ments au g&#233;nitif des d&#233;verbaux que, dans le cas o&#249; l&#8217;expert pense que le nom est
un d&#233;verbal, il doit fournir l&#8217;&#233;ventuel lien entre le GP et un des arguments du verbe d&#8217;origine.
Par exemple dans la phrase Il ne faut pas secondariser l&#8217;enseignement sup&#233;rieur ni inciter &#224; un
d&#233;membrement des universit&#233;s, le GP des universit&#233;s du d&#233;verbal d&#233;membrement correspond au
compl&#233;ment &#224; l&#8217;accusatif (compl&#233;ment d&#8217;objet direct) du verbe d&#233;membrer. En faisant abstraction
de ce r&#233;sultat sur le GP pour l&#8217;instant, nous pouvons savoir si la proposition de l&#8217;algorithme
proto-d&#233;verb correspond bien &#224; un d&#233;verbal dans le contexte d&#8217;une phrase. Les r&#233;sultats en
fonction des r&#232;gles de l&#8217;algorithme proto-d&#233;verb sont les suivants :
</p>
<p>R&#232;gle D&#233;verbal (expert) Non d&#233;verbal (expert) Nombre de couples
</p>
<p>er&#8658; ade 2 1 3
er&#8658; age 63 10 73
er&#8658; aison 5 0 5
er&#8658; ant 26 5 31
er&#8658; ation 274 7 281
er&#8658; ement 132 6 138
er&#8658; ence 24 7 31
er&#8658; eur 45 17 62
er&#8658; euse 1 0 1
er&#8658; oir 1 4 5
er&#8658; rice 1 1 2
er&#8658; ure 10 4 14
Total 584 (90,4%) 62 (9,6%) 646
</p>
<p>TABLE 2 &#8211; &#201;valuation de proto-d&#233;verb sur le corpus Paris 7 en fonction des r&#232;gles
</p>
<p>Ce tableau indique pour chaque r&#232;gle utilis&#233;e pour l&#8217;analyse du corpus le nombre de couples
nom/verbe qui correspondent ou non &#224; un couple d&#233;verbal/verbe pour l&#8217;expert ainsi que le total.
Globalement, le r&#233;sultat est assez bon mais n&#8217;est pas uniforme en fonction de la r&#232;gle de passage
du verbe au nom. La pr&#233;cision globale est de 90,4%.
</p>
<p>2.4 Comparaison avec la liste de d&#233;verbaux Verbaction
</p>
<p>Une troisi&#232;me exp&#233;rience consiste &#224; comparer la liste de 5537 couples d&#233;verbal/verbe produits par
l&#8217;algorithme proto-d&#233;verb &#224; partir du lexique Lefff avec les 8432 couples du lexique Verbaction
qui comprend une liste portant sur des noms morphologiquement apparent&#233;s au verbe et
qui peuvent &#234;tre utilis&#233;s pour d&#233;noter l&#8217;action ou l&#8217;activit&#233; exprim&#233;e par le verbe. Pour cette
comparaison nous avons trois possibilit&#233;s suivant qu&#8217;un couple nom/verbe correspond &#224; une
ou aux deux listes. La table 3 pr&#233;sente les r&#233;sultats pour les verbes du premier groupe qui sont
produits par l&#8217;algorithme proto-d&#233;verb.
</p>
<p>76</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#232;gle D&#233;verbal (Verbaction) Non d&#233;verbal (Verbaction) Nombre de couples
</p>
<p>er&#8658; ade 36 33 69
er&#8658; age 994 60 1054
er&#8658; aison 22 15 37
er&#8658; ant 312 312
er&#8658; ante 1 127 128
er&#8658; ation 918 85 1003
er&#8658; ement 778 61 839
er&#8658; ence 19 18 37
er&#8658; ette 6 187 193
er&#8658; eur 1 938 939
er&#8658; euse 538 538
er&#8658; oir 145 145
er&#8658; oire 20 20
er&#8658; rice 17 17
er&#8658; trice 5 5
er&#8658; ure 33 166 199
er&#8658; xion 1 1 2
Total 2809 (50,7%) 2728 (49,2%) 5537
</p>
<p>TABLE 3 &#8211; Comparaisons entre proto-d&#233;verb et le lexique Verbaction en fonction des r&#232;gles
</p>
<p>Le nombre de couples avec un verbe du premier groupe du lexique Verbaction qui ne sont
pas produits par l&#8217;algorithme est de 5623 (sur 8432). En fait, comme nous l&#8217;avons d&#233;j&#224; vu
pr&#233;c&#233;demment, l&#8217;algorithme proto-d&#233;verb ne couvre pas la totalit&#233; des verbes du premier
groupe. Par contre, il fournit des couples qui ne sont pas dans Verbaction comme les noms de
suffixe ant, ante, ette, eur, etc qui ne d&#233;signent pas directement l&#8217;action ou l&#8217;activit&#233; exprim&#233;e par
le verbe d&#8217;o&#249; l&#8217;int&#233;r&#234;t de cet algorithme dans cette &#233;tude.
</p>
<p>Pour &#234;tre complet, nous avons aussi compar&#233; les annotations de nos experts sur le corpus GEOPO
avec la liste de Verbaction ce qui a donn&#233; les r&#233;sultats de la table 4. L&#8217;ad&#233;quation entre nos
experts et le lexique Verbaction est assez bonne (85,5%) mais il reste quelques diff&#233;rences comme
les couples structure/structurer, position/positionner, craintes/craindre ou r&#233;sistant/r&#233;sister qui
s&#8217;explique par le choix de Verbaction de ne s&#8217;int&#233;resser qu&#8217;aux d&#233;verbaux d&#233;notant l&#8217;action ou
l&#8217;activit&#233; exprim&#233;e par le verbe.
</p>
<p>En conclusion, l&#8217;algorithme proto-d&#233;verb est simple et assez pr&#233;cis. Il fournit un grand nombre
de d&#233;verbaux ayant des liens vari&#233;s avec le verbe (contrairement &#224; Verbaction qui est sp&#233;cialis&#233;).
</p>
<p>D&#233;verbal (Verbaction) Non d&#233;verbal (Verbaction)
D&#233;verbal (expert) 69 (31,4%) 22 (10%)
Non d&#233;verbal (expert) 10 (4,5%) 119 (54,1%)
</p>
<p>TABLE 4 &#8211; Comparaison sur GEOPO entre le lexique Verbaction et les experts annotateurs
</p>
<p>77</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Cadres de sous-cat&#233;gorisation des d&#233;verbaux
</p>
<p>Passons maintenant au probl&#232;me principal, celui de d&#233;terminer les cadres de sous-cat&#233;gorisation
des d&#233;verbaux &#224; partir des cadres de sous-cat&#233;gorisation des verbes d&#8217;origine. Avant tout il
faut expliquer comment nous repr&#233;sentons ces cadres. Notre repr&#233;sentation est bas&#233;e sur une
affectation de cas aux compl&#233;ments d&#8217;objet propos&#233;e dans (Dikovsky, 2011). Cette affectation est
faite en fonction des clitiques selon la r&#232;gle suivante (simplifi&#233;e ici) :
Soit pi un compl&#233;ment d&#8217;objet d&#8217;un verbe V dans une phrase. Alors pi est au cas C si dans la phrase il
peut &#234;tre pronominalis&#233; et transform&#233; en un clitique P au cas C ancr&#233; sur V . Enfin, si pi ne peut pas
&#234;tre pronominalis&#233;, alors il est au cas oblique (o) 6.
</p>
<p>En fran&#231;ais il n&#8217;y a que quatre cas de clitiques : accusatif (a), e.g. me, la, en, g&#233;nitif (g) : en, datif
(d), e.g. te, lui, y, et locatif (l) : y. Respectivement, selon cette r&#232;gle chaque compl&#233;ment d&#8217;un
verbe a un des cinq cas : a, g, d, l ou o 7. Aussi le cadre de sous-cat&#233;gorisation du verbe est d&#233;fini
par les fonctions syntaxiques de ses arguments obligatoires (actants) : sujet (sub j), objet direct
(od), objet indirect (oi)), r&#233;alis&#233;s par les cas qui leur correspondent, e.g. chanter(sub j/n) (in-
transitif), ou chanter(sub j/n, od/a), donner(sub j/n, od/a, oi/d), &#233;merger(sub j/n, oi/g),
parler(sub j/n, od/a) ou parler(sub j/n, oi1/g, oi2/d), placer(sub j/n, od/a, oi/l),
&#233;changer(sub j/n, od/a, oi/o), etc. Parfois, pour pr&#233;ciser la r&#233;alisation du compl&#233;ment di-
rect par une phrase dont la t&#234;te est un verbe &#224; l&#8217;infinif, nous utilisons l&#8217;&#233;tiquette in f :
faire(sub j/n, od/a, oi/in f ). Le cadre s&#8217;&#233;tend sur les GP en position d&#8217;argument circonstanciel :
circ/C , quand C est le cas du GP.
</p>
<p>L&#8217;id&#233;e principale de notre calcul des cadres de sous-cat&#233;gorisation des noms d&#233;verbaux est que
dans le cas o&#249; on sait de quel verbe est form&#233; le nom d&#233;verbal, on peut d&#233;duire le cadre du
second &#224; partir de celui du premier. Il s&#8217;agit donc de d&#233;finir les r&#232;gles de transformation des
cadres 8 des verbes les cadres des noms d&#233;riv&#233;s. Ce calcul des cadres par r&#233;duction rend possible
de contourner le probl&#232;me difficile de d&#233;finition des cadres de sous-cat&#233;gorisation des verbes
(cf. (Fillmore, 1968, 1977; Grimshaw, 1990; Dowty, 1991; Van Valin, 1997; Mel&#8217;c&#780;uk, 2004)).
Les cadres de sous-cat&#233;gorisation des verbes sont alors donn&#233;s a priori et sont repr&#233;sent&#233;s par
les listes des r&#233;alisations des actants : fonction syntaxique/cas d&#233;finies ci-dessus : sub j/n, od/a,
oi/d, oi/g,oi/l,oi/o, oi/in f . Les cadres des noms d&#233;verbaux sont repr&#233;sent&#233;s par les r&#233;alisations
des objets (sauf od/a), mais aussi des attributs : at t r/C . Quand un argument circonstanciel d&#8217;un
verbe ou un arguments attributif d&#8217;un nom n&#8217;est pas r&#233;alis&#233; par un cas nous allons noter cette
r&#233;alisation par circ/&#8869; (at t r/&#8869;). Sur cette signature &#233;tendue on peut d&#233;finir les transformations
diath&#233;tiques de nominalisation des verbes par les s&#233;quences de r&#232;gles du genre (sub j/n&#8594;0) 9 ou
((od/a&#8594;oi/g), (sub j/n&#8594;at t r/g)) ou (oi/l&#8594;oi/l), etc.
Notre hypoth&#232;se initiale &#233;tait que les transformations diath&#233;tiques de nominalisation en fran&#231;ais
sont d&#233;finies par quatre r&#232;gles simples :
- le sujet du verbe disparait et est converti en un attribut du nom d&#233;riv&#233; : (sub j/n&#8594;at t r/C),
- son objet direct (C = a) devient l&#8217;objet indirect au g&#233;nitif (od/a&#8594;oi/g),
- tous les autres objets indirects sont tout simplement h&#233;rit&#233;s sous r&#233;serve de leur pr&#233;sence dans
le cadre (e.g (oi/d&#8594;oi/d) ou (oi/o&#8594;oi/o),
</p>
<p>6. Certes, il faut d&#233;finir plus pr&#233;cisement cette r&#232;gle pour les clitiques ambigus : y au datif vs. y au locatif, en au g&#233;nitif
vs. en &#224; l&#8217;accusatif, etc. et la compl&#233;ter par le cas n (nominatif) du sujet.
</p>
<p>7. Cf. (van den Eynde et Mertens, 2003)) o&#249; on tient compte de tous les pronoms.
8. Diathetic shift rules (ang.).
9. A&#8594;0 veut dire que A est supprim&#233;.
</p>
<p>78</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>- les GP circonstanciels deviennent GP attributifs (circ/C1&#8594;at t r/C2).
Il s&#8217;av&#232;re que le tableau r&#233;el est bien plus complexe. Pour commencer, certains arguments des
d&#233;verbaux h&#233;rit&#233;s des cadres des verbes d&#8217;origine ont tendance &#224; perdre leur statut obligatoire. Il
s&#8217;agit surtout des compl&#233;ments locatifs et obliques. Par exemple, le cadre du verbe pronominal se
d&#233;placer est soit (oi/l) soit (oi/o) (un des deux est obligatoire : cf. Il se d&#233;place &#224; Bordeaux ; Il se d&#233;-
place en voiture mais &#8727;Il se d&#233;place). Encore pire est la situation o&#249; le verbe d&#8217;origine est di-transitif
avec le cadre (sub j/n, od/a, oi/g), (e.g. saupoudrer(sub j/n, od/a, oi/g)). Dans ce cas un des
compl&#233;ments est supprim&#233;. En fonction du contexte le compl&#233;ment d&#8217;objet au g&#233;nitif du d&#233;verbal
saupoudrage(oi/g) peut provenir soit du compl&#233;ment d&#8217;objet direct du verbe (cf. saupoudrage des
champs (sub j/n&#8594;0, od/a&#8594;oi/g, oi/g&#8594;0)), soit de son compl&#233;ment d&#8217;objet indirect au g&#233;nitif
(cf. saupoudrage de r&#233;formettes (sub j/n&#8594;0, od/a&#8594;0, oi/g&#8594;oi/g). Et enfin, tr&#232;s souvent le GP
subordonn&#233; &#224; un nom d&#233;verbal peut provenir du sujet et m&#234;me d&#8217;un des arguments circons-
tanciels du verbe d&#8217;origine. Par exemple, dans la phrase L&#8217;argumentation du clan pro-inflation
consiste &#224; ... le GP du clan pro-inflation est un attribut du nom d&#233;verbal argumentation(0). Cet
attribut provient du sujet du verbe argumenter(sub j/n, od/a). Ainsi dans ce contexte le cadre
de sous-cat&#233;gorisation du verbe est transform&#233; selon la r&#232;gle (sub j/n&#8594;at t r/g, od/a&#8594;0). D&#8217;un
autre c&#244;t&#233;, dans la phrase La d&#233;bandade de 1982-1983 qui vit le pays... le verbe d&#233;bander(sub j/n)
est intransitif. Aussi l&#8217;attribut de 1982-1983 du d&#233;verbal d&#233;bandade provient d&#8217;un argument
circonstanciel du verbe (d&#233;bander en 1982-1983) : (circ/o&#8594;at t r/g).
Sans argument suppl&#233;mentaire ces exemples peuvent faire croire qu&#8217;il faut faire face &#224; un nombre
important de transformations de cadres de sous-cat&#233;gorisation. Heureusement, les actants
des noms d&#233;verbaux ob&#233;issent au postulat suivant (visiblement remontant &#224; la pr&#233;somption
d&#8217;invariabilit&#233; des actants des mots de (Mel&#8217;c&#780;uk et Holodovic&#780;, 1970)) 10 :
</p>
<p>postulat de provenance : les actants des noms d&#233;verbaux proviennent d&#8217;un des actants du verbe
d&#8217;origine.
</p>
<p>Une cons&#233;quence directe de ce postulat est que l&#8217;actant du d&#233;verbal ne peut pas provenir d&#8217;un
argument circonstanciel du verbe d&#8217;origine mais seulement de son sujet ou d&#8217;un des objets pr&#233;sent
dans son cadre. D&#251; &#224; ce postulat notre objectif devient plus pr&#233;cis : on peut &#233;tablir la provenance
des actants des noms d&#233;verbaux r&#233;alis&#233;s par des GN non attributifs seulement &#224; partir des GN
non circonstanciels du verbe d&#8217;origine. Quoique tr&#232;s restrictif, le postulat de provenance laisse
beaucoup de variantes : diff&#233;rents suffixes formateurs, diff&#233;rents r&#244;les syntaxiques des noms
d&#233;verbaux dans diff&#233;rents contextes et diff&#233;rents actants correspondants du verbe d&#8217;origine. Pour
simplifier la t&#226;che nous nous limitons dans cet article aux GN au g&#233;nitif qui r&#233;alisent les actants
des noms d&#233;verbaux. Dans les exp&#233;riences pr&#233;sent&#233;es dans la section suivante nous &#233;tudions leur
provenance et les r&#232;gles de conversion qui les concernent.
</p>
<p>4 Exp&#233;riences et &#233;valuation des r&#233;sultats
</p>
<p>Ici, nous nous int&#233;ressons &#224; d&#233;couvrir le r&#244;le des GP des d&#233;verbaux pour le verbe qui leur
correspond. Nous avons identifi&#233; dans un premier temps plusieurs possibilit&#233;s puis nous avons
cherch&#233; &#224; comprendre sur des exemples d&#8217;un corpus les liens entre les compl&#233;ments du verbe et
les GP introduit par la pr&#233;position de du d&#233;verbal. Notre &#233;tude a consist&#233; sur le corpus d&#8217;arbres
</p>
<p>10. Nos exp&#233;riences avec le corpus Paris 7 confirment ce postulat (au moins pour les noms d&#233;verbaux rep&#233;r&#233;s dans le
corpus).
</p>
<p>79</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>syntaxiques de phrases de Paris 7 (Abeill&#233; et al., 2003), &#224; rep&#233;rer toutes les occurrences de noms
communs qui correspondent &#224; l&#8217;algorithme proto-d&#233;verb et qui poss&#232;dent un (ou plusieurs)
GP introduit par la pr&#233;position de. Sur ces occurrences, nous avons demand&#233; &#224; des experts
d&#8217;indiquer pour ces occurrences si les couples nom/verbe produit par l&#8217;algorithme proto-d&#233;verb
correspondent effectivement (dans le contexte des occurrences) &#224; un couple d&#233;verbal/verbe.
Dans un deuxi&#232;me temps, pour les occurrences valid&#233;es comme des d&#233;verbaux, les experts
devaient indiquer la fonction que pouvaient prendre les GP par rapport au verbe. Voici quelques
exemples qui illustrent les diff&#233;rents cas de figure rencontr&#233;s par les experts annotateurs :
</p>
<p>1. Le langage de la formation, trop souvent fait d&#8217;approximations, [...] avec le couple lan-
gage/langer : en fait, langage n&#8217;a rien &#224; voir avec langer.
</p>
<p>2. L&#8217;alliance des vrais-faux contraires suscite la parade des suppos&#233;s amis avec le couple
parade/parer : le nom parade peut &#234;tre associ&#233; &#224; deux verbes suivant son sens. Soit parer,
soit parader. Dans cette phrase, le sens de parade correspond &#224; parader. Ces deux premiers
exemples sont &#233;tiquet&#233;s non D (non d&#233;verbal).
</p>
<p>3. Avec une croissance de 3,3% &#224; la m&#234;me date, les d&#233;partements d&#8217;outre-mer b&#233;n&#233;ficieront d&#8217;un
rattrapage d&#8217;un point suppl&#233;mentaire avec le couple rattrapage/rattraper : ici nous avons
clairement un d&#233;verbal. Le GP d&#8217;un point suppl&#233;mentaire joue le r&#244;le du compl&#233;ment &#224;
l&#8217;accusatif (compl&#233;ment d&#8217;objet direct) du verbe rattraper car nous pourrions dire ceci
rattrape un point suppl&#233;mentaire. Cet exemple est &#233;tiquet&#233; C=a par les experts.
</p>
<p>4. Reports ou renvois qui n&#8217;emp&#234;chent pas M. B&#233;r&#233;govoy de juger &#8220;injuste&#8221; l&#8217;accusation d&#8217;immo-
bilisme avec le couple accusation/accuser : le GP du d&#233;verbal correspond &#224; un compl&#233;ment
au g&#233;nitif du verbe accuser (compl&#233;ment d&#8217;objet indirect introduit par de) car on peut dire
on l&#8217;accuse d&#8217;immobilisme. Cet exemple est &#233;tiquet&#233; C=g par les experts.
</p>
<p>5. Dans l&#8217;intervention humanitaire, il n&#8217;y a pas d&#8217;obligation de r&#233;sultats avec le couple obliga-
tion/obliger : cette fois le GP correspond &#224; un compl&#233;ment au datif (compl&#233;ment d&#8217;objet
indirect introduit par &#224;) car nous pouvons dire cela nous oblige &#224; des r&#233;sultats. Cet exemple
est &#233;tiquet&#233; C=d par les experts.
</p>
<p>6. De plus, la Russie, mastodonte p&#233;trolier emp&#234;tr&#233; dans des probl&#232;mes infinis, para&#238;t incapable
de stopper la d&#233;gringolade de sa production, [...] avec le couple d&#233;gringolade/d&#233;gringoler :
ici, la production pourrait &#234;tre le sujet de d&#233;gringoler car nous pouvons dire la production
d&#233;gringole. Cet exemple est &#233;tiquet&#233; subj par les experts.
</p>
<p>7. Au plan agricole, la d&#233;l&#233;gation de Gdansk a pris contact avec les professionnels de la race
bovine limousine, dont les performances zootechniques, notamment en &#233;levage extensif de
plein air, leur ont sembl&#233; particuli&#232;rement adapt&#233;es aux conditions polonaises avec le couple
&#233;levage/&#233;lever : cette fois, le GP correspond &#224; un argument circonstanciel (optionnel) du
verbe &#233;lever puisque nous pourrions dire on les &#233;l&#232;ve en plein air. Cet exemple est &#233;tiquet&#233;
circ par les experts.
</p>
<p>8. D&#233;but 1991, autour de Joachim Trautwein, les six &#8220;&#233;lus&#8221; de l&#8217;ancien encadrement suivent trois
s&#233;minaires de deux jours, en pr&#233;sence d&#8217;un sociologue est-allemand et d&#8217;un chercheur fran&#231;ais
du CNRS avec le couple chercheur/chercher : dans cette phrase, il est difficile de rattacher le
CNRS au verbe chercher car le GP d&#233;signe l&#8217;appartenance &#224; une organisation de la personne
qui cherche. Nous pouvons dire dans ce cas que bien que nous ayons un d&#233;verbal, le GP
de ce d&#233;verbal ne provient pas de la structure des compl&#233;ments du verbe d&#8217;origine. Cet
exemple est &#233;tiquet&#233; V/S (un d&#233;verbal dont le GP ne peut pas &#234;tre subordonn&#233; au verbe :
(0&#8594;at t r/g)).
</p>
<p>80</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les annotations ont &#233;t&#233; class&#233;es par la r&#232;gle de l&#8217;algorithme proto-d&#233;verb utilis&#233;e pour faire la
correspondance entre le d&#233;verbal et le verbe. Les s&#233;quences ont &#233;t&#233; extraites d&#8217;un sous ensemble
du corpus (Abeill&#233; et al., 2003) constitu&#233; de 31 fichiers sur 45 (les autres fichiers nous permettant
de v&#233;rifier nos hypoth&#232;ses) et comportant 15106 phrases (sur 21776). Le programme d&#8217;extraction
a identifi&#233; 647 s&#233;quences nom + GP avec nom, un nom commun produit par l&#8217;algorithme proto-
d&#233;verb (le nom peut &#234;tre s&#233;par&#233; de son GP par d&#8217;autres &#233;l&#233;ments du groupe nominal). Sur ces
647 s&#233;quences les experts ont supprim&#233; une phrase pour laquelle le lien entre le GP et le verbe
n&#8217;&#233;tait pas clair 11. Les experts ayant diverg&#233; sur l&#8217;interpr&#233;tation de la fonction de certains GP
entre C=a et les autres cas, nous avons dans un premier temps conserv&#233; l&#8217;annotation qui n&#8217;&#233;tait
pas C=a. Toutefois, nous indiquons, dans la colonne C=a, avec le symbol + suivi d&#8217;un nombre,
le nombre de cas C=a divergents. En fait, sur les 646 s&#233;quences, 18 annotations sont rest&#233;es
diff&#233;rentes m&#234;me apr&#232;s concertation des annotateurs. Comme nous l&#8217;avons vu pr&#233;c&#233;demment,
les experts ont rep&#233;r&#233; 62 s&#233;quences ne correspondant pas &#224; un d&#233;verbal et 584 correspondant &#224;
un d&#233;verbal. Voici la table des r&#233;sultats class&#233;s par r&#232;gle :
</p>
<p>R&#232;gle non D C=a C=d C=g subj circ V/S Total D Total
er&#8658; ade 1 1 1 2 3
er&#8658; age 10 44 + 3 4 11 4 63 73
er&#8658; aison 5 5 5
er&#8658; ant 5 17 + 2 1 2 5 1 26 31
er&#8658; ation 7 210 + 8 3 3 39 17 2 274 281
er&#8658; ement 6 101 + 4 3 2 11 12 3 132 138
er&#8658; ence 7 5 1 14 4 24 31
er&#8658; eur 17 24 + 1 1 2 10 8 45 62
er&#8658; euse 1 1 1
er&#8658; oir 4 1 1 5
er&#8658; rice 1 1 1 2
er&#8658; ure 4 6 1 2 1 10 14
Total 62 413 + 18 9 10 80 57 15 584 646
</p>
<p>TABLE 5 &#8211; Analyse sur le corpus Paris 7 de la fonction des GP des d&#233;verbaux
</p>
<p>Nous voyons que tr&#232;s majoritairement (413 sur 584 soit 70,7%), le GP correspond au compl&#233;ment
d&#8217;objet direct du verbe. Les deux autres types de compl&#233;ments d&#8217;objet indirect (C=d et C=g) sont
bien moins nombreux car les verbes du premier groupe avec ce type de compl&#233;ment sont peu
nombreux. Les annotateurs en ont rep&#233;r&#233; 19 soit 3,3%.
</p>
<p>&#192; la lecture des exemples annot&#233;s C=d, on s&#8217;aper&#231;oit que les d&#233;verbaux autorisent de mani&#232;re
g&#233;n&#233;rale qu&#8217;un GP normalement introduit par la pr&#233;position &#224; soit introduit par la pr&#233;position de
avec le d&#233;verbal. Ainsi, on peut dire Dans l&#8217;intervention humanitaire, il n&#8217;y a pas d&#8217;obligation de
r&#233;sultats &#224; la place de Dans l&#8217;intervention humanitaire, il n&#8217;y a pas d&#8217;obligation &#224; des r&#233;sultats.
</p>
<p>Par contre, les compl&#233;ments du verbe au g&#233;nitif (C=g) se traduisent naturellement en un GP du
d&#233;verbal introduit par de. Ainsi, dans la phrase reports ou renvois qui n&#8217;emp&#234;chent pas M. B&#233;r&#233;govoy
</p>
<p>11. &#8220;Le d&#233;placement en milieu psychiatrique du traitement de l&#8217;acte - qui ne serait parl&#233; que l&#224;, m&#233;dicalement - exclut
l&#8217;inculp&#233; de la soci&#233;t&#233; : non seulement il est dispens&#233;, mais il est emp&#234;ch&#233; de r&#233;pondre de son acte devant les parties directement
concern&#233;es alors que les deux d&#233;marches devraient &#234;tre compl&#233;mentaires&#8221; avec le couple d&#233;placement/d&#233;placer.
</p>
<p>81</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de juger injuste l&#8217;accusation d&#8217;immobilisme, la s&#233;quence accusation d&#8217;immobilisme correspond &#224;
accuser d&#8217;immobilisme.
</p>
<p>Le cas des arguments circonstanciels est aussi assez simple puisque les 57 exemples montrent que
ces compl&#233;ments du verbe introduit par des pr&#233;positions comme en, pendant, vers, pour, dans,
etc, peuvent se transformer en GP introduit par de d&#8217;un d&#233;verbal. Dans les 57 cas rencontr&#233;s par
les annotateurs, le GP &#233;tait toujours optionnel et repr&#233;sentait un attribut plut&#244;t qu&#8217;un actant du
d&#233;verbal.
</p>
<p>Le cas de la transformation du sujet du verbe en un GP introduit par de du d&#233;verbal est plus
probl&#233;matique. Les annotateurs en ont rep&#233;r&#233; un grand nombre (80 sur 584 soit 13,7%). Toutefois,
ils ne sont pas toujours tomb&#233;s d&#8217;accord sur ces s&#233;quences car une partie (18 sur 80) a &#233;t&#233; annot&#233;e
comme C=a par au moins un annotateur. En fait, cela s&#8217;explique assez bien car la majorit&#233; de ces
cas probl&#233;matiques correspondent soit &#224; des verbes pouvant &#234;tre pronominaux, soit &#224; des verbes
dont le compl&#233;ment d&#8217;objet direct peut devenir sujet. Par exemple, nous pouvons dire que les
achats de biens durables red&#233;marrent mais aussi qu&#8217;on red&#233;marre les achats de biens durables. Dans
ce cas, le GP du d&#233;verbal red&#233;marrage peut effectivement correspondre au sujet ou &#224; l&#8217;objet de
red&#233;marrer. Dans le m&#234;me ordre d&#8217;id&#233;e, si l&#8217;on parle de la pr&#233;carisation du march&#233; du travail, on
peut consid&#233;rer soit que le march&#233; du travail pr&#233;carise les travailleurs, soit que la soci&#233;t&#233; pr&#233;carise
le march&#233; du travail.
</p>
<p>Mis-&#224;-part ces probl&#232;mes d&#8217;ambigu&#239;t&#233;, une analyse fine des exemples annot&#233;s subj rejoint et
compl&#232;te l&#8217;analyse que nous avions faite &#224; propos du cas C=d. Alors que la forme normale de la
transformation du sujet dans le d&#233;verbal devrait &#234;tre un GP introduit par par, il semble courant
que cette pr&#233;position par soit remplac&#233;e par la pr&#233;position de. Cela est particuli&#232;rement vrai
lorsque le verbe est intransitif comme la d&#233;gringolade de sa production dans le phrase De plus,
la Russie [...] para&#238;t incapable de stopper la d&#233;gringolade de sa production [...]. Dans ce cas tr&#232;s
pr&#233;cis, il est m&#234;me impossible d&#8217;utiliser un GP introduit par par. Pour les verbes transitifs dont
un des compl&#233;ments est introduit par de, les exemples du corpus montrent que le nom d&#233;verbal
provenant du verbe perd son actant-sujet.
</p>
<p>La conclusion de cette &#233;tude semble bien indiquer que notre hypoth&#232;se d&#8217;origine sur les transfor-
mations des cadres de sous-cat&#233;gorisation des verbes vers ceux des d&#233;verbaux &#233;tait globalement
fond&#233;e. Nous avons toutefois d&#251; revoir le cas du sujet des verbes qui peuvent sous certaines
conditions devenir de vrais arguments du d&#233;verbal sous la forme d&#8217;un GP introduit par de et
ajouter le cas de la transformation des compl&#233;ments au datif en un GP au g&#233;nitif :
- soit le sujet du verbe dispara&#238;t et est converti en un attribut optionnel du nom d&#233;riv&#233; (en g&#233;n&#233;ral
un GP introduit par la pr&#233;position par) : (sub j/n&#8594;at t r/&#8869;), soit il est le compl&#233;ment unique
du d&#233;verbal (en g&#233;n&#233;ral un GP introduit par la pr&#233;position de), en particulier si le verbe est
intransitif ou bien lorsque le verbe comporte normalement un compl&#233;ment qui est alors &#233;lid&#233; :
(sub j/n&#8594;oi/g),
- l&#8217;objet direct (C = a), s&#8217;il n&#8217;est pas &#233;lid&#233;, devient un GP introduit par de (od/a&#8594;oi/g),
- tout autre objet indirect, s&#8217;il n&#8217;est pas &#233;lid&#233;, est tout simplement h&#233;rit&#233; sous r&#233;serve de sa
pr&#233;sence dans le cadre (e.g (oi/d&#8594;oi/d) ou (oi/o&#8594;oi/o)) avec la possibilit&#233; pour le datif de
se retrouver transform&#233; en un GP introduit par la pr&#233;position de &#224; la place de la pr&#233;position &#224; :
(oi/d&#8594;oi/g),
- les GP circonstanciels au g&#233;nitif sont transform&#233;s en GP attributifs au g&#233;nitif.
Cette analyse compl&#232;te celle de (Benveniste, 1966) qui ne pr&#233;voit que deux alternatives : g&#233;nitif
subjectif / g&#233;nitif objectif.
</p>
<p>82</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour terminer ce tableau, nous nous sommes aper&#231;us qu&#8217;il y a tr&#232;s peu de cas de d&#233;verbaux
comportant deux GP introduits par de qui correspondent &#224; deux compl&#233;ments du verbe (contrai-
rement au cas o&#249; l&#8217;un des deux GP introduit par de correspond &#224; un argument circonstanciel du
verbe). Un exemple int&#233;ressant provient du d&#233;verbal radiation et de son verbe d&#8217;origine radier
qui comporte deux compl&#233;ments, un compl&#233;ment d&#8217;objet direct C = a et un compl&#233;ment d&#8217;objet
indirect introduit par de C = g. Et semble pencher, en priv&#233;, pour une radiation de son groupe du
second march&#233; boursier : les deux GP de son groupe et du second march&#233; boursier correspondent &#224;
on a radi&#233; le groupe du second march&#233;.
</p>
<p>Par contre, nous n&#8217;avons trouv&#233; aucun cas de d&#233;verbal comportant un GP au g&#233;nitif provenant du
sujet du verbe et un autre GP du d&#233;verbal (pas forc&#233;ment au g&#233;nitif) provenant d&#8217;un compl&#233;ment
de ce verbe. Il semble donc que les cadres de sous-cat&#233;gorisation des d&#233;verbaux avec deux actants
dont un provient du sujet du verbe transitif, s&#8217;ils existent, sont tr&#232;s restreints.
</p>
<p>5 Discussion et perspectives
</p>
<p>Notre calcul de la provenance des compl&#233;ments au g&#233;nitif des noms d&#233;verbaux ne donne pas
encore une solution compl&#232;te et d&#233;finitive au probl&#232;me du calcul des cadres de sous-cat&#233;gorisation
des d&#233;verbaux m&#234;me s&#8217;il fournit une approximation tout-&#224;-fait satisfaisante. En effet :
1) dans les contextes o&#249; le nom d&#233;verbal a deux compl&#233;ments d&#8217;objet, nous n&#8217;avons pas de r&#232;gle
contextuelle d&#233;finissant la provenance de chacun (nos r&#232;gles sont individuelles) ;
2) et m&#234;me dans le cas le plus fr&#233;quent o&#249; le nom d&#233;verbal n&#8217;a qu&#8217;un seul actant, nos r&#232;gles ne
r&#233;solvent pas le choix pr&#233;cis de l&#8217;actant du verbe d&#8217;origine dont il provient.
</p>
<p>Pour arriver &#224; ces r&#232;gles il faut raffiner notre analyse pr&#233;liminaire en consid&#233;rant les noms
d&#233;verbaux dans les contextes d&#8217;actant. Il s&#8217;agit des contextes o&#249; le nom d&#233;verbal N[V0] provenant
du verbe V0 et gouvernant son compl&#233;ment GP(de) est lui-m&#234;me subordonn&#233; &#224; un verbe Vg ,
c&#8217;est-&#224;-dire :
</p>
<p>Vg
C&#8722;ob j&#8722;&#8594; N[V0]&#8722;&#8594; GP(de).
</p>
<p>Par exemple dans la phrase Ce prince de la pens&#233;e v&#234;tu en clochard ne semblait pas voir l&#8217;admi-
ration [...] de ses &#233;l&#232;ves, le d&#233;verbal N[V0]=admiration du verbe V0 =admirer comporte un GP
GP(de) =de ses &#233;l&#232;ves et est subordonn&#233; au verbe Vg =voir. Dans cet exemple, c&#8217;est le verbe
voir qui fournit le compl&#233;ment d&#8217;objet direct de admirer. Aussi ce compl&#233;ment sort du cadre
de sous-cat&#233;gorisation du d&#233;verbal admiration tandis que le GP de ses &#233;l&#232;ves qui est le sujet
du verbe d&#8217;origine admirer devient son attribut au g&#233;nitif. Il s&#8217;agit donc de la transformation :
((sub j/n&#8594;at t r/g); (od/a&#8594;0)).
E. Paducheva, dans son travail classique (Paducheva, 1977), d&#233;crit pour le russe le calcul complet
des r&#233;ductions des choix de l&#8217;actant de V0 dont provient GN(de) en fonction des actants diff&#233;rents
de C dans le cadre de sous-cat&#233;gorisation du verbe gouverneur Vg (c&#8217;est-&#224;-dire ceux qui ne sont
pas remplis par le d&#233;verbal). Pour &#233;laborer les r&#232;gles similaires pour les noms d&#233;verbaux fran&#231;ais
il nous faudra plus de donn&#233;es et une expertise linguistique additionnelle tr&#232;s fine qui devra
regarder au-del&#224; des simples groupes nominaux et de leur GP.
</p>
<p>83</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et TOUSSENEL, F. (2003). Building a treebank for French. In ABEILL&#201;, A.,
&#233;diteur : Treebanks : Building and Using Parsed Corpora, pages 165&#8211;188. Kluwer, Dordrecht.
</p>
<p>ALFARED, R., B&#201;CHET, D. et DIKOVSKY, A. (2011). CDG Lab : a toolbox for dependency gram-
mars and dependency treebanks development. In GERDES, K., HAJICOVA, E. et WANNER, L.,
&#233;diteurs : Proc. of the 1st Intern. Conf. on Dependency Linguistics (Depling 2011), Barcelona,
Spain. http ://depling.org/proceedingsDepling2011/.
</p>
<p>BENVENISTE, E. (1966). Probl&#232;mes de linguistique g&#233;n&#233;rale. Gallimard, Paris.
</p>
<p>DIKOVSKY, A. (2011). Categorial dependency grammars : from theory to large scale grammars.
In GERDES, K., HAJICOVA, E. et WANNER, L., &#233;diteurs : Proc. of the 1st Intern. Conf. on Dependency
Linguistics (Depling 2011), Barcelona, Spain. http ://depling.org/proceedingsDepling2011/.
</p>
<p>DOWTY, D. (1991). Thematic proto-roles and argument selection. Language, 67(3):547&#8211;619.
</p>
<p>FILLMORE, C. J. (1968). The case for case. In BACH, E. et HARMS, R. T., &#233;diteurs : Universals in
Linguistic Theory, pages 1&#8211;88. Holt, Rinehart and Winston.
</p>
<p>FILLMORE, C. J. (1977). The case for case reopened. In COLE, P. et SADOCK, J. M., &#233;diteurs :
Syntax and Semantics 8 : Grammatical Relations, pages 59&#8211;81. New York : Academic Press.
</p>
<p>GRIMSHAW, J. (1990). Argument Structure. MIT Press, Cambridge, Mass.
</p>
<p>HATHOUT, N., NAMER, F. et DAL, G. (2002). An Experimental Constructional Database : The
MorTAL Project. In BOUCHER, P., &#233;diteur : Many Morphologies, pages 178&#8211;209. Cascadilla,
Somerville, Mass.
</p>
<p>HO-DAC, L.-M. (2007). La position initiale dans l&#8217;organisation du discours, une exploration en
corpus. Th&#232;se de doctorat, Universit&#233; Toulouse-le Mirail, France.
</p>
<p>MEL&#8217;C&#780;UK, I. et HOLODOVIC&#780;, A. (1970). To the theory of grammatical voice : (definition, calculus).
In Problemy lingvisticheskoj tipologii i struktury jazyka. Nauka, Leningrad. (Rus.).
</p>
<p>MEL&#8217;C&#780;UK, I. A. (2004). Actants in semantics and syntax 1,2. Linguistics, 42(1,2).
</p>
<p>NAMER, F. (2009). Morphologie, lexique et traitement automatique des langues. Hermes Science,
Lavoisier.
</p>
<p>PADUCHEVA, E. (1977). O proizvodnyh diatezah otpredikatnyh imen v russkom jazyke. In
Problemy lingvisticheskoj tipologii i struktury jazyka. Nauka, Leningrad. (Rus.).
</p>
<p>SAGOT, B. (2010). The lefff, a freely available and large-coverage morphological and syntactic
lexicon for French. In Proceedings of the Seventh conference on International Language Resources
and Evaluation (LREC&#8217;10).
</p>
<p>TANGUY, L. et HATHOUT, N. (2002). Webaffix : un outil d&#8217;acquisition morphologique d&#233;riva-
tionnelle &#224; partir du web. In PIERREL, J.-M., &#233;diteur : Actes de la 9eConf&#233;rence Annuelle sur le
Traitement Automatique des Langues Naturelles (TALN-2002), pages 245&#8211;254, Nancy. ATALA.
</p>
<p>van den EYNDE, K. et MERTENS, P. (2003). La valence : l&#8217;approche pronominale et son application
au lexique verbal. Journal of French Language Studies, 13:63&#8211;104.
</p>
<p>VAN VALIN, Jr., R. D. (1997). Generalized semantic roles and the syntax-semantics interface.
In CORBLIN, F., DOBROVIE-SORIN, C. et MARANDIN, J.-M., &#233;diteurs : Empirical Issues in Formal
Syntax and Semantics 2 : Selected papers from the Colloque de Syntaxe et Semantique &#224; Paris,
pages 373&#8211;388. Peter Lang.
</p>
<p>84</p>

</div></div>
</body></html>