<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Enjeux m&#233;thodologiques, linguistiques et informatiques pour le traitement du fran&#231;ais &#233;crit des sourds</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 559&#8211;566,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Enjeux m&#233;thodologiques, linguistiques et informatiques 
pour le traitement du fran&#231;ais &#233;crit des sourds 
</p>
<p>Tristan Vanrullen1   Le&#239;la Boutora2   Jean Dagron3 
(1) TVSI, 13009 Marseille 
</p>
<p>(2) LPL, UMR 7309 CNRS/Univ. d&#8217;Aix-Marseille, 13100 Aix-en-Provence 
(3) Assistance publique - H&#244;pitaux de Marseille, 13005 Marseille 
</p>
<p>tristan.vanrullen@gmail.com, leila.boutora@lpl-aix.fr, 
</p>
<p>jean.dagron@ap-hm.fr 
</p>
<p>RESUME ____________________________________________________________________________________________________________   
L&#8217;ouverture du Centre National de R&#233;ception des Appels d&#8217;Urgence (CNRAU) accessible 
aux sourds et malentendants fait &#233;merger des questions linguistiques qui portent sur le 
fran&#231;ais &#233;crit des sourds, et des questions informatiques dans le domaine du traitement 
automatique du langage naturel. Le fran&#231;ais &#233;crit des sourds, pratiqu&#233; par une 
population h&#233;t&#233;rog&#232;ne, comporte des sp&#233;cificit&#233;s morpho-syntaxiques et morpho-
lexicales qui peuvent rendre probl&#233;matique la communication &#233;crite entre les personnes 
sourdes appelantes et les agents du CNRAU. Un premier corpus de fran&#231;ais &#233;crit sourd 
&#233;licit&#233; avec mise en situation d&#8217;urgence (FAX-ESSU) a &#233;t&#233; recueilli dans la perspective de 
proposer des solutions TAL et linguistiques aux agents du CNRAU dans le cadre de ces 
&#233;changes &#233;crits. Nous pr&#233;sentons une premi&#232;re &#233;tude lexicale, morphosyntaxique et 
syntaxique de ce corpus reposant en partie sur une cha&#238;ne de traitement automatique, 
afin de valider les ph&#233;nom&#232;nes linguistiques d&#233;crits dans la litt&#233;rature et d'enrichir la 
connaissance du fran&#231;ais &#233;crit des sourds. 
ABSTRACT _________________________________________________________________________________________________________  
Methodological, linguistic and computational challenges for processing written French of 
deaf people 
With the setup of a national emergency call-center for deaf people in France (CNRAU), 
some questions arise in linguistics and natural language processing about the written 
expression of deaf people. It is practiced by an heterogeneous population and shows 
morpho-syntactic, lexical and syntactic specificities which increase the difficulty, over 
the emergency situation, to successfully communicate between the deaf callers and the 
call-center operators. A first corpus (FAX-ESSU) of written French of deaf people was 
built with emergency conditions in order to provide linguistic and NLP solutions to the 
call center operators. On this corpus, we present a first study realized with the help of a 
natural language processing toolbox, in order to validation linguistic phenomenons 
described in the scientific literature and to enrich the knowledge of written French of 
deaf people.  
MOTS-CLES : Fran&#231;ais &#233;crit des sourds, TAL, Fran&#231;ais Langue Etrang&#232;re, linguistique de 
corpus, lexique, syntaxe, m&#233;thodologie.  
KEYWORDS : Written French of deaf people, NLP, French as a foreign language, corpus 
linguistics, lexicon, syntax, methodology. 
</p>
<p>559</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Contexte et motivations de l&#8217;&#233;tude 
</p>
<p>1.1 Contexte institutionnel, sociolinguistique et technologique 
L&#8217;ouverture en septembre 2011 d&#8217;un Centre National de R&#233;ception des Appels d&#8217;Urgence 
(CNRAU, num&#233;ro d&#8217;urgence 114) pour les personnes sourdes et malentendantes r&#233;sulte 
de l'application du d&#233;cret publi&#233; le 16 avril 2008 (pr&#233;vu par l&#8217;article 78 de la loi du 11 
f&#233;vrier 2005). Le centre d'appels concerne trois types d&#8217;urgence : police, pompiers, 
SAMU. Il vise &#224; rendre accessibles dans une modalit&#233; autre qu'audio-vocale les services 
d&#8217;appels d&#8217;urgence &#224; une population sp&#233;cifique, vuln&#233;rable socialement, et h&#233;t&#233;rog&#232;ne 
tant au niveau du potentiel auditif des personnes sourdes, que de leur parcours &#233;ducatif 
et linguistique (Gillot 1998). Selon leur profil, les personnes sourdes ou malentendantes 
peuvent utiliser, avec une ma&#238;trise in&#233;gale, diff&#233;rents modes de communication reposant 
sur un canal visuo-gestuel, audio-vocal ou mixte : la Langue des Signes Fran&#231;aise (LSF), 
langue visuelle-gestuelle pratiqu&#233;e par les personnes sourdes signantes en France ; le 
fran&#231;ais &#233;crit ; ou le fran&#231;ais oral dans certaines conditions, seul ou accompagn&#233; du 
Langage Parl&#233; Compl&#233;t&#233; (LPC, code manuel utilis&#233; par une partie des sourds oralisants, 
pour d&#233;sambig&#252;iser la lecture labiale).  
Pendant les premi&#232;res ann&#233;es de fonctionnement du centre d&#8217;appels, seules sont 
disponibles les modalit&#233;s de communication &#233;crite par fax et par SMS. Or, selon le 
rapport Gillot (1998), 80 % de la population sourde adulte entretient un rapport difficile 
au fran&#231;ais &#233;crit. Ce rapport &#224; l&#8217;&#233;crit des personnes sourdes peut se traduire par des 
productions individuelles qui peuvent mener, pour les agents du 114, &#224; une 
compr&#233;hension approximative ou lacunaire des messages &#233;crits re&#231;us, voire &#224; une 
incompr&#233;hension des situations d&#233;crites par les appelants. Or, les objectifs fix&#233;s au 
CNRAU n&#233;cessitent avant toute chose que les agents sourds et entendants comprennent 
rapidement les messages entrants et formulent des r&#233;ponses &#233;crites dans un fran&#231;ais 
adapt&#233;, c&#8217;est-&#224;-dire interpr&#233;table par l&#8217;appelant sourd. 
Cette situation nous am&#232;ne &#224; envisager des solutions techniques et scientifiques pour que 
le CNRAU puisse assurer sa mission. En premier lieu, il s&#8217;agit de caract&#233;riser les 
ph&#233;nom&#232;nes linguistiques et les types d&#8217;erreurs propres au fran&#231;ais &#233;crit des sourds afin 
d&#8217;alimenter la formation des op&#233;rateurs, mais &#233;galement pour permettre le 
d&#233;veloppement ult&#233;rieur des outils TAL envisag&#233;s en soutien &#224; la prise de d&#233;cision des 
op&#233;rateurs et &#224; la formulation de r&#233;ponses &#233;crites adapt&#233;es. Dans cette perspective, il 
importera &#224; terme de d&#233;terminer l&#8217;outillage formel et technique permettant la correction, 
la compl&#233;tion, la reformulation  et la traduction automatiques des messages transmis au 
centre d&#8217;appels.  
</p>
<p>1.2 Etat de l&#8217;art des descriptions du fran&#231;ais &#233;crit par des sourds 
Le fran&#231;ais &#233;crit des sourds est un domaine d'&#233;tude peu document&#233;. Les rares &#233;tudes 
men&#233;es ces 20 derni&#232;res ann&#233;es r&#233;v&#232;lent des ph&#233;nom&#232;nes morpho-syntaxiques et 
morpho-lexicaux que l&#8217;on retrouve dans les productions &#233;crites des sourds qu&#233;b&#233;cois 
(Nadeau 1993, repris dans Nadeau et Machab&#233;e, 1998), suisses (Niederberger, 2004) et 
fran&#231;ais m&#233;tropolitains (Tuller, 2000 et P&#233;rini, 2007). 
</p>
<p>560</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les personnes sourdes apprennent le fran&#231;ais &#233;crit &#224; partir d&#8217;un acc&#232;s au fran&#231;ais oral 
soit lacunaire (restes auditifs, lecture labiale), soit inexistant. La LSF est langue premi&#232;re 
(L1) dans 10% des cas seulement. Les productions &#233;crites des sourds se caract&#233;risent par 
une grande variabilit&#233; inter-individuelle. Nadeau et Machab&#233;e (1998) ont cependant 
identifi&#233; des ph&#233;nom&#232;nes propres au fran&#231;ais &#233;crit des sourds qui sont absents des 
productions des entendants apprenants du fran&#231;ais &#233;crit L1 et L2. Ces ph&#233;nom&#232;nes 
touchent entre autres les rapports localisant/localis&#233;, possesseur/poss&#233;d&#233;, l&#8217;absence de 
marques morphologiques pour le temps, mais &#233;galement les redondances lexicales, les 
confusions de cat&#233;gories lexicales, et l&#8217;utilisation des pronoms - omission illicite des 
pronoms objets et/ou sujet; confusion entre les 1&#232;re  et 3e personnes. Tuller (2000) ajoute 
l&#8217;ellipse de la pr&#233;position. 
La question suivante se pose tout de m&#234;me : ces productions constituent-elles une 
cat&#233;gorie identifiable (le fran&#231;ais &#233;crit des sourds) poss&#233;dant des caract&#233;ristiques 
communes et des fronti&#232;res bien d&#233;limit&#233;es, ou au contraire s'agit-il d'un continuum de 
productions dont certaines sont plus proches de productions de fran&#231;ais &#233;crit 
d'entendants L1 francophones que d'une autre production de sourd L2. L'&#233;crit des 
entendants comporte lui-m&#234;me un certain degr&#233; de variabilit&#233; inter- et intra- individuel 
mais ces productions restent dans le champ des &#171; possibles &#187; c'est-&#224;-dire de la grammaire 
du fran&#231;ais &#233;crit. L'&#233;tude de notre corpus soutenue par les outils TAL vise &#233;galement &#224; 
r&#233;pondre &#224; cette question. 
</p>
<p>2 Pr&#233;sentation du corpus FAX-ESSU et de la m&#233;thodologie 
</p>
<p>2.1 Le corpus FAX-ESSU  
Quelques extraits choisis : [1] je ne vais pas l&#233; drocteur ; [2] un voiture est brule ; [3] 
elle est tomb&#233;  son lit ; [4] elle tomber tu lit  ; [5] tomb&#233; sur l'escalier ; [6] difficile 
respiratoire 
Le corpus FAX-ESSU (fax Ecrits par des personnes Sourdes en Situation d&#8217;Urgence) est un 
corpus &#233;licit&#233; sous forme de fax d&#8217;urgence r&#233;dig&#233;s en fran&#231;ais &#233;crit par des personnes 
sourdes, mises en situation d&#8217;urgence. Il a &#233;t&#233; recueilli dans la perspective d&#8217;alimenter la 
formation des agents du 114. L'&#233;licitation a pris la forme d'un jeu de r&#244;le pr&#233;sent&#233; par 
une personne sourde en LSF, comportant diverses situations qui n&#233;cessitent un appel 
d'urgence. La consigne donn&#233;e aux 17 participants sourds signants et non signants &#233;tait 
de r&#233;diger un appel d'urgence manuscrit type fax, sur un temps limit&#233; de trente secondes 
apr&#232;s avoir eu connaissance de la situation critique. 23 situations ont &#233;t&#233; pr&#233;sent&#233;es et 
ont donn&#233; lieu &#224; la production d'&#233;nonc&#233;s en fran&#231;ais. Les productions des situations qui 
ont pos&#233; probl&#232;me (manque d'entra&#238;nement pour la situation 1, erreurs dues &#224; une 
mauvaise compr&#233;hension des situations 7 et 8) ont &#233;t&#233; &#233;limin&#233;es, ainsi que les 
productions des locuteurs qui comportaient des dessins non traitables &#224; ce stade. Le 
corpus &#233;tudi&#233; comporte donc 300 productions correspondant &#224; 15 locuteurs et 20 
situations. 
Nous pr&#233;sentons ici une premi&#232;re &#233;tude lexicale, morphosyntaxique et syntaxique du 
corpus FAX-ESSU r&#233;alis&#233;e &#224; la fois manuellement et avec l&#8217;aide d&#8217;une cha&#238;ne de 
traitement automatique, afin de valider les ph&#233;nom&#232;nes linguistiques d&#233;crits dans la 
</p>
<p>561</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>litt&#233;rature et d&#8217;enrichir la connaissance du fran&#231;ais &#233;crit sourd. 
</p>
<p>2.2 M&#233;thodologie  
La premi&#232;re &#233;tude r&#233;alis&#233;e sur le corpus FAX-ESSU a pour objet de faire &#233;merger &#224; l&#8217;aide 
d&#8217;outils TAL des sp&#233;cificit&#233;s du fran&#231;ais &#233;crit des sourds relev&#233;es ou non dans la 
litt&#233;rature. Elle vise &#233;galement &#224; mettre en &#233;vidence les limites d&#8217;une cha&#238;ne de 
traitement TAL, d&#233;di&#233;e initialement au fran&#231;ais standard, dans le traitement du fran&#231;ais 
&#233;crits des sourds.  
Pour cela, nous avons travaill&#233; sur trois niveaux : lexical, morphosyntaxique et 
syntaxique, en proc&#233;dant &#224; des analyses manuelles et des analyses automatiques 
corrig&#233;es manuellement. Pour le niveau syntaxique (section 3.1), l&#8217;analyse du corpus a 
&#233;t&#233; r&#233;alis&#233;e manuellement, en s&#8217;appuyant sur le formalisme des Grammaires de 
Propri&#233;t&#233;s (Blache, 2000). Ce choix a permis de caract&#233;riser les erreurs rencontr&#233;es et de 
les classer par type de contrainte (Propri&#233;t&#233;s) : obligation et exigence (omission du noyau 
syntagmatique et d&#8217;autres cat&#233;gories exigibles), d&#233;pendance (accord), pr&#233;c&#233;dence (ordre 
attendu entre les syntagmes). Une analyse compl&#233;mentaire a &#233;t&#233; men&#233;e, faisant ressortir 
des probl&#232;mes de s&#233;lection de cat&#233;gorie impliquant r&#233;guli&#232;rement le niveau lexical, et 
des ph&#233;nom&#232;nes propres au lexique (section 3.2). 
Les analyses automatiques portent sur les niveaux lexical (en cours d&#8217;&#233;tude) et morpho-
syntaxique (section 3.3) ; elles ont &#233;t&#233; men&#233;es avec la chaine de traitement LPLSuite, 
con&#231;ue au Laboratoire Parole et Langage (Blache, Vanrullen, Balfourier, 2006). Cette 
cha&#238;ne a &#233;t&#233; entra&#238;n&#233;e sur un corpus de fran&#231;ais standard, et &#233;valu&#233;e au cours de la 
campagne nationale d&#8217;&#233;valuation des analyseurs syntaxiques EASY 2004-2006, ce qui 
donne une mesure de sa performance sur le traitement du fran&#231;ais &#233;crit standard en 
comparaison avec les solutions industrielles actuelles. La validation manuelle qui a suivi 
le traitement automatique a impliqu&#233; le travail de trois personnes durant plusieurs mois. 
Pour les trois niveaux, l&#8217;annotation et la correction manuelles, qui s&#8217;appuient sur la 
segmentation et l&#8217;&#233;tiquetage automatique du corpus, ont permis de (1) d&#233;tecter, corriger 
et comptabiliser les erreurs d&#8217;&#233;tiquetage morphosyntaxique ; et (2) mettre en &#233;vidence 
diff&#233;rents ph&#233;nom&#232;nes syntaxiques sp&#233;cifiques au fran&#231;ais &#233;crit  des sourds, et faire 
&#233;merger les patrons syntaxiques correspondants. 
</p>
<p>3 Premiers r&#233;sultats de l&#8217;analyse du corpus FAX-ESSU 
</p>
<p>3.1 Niveau syntaxique : apport des grammaires formelles 
L&#8217;analyse syntaxique du corpus repose sur le formalisme des Grammaires de Propri&#233;t&#233;s 
(Blache 2000). Cette analyse a permis de mettre en &#233;vidence 54 ph&#233;nom&#232;nes syntaxiques 
dont la fr&#233;quence dans les &#233;nonc&#233;s produits varie de 0,3 % &#224; 62%. Une analyse 
compl&#233;mentaire portant sur la s&#233;lection de la cat&#233;gorie morpho-syntaxique a permis de 
relever en plus 26 ph&#233;nom&#232;nes dont la fr&#233;quence va de 0,3 &#224; 16 %.  
Dans la figure 1, nous indiquons le risque de rencontrer un type de ph&#233;nom&#232;ne donn&#233; 
dans un &#233;nonc&#233;, 100% correspondant &#224; une erreur de ce type par &#233;nonc&#233; (17 mots en 
moyenne par &#233;nonc&#233;). Sont concern&#233;s : l'omission du noyau syntagmatique, obligatoire, 
</p>
<p>562</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(65%) ou d&#8217;une autre cat&#233;gorie exig&#233;e dans le syntagme (105%) ; les erreurs dans la 
s&#233;lection de la cat&#233;gorie (39%) ou du lex&#232;me (50%) au sein d&#8217;une m&#234;me cat&#233;gorie ; une 
erreur d'accord (24%) &#8211; genre, nombre, personne  &#8211; qui concerne un &#233;nonc&#233; sur quatre ; 
et un probl&#232;me de pr&#233;c&#233;dence portant sur un mot ou un syntagme mal positionn&#233; (8%). 
 
 
 
 
 
 
</p>
<p>FIGURE 1 &#8211; % d&#8217;apparition des types de ph&#233;nom&#232;nes rencontr&#233;s dans le corpus 
Le tableau 1 regroupe nos observations syntaxiques sur les faits les plus remarquables 
qui apparaissent dans les proportions suivantes (ordre d&#233;croissant) : l&#8217;omission du 
d&#233;terminant (62%), de la pr&#233;position (35%)  et du verbe (28%) ; la s&#233;lection de la forme 
verbale ad&#233;quate (39%) qui concerne pour 28% la cat&#233;gorie &#8216;verbe&#8217; avec un participe 
pass&#233; ou une forme infinitive au lieu d&#8217;un verbe fl&#233;chi ; et pour 11 % une confusion 
intra-cat&#233;gorielle avec un nom &#224; la place d&#8217;un verbe fl&#233;chi ou d&#8217;un participe pass&#233;. 
Types d&#8217;erreurs 
</p>
<p>en % des &#233;nonc&#233;s 
Omission Accord S&#233;lection de cat&#233;gorie 
</p>
<p>ou de lex&#232;me Obligation Exigence  D&#233;pendance 
Verbe 28% 11% 
</p>
<p>(auxiliaire) 
5% (genre) 
3% (personne) 
4% (nombre) 
</p>
<p>13% (part. pass&#233;) 
11% (auxiliaire) 
4% (infinitif) 
</p>
<p>Pr&#233;position 35%   11% (choix pr&#233;position) 
D&#233;terminant  62% 5% (genre) 
</p>
<p>6% (nombre) 
3% (err. choix 
d&#233;terminant) 
</p>
<p>Nom (1%) 17% (nom ou 
pronom sujet) 
</p>
<p> 2% (adj) 
6% (verbe) 
5% (part. pass&#233;) 
</p>
<p>Pronom   8% (err. choix pronom) 
Adverbe (n&#233;g.)  4% (&#171; ne &#187;)   
TABLEAU 1 &#8211;% d&#8217;apparition sur le corpus des ph&#233;nom&#232;nes syntaxiques les plus fr&#233;quents 
</p>
<p>Le mod&#232;le des Grammaires de Propri&#233;t&#233;s a permis de rendre compte des ph&#233;nom&#232;nes 
syntaxiques les plus massifs en termes de fr&#233;quence dans les &#233;nonc&#233;s produits. L&#8217;analyse 
compl&#233;mentaire a contribu&#233; &#224; affiner l&#8217;analyse sur la s&#233;lection des cat&#233;gories et des 
lex&#232;mes, qui ne sont pas prises en compte par les GP. 
Cette premi&#232;re analyse fait ressortir des patrons syntaxiques exploitables en TAL. Dans le 
cadre des GP, ces patrons peuvent prendre la forme d&#8217;un assouplissement de certaines 
contraintes (obligation, exigence, d&#233;pendance). A titre d&#8217;exemple, un tel assouplissement 
permettrait de caract&#233;riser des syntagmes verbaux dont le noyau ou l&#8217;auxiliaire seraient 
absents ou encore dont le noyau serait une cat&#233;gorie nominale ; de caract&#233;riser des 
</p>
<p>563</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>syntagmes pr&#233;positionnels sans pr&#233;position ( !) ; de m&#234;me pour l&#8217;absence du d&#233;terminant 
dans les syntagmes nominaux  ou encore l&#8217;absence du pronom sujet relatif et donc du SN 
dans les propositions relatives. 
</p>
<p>3.2 Analyse manuelle du lexique : premiers r&#233;sultats 
Les ph&#233;nom&#232;nes qui concernent le lexique apparaissent 1,5 fois par &#233;nonc&#233; (154%), sans 
compter les ph&#233;nom&#232;nes de choix du lex&#232;me  que nous avons d&#233;crits en section 3.1 
(emploi d&#8217;un mot pour un autre au sein de la m&#234;me cat&#233;gorie). Les erreurs 
d&#8217;accentuation (60%) ne constituent pas seulement un probl&#232;me lexical, mais peuvent 
provoquer une confusion de la cat&#233;gorie au niveau morphosyntaxique. Par exemple, 
l&#8217;absence d&#8217;accent sur un participe pass&#233; (blesse/bless&#233;) qui concerne plus de 15% des 
&#233;nonc&#233;s entra&#238;ne une mauvaise identification de la cat&#233;gorie concern&#233;e par l&#8217;&#233;tiqueteur 
automatique. 
En plus de ces ambigu&#239;t&#233;s d&#8217;origine accentuelle, les probl&#232;mes lexicaux tels que les mots 
invent&#233;s (cacatouches/cacahu&#232;tes) ou ceux orthographi&#233;s de fa&#231;on approximative 
(drocteur/docteur), abr&#233;g&#233;e ou tronqu&#233;e, ont &#233;galement un impact sur la qualit&#233; de 
l&#8217;&#233;tiquetage automatique, et par suite sur l&#8217;analyse syntaxique automatique. 
 
 
 
 
 
 
</p>
<p>FIGURE 2 &#8211; % d&#8217;apparition des ph&#233;nom&#232;nes lexicaux (hors choix du lex&#232;me) 
La situation d&#8217;urgence peut &#234;tre directement mise en cause dans l&#8217;usage d&#8217;abr&#233;viations 
(Dr/docteur ; bcp/beaucoup), de troncations en fin d&#8217;&#233;nonc&#233; (doct/docteur ; enf/enfant) 
ou de symboles (+/plus). Ce ph&#233;nom&#232;ne peut &#234;tre compar&#233; aux productions observ&#233;es 
dans les SMS. Enfin, les ph&#233;nom&#232;nes concernant les figements ou expressions 
idiomatiques telles que perdre les eaux, prendre feu, tomber dans les pommes, qui n&#8217;ont 
pas &#233;t&#233; relev&#233;s de mani&#232;re syst&#233;matique, devront faire l&#8217;objet d&#8217;une &#233;tude d&#233;taill&#233;e. Une 
&#233;tude compl&#233;mentaire du lexique qui s&#8217;appuie sur la segmentation automatique est en 
cours. Elle porte plus particuli&#232;rement sur la variabilit&#233; lexicale au sein du corpus FAX-
ESSU chez les scripteurs sourds. 
</p>
<p>3.3 Etiquetage morphosyntaxique automatique 
Nous avons souhait&#233; v&#233;rifier la couverture et la pertinence d&#8217;un &#233;tiqueteur morpho-
syntaxique automatique (POS-tagger) pour l&#8217;&#233;tude du corpus FAX-ESSU, sachant que le 
processus d&#8217;&#233;tiquetage est bas&#233; sur l&#8217;apprentissage d&#8217;un corpus de fran&#231;ais &#233;crit standard. 
Les donn&#233;es quantitatives issues de l&#8217;&#233;tiquetage et de la segmentation automatiques 
permettent de dessiner un premier contour tr&#232;s g&#233;n&#233;ral du corpus. Les 346 phrases 
reconnues contiennent en tout 4434 mots dont 681 formes distinctes. 181 de ces formes 
</p>
<p>564</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(soit 26,8%) n&#8217;appartiennent pas au lexique du fran&#231;ais mais correspondent &#224; des erreurs 
orthographiques et &#224; des mots inconnus. La figure 3 indique la r&#233;partition des cat&#233;gories 
pr&#233;sentes dans le corpus sur la base de l&#8217;&#233;tiquetage automatique (vert) effectu&#233; avec 
l&#8217;&#233;tiqueteur de la cha&#238;ne d&#8216;outils LPLSuite. puis corrig&#233; manuellement (rouge). 
 
 
 
 
 
 
 
</p>
<p>FIGURE 3&#8211; Couverture du POS-tagger sur le corpus FAX-ESSU 
Une &#233;tude plus d&#233;taill&#233;e des erreurs de cat&#233;gorisation de l&#8217;&#233;tiqueteur montre que le nom, 
le verbe, le pronom et l&#8217;adjectif sont moins bien &#233;tiquet&#233;es que le d&#233;terminant, l&#8217;adverbe 
et la pr&#233;position. En dehors de l&#8217;erreur d&#233;j&#224; constat&#233;e en fran&#231;ais standard sur 
l&#8217;ambig&#252;it&#233; adjectif/participe pass&#233;, on constate au moins trois types d&#8217;erreurs 
d&#8217;&#233;tiquetage imputables &#224; la structure syntaxique du fran&#231;ais &#233;crit des sourds : verbes 
interpr&#233;t&#233;s comme noms, pronoms reconnus comme pr&#233;positions, noms reconnus comme 
adjectifs. De fait, le taux important d&#8217;omissions et d&#8217;erreurs lexicales dans le corpus a un 
impact significatif sur l&#8217;&#233;tiquetage. Par exemple, la cat&#233;gorie Nom est &#233;tiquet&#233;e 34 fois 
en tant qu&#8217;adjectif , 21 fois comme d&#233;terminant, 23 fois en tant que verbe et 13 fois en 
tant que  nom avec cependant des traits erron&#233;s (par ex. masc. au lieu de f&#233;m.) 
</p>
<p>4 Discussion des premiers r&#233;sultats et perspectives 
</p>
<p>Les ph&#233;nom&#232;nes que nous avons pu relever se recoupent avec les ph&#233;nom&#232;nes point&#233;s 
par la litt&#233;rature (cf section 1.2). Les probl&#232;mes de compr&#233;hension relev&#233;s par les 
lecteurs et annotateurs humains se retrouvent au niveau du traitement automatique sous 
la forme d&#8217;erreurs de cat&#233;gorisation des lex&#232;mes et des syntagmes. D&#232;s l&#8217;&#233;tape de 
l&#8217;&#233;tiquetage morphosyntaxique, et de fa&#231;on encore plus pro&#233;minente au niveau 
syntaxique, apparaissent des difficult&#233;s et des erreurs de traitement li&#233;es aux sp&#233;cificit&#233;s 
du fran&#231;ais &#233;crit des sourds. Le TAL offre sur ce sujet un &#233;clairage pr&#233;cis, notamment 
gr&#226;ce &#224; un outillage linguistique formel. 
Apr&#232;s plusieurs mois de fonctionnement du num&#233;ro 114, les messages SMS semblent 
constituer l&#8217;essentiel des appels re&#231;us au centre 114. La constitution d&#8217;un corpus SMS 
d&#8217;urgence n&#233;cessitera l&#8217;anonymisation des donn&#233;es et une gestion des droits et agr&#233;ments 
permettant l&#8217;exploitation d&#8217;un corpus du domaine de la sant&#233; (HAS). Dans ces conditions, 
plusieurs &#233;tudes sont envisag&#233;es : dans un premier temps, la m&#233;thodologie linguistique et 
TAL d&#233;velopp&#233;e et ajust&#233;e pour l&#8217;&#233;tude du corpus FAX-ESSU pourra &#234;tre appliqu&#233;e &#224; 
l&#8217;&#233;tude des SMS d&#8217;urgence. Puis le corpus SMS sourds d&#8217;urgence pourra &#234;tre compar&#233; aux 
productions SMS sourds m&#233;tropolitains et de la R&#233;union r&#233;cemment recueillies (Blondel 
et al., 2011), ainsi qu&#8217;aux SMS francophones recueillis dans le cadre de la campagne 
</p>
<p>565</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SMS4Science (Antoniadis et al., 2011). L&#8217;&#233;tude comparative de ces diff&#233;rents corpus 
permettra de mettre &#233;vidence dans les corpus ESSU ce qui tient &#224; la communication 
m&#233;di&#233;e par SMS, ce qui tient au fran&#231;ais &#233;crit des sourds et ce qui provient de la 
situation d'urgence elle-m&#234;me. 
</p>
<p>Remerciements 
</p>
<p>Nous remercions les personnes qui ont contribu&#233; &#224; la r&#233;alisation de ce travail : Christian, 
Christine, Jo&#235;lle et Roberto pour nourrir nos r&#233;flexions sur le fran&#231;ais &#233;crit des sourds, 
les participants sourds au corpus &#233;licit&#233; ; Samia et Patricia pour leur travail pr&#233;paratoire 
sur le corpus ; Elodie, Fanny et Joy pour leur contribution &#224; l&#8217;analyse des donn&#233;es. 
</p>
<p> &#233;f&#233;rences 
</p>
<p>ANTONIADIS, G., CHABERT, G., ZAMPA, V. (2011). Alpes4science : Constitution d'un corpus 
de SMS r&#233;els en France m&#233;tropolitaine. 79eme congr&#232;s de l'ACFAS. 9-13 mai 2011, 
Sherbrook. 
BLACHE, Ph. (2000). Le r&#244;le des contraintes dans les th&#233;ories linguistiques et leur int&#233;r&#234;t 
pour l'analyse automatique : les Grammaires de Propri&#233;t&#233;s. Actes de TALN 2000 
(Traitement Automatique des Langues Naturelles). 
BLACHE Ph., T. VANRULLEN &amp; J.-M. BALFOURIER (2006). Constraint-Based Parsing as an 
Efficient Solution: Results from the Parsing Evaluation Campaign EASy. Proceedings of 
LREC 2006. 
BLONDEL, M., GONAC&#8217;H, J., LEDEGEN G. &amp; J. SEELI (2011). Ecriture-sms en M&#233;tropole et &#224; La 
R&#233;union : &#171; Zones instables et flottantes &#187; du fran&#231;ais ordinaire et sp&#233;cificit&#233;s du contexte 
de surdit&#233;. Gilles Col (dir.), Transcrire, &#201;crire, Formaliser (1). Travaux linguistiques du 
CERLICO, 23. 
GILLOT, D. (1998). Le droit des sourds : 115 propositions. Rapport parlementaire au 
Premier Ministre. 
NADEAU, M. (1993). Peut-on parler de &quot;fran&#231;ais sourd&quot;? Revue de l'Association 
canadienne de linguistique appliqu&#233;e (ACLA), vol. 15, no 2, pages 97-117. 
NADEAU, M &amp; D. MACHABEE (1998). Dans quelle mesure les erreurs des sourds sont-elles 
comparables &#224; celles des entendants ? in Dubuisson C. &amp; Daigle D. (Dir.), Lecture, 
&#233;criture et surdit&#233;, Montr&#233;al, Logiques &#233;dition, pages 169-195. 
NIEDERBERGER, N. (2004). Capacit&#233;s langagi&#232;res en langue des signes fran&#231;aise et en 
fran&#231;ais chez l&#8217;enfant sourd bilingue : quelles relations ? Th&#232;se de Psychologie, 
Universit&#233; de Gen&#232;ve.  
PERINI, M. (2007). La rem&#233;diation de l'illettrisme chez les adultes sourds locuteurs de la 
LSF : travail pr&#233;paratoire &#224; l'&#233;laboration d'une m&#233;thodologie et de supports p&#233;dagogiques 
adapt&#233;s. M&#233;moire de Master 2, Universit&#233; Paris 8. 
TULLER, L. (2000). Aspects de la morphosyntaxe du fran&#231;ais des sourds. Recherches 
Linguistiques de Vincennes 29, pages 143-156, PUV. 
</p>
<p>566</p>

</div></div>
</body></html>