<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>ROCme! : logiciel pour l&#8217;enregistrement et la gestion de corpus oraux</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 5: D&#233;monstrations, pages 19&#8211;20,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>ROCme! : logiciel pour l&#8217;enregistrement et la gestion de 
corpus oraux 
</p>
<p>Emmanuel Ferragne1   S&#233;bastien Flavier2 Christian Fressard2 
(1) CLILLAC-ARP, Universit&#233; Paris 7 
</p>
<p>(2) Dynamique Du Langage, UMR 5596, CNRS-Universit&#233; de Lyon 
rocme@ish-lyon.cnrs.fr 
</p>
<p>R&#201;SUM&#201; ____________________________________________________________________________________________________________  
&#8232;ROCme! permet une gestion rationalis&#233;e, autonome et d&#233;mat&#233;rialis&#233;e de l&#8217;enregistrement 
de corpus oraux. Il dispose notamment d&#8217;une interface pour le recueil de m&#233;tadonn&#233;es 
sur les locuteurs totalement param&#233;trable via des balises XML. Les locuteurs peuvent 
g&#233;rer les r&#233;ponses au questionnaire, l&#8217;enregistrement audio, la lecture, la sauvegarde et 
le d&#233;filement des phrases (ou autres types de corpus) en toute autonomie. ROCme! 
affiche du texte, avec ou sans mise en forme HTML, des images, du son et des vid&#233;os.  
ABSTRACT _________________________________________________________________________________________________________  
ROCme!: software for the recording and management of oral corpora 
ROCme! has been designed to allow a sensible, autonomous, and dematerialized 
management of speech recordings. Users can create interfaces for metadata collection 
thanks to XML tags. Speakers autonomously fill in questionnaires, record, play, and save 
audio; and browse sentences (or other types of corpora). ROCme! can display text, 
optionally with HTML formatting, images, sounds, and video.  
MOTS-CL&#201;S : corpus, oral, linguistique, logiciel 
KEYWORDS : corpus, oral, linguistics, software 
</p>
<p>1 R&#233;sum&#233; 
Le d&#233;veloppement du logiciel ROCme!1 &#8211; Recording of Oral Corpora Made Easy &#8211; 
intervient en r&#233;ponse &#224; un besoin de la communaut&#233; des linguistes. Il s&#8217;agit de : i) 
permettre &#224; un locuteur d&#8217;enregistrer de fa&#231;on autonome des phrases qui s&#8217;affichent &#224; 
l&#8217;&#233;cran, ii) recueillir des m&#233;tadonn&#233;es par le biais d&#8217;un questionnaire d&#233;mat&#233;rialis&#233;, iii) 
assurer la coh&#233;rence de la proc&#233;dure &#224; travers un projet d&#8217;enregistrement. 
ROCme! s&#8217;appuie sur le moteur d&#8217;ex&#233;cution Adobe AIR pour offrir une interface 
graphique conviviale compatible Windows et Mac. Les locuteurs g&#232;rent l&#8217;enregistrement 
de leurs productions orales via les boutons de l&#8217;interface ou les touches du clavier. Les 
phrases &#224; afficher sont incluses dans un fichier texte UTF-8. 
Afin de garantir une collecte coh&#233;rente des donn&#233;es orales, il convient de d&#233;finir un 
ensemble de contraintes favorisant l&#8217;homog&#233;n&#233;it&#233; d&#8217;une s&#233;rie d&#8217;enregistrements ; c&#8217;est le 
but de la notion de projet. Ainsi, &#224; la cr&#233;ation d&#8217;un projet, on pourra  choisir de pr&#233;senter 
les stimuli en ordre al&#233;atoire, et de faire appara&#238;tre un masque entre le d&#233;clenchement 
de l&#8217;enregistrement et l&#8217;apparition d&#8217;un stimulus (pour &#233;viter que le d&#233;but ne soit coup&#233;). 
                                                   
1 www.ddl.ish-lyon.cnrs.fr/rocme 
</p>
<p>19</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>On peut aussi interdire la sauvegarde d&#8217;un signal &#233;cr&#234;t&#233;, pr&#233;voir un mot de passe 
emp&#234;chant le participant de quitter le prompteur, afficher une horloge (utile pour des 
locuteurs pay&#233;s &#224; l&#8217;heure), passer dans un mode o&#249; chaque locuteur ne lit qu&#8217;une partie 
du corpus, ou encore enregistrer plusieurs fois chaque phrase. Concernant la collecte des 
m&#233;tadonn&#233;es, le projet peut pr&#233;voir que l&#8217;utilisateur soit invit&#233; &#224; remplir lui-m&#234;me son 
questionnaire. Enfin, les options audio (taux d&#8217;&#233;chantillonnage, r&#233;solution d&#8217;amplitude et 
nombre de canaux) sont param&#233;trables.  
ROCme! permet la mise en place d&#8217;un questionnaire pour le recueil de m&#233;tadonn&#233;es &#224; 
partir de balises XML. &#192; la cr&#233;ation, le code XML peut &#234;tre directement entr&#233; dans une 
bo&#238;te de l&#8217;interface pour pr&#233;-visualiser la version graphique du questionnaire. Un 
exemple est pr&#233;sent&#233; dans la Figure 1, qui inclut les 6 valeurs de types de donn&#233;es prises 
en compte par ROCme ! (age, date, number, single, choice, multiple). Sp&#233;cifier un type 
de donn&#233;es est optionnel, mais vivement recommand&#233; car ROCme! dispose d&#8217;un module 
qui traite les valeurs de type pour proposer en temps r&#233;el des statistiques descriptives 
concernant le projet, permettant ainsi &#224; l&#8217;investigateur de rep&#233;rer rapidement certains 
d&#233;s&#233;quilibres et donc d&#8217;ajuster sa strat&#233;gie de recrutement. 
 
&lt;user&gt; 
</p>
<p>&lt;field id=&quot;Nom&quot; required=&quot;required&quot;&gt;&lt;/field&gt; 
&lt;field id=&quot;Sexe&quot; type=&quot;single&quot; required=&quot;required&quot;&gt; 
</p>
<p>&lt;field id=&quot;Homme&quot;&gt;&lt;/field&gt; 
&lt;field id=&quot;Femme&quot;&gt;&lt;/field&gt; 
&lt;/field&gt; 
&lt;field id=&quot;&#194;ge&quot; type=&quot;age&quot; required=&quot;required&quot;&gt;&lt;/field&gt; 
&lt;field id=&quot;Date_de_naissance&quot; type=&quot;date&quot;&gt;&lt;/field&gt; 
&lt;field id=&quot;Nombre_d'enfants&quot; type=&quot;number&quot;&gt;&lt;/field&gt; 
&lt;field id=&quot;Lieu_de_r&#233;sidence&quot; lbl=&quot;Lieu de r&#233;sidence 
</p>
<p>     des 10 derni&#232;res ann&#233;es&quot; type=&quot;choice&quot;&gt; 
&lt;field id=&quot;Nord&quot;&gt;&lt;/field&gt; 
&lt;field id=&quot;Sud&quot;&gt;&lt;/field&gt; 
</p>
<p>&lt;/field&gt; 
&lt;field id=&quot;Langues_parl&#233;es&quot; type=&quot;multiple&quot;&gt; 
&lt;group&gt; 
</p>
<p>&lt;field id=&quot;Langue&quot;/&gt; 
&lt;/group&gt; 
</p>
<p>&lt;/field&gt;  
</p>
<p>&lt;/user&gt; 
</p>
<p>FIGURE 1 &#8211; Questionnaire en version XML et interface graphique correspondante 
</p>
<p>Remerciements 
Le projet ROCme! a re&#231;u le soutien financier du Bonus Qualit&#233; Recherche de l&#8217;Universit&#233; 
Paris 7 Diderot et le soutien technique du Laboratoire Dynamique Du Langage.  
 
</p>
<p>20</p>

</div></div>
</body></html>