<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>ACOLAD Plateforme pour l&#8217;&#233;dition collaborative d&#233;pendancielle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 335&#8211;342,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>ACOLAD Plateforme pour l&#8217;&#233;dition collaborative d&#233;pendancielle 
Francis Brunet-Manquat et J&#233;r&#244;me Goulian 
</p>
<p>LIG-GETALP, Universit&#233; Pierre Mend&#232;s France Grenoble 2 
Francis.Brunet-Manquat@imag.fr et Jerome.Goulian@imag.fr 
</p>
<p>RESUME ____________________________________________________________________________________________________________  
Cet article pr&#233;sente une plateforme open-source pour l&#8217;&#233;dition collaborative de corpus 
de d&#233;pendances. Cette plateforme, nomm&#233;e ACOLAD (Annotation de COrpus 
Linguistique pour l&#8217;Analyse de D&#233;pendances), propose des services manuels de 
segmentation et d&#8217;annotation multi-niveaux (segmentation en mots et en syntagmes 
minimaux (chunks), annotation morphosyntaxique des mots, annotation syntaxique des 
chunks et annotation syntaxique des d&#233;pendances entre mots ou entre chunks). Dans cet 
article, nous pr&#233;sentons la plateforme ACOLAD, puis nous d&#233;taillons  la repr&#233;sentation 
pivot utilis&#233;e pour g&#233;rer les annotations concurrentes, enfin d&#233;crivons le m&#233;canisme 
d&#8217;importation de ressources linguistiques externes. 
ABSTRACT __________________________________________________________________________________________________________ 
ACOLAD: platform for collaborative dependency annotation 
This paper presents an open-source platform for collaborative editing dependency 
corpora. ACOLAD platform (Annotation of corpus linguistics for the analysis of 
dependencies) offers manual annotation services such as segmentation and multi-level 
annotation (segmentation into words and phrases minimum (chunks), morphosyntactic 
annotation of words, syntactic annotation chunks and annotating syntactic 
dependencies between words or chunks). In this paper, we present ACOLAD platform, 
then we detail the representation used to manage concurrent annotations, then we 
describe the mechanism for importing external linguistic resources. 
MOTS-CLES : annotation collaborative de corpus, annotations concurrentes, d&#233;pendances 
KEYWORDS : corpus collaborative annotation, concurrent annotations, dependencies 
</p>
<p>1 Introduction 
De nombreuses applications de TAL n&#233;cessitent de grandes quantit&#233;s de donn&#233;es 
annot&#233;es manuellement. La production de ces donn&#233;es est co&#251;teuse. D&#8217;autre part, la 
nature et la qualit&#233; des annotations &#224; produire d&#233;pendent tr&#232;s largement des besoins en 
terme d&#8217;exploitations futures du corpus (Valli et V&#233;ronis, 1999). Pour faciliter la 
production de tels corpus, plusieurs outils r&#233;cents ont &#233;t&#233; d&#233;velopp&#233;s parmi lesquels on 
peut citer : l&#8217;application Web 2.0 System EasyRef d&#233;velopp&#233; dans le cadre de l&#8217;ANR 
action Passage pour annoter des corpus syntaxiques dans les formats Easy et Passage 
(Paroubek et al., 2009), l&#8217;extension firefox WebAnnotator qui permet d&#8217;annoter des 
pages Web selon une DTD d&#233;finie par l&#8217;utilisateur (Xavier, 2012). Ces outils tentent de 
r&#233;soudre de nombreux probl&#232;mes li&#233;s &#224; la cr&#233;ation de corpus, en particulier, l&#8217;aspect 
collaboratif pour EasyRef et l&#8217;aspect g&#233;n&#233;rique pour WebAnnotator. Dans cet article, 
nous nous int&#233;ressons &#224; 2 probl&#232;mes cruciaux li&#233;s &#224; l&#8217;annotation de corpus : Comment 
</p>
<p>335</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>repr&#233;senter les annotations concurrentes ? Comment importer et utiliser de mani&#232;re 
g&#233;n&#233;rique des ressources linguistiques externes comme des dictionnaires ou des analyses 
morphosyntaxiques ?  
Nous tentons avec la plateforme ACOLAD (Annotation de COrpus Linguistique pour 
l&#8217;Analyse de D&#233;pendances) de r&#233;pondre &#224; ces questions. Cette plateforme open-source a 
&#233;t&#233; d&#233;velopp&#233;e avec pour objectif de faciliter la t&#226;che d&#8217;&#233;dition collaborative lors de la 
cr&#233;ation d&#8217;un corpus de d&#233;pendance. Elle propose des services manuels de segmentation 
et d&#8217;annotation multi-niveaux (segmentation en mots et en syntagmes minimaux 
(chunks), annotation morphosyntaxique des mots, annotation syntaxique des chunks et 
annotation syntaxique des d&#233;pendances entre mots ou entre chunks). 
Apr&#232;s une vue d&#8217;ensemble de la plateforme ACOLAD, nous nous focalisons dans cet 
article sur la repr&#233;sentation pivot utilis&#233;e pour g&#233;rer les annotations concurrentes et le 
m&#233;canisme d&#8217;importation de ressources linguistiques externes. 
</p>
<p>2 ACOLAD, une plateforme pour l&#8217;&#233;dition de corpus de 
d&#233;pendances 
</p>
<p>2.1 Pr&#233;sentation 
L&#8217;id&#233;e est de proposer sur la m&#234;me plateforme une palette de services permettant la 
cr&#233;ation de corpus annot&#233;s pour les besoins classiques de d&#233;veloppement d&#8217;outils 
linguistiques. Les int&#233;r&#234;ts de notre environnement sont les suivants : 
</p>
<p>&#8211; visualisation et &#233;dition graphique simple des annotations (voir figure 1) ; 
</p>
<p> 
Figure 1 : cr&#233;ation d&#8217;une analyse de d&#233;pendances 
</p>
<p>&#8211; &#233;dition manuelle configurable : 
o choix entre diff&#233;rentes granularit&#233;s d&#8217;unit&#233;s d&#8217;annotations (d&#233;pendances 
</p>
<p>entre mots et/ou entre chunks) ; 
o possibilit&#233; d&#8217;utiliser diff&#233;rents jeux d&#8217;&#233;tiquettes (grammaticales, 
</p>
<p>syntaxiques au niveau des chunks et des d&#233;pendances) pour tenir 
compte des sp&#233;cificit&#233;s de chaque corpus (&#233;crit, oral transcrit ou oral 
issu de la reconnaissance de parole par exemple) et des besoins en 
terme d&#8217;exploitation future du corpus ; 
</p>
<p>336</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>o choix des contraintes structurelles de d&#233;pendances &#224; associer &#224; l&#8217;&#233;dition 
en cours1 (projectivit&#233; ou non projectivit&#233;, analyse totale ou partielle) ; 
</p>
<p>&#8211; possibilit&#233; d&#8217;&#233;diter simultan&#233;ment les ambigu&#239;t&#233;s d&#8217;analyse tant au niveau mots, 
chunks, qu&#8217;au niveau des d&#233;pendances syntaxiques. 
</p>
<p>2.2 Architecture de la plateforme ACOLAD 
La plateforme ACOLAD est une application web consacr&#233;e au d&#233;veloppement 
collaboratif de corpus de d&#233;pendances. La plateforme est organis&#233;e en une architecture 
3-tiers classique (voir figure 2) : une couche de pr&#233;sentation (responsable de l&#8217;interface 
avec les utilisateurs), une couche de traitement (qui fournit les services) et une couche 
donn&#233;es (responsable du stockage des donn&#233;es persistantes). 
</p>
<p> 
Figure 2 : architecture g&#233;n&#233;rale de la plateforme ACOLAD 
</p>
<p>Pour utiliser la plateforme ACOLAD, le responsable de la t&#226;che d&#8217;annotation du corpus 
n&#8217;a pas &#224; &#233;crire de code sp&#233;cifique Java ni de pages Web dynamiques sp&#233;cifiques. Il doit 
simplement fournir, outre la liste des annotateurs et des mod&#233;rateurs, une description 
du jeu d&#8217;&#233;tiquettes (sous forme XML) et &#233;ventuellement les dictionnaires n&#233;cessaires &#224; la 
t&#226;che (quelques dictionnaires sont d&#233;j&#224; int&#233;gr&#233;s, par exemple LEFFF/DELAF pour le 
fran&#231;ais). 
</p>
<p>3 Repr&#233;sentation pivot pour l&#8217;annotation concurrente 
La plateforme ACOLAD se base sur une repr&#233;sentation par pivot pour distinguer les 
diff&#233;rences de segmentation, d&#8217;&#233;tiquetage et d&#8217;annotation d&#233;pendancielle. 
</p>
<p>3.1 Matrice de d&#233;pendances (MD) 
Toute annotation est d&#233;crite, dans notre plate-forme, par une repr&#233;sentation matricielle. 
Notre repr&#233;sentation, nomm&#233;e matrice de d&#233;pendance (MD), est un couple &lt;L, M&gt; 
compos&#233; de : 
</p>
<p>&#8211; Une liste de n&#339;uds (L), un n&#339;ud &#233;tant compos&#233; d&#8217;informations linguistiques 
</p>
<p>                                                   
1 Pour le moment il s&#8217;agit d&#8217;une liste pr&#233;-&#233;tablie de contraintes. 
</p>
<p>337</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>relatives aux mots et/ou aux chunks2 qu&#8217;il d&#233;crit ; 
&#8211; Une matrice carr&#233;e (M) permettant de d&#233;crire les d&#233;pendances entre n&#339;uds 
</p>
<p>(impl&#233;ment&#233;e sous forme de matrice creuse). La case (i, j) contient l&#8217;ensemble 
des d&#233;pendances entre le n&#339;ud i et le n&#339;ud j de la liste de n&#339;uds. 
</p>
<p> 
Figure 3 : exemple d&#8217;analyse de d&#233;pendances 
</p>
<p>La MD correspondant &#224; la structure de d&#233;pendance syntaxique de la figure 3 est : 
L =                                                       M = 
</p>
<p> 
</p>
<p> 
 
Cette repr&#233;sentation matricielle des donn&#233;es pr&#233;sente trois avantages pour le traitement 
informatique : 
</p>
<p>&#8211; Maniabilit&#233; : de nombreux outils math&#233;matiques sont associ&#233;s aux matrices : 
ajout, suppression, comparaison, etc. Tous ces outils permettent un traitement 
simple de l&#8217;information contenue dans une matrice. 
</p>
<p>&#8211; Efficacit&#233; : les m&#233;thodes utilisant les matrices comme structures de donn&#233;es, 
telle que la reconnaissance de motifs ou la fusion de matrice, se montrent tr&#232;s 
efficaces et tr&#232;s simples &#224; mettre en place. 
</p>
<p>&#8211; Simplicit&#233; de la description d&#8217;analyse multi-niveaux (toutes les informations 
peuvent &#234;tre pr&#233;sente dans la m&#234;me matrice de d&#233;pendances) 
</p>
<p>3.2 Annotations concurrentes 
Pour illustrer le m&#233;canisme de gestion d&#8217;annotations concurrentes d&#8217;ACOLAD, nous 
prenons comme exemple dans la suite le cas de segmentations multiples. Le principe 
consiste &#224; regrouper les n&#339;uds repr&#233;sentant la m&#234;me segmentation dans la phrase 
(information commune minimale). Mais elle consiste &#233;galement &#224; repr&#233;senter les 
discordances issues des diff&#233;rentes segmentations des structures et dues, par exemple, 
aux mots compos&#233;s, aux entr&#233;es des dictionnaires (&#201;tats Unis ou &#201;tats-Unis), etc. 
Pour ce faire, nous cr&#233;ons une structure, appel&#233;e r&#233;seau de segmentation (RS), 
repr&#233;sentant les diff&#233;rentes segmentations de la phrase et permettant de lier les n&#339;uds 
</p>
<p>                                                   
2 Dans la suite de l&#8217;article, on ne traitera pour l&#8217;exemple que les relations de d&#233;pendance entre mots. 
</p>
<p>la :: cat=d&#233;terminant 
recherche :: cat=nom 
fran&#231;aise :: cat= adjectif 
perd :: cat=verbe 
ses :: cat=d&#233;terminant 
moyens :: cat=nom 
</p>
<p>338</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>des structures. Ce r&#233;seau peut &#234;tre vu comme un &#171; pivot de liaison &#187; entre ces structures. 
Ce r&#233;seau est un treillis, chaque n&#339;ud du r&#233;seau repr&#233;sentant une segmentation possible 
d&#8217;un mot et servant de liaison entre les n&#339;uds des structures de d&#233;pendance. 
Concr&#232;tement, un n&#339;ud Nrs d&#8217;un RS contient deux informations : 
</p>
<p>&#8211; SNODE(Nrs) : intervalles repr&#233;sentant la sous-cha&#238;ne dans la phrase 
correspondant au n&#339;ud Nrs, Par exemple, les mots de la phrase &#171; On avait 
d&#233;nombr&#233; cent vingt-neuf candidats &#187; auront pour intervalles : On[1-2], 
avait[3-7], d&#233;nombr&#233;[8-15], etc. Cette information est bas&#233;e sur les SSTC 
(Structured String-Tree Correspondences) propos&#233;e par (Boitet et Zaharin, 
1988) ; 
</p>
<p>&#8211; L : un ensemble contenant les n&#339;uds des structures li&#233;s au n&#339;ud Nrs. 
Le r&#233;seau de segmentation final obtenu repr&#233;sente les segmentations possibles et lie les 
n&#339;uds des structures entre eux. Une fois que la correspondance entre les n&#339;uds des 
structures est &#233;tablie, la plateforme peut fusionner ces structures pour fournir une 
unique repr&#233;sentation de d&#233;pendance combinant toutes les informations linguistiques 
relatives aux structures (illustr&#233; dans la figure 4). 
</p>
<p> 
Figure 4 : exemple d&#8217;annotations concurrentes 
</p>
<p>4 Importer des informations linguistiques externes 
La plate-forme ACOLAD doit &#234;tre capable de r&#233;cup&#233;rer des informations linguistiques 
provenant d&#8217;autres outils (par exemple d&#8217;analyseurs lexicaux ou morphosyntaxiques), 
c&#8217;est-&#224;-dire d&#8217;extraire les informations des r&#233;sultats qu&#8217;ils produisent puis de les 
interpr&#233;ter. Nous pensons en effet que cette fonctionnalit&#233; doit faire partie int&#233;grante de 
l&#8217;outil afin de fournir un cadre simple de transformation des donn&#233;es aux utilisateurs 
diffusable en tant que &#171; plugin &#187; avec l&#8217;outil. Le processus se compose de deux phases : 
</p>
<p>&#8211; La phase d&#8217;extraction proprement dite d&#233;pendante des analyseurs utilis&#233;s ; 
&#8211; La phase de projection des informations extraites. 
</p>
<p>4.1 Extraction des informations 
Un module d&#8217;extraction peut &#234;tre g&#233;n&#233;r&#233; facilement pour chaque outil externe. Ce 
module permet de lire les fichiers r&#233;sultats produits, de v&#233;rifier leurs bonnes 
structurations et d&#8217;extraire les donn&#233;es linguistiques contenues dans ces fichiers. 
</p>
<p>339</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.1.1 Production des modules d&#8217;extraction 
La production de modules d&#8217;extraction s&#8217;organise en deux &#233;tapes. Dans un premier 
temps, il faut d&#233;finir un fichier de sp&#233;cifications qui d&#233;crit le format du fichier r&#233;sultat 
produit par l&#8217;outil (une grammaire de description). Il faut ensuite enrichir cette 
grammaire avec des m&#233;thodes 3 qui permettent d&#8217;extraire les donn&#233;es linguistiques 
contenues dans les r&#233;sultats d&#8217;analyse. Un module d&#8217;extraction peut alors &#234;tre produit &#224; 
partir de la grammaire et des m&#233;thodes. 
Chaque module d&#8217;extraction g&#233;n&#233;r&#233; est constitu&#233; de deux analyseurs : 
</p>
<p>&#8211; Un analyseur lexical qui convertit une s&#233;quence de caract&#232;res provenant du 
fichier r&#233;sultat &#224; analyser en une s&#233;quence d&#8217;objets, nomm&#233;s tokens ; 
</p>
<p>&#8211; Un analyseur syntaxique qui consomme la s&#233;quence de tokens calcul&#233;e 
pr&#233;c&#233;demment pour v&#233;rifier la syntaxe du fichier r&#233;sultat. Il ex&#233;cute &#233;galement 
les actions associ&#233;es &#224; la grammaire. 
</p>
<p>4.1.2 Grammaire de description 
Une grammaire de description repr&#233;sente le format des fichiers r&#233;sultats fournis par un 
analyseur. Cette grammaire est de type hors contexte et elle est compos&#233;e de deux 
ensembles :  
</p>
<p>&#8211; Un ensemble de tokens, repr&#233;sentant les objets (nombre, cha&#238;ne, etc.) contenus 
dans un fichier r&#233;sultat ; 
</p>
<p>&#8211; Un ensemble de r&#232;gles syntaxiques, repr&#233;sentant la syntaxe d&#8217;un fichier r&#233;sultat 
en fonction des tokens. 
</p>
<p>4.1.3 Grammaire de description enrichie 
Pour extraire les donn&#233;es linguistiques pr&#233;sentes dans les fichiers r&#233;sultats, des 
m&#233;thodes d&#8217;extraction sont introduites dans les grammaires de description. Ces 
m&#233;thodes se pr&#233;sentent sous la forme de proc&#233;dures ins&#233;r&#233;es dans les r&#232;gles 
syntaxiques. Elles permettent d&#8217;extraire les donn&#233;es linguistiques. Quand une r&#232;gle 
syntaxique de la grammaire est appliqu&#233;e, les m&#233;thodes correspondantes sont ex&#233;cut&#233;es. 
La grammaire ainsi cr&#233;&#233;e est nomm&#233;e grammaire de description enrichie. Nous donnons 
ci-apr&#232;s un extrait d&#8217;une grammaire de description augment&#233;e pour une analyse de 
d&#233;pendance. 
// R&#232;gle syntaxique 
void RelationDeDependance() { 
   // D&#233;claration des variables 
   String etiquette ; Mot mot1, mot2 ; 
 
   etiquette=&lt;Chaine&gt; &quot;(&quot; mot1=Element() &quot;,&quot; mot2=Element() &quot;)&quot; 
      // o&#249; - Element() est une r&#232;gle syntaxique retournant un objet Mot 
      // - &lt;Chaine&gt; est un token repr&#233;sentant une cha&#238;ne 
      { 
         // Extraction d&#8217;une relation syntaxique avec la  
         // m&#233;thode d&#8217;extraction AjoutRelationSyntaxique 
         phraseCourante.AjoutRelationSyntaxique(etiquette, mot1, mot2) 
</p>
<p>                                                   
3 Un panel de m&#233;thodes est propos&#233; pour r&#233;aliser l&#8217;extraction des informations linguistiques. 
</p>
<p>340</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>   } 
} 
void Element() { 
   &lt;Chaine&gt; &quot;^&quot; &lt;Chaine&gt; &quot;^&quot; ( &lt;Chaine&gt; )+ ( &quot;_&quot; &lt;Chaine&gt; ) )? &quot;:&quot; &lt;Nombre&gt; 
      // &lt;Nombre&gt; est un token repr&#233;sentant un nombre positif 
      // le + signifie que la cha&#238;ne peut appara&#238;tre plusieurs fois 
      // le ? signifie que la cha&#238;ne peut appara&#238;tre au moins une fois 
} 
</p>
<p>La r&#232;gle syntaxique pr&#233;c&#233;dente s&#8217;applique sur chacune des relations de d&#233;pendance 
extraites de l&#8217;analyse faite par l&#8217;analyseur XIP de la phrase &#171; La recherche fran&#231;aise perd 
ses moyens. &#187; : 
SUBJ(&lt;perd^perdre^+VERB_P3SG:3&gt;,&lt;recherche^recherche^+NOUN_SG:1&gt;) 
VARG(&lt;perd^perdre^+VERB_P3SG:3&gt;,&lt;moyens^moyen^+NOUN_PL:5&gt;) 
NN(&lt;recherche^recherche^+NOUN_SG:1&gt;,&lt;fran&#231;aise^fran&#231;aise^+NOUN_INV:2&gt;) 
DETERM(&lt;La^le^+DET_SG:0&gt;,&lt;recherche^recherche^+NOUN_SG:1&gt;) 
</p>
<p>4.2 Projection des donn&#233;es extraites 
Apr&#232;s avoir extrait toutes les donn&#233;es linguistiques des r&#233;sultats d&#8217;un analyseur, il faut 
faire correspondre ces donn&#233;es &#224; une norme commune &#233;tablie, sp&#233;cifi&#233;e en amont en 
fonction des jeux d&#8217;&#233;tiquettes donn&#233;s pour la t&#226;che d&#8217;annotation. 
Cette phase peut &#234;tre reproduite facilement autant de fois que n&#233;cessaire et ainsi 
s&#8217;adapter aux diff&#233;rentes granularit&#233;s des jeux d&#8217;&#233;tiquettes envisag&#233;s en fonction des 
besoins de la t&#226;che. 
Pour normaliser les donn&#233;es extraites, un ensemble de r&#232;gles de projection est d&#233;fini. 
Une r&#232;gle de projection est constitu&#233;e d&#8217;une partie gauche repr&#233;sentant les donn&#233;es 
linguistiques &#224; reconna&#238;tre et d&#8217;une partie droite repr&#233;sentant les m&#234;mes informations 
normalis&#233;es. Par exemple, pour les donn&#233;es brutes extraites dans l&#8217;exemple pr&#233;c&#233;dent, 
les r&#232;gles instanciables sont4 : 
SUBJ($var1, $var2) ::= Sujet($var1, $var2) 
VARG($var1, $var2) ::= Objet($var1, $var2) 
NN($var1, $var2) ::= Complement($var1, $var2) 
DETERM($var1, $var2) ::= Determinant($var2, $var1) 
  // La relation DETERM est projet&#233;e en une relation  
  // Determinant en modifiant l&#8217;ordre relatif des mots 
</p>
<p>L&#8217;extraction d&#8217;information d&#8217;ACOLAD est bas&#233;e sur les outils d&#233;velopp&#233;s pour la 
plateforme de combinaison d&#8217;analyseurs syntaxiques DepAn (Brunet-Manquat, 2005). 
L&#8217;approche a &#233;t&#233; exp&#233;riment&#233;e et valid&#233;e dans (Brunet-Manquat, 2004). 
</p>
<p>5 Perspectives 
ACOLAD propose des services manuels permettant de segmenter une phrase ou de 
produire des analyses de d&#233;pendances. Cet environnement est actuellement utilis&#233; pour 
produire des analyses de d&#233;pendances pour le fran&#231;ais. Mais cet outil, par son 
                                                   
4 une variable $vari repr&#233;sente soit un mot soit un chunk 
</p>
<p>341</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>formalisme de d&#233;pendances et son aspect configurable (choix des jeux d'&#233;tiquettes, 
choix des contraintes structurelles de d&#233;pendances -- en particulier pour tenir compte de 
la variabilit&#233; de l'ordre des mots selon la langue (Holan, 2000)), a un potentiel 
multilingue. 
Des exp&#233;rimentations sont actuellement men&#233;es pour int&#233;grer les premiers r&#233;sultats 
d&#8217;ACOLAD dans nos travaux sur l&#8217;analyse syntaxique automatique et la production de 
documents auto-explicatifs (Blanchon et al., 2006). 
Les services propos&#233;s par ACOLAD pourront &#233;galement &#234;tre int&#233;gr&#233;s &#224; des 
environnements tel que Sectra_w, un syst&#232;me collaboratif permettant d&#8217;&#233;valuer, de 
pr&#233;senter, d&#8217;exploiter et de r&#233;viser des corpus de traduction automatique (Huynh et al., 
2008), par exemple pour proposer l&#8217;ajout de d&#233;pendances syntaxiques. 
Enfin, ACOLAD pourra &#234;tre propos&#233; dans le cadre de campagne d&#8217;&#233;valuation 
d&#8217;analyseurs syntaxiques de d&#233;pendances pour aider &#224; fabriquer les analyses r&#233;f&#233;rences. 
Notre plateforme est propos&#233;e &#224; la communaut&#233; sous licence publique g&#233;n&#233;rale limit&#233;e GNU 
(GNU Lesser General Public License). Elle sera prochainement disponible &#224; l&#8217;url suivante : 
https://forge.imag.fr/projects/acolad/. 
</p>
<p>R&#233;f&#233;rences 
BLANCHON, H., BOITET, C. AND CHOUMANE, A. (2006). Traduction automatis&#233;e fond&#233;e sur 
le dialogue et documents auto-explicatifs: bilan du projet LIDIA. in TAL. vol. 47(3):30 p. 
BRUNET-MANQUAT F. (2005). Improving dependency analysis by Syntactic parser 
combination. Proceedings of IEEE NLP-KE 2005, Wuhan, China, Oct 30- Nov 1, 2005. 
BRUNET-MANQUAT, F. (2004). CR&#201;ATION D'ANALYSEURS DE D&#201;PENDANCE PAR COMBINAISON 
D'ANALYSEURS SYNTAXIQUES. TH&#200;SE EN INFORMATIQUE. UNIVERSIT&#201; JOSEPH FOURIER - GRENOBLE 
1. 21 D&#201;CEMBRE 2004. 169 P. 
HOLAN T., KUBON, OLIVA K., PLATEK M. (2000). On complexity of word order, in TAL., 
41(1), pp. 273-300, Herm&#232;s, Paris, France. 
HUYNH C.-P., BOITET C. &amp; BLANCHON H. (2008). SECTra_w : an Online Collaborative 
System for Evaluating, Post-editing and Presenting MT Translation Corpora. Proc. LREC-
08, Marrakech, 27-31/5/08, ELRA/ELDA, ed., 8 p. 
PAROUBEK P., VILLEMONTE DE LA CLERGERIE E., LOISEAU S., VILNAT A., ET FRANCOPOULO G. 
(2009) The PASSAGE Syntactic Representation, 7th International Workshop on Treebanks 
and Linguistic Theories (TLT7, Groningen, January 23-24, 2009) 
VALLI, A.  VERONIS, J. (1999). Etiquetage grammatical des corpus de parole : probl&#232;mes 
et perspectives. Revue Fran&#231;aise de Linguistique Appliqu&#233;e, IV(2), 113-133. (dossier : l'oral 
spontan&#233;) 
XAVIER T. (2012). WebAnnotator, an Annotation Tool for Web Pages. Proceedings of the 
8th International Conference on Language Resources and Evaluation (LREC 2012, to 
appear). Istanbul, Turkey, 2012. 
</p>
<p>342</p>

</div></div>
</body></html>