<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Le DictAm : Dictionnaire &#233;lectronique des verbes amazighs-fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 5: D&#233;monstrations, pages 15&#8211;16,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Le DictAm : Dictionnaire &#233;lectronique des verbes 
amazighs-fran&#231;ais 
</p>
<p>Samira MOUKRIM 
Universit&#233; Sidi Mohamed Ben Abdellah 
</p>
<p>samiramoukrim@yahoo.fr 
</p>
<p>RESUME____________________________________________________________________________________________________________ 
Le DictAm est un dictionnaire &#233;lectronique des verbes amazighs-fran&#231;ais. Il vise &#224; rendre 
compte de l&#8217;ensemble des verbes dans le domaine berb&#232;re : conjugaison, diath&#232;se et sens. 
Le DictAm comporte actuellement pr&#232;s de 3000 verbes dans une soixantaine de parlers 
berb&#232;res. C&#8217;est un travail qui est en cours de r&#233;alisation et qui a pour ambition de  
r&#233;pertorier tous les verbes berb&#232;res ainsi que leurs &#233;quivalents en fran&#231;ais. 
 
ABSTRACT _________________________________________________________________________________________________________ ___________________________ 
The DictAm : An electronic dictionary of Amazigh-French verbs 
</p>
<p>In the frame of promoting the linguistic diversity among knowledge society, we suggest 
to elaborate an electronic dictionary of Amazigh-French verbs (DictAm). This dictionary 
aims at accounting for the verbs in the Amazigh sphere as a whole: conjugation, 
diathesis and meaning. The DictAm also adopts a comparative perspective in the sense 
that it collects the lexical materials of different dialectal varieties and makes them 
reachable. Now, the DictAm comprises around 3000 verbs deriving from about sixty 
Amazigh speeches. This work is currently in progress as well as it aspires to set up a 
repertoire of all Amazigh verbs and their French equivalents. 
 
</p>
<p>MOTS-CLES: Dictionnaire &#233;lectronique, dimension bilingue, diversit&#233; linguistique, verbes.  
KEYWORDS: Electronic dictionary, bilingual dimension, linguistic diversity, verbs. 
 
Dans le cadre de la promotion de la diversit&#233; linguistique dans la soci&#233;t&#233; de la 
connaissance, nous nous proposons d&#8217;&#233;laborer un dictionnaire &#233;lectronique des verbes 
amazighs-fran&#231;ais (DictAm). Ce dictionnaire vise &#224; rendre compte de l&#8217;ensemble des 
verbes dans le domaine berb&#232;re : conjugaison, diath&#232;se et sens. Le DictAm a &#233;galement une 
vis&#233;e comparative dans la mesure o&#249; il rassemble et rend accessible les mat&#233;riaux 
lexicaux des diff&#233;rentes vari&#233;t&#233;s dialectales.  
</p>
<p>15</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La structure de la base de donn&#233;es a &#233;t&#233; d&#233;termin&#233;e en prenant en compte toutes les 
caract&#233;ristiques  du verbe en amazighe. Et pour faciliter la consultation, les verbes sont 
class&#233;s par ordre alphab&#233;tique de leur forme aoriste-imp&#233;ratif. La structuration et le 
format des donn&#233;es ont &#233;t&#233; pens&#233;s  de mani&#232;re &#224; permettre un transfert des donn&#233;es 
s&#233;lectionn&#233;es vers un document Word ou Excel (et prochainement HTML). Quant &#224; la 
dimension bilingue du  DictAm, elle se manifeste au travers de l&#8217;association pour chaque 
ent&#233;e lexicale berb&#232;re d&#8217;un &#233;quivalent en langue fran&#231;aise. Pour la programmation du 
DictAm, nous avons fait appel &#224; El Amrani M., informaticien en Allemagne, qui nous a 
aid&#233; &#224; concr&#233;tiser ce projet. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>L&#8217;alimentation de la base de donn&#233;es s&#8217;est faite &#224; partir des sources documentaires 
existantes : les dictionnaires classiques (version papier) ; les lexiques et glossaires ainsi 
qu&#8217;une exploitation syst&#233;matique des textes publi&#233;s. Actuellement, le DictAm comporte 
pr&#232;s de 3000 verbes dans une soixantaine de parlers amazighs. C&#8217;est un travail qui est en 
cours de r&#233;alisation et qui a pour ambition de  r&#233;pertorier tous les verbes berb&#232;res ainsi 
que leurs &#233;quivalents en fran&#231;ais. 
</p>
<p>Ainsi con&#231;u, le DictAm r&#233;pondra &#224; trois types de besoins : i) les besoins relatifs &#224; la 
collecte et &#224; l&#8217;organisation des donn&#233;es lexicales issues des diff&#233;rentes vari&#233;t&#233;s de 
l&#8217;amazighe ; ii) les besoins des apprenants et des chercheurs qui travaillent sur 
l&#8217;amazighe et enfin ; iii) les besoins des comparatistes. En pr&#233;servant toute la richesse 
h&#233;rit&#233;e des diff&#233;rentes vari&#233;t&#233;s dialectales et en int&#233;grant l&#8217;amazighe dans les nouvelles 
technologies de l&#8217;information, le DictAm va s&#251;rement contribuer &#224; la promotion de cette 
langue. 
</p>
<p>16</p>

</div></div>
</body></html>