<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;tude des manifestations de la relation de m&#233;ronymie dans une ressource distributionnelle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 169&#8211;182,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>&#201;tude des manifestations de la relation de m&#233;ronymie dans
une ressource distributionnelle
</p>
<p>Fran&#231;ois Morlane-Hond&#232;re C&#233;cile Fabre
CLLE-ERSS, Universit&#233; de Toulouse - Le Mirail, 5, all&#233;es Antonio Machado - Toulouse Cedex 9
</p>
<p>francois.morlane@univ-tlse2.fr, cecile.fabre@univ-tlse2.fr
</p>
<p>R&#201;SUM&#201;
Cette &#233;tude vise &#224; &#233;tudier les manifestations de la relation de m&#233;ronymie dans une ressource
lexicale g&#233;n&#233;r&#233;e automatiquement &#224; partir d&#8217;un corpus de langue g&#233;n&#233;rale. La d&#233;marche que
nous adoptons consiste &#224; recueillir un jeu de couples de m&#233;ronymes issus d&#8217;une ressource
externe que nous croisons avec une base distributionnelle calcul&#233;e &#224; partir d&#8217;un corpus de
textes encyclop&#233;diques. Une annotation s&#233;mantique des mots qui entrent dans ces couples de
m&#233;ronymes montre que la prise en compte de la nature s&#233;mantique des mots composant les
couples de m&#233;ronymes permet de mettre au jour des in&#233;galit&#233;s au niveau du rep&#233;rage de la
relation par la m&#233;thode d&#8217;analyse distributionnelle.
</p>
<p>ABSTRACT
Study of meronymy in a distribution-based lexical resource
</p>
<p>In this paper, we study the way meronymy behaves in a distribution-based lexical resource. We
address the question of the evaluation of such resources through a semantic-based approach.
Our method consists in collecting meronyms from a resource which we cross with a distribution-
based lexical resource made from an encyclopedic corpus. Meronyms are then sub-categorized
manually : firstly following the sub-relation they bear (STUFF/OBJECT, MEMBER/COLLECTION, etc.),
then following the semantic class of their members. Results show that distributional analysis
identifies meronymic relations in different proportions according to the semantic classes of the
words involved in the meronymic pairs.
</p>
<p>MOTS-CL&#201;S : analyse distributionnelle, s&#233;mantique lexicale, m&#233;ronymie, &#233;valuation.
</p>
<p>KEYWORDS: distributional analysis, lexical semantics, meronymy, evaluation.
</p>
<p>1 Introduction
</p>
<p>Cette &#233;tude s&#8217;inscrit dans la probl&#233;matique g&#233;n&#233;rale de l&#8217;&#233;valuation des m&#233;thodes d&#8217;analyse
distributionnelle (dor&#233;navant AD) pour l&#8217;acquisition d&#8217;informations s&#233;mantiques (Baroni et
Lenci, 2010). Ces m&#233;thodes de s&#233;mantique distributionnelle consistent &#224; mesurer le degr&#233; de
proximit&#233; s&#233;mantique entre mots sur la base du recouvrement de leurs contextes syntaxiques.
La qualit&#233; des r&#233;sultats fournis par ces m&#233;thodes s&#8217;av&#232;re difficile &#224; mesurer du fait de la grande
quantit&#233; de couples de mots g&#233;n&#233;r&#233;e par l&#8217;analyse et de la diversit&#233; des relations mises au jour
(Sahlgren, 2006). Le typage des relations s&#233;mantiques calcul&#233;es par l&#8217;AD est donc un enjeu pour
optimiser l&#8217;utilisation des ressources distributionnelles dans des applications de TAL (van der
Plas, 2008). Diff&#233;rents travaux ont cherch&#233; &#224; mesurer l&#8217;efficacit&#233; des m&#233;thodes distributionnelles
pour le rep&#233;rage des relations lexicales en employant des m&#233;thodes impliquant des ressources de
</p>
<p>169</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>r&#233;f&#233;rence (Lin, 1998; Turney, 2008; Baroni et Lenci, 2011). En particulier, Baroni et Lenci ont
soumis les r&#233;sultats du calcul distributionnel &#224; un large &#233;ventail de t&#226;ches s&#233;mantiques. Pour le
fran&#231;ais, les &#233;tudes ont &#233;t&#233; principalement consacr&#233;es au rep&#233;rage de la synonymie (Bourigault
et Galy, 2005; Ferret, 2010; Muller et Langlais, 2011), en particulier du fait de la disponibilit&#233;
de lexiques de synonymes. Dans une &#233;tude pr&#233;c&#233;dente, nous nous sommes int&#233;ress&#233;s au cas de
l&#8217;antonymie (Morlane-Hond&#232;re et Fabre, 2010). Tous ces travaux confirment la grande diversit&#233;
des relations que peut d&#233;tecter l&#8217;AD, et montrent aussi la n&#233;cessit&#233; de mieux comprendre sous
quelles conditions le crit&#232;re distributionnel op&#232;re, autrement dit, quels types d&#8217;informations
distributionnelles doivent &#234;tre pris en compte selon la nature de la t&#226;che s&#233;mantique que l&#8217;on
veut r&#233;aliser.
</p>
<p>Dans cet article, nous nous focalisons sur le cas d&#8217;une relation lexicale particuli&#232;re, la relation
de m&#233;ronymie (ou relation partie/tout), pour &#233;tudier la fa&#231;on dont elle est rep&#233;r&#233;e par un
programme d&#8217;analyse distributionnelle. La relation de m&#233;ronymie est int&#233;ressante &#224; plusieurs
titres : tout d&#8217;abord, elle constitue l&#8217;une des relations vis&#233;es par les m&#233;thodes d&#8217;acquisition de
ressources lexicales et terminologiques, au m&#234;me titre que les relations plus souvent &#233;tudi&#233;es
que sont l&#8217;hyperonymie et la synonymie. Ensuite, elle a la particularit&#233; de recouvrir un ensemble
vari&#233; de relations (LIEU/ZONE, CONSTITUANT/OBJET, &#201;TAPE/ACTIVIT&#201;, MEMBRE/COLLECTION, etc.), ce
qui offre un terrain d&#8217;observation particuli&#232;rement riche pour &#233;tudier les modalit&#233;s d&#8217;application
de l&#8217;AD. Enfin, contrairement &#224; la synonymie et &#224; l&#8217;hyperonymie, la m&#233;ronymie ne relie pas des
mots relevant syst&#233;matiquement de la m&#234;me classe s&#233;mantique : c&#8217;est le cas par exemple du
couple de mots t&#234;te et enfant, le premier &#233;tant une partie du corps, le second un &#234;tre humain. Un
tel cas de figure semble a priori d&#233;favorable au rep&#233;rage par l&#8217;AD. C&#8217;est un des points que nous
cherchons &#224; examiner dans cet article.
</p>
<p>La d&#233;marche que nous avons adopt&#233;e s&#8217;appuie sur un jeu de couples de m&#233;ronymes issu du r&#233;seau
JeuxDeMots (d&#233;sormais JDM) (Lafourcade, 2007). Nous avons crois&#233; ces donn&#233;es avec une base
distributionnelle construite &#224; partir d&#8217;un corpus issu de l&#8217;encyclop&#233;die en ligne Wikip&#233;dia. Apr&#232;s
une pr&#233;sentation de la relation de m&#233;ronymie et des sous-relations qui la composent (2), nous
d&#233;crivons les deux ressources que nous avons utilis&#233;es (3). Nous pr&#233;sentons ensuite la phase
d&#8217;annotation, qui a donn&#233; lieu &#224; deux proc&#233;dures successives (4). Dans la section consacr&#233;e aux
r&#233;sultats (5), les couples ainsi annot&#233;s sont analys&#233;s du point de vue distributionnel, ce qui nous
permet de d&#233;gager des classes de relations selon leur propension &#224; &#234;tre d&#233;tect&#233;es par l&#8217;AD, et
d&#8217;analyser ces diff&#233;rences.
</p>
<p>2 La relation de m&#233;ronymie : d&#233;finition et typologie
</p>
<p>La relation de m&#233;ronymie est la relation qui s&#8217;&#233;tablit entre une partie et son tout. Elle est
asym&#233;trique et sa r&#233;ciproque, la relation entre un tout et l&#8217;une de ses parties, est l&#8217;holonymie.
C&#8217;est une relation qui op&#232;re principalement entre deux noms, bien que Winston et al. (1987)
proposent une relation FEATURE/ACTIVITY pour les couples d&#233;signant une &#233;tape dans un processus
comme paying/shopping. La d&#233;finition que donne Cruse (1986) de la m&#233;ronymie est la suivante
&#8220;X is a meronym of Y if and only if sentences of the form A Y has Xs / an X and An X is a part of a
Y are normal when the noun phrases an X, a Y are interpreted generically.&#8221; Ainsi, La main est une
partie du bras est vrai, et ce m&#234;me s&#8217;il existe des bras dont la main a &#233;t&#233; coup&#233;e.
</p>
<p>La relation de m&#233;ronymie est prise en compte dans la construction de th&#233;saurus et d&#8217;ontologies
(Van Campenhoudt, 1996; Keet et Artale, 2008). Elle se d&#233;cline en plusieurs sous-relations.
</p>
<p>170</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Winston et al. (1987) d&#233;finissent six sous-types de m&#233;ronymes en s&#8217;appuyant sur trois crit&#232;res :
&#8211; la fonctionnalit&#233; : la partie a-t-elle une fonction vis-&#224;-vis du tout ? Par exemple, poign&#233;e est
</p>
<p>fonctionnel vis-&#224;-vis de porte, mais pas vis-&#224;-vis de maison.
&#8211; l&#8217;hom&#233;om&#233;rit&#233; : la partie et le tout sont-ils mat&#233;riellement identiques (comme tranche/g&#226;teau,
</p>
<p>contrairement &#224; arbre/for&#234;t) ?
&#8211; la s&#233;parabilit&#233; : la partie et le tout sont-ils s&#233;parables ? C&#8217;est le cas de anse et tasse, mais pas
</p>
<p>d&#8217;acier et v&#233;lo.
</p>
<p>Relation Exemple
Crit&#232;res
</p>
<p>Fonct. Hom&#233;o. S&#233;par.
&#201;L&#201;MENT/OBJET anse/tasse + &#8722; +
</p>
<p>MEMBRE/COLLECTION arbre/for&#234;t &#8722; &#8722; +
PORTION/MASSE tranche/g&#226;teau &#8722; + +
</p>
<p>CONSTITUANT/OBJET acier/v&#233;lo &#8722; &#8722; &#8722;
&#201;TAPE/ACTIVIT&#201; payer/magasiner + &#8722; &#8722;
</p>
<p>LIEU/ZONE oasis/d&#233;sert &#8722; + &#8722;
</p>
<p>TABLE 1 &#8211; Sous-types de la relation de m&#233;ronymie d&#233;finis par Winston et al. (1987).
</p>
<p>La combinaison de ces trois crit&#232;res leur permet de d&#233;gager les relations rapport&#233;es au tableau 1.
En marge de cette premi&#232;re s&#233;rie, Winston et al. (1987) d&#233;crivent des relations qui s&#8217;apparentent
&#224; de la m&#233;ronymie sans en &#234;tre tout &#224; fait. Ces relations sont les suivantes :
&#8211; l&#8217;inclusion topologique : l&#8217;holonyme est un contenant (prisonnier/cellule), une zone (Berlin
</p>
<p>Ouest/Allemagne de l&#8217;Est) ou exprime une dur&#233;e temporelle (r&#233;union/matin).
&#8211; l&#8217;inclusion de classe : il s&#8217;agit ici de la relation d&#8217;hyponymie (rose/fleur, peur/&#233;motion, etc.).
&#8211; la relation d&#8217;attribution : il s&#8217;agit d&#8217;une relation de type modifieur entre un mot et un adjectif
</p>
<p>(tour/haute, blague/dr&#244;le, etc.).
&#8211; la relation d&#8217;attachement : elle porte sur deux objets attach&#233;s l&#8217;un &#224; l&#8217;autre (boucle d&#8217;oreille et
</p>
<p>oreille).
&#8211; la relation d&#8217;appartenance : elle relie des mots comme millionnaire et argent ou auteur et
</p>
<p>copyright et peut &#234;tre confondue avec la m&#233;ronymie &#224; cause de l&#8217;ambigu&#239;t&#233; du patron X a Y,
qui peut exprimer l&#8217;appartenance (Camille a un v&#233;lo vs. Un v&#233;lo a des roues).
</p>
<p>La diff&#233;rence entre certaines de ces relations et la m&#233;ronymie stricto sensu est parfois assez fine.
Nous verrons &#224; la section 4 que beaucoup des paires annot&#233;es rel&#232;vent de l&#8217;une ou l&#8217;autre de ces
relations pseudo-m&#233;ronymiques.
</p>
<p>3 Description des donn&#233;es
</p>
<p>Cette &#233;tude repose sur la confrontation de deux types de donn&#233;es : les Voisins de Wikip&#233;dia, qui
est une base lexicale g&#233;n&#233;r&#233;e automatiquement par analyse distributionnelle &#224; partir de corpus,
et une ressource lexicale construite de mani&#232;re collaborative, JeuxDeMots.
</p>
<p>3.1 Les voisins de Wikip&#233;dia
</p>
<p>La base distributionnelle utilis&#233;e dans cette &#233;tude a &#233;t&#233; calcul&#233;e &#224; partir d&#8217;un corpus constitu&#233;
de l&#8217;int&#233;gralit&#233; des articles de l&#8217;encyclop&#233;die en ligne Wikip&#233;dia dans une version datant d&#8217;avril
2007. Ce corpus compte environ 194 millions de mots. L&#8217;analyse syntaxique du corpus a &#233;t&#233;
</p>
<p>171</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>effectu&#233;e par le programme Syntex (Bourigault, 2007) &#224; partir d&#8217;une version du corpus Wikip&#233;dia
pr&#233;c&#233;demment &#233;tiquet&#233;e morpho-syntaxiquement par TreeTagger. L&#8217;analyse distributionnelle a
&#233;t&#233; r&#233;alis&#233;e par l&#8217;outil Upery d&#233;velopp&#233; par Didier Bourigault (2002) 1. &#192; partir des relations
de d&#233;pendance syntaxique calcul&#233;es par Syntex, le programme Upery extrait dans un premier
temps des triplets de structure (mot1, RELATION, mot2). Les relations syntaxiques prises en
compte sont les relations sujet, objet, compl&#233;ment pr&#233;positionnel, modification adjectivale. Les
mots sont des unit&#233;s simples ou des syntagmes, sous une forme lemmatis&#233;e, par exemple :
utiliser, OBJET, voiture. Ces triplets servent de base au calcul distributionnel, qui rapproche les
couples d&#8217;&#233;l&#233;ments qui partagent les m&#234;mes contextes syntaxiques. Ces &#233;l&#233;ments sont de deux
types : pr&#233;dicats ou arguments. L&#8217;argument correspond au mot r&#233;gi par la relation (ex : voiture).
Le pr&#233;dicat r&#233;sulte de l&#8217;association du mot recteur et de la relation (ex : utiliser_OBJ). Upery
rapproche donc les pr&#233;dicats qui partagent les m&#234;mes arguments, ainsi que les arguments qui
partagent les m&#234;mes pr&#233;dicats. Par exemple, voiture est rapproch&#233; de v&#233;hicule parce que ces deux
mots partagent, en position argument, les contextes suivants : loueur_DE, pneu_DE, garer_OBJ,
percuter_SUJ, etc. La mesure de similarit&#233; utilis&#233;e est bas&#233;e sur l&#8217;indice de Lin (1998). Le score de
similarit&#233; de deux pr&#233;dicats ou arguments varie &#8211; de 0 &#224; 1 &#8211; en fonction de plusieurs facteurs :
le nombre de contextes partag&#233;s, le nombre de triplets diff&#233;rents dans lesquels chacun de deux
mots appara&#238;t (indice de productivit&#233;), le degr&#233; de sp&#233;cificit&#233; du contexte qui permet d&#8217;effectuer
le rapprochement (se reporter &#224; (Bourigault, 2002) pour les d&#233;tails de la proc&#233;dure de calcul).
La base de voisins distributionnels de Wikip&#233;dia compte 2 441 118 paires de mots.
</p>
<p>3.2 JeuxDeMots
</p>
<p>Le jeu de couples que nous avons utilis&#233; est issu de la base JeuxDeMots, qui est un r&#233;seau lexical
enrichi de fa&#231;on collaborative (Lafourcade, 2007) : des utilisateurs &#8211; experts et non-experts &#8211;
se connectent &#224; une interface en ligne 2 et ont pour t&#226;che de proposer un ensemble de mots
pour une relation et un mot-cible donn&#233;s. Les r&#233;ponses communes &#224; deux joueurs sont ajout&#233;es
au r&#233;seau, et si le lien &#233;tait d&#233;j&#224; pr&#233;sent, alors il est renforc&#233; selon un syst&#232;me de pond&#233;ration.
Les relations propos&#233;es par le jeu incluent aussi bien des relations lexicales classiques que des
relations moins usuelles (CHOSE/LIEU, ACTION/INSTRUMENT, etc.). Nous nous sommes tourn&#233;s vers
cette ressource car elle est librement accessible et est une des rares en fran&#231;ais &#224; inclure des
couples portant la relation partie-tout.
</p>
<p>Nous avons donc r&#233;cup&#233;r&#233; de JDM (dans sa version du 10/05/2011) les couples de noms
entretenant une relation de m&#233;ronymie ou d&#8217;holonymie. Ces derniers ont &#233;t&#233; produits par des
joueurs auxquels il &#233;tait demand&#233; de &#8220;Donner des TOUT/PARTIES&#8221; des mots-cibles qui leur &#233;taient
propos&#233;s. Cette consigne &#233;tant relativement floue, nous verrons que les couples produits se
trouvent souvent &#224; la fronti&#232;re de ce que l&#8217;on consid&#232;re comme de la m&#233;ronymie au sens strict
(section 4.1).
</p>
<p>3.3 Croisement des deux ressources
</p>
<p>Nous avons crois&#233; la base de m&#233;ronymes avec les voisins distributionnels afin de rep&#233;rer les
paires de m&#233;ronymes qui ont &#233;t&#233; rep&#233;r&#233;es par l&#8217;AD. Pour cela, nous avons dans un premier temps
&#233;limin&#233; de la base de m&#233;ronymes les paires dont un mot au moins &#233;tait absent du vocabulaire
</p>
<p>1. La constitution du corpus et l&#8217;application de Syntex et Upery &#224; ce corpus ont &#233;t&#233; r&#233;alis&#233;es par Franck Sajous, qui en
a &#233;galement assur&#233; la mise en ligne : http://redac.univ-tlse2.fr/voisinsdewikipedia/.
</p>
<p>2. http://www.jeuxdemots.org/jdm-accueil.php
</p>
<p>172</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>des voisins. Nous avons ensuite sym&#233;tris&#233; les couples de m&#233;ronymes : pour tout couple A/B
o&#249; A est m&#233;ronyme de B nous avons g&#233;n&#233;r&#233; un couple B/A o&#249; B est holonyme de A. La base
obtenue compte 15 912 couples dont 34 % (5380) sont pr&#233;sents parmi les voisins. Ce taux
de recouvrement est comparable &#224; celui que nous avons pu observer pour d&#8217;autres relations
(synonymie, antonymie).
</p>
<p>Dans un deuxi&#232;me temps, nous avons calcul&#233; le rapport de productivit&#233; (cf. section 3.1) entre les
deux membres de chaque couple contenu dans la base de m&#233;ronymes afin de ne conserver que les
couples dont les deux membres ont des productivit&#233;s comparables. En effet, de nombreux couples
de mots ne sont pas rep&#233;r&#233;s par l&#8217;AD parce que leurs productivit&#233;s sont trop d&#233;s&#233;quilibr&#233;es. Cette
&#233;tape vise donc &#224; att&#233;nuer les effets li&#233;s au calcul des voisins en ne conservant que les couples
qui sont potentiellement rep&#233;rables par l&#8217;AD. Le seuil du rapport de productivit&#233; a &#233;t&#233; fix&#233; &#224; 0,60,
ce qui signifie que, dans un couple, un mot ne pourra pas avoir une productivit&#233; 40 % plus &#233;lev&#233;e
ou plus basse que l&#8217;autre mot. La base obtenue (d&#233;sormais JDMme&#769;ro) compte 1520 paires dont
55 % (829) sont capt&#233;es par l&#8217;AD.
</p>
<p>4 Phase d&#8217;annotation
</p>
<p>La phase d&#8217;annotation doit permettre de prendre en compte parmi les couples de JDMme&#769;ro la
diversit&#233; des sous-relations qu&#8217;inclut la m&#233;ronymie. Nous nous sommes appuy&#233;s dans un premier
temps sur la typologie de Winston et al. (1987), d&#233;crite &#224; la section 2.
</p>
<p>4.1 Typologie de Winston et al. (1987)
</p>
<p>Cette annotation &#233;tant enti&#232;rement manuelle, nous n&#8217;avons dans un premier temps annot&#233; qu&#8217;une
partie de la base, soit 481 couples de JDMme&#769;ro en prenant pour crit&#232;re un seuil de productivit&#233;
sup&#233;rieur ou &#233;gal &#224; 0,85. La r&#233;partition des paires dans les cat&#233;gories a &#233;t&#233; rapport&#233;e au tableau
2.
</p>
<p>Les relations d&#233;crites comme m&#233;ronymiques dans la typologie figurent dans la partie haute du
tableau, les relations pseudo-m&#233;ronymiques apparaissent en bas. On peut constater que c&#8217;est
la relation &#201;L&#201;MENT/OBJET qui pr&#233;vaut (elle englobe plus d&#8217;un tiers de l&#8217;ensemble des couples).
Elle correspond &#224; un vaste &#233;ventail de cas o&#249; la partie a un r&#244;le fonctionnel vis-&#224;-vis de son
tout : pince/crabe, clavier/piano, Les autres relations sont nettement minoritaires. Dans la partie
basse du tableau, les relations pseudo-m&#233;ronymiques repr&#233;sentent 44 % des couples annot&#233;s.
La derni&#232;re relation, identifi&#233;e dans le tableau par un point d&#8217;interrogation, regroupe tous les
couples qui, selon nous, portent une relation autre que toutes celles qui ont &#233;t&#233; identifi&#233;es par
(Winston et al., 1987) : chemin/voyage, corps/femme, &#233;lectricit&#233;/fil, activit&#233;/temps, etc. Ces couples
sont au nombre de 151, ce qui repr&#233;sente 31,4 % de l&#8217;ensemble. Certains d&#8217;entre eux passent le
test de l&#8217;insertion dans un patron de type X a Y (chauffeur/taxi, billet/montant, carte/couleur).
Beaucoup des paires appartenant &#224; cette cat&#233;gorie sont constitu&#233;es de noms exprimant des
concepts abstraits pour lesquels les crit&#232;res de fonctionnalit&#233;, d&#8217;hom&#233;om&#233;rit&#233; et de s&#233;parabilit&#233;
sont difficilement applicables comme dans calcul/chiffre ou lumi&#232;re/univers. Malgr&#233; le caract&#232;re
p&#233;riph&#233;rique d&#8217;une partie des relations, nous prenons comme objet d&#8217;&#233;tude le jeu de couples dans
son ensemble, dans la mesure o&#249; ils ont &#233;t&#233; produits par des locuteurs qui les ont per&#231;us comme
relevant de la relation partie/tout.
</p>
<p>Le bilan que l&#8217;on peut tirer de cette premi&#232;re annotation est que la typologie montre ses limites
</p>
<p>173</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Relation Fr&#233;q. Proportion
</p>
<p>Relations m&#233;ronymiques
</p>
<p>&#201;L&#201;MENT/OBJET 177 36,8 %
CONSTITUANT/OBJET 35 7,3 %
</p>
<p>LIEU/ZONE 34 7,1 %
MEMBRE/COLLECTION 14 2,9 %
</p>
<p>&#201;TAPE/ACTIVIT&#201; 6 1,2 %
PORTION/MASSE 1 0,2 %
</p>
<p>Autres relations
</p>
<p>? 151 31,4 %
INCLUSION TOPOLOGIQUE 31 6,4 %
</p>
<p>CLASSE 18 3,7 %
SYNONYMIE 11 2,3 %
</p>
<p>APPARTENANCE 3 0,6 %
</p>
<p>TABLE 2 &#8211; R&#233;sultats de l&#8217;annotation bas&#233;e sur la typologie de Winston et al. (1987).
</p>
<p>lorsqu&#8217;elle est confront&#233;e aux donn&#233;es de JDM, pour deux raisons :
&#8211; une seule relation &#8211; &#201;L&#201;MENT/OBJET &#8211; concentre pr&#232;s de 66 % des couples consid&#233;r&#233;s comme
</p>
<p>relevant strictement de la m&#233;ronymie. Cette classe appara&#238;t manifestement comme trop
englobante dans la mesure o&#249; elle porte sur des couples de nature h&#233;t&#233;rog&#232;ne.
</p>
<p>&#8211; 31,4 % des couples ne rel&#232;vent pas d&#8217;une des relations d&#233;finies dans la typologie de r&#233;f&#233;rence,
m&#234;me en l&#8217;augmentant avec la s&#233;rie des relations pseudo-m&#233;ronymiques.
</p>
<p>Nous avons donc d&#233;cid&#233; de d&#233;laisser une typologie pr&#233;&#233;tablie et d&#8217;adopter une approche bottom-
up : nous nous focalisons cette fois sur le sens des mots composant les paires de m&#233;ronymes afin
de faire &#233;merger des combinaisons de classes s&#233;mantiques.
</p>
<p>4.2 Annotation en classes s&#233;mantiques
</p>
<p>La deuxi&#232;me proc&#233;dure d&#8217;annotation consiste &#224; attribuer une classe s&#233;mantique &#224; chaque mot des
couples de m&#233;ronymes, afin de mettre au jour de nouvelles configurations distributionnelles. Elle
s&#8217;inspire du point de vue de Murphy (2003), qui rejette l&#8217;id&#233;e selon laquelle il existerait plusieurs
d&#233;clinaisons de la m&#233;ronymie et qui consid&#232;re que la seule chose qui change entre les diff&#233;rents
sous-types est la nature des mots sur lesquels porte la relation.
</p>
<p>Les couples que nous avons utilis&#233;s sont ceux de la base JDMme&#769;ro (section 3.2) : la m&#233;thode
d&#8217;annotation &#233;tant cette fois semi-automatis&#233;e, nous avons utilis&#233; un ensemble plus &#233;lev&#233; de
paires que dans la section pr&#233;c&#233;dente. Suite aux r&#233;sultats obtenus lors de l&#8217;annotation effectu&#233;e &#224;
partir de la typologie de Winston et al. (1987), nous avons choisi de retirer manuellement les
couples d&#8217;hyperonymes et de synonymes. JDMme&#769;ro compte d&#233;sormais 1334 paires dont 53 % (711)
sont d&#233;tect&#233;s par l&#8217;AD (contre 1520 paires dont 55 % de voisins dans sa version pr&#233;c&#233;dente).
</p>
<p>En guise de classe s&#233;mantique, nous avons associ&#233; chaque mot &#224; l&#8217;un de ses hyperonymes
de haut niveau dans WordNet (Fellbaum, 1998). La raison pour laquelle nous avons utilis&#233;
cette ressource plut&#244;t que les hyperonymes de JDM est que les relations d&#8217;hyperonymie y sont
pr&#233;sentes de fa&#231;on plus syst&#233;matique que dans JDM (tous les mots de notre sous-ensemble n&#8217;ont
pas forc&#233;ment d&#8217;hyperonyme dans JDM). Cette d&#233;marche a, dans un premier temps, consist&#233; &#224;
</p>
<p>174</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>traduire le lexique de JDMme&#769;ro en anglais
3. Nous avons ensuite associ&#233; chaque mot &#224; l&#8217;ensemble
</p>
<p>des hyperonymes de sa traduction anglaise dans le r&#233;seau, et ce pour chacune de ses acceptions
recens&#233;es dans WordNet. Ainsi, &#233;glise est associ&#233; aux quatre chemins suivants :
</p>
<p>ENTITY&gt;ABSTRACT_ENTITY&gt;ABSTRACTION&gt;EVENT&gt;HUMAN_ACTIVITY&gt;ACTIVITY&gt;CEREMONY
</p>
<p>ENTITY&gt;ABSTRACT_ENTITY&gt;ABSTRACTION&gt;SOCIAL_GROUP&gt;ORGANIZATION&gt;INSTITUTION&gt;RELIGION
</p>
<p>ENTITY&gt;ABSTRACT_ENTITY&gt;ABSTRACTION&gt;SOCIAL_GROUP&gt;GATHERING&gt;BODY
</p>
<p>ENTITY&gt;PHYSICAL_ENTITY&gt;PHYSICAL_OBJECT&gt;WHOLE&gt;ARTIFACT&gt;STRUCTURE&gt;EDIFICE&gt;PLACE_OF_WORSHIP
</p>
<p>L&#8217;&#233;tape suivante consiste &#224; proc&#233;der &#224; un &#233;lagage de l&#8217;arborescence. Par d&#233;faut, la granularit&#233; de
WordNet est bien trop fine pour nous permettre d&#8217;obtenir des classes de taille satisfaisante (par
exemple, dans nos donn&#233;es, &#233;glise est le seul mot &#224; figurer en position hyponyme de CEREMONY).
L&#8217;&#233;lagage vise &#224; obtenir une arborescence moins complexe. Ainsi, nous avons choisi de couper les
noms abstraits (hyponymes de ABSTRACT_ENTITY) au troisi&#232;me niveau de profondeur et les noms
concrets (hyponymes de PHYSICAL_ENTITY) au cinqui&#232;me. Ce choix se justifie par un nombre plus
important de noms concrets dans nos donn&#233;es. Dans le cas de &#233;glise, cela entra&#238;ne la disparition
de la nuance entre les deux acceptions du mot en tant que groupe social :
</p>
<p>ENTITY&gt;ABSTRACT_ENTITY&gt;ABSTRACTION&gt;EVENT
</p>
<p>ENTITY&gt;ABSTRACT_ENTITY&gt;ABSTRACTION&gt;SOCIAL_GROUP
</p>
<p>ENTITY&gt;PHYSICAL_ENTITY&gt;PHYSICAL_OBJECT&gt;WHOLE&gt;ARTIFACT&gt;STRUCTURE
</p>
<p>Les mots ainsi annot&#233;s sont ensuite d&#233;sambigu&#239;s&#233;s manuellement en fonction du mot avec lequel
ils entretiennent une relation de m&#233;ronymie. Dans l&#8217;exemple pr&#233;c&#233;dent, cette d&#233;marche consiste
&#224; associer &#233;glise &#224; un type de b&#226;timent (STRUCTURE) dans le couple &#233;glise/village et &#224; un groupe
social (SOCIAL_GROUP) dans le couple fid&#232;le/&#233;glise. Toujours dans la m&#234;me optique, nous avons
proc&#233;d&#233; &#224; diff&#233;rents ajustements consistant &#224; op&#233;rer des regroupements entre certaines classes
de mots. Cette &#233;tape s&#8217;est faite de fa&#231;on empirique en fonction notamment du nombre d&#8217;&#233;l&#233;ments
contenus dans chaque cat&#233;gorie : par exemple, les &#233;l&#233;ments appartenant &#224; des cat&#233;gories de
moins de 10 membres ont &#233;t&#233; syst&#233;matiquement d&#233;plac&#233;s sous l&#8217;hyperonyme de niveau sup&#233;rieur.
Dans l&#8217;exemple ci-dessous, le premier chemin correspond &#224; celui de doigt, le deuxi&#232;me &#224; celui de
nez :
</p>
<p>ENTITY&gt;PHYSICAL_ENTITY&gt;THING&gt;PIECE&gt;BODY_PART&gt;EXTERNAL_BODY_PART&gt;MEMBER&gt;DIGIT
</p>
<p>ENTITY&gt;PHYSICAL_ENTITY&gt;THING&gt;PIECE&gt;BODY_PART&gt;ORGAN&gt;SENSORY_RECEPTOR&gt;CHEMORECEPTOR
</p>
<p>Apr&#232;s regroupement, les deux mots se retrouvent au m&#234;me niveau dans la hi&#233;rarchie : ils
sont directement subordonn&#233;s &#224; BODY_PART. La r&#233;partition finale des mots de JDMme&#769;ro apr&#232;s
d&#233;sambigu&#239;sation et &#233;lagage de la hi&#233;rarchie a &#233;t&#233; rapport&#233;e &#224; la figure 1 pour les noms concrets
et &#224; la figure 2 pour les noms abstraits. Sur ces figures, on constate clairement que la profondeur
de la hi&#233;rarchie varie selon les classes. La classe ABSTRACT_ENTITY n&#8217;a qu&#8217;un niveau de profondeur.
Elle se divise en quatre classes : les &#233;v&#233;nements (EVENT : exposition, proc&#232;s), les groupes sociaux
(SOCIAL_GROUP : peuple, famille), les collections (COLLECTION : flotte, galaxie) et autres (OTHER :
trou, valeur). La cat&#233;gorie autres est un ajout de notre part, elle contient des mots appartenant &#224;
des classes comme les jours de la semaine, les unit&#233;s mon&#233;taires ou les notes de musique qui
contiennent trop peu de membres pour avoir une existence autonome dans notre classification.
La classe des noms concrets regroupe un nombre de noms beaucoup plus important que la classe
des noms abstraits (2082 contre 460). Elle est structur&#233;e de fa&#231;on plus complexe et poss&#232;de
trois niveaux de profondeur. Le premier niveau distingue les parties du corps (LIVING_PART, qui
</p>
<p>3. Cette &#233;tape a &#233;t&#233; facilit&#233;e par l&#8217;utilisation de Google Traduction (http://translate.google.fr/). Les traduc-
tions ont ensuite &#233;t&#233; v&#233;rifi&#233;es manuellement. La trentaine de cas d&#8217;ambigu&#239;t&#233;s li&#233;s &#224; la traduction &#8211; plat traduit flat plut&#244;t
que dish, ou car traduit because au lieu de bus &#8211; ont &#233;t&#233; &#233;galement d&#233;sambigu&#239;s&#233;s.
</p>
<p>175</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PHYSICAL ENTITY(2082)
</p>
<p>PHYSICAL OBJECT(1524)
</p>
<p>ARTIFACT(920)
</p>
<p>INSTRUMENTATION(406) STRUCTURE(263) COVERING(70) CREATION(70) OTHER(111)
</p>
<p>LIVING THING(343)
</p>
<p>SOUL(170) FAUNA(114) PLANT LIFE(59)
</p>
<p>LOCATION(186) NATURAL OBJECT(75)
</p>
<p>SUBSTANCE(215) LIVING PART(343)
</p>
<p>FIGURE 1 &#8211; R&#233;partition des mots de JDMme&#769;ro dans la classe PHYSICAL_ENTITY.
</p>
<p>ABSTRACT ENTITY(460)
</p>
<p>EVENT(153) SOCIAL GROUP(47) COLLECTION(44) OTHER(216)
</p>
<p>FIGURE 2 &#8211; R&#233;partition des mots de JDMme&#769;ro dans la classe ABSTRACT_ENTITY.
</p>
<p>regroupe en fait les parties de corps humain, animal, et les parties de v&#233;g&#233;taux : langue, patte),
les substances ou mati&#232;res (SUBSTANCE : fer, laine), et les objets physiques. Cette derni&#232;re classe,
la plus volumineuse, regroupe les objets naturels (NATURAL_OBJECT : torrent, volcan), les lieux
(LOCATION : grotte, quartier), les entit&#233;s vivantes (LIVING_THING) et les art&#233;facts (ARTIFACT). Ces
deux derni&#232;res classes poss&#232;dent enfin un dernier niveau de profondeur. La classe des entit&#233;s
vivantes se subdivise en trois sous-classes regroupant les noms se rapportant &#224; des humains
(SOUL : joueur, pompier), des animaux (FAUNA : canard, requin) et des v&#233;g&#233;taux (PLANT_LIFE : olive,
rose). La classe des art&#233;facts comprend les noms d&#8217;instruments (INSTRUMENT : lampe, pneu), de
b&#226;timents (STRUCTURE : lyc&#233;e, magasin), de v&#234;tements (COVERING : cape, chapeau), les cr&#233;ations
(CREATION : cette classe englobe les productions litt&#233;raires, artistiques comme fresque ou roman)
et une cat&#233;gorie autres (OTHER : de la m&#234;me fa&#231;on que la cat&#233;gorie &#233;ponyme dans la classe des
entit&#233;s abstraites, elle regroupe des objets de nature h&#233;t&#233;rog&#232;ne comme brique ou savon).
</p>
<p>L&#8217;abandon d&#8217;une typologie pr&#233;&#233;tablie au profit de classes s&#233;mantiques va nous permettre de
mener des analyses plus pr&#233;cises : dans la section suivante, nous analysons les propri&#233;t&#233;s
distributionnelles des couples de classes les plus fr&#233;quents dans notre jeu de m&#233;ronymes.
</p>
<p>5 Analyse des couples
</p>
<p>&#192; ce stade de l&#8217;&#233;tude, nous nous int&#233;ressons &#224; deux propri&#233;t&#233;s des 1334 couples de la base
JDMme&#769;ro :
&#8211; chaque couple a &#233;t&#233; cat&#233;goris&#233; selon qu&#8217;il a &#233;t&#233; capt&#233; par l&#8217;AD ou non (section 3.2),
&#8211; chaque membre de chaque couple de m&#233;ronymes est associ&#233; a une &#233;tiquette s&#233;mantique qui
</p>
<p>lui est propre (section 4.2).
</p>
<p>176</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>classe m&#233;ro. classe holo. nb. de couples % voisins
SOUL SOCIAL_GROUP 54 96,2
</p>
<p>LOCATION LOCATION 19 90,0
EVENT EVENT 29 85,3
</p>
<p>STRUCTURE LOCATION 94 82,6
STRUCTURE STRUCTURE 12 82,5
</p>
<p>SOUL STRUCTURE 25 66,7
INSTRUMENTATION STRUCTURE 11 51,9
</p>
<p>SUBSTANCE SUBSTANCE 27 51,2
INSTRUMENTATION INSTRUMENTATION 82 41,5
</p>
<p>LIVING_PART PLANT_LIFE 76 41,2
LIVING_PART LIVING_PART 62 33,9
SUBSTANCE INSTRUMENTATION 17 33,3
</p>
<p>LIVING_PART SOUL 54 18,4
LIVING_PART FAUNA 41 14,6
</p>
<p>TABLE 3 &#8211; Couples de classes qui englobent au moins 10 couples dans JDMme&#769;ro.
</p>
<p>Nous croisons &#224; pr&#233;sent ces deux aspects afin de mettre au jour des couples de classes de mots et
d&#8217;expliquer pourquoi certaines sont mieux capt&#233;es par l&#8217;AD que d&#8217;autres. Nous avons rapport&#233;
au tableau 3 les couples de classes repr&#233;sent&#233;s par au moins 10 paires de m&#233;ronymes dans la
base (nous avons supprim&#233; la classe OTHER &#224; cause du caract&#232;re h&#233;t&#233;rog&#232;ne des relations qu&#8217;elle
englobe). Ils sont class&#233;s par ordre de proportion de voisins d&#233;croissante. On peut constater qu&#8217;il
y a de fortes disparit&#233;s entre les diff&#233;rentes combinaisons : alors que 96,2 % des couples dont le
m&#233;ronyme est un humain et l&#8217;holonyme un groupe social sont rep&#233;r&#233;s par l&#8217;AD, cela n&#8217;est vrai
que de 14,6 % des couples dont le m&#233;ronyme est une partie du corps et l&#8217;holonyme un animal.
Dans cette section, nous nous focalisons sur l&#8217;observation des propri&#233;t&#233;s distributionnelles de ces
diff&#233;rents types de classes afin d&#8217;expliquer pourquoi certaines sont plus compatibles que d&#8217;autres.
Les diff&#233;rentes combinaisons de classes sont analys&#233;es en deux temps. La premi&#232;re section est
consacr&#233;e &#224; l&#8217;&#233;tude des couples constitu&#233;s de deux mots appartenant &#224; des classes identiques &#8211;
couples dits homog&#232;nes. Les couples constitu&#233;s de deux mots relevant de deux classes diff&#233;rentes
&#8211; couples h&#233;t&#233;rog&#232;nes &#8211; sont analys&#233;s &#224; la deuxi&#232;me section. Ce d&#233;coupage est motiv&#233; par le
fait que, contrairement aux autres relations classiques, la m&#233;ronymie poss&#232;de la particularit&#233;
de pouvoir associer deux mots qui ont des natures s&#233;mantiques diff&#233;rentes (vache/troupeau,
m&#233;tal/&#233;p&#233;e). Or, on sait que l&#8217;AD bas&#233;e sur l&#8217;analyse des contextes syntaxiques pr&#233;sente une
tendance &#224; rapprocher des mots qui sont s&#233;mantiquement similaires. Les donn&#233;es dont nous
disposons nous donnent la possibilit&#233; de mettre au jour les conditions dans lesquelles se principe
se v&#233;rifie ou ne se v&#233;rifie pas.
</p>
<p>5.1 Couples homog&#232;nes
</p>
<p>Parmi les 14 types de couples rapport&#233;s au tableau 3, 6 sont homog&#232;nes. Leur proportion de
voisins moyenne est de 64,1 %, ce qui est un peu plus &#233;lev&#233; que celle des couples h&#233;t&#233;rog&#232;nes,
qui est de 50,6 %.
</p>
<p>177</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5.1.1 Les classes les mieux rep&#233;r&#233;es
</p>
<p>Les couples compos&#233;s de deux &#233;l&#233;ments appartenant aux classes LOCATION, EVENT ou STRUCTURE
sont rep&#233;r&#233;s par l&#8217;AD dans des proportions allant de 82,5 % &#224; 90 %. Les couples dont les deux
membres appartiennent &#224; la classe LOCATION expriment une relation entre deux lieux, l&#8217;un &#233;tant
localis&#233; dans un second de taille sup&#233;rieure (Allemagne/Europe, place/village). Ce sont les couples
homog&#232;nes qui sont le mieux rep&#233;r&#233;s par l&#8217;AD. Les mots qui les composent partagent la propri&#233;t&#233;
d&#8217;exprimer des entit&#233;s localis&#233;es spatialement. De fait, ils partagent des contextes comme la
position objet de verbes de localisation &#8211; (se) situer, se trouver &#8211; via des pr&#233;positions complexes
comme AU SUD DE ou AU CENTRE DE, ou encore la position compl&#233;ment du nom, quand le nom
exprime un point cardinal (NORD DE, SUD DE, etc.). En plus de partager ce faisceau de contextes, les
mots exprimant des lieux se distinguent par des contextes sp&#233;cifiques qui permettent de distinguer
des sous-classes le lieux. Par exemple, beaucoup des couples de lieux expriment diff&#233;rents niveaux
de subdivisions administratives (commune/canton, village/d&#233;partement, etc.). Ils partagent des
contextes comme administration_DE, communaut&#233;_DE, population_DE ou territoire_DE. De la
m&#234;me fa&#231;on, l&#8217;analyse des contextes du couple propri&#233;t&#233;/parc montre qu&#8217;ils ont &#233;t&#233; rapproch&#233;s
&#224; la fois gr&#226;ce au fait qu&#8217;ils sont des objets localis&#233;s dans l&#8217;espace (limite_DE, s&#8217;&#233;tendre_SUR,
superficie_DE), mais aussi parce qu&#8217;il apparaissent comme des biens que l&#8217;on peut poss&#233;der
(revendre_OBJ, acheter_OBJ, g&#233;rer_OBJ). Ces contextes sp&#233;cifiques viennent renforcer la proximit&#233;
distributionnelle entre les diff&#233;rents sous-ensembles de la classe des noms de lieux.
</p>
<p>Le cas des couples d&#8217;&#233;v&#233;nements est assez similaire si ce n&#8217;est que les mots expriment des valeurs
temporelles et non plus spatiales : l&#8217;&#233;v&#233;nement m&#233;ronyme prend place dans un processus de plus
grande ampleur exprim&#233; par le second membre de la paire (bataille/campagne, d&#233;part/course,
victoire/combat). Les noms exprimant une dur&#233;e s&#8217;emploient dans des contextes comme avoir
lieu_SUJ, prendre fin_SUJ et se terminer_SUJ, par l&#8217;interm&#233;diaire de pr&#233;positions comme LORS DE,
AU COURS DE, etc. Ici aussi, certains types d&#8217;&#233;v&#233;nements se distinguent du fait, par exemple, que
certains ont un aspect duratif alors que d&#8217;autres sont plus ponctuels (mission vs. victoire). Comme
&#231;a &#233;t&#233; le cas pour les noms de lieux, les contextes exprimant la localisation temporelle d&#8217;un
&#233;v&#233;nement sont associ&#233;s &#224; d&#8217;autres contextes exprimant des caract&#233;ristiques li&#233;es au sous-type
d&#8217;&#233;v&#233;nement.
</p>
<p>Enfin, la classe STRUCTURE relie des noms de b&#226;timents ou de parties de b&#226;timents qui se situent
au sein d&#8217;un autre b&#226;timent (tour/ch&#226;teau, hall/immeuble, salle/lyc&#233;e). Il semblerait que la
classe des b&#226;timents ait une distribution moins bien circonscrite que celle des lieux et des
&#233;v&#233;nements. En effet, l&#8217;&#233;tude des paires de cette cat&#233;gorie ne fait appara&#238;tre que peu de contextes
transversaux, qui s&#8217;appliquent &#224; l&#8217;ensemble des mots appartenant &#224; la classe des b&#226;timents. Le
contexte construire_OBJ en est un : il peut virtuellement s&#8217;appliquer &#224; tout type de b&#226;timent
mais ne permet pas, par exemple, de rapprocher la paire salon/appartement. De la m&#234;me fa&#231;on,
le contexte habiter_OBJ est assez r&#233;pandu mais ne s&#8217;applique, par d&#233;finition, qu&#8217;aux structures
destin&#233;es &#224; &#234;tre habitables (ce contexte n&#8217;appara&#238;t pas dans les contextes communs de la paire de
voisins pi&#232;ce/mus&#233;e, par exemple). Ainsi, la classe des b&#226;timents appara&#238;t de fa&#231;on assez floue,
dans la mesure o&#249; l&#8217;emploi qui est fait des noms de b&#226;timents dans le corpus met l&#8217;accent sur
leur aspect fonctionnel. Il semblerait que les classes qui &#233;mergent se situent &#224; un niveau de
granularit&#233; inf&#233;rieur. Par exemple, les couples appartement/immeuble et chambre/h&#244;tel poss&#232;dent
en commun des contextes comme habiter_OBJ, louer_OBJ ou se installer_DANS. Ces contextes
d&#233;finissent un type de b&#226;timent bien particulier, &#224; savoir les b&#226;timents destin&#233;s au logement.
De la m&#234;me fa&#231;on, les couples tour/ch&#226;teau et fortification/fort partagent des contextes comme
</p>
<p>178</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>prot&#233;ger_OBJ, d&#233;truire_OBJ ou attaquer_OBJ qui permettraient de dessiner les contours de la classe
des b&#226;timens militaires.
</p>
<p>Ainsi, les mots qui appartiennent &#224; ces trois types de couples de classes sont particuli&#232;rement
bien rep&#233;r&#233;s par l&#8217;AD du fait que les propri&#233;t&#233;s s&#233;mantiques qu&#8217;ils partagent se r&#233;percutent sur le
plan distributionnel. Nous avons vu que les distributions des couples de lieux et d&#8217;&#233;v&#233;nements se
caract&#233;risaient par un ensemble de contextes compatibles avec la plupart des mots appartenant &#224;
chacune de ces classes. Ce constat se v&#233;rifie dans une moindre mesure sur la classe des b&#226;timents,
pour laquelle les classes qui &#233;mergent se situent &#224; un niveau plus fin.
</p>
<p>5.1.2 Classes rep&#233;r&#233;es en quantit&#233;s moindres
</p>
<p>Les couples compos&#233;s de deux &#233;l&#233;ments appartenant aux classes SUBSTANCE, INSTRUMENTATION ou
LIVING_PART sont capt&#233;s par l&#8217;AD dans des proportions allant seulement de 33,9 % &#224; 51,2 %. Nous
avons donc affaire &#224; des couples de mots qui, tout en poss&#233;dant la m&#234;me &#233;tiquette s&#233;mantique,
se caract&#233;risent par des propri&#233;t&#233;s distributionnelles diff&#233;rentes.
</p>
<p>Dans le cas de la classe SUBSTANCE, les mots reli&#233;s d&#233;signent deux substances ou mati&#232;res (au
sens large) dont l&#8217;une entre dans la composition de l&#8217;autre : carbone/diamant, cr&#234;me/beurre,
&#233;thanol/rhum. Nous identifions deux ph&#233;nom&#232;nes expliquant la raison pour laquelle ces couples
de mots sont mal rep&#233;r&#233;s par l&#8217;AD. Le premier est que leurs membres ne sont pas forc&#233;ment
employ&#233;s comme des substances dans le corpus. Rhum, par exemple, appara&#238;t comme un produit
fini et non pas comme un ingr&#233;dient (sauf dans le contexte baba_&#192;). Le second est que, m&#234;me
dans les &#8211; rares &#8211; cas o&#249; les deux mots sont employ&#233;s comme des composants, ils n&#8217;entrent pas
forc&#233;ment dans la composition du m&#234;me type d&#8217;objets : pour le couple carbone/diamant, les
contextes comme collier_DE sont incompatibles avec carbone. Un couple comme cr&#232;me/beurre fait
exception &#224; la r&#232;gle. Cr&#232;me et beurre ont &#233;t&#233; d&#233;tect&#233;s comme voisins, ils partagent les contextes
m&#233;langer_OBJ, incorporer_OBJ, verser_OBJ, etc. Ces deux mots ont en commun qu&#8217;ils apparaissent
comme des ingr&#233;dients de cuisine. Dans le cas de carbone/diamant, les contextes se recoupent
moins dans la mesure o&#249; on a affaire, d&#8217;un c&#244;t&#233;, &#224; un &#233;l&#233;ment chimique et, de l&#8217;autre, &#224; un min&#233;ral.
Cette diff&#233;rence s&#233;mantique semble suffisamment importante pour qu&#8217;elle soit perceptible au
niveau de leurs distributions respectives et que ces deux mots ne soient donc pas rep&#233;r&#233;s comme
des voisins.
</p>
<p>Les couples dont les deux membres appartiennent &#224; la classe INSTRUMENTATION sont rep&#233;r&#233;s par
les voisins &#224; hauteur de 41,5 %. La notion d&#8217;instrument est &#224; prendre au sens large, et les couples
appartenant &#224; cette classe expriment une relation o&#249; un &#233;l&#233;ment fait partie d&#8217;un dispositif ou
un syst&#232;me de plus grande ampleur : &#233;cran/ordinateur, p&#233;dale/bicyclette, pneu/autobus. Dans la
plupart des cas, les distributions entre les deux mots sont trop &#233;loign&#233;es pour que l&#8217;analyse per-
mette de les rapprocher. Par exemple, les contextes dans lesquels appara&#238;t le m&#233;ronyme r&#233;servoir
(volume_DE, servir_DE, placer_OBJ) diff&#232;rent compl&#232;tement de ceux dans lesquels apparaissent
ses holonymes automobile et moto (accident_DE, conduire_OBJ, mod&#232;le_DE). Le cas du m&#233;ronyme
moteur, en revanche, illustre une situation o&#249; la distribution du m&#233;ronyme et de l&#8217;holonyme
se recoupent : les 7 paires dans lesquelles il prend place sont toutes rep&#233;r&#233;es par les voisins.
Il appara&#238;t en position m&#233;ronyme de avion, bateau, machine, navire, train, v&#233;hicule et voiture.
L&#8217;analyse des contextes communs fait appara&#238;tre une certaine symbiose entre le moteur et la
machine qu&#8217;il &#233;quipe, dans la mesure o&#249; ils partagent un &#233;ventail de contextes relativement
&#233;tendu comme panne_DE, bruit_DE, consommer_suj, puissance_DE, se arr&#234;ter_SUJ, fonctionner_SUJ,
etc. On pourrait analyser certains de ces contextes comme des cas de m&#233;tonymie : le bruit produit
</p>
<p>179</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>par l&#8217;avion est en fait le bruit du moteur, de m&#234;me que la puissance de la voiture est celle de son
moteur.
</p>
<p>Les couples de mots appartenant tous deux &#224; la classe LIVING_PART sont les couples homog&#232;nes
les moins bien identifi&#233;s par l&#8217;AD. Ils relient deux parties du corps (corps humain, animal ou
partie d&#8217;un v&#233;g&#233;tal), dont l&#8217;une est elle-m&#234;me une partie de l&#8217;autre : chair/doigt, muscle/bras,
peau/visage. Une des raisons expliquant les diff&#233;rences de distribution parmi les parties du corps
est que, dans la plupart des cas, l&#8217;on affaire &#224; des sous-classes de parties du corps dont les
fonctionnements diff&#232;rent radicalement. Ainsi, le fait que les couples nerf/jambe ou nerf/doigt ne
sont pas capt&#233;s s&#8217;explique par le fait que jambe et doigt sont des membres du corps. Ils peuvent
par cons&#233;quent appara&#238;tre en position objet de verbes comme lever, croiser ou replier, soit autant
de contextes dans lesquels ne peut pas appara&#238;tre nerf.
</p>
<p>Ainsi, nous pouvons conclure de l&#8217;analyse de ces trois types de couples que les cat&#233;gories substance,
instrumentation et living_part s&#8217;av&#232;rent peu pertinentes du point de vue distributionnel. Elle
sont constitu&#233;es de mots dont les distributions sont particuli&#232;rement dissemblables. Ainsi, si on
postule a priori l&#8217;existence d&#8217;une classe s&#233;mantique des parties du corps, l&#8217;analyse du corpus
montre que les mots jambe, bras, doigt, etc. entrent en fait dans un paradigme diff&#233;rent de celui
de veine, nerf ou os. Il y a donc un d&#233;calage entre les classes s&#233;mantiques que l&#8217;on pourrait
d&#233;gager intuitivement et les classes distributionnelles qui &#233;mergent de l&#8217;analyse du texte.
</p>
<p>5.2 Couples h&#233;t&#233;rog&#232;nes
</p>
<p>Nous avons auparavant &#233;voqu&#233; la tendance qu&#8217;a l&#8217;AD &#224; faire &#233;merger des rapprochements relevant
de la similarit&#233; s&#233;mantique, c&#8217;est-&#224;-dire des mots qui sont &#8220;le m&#234;me genre de choses&#8221; (van der
Plas, 2008). De ce fait, on pouvait s&#8217;attendre &#224; ne pas trouver de couples h&#233;t&#233;rog&#232;nes parmi
les voisins distributionnels. Les r&#233;sultats montrent toutefois que certains couples de cat&#233;gories
diff&#233;rentes sont quasi-int&#233;gralement rep&#233;r&#233;s par l&#8217;AD.
</p>
<p>C&#8217;est notamment le cas des couples de mots dont le m&#233;ronyme appartient &#224; la classe des
humains (SOUL) et l&#8217;holonyme &#224; celle des groupes sociaux : capitaine/marine, fils/famille, mu-
sicien/orchestre. Ces couples sont rep&#233;r&#233;s &#224; 96,2 %. Cela s&#8217;explique par le fait que les mots de
la classe SOCIAL_GROUP ont des distributions similaires &#224; ceux de la classe SOUL. Ils partagent
par exemple la propri&#233;t&#233; d&#8217;appara&#238;tre en position sujet des verbes d&#8217;actions. Ainsi, le couple
directeur/entreprise a &#233;t&#233; rapproch&#233; sur la base de contextes comme d&#233;tenir_SUJ, conseiller_OBJ
ou affirmer_SUJ, qui sont clairement destin&#233;s &#224; &#234;tre employ&#233;s avec des anim&#233;s. Il en va de m&#234;me
pour joueur et &#233;quipe, qui ont &#233;t&#233; rapproch&#233;s via les contextes se entra&#238;ner_SUJ, affronter_SUJ ou
se qualifier_SUJ. Nous avons ici aussi affaire &#224; un fonctionnement de type m&#233;tonymique, dans la
mesure o&#249; l&#8217;ensemble est employ&#233; pour d&#233;signer les membres.
</p>
<p>Les couples dont le m&#233;ronyme est un b&#226;timent et l&#8217;holonyme un lieu &#8211; ch&#226;teau/canton,
&#233;cole/commune, immeuble/m&#233;tropole &#8211; sont &#233;galement bien capt&#233;s par l&#8217;AD (c&#8217;est le cas de
82,6 % d&#8217;entre eux). Cela peut s&#8217;expliquer par l&#8217;ambigu&#239;t&#233; des noms de b&#226;timents, qui peuvent
aussi bien &#234;tre employ&#233;s comme des noms de lieux. Ainsi, le recouvrement entre ces deux classes
implique une certaine similarit&#233; au niveau des distributions de leurs membres.
</p>
<p>&#192; l&#8217;autre extr&#233;mit&#233; du spectre, on remarque que la cat&#233;gorie LIVING_PART appara&#238;t en position
m&#233;ronyme dans trois des configurations h&#233;t&#233;rog&#232;nes les moins bien rep&#233;r&#233;es par l&#8217;AD. Cette
classe est successivement associ&#233;e &#224; PLANT_LIFE (p&#233;tale/marguerite, tige/rose, tronc/ch&#234;ne), SOUL
(bras/citoyen, doigt/b&#233;b&#233;, main/professeur) et FAUNA (bec/canard, patte/chat, queue/loup). Dans
</p>
<p>180</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>les trois cas, le fait que les couples relevant de ces classes ne soient que peu rep&#233;r&#233;s s&#8217;explique
par le fait qu&#8217;ici, les touts sont des &#234;tres anim&#233;s, contrairement &#224; leurs parties. La cons&#233;quence
en est que leurs propri&#233;t&#233;s distributionnelles sont radicalement oppos&#233;es &#224; celles de leurs
m&#233;ronymes. Cela semble &#234;tre un peu moins flagrant pour les v&#233;g&#233;taux (ce qui explique que
les couples LIVING_PART/PLANT_LIFE sont mieux rep&#233;r&#233;s que les couples LIVING_PART/SOUL et
LIVING_PART/FAUNA). On est donc dans le cas attendu de mots relevant de sens diff&#233;rents et par
cons&#233;quent dissemblables sur le plan distributionnel.
</p>
<p>5.3 Conclusion
</p>
<p>Dans le cadre de cette &#233;tude consacr&#233;e &#224; l&#8217;acquisition de relations s&#233;mantiques par des techniques
d&#8217;analyse distributionnelle, nous nous sommes concentr&#233;s sur le cas de la relation de m&#233;ronymie.
Nous avons adopt&#233; une m&#233;thode d&#8217;&#233;valuation qualitative reposant sur l&#8217;annotation s&#233;mantique
de couples de m&#233;ronymes. Sur le plan m&#233;thodologique, cette &#233;tude a montr&#233; que la typologie
habituellement utilis&#233;e pour d&#233;crire les diff&#233;rents types de relations m&#233;ronymiques &#233;tait peu
adapt&#233;e pour cat&#233;goriser nos donn&#233;es. Une approche consistant &#224; typer s&#233;mantiquement les
couples de m&#233;ronymes permet de mieux rendre compte de la diversit&#233; des relations qu&#8217;ils
expriment. Sur le plan des r&#233;sultats, nous avons montr&#233; que si la m&#233;ronymie, consid&#233;r&#233;e
globalement, est rep&#233;r&#233;e dans des proportions comparables &#224; d&#8217;autres relations (environ 1/3
des m&#233;ronymes de JDM sont d&#233;tect&#233;s par le programme d&#8217;AD que nous avons utilis&#233;), elle
n&#8217;est pas rep&#233;r&#233;e par l&#8217;AD de mani&#232;re homog&#232;ne : la nature s&#233;mantique des mots qui entrent
dans la relation de m&#233;ronymie constitue un facteur d&#233;cisif pour leur d&#233;tection par l&#8217;AD. Tout
d&#8217;abord, nous avons constat&#233; que l&#8217;AD privil&#233;gie le rep&#233;rage des couples de m&#233;ronymes dont
les membres rel&#232;vent de la m&#234;me classe s&#233;mantique. Ensuite, nous avons vu que certaines
configurations &#233;taient identifi&#233;es dans des proportions beaucoup plus fortes que d&#8217;autres. C&#8217;est le
cas des paires associant deux lieux, deux &#233;v&#233;nements ou deux structures, ou associant un humain
et un groupe social ou un lieu et un b&#226;timent. D&#8217;autres relations m&#233;ronymiques, comme celles
impliquant les parties du corps, sont mal d&#233;tect&#233;es par l&#8217;AD car elles mettent en jeu des termes
qui ne fonctionnent pas de la m&#234;me mani&#232;re sur le plan distributionnel. Cette &#233;tude contribue
donc &#224; pr&#233;ciser les conditions d&#8217;application du crit&#232;re distributionnel au rep&#233;rage d&#8217;une relation
s&#233;mantique donn&#233;e. &#192; ce stade, elle laisse cependant ouverte la question de l&#8217;influence du corpus
de test sur la pr&#233;dominance de certaines configurations distributionnelles des r&#233;sultats.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BARONI, M. et LENCI, A. (2010). Distributional memory : A general framework for corpus-based
semantics. Computational Linguistics, 36.
</p>
<p>BARONI, M. et LENCI, A. (2011). How we BLESSed distributional semantic evaluation. GEMS
2011, pages 1&#8211;10.
</p>
<p>BOURIGAULT, D. (2002). UPERY : un outil d&#8217;analyse distributionnelle &#233;tendue pour la construction
d&#8217;ontologies &#224; partir de corpus. In Actes de la 9econf&#233;rence sur le Traitement Automatique de la
Langue Naturelle, pages 75&#8211;84, Nancy.
</p>
<p>BOURIGAULT, D. (2007). Un analyseur syntaxique op&#233;rationnel : SYNTEX. M&#233;moire d&#8217;habilitation
&#224; diriger des recherches. Universit&#233; Toulouse II &#8211; Le Mirail.
</p>
<p>BOURIGAULT, D. et GALY, E. (2005). Analyse distributionnelle de corpus de langue g&#233;n&#233;rale et
synonymie. In 4esJourn&#233;es de la linguistique de corpus, Lorient.
</p>
<p>181</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CRUSE, D. A. (1986). Lexical semantics. Cambridge University Press.
</p>
<p>FELLBAUM, C., &#233;diteur (1998). WordNet : an electronic lexical database. MIT Press, Cambridge.
</p>
<p>FERRET, O. (2010). Similarit&#233; s&#233;mantique et extraction de synonymes &#224; partir de corpus. In
Actes de TALN 2010 Traitement Automatique des Langues Naturelles - TALN 2010.
</p>
<p>KEET, C. et ARTALE, A. (2008). Representing and reasoning over a taxonomy of part&#8211;whole
relations. Applied Ontology, 3(1):91&#8211;110.
</p>
<p>LAFOURCADE, M. (2007). Making people play for lexical acquisition. In 7th Symposium on natural
Language Processing.
</p>
<p>LIN, D. (1998). An information-theoretic definition of similarity. In Proceedings of the 15th
International Conference on Machine Learning, pages 296&#8211;304.
</p>
<p>MORLANE-HOND&#200;RE, F. et FABRE, C. (2010). L&#8217;antonymie observ&#233;e avec des m&#233;thodes de TAL :
une relation &#224; la fois syntagmatique et paradigmatique ? In Actes de TALN 2010 Traitement
Automatique des Langues Naturelles - TALN 2010.
</p>
<p>MULLER, P. et LANGLAIS, P. (2011). Comparaison d&#8217;une approche miroir et d&#8217;une approche
distributionnelle pour l&#8217;extraction de mots s&#233;mantiquement reli&#233;s. In Traitement Automatique
des Langues Naturelles (TALN), Montpellier, volume 1, pages 235&#8211;246.
</p>
<p>MURPHY, M. L. (2003). Semantic Relations and the Lexicon. Cambridge University Press, New
York.
</p>
<p>SAHLGREN, M. (2006). The Word-Space Model : using distributional analysis to represent syn-
tagmatic and paradigmatic relations between words in high-dimensional vector spaces. Th&#232;se de
doctorat, Stockholm University.
</p>
<p>TURNEY, P. D. (2008). A uniform approach to analogies, synonyms, antonyms, and associations.
In COLING, pages 905&#8211;912.
</p>
<p>VAN CAMPENHOUDT, M. (1996). Recherche d&#8217;&#233;quivalences et structuration des r&#233;seaux notion-
nels : le cas des relations m&#233;ronymiques. Terminology, 3(1):53&#8211;83.
</p>
<p>van der PLAS, L. (2008). Automatic lexico-semantic acquisition for question answering. Th&#232;se de
doctorat, Universit&#233; de Groningen (Pays-bas).
</p>
<p>WINSTON, M. E., CHAFFIN, R. et HERRMANN, D. (1987). A taxonomy of part-whole relations.
Cognitive Science, 11(4):417&#8211;444.
</p>
<p>182</p>

</div></div>
</body></html>