<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Fouille de graphes sous contraintes linguistiques pour l'exploration de grands textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 253&#8211;266,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Fouille de graphes sous contraintes linguistiques pour
l&#8217;exploration de grands textes
</p>
<p>Solen Quiniou1, 2 Peggy Cellier3 Thierry Charnois1 Dominique Legallois2
(1) GREYC Universit&#233; de Caen Basse-Normandie, Campus 2, 14000 Caen
(2) CRISCO Universit&#233; de Caen Basse-Normandie, Campus 1, 14000 Caen
(3) IRISA-INSA de Rennes, Campus de Beaulieu, 35042 Rennes Cedex
solen.quiniou@unicaen.fr, peggy.cellier@irisa.fr,
</p>
<p>thierry.charnois@unicaen.fr, dominique.legallois@unicaen.fr
</p>
<p>R&#201;SUM&#201;
Dans cet article, nous proposons une approche pour explorer des textes de taille importante
en mettant en &#233;vidence des sous-parties coh&#233;rentes. Cette m&#233;thode d&#8217;exploration s&#8217;appuie sur
une repr&#233;sentation en graphe du texte, en utilisant le mod&#232;le linguistique de Hoey pour s&#233;-
lectionner et apparier les phrases dans le graphe. Notre contribution porte sur l&#8217;utilisation de
techniques de fouille de graphes sous contraintes pour extraire des sous-parties pertinentes du
texte (c&#8217;est-&#224;-dire des collections de sous-r&#233;seaux phrastiques homog&#232;nes). Nous avons r&#233;alis&#233;
des exp&#233;rimentations sur deux textes anglais de taille cons&#233;quente pour montrer l&#8217;int&#233;r&#234;t de
l&#8217;approche que nous proposons.
</p>
<p>ABSTRACT
Graph Mining Under Linguistic Constraints to Explore Large Texts
</p>
<p>In this paper, we propose an approach to explore large texts by highlighting coherent sub-parts.
The exploration method relies on a graph representation of the text according to the Hoey
linguistic model which allows the selection and the binding of sentences in the graph. Our
contribution relates to using graph mining techniques under constraints to extract relevant sub-
parts of the text (i.e., collections of homogeneous sentence sub-networks). We have conducted
some experiments on two large English texts to show the interest of the proposed approach.
</p>
<p>MOTS-CL&#201;S : Fouille de graphes, r&#233;seaux phrastiques, analyse textuelle, navigation textuelle.
</p>
<p>KEYWORDS: Graph Mining, sentence networks, textual analysis, textual navigation.
</p>
<p>1 Introduction
</p>
<p>L&#8217;interpr&#233;tation critique des textes et l&#8217;analyse textuelle et discursive ont &#233;t&#233; renouvel&#233;es ces
derni&#232;res ann&#233;es gr&#226;ce &#224; la num&#233;risation de nombreux textes. Cependant, ce renouvellement
s&#8217;accompagne de difficult&#233;s, notamment techniques : la num&#233;risation ne suffit pas en elle-m&#234;me,
l&#8217;investigation des textes doit s&#8217;appuyer sur des m&#233;thodes et outils offrant &#224; la fois une visuali-
sation et une navigation pertinentes dans les textes. Les chercheurs peuvent ainsi par exemple
focaliser leur analyse sur des th&#233;matiques particuli&#232;res. La n&#233;cessit&#233; de tels m&#233;thodes et outils
est d&#8217;autant plus forte que les textes sont g&#233;n&#233;ralement de taille cons&#233;quente. Deux types d&#8217;ap-
proches peuvent aider les linguistes dans des t&#226;ches d&#8217;exploration ou d&#8217;analyse de textes : les
</p>
<p>253</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>m&#233;thodes de r&#233;sum&#233; automatique et les techniques de visualisation de collections de textes.
</p>
<p>D&#8217;un c&#244;t&#233;, les m&#233;thodes de r&#233;sum&#233; automatique visent &#224; produire une vue contigu&#235; du texte
sous la forme d&#8217;un texte r&#233;duit form&#233; de phrases saillantes. Il existe deux principales cat&#233;gories
d&#8217;approches pour le r&#233;sum&#233; automatique. Le premier type d&#8217;approche s&#8217;appuie sur l&#8217;extraction
de phrases du texte original (Lin et Hovy, 2002). Un sous-ensemble de phrases saillantes du
texte original est ainsi s&#233;lectionn&#233;. Dans le second type d&#8217;approche, appel&#233; compression de
phrases(Knight et Marcu, 2000), l&#8217;objectif est de r&#233;duire les phrases tout en pr&#233;servant leur
sens. Cependant, les m&#233;thodes de r&#233;sum&#233; automatique ne permettent pas de produire une vue
relationnelle de la structure ou de l&#8217;organisation des diff&#233;rentes parties du texte.
</p>
<p>D&#8217;un autre c&#244;t&#233;, les techniques de visualisation de collections de textes ont connu un int&#233;r&#234;t
grandissant ces derni&#232;res ann&#233;es (Newman et al., 2010; Don et al., 2007; Fekete et Dufournaud,
2000; Plaisant et al., 2006). Par exemple, Newman et al. (2010) utilisent un mod&#232;le probabiliste
pour produire un ensemble de th&#233;matiques d&#233;crivant une collection afin que l&#8217;utilisateur puisse
effectuer une recherche de documents li&#233;s &#224; une th&#233;matique particuli&#232;re. Don et al. (2007) ont
propos&#233; un outil pour visualiser une collection de textes et permettre &#224; l&#8217;utilisateur de l&#8217;explorer
en affichant des motifs textuels fr&#233;quents (par exemple, des mots fr&#233;quents ou des ensembles
de trigrammes). Les occurrences des motifs sont alors mises en relief dans le texte. Cependant,
les approches de visualisation pr&#233;sentent un inconv&#233;nient commun aux approches de r&#233;sum&#233;
automatique : le texte est visualis&#233; de mani&#232;re globale, sans mettre en &#233;vidence les relations
entre les phrases.
</p>
<p>Parmi les travaux int&#233;ressants en linguistique concernant l&#8217;exploration de textes, Hoey a pr&#233;-
sent&#233; un mod&#232;le linguistique pour analyser des textes non-narratifs en s&#8217;appuyant sur les r&#233;p&#233;ti-
tions lexicales (Hoey, 1991). L&#8217;approche met en &#233;vidence l&#8217;organisation du texte (par exemple,
le d&#233;veloppement du texte ou son contenu conceptuel) en r&#233;v&#233;lant les appariements entre
phrases contigu&#235;s ou non contigu&#235;s, ce qui permet de construire une repr&#233;sentation du texte
sous forme de r&#233;seaux phrastiques. Cette approche est int&#233;ressante pour plusieurs t&#226;ches tel
que le raisonnement logique sur un sujet particulier du texte, l&#8217;&#233;tude de la coh&#233;sion lexicale du
texte (Legallois et al., 2011), le r&#233;sum&#233; de texte (Renouf et Kehoe, 2004) ou encore la segmenta-
tion de texte (Sardinha, 1999). Plusieurs &#233;tudes ont montr&#233; l&#8217;int&#233;r&#234;t de la m&#233;thode sur des textes
en anglais (Hoey, 1997; K&#225;roly et Francis, 2000) mais aussi sur des textes en fran&#231;ais (Legallois,
2006). Alors qu&#8217;il est difficile de l&#8217;appliquer &#224; la main sur des textes cons&#233;quents, peu de travaux
utilisent une impl&#233;mentation du mod&#232;le de Hoey. Dans Renouf et Kehoe (2004), les auteurs ont
d&#233;velopp&#233; un outil de r&#233;sum&#233; bas&#233; sur le mod&#232;le de Hoey : SEAGULL (Summary Extraction
Algorithm Generated Using Lexical Links). Ils ont r&#233;alis&#233; des exp&#233;rimentations pour montrer que
leur outil obtient de meilleures performances que d&#8217;autres outils de r&#233;sum&#233; automatique mais
ils n&#8217;ont utilis&#233; pour cela qu&#8217;un petit texte en anglais (730 mots). Dans Legallois et al. (2011) les
auteurs ont propos&#233; un processus automatique appliquant le mod&#232;le de Hoey sur des textes de
grande taille, afin d&#8217;&#233;tudier la coh&#233;sion lexicale de ces textes. Les exp&#233;rimentations men&#233;es sur
diff&#233;rents types de textes en fran&#231;ais (narratif, expositif) ont permis de montrer l&#8217;int&#233;r&#234;t de ce
mod&#232;le pour cette t&#226;che. Cependant, la grande taille des r&#233;seaux phrastiques obtenus par l&#8217;appli-
cation de ce mod&#232;le demeure un inconv&#233;nient. En effet, cette repr&#233;sentation ne permet pas de
visualiser de longs textes en entier et l&#8217;extraction de sous-parties potentiellement int&#233;ressantes
n&#8217;est pas pr&#233;vue par le mod&#232;le.
</p>
<p>Dans cet article, nous proposons une approche pour extraire automatiquement, &#224; partir d&#8217;un
texte, des sous-ensembles de phrases coh&#233;rents d&#8217;un point de vue lexical. De plus, les sous-
</p>
<p>254</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ensembles sont repr&#233;sent&#233;s par des graphes, ce qui offre une vue des relations entre les phrases
de ces sous-ensembles. Enfn, la taille des sous-ensembles de phrases &#233;tant raisonnable, cela
permet aux linguistes de les analyser. Notre approche s&#8217;appuie sur une repr&#233;sentation du texte
sous forme de graphe par application du mod&#232;le linguistique de Hoey. Pour pouvoir analyser de
grands textes, nous proposons une impl&#233;mentation du mod&#232;le de Hoey permettant de traiter des
textes de grande taille. La principale contribution est l&#8217;utilisation d&#8217;une technique particuli&#232;re
de fouille de graphes, appel&#233;e fouille de CoHoP, pour extraire des sous-parties coh&#233;rentes du
texte repr&#233;sent&#233; sous forme de graphes. &#192; notre connaissance, cette technique de fouille de
graphes n&#8217;a jamais &#233;t&#233; utilis&#233;e dans le domaine du traitement automatique des langues. Dans
notre approche, le processus de fouille est dit &#171; sous contraintes linguistiques &#187; car le graphe
initial repr&#233;sentant le texte est construit par application du mod&#232;le de Hoey. D&#8217;autres contraintes
linguistiques sur les sommets du graphe guident &#233;galement le processus de fouille.
</p>
<p>La fouille de graphes a connu un int&#233;r&#234;t grandissant dans le domaine de la fouille de donn&#233;es
pour la d&#233;couverte de nouvelles connaissances (Washio et Motoda, 2003), et plus particuli&#232;re-
ment la fouille de graphes enrichis (des attributs sont alors associ&#233;s aux sommets). De telles
m&#233;thodes de fouille ont &#233;t&#233; utilis&#233;es avec succ&#232;s pour des t&#226;ches comme le clustering (Ge et al.,
2008; Zhou et al., 2010) ou l&#8217;extraction de sous-graphes approximatifs (Tong et al., 2007). Dans
cet article, nous nous focalisons sur la fouille d&#8217;un certain type de motifs &#224; partir de graphes en-
richis : des collections de k-PC homog&#232;nes (CoHoP) (Mougel et al., 2012). Nous les utilisons pour
extraire des sous-parties homog&#232;nes du texte.
</p>
<p>Dans la suite de l&#8217;article, nous pr&#233;sentons le mod&#232;le linguistique de Hoey, dans la section 2, puis
les techniques de fouille de graphes pour extraire des motifs de type CoHoP, dans la section 3.
Nous d&#233;crivons ensuite notre approche permettant d&#8217;extraire des sous-parties coh&#233;rentes des
r&#233;seaux phrastiques en s&#8217;appuyant sur des m&#233;thodes de fouille de graphes, dans la section 4.
Nous discutons enfin des exp&#233;rimentations men&#233;es sur deux textes anglais, dans la section 5.
</p>
<p>2 Mod&#232;le linguistique de Hoey
</p>
<p>Le mod&#232;le linguistique introduit dans Hoey (1991) repose sur la notion de r&#233;p&#233;tition lexicale
au sein d&#8217;un texte. Il consiste alors &#224; identifier les phrases du texte qui partagent au moins trois
unit&#233;s lexicales. Une r&#233;p&#233;tition lexicale peut correspondre &#224; la stricte r&#233;p&#233;tition de l&#8217;unit&#233; lexi-
cale (cerveau/cerveau) mais aussi &#224; la r&#233;p&#233;tition d&#8217;unit&#233;s lexicales partageant le m&#234;me lemme
ou une autre forme d&#233;riv&#233;e (produire/production). La r&#233;p&#233;tition lexicale peut &#233;galement corres-
pondre &#224; une reprise anaphorique, une relation de synonymie (acheter/acqu&#233;rir), une relation
d&#8217;hypo/hyperonymie (chien/animal), une relation &#171; implicative &#187; (conduire/voiture) ou encore
une suite ordonn&#233;e (lundi/mardi/mercredi/. . . ).
</p>
<p>Lorsque deux phrases partagent au moins trois unit&#233;s lexicales, la paire de phrases est appari&#233;e.
Un appariement entre deux phrases correspond ainsi &#224; un chemin entre ces phrases. On appelle
alors r&#233;seau phrastique un ensemble d&#8217;au moins trois phrases tel que, quelles que soient deux
phrases de cet ensemble, ces phrases sont soit directement appari&#233;es, soit indirectement reli&#233;es
par une succession de chemins dans l&#8217;ensemble de phrases 1. L&#8217;ensemble des r&#233;seaux phrastiques
d&#8217;un texte est appel&#233; hypotexte. L&#8217;hypotexte peut &#234;tre vu en quelque sorte comme un r&#233;sum&#233; du
</p>
<p>1. Notons qu&#8217;en th&#233;orie des graphes, un r&#233;seau phrastique correspond &#224; une composante connexe du graphe consti-
tu&#233; des appariements.
</p>
<p>255</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>texte original. Il est &#224; noter que les phrases non appari&#233;es n&#8217;apparaissent pas dans l&#8217;hypotexte.
</p>
<p>La figure 1 montre un extrait d&#8217;un r&#233;seau phrastique de &#8220;Love Online: Emotions on the Inter-
net&#8221; (Ben-Ze&#8217;ev, 2004). Dans cet exemple, la r&#233;p&#233;tition lexicale repose uniquement sur les
lemmes des lex&#232;mes communs des phrases (les lex&#232;mes correspondent aux noms, adjectifs, ad-
verbes et verbes). Ainsi, seules les r&#233;p&#233;titions strictes sont consid&#233;r&#233;es. Le r&#233;seau phrastique est
interpr&#233;table avec quelques &#171; am&#233;nagements &#187; mineurs. Dans l&#8217;exemple de la figure 1, certains
mots ont &#233;t&#233; ajout&#233;s au texte original et mis entre crochets afin de faciliter la lecture des encha&#238;-
nements phrastiques du r&#233;seau (par exemple, [However]). La num&#233;rotation au d&#233;but de chaque
phrase (entre crochets) correspond &#224; la position de la phrase dans le texte original ; il est alors
int&#233;ressant de constater que l&#8217;empan de cet extrait de r&#233;seau est relativement cons&#233;quent.
</p>
<p>Le mod&#232;le de Hoey permet de repr&#233;senter un texte afin d&#8217;analyser sa coh&#233;sion lexicale. Ce-
pendant, la repr&#233;sentation sous forme d&#8217;hypotexte construite par ce mod&#232;le est de taille trop
importante pour &#234;tre visualis&#233;e en entier, ce qui rend fastidieuse l&#8217;exploration et l&#8217;analyse du
texte. Ainsi, il est int&#233;ressant de disposer d&#8217;une m&#233;thode permettant d&#8217;extraire des sous-parties
homog&#232;nes de r&#233;seaux phrastiques afin de faciliter l&#8217;analyse de ces r&#233;seaux. Dans ce but, nous
introduisons, dans la section suivante, une approche de fouille de graphes permettant d&#8217;extraire
des motifs appel&#233;s CoHoP.
</p>
<p>3 Fouille de graphes : motifs de type CoHoP
</p>
<p>Les CoHoP (collection de k-cliques percol&#233;es) sont des motifs extraits &#224; partir de graphes attribu&#233;s
bool&#233;ens (Mougel et al., 2012). Elle peuvent &#234;tre vues comme des ensembles de communaut&#233;s
dont les &#233;l&#233;ments partagent des propri&#233;t&#233;s communes : chaque communaut&#233; correspond &#224; une
k-clique percol&#233;e (k-PC). Les CoHoP rendent ainsi compte d&#8217;une structure cach&#233;e, sous-jacente
au graphe initial. Dans cette section, nous pr&#233;sentons les deux principales notions sur lesquelles
s&#8217;appuie cette technique particuli&#232;re de fouille de graphe : les k-PC et les CoHoP.
</p>
<p>3.1 k-cliques percol&#233;es (k-PC)
</p>
<p>Dans un graphe, une k-clique est un ensemble de k sommets dans lequel chaque paire de som-
mets distincts est connect&#233;e par une ar&#234;te. La notion de k-clique percol&#233;e (k-PC) peut &#234;tre vue
comme une version rel&#226;ch&#233;e du concept de clique. Une k-PC a &#233;t&#233; d&#233;finie par Derenyi et al.
(2005) comme &#233;tant l&#8217;union de toutes les k-cliques connect&#233;es par des chevauchements de k&#8722;1
sommets. Ainsi, dans une k-PC, chaque k-clique peut &#234;tre atteinte de n&#8217;importe quelle autre
k-clique par un chemin de k-cliques adjacentes et chaque sommet d&#8217;une k-PC peut &#234;tre atteint
</p>
<p>[1109] Online1 emotional2 experiences3 may be compared to receiving a salary without earning it by hard work.
[1733] [However] Online1 relationships4 have a profound impact upon our emotional2 experiences3 .
[2373] Since emotional2 self-disclosure is more important to the experience3 of intimacy than factual self-disclosure, 13
online1 relationships4 often have a higher degree of intimacy than offline relationships4 .
</p>
<p>FIGURE 1: Extrait d&#8217;un r&#233;seau phrastique de &#8220;Love Online: Emotions on the Internet&#8221;
</p>
<p>256</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>KPC1
</p>
<p>KPC2
</p>
<p>KPC3
</p>
<p>KPC4
</p>
<p>(a) k = 3
</p>
<p>KPC1
</p>
<p>KPC2
</p>
<p>(b) k = 2
</p>
<p>FIGURE 2: Exemple de CoHoP extraite &#224; partir des attributs {a1, a2}, pour deux valeurs de k
</p>
<p>par n&#8217;importe quel autre sommet de cette k-PC par un chemin de sous-ensembles de sommets
bien connect&#233;s (les k-cliques).
</p>
<p>Dans la figure 2a, il y a quatre k-PC (k = 3) : {1109, 1733, 2373}, {913, 4872, 5547}, {4573,
5539, 5546} et {1345, 4573, 4712, 5036, 5077}. Les trois premi&#232;res k-PC contiennent une seule
3-clique alors que la derni&#232;re k-PC contient cinq 3-cliques (e.g., {1345, 4712, 5036} et {1345,
4712, 4573}). Revenons sur la cr&#233;ation de cette derni&#232;re k-PC. Nous pouvons tout d&#8217;abord
constater que les sommets 1345, 4573, 4712 et 5036 sont directement connect&#233;s les uns aux
autres : ils appartiennent ainsi &#224; la m&#234;me k-PC. Le sommet 5071 appartient &#233;galement &#224; cette
k-PC puisqu&#8217;il est accessible &#224; partir de chacun des quatre sommets pr&#233;c&#233;dents, par une s&#233;rie de
k-cliques se chevauchant (le param&#232;tre k a un impact sur le nombre de sommets &#224; consid&#233;rer
dans les k-cliques ; dans cet exemple, sa valeur est fix&#233;e &#224; 3) : par exemple, pour aller du sommet
5071 au sommet 4712, un chemin de 3-cliques se chevauchant peut &#234;tre {4712, 4573, 5036}
suivi de {4573, 5036, 5071} (avec k = 3, les chevauchements de 3-cliques contiennent deux
sommets). En revanche, le sommet 4872 n&#8217;appartient pas &#224; cette k-PC. En effet, pour cela il
faudrait qu&#8217;il y ait une 3-clique entre les sommets 4573, 5071 et 4872, ce qui n&#8217;est pas le cas.
</p>
<p>Il est &#224; noter que le calcul des k-PC est ind&#233;pendant des ensembles d&#8217;attributs associ&#233;s aux som-
mets (les graphes utilis&#233;s &#233;tant attribu&#233;s). De plus, une k-clique ne peut appartenir qu&#8217;&#224; au plus
une k-PC alors qu&#8217;un sommet peut se trouver dans plusieurs k-PC, puisqu&#8217;il peut appartenir &#224;
plusieurs k-cliques. Un sommet appartenant &#224; plusieurs k-PC est appel&#233; n&#339;ud relais ou bridging
node (Musial et Juszczyszyn, 2009). Ainsi, dans la figure 2a, le sommet 4573 est un n&#339;ud relais
car il appartient &#224; deux k-PC : KPC3 et KPC4.
</p>
<p>3.2 Collections de k-PC homog&#232;nes (CoHoP)
</p>
<p>Une collection de k-PC homog&#232;nes (CoHoP) a &#233;t&#233; d&#233;finie par (Mougel et al., 2012) comme &#233;tant
un ensemble de sommets tels que, &#233;tant donn&#233;s k, &#945; et &#947; des entiers positifs d&#233;finis par des
utilisateurs :
&#8211; tous les sommets sont homog&#232;nes, c&#8217;est-&#224;-dire qu&#8217;ils partagent au moins &#945; attributs ;
</p>
<p>257</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; la collection contient au moins &#947; k-PC ;
&#8211; toutes les k-PC ayant les m&#234;mes attributs sont pr&#233;sentes dans la collection (contrainte de
maximalit&#233;).
</p>
<p>La figure 2a repr&#233;sente ainsi une CoHoP extraite &#224; partir de l&#8217;ensemble d&#8217;attributs {a1, a2} ;
comme vu dans la section 3.1, elle contient quatre k-PC (&#945; = 2, k = 3,&#947; = 4). Il est &#224; noter que,
contrairement au calcul des k-PC, l&#8217;extraction des CoHoP d&#233;pend fortement de l&#8217;ensemble d&#8217;at-
tributs associ&#233;s aux sommets du graphe. Sur la figure 2a, les ensembles d&#8217;attributs des sommets
ne sont pas illustr&#233;s (pour ne pas surcharger la figure) mais chaque sommet est en fait &#233;tiquet&#233;
par un ensemble d&#8217;attributs qui contient au moins les attributs a1 et a2. En effet, cette CoHoP a
&#233;t&#233; extraite &#224; partir de ces deux attributs.
</p>
<p>Les trois param&#232;tres - k, &#945; et &#947; - ont un impact inportant sur la structure des CoHoP extraites.
Comme pr&#233;cis&#233; pr&#233;c&#233;demment, le param&#232;tre &#945; fixe le nombre minimal d&#8217;attributs communs
associ&#233;s aux sommets des CoHoP extraites et le param&#232;tre &#947; fixe le nombre minimal de k-PC
pr&#233;sentes dans les CoHoP. Le param&#232;tre k a &#233;galement un impact important sur la structure
des CoHoP extraites. En effet, augmenter sa valeur a pour cons&#233;quence d&#8217;augmenter le degr&#233;
de coh&#233;sion entre les sommets appartenant &#224; une m&#234;me k-PC. La figure 2b repr&#233;sente la CoHoP
extraite &#224; partir du m&#234;me ensemble d&#8217;attributs que celle illustr&#233;e par la figure 2a mais en fixant
cette fois k = 2. Cette CoHoP comporte maintenant 15 sommets r&#233;partis en seulement deux
k-PC, la plus grosse k-PC (KPC1) correspondant en fait aux quatre k-PC de la figure 2a. Ainsi,
le choix de la valeur de k permet de choisir le degr&#233; de coh&#233;sion souhait&#233; entre les sommets
de chaque k-PC. En effet, un plus grand nombre de sommets doit &#234;tre directement reli&#233; les uns
aux autres lorsque la valeur de k augmente (la valeur de k repr&#233;sente ce nombre minimal de
sommets).
</p>
<p>4 Fouille de r&#233;seaux phrastiques
</p>
<p>Dans cette section, nous proposons une nouvelle approche qui s&#8217;appuie &#224; la fois sur le mod&#232;le
de Hoey et sur la fouille de motifs de type CoHoP. Notre approche permet d&#8217;extraire des sous-
parties homog&#232;nes de r&#233;seaux phrastiques afin de faciliter leur analyse.
</p>
<p>collection de
</p>
<p>sous-r&#233;seaux
</p>
<p>phrastiques
</p>
<p>homog&#232;nes
</p>
<p>interpr&#233;tation
</p>
<p>linguistique
hypotexte
</p>
<p>texte
</p>
<p>filtr&#233;
texte
</p>
<p>Calcul des
</p>
<p>appariements
</p>
<p>entre phrases
</p>
<p>Pr&#233;-traitements
</p>
<p>FIGURE 3: Vue d&#8217;ensemble de l&#8217;extraction de collections de sous-r&#233;seaux phrastiques homog&#232;nes
</p>
<p>La figure 3 illustre les diff&#233;rentes &#233;tapes de notre approche, allant du pr&#233;-traitement du texte &#224;
l&#8217;extraction des collections de sous-r&#233;seaux phrastiques homog&#232;nes, en passant par la construc-
tion de l&#8217;hypotexte repr&#233;sentant le texte &#233;tudi&#233;. Ces diff&#233;rentes &#233;tapes sont d&#233;crites plus en
d&#233;tail dans les sous-sections suivantes.
</p>
<p>4.1 Construction de l&#8217;hypotexte
</p>
<p>Le texte est tout d&#8217;abord &#233;tiquet&#233; &#224; l&#8217;aide de TreeTagger (Schmid, 1994). Le texte &#233;tiquet&#233; est
ensuite d&#233;coup&#233; en phrases &#224; chaque signe de ponctuation de l&#8217;ensemble suivant : { &#171; . &#187;, &#171; ? &#187;,
</p>
<p>258</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#171; ! &#187;, &#171; : &#187;}. Les phrases sont finalement filtr&#233;es afin de ne conserver que leurs unit&#233;s lexicales
pertinentes. Dans notre cas, cela consiste &#224; ne garder que les lex&#232;mes (noms, adjectifs, adverbes
et verbes hormis les auxiliaires). En fait, nous consid&#233;rons les lemmes de ces lex&#232;mes. &#192; l&#8217;issue
de cette &#233;tape, chaque phrase du texte filtr&#233; est alors repr&#233;sent&#233;e par les lemmes de ses lex&#232;mes.
Par exemple, la phrase &#171; Online emotional experiences may be compared to receiving a salary
without earning it by hard work. &#187; est repr&#233;sent&#233;e par &#171; online emotional experience compare
receive salary earn hard work &#187;. Tous les mots non pertinents sont ainsi filtr&#233;s et les mots restants
(e.g., les lex&#232;mes) sont remplac&#233;s par leur lemme.
</p>
<p>&#192; partir du texte filtr&#233;, nous construisons ensuite la repr&#233;sentation du texte sous forme de graphe
en appliquant le mod&#232;le linguistique de Hoey, comme pr&#233;sent&#233; &#224; la section 2. L&#8217;hypotexte est
ainsi cr&#233;&#233; en appariant toutes les paires de phrases qui partagent au moins trois unit&#233;s lexicales
communes, correspondant dans notre cas aux lemmes des lex&#232;mes. Il est &#233;galement &#224; noter que
les phrases non appari&#233;es ne sont pas conserv&#233;es dans l&#8217;hypotexte.
</p>
<p>4.2 Fouille de collections de sous-r&#233;seaux phrastiques homog&#232;nes
</p>
<p>L&#8217;objectif de cette derni&#232;re &#233;tape est d&#8217;extraire des sous-parties homog&#232;nes de l&#8217;hypotexte. L&#8217;hy-
potexte cr&#233;&#233; comme d&#233;crit pr&#233;c&#233;demment peut &#234;tre vu comme un graphe attribu&#233;. En effet, un
hypotexte est un graphe dont chaque sommet repr&#233;sente une phrase appari&#233;e et dont chaque
ar&#234;te repr&#233;sente un appariement entre deux phrases qui partagent au moins trois unit&#233;s lexi-
cales communes. De plus, l&#8217;ensemble des unit&#233;s lexicales d&#8217;une phrase peut &#233;tiqueter le sommet
correspondant, en tant qu&#8217;ensemble d&#8217;attributs.
</p>
<p>Avec cette repr&#233;sentation de l&#8217;hypotexte comme un graphe attribu&#233;, nous pouvons utiliser des
algorithmes de fouille de CoHoP, comme pr&#233;sent&#233; &#224; la section 3. Dans notre approche, le proces-
sus de fouille est effectu&#233; &#171; sous contraintes linguistiques &#187; car, d&#8217;une part, la structure initiale du
graphe est construite en utilisant le mod&#232;le linguistique de Hoey et, d&#8217;autre part, les ensembles
d&#8217;attributs qui &#233;tiquettent les sommets sont les unit&#233;s lexicales des phrases correspondantes.
</p>
<p>Dans notre approche, chaque CoHoP extraite correspond alors &#224; ce que nous appelons une
collection de sous-r&#233;seaux phrastiques homog&#232;nes (CoHoSS). En effet, de la m&#234;me fa&#231;on qu&#8217;une
CoHoP est constitu&#233;e de k-PC homog&#232;nes (i.e., des ensembles de sommets partageant un sous-
ensemble de &#945; attributs communs), une CoHoSS est constitu&#233;e de sous-r&#233;seaux phrastiques
homog&#232;nes (i.e., des ensembles de phrases partageant un sous-ensemble de &#945; unit&#233;s lexicales
communes). Chaque sous-r&#233;seau phrastique correspond alors &#224; la d&#233;finition d&#8217;une k-PC. Ainsi,
dans un sous-r&#233;seau phrastique, chaque phrase est soit directement appari&#233;e aux autres phrases
du sous-r&#233;seau par une ar&#234;te (si elle partage au moins trois unit&#233;s lexicales avec chacune de
ces phrases), soit indirectement accessible depuis n&#8217;importe quelle autre phrase par une s&#233;rie
de sous-ensembles de phrases bien connect&#233;s (chaque sous-ensemble correspond &#224; une k-clique,
comme d&#233;fini &#224; la section 3.1). Ainsi, la CoHoP repr&#233;sent&#233;e par la figure 2a correspond &#224; une
collection de sous-r&#233;seaux phrastiques homog&#232;nes (i.e., une CoHoSS) dont toutes les phrases
partagent les mots emotional et experience (correspondant aux attributs a1 et a2, respective-
ment). En effet, chaque sommet de la CoHoP correspond &#224; une phrase, le num&#233;ro du sommet
indiquant la position de la phrase dans le texte (la figure 1 donne les phrases associ&#233;es aux
sommets 1109, 1733 et 2373 de la CoHoP). De plus, les ensembles d&#8217;attributs associ&#233;s aux
sommets correspondent aux ensembles d&#8217;unit&#233;s lexicales repr&#233;sentant les phrases. Par exemple,
l&#8217;ensemble d&#8217;attributs A4712 de la phrase 4712 correspond &#224; l&#8217;ensemble d&#8217;unit&#233;s lexicales suivant :
</p>
<p>259</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>{parallel, world, help, preserve, actual, not, give, exciting, emotional, experience}.
</p>
<p>Les CoHoSS repr&#233;sentent ainsi des collections de sous-r&#233;seaux phrastiques de l&#8217;hypotexte initial
qui ont une certaine coh&#233;sion lexicale par rapport &#224; l&#8217;ensemble des unit&#233;s lexicales &#224; partir
desquelles elles ont &#233;t&#233; extraites. Les CoHoSS ainsi que leur structure peuvent ensuite &#234;tre
analys&#233;es par des linguistes pour interpr&#233;ter, par exemple, chacun des sous-r&#233;seaux ainsi que la
fa&#231;on dont ils sont connect&#233;s les uns aux autres, notamment par les phrases relais (correspondant
aux n&#339;uds relais pr&#233;sent&#233;s dans la section 3.1).
</p>
<p>5 R&#233;sultats exp&#233;rimentaux
</p>
<p>Dans cette section, nous pr&#233;sentons les r&#233;sultats exp&#233;rimentaux sur deux textes anglais. Les
textes ainsi que les outils utilis&#233;s pour extraire et visualiser les CoHoP sont tout d&#8217;abord pr&#233;-
sent&#233;s dans la section 5.1. Nous discutons ensuite les r&#233;sultats quantitatifs sur l&#8217;utilisation du
mod&#232;le de Hoey et sur les CoHoSS extraites, dans les sections 5.2.1 et 5.2.2 respectivement. En-
fin, dans la section 5.2.3, nous pr&#233;sentons un exemple de CoHoSS extraite et son interpr&#233;tation
linguistique afin de montrer l&#8217;int&#233;r&#234;t de notre approche pour l&#8217;exploration de textes.
</p>
<p>5.1 Param&#232;tres : donn&#233;es et outils
</p>
<p>5.1.1 Textes &#233;tudi&#233;s
</p>
<p>Pour &#233;valuer l&#8217;approche que nous proposons, nous avons choisi deux textes de grande taille,
chacun correspondant &#224; un texte expositif en anglais : &#8220;The Origin of Speech&#8221; (MacNeilage, 2008)
et &#8220;Love Online: Emotions on the Internet&#8221; (Ben-Ze&#8217;ev, 2004). Les caract&#233;ristiques de ces textes
sont donn&#233;es dans la table 1.
</p>
<p>Texte Titre Auteur Ann&#233;e Nb. pages
Speech The Origin of Speech Peter F. MacNeilage 2008 416
Love Love Online : Aaron Ben-Ze&#8217;ev 2004 302
</p>
<p>Emotions on the Internet
</p>
<p>TABLE 1: Caract&#233;ristiques des textes &#233;tudi&#233;s
</p>
<p>5.1.2 Extraction de motifs de type CoHoP
</p>
<p>Afin d&#8217;extraire les CoHoP, comme pr&#233;sent&#233; dans la section 4.2, nous utilisons CoHoP Mi-
ner (Mougel et al., 2012). Cet outil permet d&#8217;extraire des CoHoP en fixant les valeurs des dif-
f&#233;rents param&#232;tres utilis&#233;s lors du processus de fouille (k, &#945; et &#947;). Il inclut &#233;galement une
interface graphique pour visualiser les CoHoP extraites, comme l&#8217;illustre la figure 4. Les k-PC de
la CoHoP affich&#233;e peuvent ainsi &#234;tre visualis&#233;es, chaque k-PC &#233;tant repr&#233;sent&#233;e par une couleur
diff&#233;rente. Les sommets appartenant &#224; plusieurs k-PC peuvent &#233;galement &#234;tre visualis&#233;s afin de
se focaliser sur eux lors de l&#8217;analyse des CoHoP, par exemple. Il est &#233;galement possible d&#8217;afficher
</p>
<p>260</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>l&#8217;ensemble d&#8217;attributs de chaque sommet. En fait, cet outil offre une visualisation globale des
motifs extraits puisqu&#8217;il permet de s&#233;lectionner les motifs &#224; analyser par la suite selon l&#8217;ensemble
des attributs &#224; partir desquels ils ont &#233;t&#233; extraits ou encore selon leur structure (par exemple, le
nombre de k-PC qu&#8217;ils contiennent ou la pr&#233;sence de sommets appartenant &#224; plusieurs k-PC). Ce-
pendant, afin d&#8217;analyser les CoHoP, les linguistes ont besoin d&#8217;afficher les phrases correspondant
aux sommets ainsi que les mots &#224; partir desquels les phrases ont &#233;t&#233; appari&#233;es (et conduisant &#224;
des ar&#234;tes entre les sommets). C&#8217;est pourquoi nous utilisons &#233;galement un outil de visualisation
de graphes.
</p>
<p>5.1.3 Visualisation des r&#233;seaux phrastiques
</p>
<p>Cet outil de visualisation de graphes a &#233;t&#233; d&#233;velopp&#233; en Java. Il offre une visualisation des
sous-r&#233;seaux phrastiques correspondant aux CoHoP extraites, comme illustr&#233; par la figure 5.
La CoHoSS affich&#233;e correspond &#224; la CoHoP de la figure 4 : les sommets correspondent aux
phrases du texte et les ar&#234;tes sont &#233;tiquet&#233;es par les unit&#233;s lexicales partag&#233;es par chaque paire
de phrases. Cet outil permet aux linguistes d&#8217;analyser plus facilement les r&#233;seaux phrastiques
en offrant une visualisation focalis&#233;e sur une collection particuli&#232;re de sous-r&#233;seaux phrastiques
homog&#232;nes. Cependant, il n&#8217;offre pas d&#8217;affichage des diff&#233;rentes k-PC de la CoHoP extraite, ce
qui rend plus difficile l&#8217;analyse des phrases appartenant &#224; plusieurs sous-r&#233;seaux (i.e., les phrases
relais), par exemple. Il est donc int&#233;ressant d&#8217;utiliser cet outil en compl&#233;ment de CoHoP Miner.
</p>
<p>5.2 Exp&#233;rimentations sur la fouille de r&#233;seaux phrastiques
</p>
<p>5.2.1 R&#233;sultats quantitatifs sur les r&#233;seaux phrastiques
</p>
<p>Nous pr&#233;sentons tout d&#8217;abord des r&#233;sultats quantitatifs sur l&#8217;hypotexte cr&#233;&#233; pour repr&#233;senter
chaque texte. Ces r&#233;sultats sont donn&#233;s dans la table 2. Nous pouvons tout d&#8217;abord remarquer
que chaque phrase contient en moyenne 10 lex&#232;mes pour Speech et 11 lex&#232;mes pour Love alors
que les phrases comportent respectivement 24 et 20 mots, en moyenne. Repr&#233;senter les phrases
par leurs lex&#232;mes permet ainsi de r&#233;duire le nombre d&#8217;attributs qui leur est associ&#233;. Nous pou-
vons &#233;galement constater que peu de r&#233;seaux phrastiques ont &#233;t&#233; cr&#233;&#233;s : deux pour chaque texte.
</p>
<p>FIGURE 4: Visualisation d&#8217;une CoHoP du texte Love, avec CoHoP Miner
</p>
<p>261</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 5: Extrait de la visualisation d&#8217;une CoHoSS du texte Love
</p>
<p>De plus, l&#8217;hypotexte de chacun des textes (constitu&#233; ainsi des deux r&#233;seaux phrastiques) est de
taille importante puisqu&#8217;il contient plus de 75 % des phrases. Cela sugg&#232;re une forte coh&#233;sion
lexicale &#224; l&#8217;int&#233;rieur des textes (chaque phrase de l&#8217;hypotexte est en moyenne appari&#233;e avec 13
phrases pour Speech et 30 phrases pour Love).
</p>
<p>5.2.2 R&#233;sultats quantitatifs sur les CoHoSS extraites
</p>
<p>La table 3 donne le nombre de CoHoSS extraites pour chaque texte, pour diff&#233;rentes valeurs de
k, &#945; et &#947;. Par exemple, avec (k = 3,&#945; = 2,&#947; = 2), 523 CoHoSS sont extraites pour le texte Love
(voir la ligne 2 de la table 3a).
</p>
<p>Une premi&#232;re s&#233;rie d&#8217;exp&#233;riences a &#233;t&#233; men&#233;e en fixant &#947; = 2 : cela signifie que l&#8217;on fixe
le nombre de sous-r&#233;seaux phrastiques contenus dans une CoHoSS &#224; au minimum deux. La
table 3a donne le nombre de CoHoSS extraites avec ce param&#233;trage de &#947; et en faisant varier
&#945; et k. Nous observons que quelle que soit la valeur de k, le fait d&#8217;augmenter la valeur de &#945;
(c&#8217;est-&#224;-dire le nombre d&#8217;attributs communs aux phrases) implique logiquement une diminution
significative du nombre de CoHoSS (environ 50 % en faisant varier &#945; de 1 &#224; 2). Plus particuli&#232;-
rement, nous remarquons qu&#8217;aucune CoHoSS n&#8217;est extraite pour une valeur &#945; &#8805; 3. Cela signifie
que les CoHoSS sont extraites &#224; partir d&#8217;un ou deux attributs (ici, les lemmes des lex&#232;mes des
phrases).
</p>
<p>Une autre s&#233;rie d&#8217;exp&#233;riences a &#233;t&#233; men&#233;e en fixant cette fois &#945; = 2 : cela signifie que l&#8217;on fixe le
nombre d&#8217;attributs &#224; au minimum deux. La table 3b donne alors le nombre de CoHoSS extraites
avec ce param&#233;tragede &#945; et en faisant varier &#947; et k. Nous constatons qu&#8217;augmenter la valeur de &#947;
</p>
<p>Texte Nb. Nb. total Nb. lex&#232;mes Nb. Nb. Nb. r&#233;seaux % phrases
mots lex&#232;mes diff&#233;rents phrases appariements phrastiques dans hypotexte
</p>
<p>Speech 127 563 59657 4728 5308 50277 2 75,6%
Love 112 325 53035 6919 5571 131 497 2 79,0%
</p>
<p>TABLE 2: R&#233;sultats quantitatifs sur les hypotextes
</p>
<p>262</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Texte k &#945;
1 2 3
</p>
<p>2 1 010 555 0
Love 3 924 523 0
</p>
<p>4 729 403 0
2 1 420 793 0
</p>
<p>Speech 3 973 523 0
4 678 384 0
</p>
<p>(a) &#947;= 2
</p>
<p>Texte k &#947;
1 2 3 4 5
</p>
<p>2 38 061 555 15 0 0
Love 3 16 437 523 41 9 1
</p>
<p>4 8 425 403 51 13 4
2 39 442 793 25 2 0
</p>
<p>Speech 3 13 673 523 84 17 2
4 5 552 384 75 24 2
</p>
<p>(b) &#945;= 2
</p>
<p>TABLE 3: Nombre de CoHoSS extraites en fixant la valeur (a) de &#947; et (b) de &#945;
</p>
<p>(c&#8217;est-&#224;-dire le nombre de sous-r&#233;seaux phrastiques contenus dans une CoHoSS) diminue moins
rapidement le nombre de CoHoSS extraites pour des valeurs &#233;lev&#233;es de k. En effet, comme
pr&#233;sent&#233; dans la section 3, augmenter la valeur de k permet d&#8217;obtenir des sous-r&#233;seaux avec
un degr&#233; de coh&#233;sion plus &#233;lev&#233;. Cela s&#8217;accompagne d&#8217;un nombre plus &#233;lev&#233; de sous-r&#233;seaux
dans les CoHoSS et donc d&#8217;une valeur plus &#233;lev&#233;e pour &#947;. Ainsi, en fixant les valeurs de &#945; et &#947;,
le nombre de sous-r&#233;seaux dans les CoHoSS extraites sera g&#233;n&#233;ralement plus &#233;lev&#233; lorsque la
valeur de k est &#233;galement &#233;lev&#233;e.
</p>
<p>D&#8217;une mani&#232;re g&#233;n&#233;rale, nous pouvons observer que le nombre de CoHoSS extraites diminue
lorsque les valeurs de k, &#945; et &#947; augmentent. En conclusion, la valeur de k doit &#234;tre choisie de
mani&#232;re judicieuse en fonction du degr&#233; de coh&#233;sion lexicale souhait&#233;e pour les sous-r&#233;seaux
phrastiques contenus dans les CoHoSS extraites. La valeur de &#947;, quant &#224; elle, permet de limiter
le nombre total de CoHoSS extraites, en ne choisissant que les plus grosses en termes de nombre
de sous-r&#233;seaux phrastiques qu&#8217;elles contiennent. Enfin, la valeur de &#945; joue un r&#244;le important
lorsque l&#8217;on souhaite focaliser l&#8217;analyse linguistique sur les relations entre les phrases partageant
un certain nombre d&#8217;unit&#233;s lexicales.
</p>
<p>5.2.3 Exemple de CoHoSS extraite et interpr&#233;tation linguistique
</p>
<p>Nous pr&#233;sentons maintenant un exemple de CoHoSS. La figure 6 illustre la CoHoP extraite &#224;
l&#8217;aide de CoHoP Miner, sur le texte Speech, et la figure 7 donne les phrases correspondantes.
</p>
<p>KPC1
</p>
<p>KPC2
</p>
<p>FIGURE 6: CoHoP correspondant &#224; la CoHoSS extraite &#224; partir de {adaptation} (k = 3)
</p>
<p>La CoHoSS a &#233;t&#233; extraite &#224; partir de l&#8217;attribut adaptation, en utilisant les valeurs suivantes pour
</p>
<p>263</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>[54] I take the standpoint of an evolutionary1 biologist who, according to Mayr ( 1982), &quot;studies the forces that bring about
changes in faunas and floras ... [and] studies the steps by which have evolved2 the miraculous adaptations3 so characteristic
of every aspect of the organic world&quot; ( pp.69 &#8211; 70).
[251] An important connotation of the tinkering metaphor, for Jacob, is that adaptations3 exploit whatever is available in
order to respond successfully to selection pressures, whether or not4 they originally evolved2 for the use they&#8217;re now put to.
[295] &quot;language5 cannot be as novel as it seems, for evolutionary1 adaptation3 does not4 evolve2 out of the blue&quot; ( p.7).
[824] Indeed, the same claim about the genes could be made for organisms without language5 and culture, because the
evolutionary1 process involves2 adaptation3 to a particular niche.
[2196] &quot;language5 cannot be as novel as it seems, for evolutionary1 adaptations3 do not4 evolve2 out of the blue&quot; ( Bickerton,
1990, p.7).
</p>
<p>[687] In my view15, speech1 is an adaptation2 that made the rich message-sending capacity3 of spoken language4 possible.
[3242] The most prevalent view15 of the origin5 of the hand16 &#8211; mouth relationship in the latter part of the last century
was that the adaptation2 in tool use which occurred in Homo6 habilis7 about 2 million years ago led to a left-hemispheric8
specialization for manual &quot; praxis &quot; ( basically motor skill) and that the first language4 was a gestural language4 built on this
basis.
[3271] This led to the conclusion14 that the origin5 of the human left-hemispheric8 praxic specialization, commonly thought
to be a basis for the left-hemisphere9 speech1 capacity3, cannot be attributed to the tool-use adaptation2 in Homo6 habilis7
( MacNeilage, in press).
[3431] One implication of the origin5 of a left-hemisphere9 routine-action-control specialization10 in early vertebrates is
that this already-existing left-hemisphere9 action specialization10 may have been put to use in the form of the right-side
dominance associated with the clinging and leaping motor adaptation2 characteristic of everyday early prosimian13 life.
[3434] If so, then the left-hemisphere9 action-control capacity3 favoring right-sided postural11 support may have triggered
the asymmetric reaching adaptation2 favoring the hand16 on the side less dominant for postural support &#8211; the left hand16 &#8211; be-
fore the manual-predation specialization10 in vertical clingers and leapers, and its accompanying ballistic reaching capacity3,
evolved12 .
[5204] As evidence for the highly specialized nature of this emergent adaptation2 , he cites the conclusion14 of the postural11
origins5 theory that left-hand16 preferences for prehension evolved12 in prosimians13 ( see Chapter 10).
</p>
<p>FIGURE 7: Phrases correspondant &#224; la CoHoP de la figure 6
</p>
<p>les param&#232;tres de fouille : k = 3,&#945; = 1,&#947; = 2. Cette CoHoSS est constitu&#233;e de deux sous-
r&#233;seaux phrastiques. Le premier r&#233;seau (contenant les phrases 54, 251, 295, 824 et 2196) traite
du th&#232;me g&#233;n&#233;ral de la CoHoSS : le ph&#233;nom&#232;ne d&#8217;adaptation. Nous pouvons remarquer que ce
r&#233;seau est relativement coh&#233;rent alors qu&#8217;il parcourt un ensemble consid&#233;rable du texte (cor-
respondant &#224; un empan de plus de 2000 phrases). Le second r&#233;seau, quant &#224; lui, d&#233;veloppe
une th&#233;matique plus sp&#233;cifique de l&#8217;adaptation : la sp&#233;cialisation de l&#8217;h&#233;misph&#232;re gauche. Ce
sous-r&#233;seau commence avec la phrase 687 qui est connect&#233;e au sous-r&#233;seau pr&#233;c&#233;dent par la
phrase 824. Nous pouvons &#233;galement constater que les deux sous-r&#233;seaux se &#171; chevauchent &#187; au
niveau du texte puisque la phrase 687 appartient au second sous-r&#233;seau alors que les phrases
824 et 2196 appartiennent au premier. De plus, nous pouvons remarquer que l&#8217;empan de la
CoHoSS (mais aussi de chacun des sous-r&#233;seaux) est relativement important puisqu&#8217;elle com-
mence &#224; la phrase 54 et qu&#8217;elle se termine &#224; la phrase 5204. Ainsi, cette propri&#233;t&#233; int&#233;ressante
de non-contigu&#239;t&#233; des phrases des r&#233;seaux phrastiques se retrouve &#233;galement au niveau des
sous-r&#233;seaux phrastiques constituant les CoHoSS extraites.
</p>
<p>6 Conclusion
</p>
<p>Dans cet article, nous avons propos&#233; une approche pour explorer des textes de taille cons&#233;-
quente en se focalisant sur des sous-parties coh&#233;rentes. Cette m&#233;thode d&#8217;exploration s&#8217;appuie
sur une repr&#233;sentation du texte &#224; l&#8217;aide d&#8217;un graphe, en utilisant le mod&#232;le linguistique de Hoey
</p>
<p>264</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pour s&#233;lectionner et apparier les phrases conserv&#233;es dans le graphe. Notre contribution porte
sur l&#8217;utilisation de techniques issues de la fouille de graphes pour extraire des sous-parties du
texte coh&#233;rentes d&#8217;un point de vue lexical (c&#8217;est-&#224;-dire des collections de sous-r&#233;seaux phras-
tiques homog&#232;nes) dont la taille permet &#224; un linguistique de les analyser. Nous avons r&#233;alis&#233;
des exp&#233;rimentations sur deux textes anglais de la taille d&#8217;un livre pour valider cette approche.
Cela nous a permis de montrer que le graphe g&#233;n&#233;r&#233; &#224; l&#8217;aide du mod&#232;le de Hoey &#233;tait diffici-
lement exploitable par un humain &#224; cause du trop grand nombre de sommets et d&#8217;ar&#234;tes. En
utilisant notre approche pour s&#233;lectionner des sous-parties pertinentes du graphe, il est alors
possible d&#8217;appliquer le mod&#232;le de Hoey sur de grands textes. De plus, les diff&#233;rents param&#232;tres
utilis&#233;s lors du processus de fouille du graphe offrent la possibilit&#233; de d&#233;finir le niveau de gra-
nularit&#233; des collections de sous-r&#233;seaux phrastiques homog&#232;nes extraites. D&#8217;un point de vue
linguistique, cela signifie que le degr&#233; de coh&#233;sion lexicale entre les phrases des sous-r&#233;seaux
phrastiques extraits est mis en &#233;vidence.
</p>
<p>Remerciements
</p>
<p>Les auteurs tiennent &#224; remercier chaleureusement Pierre-Nicolas Mougel et Christophe Rigotti
(LIRIS, Lyon) pour la mise &#224; disposition de CoHoP Miner.
</p>
<p>Ce travail b&#233;n&#233;ficie du soutien de la r&#233;gion Basse-Normandie et de l&#8217;ANR (projet Hybride
ANR-11-BS02-002).
</p>
<p>R&#233;f&#233;rences
</p>
<p>BEN-ZE&#8217;EV, A. (2004). Love Online : Emotions on the Internet. Cambridge University Press.
</p>
<p>DERENYI, I., PALLA, G. et VICSEK, T. (2005). Clique percolation in random networks. Physical
Review Letters, 94:160&#8211;202.
</p>
<p>DON, A., ZHELEVA, E., GREGORY, M., TARKAN, S., AUVIL, L., CLEMENT, T., SHNEIDERMAN, B. et
PLAISANT, C. (2007). Discovering interesting usage patterns in text collections : integrating text
mining with visualization. In Proc. of the Conference on Information and Knowledge Management,
pages 213&#8211;222.
</p>
<p>FEKETE, J. et DUFOURNAUD, N. (2000). Compus : visualization and analysis of structured do-
cuments for understanding social life in the 16th century. In Proc. of the ACM Conference on
Digital Libraries, pages 47&#8211;55.
</p>
<p>GE, R., ESTER, M., GAO, B., HU, Z., BHATTACHARYA, B. et BEN-MOSHE, B. (2008). Joint cluster
analysis of attribute data and relationship data. ACM Transactions on Knowledge Discovering
Data, 2(2):1&#8211;35.
</p>
<p>HOEY, M. (1991). Patterns of Lexis in Text. Describing English Language. Oxford University
Press.
</p>
<p>HOEY, M. (1997). Language and the subject. In SIMMS, K., &#233;diteur : Critical Studies, chapitre The
discourse&#8217;s disappearing (and reappaering) subject : an exploration of the extent of Intertextual
interference in the production of texts, pages 245&#8211;264. Rodopi.
</p>
<p>265</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>K&#193;ROLY, S. et FRANCIS, G. (2000). Pattern Grammar, a corpus-driven approach to the lexical
grammar of English. John Benjamins.
</p>
<p>KNIGHT, K. et MARCU, D. (2000). Statistics-Based Summarization &#8212; Step One : Sentence Com-
pression. In Proc. of the National Conference of the American Association for Artificial Intelligence,
pages 703&#8211;710.
</p>
<p>LEGALLOIS, D. (2006). Des phrases entre elles &#224; l&#8217;unit&#233; r&#233;ticulaire du texte. Langages, 164:56&#8211;
70.
</p>
<p>LEGALLOIS, D., CELLIER, P. et CHARNOIS, T. (2011). Calcul de r&#233;seaux phrastiques pour l&#8217;analyse
et la navigation textuelle. In Actes de la Conf&#233;rence sur le Traitement Automatique des Langues
Naturelles.
</p>
<p>LIN, C.-Y. et HOVY, E. (2002). From single to multi-document summarization. In Proc. of the
Annual Meeting of the Association for Computational Linguistics, pages 457&#8211;464.
</p>
<p>MACNEILAGE, P. (2008). The Origin of Speech. UOP Oxford.
</p>
<p>MOUGEL, P.-N., RIGOTTI, C. et GANDRILLON, O. (2012). Finding collections of k-clique percolated
components in attributed graphs. In Proc. of the Pacific-Asia Conference on Knowledge Discovery
and Data Mining. &#192; para&#238;tre.
</p>
<p>MUSIAL, K. et JUSZCZYSZYN, K. (2009). Properties of bridge nodes in social networks. In Proc.
of the International Conference on Computational Collective Intelligence, pages 357&#8211;364.
</p>
<p>NEWMAN, D., BALDWIN, T., CAVEDON, L., HUANG, E., KARIMI, S., MART&#205;NEZ, D., SCHOLER, F. et
ZOBEL, J. (2010). Visualizing search results and document collections using topic maps. Web
Semantics Science Services and Agents on the World Wide Web, 8(2-3):169&#8211;175.
</p>
<p>PLAISANT, C., ROSE, J., YU, B., AUVIL, L., KIRSCHENBAUM, M., SMITH, M., CLEMENT, T. et LORD,
G. (2006). Exploring erotics in emily dickinson&#8221;s correspondence with text mining and visual
interfaces. In Proc. of the ACM/IEEE-CS Joint Conference on Digital Libraries, pages 141&#8211;150.
</p>
<p>RENOUF, A. et KEHOE, A. (2004). Textual distraction as a basis for evaluating automatic sum-
marisers. In Proc. of the International Conference on Language Resources and Evaluation.
</p>
<p>SARDINHA, T. B. (1999). Looking at discourse in a corpus : The role of lexical cohesion. In Proc.
of the World Congress of Applied Linguistics.
</p>
<p>SCHMID, H. (1994). Probabilistic part-of-speech tagging using decision trees. In Proc. of the
International Conference on Knowledge Discovery and Data Mining.
</p>
<p>TONG, H., GALLAGHER, B., FALOUTSOS, C. et ELIASSI-RAD, T. (2007). Fast best-effort pattern
matching in large attributed graphs. In Proc. of the International Conference on Knowledge
Discovery and Data Mining.
</p>
<p>WASHIO, T. et MOTODA, H. (2003). State of the art of graph-based data mining. SIGKDD
Explorations, 5(1):59&#8211;68.
</p>
<p>ZHOU, Y., CHENG, H. et YU, J. (2010). Clustering large attributed graphs : An efficient incre-
mental approach. In Proc. of the International Conference on Data Mining, pages 689&#8211;698.
</p>
<p>266</p>

</div></div>
</body></html>