<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Utilisation de la translitt&#233;ration arabe pour l&#8217;am&#233;lioration de l&#8217;alignement de mots &#224; partir de corpus parall&#232;les fran&#231;ais-arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 127&#8211;140,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Utilisation de la translitt&#233;ration arabe pour 
l&#8217;am&#233;lioration de l&#8217;alignement de mots &#224; partir de corpus 
</p>
<p>parall&#232;les fran&#231;ais-arabe 
 
</p>
<p>Houda Saadane1 Nasredine Semmar2 
(1) LIDILEM, Universit&#233; de Grenoble, 38400 Grenoble Cedex 9 
</p>
<p>(2) CEA, LIST, Laboratoire Vision et Ing&#233;nierie des Contenus, 91191 Gif-sur-Yvette Cedex 
houda.saadane@e.u-grenoble3.fr, nasredine.semmar@cea.fr 
</p>
<p>RESUME ____________________________________________________________________________________________________________  
</p>
<p>Dans cet article, nous nous int&#233;ressons &#224; l&#8217;utilisation de la translitt&#233;ration arabe pour 
l&#8217;am&#233;lioration des r&#233;sultats d&#8217;une approche linguistique d&#8217;alignement de mots simples et 
compos&#233;s &#224; partir de corpus de textes parall&#232;les fran&#231;ais-arabe. Cette approche utilise, 
d&#8217;une part, un lexique bilingue et les caract&#233;ristiques linguistiques des entit&#233;s nomm&#233;es 
et des cognats pour l&#8217;alignement de mots simples, et d&#8217;autre part, les relations de 
d&#233;pendance syntaxique pour aligner les mots compos&#233;s. Nous avons &#233;valu&#233; l&#8217;aligneur de 
mots simples et compos&#233;s int&#233;grant la translitt&#233;ration arabe en utilisant deux proc&#233;d&#233;s : 
une &#233;valuation de la qualit&#233; d&#8217;alignement &#224; l&#8217;aide d&#8217;un alignement de r&#233;f&#233;rence construit 
manuellement et une &#233;valuation de l&#8217;impact de cet alignement sur la qualit&#233; de la 
traduction en faisant appel au syst&#232;me de traduction automatique statistique Moses. Les 
r&#233;sultats obtenus montrent que la translitt&#233;ration am&#233;liore aussi bien la qualit&#233; de 
l&#8217;alignement que celle de la traduction. 
</p>
<p>ABSTRACT _________________________________________________________________________________________________________  
</p>
<p>Using Arabic transliteration to improve word alignment from French-Arabic 
parallel corpora 
</p>
<p>In this paper, we focus on the use of Arabic transliteration to improve the results of a 
linguistic word alignment approach from parallel text corpora. This approach uses, on 
the one hand, a bilingual lexicon, named entity and cognates linguistic properties to 
align single words, and on the other hand, syntactic dependency relations to align 
compound words. We have evaluated the word aligner integrating Arabic transliteration 
using two methods: A manual evaluation of the alignment quality and an evaluation of 
the impact of this alignment on the translation quality by using the statistical machine 
translation system Moses. The obtained results show that Arabic transliteration improves 
the quality of both alignment and translation. 
</p>
<p>MOTS-CLES : Translitt&#233;ration, alignement de mots, construction de dictionnaires 
multilingues, traduction automatique, recherche d&#8217;information interlingue. 
KEYWORDS : Transliteration, word alignment, multilingual lexicons construction, machine 
translation, cross-language information retrieval. 
</p>
<p>1 Introduction 
</p>
<p>La translitt&#233;ration consiste &#224; substituer &#224; chaque graph&#232;me un syst&#232;me d&#8217;&#233;criture, un 
autre graph&#232;me ou un groupe de graph&#232;mes d&#8217;un autre syst&#232;me d&#8217;&#233;criture, 
</p>
<p>127</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ind&#233;pendamment de la prononciation. 
</p>
<p>La translitt&#233;ration connait un essor important en raison du caract&#232;re de plus en plus 
multilingue de l&#8217;Internet et des besoins exponentiels dans le domaine de la recherche 
d&#8217;information interlingue. Cela est d&#8217;autant plus vrai pour la recherche d&#8217;entit&#233;s 
nomm&#233;es (noms de personnes, de lieux, de soci&#233;t&#233;s, d&#8217;organisations, etc.), mais ces 
derni&#232;res pr&#233;sentent une pluralit&#233; de formes &#233;crites, d&#8217;orthographes et de transcriptions 
selon les langues et les pays. Le cas des noms propres en arabe illustre cette situation 
complexe et multiforme. Le meilleur exemple pour montrer cette pluralit&#233; est le nom &#1;&#2;&#3;&#4; 
&#5;&#6;&#1575;&#8;&#9;&#10;&#1575; (Mouammar Kadhafi) qui est transcrit en latin par plus de 60 formes, parmi 
lesquelles : Muammar Qaddafi, Mo'ammar Gadhafi, Muammer Kaddafi, Moammar El 
Kadhafi, etc. 
</p>
<p>Cet article d&#233;crit un syst&#232;me de translitt&#233;ration automatique de noms arabes en &#233;criture 
latine et montre une utilisation concr&#232;te de la translitt&#233;ration arabe en alignement de 
mots &#224; partir de corpus de textes parall&#232;les dans le but d&#8217;am&#233;liorer la qualit&#233; des lexiques 
bilingues ainsi construits. 
</p>
<p>Nous pr&#233;sentons dans la section 2 un r&#233;sum&#233; de l&#8217;&#233;tat de l&#8217;art dans le domaine de la 
translitt&#233;ration. Dans la section 3, nous d&#233;crivons les approches que nous avons utilis&#233;es 
pour d&#233;velopper notre syst&#232;me de translitt&#233;ration automatique des noms arabes voyell&#233;s 
et non voyell&#233;s vers les diff&#233;rentes transcriptions possibles en &#233;criture latine. Nous 
montrons dans la section 4 comment cette translitt&#233;ration est utilis&#233;e pour am&#233;liorer les 
r&#233;sultats d&#8217;un outil d&#8217;alignement de mots. Nous pr&#233;sentons en section 5 les r&#233;sultats que 
nous avons obtenus en pr&#233;cisant les taux d&#8217;am&#233;lioration de la qualit&#233; de l&#8217;alignement et 
de la traduction. La section 6 conclut notre &#233;tude et pr&#233;sente nos travaux futurs. 
</p>
<p>2 &#201;tat de l&#8217;art 
</p>
<p>Le probl&#232;me de la translitt&#233;ration a int&#233;ress&#233; les sp&#233;cialistes dans plusieurs langues, mais 
cet int&#233;r&#234;t est relativement r&#233;cent et li&#233; au d&#233;veloppement croissant de l&#8217;utilisation de 
l&#8217;Internet. De nombreux travaux ont &#233;t&#233; r&#233;alis&#233;s pour aligner automatiquement les 
translitt&#233;rations &#224; partir de corpus de textes multilingues en vue de l&#8217;enrichissement de 
lexiques bilingues indispensables pour la recherche d&#8217;information interlingue et la 
traduction automatique. Citons notamment (Yaser et Knight, 2002) et (Sherif et Kondrak, 
2007), qui ont travaill&#233; sur l&#8217;alignement arabe-anglais, (Tao et al., 2006) qui ont travaill&#233; 
sur l&#8217;arabe, le chinois et l&#8217;anglais ainsi que (Shao et Ng, 2004) qui utilisent l&#8217;information 
apport&#233;e par les translitt&#233;rations sur la base de leur prononciation. Ils combinent 
l&#8217;information apport&#233;e par le contexte des traductions avec l&#8217;information apport&#233;e par les 
translitt&#233;rations entre l&#8217;anglais et le chinois. L&#8217;int&#233;r&#234;t de ce travail r&#233;side dans le fait qu&#8217;il 
permet l&#8217;alignement de mots tr&#232;s sp&#233;cifiques mais rares. 
</p>
<p>On trouve ainsi des propositions de syst&#232;mes visant &#224; attribuer une seule translitt&#233;ration 
&#224; un nom donn&#233; : c&#8217;est le cas du mod&#232;le g&#233;n&#233;ratif propos&#233; pour les noms d&#8217;origine 
anglaise &#233;crits en japonais (Katakana) vers le syst&#232;me d&#8217;&#233;criture latin (Knight et Graehl, 
1997). 
</p>
<p>Cette approche a &#233;t&#233; adapt&#233;e par (Stalls et Knight, 1998) &#224; la fa&#231;on dont un nom anglais 
&#233;crit en arabe est transcrit en anglais. Le syst&#232;me de g&#233;n&#233;ration de translitt&#233;rations 
</p>
<p>128</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>s&#8217;appuie sur un dictionnaire d&#8217;apprentissage et ne prend pas en compte les 
prononciations non r&#233;pertori&#233;es ou inconnues du dictionnaire. 
</p>
<p>Cela a conduit certains chercheurs &#224; pallier cette carence par un recours &#224; la technique 
statistique. C&#8217;est le cas du syst&#232;me de translitt&#233;ration des noms anglais vers l&#8217;arabe 
propos&#233; par (Abduljaleel et Larkey, 2003). Mais celui-ci a montr&#233; &#233;galement ses limites 
parce qu&#8217;il est bas&#233; sur le calcul de la forme la plus probable, cens&#233;e &#234;tre la forme 
correcte, ce qui n&#8217;est pas vrai pour tous les pays arabes ni pour tous les dialectes. 
</p>
<p>Pour contourner la difficult&#233; de la prononciation et le probl&#232;me des variantes dialectales, 
(Alghamdi, 2005) a propos&#233; un syst&#232;me de translitt&#233;ration en &#233;criture anglaise des noms 
arabes voyell&#233;s. Ce syst&#232;me est bas&#233; sur un dictionnaire de noms arabes dans lequel la 
prononciation est r&#233;gl&#233;e au moyen de voyelles ajout&#233;es aux noms r&#233;pertori&#233;s, avec 
indication en vis &#224; vis de leur &#233;quivalent en &#233;criture anglaise. Mais cette approche 
cumule les inconv&#233;nients des deux pr&#233;c&#233;dentes : non seulement elle ne prend pas en 
compte les prononciations non r&#233;pertori&#233;es dans le dictionnaire, mais en plus elle est 
normative par le fait qu&#8217;elle ne propose qu&#8217;une seule translitt&#233;ration pour un nom donn&#233;. 
L&#8217;objectif de l&#8217;auteur semblerait &#234;tre de favoriser l&#8217;adoption d&#8217;un standard de 
translitt&#233;ration, mais cela ne peut &#234;tre le r&#233;sultat d&#8217;une initiative individuelle et isol&#233;e. 
</p>
<p>En r&#233;alit&#233;, l&#8217;&#233;tat actuel de la recherche dans ce domaine ne rend pas compte de la 
complexit&#233; du probl&#232;me de la transcription et de la translitt&#233;ration, lequel touche autant 
&#224; l&#8217;oralit&#233; qu&#8217;&#224; la scripturalit&#233; dans deux ou plusieurs syst&#232;mes linguistiques en m&#234;me 
temps. En effet, transcrire un nom ou un pr&#233;nom d&#8217;un syst&#232;me linguistique source vers 
un syst&#232;me d&#8217;&#233;criture cible, est une t&#226;che d&#233;licate qui n&#233;cessite un certain nombre 
d&#8217;op&#233;rations exigeant de prendre en consid&#233;ration un ensemble de propri&#233;t&#233;s 
morphologiques, phonologiques et s&#233;mantiques. Ces op&#233;rations sont n&#233;cessaires pour 
assurer un processus de translitt&#233;ration robuste, notamment pour des applications de 
s&#233;curit&#233;, de v&#233;rification d&#8217;identit&#233;, ou encore de recherche d&#8217;informations sur Internet. 
</p>
<p>Or, tr&#232;s peu d&#8217;&#233;tudes prennent en consid&#233;ration le lien : 
</p>
<p>&#8211; entre phonologie compar&#233;e et transcription interlingue; 
&#8211; entre graph&#233;matique compar&#233;e et translitt&#233;ration multilingue; 
&#8211; entre dialectologie arabe et syst&#232;mes de translitt&#233;ration latins. 
</p>
<p>Les rares &#233;tudes qui proposent une solution prenant en compte partiellement l&#8217;une de ces 
probl&#233;matiques, sont d&#233;di&#233;es &#224; l&#8217;identification automatique de l&#8217;origine du locuteur &#224; 
partir de son dialecte. C&#8217;est le cas notamment des travaux de (Guid&#232;re, 2004) et de 
(Barkat-Defradas et al., 2004). 
</p>
<p>3 Translitt&#233;ration en caract&#232;res latins des noms &#233;crits en arabe 
standard 
</p>
<p>Le syst&#232;me d&#8217;&#233;criture de la langue arabe standard est constitu&#233; d&#8217;un alphabet de 28 
lettres, dont 25 consonnes et 3 voyelles, celles-ci pouvant &#234;tre courtes ou longues en 
fonction du mot. 
</p>
<p>Il existe &#233;galement des ph&#233;nom&#232;nes morphologiques et phonologiques particuliers dont 
il faut tenir compte dans la translitt&#233;ration tels que le d&#233;doublement des consonnes, 
</p>
<p>129</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>parfois mat&#233;rialis&#233; dans l&#8217;&#233;criture arabe par la &#171;shadda&#187;, et le redoublement des voyelles, 
parfois mat&#233;rialis&#233; dans l&#8217;&#233;criture arabe par le &#171;tanwin&#187;. Mais l&#8217;&#233;criture arabe moderne 
pr&#233;sente la particularit&#233; de ne pas marquer dans les textes &#8211;de mani&#232;re g&#233;n&#233;rale&#8211; ni le 
d&#233;doublement ni les voyelles courtes, ce qui constitue l&#8217;une des principales sources 
d&#8217;ambigu&#239;t&#233; pour les syst&#232;mes de translitt&#233;ration. 
</p>
<p>3.1 M&#233;thodologie de construction du translitt&#233;rateur 
</p>
<p>Nous avons choisi une m&#233;thodologie ascendante pour la construction de notre 
translitt&#233;rateur. En d&#8217;autres termes, nous avons commenc&#233; par faire un recensement des 
translitt&#233;rations existantes pour chaque lettre de l&#8217;alphabet arabe standard &#224; partir des 
normes et des usages observ&#233;s sur Internet. Cette investigation empirique est bas&#233;e sur 
un corpus de textes qui a &#233;t&#233; recueilli dans les diff&#233;rentes langues cibles vis&#233;es par le 
translitt&#233;rateur. Elle a permis de constituer une librairie des &#233;quivalents graph&#233;matiques 
actuellement en usage dans les &#233;crits utilisant l&#8217;alphabet latin. 
</p>
<p>Nous faisons figurer dans le tableau suivant quelques &#233;quivalences graph&#233;matiques 
&#233;tablies &#224; partir de cette &#233;tude sur corpus : 
</p>
<p>Lettre arabe &#201;quivalent en &#233;criture 
latine 
</p>
<p>Lettre arabe &#201;quivalent en 
&#233;criture latine 
</p>
<p>&#1569; a &#1594; Gh, gh, &#286;, &#287;, &#7713; 
</p>
<p>&#1575; A, a, &#228;, &#226;, &#225;, &#257;, e, &#234; 
&#1601; F, f, ph 
</p>
<p>&#1576; B, b 
&#1602; Q, q, C, c, K, k 
</p>
<p>&#1578; T, t 
&#1603; K, k, C, c 
</p>
<p>&#1579; Th, th, t, &#7791; 
&#1604; L, l 
</p>
<p>TABLE 1 &#8211; Exemples d&#8217;&#233;quivalences graph&#233;matiques entre les alphabets arabe et latin 
</p>
<p>L&#8217;&#233;tude sur corpus a &#233;galement permis de constater que certaines lettres arabes, sans 
&#233;quivalent graph&#233;matique dans l&#8217;&#233;criture latine, &#233;taient transcrites par le biais de chiffres 
arabes dans les textes &#233;crits en caract&#232;res latins. Ce type de translitt&#233;ration est 
particuli&#232;rement utilis&#233; dans les messages t&#233;l&#233;phoniques (SMS) et dans les sites web 
sociaux en Europe et au Moyen Orient. Le tableau suivant r&#233;capitule ces &#233;quivalences 
alphanum&#233;riques pour les lettres concern&#233;es de l&#8217;alphabet arabe : 
</p>
<p>Lettre &#1569; &#1581; &#1582; &#1589; &#1590; &#1591; &#1592; &#1593; &#1594; &#1602; 
</p>
<p>&#201;quivalence alphanum&#233;rique 2 7 7' 9 9' 6 6' 3 3' 8 
</p>
<p>TABLE 2 &#8211; &#201;quivalences alphanum&#233;riques dans les textes &#233;crits en alphabet latin 
</p>
<p>130</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ainsi, en combinant ces deux types de repr&#233;sentation symbolique, on peut rencontrer 
dans les textes des translitt&#233;rations qui illustrent ces diff&#233;rentes &#233;quivalences pour des 
noms et des pr&#233;noms courants dans le monde arabe : 
</p>
<p>Nom en arabe &#27;&#28;&#4; &#1606;&#30;&#31; ! &#1606;&#30;&#28;&quot; &#1602;&#1585;&#30;$ 
</p>
<p>Exemple d&#8217;&#233;quivalents 
en &#233;criture latine 
</p>
<p>Mouna ou 
Mona... 
</p>
<p>Adnane ou 
3adnan... 
</p>
<p>Hanane ou 
7anan... 
</p>
<p>Tarek ou 
6ariq... 
</p>
<p>TABLE 3 &#8211; Exemples de noms et pr&#233;noms arabes 
</p>
<p>Cette variation dans les usages translitt&#233;rationnels, source d&#8217;ambigu&#239;t&#233; lors du traitement 
automatique et de la recherche d&#8217;information, s&#8217;explique par trois types de raisons : 
</p>
<p>Tout d&#8217;abord, des raisons historiques puisque certains pays arabes ont &#233;t&#233; colonis&#233;s ou 
plac&#233;s sous mandat fran&#231;ais ou britannique pendant une p&#233;riode plus ou moins longue 
selon les pays et ont, par cons&#233;quent, gard&#233; de cette p&#233;riode des traces dans leur 
vocabulaire, dans leur prononciation et dans la mani&#232;re dont ils ont tendance &#224; 
translitt&#233;rer les noms et les pr&#233;noms. Ainsi, l&#8217;influence du syst&#232;me linguistique et 
graph&#233;matique du fran&#231;ais est perceptible dans les usages translitt&#233;rationnels des pays 
du Maghreb, de mani&#232;re plus ou moins forte selon les pays. Il en est de m&#234;me des pays 
du Proche et du Moyen-Orient par rapport &#224; l&#8217;influence britannique ou am&#233;ricaine. 
</p>
<p>Ensuite, pour des raisons politiques puisqu&#8217;il n&#8217;existe pas de norme commune ni de 
strat&#233;gie unifi&#233;e dans le domaine de la translitt&#233;ration pour ce qui est de la langue arabe. 
Cela a conduit chaque &#233;crivain ou scripteur &#224; s&#8217;appuyer sur la prononciation dialectale 
qui lui &#233;tait la plus famili&#232;re pour transcrire les noms arabes. L&#8217;exemple le plus c&#233;l&#232;bre 
est celui de Laurence d&#8217;Arabie qui, pour transcrire le nom de la ville de Djeddah (&#1577; &amp;) en 
Arabie Saoudite, utilise : 25 fois l&#8217;orthographe &#171; Jeddah &#187;, 6 fois l&#8217;orthographe &#171; Jidda &#187;, 
et 1 fois l&#8217;orthographe &#171; Jedda &#187;, et cela dans le m&#234;me ouvrage (1926). Laurence 
d&#8217;Arabie justifie cette variation dans la translitt&#233;ration de la mani&#232;re suivante : &#171; On ne 
peut pas transcrire correctement et de la m&#234;me fa&#231;on un nom arabe &#224; cause des 
consonnes qui diff&#232;rent des consonnes latines et des voyelles dont la prononciation 
diff&#232;re d&#8217;une r&#233;gion &#224; une autre. &#187; (Alsalman et al., 2007). Cela est d&#8217;autant plus vrai que 
les diff&#233;rentes orthographes donn&#233;es par Laurence d&#8217;Arabie diff&#232;rent de l&#8217;usage actuel en 
Arabie Saoudite pour la transcription du nom de cette m&#234;me ville : &#171; Jaddah &#187;. 
</p>
<p>Enfin, pour des raisons dialectologiques puisqu&#8217;il existe une telle vari&#233;t&#233; de parlers 
r&#233;gionaux et locaux dans le monde arabe qu&#8217;il est impossible de retrouver la m&#234;me 
prononciation d&#8217;un pays &#224; l&#8217;autre et d&#8217;une r&#233;gion &#224; l&#8217;autre. Ainsi par exemple, l&#8217;un des 
pr&#233;noms arabes les plus r&#233;pandus, celui du Proph&#232;te Muhammad ( &#2;'&#4;) &#8211; transcrit en 
fran&#231;ais Mahomet depuis l&#8217;&#233;poque moderne &#8211; poss&#232;de une dizaine de prononciations &#8211; et 
donc de transcriptions &#8211; diff&#233;rentes. Citons notamment : Mohamed, Mouhammad, 
Muhamed, Mhamed, M&#8217;Hamed, Muhammad, etc. M&#234;me lorsque ce pr&#233;nom est voyell&#233; 
( &#1618;)&#2;'&#1614;&#4;&#1615;), il pr&#233;sente plusieurs translitt&#233;rations dans les textes : Muhamad, Mouhamad, 
Mohamad, Mehammad, Mehammade. 
</p>
<p>Cette variation dans les translitt&#233;rations possibles selon les dialectes est parfois 
accompagn&#233;e par l&#8217;utilisation de caract&#232;res sp&#233;ciaux dans certaines r&#233;gions ou pays 
</p>
<p>131</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>arabes. Citons comme exemples les noms suivants qui pr&#233;sentent des formes non 
conventionnelles en &#233;criture latine : Mu`ammar, Mabr&#363;k, Mus&#355;af&#225;, Ism&#257;`&#299;l, H&#226;d&#238;. 
</p>
<p>Tous ces ph&#233;nom&#232;nes n&#233;cessitent une observation fine en amont du traitement pour 
identifier les cas probl&#233;matiques et construire des r&#232;gles efficaces permettant 
l&#8217;automatisation du processus de translitt&#233;ration des noms arabes en temps r&#233;el. 
</p>
<p>3.2 Fonctionnement du translitt&#233;rateur de l&#8217;arabe vers le latin 
</p>
<p>Le module de translitt&#233;ration de l&#8217;&#233;criture arabe vers l&#8217;&#233;criture latine est fond&#233; sur les 
automates d&#8217;&#233;tats finis. Cela signifie qu&#8217;il est constitu&#233; d&#8217;&#233;tats et de transitions. Son 
fonctionnement est d&#233;termin&#233; par la nature du mot fourni en entr&#233;e : l&#8217;automate passe 
d&#8217;&#233;tat en &#233;tat suivant les transitions, &#224; la lecture de chaque lettre arabe de l&#8217;entr&#233;e. 
</p>
<p>A l&#8217;issue de la lecture, l&#8217;automate produit une r&#233;ponse  &#171; oui &#187; ou &#171; non &#187;, c&#8217;est-&#224;-dire 
qu&#8217;il accepte (oui) ou rejette (non) l&#8217;entr&#233;e en question : voyell&#233;e ou non-voyell&#233;e. 
Ensuite, il traite l&#8217;entr&#233;e de la mani&#232;re suivante : si voyell&#233;e, il supprime les voyelles 
avant de translitt&#233;rer le nom; si non-voyell&#233;e, il proc&#232;de directement &#224; la translitt&#233;ration 
du nom. Enfin, le module produit en sortie une liste tri&#233;e de noms arabes &#233;crits en 
caract&#232;res latins. 
</p>
<p>Le c&#339;ur du syst&#232;me de translitt&#233;ration est constitu&#233; de r&#232;gles contextuelles. Ces r&#232;gles 
visent &#224; rendre compte de la mani&#232;re la plus pr&#233;cise possible des formes observ&#233;es en 
entr&#233;e : s&#8217;agit-il d&#8217;une &#171; kunya &#187; ? d&#8217;un nom pr&#233;c&#233;d&#233; d&#8217;un article ? ou bien d&#8217;un pr&#233;nom 
seul ? 
</p>
<p>On sait &#224; cet &#233;gard que le nom d&#8217;une personne contient plusieurs &#233;l&#233;ments en arabe. Il 
est constitu&#233; en principe de quatre composants principaux : 
</p>
<p>1. La &#171; Kunya &#187; (particule d&#8217;usage) : g&#233;n&#233;ralement compos&#233;e de &#171; Abou &#187; (p&#232;re 
de&#8230;), suivi du nom d&#8217;un enfant ou bien de &#171; Oum &#187; (m&#232;re de + nom d&#8217;un 
enfant de la famille). Exemple : &#171; Abou Omar &#187; (P&#232;re d&#8217;Omar), &#171;Oum Mohamed&#187; 
(M&#232;re de Mohamed), etc. 
</p>
<p>2. Le &#171; Ism &#187; (Pr&#233;nom) : par exemple, Omar, Ali, Mohamed, Khaled, Abdallah, etc. 
Il indique parfois l&#8217;origine ethnique ou confessionnelle de celui qui le porte : par 
exemple, &#171; Omar &#187; est un pr&#233;nom typiquement sunnite ; &#171; Rustam &#187; est un 
pr&#233;nom typiquement iranien ; &#171; Arslan &#187; est typiquement turc, etc. 
</p>
<p>3. Le &#171; Nasab &#187; (particule g&#233;n&#233;alogique) : chaque nom est pr&#233;c&#233;d&#233; par &#171; Ibn &#187; ou 
&#171;Bin/Ben&#187; (&#171;Bint/Bent&#187; pour les femmes). Il indique la filiation g&#233;n&#233;alogique 
exacte de l&#8217;individu concern&#233;. Les Arabes remontent parfois tr&#232;s loin dans 
l&#8217;indication des anc&#234;tres pour &#233;viter les confusions entre personnes : ex. 
Muhammad Bin Abdallah Bin Salih Bin Said, etc. 
</p>
<p>4. La &#171; Nisba &#187; (suffixe d&#8217;origine) : ce suffixe renvoie en principe &#224; la tribu ou au 
clan dans la g&#233;n&#233;alogie ancienne mais aujourd&#8217;hui, il d&#233;signe surtout le lieu de 
naissance des individus : Maghribi (n&#233; au Maroc), Libi (n&#233; en Libye), Masri (n&#233; 
en &#201;gypte), etc. La &#171; Nisba &#187; est toujours pr&#233;c&#233;d&#233;e de l&#8217;article [Al-] et se termine 
par le suffixe [i]. Elle indique la r&#233;sidence territoriale initiale des personnes, ou 
encore leur nationalit&#233;. 
</p>
<p>Selon la forme d&#8217;entr&#233;e, on applique d&#8217;abord des r&#232;gles ad&#233;quates pour transcrire la 
</p>
<p>132</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>partie qui ne constitue pas le nom &#224;  proprement parler (particules), puis on applique les 
r&#232;gles pour la translitt&#233;ration des noms eux-m&#234;mes. 
</p>
<p>Les r&#232;gles pour la translitt&#233;ration des noms s&#8217;appliquent &#224; leur tour selon le nombre de 
consonnes du nom consid&#233;r&#233;, et dans un ordre de priorit&#233; d&#233;termin&#233;. Par exemple, Si le 
mot est compos&#233; par Abd ( ,!) + Al (&#1604;&#1575;) + Nom (-.&quot;&#1585;), le syst&#232;me proc&#232;de de la mani&#232;re 
suivante : 
</p>
<p>&#8211; Translitt&#233;ration de la particule  ,! &#171; Abd &#187;; 
&#8211; Translitt&#233;ration de l&#8217;article  &#1604;&#1575; &#171; Al &#187;; 
&#8211; Concat&#233;nation de la particule &#171; Abd &#187; et de l&#8217;article &#171; Al &#187; en les reliant au nom 
</p>
<p>par un trait d&#8217;union ou en ins&#233;rant un blanc entre les deux : Abd Al-Rahim (  ,! 
-.&quot;&#1;&#10;&#1575;) ; 
</p>
<p>&#8211; G&#233;n&#233;ration de toutes les formes de translitt&#233;ration possibles pour ces trois 
&#233;l&#233;ments : 
</p>
<p>Nom propre arabe Translitt&#233;rations 
</p>
<p> ,! -.&quot;&#1;&#10;&#1575;  Abd Al-Rahim 
</p>
<p>Abd Al Rahim 
</p>
<p>Abd al-Rahim 
</p>
<p>Abd al Rahim 
</p>
<p>Abd El-Rahim 
</p>
<p>Abd El Rahim 
</p>
<p>Abd el-Rahim 
</p>
<p>Abd el Rahim 
</p>
<p>Abd Ar-Rahim 
</p>
<p>Abd Ar Rahim 
</p>
<p>Abd Ar-Rah&#238;m 
</p>
<p>Abd ar-Rahim 
</p>
<p>TABLE 4 &#8211; Quelques formes de translitt&#233;ration pour le nom propre  ,! -.&quot;&#1;&#10;&#1575;  
</p>
<p>Une &#233;tape interm&#233;diaire s'ajoute afin de proc&#233;der &#224; d&#8217;autres traitements, pour ne pas 
occulter l&#8217;un des probl&#232;mes tr&#232;s difficile de la transcription, comme la transcription de 
certains noms propres qui changent totalement phon&#233;tiquement pour des raisons 
religieuses ou autres : c'est le cas de  Moussa qui est traduit par Mo&#239;se, Yussuf par Josef, 
</p>
<p>133</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yaakoub par Jackoub, Hawa par Eve, etc. Cette &#233;tape consiste &#224; fournir ces 
transcriptions dans une liste. 
</p>
<p>Une fois g&#233;n&#233;r&#233;e la liste tri&#233;e des noms translitt&#233;r&#233;s, on proc&#232;de &#224; deux types de 
traitements : 
</p>
<p>&#8211; Normalisation de la liste des noms en &#233;criture latine : cette phase consiste &#224; 
effectuer certains traitements sur la sortie du nom en &#233;criture latine tels que la 
suppression des caract&#232;res sp&#233;ciaux (diacritiques et chiffres) et l&#8217;ajout de la 
majuscule au d&#233;but de nom propre, &#233;tant donn&#233; que les majuscules n&#8217;existent 
pas dans l&#8217;&#233;criture arabe des noms. Cette notion de majuscule est conserv&#233;e 
seulement dans le cas d&#8217;une utilisation dans des bases de donn&#233;es, mais elle n'est 
pas ajout&#233;e pour les moteurs de recherche usuels, qui ne consid&#232;rent pas la casse 
comme pertinente; 
</p>
<p>&#8211; Pond&#233;ration de la liste des noms en &#233;criture latine : cette &#233;tape consiste &#224; 
attribuer un poids aux r&#232;gles qui ont servi &#224; la g&#233;n&#233;ration de la liste, afin de 
pouvoir afficher les r&#233;sultats en sortie du plus probable vers le moins probable, 
ou inversement. Pour r&#233;aliser cette pond&#233;ration, nous utilisons le moteur de 
recherche Google en notant &#224; chaque fois le nombre d&#8217;occurrences pour chaque 
forme g&#233;n&#233;r&#233;e du nom propre : par exemple pour le pr&#233;nom arabe &#1604;&#30;&#2;&amp; (jamal), 
le syst&#232;me g&#233;n&#232;re trois translitt&#233;rations distinctes et attest&#233;es dans les textes 
(Djamel, Jamel, Gamel) et le calcul de fr&#233;quences fournit les r&#233;sultats suivants : 
</p>
<p>Forme translitt&#233;r&#233;e du 
nom en &#233;criture latine 
</p>
<p>Nombre moyen d&#8217;occurrences du nom sur 
le moteur de recherche Google 
</p>
<p>Djamel 4000000 
</p>
<p>Jamel 5500000 
</p>
<p>Gamel 500000 
</p>
<p>TABLE 5 &#8211; R&#233;sultats pour les formes translitt&#233;r&#233;es du pr&#233;nom &#1604;&#30;&#2;&amp; 
</p>
<p>Du point de vue de la pond&#233;ration, cet exemple permet de constater que la lettre arabe 
(&#1580;) est transcrite, en termes de fr&#233;quence, majoritairement par la lettre (J), puis par la 
graphie (Dj), puis par la lettre (G). 
</p>
<p>Cette proc&#233;dure a &#233;t&#233; appliqu&#233;e &#224; toutes les formes de translitt&#233;ration des caract&#232;res 
arabes. Elle a permis d&#8217;&#233;tablir une liste d&#8217;&#233;quivalences pond&#233;r&#233;e au niveau des 
graph&#232;mes, qui sert &#224; afficher les r&#233;sultats en sortie du plus probable vers le moins 
probables. 
</p>
<p>4 Utilisation de la translitt&#233;ration en alignement de mots 
</p>
<p>L&#8217;outil d&#8217;alignement de mots simples et compos&#233;s utilis&#233; dans cette &#233;tude est d&#233;crit dans 
(Semmar et Laib, 2010). Cet outil utilise les ressources et les modules suivants : 
</p>
<p>&#8211; un lexique bilingue fran&#231;ais-arabe compos&#233; de 124581 entr&#233;es. Les entr&#233;es de ce 
</p>
<p>134</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>lexique sont utilis&#233;es comme des points d&#8217;ancrage pour r&#233;duire l&#8217;espace de 
recherche des mots &#224; aligner dans les phrases source et cible ; 
</p>
<p>&#8211; un module pour l&#8217;appariement des entit&#233;s nomm&#233;es pr&#233;sentes dans les phrases 
source et cible ; 
</p>
<p>&#8211; un module permettant d&#8217;apparier les cat&#233;gories grammaticales des mots 
composant les phrases source et cible. Ce module utilise les positions des mots &#224; 
apparier par rapport aux entr&#233;es du lexique bilingue et des entit&#233;s nomm&#233;es d&#233;j&#224; 
align&#233;es ; 
</p>
<p>&#8211; un module pour l&#8217;appariement des mots compos&#233;s identifi&#233;s &#224; partir des mots 
simples d&#233;j&#224; align&#233;s et les relations de d&#233;pendance syntaxique entre ces mots. 
</p>
<p>Les entr&#233;es de cet outil d&#8217;alignement sont les sorties (r&#233;sultats) d&#8217;une analyse morpho-
syntaxique effectu&#233;e &#224; l&#8217;aide de la plate-forme d&#8217;analyse linguistique LIMA (Besan&#231;on et 
al., 2010) sur le corpus de textes parall&#232;les. Cette plate-forme fournit pour chaque couple 
de phrases source et cible : 
</p>
<p>&#8211; les lemmes et les formes fl&#233;chies des mots ainsi que leur position dans la phrase, 
&#8211; les cat&#233;gories grammaticales des mots, 
&#8211; les entit&#233;s nomm&#233;es, 
&#8211; les relations de d&#233;pendance syntaxique entre les mots, 
&#8211; les mots compos&#233;s. 
</p>
<p>Nous avons constat&#233; lors de l&#8217;alignement de mots &#224; partir de corpus de textes parall&#232;les 
anglais-arabe ou fran&#231;ais-arabe que beaucoup de noms arabes ne sont pas reconnus 
comme entit&#233;s nomm&#233;es par la plate-forme LIMA. Cela vient du fait que cette plate-
forme utilise des listes ainsi que des r&#232;gles de d&#233;clencheurs pour reconna&#238;tre des entit&#233;s 
telles que les noms de personnes, d&#8217;organisations, de lieux&#8230; mais ces listes sont limit&#233;es 
et plus particuli&#232;rement pour les langues peu dot&#233;es comme l&#8217;arabe. C&#8217;est pour cette 
raison que nous avons ajout&#233; un module suppl&#233;mentaire &#224; notre outil d&#8217;alignement de 
mots. Ce module est utilis&#233; pour permettre l&#8217;appariement des cognats pr&#233;sents dans les 
phrases source et cible. Nous consid&#233;rons comme cognats les mots dont les quatre 
premiers caract&#232;res sont identiques. 
</p>
<p>Cette &#233;tape utilise la translitt&#233;ration des noms propres et permet de d&#233;tecter, par 
exemple, que le nom propre &#171; Jackson &#187; et la translitt&#233;ration du mot arabe &#171; &#1606;01&#1570;&#30;&amp; &#187; 
(&#171;jackson&#187;) sont des cognats. En revanche, cet algorithme ne permet pas de d&#233;tecter des 
couples de mots comme &#171; blair &#187; et &#171; bleer &#187; (translitt&#233;ration du mot arabe &#171;&#1;.4&#1616;5&#1618;&#187;). Pour ce 
faire, nous avons d&#233;fini une similarit&#233; bas&#233;e sur le nombre de lettres en commun. Ceci 
permettra de d&#233;tecter les couples de mots cit&#233;s pr&#233;c&#233;demment ainsi que les noms propres 
et les expressions num&#233;riques. L&#8217;algorithme de d&#233;tection de cognats a &#233;t&#233; adapt&#233; pour ne 
s&#233;lectionner que les mots de taille proche et avec un nombre important de caract&#232;res en 
commun sans tenir compte de l&#8217;ordre de ces caract&#232;res. L&#8217;adaptation de cet algorithme a 
&#233;t&#233; r&#233;alis&#233;e en ajoutant les deux param&#232;tres &#171; Ratio_mots &#187; et &#171; Ratio_cognats &#187; d&#233;finis 
comme suit : 
</p>
<p>&#1;&#2;&#3;&#4;&#5;_&#7;&#5;&#3;&#8; &#9; &#10;&#11;&#5;&#7;&#12;&#13;&#14;&#9;&#16;&#14;&#9;&#17;&#2;&#13;&#2;&#17;&#3;&#232;&#13;&#14;&#8;&#9;&#16;&#19;&#9;&#7;&#5;&#3;&#9;&#17;&#5;&#19;&#13;&#3;&#20;/&#10;&#11;&#5;&#7;&#12;&#13;&#14;&#9;&#16;&#14;&#9;&#17;&#2;&#13;&#2;&#17;&#3;&#232;&#13;&#14;&#8;&#9;&#16;&#19;&#9;&#7;&#5;&#3;&#9;&#22;&#5;&#23;&#24;&#20;&#9;
</p>
<p>&#1;&#2;&#3;&#4;&#5;_&#17;&#5;&#24;&#23;&#2;&#3;&#8; &#9; &#10;&#11;&#5;&#7;&#12;&#13;&#14;&#9;&#16;&#14;&#9;&#17;&#2;&#13;&#2;&#17;&#3;&#232;&#13;&#14;&#8;&#9;&#14;&#23;&#9;&#17;&#5;&#7;&#7;&#19;&#23;&#20;/&#10;&#11;&#5;&#7;&#12;&#13;&#14;&#9;&#16;&#14;&#9;&#17;&#2;&#13;&#2;&#17;&#3;&#232;&#13;&#14;&#8;&#9;&#16;&#19;&#9;&#7;&#5;&#3;&#9;&#17;&#5;&#19;&#13;&#3;&#20;&#9;
</p>
<p>Deux mots sont cognats si Ratio_mots est sup&#233;rieur &#224; 0,8 et Ratio_cognats est sup&#233;rieur &#224; 
</p>
<p>135</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>0,5. Les valeurs de ces deux param&#232;tres ont &#233;t&#233; fix&#233;es empiriquement. 
</p>
<p>Cette adaptation permet certes d&#8217;identifier comme cognats le mot &#171; blair &#187; et la 
translitt&#233;ration &#171; bleer &#187; mais il g&#233;n&#232;re aussi des erreurs comme c&#8217;est le cas du couple de 
mots &#171; mohamed &#187; et la translitt&#233;ration &#171; mahmoud &#187;. Pour r&#233;duire le taux d&#8217;erreurs de 
ce module, nous avons ajout&#233; un crit&#232;re suppl&#233;mentaire relatif aux positions des deux 
mots dans les phrase source et cible. 
</p>
<p>Le tableau 6 pr&#233;sente le r&#233;sultat de l&#8217;alignement des mots simples et compos&#233;s de la 
phrase source &#171; M. Blair a impos&#233; des frais d&#8217;inscription &#233;lev&#233;s &#224; l&#8217;universit&#233; qui ont 
introduit une s&#233;lection par l&#8217;argent. &#187; et sa traduction en langue cible &#171; &#1590;&#1;&#6; &#1;.45 &#1605;07&#1585; 8.91: 
</p>
<p>;&#3;&lt;:&#1;&#4; &#5;&#6; ;&#3;&#4;&#30;9&#10;&#1575; &#30;&#2;&#4; &#1609;&#1583;&#1575; &#27;&#10;&#1575; &#1585;&#30;.?@&#1575; &#1576;AB&#10;&#1575; &#27;4! &#1577; !&#30;C &#1604;&#30;&#2;&#10;&#1575;. &#187;. 
</p>
<p>Lemmes des mots simples et 
compos&#233;s de la phrase source 
</p>
<p>Lemmes des mots simples et 
compos&#233;s de la phrase cible 
</p>
<p>Blair &#1;.4&#1616;5&#1618; 
</p>
<p>imposer &#1614;&#1590;&#1;&#1614;&#6;&#1614; 
</p>
<p>frais -7&#1618;&#1614;&#1585; 
</p>
<p>inscription 8.9&#1616;1&#1618;:&#1614; 
</p>
<p>&#233;lev&#233; D&lt;&#1616;:&#1614;&#1;&#1618;&#4;&#1615; 
</p>
<p>universit&#233; ;&#3;&#1614;&#4;&#1616;&#30;&amp;&#1614; 
</p>
<p>introduire &#1609;)&#1583;&#1614;&#1571; 
</p>
<p>s&#233;lection &#1585;&#30;.&#1614;?&#1616;@&#1618;&#1616;&#1573; 
</p>
<p>argent &#1604;&#30;&#4;&#1614; 
</p>
<p>frais_inscription -7&#1618;&#1614;&#1585;_8.9&#1616;1&#1618;:&#1614;  
</p>
<p>TABLE 6 &#8211; R&#233;sultats de l&#8217;alignement de mots simples et compos&#233;s  
</p>
<p>Le mot &#171; Blair &#187; a &#233;t&#233; align&#233; &#224; l&#8217;aide de l&#8217;appariement de cognats apr&#232;s translitt&#233;ration, 
les mots &#171; frais &#187;, &#171; &#233;lev&#233; &#187; et &#171; introduire &#187; ont &#233;t&#233; align&#233;s &#224; l&#8217;aide de l&#8217;appariement de 
cat&#233;gories grammaticales et les autres mots existent dans le lexique bilingue. Le mot 
compos&#233; &#171; frais_inscription &#187; a &#233;t&#233; align&#233; en utilisant les alignements de ces composants 
&#171; frais &#187; et &#171; inscription &#187;. Notons que le mot arabe &#171; &#1577; !&#30;C  &#187; (base) n&#8217;a pas de mot qui lui 
correspond dans la phrase en langue source (fran&#231;ais). 
</p>
<p>5 R&#233;sultats exp&#233;rimentaux 
</p>
<p>Pour illustrer l&#8217;apport de la translitt&#233;ration sur la qualit&#233; de l&#8217;alignement de mots simples 
</p>
<p>136</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>et compos&#233;s, nous avons &#233;valu&#233; les r&#233;sultats de l&#8217;alignement selon deux approches 
diff&#233;rentes : 
</p>
<p>&#8211; une &#233;valuation manuelle comparant les r&#233;sultats de notre aligneur de mots par 
rapport &#224; un alignement de r&#233;f&#233;rence ; 
</p>
<p>&#8211; une &#233;valuation automatique en int&#233;grant les r&#233;sultats de notre aligneur de mots 
dans le corpus d&#8217;apprentissage du mod&#232;le de traduction du syst&#232;me Moses 
(Koehn et al., 2007). 
</p>
<p>L&#8217;&#233;valuation manuelle de l&#8217;aligneur de mots a &#233;t&#233; r&#233;alis&#233;e sur une partie compos&#233;e de 
283 phrases du corpus MD (Monde Diplomatique) fran&#231;ais-arabe de la campagne 
ARCADE II (Veronis et al., 2008). Le choix d&#8217;une telle taille de corpus s&#8217;explique par le 
fait que la constitution de l&#8217;alignement de r&#233;f&#233;rence est une t&#226;che co&#251;teuse puisque 
l&#8217;identification des alignements des mots simples et compos&#233;s est r&#233;alis&#233;e manuellement 
sur les 283 phrases. Pour les m&#233;triques d&#8217;&#233;valuation, nous avons utilis&#233; celles du 
protocole d&#233;fini lors de la conf&#233;rence HLT/NAACL 2003 (Mihalcea et Pedersen, 2003). 
</p>
<p>Le tableau 7 r&#233;sume nos r&#233;sultats en termes de pr&#233;cision et de rappel selon que l&#8217;aligneur 
de mots utilise ou non l&#8217;appariement de cognats avec la translitt&#233;ration de noms propres 
arabes. Ces r&#233;sultats montrent que l&#8217;utilisation de la translitt&#233;ration arabe permet 
d&#8217;augmenter aussi bien la pr&#233;cision que le rappel. 
</p>
<p>Alignement de mots Pr&#233;cision Rappel F-mesure 
</p>
<p>sans l&#8217;appariement de cognats 0,85 0,80 0,82 
</p>
<p>avec l&#8217;appariement de cognats 0,88 0,85 0,86 
</p>
<p>TABLE 7 &#8211; R&#233;sultats de l&#8217;&#233;valuation de l&#8217;alignement de mots 
</p>
<p>Certes, la taille insuffisante du corpus utilis&#233; pour l&#8217;&#233;valuation de notre aligneur de mots 
ne permet pas de mesurer quantitativement l&#8217;apport de la translitt&#233;ration mais les 
r&#233;sultats obtenus indiquent clairement qu&#8217;il y a une am&#233;lioration de la qualit&#233; de 
l&#8217;alignement.  
</p>
<p>La non disponibilit&#233; d&#8217;un alignement de r&#233;f&#233;rence d&#8217;une taille significative pour les mots 
simples et compos&#233;s ne nous permet pas de comparer notre approche avec les diff&#233;rents 
travaux de l&#8217;&#233;tat de l&#8217;art. C&#8217;est la raison pour laquelle, nous avons d&#233;cid&#233; d&#8217;&#233;tudier 
l&#8217;apport de l&#8217;utilisation de la translitt&#233;ration en alignement de mots en int&#233;grant les 
r&#233;sultats de notre aligneur de mots dans le corpus d&#8217;apprentissage du mod&#232;le de 
traduction du syst&#232;me Moses. Le mod&#232;le de traduction utilis&#233; est appris sur les lemmes 
des mots composant le corpus parall&#232;le d&#8217;apprentissage et les lemmes des mots produits 
par notre aligneur (Koehn et Hoang, 2007). 
</p>
<p>Le corpus initial d&#8217;apprentissage est compos&#233; de 10000 paires de phrases fran&#231;ais-arabe 
issues du corpus ARCADE II auquel nous avons ajout&#233; environ 10000 paires de mots 
simples et compos&#233;s correspondant aux r&#233;sultats de l&#8217;aligneur de mots int&#233;grant 
l&#8217;appariement de cognats &#224; l&#8217;aide de la translitt&#233;ration sur 500 paires de phrases fran&#231;ais-
arabe. Nous avons aussi sp&#233;cifi&#233; un mod&#232;le de langue pour la langue cible en utilisant la 
</p>
<p>137</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>totalit&#233; des phrases arabes du corpus ARCADE II. 
</p>
<p>La performance du syst&#232;me de traduction statistique Moses est &#233;valu&#233;e &#224; l&#8217;aide du score 
BLEU sur un corpus de test compos&#233; de 250 paires de phrases. Pour chaque phrase 
source, une seule phrase de r&#233;f&#233;rence en langue cible est consid&#233;r&#233;e. Les r&#233;sultats de 
traduction obtenus sont regroup&#233;s dans le tableau 8. 
</p>
<p>Corpus d&#8217;apprentissage BLEU 
</p>
<p>sans les r&#233;sultats de l&#8217;appariement de 
cognats (sans translitt&#233;ration) 
</p>
<p>12,50 
</p>
<p>avec les r&#233;sultats de l&#8217;appariement de 
cognats (avec translitt&#233;ration) 
</p>
<p>12,82 
</p>
<p>TABLE 8 &#8211; R&#233;sultats de traduction selon le score BLEU 
</p>
<p>Ces r&#233;sultats montrent que l&#8217;int&#233;gration dans le corpus d&#8217;apprentissage du mod&#232;le de 
traduction des alignements obtenus par le module d&#8217;appariement de cognats utilisant la 
translitt&#233;ration a permis d&#8217;obtenir un gain de +0,32 points BLEU. 
</p>
<p>Il est difficile de dire &#224; ce stade si ce gain en score BLEU induit une am&#233;lioration 
significative de la qualit&#233; de la traduction au vu de la faible valeur de ce score li&#233;e &#224; la 
taille des corpus d&#8217;apprentissage utilis&#233;s (uniquement 10000 paires de phrases pour 
l&#8217;apprentissage du mod&#232;le de traduction et environ 11000 phrases pour l&#8217;apprentissage 
du mod&#232;le de la langue cible). Nous pourrons conclure tout de m&#234;me que la 
translitt&#233;ration am&#233;liore la performance de l&#8217;aligneur de mots, quelle que soit la mani&#232;re 
d&#8217;&#233;valuer les r&#233;sultats, manuellement ou automatiquement. 
</p>
<p>6 Conclusion 
</p>
<p>Dans cet article, nous avons d&#233;crit un syst&#232;me de translitt&#233;ration des noms propres de 
l&#8217;&#233;criture arabe vers l&#8217;&#233;criture latine. Ce syst&#232;me a &#233;t&#233; utilis&#233; dans un processus 
d&#8217;alignement de mots &#224; partir de corpus de textes fran&#231;ais-arabe. Ce processus se d&#233;roule 
en deux phases : d&#8217;abord, les mots simples sont align&#233;s en utilisant un lexique bilingue et 
certaines propri&#233;t&#233;s de ces mots (positions, cat&#233;gories grammaticales, entit&#233;s nomm&#233;s et 
cognats), ensuite les mots compos&#233;s sont align&#233;s en les identifiant &#224; l&#8217;aide des relations 
de d&#233;pendance syntaxique reliant leurs composants. Ce processus donne des r&#233;sultats 
tr&#232;s satisfaisants lorsque la translitt&#233;ration arabe est utilis&#233;e pour apparier les noms 
propres pr&#233;sents dans les phrases source et cible. Nos travaux futurs s&#8217;orientent, d&#8217;une 
part, vers une &#233;valuation &#224; une large &#233;chelle de notre outil d&#8217;alignement en vue de 
consolider les r&#233;sultats d&#233;j&#224; obtenus, et d&#8217;autre part, vers une translitt&#233;ration g&#233;o-
localis&#233;e pour identifier comment les diff&#233;rentes translitt&#233;rations peuvent fournir des 
indications sur l&#8217;origine et/ou sur le profil de celui qui les utilise (francophone ou 
anglophone, du Maghreb ou du Macherek, du nord ou du sud...). 
</p>
<p>138</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences 
</p>
<p>ABDULJALEEL, N. et LARKEY, L. (2003). Statistical transliteration for English-Arabic Cross 
Language Information Retrieval. In Proceedings of the Twelfth ACM International 
Conference on Information and Knowledge Management, New Orleans, Louisiana, pages 
139&#8211;146. 
</p>
<p>ALGHAMDI, M. (2005). Alghorithms for Romanizing Arabic names. In Journal of King Saud 
University: Computer Sciences and Information, n&#176; 17, 2005, Riyadh, pages 1&#8211;27. 
</p>
<p>ALSALMAN, A., ALGHAMDI, M., ALHUQAYL, K. et ALSUBAI, S. (2007). Romanization System 
for Arabic Names. In Proceedings of The First International Symposium on Computer and 
Arabic Language (ISCAL &#8211; 07), Riyadh, pages 214&#8211;227. 
</p>
<p>BARKAT-DEFRADAS, M., HAMDI, R. et PELLEGRINO, F. (2004). De la caract&#233;risation 
linguistique &#224; l&#8217;identification automatique des dialectes arabes. In Proceedings of MIDL 
2004. 
</p>
<p>BESAN&#199;ON, R., DE CHALENDAR, G., FERRET, O., GARA, F., LAIB, M., MESNARD, O. et SEMMAR, 
N. (2010). Lima: A multilingual framework for linguistic analysis and linguistic resources 
development and evaluation. In Proceedings of LREC 2010, Malta. 
</p>
<p>GUIDERE, M. (2004). Le traitement de la parole et la d&#233;tection des dialectes arabes. In 
Langues strat&#233;giques et d&#233;fense nationale, Publications du CREC, Saint-Cyr, pages  53&#8211;75. 
</p>
<p>KNIGHT, K. et GRAEHL, J. (1997). Machine transliteration. In Journal version Computational 
Linguistics, 24(4), 1997, pages 599&#8211;612. 
</p>
<p>KOEHN, P., HOANG, H., BIRCH, A., CALLISON-BURCH, C., FEDERICO, M., BERTOLDI, N., COWAN, 
B., SHEN, W., MORGAN, C., ZENS, R., DYER, C., BOJAR, O., CONSTANTIN, A. et HERBST, E. 
(2007). Moses: Open source toolkit for statistical machine translation. In Proceedings of 
ACL 2007, demo session, Prague. 
</p>
<p>KOEHN, P. et HOANG, H. (2007). Factored Translation Models. In Proceedings of the Joint 
Conference on Empirical Methods in Natural Language Processing and Computational Natural 
Language Learning (ACL 2007), Prague, pages 868&#8211;876. 
</p>
<p>MIHALCEA, R. et PEDERSEN, T. (2003). An evaluation exercise for word alignment. In 
Proceedings of the Workshop on Building and Using Parallel Texts: Data Driven Machine 
Translation and Beyond, Edmonton, pages 10&#8211;10. 
</p>
<p>SEMMAR, N. et LAIB, M. (2010). Using a Hybrid Word Alignment Approach for Automatic 
Construction and Updating of Arabic to French Lexicons. In Proceedings of LREC 2010: 
Workshop on Language Resources and Human Technologies for Semitic Languages, Malta. 
</p>
<p>SHAO, L. et NG, H. T. (2004). Mining new word translations from comparable corpora. In 
Proceedings of the 20th International Conference on Computational Linguistics (COLING&#8217;04), 
Stroudsburg, pages 618&#8211;624. 
</p>
<p>SHERIF, T. et KONDRAK, G. (2007). Bootstrapping a stochastic transducer for Arabic-English 
transliteration extraction. In Proceedings of the 45th Annual Meeting of the Association of 
Computational Linguistics (ACL 2007), Prague, pages 864&#8211;871. 
</p>
<p>139</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>STALLS, B. et KNIGHT, K . (1998). Translating names and technical terms in arabic text. In 
Proceedings of the COLING/ACL Workshop on Computational Approches to Semitic 
Languages, Montreal. 
</p>
<p>TAO, T., YOON, S. Y., FISTER, A., SPROAT, R. et ZHAI, C. (2006). Unsupervised named entity 
transliteration using temporal and phonetic correlation. In Proceedings of the Conference 
on Empirical Methods in Natural Language Processing (EMNLP&#8217;06), Sydney, pages 250&#8211;257. 
</p>
<p>VERONIS, J., HAMON, O., AYACHE, C., BELMOUHOUB, R., KRAIF, O., LAURENT, D., NGUYEN, T. 
M. H., SEMMAR, N., STUCK, F. et ZAGHOUANI, W. (2008). Arcade II Action de recherche 
concert&#233;e sur l&#8217;alignement de documents et son &#233;valuation. In Chapitre 2, Editions Herm&#232;s. 
</p>
<p>YASER, A. O. et KNIGHT, K. (2002). Translating named entities using monolingual and 
bilingual resources. In Proceedings of the 40th Annual Meeting of the Association of 
Computational Linguistics (ACL&#8217;02), Philadelphia, pages 400&#8211;408. 
</p>
<p>140</p>

</div></div>
</body></html>