<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une m&#233;thode d'extraction d'information fond&#233;e sur les graphes pour le remplissage de formulaires</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 29&#8211;42,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Une m&#233;thode d&#8217;extraction d&#8217;information fond&#233;e sur les
graphes pour le remplissage de formulaires
</p>
<p>Ludovic Jean-Louis Romaric Besan&#231;on Olivier Ferret
CEA, LIST, Laboratoire Vision et Ing&#233;nierie des Contenus
</p>
<p>F-91191 Gif-sur-Yvette, France
</p>
<p>{ludovic.jean-louis,romaric.besancon,olivier.ferret}@cea.fr
</p>
<p>R&#201;SUM&#201;
Dans les syst&#232;mes d&#8217;extraction d&#8217;information sur des &#233;v&#233;nements, une t&#226;che importante est le
remplissage automatique de formulaires regroupant les informations sur un &#233;v&#233;nement donn&#233;
&#224; partir d&#8217;un texte non structur&#233;. Ce remplissage de formulaire peut s&#8217;av&#233;rer difficile lorsque
l&#8217;information est dispers&#233;e dans tout le texte et m&#233;lang&#233;e &#224; des &#233;l&#233;ments d&#8217;information li&#233;s &#224; un
autre &#233;v&#233;nement similaire. Nous proposons dans cet article une approche en deux &#233;tapes pour
ce probl&#232;me : d&#8217;abord une segmentation du texte en &#233;v&#233;nements pour s&#233;lectionner les phrases
relatives au m&#234;me &#233;v&#233;nement ; puis une m&#233;thode de s&#233;lection dans les phrases s&#233;lectionn&#233;es
des entit&#233;s li&#233;es &#224; l&#8217;&#233;v&#233;nement. Une &#233;valuation de cette approche sur un corpus annot&#233; de
d&#233;p&#234;ches dans le domaine des &#233;v&#233;nements sismiques montre un F-score de 72% pour la t&#226;che de
remplissage de formulaires.
</p>
<p>ABSTRACT
A Graph-Based Method for Template Filling in Information Extraction
</p>
<p>In event-based Information Extraction systems, a major task is the automated filling from unstruc-
tured texts of a template gathering information related to a particular event. Such template filling
may be a hard task when the information is scattered throughout the text and mixed with similar
pieces of information relative to a different event. We propose in this paper a two-step approach
for template filling : first, an event-based segmentation is performed to select the parts of the text
related to the target event ; then, a graph-based method is applied to choose the most relevant
entities in these parts for characterizing the event. Using an evaluation of this model based on an
annotated corpus for earthquake events, we achieve a 72% F-measure for the template-filling task.
</p>
<p>MOTS-CL&#201;S : Extraction d&#8217;information, segmentation de texte, remplissage de formulaires.
</p>
<p>KEYWORDS: Information Extraction, Text Segmentation, Template Filling.
</p>
<p>1 Introduction
</p>
<p>Le domaine de l&#8217;Extraction d&#8217;Information couvre toutes les t&#226;ches consistant &#224; extraire des
informations structur&#233;es &#224; partir de textes. Une t&#226;che arch&#233;typique de ce domaine est celle
d&#233;finie dans les conf&#233;rences MUC (Message Understanding Conferences) (Grishman et Sundheim,
1996), o&#249; les syst&#232;mes doivent permettre de remplir de fa&#231;on automatique des formulaires (ou
</p>
<p>29</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>templates) concernant des &#233;v&#233;nements. Ces formulaires permettent de mettre en &#233;vidence une
information sp&#233;cifique &#224; un type d&#8217;&#233;v&#233;nement consid&#233;r&#233; et d&#8217;ignorer tout autre type d&#8217;information
non pertinente. La figure 1 donne un exemple du remplissage d&#8217;un formulaire &#224; partir du texte
d&#8217;une d&#233;p&#234;che de presse.
</p>
<p>Texte
</p>
<p>EV1Un s&#233;isme de magnitude 7,2 sur l'&#233;chelle de Richter a 
frapp&#233; samedi  la ville de Kurihara (pr&#233;fecture de
Miyagi). 
</p>
<p>EV1Le tremblement s'est produit &#224; 08H43, heure locale.
</p>
<p>EV1La secousse  a &#233;t&#233; ressentie jusqu'&#224; Tokyo, &#224; 500 
kilom&#232;tres au sud des pr&#233;fectures japonaises d'Iwate  et 
de Miyagi, principales zones touch&#233;es.
</p>
<p>Les s&#233;ismes  sont courants au Japon, qui est l'une des 
zones sismiques les plus actives de la plan&#232;te.
</p>
<p>EV2En octobre 2004, un s&#233;isme d'une magnitude de 6,8
avait touch&#233; la r&#233;gion de Niigata, dans le nord du pays.
</p>
<p>Templates
</p>
<p>EV1
&#9679; &#201;V&#201;NEMENT : s&#233;isme,
                            tremblement,
                            secousse
&#9679; DATE : samedi
&#9679; HEURE : 08h43
&#9679; MAGNITUDE : 7,2
&#9679; LIEU : Kurihara
</p>
<p>EV2
&#9679; &#201;V&#201;NEMENT : s&#233;isme
&#9679; DATE : octobre 2004
&#9679; HEURE : /
&#9679; MAGNITUDE : 6,8
&#9679; LIEU : Niigata
</p>
<p>FIG. 1 &#8211; Exemple de remplissage de formulaire
</p>
<p>Les probl&#232;mes soulev&#233;s par la r&#233;alisation d&#8217;un syst&#232;me d&#8217;extraction d&#8217;information pour le rem-
plissage de formulaire comptent en particulier l&#8217;identification des entit&#233;s nomm&#233;es ou autres
entit&#233;s sp&#233;cifiques du domaine, l&#8217;&#233;tablissement des relations entre ces entit&#233;s, la r&#233;solution de la
cor&#233;f&#233;rence concernant les entit&#233;s, le regroupement d&#8217;informations dispers&#233;es dans le texte, etc.
(Turmo et al., 2006).
</p>
<p>Il n&#8217;existe pas actuellement d&#8217;approche consid&#233;r&#233;e comme standard pour le remplissage de
formulaire. N&#233;anmoins, la plupart des syst&#232;mes d&#8217;extraction d&#8217;information adoptent une approche
en deux temps : des patrons sp&#233;cifiques au domaine ou des classifieurs sont d&#8217;abord utilis&#233;s pour
extraire au niveau phrastique les informations constitutives du formulaire consid&#233;r&#233; (dates, lieux,
magnitudes et heures dans le cas de la figure 1) en s&#8217;appuyant sur les mentions d&#8217;&#233;v&#233;nements ;
des heuristiques relatives au type d&#8217;&#233;v&#233;nement ou de texte consid&#233;r&#233; sont ensuite appliqu&#233;es pour
fusionner les informations extraites dans des formulaires globaux. M&#234;me si ce type d&#8217;approche
est largement utilis&#233;, elle se heurte &#224; deux probl&#232;mes importants : une vision tr&#232;s locale de
l&#8217;extraction des informations &#233;l&#233;mentaires et une prise en compte limit&#233;e et peu g&#233;n&#233;rique des
d&#233;pendances entre ces informations, en particulier pour le remplissage des formulaires.
</p>
<p>La figure 1 illustre clairement le fait que les informations relatives &#224; un &#233;v&#233;nement, ici EV1,
peuvent &#234;tre exprim&#233;es au-del&#224; de la port&#233;e de la phrase. Ce probl&#232;me pose plus g&#233;n&#233;ralement la
question de la d&#233;limitation des parties de texte relatives &#224; un &#233;v&#233;nement ou un type d&#8217;&#233;v&#233;nements
donn&#233; car les informations d&#8217;un &#233;v&#233;nement ne sont pas toujours li&#233;es &#224; une mention d&#8217;&#233;v&#233;nement
proche. Notre approche pour r&#233;soudre ce probl&#232;me s&#8217;appuie sur une segmentation discursive
des textes sur la base des &#233;v&#233;nements auxquels chaque phrase fait r&#233;f&#233;rence. Plus largement,
son objectif est de diminuer l&#8217;espace textuel &#224; explorer pour faire le lien entre une entit&#233; et une
mention d&#8217;&#233;v&#233;nement et donc in fine, pour le remplissage du formulaire associ&#233; &#224; un &#233;v&#233;nement
donn&#233;. Les notions de temps et d&#8217;&#233;v&#233;nement &#233;tant fortement li&#233;es, cette segmentation s&#8217;appuie
</p>
<p>30</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>sur des indices de nature temporelle.
</p>
<p>Le second probl&#232;me &#233;voqu&#233; ci-dessus a d&#233;j&#224; fait l&#8217;objet de quelques travaux assimilant les
formulaires &#224; des relations complexes. Dans ce contexte, chaque &#233;v&#233;nement est vu comme
une relation n-aire dont l&#8217;arit&#233; est &#233;gale au nombre de champs &#224; remplir dans le formulaire
(n=5 dans l&#8217;exemple pr&#233;c&#233;dent). Cette vision a d&#8217;abord &#233;t&#233; appliqu&#233;e au niveau local pour des
phrases contenant plusieurs entit&#233;s d&#8217;int&#233;r&#234;t pour le m&#234;me &#233;v&#233;nement (la premi&#232;re phrase de la
figure 1 en contient par exemple quatre) : dans (McDonald et al., 2005), les relations entre la
mention de cet &#233;v&#233;nement et les informations qui lui sont li&#233;es ne sont ainsi plus consid&#233;r&#233;es
ind&#233;pendamment les unes des autres mais de fa&#231;on plus globale. Au-del&#224;, plusieurs m&#233;thodes ont
&#233;t&#233; propos&#233;es pour extraire des relations complexes, parmi lesquelles se distinguent des m&#233;thodes
&#224; base de graphe (McDonald et al., 2005; Wick et al., 2006) et des m&#233;thodes &#224; base d&#8217;inf&#233;rences
(Goertzel et al., 2006). Dans cet article, nous pr&#233;sentons une m&#233;thode &#224; base de graphe, en
commen&#231;ant par construire un graphe d&#8217;entit&#233;s fond&#233; sur le r&#233;sultat de la segmentation et
en utilisant plusieurs strat&#233;gies g&#233;n&#233;riques (i.e. ind&#233;pendantes du domaine consid&#233;r&#233;) pour la
construction de la relation complexe &#224; partir de ce graphe.
</p>
<p>2 Motivation et &#233;tat de l&#8217;art
</p>
<p>Le remplissage de formulaire est une t&#226;che centrale des syst&#232;mes d&#8217;extraction d&#8217;information et a
fait l&#8217;objet en tant que telle de nombreuses &#233;tudes. Ainsi, dans le contexte des campagnes d&#8217;&#233;va-
luation MUC (Message Understanding Conferences) et ACE (Automatic Content Extraction) (Dod-
dington et al., 2004), un des objectifs des syst&#232;mes participants &#233;tait de remplir automatiquement
des formulaires pr&#233;d&#233;finis avec une structure fixe. Bien que ce soit l&#8217;approche la plus r&#233;pandue,
d&#8217;autres travaux, comme (Chambers et Jurafsky, 2011), adoptent un point de vue diff&#233;rent et
proposent une approche non supervis&#233;e pour remplir des formulaires sans connaissance a priori
sur leur structure. Ils exploitent dans ce cas des techniques de regroupement (clustering) pour
apprendre la structure des formulaires et des patrons syntaxiques pour en remplir les champs.
</p>
<p>Une grande partie des syst&#232;mes d&#8217;extraction d&#8217;information, en particulier ceux fond&#233;s sur des
approches &#224; base d&#8217;apprentissage automatique, s&#8217;appuient sur l&#8217;id&#233;e qu&#8217;un &#233;v&#233;nement est souvent
d&#233;crit dans une seule phrase, ce qui conduit &#224; donner une importance moindre &#224; l&#8217;information
inter-phrastique. Cette id&#233;e est nomm&#233;e &#171; hypoth&#232;se de la phrase seule &#187; (single sentence
assumption) par (Stevenson, 2006), qui rapporte que seulement 60% des faits mentionn&#233;s dans
les corpus MUC (MUC 4-6-7) peuvent &#234;tre identifi&#233;s avec cette hypoth&#232;se. Ce pourcentage a
&#233;t&#233; confirm&#233; plus r&#233;cemment par (Ji et al., 2010), montrant qu&#8217;environ 40% des relations entre
entit&#233;s n&#233;cessitent l&#8217;usage de techniques d&#8217;inf&#233;rences inter-phrastiques pour les extraire.
</p>
<p>Peu d&#8217;approches ont &#233;t&#233; propos&#233;es pour faire de l&#8217;extraction d&#8217;information &#224; un niveau discursif
sans lien &#233;troit avec le domaine abord&#233;. Parmi elles, (Gu et Cercone, 2006) et (Patwardhan et
Riloff, 2007) sont les plus proches de l&#8217;approche pr&#233;sent&#233;e ici. (Gu et Cercone, 2006) d&#233;finit une
approche &#224; base de mod&#232;les de Markov cach&#233;s, d&#8217;une part pour identifier les unit&#233;s de textes
(phrases) pertinentes pour le remplissage de formulaire, et d&#8217;autre part pour faire l&#8217;extraction
des entit&#233;s dans les phrases retenues. De fa&#231;on similaire, (Patwardhan et Riloff, 2007) propose
tout d&#8217;abord d&#8217;identifier les phrases pertinentes en utilisant un mod&#232;le SVM (Support Vector
Machine), puis d&#8217;appliquer diff&#233;rents niveaux de patrons d&#8217;extraction pour remplir les champs du
formulaire.
</p>
<p>31</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une des premi&#232;res approches pour l&#8217;extraction de relations n-aires vient du domaine biom&#233;dical
(McDonald et al., 2005) et a ensuite &#233;t&#233; appliqu&#233;e dans le domaine des mouvements de personnel
dans les entreprises (Afzal, 2009). D&#8217;autres travaux s&#8217;attaquent au probl&#232;me des relations
complexes dans le contexte de l&#8217;extraction de champs pour les bases de donn&#233;es (database record
extraction), en s&#8217;int&#233;ressant plus particuli&#232;rement &#224; la compatibilit&#233; d&#8217;un ensemble d&#8217;entit&#233;s
donn&#233;es plut&#244;t que d&#8217;une paire d&#8217;entit&#233;s, ce qui les am&#232;ne &#224; prendre en compte des relations
inter-phrastiques entre entit&#233;s (Wick et al., 2006; Mansuri et Sarawagi, 2006; Feng et al., 2007).
</p>
<p>3 Description de l&#8217;approche
</p>
<p>Le cadre applicatif de la m&#233;thode d&#8217;extraction d&#8217;&#233;v&#233;nements pr&#233;sent&#233;e dans cet article se situe
dans un contexte de veille, dans lequel les utilisateurs ne sont en g&#233;n&#233;ral int&#233;ress&#233;s que par les
&#233;v&#233;nements les plus r&#233;cents. Dans ce contexte, notre but est de synth&#233;tiser, &#224; partir de d&#233;p&#234;ches
de presse, les informations relatives aux &#233;v&#233;nements r&#233;cents dans un tableau de bord. N&#233;anmoins,
les articles font en g&#233;n&#233;ral r&#233;f&#233;rence &#224; plusieurs &#233;v&#233;nements comparables, en g&#233;n&#233;ral pour mettre
en &#233;vidence les similarit&#233;s ou les diff&#233;rences entre l&#8217;&#233;v&#233;nement r&#233;cent et des &#233;v&#233;nements pass&#233;s
de m&#234;me nature. Dans notre application sp&#233;cifique de veille, nous ne nous int&#233;ressons pas aux
&#233;v&#233;nements pass&#233;s, que nous consid&#233;rons comme une source de bruit pour la d&#233;tection des
informations relatives &#224; l&#8217;&#233;v&#233;nement principal de l&#8217;article. Nous avons donc fait l&#8217;hypoth&#232;se,
comme (Feng et al., 2007), qu&#8217;un document est associ&#233; &#224; un seul formulaire. Nous utilisons une
strat&#233;gie en deux &#233;tapes pour extraire cette information (Jean-Louis et al., 2011) :
</p>
<p>&#8211; une segmentation du texte en &#233;v&#233;nements : les informations relatives aux &#233;v&#233;nements peuvent
se trouver sur plusieurs phrases. Par cons&#233;quent, nous devons d&#233;couper le texte en segments
homog&#232;nes du point de vue &#233;v&#233;nementiel. Ces segments regroupent fr&#233;quemment des phrases
non-contigu&#235;s car la structure des articles fait souvent des aller-retours entre l&#8217;&#233;v&#233;nement
principal et un ou plusieurs &#233;v&#233;nements pass&#233;s ;
</p>
<p>&#8211; le remplissage des formulaires : puisque les segments &#233;v&#233;nementiels couvrent plus d&#8217;une phrase,
la probabilit&#233; d&#8217;y trouver des relations complexes (impliquant un grand nombre d&#8217;entit&#233;s) est
plus forte que dans une seule phrase. Nous devons donc trouver dans ces segments quelles
entit&#233;s sont susceptibles d&#8217;&#234;tre impliqu&#233;es dans des relations complexes.
</p>
<p>4 Segmentation &#233;v&#233;nementielle des textes
</p>
<p>L&#8217;id&#233;e de segmenter des textes en unit&#233;s homog&#232;nes du point de vue &#233;v&#233;nementiel a principa-
lement &#233;t&#233; abord&#233;e selon deux angles : de fa&#231;on assez li&#233;e &#224; un domaine particulier dans des
travaux comme (Gu et Cercone, 2006; Patwardhan et Riloff, 2007), avec des m&#233;thodes reposant
sur des mod&#232;les tr&#232;s lexicalis&#233;s ; &#224; l&#8217;inverse, en ne s&#8217;appuyant que sur la logique d&#8217;encha&#238;nement
des types d&#8217;&#233;v&#233;nements dans (Naughton, 2007). Notre approche est interm&#233;diaire : en exploitant
des informations de nature temporelle, elle fait appel &#224; des caract&#233;ristiques des textes d&#233;passant
leur simple appartenance &#224; un domaine donn&#233;.
</p>
<p>Du point de vue du processus de segmentation, un texte est vu comme une s&#233;quence de phrases,
chaque phrase &#233;tant caract&#233;ris&#233;e par un statut &#233;v&#233;nementiel. Comme dans la plupart des travaux
similaires, nous faisons l&#8217;hypoth&#232;se, en pratique raisonnablement simplificatrice, qu&#8217;une phrase
</p>
<p>32</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>poss&#232;de un statut &#233;v&#233;nementiel homog&#232;ne. Nous distinguons plus pr&#233;cis&#233;ment trois statuts.
&#201;v&#233;nement principal : r&#233;f&#233;rence &#224; l&#8217;&#233;v&#233;nement principal du texte ; &#201;v&#233;nement secondaire :
r&#233;f&#233;rence &#224; un &#233;v&#233;nement secondaire du texte, sans distinction de l&#8217;&#233;v&#233;nement particulier s&#8217;il en
existe plusieurs ; Contexte : sans r&#233;f&#233;rence &#224; un &#233;v&#233;nement.
</p>
<p>Dans cette perspective, nous consid&#233;rons la segmentation &#233;v&#233;nementielle comme une t&#226;che de
classification visant &#224; associer &#224; chaque phrase d&#8217;un texte un statut &#233;v&#233;nementiel. N&#233;anmoins,
une telle segmentation poss&#232;de un caract&#232;re intrins&#232;quement discursif dans la mesure o&#249; les
cat&#233;gories &#233;v&#233;nementielles ne s&#8217;encha&#238;nent pas de mani&#232;re arbitraire. Du point de vue de la
classification des phrases, elles sont donc d&#233;termin&#233;es &#224; la fois par les indices rep&#233;rables au
niveau phrastique mais &#233;galement par les cat&#233;gories et les indices des phrases pr&#233;c&#233;dentes. Notre
approche se focalise ainsi sur la capture des relations entre les changements &#233;v&#233;nementiels et les
changements de cadre temporel, manifest&#233;es par exemple par le passage du pass&#233; compos&#233; vers
plus-que-parfait accompagnant la transition de l&#8217;&#233;v&#233;nement principal &#224; un &#233;v&#233;nement secondaire
dans le texte de la figure 2.
</p>
<p>Pour la classification des phrases, nous avons donc utilis&#233; un mod&#232;le de s&#233;quences, en l&#8217;occurrence
de type CRF lin&#233;aire (Champs Conditionnels Al&#233;atoires (Lafferty et al., 2001)), s&#8217;appuyant sur les
traits de nature temporelle suivants. Temps des verbes : un trait binaire est associ&#233; &#224; chaque temps
possible et activ&#233; d&#232;s que la phrase contient au moins un verbe du temps correspondant ; date :
la pr&#233;sence d&#8217;une date est souvent le signe de la pr&#233;sence d&#8217;un &#233;v&#233;nement diff&#233;rent de celui
de la phrase pr&#233;c&#233;dente ; expression temporelle : ce trait marque la pr&#233;sence d&#8217;une expression
temporelle, telle que ces derni&#232;res ann&#233;es, au d&#233;but de l&#8217;ann&#233;e, souvent associ&#233;e au caract&#232;re
g&#233;n&#233;ral d&#8217;un propos. Par ailleurs, les d&#233;pendances de succession entre les diff&#233;rents statuts
&#233;v&#233;nementiels sont prises en compte par le caract&#232;re lin&#233;aire de notre mod&#232;le CRF. Ce mod&#232;le
est plus amplement d&#233;taill&#233; dans (Jean-Louis et al., 2010).
</p>
<p>5 Remplissage de formulaires &#233;v&#233;nementiels
</p>
<p>Pour le remplissage des formulaires li&#233;s aux &#233;v&#233;nements, nous proposons une approche &#224; base de
graphe inspir&#233;e du paradigme de l&#8217;extraction de relations complexes. Sa premi&#232;re &#233;tape, dite de
construction du graphe, d&#233;tecte d&#8217;abord les relations existant entre des paires de mentions d&#8217;entit&#233;s
ou d&#8217;&#233;v&#233;nements du domaine consid&#233;r&#233; cooccurrant dans une phrase. Il construit ensuite un
graphe d&#8217;entit&#233;s sur la base de la fusion des mentions d&#8217;&#233;v&#233;nements et d&#8217;entit&#233;s faisant r&#233;f&#233;rence
&#224; un m&#234;me &#233;v&#233;nement ou &#224; une m&#234;me entit&#233;. Sa seconde &#233;tape, dite de remplissage du formulaire,
applique des strat&#233;gies g&#233;n&#233;riques &#224; ce graphe pour s&#233;lectionner les entit&#233;s les plus &#224; m&#234;me
de remplir le formulaire correspondant au type d&#8217;&#233;v&#233;nement consid&#233;r&#233;. Ces deux &#233;tapes sont
d&#233;taill&#233;es dans les deux sections suivantes.
</p>
<p>5.1 Construction du graphe d&#8217;entit&#233;s
</p>
<p>Le graphe d&#8217;entit&#233;s que nous construisons dans cette premi&#232;re &#233;tape caract&#233;rise &#224; l&#8217;&#233;chelle du
document la pr&#233;sence ou l&#8217;absence d&#8217;une relation entre chaque paire d&#8217;entit&#233;s li&#233;es au type
d&#8217;&#233;v&#233;nements consid&#233;r&#233; (par exemple, la relation de localisation d&#8217;un &#233;v&#233;nement sismique
dans notre cas). Il s&#8217;agit d&#8217;un graphe pond&#233;r&#233; dont les n&#339;uds repr&#233;sentent des entit&#233;s ou des
&#233;v&#233;nements et les arcs, les relations qui les unissent. Ces relations &#233;tant sym&#233;triques, ce graphe
</p>
<p>33</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>est non dirig&#233;. Le poids associ&#233; &#224; chaque arc est un score de confiance prenant ses valeurs dans
l&#8217;intervalle [0,1] et &#233;valuant le degr&#233; de certitude de la pr&#233;sence d&#8217;une relation entre les deux
entit&#233;s li&#233;es. La figure 2 donne l&#8217;exemple d&#8217;un tel graphe restreint aux entit&#233;s li&#233;es &#224; l&#8217;&#233;v&#233;nement
principal du document, compte tenu de notre focalisation applicative.
</p>
<p>Texte
</p>
<p>{PRINCIPAL}Un s&#233;isme de magnitude 7,2 sur l'&#233;chelle de Richter 
a frapp&#233; samedi  la ville de Kurihara (pr&#233;fecture de
Miyagi). 
</p>
<p>{PRINCIPAL}Le tremblement s'est produit &#224; 08H43, heure locale.
</p>
<p>{PRINCIPAL}La secousse  a &#233;t&#233; ressentie jusqu'&#224; Tokyo, &#224; 500 
kilom&#232;tres au sud des pr&#233;fectures japonaises d'Iwate  et de 
Miyagi, principales zones touch&#233;es.
</p>
<p>{CONTEXTE}Les s&#233;ismes sont courants au Japon, qui est l'une des 
zones sismiques les plus actives de la plan&#232;te.
</p>
<p>{SECONDAIRE}En octobre 2004, un s&#233;isme d'une magnitude de 
6,8 avait touch&#233; la r&#233;gion de Niigata, dans le nord du pays.
</p>
<p>Graphe d'entit&#233;s
</p>
<p>w
6
</p>
<p>w
5
</p>
<p>w
3
</p>
<p>w
4
</p>
<p>w
2
</p>
<p>w
1
</p>
<p>w
7
</p>
<p>samedi 7,2
</p>
<p>Kurihara
</p>
<p>Iwate
</p>
<p>08h43
</p>
<p>Tokyo
</p>
<p>w
8w
</p>
<p>10
</p>
<p>w
9
</p>
<p>Miyagi
</p>
<p>s&#233;isme
tremblement
</p>
<p>secousse
</p>
<p>Wi : poids de relation
</p>
<p>FIG. 2 &#8211; Exemple de graphe d&#8217;entit&#233;s
</p>
<p>La construction du graphe d&#8217;entit&#233;s d&#8217;un texte commence en d&#233;terminant si les couples de
mentions d&#8217;entit&#233;s ou d&#8217;&#233;v&#233;nements apparaissant dans une m&#234;me phrase sont sous-tendus par
une relation propre au type d&#8217;&#233;v&#233;nement cible, sans n&#233;anmoins pr&#233;ciser cette relation. &#192; l&#8217;instar
des travaux existants comparables, nous avons r&#233;alis&#233; cette d&#233;termination par le biais d&#8217;un
classifieur statistique. Dans ce cadre, l&#8217;utilisation d&#8217;un ensemble de traits lexicalis&#233;s constitue
l&#8217;approche dominante (Afzal, 2009; Gu et Cercone, 2006; Wick et al., 2006), m&#234;me si (Liu et al.,
2007) se d&#233;marque en conjuguant ces traits lexicalis&#233;s avec des traits de nature syntaxique.
&#192; l&#8217;inverse, nous avons construit un mod&#232;le n&#8217;int&#233;grant que des traits syntaxiques et faisant
abstraction des informations lexicales (mots sous forme fl&#233;chie ou lemmes) afin de lui conf&#233;rer
un degr&#233; de g&#233;n&#233;ralit&#233; plus important susceptible de rendre son adaptation &#224; un autre domaine
plus facile. Pour &#233;valuer l&#8217;int&#233;r&#234;t relatif des traits syntaxiques et lexicaux, nous avons entra&#238;n&#233;
diff&#233;rents types de classifieurs avec les trois ensembles de traits d&#233;taill&#233;s dans le tableau 1.
</p>
<p>&#8211; LEXI-BASE : m&#234;me ensemble de traits lexicalis&#233;s que (Afzal, 2009) ;
&#8211; LEXI-SYN : ensemble de traits conjuguant traits lexicalis&#233;s et traits syntaxiques, dans le
</p>
<p>prolongement de (Liu et al., 2007)1 ;
&#8211; NON-LEXI-SYN : m&#234;me ensemble de traits que LEXI-SYN, &#224; l&#8217;exception des traits lexicalis&#233;s.
</p>
<p>Comme dans (McDonald et al., 2005) et (Liu et al., 2007), le poids associ&#233; &#224; chaque relation
trouv&#233;e est le score de confiance du classifieur l&#8217;ayant mise en &#233;vidence, ce score &#233;tant compris
dans l&#8217;intervalle [0,1] pour tous les classifieurs exp&#233;riment&#233;s &#224; la section 6.2.
</p>
<p>La seconde &#233;tape de construction du graphe d&#8217;entit&#233;s est une forme de condensation r&#233;sultant de
la fusion des mentions d&#8217;entit&#233;s et d&#8217;&#233;v&#233;nements identifi&#233;es comme faisant r&#233;f&#233;rence &#224; une m&#234;me
</p>
<p>1Nous n&#8217;utilisons pas exactement les m&#234;mes traits que (Liu et al., 2007) car certains d&#8217;entre eux ne sont applicables
que dans le domaine biom&#233;dical.
</p>
<p>34</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traits LEXI-BASE LEXI-SYN NON-LEXI-SYN
Type d&#8217;entit&#233; de E1 ; type d&#8217;entit&#233; de E2 &#216; &#216; &#216;
Cat&#233;gories morpho-syntaxiques de E1 ; cat. morpho-synt. de E2 &#216; &#216; &#216;
Mots constitutifs de E1 ; mots constitutifs de E2 &#216;
Bigrammes de mots de E1 ; bigrammes de mots de E2 &#216; &#216;
Mots situ&#233;s entre E1 et E2 &#216; &#216;
Bigrammes de mots situ&#233;s entre E1 et E2 &#216; &#216;
Cat&#233;gories morpho-syntaxiques situ&#233;es entre E1 et E2 &#216; &#216; &#216;
Nombre de mots situ&#233;s entre E1 et E2 &#216; &#216; &#216;
Bigrammes de cat&#233;gories morpho-syntaxiques entre E1 et E2 &#216; &#216;
Nombre de relations syntaxiques entre E1 et E2 &#216; &#216;
Chemin syntaxique entre E1 et E2 &#216; &#216;
Position / un &#233;v&#233;nement + cat&#233;gorie morpho-syntaxique1 &#216; &#216;
Nombre d&#8217;entit&#233;s situ&#233;es entre E1 et E2 &#216; &#216;
Nombre de mentions d&#8217;&#233;v&#233;nement entre E1 et E2 &#216; &#216;
Cat&#233;gorie morpho-syntaxique des deux mots avant/apr&#232;s E1 &#216; &#216;
Cat&#233;gorie morpho-syntaxique des deux mots avant/apr&#232;s E2 &#216; &#216;
1 Si E1, respectivement E2, est une mention d&#8217;&#233;v&#233;nement, associe la position de E2, respectivement E1, par
</p>
<p>rapport &#224; elle (avant ou apr&#232;s) et sa cat&#233;gorie morpho-syntaxique.
</p>
<p>TAB. 1 &#8211; Traits utilis&#233;s pour la classification de relations binaires
</p>
<p>entit&#233; ou &#224; un m&#234;me &#233;v&#233;nement. Pour les &#233;v&#233;nements, cette fusion s&#8217;appuie sur la segmentation
&#233;v&#233;nementielle : toutes les mentions d&#8217;&#233;v&#233;nements apparaissant dans un segment &#233;tiquet&#233;
PRINCIPAL sont suppos&#233;es faire r&#233;f&#233;rence &#224; l&#8217;&#233;v&#233;nement principal du document et sont donc
fusionn&#233;es (cf. fusion de secousse, s&#233;isme et tremblement au niveau de la figure 2). Pour les entit&#233;s,
la fusion se fait sur l&#8217;&#233;galit&#233; de leur forme normalis&#233;e dans le cas des dates, heures et magnitudes
et sur l&#8217;&#233;galit&#233; de la forme trouv&#233;e dans les textes pour les lieux. Lorsque l&#8217;op&#233;ration de fusion
entra&#238;ne la pr&#233;sence de plusieurs relations entre deux entit&#233;s ou entre une entit&#233; et l&#8217;&#233;v&#233;nement
principal, ces relations sont elles-m&#234;mes fusionn&#233;es en conservant le poids le plus &#233;lev&#233;.
</p>
<p>5.2 Remplissage du formulaire
</p>
<p>L&#8217;&#233;tape de remplissage du formulaire a pour objectif de choisir pour chaque r&#244;le de ce formulaire
l&#8217;entit&#233; du graphe construit &#224; l&#8217;&#233;tape pr&#233;c&#233;dente ayant un type compatible avec le type d&#8217;entit&#233;
attendu pour ce r&#244;le et se montrant la plus &#224; m&#234;me de le remplir. Cette s&#233;lection s&#8217;accompagne
implicitement du choix de ne pas remplir certains r&#244;les du formulaire lorsque les informations
correspondantes sont absentes du texte. Ce probl&#232;me de remplissage de formulaire peut &#234;tre
assimil&#233; au probl&#232;me de la reconstruction d&#8217;une relation complexe tel qu&#8217;il est envisag&#233; dans
(Afzal, 2009; McDonald et al., 2005). Par exemple, le graphe de la figure 2 comporte une
ambigu&#239;t&#233; relative &#224; l&#8217;entit&#233; occupant le r&#244;le de lieu de l&#8217;&#233;v&#233;nement et impose un choix entre :
Kurihara, Tokyo, Miyagi ou Iwate. Dans cette perspective, nous avons test&#233; plusieurs approches :
</p>
<p>Position est une heuristique simple mais tr&#232;s efficace dans le contexte consid&#233;r&#233; qui s&#233;lectionne
pour chaque type d&#8217;entit&#233;s la premi&#232;re mention apparaissant dans un segment relatif &#224;
l&#8217;&#233;v&#233;nement principal.
</p>
<p>35</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Confiance retient pour chaque type d&#8217;entit&#233;s l&#8217;entit&#233; li&#233;e &#224; l&#8217;&#233;v&#233;nement avec le score de confiance
(score du classifieur utilis&#233;) le plus grand.
</p>
<p>PageRank est une approche exploitant la structure globale du graphe d&#8217;entit&#233;s par le biais de
l&#8217;algorithme PageRank. Ce dernier permet en l&#8217;occurrence d&#8217;attribuer un score d&#8217;importance
&#224; chaque entit&#233; en fonction de sa connectivit&#233; avec les autres entit&#233;s et donc de les ordonner.
Pour chaque type d&#8217;entit&#233;s, est ainsi retenue l&#8217;entit&#233; ayant le plus haut score PageRank.
</p>
<p>Vote impl&#233;mente une strat&#233;gie de vote majoritaire reposant sur les approches Position, Confiance
et PageRank. Pour chaque type d&#8217;entit&#233;s, l&#8217;entit&#233; ayant &#233;t&#233; s&#233;lectionn&#233;e par le plus grand
nombre d&#8217;approches est ainsi adopt&#233;e.
</p>
<p>Hybride applique pour chaque type d&#8217;entit&#233;s celle, parmi les strat&#233;gies pr&#233;c&#233;dentes, donnant le
meilleur r&#233;sultat pour ce type d&#8217;entit&#233;s.
</p>
<p>La sortie des approches Confiance, PageRank, Vote et Hybride est en outre compl&#233;t&#233;e par l&#8217;approche
Position dans le cas o&#249; aucune entit&#233; n&#8217;est s&#233;lectionn&#233;e pour un type donn&#233;. Il est en effet possible
que certaines entit&#233;s d&#8217;un formulaire apparaissent dans un texte sans &#234;tre associ&#233;es dans une
phrase &#224; une mention d&#8217;entit&#233; ou d&#8217;&#233;v&#233;nement, ce qui interdit leur choix par les approches
reposant sur le graphe d&#8217;entit&#233;s.
</p>
<p>6 &#201;valuation
</p>
<p>Nous pr&#233;sentons dans cette section une &#233;valuation de notre approche de remplissage de formu-
lairessur un corpus de d&#233;p&#234;ches de presse concernant les &#233;v&#233;nements sismiques, corpus d&#233;crit &#224;
la section 6.1. Une &#233;valuation diff&#233;renci&#233;e de chaque &#233;tape de notre approche a &#233;t&#233; men&#233;e : les
r&#233;sultats de l&#8217;&#233;valuation de la segmentation &#233;v&#233;nementielle de textes sont pr&#233;sent&#233;s en d&#233;tail
dans (Jean-Louis et al., 2010) et ont montr&#233; que le mod&#232;le de segmentation par CRF atteint
un F-score de 92,71% pour la d&#233;tection de l&#8217;&#233;v&#233;nement principal, ce qui constitue une bonne
base pour l&#8217;application des &#233;tapes suivantes de notre approche. Les sections 6.2 et 6.3 pr&#233;sentent
respectivement l&#8217;&#233;valuation de la construction du graphe d&#8217;entit&#233;s et de la s&#233;lection des entit&#233;s.
Une &#233;valuation plus cibl&#233;e de l&#8217;impact de la segmentation en &#233;v&#233;nements sur le r&#233;sultat final est
pr&#233;sent&#233;e &#224; la section 6.4 et une analyse des principales erreurs rencontr&#233;es et de leur r&#233;partition
est pr&#233;sent&#233;e dans la section 6.5.
</p>
<p>6.1 Corpus
</p>
<p>Les travaux pr&#233;sent&#233;s dans cet article ont &#233;t&#233; d&#233;velopp&#233;s dans le cadre d&#8217;une application d&#233;di&#233;e
&#224; la surveillance des &#233;v&#233;nements sismiques &#224; partir de d&#233;p&#234;ches de presse. Dans ce cadre, un
formulaire est associ&#233; &#224; un &#233;v&#233;nement sismique et r&#233;sume ses principales caract&#233;ristiques &#224;
savoir, la date, l&#8217;heure, le lieu, la magnitude, les coordonn&#233;es g&#233;ographiques ainsi que la mention
d&#8217;&#233;v&#233;nement qui lui est associ&#233;e (s&#233;isme, r&#233;plique, etc.)2. La figure 1 donne deux exemples
illustratifs du formulaire que nous consid&#233;rons. Notons que dans l&#8217;application vis&#233;e, nous ne
cherchons &#224; extraire que les &#233;v&#233;nements principaux et ne sommes donc pas int&#233;ress&#233;s par
l&#8217;&#233;v&#233;nement secondaire EV2 de cette d&#233;p&#234;che.
</p>
<p>2Les dommages li&#233;s aux s&#233;ismes n&#8217;ont pas &#233;t&#233; consid&#233;r&#233;s car leur expression est plus vari&#233;e et leur identification
n&#233;cessiterait une analyse linguistique plus profonde.
</p>
<p>36</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>[POSITIVE] : Cette secousse, d&#8217;une magnitude de 6,4 sur l&#8217;&#233;chelle de Richter, est la plus forte
enregistr&#233;e depuis le tremblement de terre d&#8217;une magnitude de 8 qui a ravag&#233; le Sichuan, a
pr&#233;cis&#233; un responsable du bureau de sismologie de cette province.
</p>
<p>[NEGATIVE] : Cette secousse, d&#8217;une magnitude de 6,4 sur l&#8217;&#233;chelle de Richter, est la plus forte
enregistr&#233;e depuis le tremblement de terre d&#8217;une magnitude de 8 qui a ravag&#233; le Sichuan, a
pr&#233;cis&#233; un responsable du bureau de sismologie de cette province.
</p>
<p>FIG. 3 &#8211; Exemples positif et n&#233;gatif de pr&#233;sence d&#8217;une relation entre deux entit&#233;s
</p>
<p>L&#8217;ensemble des exp&#233;riences ont &#233;t&#233; effectu&#233;es &#224; partir d&#8217;un corpus compos&#233; de 501 d&#233;p&#234;ches
de presse en fran&#231;ais concernant le domaine sismique. Ces d&#233;p&#234;ches ont &#233;t&#233; collect&#233;es entre fin
f&#233;vrier 2008 et d&#233;but septembre 2008, en provenance pour partie d&#8217;un flux de d&#233;p&#234;ches AFP
(1/3 du corpus), et pour partie de d&#233;p&#234;ches collect&#233;es sur Google Actualit&#233;s (2/3 du corpus). Le
corpus a &#233;t&#233; manuellement annot&#233; par des analystes du domaine qui ont rempli manuellement les
formulaires pour chaque s&#233;isme principal d&#8217;un document. Au total, les annotateurs ont identifi&#233;
2 775 entit&#233;s, r&#233;parties en 6 types d&#8217;entit&#233;s : mention d&#8217;&#233;v&#233;nement (18%), lieux (34%), date
(17%), heure (12%), magnitude (17%) et coordonn&#233;es g&#233;ographiques (1%)3.
</p>
<p>Concernant l&#8217;analyse linguistique des documents, nous avons appliqu&#233; la cha&#238;ne de traitements
linguistiques de l&#8217;analyseur LIMA (Besan&#231;on et al., 2010) r&#233;alisant les &#233;tapes de tokenisation,
d&#233;tection des fins de phrases, d&#233;sambigu&#239;sation morpho-syntaxique, reconnaissance des temps
des verbes, reconnaissance des entit&#233;s nomm&#233;es et analyse syntaxique.
</p>
<p>6.2 Construction du graphe d&#8217;entit&#233;s
</p>
<p>La m&#233;thode propos&#233;e pour la construction du graphe d&#8217;entit&#233;s s&#8217;appuie sur un classifieur pour
d&#233;terminer la pr&#233;sence/absence d&#8217;une relation entre deux entit&#233;s au sein d&#8217;une m&#234;me phrase.
Nous avons exp&#233;riment&#233; diff&#233;rents types de classifieurs statistiques, utilisant chacun les trois
ensembles de traits pr&#233;sent&#233;s &#224; la section 5.1 (LEXI-BASE, LEXI-SYN, NON-LEXI-SYN). Pour
l&#8217;annotation des relations binaires entre entit&#233;s, nous avons consid&#233;r&#233; un sous-ensemble du
corpus compos&#233; de 44 d&#233;p&#234;ches. Sur ce sous-ensemble, nous avons obtenu 5 000 relations
binaires, parmi lesquelles 969 relations sont exprim&#233;es &#224; l&#8217;int&#233;rieur de la m&#234;me phrase. Parmi
celles-ci, 43 relations ont &#233;t&#233; &#233;cart&#233;es &#224; cause d&#8217;erreurs de reconnaissance des entit&#233;s (par
exemple, lorsqu&#8217;une entit&#233; consid&#233;r&#233;e est en fait incluse dans une entit&#233; plus large non reconnue
&#224; cause de son type). Les autres relations ont servi pour l&#8217;entra&#238;nement des classifieurs : 690
pour la cat&#233;gorie POSITIVE, dans laquelle les deux entit&#233;s font r&#233;f&#233;rence au m&#234;me &#233;v&#233;nement
sismique et 236 pour la cat&#233;gorie NEGATIVE, dans laquelle les deux entit&#233;s sont associ&#233;es &#224; des
&#233;v&#233;nements sismiques diff&#233;rents. La figure 3 illustre des relations pour les deux cat&#233;gories.
</p>
<p>Ce corpus annot&#233; nous a servi &#224; tester trois types de classifieurs4 : Bay&#233;sien Na&#239;f (NB), Maximum
d&#8217;Entropie (ME) et Arbres de d&#233;cision (DT). Nous reportons dans le tableau 2 les r&#233;sultats
</p>
<p>3La possibilit&#233; a &#233;t&#233; laiss&#233;e aux annotateurs de retenir plus d&#8217;une entit&#233; pour le m&#234;me r&#244;le lorsque plusieurs variantes
&#233;taient mentionn&#233;es et &#233;taient jug&#233;es &#233;galement pertinentes. Par exemple, pour les lieux, pouvaient &#234;tre annot&#233;s &#224; la fois
un nom de ville et un nom de pays.
</p>
<p>4Nous avons utilis&#233; l&#8217;impl&#233;mentation fournie par l&#8217;outil MALLET (http://mallet.cs.umass.edu).
</p>
<p>37</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>obtenus par chaque algorithme, en fonction de l&#8217;ensemble de traits utilis&#233; en termes de rappel
(R), pr&#233;cision (P) et F1-mesure (F). Les r&#233;sultats sont obtenus par une validation crois&#233;e (4/5
des donn&#233;es servent &#224; l&#8217;entra&#238;nement et 1/5 pour le test). En compl&#233;ment, nous fournissons
pour comparaison les r&#233;sultats d&#8217;une approche basique (Baseline) qui attribue la cat&#233;gorie la plus
fr&#233;quente (POSITIVE) &#224; toutes les relations.
</p>
<p>Ensemble de traits Classifieur R(%) P(%) F(%)
LEXI-SYN ME 96,30 95,92 96,10
LEXI-BASE ME 91,22 96,09 93,57
NON-LEXI-SYN ME 91,66 94,99 93,26
LEXI-SYN DT 89,01 96,45 92,55
LEXI-SYN NB 93,44 90,69 92,02
NON-LEXI-SYN DT 91,17 88,74 89,83
NON-LEXI-SYN NB 89,58 89,23 89,37
LEXI-BASE DT 84,35 94,70 89,16
LEXI-BASE NB 86,73 87,86 87,27
Baseline &#8211; 100,00 25,50 40,49
</p>
<p>TAB. 2 &#8211; &#201;valuation du classifieur de relations binaires
</p>
<p>En premier lieu, les r&#233;sultats du tableau 2 montrent l&#8217;int&#233;r&#234;t d&#8217;utiliser des traits de nature
syntaxique : les scores obtenus &#224; partir de l&#8217;ensemble LEXI-SYN d&#233;passent ceux de l&#8217;ensemble
LEXI-BASE pour les trois mod&#232;les. De plus, l&#8217;ensemble de traits non lexicalis&#233;s NON-LEXI-SYN
obtient des scores &#233;quivalents &#224; ceux de l&#8217;ensemble LEXI-BASE, ce qui est int&#233;ressant pour obtenir
des mod&#232;les plus g&#233;n&#233;riques. Concernant les algorithmes d&#8217;apprentissage, les performances
s&#8217;organisent selon la hi&#233;rarchie ME &gt; DT &gt; NB. Notons que (Afzal, 2009) obtient une hi&#233;rarchie
diff&#233;rente (DT &gt; ME &gt; NB) mais utilise un corpus diff&#233;rent et dans une autre langue, ce qui rend
la comparaison difficile. En termes de performances g&#233;n&#233;rales, nos r&#233;sultats sont comparables &#224;
ceux pr&#233;sent&#233;s par (Afzal, 2009), ses meilleurs scores &#233;tant R=95%|P=87%|F=91%, obtenus
avec des arbres de d&#233;cision. Pour la suite de notre d&#233;marche, nous avons conserv&#233; le mod&#232;le
Maximum d&#8217;Entropie reposant sur l&#8217;ensemble de traits NON-LEXI-SYN plut&#244;t que l&#8217;ensemble
LEXI-SYN. Notre motivation pour ce faire est que l&#8217;ensemble NON-LEXI-SYN permet d&#8217;obtenir
des scores satisfaisants sans &#234;tre fond&#233; sur des informations fortement li&#233;es &#224; un domaine, ce qui
n&#8217;est pas le cas pour les traits lexicalis&#233;s.
</p>
<p>6.3 S&#233;lection des entit&#233;s et remplissage des formulaires
</p>
<p>Concernant l&#8217;&#233;valuation des strat&#233;gies de s&#233;lection, l&#8217;ensemble des documents du corpus a &#233;t&#233;
utilis&#233;. Nous reportons dans le tableau 3 les scores de remplissage des formulaires pour ces
diff&#233;rentes strat&#233;gies, agr&#233;g&#233;s pour l&#8217;ensemble des r&#244;les du formulaire, en termes de rappel (R),
pr&#233;cision (P) et F1-mesure (F).
</p>
<p>Ces r&#233;sultats confirment en premier lieu que notre m&#233;thode de r&#233;f&#233;rence Position est caract&#233;ris&#233;e
par un niveau d&#233;j&#224; tr&#232;s &#233;lev&#233;. De plus, cette m&#233;thode permet d&#8217;obtenir des performances
l&#233;g&#232;rement sup&#233;rieures &#224; la strat&#233;gie PageRank, ce qui peut se justifier en partie par le fait que la
strat&#233;gie PageRank repose uniquement sur la structure du graphe, sans tenir compte des poids
sur les arcs. Par cons&#233;quent, les entit&#233;s se trouvant dans des zones dens&#233;ment connect&#233;es du
</p>
<p>38</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Strat&#233;gie de s&#233;lection R(%) P(%) F(%)
Hybride 77,55 76,87 77,15
Vote 74,93 74,27 74,54
Confiance 74,89 74,16 74,47
Position 73,40 73,06 73,17
PageRank 72,41 71,73 72,01
</p>
<p>TAB. 3 &#8211; &#201;valuation du remplissage des formulaires &#224; partir des strat&#233;gies de s&#233;lection
</p>
<p>graphe obtiennent de meilleurs scores que les autres, ind&#233;pendamment des poids sur les arcs. Ce
probl&#232;me pourrait &#234;tre, dans une certaine mesure, minimis&#233; en adoptant la version pond&#233;r&#233;e
de l&#8217;algorithme PageRank propos&#233;e dans (Mihalcea, 2004). D&#8217;autre part, les scores du tableau 3
montrent que la meilleure strat&#233;gie de s&#233;lection est l&#8217;approche Hybride, ce qui est coh&#233;rent
avec ses objectifs de faire correspondre &#224; un r&#244;le du formulaire la strat&#233;gie qui lui est la mieux
adapt&#233;e.
</p>
<p>6.4 Impact de la segmentation en &#233;v&#233;nements
</p>
<p>Dans cette section, nous proposons d&#8217;&#233;valuer l&#8217;impact de notre approche de segmentation en
&#233;v&#233;nements sur la t&#226;che de remplissage des formulaires. Cette segmentation vise &#224; identifier les
passages pertinents afin de focaliser le processus d&#8217;extraction. Cependant, tous les documents ne
mentionnent pas plusieurs &#233;v&#233;nements sismiques et dans le cas des documents ne mentionnant
qu&#8217;un seul &#233;v&#233;nement, l&#8217;usage de la segmentation &#233;v&#233;nementielle se justifie moins (toutes les
phrases font a priori r&#233;f&#233;rence au m&#234;me &#233;v&#233;nement si elle comporte une mention d&#8217;&#233;v&#233;nement).
Celle-ci est d&#232;s lors susceptible d&#8217;apporter essentiellement des perturbations dans la mesure o&#249;
ses r&#233;sultats ne sont n&#233;cessairement pas parfaits.
</p>
<p>Notre but, dans cette section, est donc de mesurer l&#8217;impact de la segmentation en &#233;v&#233;nements
sur les documents ne faisant r&#233;f&#233;rence qu&#8217;&#224; un seul &#233;v&#233;nement en comparaison avec ceux faisant
r&#233;f&#233;rence &#224; plusieurs &#233;v&#233;nements. Notre intuition est que la segmentation devrait avoir un impact
limit&#233; sur les documents mono-&#233;v&#233;nements et devrait am&#233;liorer les scores pour les documents
multi-&#233;v&#233;nements. Afin de v&#233;rifier cette hypoth&#232;se, nous avons manuellement divis&#233; le corpus
initial en deux ensembles en fonction du nombre d&#8217;&#233;v&#233;nements sismiques mentionn&#233;s par les
textes. Nous avons ainsi obtenu 227 documents multi-&#233;v&#233;nements (M) et 274 documents mono-
&#233;v&#233;nements (S). Les r&#233;sultats du remplissage de formulaires pour chaque ensemble, avec ou
sans segmentation, sont pr&#233;sent&#233;s dans le tableau 4 en termes de F1-mesure et agr&#233;g&#233;s pour
l&#8217;ensemble des r&#244;les du formulaire.
</p>
<p>Concernant les documents mono-&#233;v&#233;nements, les scores du tableau 4 montrent que les strat&#233;gies
les plus performantes n&#8217;utilisent pas de segmentation, bien que les diff&#233;rences ne soient pas
tr&#232;s importantes (+0,71% en moyenne). &#192; l&#8217;oppos&#233;, les strat&#233;gies &#224; base de segmentation sont
plus performantes pour les documents multi-&#233;v&#233;nements (+2,74% en moyenne). De plus, notre
strat&#233;gie la plus performante, approche Hybride avec segmentation, obtient de meilleurs scores
que notre approche de r&#233;f&#233;rence, Position sans segmentation, et ce, pour les deux ensembles
de documents. Plus g&#233;n&#233;ralement, les r&#233;sultats d&#233;montrent que notre segmentation n&#8217;introduit
qu&#8217;une perte limit&#233;e pour les documents mono-&#233;v&#233;nements et am&#233;liore les performances pour
</p>
<p>39</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sans Avec
segmentation segmentation
</p>
<p>Strat&#233;gie S(%) M(%) S(%) M(%)
Hybride 79,20 73,61 78,34 75,61
Vote 77,67 68,68 76,89 71,81
Confiance 72,55 66,07 71,79 69,10
Position 73,96 73,16 73,07 73,10
PageRank 70,92 59,72 70,67 65,32
</p>
<p>TAB. 4 &#8211; Impact de la segmentation sur les documents mono/multi-&#233;v&#233;nements (F1-mesure)
</p>
<p>les documents multi-&#233;v&#233;nements.
</p>
<p>6.5 Analyse des erreurs
</p>
<p>Dans la perspective d&#8217;approfondir les &#233;valuations de nos strat&#233;gies de remplissage de formulaire,
nous avons men&#233; une analyse des erreurs en cherchant &#224; identifier pr&#233;cis&#233;ment les causes de la
pr&#233;sence d&#8217;une entit&#233; incorrecte (s&#233;lection d&#8217;une mauvaise entit&#233; pour un r&#244;le) ou d&#8217;une entit&#233;
manquante (pas d&#8217;entit&#233; s&#233;lectionn&#233;e pour un r&#244;le) dans un formulaire. Dans ce cadre nous
avons identifi&#233; trois types d&#8217;erreurs pr&#233;pond&#233;rants :
</p>
<p>&#8211; les erreurs de reconnaissance des entit&#233;s nomm&#233;es : l&#8217;entit&#233; n&#8217;est pas reconnue lors de l&#8217;analyse
linguistique du texte ;
</p>
<p>&#8211; les erreurs de segmentation en &#233;v&#233;nements : l&#8217;entit&#233; est identifi&#233;e lors de l&#8217;analyse linguistique
mais elle appartient &#224; une phrase qui n&#8217;est pas associ&#233;e &#224; l&#8217;&#233;v&#233;nement principal ;
</p>
<p>&#8211; les erreurs de s&#233;lection des entit&#233;s : l&#8217;entit&#233; se trouve dans le segment de l&#8217;&#233;v&#233;nement principal
mais une autre entit&#233; a &#233;t&#233; retenue comme valeur pour le r&#244;le dans le formulaire ;
</p>
<p>Le tableau 5 pr&#233;sente la r&#233;partition de chaque type d&#8217;erreurs, en comparaison avec le nombre
d&#8217;entit&#233;s correctement rep&#233;r&#233;es, pour deux approches de construction des formulaires : la
premi&#232;re correspond &#224; la s&#233;lection &#224; base d&#8217;heuristique, sans segmentation (NonSeg+Position) ;
la seconde s&#8217;appuie sur la segmentation en &#233;v&#233;nements et la strat&#233;gie Seg+Hybride.
</p>
<p>Type d&#8217;erreurs NonSeg+Position Seg+Hybride
Correct 71,6% 75,1%
S&#233;lection d&#8217;entit&#233;s 25,6% 21,2%
Reconnaissance d&#8217;entit&#233;s 2,8% 2,8%
Segmentation &#8211; 0,8%
</p>
<p>TAB. 5 &#8211; R&#233;partition des erreurs pour le remplissage de formulaires
</p>
<p>Le graphe montre que la strat&#233;gie de r&#233;f&#233;rence Position permet d&#8217;identifier correctement une
part cons&#233;quente des entit&#233;s (71,6%) mais qu&#8217;un nombre important d&#8217;erreurs d&#8217;attribution de
r&#244;le dans le formulaire (25,6%) subsiste. Notre meilleure strat&#233;gie r&#233;duit ce type d&#8217;erreur tout
en am&#233;liorant le pourcentage d&#8217;entit&#233;s correctes dans les formulaires. De plus, cette strat&#233;gie
n&#8217;induit qu&#8217;un nombre tr&#232;s limit&#233; d&#8217;erreurs dues &#224; la segmentation en &#233;v&#233;nements (0,8%).
</p>
<p>40</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>7 Conclusion
</p>
<p>La plupart des approches pour l&#8217;extraction d&#8217;information s&#8217;appuient sur des &#233;l&#233;ments au niveau
phrastique pour remplir automatiquement des formulaires et peu sur des informations au niveau
discursif. Dans cet article, nous avons pr&#233;sent&#233; une approche pour le remplissage de formulaires
fond&#233;e sur une segmentation du texte et une s&#233;lection des entit&#233;s s&#8217;appuyant sur un graphe
global de relations entre les entit&#233;s. La segmentation du texte se fait au niveau discursif et utilise
des informations temporelles pour segmenter le texte selon les &#233;v&#233;nements pr&#233;sents en utilisant
un mod&#232;le CRF afin de trouver les phrases les plus pertinentes pour remplir un formulaire donn&#233;.
Ces phrases sont ensuite utilis&#233;es pour construire un graphe d&#8217;entit&#233;s &#224; partir duquel les entit&#233;s
relatives &#224; l&#8217;&#233;v&#233;nement d&#8217;int&#233;r&#234;t sont s&#233;lectionn&#233;es. Nous avons propos&#233; plusieurs strat&#233;gies pour
s&#233;lectionner les entit&#233;s (utilisant la position des entit&#233;s, les scores de confiance des relations ou
la structure du graphe, par l&#8217;utilisation de PageRank) ainsi que plusieurs fa&#231;ons de combiner ces
strat&#233;gies (vote majoritaire ou approche hybride).
</p>
<p>Nous avons &#233;galement pr&#233;sent&#233; une &#233;valuation d&#233;taill&#233;e de notre approche sur un corpus de
d&#233;p&#234;ches de presse concernant les &#233;v&#233;nements sismiques. Cette &#233;valuation a montr&#233; que notre
approche a permis d&#8217;am&#233;liorer le remplissage de formulaire par rapport &#224; une heuristique simple
(mais efficace) consistant &#224; prendre la premi&#232;re entit&#233; du type cherch&#233; pour remplir chaque
champ du formulaire. Les r&#233;sultats ont aussi montr&#233; que notre approche est particuli&#232;rement
adapt&#233;e pour les documents mentionnant plusieurs &#233;v&#233;nements de m&#234;me nature. Finalement,
une analyse des erreurs a montr&#233; que l&#8217;on peut encore am&#233;liorer ces r&#233;sultats puisque la part
d&#8217;erreurs li&#233;e &#224; la s&#233;lection des entit&#233;s reste de 21%.
</p>
<p>Concernant les perspectives de nos travaux, nous allons exp&#233;rimenter la g&#233;n&#233;ralisation de notre
approche de remplissage de formulaires &#224; d&#8217;autres contextes, et plus pr&#233;cis&#233;ment, d&#8217;autres
langues et d&#8217;autres domaines. Nous avons d&#233;j&#224; obtenu des r&#233;sultats prometteurs en testant la
segmentation &#233;v&#233;nementielle sur un ensemble de d&#233;p&#234;ches de presse en anglais, dans le domaine
sismique, avec peu d&#8217;efforts d&#8217;adaptation n&#233;cessaires. En ce qui concerne la g&#233;n&#233;ralisation &#224;
d&#8217;autres domaines, nous planifions des exp&#233;rimentations dans le domaine financier.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AFZAL, N. (2009). Complex Relations Extraction. In Conference on Language &amp; Technology 2009
(CLT&#8217;09), Lahore, Pakistan.
</p>
<p>BESAN&#199;ON, R., de CHALENDAR, G., FERRET, O., GARA, F. et SEMMAR, N. (2010). LIMA : A Multilin-
gual Framework for Linguistic Analysis and Linguistic Resources Development and Evaluation.
In 7th Conference on Language Resources and Evaluation (LREC 2010), Valletta, Malta.
</p>
<p>CHAMBERS, N. et JURAFSKY, D. (2011). Template-Based Information Extraction without the
Templates. In 49th Annual Meeting of the Association for Computational Linguistics : Human
Language Technologies, pages 976&#8211;986, Portland, Oregon, USA.
</p>
<p>DODDINGTON, G., MITCHELL, A., PRZYBOCKI, M., RAMSHAW, L., STRASSEL, S. et WEISCHEDEL, R.
(2004). The Automatic Content Extraction (ACE) Program &#8211; Tasks, Data, and Evaluation. In 4th
</p>
<p>Conference on Language Resources and Evaluation (LREC 2004), pages 837&#8211;840, Lisbon, Portugal.
</p>
<p>FENG, D., BURNS, G. et HOVY, E. (2007). Extracting Data Records from Unstructured Biomedical
Full Text. In EMNLP-CoNLL&#8217;07, pages 837&#8211;846, Prague, Czech Republic.
</p>
<p>41</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GOERTZEL, B., PINTO, H., HELJAKKA, A., ROSS, M., PENNACHIN, C. et GOERTZEL, I. (2006). Using
Dependency Parsing and Probabilistic Inference to Extract Relationships between Genes, Proteins
and Malignancies Implicit Among Multiple Biomedical Research Abstracts. In HLT-NAACL BioNLP
Workshop on Linking Natural Language and Biology, pages 104&#8211;111, New York, USA.
</p>
<p>GRISHMAN, R. et SUNDHEIM, B. (1996). Message Understanding Conference-6 : A Brief History.
In 16th International Conference on Computational linguistics (COLING&#8217;96), pages 466&#8211;471,
Copenhagen, Denmark.
</p>
<p>GU, Z. et CERCONE, N. (2006). Segment-based hidden Markov models for information extraction.
In 21st International Conference on Computational Linguistics and 44th Annual Meeting of the
Association for Computational Linguistics, pages 481&#8211;488, Sydney, Australia.
</p>
<p>JEAN-LOUIS, L., BESAN&#199;ON, R. et FERRET, O. (2010). Using temporal cues for segmenting texts
into events. In 7th International Conference on Natural Language Processing (IceTAL 2010), pages
150&#8211;161. Springer Berlin / Heidelberg.
</p>
<p>JEAN-LOUIS, L., BESAN&#199;ON, R. et FERRET, O. (2011). Text segmentation and graph-based method
for template filling in information extraction. In 5th International Joint Conference on Natural
Language Processing (IJCNLP 2011), pages 723&#8211;731, Chiang Mai, Thailand.
</p>
<p>JI, H., GRISHMAN, R. et TRANG DANG, H. (2010). Overview of the TAC 2010 Knowledge Base
Population Track. In Third Text Analysis Conference (TAC 2010), Gaithersburg, Maryland, USA.
</p>
<p>LAFFERTY, J. D., MCCALLUM, A. et PEREIRA, F. C. N. (2001). Conditional Random Fields :
Probabilistic Models for Segmenting and Labeling Sequence Data. In Eighteenth International
Conference on Machine Learning (ICML&#8217;01), pages 282&#8211;289, San Francisco, CA, USA.
</p>
<p>LIU, Y., SHI, Z. et SARKAR, A. (2007). Exploiting Rich Syntactic Information for Relationship
Extraction from Biomedical Articles. In NAACL-HLT&#8217;07, short paper session, pages 97&#8211;100,
Rochester, New York.
</p>
<p>MANSURI, I. R. et SARAWAGI, S. (2006). Integrating unstructured data into relational databases.
In 22nd International Conference on Data Engineering (ICDE&#8217;06), pages 29&#8211;40, Washington, USA.
</p>
<p>MCDONALD, R., PEREIRA, F., KULICK, S., WINTERS, S., JIN, Y. et WHITE, P. (2005). Simple algorithms
for complex relation extraction with applications to biomedical IE. In ACL 2005, pages 491&#8211;498,
Ann Arbor, Michigan, USA.
</p>
<p>MIHALCEA, R. (2004). Graph-based Ranking Algorithms for Sentence Extraction, Applied to Text
Summarization. In 42st Annual Meeting of the Association for Computational Linguistics (ACL
2004), Barcelona, Spain.
</p>
<p>NAUGHTON, M. (2007). Exploiting Structure for Event Discovery Using the MDI Algorithm. In
45th Annual Meeting of the Association for Computational Linguistics (ACL 2007), pages 31&#8211;36,
Prague, Czech Republic.
</p>
<p>PATWARDHAN, S. et RILOFF, E. (2007). Effective Information Extraction with Semantic Affinity
Patterns and Relevant Regions. In EMNLP-CoNLL&#8217;07, pages 717&#8211;727, Prague, Czech Republic.
</p>
<p>STEVENSON, M. (2006). Fact distribution in Information Extraction. Language Resources and
Evaluation, 40(2):183&#8211;201.
</p>
<p>TURMO, J., AGENO, A. et CATAL&#192;, N. (2006). Adaptive information extraction. ACM Computer
Surveys, 38(2):1&#8211;47.
</p>
<p>WICK, M., CULOTTA, A. et MCCALLUM, A. (2006). Learning Field Compatibilities to Extract
Database Records from Unstructured Text. In EMNLP&#8217;06, pages 603&#8211;611, Sydney, Australia.
</p>
<p>42</p>

</div></div>
</body></html>