<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers le FDTB : French Discourse Tree Bank</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 471&#8211;478,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Vers le FDTB : French Discourse Tree Bank
</p>
<p>Laurence Danlos Di&#233;go Antolinos-Basso Chlo&#233; Braud Charlotte Roze
ALPAGE, Universit&#233; Paris Diderot, 175 rue du Chevaleret, 75013 Paris
</p>
<p>prenom.nom@linguist.jussieu.fr
</p>
<p>R&#201;SUM&#201;
Nous pr&#233;sentons les premiers pas vers la cr&#233;ation d&#8217;un corpus annot&#233; en discours pour le
fran&#231;ais : le French Discourse TreeBank enrichissant le FTB. La m&#233;thodologie adopt&#233;e s&#8217;inspire
du Penn Discourse TreeBank (PDTB) mais elle s&#8217;en distingue sur au moins deux points &#224; caract&#232;re
th&#233;orique. D&#8217;abord, notre objectif est de fournir une couverture totale d&#8217;un texte du corpus, tandis
que le PDTB ne fournit qu&#8217;une couverture partielle, qui ne peut donc pas &#234;tre qualifi&#233;e d&#8217;analyse
discursive comme celle faite en RST ou SDRT, deux th&#233;ories majeures sur le discours. Ensuite,
nous avons &#233;t&#233; amen&#233;s &#224; d&#233;finir une nouvelle hi&#233;rarchie des relations de discours qui s&#8217;inspire de
RST, de SDRT et du PDTB.
</p>
<p>ABSTRACT
Towards the FDTB : French Discourse Tree Bank
</p>
<p>We present the first steps towards creating an annotated corpus for discourse in French : the
French Discourse Treebank enriching the FTB. Our methodology is based on the Penn Discourse
Treebank (PDTB), but it differs in at least two points of a theoretical nature. First, our goal is to
provide full coverage of a text, while the PDTB provides only partial coverage, which can not
be described as discourse analysis such as the one made in RST or SDRT, two major theories on
discourse. Second, we were led to define a new hierarchy of discourse relations which is based
on RST, SDRT and PDTB.
</p>
<p>MOTS-CL&#201;S : Discours, corpus annot&#233; manuellement, analyse discursive, PDTB, RST, SDRT.
</p>
<p>KEYWORDS: Discourse, manually annotated corpus, discourse analysis, PDTB, RST, SDRT.
</p>
<p>1 Introduction
</p>
<p>Dans l&#8217;id&#233;e de disposer de corpus annot&#233;s pour le fran&#231;ais, nous avons l&#8217;objectif de d&#233;velopper
le FDTB (French Discourse Tree Bank), un corpus annot&#233; pour l&#8217;analyse discursive. Le FDTB
s&#8217;inspire du PDTB (Penn Discourse Tree Bank, (PDTB Group, 2008)) qui ajoute une couche
d&#8217;annotation discursive (manuelle) sur le PTB-v2 (Penn Tree Bank, (Marcus et al., 1999)), corpus
anglais tir&#233; du Wall Street Journal annot&#233; manuellement pour la morpho-syntaxe. De m&#234;me, le
FDTB ajoute une couche d&#8217;annotation discursive sur le FTB (French Tree Bank, (Abeill&#233; et al.,
2003)), corpus fran&#231;ais tir&#233; du journal Le Monde annot&#233; manuellement pour la morpho-syntaxe 1.
</p>
<p>Le PDTB est pr&#233;sent&#233; &#224; la Section 2. Si le FDTB s&#8217;en inspire, il s&#8217;en d&#233;partit n&#233;anmoins sur
</p>
<p>1. Le corpus Annodis (P&#233;ry Woodley et al., 2009) est aussi un corpus fran&#231;ais annot&#233; manuellement pour l&#8217;analyse
discursive. Le FDTB s&#8217;en distingue principalement sur deux points : (i) le fait de disposer d&#8217;une analyse syntaxique
manuelle du corpus et (ii) de s&#8217;appuyer fortement sur les connecteurs de discours (explicites et implicites).
</p>
<p>471</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>certains choix m&#233;thodologiques (Section 3), entre autres, sur le fait que nous voulons une
&#8220;couverture totale&#8221; des articles journalistiques du corpus et non une &#8216;couverture partielle&#8221; comme
obtenue dans le PDTB. Enfin, nous concluons sur quelques remarques concernant les premi&#232;res
annotations effectu&#233;es. Soulignons que celles-ci ne sont que pr&#233;liminaires, la r&#233;alisation d&#8217;un
corpus comme le FDTB &#233;tant un travail de longue haleine qui n&#8217;a commenc&#233; que depuis six mois
(pour l&#8217;instant au sein d&#8217;une seule &#233;quipe).
</p>
<p>2 Pr&#233;sentation du PDTB
</p>
<p>Le PDTB s&#8217;appuie sur trois principes de base qui font consensus dans la communaut&#233; travaillant
sur le Discours :
(i) Un connecteur de discours est un pr&#233;dicat s&#233;mantique &#224; deux arguments d&#233;notant des &#8220;objet
</p>
<p>abstraits&#8221; (not&#233;s AO dans (Asher, 1993) qui a introduit cette notion). Pour une annotation
discursive, il faut donc identifier dans le texte d&#8217;entr&#233;e les connecteurs de discours - ceux-
ci appartiennent &#224; une liste ferm&#233;e d&#8217;&#233;l&#233;ments regroupant principalement conjonctions de
coordination et de subordination et certains adverbiaux - , v&#233;rifier qu&#8217;ils sont bien employ&#233;s
comme connecteurs de discours 2, et enfin d&#233;limiter les empans de texte correspondant aux
arguments de ces connecteurs.
</p>
<p>(ii) Un connecteur de discours lexicalise une &#8220;relation de discours&#8221; (&#8220;relation rh&#233;torique&#8221;) qui
appartient &#224; une liste ferm&#233;e d&#8217;&#233;l&#233;ments organis&#233;s dans une hi&#233;rarchie arborescente, o&#249; les
feuilles sont les relations de discours, les n&#339;uds interm&#233;diaires des classes de relations de plus
en plus g&#233;n&#233;rales en montant vers la racine. Il faut donc pour chaque connecteur de discours
indiquer quelle(s) relation(s) de discours il lexicalise en pr&#233;cisant une feuille de la hi&#233;rarchie
en cas de certitude ou en remontant dans la hi&#233;rarchie en cas de doute.
</p>
<p>(iii) Les relations de discours ne sont pas forc&#233;ment lexicalis&#233;es par un connecteur de discours
(explicite) : elles sont alors inf&#233;rables 3. On parle alors de &#8220;connecteur implicite&#8221; (ou de
&#8220;connecteur vide &#216;&#8221;). Pour une annotation discursive, il faut donc identifier les positions o&#249; on
doit ins&#233;rer un connecteur implicite, et appliquer aux connecteurs implicites les traitements
d&#233;crits en (i) et (ii) pour les connecteurs explicites 4.
</p>
<p>En plus des annotations venant des trois principes de base d&#233;crits ci-dessus, sont annot&#233;es dans
le PDTB pour chaque connecteur de discours (explicite ou implicite) la source de la relation de
discours en jeu et la source de chacun de ses arguments. Ainsi, pour l&#8217;exemple (3a) de (Prasad
et al., 2006) o&#249; le connecteur while est soulign&#233;, ses argument Arg1 et Arg2 rep&#233;r&#233;s par les
segments de texte respectivement en italiques et en gras, le &#8220;segment attributif&#8221; purchasing agent
said, plac&#233; dans une bo&#238;te, se contente d&#8217;indiquer que la source de Arg2 n&#8217;est pas le locuteur
</p>
<p>2. Un m&#234;me mot ou groupe de mots peut avoir un emploi comme connecteur de discours et un emploi non discursif,
comme illustr&#233; pour &#224; ce moment-l&#224; en (1) : en (1a), il s&#8217;agit d&#8217;un emploi discursif mais pas en (1b), (Roze, 2009).
</p>
<p>(1) a. Tu as l&#8217;air de penser qu&#8217;elle n&#8217;est pas honn&#234;te. A ce moment-l&#224;, ne lui raconte rien.
b. Il a commenc&#233; &#224; pleuvoir. Marie est arriv&#233;e &#224; ce moment-l&#224;.
</p>
<p>3. Ainsi en (2a), le locuteur demande &#224; son interlocuteur d&#8217;inf&#233;rer que le contenu propositionnel de la seconde
phrase est la cause du contenu propositionnel de la premi&#232;re phrase sans que la relation de discours Ex plicat ion liant
ces deux AO soient explicitement indiqu&#233;s par un connecteur, comme elle l&#8217;est en (2b).
</p>
<p>(2) a. Fred n&#8217;&#233;tait pas en forme aujourd&#8217;hui. Il a mal dormi la nuit derni&#232;re.
b. Fred n&#8217;&#233;tait pas en forme aujourd&#8217;hui parce qu&#8217;il a mal dormi la nuit derni&#232;re.
</p>
<p>4. En plus des connecteurs explicites ou implicites, le PDTB fait aussi appel aux notions Al t Lex , EntRel, et NoRel,
mais nous n&#8217;avons pas la place de les pr&#233;senter dans cet article.
</p>
<p>472</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>mais les purchasing agents. Les annotations basiques du PDTB sont donc compl&#233;t&#233;es par d&#8217;autres
informations, repr&#233;sent&#233;es ici sous forme de tableau donn&#233; en (3b). Ce tableau indique la valeur
du trait [Source] pour la relation REL (marqu&#233;e par while et identifi&#233;e comme &#233;tant Cont raste),
pour Arg1 et pour Arg2. La valeur &quot;Wr&quot; est utilis&#233;e pour l&#8217;auteur (&#8220;writer&#8221;) du texte, &quot;Inh&quot; indique
que la valeur de [Source] est h&#233;rit&#233;e de celle de REL, &quot;Ot&quot; (&#8220;other&#8221;) est utilis&#233;e pour un (ou
des) individu(s) autre(s) que l&#8217;auteur (il s&#8217;agit des purchasing agents pour Arg2). Le tableau
comporte d&#8217;autres informations relatives &#224; la factivit&#233; et la polarit&#233;, les traits [Type], [Polarity] et
[Determinacy], mais nous ne les d&#233;taillerons pas ici 5.
</p>
<p>(3)a. Factory orders and construction outlays were largely flat in December while
</p>
<p>purchasing agents said manufacturing shrank further in October.
</p>
<p>b.
</p>
<p>REL Arg1 Arg2
[Source] Wr Inh Ot
[Type] Comm Null Comm
[Polarity] Null Null Null
[Determinacy] Null Null Null
</p>
<p>Quelques donn&#233;es quantitatives concernant le PDTB issues de (Prasad et al., 2008) : 18459
connecteurs explicites &#8212; appartenant &#224; une liste ferm&#233;e de 100 &#233;l&#233;ments &#8212; et 16224 connecteurs
implicites ont &#233;t&#233; annot&#233;s. Les relations de discours sont au nombre de 30 r&#233;parties dans quatre
classes majeures (T EM PORAL, CON T INGENCY, COM PARISON et EX PANSION). Ce travail
d&#8217;annotation fut men&#233; sur plusieurs ann&#233;es par des chercheurs senior et des doctorants 6. L&#8217;accord
inter-annotateur est : pour les relations de discours de 77 % sur les feuilles de la hi&#233;rarchie et
de 90% sur les quatre classes majeures ; pour les empans des arguments de 90.2 % pour les
connecteurs explicites et de 85.1 % pour les implicites. Un outil d&#8217;annotation ANNOTATOR a &#233;t&#233;
d&#233;velopp&#233; ainsi qu&#8217;une interface de visualisation des annotations, qui propose entre autres de
voir pour chaque argument de connecteur l&#8217;analyse syntaxique propos&#233;e dans le PTB.
</p>
<p>L&#8217;exploitation des annotations du PDTB a donn&#233; lieu &#224; multe voix de recherche (en plus des
nombreuses statistiques donn&#233;es en annexes du manuel d&#8217;annotation (PDTB Group, 2008)),
citons le parsing de discours (Lin et al., 2011), la classification des connecteurs (Pitler et al.,
2010), et d&#8217;autres r&#233;capitul&#233;es dans (Webber et al., 2011).
</p>
<p>Des projets analogues pour d&#8217;autres langues (dont le chinois, le turc et l&#8217;hindi) sont en cours de
d&#233;veloppement. Et nous nous attaquons maintenant au fran&#231;ais, en effectuant quelques choix
diff&#233;rents de ceux du PDTB, non pas tant &#224; cause de diff&#233;rences entre les langues concern&#233;es &#8212;
l&#8217;anglais et le fran&#231;ais sont relativement tr&#232;s proches &#8212; mais pour des raisons m&#233;thodologiques
ou th&#233;oriques 7.
</p>
<p>5. Comme expliqu&#233; dans (Danlos, 2011), les informations de factivit&#233; utilis&#233;es dans FactBank (Saur&#237; et Pustejovsky,
2009) sont plus &#233;labor&#233;es que celles du PDTB et nous projetons donc d&#8217;utiliser les informations de factivit&#233; &#224; la FactBank
plut&#244;t que celles du PDTB.
</p>
<p>6. D&#8217;apr&#232;s A. Joshi (pc) l&#8217;id&#233;e de d&#233;part &#233;tait de confier ce travail &#224; des &#233;tudiants undergraduate, comme ce fut le cas
pour l&#8217;annotation morpho-syntaxique du PTB. Elle fut abandonn&#233;e car l&#8217;analyse discursive est trop difficile : elle repose en
effet beaucoup sur de l&#8217;interpr&#233;tation qui peut d&#233;raper dans une subjectivit&#233; totale et improductive si elle n&#8217;est pas guid&#233;e
par des principes coercitifs reposant sur des connaissances solides en morpho-syntaxe, s&#233;mantique et pragmatique.
</p>
<p>7. Cette position ne va pas sans inconv&#233;nients, par exemple le fait de ne pas pouvoir comparer directement le FDTB
au PDTB qui fait r&#233;f&#233;rence. N&#233;anmoins, ces inconv&#233;nients sont contre-balanc&#233;s par le fait qu&#8217;il semble n&#233;cessaire de faire
avancer les connaissances sur l&#8217;analyse discursive.
</p>
<p>473</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Diff&#233;rences entre le FDTB et le PDTB
</p>
<p>Nous ne sommes pas d&#8217;accord avec tous les choix m&#233;thodologiques &#8212; et les principes th&#233;oriques
sous-jacents &#8212; du PDTB, et nous nous orientons donc vers d&#8217;autres choix d&#233;crits ci-dessous.
</p>
<p>3.1 Couverture partielle versus totale
</p>
<p>Notre objectif dans le FDTB est d&#8217;avoir une &#8220;couverture totale&#8221; du texte annot&#233; (i.e. un article
du Monde). La couverture totale s&#8217;oppose &#224; la &#8220;couverture partielle&#8221; r&#233;alis&#233;e dans le PDTB.
L&#8217;&#233;quipe du PDTB s&#8217;est fix&#233;e comme objectif d&#8217;annoter les arguments de certains connecteurs
(plus pr&#233;cis&#233;ment, les connecteurs explicites appartenant &#224; une liste d&#8217;une centaine d&#8217;&#233;l&#233;ments,
plus certains connecteurs implicites mais pas tous (PDTB Group, 2008)) : leur objectif n&#8217;est
pas d&#8217;obtenir une analyse discursive compl&#232;te du texte comme celle obtenue en RST (Mann
et Thompson, 1987; Taboada et Mann, 2006) ou SDRT (Asher et Lascarides, 2003) o&#249; un
graphe discursif connexe couvre tous les segments du texte (au m&#234;me titre qu&#8217;une analyse
syntaxique d&#8217;une phrase couvre tous les mots de la phrase). Cette position du PDTB est clairement
revendiqu&#233;e (Webber et al., 2011), mais ce n&#8217;est pas la n&#244;tre car seule une analyse compl&#232;te
d&#8217;un texte permet de rendre compte de sa coh&#233;rence et d&#8217;en extraire des informations ou de le
r&#233;sumer ad&#233;quatement, par exemple.
</p>
<p>Une couverture totale demande de se d&#233;partir du PDTB sur les points suivants :
&#8211; Annoter tous les connecteurs explicites et non pas simplement ceux appartenant &#224; une liste
</p>
<p>de 100 &#233;l&#233;ments d&#233;finis comme les plus fr&#233;quents 8. Le lexique LEXCONN r&#233;pertorie une liste
aussi exhaustive que possible des connecteurs du fran&#231;ais : il comporte plus de 300 &#233;l&#233;ments
(Roze, 2009; Roze et al., 2010). Le FDTB va annoter tous les connecteurs de LEXCONN &#8212;
apr&#232;s d&#233;sambiguation entre emplois discursifs versus non discursifs.
</p>
<p>&#8211; Annoter plus de connecteurs implicites que dans le PDTB. Le PDTB a fortement restreint les
positions o&#249; il &#233;tait licite de poser que deux AO sont reli&#233;s par un connecteur vide (PDTB
Group, 2008). Par exemple, les connecteurs vides des discours en (4) ne sont pas consid&#233;r&#233;s
alors qu&#8217;il est clair qu&#8217;une relation de discours existe entre les deux AO &#224; gauche et &#224; droite
du connecteur &#216;. Les positions o&#249; un connecteur vide doit &#234;tre ins&#233;r&#233; demandent une &#233;tude
linguistique qui d&#233;bouche sur une insertion automatique du connecteur &#216; demandant le
moins possible de r&#233;vision manuelle (Antolinos-Basso, 2012). Signalons que dans le PDTB,
il est demand&#233; aux annotateurs de pr&#233;ciser le sens d&#8217;un connecteur implicite en ins&#233;rant un
(ou deux) connecteur(s) explicite(s) ainsi qu&#8217;en indiquant la ou les relation(s) de discours
exprim&#233;e(s). Il semble inutile d&#8217;ins&#233;rer des connecteurs explicites &#224; la place des connecteurs
vides : on peut simplement demander aux annotateurs de pr&#233;ciser la ou les relation(s) de
discours exprim&#233;e(s) (apr&#232;s avoir &#233;ventuellement test&#233; si la pr&#233;sence de tel ou tel connecteur
explicite n&#8217;alt&#232;re pas la s&#233;mantique du texte).
</p>
<p>(4)a. Fred a tir&#233; sur Marie, &#216; la tuant.
b. Fred a tu&#233; Marie, &#216; en lui tirant dessus.
c. Fred a fait la vaisselle, &#216; pass&#233; l&#8217;aspirateur, et lav&#233; les carreaux.
</p>
<p>8. Nous ne disposons pas pour le fran&#231;ais de la liste des 100 connecteurs les plus fr&#233;quents. Certes, on peut effectuer
un simple comptage des occurrences des (suites de) mots correspondant aux connecteurs, mais ce comptage ne prendrait
pas en compte qu&#8217;une m&#234;me suite de mots peut correspondre &#224; un emploi discursif ou non, voir &#224; ce moment l&#224; dans (1).
Pour d&#233;terminer les 100 connecteurs les plus fr&#233;quents du fran&#231;ais, il faut disposer d&#8217;annotations comme celle du FDTB.
</p>
<p>474</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; Supprimer les notions de Sup1 et Sup2. Citons (Joshi et al., 2006) qui arguent pour un
&#8220;principe de minimalit&#233;&#8221; : &#8220;Only as many clauses and/or sentences should be included as are
minimally required for interpreting the relation. Any other span of text that is perceived to be
relevant (but not necessary) should be annotated as supplementary information : Sup1 for
material supplementary to Arg1, Sup2 for material supplementary to Arg2.&#8221; Ce principe de
minimalit&#233; ne peut donner lieu qu&#8217;&#224; des interpr&#233;tations plut&#244;t subjectives, dont la subjectivit&#233;
est cependant limit&#233;e par des consignes relevant de la syntaxe, par exemple : &#8220;An argument
includes any non-clausal adjuncts, prepositions, connectives, or complementizers introducing
or modifying the clause&#8221; (Joshi et al., 2006) 9. La question suivante se pose : quel est le r&#244;le de
Sup1 ou Sup2 par exemple dans l&#8217;exploitation du PDTB pour les techniques d&#8217;apprentissage
supervis&#233; reposant sur les donn&#233;es annot&#233;es ? Nous n&#8217;avons trouv&#233; aucune information sur
la question dans les nombreux articles exploitant les r&#233;sultats du PDTB (Section 2) et nous
subodorons que les segments annot&#233;s Sup1 et Sup2 sont tout bonnement et simplement
ignor&#233;s. De plus, Sup1 et Sup2 ne sont pas pris en compte dans l&#8217;accord inter-annotateurs
sur les empans des arguments des connecteurs (Prasad et al., 2008). Il semble donc que les
notions de Sup1 et Sup2 n&#8217;ont &#233;t&#233; utilis&#233;es que pour le confort des annotateurs. C&#8217;est une
raison valable dans l&#8217;objectif d&#8217;une couverture partielle que s&#8217;est fix&#233; le PDTB, mais qui ne
trouve gu&#232;re de justification dans l&#8217;objectif d&#8217;une couverture totale o&#249; les segments de texte
qui auraient &#233;t&#233; identifi&#233;s comme Sup1 ou Sup2 doivent &#234;tre int&#233;gr&#233;s dans l&#8217;analyse discursive
totale du texte.
</p>
<p>3.2 Hi&#233;rarchie des relations des connecteurs
</p>
<p>La hi&#233;rarchie des relations de connecteurs &#233;tablie dans (PDTB Group, 2008, page 27) est
discutable, ne serait-ce que parce qu&#8217;elle ne semble pas avoir &#233;t&#233; &#233;tablie sur la base des relations
de discours (et de leur organisation en classes) d&#233;finie en RST (Mann et Thompson, 1987;
Taboada et Mann, 2006) ou SDRT (Asher et Lascarides, 2003), les deux grandes th&#233;ories sur
le discours. Or ces th&#233;ories pr&#233;sentent des classifications int&#233;ressantes sur des dimensions
orthogonales :
&#8211; RST distingue les relations de discours &#8216;informationnelle versus pr&#233;sentationnelle&#8221; en s&#8217;ap-
</p>
<p>puyant sur le fait que certaines relations n&#8217;&#233;tablissent qu&#8217;une relation s&#233;mantique (informa-
tionnelle) entre les contenus propositionnels des ses arguments tandis que d&#8217;autres (pr&#233;sen-
tationnnelles) demandent de faire appel &#224; des actes de parole. Ainsi la relation de discours
lexicalis&#233;e par donc est informationnelle en (5a), tandis qu&#8217;elle est pr&#233;sentationnelle en (5b)
puisqu&#8217;elle sous-entend l&#8217;acte de parole J&#8217;en d&#233;duis (donc qu&#8217;il a plu).
</p>
<p>(5)a. Il a plu. Donc, les routes sont mouill&#233;es.
b. Les routes sont mouill&#233;es. Donc, il a plu.
</p>
<p>&#8211; SDRT distingue les relations v&#233;ridicales des relations non v&#233;ridicales. La notion de v&#233;ridicalit&#233;
y est d&#233;finie par la formule R(&#945;,&#946;) &#8658; K&#945; &#8743; K&#946; , qui se glose ainsi : si R(&#945;,&#946;) est vraie
alors les contenus propositionnels des arguments, not&#233;s K&#945; et K&#946; , sont vrais. Comme montr&#233;
dans (Danlos et Rambow, 2011), cette d&#233;finition ne tient pas d&#232;s qu&#8217;on quitte les assertions
de l&#8217;auteur, voir (6) avec NARRATION(&#945;,&#946;) o&#249; NARRATION, qualifi&#233;e de v&#233;ridicale en SDRT,
n&#8217;implique pas que K&#946; soit vrai.
</p>
<p>9. Nous sommes actuellement en train de r&#233;diger des consignes analogues pour le fran&#231;ais, avec &#224; nouveau des
diff&#233;rences par rapport au PDTB. Ainsi, contrairement au PDTB, nous excluons tout connecteur des empans pour les
arguments Arg1 et Arg2 d&#8217;un connecteur, ce qui va de pair avec l&#8217;objectif d&#8217;obtenir une couverture totale.
</p>
<p>475</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(6) [Fred ira &#224; Dax pour No&#235;l.]&#945; Jane pense qu&#8217;ensuite [il ira &#224; Pau.]&#946;
</p>
<p>Il n&#8217;emp&#234;che que la d&#233;finition de v&#233;ridicalit&#233; pos&#233;e en SDRT tient quand on consid&#232;re que &#945; et
&#946; sont des assertions de l&#8217;auteur, et qu&#8217;il semble pertinent de distinguer les relations v&#233;ridicales
(e.g. Narration) des autres (e.g. Condit ion illustr&#233;e dans [Marie viendra &#224; ma f&#234;te]&#945; si [Fred
vient]&#946;).)
</p>
<p>Nous avons donc d&#233;fini une nouvelle hi&#233;rarchie des relations de discours qui s&#8217;appuie sur les
classifications orthogonales des relations de discours d&#233;finies en RST et SDRT et sur celle du
PDTB. Cette hi&#233;rarchie, donn&#233;e en appendice et d&#233;crite dans (Danlos et Roze, 2011), distingue
cinq classes de relations v&#233;ridicales (CAUSALE, T EM PORELLE, COM PARAISON , EX PANSION
et ADDI T IV E) et une classe de relations non-v&#233;ridicales. Dans chaque classe, des sous-classes
distinguent &#233;ventuellement les relations informationnelles/s&#233;mantiques (e.g R&#201;SULTAT) des
relations pr&#233;sentationnelles/pragmatiques (distingu&#233;es par le signe * e.g R&#201;SULTAT*). Cette
hi&#233;rarchie contient 31 feuilles auxquelles il faut ajouter la relation UNKNOWN qui est utile pour
certains connecteurs dont le sens est tr&#232;s sp&#233;cifique (e.g. au fur et &#224; mesure que qui s&#8217;emploie
dans un &#233;nonc&#233; comme Son d&#233;bit de parole augmentait au fur et &#224; mesure qu&#8217;il vidait la bouteille)
ou lorsqu&#8217;un annotateur n&#8217;est satisfait par aucune relation de la hi&#233;rarchie 10.
</p>
<p>4 Premi&#232;res exp&#233;riences et perspectives futures
</p>
<p>Pour nous familiariser avec l&#8217;outil d&#8217;annotation &#8212; ANNOTATOR adapt&#233; pour les besoins du FDTB
&#8212;, identifier les probl&#232;mes r&#233;currents d&#8217;annotation en vue de r&#233;diger un manuel d&#8217;annotation
complet et pr&#233;cis (voir note 6), nous avons men&#233; quelques exp&#233;riences sur certains connecteurs
explicites. Ces premi&#232;res exp&#233;riences ont montr&#233; une grande divergence dans ce qui est annot&#233;
Sup1 ou Sup2, ce qui nous conforte dans l&#8217;id&#233;e d&#8217;abandonner tout bonnement et simplement ces
notions. Elles ont aussi montr&#233; qu&#8217;il n&#8217;&#233;tait pas ad&#233;quat de travailler connecteur par connecteur.
Dans la suite du d&#233;veloppement du FDTB, nous demanderons aux annotateurs de travailler
article par article, en annotant les connecteurs explicites et implicites avec l&#8217;objectif d&#8217;une analyse
discursive totale.
</p>
<p>Nous invitons toute personne int&#233;ress&#233;e par les connecteurs de discours et/ou l&#8217;analyse discursive
&#224; nous contacter afin de participer &#224; cette entreprise de longue haleine aux r&#233;sultats attendus.
</p>
<p>Remerciements
</p>
<p>Nous remercions M. Djemaa, C. Dordonne, A. Hu, M. Majdoub, L. Patris, C. Ribeyre, F. Sari, et Y. Sun,
&#233;tudiants de Master2 dans le cursus de Linguistique Informatique de l&#8217;Universit&#233; Paris Diderot, qui ont servi
de cobayes (en bin&#244;me) pour une annotation exp&#233;rimentale des connecteurs afin de, lorsque, puisque et en
revanche. Le FTB comporte aux alentours de 80 occurrences de chacun de ces connecteurs.
</p>
<p>10. Un annotateur peut choisir deux &#233;l&#233;ments de la hi&#233;rarchie (mais pas plus que deux, est-ce une limite ?) pour un
m&#234;me connecteur (explicite ou implicite). Par exemple, pour alors que en (7) il peut choisir OVERLAP et CONTRASTE sans
avoir &#224; trancher arbitrairement entre les deux.
</p>
<p>(7) En ce moment, Fred est compl&#232;tement d&#233;prim&#233;, alors que Marie est en pleine forme.
</p>
<p>476</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et TOUSSENEL, F. (2003). Building a treebank for french. In ABEILL&#201;, A., &#233;diteur :
Treebanks. Kluwer Academic Publishers, Dordretch.
</p>
<p>ANTOLINOS-BASSO, D. (2012). Les connecteurs implicites dans le FDTB. M&#233;moire de Master, Universit&#233;
Paris Diderot.
</p>
<p>ASHER, N. (1993). Reference to Abstract Objects in Discourse. Kluwer, Dordrecht.
</p>
<p>ASHER, N. et LASCARIDES, A. (2003). Logics of Conversation. Cambridge University Press, Cambridge.
</p>
<p>DANLOS, L. (2011). Analyse discursive et informations de factivit&#233;. In Actes de TALN 2011, Montpellier,
France.
</p>
<p>DANLOS, L. et RAMBOW, O. (2011). Veridicality of discourse relations and factuality information. In
Proceedings of the fourth workshop on Constraints in Discourse (CID 2011), Agay, France.
</p>
<p>DANLOS, L. et ROZE, C. (2011). Hi&#233;rarchie des relations de discours dans le FDTB. Rapport technique,
ALPAGE, Universit&#233; Paris Diderot.
</p>
<p>JOSHI, A., PRASAD, R. et WEBBER, B. (2006). Discourse annotation : Discourse connectives and discourse
relations. In Tutorial at the Association for Computational Linguistics, Sydney, Australia.
</p>
<p>LIN, Z., NG, H. T. et KAN, M.-Y. (2011). Automatically evaluating text coherence using discourse relations.
In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics : Human Language
Technologies (ACL-HLT), Portland, OR.
</p>
<p>MANN, W. et THOMPSON, S. (1987). Rhetorical structure theory. In KEMPEN, G., &#233;diteur : Natural Language
Generation, pages 85&#8211;95. Martinus Nijhoff Publisher, Dordrecht.
</p>
<p>MARCUS, M., SANTORINI, B., MARCINKIEWICZ, M. A. et TAYLOR, A. (1999). Building a treebank for french. In
Treebank-3. Linguistic Data Consortium, Philadelphie.
</p>
<p>PDTB GROUP (2008). The Penn Discourse Treebank 2.0 annotation manual. Rapport technique, Institute
for Research in Cognitive Science, University of Philadelphia.
</p>
<p>P&#233;ry WOODLEY, M.-P., ASHER, N., ENJALBERT, P., BENAMARA, F., BRAS, M., FABRE, C., FERRARI, S., Ho DAC,
L.-M., Le DRAOULEC, A., MATHET, Y., MULLER, P., PR&#201;VOT, L., REBEYROLLE, J., TANGUY, L., Vergez COURET,
M., VIEU, L. et WIDL&#214;CHER, A. (2009). ANNODIS : une approche outill&#233;e de l&#8217;annotation de structures
discursives. In Proceedings of TALN 2009, pages 190&#8211;196, Senlis, France.
</p>
<p>PITLER, E., LOUIS, A. et NENKOVA, A. (2010). Automatic sense prediction for implicit discourse relations in
text. In Proceedings of the Joint Conference of the 47th Annual Meeting of the ACL and the 4th International
Joint Conference on Natural Language Processing, Suntec, Singapore.
</p>
<p>PRASAD, R., DINESH, N., LEE, A., JOSHI, A. et WEBBER, B. (2006). Attribution and its annotation in the Penn
Discourse Treebank. Revue TAL, 47(2).
</p>
<p>PRASAD, R., DINESH, N., LEE, A., MILTSAKAKI, E., ROBALDO, L., JOSHI, A. et WEBBER, B. (2008). The penn
discourse treebank 2.0. In Proceedings of the Sixth International Conference on Language Resources and
Evaluation (LREC&#8217;08), Marrakech, Morocco. European Language Resources Association (ELRA).
</p>
<p>ROZE, C. (2009). LEXCONN : Base lexicale des connecteurs discursifs du fran&#231;ais. M&#233;moire de Master,
Universit&#233; Paris Diderot.
</p>
<p>ROZE, C., DANLOS, L. et MULLER, P. (2010). LEXCONN : a French lexicon of discourse connectives. In
Proceedings of Multidisciplinary Approaches to Discourse (MAD 2010), Moissac, France.
</p>
<p>SAUR&#205;, R. et PUSTEJOVSKY, J. (2009). FactBank : A corpus annotated with event factuality. Language
Resources and Evaluation, 43:227&#8211;268.
</p>
<p>TABOADA, M. et MANN, W. (2006). Rhetorical Structure Theory : Looking back and moving ahead. Discourse
Studies, 8(3):423&#8211;459.
</p>
<p>WEBBER, B., EGG, M. et KORDONI, V. (2011). Discourse structure and language technology. Natural Language
Engineering, 1(1):1&#8211;54.
</p>
<p>477</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Hi&#233;rachie des relations de discours
</p>
<p>Classe CAUSALE
&#8212; Type s&#233;mantique
</p>
<p>&#8212; R&#201;SULTAT
&#8212; EXPLICATION
&#8212; MOYEN
&#8212; BUT
</p>
<p>&#8212; Type pragmatique
&#8212; R&#201;SULTAT*
&#8212; EXPLICATION*
&#8212; BUT*
</p>
<p>&#8212; Type s&#233;mantico-pragmatique
&#8212; EVIDENCE
</p>
<p>Classe TEMPORELLE
&#8212; Type s&#233;mantique
</p>
<p>&#8212; OVERLAP
&#8212; PR&#201;C&#201;DENCE
&#8212; SUCCESSION
</p>
<p>Classe COMPARAISON
&#8212; Polarit&#233;s oppos&#233;es
</p>
<p>&#8212; CONTRASTE
&#8212; CONCESSION
</p>
<p>&#8212; CONCESSION-AVANT
&#8212; CONCESSION-ARRI&#200;RE
</p>
<p>&#8212; Polarit&#233;s &#233;gales
&#8212; PARALL&#200;LE
</p>
<p>&#8212; Type pragmatique
&#8212; CONTRASTE*
</p>
<p>Classe EXPANSION
&#8212; Type Elaboration
</p>
<p>&#8212; ELAB-ENTIT&#201;
&#8212; ELAB-&#201;V&#201;NEMENT
&#8212; ELAB-INSTANCE
&#8212; EXCEPTION
</p>
<p>&#8212; R&#201;SUM&#201;
&#8212; EVALUATION
</p>
<p>Classe ADDITIVE
&#8212; Type Liste
</p>
<p>&#8212; ENUMERATION
&#8212; CONTINUATION
</p>
<p>&#8212; DISGRESSION
</p>
<p>Classe NON VERIDICALE
&#8212; Alternatives
</p>
<p>&#8212; ALTERNATIVE
&#8212; ALTERNATIVE*
</p>
<p>&#8212; CORRECTION
&#8212; S&#233;mantiques Conditionnelles
</p>
<p>&#8212; UNLESS
&#8212; OTHERWISE
&#8212; CONDITION
&#8212; CONS&#201;QUENCE-HYPOTH&#201;TIQUE
</p>
<p>&#8212; Pragmatiques Conditionnelles
&#8212; CONDITION*
</p>
<p>478</p>

</div></div>
</body></html>