<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Transitions th&#233;matiques : Annotation d'un corpus journalistique et premi&#232;res analyses</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 503&#8211;510,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Transitions th&#233;matiques : Annotation d&#8217;un corpus
journalistique et premi&#232;res analyses
</p>
<p>Alexandre Labadi&#233;1 Patrice Enjalbert2 St&#233;phane Ferrari2
(1) GETALP, LIG, BP 53, 38041 Grenoble Cedex 9, France (2) Laboratoire GREYC, Universit&#233; de Caen &amp;
</p>
<p>CNRS, Bd Mar&#233;chal Juin, BP 5186 F-14032 Caen Cedex, France Alexandre.Labadie@imag.fr,
Patrice.Enjalbert@unicaen.fr, Stephane.Ferrari@unicaen.fr
</p>
<p>R&#201;SUM&#201;
Le travail pr&#233;sent&#233; dans cet article est centr&#233; sur la constitution d&#8217;un corpus de textes journa-
listiques annot&#233;s au niveau discursif d&#8217;un point de vue th&#233;matique. Le mod&#232;le d&#8217;annotation est
une segmentation classique, &#224; laquelle nous ajoutons un rep&#233;rage de zones de transition entre
unit&#233;s th&#233;matiques. Nous faisons l&#8217;hypoth&#232;se que dans un texte bien construit, le scripteur fournit
des indications aidant le lecteur &#224; passer d&#8217;un sujet &#224; un autre, l&#8217;identification de ces indices
&#233;tant susceptible d&#8217;am&#233;liorer les proc&#233;dures de segmentation automatique. Les annotations
produites ont fait l&#8217;objet d&#8217;analyses quantitatives mettant en &#233;vidence un ensemble de propri&#233;t&#233;s
des transitions entre th&#232;mes.
</p>
<p>ABSTRACT
Manual thematic annotation of a journalistic corpus : first observations and evaluation.
</p>
<p>The work presented in this paper focuses on the creation of a corpus of journalistic texts
annotated at dicourse level, more precisely on a topic level. The annotation model is a classic
segmentation one, to which we add transition zones between topical units. We assume that in a
well-structured text, the author provides information helping the reader to move from one topic
to another, where an identification of these clues is likely to improve automatic segmentation.
The produced annotations have been subject of several quantitative analyses showing a set of
linguistic properties of topical transitions.
</p>
<p>MOTS-CL&#201;S : Structure du discours, segments th&#233;matiques, transitions th&#233;matiques, annotation.
</p>
<p>KEYWORDS: Discourse structure, topical segments, topical transitions, annotation.
</p>
<p>1 Introduction
On peut observer actuellement un int&#233;r&#234;t croissant pour l&#8217;analyse de la structure du discours
dans la communaut&#233; TALN, tant &#224; des fins applicatives (indexation de documents, r&#233;sum&#233;
automatique, ...), que pour des &#233;tudes de linguistique de corpus. Cet article est consacr&#233; &#224; celles
de ces approches qui tentent de saisir l&#8217;organisation du texte en termes de &quot;blocs homog&#232;nes&quot;
successifs selon des crit&#232;res th&#233;matiques (succession de th&#232;mes tout au long du texte). Notre
contribution concerne tant le mod&#232;le discursif lui-m&#234;me (accent mis sur les zones de transition)
que la constitution d&#8217;un corpus annot&#233; en cons&#233;quence. Des ressources de ce type sont clairement
n&#233;cessaires, comme &quot;r&#233;f&#233;rence&quot; pour l&#8217;&#233;valuation de traitements automatiques ou pour des
observations d&#8217;ordre linguistique. De fait, ce travail a &#233;t&#233; initi&#233; au sein du projet ANR Annodis,
visant &#224; l&#8217;annotation de textes selon plusieurs mod&#232;les discursifs (P&#233;ry-Woodley et al., 2009) 1. Le
</p>
<p>1. http://w3.erss.univ-tlse2.fr/annodis/
</p>
<p>503</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>corpus est compos&#233; d&#8217;articles de journaux (articles de fond de politique et d&#8217;&#233;conomie).
La segmentation th&#233;matique est une t&#226;che populaire en TALN (voir, par exemple (Morris et
Hirst, 1991; Hearst, 1997; Choi, 2000)). Dans la plupart de ces travaux, les segments sont
identifi&#233;s par leurs champs lexicaux et, malgr&#233; des r&#233;sultats int&#233;ressants, on peut regretter que
ces approches purement lexicales ne prennent pas en compte les signaux que les auteurs ins&#232;rent
souvent dans le but d&#8217;informer le lecteur de changements de sujet. Dans notre travail, nous
faisons l&#8217;hypoth&#232;se de l&#8217;existence de zones de transition, entre segments th&#233;matiques, ayant
cette fonction, dans l&#8217;intention d&#8217;&#233;tudier leurs propri&#233;t&#233;s. Outre un int&#233;r&#234;t th&#233;orique (mis en
&#233;vidence par de nombreux travaux en linguistique) l&#8217;&#233;tude des indices de transition th&#233;matique
est susceptible d&#8217;am&#233;liorer les performances d&#8217;outils de segmentation automatique 2. Afin de
tester notre hypoth&#232;se, nous avons donc demand&#233; aux annotateurs d&#8217;indiquer de telles zones.
L&#8217;article est organis&#233; comme suit. Nous pr&#233;sentons d&#8217;abord le corpus et la proc&#233;dure d&#8217;annotation,
de concert avec le mod&#232;le d&#8217;annotation th&#233;matique. Nous d&#233;taillons ensuite une mesure d&#8217;accord
inter-annotateurs originale : aucune mesure r&#233;ellement satisfaisante (permettant en particulier de
comparer la segmentation de plusieurs annotateurs, et non le simple accord avec une annotation
de r&#233;f&#233;rence) n&#8217;&#233;tant &#224; ce jour disponible. Puis nous consid&#233;rons la question des &quot;signaux&quot;
indiquant les transitions entre segments th&#233;matiques.
</p>
<p>2 Corpus et proc&#233;dure d&#8217;annotation
2.1 Textes, outils et annotateurs
Le corpus en vue est compos&#233; de textes journalistiques du journal Le Monde, ann&#233;e 1994. Ce
choix s&#8217;explique &#224; la fois par les objectifs applicatifs (r&#233;sum&#233;, indexation, etc.) et par la qualit&#233;
linguistique du journal. Nous avons choisi au hasard 30 textes (principalement en politique et
en &#233;conomie) de diff&#233;rentes tailles. Le corpus totalise 46 689 mots et a &#233;t&#233; r&#233;parti entre trois
cat&#233;gories : Petits : moins de 1000 mots (15 textes) ; Moyens : entre 1000 et 3000 mots (10
textes) et Grands : plus de 3000 mots (5 textes ). Chaque texte a &#233;t&#233; annot&#233; par 3 annotateurs
au sein d&#8217;un groupe de 5 annotateurs &quot;na&#239;fs&quot; 3 en utilisant la plateforme Glozz 4(Widl&#246;cher et
Mathet, 2009). Les textes ont &#233;t&#233; pr&#233;sent&#233;s aux annotateurs avec un minimum de mise en page
(titre, sous-titres et paragraphes).
</p>
<p>2.2 Mod&#232;le d&#8217;annotation th&#233;matique
Il existe une grande vari&#233;t&#233; de m&#233;thodes de segmentation th&#233;matique. La plupart admettent qu&#8217;un
segment th&#233;matique est une unit&#233; de texte qui est th&#233;matiquement coh&#233;rente et th&#233;matiquement
distincte de la pr&#233;c&#233;dente et de la suivante. Certaines se concentrent sur la recherche des
fronti&#232;res (Beeferman et al., 1999), d&#8217;autres tentent de regrouper des portions de texte selon
leur coh&#233;rence lexicale (Choi, 2000). Mais, que ce soit pour l&#8217;apprentissage ou l&#8217;&#233;valuation, les
exp&#233;riences s&#8217;appliquent surtout &#224; des corpus obtenus artificiellement &#224; partir de l&#8217;agr&#233;gation
de petits textes, l&#8217;hypoth&#232;se &#233;tant que la fronti&#232;re entre deux textes peut &#234;tre assimil&#233;e &#224; une
fronti&#232;re th&#233;matique. Cette hypoth&#232;se est r&#233;guli&#232;rement critiqu&#233;e (Bestgen et Pirard, 2006;
Labadi&#233; et Prince, 2008) car elle ne prend pas en compte la question de la coh&#233;rence globale du
texte.
Divers travaux s&#8217;int&#233;ressent n&#233;anmoins aux marques linguistiques de ruptures th&#233;matiques. On
pourra citer des courants de recherche int&#233;ress&#233;s &#224; la notion de segment cadratif, dans la lign&#233;e de
(Charolles, 1997), ou &#224; la typologie des expressions r&#233;f&#233;rentielles (Asher et al., 2006). (Pi&#233;rard et
</p>
<p>2. (Couto J. et al., 2004), par exemple, exploite divers types &quot;d&#8217;introducteurs th&#233;matiques&quot;.
3. Des &#233;tudiants en master d&#8217;informatique et de sciences du langage n&#8217;ayant pas de connaissance a priori de la t&#226;che
</p>
<p>et r&#233;mun&#233;r&#233;s pour l&#8217;occasion.
4. http://www.glozz.org/
</p>
<p>504</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bestgen, 2006) &#233;tudie la mani&#232;re dont ces deux types de marques peuvent se combiner avec des
ph&#233;nom&#232;nes de coh&#233;sion lexicale. Dans le domaine du TAL, (Couto J. et al., 2004), exploite divers
types &quot;d&#8217;introducteurs th&#233;matiques&quot; pour contribuer &#224; la segmentation, tandis que (Widl&#246;cher
et al., 2006) int&#232;gre divers indices linguistiques dans une proc&#233;dure de fouille de texte.
C&#8217;est &#224; cette recherche des marques de ruptures que notre travail se propose de contribuer, en
s&#8217;appuyant sur la constitution d&#8217;un corpus annot&#233; susceptible de les mettre en &#233;vidence. Notre
mod&#232;le est bas&#233; sur l&#8217;hypoth&#232;se que, dans un texte bien construit, les ruptures th&#233;matiques
brutales sont l&#8217;exception plut&#244;t que la r&#232;gle. Le plus souvent, des zones de transition aident le
lecteur &#224; passer d&#8217;un th&#232;me &#224; l&#8217;autre. La zone de transition &quot;parfaite&quot;, telle que nous la d&#233;finissons,
devrait comprendre &#224; la fois une conclusion du th&#232;me pr&#233;c&#233;dent et une introduction du nouveau.
Mais, m&#234;me dans un texte correctement structur&#233;, on peut trouver des transitions incompl&#232;tes,
voir des fronti&#232;res abruptes. La t&#226;che d&#8217;annotation consiste alors &#224; d&#233;limiter quatre types d&#8217;unit&#233;s
qui, par souci de simplification, doivent avoir la phrase comme unit&#233; atomique :
Les segments th&#233;matiques : M&#234;me si nous avons suppos&#233; que les transitions entre les th&#232;mes
sont, en principe, &quot;floues&quot; il convient, pour des raisons pratiques, de d&#233;finir des fronti&#232;res. Ces
segments repr&#233;sentent les th&#232;mes principaux et, le cas &#233;ch&#233;ant, les sous-th&#232;mes du texte. Par
souci de simplification, nous nous sommes limit&#233;s &#224; un seul niveau de sous-th&#232;me.
Les introductions et conclusions th&#233;matiques : Elles correspondent &#224; des portions de textes
o&#249; l&#8217;annotateur rep&#232;re des indices clairs indiquant que l&#8217;auteur introduit ou conclut un th&#232;me.
Les transitions &quot;floues&quot; : Si l&#8217;annotateur per&#231;oit une transition, mais sans qu&#8217;une introduction
ou une conclusion s&#8217;impose.
Nous n&#8217;avons volontairement pas donn&#233; aux annotateurs d&#8217;instructions sur ce que les &quot;indices&quot; de
ces zones peuvent &#234;tre, notre but &#233;tant pr&#233;cis&#233;ment de les identifier.
</p>
<p>3 Une mesure d&#8217;accord inter-annotateurs pour une t&#226;che de
segmentation
</p>
<p>3.1 Contexte
Diff&#233;rentes mesures existent pour comparer des segmentations multiples portant sur un m&#234;me
texte. Ainsi, dans (Bestgen, 2009), l&#8217;auteur teste comparativement les efficacit&#233;s de WindowDiff
et de la distance de Hamming g&#233;n&#233;ralis&#233;e. Mais de telles mesures sont essentiellement adapt&#233;es
pour comparer les r&#233;sultats d&#8217;une segmentation automatique &#224; une segmentation de r&#233;f&#233;rence.
Elles ne peuvent &#234;tre ais&#233;ment g&#233;n&#233;ralis&#233;es &#224; plus de 2 annotations concurrentes. Il existe par
ailleurs la mesure classique Kappa (Fleiss, 1971), un standard qui permet de mesurer un taux
d&#8217;accord &#224; propos de la s&#233;mantique d&#8217;objets bien d&#233;finis, mais ne prend pas en consid&#233;ration la
notion de segment en tant que telle. Nous proposons de ce fait une nouvelle mesure, con&#231;ue
pour r&#233;pondre &#224; notre probl&#232;me de segmentation multi-annotateurs, directement applicable sur
notre corpus.
</p>
<p>3.2 La mesure d&#8217;accord
Notre mesure vise &#224; proposer une &#233;valuation ad&#233;quate des diff&#233;rences entre segments issus
d&#8217;annotateurs distincts, ces segments ne constituant pas n&#233;cessairement un pavage complet du
texte (cas des zones de transition par exemple).
Consid&#233;rons dans un premier temps le cas de deux annotateurs, en supposant qu&#8217;une correspon-
dance (alignement) ait d&#233;j&#224; &#233;t&#233; effectu&#233;e entre leurs segments respectifs, que ce soit de mani&#232;re
automatique ou manuelle 5. Lorsque nous comparons deux segments align&#233;s, nous consid&#233;rons
</p>
<p>5. Le probl&#232;me de l&#8217;alignement automatique de plusieurs segmentation est une question &#224; part enti&#232;re, qui d&#233;passe le
cadre de cet article.
</p>
<p>505</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>les &#233;carts-types (StDev) entre les bornes de d&#233;but et les bornes de fin des deux segments. La
somme de ces &#233;cart-types est ramen&#233;e proportionnellement &#224; la moyenne des tailles des deux
segments (Avg), par analogie avec le coefficient de variation (StDev/Avg) :
</p>
<p>x =
StDev(posinit)+StDev(posend)
</p>
<p>Avg(size)
</p>
<p>. Ce calcul produit une valeur entre 0 et&#8734; : 0 correspond &#224; un alignement parfait (positions de
d&#233;but et de fin identiques) ;&#8734; est une limite th&#233;orique correspondant &#224; des positions divergentes
(&#233;loignement infini d&#8217;au moins l&#8217;une des bornes pour une taille de segment limit&#233;e).
Du fait de la difficult&#233; d&#8217;interpr&#233;ter un r&#233;sultat entre 0 et &#8734;, ce r&#233;sultat est projet&#233; sur un
intervalle born&#233;. Par analogie avec la mesure &#954;, nous avons choisi ]&#8722; 1,1]. 0, le meilleur des
cas, a pour image 1 et&#8734;, le pire des cas, est projet&#233; sur &#8722;1. Nous avons accord&#233; une attention
particuli&#232;re &#224; la valeur x = 1. Cette valeur est atteinte lorsque la diff&#233;rence entre les positions
est du m&#234;me ordre de grandeur que la taille des segments elle-m&#234;me, ce qui correspond, dans
notre interpr&#233;tation, &#224; une limite entre accord et d&#233;saccord 6 , et nous conduit &#224; projeter 1 sur
la valeur &quot;neutre&quot; 0 de l&#8217;intervalle ]&#8722; 1, 1]. Ces contraintes sont satisfaites par l&#8217;utilisation pour
la projection d&#8217;une fonction monotone, continue, construite &#224; partir de la fonction tangente
hyperbolique :
</p>
<p>y = 1&#8722; 2&#215; 2
q
</p>
<p>e
x
2 &#8722;1
</p>
<p>e
x
2 +1
</p>
<p>. La mesure peut &#234;tre facilement g&#233;n&#233;ralis&#233;e &#224; n annotateurs en utilisant toujours les mesures
statistiques &#233;carts-types et moyennes entre n segments align&#233;s (un par annotateur). Nous utilisons
actuellement une moyenne arithm&#233;tique de ces r&#233;sultats pour l&#8217;ensemble des annotations align&#233;es
&#224; l&#8217;&#233;chelle d&#8217;un texte dans son int&#233;gralit&#233;.
</p>
<p>3.3 Interpr&#233;tation, alignement et usage
La projection sur ]&#8722; 1,1] avec par construction le 0 comme limite entre accord et d&#233;saccord
permet une interpr&#233;tation plus facile des r&#233;sultats. Ainsi, toute valeur inf&#233;rieure &#224; 0 correspond &#224;
un d&#233;saccord qui sera plus important &#224; mesure que la valeur se rapproche de &#8722;1. &#192; l&#8217;oppos&#233;, les
valeurs sup&#233;rieures &#224; 0 repr&#233;sentent un accord qui ira en s&#8217;am&#233;liorant en avan&#231;ant vers 1. Nous
consid&#233;rons que les valeurs sup&#233;rieures &#224; 0, 3 sont satisfaisantes et deviennent tr&#232;s satisfaisantes
au del&#224; de 0,6. En effet, la fonction de normalisation poss&#232;de une tangente infinie en 0, des
&#233;carts faibles font d&#233;cro&#238;tre rapidement les valeurs obtenues 7.
Dans notre exp&#233;rience, l&#8217;alignement a &#233;t&#233; effectu&#233; &#224; la main de telle sorte que chaque segment
de chaque annotateur soit align&#233; avec un segment de chacun des autres annotateurs 8. Ainsi,
si par exemple un annotateur &quot;englobe&quot; deux segments d&#8217;un autre annotateur, chacun de ces
dernier sera align&#233; avec le premier. De plus, l&#8217;alignement a &#233;t&#233; fait &quot;en aveugle&quot;, c&#8217;est-&#224;-dire que
la personne charg&#233;e d&#8217;aligner les segments n&#8217;a pris en compte que les position de d&#233;but et de fin
des segments, sans avoir connaissance du texte. Notre objectif n&#8217;est donc pas ici d&#8217;optimiser la
mesure d&#8217;accord (comme (Mathet et Widl&#246;cher, 2011)), mais de proposer un alignement continu
de tous les annotateurs entre eux, m&#234;me au d&#233;triment du score final.
</p>
<p>6. Ce choix d&#233;coule d&#8217;une observation pr&#233;alable de diff&#233;rentes configurations de segments ; la normalisation de la
mesure est donc construite pour reproduire cette interpr&#233;tation de mani&#232;re automatique.
</p>
<p>7. Par exemple, si sur un segment annot&#233; par dix annotateurs, un seul annotateur fait varier une seule des deux
bornes du segment de 10% de la longueur du segment (les autres annotateurs &#233;tant en accord parfait), l&#8217;accord tombe &#224;
0, 83.
</p>
<p>8. Seuls les scores d&#8217;accord des segments th&#233;matiques sont pr&#233;sent&#233;s, le faible nombre de zones de transition rendant
l&#8217;interpr&#233;tation d&#8217;un tel score sur ces derni&#232;res au mieux hasardeuse.
</p>
<p>506</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le tableau 1 pr&#233;sente les scores obtenus en fonction de la cat&#233;gorie de texte et pour l&#8217;ensemble du
corpus. Pour chaque texte, ce score est la moyenne sur le texte des scores pour chaque segment
(comme pr&#233;cis&#233; en 3.2). Avec des scores allant de 0,16 &#224; 0,7, mais majoritairement entre 0,3
</p>
<p>Petits Moyens Grands Global
</p>
<p>Minimum 0, 36 0, 18 0, 16 0, 16
Maximum 0, 7 0, 65 0, 4 0, 7
Moyenne 0, 5 0, 41 0, 27 0, 43
&#963; 0, 11 0, 12 0, 1 0, 13
</p>
<p>TABLE 1 &#8211; Accord sur la segmentation du corpus
</p>
<p>et 0,56, nous pouvons consid&#233;rer, selon notre &quot;grille de lecture&quot;, qu&#8217;il existe un accord global
satisfaisant sur la structure th&#233;matique des textes. Un examen plus pr&#233;cis montre que si l&#8217;accord
local parfait n&#8217;existe pas, la plupart des fronti&#232;res propos&#233;es par les annotateurs ne sont pas
&#233;loign&#233;es de plus d&#8217;un paragraphe. En outre, il n&#8217;y a pas de cas de texte avec un d&#233;saccord
moyen (&lt; 0), ce qui laisse supposer que les lecteurs sont sensibles &#224; des facteurs d&#8217;une nature
relativement &quot;objective&quot;. L&#8217;exp&#233;rience men&#233;e sur les zones de transition, pr&#233;sent&#233;e plus loin, tend
&#224; confirmer ce point.
Une deuxi&#232;me observation concerne la taille des textes : plus les textes sont petits, plus les
scores sont &#233;lev&#233;s. Une raison &#233;vidente est la combinatoire des partitions possibles du texte,
qui augmente avec la taille. Un facteur humain peut aussi intervenir, li&#233; &#224; la maintenance de
l&#8217;attention de l&#8217;annotateur, qui peut &#234;tre source d&#8217;erreurs pour les textes longs &#8211; au dire des
annotateurs eux-m&#234;mes. Enfin, une cause majeure de d&#233;saccord concerne la structuration en
th&#232;mes/sous-th&#232;mes, i.e. la hi&#233;rarchisation des segments produits. Cette derni&#232;re conduit en
effet certains annotateurs &#224; diviser en plusieurs segments th&#233;matiques des portions de texte que
d&#8217;autres consid&#232;rent comme un seul segment, ce qui fait, &#224; dessein, consid&#233;rablement chuter
notre score d&#8217;accord.
</p>
<p>4 Transitions th&#233;matiques
Notre objectif central concerne, rappelons-le, l&#8217;&#233;tude des transitions entre segments th&#233;matiques.
Deux s&#233;ries d&#8217;observations peuvent &#234;tre faites &#224; ce sujet, concernant d&#8217;une part leur perception
par les annotateurs et d&#8217;autre part le rep&#233;rage d&#8217;indices &quot;de surface&quot; ce ces transitions.
</p>
<p>4.1 Les transitions th&#233;matiques sont bien per&#231;ues par les annotateurs
Comme indiqu&#233; ci-dessus, les annotateurs ont d&#251; d&#233;limiter les segments th&#233;matiques mais aussi
des introductions, des conclusions et des transitions &quot;floues&quot;. Une fois la phase d&#8217;annotation
termin&#233;e, durant le processus de d&#233;briefing, nous avons demand&#233; aux cinq annotateurs, entre
autres choses, comment ils avaient proc&#233;d&#233;. La r&#233;ponse a &#233;t&#233; claire et unanime : tout d&#8217;abord,
chercher dans le texte o&#249; se situent les changements de th&#232;mes ; ensuite, utiliser cette information
pour identifier les segments th&#233;matiques. Cette fa&#231;on de proc&#233;der leur semblait naturelle, et
a confirm&#233; nos hypoth&#232;ses : les indications de changement de th&#232;me sont essentielles pour le
lecteur, et clairement per&#231;ues par lui.
Les r&#233;sultats chiffr&#233;s vont dans le m&#234;me sens : 84% des segments th&#233;matiques ont une intro-
duction, 39% une conclusion et 16% une zone de transition &quot;floue&quot;. Sur l&#8217;ensemble des textes,
presque tous les changements de th&#232;mes sont donc accompagn&#233;s par une zone de transition, une
introduction la plupart du temps.
</p>
<p>507</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.2 Indices &quot;de surface&quot; pour les transitions th&#233;matiques
La question se pose alors de d&#233;terminer si ces zones poss&#232;dent des caract&#233;ristiques linguistiques
sp&#233;cifiques que le lecteur d&#233;tecte, et quelles sont-elles. Outre l&#8217;int&#233;r&#234;t th&#233;orique, l&#8217;identification
de telles caract&#233;ristiques est susceptible de fournir des informations utiles pour un segmenteur
automatique. Le probl&#232;me est complexe, impliquant des m&#233;canismes s&#233;mantiques et interpr&#233;tatifs
profonds, objet de divers travaux en linguistique comme rappel&#233; dans l&#8217;introduction. Mais on
peut aussi s&#8217;interroger sur la pr&#233;sence de formes de surface &quot;refl&#233;tant&quot; ces m&#233;canismes. Afin
d&#8217;&#233;tudier cette question nous avons fait les exp&#233;riences suivantes.
Comme on pouvait s&#8217;y attendre, les introductions annot&#233;es co&#239;ncident presque toujours avec
des changements de bloc, o&#249; &quot;bloc&quot; signifie &quot;paragraphe&quot; ou &quot;sous-titre&quot; 9. Ainsi, en observant le
corpus, nous avons consid&#233;r&#233; un certain nombre de traits distinctifs possibles et, pour chacun,
nous avons &#233;tabli une comparaison entre les introductions annot&#233;es et le d&#233;but des paragraphes
ne contenant pas d&#8217;introduction 10. Trois hypoth&#232;ses diff&#233;rentes ont &#233;t&#233; examin&#233;es dont les
r&#233;sultats sont pr&#233;sent&#233;s dans le tableau 2.
Les phrases introductives sont plus courtes. L&#8217;intuition est qu&#8217;elles peuvent op&#233;rer comme
de v&#233;ritables titres et transmettre l&#8217;information port&#233;e par le segment sous forme condens&#233;e.
Par ailleurs il peut sembler judicieux &#224; l&#8217;auteur (de mani&#232;re consciente ou non) de signaler
une nouvelle partie par une rupture de rythme dans le flot textuel. Les r&#233;sultats montrent une
r&#233;duction de 25% environ de la longueur des phrases des introductions th&#233;matiques par rapport
&#224; la premi&#232;re phrase des paragraphes classiques.
</p>
<p>Les introductions th&#233;matiques aiment les segments d&#233;tach&#233;s. Il est commun&#233;ment admis
que les segments d&#233;tach&#233;s en d&#233;but de phrase ou, mieux, de paragraphe sont des positions
th&#233;matiques privil&#233;gi&#233;es (Ho-Dac, 2008). Ces segments sont souvent s&#233;par&#233;s du reste du texte
par une virgule, aussi avons-nous consid&#233;r&#233; une virgule en position pr&#233;-verbale comme une
approximation acceptable pour identifier un d&#233;tachement. Le ratio des d&#233;tachements dans les
introductions est de 0, 4 contre 0,3 pour les autres paragraphes.
Les introduction th&#233;matiques ont des premiers mots pr&#233;f&#233;r&#233;s. La table 2 donne pour
chaque cat&#233;gorie morpho-syntaxique un ratio de ses occurrences en premi&#232;re position d&#8217;intro-
duction th&#233;matique, par rapport aux autres paragraphes. On notera que la balise &quot;adj&quot; (adjectif)
correspond en fait aux d&#233;monstratifs, &quot;adv&quot; (adverbe) g&#233;n&#233;ralement aux connecteurs du discours
et &quot;pun&quot; (la ponctuation) presque toujours aux guillemets de citation. Les autres abr&#233;viations d&#233;-
signent respectivement les conjonctions, les d&#233;terminants, les noms, les pr&#233;positions, les pronoms
et les verbes. Ces r&#233;sultats suscitent plusieurs remarques : les adverbes (connecteurs de discours)
sont sur-repr&#233;sent&#233;s, ce qui peut &#234;tre interpr&#233;t&#233; comme une influence de la structure rh&#233;torique
sur la structure th&#233;matique ; les conjonctions au contraire, et sans surprise, sont des marques
de continuit&#233;, de m&#234;me que les d&#233;monstratifs et les pronoms. Les d&#233;terminants et les noms
sont sur-repr&#233;sent&#233;s, probablement en raison de leur fonction de focalisation sur un r&#233;f&#233;rent de
discours (qui peut &#234;tre nouveau en cas de changement th&#233;matique). Enfin, il n&#8217;y a dans notre
corpus aucune introduction commen&#231;ant par une citation.
</p>
<p>Commentaires. Ces observations recoupent partiellement certaines hypoth&#232;ses formul&#233;es dans
la litt&#233;rature : par exemple les segments cadratifs vont appara&#238;tre dans notre premi&#232;re exp&#233;rience
en tant que constituants d&#233;tach&#233;s et on retrouve l&#8217;id&#233;e commune selon laquelle les pronoms et
les GN d&#233;monstratifs sont des marques de continuit&#233;. Ces &#233;l&#233;ments sont toutefois repris dans
</p>
<p>9. Dans Le Monde un sous-titre n&#8217;est g&#233;n&#233;ralement pas le d&#233;but d&#8217;une sous-partie, mais plut&#244;t une sorte d&#8217;indicateur
survenant en son sein, de sorte que les annotateurs ne les ont pas n&#233;cessairement &#233;tiquet&#233;s comme introductions.
</p>
<p>10. 196 introductions pour 524 paragraphes.
</p>
<p>508</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>un ensemble plus vaste de &quot;candidats&quot; (pour lesquels un examen linguistique attentif serait
int&#233;ressant). Une diff&#233;rence est l&#8217;accent mis ici sur l&#8217;identification de marques de surface l&#224; o&#249;
les &#233;tudes linguistiques proposent (avec pertinence, mais une exploitation informatique moins
imm&#233;diate) des caract&#233;risations s&#233;mantiques. Enfin notons que l&#8217;exp&#233;rience semble plaider
pour une certaine sp&#233;cificit&#233; des paragraphes introducteurs de th&#232;mes, ce qui peut questionner
l&#8217;hypoth&#232;se formul&#233;e dans (Bestgen et Pirard, 2006) selon laquelle il serait possible d&#8217;utiliser de
mani&#232;re fiable le changement de paragraphe pour &#233;tudier les ruptures th&#233;matiques.
</p>
<p>Introductions Autres paragraphes Diff&#233;rence en %
</p>
<p>Longueur des phrases 17 24 &#8722;23%
D&#233;tachement 0, 4 0,3 +25%
Premier mot
</p>
<p>adj 0,06 0, 08 &#8722;25%
adv 0,09 0, 05 +45%
con 0,01 0, 04 &#8722;75%
det 0, 4 0, 33 +20%
</p>
<p>nom 0,21 0, 16 +25%
pun 0 0, 04 &#8722;100%
pre 0,12 0, 15 &#8722;20%
pro 0, 9 0, 11 &#8722;18%
ver 0,03 0, 04 &#8722;25%
</p>
<p>TABLE 2 &#8211; Indices de changements th&#233;matiques. Introductions contre les autres paragraphes.
</p>
<p>5 Conclusion et travaux futurs
Dans cet article nous avons pr&#233;sent&#233; un ensemble d&#8217;exp&#233;riences relatives &#224; la structuration
discursive th&#233;matique, exp&#233;riences appuy&#233;es sur la constitution d&#8217;un corpus annot&#233;. De fait, le
premier r&#233;sultat positif est, selon nous, ce corpus lui-m&#234;me, le manque de ressources de ce type
&#233;tant g&#233;n&#233;ralement reconnu 11.
Nous avons &#233;galement propos&#233; une mesure d&#8217;accord multi-annotateurs adapt&#233;e &#224; l&#8217;&#233;valuation de
l&#8217;accord entre segmentations multiples. Le d&#233;faut de telles mesures rend la constitution de tels
corpus difficile et, bien qu&#8217;imparfaite (avec un l&#8217;alignement qui doit &#234;tre fait a priori notamment),
notre mesure &#224; le double avantage d&#8217;&#234;tre facile &#224; mettre en &#339;uvre et &#224; interpr&#233;ter.
L&#8217;accord inter-annotateurs semble suffisant (eu &#233;gard au caract&#232;re &#233;minemment interpr&#233;tatif du
type de structure consid&#233;r&#233;) pour en faire un outil de recherche et les observations r&#233;alis&#233;es
semblent confirmer la pertinence de la notion de zone de transition. Diff&#233;rents types d&#8217;indices
de surface ont &#233;t&#233; mis en &#233;vidence, susceptibles d&#8217;aider au rep&#233;rage de ces zones, donc &#224; la
segmentation automatique. L&#8217;int&#233;gration de ces indices dans une proc&#233;dure de segmentation
automatique &#224; base lexicale pourrait &#233;galement en constituer une validation &quot;indirecte&quot;.
Une autre perspective consiste &#224; &#233;tendre le corpus annot&#233; afin de confirmer nos observations et,
&#224; terme, autoriser la mise en &#339;uvre de proc&#233;dures d&#8217;apprentissage.
</p>
<p>11. Les annotations Glozz sont d&#233;port&#233;es, et peuvent &#234;tre obtenues sur simple demande aupr&#232;s des auteurs, charge au
demandeur de poss&#233;der les droits sur le corpus du Monde
</p>
<p>509</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>ASHER, N., DENNIS, P. et REESE, B. (2006). Names and pops and discourse structure. In Workshop
on Constraints in Discourse, pages 11&#8211;18, Maynooth.
</p>
<p>BEEFERMAN, D., BERGER, A. et LAFFERTY, J. (1999). Statistical models for text segmentation. In
Machine Learning, volume 34, pages 177&#8211;210.
</p>
<p>BESTGEN, Y. (2009). Quel indice pour mesurer l&#8217;efficacit&#233; en segmentation de textes ? Actes de
TALN&#8217;09.
</p>
<p>BESTGEN, Y. et PIRARD, S. (2006). Comment &#233;valuer les algorithmes de segmentation automa-
tiques ? essai de construction d&#8217;un mat&#233;riel de r&#233;f&#233;rence. Actes de TALN&#8217;06.
</p>
<p>CHAROLLES, M. (1997). L&#8217;encadrement du discours : univers, champs, domaines et espaces.
Cahier de Recherche Linguistique, 6:1&#8211;73.
</p>
<p>CHOI, F. Y. Y. (2000). Advances in domain independent linear text segmentation. Proceeding of
NAACL-00, pages 26&#8211;33.
</p>
<p>COUTO J., Ferret, O., GRAU, B., HERNANDEZ, N., JACKIEWICZ, A., MINEL, J. et PORHIEL, S. (2004).
R&#233;gal, un syst&#232;me pour la visualisation s&#233;lective de documents. Revue d&#8217;Intelligence Artificielle,
18(4):481&#8211;514.
</p>
<p>FLEISS, J. L. (1971). Measuring nominal scale agreement among many raters. Psychological
Bulletin, 76(5):378&#8211;382.
</p>
<p>HEARST, M. A. (1997). Texttiling : Segmenting text into multi-paragraph subtopic passages.
Computational Linguistics., 23(1):33&#8211;64.
</p>
<p>HO-DAC, L.-M. (2008). Exploring discourse organization through theme position. 19th European
Systemic Functional Linguistics Conference and Workshop (ESFLCW) : Data and interpretation.
</p>
<p>LABADI&#201;, A. et PRINCE, V. (2008). Finding text boundaries and finding topic boundaries : two
different task ? Proceedings of GoTAL 2008.
</p>
<p>MATHET, Y. et WIDL&#214;CHER, A. (2011). Une approche holiste et uni&#233;e de l&#8217;alignement et de
la mesure d&#8217;accord inter-annotateurs. In TALN 2011, volume 1, pages 247&#8211;258, Montpellier,
France.
</p>
<p>MORRIS, J. et HIRST, G. (1991). Lexical cohesion computed by thesaural relations as an indicator
of the structure of text. Computational Linguistics, 17:20&#8211;48.
</p>
<p>P&#201;RY-WOODLEY, M.-P., ASHER, N., BENAMARA, F., BRAS, M., ENJALBERT, P., FABRE, C., FERRARI, S.,
HO-DAC, L.-M., LE DRAOULEC, A., MATHET, Y., MULLER, P., PR&#201;VOT, L., REBEYROLLE, J., VERGEZ-
COURET, M., VIEU, L. et WIDL&#214;CHER, A. (2009). Annodis : une approche outill&#233;e de l&#8217;annotation
de structures discursives en corpus. Actes de TALN&#8217;09.
</p>
<p>PI&#201;RARD, S. et BESTGEN, Y. (2006). Validation d&#8217;une m&#233;thodologie pour l&#8217;&#233;tude des marqueurs
de la segmentation dans un grand corpus de textes. TAL, 2(47):89&#8211;110.
</p>
<p>WIDL&#214;CHER, A., BILHAUT, F., HERNANDEZ, N., RIOULT, F., CHARNOIS, T., FERRARI, S. et ENJALBERT, P.
(2006). Une approche hybride de la segmentation th&#233;matique : collaboration du traitement
automatique des langues et de la fouille de texte. In DEFT&#8217;06, Fribourg.
</p>
<p>WIDL&#214;CHER, A. et MATHET, Y. (2009). La plate-forme glozz : environnement d&#8217;annotation et
d&#8217;exploration de corpus. Actes de TALN&#8217;09.
</p>
<p>510</p>

</div></div>
</body></html>