<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;tection de conflits dans les communaut&#233;s &#233;pist&#233;miques en ligne</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 351&#8211;358,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>D&#233;tection de conflits
dans les communaut&#233;s &#233;pist&#233;miques en ligne
</p>
<p>Alexandre Denis1 Matthieu Quignard2 Dominique Fr&#233;ard3
</p>
<p>Fran&#231;oise D&#233;tienne3 Michael Baker3 Flore Barcellini4
(1) UMR 7503 LORIA, CNRS Campus scientifique 54 506 Vandoeuvre-l&#232;s-Nancy
</p>
<p>(2) UMR 5191 ICAR, CNRS 5 parvis Ren&#233; Descartes 69342 Lyon Cedex 07
(3) UMR 5141 LTCI, CNRS 46 rue Barrault 75 634 Paris Cedex 13
</p>
<p>(4) CNAM-CRTD, 41 rue Gay-Lussac 75 005 Paris
denis@loria.fr, matthieu.quignard@univ-lyon2.fr, {dominique.freard,
</p>
<p>francois.detienne, michael.baker}{@telecom-paristech.fr},
flore.barcellini@cnam.fr
</p>
<p>R&#201;SUM&#201;
La pr&#233;sence de conflits dans les communaut&#233;s &#233;pist&#233;miques en ligne peut s&#8217;av&#233;rer bloquante
pour l&#8217;activit&#233; de conception. Nous pr&#233;sentons une &#233;tude sur la d&#233;tection automatique de conflit
dans les discussions entre contributeurs Wikipedia qui s&#8217;appuie sur des traits de surface tels
que la subjectivit&#233; ou la connotation des &#233;nonc&#233;s et &#233;valuons deux r&#232;gles de d&#233;cision : l&#8217;une
d&#233;coule d&#8217;un mod&#232;le dialectique en exploitant localement la structure lin&#233;aire de la discussion,
la subjectivit&#233; et la connotation ; l&#8217;autre, plus globale, ne s&#8217;appuie que sur la taille des fils et les
marques de subjectivit&#233; au d&#233;triment des marques de connotation. Nous montrons que ces deux
r&#232;gles produisent des r&#233;sultats similaires mais que la simplicit&#233; de la r&#232;gle globale en fait une
approche pr&#233;f&#233;r&#233;e dans la d&#233;tection des conflits.
</p>
<p>ABSTRACT
Conflicts detection in online epistemic communities
</p>
<p>Conflicts in online epistemic communities can be a blocking factor when producing knowledge.
We present a way to automatically detect conflict in Wikipedia discussions, based on subjectivity
and connotation marks. Two rules are evaluated : a local rule that uses the structure of the
discussion threads, connotation and subjectivity marks and a global rule that takes the whole
thread into account and only subjectivity. We show that the two rules produce similar results but
that the simplicity of the global rule makes it a preferred approach to detect conflicts.
</p>
<p>MOTS-CL&#201;S : wikipedia, conflit, syntaxe, s&#233;mantique, interaction.
</p>
<p>KEYWORDS: wikipedia, conflict, syntax, semantics, interaction.
</p>
<p>1 Probl&#233;matique
</p>
<p>Les communaut&#233;s &#233;pist&#233;miques en ligne sont des communaut&#233;s qui rassemblent des individus
dans le but de concevoir collectivement des ressources : ontologies, articles, sp&#233;cifications, etc.
(Barcellini et al., 2008). Nous nous pla&#231;ons dans la perspective de l&#8217;&#233;tude de ces communaut&#233;s
et proposons un outil automatique de d&#233;tection de fils de discussion conflictuels. L&#8217;objectif est
</p>
<p>351</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>double. Tout d&#8217;abord un outil de d&#233;tection de conflit permet de rep&#233;rer automatiquement les fils
de discussion qui peuvent &#234;tre bloquants ou au contraire productifs pour l&#8217;activit&#233; de conception.
Ensuite, l&#8217;outil permet de d&#233;tecter automatiquement les individus les plus conflictuels. Dans
les deux cas, cette d&#233;tection automatique constitue un outil utile pour les gestionnaires de
communaut&#233;s.
</p>
<p>La construction d&#8217;un outil de d&#233;tection de conflits s&#8217;inscrit dans le cadre du projet CCCP-Prosodie 1,
au sein duquel la communaut&#233; Astronomie de Wikipedia fut &#233;tudi&#233;e. En particulier, l&#8217;article
d&#233;di&#233; &#224; l&#8217;astre c&#233;leste Pluton, qui a perdu son statut de plan&#232;te en 2006 fit l&#8217;objet d&#8217;intenses
discussions &#224; propos de son renommage. Dans (Fr&#233;ard et al., 2010), une annotation manuelle
des contributions des participants de la page de discussion autour de Pluton est effectu&#233;e. La
communaut&#233; est alors &#233;tudi&#233;e sous l&#8217;angle de l&#8217;&#233;volution du conflit autour du renommage gr&#226;ce
&#224; cette annotation manuelle. Toutefois les cat&#233;gories d&#8217;annotation propos&#233;es par (Fr&#233;ard et al.,
2010), elles-m&#234;mes inspir&#233;es de (Baker et al., 2009) sont difficiles &#224; reproduire automatiquement
(acte de dialogue, cat&#233;gorisation du contenu propositionnel, niveau d&#8217;expertise du contributeur)
et particuli&#232;rement sur le texte libre des pages de discussion Wikipedia.
</p>
<p>Nous proposons dans cet article d&#8217;explorer les traits accessibles par une m&#233;thode automatique
qui permettent de caract&#233;riser le conflit et proposons alors une m&#233;thode pour la d&#233;tection de
ces conflits. Nous discutons d&#8217;abord la d&#233;finition du conflit dans la partie 2, proposons plusieurs
m&#233;thodes pour d&#233;tecter le conflit dans la partie 3, et concluons par une &#233;valuation des diff&#233;rentes
m&#233;thodes dans la partie 4.
</p>
<p>2 Qu&#8217;est-ce qu&#8217;un conflit ?
</p>
<p>2.1 Le conflit dans l&#8217;argumentation
</p>
<p>La notion de conflit (ou conflit d&#8217;opinions avou&#233;es) figure &#224; la base des mod&#232;les dialectiques
de l&#8217;argumentation dans le dialogue (Barth et Krabbe, 1982; Mackenzie, 1985), qui analysent
le processus argumentatif comme un jeu d&#8217;attaques et de d&#233;fenses visant &#224; d&#233;terminer si une
proposition (ou th&#232;se) est tenable sous le feu de la critique.
</p>
<p>Selon le mod&#232;le de Barth &amp; Krabbe (op.cit), le conflit est d&#233;fini par la distribution de r&#244;les
vis-&#224;-vis d&#8217;une th&#232;se : le proposant qui doit d&#233;fendre la th&#232;se sans se d&#233;dire, l&#8217;opposant qui a le
droit d&#8217;attaquer ou mettre en doute les all&#233;gations du proposant sans toutefois revenir sur ses
propres concessions. En pratique, on observe qu&#8217;un conflit est d&#233;clar&#233; lorsque 3 actes de dialogue
(ou argumentation moves) ont &#233;t&#233; produits : (1) l&#8217;affirmation d&#8217;une proposition p, (2) l&#8217;attaque
ou la mise en doute de p, (3) la d&#233;fense de p par une justification ou une contre-attaque.
</p>
<p>Dans le cadre d&#8217;une discussion critique (ou argumentation rationnelle), les arguments ne doivent
porter que sur les &#233;nonc&#233;s et les objets de discours. Or, en r&#233;alit&#233;, et dans Wikipedia en particulier,
les participants recourent fr&#233;quemment &#224; des raisonnements fallacieux (van Eemeren et Grooten-
dorst, 1992) &#8211; arguments d&#8217;autorit&#233;, attaques &#224; la personne, etc. &#8211; dans le but de d&#233;cr&#233;dibiliser
l&#8217;interlocuteur, relativiser la port&#233;e de ses dires, voire l&#8217;exclure du d&#233;bat (cas des trolls). Il est
donc n&#233;cessaire d&#8217;&#233;tendre la notion de conflit de sorte &#224; inclure les conflits personnels, qui portent
sur la l&#233;gitimit&#233; d&#8217;une personne &#224; participer au d&#233;bat, et les conflits m&#233;ta-argumentatifs, portant
</p>
<p>1. Projet ANR n&#778; ANR-08-CORD-004
</p>
<p>352</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>sur le fait qu&#8217;un participant a respect&#233; ou non les r&#232;gles du d&#233;bat institu&#233;es par la communaut&#233;.
</p>
<p>2.2 Approche discursive du conflit
</p>
<p>La mise en &#339;uvre d&#8217;un mod&#232;le dialectique ci-dessus, qui plus est dans sa version &#233;tendue, est
largement probl&#233;matique tant elle n&#233;cessite de mobiliser des connaissances du domaine (&#233;tendues
aux personnes et aux r&#232;gles communautaires) et de techniques d&#8217;analyse de discours (van
Eemeren et al., 1993; Asher et Lascarides, 2003).
</p>
<p>Sans toutefois abandonner le mod&#232;le dialectique, nous proposons d&#8217;exploiter des indices de
surface : la polarit&#233; (connotation positive ou n&#233;gative des &#233;nonc&#233;s) et subjectivit&#233; (mentions
directe ou indirecte des locuteurs dans le discours). Si la connotation est un indice relativement
faible dans le cadre g&#233;n&#233;ral et ne suffit pas &#224; marquer fiablement une opinion et encore moins un
argument, cet indice prend tout son sens dans un contexte argumentatif. La mobilisation d&#8217;une
connotation n&#233;gative peut marquer les attaques tandis que les connotations positives peuvent
marquent les concessions et les d&#233;fenses. La subjectivit&#233;, quant &#224; elle, est d&#8217;une part une marque
d&#8217;implication du locuteur dans le discours et sert d&#8217;autre part au d&#233;marquage des th&#232;ses dans un
conflit mixte (ce que tu dis vs. ce que je dis). Elle est en outre un indice essentiel au rep&#233;rage de
conflits personnels ou m&#233;ta-argumentatifs.
</p>
<p>L&#8217;extrait de la figure 1, tir&#233; de la page de discussion de Wikipedia sur Pluton, illustre un conflit
entre deux participants, M et R. Il est remarquable que chaque message porte une connotation
n&#233;gative (neg) et que les deux participants s&#8217;engagent personnellement en utilisant la premi&#232;re
ou la seconde personne : M attaque R avec la seconde personne, et R se d&#233;fend avec la premi&#232;re
personne.
</p>
<p>M (2&#232;me, neg): ''Pluton est bien la seule plan&#232;te naine, non ?''. Merci de montrer avec une aussi 
&#233;clatante clart&#233; que finalement, tu ne connais pas grand chose en astronomie.
</p>
<p>R (1&#232;re, neg): Je voulais dire &quot;Pluton est bien la seule plan&#232;te naine &#224; s'appeler ainsi 
 (Pluton), non ?&quot;.  Merci de ne pas me prendre pour plus inculte que je ne le suis.
</p>
<p>M (2&#232;me, neg): Non. Ceres et Eris les deux autres planetes naines sont nomm&#233;es 
selon la meme convention [&#8230;] Tu comprends?
</p>
<p>R (1&#232;re, neg): En fait, ma question &#233;tait purement rh&#233;torique, je ne parlais pas 
de la d&#233;nomination avec num&#233;ro mais simplement du nom Pluton. [...]
</p>
<p>FIGURE 1 &#8211; Extrait d&#8217;un conflit alternant les marqueurs subjectifs dans un contexte n&#233;gatif
</p>
<p>Cet exemple nous incite &#224; consid&#233;rer une r&#232;gle na&#239;ve de d&#233;tection de conflit o&#249; le conflit est d&#233;fini
comme une situation n&#233;gative dans lequelle les participants alternent les marques subjectives.
Cette r&#232;gle est impl&#233;ment&#233;e et &#233;valu&#233;e dans la section 4.
</p>
<p>3 Mise en &#339;uvre
</p>
<p>Nous proposons d&#8217;explorer la pertinence des dimensions de subjectivit&#233; et de polarit&#233; pour la
d&#233;tection du conflit en deux temps : d&#8217;abord nous proposons une annotation de bas niveau des
</p>
<p>353</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#233;nonc&#233;s des participants en termes de subjectivit&#233; et de polarit&#233;, ensuite une annotation de haut
niveau afin de d&#233;terminer si un fil de discussion porte ou non un conflit.
</p>
<p>3.1 Annotation de la subjectivit&#233; et de la polarit&#233;
</p>
<p>L&#8217;annotation des traits de subjectivit&#233; et de polarit&#233; consiste &#224; associer &#224; chaque &#233;nonc&#233; et &#224;
chaque message une liste de traits.
</p>
<p>L&#8217;acquisition de la dimension de subjectivit&#233; peut &#234;tre compliqu&#233;e si on consid&#232;re la subjectivit&#233;
inh&#233;rente des adjectifs (comparer par exemple &#8220;absurde&#8221; et &#8220;incorrect&#8221;). Nous nous limitons
alors &#224; la pr&#233;sence de marques pronominales. Chaque pronom personnel (je, nous), posssessif (le
mien), et d&#233;terminant possessif (mon, n&#244;tre) de premi&#232;re personne (respectivement de deuxi&#232;me
personne) est annot&#233; subjective-1st (respectivement subjective-2nd), un &#233;nonc&#233; pouvant comporter
plusieurs de ces marques.
</p>
<p>La reconnaissance de la polarit&#233; d&#8217;un &#233;nonc&#233; est un probl&#232;me complexe car la polarit&#233; d&#8217;un
mot change en fonction du co-texte (n&#233;gation syntaxique, r&#244;le syntaxique d&#8217;un mot, etc.) ou du
contexte d&#8217;&#233;nonciation (point de vue de celui qui &#233;nonce). De nombreuses approches se sont
attaqu&#233;es au probl&#232;me g&#233;n&#233;ral dans le cadre de la d&#233;tection d&#8217;opinion ou de sentiments (Pang
et al., 2002; Wilson et al., 2009; Pak et Paroubek, 2011). Nous pouvons cependant supposer
que dans le cadre du d&#233;bat argumentatif, le probl&#232;me est moins difficile. Par exemple l&#8217;&#233;nonc&#233;
&#8220;l&#8217;&#233;cole &#233;l&#233;mentaire Gavin a &#233;t&#233; condamn&#233;e en Avril 2004&#8221; tir&#233; de (Wilson et al., 2009) illustre
l&#8217;emploi d&#8217;un mot n&#233;gatif qui exprime une opinion neutre dans le cadre g&#233;n&#233;ral mais qui peut
&#234;tre consid&#233;r&#233;e comme une attaque dans le d&#233;bat. Le probl&#232;me est alors plus simple mais non
trivial, puisque la n&#233;gation syntaxique intervient tout de m&#234;me. Y compris dans le d&#233;bat, &#8220;ce
n&#8217;est pas absurde&#8221; ne peut &#234;tre consid&#233;r&#233; comme n&#233;gatif. Nous proposons alors deux m&#233;thodes
d&#8217;annotation de la polarit&#233;, une m&#233;thode purement lexicale, et une m&#233;thode syntaxique qui
permet de filtrer des cas comme &#8220;ce n&#8217;est pas absurde&#8221;. Ces deux m&#233;thodes sont &#233;valu&#233;es et
compar&#233;es dans la section 4.
</p>
<p>Analyse lexicale L&#8217;analyse lexicale ne repose que sur la polarit&#233; des mots sans consid&#233;rer
l&#8217;influence du co-texte, le probl&#232;me se r&#233;sumant &#224; obtenir cette polarit&#233;. Il existe en Anglais des
lexiques de polarit&#233;s comme Wordnet-affect (Valitutti et al., 2004), ou SentiWordnet (Baccianella
et al., 2010). En Fran&#231;ais, on peut citer le lexique de (Mathieu, 2004) mais celui-ci est limit&#233; &#224;
950 mots. Nous avons alors proc&#233;d&#233; &#224; l&#8217;annotation manuelle en termes de polarit&#233;s (positive,
n&#233;gative ou neutre) du lexique du Fran&#231;ais fondamental qui comporte les 8000 lemmes les
plus fr&#233;quents du Fran&#231;ais (Gougenheim et al., 1964). Ce lexique &#233;tant relativement limit&#233; en
taille, nous l&#8217;avons &#233;tendu automatiquement en nous appuyant sur EuroWordnet-FR (Vossen,
1998), consid&#233;rant que les hyponymes d&#8217;un lemme connot&#233; l&#8217;&#233;taient &#233;galement. Etant donn&#233;
le lexique, l&#8217;annotation d&#8217;un &#233;nonc&#233; se limite &#224; collecter les polarit&#233;s des mots qu&#8217;il contient.
L&#8217;analyse purement lexicale consid&#232;re alors des &#233;nonc&#233;s du type &#8220;ce n&#8217;est pas absurde&#8221; comme
des &#233;nonc&#233;s n&#233;gatifs.
</p>
<p>Analyse syntaxico-s&#233;mantique profonde L&#8217;analyse profonde s&#8217;appuie sur l&#8217;analyseur syn-
taxique LLP2 (Lopez, 2000) que nous avons utilis&#233; dans plusieurs projets et dont nous souhaitions
d&#233;terminer la capacit&#233; &#224; s&#8217;adapter &#224; du texte libre. La grammaire est une grammaire LTAG (Joshi
</p>
<p>354</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>et Schabes, 1997), comportant 1500 arbres, ancr&#233;e avec le LEFFF (Sagot, 2010), un lexique
d&#8217;environ 530 000 formes fl&#233;chies. Les d&#233;rivations partielles de l&#8217;analyseur LLP2 font l&#8217;objet de
r&#233;&#233;critures successives (Bedaride et Gardent, 2009) afin de produire une forme s&#233;mantique plus
facile &#224; manipuler (120 r&#232;gles). La forme s&#233;mantique est ensuite annot&#233;e selon la polarit&#233; gr&#226;ce
&#224; des r&#232;gles qui s&#8217;appuient sur le lexique de polarit&#233;s pr&#233;c&#233;demment construit. Par exemple, un
&#233;nonc&#233; est annot&#233; n&#233;gativement s&#8217;il comporte un verbe n&#233;gatif, un modifieur n&#233;gatif (adverbe
ou adjectif) ou un verbe positif ni&#233; syntaxiquement : &#8220;je n&#8217;aime pas&#8221; sera n&#233;gatif car aimer est
positif. Les r&#232;gles les plus complexes s&#8217;appuient &#233;galement sur la taxonomie EuroWordnet, par
exemple si un &#233;nonc&#233; contient un verbe hyponyme de &#8220;penser&#8221;, ni&#233; syntaxiquement, dont la
subordonn&#233;e est polaris&#233;e, l&#8217;&#233;nonc&#233; est annot&#233; selon l&#8217;inverse de la polarit&#233; de la subordonn&#233;e,
typiquement &#8220;je ne pense pas que cela soit absurde&#8221; sera positif, car la subordonn&#233;e est n&#233;gative
et la principale ni&#233;e syntaxiquement. Au total, l&#8217;annotation de la polarit&#233; contient 55 r&#232;gles de ce
type.
</p>
<p>Qu&#8217;il s&#8217;agisse de la m&#233;thode lexicale ou syntaxique, un &#233;nonc&#233; est annot&#233; comme une liste
de marques de subjectivit&#233; et de polarit&#233;. Un &#233;nonc&#233; peut alors contenir plusieurs marques
de m&#234;me type, mais &#233;galement des marques &#224; la fois n&#233;gatives ou positives. Un message est
annot&#233; en faisant l&#8217;union des marques des &#233;nonc&#233;s qui le compose. Par exemple avec l&#8217;annotation
lexicale, le message &#8220;Merci [...] Maintenant que vous avez fait votre critique et r&#233;pandu vos
insultes, qu&#8217;attendez-vous pour nous aider &#224; am&#233;liorer les articles en utilisant votre immense
culture orthographique, historique et philosophique ?&#8221; sera annot&#233; par : [positive, subjective-2nd,
subjective-2nd, negative, subjective-2nd, negative, positive, positive].
</p>
<p>3.2 Annotation des conflits
</p>
<p>L&#8217;annotation des conflits consiste &#224; d&#233;terminer, pour un fil de discussion, s&#8217;il contient ou non
un conflit. Afin d&#8217;effectuer automatiquement cette d&#233;cision, nous proposons de comparer deux
types de r&#232;gles qui s&#8217;appuient toutes deux sur les traits de subjectivit&#233; et de polarit&#233; acquis
automatiquement par l&#8217;annotation lexicale ou syntaxique.
</p>
<p>Le premier type de r&#232;gle que nous d&#233;sirons tester est une r&#232;gle dialectique inspir&#233;e de l&#8217;exemple
de la figure 1 qui s&#8217;appuie sur la structure hi&#233;rarchique des messages sur Wikipedia, similaire &#224;
la structure qu&#8217;on peut trouver dans une liste de diffusion. Un conflit est alors d&#233;fini comme la
pr&#233;sence de deux messages dans la hi&#233;rarchie, tous deux n&#233;gatifs, et qui alternent les marques
subjectives, c&#8217;est-&#224;-dire un message s&#8217;appuyant sur la premi&#232;re personne, suivi plus loin d&#8217;un
message s&#8217;appuyant sur la seconde personne ou vice versa. Un fil de discussion est annot&#233; comme
conflict s&#8217;il contient une telle s&#233;quence et no_conflict sinon. En vertu de sa d&#233;pendance &#224; la
structure locale d&#8217;un fil, nous r&#233;f&#233;rerons &#224; cette r&#232;gle comme la r&#232;gle &#8220;locale&#8221;.
</p>
<p>Le second type de r&#232;gle est une r&#232;gle apprise &#224; partir d&#8217;un corpus annot&#233; et d&#8217;un classifieur
de type arbre de d&#233;cision (C4.5). Deux annotateurs ont annot&#233; manuellement les 153 fils de
discussion de la page de discussion associ&#233;e &#224; l&#8217;article Astrologie, un des articles appartenant
&#224; la cat&#233;gorie Wikipedia article sujet &#224; controverses. La page de discussion Astrologie contient
982 messages et rassemble 88 auteurs. Chaque fil est annot&#233; selon la pr&#233;sence ou l&#8217;absence de
conflit. L&#8217;accord inter-annotateur obtenu par la m&#233;thode du kappa est plut&#244;t bon &#954; = 0.644
(p &lt; 0.0001). Apr&#232;s adjudication (&#954;= 1.0), la page de discussion Astrologie comporte environ
20% de fils conflictuels (30 fils conflictuels pour 123 non conflictuels). Les traits d&#8217;apprentissage
sont issus de l&#8217;annotation automatique de la polarit&#233; et de la subjectivit&#233; : un fil de discussion est
</p>
<p>355</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>repr&#233;sent&#233; comme un vecteur &#224; cinq dimensions &#9001;n, p, s1, s2, t&#9002; o&#249; n est le taux de n&#233;gativit&#233; du
fil, p le taux de positivit&#233;, s1 et s2 respectivement les taux de marques subjectives de premi&#232;re et
seconde personne et t la taille du fil en termes de nombre de messages. Les taux sont calcul&#233;s
comme le rapport du nombre d&#8217;occurrence d&#8217;un marqueur dans le fil sur le nombre de mots du
fil, et sont en cons&#233;quence tr&#232;s inf&#233;rieurs &#224; 1. La m&#233;thode statistique construit alors un arbre
de d&#233;cision pour les classes conflict ou no_conflict &#224; partir de ces traits. L&#8217;arbre de d&#233;cision ainsi
obtenu s&#8217;appuie seulement sur la taille du fil et le taux de subjectivit&#233; seconde personne : si un fil
contient strictement plus de 4 messages et que son taux s2 est sup&#233;rieur &#224; 0.00274, alors le fil est
consid&#233;r&#233; comme conflictuel. En vertu de son application sur l&#8217;ensemble d&#8217;un fil, nous r&#233;f&#233;rerons
&#224; cette r&#232;gle comme la r&#232;gle &#8220;globale&#8221;.
</p>
<p>Nous &#233;valuons dans la section suivante les types de r&#232;gles d&#8217;annotation des conflits ainsi que la
pertinence de l&#8217;analyse syntaxique par rapport &#224; une simple analyse lexicale.
</p>
<p>4 Evaluation et r&#233;sultats
</p>
<p>Nous avons choisi de tester les diff&#233;rentes m&#233;thodes et r&#232;gles sur les pages de discussion associ&#233;es
aux articles Communisme et J&#233;sus de Nazareth, deux articles controvers&#233;s. Les deux pages r&#233;unies
comportent 320 fils de discussion, 2659 messages et 256 auteurs. Seule l&#8217;annotation de la page
Communisme a &#233;t&#233; faite en double, et elle fournit un bon accord inter-annotateur de &#954;= 0.79
(p &lt; 0.0001). Les deux pages r&#233;unies comportent davantage de conflits que la page Astrologie
puisqu&#8217;environ 38% des fils sont conflictuels (122 fils conflictuels pour 198 fils non conflictuels).
Le corpus de test est annot&#233; automatiquement en termes de polarit&#233; et de subjectivit&#233; selon
la m&#233;thode lexicale et la m&#233;thode syntaxique, et on &#233;value la capacit&#233; des diff&#233;rentes r&#232;gles
d&#8217;annotation des conflits &#224; reproduire correctement l&#8217;annotation manuelle.
</p>
<p>Nous r&#233;sumons l&#8217;ensemble des r&#233;sultats dans la table 1 et donnons pour chaque combinaison
de techniques (locale ou globale pour l&#8217;annotation des conflits, lexicale ou syntaxique pour
l&#8217;annotation des polarit&#233;s), le kappa, la pr&#233;cision et le rappel pour chaque cat&#233;gorie (la pr&#233;sence
de conflit C ou son absence C). La combinaison globale/syntaxique n&#8217;est pas pr&#233;sent&#233;e &#233;tant
donn&#233; qu&#8217;elle fournit des r&#233;sultats similaires &#224; la combinaison globale/lexical en vertu du fait
que la r&#232;gle globale ne repose pas sur la polarit&#233;.
</p>
<p>M&#233;thode Kappa Cat&#233;gories Rappel Pr&#233;cision F-Mesure
</p>
<p>locale/lexicale 0.70 &#177; 0.08 C 77.8 84.0 80.6
C 90.9 87.0 88.9
</p>
<p>locale/syntaxique 0.66 &#177; 0.08 C 79.5 78.9 79.2
C 86.9 87.3 87.1
</p>
<p>globale/lexicale 0.72 &#177; 0.08 C 77.9 87.2 82.3
C 92.9 87.2 90.0
</p>
<p>TABLE 1 &#8211; R&#233;sultats des diff&#233;rentes techniques sur Communisme et J&#233;sus
</p>
<p>Le premier axe de comparaison, entre la r&#232;gle locale et la r&#232;gle globale montre que la r&#232;gle
globale produit des r&#233;sultats l&#233;g&#232;rement meilleurs. Le second axe de comparaison entre l&#8217;approche
lexicale ou syntaxique sugg&#232;re que la m&#233;thode syntaxique n&#8217;apporte rien : si elle permet de
gagner environ 2 points en rappel pour la pr&#233;sence de conflits, elle en perd 7 en pr&#233;cision. Notre
</p>
<p>356</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#233;tude ne permet pas de conclure sur l&#8217;importance des polarit&#233;s dans l&#8217;&#233;tablissement d&#8217;un conflit
&#233;tant donn&#233; que les trois m&#233;thodes produisent des r&#233;sultats qui ne sont pas significativement
diff&#233;rents et que nous ignorons la qualit&#233; de l&#8217;annotation a priori des polarit&#233;s. En revanche,
cette &#233;tude met en avant l&#8217;int&#233;r&#234;t de la subjectivit&#233;. Il s&#8217;agit en effet d&#8217;un probl&#232;me beaucoup
moins complexe que celui des polarit&#233;s mais qui offre pourtant de tr&#232;s bons r&#233;sultats. L&#8217;extr&#234;me
simplicit&#233; de la r&#232;gle globale (elle peut se limiter au rep&#233;rage des pronoms de seconde personne)
sugg&#232;re alors que la subjectivit&#233; est une piste de recherche qui doit &#234;tre privil&#233;gi&#233;e pour la
d&#233;tection automatique des conflits.
</p>
<p>5 Discussion et perspectives
</p>
<p>Nous avons &#233;valu&#233; deux r&#232;gles de d&#233;tection de conflit dans des fils de discussion, s&#8217;appuyant
sur les m&#234;mes traits de surface, subjectivit&#233; et polarit&#233;, l&#8217;une fonctionnant au niveau local (deux
contributions dans le m&#234;me fil, li&#233;es dans un rapport proposition/r&#233;plique), l&#8217;autre au niveau
global (l&#8217;ensemble des traits des contributions est rapport&#233; au niveau du fil). L&#8217;&#233;valuation a
montr&#233; que malgr&#233; leur diff&#233;rence de nature ces r&#232;gles obtiennent des r&#233;sultats comparables et
de niveau tout &#224; fait correct. De plus, la r&#232;gle globale obtient un bon score malgr&#233; le fait qu&#8217;elle
n&#8217;exploite pas la polarit&#233; et que d&#8217;autre part la longueur du fil et le taux de subjectivit&#233; de seconde
personne sont des indices suffisants. Selon cette r&#232;gle, il suffit de prendre en compte le nombre
de contributions (un conflit se r&#232;gle rarement en moins de 5 interventions, car il en faut au
minimum 3 pour se d&#233;clarer) et une proportion minimale de marques subjectives de seconde
personne, c&#8217;est-&#224;-dire la pr&#233;sence durable de 2 voix, d&#8217;un &#171; dialogisme diffus &#187; (car la structure des
contributions n&#8217;est pas prise en compte). Nous estimons que la raison principale pour laquelle la
m&#233;thode globale est si efficace tient &#224; l&#8217;activit&#233; &#233;pist&#233;mique de la communaut&#233; Wikipedia : la
page de discussion est un espace de parole finalis&#233; d&#233;di&#233; &#224; la t&#226;che de conception. Or dans ce
cas, l&#8217;usage de la seconde personne est nettement moins fr&#233;quent que dans des discussions non
finalis&#233;es.
</p>
<p>Cette exp&#233;rience a montr&#233; que la piste de la subjectivit&#233; est une piste int&#233;ressante &#224; exploiter
pour la d&#233;tection des conflits. Nous pouvons tirer parti de la simplicit&#233; de la r&#232;gle globale &#8211;
ind&#233;pendante du domaine et facilement transposable &#224; d&#8217;autres langues &#8211; pour &#233;valuer si elle
reste efficace sur des discussions du Wikipedia anglophone. Par ailleurs, il est possible d&#8217;&#233;tudier
une autre facette de la subjectivit&#233; gr&#226;ce aux termes marqu&#233;s subjectivement (&#8220;absurde&#8221; versus
&#8220;incorrect&#8221;) et de v&#233;rifier alors si leur pr&#233;sence ou absence contribue &#224; am&#233;liorer la d&#233;tection des
conflits. Enfin, il peut &#234;tre int&#233;ressant de tester la place de la subjectivit&#233; dans d&#8217;autres types
d&#8217;interactions moins finalis&#233;es, par exemple dans des forums g&#233;n&#233;ralistes.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ASHER, N. et LASCARIDES, A. (2003). Logics of Conversation. Cambridge University Press,
Cambridge.
</p>
<p>BACCIANELLA, S., ESULI, A. et SEBASTIANI, F. (2010). Sentiwordnet 3.0 : An enhanced lexical
resource for sentiment analysis and opinion mining. In CALZOLARI, N., CHOUKRI, K., MAEGAARD,
B., MARIANI, J., ODIJK, J., PIPERIDIS, S., ROSNER, M. et TAPIAS, D., &#233;diteurs : Proceedings of the
</p>
<p>357</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Seventh International Conference on Language Resources and Evaluation (LREC&#8217;10), Valletta,
Malta. European Language Resources Association (ELRA).
BAKER, M., D&#201;TIENNE, F., LUND, K. et S&#201;JOURN&#201;, A. (2009). M&#233;thodologies d&#8217;analyse de situations
coop&#233;ratives de conception : le corpus MOSAIC, chapitre Etude des profils interactifs dans la
conception collective en architecture. Presses Universitaires de Nancy.
BARCELLINI, F., D&#201;TIENNE, F. et BURKHARDT, J.-M. (2008). User and developer mediation in an
open source software community : boundary spanning through cross participation in online
discussions. International Journal of Human Computer Studies, 66(7):558&#8211;570.
BARTH, E. M. et KRABBE, E. C. (1982). From Axiom to Dialogue. de Gruyter, Berlin.
BEDARIDE, P. et GARDENT, C. (2009). Semantic normalisation : a framework and an experiment.
In 8th International Workshop on Computational Semantics, Tilburg, Netherland.
FR&#201;ARD, D., DENIS, A., D&#201;TIENNE, F., BAKER, M., QUIGNARD, M. et BARCELLINI, F. (2010). The role
of argumentation in online epistemic communities : the anatomy of a conflict in wikipedia. In
Proceedings of European Conference of Cognitive Ergonomics.
GOUGENHEIM, G., MICHEA, R., RIVENC, P. et SAUVAGEOT, A. (1964). L&#8217;&#233;laboration du fran&#231;ais
fondamental : &#233;tude sur l&#8217;&#233;tablissement d&#8217;un vocabulaire et d&#8217;une grammaire de base. Didier, Paris.
JOSHI, A. et SCHABES, Y. (1997). Tree-adjoining grammars. In ROZENBERG, G. et SALOMAA, A.,
&#233;diteurs : Handbook of Formal Languages, volume 3, pages 69 &#8211; 124. Springer, Berlin, New York.
LOPEZ, P. (2000). Extended partial parsing for lexicalized tree grammars. In Proc. of the Sixth
International Workshop on Parsing Technologies (IWPT 2000), pages 159&#8211;170.
MACKENZIE, J. D. (1985). No Logic before Friday. Synthese, 63:329&#8211;341.
MATHIEU, Y. Y. (2004). A semantic lexicon for emotions and feelings. In YAN QU, James
G. Shanahan, J. W., &#233;diteur : American Association for Artificial Intelligence (AAAI) Spring
symposium on Exploring Attitude and Affect in Text, AAAI Technical Report Series, AAAI Press,
Menlo Park, USA, pages 89&#8211;93.
PAK, A. et PAROUBEK, P. (2011). Classification en polarit&#233; de sentiments avec une repr&#233;senta-
tion textuelle &#224; base de sous-graphes d&#8217;arbres de d&#233;pendance. In Proceedings of TALN 2011,
Montpellier.
PANG, B., LEE, L. et VAITHYANATHAN, S. (2002). Thumbs up ? Sentiment classification using
machine learning techniques. In Proceedings of the 2002 Conference on Empirical Methods in
Natural Language Processing (EMNLP), pages 79&#8211;86.
SAGOT, B. (2010). The LEFFF, a freely available and large-coverage morphological and syntactic
lexicon for french. In Proceedings of LREC 2010, La Valette, Malte.
VALITUTTI, A., STRAPPARAVA, C. et STOCK, O. (2004). Developing affective lexical resources.
PsychNology Journal, pages 61&#8211;83.
van EEMEREN, F. H. et GROOTENDORST, R. (1992). Communication, Argumentation, Fallacies.
Erlbaum, Mahwah, N. J.
van EEMEREN, F. H., GROOTENDORST, R., JACKSON, S. et JACOBS, S. (1993). Reconstructing
Argumentative Discourse. Studies in Rhetoric and Communication. University of Alabama Press,
London.
VOSSEN, P. (1998). EuroWordNet : a multilingual database with lexical semantic networks for
European Languages. Kluwer, Dordrecht.
WILSON, T., WIEBE, J. et HOFFMANN, P. (2009). Recognizing contextual polarity : An exploration
of features for phrase-level sentiment analysis. Computational Linguistics, 35(3):399&#8211;433.
</p>
<p>358</p>

</div></div>
</body></html>