<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Raffinement du Lexique des Verbes Fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 155&#8211;168,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Raffinement du
Lexique des Verbes Fran&#231;ais
</p>
<p>Paul B&#233;daride
Universit&#233; de Stuttgart
</p>
<p>paul.bedaride@gmail.com
</p>
<p>R&#201;SUM&#201;
Nous pr&#233;sentons dans cet article les am&#233;liorations apport&#233;es &#224; la ressource &#171; Les Verbes Fran&#231;ais &#187;
afin de la rendre plus formelle et utilisable pour le traitement automatique des langues naturelles.
Les informations syntaxiques et s&#233;mantiques ont &#233;t&#233; corrig&#233;es, restructur&#233;es, unifi&#233;es puis
int&#233;gr&#233;es &#224; la version XML de cette ressource, afin de pouvoir &#234;tre utilis&#233;e par un syst&#232;me
d&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques.
</p>
<p>ABSTRACT
Resource Refining : &#171; Les Verbes Fran&#231;ais &#187;
</p>
<p>This paper introduce the impovements we made to the resource &#171; Les Verbes Fran&#231;ais &#187; in order
to make it more usable in the field of natural language processing. Syntactic and semantic
information is corrected, restructured, unified and then integrated to the XML version of this
resource, in order to be used by a semantic role labelling system.
</p>
<p>MOTS-CL&#201;S : ressource, lexique, verbes, raffinement, &#233;tiquetage de r&#244;les s&#233;mantiques.
</p>
<p>KEYWORDS: resource, lexicon, verbs, refinement, semantic roles labeling.
</p>
<p>1 Introduction
</p>
<p>Le domaine du traitement automatique des langues naturelles n&#233;cessite &#224; la fois des ressources
repr&#233;sentant les particularit&#233;s des langues et de leurs s&#233;mantiques, ainsi que des th&#233;ories d&#8217;analyse
utilisant ces ressources. Si les th&#233;ories sont la plupart du temps rapidement adaptables d&#8217;une
langue &#224; l&#8217;autre, il n&#8217;en est pas de m&#234;me pour les ressources. En effet, les ressources devant
repr&#233;senter la richesse d&#8217;une langue, il est n&#233;cessaire de r&#233;aliser une nouvelle analyse des cas
probl&#233;matiques ou une nouvelle annotation de corpus. Si l&#8217;on peut dire que l&#8217;anglais est une
langue riche en ressources linguistiques (e.g. : PropBank, FrameNet, WordNet, . . . ), il n&#8217;en est
pas de m&#234;me pour le fran&#231;ais. Il existe des &#233;quivalents pour certains types de ressources (e.g. :
FrenchTreeBank, EuroWordNet, Wolf, . . . ), mais ils ont souvent une moins grande couverture
et une moins bonne qualit&#233;. Si les ressources linguistiques ne sont pas tr&#232;s d&#233;velopp&#233;es, c&#8217;est
parce qu&#8217;elles exigent des analyses d&#8217;experts du domaine et des annotations n&#233;cessitant une
quantit&#233; consid&#233;rable de temps et de travail, qui engendre un fort co&#251;t de production. D&#8217;un
autre cot&#233;, il existe des ressources linguistiques m&#233;connues et sous-utilis&#233;es car n&#233;cessitant des
efforts cons&#233;quents pour &#234;tre adapt&#233;es au traitement automatique des langues. Plut&#244;t que de
laisser stagner ces ressources et de cr&#233;er de nouvelles ressources &#224; partir de rien, nous avons
choisi d&#8217;am&#233;liorer l&#8217;une d&#8217;entre elles &#8211; &#171; Les verbes fran&#231;ais &#187; (Dubois et Dubois-Charlier, 1997),
</p>
<p>155</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>avec pour objectif de la rendre utilisable pour la t&#226;che d&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques. Nous
allons maintenant introduire cette ressource en &#233;voquant ses qualit&#233;s et faiblesses, ainsi que
les am&#233;liorations d&#233;j&#224; r&#233;alis&#233;es, puis nous expliquerons pourquoi cette ressource nous semble
&#234;tre un bon choix pour l&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques. Dans les sections suivantes nous
pr&#233;senterons notre objectif de ressource, les traitements r&#233;alis&#233;s pour atteindre cet objectif, ainsi
qu&#8217;une &#233;valuation de ces am&#233;liorations. Nous conclurons cet article en r&#233;sumant les gains que
nos travaux ont apport&#233;s &#224; cette ressource.
</p>
<p>2 Les Verbes Fran&#231;ais
</p>
<p>2.1 Historique
</p>
<p>Le LVF, &#171; Les Verbes Fran&#231;ais &#187;, est une ressource lexicale r&#233;alis&#233;e par Jean Dubois et Fran&#231;oise
Dubois-Charlier, dont l&#8217;objectif est de fournir une description linguistique des verbes, bas&#233;e
sur l&#8217;ad&#233;quation entre sch&#232;mes syntaxiques et interpr&#233;tation s&#233;mantique (Levin, 1993). Cette
ressource a &#233;t&#233; confi&#233;e dans un premier temps &#224; un industriel qui n&#8217;a pas su l&#8217;utiliser, ainsi qu&#8217;&#224;
un &#233;diteur qui ne l&#8217;a pas publi&#233; (elle fut distribu&#233;e sous la forme de photocopies). Comme ces
deux entreprises d&#233;tenaient les droits d&#8217;utilisation, cette ressource ne pouvait pas &#234;tre diffus&#233;e
afin d&#8217;&#234;tre largement utilis&#233;e et am&#233;lior&#233;e. Ils ont cependant accept&#233; apr&#232;s un certain temps, de
restituer aux auteurs le droit de diffuser leur ressource comme ils le souhaitaient.
</p>
<p>Depuis sa lib&#233;ration en 2007 sous la forme d&#8217;un fichier Excel (eLVF), un nombre croissant de
personnes se sont int&#233;ress&#233;es &#224; cette ressource. Un des premiers constats r&#233;alis&#233; fut que Jean
Dubois et Fran&#231;oise Dubois-Charlier ont d&#233;velopp&#233; le eLVF sans se soucier des probl&#232;mes que les
informaticiens pourraient avoir pour utiliser leur ressource dans le traitement automatique de la
langue fran&#231;aise. Une grande partie des probl&#232;mes est cependant due aux limites d&#8217;espace de
stockage existantes lors de la cr&#233;ation du LVF. Un grand nombre de mots ont ainsi &#233;t&#233; tronqu&#233;s ou
abr&#233;g&#233;s. La repr&#233;sentation de la ressource sous la forme d&#8217;un tableau limite sa structuration, et
les formats utilis&#233;s pour certains champs ne sont pas assez formels. Enfin, l&#8217;ouvrage &#171; Les verbes
fran&#231;ais &#187; est obligatoire pour comprendre tous les codes et formats utilis&#233;s dans la version Excel
du LVF(eLVF).
</p>
<p>2.2 Description
</p>
<p>Le eLVF est compos&#233; de 25 609 entr&#233;es repr&#233;sentant les diff&#233;rents sens de 12 310 verbes. Il y a
4 188 verbes &#224; plusieurs entr&#233;es et un verbe peut avoir jusqu&#8217;&#224; 61 entr&#233;es (e.g. :pour le verbe
&#171; passer &#187;). Une entr&#233;e est compos&#233;e des onze champs suivants :
</p>
<p>&#8211; MOT : entr&#233;e du verbe &#224; l&#8217;infinitif
&#8211; DOMAINE : code donnant l&#8217;emploi principal (g&#233;ologie, psychologie, . . . )
</p>
<p>et le niveau de langue (familier, vieux, litt&#233;raire, . . . )
&#8211; CLASSE : code d&#233;finissant la classe syntactico-s&#233;mantique (appartenant &#224; une hi&#233;rarchie)
&#8211; OP&#201;RATEUR : d&#233;finition syntactico-semantique de l&#8217;entr&#233;e
&#8211; SENS : synonymes et d&#233;finitions abr&#233;g&#233;es
&#8211; PHRASE : exemples d&#8217;utilisation de ce sens
</p>
<p>156</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M DOM CLA OPER SENS PHRASE C CONST DER N L
</p>
<p>amasser 01 OBJ L3b lc.qp qc+pl e amas accumuler On a~des documents,des livres. 1aZ T1801 -1- -D ---- -- 3* 2
Les preuves s&#8217;a~contre P. P8001
</p>
<p>amasser 02 MON L4b lc.qp arg e tas accumuler On a de l&#8217;argent,de l&#8217;or.. 1aZ T1301 --- -- ---- -- - 5
On a~sans cesse.L&#8217;argent s&#8217;a~ P3001
</p>
<p>amasser 03(s) LOC U1a (qn+pl)li.simul qp se grouper La foule s&#8217;a~sur la place. 1aZ P7001 --- -- ---- -- - 5
</p>
<p>TABLE 1 &#8211; Entr&#233;es du eLVF pour le verbe &#171; amasser &#187;
</p>
<p>&#8211; CONJUGAISON : codes permettant de conjuguer le verbe
&#8211; CONSTRUCTIONS : codes pour obtenir les sch&#232;mes de construction syntaxique
&#8211; D&#201;RIVATIONS : codes pour produire les adjectifs verbaux et les d&#233;riv&#233;s nominaux
&#8211; NOM : code pour produire le mot dont le verbe est d&#233;riv&#233;
&#8211; LEXIQUE : code pour obtenir le type de dictionnaire o&#249; l&#8217;entr&#233;e est r&#233;pertori&#233;e
</p>
<p>La table 1 recense les entr&#233;es du eLVF repr&#233;sentant les diff&#233;rents sens du verbe &#171; amasser &#187; (i.e. :
&#171; accumuler des objets &#187;, &#171; accumuler de l&#8217;argent &#187;, &#171; se grouper quelque part &#187;). Le eLVF donne
les informations suivantes sur le premier sens de ce verbe : il est utilis&#233; dans le DOMAINE des
objets ; sa CLASSE s&#233;mantique est mettre quelque chose quelque part, dans/sur un lieu, autour de
quelque chose ; son OP&#201;RATEUR signifie &#234;tre ou mettre quelque part plusieurs choses en amas ; il a
pour synonyme le verbe &#171; accumuler &#187;, il est r&#233;alis&#233; dans les PHRASES d&#8217;exemple &#171; On amasse
des documents. &#187; et &#171; Les preuves s&#8217;amassent contre Pierre. &#187; ; il fait partie des verbes du premier
groupe avec un auxiliaire &#171; avoir &#187; pour le transitif et &#171; &#234;tre &#187; pour le pronominal ; il se r&#233;alise
dans un cadre transitif avec un sujet humain, un objet choses, et un circonstant locatif (o&#249; on
est) ainsi que dans un cadre pronominal avec sujet choses et un circonstant locatif ; l&#8217;adjectif
&#171; amassable &#187; et le d&#233;verbal &#171; amas &#187; en sont des d&#233;riv&#233;s ; et il provient d&#8217;un dictionnaire de base
de 15 000 mots. Une bonne connaissance des encodages est clairement n&#233;cessaire pour d&#233;river
ces informations &#224; partir de l&#8217;entr&#233;e du eLVF. Nous n&#8217;allons pas d&#233;crire plus pr&#233;cis&#233;ment tous les
champs 1, car cela serait trop long, mais nous allons nous focaliser sur les champs les plus utiles
pour la t&#226;che d&#8217;&#233;tiquetage de r&#244;le s&#233;mantiques : les champs op&#233;rateur et constructions.
</p>
<p>Le champ OP&#201;RATEUR interpr&#232;te s&#233;mantiquement les sch&#232;mes syntaxiques. Il est compos&#233; d&#8217;un
pr&#233;dicat (le premier token qui n&#8217;est pas entre parenth&#232;ses), et d&#8217;un certain nombre d&#8217;arguments.
Les d&#233;finitions des pr&#233;dicats et de certaines abr&#233;viations sont accessibles dans la version papier
du LVF. Le sujet du pr&#233;dicat, qui est optionnel, est d&#233;fini entre parenth&#232;ses juste avant le pr&#233;dicat.
Les autres arguments suivent le pr&#233;dicat et peuvent &#234;tre form&#233;s d&#8217;un ou plusieurs mots. Les
limites des arguments n&#8217;&#233;tant pas d&#233;finies, c&#8217;est &#224; l&#8217;utilisateur d&#8217;identifier les diff&#233;rents arguments
&#224; l&#8217;aide de ses connaissances de la langue et de ses capacit&#233;s de raisonnement. Il existe deux
types d&#8217;arguments : les contraintes syntaxico-s&#233;mantiques pouvant &#234;tre r&#233;alis&#233;s syntaxiquement
et les sp&#233;cifications s&#233;mantiques pr&#233;cisant la s&#233;mantique du pr&#233;dicat. Un argument est une
contrainte syntaxico-s&#233;mantique s&#8217;il est le sujet du pr&#233;dicat, s&#8217;il appartient &#224; un certain ensemble
d&#8217;abr&#233;viations (e.g. : qc, qn, . . . ) ou s&#8217;il est compos&#233; d&#8217;une pr&#233;position en capitales ; et est une
sp&#233;cification s&#233;mantique dans le reste des cas. Par exemple, dans la premi&#232;re entr&#233;e du verbe
&#171; amasser &#187;, qc+pl repr&#233;sente une contrainte alors que e amas repr&#233;sente une sp&#233;cification. Des
op&#233;rateurs de disjonction (i.e. : / ,) permettent d&#8217;associer plusieurs contraintes &#224; un m&#234;me
emplacement s&#233;mantique.
</p>
<p>Le champ CONSTRUCTIONS liste les diff&#233;rents sch&#233;mas syntaxiques pouvant &#234;tre r&#233;alis&#233;s. Un
sch&#233;ma syntaxique commence par une lettre en capitale, qui d&#233;finit son type et celui de ses
</p>
<p>1. Pour une description compl&#232;te de la ressource : http://margaux.philosophie.uni-stuttgart.de/lvf/
</p>
<p>157</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A intransitif sujet + circonstant
N transitif indirect sujet + compl&#233;ment pr&#233;positionnel
T transitif direct sujet + obj. direct + cpl. pr&#233;p. + circonstant
P pronominal sujet + obj. direct + cpl. pr&#233;p. + circonstant
</p>
<p>TABLE 2 &#8211; Type de CONSTRUCTION avec arguments associ&#233;s
</p>
<p>arguments. La table 2 donne les quatre types de sch&#232;mes existant dans le LVF avec le type de leurs
arguments. Chaque argument encode une contrainte syntaxique ou s&#233;mantique par un chiffre ou
une lettre. Un sujet ou un objet ayant pour valeur 1 repr&#233;sente une contrainte s&#233;mantique sur le
domaine de l&#8217;humain, un circonstant avec la valeur 1 repr&#233;sente une contrainte s&#233;mantique sur
le domaine locatif (o&#249; on est) et un compl&#233;ment pr&#233;positionnel ayant pour valeur b repr&#233;sente
une contrainte syntaxique sur un compl&#233;ment pr&#233;positionnel avec la pr&#233;position &#171; de &#187;. Nous
donnerons uniquement la signification des codes que nous utiliserons dans cet article, et nous
vous renvoyons &#224; la version papier de LVF ou &#224; notre wiki 1 si vous souhaitez &#233;tudier les autres
codes.
</p>
<p>L&#8217;espace de stockage &#233;tant nettement moins probl&#233;matique de nos jours, il serait int&#233;ressant
de d&#233;coder la ressource pour la rendre plus lisible et utilisable. C&#8217;est ce qu&#8217;ont commenc&#233; &#224;
faire Hadouche et Lapalme (Hadouche et Lapalme, 2010) en transformant le eLVF au format
XML ainsi qu&#8217;une interface de consultation 2, comme nous allons le voir dans la sous-section
suivante. Dans leur article pr&#233;sentant la version XML du eLVF (xLVF), ils ont compar&#233; le eLVF
avec des ressources existantes pour l&#8217;anglais (VerbNet(Schuler, 2005), FrameNet(Baker et al.,
1998), WordNet(Fellbaum, 1998)) et le fran&#231;ais (Dicovalence(Mertens, 2010)). Pour r&#233;sumer
ce comparatif, nous pouvons dire que les approches utilis&#233;es par les ressources sont vari&#233;es
(pronominale pour Dicovalence, distributionnelle et transformationnelle pour le LVF, &#224; base de
cadres s&#233;mantique pour FrameNet, et d&#8217;ensembles de synonymes pour WordNet), mais qu&#8217;elles
ont toutefois un certain nombre de points communs dans leur repr&#233;sentation de la description
des unit&#233;s lexicales, et de la hi&#233;rarchisation des donn&#233;es. D&#8217;apr&#232;s cette comparaison le eLVF est
une bonne ressource linguistique car il int&#232;gre une grande partie des informations contenues
dans les autres ressources, comme la hi&#233;rarchisation du sens des verbes avec les CLASSES, la
description de la s&#233;mantique avec le champ OP&#201;RATEUR, et une liste de SYNONYMES pour chaque
entr&#233;e. Il manque cependant certaines informations comme la gestion des r&#244;les th&#233;matiques,
mais le eLVF propose des informations que les autres ressources ne contiennent pas comme la
gestion du sens figur&#233; des verbes.
</p>
<p>2.3 La version XML
</p>
<p>Nous allons maintenant parler de la version XML du eLVF d&#233;velopp&#233;e par Hadouche et Lapalme.
Cette version du eLVF a pour objectif de rendre la ressource plus accessible, utilisable et extensible.
Pour cela ils ont informatis&#233; la description des diff&#233;rents codes contenus dans la version papier
du LVF sous la forme de fichiers XML (voir figure 1). Ils ont ensuite g&#233;n&#233;r&#233; un fichier XML
repr&#233;sentant les donn&#233;es du eLVF d&#233;compress&#233;es. La figure 2 nous montre la version XML du
verbe &#171; amasser &#187;. Les informations d&#8217;origine ont &#233;t&#233; conserv&#233;es dans le fichier &#224; l&#8217;int&#233;rieur des
balises et les codes d&#233;compress&#233;s sont repr&#233;sent&#233;s par des attributs associ&#233;s &#224; ces balises. Toutes
les informations n&#8217;ont pas &#233;t&#233; compl&#232;tement d&#233;compress&#233;es, comme pour le code de CLASSE L3b
dont nous savons qu&#8217;il repr&#233;sente la classe g&#233;n&#233;rique Locatif avec un sujet non-anim&#233; propre
</p>
<p>2. http://rali.iro.umontreal.ca/Dubois/
</p>
<p>158</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&lt;classes&gt;
&lt;generique code=&quot;C&quot; desc=&quot;communication&quot;&gt;
&lt;semantico-syntaxique code=&quot;C1&quot; desc=&quot;s&#8217;exprimer par un son, une parole&quot;&gt;
&lt;sous-classe-syntaxique code=&quot;C1a&quot; desc=&quot;&#233;mettre un cri, humain ou animal&quot;/&gt;
&lt;sous-classe-syntaxique code=&quot;C1b&quot; desc=&quot;&#233;mettre un chant, humain&quot;/&gt;
...
</p>
<p>&lt;/semantico-syntaxique&gt;
&lt;semantico-syntaxique code=&quot;C2&quot; desc=&quot;dire/demander qc&quot;&gt;
&lt;sous-classe-syntaxique code=&quot;C2a&quot; desc=&quot;dire que, dire qc &#224; qn&quot;/&gt;
&lt;sous-classe-syntaxique code=&quot;C2b&quot; desc=&quot;dire que, donner un ordre &#224; qn&quot;/&gt;
...
</p>
<p>&lt;/semantico-syntaxique&gt;
...
</p>
<p>&lt;/generique&gt;
...
</p>
<p>&lt;/classes&gt;
</p>
<p>FIGURE 1 &#8211; Codes du xLVF pour les CLASSES
</p>
<p>mais pas qu&#8217;il repr&#233;sente mettre quelque chose quelque part, dans/sur un lieu, autour de quelque
chose. Certains champs ont aussi &#233;t&#233; restructur&#233;s comme les PHRASES, les CONSTRUCTIONS et les
D&#201;RIVATIONS o&#249; les informations ont &#233;t&#233; s&#233;par&#233;es. Il est dommage que Hadouche et Lapalme aient
uniquement int&#233;gr&#233; la description des codes au XML, car des traitements comme la d&#233;rivation
des adjectifs, des adverbes et des noms auraient aussi pu &#234;tre int&#233;gr&#233;s &#224; cette nouvelle version.
</p>
<p>2.4 Le LVF pour l&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques
</p>
<p>Le LVF n&#8217;a pas &#233;t&#233; con&#231;u pour l&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques, mais il contient n&#233;anmoins des
informations pertinentes pour cette t&#226;che. Les champs OP&#201;RATEUR, CONSTRUCTIONS et DOMAINE
donnent des informations sur la syntaxe, la s&#233;mantique et l&#8217;utilisation des diff&#233;rentes entr&#233;es
associ&#233;es &#224; un verbe. L&#8217;exploitation de ces informations devrait permettre l&#8217;identification du
sens utilis&#233; et de projeter les arguments syntaxiques sur une repr&#233;sentation s&#233;mantique (i.e. : le
champ op&#233;rateur). Un syst&#232;me utilisant cette ressource serait diff&#233;rent de ceux existants, bas&#233;s
essentiellement sur de l&#8217;apprentissage automatique appliqu&#233; &#224; de grand corpus annot&#233;s, car il
utiliserait les contraintes syntaxiques et s&#233;mantiques d&#233;finies manuellement par Jean Dubois
et Fran&#231;oise Dubois-Charlier. Le champ PHRASE pourrait &#234;tre utilis&#233; comme corpus d&#8217;exemples
permettant une premi&#232;re &#233;valuation d&#8217;un syst&#232;me d&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques. Dans
un premier temps, nous allons d&#233;finir notre objectif de restructuration de la ressource, puis
nous d&#233;crirons les diff&#233;rents traitements effectu&#233;s pour l&#8217;atteindre et nous terminerons sur une
&#233;valuation de la ressource obtenue.
</p>
<p>3 Objectif
</p>
<p>Pour qu&#8217;un syst&#232;me puisse utiliser le xLVF pour faire de l&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques, il doit
&#234;tre capable d&#8217;en extraire les informations n&#233;cessaires. Il est aussi important de pouvoir faire
le lien entre les diff&#233;rents types d&#8217;information de la ressource, ainsi qu&#8217;avec des informations
contenues dans d&#8217;autres ressources (e.g. : Wolf, Disco, French TreeBank). Il est donc n&#233;cessaire
de restructurer et d&#8217;uniformiser un certain nombre d&#8217;informations du xLVF. De plus, il serait
int&#233;ressant d&#8217;utiliser les phrases d&#8217;exemple afin de concevoir un corpus annot&#233;, m&#234;me si celui-ci
n&#8217;est pas forc&#233;ment repr&#233;sentatif. La figure 3 montre ce que l&#8217;on souhaite obtenir pour la premi&#232;re
</p>
<p>159</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&lt;verbe mot=&quot;amasser&quot; nb=&quot;3&quot; id=&quot;amasser&quot;&gt;
&lt;entree&gt;
&lt;mot no=&quot;1&quot;&gt;amasser 01&lt;/mot&gt;
&lt;domaine nom=&quot;objet&quot;&gt;OBJ&lt;/domaine&gt;
&lt;classe generique=&quot;locatif&quot; semantico-syntaxique=&quot;non-anim&#233; propre&quot;
</p>
<p>construction-syntaxique=&quot;b&quot;&gt;L3b&lt;/classe&gt;
&lt;operateur&gt;lc.qp qc+pl e amas&lt;/operateur&gt;
&lt;sens&gt;accumuler&lt;/sens&gt;
&lt;phrases&gt;
&lt;phrase&gt;On &lt;lexie-ref&gt;a&#8764;&lt;/lexie-ref&gt; des documents,des livres.&lt;/phrase&gt;
&lt;phrase&gt;Les preuves s&#8217;&lt;lexie-ref&gt;a&#8764;&lt;/lexie-ref&gt; contre P.&lt;/phrase&gt;
</p>
<p>&lt;/phrases&gt;
&lt;conjugaison auxiliaire=&quot;avoir (sauf si pronominal ou entr&#233;e en &#234;tre)&quot;
</p>
<p>groupe=&quot;1&quot; sous-groupe=&quot;chanter&quot;&gt;1aZ&lt;/conjugaison&gt;
&lt;construction&gt;
&lt;scheme type=&quot;transitif direct&quot; sujet=&quot;humain&quot; objet=&quot;pluriel chose&quot;
</p>
<p>circonstant=&quot;locatif (ou on est)&quot;&gt;T1801&lt;/scheme&gt;
&lt;scheme type=&quot;pronominal&quot; sujet=&quot;pluriel chose&quot;
</p>
<p>circonstant=&quot;locatif (ou on est)&quot;&gt;P8001&lt;/scheme&gt;
&lt;/construction&gt;
&lt;derivation der-e=&quot;positif seul&quot;
der-ment=&quot;il n&#8217;y a pas de nom en -ment mais il y a un d&#233;verbal&quot;&gt;
-1- -D ---- --
</p>
<p>&lt;/derivation&gt;
&lt;nom nb=&quot;3&quot;&gt;3*&lt;/nom&gt;
&lt;lexique desc=&quot;dictionnaire de base&quot; nbmots=&quot;15000&quot;&gt;2&lt;/lexique&gt;
</p>
<p>&lt;/entree&gt;
...
</p>
<p>&lt;/verbe&gt;
</p>
<p>FIGURE 2 &#8211; Entr&#233;e du xLVF pour le verbe &#171; amasser &#187;
</p>
<p>entr&#233;e du verbe &#171; amasser &#187;.
</p>
<p>Il est n&#233;cessaire d&#8217;uniformiser la ressource pour deux raisons. Premi&#232;rement pour qu&#8217;un syst&#232;me
utilisant la ressource ne traite pas diff&#233;remment une information qui aurait deux repr&#233;sentations
distinctes, comme les abr&#233;viations lgt et lgts pour &#171; longtemps &#187; ou poissons et poisson+pl pour
repr&#233;senter le pluriel de &#171; poisson &#187;. La seconde raison est de rendre la ressource plus interop&#233;rable
avec d&#8217;autres ressources. Pour identifier les arguments d&#8217;un pr&#233;dicat, les contraintes s&#233;mantiques
du xLVF peuvent &#234;tre exploit&#233;es, mais il est n&#233;cessaire d&#8217;utiliser des ressources comme Wolf
(Sagot et Fi&#353;er, 2008) ou Disco (Kolb, 2009) pour associer un type s&#233;mantique aux arguments
(e.g. : humain, chose, . . . ). Ces ressources n&#8217;ayant pas connaissance des abr&#233;viations utilis&#233;es par
le xLVF, il est n&#233;cessaire de remplacer les abr&#233;viations et les mots tronqu&#233;s par les lemmes les
repr&#233;sentant et de pr&#233;f&#233;rer la repr&#233;sentation du pluriel par l&#8217;utilisation de l&#8217;attribut &#171; +pl &#187;.
</p>
<p>L&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques a pour but d&#8217;identifier les arguments du pr&#233;dicat et leur
associer des r&#244;les s&#233;mantiques. L&#8217;utilisation de contraintes syntaxiques et s&#233;mantiques est une
des solutions envisageables pour r&#233;aliser cette t&#226;che. Pour cela, il est important d&#8217;avoir des
informations syntaxiques et s&#233;mantiques structur&#233;es et inter-connect&#233;es pour chaque sens de
chaque verbe. Ces informations doivent permettre de projeter la syntaxe sur la s&#233;mantique et
inversement. Il est aussi important de bien s&#233;parer les informations syntaxiques et s&#233;mantiques,
afin de permettre une meilleure coh&#233;rence de la ressource. Dans le xLVF, ces informations sont
m&#233;lang&#233;es, et le m&#234;me type d&#8217;information peut se retrouver &#224; diff&#233;rents endroits, ce qui peut
mener &#224; des incoh&#233;rences. Le champ OP&#201;RATEUR sera utilis&#233; comme base pour la s&#233;mantique et le
champ CONSTRUCTEUR comme base pour la syntaxe.
</p>
<p>Le cadre s&#233;mantique est d&#233;fini comme un pr&#233;dicat auquel sont associ&#233;s des arguments et des
contraintes s&#233;mantiques. Les contraintes s&#233;mantiques ont des identifiants permettant d&#8217;associer
</p>
<p>160</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ses arguments &#224; ceux des cadres syntaxiques. Le pr&#233;dicat a pour valeur un des diff&#233;rents pr&#233;dicats
du champ OP&#201;RATEUR (e.g. : r.d : rendre/devenir tel). Les arguments s&#233;mantiques pr&#233;cisent
la s&#233;mantique du pr&#233;dicat et ne peuvent pas &#234;tre r&#233;alis&#233;s syntaxiquement. Les contraintes
s&#233;mantiques permettront de d&#233;finir le type des diff&#233;rents arguments du pr&#233;dicat (e.g. : un
humain, une chose, un animal) qui pourront &#234;tre r&#233;alis&#233;s syntaxiquement.
</p>
<p>Les cadres syntaxiques sont ceux utilis&#233;s par le champ CONSCRUCTIONS (i.e. : intransitif, transitif
indirect, transitif direct, pronominal). Les arguments sont d&#233;finis par un type, un compl&#233;ment
selon le cas (e.g. : une pr&#233;position) ainsi que des liens vers les arguments s&#233;mantiques r&#233;alis&#233;s.
Un argument syntaxique peut r&#233;aliser plusieurs arguments s&#233;mantiques. Ainsi, dans la phrase
&#171; Marie se maquille &#187;, on a une variation syntaxique pronominale r&#233;fl&#233;chie et Marie endosse les
r&#244;les d&#8217;agent et d&#8217;exp&#233;rient.
</p>
<p>Le corpus d&#8217;exemples sera compos&#233; de phrases simples mettant en avant les diff&#233;rentes fa&#231;ons
de r&#233;aliser les diff&#233;rents sens de chaque verbe. Ces phrases seront analys&#233;es en d&#233;pendances,
et poss&#233;deront des annotations permettant de savoir quel cadre syntaxique leur est associ&#233; et &#224;
quels arguments s&#233;mantiques correspondent leurs arguments syntaxiques.
</p>
<p>4 Transformation
</p>
<p>Nous allons maintenant d&#233;crire les diff&#233;rents traitements appliqu&#233;s au xLVF pour atteindre notre
objectif. La production de cette nouvelle ressource est compos&#233;e de sept &#233;tapes : l&#8217;uniformisation
du champ OP&#201;RATEUR, sa structuration, la r&#233;cup&#233;ration de donn&#233;es &#224; partir de la version papier
du LVF, l&#8217;alignement des CONSTRUCTIONS, la liaison des champs OP&#201;RATEUR et CONSTRUCTIONS, la
r&#233;partition de l&#8217;information et enfin la construction du corpus d&#8217;exemples.
</p>
<p>L&#8217;&#233;tape d&#8217;uniformisation du champ OP&#201;RATEUR permet de corriger les abr&#233;viations et les mots
tronqu&#233;s. Un ensemble de mots suspects n&#8217;apparaissant pas dans les noms et adjectifs de
Morphalou (Romary et al., 2004) a &#233;t&#233; r&#233;cup&#233;r&#233; automatiquement (947 mots). Les occurrences
de chaque mot ont &#233;t&#233; examin&#233;es manuellement afin d&#8217;identifier s&#8217;il s&#8217;agissait d&#8217;une abr&#233;viation,
d&#8217;un mot tronqu&#233; ou mal orthographi&#233;, ou encore d&#8217;un mot technique n&#8217;existant pas dans
Morphalou. Une d&#233;finition ou une correction a ensuite &#233;t&#233; associ&#233;e &#224; chaque mot. Les diff&#233;rentes
orthographes d&#8217;un mot ont &#233;t&#233; homog&#233;n&#233;is&#233;es dans la d&#233;finition afin qu&#8217;il y ait une repr&#233;sentation
unique par sens. La d&#233;finition longtemps a ainsi &#233;t&#233; associ&#233;e aux abr&#233;viations lgt et lgts. Les
mots ayant plusieurs orthographes (e.g. : acuponcture, acupuncture) ont &#233;t&#233; unifi&#233;s &#224; l&#8217;aide
de Morphalou et du Wiktionnaire, pour que les verbes ayant des orthographes diff&#233;rentes aient
l&#224; m&#234;me s&#233;mantique (e.g. : &#171; acuponcturer &#187; et &#171; acupuncturer &#187;). La gestion du pluriel a &#233;t&#233;
uniformis&#233;e en prenant le singulier des mots et en leur ajoutant l&#8217;attribut +pl. Le mot plantes est
ainsi devenu plante+pl.
</p>
<p>La seconde &#233;tape consiste &#224; traiter le champ OP&#201;RATEUR afin d&#8217;obtenir une structure proche
de celle du cadre s&#233;mantique d&#233;fini pr&#233;c&#233;demment. Pour cela, nous avons d&#251; identifier le
pr&#233;dicat et ses arguments, d&#233;terminer pour chaque argument s&#8217;il repr&#233;sentait une contrainte
syntaxico-s&#233;mantique ou une sp&#233;cification s&#233;mantique, et discerner la port&#233;e des disjonctions.
Nous avons choisi d&#8217;utiliser des m&#233;thodes d&#8217;analyse de surface car elles sont robuste et facilement
maintenable. Ces aspects sont importants, car le champ OP&#201;RATEUR comporte un grand nombre
de cas particuliers que nous avons d&#251; g&#233;rer au fur et &#224; mesure de leur rencontre. Dans un premier
</p>
<p>161</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&lt;CadreSemantique&gt;
&lt;Contrainte cidx=&quot;0&quot; desc=&quot;humain&quot; /&gt;
&lt;Predicat desc=&quot;&#234;tre ou mettre quelque part&quot; /&gt;
&lt;Contrainte cidx=&quot;1&quot; pluriel=&quot;True&quot; desc=&quot;chose&quot; /&gt;
&lt;Semantique sidx=&quot;0&quot; prep=&quot;en&quot; desc=&quot;amas&quot; /&gt;
&lt;Contrainte cidx=&quot;2&quot; desc=&quot;locatif (o&#249; on est)&quot; /&gt;
</p>
<p>&lt;/CadreSemantique&gt;
</p>
<p>&lt;CadresSyntaxiques&gt;
&lt;CadreSyntaxique type=&quot;transitif direct&quot;&gt;
&lt;Argument type=&quot;sujet&quot;&gt;
&lt;LienSemantique cidx=&quot;0&quot; /&gt;
</p>
<p>&lt;/Argument&gt;
&lt;Argument type=&quot;objet&quot;&gt;
&lt;LienSemantique cidx=&quot;1&quot; /&gt;
</p>
<p>&lt;/Argument&gt;
&lt;Argument type=&quot;circonstant&quot;&gt;
&lt;LienSemantique cidx=&quot;2&quot; /&gt;
</p>
<p>&lt;/Argument&gt;
&lt;/CadreSyntaxique&gt;
&lt;CadreSyntaxique type=&quot;pronominal&quot;&gt;
&lt;Argument type=&quot;sujet&quot;&gt;
&lt;LienSemantique cidx=&quot;1&quot; /&gt;
</p>
<p>&lt;/Argument&gt;
&lt;Argument type=&quot;circonstant&quot;&gt;
&lt;LienSemantique cidx=&quot;2&quot; /&gt;
</p>
<p>&lt;/Argument&gt;
&lt;/CadreSyntaxique&gt;
</p>
<p>&lt;/CadresSyntaxiques&gt;
</p>
<p>&lt;Phrases&gt;
&lt;Phrase text=&quot;On a&#8764; des documents.&quot;&gt;
&lt;Dep dep=&quot;root&quot; wid=&quot;2&quot; form=&quot;a&#8764;&quot; lemma=&quot;a&#8764;&quot; pos=&quot;V&quot; srl=&quot;transitif direct&quot; &gt;
&lt;Dep dep=&quot;suj&quot; wid=&quot;1&quot; form=&quot;On&quot; lemma=&quot;on&quot; pos=&quot;CL&quot; cidx=&quot;0&quot; /&gt;
&lt;Dep dep=&quot;obj&quot; wid=&quot;4&quot; form=&quot;documents&quot; lemma=&quot;document&quot; pos=&quot;N&quot; cidx=&quot;1&quot;&gt;
&lt;Dep dep=&quot;det&quot; wid=&quot;3&quot; form=&quot;des&quot; lemma=&quot;un&quot; pos=&quot;D&quot; /&gt;
</p>
<p>&lt;/Dep&gt;
&lt;Dep dep=&quot;ponct&quot; wid=&quot;5&quot; form=&quot;.&quot; lemma=&quot;.&quot; pos=&quot;PONCT&quot; /&gt;
</p>
<p>&lt;/Dep&gt;
&lt;/Phrase&gt;
&lt;Phrase text=&quot;On a&#8764; des livres.&quot;&gt;
&lt;Dep dep=&quot;root&quot; wid=&quot;2&quot; form=&quot;a&#8764;&quot; lemma=&quot;a&#8764;&quot; pos=&quot;V&quot; srl=&quot;transitif direct&quot;&gt;
&lt;Dep dep=&quot;suj&quot; wid=&quot;1&quot; form=&quot;On&quot; lemma=&quot;on&quot; pos=&quot;CL&quot; cidx=&quot;0&quot;/&gt;
&lt;Dep dep=&quot;obj&quot; wid=&quot;4&quot; form=&quot;livres&quot; lemma=&quot;livre&quot; pos=&quot;N&quot; cidx=&quot;1&quot;&gt;
&lt;Dep dep=&quot;det&quot; wid=&quot;3&quot; form=&quot;des&quot; lemma=&quot;un&quot; pos=&quot;D&quot; /&gt;
</p>
<p>&lt;/Dep&gt;
&lt;Dep dep=&quot;ponct&quot; wid=&quot;5&quot; form=&quot;.&quot; lemma=&quot;.&quot; pos=&quot;PONCT&quot; /&gt;
</p>
<p>&lt;/Dep&gt;
&lt;/Phrase&gt;
&lt;Phrase text=&quot;Les preuves s&#8217; a&#8764; contre P.&quot;&gt;
&lt;Dep dep=&quot;root&quot; wid=&quot;4&quot; form=&quot;a&#8764;&quot; lemma=&quot;a&#8764;&quot; pos=&quot;V&quot; srl=&quot;pronominal&quot;&gt;
&lt;Dep dep=&quot;suj&quot; wid=&quot;2&quot; form=&quot;preuves&quot; lemma=&quot;preuve&quot; pos=&quot;N&quot; cidx=&quot;1&quot;&gt;
&lt;Dep dep=&quot;det&quot; wid=&quot;1&quot; form=&quot;Les&quot; lemma=&quot;le&quot; pos=&quot;D&quot; /&gt;
</p>
<p>&lt;/Dep&gt;
&lt;Dep dep=&quot;aff&quot; wid=&quot;3&quot; form=&quot;s&#8217;&quot; lemma=&quot;il&quot; pos=&quot;CL&quot; /&gt;
&lt;Dep dep=&quot;mod&quot; wid=&quot;5&quot; form=&quot;contre&quot; lemma=&quot;contre&quot; pos=&quot;P&quot; cidx=&quot;0&quot;&gt;
&lt;Dep dep=&quot;obj&quot; wid=&quot;6&quot; form=&quot;Pierre&quot; lemma=&quot;pierre&quot; pos=&quot;N&quot; /&gt;
</p>
<p>&lt;/Dep&gt;
&lt;Dep dep=&quot;ponct&quot; wid=&quot;7&quot; form=&quot;.&quot; lemma=&quot;.&quot; pos=&quot;PONCT&quot; /&gt;
</p>
<p>&lt;/Dep&gt;
&lt;/Phrase&gt;
</p>
<p>&lt;/Phrases&gt;
</p>
<p>FIGURE 3 &#8211; Objectif d&#8217;am&#233;lioration
</p>
<p>162</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 f.ire/PRD abs/ABR SR/PP faire aller quelque chose d&#8217;abstrait sur focaliser l&#8217;attention sur
</p>
<p>2 abda/PRD chemin/MOT abs/ABR A/PP qn/ABR enlever chemin abstrait &#224; quelqu&#8217;un couper la route du succ&#232;s
</p>
<p>3 ict/PRD total/MOT soi/ABR abs/ABR frapper totalement soi abstrait se suicider
</p>
<p>4 abda/PRD pr/PP soi/ABR abs/ABR obtenir pour soi quelque chose d&#8217;abstrait acqu&#233;rir de l&#8217;exp&#233;rience
</p>
<p>5 loq/PRD AV/PP qn/ABR D/PP //DIS SR/PP prix/ parler avec quelqu&#8217;un de prix, sur le prix marchander
</p>
<p>6 dat/PRD A/PP qc/ABR ,/DIS A/PP +inf/ATT donner &#224; quelque chose, &#224; (infinitif) contribuer
</p>
<p>contrainte syntaxico-s&#233;mantique argument s&#233;mantique disjonction
</p>
<p>TABLE 3 &#8211; Structuration du champ OP&#201;RATEUR
</p>
<p>temps nous avons &#233;tiquet&#233; les tokens pour abstraire les r&#232;gles de l&#8217;analyse de surface. L&#8217;&#233;tiquette
utilis&#233;e par d&#233;faut repr&#233;sente un mot (MOT). Les autres &#233;tiquettes d&#233;finissent les pr&#233;dicats (PRD),
les pr&#233;positions (PP), les abr&#233;viations (ABR), les attributs (ATT), et les diff&#233;rents symboles (e.g :
(),/-). L&#8217;&#233;tiquetage a &#233;t&#233; r&#233;alis&#233; gr&#226;ce &#224; des lexiques d&#233;finis manuellement et en fonction de
l&#8217;emplacement des tokens. L&#8217;analyse de surface a ensuite &#233;t&#233; r&#233;alis&#233;e &#224; partir d&#8217;un ensemble de
r&#232;gles g&#233;n&#233;rales, bas&#233;es sur les &#233;tiquettes, et d&#8217;un ensemble de r&#232;gles sp&#233;cifiques, bas&#233;es sur les
mots. Les trois gros probl&#232;mes de la structuration de ce champ furent le regroupement de tokens
pour former les arguments, la gestion de la port&#233;e des disjonctions, et le typage des arguments.
Des r&#232;gles g&#233;n&#233;rales permettent de regrouper des suites de mots et des pr&#233;positions avec le
groupe &#224; leur droite. Il existe cependant des cas o&#249; les abr&#233;viations et les mots peuvent &#234;tre
regroup&#233;s entre eux comme les exemples 2 et 3 de la table 3. La t&#226;che n&#8217;est pas triviale car le
regroupement de certains tokens est d&#233;pendant du contexte. L&#8217;abr&#233;viation abs peut &#234;tre reconnue
comme un argument canonique d&#233;signant un concept abstrait (e.g. : exemple 1, &#171; une id&#233;e &#187;),
o&#249; &#234;tre associ&#233;e &#224; un autre token pour l&#8217;abstraire (e.g. : exemple 2, &#171; le chemin du succ&#232;s &#187;. Son
association d&#233;pend de son emplacement, du pr&#233;dicat de l&#8217;OP&#201;RATEUR, et du token auquel elle
peut se lier. Des r&#232;gles sp&#233;cifiques utilisant des lexiques ont &#233;t&#233; mises en &#339;uvre pour g&#233;rer ces
cas particuliers. Les exemples 5 et 6 montrent que les disjonctions peuvent avoir des port&#233;es plus
ou moins grandes. Le choix de la port&#233;e des arguments se fait en fonction des &#233;tiquettes des
groupes adjacents &#224; la disjonction. La port&#233;e courte se fait en priorit&#233; sur les disjonctions ayant
des tokens adjacents avec les m&#234;mes &#233;tiquettes (e.g. : exemple 5). La port&#233;e longue se fait &#224; la
fin en prenant les groupes adjacent &#224; la disjonction (e.g. : exemple 6). Pour la derni&#232;re &#233;tape,
consistant &#224; typer les arguments, nous avons utilis&#233; la casse des pr&#233;position, les &#233;tiquettes des
tokens, ainsi que le pr&#233;dicat et l&#8217;emplacement de l&#8217;argument par rapport &#224; celui-ci. La table 3
nous montre diff&#233;rents exemples d&#8217;identification du type des arguments.
</p>
<p>Un premier essai d&#8217;alignement des CONSTRUCTIONS nous a r&#233;v&#233;l&#233; que les informations contenues
dans le xLVF n&#8217;&#233;taient pas suffisantes. Il est n&#233;cessaire, entre autre, de savoir si le verbe est factitif
et de connaitre le type des constructions pronominales (i.e. : subjectif, r&#233;fl&#233;chi, r&#233;ciproque, passif)
pour lever les ambig&#252;it&#233;s existantes. Ces informations apparaissant dans la version papier du LVF,
nous avons entrepris de les extraire &#224; partir d&#8217;une version PDF du LVF. Le PDF a tout d&#8217;abord &#233;t&#233;
converti en HTML 3 pour avoir un format plus facilement analysable. Des expression r&#233;guli&#232;res
bas&#233;es sur les balises HTML et sur diff&#233;rents mots-cl&#233;s ont permis d&#8217;identifier les donn&#233;es utiles.
Une analyse de surface a &#233;t&#233; effectu&#233;e pour donner du volume &#224; cette suite d&#8217;&#233;l&#233;ments afin de
g&#233;n&#233;rer un fichier XML (le xoLVF, voir figure 4) contenant les informations de la version papier du
LVF dans un format univoque et structur&#233;. En plus de ces informations, la description compl&#232;te
de la classification des verbes a &#233;t&#233; r&#233;cup&#233;r&#233;e, ajoutant deux nouveaux niveaux de classification.
</p>
<p>3. gr&#226;ce &#224; pdftohtml
</p>
<p>163</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&lt;LVF&gt;
&lt;ClasseGenerique nom=&quot;C&quot; nombre=&quot;2039&quot; desc=&quot;de communication&quot;&gt;
&lt;ClasseSemantique nom=&quot;C1&quot; nombre=&quot;1059&quot; desc=&quot;exprimer par cri, parole, son&quot;&gt;
&lt;Classe nom=&quot;C1a&quot; nombre=&quot;232&quot; desc=&quot;&#233;mettre un cri, humain ou animal&quot;&gt;
&lt;SousClasse nom=&quot;1&quot; desc=&quot;&#233;mettre le cri sp&#233;cifique de l&#8217;esp&#232;ce animale&quot;&gt;
&lt;Const nom=&quot;A20&quot; desc=&quot;intransitifs&quot; intran=&quot;True&quot;&gt;
&lt;Entree nom=&quot;aboyer 01&quot; oper=&quot;(canis)f.cri esp&#232;ce&quot;
</p>
<p>sens=&quot;&#233;mettre aboiement&quot; phrase=&quot; Le chien a&#8764; .&quot;
deriv=&quot;aboi,-&quot;&gt;
</p>
<p>...
&lt;/Const&gt;
...
</p>
<p>&lt;/SousClasse&gt;
&lt;SousClasse nom=&quot;2&quot; desc=&quot;&#233;mettre une des diverses formes de parler ou
</p>
<p>d&#8217;&#233;crit sp&#233;cifiques &#224; l&#8217;humain&quot;&gt;
&lt;Const nom=&quot;A16&quot; desc=&quot;intransitifs&quot; intran=&quot;True&quot;&gt;...&lt;/Const&gt;
&lt;Const nom=&quot;P1006&quot; desc=&quot;pronominaux&quot; prono=&quot;subjectif&quot;&gt;...&lt;/Const&gt;
...
</p>
<p>&lt;/SousClasse&gt;
...
</p>
<p>&lt;/Classe&gt;
...
</p>
<p>&lt;/ClasseSemantique&gt;
...
</p>
<p>&lt;/ClasseGenerique&gt;
...
</p>
<p>&lt;/LVF&gt;
</p>
<p>FIGURE 4 &#8211; Extrait du xoLVF, la version structur&#233;e de l&#8217;ouvrage LVF accessible sur notre wiki1
</p>
<p>&#192; l&#8217;aide des informations compl&#233;mentaires extraites du LVF, l&#8217;alignement des CONSTRUCTIONS
associ&#233;es &#224; une entr&#233;e a pu &#234;tre effectu&#233;. Les contraintes syntaxico-s&#233;mantiques des constructions
ont &#233;t&#233; utilis&#233;es afin d&#8217;identifier les arguments compatibles. Un ensemble de contraintes limitant
les associations possibles entre les arguments des diff&#233;rentes constructions a &#233;t&#233; d&#233;fini. Une
premi&#232;re contrainte, g&#233;rant l&#8217;identit&#233;, permet d&#8217;associer des arguments ayant des codes identiques
(e.g. : sujet humain et objet humain). Une autre contrainte permet d&#8217;aligner un argument pluriel
avec deux arguments singuliers du m&#234;me type (e.g. : sujet humain pluriel). Les informations
extraites du LVF interdisent les associations entre certains emplacements (e.g. : le sujet d&#8217;un
transitif et le sujet d&#8217;un pronominal passif), emp&#234;chent l&#8217;alignement de certains emplacements
(e.g. : sujet des factitifs), et permettent de lier un &#233;l&#233;ment &#224; plusieurs du m&#234;me type (e.g. :
pronominaux r&#233;ciproques et r&#233;fl&#233;chis). D&#8217;autres contraintes plus sp&#233;cifiques ont &#233;t&#233; rajout&#233;es
apr&#232;s une analyse des premiers r&#233;sultats, comme celle permettant de lier un argument de type
humain pluriel avec un argument de type humain et un argument pr&#233;positionnel en &#171; &#224; &#187;. Cet
ensemble de contraintes ne permettant pas de lever toutes les ambig&#252;it&#233;s, l&#8217;alignement donne la
priorit&#233; aux premiers arguments. Ainsi, pour les CONSTRUCTIONS T1100 et A10 (&#171; applaudir &#187;), le
sujet de l&#8217;intransitif est li&#233; au sujet du transitif (et pas &#224; son objet direct).
</p>
<p>La liaison des champs OP&#201;RATEUR et CONSTRUCTIONS peut &#234;tre accomplie maintenant qu&#8217;ils ont
&#233;t&#233; uniformis&#233;s et structur&#233;s. Pour cela, la redondance des informations contenue dans ces deux
champs est utilis&#233;e. Les arguments des diff&#233;rentes CONSTRUCTIONS sont li&#233;es aux arguments
de l&#8217;OP&#201;RATEUR en prenant soin de lier les arguments des CONSTRUCTIONS ayant &#233;t&#233; associ&#233;s
pr&#233;c&#233;demment, au m&#234;me argument de l&#8217;OP&#201;RATEUR. L&#8217;op&#233;ration est similaire &#224; l&#8217;&#233;tape de liaison
des CONSTRUCTEURS, mais est plus complexe car l&#8217;OP&#201;RATEUR a un vocabulaire plus vari&#233;. Comme
pr&#233;c&#233;demment, des r&#232;gles avec diff&#233;rentes priorit&#233;s permettant de lier les &#233;l&#233;ments entre eux ont
&#233;t&#233; utilis&#233;es. Des r&#232;gles bas&#233;es sur les informations syntaxiques permettent de lier les contraintes
similaires, comme celles ayant des pr&#233;positions identiques. Des r&#232;gles bas&#233;es sur l&#8217;emplacement
</p>
<p>164</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Verbe Sens Const Phrase
</p>
<p>expirer 04
&#171; faire sortir de A 10 0 &#171; Pierre expire &#187;
</p>
<p>l&#8217;air de soi &#187; T 10 31 0 0 &#171; Pierre expire de l&#8217;air &#187;
</p>
<p>pr&#233;occuper 03 &#171; &#234;tre inquiet &#187;
A 10 0 &#171; Pierre est pr&#233;occup&#233; &#187;
T 31 10 0 0 &#171; L&#8217;avenir de son fils pr&#233;occupe Pierre &#187;
</p>
<p>accoucher 01 &#171; enfanter &#187;
N 10 b1 &#171; Marie accouche de Pierre &#187;
A 10 0 &#171; Marie accouche &#187;
T&#8224; 12 10 0 83 &#171; Le m&#233;decin accouche Marie &#187;
</p>
<p>lib&#233;rer 04 &#171; affranchir &#187;
T 10 11 b2 0 &#171; On lib&#232;re Pierre de l&#8217;emprise de sa m&#232;re &#187;
P&#8225; 10,1 0 b2 0 &#171; On se lib&#232;re de l&#8217;influence de Pierre &#187;
</p>
<p>0 :rien, 1 :humain, 3 :chose, 8 :instrumental/moyen, b :pr&#233;position &#171; de &#187;
&#8224; : factitif, &#8225; : pronominal r&#233;flechi
</p>
<p>TABLE 4 &#8211; Exemples de CONSTRUCTIONS
</p>
<p>f.ex
qn
</p>
<p>D suj&#233;tion
</p>
<p>1
1
b
0
</p>
<p>T
</p>
<p>1
0
b
0
</p>
<p>P
</p>
<p>humain
faire sortir
</p>
<p>humain
suj&#233;tion
</p>
<p>sujet
objet
</p>
<p>pr&#233;p. en &#171; de &#187;
Transitif
</p>
<p>sujet
pr&#233;p. en &#171; de &#187; Pronominal
</p>
<p>FIGURE 5 &#8211; Alignement et redistribution des champs OP&#201;RATEUR et CONSTRUCTIONS de &#171; lib&#233;rer 04 &#187;
</p>
<p>permettent d&#8217;associer le sujet de l&#8217;OP&#201;RATEUR avec le sujet de la premi&#232;re CONSTRUCTION. Enfin,
le dernier type de r&#232;gle est bas&#233; sur la s&#233;mantique et permet &#224; des contraintes s&#233;mantiques
similaires d&#8217;&#234;tre li&#233;es. Si un argument d&#8217;une CONSTRUCTION ne peut &#234;tre li&#233; &#224; aucun argument de
l&#8217;OP&#201;RATEUR (e.g. : si l&#8217;OP&#201;RATEUR n&#8217;a pas de sujet), un argument factice est cr&#233;&#233;. La partie gauche
de la figure 5 nous donne un exemple d&#8217;alignement, montrant les projections des constructions
syntaxiques transitive et pronominale r&#233;fl&#233;chie de l&#8217;entr&#233;e &#171; lib&#233;rer 04 &#187; sur son op&#233;rateur.
</p>
<p>L&#8217;&#233;tape finale consiste &#224; redistribuer les informations s&#233;mantiques et syntaxiques afin d&#8217;atteindre
l&#8217;objectif d&#233;fini dans la section 3. L&#8217;OP&#201;RATEUR est utilis&#233; comme base pour le cadre s&#233;mantique et
les CONSTRUCTIONS comme base pour les cadres syntaxiques. Les informations syntaxiques des
contraintes de l&#8217;OP&#201;RATEUR ont &#233;t&#233; transf&#233;r&#233;es au niveau des CONSTRUCTIONS et les contraintes
s&#233;mantiques des CONSTRUCTIONS ont &#233;t&#233; transf&#233;r&#233;es au niveau de l&#8217;OP&#201;RATEUR. Les arguments
s&#233;mantiques de l&#8217;OP&#201;RATEUR ont &#233;t&#233; laiss&#233;s tel quel. La partie droite de la figure 5 nous montre
la redistribution et la transformation des codes pour l&#8217;entr&#233;e &#171; lib&#233;rer 04 &#187;. Le r&#233;sultat final
correspond bien &#224; l&#8217;objectif de la figure 3.
</p>
<p>Pour la cr&#233;ation du corpus d&#8217;exemples, nous avons utilis&#233; les PHRASES associ&#233;es aux diff&#233;rentes
entr&#233;es. Le premier probl&#232;me est que ces exemples peuvent repr&#233;senter plusieurs phrases (e.g. :
&#171; On a&#8764;des documents,des livres. &#187;, &#171; amasser &#187;). Nous avons donc d&#251; d&#233;composer ces exemples
en phrases canonique &#224; l&#8217;aide d&#8217;outils d&#8217;analyse de surface. La d&#233;composition n&#8217;est pas toujours
possible comme pour certains verbes avec des sujets pluriel et singulier (e.g. : &#171; Ses forces, la
chance ont a&#8764; Pierre . &#187;, &#171; abandonner &#187;). Le second probl&#232;me est que le verbe est repr&#233;sent&#233; par
son initiale suivie du symbole &#8764;, et donc un analyseur syntaxique normal ne pourra pas analyser
</p>
<p>165</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>correctement ces exemples. Pour r&#233;soudre ce probl&#232;me, nous avons entrain&#233; un analyseur
syntaxique (Bohnet et al., 2010) sur une version modifi&#233;e du FrenchTreeBank(Abeill&#233; et al.,
2000). Nous avons remplac&#233; tous les verbes en t&#234;te de phrase par leur initiale suivie du symbole
&#8764;. Nous n&#8217;avons pas remplac&#233; tous les verbes car il existe des entr&#233;es avec des compl&#233;ments
syntagmatiques o&#249; le verbe est conjugu&#233; (i.e. : &#171; On v&#8764;qu&#8217;il soit heureux. &#187;, &#171; vouloir &#187;). L&#8217;autre
int&#233;r&#234;t d&#8217;avoir uniquement transform&#233; les verbes en t&#234;te de phrase est que cela pousse l&#8217;analyseur
syntaxique &#224; prendre le verbe abr&#233;g&#233; comme t&#234;te de la phrase. L&#8217;association des r&#244;les s&#233;mantiques
aux arguments syntaxiques a &#233;t&#233; effectu&#233;e &#224; l&#8217;aide de r&#232;gles de r&#233;&#233;criture permettant d&#8217;identifier
les types de constructions syntaxiques utilis&#233;es. Les informations s&#233;mantiques n&#8217;ont pas &#233;t&#233;
n&#233;cessaires car nous connaissions le sens du verbe et les r&#233;alisations syntaxiques utilis&#233;es dans le
xLVF sont assez limit&#233;es.
</p>
<p>5 &#201;valuation
</p>
<p>L&#8217;&#233;valuation de la qualit&#233; des am&#233;liorations r&#233;alis&#233;es a &#233;t&#233; effectu&#233;e &#224; l&#8217;aide de scripts permettant
de v&#233;rifier la coh&#233;rence de la ressource obtenue, ainsi que par une analyse manuelle d&#8217;un
&#233;chantillon repr&#233;sentatif.
</p>
<p>La v&#233;rification automatis&#233;e de la coh&#233;rence de la ressource est importante car elle est peu
couteuse et permet d&#8217;&#233;viter nombre d&#8217;erreurs. Ce contr&#244;le a &#233;t&#233; fait &#224; l&#8217;aide de scripts v&#233;rifiant
que :
&#8211; un OP&#201;RATEUR a un sujet, un pr&#233;dicat et un certain nombre d&#8217;arguments compl&#233;mentaires,
&#8211; le xoLVF contient le bon nombre d&#8217;entr&#233;es pour chaque classe et sous-classe,
&#8211; les arguments du CONSTRUCTEUR sont tous li&#233;s &#224; ceux de l&#8217;OP&#201;RATEUR
Pour l&#8217;&#233;valuation manuelle, un &#233;chantillon repr&#233;sentatif de 100 entr&#233;es a &#233;t&#233; extrait puis examin&#233;
afin de v&#233;rifier si le r&#233;sultat obtenu &#233;tait celui souhait&#233;. Chaque entr&#233;e a &#233;t&#233; contr&#244;l&#233;e sur la
correction des abr&#233;viations, la structuration de l&#8217;OP&#201;RATEUR, la liaison des CONSTRUCTEURS, et la
liaison de l&#8217;OP&#201;RATEUR avec les CONSTRUCTEURS. Sur les 100 entr&#233;es analys&#233;es 84 sont bonnes,
13 ont des erreurs dues &#224; notre analyses et 3 ont des erreurs dues au xLVF. Parmi les erreurs de
nos analyses, il y en a 3 de structuration de l&#8217;OP&#201;RATEUR, 1 de liaison des CONSTRUCTEURS et 9 de
liaison OP&#201;RATEUR-CONSTRUCTEUR. Les erreurs sont dues &#224; certaines entr&#233;es manquantes dans les
lexiques. Par exemple, org mvs (i.e. : un mauvais organe) n&#8217;est pas regroup&#233; en un seul terme lors
de la structuration de l&#8217;OP&#201;RATEUR, et les contraintes du CONTRUCTEUR sur le domaine des choses
ne sont pas li&#233;es avec les arguments coup et viande des OP&#201;RATEURS (car ces deux mots ne sont
pas consid&#233;r&#233;s comme des choses). La plupart des erreurs sont donc facilement corrigibles en
ajoutant des entr&#233;es aux lexiques. Les erreurs dues au xLVF sont dues &#224; certaines pr&#233;positions qui
ne sont pas mises en majuscules et qui sont donc consid&#233;r&#233;s comme des arguments uniquement
s&#233;mantiques, comme pour l&#8217;entr&#233;e &#171; ressaisir 01 &#187; o&#249; l&#8217;argument P SOM de l&#8217;OP&#201;RATEUR GRP+RE QN
P SOM () devrait &#234;tre associ&#233; au circonstant de mani&#232;re du CONSTRUCTEUR P1108.
</p>
<p>Nous avons analys&#233; 100 phrases annot&#233;es afin de v&#233;rifier si les diff&#233;rentes &#233;tapes de l&#8217;annotation
se sont bien d&#233;roul&#233;es. Cette analyse indique que 70 phrases ont &#233;t&#233; bien annot&#233;es, et poss&#232;dent
les bons r&#244;les s&#233;mantiques. Les probl&#232;mes rencontr&#233;s dans les 30 autres phrases sont de natures
diverses. Le probl&#232;me le plus apparent est le mauvais filtrage des structures en d&#233;pendances (15
phrases). En effet, les tournures ne correspondant pas &#224; celles que nous avions identifi&#233; n&#8217;ont
pas &#233;t&#233; &#233;tiquet&#233;es. Cela est toutefois facilement corrigible en int&#233;grant ces nouvelles tournures &#224;
</p>
<p>166</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>nos r&#232;gles de filtrage. Le second probl&#232;me rencontr&#233; est la mauvaise analyse des exemples par
l&#8217;analyseur syntaxique (6 phrases). Par exemple, il arrive que des groupes pr&#233;positionnels soient
rattach&#233;s &#224; un argument plut&#244;t qu&#8217;au verbe. Un autre probl&#232;me provient de la mauvaise liaison
entre les constructions et les op&#233;rateurs. Nous nous retrouvons donc &#224; associer les arguments
syntaxiques aux mauvais arguments s&#233;mantiques. Le dernier probl&#232;me est la mauvaise s&#233;paration
des diff&#233;rents exemples (3 phrases). Il arrive ainsi d&#8217;avoir une phrase avec plusieurs occurrences
du verbe ou d&#8217;un de ses arguments. Les r&#233;sultats de cette analyse sont donc positifs &#233;tant
donn&#233; que la plupart des phrases ont &#233;t&#233; bien annot&#233;es et qu&#8217;une grande parties des erreurs est
corrigible.
</p>
<p>6 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; des am&#233;liorations du xLVF qui donnent &#224; cette ressource une nouvelle
dimension. Les informations son structur&#233;es, moins ambig&#252;es et plus uniformes, permettant ainsi
l&#8217;utilisation du xLVF pour faire de l&#8217;&#233;tiquetage de r&#244;les s&#233;mantiques. Ces am&#233;liorations vont aussi
permettre de nouvelles am&#233;liorations du xLVF comme identifier quelles sont les entr&#233;es d&#8217;un
verbe qui sont SYNONYMES d&#8217;une entr&#233;e (pour le moment les SYNONYMES sont des verbes et non des
entr&#233;es). Ainsi, on sait que l&#8217;entr&#233;e &#171; humilier 01 &#187; a pour SYNONYME le verbe &#171; abaisser &#187;, mais on
ne sait pas si c&#8217;est l&#8217;entr&#233;e &#171; abaisser 01 &#187; (&#171; On abaisse le rideau. &#187;) ou l&#8217;entr&#233;e &#171; abaisser 06 &#187; (&#171; On
abaisse Pierre. &#187;) qui est SYNONYME. Cette nouvelle version pourra aussi &#234;tre utilis&#233;e pour effectuer
des recherches plus pr&#233;cises sur le xLVF, permettant par exemple &#224; des linguistes d&#8217;identifier des
verbes ayant certaines caract&#233;ristiques syntaxiques et s&#233;mantiques. Les deux fichiers XML obtenus
sont en libre acc&#232;s sur notre wiki http://margaux.philosophie.uni-stuttgart.de/lvf/.
Nous pensons prochainement associer cette ressource avec Disco et Wolf pour annoter le French
TreeBank.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et KINYON, A. (2000). Building a treebank for french. In In Proceedings
of the LREC 2000.
</p>
<p>BAKER, C. F., FILLMORE, C. J. et LOWE, J. B. (1998). The berkeley framenet project. In Proceedings
of the COLING-ACL, Montreal, Canada.
</p>
<p>BOHNET, B., WANNER, L., MILLE, S. et BURGA, A. (2010). Broad coverage multilingual deep
sentence generation with a stochastic multi-level realizer. In Proceedings of the 23rd International
Conference on Computational Linguistics, COLING &#8217;10, pages 98&#8211;106, Stroudsburg, PA, USA.
Association for Computational Linguistics.
</p>
<p>DUBOIS, J. et DUBOIS-CHARLIER, F. (1997). Les verbes fran&#231;ais. Larousse-Bordas.
</p>
<p>FELLBAUM, C., &#233;diteur (1998). WordNet An Electronic Lexical Database. The MIT Press, Cambridge,
MA ; London.
</p>
<p>FRAN&#199;OIS, J., PESANT, D. et LEEMAN, D. (2007). Le classement syntactico-s&#233;mantique des verbes
fran&#231;ais. Langue fran&#231;aise. Larousse.
</p>
<p>167</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HADOUCHE, F. et LAPALME, G. (2010). Une version &#233;lectronique du LVF compar&#233;e avec d&#8217;autres
ressources lexicales. Langages, 10(179-180):193&#8211;220. Mise en page diff&#233;rente que celle parue
dans la revue.
</p>
<p>KINGSBURY, P. et PALMER, M. (2003). Propbank : The next level of treebank. In Proceedings of
Treebanks and Lexical Theories, V&#228;xj&#246;, Sweden.
</p>
<p>KOLB, P. (May 2009). Experiments on the difference between semantic similarity and relatedness.
In Proceedings of the 17th Nordic Conference on Computational Linguistics - NODALIDA &#8217;09,
Odense, Denmark.
</p>
<p>LEVIN, B. (1993). English verb classes and alternations : a preliminary investigation. University of
Chicago Press.
</p>
<p>MERTENS, P. (2010). Restrictions de s&#233;lection et r&#233;alisations syntagmatiques dans dicovalence.
In Actes TALN 2010, Montreal, Canada.
</p>
<p>ROMARY, L., SALMON-ALT, S. et FRANCOPOULO, G. (2004). Standards going concrete : from LMF
to Morphalou. In Workshop Enhancing and Using Electronic Dictionaries, page 7 p, Geneva,
Switzerland. none. Colloque avec actes et comit&#233; de lecture. internationale.
</p>
<p>SAGOT, B. et FI&#352;ER, D. (2008). Building a free French wordnet from multilingual resources. In
OntoLex, Marrakech, Morocco.
</p>
<p>SCHULER, K. K. (2005). Verbnet : a broad-coverage, comprehensive verb lexicon. Th&#232;se de doctorat,
, Philadelphia, PA, USA. AAI3179808.
</p>
<p>168</p>

</div></div>
</body></html>