<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Simplification syntaxique de phrases pour le fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 211&#8211;224,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Simplification syntaxique de phrases pour le fran&#231;ais
</p>
<p>Laetitia Brouwers1, 2 Delphine Bernhard1, 3
</p>
<p>Anne-Laure Ligozat1, 4 Thomas Fran&#231;ois2, 5
(1) LIMSI-CNRS, 91403 Orsay, France
</p>
<p>(2) Universit&#233; catholique de Louvain, Belgique
(3) LiLPa, Universit&#233; de Strasbourg, France
</p>
<p>(4) ENSIIE, Evry, France
(5) University of Pennsylvania, USA
</p>
<p>R&#201;SUM&#201;
Cet article pr&#233;sente une m&#233;thode de simplification syntaxique de textes fran&#231;ais. La simplification
syntaxique a pour but de rendre des textes plus abordables en simplifiant les &#233;l&#233;ments qui posent
probl&#232;me &#224; la lecture. La m&#233;thode mise en place &#224; cette fin s&#8217;appuie tout d&#8217;abord sur une &#233;tude de
corpus visant &#224; &#233;tudier les ph&#233;nom&#232;nes linguistiques impliqu&#233;s dans la simplification de textes en
fran&#231;ais. Nous avons ainsi constitu&#233; un corpus parall&#232;le &#224; partir d&#8217;articles de Wikip&#233;dia et Vikidia,
ce qui a permis d&#8217;&#233;tablir une typologie de simplifications. Dans un second temps, nous avons
impl&#233;ment&#233; un syst&#232;me qui op&#232;re des simplifications syntaxiques &#224; partir de ces observations.
Des r&#232;gles de simplification ont &#233;t&#233; d&#233;crites afin de g&#233;n&#233;rer des phrases simplifi&#233;es. Un module
s&#233;lectionne ensuite le meilleur ensemble de phrases. Enfin, nous avons men&#233; une &#233;valuation de
notre syst&#232;me montrant qu&#8217;environ 80% des phrases g&#233;n&#233;r&#233;es sont correctes.
</p>
<p>ABSTRACT
Syntactic Simplification for French Sentences
</p>
<p>This paper presents a method for the syntactic simplification of French texts. Syntactic sim-
plification aims at making texts easier to understand by simplifying the elements that hinder
reading. It is based on a corpus study that aimed at investigating the linguistic phenomena
involved in the manual simplification of French texts. We have first gathered a parallel corpus of
articles from Wikipedia and Vikidia, that we used to establish a typology of simplifications. In a
second step, we implemented a system that carries out syntactic simplifications based on these
corpus observations. We described simplification rules in order to generate simplified sentences.
A module subsequently selects the best subset of sentences. The evaluation of our system shows
that about 80% of the sentences produced by our system are accurate.
</p>
<p>MOTS-CL&#201;S : simplification automatique, lisibilit&#233;, analyse syntaxique.
</p>
<p>KEYWORDS: automatic simplification, readability, syntactic analysis.
</p>
<p>211</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Dans la majorit&#233; de nos activit&#233;s quotidiennes, la capacit&#233; de lire rapidement et efficacement
constitue un atout certain, voire un pr&#233;-requis. Willms (2003) souligne ainsi une corr&#233;lation
entre ces comp&#233;tences et le statut socio-&#233;conomique des individus. Pourtant, une tranche non
n&#233;gligeable de la population n&#8217;est pas capable de traiter efficacement les donn&#233;es textuelles
auxquelles ils sont confront&#233;s. Richard et al. (1993) rapportent une exp&#233;rience o&#249;, sur 92
demandes d&#8217;allocation de ch&#244;mage remplies par des personnes avec un faible niveau d&#8217;&#233;ducation,
pas moins de la moiti&#233; des informations requises (dont certaines &#233;taient cruciales pour le
traitement de la demande) manquaient, notamment &#224; cause de probl&#232;me de compr&#233;hension.
Dans un contexte l&#233;g&#232;rement diff&#233;rent, &#224; savoir la pharmacologie, Patel et al. (2002) parviennent
&#224; un constat similaire : la plupart de leurs sujets ont rencontr&#233; des probl&#232;mes importants dans la
compr&#233;hension des diff&#233;rentes &#233;tapes &#224; r&#233;aliser pour la bonne administration du m&#233;dicament
test&#233;.
</p>
<p>Ces probl&#232;mes de compr&#233;hension s&#8217;expliquent souvent par une trop grande complexit&#233; des textes,
en particulier au niveau du lexique et de la syntaxe. Ces deux facteurs sont connus comme &#233;tant
des causes importantes des difficult&#233;s de lecture (Chall et Dale, 1995), en particulier chez les
jeunes enfants, les apprenants d&#8217;une langue &#233;trang&#232;re ou les personnes pr&#233;sentant des d&#233;ficiences
intellectuelles.
</p>
<p>D&#232;s lors, la simplification automatique de textes appara&#238;t comme un moyen susceptible d&#8217;aider ces
personnes &#224; acc&#233;der plus facilement au contenu des documents &#233;crits auxquels ils sont confront&#233;s.
Il s&#8217;agit d&#8217;un domaine du traitement automatique des langues (TAL) visant &#224; rendre des textes
plus abordables tout en garantissant l&#8217;int&#233;grit&#233; de leur contenu et en veillant &#224; en respecter la
structure. D&#232;s lors, il faut d&#233;terminer d&#8217;une part quelles informations sont secondaires afin de les
supprimer et de rendre les informations primordiales plus visibles et d&#8217;autre part quelles sont les
constructions syntaxiques qui peuvent poser probl&#232;me pour les simplifier.
</p>
<p>Parmi les premiers efforts en ce sens, citons (Carroll et al., 1999) et (Inui et al., 2003), qui ont
propos&#233; des outils pour produire des textes plus abordables pour les personnes atteintes d&#8217;un
handicap langagier tel que l&#8217;aphasie ou la surdit&#233;. Cependant, l&#8217;aide &#224; la lecture ne s&#8217;adresse pas
qu&#8217;aux lecteurs pr&#233;sentant des handicaps, mais aussi &#224; ceux qui apprennent une langue (premi&#232;re
ou seconde). Ainsi, Belder et Moens (2010) se sont int&#233;ress&#233;s &#224; la simplification pour des enfants
de langue maternelle anglaise, tandis que Siddharthan (2006), Petersen et Ostendorf (2007)
et Medero et Ostendorf (2011) ont &#233;tudi&#233; la simplification pour les apprenants d&#8217;une langue
seconde. La plupart de ces travaux concernent la langue anglaise, &#224; l&#8217;exception de (Inui et al.,
2003) qui traitent &#233;galement le japonais.
</p>
<p>Parall&#232;lement, la simplification automatique a &#233;galement &#233;t&#233; utilis&#233;e comme un pr&#233;-traitement
visant &#224; augmenter l&#8217;efficacit&#233; d&#8217;op&#233;rations post&#233;rieures effectu&#233;es sur des textes. Les premiers,
Chandrasekar et al. (1996) ont consid&#233;r&#233; que les phrases longues et complexes constituaient
un obstacle pour l&#8217;analyse syntaxique ou la traduction automatique et que leur simplification
pr&#233;alable pouvait conduire &#224; de meilleures analyses. Plus r&#233;cemment, Heilman et Smith (2010)
ont montr&#233;, quant &#224; eux, qu&#8217;un texte simplifi&#233; produit de meilleurs r&#233;sultats dans un contexte
de g&#233;n&#233;ration automatique de questions. Du cot&#233; du biom&#233;dical, Lin et Wilbur (2007) et Jon-
nalagadda et al. (2009) ont optimis&#233; l&#8217;extraction de donn&#233;es en simplifiant les textes lors d&#8217;un
pr&#233;traitement.
</p>
<p>212</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La majorit&#233; des m&#233;thodes de simplification syntaxique propos&#233;es reposent sur un ensemble de
r&#232;gles de transformation d&#233;finies manuellement pour &#234;tre appliqu&#233;es aux phrases. La simplifica-
tion semble toutefois naturellement se pr&#234;ter &#224; l&#8217;utilisation de m&#233;thodes issues de la traduction
automatique ou de l&#8217;apprentissage automatique, dont les mod&#232;les sont construits &#224; partir de
corpus comparables de textes complexes et simplifi&#233;s (Zhu et al., 2010; Specia, 2010; Woodsend
et Lapata, 2011). Les donn&#233;es utilis&#233;es dans ce cas sont notamment issues de Wikip&#233;dia en anglais
et de Simple English Wikipedia, destin&#233;e aux enfants et aux locuteurs non natifs. L&#8217;encyclop&#233;die
Simple English Wikipedia compte &#224; ce jour plus de 75 000 articles.
</p>
<p>Il existe des projets comparables pour le fran&#231;ais, Vikidia (voir Section 2.1) et Wikimini, mais ils ne
sont pas aussi fournis que leur homologue anglophone. Par ailleurs, les diff&#233;rentes versions d&#8217;un
article de Wikip&#233;dia ne sont pas strictement parall&#232;les, ce qui complique encore l&#8217;apprentissage
automatique. La m&#233;thode propos&#233;e dans cet article repose donc sur un ensemble de r&#232;gles de
simplification automatique qui ont &#233;t&#233; d&#233;finies manuellement (voir Section 2.3), apr&#232;s &#233;tude de
corpus. Nous utilisons la technique de la sur-g&#233;n&#233;ration, qui consiste &#224; produire dans un premier
temps un nombre important de simplifications possibles, avant de proc&#233;der &#224; une s&#233;lection
optimale des meilleures simplifications produites, &#224; l&#8217;aide de la programmation lin&#233;aire en
nombre entiers (PLNE, en anglais Integer Linear Programming &#8211; ILP). La PLNE permet de d&#233;finir
des contraintes qui r&#233;gissent le choix du r&#233;sultat fourni par l&#8217;outil de simplification automatique.
Cette m&#233;thode a notamment &#233;t&#233; appliqu&#233;e &#224; la simplification de textes en anglais par (Woodsend
et Lapata, 2011), (Belder et Moens, 2010), ainsi que par (Gillick et Favre, 2009) pour le r&#233;sum&#233;
automatique.
</p>
<p>Les apports de cet article sont les suivants : l&#8217;&#233;tude des proc&#233;d&#233;s de simplification en fran&#231;ais, et
notamment la constitution d&#8217;un corpus de phrases parall&#232;les, et une typologie des simplifications ;
l&#8217;utilisation de crit&#232;res originaux de s&#233;lection des phrases, tels que la liste orthographique de
base de Nina Catach ou les mots-cl&#233;s d&#8217;un texte. Nous pr&#233;senterons tout d&#8217;abord le processus de
constitution du corpus (Section 2.1), puis la typologie des simplifications observ&#233;es (Section 2.2).
Nous d&#233;taillerons ensuite le fonctionnement du syst&#232;me mis en &#339;uvre, qui proc&#232;de en deux
temps : une surg&#233;n&#233;ration de phrases simplifi&#233;es (Section 2.3.1), et une s&#233;lection des phrases
correspondant &#224; des crit&#232;res de lisibilit&#233; (Section 2.3.2). Enfin, nous &#233;valuerons cette simplifica-
tion du point de vue de la correction des phrases g&#233;n&#233;r&#233;es, et analyserons les causes d&#8217;erreurs
(Section 3).
</p>
<p>2 M&#233;thodologie
</p>
<p>2.1 Pr&#233;sentation du corpus
</p>
<p>Pour &#233;tablir une typologie des r&#232;gles de simplification, une &#233;tude sur corpus a &#233;t&#233; r&#233;alis&#233;e. Puis-
qu&#8217;il s&#8217;agit de d&#233;terminer les strat&#233;gies utilis&#233;es pour passer d&#8217;une phrase complexe &#224; une phrase
simplifi&#233;e, un corpus de phrases parall&#232;les a &#233;t&#233; construit &#224; partir d&#8217;articles des encyclop&#233;dies
en ligne Wikip&#233;dia 1 et Vikidia 2. Cette derni&#232;re est destin&#233;e aux jeunes de huit &#224; treize ans et
rassemble des articles plus accessibles, tant au niveau de la langue que du contenu. Afin de
constituer ce corpus, nous sommes partis des articles de Vikidia et avons utilis&#233; l&#8217;API MediaWiki
</p>
<p>1. http://fr.wikipedia.org
2. http://fr.vikidia.org
</p>
<p>213</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 1 &#8211; Constitution du corpus de phrases parall&#232;les
</p>
<p>pour r&#233;cup&#233;rer les articles de Wikip&#233;dia et Vikidia de m&#234;mes titres. Le programme WikiExtractor 3
</p>
<p>a ensuite &#233;t&#233; appliqu&#233; &#224; ces articles afin d&#8217;en extraire les textes bruts (c&#8217;est-&#224;-dire sans la syntaxe
wiki). Le corpus ainsi constitu&#233; comprend 13 638 fichiers (dont 7 460 de Vikidia et 6 178 de
Wikip&#233;dia, certains articles de Vikidia n&#8217;ayant pas d&#8217;&#233;quivalent direct dans Wikip&#233;dia).
</p>
<p>Ces articles ont ensuite &#233;t&#233; analys&#233;s afin de rep&#233;rer des phrases parall&#232;les (phrase de Wikip&#233;dia
ayant un &#233;quivalent simplifi&#233; dans Vikidia). Cet alignement a &#233;t&#233; effectu&#233; en partie manuellement
et en partie automatiquement gr&#226;ce &#224; l&#8217;algorithme d&#8217;alignement monolingue d&#233;crit dans (Nelken
et Shieber, 2006), qui se fonde sur une similarit&#233; cosinus entre phrases, avec un tf.idf adapt&#233;
pour la pond&#233;ration des mots. Ce programme fournit en sortie des alignements entre phrases,
avec un score de confiance associ&#233;. La figure 1 r&#233;sume le processus de constitution de ce corpus.
</p>
<p>Parmi ces fichiers, vingt articles ou extraits d&#8217;articles de Wikip&#233;dia et leur &#233;quivalent dans Vikidia
ont &#233;t&#233; s&#233;lectionn&#233;s, ce qui nous donne respectivement 72 phrases et 80 phrases. Les extraits
suivants - correspondant &#224; l&#8217;entr&#233;e &#171;archipel&#187; - ont par exemple &#233;t&#233; s&#233;lectionn&#233;s :
</p>
<p>(1a) Wikip&#233;dia : Un archipel est un ensemble d&#8217;&#238;les relativement proches les unes des
autres. Le terme &#171;archipel&#187; vient du grec ancien &quot;Archipelagos&quot;, litt&#233;ralement &#171;mer
principale&#187; (de &quot;archi&quot; : &#171;principal&#187; et &quot;p&#233;lagos&quot; : &#171;la haute mer&#187;). En effet, ce mot
d&#233;signait originellement la mer &#201;g&#233;e, caract&#233;ris&#233;e par son grand nombre d&#8217;&#238;les (les
Cyclades, les Sporades, Salamine, Eub&#233;e, Samothrace, Lemnos, Samos, Lesbos, Chios,
Rhodes, etc.).
(1b) Vikidia : Un archipel est un ensemble de plusieurs &#238;les, proches les unes des autres.
Le mot &#171;archipel&#187; vient du grec &quot;archipelagos&quot;, qui signifie litt&#233;ralement &#171;mer principale&#187;
et d&#233;signait &#224; l&#8217;origine la mer &#201;g&#233;e, caract&#233;ris&#233;e par son grand nombre d&#8217;&#238;les.
</p>
<p>Notons que les deux articles pr&#233;sentent les m&#234;mes informations globalement, mais de mani&#232;re
diff&#233;rente. Il y a simplification lexicale, s&#233;mantique et syntaxique. En effet, dans Vikidia, il n&#8217;y
a que deux phrases, qui contiennent l&#8217;essentiel de l&#8217;explication (information n&#233;cessaire) tandis
que dans Wikip&#233;dia, trois phrases d&#233;taillent la signification et l&#8217;origine du terme de mani&#232;re plus
pr&#233;cise (informations secondaires, par exemple mises entre parenth&#232;ses).
</p>
<p>3. http://medialab.di.unipi.it/wiki/Wikipedia_Extractor
</p>
<p>214</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.2 Typologie de simplifications
</p>
<p>Les observations r&#233;alis&#233;es sur ce corpus ont permis d&#8217;&#233;tablir une typologie articul&#233;e selon trois
grands niveaux de transformations : lexical, s&#233;mantique et syntaxique. Dans les travaux r&#233;alis&#233;s,
la simplification est commun&#233;ment consid&#233;r&#233;e comme compos&#233;e de deux cat&#233;gories, lexicale
et syntaxique (Carroll et al., 1999; Inui et al., 2003; Belder et Moens, 2010). Le domaine de la
s&#233;mantique quant &#224; lui n&#8217;est pas cit&#233;. Ces trois grands niveaux peuvent &#234;tre &#224; leur tour divis&#233;s en
sous-cat&#233;gories, comme le montre la table 1.
</p>
<p>Lexique S&#233;mantique Syntaxe
Temps
</p>
<p>Synonyme ou hyperonyme R&#233;organisation Suppression
Traduction Suppression Modification
</p>
<p>Ajout Division
Regroupement
</p>
<p>TABLE 1 &#8211; Typologie
</p>
<p>En ce qui concerne le lexique, deux ph&#233;nom&#232;nes sont observ&#233;s. D&#8217;une part, les termes consid&#233;r&#233;s
comme difficiles sont remplac&#233;s par un synonyme ou un hyperonyme. Dans l&#8217;exemple (1), terme
a &#233;t&#233; remplac&#233; par mot qui est plus courant. D&#8217;autre part, les concepts utilis&#233;s dans leur langue
d&#8217;origine dans Wikip&#233;dia sont traduits en fran&#231;ais dans Vikidia.
</p>
<p>Au niveau s&#233;mantique, les auteurs de Vikidia pr&#234;tent une attention particuli&#232;re &#224; l&#8217;organisation de
l&#8217;information qui doit &#234;tre claire et synth&#233;tique. Dans cette optique, il arrive que des propositions
soient interverties, afin d&#8217;assurer une meilleure pr&#233;sentation de l&#8217;information. De plus, le contenu
consid&#233;r&#233; comme secondaire &#224; la compr&#233;hension est supprim&#233; tandis que des explications ou
des exemples sont ajout&#233;s pour plus de clart&#233;. Ainsi, dans l&#8217;exemple (1), la d&#233;composition de la
signification du mot archipel est explicit&#233;e dans Wikip&#233;dia, mais pas dans Vikidia.
</p>
<p>Enfin, du point de vue syntaxique, qui nous int&#233;resse prioritairement ici, cinq types de change-
ments sont observ&#233;s : les modifications de temps, la suppression, la modification, la division et le
regroupement. Les deux derniers types peuvent &#234;tre envisag&#233;s ensemble dans la mesure o&#249; ce
sont deux ph&#233;nom&#232;nes oppos&#233;s. Cette classification peut se rapprocher de celle de (Medero et
Ostendorf, 2011) qui reprend trois cat&#233;gories - la division, la suppression et l&#8217;extension - ou de
(Zhu et al., 2010) (compos&#233;e de la division, la suppression, la r&#233;organisation et la substitution).
&#8211; Tout d&#8217;abord, les temps utilis&#233;s dans Vikidia sont plus quotidiens et moins litt&#233;raires que ceux
</p>
<p>utilis&#233;s dans Wikip&#233;dia. Ainsi, le pr&#233;sent et le pass&#233; compos&#233; sont pr&#233;f&#233;r&#233;s au pass&#233; simple.
&#8211; Ensuite, les informations secondaires ou redondantes, telles que certains compl&#233;ments cir-
</p>
<p>constanciels, qui sont en g&#233;n&#233;ral consid&#233;r&#233;es comme supprimables au niveau syntaxique, ne
sont pas reprises dans les articles de Vikidia. Dans l&#8217;exemple (1), l&#8217;adverbe relativement qui
pr&#233;c&#233;dait proches les unes des autres a ainsi &#233;t&#233; supprim&#233; dans Vikidia. L&#8217;adverbe n&#8217;ajoutait
effectivement rien au niveau informationnel.
</p>
<p>&#8211; De plus, si certaines structures plus complexes ne sont pas supprim&#233;es, elles sont alors d&#233;plac&#233;es
ou modifi&#233;es pour plus de clart&#233;. Dans Vikidia, par exemple, une construction affirmative est
pr&#233;f&#233;r&#233;e &#224; une forme n&#233;gative :
</p>
<p>(2a) Wikip&#233;dia : Les personnes qui ont vot&#233; blanc ou nul ne sont g&#233;n&#233;ralement pas
consid&#233;r&#233;es comme abstentionnistes mais le r&#233;sultat est identique : leur choix n&#8217;est pas
</p>
<p>215</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pris en compte.
(2b) Vikidia : L&#8217;abstention est diff&#233;rente du vote blanc et du vote nul.
</p>
<p>&#8211; Finalement, les auteurs choisissent parfois de diviser des phrases longues ou &#224; l&#8217;inverse de
r&#233;unir plusieurs phrases en une seule. Dans l&#8217;exemple (1), les deux derni&#232;res phrases ont &#233;t&#233;
regroup&#233;es dans Vikidia, car elles ont &#233;t&#233; simplifi&#233;es et sont d&#232;s lors devenues beaucoup plus
courtes. Il faut d&#8217;embl&#233;e pr&#233;ciser que le regroupement d&#8217;&#233;l&#233;ments est beaucoup moins utilis&#233;
que la division de phrases. Pour scinder une phrase, les auteurs prennent par exemple une
proposition secondaire (telle qu&#8217;une relative) qu&#8217;ils transforment en phrase ind&#233;pendante.
</p>
<p>Parmi les changements observ&#233;s, certains d&#8217;entre eux sont difficilement impl&#233;mentables. C&#8217;est le
cas lorsqu&#8217;une modification n&#233;cessite de recourir &#224; la s&#233;mantique, c&#8217;est-&#224;-dire qu&#8217;il n&#8217;est possible
de rep&#233;rer les structures &#224; modifier que par le sens. Il est difficile d&#8217;appliquer ce type de strat&#233;gies
de mani&#232;re automatique. Par exemple, il est parfois possible de supprimer les &#233;l&#233;ments qui se
rapportent au nom, alors que d&#8217;autre fois, ils sont indispensables, sans que cela ne soit marqu&#233;
typographiquement ou grammaticalement dans la phrase.
</p>
<p>D&#8217;autres changements syntaxiques doivent s&#8217;accompagner de transformations lexicales, diffi-
cilement g&#233;n&#233;ralisables. Par exemple, la modification d&#8217;une phrase n&#233;gative en une phrase
affirmative n&#233;cessite de trouver un verbe dont la forme affirmative recouvre le sens de la
construction n&#233;gative &#224; remplacer.
</p>
<p>Il y a &#233;galement des changements qui sont effectu&#233;s de mani&#232;re isol&#233;e et non syst&#233;matisable.
Ils rel&#232;vent plut&#244;t d&#8217;un traitement manuel que d&#8217;un traitement automatique d&#8217;un texte, dans le
sens o&#249; chaque cas est diff&#233;rent (m&#234;me s&#8217;il s&#8217;inscrit dans une r&#232;gle plus globale). De plus, ils font
g&#233;n&#233;ralement appel &#224; des informations s&#233;mantiques ou lexicales et pas simplement syntaxiques.
Il s&#8217;agit de changements complexes, qui sont utiles dans certains cas, mais ardus &#224; d&#233;tecter
automatiquement.
</p>
<p>Enfin, les changements syntaxiques qui ont un impact sur d&#8217;autres parties du texte ou qui
concernent des &#233;l&#233;ments d&#233;pendants d&#8217;une autre structure demandent des modifications plus
globales du texte. Par cons&#233;quent, ils sont &#233;galement difficiles &#224; traiter automatiquement. Ainsi,
pour modifier le temps d&#8217;un verbe dans une phrase, il faut veiller &#224; ce que la concordance des
temps soit respect&#233;e dans l&#8217;enti&#232;ret&#233; du texte.
</p>
<p>2.3 Syst&#232;me de simplification syntaxique
</p>
<p>Nous avons utilis&#233; cette typologie pour mettre en &#339;uvre un syst&#232;me de simplification syntaxique
pour le fran&#231;ais. La simplification d&#8217;un texte y est effectu&#233;e en deux &#233;tapes : une &#233;tape de
g&#233;n&#233;ration de toutes les simplifications possibles pour chaque phrase du texte, et une &#233;tape de
s&#233;lection du meilleur ensemble de phrases simplifi&#233;es. L&#8217;architecture de ce syst&#232;me est pr&#233;sent&#233;e
dans la figure 2.
</p>
<p>Le module de surg&#233;n&#233;ration s&#8217;appuie sur un ensemble de r&#232;gles (au nombre de 19), utilisant
des informations sur les caract&#233;ristiques (morpho-)syntaxiques des mots et sur les relations de
d&#233;pendance pr&#233;sentes au sein d&#8217;une phrase. C&#8217;est pourquoi les textes de notre corpus ont &#233;t&#233;
analys&#233;s par MElt 4(Denis et al., 2009) et Bonsai 5(Candito et al., 2010). Ces textes ont ainsi &#233;t&#233;
</p>
<p>4. https://gforge.inria.fr/projects/lingwb
5. http://alpage.inria.fr/statgram/frdep/fr_stat_dep_parsing.html
</p>
<p>216</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 2 &#8211; Organisation du syst&#232;me de simplification syntaxique
</p>
<p>repr&#233;sent&#233;s sous la forme d&#8217;arbres syntaxiques, lesquels contiennent un maximum de donn&#233;es
utiles &#224; l&#8217;application de r&#232;gles de simplification. Ces derni&#232;res peuvent alors &#234;tre appliqu&#233;es de
mani&#232;re r&#233;cursive, jusqu&#8217;&#224; ce qu&#8217;il n&#8217;y ait plus aucune structure &#224; simplifier dans chacune des
phrases des textes. Il faut ajouter que toutes les phrases cr&#233;&#233;es &#224; chaque application d&#8217;une r&#232;gle
sont enregistr&#233;es, produisant un ensemble de variantes. Par la suite, le meilleur ensemble de
phrases sera retenu via un mod&#232;le de programmation lin&#233;aire, en fonction d&#8217;une s&#233;rie de crit&#232;res
d&#233;taill&#233;s par la suite.
</p>
<p>2.3.1 G&#233;n&#233;ration de phrases simplifi&#233;es
</p>
<p>Les r&#232;gles de simplification syntaxique qui composent notre programme sont respectivement des
r&#232;gles de suppression (12 r&#232;gles), de modification (3 r&#232;gles) et de division (4 r&#232;gles). Notons
que, par rapport &#224; la typologie &#233;tablie, deux types de r&#232;gles n&#8217;ont pas &#233;t&#233; mises en place. D&#8217;une
part, les strat&#233;gies de regroupement de plusieurs phrases en une n&#8217;ont pas &#233;t&#233; observ&#233;es de
mani&#232;re assez syst&#233;matique dans le corpus d&#8217;&#233;tude. Il est d&#232;s lors difficile d&#8217;en retirer une
r&#232;gle automatisable. De plus, les r&#232;gles de regroupement pourraient entrer en conflit avec les
r&#232;gles de suppression, puisqu&#8217;elles ont des buts oppos&#233;s. D&#8217;autre part, en ce qui concerne les
aspects temporels, nous avions not&#233; que certains temps &#233;taient plus utilis&#233;s que d&#8217;autres dans
l&#8217;encyclop&#233;die pour les jeunes, Vikidia. Toutefois, cette strat&#233;gie n&#8217;a pas &#233;t&#233; impl&#233;ment&#233;e car elle
demandait des changements trop globaux, pouvant toucher au texte entier. En effet, lorsqu&#8217;un
verbe au pass&#233; simple est remplac&#233; par un verbe au pr&#233;sent, il faut veiller &#224; ce que la concordance
des temps soit toujours respect&#233;e partout, ce qui demande d&#8217;examiner tout le texte, ou du moins
le paragraphe qui contient la forme verbale modifi&#233;e. On risque alors de d&#233;truire la coh&#233;rence du
texte et d&#8217;en alt&#233;rer la qualit&#233;.
</p>
<p>Pour appliquer ces 19 r&#232;gles, il convient tout d&#8217;abord de rep&#233;rer les structures concern&#233;es par
de possibles changements &#224; l&#8217;aide d&#8217;expressions r&#233;guli&#232;res et gr&#226;ce &#224; Tregex 6(Levy et Andrew,
2006) qui g&#232;re le rep&#233;rage d&#8217;&#233;l&#233;ments et de relations dans un arbre. Dans un deuxi&#232;me temps,
une s&#233;rie d&#8217;op&#233;rations sont effectu&#233;es par le biais de Tsurgeon qui permet de modifier des arbres
syntaxiques. Par exemple, pour supprimer une coordonn&#233;e introduite par soit, il faut rep&#233;rer une
proposition coordonn&#233;e, &#233;tiquet&#233;e COORD, qui domine la conjonction de coordination soit et lui
donner un nom comme Pcoord. Ensuite, l&#8217;op&#233;ration Tsurgeon delete doit &#234;tre appliqu&#233;e &#224;
l&#8217;ensemble repris sous Pcoord :
</p>
<p>Rep&#233;rage (Tregex) : COORD=Pcoord &lt; (CC &lt; /soit/)
Op&#233;ration (Tsurgeon) : delete Pcoord
</p>
<p>6. http://nlp.stanford.edu/software/tregex.shtml
</p>
<p>217</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cette r&#232;gle s&#8217;appliquerait par exemple &#224; la phrase suivante :
</p>
<p>(3a) Phrase d&#8217;origine : Elle compte, selon les autorit&#233;s du pays, en 2009, 5 878 609
habitants pour l&#8217;agglom&#233;ration, et 3 796 677 habitants pour la ville, soit 20 % de la
population totale du pays.
(3b) Phrase apr&#232;s application de la r&#232;gle : Elle compte, selon les autorit&#233;s du pays, en
2009, 5 878 609 habitants pour l&#8217;agglom&#233;ration, et 3 796 677 habitants pour la ville.
</p>
<p>Les op&#233;rations varient en fonction du type de r&#232;gle appliqu&#233;e :
</p>
<p>1. Pour les r&#232;gles de suppression, il suffit de supprimer tous les &#233;l&#233;ments concern&#233;s (via
l&#8217;op&#233;ration Tsurgeon delete). Les &#233;l&#233;ments concern&#233;s par les r&#232;gles de suppression
sont les compl&#233;ments circonstanciels, les ensembles entre parenth&#232;ses, une partie des
propositions subordonn&#233;es, les propositions entre virgules ou introduites par un terme tel
que comme, voire ou soit, les adverbes et les compl&#233;ments d&#8217;agent.
</p>
<p>2. Pour les r&#232;gles de modification, il s&#8217;agit de combiner plusieurs op&#233;rations : la suppression
de certains termes (op&#233;ration Tsurgeon delete), le d&#233;placement d&#8217;&#233;l&#233;ments (op&#233;ration
Tsurgeon move) et l&#8217;ajout d&#8217;&#233;tiquettes (op&#233;ration Tsurgeon insert) qui signalent
un traitement &#233;ventuel par la suite. En effet, certaines r&#232;gles demandent que les formes
verbales se conjuguent &#224; un autre temps, un autre mode, etc. Dans ce cas, des &#233;tiquettes
sont ajout&#233;es autour du verbe pour indiquer qu&#8217;il doit &#234;tre modifi&#233;. Il sera, dans un
traitement post&#233;rieur, conjugu&#233; &#224; la forme voulue gr&#226;ce au syst&#232;me de conjugaison le
Verbiste 7. Ainsi, pour passer d&#8217;une structure passive &#224; une structure active, il faut
modifier le mode, mais aussi parfois la personne, pour que le verbe s&#8217;accorde correctement
avec le compl&#233;ment d&#8217;agent devenu sujet. Trois r&#232;gles de modification ont &#233;t&#233; mises en
place : le d&#233;placement &#224; l&#8217;initiale des compl&#233;ments circonstanciels, le passage &#224; l&#8217;actif des
formes passives et la transformation d&#8217;une cliv&#233;e en non cliv&#233;e.
</p>
<p>3. Pour les r&#232;gles de division, le processus se d&#233;roule en deux &#233;tapes. La proposition
secondaire est d&#8217;abord supprim&#233;e et la nouvelle phrase enregistr&#233;e telle quelle. Ensuite,
la phrase d&#8217;origine est reprise et la proposition principale est cette fois supprim&#233;e avant
que la proposition secondaire soit transform&#233;e de mani&#232;re &#224; devenir ind&#233;pendante. En
g&#233;n&#233;ral, il faut veiller &#224; modifier la forme verbale de cette proposition secondaire pour
qu&#8217;elle puisse fonctionner comme un verbe principal. Par ailleurs, le pronom qui r&#233;git la
proposition doit &#234;tre remplac&#233; par son ant&#233;c&#233;dent et le sujet doit &#234;tre ins&#233;r&#233; lorsqu&#8217;il est
manquant. Par exemple, pour transformer une relative en une proposition ind&#233;pendante,
le pronom relatif doit &#234;tre remplac&#233; par son ant&#233;c&#233;dent et il est important de tenir compte
de la fonction du pronom pour savoir o&#249; ins&#233;rer l&#8217;ant&#233;c&#233;dent. Signalons que les phrases
sont scind&#233;es quand elles contiennent des propositions secondaires introduites par deux
points, des coordonn&#233;es, des participiales ou des relatives.
</p>
<p>Ces r&#232;gles de simplification sont appliqu&#233;es de mani&#232;re r&#233;cursive &#224; une phrase jusqu&#8217;&#224; ce que
toutes les variantes possibles aient &#233;t&#233; g&#233;n&#233;r&#233;es. Plusieurs r&#233;sultats sont donc r&#233;guli&#232;rement
obtenus pour une m&#234;me phrase. D&#232;s lors, il convient de d&#233;terminer la phrase, parmi toutes celles
produites, qui est la plus appropri&#233;e pour remplacer celle d&#8217;origine. Ce processus est d&#233;crit &#224; la
section suivante.
</p>
<p>7. Le programme est disponible &#224; l&#8217;adresse http://sarrazip.com/dev/verbiste.html sous licence GNU
(page consult&#233;e le 6 novembre 2011). Il a &#233;t&#233; cr&#233;&#233; par Pierre Sarrazin.
</p>
<p>218</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.3.2 S&#233;lection de phrases simplifi&#233;es
</p>
<p>&#201;tant donn&#233; un ensemble de phrases simplifi&#233;es possible pour un texte, notre objectif est de
s&#233;lectionner le meilleur sous-ensemble de phrases simplifi&#233;es, c&#8217;est-&#224;-dire celui qui maximise une
mesure de lisibilit&#233;. Cette mesure de lisibilit&#233; se traduit par diff&#233;rents crit&#232;res. Pour r&#233;soudre
ce genre de probl&#232;mes, la programmation lin&#233;aire en nombres entiers constitue une technique
appropri&#233;e.
</p>
<p>Dans notre cas, quatre crit&#232;res ont &#233;t&#233; pris en compte pour choisir la phrase ad&#233;quate : la longueur
de la phrase, la longueur des mots, la familiarit&#233; du vocabulaire et la pr&#233;sence de termes-cl&#233;s,
c&#8217;est-&#224;-dire r&#233;currents dans le texte. La longueur de la phrase est exprim&#233;e en nombre de mots
tandis que la longueur des mots est donn&#233;e en nombre de caract&#232;res. En ce qui concerne la
familiarit&#233; des mots, la liste de Catach 8 (Catach, 1985) a &#233;t&#233; utilis&#233;e pour calculer le poids de
chaque terme. Il s&#8217;agit d&#8217;une liste des 3000 mots les plus fr&#233;quents, dont il convient d&#8217;enseigner
l&#8217;orthographe en priorit&#233; aux &#233;l&#232;ves de primaire. Les termes-cl&#233;s ont &#233;t&#233; d&#233;finis, quant &#224; eux,
comme les mots qui apparaissaient deux fois ou plus dans un texte.
</p>
<p>Ces crit&#232;res sont combin&#233;s gr&#226;ce &#224; la formule suivante au sein du module de programmation
lin&#233;aire 9 :
</p>
<p>Il s&#8217;agit alors de maximiser : hw + hs + ha + hc
O&#249; : hw = wps&#215;&#8721;i si &#8722;&#8721;i lwi si
</p>
<p>hs = cpw&#215;&#8721;i lwi si &#8722;&#8721;i l ci si
ha = aps&#215;&#8721;i si &#8722;&#8721;i lai si
hc =
</p>
<p>&#8721;
j w jc j
</p>
<p>(1)
</p>
<p>Nous avons d&#233;fini les param&#232;tres et variables suivants pour la formulation du probl&#232;me :
&#8211; wps : le nombre moyen de mots par phrase souhait&#233;
&#8211; cpw : le nombre moyen de caract&#232;res par mot souhait&#233;
&#8211; aps : le nombre moyen de mots absents de la liste de Catach souhait&#233;
&#8211; si un indicateur de la pr&#233;sence de la phrase i dans la simplification de texte finale
&#8211; c j un indicateur de la pr&#233;sence du mot-cl&#233; j dans la simplification de texte finale
&#8211; lwi la longueur en mots de la phrase i
&#8211; l ci la longueur en caract&#232;res de la phrase i
&#8211; lai le nombre de mots absents de la phrase i
&#8211; w j le nombre d&#8217;occurrences du mot-cl&#233; j
wps, cpw et aps sont des param&#232;tres constants dont les valeurs ont &#233;t&#233; fix&#233;es respectivement
&#224; 10, &#224; 5 et &#224; 2 pour cette &#233;tude. Toutefois, il s&#8217;agit de param&#232;tres susceptibles de varier en
fonction du contexte d&#8217;utilisation et du public cible, puisqu&#8217;ils d&#233;terminent directement le niveau
de difficult&#233; des phrases simplifi&#233;es retenues.
</p>
<p>Pour illustrer ce processus, prenons le texte de d&#233;part pour l&#8217;article de Wikip&#233;dia intitul&#233; Abel.
Il comprenait 25 phrases, &#224; partir desquelles 67 phrases simplifi&#233;es ont &#233;t&#233; produites. Parmi le
texte simplifi&#233;, nous observons que ce sont les phrases 3 de l&#8217;exemple (4b) qui remplacent la
phrase du texte original (exemple (4a)) :
</p>
<p>(4a) Phrase d&#8217;origine (Phrase 1) : Ca&#239;n, l&#8217;a&#238;n&#233;, cultive la terre et Abel ( &#233;tymologie : de
l&#8217;h&#233;breu &quot; souffle &quot;, &quot; vapeur &quot;, &quot; existence pr&#233;caire &quot; ) garde le troupeau.
</p>
<p>8. Elle est notamment disponible sur le site http://www.ia93.ac-creteil.fr/spip/spip.php?
article2900.
</p>
<p>9. Le module repose sur glpk qui est disponible &#224; l&#8217;adresse suivante : http://www.gnu.org/software/glpk/
</p>
<p>219</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(4b) Simplifications possibles :
Phrase 2 : Ca&#239;n, l&#8217;a&#238;n&#233;, cultive la terre et Abel garde le troupeau.
Phrases 3 : Ca&#239;n, l&#8217;a&#238;n&#233;, cultive la terre. Abel garde le troupeau.
Phrase 4 : Ca&#239;n, l&#8217;a&#238;n&#233;, cultive la terre.
Phrase 5 : Abel garde le troupeau.
Phrases 6 : Ca&#239;n, l&#8217;a&#238;n&#233;, cultive la terre. Abel ( &#233;tymologie : de l&#8217;h&#233;breu &quot; souffle &quot;, &quot;
vapeur &quot;, &quot; existence pr&#233;caire &quot; ) garde le troupeau.
Phrase 7 : Abel ( &#233;tymologie : de l&#8217;h&#233;breu &quot; souffle &quot;, &quot; vapeur &quot;, &quot; existence pr&#233;caire &quot; )
garde le troupeau.
(4c) Simplification s&#233;lectionn&#233;e (Phrase 3) : Ca&#239;n, l&#8217;a&#238;n&#233;, cultive la terre. Abel garde le
troupeau.
</p>
<p>Les valeurs des param&#232;tres pour chaque phrase de l&#8217;exemple (4) sont donn&#233;es dans la table 2.
</p>
<p>Longueur Longueur Familiarit&#233; Termes cl&#233;s
de la phrase des mots des mots
</p>
<p>Valeurs souhait&#233;es 10 mots 5 caract&#232;res 2 mots absents
Phrase 1 19 mots 6,1 caract&#232;res 11 mots absents 5 termes
Phrase 2 11 mots 4,3 caract&#232;res 5 mots absents 5 termes
Phrases 3 5 mots 4,6 caract&#232;res 2 mots absents 5 termes
Phrase 4 6 mots 4,5 caract&#232;res 3 mots absents 3 termes
Phrase 5 4 mots 4,7 caract&#232;res 2 mots absents 2 termes
Phrases 6 9 mots 6,3 caract&#232;res 5 mots absents 5 termes
Phrase 7 12 mots 7,3 caract&#232;res 8 mots absents 2 termes
</p>
<p>TABLE 2 &#8211; Valeurs des param&#232;tres pour les phrases de l&#8217;exemple (4)
</p>
<p>3 &#201;valuation
</p>
<p>La simplification syntaxique implique des modifications importantes au sein de la phrase aussi
bien au niveau du contenu que de la forme. C&#8217;est pourquoi il est important de v&#233;rifier que
l&#8217;application d&#8217;une r&#232;gle ne provoque pas des erreurs qui rendraient les phrases produites
incompr&#233;hensibles ou agrammaticales. Une &#233;valuation manuelle de notre syst&#232;me de g&#233;n&#233;ration
de phrases simplifi&#233;es a donc &#233;t&#233; r&#233;alis&#233;e dans ce but. Elle repose sur un nouveau corpus compos&#233;
de neuf articles de Wikip&#233;dia, c&#8217;est-&#224;-dire de 202 phrases. Les r&#233;sultats obtenus sont d&#233;taill&#233;s &#224; la
table 3 et dans la Section 3.1. Nous y d&#233;tectons deux grands types d&#8217;erreurs, &#224; savoir les erreurs
d&#8217;analyse (morpho-)syntaxique et les erreurs de simplification. Celles-ci sont discut&#233;es dans les
Sections 3.2 et 3.3.
</p>
<p>3.1 Donn&#233;es obtenues
</p>
<p>Sur les 202 phrases qui composent le corpus d&#8217;&#233;valuation, 113 d&#8217;entre elles (56%) ont subi
une ou plusieurs simplifications. Ces 113 phrases auxquelles des r&#232;gles ont pu &#234;tre appliqu&#233;es
donnent lieu &#224; 333 variantes susceptibles de comporter des erreurs. C&#8217;est effectivement le cas
de 71 d&#8217;entre elles (21,32%). Parmi celles-ci, il faut distinguer d&#8217;embl&#233;e les erreurs dues au
</p>
<p>220</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>programme de simplification et les erreurs provoqu&#233;es par un pr&#233;-traitement (analyse morpho-
syntaxique et syntaxique) inexact. Ainsi, parmi les 21,32% de phrases probl&#233;matiques, il appara&#238;t
que 89% des erreurs proviennent de l&#8217;analyse (morpho-)syntaxique et seulement 11% d&#8217;entre
elles sont effectivement dues au syst&#232;me mis en place. Par cons&#233;quent, &#224; partir du corpus
d&#8217;&#233;valuation, seulement 2,4% des phrases produites par notre syst&#232;me posent probl&#232;me en raison
de l&#8217;application d&#8217;une r&#232;gle de simplification. Parmi ces rares erreurs de simplification (notre
corpus en compte 8), il faut enfin distinguer les erreurs de contenu (25%) et de forme (75%).
Dans la suite de cette section, nous revenons plus en d&#233;tail sur les deux types d&#8217;erreurs principales
rencontr&#233;es : morpho-syntaxiques et de simplification.
</p>
<p>Phrases produites par le programme
333 phrases - 100%
</p>
<p>Phrases correctes Phrases incorrectes
262 phrases - 78,68% 71 phrases - 21,32%
</p>
<p>Erreurs dues au pr&#233;-traitement Erreurs dues au simplificateur
63 phrases - 18,92% 8 phrases - 2,4%
</p>
<p>Syntaxe Sens
6 phrases 2 phrases
</p>
<p>1,8% 0,6%
</p>
<p>TABLE 3 &#8211; &#201;valuation des r&#232;gles de simplification
</p>
<p>3.2 Erreurs d&#8217;analyse (morpho-)syntaxique
</p>
<p>La phase de pr&#233;-traitement consiste &#224; &#233;tiqueter, annoter et structurer des phrases. D&#232;s lors, il
peut y avoir des erreurs dans les &#233;tiquettes attribu&#233;es, les relations identifi&#233;es, les regroupements
d&#8217;&#233;l&#233;ments et les d&#233;limitations de phrases et de parenth&#232;ses.
</p>
<p>Les erreurs d&#8217;&#233;tiquette sont les plus fr&#233;quentes et concernent des entit&#233;s nomm&#233;es, des cas
ambigus ou des expressions fig&#233;es. Par exemple, les mots ainsi que peuvent poser probl&#232;me
puisqu&#8217;il peut s&#8217;agir d&#8217;un connecteur ou des termes ainsi et que. L&#8217;analyseur ne parvient pas
toujours &#224; diff&#233;rencier les deux cas, ce qui peut provoquer des erreurs lors de la suppression
des coordonn&#233;es (si les mots ainsi que sont identifi&#233;s comme un connecteur &#224; tort). La phrase
suivante en est un exemple :
</p>
<p>(5) Les m&#233;lodies sont accrocheuses et les arrangements tr&#232;s soign&#233;s ; c&#8217;est ainsi que
&quot;Mamma Mia&quot; et &quot;Fernando&quot; (malgr&#233; quelques erreurs de grammaire anglaise) occu-
p&#232;rent la premi&#232;re place des palmar&#232;s mondiaux dans le premier semestre de cette m&#234;me
ann&#233;e.
</p>
<p>Puisque ainsi que est consid&#233;r&#233; comme un connecteur et non comme l&#8217;adverbe ainsi suivi du
deuxi&#232;me terme de la cliv&#233;e que, la r&#232;gle de suppression des coordonn&#233;es produit la phrase
suivante qui est agrammaticale : C&#8217;est.
</p>
<p>Au-del&#224; des probl&#232;mes d&#8217;&#233;tiquette, les relations de d&#233;pendance posent aussi fr&#233;quemment des
difficult&#233;s &#224; l&#8217;analyseur syntaxique. En effet, il est difficile de d&#233;terminer o&#249; s&#8217;arr&#234;te un groupe
ou une proposition, quels &#233;l&#233;ments le composent ou de quel &#233;l&#233;ment il d&#233;pend, particuli&#232;re-
ment lorsque les constructions sont complexes et m&#234;me emboit&#233;es. &#192; nouveau, cela peut poser
probl&#232;me si une r&#232;gle de simplification s&#8217;applique justement &#224; un groupe mal analys&#233;.
</p>
<p>221</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les ponctuations constituent &#233;galement des &#233;l&#233;ments difficiles &#224; traiter pour l&#8217;analyseur. C&#8217;est
pourquoi les phrases et les groupes entre parenth&#232;ses ne sont pas toujours convenablement
d&#233;limit&#233;s. De plus, l&#8217;analyseur ne distingue pas les points contenus dans les citations entre
guillemets et ceux qui marquent une fin de phrase. Cela peut amener le programme, qui applique
des r&#232;gles, &#224; diviser une phrase en plusieurs propositions de mani&#232;re erron&#233;e. Les parenth&#232;ses,
quant &#224; elles, ne sont pas toujours marqu&#233;es &#224; un m&#234;me niveau, ce qui d&#233;truit l&#8217;unit&#233; de
l&#8217;ensemble. En effet, tous les composants de l&#8217;expression entre parenth&#232;ses ne sont pas rassembl&#233;s
sous un m&#234;me &#233;l&#233;ment, ce qui signifie qu&#8217;une partie de l&#8217;expression peut &#234;tre supprim&#233;e sans le
reste et inversement.
</p>
<p>3.3 Erreurs de simplification
</p>
<p>&#192; c&#244;t&#233; des erreurs issues du pr&#233;-traitement, certaines phrases, erron&#233;es aux niveaux s&#233;mantique
et syntaxique, peuvent &#234;tre produites &#224; la suite de l&#8217;application des r&#232;gles de simplification.
Il s&#8217;agit &#233;videmment l&#224; des erreurs les plus int&#233;ressantes, qui se r&#233;partissent en deux grandes
cat&#233;gories.
</p>
<p>D&#8217;une part, les informations v&#233;hicul&#233;es par la phrase peuvent se trouver modifi&#233;es ou amput&#233;es.
De fait, lors de la suppression de l&#8217;infinitive, il arrive qu&#8217;une partie du contenu de la phrase
soit perdue. Ainsi, dans la phrase suivante, issue de l&#8217;article abb&#233;, la proposition infinitive, qui
explique le terme abb&#233;, est supprim&#233;e :
</p>
<p>(6a) C&#8217;est aussi depuis le XVIIIe si&#232;cle le terme en usage pour d&#233;signer un clerc s&#233;culier
ayant au moins re&#231;u la tonsure.
(6b) C&#8217;est aussi depuis le XVIIIe si&#232;cle le terme en usage.
</p>
<p>Par ailleurs, lors de la suppression du compl&#233;ment d&#8217;agent, le sens d&#8217;une phrase peut &#234;tre
boulevers&#233; par ce type de modification. Il en est ainsi pour la phrase de l&#8217;exemple (7b). En effet,
le sens de la phrase originale (7a) &#233;tait tout &#224; fait diff&#233;rent :
</p>
<p>(7a) Ils ne sont pas caract&#233;ris&#233;s par leur profession comme dans la Bible : l&#8217;un pasteur,
l&#8217;autre agriculteur.
(7b) Ils ne sont pas caract&#233;ris&#233;s : l&#8217;un pasteur, l&#8217;autre agriculteur.
</p>
<p>D&#8217;autre part, la structure de la phrase peut &#234;tre modifi&#233;e de telle fa&#231;on que la phrase devient
syntaxiquement incorrecte. Trois r&#232;gles de simplification sont concern&#233;es. Tout d&#8217;abord, les r&#232;gles
de suppression sont sujettes &#224; ce genre de probl&#232;me puisqu&#8217;il s&#8217;agit de supprimer une partie de
la phrase, qui est normalement secondaire au bon fonctionnement de la phrase. Pourtant, il
arrive que l&#8217;&#233;l&#233;ment supprim&#233; soit essentiel, comme dans le cas de la suppression du r&#233;f&#233;rent
d&#8217;un pronom. La suppression de la subordonn&#233;e ou de l&#8217;infinitive peut provoquer ce type de
d&#233;sagr&#233;ment. De son c&#244;t&#233;, la division de la phrase &#224; partir de la relative produit un autre genre
d&#8217;erreurs. Si le verbe est suivi d&#8217;un infinitif, le compl&#233;ment direct (l&#8217;ant&#233;c&#233;dent du relatif qui
est replac&#233; dans la relative lors de la division) peut d&#233;pendre du verbe ou de l&#8217;infinitif. Le
simplificateur n&#8217;en tient pas compte et estime dans tous les cas que le compl&#233;ment direct d&#233;pend
du verbe et non de l&#8217;infinitif, parfois de mani&#232;re erron&#233;e comme dans l&#8217;exemple (8) :
</p>
<p>(8a) Ils ont sur leurs religieux un droit de juridiction, une autorit&#233; qu&#8217;il leur est recom-
mand&#233; de n&#8217;exercer que par la voie de la patience et de la douceur.
(8b) Il leur est recommand&#233; cette autorit&#233; de n&#8217;exercer que par la voie de la patience et
de la douceur.
</p>
<p>222</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Conclusion et perspectives
</p>
<p>Cet article a d&#233;crit un syst&#232;me automatique de simplification syntaxique pour le fran&#231;ais &#224; desti-
nation des enfants en particulier. Celui-ci repose sur un ensemble de r&#232;gles obtenues sur la base
d&#8217;une &#233;tude de corpus, laquelle a aussi men&#233; &#224; l&#8217;&#233;laboration d&#8217;une typologie des simplifications
en fran&#231;ais. Il serait ais&#233; d&#8217;&#233;tendre notre typologie &#224; d&#8217;autres publics sur base d&#8217;autres corpus
ad&#233;quats. Notre d&#233;marche utilise &#233;galement la technique de la sur-g&#233;n&#233;ration, qui permet de
retenir le meilleur ensemble de simplifications en fonction de crit&#232;res de lisibilit&#233;. Notons que
parmi ceux employ&#233;s, certains n&#8217;avaient pas &#233;t&#233; consid&#233;r&#233;s pr&#233;c&#233;demment et produisent des
r&#233;sultats int&#233;ressants. Enfin, il est apparu que les performances de notre syst&#232;me sont bonnes
(environ 80% des phrases g&#233;n&#233;r&#233;es sont correctes), en particulier si l&#8217;on ne tient pas compte des
erreurs dues aux outils de pr&#233;traitement.
</p>
<p>Nous envisageons plusieurs perspectives d&#8217;am&#233;lioration pour notre syst&#232;me. Tout d&#8217;abord, la
simplification syntaxique pourrait &#234;tre compl&#233;t&#233;e par une simplification lexicale, ainsi que cela est
fait dans certaines &#233;tudes pour l&#8217;anglais (Woodsend et Lapata, 2011). Il s&#8217;agit en effet d&#8217;une autre
source de probl&#232;mes pour certains lecteurs. Par ailleurs, notre analyse des erreurs a soulign&#233;
la n&#233;cessit&#233; d&#8217;ajouter ou de r&#233;p&#233;ter des termes lorsqu&#8217;une division de phrase est effectu&#233;e. Il
serait d&#232;s lors utile de d&#233;velopper un outil qui g&#233;rerait les r&#233;f&#233;rents, afin d&#8217;am&#233;liorer la qualit&#233;
du texte simplifi&#233;. Enfin, une derni&#232;re perspective d&#8217;am&#233;lioration consisterait &#224; rendre le syst&#232;me
de r&#232;gles modulable en fonction d&#8217;un public cible. Cela demanderait d&#8217;&#233;valuer la pertinence des
diff&#233;rentes transformations et des crit&#232;res de s&#233;lection des meilleures simplifications en fonction
des publics vis&#233;s. Cette perspective n&#233;cessiterait d&#8217;&#233;valuer l&#8217;efficacit&#233; des r&#232;gles au moyen de
tests de compr&#233;hension portant sur des phrases originales et simplifi&#233;s.
</p>
<p>Remerciements Nous remercions Antoine Sylvain pour sa participation &#224; la constitution du
corpus de textes issus de Wikip&#233;dia et Vikidia. Ces travaux ont re&#231;u le soutien financier du projet
DOXA du p&#244;le de comp&#233;titivit&#233; CAP-DIGITAL.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BELDER, J. D. et MOENS, M.-F. (2010). Text Simplification for Children. In Proceedings of the
Workshop on Accessible Search Systems, in conjunction with SIGIR 2010.
</p>
<p>CANDITO, M., NIVRE, J., DENIS, P. et ANGUIANO, E. (2010). Benchmarking of statistical dependency
parsers for French. In Proceedings of the 23rd International Conference on Computational
Linguistics : Posters, pages 108&#8211;116. Association for Computational Linguistics.
</p>
<p>CARROLL, J., MINNEN, G., PEARCE, D., CANNING, Y., DEVLIN, S. et TAIT, J. (1999). Simplifying Text
for Language-Impaired Readers. In Proceedings of the Ninth Conference of the European Chapter
of the Association for Computational Linguistics, pages 269&#8211;270.
</p>
<p>CATACH, N. (1985). Les listes orthographiques de base du fran&#231;ais. Nathan, Paris.
</p>
<p>CHALL, J. et DALE, E. (1995). Readability Revisited : The New Dale-Chall Readability Formula.
Brookline Books, Cambridge.
</p>
<p>CHANDRASEKAR, R., DORAN, C. et SRINIVAS, B. (1996). Motivations and methods for text simplifi-
cation. In Proceedings of the 16th conference on Computational linguistics, pages 1041&#8211;1044.
</p>
<p>223</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DENIS, P., SAGOT, B. et al. (2009). Coupling an annotated corpus and a morphosyntactic lexicon
for state-of-the-art pos tagging with less human effort. In Proceedings of PACLIC.
GILLICK, D. et FAVRE, B. (2009). A scalable global model for summarization. In Proceedings of
the Workshop on Integer Linear Programming for Natural Language Processing, ILP &#8217;09, pages
10&#8211;18, Stroudsburg, PA, USA.
HEILMAN, M. et SMITH, N. A. (2010). Extracting Simplified Statements for Factual Question
Generation. In Proceedings of the 3rd Workshop on Question Generation.
INUI, K., FUJITA, A., TAKAHASHI, T., IIDA, R. et IWAKURA, T. (2003). Text simplification for reading
assistance : a project note. In Proceedings of the second international workshop on Paraphrasing,
pages 9&#8211;16.
JONNALAGADDA, S., TARI, L., HAKENBERG, J., BARAL, C. et GONZALEZ, G. (2009). Towards Effective
Sentence Simplification for Automatic Processing of Biomedical Text. In Proceedings of NAACL-
HLT 2009.
LEVY, R. et ANDREW, G. (2006). Tregex and tsurgeon : tools for querying and manipulating tree
data structures. In Proceedings of the fifth international conference on Language Resources and
Evaluation, pages 2231&#8211;2234.
LIN, J. et WILBUR, W. J. (2007). Syntactic sentence compression in the biomedical domain :
facilitating access to related articles. Information Retrieval, 10(4):393&#8211;414.
MEDERO, J. et OSTENDORF, M. (2011). Identifying Targets for Syntactic Simplification. In
Proceedings of the SLaTE 2011 workshop.
NELKEN, R. et SHIEBER, S. (2006). Towards robust context-sensitive sentence alignment for
monolingual corpora. In Proceedings of the 11th Conference of the European Chapter of the
Association for Computational Linguistics, pages 161&#8211;168.
PATEL, V., BRANCH, T. et AROCHA, J. (2002). Errors in interpreting quantities as procedures : The
case of pharmaceutical labels. International journal of medical informatics, 65(3):193&#8211;211.
PETERSEN, S. E. et OSTENDORF, M. (2007). Text Simplification for Language Learners : A Corpus
Analysis. In Proceedings of Speech and Language Technology in Education (SLaTE2007), pages
69&#8211;72.
RICHARD, J., BARCENILLA, J., BRIE, B., CHARMET, E., CLEMENT, E. et REYNARD, P. (1993). Le
traitement de documents administratifs par des populations de bas niveau de formation. Le
Travail Humain, 56(4):345&#8211;367.
SIDDHARTHAN, A. (2006). Syntactic Simplification and Text Cohesion. Research on Language &amp;
Computation, 4(1):77&#8211;109.
SPECIA, L. (2010). Translating from Complex to Simplified Sentences. In Proceedings of the 9th
International Conference on Computational Processing of the Portuguese Language (Propor-2010).,
pages 30&#8211;39.
WILLMS, J. (2003). Literacy proficiency of youth : Evidence of converging socioeconomic
gradients. International Journal of Educational Research, 39(3):247&#8211;252.
WOODSEND, K. et LAPATA, M. (2011). Learning to Simplify Sentences with Quasi-Synchronous
Grammar and Integer Programming. In Proceedings of the 2011 Conference on Empirical Methods
in Natural Language Processing, pages 409&#8211;420, Edinburgh, Scotland, UK.
ZHU, Z., BERNHARD, D. et GUREVYCH, I. (2010). A Monolingual Tree-based Translation Model for
Sentence Simplification. In Proceedings of the 23rd International Conference on Computational
Linguistics (Coling 2010), pages 1353&#8211;1361, Beijing, China.
</p>
<p>224</p>

</div></div>
</body></html>