<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un segmenteur-&#233;tiqueteur et un chunker pour le fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 5: D&#233;monstrations, pages 7&#8211;8,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Un segmenteur-&#233;tiqueteur et un chunker pour le fran&#231;ais
</p>
<p>Isabelle Tellier1,2, Yoann Dupont1,2, Arnaud Courmet2
(1) LaTTiCe, universit&#233; Paris 3 - Sorbonne Nouvelle
</p>
<p>(2) LIFO, universit&#233; d&#8217;Orl&#233;ans
</p>
<p>isabelle.tellier@univ-paris3.fr, yoann.dupont@etu.univ-orleans.fr,
arnaud.coumet@gmail.com
</p>
<p>R&#201;SUM&#201;
Nous proposons une d&#233;monstration de deux programmes : un segmenteur-&#233;tiqueteur POS pour
le fran&#231;ais et un programme de parenth&#233;sage en &#8220;chunks&#8221; de textes pr&#233;alablement trait&#233;s par le
programme pr&#233;c&#233;dent. Tous deux ont &#233;t&#233; appris &#224; partir du French Tree Bank.
</p>
<p>ABSTRACT
A Segmenter-POS Labeller and a Chunker for French
</p>
<p>We propose a demo of two softwares : a Segmenter-POS Labeller for French and a Chunker for
texts treated by the first program. Both have been learned from the French Tree Bank.
</p>
<p>MOTS-CL&#201;S : &#233;tiquetage POS, chunking, apprentissage automatique, French Tree Bank, CRF.
</p>
<p>KEYWORDS: POS tagging, chunking, Machine Learning, French Tree Bank, CRF.
</p>
<p>1 Introduction
</p>
<p>Nous proposons de faire une d&#233;monstration de plusieurs programmes appris automatiquement &#224;
partir du French Treebank(Abeill&#233; et al., 2003) :
&#8211; un segmenteur combin&#233; avec un &#233;tiqueteur morphosyntaxique (Constant et al., 2011)
&#8211; un &#8220;chunker&#8221; ou analyseur syntaxique superficiel (Abney, 1991; Sha et Pereira, 2003; Tellier
et al., 2012)
</p>
<p>Les deux programmes sont utilisables en s&#233;quence, le chunker s&#8217;appuyant pour fonctionner sur
le r&#233;sultat fourni par l&#8217;&#233;tiqueteur. Ils ont tous les deux &#233;t&#233; appris automatiquement par un CRF
(Conditional Random Fields) (Lafferty et al., 2001; Tellier et Tommasi, 2011). Ils sont libres et
gratuits, disponibles en t&#233;l&#233;chargement mais ont surtout &#233;t&#233; test&#233;s sous Debian, Ubuntu et Mac
(r&#233;sultats non garantis sous Windows). Il faut pour les utiliser disposer des logiciels suivants :
&#8211; un interpr&#233;teur Python : http ://www.python.org/download/
&#8211; Wapiti, une impl&#233;mentation des CRF lin&#233;aires : http ://wapiti.limsi.fr/
&#8211; Bazaar, un gestionnaire de versions donnant acc&#232;s au serveur o&#249; ils sont stock&#233;s :
</p>
<p>http ://wiki.bazaar.canonical.com/
Nous d&#233;crivons bri&#232;vement ci-dessous les diff&#233;rentes options disponibles pour ces programmes et
les r&#233;sultats de leur &#233;valuation.
</p>
<p>7</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Les programmes
</p>
<p>Pour t&#233;l&#233;charger le segmenteur-&#233;tiqueteur, il faut saisir l&#8217;instruction suivante :
bzr branch lp : yoann-dupont/crftagger/stand-alone-tagger
Le processus ayant permis de l&#8217;apprendre est d&#233;crit dans (Constant et al., 2011). Son originalit&#233;
est de permettre plusieurs segmentations possibles :
&#8211; soit une segmentation &#8220;maximale&#8221; r&#233;alis&#233;e &#224; l&#8217;aide de r&#232;gles &#233;crites manuellement
&#8211; soit une segmentation qui cherche &#224; identifier les unit&#233;s multimots du texte, en tenant compte
</p>
<p>de celles pr&#233;sentes dans le French Treebank ainsi que dans le Lefff (Sagot, 2010).
L&#8217;&#233;tiqueteur s&#8217;appuie sur la segmentation choisie et distingue 29 &#233;tiquettes : en validation crois&#233;e,
il atteint une exactitude de 97,3% sans tenir compte des unit&#233;s multimots, 95,2% avec elles.
Pour t&#233;l&#233;charger le &#8220;chunker&#8221;, il faut saisir l&#8217;instruction suivante :
bzr branch lp : yoann-dupont/crftagger/chunker_models
Le processus ayant permis de l&#8217;apprendre est d&#233;crit dans (Tellier et al., 2012). Il s&#8217;appuie sur les
&#233;tiquettes fournies par le programme pr&#233;c&#233;dent et fonctionne suivant deux variantes possibles :
&#8211; une variante qui se concentre sur la seule identification de tous les &#8220;groupes nominaux simples&#8221;
</p>
<p>(i.e. non r&#233;cursifs) NP. En supposant un &#233;tiquetage morphosyntaxique parfait et en r&#233;qu&#233;rant
la stricte &#233;galit&#233; des fronti&#232;res, ils sont identifi&#233;s en validation crois&#233;e avec une pr&#233;cision de
97,49%, un rappel de 97,40%, et donc une F-mesure de 97,45.
</p>
<p>&#8211; une variante qui cherche &#224; r&#233;aliser un parenth&#233;sage complet des phrases, en distinguant 6
types de chunks possibles. En supposant un &#233;tiquetage parfait, la &#8220;micro-average&#8221; (moyenne
des F-mesures de chaque groupe pond&#233;r&#233;es par leur effectif) vaut 79,73, tandis que la &#8220;macro-
average&#8221; (moyenne des F-mesure sans pond&#233;ration) vaut 73,37.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et TOUSSENEL, F. (2003). Building a treebank for french. In ABEILL&#201;, A.,
&#233;diteur : Treebanks. Kluwer, Dordrecht.
ABNEY, S. (1991). Parsing by chunks. In BERWICK, R., ABNEY, R. et TENNY, C., &#233;diteurs :
Principle-based Parsing. Kluwer Academic Publisher.
CONSTANT, M., TELLIER, I., DUCHIER, D., DUPONT, Y., SIGOGNE, A. et BILLOT, S. (2011). Int&#233;grer
des connaissances linguistiques dans un CRF : application &#224; l&#8217;apprentissage d&#8217;un segmenteur-
&#233;tiqueteur du fran&#231;ais. In Actes de TALN&#8217;11.
LAFFERTY, J., MCCALLUM, A. et PEREIRA, F. (2001). Conditional random fields : Probabilistic
models for segmenting and labeling sequence data. In Proceedings of ICML 2001, pages 282&#8211;289.
SAGOT, B. (2010). The lefff, a freely available, accurate and large-coverage lexicon for french. In
Proceedings of the 7th International Conference on Language Resources and Evaluation (LREC&#8217;10).
SHA, F. et PEREIRA, F. (2003). Shallow parsing with conditional random fields. In Proceedings of
HLT-NAACL 2003, pages 213 &#8211; 220.
TELLIER, I., DUCHIER, D., ESHKOL, I., COURMET, A. et MARTINET, M. (2012). Apprentissage
automatique d&#8217;un chunker pour le fran&#231;ais. In Actes de TALN&#8217;12, papier court (poster).
TELLIER, I. et TOMMASI, M. (2011). Champs Markoviens Conditionnels pour l&#8217;extraction d&#8217;in-
formation. In Eric GAUSSIER et Fran&#231;ois YVON, &#233;diteurs : Mod&#232;les probabilistes pour l&#8217;acc&#232;s &#224;
l&#8217;information textuelle. Herm&#232;s.
</p>
<p>8</p>

</div></div>
</body></html>