<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annotation r&#233;f&#233;rentielle du Corpus Arbor&#233; de Paris 7 en entit&#233;s nomm&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 535&#8211;542,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Annotation r&#233;f&#233;rentielle du Corpus Arbor&#233; de Paris 7
en entit&#233;s nomm&#233;es
</p>
<p>Beno&#238;t Sagot1 Marion Richard1,2 Rosa Stern1,3
(1) Alpage, INRIA Paris&#8211;Rocquencourt &amp; Universit&#233; Paris Diderot, 175 rue du Chevaleret, 75013 Paris
</p>
<p>(2) ISHA, Universit&#233; Paris Sorbonne, 7 rue Victor Cousin, 75006 Paris
(3) AFP MediaLab, 2 place de la Bourse, 75002 Paris
</p>
<p>benoit.sagot@inria.fr, ma.rih.on75@gmail.com, rosa.stern@afp.com
</p>
<p>R&#201;SUM&#201;
Le Corpus Arbor&#233; de Paris 7 (ou French TreeBank) est le corpus de r&#233;f&#233;rence pour le fran&#231;ais aux
niveaux morphosyntaxique et syntaxique. Toutefois, il ne contient pas d&#8217;annotations explicites
en entit&#233;s nomm&#233;es. Ces derni&#232;res sont pourtant parmi les informations les plus utiles pour de
nombreuses t&#226;ches en traitement automatique des langues et de nombreuses applications. De
plus, aucun corpus du fran&#231;ais annot&#233; en entit&#233;s nomm&#233;es et de taille importante ne contient
d&#8217;annotation r&#233;f&#233;rentielle, qui compl&#232;te les informations de typage et d&#8217;empan sur chaque
mention par l&#8217;indication de l&#8217;entit&#233; &#224; laquelle elle r&#233;f&#232;re. Nous avons annot&#233; manuellement
avec ce type d&#8217;informations, apr&#232;s pr&#233;-annotation automatique, le Corpus Arbor&#233; de Paris 7.
Nous d&#233;crivons les grandes lignes du guide d&#8217;annotation sous-jacent et nous donnons quelques
informations quantitatives sur les annotations obtenues.
</p>
<p>ABSTRACT
Referential named entity annotation of the Paris 7 French TreeBank
</p>
<p>The French TreeBank developed at the University Paris 7 is the main source of morphosyntactic
and syntactic annotations for French. However, it does not include explicit information related
to named entities, which are among the most useful information for several natural language
processing tasks and applications. Moreover, no large-scale French corpus with named entity
annotations contain referential information, which complement the type and the span of each
mention with an indication of the entity it refers to. We have manually annotated the French
TreeBank with such information, after an automatic pre-annotation step. We sketch the underlying
annotation guidelines and we provide a few figures about the resulting annotations.
</p>
<p>MOTS-CL&#201;S : R&#233;solution d&#8217;entit&#233;s nomm&#233;es, Corpus annot&#233;, Corpus arbor&#233; de Paris 7.
</p>
<p>KEYWORDS: Named entity resolution, Annotated corpus, French TreeBank.
</p>
<p>1 Introduction et &#233;tat de l&#8217;art
</p>
<p>La notion d&#8217;entit&#233; nomm&#233;e (EN) est au c&#339;ur d&#8217;un nombre consid&#233;rable de travaux en traitement
automatique des langues depuis plusieurs d&#233;cennies. Elle a notamment fait l&#8217;objet des conf&#233;rences
MUC (Marsh et Perzanowski, 1998) et des campagnes associ&#233;es, puis de campagnes CoNNL
(Sang et Meulder, 2003) et ACE (Doddington et al., 2004). Traditionnellement, et notamment
dans les campagnes MUC, les EN sont class&#233;es en noms de personnes, noms de lieux, noms
</p>
<p>535</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;organisations, et parfois &#171; autres noms propres &#187;. Au-del&#224; de cette d&#233;finition simple et restrictive,
l&#8217;usage s&#8217;accorde de plus en plus &#224; &#233;tendre la notion d&#8217;EN &#224; d&#8217;autres types, comme les noms de
marques et de produits, qui sont &#233;galement le plus souvent des noms propres, mais &#233;galement
les noms d&#8217;&#339;uvres, les dates, les montants, voire les adresses, les URLs, les nombres, voire tout
token 1 ou s&#233;quence de tokens qui n&#8217;a pas vocation &#224; faire partie d&#8217;un lexique et qui respecte
une grammaire dite locale, sp&#233;cifique &#224; la nature de ce qu&#8217;elle d&#233;note (Sekine et Nobata, 2004;
Grouin et al., 2011). Ce que tous ces types d&#8217;EN ont en commun est leur caract&#232;re r&#233;f&#233;rentiel,
qui se d&#233;cline toutefois de fa&#231;on diff&#233;rente suivant les types, voire suivant les corpus. C&#8217;est ainsi
qu&#8217;Ehrmann (2008) d&#233;finit une entit&#233; nomm&#233;e comme suit : &#201;tant donn&#233; un mod&#232;le applicatif et
un corpus, on appelle EN toute expression linguistique qui r&#233;f&#232;re &#224; une entit&#233; unique du mod&#232;le de
mani&#232;re autonome dans le corpus.
</p>
<p>La t&#226;che de reconnaissance d&#8217;EN est g&#233;n&#233;ralement con&#231;ue comme ayant pour objectif d&#8217;identifier
automatiquement en corpus les mentions d&#8217;EN, c&#8217;est-&#224;-dire les s&#233;quences de tokens qui r&#233;f&#232;rent
&#224; une entit&#233;, mais &#233;galement de typer ces mentions, par exemple avec des cat&#233;gories telles
que Person, Location, Organization. De tr&#232;s nombreux travaux ont &#233;t&#233; publi&#233;s depuis
longtemps sur cette t&#226;che, qui a &#233;t&#233; abord&#233;e entre autres avec des m&#233;thodes &#224; base de r&#232;gles
et, souvent, de ressources lexicales (&#171; gazetteers &#187;, ou lexiques de mentions d&#8217;entit&#233;s associ&#233;es &#224;
des types) (Sekine et Nobata, 2004; Rosset et al., 2005; Stern et Sagot, 2010), des techniques
statistiques d&#8217;apprentissage reposant sur des corpus annot&#233;s (Finkel et al., 2005; Bechet et
Charton, 2010), et des techniques hybrides. Ces travaux accordent souvent, sous une forme ou
sous une autre, une importance particuli&#232;re au probl&#232;me du typage en lien avec des ph&#233;nom&#232;nes
tels que la m&#233;tonymie : en effet, on peut distinguer deux fa&#231;ons de typer une entit&#233;, soit de fa&#231;on
intrins&#232;que (la France d&#233;note un lieu), soit en contexte (dans La France a sign&#233; le trait&#233;, France
peut &#234;tre typ&#233; comme une organisation).
</p>
<p>Qu&#8217;il s&#8217;agisse de permettre l&#8217;&#233;valuation de ces syst&#232;mes, ou leur entra&#238;nement dans le cas de
syst&#232;mes statistiques, des corpus annot&#233;s ont &#233;t&#233; d&#233;velopp&#233;s pour diverses langues. Pour le
fran&#231;ais, on peut citer notamment les corpus ESTER et ESTER2 (60 plus 150 heures d&#8217;&#233;missions
transcrites orthographiquement et annot&#233;es en EN) (Galliano et al., 2009), ainsi que le corpus
Quaero (Grouin et al., 2011). Tous ces corpus reposent sur des donn&#233;es orales transcrites
(&#233;missions de radio). On notera que le corpus Quaero repose sur une d&#233;finition originale, tr&#232;s
riche et structur&#233;e de la notion d&#8217;EN (Rosset et al., 2011). De plus, il contient des annotations
de typage &#224; la fois en termes de type absolu et de type en contexte, contrairement aux corpus
ESTER qui ne contiennent que le type en contexte.
</p>
<p>Toutefois, la seule t&#226;che de reconnaissance des EN ne suffit pas &#224; extraire les informations
n&#233;cessaires pour des applications comme l&#8217;extraction d&#8217;informations. Seul un syst&#232;me permettant
d&#8217;associer &#224; ces mentions un r&#233;f&#233;rent extra-linguistique permet d&#8217;exploiter le r&#233;sultat de la
d&#233;tection gr&#226;ce au sens qui lui est ainsi conf&#233;r&#233; (Blume, 2005). Cette t&#226;che dite de r&#233;solution
des EN (REN, entity linking) consiste ainsi &#224; associer &#224; chaque mention d&#8217;EN l&#8217;entr&#233;e ad&#233;quate
dans une base d&#8217;entit&#233;s qui sert de r&#233;f&#233;rence, en traitant notamment les cas d&#8217;homonymie : une
mention de Michael Jordan r&#233;f&#232;re-t-elle au footballeur, au joueur de basket ou &#224; l&#8217;&#233;conomiste ?
Une mention d&#8217;Orange r&#233;f&#232;re-t-elle &#224; une ville (laquelle ?) ou &#224; l&#8217;entreprise ? Outre les difficult&#233;s
li&#233;es &#224; l&#8217;homonymie des mentions, mais &#233;galement aux ph&#233;nom&#232;nes de m&#233;tonymie, on est
&#233;galement confront&#233; &#224; la diversit&#233; des mentions pour une m&#234;me entit&#233; (variantes graphiques :
Jacques Chirac et J. Chirac, surnoms : Ali le chimique pour Ali Hassan al-Majid).
</p>
<p>1. Un token, contrairement &#224; une (occurrence de) forme, est une unit&#233; typographique (Sagot et Boullier, 2008).
</p>
<p>536</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La r&#233;solution automatique d&#8217;EN fait l&#8217;objet de travaux depuis quelques ann&#233;es sur l&#8217;anglais
(Bunescu et Pasca, 2006; Cucerzan, 2007; McNamee et Dang, 2009). C&#8217;est souvent Wikipedia qui
est utilis&#233; comme base d&#8217;entit&#233;s de r&#233;f&#233;rence. Pour le fran&#231;ais, Stern et Sagot (2010) proposent
un syst&#232;me &#224; base de r&#232;gles int&#233;gr&#233; &#224; la cha&#238;ne de traitements de surface SxPIPE(Sagot et Boullier,
2008), nomm&#233; NP. Ce syst&#232;me repose sur la base d&#8217;entit&#233;s Aleda (Sagot et Stern, 2012), extraite
automatiquement &#224; partir de Wikipedia et de la base de noms de lieux Geonames. Cependant,
peu de corpus annot&#233;s en r&#233;f&#233;rence, associ&#233;s &#224; une base d&#8217;entit&#233;s, sont disponibles pour &#233;valuer
ou entra&#238;ner de tels syst&#232;mes. Pour l&#8217;anglais, on peut citer le corpus rendu disponible pour la
t&#226;che de peuplement de base de donn&#233;es de la campagne TAC 2009 (McNamee et Dang, 2009).
Pour le fran&#231;ais, le seul corpus disponible est constitu&#233; de 100 d&#233;p&#234;ches de l&#8217;Agence France-Presse
de 300 mots chacune en moyenne, qui utilise comme r&#233;f&#233;rence la base Aleda (Stern et Sagot,
2010). Outre les informations r&#233;f&#233;rentielles, ce corpus inclut naturellement pour chaque mention
annot&#233;e les informations d&#8217;empan et de type, plus pr&#233;cis&#233;ment de type absolu, en coh&#233;rence avec
le type de l&#8217;entit&#233; tel qu&#8217;il est indiqu&#233; (ou devrait l&#8217;&#234;tre) dans Aleda.
</p>
<p>Dans cet article, nous d&#233;crivons un travail d&#8217;annotation des entit&#233;s nomm&#233;es du Corpus Arbor&#233;
de Paris 7, ou French TreeBank (Abeill&#233; et al., 2003), avec les m&#234;mes principes que le petit corpus
de Stern et Sagot (2010). L&#8217;objectif est triple :
&#8211; Pr&#233;ciser les conventions d&#8217;annotation en les confrontant &#224; un corpus plus important et moins
</p>
<p>contemporain des ressources utilis&#233;es pour construire Aleda ;
&#8211; Fournir &#224; la communaut&#233; un corpus &#233;crit de taille importante dont les EN soient annot&#233;es en
</p>
<p>empan, type et r&#233;f&#233;rence ;
&#8211; Ajouter une couche d&#8217;annotation &#224; un corpus pour lequel d&#8217;autres niveaux d&#8217;annotations sont
</p>
<p>disponibles (&#224; ce jour, annotations morphosyntaxiques, arbres de constituance et fonctions
syntaxiques ; &#224; terme, annotations de type FrameNet et annotations discursives).
</p>
<p>Nous d&#233;crivons donc succinctement les conventions d&#8217;annotations utilis&#233;es (section 2), le pro-
cessus d&#8217;annotation guid&#233; par une pr&#233;-annotation effectu&#233;e &#224; l&#8217;aide du syst&#232;me NP mentionn&#233;
ci-dessus (section 3) et les r&#233;sultats obtenus (section 4).
</p>
<p>2 Conventions d&#8217;annotation
</p>
<p>2.1 Principes g&#233;n&#233;raux
</p>
<p>Nous avons annot&#233; le Corpus Arbor&#233; de Paris 7 en indiquant l&#8217;empan, le type absolu 2 parfois
compl&#233;t&#233; d&#8217;un sous-type et l&#8217;identifiant du r&#233;f&#233;rent dans la base Aleda de toute mention d&#8217;EN
sous forme de nom propre, &#224; l&#8217;exclusion de tout autre type d&#8217;expression r&#233;f&#233;rentielle (descrip-
tions d&#233;finies, pronoms. . .). Nous nous sommes restreints aux noms de personnes, de lieux,
d&#8217;organisations, d&#8217;entreprises, et &#224; certains noms de produits. Une annotation syst&#233;matique des
noms de produits et des noms d&#8217;&#339;uvres sera &#224; effectuer ult&#233;rieurement. En revanche, nous ne
nous sommes int&#233;ress&#233;s ni aux EN moins standard (URL, pourcentages. . .) ni aux expressions
temporelles. Enfin, nous n&#8217;avons annot&#233; aucune EN ench&#226;ss&#233;e dans une autre.
</p>
<p>Plus pr&#233;cis&#233;ment, nous avons fait usage de 7 types de base : Person, Location,
</p>
<p>2. L&#8217;entit&#233; France sera donc toujours une entit&#233; Location avec pour sous type Pays, comme indiqu&#233; dans Aleda
pour le r&#233;f&#233;rent correspondant, m&#234;me si le sens contextuel r&#233;f&#232;re &#224; l&#8217;organisation politique, au peuple fran&#231;ais, &#224; l&#8217;&#233;quipe
de foot, etc.
</p>
<p>537</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Organization, Company, Product, POI (Point of Interest) et FictionChar (personnage
de fiction). Ces types sont parfois pr&#233;cis&#233;es par un sous-type. Les types et sous-types ont &#233;t&#233;
organis&#233;s via une ontologie, dans laquelle les types sont des classes qui sont &#224; la t&#234;te d&#8217;une
hi&#233;rarchie de sous-classes qui correspondent &#224; des sous- types. Pour sous-typer une entit&#233; il n&#8217;est
donc pas n&#233;cessaire de pr&#233;ciser la totalit&#233; des sous-classes qui lui correspondent.
</p>
<p>Notre d&#233;finition de ce qu&#8217;est une EN conduit &#224; des cas limites, notamment pour les mentions
qui n&#8217;ont pas de r&#233;f&#233;rent autonome en soi, mais qui en acqui&#232;rent un en contexte, comme par
exemple banque centrale. Dans ce type de cas, nous avons consid&#233;r&#233; qu&#8217;il y avait bien mention
d&#8217;EN, et nous avons donc annot&#233;, pour peu que le contexte donn&#233; permette d&#8217;&#233;tablir quelle est la
banque pr&#233;cise dont il est question, &#224; la condition (arbitraire) suppl&#233;mentaire que la mention
commence par une majuscule. Ainsi, une mention comme banque centrale sera syst&#233;matiquement
ignor&#233;e. En revanche, les mentions primaires d&#8217;entit&#233;s qui ne d&#233;pendent pas du contexte sont
annot&#233;es qu&#8217;elles aient ou non des majuscules, comme par exemple banque mondiale. Cette
situation se retrouve par exemple &#233;galement dans le cas de l&#8217;annotation des noms d&#8217;universit&#233;s.
Nous consid&#233;rons ainsi qu&#8217;universit&#233; de Nantes d&#233;note une universit&#233; situ&#233;e &#224; Nantes, et nous
n&#8217;annotons que la ville de Nantes, alors qu&#8217;Universit&#233; de Nantes fait directement r&#233;f&#233;rence &#224;
l&#8217;organisation qu&#8217;est cette universit&#233;, et nous annotons donc l&#8217;ensemble comme une organisation.
Il en va de m&#234;me, par exemple, pour Universit&#233; de Montpellier, puisqu&#8217;il n&#8217;existe pas d&#8217;organisation
unique qui corresponde &#224; ce terme : dans ce cas, seul Montpellier est annot&#233;, en tant que ville.
</p>
<p>Les mentions annot&#233;es peuvent correspondre au nom normalis&#233; (Jacques Chirac), &#224; une variante
(Chirac dans M. Chirac, cf. plus bas concernant M.) ou &#224; un surnom (comme dans l&#8217;Hexagone.
Ainsi, la description d&#233;finie l&#8217;avocat de M. Chirac entra&#238;nera une annotation de la mention
Chirac, en ignorant la r&#233;f&#233;rence &#224; l&#8217;avocat de ce dernier. Par ailleurs, les mots grammaticaux ou
contextuels entourant la mention de l&#8217;entit&#233; sont ignor&#233;s. Ainsi les d&#233;terminants ne sont pas pris
en compte, ni les titres, professions ou adjectifs pouvant appara&#238;tre pour qualifier l&#8217;entit&#233;. Ainsi,
dans Chine m&#233;ridionale, seul Chine est annot&#233; comme un nom de lieu, et dans M. Bill Clinton seul
Bill Clinton est annot&#233; comme un nom de personne.
</p>
<p>Les balises utilis&#233;es pour l&#8217;annotation contiennent les informations suivantes :
&#8211; l&#8217;identifiant de l&#8217;EN dans Aleda (attribut eid) ; dans le cas d&#8217;une entit&#233; non pr&#233;sente dans la
</p>
<p>base l&#8217;identifiant est marqu&#233; null.
&#8211; le nom normalis&#233; de l&#8217;entit&#233;, tel qu&#8217;indiqu&#233; dans Aleda ; pour les lieux il s&#8217;agit du nom donn&#233;
</p>
<p>dans GeoNames et pour les autres entit&#233;s du titre de l&#8217;article dans la Wikipedia fran&#231;aise.
&#8211; un type, ainsi qu&#8217;un sous-type dans le cas o&#249; l&#8217;entit&#233; entre dans une cat&#233;gorie sous-typ&#233;e
</p>
<p>(cf. section ci-dessous).
Voici deux exemples d&#8217;annotation :
&lt;ENAMEX type=&quot;Organization&quot; eid=&quot;1000000000016778&quot; name=&quot;Conf&#233;d&#233;ration
fran&#231;aise d&#233;mocratique du travail&quot;&gt;CFDT&lt;/ENAMEX&gt;
&lt;ENAMEX type=&quot;Location&quot; sub_type=&quot;Country&quot; eid=&quot;2000000001861060&quot;
name=&quot;Japan&quot;&gt;Japon&lt;/ENAMEX&gt;
Dans certaines balises se trouve une information suppl&#233;mentaire pour les cas de fusions
d&#8217;entreprises, de changement de nom d&#8217;une entreprise et de lieux g&#233;ographiques qui n&#8217;existent
plus en tant que tels :
&#8211; current_eid est l&#8217;identifiant dans Aleda d&#8217;une entit&#233; actuelle correspondant &#224; une entit&#233; qui
</p>
<p>n&#8217;existe plus mais qui est le r&#233;f&#233;rent r&#233;el (par exemple en cas de rachat d&#8217;une entreprise par
une autre) ;
</p>
<p>&#8211; current_name est le nom normalis&#233; de l&#8217;entit&#233; current_eid.
</p>
<p>538</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Si une entreprise a chang&#233; de nom sans que l&#8217;on puisse consid&#233;rer qu&#8217;il y a eu changement de
r&#233;f&#233;rent, on ajoute un attribut former_name qui permet d&#8217;indiquer que la mention de l&#8217;entit&#233;
r&#233;f&#232;re &#224; l&#8217;ancien nom de l&#8217;entreprise. Enfin un attribut former_location initialis&#233; &#224; True
permet d&#8217;annoter un lieu g&#233;ographique disparu.
</p>
<p>2.2 Types et sous-types
</p>
<p>L&#8217;annotation des noms de personnes ne pose pas de probl&#232;mes particuliers. Deux pr&#233;cisions
toutefois concernant deux cas :
&#8211; Les groupes de personnes : Les r&#233;f&#233;rences &#224; des groupes de personnes, telles que la famille
Agnelli ou les fr&#232;res Maxwell, ne sont pas annot&#233;es. Il en est de m&#234;me pour les populations : le
groupe de personnes d&#233;sign&#233; par Les Fran&#231;ais n&#8217;est pas pris en compte dans l&#8217;annotation.
</p>
<p>&#8211; Les fonctions ou titres : Les fonctions ne sont pas annot&#233;es. Une expression telle que le Premier
ministre M. Fillon permettra d&#8217;annoter Fillon mais ne tiendra pas compte de la mention Premier
ministre en tant qu&#8217;EN (cela suit le fait que nous ne retenons pas les mentions sous forme de
description d&#233;finie). Dans la lign&#233;e, l&#8217;expression G&#233;n&#233;ral de Gaulle donnera lieu &#224; l&#8217;annotation
de la mention de Gaulle, mais G&#233;n&#233;ral ne sera pas inclus dans l&#8217;empan.
</p>
<p>Le type FictionChar permet d&#8217;annoter toutes les mentions qui font r&#233;f&#233;rence &#224; des noms de
personnes ou d&#8217;animaux fictifs, telles que McGyver ou Zorro.
</p>
<p>Parmi les noms de lieux, les sous-types utilis&#233;s sont les suivants :
&#8211; Sont sous-typ&#233;s Country les &#233;tats ind&#233;pendants ;
&#8211; Les divisions territoriales des pays sont annot&#233;es CountryDivision (chaque pays ayant sa
</p>
<p>propre gestion du territoire, des sous-types tels que d&#233;partement, etat f&#233;d&#233;ral, canton, district,
comt&#233; ne semblaient pas pertinents) ;
</p>
<p>&#8211; le sous-type Region permet d&#8217;annoter des parties du monde non li&#233;es &#224; une gestion politique.
Ce sous-type regroupe les continents et parties de continents, ainsi que des lieux g&#233;ographiques
sans fronti&#232;res mais dans le vocabulaire courant tel que la r&#233;gion du Golfe ;
</p>
<p>Le type &#171; Point Of Interest &#187; (POI) est utilis&#233; pour les entit&#233;s telles que les ports, les salles de
spectacle, les stades, les quartiers, etc.
</p>
<p>Nous consid&#233;rons comme des noms d&#8217;organisations et typons Organization toutes les r&#233;f&#233;-
rences &#224; des organisations qu&#8217;elles soient politique, &#233;ducative, &#233;conomique, etc, &#224; l&#8217;exclusion
des noms d&#8217;entreprises. Un seul sous-type est utilis&#233;, PoliticalGroup pour les organisations
politiques. Enfin, les noms d&#8217;entreprises, typ&#233;s Company, ne sont pas sous-typ&#233;s.
</p>
<p>2.3 Difficult&#233;s g&#233;n&#233;riques
</p>
<p>L&#8217;annotation est parfois rendue difficile du fait de l&#8217;ambigu&#239;t&#233; de l&#8217;entit&#233; ou de sa cat&#233;gorisation.
En contexte journalistique, les principaux cas de difficult&#233; sont li&#233;s &#224; la temporalit&#233; du corpus.
En effet les informations pr&#233;sentes dans un corpus journalistique d&#233;pendent essentiellement du
contexte temporel. Ainsi, en 2011, ann&#233;e dont datent les informations ayant servi &#224; construire
la base de r&#233;f&#233;rence Aleda, la Tch&#233;coslovaquie, l&#8217;URSS ou l&#8217;entreprise Thomson CSF n&#8217;existent
plus, mais en 1990, date de r&#233;daction des textes constituant le corpus, ces pays existaient encore.
Faire l&#8217;impasse sur ces entit&#233;s serait faire l&#8217;impasse sur une partie de l&#8217;information pass&#233;e, nous
avons donc d&#233;fini des r&#232;gles d&#8217;annotation pour ces entit&#233;s particuli&#232;res.
</p>
<p>539</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les mentions d&#8217;entreprises peuvent ne plus avoir de r&#233;f&#233;rence actuelle. Si l&#8217;entreprise a
simplement disparu, son r&#233;f&#233;rent est annot&#233; null. Mais cela peut aussi &#234;tre d&#251; &#224; un changement
de nom, &#224; un rachat ou &#224; une fusion avec une autre entreprise. Dans les cas d&#8217;un changement de
nom, nous avons inclus l&#8217;ancien nom dans un attribut former_name.
&lt;ENAMEX type=&quot;Organization&quot; eid=&quot;1000000000036708&quot; name=&quot;France 2&quot;
former_name=&quot;Antenne 2&quot;&gt;Antenne 2&lt;/ENAMEX&gt;
Dans le cas du rachat d&#8217;une entreprise ou d&#8217;une fusion, nous ajoutons deux sous-types pour
permettre d&#8217;identifier la r&#233;f&#233;rence actuelle de l&#8217;entreprise en opposition &#224; la r&#233;f&#233;rence du texte,
(datant ici des ann&#233;es 90). Ainsi nous conservons la valeur temporelle du texte dans l&#8217;annotation
tout en actualisant la r&#233;f&#233;rence. Par exemple &#224; l&#8217;&#233;poque de la r&#233;daction des d&#233;p&#234;ches du corpus
le groupe UAP n&#8217;avait pas encore fusionn&#233; avec le groupe AXA, les attributs current_eid et
current_name permettent d&#8217;actualiser la r&#233;f&#233;rence en donnant l&#8217;information que le groupe
s&#8217;appelle d&#233;sormais AXA.
&lt;ENAMEX type=&quot;Company&quot; eid=&quot;null&quot; name=&quot;Union des assurances de Paris&quot;
current_eid=&quot;1000000000201762&quot; current_name=&quot;AXA&quot;&gt;UAP &lt;/ENAMEX&gt;
Quant aux filiales, elles sont annot&#233;es seules c&#8217;est &#224; dire sans r&#233;f&#233;rence &#224; leur entreprise m&#232;re.
Lorsqu&#8217;il s&#8217;agit de petites filiales qui n&#8217;ont pas de r&#233;f&#233;rent, comme c&#8217;est le cas de nombreuses fois,
l&#8217;identifiant sera annot&#233; null. Les filiales &#233;trang&#232;res connues d&#8217;Aleda des grosses entreprises
sont annot&#233;es en tant que telles.
</p>
<p>Plusieurs mentions faisant r&#233;f&#233;rence &#224; une entreprise ou une usine sont cit&#233;es via leur marque
(ex. : Mamie nova). Dans ce cas, l&#8217;annotation est faite sur la marque. Dans une expression comme
un tracteur John Deer, l&#8217;entit&#233; John Deer est annot&#233;e en tant qu&#8217;entreprise, pour rester coh&#233;rent
avec l&#8217;id&#233;e de d&#233;part qui est de consid&#233;rer les EN dans leur sens absolu. Le choix d&#8217;annoter une
EN pr&#233;sentant une ambigu&#239;t&#233; entre nom de produit ou d&#8217;entreprise est guid&#233; par le type associ&#233; &#224;
l&#8217;entit&#233; dans la base de donn&#233;es Aleda (par exemple, Nike et Adidas sont annot&#233;s Company, mais
Evian ou Lessieur sont annot&#233;s Product).
</p>
<p>Pour les d&#233;nominations g&#233;ographiques qui ne sont plus d&#8217;actualit&#233; &#224; la date d&#8217;extraction d&#8217;Aleda
mais qui sont utilis&#233;es dans le corpus, nous ajoutons un sous-type former-location de type
boolean qui est annot&#233; true par d&#233;faut. Ces lieux ne poss&#233;dant pas d&#8217;identifiant dans la base
de donn&#233;es ils sont identifi&#233;s null, mais cela permet leur annotation et reconnaissance dans le
corpus.
&lt;ENAMEX type=&quot;Location&quot; sub_type=&quot;Country&quot; eid=&quot;null&quot; former_location=&quot;true&quot;
name=&quot;Tch&#233;coslovaquie&quot;&gt;Tch&#233;coslovaquie &lt;/ENAMEX&gt;
</p>
<p>Outre ces difficult&#233;s relativement g&#233;n&#233;rales, certaines entit&#233;s ou mentions ont pos&#233; des probl&#232;mes
sp&#233;cifiques sur lesquels il a fallu faire des choix. C&#8217;est le cas de Tr&#233;sor (public) 3, Hachette 4 et
Thomson 5 qui correspondent &#224; des organisations qui ont fortement &#233;volu&#233; entre la date de
r&#233;daction du corpus et la date de cr&#233;ation d&#8217;Aleda.
</p>
<p>3. Certains pays disposant de plusieurs organismes se divisant les t&#226;ches associ&#233;es &#224; la notion g&#233;n&#233;rale de tr&#233;sor
public. Dans ce cas, nous choisissons le minist&#232;re des finances comme r&#233;f&#233;rent de la mention Tr&#233;sor (public).
</p>
<p>4. Toutes les occurrences de Hachette sont annot&#233;es sous la r&#233;f&#233;rence au Groupe Lagard&#232;re, propri&#233;taire de Hachette
livres et de Hachette Filippachi M&#233;dias. Hachette ne correspond plus aujourd&#8217;hui &#224; une entit&#233; unique.
</p>
<p>5. &#192; l&#8217;&#233;poque de r&#233;daction du corpus, la mention Thomson pouvait faire r&#233;f&#233;rence &#224; deux entreprises : Thomson CSF
aujourd&#8217;hui devenu Thal&#232;s et Thomson SA aujourd&#8217;hui Technicolor. Dans les cas les plus simples la mention est suivi
de CSF ou SA, et on donne donc le r&#233;f&#233;rent Thal&#232;s ou Technicolor, en indiquant le former_name. Les occurrences de
Thomson seul sont d&#233;sambigu&#239;s&#233;es en contexte.
</p>
<p>540</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Processus d&#8217;annotation
</p>
<p>L&#8217;int&#233;gralit&#233; du Corpus Arbor&#233; de Paris 7 dans sa version 2007 (&#224; l&#8217;exclusion des phrases n&#8217;ayant
pas re&#231;u d&#8217;annotations fonctionnelles), soit 12 351 phrases contenant 350 931 tokens, a &#233;t&#233;
annot&#233; en EN (empan, type, r&#233;f&#233;rence) conform&#233;ment aux directives esquiss&#233;es ci-dessus. L&#8217;an-
notation a consist&#233; en une validation ou correction manuelle dans un &#233;diteur XML du r&#233;sultat
de SxPIPE/NP utilis&#233; comme pr&#233;-annotateur. Le r&#233;sultat de cette campagne d&#8217;annotation est &#224;
consid&#233;rer comme pr&#233;liminaire, puisqu&#8217;une seule personne a annot&#233; le corpus. Nous sommes
bien conscients des probl&#233;matiques li&#233;es &#224; toute t&#226;che d&#8217;annotation manuelle, et en particulier
&#224; l&#8217;annotation en EN, probl&#233;matiques analys&#233;es par exemple par Fort et al. (2009). L&#8217;effort
d&#8217;annotation devrait donc &#234;tre poursuivi, notamment en obtenant une deuxi&#232;me annotation, qui
permettrait la mesure d&#8217;accords inter-annotateurs ainsi qu&#8217;une adjudication des cas de d&#233;saccord.
</p>
<p>4 R&#233;sultats et perspectives
</p>
<p>Au total, 5 890 des 12 351 phrases contiennent au moins une mention d&#8217;EN. Au total, 11 636 men-
tions ont &#233;t&#233; annot&#233;es, qui se r&#233;partissent en 3761 noms de lieux, 3357 noms d&#8217;entreprises, 2381
noms d&#8217;organisations, 2025 noms de personnes, 67 noms de produits, 29 noms de personnages
de fiction et 15 POI.
</p>
<p>Outre une am&#233;lioration de la qualit&#233; de l&#8217;annotation, comme &#233;voqu&#233; ci-dessus, nous pr&#233;voyons
d&#8217;utiliser ce nouveau corpus annot&#233; de multiples fa&#231;ons. Tout d&#8217;abord, il pourra &#234;tre utilis&#233; pour
entra&#238;ner et &#233;valuer des syst&#232;mes de reconnaissance et/ou de r&#233;solution d&#8217;entit&#233;s nomm&#233;es. Une
comparaison avec le petit corpus de Stern et Sagot (2010), compos&#233; de textes relevant d&#8217;un
domaine proche mais distinct (d&#233;p&#234;ches d&#8217;agence), sera en ce sens utile. Mais la disponibilit&#233;
d&#8217;informations morphosyntaxiques et syntaxiques permettra des exp&#233;riences int&#233;ressantes impli-
quant par exemple des mod&#232;les joints de reconnaissance d&#8217;EN et d&#8217;&#233;tiquetage morphosyntaxique,
ou de reconnaissance d&#8217;EN et d&#8217;analyse syntaxique.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; financ&#233; par le projet ANR EDyLex (ANR-009-CORD-08).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et TOUSSENEL, F. (2003). Building a treebank for French. In ABEILL&#201;, A.,
&#233;diteur : Treebanks. Kluwer, Dordrecht.
</p>
<p>BECHET, F. et CHARTON, E. (2010). Unsupervised knowledge acquisition for extracting named
entities from speech. In 2010 IEEE International Conference on Acoustics, Speech and Signal
Processing.
</p>
<p>541</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BLUME, M. (2005). Automatic entity disambiguation : Benefits to ner, relation extraction, link
analysis, and inference. International Conference on Intelligence Analysis.
</p>
<p>BUNESCU, R. et PASCA, M. (2006). Using encyclopedic knowledge for named entity disambigua-
tion. In Proceedings of EACL, volume 6, pages 9&#8211;16.
</p>
<p>CUCERZAN, S. (2007). Large-scale named entity disambiguation based on wikipedia data. In
Proceedings of EMNLP-CoNLL, volume 2007, pages 708&#8211;716.
</p>
<p>DODDINGTON, G., MITCHELL, A., PRZYBOCKI, M., RAMSHAW, L., STRASSEL, S. et WEISCHEDEL, R.
(2004). The automatic content extraction (ace) program-tasks, data, and evaluation. In
Proceedings of LREC - Volume 4, pages 837&#8211;840.
</p>
<p>EHRMANN, M. (2008). Les Entit&#233;s Nomm&#233;es, de la Linguistique au TAL - Statut Th&#233;orique et
M&#233;thodes de D&#233;sambigu&#239;sation. Th&#232;se de doctorat, Universit&#233; Paris 7 Denis Diderot.
</p>
<p>FINKEL, J. R., GRENAGER, T. et MANNING, C. (2005). Incorporating non-local information into
information extraction systems by gibbs sampling. In Proceedings of the 43rd Annual Meeting
on Association for Computational Linguistics, ACL &#8217;05, pages 363&#8211;370, Stroudsburg, PA, USA.
Association for Computational Linguistics.
</p>
<p>FORT, K., EHRMANN, M. et NAZARENKO, A. (2009). Towards a methodology for named entities
annotation. In Proceedings of the Third Linguistic Annotation Workshop, ACL-IJCNLP &#8217;09, pages
142&#8211;145, Stroudsburg, PA, USA. Association for Computational Linguistics.
</p>
<p>GALLIANO, S., GRAVIER, G. et CHAUBARD, L. (2009). The Ester 2 Evaluation Campaign for the
Rich Transcription of French Radio Broadcasts. In Interspeech 2009.
</p>
<p>GROUIN, C., ROSSET, S., ZWEIGENBAUM, P., FORT, K., GALIBERT, O. et QUINTARD, L. (2011). Proposal
for an extension of traditional named entities : From guidelines to evaluation, an overview. In
Proceedings of the Fifth Linguistic Annotation Workshop (LAW-V), pages 92&#8211;100, Portland, OR.
Association for Computational Linguistics.
</p>
<p>MARSH, E. et PERZANOWSKI, D. (1998). Muc-7 evaluation of ie technology : Overview of results.
In Proceedings of the Seventh Message Understanding Conference (MUC-7) - Volume 20.
</p>
<p>MCNAMEE, P. et DANG, H. (2009). Overview of the tac 2009 knowledge base population track.
In Text Analysis Conference (TAC).
</p>
<p>ROSSET, S., GROUIN, C. et ZWEIGENBAUM, P. (2011). Entit&#233;s nomm&#233;es structur&#233;es : guide
d&#8217;annotation Quaero. Notes et Documents 2011-04, LIMSI, Orsay, France.
</p>
<p>ROSSET, S., ILLOUZ, G. et MAX, A. (2005). Interaction et recherche d&#8217;information : le projet Ritel.
Traitement Automatique des Langues, 46(3):155&#8211;179.
</p>
<p>SAGOT, B. et BOULLIER, P. (2008). SxPIPE 2 : architecture pour le traitement pr&#233;syntaxique de
corpus bruts. Traitement Automatique des Langues (T.A.L.), 49(2):155&#8211;188.
</p>
<p>SAGOT, B. et STERN, R. (2012). Aleda, a free large-scale entity database for French. In Proceedings
of LREC. To appear.
</p>
<p>SANG, E. F. T. K. et MEULDER, F. D. (2003). Introduction to the conll-2003 shared task : Language-
independent named entity recognition. In Proceedings of CoNLL-2003, pages pp. 142&#8211;147.
</p>
<p>SEKINE, S. et NOBATA, C. (2004). Definition, Dictionaries and Tagger for Extended Named Entity
Hierarchy. In Proceedings of LREC 2004, Lisbon, Portugal.
</p>
<p>STERN, R. et SAGOT, B. (2010). Resources for named entity recognition and resolution in news
wires. In Proceedings of LREC 2010 Workshop on Resources and Evaluation for Identity Matching,
Entity Resolution and Entity Management, La Valette, Malte.
</p>
<p>542</p>

</div></div>
</body></html>