<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Simplification de phrases pour l'extraction de relations</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 1&#8211;14,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Simplification de phrases pour l&#8217;extraction de relations
</p>
<p>Anne-Lyse Minard1, 2 Anne-Laure Ligozat1, 3 Brigitte Grau1, 3
(1) LIMSI-CNRS, BP 133, 91403 Orsay Cedex
</p>
<p>(2) Universit&#233; Paris Sud, 91400 Orsay
(3) ENSIIE, square de la r&#233;sistance, 91000 &#201;vry
</p>
<p>prenom.nom@limsi.fr
</p>
<p>R&#201;SUM&#201;
L&#8217;extraction de relations par apprentissage n&#233;cessite un corpus annot&#233; de tr&#232;s grande taille
pour couvrir toutes les variations d&#8217;expressions des relations. Pour contrer ce probl&#232;me, nous
proposons une m&#233;thode de simplification de phrases qui permet de r&#233;duire la variabilit&#233;
syntaxique des relations. Elle n&#233;cessite l&#8217;annotation d&#8217;un petit corpus qui sera par la suite
augment&#233; automatiquement. La premi&#232;re &#233;tape est l&#8217;annotation des simplifications gr&#226;ce &#224; un
classifieur &#224; base de CRF, puis l&#8217;extraction des relations, et ensuite une compl&#233;tion automatique
du corpus d&#8217;entra&#238;nement des simplifications gr&#226;ce aux r&#233;sultats de l&#8217;extraction des relations. Les
premiers r&#233;sultats que nous avons obtenus pour la t&#226;che d&#8217;extraction de relations d&#8217;i2b2 2010
sont tr&#232;s encourageants.
</p>
<p>ABSTRACT
Sentence simplification for relation extraction
</p>
<p>Machine learning based relation extraction requires large annotated corpora to take into account
the variability in the expression of relations. To deal with this problem, we propose a method for
simplifying sentences, i.e. for reducing the syntactic variability of the relations. Simplification
requires the annotation of a small corpus, which will be automatically augmented. The process
starts with the annotation of the simplification thanks to a CRF classifier, then the relation
extraction, and lastly the automatic completion of the training corpus for the simplification
through the results of the relation extraction. The first results we obtained for the task of relation
extraction of the i2b2 2010 challenge are encouraging.
</p>
<p>MOTS-CL&#201;S : Extraction de relations, simplification de phrases, apprentissage automatique.
</p>
<p>KEYWORDS: Relation extraction, sentence simplification, machine learning.
</p>
<p>1 Introduction
</p>
<p>Dans le domaine m&#233;dical, de nombreux documents &#233;lectroniques sont produits chaque jour,
mais ces documents sont sous forme textuelle, et les informations qu&#8217;ils contiennent sont donc
difficilement exploitables. L&#8217;extraction d&#8217;information consiste &#224; structurer cette information. Pour
une t&#226;che donn&#233;e, les documents disponibles ne contiennent cependant pas n&#233;cessairement de
nombreux exemples d&#8217;apprentissage et les corpus peuvent pr&#233;senter une grande variabilit&#233;. Par
cons&#233;quent, il est n&#233;cessaire de pouvoir apprendre &#224; partir de peu d&#8217;exemples, &#233;ventuellement
</p>
<p>1</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>tr&#232;s disparates. Dans cet article, nous nous int&#233;ressons &#224; une t&#226;che d&#8217;extraction de relations
m&#233;dicales et proposons une m&#233;thode qui consiste &#224; effectuer une simplification syntaxique
pr&#233;alable des phrases. Cette simplification a pour but de normaliser le corpus en ne gardant que
les informations qui sont pertinentes pour l&#8217;extraction. Elle est donc guid&#233;e par la t&#226;che, et peu
d&#8217;exemples sont n&#233;cessaires pour apprendre la simplification puisque l&#8217;extraction de relation est
utilis&#233;e pour augmenter le corpus annot&#233;.
</p>
<p>Apr&#232;s un &#233;tat de l&#8217;art sur le domaine de l&#8217;extraction de relations et sur la simplification (section 2),
nous pr&#233;senterons la t&#226;che d&#8217;extraction de relations en domaine m&#233;dical et son application dans
le cadre du challenge i2b2 2010 1, ainsi que le syst&#232;me que nous avons d&#233;velopp&#233; (section 3).
Ensuite, nous pr&#233;senterons notre m&#233;thode pour l&#8217;annotation des simplifications (section 4). Nous
d&#233;taillerons la m&#233;thode originale propos&#233;e pour am&#233;liorer la simplification gr&#226;ce &#224; la combinaison
du syst&#232;me d&#8217;extraction de relations et du classifieur pour l&#8217;annotation des simplifications
(sections 5 et 6), et terminerons par la pr&#233;sentation des exp&#233;rimentations que nous avons men&#233;es
et des r&#233;sultats obtenus (section 7) 2.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>De nombreuses m&#233;thodes ont &#233;t&#233; propos&#233;es pour l&#8217;extraction de relations, les plus courantes
&#233;tant fond&#233;es sur une classification automatique plus ou moins supervis&#233;e. Les attributs utilis&#233;s
pour la classification repr&#233;sentent en g&#233;n&#233;ral de l&#8217;information lexicale, s&#233;mantique ou syntaxique.
Par exemple (Roberts et al., 2008) proposent une approche fond&#233;e sur des SVM pour extraire des
relations dans des dossiers de patients atteints d&#8217;un cancer. Ils utilisent des attributs lexicaux,
s&#233;mantiques et morpho-syntaxiques. (Uzuner et al., 2010) utilisent des attributs syntaxiques plus
riches puisqu&#8217;ils ajoutent les d&#233;pendances syntaxiques entre les concepts. Ils les utilisent dans
une approche vectorielle fond&#233;e sur des SVM pour extraire des relations entre des probl&#232;mes,
des tests et des traitements dans des comptes-rendus m&#233;dicaux. Ces informations syntaxiques
n&#8217;am&#233;liorent pas la d&#233;tection des relations car dans beaucoup de cas il n&#8217;existe pas de d&#233;pendance
entre les deux concepts. (Zhang et al., 2006) incluent &#233;galement de l&#8217;information syntaxique
riche dans leur syst&#232;me d&#8217;extraction de relations. Pour cela, ils utilisent des arbres syntaxiques
avec des tree kernels. Ils ont test&#233; leur syst&#232;me sur le corpus ACE 2003, et ils montrent que les
meilleurs r&#233;sultats sont obtenus en utilisant le plus petit sous-arbre commun aux deux entit&#233;s.
Nous montrons dans (Minard et al., 2011a) que pour l&#8217;extraction de relations en domaine m&#233;dical
(sur le corpus i2b2 2010) l&#8217;utilisation de l&#8217;arbre minimal commun aux deux entit&#233;s n&#8217;est pas
suffisant et qu&#8217;il est souvent n&#233;cessaire d&#8217;utiliser l&#8217;arbre complet ou tout du moins des &#233;l&#233;ments
de cet arbre.
</p>
<p>Pour am&#233;liorer l&#8217;extraction des relations, nous proposons une m&#233;thode de simplification des
phrases. Simplifier les phrases consiste alors &#224; supprimer ou &#224; rep&#233;rer les mots de la phrase qui
peuvent g&#234;ner le classifieur. Dans notre cas, la simplification ne consiste pas &#224; rendre un texte
plus facile &#224; lire, mais &#224; ne garder que les mots permettant de classer une relation.
</p>
<p>La simplification de textes a donn&#233; lieu &#224; de nombreux travaux, soit en tant que t&#226;che &#224; part
enti&#232;re comme par exemple dans (Woodsend et Lapata, 2011), soit en tant que pr&#233;traitement pour
d&#8217;autres t&#226;ches, comme par exemple la g&#233;n&#233;ration de questions (Heilman et Smith, 2010). Cette
</p>
<p>1. https ://www.i2b2.org/NLP/Relations/
2. Ce travail a &#233;t&#233; partiellement financ&#233; par OSEO dans le cadre du programme Qu&#230;ro.
</p>
<p>2</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>simplification est g&#233;n&#233;ralement fond&#233;e sur des r&#232;gles syntaxiques. Dans le domaine biom&#233;dical,
diff&#233;rentes recherches sur la simplification syntaxique pour am&#233;liorer l&#8217;extraction de relations ont
&#233;t&#233; men&#233;es dans le domaine des interactions entre prot&#233;ines (PPI). (Jonnalagadda et Gonzalez,
2010) ont d&#233;velopp&#233; un outil (bioSimplify) qui produit des phrases simples &#224; partir d&#8217;une phrase
complexe. Leur objectif est d&#8217;augmenter le rappel de l&#8217;extraction d&#8217;information dans le domaine
biom&#233;dical. Pour cela, ils ont &#233;crit des r&#232;gles de simplification syntaxique qui s&#8217;appliquent au
niveau morpho-syntaxique. Leur syst&#232;me produit plusieurs phrases simples et grammaticalement
correctes &#224; partir de la phrase d&#8217;origine. Aucune s&#233;lection de la (des) meilleure(s) phrase(s)
simple(s) n&#8217;est effectu&#233;e, et les r&#232;gles n&#8217;obligent pas la conservation de la paire d&#8217;entit&#233;s candidate.
L&#8217;&#233;valuation de leur outil pour l&#8217;extraction des interactions entre prot&#233;ines n&#8217;est pas assez
pr&#233;cise pour en tirer des conclusions. (Miwa et al., 2010) ont &#233;galement utilis&#233; des r&#232;gles pour
simplifier les phrases. La douzaine de r&#232;gles qu&#8217;ils ont &#233;crites s&#8217;appliquent sur la sortie d&#8217;un
analyseur syntaxique. Elles sont appliqu&#233;es pour chaque paire de prot&#233;ines, car leur r&#244;le est de
supprimer l&#8217;information inutile pour l&#8217;extraction des interactions. Ils ont &#233;valu&#233; l&#8217;impact de la
simplification pour l&#8217;extraction des interactions entre prot&#233;ines et montrent que sur 5 corpus
diff&#233;rents l&#8217;extraction des relations est meilleure. Deux autres travaux portent sur la simplification
des arbres de d&#233;pendances pour la t&#226;che d&#8217;extraction d&#8217;interactions entre prot&#233;ines (Thomas et al.,
2011), par suppression ou modification de types de d&#233;pendances, et pour la t&#226;che BioNLP&#8217;09 3
</p>
<p>(extraction d&#8217;&#233;v&#233;nements biologiques) (Buyko et al., 2011), par &#233;lagage de l&#8217;arbre.
</p>
<p>Dans un autre domaine, l&#8217;annotation des r&#244;les s&#233;mantiques, (Vickrey et Koller, 2008) ont &#233;crit
154 r&#232;gles s&#8217;appliquant &#224; l&#8217;arbre de constituants pour supprimer toute l&#8217;information en dehors
du verbe cible et de ses arguments. Ils proposent une m&#233;thode originale pour s&#233;lectionner les
meilleures r&#232;gles : ils appliquent les r&#232;gles de simplification pour produire toutes les phrases
simplifi&#233;es possibles, puis entra&#238;nent leur syst&#232;me d&#8217;annotation des r&#244;les s&#233;mantiques. La validit&#233;
de chaque r&#232;gle est ensuite &#233;valu&#233;e en fonction de l&#8217;impact de la simplification sur la t&#226;che
principale.
</p>
<p>La m&#233;thode de simplification que nous proposons dans cet article, est fond&#233;e sur un apprentissage
automatique, contrairement aux travaux que nous venons de pr&#233;senter. Le mode d&#8217;apprentissage
semi-supervis&#233; se rapproche de celui d&#233;velopp&#233; par (Vickrey et Koller, 2008) pour la t&#226;che
d&#8217;annotation des r&#244;les s&#233;mantiques. En effet, nous proposons d&#8217;annoter la simplification en
apprenant sur un petit corpus annot&#233;, puis d&#8217;&#233;valuer l&#8217;annotation selon son impact sur l&#8217;extraction
des relations, et enfin nous compl&#233;tons le corpus annot&#233; gr&#226;ce aux r&#233;sultats de l&#8217;extraction des
relations. Cette m&#233;thode se rapproche ainsi des travaux en compression de phrases, qui consiste
&#224; supprimer certains constituants d&#8217;une phrase, consid&#233;r&#233;s comme non essentiels. Les approches
en compression de phrases peuvent se fonder sur des r&#232;gles linguistiques (Yousfi-Monod et
Prince, 2006) ou sur un apprentissage(Knight et Marcu, 2000; Waszak et Torres-Moreno, 2008).
Cependant, notre t&#226;che s&#8217;en distingue par deux aspects : notre objectif n&#8217;est pas de simplifier
les phrases en fonction des informations saillantes, mais en fonction des informations relatives
&#224; l&#8217;extraction d&#8217;une relation, et par ailleurs, nous souhaitons d&#233;velopper un syst&#232;me qui ne
n&#233;cessite pas l&#8217;annotation d&#8217;un grand corpus pour la simplification.
</p>
<p>3. http ://www-tsujii.is.s.u-tokyo.ac.jp/GENIA/SharedTask/
</p>
<p>3</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Extraction de relations en domaine m&#233;dical
</p>
<p>Nous avons d&#233;velopp&#233; un syst&#232;me pour l&#8217;extraction de relations dans le domaine biom&#233;dical.
Il utilise un classifieur &#224; base de SVM, avec la biblioth&#232;que LIBSVM (Chang et Lin, 2001). Le
syst&#232;me peut &#234;tre utilis&#233; pour une classification binaire ou multi-classes (avec une approche
&quot;un-contre-un&quot;). Il utilise des attributs qui prennent en compte des informations de surface,
sur les distances entre mots par exemple, des informations lexicales, comme les mots formant
les concepts, des informations syntaxiques, les cat&#233;gories morpho-syntaxiques des mots, et des
informations s&#233;mantiques gr&#226;ce au typage des concepts. Une description d&#233;taill&#233;e du syst&#232;me est
donn&#233;e dans (Minard et al., 2011b).
</p>
<p>Ce syst&#232;me a &#233;t&#233; utilis&#233; pour le challenge i2b2 2010, pour le challenge DDI 2011 (extraction
d&#8217;interactions entre m&#233;dicaments (Minard et al., 2011c)) et &#233;galement pour l&#8217;extraction d&#8217;interac-
tions entre prot&#233;ines. Dans cet article, les tests sont effectu&#233;s sur le corpus i2b2 2010 que nous
pr&#233;sentons dans la section suivante.
</p>
<p>3.1 Corpus de comptes-rendus m&#233;dicaux
</p>
<p>Dans le cadre du challenge i2b2 2010, un corpus annot&#233; compos&#233; de rapports cliniques a &#233;t&#233;
fourni aux participants. Les comptes rendus du corpus proviennent de 7 centres m&#233;dicaux des
&#201;tats-Unis. Ils ont &#233;t&#233; manuellement anonymis&#233;s et annot&#233;s. Trois types de concepts ont &#233;t&#233;
annot&#233;s : les probl&#232;mes m&#233;dicaux (maladies, syndromes, observations sur l&#8217;&#233;tat psychologique
du patient, etc.), les traitements (interventions, m&#233;dicaments donn&#233;s au patient, etc.) et les tests
(proc&#233;dures et examens). Entre ces trois types de concepts, 8 relations peuvent exister :
&#8211; un traitement am&#233;liore (TrIP), aggrave (TrWP) ou cause (TrCP) un probl&#232;me m&#233;dical ;
&#8211; un traitement est administr&#233; (TrAP) ou pas (TrNAP) pour un probl&#232;me m&#233;dical ;
&#8211; un test r&#233;v&#232;le 4 (TeRP) ou est conduit pour examiner (TeCP) un probl&#232;me m&#233;dical ;
&#8211; un probl&#232;me m&#233;dical indique un autre probl&#232;me m&#233;dical (PIP).
Le corpus de d&#233;veloppement (DEV_I2B2) est compos&#233; de 349 documents (4994 relations) et
le corpus d&#8217;&#233;valuation (EVAL_I2B2) de 477 documents (9070 relations). Nous avons divis&#233;
le corpus DEV_I2B2 en deux parties afin de pouvoir entra&#238;ner notre syst&#232;me avant d&#8217;avoir le
corpus d&#8217;&#233;valuation : un corpus d&#8217;entra&#238;nement (TRAIN_I2B2) compos&#233; de 295 documents (4515
relations) et un corpus de test (TEST_I2B2) compos&#233; de 54 documents (479 relations). Dans le
graphique 1, nous avons repr&#233;sent&#233; le nombre d&#8217;instances de relations de chaque type dans les
diff&#233;rents corpus.
</p>
<p>3.2 R&#233;sultats obtenus
</p>
<p>Les r&#233;sultats que nous avons obtenus avec ce syst&#232;me sont pr&#233;sent&#233;s dans la figure 2. Nous avons
&#233;galement repr&#233;sent&#233; sur le graphique l&#8217;accord inter annotateur (IAA) et le nombre d&#8217;exemples de
chaque relation (nombre normalis&#233; pour &#234;tre &#224; l&#8217;&#233;chelle du graphique). Globalement la F-mesure
est d&#8217;environ 0,7 pour la classification des relations, mais cette classification est moins bonne
</p>
<p>4. Cette relation correspond aux cas o&#249; le test indique la pr&#233;sence d&#8217;un probl&#232;me, ou bien l&#8217;absence d&#8217;un probl&#232;me.
Pour ces relations, la pr&#233;sence de n&#233;gations, tr&#232;s fr&#233;quentes en domaine m&#233;dical, ne sera donc pas prise en compte.
</p>
<p>4</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Feuille4
</p>
<p>Page 1
</p>
<p>143191198444
588
</p>
<p>1986
</p>
<p>2487
</p>
<p>3033
</p>
<p>Corpus d'&#233;valuation
</p>
<p>56106107296
303
</p>
<p>1239
</p>
<p>1423
</p>
<p>1734
</p>
<p>Corpus de d&#233;veloppement
</p>
<p>TrWP
TrNAP
TrIP
TrCP
TeCP
PIP
TrAP
TeRP
</p>
<p>FIGURE 1 &#8211; Composition des corpus
</p>
<p>pour les relations pour lesquelles peu d&#8217;exemples ont &#233;t&#233; annot&#233;s dans le corpus DEV_I2B2 (par
exemple pour la relation TrWP ou TrIP). Feuille2
</p>
<p>Page 1
</p>
<p>TrWP TrNAP TrIP TeCP TrCP PIP TrAP TeRP Toutes
0
</p>
<p>0,1
</p>
<p>0,2
</p>
<p>0,3
</p>
<p>0,4
</p>
<p>0,5
</p>
<p>0,6
</p>
<p>0,7
</p>
<p>0,8
</p>
<p>0,9
</p>
<p>1
</p>
<p>Rappel
Pr&#233;cision
F-mesure
log10(examples)/4
IAA
</p>
<p>FIGURE 2 &#8211; &#201;valuation du syst&#232;me final
</p>
<p>Les types d&#8217;erreurs que l&#8217;on peut relever proviennent du fait qu&#8217;il y a peu d&#8217;exemples pour certaines
relations, associ&#233; &#224; une grande variabilit&#233; des expressions, qu&#8217;il y a besoin de connaissances
externes, et que parfois la classification est discutable car les d&#233;finitions de certaines relations sont
assez proches (Minard et al., 2011b). Le pr&#233;sent travail concerne la r&#233;duction de la variabilit&#233;
syntaxique des expressions par simplification. Ainsi, la relation TeCP entre pulmonary nodules
et fu imaging dans la phrase de l&#8217;exemple 1 est mal class&#233;e par le syst&#232;me notamment &#224; cause
de la pr&#233;sence du verbe reveal qui indique g&#233;n&#233;ralement une relation TeRP. Dans ce type de
construction, il serait int&#233;ressant de supprimer la partie de la phrase concernant les premiers
tests et probl&#232;mes, pour ne conserver que la paire &#224; &#233;tudier.
</p>
<p>(1)
&#7;&#6; &#4;&#5;TEST CTS chest was negative for &#7;&#6; &#4;&#5;PB PE , however it did reveal
</p>
<p>5</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#7;&#6; &#4;&#5;PB pulmonary nodules in his RML which need &#7;&#6; &#4;&#5;TEST fu imaging in &lt;NUM&gt; months.
Dans l&#8217;exemple 2, les deux concepts &#224; annoter his high right-sided filling pressure et his Captopril
sont s&#233;par&#233;s par la proposition he was started on Lasix for diuresis qui n&#8217;est pas pertinente. Si
les &#233;l&#233;ments non pertinents pour cette relation &#233;taient supprim&#233;s, la phrase pourrait devenir
Given PROBLEM, TREATMENT was increased., forme qui est fr&#233;quente dans le corpus et permet de
reconna&#238;tre une relation TrAP. Une telle simplification de phrases permettrait bien de r&#233;duire la
variabilit&#233; du corpus pour am&#233;liorer la classification des relations.
</p>
<p>(2) Given
&#7;&#6; &#4;&#5;PB his high right-sided filling pressure , he was started on&#7;&#6; &#4;&#5;TREAT Lasix for &#7;&#6; &#4;&#5;TREAT diuresis and &#7;&#6; &#4;&#5;TREAT his Captopril was increased for&#7;&#6; &#4;&#5;TREAT greater afterload reduction .
</p>
<p>4 D&#233;finition du mod&#232;le de simplification
</p>
<p>4.1 Simplification
</p>
<p>Nous d&#233;finissons la simplification comme une extraction de l&#8217;information pertinente pour iden-
tifier des relations, qui consiste &#224; ne garder que ce qui est n&#233;cessaire &#224; l&#8217;identification de la
relation, et &#224; supprimer les informations qui ne sont pas en rapport avec la relation ou qui
peuvent perturber son identification.
</p>
<p>Pour cela, la plupart des travaux ont d&#233;fini des r&#232;gles de simplification. Les exemples montrent
que celles-ci sont tr&#232;s contextuelles et d&#233;pendantes de la t&#226;che, et reposent sur une &#233;tude de
corpus plut&#244;t que sur une connaissance a priori de la langue. Ainsi, des r&#232;gles usuellement
d&#233;finies pour la simplification comme la suppression de relatives ne s&#8217;appliquent pas dans notre
contexte. Une mod&#233;lisation sous forme de r&#232;gles n&#233;cessiterait d&#8217;en red&#233;finir un grand nombre,
ce qui nous a pouss&#233; &#224; privil&#233;gier une m&#233;thode &#224; base d&#8217;apprentissage pour annoter dans les
phrases les parties &#224; garder et celles que l&#8217;on peut supprimer.
</p>
<p>Quatre types d&#8217;annotation ont &#233;t&#233; d&#233;finis. L&#8217;annotation &#171;indispensable&#187; permet de caract&#233;riser les
mots qui portent l&#8217;expression de la relation. L&#8217;annotation &#171;utile&#187;, tr&#232;s proche de &#171;indispensable&#187;,
indique les mots qui renforcent la relation. Ensuite l&#8217;annotation &#171;inutile&#187; est associ&#233;e aux mots
n&#8217;apportant pas d&#8217;indices pour la classification de la relation, par exemple l&#8217;indication du service
dans lequel est le patient. L&#8217;annotation &#171;g&#234;nant&#187; sert &#224; rep&#233;rer les mots pouvant g&#234;ner la bonne
classification de la relation. Dans les exemples 3 et 4, les parties de phrase &#171;indispensables&#187; sont
soulign&#233;es, les parties &#171;inutiles&#187; sont normales, les parties &#171;g&#234;nantes&#187; sont barr&#233;es et les concepts
&#224; mettre en relation sont en gras. Dans l&#8217;exemple 3, il s&#8217;agit de d&#233;terminer la relation TeCP entre
a magnetic resonance imaging study et a small vascular malformation. Dans l&#8217;exemple 4, il s&#8217;agit
d&#8217;une relation TrAP entre the tremendous tumor burden et open debulking.
</p>
<p>(3)
&#7;&#6; &#4;&#5;TEST A magnetic resonance imaging study will be scheduled as an outpatient in
three months to rule out
</p>
<p>&#7;&#6; &#4;&#5;PBa small vascular malformation if responsible for&#7;&#6; &#4;&#5;PBthe hemorrhage .
</p>
<p>6</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(4) The neuro-oncologist felt that because of
&#7;&#6; &#4;&#5;PBthe tremendous tumor burden that
</p>
<p>was likely causing his symptoms the patient will require
&#7;&#6; &#4;&#5;TREATopen debulking as well
</p>
<p>as obtaining issue for a pathologic diagnosis.
</p>
<p>4.2 M&#233;thode
</p>
<p>Nous avons choisi d&#8217;utiliser un classifieur &#224; base de CRF (&#171;Champs Al&#233;atoires Conditionnels&#187;) pour
effectuer l&#8217;annotation des phrases. Les CRF sont des mod&#232;les statistiques qui ont la particularit&#233;
de mod&#233;liser des d&#233;pendances entre annotations. Les phrases annot&#233;es seront donn&#233;es en entr&#233;e
du classifieur SVM. Afin de n&#8217;annoter que quelques phrases, nous proposons une architecture o&#249;
la simplification est guid&#233;e par la t&#226;che d&#8217;extraction de relations, et le corpus d&#8217;apprentissage
de la simplification est augment&#233; it&#233;rativement en fonction des r&#233;sultats de la t&#226;che finale. La
combinaison des classifieurs est pr&#233;sent&#233;e dans la section 6. Cette m&#233;thode est donc facilement
adaptable &#224; un autre domaine, contrairement aux m&#233;thodes &#224; base de r&#232;gles, qui ne permettent
pas toujours une adaptation simple et rapide.
</p>
<p>5 Annotation par CRF
</p>
<p>5.1 Constitution du corpus d&#8217;apprentissage
</p>
<p>Nous avons s&#233;lectionn&#233; 71 phrases provenant du corpus TRAIN_I2B2. Nous avons extrait al&#233;atoi-
rement 14 phrases contenant des paires d&#8217;entit&#233;s qui avaient &#233;t&#233; correctement class&#233;es par notre
syst&#232;me d&#8217;extraction de relations, 37 paires mal class&#233;es et 20 paires qui ne sont pas en relation
mais qui avaient &#233;t&#233; class&#233;es comme &#233;tant en relation. Une &#233;tude de leurs caract&#233;ristiques a &#233;t&#233;
men&#233;e pr&#233;alablement &#224; l&#8217;annotation.
</p>
<p>Cette &#233;tude a montr&#233; que dans 14 phrases du corpus, la relation est exprim&#233;e par un verbe et les
deux concepts en relation sont respectivement sujet et compl&#233;ment de ce verbe (exemple 5).
</p>
<p>(5)
&#7;&#6; &#4;&#5;TESTAn magnetic resonance imaging study showed&#7;&#6; &#4;&#5;PBbasilar artery disease , questio-
nable aneurysm.
</p>
<p>Dans 14 phrases, les deux concepts en relation sont dans deux propositions diff&#233;rentes (exemple
6). Sept constructions diff&#233;rentes ont &#233;t&#233; trouv&#233;es ; nous en pr&#233;sentons trois dans le tableau 1.
</p>
<p>(6) Finger tapping and
&#7;&#6; &#4;&#5;TESTrapid alternating movements were slow on the left and she had&#7;&#6; &#4;&#5;PBtrouble isolating individual finger movements .
</p>
<p>Dans 18 phrases, les deux concepts sont reli&#233;s par une pr&#233;position, et la relation s&#8217;exprime au
travers de la pr&#233;position et du verbe de la proposition (exemple 7).
</p>
<p>(7) [...], she had
&#7;&#6; &#4;&#5;PBan acute drop in &#7;&#6; &#4;&#5;TESTher systolic blood pressure to &lt;NUM&gt; for un-
</p>
<p>clear reasons and without evidence of acute_sepsis.
</p>
<p>7</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Prop Conj | Prop Princ Although TREAT were adjusted he continued to
be PB and there was [...]
</p>
<p>Prop Indep | CC | Prop Indep TEST became PB and TREAT was held.
Prop Princ | Prop Rel | CC | Prop Indep He subsequently became PB and PB in the Cathe-
</p>
<p>terization Laboratory which responded to TREAT,
TREAT, TREAT, and he was then transferred to
the CCU for TEST.
</p>
<p>TABLE 1 &#8211; Phrases dans lesquelles les concepts en relation sont dans deux propositions diff&#233;rentes
</p>
<p>Dans les exemples de non-relation que nous avons dans notre corpus, dans seulement deux
phrases les deux concepts sont sujet et objet du m&#234;me verbe. Dans 8 phrases, les deux concepts
sont dans des propositions diff&#233;rentes et dans 9 phrases ils sont reli&#233;s par une pr&#233;position.
</p>
<p>Cette &#233;tude fait appara&#238;tre l&#8217;existence de r&#233;gularit&#233;s, que la simplification pourrait d&#233;gager.
</p>
<p>Les 71 phrases ont &#233;t&#233; annot&#233;es par 3 annotateurs gr&#226;ce au logiciel Knowtator de Prot&#233;g&#233; 5. Les
diff&#233;rences ont donn&#233; lieu &#224; discussion et accord.
</p>
<p>Une phrase pouvant contenir plus d&#8217;une paire d&#8217;entit&#233;s, nous les avons annot&#233;es pour une paire
d&#8217;entit&#233;s d&#233;finie ; de ce fait certaines phrases sont en double dans le corpus, mais &#224; chaque fois
pour une paire d&#8217;entit&#233;s diff&#233;rente.
</p>
<p>Dans le tableau 2, nous donnons pour chaque classe de simplification le nombre de mots associ&#233;s
&#224; cette classe dans le corpus TRAIN_SIMP (le corpus annot&#233; obtenu). On remarque que tr&#232;s
peu de mots sont annot&#233;s &#171;utile&#187;, la raison &#233;tant la difficult&#233; de distinction entre les classes
&#171;indispensable&#187; et &#171;utile&#187;. Ces deux classes seront donc regroup&#233;es ult&#233;rieurement.
</p>
<p>&#233;tiquette nombre de mots
indispensable 287
utile 52
inutile 608
g&#234;nant 177
</p>
<p>TABLE 2 &#8211; &#201;tude du corpus annot&#233;
</p>
<p>5.2 Application du CRF
</p>
<p>Nous avons utilis&#233; le classifieur CRF++ (Kado, 2003) pour apprendre &#224; annoter les simplifi-
cations : &#224; chaque mot il attribue une &#233;tiquette en fonction de la valeur des attributs pour ce
mot.
</p>
<p>Les attributs fournis au classifieur sont : le lemme, la cat&#233;gorie morpho-syntaxique, le nombre de
caract&#232;res du token, la position du token dans la phrase (position du token/nombre de tokens
dans la phrase), le type s&#233;mantique si le token fait partie d&#8217;une entit&#233; et une &#233;tiquette indiquant
si le token fait partie d&#8217;une des entit&#233;s de la paire &#233;tudi&#233;e. Ce dernier attribut permet d&#8217;avoir une
</p>
<p>5. http ://knowtator.sourceforge.net/
</p>
<p>8</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>annotation d&#233;pendante d&#8217;un couple particulier de concepts. Les d&#233;pendances s&#233;quentielles sont
calcul&#233;es, pour chaque type d&#8217;attributs, avec un contexte de trois mots avant et trois mots apr&#232;s
le token courant.
</p>
<p>Nous n&#8217;avons pas de corpus annot&#233; pour &#233;valuer la simplification. Pour v&#233;rifier que l&#8217;annotation
de la simplification avec CRF++ &#233;tait coh&#233;rente, nous avons &#233;tudi&#233; les mots class&#233;s dans chacune
des trois cat&#233;gories. Pour chaque lemme, nous avons compt&#233; combien de fois il apparaissait
dans le corpus TRAIN_I2B2 et combien de fois il &#233;tait associ&#233; &#224; une des trois cat&#233;gories. Le
tableau 3 contient les lemmes les plus fr&#233;quents dans chaque cat&#233;gorie et qui apparaissent
au moins 10 fois dans cette cat&#233;gorie. Nous observons que les lemmes les plus fr&#233;quemment
&#233;tiquet&#233;s &#171;g&#234;nant&#187; font partie de concepts ; par exemple on retrouve fluticasone dans le traitement
fluticasone propionate ou fluticasone-salmeterol. Les lemmes les plus souvent &#233;tiquet&#233;s &#171;utile&#187; sont
principalement des verbes, et ceux &#233;tiquet&#233;s &#171;inutile&#187; sont des unit&#233;s (reli&#233;es &#224; des dosages), des
informations sur le patient (son nom, son &#226;ge), etc. Nous avons conclu de cette &#233;tude que le
classifieur se comporte de mani&#232;re coh&#233;rente pour annoter la simplification.
</p>
<p>UTILE INUTILE GENANT
attribute 50 / 56 ml 582 / 582 neutropenia 10 / 10
presence 12 / 17 before 260 / 260 ph 19 / 21
questionable 16 / 23 yo (year-old) 219 / 219 thromboplastin 23 / 27
vs 21 / 31 microgram 211 / 211 fluticasone 11 / 13
identify 27 / 40 caution 201 / 201 diskus 11 / 13
demonstrate 130 / 194 mr. 184 / 184 migraine 52 / 62
inaccurate 12 / 18 ask 177 / 177 spiriva 22 / 27
due 314 / 488 asacol 172 / 172 panic 42 / 52
</p>
<p>TABLE 3 &#8211; Exemple d&#8217;annotation de lemmes pr&#233;sents plus de 10 fois dans le corpus
</p>
<p>6 Combinaison de classifieurs pour l&#8217;extraction des relations
</p>
<p>Avec seulement 71 phrases annot&#233;es, la simplification obtenue ne permet pas d&#8217;am&#233;liorer l&#8217;ex-
traction des relations. Pour augmenter le corpus TRAIN_SIMP et am&#233;liorer la simplification,
nous avons combin&#233; les deux classifieurs, et utilis&#233; les r&#233;sultats de la classification des relations
pour augmenter le corpus TRAIN_SIMP. La figure 3 pr&#233;sente de fa&#231;on simplifi&#233;e la m&#233;thode
d&#233;velopp&#233;e.
</p>
<p>Annotation de la simplification Dans un premier temps, les 71 phrases annot&#233;es manuelle-
ment sont utilis&#233;es comme amorce pour la simplification ; elles forment le corpus d&#8217;entra&#238;nement
TRAIN_SIMP. Elles sont utilis&#233;es pour apprendre les simplifications gr&#226;ce &#224; l&#8217;outil CRF++. Ensuite
le mod&#232;le pour la simplification est appliqu&#233; sur la totalit&#233; du corpus DEV_I2B2.
</p>
<p>Extraction des relations Nous utilisons ensuite ce corpus annot&#233; pour extraire les relations
gr&#226;ce &#224; notre classifieur &#224; base de SVM. Les annotations des simplifications sont utilis&#233;es comme
</p>
<p>9</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 3 &#8211; Sch&#233;ma explicatif de la m&#233;thode
</p>
<p>des attributs suppl&#233;mentaires pour la reconnaissance des relations. Un attribut identifie les tokens
annot&#233;s comme &#171;inutile&#187;, un autre pour les tokens &#171;g&#234;nants&#187; et un pour les &#171;utiles&#187;.
</p>
<p>Le corpus DEV_I2B2 a &#233;t&#233; divis&#233; en deux : corpus TRAIN_I2B2 et corpus TEST_I2B2. Dans un
premier temps, nous effectuons l&#8217;extraction des relations par validation crois&#233;e en 5 parties avec
le corpus TRAIN_I2B2. &#192; chaque it&#233;ration, les phrases contenant des relations correctement
extraites (les vrais positifs et les vrais n&#233;gatifs) et leurs annotations pour la simplification sont
ajout&#233;es au corpus TRAIN_SIMP.
</p>
<p>Validation de la simplification Une fois la validation crois&#233;e termin&#233;e sur le corpus
TRAIN_I2B2, le corpus DEV_I2B2 est r&#233;annot&#233; pour la simplification &#224; l&#8217;aide du classifieur
&#224; base de CRF et du corpus TRAIN_SIMP augment&#233;. Ensuite le mod&#232;le pour l&#8217;extraction des
relations est construit &#224; partir du corpus TRAIN_I2B2 et il est appliqu&#233; sur le corpus TEST_I2B2.
Cette &#233;tape permet d&#8217;&#233;valuer l&#8217;impact de la compl&#233;tion du corpus TRAIN_SIMP sur l&#8217;extraction
des relations.
</p>
<p>7 &#201;valuations
</p>
<p>Afin d&#8217;&#233;valuer les r&#233;sultats de la simplification, nous avons d&#233;fini plusieurs protocoles qui
permettent de :
&#8211; mesurer l&#8217;impact de la simplification sur le processus de classification ;
&#8211; noter le r&#233;sultat de la simplification ;
&#8211; analyser de mani&#232;re qualitative les annotations effectu&#233;es par le module de simplication.
</p>
<p>10</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>7.1 Mesure de l&#8217;impact de la simplification sur la t&#226;che d&#8217;extraction de
relations
</p>
<p>Pour &#233;valuer l&#8217;impact de la simplification sur la classification des relations, nous avons men&#233;
plusieurs exp&#233;rimentations en faisant varier un grand nombre de param&#232;tres. Dans un premier
temps, nous pouvons faire varier les attributs utilis&#233;s par les CRF pour apprendre la simplification :
nous pouvons par exemple ajouter la structure syntaxique de la phrase. Nous pouvons &#233;galement
n&#8217;utiliser que deux classes pour la simplification, c&#8217;est-&#224;-dire ne pas faire de distinction entre
les mots inutiles et g&#234;nants, et utiles et indispensables. Deuxi&#232;mement, les informations sur
la simplification peuvent &#234;tre prises en compte de 2 mani&#232;res par le syst&#232;me d&#8217;extraction de
relation : les mots g&#234;nants (voire g&#234;nants et inutiles) peuvent &#234;tre supprim&#233;s de la phrase ou des
attributs indiquant la classe du mot peuvent &#234;tre ajout&#233;s. Finalement, nous pouvons faire varier
la s&#233;lection des paires d&#8217;entit&#233;s correctement class&#233;es &#224; ajouter au corpus TRAIN_SIMP. Toutes
les paires correctement class&#233;es (que les entit&#233;s soient en relation ou non) peuvent &#234;tre ajout&#233;es,
ou seules les paires qui n&#8217;&#233;taient pas bien class&#233;es avec le syst&#232;me sans simplification et qui le
sont avec la simplification, ou selon le score de d&#233;cision donn&#233; par le classifieur, etc.
</p>
<p>Nous pr&#233;sentons ici la configuration donnant les meilleurs r&#233;sultats. Nous avons appris la
simplification en ne donnant que les attributs de base (voir 5.2) et en apprenant 3 classes (&#171;utile&#187;
et &#171;indispensable&#187; sont regroup&#233;es en une classe, &#171;inutile&#187; et &#171;g&#234;nant&#187;). Pour prendre en compte
la simplification, nous avons donn&#233; des attributs suppl&#233;mentaires au classifieur. Comme il est
difficile d&#8217;annoter des phrases pour des paires d&#8217;entit&#233;s qui ne sont pas en relation, nous avons
modifi&#233; le corpus annot&#233; manuellement et nous avons annot&#233; en &#171;inutile&#187; tous les mots de la
phrase. Ensuite, apr&#232;s avoir class&#233; les relations par validation crois&#233;e sur le corpus TRAIN_I2B2,
nous avons ajout&#233; dans le corpus pour la simplification TRAIN_SIMP les phrases contenant des
relations correctement class&#233;es et dont au moins un des mots avait &#233;t&#233; annot&#233; &#171;utile&#187;, et les
phrases contenant des paires qui ne sont pas en relation et qui ont &#233;t&#233; correctement class&#233;es
uniquement avec la simplification (elles &#233;taient mal class&#233;es par le syst&#232;me n&#8217;utilisant pas la
simplification). Nous avons ex&#233;cut&#233; 4 fois le syst&#232;me complet, apr&#232;s quoi nous avons obtenu 589
phrases dans le corpus TRAIN_SIMP, dont 71 qui ont &#233;t&#233; annot&#233;es manuellement. Nous avons
appliqu&#233; la simplification sur le corpus d&#8217;&#233;valuation EVAL_I2B2 afin d&#8217;&#233;valuer la classification des
relations. Dans le tableau 4, nous donnons les F-mesures obtenues sans simplification, avec la
simplification apprise avec les 71 phrases annot&#233;es (avant la combinaison des deux m&#233;thodes) et
avec le corpus TRAIN_SIMP obtenu apr&#232;s 4 it&#233;rations.
</p>
<p>La F-mesure calcul&#233;e pour toutes les relations reste stable avec ou sans la simplification m&#234;me si
la F-mesure pour 4 des relations diminue quand nous utilisons la simplification. La diff&#233;rence
entre les r&#233;sultats avec et sans simplification calcul&#233;e avec le test T de Student est significative
(p&lt;=0,05), la simplification a donc un effet sur la classification mais ne permet pas encore de
l&#8217;am&#233;liorer.
</p>
<p>7.2 &#201;valuation manuelle de la simplification
</p>
<p>Nous n&#8217;avons pas de corpus annot&#233; suffisament grand pour pouvoir faire une &#233;valuation auto-
matique de la t&#226;che de simplification. De ce fait, nous avons choisi d&#8217;annoter manuellement 41
relations et d&#8217;&#233;valuer manuellement la simplification pour ces relations. Nous n&#8217;avons &#233;tudi&#233; que
l&#8217;annotation des phrases portant sur une paire de concepts en relation. En effet, ainsi que nous
</p>
<p>11</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Relations Sans Simplification Simplification
Corpus TRAIN_SIMP Corpus TRAIN_SIMP
non augment&#233; augment&#233;
</p>
<p>TrIP 0,315 0,266 0,302
TrWP 0,000 0,000 0,000
TrCP 0,486 0,464 0,470
TrAP 0,732 0,724 0,730
TrNAP 0,195 0,151 0,168
PIP 0,625 0,627 0,630
TeRP 0,852 0,852 0,855
TeCP 0,452 0,398 0,408
Toutes les relations 0,709 0,704 0,708
</p>
<p>TABLE 4 &#8211; &#201;valuation de la classification des relations avec et sans simplification sur le corpus
EVAL_I2B2
</p>
<p>l&#8217;avons d&#233;j&#224; mentionn&#233;, il est difficile de d&#233;finir ce qui doit &#234;tre annot&#233; pour les non relations.
</p>
<p>Nous avons donc annot&#233; 41 relations du corpus de test et avons comptabilis&#233; le nombre de
relations correctement simplifi&#233;es, simplifi&#233;es &#224; tort ou partiellement simplifi&#233;es &#224; raison. Peu
d&#8217;informations sont annot&#233;es comme g&#234;nantes. Aussi, lors de l&#8217;&#233;valuation, nous consid&#233;rons que
des informations annot&#233;es indispensables sont des informations &#224; garder et que les autres sont
des informations &#224; supprimer. Nous avons consid&#233;r&#233; exacts les cas o&#249; le module garde toutes les
informations pertinentes, m&#234;me s&#8217;il garde aussi quelques informations que nous jugeons inutiles.
Nous avons consid&#233;r&#233; comme faux les simplifications qui suppriment des informations que nous
jugeons indispensables, et partiellement corrects les cas o&#249; le module aurait d&#251; garder plus
d&#8217;informations utiles, mais a gard&#233; quand m&#234;me les informations indispensables, ou lorsque trop
d&#8217;informations qu&#8217;il aurait d&#251; consid&#233;rer comme inutiles sont gard&#233;es. Avec cette r&#233;partition en
trois classes, nous obtenons 19 cas exacts, 16 cas faux et 6 cas partiellement corrects.
</p>
<p>Dans l&#8217;exemple 8, nous consid&#233;rons que la simplification est correcte mais dans l&#8217;exemple 9 le
verbe le plus utile &#224; la d&#233;tection de la relation (revealed) est annot&#233; inutile, et l&#8217;annotation de la
simplification est donc fausse.
</p>
<p>(8) He had
&#7;&#6; &#4;&#5;TESTa cardiac catheterization performed which revealed&#7;&#6; &#4;&#5;PBa three vessel coronary artery disease with &#7;&#6; &#4;&#5;PBan occluded RCA ,&#7;&#6; &#4;&#5;PB70%-80% proximal LAD , and &#7;&#6; &#4;&#5;PBa high grade left circumflex lesion after the OM
</p>
<p>with
&#7;&#6; &#4;&#5;PBdistal left circumflex occlusion .
</p>
<p>(9) He had
&#7;&#6; &#4;&#5;TESTa cardiac catheterization performed which revealed&#7;&#6; &#4;&#5;PBa three vessel coronary artery disease with &#7;&#6; &#4;&#5;PBan occluded RCA ,&#7;&#6; &#4;&#5;PB70%-80% proximal LAD , and &#7;&#6; &#4;&#5;PBa high grade left circumflex lesion after the OM
</p>
<p>with
&#7;&#6; &#4;&#5;PBdistal left circumflex occlusion .
</p>
<p>12</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>7.3 Analyse des simplifications
</p>
<p>Nous avons tent&#233; d&#8217;&#233;tablir les types de simplifications apprises. Les diff&#233;rentes structures de
phrases qui apparaissent sont :
&#8211; concept1 relation concept2 pour lesquelles la partie situ&#233;e entre les concepts doit &#234;tre conserv&#233;e,
</p>
<p>tout ou en partie ; cette structure est g&#233;n&#233;ralement bien trait&#233;e ;
&#8211; concept1 relation (coordination de concepts) concept2 est g&#233;n&#233;ralement mal annot&#233;e, et la
</p>
<p>marque de la relation est souvent supprim&#233;e. Ce type de structure peut &#234;tre reconnu simplement
par des r&#232;gles ;
</p>
<p>&#8211; concept1 (structure comportant des concepts) relation concept2 est g&#233;n&#233;ralement reconnue et la
relation est gard&#233;e.
</p>
<p>Certains cas n&#233;cessitent de garder la partie gauche du premier concept ; cette configuration est
mal reconnue. Il en est de m&#234;me pour les contextes droits du deuxi&#232;me concept. Ces deux types
de structure sont plus rares, et leur traitement n&#233;cessite plus d&#8217;exemples.
</p>
<p>Cette &#233;tude nous am&#232;ne &#224; imaginer des am&#233;liorations de notre syst&#232;me. Il serait par exemple
int&#233;ressant de pouvoir mieux s&#233;lectionner les phrases ajout&#233;es au corpus TRAIN_SIMP pour
diversifier les exemples de simplification. Une solution serait d&#8217;identifier les paires d&#8217;entit&#233;s moins
bien class&#233;es avec l&#8217;utilisation de la simplification que sans, et de les annoter pour apprendre
de nouveaux sch&#233;mas de simplification. Nous pourions &#233;galement envisager d&#8217;utiliser quelques
r&#232;gles pour annoter les cas les plus courants (par exemple pour supprimer les concepts en
coordination ou encore les indications de lieux), puis d&#8217;utiliser le syst&#232;me &#224; base d&#8217;apprentissage.
</p>
<p>8 Conclusion
</p>
<p>Dans cet article, nous nous sommes int&#233;ress&#233;es &#224; la simplification de phrases dans le but
d&#8217;am&#233;liorer l&#8217;extraction de relations. Nous avons pr&#233;sent&#233; une m&#233;thode de simplification guid&#233;e
par la t&#226;che d&#8217;extraction de relations, et n&#233;cessitant un petit corpus annot&#233;. Les r&#233;sultats que nous
obtenons sur la t&#226;che finale, &#224; savoir l&#8217;extraction de relations, sont significativement diff&#233;rents
des r&#233;sultats de la classification sans simplification, mais la F-mesure finale reste stable. La
poursuite de l&#8217;&#233;tude pourrait porter sur l&#8217;am&#233;lioration de la s&#233;lection des phrases ajout&#233;es au
corpus d&#8217;apprentissage pour la simplification, par exemple en ne gardant que celles dont le score
de confiance du classifieur est &#233;lev&#233;. Nous devons &#233;galement &#233;tudier la fa&#231;on dont nous traitons
les cas de non-relation ; devons-nous ajouter des exemples au corpus d&#8217;apprentissage ou non, si
oui, comment les annoter, etc. Pour finir, un pr&#233;traitement &#224; base de r&#232;gles sur les phrases du
corpus pourrait permettre d&#8217;annoter les indications temporelles, de lieux (par exemple le nom
d&#8217;une clinique), l&#8217;&#226;ge des patients, etc. et ainsi r&#233;duire d&#8217;avantage la variabilit&#233;.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BUYKO, E., FAESSLER, E., WERMTER, J. et HAHN, U. (2011). Syntactic simplification and semantic
enrichment&#8212;trimming dependency graphs for event extraction. 27:610&#8211;644.
</p>
<p>CHANG, C.-C. et LIN, C.-J. (2001). LIBSVM : a library for support vector machines. Software
available at http ://www.csie.ntu.edu.tw/ cjlin/libsvm.
</p>
<p>13</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HEILMAN, M. et SMITH, N. A. (2010). Extracting Simplified Statements for Factual Question
Generation. In Proceedings of the 3rd Workshop on Question Generation.
JONNALAGADDA, S. et GONZALEZ, G. (2010). Sentence simplification aids protein-protein interac-
tion extraction. CoRR, abs/1001.4273.
KADO, T. (2003). CRF++ : Yet another crf toolkit. http://crfpp.sourceforge.net/.
[consult&#233; le 17/01/2012].
KNIGHT, K. et MARCU, D. (2000). Statistics-based summarization-step one : Sentence compres-
sion. In Proceedings of the National Conference on Artificial Intelligence, pages 703&#8211;710. Menlo
Park, CA ; Cambridge, MA ; London ; AAAI Press ; MIT Press ; 1999.
</p>
<p>MINARD, A.-L., LIGOZAT, A.-L. et GRAU, B. (2011a). Apport de la syntaxe pour l&#8217;extraction de
relations en domaine m&#233;dical. In Actes TALN 2011, pages 383&#8211;393.
MINARD, A.-L., LIGOZAT, A.-L. et GRAU, B. (2011b). Extraction de relations dans des comptes
rendus hospitaliers. In Actes des 22&#232;mes Journ&#233;es francophones d&#8217;Ing&#233;nierie des Connaissances
(IC&#8217;2011).
MINARD, A.-L., LIGOZAT, A.-L., GRAU, B. et MAKOUR, L. (2011c). Feature selection for drug-
drug interaction detection using machine-learning based approaches. In SEPLN&#8217;11, Workshop
Drug-Drug Interaction.
MIWA, M., S, R., MIYAO, Y. et TSUJII, J. (2010). Entity-focused sentence simplification for relation
extraction. In Proceedings of the 23rd International Conference on Computational Linguistics,
COLING &#8217;10, pages 788&#8211;796, Stroudsburg, PA, USA. Association for Computational Linguistics.
</p>
<p>ROBERTS, A., GAIZAUSKAS, R. et HEPPLE, M. (2008). Extracting clinical relationships from patient
narratives. In BioNLP2008 : Current Trends in Biomedical Natural Language Processing, pages
10&#8211;18.
</p>
<p>THOMAS, P., PIETSCHMANN, S., SOLT, I., TIKK, D. et LESER, U. (2011). Not all links are equal :
Exploiting dependency types for the extraction of protein-protein interactions from text. In
Proceedings of BioNLP 2011 Workshop, pages 1&#8211;9, Portland, Oregen, USA. Association for
Computational Linguistics.
</p>
<p>UZUNER, O., MAILOA, J., RYAN, R. et SIBANDA, T. (2010). Semantic relations for problem-oriented
medical records. Artificial Intelligence in Medicine, 50:63&#8211;73.
VICKREY, D. et KOLLER, D. (2008). Sentence Simplification for Semantic Role Labeling. In
Proceedings of ACL-08 : HLT, pages 344&#8211;352, Columbus, Ohio. Association for Computational
Linguistics.
</p>
<p>WASZAK, T. et TORRES-MORENO, J. (2008). Compression entropique de phrases contr&#244;l&#233;e par un
perceptron. Journ&#233;es internationales d&#8217;Analyse statistique des Donn&#233;es Textuelles.
WOODSEND, K. et LAPATA, M. (2011). Learning to Simplify Sentences with Quasi-Synchronous
Grammar and Integer Programming. In Proceedings of the 2011 Conference on Empirical Methods
in Natural Language Processing, pages 409&#8211;420, Edinburgh, Scotland, UK. Association for
Computational Linguistics.
</p>
<p>YOUSFI-MONOD, M. et PRINCE, V. (2006). Compression de phrases par &#233;lagage de leur arbre
morpho-syntaxique. Une premi&#232;re application sur les phrases narratives. TSI : Revue Technique
et Science Informatiques, 25(4):437&#8211;468.
ZHANG, M., ZHANG, J. et SU, J. (2006). Exploring syntactic features for relation extraction using
a convolution tree kernel. In Proceedings of the Human Language Technology Conference of the
North American Chapter of the ACL, pages 288&#8211;295.
</p>
<p>14</p>

</div></div>
</body></html>