<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Enrichissement du FTB : un treebank hybride constituants/propri&#233;t&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 307&#8211;320,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Enrichissement du FTB : un treebank hybride
constituants/propri&#233;t&#233;s
</p>
<p>Philippe Blache &amp; St&#233;phane Rauzy
LPL, 5 Avenue Pasteur, 13100 Aix-en-Provence
{blache;rauzy}@lpl-aix.fr
</p>
<p>R&#201;SUM&#201;
Cet article pr&#233;sente les m&#233;canismes de cr&#233;ation d&#8217;un treebank hybride enrichissant le FTB &#224;
l&#8217;aide d&#8217;annotations dans le formalisme des Grammaires de Propri&#233;t&#233;s. Ce processus consiste &#224;
acqu&#233;rir une grammaire GP &#224; partir du treebank source et g&#233;n&#233;rer automatiquement les structures
syntaxiques dans le formalisme cible en s&#8217;appuyant sur la sp&#233;cification d&#8217;un sch&#233;ma d&#8217;encodage
adapt&#233;. Le r&#233;sultat produit, en partant d&#8217;une version du FTB corrig&#233;e et modifi&#233;e en fonction de
nos besoins, constitue une ressource ouvrant de nouvelles perspectives pour le traitement et la
description du fran&#231;ais.
</p>
<p>ABSTRACT
Enriching the French Treebank with Properties
</p>
<p>We present in this paper the hybridation of the French Treebank with Property Grammars
annotations. This process consists in acquiring a PG grammar from the source treebank and
generating the new syntactic encoding on top of the original one. The result is a new resource
for French, opening the way to new tools and descriptions.
</p>
<p>MOTS-CL&#201;S : Treebank hybride, French Treebank, Grammaires de Propri&#233;t&#233;s.
</p>
<p>KEYWORDS: Hybrid treebank, French Treebank, Property Grammars.
</p>
<p>1 Introduction
</p>
<p>La constitution d&#8217;un treebank pour le fran&#231;ais reste une priorit&#233; pour la description de notre
langue. Il n&#8217;existe &#224; ce jour quasiment qu&#8217;une seule ressource de ce type : le French Treebank
(Abeill&#233; et al., 2003) &#224; partir duquel quelques travaux ont &#233;t&#233; propos&#233;s (voir par exemple
(Candito et al., 2010), (Pynte et al., 2001)). D&#8217;autres projets sont actuellement en cours dans
diff&#233;rents laboratoires (voir (Cerisara et al., 2010)), mais aucun ne propose &#224; ce jour de v&#233;ritable
distribution. L&#8217;enrichissement du FTB est donc n&#233;cessaire pour disposer d&#8217;une ressource aussi
compl&#232;te que possible &#224; partir de laquelle diff&#233;rents outils peuvent &#234;tre d&#233;velopp&#233;s. Parmi ces
enrichissements, la constitution d&#8217;un treebank hybride comportant des analyses dans diff&#233;rents
formalismes (voir par exemple (Candito et al., 2010)) s&#8217;av&#232;re extr&#234;mement utile non seulement
d&#8217;un point de vue th&#233;orique (comparaison entre les diff&#233;rentes analyses), mais &#233;galement
pratique (notamment en termes d&#8217;apprentissage et d&#8217;&#233;valuation). Par ailleurs, l&#8217;hybridation
d&#8217;un treebank constitue un proc&#233;d&#233; &#233;conomique pour la constitution d&#8217;une nouvelle ressource
dans le formalisme cible : le fait de disposer d&#8217;une structure syntaxique (&#233;labor&#233;e et v&#233;rifi&#233;e
</p>
<p>307</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>manuellement dans le cas du FTB) permet de g&#233;n&#233;rer automatiquement et de fa&#231;on tr&#232;s contr&#244;l&#233;e
les structures dans le formalisme cible, h&#233;ritant au passage des qualit&#233;s du treebank d&#8217;origine.
</p>
<p>Nous d&#233;crivons dans cet article l&#8217;enrichissement du FTB permettant la construction d&#8217;un treebank
hybride Grammaire Syntagmatique / Grammaire de Propri&#233;t&#233;s . Dans une premi&#232;re partie, sans
revenir sur une pr&#233;sentation du FTB disponible ailleurs, nous d&#233;crirons les corrections que nous
avons effectu&#233;es (essentiellement des erreurs d&#8217;&#233;tiquetage) ainsi que les modifications apport&#233;es
au format d&#8217;origine de fa&#231;on &#224; faciliter l&#8217;hybridation. Dans une seconde partie, nous proposons un
sch&#233;ma abstrait d&#8217;annotation pour les Grammaires de Propri&#233;t&#233;s (Blache, 2001) et son encodage
en XML. La troisi&#232;me partie sera consacr&#233;e &#224; la pr&#233;sentation du proc&#233;d&#233; d&#8217;acquisition &#224; partir
du FTB de la grammaire dans le formalisme des Grammaires de Propri&#233;t&#233;s avant de d&#233;crire
sa mise en oeuvre pour l&#8217;enrichissement du treebank. La derni&#232;re partie sera consacr&#233;e &#224; une
pr&#233;sentation et une discussion des r&#233;sultats.
</p>
<p>2 Le treebank FTBLPL
</p>
<p>Nous avons pour cette &#233;tude travaill&#233; sur un sous-ensemble du FTB, que nous noterons d&#233;sormais
FTBLPL(pour LPL French Treebank). Il a &#233;t&#233; constitu&#233; &#224; partir du corpus MFT (Modified French
Treebank, voir (Schluter et van Genabith, 2007)), lui-m&#234;me sous-ensemble du corpus FTB.
</p>
<p>Nous avons choisi d&#8217;apporter quelques modifications au format d&#8217;origine du FTB de fa&#231;on &#224;
assurer une meilleure homog&#233;n&#233;it&#233; avec les ressources existantes dans d&#8217;autres langues ou pour
d&#8217;autres domaines (par exemple description de la multimodalit&#233;, &#233;tudes psycholinguistique, etc.).
Ces modifications portent d&#8217;une part sur le niveau morphosyntaxique, pour lequel nous avons
adopt&#233; le jeu de traits Multext (Ide et V&#233;ronis, 1994).
</p>
<p>Dans un premier temps, l&#8217;&#233;tiqueteur du LPL (un &#233;tiqueteur stochastique bas&#233; sur le mod&#232;le des
patrons (Blache et Rauzy, 2008; Rauzy et Blache, 2009) qui dans sa version actuelle atteint
un score de F-Mesure de 0.975) a &#233;t&#233; appliqu&#233; &#224; l&#8217;ensemble du corpus. Une fouille d&#8217;erreurs a
ensuite &#233;t&#233; effectu&#233;e par correction ou validation manuelles des passages pour lesquels notre
&#233;tiquetage pr&#233;sentait une diff&#233;rence avec celui propos&#233; dans le MFT. D&#8217;autre part nous avons
op&#233;r&#233; une r&#233;gularisation des positions des marqueurs de ponctuation, en d&#233;pla&#231;ant ces marqueurs
&#224; l&#8217;ext&#233;rieur des syntagmes composant l&#8217;arbre.
</p>
<p>Sur le plan syntaxique, nous avons syst&#233;matis&#233; certaines repr&#233;sentations (par exemple la projec-
tion des t&#234;tes) ou encore introduit de nouvelles cat&#233;gories (plus conformes aux ressources exis-
tantes). Ces choix ne remettent pas en question la structure syntaxique d&#8217;origine, ils concernent
essentiellement la forme.
</p>
<p>Ces modifications ont &#233;t&#233; appliqu&#233;es sur les 4.741 phrases du MFT (soit 134.445 mots). La
moiti&#233; d&#8217;entre elles ont ensuite &#233;t&#233; valid&#233;es manuellement. Environ 30% des phrases de ce
sous-&#233;chantillon ont &#233;t&#233; temporairement rejet&#233;es faute d&#8217;un consensus clair dans la description
de leur structure syntaxique ou si l&#8217;arbre propos&#233; pr&#233;sentait des erreurs de cat&#233;gorisation ou
de rattachement. Le sous-ensemble du FTBLPLutilis&#233; dans cette &#233;tude compte finalement 1.471
phrases valid&#233;es manuellement (soit environ 26.000 mots). La validation de la totalit&#233; du MFT
est en cours.
</p>
<p>A titre d&#8217;information, le sch&#233;ma de la figure 1 r&#233;capitule le nombre d&#8217;occurrences des cat&#233;gories
</p>
<p>308</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cat&#233;gories Modifications dans le FTBLPL
AP, PP, AdP - Projection des t&#234;tes unaires
</p>
<p>NP - Projection des clitiques
- Le N &#233;pith&#232;te fait partie du NP (&quot;une tarte maison&quot;)
- Plusieurs AP possibles dans le NP (&quot;un tr&#232;s bon premier ministre&quot;)
</p>
<p>Srel - ProRel est directement rattach&#233; &#224; Srel (pas au NP ou PP de la relative)
VN - Tous les participes se projettent en VN (sauf les participes pass&#233;s
</p>
<p>des temps compos&#233;s)
Coord : - Projection d&#8217;un noeud COORD indiquant le type et la fonction des conjoints
</p>
<p>VP - Projection syst&#233;matique, avec pour t&#234;te VN, incluant compl&#233;ments et adjoints
</p>
<p>FIGURE 1 &#8211; R&#233;partition des cat&#233;gories dans le corpus
</p>
<p>r&#233;alis&#233;es dans le FTBLPL, indiquant une fr&#233;quence nettement sup&#233;rieure du N P et dans une
moindre mesure du PP par rapport aux autres cat&#233;gories.
</p>
<p>3 Un sch&#233;ma d&#8217;annotation pour les Grammaires de Propri&#233;t&#233;s
</p>
<p>L&#8217;hybridation du FTB consiste &#224; ajouter aux donn&#233;es d&#8217;origine les annotations syntaxiques issues
de l&#8217;analyse en Grammaires de Propri&#233;t&#233;s (voir (Blache, 2001)). Il s&#8217;agit d&#8217;une approche reposant
sur la notion de construction (&#224; la mani&#232;re des Grammaires de Construction (voir (Kay et Fillmore,
1999))), dans laquelle les unit&#233;s de base sont des objets (&#233;galement appel&#233;s signes) comportant
certaines caract&#233;ristiques d&#233;crites par des traits. En Grammaires de Propri&#233;t&#233;s (not&#233;es dor&#233;navant
GP), les signes ne sont porteurs que d&#8217;informations statiques (ou traits endog&#232;nes). Pour les
signes lexicaux, il s&#8217;agit par exemple des traits morpho-syntaxiques, de la forme, sa position dans
la phrase, etc. Ces informations sont r&#233;capitul&#233;es dans la structure de traits de la figure 3.
</p>
<p>Les signes entretiennent entre eux des relations appel&#233;es propri&#233;t&#233;s. Les GP reposant sur une
repr&#233;sentation explicite de toutes les informations syntaxiques, chaque type d&#8217;information cor-
respond ainsi &#224; un type de propri&#233;t&#233; qui sont, dans la grammaire &#233;labor&#233;e pour ce treebank, au
nombre de six :
</p>
<p>&#8211; Lin&#233;arit&#233; : relations de pr&#233;c&#233;dence lin&#233;aire
&#8211; Obligation : identification de la t&#234;te du syntagme
&#8211; D&#233;pendance : relation syntactico-s&#233;mantique entre les cat&#233;gories
&#8211; Unicit&#233; : cat&#233;gories qui dans un syntagme ne peuvent &#234;tre r&#233;p&#233;t&#233;es
</p>
<p>309</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>lex_sign
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>LABEL pos
INDEX index_type
POSITION int
FORM string
LEMMA string
MS_FEATURES ms_vector
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
construction
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>LABEL cat
INDEX index_type
CONSTITUENTS set_of_signs
INTERNAL_FEATURES feat
CHARACTERIZATION set_of_relations
GRAMMATICALITY gram_indexes
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
</p>
<p>FIGURE 2 &#8211; Structures des signes lexicaux et des constructions
</p>
<p>&#8211; Exigence : cooccurrence obligatoire de cat&#233;gories
&#8211; Exclusion : impossibilit&#233; de cooccurrence de cat&#233;gories
</p>
<p>A ces types de propri&#233;t&#233;s s&#8217;ajoute la sp&#233;cification de l&#8217;ensemble des constituants pouvant intervenir
dans la r&#233;alisation d&#8217;un syntagme. Notons que l&#8217;ensemble de propri&#233;t&#233;s d&#233;crit ici n&#8217;est pas
limitatif, d&#8217;autres types d&#8217;informations peuvent &#233;galement &#234;tre ajout&#233;s, comme l&#8217;adjacence ou la
repr&#233;sentation explicite de l&#8217;accord. Au total, un syntagme sera d&#233;crit par un couple &lt;constituants,
propri&#233;t&#233;s&gt; comportant d&#8217;une part la liste de ses constituants possibles et d&#8217;autre part l&#8217;ensemble
des propri&#233;t&#233;s qui forment des relations entre les constituants (ou dans le cas des propri&#233;t&#233;s
unaires comme l&#8217;obligation ou l&#8217;unicit&#233;, entre le constituant et la racine).
</p>
<p>Dans le vocabulaire des GP, les relations unissant les constituants d&#8217;un syntagme forment
l&#8217;ensemble des propri&#233;t&#233;s &#233;valu&#233;es, appel&#233; caract&#233;risation. Un ensemble de signes reli&#233;s par
des propri&#233;t&#233;s correspond dans notre approche &#224; la description d&#8217;une construction. D&#8217;une fa&#231;on
g&#233;n&#233;rale, en GP, toutes les unit&#233;s de niveau non lexical, et notamment les unit&#233;s syntaxiques, sont
consid&#233;r&#233;es comme des constructions. De plus, de la m&#234;me fa&#231;on que pour les signes lexicaux,
une construction peut poss&#233;der des informations intrins&#232;ques, d&#233;crites de fa&#231;on statique par des
traits sp&#233;cifiques (par exemple, des informations morpho-syntaxiques ou grammaticales). Une
construction correspond donc &#224; la seconde structure de la figure 3.
</p>
<p>Notons qu&#8217;un des traits sp&#233;cifiques de la construction concerne la grammaticalit&#233;. Il s&#8217;agit d&#8217;un
ensemble d&#8217;indices permettant de d&#233;crire le niveau de grammaticalit&#233; (Blache et al., 2006). Ces
indices s&#8217;appuient notamment sur la mesure de la densit&#233; des relations (nombre de propri&#233;t&#233;s
satisfaites), leur importance (poids des propri&#233;t&#233;s) etc. &#224; partir desquels un indice global de
grammaticalit&#233; peut &#234;tre propos&#233;. L&#8217;indice de grammaticalit&#233; constitue une information int&#233;res-
sante, y compris dans le cas de constructions &#8220;bien form&#233;es&#8221; comme dans le cas du FTB. Cet
indice permet en effet de mesurer la densit&#233; d&#8217;information syntaxique construite et constitue
un &#233;l&#233;ment d&#8217;&#233;valuation de la complexit&#233; de la structure, utile notamment dans la perspective
d&#8217;exp&#233;riences en psycholinguistique.
</p>
<p>La description d&#8217;une construction forme un graphe de description dans lequel les signes et les
propri&#233;t&#233;s sont respectivement repr&#233;sent&#233;s par des n&#339;uds et des arcs. Dans cette repr&#233;sentation,
toute construction correspond &#224; un graphe dont la racine correspond &#224; l&#8217;identification de cette
construction : une construction peut &#224; son tour &#234;tre utilis&#233;e comme constituant d&#8217;une autre
construction. Les signes, correspondant aux n&#339;uds du graphe, sont donc aussi bien des objets
lexicaux que des constructions.
</p>
<p>L&#8217;exemple de la figure 3 propose le graphe de description pour une phrase extraite du FTBLPL. les
n&#339;uds du graphe repr&#233;sentent des signes (pour des raisons de simplicit&#233;, seuls quelques traits
sont repr&#233;sent&#233;s), tandis que les arcs portent les diff&#233;rentes propri&#233;t&#233;s : pr&#233;c&#233;dence, d&#233;pendance,
</p>
<p>310</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 3 &#8211; Graphe de description de la phrase &#8220;Le texte m&#234;me avait re&#231;u leur accord formel&#8221;
</p>
<p>obligation, constituance, unicit&#233;. Notons que les relations d&#8217;exclusion (qui jouent surtout un r&#244;le
en cas de violation de contrainte) ne sont pas indiqu&#233;es l&#224; encore pour des raisons de lisibilit&#233;.
</p>
<p>En GP, toutes les relations sont indiqu&#233;es au m&#234;me niveau. En isolant les sous-graphes de certaines
de ces relations, il est possible d&#8217;extraire du graphe un arbre syntagmatique (sous-graphe form&#233;
des arcs &#233;tiquet&#233;s const) ou de d&#233;pendance (arcs &#233;tiquet&#233;s dep).
</p>
<p>Dans le cadre du FTBLPL, s&#8217;agissant de donn&#233;es &#233;crites, les constructions concernent seulement le
domaine syntaxique : chaque syntagme correspond &#224; une construction d&#233;finie par l&#8217;ensemble des
n&#339;uds participants (les constituants) et l&#8217;ensemble des relations qui les relient.
</p>
<p>4 Sch&#233;ma d&#8217;encodage XML
</p>
<p>Le sch&#233;ma abstrait d&#233;fini dans la section pr&#233;c&#233;dente permet de d&#233;finir un sch&#233;ma d&#8217;encodage
XML. Les signes sont tout d&#8217;abord caract&#233;ris&#233;s par leur type (signe lexical ou construction) qui
induira des structures diff&#233;rentes pour les structures de traits qui les d&#233;crivent. Tous les types ont
les attributs suivants :
</p>
<p>&lt; sign&gt;
type type du signe (lexical ou construction)
label identification de la cat&#233;gorie
index index du noeud permettant sa r&#233;f&#233;rence
features vecteur de traits morpho-syntaxiques, traits syntaxiques
</p>
<p>311</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les signes lexicaux sont d&#233;crits par les attributs suivants :
</p>
<p>Type lex
position identification de la position dans la cha&#238;ne
form forme du mot
lemma lemme
</p>
<p>De leur c&#244;t&#233;, les signes de type construction dans l&#8217;encodage GP sont d&#233;crits par un ensemble
d&#8217;attributs portant les informations intrins&#232;ques ainsi que l&#8217;indice du syntagme correspondant
dans l&#8217;encodage FTB :
</p>
<p>Type const
label identification de la cat&#233;gorie
index index du n&#339;ud permettant sa r&#233;f&#233;rence
ftb_index index du n&#339;ud correspondant dans l&#8217;encodage FTB
</p>
<p>Par ailleurs, un signe de type construction contient un certain nombre d&#8217;&#233;l&#233;ments d&#233;crivant
l&#8217;ensemble de constituants, leurs propri&#233;t&#233;s et l&#8217;&#233;valuation de leur grammaticalit&#233; :
</p>
<p>Type const : :=
&lt; constituents&gt; ensemble des signes participant &#224; la construction
&lt; characterization&gt; ensemble des relations (propri&#233;t&#233;s) entre les signes
&lt; gram_indexes&gt; ensemble des indices d&#8217;&#233;valuation de la grammaticalit&#233;
</p>
<p>La caract&#233;risation d&#8217;une construction est form&#233;e quant &#224; elle par l&#8217;ensemble des propri&#233;t&#233;s.
Chaque propri&#233;t&#233; est d&#233;crite par un ensemble d&#8217;attributs d&#233;crivant le type de la relation, les
n&#339;uds sources et cibles ainsi que la satisfaction (ou violation) de la propri&#233;t&#233; :
</p>
<p>&lt; characterization&gt;
type type de la propri&#233;t&#233; (lin&#233;arit&#233;, d&#233;pendance, etc.)
source index du n&#339;ud source de la relation (n&#339;ud racine en cas de relation unaire)
target index du n&#339;ud cible
sat satisfaction de la propri&#233;t&#233; (valeur &#8217;plus&#8217; ou &#8217;moins&#8217;)
</p>
<p>L&#8217;exemple suivant illustre l&#8217;encodage du dernier syntagme nominal de la phrase &#8220;Le texte m&#234;me
avait re&#231;u leur accord formel&#8221; dont le graphe de description est donn&#233; plus haut. La premi&#232;re
partie de l&#8217;exemple fournit l&#8217;encodage des annotations sous format FTB modifi&#233; comme indiqu&#233;
en premi&#232;re section. Il s&#8217;agit d&#8217;une repr&#233;sentation arborescente classique, dans laquelle toutes les
cat&#233;gories, lexicales et syntagmatiques, sont repr&#233;sent&#233;es par des &#233;l&#233;ments de type sign.
</p>
<p>Encodage FTB
</p>
<p>&lt;sign type=&quot;const&quot; label=&quot;NP&quot; features=&quot;NP_OBJ&quot; index=&quot;f-10&quot;&gt;
</p>
<p>&lt;sign type=&quot;lex&quot; label=&quot;Det&quot; features=&quot;Ds3msp&#21;-&quot; index=&quot;f-11&quot; form=&quot;leur&quot; lemma=&quot;leur&quot;/&gt;
</p>
<p>&lt;sign type=&quot;lex&quot; label=&quot;N&quot; features=&quot;Ncms&#21;&quot; index=&quot;f-12&quot; form=&quot;accord&quot; lemma=&quot;accord&quot;/&gt;
</p>
<p>&lt;sign type=&quot;const&quot; label=&quot;AP&quot; features=&quot;AP&quot; index=&quot;f-13&quot;&gt;
</p>
<p>&lt;sign type=&quot;const&quot; label=&quot;Adj&quot; features=&quot;Af-ms-&quot; index=&quot;f-14&quot; form=&quot;formel&quot; lemma=&quot;formel&quot;/&gt;
</p>
<p>&lt;/sign&gt;
</p>
<p>&lt;/sign&gt;
</p>
<p>L&#8217;encodage en GP suit le sch&#233;ma abstrait d&#233;crit plus haut. Un graphe de description est un
ensemble de constructions, chacune formant un graphe compos&#233; d&#8217;un ensemble de n&#339;uds (les
constituants) et d&#8217;un ensemble de relations indiqu&#233;es dans la caract&#233;risation et constituant
le c&#339;ur de la description syntaxique. Dans cet exemple, pour des raisons de lisibilit&#233;, elles
sont repr&#233;sent&#233;es sous forme compacte pour la repr&#233;sentation de la caract&#233;risation du NP (les
propri&#233;t&#233;s sont des attributs dont les valeurs sont des couples d&#8217;index). Par ailleurs, le treebank
&#233;tant hybride, les deux encodages GP et FTB sont repr&#233;sent&#233;s simultan&#233;ment. Deux options sont
</p>
<p>312</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>possibles pour l&#8217;encodage XML : la premi&#232;re consistant &#224; repr&#233;senter dans un fichier unique (donc
&#224; l&#8217;int&#233;rieur d&#8217;un arbre XML) les informations d&#8217;origine et les propri&#233;t&#233;s. La seconde option, plus
fid&#232;le &#224; l&#8217;approche des GP repose sur une repr&#233;sentation parall&#232;le : l&#8217;arbre XML correspondant
au FTB d&#8217;un c&#244;t&#233; et les informations GP de l&#8217;autre. L&#8217;identification des signes lexicaux dans la
partie d&#8217;encodage GP se fait donc par r&#233;f&#233;rence &#224; l&#8217;index des &#233;l&#233;ments correspondants d&#233;crits
dans l&#8217;encodage FTB.
</p>
<p>Encodage GP
</p>
<p>&lt;sign type=&quot;const&quot; label=&quot;AP&quot; index=&quot;g-15&quot; ftb_index=&quot;f-13&quot;&gt;
</p>
<p>&lt;constituents&gt;
</p>
<p>&lt;constituent sign_index=&quot;f-14&quot;/&gt;
</p>
<p>&lt;/constituents&gt;
</p>
<p>&lt;characterization&gt;
</p>
<p>&lt;property type=&quot;oblig&quot; source=&quot;f-13&quot; target=&quot;f-14&quot; sat=&quot;p&quot;/&gt;
</p>
<p>&lt;property type=&quot;unic&quot; source=&quot;f-13&quot; target=&quot;f-14&quot; sat=&quot;p&quot;/&gt;
</p>
<p>&lt;/characterization&gt;
</p>
<p>&lt;gram_indexes gram=&quot;0.585&quot; sat=&quot;1.0&quot; complete=&quot;0.117&quot; quality=&quot;1.0&quot; precision=&quot;0.584&quot;/&gt;
</p>
<p>&lt;/sign&gt;
</p>
<p>&lt;sign type=&quot;const&quot; label=&quot;NP&quot; index=&quot;g-16&quot; ftb_index=&quot;f-10&quot;&gt;
</p>
<p>&lt;constituents&gt;
</p>
<p>&lt;constituent sign_index=&quot;f-11&quot;/&gt;
</p>
<p>&lt;constituent sign_index=&quot;f-12&quot;/&gt;
</p>
<p>&lt;constituent sign_index=&quot;g-15&quot;/&gt;
</p>
<p>&lt;/constituents&gt;
</p>
<p>&lt;characterization prec_p=&quot;11:12;11:13&quot; oblig_p=&quot;12&quot; dep_p=&quot;11:12;13:12&quot;
</p>
<p>exig_p=&quot;12:11;13:12&quot; unic_p=&quot;11;12&quot;/&gt;
</p>
<p>&lt;gram_indexes gram=&quot;0.595&quot; sat=&quot;1.0&quot; complete=&quot;0.145&quot; quality=&quot;1.0&quot; precision=&quot;0.597&quot;/&gt;
</p>
<p>&lt;/sign&gt;
</p>
<p>Il est important de pr&#233;ciser que dans l&#8217;encodage GP, les constructions sont toutes repr&#233;sent&#233;es
au m&#234;me niveau : les relations entre les diff&#233;rents signes (les arcs du graphe) sont donn&#233;es
par les propri&#233;t&#233;s et ne suivent pas n&#233;cessairement une hi&#233;rarchie stricte. En d&#8217;autres termes,
les informations linguistiques sont repr&#233;sent&#233;es sous forme de graphe, et non d&#8217;arbre. Ce type
de repr&#233;sentation est indispensable dans la perspective d&#8217;int&#233;gration d&#8217;informations issues de
domaines autres que la syntaxe (discours, pragmatique ou encore, pour les corpus oraux, prosodie,
phon&#233;tique, etc.). Son int&#233;r&#234;t r&#233;side en particulier dans sa capacit&#233; &#224; d&#233;crire des ph&#233;nom&#232;nes
discontinus, fr&#233;quents &#224; l&#8217;oral, mais &#233;galement &#224; l&#8217;&#233;crit.
</p>
<p>Concr&#232;tement, l&#8217;encodage propos&#233; suit ainsi les recommandations du format GrAF (voir (Ide
et Suderman, 2007), (ISO24612, 2008)) : les diff&#233;rents &#233;l&#233;ments du graphe sont repr&#233;sent&#233;s
sous la forme d&#8217;&#233;l&#233;ments non hi&#233;rarchis&#233;s, leur structuration &#233;tant fournie par les relations
sp&#233;cifi&#233;es entre les index. Cependant, &#224; la diff&#233;rence de GrAF, nous avons choisi de repr&#233;senter les
informations statiques sous la forme d&#8217;attributs (lorsqu&#8217;il s&#8217;agit de vecteurs de traits) ou d&#8217;&#233;l&#233;ments
(pour les structures de traits) &#224; l&#8217;int&#233;rieur des n&#339;uds. Dans notre repr&#233;sentation, les &#233;l&#233;ments
&lt;sign&gt; correspondent aux n&#339;uds. Ils peuvent faire r&#233;f&#233;rence au signe correspondant dans
l&#8217;encodage FTB (attribut ftb_index). Ils comportent par ailleurs la sp&#233;cification de l&#8217;ensemble des
n&#339;uds qui vont former le graphe (&#233;l&#233;ments &lt;constituents&gt;). La liste des relations (&#233;l&#233;ments
&lt;property&gt;) est indiqu&#233;e dans l&#8217;&#233;l&#233;ment &lt;characterization&gt;. Elle est compl&#233;t&#233;e par un
&#233;l&#233;ment portant les indices de grammaticalit&#233;.
</p>
<p>Cette repr&#233;sentation permet d&#8217;identifier les constructions comme des unit&#233;s &#224; part enti&#232;re et qui
peuvent &#224; leur tour devenir des n&#339;uds du graphe de description. Ce dernier correspond donc
&#224; un hypergraphe dans lequel chaque n&#339;ud correspond soit &#224; un &#233;l&#233;ment atomique, soit &#224; un
</p>
<p>313</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>graphe. Dans notre exemple, la construction AP (index g-15) est ainsi d&#233;crite par un graphe qui
est utilis&#233; comme n&#339;ud dans la construction NP (index g-16).
</p>
<p>5 Acquisition d&#8217;une GP &#224; partir du FTBLPL
</p>
<p>La construction de la grammaire GP acquise &#224; partir du FTBLPLa &#233;t&#233; faite manuellement. Un
outil de navigation et d&#8217;&#233;dition du FTBLPLa pour cela &#233;t&#233; d&#233;velopp&#233;. Sa premi&#232;re fonctionnalit&#233;
permet de lister pour chaque syntagme toutes ses r&#233;alisations possibles. Il s&#8217;agit en d&#8217;autres
termes d&#8217;identifier, dans le cadre d&#8217;une grammaire syntagmatique, toutes les parties droites de
r&#232;gles. Le r&#233;sultat se pr&#233;sente sous la forme d&#8217;un tableau HTML (voir l&#8217;exemple de la figure 4)
permettant d&#8217;&#233;diter pour chaque syntagme ses r&#233;alisations dans le corpus. La colonne de droite
est constitu&#233;e de liens vers les positions correspondantes dans le FTBLPL, permettant ainsi de
visualiser les exemples comme repr&#233;sent&#233; dans la figure 5.
</p>
<p>FIGURE 4 &#8211; Edition des constructions du NP sujet
</p>
<p>Nous avons r&#233;pertori&#233;, gr&#226;ce &#224; l&#8217;&#233;diteur ci-dessus, l&#8217;ensemble des constructions possibles de toutes
les unit&#233;s syntaxiques. Cette base d&#8217;information fournit directement la liste des constituants et
leurs propri&#233;t&#233;s. Celles-ci sont construites de la fa&#231;on suivante :
</p>
<p>&#8211; Lin&#233;arit&#233; : pour chaque constituant, toutes les cat&#233;gories pouvant la pr&#233;c&#233;der, mais pas la
suivre
</p>
<p>&#8211; Obligation : liste des cat&#233;gories, mutuellement exclusives, apparaissant obligatoirement dans
une construction du syntagme. Il s&#8217;agit des t&#234;tes, il peut y en avoir plusieurs pour un m&#234;me
syntagme (mais jamais r&#233;alis&#233;es simultan&#233;ment)
</p>
<p>&#8211; Unicit&#233; : liste des cat&#233;gories n&#8217;apparaissant qu&#8217;une fois dans chacune des constructions
&#8211; Exigence : pour chaque constituant, liste des cat&#233;gories du syntagme apparaissant toujours
</p>
<p>avec lui
&#8211; Exclusion : pour chaque constituant, liste des cat&#233;gories du syntagme n&#8217;apparaissant jamais
</p>
<p>avec lui
</p>
<p>314</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 5 &#8211; Visualisation d&#8217;arbres
</p>
<p>Remarquons que ces propri&#233;t&#233;s peuvent &#234;tre acquises automatiquement &#224; partir de la liste des
constructions possibles du syntagme sur la base de laquelle les informations sont extraites. A ces
propri&#233;t&#233;s s&#8217;ajoute la relation de d&#233;pendance. Celle-ci correspond, dans le cas de cette grammaire,
aux relations de compl&#233;mentation, adjonction et sp&#233;cification. Il est toujours possible d&#8217;enrichir
ou de modifier cet ensemble de relations. Le tableau suivant r&#233;capitule pour chaque cat&#233;gorie le
nombre des propri&#233;t&#233;s acquise &#224; partir du FTB :
</p>
<p>const lin dep unic oblig exig excl
</p>
<p>SENT 8 5 3 3 1 0 2
NP 12 36 18 10 4 6 44
AP 5 7 4 3 1 0 2
PP 7 6 5 3 1 0 0
AdP 10 18 5 4 1 0 1
VP 10 24 8 3 1 0 0
VPinf 9 13 0 7 1 0 0
VPpart 8 7 0 7 1 0 0
VN 6 11 5 2 1 0 0
VNinf 7 6 5 4 3 4 0
VNpart 7 7 6 5 2 4 0
Srel 7 7 0 5 1 0 3
Ssub 10 14 1 1 1 0 3
Sint 8 4 0 5 1 0 6
</p>
<p>Ces propri&#233;t&#233;s sont in&#233;galement r&#233;parties, le NP &#233;tant la cat&#233;gorie la plus riche. On constate par
ailleurs que le nombre de propri&#233;t&#233;s et leur r&#233;partition entre les types ne sont pas totalement
d&#233;pendants du nombre de cat&#233;gories, mais plut&#244;t de la vari&#233;t&#233; des constructions possibles. La
figure 6 propose l&#8217;exemple de l&#8217;ensemble des propri&#233;t&#233;s du NP observ&#233;es dans le FTBLPL.
</p>
<p>6 Enrichissement automatique du FTBLPL
</p>
<p>L&#8217;enrichissement du FTBLPLpar une description en GP se fait automatiquement. Nous utilisons
pour cela un ensemble de solveurs de contraintes appliqu&#233; &#224; l&#8217;entr&#233;e sous format XML du FTBLPL.
Le processus d&#8217;&#233;valuation des contraintes permettant de construire l&#8217;analyse en GP est donc
tr&#232;s fortement contraint : il prend en effet en entr&#233;e un syntagme d&#233;j&#224; identifi&#233;, ainsi que la
liste de ses constituants. Ceci permet donc de s&#233;lectionner dans la grammaire le sous-ensemble
</p>
<p>315</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>const Det, N, Np , Pro, Clit, AdP, AP, NP, VPpart, VPinf, Srel, PP, Ssub
</p>
<p>lin
</p>
<p>Det &#8826; {N, Np , AdP, AP, VPpart, VPinf, Ssub, Srel, PP, NP}
N &#8826; {AdP, VPpart, VPinf, Ssub, Srel, PP, NP}
Np &#8826; {AP, VPpart, Srel, PP}
AP &#8826; {VPpart, VPinf, Ssub, Srel, NP}
AdP &#8826; {Ssub, Srel, PP}
NP &#8826; {PP}
Pro &#8826; {Srel, PP}
PP &#8826; {VPpart, VPinf, Srel}
</p>
<p>dep
{Det, AP, AdP, NP, VPpart, VPinf, PP, Srel, Ssub}&#160; N
{AP, NP, VPpart, PP, Srel}&#160; Np
{PP, Srel}&#160; Pro
</p>
<p>unic unic = {Det, N, Pro, Clit, AdP, NP, VPpart, VPinf, Srel, Ssub}
oblig oblig = {N, Np , Pro, Clit}
exig {Det, PP, AP, VPpart, VPinf, Ssub}&#8658; N
</p>
<p>excl
</p>
<p>Pro &#8855; {Det, N, Np , AP, AdP, NP, VPpart, VPinf, Ssub}
AdP &#8855; {VPpart, VPinf}
Ssub &#8855; {AP, NP, VPpart, VPinf, Srel, PP}
NP &#8855; {Pro, VPpart, VPinf, Srel, Ssub}
VPpart &#8855; {VPinf, Srel, Ssub}
VPinf &#8855; {AP, Srel, Ssub}
Srel &#8855; {Ssub}
Np &#8855; {N, Pro, AdP, VPinf, Ssub}
Clit &#8855; {Det, N, Pro, AP, AdP, NP, VPpart, VPinf, Ssub}
</p>
<p>FIGURE 6 &#8211; Propri&#233;t&#233;s du NP
</p>
<p>de contraintes d&#233;crivant le syntagme en question l&#224; o&#249; un processus normal d&#8217;analyse en GP
consisterait &#224; parcourir l&#8217;ensemble des contraintes de la grammaire. Au total, le principe de
construction de la description en GP consiste donc &#224; parcourir le treebank initial et calculer la
caract&#233;risation de chaque syntagme du corpus. Celle-ci, comme indiqu&#233; plus haut, est form&#233;e
d&#8217;une part par la liste des constituants (qui formera la liste de n&#339;uds du graphe de description)
et la liste des relations qui les relient. Cette derni&#232;re est obtenue en appliquant les solveurs de
contraintes. La description de leur implantation peut &#234;tre d&#233;crite de fa&#231;on simplifi&#233;e par une
pr&#233;sentation ensembliste.
</p>
<p>On note : |E| la cardinalit&#233; de l&#8217;ensemble E ; C la suite ordonn&#233;e des constituants du syntagme
analys&#233;, Ci.. j le sous-ensemble de C entre les positions i et j ; ci un constituant de C &#224; la position
i ; n le nombre de constituants de C .
Par ailleurs, les propri&#233;t&#233;s dans la grammaire sont repr&#233;sent&#233;es soit par des ensembles (obligation,
unicit&#233;) soit par des relations binaires. Dans le premier cas, on note P les cat&#233;gories sp&#233;cifi&#233;es
dans l&#8217;ensemble et pi une propri&#233;t&#233; de P . Dans le second cas, on note left la cat&#233;gorie de la
partie gauche de la relation et right celle de la partie droite.
</p>
<p>Obligation |C &#8745;P |&gt; 0
Lin&#233;arit&#233; left &#8712; C1..i &#8658; right &#8712; Ci+1..n
Unicit&#233; &#8704;ci &#8712; pi , |{ci} &#8745;C |= 1
Exigence left &#8712; C &#8658; right &#8712; C
Exclusion left &#8712; C &#8658; right /&#8712; C
</p>
<p>Les descriptions op&#233;rationnelles ci-dessus sont d&#233;crites pour une propri&#233;t&#233; identifi&#233;e. La construc-
tion de la caract&#233;risation totale consiste &#224; appliquer cette &#233;valuation &#224; l&#8217;ensemble des propri&#233;t&#233;s
d&#233;crivant le syntagme. Concr&#232;tement, nous avons d&#233;velopp&#233; un syst&#232;me couplant &#224; un analy-
seur syntaxique probabiliste (entra&#238;n&#233; sur le FTB) l&#8217;&#233;valuateur GP d&#233;velopp&#233; comme indiqu&#233;
</p>
<p>316</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 7 &#8211; R&#233;partition des propri&#233;t&#233;s dans le corpus
</p>
<p>ci-dessus. Nous pouvons donc d&#233;sormais g&#233;n&#233;rer automatiquement un treebank hybride consti-
tuants/propri&#233;t&#233;s au format FTBLPL.
</p>
<p>7 Analyse de la r&#233;partition des propri&#233;t&#233;s
</p>
<p>La g&#233;n&#233;ration des analyses en propri&#233;t&#233;s du FTB permet de pr&#233;ciser la distribution des propri&#233;t&#233;s
de fa&#231;on &#224; en mesurer l&#8217;impact. L&#8217;ensemble des caract&#233;risations permet en effet d&#8217;identifier les
propri&#233;t&#233;s effectivement utilis&#233;es pour la description du corpus (on parle alors de propri&#233;t&#233;s
pertinentes). L&#8217;&#233;tude de la distribution de ces propri&#233;t&#233;s fournit des indications pr&#233;cises au niveau
g&#233;n&#233;ral sur le r&#244;le des diff&#233;rents types de propri&#233;t&#233;s dans la grammaire, mais &#233;galement sur
l&#8217;impact sp&#233;cifique d&#8217;une propri&#233;t&#233; particuli&#232;re dans la description d&#8217;un syntagme. Il devient donc
possible d&#8217;envisager l&#8217;identification sur la base de corpus d&#8217;une r&#233;partition entre propri&#233;t&#233;s fortes
et faibles, comme cela est propos&#233; dans les approches en psycholinguistique 1.
</p>
<p>La figure 7 indique la r&#233;partition du nombre total des propri&#233;t&#233;s pertinentes pour la description
des unit&#233;s du FTBLPL. Nous avons isol&#233; des indicateurs la propri&#233;t&#233; d&#8217;exclusion, celle-ci &#233;tant en
effet in&#233;galement r&#233;partie entre les syntagmes (beaucoup n&#8217;en contiennent pas). De plus, ce type
de propri&#233;t&#233; consiste &#224; v&#233;rifier l&#8217;absence de certaines cat&#233;gories (restriction de cooccurrence),
elle est donc presque toujours pertinente (ou &#233;valu&#233;e), ce qui n&#8217;est pas le cas des autres propri&#233;-
t&#233;s. Enfin, cette propri&#233;t&#233; est directement d&#233;pendante du nombre de cat&#233;gories pouvant &#234;tre
r&#233;alis&#233;es comme constituant d&#8217;un syntagme. D&#8217;une fa&#231;on g&#233;n&#233;rale, les r&#233;sultats montrent une
fr&#233;quence importante pour les contraintes d&#8217;unicit&#233;, d&#8217;obligation et de lin&#233;arit&#233;. Les propri&#233;t&#233;s
de d&#233;pendance et d&#8217;exigence sont quant &#224; elles moins fr&#233;quentes dans les caract&#233;risations. Cette
information souligne l&#8217;importance de trois types d&#8217;informations non pr&#233;sentes explicitement dans
une repr&#233;sentation syntagmatique classique : la pr&#233;sence de la t&#234;te, l&#8217;impossibilit&#233; de r&#233;p&#233;tition
d&#8217;un &#233;l&#233;ment et l&#8217;ordre lin&#233;aire. En &#233;tudiant plus pr&#233;cis&#233;ment la r&#233;partition de ces types de
propri&#233;t&#233;s dans les syntagmes (voir figure 8), on constate que les cat&#233;gories SENT, NP et dans
une moindre mesure PP mobilisent l&#8217;essentiel des propri&#233;t&#233;s &#233;valu&#233;es. Ce ph&#233;nom&#232;ne r&#233;v&#232;le en
fait un certain degr&#233; de figement des constructions : les syntagmes ayant une grande variabilit&#233;
notamment en termes de nombre de constituants et de vari&#233;t&#233; des constructions ont recours &#224; un
plus grand nombre de propri&#233;t&#233;s pour leur description que les autres. Cette tendance se confirme
en &#233;tudiant la r&#233;partition des propri&#233;t&#233;s &#233;valu&#233;es pour les syntagmes montrant des description
</p>
<p>1. Une telle r&#233;partition en deux types est plus op&#233;rationnelle pour le type d&#8217;analyse que nous proposons qu&#8217;une
v&#233;ritable probabilisation de l&#8217;espace des propri&#233;t&#233;s.
</p>
<p>317</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 8 &#8211; R&#233;partition des propri&#233;t&#233;s par type
</p>
<p>moins denses.
</p>
<p>L&#8217;&#233;tude des caract&#233;risations des principaux syntagmes les plus variables (voir figure 9) fait
appara&#238;tre trois grands types de r&#233;partition : SENT et NP qui pr&#233;sentent un certain &#233;quilibre entre
les diff&#233;rentes propri&#233;t&#233;s ; PP et VP dont les description n&#8217;utilisent pas de propri&#233;t&#233; d&#8217;exigence
(cooccurrence obligatoire de cat&#233;gories) ; AP et AdP enfin qui n&#8217;utilisent quasiment que des
propri&#233;t&#233;s d&#8217;unicit&#233; et d&#8217;obligation.
</p>
<p>FIGURE 9 &#8211; R&#233;partition des propri&#233;t&#233;s par cat&#233;gorie
</p>
<p>Le niveau le plus fin de description consiste &#224; analyser pour chaque syntagme la r&#233;partition des
propri&#233;t&#233;s prises individuellement. Celle-ci n&#8217;est en effet pas homog&#232;ne, ce qui nous permet
d&#8217;identifier avec pr&#233;cision quels types de propri&#233;t&#233; jouent un r&#244;le plus important que les autres.
Une estimation sur la base de la fr&#233;quence constitue un &#233;l&#233;ment indicatif sur la base de laquelle
une telle estimation peut &#234;tre faite. Les tableaux de la figure 10 fournissent ces r&#233;sultats. Ces
sch&#233;mas pr&#233;sentent en abscisses les indices des propri&#233;t&#233;s dans la grammaire et en ordonn&#233;es
</p>
<p>318</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 10 &#8211; R&#233;partition des propri&#233;t&#233;s pour le NP
</p>
<p>leurs occurrences.
</p>
<p>Nous choisissons de retenir comme propri&#233;t&#233;s &#224; poids fort celles pr&#233;sentant plus de 500 occur-
rences. Le tableau de la figure 11 r&#233;capitule les propri&#233;t&#233;s fortes du NP.
</p>
<p>Ce r&#233;sultat nous offre la possibilit&#233; d&#8217;acqu&#233;rir automatiquement une m&#233;thode de calcul des poids
des propri&#233;t&#233;s pour chacune des constructions. Cette information, int&#233;gr&#233;e dans la grammaire, est
extr&#234;mement utile tout d&#8217;abord en termes de contr&#244;le du processus d&#8217;analyse : les propri&#233;t&#233;s fortes
seront trait&#233;es comme imp&#233;rativement satisfaites tandis que les faibles pourront &#234;tre rel&#226;ch&#233;es.
Par ailleurs, du point de vue de la mod&#233;lisation des processus cognitifs, il s&#8217;agit &#233;galement d&#8217;une
information tr&#232;s importante, contribuant notamment &#224; l&#8217;&#233;valuation de la difficult&#233; de traitement
(la violation de contraintes fortes entra&#238;nera une difficult&#233; de traitement plus importante).
</p>
<p>8 Conclusion
</p>
<p>Nous avons d&#233;crit dans cet article un processus d&#8217;enrichissement du FTB permettant de produire
un treebank hybride incluant les analyses en Grammaires de Propri&#233;t&#233;s. Le r&#233;sultat constitue
</p>
<p>Type Indice Propri&#233;t&#233;
</p>
<p>Lin&#233;arit&#233;
</p>
<p>1 Det &#8826; N
4 Det &#8826; AP
9 Det &#8826; PP
15 N &#8826; Srel
18 N &#8826; NP
</p>
<p>Exigence
1 Det&#8658; N
2 PP&#8658; N
3 AP&#8658;N
</p>
<p>Type Indice Propri&#233;t&#233;
</p>
<p>D&#233;pendance
</p>
<p>1 Det&#160; N
2 AP&#160; N
4 NP&#160; N
7 PP&#160; N
</p>
<p>Obligation
1 N
3 Pro
</p>
<p>Unicit&#233;
1 Det
2 N
</p>
<p>FIGURE 11 &#8211; Liste des propri&#233;t&#233;s fortes du NP
</p>
<p>319</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>une nouvelle ressource pour la description du fran&#231;ais &#224; partir de laquelle le d&#233;veloppement de
nouveaux outils sera possible. Le processus d&#8217;enrichissement est totalement automatique, il est
donc possible d&#8217;envisager la constitution de nouveaux treebanks hybrides. Par ailleurs, ce type
treebank inclut une &#233;valuation quantifi&#233;e de la grammaticalit&#233; gr&#226;ce &#224; la description en propri&#233;t&#233;s,
ce qui en fait une ressource pr&#233;cieuse notamment pour les &#233;tudes en psycholinguistiques sur
corpus.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et F., T. (2003). Building a treebank for french. In ABEILL&#201;, A., &#233;diteur :
Treebanks, Kluwer, Dordrecht.
</p>
<p>BLACHE, P. (2001). Les Grammaires de Propri&#233;t&#233;s : Des contraintes pour le traitement automatique
des langues naturelles. Herm&#232;s.
</p>
<p>BLACHE, P., HEMFORTH, B. et RAUZY, S. (2006). Acceptability prediction by means of gramma-
ticality quantification. In Proceedings of the 21st International Conference on Computational
Linguistics and 44th Annual Meeting of the Association for Computational Linguistics, pages 57&#8211;64,
Sydney, Australia. Association for Computational Linguistics.
</p>
<p>BLACHE, P. et RAUZY, S. (2008). Influence de la qualit&#233; de l&#8217;&#233;tiquetage sur le chunking : une
corr&#233;lation d&#233;pendant de la taille des chunks. In Actes de Traitement Automatique des Langues
Naturelles, pages 290&#8211;299, Avignon, France.
</p>
<p>CANDITO, M.-H., CRABB&#201;, B. et DENIS, P. (2010). Statistical french dependency parsing : treebank
conversion and first results. In LREC&#8217;2010.
</p>
<p>CERISARA, C., GARDENT, C. et ANDERSON, C. (2010). Building and Exploiting a Dependency
Treebank for French Radio Broadcast. In TLT9 &#8211; the ninth international workshop on Treebanks
and Linguistic Theories, Tartu, Estonie.
</p>
<p>IDE, N. et SUDERMAN, K. (2007). Graf : A graph- based format for linguistic annotations. In First
Linguistic Annotation Workshop.
</p>
<p>IDE, N. et V&#201;RONIS, J. (1994). MULTEXT : Multilingual text tools and corpora. In Proceedings of
the 15th. International Conference on Computational Linguistics (COLING 94), volume I, pages
588&#8211;592, Kyoto, Japan.
</p>
<p>ISO24612 (2008). Language resource management - linguistic annotation framework. In
ISO/TC 37/SC 4 N522/WG 1/CD 24612.
</p>
<p>KAY, P. et FILLMORE, C. (1999). Grammatical Constructions and Linguistic Generalizations : the
what&#8217;s x doing y ? Construction. Language, 75(1):1&#8211;33.
</p>
<p>PYNTE, J., ABEILL&#201;, A. et TOUSSENEL, F. (2001). Constituent length and attachment preferences
in french. In AMLAP&#8217;2001.
</p>
<p>RAUZY, S. et BLACHE, P. (2009). Un point sur les outils du lpl pour l&#8217;analyse syntaxique du
fran&#231;ais. In Actes du workshop ATALA &#8217;Quels analyseurs syntaxiques pour le fran&#231;ais ?&#8217;, pages 1&#8211;6,
Paris, France.
</p>
<p>SCHLUTER, N. et van GENABITH, J. (2007). Preparing, restructuring and augmenting a french
treebank : Lexicalized parsers or coherent treebanks ? In Proceedings of PACLING 07, Melbourne,
Australia.
</p>
<p>320</p>

</div></div>
</body></html>