<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Post-&#233;dition statistique pour l'adaptation aux domaines de sp&#233;cialit&#233; en traduction automatique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 527&#8211;534,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Post-&#233;dition statistique pour l&#8217;adaptation aux domaines de
sp&#233;cialit&#233; en traduction automatique
</p>
<p>Rapha&#235;l Rubino, St&#233;phane Huet, Fabrice Lef&#232;vre, Georges Linar&#232;s
LIA-CERI, Universit&#233; d&#8217;Avignon et des Pays de Vaucluse, Avignon, France
</p>
<p>{pr&#233;nom.nom}@univ-avignon.fr
</p>
<p>R&#201;SUM&#201;
Cet article pr&#233;sente une approche de post-&#233;dition statistique pour adapter aux domaines de sp&#233;-
cialit&#233; des syst&#232;mes de traduction automatique g&#233;n&#233;riques. En utilisant les traductions produites
par ces syst&#232;mes, align&#233;es avec leur traduction de r&#233;f&#233;rence, un mod&#232;le de post-&#233;dition bas&#233;
sur un alignement sous-phrastique est construit. Les exp&#233;riences men&#233;es entre le fran&#231;ais et
l&#8217;anglais pour le domaine m&#233;dical montrent qu&#8217;une telle adaptation a posteriori est possible. Deux
syst&#232;mes de traduction statistiques sont &#233;tudi&#233;s : une impl&#233;mentation locale &#233;tat-de-l&#8217;art et un
outil libre en ligne. Nous proposons aussi une m&#233;thode de s&#233;lection de phrases &#224; post-&#233;diter
permettant d&#8217;embl&#233;e d&#8217;accro&#238;tre la qualit&#233; des traductions et pour laquelle les scores oracles
indiquent des gains encore possibles.
ABSTRACT
Statistical Post-Editing of Machine Translation for Domain Adaptation
</p>
<p>This paper presents a statistical approach to adapt generic machine translation systems to the
medical domain through an unsupervised post-edition step. A statistical post-edition model
is built on statistical machine translation outputs aligned with their translation references.
Evaluations carried out to translate medical texts from French to English show that a generic
machine translation system can be adapted a posteriori to a specific domain. Two systems
are studied : a state-of-the-art phrase-based implementation and an online publicly available
software. Our experiments also indicate that selecting sentences for post-edition leads to
significant improvements of translation quality and that more gains are still possible with respect
to an oracle measure.
</p>
<p>MOTS-CL&#201;S : Traduction automatique statistique, post-&#233;dition, adaptation aux domaines de
sp&#233;cialit&#233;.
</p>
<p>KEYWORDS: Statistical Machine Translation, Post-editing, Domain Adaptation.
</p>
<p>1 Introduction
</p>
<p>La traduction automatique statistique bas&#233;e sur l&#8217;alignement sous-phrastique (Koehn et al., 2003)
est une approche tr&#232;s populaire qui m&#232;ne &#224; des performances int&#233;ressantes. Les mod&#232;les statis-
tiques sous-jacents sont construits &#224; l&#8217;aide de phrases en relation de traduction, d&#8217;o&#249; sont extraites
des probabilit&#233;s d&#8217;alignements entre les s&#233;quences de mots. Les ressources linguistiques n&#233;ces-
saires &#224; l&#8217;estimation de ces probabilit&#233;s sont les corpus parall&#232;les, &#233;l&#233;ments indispensables dans le
processus de construction du mod&#232;le de traduction. Cependant, ces ressources sont co&#251;teuses &#224;
</p>
<p>527</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>produire et limitent l&#8217;approche. Ce manque de donn&#233;es parall&#232;les se fait ressentir plus fortement
pour des domaines sp&#233;cialis&#233;s. En effet, beaucoup d&#8217;activit&#233;s humaines impliquent l&#8217;utilisation
d&#8217;une langue sp&#233;cifique comportant des particularit&#233;s syntaxiques et terminologiques (Sager
et al., 1980). Ainsi, construire des syst&#232;mes de traduction pour tous les domaines semble hors
de port&#233;e et nous pensons que l&#8217;adaptation d&#8217;un syst&#232;me &#171; g&#233;n&#233;rique &#187; repr&#233;sente une solution
viable &#224; la prise en charge des domaines dans leur diversit&#233;.
</p>
<p>M&#234;me dans les cas o&#249; la traduction automatique peut atteindre de bonnes performances, il
est possible d&#8217;am&#233;liorer manuellement la sortie des syst&#232;mes. Mais cela implique une &#233;tape de
post-&#233;dition qui peut se r&#233;v&#233;ler co&#251;teuse selon l&#8217;effort &#224; fournir pour produire une traduction
de qualit&#233; (Mart&#237;nez, 2003). Il para&#238;t donc int&#233;ressant d&#8217;automatiser ce processus d&#8217;&#233;dition
a posteriori afin de contr&#244;ler et d&#8217;am&#233;liorer les traductions produites par un syst&#232;me. Nous
proposons, dans cet article, d&#8217;utiliser une approche de post-&#233;dition statistique (statistical post-
edition, SPE) bas&#233;e sur l&#8217;alignement sous-phrastique afin d&#8217;adapter des syst&#232;mes de traduction
automatique &#224; un domaine de sp&#233;cialit&#233;. Le domaine &#233;tudi&#233; est celui de la m&#233;decine et la paire
de langues est fran&#231;ais-anglais. Plusieurs syst&#232;mes de traductions statistiques sont utilis&#233;s et nous
proposons diff&#233;rentes m&#233;thodes afin d&#8217;introduire une petite quantit&#233; de donn&#233;es sp&#233;cialis&#233;es
pendant le processus de traduction. Nous &#233;tudions aussi l&#8217;impact de la post-&#233;dition en l&#8217;appliquant
syst&#233;matiquement &#224; toute traduction, puis en s&#233;lectionnant les phrases &#224; post-&#233;diter &#224; l&#8217;aide d&#8217;un
classifieur.
</p>
<p>L&#8217;organisation de cet article est la suivante. La section 2 pr&#233;sente l&#8217;approche de SPE par segments
sous-phrastique. Puis, dans la section 3, nous proposons un cadre exp&#233;rimental et donnons des
d&#233;tails sur les donn&#233;es utilis&#233;es ainsi que les diff&#233;rentes configurations &#233;valu&#233;es. La section 4
contient les r&#233;sultats en terme de traduction automatique, suivie de la section 5 pr&#233;sentant
les r&#233;sultats de notre approche pour la post-&#233;dition. La s&#233;lection des phrases &#224; post-&#233;diter est
d&#233;taill&#233;e dans la section 6.
</p>
<p>2 L&#8217;adaptation aux domaines par post-&#233;dition statistique
</p>
<p>La post-&#233;dition d&#8217;une traduction automatique consiste &#224; g&#233;n&#233;rer un texte T &#8242;&#8242; &#224; partir d&#8217;une
hypoth&#232;se de traduction T &#8242; provenant d&#8217;un texte source S. Ainsi, ne sont n&#233;cessaires &#224; la SPE que
des donn&#233;es monolingues dans la langue cible. Le corpus parall&#232;le utilis&#233; pour la construction du
mod&#232;le de post-&#233;dition peut &#234;tre constitu&#233; d&#8217;hypoth&#232;ses de traductions, de leurs r&#233;f&#233;rences de
traduction, d&#8217;hypoth&#232;ses post-&#233;dit&#233;es manuellement, etc.
</p>
<p>Parmi les premiers travaux &#224; relater de l&#8217;efficacit&#233; de la SPE, Simard et al. (2007a) proposent
d&#8217;&#233;diter automatiquement des hypoth&#232;ses de traduction produites par un syst&#232;me &#224; base de
r&#232;gles. Une &#233;tude d&#233;taill&#233;e de cette approche (traduction par r&#232;gles et SPE par alignement
sous-phrastique) est propos&#233;e par (Dugast et al., 2007) et les gains observ&#233;s sur la mesure
d&#8217;&#233;valuation BLEU (Papineni et al., 2002) peuvent atteindre jusqu&#8217;&#224; 10 points.
</p>
<p>L&#8217;am&#233;lioration de la qualit&#233; des traductions produites par un syst&#232;me &#224; base de r&#232;gles en utilisant
la SPE est donc possible. Certains auteurs y voient la possibilit&#233; d&#8217;adapter le syst&#232;me de traduction
&#224; des domaines de sp&#233;cialit&#233;. Selon (Isabelle et al., 2007; Simard et al., 2007b), en introduisant
des donn&#233;es sp&#233;cialis&#233;es lors de la phase de post-&#233;dition, il est possible d&#8217;adapter un syst&#232;me
de traduction a posteriori. Cette technique a aussi &#233;t&#233; appliqu&#233;e par de Ilarraza et al. (2008),
&#224; partir de traductions bas&#233;es sur des r&#232;gles post-&#233;dit&#233;es par alignement sous-phrastique, en
y ajoutant des informations morphologiques. Parmi ces travaux, il est important de noter que
</p>
<p>528</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>corpus
source
</p>
<p>syst&#232;me de
traduction
</p>
<p>syst&#232;me de
post-&#233;dition
</p>
<p>corpus
traduit
</p>
<p>Corpus
post-
&#233;dit&#233;
</p>
<p>&#8710;
BLEU
</p>
<p>ensemble
d'apprentissage classifieur
</p>
<p>mod&#232;le de
classification
</p>
<p>FIGURE 1: Architecture g&#233;n&#233;rale combinant la traduction et la SPE, ainsi que la s&#233;lection des
phrases &#224; post-&#233;diter par estimation des gains &#8710;BLEU .
</p>
<p>certains auteurs ont sugg&#233;r&#233; de combiner deux syst&#232;mes statistiques pour la traduction et la
post-&#233;dition, sans toutefois poursuivre ces exp&#233;rimentations (Isabelle et al., 2007; Oflazer et
El-Kahlout, 2007).
</p>
<p>Plus r&#233;cemment, B&#233;chara et al. (2011) sont les premiers &#224; &#233;tudier la combinaison de la traduction
et la post-&#233;dition par alignement sous-phrastique. Des am&#233;liorations sont observ&#233;es entre le
fran&#231;ais et l&#8217;anglais, en introduisant des informations sur le contexte source dans la phase de
post-&#233;dition. Mais il n&#8217;y a, &#224; notre connaissance, aucune publication sur l&#8217;utilisation de l&#8217;approche
pour l&#8217;adaptation aux domaines de sp&#233;cialit&#233;. Nous proposons donc de l&#8217;&#233;tudier dans cet article,
en relation avec la s&#233;lection automatique des phrases &#224; post-&#233;diter. Ce dernier aspect est abord&#233;
dans (Suzuki, 2011), o&#249; les auteurs d&#233;crivent une s&#233;lection de phrases &#224; post-&#233;diter manuellement
bas&#233;e sur l&#8217;estimation de la qualit&#233; de traduction au niveau des phrases.
</p>
<p>Les travaux pr&#233;sent&#233;s dans cet article sont centr&#233;s sur l&#8217;adaptation de syst&#232;mes de traduction
g&#233;n&#233;riques en utilisant une petite quantit&#233; de donn&#233;es parall&#232;les du domaine. La figure 1
illustre l&#8217;architecture g&#233;n&#233;rale de notre approche, combinant la traduction, la post-&#233;dition et
la classification. Dans un premier temps, une traduction automatique d&#8217;un texte sp&#233;cialis&#233;
est produite. Puis, en utilisant la r&#233;f&#233;rence de traduction, un corpus parall&#232;le monolingue est
construit. Ce corpus est utilis&#233; pour construire le mod&#232;le de post-&#233;dition. Lorsqu&#8217;un nouveau texte
est traduit, nous proposons alors deux m&#233;thodes : la post-&#233;dition na&#239;ve de toutes les phrases ou
la s&#233;lection des phrases &#224; post-&#233;diter. Cette s&#233;lection est faite sur l&#8217;estimation des gains possibles
par post-&#233;dition en recourant &#224; la m&#233;trique automatique BLEU.
</p>
<p>3 Cadre exp&#233;rimental
</p>
<p>L&#8217;id&#233;e g&#233;n&#233;rale des travaux pr&#233;sent&#233;s dans cet article est d&#8217;accro&#238;tre la qualit&#233; de traductions
de textes sp&#233;cialis&#233;s produites par un syst&#232;me g&#233;n&#233;rique par une &#233;tape de post-&#233;dition. Nous
consid&#233;rons deux types de syst&#232;mes de traduction permettant de passer de la langue source
&#224; la langue cible : MOSES avec son impl&#233;mentation de l&#8217;alignement sous-phrastique (Koehn
et al., 2007) et le syst&#232;me en ligne GOOGLE TRADUCTION 1. Nous utilisons MOSES pour post-
&#233;diter les hypoth&#232;ses de traduction produites par les deux types de syst&#232;mes de traduction
individuellement.
</p>
<p>Ressources Les donn&#233;es g&#233;n&#233;riques (non sp&#233;cialis&#233;es) sont pr&#233;sent&#233;es dans le tableau 1a. Les
</p>
<p>1. http://translate.google.com/, en utilisant l&#8217;API gratuite pendant les mois de Juin et Juillet 2011.
</p>
<p>529</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Corpus Phrases Mots
Donn&#233;es parall&#232;les
</p>
<p>Europarl v6 1,8 M 50 M
Nations Unies 12 M 300 M
EMEA (M&#233;dical) 160 k 4 M
</p>
<p>Donn&#233;es monolingues
News Commentary v6 181 k 4 M
Shuffled News Corpus
</p>
<p>25 M 515 M
(2007&#8211;2011)
</p>
<p>(a) Taille des donn&#233;es utilis&#233;es en nombre de phrases.
</p>
<p>Syst&#232;me BLEU (%) p-valeur
MTg MLg 29,9 0,002
MTg MLg+m 38,2 0,002
MTg MLm 39,2 0,002
</p>
<p>google 44,9
0,007
</p>
<p>MTm MLm 46,4 0,001
MTg+m MLm 47,2 0,75
MTg+m MLg+m 47,3
</p>
<p>(b) Scores BLEU obtenus sur le corpus de test du domaine
m&#233;dical.
</p>
<p>TABLE 1: Donn&#233;es utilis&#233;es (a) et scores BLEU obtenus avec les diff&#233;rents syst&#232;mes de traduction
(b).
</p>
<p>donn&#233;es bilingues, utilis&#233;es pour la construction des mod&#232;les de traduction, sont compos&#233;es de la
sixi&#232;me version du corpus Europarl et du corpus issu des Nations Unies. Les donn&#233;es monolingues,
utilis&#233;es pour la construction des mod&#232;les de langue, sont compos&#233;es des corpus d&#8217;actualit&#233;s
News Crawl et de la partie langue cible de News Commentary. Toutes ces donn&#233;es g&#233;n&#233;riques
ont &#233;t&#233; mises &#224; disposition lors de la campagne d&#8217;&#233;valuation WMT11 2. Les donn&#233;es sp&#233;cialis&#233;es
sont issues quant &#224; elles de documents provenant de l&#8217;agence europ&#233;enne de m&#233;decine (corpus
EMEA (Tiedemann, 2009)). Trois cat&#233;gories m&#233;dicales sont concern&#233;es : des rapports d&#8217;&#233;valuation
concernant des traitements effectu&#233;s sur des humains, d&#8217;autres effectu&#233;s sur des animaux,
et des documents de m&#233;decine g&#233;n&#233;rale. Certains documents composant ce corpus sont des
prescriptions m&#233;dicales. Une des caract&#233;ristiques de ces documents est une forte redondance au
niveau des phrases. Nous d&#233;cidons de retirer les phrases r&#233;p&#233;t&#233;es car elles ne repr&#233;sentent pas
un grand int&#233;r&#234;t pour la post-&#233;dition. En effet, traduire une phrase se trouvant dans l&#8217;ensemble
d&#8217;apprentissage revient a consulter une m&#233;moire de traduction au niveau des phrases. Aussi,
nous ne conservons dans le corpus que les phrases d&#8217;une longueur inf&#233;rieure &#224; 80 mots car les
alignements obtenus sur des longues phrases sont g&#233;n&#233;ralement de qualit&#233; moindre. Puis, trois
sous-ensembles de phrases sont constitu&#233;es, formant un corpus d&#8217;entra&#238;nement (156k phrases),
un corpus de d&#233;veloppement (ou optimisation, 2k phrases) et un corpus de test (2k phrases).
</p>
<p>Syst&#232;mes de traduction Parmi les syst&#232;mes de traduction utilis&#233;s, l&#8217;outil accessible en ligne,
not&#233; google dans les exp&#233;riences pr&#233;sent&#233;es dans cet article, ne peut &#234;tre modifi&#233;. Nous pouvons
cependant post-&#233;diter et &#233;valuer les traductions produites par ce syst&#232;me. La bo&#238;te &#224; outils de
traduction MOSES permet, quant &#224; elle, de construire un mod&#232;le de traduction &#224; partir des corpus
parall&#232;les et de contr&#244;ler chaque &#233;tape de ce processus. Ainsi, nous pouvons faire varier les
donn&#233;es monolingues et bilingues utilis&#233;es.
</p>
<p>Pour les mod&#232;les de langue (ML), trois mod&#232;les 5-grammes sont construits. Un premier est
&#233;tabli sur les donn&#233;es monolingues g&#233;n&#233;riques (MLg), un second est construit sur la partie
langue cible du corpus d&#8217;entra&#238;nement m&#233;dical (MLm). Ces deux mod&#232;les sont combin&#233;s par
interpolation lin&#233;aire (MLg+m) selon des poids estim&#233;s par le calcul de la perplexit&#233; sur le corpus
de d&#233;veloppement sp&#233;cialis&#233;. Pour ce dernier mod&#232;le, le vocabulaire g&#233;n&#233;rique est limit&#233; &#224; 1
million de mots les plus fr&#233;quents. Le poids optimal associ&#233; au mod&#232;le de langue sp&#233;cialis&#233; est
de 0, 9 malgr&#233; sa petite taille, ce qui montre le niveau de sp&#233;cificit&#233; du domaine m&#233;dical.
</p>
<p>2. http://www.statmt.org/wmt11/
</p>
<p>530</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour les mod&#232;les de traduction (MT), MOSES permet de construire une table de traduction
et un mod&#232;le de r&#233;ordonnancement en choisissant les donn&#233;es &#224; utiliser. Un premier mod&#232;le
de traduction est construit avec les donn&#233;es bilingues g&#233;n&#233;riques (MTg), un second avec les
donn&#233;es m&#233;dicales (MTm). La combinaison de ces deux mod&#232;les permet d&#8217;obtenir un mod&#232;le
mixte (MTg+m). Pour ces trois configurations, les donn&#233;es bilingues sont align&#233;es au niveau des
mots avec l&#8217;outil MGIZA++ (Gao et Vogel, 2008). Les poids associ&#233;s aux &#233;l&#233;ments composant les
mod&#232;les de traduction sont optimis&#233;s sur le corpus de d&#233;veloppement m&#233;dical pour la m&#233;trique
BLEU selon la m&#233;thode MERT (Och, 2003).
</p>
<p>Afin de construire des syst&#232;mes de post-&#233;dition pour l&#8217;adaptation au domaine m&#233;dical, nous
utilisons les traductions du corpus d&#8217;entra&#238;nement sp&#233;cialis&#233; produites par chaque syst&#232;me de
traduction individuellement. Chaque sortie est align&#233;e avec la r&#233;f&#233;rence de traduction puis utilis&#233;e
pour construire un mod&#232;le de post-&#233;dition &#224; l&#8217;aide de MOSES (avec les param&#232;tres par d&#233;faut).
Le corpus de d&#233;veloppement sp&#233;cialis&#233;, une fois traduit par chaque syst&#232;me de traduction, est
utilis&#233; afin d&#8217;optimiser les poids des composants du mod&#232;le de post-&#233;dition.
</p>
<p>4 Traduction de textes sp&#233;cialis&#233;s
</p>
<p>La premi&#232;re s&#233;rie d&#8217;exp&#233;riences porte sur la traduction du corpus de test sp&#233;cialis&#233;. Les r&#233;sultats
obtenus selon les diff&#233;rentes configurations de syst&#232;mes sont pr&#233;sent&#233;s dans le tableau 1b.
La comparaison entre les syst&#232;mes est effectu&#233;e selon la m&#233;thode d&#8217;approximation par sous-
&#233;chantillonnage al&#233;atoire impl&#233;ment&#233;e dans l&#8217;outil FASTMTEVAL (Stroppa et al., 2007). Ces
r&#233;sultats indiquent que la meilleure configuration, avec un score BLEU de 47,3%, est celle
combinant les donn&#233;es g&#233;n&#233;riques et sp&#233;cialis&#233;es (MTg+mMLg+m). Cependant, ces scores ne
sont pas significativement sup&#233;rieurs &#224; ceux obtenus par MTg+mMLm (p-valeur=0,75). Nous
pouvons donc en conclure que l&#8217;int&#233;gration des donn&#233;es g&#233;n&#233;riques dans le mod&#232;le de langue ne
permet pas d&#8217;am&#233;liorer les performances du syst&#232;me de traduction, ce qui d&#233;montre encore une
fois la forte sp&#233;cificit&#233; du domaine m&#233;dical. Cette constatation est plus marqu&#233;e encore lors de
l&#8217;utilisation du mod&#232;le de traduction g&#233;n&#233;rique (MTg). Introduire des donn&#233;es g&#233;n&#233;riques dans
le mod&#232;le de langue (MTgMLg+m) d&#233;grade d&#8217;un point de BLEU les performances en comparaison
avec le score obtenu par MTgMLm (de 39,2% &#224; 38,2%). Le syst&#232;me de traduction en ligne
obtient quant &#224; lui 44, 9% de BLEU, soit 1, 5 points de moins que le syst&#232;me construit uniquement
sur les donn&#233;es sp&#233;cialis&#233;es.
</p>
<p>5 Post-&#233;dition des traductions
</p>
<p>Afin de post-&#233;diter les hypoth&#232;ses de traduction produites par les syst&#232;mes &#233;tudi&#233;s, le corpus
d&#8217;entra&#238;nement sp&#233;cialis&#233; est traduit par les diff&#233;rentes configurations et align&#233; avec sa r&#233;f&#233;rence
de traduction. Ainsi, un syst&#232;me de post-&#233;dition est construit pour chaque syst&#232;me de traduction.
Lorsque le corpus de test est traduit, il peut &#234;tre post-&#233;dit&#233; dans son int&#233;gralit&#233;, ou uniquement
sur les phrases avec une am&#233;lioration possible. Deux scores sont donc calcul&#233;s : le premier
repr&#233;sente l&#8217;application na&#239;ve de la post-&#233;dition, le second indique les gains maximums possibles
de notre approche (score oracle).
</p>
<p>Syst&#232;me en ligne Le syst&#232;me de traduction en ligne obtient des r&#233;sultats convenables lors de la
phase de traduction et les r&#233;sultats obtenus en post-&#233;dition sont pr&#233;sent&#233;s dans le tableau 2. La
comparaison entre les syst&#232;mes montre des diff&#233;rences significatives, avec des p-valeur de 0, 001
pour la post-&#233;dition na&#239;ve et 0,05 pour les scores oracles. Deux syst&#232;mes de post-&#233;dition sont
</p>
<p>531</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>base + SPEmMLm + SPEmMLg+m
google 44,9 46,8 (53,3) 47,9 (53,5)
MTgMLg 29,9 43,4 (44,2) 45,6 (47,0)
MTgMLm 39,2 42,7 (44,2) 42,5 (44,4)
</p>
<p>TABLE 2: Scores BLEU (%) apr&#232;s post-&#233;dition des traductions produites par les syst&#232;mes en ligne
(google) et Moses sur le corpus de test m&#233;dical, utilisant un mod&#232;le de langue g&#233;n&#233;rique ou
sp&#233;cialis&#233;. Scores oracle entre parenth&#232;ses.
</p>
<p>construits, utilisant les donn&#233;es sp&#233;cialis&#233;es pour le mod&#232;le de post-&#233;dition et se diff&#233;renciant
selon les mod&#232;les de langue, sp&#233;cialis&#233; (SPEmMLm) ou mixte (SPEmMLg+m). Les meilleurs
r&#233;sultats sont obtenus par SPEmMLg+m avec un score BLEU de 47,9%. Le score oracle indique
pour cette configuration un score maximum de 53, 5%, ce qui motive notre approche de s&#233;lection
de phrases.
</p>
<p>Syst&#232;me g&#233;n&#233;rique Nous proposons &#224; pr&#233;sent de post-&#233;diter les sorties d&#8217;un syst&#232;me de traduc-
tion statistique par alignement sous-phrastique ne disposant pas de donn&#233;es sp&#233;cialis&#233;es pour le
mod&#232;le de traduction. Les r&#233;sultats de la post-&#233;dition sont pr&#233;sent&#233;s dans le tableau 2 en utilisant
(MTgMLm) ou non (MTgMLg) les donn&#233;es sp&#233;cialis&#233;es pour construire un ML. Le recours &#224; la
post-&#233;dition montre un gain significatif pour MTgMLg en faisant progresser le score BLEU de
29,9% &#224; 45,6% pour la meilleure configuration (SPEmMLg+m). L&#8217;augmentation observ&#233;e de
3,5 points de BLEU &#224; partir de MTgMLm est moins importante, tout en restant statistiquement
significative (p-valeur = 0,001).
</p>
<p>Syst&#232;me sp&#233;cialis&#233; et mixte Afin de couvrir l&#8217;ensemble des exp&#233;riences possibles selon les
diff&#233;rents syst&#232;mes de traduction construits, nous proc&#233;dons &#224; pr&#233;sent &#224; l&#8217;&#233;valuation de la
post-&#233;dition de sorties issues des syst&#232;mes utilisant les donn&#233;es sp&#233;cialis&#233;es. Deux syst&#232;mes
de traduction sont concern&#233;s, MTm et MTg+m, chacun pouvant utiliser un mod&#232;le de langue
sp&#233;cialis&#233; ou mixte. Cependant, nous ne d&#233;taillons pas les r&#233;sultats obtenus apr&#232;s post-&#233;dition des
traductions, car aucune am&#233;lioration n&#8217;a &#233;t&#233; observ&#233;e lors des exp&#233;rimentations. Seuls les scores
oracles indiquent qu&#8217;un gain est possible, si la s&#233;lection des phrases &#224; post-&#233;diter est correctement
effectu&#233;e.
</p>
<p>6 S&#233;lection des phrases &#224; post-&#233;diter
</p>
<p>La s&#233;lection des traductions &#224; post-&#233;diter est motiv&#233;e par les scores oracles mesur&#233;s dans les
exp&#233;riences pr&#233;c&#233;dentes. Nous proposons d&#8217;utiliser un classifieur afin de d&#233;tecter les traductions
pouvant &#234;tre am&#233;lior&#233;es gr&#226;ce &#224; la post-&#233;dition. Le score &#8710;BLEU (avant et apr&#232;s post-edition)
permet d&#8217;associer une classe aux phrases d&#8217;un corpus d&#8217;entra&#238;nement. Nous choisissons le corpus
de d&#233;veloppement sp&#233;cialis&#233; comme ensemble d&#8217;entra&#238;nement pour le classifieur. Ce dernier
est de type S&#233;parateur &#224; Vaste Marge (SVM (Boser et al., 1992)), impl&#233;ment&#233; dans l&#8217;outil
LIBSVM (Chang et Lin, 2011). Les phrases traduites sont utilis&#233;es sous la forme de vecteurs de
n-grammes (avec n &#8712; [1; 3] dans notre cas).
Nous &#233;valuons notre approche de s&#233;lection de phrases &#224; post-&#233;diter en utilisant la configuration
dont le score oracle est le plus &#233;lev&#233;, c-&#224;-d le syst&#232;me de traduction en ligne (google) avec le
syst&#232;me de post-&#233;dition SPEmLMg+m (oracle atteignant 53,5%). Le corpus de d&#233;veloppement
sp&#233;cialis&#233; permet de construire le mod&#232;le de classification, puis le corpus de test sp&#233;cialis&#233;
est soumis au SVM afin d&#8217;en extraire les phrases &#224; post-&#233;diter. Les performances du classifieur
</p>
<p>532</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>[ 0.
0 ;
</p>
<p>0.1
[
</p>
<p>0.2
[
</p>
<p>0.3
[
</p>
<p>0.4
[
</p>
<p>0.5
[
</p>
<p>0.6
[
</p>
<p>0.7
[
</p>
<p>0.8
[
</p>
<p>0.9
[
</p>
<p>1.0
]42
</p>
<p>43
44
45
46
47
48
49
</p>
<p>0
2
4
6
8
10
12
14
16
18
20
22
24
26phrases seuils indiv. seuils cumul.
</p>
<p>Scores du classifieur
</p>
<p>BL
EU
</p>
<p>( %
)
</p>
<p>ph
ras
</p>
<p>es
(%
</p>
<p>)
(a) Scores BLEU et nombre de phrases &#233;tiquet&#233;es &#171; &#224;
post-editer &#187; selon les seuils individuels et cumul&#233;s des
scores issus du classifieur sur le corpus de test m&#233;dical.
</p>
<p>google initial + SPE + SPE_selection
TER 42,3 40,4 39,7
BLEU 44,9 47,9 48,9
</p>
<p>(b) Scores TER et BLEU apr&#232;s traduction, s&#233;lection des
phrases et post-&#233;dition (p(&#224; post-&#233;diter) &gt;= 0,8) sur le
corpus de test m&#233;dical.
</p>
<p>FIGURE 2: Analyse sur le corpus de test des r&#233;sultat de post-&#233;dition avec s&#233;lection de phrases pour
le syst&#232;me de traduction en ligne.
</p>
<p>atteignent 79, 5% de rappel et 40, 1% de pr&#233;cision. Le classifieur produit un score de confiance
pour chaque classe attribu&#233;e, correspondant &#224; la probabilit&#233; qu&#8217;une phrase appartienne &#224; la classe
pr&#233;dite. Ceci nous permet de d&#233;finir des seuils d&#8217;acceptation des phrases class&#233;es dans la cat&#233;gorie
&#224; post-&#233;diter. Nous &#233;valuons notre approche de s&#233;lection selon ces seuils, individuellement ou
cumul&#233;s. Les r&#233;sultats sont pr&#233;sent&#233;s dans la figure 2a. En cumulant les seuils au dessus de 0, 8
pour la classe &#171; &#224; post-&#233;diter &#187;, 1 point de BLEU est gagn&#233; par rapport &#224; l&#8217;application na&#239;ve de
la post-&#233;dition. Nous remarquons qu&#8217;une quantit&#233; plus importante de phrases sont post-&#233;dit&#233;es
entre les seuils 0,5 et 0,8, et seulement 60 phrases le sont avec un score sup&#233;rieur &#224; 0,9. Cet
aspect influence les r&#233;sultats en terme de score BLEU. L&#8217;&#233;valuation globale du corpus de test
apr&#232;s post-&#233;dition des phrases s&#233;lectionn&#233;es montre une am&#233;lioration selon les deux m&#233;triques
utilis&#233;es (tableau 2b). L&#8217;utilisation d&#8217;une s&#233;lection appara&#238;t donc comme une m&#233;thode apportant
des gains en comparaison &#224; l&#8217;application na&#239;ve de la post-&#233;dition (avec une p-valeur &#233;gale &#224;
0, 004).
</p>
<p>7 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; dans cet article une approche de post-&#233;dition statistique fond&#233;e sur les
segments pour l&#8217;adaptation aux domaines de sp&#233;cialit&#233; en traduction automatique. Les exp&#233;-
riences men&#233;es montrent qu&#8217;un syst&#232;me de traduction g&#233;n&#233;rique peut &#234;tre adapt&#233; a posteriori par
l&#8217;introduction de donn&#233;es sp&#233;cialis&#233;es dans une &#233;tape de post-&#233;dition. L&#8217;application na&#239;ve de la
SPE permet d&#8217;am&#233;liorer la qualit&#233; de traduction dans certains cas. Les scores oracles indiquent
que pour toutes les configurations &#233;tudi&#233;es, des gains en terme de score BLEU sont possibles. Les
meilleurs r&#233;sultats sont obtenus par le syst&#232;me de traduction en ligne, coupl&#233; avec un syst&#232;me
de post-&#233;dition construit sur des donn&#233;es mixtes, et en utilisant un classifieur pour s&#233;lectionner
les traductions &#224; post-&#233;diter. Compar&#233; au syst&#232;me de base, le score BLEU est am&#233;lior&#233; de 4
points. L&#8217;apprentissage du classifieur est toutefois limit&#233; aux hypoth&#232;ses de traduction et nous
envisageons, dans des travaux futurs, d&#8217;enrichir les param&#232;tres d&#8217;apprentissage pour mieux tenir
compte du contexte de traduction afin de s&#8217;approcher des scores oracles mesur&#233;s.
</p>
<p>533</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>B&#201;CHARA, H., MA, Y. et van GENABITH, J. (2011). Statistical post-editing for a statistical MT
system. In MT Summit XIII, pages 308&#8211;315.
</p>
<p>BOSER, B., GUYON, I. et VAPNIK, V. (1992). A training algorithm for optimal margin classifiers. In
5th annual workshop on Computational learning theory, pages 144&#8211;152.
</p>
<p>CHANG, C.-C. et LIN, C.-J. (2011). LIBSVM : A library for support vector machines. ACM
Transactions on Intelligent Systems and Technology, 2:27 :1&#8211;27 :27. Software available at
http://www.csie.ntu.edu.tw/~cjlin/libsvm.
de ILARRAZA, A., LABAKA, G. et SARASOLA, K. (2008). Statistical postediting : A valuable method
in domain adaptation of RBMT systems for less-resourced languages. In MATMT, pages 35&#8211;40.
</p>
<p>DUGAST, L., SENELLART, J. et KOEHN, P. (2007). Statistical post-editing on Systran&#8217;s rule-based
translation system. In WMT, pages 220&#8211;223.
</p>
<p>GAO, Q. et VOGEL, S. (2008). Parallel implementations of word alignment tool. In ACL Workshop :
Software Engineering, Testing, and Quality Assurance for Natural Language Processing, pages
49&#8211;57.
</p>
<p>ISABELLE, P., GOUTTE, C. et SIMARD, M. (2007). Domain adaptation of MT systems through
automatic post-editing. In MT Summit XI, pages 255&#8211;261.
</p>
<p>KOEHN, P., HOANG, H., BIRCH, A., CALLISON-BURCH, C., FEDERICO, M., BERTOLDI, N., COWAN, B.,
SHEN, W., MORAN, C., ZENS, R. et al. (2007). Moses : Open source toolkit for statistical machine
translation. In ACL, pages 177&#8211;180.
</p>
<p>KOEHN, P., OCH, F. et MARCU, D. (2003). Statistical phrase-based translation. In NAACL-HLT,
volume 1, pages 48&#8211;54.
</p>
<p>MART&#205;NEZ, L. (2003). Human Translation versus Machine Translation and Full Post-Editing of Raw
Machine Translation Output. Th&#232;se de doctorat, Dublin City University.
</p>
<p>OCH, F. (2003). Minimum error rate training in statistical machine translation. In ACL, volume 1,
pages 160&#8211;167.
</p>
<p>OFLAZER, K. et EL-KAHLOUT, I. (2007). Exploring different representational units in English-to-
Turkish statistical machine translation. In WMT, pages 25&#8211;32.
</p>
<p>PAPINENI, K., ROUKOS, S., WARD, T. et ZHU, W. (2002). BLEU : A method for automatic evaluation
of machine translation. In ACL, pages 311&#8211;318.
</p>
<p>SAGER, J., DUNGWORTH, D. et MCDONALD, P. (1980). English special languages : principles and
practice in science and technology. Wiesbaden : Oscar BrandstetterVerlay, pages 2&#8211;35.
</p>
<p>SIMARD, M., GOUTTE, C. et ISABELLE, P. (2007a). Statistical phrase-based post-editing. In
NAACL-HLT, pages 508,515.
</p>
<p>SIMARD, M., UEFFING, N., ISABELLE, P. et KUHN, R. (2007b). Rule-based translation with statistical
phrase-based post-editing. In WMT, pages 203&#8211;206.
</p>
<p>STROPPA, N., OWCZARZAK, K. et WAY, A. (2007). A cluster-based representation for multi-system
MT evaluation. In TMI, pages 221&#8211;230.
</p>
<p>SUZUKI, H. (2011). Automatic post-editing based on SMT and its selective application by
sentence-level automatic quality evaluation. In MT Summit XIII, pages 156&#8211;163.
</p>
<p>TIEDEMANN, J. (2009). News from OPUS&#8212;a collection of multilingual parallel corpora with
tools and interfaces. In RANLP, volume V, pages 237&#8211;248.
</p>
<p>534</p>

</div></div>
</body></html>