<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>BiTermEx Un prototype d'extraction de mots compos&#233;s &#224; partir de documents comparables via la m&#233;thode compositionnelle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 415&#8211;422,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>BiTermEx : un prototype d'extraction de mots compos&#233;s&#224; partir de documents comparablesvia la m&#233;thode compositionnelle 
</p>
<p>Emmanuel Planas1,2
(1) UNAM, LINA, 2 rue de la Houssini&#232;re, BP 92208, 44322 Nantes 
</p>
<p>(2) UNAM, UCO, ST, 3, place Andr&#233; Leroy, 49008 Angers
emmanuel.planas@univ-nantes.fr
</p>
<p>R&#201;SUM&#201;____________________________________________________________________________________________________________
</p>
<p>Nous  d&#233;crivons  BiTermEx,  un  prototype  d'exp&#233;rimentation de  l'extraction  de 
terminologie  bilingue de  mots  compos&#233;s,  &#224;  partir  de  documents  comparables,  via  la 
m&#233;thode  compositionnelle.  Nous  expliquons  la  variation  morphologique  et  la 
combinaison des constituants lexicaux des termes compos&#233;s. Cette permet une pr&#233;cision 
TOP1  de  92%  et  97,5%  en  fran&#231;ais  anglais,  et  de  94%  en  fran&#231;ais  japonais  pour 
l'alignement de termes compos&#233;s (textes scientifiques et de vulgarisation scientifique).
ABSTRACT__________________________________________________________________________________________________________
</p>
<p>BiTermEx , A prototype for the extraction of multiword terms from comparable 
documents through the compositional approach.
We describe BiTermEx,  a  prototype for extracting multiword terms from comparable 
corpora, using the compositional method. We focus on morphology-based variations of 
multiword  constituents  and  their  recombinaison.  We  experimented  our  approach  on 
scientific and popular science corpora. We record TOP1 precisions of 92% and 97,5% on 
French to English alignments and 94% on French to Japanese.
Mots-cl&#233;s :  extraction  terminologique,  prototype,  terminologie  bilingue,  documents 
comparables, m&#233;thode compositionnelle, mots compos&#233;s, corpus.
Keywords : term extraction, prototype, bilingual terminology, comparable documents, 
compositional method, multiword terms, corpus.
</p>
<p>1 Introduction
</p>
<p>Les documents comparables sont caract&#233;ris&#233;s par le partage d'un ensemble significatif de 
termes traduits en commun, tels les articles de Wikip&#233;dia relatifs &#224; un sujet. (D&#233;jean &amp; 
Gaussier, 2011) en donnent cette d&#233;finition : &#171; Deux corpus de deux langues l1 et l2 sont 
dits comparables s&#8217;il existe une sous-partie non n&#233;gligeable du vocabulaire du corpus de 
langue l1, respectivement l2, dont la traduction se trouve dans le corpus de langue l2,  
respectivement l1. &#187; Ils sont plus difficiles &#224; utiliser pour un alignement de termes que 
les documents parall&#232;les qui sont, eux, des traductions l'un de l'autre (ex : les manuels de 
t&#233;l&#233;phones portables en plusieurs langues). Ceci provient du fait  que les premiers ne 
pr&#233;sentent pas de rep&#232;res positionnels et distributionnels pr&#233;sents dans les derniers. Ils 
ont cependant un avantage important : leur nombre nettement plus &#233;lev&#233; (Fung, 1998). 
</p>
<p>415</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>En outre, Internet en est un r&#233;servoir important, qui s'incr&#233;mente quotidiennement.
</p>
<p>2 Principes d'extraction de terminologie de corpus comparables
</p>
<p>Les m&#233;thodes d'alignement de termes d'une langue &#224; l'autre sont habituellement class&#233;es 
en  deux grandes  cat&#233;gories :  la  m&#233;thode  contextuelle (Fung,  1998) et  la  m&#233;thode 
compositionnelle (Robitaille et al., 2006). Elles reposent sur quatre phases.
La  Phase 1 de collecte les corpus sources et cibles. Elle peut &#234;tre automatique, semi-
automatique ou manuelle, &#233;ventuellement guid&#233;e par une liste ferm&#233;e de termes sources 
et de leur traduction (graines), comme par exemple dans  (Robitaille et al., 2006). Des 
outils ont &#233;t&#233; pr&#233;c&#233;demment d&#233;velopp&#233;s pour cette tache d'extraction, comme BootCat 
(Baroni &amp; Bernardini, 2004.), ou Babouk  (De Groc, 2011).
La Phase 2 a pour but d'extraire une liste de termes sources et cibles candidats, souvent 
apr&#232;s une phase de pr&#233;-traitement du texte extrait des corpus ; l&#233;ger : un effacement de 
mots vides (Fung, 1995), ou plus profond : analyse syntaxique chez (Yu &amp; Tsujii, 2009). 
L'identification de termes candidats peut se faire : de fa&#231;on monolingue, par exemple &#224; 
l'aide de patrons de cat&#233;gories grammaticales comme dans (Takeuchi et al., 2009) ;  qui 
utilisent Acabit (Daille, 2003) ; ou encore de fa&#231;on bilingue, comme dans (Fung, 1998), 
via la recherche d'une corr&#233;lation entre les termes source et cible.
La diff&#233;rentiation entre les deux grandes m&#233;thodes (contextuelle et compositionnelle) 
s'effectue en Phase 3. Celle-ci a pour mission de construire une liste de candidats cibles 
associ&#233;s &#224; un candidat source dont on cherche la traduction.
Dans  la  m&#233;thode  contextuelle,  cette  construction  se  fait  par  le  rapprochement 
statistique de contextes construits autour des mots sources d'une part et des mots cibles 
d'autre  part.  Les  &#171; contextes &#187;  peuvent  &#234;tre  des  vecteurs  lexicaux   (Fung,  1998) ou 
syntaxiques  (Yu &amp; Tsujii, 2009). La m&#233;thode contextuelle s'applique mieux aux termes 
simples  car  ceux-ci  ont  en  g&#233;n&#233;ral  une  fr&#233;quence  plus  importante  que  les  termes 
complexes, qui peut &#234;tre exploit&#233;e par les m&#233;thodes statistiques.
Dans la  m&#233;thode compositionnelle, les termes sources dont on cherche la traduction 
sont  &#171;transpos&#233;s&#187;  en  des  candidats  cibles  par  construction  morphologique,  lexicale, 
syntaxique, ou s&#233;mantique &#224; partir de leurs composants lexicaux (Morin &amp; Daille, 2009). 
L'ensemble  des  combinaisons  des  composants  est  g&#233;n&#233;r&#233;  et  traduit  pour  obtenir  des 
candidats cibles.
C'est &#224; la Phase 4 que sont s&#233;lectionn&#233;es la o&#249; les meilleures traductions. En contextuel, 
cela s'effectue souvent &#224; l'aide d'une mesure de similarit&#233; entre les contextes source et 
cible ; dans la m&#233;thode compositionnelle, les candidats r&#233;sultent d'une &#171; construction 
th&#233;orique &#187;.  La  s&#233;lection  des  meilleurs  candidats  peut  alors  se  faire  par  simple 
&#171; projection &#187; : on ne retient les candidats qui apparaissent dans la liste des termes cibles.
Pour compl&#233;ter ce tour d'horizon, on pourra consulter  (Laroche &amp; Langlais, 2010) qui 
passent en revue l'ensemble des facteurs de la m&#233;thode contextuelle, et (Morin &amp; Daille, 
2009) qui pr&#233;sentent une large vue de la m&#233;thode compositionnelle.
</p>
<p>416</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Description de BiTermEx
</p>
<p>BiTermEx est un prototype permettant de tester la m&#233;thode d'alignement de terminologie 
compositionnelle  (Morin &amp; Daille, 2009). Il  est &#233;crit en Java. Il a &#233;t&#233; test&#233; sur Linux 
Ubuntu, Windows XP et 7. Nous d&#233;crivons ici les choix th&#233;oriques.
</p>
<p>3.1 Phase 1 : Identification de corpus comparable
</p>
<p>La collecte des corpus se fait actuellement manuellement : l'automatisation sera trait&#233;e 
dans une version ult&#233;rieure de l'outil.
</p>
<p>3.2 Phase 2 : Extraction de termes candidats sources et cibles
</p>
<p>BiTermEx extrait des listes de mots compos&#233;s candidats via l'application de patrons de 
cat&#233;gories  grammaticales  et  de  lemmes.  Ceci  est  r&#233;alis&#233;  apr&#232;s  une  cat&#233;gorisation  et 
identification des lemmes relatifs  aux mots du corpus.  Cette analyse est obtenue par 
l'int&#233;gration du TreeTagger d'Helmut Schmid  (Schmid, 1994).   En post traitement de 
l'analyse  de  Tree  Tagger,  nous  effectuons  une  standardisation  des  &#233;tiquettes  des 
cat&#233;gories grammaticales, de telle fa&#231;on &#224; pouvoir exprimer les patrons d'extraction de 
terminologie dans un langage commun &#224; l'ensemble des langues trait&#233;es (Ex : fran&#231;ais : 
DET:ART &#8594; DET@art ; anglais: RB &#8594; DET).
Chaque phrase du texte est exprim&#233;e comme une cha&#238;ne de caract&#232;res r&#233;sultant de la 
concat&#233;nation  de  l'analyse  de  chacun  de  ses  mots (la  cat&#233;gorie  grammaticale  et  le 
lemme), en voici un exemple ; les mots sont s&#233;par&#233;s par des tirets bas :
&#8230;._cat=VERB@be3sp:lem=be_cat=DET:lem=a_cat=NOUN@sing:lem=design_cat=N
OUN@sing:lem=concept_cat=PREP@in:lem=for_cat=DET:lem=a_...
Les r&#232;gles d'extraction de terminologie sont du type suivant :
[cat1=DET_cat2=NOUN_cat3=NOUN_lem4=for#lem2_lem3]
Dans cet exemple, la correspondance entre le texte analys&#233; et la r&#232;gle d'extraction se fait  
successivement sur le  DET/a,  NOUN/design,  NOUN/concept, et  lem/for. Le terme extrait 
est design concept.
Cette  m&#233;thode  permet  non  seulement  d'identifier  des  patrons,  mais  aussi  de  les 
contextualiser  (design concept  est extrait  entre  DET/a  et lem/for). Nous avons ici  une 
contribution &#224; la question de la   &#171; termicit&#233; &#187;  (&#171; termhood &#187; en anglais :  la  s&#233;quence 
extraite est-elle vraiment un &#171; vrai &#187; terme ?) des termes candidats extraits (Robitaille et 
al.,  2006). De plus,  cette  m&#233;thode  est  facilement adaptable :  les  r&#232;gles  peuvent  &#234;tre 
modifi&#233;es ou ajout&#233;es par simple &#233;dition d'un fichier externe.
</p>
<p>3.3 Phase 3 : G&#233;n&#233;ration d'une liste de candidats cibles pour chacun des 
termes compos&#233;s sources
</p>
<p>3.3.1 Modifications de l'approche classique
</p>
<p>417</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>i) Modification des unit&#233;s lexicales par variation morphologique
</p>
<p>Supposons  que  l'un  des  termes  sources  extraits  en  Phase  2  soit  production  annuelle, 
lemmatis&#233;  en  production  annuel,  et que  dans  le  dictionnaire  bilingue,  production soit 
traduit  par  production et  output,  et  annuel soit  traduit  par  yearly et  annual.  Alors 
l'approche compositionnelle consiste en phase 3 &#224; combiner les traductions : production 
yearly,  yearly  production,  production  annual,  annual  production,  output  yearly,  yearly  
output,  output  annual,  annual  output.  Et  la  phase  4  &#224;  s&#233;lectionner  les  termes  qui 
apparaissent  dans  la  liste  de  termes  compos&#233;s  cibles  extraite  en  Phase  2 :  yearly  
production et annual production. Le seul fait qu'ils apparaissent dans le texte source &#233;tant 
discriminant.
Mais  pour  le  terme  biologie  tumorale qui  est  traduit  en  anglais  par  tumor  biology, le 
substantif  tumor n'est pas la traduction de l'adjectif  tumorale, mais du substantif d&#233;riv&#233; 
de la m&#234;me famille : tumeur.
Cette difficult&#233; peut &#234;tre r&#233;solue par variation graphique, morphologique, lexicale, ou 
syntaxique des &#233;l&#233;ments constituant les termes compos&#233;s  (Morin &amp; Daille, 2009). Nous 
traitons les d&#233;rivations lexicales par l'application de r&#232;gles de d&#233;rivation. Dans le cas de 
notre exemple, la lemmatisation ayant transform&#233; biologie tumorale en biologie tumoral, la 
r&#232;gle : oral &#8594; eur permet de transformer l'adjectif tumoral en le nom tumeur qui sera bien 
traduit par  tumor.  Dans le prototype, les r&#232;gles sont consign&#233;es dans un fichier  texte 
pour chaque langue. L'utilisateur peut ajouter ou modifier ces r&#232;gles par l'&#233;dition de ces  
fichiers. 
ii) Combinaison
</p>
<p>Ordre de combinaison
Les  unit&#233;s  lexicales  des  mots  compos&#233;s  sources  sont  combin&#233;es  pour  chacune  des 
variations g&#233;n&#233;r&#233;es pr&#233;c&#233;demment. Pour une variation fix&#233;e, un mot compos&#233; ABC de 
longueur N, pr&#233;sente alors N! combinaisons de longueur N. Voici une illustration :
ABC
</p>
<p> 
&#8594; CAB, ACB, ABC ; CBA, BCA, BAC (N=3, 3!=6)
</p>
<p>L'ensemble de ces permutations sont construites par r&#233;currence sur N, illustr&#233;e ici par le 
positionnement de 'C' sur les diff&#233;rentes permutations de AB.
Profondeur de recherche
Dans la r&#233;currence, nous gardons les sous-permutations de dimension N-p, et nommons 
p : &#171; profondeur de recherche &#187; de combinaison d'unit&#233;s lexicales. Notons que pour une 
profondeur p, le nombre de combinaisons est Ap
</p>
<p>N
=(N) !/(N-p) !
</p>
<p>Cela permet, apr&#232;s traduction, de g&#233;n&#233;rer des termes candidats de longueur diff&#233;rente. 
C'est une r&#233;ponse possible au probl&#232;me de fertilit&#233; (Morin &amp; Daille, 2009).
3.3.2 R&#233;duction du nombre de permutations
Chacune des combinaisons sources est traduite.  Nous utilisons simplement un lexique 
bilingue pour effectuer le transfert de la langue source &#224; la langue cible.
</p>
<p>418</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour r&#233;duire  le  nombre de combinaisons traduite,  nous cherchons  avant traduction 
l'ensemble  des  traductions  de  variantes  d'unit&#233;s  lexicales  trouv&#233;es  en  (ii)  dans  le 
dictionnaire. Les variantes qui ne poss&#232;dent pas de traduction, ou dont les traductions 
n'apparaissent  pas  parmi  les  composants  des  termes  cibles  extraits  en  Phase  2  sont 
&#233;limin&#233;es avant combinaison, r&#233;duisant de fa&#231;on importante cette complexit&#233;.
</p>
<p>3.4  Phase  4  :  Projection  des  candidats  cibles  sur  la  liste  des  Termes 
Compos&#233;s Cibles extraits.
</p>
<p>La s&#233;lection des meilleurs candidats cibles construits en phase 3 se fait par &#171; projection &#187;.
</p>
<p>4 Exp&#233;riences et R&#233;sultats
</p>
<p>4.1 Exp&#233;rience 1 : Wikip&#233;dia, fran&#231;ais anglais, 935 termes candidats
</p>
<p>Corpus
</p>
<p>Nous  avons  t&#233;l&#233;charg&#233;  manuellement  13  articles  Wikip&#233;dia  fran&#231;ais  (source)  et  15 
anglais (cible) li&#233;s au th&#232;me de l'&#233;nergie &#233;olienne. Apr&#232;s l'application d'un filtre retirant 
les m&#233;tadonn&#233;es, les balises, et les parties textuelles li&#233;s &#224; la navigation de Wikip&#233;dia, 
nous  avons  obtenu  36077  tokens  fran&#231;ais  et  39761  tokens  anglais.  L'analyse  de 
TreeTagger nous a permis d'identifier les lemmes et cat&#233;gories grammaticales.
Extraction de termes monolingues candidats
</p>
<p>L'extraction  monolingue  de  candidats  sources  fran&#231;ais  donne  846  termes  compos&#233;s 
fran&#231;ais  et  935  termes  compos&#233;s  anglais  de  longueur  comprise  entre  2  et  5  unit&#233;s 
lexicales, comme autonomie &#233;nerg&#233;tique en fran&#231;ais, ou encore vertical axis wind turbine en 
anglais. En voici quelques caract&#233;ristiques de description statistique :
</p>
<p>Termes 
initiaux
</p>
<p>Freq 
min.
</p>
<p>Freq 
Max.
</p>
<p>Freq. 
Moy.
</p>
<p>Freq. = 1 Freq. = 2 Freq 3-5 Freq 6-10 Freq &gt; 10
</p>
<p>FR 846 1 62 1,5 703 (83%) 94 (11%) 34 (4%) 9 (1%) 6 (0,7%)
EN 935 1 56 1,4 772 (83%) 121 (13%) 35 (4%) 0 (0%) 7 (0,7%)
</p>
<p>TABLE 1 &#8211; R&#233;partition statistique des mots compos&#233;s monolingues candidats &#8211; Wikipedia 
- &#201;oliennes &#8211; FR - EN
</p>
<p>Alignement de Termes
Nous utilisons le dictionnaire ELRA fran&#231;ais anglais contenant 103.190 entr&#233;es fran&#231;aises 
correspondant &#224; 238.742 traductions. L'alignement compositionnel entre les 846 termes 
sources fran&#231;ais et les 935 termes cibles anglais est r&#233;alis&#233; aux profondeurs 0 (longueur 
N),  1  (longueur&gt;=N-1,  et  2.  (&gt;=N-2).  L'alignement  des  termes  a  &#233;t&#233;  &#233;valu&#233; 
</p>
<p>419</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>manuellement. Une erreur est de type A si la traduction est partielle, de type B si la 
traduction est compl&#232;tement fausse. Les r&#233;sultats sont rassembl&#233;s ici :
</p>
<p>Profondeur Nb align&#233;s Nb Erreurs A Nb Erreurs B Rappel Pr&#233;cision Score F
</p>
<p>0 79 1 (1,2%) 5 (6,3%) 9,3% 92,4% (74) 5,9
1 94 2 (2,5%) 5 (6,3%) 11% 91,1% (73) 5,1
2 144 49 (34%) 12 (8,3%) 17% 57,6% (83) 3,8
</p>
<p>TABLE 2 &#8211; Statistiques d'alignement bilingue suivant la profondeur de recombinaison  &#8211; 
Wikipedia - &#201;oliennes &#8211; FR - EN
</p>
<p>On enregistre  un  taux  de  pr&#233;cision  TOP1 de  92,4% en  profondeur  0  et  de  91,1  en 
profondeur 1, pour une l&#233;g&#232;re am&#233;lioration du rappel. Le traitement de la fertilit&#233; est 
am&#233;lior&#233; par la prise en compte de traductions anglaises poss&#233;dant les m&#234;mes lex&#232;mes 
que le fran&#231;ais, sans pr&#233;position. Ex :  production de &#233;lectricit&#233;  |  electricity production. Ce 
taux chute pour la profondeur 2. Voici la r&#233;partition des termes align&#233;s suivant leur 
nombre d'occurrence dans le corpus, pour la profondeur 1 :
</p>
<p>Termes 
align&#233;s
</p>
<p>Freq 
min.
</p>
<p>Freq 
Max.
</p>
<p>Freq. 
Moy.
</p>
<p>Freq. = 1 Freq. = 2 Freq 3-5 Freq 6-10 Freq &gt; 10
</p>
<p>FR 94 1 62 4,4 53 (56%) 12 (13%) 12 (13%) 7 (7%) 10 (11%)
EN 94 1 23 2,5 63 (67%) 13 (13%) 11 (12%) 0 (0%) 7 (7%)
</p>
<p>TABLE 3 &#8211; R&#233;partition des mots compos&#233;s align&#233;s &#8211; Wikipedia - &#201;oliennes &#8211; FR - EN
</p>
<p>Plus de la moiti&#233; de l'effectif sont des hapax, et deux tiers sont de fr&#233;quence inf&#233;rieure 
ou  &#233;gale  &#224;  2.  Cela  montre  que  la  m&#233;thode  compositionnelle  est  tr&#232;s  adapt&#233;e  &#224; 
l'alignement de termes de tr&#232;s basse fr&#233;quence. On note cependant, en comparant ce 
tableau au tableau de r&#233;partition de l'ensemble de l'effectif, que les mots compos&#233;s de 
plus hautes fr&#233;quences ont proportionnellement une tendance &#224; mieux s'aligner que ceux 
de basse fr&#233;quence : le quartile des mots compos&#233;s align&#233;s de fr&#233;quence sup&#233;rieure &#224; 10 
est de 11% pour le fran&#231;ais, alors que seulement 0,7% de l'ensemble des mots compos&#233;s 
fran&#231;ais extraits en Phase 2 ont une telle fr&#233;quence. Il est int&#233;ressant de noter que pour 
ce corpus, contrairement au corpus suivant, l'application de r&#232;gles morphologiques ne 
fourni que peu de r&#233;sultats : 3 termes 94.
</p>
<p>4.2 Exp&#233;rience 2 : Corpus m&#233;dical, fran&#231;ais anglais
</p>
<p>Le module d'alignement de termes &#233;tant ind&#233;pendant du module d'extraction de termes 
du corpus, nous avons pu tester l'alignement en profondeur 0 d'une liste de termes d&#233;j&#224; 
extraite,  issue  d'un  corpus  m&#233;dical  sp&#233;cialis&#233;  sur  le  cancer  du  sein  de  3483  termes 
compos&#233;s fran&#231;ais avec une liste de 6642 termes compos&#233;s anglais. Aussi, nous ne nous  
int&#233;ressons ici qu'&#224; l'analyse de l'alignement de termes compos&#233;s.
</p>
<p>420</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Align&#233;s classique morpho Erreurs A Erreurs B Rappel Pr&#233;cision
</p>
<p>808 702 (87%) 106 (13%) 2%  0,5% 24 % 97,5 %
</p>
<p>TABLE 4 &#8211; Statistique d'alignement de mots compos&#233;s &#8211; Cancer du sein &#8211; FR &#8211; EN
La  pr&#233;cision  est  tr&#232;s  forte,  pour  un  rappel  significatif.  On  note  ici  l'importance  des 
variations morphologiques puisqu'elles engendrent 13% des solutions.
</p>
<p>4.3 Exp&#233;rience 3 : Corpus m&#233;dical, fran&#231;ais japonais
Nous  avons  test&#233;  l'alignement  entre  23487  mots  compos&#233;s  fran&#231;ais  et  26188  mots 
compos&#233;s japonais extraits d'un corpus m&#233;dical sur le diab&#232;te et l'ob&#233;sit&#233;. Ces listes ne 
sont pas bien nettoy&#233;es : des dates et des extractions ne correspondant pas &#224; des termes 
complets  subsistent.  Le  petit  dictionnaire  g&#233;n&#233;raliste  utilis&#233;  est  celui  de  Jean-Marc 
Desperrier1 (18039 entr&#233;es fran&#231;aises, 32444 traductions japonaises). Nous n'avons pas 
de donn&#233;es  sur le  degr&#233;  de  comparabilit&#233;  de  ce corpus.  Les  r&#233;sultats  confirment  la 
bonne pr&#233;cision de la m&#233;thode, et l'importance des variations morphologiques.
</p>
<p>Align&#233;s classique morpho Erreurs A Erreurs B Rappel Pr&#233;cision
</p>
<p>140 85 (61%) 55 (39%) 5% 3% 0,6% 92%
TABLE 5 &#8211; Statistique d'alignement de mots compos&#233;s &#8211; Diab&#232;te - Ob&#233;sit&#233; &#8211; FR &#8211; JP
</p>
<p>5 Conclusions et perspectives
</p>
<p>Cette  &#233;tude  montre  la  tr&#232;s  bonne  pr&#233;cision  de  la  m&#233;thode  compositionnelle,  en 
particulier pour les hapax et les termes tr&#232;s peu fr&#233;quents. Nos r&#233;sultats confirment ceux 
de (Morin &amp; Daille, 2009) qui obtiennent des taux de pr&#233;cision de 88 % pour des termes 
compos&#233;s de basse fr&#233;quence.  Ainsi que ceux de (Robitaille et al., 2006) qui obtiennent 
des pr&#233;cisions comprises entre 49% et 92% sur une extraction fran&#231;ais &#8211; japonais. Ces 
derniers  mesurent  un  rappel  &#233;lev&#233;,  calcul&#233;  sur  une  population  restreinte  des  termes 
fran&#231;ais et japonais v&#233;rifiant dans chaque langue une coh&#233;rence forte avec une liste de  
graines bilingues (test de Jacquard &gt;= 0,01), alors que nous n'imposons pas de telle 
restriction. Les raisons g&#233;n&#233;rales du faible rappel ont &#233;t&#233; identifi&#233;es dans des travaux 
pr&#233;c&#233;dents : non-compositionnalit&#233; des termes compos&#233;s et couverture des dictionnaires 
bilingues (Morin &amp; Daille 2009).
</p>
<p>Remerciements
</p>
<p>Ce travail, qui s&#8217;inscrit dans le cadre du projet METRICC (www.metricc.com), a b&#233;n&#233;fici&#233; 
d&#8217;une aide de l&#8217;Agence Nationale de la Recherche portant la r&#233;f&#233;rence ANR-08-CORD-
009.  Merci  &#224; Koichi  Takeuchi pour sa coop&#233;ration et &#224; Emmanuel Morin et B&#233;atrice 
1http://dico.fj.free.fr/dico.php   [15 janvier 2012]
</p>
<p>421</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Daille pour leurs conseils.
</p>
<p>R&#233;f&#233;rences
BARONI, M., &amp; BERNARDINI,  S. BOOTCAT (2004). Bootstrapping corpora and terms from 
the web. Dans E. L. R. A. Elra (&#201;d.),  Proceedings of LREC (Vol. 2004, p. 1313&#8211;1316). 
ELRA.
DAILLE, B. (2003). Conceptual Structuring through Term Variations. Proceeding MWE  &#8217;03  
Proceedings of the ACL 2003 workshop on Multiword expressions: analysis, acquisition and  
treatment - Volume 18.
DE GROC,  C. (2011).  Babouk&#8239;:  Focused  Web  Crawling  for  Corpus  Compilation  and 
Automatic  Terminology  Extraction.  Proceedings  of  the  IEEEWICACM  International  
Conferences on Web Intelligence, 497&#8211;498.
D&#201;JEAN,  H.,  &amp; GAUSSIER,  E.  (2011).  Une nouvelle approche &#224; l&#8217;extraction de lexiques 
bilingues &#224; partir de corpus comparables hal. Lexicometra.
FUNG,  P. (1995).  Compiling  Bilingual  Lexicon  Entries  from  a  Non-Parallel  English-
Chinese Corpus. Proceedings of the Third Workshop on Very Large Corpora (p. 173&#8211;183).
FUNG,  P.  (1998).  A  Statistical  View  on  Bilingual  Lexicon  Extraction:  From  Parallel 
Corpora to Non-Parallel Corpora. Parallel Text Processing (p. 1&#8211;17). Springer.
LAROCHE,  A.,  &amp;  LANGLAIS,  P. (2010).  Revisiting  Context-based Projection  Methods  for 
Term-Translation Spotting in Comparable Corpora. COLING (p. 617-625).
MORIN, E., &amp; DAILLE, B. (2009). Compositionality and lexical alignment of multi-word 
terms. Language Resources and Evaluation.
ROBITAILLE, X., SASAKI, Y., TONOIKE, M., SATO, S., &amp; UTSURO, T. (2006). Compiling French-
Japanese Terminologies from the Web. EACL.
SCHMID,  H.  (1994).  Probabilistic  Part-of-Speech  Tagging  Using  Decision 
Trees.  Proceedings of the International Conference on New Methods in Language Processing. 
Manchester, United Kingdom.
TAKEUCHI, K., KAGEURA, K., KOYAMA, T., DAILLE, B., &amp; ROMARY, L. (2009). Pattern Based 
Term Extraction Using ACABIT System. CoRR.
YU,  K.,  &amp; TSUJII,  J. (2009).  Extracting Bilingual Dictionary from Comparable Corpora 
with Dependency Heterogeneity. HLT-NAACL (Short Papers) (p. 121-124).
</p>
<p>422</p>

</div></div>
</body></html>