<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un annotateur automatique d'expressions temporelles du fran&#231;ais et son &#233;valuation sur le TimeBank du fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 463&#8211;470,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Un annotateur automatique d&#8217;expressions temporelles du
fran&#231;ais et son &#233;valuation sur le TimeBank du fran&#231;ais
</p>
<p>Andr&#233; Bittar Caroline Hag&#232;ge
XRCE, 6 Chemin de Maupertuis, 38240 Meylan, FRANCE
Andre.Bittar@xrce.xerox.com, Caroline.Hagege@xrce.xerox.com
</p>
<p>R&#201;SUM&#201;
Dans cet article, nous pr&#233;sentons un outil d&#8217;extraction et de normalisation d&#8217;un sous-ensemble
d&#8217;expressions temporelles d&#233;velopp&#233; pour le fran&#231;ais. Cet outil est mis au point et utilis&#233; dans
le cadre du projet ANR Chronolines1 et il est appliqu&#233; sur un corpus fourni par l&#8217;AFP. Notre
but final dans le cadre du projet est de construire semi-automatiquement des chronologies
&#233;v&#233;nementielles &#224; partir de la base de dep&#234;ches de l&#8217;AFP. L&#8217;une des &#233;tapes du traitement est
l&#8217;analyse de l&#8217;information temporelle v&#233;hicul&#233;e dans les textes. Nous avons donc d&#233;velopp&#233; un
annotateur d&#8217;expressions temporelles pour le fran&#231;ais que nous d&#233;crivons dans cet article. Nous
pr&#233;senterons &#233;galement les r&#233;sultats de son &#233;valuation.
</p>
<p>ABSTRACT
An Automatic Temporal Expression Annotator and its Evaluation on the French TimeBank
</p>
<p>In this article, we present a tool that extracts and normalises a subset of temporal expressions in
French. This tool is being developed and used in the ANR (French National Research Agency)
project Chronolines, applied to a corpus of provided by the Agence France Presse. The aim of
the project is to semi-automatically construct event chronologies from this corpus. To do this,
a detailed analysis of the temporal information conveyed by texts, is required. The system we
present here is the first version of a temporal annotator that we have developed for French. We
describe it in this article and present the results of an evaluation.
</p>
<p>MOTS-CL&#201;S : Analyse temporelle, &#233;valuation.
</p>
<p>KEYWORDS: Temporal processing, evaluation.
</p>
<p>1 Introduction
</p>
<p>Le travail pr&#233;sent&#233; ici s&#8217;ins&#232;re dans un cadre plus ambitieux qui est la constitution semi-
automatique de chronologies &#233;v&#233;nementielles &#224; partir d&#8217;une requ&#234;te effectu&#233;e sur un grand
ensemble de dep&#234;ches de l&#8217;AFP pour le fran&#231;ais et pour l&#8217;anglais. Afin de pouvoir constituer
des chronologies &#233;v&#233;nementielles, il est capital de pouvoir analyser dans un premier temps le
contenu textuel (afin de rep&#233;rer les &#233;v&#233;nements) mais aussi de reconna&#238;tre et normaliser les
expressions temporelles associ&#233;es &#224; ces &#233;v&#233;nements. L&#8217;outil pr&#233;sent&#233; ici est un annotateur d&#8217;un
sous-ensemble d&#8217;expressions temporelles qui :
&#8211; rep&#232;re les expressions temporelles
</p>
<p>1ANR-10-CORD-010, http://www.chronolines.fr
</p>
<p>463</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; normalise ces expresssion temporelles
&#8211; rajoute des annotations concernant la modalit&#233; des &#233;v&#233;nements auxquels ces expressions se
</p>
<p>rapportent
Dans une premi&#232;re partie, nous pr&#233;sentons un bref &#233;tat de l&#8217;art concernant l&#8217;analyse automatique
de la temporalit&#233; en g&#233;n&#233;ral et pour le fran&#231;ais en particulier. Puis nous d&#233;crivons l&#8217;outil que nous
avons d&#233;velopp&#233; pour le fran&#231;ais. Nous pr&#233;senterons enfin les r&#233;sultats obtenus par l&#8217;annotateur
en les comparant avec le TimeBank du fran&#231;ais (TBF), un corpus de textes en fran&#231;ais annot&#233;s
selon la norme ISO-TimeML (Pustejovsky et al., 2010).
</p>
<p>2 Etat de l&#8217;art
</p>
<p>L&#8217;analyse de la temporalit&#233; est un &#233;l&#233;ment important pour un grand nombre de t&#226;ches et de
ressources relevant du traitement informatique des textes. (Li et al., 2005) montre l&#8217;importance
de l&#8217;analyse de la composante temporelle pour les syst&#232;mes de Questions/R&#233;ponses. Pour le
r&#233;sum&#233; multi-document, l&#8217;ajout de la composante temporelle aide &#224; rep&#233;rer les &#233;l&#233;ments textuels
v&#233;hiculant une information similaire (Barzilay et Elhadad, 2002). Les grandes bases de connais-
sances constitu&#233;es automatiquement ou semi-automatiquement gr&#226;ce &#224; l&#8217;extraction d&#8217;information
textuelles s&#8217;enrichissent actuellement d&#8217;une composante temporelle (Wang et al., 2010). Par
ailleurs, la norme ISO-TimeML est aujourd&#8217;hui largement adopt&#233;e, tant dans le cadre de la mise
en place de ressources annot&#233;es avec des informations temporelles pour diverses langues dont le
fran&#231;ais (Bittar et al., 2011), mais aussi lors des comp&#233;titions TempEval (Pustejovsky et Verhagen,
2010) au cours desquelles divers outils d&#8217;annotation automatique des informations temporelles
sont &#233;valu&#233;s. Plus sp&#233;cifiquement pour le fran&#231;ais, outre le TimeBank mentionn&#233; ci-dessus,
plusieurs travaux visant &#224; l&#8217;analyse automatique de la temporalit&#233; ont vu le jour. Concernant
l&#8217;annotation et le typage des expressions temporelles (ET) nous pouvons citer les travaux de
(Battistelli et al., 2008) qui pr&#233;sente une repr&#233;sentation alg&#233;brique des expressions de type date,
de (Ehrmann et Hag&#232;ge, 2009) qui propose un typage des ET accompagn&#233; de crit&#232;res syntaxiques
et s&#233;mantiques, mais aussi dans le domaine de l&#8217;annotation automatique, l&#8217;outil d&#233;crit dans
(Parent et al., 2008), ainsi que celui de (Teiss&#232;dre et al., 2011).
</p>
<p>3 Description de l&#8217;annotateur
</p>
<p>L&#8217;annotateur que nous avons d&#233;velopp&#233; est int&#233;gr&#233; &#224; un analyseur linguistique (A&#239;t-Mokhtar et al.,
2002) qui produit une analyse syntaxique en d&#233;pendances &#224; partir d&#8217;un texte d&#8217;entr&#233;e (texte brut
ou XML). L&#8217;annotateur a &#233;t&#233; d&#233;velopp&#233; pour les besoins du projet Chronolines qui vise &#224; traiter le
corpus de d&#233;p&#234;ches (couvrant les ann&#233;es allant de 2004 &#224; 2011) mis &#224; disposition par l&#8217;Agence
France-Presse. Ce corpus est constitu&#233; d&#8217;environ 1 million de documents (chaque document
correspondant &#224; une d&#233;p&#234;che) comprenant environ 9,4 millions d&#8217;expressions temporelles de
tout type. Ces d&#233;p&#234;ches sont disponibles dans un format XML (NewsML).
</p>
<p>Le module sp&#233;cifique pour la reconnaissance des expressions temporelles est constitu&#233; de plu-
sieurs &#233;l&#233;ments qui seront d&#233;taill&#233;s plus bas :
&#8211; Ajout d&#8217;information lexicale permettant de typer les adverbes de temps.
&#8211; R&#232;gles locales permettant de d&#233;limiter les ET et si possible de les typer. Ces r&#232;gles sont int&#233;gr&#233;es
</p>
<p>464</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#224; la grammaire g&#233;n&#233;rale de l&#8217;analyseur.
&#8211; R&#232;gles utilisant les d&#233;pendances syntaxiques permettant de proc&#233;der &#224; un typage plus fin de
</p>
<p>ces ET. Ces r&#232;gles sont &#233;galement int&#233;gr&#233;es &#224; la grammaire g&#233;n&#233;rale.
&#8211; Programme Java externe &#224; la grammaire qui utilise les informations linguistiques pour d&#233;sam-
</p>
<p>biguiser certaines expressions et pour proc&#233;der &#224; la normalisation des ET s&#233;lectionn&#233;es.
</p>
<p>3.1 Information lexicale
</p>
<p>L&#8217;information lexicale sp&#233;cifique &#224; l&#8217;analyse temporelle consiste essentiellement en l&#8217;ajout de
traits s&#233;mantiques sur des &#233;l&#233;ments lexicaux qui vont rentrer dans la composition d&#8217;une ET. Par
exemple, les noms de jours (e.g. lundi) se voient attribuer un trait sp&#233;cifique [day :+]. De m&#234;me,
les noms de mois, de f&#234;tes, des adverbes de temps seront marqu&#233;s dans le lexique.
</p>
<p>3.2 R&#232;gles locales
</p>
<p>Les r&#232;gles locales vont permettre d&#8217;assembler des &#233;l&#233;ments lexicaux quand ils peuvent poten-
tiellement correspondre &#224; une expression temporelle incluant plusieurs constituants de base.
Par exemple, une expression comme mi-mars 2012 est segment&#233;e originellement par l&#8217;analyseur
morphologique en 4 segments mi + - + mars + 2012. Une r&#232;gle locale regroupe ces quatre
segments afin de constituer une seule expression temporelle. Lors de l&#8217;application de ces r&#232;gles
locales, un premier typage des expressions temporelles est effectu&#233; dans le cas o&#249; celles-ci ne
sont pas ambigu&#235;s. Par exemple, une expression comme mi-mars 2012 peut &#234;tre typ&#233;e comme
une date absolue2 sans avoir recours au contexte .
</p>
<p>3.3 R&#232;gles de d&#233;pendances raffinant le typage
</p>
<p>Certaines expressions temporelles reconnues par une analyse lexicale ou par l&#8217;application de
r&#232;gles locales ne peuvent cependant pas &#234;tre typ&#233;es a priori. En effet, l&#8217;analyse de la seule
expression ne permet de d&#233;terminer de quel type d&#8217;expression il s&#8217;agit et seul un contexte
plus large permet de d&#233;sambigu&#239;ser. Parfois, une m&#234;me expression mettant en jeu des unit&#233;s
linguistiques constitutives d&#8217;une ET peut s&#8217;av&#233;rer, en contexte, ne pas &#234;tre une ET. Par exemple,
une expression telle que trois ans, n&#8217;est pas une ET dans (1) mais correspond &#224; une dur&#233;e
dans (2). L&#8217;expression en avril dans (3) correspond &#224; une date relative alors que dans (4), elle
correspond &#224; une date r&#233;currente (qui peut &#234;tre paraphras&#233;e par tous les mois d&#8217;avril).
</p>
<p>1. Jean f&#234;tera bient&#244;t ses trois ans.
</p>
<p>2. Il est rest&#233; trois ans sans la voir.
</p>
<p>3. Il &#233;tait malade en avril.
</p>
<p>4. En Avril, il fait le grand nettoyage de printemps.
</p>
<p>Gr&#226;ce &#224; l&#8217;analyse syntaxique sous-jacente, des restrictions utilisant &#224; la fois des informations
syntaxiques (fonction syntaxique de l&#8217;ET potentielle), et des informations s&#233;mantiques lexicales
</p>
<p>2nous d&#233;taillons &#224; la section 3.5 les diff&#233;rents types de dates que nous extrayons et la terminologie adopt&#233;e pour les
distinguer.
</p>
<p>465</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(verbe rester est un verbe de permanence), permettent de filtrer et de mieux typer des ET extraites
lors des &#233;tapes pr&#233;c&#233;dentes de traitement (analyse lexicale et r&#232;gles locales).
</p>
<p>3.4 Programme externe
</p>
<p>Une API java de l&#8217;analyseur permet d&#8217;&#233;tendre les traitements linguistiques et d&#8217;utiliser les r&#233;sultats
des analyses dans du code ext&#233;rieur &#224; l&#8217;analyseur. La normalisation3 des ET extraites est effectu&#233;e
par ce biais. Une fois de plus, &#224; ce stade, l&#8217;analyse des expressions temporelles est encore raffin&#233;e
afin de pouvoir proc&#233;der correctement &#224; la normalisation. Par exemple, une expression comme
lundi est une expression de type date relative par rapport au moment de l&#8217;&#233;nonciation (ME) mais
elle peut &#234;tre ant&#233;rieure ou post&#233;rieur au ME selon les contextes, ainsi qu&#8217;en t&#233;moignent les
exemples suivants.
</p>
<p>1. Elle est partie lundi.
</p>
<p>2. Elle partira lundi.
</p>
<p>3.5 Type de dates extraites reconnues
</p>
<p>Bien que nous d&#233;limitions tout type d&#8217;ET, nous avons mis l&#8217;accent pour une premi&#232;re utilisation
de l&#8217;annotateur sur la normalisation d&#8217;un sous-ensemble d&#8217;expressions temporelles qui est le
suivant :
</p>
<p>Nous consid&#233;rons les dates absolues, et les dates relatives au moment de l&#8217;&#233;nonciation qui
correspondent &#224; des intervalles born&#233;s ou &#224; des points. Nous avons pour ce faire d&#233;fini des
crit&#232;res de segmentation et de typage d&#233;crits dans (Bittar et al., 2012). Toutes ces dates que nous
extrayons doivent &#234;tre normalis&#233;es.
</p>
<p>Parmi ces expressions nous avons des ET comme En 2003, En janvier 2003, le 24 juin 2010, le
mois dernier, lundi, dans quatre mois, etc. Les trois premiers exemples sont des dates absolues,
les exemples suivants sont des dates relatives au ME dans la mesure o&#249; pour proc&#233;der &#224; la
normalisation de ces dates, il est n&#233;cessaire de conna&#238;tre la date correspondant &#224; l&#8217;assertion
durant laquelle cette date est mentionn&#233;e.
</p>
<p>3.6 Extraction d&#8217;information sur la modalit&#233;
</p>
<p>Dans le cadre plus large du projet, nous avons souhait&#233; distinguer les &#233;v&#233;nements dat&#233;s factuels
(c&#8217;est &#224; dire les &#233;v&#233;nements consid&#233;r&#233;s comme av&#233;r&#233;s par l&#8217;auteur de la d&#233;p&#234;che) des &#233;v&#233;nements
dat&#233;s hypoth&#233;tiques ou relevant du discours rapport&#233;. Dans la mesure o&#249; nous utilisons un
analyseur linguistique, nous disposons des liens syntaxiques entre l&#8217;ET extraite et le pr&#233;dicat
nominal ou verbal que cette ET modifie. La prise en compte de la modalit&#233; dans le traitement
de la temporalit&#233; est un vaste et riche domaine (voir (Battistelli, 2009) pour une pr&#233;sentation
d&#233;taill&#233;e) que nous n&#8217;avons pas consid&#233;r&#233; dans son ensemble. Nous avons cependant distingu&#233;
</p>
<p>3Nous entendons ici par normalisation le fait d&#8217;attribuer une valeur correspondante au calendrier (&#233;ventuellement
sous-sp&#233;cifi&#233;e) &#224; une ET.
</p>
<p>466</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&lt;DCT value=&quot;20040101&quot;/&gt;
L&#8217; &lt;EN TYPE=&quot;LOCORG&quot;&gt;Irlande&lt;/EN&gt; s&#8217;appr&#234;te &#224; prendre &lt;EC TYPE=&quot;DATE&quot;
SUBTYPE=&quot;REL&quot; REF=&quot;ST&quot; value =&quot;20040101&quot;&gt;jeudi&lt;/EC&gt; la pr&#233;sidence tournante de l&#8217;
&lt;EN TYPE=&quot;ORG&quot;&gt;Union europ&#233;enne&lt;/EN&gt; qui doit vivre &lt;EC TYPE=&quot;DATE&quot; SUBTYPE=&quot;REL&quot;
REF=&quot;ST&quot; value =&quot;20040501&quot; FACTUAL=&quot;MODAL&quot;&gt;le 1er mai&lt;/EC&gt; un &#233;largissement
historique...
</p>
<p>FIG. 1 &#8211; Exemple de sortie de l&#8217;annotateur.
</p>
<p>les cas suivants, qui se produisent de mani&#232;re assez fr&#233;quente sur les corpus que nous traitons et
qui nous semblent pertinents pour la finalit&#233; applicative que nous avons dans le cadre du projet.
</p>
<p>&#8211; L&#8217;expression temporelle se trouve dans une proposition dont le verbe principal est &#224; une forme
modale ou future.
</p>
<p>&#8211; L&#8217;expression temporelle se trouve dans une ench&#226;ss&#233;e qui rel&#232;ve du discours rapport&#233;.
&#8211; L&#8217;expression temporelle est associ&#233;e &#224; un verbe dicendi introduisant un discours rapport&#233;.
</p>
<p>Dans le premier cas, l&#8217;ET est soit le modifieur d&#8217;un verbe utilis&#233; &#224; une forme modale ou au futur
(information dont nous disposons gr&#226;ce &#224; l&#8217;analyse morpho-syntaxique), soit le modifieur d&#8217;un
nom argument d&#8217;un verbe utilis&#233; &#224; une forme modale ou future. L&#8217;exemple ci-dessous marque
l&#8217;ET en 2006 par un attribut FACTUAL=&quot;MODAL&quot; dans la mesure o&#249; le pr&#233;dicat auquel elle se
rapporte (s&#8217;achever) est employ&#233; &#224; une forme modale.
</p>
<p>Exemple :
Il a r&#233;affirm&#233; la primaut&#233; de son mandat de cinq ans , qui doit s&#8217;achever &lt;EC TYPE=&quot;DATE&quot;
SUBTYPE=&quot;ABS&quot; value =&quot;2006XXXX&quot; FACTUAL=&quot;MODAL&quot;&gt;en 2006&lt;/EC&gt;
</p>
<p>Dans le deuxi&#232;me cas, l&#8217;ET est modifieur d&#8217;un verbe d&#8217;une ench&#226;ss&#233;e d&#233;pendante d&#8217;un verbe
dicendi. Dans ce cas, l&#8217;annotation de l&#8217;ET est enrichie par l&#8217;attribut REPORTED=&quot;YES&quot;.
</p>
<p>Exemple :
Il a annonc&#233; que des &#233;lections se d&#233;rouleraient &lt;EC TYPE=&quot;DATE&quot; SUBTYPE=&quot;ABS&quot; value
=&quot;2004XXXX&quot; REPORTED=&quot;YES&quot; FACTUAL=&quot;MODAL&quot;&gt;en 2004&lt;/EC&gt;
</p>
<p>Enfin, dans le dernier cas, l&#8217;ET est modifieur d&#8217;un verbe marqu&#233; comme &#233;tant un verbe intro-
ducteur d&#8217;un discours rapport&#233;. Dans ce cas, l&#8217;annotation de l&#8217;ET comporte l&#8217;attribut DECLARA-
TION=&quot;YES&quot;.
</p>
<p>Exemple :
La Libye avait annonc&#233; &lt;EC TYPE=&quot;DATE&quot; SUBTYPE=&quot;REL&quot; REF=&quot;ST&quot;
DECLARATION=&quot;YES&quot; value =&quot;20031219&quot;&gt;le 19 d&#233;cembre&lt;/EC&gt; sa d&#233;cision de renoncer
aux armes de destruction massive.
</p>
<p>3.7 Exemple de sortie
</p>
<p>L&#8217;annotateur prend en entr&#233;e du texte brut ou un texte au format XML. Il produit en sortie un
texte au format XML qui correspond au texte initial enrichi par les annotations des ET que nous
avons d&#233;crites. Les entit&#233;s nomm&#233;es sont &#233;galement marqu&#233;es. Un exemple de sortie est illustr&#233;
dans la Figure 1.
</p>
<p>467</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Evaluation sur TimeBank
</p>
<p>Afin de pouvoir &#233;valuer notre outil, nous avons compar&#233; les annotations produites avec le corpus
TimeBank du fran&#231;ais (TBF) annot&#233; selon la norme ISO-TimeML. Cette &#233;valuation a n&#233;cessit&#233;
quelques adaptations afin de faire correspondre les sorties de l&#8217;outil d&#8217;analyse aux donn&#233;es de
TimeBank. Ces adaptations sont d&#233;crites ci-dessous. Par ailleurs, l&#8217;information concernant la
modalit&#233; et le discours rapport&#233; n&#8217;a pas &#233;t&#233; &#233;valu&#233;e.
</p>
<p>4.1 Adaptations
</p>
<p>Les adaptations ont &#233;t&#233; n&#233;cessaires pour trois raisons principales : la d&#233;limitation des ET selon
notre approche n&#8217;est pas tout &#224; fait semblable &#224; celle adopt&#233;e par la norme ISO-TimeML, nous ne
consid&#233;rons qu&#8217;un sous-ensemble des ET envisag&#233;es dans TBF et enfin, le format de normalisation
que nous adoptons est diff&#233;rent de celui de ISO-TimeML.
</p>
<p>Dans TBF, les balises qui marquent les ET (&lt;TIMEX3&gt;) n&#8217;incluent pas les &#233;ventuels marqueurs
de relation (ex. les pr&#233;positions temporelles telles que avant, apr&#232;s, etc.). En effet, la norme ISO-
TimeML pr&#233;conise de les annoter s&#233;par&#233;ment avec une autre balise (&lt;SIGNAL&gt;). Selon notre
sch&#233;ma d&#8217;annotation (Bittar et al., 2012) cependant, les marqueurs de relations sont annot&#233;s &#224;
l&#8217;int&#233;rieur d&#8217;une seule balise d&#233;limitant l&#8217;expression temporelle. Afin de r&#233;soudre cette diff&#233;rence,
nous avons converti le TimeBank selon notre format par application d&#8217;un simple transducteur
qui place le contenu textuel de la balise &lt;SIGNAL&gt; &#224; l&#8217;int&#233;rieur de la balise &lt;TIMEX3&gt; qui la
suit directement. Par ailleurs, notre annotateur a &#233;t&#233; adapt&#233; pour fournir une sortie contenant la
balise (&lt;SIGNAL&gt;). Nous obtenons donc pour ce type d&#8217;expression la repr&#233;sentation finale(1).
</p>
<p>1. &lt;TIMEX3&gt;&lt;SIGNAL&gt;depuis&lt; /SIGNAL&gt;mars 2003&lt; /TIMEX3&gt;
</p>
<p>Notre annotateur ne traite pour l&#8217;instant que des dates absolues et des dates relatives au moment
de l&#8217;&#233;nonciation correspondant &#224; des intervalles born&#233;s et dont la granularit&#233; n&#8217;est pas inf&#233;rieure
au jour. Nous avons donc retir&#233; du corpus TBF toutes les annotations des expressions ne cor-
respondant &#224; ces cat&#233;gories. Concr&#232;tement, toute balise &lt;TIMEX3&gt; ob&#233;issant &#224; l&#8217;un des quatre
crit&#232;res mentionn&#233;s ci-dessous a &#233;t&#233; supprim&#233;e du corpus de r&#233;f&#233;rence.
&#8211; l&#8217;attribut temporalFunction=&quot;true&quot; (qui indique qu&#8217;il s&#8217;agit d&#8217;une date relative) est pr&#233;-
</p>
<p>sent et l&#8217;attribut anchorTimeID est diff&#233;rent de t1 (la DCT). Ce crit&#232;re permet de retirer du
corpus de r&#233;f&#233;rence toutes les dates relatives &#224; un r&#233;f&#233;rent textuel.
</p>
<p>&#8211; l&#8217;attribut type a une des valeurs DURATION, SET ou TIME. Ce crit&#232;re permet de retirer du
corpus de r&#233;f&#233;rence toutes les dur&#233;es, les heures ou les agr&#233;gats temporels.
</p>
<p>&#8211; l&#8217;attribut value est PAST_REF, PRESENT_REF ou FUTURE_REF. Ce crit&#232;re permet de retirer
du corpus de r&#233;f&#233;rence toutes les expressions de dates floues.
</p>
<p>&#8211; la balise a l&#8217;attribut MOD indiquant que la date a un modifieur (de d&#233;but, de fin, d&#8217;approximation,
etc.). Ce crit&#232;re permet &#233;galement de retirer du corpus de r&#233;f&#233;rence des dates floues.
</p>
<p>Enfin, nous avons fait converger les formats de la valeur normalis&#233;e des ET afin d&#8217;obtenir une
repr&#233;sentation comparable entre TBF et les sorties de l&#8217;annotateur. Le corpus adapt&#233; pour notre
&#233;valuation contient 299 expressions temporelles annot&#233;es (sur les 608 du corpus original).
</p>
<p>468</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.2 Resultats pour le fran&#231;ais
</p>
<p>Les performances, en termes de rappel, pr&#233;cision et F-mesure, ainsi que la mesure kappa (Cohen,
1960), figurent dans le Tableau 1. Pour la d&#233;tection des expressions temporelles, les performances
sont satisfaisantes, mais peuvent encore &#234;tre am&#233;lior&#233;es. Les erreurs sont dues essentiellement &#224;
des manques de couverture dans la grammaire, qui est encore en cours de d&#233;veloppement. Aucune
erreur de typage des expressions n&#8217;a &#233;t&#233; commise. De tr&#232;s bons r&#233;sultats ont &#233;t&#233; obtenus pour
la normalisation des expressions. La principale source d&#8217;erreurs pour la normalisation provient
des cas o&#249; une ET appara&#238;t dans un contexte o&#249; elle n&#8217;est pas reli&#233;e par une d&#233;pendance &#224; un
pr&#233;dicat verbal. Ceci est parfois le cas lorsque la clause o&#249; appara&#238;t l&#8217;ET ne contient effectivement
pas de verbe, mais cela peut &#233;galement se produire suite &#224; une erreur de l&#8217;analyseur syntaxique.
Dans un de ces cas, le temps verbal est donc indisponible pour le calcul de la valeur correcte
normalisant l&#8217;ET. Enfin, lors de l&#8217;&#233;valuation, un certain nombre de d&#233;saccords entre la sortie du
syst&#232;me et la r&#233;f&#233;rence ont r&#233;v&#233;l&#233; des erreurs du TBF. Ces erreurs n&#8217;ont pas &#233;t&#233; prises en compte
pour l&#8217;&#233;valuation et elles ont &#233;t&#233; transmises au gestionnaire du corpus.
</p>
<p>Pr&#233;cision Rappel F-mesure Kappa
&#201;tendue des balises 0.90 0.84 0.87 0.71
Attribut type 1.0 1.0 1.0 1.0
Attribut value 0.94 1.0 0.96 0.92
</p>
<p>TAB. 1 &#8211; Performances du syst&#232;me sur l&#8217;ensemble du corpus d&#8217;&#233;valuation.
</p>
<p>5 Conclusion
</p>
<p>Nous avons d&#233;velopp&#233; une premi&#232;re version d&#8217;un outil d&#8217;analyse des ET du fran&#231;ais &#224; partir de
textes tout-venant. Nous avons utilis&#233; cet annotateur pour effectuer des exp&#233;riences visant &#224;
extraire les dates importantes mentionn&#233;es dans de grands volumes de texte. L&#8217;annotateur a &#233;t&#233;
&#233;valu&#233; gr&#226;ce au TimeBank du fran&#231;ais. L&#8217;&#233;largissement de cet annotateur &#224; d&#8217;autres types d&#8217;ET
est en cours (prise en compte d&#8217;autres des dates r&#233;f&#233;rentielles par rapport &#224; un r&#233;f&#233;rent introduit
dans le discours, des dates r&#233;p&#233;titives (fr&#233;quences dans la terminologie ISO-TimeML), et des
dates qui ne peuvent &#234;tre assimili&#233;e &#224; un point ou &#224; un intervalle temporel born&#233;).
</p>
<p>Remerciements
</p>
<p>Remerciement &#224; l&#8217;ANR qui a financ&#233; une partie de ce travail, ainsi qu&#8217;&#224; X. Tannier, R. Kessler et V.
Moriceau qui ont utilis&#233; et comment&#233; les sorties de l&#8217;annotateur. Nous remercions &#233;galement D.
Teyssou de l&#8217;AFP qui nous a donn&#233; acc&#232;s au corpus de d&#233;p&#234;ches.
</p>
<p>469</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>A&#207;T-MOKHTAR, S., CHANOD, J.-P. et ROUX, C. (2002). Robustness beyond Shallowness : Incremental
Deep Parsing. Natural Language Engineering, 8:121&#8211;144.
BARZILAY, R. et ELHADAD, N. (2002). Inferring Strategies for Sentence Ordering in Multidocument
News Summarization. Journal of Artificial Intelligence Research, 17:35&#8211;55.
BATTISTELLI, D. (2009). La temporalit&#233; linguistique : circonscrire un objet d&#8217;analyse ainsi que des
finalit&#233;s &#224; cette analyse. Universit&#233; Paris-Ouest Nanterre La D&#233;fense (Paris 10).
BATTISTELLI, D., COUTO, J., MINEL, J.-L. et SCHWER, S. (2008). Repr&#233;sentation alg&#233;brique des
expressions calendaires et vue calendaire d&#8217;un texte. In (Bechet et al., 2008).
BECHET, F., BELLOT, P., BONASTRE, J.-F. et JIMENEZ, T., &#233;diteurs (2008). Actes de TALN 2008
(Traitement automatique des langues naturelles), Avignon. ATALA, LIA.
BITTAR, A., AMSILI, P., DENIS, P. et DANLOS, L. (2011). French TimeBank : An ISO-TimeML
Annotated Reference Corpus. In Proceedings of the 49th Annual Meeting of the Association for
Computational Linguistics : Human Language Technologies : short papers, volume 2, Portland.
Association for Computational Linguistics.
</p>
<p>BITTAR, A., HAG&#200;GE, C., TANNIER, X., MORICEAU, V. et TEISS&#200;DRE, C. (2012). Temporal Annotation :
A Proposal for Guidelines and an Experiment with Inter-annotator Agreement. In Proceedings of
LREC 2012 - to appear, Istanbul. ELRA.
COHEN, J. (1960). A Coefficient of Agreement for Nominal Scales. Educational and Psychological
Measurement, 43(6):551&#8211;558.
EHRMANN, M. et HAG&#200;GE, C. (2009). Proposition de caract&#233;risation et de typage des expressions
temporelles en contexte. In (Nazarenko et Poibeau, 2009).
LI, W., LI, W., LU, Q. et WONG, K.-F. (2005). A Preliminary Work on Classifying Time Granularities
of Temporal Questions. In Proceedings of Second international joint conference in NLP (IJCNLP
2005), Jeju Island, Korea.
NAZARENKO, A. et POIBEAU, T., &#233;diteurs (2009). Actes de TALN 2009 (Traitement automatique des
langues naturelles), Senlis. ATALA, LIPN.
PARENT, G., GAGNON, M. et MULLER, P. (2008). Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;ne-
ments en fran&#231;ais. In (Bechet et al., 2008).
PUSTEJOVSKY, J., LEE, K., BUNT, H. et ROMARY, L. (2010). ISO-TimeML : An international standard
for semantic annotation. In CHAIR), N. C. C., CHOUKRI, K., MAEGAARD, B., MARIANI, J., ODIJK,
J., PIPERIDIS, S., ROSNER, M. et TAPIAS, D., &#233;diteurs : Proceedings of the Seventh International
Conference on Language Resources and Evaluation (LREC&#8217;10), Valletta, Malta. European Language
Resources Association (ELRA).
</p>
<p>PUSTEJOVSKY, J. et VERHAGEN, M. (2010). SemEval-2010 Task 13 : Evaluating Events, Time
Expressions, and Temporal Relations (TempEval-2).
</p>
<p>TEISS&#200;DRE, C., BATTISTELLI, D. et MINEL, J.-L. (2011). Recherche d&#8217;information et temps linguis-
tique : une heuristique pour calculer la pertinence des expressions calendaires. In Actes de TALN
2011 (Traitement automatique des langues naturelles), Montr&#233;al. ATALA.
WANG, Y., ZHU, M., QU, L., SPANIOL, M. et WEIKUM, G. (2010). Timely YAGO : Harvesting,
Querying, and Visualizing Temporal Knowledge from Wikipedia. In Proceedings of the 13th
</p>
<p>International Conference on Extending Database Technology (EDBT), Lausanne, Switzerland,
March 22-26, pages 697&#8211;700.
</p>
<p>470</p>

</div></div>
</body></html>