<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction d'information automatique en domaine m&#233;dical par projection inter-langue : vers un passage &#224; l'&#233;chelle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 15&#8211;28,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>TALN 2012, Grenoble, 4 &#8211; 8 juin 2012
</p>
<p>Extraction d&#8217;information automatique en domaine m&#233;dical
par projection inter-langue : vers un passage &#224; l&#8217;&#233;chelle
</p>
<p>Asma Ben Abacha* Pierre Zweigenbaum* Aur&#233;lien Max*
(*) LIMSI-CNRS, BP 133 91403 Orsay cedex
abacha@limsi.fr, pz@limsi.fr, aurelien.max@limsi.fr
</p>
<p>R&#201;SUM&#201;
Cette recherche est issue de notre volont&#233; de tester de nouvelles m&#233;thodes automatiques d&#8217;an-
notation ou d&#8217;extraction d&#8217;information &#224; partir d&#8217;une langue L1 en exploitant des ressources et
des outils disponibles pour une autre langue L2. Cette approche repose sur le passage par un
corpus parall&#232;le (L1-L2) align&#233; au niveau des phrases et des mots. Pour faire face au manque
de corpus m&#233;dicaux fran&#231;ais annot&#233;s, nous nous int&#233;ressons au couple de langues (fran&#231;ais-
anglais) dans le but d&#8217;annoter automatiquement des textes m&#233;dicaux en fran&#231;ais. En particulier,
nous nous int&#233;ressons dans cet article &#224; la reconnaissance des entit&#233;s m&#233;dicales. Nous &#233;valu-
ons dans un premier temps notre m&#233;thode de reconnaissance d&#8217;entit&#233;s m&#233;dicales sur le corpus
anglais. Dans un second temps, nous &#233;valuons la reconnaissance des entit&#233;s m&#233;dicales du corpus
fran&#231;ais par projection des annotations du corpus anglais. Nous abordons &#233;galement le probl&#232;me
de l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; des donn&#233;es en exploitant un corpus extrait du Web et nous proposons une
m&#233;thode statistique pour y pallier.
</p>
<p>ABSTRACT
Automatic Information Extraction in the Medical Domain by Cross-Lingual Projection
</p>
<p>This research stems from our willingness to test new methods for automatic annotation or infor-
mation extraction from one language L1 by exploiting resources and tools available to another
language L2. This approach involves the use of a parallel corpus (L1-L2) aligned at the level of
sentences and words. To address the lack of annotated medical French corpus, we focus on the
French-English language pair to annotate automatically medical French texts. In particular, we
focus in this article on medical entity recognition. We evaluate our medical entity recognition
method on the English corpus and the projection of the annotations on the French corpus. We
also discuss the problem of scalability since we use a parallel corpus extracted from the Web
and propose a statistical method to handle heterogeneous corpora.
</p>
<p>MOTS-CL&#201;S : Extraction d&#8217;information, projection d&#8217;annotation, reconnaissance des entit&#233;s
m&#233;dicales, apprentissage.
</p>
<p>KEYWORDS: Automatic Information Extraction, Annotation Projection, Medical Entity Recog-
nition, Machine Learning.
</p>
<p>15</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>L&#8217;extraction d&#8217;information vise &#224; extraire automatiquement &#224; partir de textes des informations
structur&#233;es pertinentes pour une t&#226;che particuli&#232;re (Poibeau, 2003). Il y a essentiellement deux
types de m&#233;thodes utilis&#233;es en extraction d&#8217;information : les m&#233;thodes o&#249; une personne (un
&#171; expert &#187;) fournit des connaissances (linguistiques ou sur le domaine) 1, et les m&#233;thodes dirig&#233;es
par les donn&#233;es, o&#249; ces connaissances sont construites par apprentissage supervis&#233;. Il existe
&#233;galement des m&#233;thodes hybrides combinant ces deux techniques. Ces deux types de m&#233;thodes
ont certaines limitations ((Bach et Badaskar, 2007), (Nadeau et Sekine, 2007), (Ben Abacha et
Zweigenbaum, 2011c)) :
&#8211; Les m&#233;thodes &#224; base de connaissances expertes sont simples &#224; mettre en place mais co&#251;teuses
</p>
<p>en temps pour ce qui est de la construction des connaissances. Elles ont aussi un potentiel de
couverture r&#233;duit compar&#233; aux m&#233;thodes statistiques.
</p>
<p>&#8211; Les m&#233;thodes par apprentissage peuvent &#234;tre tr&#232;s robustes si (i) on dispose d&#8217;un bon nom-
bre d&#8217;exemples d&#8217;entra&#238;nement et si (ii) le corpus de test est du m&#234;me type que le corpus
d&#8217;entra&#238;nement. Ces m&#233;thodes sont de fait d&#233;pendantes des donn&#233;es et des corpus annot&#233;s,
ressources qui ne sont pas disponibles pour toutes les langues (par exemple, il n&#8217;existe pas de
corpus m&#233;dicaux annot&#233;s en fran&#231;ais) ni pour toutes les t&#226;ches (par exemple, reconnaissance
des entit&#233;s m&#233;dicales, extraction de relations s&#233;mantiques, etc.).
</p>
<p>Cette observation s&#8217;applique aussi au domaine m&#233;dical : pour l&#8217;anglais, plusieurs outils sp&#233;cial-
is&#233;s d&#8217;extraction d&#8217;information existent (tels que MetaMap (Aronson, 2001), cTAKES (Guergana
K Savova et Chute, 2010)), ainsi que des corpus annot&#233;s en entit&#233;s nomm&#233;es (tels que i2b2
(Uzuner et al., 2011), Berkeley (Rosario et Hearst, 2004)). En revanche, peu de ressources sont
disponibles en fran&#231;ais : on ne trouve pas d&#8217;outils sp&#233;cialis&#233;s pour l&#8217;extraction d&#8217;information, ni
de corpus m&#233;dicaux annot&#233;s.
</p>
<p>L&#8217;annotation manuelle d&#8217;exemples pour l&#8217;entra&#238;nement peut &#234;tre une solution pour les m&#233;thodes
par apprentissage supervis&#233; ou semi-supervis&#233;. Cependant, cette t&#226;che n&#233;cessite des experts
du domaine cibl&#233;, au moins pour la validation. D&#8217;apr&#232;s nos exp&#233;riences pr&#233;c&#233;dentes portant
sur l&#8217;annotation manuelle de corpus m&#233;dicaux en fran&#231;ais constitu&#233;s (i) de r&#233;sum&#233;s d&#8217;articles
scientifiques et (ii) de textes extraits du corpus EQueR (Ayache, 2005), plusieurs obstacles ont
&#233;t&#233; mis en &#233;vidence. Dans une premi&#232;re phase, nous avons annot&#233; manuellement des textes
m&#233;dicaux avec le concours de deux m&#233;decins. L&#8217;obstacle principal &#233;tait le fait que la t&#226;che est
longue et fastidieuse. Ensuite, et pour acc&#233;ler la t&#226;che d&#8217;annotation, nous avons d&#233;velopp&#233; une
interface pour l&#8217;annotation de phrases (et non pas de textes entiers) permettant &#224; davantage de
m&#233;decins de prendre part &#224; l&#8217;annotation. Le premier inconv&#233;nient de cette m&#233;thode est la perte
du contexte des phrases. Un deuxi&#232;me inconv&#233;nient r&#233;side dans le fait que, m&#234;me si le guide
d&#8217;annotation est tr&#232;s d&#233;taill&#233;, les divergences dans les avis des m&#233;decins augmentent avec le
nombre de m&#233;decins intervenant (par exemple dans l&#8217;annotation des sympt&#244;mes et des relations
dans des textes dans le domaine psychiatrique). Ces divergences, portant par exemple sur les
types d&#8217;entit&#233;s m&#233;dicales et les relations &#224; annoter, peuvent ralentir le processus d&#8217;annotation
manuelle et le rendre moins fiable.
</p>
<p>Dans cet article, nous exploitons un autre type de m&#233;thode, la projection d&#8217;annotations d&#8217;une
langue &#224; une autre (Yarowsky et Ngai, 2001), et testons son application au domaine m&#233;dical.
L&#8217;id&#233;e g&#233;n&#233;rale consiste &#224; transf&#233;rer des annotations d&#8217;une langue L1 (pour laquelle plus de
</p>
<p>1. M&#233;thodes souvent appel&#233;es improprement &#171; &#224; base de r&#232;gles &#187;.
</p>
<p>16</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ressources sont disponibles) &#224; une langue L2 en utilisant des corpus parall&#232;les et leur aligne-
ment au niveau des mots. Cette approche devrait nous permettre d&#8217;exploiter, pour l&#8217;annotation
automatique de textes en fran&#231;ais, les ressources disponibles en anglais ainsi que les m&#233;th-
odes d&#8217;extraction d&#8217;information d&#233;velopp&#233;es pour cette m&#234;me langue. Notre premier objectif,
pr&#233;sent&#233; &#224; travers cet article, consiste &#224; annoter automatiquement les entit&#233;s m&#233;dicales de textes
en fran&#231;ais par transfert d&#8217;entit&#233;s d&#233;tect&#233;es dans les textes anglais correspondants par des outils
existants de reconnaissance d&#8217;entit&#233;s m&#233;dicales. La table 1 pr&#233;sente un exemple de ce que nous
cherchons &#224; obtenir.
</p>
<p>Phrase en anglais The role of carotid endarterectomy in the management of asymp-
tomatic carotid stenosis is much less clear.
</p>
<p>Phrase &#233;quivalente
en fran&#231;ais
</p>
<p>Le r&#244;le de l&#8217;endart&#233;riectomie carotidienne dans le traitement d&#8217;une
st&#233;nose carotidienne asymptomatique est beaucoup moins clairement
d&#233;fini.
</p>
<p>Alignement
au niveau des mots
</p>
<p>0-0 1-1 2-2 3-3 3-4 4-3 5-5 6-6 7-7 8-8 9-11 10-8 11-9 11-10 12-12
13-13 14-14 15-15 15-16
</p>
<p>Entit&#233;s m&#233;dicales
(en anglais)
</p>
<p>&quot;carotid endarterectomy&quot; 3&#8211;4 [treatment]
&quot;asymptomatic carotid stenosis&quot; 9&#8211;11 [problem]
</p>
<p>R&#233;sultat final
(annotations en
fran&#231;ais)
</p>
<p>&quot;l&#8217;endart&#233;riectomie carotidienne &quot; 3&#8211;4 [treatment]
&quot;une st&#233;nose carotidienne asymptomatique&quot; 8-11 [problem]
</p>
<p>TABLE 1 &#8211; Exemple illustratif de l&#8217;approche propos&#233;e
</p>
<p>Apr&#232;s un rappel des travaux similaires (section 2), nous pr&#233;sentons les deux &#233;tapes principales
de l&#8217;approche que nous proposons ici (telle qu&#8217;illustr&#233;e sur la figure 1) :
</p>
<p>1. L&#8217;extraction d&#8217;information &#224; partir de la partie L1 du corpus parall&#232;le, en utilisant des
m&#233;thodes d&#233;j&#224; d&#233;velopp&#233;es ou des outils disponibles (section 3). Pour ce faire, nous util-
isons une m&#233;thode &#224; base de connaissances expertes, MetaMapPlus (section 3.2) que nous
adaptons pour traiter des corpus h&#233;t&#233;rog&#232;nes (section 3.3).
</p>
<p>2. L&#8217;alignement des mots des parties L1 et L2 du corpus (section 4.1) et la projection des
entit&#233;s rep&#233;r&#233;es sur L1 vers la partie L2 en utilisant ces alignements (section 4.2). Nous
mettons en place quelques heuristiques pour r&#233;parer certaines erreurs et am&#233;liorer la
pr&#233;cision de la projection en diminuant le bruit des alignements.
</p>
<p>Nous &#233;valuons notre approche (section 5) sur une partie du corpus Sant&#233; Canada 2 et discutons
ses r&#233;sultats, puis concluons (section 6) sur des perspectives de travaux futurs 3.
</p>
<p>2 Travaux similaires
</p>
<p>Des travaux sur la projection d&#8217;analyses linguistiques ou d&#8217;annotations d&#8217;une langue &#224; l&#8217;autre se
sont d&#233;velopp&#233;s essentiellement &#224; partir des ann&#233;es 2000. Yarowsky et Ngai (2001) ont propos&#233;
</p>
<p>2. http://www.hc-sc.gc.ca
3. Ce travail a &#233;t&#233; partiellement soutenu par OSEO dans le cadre du programme Qu&#230;ro.
</p>
<p>17</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 1 &#8211; Approche propos&#233;e pour l&#8217;annotation automatique d&#8217;un corpus m&#233;dical fran&#231;ais,
utilisant un corpus parall&#232;le et des m&#233;thodes d&#8217;extraction d&#8217;information &#224; partir de textes anglais
</p>
<p>d&#8217;utiliser des corpus parall&#232;les align&#233;s au niveau des mots pour transf&#233;rer de fa&#231;on robuste de
l&#8217;anglais au fran&#231;ais ou au chinois des &#233;tiquettes morphosyntaxiques et des fronti&#232;res de syn-
tagmes nominaux. Lopez et al. (2002) ont &#233;tudi&#233; comment transf&#233;rer un arbre de d&#233;pendances
de l&#8217;anglais vers le chinois. L&#252; et al. (2002) se sont &#233;galement int&#233;ress&#233;s au transfert d&#8217;analyses
syntaxiques de l&#8217;anglais vers le chinois Pad&#243; et Pitel (2007) ont trait&#233; le probl&#232;me de l&#8217;annota-
tion automatique de r&#244;les s&#233;mantiques dans une langue ne disposant pas de lexique FrameNet 4,
en s&#8217;int&#233;ressant au couple de langue (anglais-fran&#231;ais).
</p>
<p>Dans le domaine m&#233;dical, plusieurs travaux ont attaqu&#233; le transfert de connaissances d&#8217;une
langue &#224; une autre (N&#233;v&#233;ol et al., 2005; Del&#233;ger et al., 2006). En particulier, Del&#233;ger et al. (2009)
se sont int&#233;ress&#233;s &#224; l&#8217;acquisition de nouvelles traductions de termes issues de trois terminologies
diff&#233;rentes (&#171;MeSH&#187;, &#171;SNOMED CT&#187; et &#171;the MedlinePlus Health Topics&#187;). Ces auteurs se sont
bas&#233;s sur l&#8217;alignement des mots &#224; partir d&#8217;un corpus parall&#232;le anglais-fran&#231;ais.
</p>
<p>3 Reconnaissance d&#8217;entit&#233;s m&#233;dicales dans des textes anglais
</p>
<p>Dans cette section, nous pr&#233;sentons la t&#226;che de Reconnaissance des Entit&#233;s M&#233;dicales (REM)
(section 3.1). Ensuite, nous d&#233;crivons notre m&#233;thode &#224; base de connaissances expertes pour la
REM &#224; partir de textes anglais (section 3.2). L&#8217;application de cette m&#233;thode sur des grands vol-
umes de donn&#233;es h&#233;t&#233;rog&#232;nes a r&#233;v&#233;l&#233; certains probl&#232;mes li&#233;s &#224; l&#8217;ambiguit&#233; de certains termes.
Nous proposons dans la section 3.3 une solution pour pallier cette ambiguit&#233; : un filtre statis-
tique utilis&#233; en amont pour am&#233;liorer la pr&#233;cision des entit&#233;s extraites. En effet, en vue de la
projection vers un autre corpus &#224; des fins de d&#233;tection d&#8217;entit&#233;s correctes dans la langue cible,
il est fortement souhaitable que les entit&#233;s du corpus source soient correctes : c&#8217;est ce que vise &#224;
obtenir le filtrage mis en place, qui privil&#233;gie la pr&#233;cision par rapport au rappel.
</p>
<p>4. http://framenet.icsi.berkeley.edu/fndrupal/
</p>
<p>18</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.1 Description de la t&#226;che de reconnaissance d&#8217;entit&#233;s m&#233;dicales
</p>
<p>La REM est la t&#226;che de base de l&#8217;extraction d&#8217;information &#224; partir de textes m&#233;dicaux. Nous
d&#233;signons par &#171; entit&#233; m&#233;dicale &#187; une instance d&#8217;un concept m&#233;dical ou une cat&#233;gorie g&#233;n&#233;rique
(par exemple, l&#8217;Alzheimer est une instance de la cat&#233;gorie &#171; Maladie &#187;, la laryngoscopie est une
instance de &#171; Examen &#187;). Cette d&#233;finition soul&#232;ve deux questions : (i) quelle est la liste des
cat&#233;gories m&#233;dicales trait&#233;es (Probl&#232;me m&#233;dical, Examen, Traitement, etc.) et (ii) quelle est la
d&#233;finition exacte de chaque cat&#233;gorie (par exemple, les plantes peuvent-elles &#234;tre consid&#233;r&#233;es
comme des traitements ?). Dans cet article nous travaillons sur les trois grandes cat&#233;gories les
plus importantes dans le domaine m&#233;dical, &#224; savoir : &#171; Probl&#232;me &#187;, &#171; Traitement &#187; et &#171; Examen &#187;.
Nous utilisons les types s&#233;mantiques de l&#8217;UMLS 5 pour d&#233;finir chaque cat&#233;gorie (cf. la table 2),
en suivant le guide d&#8217;annotation i2b2/VA 2010 (Uzuner et al., 2011).
</p>
<p>Cat&#233;gorie Types s&#233;mantiques de l&#8217;UMLS correspondants
Probl&#232;me Virus, Bacterium, Anatomical Abnormality, Congenital Abnormality, Acquired Abnormal-
</p>
<p>ity, Sign or Symptom, Pathologic Function, Disease or Syndrome, Mental or Behavioral
Dysfunction, Neoplastic Process, Cell or Molecular Dysfunction, Injury or Poisoning
</p>
<p>Traitement Medical Device, Drug Delivery Device, Clinical Drug, Steroid, Pharmacologic Substance,
Antibiotic, Biomedical or Dental Material, Therapeutic or Preventive Procedure
</p>
<p>Examen Laboratory Procedure, Diagnostic Procedure.
</p>
<p>TABLE 2 &#8211; Les cat&#233;gories m&#233;dicales trait&#233;es
</p>
<p>La reconnaissance des entit&#233;s m&#233;dicales consiste en (i) le rep&#233;rage des termes m&#233;dicaux dans
les textes (tels que beta cell replacement, pyogenic liver abscess, infection of biliary system, etc.) et
(ii) l&#8217;identification de la cat&#233;gorie s&#233;mantique des termes rep&#233;r&#233;s (telles que Maladie, M&#233;dica-
ment, Examen, etc.). L&#8217;exemple suivant illustre les r&#233;sultats de la REM pour une phrase extraite
d&#8217;un r&#233;sum&#233; MEDLINE. Les termes m&#233;dicaux sont annot&#233;s par des &#233;tiquettes &lt;Treatment&gt; et
&lt;Disease&gt;.
</p>
<p>&lt;Treatment&gt; Adrenal-sparing surgery &lt;/Treatment&gt; is safe and effective , and may become
the treatment of choice in patients with &lt;Disease&gt; hereditary phaeochromocytoma &lt;/Disease&gt;.
[PMID : 10027369]
</p>
<p>Ces deux &#233;tapes am&#232;nent &#224; effectuer des choix dans les cat&#233;gories m&#233;dicales &#224; traiter, mais
&#233;galement dans les r&#232;gles de d&#233;limitation des fronti&#232;res des entit&#233;s m&#233;dicales dans le texte.
Dans ce travail, nous avons effectu&#233; les choix suivants pour la d&#233;limitation des fronti&#232;res : (i)
inclure les possessifs, adjectifs, adverbes et chiffres dans les entit&#233;s nomm&#233;es (ii) annoter les
abr&#233;viations s&#233;par&#233;ment et (iii) ne pas annoter une entit&#233; m&#233;dicale incluse dans une autre.
</p>
<p>3.2 La m&#233;thode MetaMapPlus pour la reconnaissance d&#8217;entit&#233;s m&#233;dicales
</p>
<p>Le domaine m&#233;dical dispose de grandes bases terminologiques telles que l&#8217;UMLS (McCray et
Nelson, 1995) ainsi que d&#8217;outils qui permettent de d&#233;tecter les termes m&#233;dicaux. Un des outils
</p>
<p>5. L&#8217;UMLS (Unified Medical Language System) comporte (i) le Specialist Lexicon, lexique anglais incluant les termes
du domaine ainsi que leurs variations syntaxiques et morphologiques, (ii) le Metathesaurus, vocabulaire de plus de deux
millions de concepts (un concept &#171; regroupe &#187; des termes synonymes, acronymes et variantes terminologiques) et (iii)
le r&#233;seau s&#233;mantique qui organise les concepts en 135 &#171; types s&#233;mantiques &#187; et d&#233;finit 54 relations entre ces types.
</p>
<p>19</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>les plus largement utilis&#233;s est MetaMap (Aronson, 2001), un syst&#232;me &#224; base de connaissances
qui se fonde sur l&#8217;UMLS. MetaMap permet de segmenter les textes m&#233;dicaux en phrases et syn-
tagmes nominaux qui correspondent &#224; des termes m&#233;dicaux. L&#8217;outil identifie les entit&#233;s m&#233;di-
cales et leurs cat&#233;gories (concepts et types s&#233;mantiques du r&#233;seau s&#233;mantique UMLS). Cepen-
dant l&#8217;&#233;tude de l&#8217;utilisation simple de MetaMap a r&#233;v&#233;l&#233; qu&#8217;il pr&#233;sente certains probl&#232;mes. Afin
d&#8217;am&#233;liorer la pr&#233;cision des r&#233;sultats de MetaMap, nous avons propos&#233; la m&#233;thode MetaMapPlus
(Ben Abacha et Zweigenbaum, 2011a), qui comporte les quatre &#233;tapes suivantes :
&#8211; Extraire les syntagmes nominaux &#224; l&#8217;aide d&#8217;un segmenteur (chunker). Nous utilisons
</p>
<p>TreeTagger-chunker qui offre une bonne segmentation et permet de diminuer le bruit de
la REM (voir (Ben Abacha et Zweigenbaum, 2011c) pour une comparaison de trois seg-
menteurs).
</p>
<p>&#8211; Filtrer les syntagmes candidats avec une liste de mots vides en amont de MetaMap.
&#8211; Rechercher les termes candidats dans des listes d&#8217;entit&#233;s m&#233;dicales construites &#224; partir du
</p>
<p>Web.
&#8211; Pour le reste des termes candidats, d&#233;terminer leurs cat&#233;gories avec MetaMap, apr&#232;s un fil-
</p>
<p>trage par une liste des erreurs les plus fr&#233;quentes de MetaMap et en contraignant les types
s&#233;mantiques utilis&#233;s par ce dernier.
</p>
<p>Les r&#233;sultats de MetaMapPlus, mesur&#233;s sur le corpus i2b2 (rappel de 48,68 %, pr&#233;cision de
56,46 % et F-mesure de 52,28 %), sont significativement meilleurs que ceux de MetaMap (F-
mesure de 15,80 %) mais restent limit&#233;s &#224; cause de la performance du proc&#233;d&#233; de segmentation.
L&#8217;approche a cependant permis d&#8217;identifier le type correct pour 52,28 % des entit&#233;s, sachant
que seules 60,76 % des entit&#233;s ont &#233;t&#233; extraites correctement par le segmenteur (i.e. avec des
fronti&#232;res correctes).
</p>
<p>En appliquant la m&#233;thode MetaMapPlus sur un grand corpus m&#233;dical extrait du web, nous
avons constat&#233; que des ambigu&#239;t&#233;s lexicales apparaissaient plus souvent. En effet, plusieurs
termes g&#233;n&#233;raux sont consid&#233;r&#233;s par MetaMap comme des entit&#233;s m&#233;dicales. Cette ambigu&#239;t&#233;
peut &#234;tre divis&#233;e en deux cat&#233;gories principales : (i) les homonymes (e.g. ten, qui d&#233;signe dix
en domaine ouvert et la maladie &#171; Toxic Epidermal Necrolysis &#187; en domaine m&#233;dical) et (ii) les
termes g&#233;n&#233;raux ayant un sens qui se sp&#233;cialise dans le domaine m&#233;dical (e.g. case, form). Ces
ambigu&#239;t&#233;s causent du bruit dans la reconnaissance d&#8217;entit&#233;s m&#233;dicales.
</p>
<p>3.3 Traitement des ambigu&#239;t&#233;s entre acception g&#233;n&#233;rale et sp&#233;cialis&#233;e
</p>
<p>Pour r&#233;soudre le probl&#232;me d&#8217;ambigu&#239;t&#233; lexicale, nous proposons une &#233;tape suppl&#233;mentaire int&#233;-
gr&#233;e &#224; la m&#233;thode MetaMapPlus. Cette &#233;tape (appel&#233;e Maxent_SNG) consiste &#224; utiliser un clas-
sifieur pour distinguer les termes m&#233;dicaux et les termes g&#233;n&#233;raux, avant d&#8217;appliquer MetaMap.
Le but de ce module est de :
</p>
<p>1. R&#233;duire le bruit li&#233; &#224; l&#8217;ambigu&#239;t&#233; lexicale, en &#233;liminant les syntagmes nominaux (SN)
&#171; g&#233;n&#233;raux &#187; fr&#233;quents en domaine ouvert m&#234;me lorsqu&#8217;ils sont utilis&#233;s dans le domaine
m&#233;dical (par exemple &#171; table &#187;).
</p>
<p>2. R&#233;duire le volume &#224; traiter par la cat&#233;gorisation via MetaMap en &#233;liminant une bonne
partie des syntagmes nominaux &#224; classifier, ce qui devrait r&#233;duire le temps d&#8217;ex&#233;cution.
</p>
<p>Les m&#233;thodes statistiques &#224; base d&#8217;apprentissage supervis&#233; peuvent &#234;tre tr&#232;s robustes. Cepen-
dant, ces m&#233;thodes pr&#233;sentent deux inconv&#233;nients importants :
</p>
<p>1. La d&#233;pendance aux donn&#233;es annot&#233;es disponibles (cf. (Ben Abacha et Zweigenbaum,
</p>
<p>20</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2011c)), ce qui constitue un obstacle &#224; l&#8217;utilisation de ce type de m&#233;thodes pour des
t&#226;ches et domaines pour lesquels on ne dispose pas de corpus annot&#233;s, consid&#233;rant en
outre que la constitution de ces corpus est une t&#226;che co&#251;teuse.
</p>
<p>2. Le probl&#232;me de portabilit&#233; sur des corpus diff&#233;rents de ceux utilis&#233;s en entra&#238;nement
(cf. (Ben Abacha et Zweigenbaum, 2011c)), la d&#233;gradation des performances une fois
appliqu&#233;es sur des corpus ayant des caract&#233;ristiques diff&#233;rentes de ceux utilis&#233;s pour l&#8217;en-
tra&#238;nement constitue un obstacle pour le passage &#224; l&#8217;&#233;chelle de ces m&#233;thodes.
</p>
<p>Ces deux inconv&#233;nients constituent un important d&#233;fi pour la mise en place d&#8217;une m&#233;thode
statistique efficace et portable. Pour diff&#233;rencier les donn&#233;es d&#8217;entra&#238;nement (ce qui offrira une
meilleur adaptabilit&#233;) et &#233;viter le sur-apprentissage (en apprenant correctement et non pas &#171; par
coeur &#187;), nous traitons deux probl&#232;mes : (i) comment choisir les exemples d&#8217;entra&#238;nement ? (ii)
et quels sont les attributs &#224; utiliser ?
</p>
<p>3.3.1 S&#233;lection des donn&#233;es d&#8217;apprentissage
</p>
<p>&#192; l&#8217;instar des travaux sur l&#8217;apprentissage actif (Active Learning) (Thompson et al., 1999;
Tomanek et Olsson, 2009) qui s&#233;lectionnent des exemples diversifi&#233;s et repr&#233;sentatifs &#224; annoter
manuellement, nous avons trouv&#233; utile de s&#233;lectionner les exemples &#224; utiliser pour &#171; bien &#187;
apprendre. Deux questions cl&#233;s se posent alors :
&#8211; le nombre des exemples positifs et n&#233;gatifs &#224; utiliser ;
&#8211; le choix de ces exemples qui doivent &#234;tre repr&#233;sentatifs.
Pour choisir ces exemples, nous proposons d&#8217;utiliser :
</p>
<p>1. la fr&#233;quence des mots/syntagmes nominaux (positifs et n&#233;gatifs) dans un m&#234;me corpus ;
</p>
<p>2. la pr&#233;sence des mots/syntagmes nominaux (positifs et n&#233;gatifs) dans des corpus textuels
m&#233;dicaux de genres diff&#233;rents ;
</p>
<p>3. le Web pour collecter des donn&#233;es (des exemples positifs et n&#233;gatifs).
</p>
<p>Plus pr&#233;cis&#233;ment, pour la construction des donn&#233;es d&#8217;apprentissage pour le module qui permet
de classifier les syntagmes nominaux (SN) en entit&#233;s m&#233;dicales (EM) ou termes g&#233;n&#233;raux (SNG),
nous utilisons les exemples positifs et n&#233;gatifs suivants :
</p>
<p>1. Exemples positifs : entit&#233;s m&#233;dicales
&#8211; les EM les plus fr&#233;quentes dans le corpus i2b2 de textes cliniques ;
&#8211; les EM les plus fr&#233;quentes dans le corpus Berkeley d&#8217;articles scientifiques (Rosario et
</p>
<p>Hearst, 2004) ;
&#8211; les EM communes aux deux corpus ;
&#8211; des EM extraites du Web (notamment de Wikipedia 6, HON 7) ;
</p>
<p>2. Exemples n&#233;gatifs : SN &#171; g&#233;n&#233;raux &#187; (SNG) qui ne correspondent pas &#224; des entit&#233;s m&#233;di-
cales :
&#8211; les SNG les plus fr&#233;quents dans le corpus i2b2 ;
&#8211; les SNG les plus fr&#233;quents dans le corpus de Berkeley ;
&#8211; les SNG les plus fr&#233;quents qui existent dans ces deux corpus ;
</p>
<p>6. Diff&#233;rentes listes d&#8217;entit&#233;s m&#233;dicales ont &#233;t&#233; extraites &#224; partir de Wikipedia : medical tests, diseases, disorders,
treatments, procedures (diagnostiques, therapeutiques, surgicales,..)
</p>
<p>7. HON (Health On the Net) : http://www.hon.ch/
</p>
<p>21</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; des SNG extraits du Web, &#224; partir de sites th&#233;matiquement distant du domaine m&#233;dical.
Nous avons choisi des sites d&#8217;histoires pour enfants 8 9). Notre motivation est d&#8217;utiliser
des corpus ne contenant pas ou peu d&#8217;entit&#233;s m&#233;dicales.
</p>
<p>La table 3 d&#233;crit les types d&#8217;exemples positifs et n&#233;gatifs que nous avons utilis&#233;s, selon trois
crit&#232;res : corpus, nombre d&#8217;exemples et nombre d&#8217;occurrences de chaque exemple.
</p>
<p>Corpus Nb d&#8217;exemples Fr&#233;quence des exemples
</p>
<p>Exemples positifs
extraits du Web (Wikipedia,
HON, etc.)
</p>
<p>1 114 entre 1 et 3
</p>
<p>corpus m&#233;dical 1 (i2b2 :
textes cliniques)
</p>
<p>3 974
(sur 26 187 EM)
</p>
<p>&gt;= 3 (allant jusqu&#8217;&#224; 347
pour &#171; hypertension &#187;)
</p>
<p>corpus m&#233;dical 2 (Berkeley :
articles scientifiques)
</p>
<p>391
(sur 2 463 EM)
</p>
<p>&gt;=2 (allant jusqu&#8217;&#224; 28
pour &#171; chemotherapy &#187;)
</p>
<p>Total 5 479 entit&#233;s m&#233;dicales
</p>
<p>Exemples n&#233;gatifs
extraits du Web (sites d&#8217;his-
toires pour enfants)
</p>
<p>2 127 1 et 2
</p>
<p>corpus m&#233;dical 1 (i2b2 :
textes cliniques)
</p>
<p>2 031
(sur 15 882 SN)
</p>
<p>&gt;= 3 (allant jusqu&#8217;&#224; 855
pour &#171; the patient &#187;)
</p>
<p>corpus m&#233;dical 2 (Berkeley :
articles scientifiques)
</p>
<p>1 639
(sur 10 464 SN)
</p>
<p>&gt;= 2 (allant jusqu&#8217;&#224; 278
pour &#171; patients &#187;)
</p>
<p>Total 5 797 syntagmes nominaux (g&#233;n&#233;raux)
</p>
<p>TABLE 3 &#8211; Classification des syntagmes nominaux en termes m&#233;dicaux et termes g&#233;n&#233;raux, et
s&#233;lection des exemples positifs et n&#233;gatifs selon trois crit&#232;res : corpus, nombre d&#8217;exemples et
nombre d&#8217;occurrences de chaque exemple.
</p>
<p>3.3.2 Attributs utilis&#233;s par le classifieur
</p>
<p>Pour cette t&#226;che, nous utilisons un classifieur &#224; maximum d&#8217;entropie 10. Pour chaque syntagme
nominal (m&#233;dical ou g&#233;n&#233;ral), les attributs utilis&#233;s par le classifieur sont :
&#8211; la longueur du SN, son nombre de tokens ;
&#8211; le SN est un mot en majuscules / le SN est en majuscules / le SN contient un mot en majus-
</p>
<p>cules ;
&#8211; les mots / lemmes / cat&#233;gories syntaxiques du SN ;
&#8211; la pr&#233;sence et la fr&#233;quence des mots du SN dans la liste des mots du corpus g&#233;n&#233;ral BNC 11 ;
&#8211; la pr&#233;sence des mots du SN dans un dictionnaire g&#233;n&#233;ral (nous avons utilis&#233; le dictionnaire
</p>
<p>standard du syst&#232;me d&#8217;exploitation Linux).
</p>
<p>8. http://www.goodnightstories.com/read/pnkbook1.htm
9. http://www.vtaide.com/png/stories.htm
</p>
<p>10. Nous avons utilis&#233; l&#8217;impl&#233;mentation disponible &#224; : http://homepages.inf.ed.ac.uk/lzhang10/maxent_
toolkit.html.
</p>
<p>11. British National Corpus, http://www.natcorp.ox.ac.uk/.
</p>
<p>22</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Projection des annotations sur des textes en fran&#231;ais par
alignement
</p>
<p>4.1 Alignement au niveau des mots
</p>
<p>La projection que nous r&#233;alisons se fonde sur des alignements calcul&#233;s au niveau des mots. Pour
les obtenir, nous avons utilis&#233; les programmes d&#8217;alignement de corpus parall&#232;les du syst&#232;me de
traduction statistique MOSES (Koehn et al., 2007), en utilisant le param&#233;trage par d&#233;faut. Celui-
ci utilise l&#8217;outil GIZA++ (Och et Ney, 2004), qui calcule des mod&#232;les statistiques d&#8217;alignement de
mots de complexit&#233; croissante. L&#8217;alignement est r&#233;alis&#233; dans les deux directions puis ses r&#233;sultats
sont sym&#233;tris&#233;s. Finalement, des tables de traduction, qui regroupent l&#8217;ensemble des bi-segments
pouvant &#234;tre extraits du corpus, sont construites par application d&#8217;heuristiques d&#8217;extraction de
bi-segments coh&#233;rents, qui imposent que tout mot d&#8217;un segment dans un langue doit &#234;tre align&#233;
avec au moins un mot du segment dans l&#8217;autre langue, mais avec aucun mot en dehors de
celui-ci.
</p>
<p>4.2 Projection
</p>
<p>La figure 2 pr&#233;sente quelques exemples de bi-phrases align&#233;es au niveau des mots.
</p>
<p>FIGURE 2 &#8211; Exemples : trois bi-phrases align&#233;es au niveau des mots
</p>
<p>Pour projeter les annotations, nous utilisons le principe suivant :
</p>
<p>Soit E1 = {m11, . . . , m1n} l&#8217;ensemble des mots constituant une entit&#233; m&#233;dicale dans le corpus
anglais et E2 = {m21, . . . , m2p} l&#8217;ensemble des mots constituant la projection de E1 (i.e. l&#8217;union
des projections de chaque mot dans E1). En notant posi t ion(mi) la fonction retournant la posi-
tion d&#8217;un mot dans sa phrase, nous consid&#233;rons que la projection de l&#8217;entit&#233; m&#233;dicale anglaise
est la s&#233;quence ordonn&#233;e de mots E3 = {m31, . . . , m3k} telle que :
&#8211; posi t ion(m31) = Minm2i&#8712;E2(posi t ion(m2i))
&#8211; posi t ion(m3k) = Maxm2i&#8712;E2(posi t ion(m2i))
</p>
<p>Le bruit produit par l&#8217;alignement et les annotations affecte la qualit&#233; des annotations projet&#233;es.
Pour diminuer ce bruit et am&#233;liorer la phase de projection, (i) nous d&#233;finissons des heuris-
tiques (telles que la longueur de l&#8217;entit&#233; trouv&#233;e en fran&#231;ais par rapport &#224; l&#8217;entit&#233; originale en
anglais) et (ii) nous utilisons un antidictionnaire 12 pour filtrer les entit&#233;s m&#233;dicales obtenues et
supprimer les &#171; mots vides &#187;.
</p>
<p>12. http://members.unine.ch/jacques.savoy/clef/index.html
</p>
<p>23</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 Exp&#233;rimentations et &#233;valuation
</p>
<p>Le corpus utilis&#233; pour les exp&#233;rimentations a &#233;t&#233; construit &#224; partir du site bilingue &#171; Sant&#233;
Canada 13 &#187; align&#233; au niveau des phrases (Del&#233;ger et al., 2009). La table 4 pr&#233;sente le corpus
parall&#232;le (anglais-fran&#231;ais) Sant&#233; Canada.
</p>
<p>Corpus anglais Corpus fran&#231;ais
Nombre de lignes 395600 395600
Nombre de mots 4 465 672 5 052 543
Nombre de caract&#232;res 29 845 733 33 901 471
Nombre de mots par ligne (en moyenne) 11 13
Nombre de caract&#232;res par mot (en moyenne) 7 7
</p>
<p>TABLE 4 &#8211; Le corpus parall&#232;le Sant&#233; Canada
</p>
<p>5.1 Construction et annotation manuelle d&#8217;un bi-corpus de r&#233;f&#233;rence
</p>
<p>Pour &#233;valuer notre approche, nous avons besoin d&#8217;un bi-corpus de r&#233;f&#233;rence annot&#233;. Deux &#233;l&#233;-
ments sont &#224; d&#233;terminer : (i) la taille du corpus de r&#233;f&#233;rence et (ii) la mani&#232;re de choisir ce
corpus &#224; partir du corpus initial Sant&#233; Canada. Nous nous sommes pour cela bas&#233;s sur des
travaux en statistiques.
</p>
<p>Taille du corpus. Pour d&#233;terminer la taille (acceptable) du corpus de r&#233;f&#233;rence &#224; s&#233;lectionner,
nous utilisons la formule utilis&#233;e en statistiques (Sim et Wright, 2005) pour d&#233;terminer la taille
d&#8217;un &#233;chantillon :
</p>
<p>N =
T 2P(1&#8722; P)
</p>
<p>E2&#63729;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63730;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63731;
</p>
<p>N = La taille de l&#8217;&#233;chantillon attendu.
T = Niveau de confiance d&#233;duit du taux de confiance
</p>
<p>(traditionnellement 1,96 pour un taux de confiance de 95 %).
P = Proportion estim&#233;e de la &#171; population &#187; pr&#233;sentant la caract&#233;ristique
</p>
<p>&#233;tudi&#233;e dans l&#8217;&#233;tude. Lorsque cette proportion est ignor&#233;e, une pr&#233;-
&#233;tude peut &#234;tre r&#233;alis&#233;e ou sinon p = 0,5 sera retenue.
</p>
<p>E = Marge d&#8217;erreur (traditionnellement fix&#233;e &#224; 5 %).
</p>
<p>Nous fixons les valeurs suivantes : P = 0,5, T = 1,96 et E = 0,05, ce qui nous donne la valeur : N = 385.
</p>
<p>S&#233;lection du corpus. Diff&#233;rentes m&#233;thodes sont possibles, telles que l&#8217;&#233;chantillonnage al&#233;atoire
simple (simple random sampling) ou l&#8217;&#233;chantillonnage stratifi&#233; (stratified sampling). Nous avons
choisi d&#8217;utiliser l&#8217;&#233;chantillonnage al&#233;atoire simple et s&#233;lectionn&#233; al&#233;atoirement 385 phrases, con-
tenant 4 613 mots.
</p>
<p>Annotation manuelle du corpus de r&#233;f&#233;rence. Nous avons annot&#233; manuellement les 385
phrases s&#233;lectionn&#233;es avec trois types de cat&#233;gories m&#233;dicales : Traitement, Probl&#232;me et Mal-
adie. Nous avons annot&#233; les deux parties fran&#231;aises et anglaises du corpus de r&#233;f&#233;rence en
utilisant le guide d&#8217;annotation de i2b2 2010 (t&#226;che 1), en respectant les r&#232;gles de d&#233;limitation
des fronti&#232;res d&#233;crites dans la section 3.1.
</p>
<p>13. http://www.hc-sc.gc.ca
</p>
<p>24</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5.2 &#201;valuation de l&#8217;annotation du corpus anglais
</p>
<p>Dans cette section, nous &#233;valuons la REM &#224; partir du corpus anglais. Nous diff&#233;rencions le cas
o&#249; les entit&#233;s m&#233;dicales ont &#233;t&#233; reconnues avec des fronti&#232;res pr&#233;cises ou exactes et le cas
o&#249; les fronti&#232;res ne sont pas pr&#233;cises (par exemple, &#171;as antimicrobial resistance&#187; au lieu de
&#171;antimicrobial resistance&#187;, &#171;Pap smear&#187; au lieu de &#171;a Pap smear&#187; ou &#171;the Pap smear&#187; dans le
texte). Nous utilisons les mesures standard de rappel, de pr&#233;cision et de F-mesure.
</p>
<p>Nous avons entra&#238;n&#233; le module Maxent_SNG de classification des syntagmes nominaux en en-
tit&#233;s m&#233;dicales et entit&#233;s g&#233;n&#233;rales sur le corpus d&#8217;entra&#238;nement i2b2 et nous l&#8217;avons test&#233; sur le
corpus de test i2b2. Nous avons obtenu une correction (proportion d&#8217;exemple de test correcte-
ment class&#233;s) de 90,99 % (16 169/17 769). La table 5 pr&#233;sente la contribution &#224; la m&#233;thode
MetaMapPlus de ce module (Maxent_SNG), entra&#238;n&#233; sur le corpus d&#8217;entra&#238;nement d&#233;crit dans
la section 3.3.
</p>
<p>MetaMapPlus Maxent_SNG + MetaMapPlus
Fronti&#232;res strictes Fronti&#232;res larges Fronti&#232;res strictes Fronti&#232;res larges
</p>
<p>R P F R P F R P F R P F
61,36 22,37 32,79 82,26 28,18 41,97 50,00 40,23 44,58 59,26 45,98 51,78
</p>
<p>TABLE 5 &#8211; R&#233;sultats de la m&#233;thode MetaMapPlus sans et avec le module Maxent_SNG sur le
corpus Sant&#233; Canada (partie anglaise).
</p>
<p>Comme attendu, ce filtrage am&#233;liore sensiblement la pr&#233;cision des entit&#233;s m&#233;dicales d&#233;tect&#233;es,
et en d&#233;pit d&#8217;une baisse importante de la valeur de rappel, la F-mesure conna&#238;t une nette aug-
mentation.
</p>
<p>5.3 &#201;valuation de l&#8217;annotation du corpus fran&#231;ais par projection
</p>
<p>Dans cette section, nous &#233;valuons la qualit&#233; de la projection des entit&#233;s m&#233;dicales extraites du
corpus anglais par notre m&#233;thode (i.e. Maxent_SNG+MetaMapPlus). Dans un premier temps,
nous &#233;valuons uniquement la qualit&#233; de la projection (ind&#233;pendamment des erreurs d&#8217;extrac-
tion). Pour ce faire, nous &#233;tudions la qualit&#233; de la projection des entit&#233;s de r&#233;f&#233;rence (i.e. an-
not&#233;es manuellement). Dans un second temps, nous &#233;valuons l&#8217;ensemble du processus pour la
REM en fran&#231;ais (comprenant l&#8217;extraction automatique des entit&#233;s m&#233;dicales en anglais et leur
projection). Le tableau 6 pr&#233;sente les r&#233;sultats de la projection des entit&#233;s de r&#233;f&#233;rence et les
r&#233;sultats de la projection des entit&#233;s extraites avec la m&#233;thode Maxent_SNG+MetaMapPlus.
</p>
<p>5.4 Discussion
</p>
<p>Nous avons pu am&#233;liorer les r&#233;sultats de la m&#233;thode MetaMapPlus en int&#233;grant le module Max-
Ent entra&#238;n&#233; sur trois types diff&#233;rents de corpus. Notons que les r&#233;sultats obtenus en exploitant
ces trois types de corpus sont meilleurs que ceux obtenus en entra&#238;nant le classifieur sur un
ou deux corpus uniquement (ce que nous avons test&#233; mais ne pouvons pas d&#233;tailler dans cet
</p>
<p>25</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation du corpus fran&#231;ais : projection des
entit&#233;s m&#233;dicales extraites
</p>
<p>Annotation du corpus fran&#231;ais : projection des
entit&#233;s m&#233;dicales de r&#233;f&#233;rence
</p>
<p>Fronti&#232;res strictes Fronti&#232;res larges Fronti&#232;res strictes Fronti&#232;res larges
R P F R P F R P F R P F
22,39 22,90 22,64 43,08 42,75 42,91 44,78 57,69 50,42 67,91 87,50 76,47
</p>
<p>TABLE 6 &#8211; &#201;valuation de la projection des entit&#233;s m&#233;dicales extraites avec la m&#233;thode Max-
ent_SNG+MetaMapPlus et les entit&#233;s de r&#233;f&#233;rence sur le corpus Sant&#233; Canada (partie fran&#231;aise).
</p>
<p>article). Les r&#233;sultats sont relativement acceptables (51,78 % de F-mesure) &#233;tant donn&#233; la com-
plexit&#233; de la t&#226;che sur un corpus h&#233;t&#233;rog&#232;ne extrait du Web.
</p>
<p>Pour la projection, nous avons utilis&#233; les alignements au niveau des mots avec une approche
simple qui consiste &#224; prendre l&#8217;entit&#233; correspondante (projet&#233;e) la plus large. Nous avons essay&#233;
d&#8217;am&#233;liorer cette projection en utilisant un antidictionnaire pour filtrer les entit&#233;s obtenues et
quelques heuristiques telles qu&#8217;une diff&#233;rence maximale entre la longueur de l&#8217;entit&#233; initiale et
celle de l&#8217;entit&#233; projet&#233;e (cf. table 7).
</p>
<p>Fronti&#232;res larges Fronti&#232;res strictes
Projection sans filtrage 79,09 % 47,15 %
Projection + antidictionnaire 75,52 % 49,79 %
Projection + antidictionnaire + heuristiques 76,47 % 50,42 %
</p>
<p>TABLE 7 &#8211; F-mesure de la projection des entit&#233;s de r&#233;f&#233;rence sans et avec filtrage
</p>
<p>Les r&#233;sultats de la projection des entit&#233;s m&#233;dicales extraites sont relativement faibles, mais ceci
d&#233;pend directement de la performance de la m&#233;thode d&#8217;extraction d&#8217;information (51,78 % de
F-mesure, avec fronti&#232;res larges), qui fixe le plafond de performance atteignable en projetant
ses r&#233;sultats sur le corpus fran&#231;ais. Par projection, nous perdons tout de m&#234;me pr&#232;s de 50 % des
extractions correctes dans le corpus anglais. Ceci r&#233;sulte principalement de la qualit&#233; des aligne-
ments au niveau des phrases puis des mots. L&#8217;alignement au niveau des mots est influenc&#233; par
la qualit&#233; de l&#8217;alignement des phrases (cf. les exemples 1 et 2 ci-dessous). En effet, dans certains
cas, la phrase correspondante en fran&#231;ais n&#8217;est pas &#233;quivalente &#224; celle en anglais (soit elle est
beaucoup plus courte et contient moins d&#8217;information, soit elle est beaucoup plus longue), dans
d&#8217;autres cas elle a un contenu compl&#232;tement diff&#233;rent ou reste formul&#233;e en anglais : cela refl&#232;te
un probl&#232;me d&#8217;alignement de phrases qu&#8217;il nous faudra corriger dans la suite de nos travaux.
</p>
<p>Exemple 1 :
&#8211; Statement on Immunization for &lt;PB&gt;Lyme Disease&lt;/PB&gt;, 2000 (*)
&#8211; 0-0 1-1 5-2 4-3 5-3 5-4 5-5 2-7 5-9 5-10 5-11 5-12 6-13 7-14
&#8211; D&#233;claration sur &lt;PB&gt;un sch&#233;ma r&#233;vis&#233; pour la vaccination des adolescents contre l&#8217;h&#233;patite B&lt;/PB&gt;,
</p>
<p>2000 (*)
Exemple 2 :
&#8211; &lt;PB&gt;Lung Cancer&lt;/PB&gt; : Guidelines for processing Specimens and Reporting Tumor Stage (2000)
&#8211; 0-0 1-0 2-0 1-1 1-2 3-3 4-6 9-13 8-18 6-23 7-24 10-27
&#8211; &lt;PB&gt;Utilisation, aux fins &lt;/PB&gt; de la surveillance, des renseignements sur les patients atteints de
</p>
<p>cancer : Examen syst&#233;matique des lois, des r&#233;glements, des politiques et des lignes directrices (2000)
Il semble que ces deux phrases ne soient pas en relation de traduction, qui peut r&#233;sulter d&#8217;un
mauvais appariemment de documents ou entre phrases.
</p>
<p>26</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>6 Conclusion et perspectives
</p>
<p>Nous avons propos&#233; dans cet article une approche pour l&#8217;annotation automatique de textes
m&#233;dicaux en fran&#231;ais par projection depuis l&#8217;anglais, et pr&#233;sent&#233; nos premi&#232;res exp&#233;rimentations
en REM. L&#8217;approche pr&#233;sent&#233;e utilise un corpus parall&#232;le align&#233; au niveau des mots pour projeter
les annotations obtenues sur la partie anglaise vers la partie fran&#231;aise. L&#8217;application de notre
m&#233;thode de REM sur un grand corpus de donn&#233;es h&#233;t&#233;rog&#232;nes extrait du Web a pos&#233; une
probl&#233;matique de passage &#224; l&#8217;&#233;chelle pour laquelle nous avons propos&#233; une solution qui consiste
&#224; int&#233;grer un module de filtrage statistique en amont des entit&#233;s candidates pour am&#233;liorer la
pr&#233;cision des entit&#233;s extraites.
</p>
<p>Nous envisageons principalement quatre perspectives &#224; ce travail :
&#8211; L&#8217;annotation automatique des relations s&#233;mantiques dans des textes fran&#231;ais en reprenant
</p>
<p>la m&#233;thode pr&#233;sent&#233;e. Nous avons d&#233;j&#224; d&#233;velopp&#233; des m&#233;thodes &#224; base de patrons et des
m&#233;thodes statistiques pour l&#8217;extraction de relations s&#233;mantiques &#224; partir de textes m&#233;dicaux
en anglais (Ben Abacha et Zweigenbaum, 2011b).
</p>
<p>&#8211; L&#8217;utilisation ou la construction d&#8217;autres corpus m&#233;dicaux parall&#232;les de meilleur qualit&#233;.
&#8211; L&#8217;exploitation de corpus fran&#231;ais annot&#233;s pour la mise en place de m&#233;thodes statistiques pour
</p>
<p>l&#8217;extraction d&#8217;information &#224; partir de textes en fran&#231;ais.
&#8211; L&#8217;int&#233;gration de ces m&#233;thodes d&#8217;extraction d&#8217;information dans un syst&#232;me de questions-
</p>
<p>r&#233;ponses translingue.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ARONSON, A. R. (2001). Effective mapping of biomedical text to the UMLS metathesaurus : the
MetaMap program. In AMIA Annu Symp Proc, pages 17&#8211;21.
AYACHE, C. (2005). Campagne EVALDA/EQueR &#8211; &#201;valuation en question-r&#233;ponse, rapport
final. Rapport technique, ELDA, Paris. Available athttp://www.technolangue.net/IMG/
pdf/rapport_EQUER_1.2.pdf.
</p>
<p>BACH, N. et BADASKAR, S. (2007). A Review of Relation Extraction.
</p>
<p>BEN ABACHA, A. et ZWEIGENBAUM, P. (2011a). Automatic extraction of semantic relations be-
tween medical entities : a rule based approach. Journal of Biomedical Semantics, 2(Suppl 5):S4.
BEN ABACHA, A. et ZWEIGENBAUM, P. (2011b). A hybrid approach for the extraction of semantic
relations from MEDLINE abstracts. In Computational Linguistics and Intelligent Text Processing,
12th International Conference, CICLing 2011, volume 6608 de Lecture Notes in Computer Science,
pages 139&#8211;150, Tokyo, Japan.
</p>
<p>BEN ABACHA, A. et ZWEIGENBAUM, P. (2011c). Medical entity recognition : A comparison of
semantic and statistical methods. In Actes BioNLP 2011 Workshop, pages 56&#8211;64, Portland,
Oregon, USA. Association for Computational Linguistics.
</p>
<p>DEL&#201;GER, L., MERKEL, M. et ZWEIGENBAUM, P. (2006). Contribution to terminology internation-
alization by word alignment in parallel corpora. In AMIA Annu Symp Proc., pages 185&#8211;189,
Washington, DC.
</p>
<p>DEL&#201;GER, L., MERKEL, M. et ZWEIGENBAUM, P. (2009). Translating medical terminologies through
word alignment in parallel text corpora. Journal of Biomedical Informatics, 42(4):692&#8211;701.
Epub 2009 Mar 9.
</p>
<p>27</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUERGANA K SAVOVA, James J Masanz, P. V. O. J. Z. S. S. K. C. K.-S. et CHUTE, C. G. (2010).
Mayo clinical text analysis and knowledge extraction system (ctakes) : architecture, component
evaluation and applications. Journal of the American Medical Informatics Association, 17:507&#8211;
513.
</p>
<p>KOEHN, P., HOANG, H., BIRCH, A., CALLISON-BURCH, C., FEDERICO, M., BERTOLDI, N., COWAN, B.,
SHEN, W., MORAN, C., ZENS, R., DYER, C., BOJAR, O., CONSTANTIN, A. et HERBST, E. (2007).
Moses : Open source toolkit for statistical machine translation. In Proceedings of ACL, Czech
Republic.
</p>
<p>LOPEZ, A., NOSSAL, M., HWA, R. et RESNIK, P. (2002). Word-level alignment for multilingual
resource acquisition. In Actes LREC Workshop on Linguistic Knowledge Acquisition and Represen-
tation : Bootstrapping Annotated Data, Las Palmas, Spain. ELRA.
</p>
<p>L&#220;, Y., LI, S., ZHAO, T. et YANG, M. (2002). Learning Chinese bracketing knowledge based on a
bilingual language model. In Proceedings of COLING-2002, pages 591&#8211;598.
</p>
<p>MCCRAY, A. T. et NELSON, S. J. (1995). The semantics of the UMLS knowledge sources. Methods
of Information in Medicine, 34(1/2).
</p>
<p>NADEAU, D. et SEKINE, S. (2007). A survey of named entity recognition and classification.
Linguisticae Investigationes, 30(1):3&#8211;26. Publisher : John Benjamins Publishing Company.
</p>
<p>N&#201;V&#201;OL, A., MORK, J., ARONSON, A. et DARMONI, S. (2005). Evaluation of French and English
MeSH indexing systems with a parallel corpus. In AMIA Annu Symp Proc., pages 565&#8211;9, Wash-
ington, DC.
</p>
<p>OCH, F. J. et NEY, H. (2004). The alignment template approach to statistical machine transla-
tion. Computational Linguistics, 30(4).
</p>
<p>PAD&#211;, S. et PITEL, G. (2007). Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les par pro-
jection cross-linguistique. In Actes TALN 2007, Toulouse, France.
</p>
<p>POIBEAU, T. (2003). Extraction automatique d&#8217;information : du texte brut au web s&#233;mantique.
Herm&#232;s science publications.
</p>
<p>ROSARIO, B. et HEARST, M. A. (2004). Classifying semantic relations in bioscience text. In
Proceedings of the 42nd Annual Meeting of the Association for Computational Linguistics (ACL
2004), pages 430&#8211;437, Barcelona.
</p>
<p>SIM, J. et WRIGHT, C. C. (2005). The kappa statistic in reliability studies : Use, interpretation,
and sample size requirements. Physical Therapy.
</p>
<p>THOMPSON, C. A., CALIFF, M. E. et MOONEY, R. J. (1999). Active learning for natural language
parsing and information extraction. In Proceedings of the Sixteenth International Conference on
Machine Learning (ICML-99), pages 406&#8211;414, Bled, Slovenia.
</p>
<p>TOMANEK, K. et OLSSON, F. (2009). A web survey on the use of active learning to support
annotation of text data. In Proceedings of the NAACL HLT 2009 Workshop on Active Learning for
Natural Language Processing, pages 45&#8211;48, Boulder, Colorado. Association for Computational
Linguistics.
</p>
<p>UZUNER, O., SOUTH, B. R., SHEN, S. et DUVALL, S. L. (2011). 2010 i2b2/VA challenge on con-
cepts, assertions, and relations in clinical text. Journal of the American Medical Informatics
Association. [Epub ahead of print].
</p>
<p>YAROWSKY, D. et NGAI, G. (2001). Inducing multilingual POS taggers and NP bracketers via
robust projection across aligned corpora. In Actes NAACL 2001.
</p>
<p>28</p>

</div></div>
</body></html>