<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Solution Proxem d&#8217;analyse s&#233;mantique verticale : adaptation au domaine des Ressources Humaines</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 5: D&#233;monstrations, pages 11&#8211;12,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Solution Proxem d&#8217;analyse s&#233;mantique verticale : 
adaptation au domaine des Ressources Humaines 
</p>
<p>Fran&#231;ois-R&#233;gis Chaumartin1 
(1) Proxem, 19 bd de Magenta, 75010 Paris 
</p>
<p>frc@proxem.com 
RESUME ____________________________________________________________________________________________________________   
Proxem d&#233;veloppe depuis 2007 une plate-forme de traitement du langage, Antelope, qui 
permet de construire rapidement des applications s&#233;mantiques verticales (par exemple, 
pour l&#8217;e-r&#233;putation, la veille &#233;conomique ou l&#8217;analyse d&#8217;avis de consommateurs). 
Antelope a servi &#224; cr&#233;er une solution pour les Ressources Humaines, utilis&#233;e notamment 
par l&#8217;APEC, permettant (1) d&#8217;extraire de l&#8217;information &#224; partir d&#8217;offres et de CVs et (2) de 
trouver les offres d&#8217;emploi correspondant le mieux &#224; un CV (ou r&#233;ciproquement). Nous 
pr&#233;sentons ici l&#8217;adaptation d&#8217;Antelope &#224; un domaine particulier, en l&#8217;occurrence les RH. 
ABSTRACT _________________________________________________________________________________________________________  
How to adapt the Proxem semantic analysis engine to the Human Resources field 
Proxem develops since 2007 the NLP platform, Antelope, with which one can quickly 
build vertical semantic applications (for e-reputation, business intelligence or consumer 
reviews analysis, for instance). Antelope was used to create a Human Resources solution, 
notably used by APEC, making it possible (1) to extract information from resumes and 
offers and (2) to find the most relevant jobs matching a given resume (or vice versa). We 
present here how to adapt Antelope to a particular area, namely HR. 
MOTS-CLES : entit&#233;s nomm&#233;es, extraction de relations, cr&#233;ation d&#8217;ontologies, similarit&#233; 
KEYWORDS : named entities, information extraction, ontologies development, matching 
</p>
<p>1 La plate-forme de traitement linguistique Antelope 
Antelope (Chaumartin, 2008) est une plate-forme de TAL int&#233;grant des composants de 
traitement syntaxique et s&#233;mantique, ainsi qu&#8217;un lexique de large couverture pour 
l&#8217;anglais et le fran&#231;ais. Elle permet de cr&#233;er rapidement des applications d&#8217;analyse 
s&#233;mantique, en encha&#238;nant plusieurs op&#233;rations au sein d&#8217;une cha&#238;ne de traitement. 
La qualit&#233; des documents trait&#233;s &#233;tant tr&#232;s variable, une correction orthographique est 
souvent n&#233;cessaire ; n&#233;anmoins, cette op&#233;ration doit &#234;tre effectu&#233;e avec une 
connaissance du contexte m&#233;tier ; par exemple, les noms propres (qui ne figurent pas 
dans le lexique int&#233;gr&#233;) ne doivent pas &#234;tre &#171; corrig&#233;s &#187; vers un mot proche.  
La reconnaissance d&#8217;entit&#233;s nomm&#233;es vise classiquement &#224; identifier des personnes, lieux 
et organisation. Dans un contexte d&#8217;enseigne de grande distribution, les entit&#233;s 
int&#233;ressantes &#224; d&#233;tecter sont plut&#244;t les produits, marques et concurrents cit&#233;s, ainsi que 
des concepts li&#233;s au m&#233;tier (risque sanitaire, risque juridique&#8230;). Dans le domaine des 
Ressources Humaines, il s&#8217;agira plut&#244;t de reconna&#238;tre des m&#233;tiers, des comp&#233;tences, des 
talents, des dipl&#244;mes&#8230; 
</p>
<p>11</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Adaptation d&#8217;Antelope au domaine RH 
Nous avons d&#233;velopp&#233; une nouvelle approche d&#8217;acquisition &#224; large &#233;chelle d&#8217;entit&#233;s 
nomm&#233;es. (a) Une premi&#232;re phase d&#8217;extraction terminologique permet d&#8217;amorcer la liste 
des concepts du domaine. (b) Une seconde phase utilise des ressources de large 
couverture (la Wikip&#233;dia et un WordNet pour le fran&#231;ais) pour cr&#233;er des gazettes ; en cas 
d&#8217;ambigu&#239;t&#233; (le m&#233;tier d&#8217;architecte rel&#232;ve par exemple du BTP de l&#8217;informatique), les 
termes des gazettes sont automatiquement associ&#233;s &#224; des mots cl&#233;s activateurs ou 
inhibiteurs. (c) L&#8217;application de ces gazettes permet de constituer un premier corpus 
annot&#233; selon les entit&#233;s nomm&#233;es du domaine. Un apprentissage (par CRF) est alors 
effectu&#233; sur le corpus, pour identifier de nouvelles instances d&#8217;entit&#233;s. Les concepts 
correspondant aux entit&#233;s nomm&#233;es sont organis&#233;s sous forme de taxonomie. La figure 1 
montre par exemple, sur la partie de gauche, l&#8217;organisation des m&#233;tiers, comp&#233;tences et 
talents sous forme d&#8217;arborescence. Cette information est utilis&#233;e lors de la recherche de 
documents similaires ; concr&#232;tement, elle permet de d&#233;terminer que &#8211;toutes choses 
&#233;gales par ailleurs&#8211; la comp&#233;tence &#171; d&#233;veloppement Java &#187; est plus proche d&#8217;une 
comp&#233;tence &#171; d&#233;veloppement en langage objet &#187; que de &#171; d&#233;veloppement COBOL &#187;. Ce 
point am&#233;liore fortement la pertinence des documents trouv&#233;s lors d&#8217;une recherche. 
</p>
<p> 
FIGURE 1 &#8211; Une capture d&#8217;&#233;cran de la solution d&#8217;analyse s&#233;mantique RH de Proxem. 
</p>
<p>Remerciements 
Le projet SIRE (FEDER) a partiellement financ&#233; l&#8217;adaptation d&#8217;Antelope au domaine RH. 
</p>
<p> &#233; &#233; en es 
CHAUMARTIN F.-R. (2008). ANTELOPE, une plate-forme industrielle de traitement 
linguistique. Traitement Automatique des Langues 49:2. 
</p>
<p>12</p>

</div></div>
</body></html>