<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Propagation de polarit&#233;s dans des familles de mots : impact de la morphologie dans la construction d'un lexique pour l'analyse de sentiments</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 495&#8211;502,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Propagation de polarit&#233;s dans des familles de mots : impact de la morphologie dans la construction d'un lexique pour l'analyse d&#8217;opinions 
N&#250;ria Gala1 Caroline Brun2 
</p>
<p>(1) LIF-CNRS UMR 7279, 163 av. de Luminy case 901, 13288 Marseille Cedex 9, France 
(2) Xerox Research Centre Europe, 6 chemin de Maupertuis 38240 Meylan, France 
nuria.gala@lif.univ-mrs.fr, caroline.brun@xrce.xerox.com 
</p>
<p>RESUME ____________________________________________________________________________________________________________   
&#8232;Les ressources lexicales sont cruciales pour de nombreuses applications de traitement 
automatique de la langue (par exemple, l'extraction d'opinions &#224; partir de corpus). 
Cependant, leur construction pose des probl&#232;mes &#224; diff&#233;rents niveaux (co&#251;t, couverture, 
etc.). Dans cet article, nous avons voulu v&#233;rifier si les informations morphologiques li&#233;es 
&#224; la d&#233;rivation pouvaient &#234;tre exploit&#233;es pour l'annotation automatique d'informations 
s&#233;mantiques. En partant d'une ressource regroupant les mots en familles morphologiques 
en fran&#231;ais, nous avons construit un lexique de polarit&#233;s pour 4 065 mots, &#224; partir d'une 
liste initiale d'adjectifs annot&#233;s manuellement. Les r&#233;sultats obtenus montrent que la 
propagation des polarit&#233;s est correcte pour 78,89% des familles avec un seul adjectif. Le 
lexique ainsi obtenu am&#233;liore aussi les r&#233;sultats du syst&#232;me d'extraction d'opinions. 
ABSTRACT _________________________________________________________________________________________________________  
Spreading Polarities among Word Families: Impact of Morphology on Building a 
Lexicon for Sentiment Analysis 
Lexical resources are essential for many natural language applications (for example, 
opinion mining from corpora). However, building them entails different problems (cost, 
coverage, etc.). In this paper, we wanted to verify whether morphological information 
about derivation could be used to automatically annotate semantic information. Starting 
from a resource that groups words into morphological families in French, we have built a 
lexicon with polarities for 4 065 words from an initial seed set of manual annotated 
adjectives. The results obtained show that spreading polarities is accurate for 78.89% of 
the families with a unique adjective. The lexicon obtained also improves the results of 
the opinion mining system on different corpora. 
MOTS-CLES : ressources lexicales, morphologie d&#233;rivationnelle, analyse de sentiments 
KEYWORDS : lexical resources, derivational morphology, opinion mining 
</p>
<p>1 Introduction 
</p>
<p>Depuis quelques ann&#233;es, l'analyse de sentiments suscite de l'int&#233;r&#234;t dans la communaut&#233; 
du traitement automatique des langues (TAL), comme cons&#233;quence d'un r&#233;el besoin dans 
le traitement de grandes masses de donn&#233;es : services web pour le tourisme ou la culture, 
discours politiques, etc. Par analyse de sentiments, on entend la d&#233;tection de la polarit&#233; 
d'un texte, c'est-&#224;-dire, l'obtention automatique de la tendance ou de l'opinion qui s'en 
d&#233;gage.  
</p>
<p>495</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Deux approches ressortent dans la litt&#233;rature. Les approches statistiques supervis&#233;es, 
fond&#233;es sur les co-occurrences de mots dans des corpus, et les approches plus 
linguistiques qui s'appuient, elles, sur des ressources lexicales. L'id&#233;e des m&#233;thodes 
statistiques est de calculer, &#224; partir d'un ensemble de co-occurrences annot&#233;es, d'autres 
co-occurences polaris&#233;es (Hatzivassiloglous et McKeown 1997 ; Turney 2002). La 
proc&#233;dure de classification se fait automatiquement &#224; partir d'exemples, le mod&#232;le 
attribue une polarit&#233; en fonction d'un processus inductif (Pang et al. 2002). L'autre type 
de m&#233;thode est consid&#233;r&#233; plus linguistique, dans la mesure o&#249; l'on utilise des ressources 
comme des th&#233;saurus, des r&#233;seaux lexicaux, etc. (Kim et Hovy 2004 ; Esuli et Sebastiani 
2005), ce qui permet d'am&#233;liorer les performances des syst&#232;mes d'analyse (Choi et Cardie 
2009 ; Lu et al. 2011). Les m&#233;thodes qui utilisent des lexiques pr&#233;supposent deux 
hypoth&#232;ses : toute unit&#233; lexicale aurait une orientation s&#233;mantique intrins&#232;que, 
ind&#233;pendamment de son contexte d'apparition ; cette orientation peut &#234;tre exprim&#233;e avec 
une valeur num&#233;rique (Taboada et al. 2011).  
Notre travail se situe dans cette perspective : nous nous sommes propos&#233;es de construire 
un lexique de polarit&#233;s. A partir d'une liste initiale de 3 882 adjectifs annot&#233;s 
manuellement par trois annotateurs, nous avons voulu observer l'impact de la 
morphologie d&#233;rivationnelle dans le maintien ou non de la polarit&#233;. C'est-&#224;-dire, nous 
avons voulu tester l'hypoth&#232;se selon laquelle la polarit&#233; intrins&#232;que d'un adjectif est la 
m&#234;me que celle des unit&#233;s lexicales de sa famille morphologique. L'id&#233;e a &#233;t&#233; de voir (i) 
si on pouvait construire une ressource qui capitalise sur les liens morphologiques pour 
propager des informations s&#233;mantiques, et (ii) si une telle ressource am&#233;liore les 
r&#233;sultats d'un syst&#232;me d'analyse d'opinions. 
Si l'estimation de la polarit&#233; d'un texte passe par des ph&#233;nom&#232;nes contextuels 
(intensificateurs, n&#233;gation, etc.) et syntaxiques (Brun 2011), la qualit&#233; du lexique &#224; la 
base du syst&#232;me reste cruciale. La construction d'un tel lexique demeure donc un aspect 
important. Des lexiques existants pour l'anglais ont &#233;t&#233; construits &#224; partir de WORDNET, 
par exemple, WORDNET-AFFECT (Strapparava and Valitutti 2004), SENTIWORDNET (Esuli 
and Sebastiani 2006). Pour le fran&#231;ais, on peut citer les travaux de Vernier et Monceaux 
(2010) pour obtenir automatiquement une liste de 982 termes subjectifs &#224; partir de 
l'indexation de documents sur le Web ou l'application LIKEIT de JEUXDEMOTS (Lafourcade 
2007) o&#249; l'enrichissement de la liste de mots polaris&#233;s se fait de fa&#231;on contributive. En 
dehors de ces exemples, &#224; notre connaissance, il n'existe pas de lexique de polarit&#233;s pour 
le fran&#231;ais. 
Dans cet article, nous d&#233;crirons la m&#233;thodologie de construction de notre lexique 
(section 2) et dans la section 3, nous &#233;valuerons la qualit&#233; des donn&#233;es obtenues au 
regard des familles morphologiques (propagation des polarit&#233;s). Nous pr&#233;senterons, 
enfin, les r&#233;sultats d'un syst&#232;me d'analyse d'opinions qui int&#232;gre la ressource. 
</p>
<p>2 Construction de la ressource lexicale 
</p>
<p>Pour constituer le lexique de polarit&#233;s, nous avons utilis&#233; la deuxi&#232;me version de 
POLYMOTS, une ressource lexicale regroupant 19 009 mots, &#224; ce jour, en 2 069 familles 
morpho-phonologiques (Gala et Rey 2008). La deuxi&#232;me version de cette ressource, 
outre une description plus fine de quelques familles de mots en clusters s&#233;mantiques 
</p>
<p>496</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(Gala et al. 2011), contient des &#233;tiquettes grammaticales, ce qui nous a permis d'extraire 
les 3 785 adjectifs et de les annoter manuellement avec trois valeurs (positif, n&#233;gatif, 
neutre). Cette liste initiale d'adjectifs a &#233;t&#233; compl&#233;t&#233;e avec une centaine d'adjectifs 
suppl&#233;mentaires provenant d'un lexique de l'analyseur XIP. Nous totalisons 3 882 
adjectifs annot&#233;s. 
</p>
<p>2.1 Accord inter-annotateurs 
Afin de prendre en compte l'accord inter-annotateurs, nous avons transform&#233; les 
&#233;tiquettes en pourcentages (100%neg, 33%neutre_66%neg, 66%pos_33%neutre, etc.). Sans 
compter l'accord &#224; 100%, nous obtenons 22 &#233;tiquettes diff&#233;rentes que nous avons 
regroup&#233;es en accord majoritaire (75%-25% si il y a eu quatre annotations -les trois 
annotateurs initiaux plus l'annotation provenant du lexique de XIP- ou 66%-33%). Enfin, 
nous avons consid&#233;r&#233; comme non significatif les cas o&#249; il y a eu un seul annotateur ou 
bien les cas o&#249; il n'y a pas eu de tendance claire (33%pos_33%neutre_33%neg, 
50%pos_25%neutre_25%neg, etc.). La distribution des &#233;tiquettes en termes d'accord inter-
annotateurs est la suivante : 1 341 adjectifs avec accord total (34,5%), 969 accord 
majoritaire (25%) et 1 572 accord non significatif (40,50%)1
</p>
<p>2.2 Propagation des polarit&#233;s vers les familles de mots 
. 
</p>
<p>Pour chacun des 3 882 adjectifs, nous avons &#233;tendu automatiquement sa polarit&#233; vers les 
mots de sa famille morphologique. Trois cas de figure se sont pr&#233;sent&#233;s : (i) la famille 
contient un seul adjectif, (ii) la famille en contient plusieurs, (iii) la famille n'en contient 
aucun.  
Dans le cas o&#249; plusieurs adjectifs sont pr&#233;sents dans la famille (36,97% des cas, 765 
familles au total), la difficult&#233; r&#233;side dans le choix du crit&#232;re d'attribution de la polarit&#233; 
lorsqu'elle est diff&#233;rente. A ce stade, le choix de l'&#233;tiquette &#224; propager devait &#234;tre 
arbitraire, nous n'avons donc pas utilis&#233; l'ensemble de ces donn&#233;es. 
Le 32,19% des familles de POLYMOTS (666 au total) qui ne contiennent pas d'adjectifs, a 
&#233;galement &#233;chapp&#233; au processus d'annotation automatique. Il s'agit de familles pour 
lesquelles la d&#233;rivation est nulle (agrume, aisselle, falaise, oncle, taie, etc.) ou quasi nulle 
(cage/cageot, poutre/poutrelle/poutraison, nid/nidation/nidification/nidifier, etc.). Il s'agit 
aussi de familles pour lesquelles des adjectifs ont &#233;t&#233; rajout&#233;s apr&#232;s avoir constitu&#233; notre 
liste d'adjectifs initiale. 
A ce jour, le lexique que nous avons cr&#233;&#233; par propagation des polarit&#233;s &#224; partir des 
adjectifs initialement annot&#233;s contient, 4 065 mots correspondant aux 638 familles avec 
un seul adjectif (30,84%). La moyenne de mots par famille est de 6,4 mots. Le lexique est 
constitu&#233; de 662 adjectifs (16,3%), 2 337 noms (57,4%), 878 verbes (21,6%) et 193 
adverbes (4,7%), cf.  http://polarimots.lif.univ-mrs.fr.  
</p>
<p>                                                   
1  Cette classification donne une pond&#233;ration sup&#233;rieure aux adjectifs pour lesquels une 
polarit&#233; se d&#233;gage. Ce poids est encod&#233; dans le lexique : poids=1 si 100% d'accord, poids=0.5 si 
75% ou 66% d'accord, poids=0 si les valeurs sont distribu&#233;es (50%-50% ou 33%-33%-33%). 
</p>
<p>497</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.3 Remarques m&#233;thodologiques 
La liste d'adjectifs initiale a &#233;t&#233; annot&#233;e par trois annotateurs b&#233;n&#233;voles diff&#233;rents. Dans 
le cas de sens multiples, nous avons consid&#233;r&#233; le sens propre en priorit&#233; en nous 
appuyant sur les d&#233;finitions du TLFi. Ainsi, par exemple, lancinant a comme d&#233;finition 
&#171; qui se fait sentir par &#233;lancements aigus &#187;. Lors de l'annotation des mots de la famille de 
cet adjectif, la polarit&#233; n&#233;gative a &#233;t&#233; propag&#233;e. Cela ne pose pas de probl&#232;mes pour 
lance (&#171; arme &#187;) ou lanciner (&#171; se faire sentir par des &#233;lancements douloureux &#187;) mais en 
pose pour d'autres termes de la famille comme lancement, &#233;lan, etc. qui devraient &#234;tre 
annot&#233;s comme neutres. Dans notre lexique, les mots polys&#233;miques (ex. lancement sens 
&#171; d&#233;part &#187;) ou homonymiques (ex. &#233;lan sens &#171; animal &#187;) n'ont qu'une polarit&#233; 
correspondant &#224; un seul sens. Le traitement des sens figur&#233;s et de la polys&#233;mie en 
g&#233;n&#233;ral reste un probl&#232;me crucial qui m&#233;rite un travail beaucoup plus approfondi (qui 
sort du cadre de la construction de notre ressource et, de surcro&#238;t, de la pr&#233;sentation 
dans cet article). Par ailleurs, m&#234;me si nous faisons l'hypoth&#232;se qu'un mot poss&#232;de une 
polarit&#233; intrins&#232;que, nous sommes conscientes que celle-ci est susceptible de varier en 
fonction des mots co-occurrents (par exemple, pour gorg&#233;, elle peut osciller entre positif 
et n&#233;gatif dans, respectivement, &#171; un fruit gorg&#233; de vitamines &#187; par rapport &#224; &#171; un terrain 
gorg&#233; d'eau &#187;). Dans ces cas, faute de contexte, nous avons attribu&#233; une polarit&#233; neutre. 
Enfin, une fois la ressource annot&#233;e, un certain nombre de polarit&#233;s attribu&#233;es 
automatiquement ont &#233;t&#233; modifi&#233;es en fonction d'affixes porteurs d'alt&#233;rations 
s&#233;mantiques. C'est le cas d'affixes de n&#233;gation/opposition (anti-, contre- d&#233;-/d&#233;s-, i-/im-
/in-, mal-/m&#233;-) par exemple dans antiatomique, contrepoison, d&#233;boisement, inachev&#233;, 
malais&#233;.... &#201;tant donn&#233; la vari&#233;t&#233; de polarit&#233;s et de cas (opposition nette positif/n&#233;gatif : 
poison/contrepoison, salissure/antisalissure, etc. ; d&#233;gradation ou am&#233;lioration par rapport 
&#224; une marque neutre : obligeant/d&#233;sobligeant, cr&#233;diter/discr&#233;diter, etc.) nous avons modifi&#233; 
les polarit&#233;s des mots avec des affixes de n&#233;gation au cas par cas. 
</p>
<p>2.4 &#201;valuation intrins&#232;que 
Une &#233;valuation manuelle a &#233;t&#233; faite pour 2 954 mots correspondant &#224; 450 familles 
annot&#233;es automatiquement par propagation de la polarit&#233; &#224; partir d'un adjectif (environ 
70% du lexique). Les r&#233;sultats de cette &#233;valuation sont les suivants : 355 familles 
maintiennent la polarit&#233; de l'adjectif (78,89%) et 95 ne la maintiennent pas (21,11%). 
L'impact de la taille des familles morphologiques est un facteur essentiel dans le 
maintien d'une polarit&#233;. Ainsi, plus la taille de la famille est r&#233;duite, plus la polarit&#233; reste 
identique, &#233;tant donn&#233; une coh&#233;sion s&#233;mantique plus forte. C'est la cas de familles de 
moins de huit d&#233;riv&#233;s, par exemple : acari&#226;tre/acari&#226;tret&#233; (100%neg), 
vert&#232;bre/vert&#233;bral/vert&#233;br&#233; (100%neutre), all&#232;gre/all&#233;grement/all&#233;grer/all&#233;gresse (100%pos), 
aromal/aromatique/aromatiser/ar&#244;me... (66%pos_33%neutre), etc. 
Dans le cas de familles avec un seul adjectif mais de taille plus grande (surtout au del&#224; 
d'une dizaine de d&#233;riv&#233;s), la dispersion s&#233;mantique est trop importante, ce qui fait varier 
consid&#233;rablement les polarit&#233;s au sein de la famille (par exemple, 
sec/dess&#233;cher/s&#233;chage/s&#233;choir/..., bomb&#233;/bombe/bombage/bombardement/..., 
nerveux/nerf/nerveusement/nervure/..., etc.). Comme &#233;voqu&#233; plus haut, les probl&#232;mes de 
polys&#233;mie ont &#233;galement un impact tr&#232;s important. Enfin, dans d'autres cas, les suffixes 
</p>
<p>498</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>formateurs d'adjectifs ou participes (-&#233;, -ant, -al, -eux) modifient souvent le sens du mot 
d&#233;riv&#233; et font basculer la polarit&#233; g&#233;n&#233;ralement de neutre &#224; n&#233;gatif (&#226;ge/&#226;g&#233;, 
angle/anguleux, b&#234;te/bestial, bouillir/&#233;bouillant&#233;, larme/larmoyant, etc.) mais aussi de 
neutre &#224; positif (baraque/baraqu&#233;, rayon/rayonnant). 
</p>
<p>3 &#201;valuation par le biais d&#8217;un syst&#232;me d'extraction d'opinions 
</p>
<p>Pour &#233;valuer la qualit&#233; de la ressource lexicale, nous l&#8217;avons int&#233;gr&#233;e &#224; un syst&#232;me 
d&#8217;extraction d&#8217;opinions afin de mesurer l&#8217;impact de cette int&#233;gration sur la capacit&#233; de ce 
syst&#232;me &#224; classer correctement des revues en ligne selon l&#8217;opinion globale de l&#8217;utilisateur. 
</p>
<p>3.1 Constitution des corpus d'&#233;valuation 
Nous avons collect&#233; deux corpus de revues en ligne : l&#8217;un concernant des livres 
(evene.fr/livres) et l&#8217;autre des restaurants (www.linternaute/restaurant). Ces revues sont au 
format html et semi-structur&#233;es. Elles ont &#233;t&#233; converties au format XML en filtrant les 
informations pertinentes : titre du livre/nom du restaurant, auteur du commentaire, 
date, note globale et commentaire libre. Le corpus de revues de livres contient 3 110 
revues, le corpus de revues de restaurants contient 99 373 revues.  
</p>
<p>3.2 Le syst&#232;me d'extraction d'opinions 
Notre syst&#232;me d&#8217;extraction d&#8217;opinions utilise les r&#233;sultats de l&#8217;analyse syntaxique 
profonde fournie par l&#8217;analyseur syntaxique XIP (Ait-Mokthar et al. 2002). Une version 
de l&#8217;extracteur d&#8217;opinions a &#233;t&#233; con&#231;ue pour l&#8217;anglais (Brun 2011), nous l&#8217;adaptons pour 
le fran&#231;ais : l&#8217;analyseur est enrichi avec un lexique contenant les polarit&#233;s associ&#233;es aux 
mots, et par un ensemble de r&#232;gles syntactico-s&#233;mantiques qui extraient de relations 
d&#8217;opinions &#224; &#171; grain fin &#187;, c&#8217;est-&#224;-dire des opinions associ&#233;es aux &#233;l&#233;ments sur lesquelles 
elles portent. Par exemple, pour la phrase suivante, le syst&#232;me extrait : 
&#171; Ce livre est tr&#232;s prenant, l&#8217;histoire est vraiment bien racont&#233;e. &#187; 
OPINION[POSITIVE](prenant, livre) &amp; OPINION[positive](vraiment bien racont&#233;e, histoire
O&#249; le premier &#233;l&#233;ment de la relation est le pr&#233;dicat porteur de la polarit&#233; et le deuxi&#232;me 
&#233;l&#233;ment est la cible de l&#8217;opinion. La premi&#232;re relation est d&#233;duite de la relation 
attributive d&#233;tect&#233;e par XIP entre livre et prenant, adjectif de polarit&#233; positive. La 
deuxi&#232;me relation d&#233;coule du fait que le sujet passif de la phrase est en relation avec un 
pr&#233;dicat modifi&#233; par un adverbe de polarit&#233; positive.  
</p>
<p>).  
</p>
<p>Actuellement, outre le d&#233;veloppement des r&#232;gles d&#8217;extraction de relations d&#8217;opinions, 
l&#8217;emphase a &#233;t&#233; mise sur le traitement des ph&#233;nom&#232;nes de n&#233;gation. Du point de vue des 
ressources lexicales, nous disposions initialement d&#8217;un lexique de polarit&#233;s pr&#233;liminaire, 
construit &#224; la fois manuellement et en adaptant &#224; notre syst&#232;me une partie du lexique de 
Blogoscopie, (Vernier et Monceaux 2010). Il &#233;tait constitu&#233; de 714 mots dont 418 
adjectifs (58,54%), 163 noms (22,83%), 111 verbes (15,55%) et 22 adverbes (3,08%). 
L&#8217;objectif des pr&#233;sents travaux est l&#8217;extension de ce lexique de polarit&#233;s en utilisant les 
familles de mots.   
</p>
<p>499</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.3 Exp&#233;riences et r&#233;sultats 
Pour &#233;valuer la qualit&#233; de la ressource, nous utilisons une m&#233;thode similaire &#224; celle 
utilis&#233;e dans (Brun 2011) qui a &#233;t&#233; con&#231;ue pour &#233;valuer la performance de l&#8217;extracteur 
d&#8217;opinions pour l'anglais. Ici, le syst&#232;me est test&#233; afin d&#8217;&#233;valuer l&#8217;apport de la ressource 
lexicale. Nous avons donc ex&#233;cut&#233; une s&#233;rie des tests concernant l'int&#233;gration des 
lexiques de polarit&#233;. Les deux corpus constitu&#233;s pr&#233;c&#233;demment sont utilis&#233;s pour &#233;valuer 
les performances du syst&#232;me de d&#233;tection d'opinions sur la classification des revues. Ces 
corpus peuvent &#234;tre consid&#233;r&#233;s comme annot&#233;s pour la classification, l&#8217;auteur assignant 
une note globale &#224; la revue. Nous utilisons les relations d'opinions extraites par le 
syst&#232;me pour entra&#238;ner et tester un classifieur SVM binaire (SVMLight, (Joachims 1999)) 
afin de classer les revues comme positives (note entre 3 et 5) ou n&#233;gatives (note entre 0 
et 2). La r&#233;f&#233;rence de cette &#233;valuation est calcul&#233;e avec le lexique initial, avant 
int&#233;gration de la ressource lexicale constitu&#233;e. Le protocole d&#8217;&#233;valuation utilise 200 
revues du corpus &#171; livre &#187; (100 n&#233;gatives, 100 positives, choisies al&#233;atoirement) pour 
entrainer, valider et tester et 4000 revues du corpus &#171; restaurant &#187; (2000 n&#233;gatives, 2000 
positives, choisies al&#233;atoirement) pour entrainer, valider et tester.  
Les traits utilis&#233;s pour le SVM correspondent au nombre d&#8217;occurrences d&#8217;une relation 
d&#8217;opinion portant sur un une cible donn&#233;e : par exemple, si le syst&#232;me extrait, pour une 
revue donn&#233;e, 1 fois la relation OPINION[positive](vraiment bien racont&#233;e, histoire), le trait 
du SVM et sa valeur sont OPINION_POSITIVE_CIBLE_histoire =1 ; si le syst&#232;me extrait 
les relations OPINION[negative](d&#233;cevant, cuisine) et OPINION[negative](mauvais, cuisine
</p>
<p> 
</p>
<p>), 
le trait et sa valeur sont OPINION_NEGATIVE_CIBLE_cuisine=2, etc.  
</p>
<p>Taux d&#8217;accord Exactitude classif. 
Corpus &#171; livres &#187; 
</p>
<p>Exactitude classif. 
Corpus &#171; restaurant &#187; 
</p>
<p>R&#233;f&#233;rence  (1) 79,80% 74,80% 
Adjectifs  100% (2) 81,50% 76,20% 
</p>
<p>100%+75%/66% (3) 82,50% 77,10% 
Lexiques obtenus 
par propagation 
</p>
<p>100% (4) 83,00% 77,90% 
100%+75%/66% (5) 82,40% 77,20% 
</p>
<p>TABLE 1 &#8211; R&#233;sultats de la classification des revues selon le type d&#8217;information lexicale 
Pour les deux corpus, nous avons calcul&#233; l&#8217;exactitude de la classification par le SVM 
(&#171; accuracy &#187;) selon l&#8217;int&#233;gration des donn&#233;es lexicales. Nous avons distingu&#233; les 
ressources pour lesquelles l&#8217;accord entre annotateurs &#233;tait de 100% lors de l&#8217;annotation 
initiale des adjectifs et celle pour lesquels l&#8217;accord &#233;tait majoritaire (75% et 66%2
</p>
<p>                                                   
2 Nous n&#8217;avons pas int&#233;gr&#233; les ressources pour lesquelles l&#8217;accord initial &#233;tait plus faible.  
</p>
<p>). Nous 
</p>
<p>500</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>avons donc men&#233; 5 jeux de tests pour les deux corpus : (1) avec les ressources initiales, 
(2) en int&#233;grant les adjectifs annot&#233;s avec un accord de 100%, puis (3) en int&#233;grant les 
adjectifs dont le taux d&#8217;accord d'annotation manuelle &#233;tait majoritaire, enfin les lexiques 
obtenus par propagation de la polarit&#233; des adjectifs aux familles de mots. Nous avons 
distingu&#233; celles pour lesquelles le taux d&#8217;accord inter-annotateur &#233;tait &#224; 100% (4) et 
celles pour lesquelles l'accord &#233;tait entre 75% et 66% (5).  
Les r&#233;sultats sur les deux corpus de test sont synth&#233;tis&#233;s dans le tableau 1. Nous 
constatons que dans la plupart des cas, il y a un gain, et que la configuration optimale 
est obtenue dans le cas du test (4). Seule l&#8217;int&#233;gration du lexique obtenu 
automatiquement par propagations aux familles de mots pour les adjectifs dont l'accord 
inter-annotateurs &#233;tait de 75-66% fait r&#233;gresser le taux d&#8217;exactitude, ce qui montre 
l&#8217;importance de cet accord. En outre, on observe que les tendances sont les m&#234;mes que le 
corpus traite de litt&#233;rature ou de restaurants.  
</p>
<p>4 Conclusion  
</p>
<p>Dans cet article, nous nous sommes int&#233;ress&#233;es &#224; la cr&#233;ation automatique d'un lexique 
pouvant am&#233;liorer les r&#233;sultats d'un syst&#232;me d'extraction d'opinions. Pour le construire, 
nous avons capitalis&#233; sur une ressource regroupant les mots en familles morphologiques 
et avons observ&#233; si les informations s&#233;mantiques concernant la polarit&#233; des mots 
pouvaient se maintenir ou non au sein d'une m&#234;me famille. Nous avons ainsi propag&#233; 
automatiquement les polarit&#233;s d'une liste d'adjectifs annot&#233;s manuellement vers les mots 
de leurs familles.  
Les r&#233;sultats de cette exp&#233;rience montrent que, dans 78,89% des familles avec un seul 
adjectif, notre hypoth&#232;se se v&#233;rifie, &#224; condition que certains affixes porteurs de 
modifications s&#233;mantiques (n&#233;gation) soient pris en compte. L'utilisation de ce lexique 
dans un syst&#232;me d'extraction d'opinions montre que les r&#233;sultats de la classification des 
opinions s'am&#233;liorent. Les am&#233;liorations plus significatives concernent les mots pour 
lesquels l'accord inter-annotateur est de 100%, ce qui implique que l'&#233;tape d'annotation 
initiale conditionne fortement les r&#233;sultats finaux. 
En perspective, diff&#233;rentes pistes sont envisageables. Concernant la construction du 
lexique, notre int&#233;r&#234;t porte sur le traitement de la polys&#233;mie ainsi que sur la recherche 
de crit&#232;res plus fins pour propager les polarit&#233;s dans le cas de familles &#224; plusieurs 
adjectifs. Concernant l'utilisation du lexique par le syst&#232;me d'extraction d'opinions, nous 
poursuivrons les exp&#233;riences avec ces ressources am&#233;lior&#233;es ainsi que sur d'autres corpus. 
</p>
<p> 
</p>
<p>AIT-MOKTHAR, S., CHANOD, J.P. (2002). Robustness beyond Shallowness: Incremental 
Dependency Parsing. Special Issue of NLE Journal. 
BRUN C. (2011). Detecting opinions using Deep Syntactic Analysis. Proceedings of Recent 
Advances in Natural Language Processing (RANLP 2011), Hissar, Bulgaria. 
HU M. ET LIU B. (2004). Mining and summarizing customer reviews. ACM SIGKDD 
International Conference on Knowledge Discovery &amp; Data Mining (KDD-2004), Seattle, 
</p>
<p>501</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Washington, USA. 
CHOI Y. ET CARDIE C. (2009). Adapting a polarity lexicon using integer linear 
programming for domain-specific sentiment classification. In Proceedings of the conference 
on empirical methods in NLP, EMNLP-09, pages 741-748, Edinbourg, Ecosse. 
ESULI ET SEBASTIANI (2005). Determining semantic orientation of terms through gloss 
classification. In Proceedings of CIKM, pages 617-624,  
ESULI A. ET SEBASTIANI F. (2006). SentiWordNet: a publicly available lexical resource for 
opinion mining. Dans les actes de LREC-06, G&#234;ne, Italie. 
GALA, N., HATHOUT, N., NASR, A., REY, V. ET SEPP&#196;L&#196;, S. (2011) Cr&#233;ation de clusters 
s&#233;mantiques &#224; partir du TLFi. Actes de Traitement Automatique des Langues Naturelles 
(TALN 2011). Montpellier, juin 2011. 
GALA N. ET REY V. (2008). Polymots : une base de donn&#233;es de constructions 
d&#233;rivationnelles en fran&#231;ais &#224; partir de radicaux phonologiques. Actes de Traitement 
Automatique des Langues Naturelles (TALN 2008), Avignon, juin 2008. 
HATZIVASSILOGLOUS V. ET MCKEOWN K. (1997). Predicting the semantic orientation of 
adjectives. Actes de ACL-97, pages 174-181, Madrid, Espagne. 
JOACHIMS T. (1999). Making large-Scale SVM Learning Practical. Advances in Kernel 
Methods &#8211; Support Vector Learning, B. Sch&#246;lkopf and C. Burges and A. Smola (ed.), MIT 
Press.  
KIM S. M. ET HOVY E. (2004). Determining the sentiment of opinions. Actes de COLING-
04, pp. 1367-1373, Barcelone, Espagne. 
LAFOURCADE M. (2007) Making people play for Lexical Acquisition. Actes de 7th 
Symposium on Natural Language Processing, Pattaya, Thailand. 
LU Y., CASTELLANOS M., DAYAL U., ZHAI CH. (2011). Automatic construction of context-
aware sentiment lexicon: an optimization approach. Actes de WWW Conference, session 
semantic analysis. Hyderabad, India, pp. 347-356. 
PANG B., LEE L. ET VAITHYANATHAN S. (2002) Thumbs up? Sentiment classification using 
machine learning techniques. In Proceedings of the conference on empirical methods in NLP, 
EMNLP-02, pp. 79-86, Philadelphia, USA. 
STRAPPARAVA C. ET VALITUTTI A. (2004). WordNet Affect : an affective extension of 
WordNet. Actes de 4th International conference on Language Resources and Evaluation 
(LREC-04), Lisbon, Portugal. 
TABOADA M., BROOKE J., TOFILOSKI M., VOLL K., STEDE M. (2011) Lexicon-based methods 
for sentiment analysis. Dans Computational Linguistics, Volume 37 (2). 
TURNEY P. (2002) Thumbs up or thumbs down? Semantic orientation applied to 
unsupervised classification of reviews. Actes de ACL-02, pages 417-424, Philadelphia, 
USA. 
VERNIER M. ET MONCEAUX L. (2010) Enrichissement d'un lexique de termes subjectifs &#224; 
partir de tests s&#233;mantiques. Revue TAL volume 51 (1), pp. 125-149. 
</p>
<p>502</p>

</div></div>
</body></html>