<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La &quot;multi-extraction&quot; comme strat&#233;gie d'acquisition optimis&#233;e de ressources terminologiques et non terminologiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 2: TALN, pages 511&#8211;518,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>La &quot;multi-extraction&quot; comme strat&#233;gie d'acquisition 
optimis&#233;e de ressources (non) terminologiques 
</p>
<p>Blandine Plaisantin Alecu1, Izabella Thomas2, Julie Renahy1 
(1) Prolipsia SAS, TEMIS Innovation, 18 r Alain Savary, 25000 Besan&#231;on 
</p>
<p>(2) Centre Tesni&#232;re, Universit&#233; de Franche-Comt&#233;, UFR SLHS, 30 r M&#233;gevand, 25030 Besan&#231;on 
{blandine.alecu, julie.renahy}@prolipsia.com, 
</p>
<p>izabella.thomas@univ-fcomte.fr 
</p>
<p>R&#201;SUM&#201; ____________________________________________________________________________________________________________   
A partir de l'&#233;valuation d'extracteurs de termes men&#233;e initialement pour d&#233;tecter le 
meilleur outil d'acquisition du lexique d'une langue contr&#244;l&#233;e, nous proposons dans cet 
article une strat&#233;gie d'optimisation du processus d'extraction terminologique. Nos 
travaux, men&#233;s dans le cadre du projet ANR Sensunique, prouvent que la &#171; multi-
extraction &#187;, c'est-&#224;-dire la coop&#233;ration de plusieurs extracteurs de termes, donne des 
r&#233;sultats significativement meilleurs que l&#8217;extraction via un seul outil. Elle permet &#224; la 
fois de r&#233;duire le silence et de filtrer automatiquement le bruit gr&#226;ce &#224; la variation d'un 
indice relatif au potentiel terminologique.  
ABSTRACT _________________________________________________________________________________________________________  
Multi-extraction as a strategy of optimized extraction of terminological and 
lexical resources 
Based on the evaluation of terminological extractors, initially to find the best tool for 
building a controlled language lexicon, we propose a strategy of optimized extraction of 
terminological resources. Our work highlights that the cooperation of several extraction 
tools gives better results than the use of a single one. It both reduces silence and 
automatically filters noise thanks to a variable related to termhood.  
MOTS-CL&#201;S : terminologie, extraction, langue contr&#244;l&#233;e, potentiel terminologique, 
filtrage de termes. 
KEYWORDS : terminology, extraction, controlled language, termhood, term filtering. 
</p>
<p>1 Introduction 
1.1 Contexte, probl&#233;matique et objectifs 
Le pr&#233;sent article fait &#233;tat de recherches effectu&#233;es dans le cadre du projet Sensunique 
(ANR-EMMA-2010-039), qui fait suite au projet LiSe (ANR-06-SECU-007) dans lequel 
nous avions con&#231;u une m&#233;thodologie de contr&#244;le de la langue fran&#231;aise et d&#233;velopp&#233; un 
prototype exp&#233;rimental d'aide &#224; la r&#233;daction en Langue Contr&#244;l&#233;e (LC). Une des 
ambitions du projet Sensunique est d&#8217;all&#233;ger et de fiabiliser la t&#226;che de conception 
d'une LC par un linguiste, en mettant &#224; sa disposition des outils de recensement du 
Lexique d&#8217;une LC (d&#233;sormais LLC) ; c'est sur ce point que nous concentrons cet article. 
Dans notre approche, une LC doit &#234;tre circonscrite &#224; un domaine et &#224; un environnement 
de r&#233;daction pr&#233;cis, c&#8217;est-&#224;-dire pour un public restreint et pour un type de textes 
particulier ; on peut d&#232;s lors parler d&#8217;une LC &#171; sur mesure &#187; ; la pr&#233;cision des facteurs 
</p>
<p>511</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>influen&#231;ant le texte &#224; g&#233;n&#233;rer, et donc de la LC sous-jacente, diff&#233;rencie notre approche 
(Renahy et al., 2009) de celles des travaux men&#233;s sur le fran&#231;ais1. En outre, elle est 
issue d'une analyse de corpus (g&#233;n&#233;ralement de petite taille), lequel doit recenser 
l'ensemble des textes en vigueur pour l'activit&#233; et le public concern&#233;s. 
A notre connaissance, aucun outil d&#233;di&#233; au recensement d'un LLC n'existe &#224; ce jour. 
Cependant, puisque l&#8217;acquisition d&#8217;un LLC peut &#234;tre compar&#233;e jusqu&#8217;&#224; un certain point &#224; 
l'acquisition terminologique, nous avons choisi de nous appuyer sur les Extracteurs de 
Termes (EdT), tout en tentant d'am&#233;liorer leurs r&#233;sultats pour qu'ils r&#233;pondent &#224; nos 
besoins. Plus pr&#233;cis&#233;ment, nous avons &#233;valu&#233; le b&#233;n&#233;fice que nous pourrions tirer de la 
coop&#233;ration de plusieurs EdT. De multiples travaux fond&#233;s sur la coop&#233;ration d'outils 
ont d&#233;montr&#233; son int&#233;r&#234;t : en premier pour la reconnaissance vocale avec le syst&#232;me 
ROVER (Fiscus, 1997), repris, pour n'en citer que quelques uns2, pour des analyseurs 
syntaxiques (Brunet-Manquat, 2004) ou des &#233;tiqueteurs morphosyntaxiques (Serp, 
2008). Mais ce principe n'a jamais &#233;t&#233; appliqu&#233;, &#224; notre connaissance, aux EdT. 
</p>
<p>1.2 LLC et Ressource Terminologique (RT) 
Les notions de RT, r&#233;sultat de l'acquisition terminologique, et LLC se recoupent et se 
distinguent &#224; la fois. La principale diff&#233;rence concerne leurs p&#233;rim&#232;tres respectifs. Parce 
que tous deux visent &#224; couvrir un domaine particulier, renvoyant &#224; des concepts 
sp&#233;cifiques3, RT et LLC recensent chacun des termes. Mais le p&#233;rim&#232;tre d'une RT s'arr&#234;te 
aux unit&#233;s terminologiques sp&#233;cifiques du domaine alors qu'un LLC doit contenir 
l&#8217;ensemble du lexique n&#233;cessaire &#224; la r&#233;daction d'un texte dans sa globalit&#233;. M&#248;ller et al. 
(2006) parlent de &#171; mots &#187; (r&#233;f&#233;rant alors &#224; des unit&#233;s monolex&#233;miques comme 
multilex&#233;miques) afin de ne pas confondre les unit&#233;s d&#8217;un LLC avec des unit&#233;s 
terminologiques. Nous choisissons, quant &#224; nous, de consid&#233;rer comme Unit&#233;s 
Lexicales4 (UL) toutes les unit&#233;s d&#8217;un LLC.  
Pour &#234;tre exhaustif, un LLC doit contenir des UL non sp&#233;cifiques (par extension, non 
terminologiques). On ne peut pas appliquer une dichotomie sp&#233;cifique-non sp&#233;cifique : 
il s'agit, comme le dit Camlong (1996) d'un continuum allant du vocabulaire 
terminologique du domaine au vocabulaire g&#233;n&#233;ral. Un texte &#233;crit en LC peut inclure 
diff&#233;rents types d&#8217;UL, illustr&#233;s ici avec des exemples de protocoles d&#8217;immunobiologie : 
les termes du domaine (anticorps monoclonaux) ; ceux d&#8217;un autre domaine (fen&#234;tres 
informatiques) ; les UL du lexique g&#233;n&#233;ral prenant un sens sp&#233;cifique dans le domaine 
trait&#233; (population (bact&#233;rienne)) ; celles du lexique g&#233;n&#233;ral rentrant dans la composition 
de termes (anticorps de ch&#232;vre) ou gardant leur sens courant (&#233;chantillons divers) et les 
mots grammaticaux. Une RT ne suffit donc pas &#224; l'exhaustivit&#233; d'un LLC. 
Puisqu'un LLC ne contient pas que des UL terminologiques, nous avons imagin&#233; une 
</p>
<p>                                                   
1 Dont l'unique exemple est Le Fran&#231;ais Rationalis&#233;, du GIFAS (1990). 
2 Voir Brunet-Manquat (2004) pour une liste plus exhaustive.  
3 En admettant que ces concepts sont d&#233;nomm&#233;s par des termes. 
4 Nous reprenons ici la notion d&#8217;unit&#233; lexicale telle que d&#233;finie par (L&#8217;Homme, 2005) 
</p>
<p>512</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>strat&#233;gie de mise en exergue du statut terminologique des candidats, extraits par les 
EdT, bas&#233;e sur leur potentiel terminologique (termhood), c&#8217;est-&#224;-dire le degr&#233; de 
sp&#233;cialisation de leur sens dans le domaine &#224; l&#8217;&#233;tude (Kageura et Umino, 1996). 
</p>
<p>1.3 Hypoth&#232;se 
Nous posons l&#8217;hypoth&#232;se (H1) que l'utilisation simultan&#233;e de plusieurs EdT (que nous 
appellerons d&#233;sormais la &#171; multi-extraction &#187;) est plus profitable (qu'un seul) au 
recensement du LLC, hypoth&#232;se que l'on peut subdiviser en : 
</p>
<p>- (H1.1) : les r&#233;sultats propos&#233;s par plusieurs EdT sont les candidats-termes (CT) 
les plus pertinents, et peuvent &#234;tre consid&#233;r&#233;s comme UL terminologiques (la 
multi-extraction permet de d&#233;terminer le statut terminologique d'une UL en 
faisant ressortir son potentiel terminologique). 
</p>
<p>-  (H1.2) : les CT non valides sont des UL candidates non terminologiques 
potentiellement pertinentes (le bruit des EdT, dans leur fonction initiale de 
recensement des termes, peut diminuer le silence, dans la fonction d&#233;tourn&#233;e 
de recensement des UL d'un LLC). Si cela est confirm&#233;, la t&#226;che de recensement 
d'un LLC peut &#234;tre organis&#233;e, en classant les r&#233;sultats par poids terminologique5 
(Pt) et/ou comme aide au filtrage du bruit pour l'acquisition de RT. 
</p>
<p>2 Mat&#233;riel et m&#233;thodes 
2.1 Corpus et lexique de r&#233;f&#233;rence 
Nous avons constitu&#233; un corpus de r&#233;f&#233;rence de 14 modes op&#233;ratoires 
d&#8217;immunobiologie (10 064 mots) de l'&#201;tablissement Fran&#231;ais du Sang (EFS) Bourgogne 
Franche-Comt&#233;6. Notons que la m&#233;thodologie pens&#233;e est ind&#233;pendante du domaine. 
Nous avons construit manuellement sur la base de ce corpus un LLC de r&#233;f&#233;rence, gr&#226;ce 
&#224; des crit&#232;res linguistiques, la consultation de ressources terminologiques7 et d&#8217;experts 
m&#233;tier8. Le lexique de r&#233;f&#233;rence obtenu contient 1 512 UL (lemmes) pour 1 729 formes 
fl&#233;chies (utilis&#233;es en corpus), 7 cat&#233;gories syntaxiques fonctionnelles distinctes 
(distinction minimale n&#233;cessaire pour un LLC : Adjectif, Adverbe, Nom, Nom propre, 
Verbe au participe pass&#233;, Verbe au participe pr&#233;sent, Verbe hors participes), 92 
matrices morphosyntaxiques distinctes (exemple : Nom Prep Det Nom Prep Det Nom Prep 
Nom pour fraction de l&#8217;immunoglobuline de l&#8217;antis&#233;rum de lapin) et 2 statuts lexico-
terminologiques distincts (terminologique et g&#233;n&#233;ral).  
</p>
<p>2.2 Pr&#233;-s&#233;lection des EdT comme outils de recensement du LLC 
Nous avons &#233;tabli les crit&#232;res suivants, afin d'estimer l'utilisabilit&#233; et l'ad&#233;quation 
                                                   
5 Pt est un indice de fiabilit&#233; d'une ULC en tant que terme (relatif &#224; son potentiel terminologique). 
6 Documents d&#233;crivant le d&#233;roulement d&#233;taill&#233; et structur&#233; des diff&#233;rentes &#233;tapes d'une manipulation. 
7 Le Grand Dictionnaire Terminologique, Termium Plus, le dictionnaire m&#233;dical Masson 5&#232;me &#233;dition. 
8 EFS Bourgogne Franche-Comt&#233;, partenaire Sant&#233; dans le projet Sensunique.  
</p>
<p>513</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>technique des EdT &#224; nos besoins et de nous limiter &#224; 3 EdT (co&#251;t raisonnable de la 
t&#226;che d'&#233;valuation) : langue (fran&#231;ais), m&#233;thode (non purement statistique 9  : 
linguistique ou hybride), disponibilit&#233; (de suite), licence (libre ou commerciale : dans 
ce cas, co&#251;t faible ou nul), maturit&#233; de l'outil (non prototype), environnement 
informatique (Unix), modalit&#233; d'ex&#233;cution (service web ou appel en ligne de 
commande), temps d'ex&#233;cution (respectant le seuil d'appel en web service) et domaine 
d'application (non sp&#233;cifique). 
Ces crit&#232;res nous ont men&#233;s aux EdT Acabit (Daille, 1994), TermoStat (Drouin, 2003) et 
YaTeA (Aubin et al., 2006). Acabit proc&#232;de par identification de groupes nominaux 
complexes sur des matrices syntagmatiques pour extraction de bi-termes, regroupement 
de variantes (&#224; partir de ces bi-termes) puis filtrage statistique. YaTeA encha&#238;ne 
identification de groupes nominaux &#224; partir de fronti&#232;res morphosyntaxiques, calcul de 
leurs structures en t&#234;te et modifieur, puis exploitation de ces structures pour l'analyse 
des groupes nominaux restants. Enfin, TermoStat fonctionne par d&#233;tection de CT sur 
patrons morphosyntaxiques puis pond&#233;ration et filtrage selon la sp&#233;cificit&#233; de chaque 
CT (m&#233;thode de mise en opposition de corpus sp&#233;cialis&#233;s et non sp&#233;cialis&#233;s). En outre, 
YaTeA et TermoStat ont l'avantage d'extraire des termes simples en plus des termes 
complexes ; et TermoStat est le seul &#224; extraire &#233;galement des termes non nominaux. 
</p>
<p>2.3 Evaluation 
Deux des t&#226;ches du linguiste lors de la conception d'un LLC ont &#233;t&#233; &#233;valu&#233;es : 
</p>
<p>1. Recensement des UL (de l'ensemble des UL d'un LLC) ; 
2. Recensement des termes (des UL de statut terminologique d'un LLC). 
</p>
<p>Pour chacune de ces t&#226;ches, nous avons proc&#233;d&#233; &#224; 3 exp&#233;rimentations : 
1. &#201;valuation des r&#233;sultats de chaque EdT pris s&#233;par&#233;ment ; 
2. &#201;valuation des r&#233;sultats cumul&#233;s de tous les EdT (union) ; 
3. &#201;valuation des r&#233;sultats consolid&#233;s, ou communs (intersection). 
</p>
<p>Pour chaque &#233;valuation, nous avons calcul&#233; les mesures suivantes : 
- Pr&#233;cision : P = (formes extraites correctes) / (formes extraites) ; 
- Rappel : R = (formes extraites correctes) / (formes de r&#233;f&#233;rence) ; 
</p>
<p>2.3.1 Appariement des r&#233;sultats 
Notre objectif &#233;tant d&#8217;estimer la capacit&#233; des EdT &#224; recenser les UL (terminologiques ou 
non) et non leur capacit&#233; de lemmatisation ou de variation terminologique, nous avons 
opt&#233; pour comparer les formes fl&#233;chies. Contrairement &#224; Hamon (2000), nous ne 
cherchons pas les diff&#233;rents types d&#8217;erreurs, mais &#233;valuons la pr&#233;sence d&#8217;une forme 
extraite dans le lexique de r&#233;f&#233;rence. Pour ne pas comparer les regroupements op&#233;r&#233;s 
par les EdT, nous avons extrait une liste des formes fl&#233;chies de tous les CT. Nous avons 
ainsi pu apparier les formes fl&#233;chies candidates avec celles du lexique de r&#233;f&#233;rence. 
                                                   
9 A cause de la taille estim&#233;e des corpus utilis&#233;s pour concevoir une LC. 
</p>
<p>514</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 R&#233;sultats et discussion 
3.1 T&#226;che 1 : Recensement des UL 
</p>
<p>Exp&#233;rimentations Outil(s) P R 
R&#233;sultats d'un 
</p>
<p>EdT 
TermoStat 64 % 40 % 
</p>
<p>YaTeA 43 % 52 % 
Acabit 44 % 17 % 
</p>
<p>R&#233;sultats 
cumul&#233;s (union) 
</p>
<p>TermoStat &#8746; YaTeA 44 % 68 % 
TermoStat&#8746; ACABIT 55 % 48 % 
</p>
<p>YaTeA &#8746; ACABIT 41 % 59 % 
TermoStat &#8746; YaTeA &#8746; ACABIT 42 % 72 % 
</p>
<p>R&#233;sultats 
communs 
</p>
<p>(intersection) 
</p>
<p>TermoStat &#8898; YaTeA 74 % 22 % 
TermoStat &#8898; ACABIT 63 % 9 % 
</p>
<p>YaTeA &#8898; ACABIT 62 % 11 % 
(TermoStat &#8898; YaTeA) ou (TermoStat &#8898; 
</p>
<p>ACABIT) ou (YaTeA &#8898; ACABIT)10 
69 % 29 % 
</p>
<p>TABLE 1 &#8211; T&#226;che de recensement des UL 
La premi&#232;re exp&#233;rimentation montre que, dans le meilleur des cas, en utilisant un seul 
EdT, 52 % (valeur en gras, Table 1) des UL du LLC sont recens&#233;es, ce qui est loin de 
satisfaire le crit&#232;re d&#8217;exhaustivit&#233;. 
Pour la deuxi&#232;me exp&#233;rimentation, le cumul des r&#233;sultats des 3 EdT permet de couvrir 
quasiment &#190; du lexique de r&#233;f&#233;rence (rappel de 72 %, en gras, Table 1). Ceci confirme 
l&#8217;hypoth&#232;se H1 : la multi-extraction permet de mieux couvrir le LLC que l'utilisation 
d'un seul EdT. En revanche, dans ce cas, il reste &#224; filtrer manuellement pr&#232;s de 60 % 
des propositions et il devient n&#233;cessaire de filtrer automatiquement le bruit. 
La troisi&#232;me exp&#233;rimentation d&#233;montre que la combinaison d'EdT obtenant la meilleure 
pr&#233;cision est TermoStat + YaTeA (74 %, Table 1). Cependant, il appara&#238;t &#233;galement 
que n&#8217;importe quelle combinaison de 2 EdT donne une pr&#233;cision de 69 % (donc 
l&#233;g&#232;rement plus faible). Nous proposons de filtrer le bruit sur cette derni&#232;re 
combinaison en consid&#233;rant que ce cas de figure sera plus g&#233;n&#233;ralisable (&#224; d&#8217;autres 
domaines) dans la mesure o&#249; il &#171; suffit &#187; qu&#8217;une UL soit propos&#233;e par 2 EdT pour &#234;tre 
estim&#233;e pertinente. L'op&#233;ration consisterait &#224; augmenter la valeur d'un indice relatif au 
potentiel terminologique des UL concern&#233;es (propos&#233;es par 2 EdT), et creuser ainsi 
l'&#233;cart avec celles qui ne sont pas propos&#233;es que par un EdT. Cela revient &#224; distinguer 
les ULC &#224; fort potentiel terminologique de celles &#224; faible potentiel terminologique en les 
                                                   
10 Sur l'ensemble des r&#233;sultats communs &#224; (propos&#233;s par) au moins 2 EdT, quels qu'ils soient. 
</p>
<p>515</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>classant et non en supprimant ces derni&#232;res.  
</p>
<p>3.2 T&#226;che 2 : Recensement des termes 
</p>
<p>Exp&#233;rimentations Outil P R 
R&#233;sultats d'un 
</p>
<p>EdT 
TermoStat 28 % 52 % 
</p>
<p>YaTeA 16 % 58 % 
ACABIT 14 % 17 % 
</p>
<p>R&#233;sultats 
cumul&#233;s (union) 
</p>
<p>TermoStat &#8746; YaTeA 16 % 76 % 
TermoStat&#8746; ACABIT 23 % 60 % 
</p>
<p>YaTeA &#8746; ACABIT 14 % 63 % 
TermoStat &#8746; YaTeA &#8746; ACABIT 15 % 79 % 
</p>
<p>R&#233;sultats 
communs 
</p>
<p>(intersection) 
</p>
<p>TermoStat &#8898; YaTeA 37 % 33 % 
TermoStat &#8898; ACABIT 24 % 11 % 
</p>
<p>YaTeA &#8898; ACABIT 26 % 14 % 
(TermoStat &#8898; YaTeA) ou (TermoStat &#8898; ACABIT) 
</p>
<p>ou (YaTeA &#8898; ACABIT) 
31 % 39 % 
</p>
<p>TermoStat &#8898; YaTeA &#8898; ACABIT 32 % 9 % 
</p>
<p>TABLE 2 &#8211; T&#226;che de recensement des termes 
La mesure de pr&#233;cision de 37 % (TermoStat &#8898; YaTeA, Table 2) pour les r&#233;sultats 
communs permet de valider l&#8217;hypoth&#232;se H1.1. : la multi-extraction aide &#224; d&#233;terminer le 
statut terminologique d'une UL en faisant ressortir son potentiel terminologique. La 
diff&#233;rence (m&#234;me faible) de rappel entre les r&#233;sultats cumul&#233;s des 3 EdT pour le 
recensement des termes (79 %, Table 2) et le recensement des UL (72 %, Table 1) 
d&#233;montre qu'une partie des candidats propos&#233;s ne sont pas des termes mais sont, pour 
le LLC, des UL correctes, de statut non terminologique (hypoth&#232;se H1.2). Bien que les 
r&#233;sultats soient moindres que ceux escompt&#233;s, ils demeurent satisfaisants et il est 
possible qu'ils soient meilleurs sur des corpus plus cons&#233;quents. 
En r&#233;sum&#233;, cumuler les r&#233;sultats de tous les EdT permet de couvrir 79 % des termes 
(rappel TermoStat &#8746; YaTeA &#8746; ACABIT, Table 2), et le meilleur moyen d&#8217;aider &#224; 
d&#233;terminer le statut d&#8217;une UL est, non pas de se baser sur les r&#233;sultats communs aux 3 
EdT (contrairement &#224; ce que nous attendions), mais de se baser sur les r&#233;sultats 
communs aux 2 EdT TermoStat et YaTeA (pr&#233;cision de 37 % dans la Table 2). Ceci 
valide tout de m&#234;me l&#8217;hypoth&#232;se selon laquelle la multi-extraction aide &#224; recenser et &#224; 
organiser la validation d&#8217;un LLC. 
</p>
<p>3.3 Strat&#233;gie bas&#233;e sur les observations 
Le fait que la multi-extraction permette &#224; la fois de r&#233;duire le silence et le bruit des 
propositions nous incite &#224; introduire un indice, relatif au potentiel terminologique, 
</p>
<p>516</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>variable en fonction des r&#233;sultats des EdT. Nous proposons d&#8217;attribuer &#224; chaque UL 
candidate un poids terminologique Pt ; puis de faire varier ce Pt initialement nul en 
fonction des r&#233;sultats de chaque EdT. Nous proposons une strat&#233;gie de variation du Pt 
consistant &#224; augmenter du Pt d'une UL en fonction du nombre d'EdT qui la proposent 
comme candidate. Ce principe traduit bien les faits suivants :  
</p>
<p>- un EdT propose un candidat &#171; terme &#187; donc ayant un potentiel terminologique ; 
- un candidat a d&#8217;autant plus de probabilit&#233; d&#8217;&#234;tre un terme fiable qu&#8217;il y a d'EdT 
</p>
<p>le proposant (comme candidat) ; 
- les r&#233;sultats pourront &#234;tre class&#233;s et valid&#233;s selon la valeur du Pt. 
</p>
<p>Notons que les 3 EdT utilis&#233;s int&#232;grent a priori (TermoStat) ou a posteriori (Acabit et 
YaTeA) des indices statistiques afin de cerner les termes les plus pertinents. Bien qu&#8217;il 
puisse &#234;tre int&#233;ressant de coupler les valeurs de ces indices (diff&#233;rents pour chaque 
candidat) au Pt, nous avons fait le choix de ne pas le faire express&#233;ment, afin de ne pas 
rendre l&#8217;algorithme de pond&#233;ration d&#233;pendant des EdT utilis&#233;s (et puisque le calcul de 
Pt repose d&#233;j&#224; indirectement sur l&#8217;efficacit&#233; des EdT utilis&#233;s).  
</p>
<p>4 Conclusion 
L&#8217;exploitation des r&#233;sultats des exp&#233;rimentations men&#233;es nous a permis de proposer une 
m&#233;thode d'acquisition d'un LLC et d'optimisation de l'acquisition terminologique. Elle 
repose sur la coop&#233;ration de plusieurs EdT et permet de faire ressortir le potentiel 
terminologique des candidats, de r&#233;duire le silence obtenu avec un seul EdT et de filtrer 
le bruit en classant les candidats sur un indice de potentiel terminologique. 
Outre concevoir un outil d&#233;di&#233; au recensement d'un LLC, l'originalit&#233; de ces travaux 
r&#233;side dans le fait que nous proposons de faire coop&#233;rer plusieurs EdT pour am&#233;liorer 
leurs r&#233;sultats et mettre en place un syst&#232;me de filtrage, alors que les travaux ant&#233;rieurs 
d'&#233;valuation d'EdT visaient leur mise en opposition (ou classement) (Grabar, 2004). 
Nous avons mis au point, pour am&#233;liorer l'extraction terminologique, un syst&#232;me &#224; base 
de vote, sur la m&#233;thode dite du &quot;vote &#224; la majorit&#233;&quot; (Brunet-Manquat, 2004) o&#249; plus un 
terme est propos&#233; par diff&#233;rents EdT, plus sa fiabilit&#233; est renforc&#233;e.  
Nous avons con&#231;u une plateforme impl&#233;mentant cette m&#233;thode. Elle int&#232;gre les 
&#233;tiqueteurs morphosyntaxiques Brill11 et TreeTagger, le lemmatiseur Flemm (Namer, 
2000) pour les analyses pr&#233;alables et n&#233;cessaires &#224; l'extraction, et les EdT Acabit, 
TermoStat et YaTeA. Elle permet de proc&#233;der &#224; l'extraction et &#224; l&#8217;organisation de 
lexique terminologique et non-terminologique &#224; partir d'un corpus fran&#231;ais au format 
XML TEI P5. La plateforme est param&#233;tr&#233;e par d&#233;faut sur le principe du &quot;vote &#224; la 
majorit&#233;&quot; mais l'utilisateur peut ajuster le poids attribu&#233; &#224; chaque EdT, en fonction de 
ses besoins, afin de rendre cette plateforme aussi flexible que possible. Nous avons 
&#233;galement int&#233;gr&#233; un module d'interrogation de ressources terminologiques ou lexicales 
existantes, ce qui permet de renforcer, une nouvelle fois, la fiabilit&#233; du potentiel 
</p>
<p>                                                   
11 Avec le lexique et le fichier de r&#232;gles fournis par l'ATILF-CNRS, de Nancy. 
</p>
<p>517</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>terminologique des candidats. 
</p>
<p> &#233; &#233;rences 
AUBIN, S. et HAMON, T. (2006). Improving Term Extraction with Terminological 
Resources. In : Advances in Natural Language Processing, 5th International Conference on 
NLP (FinTAL&#8217;2006), Springer, 2006, p. 380-387. 
BRUNET-MANQUAT, F. (2004). Fusionner pour mieux analyser : Conception et &#233;valuation 
de la plate-forme de combinaison. In Actes de TALN-2004 (Traitement automatique des 
langues naturelles). Fez, Maroc, 19-22 avril 2004. vol. 1/1, p. 111-120. 
CAMLONG, A. (1996). M&#233;thode d'analyse lexicale textuelle et discursive, Paris, Orphrys. 
DAILLE, B. (1994). Study and Implementation of Combined Techniques for Automatic 
Extraction of Terminology. In : The Balancing Act: Combining Symbolic and Statistical 
Approaches to Language. Workshop at the 32nd Annual Meeting of the ACL (ACL'94), Las 
Cruces, New Mexico, USA. 
DROUIN, P. (2003). Term Extraction Using non-Technical Corpora as Point of Leverage. 
In : Terminology, vol.9, n&#176;1, John Benjamins Publishing Company: Amsterdam/Philadelphia, 
p. 99-115. 
FISCUS, J.G. (1997), A post-processing system to yield reduced error word rates: 
Recognizer output voting error reduction (ROVER). In IEEE Workshop on Automatic 
Speech Recognizer and Understanding, p. 347-354. 
GRABAR N. (2004). Terminologie m&#233;dicale et morphologie : Acquisition de ressources 
morphologiques et leur utilisation pour le traitement de la variation terminologique, 
Th&#232;se de Doctorat en Informatique M&#233;dicale, Universit&#233; Paris 6. 
HAMON, T. (2000). Variation s&#233;mantique en corpus sp&#233;cialis&#233; : Acquisition de relations 
de synonymie &#224; partir de ressources lexicales, Th&#232;se de Doctorat en Informatique, 
Universit&#233; Paris Nord. 
KAGEURA, K. et UMINO, B. (1996). Methods for automatic term recognition: A review. In 
: Terminology, 3(2), p. 259&#8211;289. 
L&#8217;HOMME, M.-C. (2005). Sur la notion de terme. In Meta : journal des traducteurs, vol. 50, 
n&#176; 4, p. 1112-1132. 
M&#216;LLER, M. H., CHRISTOFFERSEN, E., HANSEN, M. (2006). Building a Controlled Language 
Lexicon for Danish. In LSP and Professional Communication, vol. 6, Nr. 1, p. 12-38. 
NAMER, F. (2000). FLEMM : un analyseur flexionnel du fran&#231;ais &#224; base de r&#232;gles. In 
Traitement Automatique des Langues ;vol. 41/2, p. 523-547. 
RENAHY, J., DEVITRE, D., THOMAS, I., DZIADKIEWICZ, A., (2009). Controlled language 
norms for the redaction of security protocols: finding the median between system needs 
and user acceptability. In Proceedings of the 11th International Symposium on Social 
Communication, Santiago de Cuba, Cuba, 19-23 January 2009, p. 289-293. 
</p>
<p>518</p>

</div></div>
</body></html>