<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une mesure de pertinence pour le tri de l&#8217;information dans un index de &#8220;fin de livre&#8221;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Une mesure de pertinence pour le tri de l&#8217;information dans
un index de &#8220;fin de livre&#8221;
</p>
<p>Touria Ait El Mekki et Adeline Nazarenko
Laboratoire d&#8217;Informatique de Paris-Nord
</p>
<p>99 Avenue J.-B. Cl&#233;ment
93430 Villetaneuse FRANCE
</p>
<p>taem,nazarenko@lipn.univ-paris13.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Nous nous int&#233;ressons &#224; la construction des index de fin de livres. Nous avons d&#233;velopp&#233; le sys-
t&#232;me IndDoc qui aide la construction de tels index. L&#8217;un des enjeux de la construction d&#8217;index
est la s&#233;lection des informations : s&#233;lection des entr&#233;es les plus pertinentes et des renvois au
texte les plus int&#233;ressants. Cette s&#233;lection est &#233;videmment utile pour le lecteur qui doit trou-
ver suffisamment d&#8217;information mais sans en &#234;tre submerg&#233;. Elle est &#233;galement pr&#233;cieuse pour
l&#8217;auteur de l&#8217;index qui doit valider et corriger une &#233;bauche d&#8217;index produite automatiquement
par IndDoc. Nous montrons comment cette s&#233;lection de l&#8217;information est r&#233;alis&#233;e par IndDoc.
Nous proposons une mesure qui permet de trier les entr&#233;es par ordre de pertinence d&#233;croissante
et une m&#233;thode pour calculer les renvois au texte &#224; associer &#224; chaque entr&#233;e de l&#8217;index.
</p>
<p>This paper deals with the construction of end-of-book indexes. We have developed the IndDoc
system which assists the construction of such indexes. One of the stakes of the construction
of an index is the information selection: selection of the most relevant entries and the most
interesting textual fragments. This selection is obviously useful for the reader who is looking
for information. It is also invaluable for the index author who has to validate and correct an
outline of index produced automatically by IndDoc. We show how this information selection is
carried out by IndDoc. We put forward a measure which sorts the entries in decreasing relevance
order and a method to calculate the references to text for each entry.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Segmentation th&#233;matique de texte, extraction d&#8217;information, indexation automatique
Text segmentation, information extraction, automatic indexing</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Touria Ait El Mekki, Adeline Nazarenko
</p>
<p>1 Introduction
</p>
<p>Les index de documents sont des outils de navigation traditionnels. Consid&#233;rant que la pr&#233;sence
d&#8217;index est souhaitable dans beaucoup de documents mais que le co&#251;t de construction des in-
dex est parfois r&#233;dhibitoire, nous proposons une m&#233;thode qui permet de d&#233;grossir le travail
d&#8217;indexation tout en assurant sa coh&#233;rence et en tirant parti de la dimension &#233;lectronique du
document. IndDoc est un syst&#232;me d&#8217;aide &#224; la cr&#233;ation d&#8217;un index de document qui s&#8217;appuie
sur le texte du document pour proposer une &#233;bauche d&#8217;index construite automatiquement &#224;
l&#8217;indexeur qui peut alors la valider et/ou la compl&#233;ter. Dans cette &#233;bauche d&#8217;index l&#8217;information
est tri&#233;e. Cela am&#233;liore l&#8217;acc&#232;s &#224; l&#8217;information pour le lecteur mais cela facilite aussi le travail
de l&#8217;indexeur : il peut focaliser son travail de validation sur les &#233;l&#233;ments les plus pertinents et
construire des index de diff&#233;rentes tailles en faisant varier le seuil de pertinence.
</p>
<p>Nous mettons ici l&#8217;accent sur ces probl&#232;mes de s&#233;lection et de tri de l&#8217;information pertinente et
nous montrons comment ils sont pris en compte dans IndDoc. La section 2 pr&#233;sente les index
de fin de livre. La section 3 donne un aper&#231;u de IndDoc en situant notre travail par rapport aux
travaux existants. Les sections 3 et 4 montrent concr&#232;tement comment le calcul des renvois et
le tri sont r&#233;alis&#233;s dans IndDoc.
</p>
<p>2 L&#8217;index comme outil de navigation dans le document
</p>
<p>Face au flux toujours croissant de la documentation imprim&#233;e ou num&#233;rique, il est important de
se doter d&#8217;outils d&#8217;acc&#232;s au contenu des documents : une information qui ne peut &#234;tre localis&#233;e
dans un flux documentaire &#8220;n&#8217;existe pas&#8221;. L&#8217;index est l&#8217;un des dispositifs les plus anciens
permettent d&#8217;acc&#233;der au contenu des documents.
</p>
<p>Nous d&#233;signons par index, la table alphab&#233;tique plac&#233;e &#224; la fin d&#8217;un document ou d&#8217;un livre, qui
pr&#233;sente les sujets trait&#233;s dans le document sous forme d&#8217;une liste de descripteurs accompagn&#233;s
de renvois, c&#8217;est-&#224;-dire de r&#233;f&#233;rences aux segments de texte o&#249; se trouvent mentionn&#233;s ces
descripteurs dans le document (sous la forme vedette ou sous une forme variante). L&#8217;index
vise &#224; guider et &#233;clairer le lecteur. Les lecteurs consultent l&#8217;index dans un but pr&#233;cis. S&#8217;ils
localisent rapidement l&#8217;information qu&#8217;il recherchent dans le document, ils sont satisfaits. Sinon
ils abandonnent l&#8217;index.
</p>
<p>Entre l&#8217;indexation des documents et celle d&#8217;un index de fin de livre, le niveau de granularit&#233; de
l&#8217;indexation du texte varie mais l&#8217;objectif est identique (Maniez, 2002) : aider un demandeur
d&#8217;information &#224; trouver rapidement un texte ou un extrait pertinent. L&#8217;index est une repr&#233;senta-
tion synth&#233;tique de document, il offre un acc&#232;s rapide et direct &#224; l&#8217;information. Dans les deux
cas la m&#233;thode consiste &#224; rep&#233;rer, au-del&#224; des mots, les sujets susceptibles de retenir l&#8217;attention
d&#8217;un utilisateur. Dans le premier cas, l&#8217;indexeur effectue une analyse r&#233;ductrice pour ne d&#233;-
gager que les th&#232;mes essentiels du document. Le deuxi&#232;me cas exige une analyse d&#233;taill&#233;e pour
retenir les concepts port&#233;s par chaque page et l&#8217;index final peut contenir quelques centaines
d&#8217;entr&#233;es.
</p>
<p>Un index se compose de deux parties : la nomenclature et l&#8217;ensemble des renvois.
</p>
<p>La nomenclature de l&#8217;index, qui repr&#233;sente les entr&#233;es de l&#8217;index, est une liste structur&#233;e de
descripteurs. Les descripteurs sont des termes simples ou complexes, des noms propres, des
symboles, des commandes, des sigles, etc. La pr&#233;sentation et l&#8217;organisation de cette liste varient</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tri de l&#8217;information dans un index de &quot;fin de livre&quot;
</p>
<p>d&#8217;un index &#224; l&#8217;autre et m&#234;me au sein d&#8217;un domaine ou d&#8217;un genre de documents particulier.
Elle d&#233;pend essentiellement du choix de l&#8217;auteur. Cette liste est structur&#233;e dans la mesure
o&#249; les entr&#233;es sont reli&#233;es les unes aux autres par des relations syntaxiques, s&#233;mantiques, ou
conceptuelles. Cette structure est d&#8217;abord hi&#233;rarchique (un terme g&#233;n&#233;rique qui constitue une
entr&#233;e peut &#234;tre associ&#233; &#224; des termes plus sp&#233;cifiques : les sous-entr&#233;es). &#192; c&#244;t&#233; de ces relations
hi&#233;rarchiques, on trouve aussi des liens de synonymie et des relations d&#8217;association (liens de
type Voir aussi). La nomenclature offre au lecteur une vue sur les sujets trait&#233;s (terminologie
utilis&#233;e, entit&#233;s nomm&#233;es...) : une vue globale sur l&#8217;ontologie du domaine et une vue locale sur
des descripteurs particuliers.
</p>
<p>La liste des renvois m&#233;lange souvent renvois au texte et r&#233;f&#233;rences crois&#233;es (renvois &#224; une
autre entr&#233;e ou sous-entr&#233;e). Comme les r&#233;f&#233;rences crois&#233;es &#233;tablissent des liens entre de-
scripteurs (synonymie ou lien d&#8217;association), nous consid&#233;rons qu&#8217;elles rel&#232;vent de la nomen-
clature qu&#8217;elles contribuent &#224; structurer. Dans la suite, nous r&#233;servons le terme de &#8220;renvoi&#8221; pour
d&#233;signer le renvoi au texte qui &#233;tablit un lien entre une entr&#233;e de la nomenclature et un segment
de document qui peut &#234;tre une page, un groupe de pages, une section ou une sous-section. Pour
une entr&#233;e donn&#233;e, l&#8217;index ne renvoie pas &#224; toutes les occurrences du descripteur dans le docu-
ment. Seules les occurrences les plus pertinentes sont s&#233;lectionn&#233;es mais les crit&#232;res de choix
varient d&#8217;un index &#224; l&#8217;autre. L&#8217;ordre dans lequel sont pr&#233;sent&#233;es les diff&#233;rentes occurrences n&#8217;est
pas un ordre de pertinence : elles sont class&#233;es par ordre d&#8217;apparition dans le texte. Les renvois
au texte donnent une id&#233;e de l&#8217;importance des sujets dans le document : la liste des renvois d&#8217;un
descripteur refl&#232;te &#224; la fois la fr&#233;quence du descripteur et sa r&#233;partition dans le document.
</p>
<p>3 Cr&#233;ation automatique d&#8217;une &#233;bauche d&#8217;index
</p>
<p>Hormis quelques exp&#233;riences relativement ponctuelles (Gros &amp; Assadi, 1997; Aussenac &amp; Con-
damines, 1998; Bourigault &amp; Charlet, 1999) la construction automatique des index de fin de
livre n&#8217;a gu&#232;re &#233;t&#233; &#233;tudi&#233;e. On peut cependant s&#8217;appuyer sur des travaux existants dans dif-
f&#233;rents domaines. Nous pr&#233;sentons la construction de l&#8217;index comme un processus en quatre
&#233;tapes et nous montrons que l&#8217;on peut, &#224; chaque &#233;tape, tirer profit de travaux ant&#233;rieurs :
</p>
<p>&#0; Elaborer la nomenclature d&#8217;un index suppose de rep&#233;rer les descripteurs ou termes per-
tinents du document et de structurer la liste obtenue en ajoutant des liens s&#233;mantiques
entre descripteurs. Il s&#8217;agit de deux probl&#232;mes connus en terminologie computationnelle :
l&#8217;extraction de termes et la structuration d&#8217;une liste de termes.
</p>
<p>&#0; Calculer les renvois textuels pour chaque descripteur suppose d&#8217;identifier les occurrences
du descripteur et de d&#233;terminer &#224; chaque fois la taille de l&#8217;empan de texte (le segment de
texte) auquel il est pertinent de renvoyer. Il s&#8217;agit d&#8217;une t&#226;che de segmentation.
</p>
<p>&#0; Une fois &#233;tablies la nomenclature de l&#8217;index et la liste des renvois, il reste &#224; les trier
par ordre de pertinence. Ce tri sert pour la pr&#233;sentation des r&#233;sultats. Dans certains
cas, en effet, l&#8217;ordre alphab&#233;tique de pr&#233;sentation des entr&#233;es de l&#8217;index n&#8217;est pas le plus
judicieux et le tri des renvois par num&#233;ros de page n&#8217;est pas tr&#232;s informatif. Ce tri sert
aussi &#224; s&#233;lectionner l&#8217;information la plus utile, lorsque l&#8217;indexeur choisit de ne retenir
qu&#8217;un sous-ensemble des informations contenues dans l&#8217;index pour produire un index
plus petit (pour le passage d&#8217;un index &#233;lectronique &#224; un index papier, par exemple). Cette</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Touria Ait El Mekki, Adeline Nazarenko
</p>
<p>question de la pertinence a &#233;t&#233; &#233;tudi&#233;e &#224; la fois pour la recherche d&#8217;information et pour le
r&#233;sum&#233; automatique.
</p>
<p>&#0; La construction d&#8217;index ne pouvant &#234;tre consid&#233;r&#233;e comme un processus enti&#232;rement
automatique, l&#8217;expertise humaine reste n&#233;cessaire pour valider les r&#233;sultats obtenus. In-
dDoc comporte donc &#233;galement une interface qui permet d&#8217;organiser le travail et d&#8217;en
assurer la coh&#233;rence.
</p>
<p>L&#8217;extraction des termes a fait l&#8217;objet de nombreuses recherches : aujourd&#8217;hui, plusieurs ex-
tracteurs (voir (Jacquemin &amp; Bourigault, 2003) pour une synth&#232;se) permettent de rep&#233;rer dans
un corpus les termes du domaine. Ces extracteurs fournissent une liste volumineuse de candi-
dats termes qui n&#233;cessite un filtrage et un travail de validation. Nous utilisons pour notre part
Lexter ou Syntex (Bourigault &amp; Fabre, 2000). Nous structurons ensuite cette liste pour &#233;tablir
des liens entre les entr&#233;es et les sous-entr&#233;es ainsi que pour &#233;tablir des r&#233;f&#233;rences crois&#233;es entre
entr&#233;es. La structuration consiste donc &#224; transformer une liste de termes en un r&#233;seau o&#249; les
termes sont reli&#233;s entre eux par des liens syntaxiques et s&#233;mantiques (Nazarenko &amp; Hamon,
2002). Les outils de structuration existants reposent sur l&#8217;analyse de la structure interne des ter-
mes ou/et sur les contextes d&#8217;emploi pour rapprocher deux termes. Le module de structuration
de INdDoc s&#8217;inspire des outils existants. Nous ne le pr&#233;sentons pas en d&#233;tail ici1.
</p>
<p>Les m&#233;thodes de segmentation s&#8217;appuient sur la structure physique des documents (phrases,
paragraphes, titres, marques typographiques...) et/ou sur leur contenu (passages th&#233;matique-
ment homog&#232;nes). Deux approches sont utilis&#233;es : la premi&#232;re repose sur la coh&#233;sion lexicale
(Ferret et al., 1998) (Kozima, 1993) et op&#232;re des regroupements de paragraphes (ou au con-
traire des d&#233;coupages) sur la base du vocabulaire employ&#233;. La deuxi&#232;me cherche &#224; rep&#233;rer
des connecteurs marquant des relations d&#8217;encha&#238;nement entre paragraphes ou au contraire des
solutions de continuit&#233;. Nous n&#8217;exploitons ces m&#233;thodes que ponctuellement dans IndDoc car
elles s&#8217;av&#232;rent difficiles &#224; utiliser pour le calcul des renvois. L&#8217;approche par coh&#233;sion lexi-
cale est g&#233;n&#233;ralement utilis&#233;e pour d&#233;couper des documents qui, contrairement aux n&#244;tres, sont
h&#233;t&#233;rog&#232;nes et lexicalement disparates. Concernant l&#8217;approche &#224; base de marqueurs, nous avons
identifi&#233; un certain nombre de marqueurs assez g&#233;n&#233;riques (Porhiel, 1998) : des marqueurs de
liaison ( par exemple, Pour ce faire... en d&#233;but de paragraphe), des reprises anaphoriques, des
marqueurs d&#8217;int&#233;gration lin&#233;aire (De plus, D&#8217;autre part, Ensuite...). L&#8217;analyse des documents
montre cependant qu&#8217;on trouve &#224; la fois des unit&#233;s documentaires adjacentes et li&#233;es entre elles
sans que ce lien soit marqu&#233; formellement et des marqueurs de continuit&#233; qui ne jouent pas leur
r&#244;le dans certains emplois. Le principal d&#233;faut de ces approches pour le calcul des renvois est
qu&#8217;elles proposent une segmentation ind&#233;pendante du point de vue, alors que dans un index, la
segmentation est en partie relative &#224; l&#8217;entr&#233;e de l&#8217;index que l&#8217;on cherche &#224; d&#233;crire. Un ensemble
de paragraphes peut &#234;tre retenu comme Unit&#233; Documentaire (UD) coh&#233;rente pour une entr&#233;e
donn&#233;e alors qu&#8217;un autre d&#233;coupage peut s&#8217;av&#233;rer plus pertinent pour une autre entr&#233;e. Les
travaux qui proposent une segmentation des documents &#224; la vol&#233;e en fonction de la requ&#234;te de
l&#8217;utilisateur se rapprochent donc davantage de notre objectif (Bellot, 2000).
De nombreuses mesures de pertinence de l&#8217;information ont &#233;t&#233; propos&#233;es. En Recherche d&#8217;Infor-
mation (RI), il s&#8217;agit d&#8217;associer un ensemble de documents et une requ&#234;te contenant un terme
ou plus. Dans notre application, on cherche &#224; apparier un terme &#224; un ensemble de segments
du document. Les techniques classiquement utilis&#233;es en RI sont de trois types : les mod&#232;les
bool&#233;ens (Apte et al., 1994) caract&#233;risent simplement la pr&#233;sence ou l&#8217;absence des termes dans
</p>
<p>1(AitElMekki &amp; Nazarenko, 2003) pr&#233;sente ce module dans son ensemble.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tri de l&#8217;information dans un index de &quot;fin de livre&quot;
</p>
<p>le document. Les mod&#232;les probabilistes capturent la distribution des mots dans les documents
et s&#8217;en servent pour calculer la probabilit&#233; de pertinence par rapport &#224; une requ&#234;te (Bookstein
&amp; Swanson, 1974; Crestani et al., 1998). Cette approche est difficile &#224; appliquer dans notre
cas parce qu&#8217;elle estime des probabilit&#233;s ou des densit&#233;s dans des espaces de grande dimen-
sion et parce que la plupart des mod&#232;les supposent une ind&#233;pendance compl&#232;te des termes du
document. Les mod&#232;les vectoriels sont tr&#232;s classiques. L&#8217;indexation d&#233;crit les documents et les
requ&#234;tes comme des vecteurs dans un m&#234;me espace vectoriel. On extrait les termes de la re-
qu&#234;te et du document, puis on attribue &#224; chaque terme un poids qui refl&#232;te son importance. Les
repr&#233;sentations les plus courantes reposent sur le codage tf
</p>
<p>&#1;
</p>
<p>idf de (Salton, 1989). On mesure la
similarit&#233; entre chaque document &#2; de la base de documents et la requ&#234;te &#3; puis les documents
sont tri&#233;s par ordre d&#233;croissant de similarit&#233; avec la requ&#234;te.
</p>
<p>Des mesures de pertinence ont &#233;galement &#233;t&#233; propos&#233;es pour s&#233;lectionner les phrases perti-
nentes dans les travaux portant sur le r&#233;sum&#233; automatique. Dans ce contexte, pour identifier les
phrases importantes du texte source qui vont &#234;tre assembl&#233;e en r&#233;sum&#233;, on exploite des indices
statistiques et/ou linguistiques (Paice, 1981; Saggion &amp; Lapalme, 2002) : cooccurrence de mots
et lexique des titres, par exemple.
</p>
<p>4 Identification des segments de renvoi dans IndDoc
</p>
<p>Pour identifier les segments de renvoi, nous partons d&#8217;une segmentation brute du document en
UD minimales (UDM)(Hearst, 1994; Ouerfelli &amp; Lallich-Boidin, 2000). Une UDM correspond
&#224; un paragraphe : cette segmentation fine se justifie dans la mesure o&#249; IndDoc, au del&#224; des
index papier, vise &#224; construire des index sur support &#233;lectronique. Il faut ensuite rep&#233;rer, pour un
descripteur donn&#233; &#2; &#4; , quelles UDM contiennent une occurrence de &#2; &#4; (ou d&#8217;une de ses variantes)
et identifier la taille du segment de renvoi, c&#8217;est-&#224;-dire la taille de l&#8217;empan de texte auquel il est
pertinent de renvoyer.
</p>
<p>La taille des unit&#233;s documentaires (le niveau de granularit&#233; de la segmentation2) d&#233;pend de
la t&#226;che &#224; r&#233;aliser (indexation, r&#233;sum&#233; automatique etc.). Comme nous l&#8217;avons mentionn&#233; ci-
dessus, dans un index, la segmentation est de surcro&#238;t relative &#224; l&#8217;entr&#233;e de l&#8217;index que l&#8217;on
cherche &#224; d&#233;crire.
</p>
<p>Nous distinguons dans la suite les unit&#233;s documentaires qui r&#233;sultent d&#8217;un d&#233;coupage absolu du
document des segments de renvoi qui sont relatifs &#224; un descripteur donn&#233;.
</p>
<p>Notre m&#233;thode de segmentation repose sur : la structure physique des textes (phrases, para-
graphes, titres, marques typographiques, etc.), ce qui donne de bons r&#233;sultats pour les textes
scientifiques et techniques qui sont g&#233;n&#233;ralement structur&#233;s par l&#8217;auteur et organis&#233;s en sections
et sous-sections, et les marques d&#8217;int&#233;gration linguistique et typographique.
</p>
<p>Le segment de texte auquel l&#8217;index renvoie est donc vu ici comme une unit&#233; discursive qui
pr&#233;sente des crit&#232;res de coh&#233;sion s&#233;mantique, syntaxique et typographique (Ferret et al., 1998)
(Kozima, 1993), parmi lesquels nous retenons : la pr&#233;sence de marqueurs d&#8217;int&#233;gration lin&#233;aire
(si, alors, ensuite, ainsi, de plus, d&#8217;autre part,...) ou des mots de liaison (par exemple, pour cela,
pour ce faire,...) au d&#233;but du paragraphe ; la reprise anaphorique au d&#233;but du paragraphe (reprise
par un d&#233;monstratif (ce, cette, ces), par un pronom personnel (il, elle) ; la forte coh&#233;sion lexicale
</p>
<p>2Celle-ci peut s&#8217;exprimer en nombre de paragraphes, en nombre de phrases ou m&#234;me en nombre de mots</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Touria Ait El Mekki, Adeline Nazarenko
</p>
<p>des paragraphes cons&#233;cutifs ; la continuit&#233; typographique entre deux paragraphes cons&#233;cutifs3.
</p>
<p>L&#8217;algorithme de segmentation dans IndDoc est donn&#233; dans la figure 1. Notre m&#233;thode de seg-
mentation permet d&#8217;identifier les segments de renvoi (de taille variable) pour chaque descripteur.
Elle comporte deux phases. Une segmentation absolue qui ne d&#233;pend que du document. &#224; ce
stade, on segmente le document en UDM, puis on &#233;largit ces UDM en UD en fonction des
marqueurs linguistiques et typographiques tout en respectant la structure logique du document
(une UD ne peut pas &#234;tre &#224; cheval entre deux sections de document). Cette segmentation permet
donc de d&#233;couper le document en UD linguistiquement ou typographiquement homog&#232;nes. &#192;
l&#8217;issue de cette phase, le document est repr&#233;sent&#233; comme une liste d&#8217;UD. Vient ensuite une
phase de segmentation relative qui d&#233;pend d&#8217;un descripteur donn&#233;. Cette phase est n&#233;cessaire
pour &#233;tablir la liste des segments de renvoi (liste des renvois) d&#8217;un descripteur. Elle comporte
trois &#233;tapes : (1) on identifie les segments de renvoi (les UD qui contiennent le descripteur ou
une de ses variantes) ; (2) on regroupe les segments adjacents dans le texte du document, ce qui
permet d&#8217;obtenir une liste simplifi&#233;e de segments de renvoi ; (3) on g&#233;n&#233;ralise la s&#233;quence des
segments d&#8217;une m&#234;me section en un unique renvoi &#224; la section, lorsqu&#8217;une partie suffisamment
grande de la section figure dans la liste des segments &#233;tablie en 2. Le fonctionnement de cet
</p>
<p>Soit &#7; l&#8217;ensemble des paragraphes (UDM) du document.
// &#233;largissement des UDM en UD
Soit UD la liste des unit&#233;s documentaires du document, initialis&#233;e &#224; &#7;
Pour chaque &#8; &#9; &#11; de UD
</p>
<p>&#233;largir &#8; &#9; &#11; aux UDM qui la suivent dans le texte
s&#8217;il n&#8217;y a pas de fronti&#232;re de section entre elles
et s&#8217;il y a une continuit&#233; linguistique ou typographique entre elles
</p>
<p>// Calcul des segments de renvoi
Soit &#14; = &#9; &#15; ,..., &#9; &#17; la liste des descripteurs extraits
Pour chaque descripteur &#9; &#11; de &#14; :
</p>
<p>Calculer &#9; &#18;
&#11;
</p>
<p>, la classe form&#233;e par &#9; &#11; et ses variantes.
Construire &#19; &#18;
</p>
<p>&#11;
</p>
<p>, la liste ordonn&#233;e des segments de renvoi de &#9; &#18;
&#11;
</p>
<p>( les UD o&#249; les &#9; &#18;
&#11;
</p>
<p>apparaissent).
// Regroupement des segments occurrences adjacents
Regrouper les segments de &#19; &#18;
</p>
<p>&#11;
</p>
<p>qui correspondent &#224; des unit&#233;s documentaires adjacentes dans le texte
// G&#233;n&#233;ralisation &#224; la section
Soit &#22; la liste de toutes les sections et sous-sections du document
pour chaque &#23; &#24; de &#22;
</p>
<p>Identifier l&#8217;ensemble &#25; &#11; &#24; des segments de &#19;
&#18;
</p>
<p>&#11;
</p>
<p>qui appartiennent &#224; &#23; &#24; .
remplacer l&#8217;ensemble &#25; &#11; &#24; par un unique segment-section
</p>
<p>si la proportion de paragraphes de l&#8217;ensemble &#25; &#11; &#24; dans la section &#23; &#24; est sup&#233;rieure &#224; un seuil donn&#233;
Continuit&#233; linguistique il y a continuit&#233; linguistique entre deux paragraphes, s&#8217;il existe un marqueur de liaison linguistique
dans l&#8217;un d&#8217;entre eux ( au del&#224;, d&#8217;autre part, ensuite...)
Continuit&#233; typographique il y a continuit&#233; typographique entre deux paragraphes, si les deux paragraphes sont
typographiquement marqu&#233;s de la m&#234;me mani&#232;re : ils sont tous les deux mis en relief (italique) ou ils constituent deux
items de la m&#234;me liste.
</p>
<p>Figure 1: Algorithme de segmentation.
</p>
<p>algorithme est illustr&#233; par la figure 2. Consid&#233;rons par exemple le texte de la figure 3. Dans
un premier temps, ce texte est d&#233;coup&#233; en 4 paragraphes (UDM). Du fait de la pr&#233;sence de
marques de liaison (effet, De plus), l&#8217;UDM correspondant au paragraphe &#167; &#4; est &#233;largie aux para-
graphes &#167; &#4; fi ffi et &#167; &#4; fi  . La segmentation absolue donne donc 2 UD : &#167; &#4; -&#167; &#4; fi  et &#167; &#4; fi &quot; . Consid&#233;rons
par ailleurs l&#8217;entr&#233;e &#8220;contexte d&#8217;insertion&#8221;. La seule occurrence de &#8220;contexte d&#8217;insertion&#8221; dans
ce document est celle qui figure dans le paragraphe &#167; &#4; , c&#8217;est-&#224;-dire dans l&#8217;UD &#167; &#4; -&#167; &#4; fi  . On a
donc un unique segment de renvoi mais celui-ci est finalement &#233;largi &#224; la section # elle-m&#234;me
parce que le segment de renvoi contient trois des quatre paragraphes de la section. Nos pre-
mi&#232;res exp&#233;riences portent sur quatre corpus. L&#8217;ouvrage Ing&#233;nierie des Connaissance (IC99),
</p>
<p>3Par ex. si les deux paragraphes sont mis en relief de la m&#234;me mani&#232;re ou constituent deux items de la m&#234;me
liste)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tri de l&#8217;information dans un index de &quot;fin de livre&quot;
</p>
<p>paragraphe 
UD (segmentation absolue) ou segment (segmentation relative)
section ou sous-section
</p>
<p>__       occurrence dans le paragraphe
lien linguistique ou typographique
</p>
<p>&#167;1 &#167;2 &#167;3 &#167;4 &#167;5 &#167;n
</p>
<p>Sect 1 Sect i
</p>
<p>SSect i.3Sect1
s1 sj s r
</p>
<p>&#167;j-1 &#167;j&#167;1 &#167;2 &#167;3 &#167;4 &#167;30 &#167;31
</p>
<p>ud 1 ud 2 ud 3 ud i ud k
</p>
<p>&#167;5
</p>
<p>Liste des UD minimales
</p>
<p>Liste des UD &#233;largies
</p>
<p>&#167;1
</p>
<p>&#167;n-1 &#167;n
</p>
<p>ud m
</p>
<p>Liste brute des segments 
de descripteur i &#167;2 &#167;3 &#167;4 &#167;30 &#167;31
</p>
<p>s1 s2 si
</p>
<p>&#167;j-1 &#167;j&#167;5 &#167;n-1 &#167;n
sl
</p>
<p>Liste simplifi&#233;e  des 
segments du descripteur i &#167;2 &#167;3 &#167;4 &#167;30 &#167;31
</p>
<p>s1 se
</p>
<p>&#167;5 &#167;n-1 &#167;n
</p>
<p>sl
</p>
<p>&#167;32 &#167;33
</p>
<p>Liste  des segments 
g&#233;n&#233;ralis&#233;s de descripteur i
</p>
<p>&#167;30 &#167;31 &#167;32 &#167;33
</p>
<p>&#167;j
</p>
<p>&#167;j-1 &#167;j
</p>
<p>Figure 2: Illustration de processus de segmentation sur un exemple
</p>
<p>Debut de section $
[&#167; &#11; ] Le contexte d&#8217;insertion d&#8217;une ACCA a n&#233;cessairement des incidences sur son processus
de conception. Il est important...
[&#167; &#11;
</p>
<p>&#18;
</p>
<p>&#15;
</p>
<p>] En effet, pour atteindre l&#8217;objectif de cr&#233;ation de groupe, l&#8217;activit&#233; doit prendre place
au tout d&#233;but de l&#8217;ann&#233;e, et donc avant la plupart des enseignements. Il faut donc opter pour
un domaine qui ne soit ni compl&#232;tement inconnu des &#233;tudiants ni ma&#238;tris&#233;.
[&#167; &#11;
</p>
<p>&#18; %
</p>
<p>] De plus, m&#234;me si dans notre cas le domaine est une variable libre, il faut qu&#8217;il se
pr&#234;te &#224; des &#233;changes de point de vue, afin de stimuler les discussions entre les &#233;tudiants,
les encourager &#224; communiquer et &#224; d&#233;fendre leurs positions. Le but n&#8217;est pas qu&#8217;ils se
mettent imm&#233;diatement d&#8217;accord mais, au contraire, qu&#8217;ils aient mati&#232;re &#224; discuter,
argumenter et n&#233;gocier (Berger [ 1999 ]).
[&#167; &#11;
</p>
<p>&#18; &amp;
</p>
<p>] Ces diff&#233;rentes consid&#233;rations nous ont conduit &#224; proposer une activit&#233; li&#233;e aux crit&#232;res...
Fin de section $
</p>
<p>Figure 3: Exemple de segmentation (Les balises entre []sont ajout&#233;es par nous, ainsi que le gras et l&#8217;italique).
</p>
<p>qui est un recueil d&#8217;articles scientifiques4, a &#233;t&#233; choisi pour fournir un point de comparaison avec
(Bourigault &amp; Charlet, 1999)5 . L&#8217;ouvrage Ing&#233;nierie des Connaissance (IC2001) fait suite au
pr&#233;c&#233;dent. Nous avons &#233;galement consid&#233;r&#233; deux manuels d&#8217;intelligence artificielle (RC)6 et de
linguistique (EC)7 pour tester notre approche sur des documents vari&#233;s. Nous avons appliqu&#233;
cet algorithme sur ces quatre corpus. On constate que la segmentation r&#233;duit effectivement le
nombre de renvois mais que le facteur de r&#233;duction d&#233;pend de la nature du document (mono-
graphie vs collection) et du style de la r&#233;daction. Le tableau de la figure 4 montre que c&#8217;est pour
le corpus EC, qui est de style plus litt&#233;raire et emploie beaucoup de marqueurs linguistiques,
que le facteur de r&#233;duction dans le passage des UDMs aux UDs &#233;largies est le plus important.
On observe aussi que les &#233;tapes de simplification et de g&#233;n&#233;ralisation sont moins marqu&#233;es dans
IC, o&#249; les articles sont g&#233;n&#233;ralement fortement structur&#233;s.
</p>
<p>4L&#8217;ouvrage rassemble une s&#233;lection de 35 articles publi&#233;s dans les actes des Journ&#233;es Acquisition des Con-
naissances (JAC), en 1995 et 1996, et dans les actes des journ&#233;es Ing&#233;nierie des Connaissances (IC), en 1997 et
1998.
</p>
<p>5Les auteurs ont construit un index pour cet ouvrage mais la structuration et le calcul des renvois ont &#233;t&#233; &#233;tablis
manuellement dans cette premi&#232;re exp&#233;rience.
</p>
<p>6Repr&#233;sentation des connaissance, D. Kayser, Hermes 1997.
7La cause et son expression en fran&#231;ais, A. Nazarenko, Ophrys 2000.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Touria Ait El Mekki, Adeline Nazarenko
</p>
<p>IC01 IC99 RC EC
Nb de UDMs 1085 4929 7386 793
Nb de UD &#233;largies 907 4698 7245 634
Nb de Segments de renvoi 3097 9863 8823 2569
Nb de Segments apr&#232;s simplification 3008 9786 5157 1893
Nb de Segments apr&#232;s g&#233;n&#233;ralisation 2997 9728 4469 950
</p>
<p>Figure 4: R&#233;sultats de la segmentation sur diff&#233;rents corpus.
</p>
<p>5 Tri de l&#8217;information
</p>
<p>Nous nous inspirons de l&#8217;approche tf/idf pour l&#8217;&#233;valuation de la pertinence des diff&#233;rentes clefs
d&#8217;indexation dans une base documentaire. Cette mesure est adapt&#233;e pour prendre en compte,
outre le poids d&#8217;un mot dans l&#8217;ensemble du document et sa fr&#233;quence dans le segment, le poids
d&#8217;une occurrence particuli&#232;re (qui peut &#234;tre mise en valeur typographiquement ou dans le dis-
cours, figurer dans un titre, etc.).
IndDoc prend en compte deux poids diff&#233;rents : un poids de descripteur ( &#2; ' ) * ,
</p>
<p>&#25; - / 1
</p>
<p>pour le de-
scripteur &#2; &#4; ) et un poids de segment ( 3 ' ) * ,
</p>
<p>&#25; - / 5 7 1
</p>
<p>pour le
7
</p>
<p>i&#232;me segment occurrence de &#2; &#4; ). Ces
poids sont d&#233;pendants l&#8217;un de l&#8217;autre : le poids du segment augmente s&#8217;il contient des descrip-
teurs importants et le poids du descripteur augmente s&#8217;il appara&#238;t dans des segments importants
du document (Maynard &amp; Ananiadou, 2001). En pratique, nous ne tenons compte dans le poids
de segment que du nombre d&#8217;occurrences des descripteurs que contient le segment ainsi que de
leur r&#233;partition dans le document.
</p>
<p>Le score 3 ' ) * ,
&#25; - / 5 7 1
</p>
<p>est donn&#233; par: 3 ' ) * ,
&#25; - / 5 7 1 = ? A
</p>
<p>3 B D
</p>
<p>&#22;
</p>
<p>&#14;
</p>
<p>$ E
</p>
<p>ffi
</p>
<p>- F
</p>
<p>D
</p>
<p>?
</p>
<p>&#2; 3
</p>
<p>$
</p>
<p>B
</p>
<p>1
</p>
<p>o&#249; H est le nombre de
descripteurs dans le document et
</p>
<p>F =
</p>
<p>1 pour &#2; &#4; ou une de ses variantes et 0.5 pour les autres &#2;
$
</p>
<p>.
</p>
<p>Le param&#232;tre
F
</p>
<p>permet donc de majorer le poids du descripteur &#2; &#4; dont on calcule le segment
tout en tenant compte des autres descripteurs. Ce score d&#233;pend de deux poids &#233;l&#233;mentaires.
</p>
<p>Le poids typographique du segment (
? A
</p>
<p>3 B ) est intrins&#232;que au segment 3 B . Il est &#233;lev&#233; si 3 B
contient des marques typographiques (gras, italique) ou s&#8217;il introduit de nouveaux descripteurs.
Ce poids d&#233;pend aussi du statut du segment dans le document. Il est major&#233;, si 3 B contient
des r&#233;f&#233;rences ou si 3 B est un titre. En revanche ce poids diminue si 3 B est un r&#233;sum&#233;, une
introduction ou une conclusion. Nous associons &#224; chaque crit&#232;re un poids &#233;l&#233;mentaire et le
poids
</p>
<p>? A
</p>
<p>3 B est une combinaison lin&#233;aire de ces poids &#233;l&#233;mentaires.
</p>
<p>Le poids discriminant du segment 3 B (
?
</p>
<p>&#2; 3 &#4; B ) est relatif au descripteur &#2; &#4; .
?
</p>
<p>&#2; 3 &#4; B d&#233;pend du
nombre de descripteurs qui appartiennent &#224; 3 B , de leur poids et de leur r&#233;partition dans 3 B ainsi
que dans le document. Ce poids est une mesure r&#233;vis&#233;e de tf/idf :
</p>
<p>?
</p>
<p>&#2; 3 &#4; B
</p>
<p>= K M M
</p>
<p>&#4; B D N
</p>
<p>K P -
</p>
<p>&#7;
</p>
<p>&#7; &#11;
</p>
<p>1
</p>
<p>o&#249;
K M M
</p>
<p>&#4; B est le nombre d&#8217;occurrences de &#2; &#4; dans 3 &#4; B , R est le nombre total de paragraphes dans le
document et R &#4; est le nombre de paragraphes dans lesquels &#2; &#4; appara&#238;t.
</p>
<p>Le score &#2; ' ) * ,
&#25; - / 1
</p>
<p>est d&#233;fini par : &#2; ' ) * ,
&#25; - / 1 = ?
</p>
<p>3 &#2; &#4; D
</p>
<p>V
</p>
<p>?
</p>
<p>&#2; &#2; &#4; D
</p>
<p>? A
</p>
<p>&#2; &#4; D
</p>
<p>&#22; W
</p>
<p>&#11;
</p>
<p>B
</p>
<p>E
</p>
<p>ffi
</p>
<p>' Y Z \ ^ _ ` &#4; b B c
</p>
<p>W
</p>
<p>&#11;
</p>
<p>. Ce score est
calcul&#233; &#224; partir de trois poids &#233;l&#233;mentaires.
</p>
<p>Le poids typographique du descripteur
? A
</p>
<p>&#2; &#4; d&#233;pend des caract&#233;ristiques typographiques des
diff&#233;rentes occurrences de &#2; &#4; et du poids des segments dans lesquels ce descripteur appara&#238;t.
</p>
<p>? A
</p>
<p>&#2; &#4; augmente si le descripteur appara&#238;t dans des segments importants du document (tels que
les titres, le r&#233;sum&#233;, l&#8217;introduction). Nous associons &#224; chaque crit&#232;re un poids &#233;l&#233;mentaire, le
poids
</p>
<p>? A
</p>
<p>&#2; &#4; est une combinaison lin&#233;aire de ces poids &#233;l&#233;mentaires.
</p>
<p>Le poids discriminant de descripteur
?
</p>
<p>&#2; &#2; &#4; d&#233;pend du nombre normalis&#233; des occurrences de &#2; &#4;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tri de l&#8217;information dans un index de &quot;fin de livre&quot;
</p>
<p>et de sa distribution dans le document.
?
</p>
<p>&#2; &#2; &#4; est &#233;lev&#233; si &#2; &#4; est irr&#233;guli&#232;rement r&#233;parti dans le
document. Ce poids est une mesure r&#233;vis&#233;e de tf/idf. On pose :
</p>
<p>?
</p>
<p>&#2; &#2; &#4;
</p>
<p>=
</p>
<p>* ) )
</p>
<p>&#11;
</p>
<p>* ) )
</p>
<p>D N
</p>
<p>K P -
</p>
<p>&#7;
</p>
<p>&#7; &#11;
</p>
<p>1
</p>
<p>o&#249;
K M M
</p>
<p>est
le nombre moyen d&#8217;occurrences par descripteur.
</p>
<p>Le poids s&#233;mantique du descripteur
?
</p>
<p>3 &#2; &#4; d&#233;pend du nombre de descripteurs auxquels le descrip-
teur &#2; &#4; est li&#233; dans le r&#233;seau s&#233;mantique de la nomenclature d&#8217;index.
</p>
<p>?
</p>
<p>3 &#2; &#4; est &#233;lev&#233; si la densit&#233;
de liens s&#233;mantiques de &#2; &#4; est forte dans le r&#233;seau.
</p>
<p>La pertinence d&#233;pend ainsi d&#8217;un ensemble vari&#233; d&#8217;indices. La fr&#233;quence n&#8217;est qu&#8217;un crit&#232;re
de pertinence parmi d&#8217;autres et la typographie, la structure du document, la distribution et la
densit&#233; s&#233;mantique de r&#233;seau sont &#233;galement pris en compte. Nous avons appliqu&#233; ces mesures
sur nos quatre corpus. Il est difficile d&#8217;&#233;valuer ce tri dans l&#8217;abstrait mais l&#8217;analyse des exem-
ples permet de v&#233;rifier le comportement de notre mesure de pertinence. Ind&#233;pendamment de la
segmentation, le tri donne des r&#233;sultats plus marqu&#233;s dans IC et EC du fait de leur forte struc-
turation de l&#8217;utilisation du gras et d&#8217;italique. Au titre d&#8217;exemple dans le corpus EC, consid&#233;rons
le descripteur &#8220;Contrainte temporelle&#8221; qui a une fr&#233;quence 12 et poss&#232;de 3 renvois : le premier
dans l&#8217;ordre du texte, d e , donne une d&#233;finition du descripteur dont c&#8217;est la premi&#232;re mention,
et il est &#233;crit en gras. Le segment de renvoi est petit, en revanche. Le deuxi&#232;me segment d g
regroupe une sous-section qui traite de la &#8220;contrainte temporelle&#8221;( le descripteur figure dans le
titre de la sous-section) et deux autres sous-sections o&#249; le descripteur est mentionn&#233; et dont les
titres contiennent respectivement les termes &#8220;concordance des temps&#8221; et &#8220;relation temporelle&#8221;
qui sont en relation s&#233;mantique avec le descripteur &#8220; contrainte temporelle&#8221;. Dans le troisi&#232;me
segment d i , le descripteur appara&#238;t en d&#233;but de segment mais le segment lui-m&#234;me est inclus
dans la conclusion d&#8217;un chapitre. Le syst&#232;me a ordonn&#233; les renvois en privil&#233;giant d g pour
la quantit&#233; de l&#8217;information et l&#8217;apparition dans le titre devant d e dont l&#8217;apport d&#8217;information
est faible m&#234;me si c&#8217;est la premi&#232;re apparition du descripteur et s&#8217;il figure en gras. Le renvoi
</p>
<p>d i est plac&#233; en derni&#232;re position parce qu&#8217;il s&#8217;agit d&#8217;une partie de conclusion. Signalons pour
finir, m&#234;me si la comparaison ne saurait avoir valeur d&#8217;&#233;valuation, que l&#8217;index publi&#233; de ce livre
donne exactement les m&#234;me segments, dans leur ordre d&#8217;apparition, auxquels s&#8217;ajoute un renvoi
vide (le descripteur n&#8217;appara&#238;t pas dans la page)
</p>
<p>6 Conclusion
</p>
<p>Nous avons montr&#233; comment la s&#233;lection de l&#8217;information est prise en compte dans IndDoc. La
m&#233;thode propos&#233;e s&#8217;inspire des pratiques des indexeurs et tire parti des r&#233;sultats en mati&#232;re de
mesure de pertinence en recherche d&#8217;information et en r&#233;sum&#233; automatique. Nous mettons ici
l&#8217;accent sur les documents techniques mais ce travail s&#8217;int&#232;gre dans une r&#233;flexion plus globale
sur l&#8217;int&#233;r&#234;t et l&#8217;avenir des index. L&#8217;originalit&#233; de cette approche repose sur la diversit&#233; des
indices pris en compte : la s&#233;lection de l&#8217;information dans IndDoc repose &#224; la fois sur des
crit&#232;res de fr&#233;quence, de r&#233;partition, de typographie et de structure discursive.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AITELMEKKI T. &amp; NAZARENKO A. (2003). Le r&#233;seau terminologique, un &#233;l&#233;ment central pour la
construction d&#8217;index de documents. In Actes des cinqui&#232;mes rencontres Terminologie et Intelligence
Artificielle, p. 1&#8211;10.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Touria Ait El Mekki, Adeline Nazarenko
</p>
<p>APTE C., DAMERAU F. &amp; WEISS S. (1994). Automated learning of decision rules for text categorisa-
tion. In Transactions of Office Information Systems, volume 12.
AUSSENAC N. &amp; CONDAMINES A. (1998). Bases de connaissances terminologiques : enjeux pour la
consultation documentaire. Conf&#233;rence du chapitre Fran&#231;ais de L&#8217;ISKO.
BELLOT P. (2000). M&#233;thodes de classification et de segmentation locales non supervis&#233;es pour la
recherche documentaire. Doctorat informatique, Universit&#233; d&#8217;Avignon et des Pays de Vaucluse.
</p>
<p>BOOKSTEIN A. &amp; SWANSON D. (1974). Probabilistic models for automatic indexing. Journal of the
American Society for Information Science, 25(5), 312&#8211;318.
BOURIGAULT D. &amp; CHARLET J. (1999). Construction d&#8217;un index th&#233;matique de l&#8217;ing&#233;nierie des con-
naissances. Actes de IC99.
</p>
<p>BOURIGAULT D. &amp; FABRE C. (2000). Approche linguistique pour l&#8217;analyse syntaxique de corpus. In
Cahier de Grammaires, number 25, p. 131&#8211;151. Univ. Toulouse-Le Mirial.
CRESTANI F., LALMAS M., VANRIJSBERCEN C. &amp; CAMPBELL I. (1998). &quot;is this document relevant
? ... probably&quot; : a survey of probabilistic models in information retrieval. In ACM Computing Surveys,
volume 30, p. 528&#8211;552.
FERRET O., GRAU B. &amp; MASSON N. (1998). Thematic segmentation of texts : two methods for two
kinds of texts. In actes de Coling-ACL, p. 392&#8211;396, Montr&#233;al, Canada.
</p>
<p>GROS C. &amp; ASSADI H. (1997). Int&#233;gration de connaissances dans un syst&#232;me de consultation de doc-
umentation technique. In Actes des Premi&#232;res Rencontres du Chapitre Fran&#231;ais de l&#8217;ISKO (ISKO&#8217;97):
Presses Universitaire du Septentrion.
</p>
<p>HEARST M. (1994). Multi-paragraph segmentation of expository text. In Proceedings of the 32nd
Annual Meeting of the Association for Computational Linguistics,, Las Cruces.
JACQUEMIN C. &amp; BOURIGAULT D. (2003). Handbook of Computational Linguistics, chapter Term
extraction and automatic indexing, p. 599&#8211;615.
KOZIMA H. (1993). Text segmentation based on similarity between words. In actes du 31 congr&#232;s de
association for Computational Linguistics ACL (student session), p. 286&#8211;288.
MANIEZ J. (2002). Actualit&#233; des langages documentaires, fondements th&#233;oriques de la recherche
d&#8217;information. Adbs edition.
MAYNARD D. &amp; ANANIADOU S. (2001). Term extraction using a similarity-based approach. In
D.BOURIGAULT, C. JACQUEMIN &amp; M. L&#8217;HOMME, Eds., Recent Advances in Computational Termi-
nology, p. 261&#8211;278.
</p>
<p>A. NAZARENKO &amp; T. HAMON, Eds. (2002). Structuration de terminologie.
OUERFELLI T. &amp; LALLICH-BOIDIN G. (2000). Pratiques d&#8217;indexation dans les bases textuelles struc-
tur&#233;es : Application aux textes techniques sous format html. In ACSI 2000 : les dimension d&#8217;une science
de l&#8217;information globale, 28e congr&#232;s annuel.
PAICE C. (1981). The automatic generation of literary abtracts : An approach based on identification of
self-indicating phrases. In O. NORMAN, S. ROBERTSON, C. V. RIJISBERGEN &amp; P. WILLIAMS, Eds.,
Information retrieval research.
PORHIEL S. (1998). Les introducteurs d&#8217;int&#233;r&#234;t. PhD thesis, ParisXIII.
SAGGION H. &amp; LAPALME G. (2002). Generating indicative-informative summaries with sumum. Com-
putational Linguistics, 28.
SALTON G. (1989). Automatic text processing, the transformation, analysis, and retrieval of information
by computer. In Addison-Wesley,Reading.</p>

</div></div>
</body></html>