<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>@GEWEB : Agents personnels d&#8217;aide &#224; la recherche sur le Web</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19-22 avril 2004 
</p>
<p>@GEWEB : Agents personnels d&#8217;aide &#224; la recherche sur le Web 
</p>
<p>Mohamed Yassine El Amrani (1), Sylvain Delisle (2) et Isma&#239;l Biskri (2) 
</p>
<p>(1) D&#233;partement de math&#233;matiques et d&#8217;informatique &#8211; Universit&#233; de 
Sherbrooke 
</p>
<p>2500, Boul. de l&#8217;Universit&#233;, Sherbrooke (Qu&#233;bec), J1K 2R1, Canada 
elamrani@dmi.usherb.ca 
</p>
<p>(2) D&#233;partement de math&#233;matiques et d&#8217;informatique &#8211; Universit&#233; du Qu&#233;bec &#224; 
Trois-Rivi&#232;res 
</p>
<p>3351, Boul. Des Forges CP 500, Trois-Rivi&#232;res (Qu&#233;bec) G9A 5H7, Canada 
{delisle, biskri}@uqtr.ca 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Nous pr&#233;sentons dans cet article un logiciel permettant d&#8217;assister l&#8217;usager, de mani&#232;re 
personnalis&#233;e lors de la recherche documentaire sur le Web. L&#8217;architecture du logiciel est 
bas&#233;e sur l&#8217;int&#233;gration d&#8217;outils num&#233;riques de traitements des langues naturelles (TLN). Le 
syst&#232;me utilise une strat&#233;gie de traitement semi-automatique o&#249; la contribution de l&#8217;utilisateur 
assure la concordance entre ses attentes et les r&#233;sultats obtenus. 
</p>
<p>We here present a new software that can help the user to formulate his web search queries and 
customize the information retrieval tasks to her individual and subjective needs. The 
software&#8217;s architecture is based on numeric natural language processing tools. The software 
involves a semi-automatic processing strategy in which the user&#8217;s contribution ensures that the 
results are useful and meaningful to her. 
</p>
<p>Mots-cl&#233;s &#8211; Keywords 
</p>
<p>Reformulation de requ&#234;tes, Extraction de l&#8217;information, Personnalisation. 
</p>
<p>Text mining, Web customization, Query reformulation, Information retrieval. 
</p>
<p>1 Introduction 
</p>
<p>De part sa nature, Internet est aliment&#233; en informations diverses dont la quantit&#233; colossale et 
la fiabilit&#233; peu v&#233;rifiable rendent la t&#226;che des outils de recherche tr&#232;s probl&#233;matique. Dans la 
continuit&#233; de nos recherches pr&#233;c&#233;dentes (El Amrani et al., 2001; El Amrani, 2001), notre 
objectif principal est d&#8217;offrir une aide personnalis&#233;e aux utilisateurs des outils de recherche </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mohamed Yassine El Amrani, Sylvain Delisle et Isma&#239;l Biskri 
</p>
<p>documentaire sur le Web, durant les phases critiques de leurs recherches : la formulation de la 
requ&#234;te et l&#8217;&#233;valuation des r&#233;sultats. Il est important que l'utilisateur puisse contr&#244;ler tous les 
traitements effectu&#233;s durant ces diff&#233;rentes phases pour rendre les recherches 
informationnelles sur le Web plus adapt&#233;es. Notre contribution consiste (1) &#224; permettre aux 
usagers de personnaliser l&#8217;assistance propos&#233;e lors de la phase de reformulation de la requ&#234;te 
et (2) &#224; utiliser la classification pour regrouper les documents similaires obtenus par les 
moteurs de recherche pour un meilleur filtrage des r&#233;sultats. Pour ce faire, nous allons utiliser 
les syst&#232;mes de recherche conventionnels et y greffer des outils permettant d&#8217;assister les 
usagers &#224; param&#233;trer les diff&#233;rents traitements selon leurs besoins. 
</p>
<p>2 La recherche informationnelle sur le Web 
</p>
<p>Le processus de recherche peut &#234;tre subdivis&#233; en deux phases principales : la formulation de la 
requ&#234;te et l&#8217;&#233;valuation des r&#233;sultats de la recherche. Ces phases sont it&#233;r&#233;es jusqu&#8217;&#224; 
l&#8217;obtention de documents satisfaisants ou l&#8217;abandon de la recherche par l&#8217;usager. Pour ce qui 
est de cette premi&#232;re phase du processus de recherche, des techniques vari&#233;es peuvent &#234;tre 
appliqu&#233;es pour faciliter la recherche documentaire sur le Web (Hust, 2004; Tamine, 
Boughanem, 2001). Utilisant l&#8217;approche automatique pour la reformulation des requ&#234;tes pour 
les pr&#233;ciser de mani&#232;re it&#233;rative, Carpineto et al. (2002) appliquent des fonctions de mise &#224; 
jour des poids des termes des requ&#234;tes. La s&#233;lection des termes &#224; ajouter est effectu&#233;e de 
mani&#232;re automatique en fonction de leurs apparitions dans les documents obtenus gr&#226;ce &#224; la 
requ&#234;te initiale en se limitant seulement aux documents pr&#233;sents au d&#233;but de la liste des 
r&#233;sultats de la requ&#234;te pr&#233;c&#233;dente. C&#8217;est ainsi que McArthur et Bruza (2000) proposent le 
syst&#232;me HiB (Hyper-index Browser) qui permet aux usagers de choisir les termes &#224; inclure 
dans leur requ&#234;te pour la raffiner. HiB utilise les moteurs de recherche pour extraire et 
associer &#224; la requ&#234;te initiale des termes ou expressions issus des documents r&#233;sultants de cette 
premi&#232;re requ&#234;te. Il construit de mani&#232;re automatique un &#171; index &#187;, tableau de requ&#234;tes 
potentielles, mais se limite &#224; l&#8217;ajout de nouveaux termes en conservant la requ&#234;te initiale. La 
seconde phase du processus de recherche consiste &#224; &#233;valuer les r&#233;sultats obtenus gr&#226;ce aux 
syst&#232;mes de recherche. Pour faciliter cette &#233;tape, les techniques de classifications num&#233;riques 
(Turenne, 2000), permettent de regrouper des documents pr&#233;sentant certaines similarit&#233;s dans 
leur contenu. L&#8217;usager &#233;value les classes de documents et non chaque document. Nous 
utiliserons ces techniques de classification (Salvatierra et al. (1999) et Serradura et al. (2002)) 
pour am&#233;liorer la phase d&#8217;&#233;valuation des r&#233;sultats de recherche par l&#8217;usager. En conclusion, 
les techniques automatiques actuelles sont inadapt&#233;es pour proposer des termes ad&#233;quats si 
ceux de la requ&#234;te initiale ne concordent pas avec l&#8217;objectif de recherche de l&#8217;usager. Ce qui 
est le cas des requ&#234;tes de recherche dans un domaine peu ou pas connu de l&#8217;usager. Aider 
l&#8217;usager consisterait alors &#224; lui proposer des termes non pr&#233;sents dans sa requ&#234;te initiale 
(Anick, 2003). D&#8217;o&#249; notre int&#233;r&#234;t pour une approche semi-automatique qui permet d&#8217;adapter 
l&#8217;aide propos&#233;e, selon les besoins variables des usagers. 
</p>
<p>3 Un outil personnel d'aide &#224; la recherche sur le Web 
</p>
<p>L'objectif principal d'@GEWEB est la personnalisation de l'assistance des usagers lors du 
processus de recherche sur le Web. Cette assistance s&#8217;applique (1) lors de la formulation des 
requ&#234;tes en proposant des termes pour am&#233;liorer la requ&#234;te initiale et (2) lors de la </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>@geWeb : Agents personnels d&#8217;aide &#224; la recherche sur le Web 
</p>
<p>cat&#233;gorisation des documents obtenus. Ainsi, pour les besoins d'assistance aux usagers, il est 
n&#233;cessaire de poser des hypoth&#232;ses intuitives et faciles &#224; comprendre : (1) Le classement des 
r&#233;sultats des moteurs de recherche est imparfait. Certains liens vers des pages Web pertinentes 
peuvent ne pas figurer au d&#233;but de la liste des r&#233;sultats ou ne pas y figurer du tout; (2) Une 
approche al&#233;atoire de s&#233;lection des &#233;l&#233;ments des r&#233;sultats obtenus par les outils de recherche 
permettrait de faire ressortir des documents qui ne figuraient pas au d&#233;but de la liste class&#233;e 
par &#171; pertinence &#187; mais qui pourraient &#234;tre utiles aux usagers; (3) Les utilisateurs des 
diff&#233;rents outils de recherche ne savent pas toujours comment formuler leurs requ&#234;tes de 
mani&#232;re &#224; acc&#233;der &#224; l&#8217;information recherch&#233;e. La concordance des concepts et id&#233;es des 
utilisateurs avec ceux pr&#233;sents sur le Web ne s&#8217;effectue pas toujours et une reformulation de la 
requ&#234;te est souvent requise. 
</p>
<p>@GEWEB permet &#224; l&#8217;usager de g&#233;rer et regrouper des moteurs de recherche qui seront 
sollicit&#233;s par une m&#234;me requ&#234;te. Pour une description d&#233;taill&#233;e de ses fonctionnalit&#233;s nous 
invitons le lecteur &#224; consulter (El Amrani, 2003). Les usagers des moteurs de recherche sont 
confront&#233;s au choix des termes sur lesquels sera bas&#233;e leur recherche. Ils utilisent tr&#232;s peu de 
termes pour d&#233;finir les informations recherch&#233;es : un, deux ou trois termes par requ&#234;te (Bellot, 
El-B&#232;ze, 2000). Lorsque l&#8217;usager saisit une requ&#234;te, celle-ci est transmise &#224; un groupe de 
moteurs de recherche d&#233;termin&#233; par l&#8217;usager. Des r&#233;sultats obtenus, le syst&#232;me ne garde que le 
nombre de documents pr&#233;cis&#233; par l&#8217;usager. Les documents sont ensuite regroup&#233;s pour former 
un corpus. Pour regrouper les documents similaires en des classes d&#8217;&#233;quivalence et de 
construire des classes de cooccurrence de mots, nous avons opt&#233; pour GRAMEXCO (Biskri &amp; 
Delisle, 2002). Son fonctionnement est semi-automatique et il permet &#224; l&#8217;usager de varier 
plusieurs param&#232;tres en fonction de ses objectifs. Le choix de ce classificateur est motiv&#233; par 
son approche semi-automatique, sa capacit&#233; de param&#233;trage et de personnalisation, son 
ind&#233;pendance de la langue, sa capacit&#233; &#224; traiter de gros corpus et la disponibilit&#233; de son code 
source. L&#8217;usager &#233;value maintenant les r&#233;sultats de sa requ&#234;te qui sont regroup&#233;s en classes 
distinctes selon le contenu des documents. Ceci permet un filtrage plus facile des documents 
non pertinents. Si l&#8217;usager n&#8217;est pas satisfait des r&#233;sultats de sa requ&#234;te initiale, le syst&#232;me lui 
propose de nouveaux termes regroup&#233;s par ordre alphab&#233;tique, par occurrences ou par classe 
d&#8217;appartenance, selon ses pr&#233;f&#233;rences. Ce processus est it&#233;ratif et c&#8217;est l'usager qui d&#233;cide 
quand l'arr&#234;ter. De cette mani&#232;re, l&#8217;usager poss&#232;de un contr&#244;le total des traitements effectu&#233;s 
tout au long du processus de recherche. Pour &#233;valuer le taux de satisfaction de l&#8217;utilisateur, 
nous insisterons sur l&#8217;&#233;valuation de l&#8217;aide apport&#233;e. Le gain est palpable mais n&#233;cessite d&#8217;&#234;tre 
quantifi&#233;. C&#8217;est le sujet de la section suivante.  
</p>
<p>4 &#201;valuation de l&#8217;aide procur&#233;e par @GEWEB 
</p>
<p>Ce document permettra de donner une id&#233;e globale, non statistique, de l&#8217;apport de l&#8217;assistance 
des utilisateurs lors du processus de recherche documentaire sur le Web. Durant l&#8217;&#233;valuation 
des r&#233;sultats de recherche, la subjectivit&#233; de l'usager sera sollicit&#233;e pour v&#233;rifier l&#8217;ad&#233;quation 
de l&#8217;aide apport&#233;e. Pour ce qui est de l&#8217;&#233;valuation de l&#8217;aide &#224; la reformulation des requ&#234;tes, 
elle sera focalis&#233;e sur la &#171; qualit&#233; &#187; des termes extraits et l&#8217;&#233;valuation de la pertinence des 
documents obtenus d&#233;terminera la qualit&#233; de l&#8217;aide offerte pour la v&#233;rification des r&#233;sultats 
des recherches. La pertinence des termes est quantifi&#233;e en fonction de son utilit&#233;. Aussi, pour 
&#233;valuer la classification des r&#233;sultats de recherche d&#8217;@GEWEB, l&#8217;usager aura &#224; juger la 
pertinence des classes produites apr&#232;s chaque recherche. Dans ce cas, une classe est pertinente </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mohamed Yassine El Amrani, Sylvain Delisle et Isma&#239;l Biskri 
</p>
<p>lorsqu&#8217;elle regroupe des documents pertinents. La perception des usagers de l&#8217;assistance 
propos&#233;e sera capt&#233;e gr&#226;ce &#224; des questionnaires (El Amrani, 2003) laissant la libert&#233; 
d&#8217;expression &#224; la subjectivit&#233; de l&#8217;usager. 
</p>
<p>Les &#233;valuateurs avaient &#224; r&#233;pondre &#224; 12 questions sans qu'ils n'aient besoin de connaissances 
particuli&#232;res. &#171; Quelle est la mer la plus agit&#233;e au monde ? &#187; et &#171; Quel est le taux moyen 
d&#8217;inflation annuel de l&#8217;or et de l&#8217;argent au si&#232;cle dernier (20e si&#232;cle) ?&#187; constituent un sous-
ensemble des questions soumises aux &#233;valuateurs. Les r&#233;ponses devaient &#234;tre trouv&#233;es en 
utilisant les moteurs de recherche GOOGLE (http://www.google.com) et ALLTHEWEB 
(http://www.alltheweb.com) et le logiciel COPERNIC AGENT 2003 (http://www.copernic.com). C&#8217;est 
ainsi qu&#8217;une &#233;quipe de cinq &#233;tudiants &#224; la ma&#238;trise en math&#233;matiques et informatique 
appliqu&#233;es de l&#8217;Universit&#233; du Qu&#233;bec &#224; Trois-Rivi&#232;res a eu pour t&#226;che de r&#233;pondre &#224; une 
combinaison de douze questions en utilisant les m&#234;mes outils de recherche. Les s&#233;quences de 
questions ont &#233;t&#233; assign&#233;es &#224; chaque membre de l&#8217;&#233;quipe pour &#233;viter que la recherche sur une 
m&#234;me question soit effectu&#233;e par le m&#234;me outil de recherche par tous les membres de 
l&#8217;&#233;quipe. Comme la pertinence des documents reste fortement li&#233;e &#224; la subjectivit&#233; de chacun, 
nous avons privil&#233;gi&#233; les m&#233;triques permettant de l&#8217;estimer. Rappelons que cette exp&#233;rience 
n&#8217;a nullement la pr&#233;tention d&#8217;apporter des r&#233;ponses statistiques &#233;tant donn&#233; le nombre 
relativement limit&#233; d&#8217;&#233;valuateurs. Toutefois, les gains apport&#233;s par l&#8217;assistance de l&#8217;utilisateur 
lors de la reformulation de sa requ&#234;te ont &#233;t&#233;, nous allons le voir, appr&#233;ciables. La majorit&#233; du 
temps, les &#233;valuateurs ont eu &#224; reformuler leur requ&#234;te au moins une fois avant d&#8217;aboutir &#224; des 
r&#233;sultats satisfaisants. En moyenne, 60% des recherches effectu&#233;es ont n&#233;cessit&#233; une 
reformulation de la requ&#234;te. Le choix des mots-cl&#233;s devient alors un facteur tr&#232;s influent sur la 
vitesse de convergence de la recherche documentaire vers les informations pertinentes. Aussi, 
lors de la comparaison de l&#8217;&#233;volution des requ&#234;tes des utilisateurs pour r&#233;pondre &#224; une 
question donn&#233;e, une certaine r&#233;p&#233;tition de mots-cl&#233;s peut &#234;tre remarqu&#233;e. &#201;tant donn&#233; que les 
utilisateurs avaient &#224; r&#233;pondre &#224; des questions biens pr&#233;cises, leurs strat&#233;gies de recherche 
&#233;taient tr&#232;s souvent verticales. Concr&#232;tement, 97% des reformulations de requ&#234;te ont adopt&#233;s 
le mod&#232;le de recherche vertical. Or lorsque l&#8217;utilisateur ne poss&#232;de pas une connaissance 
pr&#233;cise du domaine d&#8217;application de sa requ&#234;te, la variation des mots-cl&#233;s devient tr&#232;s faible. 
Cette maigre variation engendre une r&#233;p&#233;tition d&#8217;un sous-ensemble de mots-cl&#233;s lors des 
reformulations des requ&#234;tes. Cette r&#233;p&#233;tition ne peut &#234;tre supprim&#233;e car certains mots-cl&#233;s 
v&#233;hiculent l&#8217;information recherch&#233;e par l&#8217;utilisateur et doivent faire partie de la requ&#234;te. 
Cependant, plus le nombre de mots-cl&#233;s issus de la requ&#234;te pr&#233;c&#233;dente est important, plus la 
variation des r&#233;sultats est faible. Il y a donc une augmentation du risque d&#8217;exclure des r&#233;sultats 
certains documents potentiellement pertinents, ce qui diminue de la justesse de ces r&#233;sultats. 
</p>
<p>Par contre, @GEWEB permet de limiter cette redondance. En moyenne, seulement 15% des 
termes utilis&#233;s pour reformuler la requ&#234;te de recherche proviennent de la requ&#234;te pr&#233;c&#233;dente. 
La moyenne des trois autres outils de recherche s&#8217;&#233;l&#232;ve &#224; 28,3%. Ceci nous am&#232;ne &#224; penser 
qu&#8217;@GEWEB permet &#224; l&#8217;usager de choisir des termes plus vari&#233;s &#233;vitant ainsi une trop grande 
r&#233;p&#233;tition de certains mots-cl&#233;s. D&#8217;ailleurs, le nombre moyen de termes propos&#233;s et jug&#233;s 
pertinent par l&#8217;utilisateur, &#224; la suite de chaque recherche, s&#8217;&#233;l&#232;ve &#224; 4,39. En cons&#233;quence, la 
proposition de termes aura une incidence directe sur le nombre de reformulations de requ&#234;te 
qui seront effectu&#233;es. Ainsi, en moyenne, les utilisateurs d&#8217;@GEWEB ont effectu&#233; 1,5 
reformulations de requ&#234;tes avant d&#8217;aboutir &#224; des documents pertinents. La moyenne des 
reformulations des autres outils de recherche s&#8217;&#233;l&#232;ve &#224; 4,2, ce qui est nettement plus &#233;lev&#233;. Ce 
qui permet de sugg&#233;rer qu&#8217;un gain a &#233;t&#233; obtenu gr&#226;ce, en partie du moins, &#224; la proposition de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>@geWeb : Agents personnels d&#8217;aide &#224; la recherche sur le Web 
</p>
<p>mots-cl&#233;s pour aider les usagers lors de la reformulation de leurs requ&#234;tes. De plus, le nombre 
moyen de classes g&#233;n&#233;r&#233;es s&#8217;&#233;l&#232;ve &#224; 6,34 avec une moyenne de 1,5 classes qui sont 
pertinentes pour l&#8217;utilisateur. De ce fait, l&#8217;utilisateur se concentre essentiellement sur les 
classes qui sont pertinentes lui &#233;vitant ainsi d&#8217;avoir &#224; inspecter le contenu de tous les 
documents qui figurent dans une m&#234;me classe non pertinente. En combinant tous ces r&#233;sultats 
nous obtenons une am&#233;lioration sensible du processus de recherche documentaire sur le Web. 
</p>
<p>Toutefois, ces r&#233;sultats sont accompagn&#233;s d&#8217;un co&#251;t en terme de temps de traitement. Chaque 
recherche effectu&#233;e avec @GEWEB qui a permis de r&#233;pondre &#224; la question pos&#233;e aux 
&#233;valuateurs a dur&#233;, en moyenne, 50,33 minutes. La dur&#233;e moyenne des recherches effectu&#233;es 
par les autres outils de recherche ayant permis d&#8217;aboutir vers un r&#233;sultat est de 16 minutes. La 
diff&#233;rence est donc importante mais non probl&#233;matique. En effet, notre outil n&#8217;&#233;tant encore 
qu&#8217;un premier prototype, tous les t&#233;l&#233;chargements de documents qui sont effectu&#233;s par les 
diff&#233;rents agents sont s&#233;quentiels. Ce temps pourrait facilement &#234;tre am&#233;lior&#233; 
significativement en t&#233;l&#233;chargeant en parall&#232;le les diff&#233;rents documents obtenus. Ce temps 
peut &#234;tre r&#233;duit &#233;galement en sollicitant simultan&#233;ment tous les moteurs de recherche pour 
r&#233;pondre &#224; la requ&#234;te de l&#8217;utilisateur. De plus, l&#8217;interaction avec le classificateur num&#233;rique 
GRAMEXCO, qui n&#233;cessite beaucoup de supervision de la part de l&#8217;utilisateur, peut &#234;tre 
am&#233;lior&#233;e, ouvrant ainsi la voie &#224; une autre r&#233;duction importante du temps de traitement. 
N&#233;anmoins, les traitements d&#8217;analyse des langues naturelles utilis&#233;s engendrent un co&#251;t 
incontestable mais non probl&#233;matique. Par cons&#233;quent, nous pensons que l&#8217;aide fournie aux 
usagers a permis d&#8217;am&#233;liorer leur exp&#233;rience de recherche documentaire sur le Web. Bien que 
l&#8217;&#233;valuation d&#8217;@GEWEB ne constitue pas une &#171; preuve statistique &#187;, il est n&#233;anmoins 
possible d&#8217;affirmer que l&#8217;aide fournie aux utilisateurs am&#233;liore l&#8217;exp&#233;rience de recherche 
documentaire sur le Web. 
</p>
<p>5 Conclusion 
</p>
<p>Les utilisateurs ne devraient pas s&#8217;attendre &#224; un d&#233;veloppement g&#233;n&#233;ralis&#233; d&#8217;outils permettant 
une am&#233;lioration significative de l&#8217;adaptabilit&#233; du Web &#224; leurs besoins personnels. 
L&#8217;utilisation d&#8217;outils Web automatis&#233;s uniquement emp&#234;chera les utilisateurs d&#8217;atteindre 
plusieurs de leurs buts lors des recherches sur le Web en &#233;cartant leur subjectivit&#233;. Ceci 
justifie l&#8217;approche utilis&#233;e dans notre travail : fournissons aux utilisateurs du Web des outils 
personnalis&#233;s qui vont les aider lors de leurs recherches sur le Web en utilisant leur 
subjectivit&#233;. L&#8217;&#233;valuation d&#8217;@GEWEB a sugg&#233;r&#233; que des gains notables &#233;taient perceptibles 
augmentant ainsi la qualit&#233; des recherches documentaires sur le Web. Notre contribution a 
consist&#233; (1) &#224; permettre aux usagers de personnaliser l&#8217;aide offerte lors de la reformulation de 
la requ&#234;te et (2) &#224; utiliser la classification pour regrouper les documents similaires obtenus 
pour un meilleur filtrage des r&#233;sultats de recherche. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>ANICK P., (2003), Using terminological feedback for web search refinement: a log-based 
study, Proceedings of the 26th annual international ACM SIGIR conference on Research and 
development in information retrieval, Toronto, Canada, 88&#8211;95. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mohamed Yassine El Amrani, Sylvain Delisle et Isma&#239;l Biskri 
</p>
<p>BELLOT P., EL-B&#200;ZE M. (2000), Clustering by means of Unsupervised Decision Trees or 
Hierarchical and K-means-like Algorithm, Conf&#233;rence sur la Recherche d'Informations 
Assist&#233;e par Ordinateur, 344&#8722;363. 
</p>
<p>BISKRI I., DELISLE S., (2002), Text Classification and Multilinguism: Getting at Words via N-
grams of Characters, 6th World Multiconference on Systemics, (SCI-2002), 110&#8722;115. 
</p>
<p>CARPINETO C., ROMANO G., GIANNINI V., (2002), Improving Retrieval Feedback with 
Multiple Term-Ranking Function Combination, ACM Transactions on Information Systems 
(TOIS), Volume 20,  Issue 3 (July 2002), 259&#8722;290. 
</p>
<p>EL AMRANI M.Y., (2001), Outils d'assistance &#224; la construction de Webs personnels : 
Utilisation des traitements des langues naturelles dans l'aide &#224; la reformulation de requ&#234;tes, 
Actes de la 5e Rencontre des &#201;tudiants Chercheurs en Informatique pour le Traitement 
Automatique des Langues, Tours, France, 497&#8722;502. 
</p>
<p>EL AMRANI M.Y., (2003), AgeWeb : Les agents personnels d&#8217;aide &#224; la recherche 
documentaire sur le Web, M&#233;moire de ma&#238;trise en math&#233;matiques et informatique appliqu&#233;es, 
Universit&#233; du Qu&#233;bec &#224; Trois-Rivi&#232;res, Trois-Rivi&#232;res, Canada. 
</p>
<p>EL AMRANI M.Y., DELISLE S., BISKRI I., (2001). Coping with Information Retrieval Problems 
on the Web: Towards Personal Web Weaver Agents, International Conference on Artificial 
Intelligence (IC-AI'2001), Las Vegas, USA, 1225&#8722;1231. 
</p>
<p>HUST A., (2004). Introducing Query Expansion Methods for Collaborative Information 
Retrieval. Lecture Notes in Computer Science. &#192; para&#238;tre. (http://www.dfki.uni-kl.de/~hust/publications.html) 
</p>
<p>MCARTHUR R., BRUZA P.D., (2000), The Ranking of Query Refinements in Interactive Web-
based Retrieval, Proceedings of the Information Doors Workshop (held in conjunction with 
the ACM Hypertext and Digital Libraries Conferences). 
</p>
<p>SALVATIERRA S.M. (1999), Statistical models for classification and discrimination with 
application to classifying web documents, Ph.D. Thesis Proposal, Department of Statistics, 
Carnegie Mellon University, http://citeseer.nj.nec.com/306657.html  
</p>
<p>SERRADURA L., SLIMANE M., VINCENT N., (2002), Classification semi-automatique de 
documents Web &#224; l'aide des Cha&#238;nes de Markov Cach&#233;es, Publication de l&#8217;&#233;quipe RFAI, 
Colloque Inforsid 2002, Nantes, France, 215-228. 
</p>
<p>TAMINE L., BOUGHANEM M. (2001), Un Algorithme g&#233;n&#233;tique sp&#233;cifique &#224; une reformulation 
multi-requ&#234;tes dans un syst&#232;me de recherche d&#8217;information, Revue Information &#8211; Interaction &#8211; 
Intelligence, Volume 1, num&#233;ro 1, http://www.revue-i3.org. 
</p>
<p>TURENNE N., (2000), Apprentissage statistique pour l&#8217;extraction de concepts &#224; partir de textes 
(Application au filtrage d&#8217;informations textuelles), Th&#232;se de doctorat en informatique, 
Universit&#233; Louis-Pasteur, Strasbourg, France. </p>

</div></div>
</body></html>