<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annoter en constituants pour &#233;valuer des analyseurs syntaxiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Annoter en constituants pour &#233;valuer
des analyseurs syntaxiques
</p>
<p>Anne Vilnat(1), Laura Monceaux(2), Patrick Paroubek(1), Isabelle Robba(1),
V&#233;ronique Gendner(1), Gabriel Illouz(1), Mich&#232;le Jardino(1)
</p>
<p>(1) LIMSI - CNRS
Universit&#233; d&#8217;Orsay, BP 133
</p>
<p>91403 Orsay CEDEX
{pr&#233;nom.nom}@limsi.fr
</p>
<p>(2) LINA
2 rue de la Houssini&#232;re, BP 92208
</p>
<p>44322 Nantes CEDEX 03
{pr&#233;nom.nom}@lina.univ-nantes.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article pr&#233;sente l&#8217;annotation en constituants men&#233;e dans le cadre d&#8217;un protocole d&#8217;&#233;valuation
des analyseurs syntaxiques (mis au point dans le pr&#233;-projet PEAS, puis dans le projet EASY).
Le choix des constituants est d&#233;crit en d&#233;tail et une premi&#232;re &#233;valuation effectu&#233;e &#224; partir des
r&#233;sultats de deux analyseurs est donn&#233;e.
</p>
<p>This paper focuses on constituent annotation in a syntactic parsers evaluation protocol (which
was elaborated in PEAS pre-project and EASY project). The choice of the constituents is
described in details, and the results of a first evaluation between two parsers are given.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>annotation en constituants, &#233;valuation, analyseurs syntaxiques
constituent annotation, evaluation, syntactic parser
</p>
<p>1 Introduction
</p>
<p>Avec le d&#233;veloppement d&#8217;Internet, l&#8217;acc&#232;s &#224; de grandes quantit&#233;s de donn&#233;es textuelles est de-
venu possible ; les analyseurs syntaxiques qui, en amont d&#8217;autres outils linguistiques, traitent
ces donn&#233;es ont alors d&#251; se fixer de nouveaux objectifs. Il doivent ainsi &#234;tre capables de traiter</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Vilnat, L. Monceaux, P. Paroubek, I. Robba, V. Gendner, G. Illouz, M. Jardino
</p>
<p>ces grandes quantit&#233;s en des temps raisonnables et surtout ils doivent faire face &#224; des donn&#233;es
tr&#232;s vari&#233;es dans leur forme et leur nature. C&#8217;est dans ce contexte que les analyseurs robustes ou
les analyseurs partiels ont &#233;t&#233; mis au point. Dans le m&#234;me temps, les analyseurs complets ont
continu&#233; d&#8217;&#234;tre &#233;tudi&#233;s, am&#233;lior&#233;s et plus r&#233;cemment des approches mixtes ont &#233;t&#233; &#233;labor&#233;es.
Ces derni&#232;res retournent une analyse partielle de la phrase mais dont les &#233;l&#233;ments sont analys&#233;s
en profondeur quand cela est possible (Frank et al., 2003), (A&#239;t-Mokthar et al., 2002).
</p>
<p>L&#8217;&#233;valuation des analyseurs permet d&#8217;une part &#224; ceux qui les utilisent de conna&#238;tre leurs forces et
leurs faiblesses, et d&#8217;autre part &#224; ceux qui les d&#233;veloppent de disposer d&#8217;une r&#233;f&#233;rence &#224; laquelle
ils peuvent se confronter. Cependant, comme le soulignent (Blache et Morin, 2003) ou (Briscoe
et al., 2002), l&#8217;&#233;valuation des analyseurs syntaxiques n&#8217;est en rien une t&#226;che facile et ce pour
diverses raisons : les sorties des analyseurs varient dans leur forme et leur nature d&#8217;un anal-
yseur &#224; l&#8217;autre, et m&#234;me en parvenant &#224; un accord sur ces sorties, des m&#233;triques &#233;quitables et
repr&#233;sentatives ne sont pas actuellement disponibles. Conscients de ces difficult&#233;s, nous avons
malgr&#233; tout mis au point un protocole complet d&#8217;&#233;valuation des analyseurs syntaxiques, bap-
tis&#233; PEAS, et dont la volont&#233; &#233;tait de n&#8217;&#233;carter la participation d&#8217;aucun analyseur. Ce protocole
PEAS (Gendner et al., 2003) a servi de pr&#233;-projet au projet EASY1 qui rassemble 5 fournisseurs
de corpus et 14 analyseurs participants. La campagne d&#8217;&#233;valuation men&#233;e par EASY au print-
emps 2004 sera, dans la mesure du possible, reproductible et donc reconduite autant d&#8217;ann&#233;es
que n&#233;cessaire. Apr&#232;s une pr&#233;sentation du protocole EASY, nous d&#233;taillons les principes adop-
t&#233;s pour l&#8217;annotation, nous exposons les premiers r&#233;sultats d&#8217;&#233;valuation comparative entre deux
analyseurs obtenus dans le cadre de PEAS et enfin nous &#233;voquons quelques travaux connexes.
</p>
<p>2 Pr&#233;sentation du protocole d&#8217;&#233;valuation
</p>
<p>Le protocole mis au point dans PEAS puis EASY est articul&#233; autour des modules suivants :
</p>
<p>1. La constitution d&#8217;un corpus d&#8217;1 million de mots, compos&#233; de textes h&#233;t&#233;rog&#232;nes en genre :
des articles de journaux, des extraits de romans, des recueils de questions, des transcrip-
tions de l&#8217;oral, des extraits de sites Internet. Et son formatage : normalisation, tokenisa-
tion et d&#233;coupage en phrases.
</p>
<p>2. L&#8217;annotation d&#8217;un sous-ensemble de 20 000 mots. Elle est effectu&#233;e &#224; l&#8217;aide d&#8217;un &#233;diteur
HTML et les r&#233;sultats sont transcrits dans un format XML.
</p>
<p>3. L&#8217;analyse par les participants et la transcription des sorties de leur analyseur dans un
format XML commun.
</p>
<p>4. L&#8217;&#233;valuation, pr&#233;vue actuellement comme un calcul du rappel et de la pr&#233;cision sur les
constituants et les relations, est toujours ouverte &#224; de nouvelles propositions.
</p>
<p>Les d&#233;cisions concernant le formalisme d&#8217;annotation ont &#233;t&#233; l&#8217;objet de nombreuses discussions
avec les fournisseurs de corpus d&#8217;une part (ils annotent de fa&#231;on semi-automatique ou manuelle
les corpus et doivent donc, dans la mesure du possible, &#234;tre en accord avec les choix portant
sur l&#8217;annotation) avec les participants d&#8217;autre part (qui doivent pouvoir disposer d&#8217;un format
dans lequel il leur sera possible de transcrire les r&#233;sultats de leur analyseur). Par ailleurs, le
</p>
<p>1Le projet EASY fait partie de la campagne d&#8217;&#233;valuation EVALDA du programme Technolangue, qui est &#224;
l&#8217;initiative du minist&#232;re d&#233;l&#233;gu&#233; &#224; la Recherche et aux Nouvelles Technologies ; il a d&#233;but&#233; en janvier 2003.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annoter en constituants pour &#233;valuer des analyseurs syntaxiques
</p>
<p>formalisme doit permettre une couverture la plus large possible des ph&#233;nom&#232;nes syntaxiques
de la langue. Notre but est aussi de constituer un corpus arbor&#233;, utilisable pour d&#8217;autres ap-
plications, constitu&#233; &#224; la fois d&#8217;une partie annot&#233;e manuellement, et d&#8217;une partie issue de la
combinaison des r&#233;sultats des diff&#233;rents analyseurs participant &#224; l&#8217;&#233;valuation. Nous ne d&#233;velop-
perons pas ce point ici, pour des raisons de place. Nous avons fait le choix d&#8217;annoter deux types
d&#8217;information : les constituants, avec leur cat&#233;gorie et leur &#233;tendue et les relations syntaxiques
ou fonctionnelles, avec les &#233;l&#233;ments en relation, qui peuvent &#234;tre des mots ou des constituants.
</p>
<p>3 L&#8217;annotation en constituants
</p>
<p>3.1 Principe g&#233;n&#233;ral
</p>
<p>L&#8217;annotation que nous allons d&#233;tailler dans cet article concerne les constituants, en supposant
que le d&#233;coupage en phrases et le d&#233;coupage en mots ont &#233;t&#233; pr&#233;alablement &#233;tablis. Ces deux
d&#233;coupages sont souvent consid&#233;r&#233;s comme des probl&#232;mes plus simples et quasiment r&#233;so-
lus, mais nous avons pu constater que lorsque l&#8217;on s&#8217;int&#233;resse &#224; des textes r&#233;els, ce n&#8217;&#233;tait pas
toujours le cas ! Nous ne d&#233;taillerons pas cet aspect ici, mais nous donnerons quelques exem-
ples. Pour le d&#233;coupage en phrases, le probl&#232;me est &#233;videmment rendu plus difficile quand les
textes analys&#233;s sont des transcriptions d&#8217;oral, spontan&#233; ou m&#234;me lu. La pr&#233;sence de ponctua-
tions fortes telles que le point est alors soit restitu&#233;e lors de la transcription, soit compl&#232;tement
absente. Il faut alors se fonder sur des crit&#232;res tels que la dur&#233;e des pauses pour essayer de
r&#233;-introduire la coupure en phrases. Les textes &#233;crits posent &#233;galement un certain nombre de
cas difficiles &#224; r&#233;soudre : par exemple lorsque le texte pr&#233;sente de nombreuses &#233;num&#233;rations,
sous forme de &#8220;listes &#224; puces&#8221;, ou du discours rapport&#233;, comme illustr&#233; ci-dessous.
</p>
<p>1. Pour brancher l&#8217;appareil, vous devez :
</p>
<p>&#0; v&#233;rifier votre installation &#233;lectrique. Si vous ne respectez pas les normes, votre
garantie ne fera plus effet.
</p>
<p>&#0; relier le cordon d&#8217;alimentation &#224; votre appareil...
</p>
<p>2. Le directeur affirma :&#8220;Je ne peux pas accepter une telle situation.&#8221;, devant le conseil
d&#8217;administration de son &#233;tablissement.
</p>
<p>Nous avons choisi de consid&#233;rer la phrase la plus longue possible, pour &#233;viter des d&#233;coupages
qui risqueraient de s&#233;parer des constituants, ou d&#8217;&#233;tablir des relations en franchissant la fronti&#232;re
de phrase, comme dans l&#8217;exemple 2 o&#249; la fin de la phrase se rapporte &#224; la toute premi&#232;re partie,
avant le discours rapport&#233;.
</p>
<p>Pour le d&#233;coupage en mots, nous nous sommes inspire&#233;s du travail r&#233;alis&#233; dans le cadre de
Grace (Adda et al., 1999) pour constituer une liste de mots compos&#233;s ou de locutions qui ne
formeront qu&#8217;un seul mot lors de l&#8217;annotation en constituants. En revanche aucun &#233;tiquetage
morphosyntaxique de ces mots n&#8217;est fait au pr&#233;alable (ni impos&#233; ou fourni aux syst&#232;mes partic-
ipants &#224; l&#8217;&#233;valuation). Par exemple dans : D&#232;s que le soleil se l&#232;ve, les coqs chantent., D&#232;s_que
ne forme qu&#8217;un seul mot.
</p>
<p>Ces deux d&#233;coupages &#233;tant faits, le d&#233;coupage en constituants peut alors avoir lieu. Le probl&#232;me
se pose de d&#233;terminer le nombre et la taille de ces constituants. Le principe g&#233;n&#233;ral que nous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Vilnat, L. Monceaux, P. Paroubek, I. Robba, V. Gendner, G. Illouz, M. Jardino
</p>
<p>avons adopt&#233; consiste &#224; annoter des constituants minimaux, non discontinus et non r&#233;cursifs.
Ce choix est dict&#233; par le fait que nous souhaitons proposer un cadre qui permette d&#8217;&#233;valuer
des analyseurs ayant des caract&#233;ristiques diverses, en essayant d&#8217;&#234;tre le plus &#233;quitable possible
envers chacun d&#8217;eux. Prenons un exemple simple : Le chat de la voisine. On peut analyser cette
phrase comme un groupe nominal complexe, constitu&#233; d&#8217;un groupe nominal (le chat) et d&#8217;un
groupe pr&#233;positionnel (de la voisine), extension (compl&#233;ment de nom) du premier. On peut
aussi n&#8217;annoter que les deux constituants simples, le rattachement du groupe pr&#233;positionnel au
groupe nominal &#233;tant alors not&#233; par une relation modifieur du nom. C&#8217;est cette solution que
nous avons adopt&#233;e. Elle nous permet de ne pas rejeter les analyseurs qui ne rel&#232;vent que les
constituants simples et de mieux noter les analyseurs plus pr&#233;cis o&#249; ces deux informations sont
retrouv&#233;es. Ce parti pris nous permet &#233;galement de simplifier la t&#226;che d&#8217;annotation.
</p>
<p>3.2 Quels constituants retenir ?
</p>
<p>Partant d&#8217;exemples r&#233;els et de la litt&#233;rature sur le domaine ((Abeill&#233; et Blache 2000), (Marcus et
al., 1993)...), nous avons d&#233;termin&#233; une liste de six constituants. Nous en donnons une premi&#232;re
d&#233;finition, que nous illustrons sur des exemples simples 2. La d&#233;limitation d&#8217;un constituant GX
est donn&#233;e dans une notation &#224; la XML :&lt;GX&gt; le constituant GX &lt;/GX&gt;.
</p>
<p>&#0; le groupe nominal (GN) : il est constitu&#233; d&#8217;un nom &#233;ventuellement pr&#233;c&#233;d&#233; d&#8217;un d&#233;termi-
nant (&lt;GN&gt; la porte &lt;/GN&gt;) et/ou d&#8217;un adjectif ant&#233;pos&#233; accompagn&#233; de ses modifieurs
(&lt;GN&gt; la tr&#233;s grande porte &lt;/GN&gt;), d&#8217;un nom propre (&lt;GN&gt; Rouletabille &lt;/GN&gt;) ou
d&#8217;un pronom NON clitique (&lt;GN&gt; eux &lt;/GN&gt;, &lt;GN&gt; qui &lt;/GN&gt;).
</p>
<p>&#0; le groupe pr&#233;positionnel (GP) : il est constitu&#233; d&#8217;une pr&#233;position et du GN qu&#8217;elle intro-
duit (&lt;GP&gt; de la chambre &lt;/GP&gt;) ou d&#8217;un d&#233;terminant et d&#8217;une pr&#233;position contract&#233;s
(du, aux, des) avec le GN introduit (&lt;GP&gt; du pavillon &lt;/GP&gt;) ou d&#8217;une pr&#233;position
suivie d&#8217;un adverbe (&lt;GP&gt; de l&#224; &lt;/GP&gt;), ou de pronoms qui remplacent des GP (&lt;GP&gt;
dont &lt;/GP&gt;, &lt;GP&gt; o&#249; &lt;/GP&gt;).
</p>
<p>&#0; le noyau verbal (NV) : il regroupe un verbe, les pronoms clitiques plus &#233;ventuellement les
particules euphoniques (-t- et l&#8217;), ainsi que la particule ne qui lui sont rattach&#233;s (&lt;NV&gt;
j&#8217;entendais &lt;/NV&gt;, &lt;NV&gt; on ne l&#8217;entendait &lt;/NV&gt; plus. Un noyau verbal peut &#234;tre
&#224; diff&#233;rents modes : temps conjugu&#233; mais aussi participe pr&#233;sent (&lt;NV&gt; d&#233;sob&#233;issant
&lt;/NV&gt; &#224; leurs parents), participe pass&#233; (&lt;NV&gt; ferm&#233;e &lt;/NV&gt; &#224; clef ) et infinitif (&lt;NV&gt;
ne veut &lt;/NV&gt; pas &lt;NV&gt; venir &lt;/NV&gt;). En cas de temps compos&#233;, nous identifions un
NV distinct pour chaque verbe (&lt;NV&gt; ils n&#8217;&#233;taient &lt;/NV&gt; pas &lt;NV&gt; ferm&#233;s &lt;/NV&gt;).
</p>
<p>&#0; le groupe adjectival (GA) : il contient un adjectif lorsqu&#8217;il n&#8217;est pas &#233;pith&#232;te ant&#233;pos&#233;
au nom (les barreaux &lt;GA&gt; intacts &lt;/GA&gt;) ou un participe pass&#233; (la solution &lt;GA&gt;
retenue &lt;/GA&gt; fut...) ou pr&#233;sent (les enfants &lt;GA&gt; d&#233;sob&#233;issants &lt;/GA&gt;) employ&#233;
comme adjectif.
</p>
<p>&#0; le groupe adverbial (GR) : il contient un adverbe, &#224; l&#8217;exception du ne qui fait partie du
NV (&lt;GR&gt; aussi &lt;/GR&gt;, &lt;GR&gt; encore &lt;/GR&gt; ,vous n&#8217;auriez &lt;GR&gt; pas &lt;/GR&gt;).
</p>
<p>&#0; le groupe verbal introduit par une pr&#233;position (PV) : il correspond &#224; un noyau verbal dont
le verbe n&#8217;est pas conjugu&#233; (infinitif, participe pr&#233;sent, ...) et introduit par une pr&#233;position
</p>
<p>2Plusieurs extraits sont issus du Myst&#232;re de la chambre jaune, de Gaston Leroux.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annoter en constituants pour &#233;valuer des analyseurs syntaxiques
</p>
<p>(&lt;PV&gt; d&#8217;&#233;branler &lt;/PV&gt;). Il peut contenir aussi des modifieurs de ce verbe, comme des
adverbes (&lt;PV&gt; de vraiment bouger &lt;/PV&gt;).
</p>
<p>3.3 Quelques probl&#232;mes
</p>
<p>Le d&#233;coupage d&#233;crit ci-dessus, semble simple &#224; respecter, pourtant lors de l&#8217;annotation, nous
avons constat&#233; que m&#234;me pour les constituants comme le groupe nominal, ce n&#8217;est pas tou-
jours si facile. Nous allons illustrer quelques-uns des probl&#232;mes li&#233;s &#224; l&#8217;annotation du groupe
nominal, du groupe pr&#233;positionnel et du noyau verbal. Cette pr&#233;sentation ne pr&#233;tend pas &#234;tre ex-
haustive mais illustrer &#224; la fois les probl&#232;mes rencontr&#233;s et les solutions qu&#8217;a permis d&#8217;apporter
le choix de nos constituants minimaux.
</p>
<p>3.3.1 Le groupe nominal GN
</p>
<p>Pour le groupe nominal, nous d&#233;taillerons le cas du glissement d&#8217;usage d&#8217;un adjectif en nom,
et l&#8217;annotation des groupes nominaux d&#233;signant des personnes. Beaucoup d&#8217;adjectifs peuvent
jouer le r&#244;le de nom et se construire de la m&#234;me fa&#231;on, &#224; savoir &#234;tre sujet d&#8217;une phrase et se
construire avec un d&#233;terminant seul. La question est alors de savoir si on fait glisser la cat&#233;gorie
du mot d&#8217;adjectif en nom, ou si on consid&#232;re qu&#8217;il est possible d&#8217;avoir un groupe nominal
sans nom, ou encore d&#8217;avoir un groupe adjectival comme sujet. Nous n&#8217;avons pas retenu cette
derni&#232;re possibilit&#233;, consid&#233;rant que la fonction (sujet) et la construction avec un d&#233;terminant
sont des arguments suffisamment forts pour faire de ces constituants des groupes nominaux. Il
reste &#224; trancher entre les deux autres possibilit&#233;s. Ainsi dans l&#8217;exemple suivant :
&lt;GN&gt; La plus belle &lt;/GN&gt; de la collection est &lt;GN&gt; la verte &lt;/GN&gt;.
faut-il consid&#233;rer que belle et verte deviennent des noms, ou qu&#8217;il est possible de d&#233;limiter un
groupe nominal constitu&#233; d&#8217;un d&#233;terminant et d&#8217;un adjectif ? Nous avons pr&#233;f&#233;r&#233; ne pas forcer
la transcat&#233;gorisation des mots, qui n&#8217;a pas de r&#233;elle justification, et donc accepter qu&#8217;un groupe
nominal puisse &#234;tre consid&#233;r&#233; comme bien form&#233;, m&#234;me s&#8217;il ne comporte aucun nom.
</p>
<p>Une autre question s&#8217;est pos&#233;e quand nous avons eu &#224; annoter une phrase telle que :
Le pr&#233;sident Xavier Chapuisat est pr&#233;sent.
Doit-il y avoir un seul, deux (&lt;GN&gt; Le pr&#233;sident &lt;/GN&gt; &lt;GN&gt; Xavier Chapuisat &lt;/GN&gt;) ou
trois groupes nominaux (&lt;GN&gt; Le pr&#233;sident &lt;/GN&gt; &lt;GN&gt; Xavier &lt;/GN&gt; &lt;GN&gt; Chapuisat
&lt;/GN&gt;) ? Nous avons d&#233;cid&#233; de consid&#233;rer que lorsque plusieurs noms propres se succ&#232;dent
sans d&#233;terminant ni pr&#233;position, ils forment un seul GN, dans les autres cas, nous en formons
plusieurs, qui seront li&#233;s par des relations de d&#233;pendance. D&#8217;o&#249; les annotations suivantes :
&lt;GN&gt; Le pr&#233;sident &lt;/GN&gt; &lt;GN&gt; Xavier Chapuisat &lt;/GN&gt; est pr&#233;sent.
&lt;GN&gt; Le d&#233;put&#233; &lt;/GN&gt; &lt;GN&gt; PS &lt;/GN&gt; est pr&#233;sent.
&lt;GN&gt; Le pr&#233;sident &lt;/GN&gt; &lt;GP&gt; de l&#8217;Universit&#233; Paris-Sud &lt;/GP &gt; est pr&#233;sent.
</p>
<p>3.3.2 Le groupe pr&#233;positionnel GP
</p>
<p>Il est important de noter que cette annotation en constituant GP n&#8217;est qu&#8217;un raccourci qui permet
de noter &#224; la fois l&#8217;&#233;tiquette du constituant et la relation entre le premier &#233;l&#233;ment (la pr&#233;posi-
tion) et ce qui suit (le GN introduit). Elle est possible dans la plupart des cas de GP, car la
pr&#233;position n&#8217;est que rarement d&#233;tach&#233;e du GN qu&#8217;elle introduit. C&#8217;est pourquoi nous l&#8217;avons</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Vilnat, L. Monceaux, P. Paroubek, I. Robba, V. Gendner, G. Illouz, M. Jardino
</p>
<p>retenu. Cependant, on peut rencontrer des cas d&#8217;incises par exemple o&#249; il y a s&#233;paration entre
ces &#233;l&#233;ments. Il faut alors revenir &#224; l&#8217;annotation &quot;compl&#232;te&quot;, &#224; savoir : annoter le GN comme
tel, laisser la pr&#233;position non annot&#233;e et traduire la relation de d&#233;pendance entre la pr&#233;position
et le GN par une relation de type compl&#233;menteur. Par exemple :
Il arrive &lt;GP&gt; en retard &lt;GP&gt; , avec , &lt;GP&gt; dans sa poche &lt;GP&gt; , &lt;GN&gt; un petit discours
&lt;/GN&gt; &#233;crit qu&#8217; il est oblig&#233; de garder.
en retard et dans sa poche sont annot&#233;s simplement comme des GP. En revanche, la relation
entre avec et un petit discours sera elle annot&#233;e &#224; l&#8217;aide d&#8217;une relation de d&#233;pendance. Il faudra
lors de l&#8217;&#233;valuation consid&#233;rer que ces annotations sont &#233;quivalentes.
</p>
<p>On trouve un cas un peu similaire lors de coordinations o&#249; la pr&#233;position est &quot;factoris&#233;e&quot; pour
deux GN.
&lt;GN&gt; les jeunes filles &lt;/GN&gt; arboraient donc &lt;GN&gt; un fichu &lt;/GN&gt; &#233;troitement nou&#233; &lt;GP&gt;
sous le menton &lt;/GP&gt; &lt;GP&gt; dans les couloirs &lt;/GP&gt; et &lt;GN&gt; la cour &lt;/GN&gt; &lt;GP&gt; de
r&#233;cr&#233;ation &lt;/GP&gt;
La relation entre dans et la cour sera annot&#233;e elle aussi comme une d&#233;pendance.
</p>
<p>3.3.3 Le noyau verbal NV
</p>
<p>Nous allons d&#233;tailler ici deux points : l&#8217;annotation des n&#233;gations, et la distinction entre par-
ticipes consid&#233;r&#233;s comme noyau verbal et ceux consid&#233;r&#233;s comme adjectifs. La particule de
n&#233;gation ne est incluse dans le NV auquel elle se rattache. Les autres adverbes de n&#233;gation
forment un GR car ils peuvent se trouver &#224; distance du verbe auquel ils se rattachent. Dans la
forme ne...que, que est adverbe et forme un GR, ne reste rattach&#233; au verbe (dans le NV corre-
spondant). Avec un infinitif, les adverbes de n&#233;gation sont plac&#233;s avant le verbe; dans ce cas ils
sont inclus dans le NV ou le PV : ma fille avait jur&#233; &lt;PV&gt; de ne jamais me quitter &lt;/PV&gt;.
La distinction entre noyau verbal et groupe adjectival n&#8217;est pas forc&#233;ment claire quand il s&#8217;agit
d&#8217;annoter des participes pr&#233;sents ou pass&#233;s.
Dans le cas de temps compos&#233;s, les participes pass&#233;s qui suivent un auxiliaire , comme par
exemple : le coq &lt;NV&gt; a &lt;/NV&gt; &lt;NV&gt; chant&#233; &lt;NV&gt; forment un noyau verbal. Un noyau
verbal est &#233;galement identifi&#233; quand on reconna&#238;t une proposition participiale :
leurs enfants &lt;NV&gt; &#233;lev&#233;s &lt;NV&gt;, les parents entreprennent un grand voyage
ces prescriptions&lt;NV&gt; am&#233;liorant &lt;/NV&gt; son &#233;tat, le m&#233;decin poursuivit le traitement
</p>
<p>Enfin, les participes sont consid&#233;r&#233;s comme verbes quand ils sont modifi&#233;s par un compl&#233;ment,
comme dans :
La porte de la chambre &lt;NV&gt; ferm&#233;e &lt;/NV&gt; &#224; clef &#224; l&#8217;int&#233;rieur.
Les c&#244;teaux &lt;NV&gt; environnant &lt;/NV&gt; la ville sont tr&#232;s verts.
</p>
<p>Dans les autres cas, ils sont not&#233;s comme des adjectifs.
</p>
<p>3.4 Quel b&#233;n&#233;fice ?
</p>
<p>Pour conclure cette pr&#233;sentation, plusieurs questions se posent. La premi&#232;re est de savoir si
l&#8217;annotation manuelle d&#8217;un gros corpus en suivant ces principes est possible. Pour r&#233;pondre &#224;
cette question, nous avons d&#8217;abord annot&#233; un premier corpus, ce qui nous a permis de v&#233;rifier le
bien fond&#233; de notre approche. Cette annotation a concern&#233; aussi bien les constituants que nous
avons pr&#233;sent&#233; ici que les relations (non d&#233;taill&#233;es dans cet article), qui traduisent &#224; la fois les</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annoter en constituants pour &#233;valuer des analyseurs syntaxiques
</p>
<p>imbrications des groupes simples dans des groupes plus complexes comme nous l&#8217;avons montr&#233;
plus haut, que les relations syntaxiques comme la relation sujet pour n&#8217;&#233;voquer que celle-ci.
Nous avons pour cela d&#233;velopp&#233; des outils d&#8217;annotation simples, ne n&#233;cessitant que l&#8217;usage
d&#8217;un &#233;diteur HTML standard. Cette &#233;tude ne nous a pas permis de d&#233;tecter tous les probl&#232;mes,
mais de lancer la campagne d&#8217;annotation du projet EASY, sur un corpus beaucoup plus gros.
Les probl&#232;mes rencontr&#233;s par les annotateurs nous ont alors permis d&#8217;affiner nos d&#233;finitions,
sans remettre en cause le cadre g&#233;n&#233;ral. On peut aussi se demander si cette annotation qui
para&#238;t simple permet de mettre en &#233;vidence des diff&#233;rences entre les analyseurs, m&#234;me si nous
souhaitons &#224; terme proc&#233;der &#224; une &#233;valuation globale qui regroupe constituants et relations.
C&#8217;est le but de l&#8217;&#233;tude que nous allons pr&#233;senter ci-dessous.
</p>
<p>4 Premiers r&#233;sultats de l&#8217;&#233;valuation men&#233;e dans PEAS
</p>
<p>Dans le protocole d&#8217;&#233;valuation PEAS, nous comparons les sorties des diff&#233;rents analyseurs &#224; un
corpus annot&#233; de r&#233;f&#233;rence en calculant les mesures de pr&#233;cision et de rappel pour les diff&#233;rents
constituants et pour chaque type de constituant pr&#233;sent dans le corpus de r&#233;f&#233;rence. Nous avons
en effet &#233;labor&#233; un corpus de r&#233;f&#233;rence compos&#233; de diff&#233;rents types de texte : corpus journalis-
tiques (not&#233; dans les figures : LeMonde.num), des extraits de roman (ABU.num et L782.num),
des questions et des corpus oraux (111997.num et SECODIP.num), afin de permettre une &#233;val-
uation cibl&#233;e sur les ph&#233;nom&#232;nes linguistiques propres &#224; un type de texte particulier. Pour
pouvoir comparer les sorties des analyseurs avec notre corpus de r&#233;f&#233;rence, elles devront &#234;tre
projet&#233;es dans le formalisme PEAS pr&#233;sent&#233; section 3. Cette projection passe par l&#8217;application
de r&#232;gles de r&#233;&#233;criture plus ou moins complexes. Dans la projection des deux analyseurs &#233;val-
u&#233;s, certaines informations ne sont pas repr&#233;sent&#233;es par le m&#234;me type d&#8217;information (adverbe
repr&#233;sent&#233; par une &#233;tiquette morpho-syntaxique et non par un constituant) (Monceaux 2002).
</p>
<p>Une fois la projection r&#233;alis&#233;e, la concordance de la segmentation en &#233;nonc&#233;s et en formes en-
tre la r&#233;f&#233;rence et les sorties des analyseurs doit &#234;tre v&#233;rifi&#233;e, car les analyseurs syntaxiques
n&#8217;effectuent pas n&#233;cessairement des segmentations identiques &#224; celles de la r&#233;f&#233;rence. Une
&#233;tape de r&#233;alignement est donc n&#233;cessaire. Notons que le d&#233;compte des erreurs se fait selon
la segmentation de la r&#233;f&#233;rence ce qui peut parfois entra&#238;ner une variation artificielle du nom-
bre de formes (et potentiellement d&#8217;erreurs) certaines formes n&#8217;&#233;tant pas r&#233;align&#233;es ou bien
faisant l&#8217;objet d&#8217;une expansion en plusieurs tokens ; mais jusqu&#8217;&#224; pr&#233;sent ce biais (variation
des distances entre les points repr&#233;sentatifs des performances des syst&#232;mes) n&#8217;a jamais remis en
cause les r&#233;sultats globaux de l&#8217;&#233;valuation, ni les diff&#233;rences relatives de performance entre les
diff&#233;rents syst&#232;mes.
</p>
<p>Dans les r&#233;sultats des figures 1 et 2, on constate que l&#8217;analyseur p2 retourne plus d&#8217;informations
pr&#233;cises et en plus grand nombre que l&#8217;analyseur p1, sauf pour le constituant PV. Mais si l&#8217;on
regarde de plus pr&#232;s les mesures effectu&#233;es, pour chaque constituant, par type de corpus, on
peut constater que dans certains cas la pr&#233;cision de l&#8217;analyseur p1 est l&#233;g&#233;rement plus &#233;lev&#233;e
que celle de p2, comme par exemple pour le sous-corpus de questions, o&#249; la pr&#233;cision globale
de tous les constituants est sensiblement meilleure pour l&#8217;analyseur p1.
</p>
<p>D&#8217;apr&#232;s les mesures effectu&#233;es, la t&#226;che de segmentation en constituants ne semble pas &#234;tre aussi
simple qu&#8217;il para&#238;t, puisque globalement l&#8217;analyseur p2 renvoie environ 20% d&#8217;informations
erron&#233;es et ne d&#233;tecte pas environ 20% des constituants. Dans cette &#233;valuation, on note aussi
que le constituant GA semble &#234;tre le constituant posant le plus de probl&#232;mes : pour les deux</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Vilnat, L. Monceaux, P. Paroubek, I. Robba, V. Gendner, G. Illouz, M. Jardino
</p>
<p>&quot;p1.dat&quot; using 1:2:3
&quot;p2.dat&quot; using 1:2:3
</p>
<p>GN
GP
</p>
<p>GR
GA
</p>
<p>NV
PV 111997.02
</p>
<p>ABU.02ABU.03
L782.01L782.04
</p>
<p>L782.05L782.07
L782.10L782.11
</p>
<p>L782.12L782.13
L782.14L782.15
</p>
<p>LeMonde.02LeMonde.03
Questions.01Questions.02
</p>
<p>Questions.03SECODIP.01
SECODIP.02
</p>
<p> 0
 0.1
 0.2
 0.3
 0.4
 0.5
 0.6
 0.7
 0.8
 0.9
</p>
<p> 1
</p>
<p>Figure 1: R&#233;sultats compar&#233;s en pr&#233;cision
</p>
<p>&quot;p1.dat&quot; using 1:2:4
&quot;p2.dat&quot; using 1:2:4
</p>
<p>GN
GP
</p>
<p>GR
GA
</p>
<p>NV
PV 111997.02
</p>
<p>ABU.02ABU.03
L782.01L782.04
</p>
<p>L782.05L782.07
L782.10L782.11
</p>
<p>L782.12L782.13
L782.14L782.15
</p>
<p>LeMonde.02LeMonde.03
Questions.01Questions.02
</p>
<p>Questions.03SECODIP.01
SECODIP.02
</p>
<p> 0
 0.1
 0.2
 0.3
 0.4
 0.5
 0.6
 0.7
 0.8
 0.9
</p>
<p> 1
</p>
<p>Figure 2: R&#233;sultats compar&#233;s en rappel
</p>
<p>analyseurs, la pr&#233;cision et le rappel sont beaucoup plus faibles.
</p>
<p>L&#8217;&#233;valuation propos&#233;e par PEAS pr&#233;sente les comparaisons de performance en fonction du
type de composant et de texte, ce qui permet d&#8217;effectuer des comparaisons fines entre les sys-
t&#232;mes ou de calibrer au mieux les performances d&#8217;un analyseur en fonction des sp&#233;cificit&#233;s de
l&#8217;application pour laquelle il sera utilis&#233;.
</p>
<p>5 Travaux en &#233;valuation des analyseurs syntaxiques
</p>
<p>A notre connaissance, pour les analyseurs du fran&#231;ais, la premi&#232;re publication sur l&#8217;&#233;valuation
des analyseurs syntaxiques est (Abeill&#233;, 1991) qui relate l&#8217;&#233;valuation par un comit&#233; d&#8217;experts de
plusieurs analyseurs du francais. Cette &#233;valuation portait sur le nombre d&#8217;analyses retourn&#233;es
et sur leur validit&#233;. Le projet TSNLP (Oepen et al., 1996) a tent&#233; de capitaliser les connais-
sances linguistiques sous forme de jeux de tests. Il offre pour plusieurs langues europ&#233;ennes
dont le fran&#231;ais, des phrases de test avec des exemples positifs et n&#233;gatifs, pour les principaux
ph&#233;nom&#232;nes syntaxiques. Les corpus arbor&#233;s offrent l&#8217;avantage d&#8217;&#234;tre plus repr&#233;sentatifs de
la distribution des ph&#233;nom&#232;nes linguistiques dans la langue, le premier et le plus c&#233;l&#232;bre est
certainement le PennTreeBank (Marcus et al., 1993), qui contient des annotations bas&#233;es sur les
constituants et qui a inspir&#233; d&#8217;autres d&#233;veloppements, par exemple (Brants et al., 2002) ou pour
le fran&#231;ais (Abeill&#233; et Blache 2000).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annoter en constituants pour &#233;valuer des analyseurs syntaxiques
</p>
<p>La premi&#232;re campagne d&#8217;&#233;valuation comparative selon une m&#233;thodologie bo&#238;te noire est (Black
et al., 1991) qui attaque le probl&#232;me par le biais des mesures d&#8217;&#233;valuation et propose de com-
parer les syst&#232;mes sur les fronti&#232;res de constituants au moyen du taux de croisement (nombre de
fronti&#232;res de constituants produits par l&#8217;analyseur, qui croisent une fronti&#232;re de constituant de la
r&#233;f&#233;rence) et le taux de rappel (nombre de fronti&#232;res de constituants produits par l&#8217;analyseur qui
existent dans la r&#233;f&#233;rence). On a par la suite ajout&#233; la pr&#233;cision &#224; ces deux mesures pour former
ce que l&#8217;on appelle le GEIG7 scheme (Srinivas et al., 1996) ou mesures PARSEVAL (Carroll et
al., 2003). Malheureusement ces mesures ne sont applicables pratiquement que sur des consti-
tuants non &#233;tiquet&#233;s (d&#233;pourvus de cat&#233;gorie), les sorties des analyseurs &#233;tant trop diff&#233;rentes
pour essayer d&#8217;incorporer cette information dans le processus d&#8217;&#233;valuation. Il en r&#233;sulte une
&#233;valuation ne tenant compte que d&#8217;une partie des informations produites par les analyseurs et
qui de plus s&#8217;applique plus facilement aux formalismes produisant une analyse en constituants.
</p>
<p>Pour essayer d&#8217;ouvrir l&#8217;&#233;valuation vers diff&#233;rents types d&#8217;analyseurs de nouvelles approches
orient&#233;es sur les d&#233;pendances (Lin, 1998) ou m&#234;me sur les relations grammaticales sont ap-
parues (Carroll et al., 1998) (Briscoe et al., 2002) (Carroll et al., 2003). C&#8217;est l&#8217;approche que
nous suivons dans EASY (Vilnat et al., 2003).
</p>
<p>6 Conclusion
</p>
<p>Les travaux initi&#233;s dans PEAS et en cours de d&#233;veloppement dans la campagne EVALDA-
EASY du programme TECHNOLANGUE ont permis de valider comme support d&#8217;&#233;valuation,
un formalisme d&#8217;annotation syntaxique pour le fran&#231;ais, &#224; la fois sur les ph&#233;nom&#232;nes linguis-
tiques effectivement rencontr&#233;s en corpus et vis-&#224;-vis de la communaut&#233; des d&#233;veloppeurs de
syst&#232;mes. Ce r&#233;sultat est concr&#233;tis&#233; dans le guide d&#8217;annotation3, d&#233;crivant comment utiliser
le formalisme. Nous avons aussi pr&#233;sent&#233; un premier ensemble de mesures de pr&#233;cision et de
rappel sur les fronti&#232;res de constituants, r&#233;alis&#233; sur le corpus PEAS avec le concours de deux
participants t&#233;moins. Bien que les diff&#233;rences de performance observ&#233;es soient relativement
faibles, le calcul des r&#233;sultats par type de constitutant et de corpus permet d&#8217;avoir une perception
fine des diff&#233;rences de comportement entre les deux syst&#232;mes. Ces r&#233;sultats seront compl&#233;t&#233;s
dans un avenir tr&#232;s proche par une comparaison avec un algorithme de simple identification
des constituants, une &#233;tude de pertinence statistique des diff&#233;rences observ&#233;es, et une &#233;tude de
l&#8217;effet sur les r&#233;sultats d&#8217;un rel&#226;chement de contraintes sur les fronti&#232;res de constituants. Bien
entendu, les r&#233;sultats prendont toute leur signification lorsque les mesures auront &#233;t&#233; effectu&#233;es
dans la campagne EASY, sur un corpus de taille plus importante, avec plus de participants, et
surtout accompagn&#233;es de mesures sur les d&#233;pendances.
</p>
<p>Remerciements
</p>
<p>Nous tenons ici &#224; remercier les membres de ELDA qui participent &#224; l&#8217;organisation de EASY :
Khalid Choukri et Kevin Mc Tait ; ainsi que les premiers annotateurs, R&#233;my Bonnet et Pierre
Zweigenbaum, et l&#8217;&#233;quipe de Jean V&#233;ronis (LPL &#224; Aix) qui nous ont permis par leurs questions
pertinentes et pr&#233;cises de compl&#233;ter d&#8217;exemples et d&#8217;explications notre guide d&#8217;annotation.
</p>
<p>3http://www.limsi.fr/Recherche/CORVAL/easy/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Vilnat, L. Monceaux, P. Paroubek, I. Robba, V. Gendner, G. Illouz, M. Jardino
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A. (1991), Analyseurs syntaxiques du fran&#231;ais, Bulletin Semestriel de l&#8217;ATALA (Association
pour le Traitement Automatique des Langues), Vol. 32, No. 21, pp. 107-120.
</p>
<p>ABEILL&#201; A., BLACHE P. (2000), Grammaires et Analyseurs syntaxiques, Ing&#233;nierie des Langues sous
la direction de J.-M. Pierrel, Ch. 2, pp. 51-76, Hermes, Paris.
</p>
<p>ADDA G., MARIANI J., PAROUBEK P., RAJMAN M., LECOMTE J.(1999) L&#8217;action GRACE
d&#8217;&#233;valuation de l&#8217;assignation de parties du discours pour le fran&#231;ais, Langues, Vol. 2, No. 2, pp 119-
129.
</p>
<p>A&#207;T-MOKTHAR S., CHANOD J., ROUX C. (2002), Robustness beyond shallowness : incremental deep
parsing, Journal of Natural Language Engineering, Vol. 8, No. 3-2.
</p>
<p>BLACHE P., MORIN J.-Y. (2003), Une grille d&#8217;&#233;valuation pour les analyseurs syntaxiques, Atelier sur
l&#8217;&#233;valuation des analyseurs syntaxiques - TALN, pp 77-86
</p>
<p>BLACK E., ABNEY S., FLICKENGER D., GDANIEC C., GRISHMAN R., HARISON P., HINDLE D.,
INGRIA R., JELINECK F., KLAVANS J., LIBERMAN M., MARCUS M., ROUKOS S., SANTORINI B.,
STRZALKOZSKI T. (1991), A Procedure for Quantitatively Comparing the Syntactic Coverage of English
Grammars, 4th DARPA Speech and Natural Language Workshop, Morgan Kaufman, pp. 306-311.
</p>
<p>BRANTS T., DIPPER S., HANSEN S., LEZIUS W., SMITH G. (2002), The TIGER Treebank, 1rst Work-
shop on Treebanks and Linguistic Theories (TLT), Sozopol, Bulgaria.
</p>
<p>BRISCOE E, CARROLL J., GRAHAM J., COPESTAKE A. (2002), Relational evaluation schemes, Work-
shop Beyond PARSEVAL - Toward improved evaluation measures for parsing systems, 3rd LREC, Las
Palmas, Gran Canaria.
</p>
<p>CARROLL J., BRISCOE T., SANFILIPO A. (1998), Parser Evaluation: a Survey and a New Proposal, 1st
LREC, Granada, vol. 1 pp. 447-454
</p>
<p>CARROLL J., MINNEN G., BRISCOE E. (2003) Parser evaluation using a grammatical relation annota-
tion scheme, In A. Abeill&#233; (ed.), Treebanks: Building and Using Parsed Corpora, Dordrecht Kluwer, pp.
299-316
</p>
<p>FRANK A., BECKER M., CRYSMANN B., KIEFER B., SCH&#196;FER U. (2003) Integrated shallow and
deep parsing : TopP meets HPSG , 41st ACL, pp. 104-111, 2003
</p>
<p>GENDNER V., ILLOUZ G., JARDINO M., PAROUBEK P., MONCEAUX L., ROBBA I., VILNAT A.
(2003), Proposition de protocole d&#8217;&#233;valuation des analyseurs syntaxiques, Atelier sur l&#8217;&#233;valuation des
analyseurs syntaxiques de la conf&#233;rence TALN, pp 87-94
</p>
<p>LIN D. (1998), Dependency-Based Evaluation of MINIPAR Workshop on Evaluation of Parsing Systems,
1st LREC, Granada.
</p>
<p>MARCUS M., SANTORINI B., MARCINKIEWICZ M. (1993), Building a large annotated corpus of En-
glish : The Penn treebank, Computational Linguistics, 19:313-330
</p>
<p>MONCEAUX L. (2002), Adaptation du niveau d&#8217;analyse des interventions dans un dialogue. Application
&#224; un syst&#232;me de question-r&#233;ponse. Th&#232;se de l&#8217;universit&#233; Paris 11, D&#233;cembre 2002.
</p>
<p>OEPEN S., NETTER N., KLEIN J. (1996), Test Suites for Natural Language Processing, Linguistic
Databases, Nerbonne J. editor, Center for the Study of Language and Information, CSLI Lecture Notes.
</p>
<p>SRIVINAS B., DORAN C., HOCKEY B.A., JOSHI A.K. (1996), An approach to Robust Partial Parsing
and Evaluation Metrics,Workshop on Robust Parsing, ESSLI, Prague.
</p>
<p>VILNAT A., PAROUBEK P., MONCEAUX L., ROBBA I., GENDNER V., ILLOUZ G., JARDINO M.
(2003), EASY or How Difficult Can It Be to Define a Reference Treebank for French, 2nd Workshop on
Treebanks and Linguistic Theories (TLT) , V&#228;xj&#246;, Sweden.</p>

</div></div>
</body></html>