<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La FREEBANK : vers une base libre de corpus annot&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19-21 avril 2004 
</p>
<p>La FREEBANK : vers une base libre de corpus annot&#233;s  
</p>
<p>Susanne Salmon-Alt (1), Eckhard Bick (2),  
</p>
<p>Laurent Romary (3), Jean-Marie Pierrel (1)  
</p>
<p>(1) ATILF &#8211; CNRS (UMR 7118) 
</p>
<p> 44, avenue de la Lib&#233;ration, B.P. 30687, 54063 Nancy, France 
</p>
<p>{Susanne.Salmon-Alt, Jean-Marie.Pierrel}@atilf.fr 
</p>
<p> 
</p>
<p>(2) University of Southern Denmark 
</p>
<p>Campusvej 55, DK-5230 Odense, Denmark 
</p>
<p>lineb@hum.au.dk 
</p>
<p> 
</p>
<p>(3) LORIA &#8211;  INRIA (UMR 7503) 
</p>
<p>Campus Scientifique, B.P. 239, 54506 Vand&#339;uvre L&#232;s Nancy, France 
</p>
<p>Laurent.Romary@loria.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
</p>
<p>Les corpus fran&#231;ais librement accessibles annot&#233;s &#224; d&#8217;autres niveaux linguistiques que 
</p>
<p>morpho-syntaxique sont insuffisants &#224; la fois quantitativement et qualitativement. Partant de 
</p>
<p>ce constat, la FREEBANK &#16; construite sur la base d&#8217;outils d&#8217;analyse automatique dont la sortie 
est r&#233;vis&#233;e manuellement &#16; se veut une base de corpus du fran&#231;ais annot&#233;s &#224; plusieurs niveaux 
(structurel, morphologique, syntaxique, cor&#233;f&#233;rentiel) et &#224; diff&#233;rents degr&#233;s de finesse 
</p>
<p>linguistique qui soit libre d&#8217;acc&#232;s, cod&#233;e selon des sch&#233;mas normalis&#233;s, int&#233;grant des 
</p>
<p>ressources existantes et ouverte &#224; l&#8217;enrichissement progressif.  
</p>
<p> 
</p>
<p>The few available French resources for evaluating linguistic models or algorithms on other 
</p>
<p>linguistic levels than morpho-syntax are either insufficient from quantitative as well as 
</p>
<p>qualitative point of view or not freely accessible. Based on this fact, the FREEBANK project 
</p>
<p>intends to create French corpora constructed using manually revised output from a hybrid 
</p>
<p>Constraint Grammar parser and annotated on several linguistic levels (structure, morpho-
</p>
<p>syntax, syntax, coreference), with the objective to make them available on-line for research 
</p>
<p>purposes. Therefore, we will focus on using standard annotation schemes, integration of 
</p>
<p>existing resources and maintenance allowing for continuous enrichment of the annotations. 
</p>
<p>Mots Cl&#233;s &#8211; Keywords 
</p>
<p>ressources libres, annotation multiniveau, corpus arbor&#233;, codage r&#233;f&#233;rentiel, normalisation 
</p>
<p> 
</p>
<p>free resources, multi-level annotation, treebank, reference annotation, normalisation 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Susanne Salmon-Alt, Eckhard Bick, Laurent Romary, Jean-Marie Pierrel 
</p>
<p>1 Vers une base libre &#224; annotations linguistiques multiples 
</p>
<p>La multiplication r&#233;cente des projets de constitution de grands corpus fran&#231;ais annot&#233;s au 
</p>
<p>del&#224; de l&#8217;&#233;tiquetage morpho-syntaxique (Tutin 1999, Salmon-Alt 2002, Abeill&#233; 2003, Vilnat 
</p>
<p>et al. 2003) soul&#232;ve avec force un certain nombre d&#8217;interrogations li&#233;es &#224; leur exploitation 
</p>
<p>ult&#233;rieure : &#233;tant donn&#233; le co&#251;t extr&#234;mement &#233;lev&#233; de l&#8217;annotation et/ou de la correction 
</p>
<p>manuelle de telles ressources (d&#8217;autant plus n&#233;cessaire que les niveaux d&#8217;analyse sont &#233;lev&#233;s), 
</p>
<p>la prise en compte des besoins des utilisateurs potentiels autres que les concepteurs eux-
</p>
<p>m&#234;mes devrait occuper une place de choix dans la d&#233;finition des caract&#233;ristiques 
</p>
<p>fondamentales du corpus &#224; constituer. Or, comme l&#8217;a montr&#233; une exp&#233;rience r&#233;cente, cela est 
</p>
<p>loin d&#8217;&#234;tre le cas &#224; l&#8217;heure actuelle : 
</p>
<p>Le projet ANANAS
1
 avait pour objectif la cr&#233;ation d&#8217;une base de corpus fran&#231;ais, libres de 
</p>
<p>droits et annot&#233;s en relations anaphoriques selon un sch&#233;ma normalis&#233;, accessibles en ligne 
</p>
<p>pour la communaut&#233; francophone du TAL. Les annotations devaient comprendre au moins un 
</p>
<p>d&#233;coupage structurel et un &#233;tiquetage morpho-syntaxique, l&#8217;id&#233;al &#233;tant une analyse syntaxique 
</p>
<p>des constituants et des d&#233;pendances. La pr&#233;sence de ces informations &#233;tait en effet 
</p>
<p>absolument cruciale pour la constitution de ressources-cl&#233;s pour l&#8217;&#233;valuation du traitement 
</p>
<p>automatique des anaphores, ce traitement &#233;tant bas&#233; sur des connaissances structurelles 
</p>
<p>(segmentation du texte en titres, paragraphes et phrases), morphologiques (parties du 
</p>
<p>discours, genre, nombre), syntaxiques (identification des groupes nominaux ainsi que de leur 
</p>
<p>structure interne, structures phrastiques, fonctions grammaticales) voire s&#233;mantiques 
</p>
<p>(restrictions s&#233;lectionnelles, classifications s&#233;mantiques). Toutefois, sur le nombre de 
</p>
<p>ressources fran&#231;aises pr&#233;-annot&#233;es au moins partiellement en anaphores, &#224; peine 5% (51.000 
</p>
<p>mots) &#233;taient libres de droits, aucun sch&#233;ma d&#8217;annotation n&#8217;&#233;tait partag&#233;, les ph&#233;nom&#232;nes 
</p>
<p>annot&#233;s &#233;taient extr&#234;mement h&#233;t&#233;rog&#232;nes et seul un des corpus (Popescu-Belis 1999) avait fait 
</p>
<p>l&#8217;objet d&#8217;une annotation multiniveaux syst&#233;matique (annotation structurelle, morphologique 
</p>
<p>et syntaxique). En ce qui concerne les ressources pr&#233;-annot&#233;es &#224; d&#8217;autres niveaux (sur 
</p>
<p>lesquelles nous aurions pu greffer l&#8217;annotation anaphorique), seul le corpus MAIF
2
 et des 
</p>
<p>ressources dialogiques
3
 nous ont &#233;t&#233; facilement accessibles. En particulier, nous n&#8217;avons pas 
</p>
<p>eu acc&#232;s au seul corpus arbor&#233; du fran&#231;ais (Abeill&#233; 2003). Par ailleurs, la cr&#233;ation d&#8217;un 
</p>
<p>corpus-cl&#233; pour l&#8217;&#233;valuation syntaxique (projet EASY, Vilnat et al., 2003) ne semble gu&#232;re 
</p>
<p>plus prometteur : il s&#8217;agit &#224; nouveau de ressources sous droits et en dehors des initiatives de 
</p>
<p>normalisation en cours. 
</p>
<p>Partant de ces constats &#16; et quitte &#224; r&#233;annoter des ressources quasiment &#224; partir de z&#233;ro &#16; 
nous avons pris le parti d&#8217;en faire la FREEBANK, une base de corpus fran&#231;ais qui, au del&#224; de 
</p>
<p>son int&#233;r&#234;t dans le domaine des anaphores et de la r&#233;f&#233;rence, est destin&#233;e &#224; devenir une 
</p>
<p>ressource &#224; vocation largement plus g&#233;n&#233;rique : elle est en effet constitu&#233;e exclusivement de 
</p>
<p>textes libres de droit et diffusables en ligne, elle fait l&#8217;objet d&#8217;une annotation multiniveaux 
</p>
<p>(structurelle, morpho-syntaxique, syntaxique, cor&#233;f&#233;rence et anaphores), elle suit les 
</p>
<p>initiatives de normalisation en cours et elle est con&#231;ue comme une ressource &#233;volutive, 
</p>
<p>capable d&#8217;int&#233;grer, apr&#232;s validation par un comit&#233; d&#8217;&#233;dition, des mises &#224; jours soumises en 
</p>
<p>ligne par la communaut&#233; scientifique. 
</p>
<p>                                                 
1
 http://www.inalf.fr/atilf/ananas 
</p>
<p>2
 cf. TAL, vol. 35:1, Approches s&#233;mantiques, 1994. 
</p>
<p>3
 http://www.loria.fr/projets/asila/corpus.html </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La FREEBANK : Vers une base libre de corpus annot&#233;s 
</p>
<p>2 Principes m&#233;thodologiques 
</p>
<p>2.1 Contenu de la base 
</p>
<p>Notre objectif premier est la cr&#233;ation d&#8217;une base &#224; la fois libre d&#8217;acc&#232;s et utile &#224; la 
</p>
<p>communaut&#233; scientifique. L&#8217;accent est donc mis sur la collecte de corpus libres de droits, 
</p>
<p>couvrant une vari&#233;t&#233; de genres diff&#233;rents et, dans la mesure du possible, pr&#233;annot&#233;s : textes 
</p>
<p>litt&#233;raires (&#339;uvres libres de droits de FranText), journalistiques (L&#8217;Est R&#233;publicain), 
</p>
<p>scientifiques (th&#232;ses, articles scientifiques), techniques (Journal du CNRS), administratifs 
</p>
<p>(corpus MAIF, textes l&#233;gislatifs) et corpus oraux (dialogues de renseignement et dialogues 
</p>
<p>finalis&#233;s)
4
.  Les corpus s&#233;lectionn&#233;s jusqu&#8217;ici couvrent environ un million de mots et int&#232;grent 
</p>
<p>certaines ressources utilis&#233;es auparavant dans d&#8217;autres projets de recherche. La base reste 
</p>
<p>n&#233;anmoins ouverte &#224; l&#8217;enrichissement. 
</p>
<p>2.2 Sch&#233;mas d&#8217;annotation : normalisation et codage stand-off 
</p>
<p>Concernant les principes de codage &#16; et ceci &#224; tous les niveaux linguistiques &#16; nous nous 
sommes fix&#233;s deux priorit&#233;s : garantir la compatibilit&#233; avec les standards ou recommandations 
</p>
<p>internationales et veiller &#224; la modularisation des informations cod&#233;es. Pour atteindre cet 
</p>
<p>objectif, nous partons des principes g&#233;n&#233;riques de sp&#233;cification de codage propos&#233;s par Ide et 
</p>
<p>Romary (2003), d&#233;j&#224; impl&#233;ment&#233;s dans le domaine de la terminologie avec la publication du 
</p>
<p>standard ISO 16642 (Terminological Markup Framework) : pour chaque niveau linguistique, 
</p>
<p>il s&#8217;agit d&#8217;identifier un m&#233;ta-mod&#232;le sp&#233;cifiant le squelette structurel et de r&#233;pertorier un 
</p>
<p>ensemble de cat&#233;gories de donn&#233;es sp&#233;cifiques &#224; la description linguistique de ce niveau. 
</p>
<p>En ce qui concerne la standardisation des sch&#233;mas pour l&#8217;annotation linguistique, la TEI
5
 
</p>
<p>est le standard pour le codage structurel des documents (Sperberg-McQueen et Burnard 
</p>
<p>2002). Pour les niveaux d&#8217;annotation plus sp&#233;cifiques &#16; morphologie, syntaxe ou cor&#233;f&#233;rence 
&#16; il n&#8217;existe pour l&#8217;instant que des recommandations, centralis&#233;es et en voie de 
standardisation &#224; l&#8217;ISO au sein du TC37/SC4, relay&#233; en France par l&#8217;initiative RNIL
</p>
<p>6
.  
</p>
<p>Le TC37/SC4 travaille d&#232;s &#224; pr&#233;sent &#224; la d&#233;finition d'un mod&#232;le g&#233;n&#233;rique d&#233;di&#233; &#224; 
</p>
<p>l'annotation morpho-syntaxique (future norme ISO 24611). Ce mod&#232;le, coordonn&#233; par Eric de 
</p>
<p>la Clergerie et Lionel Cl&#233;ment, combine d&#8217;une part deux niveaux de segmentation et de 
</p>
<p>cat&#233;gorisation linguistique et d&#8217;autre part un ensemble de cat&#233;gories de donn&#233;es linguistiques 
</p>
<p>permettant de qualifier les diff&#233;rents &#233;l&#233;ments du mod&#232;le. Une &#233;tude pr&#233;liminaire a en 
</p>
<p>particulier permis de regrouper une base de cat&#233;gories morpho-syntaxiques int&#233;grant la 
</p>
<p>plupart des jeux d&#8217;&#233;tiquettes connus pour le fran&#231;ais. 
</p>
<p>Le format  initial de l&#8217;annotation syntaxique est bas&#233; sur les cat&#233;gories et sch&#233;mas utilis&#233;s 
</p>
<p>dans le projet VISL
7
, un environnement multilingue pour l&#8217;analyse et l&#8217;apprentissage 
</p>
<p>                                                 
4
 Merci en particulier &#224; J.-Y. Antoine, A. Popescu-Belis, J. Caelen, D. Martini, A. Gryl, X. Briffault, F. Rastier, 
</p>
<p>P. Enjalbert ainsi qu&#8217;&#224; l&#8217;Est R&#233;publicain et au CNRS de nous avoir fourni certaines ressources. 
</p>
<p>5
 TEI : Text Encoding Initiative : http://www.tei-c.org/ 
</p>
<p>6
 http://pauillac.inria.fr/atoll/RNIL/home-fr.html 
</p>
<p>7
 http://beta.visl.sdu.dk </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Susanne Salmon-Alt, Eckhard Bick, Laurent Romary, Jean-Marie Pierrel 
</p>
<p>syntaxique. Le m&#233;ta-mod&#232;le et les cat&#233;gories de donn&#233;es pour les informations syntaxiques 
</p>
<p>sous-jacentes ont d&#233;j&#224; &#233;t&#233; mis &#224; l&#8217;&#233;preuve dans des corpus arbor&#233;s de diff&#233;rentes langues 
</p>
<p>(portugais, danois). Par ailleurs, ils sont enti&#232;rement compatibles avec le format TIGER, l&#8217;un 
</p>
<p>des formats convergents au niveau international pour l&#8217;encodage des formes et fonctions 
</p>
<p>syntaxiques (Brants et al. 2002). 
</p>
<p>Enfin, pour la cor&#233;f&#233;rence et les anaphores, la prolif&#233;ration des sch&#233;mas a donn&#233; lieu &#224; des 
</p>
<p>tentatives de synth&#232;se pour le codage cor&#233;f&#233;rentiel (Poesio 2000, Salmon-Alt 2001). L&#8217;id&#233;e- 
</p>
<p>cl&#233; de ces initiatives est de proposer non pas un nouveau sch&#233;ma, mais un m&#233;ta-sch&#233;ma qui 
</p>
<p>f&#233;d&#232;re les propri&#233;t&#233;s des sch&#233;mas pr&#233;c&#233;dents et qui puisse &#234;tre instanci&#233; selon les besoins 
</p>
<p>concrets du codeur. Les grandes lignes de ces propositions &#16; introduction d&#8217;&#233;l&#233;ments 
autonomes (markables) pour les expressions &#224; annoter ainsi que  les liens entre celles-ci et 
</p>
<p>liste ouverte pour la classification des liens &#16; ont &#233;t&#233; int&#233;gr&#233;es dans un travail visant la 
normalisation du codage de ce niveau linguistique (Salmon-Alt et Romary, 2004). La 
</p>
<p>FREEBANK sert actuellement de banc d&#8217;essai pour l&#8217;application des ces propositions &#224; large 
</p>
<p>&#233;chelle. 
</p>
<p>La gestion efficace des informations issues des diff&#233;rents niveaux d&#8217;annotation n&#233;cessite 
</p>
<p>l&#8217;adoption du principe de l&#8217;annotation stand-off, tel que d&#233;fini dans Thomson et McKelvie 
</p>
<p>(1997) : Ce principe permet un codage parall&#232;le d&#8217;un nombre arbitraire de niveaux 
</p>
<p>linguistiques, &#233;ventuellement non hi&#233;rarchiques. Cela implique de s&#233;parer le texte plein des 
</p>
<p>annotations, option qui n&#8217;a &#233;t&#233; r&#233;alis&#233;e dans aucun des corpus fran&#231;ais dont nous avons 
</p>
<p>connaissance. Un fichier de r&#233;f&#233;rence liste les unit&#233;s fondamentales du corpus (par exemple 
</p>
<p>&#171; mots &#187; pour l&#8217;&#233;crit ou bornes temporelles pour l&#8217;oral) et leur attribue un identifiant. Les 
</p>
<p>diff&#233;rentes annotations &#16; typographique, morphologique, syntaxique, cor&#233;f&#233;rentielle etc. &#16; 
sont r&#233;alis&#233;es s&#233;par&#233;ment et reli&#233;es aux unit&#233;s de r&#233;f&#233;rence par des pointeurs. Le principal 
</p>
<p>avantage de cette d&#233;marche est d&#8217;autoriser plusieurs annotations concurrentes d&#8217;un m&#234;me 
</p>
<p>fichier de base (indispensable pour &#233;valuer l&#8217;accord entre plusieurs annotations humaines 
</p>
<p>et/ou automatiques) et la possibilit&#233; de modifier, voire supprimer des informations sur un 
</p>
<p>niveau d&#8217;annotation particulier sans rendre inutilisable la ressource enti&#232;re. 
</p>
<p>2.3 Gestion &#233;volutive : les annotations &#224; plusieurs degr&#233;s de finesse 
</p>
<p>Notre objectif quantitatif, une base d&#8217;un million de mots environ, correspond en effet &#224; la 
</p>
<p>taille des grands corpus fran&#231;ais annot&#233;s et corrig&#233;s manuellement au-del&#224; de l&#8217;&#233;tiquetage 
</p>
<p>morphologique (corpus arbor&#233; de Paris 7 de Abeill&#233; et al. 2003 ; corpus anaphorique de Tutin 
</p>
<p>et al. 2000). Toutefois, le co&#251;t important des corrections manuelles, surtout si l&#8217;on envisage 
</p>
<p>une correction &#224; tous les niveaux d&#8217;annotation, rendrait le projet quasi irr&#233;alisable
8
. Notre 
</p>
<p>d&#233;marche consiste alors &#224; croiser les annotations multiniveaux (structurel, morphologique, 
</p>
<p>syntaxique, r&#233;f&#233;rentiel) avec une approche multistrate (Tableau 1). 
</p>
<p>Un noyau de 100.000 mots &#16; le Jardin &#224; la Fran&#231;aise &#16; est analys&#233;, annot&#233; et corrig&#233; 
manuellement par au moins deux annotateurs &#224; tous les niveaux linguistiques (avec calcul de 
</p>
<p>l&#8217;accord inter-annotateur). Pour une autre partie de la base &#16; le Jardin Botanique, &#224; taille 
</p>
<p>                                                 
8
 La correction manuelle de la sortie de l&#8217;analyseur syntaxique FrAG (Bick, 2003), comprenant la v&#233;rification de 
</p>
<p>l&#8217;&#233;tiquetage morpho-syntaxique, de l&#8217;analyse en constituants et d&#233;pendances grammaticales, a demand&#233;, pour 
</p>
<p>un extrait de 20.000 mots,  un hommes-mois. Soit 50 hommes-mois pour 1 million de mots, sans compter 
</p>
<p>l&#8217;annotation anaphorique manuelle pour laquelle il faudrait compter 40 hommes-mois pour la totalit&#233; du 
</p>
<p>corpus. En double annotation, cela reviendrait &#224; 180 hommes-mois. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La FREEBANK : Vers une base libre de corpus annot&#233;s 
</p>
<p>variable selon les niveaux linguistiques (entre 200.000 et 1.000.000 de mots) &#16; nous 
effectuons des annotations automatiques, suivies de corrections manuelles cibl&#233;es sur des 
</p>
<p>ph&#233;nom&#232;nes linguistiques particuliers. Cette approche, correspondant au paradigme de la 
</p>
<p>&#171; correction transverse &#187; propos&#233; par Wallis (2003), a pour double int&#233;r&#234;t de permettre des 
</p>
<p>&#233;tudes linguistiques fines sur des points pr&#233;cis (par exemple constructions participiales, 
</p>
<p>s&#233;lections restrictionnelles, reprises anaphoriques en autre) et d&#8217;assurer une meilleure qualit&#233; 
</p>
<p>des corrections manuelles. Enfin, le reste de la base constitue la For&#234;t Vierge qui, par rapport 
</p>
<p>&#224; des textes bruts, pr&#233;sentera toujours l&#8217;avantage de proposer des textes libres de droits 
</p>
<p>annot&#233;s selon l&#8217;&#233;tat de l&#8217;art des outils automatiques (codage TEI, &#233;tiquetage morpho-
</p>
<p>syntaxique en trois versions, analyse syntaxique en constituants et d&#233;pendances, r&#233;solution 
</p>
<p>d&#8217;anaphores simples). L&#8217;id&#233;e sous-jacente &#224; cette strat&#233;gie, comparable &#224; celle d&#233;ploy&#233;e par 
</p>
<p>Mangeot-Lerebours et al. (2003) pour la base lexicale Papillon, est de miser sur 
</p>
<p>l&#8217;enrichissement progressif des annotations par les utilisateurs eux-m&#234;mes, via une interface 
</p>
<p>de mise &#224; jour en ligne et apr&#232;s validation par un comit&#233; &#233;ditorial. 
</p>
<p>  
</p>
<p>Annotations valid&#233;es Jardin &#224; la Fran&#231;aise  Jardin Botanique  For&#234;t vierge 
</p>
<p>structure oui oui partiellement 
</p>
<p>morphologie oui partiellement non 
</p>
<p>syntaxe oui partiellement non 
</p>
<p>anaphores oui partiellement non 
</p>
<p>Tableau 1 : Annotations et corrections manuelles selon les strates et niveaux d&#8217;annotations 
</p>
<p>3 Etat actuel de la base 
</p>
<p>Actuellement, la totalit&#233; des corpus (hors dialogues) ont fait l&#8217;objet d&#8217;une analyse en 
</p>
<p>unit&#233;s de r&#233;f&#233;rence (fournissant les points de r&#233;f&#233;rence pour tous les niveaux d&#8217;annotation), 
</p>
<p>d&#8217;une analyse structurelle en unit&#233;s textuelles fondamentales (textes, titres, paragraphes, 
</p>
<p>phrases), d&#8217;une double voire triple annotation morpho-syntaxique, et pour certains, d&#8217;une 
</p>
<p>analyse syntaxique et d&#8217;une annotation des anaphores
9
. 
</p>
<p>3.1 D&#233;coupage en unit&#233;s de r&#233;f&#233;rence 
</p>
<p>L&#8217;objectif de cette &#233;tape &#233;tait de cr&#233;er les donn&#233;es de r&#233;f&#233;rence point&#233;es par tous les 
</p>
<p>niveaux sup&#233;rieurs d&#8217;analyse (cf. l&#8217;&#233;chantillon (a) de l&#8217;annexe). La base fournit &#224; ce niveau un 
</p>
<p>d&#233;coupage en unit&#233;s linguistiques minimales, issues d&#8217;une analyse comparative de la sortie de 
</p>
<p>deux &#233;tiqueteurs morphologiques (WinBrill et Cordial) et d&#8217;une phase de correction semi-
</p>
<p>manuelle. Les composants des lex&#232;mes compos&#233;s, des noms propres et des d&#233;terminants 
</p>
<p>contract&#233;s ont &#233;t&#233; s&#233;par&#233;s. Ce choix permet de rattacher de fa&#231;on optimale les informations 
</p>
<p>issues d&#8217;analyses ult&#233;rieures par une identification pr&#233;cise des unit&#233;s linguistiques en 
</p>
<p>question : une analyse morphologique qui d&#233;compose les d&#233;terminants (au en &#224; + le) trouvera 
</p>
<p>les deux points de r&#233;f&#233;rence n&#233;cessaires, alors qu&#8217;il n&#8217;y aura pas de perte d&#8217;informations dans 
</p>
<p>le cas contraire. De m&#234;me, au niveau syntaxique,  ce choix permettra de distinguer avec 
</p>
<p>pr&#233;cision le d&#233;but d&#8217;un groupe pr&#233;positionnel de celui du groupe nominal imbriqu&#233; [&#224; [le 
</p>
<p>ch&#226;teau]]. Ces deux faits se r&#233;v&#232;leront importants pour l&#8217;annotation de la cor&#233;f&#233;rence. 
</p>
<p>                                                 
9
 Les corpus trait&#233;s sont mis en ligne au fur et &#224; mesure du projet sur http://www.inalf.fr/atilf/ananas/. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Susanne Salmon-Alt, Eckhard Bick, Laurent Romary, Jean-Marie Pierrel 
</p>
<p>3.2 Annotation structurelle 
</p>
<p>Nous souhaitions ne perdre aucune des informations du corpus de d&#233;part, qu&#8217;il s&#8217;agisse 
</p>
<p>des informations linguistiques d&#233;j&#224; cod&#233;es (par exemple les noms propres du corpus Goriot), 
</p>
<p>des informations inh&#233;rentes &#224; la structuration du texte en phrases, paragraphes, sections et 
</p>
<p>titres ou des m&#233;ta-donn&#233;es, pr&#233;sentes dans les en-t&#234;tes. Apr&#232;s un inventaire de tous les 
</p>
<p>&#233;l&#233;ments pr&#233;-cod&#233;s dans les corpus de la base, nous avons d&#233;fini un sch&#233;ma d&#8217;annotation 
</p>
<p>instanciant les recommandations de la TEI (Sperberg-McQueen et  Burnard 2002). 
</p>
<p>Pour les ressources sans codage initial, nous avons g&#233;n&#233;r&#233; automatiquement des 
</p>
<p>annotations pour les principales unit&#233;s structurelles r&#233;cup&#233;rables : sections, paragraphes, 
</p>
<p>titres, phrases (cf. l&#8217;&#233;chantillon (b) de l&#8217;annexe). La r&#233;tro-conversion des corpus 
</p>
<p>structurellement pr&#233;-annot&#233;s  (paragraphes, tours de parole, titres, sections, discours directs, 
</p>
<p>noms propres) demande en plus une re-synchronisation des pointeurs avec les unit&#233;s 
</p>
<p>minimales du fichier de r&#233;f&#233;rence. D&#8217;autres informations, notamment les m&#233;ta-donn&#233;es de 
</p>
<p>l&#8217;en-t&#234;te de la TEI, doivent &#234;tre report&#233;es manuellement.  
</p>
<p>3.3 Annotation morphologique 
</p>
<p>Tous les corpus ont fait l&#8217;objet d&#8217;une double annotation morphologique par WinBrill et 
</p>
<p>Cordial. Une troisi&#232;me, bas&#233;e sur le DecisionTreeTagger (Schmid 1994), est de fait r&#233;alis&#233;e 
</p>
<p>au cours de l&#8217;analyse syntaxique. Les sorties de ces analyses (cat&#233;gorisation, informations 
</p>
<p>flexionnelles et lemmatisation) ont &#233;t&#233; transf&#233;r&#233;es vers une repr&#233;sentation XML (cf. 
</p>
<p>l&#8217;&#233;chantillon (c) de l&#8217;annexe
10
</p>
<p>). Pour l&#8217;instant, il n&#8217;existe pas encore de norme de codage 
</p>
<p>morpho-syntaxique, mais le format choisi devrait &#234;tre facilement convertible. Comme pour le 
</p>
<p>niveau structurel, le lien avec le fichier de r&#233;f&#233;rence contenant les unit&#233;s minimales se fait par 
</p>
<p>l&#8217;attribut span qui pointe sur l&#8217;identifiant de l&#8217;&#233;l&#233;ment &lt;word&gt; du fichier de r&#233;f&#233;rence. Cet 
</p>
<p>attribut peut renvoyer sur des &lt;word&gt; uniques ou sur une suite d&#8217;&#233;l&#233;ments, lorsque plusieurs 
</p>
<p>unit&#233;s minimales ne forment qu&#8217;une seule entit&#233; morphologique, ce qui est le cas des 
</p>
<p>d&#233;terminants contract&#233;s ou des mots compos&#233;s. 
</p>
<p>3.4 Annotation syntaxique  
</p>
<p>L&#8217;annotation syntaxique a pour objectif d&#8217;identifier des constituants syntaxiques des 
</p>
<p>phrases ainsi que leurs fonctions. Elle s&#8217;effectue par l&#8217;analyseur FrAG, d&#233;velopp&#233; par E. Bick 
</p>
<p>(University of Southern Denmark) et accessible librement en ligne
11
</p>
<p>. Il s&#8217;agit d&#8217;un syst&#232;me 
</p>
<p>multiniveau hybride (Bick 2003), combinant approche probabiliste, grammaire &#224; base de 
</p>
<p>contraintes (CG) et grammaire de structures phrastiques (PSG).  
</p>
<p>L&#8217;entr&#233;e, le texte brut, est d&#8217;abord &#233;tiquet&#233;e par le DecisionTreeTagger (Schmid, 1994), 
</p>
<p>puis corrig&#233;e et d&#233;sambigu&#239;s&#233;e &#224; l&#8217;aide d&#8217;un lexique morphologique et de r&#232;gles locales 
</p>
<p>contextuelles. La sortie de cette &#233;tape fournit la troisi&#232;me version d&#8217;annotation 
</p>
<p>morphologique et sert en m&#234;me temps d&#8217;entr&#233;e &#224; l&#8217;analyse syntaxique. Celle-ci est effectu&#233;e 
</p>
<p>d&#8217;abord par un syst&#232;me hi&#233;rarchique de CG, ajoutant et d&#233;sambigu&#239;sant des &#233;tiquettes pour les 
</p>
<p>formes et fonctions syntaxiques. Ensuite intervient une grammaire de structures phrastiques 
</p>
<p>                                                 
10
</p>
<p> Les donn&#233;es de l&#8217;&#233;chantillon sont issues d&#8217;analyses automatiques et contiennent, par cons&#233;quence, certaines 
</p>
<p>erreurs (cf. le lemme de chlorofluorocarbones). 
</p>
<p>11
 http://sandbox.visl.sdu.dk/visl/fr/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La FREEBANK : Vers une base libre de corpus annot&#233;s 
</p>
<p>(PSG) bas&#233;e non pas sur des terminaux traditionnels (mots), mais sur les fonctions 
</p>
<p>syntaxiques CG. L&#8217;avantage d&#8217;un tel syst&#232;me hybride est de combiner la robustesse CG avec 
</p>
<p>la profondeur PSG. Afin de r&#233;duire les ambigu&#239;t&#233;s li&#233;es aux structures coordonn&#233;es et au 
</p>
<p>rattachement des groupes nominaux, une CG sp&#233;cialis&#233;e pour les attachements est utilis&#233;e &#224; 
</p>
<p>un niveau interm&#233;diaire. La derni&#232;re &#233;tape, la s&#233;lection automatique d&#8217;arbres, est optionnelle 
</p>
<p>et peut &#234;tre replac&#233;e par un choix semi-manuel. Le r&#233;sultat, un fichier texte repr&#233;sentant des 
</p>
<p>arbres syntaxiques, est converti en TIGER-XML (cf. l&#8217;&#233;chantillon (d) de l&#8217;annexe). Il s&#8217;agit 
</p>
<p>d&#8217;un format de repr&#233;sentation de donn&#233;es syntaxiques hybrides (constituants et d&#233;pendances), 
</p>
<p>largement utilis&#233; dans le contexte europ&#233;en (cf. la NEGRA-Treebank pour l&#8217;allemand
12
</p>
<p>, 
</p>
<p>Brants et al. 2002) et pour lequel des outils d&#8217;exploitation (visualisation, requ&#234;tes, extraction 
</p>
<p>et export) sont librement disponibles
13
</p>
<p>. 
</p>
<p>L&#8217;annotation syntaxique est actuellement en cours. Pour l&#8217;instant, elle a &#233;t&#233; r&#233;alis&#233;e pour 
</p>
<p>206.000 mots de textes litt&#233;raires, techniques et journalistiques
14
</p>
<p>. Un dixi&#232;me des donn&#233;es 
</p>
<p>(20.000 mots) a fait l&#8217;objet d&#8217;une correction et d&#8217;une validation manuelle (cf. note 8).  
</p>
<p>3.5 Extraction des groupes nominaux et annotation des anaphores 
</p>
<p>Le dernier niveau d&#8217;annotation concerne la cor&#233;f&#233;rence et les anaphores. Cette &#233;tape 
</p>
<p>demande d&#8217;abord un marquage des expressions potentiellement pertinentes, &#224; savoir des 
</p>
<p>expressions (pro-)nominales. L&#8217;ensemble de ces constituants est soit s&#233;lectionn&#233; 
</p>
<p>manuellement, soit extrait automatiquement, puis filtr&#233; semi-automatiquement en fonction des 
</p>
<p>objectifs d&#8217;annotation (cf. l&#8217;&#233;chantillon (e) de l&#8217;annexe). Pour l&#8217;instant, nous excluons certains 
</p>
<p>pronoms (je, tu) et certaines expressions nominales (ce matin), mais il s&#8217;agit d&#8217;un choix 
</p>
<p>th&#233;orique qui n&#8217;est pas dict&#233; par les potentialit&#233;s de la base. Ces expressions sont alors 
</p>
<p>soumises &#224; des annotateurs humains qui, &#224; l&#8217;aide d&#8217;un logiciel libre &#224; interface graphique
15
</p>
<p> et 
</p>
<p>d&#8217;un guide d&#8217;annotation
16
</p>
<p>, choisissent, le cas &#233;ch&#233;ant, les ant&#233;c&#233;dents (Salmon-Alt et Vieira 
</p>
<p>2002). Le sortie XML du logiciel d&#8217;annotation est transf&#233;r&#233;e vers le m&#233;ta-format pour 
</p>
<p>l&#8217;annotation r&#233;f&#233;rentielle (cf. l&#8217;&#233;chantillon (e) et (f) de l&#8217;annexe). A partir de ce format pivot, 
</p>
<p>l&#8217;accord inter-annotateur est &#233;valu&#233; &#224; l&#8217;aide de diff&#233;rentes mesures d&#8217;&#233;valuation, 
</p>
<p>impl&#233;ment&#233;es et accessibles librement en ligne (Popescu-Belis et al. 2004)
17
</p>
<p>. 
</p>
<p>4 Distribution et maintenance des ressources 
</p>
<p>Notre objectif est de mettre la FREEBANK avec toutes les annotations librement &#224; la 
</p>
<p>disposition de la communaut&#233; et de la maintenir en int&#233;grant r&#233;guli&#232;rement des ajouts venant 
</p>
<p>des utilisateurs. Les ressources en ligne comporteront  
</p>
<p>x&#3; une archive XML t&#233;l&#233;chargeable directement &#224; partir du site ;  
                                                 
12
</p>
<p> http://www.coli.uni-sb.de/sfb378/negra-corpus/ 
</p>
<p>13
 TigerSearch :  http://-ww.ims.uni-stuttgart.de/projekte/TIGER/related/links.shtml 
</p>
<p>14
 http://corp.hum.sdu.dk/arboratoire.html  
</p>
<p>15
 MMAX : http://www.eml.villa-bosch.de 
</p>
<p>16
 http://www.atilf.fr/ananas/, onglet Guides d&#8217;annotation 
</p>
<p>17
 http://www.atilf.fr/ananas/, onglet Evaluation on-line </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Susanne Salmon-Alt, Eckhard Bick, Laurent Romary, Jean-Marie Pierrel 
</p>
<p>x&#3; une documentation pr&#233;cise des choix et formats adopt&#233;s, comprenant en particulier 
l&#8217;ensemble des cat&#233;gories de donn&#233;es utilis&#233;es ;  
</p>
<p>x&#3; des outils en ligne pour restituer les corpus sous format plein texte, en diff&#233;rentes 
versions HTML et en diff&#233;rentes versions XML (qui pourront se diff&#233;rencier &#224; leur 
</p>
<p>tour par les niveaux d&#8217;annotation retenus, par le principe d&#8217;annotation (stand-off 
</p>
<p>ou non) et par le sch&#233;ma de codage souhait&#233;) ;  
</p>
<p>x&#3; des outils pour &#233;valuer la qualit&#233; des ressources en termes d&#8217;accord inter-
annotateur et du  prototype d&#233;j&#224; impl&#233;ment&#233; en ligne ;  
</p>
<p>x&#3; une version de ces outils sous la forme d&#8217;un service web (WSDL + SOAP) ;  
x&#3; des m&#233;ta-donn&#233;es permettant de r&#233;pertorier les ressources sur les serveurs 
</p>
<p>appropri&#233;s (par exemple OLAC) ;  
</p>
<p>x&#3; un m&#233;canisme de mise &#224; jour permettant &#224; des tiers (&#171; contributeurs &#187;) de 
soumettre des patchs (remplacement, modification, ajout) &#224; la ressource. Chaque 
</p>
<p>contributeur et chaque source documentaire sera identifi&#233; dans l&#8217;en-t&#234;te de la 
</p>
<p>ressource, ainsi que sur le site d&#8217;acc&#232;s lui-m&#234;me et on gardera des statistiques 
</p>
<p>d&#8217;acc&#232;s et de t&#233;l&#233;chargement. 
</p>
<p>Remerciements 
</p>
<p>Nous tenons &#224; remercier toutes les personnes ayant contribu&#233; &#224; l&#8217;alimentation de la base 
</p>
<p>ainsi que celles qui ont collabor&#233; avec nous sur ce projet, en particulier Andrei Popescu-Belis, 
</p>
<p>Ga&#235;lle Durand, Lo&#239;s Rigouste, Ane Dybro Johanson, sans oublier les annotateurs : M&#233;lodie 
</p>
<p>Soufflard, Jean-Luc Benoit, Fabienne Mougin, Josette Lecomte et Emmanuel Schang. Merci 
</p>
<p>&#233;galement &#224; Christiane Jadelot et aux relecteurs. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>ABEILLE A., CLEMENT L., TOUSSENEL F. (2003). Building a Treebank for French. In : 
</p>
<p>Treebanks, Building and Using Parsed Corpora. A. Abeill&#233; (ed.), Kluwer Academic 
</p>
<p>Publishers, Dordrecht, Boston, London. 
</p>
<p>BICK E. (2003). A CG &amp; PSG Hybrid Approach to Automatic Corpus Annotation. Actes de 
</p>
<p>SproLaC 2003. Lancaster. 
</p>
<p>BRANTS S., HANSEN S. (2002). Developments in the TIGER Annotation Scheme and their 
</p>
<p>Realization in the Corpus. Actes de LREC 2002. Las Palmas. 
</p>
<p>IDE N., ROMARY L. (2003). Encoding Syntactic Annotation. In : Treebanks, Building and 
</p>
<p>Using Parsed Corpora. A. Abeill&#233; (ed.), Kluwer Academic Publishers, Dordrecht, Boston, 
</p>
<p>London. 
</p>
<p>MANGEOT-LEREBOURS M., SERASSET G., LAFOURCADE M. (2003). Construction collaborative 
</p>
<p>de base donn&#233;es lexicales multilingues : le projet Papillon. T.A.L., Vol 44:2, pp. 151-176. 
</p>
<p>POESIO, M. (2000). Coreference. MATE Dialogue Annotation Guidelines, Deliverable D2.1, 
</p>
<p>126-182. (www.ims.uni-stuttgart.de/projekte/mate/mdag/) 
</p>
<p>POPESCU-BELIS A. (1999). Mod&#233;lisation multi-agent des &#233;changes langagiers : application au 
</p>
<p>probl&#232;me de la r&#233;f&#233;rence et son &#233;valuation. Th&#232;se d'universit&#233;, Universit&#233; de Paris XI. 
</p>
<p>POPESCU-BELIS A. (2000). &#201;valuation num&#233;rique de la r&#233;solution de la r&#233;f&#233;rence : critiques et 
</p>
<p>propositions. T.A.L., Vol. 40:2, pp.117-146. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La FREEBANK : Vers une base libre de corpus annot&#233;s 
</p>
<p>SALMON-ALT S. (2001). Entre corpus et th&#233;orie : l&#8217;annotation (co)r&#233;f&#233;rentielle. T.A.L., ., Vol. 
</p>
<p>42:2, pp. 459-486. 
</p>
<p>SALMON-ALT S. (2002). Le projet ANANAS :  Annotation Anaphorique pour l&#8217;Analyse 
</p>
<p>S&#233;mantique de Corpus. Workshop sur les Cha&#238;nes de r&#233;f&#233;rence et r&#233;solveurs d&#8217;anaphores, 
</p>
<p>TALN 2002. Nancy. 
</p>
<p>SALMON-ALT S., ROMARY L. (2004). RAF : Towards a Reference Annotation Framework. 
</p>
<p>Actes de LREC 2004. Lisboa. 
</p>
<p>SCHMID, H. (1994). Probabilistic Part-of-Speech Tagging Using Decision Trees. Actes de 
</p>
<p>International Conference on New Methods in Language Processing 1994. Manchester. 
</p>
<p>SPERBERG-MCQUEEN, C.M., BURNARD, L. (2002). TEI P4: Guidelines for Electronic Text 
</p>
<p>Encoding and Interchange. Text Encoding Initiative Consortium. Oxford, Providence, 
</p>
<p>Charlottesville, Bergen. 
</p>
<p>THOMPSON H., MCKELVIE D. (1997). Hyperlink semantics for standoff markup of read-only 
</p>
<p>documents. Actes de SGML Europe '97. Barcelona. 
</p>
<p>TUTIN A., TROUILLEUX F., CLOUZOT C., GAUSSIER E., ZAENEN A., RAYOT S., ANTONIADIS G. 
</p>
<p>(2000). Annotating a large corpus with anaphoric links. Actes de DAARC 2000. Lancaster. 
</p>
<p>VILNAT A., PAROUBEK P., MONCEAUX L., ROBBA I., GENDNER V., ILLOUZ G., JARDINO M. 
</p>
<p>(2003). EASY or How Difficult Can It Be to Define a Reference Treebank for French. Actes 
</p>
<p>du 2
nd
</p>
<p> Workshop on Treebanks and Linguistic Theories. V&#228;xj&#246;. 
</p>
<p>WALLIS S. (2003). Completing Parsed Corpora, from Correction to Evolution. In : Treebanks, 
</p>
<p>Building and Using Parsed Corpora. A. Abeill&#233; (ed.), Kluwer Academic Publishers, 
</p>
<p>Dordrecht, Boston, London. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Susanne Salmon-Alt, Eckhard Bick, Laurent Romary, Jean-Marie Pierrel 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>(b)
</p>
<p>&lt;text&gt;&lt;body&gt; &#8230; 
</p>
<p>&lt;p id=&quot;paragraph_7&quot; span=&quot;word_803..word_892&quot;&gt; 
</p>
<p>&lt;s id=&quot;sentence_27&quot; span=&quot;word_809..word_836&quot;/&gt; 
</p>
<p>&lt;s id=&quot;sentence_28&quot; span=&quot;word_837..word_860&quot;/&gt; 
</p>
<p>&lt;s id=&quot;sentence_29&quot; span=&quot;word_861..word_873&quot;/&gt; 
</p>
<p>&lt;s id=&quot;sentence_30&quot; span=&quot;word_874..word_892&quot;/&gt; 
</p>
<p>&lt;/p&gt; &lt;/body&gt; &lt;/text&gt;
</p>
<p>(c)
</p>
<p>&lt;link_set&gt; 
</p>
<p>&#8230; 
</p>
<p>  &lt;reference_link id=&quot;rl_N400078&quot; source=&quot;rm_28_0_N401D7A&quot; target=&quot;&#8230;&quot;/&gt; 
</p>
<p>  &lt;reference_link id=&quot;rl_N400085&quot; source=&quot; rm_N401D36&quot; target=&quot;rm_28_9_N401D70&quot;/&gt; 
</p>
<p>  &lt;reference_link id=&quot;rl_N4000E0&quot; source=&quot; rm_28_6_N401D3E &quot;/&gt; 
</p>
<p>  &lt;reference_link id=&quot;rl_N4000ED&quot; source=&quot; rm_28_4_N401D16&quot;/&gt; 
</p>
<p>&#8230; 
</p>
<p>&lt;/link set&gt; (f)
</p>
<p>(e)
</p>
<p>&lt;reference_markables&gt; 
</p>
<p>&#8230; 
</p>
<p> &lt;reference_markable id=&quot;rm_28_0_N401D7A&quot; 
</p>
<p>syntactic_categorie=&quot;nominal_constituent&quot; syntactic_function=&quot;S&quot; 
</p>
<p>sentence_number=&quot;s_28&quot; span=&quot;word_837..word_839&quot; 
</p>
<p>head_surface_string=&quot;gaz&quot; head_type=&quot;common_noun&quot; 
</p>
<p>determiner=&quot;definite&quot; text_number=&quot;t_1_5&quot;/&gt; 
</p>
<p> &lt;reference_markable id=&quot;rm_28_9_N401D70&quot; 
</p>
<p>syntactic_categorie=&quot;nominal_constituent&quot; syntactic_function=&quot;DP&quot; 
</p>
<p>sentence_number=&quot;s_28&quot; span=&quot;word_847..word_859&quot; 
</p>
<p>head_surface_string=&quot;chlorofluorocarbones&quot; 
</p>
<p>head_type=&quot;common_noun&quot; determiner=&quot;indefinite&quot; number=&quot;&quot; 
</p>
<p>gender=&quot;&quot; text_number=&quot;t_1_5&quot;/&gt; 
</p>
<p> &lt;reference_markable id=&quot;rm_N401D4C&quot; 
</p>
<p>syntactic_categorie=&quot;nominal_constituent&quot; syntactic_function=&quot;S&quot; 
</p>
<p>sentence_number=&quot;s_28&quot; span=&quot;word_849&quot; surface_string=&quot;on&quot; 
</p>
<p>head_surface_string=&quot;on&quot; head_type=&quot;personal_pronoun&quot; 
</p>
<p>number=&quot;S&quot; gender=&quot;&quot; text_number=&quot;t_1_5&quot;/&gt; 
</p>
<p> &lt;reference_markable id=&quot;rm_N401D36&quot; 
</p>
<p>syntactic_categorie=&quot;nominal_constituent&quot; syntactic_function=&quot;S&quot; 
</p>
<p>sentence_number=&quot;s_28&quot; span=&quot;word_852&quot; surface_string=&quot;ils&quot; 
</p>
<p>head_surface_string=&quot;ils&quot; head_type=&quot;personal_pronoun&quot; 
</p>
<p>number=&quot;P&quot; gender=&quot;M&quot; text_number=&quot;t_1_5&quot;/&gt; 
</p>
<p> &lt;reference_markable id=&quot;rm_28_6_N401D3E&quot; 
</p>
<p>syntactic_categorie=&quot;nominal_constituent&quot; syntactic_function=&quot;Od&quot; 
</p>
<p>sentence_number=&quot;s_28&quot; span=&quot;word_854..word_859&quot; 
</p>
<p>head_surface_string=&quot;ozone&quot; head_type=&quot;common_noun&quot; 
</p>
<p>determiner=&quot;definite&quot; number=&quot;S&quot; gender=&quot;M&quot; 
</p>
<p>text_number=&quot;t_1_5&quot;/&gt; 
</p>
<p> &lt;reference_markable id=&quot;rm_28_4_N401D16&quot; 
</p>
<p>syntactic_categorie=&quot;nominal_constituent&quot; syntactic_function=&quot;DP&quot; 
</p>
<p>sentence_number=&quot;s_28&quot; span=&quot;word_857..word_859&quot; 
</p>
<p>head_surface_string=&quot;atmosph&#232;re&quot; head_type=&quot;common_noun&quot; 
</p>
<p>determiner=&quot;definite&quot; number=&quot;S&quot; gender=&quot;F&quot; 
</p>
<p>text_number=&quot;t_1_5&quot;/&gt; 
</p>
<p>&#8230; 
</p>
<p>&lt;/reference_markables&gt; 
</p>
<p>&lt;corpus&gt; 
</p>
<p>&#8230; 
</p>
<p>&lt;s id=&quot;28&quot; 
</p>
<p>running_text=&quot;Le gaz propulseur est, en effet, fait de chlorofluorocarbones dont on pense qu'ils 
</p>
<p>d&#233;truisent l'ozone de la haute atmosph&#232;re. &quot; 
</p>
<p> nb_analysis=&quot;1&quot; nb_possible_analyses=&quot;2&quot;&gt; 
</p>
<p>   &lt;root label=&quot;STA&quot; idref=&quot;nt_28_11&quot; /&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_0&quot; cat=&quot;np&quot; discontinuation=&quot;no&quot;&gt; 
</p>
<p>    &lt;edge label=&quot;DN&quot; href=&quot;tt.xml#xptr(id(msd_748))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;H&quot; href=&quot;tt.xml#xptr(id(msd_749))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;DN&quot; href=&quot;tt.xml#xptr(id(msd_750))&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_1&quot; cat=&quot;vp&quot; discontinuation=&quot;yes&quot; idref=&quot;nt_28_3&quot; &gt; 
</p>
<p>    &lt;edge label=&quot;Vaux&quot; href=&quot;tt.xml#xptr(id(&#171;msd_751&#187;))&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_2&quot; cat=&quot;pp&quot; discontinuation=&quot;no&quot; &gt; 
</p>
<p>    &lt;edge label=&quot;H&quot; href=&quot;tt.xml#xptr(id(&#8216;msd_752))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;DP&quot; href=&quot;tt.xml#xptr(id(msd_753))&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_3&quot; cat=&quot;vp&quot; discontinuation=&quot;no&quot; &gt; 
</p>
<p>    &lt;edge label=&quot;Mv&quot; href=&quot;tt.xml#xptr(id(msd_754))&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_4&quot; cat=&quot;np&quot; discontinuation=&quot;no&quot;&gt; 
</p>
<p>    &lt;edge label=&quot;DN&quot; href=&quot;tt.xml#xptr(id(msd_766))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;DN&quot; href=&quot;tt.xml#xptr(id(msd_767))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;H&quot; href=&quot;tt.xml#xptr(id(msd_768))&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_5&quot; cat=&quot;pp&quot; discontinuation=&quot;no&quot;&gt; 
</p>
<p>    &lt;edge label=&quot;H&quot; href=&quot;tt.xml#xptr(id(msd_765))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;DP&quot; idref=&quot;nt_28_4&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_6&quot; cat=&quot;np&quot; discontinuation=&quot;no&quot;&gt; 
</p>
<p>    &lt;edge label=&quot;DN&quot; href=&quot;tt.xml#xptr(id(msd_763))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;H&quot; href=&quot;tt.xml#xptr(id(msd_764))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;DN&quot; idref=&quot;nt_28_5&quot;  /&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_7&quot; cat=&quot;fcl&quot; discontinuation=&quot;no&quot;&gt; 
</p>
<p>    &lt;edge label=&quot;SUB&quot; href=&quot;tt.xml#xptr(id(msd_760))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;S&quot; href=&quot;tt.xml#xptr(id(msd_761))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;P&quot; href=&quot;tt.xml#xptr(id(msd_762))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;Od&quot; idref=&quot;nt_28_6&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_8&quot; cat=&quot;fcl&quot; discontinuation=&quot;no&quot;&gt; 
</p>
<p>    &lt;edge label=&quot;Op&quot; href=&quot;tt.xml#xptr(id(msd_757))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;S&quot; href=&quot;tt.xml#xptr(id(msd_758))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;P&quot; href=&quot;tt.xml#xptr(id(msd_759))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;Od&quot; idref=&quot;nt_28_7&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_9&quot; cat=&quot;np&quot; discontinuation=&quot;no&quot;&gt; 
</p>
<p>    &lt;edge label=&quot;H&quot; href=&quot;tt.xml#xptr(id(msd_756))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;DNc&quot; idref=&quot;nt_28_8&quot;/&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_10&quot; cat=&quot;pp&quot; discontinuation=&quot;no&quot; &gt; 
</p>
<p>    &lt;edge label=&quot;H&quot; href=&quot;tt.xml#xptr(id(msd_755))&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;DP&quot; idref=&quot;nt_28_9&quot; /&gt; &lt;/nt&gt; 
</p>
<p>   &lt;nt id=&quot;nt_28_11&quot; cat=&quot;fcl&quot; discontinuation=&quot;no&quot;&gt; 
</p>
<p>    &lt;edge label=&quot;S&quot; idref=&quot;nt_28_0&quot; /&gt; 
</p>
<p>    &lt;edge label=&quot;P&quot; idref=&quot;nt_28_1&quot;/&gt; 
</p>
<p>    &lt;edge label=&quot;fA&quot; idref=&quot;nt_28_2&quot; /&gt; 
</p>
<p>    &lt;edge label=&quot;P&quot; idref=&quot;nt_28_3&quot; /&gt; 
</p>
<p>    &lt;edge label=&quot;Op&quot; idref=&quot;nt_28_10&quot; /&gt; &lt;/nt&gt; 
</p>
<p>  &lt;/s&gt; (d)
</p>
<p>&lt;words&gt; 
</p>
<p>&#8230; 
</p>
<p>&lt;word id=&quot;word_837&quot;&gt;Le&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_838&quot;&gt;gaz&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_839&quot;&gt;propulseur&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_840&quot;&gt;est&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_841&quot;&gt;,&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_842&quot;&gt;en&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_843&quot;&gt;effet&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_844&quot;&gt;,&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_845&quot;&gt;fait&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_846&quot;&gt;de&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_847&quot;&gt;chlorofluorocarbones&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_848&quot;&gt;dont&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_849&quot;&gt;on&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_850&quot;&gt;pense&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_851&quot;&gt;qu'&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_852&quot;&gt;ils&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_853&quot;&gt;d&#233;truisent&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_854&quot;&gt;l'&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_855&quot;&gt;ozone&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_856&quot;&gt;de&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_857&quot;&gt;la&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_858&quot;&gt;haute&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_859&quot;&gt;atmosph&#232;re&lt;/word&gt; 
</p>
<p>&lt;word id=&quot;word_860&quot;&gt;.&lt;/word&gt; 
</p>
<p> 
</p>
<p>&#8230; 
</p>
<p>(a)
</p>
<p>&lt;w&gt; 
</p>
<p>&#8230; 
</p>
<p>&lt;w id=&quot;msd_748&quot; span=&quot;word_837&quot; lemma=&quot;le&quot; msd=&quot;art&quot;  gender=&quot;M&quot; number=&quot;S&quot; definiteness=&quot;def&quot;&gt;Le&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_749&quot; span=&quot;word_838&quot; lemma=&quot;gaz&quot; msd=&quot;n&quot;&gt;gaz&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_750&quot; span=&quot;word_839&quot; lemma=&quot;propulseur&quot; msd=&quot;n&quot; number=&quot;S&quot; gender=&quot;M&quot;&gt;propulseur&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_751&quot; span=&quot;word_840&quot; lemma=&quot;&#234;tre&quot; msd=&quot;v-fin&quot; number=&quot;S&quot; person=&quot;3&quot; tense=&quot;PR&quot; mode=&quot;IND&quot;&gt;est&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_752&quot; span=&quot;word_842&quot; lemma=&quot;en&quot; msd=&quot;prp&quot;&gt;en&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_753&quot; span=&quot;word_843&quot; lemma=&quot;effet&quot; msd=&quot;n&quot; number=&quot;S&quot; gender=&quot;M&quot;&gt;effet&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_754&quot; span=&quot;word_845&quot; lemma=&quot;faire&quot; msd=&quot;v-pcp2&quot; gender=&quot;M&quot; number=&quot;S&quot; aspect=&quot;PAS&quot;&gt;fait&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_755&quot; span=&quot;word_846&quot; lemma=&quot;de&quot; msd=&quot;prp&quot;&gt;de&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_756&quot; span=&quot;word_847&quot; lemma=&quot;chlorofluorocarbones&quot; msd=&quot;n&quot;&gt;chlorofluorocarbones&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_757&quot; span=&quot;word_848&quot; lemma=&quot;dont&quot; msd=&quot;pron-rel&quot; dependence=&quot;INDP&quot;&gt;dont&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_758&quot; span=&quot;word_849&quot; lemma=&quot;on&quot; msd=&quot;pron-pers&quot; number=&quot;S&quot; case=&quot;NOM&quot; person=&quot;3&quot;&gt;on&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_759&quot; span=&quot;word_850&quot; lemma=&quot;penser&quot; msd=&quot;v-fin&quot; number=&quot;S&quot; person=&quot;1/3&quot; tense=&quot;PR&quot; mode=&quot;IND&quot;&gt;pense&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_760&quot; span=&quot;word_851&quot; lemma=&quot;que&quot; msd=&quot;conj-s&quot;&gt;qu&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_761&quot; span=&quot;word_852&quot; lemma=&quot;il&quot; msd=&quot;pron-pers&quot; number=&quot;P&quot; case=&quot;NOM&quot; person=&quot;3&quot;&gt;ils&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_762&quot; span=&quot;word_853&quot; lemma=&quot;d&#233;truire&quot; msd=&quot;v-fin&quot; number=&quot;P&quot; person=&quot;3&quot; tense=&quot;PR&quot; mode=&quot;IND&quot;&gt;d&#233;truisent&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_763&quot; span=&quot;word_854&quot; lemma=&quot;le&quot; msd=&quot;art&quot; gender=&quot;M&quot; number=&quot;S&quot; definiteness=&quot;def&quot;&gt;l&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_764&quot; span=&quot;word_855&quot; lemma=&quot;ozone&quot; msd=&quot;n&quot; number=&quot;S&quot; gender=&quot;M&quot;&gt;ozone&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_765&quot; span=&quot;word_856&quot; lemma=&quot;de&quot; msd=&quot;prp&quot;&gt;de&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_766&quot; span=&quot;word_857&quot; lemma=&quot;le&quot; msd=&quot;art&quot; gender=&quot;F&quot; number=&quot;S&quot; definiteness=&quot;def&quot;&gt;la&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_767&quot; span=&quot;word_858&quot; lemma=&quot;haut&quot; msd=&quot;adj&quot; number=&quot;S&quot; gender=&quot;F&quot;&gt;haute&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_768&quot; span=&quot;word_859&quot; lemma=&quot;atmosph&#232;re&quot; msd=&quot;n&quot; number=&quot;S&quot; gender=&quot;F&quot;&gt;atmosph&#232;re&lt;/w&gt; 
</p>
<p>&lt;w id=&quot;msd_769&quot; span=&quot;word_860&quot; msd=&quot; &quot; lemma=&quot;.&quot;&gt;.&lt;/w&gt; 
</p>
<p>&#8230; 
</p>
<p>&lt;/w&gt;</p>

</div></div>
</body></html>