<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Les Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (RCG) comme formalisme grammatical pour la linguistique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Les Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (RCG)
comme formalisme grammatical pour la linguistique
</p>
<p>Beno&#238;t Sagot (1,2) et Pierre Boullier (1)
(1) Projet ATOLL - INRIA
</p>
<p>Domaine de Voluceau, B.P. 105, 78153 Le Chesnay Cedex, France
{benoit.sagot;pierre.boullier}@inria.fr
</p>
<p>(2) TALaNa/Lattice - Universit&#233; Paris 7
2 place Jussieu, 75251 Paris Cedex 05, France
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Le but de cet article est de montrer pourquoi les Grammaires &#224; Concat&#233;nation d&#8217;Intervalles
(Range Concatenation Grammars, ou RCG) sont un formalisme particuli&#232;rement bien adapt&#233; &#224;
la description du langage naturel. Nous expliquons d&#8217;abord que la puissance n&#233;cessaire pour d&#233;-
crire le langage naturel est celle de PTIME. Ensuite, parmi les formalismes grammaticaux ayant
cette puissance d&#8217;expression, nous justifions le choix des RCG. Enfin, apr&#232;s un aper&#231;u de leur
d&#233;finition et de leurs propri&#233;t&#233;s, nous montrons comment leur utilisation comme grammaires
linguistiques permet de traiter des ph&#233;nom&#232;nes syntagmatiques complexes, de r&#233;aliser simul-
tan&#233;ment l&#8217;analyse syntaxique et la v&#233;rification des diverses contraintes (morphosyntaxiques,
s&#233;mantique lexicale), et de construire dynamiquement des grammaires linguistiques modulaires.
</p>
<p>The aim of this paper is to show why Range Concatenation Grammars (RCG) are a formalism
particularly suitable to describe natural language. We first explain that the power necessary to
describe natural language is that of PTIME. Then, among grammatical formalisms that have this
expressing power, we justify the choice of RCGs. Finally, after an overview of their definition
and properties, we show how their use as linguistic grammars makes it possible to deal with
complex syntactic phenomena, to achieve simultaneously both syntactic parsing and constraints
checking (e.g., morphosyntactic and/or lexical semantic constraints), and to build dynamically
modular linguistic grammars.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Grammaires de r&#233;&#233;criture, Grammaires Faiblement Contextuelles, complexit&#233; du langage natu-
rel, Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (RCG)
Rewriting Systems, Mildly Context-Sensitive Grammars, Complexity of Natural Language,
Range Concatenation Grammars (RCG)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Pierre Boullier
</p>
<p>1 La complexit&#233; du langage naturel
</p>
<p>1.1 Les grammaires faiblement contextuelles (MCS)
</p>
<p>La puissance formelle permettant de d&#233;finir la syntaxe du langage naturel fait encore l&#8217;objet
de discussions. Il a &#233;t&#233; d&#233;montr&#233; par (Schieber, 1985) que les Grammaires Non-Contextuelles
(CFG) sont insuffisantes pour d&#233;crire certains ph&#233;nom&#232;nes linguistiques. De ce fait, (Joshi,
1985) a introduit une classe de grammaires &#224; la puissance formelle l&#233;g&#232;rement sup&#233;rieure &#224;
celle des CFG : il s&#8217;agit des grammaires faiblement contextuelles (mildly context-sensitive, ou
MCS). Encore aujourd&#8217;hui, on consid&#232;re souvent que les grammaires MCS ont la puissance
ad&#233;quate pour d&#233;crire le langage naturel. Elles sont d&#233;finies par les propri&#233;t&#233;s suivantes :
MCS1. les langages MCS contiennent strictement les Langages Non-Contextuels,
MCS2. les langages MCS peuvent &#234;tre analys&#233;s en temps polynomial,
MCS3. les langages MCS doivent reconna&#238;tre certains langages &#224; d&#233;pendances complexes,
</p>
<p>comme {anbncn}, {anbmcndm} ou le langage 2-copy,
MCS4. les langages MCS v&#233;rifient la Propri&#233;t&#233; de Croissance Constante (ci-apr&#232;s CGP)1.
</p>
<p>Les grammaires MCS propos&#233;es aujourd&#8217;hui pour l&#8217;analyse linguistique sont d&#8217;une part les
Grammaires d&#8217;Arbres Adjoints (TAG) et les grammaires qui lui sont faiblement &#233;quivalentes,
et d&#8217;autre part, avec un pouvoir d&#8217;expression plus grand, les Syst&#232;mes de R&#233;&#233;criture Lin&#233;aire
Non-Contextuels (LCFRS) et ses divers &#233;quivalents2. &#192; notre connaissance, aucun formalisme
grammatical MCS n&#8217;a &#233;t&#233; propos&#233; qui soit strictement plus puissant que ceux qui rentrent dans
le cadre des LCFRS, bien qu&#8217;il existe des langages se rangeant strictement dans cet intervalle.
</p>
<p>1.2 Nombres chinois et g&#233;nitifs en g&#233;orgien ancien
</p>
<p>Il existe dans certaines langues des constructions sporadiques qui ne sont pas analysables par
des grammaires MCS car elles ne respectent pas la CGP (condition MCS4). Classiquement,
il en est ainsi des nombres chinois (Radzinski, 1991) et du g&#233;nitif en g&#233;orgien ancien3 (Mi-
chaelis et Kracht, 1996). En revanche, les Grammaires Non-Contextuelles Parall&#232;les Multiples
(PMCFG) introduites par (Kaji et al., 1992) couvrent ces deux cas tout en &#233;tant strictement
moins puissantes que les formalismes couvrant tout PTIME (Groenink, 1996).
</p>
<p>Naturellement, on pourrait consid&#233;rer ces cas comme des cas marginaux dont il n&#8217;est pas n&#233;-
cessairement souhaitable de pouvoir rendre compte. En particulier, dans le cas des nombres
chinois, il peut &#234;tre object&#233; (Radzinski, 1991) que les contraintes qui font que la CGP n&#8217;est pas
respect&#233;e pourraient ne pas &#234;tre de nature linguistique, mais &#234;tre issues des propri&#233;t&#233;s math&#233;-
matiques des objets qu&#8217;il d&#233;note. Par ailleurs, il serait satisfaisant de disposer d&#8217;une grammaire
pour le g&#233;orgien ancien permettant un nombre arbitraire de g&#233;nitifs empil&#233;s, mais il n&#8217;est pas
toujours consid&#233;r&#233; que cela soit indispensable (Kallmeyer, 1997). Cependant, au moins deux
autres ph&#233;nom&#232;nes, bien moins sporadiques, mettent en cause l&#8217;id&#233;e selon laquelle les langages
MCS suffisent au traitement des langues. Il s&#8217;agit des exemples bien connus que sont le &#171;scram-
bling&#187; et les constructions coordonn&#233;es &#224; verbes multiples.
</p>
<p>1Un langage v&#233;rifie la CGP (pour Constant Growth Property) si, lorsque l&#8217;on ordonne par taille croissante les
cha&#238;nes du langage, on peut majorer la diff&#233;rence entre les longueurs de deux cha&#238;nes cons&#233;cutives.
</p>
<p>2Comme les TAG Multi-Composants (MC-TAG) ou les Grammaires Minimalistes (MG)
3Les auteurs cit&#233;s montrent que le g&#233;nitif en g&#233;orgien ancien n&#8217;est pas semi-lin&#233;aire. En r&#233;alit&#233; le g&#233;nitif en
</p>
<p>g&#233;orgien ancien, pouvant &#234;tre r&#233;duit &#224; {a1b a2gb . . . akgk&#8722;1b}, ne respecte m&#234;me pas la CGP, ce qui est plus fort.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les RCG comme formalisme grammatical pour la linguistique
</p>
<p>1.3 Scrambling en allemand et coordonn&#233;es &#224; verbes multiples en n&#233;er-
landais
</p>
<p>Le scrambling en allemand4 peut &#234;tre d&#233;crit de la fa&#231;on suivante : dans une subordonn&#233;e com-
prenant des compl&#233;tives, les compl&#233;ments des diff&#233;rents verbes sont plac&#233;s entre le sujet du
verbe principal et les verbes. Les verbes sont alors g&#233;n&#233;ralement ordonn&#233;s du plus ench&#226;ss&#233; au
verbe principal, mais les compl&#233;ments sont dans un ordre quelconque (on trouvera des exemples
dans (Becker et al., 1991)). Il est montr&#233; par (Boullier, 1999b) que le langage utilis&#233; par (Be-
cker et al., 1992) pour mod&#233;liser le scrambling est insuffisant, et utilise un langage plus vaste
qu&#8217;il appelle SCR5 Ce langage est au-del&#224; de la puissance des TAG (Becker et al., 1991) et
m&#234;me de celle des LCFRS (Becker et al., 1992). Il semble pourtant v&#233;rifier la CGP. Cependant,
comme indiqu&#233; plus haut, aucun formalisme grammatical n&#8217;a &#233;t&#233; propos&#233; jusqu&#8217;&#224; pr&#233;sent qui
soit simultan&#233;ment MCS tout en ayant une puissance strictement plus grande que les LCFRS.
Il semble donc raisonnable de chercher un formalisme grammatical qui ne soit pas MCS pour
d&#233;crire le scrambling en allemand6.
</p>
<p>Les constructions coordonn&#233;es &#224; verbes multiples en n&#233;erlandais sont analys&#233;es par (Groenink,
1996) : il exhibe une classe d&#8217;exemples C1 non exprimables dans le cadre des LCFRS7, qui
regroupe des exemples ayant un nombre de verbes arbitraire, ce qui n&#233;cessite une argumentation
sur la pertinence de cet argument (cf. ci-dessous). Il a &#233;t&#233; prouv&#233; par la suite qu&#8217;elle n&#8217;&#233;tait
pas m&#234;me semi-lin&#233;aire (Michaelis et Kracht, 1996). Cependant, bien qu&#8217;une PMCFG puisse
analyser cette classe d&#8217;exemples, (Groenink, 1996) montre qu&#8217;on peut l&#8217;&#233;tendre &#224; une classe
plus large C2, encore moins acceptable linguistiquement que C1, que m&#234;me les PMCFG, qui
subsument strictement les LCFRS et ne respectent pas la CGP, ne peuvent d&#233;crire8.
</p>
<p>1.4 La puissance n&#233;cessaire pour d&#233;crire le langage naturel est PTIME
</p>
<p>M&#234;me en rejetant la classe C2 d&#8217;exemples du n&#233;erlandais, les exemples ci-dessus semblent
indiquer que les formalismes MCS ne suffisent pas &#224; d&#233;crire le langage naturel9. Toutefois,
les trois premi&#232;res conditions MCS semblent devoir &#234;tre v&#233;rifi&#233;es par les langues naturelles :
MCS1 a &#233;t&#233; justifi&#233;e plus haut, MCS3 a &#233;t&#233; explicitement introduite pour que les grammaires
MCS puissent traiter divers ph&#233;nom&#232;nes linguistiques courants, et MCS2 est justifi&#233;e au moins
par les besoins pratiques de complexit&#233;. Seule MCS4 peut donc &#234;tre viol&#233;e : la mod&#233;lisation du
langage naturel passe par des grammaires ne v&#233;rifiant pas la CGP.
</p>
<p>4Ce ph&#233;nom&#232;ne existe dans d&#8217;autres langues, comme le japonais.
5Il s&#8217;agit approximativement du langage suivant : soit un alphabet de terminaux partitionn&#233; en {n1, . . . , nl}
</p>
<p>et {v1, . . . , vm} et muni d&#8217;une correspondance h indiquant, si v = h(n), que n est un argument de v. Une suite
de terminaux est reconnue par SCR si et seulement si elle est de la forme &#960;(n1, . . . , np)v1 . . . vq o&#249; &#960; est une
permutation, les ni et les vj sont deux &#224; deux distincts, et pour tout ni il existe un et un seul vj tel que h(ni) = vj .
</p>
<p>6On peut noter d&#232;s ici que le fait qu&#8217;un tel formalisme ne serait peut-&#234;tre pas de la puissance minimale pour
exprimer SCR n&#8217;est pas n&#233;cessairement un probl&#232;me. En effet, si l&#8217;on peut exhiber des grammaires analysables
sans v&#233;ritable surco&#251;t par rapport aux grammaires MCS mais permettant d&#8217;exprimer simplement et &#233;l&#233;gamment le
scrambling, rien ne justifie dans la pratique la qu&#234;te de la plus petite grammaire possible incluant SCR.
</p>
<p>7Il s&#8217;agit de son fragment (1.14) r&#233;p&#233;t&#233; en (3.39).
8Il s&#8217;agit du cas o&#249; l&#8217;on ne se restreint pas &#224; un seul verbe &#224; mont&#233;e &#224; l&#8217;infinitif parmi les verbes multiples
</p>
<p>coordonn&#233;s (cf. paragraphe 3.3 de (Groenink, 1996)).
9Notons &#224; cet &#233;gard que si l&#8217;on accepte la classe d&#8217;exemples C2, l&#8217;insuffisance des PMCFG &#224; les traiter ne
</p>
<p>prouve rien de plus : on pourrait imaginer trouver un formalisme grammatical agr&#233;able subsumant les grammaires
MCS mais non comparable avec les PMCFG.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Pierre Boullier
</p>
<p>Toutefois, la probl&#233;matique de la distinction comp&#233;tence/performance ne rend pas la chose si
simple, par exemple pour la classe d&#8217;exemples C1 du n&#233;erlandais. De fait, (Manaster-Ramer,
1987) indique que le r&#233;sultat d&#233;pend du point de vue que l&#8217;on adopte sur ce que l&#8217;on inclut
dans la langue et ce que l&#8217;on en exclut. Toutefois, et parall&#232;lement &#224; la note 6 du paragraphe
1.3, il nous semble artificiel de vouloir chercher la grammaire minimale couvrant une langue
donn&#233;e, en allant jusqu&#8217;&#224; s&#8217;autoriser &#224; borner ex abrupto certains param&#232;tres sans justification
linguistique claire, surtout s&#8217;il existe des classes de grammaires permettant de s&#8217;affranchir de
telles limitations sans pour autant entra&#238;ner un surco&#251;t significatif.
</p>
<p>La probl&#233;matique comp&#233;tence/performance est encore plus forte concernant l&#8217;insuffisance des
PMCFG pour d&#233;crire la classe C2. En r&#233;alit&#233;, on peut penser qu&#8217;une telle classe d&#8217;exemples,
peu convaincante en termes de performance mais acceptable (quoiqu&#8217;&#224; la marge) en termes de
comp&#233;tence, est plus ou moins du niveau maximal de complexit&#233; de la langue concern&#233;e, lequel
est disponible mais presque jamais utilis&#233; dans une grammaire de la langue. Ainsi, un forma-
lisme grammatical permettant de traiter le n&#233;erlandais devrait avoir la puissance n&#233;cessaire au
traitement de C2. Mais il devrait pour ce faire exprimer sa pleine puissance, utilis&#233;e tr&#232;s rare-
ment dans une grammaire compl&#232;te du n&#233;erlandais. En poursuivant ce raisonnement, et puisque
les PMCFG ne suffisent pas, on ne peut que conclure que le niveau de complexit&#233; requis est le
seul autre niveau imm&#233;diatement sup&#233;rieur &#224; celui des grammaires MCS pour lequel il existe
des formalismes grammaticaux aux bonnes propri&#233;t&#233;s, &#224; savoir tout PTIME (cf. partie 2).
</p>
<p>Par ailleurs, nous n&#8217;avons parl&#233; jusqu&#8217;&#224; pr&#233;sent que de puissance g&#233;n&#233;rative faible. Or si l&#8217;&#233;qui-
valence faible entre le n&#233;erlandais et un langage analysable avec une PMCFG n&#8217;est pas certaine,
l&#8217;&#171;&#233;quivalence forte&#187; entre structures linguistiques et analyse par une PMCFG, que l&#8217;on sou-
haite &#233;videmment, est encore plus douteuse. Cela renforce l&#8217;intuition selon laquelle les gram-
maires ad&#233;quates &#224; l&#8217;analyse des langues ne respectent pas la CGP, ne sont pas m&#234;me expri-
mables par une PMCFG, et n&#233;cessitent un formalisme grammatical couvrant tout PTIME.
</p>
<p>2 Les Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (RCG)
</p>
<p>2.1 Pourquoi les RCG
</p>
<p>Les classes de grammaires propos&#233;es dans la litt&#233;rature ne v&#233;rifiant pas la CGP10 mais satisfai-
sant les trois autres conditions MCS1, MCS2 et MCS3 ne sont pas en nombre tr&#232;s important11.
Dans la plupart des cas, il s&#8217;agit de classes de grammaires couvrant exactement PTIME. Cer-
tains sont moins puissants, comme les PMCFG, mais on a vu leur insuffisance dans la partie 1.
D&#8217;autres formalismes non-MCS ont &#233;t&#233; propos&#233;s qui ne sont pas analysables en temps polyno-
</p>
<p>10Les v&#233;ritables cons&#233;quences de la violation de CGP sur la nature d&#8217;une classe de grammaire sont peu claires.
Toutefois, d&#8217;une part pour des raisons intuitives et d&#8217;autre part &#224; travers les classes de grammaires propos&#233;es &#224;
ce jour et ne respectant pas CGP, il semble qu&#8217;il y ait un lien entre le respect de CGP et le fait d&#8217;&#234;tre &#171;lin&#233;aire&#187;
au sens des LMG ou des RCG, c&#8217;est-&#224;-dire le fait que deux non-terminaux de l&#8217;analyse ne peuvent avoir dans
leurs &#171;port&#233;es&#187; respectives, quoi que cela puisse dire dans un formalisme donn&#233;, un terminal en commun : le non-
respect de CGP passerait par une certaine forme de non-lin&#233;arit&#233; se traduisant par l&#8217;utilisation multiple de m&#234;mes
terminaux au cours de l&#8217;analyse. Il en est ainsi des PMCFG, des LMG, des RCG, et des MC-TAGS &#224; n&#339;uds
partag&#233;s (restreintes ou non) propos&#233;s par (Kallmeyer, 2003). &#192; vrai dire, la condition CGP doit peut-&#234;tre &#234;tre
remplac&#233;e dans ces consid&#233;rations par celle de semi-lin&#233;arit&#233;. Mais dans tous les cas, si ces r&#233;flexions s&#8217;av&#232;rent
justifi&#233;es, elles indiqueraient la n&#233;cessit&#233; de grammaires non-lin&#233;aires pour traiter le langage naturel.
</p>
<p>11Il est &#224; noter que la condition MCS3, qui est impos&#233;e par divers ph&#233;nom&#232;nes linguistiques, rend inad&#233;quats des
formalismes comme les V-TAGs (Rambow, 1994) ou les D-Tree Substitution Grammars (Rambow et al., 2001).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les RCG comme formalisme grammatical pour la linguistique
</p>
<p>mial, qu&#8217;ils subsument PTIME ou non, mais ils ne sont pas satisfaisants en termes de complexit&#233;
(condition MCS2). Parmi les formalismes couvrant exactement PTIME, on trouve en particu-
lier la variante dite &#171;simple&#187; des Litteral Movement Grammars (sLMG) introduites par (Groe-
nink, 1996) et les Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (Range Concatenation Grammars,
ci-apr&#232;s RCGs) introduites par (Boullier, 2000a). Tout en restant polynomiales (MCS2), elles
peuvent traiter les cas pr&#233;sent&#233;s en partie 1 (Groenink, 1996; Boullier, 1999a; Boullier, 1999b).
</p>
<p>Parmi ces deux formalismes, les RCG d&#233;finissent des pr&#233;dicats sur des intervalles de la cha&#238;ne
d&#8217;entr&#233;e, alors que les sLMG consid&#232;rent des sous-cha&#238;nes. Or il semble plus naturel d&#8217;un point
de vue linguistique de consid&#233;rer non pas des sous-cha&#238;nes, mais plut&#244;t des intervalles de la
cha&#238;ne d&#8217;entr&#233;e, en particulier lorsqu&#8217;un m&#234;me mot (i.e. un terminal) est pr&#233;sent plus d&#8217;une fois
dans la phrase (i.e. la cha&#238;ne)12. C&#8217;est encore plus vrai si l&#8217;on a moins de terminaux que de
mots de la langue, choix raisonnable mais en r&#233;alit&#233; non n&#233;cessaire moyennant des m&#233;thodes
appropri&#233;es (cf. Partie 3). En outre, il est de plus en plus clair que la description du langage
naturel n&#233;cessite la prise en compte d&#8217;informations de nature topologique (Gerdes et Kahane,
2001; Cl&#233;ment et al., 2002). Or il est facile d&#8217;encoder de telles informations dans une RCG
qui manipule des intervalles, et donc des positions dans la cha&#238;ne, mais plus difficile dans une
sLMG qui ne manipule que des sous-cha&#238;nes13.
</p>
<p>2.2 Les RCG : exemple et propri&#233;t&#233;s
</p>
<p>Pour une d&#233;finition formelle des RCG, leur complexit&#233; exacte d&#8217;analyse, et la d&#233;monstration de
leurs propri&#233;t&#233;s, on se reportera par exemple &#224; (Boullier, 2000a). Nous nous contenterons ici de
pr&#233;senter sur un cas particulier le fonctionnement des RCG.
</p>
<p>Une RCG se pr&#233;sente sous la forme de clauses, qui ont la forme P &#8594; P1 . . . Pn, o&#249; P et les
Pi sont des pr&#233;dicats (P est le pr&#233;dicat de partie gauche, les Pi sont ceux de partie droite).
Une telle clause s&#8217;interpr&#232;te ainsi : &#171;si les pr&#233;dicats P1 &#224; Pn sont v&#233;rifi&#233;s, alors le pr&#233;dicat P
l&#8217;est aussi&#187;. Les pr&#233;dicats ont un ou plusieurs arguments. Chaque argument est la concat&#233;nation
d&#8217;une ou plusieurs variables, chaque variable repr&#233;sentant un intervalle de la cha&#238;ne (et pas
une sous-cha&#238;ne) ou un terminal (dont le nom commence par une minuscule ou un guillemet).
La concat&#233;nation de plusieurs variables d&#233;note donc aussi un intervalle, mais les intervalles
concat&#233;n&#233;s doivent &#234;tre successifs. Une clause comme P (XY ) &#8594; P1(X)P2(XY )P3(X, Y )
peut donc se comprendre comme &#171;le pr&#233;dicat P appel&#233; sur l&#8217;intervalle d&#233;not&#233; par XY de la
cha&#238;ne d&#8217;entr&#233;e peut &#234;tre remplac&#233; par le pr&#233;dicat P1 appliqu&#233; &#224; l&#8217;intervalle X , le pr&#233;dicat P2
&#224; l&#8217;intervalle XY et le pr&#233;dicat P3 au couple (X,Y )&#187; (on dit que les pr&#233;dicats de partie droite
sont appel&#233;s). Le pr&#233;dicat de partie gauche de la premi&#232;re clause est l&#8217;axiome, et prend en entr&#233;e
un intervalle couvrant toute la cha&#238;ne. Un pr&#233;dicat est v&#233;rifi&#233; sur un intervalle si et seulement si
l&#8217;on peut en d&#233;river la cha&#238;ne vide &#224; l&#8217;issue de remplacements successifs. Une cha&#238;ne est dans le
langage si et seulement si le pr&#233;dicat axiome est v&#233;rifi&#233; sur l&#8217;intervalle couvrant toute la cha&#238;ne.
</p>
<p>12La diff&#233;rence fondamentale entre les RCG et les sLMG est bien celle qu&#8217;il y a entre traiter des intervalles et
traiter des sous-cha&#238;nes. Or il est tr&#232;s facile de traiter en RCG toutes les occurrences d&#8217;une sous-cha&#238;ne qui se r&#233;p&#232;te,
puisqu&#8217;il suffit de consid&#233;rer deux des intervalles concern&#233;s, de v&#233;rifier qu&#8217;ils correspondent &#224; deux sous-cha&#238;nes
&#233;gales, puis de traiter ces deux cha&#238;nes. En revanche, distinguer deux sous-cha&#238;nes &#233;gales correspondant &#224; deux
intervalles distincts est basique en RCG mais d&#233;licat en sLMG, puisque dans le pire des cas il faut utiliser la cha&#238;ne
enti&#232;re pour distinguer deux occurrences de la m&#234;me sous-cha&#238;ne. Donc m&#234;me ind&#233;pendamment de consid&#233;rations
linguistiques, les RCG semblent plus facile d&#8217;emploi que les sLMG.
</p>
<p>13L&#8217;utilisation des RCG pour &#233;crire des grammaires topologiques est une direction de recherche tr&#232;s promet-
teuse, et fera probablement l&#8217;objet de publications ult&#233;rieures.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Pierre Boullier
</p>
<p>Nous illustrerons ceci par la RCG suivante (Boullier, 2003) qui reconna&#238;t le langage 3-copy
{www|w &#8712; {a, b}&#8727;} (hors de port&#233;e des TAG), trivialement extensible aux langages k-copy :
S(XY Z) &#8594; A(X, Y, Z)
A(aX &#8242;, aY &#8242;, aZ &#8242;) &#8594; A(X &#8242;, Y &#8242;, Z &#8242;)
A(bX &#8242;, bY &#8242;, bZ &#8242;) &#8594; A(X &#8242;, Y &#8242;, Z &#8242;)
A(&#949;, &#949;, &#949;) &#8594; &#949;
</p>
<p>La premi&#232;re clause a pour partie gauche l&#8217;axiome, qui prend donc comme argument un inter-
valle couvrant toute la cha&#238;ne. Il d&#233;coupe cet intervalle en 3 sous-intervalles, qui sont nomm&#233;s
respectivement X , Y et Z, qui, si la cha&#238;ne est valide, seront les intervalles (distincts) corres-
pondant aux trois sous-cha&#238;nes identiques. Puisque c&#8217;est la seule clause o&#249; S intervient, on est
forc&#233; de remplacer l&#8217;axiome par A(X, Y, Z). &#192; ce stade, il y a quatre possibilit&#233;s :
&#8211; ou bien la deuxi&#232;me clause peut s&#8217;appliquer, c&#8217;est-&#224;-dire que chacun des trois intervalles
</p>
<p>commence par le terminal a, et alors on remplace A(X, Y, Z), c&#8217;est-&#224;-dire A(aX &#8242;, aY &#8242;, aZ &#8242;),
par A(X &#8242;, Y &#8242;, Z &#8242;). On a ainsi &#171;consomm&#233;&#187; un a &#224; l&#8217;initiale de chaque intervalle (ceci est un
exemple du fait que l&#8217;analyse par une RCG n&#8217;est pas une analyse gauche-droite)14 ;
</p>
<p>&#8211; ou bien la troisi&#232;me clause peut s&#8217;appliquer (m&#234;me situation mais avec le terminal b) ;
&#8211; ou bien les trois intervalles sont vides (borne inf&#233;rieure et borne sup&#233;rieure sont &#233;gales), et
</p>
<p>on peut remplacer A(&#949;, &#949;, &#949;) par &#949;, ce qui signifie que la cha&#238;ne initiale est dans le langage ;
&#8211; ou bien aucune clause ne s&#8217;applique, et &#949; ne peut &#234;tre d&#233;riv&#233; : la cha&#238;ne n&#8217;est pas reconnue.
Si l&#8217;on est dans l&#8217;un des deux premiers cas, on recommence jusqu&#8217;au succ&#232;s ou &#224; l&#8217;&#233;chec, en
consommant en parall&#232;le &#224; chaque fois un terminal &#224; l&#8217;initiale de chacun des trois intervalles, &#224;
condition qu&#8217;ils d&#233;signent la m&#234;me cha&#238;ne. Si on r&#233;ussit &#224; r&#233;duire les intervalles &#224; des intervalles
vides, c&#8217;est que les terminaux des intervalles initiaux se correspondaient correctement.
</p>
<p>Les RCG permettent d&#8217;appeler la n&#233;gation d&#8217;un pr&#233;dicat : on note par exemple A(X, Y ) la
n&#233;gation de A(X, Y )). Un tel appel n&#233;gatif est v&#233;rifi&#233; si et seulement si son appel positif &#233;choue
(Boullier, 2000a), ce qui implique d&#8217;interdire les grammaires inconsistantes, c&#8217;est-&#224;-dire les
grammaires qui peuvent g&#233;n&#233;rer des d&#233;rivations o&#249; un pr&#233;dicat peut d&#233;river sa propre n&#233;gation.
</p>
<p>Il est prouv&#233; par (Boullier, 2000a) qu&#8217;une RCG peut &#234;tre analys&#233;e en un temps polynomial,
l&#8217;exposant d&#233;pendant de la grammaire (c&#8217;est la somme du nombre maximum d&#8217;arguments d&#8217;un
pr&#233;dicat et du nombre maximum de variables pr&#233;sentes dans une partie gauche). Par ailleurs,
Boullier a d&#233;velopp&#233; un analyseur pour les RCG qui a pr&#233;cis&#233;ment cette complexit&#233;.
</p>
<p>Enfin, (Boullier, 2000a) montre que les RCG b&#233;n&#233;ficient de propri&#233;t&#233;s tr&#232;s int&#233;ressantes : sans
modifier les grammaires en jeu, et par le seul ajout d&#8217;une &#224; deux clauses, on peut construire
&#224; partir de deux RCG les grammaires d&#233;finissant l&#8217;union des deux langages correspondants,
leur concat&#233;nation, leur intersection, l&#8217;it&#233;ration de Kleene de l&#8217;un d&#8217;eux, et le compl&#233;ment de
l&#8217;un d&#8217;eux. Ceci peut &#234;tre r&#233;sum&#233;, en reprenant la d&#233;finition de la modularit&#233; donn&#233;e dans
(Boullier, 2000a), en disant que les RCG sont modulaires par rapport &#224; ces cinq op&#233;rateurs.
De plus, la non-lin&#233;arit&#233; des RCG permet de cr&#233;er des grammaires m&#234;lant diff&#233;rents points
de vue sur une m&#234;me cha&#238;ne. Ces deux propri&#233;t&#233;s sont tr&#232;s int&#233;ressantes pour la linguistique.
D&#8217;une part, la modularit&#233; permet d&#8217;imaginer des biblioth&#232;ques de modules linguistiques dans
lesquelles on pourrait piocher pour construire des grammaires d&#8217;une langue, introduisant un &#224; un
divers ph&#233;nom&#232;nes15. D&#8217;autre part, la non-lin&#233;arit&#233; permet l&#8217;&#233;criture de grammaires apportant
</p>
<p>14On notera que l&#8217;utilisation d&#8217;un nom de variable X &#8242; diff&#233;rent de X est inutile, mais facilite l&#8217;explication.
15Dans (Boullier, 2003), l&#8217;exemple du paradigme &#171;r&#232;gle g&#233;n&#233;rale avec exceptions&#187; est explicit&#233; : pour construire
</p>
<p>une RCG reconnaissant un langage L d&#233;fini &#224; partir de trois autres langages R, S, E par L = R &#8745; S &#8746; E , o&#249; R
repr&#233;sente le langage o&#249; la r&#232;gle g&#233;n&#233;rale est toujours vraie, S le sous-ensemble de R qui est &#224; rejeter, et E le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les RCG comme formalisme grammatical pour la linguistique
</p>
<p>simultan&#233;ment divers points de vue sur la phrase (syntaxe, morphologie, s&#233;mantique lexicale).
La partie suivante montre sur quelques exemples ce que permettent effectivement les RCG.
</p>
<p>3 RCG pour la linguistique
</p>
<p>3.1 Ph&#233;nom&#232;nes syntaxiques complexes
</p>
<p>Les ph&#233;nom&#232;nes les plus difficiles rencontr&#233;s dans les langues, parmi lesquels ceux cit&#233;s en
partie 1, peuvent tous &#234;tre analys&#233;s correctement d&#232;s lors que l&#8217;on dispose de la puissance des
RCG, i.e. de tout PTIME. De fait, une RCG pour l&#8217;analyse des nombres chinois est propos&#233;e
dans (Boullier, 1999b), de m&#234;me qu&#8217;une RCG pour le &#171;scrambling&#187; en allemand tel que d&#233;fini
en 2.2. De plus, (Kallmeyer, 2003) montre que le formalisme qu&#8217;elle d&#233;finit sp&#233;cifiquement pour
analyser correctement ce ph&#233;nom&#232;ne est tel qu&#8217;on peut facilement convertir une de ses gram-
maires en une RCG. Par ailleurs, le g&#233;nitif en g&#233;orgien ancien est fondamentalement similaire
aux nombres chinois, et peut &#234;tre trait&#233; par une grammaire similaire. Enfin, les constructions co-
ordonn&#233;es &#224; verbes multiples en n&#233;erlandais peuvent &#234;tre analys&#233; ad&#233;quatement par une sLMG,
comme le montre (Groenink, 1996), et donc &#233;galement par une RCG aux analyses similaires.
</p>
<p>En plus du c&#244;t&#233; th&#233;orique de la puissance d&#8217;expression des RCG, leur non-lin&#233;arit&#233; permet
de disposer de diff&#233;rents points de vue sur une m&#234;me cha&#238;ne ou sous-cha&#238;ne. Une premi&#232;re
illustration de ce ph&#233;nom&#232;ne, en se restreignant &#224; la syntaxe, est fourni par le ph&#233;nom&#232;ne des
coordinations &#224; ellipses. Soit par exemple la phrase : &#171;Luc aime Marie et Jean Anne.&#187; On peut
la gloser par &#171;Luc aime Marie et Jean aime Anne&#187;. Autrement dit, le verbe &#171;aime&#187; est &#171;sous-
entendu&#187; dans le deuxi&#232;me membre de phrase, ce qui peut &#234;tre interpr&#233;t&#233; comme le fait qu&#8217;il
est utilis&#233; deux fois16. La RCG suivante, fournit une analyse convenable de cette phrase :
</p>
<p>PCOORD(S1 V O1 &#8221;et&#8221;S2 O2) &#8594; P (S1, V,O1) P (S2, V,O2) V (V )
%Une phrase se d&#233;coupe en un sujet, un verbe et un objet qui doivent v&#233;rifier P , un &quot;et&quot;, et
%un autre sujet et un autre objet qui, avec le verbe, doivent v&#233;rifier P aussi
</p>
<p>P (S, V,O) &#8594; SUJ(S, V ) OBJ(O, V )
%Trois intervalles v&#233;rifient P si le premier est sujet du second, et le troisi&#232;me objet du second
</p>
<p>SUJ(S, V ) &#8594; GN(S) ACC_G_N(S, V )
%Le sujet d&#8217;un verbe est un groupe nominal et s&#8217;accorde en genre et en nombre avec lui
</p>
<p>OBJ(O, V ) &#8594; GN(O) %L&#8217;objet d&#8217;un verbe est un groupe nominal
GN(X) &#8594; NP (X) %Un nom propre est un groupe nominal
ACC_G_N(&#8221;Luc&#8221;, &#8221;aime&#8221;) &#8594; &#949; %&quot;Luc&quot; est accord&#233; en genre et nombre avec &quot;aime&quot;
ACC_G_N(&#8221;Jean&#8221;, &#8221;aime&#8221;) &#8594; &#949; %&quot;Jean&quot; est accord&#233; en genre et nombre avec &quot;aime&quot;
V (aime) &#8594; &#949; %&quot;aime&quot; est un verbe
NP (&#8221;Luc&#8221;) &#8594; &#949; %&quot;Luc&quot; est un nom propre
NP (&#8221;Marie&#8221;) &#8594; &#949; %&quot;Marie&quot; est un nom propre
NP (&#8221;Jean&#8221;) &#8594; &#949; %&quot;Jean&quot; est un nom propre
NP (&#8221;Anne&#8221;) &#8594; &#949; %&quot;Anne&quot; est un nom propre
</p>
<p>langage des exceptions par lequel il faut le remplacer, il suffit de rajouter les clauses L(X) &#8594; R(X) S(X) et
L(X) &#8594; E(X), o&#249; l&#8217;on a nomm&#233; l&#8217;axiome d&#8217;un langage par la lettre majuscule droite correspondant &#224; son nom.
</p>
<p>16L&#8217;analyse linguistique de ce ph&#233;nom&#232;ne est bien plus complexe, car d&#8217;une part d&#8217;autres constituants que le
verbe peuvent &#234;tre &#233;lid&#233;s (mais pas tous), et d&#8217;autre part le verbe &#171;sous-entendu&#187; n&#8217;a que certaines des propri&#233;t&#233;s
du verbe plein (ainsi la personne dans &#171;Je mange une pomme et Jean une poire&#187;). Mais cet exemple est l&#224; pour
montrer comment peut &#234;tre utilis&#233;e la non-lin&#233;arit&#233; des RCG pour la description de la syntaxe, et non comment on
doit analyser en RCG les coordinations &#224; ellipse de mani&#232;re linguistiquement coh&#233;rente.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Pierre Boullier
</p>
<p>Cette grammaire regroupe donc des informations que d&#8217;autres formalismes rejettent au-del&#224;
des grammaires de r&#233;&#233;criture qui leur sont sous-jacentes. C&#8217;est le cas de la nature des relations
syntaxiques (sujet, objet) et de l&#8217;accord (m&#234;me si par souci de simplification ce dernier est
trait&#233; de fa&#231;on tr&#232;s rudimentaire). C&#8217;est tout l&#8217;int&#233;r&#234;t des RCG que de pouvoir dire plusieurs
choses sur le m&#234;me intervalle de la cha&#238;ne, contrairement &#224; d&#8217;autres formalismes (comme les
TAG ou les LFG), qui sont contraints de ne conserver qu&#8217;une seule de ces informations, celle
qui est la plus structurante (le plus souvent les relations de constituance), et de rejeter dans des
d&#233;corations (traits) les autres informations (nature de la relation, accord, etc.). L&#8217;inconv&#233;nient
majeur d&#8217;une telle approche est que l&#8217;analyse perd alors dans le cas g&#233;n&#233;ral les bonnes propri&#233;t&#233;s
qu&#8217;avait la grammaire de r&#233;&#233;criture sous-jacente (une CFG en LFG, par exemple) et peut devenir
exponentielle. De plus, dans la plupart des cas, l&#8217;analyse se fait d&#8217;abord sans tenir compte des
d&#233;corations, g&#233;n&#233;rant un tr&#232;s grand nombre d&#8217;analyses possibles, qui sont ensuite filtr&#233;es &#224; l&#8217;aide
des traits. &#192; l&#8217;inverse, les RCG peuvent traiter toutes les informations simultan&#233;ment, rejetant
d&#232;s le d&#233;but les analyses non valides quelle qu&#8217;en soit la raison.
</p>
<p>3.2 Interface syntaxe-s&#233;mantique int&#233;gr&#233;e &#224; la grammaire
</p>
<p>La non-lin&#233;arit&#233; des RCG permet non seulement l&#8217;utilisation multiple d&#8217;un m&#234;me intervalle
de la cha&#238;ne pour exprimer des relations syntaxiques, mais aussi d&#8217;avoir des points de vue
v&#233;ritablement diff&#233;rents sur des intervalles, et en particulier pour combiner la syntaxe et la
s&#233;mantique (on se restreint ici &#224; la s&#233;mantique lexicale, c&#8217;est-&#224;-dire en gros aux cadres de sous-
cat&#233;gorisation et aux restrictions de s&#233;lection). C&#8217;est une g&#233;n&#233;ralisation de la remarque finale
du paragraphe pr&#233;c&#233;dent : non seulement on peut &#233;crire en RCG une grammaire g&#233;rant toute la
syntaxe, y compris (entre autres) la nature des relations syntaxiques et les r&#232;gles d&#8217;accord, mais
en plus on peut faire en sorte que la RCG elle-m&#234;me v&#233;rifie au cours de l&#8217;analyse les contraintes
de sous-cat&#233;gorisation et de restriction de s&#233;lection. Il suffit pour cela de rajouter des pr&#233;dicats
traitant des relations de s&#233;mantique lexicale, assortis de pr&#233;dicats pla&#231;ant les terminaux dans
une hi&#233;rarchie de types. Les interactions entre syntaxe et s&#233;mantique lexicale, comme la nature
des syntagmes r&#233;alisant l&#8217;agent et le patient d&#8217;un verbe transitif selon le mode (actif ou passif)
sont alors facilement repr&#233;sentables. Nous avons &#233;crit et v&#233;rifi&#233; des grammaires jouets sur ce
principe. C&#8217;est un progr&#232;s sur les formalismes qui n&#8217;utilisent ces contraintes que pour filtrer des
analyses souvent nombreuses fournies par une premi&#232;re &#233;tape purement syntaxique.
</p>
<p>3.3 RCG linguistiques modulaires dynamiques
</p>
<p>La grammaire pr&#233;sent&#233;e en 3.1 fait le choix d&#8217;associer &#224; chaque entr&#233;e lexicale un symbole
terminal. Cependant, ce choix m&#232;ne &#224; des grammaires excessivement volumineuses, &#224; la fois
en termes de nombre de terminaux (au moins un par forme du lexique) et en termes de nombre
de clauses (plusieurs clauses pour chaque forme, ne serait-ce que pour traiter ses caract&#233;ris-
tiques morphosyntaxiques et de s&#233;mantique lexicale). C&#8217;est l&#224; que les propri&#233;t&#233;s de cl&#244;ture des
RCG interviennent. En effet, elles permettent d&#8217;associer &#224; chaque forme une pseudo-grammaire
(une grammaire sans axiome) qui contient toutes les propri&#233;t&#233;s qui lui sont associ&#233;es, puis,
pour une phrase donn&#233;e, de constituer dynamiquement la grammaire qui pourra l&#8217;analyser en
regroupant sans les modifier les pseudo-grammaires associ&#233;es &#224; chaque mot de la phrase17
</p>
<p>17Plus pr&#233;cis&#233;ment, &#224; chaque mot susceptible d&#8217;&#234;tre dans la phrase, pour traiter les homonymes et d&#8217;autres
ph&#233;nom&#232;nes comme les locutions ou les mots compos&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les RCG comme formalisme grammatical pour la linguistique
</p>
<p>avec une grammaire-noyau. De plus, rien n&#8217;interdit que ces pseudo-grammaires, ainsi que
la grammaire-noyau, soient pr&#233;-compil&#233;es statiquement puis &#171;link&#233;es&#187; dynamiquement pour
construire tr&#232;s efficacement &#224; la vol&#233;e des grammaires locales d&#8217;analyse, par exemple phrase
par phrase. De fait, nous avons impl&#233;ment&#233; un tel m&#233;canisme pour g&#233;n&#233;rer des grammaires
avec une grammaire-noyau r&#233;duite et un lexique-jouet18.
</p>
<p>L&#8217;analyseur d&#233;velopp&#233; par Boullier permet de compiler des RCG d&#8217;une fa&#231;on qui rende l&#8217;ana-
lyse tr&#232;s efficace. De plus, il permet l&#8217;appel de pr&#233;dicats externes au sein des RCG. Il est donc
possible dans ce contexte de faire appel pour v&#233;rifier certains pr&#233;dicats &#224; d&#8217;autres m&#233;canismes
que des clauses RCG. Naturellement, ceci n&#8217;a d&#8217;int&#233;r&#234;t en termes de complexit&#233; que si l&#8217;on se
limite &#224; des m&#233;canismes exploitables en temps polynomial, et qui dont seraient exprimables &#224;
l&#8217;aide de RCG (il en est ainsi par exemple de certaines Logiques de Description). On peut envi-
sager de disposer d&#8217;une ontologie (ou une base de connaissances) pour v&#233;rifier certains pr&#233;di-
cats de s&#233;mantique lexicale (du type CONCRET (X) &#8594; COMESTIBLE(X)), voire pour
construire dynamiquement les pseudo-grammaires associ&#233;es &#224; chaque mot &#224; l&#8217;aide de clauses
sous-sp&#233;cifi&#233;es et de propri&#233;t&#233;s h&#233;rit&#233;es au sein de l&#8217;ontologie.
</p>
<p>Pour la construction d&#8217;une grammaire &#171;en vrai grandeur&#187;, les propri&#233;t&#233;s des RCG sont &#224; nou-
veau tr&#232;s int&#233;ressantes. En effet, un volume de travail consid&#233;rable a &#233;t&#233; fourni depuis de nom-
breuses ann&#233;es pour le d&#233;veloppement de grammaires &#224; large couverture dans d&#8217;autres for-
malismes. Or (Boullier, 1999a; Boullier, 2000b) montrent que l&#8217;on peut convertir le &#171;sque-
lette syntaxique&#187; (sans les traits) de ces grammaires en des RCG &#233;quivalentes manipulant les
m&#234;mes concepts linguistiques sous-jacents. Dans le cas g&#233;n&#233;ral, la conversion automatique des
contraintes sur les traits (&#233;quations fonctionnelles en LFG, par exemple) est de plus tout &#224; fait
envisageable, si elles sont de complexit&#233; polynomiale. Enfin, comme indiqu&#233; plus haut, les RCG
obtenues sont analysables avec la m&#234;me complexit&#233; qu&#8217;avec les analyseurs d&#233;di&#233;s des forma-
lismes sources. Tout ceci autorise le d&#233;veloppement de la grammaire-noyau non pas &#224; partir de
z&#233;ro, mais &#224; partir de la conversion en une RCG RCGbase d&#8217;une grammaire existante Gbase, et
en la compl&#233;tant (on peut penser par exemple &#224; une TAG ou &#224; une MCTAG). Cette compl&#233;tion
peut se faire soit en modifiant la grammaire convertie RCGbase, soit, profitant ainsi de la cl&#244;ture
des RCG par intersection, en &#233;crivant un axiome appelant d&#8217;une part l&#8217;axiome de RCGbase et
d&#8217;autre part, ind&#233;pendamment, celui d&#8217;une RCG compl&#233;mentaire RCGcompl (qui pourrait ap-
peler autant que n&#233;cessaire l&#8217;axiome de RCGbase). Cette deuxi&#232;me solution, plus simple dans
un premier temps, est cependant moins g&#233;n&#233;rale. Elle a l&#8217;avantage de permettre &#224; la grammaire
source Gbase d&#8217;&#233;voluer de son c&#244;t&#233; et d&#8217;&#234;tre convertie r&#233;guli&#232;rement en une nouvelle version de
RCGbase, sans que RCGcompl n&#8217;aie besoin d&#8217;&#234;tre modifi&#233;e.
</p>
<p>4 Conclusion
</p>
<p>Un certain nombre de ph&#233;nom&#232;nes linguistiques qui se rencontrent dans diverses langues in-
diquent que le pouvoir d&#8217;expression ad&#233;quat pour la description du langage naturel est celui
couvrant PTIME. Parmi les formalismes satisfaisant ce crit&#232;re, les Grammaires &#224; Concat&#233;nation
d&#8217;Intervalles (RCG) semblent bien les plus adapt&#233;es &#224; une utilisation linguistique. De fait, nous
avons sugg&#233;r&#233; comment quelques ph&#233;nom&#232;nes, comme les contraintes topologiques, la coordi-
</p>
<p>18On peut faire un parall&#232;le entre ces pseudo-grammaires et les &#171;supertags&#187;, et plus g&#233;n&#233;ralement avec toutes
les grammaires lexicalis&#233;es (ainsi LFG ou LTAG), tout en notant que la diff&#233;rence fondamentale avec ce qui se
passe dans ces formalismes est qu&#8217;ici ce ne sont pas des structures combin&#233;es par la grammaire ou des d&#233;corations
ajout&#233;es &#224; ces structures qui sont associ&#233;es aux &#233;l&#233;ments du lexique, mais bien des &#171;morceaux de grammaire&#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Pierre Boullier
</p>
<p>nation &#224; ellipse, le &#171;scrambling&#187;, ou l&#8217;interface entre syntaxe et s&#233;mantique lexicale, peuvent
&#234;tre trait&#233;s de fa&#231;on appropri&#233;e avec les RCG. De plus, les propri&#233;t&#233;s des RCG permettent
l&#8217;&#233;criture de grammaires modulaires, ouvrant ainsi la voie &#224; des grammaires dynamiques, is-
sues d&#8217;une grammaire noyau et de pseudo-grammaires associ&#233;es aux &#233;l&#233;ments du lexique, et
qui pourraient combiner entre autres les contraintes syntaxiques, morphologiques et de s&#233;man-
tique lexicale. Enfin, la conversion ais&#233;e et efficace de TAG existantes permet d&#8217;envisager le
d&#233;veloppement &#224; relativement court terme de RCG linguistiques op&#233;rationnelles.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BECKER T., JOSHI A., RAMBOW O. (1991), Long-distance scrambling and Tree Adjoining Grammars,
Actes de EACL-91, 21-26.
</p>
<p>BECKER T., RAMBOW O., NIV M. (1992), The derivational generative power of formal systems, or
scrambling is beyond LCFRS, Technical Report IRCS-92-38, University of Pennsylvania.
</p>
<p>BOULLIER P. (1999a), On Multicomponent-TAG Parsing, Actes de TALN-99, 321-326.
</p>
<p>BOULLIER P. (1999b), Chinese Numbers, MIX, Scrambling and Range Concatenation Grammars, Actes
de EACL-99, 53-60.
</p>
<p>BOULLIER P. (2000a), Range Concatenation Grammars, Actes de IWPT 2000, 53-64.
</p>
<p>BOULLIER P. (2000b), On TAG parsing, Traitement automatique des langues, Vol. 41 (3), 761-793.
</p>
<p>BOULLIER P. (2003), Counting with Range Concatenation Grammars, Theoretical Computer Science,
Vol. 293, 391-416.
</p>
<p>CL&#201;MENT L., GERDES K., KAHANE S. (2002), An LFG-type grammar for german based on the Topo-
logical Model, Actes de LFG &#8217;02, 116-129.
</p>
<p>GERDES K., KAHANE S. (2001), Word order in German : A formal dependency grammar using a topo-
logical hierarchy, Actes de ACL &#8217;01, 116-129.
</p>
<p>GROENINK A. (1996), Mild Context-Sensitivity and tuple-based generalizations of Context-Free Gram-
mar, Actes de MoL 4, Linguistics and Philosophy, num&#233;ro sp&#233;cial
</p>
<p>JOSHI A. (1985), How much context-sensitivity is necessary for assigning structural descriptions : Tree
Adjoining Grammars, Natural Language Processing, Cambridge University Press, New-York.
</p>
<p>KAJI Y., NAKANISHI R., SEKI H., KASAMI T. (1992), The Universal Recognition Problems for Parallel
Multiple Context-Free Grammars and for their Subclasses, IEICE, Vol. E75-D(4), 499-508.
</p>
<p>KALLMEYER L. (1997), Local Tree Description Grammars, Actes de MoL 5, 77-84.
</p>
<p>KALLMEYER L. (2003), Tree-local Multicomponent Tree Adjoining Grammars with Shared Nodes,
manuscrit disponible &#224; l&#8217;adresse http://talana.linguist.jussieu.fr/~lkallmey/.
</p>
<p>MANASTER-RAMER A. (1987), Dutch as a formal language, Linguistics and Philosophy, Vol. 10, 221-
246.
</p>
<p>MICHAELIS J., KRACHT M. (1996), Semilinearity as a Syntactic Invariant, Actes de LACL &#8217;96, Logical
Aspects of Computational Linguistics, Vol. 1328, 329-345.
</p>
<p>RADZINSKI D. (1991), Chinese number-names, Tree Adjoining Grammars, and Mild Context-
Sensitivity, Computational Linguistics, Vol. 17(3), 277-299.
</p>
<p>RAMBOW O. (1994), Multiset-Valued Linear Index Grammars &#8212; Imposing Dominance Constraints on
Derivations, Actes de ACL &#8217;94, 263-270.
</p>
<p>RAMBOW O., VIJAY-SHANKER K., WEIR D. (2001), D-Tree Substitution Grammars, Computational
Linguistics, Vol. 27(1), 87-121.
</p>
<p>SCHIEBER S. (1985), Evidence against the context-freeness of natural language, Linguistics and Philo-
sophy, Vol. 8, 333-343.</p>

</div></div>
</body></html>