<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers un statut de l&#8217;arbre de d&#233;rivation : exemples de construction de representations s&#233;mantiques pour les Grammaires d&#8217;Arbres Adjoints</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Vers un statut de l&#8217;arbre de d&#233;rivation : exemples de
construction de representations s&#233;mantiques pour les
</p>
<p>Grammaires d&#8217;Arbres Adjoints
</p>
<p>Sylvain Pogodalla
LORIA &#8211; Campus Scientifique
</p>
<p>BP239
F-54602 Vandoeuvre-l&#232;s-Nancy
</p>
<p>sylvain.pogodalla@loria.fr
</p>
<p>R&#233;sum&#233; &#8211; Abstract
</p>
<p>Cet article propose une d&#233;finition des arbres de d&#233;rivation pour les Grammaires d&#8217;Arbres Ad-
joints, &#233;tendant la notion habituelle. Elle est construite sur l&#8217;utilisation des Grammaires Cat&#233;-
gorielles Abstraites et permet de mani&#232;re sym&#233;trique le calcul de la repr&#233;sentation syntaxique
(arbre d&#233;riv&#233;) et le calcul de la repr&#233;sentation s&#233;mantique.
</p>
<p>This paper suggests a definition for Tree Adjoining Grammar derivation trees, extending the
usual notion. It results from using Abstract Categorial Grammars and enables, in a symmet-
ric way, the computation of both the syntactic representation (derived tree) and the semantic
representation.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>S&#233;mantique, grammaires d&#8217;arbre adjoints, grammaires cat&#233;gorielles, &#955;-calcul
Semantics, tree adjoining grammars, categorial grammars, &#955;-calculus
</p>
<p>1 Introduction
</p>
<p>Dans le processus de construction de la repr&#233;sentation s&#233;mantique d&#8217;une expression de la langue
naturelle, une approche importante consiste &#224; associer les r&#232;gles de combinaison syntaxique
et celles de combinaison s&#233;mantique. Si dans (Montague, 1974) la d&#233;finition du calcul syn-
taxique se pr&#234;te mal &#224; l&#8217;implantation, les principes sous-jacents sont &#224; la base de nombreux
autres travaux men&#233;s sur des formalismes syntaxiques plus &#233;labor&#233;s. Nous mentionnerons en
premier lieu les grammaires cat&#233;gorielles (Lambek, 1958; Moortgat, 1996), par le lien bas&#233;
sur l&#8217;homomorphisme de Curry-Howard qu&#8217;elles &#233;tablissent entre un calcul syntaxique logique
et un calcul s&#233;mantique bas&#233; sur le &#955;-calcul. Puis, les grammaires HPSG, avec les travaux
de (Copestake et al., 1999), ou LFG (Dalrymple, 1999).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Pogodalla
</p>
<p>Nous nous int&#233;ressons ici plus particuli&#232;rement aux travaux r&#233;alis&#233;s dans ce cadre pour les
grammaires d&#8217;arbres adjoint (TAG) (Joshi et al., 1975; Abeill&#233;, 1993). Le principe de ces
grammaires est de proposer un calcul d&#8217;arbres pr&#233;sentant deux op&#233;rations : l&#8217;adjonction et
la substitution. Ainsi, lors de l&#8217;analyse syntaxique d&#8217;une phrase, se construit l&#8217;arbre d&#233;riv&#233;,
r&#233;sultat du calcul de toutes ces op&#233;rations sur des arbres issus du lexique, les arbres initiaux
et les arbres auxiliaires. Cet arbre s&#8217;accompagne d&#8217;un autre arbre, l&#8217;arbre de d&#233;rivation qui
indique les op&#233;rations entre les arbres du lexiques par des fl&#232;ches orient&#233;es vers le bas s&#8217;il s&#8217;agit
de substitution et vers le haut s&#8217;il s&#8217;agit d&#8217;adjonction (exemple de la figure 1).
</p>
<p>Ce dernier arbre, en ce qu&#8217;il d&#233;crit les op&#233;rations de com-
</p>
<p>caboie
</p>
<p>cchien
</p>
<p>ctout
</p>
<p>Figure 1: Arbre de d&#233;rivation
</p>
<p>binaison entre les arbres, a g&#233;n&#233;ralement &#233;t&#233; pris comme
base dans les propositions de calcul de repr&#233;sentation s&#233;-
mantique pour les TAG (Schabes &amp; Shieber, 1994; Can-
dito &amp; Kahane, 1998; Kallmeyer, 2002; Joshi et al., 2003).
N&#233;anmoins, pour r&#233;pondre &#224; diverses contraintes, telle
celle de la repr&#233;sentation en Fran&#231;ais des quantificateurs
par des arbres auxiliaires, ces structures n&#233;cessitent d&#8217;&#234;tre
enrichie, sans que cela ne r&#232;gle tous les probl&#232;mes.
</p>
<p>(Gardent &amp; Kallmeyer, 2003) propose de r&#233;soudre ces probl&#232;mes en construisant directement
sur l&#8217;arbre d&#233;riv&#233; les repr&#233;sentations s&#233;mantiques, sans plus tenir compte de l&#8217;arbre de d&#233;riva-
tion. N&#233;anmoins se pose alors le probl&#232;me de l&#8217;attachement et de la r&#233;utilisation des repr&#233;sen-
tations ainsi construites.
</p>
<p>Dans cet article nous nous proposons de revenir sur la notion d&#8217;arbre de d&#233;rivation. S&#8217;inspirant
d&#8217;autres formalismes grammaticaux qui n&#8217;ont pas non plus de r&#232;gles syntagmatiques, la notion
que nous d&#233;finissons permet de consid&#233;rer de mani&#232;re &#233;quivalente la repr&#233;sentation syntaxique
et la repr&#233;sentation s&#233;mantique en tant que r&#233;sultat d&#8217;un processus sp&#233;cifi&#233; par l&#8217;arbre de d&#233;ri-
vation. La diff&#233;rence refl&#232;te alors simplement le choix de langages formels diff&#233;rents pour la
partie syntaxique (arbres) et la partie s&#233;mantique (langage de repr&#233;sentation sous-sp&#233;cifi&#233;), ainsi
que les d&#233;finitions lexicales.
</p>
<p>Pour ce faire, nous faisons appel au formalisme, introduit par (de Groote, 2001), des gram-
maires cat&#233;gorielles abstraites (ACG). Puis nous montrons comment y mod&#233;liser les TAG, puis
la s&#233;mantique LU (Bos, 1995). Enfin nous explorons sur quelques exemples les r&#233;sultats de cette
approche.
</p>
<p>2 Grammaires cat&#233;gorielles abstraites
</p>
<p>Les ACG, formalisme grammatical bas&#233; sur la logique lin&#233;aire (Girard, 1987), correspondent
plus &#224; un cadre grammatical dans lequel mod&#233;liser d&#8217;autres formalismes grammaticaux et leur
apporter ses outils que comme un nouveau formalisme grammatical. Ceci en raison des carac-
t&#233;ristiques suivantes :
</p>
<p>&#8226; chaque ACG engendre deux langages : un langage abstrait, qui peut &#234;tre vu comme
un ensemble abstrait de structures grammaticales, et un langage objet repr&#233;sentant les
formes r&#233;alis&#233;es des structures abstraites. Ici, le langage abstrait correspond &#224; la structure
grammaticale que l&#8217;on veut manipuler : l&#8217;arbre de d&#233;rivation. Il sera associ&#233;, par deux</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un statut de l&#8217;arbre de d&#233;rivation : exemples de construction de
representations s&#233;mantiques pour les Grammaires d&#8217;Arbres Adjoints
</p>
<p>ACG diff&#233;rentes, d&#8217;une part &#224; la r&#233;alisation syntaxique sous forme d&#8217;arbres de TAG et
d&#8217;autre part &#224; la r&#233;alisation s&#233;mantique sous forme de formules de LU ;
</p>
<p>&#8226; les ACG reposent sur un ensemble r&#233;duit de primitives math&#233;matiques, en particulier le
connecteur implicatif de la logique lin&#233;aire &#1;. Ce connecteur permet de repr&#233;senter
l&#8217;implication comme consommateur de ressources : lorsqu&#8217;une formule A est utilis&#233;e
avec une formule A &#1; B pour produire une formule B, les deux premi&#232;res formules
ne sont plus utilisables par la suite dans la preuve, contrairement &#224; la logique classique.
La cons&#233;quence de ce comportement est que les &#955;-termes associ&#233;s via l&#8217;isomorphisme de
Curry-Howard (Howard, 1980) sont dits lin&#233;aires, c&#8217;est-&#224;-dire que toute &#955;-abstraction lie
une et une seule variable.
</p>
<p>Dans (de Groote, 2001), les langages engendr&#233;s par les ACG sont des ensembles de &#955;-termes
lin&#233;aires. Ces derniers g&#233;n&#233;ralisent aussi bien les langages de cha&#238;nes de caract&#232;res que ceux
d&#8217;arbres. Cela suffit pour mod&#233;liser les TAG, c&#8217;est en revanche insuffisant pour la partie s&#233;man-
tique (par exemple la variable x est utilis&#233;e deux fois pour dire que l&#8217;individu qu&#8217;elle d&#233;note
est un chien chien(x) et qu&#8217;il est noir noir(x) dans l&#8217;expression chien noir). La motivation
principale pour se limiter au &#955;-calcul lin&#233;aire tient dans le principe sous-jacent d&#8217;analyse dans
ce cadre : il consiste en la r&#233;solution de probl&#232;mes de filtrage de &#955;-termes d&#8217;ordre sup&#233;rieur. Or
ce probl&#232;me pris dans toute sa g&#233;n&#233;ralit&#233; est difficile. Suivant les cas, il est ind&#233;cidable (Loader,
2003), de complexit&#233; encore inconnue (Dowek, 2001), ou d&#233;cidable. Pour le filtrage de &#955;-
termes lin&#233;aires, le probl&#232;me est NP-complet (de Groote, 2000), ce qui en fait un bon candidat
pour les langages des ACG.
</p>
<p>Toutefois, si l&#8217;on consid&#232;re pour le langage objet des termes du &#955;-calcul simplement typ&#233;, avec
certaines conditions sur le lexique, la propri&#233;t&#233; de d&#233;cidabilit&#233; est conserv&#233;e (le probl&#232;me est
ramen&#233; &#224; un probl&#232;me de recherche de preuve dans le fragment multiplicatif de la logique
lin&#233;aire, qui est d&#233;cidable). Nous n&#8217;approfondirons pas ce point, mais c&#8217;est le cas pour les
ACG que nous consid&#233;rons ici. Par ailleurs, le probl&#232;me ne se poserait que pour passer de la
repr&#233;sentation s&#233;mantique &#224; la repr&#233;sentation syntaxique (g&#233;n&#233;ration), l&#8217;analyse s&#233;mantique ne
posant pas ces probl&#224;mes de d&#233;cidabilit&#233;.
</p>
<p>Pour les d&#233;finitions pr&#233;cises des ACG, nous renvoyons le lecteur &#224; (de Groote, 2001). Toutefois,
certaines notions sont un peu diff&#233;rentes et nous les red&#233;finissons ici.
</p>
<p>Definition 1 (Types). Soit A un ensemble de types atomiques. L&#8217;ensemble T (A) des types
construits sur A est d&#233;fini par : T (A) ::= A|A &#8594; T (A)|T (A)&#1; T (A)
L&#8217;ensemble des types t &#8712; T (A) tels que le symbole &#8594; n&#8217;appara&#238;t pas dans t est l&#8217;ensemble
des types lin&#233;aires implicatifs, not&#233; TL(A). Les autres renvoie au &#955;-calcul simplement typ&#233;
habituel.
</p>
<p>Definition 2 (Signature d&#8217;ordre sup&#233;rieur). Une signature d&#8217;ordre sup&#233;rieure est un triplet
&#931; = &#12296;A,C, &#964;&#12297; o&#249; :
</p>
<p>&#8226; A est un ensemble de types atomiques ;
&#8226; C est un ensemble fini de constantes ;
&#8226; &#964; : C &#8594; T (A) qui assigne &#224; chaque constante de C un type.
</p>
<p>Si &#964; : C &#8594; TL(A), la signature est dite lin&#233;aire.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Pogodalla
</p>
<p>L&#8217;ensemble des termes typ&#233;s &#923;(&#931;) est d&#233;fini de mani&#232;re habituelle, avec l&#8217;aide de la logique
lin&#233;aire pour manipuler aussi bien des termes lin&#233;aires que non lin&#233;aires. Nous utilisons ici les
deux implications lin&#233;aire&#1; et intuitionniste &#8594;. Ceci est permis par le codage de la logique
intuitionniste en logique lin&#233;aire par la traduction A &#8594; B &#8801; (!A)&#1; B (Girard, 1987; Danos
&amp; Cosmo, 1992). Cela signifie qu&#8217;une variable de type &#945; dans un terme de type &#945; &#8594; &#946; pourra
&#234;tre abstraite plusieurs fois (mais, ici, au moins une), alors qu&#8217;elles ne l&#8217;est qu&#8217;une et une seule
fois dans un terme de type &#945;&#1; &#946;.
</p>
<p>Definition 3 (Lexique). &#201;tant donn&#233;s une signature lin&#233;aire d&#8217;ordre sup&#233;rieur &#931;1 = &#12296;A1, C1, &#964;1&#12297;
et une signature d&#8217;ordre sup&#233;rieur &#931;2 = &#12296;A2, C2, &#964;2&#12297;, un lexique L de &#931;1 vers &#931;2 est une paire
L = &#12296;F,G&#12297; telle que :
</p>
<p>&#8226; F : A1 &#8594; T (A2) est une fonction d&#8217;interpr&#233;tation des types atomiques de &#931;1 comme
des types implicatifs construits &#224; partir de A2. On appellera F &#233;galement l&#8217;extension
homomorphique de F &#224; tous les types de T (A1) ;
</p>
<p>&#8226; G : C1 &#8594; &#923;(&#931;2) est une fonction d&#8217;interpr&#233;tation des constantes de &#931;1 comme des
&#955;-termes construits &#224; partir de &#931;2. On appellera G son extension homomorphique ;
</p>
<p>&#8226; les fonctions d&#8217;interpr&#233;tation sont compatibles avec la relation de typage, c&#8217;est-&#224;-dire
que pour tout c &#8712; C1,G(c) : F (&#964;1(c)) (le type de l&#8217;image de c est l&#8217;image du type de c).
</p>
<p>Dans la suite, on utilisera L(a) pour F (a) ou G(a) suivant le contexte.
Definition 4 (Grammaire cat&#233;gorielle abstraite). Une grammaire cat&#233;gorielle abstraite est un
quadruplet G = &#12296;&#931;1,&#931;2,L, s&#12297; o&#249; :
</p>
<p>&#8226; &#931;1 est une signature lin&#233;aire d&#8217;ordre sup&#233;rieure, et &#931;2 une signature d&#8217;ordre sup&#233;rieure.
Ils sont appel&#233;s vocabulaire abstrait et vocabulaire objet ;
</p>
<p>&#8226; L : &#931;1 &#8594; &#931;2 est un lexique ;
&#8226; s est un type atomique du vocabulaire abstrait, appel&#233; le type distingu&#233; de la grammaire.
</p>
<p>Definition 5 (Langages abstrait et objet). Soit G = &#12296;&#931;1,&#931;2,L, s&#12297; une grammaire cat&#233;gorielle
abstraite.
</p>
<p>1. Le langage abstrait A(G) engendr&#233; par G est d&#233;fini par A(G) = {t &#8712; &#923;(&#931;1)|t : s}
2. Le langage objet O(G) engendr&#233; par G est d&#233;fini par
O(G) = {t &#8712; &#923;(&#931;2)|&#8707;u &#8712; A(G) avec t = L(u)}
</p>
<p>3 Les grammaires d&#8217;arbres adjoints comme une ACG
</p>
<p>Dans cette section, nous allons montrer comment une grammaire TAG peut &#234;tre mod&#233;lis&#233;e avec
une ACG. Nous reprenons cette mod&#233;lisation de (de Groote, 2002).
</p>
<p>Soit G = &#12296;&#931;, N, I, A, S&#12297; une TAG. &#931;, N , I , A et S sont respectivement l&#8217;ensemble des sym-
boles terminaux, des symboles non terminaux, l&#8217;ensemble des arbres initiaux et auxiliaires et
le symbole non terminal distingu&#233; de la grammaire. GG = &#12296;&#931;GDT,&#931;GTAG,LG, sG&#12297; la grammaire
cat&#233;gorielle abstraite associ&#233;e est construite de la mani&#232;re suivante :
</p>
<p>&#931;GDT : &#224; partir de G, on d&#233;finit :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un statut de l&#8217;arbre de d&#233;rivation : exemples de construction de
representations s&#233;mantiques pour les Grammaires d&#8217;Arbres Adjoints
</p>
<p>&#8226; AGDT = {&#945;S, &#945;A|&#945; &#8712; N}
&#8226; CGDT = {cT |T &#8712; I} &#8746; {cT |T &#8712; A} &#8746; {I&#945;|&#945; &#8712; N} avec
</p>
<p>&#8211; si T &#8712; I alors cT : &#947;1A&#1; &#183; &#183; &#183; &#947;mA&#1; &#946;1S &#1; &#183; &#183; &#183; &#946;nS &#1; &#945;S o&#249; &#945; est la racine
de T , les &#947;i ses n&#339;uds int&#233;rieurs et les &#946;i ses n&#339;uds o&#249; les substitutions ont lieu
</p>
<p>&#8211; si T &#8712; A alors cT : &#947;1A &#1; &#183; &#183; &#183; &#947;mA &#1; &#946;1S &#1; &#183; &#183; &#183; &#946;nS &#1; &#945;A &#1; &#945;A o&#249; &#945; est
la racine de T , les &#947;i ses n&#339;uds int&#233;rieurs et les &#946;i ses n&#339;uds o&#249; les substitutions
ont lieu
</p>
<p>&#8211; I&#945; est de type &#945;A
</p>
<p>&#931;GTAG : &#224; partir de G, on d&#233;finit :
</p>
<p>&#8226; AGTAG = {&#964;} o&#249; &#964; repr&#233;sentera le type arbre
&#8226; CGTAG est constitu&#233; de
</p>
<p>&#8211; pour chaque terminal u de &#931;, une constante u de type &#964;
&#8211; pour chaque non terminal &#945;, des constantes &#945;i : &#964; &#1; &#183; &#183; &#183;&#1; &#964;
</p>
<p>&#65080; &#65079;&#65079; &#65080;
</p>
<p>i fois
</p>
<p>&#1; &#964; pour
</p>
<p>1 &#8804; i &#8804; k&#945;, avec k&#945; le nombre maximum de fils que peut avoir un n&#339;ud
&#233;tiquet&#233; &#945; dans G
</p>
<p>Il reste maintenant &#224; d&#233;finir le lexique. Plut&#244;t que de le d&#233;finir dans sa g&#233;n&#233;ralit&#233;, nous don-
nerons les principes de construction &#224; partir des arbres du tableau 1. On a alors :
</p>
<p>&#8226; aux types &#945;S sont associ&#233;s le type &#964; , c&#8217;est-&#224;-dire qu&#8217;ils correspondent &#224; des arbres ;
&#8226; aux types &#945;A sont associ&#233;s le type &#964; &#1; &#964; , c&#8217;est-&#224;-dire qu&#8217;ils correspondent &#224; des fonc-
</p>
<p>tions transformant un arbre en arbre ;
&#8226; aux constantes I&#945; correspondent &#224; l&#8217;identit&#233; &#955;x.x.
</p>
<p>N
</p>
<p>chat
</p>
<p>N
</p>
<p>tout N&#8727;
</p>
<p>S
</p>
<p>N VP
</p>
<p>chasse N
</p>
<p>N
</p>
<p>chien
</p>
<p>N
</p>
<p>un N&#8727;
</p>
<p>N VP
</p>
<p>aboie
</p>
<p>S
</p>
<p>VP
</p>
<p>VP&#8727; habituellement
</p>
<p>Table 1: Exemple de lexique TAG
Un arbre tel que celui de aboie est appel&#233; &#224; &#234;tre d&#233;fini de la mani&#232;re suivante : S2N(VP1 aboie)
c&#8217;est-&#224;-dire que S2 a deux fils : N et un deuxi&#232;me qui est lui-m&#234;me un arbre de racine VP1 qui
a un seul fils aboie. Compte tenu de la substitution possible en N , mais aussi des adjonctions,
en particulier en VP, le lexique lui associe la forme &#955;V &#955;N.S2N(V (VP1 aboie)). En effet, si
un arbre T , de habituellement, est adjoint en VP1, T prend l&#8217;arbre de racine VP1 et l&#8217;ajoute &#224;
lui-m&#234;me, au niveau de son fils gauche, pour former un nouvel arbre. Autrement dit, T est de
la forme &#955;x.VP2x habituellement , un terme d&#8217;ordre sup&#233;rieur qui transforme un arbre en un
autre arbre.
</p>
<p>Cela nous conduit par exemple au lexique d&#8217;ACG du tableau 21. On laissera le lecteur v&#233;rifier
que le typage des termes est correct.
</p>
<p>1Pour des raisons de concision, on omet les n&#339;uds habituels Det, V, etc. Pour les m&#234;mes raisons, on supprime
comme param&#232;tres les n&#339;uds sur lesquels il n&#8217;y aura pas d&#8217;adjonction dans les exemple (on pourrait sinon les
neutraliser en leur appliquant I&#945;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Pogodalla
</p>
<p>Constante c son type
cchien : NA&#1; NS
cchat : NA&#1; NS
ctout : NA
cun : NA
caboie : VPA&#1; NS &#1; SS
cchasse : VPA&#1; NS &#1; NS &#1; SS
chabituellement : VPA&#1; VPA
</p>
<p>c&#8242; = L(c) &#8712; &#923;(&#931;TAG)
c&#8242;chien = &#955;N.N(N1 chien) : (&#964; &#1; &#964;)&#1; &#964;
c&#8242;chat = &#955;N.N(N1 chat) : (&#964; &#1; &#964;)&#1; &#964;
c&#8242;tout = &#955;x.N2 tout x : &#964; &#1; &#964;
c&#8242;un = &#955;x.N2 un x : &#964; &#1; &#964;
c&#8242;aboie = &#955;V.&#955;x.S2x(V (VP1aboie)) : (&#964; &#1; &#964;)&#1; &#964; &#1; &#964;
c&#8242;chasse = &#955;V.&#955;x.&#955;y.S2x(V (VP2chasse y)) : (&#964; &#1; &#964;)&#1; &#964; &#1; &#964; &#1; &#964;
c&#8242;habituellement = &#955;V.&#955;x.V (VP2x habituellement ) : (&#964; &#1; &#964;)&#1; (&#964; &#1; &#964;)
</p>
<p>Table 2: Lexique de GG
</p>
<p>En neutralisant les n&#339;uds sur lesquels aucune adjonction n&#8217;est faite par la constante I&#945; corre-
spondante, on a alors par exemple la correspondance entre les termes du langage abstrait de
&#923;(&#931;DT) et les termes du langage objet de &#923;(&#931;TAG) du tableau 3.
</p>
<p>&#923;(&#931;DT) : caboieIVP(cchienctout) cchasseIVP(cchienctout)(cchatcun)
</p>
<p>&#923;(&#931;TAG) :
</p>
<p>S
</p>
<p>VPN
</p>
<p>aboieNtout
</p>
<p>chien
</p>
<p>S
</p>
<p>N VP
</p>
<p>tout chasseN
</p>
<p>chien
</p>
<p>N
</p>
<p>un N
</p>
<p>chat
</p>
<p>Table 3: Exemple de termes abstraits et des arbres d&#233;riv&#233;s correspondants dans G
Remarquons que le terme caboieIVP(cchienctout) peut s&#8217;&#233;crire sous forme d&#8217;arbre foncteurs-arguments.
Sur cet arbre, si l&#8217;on supprime les liens vers les arguments I&#945; qui indiquent simplement que cer-
tains n&#339;uds n&#8217;ont fait l&#8217;objet d&#8217;aucune adjonction, et si l&#8217;on indique le typage de l&#8217;argument
par l&#8217;orientation de la fl&#232;che, avec une fl&#232;che orient&#233;e vers le bas si l&#8217;argument est de type &#945;S
et vers le haut si l&#8217;argument est de type &#945;A, on obtient bien l&#8217;arbre de d&#233;rivation traditionnel de
la figure 1.
</p>
<p>Avec une telle traduction, on a le th&#233;or&#232;me suivant (de Groote, 2002) : soit G une TAG. Le
langage d&#8217;arbre engendr&#233; par G est isomorphe aux langages objet de l&#8217;ACG GG.
Alors que l&#8217;arbre de d&#233;rivation n&#8217;est g&#233;n&#233;ralement utilis&#233; que dans le cadre s&#233;mantique, nous
voyons ici que l&#8217;on peut lui donner un statut utile au calcul de l&#8217;arbre d&#233;riv&#233;, c&#8217;est-&#224;-dire
au cadre syntaxique. Dans la section suivante, nous allons montrer comment, en utilisant</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un statut de l&#8217;arbre de d&#233;rivation : exemples de construction de
representations s&#233;mantiques pour les Grammaires d&#8217;Arbres Adjoints
</p>
<p>comme notion d&#8217;arbre de d&#233;rivation les termes du langage abstrait &#923;(&#931;DT), peut se constru-
ire la repr&#233;sentation s&#233;mantique associ&#233;e aux arbres d&#233;riv&#233;s. En particulier, nous reprenons
le principe d&#8217;&#233;l&#233;vation de type utilis&#233; pour les arbres adjoints, qui leur donne un type d&#8217;ordre
sup&#233;rieur.
</p>
<p>4 La s&#233;mantique LU comme une ACG
</p>
<p>Le choix de la repr&#233;sentation s&#233;mantique pour notre exp&#233;rimentation se rapproche de celui fait
dans diff&#233;rents articles sur la repr&#233;sentation s&#233;mantique en TAG, en particulier (Kallmeyer,
2002; Gardent &amp; Kallmeyer, 2003). Il s&#8217;agit de la s&#233;mantique sous-sp&#233;cifi&#233;e LU dite &#171; &#224;
trou &#187; (Bos, 1995; Blackburn &amp; Bos, 2003). Nous renvoyons le lecteur &#224; ces deux r&#233;f&#233;rences
pour les d&#233;tails.
</p>
<p>Le principe de LU est de sp&#233;cifier entre diff&#233;rentes formules les relations de sous-formule. Ainsi,
la formule de LU associ&#233;e &#224; l&#8217;expression tout chien chasse un chat :
</p>
<p>&#955;hl.&#8707;h1l1l2l3v1(h &#8805; l2 &#8743; l2 : All(v1, l3) &#8743; l3 : Imp(l1, h1) &#8743; h1 &#8805; l &#8743; h &#8805; l1 &#8743; l1 : chien(v1)
&#8743;&#8707;h&#8242;1l&#8242;1l&#8242;2l&#8242;3v&#8242;1(h &#8805; l&#8242;2 &#8743; l&#8242;2 : Ex(v&#8242;1, l&#8242;3) &#8743; l&#8242;3 : And(l&#8242;1, h&#8242;1) &#8743; h&#8242;1 &#8805; l &#8743; h &#8805; l&#8242;1 &#8743; l&#8242;1 : chat(v&#8242;1)
&#8743;h &#8805; l &#8743; l : chasse(v1, v&#8242;1)))
</p>
<p>sp&#233;cifie que la formule &#233;tiquet&#233;e par l (l : chasse(v1, v&#8242;1)) soit sous-formule de celle &#233;tiquet&#233;e
par l2 (car h1 &#8805; l, et h1 sous-formule de Imp(l1, h1) &#233;tiquet&#233;e par l3, elle-m&#234;me sous-formule
de All(v1, l3) d&#8217;&#233;tiquette l2). De la m&#234;me mani&#232;re, elle doit &#234;tre sous-formule de Ex(v&#8242;1, l
</p>
<p>&#8242;
3)
</p>
<p>&#233;tiquet&#233;e par l&#8242;2 (via h
&#8242;
1 &#8805; l et l&#8242;3).
</p>
<p>Cela donne deux formules de la logique de pr&#233;dicats possibles qui v&#233;rifient cette sp&#233;cification :
</p>
<p>All(x, Imp(man(x), Ex(y, And(woman(y), love(x, y)))))
Ex(y, And(woman(y), All(x, Imp(man(x), love(x, y)))))
</p>
<p>ou, exprim&#233;es dans la logique des pr&#233;dicats usuelle :
</p>
<p>&#8704;x(man(x) &#8658; &#8707;y(woman(y) &#8743; love(x, y)))
&#8707;y(woman(y) &#8743; &#8704;x(man(x) &#8658; love(x, y)))
</p>
<p>Ici, nous ne nous int&#233;ressons pas &#224; trouver les formules de la logiques des pr&#233;dicats qui sat-
isfont les formule de LU. Nous ne faisons que construire des formules de LU. Pour ce faire,
nous utiliserons une signature d&#8217;ordre sup&#233;rieure &#931;LU = &#12296;ALU , CLU , &#964;LU&#12297; d&#233;finie de la mani&#232;re
suivante2 :
</p>
<p>&#8226; ALU = {h, l, t, p, e} sont les types repr&#233;sentant respectivement les trous, les &#233;tiquettes, les
descriptions d&#8217;arbre, les pr&#233;dicats et les entit&#233;s (t et e sont choisis pour l&#8217;analogie avec la
s&#233;mantique de Montague, en particulier pour l&#8217;&#233;l&#233;vation de type) ;
</p>
<p>&#8226; CLU et &#964;LU sont d&#233;finis par les tableau 4 et trois quantificateurs existentiels &#8707;l : (l &#8594;
t) &#1; t, &#8707;h : (h &#8594; t) &#1; t et &#8707;e : (e &#8594; t) &#1; t, tous not&#233;s par abus de langage &#8707;, et
dont l&#8217;interpr&#233;tation intuitive est que &#8707;P est une description d&#8217;arbre satisfiable s&#8217;il existe
x respectivement &#233;tiquette, trou ou individu, P x est satisfiable. Par abus de notation
toujours, on notera &#8707;xP pour &#8707;(&#955;x.P ) o&#249; x est une variable libre de P .</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Pogodalla
</p>
<p>&#8805; : h &#8594; l &#8594; t pour sp&#233;cifier les relations de dominance large entre trous
et &#233;tiquettes
</p>
<p>: : l &#8594; p&#1; t permet d&#8217;&#233;tiqueter des pr&#233;dicats
&#8743; : t&#1; t&#1; t permet la conjonction de descriptions
All, Ex : e &#8594; l &#8594; t destin&#233; &#224; &#234;tre interpr&#233;t&#233; comme les quantifications uni-
</p>
<p>verselle et existentielle
And, Imp : l &#8594; h &#8594; p destin&#233; &#224; &#234;tre interpr&#233;t&#233; comme la conjonction et
</p>
<p>l&#8217;implication
chien, chat,
aboie
</p>
<p>: e &#8594; p Pr&#233;dicats habituels
</p>
<p>chasse : e &#8594; e &#8594; p
habituellement : h &#8594; p
</p>
<p>Table 4: D&#233;finition de la signature pour le langage de sous-sp&#233;cification
</p>
<p>Pour utiliser &#931;LU , il reste &#224; d&#233;finir une ACG &#12296;&#931;DT,&#931;LU ,L&#12297;, avec L un lexique qui lie les termes
abstraits des arbres de d&#233;rivation aux termes des descriptions d&#8217;arbre. On aura bien entendu
pour tout c, L(c) = c&#8242;&#8242; dans le tableau 5, avec pour la transformation des types atomiques :
L(NS) = (e &#8594; h &#8594; l &#8594; t)&#1; (h &#8594; l &#8594; t) L(V PA) = (h &#8594; l &#8594; t)&#1; (h &#8594; l &#8594; t)
L(SS) = h &#8594; l &#8594; t L(NA) = (e &#8594; h &#8594; l &#8594; t)&#1; (e &#8594; h &#8594; l &#8594; t)&#1; (h &#8594; l &#8594; t)
</p>
<p>c&#8242;&#8242;chien = &#955;q.q(&#955;xhl.h &#8805; l &#8743; l : chien(x))
c&#8242;&#8242;chat = &#955;q.q(&#955;xhl.h &#8805; l &#8743; l : chat(x))
c&#8242;&#8242;aboie = &#955;adv&#955;s.s(&#955;x.adv(&#955;hl.h &#8805; l &#8743; l : aboie(x)))
c&#8242;&#8242;chasse = &#955;adv&#955;s&#955;o.s(&#955;x.adv(o(&#955;yh
</p>
<p>&#8242;l&#8242;.h&#8242; &#8805; l&#8242; &#8743; l&#8242; : chasse(x, y))))
c&#8242;&#8242;tout = &#955;rp.&#955;hl.&#8707;h1l1l2l3v1(h &#8805; l2 &#8743; l2 : All(v1, l3) &#8743; l3 : Imp(l1, h1)
</p>
<p>&#8743;h1 &#8805; l &#8743; r v1 h l1 &#8743; p v1 h l)
c&#8242;&#8242;un = &#955;rp.&#955;h&#8242;l&#8242;.&#8707;h&#8242;1l&#8242;1l&#8242;2l&#8242;3v&#8242;1(h&#8242; &#8805; l&#8242;2 &#8743; l&#8242;2 : Ex(v&#8242;1, l&#8242;3) &#8743; l&#8242;3 : And(l&#8242;1, h&#8242;1)
</p>
<p>&#8743;h&#8242;1 &#8805; l&#8242; &#8743; r v&#8242;1 h&#8242; l&#8242;1 &#8743; p v&#8242;1 h&#8242; l&#8242;)
c&#8242;&#8242;habituellement = &#955;adv.&#955;r.&#955;hl.&#8707;h1l1(r h l &#8743; h &#8805; l1 &#8743; l1 : habituellement(h1)
</p>
<p>&#8743;h1 &#8805; l &#8743; adv(&#955;h&#8242;l&#8242;.h&#8242; &#8805; l&#8242;)h l1)
</p>
<p>Table 5: Quelques repr&#233;sentations s&#233;mantiques
</p>
<p>Nous ne pouvons pas d&#233;tailler ici les calculs, mais ce lexique rend compte de l&#8217;ambigu&#239;t&#233; de
port&#233;e des quantificateurs, en calculant par exemple
</p>
<p>c&#8242;&#8242;chienc
&#8242;&#8242;
tout = &#955;phl.&#8707;h1l1l2l3v1(h &#8805; l2 &#8743; l2 : All(v1, l3) &#8743; l3 : Imp(l1, h1)
</p>
<p>&#8743;h1 &#8805; l &#8743; h &#8805; l1 &#8743; l1 : chien(v1) &#8743; p v1 h l)
c&#8242;&#8242;chatc
</p>
<p>&#8242;&#8242;
un = &#955;ph
</p>
<p>&#8242;l&#8242;.&#8707;h&#8242;1l&#8242;1l&#8242;2l&#8242;3v&#8242;1(h&#8242; &#8805; l&#8242;2 &#8743; l&#8242;2 : Ex(v&#8242;1, l&#8242;3) &#8743; l&#8242;3 : And(l&#8242;1, h&#8242;1)
&#8743;h&#8242;1 &#8805; l&#8242; &#8743; h&#8242; &#8805; l&#8242;1 &#8743; l&#8242;1 : chat(v&#8242;1) &#8743; p v&#8242;1 h&#8242; l&#8242;)
</p>
<p>L(cchasseIV P (cchienctout)(cchatcun)) = c&#8242;&#8242;chasseIV P (c&#8242;&#8242;chienc&#8242;&#8242;tout)(c&#8242;&#8242;chatc&#8242;&#8242;un)
= &#955;hl.&#8707;h1l1l2l3v1(h &#8805; l2 &#8743; l2 : All(v1, l3) &#8743; l3 : Imp(l1, h1)
&#8743;h1 &#8805; l &#8743; h &#8805; l1 &#8743; l1 : chien(v1) &#8743; &#8707;h&#8242;1l&#8242;1l&#8242;2l&#8242;3v&#8242;1(h &#8805; l&#8242;2
&#8743;l&#8242;2 : Ex(v&#8242;1, l&#8242;3) &#8743; l&#8242;3 : And(l&#8242;1, h&#8242;1) &#8743; h&#8242;1 &#8805; l &#8743; h &#8805; l&#8242;1
&#8743;l&#8242;1 : chat(v&#8242;1) &#8743; h &#8805; l &#8743; l : chasse(v1, v&#8242;1)))
</p>
<p>o&#249; le pr&#233;dicat chasse(v1, v&#8242;1), &#233;tiquet&#233; par l, est domin&#233; &#224; la fois par l2 et l
&#8242;
2, ces deux quantifi-
</p>
<p>2Nous remarquons que cette fois nous utilisons des termes non lin&#233;aires : si &#955;x.P : &#945; &#8594; &#946; alors x est une
variable libre de P qui y appara&#238;t une ou plusieurs fois.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un statut de l&#8217;arbre de d&#233;rivation : exemples de construction de
representations s&#233;mantiques pour les Grammaires d&#8217;Arbres Adjoints
</p>
<p>cateurs n&#8217;&#233;tant pas ordonn&#233;s l&#8217;un par rapport &#224; l&#8217;autre.
</p>
<p>On peut de la m&#234;me mani&#232;re tenir compte de l&#8217;ambigu&#239;t&#233; introduite par les adverbes. Ainsi,
on remarquera que le terme associ&#233; &#224; c&#8242;&#8242;habituellement agit comme un adverbe opaque : si un autre
adverbe lui est adjoint (le param&#232;tre adv), son champ dominera l1 : habituellement(h1). Cela
rend compte de ce que si un autre adverbe est ajout&#233;, habituellement restera toujours dans son
champs. Pour lever cette opacit&#233;, il suffirait que l&#8217;adverbe adv ne domine que le label du verbe,
soit l.
</p>
<p>5 Conclusion
</p>
<p>Revenant sur les diverses approches pour construire une repr&#233;sentation s&#233;mantique en TAG,
nous avons propos&#233; de donner un r&#244;le central &#224; l&#8217;arbre de d&#233;rivation. Ce dernier est pris au
sens de terme du langage abstrait de l&#8217;ACG associ&#233;e &#224; la grammaire TAG, plus large que le
sens traditionnel. D&#232;s lors, la repr&#233;sentation syntaxique (arbre d&#233;riv&#233;) comme la repr&#233;sentation
s&#233;mantique s&#8217;obtiennent au bout d&#8217;un processus de calcul d&#233;crit par l&#8217;arbre de d&#233;rivation.
</p>
<p>Si la partie syntaxique a &#233;t&#233; montr&#233;e comme compl&#232;te vis-&#224;-vis du langage d&#8217;arbre engen-
dr&#233; (de Groote, 2002), nous n&#8217;avons donn&#233; ici que quelques exemples de la pertinence de notre
approche pour le calcul s&#233;mantique en TAG. Il s&#8217;agit de poursuivre cet effort et de v&#233;rifier com-
ment mod&#233;liser les diff&#233;rents ph&#233;nom&#232;nes identifi&#233;s comme probl&#233;matiques dans (Kallmeyer,
2002; Frank &amp; van Genabith, 2001; Gardent &amp; Kallmeyer, 2003), en particulier pour les verbes
&#224; contr&#244;le. N&#233;anmoins nous avons montr&#233; que les arbres de d&#233;rivation suffisent pour rendre
compte du r&#244;le s&#233;mantique des quantificateurs, m&#234;me en les repr&#233;sentant par des arbres ad-
joints.
</p>
<p>Enfin, nous n&#8217;avons pas tenu compte des contr&#244;les induits sur la d&#233;rivation par la pr&#233;sence
des traits. Pour ce faire, il sera sans doute n&#233;cessaire d&#8217;&#233;largir encore le langage de &#955;-termes
en faisant intervenir les types additifs de la logique lin&#233;aire, de la m&#234;me mani&#232;re qu&#8217;ils sont
utilis&#233;s pour mod&#233;liser les traits dans les grammaires de types logique (Morrill, 1994).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A. (1993), Les nouvelles syntaxes, Paris, Armand Colin &#201;diteur.
</p>
<p>BLACKBURN P., BOS J. (2003), Computational semantics for natural language, http://www.
iccs.informatics.ed.ac.uk/~jbos/comsem/book1.html, Course Notes for NASSLLI
2003.
</p>
<p>BOS J. (1995), Predicate logic unplugged, Proceedings of the Tenth Amsterdam Colloquium.
</p>
<p>CANDITO M.-H., KAHANE S. (1998), Can the tag derivation tree represent a semantic graph? an
answer in the light of meaning-text theory, Proceedings of the Fourth International Workshop on Tree
Adjoining Grammars and Related Framework (TAG+4), volume 98-12 of IRCS Technical Report Series.
</p>
<p>COPESTAKE A., FLICKINGER D., SAG I., POLLARD C. (1999), Minimal recursion semantics: An
introduction, http://www-csli.stanford.edu/~aac/papers/newmrs.pdf.
</p>
<p>M. DALRYMPLE, Ed. (1999), Semantics and Syntax in Lexical Functional Grammar: The Resource
Logic Approach, MIT Press.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Pogodalla
</p>
<p>DANOS V., COSMO R. D. (1992), The linear logic primer, http://www.pps.jussieu.fr/
~dicosmo/CourseNotes/LinLog/, An introductory course on Linear Logic.
</p>
<p>DE GROOTE P. (2000), Linear higher-order matching is np-complete, dans L. BACHMAIR, Ed., Rewrit-
ing Techniques and Applications, RTA&#8217;00, volume 1833 of LNCS, p. 127&#8211;140, Springer.
</p>
<p>DE GROOTE P. (2001), Towards abstract categorial grammars, Association for Computational Linguis-
tics, 39th Annual Meeting and 10th Conference of the European Chapter, Proceedings of the Conference,
p. 148&#8211;155.
</p>
<p>DE GROOTE P. (2002), Tree-adjoining grammars as abstract categorial grammars, TAG+6, Proceedings
of the sixth International Workshop on Tree Adjoining Grammars and Related Frameworks, p. 145&#8211;150,
Universit&#224; di Venezia.
</p>
<p>DOWEK G. (2001), Higher-order unification and matching, dans A. ROBINSON &amp; A. VORONKOV,
Eds., Handbook of Automated Reasoning, volume 2, chapter 16, Elsevier Science.
</p>
<p>FRANK A., VAN GENABITH J. (2001), Glue tag: Linear logic based semantics construction for
ltag - and what it teaches us about the relation between lfg and ltag, dans M. BUTT &amp; T. H.
KING, Eds., Proceedings of the LFG &#8217;01 Conference, Online Proceedings, CSLI Publications, http:
//cslipublications.stanford.edu/LFG/6/lfg01.html.
</p>
<p>GARDENT C., KALLMEYER L. (2003), Semantic construction in feature-based tag, Proceedings of the
10th Meeting of the European Chapter of the Association for Computational Linguistics (EACL).
</p>
<p>GIRARD J.-Y. (1987), Linear logic, Theoretical Computer Science, Vol. 50, 1&#8211;102.
</p>
<p>J. R. HINDLEY &amp; J. P. SELDIN, Eds. (1980), To H. B. Curry: Essays on combinatory logic, Lambda
Calculus and Formalism, Academic Press.
</p>
<p>HOWARD W. A. (1980), The Formul&#230;-as-Types Notion of Construction, p. 479&#8211;490, dans (Hindley &amp;
Seldin, 1980).
</p>
<p>JOSHI A. K., KALLMEYER L., ROMERO M. (2003), Flexible composition in ltag: Quantifier scope
and inverse linking, dans H. BUNT, I. VAN DER SLUIS &amp; R. MORANTE, Eds., Proceedings of the Fifth
International Workshop on Computational Semantics IWCS-5.
</p>
<p>JOSHI A. K., LEVY L. S., TAKAHASHI M. (1975), Tree adjunct grammars, Journal of Computer and
System Sciences, Vol. 10(1), 136&#8211;163.
</p>
<p>KALLMEYER L. (2002), Using an enriched tag derivation structure as basis for semantics, Proceedings
of the Sixth International Workshop on Tree Adjoining Grammar and Related Frameworks (TAG+6).
</p>
<p>LAMBEK J. (1958), The mathematics of sentence structure, American Mathematical Monthly,
Vol. 65(3), 154&#8211;170.
</p>
<p>LOADER R. (2003), Higher order &#946; matching is undecidable, Logic Journal of the IGPL, Vol. 11(1),
51&#8211;68.
</p>
<p>MONTAGUE R. (1974), The proper treatment of quantification in ordinary english, dans P. PORTNER &amp;
B. H. PARTEE, Eds., Formal Semantics: The Essential Readings, chapter 1, Blackwell Publishers, 2002
edition.
</p>
<p>MOORTGAT M. (1996), Categorial type logics, dans J. VAN BENTHEM &amp; A. TER MEULEN, Eds.,
Handbook of Logic and Language, p. 93&#8211;177, Amsterdam, Elsevier Science Publishers.
</p>
<p>MORRILL G. V. (1994), Type Logical Grammar Categorial Logic of Signs, Kluwer Academin Publish-
ers.
</p>
<p>SCHABES Y., SHIEBER S. M. (1994), An alternative conception of tree-adjoining derivation, Compu-
tational Linguistics, Vol. 20(1), 91&#8211;124.</p>

</div></div>
</body></html>