<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apprentissage collectif et lexique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, Session Poster, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Apprentissage collectif et lexique
</p>
<p>Julien Poudade, Patrick Paroubek
Limsi - CNRS, Batiment 508 Universite Paris XI, BP 133 - 91403 ORSAY
</p>
<p>Cedex - France
poudade | pap@limsi.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article pr&#233;sente l&#8217;influence de la zone de travail que poss&#232;de une entit&#233; logicielle pour lui
permettre de pr&#233;dire l&#8217;&#233;tat futur de son environnement, sur la constitution d&#8217;un lexique partag&#233;
par les diff&#233;rents membres d&#8217;une population, dans le cadre d&#8217;une variante &#8220;du jeu de d&#233;signa-
tion&#8221; (naming game).
</p>
<p>In this paper, we show the influence that the work area used by software entities to predict the
future state of their environment, has on the establishment of a common lexicon shared by the
members of a population involved in a variant of the naming game.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>lexique, apprentissage automatique, syst&#232;me multi-agents
lexicon, machine learning, multi-agent system
</p>
<p>1 Introduction
</p>
<p>Une nouvelle voie de recherche prometteuse est apparue ces derni&#232;res ann&#233;es, qui propose
d&#8217;utiliser les principes &#233;volutionnistes (Kirby S., 2003) et darwinistes (Edelman G. M., 1992)
pour que des communaut&#233;s de machines d&#233;veloppent un langage. Dans cet ordre d&#8217;id&#233;es, nous
nous sommes int&#233;ress&#233;s aux exp&#233;riences de (Steels L., 1996) qui concernent un des &#233;l&#233;ments
les plus simples mais aussi des plus essentiels, propre au langage : le lexique.
</p>
<p>Notre but est d&#8217;&#233;tudier l&#8217;&#233;laboration d&#8217;un mod&#232;le des m&#233;canismes de compr&#233;hension du lan-
gage. Plus particuli&#232;rement, nous essayons de d&#233;gager les pr&#233;requis fonctionnels n&#233;cessaires
pour que des entit&#233;s logicielles puissent faire &#233;voluer un langage &#224; partir de leurs r&#233;ceptions
(perceptions) et effections (actions), produits de leurs interactions avec leur environnement,
ceci en mode non-supervis&#233; ou l&#233;g&#232;rement contraint, par exemple, avec une population mixte
d&#8217;agents logiciels et humains (Steels L., Kaplan F., 1999).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Poudade, Paroubek
</p>
<p>Nos premiers r&#233;sultats sont contenus dans le mod&#232;le prototype R&#201;FECT, qui int&#232;gre un nom-
bre minimal de composants : une repr&#233;sentation du monde (m&#233;moire &#224; long terme) constru-
ite &#224; partir d&#8217;associations r&#233;ception-effection et une zone de travail pour pr&#233;dire l&#8217;&#233;tat futur
de l&#8217;environement. La m&#233;thode scientifique que nous nous proposons d&#8217;employer, consiste &#224;
essayer de d&#233;corr&#233;ler l&#8217;effet des &#8220;objets&#8221; linguistiques comme le lexique, la syntaxe, la s&#233;man-
tique ou m&#234;me la pragmatique, de celui des autres composants du mod&#232;le, afin de mesurer leur
influence sur l&#8217;architecture et les performances de celui-ci.
</p>
<p>Les exp&#233;riences de (Steels L., McIntyre A., 1999), vont nous permettre une premi&#232;re valida-
tion de notre mod&#232;le actuel, et de mesurer l&#8217;influence de la zone de travail sur une entit&#233; lors
d&#8217;un processus &#8220;simple&#8221; de constitution de lexique &#224; travers une population1. Nous montrons
plus particuli&#232;rement que la taille de la zone de travail influence tr&#232;s fortement la taille de la
repr&#233;sentation et donc la taille du lexique, ainsi que son ambigu&#239;t&#233;. Cette preuve est illustr&#233;e
par une pr&#233;sentation des r&#233;sultats exp&#233;rimentaux que nous avons obtenus lors de sessions du
jeu de d&#233;signation avec des populations d&#8217;entit&#233;s logicielles ayant des tailles de zone de travail
allant de un &#224; plusieurs dizaines.
</p>
<p>2 La compr&#233;hension de texte
</p>
<p>La notion de compr&#233;hension de texte est intimement li&#233;e &#224; la notion de repr&#233;sentation des con-
naissances mais aussi &#224; la notion de comparaison, ou de recouvrement entre la repr&#233;sentation du
&quot;savoir&quot; des individus et le contenu du texte. Ainsi des auteurs comme (Kintsch W., 1994) ont
montr&#233; que dans le cadre d&#8217;une t&#226;che de compr&#233;hension de texte, il existe une corr&#233;lation entre
le &quot;degr&#233;&quot; de connaissance de l&#8217;individu effectuant cette t&#226;che et le document (en terme de struc-
ture, de coh&#233;rence). D&#8217;autres auteurs comme (Graesser A., 2002) consid&#232;rent la compr&#233;hension
comme la capacit&#233; &#224; effectuer des inf&#233;rences, interpr&#233;ter, paraphraser, traduire, expliquer, ou en-
core r&#233;sumer. Dans (Labasse B., 1999), toujours fond&#233; sur les th&#233;ories de Kintsch, appara&#238;t un
nouvel acteur dans la compr&#233;hension de texte : la perception. Ce processus y est d&#233;crit comme
une fonction primordiale dans la compr&#233;hension, puisque celui-ci permet les acc&#232;s au lexique,
la v&#233;rification de la coh&#233;rence et de la coh&#233;sion d&#8217;un texte.
</p>
<p>Des mod&#232;les de compr&#233;hension &#8220;calculables&#8221; ont &#233;t&#233; introduits notamment par (Sabah G.,
1990), ainsi que par (Popescu-Belis A., 1999) et (Gruselle J.-P., 1997). Ce dernier, en plus
de consid&#233;rer le percept et les repr&#233;sentations internes d&#8217;un individu, propose des outils infor-
matiques pour mod&#233;liser ses repr&#233;sentations, par le biais notamment de graphes &#224; propagation,
et une d&#233;finition exploitable du percept comme entr&#233;e du syst&#232;me en analogie avec la percep-
tion que peut avoir un &#234;tre humain des propos &#233;chang&#233;s autour de lui : des suites de mots. Dans
notre mod&#232;le, nous nous proposons de ne pas d&#233;corr&#233;ler le langage du processus cognitif. Il est
donc tr&#232;s fortement li&#233; (c&#8217;est &#224; dire qu&#8217;il influence/modifie resp. est influenc&#233;/modifi&#233;) &#224; la m&#233;-
morisation (structure et contenu), ainsi qu&#8217;aux syst&#232;mes sensori-moteurs des individus. Nous
faisons l&#8217;hypoth&#232;se que les individus poss&#232;dent un lexique, mais en aucun cas la s&#233;mantique
associ&#233;e. Ils devront donc l&#8217;apprendre en interagissant avec leur environnement (incluant les
autres agents).
</p>
<p>Nous supposons qu&#8217;une entit&#233; se compose d&#8217;un ensemble d&#8217;effecteurs et de senseurs, d&#8217;une
repr&#233;sentation construite avec des associations r&#233;ception-effection regroup&#233;es en composantes,
sur la base de crit&#232;res de similarit&#233;, nous avons besoins pour que cette entit&#233; puisse fonction-
</p>
<p>1La population est constitu&#233;e d&#8217;entit&#233;s dont la repr&#233;sentation du monde est leur lexique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage collectif et lexique
</p>
<p>ner de mani&#232;re un tant soit peu intelligente (c&#8217;est &#224; dire en effectuant des pr&#233;dictions sur son
environnement), d&#8217;une fonction de validation/s&#233;lection pour les connaissances que nous ap-
pellerons : l&#8217;attente. Cette fonction servira &#224; projeter la r&#233;ception courante repr&#233;sentative de
l&#8217;&#233;tat du monde &#224; un instant donn&#233; tel que per&#231;u par l&#8217;entit&#233;, sur la repr&#233;sentation du monde
que l&#8217;entit&#233; maintient en m&#233;moire, &#224; valider les connaissances ainsi s&#233;lectionn&#233;e et &#224; d&#233;duire la
prochaine effection requise pour g&#233;rer la situation courante.
</p>
<p>3 Nos exp&#233;riences
</p>
<p>Les exp&#233;rimentations suivantes sont bas&#233;es sur &#8220;jeu de d&#233;signation&#8221; adapt&#233; &#224; partir de celui
d&#233;fini par son cr&#233;ateur (Steels L., 1997). Ce jeu implique 2 agents : un locuteur qui identifie un
objet en utilisant un mot, un interlocuteur qui valide/invalide le mot pour l&#8217;objet s&#233;lectionn&#233; (le
jeu est une r&#233;ussite si le l&#8217;interlocuteur valide le mot). A l&#8217;issu du jeu chaque participant met
&#224; jour ses relations (associations objet-mot) afin d&#8217;obtenir plus de r&#233;ussite pour les jeux futurs.
Nous consid&#233;rons un syst&#232;me non bruit&#233;. Ainsi les probabilit&#233;s pc et pa d&#233;crites par (Steels L.,
McIntyre A., 1999), correspondant respectivement &#224; la probabilit&#233; de cr&#233;ation d&#8217;un mot et &#224; la
probabilit&#233; d&#8217;absorption d&#8217;un mot, seront toutes deux &#233;gales &#224; 1. Ce choix s&#8217;explique par notre
volont&#233; de montrer l&#8217;influence de la zone de travail sur les repr&#233;sentations d&#8217;un agent.
</p>
<p>3.1 Cas d&#8217;une zone de travail de taille 1
</p>
<p>Consid&#233;rons tout d&#8217;abord une zone de travail de taille 1, c&#8217;est &#224; dire que l&#8217;interlocuteur impliqu&#233;
dans un jeu de d&#233;signation n&#8217;&#233;lira qu&#8217;un seul mot correspondant au sujet du jeu. Les param&#232;tres
du syst&#232;me sont : Na = 20, No = 20, g = 19 (nombre de syllabes), pour une taille de mot max-
imale de 4 syllabes. Le r&#233;sultat typique d&#8217;une simulation apr&#232;s 3000 jeux est montr&#233; figure 1.
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  500  1000  1500  2000  2500  3000
</p>
<p>P
ou
</p>
<p>rc
en
</p>
<p>ta
ge
</p>
<p> d
e 
</p>
<p>su
cc
</p>
<p>&#232;s
</p>
<p>Jeux
</p>
<p>Figure 1: Comportement d&#8217;un syst&#232;me ferm&#233; avec 20 agents et 20 objets. Le pourcentage de
r&#233;ussite du jeu de d&#233;signation est indiqu&#233; sur l&#8217;axe des ordonn&#233;es. Une forte augmentation du
nombre de r&#233;ussites est observable jusqu&#8217;au jeu 350.
</p>
<p>Cette figure montre une rapide augmentation du nombre de r&#233;ussites des jeux de d&#233;signation, et
ainsi l&#8217;augmentation rapide du lexique partag&#233; par les agents. La taille moyenne du lexique sur
la population est de 90, c&#8217;est &#224; dire qu&#8217;il est compos&#233; de 90 relations distinctes, ce qui est bien
plus de relations qu&#8217;il n&#8217;en faut pour traiter des 20 objets.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Poudade, Paroubek
</p>
<p>En extrayant de la repr&#233;sentation des agents les relations en fonction des objets, nous observons
que peu d&#8217;objets n&#8217;ont qu&#8217;un seul mot en relation. La plupart des objets ont plusieurs mots
associ&#233;s, ce qui traduit l&#8217;existence de synonymie. Regardons Sa la synonymie moyenne dans
le lexique d&#8217;un agent (nombre moyen de mots du lexique associ&#233; &#224; chaque objet) : pour le
cas de l&#8217;agent 10 Sa = 8.58. En extrayant cette fois les relations en fonction des mots, nous
observons qu&#8217;un m&#234;me mot peut d&#233;crire plusieurs objets. Cela met en exergue l&#8217;existence du
ph&#233;nom&#232;ne d&#8217;homonymie. De la m&#234;me mani&#232;re que pr&#233;c&#233;demment, nous pouvons regarder
Ha l&#8217;homonymie moyenne dans le lexique d&#8217;un agent (nombre moyen de mots ayant plus d&#8217;un
r&#233;f&#233;rent) : pour le cas de l&#8217;agent 10 Ha = 0.007. Cette faible valeur s&#8217;explique ais&#233;ment, la
probabilit&#233; que 2 mots d&#233;crivent au moins 2 r&#233;f&#233;rents est tr&#232;s faible et d&#233;pend de leur processus
de cr&#233;ation : du nombre de syllabes et de la longueur des mots. Dans l&#8217;exp&#233;rience courante
les agents ont 19 syllabes &#224; leur disposition pour former des mots de taille maximale 4, ce
qui donne
</p>
<p>&#8721;
4
</p>
<p>i=1
19i = 137560 mots possibles. On comprend donc la faible probabilit&#233; de
</p>
<p>tirer 2 m&#234;mes mots pour 2 r&#233;f&#233;rents diff&#233;rents. Ces deux observations sont en accord avec les
exp&#233;rimentations de (Steels L., McIntyre A., 1999), o&#249; nous trouvons une mesure de synonymie
moyenne de 8.58, il mesure une synonymie moyenne de 3.40; et o&#249; nous mesurons une valeur
d&#8217;homonymie tr&#232;s faible, lui l&#8217;estime nulle en vertu des lois de probabilit&#233;.
</p>
<p>Nous constatons que la taille moyenne du lexique sur la population est deux fois sup&#233;rieure &#224;
celle mesur&#233;e par (Steels L., McIntyre A., 1999) et qu&#8217;il en va de m&#234;me pour Sa, ces r&#233;sultats
s&#8217;expliquent par le choix de la m&#233;thode de classification, arbre de d&#233;cision pour le m&#233;thode
de Steels, simple calcul de distance et zone de travail pour notre mod&#232;le. Assur&#233;s que nos
hypoth&#232;ses nous mettent dans les crit&#232;res de convergence et de stabilit&#233; mesur&#233;s par (Steels L.,
McIntyre A., 1999), nous pouvons maintenant nous int&#233;resser &#224; montrer l&#8217;influence de la taille
de la zone de travail.
</p>
<p>3.2 Etude de la variation de la taille de la zone de travail
</p>
<p>La zone de travail est une zone de validation/invalidation d&#8217;hypoth&#232;ses concurrentes. Ainsi
l&#8217;interlocuteur, plut&#244;t que d&#8217;&#233;lire un mot unique correspondant au sujet du jeu, va s&#233;lectionner
k mots de fa&#231;on &#224; remplir au maximum sa zone de travail.
</p>
<p>La figure 2 montre la variation de la taille moyenne de la repr&#233;sentation des agents (m&#233;moire
associative o&#249; sont pr&#233;sentes toutes les associations objet-mot). Deux ph&#233;nom&#232;nes sont observ-
ables :
</p>
<p>1. Une rapide diminution de la taille de la repr&#233;sentation. Cette diminution est observable
quelques soient les param&#232;tres du syt&#232;me. Ainsi pour Na = 50, No = 50. Lorsque les
agents ont une taille de zone de travail &#233;gale &#224; 1, le nombre d&#8217;associations est de 375.
Alors que si nous augmentons la taille de la zone de travail &#224; 5, le nombre d&#8217;associations
passe &#224; 60 ;
</p>
<p>2. Apr&#232;s un certain seuil, la taille de la repr&#233;sentation est quasi-constante.
</p>
<p>La premi&#232;re observation s&#8217;explique ais&#233;ment comme suit. La zone de travail a pour fonction
de parcourir l&#8217;espace des cas possibles2. Ce parcours permet de ne pas &#233;liminer les cas po-
tentiellement viables. Et donc de limiter le remplissage de la repr&#233;sentation, puisqu&#8217;en effet la
</p>
<p>2Par cas possibles, nous entendons mots candidats en relation avec l&#8217;objet sujet du jeu de d&#233;signation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage collectif et lexique
</p>
<p> 0
</p>
<p> 50
</p>
<p> 100
</p>
<p> 150
</p>
<p> 200
</p>
<p> 250
</p>
<p> 300
</p>
<p> 350
</p>
<p> 400
</p>
<p> 1  2  3  4  5  6  7  8  9
</p>
<p>T
ai
</p>
<p>lle
 m
</p>
<p>oy
en
</p>
<p>ne
 d
</p>
<p>e 
la
</p>
<p> r
ep
</p>
<p>r&#233;
se
</p>
<p>nt
at
</p>
<p>io
n 
</p>
<p>de
s 
</p>
<p>ag
en
</p>
<p>ts
</p>
<p>Taille de la zone de travail
</p>
<p>20 agents, 20 objets
20 agents, 50 objets
50 agents, 20 objets
35 agents, 35 objets
50 agents, 50 objets
</p>
<p>Figure 2: Evolution de la taille moyenne de la repr&#233;sentation des agents de la population. Une
forte d&#233;croissance est observable tr&#232;s rapidement.
</p>
<p>probabilit&#233; de rencontrer un mot d&#233;j&#224; &#233;nonc&#233; au cours d&#8217;un jeu de d&#233;signation sera d&#8217;autant plus
augment&#233;e que la taille de la zone de travail sera grande. La seconde observation, indique qu&#8217;&#224;
partir d&#8217;une certaine taille de zone de travail, la taille de la repr&#233;sentation devient constante.
</p>
<p>La figure 3 montre l&#8217;&#233;volution de la fr&#233;quence de remplissage de la zone de travail, sur la
population, au cours des jeux de d&#233;signation, en fonction de la taille de cette zone de tra-
vail. Ces mesures renforcent les r&#233;sultats pr&#233;c&#233;dents : il existe une valeur &#224; partir de laquelle
l&#8217;augmentation de la taille de la zone de travail n&#8217;est plus significative. Cette exp&#233;rimentation
montre qu&#8217;&#224; partir d&#8217;une certaine taille de la zone de travail il n&#8217;existe plus suffisamment de
mots en association avec l&#8217;objet sujet du jeu de d&#233;signation pour la remplir.
</p>
<p> 0
</p>
<p> 100
</p>
<p> 200
</p>
<p> 300
</p>
<p> 400
</p>
<p> 500
</p>
<p> 600
</p>
<p> 700
</p>
<p> 800
</p>
<p> 900
</p>
<p> 1000
</p>
<p> 1  2  3  4  5  6  7  8  9
</p>
<p>N
om
</p>
<p>br
e 
</p>
<p>m
oy
</p>
<p>en
 d
</p>
<p>e 
re
</p>
<p>m
pl
</p>
<p>is
sa
</p>
<p>ge
 to
</p>
<p>ta
l d
</p>
<p>e 
la
</p>
<p> z
on
</p>
<p>e 
de
</p>
<p> tr
av
</p>
<p>ai
l
</p>
<p>Taille de la zone de travail
</p>
<p>10 agents, 10 objets
20 agents, 20 objets
30 agents, 30 objets
40 agents, 40 objets
</p>
<p>N
om
</p>
<p>br
e 
</p>
<p>m
oy
</p>
<p>en
 d
</p>
<p>e 
re
</p>
<p>m
pl
</p>
<p>is
sa
</p>
<p>ge
 to
</p>
<p>ta
l d
</p>
<p>e 
la
</p>
<p> z
on
</p>
<p>e 
de
</p>
<p> tr
av
</p>
<p>ai
l
</p>
<p>Figure 3: Evolution de la fr&#233;quence de remplissage de la zone de travail.
</p>
<p>Cette s&#233;rie d&#8217;exp&#233;rimentations, montre tout d&#8217;abord l&#8217;&#233;quivalence de notre jeu de d&#233;signation
avec celui de (Steels L., McIntyre A., 1999) sur la propagation du lexique. Mais elles montrent
aussi l&#8217;importance de la zone de travail sur la taille moyenne de la repr&#233;sentation d&#8217;un agent.
</p>
<p>4 Conclusion
</p>
<p>Dans notre &#233;laboration d&#8217;un mod&#232;le des m&#233;canismes de compr&#233;hension du langage, c&#8217;est &#224; dire
d&#8217;explicitation des pr&#233;requis fonctionnels n&#233;cessaires pour que des entit&#233;s logicielles puissent
faire &#233;voluer un langage &#224; partir de leurs r&#233;ceptions (perceptions) et effections (actions), nous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Poudade, Paroubek
</p>
<p>avons d&#233;velopp&#233; un mod&#232;le prototype R&#201;FECT d&#8217;entit&#233; logicielle, qui int&#232;gre parmi ses comp-
sants une zone de travail, lui permettant de construire des hypoth&#232;ses sur l&#8217;&#233;tat futur de son
environnement. Les exp&#233;riences de (Steels L., McIntyre A., 1999) nous ont permis une pre-
mi&#232;re validation de notre mod&#232;le actuel et de mesurer l&#8217;influence de la zone de travail sur une
entit&#233; lors d&#8217;un processus &#8220;simple&#8221; de constitution de lexique &#224; travers une population. Dans
le jeu de d&#233;signation, nous avons montr&#233; qu&#8217;il existait &#224; nombre d&#8217;objets et d&#8217;agents constants,
une taille de la zone de travail &#224; partir de laquelle la taille de la repr&#233;sentation des entit&#233;s devient
constante et minimale, et donc que le lexique partag&#233; par les entit&#233;s devient lui aussi constant
et minimal. La valeur moyenne de synonymie que l&#8217;on mesure alors devient donc quasiment
nulle.
</p>
<p>Une des prochaines &#233;tapes de nos recherches sera de traiter de la s&#233;mantique en ancrant le
lexique dans le r&#233;&#233;l, ce qui implique de ne plus traiter l&#8217;action comme un performatif (Searle
J.R., 1972) du langage mais comme un moyen d&#8217;appr&#233;hender les items du monde.
</p>
<p>R&#233;f&#233;rences
</p>
<p>GRAESSER A. (2002), The psychology of science text comprehension.
</p>
<p>GRUSELLE J.-P. (1997), Le r&#244;le du mot dans la formation des concepts : un mod&#232;le informatique et son
implantation, Ph.D. thesis, Computer Science, Paris-XI University, July 1997.
</p>
<p>EDELMAN G. M. (1992), Biologie de la conscience, Paris, Odile Jacob.
</p>
<p>KINTSCH W. (1994), Text comprehension, memory, and learning, American Psychologist, Vol. 49, pp.
294-303.
</p>
<p>KIRBY S. (2003), Proceedings of the Language Evolution and Computation Workshop, 15th European
Summer School in Logic Language and Information (ESSLI), Vienna, August 2003.
</p>
<p>LABASSE B. (1999), Perception et compr&#233;hension de l&#8217;&#233;crit, La chose imprim&#233;e, pp 458-462, Paris, Retz.
</p>
<p>POPESCU-BELIS A. (1999), Mod&#233;lisation multi-agent des &#233;changes langagiers : application au probl&#232;me
de la r&#233;f&#233;rence et &#224; son &#233;valuation, Ph.D. thesis, Computer Science, Paris-XI University, July 1999.
</p>
<p>SABAH G. (1990), CARAMEL : A computational model of the naturel language understanding using a
parallel implementation, Actes de ECAI, pp. 563-565, Stockholm.
</p>
<p>SEARLE J.R. (1972), Les actes de langage, Paris, Hermann.
</p>
<p>STEELS L. (1997), Self-organizing Vocabularies, Actes de V Alife Conference, Nara Japan, Langton, C.
(ed.).
</p>
<p>STEELS L. (1996), Emergent Adaptive Lexicons, Actes de the Forth International Conference on Sim-
ulation of Adaptive Behavior, SAB&#8217;96, Complex Adaptive Systems, pp. 562-567 Cambridge, MA: The
MIT Press.
</p>
<p>STEELS L., MCINTYRE A. (1999), Spatially Distributed Naming Games, Advances in Complex Systems,
vol. 1, nr. 4, pp. 301-323 Paris, Hermes Science Publications.
</p>
<p>STEELS L., KAPLAN F. (1999), Amor&#231;age d&#8217;une s&#233;mantique lexicale dans une population d&#8217;agents au-
tonomes, ancr&#233;s et situ&#233;s. In: Amsili, P. (ed) 6e conf&#233;rence annuelle sur le traitement automatique des
langues naturelles, TALN&#8217;99, pp. 393-398.
</p>
<p>SUTTON, BARTO (1999), Reinforcement Learning, MIT press.</p>

</div></div>
</body></html>