<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une m&#233;thode pour l&#8217;annotation de relations temporelles dans des textes et son &#233;valuation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Une m&#233;thode pour l&#8217;annotation de relations temporelles dans
des textes et son &#233;valuation
</p>
<p>Philippe Muller, Xavier Tannier
IRIT-CNRS UMR 5505
Universit&#233; Paul-Sabatier
</p>
<p>118 Rte de Narbonne
31062 Toulouse Cedex 04
</p>
<p>muller@irit.fr, tannier@emse.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article traite de l&#8217;annotation automatique d&#8217;informations temporelles dans des textes et
vise plus particuli&#232;rement les relations entre &#233;v&#233;nements introduits par les verbes dans chaque
clause. Si ce probl&#232;me a mobilis&#233; beaucoup de chercheurs sur le plan th&#233;orique, il reste en
friche pour ce qui est de l&#8217;annotation automatique syst&#233;matique (et son &#233;valuation), m&#234;me s&#8217;il
existe des d&#233;buts de m&#233;thodologie pour faire r&#233;aliser la t&#226;che par des humains. Nous proposons
ici &#224; la fois une m&#233;thode pour r&#233;aliser la t&#226;che automatiquement et une mani&#232;re de mesurer &#224;
quel degr&#233; l&#8217;objectif est atteint. Nous avons test&#233; la faisabilit&#233; de ceci sur des d&#233;p&#234;ches d&#8217;agence
avec des premiers r&#233;sultats encourageants.
</p>
<p>This paper focuses on the automated processing of temporal information in written texts,
more specifically on relations between events introduced by verbs in every clause. While this
latter problem has been largely studied from a theoretical point of view, it has very rarely been
applied to real texts, if ever, with quantified results. The methodology required is still to be
defined, even though there have been proposals in the human annotation case. We propose here
both a procedure to achieve this task and a way of measuring the results. We have been testing
the feasability of this on neswire articles, with promising first results.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Annotation, Temps, Discours
Text annotation, Time, Discourse</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Muller, Xavier Tannier
</p>
<p>1 Introduction
</p>
<p>Annoter l&#8217;information temporelle Cet article concerne l&#8217;annotation automatique
d&#8217;informations temporelles dans des textes et vise plus particuli&#232;rement les relations en-
tre &#233;v&#233;nements introduits par des verbes dans chaque clause. Si la s&#233;mantique des marqueurs
du temps et la structuration temporelle du discours sont des sujets d&#8217;&#233;tude tr&#232;s d&#233;velopp&#233;s
en linguistique formelle (Steedman, 1997)1, l&#8217;annotation syst&#233;matique (et quantifi&#233;e) de
textes quelconques en est encore &#224; ses d&#233;buts. Ce probl&#232;me commence &#224; g&#233;n&#233;rer des
travaux en linguistique computationnelle (Harper et al., 2001), li&#233;s aux enjeux que repr&#233;sente
les informations temporelles entre autres pour la recherche d&#8217;information et les syst&#232;mes
question-r&#233;ponse.
</p>
<p>On peut distinguer plusieurs t&#226;ches sous cette banni&#232;re :
</p>
<p>&#8226; la d&#233;tection de dates et de marqueurs temporels
&#8226; le rep&#233;rage d&#8217;&#233;v&#233;nements
&#8226; la datation d&#8217;&#233;v&#233;nements
&#8226; la d&#233;termination de l&#8217;ordre des &#233;v&#233;nements dans un texte
</p>
<p>Le premier probl&#232;me est relativement ais&#233; &#224; r&#233;soudre pour les dates &#224; l&#8217;aide d&#8217;expressions
r&#233;guli&#232;res (Wilson et al., 2001), mais n&#233;cessite une part d&#8217;analyse grammaticale dans des
cadres plus larges (Vazov, 2001; Shilder &amp; Habel, 2001). Le deuxi&#232;me pose des probl&#232;mes
ontologiques: qu&#8217;est-ce qui compte comme un &#233;v&#233;nement (Setzer, 2001), comment consid-
&#233;rer les verbes attitudinaux (croyances), les discours indirects, ... Le troisi&#232;me rencontre une
sous-d&#233;termination importante: beaucoup d&#8217;&#233;v&#233;nements n&#8217;ont pas de date explicite associ&#233;es
dans le texte, et il n&#8217;est pas toujours possible d&#8217;en d&#233;terminer une contextuellement (Filatova
&amp; Hovy, 2001). Cela conduit &#224; une approche plus adapt&#233;e &#224; cette impr&#233;cision : annoter aussi
les relations entre &#233;v&#233;nements de mani&#232;re symbolique (par exemple, e1 est avant e2), qui est
la d&#233;marche suivie par (Katz &amp; Arosio, 2001; Setzer, 2001) avec des annotateurs humains.Il
se pose alors dans le cas de l&#8217;annotation humaine plusieurs niveaux de difficult&#233;s : le choix
des relations &#224; proposer et la comparaison entre annotateurs notamment. L&#8217;automatisation de
telles annotations est de toutes fa&#231;ons loin d&#8217;&#234;tre triviale, et n&#233;cessite une forme m&#234;me simpli-
fi&#233;e de mod&#233;lisation discursive (cf. le travail pr&#233;liminaire de (Grover et al., 1995)). Nous nous
proposons ici de montrer la faisabilit&#233; de cette t&#226;che, et de proposer une fa&#231;on de l&#8217;&#233;valuer.
</p>
<p>Le probl&#232;me de l&#8217;&#233;valuation Ce que l&#8217;on cherche &#224; annoter est en fait une approximation
du mod&#232;le que se fait le lecteur de l&#8217;information temporelle contenue dans un texte ; cela fait
intervenir une part de raisonnement et l&#8217;int&#233;gration de diverses sources d&#8217;informations (lexicales
et discursives). Comme l&#8217;a remarqu&#233; (Setzer, 2001), il est difficile d&#8217;accorder des annotateurs
humains entre eux, car ils peuvent se contenter d&#8217;exprimer quelques relations entre &#233;v&#233;nements
(par exemple qu&#8217;un &#233;v&#233;nement e1 a lieu pendant un autre e2, et que e2 a lieu avant e3, &#233;tant
implicite qu&#8217;alors e1 a lieu avant e3). Une possibilit&#233; serait de demander explicitement d&#8217;&#233;tablir
un lien pour chaque paire d&#8217;&#233;v&#233;nements, mais cela conduirait &#224; une t&#226;che tr&#232;s lourde pour
l&#8217;humain, puisqu&#8217;il y a O(n2) paires pour n &#233;v&#233;nements reconnus dans un texte.
</p>
<p>1Pour le fran&#231;ais on peut se r&#233;f&#233;rer aussi &#224; (Bras, 1991).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation de relations temporelles dans des textes
</p>
<p>Pour comparer deux annotations, (Setzer, 2001) mais aussi de fa&#231;on simplifi&#233;e (Katz &amp; Arosio,
2001) propose alors de prendre les fermetures transitives des annotations par rapport &#224; quelques
r&#232;gles d&#8217;inf&#233;rence intuitives (comme celle que nous venons de prendre en exemple). On peut
ensuite mesurer, pour chaque relation propos&#233;e aux annotateurs, que les &#233;v&#233;nements reli&#233;s sont
bien les m&#234;mes avec les mesures classiques de pr&#233;cision et de rappel. Ceci am&#233;liore le proto-
cole, mais (Setzer, 2001) note que cela n&#8217;emp&#234;che pas les humains d&#8217;oublier certaines informa-
tions, et qu&#8217;il faut alors repasser avec l&#8217;humain sur ses oublis. L&#8217;auteur estime alors &#224; une heure
environ le temps n&#233;cessaire par texte (en moyenne comprenant entre 15 et 40 &#233;v&#233;nements).
Cela rend l&#8217;automatisation d&#8217;autant plus cruciale. En fait on peut d&#233;celer deux probl&#232;mes dans
cette m&#233;thode : la premi&#232;re est le choix des relations temporelles propos&#233;es aux annotateurs, &#224;
savoir &quot;avant&quot;, &quot;apr&#232;s&quot;, &quot;pendant&quot;, &quot;simultan&#233;ment&quot;. La derni&#232;re est particuli&#232;rement difficile
&#224; estimer, puisqu&#8217;elle correspond d&#8217;apr&#232;s l&#8217;auteur &#224; &quot;&#224; peu pr&#232;s au m&#234;me moment&quot; (roughly at
the same time, p81). Le deuxi&#232;me probl&#232;me est li&#233; au mod&#232;le inf&#233;rentiel consid&#233;r&#233;. Celui-ci
est en effet loin d&#8217;&#234;tre &quot;complet&quot;. S&#8217;il est difficile d&#8217;estimer dans quelle mesure un syst&#232;me de
raisonnement se rapproche des capacit&#233;s humaines, il existe n&#233;anmoins des syst&#232;mes formels
plus pr&#233;cis pour mod&#233;liser l&#8217;information temporelle comme l&#8217;alg&#232;bre de relations d&#8217;Allen, tr&#232;s
&#233;tudi&#233;e en raisonnement automatique. Nous pensons que la mesure de l&#8217;accord &#224; partir de ce
mod&#232;le sera plus pr&#233;cis, &#224; condition d&#8217;appliquer pleinement le formalisme : &#224; savoir que cer-
taines informations d&#233;duites sont disjonctives (la relation entre deux &#233;v&#233;nements est a OU b OU
c).
</p>
<p>Nous avons alors test&#233; cette m&#233;thode et son &#233;valuation sur une petite base de d&#233;p&#234;ches AFP,
annot&#233;es par nos soins.
</p>
<p>2 M&#233;thode d&#8217;annotation automatique
</p>
<p>Nous d&#233;taillons ici la m&#233;thode que nous avons utilis&#233;e pour annoter des textes de d&#233;p&#234;ches
d&#8217;agence. Les &#233;tapes suivantes ont &#233;t&#233; r&#233;alis&#233;es sur les textes bruts, enrichis d&#8217;un tampon tem-
porel pr&#233;cisant leur date d&#8217;&#233;mission :
</p>
<p>&#8226; annotation en parties de discours (avec le logiciel Treetagger (Schmid, 1994), en gardant
l&#8217;information du temps grammatical) ;
</p>
<p>&#8226; un pr&#233;traitement est effectu&#233; (notamment la d&#233;tection de certaines locutions pr&#233;position-
nelles pour en faire des unit&#233;s lexicales) ;
</p>
<p>&#8226; une analyse grammaticale superficielle est effectu&#233; avec des cascades d&#8217;analyseurs par
expressions r&#233;guli&#232;res2 (cf. (Abney, 1996) dont nous avons utilis&#233; le logiciel Cass) ;
cela permet d&#8217;extraire les marqueurs de dates, ceux exprimant des relations temporelles
(groupes pr&#233;positionnels, marqueurs temporels,... ), ainsi que de fournir un d&#233;coupage
sommaire en clauses (un groupe verbal avec un temps fini par clause) et d&#8217;attacher &#224; ces
clauses les adjoints correspondants dans la plupart des cas (l&#8217;ambigu&#239;t&#233; de certaines struc-
tures syntaxiques pouvant g&#233;n&#233;rer des erreurs &#224; ce niveau). La figure 1 donne une id&#233;e
des informations d&#233;finies et extraites &#224; ce niveau (pour l&#8217;instant le focus temporel est tou-
jours l&#8217;&#233;v&#233;nement pr&#233;c&#233;demment trouv&#233;), pour lesquelles une interpr&#233;tation temporelle
est donn&#233;e.
</p>
<p>2Les r&#232;gles que nous avons d&#233;finies sont au nombre de 89 r&#233;parties en 29 niveaux.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Muller, Xavier Tannier
</p>
<p>&#201;l&#233;ments temporels g&#233;n&#233;r&#233;s (reconnus) par shallow parsing
</p>
<p>date(1/2) : date non absolue (&quot;le 25 mars&quot;,
&quot;en juin&quot;).
</p>
<p>dateabs : date absolue &quot;le 14 juillet 1789&quot;.
</p>
<p>daterelST(1/2) : date relative au moment
d&#8217;&#233;locution (&quot;il y a 2 ans&quot;,&quot;l&#8217;ann&#233;e
derni&#232;re&quot;).
</p>
<p>daterelTF(1/2/3) : date relative au focus
temporel (&quot;3 jours plus tard&quot;).
</p>
<p>datespecabs : date absolue, de forme partic-
uli&#232;re (&quot;Au d&#233;but des ann&#233;es 1980&quot;).
</p>
<p>datespecrel : date relative, de forme partic-
uli&#232;re (mois,saisons).
</p>
<p>duree : dur&#233;e quelconque (&quot;pendant 3 ans&quot;).
</p>
<p>duree2 : dur&#233;e contenant deux dates (du 11
f&#233;vrier au 27 octobre. . . ).
</p>
<p>dureerelabs : dur&#233;e absolue (&quot;&#224; partir du 14
juillet&quot;).
</p>
<p>dureerelST : dur&#233;e relative au moment
d&#8217;&#233;locution (&quot;depuis un an&quot;).
</p>
<p>dureerelTF : dur&#233;e relative au focus tem-
porel (&quot;depuis&quot;).
</p>
<p>tatome : atome de temps (trois jours, 4 ans,
. . . ).
</p>
<p>Figure 1: Lexique des &#233;l&#233;ments utilis&#233;s pour la gestion des adverbiaux temporels
</p>
<p>&#8226; calcul de dates pour affiner les localisations temporelles des &#233;v&#233;nements associ&#233;s &#224; des in-
formations temporelles explicites (par exemple des dates relatives &#224; la date de la d&#233;p&#234;che
comme lundi dernier).
</p>
<p>&#8226; pour chaque &#233;v&#233;nement reconnu associ&#233; &#224; un adverbial temporel on &#233;tablit une relation
temporelle avec une date si cela est possible ;
</p>
<p>&#8226; utilisation de r&#232;gles d&#8217;encha&#238;nement discursif pour le fran&#231;ais, comparables &#224; celle de
(Grover et al., 1995; Song &amp; Cohen, 1991; Kameyama et al., 1993) pour l&#8217;anglais, mais
int&#233;grant les relations temporelles d&#8217;Allen (Allen, 1984) au lieu d&#8217;un ensemble ad hoc
(cf table 1 pour une id&#233;e de la forme de ces r&#232;gles). Ces r&#232;gles sont des r&#232;gles par d&#233;faut
en l&#8217;absence d&#8217;autres marqueurs, pr&#233;cisant l&#8217;ensemble des relations temporelles possibles
entre deux &#233;v&#233;nements cons&#233;cutifs dans le texte3.
</p>
<p>&#8226; calcul de relations par utilisation de proc&#233;dures de calcul alg&#233;brique sur le graphe de
relations liant les &#233;v&#233;nements d&#233;tect&#233;s et les entit&#233;s temporelles autonomes (dates), en
utilisant un algorithme de consistance de chemin (Allen, 1984).
</p>
<p>Lors du d&#233;coupage en clauses, nous d&#233;pla&#231;ons les relatives en fin de phrase, avec remplacement
du pronom relatif par le groupe nominal associ&#233; par nos r&#232;gles, de fa&#231;on similaire &#224; (Filatova
&amp; Hovy, 2001). Les relations d&#8217;Allen sont rappel&#233;es figure 2; on les abr&#232;gera par la suite en
gardant la premi&#232;re lettre de la relation, et en ajoutant &quot;i&quot; pour la relation inverse. L&#8217;algorithme
de calcul de relations est d&#233;taill&#233; dans la section suivante.
</p>
<p>3 Inf&#233;rences des relations entre &#233;v&#233;nements
</p>
<p>Nous avons argument&#233; en faveur de l&#8217;utilisation des relations d&#8217;Allen pour l&#8217;annotation des re-
lations temporelles non seulement parce qu&#8217;elles ont une s&#233;mantique claire, mais aussi parce
</p>
<p>3Nous comptons enrichir plus tard ces contraintes en tenant compte d&#8217;un temps de r&#233;f&#233;rence et d&#8217;un focus
temporel, suivant (Kameyama et al., 1993; Song &amp; Cohen, 1991).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation de relations temporelles dans des textes
</p>
<p>X
Y
</p>
<p>X
</p>
<p>X
</p>
<p>X
</p>
<p>Y
</p>
<p>Y
</p>
<p>Yfinishes
</p>
<p>before
</p>
<p>meets
</p>
<p>overlaps
</p>
<p>X
</p>
<p>X
</p>
<p>Y
</p>
<p>Y
</p>
<p>equals
</p>
<p>during
</p>
<p>starts
</p>
<p>X
</p>
<p>Y
</p>
<p>Figure 2: Les relations d&#8217;Allen entre deux &#233;v&#233;nements X et Y (le temps s&#8217;&#233;coulant de gauche &#224;
droite)
</p>
<p>1/2 ps pqp imp ...
ps e,b,m,s,d,f,o e,s,d,f,bi,mi b,m,o,e,s,d,f
</p>
<p>pqp b,m,o b,m,o,e,s,d,f,bi,mi b,m,o,e,s,d,f
imp o,d,s,f,e,si,di,fi bi,mi,oi o,e,s,d,f,si,di,fi
...
</p>
<p>Table 1: Contraintes temporelles discursive (extrait), ps=pass&#233; simple, imp=imparfait, pqp=plus
que parfait, ...
</p>
<p>que de nombreux travaux ont &#233;t&#233; faits sur l&#8217;inf&#233;rence sur des contraintes exprim&#233;es avec ces
relations. Nous pensons donc qu&#8217;un bon moyen de s&#8217;abstraire des al&#233;as li&#233;s au choix des rela-
tions annot&#233;es par l&#8217;humain est de calculer toutes les relations possibles entre &#233;v&#233;nements d&#8217;un
texte (c&#8217;est-&#224;-dire r&#233;aliser une saturation du graphe de contraintes), &#224; partir d&#8217;une annotation
automatique ou humaine, et de comparer les graphes r&#233;sultants.
</p>
<p>Cette saturation ne sera pas r&#233;alis&#233;e au moyen de r&#232;gles sp&#233;cifiques (relation entre e1 et e2)
+ (relation entre e2 et e3) donne (une relation simple entre e1 et e3) (&#224; la mani&#232;re de (Setzer,
2001; Katz &amp; Arosio, 2001)), mais en utilisant l&#8217;alg&#232;bre compl&#232;te de relations d&#8217;Allen, pour
fournir un mod&#232;le que nous pensons plus complet. Cela permet notamment de d&#233;tecter plus
surement une incoh&#233;rence dans l&#8217;annotation. Une alg&#232;bre de relation peut se d&#233;finir sur un
ensemble de relations mutuellement exclusives (deux relations ne peuvent &#234;tre valides en m&#234;me
temps entre deux objets) et exhaustives (au moins une relation relie deux objects quelconques).
L&#8217;alg&#232;bre est construite en consid&#233;rant des ensembles de relations de base {r1, r2, ...} que l&#8217;on
peut interpr&#233;ter comme de l&#8217;information disjonctive entre deux entit&#233;s. On peut alors parler
d&#8217;intersection et d&#8217;union de relations. On peut alors g&#233;n&#233;raliser les r&#232;gles de transitivit&#233; de la
forme: r(x, y)&#8743;r&#8242;(y, z) &#8594; r&#8242;&#8242;(x, z) &#224; tous les couples de relations r et r&#8242; de l&#8217;alg&#232;bre compl&#232;te.
L&#8217;algorithme suivant, appel&#233; &#8220;propagation par consistance de chemin&#8221; (Allen, 1984), assure que
l&#8217;on arrive &#224; un point fixe de saturation du graphe :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Muller, Xavier Tannier
</p>
<p>Soient
</p>
<p>{ A = l&#8217;ensemble des arcs du graphe
N = l&#8217;ensemble des n&#339;uds du graphe
U = la disjonction des treize relations d&#8217;Allen
Rm,n = la relation entre deux n&#339;uds m et n
</p>
<p>1. modifie&#769; = 0
</p>
<p>2. Pour chaque couple de noeuds (i, j) &#8712; N &#215; N et pour tout k &#8712; N tel que ((i, k) &#8712;
A &#8743; (k, j) &#8712; A)
</p>
<p>(a) R1i,j = compose(Ri,k, Rk,j) (voir plus loin)
</p>
<p>(b) Si aucun arc (une relation R2i,j) n&#8217;existait d&#233;j&#224; entre i et j, alors R2i,j = U
</p>
<p>(c) faire l&#8217;intersection : Ri,j = R1i,j &#8745; R2i,j
(d) Si Ri,j = &#8709; (inconsistance d&#233;tect&#233;e)
</p>
<p>alors : afficher un message d&#8217;erreur
</p>
<p>(e) Si Ri,j = U (aucune information) ne rien faire
sinon mettre l&#8217;arc &#224; jour
</p>
<p>modifie&#769; = 1
</p>
<p>3. Si modifie&#769; = 1, recommencer en 1.
</p>
<p>La fonction compose(Ri,k, Rk,j) utilise les 169 relations de transitivit&#233; entre les relations
d&#8217;Allen. Pour chaque couple (r1, r2) de relations binaires d&#8217;Allen tel que r1 &#8712; Ri,k et r2 &#8712; Rk,j ,
on applique la transition adapt&#233;e. Le r&#233;sultat est la disjonction de toutes les relations ainsi
obtenues.
</p>
<p>Il faut noter que cet algorithme est correct (s&#8217;il d&#233;tecte une incoh&#233;rence alors le graphe est bien
incoh&#233;rent), mais incomplet dans le cas g&#233;n&#233;ral (il ne d&#233;tecte pas n&#233;cessairement un sc&#233;nario
incoh&#233;rent) 4.
</p>
<p>4 Mesures de l&#8217;annotation
</p>
<p>Afin de valider la m&#233;thode employ&#233;e pour annoter, nous avons compar&#233; les r&#233;sultats avec une
annotation produite &quot;manuellement&quot;. Il n&#8217;est pas envisageable de faire annoter par l&#8217;humain (ex-
pert ou non) des relations par l&#8217;interm&#233;diaire des relations d&#8217;Allen, trop nombreuses et trop pr&#233;-
cises (ce qui obligerait &#224; des notations disjonctives difficiles &#224; g&#233;rer pour l&#8217;annotateur moyen).
En opposition &#224; (Setzer, 2001), nous voulons cependant des relations dont la s&#233;mantique est
pr&#233;cise, et que nous pouvons alors relier &#224; l&#8217;alg&#232;bre d&#8217;Allen pour effectuer les inf&#233;rences qui
permettent de comparer deux &quot;mod&#232;les&quot; donn&#233;s par un ensemble de contraintes. Nous avons
alors choisi (suivant (Li et al., 2001)) des relations similaires aux relations de (Bruce, 1972)
(qui a d&#8217;ailleurs inspir&#233; Allen), dont la d&#233;finition en termes de relation d&#8217;Allen est donn&#233;e ta-
ble 2. Pour s&#8217;abstraire des particularit&#233;s d&#8217;une annotation et pour se concentrer sur le mod&#232;le
temporel sous-jacent nous allons donc mesurer une distance entre l&#8217;annotation du syst&#232;me et
</p>
<p>4Il existe des sous-alg&#232;bres pour lesquelles cette proc&#233;dure est &#233;galement compl&#232;te, et il serait int&#233;ressant de
voir dans quelle mesure les annotations sont restreintes ou non &#224; ces ensembles de relations; nous n&#8217;avons pas
effectu&#233; cette &#233;tude pour l&#8217;instant.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation de relations temporelles dans des textes
</p>
<p>BEFORE &#8704; i &#8704; j (i before j &#8660; ((i &lt; j) &#8744; (i m j)))
AFTER &#8704; i &#8704; j (i after j &#8660; ((i &gt; j) &#8744; (i mi j)))
</p>
<p>OVERLAPS &#8704; i &#8704; j (i overlaps j &#8660; ((i o j)))
IS_OVERLAPED &#8704; i &#8704; j (i is_overlaped j &#8660; ((i oi j)))
</p>
<p>INCLUDES &#8704; i &#8704; j (i includes j &#8660; ((i di j) &#8744; (i si j) &#8744; (i fi j) &#8744; (i = j)))
IS_INCLUDED &#8704; i &#8704; j (i is_included j &#8660; ((i d j) &#8744; (i s j) &#8744; (i f j) &#8744; (i = j)))
</p>
<p>Table 2: Relations propos&#233;es &#224; l&#8217;annotation
</p>
<p>celle de l&#8217;humain &#224; partir du graphe satur&#233; des relations temporelles sur les &#233;v&#233;nements d&#233;tec-
t&#233;s. Nous souhaitons alors ne pas seulement mesurer l&#8217;exactitude des relations &quot;simples&quot; (non
disjonctives) entre &#233;v&#233;nements, comme (Setzer, 2001), car cela rend le r&#233;sultat tr&#232;s d&#233;pendant
du choix des relations propos&#233;es &#224; l&#8217;humain, et nous voulons de plus avoir une mesure gradu-
elle de l&#8217;impr&#233;cision du r&#233;sultat automatique: trouver une relation &quot;avant OU pendant&quot; entre
deux &#233;v&#233;nements est mieux que proposer &quot;apr&#232;s&quot; quand l&#8217;humain a propos&#233; &quot;avant&quot;. Nous
voulons alors mesurer deux choses: la coh&#233;rence de l&#8217;annotation automatique avec l&#8217;humain
(l&#8217;information contenue dans le texte implique celle trouv&#233;e automatiquement) et la pr&#233;cision
de cette information (une information trop disjonctive est moins pr&#233;cise qu&#8217;une information
bien cibl&#233;e, par exemple (a ou b ou c) est moins bon que (a ou b) si la relation &#224; trouver est (a)).
Nous proposons donc les mesures &#233;l&#233;mentaires suivantes entre deux relations attribu&#233;es entre
deux &#233;v&#233;nements, o&#249; S d&#233;signe l&#8217;ensemble des relations propos&#233;es par le syst&#232;me (a ou b ou c
ou ...) et H celle propos&#233;e par l&#8217;humain (apr&#232;s propagation des contraintes):
</p>
<p>finesse = |S&#8745;H||S| coh&#233;rence =
|S&#8745;H|
|H|
</p>
<p>La mesure globale de l&#8217;annotation est alors la moyenne de ces mesures sur tous les arcs compor-
tant de l&#8217;information selon l&#8217;humain (on exclut les arcs o&#249; toutes les relations sont possibles),
apr&#232;s saturation du graphe de relations entre &#233;v&#233;nements.
</p>
<p>D&#8217;une certaine fa&#231;on la finesse mesure la quantit&#233; d&#8217;information r&#233;cup&#233;r&#233;e par le syst&#232;me et
la coh&#233;rence donne une mesure des erreurs que commet le syst&#232;me vis &#224; vis de l&#8217;information
pr&#233;sente dans le texte. En ce sens finesse et coh&#233;rence sont les pendants des mesures de rappel
et pr&#233;cision quand on &#233;value des annotations simples5. Evidemment si S=H sur tous les arcs, les
mesures valent 1. Si le syst&#232;me ne donne aucune information, S est une disjonction de toutes
les relations, donc H &#8838; S, H &#8745; S = H et la coh&#233;rence vaut trivialement 1, mais la finesse sera
alors tr&#232;s faible.
</p>
<p>Ces mesures peuvent bien s&#251;r aussi &#234;tre utilis&#233;es pour estimer l&#8217;accord entre deux annotateurs
humains.
</p>
<p>5 R&#233;sultats
</p>
<p>Pour voir si la mesure a un sens, on s&#8217;en sert tout d&#8217;abord pour comparer un texte annot&#233;
al&#233;atoirement de la fa&#231;on suivante: &#224; chaque paire d&#8217;&#233;v&#233;nements successifs du texte on associe
</p>
<p>5Pr&#233;cision est un terme un peu ambigu puisqu&#8217;en fran&#231;ais il s&#8217;appliquerait mieux &#224; notre mesure de finesse,
alors que celle-ci correspond plut&#244;t au &quot;rappel&quot; d&#8217;informations ; pour &#233;viter les confusions, nous avons choisi de
nouveaux termes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Muller, Xavier Tannier
</p>
<p>une relation d&#8217;annotation au hasard, on sature le graphe, et on &#233;value les r&#233;sultats par rapport &#224;
l&#8217;annotation humaine. Le r&#233;sultat est typiquement tr&#232;s faible, comme on peut le voir table (3),
sur une d&#233;p&#234;che prise comme exemple.
</p>
<p>Ici on fait trois s&#233;ries de mesure: une sur les relations simples (non disjonctives) annot&#233;es par
l&#8217;humain (et apr&#232;s saturation), une sur toutes les relations d&#8217;annotation (simples ou disjonctions
de simples), et une sur l&#8217;&#233;quivalence en relation d&#8217;Allen (qui refl&#232;te peut-&#234;tre mieux le calcul
sous-jacent, au d&#233;triment de la mesure de la performance de la t&#226;che r&#233;elle vis&#233;e).
</p>
<p>Finesse Coh&#233;rence
relations d&#8217;annotations (toutes) 0.114 0.011
relations d&#8217;annotations (simples seulement) 0.125 0.095
relations d&#8217;Allen 0.083 0.094
</p>
<p>Table 3: Exemple d&#8217;&#233;valuation sur une annotation &quot;au hasard&quot;
</p>
<p>Nous avons ensuite utilis&#233; ces mesures pour estimer le rapport entre notre algorithme et
l&#8217;annotation humaine. Un ensemble, pour l&#8217;instant assez limit&#233;6, de 8 textes a &#233;t&#233; utilis&#233;, con-
stitu&#233; de d&#233;p&#234;ches prises au hasard sur le site de l&#8217;AFP, pour un total d&#8217;environ 2300 mots et
160 &#233;v&#233;nements 7. Ces textes avaient chacun entre 10 et 40 &#233;v&#233;nements, pour lesquels les taux
de rappel et de pr&#233;cision sont sup&#233;rieurs &#224; 97%. Nous avons alors compar&#233; les r&#233;sultats en
ne gardant que les &#233;v&#233;nements correctement reconnus. Cela ne propage pas les erreurs sur les
annotations au niveau de la coh&#233;rence, mais handicape bien s&#251;r le niveau de finesse, puisque les
inf&#233;rences sont faites avec moins d&#8217;informations. Nous avons fait la moyenne des r&#233;sultats par
texte.
</p>
<p>Finesse Ecart-type Coh&#233;rence E.-T.
relations d&#8217;annotations (toutes) 0.477499 0.286781 0.449899 0.175922
relations d&#8217;Allen 0.448222 0.289856 0.495755 0.204974
</p>
<p>Table 4: Evaluation des r&#233;sultats
</p>
<p>Ces r&#233;sultats semblent encourageants au vu des simplifications que nous avons op&#233;r&#233;es sur toute
la cha&#238;ne de traitement, m&#234;me si les variations importantes entre textes (et leur nombre encore
limit&#233;) doivent inciter &#224; la prudence. L&#8217;objectif &#233;tait surtout ici de montrer la faisabilit&#233; de
cette t&#226;che de fa&#231;on automatique, en fournissant &#233;galement des outils pertinents pour mesurer
le r&#233;sultat, et pour &#233;talonner chaque &#233;tape par la suite. Il faut noter que les points de compara-
ison manquent, puisqu&#8217;&#224; notre connaissance, seuls (Li et al., 2001) et (Mani &amp; Wilson, 2000)
mentionne avoir tent&#233; cette annotation, en marge de leurs syst&#232;mes d&#8217;annotation d&#8217;expressions
temporelles. Les premiers ne consid&#232;rent que les relations entre deux &#233;v&#233;nements pr&#233;sents dans
une m&#234;me phrase ; les seconds n&#8217;ont pas &#233;valu&#233; leur m&#233;thode.
</p>
<p>Enfin, remarquons que l&#8217;annotation humaine elle-m&#234;me est une t&#226;che difficile. Pour l&#8217;instant
les textes ont &#233;t&#233; annot&#233;s par les deux auteurs, avec r&#233;solution apr&#232;s coup des diff&#233;rences. Nous
n&#8217;avons donc pas de mesure inter-annotateurs, qui donnerait une borne maximum aux perfor-
mances que l&#8217;on peut atteindre d&#8217;un syst&#232;me8, mais nous pr&#233;voyons d&#8217;&#233;tudier ce probl&#232;me par
la suite.
</p>
<p>6Nous continuons le difficile processus d&#8217;annotation manuelle pour obtenir une base plus importante de
d&#233;p&#234;ches.
</p>
<p>7Par comparaison, le corpus anglais de (Setzer, 2001) comprend 6 d&#233;p&#234;ches pour moins de 2000 mots et 160
&#233;v&#233;nements.
</p>
<p>8Nous remercions le relecteur pour sa remarque &#224; ce propos.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation de relations temporelles dans des textes
</p>
<p>6 Conclusion
</p>
<p>L&#8217;objectif de ce travail &#233;tait de montrer la faisabilit&#233; de l&#8217;annotation automatique de relations
entre &#233;v&#233;nements dans un texte. Nous avons propos&#233; une m&#233;thode d&#8217;&#233;valutation de cette t&#226;che et
donn&#233; des r&#233;sultats pr&#233;liminaires.Il est bien &#233;vident que ceux-ci doivent &#234;tre affin&#233;s, et ce sur des
donn&#233;es plus nombreuses. Nous pouvons maintenant tenter d&#8217;am&#233;liorer certaines composantes
de la m&#233;thode : &#233;tiquettage, analyse syntaxique, r&#232;gles d&#8217;encha&#238;nements des temps de discours,
calcul des dates. Nous comptons en particulier &#233;valuer la pr&#233;cision de notre reconnaissance
d&#8217;adverbiaux temporels, qui sont la source majeure d&#8217;information de l&#8217;algorithme. La mesure
de proximit&#233; entre r&#233;seaux temporels devrait nous permettre d&#8217;ajuster ces divers &#233;l&#233;ments. Elle
devrait permettre aussi de pr&#233;parer le terrain pour une combinaison de l&#8217;approche symbolique
avec des m&#233;thodes d&#8217;apprentissage (il serait sans doute assez facile par exemple d&#8217;am&#233;liorer
les r&#232;gles d&#8217;encha&#238;nement temporels avec un simple algorithme local op&#233;rant sur l&#8217;espace des
r&#232;gles possibles, en partant de notre premier mod&#232;le).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABNEY S. (1996). Corpus-Based Methods in Language and Speech, chapter Part-of-Speech Tagging
and Partial Parsing. Kluwer Academic Publisher.
</p>
<p>ALLEN J. (1984). Towards a general theory of action and time. Artificial Intelligence, 23, 123&#8211;154.
</p>
<p>BRAS M. (1991). Calcul des structures temporelles du discours. PhD thesis, Universit&#233; Paul Sabatier,
Toulouse.
</p>
<p>BRUCE B. (1972). A model for temporal references and its application in a question answering program.
Artificial Intelligence, 3(1-3), 1&#8211;25.
</p>
<p>FILATOVA E. &amp; HOVY E. (2001). Assigning time-stamps to event-clauses. In (Harper et al., 2001).
</p>
<p>GAGNON M. &amp; LAPALME G. (1996). From conceptual time to linguistic time. Computational linguis-
tics, 22(1), 91&#8211;127.
</p>
<p>GROVER C., HITZEMAN J. &amp; MOENS M. (1995). Algorithms for analysing the temporal structure of
discourse. In Sixth International Conference of the European Chapter of the Association for Computa-
tional Linguistics: ACL.
</p>
<p>L. HARPER, I. MANI &amp; B. SUNDHEIM, Eds. (2001). ACL Workshop on Temporal and Spatial Infor-
mation Processing, 39th Annual Meeting and 10th Conference of the European Chapter. Association for
Computational Linguistics.
</p>
<p>KAMEYAMA M., PASSONNEAU R. &amp; POESIO M. (1993). Temporal centering. In Proceedings ACL
1993, p. 70&#8211;77.
</p>
<p>KATZ G. &amp; AROSIO F. (2001). The annotation of temporal information in natural language sentences.
In (Harper et al., 2001), p. 104&#8211;111.
</p>
<p>LI W., WONG K.-F. &amp; YUAN C. (2001). A model for processing temporal reference in chinese. In
(Harper et al., 2001).
</p>
<p>MANI I. &amp; WILSON G. (2000). Robust temporal processing of news. In Proceedings ACL 2000.
</p>
<p>SCHMID H. (1994). Probabilistic part-of-speech tagging using decision trees. In International Confer-
ence on New Methods in Language Processing.
</p>
<p>SETZER A. (2001). Temporal Information in Newswire Articles: an Annotation Scheme and Corpus
Study. PhD thesis, University of Sheffield, UK.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Muller, Xavier Tannier
</p>
<p>SHILDER F. &amp; HABEL C. (2001). From temporal expressions to temporal information: Semantic tag-
ging of news messages. In (Harper et al., 2001), p. 65&#8211;72.
</p>
<p>SONG F. &amp; COHEN R. (1991). Tense interpretation in the context of narrative. In Proceedings of
AAAI&#8217;91, p. 131&#8211;136.
</p>
<p>STEEDMAN M. (1997). Temporality. In J. V. BENTHEM &amp; A. TER MEULEN, Eds., Handbook of Logic
and Language. Elsevier Science B.V.
</p>
<p>VAZOV N. (2001). A system for extraction of temporal expressions from french texts based on syntactic
and semantic constraints. In (Harper et al., 2001).
</p>
<p>WILSON G., MANI I., SUNDHEIM B. &amp; FERRO L. (2001). A multilingual approach to annotating and
extracting temporal information. In (Harper et al., 2001).</p>

</div></div>
</body></html>