<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Rep&#233;rage et exploitation d&#8217;&#233;nonc&#233;s d&#233;finitoires en corpus pour l&#8217;aide &#224; la construction d&#8217;ontologie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Rep&#233;rage et exploitation d&#8217;&#233;nonc&#233;s d&#233;finitoires en corpus
pour l&#8217;aide &#224; la construction d&#8217;ontologie
</p>
<p>V&#233;ronique Malais&#233; (1, 2), Pierre Zweigenbaum (2) et Bruno Bachimont (1)
(1) DRE de l&#8217;Institut National de l&#8217;Audiovisuel
</p>
<p>4, avenue de l&#8217;Europe, 94366 Bry-sur-Marne Cedex
{vmalaise, bbachimont}@ina.fr
</p>
<p>(2) STIM/AP-HP, ERM 202 INSERM &amp; CRIM-INaLCO
91, boulevard de l&#8217;H&#244;pital, 75013 Paris
</p>
<p>pz@biomath.jussieu.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Pour construire une ontologie, un mod&#233;liseur a besoin d&#8217;objecter des informations s&#233;mantiques
sur les termes principaux de son domaine d&#8217;&#233;tude. Les outils d&#8217;exploration de corpus peu-
vent aider &#224; rep&#233;rer ces types d&#8217;information, et l&#8217;identification de couples d&#8217;hyperonymes a fait
l&#8217;objet de plusieurs travaux. Nous proposons d&#8217;exploiter des &#233;nonc&#233;s d&#233;finitoires pour extraire
d&#8217;un corpus des informations concernant les trois axes de l&#8217;ossature ontologique : l&#8217;axe ver-
tical, li&#233; &#224; l&#8217;hyperonymie, l&#8217;axe horizontal, li&#233; &#224; la co-hyponymie et l&#8217;axe transversal, li&#233; aux
relations du domaine. Apr&#232;s un rappel des travaux existants en rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires
en TAL, nous d&#233;veloppons la m&#233;thode que nous avons mise en place, puis nous pr&#233;sentons son
&#233;valuation et les premiers r&#233;sultats obtenus. Leur rep&#233;rage atteint de 10% &#224; 69% de pr&#233;cision
suivant les patrons, celui des unit&#233;s lexicales varie de 31% &#224; 56%, suivant le r&#233;f&#233;rentiel adopt&#233;.
</p>
<p>In order to build an ontology, a modeler needs to objectivate semantic information about the
main terms of his domain. Some tools meant to explore corpora can help pointing out this
information, and previous work has focused on the identification of hyperonyms. We propose
here to rely on lay definitions to extract the information necessary to build an ontology structure:
the vertical axis, related to hypernymy, the horizontal axis, related to co-hyponymy, and the
transversal axis, linked to domain-related cross relations. After a survey of previous work
about the extraction of definitions in NLP, we develop the method we followed, then present
its evaluation criteria and the first results. The mining of lay definitions reached from 10 to 69%
of precision, depending on the pattern involved, the mining of lexical items varied from 31 to
56%, following the reference considered.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires, relations s&#233;mantiques, patrons lexico-syntaxiques.
Mining definitions, semantic relations, lexico-syntactic pattern.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Pierre Zweigenbaum et Bruno Bachimont
</p>
<p>1 Introduction
</p>
<p>La construction d&#8217;ontologie &#224; partir de corpus textuel est un des champs explor&#233;s en Traite-
ment Automatique des Langues (TAL). La position g&#233;n&#233;ralement adopt&#233;e consiste &#224; concevoir
des m&#233;thodes et outils pour aider un mod&#233;liseur d&#8217;ontologie dans sa t&#226;che : par exemple Ter-
minae (Szulman S., Bi&#233;bow B., Aussenac-Gilles N., 2002), ou la combinaison Syntex-Upery
(Bourigault D. et Lame G., 2002). L&#8217;approche retenue consid&#232;re une ontologie comme une
terminologie construite et structur&#233;e &#224; partir de corpus, &#224; formaliser. Il existe &#233;galement un
certain nombre d&#8217;approches concernant directement cette structuration de terminologie, soit &#224;
partir de patrons lexico-syntaxiques (de (Hearst M., 1992) &#224; (S&#233;gu&#233;la P. et Aussenac-Gilles N.,
1999), ou dans le syst&#232;me KAON &#8211; http://kaon.semanticweb.org/), soit &#224; partir de
marqueurs associ&#233;s &#224; des r&#232;gles (Le Priol F., 2001). Dans les deux cas, l&#8217;approche se focalise
principalement sur l&#8217;hyperonymie. Mais d&#8217;autres types de relations sont &#224; importantes pour la
construction d&#8217;ontologie : la relation horizontale entre un terme et ses co-hyponymes, et les
relations transversales qui relient un terme &#224; un autre de mani&#232;re non hi&#233;rarchique, mais ac-
tancielle (comme personne&#0;est_protagoniste_de&#1;action). La relation horizontale garantit la
validit&#233; d&#8217;un &#171;palier&#187; ontologique et a des cons&#233;quences sur la profondeur de la hi&#233;rarchie, et
les relations transversales permettent d&#8217;exprimer des connaissances &#224; partir des termes hi&#233;rar-
chis&#233;s.
Certains &#233;nonc&#233;s sont particuli&#232;rement propices au rep&#233;rage de ces diff&#233;rentes relations : il
s&#8217;agit des &#233;nonc&#233;s d&#233;finitoires. Rebeyrolle et Condamines (2000), par exemple, y recherchaient
l&#8217;expression de la relation d&#8217;hyperonymie et de meronymie. Nous essayons de rep&#233;rer &#224; par-
tir de ces &#233;nonc&#233;s des &#233;l&#233;ments lexicaux pouvant &#233;galement aider &#224; la structuration horizon-
tale et transversale de l&#8217;ontologie. Notre travail s&#8217;attache principalement &#224; la d&#233;tection et &#224;
l&#8217;exploitation des &#233;nonc&#233;s d&#233;finitoires, mais nous a &#233;galement conduit &#224; consid&#233;rer d&#8217;autres
types de contextes int&#233;ressants.
Apr&#232;s un rappel des travaux existants en rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires (section 2), nous
pr&#233;sentons notre exp&#233;rimentation sur le rep&#233;rage et l&#8217;exploitation de ces &#233;nonc&#233;s, que nous
avons test&#233;s sur un petit corpus, centr&#233; sur la th&#233;matique de la petite enfance (nos exemple sont
extraits de ce test), puis &#233;valu&#233;s sur un corpus de di&#233;t&#233;tique (section 3). Nous discutons les
r&#233;sultats obtenus (section 4) et concluons sur des perspectives &#224; ce travail (section 5).
</p>
<p>2 Travaux ant&#233;rieurs
</p>
<p>Les &#233;nonc&#233;s d&#233;finitoires (ED) qui nous int&#233;ressent sont des formulations suivant la fonction
m&#233;talinguistique de la langue dans sa pratique ordinaire. Auger (1997) a r&#233;f&#233;renc&#233; plusieurs
typologies de d&#233;finitions de dictionnaires et fournit un ensemble d&#8217;indices terminologiques
d&#8217;&#233;nonc&#233;s d&#233;finitoires pour leur rep&#233;rage en corpus. L&#8217;auteur mentionne les indices de bas
niveau (autour de la ponctuation), ou de haut niveau (certaines formes syntaxiques) pour rep&#233;rer
ces ED, mais consacre son travail &#224; leur rep&#233;rage au moyen de marqueurs lexicaux. Condamines
(1993), Rebeyrolle (2000) et Pearson (1998) pr&#233;sentent des &#233;l&#233;ments th&#233;oriques et des patrons
lexico-syntaxiques concrets pour le rep&#233;rage d&#8217;ED en corpus, int&#233;grant dans leurs sch&#233;mas des
contraintes li&#233;es &#224; la ponctuation. Muresan et Klavans (2002) proposent une alternative aux
patrons lexico-syntaxiques, avec leur outil DEFINDER bas&#233; sur des r&#232;gles linguistiques et des
contraintes. Rebeyrolle (2000) et Muresan et Klavans (2002) pr&#233;sentent des &#233;valuations de leurs
outils, en prenant comme r&#233;f&#233;rence respectivement un corpus &#233;tiquet&#233; manuellement et un en-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage et exploitation d&#8217;&#233;nonc&#233;s d&#233;finitoires en corpus pour l&#8217;aide &#224; la
construction d&#8217;ontologie
</p>
<p>semble de textes &#233;talon. Ils obtiennent des taux de pr&#233;cision de 17,95 &#224; 79,19% pour le premier
(suivant les types de patrons consid&#233;r&#233;s) et de 86,95% pour le second, et de 94,75 &#224; 100% et
75,47% pour le rappel.
Nous avons choisi de nous fonder sur des patrons lexico-syntaxiques pour le rep&#233;rage d&#8217;&#233;nonc&#233;s
d&#233;finitoires, ce qui nous a permis de nous appuyer sur les travaux ant&#233;rieurs de cette cat&#233;gorie.
Ceux-ci &#233;tant en majorit&#233; orient&#233;s vers les indices lexicaux, nous avons tent&#233; de prendre en
consid&#233;ration davantage d&#8217;indices li&#233;s &#224; la ponctuation.
</p>
<p>3 Rep&#233;rage et exploitation de d&#233;finitions en corpus
</p>
<p>Nous d&#233;taillons ci-dessous le cadre de la constitution de nos deux corpus. Nous pr&#233;sentons
ensuite le principe de fonctionnement du programme d&#8217;extraction, puis la mise au point de nos
patrons lexico-syntaxiques, et enfin les modalit&#233;s d&#8217;&#233;valuation de ces patrons.
</p>
<p>3.1 Constitution des corpus
</p>
<p>Le premier corpus est centr&#233; sur le th&#232;me de la petite enfance, abord&#233; suivant les disciplines
de l&#8217;anthropologie et de la psychologie. Cette th&#233;matique &#233;tait l&#8217;une de celles s&#233;lectionn&#233;es
lors du projet Opales (http://opales.ina.fr), auquel nous avons particip&#233;. Les textes
ont &#233;t&#233; collect&#233;s de deux mani&#232;res : une partie du corpus a &#233;t&#233; constitu&#233;e manuellement de
notices documentaires (d&#8217;un volume de 5 Kmots), et une autre partie automatiquement &#224; par-
tir du web suivant les principes propos&#233;s par (Grabar N. et Berland S., 2001) et au moyen
des programmes mis au point par les auteurs (71 Kmots, soit un total d&#8217;environ 76 Kmots).
Le deuxi&#232;me corpus concerne la di&#233;t&#233;tique, notamment dans la perspective du maintien des
personnes &#226;g&#233;es en bonne sant&#233;. Il a &#233;t&#233; constitu&#233; automatiquement &#224; partir des articles franco-
phones r&#233;f&#233;renc&#233;s par le portail CISMeF (http://www.chu-rouen.fr/cismef/) sous
les arborescences &#171;di&#233;t&#233;tique&#187; et &#171;nutrition&#187;, convertis au format texte. Il compte 480 Kmots.
Les corpus sont analys&#233;s syntaxiquement par Cordial Analyseur (soci&#233;t&#233; Synapse &#8211; http:
//www.synapse-sa.com/), et le fichier produit associe chaque mot du corpus &#224; son &#233;ti-
quette morphosyntaxique et &#224; sa fonction grammaticale (sujet, objet, verbe recteur, etc.).
</p>
<p>3.2 M&#233;thode de rep&#233;rage des informations s&#233;mantiques
</p>
<p>Nous cherchons &#224; pr&#233;senter &#224; un mod&#233;liseur d&#8217;ontologie des contextes et des &#233;l&#233;ments qui
l&#8217;aident dans sa t&#226;che. Notre outil propose pour cela une exploration cibl&#233;e du corpus textuel,
dont il pr&#233;sente le r&#233;sultat en tant que base de travail &#224; l&#8217;utilisateur. Nous cherchons &#224; rep&#233;rer
les &#233;nonc&#233;s d&#233;finitoires au moyen de patrons lexico-syntaxiques, et &#224; cibler &#224; l&#8217;int&#233;rieur de ces
&#233;nonc&#233;s l&#8217;&#233;l&#233;ment d&#233;fini : le definiendum. Dans un premier temps, nous avons observ&#233; que ce
definiendum occupait deux places privil&#233;gi&#233;es. Nous avons donc pens&#233; extraire les unit&#233;s lexi-
cales qui occupaient ces positions pour pr&#233;senter &#224; l&#8217;utilisateur non seulement l&#8217;&#233;nonc&#233; d&#233;fini-
toire, mais le definiendum concern&#233;. Nous avons alors remarqu&#233; que les deux unit&#233;s lexicales
propos&#233;es dans ce cadre entretenaient des relations s&#233;mantiques int&#233;ressantes (figure 1), et nous
avons tent&#233; d&#8217;en proposer une typologie.
La premi&#232;re question qui se pose est celle du rep&#233;rage des &#233;nonc&#233;s d&#233;finitoires. Les patrons</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Pierre Zweigenbaum et Bruno Bachimont
</p>
<p>Phrase
</p>
<p>Phrase
</p>
<p>Phrase
</p>
<p>UL UL
</p>
<p>Texte
</p>
<p>Extraction
d'&#233;nonc&#233;s
d&#233;finitoires
</p>
<p>Extraction d'unit&#233;s lexicales
</p>
<p>Proposition d'une relation
s&#233;mantique
</p>
<p>Figure 1: Suite des op&#233;rations r&#233;alis&#233;es &#224; partir du corpus sur la base de patrons lexico-
syntaxiques.
</p>
<p>lexico-syntaxiques que nous employons pour cela s&#8217;articulent autour d&#8217;un ensemble de mar-
queurs, c&#8217;est-&#224;-dire des mots ou expressions qui sont souvent r&#233;v&#233;lateurs d&#8217;un &#233;nonc&#233; d&#233;fini-
toire : &#171;d&#233;fini comme&#187;, &#171;c&#8217;est-&#224;-dire&#187;, &#171;emploie le terme de&#187;, etc. La finalit&#233; d&#8217;un patron
lexico-syntaxique est de pr&#233;ciser les contextes lexicaux et syntaxiques dans lesquels un mar-
queur introduit bien l&#8217;une des relations s&#233;mantiques recherch&#233;es. Par exemple, autour du mar-
queur &#171;comme&#187;, nous en avons d&#233;fini trois :
</p>
<p>&#0; SN d&#233;finir MOTS* comme SN;
</p>
<p>&#0; SN comme DET{1,3} SN;
</p>
<p>&#0; SN comme (celui|ceux|celle|celles) VERBE SN.
</p>
<p>Ces patrons peuvent utiliser des informations sur les formes (comme), lemmes (d&#233;finir), cat&#233;-
gories morphosyntaxiques (DET pour d&#233;terminant) et fonctions syntaxiques calcul&#233;s pr&#233;c&#233;dem-
ment. L&#8217;&#233;toile signifie la pr&#233;sence facultative de l&#8217;&#233;l&#233;ment et les accolades la possibilit&#233; de
r&#233;p&#233;ter une &#224; trois fois l&#8217;&#233;l&#233;ment la pr&#233;c&#233;dant. Nous limitons notre extraction d&#8217;&#233;nonc&#233;s d&#233;fini-
toires au contexte de la phrase parce que c&#8217;&#233;tait le plus souvent suffisant. Nous verrons dans
les perspectives les traitements compl&#233;mentaires que nous avons envisag&#233;s dans certains cas de
figure contraires.
La deuxi&#232;me question &#224; traiter est celle du rep&#233;rage des unit&#233;s lexicales en relation. Nous avons
d&#233;fini pour cela deux types de strat&#233;gies :
</p>
<p>&#0; Pour les patrons poss&#233;dant un marqueur verbal, on cherche &#224; exploiter les fonctions syn-
taxiques associ&#233;es &#224; ce verbe : on extrait son sujet et son objet. Par exemple, dans le cas
de &#171;Taouret dont le nom signifie La grande est con&#231;ue comme [...]&#187;, les unit&#233;s lexicales
sujet et objet de signifier sont extraites : &#171;Taouret dont le nom&#187; et &#171;La grande&#187;. Des con-
traintes suppl&#233;mentaires s&#8217;appliquent au sujet : il doit avoir plus d&#8217;un mot (cela &#233;limine
les pronoms) et dans le cas o&#249; cette extraction fonctionnelle ne donne pas de r&#233;sultat, la
deuxi&#232;me strat&#233;gie est &#233;galement tent&#233;e;
</p>
<p>&#0; La seconde strat&#233;gie consiste en une exploration contextuelle : on extrait le groupe fonc-
tionnel imm&#233;diatement &#224; gauche et celui imm&#233;diatement &#224; droite du marqueur, dans le
cas pr&#233;c&#233;demment cit&#233; ainsi que pour les marqueurs non verbaux. Par exemple dans la
phrase : &#171;[...]les yeux qui ont une petite plaie comme une griffure ([...]&#187;, &#171;ont une petite
plaie&#187; et &#171;une griffure (&#187; sont extraits de mani&#232;re contextuelle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage et exploitation d&#8217;&#233;nonc&#233;s d&#233;finitoires en corpus pour l&#8217;aide &#224; la
construction d&#8217;ontologie
</p>
<p>L&#8217;interface laissant la possibilit&#233; de corriger les unit&#233;s lexicales propos&#233;es, nous avons essay&#233;
de proposer une s&#233;quence qui couvre au minimum l&#8217;unit&#233; lexicale int&#233;ressante, m&#234;me si elle est
entour&#233;e de mots parasites, &#224; une extraction plus cibl&#233;e donnant de moins bons r&#233;sultats.
La derni&#232;re question concerne la d&#233;termination des relations s&#233;mantiques. Chaque patron
sert &#224; d&#233;tecter une relation s&#233;mantique entre les unit&#233;s lexicales extraites, qui est propos&#233;e &#224;
l&#8217;utilisateur pour validation ou correction &#233;ventuelle. Par exemple, les patrons autour de la pa-
renth&#232;se permettent d&#8217;extraire des unit&#233;s en relation de paradigme (des &#233;l&#233;ments d&#8217;un tax&#232;me
n&#8217;&#233;tant ni synonymes ni antonymes, comme une m&#232;re et un p&#232;re), d&#8217;hyperonymie (le mo&#239;se
(ou berceau)) ou de d&#233;finition &#171;fonctionnelle&#187; : &#171;[...]l&#8217;anthropologie (qui s&#8217;occupe surtout des
contextes et des significations culturelles), [...]&#187;. Cet ensemble de relations est propos&#233; lors de
l&#8217;extraction de phrases correspondant &#224; ces patrons (voir figure 2), avec en t&#234;te de liste celle qui
correspond sp&#233;cifiquement &#224; la forme syntaxique relev&#233;e autour de la parenth&#232;se.
L&#8217;ensemble de la m&#233;thode est impl&#233;ment&#233;e en XSLT, &#224; l&#8217;aide du processeur XLST Xalan
(http://xml.apache.org/#xalan), par souci de coh&#233;rence avec des choix ant&#233;rieurs
concernant le format du corpus (XML) et nos outils de gestion d&#8217;ontologie (&#233;diteur DOE,
(Troncy R. et Isaac A., 2002)) ; les patrons sont directement exprim&#233;s en XSLT. Le r&#233;sultat
du traitement est un formulaire HTML qui sert d&#8217;interface de validation &#224; l&#8217;utilisateur. La fi-
gure 2 montre une copie d&#8217;&#233;cran de cette interface. Chaque rang&#233;e du tableau correspond &#224;
l&#8217;appariement d&#8217;un patron avec une phrase du corpus ; elle pr&#233;sente les deux unit&#233;s lexicales
extraites, la phrase concern&#233;e et la relation s&#233;mantique propos&#233;e entre les deux unit&#233;s lexicales ;
un lien permet de retourner au corpus pour y examiner la phrase dans son contexte d&#8217;origine, et
la derni&#232;re colonne permet de valider l&#8217;association.
</p>
<p>Figure 2: L&#8217;interface de visualisation.
</p>
<p>3.3 Mise au point des patrons lexico-syntaxiques
</p>
<p>Nous avons constitu&#233; une liste de marqueurs pour le rep&#233;rage des &#233;nonc&#233;s d&#233;finitoires &#224; partir,
notamment, des travaux de (Auger A., 1997), (Rebeyrolle J., 2000), et de (Fuchs C., 1994).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Pierre Zweigenbaum et Bruno Bachimont
</p>
<p>C&#8217;est en pr&#233;cisant leurs contextes d&#8217;usage que nous avons construit nos patrons lexico-syntax-
iques, suivant la m&#233;thodologie de (S&#233;gu&#233;la P. et Aussenac-Gilles N., 1999). La n&#233;cessit&#233; de
leur adaptation en patrons li&#233;s au corpus tient &#224; la polys&#233;mie des marqueurs lexicaux suivant
le domaine d&#233;crit (par exemple &#171;baptiser&#187; peut &#234;tre un marqueur de d&#233;finition fiable, sauf dans
le cas d&#8217;un corpus centr&#233; sur la petite enfance, o&#249; il d&#233;signera plut&#244;t le bapt&#234;me), et &#224; une
variabilit&#233; des formes syntaxiques qui sont plus ou moins complexes &#224; d&#233;crire suivant le genre
de documents pris en compte dans le corpus. Nous distinguons quatre types de marqueurs,
d&#233;finissant quatre groupes de patrons :
</p>
<p>&#0; Les marqueurs m&#233;talinguistiques &#224; utiliser ind&#233;pendamment (au nombre de 9) : appeler,
baptiser, d&#233;finir comme, d&#233;nommer, d&#233;noter, d&#233;signer, nommer, signifier, vouloir dire;
</p>
<p>&#0; Les marqueurs m&#233;talinguistiques nominaux (11) : appellation, acception, concept, d&#233;nom-
ination, d&#233;signation, expression, mot, nom, notion, terme, vocable, &#224; associer &#224; un verbe
support parmi : appliquer, donner, employer, prendre, porter, recevoir, r&#233;f&#233;rer, renvoyer,
r&#233;server, utiliser;
</p>
<p>&#0; Les marqueurs lexicaux n&#8217;&#233;tant pas explicitement m&#233;talinguistiques, ou ceux de refor-
mulation (21) : c&#8217;est-&#224;-dire, en d&#8217;autres termes, soit, &#224; savoir, en quelques sortes, une
sorte de, enfin, il s&#8217;agit de, entendre par, vouloir dire, indiquer, comme, dit, par exemple,
autrement dit, m&#234;me chose que, &#233;quivaloir &#224;, employer pour, marque, expliquer, pr&#233;ciser;
</p>
<p>&#0; Les ponctuations : parenth&#232;ses, guillemets et tirets d&#8217;incise sont &#233;galement mentionn&#233;s
dans la litt&#233;rature. Nous nous sommes int&#233;ress&#233;s aux contextes d&#233;finitoires autour de la
parenth&#232;se, et l&#8217;observation du premier corpus nous a permis de mettre au point quatre
patrons synth&#233;tisant des contextes &#171;int&#233;ressants&#187; autour de cet indice de bas niveau. Nous
nous sommes aper&#231;us que, outre la d&#233;finition, nous pouvions extraire des paradigmes
(aide &#224; la mod&#233;lisation horizontale de l&#8217;ontologie) et des hyperonymes. Nous avons alors
d&#233;cid&#233; d&#8217;inclure ces quatre sch&#233;mas &#224; l&#8217;&#233;valuation de la m&#233;thode, m&#234;me s&#8217;ils n&#8217;&#233;taient
pas exclusivement cibl&#233;s sur l&#8217;extraction de d&#233;finitions.
</p>
<p>Les relations s&#233;mantiques que l&#8217;on rencontre entre les deux unit&#233;s lexicales extraites corres-
pondent non seulement &#224; de l&#8217;hyperonymie, mais aussi &#224; d&#8217;autres relations : la d&#233;finition ne
s&#8217;exprime pas toujours suivant le canon aristot&#233;licien de genre proche et diff&#233;rences sp&#233;cifiques.
On trouve &#233;galement des d&#233;finitions par synonymie (&#171;[...], et les repr&#233;sentations sociales des
adultes (aussi appel&#233;es ethnoth&#233;ories parentales)[...]&#187;), par exemplification (&#171;[...] &#233;tudi&#233;s non
pas en laboratoire ou dans des situations artificielles (comme les tests), mais dans les contextes
quotidiens.&#187;), par composition (&#171;Ici, les deux moments essentiels du d&#233;roulement du rituel que
constituent la s&#233;paration et l&#8217;agr&#233;gation, [...]&#187;) ou de type &#171;fonctionnel&#187; ([...]&#171;la psychologie
(qui a tendance &#224; ne s&#8217;int&#233;resser qu&#8217;&#224; l&#8217;individu)&#187;), etc. Nous avons envisag&#233; les relations suiv-
antes entre nos unit&#233;s lexicales : hyperonymie, synonymie, antonymie, paradigme, ou &#171;rapport
fonctionnel&#187; (correspondant &#224; une relation transversale de l&#8217;ontologie : une relation qui n&#8217;est
pas directement hi&#233;rarchisante, mais qui lie des termes de diff&#233;rentes branches).
</p>
<p>3.4 M&#233;thode d&#8217;&#233;valuation des r&#233;sultats
</p>
<p>Les mesures classiques pour &#233;valuer un tel outil sont la pr&#233;cision (la proportion d&#8217;extractions
correctes parmi les r&#233;sultats du syst&#232;me) et le rappel (la proportion d&#8217;extractions du syst&#232;me</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage et exploitation d&#8217;&#233;nonc&#233;s d&#233;finitoires en corpus pour l&#8217;aide &#224; la
construction d&#8217;ontologie
</p>
<p>parmi les r&#233;sultats attendus selon un &#233;talon de r&#233;f&#233;rence). Nous n&#8217;avons pas encore termin&#233; la
constitution de l&#8217;&#233;talon de r&#233;f&#233;rence, et nous proposons donc &#224; ce stade une &#233;valuation de la
pr&#233;cision. Celle-ci comporte deux parties : une premi&#232;re validation autour de l&#8217;&#233;nonc&#233; global
(&#233;nonc&#233; d&#233;finitoire ou v&#233;hiculant la relation s&#233;mantique pr&#233;dite par le patron), et une autre con-
cernant les unit&#233;s lexicales extraites &#224; partir de cet &#233;nonc&#233; global.
La validation concernant l&#8217;&#233;nonc&#233; global s&#8217;articule en deux points : d&#8217;une part est-il conforme
&#224; la relation s&#233;mantique annonc&#233;e, et, si ce n&#8217;est pas le cas, cet &#233;nonc&#233; nous int&#233;resse-t-il ?
Certains patrons peuvent &#234;tre sous-sp&#233;cifi&#233;s par rapport au corpus, et extraire des phrases ne
correspondant pas aux &#233;nonc&#233;s attendus. Mais si l&#8217;extrait s&#8217;av&#232;re &#234;tre int&#233;ressant parce qu&#8217;il
pr&#233;sente des relations structurantes et des unit&#233;s lexicales propres &#224; &#234;tre int&#233;gr&#233;es &#224; l&#8217;ontologie,
nous ne le rejetons pas, mais essaierons dans un deuxi&#232;me temps de cr&#233;er deux patrons distincts
et de g&#233;rer la nouvelle relation observ&#233;e. Par exemple, le marqueur &#171;signifier&#187; permet d&#8217;extraire
des &#233;nonc&#233;s d&#233;finitoires et des phrases exprimant des implications li&#233;es au domaine, respective-
ment &#171;[...] le signe hi&#233;roglyphique sa qui signifie la protection.&#187; et &#171; Les investissements dans
le d&#233;veloppement de la petite enfance pourraient signifier de meilleurs services [...]&#187;. Ce deux-
i&#232;me type d&#8217;&#233;nonc&#233; est &#171;mis en r&#233;serve&#187; pour cr&#233;er deux patrons sp&#233;cifiques &#224; partir du m&#234;me
marqueur. Nous avons donc deux cat&#233;gories dans notre &#233;valuation : &#233;nonc&#233; conforme &#224; la re-
lation s&#233;mantique annonc&#233;e (d&#233;finition, hyperonymie, paradigme), ou &#233;nonc&#233; int&#233;ressant &#224; un
autre titre.
La validation des unit&#233;s lexicales (UL) extraites de la phrase s&#8217;articule &#233;galement en deux points :
l&#8217;UL propos&#233;e est-elle pertinente, et son extraction est-elle correcte ? C&#8217;est-&#224;-dire qu&#8217;un pre-
mier niveau de jugement consiste &#224; v&#233;rifier que les UL extraites sont bien celles que l&#8217;on cherche
&#224; avoir &#224; partir de l&#8217;&#233;nonc&#233; d&#233;finitoire. Par exemple, dans la phrase : &#171;Le concept &#8220;&#233;ducation &quot;
est souvent d&#233;fini de fa&#231;on &#233;troite, parfois m&#234;me comme uniquement la scolarisation.&#187;, il s&#8217;agit
de trouver au minimum &#233;ducation et scolarisation. Un deuxi&#232;me niveau concerne la d&#233;limitation
de l&#8217;extrait propos&#233; par rapport &#224; l&#8217;UL int&#233;ressante. Trois cas de figure peuvent se produire :
ou l&#8217;extrait correspond exactement &#224; l&#8217;UL, ou celui-ci englobe l&#8217;UL (n&#233;cessitant un nettoyage
manuel de la s&#233;quence), ou celui-ci ne contient pas toute l&#8217;UL (et il faut rajouter manuellement
les parties manquantes). Nous consid&#233;rons que l&#8217;extrait correspond exactement &#224; l&#8217;UL m&#234;me
s&#8217;il compte l&#8217;article pr&#233;c&#233;dant le nom ou le groupe nominal constituant l&#8217;UL.
</p>
<p>4 Application aux deux corpus
</p>
<p>Nous avons appliqu&#233; notre m&#233;thode et les patrons au corpus sur la petite enfance (tableau 1)
et sur la di&#233;t&#233;tique (tableau 2). Les tableaux 1 et 2 pr&#233;sentent dans les premi&#232;res colonnes
le nombre de patrons lexico-syntaxiques correspondant &#224; chacun des groupes d&#233;finis en 3.3 :
les patrons centr&#233;s sur des verbes m&#233;talinguistique (ligne M&#233;ta1), sur des &#233;l&#233;ments lexicaux
m&#233;talinguistiques combin&#233;s : un terme et un verbe m&#233;talinguistique (ligne M&#233;ta2), sur des &#233;l&#233;-
ments lexicaux non sp&#233;cifiquement m&#233;talinguistiques (ligne Ling.), et enfin sur des donn&#233;es
de ponctuation (ligne Ponct.). Les colonnes suivantes pr&#233;sentent les nombres d&#8217;extraction de
phrases correspondant &#224; la relation s&#233;mantique pr&#233;dite par le patron (d&#233;finition, hyperonymie,
paradigme), le nombre de phrases ne correspondant pas &#224; la relation pr&#233;dite mais jug&#233;es in-
t&#233;ressantes (et servant de base pour raffiner le patron actuel suivant les diff&#233;rents cas). Les
derni&#232;res colonnes concernent l&#8217;&#233;valuation des unit&#233;s lexicales : sont-elles correctes ou fausses,
et, si correctes, sont-elles exactement extraites par nos programmes, incluses dans l&#8217;extrait pro-
pos&#233; ou partiellement extraites ? Les donn&#233;es sont d&#8217;abord pr&#233;sent&#233;es sous la forme du nombre
d&#8217;extraits valid&#233;s, puis suivant leurs taux de &#171;pr&#233;cision relative&#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Pierre Zweigenbaum et Bruno Bachimont
</p>
<p>Type Nb
pa-
trons
</p>
<p>Nb ex-
traits
</p>
<p>Phrases suiv-
ant la relation
s&#233;mantique
</p>
<p>Taux de
pr&#233;cision
</p>
<p>Nb phrases
int&#233;res-
santes
</p>
<p>Total Pr&#233;cision
des deux
types
d&#8217;&#233;nonc&#233;s
</p>
<p>M&#233;ta1 7 32 16 50% 11 27 84%
M&#233;ta2 20 14 7 50% 4 11 78%
Ling 24 97 31+7 (2) 39% 34 72 74%
Ponct 4 79 22 27% 7+45 (1) 74 93%
Total 55 222 83 37% 101 184 82%
Type Nb
</p>
<p>pa-
trons
</p>
<p>UL ex-
acte
</p>
<p>Taux de
pr&#233;cision
</p>
<p>UL in-
cluse
</p>
<p>Pr&#233;cision
des deux
types d&#8217;UL
</p>
<p>UL
incom-
pl&#232;te
</p>
<p>UL
fausse
</p>
<p>Total
</p>
<p>M&#233;ta1 7 14 26% 14 88% 19 7 54
M&#233;ta2 20 2 9% 8 45% 3 9 22
Ling 24 6 4% 48 37% 6 84 144
Ponct 4 92 62% 29 81% 22 5 148
Total 55 114 31% 99 57% 50 105 368
</p>
<p>Table 1: Extraction des donn&#233;es sur le corpus &#171;petite enfance&#187;.
</p>
<p>Au total, la pr&#233;cision des &#233;nonc&#233;s correspondant &#224; la relation s&#233;mantique (pr&#233;cision &#171;stricte&#187;)
est de 37 % et celle des unit&#233;s lexicales est de 31 %. Si l&#8217;on prend en compte &#233;galement les
phrases &#171;int&#233;ressantes&#187;, cette pr&#233;cision s&#8217;&#233;l&#232;ve &#224; 63 %. De plus, 45 (correspondant au (1)) des
phrases rep&#233;r&#233;es par l&#8217;un des patrons de ponctuation apportaient une relation de traduction en-
tre les deux unit&#233;s lexicales ; cette relation n&#8217;&#233;tait une hyperonymie, mais une reformulation
dans une autre langue que l&#8217;on peut &#233;galement consid&#233;rer comme int&#233;ressante, amenant alors la
pr&#233;cision &#224; 82 %.
Les patrons des deux groupes m&#233;talinguistiques obtiennent la meilleure pr&#233;cision stricte (50
%), mais un nombre absolu d&#8217;&#233;nonc&#233;s plus faible (23 au total contre 32 pour le groupe Ling
et 22 pour le groupe Ponct). On retrouve une opposition classique entre rendement et pr&#233;ci-
sion. Cette observation peut aussi &#234;tre li&#233;e au fait que les textes ne relevant pas de pratiques
terminographiques auraient plus souvent recours &#224; des gloses de reformulation pour introduire
des &#233;nonc&#233;s d&#233;finitoires, et ces gloses sont rep&#233;r&#233;es par nos patrons des groupes Ling et Ponct.
Concernant l&#8217;&#233;valuation du syst&#232;me d&#8217;extraction, nous pouvons noter que certaines des unit&#233;s
lexicales incompl&#232;tes ne pouvaient &#234;tre compl&#233;t&#233;es dans le corpus par notre strat&#233;gie d&#8217;extraction
parce que les donn&#233;es manquantes &#233;taient implicites ou suivaient un principe de rattachement
complexe. Sinon, dans le cas de 7 &#233;nonc&#233;s (2), la compr&#233;hension globale du sens de la d&#233;fini-
tion n&#233;cessitait &#233;galement la lecture de la phrase pr&#233;c&#233;dente.
Une premi&#232;re remarque doit pr&#233;c&#233;der l&#8217;examen du tableau 2 : la conversion en format texte
de certains des documents HTML du corpus a caus&#233; la segmentation excessive de certaines
phrases. Des &#233;nonc&#233;s pertinents ont ainsi &#233;t&#233; coup&#233;s, emp&#234;chant les patrons de trouver les
unit&#233;s lexicales correctes et retournant des &#233;nonc&#233;s trop incomplets pour permettre une valida-
tion. Ces &#233;nonc&#233;s ont &#233;t&#233; consid&#233;r&#233;s comme faux, faisant chuter de mani&#232;re drastique le taux de
pr&#233;cision, qui n&#8217;atteint que 16% de pr&#233;cision &#171;stricte&#187;. Un choix de l&#8217;&#233;tiquetage a &#233;galement in-
duit un bruit non n&#233;gligeable dans l&#8217;extraction des phrases autour de la parenth&#232;se. Dans le cas
des r&#233;f&#233;rences de type (A), A est &#233;tiquet&#233; comme nom commun et la forme SN (NomCommun)
&#233;tant un des patrons, des extraction incorrectes ont &#233;t&#233; g&#233;n&#233;r&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage et exploitation d&#8217;&#233;nonc&#233;s d&#233;finitoires en corpus pour l&#8217;aide &#224; la
construction d&#8217;ontologie
</p>
<p>Type Nb
pa-
trons
</p>
<p>Nb ex-
traits
</p>
<p>Phrases suiv-
ant la relation
s&#233;mantique
</p>
<p>Taux de
pr&#233;cision
</p>
<p>Nb phrases
int&#233;res-
santes
</p>
<p>Total Pr&#233;cision
des deux
types
d&#8217;&#233;nonc&#233;s
</p>
<p>M&#233;ta1 7 29 20 69% 2 22 75%
M&#233;ta2 20 10 6 60% 1 7 70%
Ling 24 307 55 18% 15 70 22%
Ponct 4 365 38 10% 30+39 (3) 107 29%
Total 55 711 119 16% 87 206 29%
Type Nb
</p>
<p>pa-
trons
</p>
<p>UL ex-
acte
</p>
<p>Taux de
pr&#233;cision
</p>
<p>UL in-
cluse
</p>
<p>Pr&#233;cision
des deux
types d&#8217;UL
</p>
<p>UL
incom-
pl&#232;te
</p>
<p>UL
fausse
</p>
<p>Total
</p>
<p>M&#233;ta1 7 14 31% 4 41% 12 14 44
M&#233;ta2 20 4 28% 0 28% 6 4 14
Ling 24 16 11% 32 34% 16 76 140
Ponct 4 100 46% 56 73% 13 45 214
Total 55 134 32% 92 54% 47 139 412
</p>
<p>Table 2: Extraction des donn&#233;es sur le corpus &#171;di&#233;t&#233;tique&#187;.
</p>
<p>Nous avons &#224; nouveau &#233;t&#233; confront&#233;s au probl&#232;me li&#233; &#224; la pr&#233;diction de la relation s&#233;man-
tique d&#8217;hyperonymie (3) : les extraits du corpus correspondaient cette fois &#224; une expansion
d&#8217;acronymes, qui peut &#234;tre consid&#233;r&#233; comme une sorte de d&#233;finition. Nous pouvons par ailleurs
remarquer que la qualit&#233; de l&#8217;extraction des UL d&#233;pend de la complexit&#233; syntaxique du patron.
Plus il est de bas niveau plus les informations contextuelles sont efficaces pour l&#8217;extraction,
plus il est &#171;linguistique&#187;, plus des informations de d&#233;pendance fonctionnelle entrent en jeu,
compliquant la t&#226;che.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; une m&#233;thode ciblant en corpus des &#233;nonc&#233;s d&#233;finitoires ou int&#233;ressants
dans une perspective de construction ontologique. L&#8217;&#233;valuation de cette m&#233;thode nous a permis
de soulever certains points, notamment la difficult&#233; d&#8217;avoir des taux de pr&#233;cision &#233;lev&#233;s lorsque
l&#8217;on s&#8217;int&#233;resse &#224; des marqueurs linguistiques de reformulation plut&#244;t que des unit&#233;s lexicales
m&#233;talinguistiques, remarque &#233;galement formul&#233;e dans (Rebeyrolle J., 2000). Nous avons &#233;gale-
ment extrait des &#233;nonc&#233;s n&#233;cessitant la lecture de la phrase pr&#233;c&#233;dente pour en sp&#233;cifier le sens.
Dans certains de ces cas, la premi&#232;re des UL renvoy&#233;es &#233;tait un pronom (personnel ou d&#233;mon-
stratif), ce qui nous am&#232;ne &#224; envisager le traitement compl&#233;mentaire suivant : extraire la phrase
pr&#233;c&#233;dant imm&#233;diatement l&#8217;&#233;nonc&#233; global dans la cas o&#249; la premi&#232;re UL renvoy&#233;e est stricte-
ment &#233;gale &#224; un de ces pronoms.
Lorsque la m&#233;thode d&#8217;extraction sera optimis&#233;e, il faudrait id&#233;alement pouvoir proposer &#224;
l&#8217;utilisateur une for&#234;t de nIJuds ontologiques correspondants aux choix de validation. Nous nous
penchons sur la question de la faisabilit&#233; d&#8217;une structuration en termes de nIJuds ontologiques
des r&#233;sultats valid&#233;s : organiser les couples d&#8217;unit&#233;s lexicales en fonction de la relation s&#233;man-
tique valid&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Pierre Zweigenbaum et Bruno Bachimont
</p>
<p>R&#233;f&#233;rences
</p>
<p>AUGER A. (1997), Rep&#233;rage des &#233;nonc&#233;s d&#8217;int&#233;r&#234;t d&#233;finitoire dans les bases de donn&#233;es textuelles,
Th&#232;se de doctorat, Universit&#233; de Neuch&#226;tel.
</p>
<p>BOURIGAULT D., LAME G. (2002), Analyse distributionnelle et structuration de terminologie. Appli-
cation &#224; la construction d&#8217;une ontologie documentaire du Droit, Traitement Automatique des Langues,
Vol. 43(1), 129-150.
</p>
<p>CONDAMINES A. (1993), Un exemple d&#8217;utilisation de connaissances de s&#233;mantique lexicale : acquisi-
tion semi-automatique d&#8217;un vocabulaire de sp&#233;cialit&#233;, Cahiers de lexicologie, Vol. LXII, 25-65.
</p>
<p>FUCHS C. (1994), Paraphrase et &#233;nonciation, Paris, Ophrys.
</p>
<p>GRABAR N., BERLAND S. (2001), Construire un corpus web pour l&#8217;acquisition terminologique, Actes
de 4e rencontres Terminologie et Intelligence Artificielle (TIA 2001), Nancy, 44-54.
</p>
<p>HEARST M. (1992), Automatic Acquisition of Hyponyms from Large Text Corpora, In Proceedings of
15th International Conference on Computational Linguistics (COLING 1992), Nantes, 539-545.
</p>
<p>LE PRIOL F. (2001), Identification, interpr&#233;tation et repr&#233;sentation de relations s&#233;mantiques entre con-
cepts, Actes de Xe conf&#233;rence sur le Traitement Automatique des Langues Naturelles (TALN 2001),
Tours, 379-384.
</p>
<p>MURESAN S., KLAVANS J. L. (2002), A method for automatically building and evaluating dictionary
resources, In Proceedings of the Language Resources and Evaluation Conference (LREC 2002), Las
Palmas, Spain.
</p>
<p>PEARSON J. (1998), Terms in context, Amsterdam/Philadelphia : John Benjamins Publishing Company.
</p>
<p>REBEYROLLE J. (2000), Forme et fonction de la d&#233;finition en discours, Th&#232;se de doctorat, Universit&#233;
Toulouse II - Le Mirail.
</p>
<p>REBEYROLLE J., CONDAMINES A. (2000), , Searching for and identifying conceptual relationships
via a corpus-based approach to a Terminological Knowledge Base (CTKB): Method and Results, In
M.-C. L&#8217;Homme, C. Jacquemin et D. Bourigault (Eds) Recent Advances in Computational Terminology,
John Benjamins, 127-148.
</p>
<p>SEGUELA P., AUSSENAC-GILLES N. (1999), Extraction de relations s&#233;mantiques entre termes et
enrichissement de mod&#232;les du domaine, Actes de la Xe conf&#233;rence Ing&#233;nierie des Connaissances (IC
1999), Palaiseau, 79-88.
</p>
<p>SZULMAN S., BIEBOW B., AUSSENAC-GILLES N. (2002), Structuration de Terminologie &#224; l&#8217;aide
d&#8217;outils de TAL avec TERMINAE, Traitement Automatique des Langues, Vol. 43(1), 103-128.
</p>
<p>TRONCY R. et ISAAC A. (2002), DOE : une mise en oeuvre d&#8217;une m&#233;thode de structuration diff&#233;ren-
tielle pour les ontologies, Actes de 13e Journ&#233;es Francophones d&#8217;Ing&#233;nierie des Connaissances (IC&#8217;02),
Rouen, 63-74.</p>

</div></div>
</body></html>