<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Deux premi&#232;res &#233;tapes vers les documents auto-explicatifs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19-21 avril 2004
</p>
<p>Deux premi&#232;res &#233;tapes vers les documents auto-explicatifs
</p>
<p>Herv&#233; Blanchon, Christian Boitet
</p>
<p>GETA, CLIPS-IMAG
BP 53
</p>
<p>38041 Grenoble Cedex 9
{Herv&#233;.Blanchon, Christian.Boitet}@imag.fr
</p>
<p>R&#233;sum&#233; - Abstract
Dans le cadre du projet LIDIA, nous avons montr&#233; que dans de nombreuses situations, la TA
Fond&#233;e sur le Dialogue (TAFD) pour auteur monolingue peut offrir une meilleure solution en
traduction multicible que les aides aux traducteurs, ou la traduction avec r&#233;vision, m&#234;me si
des langages contr&#244;l&#233;s sont utilis&#233;s. Nos premi&#232;res exp&#233;riences ont mis en &#233;vidence le besoin
de conserver les &#171; intentions de l&#8217;auteur &#187; au moyen &#171; d&#8217;annotations de d&#233;sambigu&#239;sation &#187;.
Ces annotations permettent de transformer le document source en un Document Auto-
Explicatif (DAE). Nous pr&#233;sentons ici une solution pour int&#233;grer ces annotations dans un
document XML et les rendre visibles et utilisables par un lecteur pour une meilleure
compr&#233;hension du &#171; vrai contenu &#187; du document. Le concept de Document Auto-Explicatif
pourrait changer profond&#233;ment notre fa&#231;on de comprendre des documents importants ou
&#233;crits dans un style complexe. Nous montrerons aussi qu&#8217;un DAE, traduit dans une langue
cible L, pourrait aussi &#234;tre transform&#233;, sans interaction humaine, en un DAE en langue L si un
analyseur et un d&#233;sambigu&#239;seur sont disponibles pour cette langue L. Ainsi, un DAE pourrait
&#234;tre utilis&#233; dans un contexte monolingue, mais aussi dans un contexte multilingue sans travail
humain additionnel.
</p>
<p>In the LIDIA project, we have demonstrated that, in many situations, Dialogue-Based MT
(DBMT) for monolingual author is likely to offer better solutions to multitarget translation
needs than machine aids to translators or batch MT, even if controlled languages are used.
First experiments have shown the need to keep a memory of the &#8220;author&#8217;s intention&#8221; by
means of &#8220;disambiguating annotations&#8221; transforming the source document into a &#8220;self-
explaining document&#8221; (SED). We present ways to integrate these annotations into an XML
document (SED-XML), and to make them visible and usable by readers for better
understanding of the &#8220;true content&#8221; of a document. The very concept of SED might deeply
change our way of understanding important or difficult written material. We also show that a
SED, once translated into a target language L, might be transformed into an SED in L with no
human interaction, if an analyzer and a disambiguator are available for L. Hence, the SED
structure might be used in multilingual as well as in monolingual contexts, without addition of
human work.
</p>
<p>Mots Cl&#233;s - Keywords
Document Auto-Explicatifs (DAE), d&#233;sambigu&#239;sation interactive, documents actifs
Self-Explaining Document (SED), interactive disambiguation, active documents</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Herv&#233; Blanchon, Christian Boitet
</p>
<p>Introduction
Dans beaucoup de situations, des notes de travail, des r&#233;sum&#233;s scientifiques, des
documentations techniques, etc., devraient &#234;tre traduits dans plusieurs langues. Ils ne le sont
pas pour trois raisons : (1) ils sont pr&#234;ts &#224; la derni&#232;re minute et les traducteur disponibles
n&#8217;ont pas le temps de faire le travail, (2) il n&#8217;y a pas de traducteur pour faire le travail, (3) et
bien s&#251;r, dans tous les cas, aucune solution automatis&#233;e n&#8217;est satisfaisante.
</p>
<p>La Traduction Automatique interactive Fond&#233;e sur le Dialogue (TAFD), telle que nous
l&#8216;avons prototyp&#233;e dans le cadre du projet LIDIA [Boitet C. and Blanchon H., 1995],
constitue une meilleure piste pour r&#233;soudre ce probl&#232;me que les aides au traducteur et les
syst&#232;mes de TA de type &#171; bo&#238;te noire &#187;, m&#234;me si des langages contr&#244;l&#233;s sont utilis&#233;s pour la
r&#233;daction.
</p>
<p>La TAFD offre aussi la possibilit&#233; de produire toutes les versions d&#8217;un document, soit le
document source et tous les documents cibles, sous forme de Document Auto-explicatif
(DAE) [Boitet C., 1994]. Un DAE contient le texte du document ainsi que sa repr&#233;sentation
linguistique, profonde ou multiniveau, d&#233;sambigu&#239;s&#233;e et augment&#233;e d&#8217;une m&#233;moire des
ambigu&#239;t&#233;s qu&#8217;il contient et d&#8217;une trace du processus de d&#233;sambigu&#239;sation.
</p>
<p>Avec le concept de DAE, nous proposons une nouvelle mani&#232;re, totalement novatrice et
potentiellement tr&#232;s utile, d&#8217;acc&#233;der au contenu d'un document et de l&#8217;utiliser. Un lecteur de
DAE pourrait &#171; cliquer &#187; sur un segment textuel marqu&#233; comme ambigu et obtenir une
pr&#233;sentation des diff&#233;rentes interpr&#233;tations possibles avec un marquage de celle qui doit &#234;tre
retenue. Ainsi, un DAE r&#233;dig&#233; dans un langage non contr&#244;l&#233; serait moins ambigu qu&#8217;un texte
r&#233;dig&#233; dans un langage contr&#244;l&#233;, qui n'est certes pas ambigu pour la machine, mais le reste
tr&#232;s souvent pour un humain. Nous proposons aussi une m&#233;thode permettant de traduire un
DAE source en un DAE cible, sans effort humain suppl&#233;mentaire, sans traitement contrastif
(et tr&#232;s difficile) des ambigu&#239;t&#233;s, et avec capture de toutes les ambigu&#239;t&#233;s en cible, rendant
ainsi l&#8217;intention exacte de l&#8217;auteur accessible dans d&#8217;autres langues.
</p>
<p>Dans cet article, nous pr&#233;sentons d&#8217;abord le projet LIDIA, notre premier prototype (LIDIA-1),
ainsi que le concept de DAE. La section 2 est consacr&#233;e &#224; la pr&#233;sentation de l&#8217;impl&#233;mentation
LIDIA-2. Dans la section 3 nous pr&#233;sentons notre premier visualiseur de DAE et proposons
des am&#233;liorations &#224; court terme. Nous proposons enfin, dans la section 4, des pistes de
recherches pour le futur.
</p>
<p>1 LIDIA-1: le berceau du concept de DAE
L&#8217;id&#233;e des Documents Auto-Explicatifs (DAE) est issue de nos travaux sur la Traduction
Automatique Fond&#233;e sur le Dialogue (TAFD).
1.1 Le projet LIDIA
Les efforts pass&#233;s visant &#224; am&#233;liorer la qualit&#233; des traductions produites par des syst&#232;mes de
TA ont montr&#233; que la TA de haute qualit&#233; est possible, mais seulement pour des typologies de
textes (domaine, style) tr&#232;s contraintes. On peut citer, par exemple, les bulletins
m&#233;t&#233;orologiques (METEO, TAUM, anglais &#0; fran&#231;ais), les br&#232;ves boursi&#232;res du Nikkei
(ALT/Flash, NTT, japonais &#0; anglais), ou les documents techniques (BV/a&#233;ro/FE pour les
manuels de maintenance d&#8217;avions, Systran pour des documents XEROX en anglais contr&#244;l&#233;).
La TAFD de haute qualit&#233; est un nouveau paradigme pour des situations traductionnelles pour
lesquelles les approches &#8212; fond&#233;es sur la langue, fond&#233;es sur la connaissance &#8212; ne sont pas
appropri&#233;es [Boitet C. and Blanchon H., 1995]. En TAFD, bien que les sources de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Deux premi&#232;res &#233;tapes vers les documents auto-explicatifs
</p>
<p>connaissances linguistiques soient encore cruciales, et que des connaissances extra-
linguistiques puissent &#234;tre utilis&#233;es si elles sont disponibles, l&#8217;accent est mis sur la pr&#233;-&#233;dition
indirecte au moyen d&#8217;un dialogue de d&#233;sambigu&#239;sation avec l&#8217;auteur permettant d&#8217;obtenir des
traductions de haute qualit&#233; sans r&#233;vision.
</p>
<p>La premi&#232;re situation que nous avons consid&#233;r&#233;e est la production de documents techniques
multilingues sous la forme de documents HyperCard. HyperCard est un environnement de
production de documents hypertextes dont les &#171; pages &#187; sont appel&#233;es cartes. Les cartes
contiennent diff&#233;rents types d&#8217;objets, dont des champs textuels. Du point de vue linguistique,
nous utilisons une approche fond&#233;e sur un transfert multiniveau avec des acceptions,
propri&#233;t&#233;s, et relations interlingues. Notre premi&#232;re maquette, LIDIA-1, d&#233;montre l&#8217;id&#233;e avec
un document HyperCard qui pr&#233;sente, en contexte, des phrases ambigu&#235;s en fran&#231;ais. Ce
document peut &#234;tre traduit vers l&#8217;anglais, l&#8217;allemand et le russe. Bien que cette maquette soit
r&#233;duite du point de vue de sa couverture linguistique, elle montre le potentiel de l&#8217;approche.
</p>
<p>1.2 Quelques &#233;l&#233;ments sur l&#8217;interface de LIDIA-1
L&#8217;utilisateur peut activer les traitements LIDIA les plus fr&#233;quents gr&#226;ce &#224; une palette d&#8217;outils.
La premi&#232;re ligne d&#8217;outils (Figure 1), consid&#233;r&#233;e de gauche &#224; droite, permet de traduire l&#8217;objet
s&#233;lectionn&#233;, voir la progression des traitements, voir les annotations et voir la r&#233;trotraduction
en fran&#231;ais. La seconde ligne permet de se d&#233;placer parmi les cartes du document.
</p>
<p>Apr&#232;s l&#8217;analyse, un bouton (? !! - Figure 2) appara&#238;t au dessus de l&#8217;objet &#224; traduire si son
contenu est ambigu et n&#233;cessite une d&#233;sambigu&#239;sation interactive.
</p>
<p>Figure 1 : s&#233;lection d&#8217;un objet textuel &#224; traduire
</p>
<p>Figure 2 : Questions de d&#233;sambigu&#239;sation en
suspens pour un objet
</p>
<p>Lorsqu&#8217;il d&#233;cide de r&#233;soudre les ambigu&#239;t&#233;s concernant un objet particulier, l&#8217;utilisateur
clique sur ce bouton et les questions sont propos&#233;es comme ci-dessous. Dans le contexte de la
phrase, l&#8217;auteur doit choisir d&#8217;attacher &#171; de Chine &#187; &#224; &#171; vase &#187; (un vase chinois, Figure 3). Un
second dialogue appara&#238;t alors pour le sens du mot &#171; capitaine &#187; (Figure 4).
</p>
<p>Le capitaine a rapport&#233; un vase de chine.
</p>
<p>de Chine, le capitaine a rapport&#233; un vase.
</p>
<p>Le capitaine a rapporte (un vase de chine).
</p>
<p>Figure 3 : D&#233;sambigu&#239;sation strucurelle
</p>
<p>capitaine
</p>
<p>Officier qui commande une compagnie d'infanterie, un
</p>
<p>escadron de cavalerie, une batterie d'artillerie
</p>
<p>Officier qui commande un navire de commerce
</p>
<p>Chef d'une &#233;quipe sportive
</p>
<p>Figure 4 : D&#233;sambigu&#239;sation du sens du mot
&#171; capitaine &#187;
</p>
<p>La Figure 5 montre la traduction de la phrase &#171; le capitaine a rapport&#233; un vase de Chine &#187;
dans deux contextes diff&#233;rents. Cela permet d&#8217;illuster l&#8217;int&#233;r&#234;t de la d&#233;sambigu&#239;sation
interactive.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Herv&#233; Blanchon, Christian Boitet
</p>
<p>Figure 5 : Traduction d&#8217;une m&#234;me phrase dans deux contextes diff&#233;rentes
</p>
<p>1.3 &#201;tapes de production d&#8217;un DAE
Nous avons propos&#233; et motiv&#233; le concept de DAE dans [Boitet C., 1994]. Nous donnons ici
un bref aper&#231;u (Figure 6) des &#233;tapes de traitement mises en &#339;uvre et des structures de
donn&#233;es produites dans le cadre l&#8217;architecture linguicielle LIDIA. Nous montrons aussi
comment la production de DAE en langues source et cible peut s&#8217;y int&#233;grer.
</p>
<p>Chaque phrase du texte en langue source est d&#8217;abord analys&#233;e pour produire une structure
mmc-source (multisolution, multiniveau1, concr&#232;te2). Cette structure mmc est alors utilis&#233;e
pour construire un arbre des questions qui seront pos&#233;es &#224; l&#8217;auteur. &#192; l&#8217;issue de l&#8217;&#233;tape de
d&#233;sambigu&#239;sation interactive, le syst&#232;me obtient la structure umc-source (unisolution,
multiniveau, concr&#232;te) non ambigu&#235; choisie par l&#8217;auteur. Cette structure umc est ensuite
transform&#233;e en une structure abstraite uma-source (unisolution, multiniveau, abstraite2).
Un composant de transfert lexical et structural produit ensuite une structure gma-cible
(g&#233;n&#233;ratrice, multiniveau, abstraite). Une structure gma est plus g&#233;n&#233;rale et g&#233;n&#233;ratrice qu&#8217;une
structure uma car les niveaux de surface (fonctions syntaxiques, cat&#233;gories syntagmatiques,
&#8230;) peuvent ne pas &#234;tre renseign&#233;s. S'ils le sont, ils ne servent que de guide3 &#224; la premi&#232;re
&#233;tape de la g&#233;n&#233;ration, qui &quot;choisit la paraphrase &#224; g&#233;n&#233;rer&quot; et produit une structure uma-cible
qui est homog&#232;ne &#224; la structure qui serait produite en analysant et en d&#233;sambigu&#239;sant
interactivement le texte cible qui va &#234;tre g&#233;n&#233;r&#233;. Le processus de traduction se termine avec
les g&#233;n&#233;rations syntaxique et morphologique.
</p>
<p>Au cours de la traduction, ou apr&#232;s l&#8217;analyse suivie de d&#233;sambigu&#239;sation interactive
uniquement, les informations n&#233;cessaires &#224; la construction d&#8217;un DAE sont conserv&#233;es. En
effet, la production d&#8217;un DAE ne n&#233;cessite pas l&#8217;ex&#233;cution de chacune des &#233;tapes du
processus de traduction. Pour produire un DAE, il suffit d&#8217;une &#233;tape d&#8217;analyse multiple suivie
d&#8217;une &#233;tape de d&#233;sambigu&#239;sation interactive.
</p>
<p>La production d&#8217;un DAE en langue cible est d&#233;taill&#233;e dans la section 4.3.
                                                 
</p>
<p>1
 La structure contient trois niveaux d&#8217;interpr&#233;tation linguistique : le niveau des classes syntaxiques et
</p>
<p>syntagmatiques, le niveau des fonctions syntaxiques, et le niveau des relations logiques et s&#233;mantiques.
2
 Une repr&#233;sentation d&#8217;un texte est dite &#171; concr&#232;te &#187; si l&#8217;on retrouve directement le texte repr&#233;sent&#233; par un
</p>
<p>parcours simple de la structure (mot des feuilles pour un structure syntagmatique, parcours infix&#233; pour une
structure de d&#233;pendances). Sinon, la structure est dite &#171; abstraite &#187;.
</p>
<p>3
 On utilise un attribut &quot;tactique&quot; ensembliste LOCK &#224; valeurs dans les noms des attributs non interlingues
</p>
<p>pour dire si tel ou tel attribut comme la classe ou la fonction syntaxique a &#233;t&#233; calcul&#233; par le transfert &#224; titre
d'ordre ou de pr&#233;f&#233;rence).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Deux premi&#232;res &#233;tapes vers les documents auto-explicatifs
</p>
<p>Figure 6 : Organisation lingucielle en TAFD et production de DAE
</p>
<p>2 LIDIA-2 : production d&#8217;un DAE
Avec LIDIA-2, nous avons chang&#233; l&#8217;architecture logicielle au niveau de l&#8217;acc&#232;s distribu&#233; aux
traitements ainsi que le format des donn&#233;es. En particulier, tous les composants utiles &#224; la
traduction interactive sont maintenant acc&#233;d&#233;s avec le m&#234;me protocole (telnet) alors que dans
LIDIA-1 nous utilisions le courrier &#233;lectronique (SMTP) et les AppleEvents pour acc&#233;der au
linguiciel et au d&#233;sambigu&#239;seur. Un document LIDIA-2 contient l&#8217;historique de la
d&#233;sambigu&#239;sation interactive. Il est ensuite filtr&#233; pour produire un DAE. Ces deux fichier sont
repr&#233;sent&#233;s en XML. L&#8217;environnement LIDIA-2 est impl&#233;ment&#233; en JAVA.
</p>
<p>Dans la premi&#232;re version de LIDIA-2, nous avons utilis&#233; un d&#233;sambigu&#239;seur de l&#8217;anglais
[Blanchon H., 1995] fond&#233; sur une &#233;tude de corpus [Fais L. and Blanchon H., 1996]. Ce
module &#233;tait, en effet, directement int&#233;grable &#224; la nouvelle architecture d&#8217;int&#233;gration des
composants que nous avons propos&#233;e.
</p>
<p>2.1 Exemple de session
L&#8217;utilisateur (l&#8217;auteur) personnalise d&#8217;abord son environnement. Il peut alors cr&#233;er un
nouveau document ou ouvrir un document existant. La fen&#234;tre du document (Figure 7) est
divis&#233;e en deux sections : la partie sup&#233;rieure est la fen&#234;tre d&#8217;&#233;dition, la partie inf&#233;rieure
affiche des informations relatives &#224; l&#8217;&#233;tat des traitements effectu&#233;s sur le document.
</p>
<p>Apr&#232;s que l&#8217;utilisateur ai demand&#233; l&#8217;analyse du document, les phrases ambigu&#235;s sont color&#233;es
en brun et les phrases non ambigu&#235;s sont color&#233;es en vert. Dans la Figure 7, le texte contient
sept phrases ambigu&#235;s et une phrase qui ne l&#8217;est pas (la premi&#232;re).
Lorsque l&#8217;utilisateur fait un clic double sur une phrase ambigu&#235;, les questions de
d&#233;sambigu&#239;sation correspondant sont affich&#233;es. L&#8217;ordre d&#8217;affichage assure un parcours depuis
la racine jusqu&#8217;&#224; une feuille dans l&#8217;arbre des questions associ&#233; &#224; la phrase consid&#233;r&#233;e. Pour la
phrase &#8220;let me pull up my maps to help you&#8221;, il n&#8217;y a qu&#8217;une question pour deux
interpr&#233;tations. Lorsqu&#8217;elle est d&#233;sambigu&#239;s&#233;e, la phrase est color&#233;e en vert.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Herv&#233; Blanchon, Christian Boitet
</p>
<p>Figure 7 : Fen&#234;tre de document (apr&#232;s analyse)
Figure 8 : Une question de d&#233;sambigu&#239;sation
</p>
<p>2.2 Support &#224; la manipulation du document
Un document LIDIA-2 (cf. Annexe) est un document XML. Nous avons choisi l&#8217;API DOM
pour g&#233;rer et manipuler le document LIDIA-2 en cours d&#8217;utilisation et l&#8217;API SAX pour
v&#233;rifier la bonne syntaxe des documents lors de leur ouverture. Ce document contient une
ent&#234;te (&lt;description&gt;) et un contenu (&lt;support&gt;) &#8212; le texte &#8212; sous forme de paragraphes
(&lt;paragraphe&gt;) et de phrases (&lt;phrase&gt;), saisies par l&#8217;utilisateur et enrichies par les
informations collect&#233;es lors des diff&#233;rentes &#233;tapes de traitement.
</p>
<p>L&#8217;ent&#234;te comporte le titre du document, la langue source et le nom de l&#8217;auteur. Pour chaque
phrase du texte, le &lt;support&gt; comprend la langue source, le texte de la phrase, l&#8217;arbre des
questions, ainsi que la ou les traductions obtenues dans les langues cibles choisies. L&#8217;arbre
des questions est une repr&#233;sentation, &#224; la lisp, de celui qui est produit par le module de
d&#233;sambigu&#239;sation. Cet arbre est enrichi d&#8217;une trace du chemin suivi par l&#8217;utilisateur lors de la
d&#233;sambigu&#239;sation effective.
</p>
<p>2.3 Filtrage vers un DAE
Pour produire le DAE associ&#233; au document LIDIA-2 en cours, celui-ci est filtr&#233;. On conserve
dans le DAE l&#8217;ent&#234;te du document LIDIA-2, et l' organisation en paragraphes et phrases du
&lt;support&gt;. Pour chaque phrase, on retient le texte d&#8217;origine et la trace du parcours de l&#8217;auteur
dans l&#8217;arbre des questions. (cf. Annexe).
</p>
<p>3 Visualisation d&#8217;un DAE (&#233;tape 2)
Nous concevons une DAE comme un document autonome et &#171; portable &#187; qui doit pouvoir
&#234;tre diffus&#233;. Il faut donc proposer un environnement de visualisation autonome.
</p>
<p>3.1 Objectif et contraintes
Un visualiseur de DAE doit permettre &#224; un lecteur de lire le contenu du document et
d&#8217;appr&#233;hender le &#171; sens exact &#187; de que ce l&#8217;auteur a voulu dire. Le visualiseur doit donc
pouvoir signaler au lecteur les segments ambigus, et, &#224; la demande, en r&#233;v&#233;ler le &#171; sens &#187;
choisi par l&#8217;auteur lors de la phase de d&#233;sambigu&#239;sation interactive.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Deux premi&#232;res &#233;tapes vers les documents auto-explicatifs
</p>
<p>Le premier visualiseur que nous pr&#233;sentons ici est assez simple et l&#8217;interaction avec le lecteur
assez pauvre. Il est &#233;crit en JAVA pour &#234;tre portable et t&#233;l&#233;chargeable sur le web. L&#8217;API
DOM est utilis&#233;e pour g&#233;rer le document.
</p>
<p>3.2 Interface du premier visualiseur
Quand le lecteur ouvre un DAE avec le visualiseur, le contenu textuel du DAE est affich&#233;
(Figure 9).
Dans cette impl&#233;mentation, les segments ambigus ne sont pas surlign&#233;s. Pour obtenir les
informations relatives aux diff&#233;rentes lectures possibles d&#8217;une phrase, l&#8217;utilisateur doit faire
un double clic sur son texte. Une bo&#238;te de dialogue appara&#238;t alors. Elle permet au lecteur de
naviguer dans l&#8217;arbre des questions en voyant les rephrasages s&#233;lectionn&#233;s par l&#8217;auteur (=&gt; &#8230;
&lt;=) lors de la d&#233;sambigu&#239;sation, comme le montre la Figure 10.
</p>
<p>Figure 9 : Environnement de lecture d&#8217;un DAE Figure 10 : Affichage des rephrasages s&#233;lectionn&#233;s
lors de la d&#233;sambigu&#239;sation
</p>
<p>3.3 Am&#233;liorations &#224; court terme
Afin d&#8217;am&#233;liorer l&#8217;impl&#233;mentation de LIDIA-2, nous avons plusieurs objectifs &#224; court terme.
Les perspectives &#224; long terme sont d&#233;taill&#233;es dans la section 4.
</p>
<p>3.3.1 Int&#233;grer les linguiciels LIDIA-1 dans la nouvelle architecture
Notre premier objectif &#224; court terme est d&#8217;int&#233;grer dans l&#8217;architecture LIDIA-2 les modules
d&#8217;analyse, de d&#233;sambigu&#239;sation interactive, de transfert et de g&#233;n&#233;ration d&#233;velopp&#233;s pour la
maquette LIDIA-1 [Boitet C. and Blanchon H., 1995]. Cela nous permettrait d&#8217;avoir une
plateforme d&#8217;exp&#233;rimentation plus riche. Nous verrons dans la section 4.1 qu&#8217;aller plus loin
dans la localisation des ambigu&#239;t&#233;s implique des changements importants pour le module de
d&#233;sambigu&#239;sation interactive lui-m&#234;me.
</p>
<p>3.3.2 Permettre des changements de r&#233;ponse aux questions de d&#233;sambigu&#239;sation
Dans certains cas, il peut &#234;tre int&#233;ressant de refaire la d&#233;sambigu&#239;sation interactive, soit pour
corriger un r&#233;sultat de traduction (la d&#233;sambigu&#239;sation interactive aurait dans ce cas &#233;t&#233; mal
faite), soit pour produire une nouvelle traduction pour montrer l&#8217;int&#233;r&#234;t de la
d&#233;sambigu&#239;sation.
</p>
<p>Toutes les informations n&#233;cessaires sont d&#233;j&#224; disponibles dans un document LIDIA-2. Ainsi
une nouvelle d&#233;sambigu&#239;sation peut &#234;tre effectu&#233;e de mani&#232;re autonome (hors ligne). Si le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Herv&#233; Blanchon, Christian Boitet
</p>
<p>nouveau parcours de d&#233;sambigu&#239;sation est le m&#234;me que le pr&#233;c&#233;dent, les bonnes traductions
vers les diff&#233;rentes langues cibles auront d&#233;j&#224; &#233;t&#233; calcul&#233;es. Si le parcours est diff&#233;rent, de
nouvelles traductions devront &#234;tre produites (en ligne).
3.3.3 Cr&#233;er automatiquement des corpus multilingues auto-explicatifs align&#233;s
Nous avons dit que LIDIA-2 peut accepter des demandes de traduction vers plusieurs langues
cibles. Les traductions sont conserv&#233;es dans le document LIDIA-2.
</p>
<p>Il pourrait donc &#234;tre int&#233;ressant d&#8217;exporter un document multilingue d&#233;j&#224; align&#233; au niveau de
sa structure. On pourrait m&#234;me envisager de conserver dans le document LIDIA-2 toutes les
structures interm&#233;diaires produites lors du processus de traduction afin de calculer
automatiquement diff&#233;rents alignements pour chaque phrase (au niveau des mots, des
segments, des syntagmes).
Cela pourrait &#234;tre utile, par exemple, en apprentissage des langues, et aussi pour l&#8217;&#233;tude
contrastive des ambigu&#239;t&#233;s. On sait, &#233;galement, que les besoins de corpus align&#233;s croissent
avec le d&#233;veloppement de moteurs statistiques pour le traitement de la langue naturelle,
notamment en traduction.
</p>
<p>4 Perspectives &#224; plus long terme
Nos objectifs &#224; long terme ont un impact sur les modules qui participent &#224; la cha&#238;ne de
traduction (analyse, transfert, g&#233;n&#233;ration), et sur le module de d&#233;sambigu&#239;sation interactive.
4.1 Prendre en compte du support de l&#8217;ambigu&#239;t&#233;
Afin d&#8217;am&#233;liorer l&#8217;utilisabilit&#233; d&#8217;un DAE, l&#8217;aspect le plus important nous semble la
localisation pr&#233;cise des ambigu&#239;t&#233;s. Pour &#234;tre capable de faire cela, le moteur de pr&#233;paration
de l&#8217;arbre des questions doit &#234;tre capable de localiser pr&#233;cis&#233;ment le support [Boitet C. and
Tomokio M., 1995] de chaque ambigu&#239;t&#233;. Cet objectif peut &#234;tre atteint soit en calculant le
support de l&#8217;ambigu&#239;t&#233;, a posteriori, &#224; partir des descripteurs d&#8217;ambigu&#239;t&#233;s actuels, soit en
modifiant les descripteurs d&#8217;ambigu&#239;t&#233;s afin qu&#8217;ils soient d&#233;finis directement sur les supports
de l&#8217;ambigu&#239;t&#233;. Cette derni&#232;re solution, qui a notre pr&#233;f&#233;rence, implique plus de modifications
du module de d&#233;sambigu&#239;sation que la premi&#232;re.
</p>
<p>4.2 Autoriser une d&#233;sambigu&#239;sation interactive incompl&#232;te
Dans le contexte de vraies applications, l&#8217;analyseur rencontrera un grand nombre
d&#8217;ambigu&#239;t&#233;s. Pour chaque phase, il est donc possible que l&#8217;arbre des questions ait une telle
profondeur que l&#8217;auteur n&#8217;accepte de r&#233;pondre qu&#8217;aux questions cruciales. En d&#8217;autres termes,
&#233;tant donn&#233;e une structure mmc, quelques r&#233;ponses &#224; des questions de d&#233;sambigu&#239;sation et,
&#233;ventuellement, des pr&#233;f&#233;rences utilisateur, le syst&#232;me doit &#234;tre capable de faire des choix et
de produire ou bien une traduction unique, ou bien une repr&#233;sentation factoris&#233;e explicitant
les diff&#233;rentes traductions possibles, en langue cible. Afin d&#8217;impl&#233;menter une telle strat&#233;gie, il
est n&#233;cessaire que les modules utilis&#233;s puissent mettre en &#339;uvre des techniques heuristiques
de d&#233;sambigu&#239;sation automatique et/ou soient capables de manipuler des structures ambigu&#235;s.
</p>
<p>4.3 Cr&#233;er des DAEs en langues cibles
Comme l&#8217;&#233;tape de g&#233;n&#233;ration produit une structure interm&#233;diaire &#233;quivalente &#224; une structure
d&#8217;analyse d&#233;sambigu&#239;s&#233;e (umc), il suffit pour cr&#233;er un DAE en langue cible de faire une
analyse multiple (mmc) des phrases effectivement g&#233;n&#233;r&#233;es, puis de construire un arbre des
questions concernant ces phrases. Sachant que l&#8217;on conna&#238;t la structure umc &#224; retenir, on peut
ensuite calculer automatiquement les r&#233;ponses aux questions de d&#233;sambigu&#239;sation. On dispose</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Deux premi&#232;res &#233;tapes vers les documents auto-explicatifs
</p>
<p>alors des informations n&#233;cessaires pour produire un DAE en langue cible, et ce sans aucune
intervention humaine : le syst&#232;me aura ainsi effectu&#233; &#171; la d&#233;sambigu&#239;sation que l'auteur aurait
pu faire lui-m&#234;me en langue cible &#187; (en supposant qu'il la connaisse et ait la patience de la
faire une seconde fois)
Atteindre cet objectif suppose qu'on dispose d&#8217;un analyseur ad&#233;quat (&#224; sorties multiples) dans
chacune des langues vis&#233;es. C'est le cas de quelques enconvertisseurs vers UNL, ainsi que de
certains analyseurs de syst&#232;mes de TA op&#233;rationnels (ALT/JE de NTT, PT de Linguatec,
notamment). Nous esp&#233;rons pouvoir bient&#244;t exp&#233;rimenter cette id&#233;e gr&#226;ce &#224; des coop&#233;rations
avec certains d'entre eux.
</p>
<p>Conclusion
Nous avons montr&#233; une premi&#232;re impl&#233;mentation du concept de document auto-explicatif.
Cette id&#233;e se situe dans le champ de recherche sur les documents actifs [Quint V. and Vatton
I., 1994]. Nous travaillons sur un environnement LIDIA int&#233;gr&#233; &#224; un &#233;diteur de documents
XML &#224; la Thot (http://opera.inrialpes.fr/Thot.en.html).
Notre structure de document XML est assez simple, et toute l&#8217;information qu&#8217;il contient n&#8217;est
pas au format XML. Par exemple, la structure mmc et l&#8217;arbre des questions sont repr&#233;sent&#233;s
dans un formalisme &#224; la lisp, ce qui n&#233;cessite des modules de gestion sp&#233;cifiques, alors qu&#8217;un
traitement avec l&#8217;API DOM serait plus efficace et robuste.
</p>
<p>Cependant, ces deux premi&#232;res &#233;tapes (le nouvel environnement LIDIA-2 et le visualiseur de
DAE) repr&#233;sentent des r&#233;sultats originaux, et les perspectives de ce travail sont vari&#233;es. Nous
esp&#233;rons pourvoir exposer des r&#233;sultats plus pratiques dans le futur.
</p>
<p>Remerciements
Ghislain Gressard a d&#233;velopp&#233; la premi&#232;re impl&#233;mentation de l&#8217;interface java de LIDIA.
Eug&#233;nie Schonek a r&#233;alis&#233; le premier visualiseur de DAE.
</p>
<p>References
Notre proposition de construire des document auto-explicatifs semble tout-&#224;-fait original, qu'il s'agisse du
concept ou de r&#233;alisation comme celle montr&#233;e ici. En effet, nous n'avons rien trouv&#233; &#224; ce sujet dans la
litt&#233;rature. Cela explique que la bibliographie qui suit contienne tr&#232;s peu de r&#233;f&#233;rences externes.
</p>
<p>Blanchon H. (1995). An Interactive Disambiguation Module for English Natural Language
Utterances. Proc. NLPRS'95. Seoul, Korea, Dec 4-7, 1995. vol. 2/2: pp. 550-555.
Boitet C. (1994). Dialogue-Based MT and self explaining documents as an alternative to
MAHT and MT of controled language. Proc. Machine Translation Ten Years On. Cranfield,
England, Oct. 12-14, 1994: 7p.
Boitet C. &amp; Blanchon H. (1995). Multilingual Dialogue-Based MT for monolingual authors:
the LIDIA project and a first mockup. in Machine Translation. vol. 9(2): pp. 99-132.
Boitet C. &amp; Tomokio M. (1995). Ambiguities &amp; ambiguity labelling: towards ambiguity
databases. Proc. RANLP'95 (Recent Advances in NLP). Tzigov Chark, Bulgaria, 14-16
September, 1995. vol. 1/1: pp. 13-26.
Fais L. &amp; Blanchon H. (1996). Ambiguities in Task-oriented Dialogues. Proc. MIDDIM'96.
Le col de porte, Is&#232;re, France, 12-14 Ao&#251;t 1996. vol. 1/1: pp. 263-275.
Quint V. &amp; Vatton I. (1994). Making structured documents active. vol. 7(2): pp. 55-74.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Herv&#233; Blanchon, Christian Boitet
</p>
<p>Annexe : documents XML produits
Nous donnons simultan&#233;ment les fichiers .ldi et .dae correspondant &#224; l'exemple donn&#233; dans
l'article. La structure compl&#232;te des fichiers .ldi et .dae est donn&#233;e, mais nous avons supprim&#233;
l'analyse (liste d'arbres), trop volumineuse. Le contenu propre au fichier .ldi est en italiques. Il
s'agit de la source, du timbre &#224; date, de l'analyse et de la traduction.
&lt;?xml version=&quot;1.0&quot; ?&gt;
&lt;work&gt;
 &lt;description&gt;
  &lt;title&gt;&lt;![CDATA[A trip to Tokyo]]&gt;&lt;/title&gt;
  &lt;language&gt;&lt;![CDATA[ENG]]&gt;&lt;/language&gt;
  &lt;auteur&gt;  &lt;firstname&gt;&lt;![CDATA[herve]]&gt;&lt;/firstname&gt;
            &lt;lastname&gt;&lt;![CDATA[blanchon]]&gt;&lt;/lastname&gt; &lt;/auteur&gt;
 &lt;/description&gt;
 &lt;support&gt;
  &lt;paragraphe&gt;
   &lt;phrase source=&quot;ENG&quot; stamp=&quot;11054803544635&quot;&gt;
    &lt;original&gt;&lt;![CDATA[Good morning conference center.]]&gt;&lt;/original&gt;
    &lt;analyse&gt;&lt;![CDATA[&#8230;]]&gt;&lt;/analyse&gt;
    &lt;traduction cible=&quot;FRA&quot;&gt;&lt;![CDATA[Bonjour ici le centre de conf&#233;rences international.]]&gt;
    &lt;/traduction&gt;
   &lt;/phrase&gt;
   &lt;phrase source=&quot;ENG&quot; stamp=&quot;21054803544655&quot;&gt;
    &lt;original&gt;&lt;![CDATA[ I want the symposium on interpreting telecommunication at the
international conference center.]]&gt;&lt;/original&gt;
    &lt;question&gt;
     &lt;reformulation choix=&quot;NON&quot;&gt;&lt;![CDATA[the symposium (on interpreting telecommunications at
the international conference center)]]&gt;
      &lt;question&gt;
       &lt;reformulation&gt;&lt;![CDATA[the (international center) for conference]]&gt;
        &lt;analyse&gt;&lt;![CDATA[&#8230;]]&gt;&lt;/analyse&gt;
       &lt;/reformulation&gt;
       &lt;reformulation&gt;&lt;![CDATA[the center for (international conference)]]&gt;
        &lt;analyse&gt;&lt;![CDATA[&#8230;]]&gt;&lt;/analyse&gt;
       &lt;/reformulation&gt;
      &lt;/question&gt;
     &lt;/reformulation&gt;
     &lt;reformulation choix=&quot;OUI&quot;&gt;&lt;![CDATA[at the international conference center, the symposium
on interpreting telecommunications]]&gt;
      &lt;question&gt;
       &lt;reformulation choix=&quot;OUI&quot;&gt;&lt;![CDATA[the (international center) for conference]]&gt;
        &lt;analyse&gt;&lt;![CDATA[&#8230;]]&gt;&lt;/analyse&gt;
       &lt;/reformulation&gt;
       &lt;reformulation choix=&quot;NON&quot;&gt;&lt;![CDATA[the center for (international conference)]]&gt;
        &lt;analyse&gt;&lt;![CDATA[&#8230;]]&gt;&lt;/analyse&gt;
       &lt;/reformulation&gt;
      &lt;/question&gt;
     &lt;/reformulation&gt;
    &lt;/question&gt;
    &lt;traduction cible=&quot;FRA&quot;&gt;&lt;![CDATA[Je veux le symposium sur la communication interpr&#233;t&#233;e qui
se d&#233;roule au centre de conf&#233;rences international.]]&gt;&lt;/traduction&gt;
   &lt;/phrase&gt;
   &#8230;
</p>
<p>   &lt;phrase source=&quot;ENG&quot; stamp=&quot;51054803544695&quot;&gt;
    &lt;original&gt;&lt;![CDATA[ I will show you where you are located right now.]]&gt;&lt;/original&gt;
    &lt;question&gt;
     &lt;reformulation choix=&quot;NON&quot;&gt;&lt;![CDATA[I will show you (where you are located right now).]]&gt;
      &lt;analyse&gt;&lt;![CDATA[&#8230;]]&gt;&lt;/analyse&gt;
     &lt;/reformulation&gt;
     &lt;reformulation choix=&quot;OUI&quot;&gt;&lt;![CDATA[right now, I will show you where you are located.]]&gt;
      &lt;analyse&gt;&lt;![CDATA[&#8230;]]&gt;&lt;/analyse&gt;
     &lt;/reformulation&gt;
    &lt;/question&gt;
    &lt;traduction cible=&quot;FRA&quot;&gt;&lt;![CDATA[Je vais tout de suite vous montrer o&#249; vous
&#234;tes.]]&gt;&lt;/traduction&gt;
   &lt;/phrase&gt;
   &#8230;
</p>
<p>  &lt;/paragraphe&gt;
 &lt;/support&gt;
&lt;/work&gt;</p>

</div></div>
</body></html>