<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analogies dans les s&#233;quences : un solveur &#224; &#233;tats finis</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, Session Poster, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Analogies dans les s&#233;quences : un solveur &#224; &#233;tats finis
</p>
<p>Nicolas Stroppa et Fran&#231;ois Yvon
GET/ENST et LTCI, CNRS UMR 5141
</p>
<p>46 rue Barrault - F-75 013 Paris
{stroppa,yvon}@enst.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>L&#8217;apprentissage par analogie se fonde sur un principe inf&#233;rentiel potentiellement pertinent pour
le traitement des langues naturelles. L&#8217;utilisation de ce principe pour des t&#226;ches d&#8217;analyse lin-
guistique pr&#233;suppose toutefois une d&#233;finition formelle de l&#8217;analogie entre s&#233;quences. Dans cet
article, nous proposons une telle d&#233;finition et montrons qu&#8217;elle donne lieu &#224; l&#8217;implantation ef-
ficace d&#8217;un solveur d&#8217;&#233;quations analogiques sous la forme d&#8217;un transducteur fini. Munis de
ces r&#233;sultats, nous caract&#233;risons empiriquement l&#8217;extension analogique de divers langages finis,
correspondant &#224; des dictionnaires de quatre langues.
</p>
<p>Analogical reasoning provides us with an inferential mecanism of potential interest for NLP
applications. An effective use of this process requires a formal definition of the notion of an
analogy between strings of symbols. In this paper, we propose such a definition, from which we
derive the implementation of a finite-state transducer solving analogical equations on sequences.
We finally present the results of an empirical study of the analogical extension of several finite
languages, corresponding to dictionnaries of four European languages.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Apprentissage par Analogie, Automates finis
Analogical Learning, Finite-State Automaton</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas Stroppa, Fran&#231;ois Yvon
</p>
<p>1 Introduction
</p>
<p>1.1 Analogie et TAL
</p>
<p>L&#8217;apprentissage par analogie est une m&#233;thode d&#8217;inf&#233;rence qui offre une alternative &#224; la fois aux
m&#233;thodes &#224; base de connaissance et aux mod&#233;lisations probabilistes. Dans cette m&#233;thode, la
connaissance linguistique n&#8217;est pas abstraite sous forme de r&#232;gles ou de mod&#232;le stochastique ;
&#224; l&#8217;inverse, elle demeure implicitement repr&#233;sent&#233;e dans le corpus (Daelemans, 1996), la g&#233;n&#233;-
ralisation &#224; de nouvelles donn&#233;es s&#8217;effectuant toujours dans un contexte d&#233;fini (Lepage, 1999).
Dans sa version &#8220;canonique&#8221;, l&#8217;analyse par analogie d&#8217;un objet x lui associe une repr&#233;sentation
f(x) en deux temps :
&#8211; identification d&#8217;un rapport de proportionnalit&#233; impliquant x et 3 objets d&#233;j&#224; connus, b, c, et
</p>
<p>d ; on note cette relation x : b :: c : d, signifiant que x est &#224; b ce que c est &#224; d ;
&#8211; construction d&#8217;une analyse f(x) de x par transfert analogique, consistant &#224; trouver f(x) tel
</p>
<p>que : f(x) : f(b) :: f(c) : f(d).
Ce principe est int&#233;ressant &#224; plus d&#8217;un titre : en premier lieu, il est r&#233;guli&#232;rement utilis&#233; pour d&#233;-
crire un certain nombre de ph&#233;nom&#232;nes cognitifs ; dans le cadre de la linguistique traditionnelle,
il est invoqu&#233; pour rendre compte de r&#233;gularit&#233;s linguistiques, en particulier morphologiques
(Matthews, 1972) ; son utilisation en traitement automatique des langues a donn&#233; des r&#233;sultats
encourageants pour un certain nombre de t&#226;ches telles que : l&#8217;analyse et la g&#233;n&#233;ration mor-
phologique (Lepage, 1999; Pirrelli &amp; Yvon, 1999a; Tanguy &amp; Hathout, 2002) ; la conversion
orthographique-phon&#233;tique (Yvon, 1997; Yvon, 1999), ou encore la d&#233;sambigu&#239;sation s&#233;man-
tique (Federici et al., 1997). Ces exp&#233;riences ont &#233;galement d&#233;montr&#233; que l&#8217;induction analo-
gique permet de manipuler directement des donn&#233;es linguistiques sous une forme plus &#8220;natu-
relle&#8221; (Pirrelli &amp; Yvon, 1999b; Hathout, 2002). Enfin, elle se r&#233;v&#232;le fournir un cadre permettant
d&#8217;int&#233;grer des connaissances h&#233;t&#233;rog&#232;nes issues de sources diff&#233;rentes.
</p>
<p>1.2 Analogie dans les s&#233;quences
</p>
<p>Utiliser l&#8217;analogie en TAL pr&#233;suppose toutefois de d&#233;finir cette notion pour des s&#233;quences sym-
boliques, puisque telle est la forme sous laquelle se pr&#233;sentent le plus directement les objets
linguistiques. Pourtant, l&#8217;analogie entre s&#233;quences n&#8217;a pas fait l&#8217;objet d&#8217;une d&#233;finition formelle
(voir toutefois (Lepage, 1998; Lepage, 2001) pour l&#8217;&#233;tude de diverses formalisations et de leurs
propri&#233;t&#233;s). La mise en &#339;uvre de strat&#233;gies d&#8217;inf&#233;rence analogique pose &#233;galement plusieurs
probl&#232;mes th&#233;oriques et pratiques :
&#8211; la construction de tous les triplets d&#8217;objets analogues &#224; x : une proc&#233;dure na&#239;ve examine tous
</p>
<p>les quadruplets (x, b, c, d), soit une complexit&#233; cubique qui est excessive quand on manipule
des bases d&#8217;exemples r&#233;elles, contenant des milliers d&#8217;&#233;l&#233;ments ;
</p>
<p>&#8211; lorsqu&#8217;une &#233;quation analogique a : b :: c :? a plusieurs solutions, il est n&#233;cessaire de disposer
de crit&#232;res exprimant des pr&#233;f&#233;rences sur les ensembles de solutions ;
</p>
<p>&#8211; inversement, la recherche de triplets analogues peut &#233;chouer, entra&#238;nant l&#8217;&#233;chec du calcul de
f(x). Pour faire face &#224; ces situations, il est n&#233;cessaire de disposer de notions plus affaiblies
de l&#8217;analogie, qui permettent de garantir la construction d&#8217;au moins une analyse de x.
</p>
<p>Dans cet article, nous nous proposons de fournir des &#233;l&#233;ments de r&#233;ponse aux deux premi&#232;res
de ces questions. Dans un premier temps (Section 2), nous proposons une d&#233;finition de l&#8217;analo-
gie sur les s&#233;quences, et nous montrons (Section 3) que cette d&#233;finition permet (i) de construire
des transducteurs finis qui r&#233;solvent les analogies ; (ii) de calculer efficacement tous les quadru-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analogies dans les s&#233;quences : un solveur &#224; &#233;tats finis
</p>
<p>plets analogiques impliquant un &#233;l&#233;ment particulier ; (iii) de d&#233;finir et calculer efficacement une
mesure quantitative, appel&#233;e degr&#233;, de la qualit&#233; d&#8217;une analogie.
</p>
<p>Dans un second temps (Section 4), nous pr&#233;sentons les r&#233;sultats d&#8217;une s&#233;rie d&#8217;exp&#233;rimentations
conduites sur des lexiques de plusieurs langues. Ces exp&#233;riences visent d&#8217;une part &#224; caract&#233;riser
empiriquement l&#8217;extension analogique d&#8217;un langage ; d&#8217;autre part &#224; valider l&#8217;hypoth&#232;se que nos
algorithmes sont potentiellement utiles dans un contexte d&#8217;apprentissage automatique.
</p>
<p>2 Analogies dans les s&#233;quences
</p>
<p>2.1 Notations
</p>
<p>Soit &#931; un vocabulaire fini, &#931;&#1; est l&#8217;ensemble des s&#233;quences finies de symboles de &#931; (des mots)
et &#1; le mot vide. Un mot x, de longueur | x | , se d&#233;compose de fa&#231;on unique selon x = x|x|1 ou
encore x = x1 . . . x|x|, avec xi &#8712; &#931;. Classiquement, xy d&#233;note la concat&#233;nation des mots x et y.
Si x = uzv, on appelle u un pr&#233;fixe de x, v un suffixe de x, et z un facteur de x. Un sous-mot
de x = x1 . . . xn est un mot v tel que &#8707;Iv = {i1 . . . ik}, 1 &#8804; i1 &lt; i2 . . . ik &#8804; n et v = xi1 . . . xik .
R&#233;ciproquement, tout ensemble ordonn&#233; I d&#8217;indices de {1 . . . | x | } d&#233;finit un sous-mot x(I)
de x. Si v est un sous-mot de x, nous noterons : v &#8712; x.
Un automate fini A est un 5-uplet (&#931;, Q, q0, F, &#948;), avec &#931; le vocabulaire, Q un ensemble fini
d&#8217;&#233;tats, q0 &#8712; Q l&#8217;&#233;tat initial, F &#8834; Q l&#8217;ensemble des &#233;tats finals et &#948; la fonction de transition
associant des couples de &#931;&#215;Q avec des parties de Q. Le langage accept&#233; par A est not&#233; L(A) ; si
&#948;&#1; d&#233;note la fermeture transitive de &#948; il vient L(A) = {w, &#948;&#1;(q0, w) &#8745; F &#6;= &#8709;}. Un transducteur
fini est un automate fini comportant deux rubans : un pour l&#8217;entr&#233;e et un pour la sortie. En
cons&#233;quence, ses transitions sont &#233;tiquet&#233;es par des paires a : b, avec a dans l&#8217;alphabet d&#8217;entr&#233;e
&#931;1 et b dans l&#8217;alphabet de sortie &#931;2. Une pr&#233;sentation d&#233;taill&#233;e des transducteurs finis et des
principaux algorithmes s&#8217;y rapportant est donn&#233;e dans (Roche &amp; Schabes, 1997).
</p>
<p>2.2 Analogies et &#233;quations analogiques
</p>
<p>Dans cette section, nous donnons une d&#233;finition de la notion d&#8217;analogie entre mots, de laquelle
nous d&#233;duisons diverses propri&#233;t&#233;s classiques.
</p>
<p>D&#233;finition 1 (x, y, z, t) &#8712; &#931;+ constituent une proportion analogique, not&#233;e x : y :: z : t ssi
&#8707;n &gt; 0, &#945;i, i = 1. . .n, &#946;i, i = 1. . .n &#8712; &#931;&#1; tels que :
</p>
<p>soit x = &#945;1. . .&#945;n t = &#946;1. . .&#946;n y = &#945;1&#946;2&#945;3. . . z = &#946;1&#945;2&#946;3. . .
soit x = &#945;1. . .&#945;n t = &#946;1. . .&#946;n y = &#946;1&#945;2&#946;3. . . z = &#945;1&#946;2&#945;3. . .
</p>
<p>avec &#8704;i, &#945;i&#946;i &#6;= &#1;. Le plus petit n pour lequel une telle relation existe est le degr&#233; de l&#8217;analogie.
</p>
<p>Un exemple de proportion v&#233;rifiant cette d&#233;finition est :
</p>
<p>subjectif : subversif :: injection : inversion</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas Stroppa, Fran&#231;ois Yvon
</p>
<p>avec n = 3 et les facteurs suivants : &#945;1 = sub, &#945;2 = ject, &#945;3 = if , &#946;1 = in, &#946;2 = vers,
&#946;3 = ion
</p>
<p>1. Le degr&#233; de cette proportion est donc 3. D&#8217;une mani&#232;re g&#233;n&#233;rale, le degr&#233; mesure la
qualit&#233; intrins&#232;que d&#8217;une proportion : plus il est faible, meilleure est l&#8217;analogie.
</p>
<p>De cette d&#233;finition se d&#233;duisent ais&#233;ment les propri&#233;t&#233;s classiques de l&#8217;analogie (voir e.g. (Le-
page, 2001)) :
</p>
<p>&#8704;x &#8712; &#931;+, x : x :: x : x (1)
&#8704;x, y &#8712; &#931;+ : x : x :: y : y (2)
</p>
<p>&#8704;x, y, z, t &#8712; &#931;+ : x : y :: z : t &#8658; z : t :: x : y (3)
&#8704;x, y, z, t &#8712; &#931;+ : x : y :: z : t &#8658; x : z :: y : t (4)
</p>
<p>Une &#233;quation analogique est une proportion analogique pour laquelle seuls trois termes sur
quatre sont connus ; le calcul du terme manquant correspondant &#224; la r&#233;solution de l&#8217;&#233;quation.
</p>
<p>D&#233;finition 2 t est une solution de l&#8217;&#233;quation analogique x : y :: z :? ssi x : y :: z : t.
</p>
<p>La d&#233;finition (1) ne permet de garantir ni qu&#8217;une &#233;quation a toujours une solution, ni inversement
l&#8217;unicit&#233; d&#8217;une solution. Ainsi, par exemple, abc : def :: ijk :? ne peut &#234;tre r&#233;solue ; alors que c :
ac :: bc :? a deux solutions : abc et bac. (Lepage, 2001) donne une s&#233;rie de conditions n&#233;cessaires
pour qu&#8217;une &#233;quation ait au moins une solution, conditions qui s&#8217;appliquent &#233;galement ici. En
particulier, si t est solution de x : y :: z :?, alors t contient tous les symboles de y et de z qui
ne sont pas dans x, dans un ordre inchang&#233;. Un corollaire est que toutes les solutions d&#8217;une
&#233;quation analogique ont la m&#234;me longueur.
</p>
<p>3 Un solveur &#224; &#233;tats finis
</p>
<p>3.1 Mot compl&#233;mentaire et m&#233;lange
</p>
<p>Mots compl&#233;mentaires Nous commen&#231;ons par introduire la notion de mots compl&#233;men-
taires. Si v est un sous-mot de x, on appelle compl&#233;mentaire de v par rapport &#224; x le sous-mot
form&#233; en conservant uniquement les symboles de x qui ne sont pas dans v. Ainsi, par exemple
eeaie est le compl&#233;mentaire (vocalique) de xmplr par rapport &#224; exemplaire. Formellement :
</p>
<p>D&#233;finition 3 Si v est un sous-mot de x, correspondant &#224; l&#8217;ensemble d&#8217;indices Iv, l&#8217;ensemble des
sous-mot compl&#233;mentaires de v par rapport &#224; x est d&#233;fini par x\v = {y, y &#8712; x, v = x({0 . . . |
x | }\Iy)}. Si v n&#8217;est pas un sous-mot de x, x\v est vide.
</p>
<p>&#192; chaque mot de &#931;&#1; on associe alors une relation binaire sur &#931;&#1; &#215;&#931;&#1;, not&#233;e \w, et d&#233;finie par :
</p>
<p>D&#233;finition 4 u\wv si et seulement si u &#8712; w\v.
</p>
<p>Pour tout mot x de &#931;&#1;, il est ais&#233; de construire un automate fini Ax qui reconna&#238;t uniquement
x en &#233;tablissant une bijection entre les &#233;tats de Ax et les pr&#233;fixes de x. En ajoutant &#224; chaque
</p>
<p>1On peut tout aussi bien prendre &#945;2 = jecti, &#945;3 = f ...</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analogies dans les s&#233;quences : un solveur &#224; &#233;tats finis
</p>
<p>transition de Ax une transition spontan&#233;e, on d&#233;rive un automate Sx qui reconna&#238;t exactement
les sous-mots de x. En transformant Sx en un transducteur Tx tel que chaque transition de Sx
&#233;tiquet&#233;e par xi produit en sortie &#1; et chaque transition &#1; produit xi, on obtient finalement une
machine calculant la relation de compl&#233;mentation par rapport &#224; x. La relation de compl&#233;menta-
rit&#233; est donc une relation rationnelle. Ces constructions sont illustr&#233;es sur la Figure 1.
</p>
<p>2
</p>
<p>2
</p>
<p>1
x
</p>
<p>1
</p>
<p>x
</p>
<p>kT
k
</p>
<p>1 2 k
</p>
<p>1
</p>
<p>S
</p>
<p>2A k
</p>
<p>x
</p>
<p>x x
x
</p>
<p>x x x
</p>
<p>x
</p>
<p>x
</p>
<p>0 1 2 k
</p>
<p>0 1 2 k
</p>
<p>&#949;: &#949;: &#949;:
:&#949; :&#949; :&#949;
</p>
<p>0 &#949; 1 &#949; 2 &#949; k
</p>
<p>xx
</p>
<p>x
x
</p>
<p>FIG. 1 &#8211; Automates et transducteurs pour x, ses sous-mots et la relation de compl&#233;mentarit&#233;
</p>
<p>On notera pour finir que les notions de sous-mots compl&#233;mentaires et de relation de compl&#233;-
mentarit&#233; s&#8217;&#233;tendent sans difficult&#233; &#224; des langages rationnels quelconques.
</p>
<p>M&#233;lange Le produit de m&#233;lange est d&#233;fini par exemple dans (Sakarovitch, 2003) comme suit.
Si u et v sont deux mots de &#931;&#1;, leur m&#233;lange u &#8226; v est le langage d&#233;fini par :
</p>
<p>u &#8226; v = {u1v1u2v2 . . . unvn, avec ui, vi &#8712; &#931;&#1;, u = u1 . . . un, w = v1 . . . vn}
</p>
<p>Le m&#233;lange de u et v contient tous les mots form&#233;s des symboles de u et de v, avec la contrainte
que si a pr&#233;c&#232;de b dans u ou v, alors cet ordre est respect&#233; dans u &#8226; v. Ainsi par exemple, si l&#8217;on
prend u = abc et v = def , alors les mots suivants : abcdef , abdefc, adbecf ... sont dans u &#8226; v ;
ce n&#8217;est pas le cas de abefcd, dans lequel d suit e, alors qu&#8217;il devrait le pr&#233;c&#233;der.
</p>
<p>Cette op&#233;ration s&#8217;&#233;tend naturellement aux langages, selon, pour les langages K et L :
</p>
<p>K &#8226; L = &#8899;
x&#8712;K,y&#8712;L
</p>
<p>x &#8226; y
</p>
<p>Il est connu que cette op&#233;ration est une op&#233;ration rationnelle, et que le m&#233;lange de deux mots est
calcul&#233; en effectuant le produit des automates reconnaissant ces deux mots. Formellement, si
K et L sont deux langages rationnels reconnus respectivement par AK = (&#931;, QK , q0K , FK , &#948;K)
et AL = (&#931;, QL, q0L, FL, &#948;L), avec AK et AL d&#233;terministes, l&#8217;automate A calculant K &#8226; L se
construit par : A = (&#931;, QK &#215; QL, (q0K , q0L), FK &#215; FL, &#948;), avec &#948; d&#233;finie par : &#948;((qK , qL), a) =
(rK , rL) si et seulement si soit &#948;K(qK , a) = rK et qL = rL soit &#948;L(qL, a) = rL et qK = rK .
</p>
<p>Les notions de sous-mots et de m&#233;lange sont reli&#233;es par la relation suivante :
</p>
<p>x &#8712; u &#8226; v &#8660; u &#8712; x\v
</p>
<p>qui &#233;nonce que u et v sont en relation compl&#233;mentaire par rapport &#224; x si et seulement si x
appartient au m&#233;lange de ces deux mots.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas Stroppa, Fran&#231;ois Yvon
</p>
<p>3.2 Un solveur analogique
</p>
<p>Ces notions pr&#233;liminaires &#233;tant pos&#233;es, il devient possible de r&#233;-exprimer la notion de proportion
analogique. Le r&#233;sultat principal est &#233;nonc&#233; par la proposition suivante :
</p>
<p>Proposition 1
</p>
<p>x : y :: z : t &#8660; x &#8226; t &#8745; y &#8226; z &#6;= &#8709;
</p>
<p>L&#8217;intuition de cette proposition est que, pour que l&#8217;analogie soit &#233;tablie, il faut non seulement
que les symboles de x et t soient les m&#234;mes que ceux de y et z, mais aussi que les symboles de
x (et aussi de t) apparaissant dans y et z apparaissent dans le m&#234;me ordre. Ce r&#233;sultat est &#233;tabli
formellement dans (Yvon, 2003), ainsi que le corollaire suivant :
</p>
<p>Proposition 2
</p>
<p>t est une solution de x : y :: z :? &#8660; t &#8712; y &#8226; z\x
</p>
<p>Ce r&#233;sultat &#233;nonce que l&#8217;ensemble des solutions d&#8217;une &#233;quation analogique x : y :: z :? est un
ensemble rationnel, qui peut &#234;tre calcul&#233; par un transducteur fini T . T est obtenu en construisant
tout d&#8217;abord l&#8217;automate qui reconnna&#238;t le m&#233;lange de y et z, duquel on d&#233;rive ensuite l&#8217;automate
des compl&#233;mentaires, par une m&#233;thode analogue &#224; celle d&#233;taill&#233;e ci-dessus.
</p>
<p>Deux r&#233;sultats compl&#233;mentaires sont &#233;galement &#233;tablis dans (Yvon, 2003) :
&#8211; le solveur analogique implant&#233; sous la forme d&#8217;un transducteur fini g&#233;n&#233;ralise strictement
</p>
<p>l&#8217;approche fond&#233;e sur des distances d&#8217;&#233;dition propos&#233;e par (Lepage, 1998) ;
&#8211; le calcul du degr&#233; d&#8217;une analogie x : y :: z : t est r&#233;alis&#233; en &#8220;comptant&#8221; dans t le nombre
</p>
<p>de transitions entre fragments de y et de z ; pour r&#233;aliser directement ce calcul, il suffit de
composer T avec un transducteur fini qui effectue un tel d&#233;compte.
</p>
<p>Ces r&#233;sultats th&#233;oriques permettent d&#8217;implanter efficacement le calcul de l&#8217;extension analogique
d&#8217;un langage fini L, not&#233;e L3, qui contient tous les mots entrant dans une relation de proportion
analogique avec 3 mots de L. Dans la pratique, plut&#244;t que calculer explicitement le transducteur
(L&#8226;L)\L, qui contient un nombre d&#8217;&#233;tats quadratique par rapport &#224; l&#8217;automate AL repr&#233;sentant
L, il est plus efficace de le simuler, &#224; partir d&#8217;une repr&#233;sentation de AL.
</p>
<p>4 Exp&#233;rimentations
</p>
<p>Dans cette section, nous pr&#233;sentons les r&#233;sultats d&#8217;une premi&#232;re &#233;tude empirique de L3, qui
vise &#224; comprendre le type de g&#233;n&#233;ralisation effectu&#233; par le principe analogique et &#224; contr&#244;ler la
validit&#233; de ce principe pour des t&#226;ches d&#8217;inf&#233;rence. Nous cherchons principalement &#224; r&#233;pondre
&#224; deux questions : L3 contient-il bien les mots &#8220;valides&#8221; absents de L ? L3 ne surg&#233;n&#233;ralise-t-il
pas abusivement L ? Outre leur int&#233;r&#234;t th&#233;orique, ces questions sont &#233;galement importantes dans
l&#8217;optique d&#8217;utiliser notre mod&#232;le pour faire de l&#8217;apprentissage automatique. Avant en effet de
chercher &#224; transf&#233;rer des relations analogiques existant dans un langage L vers un autre espace
de repr&#233;sentation L&#8242;, il convient de s&#8217;assurer au pr&#233;alable que des s&#233;quences qui sont absentes
de L, mais qui sont toutefois des s&#233;quences possibles, sont effectivement trouv&#233;es dans L3.
</p>
<p>En revanche, il est important de r&#233;aliser que ces exp&#233;riences ne visent pas &#224; tester un syst&#232;me
d&#8217;analyse morphologique fond&#233; sur l&#8217;apprentissage par analogie. La mise en place d&#8217;un tel
syst&#232;me exc&#232;dant de loin le cadre de notre travail.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analogies dans les s&#233;quences : un solveur &#224; &#233;tats finis
</p>
<p>4.1 Estimation du rappel
</p>
<p>L&#8217;inf&#233;rence analogique est fond&#233;e si elle permet de g&#233;n&#233;raliser correctement &#224; de nouveaux
exemples. Pour tester cette hypoth&#232;se pour des t&#226;ches d&#8217;analyse lexicale, nous allons montrer
que l&#8217;analogie peut &#234;tre utilis&#233;e comme une proc&#233;dure effective de reconstruction de lexiques.
Pour ce faire, nous utilisons diff&#233;rents lexiques et r&#233;p&#233;tons l&#8217;exp&#233;rience suivante : partitionner
al&#233;atoirement L en n sous-lexiques Pi de m&#234;me taille et calculer le pourcentage moyen d&#8217;&#233;l&#233;-
ments de Pi qui appartiennent &#224; l&#8217;extension analogique de (L\Pi), et qui sont donc recalculables
&#224; partir d&#8217;&#233;l&#233;ments de (L \Pi). La mesure obtenue, que nous appelons densit&#233; analogique s&#8217;ap-
parente donc &#224; une mesure de rappel, estim&#233;e ici par validation crois&#233;e &#224; n blocs. La densit&#233;
analogique est mesur&#233;e pour 11 lexiques, correspondant aux racines, aux lemmes et aux formes
graphiques de quatre langues, le fran&#231;ais, l&#8217;anglais, l&#8217;allemand et le n&#233;erlandais, avec n = 10.
Les lexiques anglais, allemand et n&#233;erlandais proviennent du corpus Celex (Burnage, 1990), les
lexiques fran&#231;ais proviennent du corpus Multext (Ide &amp; V&#233;ronis, 1994) (qui ne contient que
lemmes et formes). Par ailleurs, pour l&#8217;ensemble des exp&#233;rimentations, nous avons uniquement
consid&#233;r&#233; les analogies ayant un degr&#233; inf&#233;rieur ou &#233;gal &#224; 2, ceci nous permettant d&#8217;obtenir
plus rapidement une borne inf&#233;rieure &#224; la densit&#233; recherch&#233;e. Les r&#233;sultats obtenus sont donn&#233;s
dans le tableau 1. Le calcul de la densit&#233; d&#8217;un lexique contenant 300 000 entr&#233;es demande en
moyenne 3 heures.
</p>
<p>TAB. 1 &#8211; Densit&#233;s analogiques de 4 langues (en %)
Fran&#231;ais Anglais Allemand N&#233;erlandais
</p>
<p>Racines - 79.5&#177;3.1 66.7&#177;4.7 78.7&#177;3.5
Lemmes 80.9&#177;3.9 91.1&#177;3.4 81.5&#177;3.4 96.6&#177;1.4
Formes 99.2&#177;0.6 98&#177;1.4 99.7&#177;0.5 99.3&#177;0.8
</p>
<p>Ces r&#233;sultats permettent de faire deux constats. Premi&#232;rement, l&#8217;hypoth&#232;se selon laquelle le
langage est fortement marqu&#233; par des r&#233;gularit&#233;s analogiques est v&#233;rifi&#233;e sur les quatre langues
&#233;tudi&#233;es, comme en attestent des densit&#233;s analogiques sur les lexiques de formes sup&#233;rieures &#224;
98%. Deuxi&#232;mement, on peut remarquer que les formes sont plus facilement reconstructibles
par analogie que les lemmes, eux-m&#234;mes plus facilement reconstructibles que les racines (Fi-
gure 2), ce qui met en &#233;vidence la capacit&#233; d&#8217;une mod&#233;lisation analogique pour d&#233;crire des
ph&#233;nom&#232;nes de d&#233;rivation et de flexion morphologiques.
</p>
<p>4.2 Estimation de la pr&#233;cision
</p>
<p>Une seconde exp&#233;rience vise &#224; montrer que L3 n&#8217;est pas surg&#233;n&#233;ratif. En effet, il s&#8217;agit de
v&#233;rifier non seulement que (L \ P )3 contient une large partie de P , mais &#233;galement qu&#8217;il ne
contient que des &#233;l&#233;ments voisins de ceux de L. Le protocole exp&#233;rimental consiste &#224; consid&#233;rer
diff&#233;rents processus al&#233;atoires de g&#233;n&#233;ration d&#8217;entr&#233;es lexicales mod&#233;lisant de mieux en mieux
L, pour v&#233;rifier que mieux on mod&#233;lise L, plus on g&#233;n&#232;re des mots de L3. Un premier mod&#232;le,
not&#233; &#8220;Uniforme&#8221;, g&#233;n&#232;re un mot en (i) tirant une longueur l suivant un processus de Poisson ;
(ii) tirant l lettres avec une probabilit&#233; uniforme. Deux mod&#232;les n-grammes sont &#233;galement
appris sur L, pour des valeurs de n valant 1 et 3. Chacun de ces deux mod&#232;les est utilis&#233; pour
g&#233;n&#233;rer 100 mots et l&#8217;on mesure la proportion de ces mots qui figurent dans L3. La ligne &#8220;R&#233;el&#8221;
rappelle enfin les valeurs de densit&#233; calcul&#233;es dans la section pr&#233;c&#233;dente. Les r&#233;sultat obtenus
sont rapport&#233;s dans le tableau 2.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas Stroppa, Fran&#231;ois Yvon
</p>
<p>FIG. 2 &#8211; Densit&#233;s analogiques de 4 langues
</p>
<p> 
</p>
<p> 65
</p>
<p> 70
</p>
<p> 75
</p>
<p> 80
</p>
<p> 85
</p>
<p> 90
</p>
<p> 95
</p>
<p> 100
</p>
<p>  Racines  Lemmes  Formes  
</p>
<p>D
en
</p>
<p>si
t&#233;
</p>
<p> a
na
</p>
<p>lo
gi
</p>
<p>qu
e 
</p>
<p>(e
n 
</p>
<p>%
)
</p>
<p>Type de lexique
</p>
<p>n&#233;erlandais
anglais
</p>
<p>allemand
fran&#231;ais
</p>
<p>Ces r&#233;sultats vont tous dans le m&#234;me sens : mieux le mod&#232;le de g&#233;n&#233;ration mod&#233;lise L, plus
il a une grande intersection avec L3. Cela confirme notre hypoth&#232;se que L3 n&#8217;est pas n&#8217;est
pas compos&#233; d&#8217;&#233;l&#233;ments al&#233;atoires, mais d&#8217;&#233;l&#233;ments &#8220;proches&#8221; de L. L&#8217;extension analogique
d&#8217;un langage fournit donc une g&#233;n&#233;ralisation finie de L, qui inclut int&#233;gralement L ainsi que de
nombreux mots &#8220;proches&#8221; de L.
</p>
<p>5 Conclusions
</p>
<p>Dans cet article, nous avons propos&#233; une d&#233;finition formelle de l&#8217;analogie entre s&#233;quences de
symbole, de laquelle nous avons pu d&#233;duire une implantation d&#8217;un solveur d&#8217;&#233;quations analo-
giques sous la forme d&#8217;un transducteur fini. Ces r&#233;sultats th&#233;oriques sont compl&#233;t&#233;s par une
&#233;tude empirique de l&#8217;extension analogique d&#8217;un langage, qui illustre, sur des donn&#233;es diction-
nairiques, la validit&#233; de l&#8217;approche &#224; base d&#8217;analogie.
</p>
<p>Ce travail offre de nombreuses perspectives. Du point de vue th&#233;orique, nous envisageons prin-
cipalement d&#8217;&#233;tendre ces mod&#232;les dans trois directions :
&#8211; d&#233;finir, en utilisant les notions de m&#233;lange et de compl&#233;mentation, des versions plus &#8220;fai-
</p>
<p>bles&#8221; de l&#8217;analogie entre s&#233;quences, permettant d&#8217;obtenir un meilleur rappel pour des t&#226;ches
d&#8217;analyse de phrases ;
</p>
<p>&#8211; d&#233;finir des mesures plus riches que le degr&#233; de la qualit&#233; d&#8217;une analogie, int&#233;grant en parti-
culier des informations statistiques ou encore des contraintes linguistiques suppl&#233;mentaires ;
</p>
<p>&#8211; d&#233;finir formellement l&#8217;analogie pour d&#8217;autres repr&#233;sentations classiquement utilis&#233;es en TAL,
en particulier entre arbres, entre langages finis et entre graphes acycliques orient&#233;s.
</p>
<p>Du point de vue empirique, nous envisageons dans un premier temps d&#8217;implanter un syst&#232;me
complet et g&#233;n&#233;rique d&#8217;inf&#233;rence analogique, qui sera &#233;valu&#233; sur diverses t&#226;ches d&#8217;analyse lin-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analogies dans les s&#233;quences : un solveur &#224; &#233;tats finis
</p>
<p>TAB. 2 &#8211; Caract&#233;risation de L3 - densit&#233;s en %
</p>
<p>Fran&#231;ais Anglais Allemand N&#233;erlandais
Uniforme - 1.0&#177;0 7.7&#177;0.9 1.9&#177;0.3
</p>
<p>Racines 1-gramme - 37.9&#177;0.3 36.9&#177;0.8 40.2&#177;0.7
3-gramme - 66.6&#177;1.0 63.4&#177;0.8 69.7&#177;0.8
R&#233;el - 79.5&#177;3.1 66.7&#177;4.7 78.7&#177;3.5
Uniforme 0&#177;0 1.7&#177;0.5 0&#177;0 0.7&#177;0.5
</p>
<p>Lemmes 1-gramme 34&#177;0 38.2&#177;1.0 18.6&#177;0.7 25.9&#177;0.9
3-gramme 58.7&#177;1.4 50.2&#177;1.0 33.5&#177;1.0 41.2&#177;0
R&#233;el 80.9&#177;3.9 91.1&#177;3.4 81.5&#177;3.3 96.6&#177;1.3
Uniforme 1&#177;0 0.0&#177;0.0 0.9&#177;0.3 1.0&#177;0.0
</p>
<p>Formes 1-gramme 26.6&#177;0.8 33.9&#177;0.3 18.0&#177;0.1 44.2&#177;0.8
3-gramme 61.5&#177;0 53.0&#177;0.6 57.7&#177;1.3 65.3&#177;2.6
R&#233;el 99.2&#177;0.6 98.0&#177;1.4 99.7&#177;0.5 99.3&#177;0.8
</p>
<p>guistique.
</p>
<p>Remerciements
</p>
<p>Une partie de ce travail a &#233;t&#233; conduit dans le cadre du programme TCAN du CNRS. En parti-
culier, il a b&#233;n&#233;fici&#233; d&#8217;&#233;changes fructueux avec L. Miclet, A. Delhaye de l&#8217;IRISA (Lannion) et
de A. Cornu&#233;jols du LRI (Orsay).
</p>
<p>R&#233;f&#233;rences
</p>
<p>BURNAGE G. (1990). CELEX : A Guide for Users. Rapport interne, University of Nijmegen, Center for
Lexical Information, Nijmegen.
</p>
<p>DAELEMANS W. (1996). Abstraction considered harmful : lazy learning of language processing. In
H. J. V. DEN HERIK &amp; A. WEIJTERS, Eds., Proceedings of the sixth Belgian-Dutch Conference on
Machine Learning, p. 3&#8211;12, Maastricht, The Nederlands.
</p>
<p>FEDERICI S., MONTEMAGNI S. &amp; PIRRELLI V. (1997). Inferring semantic similarity from distri-
butional evidence : an analogy-based approach to word sense disambiguation. In Proceedings of the
ACL/EACL Workshop on Automatic Information Extraction and Building of Lexical Semantic Resources
for NLP Applications, Madrid, Spain.
</p>
<p>HATHOUT N. (2002). From wordnet to celex : acquiring morphological links from dictionaries of syno-
nyms. In Proceedings of the Third Conference on Language, Resources and Evaluation, LREC&#8217;03, Las
Palmas de Gran Canaria, Espagne.
</p>
<p>IDE N. &amp; V&#201;RONIS J. (1994). MULTEXT (Multilingual Tools and Corpora). In Proceedings of the
14th International Conference on Computational Linguistics (COLING), p. 588&#8211;592, Kyoto, Japan.
</p>
<p>LEPAGE Y. (1998). Solving analogies on words : An algorithm. In Proceedings of COLING-ACL &#8217;98,
volume 2, p. 728&#8211;735, Montr&#233;al, Canada.
</p>
<p>LEPAGE Y. (1999). Analogy+tables=conjugation. In G. FRIEDL &amp; H. MAYR, Eds., Proceedings of
NLDB&#8217;99, p. 197&#8211;201, Klagenfurt, Germany.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nicolas Stroppa, Fran&#231;ois Yvon
</p>
<p>LEPAGE Y. (2001). Analogy and formal language. Electronic Notes in Theoretical Computer Science,
47, 1&#8211;12.
</p>
<p>MATTHEWS P. (1972). Inflectional Morphology. A Theoretical Study Based on Aspects of Latin Verb
Conjugation. Cambridge : Cambridge University Press.
</p>
<p>PIRRELLI V. &amp; YVON F. (1999a). Analogy in the lexicon : a probe into analogy-based machine learning
of language. In Proceedings of the 6th International Symposium on Human Communication, Santiago
de Cuba, Cuba.
</p>
<p>PIRRELLI V. &amp; YVON F. (1999b). The hidden dimension : paradigmatic approaches to data-driven
natural language processing. Journal oF Experimental and Theoretical Artificial Intelligence, Special
Issue on Memory-Based Language Processing, 11, 391&#8211;408.
</p>
<p>ROCHE E. &amp; SCHABES Y. (1997). Introduction to finite-state devices in natural language processing.
In E. ROCHE &amp; Y. SCHABES, Eds., Finite State Natural Language Processing, Cambridge, MA : The
MIT Press.
</p>
<p>SAKAROVITCH J. (2003). El&#233;ments de th&#233;orie des automates. Vuibert, Paris.
</p>
<p>TANGUY L. &amp; HATHOUT N. (2002). Webaffix : un outil d&#8217;acquisition morphologique d&#233;rivationnelle
&#224; partir du web. In Actes de la 9eme Conf&#233;rence Annuelle sur le Traitement Automatique des Langues
Naturelles (TALN&#8217;2002), Nancy, France.
</p>
<p>YVON F. (1997). Paradigmatic cascades : a linguistically sound model of pronunciation by analogy. In
Proceedings of the 35th annual meeting of the ACL, Madrid, Spain.
</p>
<p>YVON F. (1999). Pronouncing unknown words using multi-dimensional analogies. In Proceedings of
the European Conference on Speech Communication and Technology (Eurospeech), volume 1, p. 199&#8211;
202, Budapest, Hungary.
</p>
<p>YVON F. (2003). Finite-state machines solving analogies on words. Rapport interne, ENST, Paris.</p>

</div></div>
</body></html>