<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction de terminologies bilingues &#224; partir de corpus comparables</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Extraction de terminologies bilingues
&#224; partir de corpus comparables
</p>
<p>Emmanuel Morin, Samuel Dufour-Kowalski, B&#233;atrice Daille
Universit&#233; de Nantes - LINA - FRE CNRS 2729
</p>
<p>2, rue de la Houssini&#232;re - BP 92208
44322 Nantes Cedex 3, France
</p>
<p>{morin,dufour,daille}@lina.univ-nantes.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article pr&#233;sente une m&#233;thode pour extraire, &#224; partir de corpus comparables d&#8217;un domaine
de sp&#233;cialit&#233;, un lexique bilingue comportant des termes simples et complexes. Cette m&#233;thode
extrait d&#8217;abord les termes complexes dans chaque langue, puis les aligne &#224; l&#8217;aide de m&#233;tho-
des statistiques exploitant le contexte des termes. Apr&#232;s avoir rappel&#233; les difficult&#233;s que pose
l&#8217;alignement des termes complexes et pr&#233;cis&#233; notre approche, nous pr&#233;sentons le processus
d&#8217;extraction de terminologies bilingues adopt&#233; et les ressources utilis&#233;es pour nos exp&#233;rimen-
tations. Enfin, nous &#233;valuons notre approche et d&#233;montrons son int&#233;r&#234;t en particulier pour
l&#8217;alignement de termes complexes non compositionnels.
</p>
<p>This article presents a method of extracting bilingual lexica composed of simple and multi-word
terms from comparable corpora of a technical domain. First, this method extracts the multi-
word terms in each language, and then uses statistical methods to align them by exploiting
the term contexts. After explaining the difficulties involved in aligning multi-word terms and
specifying our approach, we show the adopted process for bilingual terminology extraction and
the resources used in our experiments. Finally, we evaluate our approach and demonstrate its
significance, particularly in relation to non-compositional multi-word term alignment.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Terminologie bilingue, corpus comparable, termes complexes
Bilingual terminology, comparable corpora, multi-word terms
</p>
<p>1 Introduction
</p>
<p>Les recherches en extraction automatique de lexiques bilingues &#224; partir de corpus se sont princi-
palement concentr&#233;es sur l&#8217;exploitation de corpus parall&#232;les (Veronis, 2000). &#192; partir de textes
align&#233;s phrases &#224; phrases, des techniques symboliques (Carl &amp; Langlais, 2002), statistiques</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin, Samuel Dufour-Kowalski, B&#233;atrice Daille
</p>
<p>(Gaussier &amp; Lang&#233;, 1995) ou mixtes (Daille et al., 1994) sont mises en &#339;uvre pour aligner
les diff&#233;rents &#233;l&#233;ments constitutifs de ces phrases. Les textes parall&#232;les restent n&#233;anmoins des
ressources rares, principalement pour des couples de langues ne faisant pas intervenir l&#8217;anglais.
Les recherches r&#233;centes se sont donc int&#233;ress&#233;es &#224; l&#8217;exploitation de corpus comparables. D&#233;-
jean et al (2002) donnent la d&#233;finition suivante d&#8217;un corpus comparable :
&#171; Deux corpus de deux langues l1 et l2 sont dits comparables s&#8217;il existe une sous-partie non
n&#233;gligeable du vocabulaire du corpus de langue l1, respectivement l2, dont la traduction se
trouve dans le corpus de langue l2, respectivement l1 &#187;
</p>
<p>Les principaux travaux d&#8217;extraction de lexiques bilingues &#224; partir de corpus comparables se
focalisent sur l&#8217;extraction de termes simples bilingues. Ainsi, Fung (1998) extrait des couples
de termes simples anglais/chinois avec une pr&#233;cision de 76 % sur les 20 premiers candidats
propos&#233;s en exploitant deux ans du Wall Street Journal et du quotidien japonais Nikkei Financial
News. Rapp (1999) porte cette pr&#233;cision &#224; 89 % sur les 10 premiers candidats en exploitant des
couples de termes simples anglais/allemand &#224; partir d&#8217;un corpus journalistique de 85 millions
de mots. D&#233;jean &amp; Gaussier (2002) obtiennent quant &#224; eux une pr&#233;cision de 84 % sur les 10
premiers candidats pour des couples anglais/allemand &#224; partir d&#8217;un corpus m&#233;dical de 8 millions
de mots. Pour ce qui est de l&#8217;extraction de groupes nominaux bilingues relevant du domaine
g&#233;n&#233;ral &#224; partir de corpus comparables, elle a &#233;t&#233; r&#233;alis&#233;e avec succ&#232;s par Cao &amp; Li (2002) qui
obtiennent une pr&#233;cision de 91 % sur les 3 premiers candidats en exploitant le web.
</p>
<p>Si les r&#233;sultats obtenus dans le domaine de l&#8217;extraction de lexiques bilingues &#224; partir de corpus
comparables sont encourageants, ils restent n&#233;anmoins limit&#233;s soit &#224; l&#8217;extraction de termes sim-
ples bilingues pour des textes g&#233;n&#233;riques ou sp&#233;cialis&#233;s, soit &#224; l&#8217;extraction de groupes nominaux
bilingues pour des textes relevant du domaine g&#233;n&#233;ral. Nos travaux s&#8217;int&#233;ressent &#224; l&#8217;extraction
de termes complexes bilingues pour des domaines sp&#233;cialis&#233;s dans des textes comparables.
</p>
<p>Si les termes complexes bilingues rendent mieux compte de la terminologie d&#8217;un domaine, leur
extraction pose un probl&#232;me plus d&#233;licat que celle des termes simples, du fait que :
</p>
<p>&#8226; Les termes simples et complexes ne se traduisent pas syst&#233;matiquement par un terme
de m&#234;me longueur. Par exemple, le terme complexe peuplement forestier est traduit en
anglais par le terme simple crop, et le terme essence d&#8217;ombre par shade tolerant species.
Ce probl&#232;me bien connu, d&#233;crit par Brown et al. (1993) sous le terme de fertilit&#233;, est
rarement pris en compte dans l&#8217;extraction de lexiques bilingues. Une hypoth&#232;se de tra-
duction mot &#224; mot &#233;tant le plus souvent adopt&#233;e.
</p>
<p>&#8226; La traduction d&#8217;un terme complexe n&#8217;est pas toujours obtenue par la traduction de ces
composants (Melamed, 2001). Par exemple, le terme plantation &#233;nerg&#233;tique est traduit
en anglais par fuel plantation, o&#249; fuel n&#8217;est pas la traduction de &#233;nerg&#233;tique.
</p>
<p>&#8226; Un m&#234;me terme peut se pr&#233;senter sous diff&#233;rentes formes suite &#224; des variations mor-
phologique, syntaxique ou encore s&#233;mantique (dans le cas de la synonymie). Les varia-
tions des termes doivent donc &#234;tre pris en compte dans le processus de traduction. Par ex-
emple, les termes fran&#231;ais am&#233;nagement de la for&#234;t et am&#233;nagement forestier sont traduits
par le m&#234;me terme en anglais : forest management.
</p>
<p>Notre approche prend en compte ces trois caract&#233;ristiques. Nous adoptons une approche mixte
qui extrait en premier &#224; l&#8217;aide d&#8217;une m&#233;thode linguistique les termes complexes dans chacune
des langues puis tente de les aligner &#224; l&#8217;aide d&#8217;une m&#233;thode statistique. L&#8217;alignement s&#8217;effectue</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction de terminologies bilingues &#224; partir de corpus comparables
</p>
<p>en comparant les contextes lexicaux des termes &#224; traduire et ceux des termes identifi&#233;s en langue
cible. Cette m&#233;thode permet d&#8217;&#233;viter une traduction uniquement compositionnelle des termes
complexes et rend possible des alignements de termes de longueur diff&#233;rente.
</p>
<p>2 Processus d&#8217;extraction
</p>
<p>Nous pr&#233;sentons dans cette section le processus d&#8217;extraction de terminologies bilingues mis
en place qui se d&#233;compose en une phase de traitement linguistique et une phase de traitement
statistique.
</p>
<p>2.1 Traitement linguistique
</p>
<p>L&#8217;objectif premier de cette phase est l&#8217;identification de l&#8217;ensemble des termes complexes pr&#233;s-
ents dans le corpus. Pour ce faire, le corpus est nettoy&#233; des donn&#233;es ind&#233;sirables et segment&#233;
en occurrences de phrases et de formes. Ce dernier est ensuite &#233;tiquet&#233; et lemmatis&#233;. Enfin,
les candidats termes sont extraits du corpus par un outil d&#8217;acquisition terminologique fonc-
tionnant sur le fran&#231;ais et sur l&#8217;anglais : ACABIT1 (Daille, 2003). Ce programme parcourt le
corpus et rel&#232;ve les cooccurrences de candidats termes ou de leurs variations qui &#233;pousent des
structures morphosyntaxiques pr&#233;d&#233;finies. Les diff&#233;rentes occurrences qui r&#233;f&#233;rent &#224; un terme
binaire ou &#224; l&#8217;une de ses variantes sont regroup&#233;es sous un m&#234;me candidat terme. Puis, une
analyse morphologique est effectu&#233;e qui permet de regrouper sous un m&#234;me candidat terme
des variantes morphologiques d&#233;rivationnelles synonymiques comme am&#233;nagement de la for&#234;t
et am&#233;nagement forestier. Les variantes morphologiques et morphosyntaxiques induisant une
distance s&#233;mantique ne sont pas regroup&#233;es sous le m&#234;me candidat terme mais forment un
groupement de candidats termes. Ainsi, les s&#233;quences comme bois chauff&#233; et bois non chauff&#233;
forment un groupement de deux candidats termes li&#233;s par une relation d&#8217;antonymie. Dans la
suite du traitement, nous consid&#233;rons comme variantes de termes uniquement celles qui sont
regroup&#233;es sous le m&#234;me candidat terme. Cette op&#233;ration, qui correspond &#224; une normalisation
terminologique, am&#233;liore le d&#233;coupage du texte en unit&#233;s de sens au m&#234;me titre que la lemma-
tisation au niveau morphologique. De cette mani&#232;re, nous ne traduisons pas un terme mais une
classe d&#8217;&#233;quivalence de termes.
</p>
<p>2.2 Traitement statistique
</p>
<p>L&#8217;objectif de cette seconde phase, qui reprend et adapte la m&#233;thode propos&#233;e par D&#233;jean &amp;
Gaussier (2002), a pour objectif de r&#233;aliser l&#8217;alignement des termes de la langue source avec
ceux de la langue cible. Comme D&#233;jean et al. (2002) pour les termes simples, nous supposons
que la traduction des termes proches du terme &#224; traduire donnera de meilleurs r&#233;sultats que la
traduction directe des termes de son contexte lexical (Fung, 1998; Rapp, 1999).
</p>
<p>1http://www.sciences.univ-nantes.fr/info/perso/permanents/daille/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin, Samuel Dufour-Kowalski, B&#233;atrice Daille
</p>
<p>2.2.1 Calcul des vecteurs de contexte
</p>
<p>Dans un premier temps, le contexte de chaque unit&#233; lexicale2 i est extrait en rep&#233;rant les unit&#233;s
qui occurrent avec i dans une fen&#234;tre contextuelle3 de n phrases autour de celle comportant i.
Pour chaque unit&#233; i, nous cr&#233;ons ainsi un vecteur de contexte vi. &#192; chaque &#233;l&#233;ment j de vi, nous
associons le nombre de fois o&#249; j et i occurrent ensemble occij .
</p>
<p>Afin d&#8217;identifier les unit&#233;s lexicales caract&#233;ristiques des contextes lexicaux et de supprimer
l&#8217;effet induit par la fr&#233;quence des unit&#233;s lexicales, nous normalisons l&#8217;association entre les
unit&#233;s lexicales occij sur la base d&#8217;une mesure de r&#233;currence contextuelle comme Information
Mutuelle et Taux de vraisemblance (cf. &#233;quations 1 et 2 o&#249; N repr&#233;sente la taille du corpus).
Apr&#232;s normalisation, &#224; chaque &#233;l&#233;ment j du vecteur de contexte de l&#8217;unit&#233; i nous associons le
taux d&#8217;association associj.
</p>
<p>associj = log
a
</p>
<p>(a + b)(a + c)
(1)
</p>
<p>associj = a log a + b log b + c log c + d log d + N log N (a + b) log (a + b)
(a + c) log (a + c) (b + d) log (b + d) (c + d) log (c + d)
</p>
<p>(2)
</p>
<p>(avec a = occij b = occj occij c = occi occij d = N occj occi + occij )
</p>
<p>2.2.2 Transfert du vecteur de contexte de la langue source &#224; la langue cible
</p>
<p>Afin d&#8217;&#233;viter les inconv&#233;nients de la traduction directe des vecteurs de contexte avec un diction-
naire, &#224; savoir l&#8217;inad&#233;quation des ressources bilingues aux corpus et l&#8217;impossibilit&#233; de traduire
certains &#233;l&#233;ments des vecteurs de contexte, la traduction d&#8217;un vecteur de contexte est r&#233;alis&#233;e en
s&#8217;appuyant sur les vecteurs de contexte qui lui sont proches. Le dictionnaire va ainsi permettre
de &#171; traduire &#187; les vecteurs de contexte dans leur globalit&#233; et non &#233;l&#233;ment par &#233;l&#233;ment.
</p>
<p>Ainsi, pour chaque unit&#233; k &#224; traduire, nous identifions les vecteurs de contexte proches de vk,
en s&#8217;appuyant sur une mesure de distance vectorielle comme Cosinus et Jaccard (cf. &#233;quations
3 et 4). Par la suite, nous d&#233;signons par vecteur de similarit&#233; de l&#8217;unit&#233; k un vecteur dont les
&#233;l&#233;ments sont les unit&#233;s lexicales identifiant les vecteurs de contextes proches de vk. &#192; chaque
&#233;l&#233;ment l du vecteur de similarit&#233; de l&#8217;unit&#233; k, nous associons le taux de similarit&#233; similvkvl
entre vl et vk. Le dictionnaire bilingue est alors utilis&#233; pour assurer la traduction des &#233;l&#233;ments
du vecteur de similarit&#233; de l&#8217;unit&#233; &#224; traduire. Nous obtenons ainsi des vecteurs de contexte
&#233;quivalents attest&#233;s en langue cible.
</p>
<p>similvkvl =
</p>
<p>&#8721;
t assoc
</p>
<p>l
t assoc
</p>
<p>k
t&#8730;&#8721;
</p>
<p>t assoc
l
t
</p>
<p>2
assockt
</p>
<p>2
</p>
<p>(3)
</p>
<p>similvkvl =
</p>
<p>&#8721;
t min(assoc
</p>
<p>l
t, assoc
</p>
<p>k
t )&#8721;
</p>
<p>t assoc
l
t
</p>
<p>2
+
&#8721;
</p>
<p>t assoc
k
t
</p>
<p>2 &#8721;
t assoc
</p>
<p>l
t assoc
</p>
<p>k
t
</p>
<p>(4)
</p>
<p>La figure 1 est une illustration du processus de traduction sur un espace &#224; deux dimensions. La
position de l&#8217;unit&#233; &#224; traduire est d&#233;termin&#233;e par son vecteur de contexte. L&#8217;espace vectoriel r&#233;el
a un nombre de dimensions &#233;gal au nombre d&#8217;unit&#233;s diff&#233;rentes du corpus.
</p>
<p>2Nous employons ici le terme unit&#233; lexicale pour d&#233;signer un mot, un terme simple ou un terme complexe.
3Afin de diminuer le bruit et d&#8217;acc&#233;l&#233;rer le calcul des contextes lexicaux, nous supprimons du corpus les mots
</p>
<p>fonctionnels.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction de terminologies bilingues &#224; partir de corpus comparables
</p>
<p>unit&#233; &#224; traduire
</p>
<p>vecteur &#233;quivalent
</p>
<p>vecteur &#233;quivalent
vecteur &#233;quivalent
</p>
<p>vecteur moyen
</p>
<p>vecteur &#233;quivalent
</p>
<p>LANGUE CIBLELANGUE SOURCE
</p>
<p>TRADUCTION
</p>
<p>vecteur &#233;quivalent
</p>
<p>traductions candidates
</p>
<p>vecteur de contexte de l&#8217;unit&#233; &#224; traduire
</p>
<p>vecteur de contexte moyen
</p>
<p>vecteur de contexte &#233;quivalent
</p>
<p>vecteur proche
</p>
<p>vecteur proche
</p>
<p>vecteur proche
</p>
<p>vecteur de contexte proche du vecteur de contexte de l&#8217;unit&#233; &#224; traduire
</p>
<p>vecteur proche
</p>
<p>vecteur proche
</p>
<p>vecteur de contexte d&#8217;une traduction candidate
</p>
<p>Figure 1: Processus de transfert des vecteurs de contexte de la langue source &#224; la langue cible.
</p>
<p>Suivant la longueur de l&#8217;unit&#233; lexicale &#224; traduire, nous r&#233;alisons un traitement diff&#233;rent :
</p>
<p>Traduction d&#8217;une unit&#233; de longueur 1 Dans le cas o&#249; le dictionnaire bilingue propose plus-
ieurs traductions pour une unit&#233;, comme il est essentiel de prendre en compte l&#8217;ensemble
des vecteurs de contexte issus des diff&#233;rentes traductions nous en r&#233;alisons l&#8217;union. Le
vecteur de contexte r&#233;sultant est alors compos&#233; de l&#8217;ensemble des &#233;l&#233;ments des diff&#233;rents
vecteurs de contexte originaux. Si plusieurs vecteurs ont un &#233;l&#233;ment commun, alors le
taux d&#8217;association de cet &#233;l&#233;ment sera le plus grand des taux d&#8217;association des diff&#233;rents
&#233;l&#233;ments. De cette mani&#232;re, nous prenons en compte l&#8217;ensemble des traductions possibles
et pas seulement la plus courante.
</p>
<p>Traduction d&#8217;une unit&#233; de longueur strictement sup&#233;rieure &#224; 1 Si l&#8217;unit&#233; est pr&#233;sente dans
le dictionnaire, elle peut &#234;tre traduite directement. Dans le cas contraire, nous avons
adopt&#233; une approche reposant sur la traduction compositionnelle de ses composants.
Chaque composant de l&#8217;unit&#233; est traduit &#224; l&#8217;aide du dictionnaire bilingue et l&#8217;ensemble des
combinaisons relev&#233;es par ACABIT est retenu. Nous r&#233;alisons alors l&#8217;union des vecteurs
de contexte ainsi obtenus de la m&#234;me mani&#232;re que pr&#233;c&#233;demment. Si la traduction com-
positionnelle &#233;choue, l&#8217;unit&#233; n&#8217;est pas exploit&#233;e dans le processus de traduction.
</p>
<p>2.2.3 Recherche des traductions en langue cible
</p>
<p>Nous calculons en langue cible un vecteur de contexte moyen &#224; partir des diff&#233;rents vecteurs
de contexte &#233;quivalents issus de la traduction du vecteur de similarit&#233; en langue source. Ce
vecteur moyen est obtenu par le barycentre des vecteurs de contexte &#233;quivalents pond&#233;r&#233; par le
coefficient de similarit&#233; similvkvl obtenu en langue source. Ainsi, nous favorisons les unit&#233;s les
plus proches de l&#8217;unit&#233; lexicale &#224; traduire. Ce vecteur de contexte moyen est ensuite compar&#233;
&#224; l&#8217;ensemble des vecteurs de contexte de la langue cible par la mesure du Cosinus. De cette
mani&#232;re, nous obtenons une liste ordonn&#233;e de traductions candidates.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin, Samuel Dufour-Kowalski, B&#233;atrice Daille
</p>
<p>3 Description des ressources
</p>
<p>Nous pr&#233;sentons dans cette section les ressources utilis&#233;es pour nos exp&#233;rimentations, &#224; savoir
le corpus comparable, le dictionnaire bilingue et le lexique de r&#233;f&#233;rence.
</p>
<p>3.1 Corpus comparable
</p>
<p>Dans le cadre de nos exp&#233;riences, nous avons constitu&#233; un corpus comparable &#224; partir de la
revue Unasylva publi&#233; chaque trimestre en anglais, espagnol et fran&#231;ais depuis 1947 par la
FAO4. Cette revue internationale consacr&#233;e aux for&#234;ts et aux industries foresti&#232;res couvre au-
tant des aspects li&#233;s &#224; la gestion et la conservation des plantations, des for&#234;ts et des animaux,
que des aspects li&#233;s aux d&#233;veloppements socio-&#233;conomiques, au commerce international et &#224;
l&#8217;environnement. Afin d&#8217;obtenir un corpus comparable fran&#231;ais/anglais, nous avons s&#233;lectionn&#233;
les textes qui ne sont pas la traduction l&#8217;un de l&#8217;autre. Nous obtenons ainsi un corpus compara-
ble compos&#233; de 2,6 millions de mots pour le fran&#231;ais et de 2,3 millions pour l&#8217;anglais.
</p>
<p>3.2 Dictionnaire bilingue
</p>
<p>Un dictionnaire bilingue, n&#233;cessaire au processus d&#8217;alignement, a &#233;t&#233; construit &#224; partir de
ressources disponibles sur le web. Il est compos&#233; de 22 300 mots simples en fran&#231;ais avec
en moyenne 1,6 traductions par entr&#233;e. Il s&#8217;agit donc d&#8217;un dictionnaire de langue g&#233;n&#233;rale qui
ne contient que peu de termes en rapport avec le domaine de la sylviculture.
</p>
<p>3.3 Lexique de r&#233;f&#233;rence
</p>
<p>Dans cette &#233;tude, l&#8217;&#233;valuation du processus d&#8217;extraction de terminologies bilingues a &#233;t&#233; r&#233;alis&#233;e
automatiquement &#224; l&#8217;aide d&#8217;un lexique de r&#233;f&#233;rence. Celui-ci a &#233;t&#233; construit &#224; partir de trois
ressources terminologiques :
</p>
<p>1. Le glossaire bilingue de la terminologie de la sylviculture au Canada du service cana-
dien des for&#234;ts5. Celui-ci couvre les domaines usuels de la pratique de la sylviculture au
Canada. Il est compos&#233; de 700 termes sp&#233;cialis&#233;s dont 70 % sont des termes complexes.
</p>
<p>2. Le lexique multilingue du projet Eurosilvasur (plate-forme ressource for&#234;t-bois-papier
des r&#233;gions de l&#8217;Europe du Sud)6. Celui-ci couvre un ensemble de domaines li&#233;s &#224;
l&#8217;exploitation de la for&#234;t : &#233;conomie et exploitation foresti&#232;re, transformation du bois,
sylviculture, etc. Il est compos&#233; de 2 800 termes dont 66 % sont des termes complexes.
</p>
<p>3. Le thesaurus multilingue AGROVOC de la FAO7. Ce thesaurus, destin&#233; &#224; l&#8217;indexation
des donn&#233;es entrant dans les syst&#232;mes d&#8217;informations agricoles, couvre les domaine de
</p>
<p>4http://www.fao.org/forestry/foris/webview/forestry2/index.jsp?siteId=2342
5http://nfdp.ccfm.org/silviterm/silvi_f/silvitermintrof.htm
6http://www.eurosilvasur.net/francais/lexique.php
7http://www.fao.org/agrovoc/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction de terminologies bilingues &#224; partir de corpus comparables
</p>
<p>l&#8217;agriculture, de la p&#234;che, de la sylviculture, de la nutrition, de l&#8217;innocuit&#233; des produits al-
imentaires, ainsi que divers sujets connexes comme l&#8217;environnement. Il comporte 15 000
descripteurs pour le fran&#231;ais dont 47 % sont des termes complexes.
</p>
<p>Ces trois ressources terminologiques sont compl&#233;mentaires dans la mesure o&#249; elles proposent
des termes plus ou moins sp&#233;cialis&#233;s. Ainsi, le glossaire bilingue est plus sp&#233;cialis&#233; que le
lexique multilingue, qui lui-m&#234;me est plus sp&#233;cialis&#233; que le thesaurus multilingue.
</p>
<p>&#192; partir de ces ressources, nous avons s&#233;lectionn&#233; automatiquement 300 termes fran&#231;ais, o&#249;
chaque terme est au moins pr&#233;sent cinq fois dans le corpus comparable, pour constituer notre
lexique de r&#233;f&#233;rence. Ces termes se r&#233;partissent en trois sous-listes :
</p>
<p>&#8226; [liste 1] 100 termes simples fran&#231;ais dont la traduction, qui n&#8217;est pas pr&#233;sente dans notre
dictionnaire bilingue, est un terme simple.
</p>
<p>&#8226; [liste 2] 100 termes complexes fran&#231;ais dont la traduction peut &#234;tre un terme simple ou
complexe. Ces termes ne peuvent pas &#234;tre traduits directement ou de mani&#232;re composi-
tionnelle &#224; partir de notre dictionnaire bilingue.
</p>
<p>&#8226; [liste 3] 100 termes complexes fran&#231;ais dont la traduction est un terme complexe. Ces
termes ne peuvent pas &#234;tre traduits directement mais le sont de mani&#232;re compositionnelle
par leurs composants &#224; partir de notre dictionnaire bilingue.
</p>
<p>Ce lexique de r&#233;f&#233;rence est essentiellement compos&#233; de termes peu fr&#233;quents (cf. table 1). Deux
raisons majeures expliquent ce ph&#233;nom&#232;ne. D&#8217;une part, les diff&#233;rentes ressources utilis&#233;es pour
cr&#233;er le lexique de r&#233;f&#233;rence proposent des termes tr&#232;s sp&#233;cifiques ou tr&#232;s g&#233;n&#233;riques. D&#8217;autre
part, le corpus utilis&#233; couvre un grand nombre de domaines li&#233;s &#224; la foresterie, il ne constitue
pas une ressource tr&#232;s sp&#233;cialis&#233;e.
</p>
<p>NBocc. &lt; 50 NBocc. &#8804; 100 NBocc. &#8804; 1 000 NBocc. &gt; 1 000
</p>
<p>[liste 1] 50 21 18 11
[liste 2] 54 21 25 0
[liste 3] 51 18 29 2
</p>
<p>Table 1: Fr&#233;quence dans le corpus comparable des termes fran&#231;ais du lexique de r&#233;f&#233;rence
</p>
<p>4 &#201;valuation
Nous pr&#233;sentons dans cette section les r&#233;sultats de l&#8217;&#233;valuation du processus d&#8217;extraction de
terminologies bilingues pour les ressources pr&#233;c&#233;demment pr&#233;sent&#233;es.
</p>
<p>4.1 Estimation des param&#232;tres
</p>
<p>Comme nous l&#8217;avons vu en section 2, la cha&#238;ne de traitement utilis&#233;e pour l&#8217;extraction de termes
bilingues fait intervenir de nombreux param&#232;tres. En fonction de ces derniers, les r&#233;sultats vari-
ent fortement. Les r&#233;sultats les plus int&#233;ressants ont &#233;t&#233; obtenus avec les param&#232;tres suivants :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin, Samuel Dufour-Kowalski, B&#233;atrice Daille
</p>
<p>1. Taille de la fen&#234;tre contextuelle : 3 phrases.
</p>
<p>2. R&#233;duction des &#233;l&#233;ments contenus dans les vecteurs de contexte aux termes simples.
</p>
<p>3. Mesure d&#8217;association pour le calcul des vecteurs de contexte : Information Mutuelle ou
Taux de vraisemblance.
</p>
<p>4. Taille des vecteurs de contexte : 30 ou 20 &#233;l&#233;ments.
</p>
<p>5. Mesure de similarit&#233; pour le calcul des vecteurs de similarit&#233; : Cosinus ou Jaccard.
</p>
<p>6. Taille des vecteurs de similarit&#233; : 30 ou 20 &#233;l&#233;ments.
</p>
<p>4.2 Analyse des r&#233;sultats
</p>
<p>La table 2 pr&#233;sente les r&#233;sultats bruts de nos exp&#233;riences. Pour chacune de trois listes de 100
termes, nous indiquons le nombre de traductions trouv&#233;es (NBtrad), la position moyenne et
son &#233;cart type pour les traductions trouv&#233;es dans la liste ordonn&#233;e de traductions propos&#233;es
(AV Gpos, STDDEVpos).
L&#8217;analyse de ces r&#233;sultats montre que les termes complexes de la [liste 3] (qui se traduisent de
mani&#232;re compositionnelle) sont relativement bien rep&#233;r&#233;s et apparaissent le plus souvent dans
les 20 meilleurs candidats. En revanche les termes des [listes 1 et 2] sont moyennement rep&#233;r&#233;s,
mais plus encore, n&#8217;apparaissent que rarement dans les 20 premiers candidats.
</p>
<p>En dehors de l&#8217;analyse num&#233;rique de ces r&#233;sultats, il convient de pr&#233;ciser que les traductions
propos&#233;es pour un terme donn&#233; se situent le plus souvent dans le m&#234;me champ s&#233;mantique. Ce
qui d&#233;montre l&#8217;int&#233;r&#234;t de notre approche. Par exemple, les 20 premi&#232;res traductions propos&#233;es
pour le terme gaz &#224; effet de serre de fr&#233;quence 33 sont carbon, carbon cycle, atmosphere,
greenhouse gas, greenhouse, global carbon, atmospheric carbon, emission, sink, carbon diox-
ide, fossil fuel, fossil, carbon pool, mitigate, global warming, climate change, atmospheric,
dioxide, sequestration, quantity of carbon.
</p>
<p>NBtrad AV Gpos STDDEVpos
</p>
<p>[liste 1] 60 35,1 38,5
[liste 2] 65 37,5 45,9
[liste 3] 90 3,4 15,2
</p>
<p>Table 2: &#201;valuation du processus d&#8217;extraction de terminologies bilingues
</p>
<p>Comme nous l&#8217;avons indiqu&#233; pr&#233;c&#233;demment, nos r&#233;sultats varient fortement en fonction des
param&#232;tres choisis pour nos exp&#233;rimentations. Il est malheureusement assez difficile de statuer
pr&#233;cis&#233;ment sur le r&#244;le de chaque param&#232;tre en raison des temps de calculs importants et du
manque de tra&#231;abilit&#233; de la cha&#238;ne de traitement. Cependant une analyse manuelle des traduc-
tions candidates pour diff&#233;rentes configurations a permis de mettre en &#233;vidence que :
</p>
<p>&#8226; Des termes correctement traduits pour une configuration de param&#232;tres donn&#233;e ne le sont
pas forc&#233;ment dans une autre, et inversement, des termes non traduits dans la premi&#232;re</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction de terminologies bilingues &#224; partir de corpus comparables
</p>
<p>configuration peuvent &#234;tre traduits correctement dans la deuxi&#232;me. De ce fait, il est diffi-
cile de d&#233;terminer quelle est la configuration &#224; adopter. Ce ph&#233;nom&#232;ne est principalement
visible pour les [listes 1 et 2].
</p>
<p>&#8226; Plus pr&#233;cis&#233;ment, pour un terme donn&#233;, les premi&#232;res traductions candidates pour dif-
f&#233;rentes configurations de param&#232;tres sont souvent diff&#233;rentes. Par exemple, pour le terme
p&#226;te &#224; papier (paper pulp), les 50 meilleures traductions candidates d&#8217;une vingtaine de
configurations diff&#233;rentes n&#8217;ont qu&#8217;un trentaine d&#8217;&#233;l&#233;ments en commun.
</p>
<p>&#8226; Par extension, la bonne traduction d&#8217;un terme donn&#233; appara&#238;t souvent &#224; des positions tr&#232;s
diff&#233;rentes. Cette position variant en fonction des configurations.
</p>
<p>&#192; partir de ce constat et afin de capturer davantage de bonnes traductions, nous avons choisi
de prendre en compte les r&#233;sultats donn&#233;s par diff&#233;rentes configurations de param&#232;tres et non
par une seule. Pour cela, le processus de traduction est ex&#233;cut&#233; sur un ensemble de configura-
tions diff&#233;rentes et nous ne retenons que les x meilleures traductions candidates pour chacune
d&#8217;entre elles. Ces diff&#233;rents r&#233;sultats sont alors fusionn&#233;s en sommant les scores de traductions
associ&#233;s &#224; chaque candidat pour les diff&#233;rentes configurations. Ainsi, nous ne retenons que les
candidats les mieux &#171; class&#233;s &#187; sur l&#8217;ensemble des configurations. Cela permet d&#8217;am&#233;liorer
nettement la position des traductions correctes parmi l&#8217;ensemble des traductions candidates. Il
convient cependant de choisir un x qui n&#8217;est pas trop grand, par exemple 20, afin d&#8217;am&#233;liorer le
comportement et de supprimer du bruit inutile.
</p>
<p>Nous avons ainsi fusionn&#233; diff&#233;rentes configurations, en particulier en faisant varier les tailles
des vecteurs de contexte et de similarit&#233; et les mesures d&#8217;association et de similarit&#233;8.
</p>
<p>NBtrad AV Gpos STDDEVpos Top 10 Top 20
</p>
<p>[liste 1] 60 22,7 26,1 41 51
[liste 2] 65 21,3 25,0 45 55
[liste 3] 90 2,1 10,3 87 88
</p>
<p>Table 3: &#201;valuation du processus d&#8217;extraction par combinaison de param&#232;tres
</p>
<p>Les r&#233;sultats obtenus par cette m&#233;thode, pr&#233;sent&#233;s en table 3, am&#233;liorent globalement le pro-
cessus d&#8217;extraction de termes bilingues. Les r&#233;sultats obtenus pour la [liste 3] restent tr&#232;s satis-
faisants. En revanche ceux de la [liste 1], quoique meilleurs, restent inf&#233;rieurs aux r&#233;sultats
obtenus par D&#233;jean &amp; Gaussier (2002) : pour les 10 et 20 meilleurs candidats 43 % et 51 %
pour un corpus m&#233;dical de 100 000 mots et 79 % et 84 % pour un corpus de 8 millions de mots.
Cette diff&#233;rence de r&#233;sultats peut s&#8217;expliquer par notre &#233;valuation automatique du processus de
traduction qui est sans doute plus contraignante qu&#8217;une &#233;valuation humaine. Par exemple, notre
lexique de r&#233;f&#233;rence indique que la traduction du terme piste de d&#233;bardage est haulage road. Ce
terme n&#8217;est jamais pr&#233;sent dans la liste des traductions candidates. Par contre, le terme skid trail
est pr&#233;sent dans les 20 premiers candidats. M&#234;me si cette traduction nous semble acceptable,
elle n&#8217;est pas comptabilis&#233;e comme valide. Nous avons aussi d&#233;lib&#233;r&#233;ment &#244;t&#233; de nos listes de
termes simples, ceux &#233;tant d&#233;j&#224; pr&#233;sents dans le dictionnaire.
</p>
<p>8Pour des raisons de temps de calcul, nous ne faisons pas varier la taille de la fen&#234;tre contextuelle. Nous
limitons aussi les unit&#233;s contenues dans les vecteurs de contexte &#224; des termes simples, puisque nos exp&#233;riences
indiquent que cette configuration est la plus int&#233;ressante.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Emmanuel Morin, Samuel Dufour-Kowalski, B&#233;atrice Daille
</p>
<p>En ce qui concerne, les r&#233;sultats de la [liste 2], ils sont d&#8217;une qualit&#233; l&#233;g&#232;rement sup&#233;rieure &#224;
ceux de [liste 1]. Cette m&#233;thode semble donc int&#233;ressante, en particulier pour les termes dont la
traduction est non compositionnelle.
</p>
<p>5 Conclusion
</p>
<p>Nous avons propos&#233; et &#233;valu&#233; une m&#233;thode mixte pour l&#8217;extraction de termes complexes bilin-
gues prenant en compte les probl&#232;mes de fertilit&#233;, de non compositionnalit&#233; et de variation.
Cette m&#233;thode extrait d&#8217;abord les termes complexes dans chaque langue, puis les aligne &#224; l&#8217;aide
de m&#233;thodes statistiques exploitant le contexte des termes. Cette approche mixte donne des
r&#233;sultats satisfaisants comparables &#224; ceux obtenus pour les mots simples. Elle permet d&#8217;obtenir
la traduction de termes non compositionnelle. Les prochains travaux porteront sur l&#8217;examen
des groupes de termes identifi&#233;s lors de la phase d&#8217;extraction terminologique, sur le d&#233;licat
probl&#232;me de r&#233;glage des param&#232;tres et sur l&#8217;extension de la m&#233;thode &#224; d&#8217;autres langues.
</p>
<p>R&#233;f&#233;rences
BROWN P., DELLA PIETRA S., DELLA PIETRA V., MERCER R. (1993). The Mathematics of Statistical
Machine Translation: Parameter Estimation. Computational Linguistics, Vol. 19(2), 263&#8211;311.
CAO Y., LI H. (2002). Base Noun Phrase Translation Using Web Data and the EM Algorithm. In Actes,
COLING&#8217;02, p. 127&#8211;133.
</p>
<p>CARL M., LANGLAIS P. (2002). An intelligent Terminology Database as a pre-processor for Statistical
Machine Translation. In Actes, COMPUTERM&#8217;02, p. 15&#8211;21.
DAILLE B. (2003). Terminology Mining. In M. PAZIENZA, Ed., Information Extraction in the Web Era,
p. 29&#8211;44. Springer.
DAILLE B., GAUSSIER E., LANG&#201; J. (1994). Towards Automatic Extraction of Monolingual and Bilin-
gual Terminology. In Actes, COLING&#8217;94, p. 515&#8211;521.
D&#201;JEAN H., GAUSSIER E. (2002). Une nouvelle approche &#224; l&#8217;extraction de lexiques bilingues &#224; partir
de corpus comparables. Lexicometrica, Alignement lexical dans les corpus multilingues.
D&#201;JEAN H., SADAT F., GAUSSIER E. (2002). An approach based on multilingual thesauri and model
combination for bilingual lexicon extraction. In Actes, COLING&#8217;02, p. 218&#8211;224.
</p>
<p>FUNG P. (1998). A Statistical View on Bilingual Lexicon Extraction: From Parallel Corpora to Non-
parallel Corpora. In D. FARWELL, L. GERBER &amp; E. HOVY, Eds., Actes, AMTA&#8217;98, p. 1&#8211;16: Springer.
GAUSSIER E., LANG&#201; J.-M. (1995). Mod&#232;les statistiques pour l&#8217;extraction de lexiques bilingues.
Traitement automatique des langues, Vol. 36(1-2), p. 133&#8211;155.
MELAMED I. D. (2001). Empirical Methods for Exploiting Parallel Texts. MIT Press.
RAPP R. (1999). Automatic Identification of Word Translations from Unrelated English and German
Corpora. In Actes, ACL&#8217;99, p. 519&#8211;526.
VERONIS J. (2000). Parallel Text Processing. Kluwer Academic Publishers.</p>

</div></div>
</body></html>