<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>R&#233;solution automatique d&#8217;anaphores infid&#232;les en fran&#231;ais : Quelles ressources pour quels apports ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, Session Poster, F&#232;s, 19-21 avril 2004 
</p>
<p>R&#233;solution automatique d&#8217;anaphores infid&#232;les en fran&#231;ais :  
</p>
<p>Quelles ressources pour quels apports ? 
</p>
<p>Susanne Salmon-Alt  
</p>
<p>ATILF &#8211; CNRS (UMR 7118) 
</p>
<p> 44, Avenue de la Lib&#233;ration, B.P. 30687, 54063 Nancy Cedex 
</p>
<p>Susanne.Salmon-Alt@atilf.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>La performance d&#8217;une r&#233;solution automatique d&#8217;anaphores infid&#232;les pour le fran&#231;ais pourrait 
</p>
<p>atteindre une F-mesure de 30%. Ce r&#233;sultat repose toutefois sur une ressource &#233;quivalente &#224; 
</p>
<p>un bon dictionnaire de la langue fran&#231;aise, une analyse syntaxique de qualit&#233; satisfaisante et 
</p>
<p>un traitement performant des entit&#233;s nomm&#233;es. En l&#8217;absence de telles ressources, les meilleurs 
</p>
<p>r&#233;sultats plafonnent autour d&#8217;une F-mesure de 15%. 
</p>
<p> 
</p>
<p>A system for solving indirect anaphora in French seems to be able to achieve a F-measure of 
</p>
<p>30%. However, this result supposes a high quality lexical database (equivalent to a classical 
</p>
<p>dictionary), a good parser and a high precision named entity recognition. In case such 
</p>
<p>resources are not available, the best results are obtained by using simple heuristics and are 
</p>
<p>limited to a F-measure of 15%. 
</p>
<p>Mots Cl&#233;s &#8211; Keywords 
</p>
<p>anaphore infid&#232;le, ressource s&#233;mantique, r&#233;solution d&#8217;anaphore, corpus annot&#233; multiniveau  
</p>
<p> 
</p>
<p>indirect anaphor, lexical database, anaphora resolution, multi-level corpus annotation 
</p>
<p>1 Probl&#233;matique 
</p>
<p>Par anaphore &#171; infid&#232;le &#187;, nous entendons, dans la lign&#233;e de la linguistique descriptive 
</p>
<p>fran&#231;aise, un groupe nominal anaphorique (dont l&#8217;interpr&#233;tation d&#233;pend d&#8217;une expression 
</p>
<p>nominale du contexte pr&#233;c&#233;dent) et cor&#233;f&#233;rentiel (dont le r&#233;f&#233;rent est identique &#224; celui de 
</p>
<p>l&#8217;ant&#233;c&#233;dent), caract&#233;ris&#233; par une t&#234;te nominale diff&#233;rente de celle de l&#8217;ant&#233;c&#233;dent (le d&#233;ficit 
</p>
<p>en pluie &#8211; la s&#233;cheresse). Ces reprises partagent la cor&#233;f&#233;rentialit&#233; avec d&#8217;autres types 
</p>
<p>d&#8217;anaphores (pronominales, nominales &#171; fid&#232;les &#187;), mais leur compr&#233;hension s&#8217;appuie sur des 
</p>
<p>connaissances s&#233;mantiques et pragmatiques au-del&#224; des m&#233;canismes mis en jeu lors de 
</p>
<p>l&#8217;interpr&#233;tation des pronoms personnels et reprises directes. S&#8217;il a &#233;t&#233; montr&#233; pour diff&#233;rentes 
</p>
<p>langues (anglais, portugais, fran&#231;ais) que les d&#233;finis en anaphore infid&#232;le fournissent en 
</p>
<p>moyenne 25 &#224; 50% des descriptions d&#233;finies cor&#233;f&#233;rentielles (Poesio et Vieira, 1998 ; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Susanne Salmon-Alt 
</p>
<p>Salmon-Alt et Vieira, 2002), au maximum un tiers parmi eux peuvent &#234;tre r&#233;solus (Poesio et 
</p>
<p>al., 2002), m&#234;me dans les meilleures configurations s&#8217;appuyant sur les ressources et outils &#224; la 
</p>
<p>fois accessibles et correspondant &#224; l&#8217;&#233;tat de l&#8217;art anglo-saxon. L&#8217;objectif de ce travail est 
</p>
<p>d&#8217;&#233;valuer les performances que l&#8217;on peut obtenir pour la r&#233;solution automatique des 
</p>
<p>anaphores infid&#232;les en comparant trois types des ressources s&#233;mantiques diff&#233;rentes. 
</p>
<p>2 Corpus de test 
</p>
<p>Les exp&#233;riences ont &#233;t&#233; conduites sur un extrait du corpus Le Monde (~ 9000 mots, 276 
</p>
<p>phrases). En pr&#233;paration l&#8217;annotation manuelle des anaphores, ce corpus a &#233;t&#233; &#233;tiquet&#233; et 
</p>
<p>normalis&#233; au niveau structurel, morphologique (Schmid, 1994) et syntaxique (Bick, 2003). Du 
</p>
<p>corpus r&#233;sultant ont &#233;t&#233; extraits automatiquement les ant&#233;c&#233;dents potentiels (tous les groupes 
</p>
<p>nominaux : 1924) et les anaphoriques potentiels (groupes nominaux d&#233;finies : 741).  
</p>
<p>Les 741 groupes nominaux d&#233;finis restants ont &#233;t&#233; soumis, par l&#8217;interm&#233;diaire d&#8217;un outil &#224; 
</p>
<p>interface graphique (M&#252;ller et Strube, 2001) &#224; deux annotateurs pour l&#8217;annotation des 
</p>
<p>relations cor&#233;f&#233;rentielles. Sur le total des d&#233;finis en entr&#233;e, respectivement 256 et 247 ont &#233;t&#233; 
</p>
<p>consid&#233;r&#233;s comme cor&#233;f&#233;rentiels. Ce taux (autour de 30%) est comparable &#224; celui de travaux 
</p>
<p>ant&#233;rieurs (Poesio et Vieira, 1998 ; Salmon-Alt et Vieira, 2002). En revanche, la r&#233;partition 
</p>
<p>entre reprises fid&#232;les vs. infid&#232;les variait de 23 points entre les deux annotateurs. En raison de 
</p>
<p>cette disparit&#233; importante, nous avons d&#233;cid&#233; de retenir uniquement l&#8217;intersection des 
</p>
<p>descriptions d&#233;finies infid&#232;les, soit 78 descriptions d&#233;finies. Ce nombre, bien que ne 
</p>
<p>repr&#233;sentant plus 10,5% des 741 d&#233;finis en entr&#233;e, constitue donc un noyau s&#251;r de 
</p>
<p>descriptions d&#233;finies &#224; reprise cor&#233;f&#233;rentielle infid&#232;le : 85,9% se sont d&#8217;ailleurs vu attribuer le 
</p>
<p>m&#234;me ant&#233;c&#233;dent par les deux annotateurs. Le Tableau 1 propose une synth&#232;se des principales 
</p>
<p>caract&#233;ristiques des anaphores retenues : une part importante d&#8217;ant&#233;c&#233;dents sous forme de 
</p>
<p>noms propres (plus d&#8217;un tiers), l&#8217;absence de r&#233;gularit&#233; sur l&#8217;accord en nombre et genre entre 
</p>
<p>ant&#233;c&#233;dent et reprise et une distance entre ant&#233;c&#233;dent et anaphore variant entre 0 et 27 
</p>
<p>phrases. 
</p>
<p> 
</p>
<p>t&#234;te de l&#8217;ant&#233;c&#233;dent accord distance phrastique 
annotateur 
</p>
<p>nom commun nom propre autre nombre genre minimale maximale 
</p>
<p>A1 55,1 % (43) 37,2 % (29) 7,7 % (6) 57,7 % (45) 34,6 % (27) 0 17 
</p>
<p>A2 53,8 % (42) 39,7 % (31) 6,4 % (5) 57,7 % (45) 30,8 % (24) 0 27 
</p>
<p>Tableau 1 : Caract&#233;ristique des couples ant&#233;c&#233;dent &#8211; anaphore infid&#232;le 
</p>
<p>3 Ressources : Pr&#233;sentation et rendement en situation hors bruit 
</p>
<p>Ensuite, nous avons test&#233; l&#8217;utilit&#233; de trois types de ressources lexicales pour la r&#233;solution 
</p>
<p>automatique des anaphores infid&#232;les en calculant le nombre de paires ant&#233;c&#233;dent &#8211; anaphore 
</p>
<p>figurant dans au moins un des lexiques. Men&#233;e hors contexte applicatif (donc hors bruit), 
</p>
<p>cette exp&#233;rience nous a permis d&#8217;&#233;valuer le plafond du rappel et de fixer les valeurs limites 
</p>
<p>des param&#232;tres en entr&#233;e du r&#233;solveur. 
</p>
<p>La premi&#232;re des ressources test&#233;es est une ressource acquise de fa&#231;on automatique &#224; partir 
</p>
<p>d&#8217;un corpus analys&#233; syntaxiquement. Il s&#8217;agit d&#8217;une liste dite de &#171; similarit&#233; s&#233;mantique &#187;, 
</p>
<p>obtenue par des techniques bas&#233;es sur des propri&#233;t&#233;s distributionnelles d&#8217;unit&#233;s linguistiques 
</p>
<p>en corpus (Grefenstette, 1994 ;  Gasperin et al., 2001). En appliquant cette m&#233;thode sur un 
</p>
<p>extrait de 90.000 mots du corpus Le Monde (comprenant les corpus de test), nous avons </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution automatique d&#8217;anaphores infid&#232;les en fran&#231;ais 
</p>
<p>obtenu 572 entr&#233;es avec 3322 termes proches (moyenne de 5,8 par entr&#233;e). Le deuxi&#232;me 
</p>
<p>lexique a &#233;t&#233; produit &#224; partir du EuroWordNet fran&#231;ais dont nous avons extrait 7856 synsets 
</p>
<p>comprenant en moyenne 2,3 termes. La troisi&#232;me ressource est issue d&#8217;un dictionnaire 
</p>
<p>&#171; classique &#187;. Il s&#8217;agit d&#8217;une liste des synonymes extraits manuellement du Grand Robert 
</p>
<p>donnant 32.484 entr&#233;es avec une moyenne de 4,7 synonymes par entr&#233;e. 
</p>
<p>Le rendement de ces ressources a &#233;t&#233; test&#233; sur les 78 paires ant&#233;c&#233;dent-reprise. L&#8217;entr&#233;e 
</p>
<p>&#233;tait fournie par les t&#234;tes non fl&#233;chies de l&#8217;ant&#233;c&#233;dent (TA) de la reprise (TR). Dans 11 cas, TR 
</p>
<p>&#233;tait ambigu entre deux expressions, puisque les deux annotateurs avaient choisi des 
</p>
<p>ant&#233;c&#233;dents diff&#233;rents, comme dans les peines reprenant, pour un annotateur, sa 
</p>
<p>condamnation &#224; quatre ans de camp de travail et pour l&#8217;autre quatre ans de camp de travail, 
</p>
<p>avec TA1 = condamnation, TA2 = an et TR = peine. Pour chaque paire (TA,TR) ainsi que les listes 
</p>
<p>de synonymes associ&#233;s &#224; la t&#234;te de l&#8217;ant&#233;c&#233;dent STA et celle de l&#8217;anaphore STR, nous avons 
</p>
<p>consid&#233;r&#233; que la ressource aide &#224; la r&#233;solution de l&#8217;anaphore si et seulement si : TA &#143; STR  ou 
TR &#143; STA  ou  TA &#143; SX  &#10; TR . 
 
</p>
<p>Ressource SimLists WordNet Robert Cumul ressources 
</p>
<p>SimLists 2 0 3 5 
</p>
<p>WordNet 0 0 2 + 2 
</p>
<p>Robert 3 2 8 + 8 
</p>
<p>Total ressources 5 2 13 15 
</p>
<p>% (avec NP) 6,4 2,5 16,7 19,2 
</p>
<p>% (sans NP) 8,5 4,3 27,7 29,8 
</p>
<p>Tableau 2 : Rendement des ressources 
</p>
<p>T&#234;te de l&#8217;ant&#233;c&#233;dent Accord Distance phrastique 
Ressource 
</p>
<p>nom commun nom propre adjectif nombre genre minimale maximale 
</p>
<p>SimLists 80 % 20 % 0 % 100 % 80 % 0 3 
</p>
<p>WordNet 100 % 0 % 0 % 100 % 50 % 0 3 
</p>
<p>Robert 92,3% 0 % 7,7 % 92,3 % 46,2 % 0 5 
</p>
<p>Tableau 3 : Caract&#233;ristiques des couples ant&#233;c&#233;dent &#8211; anaphore infid&#232;le pr&#233;sent dans les ressources 
</p>
<p>Les r&#233;sultats, pour chacune des ressources isol&#233;es, les ressources crois&#233;es et les ressources 
</p>
<p>cumul&#233;es, sont donn&#233;s dans le Tableau 2. Il appara&#238;t que l&#8217;ensemble des ressources ne 
</p>
<p>contient que 15 des paires recherch&#233;es, soit un rappel plafonn&#233; &#224; 19,2% avec et &#224; 29,8% sans 
</p>
<p>les ant&#233;c&#233;dents sous forme de noms propres, l&#8217;apport de EuroWordNet &#233;tant enti&#232;rement 
</p>
<p>neutralis&#233; par le Robert. En vue de la d&#233;termination des param&#232;tres du calcul automatique, 
</p>
<p>nous avons analys&#233; certaines propri&#233;t&#233;s linguistiques (accord en nombre et genre, distance 
</p>
<p>phrastique, nature de la t&#234;te de l&#8217;ant&#233;c&#233;dent) des cas couverts (Tableau 3).  
</p>
<p>4 Rendement des ressources en r&#233;solution automatique 
</p>
<p>4.1 Strat&#233;gie et param&#232;tres 
</p>
<p>Afin d&#8217;&#233;valuer l&#8217;apport des diff&#233;rentes ressources lexicales pour la r&#233;solution d&#8217;anaphores 
</p>
<p>nominales infid&#232;les en situation r&#233;elle (contrairement &#224; une situation hors bruit telle que 
</p>
<p>suppos&#233;e dans la section 3), nous avons impl&#233;ment&#233; un syst&#232;me de r&#233;solution automatique. Il 
</p>
<p>prend en entr&#233;e les descriptions d&#233;finies classifi&#233;es comme anaphores infid&#232;les par les deux 
</p>
<p>annotateurs ainsi que des connaissances associ&#233;es (identifiants de la phrase et de l&#8217;article </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Susanne Salmon-Alt 
</p>
<p>&#171; h&#244;te &#187;, fonction syntaxique, t&#234;te du groupe syntaxique, d&#233;terminant, nombre, genre). La 
</p>
<p>strat&#233;gie de r&#233;solution consiste &#224; chercher, pour chacune d&#8217;entre elles, un ant&#233;c&#233;dent 
</p>
<p>correspondant &#224; la premi&#232;re expression en amont remplissant un certain nombre de 
</p>
<p>contraintes, d&#233;finies en fonction des caract&#233;ristiques mises en lumi&#232;re dans le Tableau 3 :  
</p>
<p>L&#8217;imposition d&#8217;un accord en genre entre ant&#233;c&#233;dent et anaphore semble peu ad&#233;quate 
</p>
<p>(mois que 50% pour les paires trouv&#233;es dans le Robert). En contrepartie, l&#8217;effet d&#8217;un accord 
</p>
<p>en nombre AN  pourrait s&#8217;av&#233;rer int&#233;ressant pour augmenter la pr&#233;cision et fera l&#8217;objet de 
</p>
<p>variation syst&#233;matique. Dans tous les cas, la fen&#234;tre de recherche pour l&#8217;ant&#233;c&#233;dent peut &#234;tre 
</p>
<p>limit&#233;e &#224; cinq phrases en amont. Sachant par ailleurs que 93,3% des ant&#233;c&#233;dents se trouvent &#224; 
</p>
<p>une distance phrastique inf&#233;rieure &#224; quatre phrases et que seulement 6,6% se trouvent dans la 
</p>
<p>m&#234;me phrase, on fera varier les contours de cette fen&#234;tre afin de trouver le meilleur rapport 
</p>
<p>entre rappel et pr&#233;cision : Wmax= {S-5, S-3} ; Wmin = {S-0, S-1}. Enfin, la nature de la t&#234;te de 
</p>
<p>l&#8217;ant&#233;c&#233;dent peut &#234;tre restreinte &#224; un nom commun, un nom propre ou un adjectif. Toutefois, 
</p>
<p>les reprises de noms propres pourraient &#234;tre trait&#233;es plus avantageusement par des outils de 
</p>
<p>reconnaissance d&#8217;entit&#233;s nomm&#233;es, atteignant un taux de reconnaissance sup&#233;rieur &#224; 90%. 
</p>
<p>(Fourour, 2002). Au vu de la quasi-absence de nom propres dans les ressources, ces cas 
</p>
<p>risquent fort de p&#233;naliser la pr&#233;cision. Pour cette raison, nous ferons &#233;galement varier les 
</p>
<p>contraintes sur la nature de la t&#234;te de l&#8217;ant&#233;c&#233;dent (TA  = +/-nom propre). 
</p>
<p>Pour toutes les combinaisons de ces param&#232;tres, les sorties du syst&#232;me ont &#233;t&#233; &#233;valu&#233;es 
</p>
<p>dans 4 configurations de ressources lexicales (RL) &#8211; absence de ressource (0), liste de 
</p>
<p>similarit&#233; (S), EuroWordNet (WN), Robert (R) &#8211; par le calcul du rappel, de la pr&#233;cision et de 
</p>
<p>la F-mesure.  
</p>
<p>4.2 R&#233;sultats 
</p>
<p>Le point de comparaison pour &#233;valuer l&#8217;utilit&#233; des ressources lexicales est l&#8217;application 
</p>
<p>des heuristiques sans prise en compte des lexiques. Nous avons donc retenu comme r&#233;ponse 
</p>
<p>le premier groupe nominal remplissant toutes les contraintes sp&#233;cifi&#233;es en 4.1. Le  tableau 4 
</p>
<p>montre que les meilleurs r&#233;sultats &#16; 15% &#224; 20% &#16; s&#8217;obtiennent en imposant l&#8217;accord en 
nombre. Par ailleurs, l&#8217;espace de recherche peut &#234;tre r&#233;duit aux trois phrases pr&#233;c&#233;dentes pour 
</p>
<p>un gain en temps de calcul. 
</p>
<p>L&#8217;apport des listes de similarit&#233; a &#233;t&#233; test&#233; dans les m&#234;mes circonstances, en r&#233;duisant les 
</p>
<p>r&#233;ponses aux groupes pour lesquels les t&#234;tes (TA,TR) remplissant les contraintes introduites 
</p>
<p>dans la section 3. Comme le montre le Tableau 4, on constate, m&#234;me pour les meilleurs 
</p>
<p>r&#233;sultats, une baisse de performance de plus de 10 points par rapport &#224; la configuration de 
</p>
<p>base. Cette baisse s&#8217;explique &#224; la fois par un rappel inf&#233;rieur (le syst&#232;me trouve moins de 
</p>
<p>bonnes r&#233;ponses) et une pr&#233;cision inf&#233;rieure (la part des fausses r&#233;ponses augmente). 
</p>
<p>L&#8217;inclusion des anaphores ayant des noms propres comme ant&#233;c&#233;dents creuse encore cet 
</p>
<p>&#233;cart. Si les r&#233;sultats doivent &#234;tre interpr&#233;t&#233;s prudemment en raison des faibles effectifs, ils 
</p>
<p>remettent tout de m&#234;me en question l&#8217;acquisition automatique de listes de similarit&#233; 
</p>
<p>s&#233;mantique pour la r&#233;solution anaphorique : en l&#8217;absence de ressources syntaxiques 
</p>
<p>disponibles et d&#8217;une taille largement sup&#233;rieure &#224; la taille des corpus utilis&#233;s ici, cette solution 
</p>
<p>pr&#233;sente un d&#233;s&#233;quilibre important entre efforts (pr&#233;paration des corpus, annotation 
</p>
<p>syntaxique, transfert de formats, impl&#233;mentation des calculs de similarit&#233;) et effets (r&#233;sultats 
</p>
<p>largement moins bons que sans ressources). 
</p>
<p>Les r&#233;sultats des m&#234;mes exp&#233;riences conduites sur la base de EuroWordNet 
</p>
<p>montrent qu&#8217;il n&#8217;y a pas de changement en ce qui concerne le taux de rappel tr&#232;s bas. En 
</p>
<p>revanche, la F-mesure est l&#233;g&#232;rement sup&#233;rieure, et ceci en raison d&#8217;une pr&#233;cision &#233;lev&#233;e. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution automatique d&#8217;anaphores infid&#232;les en fran&#231;ais 
</p>
<p>Notons toutefois que cette pr&#233;cision est essentiellement due &#224; la couverture insuffisante de la 
</p>
<p>ressource. Le principal constat reste donc une perte de performance de 10 points par rapport 
</p>
<p>aux heuristiques sans ressources. 
</p>
<p> 
</p>
<p> 
</p>
<p>+ noms propres - noms propres 
RL AN Wmin Wmax 
</p>
<p>R  P  F R P F 
</p>
<p>non 0 5/3 0,077 0,106 
</p>
<p>non 1 5/3 0,090 0,106 
</p>
<p>oui 0 5/3 0,141 0,191 
</p>
<p>0 
</p>
<p> 
</p>
<p>oui 1 5/3 0,141 0,149 
</p>
<p>non 0/1 5/3 0,013 0,033 0,019 0,021 0,063 0,032
</p>
<p>oui 0 5 0,013 0,038 0,019 0,021 0,083 0,034
</p>
<p>oui 1 5 0,026 0,077 0,038 0,043 0,167 0,068
</p>
<p>oui 0 3 0,013 0,048 0,020 0,021 0,091 0,034
</p>
<p>S 
</p>
<p>oui 1 3 0,026 0,010 0,040 0,043 0,182 0,069
</p>
<p>non 0 5/3 0,026 0,050 0,049 0,043 0,500 0,078
</p>
<p>non 1 5/3 0,013 0,050 0,025 0,013 0,500 0,041
</p>
<p>oui 0 5/3 0,026 0,666 0,049 0,043 0 ,666 0,080
WN 
</p>
<p>oui 1 5/3 0,013 1,000 0,025 0,021 1,000 0,042
</p>
<p>non 0 5 0,128 0,263 0,172 0,213 0,385 0,274
</p>
<p>non 1 5 0,115 0,243 0,157 0,191 0,360 0,250
</p>
<p>non 0 3 0,115 0,281 0,167 0,191 0,409 0,261
</p>
<p>non 1 3 0,103 0,258 0,147 0,170 0,381 0,235
</p>
<p>oui 0 5 0,128 0,333 0,185 0,213 0,500 0,299
</p>
<p>oui 1 5 0,115 0,310 0,168 0,191 0,474 0,273
</p>
<p>oui 0 3 0,115 0,391 0,178 0,191 0,563 0,286
</p>
<p>R 
</p>
<p>oui 1 3 0,103 0,364 0,160 0,170 0,533 0,258
</p>
<p>Tableau 4 : F-mesure pour la r&#233;solution d&#8217;anaphores infid&#232;les selon diff&#233;rentes ressources lexicales 
</p>
<p>De fa&#231;on peu surprenante, l&#8217;utilisation des synonymes du Robert permet d&#8217;obtenir des 
</p>
<p>r&#233;sultats plus int&#233;ressants : dans la meilleure configuration (accord en nombre, mais fen&#234;tre 
</p>
<p>de recherche large), l&#8217;am&#233;lioration par rapport &#224; la strat&#233;gie de base varie de 5 &#224; 10 points. 
</p>
<p>Elle est essentiellement due &#224; une meilleure pr&#233;cision (forte diminution des fausses r&#233;ponses), 
</p>
<p>allant jusqu&#8217;&#224; une bonne r&#233;ponse sur deux. Par ailleurs, l&#8217;am&#233;lioration est plus importante 
</p>
<p>pour la version excluant les noms propres ce qui est coh&#233;rent puisque ce type d&#8217;information 
</p>
<p>n&#8217;y figure pas. Le taux de succ&#232;s reste n&#233;anmoins int&#233;ressant pour la version avec noms 
</p>
<p>propres (+ 4 points). C&#8217;est un point important car le filtrage a priori des anaphores ayant des 
</p>
<p>noms propres comme ant&#233;c&#233;dents demande des outils suppl&#233;mentaires pour la reconnaissance 
</p>
<p>des entit&#233;s nomm&#233;es et n&#8217;est pas enti&#232;rement automatisable. 
</p>
<p>La meilleure performance globale du syst&#232;me (F-mesure de 0.319) s&#8217;obtient par une 
</p>
<p>configuration en cascade : utilisation du Robert (fen&#234;tre phrastique 0 &#224; 5), puis des listes de 
</p>
<p>similarit&#233; (fen&#234;tre phrastique 1 &#224; 3), puis des heuristiques de r&#233;cence (fen&#234;tre phrastique 0 &#224; 
</p>
<p>3), le tout en excluant les noms propres et en imposant un accord en genre. Ce r&#233;sultat se 
</p>
<p>rapproche de ceux obtenus pour l&#8217;anglais  par Poesio et al. (2002) en combinant un thesaurus 
</p>
<p>acquis sur grand corpus avec WordNet 1.6. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Susanne Salmon-Alt 
</p>
<p>                                                
</p>
<p>5 Discussion 
</p>
<p>Au final, seuls les synonymes extraits du Grand Robert, c&#8217;est-&#224;-dire d&#8217;une ressource 
</p>
<p>lexicographique g&#233;n&#233;rale, con&#231;ue par et pour des humains, apportent un gain de performance 
</p>
<p>significatif pour la r&#233;solution automatique des anaphores infid&#232;les en fran&#231;ais. En l&#8217;absence 
</p>
<p>de ressources de qualit&#233; et couverture comparables, la meilleure strat&#233;gie reste encore la plus 
</p>
<p>simple : l&#8217;association du principe de r&#233;cence &#224; des contraintes morpho-syntaxiques 
</p>
<p>&#233;l&#233;mentaires permet d&#8217;obtenir une F-mesure de l&#8217;ordre de 0,15%. L&#8217;absence de publications 
</p>
<p>sur la m&#234;me t&#226;che
1
 ne nous permet pas de confronter ce taux &#224; d&#8217;autres exp&#233;riences sur le 
</p>
<p>fran&#231;ais. N&#233;anmoins, l&#8217;&#233;cart de seulement 8 points entre notre meilleur rappel (ressources en 
</p>
<p>cascade) et celui obtenu par Poesio et al. (2002) pour l&#8217;anglais peut &#234;tre consid&#233;r&#233; comme 
</p>
<p>encourageant. Toujours est-il que ce taux est pour l&#8217;instant largement insuffisant pour des 
</p>
<p>applications en grandeur r&#233;elle et souligne la distance &#224; parcourir pour rendre vraiment 
</p>
<p>op&#233;rationnels des travaux sur l&#8217;interpr&#233;tation et la g&#233;n&#233;ration automatique d&#8217;expressions 
</p>
<p>r&#233;f&#233;rentielles, supposant en g&#233;n&#233;ral l&#8217;existence de ressources s&#233;mantiques de bonne qualit&#233; 
</p>
<p>sur lesquelles viennent se greffer des m&#233;canismes d&#8217;inf&#233;rence &#233;labor&#233;s (Danlos, 1999 ; 
</p>
<p>Salmon-Alt, 2001). Ce constat devra donc encourager &#224; explorer diff&#233;rentes pistes : 
</p>
<p>reconnaissance des entit&#233;s nomm&#233;es, prise en compte d&#8217;autres relations s&#233;mantiques, prise en 
</p>
<p>compte non seulement de la t&#234;te, mais des modifieurs des groupes nominaux et int&#233;gration 
</p>
<p>d&#8217;une analyse morphologique d&#233;rivationnelle. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BICK E. (2003). A CG &amp; PSG Hybrid Approach to Automatic Corpus Annotation. In: Kiril Simow &amp; Petya 
</p>
<p>Osenova: Proc. of SProLaC2003, pp. 1-12. Corpus Linguistics 2003, Lancaster. 
</p>
<p>DANLOS L. (1999). Event Coreference between two sentences. Proc. of International Workshop on 
</p>
<p>Computational Semantics. Tildburg. 
</p>
<p>FOUROUR N. (2002). N&#233;m&#233;sis, un syst&#232;me de reconnaissance incr&#233;mentielle d&#8217;entit&#233;s nomm&#233;es pour le 
</p>
<p>fran&#231;ais. Actes TALN 2002, Nancy. 
</p>
<p>GASPERIN C., GAMALLO P.,  AGUSTINI A.,  LOPES G.,  LIMA V. (2001). Using syntactic contexts for 
</p>
<p>measuring word similarity. Proc. of the Workshop on Semantic Knowledge Acquisition and Categorisation. 
</p>
<p>ESSLLI 2001, Helsinki, Finland. 
</p>
<p>GREFENSTETTE G. (1994). Explorations in Automatic Thesaurus Discovery. Kluwer Academic Publishers, 
</p>
<p>USA. 
</p>
<p>M&#220;LLER C., STRUBE M. (2001). MMAX: A Tool for the Annotation of Multi-modal Corpora. Proc. of the 
</p>
<p>2nd IJCAI Workshop on Knowledge and Reasoning in Practical Dialogue Systems. Seattle, Wash., 45-50. 
</p>
<p>POESIO M., ISHIKAWA T., SCHULTE IM WALDE S., VIEIRA R. (2002). Aquiring Lexical Knowledge for 
</p>
<p>Anaphora Resolution. Proc. of LREC 2002. Las Palmas, Spain. 
</p>
<p>POESIO M., VIEIRA R. (1998). A corpus-based investigation of definite description use. Computational 
</p>
<p>Linguistics, 24, n&#176; 2. 
</p>
<p>POPESCU-BELIS A. (1999). Mod&#233;lisation multi-agent des &#233;changes langagiers : application au probl&#232;me 
</p>
<p>de la r&#233;f&#233;rence et son &#233;valuation. Th&#232;se d'universit&#233;, Universit&#233; de Paris XI (Paris-Sud). 
</p>
<p>SALMON-ALT S. (2001). Reference Resolution within the Framework of Cognitive Grammar. Proc. of 
</p>
<p>International Colloquium on Cognitive Science. San Sebastian, Spain, May 2001. 
</p>
<p>SALMON-ALT S., VIEIRA R. (2002). Nominal expressions in multilingual corpora : definites and 
</p>
<p>demonstratives. Proc. of LREC 2002. Las Palmas, Spain. 
</p>
<p>SCHMID H. (1994). Probabilistic Part-of-Speech Tagging Using Decision Trees. In Proc. of International 
</p>
<p>Conference on New Methods in Language Processing. September 1994. Manchester, UK. 
</p>
<p> 
1
 Le seul syst&#232;me de r&#233;solution d&#8217;anaphores nominales du fran&#231;ais &#233;valu&#233; finement est celui de Popescu-Belis 
</p>
<p>(1999). Toutefois, il n&#8217;y a pas d&#8217;&#233;valuation consacr&#233;e exclusivement aux reprises infid&#232;les. </p>

</div></div>
</body></html>