<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Temporalit&#233; linguistique et S-Langages</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, Session Poster, F&#232;s, 19-21 avril 2004 
</p>
<p>Temporalit&#233; linguistique et S-Langages 
</p>
<p>Delphine Battistelli, Jean-Luc Minel, Etienne Picard et Sylviane R. Schwer 
</p>
<p>Laboratoire LaLICC UMR 8139 (Universit&#233; Paris IV, CNRS) 
96, bd Raspail, 75006 Paris -France 
Pr&#233;nom.Nom@paris4.sorbonne.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Apr&#232;s un rappel de la probl&#233;matique de l&#8217;ordonnancement temporel dans un texte, nous 
d&#233;crivons les S-langages qui offrent une repr&#233;sentation unifi&#233;e des relations temporelles et 
une op&#233;ration (la jointure) permettant de calculer les combinaisons entre celles-ci.  
</p>
<p>After a brief overview of the problem of text temporal structures calculus, we describe the 
formal language of S-languages. This framework offers an unified representation of temporal 
relations and an operation (the joint) which computes combinations between such relations. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
</p>
<p>Structure(s) temporelle(s) dans un texte narratif, S-langages. 
Narratives temporal structure(s), S-langages. 
</p>
<p>1 Introduction 
</p>
<p>Notre travail se situe en aval de l&#8217;analyse aspecto-temporelle d&#8217;un texte effectu&#233;e par un 
linguiste, c&#8217;est-&#224;-dire que nous avons &#224; notre disposition l&#8217;expression d&#8217;un ensemble de 
relations temporelles entre proc&#232;s dans une th&#233;orie linguistique donn&#233;e &#8211; dans le cadre des 
intervalles topologiques de Descl&#233;s (1989), de la DRT de Kamp (1981) ou encore du syst&#232;me 
d&#8217;intervalles de Gosselin (1996) &#8211; permettant la d&#233;finition de l&#8217;extension temporelle des 
proc&#232;s comme cha&#238;nes de points et/ou d&#8217;intervalles. Notant que pour la plupart de ces 
mod&#232;les, ces relations sont tr&#232;s souvent binaires et que les descriptions sont souvent 
incompl&#232;tes (au sens o&#249; plusieurs configurations temporelles peuvent par exemple &#234;tre 
associ&#233;es &#224; une description donn&#233;e), nous nous assignons les deux objectifs suivants : 
(i) situer les proc&#232;s globalement les uns par rapport aux autres ; (ii) expliciter toutes les 
relations potentielles entre proc&#232;s. Nous rappelons dans la section 2 les principaux aspects de 
la probl&#233;matique linguistique et nous d&#233;crivons dans la section 3 le formalisme des S-
langages qui permet de prendre en charge certaines caract&#233;ristiques de la probl&#233;matique 
linguistique.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Battistelli, Etienne Picard, Jean-Luc Minel et Sylviane Schwer 
</p>
<p>2 Contraintes linguistiques et ordonnancement temporel 
</p>
<p>Les travaux linguistiques dans le domaine de la temporalit&#233;1 se concentrent sur la mise en 
&#233;vidence des modes d&#8217;expression du temps, sur l&#8217;analyse de leurs modes d&#8217;interaction et sur la 
recherche des principes (ou contraintes) d&#8217;organisation temporelle des proc&#232;s dans un texte. 
Ces travaux mettent alors en exergue le r&#244;le des connecteurs ou adverbes temporels mais aussi 
celui des valeurs aspectuelles attach&#233;es aux propositions que l&#8217;on cherche &#224; relier 
temporellement. Sans recourir &#224; la terminologie propre &#224; tel ou tel mod&#232;le linguistique, nous 
illustrons les principaux aspects de la probl&#233;matique de l&#8217;ordonnancement temporel &#224; travers 
les exemples (1) &#224; (5). 
</p>
<p>(1) Zo&#233; est partie (P1). F&#233;lix est arriv&#233; (P2). 
(2) F&#233;lix est arriv&#233; (P1) apr&#232;s que Zo&#233; est partie (P2). 
(3) F&#233;lix est arriv&#233; (P1). Zo&#233; &#233;tait partie (P2). 
(4) F&#233;lix est arriv&#233; (P1). Zo&#233; partait (P2). 
(5) Etant arr&#234;t&#233; sur la file droite (P1), j&#8217;avais mis mon clignotant (P2). 
</p>
<p>Dans l&#8217;exemple (1), l&#8217;ordre temporel entre les propositions P1 et P2 correspond &#224; leur ordre 
lin&#233;aire : on a ainsi Sit1&#1;Sit2, Sit1 et Sit2 &#233;tant les situations d&#233;not&#233;es respectivement par P1 
et P2 et &#8216;&#1;&#8217; la relation temporelle de pr&#233;c&#233;dence. S'il arrive qu'il y ait comme ici 
isomorphisme exact entre les deux structures (la structure du r&#233;f&#233;rentiel narratif et la structure 
chronologique du r&#233;f&#233;rentiel externe), c'est cependant loin d'&#234;tre toujours le cas, qu'il s'agisse 
par exemple de retours en arri&#232;re ou bien de relations de recouvrement partiel ou total entre 
situations. Ainsi, dans les exemples (2) et (3), c&#8217;est l&#8217;ordre temporel Sit2&#1;Sit1 qui pr&#233;vaut : 
dans (2), il est impos&#233; par la marque explicite &#171; apr&#232;s que &#187; ; dans (3), il d&#233;coule de 
l&#8217;utilisation du pass&#233;-compos&#233; pour P1 et du plus-que-parfait pour P2. Dans (4) et (5), on a 
Sit2 qui recouvre temporellement Sit1, ce qui est initi&#233; par le contraste aspectuel entre le pass&#233; 
compos&#233; et l&#8217;imparfait pour (4) et entre le participe pass&#233; et le plus que parfait pour (5). 
</p>
<p>A l&#8217;instar de Descl&#233;s (et al.1994), Gosselin (1996) ou encore (Vet 1994), nous nous situons 
dans une approche cherchant r&#233;solument &#224; mettre &#224; jour le plus possible de contraintes 
marqu&#233;es linguistiquement pour l&#8217;interpr&#233;tation des relations temporelles2 et nous attirons 
l&#8217;attention sur deux points : (i) ce ne sont pas les temps verbaux qui instruisent directement 
l&#8217;ordonnancement temporel des situations d&#233;not&#233;es par les propositions mais les valeurs 
aspecto-temporelles de ces propositions ; (ii) la position qui consiste &#224; consid&#233;rer que des 
s&#233;quences narratives comme (1), (3), (4) et (5) ne contiennent pas d&#8217;indices explicites 
d&#8217;ordonnancement temporel est discutable : on peut en effet consid&#233;rer que les temps verbaux 
&#224; eux seuls constituent des marqueurs d&#8217;ordonnancement temporel, relativement bien s&#251;r au 
</p>
<p>                                                 
</p>
<p>1  Vue l&#8217;&#233;tendue des travaux dans ce domaine, il est impossible de couvrir de mani&#232;re exhaustive les r&#233;f&#233;rences 
possibles. Nous nous contenterons ici de renvoyer principalement &#224; Descl&#233;s (1989), Gosselin (1996) et Kamp 
(1981) pour des travaux sur le fran&#231;ais. 
</p>
<p>2   En tenant compte en particulier de la s&#233;mantique lexicale des verbes, de l&#8217;organisation th&#233;matique du texte 
(Vet 1994) ou encore des marques de ponctuation. Certains auteurs travaillant dans le cadre de la DRT (Kamp 
81) ont eux pr&#233;f&#233;r&#233; consid&#233;rer que les questions de chronologie relative &#233;taient presque uniquement r&#233;gies par 
des principes discursifs s'appuyant sur des connaissances du monde, ces principes &#233;tant directement inspir&#233;s 
de la RST (Mann et Thompson 1988). Bras et Asher (1994) ont ainsi abandonn&#233; l'opposition aspectuelle 
&#233;tablie par Kamp entre &#233;tat (associ&#233; &#224; l&#8217;imparfait) et &#233;v&#233;nement (associ&#233; au pass&#233; simple), notant alors que la 
principale difficult&#233; devenait celle de l&#8217;identification des relations de discours. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Temporalit&#233; linguistique et S-Langages 
</p>
<p>type de valeurs aspectuelles qu&#8217;ils induisent (cf. remarque (i)). Visualis&#233;e selon un certain 
aspect, une situation est assujettie &#224; une certaine logique des relations temporelles qui 
d&#233;termine l'acceptabilit&#233; de certaines combinaisons de notions aspectuelles et l'inacceptabilit&#233; 
d'autres combinaisons. Parmi les principes les plus importants qui gouvernent la logique des 
relations temporelles pertinentes du point de vue aspectuel, certaines peuvent alors &#234;tre 
consid&#233;r&#233;es comme axiomatiques (Lyons 1990, p. 329). 
</p>
<p>Un autre aspect essentiel des travaux linguistiques sur la temporalit&#233; a trait au type de 
relations temporelles qui sont envisag&#233;es entre propositions. On remarque ainsi qu&#8217;elles sont 
incompl&#232;tement sp&#233;cifi&#233;es : en effet, si l&#8217;on se r&#233;f&#232;re aux 13 relations th&#233;oriquement possibles 
entre deux intervalles quelconques3, il est en g&#233;n&#233;ral impossible de pr&#233;ciser si l&#8217;on a affaire &#224; 
l&#8217;une ou l&#8217;autre de ces relations ; on a plut&#244;t recours &#224; un sous-ensemble de ces relations pour 
expliciter les relations possibles entre deux propositions. La relation de couverture, not&#233;e 0, 
introduite par Kamp (1981) illustre bien cette probl&#233;matique. Elle traduit la contemporan&#233;it&#233; 
des deux proc&#232;s et dit exactement ceci : peu importe les situations respectives de d&#233;but et de 
fin des proc&#232;s, la seule information pertinente est qu&#8217;ils aient une partie commune. 
Consid&#233;rons &#224; cet effet l&#8217;exemple (5). Il sera repr&#233;sent&#233; par P10P2 car rien ne dit si le 
clignotant a &#233;t&#233; mis avant, en m&#234;me temps ou apr&#232;s le d&#233;but de l&#8217;arr&#234;t, et l&#8217;histoire n&#8217;&#233;tant pas 
achev&#233;e, nous n&#8217;avons aucune autre information pour affiner la situation entre les deux bornes 
de droite. Une autre illustration de cette probl&#233;matique peut &#234;tre donn&#233;e dans le cadre du 
mod&#232;le de Descl&#233;s (1989)4 o&#249; Sakagami (1997) a analys&#233; le fonctionnement de plusieurs 
connecteurs temporels en fran&#231;ais (&#171; quand &#187;, &#171; chaque fois que &#187;, &#171; apr&#232;s que &#187;, ...). Elle a 
identifi&#233; des relations invariantes exprim&#233;es par les connecteurs et a exhib&#233; une cinquantaine 
de relations possibles entre valeurs aspectuelles, certaines de ces relations se retrouvant dans 
des phrases contenant des connecteurs diff&#233;rents5. Elle a alors d&#233;gag&#233; trois caract&#233;ristiques 
communes &#224; ces relations, ce qui t&#233;moigne encore selon nous du caract&#232;re incompl&#232;tement 
sp&#233;cifi&#233; des relations entre intervalles : (i) une valeur aspectuelle quelconque suivie d'une 
valeur aspectuelle quelconque dans la cha&#238;ne lin&#233;aire exprime toujours une certaine 
succession ; (ii) la fin d'une valeur en pr&#233;c&#233;dant une autre est difficilement rep&#233;rable ; (iii) 
parmi les 13 relations possibles entre deux intervalles quelconques, seulement 12 sont 
attest&#233;es linguistiquement, celle de chevauchement n&#8217;ayant pas &#233;t&#233; identifi&#233;e. L&#8217;application 
sur le texte (6), issu d&#8217;un corpus de constats d&#8217;accidents, des r&#232;gles d&#8217;ordonnancement 
temporel propos&#233;es dans le cadre de ces travaux, conduit aux relations temporelles de la figure 
1. On voit clairement que ces derni&#232;res sont incompl&#232;tement sp&#233;cifi&#233;es (plusieurs lectures 
temporelles du texte sont possibles) et souvent issues de calculs envisag&#233;s au niveau local 
seulement, c&#8217;est-&#224;-dire en ne consid&#233;rant que les propositions deux &#224; deux. Les op&#233;rateurs des 
S-langages permettent de r&#233;soudre les probl&#232;mes pos&#233;s dans le cadre de ces deux remarques.  
</p>
<p>                                                 
</p>
<p>3  Et si l&#8217;on admet que l&#8217;on associe des intervalles aux situations d&#233;not&#233;es par les propositions. 
4   Le mod&#232;le de Descl&#233;s (1989) propose une tripartition des valeurs aspectuelles en &#233;tat, &#233;v&#233;nement et processus 
</p>
<p>(lesquelles peuvent &#234;tre ensuite sp&#233;cifi&#233;es plus finement) interpr&#233;t&#233;e dans le mod&#232;le topologique : &#224; un &#233;tat 
correspond un intervalle ouvert, &#224; un &#233;v&#233;nement un intervalle ferm&#233;, et &#224; un processus un intervalle ferm&#233; &#224; 
gauche et ouvert &#224; droite. 
</p>
<p>5  Les r&#233;gularit&#233;s observ&#233;es &#224; ce niveau ont directement &#233;t&#233; exploit&#233;es pour exhiber des relations temporelles 
pouvant &#234;tre &#233;tablies par d&#233;faut (Battistelli 2000) i.e. en l&#8217;absence de connecteurs temporels. Elles indiquent 
que les valeurs aspectuelles codent &#224; elles seules certaines instructions relatives &#224; l&#8217;organisation temporelle 
dans un texte narratif. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Battistelli, Etienne Picard, Jean-Luc Minel et Sylviane Schwer 
</p>
<p>(6) Etant arr&#234;t&#233; momentan&#233;ment sur la file droite du Bd des Italiens (P1 : &#233;tat), j&#8217;avais 
mis mon clignotant (P2 : &#233;tat), j'&#233;tais &#224; l'arr&#234;t (P3 : &#233;tat). Le v&#233;hicule B arrivant sur 
ma gauche (P4 : processus) m'a serr&#233; de trop pr&#232;s (P5 : &#233;v&#232;nement) et m'a ab&#238;m&#233; 
tout le c&#244;t&#233; avant gauche (P6 : &#233;v&#232;nement).  
</p>
<p>0.  R&#232;gle g&#233;n&#233;rale : si un &#233;tat est dans une relation avec un &#233;v&#233;nement ou un processus, alors tous les &#233;tats concomitants 
avec cet &#233;tat h&#233;ritent de la m&#234;me relation 
</p>
<p>00.  R&#232;gle g&#233;n&#233;rale : tout &#233;tat englobe l&#8217;ensemble des &#233;v&#233;nements et des processus 
</p>
<p>1.  P1, P2, P3 CONCOMITANTS  (*existence d&#8217;un sous-intervalle commun aux trois propositions*) 
2.  P5 INCLUS_DANS P4   OU   P5 SUCCEDE_A P4    
3.  P6 COMMENCE_EN_MEME_TEMPS_OU_APRES P5    
</p>
<p>Figure 1 : R&#232;gles g&#233;n&#233;rales  du mod&#232;le et relations temporelles pour le texte (6) 
</p>
<p>Plus g&#233;n&#233;ralement, quelque soient les objets primitifs adopt&#233;s (points, intervalles, &#8230;) dans un 
mod&#232;le linguistique donn&#233;, il s&#8217;agit en fait de situer des points isol&#233;s ou des bornes 
d&#8217;intervalles les uns par rapport aux autres. Or situer relativement deux points sur une droite, 
c&#8217;est les mettre soit en relation de pr&#233;c&#233;dence soit en relation de simultan&#233;it&#233;. Le mod&#232;le 
math&#233;matique qui synth&#233;tise ces deux relations est celui des pr&#233;ordres lin&#233;aires. L&#8217;ensemble 
de toutes les situations possibles entre n cha&#238;nes de points &#233;quivaut &#224; rechercher l&#8217;ensemble de 
tous les pr&#233;-ordres lin&#233;aires constructibles en pr&#233;servant ces n cha&#238;nes. Les pr&#233;ordres 
s&#8217;expriment simplement en termes de S-langages (Schwer 2002). La figure 2 exprime les 
relations temporelles de la figure 1 en termes de S-langages.  
</p>
<p>3 Temporalit&#233; et S-Langages 
</p>
<p>Ce qui distingue les S-langages des langages formels usuels est la nature des lettres utilis&#233;es : 
pour les S-langages, ce sont des ensembles de lettres &#8211; les S-lettres &#8211; et non des lettres 
simples. Une S-lettre poss&#233;dant une unique lettre peut &#234;tre confondue avec cette lettre ; ainsi, 
les mots et les langages deviennent des S-mots et des S-langages. Nous associons &#224; chaque 
extension temporelle d&#8217;un proc&#232;s A une identit&#233; a, pris comme une lettre de l&#8217;alphabet, et le 
mot ap o&#249; p est le nombre des extr&#233;mit&#233;s de ses intervalles et/ou de ses points isol&#233;s. Par 
exemple, si deux proc&#232;s A et B, d&#8217;identit&#233; respective a et b, sont des intervalles, alors les (S-
)mots aa et bb les repr&#233;sentent sur l&#8217;alphabet A={a,b}. L&#8217;ensemble de toutes les relations 
entre aa et bb est repr&#233;sent&#233; par le S-langage aa&#2; bb={aabb,a{a,b}b, abab, {a,b}ab, ab{a,b}, 
abba, {a,b}{a,b}, baab, ba{a,b}, {a,b}ba, baba, b{a,b}a, bbaa}. Le S-mot {a,b}ab traduit le 
fait que le proc&#232;s A d&#233;bute en m&#234;me temps que le proc&#232;s B mais se termine avant. Toute 
relation temporelle est un sous S-langage de aa&#2; bb . Par exemple, le S-langage {abab, 
{a,b}ab, ab{a,b}, abba, {a,b}{a,b}, baab, ba{a,b}, {a,b}ba, baba} repr&#233;sente A0B. En dehors 
des op&#233;rateurs classiques des langages formels (produit, union, intersection), nous utilisons la 
S-projection et la jointure (Schwer 2001). Pour faciliter le calcul et en r&#233;duire la complexit&#233; 
(ce genre de calcul est NP-complet), nous introduisons la notion de S-langage &#233;l&#233;mentaire. 
</p>
<p>0., 00. et 1. donnent : [p1&#2;p2&#2;p3]  [p4p4 &#2;p5p5&#2;p6p6]  [p1&#2;p2&#2;p3] 
En raffinant avec 2. :  [p1&#2;p2&#2;p3]  [{p4p5p5p4, p4p4p5p5}&#2;p6p6]  [p1&#2;p2&#2;p3]  
En raffinant avec 3. : [p1&#2;p2&#2;p3] {p4p5[p5p4&#2;p6p6], p4p4p5[p5&#2;p6p6], p4{p5,p6}[p5p4&#2;p6], 
p4p4{p5,p6}[p5&#2;p6]} [p1&#2;p2&#2;p3] 
</p>
<p>Figure 2 : S-expressions des contraintes temporelles du texte (6)  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Temporalit&#233; linguistique et S-Langages 
</p>
<p>D&#233;finitions :  
- Soit X un alphabet dont les &#233;l&#233;ments sont appel&#233;s lettres. Le S-alphabet &#710; X  est l&#8217;ensemble 
des parties non vides de X. Par identification des S-lettres {x} avec la lettre x, X &#3; &#710; X . Un 
S-mot est une suite finie de S-lettres et un S-langage un ensemble de S-mots. L&#8217;ensemble 
de tous les S-mots sur X est not&#233; &#710; X *.  
</p>
<p>- La S-projection sur le sous-alphabet Y d&#8217;un S-mot f, not&#233;e f|A , est le S-mot obtenu en 
supprimant de f toutes les occurrences de lettres qui ne font pas partie de Y, puis toutes les 
S-lettres dont toutes les lettres ont &#233;t&#233; supprim&#233;es. Soit X un alphabet, notons 
pour f &#4; &#710; X *,X | f le sous-alphabet constitu&#233; uniquement des lettres composant f. 
</p>
<p>- Soit X et Y deux alphabets, f &#4; &#710; X *,g &#4; &#710; Y *, la jointure de f et g, not&#233;e f &#2; g, existe si sur 
</p>
<p>l&#8217;alphabet commun Z &#5; X| f &#6; X |g  les projections des mots f et g co&#239;ncident (f|Z = g|Z). Dans 
ce cas, f &#2; g est l&#8217;ensemble des S-mots &#233;crits sur X et Y, dont la projection sur X vaut f et 
la projection sur Y vaut g. Formellement f &#2; g= 
{h &#4; &#710; T *,( T &#5; X&#7;Y), (h|X &#5; f )et (h|Y &#5; g)}.
</p>
<p>6 La jointure de deux S-langages M et N est le 
S-langage union des jointures d&#8217;un S-mot de M et d&#8217;un S-mot de N. La jointure est une 
op&#233;ration associative, commutative sur les S-langages d&#8217;alphabet X, avec pour &#233;l&#233;ment 
neutre &#710; X *. Le traitement informatique du raisonnement temporel est fond&#233; sur le fait qu&#8217;il 
existe une expression explicite (et r&#233;guli&#232;re donc implantable) de f &#2; g (Schwer 2001).  
- Un S-mot est un S-langage &#233;l&#233;mentaire. Un S-langage &#233;l&#233;mentaire s&#8217;exprime uniquement 
&#224; l&#8217;aide de m&#233;langes et de produits de S-langages &#233;l&#233;mentaires. Il est trivial de montrer que 
tout S-langage peut s&#8217;exprimer comme une union de S-langages &#233;l&#233;mentaires (un S-
langage pouvant toujours s&#8217;exprimer comme un ensemble de S-mots). Par exemple, le S-
langage A0B est &#233;l&#233;mentaire et s&#8217;exprime par [a&#2;b][a&#2;b].  
</p>
<p>T exte
</p>
<p>T exte balis&#233;
avec d es 
</p>
<p>contrain tes 
linguistiques 
</p>
<p>locales
</p>
<p>&#0; &#2; &#3; &#4; &#6; &#7; &#2; &#9; &#11; &#7;
</p>
<p>&#13;
</p>
<p>&#9; &#14; &#6; &#7; &#17;
</p>
<p>&#18; &#9; &#20; &#21; &#9; &#11; &#7;
</p>
<p>&#9; &#6; &#2; &#22;
</p>
<p>&#13;
</p>
<p>&#9; &#2; &#3; &#4; &#6; &#7;
</p>
<p>R elations
exprim &#233;es 
</p>
<p>en  S_L an gages
</p>
<p>C alcul de la  join ture
</p>
<p>E nsem ble 
des situations
</p>
<p>exprim &#233;es 
en S _L angages
</p>
<p>G &#233;n&#233;ration  d es
repr&#233;sentations visuelles
</p>
<p>C ontrain tes
d&#251;
</p>
<p>au  m od&#232; le
linguistiqu e
</p>
<p> 
</p>
<p>Figure 3 : Diagramme de flux de traitements 
</p>
<p>Un prototype, d&#233;velopp&#233; en Java, impl&#233;mente ce calcul aspecto-temporel. A partir d&#8217;une 
analyse manuelle aspecto-temporelle r&#233;alis&#233;e dans le cadre du mod&#232;le de (Descl&#233;s 1989), le 
</p>
<p>                                                 
</p>
<p>6  Exemple (nous soulignons les lettres communes sur lesquelles la jointure se fait) : 
{a,c}{a,b}{c,d}{a,b,c}&#2;{a,x,y}x{a,b}y{a,b,y}={{a,c,x,y}x{a,b}{c,d}y{a,b,c,y},{a,c,x,y}x{a,b}y{c,d}{a,b,c,y},{
a,c,x,y}x{a,b}{c,d,y}{a,b,c,y}}={a,c,x,y}x{a,b}[{c,d}&#2;y]{a,b,c,y}.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Battistelli, Etienne Picard, Jean-Luc Minel et Sylviane Schwer 
</p>
<p>texte est d&#233;coup&#233; en propositions auxquelles sont attach&#233;es des valeurs aspectuelles. En sortie, 
le prototype affiche le r&#233;sultat du calcul sous la forme d&#8217;une ou plusieurs repr&#233;sentations 
d&#8217;agencements temporels (cf. figure 3). 
</p>
<p>4 Conclusion 
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; le formalisme des S-langages pour repr&#233;senter les 
informations temporelles fournies par une analyse linguistique et r&#233;aliser le calcul global de 
l&#8217;ordonnancement temporel des proc&#232;s dans un texte. Cette approche oblige &#224; expliciter les 
connaissances implicites qui sont mises en &#339;uvre pour &#233;tablir des relations temporelles entre 
propositions dans un texte narratif. Nous avons ainsi d&#233;gag&#233; des S-langages &#233;l&#233;mentaires 
particuliers comme celui traduisant la relation de recouvrement de Kamp et qui sont des 
parties convexes du treillis des relations temporelles atomiques (Autebert et al. 2003), donc 
facilement exprimables et calculables. La d&#233;marche adopt&#233;e consiste en effet &#224; calculer une 
expression pertinente de relations possibles &#224; partir des marques linguistiques, plut&#244;t qu&#8217;&#224; 
calculer une seule relation possible ou l&#8217;ensemble de toutes les relations possibles entre 
propositions dans un texte.  
</p>
<p>R&#233;f&#233;rences 
</p>
<p>AUTEBERT J.-M., SCHWER S.R. (2003), On generalized Delannoy Paths, SIAM Journal on 
Discrete Mathematics, 16 (2), pp. 208-223.  
</p>
<p>BATTISTELLI D. (2000), &#1;&#2;&#3;&#3;&#4;&#5;&#6; &#7;&#8;&#6; &#9;&#4;&#10;&#9;&#4;&#6; &#11;&#6; &#8;&#12;&#4;&#6; &#3;&#13;&#14;&#8;&#4;&#12;&#15;&#4;&#6; &#7;&#16;&#17;&#18;&#2;&#19;&#4;&#3;&#6; &#20;&#6; &#2;&#12;&#2;&#21;&#22;&#3;&#4;&#6; &#3;&#23;&#2;&#9;&#17;&#24;&#25;&#9;&#4;&#18;&#23;&#24;&#5;&#4;&#21;&#21;&#4;&#6; &#7;&#4;&#6;
&#9;&#4;&#10;&#9;&#4;&#3;&#26;&#6;&#18;&#24;&#7;&#13;&#21;&#17;&#3;&#2;&#9;&#17;&#24;&#12;&#6;&#4;&#9;&#6;&#5;&#13;&#2;&#21;&#17;&#3;&#2;&#9;&#17;&#24;&#12;&#6;&#17;&#12;&#27;&#24;&#5;&#18;&#2;&#9;&#17;&#14;&#8;&#4; (&#3;&#22;&#3;&#9;&#28;&#18;&#4;&#6;&#29;&#1;&#30;&#31;), Th&#232;se de Doctorat, Univ. Paris-IV. 
</p>
<p>BRAS M., ASHER N. (1994), Le raisonnement non monotone dans la construction de la structure 
temporelle de textes en fran&#231;ais, Actes RFIA&#8217;94, Paris. 
</p>
<p>DESCL&#201;S J.-P. (1989), State, Event, Process and Topology, General Linguistics, 29(3), Pennsylvania 
State University Press, University Park and London, pp. 159-200. 
</p>
<p>DESCLES J.-P., MAIRE-REPPERT D., OH H.-G., BERRI J. (1994), Traitement automatique du temps et 
de l&#8217;aspect pour l&#8217;analyse de textes, T.A.L., vol. 35, n&#176;1, pp. 83-106. 
</p>
<p>GOSSELIN L. (1996), S&#233;mantique de la temporalit&#233; en fran&#231;ais : un mod&#232;le calculatoire et cognitif du 
temps et de l'aspect, Coll. Champs Linguistiques, Duculot. 
</p>
<p>KAMP H. (1981), Ev&#232;nements, repr&#233;sentations discursives et r&#233;f&#233;rence temporelle, Langage, n&#176;64, 
Larousse, pp. 39-64. 
</p>
<p>LYONS G. (1990), S&#233;mantique linguistique, traduction de J. Durand et D. Boulonnais, Larousse. 
</p>
<p>MANN W. C., THOMPSON S. A. (1988), Rhetorical Structure Theory : Toward a functional theory 
Toward a functional theory of text organization, &#31;&#4;&#10;&#9;, 8(3) p. 243-281. 
</p>
<p>SAKAGAMI R. (1997), Etude du fonctionnement de quelques connecteurs temporels en fran&#231;ais en vue 
d&#8217;un traitement informatique, Th&#232;se de doctorat, Universit&#233; Paris-IV. 
</p>
<p>SCHWER R.S., (2002-2001), S-arrangements avec r&#233;p&#233;titions, Compte. Rendu Acad. Sciences I 334, 
pp. 261-266, Paris et Rapport Interne LIPN 2001-2. 
</p>
<p>VET C. (1994), Relations temporelles et progression th&#233;matique, &#201;tudes Cognitives 1, S&#233;mantique des 
Cat&#233;gories de l'aspect et du Temps, Acad. des Sciences de Pologne, Warszawa, pp.131-149. </p>

</div></div>
</body></html>