<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extension de requ&#234;tes par lien s&#233;mantique nom-verbe acquis sur corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Extension de requ&#234;tes par lien s&#233;mantique nom-verbe acquis
sur corpus
</p>
<p>Vincent Claveau, Pascale S&#233;billot
IRISA - Universit&#233; de Rennes 1
</p>
<p>Campus de Beaulieu
35042 Rennes Cedex, FRANCE
</p>
<p>{Vincent.Claveau,Pascale.S&#233;billot}@irisa.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>En recherche d&#8217;information, savoir reformuler une id&#233;e par des termes diff&#233;rents est une des
clefs pour l&#8217;am&#233;lioration des performances des syst&#232;mes de recherche d&#8217;information (SRI)
existants. L&#8217;un des moyens pour r&#233;soudre ce probl&#232;me est d&#8217;utiliser des ressources s&#233;man-
tiques sp&#233;cialis&#233;es et adapt&#233;es &#224; la base documentaire sur laquelle les recherches sont faites.
Nous proposons dans cet article de montrer que les liens s&#233;mantiques entre noms et verbes
appel&#233;s liens qualia, d&#233;finis dans le mod&#232;le du Lexique g&#233;n&#233;ratif (Pustejovsky, 1995), peuvent
effectivement am&#233;liorer les r&#233;sultats des SRI. Pour cela, nous extrayons automatiquement des
couples nom-verbe en relation qualia de la base documentaire &#224; l&#8217;aide du syst&#232;me d&#8217;acquisition
ASARES (Claveau, 2003a). Ces couples sont ensuite utilis&#233;s pour &#233;tendre les requ&#234;tes d&#8217;un
syst&#232;me de recherche. Nous montrons, &#224; l&#8217;aide des donn&#233;es de la campagne d&#8217;&#233;valuation
Amaryllis, que cette extension permet effectivement d&#8217;obtenir des r&#233;ponses plus pertinentes, et
plus particuli&#232;rement pour les premiers documents retourn&#233;s &#224; l&#8217;utilisateur.
</p>
<p>In the information retrieval field, managing the equivalent reformulations of a same idea is a
key point to improve the performances of existing retrieval systems. One way to reach this goal
is to use specialised semantic resources that are suited to the document database on which the
queries are processed. In this paper, we show that the semantic links between nouns and verbs
called qualia links, defined in the Generative lexicon framework (Pustejovsky, 1995), enable
us to improve the results of retrieval systems. To achieve this goal, we automatically extract
from the document database noun-verb pairs that are in qualia relation with the acquisition
system ASARES (Claveau, 2003a). These pairs are then used to expand the queries of a retrieval
system. With the help of the Amaryllis evaluation campaign data, we show that these expansions
actually lead to better results, especially for the first documents proposed to the user.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Lexique s&#233;mantique, acquisition sur corpus, recherche d&#8217;information, Lexique g&#233;n&#233;ratif, exten-
sion de requ&#234;te
Semantic lexicon, corpus-based acquisition, information retrieval, Generative lexicon, query
expansion</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau, Pascale S&#233;billot
</p>
<p>1 Introduction
</p>
<p>En recherche d&#8217;information (RI), savoir reformuler une id&#233;e par des termes diff&#233;rents est une
des clefs pour l&#8217;am&#233;lioration des performances des syst&#232;mes de recherche d&#8217;information (SRI)
existants. &#192; ce titre, le traitement automatique des langues, et plus pr&#233;cis&#233;ment l&#8217;acquisition
de ressources s&#233;mantiques sur corpus, permet dans une certaine mesure de fournir les &#233;l&#233;ments
n&#233;cessaires &#224; ces reformulations. Il para&#238;t en effet &#233;vident que la connaissance de relations
s&#233;mantiques de noms &#224; noms (comme la synonymie ou l&#8217;hyperonymie) permet d&#8217;associer les
mots m&#233;moire &#224; disque dur ou message &#224; lettre. Nous proposons pour notre part de nous attacher
&#224; des liens s&#233;mantiques moins &#233;tudi&#233;s : ceux existant entre des noms (N) et verbes (V), comme
disque dur&#8211;stocker ou lettre&#8211;communiquer . Plus pr&#233;cis&#233;ment, nous nous int&#233;ressons aux liens N-
V dits qualia tels que d&#233;finis par le formalisme du Lexique g&#233;n&#233;ratif (Pustejovsky, 1995). Ces
relations qualia d&#233;crivent &#224; l&#8217;aide de pr&#233;dicats essentiellement verbaux les diff&#233;rentes facettes
s&#233;mantiques des noms (fonction, mode de cr&#233;ation...). Par exemple, le nom couteau et le verbe
couper sont en relation qualia (couper repr&#233;sente la fonction de couteau) ; le couple couteau&#8211;
couper est appel&#233; couple qualia.
</p>
<p>Plusieurs auteurs ont d&#233;j&#224; soulign&#233; l&#8217;int&#233;r&#234;t des liens s&#233;mantiques inter-cat&#233;goriels N-V pour
la reformulation et la recherche d&#8217;information. Une exp&#233;rience de C. Fabre &amp; C. Jacquemin
(2000) vise par exemple &#224; prendre en compte la variation verbo-nominale des termes afin
d&#8217;exploiter ce type de lien entre des termes nominaux (e.g. m&#233;thode d&#8217;obtention) et des formu-
lations verbales proches (e.g. obtenues par d&#8217;autres m&#233;thodes). G. Grefenstette (1997) souligne
quant &#224; lui l&#8217;importance des liens N-V syntagmatiques pour aider &#224; pr&#233;ciser et &#224; d&#233;sambigu&#239;ser
les noms contenus dans des requ&#234;tes courtes. Il montre ainsi qu&#8217;un moyen de caract&#233;riser s&#233;-
mantiquement un nom est d&#8217;extraire l&#8217;ensemble des verbes utilis&#233;s avec ce nom, de mani&#232;re &#224;
recenser ce qu&#8217;il permet de faire ou ce qui est fait en direction de lui (e.g. show et support pour
le nom research). P. Bouillon et al. (2000) proposent, pour leur part, un moyen de syst&#233;ma-
tiser cette approche utilisant les liens N-V en RI et de sp&#233;cifier un crit&#232;re d&#233;finissant les paires
pertinentes : ne retenir, parmi les paires N-V possibles pour la reformulation s&#233;mantique, que
celles en relation qualia. Sur le plan pratique, la validit&#233; de l&#8217;approche consistant &#224; exploiter
les relations qualia en RI a d&#233;j&#224; &#233;t&#233; partiellement test&#233;e. Tout d&#8217;abord, C. Fabre &amp; P. S&#233;bil-
lot (1999) ont exploit&#233; ces relations s&#233;mantiques au sein d&#8217;un service t&#233;l&#233;matique (annuaire du
Minitel). Une autre exp&#233;rience a &#233;galement &#233;t&#233; men&#233;e dans un service de documentation d&#8217;une
banque belge (Vandenbroucke, 2000). Il a &#233;t&#233; montr&#233;, de mani&#232;re qualitative, que l&#8217;ajout de
couples qualia aux requ&#234;tes des documentalistes permettait &#224; ces derniers d&#8217;acc&#233;der &#224; certains
documents auxquels ils n&#8217;auraient ni pens&#233;, ni pu acc&#233;der avec les requ&#234;tes originales. Ces ex-
tensions verbales sont d&#8217;autant plus int&#233;ressantes que peu manipul&#233;es par les documentalistes,
ceux-ci privil&#233;giant plus naturellement les extensions nominales. Ces r&#233;sultats semblent abon-
der dans le sens de l&#8217;utilit&#233; d&#8217;associer des verbes qualia &#224; des requ&#234;tes au sein d&#8217;un syst&#232;me
de recherche documentaire. Nous proposons dans cet article d&#8217;en v&#233;rifier exp&#233;rimentalement
l&#8217;int&#233;r&#234;t.
</p>
<p>Les liens s&#233;mantiques entre noms et verbes de ce type sont malheureusement absents des bases
s&#233;mantiques existantes. Il est donc n&#233;cessaire de les acqu&#233;rir sur un corpus repr&#233;sentatif de
la base documentaire, ce qui nous assure par ailleurs de mettre au jour des liens pertinents et
attest&#233;s. Pour ce faire, nous utilisons ASARES (Claveau, 2003a), un outil d&#8217;acquisition symbol-
ique permettant d&#8217;inf&#233;rer des patrons d&#8217;extraction morpho-syntaxiques de couples N-V qualia.
</p>
<p>Dans la partie suivante, nous pr&#233;sentons quelques travaux proches int&#233;grant des ressources
s&#233;mantiques aux syst&#232;mes de recherche d&#8217;information. Nous d&#233;crivons ensuite bri&#232;vement</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension de requ&#234;tes par lien s&#233;mantique nom-verbe acquis sur corpus
</p>
<p>ASARES, l&#8217;outil nous permettant d&#8217;acqu&#233;rir sur corpus les couples N-V qualia. Enfin, dans
la derni&#232;re section, nous pr&#233;sentons l&#8217;exp&#233;rience d&#8217;extension de requ&#234;tes &#224; l&#8217;aide des couples
qualia acquis et ses r&#233;sultats.
</p>
<p>2 Extension de requ&#234;tes par ressources s&#233;mantiques
</p>
<p>Comme nous l&#8217;avons vu, l&#8217;augmentation des performances des syst&#232;mes de recherche
d&#8217;information passe notamment par le traitement du ph&#233;nom&#232;ne d&#8217;&#233;quivalence s&#233;mantique.
Pour ce faire, plusieurs auteurs proposent l&#8217;emploi de ressources s&#233;mantiques. Leurs travaux
peuvent se distinguer selon qu&#8217;ils s&#8217;appuient sur des ressources externes &#224; la collection de textes
constituant la base documentaire, ou internes, i.e. d&#233;riv&#233;es de cette base.
</p>
<p>2.1 Utilisation de ressources externes
</p>
<p>La d&#233;marche la plus souvent adopt&#233;e consiste &#224; recourir &#224; une base de connaissances linguis-
tiques regroupant les mots s&#233;mantiquement proches, et structur&#233;e selon des relations hyper-
onymiques ou synonymiques. Les index de la requ&#234;te peuvent par exemple &#234;tre automatique-
ment propag&#233;s en suivant les liens exprim&#233;s dans la base lexicale, de mani&#232;re &#224; disposer d&#8217;une
description &#233;tendue de cette requ&#234;te. C&#8217;est l&#8217;option choisie par exemple &#224; FT-R&amp;D pour la
consultation du Minitel en fran&#231;ais (Gilloux et al., 1993). On conna&#238;t le co&#251;t de construc-
tion de telles ressources, qui am&#232;ne g&#233;n&#233;ralement ceux qui adoptent cette approche &#224; plaider
pour l&#8217;utilisation de ressources g&#233;n&#233;rales, mutualisables, dont WORDNET (Fellbaum, 1998)
constitue le mod&#232;le (Smeaton, 1999). Le gain apport&#233; par le recours &#224; de telles ressources
n&#8217;a toutefois pas &#233;t&#233; d&#233;montr&#233; jusqu&#8217;&#224; pr&#233;sent. Dans ses exp&#233;riences consistant &#224; &#233;tendre des
requ&#234;tes avec des termes appartenant aux m&#234;mes synsets de WORDNET que les termes de la
question, E. Voorhees (1994) constate m&#234;me des d&#233;gradations de performances.
</p>
<p>Deux aspects de cette d&#233;marche expliquent essentiellement ses limites : tout d&#8217;abord, elle
fait l&#8217;hypoth&#232;se d&#8217;une ressource lexicale g&#233;n&#233;rale valable hors contexte. Or, les limites de
l&#8217;utilisation des bases g&#233;n&#233;ralistes sur des domaines particuliers sont connues. On ne peut en
effet pas savoir dans quelle mesure un mod&#232;le s&#233;mantique con&#231;u a priori s&#8217;av&#232;re ad&#233;quat pour
repr&#233;senter le fonctionnement de domaines particuliers. Or, &#233;tendre la requ&#234;te consiste pr&#233;cis&#233;-
ment &#224; tenter de la rapprocher des documents qu&#8217;elle cherche &#224; explorer, en d&#8217;autres termes, &#224;
l&#8217;ancrer dans les mots r&#233;ellement utilis&#233;s dans le corpus. En second lieu, il manque &#224; l&#8217;approche
par th&#233;saurus une r&#233;flexion linguistique pr&#233;alable concernant le fonctionnement s&#233;mantique des
descripteurs. Elle mobilise en effet exclusivement les relations lexicales traditionnelles (hy-
peronymie, synonymie). Cette option t&#233;moigne d&#8217;une vision tr&#232;s cloisonn&#233;e du lexique. Ainsi
A. Smeaton (1999) d&#233;clare n&#8217;exploiter de WORDNET que les noms, ceux-ci &#233;tant les principaux
d&#233;tenteurs du contenu des textes. Or, s&#8217;il est prouv&#233; que les groupes nominaux constituent le
principal mode d&#8217;expression des descripteurs, l&#8217;apport s&#233;mantique d&#8217;autres cat&#233;gories de mots
tels que les verbes ne doit pas &#234;tre n&#233;glig&#233; pour r&#233;aliser l&#8217;enrichissement et la reformulation des
index.
</p>
<p>2.2 Utilisation de ressources internes
</p>
<p>En alternative &#224; l&#8217;utilisation de ressources g&#233;n&#233;ralistes, certaines &#233;tudes d&#233;rivent directement
de la collection de documents les connaissances s&#233;mantiques ensuite exploit&#233;es dans le proces-
sus de recherche. L&#8217;utilisation de cooccurrences a notamment fait l&#8217;objet tr&#232;s t&#244;t de plusieurs</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau, Pascale S&#233;billot
</p>
<p>travaux (Lesk, 1969; van Rijsbergen, 1977). L&#8217;id&#233;e sous-jacente sur laquelle ils s&#8217;appuient
est que tout terme &#233;troitement li&#233; &#224; un terme d&#8217;indexation peut lui-m&#234;me &#234;tre utilis&#233; comme
terme d&#8217;indexation. En pratique, ces termes &#171; &#233;troitement li&#233;s &#187; sont calcul&#233;s &#224; partir des cooc-
currences fr&#233;quentes des mots, par des m&#233;thodes essentiellement num&#233;riques. Un th&#233;saurus
est ainsi construit ; lors d&#8217;une interrogation, aux termes de la requ&#234;te sont alors ajout&#233;s les
&#233;l&#233;ments du th&#233;saurus qui leur sont proches, soit en consid&#233;rant chaque mot de la requ&#234;te in-
d&#233;pendamment, soit en consid&#233;rant l&#8217;ensemble de la requ&#234;te (Qiu &amp; Frei, 1995). L&#8217;efficacit&#233;
de ces approches d&#8217;extension de requ&#234;tes par cooccurrents est variable selon les travaux mais
aucune am&#233;lioration franche des r&#233;sultats ne semble se d&#233;gager quelle que soit la collection de
documents. H. Peat &amp; P. Wilett (1991) expliquent ce ph&#233;nom&#232;ne par le fait que les m&#233;thodes
utilis&#233;es pour l&#8217;extraction des cooccurrences favorisent l&#8217;acquisition de termes approximative-
ment de m&#234;me fr&#233;quence. Or si les termes de la requ&#234;te sont tr&#232;s fr&#233;quents, les termes ajout&#233;s
sont eux aussi trop fr&#233;quents pour &#234;tre discriminants.
</p>
<p>Notons enfin que les travaux se pla&#231;ant dans le domaine du retour de pertinence (relevance
feeback), initi&#233;s par J. Rocchio (1971), peuvent &#233;galement s&#8217;interpr&#233;ter comme une utilisation
de ressources s&#233;mantiques internes pour l&#8217;expansion de requ&#234;tes. En effet, le principe de ces
travaux (Salton &amp; Buckley, 1990) est d&#8217;exploiter les documents retourn&#233;s en r&#233;ponse &#224; une
requ&#234;te pour am&#233;liorer dans un second temps le r&#233;sultat de la recherche. En particulier, cela
peut se faire en extrayant des documents ramen&#233;s par la requ&#234;te originale de nouveaux termes
utilis&#233;s &#224; leur tour pour interroger la base. Les techniques choisies pour l&#8217;extraction de ces
nouveaux termes sont vari&#233;es mais peuvent se rapprocher de celles utilis&#233;es pour la construction
automatique des th&#233;saurus cit&#233;es pr&#233;c&#233;demment.
</p>
<p>Notre travail se situe dans ce second type de m&#233;thodes d&#8217;utilisation de ressources s&#233;mantiques.
Nous nous distinguons cependant des travaux existants par l&#8217;originalit&#233; de la ressource s&#233;man-
tique exploit&#233;e &#8212; la relation N-V qualia &#8212; et par la technique d&#8217;acquisition utilis&#233;e pour con-
stituer cette ressource. En effet, comme nous le pr&#233;cisons en section suivante, l&#8217;extraction
des couples N-V qualia sur corpus se fait par une technique symbolique, ASARES, qui devrait
permettre de d&#233;passer les limites des approches num&#233;riques &#233;voqu&#233;es par H. Peat &amp; P. Wilett
(1991).
</p>
<p>3 Acquisition sur corpus de liens nom-verbe qualia
</p>
<p>Pour r&#233;aliser l&#8217;acquisition sur corpus des couples N-V qualia, nous utilisons le syst&#232;me sym-
bolique ASARES. Nous en pr&#233;sentons succinctement dans cette section le principe. Le lecteur
int&#233;ress&#233; peut se reporter &#224; (Claveau, 2003b; Claveau, 2003a) pour une description plus d&#233;tail-
l&#233;e.
</p>
<p>Le syst&#232;me ASARES repose sur une technique symbolique &#224; la crois&#233;e de la logique et de
l&#8217;apprentissage artificiel supervis&#233; : la Programmation Logique Inductive (PLI). La PLI, gr&#226;ce
&#224; son expressivit&#233;, permet d&#8217;apprendre automatiquement des patrons contextuels (clauses de
Horn repr&#233;sentant la structure morpho-syntaxique des phrases dans lesquelles les couples N-V
apparaissent). C&#8217;est une technique d&#8217;apprentissage supervis&#233;e ; elle n&#233;cessite donc en entr&#233;e des
exemples de phrases contenant des couples qualia (ainsi que des contre-exemples) pour produire
ces clauses. Les patrons ainsi g&#233;n&#233;r&#233;s sont ensuite utilis&#233;s pour extraire de nouveaux couples
qualia. Cette m&#233;thode permet donc non seulement l&#8217;acquisition de couples N-V qualia &#8212; avec
des taux de rappel et pr&#233;cision bien meilleurs que les approches statistiques classiques &#8212; mais
aussi de fournir, via les clauses obtenues, un support interpr&#233;table par des linguistes des struc-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension de requ&#234;tes par lien s&#233;mantique nom-verbe acquis sur corpus
</p>
<p>tures portant les couples qualia (Bouillon et al., 2002).
</p>
<p>La premi&#232;re phase n&#233;cessaire &#224; l&#8217;utilisation d&#8217;ASARES est l&#8217;&#233;tiquetage morpho-syntaxique du
corpus sur lequel on doit effectuer la t&#226;che d&#8217;acquisition. &#192; chaque mot du corpus est donc
assign&#233;e une unique &#233;tiquette indiquant sa cat&#233;gorie et quelques informations morphologiques
(verbe &#224; l&#8217;infinitif, nom commun f&#233;minin au pluriel...). Dans les exp&#233;riences pr&#233;sent&#233;es ci-
dessous, cette phase est r&#233;alis&#233;e &#224; l&#8217;aide de l&#8217;&#233;tiqueteur CORDIAL ANALYSEUR1.
</p>
<p>La phase de g&#233;n&#233;ration d&#8217;exemples consiste &#224; trouver des phrases dans le corpus de r&#233;f&#233;rence
contenant des occurrences des informations (unit&#233;s ou relations) s&#233;mantiques recherch&#233;es. Dans
notre cas, il s&#8217;agit de rep&#233;rer des phrases contenant des couples nom-verbe en relation qualia.
Cette phase peut &#234;tre soit manuelle &#8212; un expert extrait alors de telles phrases du corpus &#8212;
soit automatique. Dans ce dernier cas, des techniques statistiques d&#8217;extraction de collocations
bas&#233;es sur des calculs de scores d&#8217;association (information mutuelle, Loglike...) peuvent &#234;tre
utilis&#233;es. Ce sont donc les occurrences et leur contexte qui constituent la base d&#8217;exemples. Des
contre-exemples peuvent &#233;galement &#234;tre trouv&#233;s de la m&#234;me mani&#232;re.
</p>
<p>Une fois les ensembles d&#8217;exemples constitu&#233;s, la phase la plus importante du syst&#232;me, celle
de production de patrons, peut se d&#233;rouler. L&#8217;approche que nous avons adopt&#233;e est de con-
sid&#233;rer cette &#233;tape comme un probl&#232;me d&#8217;apprentissage artificiel symbolique. Nous tentons
donc d&#8217;inf&#233;rer &#224; partir des exemples et des contre-exemples, par PLI, un ensemble de r&#232;gles
qui serviront ensuite de patrons d&#8217;extraction. Ainsi &#224; partir de l&#8217;exemple allumage-d&#233;clencher
dans la phrase &#171; ... d&#233;clenche : l&#8217;allumage du voyant 1, l&#8217;allumage du voyant alarme ... &#187; la clause
de Horn suivante peut &#234;tre inf&#233;r&#233;e : is_qualia(N,V) :- precedes(V,N), singular_common_noun(N),
suc(V,X), colon(X), pred(N,Y), punctuation(Y). ; celle-ci correspond au patron d&#8217;extraction V + : +
(tout token)&#8727; + [:,;] + N au singulier. Les patrons obtenus &#224; cette &#233;tape peuvent enfin permettre
de d&#233;tecter de nouveaux &#233;l&#233;ments conformes &#224; ceux donn&#233;s en exemples. Le patron pr&#233;c&#233;dent
permettrait ainsi d&#8217;extraire capot-ouvrir dans la phrase &#171; Ouvrir : le capot coulissant, le capot droit
et ... &#187;. Tous les couples ainsi extraits forment une sorte de lexique de couples qualia que l&#8217;on
va exploiter pour &#233;tendre les requ&#234;tes d&#8217;un syst&#232;me de recherche d&#8217;information.
</p>
<p>4 Extension de requ&#234;tes par couples qualia
</p>
<p>Comme nous l&#8217;avons vu, les liens s&#233;mantiques entre noms et verbes, et plus sp&#233;cialement
les liens N-V qualia, semblent particuli&#232;rement int&#233;ressants dans un contexte de recherche
d&#8217;information. Nous nous proposons dans cette partie d&#8217;en v&#233;rifier exp&#233;rimentalement l&#8217;utilit&#233;
en se servant de couples N-V en relation qualia pour &#233;tendre des requ&#234;tes et ainsi mesurer
l&#8217;impact sur la pertinence des documents retourn&#233;s.
</p>
<p>Nous pr&#233;sentons ci-apr&#232;s le protocole selon lequel se d&#233;roulent ces exp&#233;rimentations. Nous
d&#233;crivons ensuite plus sp&#233;cifiquement la mise-en-&#339;uvre de l&#8217;extension de requ&#234;tes &#224; l&#8217;aide des
relations qualia acquises automatiquement par ASARES. Enfin, nous examinons et discutons les
r&#233;sultats obtenus par cette technique d&#8217;extension sur notre collection de test.
</p>
<p>4.1 Protocole exp&#233;rimental
</p>
<p>Le protocole exp&#233;rimental que nous retenons pour nos exp&#233;rimentations se veut le plus
usuel possible. Le syst&#232;me de recherche d&#8217;information (SRI) que nous utilisons est SMART,
</p>
<p>1CORDIAL ANALYSEUR est un produit de la soci&#233;t&#233; Synapse D&#233;veloppement ; http://www.synapse-fr.com.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau, Pascale S&#233;billot
</p>
<p>d&#233;velopp&#233; par G. Salton (1971) pour mettre en &#339;uvre ses id&#233;es concernant le mod&#232;le vectoriel.
Dans ce mod&#232;le, &#224; tout document est assign&#233; un vecteur dont chaque composante repr&#233;sente
l&#8217;importance (calcul&#233;e &#224; partir d&#8217;un sch&#233;ma de pond&#233;ration s&#8217;appuyant le plus souvent sur la
fr&#233;quence) d&#8217;un mot dans le document.
</p>
<p>Les donn&#233;es utilis&#233;es lors de nos exp&#233;rimentations sont issues de la campagne Amaryllis (Landi
et al., 1998) d&#8217;&#233;valuation des SRI. Nous travaillons donc sur un corpus d&#8217;articles du journal Le
Monde, un jeu de requ&#234;tes et leurs r&#233;ponses. Ainsi, ce sont 11 016 articles (chacun repr&#233;sentant
un document et identifi&#233; par un num&#233;ro unique) qui composent notre base documentaire. Pour
chacune des 26 requ&#234;tes du jeu de test, une liste des identificateurs des documents pertinents est
fournie. Les requ&#234;tes sont structur&#233;es en un domaine g&#233;n&#233;ral, un sujet, une question d&#233;taill&#233;e
en langage naturel, une explication des documents attendus en r&#233;ponse, et une liste de concepts
(sous forme de mots-cl&#233;s) proches ; une requ&#234;te peut ainsi comporter jusqu&#8217;&#224; 50 mots pleins.
Les r&#233;ponses aux requ&#234;tes servant de r&#233;f&#233;rence pour l&#8217;&#233;valuation ont &#233;t&#233; &#233;tablies par un groupe
de juges humains.
</p>
<p>Une collection de couples qualia n&#233;cessaires &#224; l&#8217;extension de requ&#234;tes est construite &#224; partir
du corpus constitu&#233; de tous les documents de notre base. Pour cela, nous utilisons le syst&#232;me
ASARES d&#233;crit en section pr&#233;c&#233;dente. L&#8217;ensemble des articles a donc &#233;t&#233; &#233;tiquet&#233;, puis une
premi&#232;re phase d&#8217;extraction statistique, utilisant le coefficient du Loglike, a ensuite &#233;t&#233; men&#233;e
et a servi &#224; d&#233;finir deux ensembles d&#8217;exemples et contre-exemples. La phase d&#8217;apprentissage
sur ces deux ensembles a permis d&#8217;inf&#233;rer des patrons morpho-syntaxiques qui ont ensuite &#233;t&#233;
appliqu&#233;s aux articles pour en extraire les couples qualia. Les couples extraits sont rassembl&#233;s
dans une base lexicale avec leur nombre de d&#233;tections (nombre d&#8217;occurrences trouv&#233;es par les
patrons inf&#233;r&#233;s). Par exemple, les couples drogue-d&#233;p&#233;naliser et drogue-acheter ont &#233;t&#233; d&#233;tect&#233;s
3 fois, le couple drogue-consommer a &#233;t&#233; d&#233;tect&#233; 2 fois...
</p>
<p>Pour v&#233;rifier l&#8217;int&#233;r&#234;t &#233;ventuel des liens de type qualia en extension de requ&#234;tes, nous utilisons
les mesures de performances couramment utilis&#233;es en RI. Plus pr&#233;cis&#233;ment, nous calculons les
taux de rappel R (nombre de bons documents retourn&#233;s par rapport au nombre total de bons
documents dans la base) et de pr&#233;cision P (nombre de bons documents retourn&#233;s par rapport
au nombre total de documents retourn&#233;s). Puisqu&#8217;un score est assign&#233; &#224; chaque document en
fonction de sa proximit&#233; avec la requ&#234;te, les documents donn&#233;s en r&#233;ponse sont donc ordon-
n&#233;s, mais il faut d&#233;cider du nombre de documents que l&#8217;on propose &#224; l&#8217;utilisateur. Ce nombre,
appel&#233; document cut-off value (DCV), fait bien s&#251;r varier les taux de rappel et de pr&#233;cision ;
ceux-ci sont donc &#233;valu&#233;s pour diff&#233;rents DCV (et not&#233;s R(DCV) et P(DCV)), ou rassembl&#233;s au
sein de courbes rappel-pr&#233;cision. Des moyennes de la pr&#233;cision, soit interpol&#233;e (IAP), soit non-
interpol&#233;e (NIAP), pour les diff&#233;rents DCV, repr&#233;sentant les performances globales du syst&#232;me,
sont &#233;galement calcul&#233;es. Par ailleurs, pour s&#8217;assurer que les grandeurs mesur&#233;es ne sont pas le
fruit du hasard, nous v&#233;rifions que les am&#233;liorations ou d&#233;gradations constat&#233;es sont statistique-
ment significatives. Pour ce faire, nous utilisons le test de Student pour donn&#233;es pair&#233;es et celui
de Wilcoxon (Hull, 1996) ; les probabilit&#233;s que les grandeurs mesur&#233;es soient dues au hasard
sont respectivement not&#233;es pS et pW .
</p>
<p>4.2 Description de la m&#233;thode d&#8217;extension des requ&#234;tes
</p>
<p>Conform&#233;ment aux conclusions de C. de Loupy &amp; M. El-B&#232;ze (2002), les requ&#234;tes que nous
utilisons sont uniquement compos&#233;es des sujets des requ&#234;tes Amaryllis2 (voir ci-dessus). Le
</p>
<p>2Nous utilisons donc un protocole exp&#233;rimental tout &#224; fait diff&#233;rent de celui utilis&#233; pour les campagnes Amaryl-
lis dans le seul but de mesurer clairement l&#8217;impact de l&#8217;utilisation des liens qualia pour &#233;tendre des requ&#234;tes. En</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension de requ&#234;tes par lien s&#233;mantique nom-verbe acquis sur corpus
</p>
<p>nombre de mots pleins utilis&#233;s est ainsi plus proche d&#8217;une utilisation du syst&#232;me de recherche
dans des conditions r&#233;elles et ouvertes puisque toutes les &#233;tudes effectu&#233;es &#224; partir des logs de
moteurs de recherche du Web montrent que les requ&#234;tes formul&#233;es sont en moyenne inf&#233;rieures
&#224; deux mots (Jensen et al., 2000; Silverstein et al., 1998).
</p>
<p>Pour tester l&#8217;apport des verbes qualia &#224; la recherche documentaire, nous proposons d&#8217;&#233;tendre
chaque requ&#234;te avec les verbes qualia correspondant aux noms communs pr&#233;sents dans cette
requ&#234;te. La strat&#233;gie utilis&#233;e en pratique pour r&#233;aliser cette extension est tr&#232;s simple :
</p>
<p>&#8211; le nombre maximum de verbes ajout&#233;s par nom, not&#233; NbV , est arbitrairement fix&#233; &#224; 5 dans
les exp&#233;riences pr&#233;sent&#233;es ci-apr&#232;s ;
</p>
<p>&#8211; tous les noms pr&#233;sents dans la requ&#234;te sont candidats &#224; l&#8217;extension ;
&#8211; pour un nom fix&#233;, les NbV verbes qualia choisis dans la collection de couples sont ceux
</p>
<p>ayant le plus d&#8217;occurrences d&#233;tect&#233;es par ASARES.
Cette extension de requ&#234;te se fait donc en consid&#233;rant les noms de la requ&#234;te de mani&#232;re dis-
jointe, mais prend en compte, &#224; travers le choix des verbes d&#233;tect&#233;s le plus souvent, une sorte de
degr&#233; de certitude fourni par notre syst&#232;me d&#8217;acquisition. Par exemple, si la requ&#234;te originale
est la drogue en France, les verbes revendre, acheter, consommer, prendre, d&#233;p&#233;naliser , associ&#233;s &#224;
drogue et extraits du corpus par ASARES, y seront ajout&#233;s.
</p>
<p>La requ&#234;te &#233;tendue se compose donc des termes de la requ&#234;te originale et des verbes qualia.
Cette requ&#234;te &#233;tendue ne remplace pas l&#8217;ancienne requ&#234;te ; cette derni&#232;re est en effet &#233;galement
utilis&#233;e lors de la recherche gr&#226;ce aux m&#233;canismes de sous-vecteurs propos&#233;s dans l&#8217;extension
du mod&#232;le vectoriel de E. Fox (1983). Dans ce mod&#232;le, les requ&#234;tes sont compos&#233;es de sous-
vecteurs, chacun d&#8217;eux pouvant repr&#233;senter un type d&#8217;information diff&#233;rent appel&#233; ctype pour
concept type. La similarit&#233; d&#8217;un document et d&#8217;une requ&#234;te est la somme des similarit&#233;s selon
chaque sous-vecteur.
</p>
<p>4.3 &#201;valuation des performances de l&#8217;extension de requ&#234;tes
</p>
<p>La figure 1 pr&#233;sente les courbes rappel-pr&#233;cision du syst&#232;me avec les extensions de requ&#234;tes
d&#233;crites pr&#233;c&#233;demment compar&#233; au m&#234;me syst&#232;me mais utilisant uniquement les requ&#234;tes orig-
inales (sans extension). Deux jeux de courbes sont fournis : l&#8217;un d&#233;crit les performances de ces
deux syst&#232;mes en fixant le nombre de documents examin&#233;s (DCV) &#224; 20, l&#8217;autre consid&#232;re tous
les documents pertinents. Il en ressort que l&#8217;extension semble avoir un effet b&#233;n&#233;fique notable
sur la pr&#233;cision lorsque le rappel est inf&#233;rieur &#224; 30% ; au-del&#224; de cette limite les syst&#232;mes avec
extension et sans extension se comportent de mani&#232;re identique. On remarque &#233;galement qu&#8217;&#224;
rappel identique, l&#8217;extension de requ&#234;te am&#233;liore plus nettement les performances lorsque le
DCV est fix&#233; &#224; 20 documents.
</p>
<p>Cette derni&#232;re remarque est par ailleurs confirm&#233;e par la figure 2 repr&#233;sentant la pr&#233;cision du
syst&#232;me calcul&#233;e sur les 5 &#224; 5 000 premiers documents retourn&#233;s. L&#8217;am&#233;lioration amen&#233;e par
l&#8217;extension de requ&#234;te (not&#233;e ici par NbV = 5) par rapport au m&#234;me syst&#232;me utilisant les
requ&#234;tes non &#233;tendues (not&#233; par NbV = 0) est flagrante pour des DCV &lt; 20. Au-del&#224; de ce
seuil, aucune modification n&#8217;est apport&#233;e par l&#8217;ajout de verbes qualia.
</p>
<p>Ces remarques sont &#233;galement confirm&#233;es par les donn&#233;es recueillies dans le tableau 1. Dans ce
dernier, seules les mesures jug&#233;es statistiquement significatives par l&#8217;un des deux tests employ&#233;s
sont indiqu&#233;es. Les probabilit&#233;s non indiqu&#233;es sont sup&#233;rieures au seuil fix&#233; de 0.1. Toutes les
diff&#233;rences statistiquement significatives sont positives, c&#8217;est-&#224;-dire au b&#233;n&#233;fice de l&#8217;extension
</p>
<p>cons&#233;quence, nous ne comparons pas par la suite nos r&#233;sultats &#224; ceux obtenus lors de cette campagne.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau, Pascale S&#233;billot
</p>
<p>0
</p>
<p>0.1
</p>
<p>0.2
</p>
<p>0.3
</p>
<p>0.4
</p>
<p>0.5
</p>
<p>0.6
</p>
<p>0 0.2 0.4 0.6 0.8 1
</p>
<p>Pr
&#233;c
</p>
<p>is
io
</p>
<p>n
</p>
<p>Rappel
</p>
<p>Sans extension
Avec extension de 5 V par nom
</p>
<p>Sans extension, DCV = 20
Avec extension de 5 V par nom, DCV = 20
</p>
<p>Figure 1: Courbes rappel-pr&#233;cision du syst&#232;me
avec et sans extension
</p>
<p>0
</p>
<p>0.05
</p>
<p>0.1
</p>
<p>0.15
</p>
<p>0.2
</p>
<p>0.25
</p>
<p>0.3
</p>
<p>0.35
</p>
<p>10 100 1000
</p>
<p>Pr
&#233;c
</p>
<p>is
io
</p>
<p>n
</p>
<p>DCV (&#233;chelle logarithmique)
</p>
<p>Sans extension (Nbv = 0)
Avec extension (Nbv = 5)
</p>
<p>Figure 2: Pr&#233;cisions du syst&#232;me avec et sans
extension selon diff&#233;rents DCV
</p>
<p>Sans extension Avec extension Am&#233;lioration Probabilit&#233;
(%) (%) (%) de H0
</p>
<p>IAP 27.01 27.77 +2.81% pS &lt; 0.05, pW &lt; 0.1
NIAP 25.32 25.91 +2.33% pS &lt; 0.05
P(5) 30.77 33.08 +7.5% pS &lt; 0.1
</p>
<p>P(10) 28.08 30.38 +8.22% pS &lt; 0.025, pW &lt; 0.06
P(30) 22.56 23.21 +2.84% pS &lt; 0.05, pW &lt; 0.08
</p>
<p>P(5000) 0.41 0.42 +1.11% pS &lt; 0.05
R(5) 8.14 8.61 +5.8% pS &lt; 0.1
</p>
<p>R(10) 15.35 16.86 +9.79% pS &lt; 0.025, pW &lt; 0.1
R(30) 34.91 35.53 +1.78% pS &lt; 0.05, pW &lt; 0.08
</p>
<p>R(5000) 92.77 94.52 +1.89% pS &lt; 0.025
</p>
<p>Table 1: Performances de l&#8217;extension de requ&#234;te
</p>
<p>de requ&#234;tes. Le r&#233;sultat principal que l&#8217;on observe est une nette am&#233;lioration des performances,
&#224; la fois en termes de rappel et de pr&#233;cision, pour des faibles DCV (5, 10 et 30 documents),
gr&#226;ce &#224; l&#8217;ajout des verbes qualia &#224; la requ&#234;te. La pr&#233;cision globale du syst&#232;me, mesur&#233;e par la
pr&#233;cision moyenne interpol&#233;e et non interpol&#233;e, en b&#233;n&#233;ficie &#233;galement avec une augmentation
l&#233;g&#232;re mais significative. Les taux de rappel et de pr&#233;cision mesur&#233;s sur les 5 000 premiers
documents sont eux aussi en tr&#232;s l&#233;g&#232;re hausse avec l&#8217;utilisation des requ&#234;tes &#233;tendues. Des
exp&#233;riences en cours semblent par ailleurs montrer que la taille de l&#8217;extension influe peu sur ces
diff&#233;rents r&#233;sultats.
</p>
<p>5 Discussion des r&#233;sultats et perspectives
</p>
<p>Les r&#233;sultats pr&#233;c&#233;dents sont tr&#232;s int&#233;ressants et confirment en partie l&#8217;int&#233;r&#234;t du lien N-V qualia
en recherche d&#8217;information. Plus pr&#233;cis&#233;ment, il semble que l&#8217;utilisation des verbes qualia
permette de retrouver plus rapidement des documents qui auraient finalement &#233;t&#233; propos&#233;s &#224;
l&#8217;utilisateur, mais &#224; des rangs prohibitifs. Ainsi, l&#8217;extension concentre en t&#234;te de liste les doc-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension de requ&#234;tes par lien s&#233;mantique nom-verbe acquis sur corpus
</p>
<p>uments pertinents, plus qu&#8217;elle n&#8217;agit sur la pr&#233;cision au d&#233;triment du rappel comme cela est
souvent affirm&#233; en recherche documentaire.
</p>
<p>D&#8217;un point de vue pratique, cette extension de requ&#234;tes par ressources s&#233;mantiques &#8212; &#224; savoir
des verbes qualia li&#233;s aux noms contenus dans la requ&#234;te &#8212; permet donc d&#8217;am&#233;liorer l&#233;g&#232;re-
ment les performances globales d&#8217;un syst&#232;me de recherche documentaire standard. Mais cette
extension est particuli&#232;rement performante, et donc int&#233;ressante &#224; mettre en &#339;uvre, pour les sys-
t&#232;mes n&#233;cessitant une bonne pr&#233;cision et un bon rappel d&#232;s les premiers documents retourn&#233;s &#224;
l&#8217;utilisateur. Un tel processus d&#8217;extension serait par exemple particuli&#232;rement profitable &#224; des
syst&#232;mes grand public pour lesquels on sait qu&#8217;en moyenne seuls les 20 premiers documents re-
tourn&#233;s sont consult&#233;s par les utilisateurs. Ces r&#233;sultats sont notamment &#224; mettre en perspective
avec ceux, plut&#244;t n&#233;gatifs, obtenus par d&#8217;autres exp&#233;riences d&#8217;extension &#224; l&#8217;aide de ressources
lexicales externes (Voorhees, 1994, par exemple) ou d&#233;riv&#233;es de la base documentaire (voir
(Peat &amp; Willett, 1991) pour une discussion sur ces r&#233;sultats).
</p>
<p>L&#8217;extension &#224; l&#8217;aide de verbes est aussi int&#233;ressante &#224; un autre titre. Les utilisateurs de SRI,
m&#234;me avertis, ont tendance &#224; sp&#233;cifier naturellement une requ&#234;te en y ajoutant de nouveaux
noms. L&#8217;extension par verbes qualia permet donc de faire &#233;merger des documents qui n&#8217;auraient
pas n&#233;cessairement &#233;t&#233; trouv&#233;s par une extension manuelle.
</p>
<p>Beaucoup de perspectives restent ouvertes &#224; l&#8217;issue de ces exp&#233;riences. Tout d&#8217;abord, notre
mise-en-&#339;uvre de l&#8217;extension de requ&#234;te est relativement rustique. Il serait en effet int&#233;ressant
de choisir les noms &#224; &#233;tendre &#224; l&#8217;aide de crit&#232;res linguistiques (noms t&#234;tes de syntagmes par
exemple) plut&#244;t que de tous les consid&#233;rer. De la m&#234;me fa&#231;on, le nombre de verbes ajout&#233;s
&#224; chaque nom, ici arbitrairement fix&#233; &#224; 5, pourrait varier suivant le nom &#224; &#233;tendre. Il serait
d&#8217;ailleurs int&#233;ressant d&#8217;&#233;tudier les variations de performances du syst&#232;me de recherche suiv-
ant ce nombre. Enfin, on peut &#233;galement vouloir inclure ces ressources s&#233;mantiques non plus
seulement &#224; l&#8217;interrogation du syst&#232;me de recherche, mais d&#232;s la phase d&#8217;indexation de la base
documentaire. Cela n&#233;cessite alors de d&#233;finir une repr&#233;sentation du document plus complexe
que la simple repr&#233;sentation vectorielle usuellement utilis&#233;e et reste un probl&#232;me ouvert.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOUILLON P., CLAVEAU V., FABRE C. &amp; S&#201;BILLOT P. (2002). Acquisition of Qualia Elements from
Corpora - Evaluation of a Symbolic Learning Method. In Proceedings of the 3rd International Confer-
ence on Language Resources and Evaluation, LREC&#8217;02, Las Palmas de Gran Canaria, Espagne.
</p>
<p>BOUILLON P., FABRE C., S&#201;BILLOT P. &amp; JACQMIN L. (2000). Apprentissage de ressources lexicales
pour l&#8217;extension de requ&#234;tes. TAL (Traitement automatique des langues), num&#233;ro sp&#233;cial Traitement
automatique des langues pour la recherche d&#8217;information, 41(2), 367&#8211;393.
</p>
<p>CLAVEAU V. (2003a). Acquisition automatique de lexiques s&#233;mantiques pour la recherche
d&#8217;information. Th&#232;se de doctorat, Universit&#233; de Rennes 1, France.
</p>
<p>CLAVEAU V. (2003b). Extraction de couples nom-verbe : une technique symbolique automatique. In
Actes de la conf&#233;rence Traitement Automatique des Langues Naturelles, TALN&#8217;03, Batz-sur-Mer, France.
</p>
<p>DE LOUPY C. &amp; EL-B&#200;ZE M. (2002). Managing Synonymy and Polysemy in a Document Retrieval
System Using WordNet. In Proceedings of the LREC&#8217;02 Workshop on Using Semantics for Information
Retrieval and Filtering, Las Palmas de Gran Canaria, Espagne.
</p>
<p>FABRE C. &amp; JACQUEMIN C. (2000). Boosting Variant Recognition with Light Semantics. In Pro-
ceedings of the 18th International Conference on Computational Linguistics, COLING&#8217;00, Saarbr&#252;cken,
Allemagne.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau, Pascale S&#233;billot
</p>
<p>FABRE C. &amp; S&#201;BILLOT P. (1999). Semantic Interpretation of Binominal Sequences and Information
Retrieval. In Proceedings of the International ICSC Congress on Computational Intelligence: Methods
and Applications, Symposium on Advances in Intelligent Data Analysis, AIDA&#8217;99, Rochester, &#201;tats-Unis.
</p>
<p>C. FELLBAUM, Ed. (1998). WordNet: An Electronic Lexical Database. Cambridge, Massachusetts,
&#201;tats-Unis : The MIT Press.
</p>
<p>FOX E. A. (1983). Extending the Boolean and Vector Space Models of Information Retrieval with
P-norm Queries and Multiple Concept Types. PhD thesis, Cornell University, New-York, &#201;tats-Unis.
</p>
<p>GILLOUX M., LASSALLE E. &amp; OMBROUCK J.-M. (1993). Interrogation en langage naturel du Minitel
guide des services. &#201;cho des recherches, 146, 1&#8211;20.
</p>
<p>GREFENSTETTE G. (1997). SQLET: Short Query Linguistic Expansion Techniques, Palliating One-
Word Queries by Providing Intermediate Structure to Text. In Actes de la Conf&#233;rence Recherche
d&#8217;Informations Assist&#233;e par Ordinateur, RIAO&#8217;97, Montr&#233;al, Qu&#233;bec, Canada.
</p>
<p>HULL D. A. (1996). Stemming Algorithms: A Case Study for Detailed Evaluation. Journal of the
American Society for Information Science, 47(1), 70&#8211;84.
</p>
<p>JENSEN B. J., SPINK A. &amp; SARACEVIC T. (2000). Real Life, Real Users, and Real Needs: A Study
and Analysis of User Queries on the Web. Information Processing and Management, 36(2), 207&#8211;227.
</p>
<p>LANDI B., KREMER P. &amp; SCHMITT L. (1998). Amaryllis: an Evaluation Experiment on Search Engine
in a French-Speaking Context. In Proceedings of the 1st International Conference on Language and
Resources Evaluation, LREC&#8217;98, Grenade, Espagne.
</p>
<p>LESK M. E. (1969). Word-Word Association in Document Retrieval Systems. American documenta-
tion, 20, 27&#8211;38.
</p>
<p>PEAT H. J. &amp; WILLETT P. (1991). The Limitations of Term Co-Occurrence Data for Query Expansion
in Document Retrieval Systems. Journal of the American Society for Information Science, 42(5), 378&#8211;
383.
</p>
<p>PUSTEJOVSKY J. (1995). The Generative Lexicon. Cambridge, Massachusetts, &#201;tats-Unis : The MIT
Press.
</p>
<p>QIU Y. &amp; FREI H.-P. (1995). Improving the Retrieval Effectiveness by a Similarity Thesaurus. Rapport
interne 225, ETH Zurich, Department of Computer Science, Zurich, Suisse.
</p>
<p>ROCCHIO J. J. (1971). Relevance Feedback in Information Retrieval. In G. SALTON, Ed., The SMART
Retrieval System: Experiments in Automatic Document Processing, p. 313&#8211;323. Prentice-Hall, Engle-
wood Cliffs.
</p>
<p>G. SALTON, Ed. (1971). The SMART Retrieval System: Experiments in Automatic Document Processing.
Prentice-Hall, Englewood Cliffs.
</p>
<p>SALTON G. &amp; BUCKLEY C. (1990). Improving Retrieval by Relevance Feedback. Journal of the
American Society fo Information Science, 41(4), 288&#8211;297.
</p>
<p>SILVERSTEIN C., HENZINGER M., MARAIS H. &amp; MORICZ M. (1998). Analysis of a Very Large
AltaVista Query Log. Rapport interne 1998-014, Systems Research Center, Digital Equipment Corp.
</p>
<p>SMEATON A. F. (1999). Using NLP or NLP Resources for Information Retrieval Tasks. In T. STRZA-
LKOWSKI, Ed., Natural Language Information Retrieval, p. 99&#8211;111. Kluwer Academic Publishers.
</p>
<p>VAN RIJSBERGEN C. J. (1977). A Theoretical Basis for the Use of Co-occurrence Data in Information
Retrieval. Journal of Documentation, 33(2), 106&#8211;119.
</p>
<p>VANDENBROUCKE L. (2000). Indexation automatique par couples nom-verbe pertinents. M&#233;moire de
DES en information et documentation, Universit&#233; Libre de Bruxelles, Belgique.
</p>
<p>VOORHEES E. M. (1994). Query Expansion Using Lexical-Semantic Relations. In Proceedings of ACM
SIGIR&#8217;94, Dublin, Irlande.</p>

</div></div>
</body></html>