<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Anonymisation de d&#233;cisions de justice</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Anonymisation de d&#233;cisions de justice
</p>
<p>Luc Plamondon (1), Guy Lapalme (1), Fr&#233;d&#233;ric Pelletier (2)
(1) RALI - Universit&#233; de Montr&#233;al
</p>
<p>Montr&#233;al, Qu&#233;bec, Canada
{plamondl, lapalme}@iro.umontreal.ca
</p>
<p>(2) CRDP - Universit&#233; de Montr&#233;al
Montr&#233;al, Qu&#233;bec, Canada
</p>
<p>pelletif@lexum.umontreal.ca
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>La publication de d&#233;cisions de justice sur le Web permet de rendre la jurisprudence accessible
au grand public, mais il existe des domaines du droit pour lesquels la Loi pr&#233;voit que l&#8217;identit&#233;
de certaines personnes doit demeurer confidentielle. Nous d&#233;veloppons actuellement un sys-
t&#232;me d&#8217;anonymisation automatique &#224; l&#8217;aide de l&#8217;environnement de d&#233;veloppement GATE. Le
syst&#232;me doit reconna&#238;tre certaines entit&#233;s nomm&#233;es comme les noms de personne, les lieux et
les noms d&#8217;entreprise, puis d&#233;terminer automatiquement celles qui sont de nature &#224; permettre
l&#8217;identification des personnes vis&#233;es par les restrictions l&#233;gales &#224; la publication.
</p>
<p>Publishing court decisions on the Web can make case law available to the general public, but the
Law sometimes prohibits the disclosure of the identity of people named in decisions. We are
currently developing an automatic anonymization system, using the GATE development envi-
ronment. The tasks of the system are the recognition of some named entities like person names,
locations and company names, then the automatic selection of the ones that may lead to the
identification of people whose identities must be legally kept confidential.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Anonymisation, d&#233;sidentification, reconnaissance d&#8217;entit&#233;s nomm&#233;es, textes juridiques.
Anonymization, de-identification, named entity recognition, law texts.
</p>
<p>1 Introduction
</p>
<p>On estime &#224; 200 000 le nombre de d&#233;cisions rendues annuellement par les tribunaux judiciaires
canadiens, repr&#233;sentant 2 millions de pages de texte, sans compter les d&#233;cisions rendues par les
tribunaux administratifs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Luc Plamondon, Guy Lapalme, Fr&#233;d&#233;ric Pelletier
</p>
<p>L&#8217;acc&#232;s &#224; la jurisprudence, c&#8217;est-&#224;-dire l&#8217;ensemble des d&#233;cisions rendues par les tribunaux, est
primordial dans les soci&#233;t&#233;s d&#233;mocratiques, non seulement pour assurer la transparence de la
justice et l&#8217;ind&#233;pendance de la magistrature, mais aussi pour informer les citoyens et leurs avo-
cats sur l&#8217;&#233;tat du droit. Ceci demeure vrai autant dans les pays dont la tradition juridique rel&#232;ve
de la common law, comme le Canada et le Royaume-Uni, que dans les pays de tradition juri-
dique continentale europ&#233;enne, comme la France.
</p>
<p>Pour le b&#233;n&#233;fice des professionnels du droit, des &#233;diteurs priv&#233;s publient depuis longtemps des
recueils regroupant une s&#233;lection des d&#233;cisions et mettent en ligne des banques de donn&#233;es re-
lativement exhaustives. Cependant, en raison du travail &#233;ditorial consid&#233;rable effectu&#233; sur les
d&#233;cisions ainsi publi&#233;es, le co&#251;t d&#8217;acc&#232;s demeure prohibitif pour le grand public. Depuis l&#8217;av&#232;-
nement du Web et avec l&#8217;utilisation g&#233;n&#233;ralis&#233;e des nouvelles technologies dans la pr&#233;paration
mat&#233;rielle des d&#233;cisions, il est maintenant possible de rendre le texte brut de l&#8217;ensemble des
d&#233;cisions de justice accessible au grand public, et ce &#224; faible co&#251;t. C&#8217;est dans ce contexte que
l&#8217;Institut canadien d&#8217;information juridique (IIJCan) a entrepris en 2000 un important projet de
diffusion libre du droit canadien sur le Web (www.iijcan.org).
</p>
<p>Bien que la diffusion int&#233;grale du texte des d&#233;cisions de justice soit la r&#232;gle g&#233;n&#233;rale, il existe
au Canada, comme dans plusieurs autres pays, des restrictions l&#233;gales quant &#224; la divulgation de
l&#8217;identit&#233; des participants les plus vuln&#233;rables aux proc&#233;dures judiciaires, tels les enfants en ma-
ti&#232;re familiale ou de protection de la jeunesse, les jeunes contrevenants, les adultes sous r&#233;gime
de protection ou les victimes d&#8217;agression sexuelle. Il r&#233;sulte de ces restrictions que plusieurs d&#233;-
cisions n&#233;cessitent une &#233;tape manuelle d&#8217;anonymisation avant leur diffusion. L&#8217;anonymisation
manuelle requiert en moyenne de une &#224; deux minutes de travail par page de texte. Le laboratoire
LexUM du Centre de recherche en droit public de l&#8217;Universit&#233; de Montr&#233;al estime que le tiers
des d&#233;cisions rendues au Canada ne sont pas publi&#233;es gratuitement sur le Web, faute de m&#233;thode
d&#8217;anonymisation fiable et peu co&#251;teuse.
</p>
<p>Nous avons entrepris le d&#233;veloppement d&#8217;un syst&#232;me d&#8217;anonymisation automatique de d&#233;ci-
sions de justice. Le syst&#232;me devra, &#224; terme :
</p>
<p>1. reconna&#238;tre automatiquement les noms, dates, lieux et autres entit&#233;s nomm&#233;es suscep-
tibles de constituer des renseignements permettant d&#8217;identifier les personnes vis&#233;es par
les restrictions &#224; la publication ;
</p>
<p>2. regrouper les renseignements qui concernent un m&#234;me individu ;
</p>
<p>3. d&#233;terminer quels individus requi&#232;rent l&#8217;anonymat ;
</p>
<p>4. proc&#233;der &#224; la modification ou la suppression des renseignements relatifs &#224; ces individus ;
</p>
<p>5. offrir une interface conviviale pour une r&#233;vision/correction manuelle.
</p>
<p>L&#8217;&#233;tape 1 rel&#232;ve du domaine de la reconnaissance d&#8217;entit&#233;s nomm&#233;es. Les textes juridiques pr&#233;-
sentent cependant des difficult&#233;s qui leur sont propres. Nous pr&#233;sentons &#224; la figure 1 un premier
prototype qui effectue la reconnaissance des noms propres de personne dans les d&#233;cisions. Ce
prototype a &#233;t&#233; d&#233;velopp&#233; &#224; l&#8217;aide de la suite de d&#233;veloppement GATE. Nous en parlerons plus
abondamment &#224; la section 3.
</p>
<p>Les autres &#233;tapes en sont encore &#224; l&#8217;&#233;tat de projet. L&#8217;&#233;tape 2 consistera &#224; regrouper les diff&#233;rentes
appellations d&#8217;un m&#234;me individu (&#8220;Jeremy R. Sullivan&#8221;, &#8220;Mr. Sullivan&#8221;, etc.) et cer-
tains renseignements personnels comme sa date de naissance, dans le but de proc&#233;der &#224; une ano-
nymisation en bloc si requis. L&#8217;&#233;tape 3 est n&#233;cessaire car tous les individus dont une d&#233;cision fait
mention n&#8217;ont pas &#224; &#234;tre anonymis&#233;s : cette &#233;tape pr&#233;sentera des difficult&#233;s tant au point de vue</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anonymisation de d&#233;cisions de justice
</p>
<p>FIG. 1 &#8211; Prototype du syst&#232;me d&#8217;anonymisation automatique. L&#8217;&#233;tape illustr&#233;e est la recon-
naissance des noms propres de personne. L&#8217;interface graphique est celle de GATE. La d&#233;cision
montr&#233;e en exemple est authentique mais les noms sont fictifs.
</p>
<p>informatique linguistique que juridique. Une fois la d&#233;cision prise, les informations confiden-
tielles devront &#234;tre modifi&#233;es (&#233;tape 4). Par exemple, conform&#233;ment aux pratiques actuelles des
&#233;diteurs, les noms de personne devront &#234;tre remplac&#233;s par des initiales (&#8220;Mr. Sullivan &#8594;
Mr. S.&#8221;, &#8220;Jeremy R. Sullivan &#8594; J. R. S.&#8221;) et le jour et le mois de naissance se-
ront supprim&#233;s (&#8220;born February 3, 1998 &#8594; born [...], 1998&#8221;). La derni&#232;re &#233;tape
(&#233;tape 5) est la seule &#224; ne pas &#234;tre automatis&#233;e : il s&#8217;agit en fait d&#8217;offrir la possibilit&#233; &#224; un
humain de r&#233;viser et de corriger le travail fait par le syst&#232;me.
</p>
<p>2 Que faut-il anonymiser ?
</p>
<p>Pour anonymiser un document, il ne suffit pas de supprimer tous les noms de personne qu&#8217;il
contient. En effet, une &#233;tude a montr&#233; que le code postal, la date de naissance et le sexe d&#8217;une
personne suffisent &#224; identifier de fa&#231;on unique 87 % de la population des &#201;tats-Unis et la seule
combinaison du code postal et de la date de naissance suffit &#224; identifier 97 % de la population
de la ville de Cambridge au Massachusetts (Sweeney, 2001).
</p>
<p>&#192; l&#8217;inverse, il faut r&#233;sister &#224; la tentation de masquer le plus d&#8217;informations possible car les textes
perdent d&#8217;autant plus de leur valeur. Par exemple, l&#8217;extrait de d&#233;cision &#8220;La demande de sta-
tut de r&#233;fugi&#233; de Monsieur A. R., originaire de Y, est refus&#233;e&#8221; est in-
utile aux fins d&#8217;une recherche portant sur l&#8217;acceptation des demandes de r&#233;fugi&#233;s en fonction
du pays d&#8217;origine. La pertinence juridique du document publi&#233; doit &#234;tre maintenue.
</p>
<p>Le laboratoire LexUM du Centre de recherche en droit public de l&#8217;Universit&#233; de Montr&#233;al s&#8217;est
pench&#233; sur la question du juste niveau d&#8217;anonymat (Pelletier, 2003). S&#8217;inspirant des pratiques</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Luc Plamondon, Guy Lapalme, Fr&#233;d&#233;ric Pelletier
</p>
<p>Renseignements &#224; supprimer syst&#233;matiquement pour toute personne vis&#233;e par une res-
triction &#224; la publication, ainsi que pour chacun de ses proches (parents, enfants, profes-
seurs, voisins, employeurs, coll&#232;gues, &#233;tablissement scolaire, etc.) :
</p>
<p>1. le nom (et surnom) ;
2. le jour et le mois de naissance ;
3. le lieu de naissance ;
4. les coordonn&#233;es (num&#233;ro, rue, municipalit&#233;, code postal, t&#233;l&#233;phone, t&#233;l&#233;copieur, courriel,
</p>
<p>page Web, adresse IP) ;
5. les identificateurs personnels uniques (num&#233;ro de s&#233;curit&#233; sociale, d&#8217;assurance maladie,
</p>
<p>de dossier m&#233;dical, de passeport, de compte bancaire, de carte de cr&#233;dit, etc.) ;
6. les identificateurs de possessions personnelles (num&#233;ro de licence ou de s&#233;rie, d&#233;signation
</p>
<p>cadastrale, nom d&#8217;entreprise, etc.).
</p>
<p>Renseignements &#224; supprimer selon la situation, s&#8217;ils permettent d&#8217;identifier une des per-
sonnes ci-haut :
</p>
<p>7. les petites communaut&#233;s ou lieux g&#233;ographiques ;
8. les accus&#233;s et co-accus&#233;s si leur identit&#233; n&#8217;est pas d&#233;j&#224; prot&#233;g&#233;e par la loi ;
9. les intervenants (experts de la cour, travailleurs sociaux, officiers de police, m&#233;decins,
</p>
<p>etc.) ;
10. les informations inhabituelles (nombre d&#8217;enfants s&#8217;il est anormalement &#233;lev&#233;, revenu s&#8217;il
</p>
<p>est particuli&#232;rement &#233;lev&#233;, occupation ou fonction exceptionnelle).
</p>
<p>FIG. 2 &#8211; Liste des renseignements &#224; anonymiser dans une d&#233;cision de justice.
</p>
<p>actuelles de divers &#233;diteurs de d&#233;cisions de justice, il a conclu qu&#8217;il faut supprimer les rensei-
gnements &#233;num&#233;r&#233;s &#224; la figure 2.
</p>
<p>S&#8217;inspirant des pratiques actuelles de divers &#233;diteurs de d&#233;cisions de justice, il a conclu que pour
les domaines de droit pour lesquels une restriction &#224; la publication s&#8217;applique le plus souvent &#8211;
en particulier les affaires p&#233;nales impliquant des victimes d&#8217;agression sexuelle ou des personnes
mineures, ainsi que les affaires familiales impliquant des enfants &#8211; il est possible de supprimer
syst&#233;matiquement les renseignements &#233;num&#233;r&#233;s &#224; la figure 2 tout en pr&#233;servant un bon niveau
de pertinence juridique au texte. Il est pr&#233;visible que cette liste doive &#234;tre l&#233;g&#232;rement adapt&#233;e
suivant le type de tribunal ou le domaine de droit concern&#233;.
</p>
<p>La plupart des &#233;l&#233;ments &#224; masquer sont des entit&#233;s nomm&#233;es, c&#8217;est-&#224;-dire des noms propres,
des dates ou des nombres. Les reconna&#238;tre dans un texte constitue d&#233;j&#224; un champ &#224; part enti&#232;re
du traitement automatique de la langue. Le second d&#233;fi est de d&#233;terminer automatiquement
lesquelles n&#233;cessitent d&#8217;&#234;tre anonymis&#233;es.
</p>
<p>3 Un premier prototype avec GATE
</p>
<p>Pour d&#233;velopper un prototype de syst&#232;me, nous avons choisi d&#8217;utiliser GATE (General Archi-
tecture for Text Engineering, http://gate.ac.uk), un environnement de d&#233;veloppement con&#231;u
sp&#233;cialement pour l&#8217;ing&#233;nierie des langues (Cunningham et al., 2003). Cet environnement d&#233;-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anonymisation de d&#233;cisions de justice
</p>
<p>finit une architecture standard qui permet de construire des applications &#224; partir de modules
ind&#233;pendants. Par exemple, l&#8217;environnement est livr&#233; avec des modules autonomes pour la to-
kenisation de textes, la segmentation en phrases, l&#8217;&#233;tiquetage grammatical, la reconnaissance
d&#8217;entit&#233;s nomm&#233;es et la r&#233;solution de liens de cor&#233;f&#233;rence ; il suffit de mettre les modules bout
&#224; bout pour obtenir rapidement une application fonctionnelle. Le d&#233;veloppeur peut ajouter ses
propres modules &#224; l&#8217;endroit appropri&#233; du pipeline ou remplacer un module d&#8217;origine. Pour fa-
ciliter la conception de modules, l&#8217;environnement GATE inclut une biblioth&#232;que de classes Java
pour effectuer des t&#226;ches courantes en manipulation de textes, telles la lecture d&#8217;un fichier en
diff&#233;rents formats, la constitution du graphe des annotations et l&#8217;&#233;criture en format XML. De
plus, une interface graphique de d&#233;veloppement permet d&#8217;annoter manuellement des documents
(pour constituer le corpus de r&#233;f&#233;rence) ou de visionner les r&#233;sultats de l&#8217;application automa-
tique et de les comparer avec le corpus de r&#233;f&#233;rence.
</p>
<p>Le syst&#232;me d&#8217;anonymisation en cours de d&#233;veloppement sera form&#233;, &#224; terme, du pipeline de
modules illustr&#233; &#224; la figure 3. Il s&#8217;agit d&#8217;un projet devant s&#8217;&#233;chelonner sur plusieurs ann&#233;es et au
moment d&#8217;&#233;crire ces lignes, nous en &#233;tions &#224; la phase de reconnaissance des noms de personne.
</p>
<p>GATE inclut d&#233;j&#224; une s&#233;rie de modules permettant de faire de la reconnaissance d&#8217;entit&#233;s nom-
m&#233;es : la suite ANNIE (A Nearly-New Information Extraction System) (Cunningham et al., 2003,
chapitre 7). Cependant, cette suite a &#233;t&#233; con&#231;ue pour analyser des textes journalistiques alors que
nous cherchons &#224; analyser des textes juridiques. Bien que nous ayons pu r&#233;cup&#233;rer certains mo-
dules de la suite ANNIE (pour la tokenisation et l&#8217;&#233;tiquetage grammatical), nous avons d&#251; modi-
fier les lexiques et r&#233;&#233;crire enti&#232;rement la grammaire de reconnaissance des noms de personne.
Cette grammaire est &#233;crite en langage JAPE (Java Annotation Patterns Engine), une variante du
standard CPSL adapt&#233; au langage de programmation Java (Cunningham et al., 2003, annexe B).
Nous avons modifi&#233; le transducteur lui-m&#234;me afin de combler des lacunes du langage JAPE et
ainsi nous permettre plus de flexibilit&#233; dans l&#8217;&#233;criture des r&#232;gles.
</p>
<p>Jusqu&#8217;&#224; maintenant, nous nous sommes concentr&#233;s sur la reconnaissance des noms propres de
personne dans les d&#233;cisions de la Cour sup&#233;rieure de l&#8217;Ontario. Conform&#233;ment aux travaux de
Sweeney (1996) et de Grouin (2002), nous avons privil&#233;gi&#233; l&#8217;utilisation de lexiques et de r&#232;gles
pour couvrir les cas les plus courants. Plus pr&#233;cis&#233;ment, nous utilisons le lexique de pr&#233;noms
et le lexique de titres de civilit&#233; de GATE que nous avons augment&#233; avec des titres de fonc-
tion propres au monde juridique (the Honourable, Justice, Q.C., etc.). La pr&#233;sence d&#8217;un titre,
d&#8217;un pr&#233;nom connu ou d&#8217;une initiale (ou de certaines combinaisons de ces &#233;l&#233;ments) signale le
d&#233;but d&#8217;un nom: tous les mots qui suivent et qui d&#233;butent par une majuscule sont consid&#233;r&#233;s
comme des noms de famille. Certaines constructions permettent d&#8217;identifier un nom de famille
sans qu&#8217;il soit n&#233;cessairement pr&#233;c&#233;d&#233; d&#8217;un titre, d&#8217;un pr&#233;nom du lexique ou d&#8217;une initiale,
par exemple lorsqu&#8217;une d&#233;cision ant&#233;rieure est cit&#233;e avec cette formule: &#8220;Gordon v Young&#8221;
(Gordon contre Young). Pour le moment, nous n&#8217;utilisons pas de lexique de noms de famille
courants.
</p>
<p>Afin d&#8217;&#233;valuer notre travail de reconnaissance des noms de personne, nous avons constitu&#233;
un corpus de test fait de d&#233;cisions totalisant 16 297 mots et contenant 546 noms de personne.
Pour l&#8217;instant, nous ne nous pr&#233;occupons pas de savoir si les noms sont confidentiels ou non.
Notre grammaire nous a permis d&#8217;obtenir une pr&#233;cision de 98 % et un rappel de 88 % (les
noms identifi&#233;s partiellement sont ici consid&#233;r&#233;s incorrects). En comparaison, la grammaire de
reconnaissance des entit&#233;s nomm&#233;es ANNIE (livr&#233;e avec GATE) n&#8217;atteint que 91 % de pr&#233;cision
et 81 % de rappel car elle n&#8217;est pas adapt&#233;e aux textes juridiques (figure 4).
</p>
<p>Les m&#234;mes noms sont r&#233;p&#233;t&#233;s plusieurs fois dans une d&#233;cision. Ainsi, les 546 noms de per-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Luc Plamondon, Guy Lapalme, Fr&#233;d&#233;ric Pelletier
</p>
<p>D&#233;cision en format texte
</p>
<p>Tokeniseur
</p>
<p>&#1;
</p>
<p>modules ANNIE
</p>
<p>&#201;tiqueteur grammatical
</p>
<p>&#1;
</p>
<p>Lexiques
</p>
<p>&#1;
</p>
<p>Grammaire de reconnaissance
des noms de personne
</p>
<p>&#1;
</p>
<p>R&#233;solution des liens de cor&#233;f&#233;rence
entre noms de personne
</p>
<p>&#1;
</p>
<p>Grammaire de reconnaissance des adresses, dates de naissance
et autres renseignements personnels
</p>
<p>&#1;
</p>
<p>Rattachement des renseignements personnels
aux individus
</p>
<p>&#1;
</p>
<p>modules projet&#233;s
</p>
<p>S&#233;lection automatique des individus
&#224; rendre anonymes
</p>
<p>&#1;
</p>
<p>Masquage du nom et des renseignements personnels
des individus &#224; rendre anonymes
</p>
<p>&#1;
</p>
<p>D&#233;cision en format XML
avec balises &lt;secret&gt;...&lt;/secret&gt;
</p>
<p>&#1;
</p>
<p>FIG. 3 &#8211; Pipeline de modules formant le syst&#232;me d&#8217;anonymisation ADJUM.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anonymisation de d&#233;cisions de justice
</p>
<p>Grammaire Occurrences Pr&#233;cision Rappel Formes Pr&#233;cision Rappel
Adapt&#233;e 546 98 % 88 % 63 88 % 73 %
ANNIE 546 91 % 81 % 63 61 % 48 %
</p>
<p>FIG. 4 &#8211; Pr&#233;cision et rappel de la grammaire adapt&#233;e aux d&#233;cisions et de la grammaire ANNIE.
Les formes sont les occurrences d&#233;pouill&#233;es des doublons.
</p>
<p>Omissions Occurrences (sur 546) Formes (sur 63)
Noms de famille sans marqueurs 9 5
Pr&#233;noms inconnus 34 2
Noms enti&#232;rement en majuscules 22 10
Autres 5 5
Chevauchements Occurrences (sur 546) Formes (sur 63)
Province incluse dans le nom 1 1
1er mot de la phrase inclus dans le nom 1 1
Faux positifs Occurrences Formes
Raison sociale 3 3
Lieu 1 1
Nom commun confondu avec pr&#233;nom 1 1
</p>
<p>FIG. 5 &#8211; Causes d&#8217;erreur ayant conduit &#224; l&#8217;omission de noms par notre grammaire, au chevau-
chement avec des noms corrects et &#224; l&#8217;identification de noms qui n&#8217;en sont pas.
</p>
<p>sonne du corpus de test se r&#233;duisent &#224; 63 formes diff&#233;rentes. Si l&#8217;on ne compte qu&#8217;une seule
fois chacune des formes, la pr&#233;cision de notre grammaire est de 88 % et le rappel est de 73 %.
Ces mesures sont davantage indicatrices de la qualit&#233; de la grammaire puisqu&#8217;elles consid&#232;rent
qu&#8217;une forme ignor&#233;e a autant de poids qu&#8217;une forme bien identifi&#233;e. Les mesures brutes, quant
&#224; elles, sont r&#233;v&#233;latrices de l&#8217;utilit&#233; du syst&#232;me puisque l&#8217;&#233;conomie d&#8217;efforts apport&#233;e par l&#8217;au-
tomatisation se compte en nombre d&#8217;occurrences.
</p>
<p>Nous avons privil&#233;gi&#233; des r&#232;gles conservatrices (la pr&#233;sence d&#8217;un pr&#233;nom connu ou d&#8217;un titre
de civilit&#233; &#233;tant habituellement obligatoire, comme nous l&#8217;avons expliqu&#233; ci-haut) pour limiter
le nombre de faux positifs (figure 5): seulement 5 extraits (tous diff&#233;rents) ont &#233;t&#233; faussement
&#233;tiquet&#233;s comme &#233;tant des noms de personne, contre 39 (se r&#233;duisant &#224; 22 formes diff&#233;rentes)
avec la grammaire ANNIE. En contrepartie, le rappel en souffre et il devra &#234;tre am&#233;lior&#233; en
priorit&#233;. Les r&#233;f&#233;rences &#224; des articles de loi sont une particularit&#233; des textes juridiques et nous
craignions qu&#8217;elles soient identifi&#233;es &#224; tort comme &#233;tant des noms propres puisqu&#8217;elles sont
form&#233;es de combinaisons d&#8217;initiales et de mots d&#233;butant par une majuscule ; l&#8217;approche conser-
vatrice que nous avons adopt&#233;e a permis d&#8217;&#233;viter ces pi&#232;ges avec succ&#232;s, contrairement &#224; la
grammaire ANNIE con&#231;ue pour des textes journalistiques. La majorit&#233; des entit&#233;s faussement
annot&#233;es comme noms de personne par notre grammaire sont en r&#233;alit&#233; des noms de lieu, d&#8217;or-
ganisme ou d&#8217;entreprise. Ces cas seront examin&#233;s plus tard au cours du projet, lorsque nous
&#233;crirons les grammaires de reconnaissance de lieux et de raisons sociales et que nous r&#233;sou-
drons les ambigu&#239;t&#233;s avec les noms de personne.
</p>
<p>Les omissions de la grammaire comptent pour la plus grande part des erreurs. Trois raisons
expliquent la majorit&#233; des omissions: des noms de famille apparaissent sans marqueurs (titre,
pr&#233;nom connu ou initiale), des pr&#233;noms sont inconnus du lexique et des noms sont &#233;crits enti&#232;-
rement en majuscules dans les ent&#234;tes. Heureusement, beaucoup de ces individus sont nomm&#233;s</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Luc Plamondon, Guy Lapalme, Fr&#233;d&#233;ric Pelletier
</p>
<p>autrement ailleurs dans la d&#233;cision et sous une forme reconnue par la grammaire: r&#233;analyser la
d&#233;cision avec les nouvelles informations permettra de r&#233;cup&#233;rer beaucoup d&#8217;omissions.
</p>
<p>Les deux erreurs de chevauchement d&#8217;annotations sont en fait des noms trop longs: des mots
adjacents d&#233;butant par une majuscule (&#8220;Ontario&#8221; dans le premier cas et le premier mot d&#8217;une
phrase dans le deuxi&#232;me cas) ont &#233;t&#233; consid&#233;r&#233;s &#224; tort comme faisant partie du nom de la per-
sonne.
</p>
<p>4 Travaux futurs
</p>
<p>4.1 La s&#233;lection des noms propres confidentiels
</p>
<p>Nous sommes pr&#233;sentement en mesure de reconna&#238;tre les noms de personne et l&#8217;&#233;tape suivante
sera de d&#233;terminer lesquels sont confidentiels. Nous pr&#233;voyons utiliser les titres (pour identifier
d&#8217;embl&#233;e les juges et les avocats, lesquels n&#8217;ont pas &#224; &#234;tre anonymis&#233;s), l&#8217;ent&#234;te si possible (pour
identifier le plaignant et l&#8217;accus&#233;) et le contexte (pour identifier les enfants et les proches).
</p>
<p>4.2 L&#8217;analyse des dates
</p>
<p>La date de naissance d&#8217;un individu dont l&#8217;identit&#233; est prot&#233;g&#233;e doit &#234;tre supprim&#233;e. Nous &#233;va-
luons qu&#8217;un nombre limit&#233; de r&#232;gles suffisent &#224; identifier les dates: Grouin en fournit quelques-
unes pour le fran&#231;ais et GATE en utilise d&#8217;autres pour l&#8217;anglais. La difficult&#233; r&#233;sidera dans la
distinction entre une date de naissance et une date quelconque. L&#8217;examen de plusieurs textes
r&#233;v&#232;lera peut-&#234;tre que les dates de naissance ne figurent que dans un nombre limit&#233; de formula-
tions, comme par exemple &#8220;Jamie, born 1998.&#8221;
</p>
<p>4.3 L&#8217;analyse des coordonn&#233;es et des noms de lieux
</p>
<p>Les coordonn&#233;es sont faites d&#8217;une combinaison du num&#233;ro de porte, du nom de la rue, de la
municipalit&#233;, du code postal, du num&#233;ro de t&#233;l&#233;phone, du num&#233;ro de t&#233;l&#233;copieur, du courriel
et de l&#8217;URL d&#8217;une page Web. Tout comme pour les dates, nous pourrons nous inspirer des
r&#232;gles de Grouin et de GATE, les adapter aux conventions canadiennes et ajouter des r&#232;gles pour
reconna&#238;tre les courriels et les URL.
</p>
<p>Le nom d&#8217;un lieu peut &#234;tre assez facilement identifi&#233; lorsqu&#8217;il fait partie d&#8217;une adresse compl&#232;te.
Dans les cas o&#249; l&#8217;adresse est r&#233;duite &#224; la ville seulement, ou lorsque l&#8217;on fait r&#233;f&#233;rence au lieu
de travail ou de naissance, nous pouvons faire appel &#224; un lexique. Nous disposons d&#8217;une liste de
3 millions de villages, villes et agglom&#233;rations du monde entier reconnues par la commission de
toponymie am&#233;ricaine (USGS) et l&#8217;agence de cartographie et d&#8217;imagerie am&#233;ricaine (NIMA).
</p>
<p>Tout comme pour les noms de personne, la difficult&#233; sera de distinguer les municipalit&#233;s &#224;
anonymiser des autres.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anonymisation de d&#233;cisions de justice
</p>
<p>4.4 L&#8217;analyse des raisons sociales
</p>
<p>Pour identifier les raisons sociales d&#8217;entreprises, d&#8217;organismes et d&#8217;&#233;tablissements scolaires,
l&#8217;utilisation d&#8217;un lexique sera moins efficace. D&#8217;une part, la liste des entreprises priv&#233;es change
fr&#233;quemment: le risque de ne pas identifier une nouvelle entreprise est &#233;lev&#233;. D&#8217;autre part, les
raisons sociales sont souvent longues et donc sujettes &#224; des variations, surtout pour les abr&#233;ger:
Shell International Limited ou Shell International lt&#233;e sont ais&#233;s &#224; identifier, surtout &#224; cause des
marqueurs Limited et lt&#233;e, mais l&#8217;entreprise est mieux connue sous l&#8217;appellation Shell qui, elle,
peut &#234;tre confondue avec le nom commun shell (coquillage).
</p>
<p>Le fait que les entreprises doivent &#234;tre anonymis&#233;es seulement lorsqu&#8217;il s&#8217;agit d&#8217;un employeur
pourrait faciliter les choses. En effet, une &#233;tude de corpus ou un apprentissage automatique per-
mettra peut-&#234;tre de d&#233;celer des s&#233;quences de mots qui pr&#233;c&#232;dent habituellement le nom d&#8217;un em-
ployeur: &#8220;employed by&#8221;, &#8220;working for&#8221;, &#8220;cashier for&#8221; et autres, toutes ces s&#233;quences
&#233;tant suivies d&#8217;un ou plusieurs mots d&#233;butant par une majuscule. Le m&#234;me raisonnement s&#8217;ap-
plique &#224; l&#8217;identification des &#233;tablissements scolaires.
</p>
<p>5 Travaux connexes
</p>
<p>La recherche en anonymisation a &#233;t&#233; initi&#233;e il y a d&#233;j&#224; plusieurs dizaines d&#8217;ann&#233;es pour satisfaire
les besoins des instituts de statistiques. Dans ce domaine, le fait que les donn&#233;es soient rigoureu-
semement structur&#233;es permet de formaliser les algorithmes d&#8217;anonymisation, ce que Sweeney
a &#233;t&#233; la premi&#232;re &#224; faire (Sweeney, 2001). La plupart des techniques et algorithmes d&#8217;anony-
misation de bases de donn&#233;es s&#8217;appliquent &#224; des donn&#233;es num&#233;riques, ce qui ne constitue pas
l&#8217;essentiel du probl&#232;me dans le cas des d&#233;cisions de justice.
</p>
<p>Des syst&#232;mes d&#8217;anonymisation de textes ont vu le jour mais seulement dans le domaine m&#233;dical.
Sweeney (1996) et Grouin (2002) se sont pench&#233;s sur la suppression des noms de patient dans
les rapports m&#233;dicaux &#224; l&#8217;aide de lexiques et de mots d&#233;clencheurs, techniques dont nous nous
sommes inspir&#233;s pour l&#8217;identification des noms propres de personne. Sweeney a obtenu une
pr&#233;cision de 100 % avec un seuil optimal de sensibilit&#233; des r&#232;gles ; nous n&#8217;avons cependant pas
acc&#232;s &#224; un &#233;chantillon du corpus de test et nous croyons que les rapports m&#233;dicaux sont plus
faciles &#224; traiter &#224; cause de leur forme et leur vocabulaire plus restreints que dans les d&#233;cisions
de justice. Grouin a quant &#224; lui obtenu une pr&#233;cision de 87 % et un rappel de 83 %.
</p>
<p>Ruch et al. (2000) obtiennent une pr&#233;cision de 97 % en n&#8217;utilisant que les titres devant les noms ;
cette strat&#233;gie fait partie de la n&#244;tre mais elle n&#8217;est pas suffisante pour les d&#233;cisions car elle ne
permet pas de d&#233;tecter le nom des enfants, rarement pr&#233;c&#233;d&#233; d&#8217;un titre. Taira et al. (2002)
ont entra&#238;n&#233; un mod&#232;le d&#8217;entropie maximale pour rep&#233;rer un certain nombre de relations lo-
giques faisant intervenir un patient (exemple de relation Patient-proc&#233;dure: &#8220;John received
therapy&#8221;). Les param&#232;tres du mod&#232;le sont les s&#233;quences d&#8217;&#233;tiquettes grammaticales, les n-
grammes, l&#8217;ordre des mots, la proximit&#233; de certains mots, etc. Le mod&#232;le a permis d&#8217;isoler les
noms de patient avec une pr&#233;cision de 99 % et un rappel de 94 % lorsque le seuil d&#8217;acceptabilit&#233;
du mod&#232;le est optimal. Cette approche est int&#233;ressante mais la difficult&#233; r&#233;side dans le choix
des param&#232;tres &#224; mod&#233;liser et il n&#8217;est pas certain que les relations logiques liant un individu
et un contexte particulier soient aussi prononc&#233;es dans une d&#233;cision que dans un rapport m&#233;di-
cal. Nous examinerons toutefois l&#8217;apprentissage automatique comme strat&#233;gie compl&#233;mentaire
&#224; celle bas&#233;e sur des lexiques et des grammaires.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Luc Plamondon, Guy Lapalme, Fr&#233;d&#233;ric Pelletier
</p>
<p>6 Conclusion
</p>
<p>L&#8217;anonymisation des d&#233;cisions de justice est un probl&#232;me complexe qui ne peut &#234;tre r&#233;solu que
si les aspects juridiques et informatiques sont trait&#233;s de front, ce qui explique que peu de travaux
aient jusqu&#8217;ici port&#233; directement sur le sujet. Du point de vue juridique, il faut bien jauger le
niveau d&#8217;anonymat requis par la Loi tout en s&#8217;assurant que les d&#233;cisions de justice demeurent
lisibles et utiles une fois les informations nominatives supprim&#233;es. Du point de vue informa-
tique, le probl&#232;me est double: il faut d&#8217;abord que le syst&#232;me analyse le texte de la d&#233;cision pour
rep&#233;rer les entit&#233;s nomm&#233;es (noms, adresses, lieux, num&#233;ros de t&#233;l&#233;phone, dates, etc.) et ensuite
qu&#8217;il d&#233;termine automatiquement lesquelles sont confidentielles. Le syst&#232;me d&#8217;anonymisation
automatique que nous d&#233;veloppons en est &#224; la phase de reconnaissance des noms propres de
personne. Gr&#226;ce &#224; l&#8217;environnement de d&#233;veloppement GATE, nous avons rapidement mis sur
pied un prototype utilisant des lexiques de pr&#233;noms et de titres et une grammaire de reconnais-
sance des noms propres &#233;crite sur mesure pour les textes juridiques. Nous avons privil&#233;gi&#233; une
approche symbolique plut&#244;t que statistique afin de limiter le bruit, donc le nombre de correc-
tions manuelles &#224; apporter au document, quitte &#224; ce que le rappel requi&#232;re d&#8217;&#234;tre am&#233;lior&#233;. Nous
nous attaquerons prochainement &#224; la s&#233;lection automatique des individus requ&#233;rant l&#8217;anonymat.
</p>
<p>Remerciements
</p>
<p>Nous d&#233;sirons remercier l&#8217;instigateur du projet, Daniel Poulin, professeur-chercheur et directeur
du laboratoire LexUM au Centre de recherche en droit public de l&#8217;Universit&#233; de Montr&#233;al.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CUNNINGHAM H., MAYNARD D., BONTCHEVA K., TABLAN V., URSU C. &amp; DIMITROV M. (2003).
Developing Language Processing Components with GATE (a User Guide). Sheffield Natural Language
Processing Group. http://www.gate.ac.uk/sale/tao/index.html (visit&#233; le 11 janvier 2004).
GROUIN C. (2002). Cha&#238;ne de traitements pour la constitution automatique de corpus: application au
domaine m&#233;dical pour le projet corpus CLEF. Master&#8217;s thesis, INaLCO &#8211; Institut National des Langues
et Civilisations Orientales, Paris, France. http://grouin.free.fr/projets/clef/sources/memoire/ (visit&#233;
le 26 ao&#251;t 2003).
</p>
<p>PELLETIER F. (2003). Protecting Identities in Published Case Law. Document interne, version pr&#233;limi-
naire, 3e r&#233;vision. LexUM.
</p>
<p>RUCH P., BAUD R. H., RASSINOUX A.-M., BOUILLON P. &amp; ROBERT G. (2000). Medical Document
Anonymization with a Semantic Lexicon. In J. M. OVERHAGE, Ed., Proceedings of the 2000 AMIA
Annual Symposium, p. 729&#8211;733: American Medical Informatics Association.
</p>
<p>SWEENEY L. (1996). Replacing Personally-Identifying Information in Medical Records, the Scrub Sys-
tem. In J. J. CIMINO, Ed., Proceedings of the 1996 AMIA Annual Symposium, p. 333&#8211;337, Washington,
DC: American Medical Informatics Association Hanley &amp; Belfus.
</p>
<p>SWEENEY L. (2001). Computational Disclosure Control, A Primer on Data Privacy Protection.
Rapport interne, Carnegie Mellon University. http://www.swiss.ai.mit.edu/classes/6.805/articles/
privacy/sweeney-thesis-draft.pdf (visit&#233; le 26 ao&#251;t 2003). Note: version pr&#233;liminaire d&#8217;un livre en
instance de publication.
</p>
<p>TAIRA R. K., BUI A. A. T. &amp; KANGARLOO H. (2002). Identification of Patient Name References
within Medical Documents Using Semantic Selectional Restrictions. In I. S. KOHANE, Ed., Proceedings
of the 2002 AMIA Annual Symposium, p. 757&#8211;761: American Medical Informatics Association.</p>

</div></div>
</body></html>