<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traduction, traduction de mots, traduction de phrases</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Traduction, traduction de mots, traduction de phrases
</p>
<p>Eric Wehrli
LATL - D&#233;partement de linguistique
</p>
<p>Universit&#233; de Gen&#232;ve
CH-1211 Gen&#232;ve 4
</p>
<p>Eric.Wehrli@lettres.unige.ch
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Une des cons&#233;quences du d&#233;veloppement d&#8217;Internet et de la globalisation des &#233;changes est le
nombre consid&#233;rable d&#8217;individus amen&#233;s &#224; consulter des documents en ligne dans une langue
autre que la leur. Apr&#232;s avoir montr&#233; que ni la traduction automatique, ni les aides termi-
nologiques en ligne ne constituent une r&#233;ponse pleinement ad&#233;quate &#224; ce nouveau besoin, cet
article pr&#233;sente un syst&#232;me d&#8217;aide &#224; la lecture en langue &#233;trang&#232;re bas&#233; sur un analyseur syn-
taxique puissant. Pour un mot s&#233;lectionn&#233; par l&#8217;usager, ce syst&#232;me analyse la phrase enti&#232;re,
de mani&#232;re (i) &#224; choisir la lecture du mot s&#233;lectionn&#233; la mieux adapt&#233;e au contexte morpho-
syntaxique et (ii) &#224; identifier une &#233;ventuelle expression idiomatique ou une collocation dont le
mot serait un &#233;l&#233;ment. Une d&#233;monstration de ce syst&#232;me, baptis&#233; TWiC (Translation of words
in context &quot;Traduction de mots en contexte&quot;), pourra &#234;tre pr&#233;sent&#233;e.
</p>
<p>As a consequence of globalisation and the development of the Internet, an increasing number
of people are struggling with on-line documents in languages other than their own. In this
paper, we will first argue that neither machine translation nor existing on-line terminology tools
constitute an adequate answer to this problem, and then present a new system conceived as a
foreign-language reading assistant, based on a powerful syntactic parser. Given a word selected
by the user, this system carries out a syntactic analysis of the whole sentence in order (i) to
select the most appropriate reading of the selected word, given the morpho-syntactic context,
and (ii) to identify a possible idiom or collocation the selected word might be part of. A demo
of this system, dubbed TWiC (Translation of words in context) will be available.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Traduction automatique, aide &#224; la traduction, analyse syntaxique, collocations
Machine translation, Translation aids, syntactic parsing, collocations</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Wehrli
</p>
<p>1 Introduction
</p>
<p>L&#8217;expression de village global, d&#8217;abord introduite par Marshall McLuhan dans son ouvrage The
Gutenberg Galaxy pour faire r&#233;f&#233;rence aux cons&#233;quences globales de l&#8217;&#233;mergence des m&#233;dias
&#233;lectroniques, est couramment utilis&#233;e aujourd&#8217;hui comme m&#233;taphore pour d&#233;crire le r&#233;seau
Internet et ses millions de n&#339;uds r&#233;partis &#224; travers le monde, auxquels on peut acc&#233;der pra-
tiquement imm&#233;diatement d&#8217;un simple clic de souris. Ce village, cependant, a une propri&#233;t&#233;
peu commune et pour tout dire quelque peu inattendue : son caract&#232;re multi-culturel et multi-
lingue, qui &#233;voque davantage l&#8217;image de la Tour de Babel que celle du village traditionnel.
</p>
<p>En effet, selon GlobalReach (www.glreach.com), la part des utilisateurs non-anglophones d&#8217;In-
ternet a pass&#233; de plus de 45% en 2001 &#224; moins de 36% deux ans plus tard. Comme, par ailleurs,
pr&#232;s de 70% des pages disponibles sur Internet sont en langue anglaise, on peut raisonnablement
conclure qu&#8217;un tr&#232;s grand nombre d&#8217;utilisateurs non-anglophones d&#8217;Internet consultent r&#233;gu-
li&#232;rement des pages en langue anglaise. En fait, il n&#8217;est sans doute pas exag&#233;r&#233; de penser que
jamais dans la monde autant de gens n&#8217;ont eu recours &#224; des informations dans une langue autre
que la leur.
</p>
<p>C&#8217;est bien &#224; ces utilisateurs &#8211; que nous sommes pratiquement tous &#224; un degr&#233; ou &#224; un autre
&#8211; que nous nous int&#233;ressons dans cet article, qui naviguent r&#233;guli&#232;rement sur des sites anglo-
phones (ou germanophones, ou autres). Poss&#233;dant une ma&#238;trise de l&#8217;anglais (respectivement de
l&#8217;allemand, ou autre) suffisante pour comprendre ce qu&#8217;ils lisent, ces utilisateurs font pourtant
face, r&#233;guli&#232;rement ou occasionnellement, &#224; des probl&#232;mes terminologiques : un mot (ou une
expression) leur &#233;chappe, susceptible de nuire &#224; une bonne compr&#233;hension du texte.
</p>
<p>Dans la premi&#232;re partie de cet article, nous montrerons comment ni la traduction automatique,
ni les outils actuels de terminologie en ligne ne constituent une solution pleinement ad&#233;quate
au probl&#232;me d&#233;crit ci-dessus. Au risque d&#8217;une formule tout &#224; la fois elliptique et facile, nous
conclurons que la premi&#232;re en fait trop, la seconde trop peu.
</p>
<p>Dans la deuxi&#232;me partie de cet article, nous pr&#233;senterons TWiC, un outil sp&#233;cifiquement d&#233;ve-
lopp&#233; pour r&#233;pondre au probl&#232;me ci-dessus. Alliant un analyseur syntaxique &quot;profond&quot; &#224; une
base terminologique bilingue riche, TWiC utilise l&#8217;analyseur pour identifier le mieux possi-
ble l&#8217;unit&#233; lexicale s&#233;lectionn&#233;e par l&#8217;utilisateur, de mani&#232;re &#224; limiter autant que possible le
bruit issu associ&#233; &#224; une recherche terminologique. Nous montrerons aussi, comment, gr&#226;ce &#224;
l&#8217;analyse syntaxique, TWiC peut identifier des expressions &#224; mots multiples m&#234;me lorsque les
constituants de ces derni&#232;res ne sont pas adjacents les uns aux autres.
</p>
<p>2 Traduction automatique et outils terminologiques
</p>
<p>Le probl&#232;me qui nous int&#233;resse peut &#234;tre illustr&#233; par l&#8217;exemple d&#8217;un lecteur francophone lisant
la version en ligne d&#8217;un magazine en langue anglaise. Ce lecteur, qui a une connaissance de
l&#8217;anglais suffisante pour effectuer cet exercice, n&#8217;est pourtant pas &#224; l&#8217;abri d&#8217;un d&#233;ficit termi-
nologique. Pour prendre un exemple concret, imaginons que le terme hankers dans la phrase
(1) lui soit inconnu.
</p>
<p>(1) A segment of the Latin-American left still hankers after revolution.
&quot;Un segment de la gauche latine-am&#233;ricaine aspire encore &#224; la r&#233;volution&quot;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction, traduction de mots, traduction de phrases
</p>
<p>Si, comme nous, le lecteur soumet cette phrase &#224; quelques-uns des syst&#232;mes de traduction
disponibles en ligne, voici ce qu&#8217;il risque d&#8217;obtenir :
</p>
<p>(2)a. Un segment de la gauche Latin-Am&#233;ricaine d&#233;sire toujours apr&#232;s r&#233;volution.
</p>
<p>b. Un segment du Latino-Am&#233;ricain est parti toujours d&#233;sire ardemment la r&#233;volution.
</p>
<p>c. Un segment du Latino-am&#233;ricain gauche calme hankers apr&#232;s r&#233;volution la
</p>
<p>d. Un segment de gauche toujours des hankers latino-am&#233;ricains apr&#232;s r&#233;volution.
</p>
<p>Ces exemples, qui illustrent fort bien les insuffisances de la traduction automatique actuelle,
montrent du m&#234;me coup pourquoi la traduction automatique, en l&#8217;&#233;tat, ne peut constituer une
r&#233;ponse ad&#233;quate &#224; notre probl&#232;me1. Non seulement la traduction obtenue est souvent peu
fiable, grammaticalement ou stylistiquement peu satisfaisante, parfois m&#234;me incompr&#233;hensible,
mais m&#234;me lorsque la traduction de la phrase est satisfaisante, elle oblige le lecteur &#224; parcourir
la phrase traduite pour tenter d&#8217;identifier le mot (ou l&#8217;expression) correspondant au terme source
qui faisait probl&#232;me. Si le mot hankers lui pose un probl&#232;me de compr&#233;hension au cours de sa
lecture, ce que le lecteur souhaite, c&#8217;est une r&#233;ponse rapide et pr&#233;cise, qui interrompe le moins
possible sa lecture et sa concentration.
</p>
<p>Les outils de terminologie en ligne (dictionnaires bilingues, Eurodicautom, etc.) peuvent ap-
porter une aide partielle &#224; notre lecteur. Pour un mot s&#233;lectionn&#233;, ces outils affichent une liste
de traductions possibles. Pourtant, en g&#233;n&#233;ral, ils exigent comme entr&#233;e la forme de citation du
mot, obligeant du coup notre lecteur &#224; davantage de manipulations qu&#8217;il ne le souhaite (de plus,
il n&#8217;est pas difficile d&#8217;imaginer des situations &#8211;ou des langues&#8211; o&#249; le lecteur pourrait &#234;tre en mal
de donner la forme de citation d&#8217;un mot qu&#8217;il ne conna&#238;t pas.). Cependant, le probl&#232;me le plus
s&#233;rieux dans l&#8217;utilisation d&#8217;outils terminologiques en ligne reste celui du bruit. L&#8217;ambigu&#239;t&#233; et
la polys&#233;mie du signe linguistique sont telles qu&#8217;un bon dictionnaire bilingue est susceptible de
contenir plusieurs dizaines de traductions pour un terme donn&#233;. Pour prendre un exemple par-
faitement banal, si notre lecteur s&#233;lectionne le mot school dans la phrase (3), il devra sans doute
passer en revue de tr&#232;s nombreuses traductions avant d&#8217;arriver &#224; celle de banc (de poissons).
</p>
<p>(3) A school of little fishes swam past.
&quot;Un banc de petits poissons passa&quot;
</p>
<p>Certains syst&#232;mes d&#8217;aide terminologique en ligne sont dot&#233;s d&#8217;une interface morphologique, ce
qui dispense l&#8217;usager d&#8217;entrer la forme de citation pour le mot s&#233;lectionn&#233;2. Le probl&#232;me, bien
s&#251;r, est qu&#8217;en dehors de tout contexte la d&#233;composition morphologique surproduit. Ainsi, si
notre lecteur s&#233;lectionne rose dans son article en anglais, il obtiendra une liste de mots com-
prenant aussi bien les traductions du substantif anglais rose que celles du verbe to rise, dont
rose est la forme du pr&#233;t&#233;rit, ainsi que celles de l&#8217;adjectif. Autrement dit, si la pr&#233;sence d&#8217;un
pr&#233;traitement morphologique augmente notablement le confort de l&#8217;usager en rendant superflue
l&#8217;entr&#233;e de la forme de citation, elle peut entra&#238;ner par contre une forte augmentation du bruit,
</p>
<p>1Voir Hutchins (2003) pour une r&#233;flexion sur l&#8217;&#233;tat actuel de la traduction automatique.
2C&#8217;est le cas par exemple du syst&#232;me commercialis&#233; par Babylon Ltd. Le syst&#232;me COMPASS (Breidt &amp;
</p>
<p>Feldweg, 1997), d&#233;velopp&#233; dans le cadre d&#8217;un projet europ&#233;en au d&#233;but des ann&#233;es 90, inclut non seulement une
analyse morphologique, mais &#233;galement une recherche d&#8217;expressions &#224; mots multiples, bas&#233;e sur des automates &#224;
&#233;tats finis. Ce syst&#232;me ne semble pourtant pas avoir &#233;t&#233; d&#233;velopp&#233; au-del&#224; du prototype d&#233;crit dans la r&#233;f&#233;rence
ci-dessus, et il ne nous a pas &#233;t&#233; possible de d&#233;terminer le statut actuel de ce syst&#232;me.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Wehrli
</p>
<p>due au fait que le syst&#232;me de morphologie s&#8217;appliquant hors contexte g&#233;n&#232;re fr&#233;quemment des
formes de citation non pertinentes par rapport au contexte linguistique du mot s&#233;lectionn&#233;.
</p>
<p>C&#8217;est pourtant le traitement des expressions &#224; mots multiples qui constitue le probl&#232;me le plus
s&#233;rieux pour les outils terminologiques en ligne par rapport au besoin d&#8217;assistance &#224; la lecture
en langue &#233;trang&#232;re. D&#8217;une mani&#232;re g&#233;n&#233;rale, en effet, les expressions &#224; mots multiples ne sont
pas trait&#233;es de mani&#232;re ad&#233;quate par ces syst&#232;mes. Bien qu&#8217;un grand nombre de collocations
et d&#8217;expressions idiomatiques figurent dans tout bon dictionnaire bilingue, elles sont souvent
difficiles &#224; localiser, particuli&#232;rement lorsque l&#8217;usager ne s&#233;lectionne qu&#8217;un seul des constituants
de l&#8217;expression.
</p>
<p>3 TWiC
</p>
<p>3.1 Pr&#233;sentation du syst&#232;me
</p>
<p>Le syst&#232;me TWiC (Translation of Words in Context) est un traducteur de mots et d&#8217;expressions
en contexte, qui utilise une analyse syntaxique pour tenter d&#8217;identifier au mieux l&#8217;unit&#233; lexicale
s&#233;lectionn&#233;e et r&#233;duire ainsi le bruit lors de la consultation d&#8217;un lexique bilingue. TWiC se
pr&#233;sente comme un syst&#232;me d&#8217;assistance &#224; la lecture de documents en langue &#233;trang&#232;re sur
Internet3. Lorsqu&#8217;un utilisateur s&#233;lectionne un mot dans un document, TWiC effectue une ana-
lyse syntaxique compl&#232;te et d&#233;taill&#233;e de la phrase dans laquelle figure le mot. Les contraintes
morphologiques et syntaxiques impos&#233;es par cette analyse permettent de lever un grand nombre
d&#8217;ambigu&#239;t&#233;s, dont pratiquement toutes les ambigu&#239;t&#233;s cat&#233;gorielles. De plus, la composante
morphologique du syst&#232;me fournit la forme de citation de l&#8217;unit&#233; lexicale s&#233;lectionn&#233;e. Comme
nous le verrons plus bas, une des caract&#233;ristiques les plus originales de TWiC est sa capa-
cit&#233; &#224; traiter les expressions &#224; mots multiples, que ce soit des mots compos&#233;s, des expressions
idiomatiques ou des collocations4.
</p>
<p>La figure (5) ci-dessous illustre la fen&#234;tre de dialogue lors d&#8217;une utilisation de TWiC pour le
mot natural dans la phrase (4).
</p>
<p>(4) A natural language interface was developed.
&quot;Une interface en langue naturelle a &#233;t&#233; d&#233;velopp&#233;e&quot;
</p>
<p>Plusieurs champs apparaissent dans la fen&#234;tre d&#8217;interface TWiC. Dans la partie sup&#233;rieure,
les champs Selected Word et Base Form correspondent respectivement au mot s&#233;lectionn&#233; par
l&#8217;usager et &#224; la forme de citation calcul&#233;e par le syst&#232;me. Une liste r&#233;duite de traductions est af-
fich&#233;e dans le champ Possible Translations. Les deux champs consacr&#233;s aux expressions &#224; mots
multiples (mots compos&#233;s, expressions idiomatiques et collocations) Idiom or Collocation ne
sont utilis&#233;s que lorsque le syst&#232;me identifie une expression dont le mot s&#233;lectionn&#233; est un des
</p>
<p>3Concr&#232;tement, il prend la forme d&#8217;un &quot;plug-in&quot; pour le butineur Internet Explorer.
4Nous reprenons la partition en trois classes des expressions &#224; mots multiples propos&#233;e par Goldman et al. 2001.
</p>
<p>Bri&#232;vement, les mots compos&#233;s sont des &#233;l&#233;ments de cat&#233;gorie lexicale (nom, verbe, adjectif, adverbe, etc.), dont
toutes les parties sont n&#233;cessairement adjacentes les unes des autres. Les expressions idiomatiques et les colloca-
tions sont des expressions de niveau syntagmatique (groupe verbal, groupe nominal, etc.), dont les constituants ne
sont pas n&#233;cessairement adjacents. Alors que les collocations sont simplement des associations conventionnelles
de termes, les expressions idiomatiques se caract&#233;risent par un certain degr&#233; de figement au plan syntaxique (p.ex.
pas de modification ou d&#8217;extraction possible) et/ou par une certaine opacit&#233; s&#233;mantique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction, traduction de mots, traduction de phrases
</p>
<p>(5) Interface graphique de TWiC :
</p>
<p>constituants. L&#8217;expression source est alors affich&#233;e dans le champ sup&#233;rieur et sa traduction
(expression ou mot simple) appara&#238;t dans le champ inf&#233;rieur. Dans l&#8217;exemple (4), l&#8217;usager a
s&#233;lectionn&#233; le mot natural. TWiC a identifi&#233; ce mot et affiche sa forme de citation natural, ainsi
qu&#8217;une traduction possible naturel. Dans cet exemple, TWiC a identifi&#233; la collocation natural
language pour laquelle il propose la traduction langue naturelle.
</p>
<p>3.2 Architecture du syst&#232;me
</p>
<p>Le syst&#232;me TWiC se compose de plusieurs modules, dont les plus importants sont :
</p>
<p>&#0; L&#8217;extracteur de phrase, qui extrait du document HTML consult&#233; la phrase dans laquelle
figure le mot s&#233;lectionn&#233; par l&#8217;usager. Cette op&#233;ration est r&#233;alis&#233;e sur la base d&#8217;indices
typographiques (p.ex. ponctuation), ainsi que sur la base de balises de mise en page et de
structuration du document.
</p>
<p>&#0; L&#8217;identificateur de langue, qui d&#233;termine la langue de la phrase extraite, sur la base d&#8217;un
syst&#232;me classique de tri-grammes.
</p>
<p>&#0; L&#8217;analyseur linguistique, qui effectue une analyse morpho-syntaxique compl&#232;te et d&#233;-
taill&#233;e de la phrase extraite, de mani&#232;re &#224; identifier l&#8217;unit&#233; lexicale correspondant au mot
s&#233;lectionn&#233; et d&#233;gager ses rapports syntaxiques avec les autres constituants de la phrase.
</p>
<p>&#0; La base de donn&#233;es bilingue, qui sp&#233;cifie les correspondances d&#8217;unit&#233;s lexicales (mots
et expressions &#224; mots multiples).
</p>
<p>&#0; L&#8217;interface graphique, qui affiche les r&#233;sultats de la requ&#234;te.
</p>
<p>C&#8217;est sans aucun doute l&#8217;analyse linguistique qui constitue l&#8217;&#233;l&#233;ment noyau de TWiC, et en fait
son originalit&#233;. L&#8217;analyseur linguistique d&#233;termine l&#8217;unit&#233; lexicale concern&#233;e par la requ&#234;te.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Wehrli
</p>
<p>Les contraintes morphologiques puis syntaxiques appliqu&#233;es par ce dernier ont pour effet de
lever en bonne partie les ambigu&#239;t&#233;s du mot s&#233;lectionn&#233;. Ainsi, d&#8217;une mani&#232;re g&#233;n&#233;rale, les
ambigu&#239;t&#233;s de nature cat&#233;gorielle (est-ce un verbe ou un substantif ?), fr&#233;quentes pour un mot
isol&#233;, disparaissent presque totalement en contexte, r&#233;duisant d&#8217;autant le probl&#232;me du bruit men-
tionn&#233; dans la section pr&#233;c&#233;dente. TWiC utilise l&#8217;analyseur Fips (cf. Wehrli, 1997), configur&#233;
de mani&#232;re &#224; retourner les informations pertinentes pour cette application. Ces informations
sont illustr&#233;es dans la figure (7) pour le mot attempt (tentative) dans la phrase (6) :
</p>
<p>(6) They foiled an attempt.
&quot;Ils ont d&#233;jou&#233; une tentative&quot;
</p>
<p>(7) Analyse morpho-syntaxique :
</p>
<p>Dans cette illustration, la premi&#232;re colonne correspond aux mots de la phrase, la deuxi&#232;me
colonne &#224; l&#8217;&#233;tiquette morpho-syntaxique correspondant au mot, la troisi&#232;me colonne donne
la position du mot dans la phrase (plus pr&#233;cis&#233;ment la position du premier caract&#232;re du mot
s&#233;lectionn&#233;, par rapport au d&#233;but de la phrase). La quatri&#232;me colonne sp&#233;cifie le num&#233;ro de
lex&#232;me (num&#233;ro d&#8217;identification pour la base de donn&#233;es). Enfin, la derni&#232;re colonne men-
tionne, lorsqu&#8217;il y a lieu, l&#8217;appartenance d&#8217;un mot &#224; une expression idiomatique ou &#224; une col-
location. Le num&#233;ro d&#8217;identification de l&#8217;expression est donn&#233; en regard du mot consid&#233;r&#233;
comme t&#234;te de l&#8217;expression (c-&#224;-d. le gouverneur syntaxique), alors que le (ou les) autres mots
participant &#224; l&#8217;expression sont accompagn&#233;s du m&#234;me nombre en valeur n&#233;gative.
</p>
<p>Sur la base de ces renseignements, TWiC peut facilement r&#233;pondre &#224; la requ&#234;te d&#8217;un usager. Le
mot s&#233;lectionn&#233; par l&#8217;usager est rep&#233;r&#233; dans le fichier d&#8217;&#233;tiquettes sur la base de la position du
curseur. L&#8217;analyseur a identifi&#233; le lex&#232;me le plus appropri&#233; &#233;tant donn&#233; le contexte syntaxique.
Ce lex&#232;me donne donc la forme de r&#233;f&#233;rence, qui sert &#233;galement de cl&#233; de recherche pour les
correspondances bilingues. Si l&#8217;analyseur a identifi&#233; une expression, le num&#233;ro d&#8217;identification
de cette derni&#232;re sert &#224; la recherche d&#8217;un &#233;quivalent cible dans le dictionnaire bilingue.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction, traduction de mots, traduction de phrases
</p>
<p>3.3 Traduction d&#8217;expressions
</p>
<p>Il est important de noter qu&#8217;un traitement ad&#233;quat des expressions &#224; mots multiples ne peut
se satisfaire d&#8217;un traitement superficiel de la phrase. Au contraire, il pr&#233;suppose une analyse
compl&#232;te et particuli&#232;rement fine, capable d&#8217;identifier et d&#8217;interpr&#233;ter des &#233;l&#233;ments extrapos&#233;s,
comme par exemple les constituants-wh des constructions relatives, les constituants sujets des
constructions passives, etc. Ainsi, dans l&#8217;exemple (8) ci-dessous, l&#8217;identification de la colloca-
tion break-record (battre-record) passe-t-elle par (i) la reconnaissance d&#8217;une structure relative,
dont le pronom (which) reprend le substantif records, (ii) l&#8217;interpr&#233;tation de ce pronom comme
sujet de la relative, (iii) l&#8217;identification d&#8217;une structure passive, avec pour corollaire le fait que
le sujet apparent est interpr&#233;t&#233; comme objet direct du verbe break. C&#8217;est bien cette s&#233;quence
d&#8217;&#233;v&#233;nements que l&#8217;analyseur construit pour obtenir la structure syntaxique donn&#233;e en (8b).
</p>
<p>(8)a. Several of the records which were broken during the last Olympic games were at least
two-years old.
&quot;Plusieurs des records qui ont &#233;t&#233; battus lors des derniers Jeux Olympiques dataient d&#8217;au
moins deux ans.&quot;
</p>
<p>b. [
TP
</p>
<p>[
DP
</p>
<p>several [
PP
</p>
<p>of [
DP
</p>
<p>records
&#0;
</p>
<p>[
CP
</p>
<p>which
&#0;
</p>
<p>[
TP
[
DP
</p>
<p>e]
&#0;
</p>
<p>were [
VP
</p>
<p>broken [
DP
</p>
<p>e]
&#0;
</p>
<p>[
PP
</p>
<p>during the last Olympic games ] ] ] ] ] ] were [
VP
</p>
<p>e [
FP
</p>
<p>at least two-years old ] ] ] ]
</p>
<p>(9) Exemple d&#8217;une collocation avec extraposition d&#8217;un des termes :
</p>
<p>Les avantages procur&#233;s par la normalisation des structures qu&#8217;effectue un analyseur syntaxique
&quot;profond&quot; appara&#238;t clairement dans de tels exemples. Cette normalisation permet d&#8217;identifier
sans risque d&#8217;erreur des collocations (ou des expressions idiomatiques), m&#234;me lorsque les
constituants de ces expressions apparaissent dans un ordre autre que l&#8217;ordre canonique et &#224;
une certaine distance l&#8217;un de l&#8217;autre.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Wehrli
</p>
<p>3.4 Traduction de phrases
</p>
<p>L&#8217;objectif principal de TWiC est d&#8217;apporter une assistance terminologique contextuelle, comme
nous l&#8217;avons montr&#233; dans les sections ci-dessus. On ne peut exclure, cependant, qu&#8217;occa-
sionnellement cette assistance ne s&#8217;av&#232;re insuffisante pour la compr&#233;hension globale d&#8217;une
phrase, et que le lecteur souhaite dans ce cas une traduction compl&#232;te de la phrase. C&#8217;est pour
satisfaire ce besoin que l&#8217;interface graphique de TWiC comprend une fonctionnalit&#233; traduction
de phrases, qui permet de d&#233;clencher la traduction de la phrase dans laquelle l&#8217;usager a s&#233;lec-
tionn&#233; un mot. L&#8217;activation du moteur de traduction est effectu&#233;e au moyen de la commande
Translate Sentence (&quot;Traduire phrase&quot;) et ouvre une nouvelle interface graphique, illustr&#233;e dans
la figure ci-dessous pour la phrase (1), reprise en (10) :
</p>
<p>(10) A segment of the Latin-American left still hankers after revolution.
&quot;Un segment de la gauche latine-am&#233;ricaine aspire encore &#224; la r&#233;volution&quot;.
</p>
<p>(11) Exemple d&#8217;une traduction de phrase :
</p>
<p>La traduction de phrases propos&#233;e par TWiC utilise une version r&#233;vis&#233;e du syst&#232;me Its-2 (cf.
Wehrli, 1998), qui reprend l&#8217;analyse syntaxique effectu&#233;e pour la traduction du mot s&#233;lectionn&#233;.
M&#234;me si ce traducteur utilise un moteur syntaxique plus &#233;labor&#233; que ses concurrents commer-
ciaux, il souffre essentiellement des m&#234;mes lacunes que ces derniers. Cette fonctionnalit&#233; est
donc &#224; utiliser avec beaucoup de r&#233;serves.
</p>
<p>4 Conclusion
</p>
<p>L&#8217;assistance terminologique pour la lecture en ligne de documents en langue &#233;trang&#232;re est un
besoin reconnu, qui va tr&#232;s certainement s&#8217;amplifier encore avec la multiplication rapide et
l&#8217;usage croissant de la documentation en ligne. Un tel syst&#232;me n&#8217;entend pas concurrencer la
traduction automatique mais bien combler un besoin nouveau cons&#233;quence du &quot;village multi-
lingue&quot;. L&#8217;id&#233;e majeure pr&#233;sent&#233;e dans cet article est celle de soumettre &#224; une analyse linguis-
tique &quot;profonde&quot; la phrase enti&#232;re dans laquelle un usager a s&#233;lectionn&#233; un terme, pr&#233;alable-
ment &#224; la recherche terminologique. Le recours &#224; une telle analyse pr&#233;sente en effet de nom-
breux avantages : lemmatisation (analyse / d&#233;coupage morphologique), lev&#233;e d&#8217;un grand nom-
bre d&#8217;ambigu&#239;t&#233;s (de nature cat&#233;gorielle ou morphologique) et surtout capacit&#233; &#224; reconna&#238;tre
l&#8217;appartenance du terme s&#233;lectionn&#233; &#224; une expression fig&#233;e ou &#224; une collocation, ind&#233;pendam-
ment de l&#8217;ordre relatif ou de l&#8217;&#233;loignement des constituants de l&#8217;expression. Enfin, l&#8217;analyse</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction, traduction de mots, traduction de phrases
</p>
<p>linguistique constitue une &#233;tape cruciale pour la traduction de la phrase compl&#232;te, au cas o&#249;
l&#8217;usager le demanderait.
</p>
<p>A l&#8217;heure actuelle, une version de TWiC existe pour les paires de langues anglais-fran&#231;ais et
fran&#231;ais-anglais, utilisant une base de donn&#233;es bilingue de plus de 50&#8217;000 entr&#233;es, dont environ
3000 collocations et expressions idiomatiques. Une version allemand-fran&#231;ais est en d&#233;veloppe-
ment.
</p>
<p>Remerciements
</p>
<p>Plusieurs collaborateurs du LATL ont particip&#233; &#224; l&#8217;&#233;laboration de composantes du syst&#232;me
TWiC, en particulier Violeta Seretan et Luka Nerima, que je tiens &#224; remercier ici. Mes remer-
ciements &#233;galement &#224; la fondation Boninchi, pour son g&#233;n&#233;reux soutien. L&#8217;interface graphique
de TWiC pour Internet Explorer a &#233;t&#233; r&#233;alis&#233;e en collaboration avec la soci&#233;t&#233; Oberon Micro-
systems SA (http://www.oberon.ch).
</p>
<p>Bibliographie
</p>
<p>BREIDT, E. &amp; H. FELDWEG (1997), &quot;Accessing Foreign Languages with COMPASS&quot;, Ma-
chine Translation 12, 153-174.
</p>
<p>HUTCHINS, J. (2003), &quot;Has machine translation improved? Some historical comparisons&quot;,
actes de la conf&#233;rence MT Summit IX, New Orleans, 181-188.
</p>
<p>GOLDMAN, J.-P., L. NERIMA &amp; E. WEHRLI (2001), &quot;Collocation Extraction Using a Syn-
tactic Parser&quot;, actes de la conf&#233;rence ACL-2001, 61-66.
</p>
<p>MCLUHAN, M. (1967), The Gutenberg Galaxy : The Making of Typographic Man, London,
Routledge &amp; Kegan Paul.
</p>
<p>WEHRLI, E. (1997), L&#8217;analyse syntaxique des langues naturelles : Probl&#232;mes et m&#233;thodes,
Paris, Masson.
</p>
<p>WEHRLI, E. (1998), &quot;Translating Idioms&quot;, actes de la conf&#233;rence COLING-98, Montr&#233;al,
1388-1392.
</p>
<p>WEHRLI, E. (2003), &quot;Translation of words in context&quot;, actes de la conf&#233;rence MT Summit IX,
New Orleans, 502-504.</p>

</div></div>
</body></html>