<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction d&#8217;information en domaine restreint pour la g&#233;n&#233;ration multilingue de r&#233;sum&#233;s cibl&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Extraction d&#8217;information en domaine restreint pour la
g&#233;n&#233;ration multilingue de r&#233;sum&#233;s cibl&#233;s
</p>
<p>Caroline Brun, Caroline Hag&#232;ge
Xerox Research Centre Europe
</p>
<p>6, chemin de Maupertuis
38240 Meylan France
</p>
<p>Caroline.Brun@xrce.xerox.com Caroline.Hagege@xrce.xerox.com
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans cet article nous pr&#233;sentons une application de g&#233;n&#233;ration de r&#233;sum&#233;s multilingues cibl&#233;s
&#224; partir de textes d&#8217;un domaine restreint. Ces r&#233;sum&#233;s sont dits cibl&#233;s car ils sont produits
d&#8217;apr&#232;s les sp&#233;cifications d&#8217;un utilisateur qui doit d&#233;cider a priori du type de l&#8217;information qu&#8217;il
souhaite voir appara&#238;tre dans le r&#233;sum&#233; final. Pour mener &#224; bien cette t&#226;che, nous effectuons
dans un premier temps l&#8217;extraction de l&#8217;information sp&#233;cifi&#233;e par l&#8217;utilisateur. Cette information
constitue l&#8217;entr&#233;e d&#8217;un syst&#232;me de g&#233;n&#233;ration multilingue qui produira des r&#233;sum&#233;s normalis&#233;s
en trois langues (anglais, fran&#231;ais et espagnol) &#224; partir d&#8217;un texte en anglais.
</p>
<p>We present an application of oriented multilingual summarization from domain specific texts.
These summaries are oriented because the user has to define in a first step the kind of informa-
tion he/she wants to be present in the final summary. In order to acheive this task, a first step of
information extraction is performed. This extracted information which corresponds to the user&#8217;s
specification is then the input of a multilingual generator that produces the desired summaries
in three languages (english, french and spanish) from an english input text.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>R&#233;sum&#233; multilingue cibl&#233;, extraction d&#8217;information, g&#233;n&#233;ration multilingue.
Multilingual oriented summaries, information extraction, multilingual generation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge
</p>
<p>Introduction
</p>
<p>Dans cet article nous pr&#233;sentons une m&#233;thode et un prototype qui montrent comment extraire
de l&#8217;information &#224; partir de textes tout venant appartenant au domaine de la chimie et comment
g&#233;n&#233;rer des r&#233;sum&#233;s multilingues. Les r&#233;sum&#233;s que nous obtenons sont dits cibl&#233;s dans la
mesure o&#249; ils ne s&#8217;attachent qu&#8217;&#224; exprimer de l&#8217;information que l&#8217;utilisateur aura pr&#233;alablement
d&#233;finie. Il ne s&#8217;agit donc pas ici de r&#233;sum&#233; au sens habituel du terme puisqu&#8217;un texte qui ne
contiendra pas l&#8217;information que nous souhaitons extraire ne donnera aucune sortie alors qu&#8217;un
texte contenant exclusivement de l&#8217;information que nous voulons extraire produira en sortie un
autre texte dans lequel l&#8217;int&#233;gralit&#233; de cette information sera reprise et reformul&#233;e. L&#8217;exp&#233;rience
que nous avons men&#233;e s&#8217;appuie sur un ensemble de textes d&#233;crivant des produits toxiques (voir
section 1.1). Dans une premi&#232;re &#233;tape, les documents sont analys&#233;s, produisant en sortie une
repr&#233;sentation normalis&#233;e de l&#8217;information consid&#233;r&#233;e comme pertinente par l&#8217;utilisateur. Dans
une deuxi&#232;me &#233;tape, cette information normalis&#233;e sert de base &#224; un syst&#232;me de g&#233;n&#233;ration qui
produit en sortie un ensemble de textes en trois langues (fran&#231;ais, espagnol et anglais) g&#233;n&#233;r&#233;s
en parall&#232;le et exprimant en langue naturelle l&#8217;information normalis&#233;e extraite du texte initial.
Apr&#232;s une premi&#232;re partie pr&#233;sentant le corpus sur lequel nous avons travaill&#233;, nous expliquons
la mani&#232;re dont nous extrayons l&#8217;information normalis&#233;e &#224; partir des textes. C&#8217;est sur ce point
essentiel que l&#8217;approche que nous pr&#233;sentons ici se distingue de celle propos&#233;e par (Lenci et
al. 2002) qui produit des r&#233;sum&#233;s multilingues &#224; partir de requ&#234;tes d&#8217;un utilisateur faites sur
un texte. En effet, la s&#233;lection des phrases pertinentes dans l&#8217;approche de (Lenci et al. 2002)
n&#8217;inclue pas l&#8217;&#233;tape de normalisation lexicale et syntaxique que nous pr&#233;senterons plus avant et
qui nous permettra de normaliser en une repr&#233;sentation similaire des expressions linguistiques
v&#233;hiculant un sens proche, m&#234;me si ces expressions ont une r&#233;alisation tr&#232;s diff&#233;rente dans les
textes. La deuxi&#232;me partie d&#233;crit comment l&#8217;information normalis&#233;e extraite en premi&#232;re partie
est utilis&#233;e pour g&#233;n&#233;rer les r&#233;sum&#233;s multilingues. Enfin, dans la mesure o&#249; les textes r&#233;sum&#233;s
produits sont &#233;crits en langue naturelle, on peut les comparer avec le texte initial, ce qui permet
d&#8217;&#233;valuer de mani&#232;re plus simple l&#8217;extraction cibl&#233;e d&#8217;information.
</p>
<p>1 Extraction d&#8217;information cibl&#233;e
</p>
<p>1.1 Carat&#233;ristiques du corpus
</p>
<p>Le corpus sur lequel nous travaillons fait partie du domaine de la chimie pour un usage grand-
public. Il est compos&#233; d&#8217;un ensemble de textes en anglais provenant de l&#8217;ATSDR (Agency of
Toxic Substance and Disease Registry). Ces textes sont des paragraphes contenant en moyenne
six &#224; sept phrases d&#8217;une collection qui pr&#233;sente des produits toxiques, leur provenance, leurs
caract&#233;ristiques, leur utilisation, leurs effets, etc. L&#8217;information v&#233;hicul&#233;e par ces textes est
relativement homog&#232;ne et ces textes pr&#233;sentent de nombreuses reformulations et paraphrases.
</p>
<p>Par exemple, dans les textes concernant respectivement l&#8217;ac&#233;tone et l&#8217;acrol&#233;&#239;ne les propri&#233;t&#233;s
physiques de ces produits, qui sont pratiquement identiques, sont cependant exprim&#233;es de
mani&#232;re tr&#232;s diff&#233;rente :
</p>
<p>It evaporates easily, is flammable, and dissolves in water. (texte sur l&#8217;ac&#233;tone)
It dissolves in water very easily and quickly, changes to a vapor when heated. It also burns
easily. (texte sur l&#8217;acrol&#233;&#239;ne)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;information en domaine restreint pour la g&#233;n&#233;ration multilingue de
r&#233;sum&#233;s cibl&#233;s
</p>
<p>De plus nous pouvons trouver dans le m&#234;me texte des redondances, par exemple dans le texte
d&#233;crivant le 2-Butanone :
It is also present in the environment from natural sources.
et plus loin :
2-Butanone occurs as a natural product.
</p>
<p>L&#8217;un des enjeux de notre normalisation est d&#8217;obtenir une repr&#233;sentation uniforme &#224; partir de ces
expressions linguistiques v&#233;hiculant un sens tr&#232;s proche.
</p>
<p>1.2 Normalisation d&#8217;information cibl&#233;e
</p>
<p>Dans un premier temps nous avons s&#233;lectionn&#233; l&#8217;information que nous souhaitons extraire &#224; par-
tir de ces textes. Cette information concerne l&#8217;aspect, les propri&#233;t&#233;s physiques, les synonymes,
l&#8217;utilisation et l&#8217;origine de ces produits. Notre but est de produire une repr&#233;sentation normalis&#233;e
de toute l&#8217;information concernant ces th&#232;mes et v&#233;hicul&#233;e dans les textes par des expressions
linguistiques vari&#233;es.
</p>
<p>Les pr&#233;dicats ci-dessous sont utilis&#233;s pour la repr&#233;sentation normalis&#233;e :
</p>
<p>&#0; DESCRIPTION_NATURE/2. Ce pr&#233;dicat est instanci&#233; lorsque dans le texte la nature du pro-
duit est sp&#233;cifi&#233;e. Par exemple, DESCRIPTION_NATURE(ammonia,gas) est obtenu &#224; partir
de toute expression linguistique v&#233;hiculant l&#8217;information que le produit chimique ammo-
niaque est un gaz.
</p>
<p>&#0; DESCRIPTION_COLOUR/2. Ce pr&#233;dicat est instanci&#233; par des expressions linguistiques
indiquant la couleur du produit. Par exemple, DESCRIPTION_COLOUR(antimony,silvery-
white) indique que l&#8217;antimoine est un produit blanc-argent&#233;.
</p>
<p>&#0; DESCRIPTION_SMELL/2. Ce pr&#233;dicat est instanci&#233; lorsque dans le texte l&#8217;odeur du produit
chimique est indiqu&#233;e, i.e. DESCRIPTION_SMELL(1,3-butadiene,gasoline-like).
</p>
<p>&#0; SYNONYM/2. Ce pr&#233;dicat &#224; deux arguments lorsqu&#8217;il est instanci&#233; donne le synonyme du
produit d&#233;crit par l&#8217;article, i.e. SYNONYM(acetone,dimethyl ketone).
</p>
<p>&#0; PROPERTY/5. Le pr&#233;dicat PROPERTY est le r&#233;sultat de la normalisation d&#8217;expressions
linguistiques qui d&#233;crivent une propri&#233;t&#233; physique ou chimique du produit. Par exemple
PROPERTY(acrolein,dissolve,water,in,NONE)1 nous indique que l&#8217;acrole&#239;ne est soluble dans
l&#8217;eau (instantiation des quatre premiers arguments du pr&#233;dicat). Le dernier argument du
pr&#233;dicat est repr&#233;sent&#233; ici par une variable car dans le texte initial la mani&#232;re dont se
produit la dissolution n&#8217;est pas sp&#233;cifi&#233;e dans le texte. Dans d&#8217;autres cas, il sera possible
de trouver des variables sur les arguments portant l&#8217;information sur la localisation de la
propri&#233;t&#233;. Par exemple, PROPERTY(acrolein,burn,NONE,NONE,easily) est obtenu apr&#232;s le
traitement du texte sur l&#8217;acrole&#239;ne dans lequel il est seulement indiqu&#233; que ce produit est
facilement inflammable.
</p>
<p>&#0; ORIGIN/5. Ce pr&#233;dicat instanci&#233; contient de l&#8217;information sur l&#8217;origine du produit. Par
exemple, ORIGIN(ammonia,manufactured,NONE,NONE,NONE) exprime que l&#8217;ammoniaque
est un produit fabriqu&#233; par l&#8217;homme et ORIGIN(amonnia,natural,soil,in,bacteria) exprime que
</p>
<p>1La pr&#233;position est conserv&#233;e dans ce pr&#233;dicat car elle est utilis&#233;e dans la phase de g&#233;n&#233;ration.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge
</p>
<p>ce m&#234;me produit est &#233;galement un produit naturel produit par des bact&#233;ries et que l&#8217;on
peut trouver dans le sol.
</p>
<p>&#0; USE/6 est le r&#233;sultat de la normalisation de texte exprimant l&#8217;utilisation du produit chim-
ique d&#233;crit. Par exemple, USE(benzidine,NONE,NONE,produce,dye,before) exprime que la
benzidine &#233;tait utilis&#233;e dans le pass&#233; (dernier argument) pour produire de la teinture
(4eme et 5eme arguments) et USE(ammonia,smelling_salts,in,NONE,NONE,now) indique que
l&#8217;ammoniaque est utilis&#233;e actuellement (dernier argument) dans des sels (2eme et 3eme
arguments) dans un but non sp&#233;cifi&#233; (arguments variables).
</p>
<p>A tout ces pr&#233;dicats peut &#234;tre ajout&#233; le suffixe _NEG lorsque les expressions linguistiques ayant
permis leur instanciation sont ni&#233;es.
</p>
<p>1.3 Mise en oeuvre
</p>
<p>Le syst&#232;me d&#8217;extraction d&#8217;information cibl&#233;e prend en entr&#233;e un texte d&#233;crivant un produit
toxique et donne en sortie un ensemble de pr&#233;dicats totalement ou partiellement instanci&#233;s. Le
traitement s&#8217;effectue gr&#226;ce &#224; un seul outil, XIP (A&#239;t-Mokhtar et al. 2002) qui prend en charge
toutes les &#233;tapes du traitement, de la segmentation du texte &#224; la production des pr&#233;dicats. Ce
traitement s&#8217;effectue selon deux axes d&#233;crits ci-dessous.
</p>
<p>1.3.1 Analyse morpho-syntaxique normalis&#233;e robuste
</p>
<p>Cette phase d&#8217;analyse consiste en une analyse grammaticale en d&#233;pendance, analyse qui est
normalis&#233;e en utilisant des propri&#233;t&#233;s de la morphologie d&#233;rivationnelle (&#233;quivalence entre
noms et verbes de m&#234;me famille morphologique), des propri&#233;t&#233;s de structures syntaxiques
(l&#8217;&#233;quivalence passive-active, alternances verbales), de l&#8217;analyse syntaxique profonde (r&#233;cup&#233;ra-
tion des sujet des infinitives). Pour plus de d&#233;tail sur l&#8217;analyse syntaxique normalis&#233;e robuste
voir (Hag&#232;ge, Roux, 2003). A la sortie de cette &#233;tape, une expression comme Antimony is mixed
with other metals est repr&#233;sent&#233;e comme suit :
SUBJ-N(mix,SOMEONE)
</p>
<p>OBJ-N(mix,Antimony)
</p>
<p>OBJ-N(mix,metal)
</p>
<p>Cette repr&#233;sentation signifie que l&#8217;action est port&#233;e par le lemme mix, que le sujet normalis&#233; de
ce verbe est non sp&#233;cifi&#233; et que ce verbe a deux objets normalis&#233;s repr&#233;sent&#233;s respectivement
par les lemmes Antimony et metal. Il faut &#233;galement noter que pour cette analyse, l&#8217;unit&#233; de
traitement fournie &#224; l&#8217;analyseur n&#8217;est pas la phrase, mais un paragraphe complet d&#233;crivant le
m&#234;me produit.
</p>
<p>1.3.2 Traitement orient&#233; par l&#8217;application et le domaine
</p>
<p>A l&#8217;&#233;tape d&#8217;analyse normalis&#233;e et g&#233;n&#233;rale mentionn&#233;e au point pr&#233;c&#233;dent vient se greffer une
analyse d&#233;pendante du domaine et de l&#8217;application. Ce traitement est imbriqu&#233; dans le pr&#233;c&#233;dent
&#224; plusieurs niveaux du traitement.
</p>
<p>R&#233;gles de segmentation sp&#233;cifiques: Les cha&#238;nes de caract&#232;res d&#233;signant les entit&#233;s chimiques
peuvent pr&#233;senter des caract&#232;res qui sont habituellement consid&#233;r&#233;s comme des s&#233;parateurs</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;information en domaine restreint pour la g&#233;n&#233;ration multilingue de
r&#233;sum&#233;s cibl&#233;s
</p>
<p>dans la langue standard (i.e. 2,3-Benzofuran). Afin de pallier ce probl&#232;me nous avons &#233;labor&#233;
des r&#232;gles locales sp&#233;cifiques qui s&#8217;appliquent sur le texte segment&#233; et analys&#233; morphologique-
ment.
</p>
<p>R&#232;gles de d&#233;sambigu&#305;isation sp&#233;cifiques: Dans la mesure o&#249; nous travaillons dans un domaine
particulier, certaines des ambigu&#239;t&#233;s pouvant appara&#238;tre dans la langue g&#233;n&#233;rale n&#8217;existent plus
dans ce contexte. Par exemple, le mot sharp peut &#234;tre a priori un nom (di&#232;se) ou un adjectif
(piquant, pointu). Or dans le contexte de la chimie, nous pouvons rejeter l&#8217;&#233;tiquette nom pour
cette suite de caract&#232;res et ne consid&#233;rer que l&#8217;&#233;tiquette adjectif. Ces r&#232;gles sp&#233;cifiques viennent
s&#8217;appliquer juste avant l&#8217;application des r&#232;gles d&#8217;&#233;tiquettage pour la grammaire g&#233;n&#233;rale.
</p>
<p>Ajout d&#8217;information de s&#233;mantique lexicale: Pour les besoins de l&#8217;application, nous avons
typ&#233; &#224; l&#8217;aide de traits des &#233;l&#233;ments du lexique tels que les &#233;l&#233;ments chimiques, les noms de
couleur les plus courants, etc.
</p>
<p>Meilleur traitement de la coordination: Le corpus contient de longues cha&#238;nes d&#8217;&#233;l&#233;ments
coordonn&#233;s et particuli&#232;rement des coordinations dans lesquelles le dernier &#233;l&#233;ment coordonn&#233;
est pr&#233;c&#233;d&#233; par une virgule et une conjonction de coordination. Connaissant cette caract&#233;ristique
et tirant parti de l&#8217;information de s&#233;mantique lexicale suppl&#233;mentaire rajout&#233;e sur certaines
entr&#233;es, la coordination est trait&#233;e avec d&#8217;avantage de pr&#233;cision.
</p>
<p>R&#233;solution d&#8217;anaphore ad-hoc: Le corpus sur lequel nous travaillons pr&#233;sente une particu-
larit&#233; int&#233;ressante qui est celle de ne poser aucun probl&#232;me pour la r&#233;solution des anaphores
pronominales. On peut, avec une marge d&#8217;erreur extr&#234;mement faible consid&#233;rer que tous les
pronoms it et tous les possessifs r&#233;f&#232;rent &#224; l&#8217;entit&#233; chimique d&#233;crite dans le texte.
</p>
<p>Relations lexico-structurales adapt&#233;es au domaine: Afin de pouvoir obtenir une m&#234;me repr&#233;sen-
tation pour des expressions linguistiques &#233;quivalentes nous avons &#233;tabli des relations lexico-
structurales entre des &#233;l&#233;ments du lexique puis nous avons cr&#233;e des r&#232;gles qui exploitent ces
relations nous permettent d&#8217;obtenir une repr&#233;sentation normalis&#233;e.
</p>
<p>Ainsi, nous voulons pouvoir relier l&#8217;adjectif flammable et le verbe burn et dire que si l&#8217;adjectif
modifie un nom d&#8217;entit&#233; chimique, alors la propri&#233;t&#233; physique de cet entit&#233; est port&#233;e par le
verbe burn. Une relation de m&#234;me type que celle existant entre flammable et burn existe entre
soluble et dissolve, volatile et evaporate etc.
</p>
<p>Nous avons cr&#233;e de mani&#232;re d&#233;clarative des relations entre ces paires de mots, et ces relations
pourront &#234;tre exploit&#233;e par notre syst&#232;me au m&#234;me titre que des relations de d&#233;pendances qui
auront &#233;t&#233; calcul&#233;es lors du traitement.
</p>
<p>Les relations que nous avons cr&#233;ees sont les suivantes:
</p>
<p>&#0; ISAJ lie un adjectif et un verbe lorsque le verbe peut &#234;tre paraphras&#233; par BE+adjective
(ex. ISAJ(soluble,dissolve) ).
</p>
<p>&#0; TURNTO lie un nom et un verbe lorsque le verbe peut &#234;tre paraphras&#233; par TURN TO+noun
( ex. TURNTO(liquid,liquefy) ).
</p>
<p>&#0; HASN lie un nom et un verbe lorsque le verbe peut &#234;tre paraphras&#233; par HAVE+noun ( ex.
TURNTO(dissolve,solubility)).
</p>
<p>&#0; SYNO lie deux mots de m&#234;me cat&#233;gorie morpho-syntaxique quand le premier est syn-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge
</p>
<p>onyme du second2.
</p>
<p>r&#232;gles de normalisation: Les relations mentionn&#233;es ci-dessus sont ensuite exploit&#233;es par des
r&#232;gles XIP. Ces r&#232;gles exploitent &#224; la fois des relations de d&#233;pendances syntaxiques normalis&#233;es
et des relations de mise en correspondance permettant ainsi de d&#233;duire de nouvelles relations.
</p>
<p>Ainsi, on peut d&#233;duire &#224; partir de l&#8217;expression linguistique aniline is soluble le pr&#233;dicat PROP-
ERTY(aniline,dissolve,NONE,NONE,NONE) sachant que :
une relation syntaxique ATTRIB(aniline,soluble) a &#233;t&#233; calcul&#233;e par l&#8217;analyseur,
il existe une relation lexicale ISAJ(soluble,dissolve),
le lemme dissolve porte un trait indiquant qu&#8217;il s&#8217;agit d&#8217;une verbe exprimant une propri&#233;t&#233;
physique.
</p>
<p>En conclusion de cette section, nous avons montr&#233; comment en &#233;tendant un analyseur synta-
xique normalis&#233;, nous sommes capable de normaliser de l&#8217;information cibl&#233;e &#224; partir de textes.
La section suivante montre comment &#224; partir de cette information normalis&#233;e l&#8217;on peut g&#233;n&#233;rer
des textes exprimant dans trois langues diff&#233;rentes le contenu informatif extrait.
</p>
<p>2 G&#233;n&#233;ration
</p>
<p>Comme &#233;voqu&#233; dans l&#8217;introduction de l&#8217;article, les r&#233;sultats de la phase d&#8217;analyse, c&#8217;est-&#224;-dire
une liste de pr&#233;dicats &#8220;s&#233;mantiques&#8221;, sont utilis&#233;s comme source d&#8217;information d&#8217;un g&#233;n&#233;rateur
qui d&#233;livre des versions normalis&#233;es des textes analys&#233;s.
</p>
<p>A cette fin, nous utilisons un syst&#232;me de r&#233;daction assist&#233;e de document, MDA (Multilingual
Document Authoring), pour lequel une grammaire sp&#233;cifique est d&#233;velopp&#233;e. MDA est un
syst&#232;me de g&#233;n&#233;ration interactif: l&#8217;utilisateur de ce syst&#232;me sp&#233;cifie interactivement le contenu
du document jusqu&#8217;a sa compl&#233;tion.
</p>
<p>Cependant, dans le contexte du travail pr&#233;sent&#233; dans cet article, MDA est utilis&#233; comme un sys-
t&#232;me de g&#233;n&#233;ration automatique(Reiter, Dale, 2000), car l&#8217;information n&#233;cessaire &#224; la produc-
tion des documents est automatiquement d&#233;riv&#233;e &#224; partir des corpus analys&#233;s. Ainsi, l&#8217;intervention
de l&#8217;utilisateur n&#8217;est plus n&#233;cessaire.
</p>
<p>Apr&#233;s une br&#232;ve pr&#233;sentation du syst&#232;me, nous montrons comment ce dernier est utilis&#233; pour
produire des versions normalis&#233;es des textes du corpus initial.
</p>
<p>2.1 Pr&#233;sentation du syst&#233;me MDA
</p>
<p>MDA est un syst&#232;me interactif pour l&#8217;aide &#224; la r&#233;daction de documents contr&#244;l&#233;s multilingues
ou monolingues. La structure de ces documents ainsi que leur coh&#233;rence s&#233;mantique sont sous
le contr&#244;le du syst&#234;me. Lorsqu&#8217;un seul choix ne m&#232;ne pas &#224; un document valide, le syst&#232;me met
automatiquement &#224; jour le document en g&#233;n&#233;rant le texte appropri&#233; : dans un syst&#232;me comme
MDA, la g&#233;n&#233;ration automatique est un effet de bord de la r&#233;daction assist&#233;e.
</p>
<p>Cet outil &#233;tend la syntaxe conventionnelle d&#8217;&#233;diteurs SGML ou XML, car les choix s&#233;mantiques
</p>
<p>2Dans la mesure o&#249; nous travaillons dans un domaine restreint, l&#8217;ambiguit&#233; s&#233;mantique ne pose ici pas de
probl&#232;me.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;information en domaine restreint pour la g&#233;n&#233;ration multilingue de
r&#233;sum&#233;s cibl&#233;s
</p>
<p>peuvent s&#8217;appliquer jusqu&#8217;au niveau des unit&#233;s lexicales. De plus, le syst&#232;me permet de sp&#233;-
cifier des d&#233;pendances entre des parties distantes du document : ainsi, une modification dans
une partie donn&#233;e du document peut-&#234;tre refl&#233;t&#233;e dans une autre partie, physiquement &#233;loign&#233;e
(d&#233;pendances &#224; longue distance).
</p>
<p>Le contenu du document est d&#233;crit par un formalisme grammatical appel&#233; &#8220;grammaires d&#8217;interaction&#8221;
(GI), qui est d&#233;riv&#233; des grammaires &#224; clauses d&#233;finies de Prolog. Nous renvoyons &#224; (Brun,
Dymetman, 2002), qui donne une description d&#233;taill&#233;e du syst&#232;me et de ses applications. En
particulier la syntaxe des r&#232;gles GI est d&#233;finie dans cet article.
</p>
<p>2.2 G&#233;n&#233;ration automatique de textes normalis&#233;s
</p>
<p>Afin de g&#233;n&#233;rer les textes cibles, nous avons d&#233;velopp&#233; une grammaire GI qui couvre la structure
et le contenu de cette classe de document. Le d&#233;veloppement est r&#233;alis&#233; en deux &#233;tapes :
</p>
<p>&#0; d&#233;veloppement de la grammaire de &#8220;r&#233;alisation&#8221;: ce premier ensemble de r&#232;gles permet la
r&#233;alisation linguistique des diff&#233;rents concepts couverts par le corpus. Ces r&#232;gles visent
&#224; produire un court paragraphe dont le but de communication est la description d&#8217;une
substance toxique (en particulier de quelle substance il s&#8217;agit, quelles sont ses caract&#233;ris-
tiques et propri&#233;t&#233;s physiques, quelle est son origine, quels sont ses synonymes, pourquoi
est-elle utilis&#233;e).
</p>
<p>Comme mentionn&#233; dans la section 1.1, l&#8217;&#233;tude du corpus a mis en &#233;vidence des ensem-
bles de paraphrases qui v&#233;hiculent le m&#234;me sens. Nous avons donc choisi comme unit&#233;s
linguistiques &#224; g&#233;n&#233;rer ce qui nous semblait les r&#233;alisations les plus appropri&#233;es d&#8217;un en-
semble de paraphrases d&#8217;un m&#234;me concept. Nous avons s&#233;lectionn&#233; les expressions les
plus fr&#233;quentes apparaissant dans le corpus de d&#233;veloppement. Par exemple, une phrase
comme It is flammable pr&#233;sente dans le corpus sera normalis&#233;e en It burns easily dans le
texte g&#233;n&#233;r&#233;.
</p>
<p>&#0; d&#233;veloppement de la grammaire sp&#233;cifique au domaine : le second ensemble de r&#232;gles
encode la connaissance li&#233;e au domaine de l&#8217;application, dans notre cas il s&#8217;agit des dif-
f&#233;rentes caract&#233;ristiques de la substance toxique. Cet ensemble de r&#232;gles peut se com-
parer &#224; une base de connaissance (Dymetman2002) et m&#234;me s&#8217;il est limit&#233; par le nombre
de substances d&#233;crites dans le corpus, il est a priori illimit&#233;.
</p>
<p>Lors des exp&#233;riences ant&#233;rieures r&#233;alis&#233;es dans le cadre de MDA, le d&#233;veloppement de r&#232;gles
&#233;tait compl&#232;tement manuel. Dans le cas de cette exp&#233;rience, nous utilisons une m&#233;thode au-
tomatique d&#8217;extraction et de normalisation de la connaissance : les r&#233;sultats de ce processus
sont automatiquement convertis en un ensemble de r&#232;gles de grammaires qui d&#233;crivent la con-
naissance li&#233;e au domaine.
</p>
<p>De plus, ces grammaires ont la particularit&#233; de n&#8217;associer qu&#8217;un seul document &#224; une substance
toxique donn&#233;e : l&#8217;utilisateur n&#8217;interagit plus avec le syst&#232;me de r&#233;daction assist&#233;e, car les r&#232;-
gles sp&#233;cifiques au domaine couvrent l&#8217;information requise pour permettre la g&#233;n&#233;ration des
descriptions. Ceci implique donc l&#8217;utilisation de MDA comme un g&#233;n&#233;rateur de texte. Prenons
l&#8217;exemple du pr&#233;dicat USE (utilisation de la substance):
USE(SUBSTANCE,PROD1,PREP,USEV,PROD2,TIME). Dans le cas de l&#8217;ac&#233;tone, l&#8217;analyse four-
nit la liste suivantes de pr&#233;dicats:</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge
</p>
<p>USE(acetone,NONE,NONE,make,plastic,now)
USE(acetone,NONE,NONE,make,fiber,now)
USE(acetone,NONE,NONE,make,drug,now)
USE(acetone,NONE,NONE,make,other chemical,now)
USE(acetone,NONE,NONE,dissolve,other substance,now)
</p>
<p>A partir de cette liste, un ensemble de r&#232;gles GI contraignant les usages possibles de l&#8217;ac&#233;tone
est construit. De plus, nous cr&#233;ons un ensemble de r&#232;gles lexicales GI qui encodent le fait que
make, dissolve sont des verbes exprimant une utilisation, que drug, fiber, other chemical, plas-
tic, other substance, sont des produits, etc. Nous proc&#233;dons de la m&#234;me mani&#232;re pour tous
les types de pr&#233;dicats extraits par l&#8217;analyseur syntaxique (COLOUR(SUBSTANCE,COLOUR),
SMELL(SUBSTANCE,ODOR), etc).
</p>
<p>Lorsqu&#8217;elle est combin&#233;e avec la grammaire de r&#233;alisation, cette information nous permet de
g&#233;n&#233;rer le texte normalis&#233; correspondant au texte initial.
</p>
<p>Le syst&#232;me MDA &#233;tant initialement con&#231;u pour la r&#233;daction assist&#233;e de documents multilingues,
nous avons exploit&#233; cette capacit&#233; et cr&#233;&#233; des grammaires parall&#232;les &#224; celle pr&#233;sent&#233;e pr&#233;c&#233;dem-
ment, pour le fran&#231;ais et l&#8217;espagnol. Ces grammaires partagent la m&#234;me structure s&#233;mantique
et permettent des r&#233;alisations linguistiques propres &#224; chaque langue.
</p>
<p>La figure 1 montre la sortie de la phase d&#8217;analyse sous forme de pr&#233;dicats s&#233;mantiques, tandis
que la figure 2 montre les textes normalis&#233;s g&#233;n&#233;r&#233;s en fran&#231;ais, anglais et espagnol, pour le
m&#234;me produit toxique, l&#8217;ac&#233;tone.
</p>
<p>Figure 1: R&#233;sultat de la phase d&#8217;analyse pour l&#8217;ac&#233;tone</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction d&#8217;information en domaine restreint pour la g&#233;n&#233;ration multilingue de
r&#233;sum&#233;s cibl&#233;s
</p>
<p>Figure 2: G&#233;n&#233;ration multilingue des textes normalis&#233;s
</p>
<p>3 Evaluation et Conclusion
</p>
<p>L&#8217;&#233;valuation de ce travail n&#8217;est pas une t&#226;che facile dans la mesure o&#249; plusieurs composantes
rentrent en jeu. Nous avons ici choisi d&#8217;&#233;valuer dans un premier temps les performances de
la premi&#232;re partie du traitement (Extraction d&#8217;information cibl&#233;e). Cette &#233;valuation effectu&#233;e
sur une collection de 30 textes du domaine qui n&#8217;ont pas &#233;t&#233; pr&#233;alablement trait&#233;s par le sys-
t&#232;me a donn&#233; les r&#233;sultats suivants en terme de pr&#233;cision et de rappel. De part l&#8217;approche que
</p>
<p>Pr&#233;cision Rappel FScore
.96 .65 .77
</p>
<p>nous avons adopt&#233;e toute l&#8217;information extraite appara&#238;t n&#233;cessairement dans les r&#233;sum&#233;s fin-
aux. Par ailleurs, nous adoptons les crit&#232;res d&#233;finis par (Hartley et al. 2001) pour l&#8217;&#233;valuation
d&#8217;une application de g&#233;n&#233;ration multilingue et nous pouvons faire les constatations suivantes:
L&#8217;acceptabilit&#233; des r&#233;sum&#233;s produites est optimale dans la mesure o&#249; la combinatoire des
expressions linguistiques possibles est contr&#244;l&#233;e et pr&#233;vue &#224; priori dans la grammaire MDA.
Pour ces m&#234;mes raisons le crit&#232;re de grammaticalit&#233; des r&#233;sum&#233;s obtenus est &#233;galement opti-
male. Enfin, la notion de couverture est en fait un reflet des r&#233;sultats de la phrase d&#8217;extraction
d&#8217;information, puisque tout pr&#233;dicat extrait dans la premi&#232;re phase aura une r&#233;alisation en
langue naturelle.
</p>
<p>Le travail d&#233;crit ici nous pr&#233;sente une m&#233;thode et un prototype effectif capable de produire</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge
</p>
<p>des r&#233;sum&#233;s cibl&#233;s d&#8217;une tr&#232;s grande pr&#233;cision &#224; partir de textes appartenant &#224; un domaine re-
streint. Nous envisageons de porter cette m&#233;thode &#224; d&#8217;autres domaines et de r&#233;fl&#233;chir comment
l&#8217;information linguistique n&#233;cessaire pour mener &#224; bien cette t&#226;che peut &#234;tre acquise de mani&#232;re
partiellement automatique afin de minimiser le temps de d&#233;veloppement.
</p>
<p>R&#233;f&#233;rences
</p>
<p>A&#239;t-Mokhtar S., Chanod J-P. and Roux C. (2002), Robustness beyond shallowness: incremental depen-
dency parsing, Special Issue on Robust Methods in Analysis of Natural Language Data, Vol. 8, 121-144.
</p>
<p>Brun C., Hag&#232;ge C. (2003), Normalization and Paraphrasing Using Symbolic Methods, Proceeding of
the Second International Workshop on Paraphrasing. ACL 2003, Sapporo, Japan
</p>
<p>Brun C., Dymetman M. (2002), Multilinguisme et traitement de l&#8217;information R&#233;daction multilingue as-
sist&#233;e dans le mod&#232;le MDA, pages 129&#8211;152 - Trait&#233; des sciences et techniques de l&#8217;information. Herm&#232;s.
</p>
<p>Cancedda N. (1999), Text Generation from MUC Templates. In Proceedings of the 7th European Work-
shop on Natural Language Generation (EWNLG&#8217;99)
</p>
<p>Marc Dymetman. 2002. Text authoring, knowledge acquisition and description logics. In Proceedings
of Coling 2002, Taiwan.
</p>
<p>Hartley A., Scott D., Bateman J., Dochev D. (2001), AGILE - A system for Multilingual Generation of
Technical Instructions.
</p>
<p>Kossein L., Beauregard S., Lapalme L. (2001), Using Information Extraction and Natural language Gen-
eration to Answer E-mail. In Proceedings of the 5th International Conference on Application of Natural
Language to Information Systems. Versailles, France.
</p>
<p>Brun C., Dymetman M., Lux V. (2000), Document structure and multilingual authoring. In Proceedings
of the First International Natural Language Generation Conference (INLG&#8217;2000), Mitzpe Ramon, Israel
24-31.
</p>
<p>Hag&#232;ge C., Roux C. (2003), Entre syntaxe et s&#233;mantique: Normalisation de l&#8217;analyse syntaxique en vue
de l&#8217;am&#233;lioration de l&#8217;extraction d&#8217;information &#224; partir de textes. Actes de TALN 2003, Batz-sur-Mer,
France
</p>
<p>Lenci, A. Bartolini, R., Calzolari N., Agua A., Buseman S., Cartier E., Chevreau K., Coch J. (2002),
Multilingual Summarization by Integrating Linguistic Resources in the MLIS-MUSI Project. Proceed-
ings of the 3rd International Conference on Language Resources and Evaluation (LREC&#8217;02), May 29-31,
Las Palmas, Canary Islands, Spain, 2002
</p>
<p>Reiter E., Dale R. (2000), Building Natural Language Generation Systems. Studies in Natural Language
Processing, Cambridge University Press.</p>

</div></div>
</body></html>