<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Sp&#233;cification et implantation informatique d&#8217;un langage de description des structures discursives</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19-21 avril 2004 
</p>
<p>Sp&#233;cification et implantation informatique 
d&#8217;un langage de description 
des structures discursives 
</p>
<p>Gustavo Crispino, Agata Jackiewicz et Jean-Luc Minel 
</p>
<p>Laboratoire LaLICC (Paris IV, CNRS) &#8211; Universit&#233; de Paris-Sorbonne (ISHA) 
96, bd Raspail, 75006 Paris -France 
Pr&#233;nom.Nom@paris4.sorbonne.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
</p>
<p>Cet article pr&#233;sente le langage de repr&#233;sentation des connaissances linguistiques LangTex qui 
permet de sp&#233;cifier d&#8217;une mani&#232;re unifi&#233;e les descriptions linguistiques n&#233;cessaires au 
rep&#233;rage d&#8217;objets textuels qui organisent les textes &#233;crits.  
</p>
<p>This article presents LangTex, a language for linguistic knowledge representation. This 
language allows to specify in a unified way the linguistic descriptions necessary for the 
location of textual objects which organize written texts.  
</p>
<p>Keywords &#8211; Mots Cl&#233;s  
Repr&#233;sentation des structures discursives, langage de repr&#233;sentation des connaissances 
linguistiques. 
Representation of discourse structures, linguistic knowledge language representation.  
</p>
<p>1 Introduction 
</p>
<p>Le d&#233;veloppement de nouveaux modes d&#8217;acc&#232;s aux documents num&#233;riques, que nous 
connaissons aujourd&#8217;hui, conduit &#224; mettre l&#8217;accent sur l&#8217;exploitation de la structuration interne 
des documents et de sa signalisation. Dans cette perspective informatique, focalis&#233;e en 
particulier sur la fouille s&#233;mantique de textes, nous nous int&#233;ressons aux diff&#233;rentes familles 
de marques d&#8217;organisation discursive &#224; l&#8217;&#233;crit (Jackiewicz, 2002 ; Couto et al., 2004 ; 
Jackiewicz, Minel, 2003). En nous appuyant sur plusieurs &#233;tudes linguistiques portant sur 
l&#8217;&#233;num&#233;ration (Turco, Coltier, 1988), (P&#233;ry-Woodley,  2000), (Luc, Virbel, 2001), la 
reformulation (Rossari, 1997), l&#8217;auto-repr&#233;sentation de l&#8217;&#233;nonciation (Authier-Revuz, 1995), 
la prise en charge &#233;nonciative (Descl&#233;s, Guentch&#233;va, 2000), nous cherchons &#224; proposer un 
ensemble de crit&#232;res (organis&#233;s id&#233;alement dans une carte de valeurs s&#233;mantiques) permettant 
de rendre compte d&#8217;une mani&#232;re unifi&#233;e des principales op&#233;rations &#233;nonciatives et m&#233;ta-
&#233;nonciatives rencontr&#233;es dans des textes &#233;crits. Ces crit&#232;res sont destin&#233;s &#224; une proc&#233;dure </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Crispino, Jackiewicz et Minel 
</p>
<p>automatique permettant d&#8217;annoter certains segments textuels ou certains lieux ou modes 
d&#8217;articulation de ces segments, l&#8217;annotation pouvant &#234;tre exploit&#233;e notamment pour la 
navigation textuelle ou intra-documentaire ou la synth&#232;se s&#233;lective de textes (Couto et al., 
2004). Nous disposons actuellement de deux &#233;tudes linguistiques abouties portant sur les 
marques organisatrices de discours. La premi&#232;re s&#8217;int&#233;resse aux marqueurs d&#8217;int&#233;gration 
lin&#233;aire et aux structures organisationnelles en s&#233;rie que ces marques permettent d&#8217;engendrer 
(Jackiewicz, 2002). La deuxi&#232;me d&#233;crit le fonctionnement discursif des introducteurs de 
th&#233;matiques (Porhiel 2001).  
</p>
<p>Dans (Jackiewicz, Minel, 2003) nous avons pr&#233;sent&#233; une premi&#232;re mod&#233;lisation pour le 
rep&#233;rage et la repr&#233;sentation des structures en s&#233;rie. Cette mod&#233;lisation a &#233;t&#233; r&#233;alis&#233;e dans le 
cadre de la mise en &#339;uvre de la plate-forme d&#8217;ing&#233;nierie linguistique ContextO (Descl&#233;s et al., 
1997 ; Crispino et al., 1999, Minel et al., 2001). Cette plate-forme, d&#233;di&#233;e au filtrage 
s&#233;mantique de textes et au d&#233;veloppement d&#8217;outils interactifs de fouille de textes s&#8217;organise en 
plusieurs sous-syst&#232;mes qui coop&#232;rent autour d&#8217;un mod&#232;le du texte (Crispino, 2003). C&#8217;est 
celui-ci qui va &#234;tre d&#233;cor&#233; avec les r&#233;sultats produits par le moteur d&#8217;exploration contextuelle 
en appliquant les r&#232;gles d&#8217;exploration contextuelle.  
</p>
<p>Notre travail actuel se centre sur la conception d&#8217;un langage de repr&#233;sentation qui permette de 
d&#233;crire les mod&#232;les des diff&#233;rentes structures discursives, afin de proposer un outil de 
description g&#233;n&#233;rique en vue d&#8217;une impl&#233;mentation informatique dans la plate-forme 
ContextO. 
</p>
<p>2 L&#8217;objet textuel &#171; s&#233;rie &#187;,  sa structure typique et ses variantes  
</p>
<p>Afin de pr&#233;ciser la terminologie employ&#233;e, consid&#233;rons un exemple prototypique d&#8217;une 
structure organisationnelle en s&#233;rie [1]. Cette structure se compose d&#8217;une amorce et d&#8217;une 
s&#233;rie de segments proprement dite, s&#8217;encha&#238;nant lin&#233;airement dans le texte. L&#8217;amorce introduit 
la s&#233;rie, g&#233;n&#233;ralement (i) en explicitant son principe f&#233;d&#233;rateur, &#224; l&#8217;aide notamment d&#8217;un 
classifieur (ici : champ), et (ii) en indiquant sa longueur (ici : trois). Chaque item de la s&#233;rie 
constitue un cadre organisationnel ; il est introduit par une expression d&#233;sign&#233;e par le terme de 
marqueur d&#8217;int&#233;gration lin&#233;aire ou MIL (ici, en premier lieu, en deuxi&#232;me lieu et en 
troisi&#232;me lieu). Ces trois marques fonctionnent de concert. En premier lieu est un marqueur 
d&#8217;ouverture. En deuxi&#232;me lieu et en troisi&#232;me lieu sont des marqueurs &#171; relais &#187;. Un relais 
indique que le segment textuel introduit n&#8217;est pas le premier de la s&#233;rie et qu&#8217;une suite est 
possible. La s&#233;rie de l&#8217;exemple [1] ne comporte pas de marqueur de cl&#244;ture, dont les 
exemples possibles sont en dernier lieu, enfin. Chaque MIL balise le d&#233;but de l&#8217;item textuel 
qu&#8217;il introduit. Chaque MIL poss&#232;de &#233;galement une port&#233;e, correspondant &#224; toutes les unit&#233;s 
(segments, propositions, phrases) qui forment l&#8217;item. Pr&#233;cisons que ni le d&#233;but de l&#8217;amorce ni 
la fin du dernier item, ne sont signal&#233;s par des marques discursives. 
</p>
<p> [1]&#1;&#2;&#3;&#4;&#5;&#6;&#7;&#8;&#9;&#10;&#11;&#12;&#5;&#13;&#1;&#4;&#11;&#13;&#1;&#4;&#14;&#6;&#15;&#13;&#16;&#1;&#17;&#18;&#19;&#11;&#10;&#20;&#11;&#1;&#13;&#20;&#9;&#10;&#21;&#5;&#10;&#22;&#3;&#7;&#1;&#4;&#1;&#23;&#4;&#10;&#5;&#1;&#11;&#4;&#3;&#23;&#6;&#4;&#12;&#7;&#16;&#1;&#7;&#5;&#1;&#17;&#7;&#1;&#24;&#20;&#11;&#25;&#7;&#1;&#26;&#20;&#11;&#11;&#4;&#27;&#5;&#1;&#3;&#11;&#7;&#1;&#11;&#20;&#3;&#9;&#7;&#17;&#17;&#7;&#1;
&#12;&#6;&#4;&#11;&#25;&#7;&#1;&#24;&#3;&#5;&#4;&#5;&#10;&#20;&#11;&#16;&#28;&#29;&#30;&#31;&#1;En premier lieu&#16;&#1;&#25;&#4;&#11;&#13;&#1;&#17;&#7;&#1;&#25;&#20;&#24;&#4;&#10;&#11;&#7;&#1;&#5;&#7;&#26; &#11;&#20;&#17;&#20;&#12;&#10;&#22;&#3;&#7;&#31;&#1;!&#18;&#10;&#11;&#23;&#20;&#6;&#24;&#4;&#5;&#10;&#13;&#4;&#5;&#10;&#20;&#11;&#1;&#25;&#7;&#1;&#5;&#20;&#3;&#13;&#1;
&#17;&#7;&#13;&#1; &#13;&#7;&#26;&#5;&#7;&#3;&#6;&#13;&#1; &#25;&#18;&#4;&#26;&#5;&#10;&#9;&#10;&#5;&#21;&#13;&#28;&#29;&#30;&#31;&#1; En deuxi&#232;me lieu&#16;&#1; &#25;&#4;&#11;&#13;&#1; &#17;&#7;&#1; &#25;&#20;&#24;&#4;&#10;&#11;&#7;&#1; &#21;&#26;&#20;&#11;&#20;&#24;&#10;&#22;&#3;&#7;&#31;&#1; !&#7;&#13;&#1; &#11;&#20;&#3;&#9;&#7;&#17;&#17;&#7;&#13;&#1;
&#5;&#7;&#26; &#11;&#20;&#17;&#20;&#12;&#10;&#7;&#13;&#1; &#23;&#4;&#9;&#20;&#6;&#10;&#13;&#7;&#11;&#5;&#1; &#17;&#18;&#7;&quot;&#14;&#4;&#11;&#13;&#10;&#20;&#11;&#1; &#25;&#7;&#1; &#17;&#4;&#1; &#13;&#14; &#15;&#6;&#7;&#1; &#23;&#10;&#11;&#4;&#11;&#26;&#10;&#15;&#6;&#7;&#31;&#28;&#29;&#30;&#31;&#1; En troisi&#232;me lieu&#16;&#1; &#25;&#4;&#11;&#13;&#1; &#17;&#7;&#1;
&#25;&#20;&#24;&#4;&#10;&#11;&#7;&#1; &#13;&#20;&#26;&#10;&#20;&#17;&#20;&#12;&#10;&#22;&#3;&#7;&#31;&#1; !&#7;&#13;&#1; &#25;&#7;&#3;&quot;&#1; #&#20;&#3;&#17;&#7;&#9;&#7;&#6;&#13;&#7;&#24;&#7;&#11;&#5;&#13;&#1; &#14;&#6;&#21;&#26;&#21;&#25;&#7;&#11;&#5;&#13;&#1; &#24;&#7;&#5;&#5;&#7;&#11;&#5;&#1; $&#1; &#24;&#4;&#17;&#1; &#17;&#7;&#13;&#1; &#14;&#6;&#21;&#6;&#20;&#12;&#4;&#5;&#10;&#9;&#7;&#13;&#1;
&#5;&#6;&#4;&#25;&#10;&#5;&#10;&#20;&#11;&#11;&#7;&#17;&#17;&#7;&#13;&#1;&#25;&#7;&#1;&#17;&#18;%&#5;&#4;&#5;&#8;&#11;&#4;&#5;&#10;&#20;&#11;&#1;&#28;&#29;&#30;&#31;&amp;!'(&#1;)&#26;&#5;&#1;*+&#1;&#14;&#31;,-&#1;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sp&#233;cification et implantation informatique d&#8217;un langage de description des structures 
discursives 
</p>
<p>Les s&#233;ries textuelles balis&#233;es par des marques discursives sont typiquement : (i) constitu&#233;es de 
2 ou de 3 items (au maximum 10 items attest&#233;s) ; (ii) introduites par des MIL h&#233;t&#233;rog&#232;nes,  
souvent manquants ou relay&#233;s par d&#8217;autres marques (notamment des connecteurs 
argumentatifs) ; (iii) structur&#233;es &#224; un niveau, plus rarement &#224; deux niveaux ; (iv) annonc&#233;es 
par une amorce. Ces s&#233;ries ne comportent pas de cl&#244;ture explicite, mais peuvent (ce qui est 
rare) &#234;tre termin&#233;es par une r&#233;tro-&#233;valuation. Ce r&#233;sum&#233; des caract&#233;ristiques saillantes des 
structures organisationnelles en s&#233;ries ne peut &#234;tre donn&#233; que sous une forme fortement 
modalis&#233;e : certaines propri&#233;t&#233;s sont fr&#233;quentes et typiques, d&#8217;autres sont donn&#233;es pour rares, 
d&#8217;autres enfin peuvent &#234;tre per&#231;ues comme des variantes accidentelles (voire, comme une 
atteinte &#224; une certaine norme d&#8217;usage). L&#8217;existence de plusieurs variantes s&#8217;&#233;cartant de la 
structure typique de l&#8217;objet &#171; s&#233;rie discursive &#187; a des incidences significatives sur les plans 
formel et informatique. En effet, si les scripteurs respectaient certaines normes d&#8217;&#233;criture, en 
indiquant syst&#233;matiquement par des marques lexicales ou visuelles explicites et homog&#232;nes 
les rangs des items, les diff&#233;rents niveaux d&#8217;embo&#238;tement, ainsi que les cl&#244;tures de ces 
structures,  la reconnaissance de celles-ci rel&#232;veraient d&#8217;une grammaire hors-contexte (type 2). 
Mais d&#8217;une part, certaines marques peuvent &#234;tre absentes et de plus, certaines marques sont 
ambigu&#235;s au sens o&#249; elles peuvent appartenir potentiellement &#224; plusieurs structures 
discursives. 
</p>
<p>3 Langage de repr&#233;sentation de connaissances linguistiques  
</p>
<p>Un grand nombre de logiciels construits en TALN peuvent &#234;tre utilis&#233;s pour identifier des 
structures discursives. Mais de notre point de vue, ces logiciels ne fournissent pas les outils, 
formels ou techniques, qui permettent d&#8217;op&#233;rer une distinction claire entre les descriptions 
linguistiques et les op&#233;rations de rep&#233;rage. A ce titre, des langages ou des standards 
appartenant ou non &#224; la famille XML comme Xslt, Xpath&#8230; ne r&#233;pondent pas &#224; nos exigences, 
au sens o&#249; d&#8217;une part, ils s&#8217;appuient sur des concepts op&#233;ratoires limitatifs, d&#8217;autre part, leur 
syntaxe les rend impropres &#224; une utilisation par des non-sp&#233;cialistes. Le langage LangTex 
(Crispino, 2003) constitue une r&#233;ponse &#224; nos besoins. LangTex est un langage de 
repr&#233;sentation de connaissances linguistiques destin&#233; &#224; exprimer, &#224; l&#8217;origine, des r&#232;gles de la 
m&#233;thode d&#8217;exploration contextuelle. Il s&#8217;agit d&#8217;un langage d&#233;claratif, structur&#233; en deux 
couches : CBase et CRegEC. Les r&#232;gles d&#8217;exploration contextuelle capables d&#8217;attribuer une 
valeur s&#233;mantique &#224; un segment textuel, sont &#233;crites avec des expressions de la couche de 
niveau sup&#233;rieur, CRegEC. Ainsi, par exemple, une construction syntaxique telle que : 
</p>
<p>Nomregle = AmorceStruc ;  
IndicateursDeclencheurs = &amp;classifieurs ; 
Etiquette = AmorceClassifieurLongueur ; 
{Existe : 
</p>
<p>[EspaceRecherche : gauche(indicateur,2)] 
   [&amp;numeral ;]} 
  attribuerEtiquette :phraseParent(indicateur) ; 
  finRegle   
exprime les conditions pour &#233;tiqueter une phrase avec l&#8217;&#233;tiquette s&#233;mantique 
&#171; AmorceStruc &#187;. La phrase &#224; &#233;tiqueter est celle qui contient un indicateur de la classe 
&amp;classifieurs (facteur, champ, hypoth&#232;se&#8230;). La condition impos&#233;e dans cette r&#232;gle pour 
l&#8217;attribution d&#8217;une &#233;tiquette est celle de trouver dans un espace de recherche de deux positions </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Crispino, Jackiewicz et Minel 
</p>
<p>&#224; gauche de l&#8217;indicateur une expression de la classe &amp;numeral (deux, trois, quatre, &#8230;). Cette 
construction pr&#233;sente deux expressions de la couche CBase du langage : gauche(indicateur, 
2), qui d&#233;limite un espace de recherche &#224; gauche de l&#8217;indicateur et phraseParent(indicateur) 
qui indique que le segment &#224; &#233;tiqueter est celui de la phrase qui contient l&#8217;indicateur. De son 
c&#244;t&#233;, la couche de niveau inf&#233;rieur, CBase, fournit les fonctionnalit&#233;s &#233;l&#233;mentaires concernant 
la structure de base du texte. CBase contient les op&#233;rateurs et les op&#233;rations qui permettent de 
naviguer dans la structure textuelle, de se positionner dans un segment textuel d&#233;termin&#233;, 
d&#8217;extraire certaines unit&#233;s lexicales et de v&#233;rifier la position d&#8217;une unit&#233; lexicale dans le texte. 
LangTex s&#8217;appuie sur une repr&#233;sentation hi&#233;rarchique du texte, mod&#233;lisable par un graphe 
orient&#233;.  
</p>
<p>Nous avons montr&#233; (Jackiewicz, Minel, 2003) que le rep&#233;rage des structures discursives 
n&#233;cessite deux niveaux d&#8217;analyse. Un premier niveau vise &#224; identifier la fonction discursive 
(ou s&#233;mantique) d&#8217;un marqueur. Un deuxi&#232;me niveau d&#8217;analyse n&#233;cessite la notion de mod&#232;le 
de r&#233;f&#233;rence. Il conjugue le rep&#233;rage issu du premier niveau avec des contraintes exprim&#233;es 
dans ce mod&#232;le, propre &#224; la structure discursive que l&#8217;on cherche &#224; identifier. Par exemple, 
pour les s&#233;ries de cadres organisationnels, ce mod&#232;le stipule les contraintes suivantes. 
Premi&#232;rement, les &#233;l&#233;ments de la structure ob&#233;issent &#224; une organisation s&#233;quentielle (en 
second lieu appara&#238;t n&#233;cessairement apr&#232;s en premier lieu et avant en troisi&#232;me lieu) sachant 
que certaines marques lexicales peuvent &#234;tre absentes. L&#8217;ensemble de ces &#233;l&#233;ments constitue 
une s&#233;rie paradigmatique. Deuxi&#232;mement, deux s&#233;ries sont soient disjointes, soient 
ench&#226;ss&#233;es. Ces contraintes sont utilis&#233;es par le processus de reconnaissance pour calculer la 
port&#233;e et l&#8217;ench&#226;ssement des structures discursives notamment afin de pallier l&#8217;absence de 
certaines marques typographiques ou lexicales. A chaque structure discursive est donc associ&#233; 
un mod&#232;le qui d&#233;crit son organisation paradigmatique, les contraintes qui r&#233;gissent les 
&#233;l&#233;ments appartenant &#224; la structure et celles qui r&#233;gissent les structures entre elles. Ces 
contraintes sont propres &#224; chaque mod&#232;le. Ainsi, l&#8217;&#233;tude men&#233;e sur les s&#233;ries de cadres 
organisationnels (Jackiewicz, 2002) montre que ce type de structure peut pr&#233;senter au plus 
deux niveaux d&#8217;imbrication, alors que le niveau d&#8217;ench&#226;ssement des cadres spatiaux ou 
temporels peut &#234;tre sup&#233;rieur &#224; deux (Charolles, 1997). 
</p>
<p>L&#8217;identification d&#8217;une structure discursive se traduit dans la repr&#233;sentation hi&#233;rarchique par la 
cr&#233;ation d&#8217;un chemin entre les unit&#233;s phrastiques qui composent la structure. Ce qui signifie 
que dans la repr&#233;sentation pr&#233;sent&#233;e pr&#233;c&#233;demment nous ajoutons des arcs lesquels, au lieu de 
mod&#233;liser la lin&#233;arit&#233; mat&#233;rielle du texte, mod&#233;lisent sa &#171; lin&#233;arit&#233; &#187; discursive.  
</p>
<p>4 Langage de description des structures discursives et 
architecture informatique 
</p>
<p>Dans cette section nous pr&#233;sentons les &#233;l&#233;ments n&#233;cessaires pour la mod&#233;lisation des 
structures discursives. Cette mod&#233;lisation touche plusieurs aspects. Un premier &#233;l&#233;ment de la 
mod&#233;lisation est la caract&#233;risation des structures &#224; rep&#233;rer et &#224; repr&#233;senter. Pour illustrer 
cet aspect, consid&#233;rons l&#8217;exemple de la structure organisationnelle en s&#233;rie, &#233;voqu&#233; dans la 
section 2. Dans notre repr&#233;sentation du texte comme graphe orient&#233;, les n&#339;uds sont &#233;tiquet&#233;s, 
sous la forme de paires &lt;attribut, valeur&gt;, par des informations concernant la structure 
textuelle et par des valeurs s&#233;mantiques attribu&#233;es par des r&#232;gles d&#8217;exploration contextuelle. 
Par exemple, un n&#339;ud correspondant &#224; la deuxi&#232;me phrase du texte, qui contient le troisi&#232;me </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sp&#233;cification et implantation informatique d&#8217;un langage de description des structures 
discursives 
</p>
<p>MIL (relais), comportera, &#224; l&#8217;issue de la premi&#232;re phase de la proc&#233;dure de reconnaissance de 
structures, entre autres, les &#233;tiquettes suivantes : 
</p>
<p>&lt; type =  &quot;phrase&quot;&gt; , &lt; position =  &quot;2&quot;&gt; , &lt;  etiquetteStruc =  &quot;relais&quot; &gt; , &lt; rang =  &quot;3&quot;&gt; . 
</p>
<p>Cette structure, d&#233;sign&#233;e SCOAOR
1
</p>
<p>, sera repr&#233;sent&#233;e par un chemin dans le graphe constitu&#233; par 
les phrases qui contiennent les diff&#233;rents composants de la s&#233;rie. Formellement, soit p le n&#339;ud 
que repr&#233;sente une phrase, p.att l&#8217;attribut att du n&#339;ud p et p.att[n] l&#8217;attribut att du &#233;ni&#232;me 
n&#339;ud d&#8217;une liste de n&#339;uds. La structure SCOAOR est donc une liste de n&#339;uds phrase (p1, &#8230;,pn) 
telle que :  
</p>
<p>&#1;&#2; existe un arc de chaque n&#339;ud vers le suivant, c&#8217;est-&#224;-dire, pi &#3; pi+ 1 pour i =  1,&#8230;,n-1 
&#1;&#2; p.etiquetteStruc[1]  =  &quot;amorce&quot; 
&#1;&#2; p.etiquetteStruc[2]  =  &quot;ouverture&quot; 
&#1;&#2; &#4; i, 3 &#1;&#2;&#3;&#2;&#1;&#2;&#4;&#5;&#2;&#6;&#7;&#8;&#9;&#3;&#10;&#11;&#8;&#9;&#9;&#8;&#12;&#9;&#13;&#11;&#14;&#15;&#3;&#16;&#2;&#17;&#2;&#18;&#13;&#8;&#19;&#20;&#3;&#21;&#18;&#5;&#2;&#2; 
&#1;&#2; &#4; (i,j), 3 &#1;&#2;&#3;&#2;&#1;&#2;&#4;&#5;&#2;&#9;&#8;&#19;&#2;&#10;&#11;&#8;&#2;&#6;&#7;&#6;&#22;&#21;&#3;&#9;&#3;&#22;&#4;&#15;&#3;&#16;&#2;&#23;&#2;&#6;&#7;&#6;&#22;&#21;&#3;&#9;&#3;&#22;&#4;&#15;&#24;&#16;&#2;&#20;&#19;&#22;&#13;&#21;&#2;&#6;&#7;&#13;&#20;&#4;&#25;&#15;&#3;&#16;&#2;&#23;&#2;&#6;&#7;&#13;&#20;&#4;&#25;&#15;&#24;&#16;&#7; 
</p>
<p>Le deuxi&#232;me &#233;l&#233;ment de notre mod&#233;lisation concerne l&#8217;extension du langage LangTex avec 
une couche CRegSD (couche de r&#232;gles de structures discursives). Les r&#232;gles de cette couche 
traitent les &#233;tiquettes ajout&#233;es &#224; la repr&#233;sentation hi&#233;rarchique du texte pendant le premier 
niveau d&#8217;analyse des structures discursives. Les composants d&#8217;une r&#232;gle de cette couche sont : 
l&#8217;&#233;l&#233;ment d&#233;clencheur (p.etiquetteStruc = &quot;amorce&quot; dans notre exemple), les conditions et 
l&#8217;action. Le troisi&#232;me &#233;l&#233;ment de la mod&#233;lisation est constitu&#233; par les contraintes g&#233;n&#233;rales 
des structures.  
</p>
<p>Les sp&#233;cifications d&#233;crites pr&#233;c&#233;demment n&#233;cessitent, pour &#234;tre impl&#233;ment&#233;es dans la plate-
forme ContextO, des modifications dans l&#8217;architecture de celle-ci. En effet, jusqu&#8217;&#224; pr&#233;sent 
(cf. section 1), l&#8217;application des r&#232;gles d&#8217;exploration contextuelle avait seulement pour r&#233;sultat 
la d&#233;coration de la repr&#233;sentation hi&#233;rarchique du texte. Cet &#233;tiquetage correspond au premier 
niveau d&#8217;analyse d&#233;crit pr&#233;c&#233;demment (cf. section 3). Le d&#233;veloppement informatique 
n&#233;cessit&#233; par les traitements du deuxi&#232;me niveau d&#8217;analyse implique l&#8217;ajout de deux modules  
Un premier module a pour charge la cr&#233;ation des chemins (cf. section 4), c&#8217;est-&#224;-dire des arcs 
nomm&#233;s entre les n&#339;uds repr&#233;sentant les phrases dans la repr&#233;sentation du texte. Ce module 
s&#8217;appuie d&#8217;une part, sur l&#8217;&#233;tiquetage r&#233;alis&#233; par l&#8217;&#233;tiqueteur s&#233;mantique du premier niveau, et 
d&#8217;autre part, sur une base de mod&#232;les des structures discursives, o&#249; chaque mod&#232;le d&#233;crit les 
composants de celles-ci. Le rep&#233;rage d&#8217;une structure doit faire appel &#224; des heuristiques qui 
cherchent une configuration qui r&#233;ponde &#224; la fois &#224; des contraintes locales et globales. Par 
exemple, en cas d&#8217;ind&#233;termination, une marque de cl&#244;ture telle que Enfin est toujours attach&#233;e 
au cadre organisationnel le plus proche ; ce qui est une contrainte locale. La r&#232;gle voulant que 
les cadres organisationnels soient toujours ench&#226;ss&#233;s ou disjoints est un exemple d&#8217;une 
contrainte globale. Ces contraintes sp&#233;cifi&#233;es sous forme d&#233;clarative sont trait&#233;es par un 
deuxi&#232;me module, le r&#233;solveur de contraintes, qui se charge d&#8217;explorer l&#8217;espace des solutions 
possibles et de proposer, s&#8217;il en existe, une solution pr&#233;f&#233;rentielle. 
</p>
<p>5 Conclusion 
Le travail que nous venons de pr&#233;senter comporte plusieurs composantes : l&#8217;&#233;tude 
linguistique, la mod&#233;lisation d&#8217;une solution &#224; l&#8217;aide d&#8217;outils formels de repr&#233;sentation et 
l&#8217;architecture informatique. Sur le plan linguistique, nous avons entrepris plusieurs recherches 
</p>
<p>                                                 
1  SCOAOR :  S&#233;rie de Cadres Organisationnels avec Amorce, Ouverture et Relais </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Crispino, Jackiewicz et Minel 
</p>
<p>sur des organisateurs discursifs, ayant abouti, entre autres, sur un ensemble de crit&#232;res 
permettant de caract&#233;riser la s&#233;mantique et le fonctionnement discursif de ces marques.  Sur le 
plan de la mod&#233;lisation, nous travaillons &#224; l&#8217;extension du langage de repr&#233;sentation LangTex, 
pour d&#233;crire les mod&#232;les des diff&#233;rentes structures discursives, afin de proposer un outil de 
description g&#233;n&#233;rique.  
</p>
<p>R&#233;f&#233;rences  
</p>
<p>AUTHIER-REVUZ J. (1995), Ces mots qui ne vont pas de soi. Boucles r&#233;flexives et non 
co&#239;ncidences du dire, t.1 et t.2, Larousse. 
CHAROLLES M. (1997), L'encadrement du discours - Univers, champs, domaines et espace , 
Cahier de recherche linguistique, 6. 
COUTO J., FERRET O., GRAU B., HERNANDEZ N., JACKIEWICZ A., MINEL J.-L., PORHIEL S. 
(2004), R&#201;GAL, un syst&#232;me pour la visualisation s&#233;lective de documents, Revue 
d&#8217;Intelligence Artificielle, &#224; para&#238;tre. 
CRISPINO G., BEN HAZEZ S., MINEL J.-L. (1999), Architecture logicielle de Context, plate-
forme d'ing&#233;nierie linguistique, Actes de TALN 99, Carg&#232;se, pp 327-332. 
CRISPINO G., (2003), Une plate-forme informatique de l&#8217;Exploration Contextuelle : 
mod&#233;lisation, architecture et r&#233;alisation (ContextO). Application au filtrage s&#233;mantique de 
textes, Th&#232;se de doctorat, Universit&#233; de Paris-Sorbonne. 
DESCL&#201;S J.-P., CARTIER E., JACKIEWICZ A., MINEL J.-L. (1997), Textual Processing and 
Contextual Exploration Method, Actes de CONTEXT 97, Rio de Janeiro, pp. 189-197. 
DESCL&#201;S J.-P., GUENTCH&#201;VA Z. (2000), Enonciateur, locuteur, m&#233;diateur, ed. A. Becquelin et 
Ph. Erikson,  Les rituels du dialogue, Editions de l&#8217;Harmattan. 
JACKIEWICZ A. (2002), Rep&#233;rage et d&#233;limitation des cadres organisationnels pour la 
segmentation automatique des textes, Actes de CIFT&#8217;02, Hammamet, Tunisie, pp. 95-107. 
JACKIEWICZ A., MINEL J.-L. (2003), L&#8217;identification des structures discursives engendr&#233;es par 
les cadres organisationnels, Actes de TALN 2003, Batz sur Mer, pp 155-164  
LUC C., VIRBEL J. (2001), Le mod&#232;le d&#8217;architecture textuelle, fondements et exp&#233;rimentation, 
Verbum, t. XXIII, n&#176;1, Coh&#233;rence et relations de discours &#224; l&#8217;&#233;crit. 
MINEL J.-L., CARTIER E., CRISPINO G., DESCL&#201;S J.-P., BEN HAZEZ S., JACKIEWICZ A. (2001), 
R&#233;sum&#233; automatique par filtrage s&#233;mantique d&#8217;informations dans des textes. Pr&#233;sentation de 
la plate-forme FilText, Technique et Science Informatiques, n&#186;3,, pp. 369-395. 
P&#201;RY-WOODLEY M.-P., (2000), Une pragmatique &#224; fleur de texte : approche en corpus de 
l&#8217;organisation textuelle, M&#233;moire d&#8217;habilitation, Universit&#233; de Toulouse-le Mirail. 
PORHIEL S. (2001), Linguistic expressions as a tool to extract thematic information, Actes 
Corpus Linguistic, Lancaster University. 
ROSSARI C. (1997), Les op&#233;rations de reformulation, Peter Lang. 
TURCO G., COLTIER D. (1988), Des agents doubles de l&#8217;organisation textuelle, les marqueurs  
d&#8217;int&#233;gration lin&#233;aire, Pratiques, n&#176;57. 
 </p>

</div></div>
</body></html>