<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La s&#233;mantique dans les grammaires d&#8217;interaction</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>La s&#233;mantique dans les grammaires d&#8217;interaction
</p>
<p>Guy Perrier
LORIA - Universit&#233; Nancy 2
</p>
<p>BP 239 - 54506 Vand&#339;uvre-l&#232;s-Nancy cedex
perrier@loria.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Nous proposons d&#8217;int&#233;grer la s&#233;mantique dans les grammaires d&#8217;interaction, formalisme qui a
&#233;t&#233; con&#231;u pour repr&#233;senter la syntaxe des langues. Pour cela, nous ajoutons au formalisme un
niveau suppl&#233;mentaire qui s&#8217;appuie sur les m&#234;mes principes fondamentaux que le niveau syn-
taxique : contr&#244;le de la composition par un syst&#232;me de polarit&#233;s et utilisation de la notion de
description de structure pour exprimer la sous-sp&#233;cification. A la diff&#233;rence du niveau syntax-
ique, les structures sont des graphes acycliques orient&#233;s et non des arbres localement ordonn&#233;s.
L&#8217;interface entre les deux niveaux est assur&#233;e de fa&#231;on souple par une fonction de liage qui
associe &#224; tout n&#339;ud syntaxique au plus un n&#339;ud s&#233;mantique.
We propose an integration of semantics into Interaction Grammars, a formalism that was de-
signed for representing the syntax of natural languages. It consists in the addition of a new level
to the formalism and this level is based on the same fundamental principles as the syntactical
level: the control of composition with a system of polarities and the use of the notion of struc-
ture description for expressing underspecification. Unlike the syntactical level, structures are
directed acyclic graphs and not locally ordered trees. The interface between the two levels is
performed in a flexible way by a linking function which maps every syntactical node to at most
one semantical node.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>formalisme grammatical, interface syntaxe-s&#233;mantique, sous-sp&#233;cification, polarit&#233;s.
grammatical formalism, syntax-semantics interface, underspecification, polarities.
</p>
<p>Introduction
</p>
<p>Initialement, les grammaires d&#8217;interaction (IG en abr&#233;g&#233; pour Interaction Grammars) ont &#233;t&#233;
con&#231;ues pour mod&#233;liser la syntaxe des langues (Perrier, 2002) &#224; partir de deux traditions dif-
f&#233;rentes des grammaires formelles : les grammaires cat&#233;gorielles (CG en abr&#233;g&#233; pour Categorial
Grammars) et les grammaires d&#8217;arbres adjoints (TAG).
Des CG, les IG retiennent l&#8217;id&#233;e que les syntagmes sont vus comme des ressources consommables
et qu&#8217;il y a une dualit&#233; entre celles-ci qui s&#8217;exprime dans le m&#233;canisme de composition syntax-
ique : certaines ressources, munies de polarit&#233;s n&#233;gatives, sont attendues alors que d&#8217;autres,
munies de polarit&#233;s positives, sont disponibles si bien que les premi&#232;res vont chercher &#224; ren-
contrer les secondes et c&#8217;est ce principe de neutralisation des polarit&#233;s oppos&#233;es qui va guider
la composition syntaxique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>La plupart des formalismes linguistiques tiennent compte de la sensibilit&#233; aux ressources des
langues mais en g&#233;n&#233;ral ils le font de fa&#231;on externe &#224; l&#8217;aide de principes de bonne formation
qui sont v&#233;rifi&#233;s apr&#232;s coup sur les structures engendr&#233;es. Seules les CG en font un principe
incorpor&#233; dans le formalisme lui-m&#234;me, qui s&#8217;applique dans le processus de composition lui-
m&#234;me et permet de le contr&#244;ler. Les IG peuvent &#234;tre vues comme un raffinement des CG
en ce sens que la notion de polarit&#233; est descendue du niveau des syntagmes au niveau des
traits grammaticaux utilis&#233;s pour les d&#233;crire (parties du discours, fonctions syntaxiques &#0; &#0; &#0; ).
Le principe de composition syntaxique reste fondamentalement le m&#234;me, prenant seulement la
forme de la neutralisation de traits duaux.
En m&#234;me temps qu&#8217;un raffinement des CG, les IG introduisent un assouplissement consid-
&#233;rable dans le formalisme en ayant recours &#224; la notion de description d&#8217;arbre. Utilis&#233;e par
Vijay-Shanker (1992) pour exprimer l&#8217;adjonction des TAG sous forme d&#8217;une op&#233;ration mono-
tone, elle s&#8217;inscrit dans une nouvelle approche de la formalisation des langues qui consid&#232;re les
grammaires comme des syst&#232;mes de contraintes plut&#244;t que comme des syst&#232;mes d&#233;rivationnels.
Les &#233;nonc&#233;s des langues sont alors vus comme des instanciations de ces syst&#232;mes de con-
traintes dont la r&#233;solution produit les analyses. Une bonne illustration de cette approche nous
est donn&#233;e par les grammaires de propri&#233;t&#233;s de Blache (2001). L&#8217;int&#233;r&#234;t d&#8217;une telle approche
est qu&#8217;elle permet une grande souplesse de composition et une expression &#233;conomique de la
sous-sp&#233;cification. La notion de description d&#8217;arbre n&#8217;est que l&#8217;application de cette approche &#224;
la repr&#233;sentation des structures syntaxiques &#224; l&#8217;aide de contraintes de domination et de pr&#233;c&#233;-
dence portant sur des n&#339;uds repr&#233;sentant des syntagmes. L&#8217;originalit&#233; des IG est d&#8217;&#233;tiqueter
ces n&#339;uds par des structures de traits polaris&#233;s et d&#8217;ajouter aux contraintes pr&#233;c&#233;dentes des
contraintes de neutralit&#233; sur les polarit&#233;s.
Dans les langues, la syntaxe n&#8217;est qu&#8217;un moyen pour acc&#233;der &#224; la s&#233;mantique. Un formalisme
ne peut donc se pr&#233;occuper de la premi&#232;re en ignorant la seconde. Il ne peut consid&#233;rer non plus
que la s&#233;mantique est une simple projection de la syntaxe et il est plus conforme &#224; la r&#233;alit&#233; de
voir leur rapports en termes d&#8217;interactions qu&#8217;en termes de d&#233;pendance passive de la premi&#232;re
relativement &#224; la seconde.
Malheureusement, parmi les formalismes distinguant le niveau s&#233;mantique du niveau syn-
taxique, beaucoup ne pr&#233;sentent le premier que comme une d&#233;duction passive du second.
Cela a comme cons&#233;quence soit de ne pas pouvoir rendre compte de ph&#233;nom&#232;nes s&#233;mantiques
lorsqu&#8217;ils ne sont pas le r&#233;sultat m&#233;canique de ph&#233;nom&#232;nes syntaxiques, soit de compliquer ar-
tificiellement la syntaxe pour en rendre compte et d&#8217;une certaine fa&#231;on d&#8217;inclure la s&#233;mantique
de mani&#232;re d&#233;tourn&#233;e dans la syntaxe.
Une bonne illustration de notre propos nous est fournie par les CG dont sont justement issues
les IG. Classiquement, la s&#233;mantique y est int&#233;gr&#233;e sous forme de la s&#233;mantique de Montague
(Montague, 1970). Le cadre utilis&#233; est celui d&#8217;une logique d&#8217;ordre sup&#233;rieur exprim&#233;e &#224; l&#8217;aide
d&#8217;un lambda-calcul typ&#233; (Carpenter, 1998). Chaque phrase est repr&#233;sent&#233;e par une formule
logique qui est une fonction de la repr&#233;sentation s&#233;mantique de chacun des mots de la phrase.
Cette fonction est repr&#233;sent&#233;e sous forme d&#8217;un lambda-terme qui est une stricte projection de
la structure syntaxique de la phrase. Cette projection consiste &#224; oublier l&#8217;ordre des mots et &#224; ne
conserver que les d&#233;pendances syntaxiques.
Prenons par exemple la phrase Jean aime Marie. Sa structure syntaxique dans les CG s&#8217;exprime
sous forme de l&#8217;application de la fonction
</p>
<p>&#2; &#4; &#6; &#7; &#2; &#9; &#6; &#7;
</p>
<p>&#0; &#12;
</p>
<p>&#9; &#14; &#16; &#18; &#20; &#22; &#14; &#4; &#25; &#27;
</p>
<p>&#224; deux arguments de type
groupe nominal (GN) fi
</p>
<p>&#16; fl &#18; &#22;
</p>
<p>et &#31;
&#22; &#16; &quot;
</p>
<p>qui vont instancier respectivement
&#4;
</p>
<p>et
&#9;
</p>
<p>. L&#8217;op&#233;rateur
&#8220;
</p>
<p>&#14;
</p>
<p>&#8221; est l&#8217;op&#233;rateur de concat&#233;nation et la valeur retourn&#233;e par la fonction est de type phrase
(P) : c&#8217;est la phrase Jean aime Marie. La repr&#233;sentation s&#233;mantique s&#8217;obtient par projection de
chaque type syntaxique en un type s&#233;mantique et par oubli de l&#8217;ordre des mots dans l&#8217;expression
du r&#233;sultat de la fonction pr&#233;c&#233;dente. Si on consid&#232;re que les types GN et P se projettent s&#233;-
mantiquement selon les types entit&#233; (e) et bool&#233;en (b), la repr&#233;sentation s&#233;mantique de la phrase
s&#8217;obtient comme application de la fonction
</p>
<p>&#2; # $ &#2; &amp; $
</p>
<p>&#0;
</p>
<p>&#16; &#18; &#20; &#22; fl
</p>
<p>&#12;
</p>
<p>&amp; ( # &#25; *
</p>
<p>aux entit&#233;s correspondant &#224;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La s&#233;mantique dans les grammaires d&#8217;interaction
</p>
<p>Marie et Jean qui vont instancier respectivement
&#0;
</p>
<p>et
&#1;
</p>
<p>.
Maintenant, voyons comment analyser la phrase tous aiment quelqu&#8217;un. Syntaxiquement, elle
se pr&#233;sente comme Jean aime Marie mais si nous reprenons la m&#234;me analyse syntaxique que
celle qui vient d&#8217;&#234;tre effectu&#233;e, par projection, on obtiendra la m&#234;me repr&#233;sentation s&#233;man-
tique et on aura compl&#232;tement ignor&#233; la pr&#233;sence et le r&#244;le des deux quantificateurs dans la
phrase. Compte tenu des relations de port&#233;e entre les deux quantificateurs pr&#233;sents, il y a deux
repr&#233;sentations s&#233;mantiques possibles de la phrase d&#8217;o&#249; n&#233;cessit&#233; de deux structures syntax-
iques correspondantes : dans l&#8217;une, tous est repr&#233;sent&#233; par une fonction qui s&#8217;applique &#224; aiment
quelqu&#8217;un et dans l&#8217;autre, c&#8217;est quelqu&#8217;un qui est repr&#233;sent&#233; par une fonction s&#8217;appliquant &#224;
tous aiment. D&#232;s que l&#8217;on va augmenter le nombre quantificateurs, l&#8217;analyse syntaxique va vite
devenir tr&#232;s compliqu&#233;e. On peut percevoir ainsi les limites d&#8217;une telle conception de l&#8217;interface
syntaxe-s&#233;mantique.
L&#8217;objet du propos qui va suivre est d&#8217;ajouter un niveau s&#233;mantique aux IG de fa&#231;on &#224; avoir un
formalisme linguistique qui couvre &#224; la fois la syntaxe et la s&#233;mantique des langues. On vient
d&#8217;entrevoir les limites d&#8217;une interface syntaxe-s&#233;mantique trop rigide comme celle qui existe
pour les CG. Les IG &#233;vitent cet &#233;cueil en gardant un niveau syntaxique autonome. Le m&#233;can-
isme de liage entre les deux niveaux est aussi peu contraignant que possible puisqu&#8217;il consiste
en une simple fonction partielle qui associe &#224; un syntagme au plus un objet s&#233;mantique. On
ne demande aucune propri&#233;t&#233; particuli&#232;re &#224; cette fonction. La repr&#233;sentation s&#233;mantique, quant
&#224; elle, est fond&#233;e sur les m&#234;mes notions de polarit&#233; et de description sous-sp&#233;cifi&#233;e que la
repr&#233;sentation syntaxique avec le m&#234;me m&#233;canisme de composition guid&#233; par le principe de
neutralisation des polarit&#233;s. Il y a cependant une diff&#233;rence : au niveau syntaxique, nous ma-
nipulons des arbres localement ordonn&#233;s et donc des descriptions d&#8217;arbres localement ordonn&#233;s
mais, au niveau s&#233;mantique, nous cherchons &#224; exprimer des d&#233;pendances s&#233;mantiques entre
entit&#233;s sous forme de relations pr&#233;dicat-arguments et nous utilisons pour cela des graphes acy-
cliques orient&#233;s (DAG en abr&#233;g&#233; pour Directed Acyclic Graph) donc des descriptions de DAG.
Dans les sections 1 et 2, nous pr&#233;senterons s&#233;par&#233;ment les niveaux syntaxique et s&#233;mantique
des IG puis dans la section 3, nous montrerons comment ils interagissent dans le processus
d&#8217;analyse. Nous terminerons dans la section 4 par une comparaison avec d&#8217;autres formalismes.
</p>
<p>1 Le niveau syntaxique et les descriptions d&#8217;arbres polaris&#233;es
</p>
<p>Une description d&#8217;arbre syntaxique est un ensemble de n&#339;uds et de relations de domination
imm&#233;diate, de domination large et de pr&#233;c&#233;dence entre ces n&#339;uds. Les n&#339;uds repr&#233;sentent
des syntagmes et les relations les d&#233;pendances entre ces syntagmes. Le propri&#233;t&#233;s morpho-
syntaxiques de ces syntagmes sont exprim&#233;es par des structures de traits attach&#233;es aux n&#339;uds.
La figure 1, dans sa partie inf&#233;rieure, montre un exemple simplifi&#233; de description d&#8217;arbre,
</p>
<p>&#0; &#2; &#4; &#6;
</p>
<p>,
qui est associ&#233;e par un lexique &#224; la phrase tous aiment quelqu&#8217;un. Les n&#339;uds y sont repr&#233;sent&#233;s
par des rectangles avec pour ent&#234;te leur nom et pour corps la structure de traits attach&#233;e. Les re-
lations de domination imm&#233;diate sont repr&#233;sent&#233;es par des traits continus, celles de pr&#233;c&#233;dence
par des fl&#232;ches et les relations de domination large par des traits discontinus. Ces derni&#232;res,
qui vont permettre d&#8217;exprimer aussi bien les possibilit&#233;s d&#8217;appliquer des modifieurs &#224; certains
syntagmes et les d&#233;pendances syntaxiques non born&#233;es, peuvent &#234;tre contraintes par des struc-
tures de traits. Ainsi, la relation de domination v-max
</p>
<p>&#7;
</p>
<p>&#8; v-min est contrainte par le trait cat =v.
Le n&#339;ud v-min repr&#233;sente l&#8217;ancre1 de la description, c&#8217;est-&#224;-dire la position du verbe associ&#233;
aiment dans la description. A ce verbe peuvent &#233;ventuellement s&#8217;adjoindre une n&#233;gation, des
clitiques ou des adverbes pour former sa projection maximale v-max. La contrainte cat =v sur
la relation de domination v-max
</p>
<p>&#7;
</p>
<p>&#8; v-min exprime exactement cela puisque elle signifie que tout
n&#339;ud qui domine strictement v-min et qui est domin&#233; au sens large par v-max doit &#234;tre por-
</p>
<p>1Les ancres sont repr&#233;sent&#233;es par des rectangles color&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>type &#8722;&gt; lex
cont =  aimer
</p>
<p>1 2
</p>
<p>type &lt;&#8722; ent type &lt;&#8722; ent
</p>
<p>patient
</p>
<p>aimer
</p>
<p>agent
</p>
<p>pour&#8722;tout
</p>
<p>1
</p>
<p>type &#8722;&gt; quant
cont = pour&#8722;tout
</p>
<p>cont = vrai
</p>
<p>restriction1
</p>
<p>type &#8722;&gt; ent
cont = x
</p>
<p>portee1
</p>
<p>type &lt;&#8722; pred
</p>
<p>x
</p>
<p>Dsem
</p>
<p>aiment
</p>
<p>fonct &#8722;&gt; suj
</p>
<p>pers = 3
</p>
<p>cat &lt;&#8722; gn objet
</p>
<p>cat &lt;&#8722; gn
fonct &#8722;&gt; obj
</p>
<p>2
</p>
<p>gen = m
nb =  pl
phon = &quot;tous&quot;
fonct &lt;&#8722; ?
cat &#8722;&gt; gn
</p>
<p>gn1
</p>
<p>3
</p>
<p>tous
</p>
<p>type = logique
</p>
<p>num =  sg
gen = m
</p>
<p>phon = &quot;quelqu&#8217;un&quot;
fonct &lt;&#8722; ?
</p>
<p>cat &#8722;&gt; gn
</p>
<p>gn2
</p>
<p>nb =  pl
</p>
<p>quelqu&#8217;un
</p>
<p>synD
</p>
<p>type &#8722;&gt; ent
cont = y
</p>
<p>y
</p>
<p>sujet
</p>
<p>type &lt;&#8722; pred
</p>
<p>pred&#8722;racine
</p>
<p>temps =  pres
</p>
<p>mode =  ind
</p>
<p>phon = &quot;aiment&quot;
</p>
<p>cat &#8722;&gt; v
v&#8722;min
</p>
<p>cat = v 
</p>
<p>temps =  pres
</p>
<p>cat &lt;&#8722; v
</p>
<p>v&#8722;max
</p>
<p>mode =  ind
</p>
<p>temps =  pres
</p>
<p>mode =  ind
</p>
<p>cat &#8722;&gt; p
</p>
<p>prop
</p>
<p>cat &lt;&#8722; p
</p>
<p>phrase
</p>
<p>type &lt;&#8722; pred
</p>
<p>21 3
</p>
<p>type &#8722;&gt; quant
</p>
<p>il&#8722;existe
</p>
<p>portee2
</p>
<p>cont = il&#8722;existe
</p>
<p>restriction2
</p>
<p>cont = humain
</p>
<p>type = lex
</p>
<p>Figure 1: Description syntaxico-s&#233;mantique associ&#233;e &#224; la phrase tous aiment quelqu&#8217;un par le
lexique d&#8217;une IG.
</p>
<p>teur d&#8217;un trait pouvant s&#8217;unifier avec le trait cat=v. Lorsque le rectangle repr&#233;sentant un n&#339;ud
est muni &#224; son pied d&#8217;un crochet tourn&#233; vers le bas, cela signifie que l&#8217;ensemble des fils du
n&#339;ud a sa cardinalit&#233; fix&#233;e. Par exemple, le crochet associ&#233; au n&#339;ud prop repr&#233;sente la relation
prop &#0; {sujet, v-max, objet} qui signifie que prop a exactement trois fils distincts : sujet, v-max,
objet.
L&#8217;originalit&#233; des IG est que le traits morpho-syntaxiques associ&#233;s aux syntagmes sont polaris&#233;s.
Habituellement, un trait est associ&#233; &#224; une valeur dans un couple (trait, valeur). Dans les IG, un
trait est associ&#233; &#224; une polarit&#233; et &#224; une valeur dans un triplet (trait, polarit&#233;, valeur). Une polarit&#233;
peut &#234;tre &#0; , &#1; , &#2; et &#3; pour dire qu&#8217;un trait est n&#233;gatif, positif, neutre ordinaire ou satur&#233;.
Un trait n&#233;gatif f &#0; v repr&#233;sente une ressource attendue, un trait positif f &#1; v une ressource
disponible et un trait neutre ordinaire f &#2; v une propri&#233;t&#233; qui ne se comporte pas comme une
ressource consommable. Un trait satur&#233; f &#3; v est un trait neutre particulier qui provient de la
neutralisation d&#8217;un trait n&#233;gatif par un trait positif. Contrairement &#224; un trait neutre ordinaire, il
ne peut pas s&#8217;unifier avec un trait positif ou n&#233;gatif.
Une description d&#8217;arbre peut &#234;tre consid&#233;r&#233;e comme un ensemble de contraintes d&#233;finissant un
ensemble d&#8217;arbres syntaxiques et chacun de ces arbres peut &#234;tre vu comme un mod&#232;le de la
description correspondante. Les polarit&#233;s d&#233;finissent des contraintes sp&#233;cifiques de neutralit&#233;
sur les mod&#232;les : dans tout mod&#232;le valide, tout trait positif doit avoir &#233;t&#233; neutralis&#233; exactement
par un trait n&#233;gatif correspondant et r&#233;ciproquement. Pour une d&#233;finition formelle de cette</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La s&#233;mantique dans les grammaires d&#8217;interaction
</p>
<p>notion de mod&#232;le, le lecteur pourra se reporter &#224; (Perrier, 2002).
S&#8217;il est n&#233;cessaire de d&#233;finir rigoureusement cette notion de mod&#232;le, il est important ensuite de
pouvoir calculer les mod&#232;les d&#8217;une description donn&#233;e. C&#8217;est l&#8217;op&#233;ration de neutralisation de
traits qui nous en donne les moyens. Cette op&#233;ration consiste dans une description &#224; identifier
deux n&#339;uds porteurs de traits duaux, c&#8217;est-&#224;-dire qui ont le m&#234;me nom mais des polarit&#233;s op-
pos&#233;es. Par exemple, sur la figure 1, les n&#339;uds syntaxiques gn1et sujet de
</p>
<p>&#0; &#1; &#2; &#3;
</p>
<p>portent les traits
duaux cat &#0; gn et cat &#1; gn. La fusion des deux n&#339;uds va permettre de neutraliser les deux
traits qui vont s&#8217;unifier en un trait cat &#2; gn. Il se trouve qu&#8217;ici, incidemment, on obtient une
deuxi&#232;me neutralisation : celle des traits fonct &#1; ?2 et fonct &#0; suj qui vont s&#8217;unifier dans fonct
</p>
<p>&#2; suj. Le n&#339;ud qui r&#233;sulte de la fusion de gn1et sujet est le n&#339;ud gn1.sujet que l&#8217;on peut voir
sur la figure 2.
En it&#233;rant l&#8217;op&#233;ration de neutralisation de traits, nous allons pouvoir sp&#233;cifier pas &#224; pas une
description initiale et construire progressivement un mod&#232;le neutre de celle-ci. Dans notre
exemple, apr&#232;s 4 neutralisations de traits effectu&#233;s sur
</p>
<p>&#0; &#1; &#2; &#3;
</p>
<p>, on obtient l&#8217;arbre syntaxique com-
pl&#232;tement sp&#233;cifi&#233; de la figure 2. Cette fa&#231;on proc&#233;durale d&#8217;obtenir un mod&#232;le est &#233;quivalente
</p>
<p>synD
</p>
<p>semD type &lt;&#8722; pred
</p>
<p>21 3
</p>
<p>portee1
type &lt;&#8722; pred
</p>
<p>21 3
</p>
<p>il&#8722;existe
</p>
<p>portee2
</p>
<p>type &lt;&#8722;&gt; ent
cont = x
</p>
<p>type &lt;&#8722;&gt; ent
cont = y
</p>
<p>restriction2
</p>
<p>y . patient
</p>
<p>cont = il&#8722;existe
</p>
<p>restriction1
</p>
<p>type &#8722;&gt; quant
</p>
<p>1 2
</p>
<p>type = logique
</p>
<p>cont = vrai
</p>
<p>x . agent
</p>
<p>type &#8722;&gt; lex
cont =  aimer
</p>
<p>aimer
</p>
<p>type &lt;&#8722; pred
</p>
<p>pred&#8722;racine
</p>
<p>type &#8722;&gt; quant
</p>
<p>pour&#8722;tout
</p>
<p>cont = pour&#8722;tout
</p>
<p>temps =  pres
</p>
<p>mode =  ind
</p>
<p>cat &lt;&#8722;&gt; v
</p>
<p>v&#8722;max . v&#8722;min
</p>
<p>phon = &quot;aiment&quot;
</p>
<p>phon = &quot;quelqu&#8217;un&quot;
</p>
<p>fonct &lt;&#8722;&gt; obj
cat &lt;&#8722;&gt; gn
</p>
<p>gn2 . objet
</p>
<p>num =  sg
</p>
<p>gen = m
</p>
<p>gn1 . sujet
</p>
<p>cat &lt;&#8722;&gt; gn
funct &lt;&#8722;&gt; suj
</p>
<p>phon = &quot;tous&quot;
</p>
<p>num =  pl
</p>
<p>pers = 3
gen = m
</p>
<p>temps =  pres
</p>
<p>mode =  ind
</p>
<p>cat &lt;&#8722;&gt; p
</p>
<p>prop . phrase
</p>
<p>type = lex
</p>
<p>cont = humain
</p>
<p>Figure 2: Description syntaxico-s&#233;mantique &#224; la fin de l&#8217;analyse syntaxique de la phrase tous
aiment quelqu&#8217;un.
</p>
<p>&#224; la fa&#231;on d&#233;clarative de le d&#233;finir (Perrier, 2003). Il est &#224; noter que l&#8217;op&#233;ration de neutralisa-
tion de traits qui permet de composer les descriptions entre elles est beaucoup plus riche que
les op&#233;rations de composition d&#8217;arbres utilis&#233;es par les formalismes fond&#233;s sur les arbres tels
que les TAG. Elle permet de superposer partiellement des arbres et s&#8217;apparente beaucoup plus
&#224; l&#8217;unification de structures de traits d&#8217;HPSG mais avec le contr&#244;le par les polarit&#233;s en plus.
</p>
<p>2Le symbole &#8220;?&#8221; repr&#233;sente ici la valeur ind&#233;termin&#233;e, c&#8217;est-&#224;-dire, comme les valeurs sont des disjonctions
d&#8217;atomes, la disjonctions de tous les atomes du domaine correspondant au trait, fonct en l&#8217;occurrence.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>2 Le niveau s&#233;mantique et les descriptions de DAG polaris&#233;es
</p>
<p>Nous ne proposons pas de formaliser une th&#233;orie s&#233;mantique particuli&#232;re mais plut&#244;t de fournir
un cadre pour repr&#233;senter diff&#233;rentes s&#233;mantiques objets. Pour illuster notre propos, nous
choisirons comme s&#233;mantique objet le calcul des pr&#233;dicats mais nous aurions tr&#232;s bien pu pren-
dre les graphes s&#233;mantiques de la th&#233;orie Sens-Texte (Mel&#8217;cuk, 1988). Certes, le choix n&#8217;est pas
totalement arbitraire car le calcul des pr&#233;dicats permet d&#8217;exprimer la notion de port&#233;e, notion
qui pose des probl&#232;mes d&#8217;explosion combinatoire quand on cherche &#224; calculer une repr&#233;senta-
tion s&#233;mantique. Ce n&#8217;est pas un hasard si c&#8217;est en s&#233;mantique informatique, dans le domaine de
la traduction, qu&#8217;ont vu le jour depuis une dizaine d&#8217;ann&#233;es une s&#233;rie de langages de repr&#233;sen-
tation s&#233;mantique qui visent &#224; r&#233;soudre ce probl&#232;me en utilisant l&#8217;id&#233;e de sous-sp&#233;cification
(Reyle, 1993; Bos, 1995; Egg et al., 1998; Copestake et al., 1999).
Nous proposons de reprendre au niveau s&#233;mantique les deux id&#233;es-forces qui sont au c&#339;ur
de notre repr&#233;sentation de la syntaxe : l&#8217;utilisation de la notion de description de structure
pour exprimer la sous-sp&#233;cification et celle de polarit&#233; pour contr&#244;ler la composition d&#8217;une
structure compl&#232;tement sp&#233;cifi&#233;e. La diff&#233;rence avec le niveau syntaxique est que nous al-
lons chercher &#224; repr&#233;senter des d&#233;pendances s&#233;mantiques entre objets sous forme de relations
pr&#233;dicat-arguments donc les structures s&#233;mantiques compl&#232;tement sp&#233;cifi&#233;es seront des DAG
et non des arbres localement ordonn&#233;s : en effet, la pr&#233;c&#233;dence entre n&#339;uds n&#8217;a plus de sens
et un objet s&#233;mantique peut &#234;tre argument de plusieurs pr&#233;dicats &#224; la fois. De fa&#231;on analogue
au niveau syntaxique, une description de DAG s&#233;mantique permettra de repr&#233;senter un ensem-
ble de DAG qui seront ses mod&#232;les. Si nous choisissons comme s&#233;mantique objet le calcul
des pr&#233;dicats, un DAG sera la repr&#233;sentation g&#233;om&#233;trique d&#8217;une formule logique et ses n&#339;uds
seront soit des pr&#233;dicats, soit des individus. Les seules relations qui ont du sens entre les n&#339;uds
d&#8217;une description de DAG sont les relations pr&#233;dicat-arguments qui sont repr&#233;sent&#233;es par des
relations de domination imm&#233;diate et les relations de port&#233;e qui sont repr&#233;sent&#233;es par des re-
lations de domination large. Comme au niveau syntaxique, les n&#339;uds sont &#233;tiquet&#233;s par des
structures de traits polaris&#233;s qui expriment cette fois des propri&#233;t&#233;s s&#233;mantiques. La notion de
mod&#232;le neutre d&#8217;une description de DAG s&#233;mantique se d&#233;finit de la m&#234;me fa&#231;on qu&#8217;au niveau
syntaxique et la m&#234;me op&#233;ration de neutralisation de traits nous fournit une m&#233;thode de con-
struction pas &#224; pas de ces mod&#232;les. Pour une d&#233;finition formelle compl&#232;te, le lecteur peut se
r&#233;f&#233;rer &#224; (Perrier, 2003).
La figure 1, dans sa partie sup&#233;rieure, nous montre un exemple de description de DAG s&#233;man-
tique,
</p>
<p>&#0; &#1; &#0;
</p>
<p>&#0; . Dans cet exemple, nous nous contentons d&#8217;utiliser deux traits type et cont. Le
premier indique le type s&#233;mantique du n&#339;ud, pr&#233;dicat lexical (lex), op&#233;rateur logique (logique)
ou quantificateur (quant) 3, et le second son contenu. Les deux quantificateurs associ&#233;s &#224; tous
et quelqu&#8217;un sont repr&#233;sent&#233;s &#224; l&#8217;aide de pr&#233;dicats &#224; 3 arguments : la variable quantifi&#233;e, sa
restriction qui permet de caract&#233;riser logiquement l&#8217;entit&#233; repr&#233;senter par cette variable et la
port&#233;e du quantificateur. Dans notre exemple, la restriction correspondant &#224; tous est vide d&#8217;o&#249;
la valeur vrai de son trait cont alors que celle correspondant &#224; quelqu&#8217;un est le pr&#233;dicat humain.
Comme au niveau syntaxique, des contraintes permettent de fixer la cardinalit&#233; de l&#8217;ensemble
des fils d&#8217;un n&#339;ud et elles sont aussi repr&#233;sent&#233;es graphiquement par des crochets tourn&#233;s vers
le bas. Par exemple, la contrainte pour-tout &#2; [x, restriction1, portee1] exprime le fait que
pour-tout a exactement trois fils x, restriction1, portee1 mais &#224; la diff&#233;rence de la syntaxe, pour
distinguer leurs r&#244;les dans le pr&#233;dicat, ils sont ordonn&#233;s dans une liste et leur rang est not&#233; sur
l&#8217;arc repr&#233;sentant leur r&#244;le dans le pr&#233;dicat. Comme un m&#234;me n&#339;ud peut avoir plusieurs p&#232;res,
nous avons aussi des contraintes fixant la cardinalit&#233; de l&#8217;ensemble des p&#232;res d&#8217;un n&#339;ud. Par
exemple, dans
</p>
<p>&#0; &#1; &#0;
</p>
<p>&#0; , la contrainte { } &#2; pred-racine exprime que le n&#339;ud pred-racine a son
ensemble de p&#232;res qui est vide donc que c&#8217;est une racine. Enfin, les relations de port&#233;e peuvent
</p>
<p>3La valeur pred est une abr&#233;viation de la disjonction
&#1; &#3; &#5; &#7; &#1; &#10; &#11; &#13; &#15; &#17; &#3; &#7; &#15; &#17; &#21; &#23; &#25;
</p>
<p>, &#233;tant donn&#233; que les valeurs de
traits sont des disjonctions finies d&#8217;atomes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La s&#233;mantique dans les grammaires d&#8217;interaction
</p>
<p>&#234;tre contraintes de la m&#234;me fa&#231;on que les relations de domination large au niveau syntaxique
avec des structures de traits neutres les &#233;tiquetant.
La description
</p>
<p>&#0; &#1; &#0;
</p>
<p>&#0; a exactement deux mod&#232;les neutres au sens o&#249; nous le d&#233;finissons dans
(Perrier, 2003) sous forme de deux DAG qui peuvent &#234;tre obtenus par 3 neutralisations de
polarit&#233;s (le lecteur pourra lui-m&#234;me effectuer le calcul). Pour ensuite interpr&#233;ter ces deux
DAG obtenus sous forme de formules logiques, il est n&#233;cessaire de disposer d&#8217;une traduction
logique de chacun de leurs n&#339;uds. On peut le faire &#224; l&#8217;aide du lambda-calcul en associant un
lambda-terme &#224; chaque n&#339;ud et en interpr&#233;tant chaque relation p&#232;re-fils comme une applica-
tion du lambda-terme associ&#233; au n&#339;ud p&#232;re &#224; ceux qui sont associ&#233;s &#224; ses fils. Si on associe
aux n&#339;uds pour-tout et il-existe les lambda-termes respectifs
</p>
<p>&#0; &#2; &#0; &#2;
</p>
<p>&#3; &#4;
</p>
<p>&#2;
</p>
<p>&#4; &#4;
</p>
<p>&#0; &#2; &#6; &#6;
</p>
<p>&#4;
</p>
<p>&#2; &#2; &#6; &#6;
</p>
<p>et
&#0; &#2; &#0; &#2;
</p>
<p>&#3; &#9;
</p>
<p>&#2;
</p>
<p>&#4; &#4;
</p>
<p>&#0; &#2; &#6; &#11;
</p>
<p>&#4;
</p>
<p>&#2; &#2; &#6; &#6;
</p>
<p>, o&#249;
&#2;
</p>
<p>,
&#0;
</p>
<p>et
&#2;
</p>
<p>correspondent &#224; la variable quantifi&#233;e, la restriction et
la port&#233;e, le lecteur en d&#233;duira facilement l&#8217;interpr&#233;tation des deux DAG par les deux formules
logiques &#4;
</p>
<p>&#2;
</p>
<p>&#4; &#9;
</p>
<p>&#7;
</p>
<p>&#4; &#13;
</p>
<p>&#8; &#10; &#12; &#14; &#16;
</p>
<p>&#4;
</p>
<p>&#7; &#6; &#11; &#12; &#14; &#10; &#17; fl
</p>
<p>&#4;
</p>
<p>&#2; &#21; &#7; &#6; &#6; &#6;
</p>
<p>et &#9;
&#7;
</p>
<p>&#4; &#13;
</p>
<p>&#8; &#10; &#12; &#14; &#16;
</p>
<p>&#4;
</p>
<p>&#7; &#6; &#11;
</p>
<p>&#4;
</p>
<p>&#2; &#12; &#14; &#10; &#17; fl
</p>
<p>&#4;
</p>
<p>&#2; &#21; &#7; &#6; &#6;
</p>
<p>correspon-
dant aux deux lectures possibles de la phrase tous aiment quelqu&#8217;un.
La proposition que nous faisons ici se distingue de la plupart des langages donn&#233;s en r&#233;f&#233;rence
au d&#233;but de la section par le fait qu&#8217;elle fournit un moyen de contr&#244;ler la saturation des struc-
tures s&#233;mantiques sous-sp&#233;cifi&#233;es gr&#226;ce au m&#233;canisme des polarit&#233;s. Il est un langage qui s&#8217;en
rapproche, c&#8217;est la Hole Semantics (Bos, 1995) : les n&#339;uds des descriptions y sont soit des
constantes, soit des trous et c&#8217;est le m&#233;canisme d&#8217;identification un &#224; un des trous par des con-
stantes qui fournit le moyen de r&#233;duire la sous-sp&#233;cification et de produire les mod&#232;les d&#8217;une
description donn&#233;e. Dans l&#8217;exemple du calcul des pr&#233;dicats choisi comme s&#233;mantique objet,
nous nous distinguons aussi de ce qui se fait dans la plupart des langages pr&#233;c&#233;demment cit&#233;s
qui n&#8217;identifient les n&#339;uds qu&#8217;avec des pr&#233;dicats. Les n&#339;uds de nos descriptions peuvent &#234;tre
soit des pr&#233;dicats, soit des individus. Cette uniformisation de la repr&#233;sentation pr&#233;sente deux
avantages : elle permet d&#8217;aller plus loin dans la sous-sp&#233;cification en laissant ind&#233;termin&#233; le
type de l&#8217;argument d&#8217;un pr&#233;dicat, individu ou pr&#233;dicat lui-m&#234;me. La deuxi&#232;me raison est que
cela simplifie beaucoup l&#8217;interface avec la syntaxe, les syntagmes pouvant correspondre aussi
bien &#224; des individus qu&#8217;&#224; des pr&#233;dicats.
</p>
<p>3 L&#8217;interaction entre syntaxe et s&#233;mantique dans le processus
d&#8217;analyse
</p>
<p>Nous venons de d&#233;crire s&#233;par&#233;ment les niveaux syntaxique et s&#233;mantique. Leur liage s&#8217;effectue
par une simple fonction qui projette tout n&#339;ud syntaxique sur au plus un n&#339;ud s&#233;mantique.
La figure 1 nous en fournit un exemple; la fonction de liage y est repr&#233;sent&#233;e &#224; l&#8217;aide de traits
pointill&#233;s. On y constate que certains n&#339;uds syntaxiques n&#8217;ont aucune image s&#233;mantique et,
dans l&#8217;autre sens, certains n&#339;uds s&#233;mantiques, tels que les pr&#233;dicats repr&#233;sentant les quantifica-
teurs, n&#8217;ont aucun ant&#233;c&#233;dent syntaxique.
Les IG sont lexicalis&#233;es. Une entr&#233;e lexicale associe un mot &#224; une description syntaxique et
une description s&#233;mantique coupl&#233;es par la fonction de liage. Dans la description syntaxique,
un n&#339;ud y joue le r&#244;le privil&#233;gi&#233; d&#8217;ancre, c&#8217;est-&#224;-dire que c&#8217;est lui qui repr&#233;sente la position du
mot dans l&#8217;arbre syntaxique correspondant &#224; la description.
Analyser une phrase avec les IG consiste tout d&#8217;abord &#224; s&#233;lectionner une entr&#233;e dans le lexique
pour chacun des mots de la phrase. En juxtaposant toutes les descriptions d&#8217;arbres syntaxiques
s&#233;lectionn&#233;es, on obtient une unique description qui doit &#234;tr compl&#233;t&#233;e par des relations de
pr&#233;c&#233;dence entre les ancres exprimant l&#8217;ordre des mots dans la phrase et par un n&#339;ud racine,
ici le n&#339;ud phrase, repr&#233;sentant la phrase attendue comme but de l&#8217;analyse. Il en r&#233;sulte une
description
</p>
<p>&#0; &#1; &#2; &#3;
</p>
<p>, telle celle que l&#8217;on peut voir &#224; la figure 1, qui constitue le point de d&#233;part de
l&#8217;analyse. De fa&#231;on analogue, on r&#233;unit les descriptions de DAG s&#233;mantiques s&#233;lectionn&#233;es du
lexique en une unique description
</p>
<p>&#0; &#1; &#24;
</p>
<p>&#0; coupl&#233;e avec
&#0; &#1; &#2; &#3;
</p>
<p>, comme on l&#8217;observe sur la figure</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>1. On ajoute une racine pred-racine &#224;
&#0; &#1; &#0;
</p>
<p>&#0; li&#233;e &#224; la racine syntaxique phrase pour exprimer le
but de l&#8217;analyse au niveau s&#233;mantique.
Le processus d&#8217;analyse est dirig&#233; par la syntaxe, c&#8217;est-&#224;-dire qu&#8217;il s&#8217;effectue en it&#233;rant les neu-
tralisations de traits dans
</p>
<p>&#0; &#1; &#3; &#5;
</p>
<p>, jusqu&#8217;&#224; que l&#8217;on obtienne un arbre syntaxique compl&#232;tement
sp&#233;cifi&#233; o&#249; tous les traits sont neutres. Dans ce processus, la fonction de liage joue deux r&#244;les :
</p>
<p>&#0; Elle contribue &#224; sp&#233;cifier progressivement
&#0; &#1; &#0;
</p>
<p>&#0; car chaque fusion de deux n&#339;uds syn-
taxiques entra&#238;ne la fusion des n&#339;uds s&#233;mantiques qui sont leurs images, si elles existent.
</p>
<p>&#0; Le m&#234;me m&#233;canisme peut entra&#238;ner une r&#233;action du niveau s&#233;mantique sur le niveau
syntaxique. Certaines neutralisations au niveau syntaxique vont &#233;chouer parce que les
neutralisations qu&#8217;elles entra&#238;nent au niveau s&#233;mantique &#233;chouent aussi.
</p>
<p>A la fin d&#8217;une analyse syntaxique qui r&#233;ussit, la description s&#233;mantique
&#0; &#1; &#0;
</p>
<p>&#0; peut rester sous-
sp&#233;cifi&#233;e comme c&#8217;est le cas dans notre exemple et comme le montre la figure 2. Si l&#8217;on souhaite
obtenir tous les mod&#232;les de
</p>
<p>&#0; &#1; &#0;
</p>
<p>&#0; , il faut continuer le processus de neutralisation de traits mais
au niveau s&#233;mantique cette fois. Si nous le faisons dans notre exemple, nous allons, apr&#232;s 3
neutralisations, obtenir les deux DAG s&#233;mantiques attendus correspondant aux deux relations
de port&#233;e possibles entre les deux quantificateurs. Cet exemple est tr&#232;s simple mais le lecteur
trouvera des exemples de mod&#233;lisation de ph&#233;nom&#232;nes linguistiques plus complexes dans (Per-
rier, 2003) (propositions relatives appositives et restrictives, verbes &#224; mont&#233;e et &#224; contr&#244;le du
sujet, etc.).
D&#8217;un point de vue th&#233;orique, un tel processus d&#8217;analyse est extr&#234;mement co&#251;teux mais, comme
nous le montrons dans (Bonfante et al., 2003), les polarit&#233;s nous fournissent des m&#233;thodes orig-
inales d&#8217;analyse qui permettent en pratique d&#8217;&#233;viter l&#8217;explosion combinatoire. Ces m&#233;thodes
ont &#233;t&#233; impl&#233;ment&#233;es dans l&#8217;analyseur syntaxique LEOPAR qui int&#232;gre la s&#233;mantique et qui est
t&#233;l&#233;chargeable librement avec une grammaire et un lexique jouets du fran&#231;ais4.
</p>
<p>4 Autres approches de l&#8217;interface syntaxe-s&#233;mantique
</p>
<p>Les IG pr&#233;sentent certaines similarit&#233;s avec les TAG synchrones (Shieber &amp; Schabes, 1990;
Shieber, 1994). Les deux formalismes visent &#224; lier deux niveaux de repr&#233;sentation qui utilisent
le m&#234;me principe de composition : neutralisation de polarit&#233;s pour les IG et adjonction pour
les TAG. N&#233;anmoins, les deux formalismes ont de profondes diff&#233;rences. D&#233;j&#224; les TAG sont
limit&#233;es par l&#8217;adjonction qui ne permet pas de faire de la superposition de structures mais en
outre l&#8217;interface syntaxe-s&#233;mantique y est tr&#232;s rigide : toute adjonction au niveau s&#233;mantique
doit &#234;tre coupl&#233;e avec une adjonction au niveau syntaxique, si bien que les arbres de d&#233;rivation
syntaxique et s&#233;mantique sont isomporphes. Cet isomorphisme est un facteur majeur de rigidit&#233;
m&#234;me s&#8217;il peut &#234;tre un peu assoupli (Rambow &amp; Satta, 1996).
L&#8217;autre approche de la s&#233;mantique dans les TAG qui s&#8217;appuie sur les arbres de d&#233;rivation syn-
taxique est aussi tr&#232;s rigide. La repr&#233;sentation s&#233;mantique issue de l&#8217;arbre de d&#233;rivation est
parfois en contradiction avec la repr&#233;sentation souhait&#233;e (Candito &amp; Kahane, 1998), ce qui a
d&#8217;ailleurs amen&#233; &#224; l&#8217;introduction de nouveaux formalismes (Rambow et al., 1995). D&#8217;autre part,
elle se pr&#234;te mal &#224; la repr&#233;sentation de ph&#233;nom&#232;nes comme la quantification qui ne d&#233;coulent
pas m&#233;caniquement de la syntaxe.
Gardent et Kallmeyer (2003) proposent une nouvelle approche qui s&#8217;appuie sur les arbres syn-
taxiques d&#233;riv&#233;s. Chaque arbre d&#233;riv&#233; est coupl&#233; avec une formule logique sous-sp&#233;cifi&#233;e dans
le cadre de la Hole Semantics (Bos, 1995). L&#8217;interface syntaxe-s&#233;mantique utilise en plus des
traits associ&#233;s aux n&#339;uds des arbres syntaxiques d&#233;riv&#233;s et qui indiquent avec quels individus
</p>
<p>4L&#8217;adresse o&#249; le logiciel peut &#234;tre t&#233;l&#233;charg&#233; est : www.loria.fr/equipes/calligramme/leopar.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La s&#233;mantique dans les grammaires d&#8217;interaction
</p>
<p>ou pr&#233;dicats s&#233;mantiques ils sont en correspondance. Compte tenu du fait que la Hole Seman-
tics est tr&#232;s proche de la repr&#233;sentation s&#233;mantique dans les IG, on a une approche semblable,
la principale diff&#233;rence restant la repr&#233;sentation du niveau syntaxique.
Du c&#244;t&#233; des CG, de Groote (2001) et Muskens (2003) ont des propositions voisines l&#8217;une de
l&#8217;autre qui visent &#224; assouplir et &#224; g&#233;n&#233;raliser les CG. Ils proposent un formalisme &#224; plusieurs
niveaux param&#233;trables. L&#8217;un de ces niveaux peut &#234;tre instanci&#233; par la syntaxe et un autre par la
s&#233;mantique. A chaque niveau, c&#8217;est le fragment implicatif de la logique lin&#233;aire intuitionniste
qui est utilis&#233; pour g&#232;rer la composition des structures, ce qui pr&#233;sente certaines limites dans
le pouvoir d&#8217;expression. En outre, tous les niveaux sont isomorphes en un certain sens : toute
op&#233;ration &#224; un niveau qui est une op&#233;ration de d&#233;duction logique &#233;lementaire (application ou
abstraction) doit &#234;tre coupl&#233;e avec une op&#233;ration du m&#234;me type &#224; l&#8217;autre niveau. Cet isompor-
phisme ne conduit pas &#224; la m&#234;me rigidit&#233; que les TAG synchrones du fait la latitude qui est
offerte quant au langage d&#8217;instanciation de chaque niveau.
On trouve aussi une grande souplesse dans la repr&#233;sentation de l&#8217;interface syntaxe-s&#233;mantique
du c&#244;t&#233; des grammaires de d&#233;pendance dans le formalisme propos&#233; par Kahane (2002), les
Grammaires d&#8217;Unification Sens-Texte (GUST). Suivant la th&#233;orie Sens-Texte (Mel&#8217;cuk, 1988),
celui-ci comporte 3 niveaux : s&#233;mantique, syntaxique et phonologique. Les structures repr&#233;sen-
t&#233;es au niveau s&#233;mantique et syntaxique sont respectivement des DAG et des arbres et le liage
entre les deux se fait par ensembles de n&#339;uds car, au niveau syntaxique, les n&#339;uds repr&#233;sentent
des mots et non des syntagmes. Le fait que la quantification et les relations de port&#233;e ne soient
pas trait&#233;es au niveau s&#233;mantique et que les n&#339;uds repr&#233;sentent des mots ne rend pas n&#233;ces-
saire la repr&#233;sentation de la sous-sp&#233;cification comme dans une approche syntagmatique car les
d&#233;pendances non born&#233;es sont trait&#233;es de la m&#234;me fa&#231;on que les d&#233;pendances locales. Dans sa
pr&#233;sentation originelle, les GUST utilisaient l&#8217;unification comme m&#233;canisme de composition
des structures sans syst&#232;me de contr&#244;le de la saturation de ces structures. Cette faiblesse est
maintenant corrig&#233;e de la m&#234;me fa&#231;on que dans les IG avec un syst&#232;me de polarit&#233;s (Kahane,
2004).
L&#8217;int&#233;gration de la Minimal Recursion Semantics dans HPSG (Copestake et al., 1999) four-
nit un autre exemple de souplesse de l&#8217;interface syntaxe-s&#233;mantique qui est assur&#233;e par la co-
indexation dans des structures de traits codant en m&#234;me temps le niveau syntaxique et le niveau
s&#233;mantique. L&#8217;unification sert de principe de composition de structures et elle peut &#234;tre vue
comme une g&#233;n&#233;ralisation de la superposition partielle de DAG, telle qu&#8217;elle se pr&#233;sente dans
les IG. Lui manque un m&#233;canisme de contr&#244;le de la saturation des structures qui est garantie a
posteriori par des principes de bonne formation.
</p>
<p>Conclusion
</p>
<p>L&#8217;int&#233;gration de la s&#233;mantique dans les IG que nous proposons se veut avant tout un cadre formel
pour exprimer la repr&#233;sentation s&#233;mantique d&#8217;un &#233;nonc&#233; et l&#8217;interface avec sa repr&#233;sentation
syntaxique. Elle ne pr&#233;juge en rien des choix linguistiques qui en permettent la r&#233;alisation. Ce
cadre formel se caract&#233;rise par trois propri&#233;t&#233;s importantes : la notion de description permet
d&#8217;exprimer la sous-sp&#233;cification aux deux niveaux, le m&#233;canisme de composition des structures
compl&#232;tement sp&#233;cifi&#233;es tant au niveau s&#233;mantique que syntaxique est guid&#233; par un syst&#232;me de
polarit&#233;s et l&#8217;interface syntaxe-s&#233;mantique est souple et simple.
</p>
<p>Remerciements
</p>
<p>Merci &#224; Benoit Crabb&#233; et Sylvain Kahane pour la relecture de cet article et leurs commentaires
pertinents.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Perrier
</p>
<p>R&#233;f&#233;rences
</p>
<p>BLACHE P. (2001), Les Grammaires de Propri&#233;t&#233;s : des contraintes pour le traitement automatique des
langues naturelles, Herm&#232;s Sciences.
</p>
<p>BONFANTE G., GUILLAUME B., PERRIER G. (2003), Analyse syntaxique &#233;lectrostatique, Traitement
Automatique des Langues, Vol. , A para&#238;tre.
</p>
<p>BOS J. (1995), Predicate logic unplugged, dans P. DEKKER &amp; M. STOKHOF, Eds., 10th Amsterdam
Colloquium, p. 133&#8211;142.
</p>
<p>CANDITO M.-H., KAHANE S. (1998), Can the derivation tree represent a semantic graph? an answer
in the light of Meaning-Text Theory, TAG+4, Philadelphia, p. 21&#8211;24.
</p>
<p>CARPENTER B. (1998), Type-logical Semantics, Cambridge, Massachusetts, MIT Press.
</p>
<p>COPESTAKE A., FLICKINGER D., SAG I. (1999), Minimal Recursion Semantics - an Introduction,
Draft.
</p>
<p>DE GROOTE P. (2001), Towards Abstract Categorial Grammars, Association for Computational Linguis-
tics, 39th Annual Meeting and 10th Conference of the European Chapter,Toulouse, France, p. 148&#8211;155.
</p>
<p>EGG M., NIEHREN J., RUHRBERG P., XU F. (1998), Constraints over lambda structures in semantic un-
derspecification., 17th International Conference on Computational Linguistics and 36th Annual Meeting
of the Association for Computational Linguistics (COLING/ACL&#8217;98), Montreal,Quebec, Canada.
</p>
<p>GARDENT C., KALLMEYER L. (2003), Semantic construction in FTAG, EACL&#8217;2003, Budapest, Hun-
gary.
</p>
<p>KAHANE S. (2002), Grammaire d&#8217;Unification Sens-Texte - Vers un mod&#232;le math&#233;matique articul&#233; de la
langue, Habilitation &#224; diriger des recherches, Universit&#233; Paris 7.
</p>
<p>KAHANE S. (2004), Grammaires d&#8217;unification polaris&#233;es, 11i&#232;me Conf&#233;rence annuelle sur le Traite-
ment Automatique des Langues Naturelles (TALN&#8217;04), F&#232;s, Maroc, France,, Soumis.
</p>
<p>MEL&#8217;CUK I. (1988), Dependency Syntax: Theory and Practice, Albany, N.Y.: The SUNY Press.
</p>
<p>MONTAGUE R. (1970), Universal grammar, Theoria, Vol. 36, 373&#8211;398, Reprinted in R. Thomason,
editor, Formal Philosophy, 188-221, New Haven: Yale University Press.
</p>
<p>MUSKENS R. (2003), Lambda Grammars, Prospects and Advances in the Syntax/Semantics Interface,
Lorraine-Saarland Workshop Series, Nancy, p. 29&#8211;32.
</p>
<p>PERRIER G. (2002), Descriptions d&#8217;arbres avec polarit&#233;s : les grammaires d&#8217;interaction, 9i&#232;me Con-
f&#233;rence annuelle sur le Traitement Automatique des Langues Naturelles (TALN&#8217;02), Nancy, France, 2002.
</p>
<p>PERRIER G. (2003), Les grammaires d&#8217;interaction, Habilitation &#224; diriger des recherches, Universit&#233;
Nancy2, Film de la soutenance visible &#224; l&#8217;URL: http://www.inria.fr/multimedia/Didactheque-fra.html.
</p>
<p>RAMBOW O., SATTA G. (1996), Synchronous Models of Language, ACL&#8217;96, Santa Cruz.
</p>
<p>RAMBOW O., VIJAY-SHANKER K., WEIR D. (1995), D-tree grammars, ACL&#8217;95, Cambridge, USA, p.
151&#8211;158.
</p>
<p>REYLE U. (1993), Dealing with ambiguities by underspecification: Constrcution, Representation and
Deduction, Journal of Semantics, Vol. 10, 123&#8211;179.
</p>
<p>SHIEBER S. (1994), Restricting the Weak-Generative Capacity of Synchronous Tree-Adjoining Gram-
mars, Computational Intelligence, Vol. 10(4), 371&#8211;385.
</p>
<p>SHIEBER S., SCHABES Y. (1990), Synchronous Tree-Adjoining Grammars, CoLing&#8217;90, Helsinki,
volume 3, p. 1&#8211;6.
</p>
<p>VIJAY-SHANKAR K. (1992), Using description of trees in a tree adjoining grammar, Computational
Linguistics, Vol. 18(4), 481&#8211;517.</p>

</div></div>
</body></html>