<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un mod&#232;le d&#8217;interpr&#233;tation constructionnelle pour les expressions r&#233;f&#233;rentielles extensionnelles</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, Session Poster, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Un mod&#232;le d&#8217;interpr&#233;tation constructionnelle
pour les expressions r&#233;f&#233;rentielles extensionnelles
</p>
<p>Guillaume Pitel, Jean-Paul Sansonnet
LIMSI-CNRS, BP133 F-91403 Orsay Cedex
</p>
<p>pitel@limsi.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans le dialogue finalis&#233;, les expressions r&#233;f&#233;rentielles portant sur les objets du contexte peuvent
contenir des pr&#233;dicats vagues ou relationnels, qu&#8217;il est difficile de traiter avec une logique propo-
sitionnelle. Inversement, les approches adapt&#233;es &#224; ces types de pr&#233;dicats sont difficilement im-
pl&#233;mentables dans un mod&#232;le g&#233;n&#233;rique et adaptable aux th&#233;ories d&#8217;analyse linguistique. Nous
proposons un mod&#232;le d&#8217;interpr&#233;tation constructionnelle inspir&#233; des grammaires de construction
qui permet de mod&#233;liser le processus de r&#233;solution d&#8217;expressions r&#233;f&#233;rentielles extensionnelles
tout en restant compatible avec la grammaire dont nous nous sommes inspir&#233;s.
</p>
<p>In practical dialogue, vague or relational predicates play an important role in referential expres-
sions that refer to the objects in the context. These kind of referential expressions are difficult
to handle using propositional logic but in the same time, approaches dealing with such predi-
cates are hardly adaptable to language analysis theories. We propose a model of constructional
interpretation that allow modelisation of resolution of extensional referential expressions while
keeping compatibility with construction grammar theory.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Grammaire de Construction, R&#233;f&#233;rence Extensionnelle, Domaines de R&#233;f&#233;rence.
Construction Grammar, Extensionnal Reference Resolution, Reference Domains.
</p>
<p>1 Introduction
</p>
<p>Les probl&#232;mes pos&#233;s par certains cas de la r&#233;solution des expressions r&#233;f&#233;rentielles extension-
nelles1 est incontournable dans le cadre du dialogue finalis&#233;2. Nous avons propos&#233; dans (Pitel
</p>
<p>1Ce traitement consiste &#224; mettre en relation une expression r&#233;f&#233;rentielle extensionnelle (qui d&#233;signe un en-
semble fini d&#8217;objets dans le contexte du dialogue) avec les repr&#233;sentations internes &#224; l&#8217;application. Ce type de
r&#233;f&#233;rence se distingue des r&#233;f&#233;rences intensionnelles comme &#171; Tous les chercheurs sont en col&#232;re &#187; ou anapho-
riques &#171; Moi, j&#8217;ai mis le bureau dans le camion et lui &#8709; la chaise dans la voiture &#187;.
</p>
<p>2Dialogue dirig&#233; par une t&#226;che &#224; effectuer. En g&#233;n&#233;ral, le dialogue finalis&#233; implique une repr&#233;sentation du
contexte du dialogue, car la t&#226;che &#224; r&#233;aliser d&#233;pend des &#233;l&#233;ments pr&#233;sents dans ce contexte. Par exemple dans les</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Pitel, J.-P. Sansonnet
</p>
<p>&amp; Sansonnet, 2003) un mod&#232;le de r&#233;solution fond&#233; sur une repr&#233;sentation fonctionnelle des
pr&#233;dicats et l&#8217;utilisation de domaines de r&#233;f&#233;rence (Salmon-Alt, 2001), qui permet d&#8217;avoir un
traitement fin des caract&#233;ristiques tout en restant g&#233;n&#233;rique (par opposition aux approches ba-
s&#233;es sur une repr&#233;sentation en logique du premier ordre qui n&#233;cessitent pour &#234;tre affin&#233;es l&#8217;ajout
d&#8217;un module externe de r&#233;solution de la r&#233;f&#233;rence ainsi qu&#8217;une sous-ontologie propre au do-
maine trait&#233; (Dzikovska et al., 2003)).
</p>
<p>Les domaines de r&#233;f&#233;rences sont d&#233;finis comme des &#171; ensembles contextuels locaux structur&#233;s &#187;
(Salmon-Alt, 2001). Ils permettent d&#8217;organiser des entit&#233;s en fonction de leurs relations entre
elles selon un crit&#232;re de diff&#233;rentiation donn&#233; (par exemple bleus/non-bleus), ce qui de fait le
partitionne entre entit&#233;s accord&#233;es au pr&#233;dicat, et entit&#233;s accord&#233;es &#224; sa n&#233;gation. Ceci permet
entre autre de distinguer les entit&#233;s potentiellement candidates &#224; l&#8217;expression r&#233;f&#233;rentielle des
autres, mais aussi de pr&#233;dire les meilleurs candidats &#224; une reprise nominale.
</p>
<p>Implanter le mod&#232;le de r&#233;solution d&#233;fini dans (Pitel &amp; Sansonnet, 2003) comme un module
de r&#233;solution de la r&#233;f&#233;rence lui aurait enlev&#233; une grande partie de son int&#233;r&#234;t. Le mod&#232;le que
nous proposons est le Mod&#232;le d&#8217;Interpr&#233;tation Constructionelle, inspir&#233; de la grammaire de
construction3 ECG (Embodied Construction Grammar) (Bergen &amp; Chang, 2002). L&#8217;ECG est
un syst&#232;me d&#8217;interpr&#233;tation de la langue en contexte r&#233;aliste, o&#249; l&#8217;analyse prend en compte une
repr&#233;sentation du contexte et est suivie par une phase de simulation dans ce contexte.
</p>
<p>Les constructions peuvent &#234;tre vues comme des fonctions de l&#8217;espace des mots (appell&#233; aussi
p&#244;le forme) vers l&#8217;espace des sens (p&#244;le signification). Or les fonctions utilis&#233;es pour repr&#233;senter
les pr&#233;dicats dans notre mod&#232;le de r&#233;solution des r&#233;f&#233;rences extensionnelles sont des fonctions
d&#8217;un domaine de r&#233;f&#233;rence dans un autre. Il suffit donc de g&#233;n&#233;raliser la notion de construction
et de p&#244;le pour pouvoir int&#233;grer les deux mod&#232;les.
</p>
<p>La notion d&#8217;espace mental (Fauconnier, 1984) existant dans l&#8217;ECG n&#8217;est pas assez puissante
pour mod&#233;liser les p&#244;les g&#233;n&#233;ralis&#233;s, et donc les domaines de r&#233;f&#233;rence. Par cons&#233;quent nous
devons &#233;tendre cette grammaire avec la possibilit&#233; de repr&#233;senter des ensembles topologique-
ment structur&#233;s (avec des dimensions, un ordre et une m&#233;trique) afin de pouvoir contenir le p&#244;le
forme ou les repr&#233;sentations visuelles n&#233;cessaires pour certaines r&#233;f&#233;rence. Nous appellerons
cette notion contexte d&#8217;interpr&#233;tation.
</p>
<p>2 Mod&#232;le d&#8217;interpr&#233;tation constructionnelle
</p>
<p>Le probl&#232;me &#224; mod&#233;liser, celui de l&#8217;extraction des r&#233;f&#233;rents &#224; partir d&#8217;une expression r&#233;f&#233;ren-
tielle, n&#233;cessite deux notions :
</p>
<p>1. un conteneur (le domaine de r&#233;f&#233;rence) permettant de structurer les entit&#233;s,
</p>
<p>t&#226;ches utilis&#233;es dans le corpus Ozkan (Ozkan, 1993), les interlocuteurs discutent des objets g&#233;om&#233;triques &#224; leur
disposition et de l&#8217;espace plan sur lequel ils sont dispos&#233;s.
</p>
<p>3Les grammaires de construction (Lakoff &amp; Johnson, 1980; Fillmore &amp; Kay, 1995) s&#8217;opposent aux grammaires
lexicales et sont particuli&#232;rement adapt&#233;es pour repr&#233;senter les th&#233;ories mentales de la langue (Lakoff &amp; Johnson,
1980; Langacker, 1987). Dans les grammaires lexicales, on consid&#232;re que le mot est un signe, et qu&#8217;il est associ&#233; &#224;
un signifiant ; le principe de compositionnalit&#233; autorisant la construction de la signification de la phrase &#224; partir des
sens de chaque signe. Dans les grammaires de construction, c&#8217;est une forme qui est appari&#233;e &#224; une signification ;
la forme est un motif, par exemple : &#171; hors de [lieu] &#187; est un motif qui va capturer &#171; hors de France &#187;, &#171; hors de la
maison &#187;, etc. Cette forme va &#234;tre appari&#233;e &#224; une certaine signification en fonction de ce qui aura &#233;t&#233; d&#233;fini dans la
construction qui lui est reli&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#232;le d&#8217;Interpr&#233;tation Constructionnelle
</p>
<p>2. une op&#233;ration permettant de passer d&#8217;un domaine de r&#233;f&#233;rence &#224; un autre (par exemple
tous les objets &#8594; les carr&#233;s &#8594; les carr&#233;s bleus &#8594; les petits carr&#233;s bleus)
</p>
<p>Or, dans la grammaire ECG, il existe deux notions proches, les espaces mentaux qui permettent
de structurer les entit&#233;s en ensembles distincts tout en autorisant des liens entre ces ensembles
et les constructions qui permettent de produire une repr&#233;sentation dans le p&#244;le signification &#224;
partir des informations contenues dans le p&#244;le forme. Cette observation nous a amen&#233; &#224; proposer
deux &#233;volutions :
</p>
<p>1. la notion de contexte d&#8217;interpr&#233;tation, qui doit &#234;tre suffisamment abstraite pour repr&#233;-
senter &#224; la fois un ensemble structur&#233; ordonn&#233; comme les domaines de r&#233;f&#233;rence, et un
ensemble structur&#233; par des relations, comme les espaces mentaux.
</p>
<p>2. la notion de constructions situ&#233;es, qui permet de repr&#233;senter les rapports entre entit&#233;s
localis&#233;es dans deux Contextes d&#8217;Interpr&#233;tation, l&#224; ou les constructions ne permettent que
de repr&#233;senter les rapports entre forme et signification.
</p>
<p>2.1 Contexte d&#8217;Interpr&#233;tation
</p>
<p>La notion de Contexte d&#8217;Interpr&#233;tation recouvre les caract&#233;ristiques des espaces mentaux et des
domaines de r&#233;f&#233;rence en introduisant une m&#233;thode g&#233;n&#233;rale de d&#233;finition des relations topo-
logiques4 entre objets. Par rapport &#224; la d&#233;finition formelle des espaces mentaux propos&#233;e dans
(Chang et al., 2002), nous introduisons cette notion de structure topologique via la d&#233;finition
de concepts permettant de d&#233;crire des contraintes utilisables ensuite dans les constructions. La
description des contextes repr&#233;sent&#233; figure 1 permet de d&#233;finir &#224; la fois le contenu du contexte
(avec les r&#244;les et les contraintes sur les r&#244;les) et sa structure. La structure est d&#233;finie par des
lieux (des descriptions abstraites li&#233;es aux entit&#233;s et d&#233;finissant leur position dans la structure),
des relations (sur lesquelles on pourra poser des contraintes, applicables entre les entit&#233;s) et des
op&#233;rations permettant de combiner des positions pour construire des contraintes complexes.
</p>
<p>Les lieux permettent de d&#233;finir les informations sur la &#171; localisation &#187; des entit&#233;s pr&#233;sentes dans
les contextes. Une information de lieu peut &#234;tre rattach&#233;e directement &#224; une entit&#233;, ou bien
construite &#224; partir d&#8217;autres lieux pour ensuite pouvoir lui imposer des contraintes. Par exemple,
si l&#8217;on veut repr&#233;senter le contexte verbal &#233;crit, ses lieux seront PLACE-SYMBOLE (pour les
lettres et les signes), et SEGMENT-SYMBOLE (pour les mots). Pour une repr&#233;sentation d&#8217;un
domaine de r&#233;f&#233;rence, qui est une cha&#238;ne d&#8217;entit&#233;s s&#233;par&#233;es par une distance, il faut d&#233;finir les
lieux NOEUD, et CHAINE. Un m&#234;me noeud pouvant tout &#224; fait &#234;tre le lieu de plusieurs entit&#233;s.
</p>
<p>Le formalisme ne d&#233;crit pas le contenu informationnel des lieux5, qui est laiss&#233; &#224; la respon-
sabilit&#233; de l&#8217;impl&#233;mentation afin de pouvoir op&#233;rer les optimisations n&#233;cessaires, ce qui est
important notamment si l&#8217;on envisage des contextes d&#233;crivant des espaces &#224; deux dimensions
ou plus.
</p>
<p>Les relations d&#233;finissent les rapports structurels entre les lieux, et permettent donc de d&#233;crire
dans les constructions les contraintes que l&#8217;on veut voir respecter sur la localisation les entit&#233;s
</p>
<p>4Des relations topologiques existent aussi bien pour des mots qui se suivent (ils sont situ&#233;s dans un espace &#224;
une dimension) que pour des objets dispos&#233;s sur un &#233;cran (espace &#224; deux dimensions).
</p>
<p>5Par exemple qu&#8217;un vecteur entre deux lettres est repr&#233;sent&#233;e par un r&#233;el et qu&#8217;un vecteur entre deux objets sur
un plan est repr&#233;sent&#233;e par un complexe.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Pitel, J.-P. Sansonnet
</p>
<p>dans les contextes. Une relation doit sp&#233;cifier les types de lieux sur lesquelles elle est applicable,
ainsi que le domaine de sa valeur.
</p>
<p>contexte &#12296;nom&#12297;
sous-cas de &#12296;contexte&#12297;
</p>
<p>r&#244;les :
&#12296;r&#244;le&#12297; : &#12296;sch&#233;ma&#12297;
</p>
<p>contraintes
r&#244;le &#8592; valeur|r&#244;le &#8596; r&#244;le|...
</p>
<p>lieux :
&#12296;type-lieu&#12297; // par exemple : segment
</p>
<p>relations :
&#12296;nom-relation(type-lieu,type-lieu,...) &#8594; domaine&#12297;
&#12296;contraintes&#12297;
</p>
<p>op&#233;rations :
&#12296;nom-op&#233;ration(type-lieu,...) &#8594; type-sch&#233;ma&#12297;
&#12296;contraintes&#12297;
</p>
<p>FIG. 1 &#8211; D&#233;finition des CONTEXTES dans une notation &#224; la ECG (Bergen &amp; Chang, 2002).
</p>
<p>Par exemple, pour le contexte verbal &#233;crit, on aura la relation VECTEUR(PLACE-SYMBOLE,
PLACE-SYMBOLE)&#8594;Z qui donne la diff&#233;rence de position entre deux symboles (VECTEUR(X,Y)=0
si X=Y ; -1 si Y suit imm&#233;diatement X ; 1 si X suit imm&#233;diatement Y). Pour les domaines de
r&#233;f&#233;rence, on aura DIFF&#201;RENCE(NOEUD, NOEUD) &#8594; R+, avec DIFF&#201;RENCE(X,Y)=1 si X et
Y sont au m&#234;me niveau sur l&#8217;&#233;chelle du pr&#233;dicat (par exemple X et Y aussi grands) ; 0 (resp.
&#8734;) si Y (resp. X) est hors de l&#8217;&#233;chelle mais pas X (resp. Y) ; &gt;1 (resp. &lt;1) si X (resp. Y) est
au-dessus de Y (resp. X) sur l&#8217;&#233;chelle du pr&#233;dicat6.
</p>
<p>Les op&#233;rations permettent de construire des lieux &#224; partir d&#8217;autres lieux. Elles permettent no-
tamment de travailler sur des lieux construits de mani&#232;re abstraite, par exemple pour des grou-
pements perceptifs (plusieurs objets proches ayant une ou plusieurs caract&#233;ristiques communes,
et qui peuvent &#234;tre per&#231;us comme un seul objet). Par exemple, pour construire une cha&#238;ne dans
les domaines de r&#233;f&#233;rences &#224; partir de deux noeuds, on aura : CHA&#206;NE(NOEUD, NOEUD) &#8594;
CHAINE ; pour extraire le premier noeud d&#8217;une cha&#238;ne : PREMIER(CHAINE) &#8594; NOEUD.
</p>
<p>2.2 Constructions situ&#233;es
</p>
<p>Dans notre hypoth&#232;se, on peut consid&#233;rer que le mod&#232;le standard de l&#8217;ECG utilise implicitement
deux contextes d&#8217;interpr&#233;tation :
</p>
<p>1. celui de l&#8217;&#233;nonc&#233; (p&#244;le forme en ECG), dont les entit&#233;s voient leur position r&#233;gie par des
contraintes de type PR&#201;C&#200;DE, RENCONTRE, etc.
</p>
<p>2. celui de la s&#233;mantique (p&#244;le signification en ECG), dont les entit&#233;s n&#8217;ont pas de position,
et donc ne se voient pas structurellement contraintes.
</p>
<p>6Dans (Pitel &amp; Sansonnet, 2003) nous avions utilis&#233; le terme de SIMILARIT&#201; au lieu de DIFF&#201;RENCE, mais
un relecteur nous a fait remarqu&#233; que notre d&#233;finition de la similarit&#233; n&#8217;&#233;tait pas sym&#233;trique, contrairement &#224;
l&#8217;acception standard du terme.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#232;le d&#8217;Interpr&#233;tation Constructionnelle
</p>
<p>Les constructions situ&#233;es (S-CONSTRUCTION dans notre formalisme) repr&#233;sent&#233;es figure 2,
sont des constructions ayant deux p&#244;les : OBSERVATION et PRODUCTION, rempla&#231;ant les p&#244;les
FORME et SIGNIFICATION, rendues inad&#233;quates par le fait qu&#8217;ils ne r&#233;f&#232;rent plus &#224; deux p&#244;les
particuliers. Une S-CONSTRUCTION sp&#233;cifie dans sa partie &#171; CONSTRUCTIONNEL &#187; le ou les
contextes d&#8217;interpr&#233;tation utilis&#233;s en sp&#233;cifiant un nom local et le type du contexte. Ceci permet
de d&#233;crire une S-CONSTRUCTION entre deux contextes d&#8217;interpr&#233;tation diff&#233;rents mais de m&#234;me
type. Les s-constructions sp&#233;cifient pour chaque &#233;l&#233;ment de chaque p&#244;le, le contexte d&#8217;interpr&#233;-
tation dans lequel celui-ci est situ&#233;, et d&#233;finissent des contraintes sur ces &#233;l&#233;ments &#224; la fois sur
les relations entre leurs constituants (comme dans la grammaire ECG) et sur les relations entre
les &#233;l&#233;ments situ&#233;s &#224; l&#8217;int&#233;rieur d&#8217;un m&#234;me contexte d&#8217;interpr&#233;tation.
</p>
<p>s-construction &#12296;nom&#12297;
sous-cas de &#12296;construction&#12297;
constructionel
</p>
<p>&#233;voque :
&#12296;construction&#12297; en tant que &#12296;nom-local&#12297;
</p>
<p>contextes :
&#12296;nom-local&#12297; : &#12296;contexte&#12297;
</p>
<p>constituants :
&#12296;nom-local&#12297; : &#12296;construction&#12297;
</p>
<p>contraintes :
r&#244;le &#8592; valeur|r&#244;le &#8596; r&#244;le|...
</p>
<p>observation :
&#12296;nom&#12297; : &#12296;sch&#233;ma&#12297;dans &#12296;nom-contexte&#12297;
&#12296;contraintes&#12297;
</p>
<p>production :
&#12296;nom&#12297; : &#12296;sch&#233;ma&#12297;dans &#12296;nom-contexte&#12297;
&#12296;contraintes&#12297;
</p>
<p>FIG. 2 &#8211; D&#233;finition g&#233;n&#233;rale d&#8217;une S-CONSTRUCTION
</p>
<p>La description du partitionnement n&#233;cessite deux autres contextes (domaine-r&#233;f&#233;rence-part1 et
domaine-r&#233;f&#233;rence-part2). Pour le premier, qui partitionne le domaine entre possibles et im-
possibles, il s&#8217;agit simplement de s&#233;lectionner les &#233;l&#233;ments ayant la similarit&#233; minimale avec
le premier &#233;l&#233;ment du domaine de r&#233;f&#233;rence (autrement dit, les derniers &#233;l&#233;ments de la cha&#238;ne
qui sont au m&#234;me niveau de similarit&#233;). Pour le seconde, le contexte domaine-r&#233;f&#233;rence-part2
(drp2) poss&#232;de un r&#244;le (attribut) simil-limites et deux sous-contextes (pr&#233;f&#233;r&#233;s/possibles). Le
r&#244;le simil-limites contient une liste de noeuds qui marquent les ruptures dans la r&#233;partition
des &#233;l&#233;ments. La contrainte majeure pour le contexte drp2 est que le dernier &#233;l&#233;ment du sous-
domaine pr&#233;f&#233;r&#233;s doit appartenir &#224; simil-limites pour satisfaire au principe selon lequel les
groupements perceptuels r&#233;sistent &#224; la s&#233;paration. Les autres contraintes d&#233;pendent du nombre
d&#8217;&#233;l&#233;ments que doit fournir l&#8217;extraction r&#233;f&#233;rentielle (selon que l&#8217;expression r&#233;f&#233;rentielle est au
pluriel ou non, qu&#8217;elle contient ou non un cardinal ou un ordinal).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Pitel, J.-P. Sansonnet
</p>
<p>3 Conclusion et Perspectives
</p>
<p>Nous avons expos&#233; le mod&#232;le d&#8217;interpr&#233;tation constructionnelle, un mod&#232;le formel permettant
de d&#233;crire un traitement de niveau pragmatique (la r&#233;solution de la r&#233;f&#233;rence extensionnelle)
dans une forme proche de l&#8217;analyse grammaticale. Un tel cadre de description homog&#232;ne pr&#233;-
sente plusieurs avantages, notamment celui de rendre possible une mod&#233;lisation simple de ph&#233;-
nom&#232;nes transversaux comme le traitement des &#233;checs d&#8217;analyse, analyse guid&#233;e par pr&#233;visions
ou encore l&#8217;analyse partielle par contraintes souples. La question de savoir si tous les ph&#233;no-
m&#232;nes rencontr&#233;s en pragmatique peuvent s&#8217;exprimer dans le mod&#232;le d&#8217;interpr&#233;tation construc-
tionnelle reste bien entendu ouverte, mais plusieurs solutions aux probl&#232;mes de niveau pragma-
tique, comme la reconnaissance de plan (Goldman et al., 1999) ou la r&#233;solution de r&#233;f&#233;rence
spatiale (Schang, 1997), mais aussi au niveau s&#233;mantique, comme les ensembles d&#8217;alternatives
(Rooth, 1992) n&#233;cessitent des structures qui peuvent &#234;tre repr&#233;sent&#233;es comme des contextes
d&#8217;interpr&#233;tation.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BERGEN B. K. &amp; CHANG N. C. (2002). Embodied Construction Grammar in simulation-
based languge understanding. Rapport interne TR-02-004, International Computer Science
Institute.
</p>
<p>CHANG N. C., FELDMAN J., PORZEL R. &amp; SANDERS K. (2002). Scaling cognitive lin-
guistics : Formalisms for language understanding. In Proceedings of the 1st International
Workshop on Scalable Natural Language Undestanding, Heidelberg, Germany.
</p>
<p>DZIKOVSKA M., SWIFT M. &amp; ALLEN J. (2003). Constructing custom semantic representa-
tions from a generic lexicon. In Proceedings of the 5th International Workshop on Computa-
tional Linguistics.
</p>
<p>FAUCONNIER G. (1984). Espaces Mentaux. Editions de Minuit.
</p>
<p>FILLMORE C. J. &amp; KAY P. (1995). Construction grammar. Language, 64, 501&#8211;538.
</p>
<p>GOLDMAN R. P., GEIB C. W. &amp; MILLER W. A. (1999). A new model of plan recognition.
In Proc. 1999 Conference on Uncertainty in Artificial Intelligence, Stockholm.
</p>
<p>LAKOFF G. &amp; JOHNSON M. (1980). Metaphors we live by. University of Chicago Press.
</p>
<p>LANGACKER R. W. (1987). Foundations of Cognitive Grammar, volume 1. Stanford Univer-
sity Press.
</p>
<p>OZKAN N. (1993). Vers un mod&#232;le dynamique du dialogue : analyse de dialogues finalis&#233;s
dans une perspective communicationnelle. Th&#232;se, INP, Grenoble.
</p>
<p>PITEL G. &amp; SANSONNET J.-P. (2003). A functional approach for resolution of extensional
reference in practical dialogue. In Proceedings of the International Symposium of Reference
Resolution and its Application to question Answering and Summarization, Venice, Italia.
</p>
<p>ROOTH M. (1992). A theory of focus interpretation. Natural Language Semantics, 1, 75&#8211;116.
</p>
<p>SALMON-ALT S. (2001). R&#233;f&#233;rence et Dialogue Finalis&#233; : de la linguistique &#224; un mod&#232;le
op&#233;rationnel. PhD thesis, Universit&#233; H. Poincar&#233; &#8211; Nancy 1, Nancy, France.
</p>
<p>SCHANG D. (1997). Repr&#233;sentation et interpr&#233;tation de connaissances spatiales dans un
syst&#232;me de dialogue homme-machine. PhD thesis, Universit&#233; Henri Poincar&#233; - Nancy I.</p>

</div></div>
</body></html>