<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mod&#233;lisation de la modulation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, Session Poster, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Mod&#233;lisation de la modulation
</p>
<p>Bellengier Emmanuel (1), Priego-Valverde B&#233;atrice (2)
Laboratoire Parole et Langage - Universit&#233; de Provence
</p>
<p>29, Avenue Schuman Aix en Provence 13 621
[bellengier, bea.priego-valverde@lpl.univ-aix.fr]
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Le dialogue est un processus interactif pendant lequel les diff&#233;rents agents impliqu&#233;s vont s&#8217;en-
gager sur un certain nombre d&#8217;&#233;l&#233;ments propositionnels. La modulation implique des ajouts
propositionnels - r&#233;vis&#233;s et att&#233;nu&#233;s - qui ne constituent pas n&#233;cessairement une base pour un
accord. L&#8217;objectif de cet article est donc de proposer une description formelle du ph&#233;nom&#232;ne de
modulation dans le cadre du mod&#232;le de J. Ginzburg
</p>
<p>Dialogue is an interactive process in which agents involved must commit about some propo-
sitional elements. These elements are then available into the common ground shared by the
agents. Mitigation is a particularly productive phenomenon which is problematic for the update
of the common ground. We propose a formalisation of the phenomenon into the model of J.
Ginzburg
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Modulation, discours, mod&#232;les de dialogue, interaction verbale, annotation
Mitigation, discourse, verbal interaction, models of dialogue, annotation
</p>
<p>1 Introduction
</p>
<p>Le dialogue est un processus interactif pendant lequel les diff&#233;rents agents impliqu&#233;s vont s&#8217;en-
gager sur un certain nombre d&#8217;&#233;l&#233;ments propositionnels qui seront par la suite disponibles pour
l&#8217;accord. Or, nous montrerons dans cet article que, m&#234;me lorsqu&#8217;une proposition ne fait pas l&#8217;ob-
jet d&#8217;une r&#233;futation directe de la part d&#8217;un des agents impliqu&#233;s dans le discours celle-ci ne peut
pas &#234;tre si facilement ajout&#233;e au stock informationnel qui se construit dans le discours. En effet,
on remarque que dans un m&#234;me tour de parole, on peut voir appara&#238;tre des &#233;tats d&#8217;information
qui, sans &#234;tre compl&#232;tement contradictoires, obligent l&#8217;un des agents &#224; ne retenir qu&#8217;une seule
partie de l&#8217;&#233;nonc&#233;. Cette hypoth&#232;se sur la mani&#232;re dont les discours se construisent sera illustr&#233;e
&#224; l&#8217;aide d&#8217;un ph&#233;nom&#232;ne tr&#232;s productif dans le dialogue : la modulation. Apr&#232;s avoir pr&#233;sent&#233; les
choix terminologiques qui fondent notre analyse de la modulation, et d&#233;crit un exemple issu de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bellengier, Priego-Valverde
</p>
<p>notre corpus, nous proposerons un ensemble de contraintes permettant d&#8217;inclure le ph&#233;nom&#232;ne
&#224; l&#8217;int&#233;rieur du mod&#232;le propos&#233; par J. Ginzburg (cf.(Ginzburg, 2003)).
</p>
<p>2 La notion de modulation
</p>
<p>2.1 Rappel terminologique
</p>
<p>Dans la litt&#233;rature, nous retrouvons deux types d&#8217;approches de la modulation. La premi&#232;re se
situe sur le plan de l&#8217;&#233;nonciation, et d&#233;crit la modulation comme un processus visant &#224; euph&#233;-
miser le discours (&quot;modulation&quot; (Halliday, 1976), &quot;mitigation&quot; (Fraser, 1980), (Caffi, 1999),
&quot;footing&quot;, (Goffman, 1979), &quot;hedging&quot; (Petit, 1998)). La deuxi&#232;me se centre davantage sur les
proc&#233;d&#233;s linguistiques permettant cette modulation et l&#8217;appr&#233;hende comme le r&#233;sultat de la pr&#233;-
sence de telles marques (&quot;softeners&quot; (Brown &amp; Levinson, 1978), &quot;mitigators&quot; (Labov &amp; Fanshel,
1977), (Fraser, 1980), &quot;downgraders&quot; (House &amp; Kasper, 1981), &quot;hedges&quot; (Lakoff, 1973)). Ici,
nous adoptons le terme &quot;modulation&quot; (Halliday, 1976), pour d&#233;igner un ph&#233;nom&#232;ne d&#8217;oscilla-
tion entre &quot;tension&quot; (Vion, 1992) et d&#233;tente. Une modulation sera donc g&#233;n&#233;ralement compos&#233;e
de la mani&#232;re suivante :
&#8211; une tension (T) : fragment de discours jug&#233; par le locuteur (et / ou l&#8217;interlocuteur) trop forte-
</p>
<p>ment marqu&#233; dans sa lexicalisation ou sa formulation.
&#8211; une mise en surplomb1 de cette tension (MS) : fragment de discours correspondant &#224; une
</p>
<p>activit&#233; m&#233;ta-discursive du locuteur qui consiste &#224; &quot; sortir &quot; du fil discursif le point de tension
pour l&#8217;att&#233;nuer par la suite.
</p>
<p>&#8211; une d&#233;tente (D) : fragment de discours correspondant &#224; une att&#233;nuation de T : reformula-
tion, correction, incises pr&#233;cautionneuses ... C&#8217;est donc cette d&#233;tente qui renvoie &#224; tous les
proc&#233;d&#233;s modulatoires &#233;voqu&#233;s pr&#233;c&#233;demment.
</p>
<p>2.2 Corpus
</p>
<p>Notre corpus d&#8217;analyse est un recueil de donn&#233;es authentiques, constitu&#233; d&#8217;un enregistrement
audio et vid&#233;o de 23 interactions effectu&#233; par des linguistes, &#224; l&#8217;Universit&#233; de Provence, en
1994. Toutes sont des discussions entre deux personnes qui, bien que ne se connaissant pas,
devaient choisir un th&#232;me de discussion parmi trois et en d&#233;battre pendant dix minutes. Sur
les 23 interactions enregistr&#233;es, 5 sont int&#233;gralement transcrites de mani&#232;re orthographique 2 et
constituent un total de 7724 mots. Dans les 5 interactions transcrites, nous avons pu d&#233;gager 39
modulations.
</p>
<p>2.3 Description de l&#8217;exemple
</p>
<p>Nous pr&#233;sentons ici un exemple de modulation issu d&#8217;une interaction enregistr&#233;e en mars 1994 :
&#8211; T + MS + D. Une tension est produite, mise en surplomb, puis att&#233;nu&#233;e.
</p>
<p>1Aussi appel&#233;e &quot;pivot&quot; (cf. (Bertrand, 1999)). Soulignons toutefois que nous avons d&#233;cid&#233; de ne tenir compte
que de T et D et d&#8217;amalgamer MS &#224; D
</p>
<p>2Cf. les conventions de transcription</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation de la modulation
</p>
<p>(1) D : [...] sans du tout croire &#224; l&#8217;&#233;glise + parce que : : &#231;a : : &#231;a implique un : : / comment (&#231;a) s&#8217;appelle + tout
un : : ++ un nombre d&#8217;obligations qui sont : : ++ superflues + et puis en plus
C : hm hm heu : : + c&#8217;est pas que c&#8217;est r&#233;trograde (T) mais enfin : : (MS)+ c&#8217;est un peu d&#233;pass&#233; (D)
quoi c&#8217;est un peu d&#233;pa / ils ont pas suivi le mouvement + ils ont pas suivi le mouvement
</p>
<p>Dans cet exemple, l&#8217;adjectif qualificatif &quot;r&#233;trograde&quot; constitue le point de tension, d&#233;j&#224; att&#233;nu&#233;
par sa verbalisation &#224; la forme n&#233;gative. T se pr&#233;sente comme une n&#233;gation de T. Cette att&#233;nua-
tion est ent&#233;rin&#233;e par la d&#233;tente &quot;c&#8217;est un peu d&#233;pass&#233; quoi&quot;. D est compos&#233;e d&#8217;une reformu-
lation att&#233;nu&#233;e de la proposition pr&#233;c&#233;dente (&quot;r&#233;trograde&quot; vs &quot;d&#233;pass&#233;&quot;), du modalisateur &quot;un
peu&quot; et du connecteur &quot;quoi&quot;, sorte d&#8217;appel &#224; assentiment attendu de la part de l&#8217;interlocuteur.
</p>
<p>3 Formalisation de la notion
</p>
<p>Les modulations emp&#234;chent qu&#8217;une partie du discours soit directement accessible dans le do-
maine accept&#233; des interlocuteurs. Pendant le d&#233;roulement du discours, les interlocuteurs avancent
des &#233;l&#233;ments qui engagent les locuteurs sur certains points dans le discours. Ces &#233;l&#233;ments sont
donc disponibles. Dans le cas de la modulation, l&#8217;interlocuteur est face &#224; un probl&#232;me plus com-
plexe. Un &#233;l&#233;ment est bien pr&#233;sent dans le discours mais il ne peut le retenir parce qu&#8217;il a &#233;t&#233;
modul&#233; donc montr&#233; par le locuteur comme non recevable. C&#8217;est un &#233;l&#233;ment qui est introduit et
tout de suite d&#233;fait. Nous avons pos&#233; en 2.1. une nouvelle terminologie qui permet de prendre ici
en compte les deux moments fondamentaux qui constituent une modulation. Nous proposons
d&#8217;analyser les ph&#233;nom&#232;nes de modulation en &#233;tudiant le rapport que les &#233;l&#233;ments de T entre-
tiennent avec les &#233;l&#233;ments de D. Tout comme la correction (cf. (Asher &amp; Lascarides, 2003), pp
243-273) la modulation produit une r&#233;vision du discours. La particularit&#233; de la modulation est
qu&#8217;elle ne d&#233;fait pas compl&#232;tement le discours. Il est donc n&#233;cessaire de conserver une trace de
cette modulation.
</p>
<p>3.1 Pr&#233;sentation du mod&#232;le de J. Ginzburg
</p>
<p>Dans le mod&#232;le de Ginzburg (cf. (Ginzburg, 2003)), l&#8217;information nouvelle repr&#233;sente le contenu
de la mise &#224; jour du contexte et l&#8217;information ancienne permet d&#8217;ancrer l&#8217;&#233;nonc&#233; dans le contexte.
Ginzburg consid&#232;re le discours comme un processus dynamique dans lequel la signification des
formes linguistiques s&#8217;explique par les contraintes qu&#8217;elle induit sur les ressources communes
&#233;tablies dans le dialogue. Il propose de mod&#233;liser le contenu de l&#8217;&#233;tat mental de chacun des
participants au dialogue sous la forme d&#8217;un &quot;discourse gameboard&quot;. Un gameboard (d&#233;sormais
GB) comporte deux dimensions : la premi&#232;re refl&#232;te la repr&#233;sentation que se fait le locuteur du
dialogue en cours (la partie publique d&#233;sormais PUB) et la seconde refl&#232;te l&#8217;&#233;tat non exprim&#233;
dans le dialogue de l&#8217;&#233;tat mental de chacun des interlocuteurs (la partie priv&#233;e, d&#233;sormais PRI).
Le dialogue se repr&#233;sente &#224; l&#8217;aide de trois niveaux suppl&#233;mentaires : les croyances communes
(BELIEFS, un ensemble de propositions), la question en cours (QUD, une pile de questions
en cours) et le tour pr&#233;c&#233;dent (Latest-Move). Dans la partie priv&#233;e du GB, Ginzburg distingue
plusieurs sous-dimensions : la description des buts du locuteur qui se r&#233;alisent dans le plan
qu&#8217;il se donne (PLAN, une liste d&#8217;actions) et dans la fa&#231;on dont il le r&#233;alise (AGENDA, une
pile d&#8217;actions), la description des &#233;l&#233;ments pr&#233;alablement introduits dans le discours (QUD, une
pile de questions en cours). Nous pouvons d&#232;s &#224; pr&#233;sent remarquer que le syst&#232;me propos&#233; par
Ginzburg permet de repr&#233;senter &#224; la fois des &#233;l&#233;ments &#233;nonc&#233;s dans le discours ainsi que des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bellengier, Priego-Valverde
</p>
<p>&#9121;
&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9123;
</p>
<p>PRIVEE :
</p>
<p>&#9121;
&#9122;&#9122;&#9122;&#9122;&#9123;
</p>
<p>PLAN : List
(
</p>
<p>ACTION
)
</p>
<p>AGENDA : Stack
(
</p>
<p>ACTION
)
</p>
<p>BELIEFS : Set
(
</p>
<p>PROP
)
</p>
<p>QUD : Stack
(
</p>
<p>QUESTION
)
</p>
<p>&#9124;
&#9125;&#9125;&#9125;&#9125;&#9126;
</p>
<p>PUBLIC :
</p>
<p>&#9121;
&#9122;&#9123;
</p>
<p>BELIEFS : Set
(
</p>
<p>PROP
)
</p>
<p>QUD : Stack
(
</p>
<p>QUESTION
)
</p>
<p>LATEST-MOVE : MOVE
</p>
<p>&#9124;
&#9125;&#9126;
</p>
<p>&#9124;
&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9126;
</p>
<p>FIG. 1 &#8211; Un exemple d&#8217;&#233;tat d&#8217;information d&#8217;un participant au dialogue
</p>
<p>PROPRI&#201;T&#201; R&#201;ALISATION DE LA PROPRI&#201;T&#201;
</p>
<p>EXIGENCE
</p>
<p>MOD&#8658; Cat(Mod)
</p>
<p>arit&#233; = 2
ordonn&#233; oui
disponibilit&#233; &#8707;MOD
satisfaisabilit&#233; &#8707;Cat(Mod)
</p>
<p>D&#201;PENDANCE
</p>
<p>a.SEM &#8776; b.SEM
</p>
<p>arit&#233; = 2
ordonn&#233; non
disponibilit&#233; &#8707;a &#8743; &#8707;b
satisfaisabilit&#233; a.trait.SEM &#8801; b.trait.SEM
</p>
<p>LIN&#201;ARIT&#201;
</p>
<p>a&#8826; b
</p>
<p>arit&#233; = 2
ordonn&#233; oui
disponibilit&#233; &#8707;a &#8743; &#8707;b
satisfaisabilit&#233; a.fin &#8804; b.d&#233;but
</p>
<p>CONTIGU&#207;T&#201;
</p>
<p>a&#8596; b
</p>
<p>arit&#233; = 2
ordonn&#233; non
disponibilit&#233; &#8707;assertion &#8743; &#8707;MOD
satisfaisabilit&#233; (a.fin = b.d&#233;but) &#8744; (b.fin = a.d&#233;but)
</p>
<p>TAB. 1 &#8211; Contraintes de formation des modulations
</p>
<p>&#233;l&#233;ments qui n&#8217;apparaissent pas de mani&#232;re explicite. La figure 1 est une repr&#233;sentation d&#8217;un
discours, selon le mod&#232;le pr&#233;c&#233;demment d&#233;crit.
</p>
<p>3.2 Contraintes et discours
</p>
<p>Nous utilisons le formalisme des Grammaires de Propri&#233;t&#233;s (cf.(Blache, 2001)) pour mod&#233;liser
les contraintes de forme qui permettent de mettre &#224; jour les modulations qui marquent les rela-
tions qu&#8217;entretiennent la grammaire et la repr&#233;sentation du discours. Nous faisons l&#8217;hypoth&#232;se,
&#224; la suite de (Ginzburg et al., 2003), qu&#8217;il est n&#233;cessaire d&#8217;int&#233;grer des informations de types
illocutoires dans la description grammaticale. L&#8217;utilisation de ce niveau d&#8217;analyse est n&#233;cessaire
&#224; la mise &#224; jour des informations dans le gameboard du locuteur.
</p>
<p>Nous d&#233;crivons un ensemble de contraintes qui, quand elles sont satisfaites, permettent d&#8217;ajouter
un trait modulation (d&#233;sormais MOD) dans le gameboard du locuteur. Ce trait modulation per-
met la conservation d&#8217;une trace modulatoire. Elle appara&#238;t au sein du GB dans le Latest-Move
et dans le Belief. Elle permet en outre de conserver les deux &#233;tats de l&#8217;assertion.
</p>
<p>Nous donnons un ensemble de contraintes dans le tableau 1. Les contraintes suivantes per-
mettent de d&#233;crire notre exemple :
&#8211; reprise parall&#232;le de la construction
&#8211; utilisation d&#8217;une unit&#233; lexicale que nous notons CAT(Mod), souvent un adjectif ou adverbe,
</p>
<p>qui affaiblit la t&#234;te du syntagme</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation de la modulation
</p>
<p>&#9121;
&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9122;&#9123;
</p>
<p>PRIVEE :
</p>
<p>&#9121;
&#9122;&#9122;&#9122;&#9122;&#9123;
</p>
<p>PLAN : List
(
</p>
<p>ACTION
)
</p>
<p>AGENDA : Stack
(
</p>
<p>ASSERTION
)
</p>
<p>BELIEFS : Set
(
</p>
<p>ACCEPT
)
</p>
<p>QUD : Stack
(
</p>
<p>ASSERTE
(
</p>
<p>R&#201;TROGRADE :X
))
</p>
<p>&#9124;
&#9125;&#9125;&#9125;&#9125;&#9126;
</p>
<p>PUBLIC :
</p>
<p>&#9121;
&#9122;&#9122;&#9123;
</p>
<p>BELIEFS : Set
(
</p>
<p>PROP
)
</p>
<p>QUD : Stack
(
</p>
<p>ASSERTE
(
</p>
<p>R&#201;TROGRADE :X
))
</p>
<p>LATEST-MOVE : &#8212;
</p>
<p>&#9124;
&#9125;&#9125;&#9126;
</p>
<p>PRIVEE
(
</p>
<p>MOD
)
</p>
<p>:
</p>
<p>&#9121;
&#9122;&#9122;&#9122;&#9122;&#9122;&#9123;
</p>
<p>PLAN : List
(
</p>
<p>ACTION
)
</p>
<p>AGENDA : Stack
(
</p>
<p>ACTION
)
</p>
<p>BELIEFS : Set
(
</p>
<p>ACCEPT
(
</p>
<p>MOD
))
</p>
<p>QUD : Stack
(
</p>
<p>ASSERTE
(
</p>
<p>R&#201;TROGRADE :X, D&#201;PASS&#201; :X
))
</p>
<p>&#9124;
&#9125;&#9125;&#9125;&#9125;&#9125;&#9126;
</p>
<p>PUBLIC
(
</p>
<p>MOD
)
</p>
<p>:
</p>
<p>&#9121;
&#9122;&#9122;&#9122;&#9123;
</p>
<p>BELIEFS : Set
(
</p>
<p>PROP
)
</p>
<p>QUD : Stack
(
</p>
<p>ASSERTE
(
</p>
<p>R&#201;TROGRADE :X,D&#201;PASS&#201; :X
))
</p>
<p>LATEST-MOVE : MOD
</p>
<p>&#9124;
&#9125;&#9125;&#9125;&#9126;
</p>
<p>&#9124;
&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9125;&#9126;
</p>
<p>FIG. 2 &#8211; Un exemple de modification due &#224; la modulation
</p>
<p>3.3 Un ph&#233;nom&#232;ne sur deux niveaux
</p>
<p>Le ph&#233;nom&#232;ne de la modulation permet de poser un certain nombre de questions sur la valeur
que doivent prendre la partie priv&#233;e et la partie publique du gameboard du locuteur. Le cas de
la modulation est int&#233;ressant parce qu&#8217;il agit sur les deux niveaux. En effet, la partie PRIVE
semble &#234;tre modifi&#233;e avant que la partie PUBLIQUE le soit. Dans le cas de la modulation, le
locuteur se rend compte qu&#8217;il y a une forme de contradiction entre ce qu&#8217;il pense dire (PRIVE)
et ce qu&#8217;il dit (PUBLIC). La modulation agit ainsi pour r&#233;tablir cette incongru&#239;t&#233; entre les deux
ph&#233;nom&#232;nes. Nous montrons dans la figure 2 comment les valeurs des assertions se transmettent
d&#8217;un gameboard &#224; un autre. La figure 2 repr&#233;sente un m&#234;me tour de parole, dans lequel nous
gardons la premi&#232;re assertion et l&#8217;assertion modul&#233;e.
</p>
<p>4 Conclusion
</p>
<p>Nous avons introduit un certain nombre de contraintes qui proposent une premi&#232;re &#233;tape dans
la caract&#233;risation de la modulation en fran&#231;ais. Ces contraintes ont &#233;t&#233; utilis&#233;es dans le cadre
de description du discours propos&#233; par J. Ginzburg. A la suite de cet article des questions sub-
sistent. En effet, on peut se demander s&#8217;il ne serait pas opportun de diviser la structure BELIEF
en deux structures : une premi&#232;re structure, centr&#233;e sur les croyances que le locuteur a sur ce
qu&#8217;il dit, et une deuxi&#232;me, centr&#233;e sur les croyances que le locuteur a des repr&#233;sentations que
ce fait l&#8217;interlocuteur. Cette division permettrait de rendre compte, en outre, des ph&#233;nom&#232;nes
interactionnels qui sous-tendent toute modulation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bellengier, Priego-Valverde
</p>
<p>5 Remerciements
</p>
<p>Les auteurs remercient les membres du GDR 2521 &quot;S&#233;mantique et mod&#233;lisation&quot; (CNRS) dont
les r&#233;flexions sur le mod&#232;le de J. Ginzburg ont particip&#233; &#224; la r&#233;daction de cet article.
</p>
<p>6 Conventions de transcription
</p>
<p>: allongement vocalique. Le nombre de : est proportionnel &#224; l&#8217;allongement
/ auto-interruption du d&#233;roulement discursif
+ pause. Le nombre de + est proportionnel &#224; la dur&#233;e de la pause
(en)fin ( ) = partie non prononc&#233;e
</p>
<p>R&#233;f&#233;rences
</p>
<p>ASHER N. &amp; LASCARIDES A. (2003). Logics of conversation. Cambridge University Press.
</p>
<p>BERTRAND R. (1999). De l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; de la parole. Analyse &#233;nonciative de ph&#233;nom&#232;nes prosodiques
et kin&#233;siques dans l&#8217;interaction interindividuelle. PhD thesis, Universit&#233; de Provence.
</p>
<p>BLACHE P. (2001). Les grammaires de propri&#233;t&#233;s &#8212; des contraintes pour le traitement automatique des
langues naturelles. Paris : Herm&#232;s Sciences Publications.
</p>
<p>BROWN P. &amp; LEVINSON S. (1978). Universals in language usage : politeness phenomena. In Questions
and Politeness. Strategies in Social Interaction. Cambridge University Press.
</p>
<p>CAFFI C. (1999). On mitigation. Journal Of Pragmatics, 31, 881&#8211;909.
</p>
<p>FRASER B. (1980). Conversational mitigation. Journal Of Pragmatics, 4, 341&#8211;350.
</p>
<p>GINZBURG J. (2003). A semantics for interactions in dialogue. ftp ://ftp.cogsci.ed.ac.uk :pub/ginzburg.
</p>
<p>GINZBURG J., SAG I. &amp; PURVER M. (2003). Integrating conversational move types in the grammar of
conversation. In P.KUHNLEIN, H. REISER &amp; H. ZEEVAT, Eds., Perspectives on Dialogue in the New
Millennium. John Benjamins, Amsterdam.
</p>
<p>GOFFMAN E. (1979). Footing. Semiotica, 25, 1&#8211;19.
</p>
<p>HALLIDAY M. (1976). System and function in language. In Modality and modulation in English, p.
189&#8211;213. Oxford University Press.
</p>
<p>HOUSE J. &amp; KASPER G. (1981). Conversational routine. In Politeness markers in English and German,
p. 157&#8211;185. Mouton de Gruyter.
</p>
<p>LABOV W. &amp; FANSHEL D. (1977). Therapeutic Discourse. Psychotherapy as conversation. New-York,
San Francisco, London, Academic Press.
</p>
<p>LAKOFF G. (1973). Hedges : a study in meaning criteria and the logic of fuzzy concepts. Journal of
Philosophical Logic, 2, 458&#8211;508.
</p>
<p>PETIT M. (1998). Vers une stylistique du &#8217;hedging&#8217; : le cas du discours scientifique. Bulletin de la
Soci&#233;t&#233; de Stylistique Anglaise, 19, 45&#8211;79.
</p>
<p>VION R. (1992). La communication verbale. Analyse des interactions. Paris : Hachette Sup&#233;rieur.</p>

</div></div>
</body></html>