<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Rep&#233;rage de relations terminologiques transversales en corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, Session Poster, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Rep&#233;rage de relations terminologiques transversales en
corpus
</p>
<p>Natalia Grabar1,2,3, V&#233;ronique Malais&#233;1,4, Aur&#233;lia Marcus5, Aleksandra Krul3
1 STIM/Assistance Publique &#8211; H&#244;pitaux de Paris, ERM 202 INSERM
</p>
<p>2 D&#233;partement de Biomath&#233;matiques, Universit&#233; Paris 6
3 CRIM/INaLCO
</p>
<p>4 Universit&#233; Paris 7 &amp; DRE de l&#8217;Institut National de l&#8217;Audiovisuel
5 Sinequa
</p>
<p>ngr@biomath.jussieu.fr, vmalaise@ina.fr, aurelia_m@noos.fr, ola.krul@voila.fr
</p>
<p>R&#233;sum&#233; - Abstract
Les relations transversales encodent des relations sp&#233;cifiques entre les termes, par exemple
localis&#233;-dans, consomme, etc. Elles sont tr&#232;s souvent d&#233;pendantes des domaines, voire
des corpus. Les m&#233;thodes automatiques consacr&#233;es au rep&#233;rage de relations terminologiques
plus classiques (hyperonymie, synonymie), peuvent g&#233;n&#233;rer occasionnellement les relations
transversales. Mais leur rep&#233;rage et typage restent sujets &#224; une conceptualisation : ces relations
ne sont pas attendues et souvent pas connues &#224; l&#8217;avance pour un nouveau domaine &#224; explorer.
Nous nous attachons ici &#224; leur rep&#233;rage mais surtout &#224; leur typage. En supposant que les rela-
tions sont souvent exprim&#233;es par des verbes, nous misons sur l&#8217;&#233;tude des verbes du corpus et de
leurs divers d&#233;riv&#233;s afin d&#8217;aborder plus directement la d&#233;couverte des relations du domaine. Les
exp&#233;riences montrent que ce point d&#8217;attaque peut &#234;tre int&#233;ressant, mais reste pourtant d&#233;pendant
de la polys&#233;mie verbale et de la synonymie.
Transversal relations describe specific information existing between terms, for instance con-
sumes, located-in, etc. They are often dependent on domains and even on corpora. Auto-
matic methods, conceived to detect classical terminological relations (hyperonymy, synonymy),
can occasionnally generate transversal relations. But their detection and typology depend on
their conceptualisation : these relations are not expected and often not known for a newly ex-
plored domain. We aim here at their detection, but mainly at their typology. Since we suppose
these relations are often expressed with verbs, we concentrate our investigation on the study of
verbs and their derivatives to attack directly their discovering. Experiences show that this ap-
proach proposes interesting results which are nevertheless dependent on verbal polysemy and
synonymy.
</p>
<p>Mots-clefs &#8211; Keywords
Terminologie, corpus sp&#233;cialis&#233;s, structuration de terminologies, relations transversales, verbes
Terminology, Specialised Corpora, Terminology Structuring, Transversal Relations, Verbs</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Grabar, V. Malais&#233;, A. Marcus, A. Krul
</p>
<p>1 Introduction
Les produits terminologiques ont la vocation de d&#233;crire la connaissance d&#8217;un secteur d&#8217;activit&#233;.
Cette description peut &#234;tre plus ou moins d&#233;taill&#233;e et fine : elle va d&#8217;une liste de termes &#171; &#224; plat &#187;
&#224; une terminologie structur&#233;e. La structure d&#8217;une terminologie peut &#234;tre assur&#233;e avec trois types
de relations (Grabar &amp; Hamon, 2004) :
</p>
<p>&#8226; Les relations hi&#233;rarchiques (ou est-un) :
pneumonie est-un bronchopneumonie
bronchopneumonie est-un maladie de l&#8217;appareil respiratoire
Notons que la relation partitive (m&#233;ronymie ou partie-tout), qui sert souvent &#224; d&#233;crire
les artefacts et les organismes vivants &#224; travers l&#8217;&#233;num&#233;ration de leurs parties constitu-
antes, peut &#233;galement assurer un r&#244;le structurant &#224; c&#244;t&#233; de la relation hi&#233;rarchique :
</p>
<p>poumon partie-de appareil respiratoire
&#8226; Les relations lexicales : la relation d&#8217;&#233;quivalence, ou de synonymie, relie les termes
&#233;quivalents : pneumonie et pneumopathie inflammatoire ; l&#8217;antonymie relie les termes
signifiant les notions oppos&#233;s ou contraires.
</p>
<p>&#8226; Les relations transversales relient les concepts qui se trouvent dans diff&#233;rentes branches
hi&#233;rarchiques de l&#8217;arbre du domaine. Elles peuvent avoir une port&#233;e d&#233;finitoire : un
diagnostic (pneumonie) est localis&#233; dans une partie du corps (poumon) et subit une atteinte
morphologique (inflammation) :
</p>
<p>pneumonie&#8594; localis&#233;-dans&#8594; poumon
&#8600;
</p>
<p>atteint-par &#8594; inflammation
De ces trois types de relations, les relations transversales, &#233;tant dans la majorit&#233; des cas sous-
sp&#233;cifi&#233;es, sont les plus occult&#233;es dans les produits terminologiques. Elles regroupent pourtant
plusieurs types de relations s&#233;mantiques potentiellement utiles en description de la connaissance
du domaine. Ces relations sont exprim&#233;es par les verbes ou bien articul&#233;es autour d&#8217;eux. Nous
distinguons les relations transversales suivantes :
</p>
<p>&#8226; Les relations pr&#233;dicatives ou actancielles refl&#232;tent l&#8217;organisation syntaxique dans les
&#233;nonc&#233;s et concernent les r&#244;les des groupes nominaux (termes potentiels) autour des
verbes (objet, acteur, patient, instrument, etc.) ;
</p>
<p>&#8226; Les relations causales, que nous distinguons &#224; part enti&#232;re, car elles sont potentiellement
pr&#233;sentes dans tout domaine et tout type de corpus ;
</p>
<p>&#8226; Les relations domaniales d&#233;crivent les relations d&#233;signant les actes, les processus ou
autres, sp&#233;cifiques au domaine et au corpus. Leur transposition sur un autre domaine
ou corpus n&#8217;est souvent pas possible, sinon sujette au changement de leur s&#233;mantique.
</p>
<p>Face aux travaux consacr&#233;s au rep&#233;rage des relations hi&#233;rarchiques (Hearst, 1992; Morin, 1999)
ou synonymiques (Hamon et al., 1998; Jacquemin, 1997), les relations domaniales ne sont pas
&#233;tudi&#233;es. La situation est d&#8217;autant plus compliqu&#233;e qu&#8217;elles sont d&#233;pendantes des domaines,
des corpus et m&#234;me des applications. Nous consacrons donc ce travail au rep&#233;rage de rela-
tions transversales et, en particulier de relations domaniales. La principale question que nous
nous posons est de savoir s&#8217;il est possible de faciliter cette t&#226;che et, si oui, comment. Nous
commen&#231;ons par une pr&#233;sentation des approches en structuration de terminologies qui peuvent
d&#233;boucher sur les relations transversales ou bien &#234;tre adapt&#233;es &#224; leur recherche (sec. 2). Nous
pr&#233;sentons ensuite la m&#233;thode suivie (sec. 3) et le mat&#233;riel requis (sec. 4) ; puis analysons et
discutons les r&#233;sultats (sec. 5) et tirons les conclusions (sec. 6).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de relations terminologiques transversales en corpus
</p>
<p>2 Pr&#233;sentation et discussion des travaux en rep&#233;rage automa-
tique de relations transversales
</p>
<p>Relations pr&#233;dicatives ou actancielles. Le rep&#233;rage de relations pr&#233;dicatives ou actancielles
peut profiter de l&#8217;existence des analyseurs syntaxiques. Les outils comme Shallow parser
de Xerox ou LinkParser1 (Brian, 2000) effectuent une analyse syntaxique des phrases et
d&#233;tectent les r&#244;les s&#233;mantiques. Dans la phrase : &#171; Pour combattre les effets des d&#233;chirures
dans la couche d&#8217;ozone la terre est recouverte d&#8217;une serre aliment&#233;e par un rayon laser. &#187;, le
Shallow parser indique que effets est l&#8217;objet du verbe combattre, que ozone est un objet
pr&#233;positionnel de couche, etc.
La morphologie constructionnelle (Corbin, 1987) conduit &#233;galement &#224; la d&#233;tection de ces re-
lations. Par exemple, -eur forme des noms d&#8217;agent &#224; partir des verbes : {transport routier,
transporteur routier} (Daille, 2003).
</p>
<p>Relation causale. Les verbes de la relation causale ont &#233;t&#233; recens&#233;s et class&#233;s dans le travail
de (Garcia, 1997); ils peuvent ainsi servir de marqueurs lexicaux pour la d&#233;tection de diff&#233;rents
types de causalit&#233;.
</p>
<p>Relations domaniales. Par d&#233;finition, les relations domaniales sont d&#233;pendantes des do-
maines. Les approches automatiques que nous pr&#233;sentons ici peuvent occasionnellement g&#233;n&#233;rer
des relations domaniales, sinon suite &#224; une adaptation. Les mod&#232;les distributionnelles et d&#8217;asso-
ciation (approches a posteriori), donnent des r&#233;sultats potentiellement riches en relations transver-
sales. Ainsi, l&#8217;analyse distributionnelle appliqu&#233;e par (Grefenstette, 1994) peut faire &#233;merger
plusieurs types de relations : antonymie (large, small) ; synonymie (large, important, great) ;
m&#233;ronymie (patient, group) ; hyperonymie (patient, child, woman) et des relations domaniales
(patient, treatment). Les r&#232;gles d&#8217;association (Toussaint &amp; Simon, 2000) proposent les relations
d&#8217;hyperonymie (histamine est-un biogenic amine), de co-hyponymie (spermidine est-un-
fr&#232;re putrescine) et domaniales (acids se-transforment-en esters, silica utilis&#233;-pour
chromatography). Le typage de ces relations est fait manuellement ; pour un typage automa-
tique l&#8217;utilisation de ressources s&#233;mantiques externes est n&#233;cessaire, mais s&#8217;av&#232;re insuffisante
(Nazarenko et al., 2001).
La projection de marqueurs lexicaux et de patrons lexico-syntaxiques est une approche a priori,
elle est bas&#233;e sur une &#233;tude initiale des corpus et du domaine. Le travail de (Garcia, 1997) pro-
pose des marqueurs pour le rep&#233;rage de la causalit&#233;. (S&#233;gu&#233;la &amp; Aussenac, 1997) d&#233;finissent de
nouveaux patrons, sp&#233;cifiques aux domaines et corpus &#233;tudi&#233;s, et y adaptent d&#8217;anciens patrons.
L&#8217;&#233;tude de la forme interne des termes peut conduire au rep&#233;rage de relations de synonymie
(Hamon et al., 1998; Jacquemin, 1997), et de relations hi&#233;rarchiques (Grabar &amp; Zweigenbaum,
2003). Dans ce dernier cas, il s&#8217;agit de l&#8217;inclusion lexicale des termes : le terme incluant est
l&#8217;hyponyme du terme inclus (st&#233;nose de l&#8217;aorte est-un st&#233;nose). Lorsque le terme inclus
se trouve en position de t&#234;te syntaxique, il s&#8217;agit potentiellement d&#8217;une relation hi&#233;rarchique,
sinon la relation peut &#171; cacher &#187; une relation transversale (Grabar &amp; Zweigenbaum, 2003). En
reprenant l&#8217;exemple pr&#233;c&#233;dent : st&#233;nose de l&#8217;aorte localis&#233;-dans aorte.
Avec les approches cit&#233;es, les relations domaniales sont les plus hasardeuses au rep&#233;rage. De
plus, l&#8217;acc&#232;s &#224; ces relations n&#8217;est pas direct mais sujet &#224; l&#8217;&#233;tude du domaine et du corpus.
</p>
<p>1Disponible &#224; l&#8217;adresse http://search.cpan.org/dist/Lingua-LinkParser/.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Grabar, V. Malais&#233;, A. Marcus, A. Krul
</p>
<p>3 M&#233;thode
Face &#224; ces difficult&#233;s de rep&#233;rage de relations domaniales, nous nous demandons si les donn&#233;es
elles-m&#234;mes ne peuvent pas guider, de mani&#232;re (semi)automatique, la t&#226;che. Nous restons sur
l&#8217;hypoth&#232;se que ces relations sont articul&#233;es autour des verbes et des noms d&#233;verbaux d&#8217;action.
Les noms d&#233;verbaux sont rep&#233;r&#233;s par rapport &#224; leurs suffixes d&#233;rivationnels les plus productifs
et fr&#233;quents : -ation {cog&#233;n&#233;rer, cog&#233;n&#233;ration}, -ment {d&#233;velopper, d&#233;veloppement} et -age
{relever, relevage}.
Nous explorons deux pistes dans le rep&#233;rage de relations domaniales et v&#233;rifions &#224; chaque fois
si les relations d&#233;j&#224; d&#233;couvertes dans notre corpus lors d&#8217;une &#233;tude pr&#233;c&#233;dente, correspondent
aux verbes qui y sont usit&#233;s. La premi&#232;re pr&#233;voit un investissement minimal et consiste en un
examen de la liste des verbes du corpus. La deuxi&#232;me piste cerne les verbes d&#8217;une mani&#232;re plus
contrainte. Elle est inspir&#233;e des travaux d&#8217;Emmanuel Morin (Morin, 1999) : &#224; partir d&#8217;une liste
de termes en relations transversales projet&#233;s sur le corpus nous rep&#233;rons et analysons les pa-
trons qui leur correspondent. Nous utilisons les ressources s&#233;mantiques (s&#233;ries de synonymes)
provenant d&#8217;un dictionnaire de langue g&#233;n&#233;rale (le Robert d&#8217;une &#233;dition des ann&#233;es 70) afin
d&#8217;&#233;tablir les liens s&#233;mantiques entre diff&#233;rents verbes pouvant &#234;tre consid&#233;r&#233;s comme &#233;quiva-
lents. Si la correspondance entre les verbes utilis&#233;s dans le corpus et les verbes exprimant les
relations d&#233;j&#224; valid&#233;es existe, l&#8217;acquisition des relations domaniales pourrait &#234;tre guid&#233;e par les
verbes et les noms d&#233;verbaux d&#8217;action qu&#8217;un corpus contient.
</p>
<p>4 Pr&#233;paration et s&#233;lection du mat&#233;riel
Corpus. Le corpus sur la cog&#233;n&#233;ration contient les documents provenant de l&#8217;Internet, des
bases de donn&#233;es internes d&#8217;EDF et des actes de conf&#233;rences. Tous ces documents ont &#233;t&#233;
tri&#233;s et filtr&#233;s. L&#8217;&#233;tiquetage morphosyntaxique est effectu&#233; avec TreeTagger et corrig&#233; avec
Flemm. Le corpus contient 772 003 occurrences.
</p>
<p>Termes en relations transversales. L&#8217;analyse et validation (1) des relations de synonymie
g&#233;n&#233;r&#233;es avec Synoterm (Hamon et al., 1998), (2) de relations hi&#233;rarchiques g&#233;n&#233;r&#233;es &#224; travers
les inclusions lexicales (Grabar &amp; Zweigenbaum, 2003) et (3) de relations hi&#233;rarchique, m&#233;rony-
miques et lexicales trouv&#233;es avec les patrons lexico-syntaxiques de (S&#233;gu&#233;la &amp; Aussenac,
1997), nous ont conduit finalement &#224; un ensemble de 19 relations terminologiques. Parmi les
relations domaniales d&#233;tect&#233;es, nous s&#233;lectionnons pour l&#8217;analyse les relations suivantes :
</p>
<p>&#8226; conduit (12 paires de termes) : l&#8217;objet nomm&#233; par le 1er terme effectue le transport ou
la conduite de la substance nomm&#233;e par le 2eme terme :
r&#233;seau de transport de l&#8217;&#233;lectricit&#233; conduit &#233;lectricit&#233;,
conduit d&#8217;&#233;chappement conduit gaz d&#8217;&#233;chappement.
</p>
<p>&#8226; consomme (52 paires de termes) : l&#8217;objet nomm&#233; par le 1er terme consomme la substance
nomm&#233;e par le 2eme terme :
centrale bagasse consomme bagasse, microturbine consomme biogaz.
</p>
<p>&#8226; produit (234 paires de termes) : signifie des processus de production concr&#232;te (naturelle
ou art&#233;factuelle) ou abstraite :
organisme d&#8217;accr&#233;ditation produit accr&#233;ditation,
digesteur produit biogaz,
cog&#233;n&#233;ration produit chaleur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de relations terminologiques transversales en corpus
</p>
<p>5 R&#233;sultats et discussion
Liste des verbes du corpus. L&#8217;&#233;tiquetage morphosyntaxique montre que le corpus contient
1 922 verbes (sans &#233;purer les erreurs d&#8217;&#233;tiquetage). Nous en s&#233;lectionnons 1 028, qui apparais-
sent au moins quatre fois : ces verbes tr&#232;s ou moyennement fr&#233;quents sont peut-&#234;tre caract&#233;ris-
tiques du domaine. Leur analyse peut conduire aux types suivants : production de l&#8217;&#233;nergie
(produire, r&#233;aliser, appliquer, ...), sa distribution (fournir, conduire, consommer, alimenter, ac-
corder, ...), etc. Par contre, si nous repla&#231;ons ces verbes dans leurs contextes, il s&#8217;av&#232;re (1) qu&#8217;&#224;
c&#244;t&#233; des noms d&#233;verbaux obtenus par suffixation, on doit &#233;galement examiner ceux obtenus par
conversion {conduire/V, conduit/N, conduite/N} ; (2) que les verbes sont polys&#233;miques et ne
peuvent pas &#234;tre utilis&#233;s tels quels.
</p>
<p>Projection de termes en relations domaniales sur le corpus. Les paires de termes en
relations domaniales projet&#233;es sur le corpus n&#8217;ont pas toutes donn&#233; de contextes verbaux ou
d&#233;verbaux. Ainsi, les paires de termes qui n&#8217;apparaissent pas dans l&#8217;espace phrastique, ne
peuvent pas conduire &#224; l&#8217;&#233;tablissement de patrons lexico-syntaxiques.
La relation produit est signifi&#233;e souvent par le verbe produire et ses nombreux d&#233;riv&#233;s, que
le patron lexico-syntaxique devrait prendre en compte : les noms production, producteur, pro-
duit, les formes verbales produire, produite, produisant, (il) produit, (ils) produisent, (ils) pro-
duisaient. Tel n&#8217;est pas le cas pour le verbe consommer et ses d&#233;riv&#233;s, qui ne sont pourtant
pas polys&#233;miques dans le corpus. Ils se retrouvent souvent &#224; proximit&#233; des termes &#171; con-
sommables &#187; (&#233;nergie, gaz, &#233;lectricit&#233;), mais ne marquent pas, dans les contextes relev&#233;s, cette
relation. Dans d&#8217;autres cas, ces relations sont exprim&#233;es avec des verbes ou des expressions
verbales &#171; synonymes &#187;, comme par exemple pour la relation consomme : dispose, utilise,
fonctionne avec. Les s&#233;ries de synonymes de Le Robert n&#8217;indiquent que tr&#232;s partiellement ces
relations synonymiques. Ce qui n&#8217;est pas surprenant : dans un corpus sp&#233;cialis&#233;, les moyens
d&#8217;expressions divergent de ceux existant dans la langue g&#233;n&#233;rale. La constitution de classes
de verbes avec une approche distributionnelle pourrait fournir des &#233;quivalences entre eux plus
valables pour un corpus. D&#8217;autres relations, non d&#233;crites ici, ont un comportement similaire ou
bien n&#8217;ont pas fourni de r&#233;sultats int&#233;ressants. De mani&#232;re g&#233;n&#233;rale, cette approche bute &#224; la
polys&#233;mie et la synonymie verbale. Le rep&#233;rage et le typage de relations domaniales s&#8217;av&#232;rent
donc &#234;tre d&#233;licats et n&#233;cessitent un travail suppl&#233;mentaire en d&#233;sambigu&#239;sation des verbes.
</p>
<p>6 Conclusion et perspectives
Nous avons pr&#233;sent&#233; des exp&#233;riences de rep&#233;rage et de typage de relations domaniales en corpus
de sp&#233;cialit&#233;. Ces exp&#233;riences sont bas&#233;es sur l&#8217;exploitation des verbes et de leurs d&#233;riv&#233;s. Il
appara&#238;t ainsi que certaines relations (comme produit) sont exprim&#233;es par les verbes corre-
spondants et leurs d&#233;riv&#233;s. Qui plus est, ces verbes se retrouvent parmis les plus fr&#233;quents du
corpus et peuvent &#234;tre consid&#233;r&#233;s comme sp&#233;cifiques. Mais pour la plupart des relations, ce sont
les expressions et verbes &#233;quivants qui sont utilis&#233;s. La d&#233;couverte de ces &#233;quivalents deman-
dent l&#8217;utilisation de ressources s&#233;mantiques. Nous avons exploit&#233; les ressources provenant de
la langue g&#233;n&#233;rale (s&#233;ries de synonymes de Le Robert) et constat&#233; qu&#8217;elles ne facilitent pas de
beaucoup la d&#233;couverte de relations domaniales. De mani&#232;re plus s&#251;re, ces expressions &#233;mer-
gent avec la d&#233;couverte du corpus et du domaine. D&#8217;autres relations encore ne peuvent pas &#234;tre
exprim&#233;es avec les patrons lexico-syntaxiques : les termes correspondants n&#8217;apparaissent pas &#224;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Grabar, V. Malais&#233;, A. Marcus, A. Krul
</p>
<p>l&#8217;int&#233;rieur des segments (phrases) &#224; partir desquels les patrons pourraient &#234;tre d&#233;finis.
De mani&#232;re g&#233;n&#233;rale, les relations domaniales sont plut&#244;t impr&#233;visibles lors de l&#8217;&#233;tude d&#8217;un nou-
veau domaine, et les verbes n&#8217;apportent qu&#8217;une solution partielle dans leur rep&#233;rage et typage.
Ils proposent par contre des informations qui peuvent permettre d&#8217;aborder assez rapidement les
relations domaniales. &#192; c&#244;t&#233; des m&#233;thodes automatiques d&#233;j&#224; existantes, les verbes constituent
une aide suppl&#233;mentaire.
</p>
<p>R&#233;f&#233;rences
BRIAN D. (2000). Parsing natural language with lingua::linkparser. Perl Journal, 19, 60&#8211;66. Disponible
&#224; http://www.improvist.com/Projects/Technology/Papers/LinkParser/. Visit&#233;
le 31/12/2003.
CORBIN D. (1987). Morphologie d&#233;rivationnelle et structuration du lexique, volume 1. Lille: Presse
universitaire de Lille.
DAILLE B. (2003). Conceptual structuring through term variations. In Proceedings of the ACL Work-
shop on Multiword Expressions : Analysis, Acquisition and Treatment, p. 9&#8211;16.
GARCIA D. (1997). Structuration du lexique de la causalit&#233; et r&#233;alisation d&#8217;un syst&#232;me d&#8217;aide au
rep&#233;rage de l&#8217;action dans les textes. In Terminologie et Intelligence Artificielle (TIA), p. 7&#8211;26, Toulouse.
GRABAR N. &amp; HAMON T. (2004). Les relations dans les terminologies structur&#233;es : de la th&#233;orie &#224; la
pratique. Revue d&#8217;Intelligence Artificielle (RIA), (1). Sous presse.
GRABAR N. &amp; ZWEIGENBAUM P. (2003). Lexically-based terminology structuring. In Terminology.
Sous presse.
GREFENSTETTE G. (1994). Explorations in automatic thesaurus discovery. Kluwer Academic Publish-
ers.
HAMON T., NAZARENKO A. &amp; GROS C. (1998). A step towards the detection of semantic variants
of terms in technical documents. In Proceedings of 17th International Conference on Computational
Linguistics (COLING-ACL&#8217;98), p. 498&#8211;504, Universit&#233; de Montr&#233;al, Montr&#233;al, Quebec, Canada.
HEARST M. A. (1992). Automatic acquisition of hyponyms from large text corpora. In Proceedings
of the Fourteenth International Conference on Computational Linguistics, Nantes, France. Disponible
&#224; http://sern.ucalgary.ca/KSI/KAW/KAW99/papers/Gery1/index.html. Visit&#233; le
26/08/99.
JACQUEMIN C. (1997). Guessing morphology from terms and corpora. In ACM SIGIR.
MORIN E. (1999). Acquisition de patrons lexico-syntaxiques caract&#233;ristiques d&#8217;une relation s&#233;mantique.
Traitement Automatique des Langues (TAL), 40(1), 143&#8211;166.
NAZARENKO A., ZWEIGENBAUM P., HABERT B. &amp; BOUAUD J. (2001). Corpus-based extension of
a terminological semantic lexicon. In Recent Advances in Computational Terminology, p. 327&#8211;351.
Benjamins.
S&#201;GU&#201;LA P. &amp; AUSSENAC N. (1997). Un mod&#232;le de base de connaissances terminologiques. In Ter-
minologie et Intelligence Artificielle (TIA), p. 47&#8211;68, Toulouse.
TOUSSAINT Y. &amp; SIMON A. (2000). Building and interpreting term dependencies using association
rules extracted from galois lattices. In Recherche d&#8217;Information Assist&#233;e par Ordinateur (RIAO), p.
1686&#8211;1692, Paris.</p>

</div></div>
</body></html>