<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Le projet G&#201;RAF : Guide pour l&#8217;&#201;valuation des R&#233;sum&#233;s Automatiques Fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, Session Poster, F&#232;s, 19&#8211;21 avril 2004
</p>
<p>Le projet G&#201;RAF : Guide pour l&#8217;&#201;valuation des R&#233;sum&#233;s
Automatiques Fran&#231;ais
</p>
<p>Marie-Jos&#233;e Goulet (1,2)
et
</p>
<p>Jo&#235;l Bourgeoys (1,3)
(1) L-TAL - Universit&#233; Laval, Qu&#233;bec, Canada
</p>
<p>(2) Laboratoire LaLICC - Universit&#233; Paris IV-Sorbonne, France
(3) LIC2M - CEA/LIST, Paris, France
</p>
<p>marie-josee.goulet.1@ulaval.ca, joel.bourgeoys.1@ulaval.ca
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans cet article, nous pr&#233;sentons le projet G&#201;RAF (Guide pour l&#8217;&#201;valuation des R&#233;sum&#233;s Au-
tomatiques Fran&#231;ais), lequel vise l&#8217;&#233;laboration de protocoles et la construction de corpus de
r&#233;sum&#233;s de r&#233;f&#233;rence pour l&#8217;&#233;valuation des syst&#232;mes r&#233;sumant des textes fran&#231;ais. La finalit&#233; de
ce projet est de mettre &#224; la disposition des chercheurs les ressources ainsi cr&#233;&#233;es.
In this paper, we introduce G&#201;RAF (Guide pour l&#8217;&#201;valuation des R&#233;sum&#233;s Automatiques Fran-
&#231;ais), which aims at elaborating protocols and creating human-generated summaries for sum-
marization evaluation in the context of French texts. The goal of this project is to provide re-
searchers with protocols and corpora needed for French summarization evaluation.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>&#233;valuation, r&#233;sum&#233; automatique, textes fran&#231;ais, G&#201;RAF
evaluation, automatic summarization, French texts, G&#201;RAF
</p>
<p>1 Introduction et probl&#233;matique
</p>
<p>L&#8217;&#233;valuation doit d&#233;sormais faire partie int&#233;grante de tout programme de TAL. Nos travaux de
recherche portent sur l&#8217;&#233;valuation des syst&#232;mes de r&#233;sum&#233; automatique fran&#231;ais. De plus en
plus de chercheurs se consacrent aujourd&#8217;hui au d&#233;veloppement de syst&#232;mes qui r&#233;sument des
textes fran&#231;ais. Mentionnons &#224; titre d&#8217;exemple le syst&#232;me commercial Copernic Summarizer d&#233;-
velopp&#233; au Qu&#233;bec, la plate-forme ContextO d&#233;velopp&#233;e au laboratoire LaLICC &#224; l&#8217;universit&#233;
Paris IV (Crispino, 2003), le syst&#232;me Pertinence disponible sur internet (www.pertinence.net),
ainsi que des syst&#232;mes faisant l&#8217;objet de th&#232;ses ou des syst&#232;mes en d&#233;veloppement. On peut
supposer que, dans les ann&#233;es &#224; venir, d&#8217;autres syst&#232;mes r&#233;sumant des textes fran&#231;ais verront
le jour. Il est donc souhaitable, voire primordial, de mettre &#224; la disposition des chercheurs des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Jos&#233;e Goulet, Jo&#235;l Bourgeoys
</p>
<p>ressources pour l&#8217;&#233;valuation des syst&#232;mes de r&#233;sum&#233; automatique fran&#231;ais. Par ressources, nous
entendons : des corpus de textes sources fran&#231;ais &#224; r&#233;sumer, des corpus de r&#233;sum&#233;s de r&#233;f&#233;-
rence avec lesquels comparer les r&#233;sum&#233;s automatiques produits par le syst&#232;me, des protocoles
d&#8217;&#233;valuation d&#233;taill&#233;s ainsi que des exemples d&#8217;application de ces protocoles.
</p>
<p>Dans cet article, nous pr&#233;sentons les premi&#232;res d&#233;marches pour la cr&#233;ation du projet G&#201;RAF
(Guide pour l&#8217;&#201;valuation des R&#233;sum&#233;s Automatiques Fran&#231;ais). D&#8217;abord, nous d&#233;crivons les
m&#233;thodes traditionnelles d&#8217;&#233;valuation des syst&#232;mes de r&#233;sum&#233; automatique et proposons un
nouveau protocole d&#8217;&#233;valuation pour les extraits automatiques fran&#231;ais. Ensuite, nous abordons
la construction de corpus de r&#233;sum&#233;s de r&#233;f&#233;rence requis pour l&#8217;application de ce protocole
d&#8217;&#233;valuation. Dans la derni&#232;re partie, une br&#232;ve conclusion rappelant les points importants ouvre
la discussion sur les perspectives du projet G&#201;RAF.
</p>
<p>2 Protocoles pour l&#8217;&#233;valuation des r&#233;sum&#233;s automatiques
</p>
<p>D&#233;fini simplement, un r&#233;sum&#233; automatique est une version plus courte d&#8217;un texte source, qui
renferme l&#8217;information la plus importante de ce texte, et qui est produite par des moyens infor-
matiques. Les Anglo-saxons opposent deux types de r&#233;sum&#233; automatique, l&#8217;abstract et l&#8217;extract.
Dans ce texte, nous utiliserons les expressions francis&#233;es abr&#233;g&#233; et extrait. L&#8217;abr&#233;g&#233; est produit
par un processus de compr&#233;hension du texte source suivi d&#8217;une g&#233;n&#233;ration de texte, tandis que
l&#8217;extrait est produit par un processus d&#8217;extraction des phrases saillantes &#224; partir du texte source
(Mani et al., 2002).
Le projet G&#201;RAF, pr&#233;sent&#233; pour la premi&#232;re fois dans cet article, vise l&#8217;&#233;valuation de tous les
types de r&#233;sum&#233; automatique fran&#231;ais. Toutefois, les d&#233;marches entreprises jusqu&#8217;&#224; maintenant
ont &#233;t&#233; orient&#233;es principalement vers l&#8217;&#233;valuation des r&#233;sum&#233;s de type extrait, auxquels sera
consacr&#233; le reste de l&#8217;expos&#233;. Ce choix s&#8217;explique par un besoin plus pressant pour l&#8217;&#233;valuation
des extraits automatiques, par opposition aux abr&#233;g&#233;s automatiques, les chercheurs s&#8217;&#233;tant &#224; ce
jour surtout int&#233;ress&#233;s au d&#233;veloppement de ce type de r&#233;sum&#233; (Edmundson, 1969; Klavans et
al., 1998).
</p>
<p>2.1 &#201;valuation du contenu
Deux aspects g&#233;n&#233;raux d&#8217;un extrait automatique peuvent &#234;tre &#233;valu&#233;s, soit le contenu et la lisi-
bilit&#233;. Le contenu correspond &#224; l&#8217;information fournie par l&#8217;extrait tandis que la lisibilit&#233; r&#233;f&#232;re &#224;
la coh&#233;sion de l&#8217;extrait. Comme nous le verrons, il n&#8217;existe pas de consensus quant &#224; la m&#233;thode
d&#8217;&#233;valuation &#224; pr&#233;coniser.
</p>
<p>En ce qui concerne l&#8217;&#233;valuation du contenu, la m&#233;thode la plus r&#233;pandue consiste &#224; comparer
l&#8217;extrait automatique avec un r&#233;sum&#233; de r&#233;f&#233;rence. Ce r&#233;f&#233;rentiel peut prendre diverses formes.
Ainsi, certains chercheurs ont compar&#233; des extraits automatiques avec des r&#233;sum&#233;s auteurs (Teu-
fel, Moens, 1997). Le r&#233;sum&#233; auteur, comme son nom l&#8217;indique, correspond au r&#233;sum&#233; r&#233;dig&#233;
par l&#8217;auteur d&#8217;un texte. D&#8217;autres chercheurs ont quant &#224; eux compar&#233; des extraits automatiques
avec des r&#233;sum&#233;s professionnels (Kupiec et al., 1995). Le r&#233;sum&#233; professionnel, par opposition
au r&#233;sum&#233; auteur, est r&#233;dig&#233; par une autre personne que l&#8217;auteur du texte. Dans les deux cas
toutefois, la comparaison entre l&#8217;extrait automatique et le r&#233;f&#233;rentiel s&#8217;effectue sur la base des
concepts cl&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Projet G&#201;RAF
</p>
<p>D&#8217;autres chercheurs ont adopt&#233; une m&#233;thode o&#249; les extraits automatiques sont compar&#233;s avec
des extraits manuels (Jing et al., 1998; Rath et al., 1961). L&#8217;extrait manuel correspond &#224; un
r&#233;sum&#233; produit par un humain en s&#233;lectionnant les phrases saillantes du texte source. Bien
que peu de d&#233;tails soient fournis concernant la production de l&#8217;extrait manuel dans les &#233;tudes
pr&#233;c&#233;dentes, on peut supposer que le &#171; r&#233;sumeur &#187; doit d&#8217;abord proc&#233;der &#224; l&#8217;identification des
sujets saillants, pour ensuite s&#233;lectionner les phrases repr&#233;sentant ces sujets.
Une fois l&#8217;extrait manuel produit, il s&#8217;agit de v&#233;rifier si toutes ses phrases sont pr&#233;sentes dans
l&#8217;extrait automatique. Cette comparaison s&#8217;effectue &#224; l&#8217;aide des mesures classiques de rappel et
de pr&#233;cision, emprunt&#233;es au domaine du rep&#233;rage d&#8217;information.
</p>
<p>Dans le cadre du projet G&#201;RAF, nous proposons d&#8217;utiliser une autre forme de r&#233;f&#233;rentiel. Ce
r&#233;f&#233;rentiel est con&#231;u comme une liste de sujets saillants, correspondant en fait &#224; une forme
interm&#233;diaire entre le texte source et la liste de phrases saillantes. Bien entendu, utiliser une
autre forme de r&#233;f&#233;rentiel nous oblige &#224; reconsid&#233;rer en entier la m&#233;thode de comparaison entre
l&#8217;extrait manuel et l&#8217;extrait automatique. La comparaison s&#8217;effectuera en deux &#233;tapes : 1) Une
mise en correspondance directe visant &#224; v&#233;rifier si les sujets saillants du r&#233;f&#233;rentiel sont pr&#233;sents
textuellement dans l&#8217;extrait automatique ; 2) Une mise en correspondance indirecte visant &#224;
v&#233;rifier si les sujets saillants du r&#233;f&#233;rentiel sont repr&#233;sent&#233;s par un autre segment textuel dans
l&#8217;extrait automatique, par exemple une anaphore ou un synonyme. Ces mises en correspondance
seront effectu&#233;es de mani&#232;re manuelle dans un premier temps. Dans un deuxi&#232;me temps, nous
pourrions envisager de concevoir une m&#233;thode automatique ou semi-automatique de mise en
correspondance.
</p>
<p>Cette m&#233;thode pour l&#8217;&#233;valuation du contenu des extraits automatiques pr&#233;sente deux avantages
non n&#233;gligeables. Premi&#232;rement, l&#8217;extrait manuel con&#231;u comme une liste de sujets saillants sera
plus facile &#224; produire que l&#8217;extrait manuel traditionnel sous forme de phrases saillantes, puis-
qu&#8217;il implique une &#233;tape de moins. Deuxi&#232;mement, notre m&#233;thode permettra de tenir compte
de la dimension s&#233;mantique, ce qui n&#8217;est pas possible lors d&#8217;une comparaison avec une liste de
phrases. Dans cette derni&#232;re m&#233;thode, l&#8217;extrait n&#8217;est consid&#233;r&#233; de bonne qualit&#233; que lorsqu&#8217;il
contient les m&#234;mes phrases que le r&#233;f&#233;rentiel. Toutefois, une phrase de l&#8217;extrait automatique
absente du r&#233;f&#233;rentiel peut exprimer le m&#234;me contenu qu&#8217;une phrase de ce r&#233;f&#233;rentiel. Avec la
m&#233;thode des sujets saillants, il sera possible de tenir compte de la synonymie inh&#233;rente &#224; tout
texte, ce qui &#224; notre avis permettra d&#8217;&#233;valuer &#224; sa juste valeur le contenu d&#8217;un extrait automa-
tique.
</p>
<p>2.2 &#201;valuation de la lisibilit&#233;
Les extraits automatiques sont produits en extrayant, par des analyses statistiques ou linguis-
tiques, les phrases saillantes des textes &#224; r&#233;sumer. Cette m&#233;thode entra&#238;ne de nombreuses la-
cunes au niveau de la coh&#233;sion des extraits, par exemple lorsqu&#8217;une phrase extraite contient un
pronom dont l&#8217;ant&#233;c&#233;dent se trouve dans une phrase non extraite. Ces lacunes nuisent &#233;videm-
ment &#224; la lisibilit&#233; des extraits automatiques.
</p>
<p>La m&#233;thode la plus r&#233;pandue pour l&#8217;&#233;valuation de la lisibilit&#233; consiste &#224; demander &#224; des juges
d&#8217;accorder une note aux extraits automatiques selon des crit&#232;res pr&#233;-&#233;tablis (Mani, Maybury,
1999; Minel et al., 1997). Comme exemples de crit&#232;res, mentionnons la pr&#233;sence d&#8217;anaphores
sans ant&#233;c&#233;dent, les ruptures dans l&#8217;argumentation et les r&#233;p&#233;titions. Bien que ces crit&#232;res g&#233;-
n&#233;raux puissent &#234;tre de bons indicateurs d&#8217;un manque de coh&#233;sion, nous pensons qu&#8217;une &#233;tude</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Jos&#233;e Goulet, Jo&#235;l Bourgeoys
</p>
<p>plus approfondie est n&#233;cessaire dans le cas des extraits automatiques fran&#231;ais.
</p>
<p>Nous effectuons pr&#233;sentement une &#233;tude &#224; partir d&#8217;extraits automatiques fran&#231;ais produits par
le syst&#232;me ContextO1. Cette &#233;tude empirique, bien qu&#8217;inachev&#233;e, indique que les erreurs de co-
h&#233;sion dans les extraits automatiques sont plus vari&#233;es que ce que laissent entrevoir les r&#233;sultats
des &#233;tudes pr&#233;c&#233;dentes. &#192; titre d&#8217;exemple, nous avons rep&#233;r&#233; neuf types d&#8217;anaphorique sans
ant&#233;c&#233;dent : 1) Nom propre, 2) Nom commun, 3) Acronyme, 4) Pronom personnel, 5) Pronom
d&#233;monstratif, 6) Adjectif d&#233;monstratif, 7) Adjectif possessif, 8) Adjectifs ind&#233;finis, 9) Adverbes.
Nous avons &#233;galement rep&#233;r&#233; des connecteurs, par exemple ainsi, donc, mais, introduisant une
id&#233;e dont la premi&#232;re partie n&#8217;a pas &#233;t&#233; incluse dans l&#8217;extrait.
</p>
<p>Nous pensons qu&#8217;il est n&#233;cessaire d&#8217;&#233;tudier la quantification et la distribution des erreurs de
coh&#233;sion dans un corpus d&#8217;extraits automatiques fran&#231;ais afin de d&#233;gager des crit&#232;res pr&#233;cis pour
l&#8217;&#233;valuation de la lisibilit&#233;, un peu comme il a &#233;t&#233; fait dans l&#8217;&#233;tude de (Nanba, Okumura, 2000)
&#224; partir d&#8217;extraits automatiques japonais. &#192; notre connaissance, aucune &#233;tude empirique n&#8217;a
pr&#233;sent&#233; une quantification exhaustive des erreurs de lisibilit&#233; &#224; partir d&#8217;extraits automatiques
fran&#231;ais.
</p>
<p>De plus, le projet G&#201;RAF &#233;tablira une fa&#231;on de mettre en relation l&#8217;&#233;valuation de la lisibilit&#233;
et l&#8217;&#233;valuation du contenu, afin de v&#233;rifier s&#8217;il existe une corr&#233;lation entre les r&#233;sultats de ces
deux &#233;valuations. Plus pr&#233;cis&#233;ment, nous cherchons &#224; savoir si les extraits automatiques jug&#233;s
faibles au niveau du contenu pr&#233;sentent plus de lacunes au niveau de la coh&#233;sion que ceux jug&#233;s
ad&#233;quats.
</p>
<p>3 Corpus pour l&#8217;application des protocoles &#233;labor&#233;s dans le
projet G&#201;RAF
</p>
<p>&#192; notre connaissance, aucun corpus de textes fran&#231;ais accompagn&#233;s d&#8217;extraits manuels de r&#233;-
f&#233;rence n&#8217;est &#224; la disposition des chercheurs. Afin de combler cette lacune, le projet G&#201;RAF
pr&#233;voit la constitution d&#8217;un corpus d&#8217;extraits manuels de r&#233;f&#233;rence. Comme nous l&#8217;avons vu
dans la section 2.1, ce r&#233;f&#233;rentiel se pr&#233;sente sous forme d&#8217;une liste de sujets saillants, ce qui
constitue une id&#233;e originale. Cette liste des sujets saillants peut &#234;tre produite &#224; partir du texte
source ou &#224; partir d&#8217;un r&#233;sum&#233; auteur.
</p>
<p>La constitution du corpus d&#8217;extraits manuels dans le projet G&#201;RAF requiert deux types de
texte. Dans le cas o&#249; les sujets saillants sont identifi&#233;s &#224; partir des textes sources, nous pour-
rions utiliser les textes de L&#8217;Actualit&#233;, La Recherche, Le Monde ou Le Monde diplomatique.
Il serait aussi int&#233;ressant d&#8217;utiliser des textes qui ne sont pas sous droits. Dans le cas o&#249; les
sujets saillants sont identifi&#233;s &#224; partir de r&#233;sum&#233;s auteurs, nous pourrions utiliser les articles des
colloques francophones qui sont accompagn&#233;s de r&#233;sum&#233;s auteurs. Pour le moment, nous privi-
l&#233;gions la m&#233;thode de production des extraits manuels &#224; partir des textes sources. La m&#233;thode
de s&#233;lection des sujets saillants &#224; partir de r&#233;sum&#233;s auteurs pourrait en effet entra&#238;ner des pertes
d&#8217;information, par exemple si des sujets saillants des articles ont &#233;t&#233; omis par les auteurs dans
les r&#233;sum&#233;s.
</p>
<p>Par ailleurs, le choix des textes sources d&#233;pend de plusieurs facteurs. Il faut tenir compte du
</p>
<p>1ContextO a &#233;t&#233; d&#233;velopp&#233; au laboratoire LaLICC (Langages, Logiques, Informatique, Cognition et Commu-
nication) &#224; l&#8217;Universit&#233; Paris IV-Sorbonne.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Projet G&#201;RAF
</p>
<p>type de texte pour lequel le syst&#232;me a &#233;t&#233; d&#233;velopp&#233;. Par exemple, certains syst&#232;mes servent &#224;
r&#233;sumer des textes scientifiques ou techniques, alors que d&#8217;autres servent &#224; r&#233;sumer des articles
de journaux. Il faut &#233;galement tenir compte du domaine dont traitent les textes sources, car
certains syst&#232;mes utilisent des connaissances linguistiques propres &#224; un domaine particulier
dans leur algorithme d&#8217;analyse. Enfin, comme de nombreux auteurs l&#8217;ont d&#233;j&#224; fait remarquer
(Minel, 2002; Spark Jones, 1999), la nature des besoins de l&#8217;utilisateur constitue ind&#233;niablement
un facteur &#224; consid&#233;rer lors la construction du syst&#232;me comme tel, lors du choix des textes &#224;
r&#233;sumer, ainsi que lors de l&#8217;&#233;valuation.
</p>
<p>Plusieurs facteurs devront &#233;galement &#234;tre pris en consid&#233;ration pour la constitution du corpus
d&#8217;extraits manuels, notamment la longueur et la nature des textes sources, le nombre d&#8217;extraits
&#224; produire, le nombre et le profil des &#171; r&#233;sumeurs &#187; et les instructions &#224; leur donner. Dans une
&#233;tude pr&#233;c&#233;dente (Goulet, 2003), nous avons d&#233;montr&#233; que ces facteurs pouvaient influencer,
chacun &#224; leur fa&#231;on, le degr&#233; d&#8217;accord entre les &#171; r&#233;sumeurs &#187; lors de la s&#233;lection des phrases
saillantes. Logiquement, nous pouvons supposer que ces facteurs peuvent avoir des r&#233;percus-
sions sur l&#8217;accord inter-juges lors de la s&#233;lection des sujets saillants.
</p>
<p>4 Conclusion et perspectives
</p>
<p>Cet article avait pour but de pr&#233;senter le projet G&#201;RAF, que nous pouvons concevoir comme un
coffre &#224; outils pour l&#8217;&#233;valuation des r&#233;sum&#233;s automatiques fran&#231;ais. Nos propositions m&#233;thodo-
logiques pr&#233;sentent des avantages par rapport aux m&#233;thodes d&#8217;&#233;valuation traditionnelles. Pre-
mi&#232;rement, en ce qui concerne la production des r&#233;f&#233;rentiels, notre m&#233;thode des sujets saillants
sera plus facile &#224; appliquer. Deuxi&#232;mement, notre m&#233;thode de comparaison permettra de tenir
compte de la dimension s&#233;mantique, en raison de la mise en correspondance indirecte entre
les extraits automatiques et les r&#233;f&#233;rentiels. Troisi&#232;mement, notre &#233;tude empirique des facteurs
nuisant &#224; la coh&#233;sion des extraits automatiques permettra de d&#233;gager des crit&#232;res pr&#233;cis pour
l&#8217;&#233;valuation de la lisibilit&#233;. Rappelons aussi que tout au long de ce travail, une attention particu-
li&#232;re sera accord&#233;e &#224; la mise en place de tous les moyens permettant de minimiser la subjectivit&#233;.
Dans un contexte plus g&#233;n&#233;ral, notre projet pourrait s&#8217;int&#233;grer au sein des campagnes d&#8217;&#233;valua-
tion d&#233;j&#224; existantes, lesquelles servent &#224; comparer la performance des syst&#232;mes d&#8217;un m&#234;me do-
maine du TAL. Il existe de nombreuses campagnes d&#8217;&#233;valuation, par exemple la campagne am&#233;-
ricaine TREC (Text REtrieval Conferences) qui &#233;value les syst&#232;mes de rep&#233;rage d&#8217;information
dans les textes anglais (depuis 1992) et la campagne europ&#233;enne CLEF (Cross-Language Eva-
luation Forum) qui &#233;value les syst&#232;mes de rep&#233;rage d&#8217;information multilingues (depuis 2000).
En ce qui concerne l&#8217;&#233;valuation des syst&#232;mes de r&#233;sum&#233; automatique, deux campagnes d&#8217;&#233;va-
luation ont d&#233;j&#224; &#233;t&#233; men&#233;es par l&#8217;agence am&#233;ricaine DARPA (Defense Advanced Research Pro-
jects Agency). La premi&#232;re, intitul&#233;e SUMMAC, s&#8217;est d&#233;roul&#233;e de 1996 &#224; 1998 sous l&#8217;&#233;gide du
programme TIPSTER (Mani et al., 2002), et la deuxi&#232;me, intitul&#233;e DUC (Document Unders-
tanding Conferences) existe depuis 2000. &#192; notre connaissance, il n&#8217;existe pas de campagne
d&#8217;&#233;valuation sp&#233;cifique aux syst&#232;mes de r&#233;sum&#233; automatique fran&#231;ais. Ainsi, le projet G&#201;RAF
prend toute son importance.
</p>
<p>En terminant, nous esp&#233;rons avoir bien fait ressortir l&#8217;essence du projet G&#201;RAF. Alors que cer-
taines campagnes d&#8217;&#233;valuation s&#8217;apparentent plus &#224; un concours (par exemple TREC et DUC),
notre projet a pour vocation premi&#232;re de construire et de mettre &#224; la disposition des chercheurs
des ressources pour l&#8217;&#233;valuation des syst&#232;mes de r&#233;sum&#233; automatique fran&#231;ais. De plus, nous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Jos&#233;e Goulet, Jo&#235;l Bourgeoys
</p>
<p>souhaitons que le projet G&#201;RAF soit le d&#233;but d&#8217;une suite de discussions fructueuses sur l&#8217;&#233;va-
luation des syst&#232;mes de r&#233;sum&#233; automatique fran&#231;ais, mais aussi sur l&#8217;&#233;valuation des outils de
TAL en g&#233;n&#233;ral.
</p>
<p>Remerciements
</p>
<p>Nous remercions le Conseil de recherches en sciences humaines du Canada ainsi que le Fonds
qu&#233;b&#233;cois de recherche sur la soci&#233;t&#233; et la culture pour leur soutien financier dans le cadre de
nos recherches doctorales.
</p>
<p>R&#233;f&#233;rences
CRISPINO G. (2003), Une plate-forme informatique de l&#8217;Exploration Contextuelle : mod&#233;lisation, archi-
tecture et r&#233;alisation (ContextO). Application au filtrage s&#233;mantique de textes, Th&#232;se de doctorat, Paris,
Paris IV-Sorbonne.
EDMUNDSON H. P. (1969), New Methods in Automatic Abstracting, Journal of the Association for
Computing Machinery, Vol. 16(2), 264-285.
GOULET M.-J. (2003), Evaluation Methods for French Automatic Summaries, communication pr&#233;sent&#233;e
au 38th Linguistics Colloquium, Piliscsaba, Hongrie. Actes &#224; para&#238;tre.
JING H., BARZILAY R., MCKEOWN K., ELHADAD M. (1998), Summarization Evaluation Methods :
Experiments and Analysis,Working Notes of the Workshop on Intelligent Text Summarization, California,
60-68.
KLAVANS J. L., MCKEOWN K. R., KAN M.-Y., LEE S. (1998), Resources for Evaluation of Summa-
rization Techniques, Actes du First International Conference on Language Resources and Evaluation,
Granada, Espagne.
KUPIEC J., PEDERSEN J., CHEN F. (1995), A Trainable Document Summarizer, Actes de SIGIR 95
(Special Interest Group on Information Retrieval), Seattle, 68-73.
MANI I., KLEIN G., HOUSE D., HIRSCHMAN L., FIRMIN T., SUNDHEIM B. (2002), SUMMAC : A
Text Summarization Evaluation, Natural Language Engineering, Vol. 8(1), 43-68.
MANI I., MAYBURY M. T. (1999), Advances in Automatic Text Summarization, Cambridge, Massachu-
setts, MIT Press.
MINEL J.-L. (2002), Filtrage s&#233;mantique : du r&#233;sum&#233; automatique &#224; la fouille de textes, Paris, Lavoisier.
MINEL J.-L., NUGIER S., PIAT G. (1997), How to Appreciate the Quality of Automatic Text Summari-
zation ? Examples of FAN and MLUCE Protocols and their Results on SERAPHIN, Actes du Workshop
on Intelligent Scalable Text Summarization, EACL, Madrid, 25-31.
NANBA H., OKUMURA M. (2000), Producing More Readable Extracts by Revising them, Actes du 18th
International Conference on Computational Linguistics, Saarbrucker, 1071-1075.
RATH G. J., RESNICK A., SAVAGE T. R. (1961), The Formation of Abstracts by the Selection of Sen-
tences, American Documentation, Vol. 12(2), 139-143.
SPARCK JONES K. (1999), Automatic Summarization : Factors and Directions, In I. Mani et M. T.
Maybury (eds.) Advances in Automatic Text Summarization, Cambridge, Massachusetts, MIT Press, 1-
12.
TEUFEL S., MOENS M. (1997), Sentence Extraction as a Classification Task, Actes du Workshop on
Intelligent Scalable Text Summarization, EACL, Madrid, 58-65.</p>

</div></div>
</body></html>