<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Syst&#232;me d&#8217;aide &#224; l&#8217;acc&#232;s lexical : trouver le mot qu&#8217;on a sur le bout de la langue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me d&#8217;aide &#224; l&#8217;acc&#232;s lexical : trouver le mot qu&#8217;on a sur le 
bout de la langue 
</p>
<p>Lortal G., Grau B. et Zock M.  
LIMSI-CNRS &#8211; Universit&#233; Paris XI 
</p>
<p>BP 133 91403 Orsay 
gaelle.lortal@utt.fr, brigitte.grau@limsi.fr, zock@limsi.fr 
</p>
<p>R&#233;sum&#233; - Abstract 
Le Mot sur le Bout de la Langue (Tip Of the Tongue en anglais), ph&#233;nom&#232;ne tr&#232;s &#233;tudi&#233; 
par les psycholinguistes, nous a amen&#233; nombre d&#8217;informations concernant l&#8217;organisation 
du lexique mental. Un locuteur en &#233;tat de TOT reconna&#238;t instantan&#233;ment le mot recherch&#233; 
pr&#233;sent&#233; dans une liste. Il en conna&#238;t le sens, la forme, les liens avec d&#8217;autres mots... 
Nous pr&#233;sentons ici une &#233;tude de d&#233;veloppement d&#8217;outil qui prend en compte ces 
sp&#233;cificit&#233;s, pour assister un locuteur/r&#233;dacteur &#224; trouver le mot qu&#8217;il a sur le bout de la 
langue. Elle consiste &#224; recr&#233;er le ph&#233;nom&#232;ne du TOT, o&#249;, dans un contexte de production 
un mot, connu par le syst&#232;me, est momentan&#233;ment inaccessible. L&#8217;acc&#232;s au mot se fait 
progressivement gr&#226;ce aux informations provenant de bases de donn&#233;es linguistiques. Ces 
derni&#232;res sont essentiellement des relations de type paradigmatique et syntagmatique. 
Il s&#8217;av&#232;re qu&#8217;un outil, tel que SVETLAN, capable de structurer automatiquement un 
dictionnaire par domaine, peut &#234;tre avantageusement combin&#233; &#224; une base de donn&#233;es 
riche en liens paradigmatiques comme EuroWordNet, augmentant consid&#233;rablement les 
chances de trouver le mot auquel on ne peut acc&#233;der. 
</p>
<p>The study of the Tip of the Tongue phenomenon (TOT) provides valuable clues and 
insights concerning the organisation of the mental lexicon (meaning, number of syllables, 
relation with other words, etc.). This paper describes a tool based on psycho-linguistic 
observations concerning the TOT phenomenon. We&#8217;ve built it to enable a speaker/writer 
to find the word he is looking for, word he may know, but which he is unable to access in 
time. 
We try to simulate the TOT phenomenon by creating a situation where the system knows 
the target word, yet is unable to access it. In order to find the target word we make use of 
the paradigmatic and syntagmatic associations stored in the linguistic databases. 
Our experiment allows the following conclusion: a tool like SVETLAN, capable to 
structure (automatically) a dictionary by domains can be used sucessfully to help the 
speaker/writer to find the word he is looking for, if it is combined with a database rich in 
terms of paradigmatic links like EuroWordNet. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
MBL, acc&#232;s lexical, relations s&#233;mantiques, associations, SVETLAN, EWN 
TOT, word access, semantic relations, associations, SVETLAN, EWN </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lortal G., Grau B. et Zock M. 
</p>
<p>1 Introduction 
Qui ne s&#8217;est pas encore trouv&#233; dans cette situation frustrante &#224; chercher un mot qu&#8217;il 
conna&#238;t, sans &#234;tre en mesure de trouver sa forme pour autant ? Le mot &#233;tant connu, il est 
donc disponible, mais n&#8217;arrivant pas &#224; y acc&#233;der, il vous reste coll&#233; sur le bout de la 
langue ? Ce ph&#233;nom&#232;ne observ&#233; depuis l&#8217;antiquit&#233; (Aristote en parle d&#233;j&#224;) a &#233;t&#233; &#233;tudi&#233; 
maintes fois par des psychologues (Brown &amp; Mc Neill, 1966, Aitchinson 1997). Ces 
travaux r&#233;v&#232;lent que les personnes se trouvant dans cet &#233;tat savent non seulement 
&#233;norm&#233;ment de choses concernant le mot recherch&#233; (mot cible) (Brown 1991)&#8212; origine, 
tout ou partie de son sens, nombre de syllabes, lien avec des mots associ&#233;s, etc.&#8212; mais 
les mots avec lesquels ils le confondent (mots sources) ressemblent &#233;trangement au mot 
cible : lettres ou initiale, cat&#233;gorie syntaxique, champ s&#233;mantique, etc. L&#8217;&#233;tat de TOT 
n&#8217;est pas l&#8217;oubli d&#8217;un mot. On ne perd pas l&#8217;information en m&#233;moire. Le TOT n&#8217;est qu&#8217;un 
exemple d&#8217;&#233;chec de r&#233;cup&#233;ration d&#8217;information en m&#233;moire. L&#8217;information est disponible 
sans &#234;tre accessible &#224; un moment donn&#233;. 
</p>
<p>Nous pr&#233;senterons ici les premiers r&#233;sultats d&#8217;un travail dont l&#8217;objectif est de r&#233;aliser un 
programme tirant b&#233;n&#233;fice de cet &#233;tat de faits pour assister un locuteur (ou r&#233;dacteur) &#224; 
(re)trouver le mot que celui-ci a sur le bout de la langue. Autrement dit, notre objectif est 
de cr&#233;er, &#224; terme, un dictionnaire analogue &#224; celui de l&#8217;&#234;tre humain (r&#233;seau associatif, 
dont chaque terme est index&#233; de mani&#232;re multiple) 1. Un tel dictionnaire permettrait donc 
l&#8217;acc&#232;s &#224; l&#8217;information recherch&#233;e soit par la forme (lexicale : analyse), soit par le 
sens (concepts : production), soit par les deux, simultan&#233;ment, ou l&#8217;un apr&#232;s l&#8217;autre 2. 
</p>
<p>Notre point de d&#233;part est identique &#224; celui de Zock (2002, 2004) et Zock et Fournier, 
(2001) qui, pour trouver le mot recherch&#233;, s&#8217;appuient sur la notion de stockage bi-modal 
(forme et sens), id&#233;e fond&#233;e sur l&#8217;analyse des erreurs de discours spontan&#233; (Fromkin, 
1973). A l&#8217;instar des &#234;tres humains, l&#8217;acc&#232;s par la forme peut se faire de deux fa&#231;ons, par 
la graphie ou le son. L&#8217;acc&#232;s par le sens se fonde en grande partie sur la notion 
d&#8217;associations. Le dictionnaire mental &#233;tant un hyper-r&#233;seau dont les noeuds 
correspondent aux mots et les liens &#224; des associations, trouver un mot dans ce r&#233;seau 
consiste alors &#224; entrer &#224; n&#8217;importe quel point, puis &#224; suivre les liens. Cela suppose 
n&#233;anmoins qu&#8217;un tel r&#233;seau associationniste soit construit au pr&#233;alable. Id&#233;alement, on 
s&#8217;appuierait donc sur un inventaire exhaustif de liens entre les mots (liens associatifs), 
liens qui seraient pond&#233;r&#233;s par la force associative (fr&#233;quence relative des couples de 
mots). Voil&#224; l&#8217;objectif de ce travail : identifier un mot manquant au sein d&#8217;un texte 
(corpus), selon sa place dans la phrase et des points d&#8217;entr&#233;e dans le r&#233;seau (les diff&#233;rents 
types d&#8217;acc&#232;s cit&#233;s ci-dessus). Disposant actuellement de deux ressources s&#233;mantiques de 
nature tr&#232;s diff&#233;rente, SVETLAN (Chalendar et Grau, 2002) et EuroWordNet (EWN, 
Vossen, 1999), nous verrons si leurs points d&#8217;entr&#233;e sont suffisants pour atteindre notre 
objectif. 
                                                 
1
  Pour &#234;tre plus pr&#233;cis il ne s&#8217;agit pas de cr&#233;er un dictionnaire de toute pi&#232;ce, il s&#8217;agit plut&#244;t d&#8217;enrichir une 
</p>
<p>base de donn&#233;es existante (TLF, WordNet) avec des liens typiques pointant d&#8217;un mot aux autres 
fr&#233;quemment associ&#233;s. 
</p>
<p>2
  Il arrive qu&#8217;on ne trouve pas d&#8217;embl&#233;e le bon candidat, auquel cas on part d&#8217;un mot raisonnablement 
</p>
<p>proche (synonyme, hyperonyme, antonyme), esp&#233;rant par ce biais de se rapprocher du mot cible. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me d&#8217;aide &#224; l&#8217;acc&#232;s lexical : trouver le mot qu&#8217;on a sur le bout de la langue 
</p>
<p>2 Les relations s&#233;mantiques et lexicales 
2.1 Les relations dans le cadre du TOT 
</p>
<p>L&#8217;&#233;tude du TOT montre qu&#8217;il existe des relations de diff&#233;rents niveaux : phon&#233;tique, 
graph&#233;mique, s&#233;mantique. Un locuteur en train de chercher un mot fait donc appel &#224; 
diff&#233;rents types de m&#233;moires, &#224; diff&#233;rents syst&#232;mes interconnect&#233;s (Le Rouzo et Joubert, 
2001). La m&#233;moire verbale est compos&#233;e de la m&#233;moire s&#233;mantique et de la m&#233;moire 
lexicale ; cette derni&#232;re contient des mots. 
</p>
<p>La m&#233;moire s&#233;mantique contient des concepts, le sens des mots et des symboles. La 
r&#233;cup&#233;ration du signifi&#233; se ferait alors par un mot ayant un sens proche du mot cible, en 
suivant des relations paradigmatiques. La m&#233;moire lexicale concerne la forme des mots, 
leur graphie ou leur prononciation. La r&#233;cup&#233;ration du signifiant se ferait alors par des 
mots contenant des sons semblables, les m&#234;mes lettres (initiales, finales) ou encore le 
m&#234;me nombre de syllabes que le mot cible.  
</p>
<p>A l&#8217;int&#233;rieur de ces composantes de la m&#233;moire &#224; long-terme, deux types de r&#233;cup&#233;ration 
sont &#224; distinguer : le rappel et la reconnaissance. Dans le cas du rappel, l&#8217;information est 
reproduite de la m&#233;moire. La cat&#233;gorisation ou la structuration de l&#8217;information assiste le 
rappel (relations paradigmatiques du signifi&#233; par exemple ou relations sur le signifiant). 
La reconnaissance est li&#233;e &#224; la pr&#233;sentation d&#8217;un stimulus &#233;voquant une exp&#233;rience pass&#233;e 
constituant un amor&#231;age et entra&#238;nant l&#8217;utilisation de liens associatifs. 
</p>
<p>2.2 Les relations linguistiques 
</p>
<p>On peut corr&#233;ler les diff&#233;rents types de r&#233;cup&#233;ration lexicale avec les diff&#233;rents types de 
relations linguistiques ou conceptuelles. Deux grandes cat&#233;gories de relations sont 
consid&#233;r&#233;es : les relations paradigmatiques et leur pendant, les relations syntagmatiques. 
</p>
<p>x Les relations paradigmatiques 
</p>
<p>Les relations paradigmatiques sont des relations de similarit&#233; (synonymie, antonymie) et 
d&#8217;inclusion (hyponymie, m&#233;ronymie, etc.). Dans &#171; l&#8217;oiseau vole dans le ciel bleu &#187;, 
&#171; oiseau &#187; entretient un lien d&#8217;hyperonymie avec &#171; aigle &#187;, et les mots &#171; oiseau, vole, 
ciel, bleu &#187; pourraient bien &#234;tre remplac&#233;s par leurs synonymes. Ces types de relation ont 
&#233;t&#233; tr&#232;s &#233;tudi&#233;s et constituent l&#8217;essentiel de WordNet et donc de la version fran&#231;aise 
d&#8217;EuroWordNet. 
</p>
<p>x Les relations syntagmatiques 
</p>
<p>Les relations syntagmatiques sont les liens qu'une unit&#233; linguistique poss&#232;de avec d'autres 
unit&#233;s pr&#233;sentes dans un &#233;nonc&#233; (caf&#233; noir, caf&#233; du Br&#233;sil, caf&#233; fort). Elles correspondent 
aux associations, la pr&#233;sence d&#8217;un terme &#233;voquant l&#8217;autre. Ces relations permettent un 
amor&#231;age s&#233;mantique : l&#8217;acc&#232;s &#224; un mot est facilit&#233; s&#8217;il a &#233;t&#233; pr&#233;c&#233;d&#233; par un autre mot qui 
lui est s&#233;mantiquement associ&#233;.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lortal G., Grau B. et Zock M. 
</p>
<p>Ces relations varient avant tout en fonction des exp&#233;riences personnelles du locuteur. 
Mais elles varient &#233;galement en fonction du sociolecte, de l&#8217;idiolecte et m&#234;me en fonction 
du contexte (analogies, co-occurrences, collocations). Par exemple, les collocations 
indiquent un lien syntagmatique arbitraire et fig&#233;, lien perdurant dans la m&#233;moire. Ce 
type de lien a &#233;t&#233; tr&#232;s &#233;tudi&#233; dans la Th&#233;orie Sens-Texte de (Mel&#8217;cuk et al.,1995) gr&#226;ce &#224; 
la notion de fonction lexicale. Une fonction lexicale (FL) exprime le fait que le choix 
d&#8217;un mot X d&#233;pend non seulement de son sens (comme on pourrait l&#8217;attendre), mais aussi 
d&#8217;autres mots auxquels il est typiquement associ&#233;. Prenons le domaine des sentiments. 
Dans &#171; col&#232;re noire &#187; le mot &#171; noire &#187; n&#8217;exprime pas la notion de couleur, mais celle 
d&#8217;intensit&#233; forte, tandis qu&#8217;en cas de &#171; peur &#187; les mots convenables seraient &#171; bleue &#187; , 
&#171; grande&#187; ou &#171; tr&#232;s&#187;, puisqu&#8217;on dit &#171; peur bleue &#187;, &#171; grande peur&#187;, &#171; tr&#232;s peur&#187;, et non 
&#171; forte peur &#187;. 
</p>
<p>Cette br&#232;ve incursion dans le domaine du TOT r&#233;v&#232;le que le probl&#232;me en question est 
soluble en ayant recours &#224; des liens formels (phonologique et graphique) et s&#233;mantiques. 
Comme indiqu&#233;, nous disposons de deux types de liens, des liens explicites pour les liens 
paradigmatiques dans le cas d&#8217;EWN (Vossen, 1999) et implicites dans les domaines de 
SVETLAN pour les liens syntagmatiques. Pour des raisons d&#8217;espace nous ne 
pr&#233;senterons ici que ce dernier. 
</p>
<p>3 L&#8217;acc&#232;s lexical contextualis&#233; 
3.1 Les bases de connaissances 
</p>
<p>SVETLAN (De Chalendar et Grau, 2001) permet d&#8217;acqu&#233;rir automatiquement des classes 
de noms par domaines s&#233;mantico-pragmatiques &#224; partir de textes. Les domaines sont 
form&#233;s par l&#8217;agr&#233;gation de segments de textes similaires, segments obtenus par une 
analyse th&#233;matique (Ferret et Grau, 1998). Ils sont compos&#233;s d&#8217;un ensemble de mots 
(noms simples et compos&#233;s, verbes et adjectifs) poss&#233;dant un poids qui repr&#233;sente leur 
degr&#233; d&#8217;importance pour le sujet d&#233;crit. Par application d&#8217;une analyse distributionnelle 
sur l&#8217;ensemble des segments de textes li&#233;s aux domaines, SVETLAN regroupe des mots 
jouant le m&#234;me r&#244;le syntaxique par rapport &#224; un m&#234;me verbe, o&#249; seuls les mots les plus 
pertinents pour d&#233;crire le domaine sont retenus. On obtient ainsi des domaines d&#233;crits par 
des ensembles de mots, mais aussi par des ensembles de structures &#171; verbe, relation, 
classe de noms &#187;. Une base de connaissance a &#233;t&#233; construite &#224; partir d&#8217;un corpus 
d&#8217;articles de l&#8217;AFP d&#8217;environ 6000 d&#233;p&#234;ches d&#233;coup&#233;es en 8000 segments th&#233;matiques et 
qui contient 1531 domaines. Pour le pr&#233;sent article, nous appellerons domaine l&#8217;ensemble 
des mots pr&#233;sents dans les structures d&#8217;un domaine. 
</p>
<p>Les informations produites par SVETLAN sont des donn&#233;es lexicales organis&#233;es 
conceptuellement, mais &#233;galement index&#233;es grammaticalement, puisque les noms sont 
li&#233;s aux verbes par des liens &quot;Sujet&quot;, &quot;COD&quot; ou &quot;Pr&#233;position&quot; (&#224;, sur, de, etc.). On a ainsi 
une approche phras&#233;ologique, une extension syntagmatique du terme &#224; la phrase, gr&#226;ce &#224; 
la conservation des liens syntaxiques entre les noms et les verbes. 
</p>
<p>Les connaissances de SVETLAN ressemblent aux informations syntagmatiques et 
syntaxiques que poss&#232;de un locuteur concernant un lemme. Ces ressources </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me d&#8217;aide &#224; l&#8217;acc&#232;s lexical : trouver le mot qu&#8217;on a sur le bout de la langue 
</p>
<p>terminologiques sont toutefois limit&#233;es dans SVETLAN, mais elles sont extensibles de 
plusieurs fa&#231;ons, notamment par EWN. 
</p>
<p>EWN serait le pendant paradigmatique des informations concernant un lemme dans 
l&#8217;esprit d&#8217;un locuteur. Il comporte environ 32800 variants et pour chacun, au moins un 
lien paradigmatique vers un autre lemme. 
</p>
<p>3.2 Conception de l&#8217;exp&#233;rimentation 
</p>
<p>Les diff&#233;rents types d&#8217;informations dont nous disposons repr&#233;sentent des donn&#233;es 
lexicales, stock&#233;es durablement en m&#233;moire chez un locuteur. Cependant, lorsque l&#8217;on 
produit du langage, le choix d&#8217;un mot d&#233;pend du contexte phrastique. 
</p>
<p>Notre m&#233;thode consiste &#224; utiliser des textes &#224; trous (un article AFP avec 10 mots extraits) 
pour observer l&#8217;acc&#232;s &#224; un mot absent dans un (con)texte. L&#8217;ensemble du texte pr&#233;c&#233;dant 
et suivant le mot manquant est conserv&#233; sous forme lemmatis&#233;e (conservation des mots 
pleins uniquement). On obtient ainsi un environnement symbolisant la parole d&#8217;un 
locuteur dans un contexte, les mots manquants symbolisant le ph&#233;nom&#232;ne de TOT, les 
mots que l&#8217;on recherche. Afin d&#8217;&#233;valuer la capacit&#233; de r&#233;cup&#233;ration des mots gr&#226;ce &#224; nos 
ressources, nous quantifierons nos r&#233;sultats par les mesures du rappel et de la pr&#233;cision : 
</p>
<p>))(_)((
</p>
<p>))(_)((
</p>
<p>srecherch&#233;smot
</p>
<p>strouv&#233;smot
</p>
<p>&#166;
&#166;     
</p>
<p>)_)(_)((
</p>
<p>))(_)((
</p>
<p>totalsrenvoy&#233;smot
</p>
<p>strouv&#233;smot
</p>
<p>&#166;
&#166;  
</p>
<p>Les ensembles de mots retrouv&#233;s par le syst&#232;me sont susceptibles d&#8217;&#234;tre propos&#233;s au 
locuteur afin qu&#8217;il puisse y trouver le mot recherch&#233;. 
</p>
<p>3.3 &#201;tude des liens non typ&#233;s 
On souhaite pouvoir identifier les informations pertinentes pour l&#8217;acc&#232;s lexical au niveau 
des relations principalement. En effet, il s&#8217;agit d&#8217;observer dans quelle mesure il est 
important de typer les liens pour permettre l&#8217;acc&#232;s &#224; un mot. Les liens th&#233;matiques 
(syntagmatiques) et syntaxiques de SVETLAN suffisent-ils ? Une combinaison de liens 
syntagmatiques non typ&#233;s avec des liens paradigmatiques typ&#233;s comme ceux dont on 
dispose dans EWN am&#232;nent-ils un meilleur r&#233;sultat ? Serait-ce profitable d&#8217;avoir un 
typage de tous ces liens (type Dictionnaire Explicatif et Combinatoire) ? 
</p>
<p>Notre application (cf. Fig.1) utilise les ressources mentionn&#233;es. Elle simule un locuteur 
(article AFP) se trouvant dans un &#233;tat de TOT. Nous repr&#233;sentons ceci par les lemmes de 
ses mots pleins dans &#171; Liste Contexte &#187; et par le fait que plusieurs mots ont &#233;t&#233; &#244;t&#233;s du 
texte original (10 mots sont absents de son discours, voir Liste TOT). C&#8217;est en suivant les 
liens propos&#233;s par nos ressources (SVETLAN, EWN) que le locuteur est cens&#233; acc&#233;der 
au mot recherch&#233; (Liste TOT r&#233;solu). 
</p>
<p>En premier lieu, nous avons &#233;tudi&#233; l&#8217;acc&#232;s simplement par liens associatifs &#224; l&#8217;aide de la 
base SVETLAN (cf. fl&#233;chage 1, Fig.1). Cela consiste &#224; mettre en correspondance les 
lemmes de la &#171; Liste Contexte &#187; avec les informations lexicales (Noms et Verbes) de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lortal G., Grau B. et Zock M. 
</p>
<p>SVETLAN. Cette mise en correspondance permet de s&#233;lectionner les domaines o&#249; au 
moins 75% des mots du texte sont pr&#233;sents. Il suffit ensuite de constater la pr&#233;sence ou 
l&#8217;absence de nos mots manquants dans les domaines s&#233;lectionn&#233;s (&#171; Liste TOT r&#233;solu &#187;). 
</p>
<p> 
</p>
<p>Figure 1. M&#233;thode de r&#233;solution de TOT par liens syntagmatiques non typ&#233;s et liens 
paradigmatiques typ&#233;s &#224; l&#8217;int&#233;rieur de structures 
</p>
<p>3.4 Apport des liens typ&#233;s 
</p>
<p>La m&#233;thode pr&#233;c&#233;dente est raffin&#233;e, permettant en plus d&#8217;une recherche par des liens 
strictement associatifs, de prendre en compte les liens paradigmatiques des mots d&#8217;un 
domaine th&#233;matique en utilisant la base de donn&#233;es EWN (cf. fl&#233;chage 2, Fig.1). La 
d&#233;marche est identique &#224; la pr&#233;c&#233;dente. Les mots des structures contenant au moins un 
mot du texte sont ensuite reli&#233;s aux variants d&#8217;EWN. On observe la pr&#233;sence des mots de 
la &#171; Liste TOT &#187; soit dans les domaines s&#233;lectionn&#233;s soit dans les mots reli&#233;s aux variants 
d&#8217;EWN correspondant &#224; des mots d&#8217;un domaine s&#233;lectionn&#233;. 
</p>
<p>Il est possible d&#8217;effectuer une restriction contextuelle pour am&#233;liorer la pr&#233;cision, en 
d&#233;coupant le texte en segments th&#233;matiques (STi dans Table 1). Moins de mots sont alors 
fournis au syst&#232;me, permettant de ce fait de baisser le bruit et d&#8217;am&#233;liorer la pr&#233;cision. Le 
rappel n&#8217;est pas touch&#233; par ces restrictions. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me d&#8217;aide &#224; l&#8217;acc&#232;s lexical : trouver le mot qu&#8217;on a sur le bout de la langue 
</p>
<p>4 R&#233;sultats 
4.1 Pr&#233;sentation des r&#233;sultats 
</p>
<p>L&#8217;exp&#233;rience d&#233;crite a &#233;t&#233; men&#233;e sur 4 textes de 225 mots en moyenne. Dans chacun de 
ces textes 10 mots ont &#233;t&#233; retir&#233;s. Nous avons choisi de retirer des noms et des verbes, car 
nos bases de connaissances contiennent essentiellement ces cat&#233;gories lexicales. Outre 
des mots li&#233;s au contexte du texte (cf. Tab.1, militaire, partisan, enfreindre), des mots tr&#232;s 
g&#233;n&#233;raux (cf. Tab.1, lundi, &#233;tudier, repr&#233;senter) sont extraits. 
</p>
<p>Les tests effectu&#233;s sur SVETLAN et EWN seuls offrent un rappel de respectivement 
72,5% et 70 % en moyenne pour les 4 textes. La combinaison des deux ressources permet 
d&#8217;amener ce rappel &#224; 92,5%. Les r&#233;sultats pr&#233;sent&#233;s ici correspondent au d&#233;tail de l&#8217;un 
d&#8217;eux (Irak), qui est repr&#233;sentatif de l&#8217;ensemble. 
</p>
<p>Selon le segment th&#233;matique du texte utilis&#233; en tant que contexte, le nombre de domaines 
pris en compte pour le rappel des 10 mots est de 3 (pour un rappel de 7/10) &#224; 7 (pour un 
rappel de 9/10). 
</p>
<p>Les domaines poss&#233;dant 329 &#224; 1709 mots pour 7 &#224; 9 mots retrouv&#233;s, la pr&#233;cision est 
faible. Si l&#8217;on prend en compte la restriction par segment th&#233;matique, on constate que le 
segment th&#233;matique 3 apporte en g&#233;n&#233;ral le rappel et la pr&#233;cision les plus importants. 
Cependant, le segment 1, repr&#233;sentant une introduction &#224; l&#8217;article a une tr&#232;s bonne 
pr&#233;cision. 
</p>
<p>Au vu des r&#233;sultats avec une restriction sur SVETLAN (cf. Tab.1), au niveau des 
structures, on constate que la pr&#233;cision est largement am&#233;lior&#233;e, puisque l&#8217;indice 
augmente en moyenne de 0.004 soit environ 266% sur l&#8217;ensemble des structures 
th&#233;matiques. En effet, on ne conserve que l&#8217;information pertinente proche. 
</p>
<p>4.2 Discussion des r&#233;sultats 
</p>
<p>Cependant, malgr&#233; ces r&#233;sultats encourageants, la pr&#233;cision est encore tr&#232;s faible puisque 
celle-ci repr&#233;sente la liste de mots dans laquelle le locuteur choisit le mot appropri&#233;. C&#8217;est 
&#224; dire que celui-ci doit retrouver dans une liste d&#8217;environ 8000 mots (dans le cas d&#8217;Irak 
ou en moyenne 1600 mots par ST) li&#233;s &#224; un nombre variable de mots dans EWN, les 10 
qui lui manquent (alors que tous ne seront pas forc&#233;ment disponibles). C&#8217;est alors que 
l&#8217;on peut combiner les diff&#233;rents types d&#8217;acc&#232;s et s&#233;lectionner dans la liste des mots 
associ&#233;s ceux de la cat&#233;gorie lexicale cherch&#233;e, d&#8217;une position donn&#233;e dans la phrase 
(COD du verbe, sujet) ou encore des mots qui ressemblent phon&#233;tiquement &#224; d&#8217;autres.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lortal G., Grau B. et Zock M. 
</p>
<p> 
</p>
<p>     ST1 ST2 ST3 ST4 ST5 
</p>
<p>1. force + + + + + 
</p>
<p>2. lundi + + + + + 
</p>
<p>3. amende - + + + + 
</p>
<p>4. militaire + + + + + 
</p>
<p>5. partisan - + + - + 
</p>
<p>6. &#233;tudier + + + + + 
</p>
<p>7. repr&#233;senter + + + + + 
</p>
<p>8. lancer + + + + + 
</p>
<p>9. confirmer + + + + + 
</p>
<p> 
</p>
<p> 
</p>
<p>Mots 
</p>
<p> 
</p>
<p>T 
</p>
<p>r 
</p>
<p>o 
</p>
<p>u 
</p>
<p>v 
</p>
<p>&#233; 
s 
</p>
<p>10. enfreindre - - - - - 
</p>
<p>Nom du domaine Nbre 
mots du 
domaine
</p>
<p>Nbre mots avec 
structures seules 
+ r&#233;duction du 
bruit 
</p>
<p>Domaines s&#233;lectionn&#233;s par segment 
</p>
<p>ApprendreDemander 1015 386 62%  +  + + 
</p>
<p>CommanderPoursuivre 1709 1599 7,5% + + + + + 
</p>
<p>DonnerObtenir 956 212 78%   +  + 
</p>
<p>&#201;lireEffectuer 582 127 78%  +    
</p>
<p>FuirContr&#244;ler 329 31 90,5% +     
</p>
<p>MaintenirDemander 810 117 85,5%     + 
</p>
<p>Pr&#233;voirAtteindre 1017 112 89%     + 
</p>
<p>Pr&#233;voirReprendre 1247 710 43%  + + +  
</p>
<p>TuerPrendre 925 405 56%  + +  + 
</p>
<p>Domaines 
</p>
<p>s&#233;lectionn&#233;s 
</p>
<p>TuerTrouver 1309 862 34% + + + + + 
</p>
<p>Tableau 1. R&#233;sultats Occurrences de mots trouv&#233;s par SVETLAN+EWN dans STis(Irak) 
</p>
<p>Afin d&#8217;illustrer l&#8217;efficacit&#233; d&#8217;une amorce de type phonologique, nous avons interrog&#233; 
notre base de connaissances avec les exemples suivants, sans restriction pr&#233;alable par </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me d&#8217;aide &#224; l&#8217;acc&#232;s lexical : trouver le mot qu&#8217;on a sur le bout de la langue 
</p>
<p>domaine. Si la phrase &#171; l&#8217;Etat a ?TOT ? la loi &#187; et que seul le mot &#171; aboli &#187; vient &#224; 
l&#8217;esprit, il est possible de faire une mise en correspondance entre le contexte de la phrase, 
soit &#171; loi &#187; et les verbes proches de &#171; abolir &#187; phonologiquement (abaisser, abandonner, 
abasourdir, ab&#226;tardir, abattre, abc&#233;der, abdiquer, ab&#234;tir, etc.). Le syst&#232;me trouve dans 
SVETLAN la cooccurrence &#171; abroger une loi &#187; et sera capable de proposer &#171; abroger &#187; 
pour r&#233;soudre le probl&#232;me du TOT. Si l&#8217;on part d&#8217;un lapsus : &#171; m&#233;priser la situation &#187;, le 
syst&#232;me proposera alors &#171; mettre &#187; ou &#171; ma&#238;triser &#187;, mais il pourra &#233;galement faire un 
choix par rapport &#224; la fonction syntaxique du groupe &#171; situation &#187; (ici &#171; lien = cod &#187;). La 
base SVETLAN comportant : (1) &#171; mettre &#187; + &#171; lien = dans &#187; + &#171; situation &#187; et (2) 
&#171; ma&#238;triser &#187; + &#171; lien = cod &#187; + &#171; situation &#187;, on retiendra la seconde solution. 
</p>
<p>5 Conclusion 
Cette premi&#232;re exp&#233;rimentation montre que l&#8217;ensemble des relations construites 
automatiquement est utilisable pour acc&#233;der &#224; un mot &#224; partir de mots proches. La 
m&#233;thode utilis&#233;e pour construire en contexte des classes de noms associ&#233;es 
syntaxiquement &#224; des verbes permet de restreindre ces classes par domaine, mais aussi de 
les utiliser hors de restriction pr&#233;alable par domaine. Les classes form&#233;es sont constitu&#233;es 
de mots s&#233;mantiquement proches ayant des relations diverses telles que synonymie ou 
hyperonymie. La conservation de la relation syntaxique fournit un crit&#232;re de s&#233;lection 
suppl&#233;mentaire. 
</p>
<p>L&#8217;extension des classes par EWN s&#8217;est r&#233;v&#233;l&#233;e productive montrant la compatibilit&#233; et la 
compl&#233;mentarit&#233; des deux bases de connaissances. En effet, EWN ne disposant pas de 
relations syntagmatiques, il est souvent impuissant pour trouver le mot manquant. 
On notera que ces tests sont effectu&#233;s avec des bases et des corpus de petites tailles ; on 
pourrait pr&#233;voir plusieurs types d&#8217;extension. Tout d&#8217;abord une extension de la base de 
domaines SVETLAN, o&#249; l&#8217;on fournirait d&#8217;autres corpus &#224; traiter afin d&#8217;augmenter le 
nombre et la diversit&#233; des domaines disponibles. Parall&#232;lement, on pourrait augmenter et 
pr&#233;ciser les liens paradigmatiques en utilisant des ontologies. Une extension 
suppl&#233;mentaire pourrait &#234;tre le typage des relations gr&#226;ce au DEC.  
Cette ressource pourrait faire partie d&#8217;un syst&#232;me plus important ou tout simplement &#234;tre 
l&#8217;extension d&#8217;un dictionnaire &#233;lectronique existant (TLF, WordNet). 
</p>
<p>Quoi qu&#8217;il en soit, il semblerait qu&#8217;une ressource comme SVETLAN pourrait &#234;tre un 
&#233;l&#233;ment n&#233;cessaire pour construire une application s&#233;mantique bas&#233;e sur l&#8217;association et 
destin&#233;e &#224; aider un &#234;tre humain &#224; trouver le mot qu&#8217;il a sur le bout de la langue. 
</p>
<p>6 R&#233;f&#233;rences 
AITCHINSON J. (1987), Words in the Mind: an Introduction to the Mental Lexicon, 
Oxford, Blackwell. 
</p>
<p>ARISTOTE (350 avant JC), De memoria et reminiscentia. In Parva Naturalia, Vrin 
</p>
<p>BROWN R., MCNEILL D. (1966), The &#8216;tip of the tongue&#8217; phenomenon, Journal of Verbal 
Learning and Verbal Behavior 5, 325-337. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lortal G., Grau B. et Zock M. 
</p>
<p>BROWN A.S (1991), The tip of the tongue experience A review and evaluation. 
Psychological Bulletin, 10, 204-223 
</p>
<p>CHALENDAR G (De), GRAU B. (2002), Structuration de domaines s&#233;mantiques, IC 2002. 
</p>
<p>FERRET O., GRAU B. (1998), A thematic segmentation procedure for extracting semantic 
domains from texts. In proceedings of the European Conference on Artificial Intelligence 
ECAI'98, Brighton.  
</p>
<p>FROMKIN V. (1973), (Ed.) Speech errors as linguistic evidence. The Hague: Mouton 
Publishers 
</p>
<p>LE ROUZO M.L., JOUBERT A (2001), Le mot sur le bout de la langue chez les adultes 
jeunes et &#226;g&#233;s, Champ Psychosomatique, n&#176;24, 113-129 
MEL'CUK I., CLAS A., POLGUERE A. (1995), Introduction &#224; la lexicologie explicative et 
combinatoire, Louvain-la-Neuve: Duculot, 1995, 256 pages. 
</p>
<p>MILLER G.A., ed. (1990), WordNet: An On-Line Lexical Database. International Journal 
of Lexicography, 3(4).  
VOSSEN P., (1999) EuroWordNet Final Report, University of Amsterdam,Version 2 
http://www.illc.uva.nl/EuroWordNet 
</p>
<p>ZOCK M., FOURNIER J-P. (2001), How can computers help the writer/speaker 
experiencing the Tip of the Tongue Problem?, Proc. of RANLP, Tzigov Chark, Bulgarie, 
pp. 300-302 
</p>
<p>ZOCK M. (2002), Sorry, what was your name again, or how to overcome the tip-of-the 
tongue problem with the help of a computer?, SemaNet workshop (Building and Using 
Semantic Networks), Coling, Taipei 
</p>
<p>ZOCK M. (2004), Word lookup as an ongoing dialogue between a user and a lexicon, 
Proceedings of the &#171; 10th Annual Meeting of the Association for Natural Language 
Processing &#187;, Tokyo </p>

</div></div>
</body></html>