<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>De l&#8217;&#233;crit &#224; l&#8217;oral : analyses et g&#233;n&#233;rations</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2004, F&#232;s, 19-21 avril 2004 
</p>
<p>De l&#8217;&#233;crit &#224; l&#8217;oral : analyses et g&#233;n&#233;rations 
</p>
<p>Fabrice Maurel 
</p>
<p>IRIT &#8211; Universit&#233; Paul Sabatier 
118, route de Narbonne 31062 Toulouse - France 
</p>
<p>fmaurel@irit.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Longtemps consid&#233;r&#233;e comme ornementale, la structure informationnelle des documents 
&#233;crits prise en charge par la morpho-disposition devient un objet d&#8217;&#233;tude &#224; part enti&#232;re dans 
diverses disciplines telles que la linguistique, la psycholinguistique ou l&#8217;informatique. En 
particulier, nous nous int&#233;ressons &#224; l&#8217;utilit&#233; de cette dimension et, le cas &#233;ch&#233;ant, son 
utilisabilit&#233;, dans le cadre de la transposition automatique &#224; l&#8217;oral des textes. Dans l&#8217;objectif 
de fournir des solutions qui permettent de r&#233;agir efficacement &#224; cette &#171; inscription 
morphologique &#187;, nous proposons la synoptique d&#8217;un syst&#232;me d&#8217;oralisation. Nous avons 
mod&#233;lis&#233; et partiellement r&#233;alis&#233; le module sp&#233;cifique aux strat&#233;gies d&#8217;oralisation, afin de 
rendre &#171; articulables &#187; certaines parties signifiantes des textes souvent &#171; oubli&#233;es &#187; par les 
syst&#232;mes de synth&#232;se. Les premiers r&#233;sultats de cette &#233;tude ont conduit &#224; des sp&#233;cifications en 
cours d&#8217;int&#233;gration par un partenaire industriel. Les perspectives de ce travail peuvent 
int&#233;resser la communaut&#233; TAL en reconnaissance de la parole, en g&#233;n&#233;ration/r&#233;sum&#233; de texte 
ou en multimodalit&#233;. 
</p>
<p>Considered for a long time as ornamental, the informational structure of written documents 
carried by texts morpho-disposition becomes a full object of investigation in various 
disciplines such as linguistic, psycholinguistic or computer sciences. In Particular, we are 
interested in the utility of these aspects of documents and, if the need arises, their usability, 
within the framework of their oral transposition. In the objective to provide solutions which 
make it possible to react effectively to this &#8220;morphological inscription&#8221;, we propose the 
synoptic of an oralisation system. We modelled and partially realized the module specific to 
the oralisation strategies, in order to render some signifying parts of the text often &#8220;forgotten&#8221; 
by synthesis systems. The first results of this study led to specifications in the course of 
integration by an industrial partner. The prospects of this work can interest NLP community 
in voice recognition, text generation/summarization or multimodality. 
</p>
<p>Mots Cl&#233;s &#8211; Keywords 
</p>
<p>Architecture textuelle, synth&#232;se de la parole, strat&#233;gies d&#8217;oralisation 
Textual architecture, speech synthesis, oralisation strategies </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Maurel 
</p>
<p>1 Introduction 
</p>
<p>La question que nous abordons dans cet article est celle de l&#8217;importance d&#8217;une prise en 
compte de la structure informationnelle qui est prise en charge par la morpho-disposition des 
textes. Ces structures architecturales, plus ou moins combin&#233;es &#224; d&#8217;autres composantes 
structurelles, peuvent avoir une fonction et une valeur significative. Ainsi, il est important que 
cette composante soit &#233;tudi&#233;e et int&#233;gr&#233;e dans les applications en traitement automatique des 
langues (Scott, 2003). En particulier, nous nous int&#233;ressons &#224; l&#8217;utilit&#233; des aspects morpho-
dispositionnels des documents et, le cas &#233;ch&#233;ant, leur utilisabilit&#233;, dans le cadre de leur 
transposition &#224; l&#8217;oral par des moteurs de synth&#232;se de parole &#224; partir de textes (TTS). Dans ce 
contexte, la question vient naturellement : quels sont les mod&#232;les linguistiques et les outils 
technologiques &#224; notre disposition pour rendre compte de ces aspects &#224; l&#8217;oral en fonction des 
caract&#233;ristiques des usagers (handicaps, &#8230;), de l&#8217;environnement (bruit&#233;, type de support de 
l&#8217;interaction, &#8230;) et du type de t&#226;che/activit&#233; (recherche d&#8217;information, &#8230;) ? 
</p>
<p>Notre recherche pose l&#8217;hypoth&#232;se d&#8217;une unit&#233; de traitement &#224; la fois plus efficiente (plus 
&#171; cognitive &#187; ?) que la phrase mais malgr&#233; tout r&#233;aliste : l&#8217;Objet Textuel (OT). Aussi, la 
section suivante s&#8217;attachera &#224; justifier ce choix en mettant en &#233;vidence cette dimension propre 
aux textes &#233;crits pour &#234;tre lus silencieusement qui, bien que peu trait&#233; par des logiciels de 
synth&#232;se de la parole &#224; partir de texte, nous semble incontournable pour une oralisation 
correcte en terme  d&#8217;intelligibilit&#233;. Notre approche rev&#234;tant un caract&#232;re fortement 
pluridisciplinaire, nous &#233;tudierons la prise en compte de cet aspect du texte &#224; travers la 
litt&#233;rature de la linguistique textuelle, de la psycholinguistique et de l&#8217;informatique. Nous 
d&#233;crirons ensuite la synoptique d&#8217;un syst&#232;me d&#8217;oralisation utilisant l&#8217;OT comme unit&#233; de 
traitement, puis nous focaliserons sur l&#8217;&#233;tape visant &#224; mettre en &#339;uvre les diff&#233;rentes 
strat&#233;gies envisageables pour leur oralisation. Ce dernier module est exemplifi&#233;, et son 
op&#233;rationnalisation en partie d&#233;montr&#233;e, &#224; travers l&#8217;exemple des structures &#233;num&#233;ratives, en 
s&#8217;appuyant sur diff&#233;rents mod&#232;les et typologies dont nous d&#233;crierons l&#8217;int&#233;r&#234;t pour notre 
travail. 
</p>
<p>2 Valeur et prise en compte de la morpho-disposition des textes 
</p>
<p>2.1 Du point de vue des linguistes 
</p>
<p>Longtemps la mise en forme des textes n&#8217;a pas &#233;t&#233; consid&#233;r&#233;e comme un objet d&#8217;&#233;tude &#224; part 
enti&#232;re. Aujourd&#8217;hui encore, peu de manifestations scientifiques proposent de traiter de ce 
sujet. Malgr&#233; tout, nous remarquons depuis quelques ann&#233;es un int&#233;r&#234;t croissant pour l&#8217;&#233;tude 
de la morpho-disposition des textes afin de prendre en compte cette dimension pour la 
g&#233;n&#233;ration de document, le r&#233;sum&#233; automatique ou la synth&#232;se de parole. Cependant peu de 
mod&#232;les permettent d&#8217;appr&#233;hender globalement cet objet d&#8217;&#233;tude, d&#8217;un point de vue th&#233;orique 
et formel, et donc d&#8217;envisager des traitements informatiques. A notre connaissance, une des 
seules tentatives pour parvenir &#224; un tel r&#233;sultat est d&#233;crite par le Mod&#232;le d&#8217;Architecture 
Textuelle (MAT) (Virbel, 1989),  (Pascual, 1996). Dans le cadre de notre &#233;tude, ce mod&#232;le 
nous a sembl&#233; un point de d&#233;part int&#233;ressant pour soutenir la mise en &#339;uvre de strat&#233;gies 
d&#8217;oralisation de l&#8217;architecture du texte. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De l&#8217;&#233;crit &#224; l&#8217;oral : analyses et g&#233;n&#233;rations 
</p>
<p>Ce mod&#232;le d&#233;finit l&#8217;architecture de texte comme une composante abstraite du texte qui 
prend sa source dans la notion de Mise en Forme Mat&#233;rielle (MFM) et dans l&#8217;hypoth&#232;se de 
l&#8217;existence d&#8217;une &#233;quivalence fonctionnelle entre des ph&#233;nom&#232;nes typographiques, 
dispositionnels et lexico-syntaxiques. La MFM est un sous-ensemble de propri&#233;t&#233;s morpho-
dispositionnelles du texte poss&#233;dant des &#233;quivalents langagiers. Les constituants des textes, 
les Objets Textuels (OT), sont perceptibles par le jeu de contraste de la MFM et 
l&#8217;architecture de texte est l&#8217;ensemble des objets textuels et les propri&#233;t&#233;s qu&#8217;ils entretiennent 
entre eux. L&#8217;approche g&#233;n&#233;rale de l&#8217;architecture textuelle est sous-tendue par les travaux de 
(Harris, 1971) qui pose que la langue peut &#234;tre d&#233;crite par elle-m&#234;me, c&#8217;est &#224; dire que l&#8217;on 
peut exhiber des phrases &#224; port&#233;e m&#233;ta-textuelle explicitant le fonctionnement de la langue et 
ob&#233;issant aux m&#234;mes lois de constructions grammaticales que les phrases de la langue. 
L&#8217;ensemble de ces phrases forme le m&#233;talangage. Par exemple, la phrase &#171; Max est sujet de 
Max mange une pomme &#187; est une phrase du m&#233;talangage. Harris pose qu&#8217;en r&#232;gle g&#233;n&#233;rale ce 
m&#233;talangage est r&#233;duit mais que cette r&#233;duction laisse des traces dans la langue. Des travaux 
ont &#233;t&#233; men&#233;s par l&#8217;&#233;quipe de M. Gross (Gross, 1990) et ont pu valider cette approche pour le 
fran&#231;ais. Ce principe a &#233;t&#233; appliqu&#233; aux propri&#233;t&#233;s morpho-dispositionnelles du texte : elles 
peuvent &#234;tre d&#233;crites &#224; l&#8217;aide de phrases m&#233;ta-textuelles (par exemple : &#171; je segmente mon 
texte en trois parties &#187;, &#171; je commence par une introduction consacr&#233;e &#224; la linguistique &#187;, etc.) 
et la r&#233;duction de ces phrases laisse des traces dans le texte qui sont des propri&#233;t&#233;s 
typographiques et dispositionnelles. L&#8217;ensemble des phrases d&#233;crivant les propri&#233;t&#233;s morpho-
dispositionnelles forment le m&#233;talangage architectural. Cette approche a pour cons&#233;quence 
l&#8217;existence d&#8217;un continuum entre des formes de MFM enti&#232;rement discursives et des formes 
visuelles : on passe d&#8217;une extr&#233;mit&#233; &#224; l&#8217;autre de ce continuum en effa&#231;ant (au profit de 
marques visuelles) ou en reconstruisant (par interpr&#233;tation) le m&#233;talangage architectural.  
</p>
<p>2.2 Du point de vue des psycholinguistes 
</p>
<p>Du fait que les marques de MFM sont consid&#233;r&#233;es par la majorit&#233; des mod&#232;les de la 
compr&#233;hension comme des traits de surface, leur r&#244;le est r&#233;duit &#224; une fonction quasi 
ornementale. Ainsi, peu (ou pas) de mod&#232;les de la compr&#233;hension du texte se sont int&#233;ress&#233;s &#224; 
int&#233;grer l&#8217;implication des marques structurales visuelles dans le traitement cognitif du texte 
(Schmidt, 2002) et par cons&#233;quent, on note une pauvret&#233; de travaux ayant &#233;tudi&#233; l&#8217;existence 
d&#8217;une telle implication et les m&#233;canismes qui y sont sous-jacents. Parmi les travaux qui se 
sont int&#233;ress&#233;s &#224; l&#8217;impact des traits de surface sur le traitement cognitif, une premi&#232;re 
cat&#233;gorie s&#8217;est pench&#233;e sur le r&#244;le des signaux dans la gestion des traitements mis en &#339;uvre 
durant la lecture (Schmidt, 2001). D&#8217;autres ont montr&#233; leur implication dans le macro-
traitement du texte (Goldman, 1995), (Lorch, 1996) en mettant en &#233;vidence leur participation 
&#224; l&#8217;identification des th&#232;mes. (Nespoulous, 2002) va m&#234;me jusqu&#8217;&#224; avancer la notion 
d&#8217;avenance textuelle comme une transposition de la notion d&#8217;affordance au texte ; cette notion 
renvoie au fait que ce sont les propri&#233;t&#233;s de l&#8217;environnement qui conditionnent notre 
traitement de l&#8217;information. Le texte poss&#232;derait &#224; des degr&#233;s divers et &#224; travers l&#8217;utilisation 
des marques de MFM une affordance conditionnant son traitement. A ce titre, ces marques 
seraient bien plus qu&#8217;ornementales, elles constitueraient une enveloppe spatiale que le lecteur 
appr&#233;henderait pour orienter son traitement du texte. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Maurel 
</p>
<p>2.3 Du point de vue des informaticiens 
</p>
<p>Un texte ne peut &#234;tre r&#233;duit &#224; une suite lin&#233;aire de mots qui se constituent en phrases. En 
particulier, des proc&#233;d&#233;s sp&#233;cifiques peuvent se constituer en configurations particuli&#232;res, 
intentionnelles et signifiantes (titres, exemples, insistances, ...), appel&#233;es Objets Textuels 
(Cf. 2.1), auxquelles les technologies actuelles de synth&#232;ses de parole &#224; partir de textes ne 
savent que partiellement r&#233;agir.  
</p>
<p>Par exemple, le texte &#224; gauche1 exprime des diff&#233;rences logico-linguistiques dans les 
titres d&#8217;un m&#234;me document : le premier titre est totalement ind&#233;pendant (syntaxiquement) de 
la suite du d&#233;veloppement. Dans le cas du 2&#232;me titre, le texte commence par une reprise 
</p>
<p>anaphorique du titre (il &#198; le directeur). Enfin, dans le 3&#232;me cas, 
on a une continuation syntaxique entre le titre (sujet) et la suite 
du texte. Chacun de ces titres devrait avoir un impact diff&#233;rent 
sur l&#8217;oralisation.  
</p>
<p>M&#234;me certaines marques de ponctuation (lorsqu&#8217;elles sont 
trait&#233;es) sont en relation quasi-bijective avec les effets que leur 
traitement par un syst&#232;me de TTS produit : une marque entra&#238;ne 
toujours le m&#234;me effet. Or, par exemple, un simple tiret ne 
devrait pas aboutir &#224; une oralisation &#233;quivalente selon qu&#8217;il est 
utilis&#233; :   
</p>
<p>- pour marquer le d&#233;but d&#8217;un item d&#8217;&#233;num&#233;ration,  
- comme une marque d&#8217;incise &#8211; parenth&#233;tique ou commentaire &#8211;,  
- en lieu et place d&#8217;un s&#233;parateur de type &#171; , &#187; &#8211; &#171; ; &#187; &#8211; &#171; . &#187;, &#8230; 
 
</p>
<p>Nous avons explor&#233; dans un premier temps la capacit&#233; des syst&#232;mes de TTS &#224; r&#233;agir &#224; 
certaines sp&#233;cificit&#233;s des textes &#233;crits pour &#234;tre lus silencieusement (et non pour &#234;tre dits). 
Des r&#233;sultats de ces observations a &#233;merg&#233; la synoptique d&#8217;un syst&#232;me qui nous semble plus 
adapt&#233; &#224; la perspective d&#8217;une transposition automatique &#224; l&#8217;oral des structures visuelles des 
textes (Figure 1). 
</p>
<p>L&#8217;originalit&#233; de ce syst&#232;me r&#233;side dans l&#8217;unit&#233; d&#8217;analyse consid&#233;r&#233;e pour le traitement des 
documents &#233;crits. En effet, elle ne correspond plus &#224; la traditionnelle phrase ponctu&#233;e et n&#8217;a 
pas non plus l&#8217;ambition d&#8217;int&#233;grer le texte globalement avec son co-texte et ses contextes. En 
fait, le processus d&#8217;oralisation d&#233;crit par cette architecture permet de faire &#171; traverser &#187; &#224; un 
OT plusieurs phases de transformation qui s&#8217;appuient sur un ensemble de connaissances 
associ&#233;es &#224; chacune d&#8217;elles. Ces trois &#233;tapes (normalisation, extraction, reformulation) 
permettent, &#224; partir d&#8217;un objet textuel &#171; &#233;cologique &#187;, de fournir une repr&#233;sentation, associ&#233;e &#224; 
une strat&#233;gie d&#8217;oralisation particuli&#232;re, interpr&#233;table par un TTS. Notre int&#233;r&#234;t s&#8217;est port&#233; dans 
un premier temps sur la faisabilit&#233; de l&#8217;automatisation du processus de reformulation &#224; travers 
l&#8217;acquisition des connaissances n&#233;cessaires et suffisantes pour l&#8217;&#233;laboration des 
</p>
<p>                                                 
</p>
<p>1  Le texte rend compte de l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; des textes r&#233;els &#233;tudi&#233;s. Sa qualit&#233; m&#233;diocre est due &#224; la mauvaise 
facture du document original. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De l&#8217;&#233;crit &#224; l&#8217;oral : analyses et g&#233;n&#233;rations 
</p>
<p>repr&#233;sentations permettant un traitement informatique de cette &#233;tape (parties gris&#233;es de la 
Figure 1). 
</p>
<p>OT normalis&#233; + PF 
</p>
<p>OT &#171; &#233;cologique &#187; 
</p>
<p>OT normalis&#233; 
</p>
<p>OT &#171; oralisable &#187; 
</p>
<p>Normalisation
</p>
<p>Extraction 
</p>
<p>Reformulation
</p>
<p>TTS
</p>
<p>Contraintes 
&#233;ditoriales 
</p>
<p>Strat&#233;gies 
d&#8217;oralisation
</p>
<p>Param&#232;tres 
formels 
</p>
<p>&#201;quivalence informationnelle {
&#201;quivalence cognitive ? 
</p>
<p>Figure 1 : Synoptique du syst&#232;me d&#8217;oralisation des structures visuelles des textes 
</p>
<p>3 Le module des strat&#233;gies d&#8217;oralisation 
</p>
<p>Notre premier objectif pour aborder la phase de reformulation a &#233;t&#233; de concevoir un mod&#232;le 
des strat&#233;gies d&#8217;oralisation prenant en compte la morpho-disposition des textes. L&#8217;axiome 
principal qui sous-tend le mod&#232;le pr&#233;tend qu&#8217;il est n&#233;cessaire d&#8217;obtenir une forme discursive 
de l&#8217;OT commune aux deux modalit&#233;s et que, de l&#224;, pourra &#234;tre d&#233;crit un ensemble de 
strat&#233;gies utilisant des proc&#233;d&#233;s sp&#233;cifiques &#224; la modalit&#233; orale. Sur ces bases, nous avons 
con&#231;u le Mod&#232;le d&#8217;Oralisation des Textes Ecrits pour &#234;tre Lus Silencieusement (MOTELS &#8211; 
Figure 2). La forme discursive d&#8217;un Objet Textuel (OT) particulier peut &#234;tre reconstruite selon 
trois strat&#233;gies : par une description objective de ses marqueurs : forme discursive descriptive 
(S1 - FDDC), par un premier niveau d&#8217;interpr&#233;tation, en attribuant un nom &#224; cette 
configuration morpho-dispositionnelle : forme discursive d&#233;nominative (S2 - FDDN) ou par 
une interpr&#233;tation plus profonde des intentions du r&#233;dacteur qui se traduisent par l&#8217;utilisation 
de cet OT particulier : forme discursive interpr&#233;tative (S3 - FDI) . Ces trois op&#233;rations 
pourront chacune conduire ensuite &#224; 4 continuums de nouvelles formes d&#8217;oralisation : la 
FDDC pourra se r&#233;duire gr&#226;ce &#224; l&#8217;utilisation de conventions &#171; typophoniques &#187; par un 
proc&#233;d&#233; d&#8217;association bijective entre un ensemble de marques et un ensemble de sons (C1) ; 
la FDDN pourra se r&#233;duire par une convention &#171; typophonique &#187; qui associe de mani&#232;re 
injective les marques morpho-dispositionnelles d&#233;finissant un type d&#8217;objet particulier &#224; un son 
(C2a) ou par un sch&#233;ma prosodique particulier, rep&#233;r&#233; comme &#233;tant associ&#233; au type d&#8217;OT 
&#233;tudi&#233; ind&#233;pendamment de tout contexte d&#8217;&#233;nonciation (C2b) ; la FDI pourra se r&#233;duire par 
l&#8217;utilisation de sch&#233;mas prosodiques d&#233;pendant de la situation d&#8217;&#233;nonciation et donc de la 
structure informationnelle de la FDI (en termes de th&#232;me, topique, focus, rh&#232;me - C3). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Maurel 
</p>
<p>Forme  
Conventionnelle
</p>
<p>Bijective 
</p>
<p>Forme  
Prosodique 
En contexte 
</p>
<p>Pourquoi ?Pourquoi ? 
</p>
<p>Comment ?Comment ?
</p>
<p>C3 
C2.bC2.a
</p>
<p>Forme 
Discursive 
</p>
<p>Interpr&#233;tative 
</p>
<p>S3Forme 
Discursive 
</p>
<p>D&#233;nominative
</p>
<p>S2Forme 
Discursive 
Descriptive 
</p>
<p>C1 
</p>
<p>S1 
</p>
<p>METALANGAGE 
</p>
<p>Forme  
Conventionnelle
</p>
<p>injective 
</p>
<p>NATUREL/COMPLEXITE 
</p>
<p>Forme  
Prosodique 
</p>
<p>Hors contexte 
</p>
<p>Configuration typo-
dispositionnelle (OT) 
</p>
<p>Figure 2 : Mod&#232;le d&#8217;Oralisation des Textes &#201;crits pour &#234;tre Lus Silencieusement (MOTELS) 
</p>
<p>Une illustration des 3 strat&#233;gies dans leur forme discursive peut &#234;tre donn&#233;e &#224; travers 
l&#8217;exemple suivant. Soit le titre d&#8217;un document :  
</p>
<p>L&#8217;ORALISATION DES TEXTES 
S1 : &#171; le texte &#233;crit en gros, centr&#233;, en gras et en capitale est l&#8217;oralisation des textes &#187; 
S2 : &#171; Le titre de niveau 1 est l&#8217;oralisation des textes &#187; 
S3 : &#171;  Je vais vous parler maintenant de l&#8217;oralisation des textes &#187; 
</p>
<p>Les parties en gras seront les marques lexico-syntaxiques restitu&#233;es &#224; partir de la morpho-
disposition du texte. Ce sont aussi celles qui pourront potentiellement &#234;tre effac&#233;es au profit 
de marques sonores telles que d&#233;crites plus haut. Nous remarquerons, comme l&#8217;indique le 
sch&#233;ma de gauche &#224; droite, que les trois formes discursives sont en relation &#224; travers une 
s&#233;mantique de &#171; pourquoi &#187; (respectivement de droite &#224; gauche une s&#233;mantique de 
&#171; comment &#187;, probablement plus proche du travail cognitif du r&#233;dacteur d&#8217;un texte). Dans 
l&#8217;exemple du titre : (S3) comment parler maintenant de X ? &#198; (S2) en faisant de X un titre ; 
comment titrer ? &#198; (S1) en centrant, soulignant, &#8230;  
</p>
<p>4 Application aux structures &#233;num&#233;ratives 
</p>
<p>Le mod&#232;le d&#8217;oralisation pr&#233;sent&#233; ci-avant d&#233;montre la multitude de formes &#233;quivalentes d&#8217;un 
OT qu&#8217;il est envisageable d&#8217;obtenir du point de vue du contenu informationnel qu&#8217;il v&#233;hicule. 
Un certain nombre de crit&#232;res scientifiques et applicatifs ont d&#233;termin&#233; les OT et les strat&#233;gies 
sur lesquelles focaliser notre recherche dans un premier temps. Nous avons &#233;tudi&#233; les 
structures &#233;num&#233;ratives, les titres et les structures d&#8217;insistance afin de d&#233;velopper un 
traitement informatique capable de les restituer selon les trois formes a priori les plus 
int&#233;ressantes : discursive d&#233;nominative, discursive interpr&#233;tative et prosodique en 
contexte. Nous d&#233;crirons ici la d&#233;marche appliqu&#233;e et les r&#233;sultats obtenus pour la 
transposition &#224; l&#8217;oral actuellement la plus aboutie : celle des structures &#233;num&#233;ratives. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De l&#8217;&#233;crit &#224; l&#8217;oral : analyses et g&#233;n&#233;rations 
</p>
<p>4.1 Param&#232;tres formels et repr&#233;sentation des structures &#233;num&#233;ratives 
</p>
<p>En s&#8217;appuyant sur des observations de corpus et des travaux existants (Luc, 2001), (Maurel, 
2002) nous avons pu &#233;tablir les diff&#233;rents param&#232;tres formels des structures &#233;num&#233;ratives &#224; 
prendre en compte. Cet objet est d&#233;fini par : une amorce (phrase introductive pr&#233;c&#233;dant et 
annon&#231;ant l&#8217;&#233;num&#233;ration qui peut &#234;tre syntaxiquement compl&#232;te ou incompl&#232;te ; dans le cas 
d&#8217;incompl&#233;tude, les constituants manquants sont fournis par un ou plusieurs items), un item 
(entit&#233; co-&#233;num&#233;r&#233;e), une &#233;num&#233;ration (un ensemble d&#8217;items), une structure 
&#233;num&#233;rative (l&#8217;ensemble compos&#233; d&#8217;une amorce et d&#8217;une &#233;num&#233;ration).  
</p>
<p>Les structures &#233;num&#233;ratives sont signal&#233;es par une architecture impliquant des marques 
lexico-syntaxiques, typographiques et dispositionnelles vari&#233;es (ibid). Ces marques 
constituent l&#8217;ensemble des param&#232;tres formels des structures &#233;num&#233;ratives, en ce sens qu&#8217;ils 
participent &#224; la forme visuelle de l&#8217;OT. Nous rajouterons que les crit&#232;res de parall&#233;lisme, 
d&#8217;exhaustivit&#233; et d&#8217;ordonnancement peuvent &#233;galement influencer la structure visuelle de 
cet OT. Automatiser la phase de reformulation n&#233;cessite l&#8217;&#233;laboration d&#8217;une repr&#233;sentation 
des structures &#233;num&#233;ratives qui tienne compte de ces param&#232;tres formels. Nous avons 
d&#233;montr&#233; les lacunes du langage XHTML (Maurel, 2003a) et proposons une DTD XML pour 
les combler (Figure 3 pour un exemple). 
</p>
<p>Ce qui est (parfois!)  fait  en HTML Ce que nous faisons 
Les activit&#233;s du centre social sont: 
&lt;UL&gt; 
  
&lt;LI&gt;- la gestion de six appartements d'urgence que 
propose la commune ; &lt;/LI&gt; 
 
&lt;LI&gt;- l&#8217;organisation de r&#233;unions de formation collectives ; 
&lt;/LI&gt; 
 
&lt;LI&gt;- le montage des projets de formation.&lt;/LI&gt;  
&lt;/UL&gt; 
 
</p>
<p>&lt;SE type=&quot;parall&#232;le&quot; exhaus=&quot;oui&quot; ordon=&quot;non&quot;&gt;  
&lt;AMORCE  
 classifieur=&quot;activit&#233;s du centre social &quot;  
 vs=&quot;&#233;num&#233;r&#233;es&quot;  
 gnspec=&quot;ci-apr&#232;s&quot;/&gt;  
&lt;ENUMERATION&gt;  
&lt;ITEM format=&quot;absgn&quot; repclass=&quot;activit&#233;&quot;&gt;  
&lt;NOYAU&gt; la gestion &lt;/NOYAU&gt; de six appartements 
d'urgence que propose la commune&lt;/ITEM&gt; 
&lt;ITEM format=&quot;absgn&quot; repclass=&quot;activit&#233;&quot;&gt;  
&lt;NOYAU&gt; l&#8217;organisation &lt;/NOYAU&gt; de r&#233;unions de 
formation collectives &lt;/ITEM&gt; 
&lt;ITEM format=&quot;absgn&quot; repclass=&quot;activit&#233;&quot;&gt;  
&lt;NOYAU&gt; le montage &lt;/NOYAU&gt; des projets de formation 
&lt;/ITEM&gt;  
&lt;/ENUMERATION&gt;&lt;/SE&gt; 
</p>
<p>Figure 3 : Exemple d&#8217;une repr&#233;sentation HTML versus XML 
</p>
<p>De l&#224; peuvent &#234;tre construites automatiquement les formes d&#233;nominative et interpr&#233;tative &#224; 
condition qu&#8217;elles s&#8217;inscrivent dans un pattern de m&#233;taphrases pr&#233;d&#233;finies (Figure 4).  
</p>
<p>Version discursive d&#233;nominative Version discursive interpr&#233;tative 
L&#8217;auteur annonce une &#233;num&#233;ration de trois 
items concernant les activit&#233;s du centre social. 
Le premier item de l&#8217;&#233;num&#233;ration concerne la 
gestion de six appartements d&#8217;urgence que 
propose la commune. Le deuxi&#232;me item de 
l&#8217;&#233;num&#233;ration concerne l&#8217;organisation de 
r&#233;unions de formation collectives. Le troisi&#232;me 
et dernier item de l&#8217;&#233;num&#233;ration concerne le 
montage des projets de formation. 
</p>
<p>Les trois activit&#233;s du centre social sont 
&#233;num&#233;r&#233;es ci-apr&#232;s. Une premi&#232;re activit&#233; 
possible est la gestion de six appartements 
d&#8217;urgence que propose la commune. Une 
deuxi&#232;me activit&#233; possible est l&#8217;organisation de 
r&#233;unions de formation collectives. Une troisi&#232;me 
et derni&#232;re activit&#233; possible est le montage des 
projets de formation. 
</p>
<p>Figure 4 : Exemples de formes discursives d&#233;nominative et interpr&#233;tative </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Maurel 
</p>
<p>4.2 De la FDI &#224; la forme prosodique en contexte (FPEC) 
</p>
<p>Il s&#8217;agissait de d&#233;terminer les marques prosodiques qui ont la m&#234;me fonction que les marques 
lexico-syntaxiques &#171; architecturantes &#187; de la version discursive. Des tentatives infructueuses 
d&#8217;&#233;tude par corpus pour faire &#233;merger des r&#233;gularit&#233;s prosodiques nous ont conduits &#224; une 
d&#233;marche pluri-fond&#233;e : &#233;coute qualitative (attentive et critique) d&#8217;un recueil de discours 
oraux , introspection soumise &#224; discussion avec des sp&#233;cialistes et projection des r&#232;gles 
dict&#233;es par un mod&#232;le de l&#8217;intonation pragmatique du fran&#231;ais (Rossi, 1999) sur la 
relation entre des marques lexico-syntaxiques d&#8217;un OT et sa version prosodique. Cette 
m&#233;thode a amen&#233; &#224; conf&#233;rer &#224; l&#8217;effacement des m&#233;taphrases au profit de marques prosodiques 
un r&#244;le de conservation de la structuration informationnelle (en terme de th&#233;matisation,  
rh&#233;matisation, topicalisation ou focalisation). Nous avons appliqu&#233; cette d&#233;marche g&#233;n&#233;rale 
aux structures &#233;num&#233;ratives (Maurel, 2003b). Ce travail a permis d&#8217;&#233;valuer le pouvoir 
descriptif, au niveau de notre probl&#233;matique, du mod&#232;le intonatif de M. Rossi. Lorsque ce 
cadre th&#233;orique n&#8217;apportait de solutions satisfaisantes, nous avons eu recours &#224; d&#8217;autres 
r&#233;sultats issus de la litt&#233;rature (Morel, 1998), (Vannier, 1999) et &#224; un protocole exp&#233;rimental 
(en particulier pour  traiter la strat&#233;gie pausale et l&#8217;intonation de fin d&#8217;item). Nous avons alors 
proc&#233;d&#233; &#224; l&#8217;examen syst&#233;matique des sp&#233;cifications du langage SSML2 dont un r&#244;le est de 
normaliser la repr&#233;sentation de ph&#233;nom&#232;nes prosodiques. Trois cas se sont pr&#233;sent&#233;s : (1) 
utilisation de marqueurs SSML sans modifications des sp&#233;cifications (e.g : &lt; BREAK &gt;) ; (2) 
utilisation de marqueurs SSML avec modifications des sp&#233;cifications (e.g : &lt; PROSODY 
pitch=&quot;calcul&quot; param=&quot;item:i:n&quot;) ; (3) mise en oeuvre de nouveaux marqueurs non d&#233;crits dans les 
sp&#233;cifications SSML (e.g. :  FOCUS type=&quot;&#233;tendu&quot; | &quot;s&#233;mantique&quot;). Finalement, &#224; partir de notre 
repr&#233;sentation des structures &#233;num&#233;ratives et une feuille de transformation XSLT il nous est 
possible d&#8217;obtenir notre forme prosodique. L&#8217;exemple de la figure 3 est repris ci-dessous. 
</p>
<p>&lt;SE&gt; Les &lt;FOCUS type=&quot;&#233;tendu&quot;&gt; trois activit&#233;s du centre social &lt;/FOCUS&gt; sont  &lt;BREAK 
size=&quot;large&quot;&gt; &lt;AUDIO src=&quot;uri&quot;/&gt; &lt;PROSODY pitch=&quot;calcul&quot; param=&quot;item:1:3&quot;&gt; &lt;FOCUS 
type=&quot;s&#233;mantique&quot;&gt; la gestion &lt;/FOCUS&gt; de six appartements d&#8217;urgence que propose la commune 
&lt;BREAK type=&quot;medium&quot;&gt; &lt;/PROSODY&gt; &lt;PROSODY pitch=&quot;calcul&quot; param=&quot;item:2:3&quot;&gt; &lt;FOCUS 
type=&quot;s&#233;mantique&quot;&gt; l&#8217;organisation &lt;/FOCUS&gt; de r&#233;unions d&#8217;information collectives &lt;BREAK 
type=&quot;medium&quot;&gt; &lt;/PROSODY&gt; &lt;PROSODY range=Xst&gt; &lt;FOCUS type=&quot;s&#233;mantique&quot;&gt; le montage  
&lt;/FOCUS&gt; des projets de formation &lt;/PROSODY&gt; &lt;/SE&gt; 
</p>
<p>Par exemple, (Rossi, 1999:56) d&#233;crit le &#171; morph&#232;me intonatif de topique contextuel 
r&#233;f&#233;rentiel &#187; comme &#171; montrant du doigt &#187; ce dont on va dire quelque chose ; l&#8217;allocutaire 
prenant ainsi connaissance du r&#233;f&#233;rent juste avant de recevoir l&#8217;information. Nous avons 
utilis&#233;  ce morph&#232;me intonatif dans la version prosodique des structures &#233;num&#233;ratives, &#224; la fin 
du syntagme nominal de l&#8217;amorce contenant le classifieur des items (ci-dessus : &#171; social &#187;) : 
nous substituons par cette marque prosodique la marque lexico-syntaxique &#171; ci-apr&#232;s &#187; de la 
forme discursive dont le r&#244;le est pr&#233;cis&#233;ment de &#171; montrer du doit &#187; les entit&#233;s &#233;num&#233;r&#233;es qui 
suivent. Les sp&#233;cifications formul&#233;es pour l&#8217;interpr&#233;tation de l&#8217;ensemble des balises utilis&#233;es 
ont &#233;t&#233; int&#233;gr&#233;es dans un syst&#232;me de synth&#232;se de parole &#224; partir de texte d&#8217;un partenaire 
industriel3. 
</p>
<p>                                                 
</p>
<p>2 Speech Synthesis Markup Language - http://fr.w3.org/TR/2003/CR-speech-synthesis-20031218/  
</p>
<p>3 Elan Speech &#8211; Tempo Technology &#8211; www.elan.fr </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De l&#8217;&#233;crit &#224; l&#8217;oral : analyses et g&#233;n&#233;rations 
</p>
<p>5 Perspectives et conclusions 
</p>
<p>Nous avons montr&#233; qu&#8217;une &#233;quivalence en terme de contenu informationnel &#233;tait envisageable 
entre un texte &#233;crit pour &#234;tre lu silencieusement et sa version orale. Id&#233;alement, l&#8217;obtention de 
cette &#233;quivalence passe par une analyse fine de chaque objet textuel susceptible de se trouver 
dans un document. A partir de ces observations nous construisons manuellement des patterns 
aptes &#224; &#171; recevoir &#187; les versions discursives de l&#8217;OT. Nous nous appuyons sur des 
observations et des cadres th&#233;oriques de la prosodie du fran&#231;ais pour d&#233;duire, de ces versions 
discursives, des versions prosodiques. Nous &#233;tudions les possibilit&#233;s de repr&#233;sentation de 
cette derni&#232;re dans le langage SSML (interpr&#233;table par un TTS). Nous proposons, le cas 
&#233;ch&#233;ant, des sp&#233;cifications pour de nouvelles balises qu&#8217;un partenaire industriel peut int&#233;grer 
dans son syst&#232;me. Nous d&#233;duisons finalement une repr&#233;sentation de type XML de l&#8217;OT, 
ad&#233;quate pour obtenir par transformation (XSLT) nos deux versions. Aujourd&#8217;hui, ce travail a 
&#233;t&#233; partiellement r&#233;alis&#233; pour trois objets textuels : les structures &#233;num&#233;ratives, les titres et les 
structures d&#8217;insistances.  
</p>
<p>Si il a &#233;t&#233; ainsi possible de construire des repr&#233;sentations qui op&#233;rationnalisent diff&#233;rentes 
strat&#233;gies d&#8217;oralisation d&#8217;OT, nous n&#8217;avons que peu de donn&#233;es sur les moyens &#224; mettre en 
&#339;uvre pour obtenir automatiquement ces repr&#233;sentations &#224; partir d&#8217;un document original. 
Ainsi une perspective incontournable pour concevoir un syst&#232;me r&#233;ellement automatisable se 
d&#233;gage : l&#8217;extraction automatique, dans les documents tout-venant, des param&#232;tres 
formels des OT (e.g. : pour l&#8217;&#233;num&#233;ration - extraction du classifieur des items, du nombre 
d&#8217;items, &#8230;).  
</p>
<p>Une seconde perspective concerne l&#8217;&#233;valuation de l&#8217;&#233;quivalence de nos formes non plus en 
terme de contenu informationnel, mais en terme de traitement cognitif : un protocole 
exp&#233;rimental est en cours pour &#233;valuer l&#8217;impact des strat&#233;gies discursives interpr&#233;tatives et 
prosodiques sur la m&#233;morisation/compr&#233;hension de l&#8217;information par des jeunes versus &#226;g&#233;s 
(les d&#233;gradations dans la perception de la prosodie et dans les capacit&#233;s mn&#233;siques pouvant 
potentiellement influer sur l&#8217;efficience des strat&#233;gies d&#8217;oralisation).  
</p>
<p>Les perspectives de ce travail peuvent int&#233;resser la communaut&#233; TAL en reconnaissance de la 
parole (rep&#233;rage des marques architecturantes du discours oral pour une mise en forme 
automatique du texte), en g&#233;n&#233;ration de texte (par l&#8217;utilisation du MAT) ou en multimodalit&#233; 
(la transmodalit&#233; comme un moyen d&#8217;&#233;tude de la multimodalit&#233; (Maurel, 2003c)). 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>GOLDMAN S.R., SAUL E.U., Cot&#233; N. (1995), Paragraphing, Reader, and Task, effects in 
discourse comprehension, Discourse Processes, Vol. 20, pp. 273-305. 
</p>
<p>GROSS M. (1990), Sur la notion harrissienne de transformation et son application au fran&#231;ais, 
Langage, n&#176;99, pp. 39-56. 
</p>
<p>HARRIS Z.S. (1971), Structures Math&#233;matiques du Langage, Paris, Dunod. 
</p>
<p>HARRIS Z.S. (1982), A Grammar of English on Mathematical Principles, Wiley-interscience, 
New York. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabrice Maurel 
</p>
<p>LORCH R.F., LORCH E.P. (1996), Effects of organizational signals on free recall of expository 
texts, Journal of Educational Psychology, Vol. 88, N&#176;1, pp.  38-48, 1996. 
</p>
<p>LUC C. (2001), Une typologie des structures &#233;num&#233;ratives bas&#233;e sur les structures rh&#233;toriques 
et architecturales du texte. Actes de TALN&#8217;2001, pp. 263-272. 
</p>
<p>MAUREL F., LUC C., MOJAHID M., VIGOUROUX N., VIRBEL J., NESPOULOUS J.-L. (2002), De 
l'influence de la variabilit&#233; des textes sur leur transposition automatique &#224; l'oral, Actes de 
Conf&#233;rence Internationale sur le Document &#201;lectronique 5, pp. 211-225. 
</p>
<p>MAUREL F., RAYNAL M., ORIOLA B., VIGOUROUX N. (2003a), Extension of W3C Standards 
for Real Web Accessibility, Actes de Human - Computer Interaction 2003, Vol. 4, pp. 995-
999. 
</p>
<p>MAUREL F., LEMARI&#201; J., VIGOUROUX N. (2003b), Oralisation de structures visuelles : de la 
lexico-syntaxe &#224; la prosodie, Actes de Interface Prosodique 2003, pp. 137-142. 
</p>
<p>MAUREL F., VIGOUROUX N., RAYNAL M., ORIOLA B. (2003c), Contribution of the 
Transmodality Concept to Improve Web Accessibility, Dans M. MOKHTARI (eds). Assistive 
Technology Series Vol.12 (ICOST&#8217;03 &#8211; Independent living for persons with disabilities and 
elderly people). Chapter 4 &#8211; computer accessibility, IOS Press, Amsterdam, pp. 186-193. 
</p>
<p>MOREL M.-A., DANON-BOILEAU L. (1998), Grammaire de l&#8217;intonation, Paris, Ophrys. 
</p>
<p>NESPOULOUS J.-L., DE MATTOS PIMENTA M.A., VIRBEL J. (2002), Des objets textuels &#224; leur 
traitement par le cerveau humain, Actes de. Inscription Spatiale du Langage 2002, pp. 77-87. 
</p>
<p>PASCUAL, E. (1996), Integrating Text Formating and Text Generation, Trends in Natural 
Language Generation : an Artificial Intelligence Perspective. R&#233;ds : ADORNI M. et ZOCK M., 
Eds: Springer-Verlag , pp. 205-221. 
</p>
<p>ROSSI M. (1999), L&#8217;intonation, le syst&#232;me du fran&#231;ais : description et mod&#233;lisation, Paris, 
Ophrys. 
</p>
<p>SCOTT D. (2003), Layout in NLP: the case for Document Structure, Invited presentation to 
ACL'03 Sapporo - http://www.itri.brighton.ac.uk/~Donia.Scott/slides.html, Japan, July 2003. 
</p>
<p>SCHMID S. (2001), Repr&#233;sentation organisationnelle et compr&#233;hension : r&#244;le de la mise en 
forme mat&#233;rielle dans la lecture, Th&#232;se de doctorat, Nice Sophia Antipolis. 
</p>
<p>SCHMID S. (2002), R&#244;le de la repr&#233;sentation spatiale des textes dans la compr&#233;hension, Actes 
de Inscription Spatiale du Langage, pp. 289-296. 
</p>
<p>VANNIER G. (1999), &#201;tude des contributions des structures textuelles et syntaxiques pour la 
prosodie : application &#224; un syst&#232;me de synth&#232;se vocale &#224; partir de texte, Th&#232;se de doctorat, 
Caen. 
</p>
<p>VIRBEL J. (1989), The Contribution of linguistic knowledge to the interpretation of text 
Structure, Dans J. ANDR&#201;, V. QUINT et R. FURUTA (eds.), Structured Documents, Cambridge 
University Press, pp. 161-181. </p>

</div></div>
</body></html>