<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>G&#233;n&#233;ration s&#233;mantico-syntaxique pour la traduction automatique bas&#233;e sur une architecture interlingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>G&#233;n&#233;ration s&#233;mantico-syntaxique pour la traduction
automatique bas&#233;e sur une architecture interlingue
</p>
<p>Mehand Iheddadene
Th&#232;se &#224; France Telecom R&amp;D - DMI/GRI
2, avenue Pierre Marzin - 22307 Lannion
</p>
<p>mehand.iheddadene@rd.francetelecom.com
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans cet article, nous pr&#233;sentons un processus de g&#233;n&#233;ration s&#233;mantico-syntaxique con&#231;u et
mis en &#339;uvre dans la r&#233;alisation d&#8217;un prototype de traduction automatique bas&#233;e sur le mod-
&#232;le &#224; structure interm&#233;diaire (ou structure pivot). Dans une premi&#232;re partie de l&#8217;article, nous
pr&#233;sentons l&#8217;organisation des ressources lexicales et s&#233;mantiques multilingues, ainsi que les m&#233;-
canismes permettant d&#8217;exploiter ces ressources pour produire une repr&#233;sentation conceptuelle
du sens de la phrase source. Dans une seconde partie, nous pr&#233;sentons la premi&#232;re phase de
g&#233;n&#233;ration &#224; partir d&#8217;une structure pivot (g&#233;n&#233;ration S&#233;mantico-Syntaxique) permettant la con-
struction d&#8217;une structure syntaxique profonde de la phrase cible &#224; produire. Les autres phases
de g&#233;n&#233;ration ne seront pas abord&#233;es dans cet article.
</p>
<p>This paper aims to present a method for the semantic-syntactic generation that has been pro-
posed to build a machine translation prototype based on the interlingua translation model. The
first part of the paper introduces the multilingual lexical and semantical resources, and the way
they are used to build conceptual representations of the meaning of source sentences. The fol-
lowing part of the paper presents the first step in generating the target text from the conceptual
representation (semantic-syntactic generation) which results on a deep syntactic structure of the
targeted text. The other steps of the generation process will not be discussed in this paper.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Traduction Automatique, Architecture interlingue, s&#233;mantique lexicale, G&#233;n&#233;ration s&#233;mantico-
syntaxique, structure syntaxique profonde
Machine Translation, Interlingual architecture, lexical semantics, semantic-syntactic genera-
tion, deep syntactic structure</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehand Iheddadene
</p>
<p>1 Introduction
</p>
<p>La traduction automatique bas&#233;e sur une structure pivot (ou interlingue), est explor&#233;e dans un
certain nombre de syst&#232;mes et prototypes : ULTRA (Farwell &amp; Wilks, 1991), DLT de BSO
Research (Witkam, 1988), projet UNL (S&#233;rasset &amp; Boitet, 1999), NESPOLE (Metze et al.,
2002), C-STAR, etc. Une telle structure pivot peut se mat&#233;rialiser dans des conceptions dif-
f&#233;rentes allant d&#8217;une langue arbitraire telle que l&#8217;Esp&#233;ranto (utilis&#233;e par le syst&#232;me DLT ) &#224;
une repr&#233;sentation plus au moins abstraite dans une langue donn&#233;e telle qu&#8217;un arbre syntaxique
ou s&#233;mantique en anglais (Boitet, 2000). Elle peut aussi &#234;tre repr&#233;sent&#233;e par des ontologies
(syst&#232;me KBMT (Nirenburg et al., 1986) et le projet KANT (Mitamura et al., 1991)). Dans
notre approche, nous nous situons dans le cadre de l&#8217;application de la th&#233;orie sens-texte (TST)
((Mel&#8217;c&#780;uk, 1997), (Polgu&#232;re, 1998)) &#224; la traduction automatique. La TST fournit justement les
moyens de mod&#233;lisation d&#8217;un langage pivot reposant sur l&#8217;hypoth&#232;se que le sens d&#8217;une phrase
source, apr&#232;s une analyse syntactico-s&#233;mantique assez profonde, peut &#234;tre repr&#233;sent&#233; au moyen
d&#8217;un langage non sp&#233;cifique enti&#232;rement ind&#233;pendant des langues.
</p>
<p>2 Mod&#233;lisation des informations s&#233;mantiques
</p>
<p>La repr&#233;sentation interm&#233;diaire propos&#233;e d&#233;pend essentiellement de la repr&#233;sentation des unit&#233;s
lexicales qui composent la phrase source. Nous consid&#233;rons que la description de l&#8217;unit&#233; lexi-
cale et sa formalisation doivent &#234;tre r&#233;alis&#233;es de telle sorte que le syst&#232;me automatique puisse
pr&#233;dire, &#224; la fois son comportement au sein de l&#8217;&#233;nonc&#233; et sa relation avec les unit&#233;s co-
occurrentes. Il est donc primordial de commencer par d&#233;crire la mani&#232;re de formaliser les
informations s&#233;mantiques, voire encyclop&#233;dique &#224; inclure dans le lexique. Cette mod&#233;lisation
est formalis&#233;e &#224; l&#8217;aide d&#8217;un th&#233;saurus constitu&#233; d&#8217;un ensemble de th&#232;mes multilingue. Un th&#232;me
est un ensemble d&#8217;entr&#233;es lexicales (ou lexicalisations) abordant le m&#234;me sujet. Ainsi, nous
regroupons, par exemple, les unit&#233;s lexicales chien et dog dans le m&#234;me th&#232;me, pharaon, em-
pereur et roi dans un autre th&#232;me et lire, lecture et lecteur dans un autre, etc. Le d&#233;coupage en
th&#232;mes constitue une partition de l&#8217;ensemble des sens des entr&#233;es lexicales des langues trait&#233;es.
En cons&#233;quence, si une entr&#233;e lexicale appara&#238;t dans plusieurs th&#232;mes, ces apparitions seront
consid&#233;r&#233;es comme plusieurs sens de cette entr&#233;e. Les &#233;l&#233;ments constituant les th&#232;mes sont
appel&#233;s synsets (inspir&#233;s de WordNet) ou blocs s&#233;mantiques. L&#8217;utilisation d&#8217;un tel th&#233;saurus
dans des applications de traitement automatique des langues n&#233;cessite la mise en &#339;uvre d&#8217;un
mod&#232;le s&#233;mantique.
</p>
<p>2.1 Mod&#232;le S&#233;mantique
</p>
<p>Ce mod&#232;le (Vinesse, 2000) s&#8217;inspire de l&#8217;organisation des vocables dans le Dictionnaire Ex-
plicatif et Combinatoire ou DEC ((Mel&#8217;c&#780;uk et al., 1995)). Il permet de repr&#233;senter le po-
tentiel paraphrastique du lexique en permettant &#224; la fois : (1) d&#8217;obtenir, lors de l&#8217;analyse,
des repr&#233;sentations s&#233;mantiques identiques pour des &#233;nonc&#233;s &#233;quivalents et (2) de proposer
plusieurs paraphrases pour une m&#234;me repr&#233;sentation s&#233;mantique lors de la g&#233;n&#233;ration. Le mod-
&#232;le s&#233;mantique propos&#233; par France Telecom R&amp;D repose sur le concept de tribus1. Une tribu
</p>
<p>1Le concept des tribus a &#233;t&#233; propos&#233; par J.Vinesse, responsable du groupe de TALN &#224; France Telecom R&amp;D.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration s&#233;mantico-syntaxique pour la traduction automatique
</p>
<p>est compos&#233;e d&#8217;un ensemble de blocs s&#233;mantique. Dans un bloc s&#233;mantique, on trouve seule-
ment les lexicalisations partageant, en plus d&#8217;une interpr&#233;tation s&#233;mantique commune, un m&#234;me
comportement syntaxique, i.e. ils doivent avoir des r&#233;gimes syntaxiques identiques &#224; savoir :
le m&#234;me nombre de positions syntaxiques et une &#233;quivalence de ces positions une &#224; une et
dans le m&#234;me ordre. Ainsi, les expressions &quot;F.musique&quot; et &quot;S.musica&quot;, (voir figure 1), ap-
partiennent au m&#234;me bloc s&#233;mantique2, car elle partagent, outre un sens commun, un m&#234;me
comportement syntaxique (toutes les deux sont des noms r&#233;alisant la m&#234;me position syntax-
ique). Par contre &quot;F.musicien&quot; et &quot;F.musique&quot;, bien qu&#8217;&#233;tant toutes deux des noms, elles ne
sont pas dans le m&#234;me bloc s&#233;mantique car leurs r&#233;gimes syntaxiques diff&#232;rent. Formelle-
ment, chaque tribu est constitu&#233;e d&#8217;un ensemble de pr&#233;dicats permettant de d&#233;crie les dif-
f&#233;rentes distributions d&#8217;arguments possibles auxquelles seront associ&#233;es les lexicalisations qui
figurent dans la tribu en question. Ainsi la distribution argumentale du pr&#233;dicat INSTRUMEN-
TAL_OPERATION.musique poss&#232;de trois arguments : situation, agent et patient. &quot;F.musicien&quot;
et &quot;E.musician&quot; sont des lexicalisations de l&#8217;argument agent, &quot;F.musique&quot; lexicalise le patient
et &quot;F.musiquer&quot; lexicalise &#224; la fois les deux arguments situation et agent. Pour le pr&#233;dicat
MUSICAL_INSTRUMENT_OPERATION.piano, il n&#8217;existe pas (en fran&#231;ais) de lexicalisa-
tion pour l&#8217;action de &quot;jouer du piano&quot;, mais il y en a une pour l&#8217;agent de cette action (&quot;pi-
aniste&quot;). Nous distinguons deux types de pr&#233;dicats : (1) un pr&#233;dicat de base (INSTRUMEN-
TAL_OPERATION.musique dans l&#8217;exemple) et (2) d&#8217;autres pr&#233;dicats qui sont d&#233;duits &#224; partir
du premier en utilisant ce que nous appelons les Fonctions de Lexicalisation (FdL). Ces Fonc-
</p>
<p>INSTRUMENTAL_OPERATION.musique&#13;
</p>
<p>E.musician NNE P0=agent:human&#13;
F.musicien NHU P0=agent:human   &#13;@musicien_1&#13;
F.musique NFE P0=patient:melody  &#13;@musique_11&#13;
F.oeuvre-musicale PNL P0=patient:melody&#13;
S.m&#250;sica NFE P0=patient:melody&#13;
F.jouer-de-la-musique PNL P0=situation:process/P1=agent&#13;
F.musiquer VBA P0=situation:process/P1=agent:human  &#13;@mu...&#13;
</p>
<p>RELATION_TO&#13;
</p>
<p>LIKING_FOR&#13;
</p>
<p>Tribu&#13;
Arg0 = synset&#13;
Arg1 = synset&#13;
Arg2 = synset&#13;
Arg0 Arg1 = synset&#13;
</p>
<p>FdL&#13;
Arg0' = synset&#13;
Arg0' Arg1' = synset&#13;
</p>
<p>FdL&#13;
Arg0&quot; Arg1&quot; Arg2&quot; = synset&#13;
</p>
<p>F.musical ADJ P0=situation:state/P1=theme:any &#13;@musical_1&#13;
F.musicalement ADV P0=situation:state/P1=theme:any &#13;@mus...&#13;
F.relatif-&#224;-la-musique PNL P0=situation:state/P1=theme:any ...&#13;
</p>
<p>F.musicologue NHU P0=agent:human  &#13;@musicolog&#13;ue&#13;
F.musicologie NFE P0=situation:concep&#13;t &#13;@musicologie&#13;
</p>
<p>F.philharmonique ADJ P0=situation:feeling/P1=experien.....&#13;
S.filarm&#243;nico ADJ P0=situation:feeling/P1=experiencer:human&#13;
</p>
<p>STUDY_OF/ART_OF&#13;
</p>
<p>LOCALISED_RELATION_ACTIVITY.th&#233;&#226;tre&#13;
F.th&#233;&#226;treux NHU P0=agent:human &#13;@theatre_1_29&#13;
P.aktor NMA  P0=agent:human&#13;
F.emplacement-o&#249;-jouent-les-acteurs   PNL P0=location:any&#13;
F.sc&#232;ne   NFE  P0=location:any&#13;
F.th&#233;&#226;tre NMA  P0=location:any &#13;@theatre_1_104&#13;
F. jouer-la-com&#233;die VBA P0=situation/P1=agent/P2=location &#13;@theatre_1_10&#13;
E.play VRB P0=situation/P1=agent/P2=theme &#13;@theatre_1_153&#13;
F.jouer VBA  P0=situation/P1=agent/P2=theme &#13;@theatre_1_153&#13;
</p>
<p>MUSICAL_INSTRUMENT_OPERATION.piano&#13;
F.Piano NMA P0=instrument:musical_intrument &#13;@instrumMusique_2_155&#13;
D.klavier NNE P0=instrument:musical_intrument&#13;
F.pianiste NHU P0=agent:human&#13;
E.pianist NHU P0=agent:human  &#13;@instrumMusique_2_79&#13;
</p>
<p>BAD&#13;
</p>
<p>RELATION_TO&#13;
</p>
<p>F.Pianotage NMA P0=situation/P1=patient/P2=agent&#13;
F.pianoter VBA P0=situation/P1=agent/P2=patient&#13;
F.jouer-maladroitement-du-piano NLP0=situation/P1=&#8230;&#13;
</p>
<p>E.pianistic ADJ P0=situation:state/P1=theme:any&#13;
F.pianistique ADJ P0=situation:state/P1=theme:any&#13;
</p>
<p>LIKING_FOR/ART_OF&#13;
F.m&#233;lomane NHU P0=experiencer:human &#13;@melomane&#13;
</p>
<p>Figure 1: Extraits de tribus
</p>
<p>tions de Lexicalisation permettent de passer d&#8217;un sens &#224; un autre au sein d&#8217;une m&#234;me tribu en re-
groupant les lexicalisations ayant un ensemble de caract&#233;ristiques s&#233;mantiques communes. Ces
lexicalisations donnent, &#224; travers les FdLs, les diff&#233;rents points de vue sur le pr&#233;dicat de base.
Ainsi, par exemple, nous trouvons dans la m&#234;me tribu les deux lexicalisations &quot;F.musicien&quot;
et &quot;F.m&#233;lomane&quot; reli&#233;es par la Fonction de Lexicalisation LIKING_FOR/ART_OF qui signifie
&lt;aimer l&#8217;art de&gt; (m&#233;lomane &#233;tant la personne passionn&#233;e de l&#8217;art que pratique le musicien).
Une FdL n&#8217;est pas propre &#224; une tribu donn&#233;e, au contraire une Fonction de Lexicalisation n&#8217;est
consid&#233;r&#233;e comme telle que si elle est jug&#233;e suffisamment fr&#233;quente et reproduit cette m&#234;me
relation au sein d&#8217;autres tribus. Ces FdLs permettent, &#224; la fois, de donner le sens de la lexicali-
sation et d&#8217;expliciter ses relations avec les autres lexicalisations de la m&#234;me tribu.
</p>
<p>2La d&#233;limitation des blocs s&#233;mantiques &#224; l&#8217;int&#233;rieur de la tribu n&#8217;est pas explicit&#233;e par une marque sp&#233;cifique.
Elle appara&#238;t seulement en comparant les structures argumentales des diff&#233;rentes lexicalisations.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehand Iheddadene
</p>
<p>2.2 Structure Pivot Interlingue
</p>
<p>Dans notre approche, nous consid&#233;rons qu&#8217;il est n&#233;cessaire d&#8217;introduire des m&#233;canismes per-
mettant &#224; la fois d&#8217;expliciter la structure phrastique de l&#8217;&#233;nonc&#233; &#224; traduire et d&#8217;associer &#224; chaque
&#233;l&#233;ment de cet &#233;nonc&#233; une description ind&#233;pendante des langues. Le moyen choisi pour r&#233;aliser
cet objectif est l&#8217;utilisation d&#8217;une structure interlingue mod&#233;lis&#233;e par un graphe s&#233;mantique. Elle
permet d&#8217;identifier les &#233;l&#233;ments de sens individuels constituant la phrase source, leur structure
argumentale (pr&#233;dicat &#224; un, deux,... arguments) et d&#8217;&#233;tablir les connexions predicat-argument
unissant ces diff&#233;rents &#233;l&#233;ments de sens. Le graphe s&#233;mantique de la figure 2 est la structure in-
terlingue des paraphrases ayant pour invariant de sens commun celui v&#233;hicul&#233; par &quot;the pianists
play music with pianos&quot;. Les graphes s&#233;mantiques associ&#233;s &#224; une phrase donn&#233;e sont obtenus
</p>
<p>INSTRUMENTAL_OPERATION.musique&#13;
</p>
<p>X466&#13;
</p>
<p>pateint&#13; theme&#13;
</p>
<p>MUSICAL_INSTRUMENT_OPERATION.piano&#13;
</p>
<p>X464&#13; agent&#13;
</p>
<p>ag
en
</p>
<p>t&#13;
</p>
<p>X465&#13;
situation&#13;
</p>
<p>MUSICAL_INSTRUMENT_OPERATION.piano&#13;
</p>
<p>ins
tru
</p>
<p>me
nt&#13;
</p>
<p>PLURIEL&#13;
</p>
<p>rel_trait&#13;
</p>
<p>PLURIEL&#13;
</p>
<p>TEMPS1&#13;
</p>
<p>rel_
trait
</p>
<p>&#13;
</p>
<p>rel_time&#13;
</p>
<p>LOCALISED_RELATIONAL_ACTIVITY.th&#233;&#226;tre&#13;
</p>
<p>Figure 2: Un graphe s&#233;mantique
</p>
<p>theatre_1_153 [ &#13;PRESENT  TRANSITIF IND 3PRS PLURIEL&#13;]&#13;
{JOUER }&#13;
</p>
<p>SU
J&#13;
</p>
<p> instrumMusique_2_79 [ &#13;NOMBRE/PLURIEL&#13;]&#13;
{ PIANISTE }&#13;
</p>
<p>instrumMusique_2_155 [ &#13;NOMBRE/PLURIEL&#13;]&#13;
{ PIANO }&#13;
</p>
<p>musique_11 [ &#13;]&#13;
{  MUSIQUE }&#13;
</p>
<p>C
IRC
</p>
<p>&#13;OB
JD
</p>
<p>&#13;
</p>
<p>Figure 3: Structure Syntaxique Profonde
</p>
<p>&#224; partir de l&#8217;analyse en d&#233;pendance de cette phrase et des ressources cit&#233;es plus haut. En effet,
les &#233;l&#233;ments d&#233;clenchant les r&#232;gles de construction de la structure interlingue sont les fonctions
syntaxiques pr&#233;sentes dans l&#8217;arbre de d&#233;pendance. Chaque couple d&#8217;unit&#233;s lexicales pleines
li&#233;es par une fonction syntaxique fait &#233;merger dans la structure interlingue, par le biais de leur
unit&#233; s&#233;mantique, des pr&#233;dicats. Ceux-ci seront reli&#233;s entre eux par des actants s&#233;mantiques
calcul&#233;s en utilisant leur sch&#233;ma pr&#233;dicatif. D&#8217;autres r&#232;gles sont utilis&#233;es pour compl&#233;ter les
graphes s&#233;mantiques par des informations aspectuelles et communicatives (topic, focus, etc.)
en inf&#233;rant, &#224; partir de certains traits (syntaxiques et s&#233;mantiques) associ&#233;s aux unit&#233;s lexicales,
des pr&#233;dicats g&#233;n&#233;riques (PLURIEL, TEMPS1, etc.).
</p>
<p>3 G&#233;n&#233;ration S&#233;mantico-Syntaxique
</p>
<p>Dans ce qui suit, nous allons d&#233;crire uniquement3 le premier module de g&#233;n&#233;ration (module de
g&#233;n&#233;ration S&#233;mantico-Syntaxique). Il permet de g&#233;n&#233;rer une structure syntaxique profonde &#224;
partir d&#8217;un graphe s&#233;mantique. Cette structure (figure 3) se pr&#233;sente sous la forme d&#8217;un arbre
de d&#233;pendance dont les arcs sont &#233;tiquet&#233;s par des fonctions syntaxiques reliant des lex&#232;mes
pleins rattach&#233;s aux mots dans le lexique monolingue de la langue cible. Chaque lex&#232;me est
accompagn&#233; par une suite de gramm&#232;mes. Ce module prend en charge les &#233;l&#233;ments suivants :
</p>
<p>3Les autres modules de l&#8217;architecture stratifi&#233;e globale du g&#233;n&#233;rateur ne seront pas d&#233;crits dans cet article
(g&#233;n&#233;ration des structures syntaxiques de surface, ordonnancement syntaxique des mots, g&#233;n&#233;ration morpho-
lexicale des formes fl&#233;chies des mots lin&#233;aris&#233;s, etc.).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration s&#233;mantico-syntaxique pour la traduction automatique
</p>
<p>1- L&#8217;&#233;tape d&#8217;hi&#233;rarchisation a pour objectif de hi&#233;rarchiser le graphe s&#233;mantique par un parcours
permettant d&#8217;obtenir une structure d&#8217;arbre. Si aucun choix n&#8217;est fait sur le n&#339;ud de d&#233;but
de parcours, des risques d&#8217;explosion combinatoire peuvent se produire sur le nombre d&#8217;arbres
produits. Il est donc indispensable de calculer le n&#339;ud qui sera la t&#234;te de la phrase &#224; g&#233;n&#233;rer4.
Dans la version actuelle, nous consid&#233;rons que le n&#339;ud t&#234;te de la phrase cible est le m&#234;me que
celui de la phrase source. Une m&#233;thode de calcul sera mise en &#339;uvre en utilisant les notions de
focus, topic et perspective. L&#8217;algorithme de parcours du graphe s&#233;mantique transite une seule
fois par chaque actant s&#233;mantique (i.e. arc) et constitue, &#224; chaque transition, une branche de
la structure profonde. Lorsque l&#8217;algorithme traverse le m&#234;me n&#339;ud plus d&#8217;une fois, un lien de
co-r&#233;f&#233;rence est alors cr&#233;&#233; dans la structure syntaxique profonde.
</p>
<p>2- Le module de lex&#233;misation a pour r&#244;le de remplacer les pr&#233;dicats interlingues par des lex&#232;mes
de la langue cible qui seront ensuite lexicalis&#233;s, dans le module de g&#233;n&#233;ration syntaxique, en
unit&#233;s lexicales appropri&#233;es. Le choix des lex&#232;mes et des relations syntaxiques est dict&#233; par les
informations contenues dans le mod&#232;le s&#233;mantique, le lexique monolingue et la grammaire de
la langue cible. Comme cit&#233; plus haut, les unit&#233;s lexicales appartenant &#224; la m&#234;me famille sont
regroup&#233;es au sein de la m&#234;me tribu. Ainsi, &#224; partir d&#8217;une tribu et d&#8217;un sch&#233;ma pr&#233;dicatif donn&#233;,
nous pouvons d&#233;duire toutes les lexicalisations paraphrastiques r&#233;alisant chacun des arguments
de ce sch&#233;ma pr&#233;dicatif. En effet, dans un premier lieu, nous r&#233;cup&#233;rons, &#224; partir du mod&#232;le
s&#233;mantique de la langue cible, tous les lex&#232;mes appartenant au m&#234;me pr&#233;dicat. Ensuite, un
tri est effectu&#233; pour garder seulement ceux qui ont la m&#234;me distribution argumentale que celle
identifi&#233;e dans la structure interlingue.
</p>
<p>3- Les relations syntaxiques sont d&#233;duites, d&#8217;une part, des tableaux de r&#233;gimes associ&#233;s pour
chaque unit&#233; lexicale stock&#233;s dans le lexique sous forme d&#8217;un trait appel&#233; FONCPOS et d&#8217;autre
part, du sch&#233;ma pr&#233;dicatif associ&#233; &#224; leurs lex&#232;mes. Le lien est fait gr&#226;ce aux positions profondes
P0, P1, etc. La fonction syntaxique &#233;tiquetant (dans la structure profonde) l&#8217;arc reliant les deux
lex&#232;mes r&#233;alisant le m&#234;me r&#244;le, est calcul&#233;e en utilisant une r&#232;gle grammaticale propre &#224; la
langue cible. Cette r&#232;gle combine les deux relations syntaxiques associ&#233;es &#224; ces deux lex&#232;mes.
</p>
<p>4- Le module utilisant les r&#232;gles s&#233;mantico-syntaxiques &#224; pour objet d&#8217;inf&#233;rer, &#224; partir des pr&#233;di-
cats g&#233;n&#233;riques, des gramm&#232;mes qui seront transmis aux niveaux post&#233;rieurs (g&#233;n&#233;rations syn-
taxique, lexicale, morphologique,...). Ceci permet de contr&#244;ler le calcul de certaines construc-
tions grammaticales et de certains indicateurs morphologiques (temps grammatical, nombre,
genre, d&#233;fini/ind&#233;fini,...) ou encore de faire &#233;merger les lex&#232;mes dits vides (articles, verbes
auxiliaires,...). Ce module utilise un ensemble restreints de r&#232;gles s&#233;mantico-syntaxiques dont
le mod&#232;le est repr&#233;sent&#233; sur la figure 4. Celui-ci met en correspondance un sous graphe qui
contient le r&#244;le d&#233;clencheur de la r&#232;gle et le pr&#233;dicat avec le trait associ&#233; (Predicat_x(trait) ).
</p>
<p>Predicat_x&#13;
</p>
<p>X&#13;
</p>
<p>trait&#13;
</p>
<p>act1&#13; act2&#13;
</p>
<p>Predicat_x (trait)&#13;
</p>
<p>Forme G&#233;n&#233;rale&#13; Exemple&#13;
</p>
<p>MUSICAL_INSTRUMENT_OPERATION.piano&#13;
</p>
<p>X464&#13;
</p>
<p>PLURIEL&#13;
</p>
<p>agent&#13;
rel_trait&#13;
</p>
<p>MUSICAL_INSTRUMENT_OPE&#13;
RATION.piano (pluriel)&#13;
</p>
<p>Figure 4: R&#232;gle s&#233;mantico-syntaxique
</p>
<p>4N&#339;ud dominant selon (Polgu&#232;re, 1990) qui propose une m&#233;thode de calcul de ce n&#339;ud bas&#233;e sur l&#8217;opposition
th&#232;me/rh&#232;me de la structure communicative.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehand Iheddadene
</p>
<p>4 Conclusion
</p>
<p>Les ressources n&#233;cessaires &#224; un logiciel de traduction automatique comprennent toujours un
lexique et une grammaire. La construction de celles-ci est un processus incr&#233;mental souvent
long, cependant, nous avons atteint une couverture suffisamment importante pour proc&#233;der &#224;
la premi&#232;re s&#233;rie de tests. Au 06 Mars 2004, le nombre de tribus construites &#233;tait de 4940
tribus contenant 34372 unit&#233;s lexicales multilingues dont 12571 en fran&#231;ais et 8470 en anglais.
Certains domaines (culture, agriculture, alimentation, etc.) sont majoritairement couverts. Les
premiers r&#233;sultats sont encourageants et plusieurs indications pour r&#233;soudre les probl&#232;mes d&#233;-
tect&#233;s sont en phase de mise en &#339;uvre en exploitant le mod&#232;le s&#233;mantique pr&#233;sent&#233; dans cet
article et particuli&#232;rement les Fonctions de Lexicalisation.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOITET C. (2000). Traduction assist&#233;e par ordinateur. In J. M. PIERREL, Ed., Ing&#233;nierie des langues,
chapter 12, p. 271&#8211;291. HERMES Science Europe.
</p>
<p>FARWELL D. &amp; WILKS Y. (1991). Ultra: a multi-lingual machine translator. In Proceedings of the MT
Summit III, Washington, USA.
</p>
<p>MEL&#8217;C&#780;UK I. (1997). Vers une linguistique Sens-Texte, le&#231;on inaugurale. Paris, Coll&#232;ge de France.
</p>
<p>MEL&#8217;C&#780;UK I., CLAS A. &amp; POLGU&#200;RE A. (1995). Introduction &#224; la lexicologie explicative et combina-
toire, volume 1. Editions Duculot, AUPELF-UREF.
</p>
<p>METZE F., MCDONOUGH J., SOLTAU H. &amp; WAIBEL A. (2002). The nespole! speech-to-speech trans-
lation. In Proceedings of the Second International Conference on Human Language Technology.
</p>
<p>MITAMURA T., NYBERG E. H. &amp; CARBONELL J. G. (1991). An effecient interlingua translation
system for multilingual document production. In Proceedings of the MT SUMMIT III, p. 55&#8211;61.
</p>
<p>NIRENBURG S., RASKIN V. &amp; TUCKER A. (1986). On knowledge-based machine translation. In
Proceedings of the COLING86, p. 627&#8211;632, Columbia University New York, New York, USA.
</p>
<p>POLGU&#200;RE A. (1990). Structuration et mise en jeu proc&#233;durale d&#8217;un mod&#232;le linguistique d&#233;claratif dans
un cadre de g&#233;n&#233;ration de texte. PhD thesis, Universit&#233; de Montr&#233;al, Facult&#233; des &#233;tudes sup&#233;rieures.
</p>
<p>POLGU&#200;RE A. (1998). La Th&#233;orie Sens-Texte. Dialangue, 8-9, Universit&#233; du Qu&#233;bec &#224; Chicoutimi.
</p>
<p>S&#201;RASSET G. &amp; BOITET C. (1999). UNL-french deconversion as transfer &amp; generation from an in-
terlingua with possible quality enhancement through offline human interaction. In Proceedings of the
Machine Translation Summit VII, Singapore.
</p>
<p>VINESSE J. (2000). THEMA, mod&#232;le de s&#233;mantique lexicale. Rapport interne, France Telecom R&amp;D,
Lannion, France.
</p>
<p>WITKAM T. (1988). DLT - an industrial R&amp;D project for multilingual MT. In Proceedings of the
COLING88, Budapest.</p>

</div></div>
</body></html>