<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse macro-s&#233;mantique: vers une analyse rh&#233;torique du discours</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>Analyse macro-s&#233;mantique:
vers une analyse rh&#233;torique du discours
</p>
<p>Antoine Widl&#246;cher
GREYC - Universit&#233; de Caen
awidloch@info.unicaen.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>S&#8217;inscrivant dans les domaines du TAL, de la linguistique sur corpus et de l&#8217;informatique docu-
mentaire, l&#8217;&#233;tude pr&#233;sent&#233;e ici op&#232;re plus pr&#233;cis&#233;ment dans la perspective d&#8217;une analyse macro-
s&#233;mantique de la structuration discursive. Plus sp&#233;cifiquement, nous proposons une analyse s&#233;-
mantique des structures rh&#233;toriques du discours. Apr&#232;s avoir envisag&#233; certaines voies ouvertes
en la mati&#232;re, nous d&#233;finissons notre approche, et pr&#233;sentons les exp&#233;rimentations conduites,
dans le cadre du projet GeoSem, sur les structures &#233;num&#233;ratives dans le domaine g&#233;ographique.
Within the frameworks of automatic NLP, corpus linguistics, and automatic document proces-
sing, this study aims more precisely at a macro-semantic examination of the discursive structu-
ring. Specifically, a semantic study of the rhetorical structures of discourse is here suggested.
After considering existing approaches, we present our own methodology, and relate experimen-
tations, as part of the GeoSem project, on enumerative structures in geographical corpus.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Macro-s&#233;mantique, analyse rh&#233;torique, structure du discours, extraction d&#8217;information
Macro-semantics, rhetorical analysis, discourse structuring, information retrieval
</p>
<p>1 Vers une analyse rh&#233;torique
</p>
<p>Dans les domaines du TAL, de la linguistique sur corpus et de l&#8217;informatique documentaire, cette
&#233;tude vise plus pr&#233;cis&#233;ment l&#8217;analyse macro-s&#233;mantique des structures rh&#233;toriques du discours,
c&#8217;est-&#224;-dire des modes d&#8217;organisation du discours consid&#233;r&#233; &#224; un niveau de granularit&#233; &#233;lev&#233;.
Sur l&#8217;aspect s&#233;mantique, disons simplement que, loin de nous en tenir &#224; une caract&#233;risation
des formes de surface du discours, nous visons au contraire la d&#233;termination du sens qui s&#8217;y
propage, de la signification engag&#233;e dans telle ou telle organisation formelle de surface. Nous
pr&#233;tendons du reste adopter un point de vue macro-s&#233;mantique. Si l&#8217;analyse s&#233;mantique au ni-
veau lexical ou infra-lexical nous donne acc&#232;s &#224; des atomes de signification, et si l&#8217;analyse au
niveau syntagmatique, propositionnel ou phrastique d&#233;livre des mol&#233;cules de sens caract&#233;ris&#233;es</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher
</p>
<p>par une relative divisibilit&#233; et par une certaine unit&#233; de sens, pour notre part, nous observons le
discours &#224; un niveau de granularit&#233; sup&#233;rieur, en &#233;tudiant l&#8217;organisation de ces unit&#233;s de sens au
sein de structures plus vastes que nous qualifions de macro-mol&#233;cules de signification. Cepen-
dant, il ne s&#8217;agit pas simplement de proposer un niveau de granularit&#233; suppl&#233;mentaire, mais de
nous placer au point de vue du discours consid&#233;r&#233; dans sa globalit&#233;, pour percevoir les modes
d&#8217;organisation assurant sa coh&#233;rence et son unit&#233;. Par ailleurs, notre d&#233;marche se veut rh&#233;to-
rique. Il ne s&#8217;agit pas seulement de rep&#233;rer des parties du discours, ni de concevoir ce dernier
comme leur simple juxtaposition, mais d&#8217;adopter un point de vue logique sur l&#8217;organisation dis-
cursive, afin de mettre en &#233;vidence sa dimension fondamentalement relationnelle et d&#8217;envisager
la mani&#232;re dont les sous-&#233;l&#233;ments interagissent.
</p>
<p>&#192; vrai dire, les applications possibles d&#8217;une telle approche sont nombreuses dans le domaine de
l&#8217;informatique documentaire. S&#8217;il s&#8217;agit bien, in fine, de produire une repr&#233;sentation s&#233;mantique
du document en consid&#233;rant non pas seulement son contenu informationnel, mais &#233;galement les
principes organisationnels proc&#233;dant &#224; sa structuration, il va sans dire que le b&#233;n&#233;fice en mati&#232;re
d&#8217;indexation sera tout &#224; fait essentiel. Il deviendra possible d&#8217;indexer un document non plus
seulement comme pr&#233;sentant, par exemple, des informations sur Basse-Normandie et Bretagne,
mais comme &#233;tablissant une relation entre ces informations. Incidemment les possibilit&#233;s en
mati&#232;re de recherche d&#8217;information seront elles aussi renforc&#233;es. Nous pourrons envisager des
requ&#234;tes de la forme : &#171; les documents dans lesquels il est question de Basse-Normandie et de
Bretagne et dans lesquels ces r&#233;gions sont mises en relation de contraste &#187; ou &#171; les documents
dans lesquels le fait B est d&#233;duit de A &#187;. Par ailleurs, certains motifs rh&#233;toriques s&#8217;av&#232;rent ef-
ficaces pour l&#8217;extraction d&#8217;information. En proc&#233;dant par exemple, par concentration du propos,
ils permettent de capter une information globale que le reste du discours diffuse. L&#8217;extrait 1
fournira l&#8217;exemple d&#8217;une amorce hyperonymique qui joue tr&#232;s pr&#233;cis&#233;ment ce r&#244;le. On pourra
envisager un syst&#232;me de r&#233;sum&#233; automatique reposant sur l&#8217;exploitation de tels principes.
</p>
<p>Parall&#232;lement &#224; une &#233;tude g&#233;n&#233;rale de la rh&#233;torique et de sa port&#233;e en TAL, une part importante
de notre travail a consist&#233; &#224; &#233;valuer la pertinence de notre approche dans une perspective plus
limit&#233;e, dans le cadre du projet GeoSem (Enjalbert et al., 2003; Bilhaut et al., 2003a). D&#233;di&#233; au
traitement s&#233;mantique du document g&#233;ographique, ce projet a concentr&#233; une part importante de
son activit&#233; &#224; l&#8217;analyse de la &#171; dimension &#187; textuelle de l&#8217;information g&#233;ographique, en obte-
nant en particulier de bons r&#233;sultats en mati&#232;re de d&#233;tection d&#8217;expressions temporelles (Bilhaut
et al., 2003b) et spatiales (Mathet et al., 2003), en op&#233;rant principalement &#224; des niveaux de
granularit&#233; d&#8217;ordre syntagmatique ou propositionnel. Nous nous sommes fix&#233; pour t&#226;che d&#8217;en-
visager un traitement s&#233;mantique des structures discursives de plus haut niveau, mais pouvant
tirer b&#233;n&#233;fice des r&#233;sultats obtenus sur ces micro-structures, en limitant notre investigation &#224; ce
micro-domaine particulier, et &#224; un motif rh&#233;torique particulier : la structure &#233;num&#233;rative.
</p>
<p>2 &#201;l&#233;ments bibliographiques
En amont des tentatives computationnelles d&#8217;exploitation du ph&#233;nom&#232;ne rh&#233;torique, du c&#244;t&#233;
des approches logico-philosophiques et linguistiques, nous pouvons tout d&#8217;abord nous arr&#234;ter
sur (Aristote, b; Aristote, a) o&#249; ARISTOTE jette les bases d&#8217;une v&#233;ritable th&#233;orie syst&#233;matique
de la composition du discours, en mettant rh&#233;torique et argumentation au c&#339;ur de sa r&#233;flexion.
&#192; travers en particulier la distinction entre raisonnement analytique et raisonnement dialectique
nous y trouvons des r&#233;flexions fondatrices sur les rapports entre rh&#233;torique et logique, entre rh&#233;-
torique et argumentation, ainsi que sur la dimension fondamentalement intentionnelle, finalis&#233;e</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse macro-s&#233;mantique: vers une analyse rh&#233;torique du discours
</p>
<p>de ces derni&#232;res. Si la succession d&#8217;ARISTOTE a proc&#233;d&#233; &#224; l&#8217;appauvrissement du champ d&#8217;ap-
plication de la discipline en faisant tendre celle-ci vers une simple taxinomie des figures, th&#233;orie
de l&#8217;ornementation et des effets, (Perelman, 1977), en renouant avec la tradition aristot&#233;licienne,
vise le retour &#224; l&#8217;&#233;tude de la composition du discours et de l&#8217;argumentation. Sans discuter son
choix de consid&#233;rer la rh&#233;torique comme la rencontre de l&#8217;intention d&#8217;un auteur (dimension fi-
nalis&#233;e) et d&#8217;un auditoire &#224; convaincre (dimension socialis&#233;e), nous cherchons pour notre part &#224;
privil&#233;gier une approche bas&#233;e sur la seule structure effective du discours.
</p>
<p>En TAL, nous trouvons tout d&#8217;abord certaines th&#233;ories g&#233;n&#233;ralistes visant la mod&#233;lisation de la
dimension rh&#233;torique du discours, en g&#233;n&#233;ral. (Mann &amp; Thompson, 1987), &#224; travers la proposi-
tion d&#8217;une Rhetorical Structure Theory, ouvrent la voie &#224; une &#233;tude computationnelle des rela-
tions rh&#233;toriques, par l&#8217;&#233;laboration d&#8217;une typologie pr&#233;cise des relations bas&#233;e sur un mod&#232;le en
termes de noyau et de satellite, et sur la sp&#233;cification des interactions qu&#8217;elles &#233;tablissent entre
les &#233;l&#233;ments en pr&#233;sence. Avec (Grosz &amp; Sidner, 1986) se trouve mise en &#233;vidence la dimension
intentionnelle de la structure rh&#233;torique : l&#8217;inf&#233;odation du discours &#224; un but du locuteur en d&#233;ter-
mine la structure. Les successeurs de ces deux th&#233;ories fondatrices envisagent une conciliation
des points de vue adopt&#233;s. La distinction entre structure informationnelle et structure intention-
nelle, amorc&#233;e par la RST et radicalis&#233;e en ces termes par (Moore &amp; Pollack, 1992), devient, en
particulier, tout &#224; fait centrale. Elle oppose les organisations du discours fond&#233;es sur la structure
du r&#233;el (structures informationnelles) &#224; celles qui reposent sur l&#8217;intention de l&#8217;auteur (struc-
tures intentionnelles). Cependant, nous consid&#233;rons trop restrictive l&#8217;&#233;chelle &#224; laquelle op&#232;rent
ces th&#233;ories : s&#8217;int&#233;ressant principalement aux encha&#238;nements d&#8217;ordre syllogistique entre syn-
tagmes, propositions et phrases, et adoptant une lecture ascendante de la composition textuelle,
elles renoncent &#224; certaines structures que nous consid&#233;rons comme pertinentes.
</p>
<p>Enfin, toujours dans le champ du TAL, il s&#8217;av&#232;re &#233;galement fructueux de nous int&#233;resser &#224; des
travaux visant l&#8217;&#233;tude d&#8217;organisations discursives sp&#233;cifiques telles que les structures &#233;num&#233;-
ratives. Si les recherches pr&#233;sent&#233;es dans (Garcia-Debanc et al., 2002) nous permettent sur ce
point d&#8217;isoler certains concepts essentiels, notre propre optique s&#8217;en &#233;carte cependant assez lar-
gement : ces travaux s&#8217;appuient sur l&#8217;organisation typo-dispositionnelle du document, quand
nous envisageons, au contraire, de nous baser int&#233;gralement sur son analyse discursive.
</p>
<p>3 Mod&#232;le de l&#8217;organisation du discours
</p>
<p>L&#8217;extrait 1 de notre corpus1 permettra d&#8217;entrevoir les diff&#233;rents &#233;l&#233;ments dont nous visons l&#8217;ana-
lyse. Trois blocs textuels cons&#233;cutifs pr&#233;sentent chacun une r&#233;gion g&#233;ographique (&#171; Pays de
la Loire &#187;, ...), du point de vue d&#8217;un ph&#233;nom&#232;ne (Bilhaut et al., 2003a) commun (ici, des
r&#233;sultats d&#8217;&#233;lections). Ils constituent trois items d&#8217;une &#233;num&#233;ration. Entre ces &#233;l&#233;ments co-
&#233;num&#233;r&#233;s, nous observons la sp&#233;cification d&#8217;une relation : la &#171; situation est identique &#187; en
Basse-Normandie et dans les Pays de la Loire, et cette similarit&#233; vaut encore entre Bretagne
et Basse-Normandie. L&#8217;environnement imm&#233;diat de l&#8217;&#233;num&#233;ration r&#233;v&#232;le qu&#8217;elle est englob&#233;e
dans une structure plus vaste que nous qualifions de structure &#233;num&#233;rative, introduite par une
amorce hyperonymique dans laquelle est indiqu&#233;e la classe (&#171; r&#233;gions de l&#8217;Ouest &#187;) dont les
items sont les instances et qui pr&#233;sente une loi g&#233;n&#233;rale ensuite valid&#233;e pour chacun des items.
</p>
<p>Ainsi, nous avons tout d&#8217;abord vu &#233;merger diff&#233;rents blocs textuels caract&#233;ris&#233;s par un certain
degr&#233; de coh&#233;sion s&#233;mantique, ou disons, d&#8217;unit&#233; de sens. Les items, l&#8217;&#233;numuration ou m&#234;me
</p>
<p>1Pascal BUL&#201;ON. Quarante ann&#233;es d&#8217;&#233;volution politique de l&#8217;Ouest de la France : 1960-2000.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher
</p>
<p>Les h&#233;ritages politiques historiques l&#8217;expliquent en grande partie. Les r&#233;gions de l&#8217;Ouest font coexister ce cocktail :
meilleures terres d&#8217;influence de Droite coexistant avec points d&#8217;ancrage forts de Gauche et des Ecologistes et faiblesse
relative du Front National.
</p>
<p>A ce premier tour de 1997, la Droite passe rarement au-dessus de la barre des 40 %. Dans les Pays de la Loire , pour
la premi&#232;re fois, elle n&#8217;a aucun &#233;lu de premier tour, les reculs des sortants sont consid&#233;rables [...]
</p>
<p>En Basse-Normandie , la situation est identique . Un seul d&#233;put&#233; sortant passe au premier tour : Ren&#233; Andr&#233;, RPR &#224;
Avranches, mais perd 9 points. Partout la Droite recule, particuli&#232;rement dans la moiti&#233; nord de la r&#233;gion [...]
</p>
<p>En Bretagne , le balancier est, cette fois encore , pouss&#233; plus loin &#224; Gauche dans beaucoup de circonscriptions. Seul
Pierre M&#233;haignerie, UDF, repasse au premier tour avec 51,4 %, en recul de 11 points. [...]
</p>
<p>Extrait 1: Exemple de structure &#233;num&#233;rative
</p>
<p>la structure &#233;num&#233;rative consid&#233;r&#233;e dans sa globalit&#233; constituent de telles unit&#233;s que nous nom-
mons r&#233;gions rh&#233;toriques et qui repr&#233;sentent le premier objet de l&#8217;analyse rh&#233;torique. Nous
avons par ailleurs observ&#233; l&#8217;articulation du discours autour de certaines structures proc&#233;dant &#224;
l&#8217;organisation de l&#8217;information. Nous nommons sch&#233;mas rh&#233;toriques de tels principes organi-
sationnels. &#192; ce niveau de r&#233;flexion, nous retrouvons l&#8217;&#233;num&#233;ration et la structure &#233;num&#233;rative
pr&#233;sentes dans l&#8217;extrait propos&#233;, mais pouvons &#233;galement citer &#224; titre d&#8217;exemple les structures
d&#233;monstratives ou les structures m&#233;r&#233;ologiques. Enfin, et cet aspect constitue le troisi&#232;me &#233;l&#233;-
ment fondamental de la structuration discursive, nous avons vu appara&#238;tre des interactions que
nous qualifions de relations rh&#233;toriques entre les diff&#233;rents &#233;l&#233;ments de sens entrant dans la
composition des sch&#233;mas rh&#233;toriques. Ainsi, &#224; l&#8217;int&#233;rieur de la structure &#233;num&#233;rative, nous
avons observ&#233; la pr&#233;sence d&#8217;une relation de similarit&#233; entre les items co-&#233;num&#233;r&#233;s et d&#8217;une
relation de type th&#232;se / instanciation entre amorce et &#233;num&#233;ration.
</p>
<p>4 Exp&#233;rimentations sur le discours g&#233;ographique
</p>
<p>Le travail men&#233; dans le cadre du projet GeoSem r&#233;pond &#224; plusieurs d&#233;limitations de notre do-
maine d&#8217;investigation. Tout d&#8217;abord, nous nous limitons &#224; l&#8217;&#233;tude d&#8217;un sch&#233;ma rh&#233;torique par-
ticulier : la structure &#233;num&#233;rative. Par ailleurs, le domaine est d&#233;fini (domaine g&#233;ographique),
et nous nous autorisons l&#8217;acc&#232;s &#224; certaines connaissances pr&#233;alables &#224; son &#233;gard : profitant du
fait que ce monde r&#233;el soit fortement structur&#233;, nous nous appuyons par exemple sur une pr&#233;-
connaissance de son organisation (le d&#233;partement de la Manche est en Basse-Normandie...).
Nous pourrons par ailleurs tirer profit des connaissances acquises aux niveaux de granularit&#233;
inf&#233;rieurs, fournies par exemple par les analyseurs spatiaux et temporels d&#233;j&#224; &#233;voqu&#233;s. D&#8217;autre
part, le corpus envisag&#233; est fondamentalement descriptif et nous pouvons nous attendre &#224; ce
qu&#8217;il existe, entre ce monde r&#233;el (repr&#233;sentation conventionnelle) et le monde d&#233;crit (repr&#233;sen-
tation discursive), un certain parall&#233;lisme. De plus, ce corpus se caract&#233;rise par un style assez
expositif et presque p&#233;dagogique d&#8217;o&#249; il r&#233;sulte une grande lisibilit&#233; de la structure discursive.
L&#8217;analyse rh&#233;torique proc&#232;de ici en deux temps : la d&#233;tection du sch&#233;ma rh&#233;torique de type
structure &#233;num&#233;rative d&#8217;une part, et l&#8217;analyse des relations rh&#233;toriques entre items d&#8217;autre part.
En sortie, nous visons &#224; la fois la segmentation du texte en cons&#233;quence, et la production d&#8217;une
structure de traits fournissant l&#8217;interpr&#233;tation s&#233;mantique associ&#233;e (Fig. 1). Pour la d&#233;tection</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse macro-s&#233;mantique: vers une analyse rh&#233;torique du discours
</p>
<p>des structures &#233;num&#233;ratives et de l&#8217;organisation hyperonymique, l&#8217;analyseur s&#8217;appuie sur la
structuration informationnelle du discours. Le domaine g&#233;ographique est fortement structur&#233;
et peut &#234;tre au moins partiellement connu du syst&#232;me : l&#8217;analyseur dispose, en entr&#233;e, d&#8217;une
pr&#233;-connaissance hi&#233;rarchique du monde g&#233;ographique (Caen est une ville du Calvados, qui est
un d&#233;partement de Basse-Normandie...). D&#8217;autre part, le discours analys&#233;, fondamentalement
descriptif, pr&#233;sente un certain degr&#233; de transparence entre le monde qu&#8217;il d&#233;crit et la description
qu&#8217;il en donne. La d&#233;tection de structures &#233;num&#233;ratives peut donc s&#8217;appuyer sur cette propri&#233;t&#233;
informationnelle et proc&#232;der par d&#233;tection d&#8217;isomorphismes entre discours et domaine.
</p>
<p>L&#8217;analyse des relations rh&#233;toriques existant entre les items consiste principalement &#224; interroger
les relations de contraste et de similarit&#233;, telles qu&#8217;&#233;tudi&#233;es dans (Widl&#246;cher et al., 2004), sous le
nom de CURS (Contrast/Uniformity Relational Structures). L&#8217;analyseur s&#8217;appuie tout d&#8217;abord
sur une s&#233;rie d&#8217;indices fr&#233;quents et fiables de type cue-phrases qui manifeste la pr&#233;sence de
relations de cette nature. L&#8217;exemple pr&#233;sent&#233; plus haut en donne un aper&#231;u &#224; travers l&#8217;usage
qu&#8217;il fait des expressions comme &#171; la situation est identique &#187;. Nous parlons alors de mise en
relation rh&#233;torique explicite. D&#8217;autres indices plus t&#233;nus et implicites peuvent &#234;tre utilis&#233;s, de
mani&#232;re incr&#233;mentale : la confirmation du sens attribuable &#224; tel indice par tel autre permettra
d&#8217;avancer. Il est tout d&#8217;abord possible de d&#233;duire la relation par comparaison des repr&#233;sentations
s&#233;mantiques obtenues pour chacun des &#233;l&#233;ments en pr&#233;sence. Notre exemple (voir Fig. 1), r&#233;v&#232;le
ainsi que chacun des items est caract&#233;ris&#233; par la pr&#233;sence forte d&#8217;informations relatives &#224; la
droite (&#171; la Droite &#187;, &#171; RPR &#187;...) et qu&#8217;il existe donc une certaine similarit&#233; entre les trois
r&#233;gions sur ce plan. Nous parlons alors de mise en relation rh&#233;torique par comparaison des
repr&#233;sentations isol&#233;es. En ce sens, un usage efficace peut &#234;tre fait des marques de quantification
effective (15.000, 16%...) ou connot&#233;e (recul, augmentation...). Dans l&#8217;extrait, nous apprenons
ainsi que la similarit&#233; porte plus pr&#233;cis&#233;ment sur le recul de la droite dans chacune des r&#233;gions.
</p>
<p>L&#8217;impl&#233;mentation d&#8217;un premier analyseur fond&#233; sur ces principes &#224; &#233;t&#233; r&#233;alis&#233;e sous la forme
d&#8217;un module pour la plate-forme LinguaStream2. Il offre de bons r&#233;sultats quand la structura-
tion discursive est relativement marqu&#233;e. L&#8217;extrait de corpus propos&#233; plus haut en fournit un
exemple, et correspond &#224; une sortie effective de notre analyseur (Fig. 1).
</p>
<p>5 Perspectives
</p>
<p>Il conviendra tout d&#8217;abord, &#224; pr&#233;sent, de valider nos hypoth&#232;ses et l&#8217;analyseur propos&#233;, sur
un corpus plus large et moins &#171; favorable &#187;. Plus fondamentalement, nous envisageons de d&#233;-
passer les restrictions m&#233;thodologiques et d&#8217;aborder d&#8217;autres sch&#233;mas rh&#233;toriques (progres-
sion th&#233;matique, d&#233;monstration...) et d&#8217;autres relations rh&#233;toriques (celles de la RST, loi g&#233;-
n&#233;rale/variations contextuelles...). D&#8217;autre part, si notre corpus nous a conduit &#224; privil&#233;gier la
structuration informationnelle du discours, ancr&#233;e dans la structure du domaine, nous envisage-
rons &#224; pr&#233;sent sa dimension intentionnelle, en abordant des corpus plus propices &#224; cette &#233;tude
(discours politiques...). Enfin, dans la continuit&#233; de cette prise en compte de l&#8217;intentionnalit&#233;,
nous suivrons dor&#233;navant une orientation plus logique en abordant la dimension argumenta-
tive de l&#8217;organisation discursive, et en envisageant les assouplissements de la logique pouvant
conduire &#224; une logique naturelle capable d&#8217;en rendre compte. Sur ce point, on pourra se deman-
der si la rh&#233;torique des figures, si l&#8217;approche plus stylistique de la rh&#233;torique, ne r&#233;pond pas
pr&#233;cis&#233;ment au besoin d&#8217;une logique souple propre &#224; d&#233;crire l&#8217;&#233;laboration du discours.
</p>
<p>2http://www.linguastream.org.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine Widl&#246;cher
</p>
<p>FIG. 1 &#8211; Sortie de l&#8217;analyseur
</p>
<p>R&#233;f&#233;rences
ARISTOTE (a). Organon. Paris : Vrin.
ARISTOTE (b). Rh&#233;torique. Tel. Gallimard.
BILHAUT F., CHARNOIS T., ENJALBERT P. &amp; MATHET Y. (2003a). Passage extraction in geographi-
cal documents. In Proceedings of New Trends in Intelligent Information Processing and Web Mining,
Zakopane, Poland.
BILHAUT F., HO-DAC M., BORILLO A., CHARNOIS T., ENJALBERT P., LE DRAOULEC A., MATHET
Y., MIGUET H., PERY-WOODLEY M.-P. &amp; SARDA L. (2003b). Indexation discursive pour la navi-
gation intradocumentaire : cadres temporels et spatiaux dans l&#8217;information g&#233;ographique. In Actes de
Traitement Automatique du Langage Naturel (TALN), Batz-sur-Mer, France.
ENJALBERT P. et al. (2003). Projet G&#233;oSem. Traitements s&#233;mantiques pour l&#8217;Information G&#233;ogra-
phique : textes, cartes, graphiques. Rapport interne.
GARCIA-DEBANC C. et al. (2002). Structures spatio-linguistiques du texte : traitements formels et
cognitifs. Rapport interne.
GROSZ B. J. &amp; SIDNER C. L. (1986). Attention, intention, and the structure of discourse. Computatio-
nal Linguistics, 12(3), 175&#8211;204.
MANN W. C. &amp; THOMPSON S. A. (1987). Rhetorical Structure Theory : A theory of Text Organization.
Rapport interne ISI-RS-87-190, ISI : Information Sciences Institute, Marina del Rey, CA.
MATHET Y., CHARNOIS T., ENJALBERT P. &amp; BILHAUT F. (2003). Geographic reference analysis for
geographic document querying. In Proceedings of Workshop on the Analysis of Geographic References,
Human Language Technology Conference (NAACL-HLT), Edmonton, Alberta, Canada.
MOORE J. D. &amp; POLLACK M. E. (1992). A problem for RST : The need for multi-level discourse
analysis. Computational Linguistics, 18(4), 537&#8211;544.
PERELMAN C. (1977). L&#8217;Empire Rh&#233;torique. Rh&#233;torique et Argumentation. Paris : Librairie Philoso-
phique J.VRIN. Seconde &#233;dition 2002.
WIDL&#214;CHER A., FAUROT E. &amp; BILHAUT F. (2004). Multimodal Indexation of Contrastive Structures
in Geographical Documents. In Proceedings of RIAO 2004, Avignon, France. &#192; para&#238;tre.</p>

</div></div>
</body></html>