<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Syst&#232;me d'extraction d'information d&#233;di&#233; &#224; la veille Qui est qui? Qui fait quoi? O&#249;? Quand? Comment?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004 
</p>
<p>Syst&#232;me d'extraction d'information d&#233;di&#233; &#224; la veille                            
Qui est qui? Qui fait quoi? O&#249;? Quand? Comment? 
</p>
<p>Asma BOUHAFS  
</p>
<p>&#201;quipe Langages, Logiques, Informatique, Cognition et Communication 
(LaLICC) (UMR 8139) CNRS - Universit&#233; de Paris Sorbonne    
</p>
<p> 96, Boulevard Raspail 75006 PARIS &#8211; France 
 asma_bouhafs@yahoo.com 
</p>
<p>Mots-clefs &#8211; Keywords  
Classes s&#233;mantiques,  Extraction d&#8217;information, Exploration Contextuelle, Ressources, 
R&#233;seau s&#233;mantique. 
</p>
<p>Semantic classes, Information Extraction, Contextual Exploration, Resources, Semantic 
network. 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
Dans cet article nous pr&#233;sentons un outil d&#8217;extraction d&#8217;information d&#233;di&#233; &#224; la veille qui 
r&#233;pond &#224; un certain nombre de requ&#234;tes formul&#233;es par l'utilisateur, en combinant la puissance 
des outils et les ressources informatiques &#224; une analyse linguistique. Cette analyse linguistique 
permet le rep&#233;rage des entit&#233;s nomm&#233;es (acteurs, lieux, temps,&#8230;) ainsi que la mise en relation 
des acteurs avec leur environnement dans l'espace et le temps au moyen d'indices 
d&#233;clencheurs, d&#8217;indices compl&#233;mentaires et de r&#232;gles qui les combinent, c'est le principe de 
l'Exploration Contextuelle. Les r&#233;sultats capitalis&#233;s dans des fichiers XML, sont propos&#233;s par 
le biais d&#8217;une interface, soit sous forme de graphes soit sous forme de base d'informations. 
</p>
<p>In this article we present an information extraction tool which answers a certain number of 
requests formulated by the user, by combining data-processing with a linguistic analysis. This 
linguistic analysis allows the location of the named entities (actors, places, time...) thus the 
relations between actors and their environments in space and time by means of indices, 
indicators and rules which combine them, it is the principle of Contextual Exploration. The 
results capitalized in XML files are presented in an interface, either in the form of graphs or in 
the form of databases. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Asma BOUHAFS 
</p>
<p>1 Introduction et probl&#233;matique g&#233;n&#233;rale 
Que cela soit au niveau d&#8217;un individu, d&#8217;une entreprise ou d&#8217;une nation, anticiper les 
&#233;volutions de son environnement est vital pour maintenir ou d&#233;velopper sa comp&#233;titivit&#233;. 
L&#8217;information est au c&#339;ur d&#8217;une telle d&#233;marche d&#8217;intelligence strat&#233;gique, &#233;conomique et 
sociale. En effet, l'augmentation de la quantit&#233; d'information disponible sous forme de 
documents &#233;lectroniques &#233;crits en langue naturelle rend pressant le besoin de processus 
intelligents pour traiter de tels textes. Les m&#233;thodes de compr&#233;hension de textes ainsi que 
l'Extraction d'Information (EI) apparaissent comme particuli&#232;rement attrayantes et utiles. L'EI 
a &#233;t&#233; d&#233;finie restrictivement par le programme DARPA MUC (Message Understanding 
Conference, 92-98), comme la t&#226;che consistant &#224; extraire des informations sp&#233;cifiques et bien 
d&#233;finies &#224; partir de textes &#233;crits en langue naturelle dans des domaines restreints, avec 
l'objectif sp&#233;cifique de remplir automatiquement des formulaires pr&#233;d&#233;finis ou des bases de 
donn&#233;es. Dans cet article nous d&#233;crivons un outil d&#8217;extraction d&#8217;information pour un objectif 
de veille: Pour mettre en &#233;vidence ces informations pertinentes &#224; extraire, les veilleurs 
disposent d&#8217;outils de collecte et de traitement de l&#8217;information qui utilisent des approches 
traditionnelles (essentiellement statistiques et quantitatives) se r&#233;v&#233;lant souvent insuffisantes. 
Pour &#234;tre efficaces, ces outils doivent int&#233;grer diverses techniques provenant de l&#8217;analyse 
linguistique, de l&#8217;intelligence artificielle et de l&#8217;ing&#233;nierie des connaissances. Ces techniques 
offrent un cadre m&#233;thodologique de gestion de l&#8217;information efficace et adaptable &#224; une t&#226;che 
sp&#233;cifique, complexe et probl&#233;matique comme la veille strat&#233;gique. Par exemple dans le 
domaine du terrorisme le syst&#232;me tentera d&#8217;extraire les noms des terroristes, des victimes, le 
nombre de victimes, le type d&#8217;arme utilis&#233;e, la date de l&#8217;action terroriste. Dans une soci&#233;t&#233; ou 
compagnie, elle permettrait, par exemple, de surveiller les agissements des diff&#233;rents 
protagonistes d'une transaction commerciale ou encore d'extraire les noms de compagnies 
impliqu&#233;es, la part de capital investie par ces compagnies, le nom de la nouvelle compagnie 
ainsi form&#233;e et son secteur d&#8217;activit&#233;.  
</p>
<p>2 Syst&#232;me d&#8217;extraction d&#8217;information d&#233;di&#233; &#224; la veille: JavaVeille 
Notre syst&#232;me (JavaVeille) est un syst&#232;me d'extraction d'information d&#233;di&#233; &#224; la veille, qui  
doit offrir un certain nombre de fonctionnalit&#233;s selon le contexte d'utilisation. Il r&#233;pond &#224; un 
certain nombre de question du style: qui est qui? ( qui sont les acteurs ou actants du domaine 
&#233;conomique, social et politique &#8230;), qui fait quoi? (quelles sont les actions de ces acteurs, sur 
quels objets portent-elles et comment s&#8217;effectuent-elles ?), qui est en relation avec qui : 
quelles sont leurs relations avec l'environnement qui les entoure (les autres actants, leur 
travail&#8230;), o&#249; ? (o&#249; ont lieu les actions et les relations en question ?), quand? ( quand ont-elles 
eu lieu ? ), pour quel montant? (dans le cas du domaine &#233;conomique.), etc. 
</p>
<p>2.1 Syst&#232;me int&#233;grant une analyse linguistique 
</p>
<p>Lors de la conception des syst&#232;mes d'extraction d'information actuels, il est  de plus en plus 
difficile de se passer d&#8217;une approche s&#233;mantique pour la description des significations et leur 
organisation th&#233;orique. La ma&#238;trise de la gestion s&#233;mantique des informations est primordiale 
pour l&#8217;acc&#232;s au sens d&#8217;un document. Cela impose de s&#8217;appuyer sur une organisation 
s&#233;mantique th&#233;orique et op&#233;ratoire accompagn&#233;e d&#8217;une strat&#233;gie de recherche d&#8217;information et </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me d'extraction d'information d&#233;di&#233; &#224; la veille 
</p>
<p>d&#8217;extraction d'information porteuse de sens. Nous &#233;voquons &#224; titre d'exemple le r&#233;seau des 
cat&#233;gories et sous cat&#233;gories s&#233;mantiques associ&#233;es aux notions &quot;interrelation entre actants 
(individus, collectifs)&quot; et &quot;&#233;tats affectant ou approuv&#233;s par un actant&quot; (figure 1). 
</p>
<p> 
</p>
<p>C o A c t i o n
C o n f r o n t a t i o n   
</p>
<p>&#201; t a t s
</p>
<p>N &#233; g o c i a t i o n  
</p>
<p>C o L o c a t i o n  
</p>
<p>C o m m u n i c a t i o n  
</p>
<p>O p i n i o n   
</p>
<p>C o o p &#233; r a t i o n   
</p>
<p>A p p r &#233; c i a t i o n  
</p>
<p>T r a n s a c t i o n  
</p>
<p>S o u h a i t   
A t t i t u d e   
</p>
<p>C o m m u n i q u e r  a v e c ,  a p p e l e r  
</p>
<p>R e n c o n t r e r ,  s &#8217; e n t r e t e n i r  a v e c   
</p>
<p>A c c u s e r ,  a t t a q u e r ,  g u e r r e  e n t r e   
</p>
<p>N &#233; g o c i e r  a v e c ,  p o u r p a r l e r  e n t r e  
</p>
<p>C o o p &#233; r e r  a v e c ,  a i d e r
</p>
<p>C r o i r e  q u e ,  p r &#233; v o i r ,  p e n s e r  q u e  
</p>
<p>S o u h a i t e r ,  e s p &#233; r e r
</p>
<p>D &#233; t e s t e r ,  a i m e r ,
</p>
<p>&#201; v o l u t i o n  
S o c i a l e
</p>
<p>P r o m o u v o i r ,  m o n t e r  
e n  g r a d e . .
</p>
<p>R &#233; a l i s a t i o n  R &#233; a l i s e r ,  t r a v a i l l e  s u r ,  
</p>
<p>V e n t e - D i s s o l u t i o n  
</p>
<p>A c q u i s i t i o n
</p>
<p>C r &#233; a t i o n  
</p>
<p>N o m i n a t i o n  
</p>
<p>V e n d r e ,  c &#233; d e r ,  
</p>
<p>A c h e t e r ,  a c q u &#233; r i r ,
</p>
<p>M o n t e r ,  c r &#233; e r  ,
</p>
<p> 
</p>
<p>Figure 1: R&#233;seaux d'indices des &#233;tats et des relations associ&#233;es aux Actants 
</p>
<p>2.2 Corpus de travail  
</p>
<p>Le rep&#233;rage d&#8217;informations pertinentes n&#233;cessite de cibler pr&#233;cis&#233;ment les informations utiles 
et pertinentes dans un cadre de veille. Nous avons choisi de travailler sur des textes qui 
d&#233;veloppent explicitement les types de relations entre actants  et leurs environnements. Un 
grand nombre de ces textes  est disponible sur le Web. Ces d&#233;p&#234;ches articles et communiqu&#233;s 
de presse (Le Monde, Lib&#233;ration, AFP&#8230;) forment des textes r&#233;els, qui ne sont pas r&#233;dig&#233;s 
dans le but d'y faire de l'extraction d'information. Ce sont des courtes s&#233;quences textuelles 
homog&#232;nes sur le plan th&#233;matique (politique, &#233;conomique,&#8230;). Ce premier corpus de travail 
repr&#233;sentatif du domaine (plus de 200 articles et d&#233;p&#234;ches) contient des informations 
pertinentes qui peuvent &#234;tre extraites et utilis&#233;es &#224; des fins de d&#233;veloppement. 
</p>
<p>2.3 Acquisition initiale des donn&#233;es linguistiques  
</p>
<p>Le travail &#224; partir de corpus est une approche qui s&#8217;est r&#233;pandue afin de permettre la mise en 
place de m&#233;thodes d&#8217;analyses en ad&#233;quation avec le contenu textuel source. En effet le corpus 
de textes ainsi constitu&#233; est une source riche en unit&#233;s linguistiques qui permettent d&#8217;exprimer 
les relations recherch&#233;es. L&#8217;acquisition de ces donn&#233;es linguistiques n&#233;cessite une fouille 
syst&#233;matique des textes en vue d&#8217;accumuler les indicateurs, les indices et les r&#232;gles qui les 
combinent. Nous sommes partis d&#8217;un exemple (noyau) tr&#232;s simple exprimant la relation entre 
actants &#224; partir duquel nous avons &#233;tendu progressivement l&#8217;ensemble des marqueurs qui 
appartiennent pratiquement &#224; la m&#234;me s&#233;quence et qui r&#233;f&#232;rent au m&#234;me type de relation ou &#224; 
un type s&#233;mantiquement apparent&#233;. Les marqueurs recens&#233;s repr&#233;sentent des indicateurs qui </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Asma BOUHAFS 
</p>
<p>doivent &#234;tre, dans une &#233;tape suivante class&#233;s dans des classes linguistiques suivant leurs 
formes et leurs dispositions par rapport aux indices qui les entourent, c&#8217;est l&#8217;Exploration 
Contextuelle. 
</p>
<p>2.4 L'Exploration Contextuelle  
</p>
<p>L&#8217;Exploration Contextuelle (EC) (Descl&#233;s, 1997) est une m&#233;thode  issue des recherches 
effectu&#233;es par l&#8217;&#233;quipe LaLICC1 pour le traitement automatique des textes en langue naturelle. 
De nombreuses applications informatiques ont d&#233;j&#224; &#233;t&#233; r&#233;alis&#233;es, notamment le r&#233;sum&#233; 
automatique (Minel, 2000), le filtrage d'informations selon diff&#233;rents points de vue, etc. C'est 
une m&#233;thode ayant une port&#233;e s&#233;mantique qui ne se base pas sur une repr&#233;sentation profonde 
du texte mais sur une identification automatique de certaines unit&#233;s linguistiques (marqueurs) 
pertinentes pour une t&#226;che donn&#233;e, appel&#233;es indices d&#233;clencheurs (indicateurs) et indices 
compl&#233;mentaires. Les indices d&#233;clencheurs sont retenus en fonction d&#8217;objectifs pr&#233;cis (par 
exemple, d&#233;terminer une relation s&#233;mantique entre concepts et/ou la valeur s&#233;mantique 
contextualis&#233;e d&#8217;un marqueur grammatical ou lexical polys&#233;mique). Une analyse exploratoire 
du contexte permet d&#8217;identifier d&#8217;autres indices linguistiques, eux aussi jug&#233;s pertinents pour 
la t&#226;che trait&#233;e (indices compl&#233;mentaires). L&#8217;indice d&#233;clencheur et les indices 
compl&#233;mentaires &#233;tant identifi&#233;s, ils permettent, au moyen de r&#232;gles heuristiques, de prendre 
les d&#233;cisions impliqu&#233;es par l&#8217;objectif attendu dans un contexte bien d&#233;fini. Ces r&#232;gles se 
d&#233;clenchent pour attribuer &#224; une unit&#233; lexicale (une phrase, un paragraphe, etc.) des &#233;tiquettes 
s&#233;mantiques, etc.  Dans ce travail, nous avons appliqu&#233; l'EC dans le but d'identifier dans les 
textes les relations recherch&#233;es. Pour cela, nous avons construit une base d'indices 
linguistiques (plus de 2000 marqueurs diff&#233;rents) exprimant les relations entre actants et leurs 
environnements dans l'espace et le temps. Ces indices sont regroup&#233;s dans des classes 
s&#233;mantiques: celles des indicateurs et celles des indices compl&#233;mentaires qui seront mises en 
relation par un ensemble de r&#232;gles d'EC (plus de 180 r&#232;gles &#224; ce jour). L&#8217;action de l&#8217;ensemble 
des r&#232;gles permet de construire progressivement des repr&#233;sentations s&#233;mantiques. Certaines 
r&#232;gles permettent de cr&#233;er des marqueurs d'EC complexes, d&#8217;autres d&#8217;attribuer une &#233;tiquette 
s&#233;mantique &#224; une phrase. 
</p>
<p>3 Syst&#232;me informatique 
Le syst&#232;me se d&#233;compose en quatre t&#226;ches: 
</p>
<p>1- La r&#233;cup&#233;ration et le traitement de l'information recueillie, (Laublet 2002), ainsi que le 
typage des documents par rapport &#224; leur source (information officielle ou non,..) et &#224; leur 
statut temporel (r&#233;alis&#233;, non r&#233;alis&#233;, en cours&#8230;).  
</p>
<p>2- Le rep&#233;rage des entit&#233;s nomm&#233;es (personnes, compagnies, organisations, lieux, temps&#8230;) 
&#233;voqu&#233;es dans les documents. La reconnaissance des entit&#233;s nomm&#233;es est un probl&#232;me qui se 
pose dans les diff&#233;rents domaines du traitement automatique de la langue naturelle (TALN) : 
veille technologique, indexation de textes ou traduction, extraction d&#8217;information (EI) 
                                                
</p>
<p>1
 L&#8217;&#233;quipe LaLICC : LAngages Logiques Informatique Cognition et Communication </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me d'extraction d'information d&#233;di&#233; &#224; la veille 
</p>
<p>(Poibeau T., 1999), etc.  Dans notre travail la reconnaissance des entit&#233;s nomm&#233;es utilise une 
m&#233;thode qui repose &#224; la fois sur la structure interne de l'entit&#233; nomm&#233;e ainsi que sur l'analyse 
du contexte. Les r&#232;gles utilis&#233;es sont une combinaison d'expressions r&#233;guli&#232;res et d'indice 
lexicaux (sous la forme de r&#232;gles d'EC) qui sont ind&#233;pendantes du domaine. Elles permettent 
aussi dans une seconde &#233;tape d'identifier les expressions spatiales ainsi que les expressions 
temporelles qui vont &#234;tre utilis&#233;es dans le traitement final. 
</p>
<p>3- Le rep&#233;rage des segments porteurs d'information par l'identification de formes langagi&#232;res 
exprimant des th&#233;matiques (certaines unit&#233;s linguistiques interpr&#233;t&#233;es dans leurs contextes) et 
des relations s&#233;mantiques entre ces entit&#233;s nomm&#233;es, comme les relations entre Actants 
(&lt;CoLocation&gt;, &lt;CoAction&gt;&#8230;) ainsi que les relations d'un actant avec son environnement (par 
exemple &lt;Localisation_spatiale&gt;, &lt;Evolution social&gt;, &lt;Opinion&gt;, &lt;Attitude&gt;&#8230;). En 
effet ce deuxi&#232;me module d&#8217;annotation prend en entr&#233;e un document d&#233;j&#224; annot&#233; 
d&#8217;informations sur les acteurs d&#8217;&#233;v&#233;nements, de relations spatiales et temporelles. Cette &#233;tape 
va utiliser des ressources linguistiques plus importantes que celles de la pr&#233;c&#233;dente &#233;tape. En 
effet certaines r&#232;gles de rep&#233;rage de relations entre actants s&#8217;appuient sur des segments 
textuels d&#233;j&#224; annot&#233;s (&lt;actant&gt;, &lt;expression_temporelle&gt;&#8230;). Les r&#232;gles d&#8217;annotation 
augmentent celles de la pr&#233;c&#233;dente &#233;tape de deux nouvelles formes : l&#8217;une qui prend en 
compte, dans ses pr&#233;misses, des segments textuels d&#233;j&#224; annot&#233;s et l&#8217;autre prenant en charge 
les notions d&#8217;indicateur, d&#8217;indices compl&#233;mentaires et d&#8217;espace de recherche selon la m&#233;thode 
de filtrage par l&#8217;EC. 
</p>
<p>4- La r&#233;organisation ou la reformulation des segments porteurs d'informations pertinentes 
(segments &#233;tiquet&#233;s) dans le but d'obtenir un ensemble de repr&#233;sentations du contenu 
s&#233;mantique de ces segments et de traiter les informations recueillies (les sorties XML) pour 
pouvoir g&#233;n&#233;rer les repr&#233;sentations graphiques des r&#233;sultats (Holt R. C 00) et construire et 
mettre &#224; jour la base des r&#233;sultats. 
</p>
<p>choix du sujet 
de recherche
</p>
<p>WEB
</p>
<p>document
HTML versDocBook
</p>
<p>document
DocBook
&lt;section&gt;
</p>
<p>pr&#233;traitement
</p>
<p>actants
expressions
temporelles
</p>
<p>expressions
spatiales
</p>
<p>MODULE D'ANNOTATION - 1 -
</p>
<p>dictionnaire
d'entit&#233;s 
nomm&#233;es
</p>
<p>r&#232;gles
d'annotation
</p>
<p>document annot&#233;
&lt;section&gt;
    &lt;actant&gt;
    &lt;temps&gt;
    &lt;espace&gt;
</p>
<p>relations
entre
</p>
<p>actants
</p>
<p>relations
de
</p>
<p>relations
</p>
<p>MODULE D'ANNOTATION - 2 -
</p>
<p>classes
de
</p>
<p>marqueurs
</p>
<p>r&#232;gles
d'annotation
</p>
<p>selon EC
</p>
<p>document annot&#233;
&lt;section&gt;
    &lt;&#233;v&#233;nement&gt;
    &lt;coop&#233;ration&gt;
    &lt;rencontre&gt;
     ...
</p>
<p>versGXL
document GXL
   &lt;node&gt;
   &lt;edge&gt;
</p>
<p>base
d'informations
</p>
<p>op&#233;rations
de navigation
dans le graphe
</p>
<p> 
</p>
<p>Figure 2: Architecture g&#233;n&#233;rale du syst&#232;me JavaVeille 
</p>
<p>4 Conclusion et &#233;valuation  
L&#8217;int&#233;r&#234;t de ce travail r&#233;side dans notre volont&#233; de fournir des outils informatiques capables 
d&#8217;aider &#224; la recherche de certains types d&#8217;informations sp&#233;cifiques, dans un but de veille. Le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Asma BOUHAFS 
</p>
<p>syst&#232;me est &#233;valu&#233; sur des textes qui n'ont pas servi dans l'&#233;tape d'acquisition initiale des 
donn&#233;es linguistiques.  Ces textes sont ensuite incorpor&#233;s dans le corpus d'acquisition et les 
r&#233;sultats servent &#224; enrichire notre base  linguistique. Ce travail est en cours, certaines sous-
t&#226;ches sont encore en cours de construction et ne sont pas encore compl&#232;tement 
op&#233;rationnelles. Notons qu'au fur et &#224; mesure que l'on avance dans l'impl&#233;mentation, les bases  
de donn&#233;es linguistiques sont &#233;largies de mani&#232;re &#224; pouvoir couvrir le plus grand nombre de 
domaines. Pr&#233;cisons que l'identification et la classification s&#233;mantique des indicateurs 
linguistiques pertinents restent une t&#226;che importante et d&#233;licate, et que la mise en &#339;uvre 
informatique exige une mod&#233;lisation, o&#249; linguistes et informaticiens doivent coop&#233;rer si l'on 
veut aboutir &#224; des syst&#232;mes robustes et performants. Un protocole  d'&#233;valuation est 
actuellement exp&#233;riment&#233; pour permettre &#224; la fois de cerner les limites de nos r&#232;gles et 
d'am&#233;liorer la qualit&#233; d'extraction de notre syst&#232;me. Enfin soulignons que ce travail est men&#233; 
dans le cadre d&#8217;une th&#232;se de doctorat2, et qu'il est int&#233;gr&#233; dans le cadre du projet OLETT3. 
</p>
<p>R&#233;f&#233;rences 
DESCLES J-P. (1997), Syst&#232;mes d&#8217;Exploration Contextuelle, dans Co-texte et calcul du sens, Claude Guimier 
(&#233;d). 
</p>
<p>DOU H., JAKOBIAK F. (1995), De l&#8217;information documentaire &#224; la veille technologique pour l&#8217;entreprise : 
enjeux, aspects g&#233;n&#233;raux et d&#233;finitions, in Veille technologique et comp&#233;titivit&#233;, Dunod, 1995. 
</p>
<p>GOUJON B.(2000), Utilisation de l'exploration contextuelle pour l'aide &#224; la veille technologique : R&#233;alisation 
du syst&#232;me informatique VIGITEXT. Th&#232;se de doctorat (traitement automatique du langage naturel) : Universit&#233; 
Paris-Sorbonne, avril 2000. 550 p 
</p>
<p>HOLT R. C., WINTER A., SCHURR A. (2000). Gxl: Towards a standard exchange format. In Proceedings 7th 
Working Conference on Reverse Engineering (WCRE 2000). 
</p>
<p>LAUBLET P, NAIT-BAHA L, JACKIEWICZ A, DJIOUA B, (2002) &quot;Collecte d'information textuelles sur le 
Web selon diff&#233;rents points de vue &quot;, C&#233;line Paganelli (ed), Interaction homme-machine et recherche 
d'information (chapitre 8), Hermes , , 2002. 
</p>
<p>MINEL J-L., DESCLES J-P., CARTIER E., CCRISPINO G., BENHAZZEZ S.,  JACKIEWICZ A., (2000), 
&quot;R&#233;sum&#233; automatique par filtrage s&#233;mantique d'informations dans des textes. Pr&#233;sentation de la plate-forme 
FilText &quot;, revue TSI. 
</p>
<p>POIBEAU T., (1999) Rep&#233;rage des entit&#233;s nomm&#233;es : un enjeu pour les syst&#232;mes de veille. In Actes des 
troisi&#232;mes rencontres de Terminologie et Intelligence Artificielle (TIA&#8217;99), volume19, p. 43&#8211;51. 
</p>
<p> 
</p>
<p>                                                
</p>
<p>2 Th&#232;se de doctorat dirig&#233;e par M. Descl&#233;s &#224; Paris IV 
</p>
<p>3 OLETT est un projet soutenu par le programme interdisciplinaire du CNRS soci&#233;t&#233; de l'information et porte sur 
l'identification des &#233;v&#233;nements et des lieux  pour l'organisation  aspecto-temporelles sous-jacente au texte 
(application : filtrage s&#233;mantique automatique, recherche et extraction d'informations sur le Web). Il men&#233;e par 
les &#233;quipes LaLICC de Paris 4 La Sorbonne et Lattice Paris 7, et financ&#233; par les d&#233;partements STIC (Sciences et 
Technologies de l&#8217;Information et de la Communication) et SHS (Sciences de l&#8217;homme et de la soci&#233;t&#233;) du CNRS. </p>

</div></div>
</body></html>