<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Repr&#233;sentation compositionnelle de la s&#233;mantique de aussi</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004 
</p>
<p>Repr&#233;sentation compositionnelle de la s&#233;mantique de aussi 
</p>
<p>C&#233;line Raynal 
</p>
<p>Lattice &#8211; CNRS UMR 8094 &#8211; Universit&#233; Paris 7 
2, place Jussieu &#8211; Case 7003 &#8211; 75251 Paris Cedex 05 
</p>
<p>craynal@linguist.jussieu.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>L&#8217;objectif de notre travail est de d&#233;gager une repr&#233;sentation formelle compositionnelle de la 
contribution s&#233;mantique de aussi lorsqu&#8217;il a une valeur additive. Plusieurs probl&#232;mes de 
compositionnalit&#233;, li&#233;s surtout &#224; la diversit&#233; des arguments concern&#233;s par l&#8217;adverbe, vont se 
poser. Nous proposons une alternative compositionnelle &#224; la repr&#233;sentation propos&#233;e 
initialement en l-DRT. 
</p>
<p>The aim is to find a compositional formal representation to the French adverb aussi when it 
has an additive meaning. The variety of arguments of the adverb entails several problems of 
compositionality. Given the l-DRT representation is problematic, we try to propose an other 
one, compositional too. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
</p>
<p>S&#233;mantique, l-DRT, pr&#233;supposition, compositionnalit&#233;. 
Semantics, l-DRT, presupposition, compositionality. 
</p>
<p>1 Introduction 
</p>
<p>Nous nous int&#233;ressons ici &#224; l&#8217;item aussi ; tr&#232;s polys&#233;mique, nous nous attachons plus 
particuli&#232;rement aux cas o&#249; il a un sens additif, et d&#233;clenche par ailleurs une pr&#233;supposition. 
Afin de formaliser le sens, nous nous pla&#231;ons dans une perspective compositionnelle o&#249; 
chaque unit&#233; du lexique a une repr&#233;sentation de son sens. Nous cherchons &#224; repr&#233;senter la 
s&#233;mantique de l&#8217;adverbe pour d&#233;crire et formaliser le sens des phrases dans lesquelles il entre. 
Nous commencerons par d&#233;crire les emplois et contextes o&#249; aussi v&#233;hicule l'addition. Nous 
pr&#233;senterons ensuite le cadre dans lequel nous entendons d&#233;crire le sens, la l-DRT, et le 
principe-cl&#233; de notre d&#233;marche qu&#8217;est le principe de compositionnalit&#233; auquel elle est 
&#233;troitement li&#233;e. Nous proposerons enfin une repr&#233;sentation en l-DRT de la contribution 
s&#233;mantique de aussi lorsqu&#8217;il d&#233;clenche une pr&#233;supposition. Nous verrons que cela ne va pas 
sans poser de probl&#232;mes et nous chercherons un moyen de les r&#233;soudre. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;line Raynal 
</p>
<p>2 Contribution s&#233;mantique de aussi : son sens additif 
</p>
<p>Dans la majorit&#233; des grammaires (Riegel et al., 1994 ; Arriv&#233; et al., 1985), aussi est consid&#233;r&#233; 
comme un adverbe qui entre dans diverses structures v&#233;hiculant chacune un sens pr&#233;cis. Nous 
ne nous concentrons que sur les cas o&#249; il exprime l'addition notamment rep&#233;rables par le fait 
que aussi permute dans la majeure partie des cas avec &#233;galement1. 
</p>
<p>1. Zo&#233; aussi joue au handball. 
</p>
<p>Nous voyons que dans (1), deux aspects de sens apparaissent : (i) Zo&#233; joue au handball ; (ii) il 
y a quelqu'un d&#8217;autre qui joue au handball. Plus formellement, nous notons (Zo&#233; = a) : $b 
JH(a) &#217; JH(b) &#217; b &#185; a ; o&#249; JH repr&#233;sente le pr&#233;dicat &#171; jouer au handball &#187;, et b r&#233;f&#232;re &#224; 
&#171; quelqu'un d&#8217;autre que Zo&#233; &#187;. Lorsque l&#8217;on ajoute une n&#233;gation (Il est faux que Zo&#233; aussi 
joue au handball.), la formalisation est la suivante : $b &#216;JH(a) &#217; JH(b) &#217; b &#185; a. Nous voyons 
que seule une partie du sens de (1) est ni&#233;e (JH(a)), les autres informations ne changent pas 
($b JH(b) &#217; b &#185; a). La premi&#232;re partie du sens est pos&#233;e, la seconde pr&#233;suppos&#233;e. 
</p>
<p>Lorsque aussi appara&#238;t dans certaines positions (entre l&#8217;auxiliaire et le participe pass&#233;, ou 
apr&#232;s le verbe simple), il peut entra&#238;ner une ambigu&#239;t&#233; : il a plusieurs arguments potentiels, 
plusieurs pr&#233;suppositions sont donc possibles. L'exemple (2), qui a plusieurs interpr&#233;tations, 
nous permet de montrer quelques-uns des constituants pouvant &#234;tre concern&#233;s par 
l&#8217;adverbe (le contexte permet de mettre l&#8217;&#233;l&#233;ment en &#233;vidence). Dans le but de noter 
clairement l'information, nous empruntons la notation de Kamp (Kamp, 2001) dans laquelle 
pr&#233;suppos&#233; et pos&#233; sont distingu&#233;s, et not&#233;s de la fa&#231;on suivante : &lt; Pr&#233;suppos&#233; | Pos&#233; &gt;. 
</p>
<p>2. a. Lili a aussi offert un pull &#224; Paul. 
</p>
<p>b. Zo&#233; a offert un pull &#224; Paul. Lili lui en a aussi offert un. 
&lt; Quelqu'un d&#8217;autre que Lili a offert un pull &#224; Paul | Lili a offert un pull &#224; Paul &gt; 
</p>
<p>c. Lili a offert un livre &#224; Paul. Elle lui a aussi offert un pull. 
&lt; Lili a offert autre chose qu&#8217;un pull &#224; Paul | Lili a offert un pull &#224; Paul &gt; 
</p>
<p>d. Lili a donn&#233; un appareil photo &#224; Jo. Elle a aussi offert un pull &#224; Paul. 
&lt; Lili a fait autre chose que [offrir un pull &#224; Paul] | Lili a offert un pull &#224; Paul &gt; 
</p>
<p>La structure est stable : &lt; existence d'un r&#233;f&#233;rent diff&#233;rent de celui introduit par l'argument de 
aussi (mais de m&#234;me cat&#233;gorie), les deux r&#233;f&#233;rents sont &#233;galement distincts de par le pr&#233;dicat 
qui s'applique &#224; eux | phrase sans aussi &gt;2. 
</p>
<p>Nous ne nous pencherons pas sur la d&#233;sambigu&#239;sation. Notons simplement que la clart&#233; de 
l'interpr&#233;tation sera optimale &#224; l'oral, le contexte coupl&#233; &#224; la prosodie permettant d'acc&#233;der &#224; 
une interpr&#233;tation univoque. L&#8217;&#233;l&#233;ment qui nous int&#233;resse ici est la diversit&#233; des &#233;l&#233;ments 
concern&#233;s par aussi. Le but de notre travail est de repr&#233;senter d&#8217;une seule et m&#234;me fa&#231;on le 
sens de l&#8217;adverbe, quel que soit son argument. 
</p>
<p>                                                 
</p>
<p>1 Cf. (Raynal, 2002). 
2 Pour les ph&#233;nom&#232;nes li&#233;s &#224; la pr&#233;supposition de too, nous renvoyons vers Kripke, repris par (Soames, 1989). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation compositionnelle de aussi 
</p>
<p>3 Approche compositionnelle 
</p>
<p>3.1 Principe 
</p>
<p>Selon le principe de compositionnalit&#233; (Frege), la signification de toute phrase est fonction 
des significations de ses parties. Cela signifie que le sens de chaque unit&#233; lexicale non 
ambigu&#235; est fix&#233; dans le lexique, et que la combinaison de ces sens est guid&#233;e par la structure 
syntaxique de la phrase, et aboutit &#224; l&#8217;interpr&#233;tation de la phrase compl&#232;te. La mise en 
pratique de ce principe passe notamment par le l-calcul. Prenons l&#8217;&#233;nonc&#233; (3) : 
</p>
<p>3. [ [Jo]NP [dort]VP ]S. 
</p>
<p>La structure syntaxique guide la combinaison des significations des constituants. On note le 
sens des &#233;l&#233;ments entre doubles crochets : [| Jo |] = j ; [| dort |] = lx D(x). On repr&#233;sente (3) 
par : [| Jo dort |] = [| dort |] ([| Jo |]) = lx D(x)(j) =b D(j). Le sens de &#171; Jo &#187; se combine avec 
celui de &#171; dort &#187; aboutissant, apr&#232;s une b-r&#233;duction (=b), au sens de (3a).  
</p>
<p>3.2 Notre cadre : l-DRT 
</p>
<p>3.2.1 l-DRT 
</p>
<p>L&#8217;application du l-calcul &#224; la DRT permet de repr&#233;senter la construction du sens d'une phrase 
via la composition de ses &#233;l&#233;ments de sens. Reprenons l&#8217;exemple (3) : Jo dort. A chaque unit&#233; 
est associ&#233;e la repr&#233;sentation de son sens en l-DRT. Ces repr&#233;sentations se combinent selon 
la structure syntaxique et aboutissent &#224; la repr&#233;sentation du sens de la phrase compl&#232;te3 : 
 
</p>
<p> S 
 
</p>
<p>         lP   NP         VP lx 
         Jo        dort 
</p>
<p>Figure 1 : Arbre de composition de (3). 
</p>
<p>3.3 Repr&#233;sentation de aussi 
</p>
<p>3.3.1  Exemple : aussi et le NP sujet  
</p>
<p>Dans le but de repr&#233;senter en l-DRT les &#233;nonc&#233;s avec aussi, nous devons d&#233;terminer la 
repr&#233;sentation de son sens. Celle-ci est bi-partite, comme la notation emprunt&#233;e &#224; Kamp, 
puisque l'adverbe d&#233;clenche une pr&#233;supposition. Avant de proposer cette repr&#233;sentation, 
</p>
<p>                                                 
</p>
<p>3 Nous nous servons de l'op&#233;rateur de fusion dans les repr&#233;sentations (Blackburn et al, 1999) bien qu'il 
n'apparaisse pas ici par souci de lisibilit&#233; et de concision. 
</p>
<p>u 
Jo(u)    P(u) 
</p>
<p> 
</p>
<p>dort(x) 
</p>
<p>u 
Jo(u)     dort(u) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;line Raynal 
</p>
<p>regardons celle &#224; laquelle nous voulons aboutir pour l'&#233;nonc&#233; (4a) o&#249; l'adverbe concerne le NP 
sujet Lili : 
</p>
<p>4. a. Lili aussi a lu un po&#232;me.  
b. &lt; Quelqu'un d&#8217;autre que Lili a lu un po&#232;me | Lili a lu un po&#232;me &gt; 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 2 : Repr&#233;sentation de (4) en DRT 
 
</p>
<p>       lNP lVP    NP(VP) 
</p>
<p> 
Figure 3 : Proposition de repr&#233;sentation du sens de aussi l-DRT4 
</p>
<p>La composition va se faire de la mani&#232;re suivante : 
  
</p>
<p>lVP 
</p>
<p>      S 
NP    VP 
</p>
<p>NP   Adj   a lu un po&#232;me 
Lili   aussi            lx 
</p>
<p>lP   lNP lVP           NP(VP) 
</p>
<p> 
</p>
<p>Figure 4 : Arbre de composition de (4) 
</p>
<p>3.3.2 Probl&#232;mes de composition 
</p>
<p>Le premier probl&#232;me qui se pose est celui li&#233; &#224; &quot;&#172; N'(v)&quot;. Pour que cette condition soit 
instanci&#233;e, il faut acc&#233;der au N', or les l-termes que nous utilisons se situent au niveau des 
XP, ce qui pose probl&#232;me pour acc&#233;der &#224; l'&#233;l&#233;ment &quot;inf&#233;rieur&quot; qu'est le X'. Par ailleurs, 
d'autres probl&#232;mes vont se poser lorsque l'&#233;l&#233;ment concern&#233; par aussi ne sera pas le NP sujet. 
Ainsi, une difficult&#233; va appara&#238;tre lorsque l'argument de l'adverbe est le VP. D'une part, le 
r&#233;sultat de la premi&#232;re b-r&#233;duction va aboutir &#224; ce que le l-terme lVP se retrouve &#224; la place 
d'un r&#233;f&#233;rent de discours (lire(VP, u)) ; d'autre part, le N' n'a plus lieu d'&#234;tre puisque ce n'est 
plus le NP qui est concern&#233; par aussi mais le VP. Tandis que ce probl&#232;me est li&#233; &#224; la diversit&#233; 
de nature de l'argument de l'adverbe, un autre est li&#233; &#224; la profondeur syntaxique de celui-ci. En 
</p>
<p>                                                 
</p>
<p>4 Bien qu'un l-terme soit plut&#244;t &quot;simple&quot; (une lettre), la notation propos&#233;e ici est employ&#233;e par souci de clart&#233;. 
</p>
<p>z u 
Lili(z) 
po&#232;me(u) 
lire(z, u) 
</p>
<p>v u 
&#172; Lili(v) 
po&#232;me(u) 
lire(v, u) 
</p>
<p>z 
Lili(z)  P(z) 
</p>
<p>u 
po&#232;me(u)     lire(x, u) 
</p>
<p>z 
Lili(z)  VP(z) 
</p>
<p>v u 
&#172; N'(v) 
po&#232;me(u) 
lire(v, u) 
</p>
<p>z u 
Lili(z) 
po&#232;me(u) 
lire(z, u) 
</p>
<p>v  
&#172; N'(v) 
VP(v) 
</p>
<p>v  
&#172; N'(v) 
VP(v) 
</p>
<p>v 
&#172; N'(v) 
VP(v) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation compositionnelle de aussi 
</p>
<p>effet, la repr&#233;sentation de aussi pose probl&#232;me lorsqu&#8217;il touche un &#233;l&#233;ment tel que le NP objet 
ou le verbe seul : le nombre de combinaisons n&#233;cessaires pour aboutir &#224; la repr&#233;sentation de la 
phrase compl&#232;te augmente, rendant le nombre d&#8217;arguments pr&#233;vus dans la repr&#233;sentation 
insuffisant. Toutes ces difficult&#233;s remettent en cause le principe de compositionnalit&#233;. 
</p>
<p>Pour r&#233;soudre ces probl&#232;mes, l&#8217;adverbe peut &#234;tre envisag&#233; dans sa dimension polys&#233;mique : &#224; 
chacun des cas serait associ&#233;e une repr&#233;sentation particuli&#232;re, solution peu satisfaisante en 
terme de compositionnalit&#233;. C&#8217;est pourquoi nous pr&#233;f&#233;rons adopter une d&#233;marche proc&#233;durale 
qui reste compositionnelle que nous allons d&#233;crire et expliquer. 
</p>
<p>3.3.3 Proposition 
</p>
<p>L&#8217;adverbe peut donc se combiner avec des &#233;l&#233;ments diff&#233;rents de par leur nature comme leur 
profondeur syntaxique. Toutefois, s&#233;mantiquement, aussi a la m&#234;me contribution quel que soit 
son argument : le pos&#233; correspond &#224; une assertion &#171; classique &#187; sans aussi, et la diff&#233;rence 
entre assert&#233; et pr&#233;suppos&#233; concerne l'argument de l&#8217;adverbe. Afin d'avoir une repr&#233;sentation 
homog&#232;ne, il suffirait de faire porter une marque (not&#233;e W) sur cet &#233;l&#233;ment ; elle permettrait 
(i) de savoir quel est l'&#233;l&#233;ment en jeu dans la pr&#233;supposition et (ii) de ne plus consid&#233;rer aussi 
pendant la composition. Le lien cr&#233;&#233; entre l'argument de aussi et son correspondant dans le 
pr&#233;suppos&#233; permettrait d'acc&#233;der &#224; la structure commune de leur repr&#233;sentation.  
</p>
<p>Nous partons de la structure syntaxique de la phrase initiale dans laquelle on a remplac&#233; aussi 
par la marque W sur le constituant concern&#233;. Quelle que soit la nature de ce dernier, le 
traitement sera le m&#234;me, en revanche, les combinaisons lors du traitement seront diff&#233;rentes 
selon que l&#8217;adverbe marque le sujet, le pr&#233;dicat, le verbe ou un constituant du verbe. Dans 
tous les cas, la phrase portant la marque W de aussi se d&#233;double pour former un couple &lt; Pp, 
P &gt; o&#249; Pp (le pr&#233;suppos&#233;) repr&#233;sente la phrase initiale sans aussi et o&#249; le constituant dans la 
port&#233;e de l&#8217;adverbe est remplac&#233; par W, et P (le pos&#233;) correspond &#224; la phrase initiale sans 
l&#8217;adverbe. Le sens de chacune des phrases de ce couple peut alors &#234;tre calcul&#233;. 
</p>
<p>5. a. Lili a aussi lu un po&#232;me. 
</p>
<p>Dans le cas o&#249; aussi porte sur le sujet ou le VP global, notons la phrase S comme suit S : a(u), 
(o&#249; a est le VP, et u le sujet) : 
</p>
<p>&#183; le constituant marqu&#233; est le sujet, nous avons : &lt; a(W), a(u) &gt; 
 b. LiliW a lu un po&#232;me. &#224; &lt; LP(W),LP(Lili) &gt;  LP &#243; &#171; lire un po&#232;me &#187; 
</p>
<p>&#183; le constituant marqu&#233; est le VP, nous avons : &lt; W(u), a(u) &gt; 
 c. Lili [a lu un po&#232;me]W.&#224; &lt; W(Lili), LP(Lili) &gt; 
</p>
<p>Comme pr&#233;c&#233;demment, le deuxi&#232;me membre du couple (le pos&#233;), est toujours le m&#234;me, c&#8217;est 
la partie pr&#233;suppos&#233;e qui change. Le deuxi&#232;me couple (5c) indique que la seule contrainte &#224; 
respecter dans le pr&#233;suppos&#233; est que le sujet des pr&#233;dicats a et W doit &#234;tre le m&#234;me (u), en 
revanche, leur nombre d&#8217;arguments respectifs est non pertinent. 
</p>
<p>Dans le cas o&#249; aussi porte sur le verbe ou un de ses constituants, notons la phrase S comme 
suit : S : m(w)(u), (o&#249; m est le verbe, w l&#8217;objet, et u le sujet) : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;line Raynal 
</p>
<p>&#183; le constituant marqu&#233; est le verbe, nous avons : &lt; W(w)(u), &#181;(w)(u) &gt; 
 d. Lili [a lu]W un po&#232;me.&#224; &lt; W(po&#232;me)(Lili), L(po&#232;me)(Lili) &gt; (L &#243; &#171; lire &#187;) 
</p>
<p>&#183; le constituant marqu&#233; appartient au VP (ex: objet), nous avons : &lt; m(W)(u), m(w)(u) &gt; 
 e. Lili a lu [un po&#232;me]W.&#224; &lt; L(W)(Lili), L(po&#232;me)(Lili) &gt; 
</p>
<p>Gr&#226;ce &#224; cette composition proc&#233;durale, une m&#234;me s&#233;rie d&#8217;op&#233;rations est effectu&#233;e, conservant 
la compositionnalit&#233; tout en tenant compte de la diversit&#233; des cas existant.  
</p>
<p>4 Conclusion 
</p>
<p>Nous nous sommes attach&#233;e &#224; aussi lorsqu&#8217;il exprime l&#8217;addition et par l&#224; m&#234;me, v&#233;hicule une 
pr&#233;supposition. Dans ces cas-l&#224; nous avons vu que (i) le pos&#233; correspond &#224; l&#8217;&#233;nonc&#233; initial 
sans l&#8217;adverbe, et que (ii) la pr&#233;supposition est toujours la m&#234;me : elle exprime 
syst&#233;matiquement l'existence de &#171; quelque chose d'autre &#187;, la nature de ceci variant selon la 
nature de l&#8217;argument de aussi. Ce sens constant nous a pouss&#233;e &#224; chercher une repr&#233;sentation 
unique dans le cadre compositionnel de la l-DRT. La solution propos&#233;e dans ce formalisme 
s'est av&#233;r&#233;e probl&#233;matique en plusieurs points ; elle se heurte notamment &#224; la diversit&#233; des 
constituants pouvant se trouver concern&#233;s par l&#8217;adverbe. Nous avons donc essay&#233; de fournir 
une autre alternative qui nous permet d'obtenir, quel que soit l&#8217;argument de l&#8217;adverbe, un seul 
et m&#234;me principe de repr&#233;sentation de la s&#233;mantique de aussi. Il se fonde sur une marque (W) 
que l'adverbe impose &#224; l'&#233;l&#233;ment qu'il concerne. Par la suite, pos&#233; et pr&#233;suppos&#233; seront 
compos&#233;s ind&#233;pendamment l'un de l'autre : le premier avec les &#233;l&#233;ments &#171; pleins &#187; de la 
phrase initiale, le second avec la marque W, dont la repr&#233;sentation formelle aura de fait, la 
m&#234;me structure que celle de l&#8217;argument de aussi, &#233;vitant les erreurs de composition.  
</p>
<p>R&#233;f&#233;rences 
</p>
<p>ARRIVE M., GADET F., GALMICHE M. (1985), La grammaire d&#8217;aujourd&#8217;hui, Paris, Flammarion. 
ASHER N. (1993), Reference to Abstract Objetcs in Discourse, Dordrecht, Kluwer. 
ASHER N., LASCARIDES A. (1998), The Semantics and Pragmatics of Presupposition, Journal of Semantics, Vol. 
15, pp. 239-300. 
BLACKBURN P., BOS J. (1999), Representation and Inference for Natural Language: A First Course in 
Computational Semantics, Stanford, CSLI Press. 
KAMP H. (2001), The importance of presupposition, Linguistic Form and its Computation, Stanford, CSLI 
Publications. 
KAMP H., REYLE U. (1993), From Discourse to Logic : Introduction to Modeltheoric Semantics of Natural 
Language, Formal Logic and Discourse Representation Theory, Dordrecht, Kluwer Academic Publisher. 
KARTTUNEN L., PETERS S. (1979), Conventional Implicature, Syntax and Semantics : Presupposition, Vol. 11, 
pp. 1-56, New York, Academic Press. 
MUSKENS, R.A. (1996), Combining Montague Semantics and Discourse Representation, Linguistcs and 
Philosophy, Vol. 19, pp. 143-186. 
RAYNAL C. (2002), Calcul effectif de la pr&#233;supposition : seul, aussi, m&#234;me, M&#233;moire de DEA, Univ. Paris 7. 
RIEGEL M., PELLAT J.-C., RIOUL R. (1994), Grammaire m&#233;thodique du fran&#231;ais, Paris, PUF. 
ROUSSARIE L., AMSILI P. (2002) Discours et compositionnalit&#233;, in Actes de la 9&#232;me Conf&#233;rence sur le Traitement 
Automatique des Langues Naturelles (TALN 2002), pp. 383-388, Nancy. 
SOAMES S. (1989), Presupposition, Handbook of Philosophical Logic, Vol IV, pp. 553-616, Dordrecht, Kluwer.  
VAN DER SANDT R. (1992), Presupposition projection as anaphora resolution, Journal of Semantics, Vol. 9, pp. 
333-377. 
VAN DER SANDT R., GEURTS B. (2001), Too, Proceedings of the 13th Amsterdam Colloquium, pp. 180-185. </p>

</div></div>
</body></html>