<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>R&#233;utilisation de traducteurs gratuits pour d&#233;velopper des syst&#232;mes multilingues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004 
</p>
<p>R&#233;utilisation de traducteurs gratuits pour d&#233;velopper des 
syst&#232;mes multilingues 
</p>
<p>VO TRUNG Hung 
</p>
<p>Institut National Polytechnique de Grenoble                                                
GETA, CLIPS, IMAG - campus  
</p>
<p>385, rue de la Biblioth&#232;que,  BP 53-38041 Grenoble Cedex 9, France 
T&#233;l : +33 4 76 51 43 55, Fax : +33 4 76 51 44 05 
</p>
<p>Mail : Hung.Vo-Trung@imag.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Nous pr&#233;sentons ici une m&#233;thode de r&#233;utilisation de syst&#232;mes de traduction automatique 
gratuits en ligne pour d&#233;velopper des applications multilingues et &#233;valuer ces m&#234;mes 
syst&#232;mes. Nous avons d&#233;velopp&#233; un outil de traitement et de traduction de documents 
h&#233;t&#233;rog&#232;nes (multilingues et multicodage). Cet outil permet d'identifier la langue et le codage 
du texte, de segmenter un texte h&#233;t&#233;rog&#232;ne en zones homog&#232;nes, d'appeler un traducteur 
correspondant avec une paire de  langue source et cible, et de r&#233;cup&#233;rer les r&#233;sultats traduits 
dans la langue souhait&#233;e. Cet outil est utilisable dans plusieurs applications diff&#233;rentes 
comme la recherche multilingue, la traduction des courriers &#233;lectroniques, la construction de 
sites web multilingues, etc.   
</p>
<p>We present here a method of the reuse of the free on line automatic translation systems to 
develop multilingual applications and to evaluate translators. We developed a tool for 
treatment and translation of the heterogeneous documents (multilingual and multicoding). 
This tool makes it possible to identify the language and the coding of the text, to segment a 
heterogeneous text in homogeneous zones, to call a translator corresponding with a fair of 
languages and to recover the results translated into desired language. We can use this tool in 
several different applications as multilingual research, the translation of the e-mail, the 
construction of the multilingual Web, etc. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s  
</p>
<p>Traduction Automatique, Traducteur Multilingue, Multilinguisme, Document Multilingue 
Machine Translation, Multilingual Translator, Multilingualism, Multilingual Document </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VO TRUNG Hung 
</p>
<p>1 Introduction 
</p>
<p>Actuellement, il existe plusieurs versions de traducteurs automatiques non commerciaux en 
ligne, comme Systran, WorldLingo, Reverso, &#8230; avec la limitation g&#233;n&#233;rale de la longueur du 
texte &#224; moins de 50-150 mots. En outre, ces traducteurs ne permettent que de traduire des 
textes ou des pages web monolingues et monocodage avec une paire de langues d&#233;termin&#233;es &#224; 
l&#8217;avance. 
</p>
<p>Avec l'utilisation r&#233;pandue d'Internet, nous recevons r&#233;guli&#232;rement des informations &#233;crites 
en plusieurs langues (par exemple, courriers &#233;lectroniques, catalogues, notices techniques, 
sites web, etc) et le besoin de la traduction de ces textes en langue d'utilisateur se pose 
naturellement. De plus, nous recevons des informations dont nous ne pouvons pas savoir 
quelles langues contenues.  
</p>
<p>La r&#233;utilisation de traducteurs gratuits pour d&#233;velopper des applications multilingues est donc 
une solution utile. L&#8217;id&#233;e est d&#8217;appeler des traducteurs existants pour traduire des textes dans 
la langue souhait&#233;e. L'int&#233;gration des traducteurs dans les syst&#232;mes multilingues permet de 
traduire automatiquement des textes ou des messages &#224; l&#8217;ex&#233;cution et d'&#233;viter par ailleurs le 
stockage d'une m&#234;me donn&#233;e en plusieurs langues.  
</p>
<p>Nous pr&#233;sentons ici une m&#233;thode de r&#233;utilisation des syst&#232;mes de traduction automatique 
gratuits en ligne pour d&#233;velopper les applications multilingues et &#233;valuer des traducteurs. 
Nous combinons plusieurs traducteurs et utilisons l&#8217;anglais comme pivot de langue pour 
obtenir un maximum de paires de langue. Nous avons d&#233;velopp&#233; un outil de traitement et de 
traduction des documents h&#233;t&#233;rog&#232;nes (multilingues et multicodage). Cet outil permet 
d'identifier la langue et le codage du texte, de segmenter un texte h&#233;t&#233;rog&#232;ne en zones 
homog&#232;nes, d'appeler un traducteur correspondant avec une paire de  langue et r&#233;cup&#233;rer les 
r&#233;sultats traduits en langue souhait&#233;e. Ce syst&#232;me peut s&#8217;adapter pour plusieurs syst&#232;mes de 
codage diff&#233;rents comme BIG-5, GB-2312 (chinois), Shift-JIS (japonais), EUC-kr (cor&#233;en), 
KOI-8, CP 1251 (russe), etc. Nous pouvons utiliser cet outil dans plusieurs applications 
comme la recherche multilingue, la traduction des courriers &#233;lectroniques, la construction des 
sites web multilingues, etc. 
</p>
<p>2 Objectifs 
</p>
<p>Notre premier objectif est la construction d'un outil d&#8217;appeler des traducteurs gratuits,  
disponibles sur le Web et de r&#233;cup&#233;rer leurs r&#233;sultats.  Nous pouvons utiliser les param&#232;tres 
tels que les langues (source et cible), le codage, le nom de traducteur d'obtenir des r&#233;sultats 
traduits diff&#233;rents pour une m&#234;me entr&#233;e.  
</p>
<p>Le deuxi&#232;me objectif est l'utilisation de ces traducteurs pour d&#233;velopper des applications 
multilingues. Nous pouvons int&#233;grer ces traducteurs dans des syst&#232;mes multilingues pour 
traduire des textes, des messages en ex&#233;cutant du programme.  
</p>
<p>Nous avons d&#233;velopp&#233; un site web pour traduire des textes h&#233;t&#233;rog&#232;nes (multilingues et 
multilicodage) dans la langue souhait&#233;e, m&#234;me si nous ne savons pas la langue du texte 
d'entr&#233;e. Cet outil permet de traduire un texte quelconque dans la langue souhait&#233;e. Si ce texte 
est h&#233;t&#233;rog&#232;ne, notre syst&#232;me segmentera et identifiera quel segment est &#233;crit en quelle langue </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;utilisation de traducteurs gratuits pour d&#233;velopper des syst&#232;mes multilingues 
</p>
<p>et quel codage pour d&#233;terminer un traducteur correspondant. Par exemple, nous pouvons 
copier/coller des textes en plusieurs langues (anglais, chinois, japonais, etc) et choisir le 
fran&#231;ais comme langue cible. Ou, nous recherchons des sites contenant un mot (en particulier 
des mots techniques) de &quot;segment&quot; par google, le r&#233;sultat comprend des sites en fran&#231;ais, 
anglais, allemand, etc, et nous pouvons utiliser cet outil pour lire les r&#233;sultats dans une m&#234;me 
langue. 
</p>
<p>Nous pourrions aussi int&#233;grer cet outil dans plusieurs applications diff&#233;rentes comme la 
traduction des courriers &#233;lectroniques, la g&#233;n&#233;ration d'un message en plusieurs langues, 
l'&#233;valuation de qualit&#233; des traducteurs, etc. 
</p>
<p>3 &#201;tat de l'art 
</p>
<p>Cette session aborde quelques syst&#232;mes r&#233;cents de traduction automatique et de traitement des 
documents h&#233;t&#233;rog&#232;nes en ligne. Nous pouvons appeler ces syst&#232;mes pour traiter et traduire 
des textes dans les syst&#232;mes multilingues. 
</p>
<p>3.1 Systran 
</p>
<p>Actuellement, SYSTRAN est un traducteur tr&#232;s connu et sa technologie alimentent des 
solutions de traduction pour Internet, PC et infrastructures de r&#233;seau avec 36 paires de langue 
et 20 domaines sp&#233;cialis&#233;s diff&#233;rents. La version en ligne permet de traduire pour 34 paires de 
langue sur l'adresse http://www.systranbox.com/. 
</p>
<p>3.2 Reverso online 
</p>
<p>C'est un outil de chez Softissimo pour la  traduction automatique en ligne de textes ou pages 
web. Cet outil peut fonctionner en PC, Internet, Intranet soit sous la forme d'une application 
autonome. L'adresse de traducteur est http://www.reverso.net/textonly/default.asp. 
</p>
<p>3.3 Sandoh 
</p>
<p>SANDOH (Syst&#232;me d'ANalyse des DOcuments H&#233;t&#233;rog&#232;ne) est un outil permettant analyse 
d'un document h&#233;t&#233;rog&#232;ne en zones homog&#232;nes. Nous avons d&#233;velopp&#233; cet outil pour analyser 
un texte h&#233;t&#233;rog&#232;ne selon la m&#233;thode du diagnostic de la langue et du codage n-grammes et la 
m&#233;thode de la segmentation progressive pour segmenter un texte h&#233;t&#233;rog&#232;ne en zones 
homog&#232;nes. Le r&#233;sultat de l&#8217;analyse est le nom d&#8217;un couple &lt;langue, codage&gt; si  ce document 
est homog&#232;ne, sinon, les zones et le couple &lt;langue, codage&gt; utilis&#233; dans chaque zone {zone-
1, langue-1, codage-1}, {zone-2, langue-2, codage-2}, &#8230;, {zone-n, langue-n, codage-n}.  
</p>
<p>Cet outil se trouve sur le site web http://www-clips.imag.fr/geta/User/hung.vo-
trung/id_langue/web_fr/Index.htm. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VO TRUNG Hung 
</p>
<p>4 Construction d&#8217;outil de traduction automatique multilingue 
</p>
<p>4.1 Architecture du syst&#232;me 
</p>
<p>Nous avons d&#233;velopp&#233; un outil pour traduire automatiquement des textes (multilingues ou 
monolingues) &#224; partir de traducteurs existants en ligne. L'architecture du syst&#232;me est la 
suivante : 
</p>
<p> 
Moteur de traduction 
</p>
<p> 
- Diagnostic et segmentation 
</p>
<p>- S&#233;lection des traducteurs 
</p>
<p>- Envoi des requ&#234;tes 
</p>
<p>- Traitement et visualisation 
</p>
<p> 
</p>
<p> 
</p>
<p>Texte traduit dans 
la langue 
souhait&#233;e 
</p>
<p> 
</p>
<p> 
</p>
<p>Texte traduisible 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1.  Syst&#232;me de la traduction automatique multilingue 
</p>
<p>4.2 Diagnostic et segmentation 
</p>
<p>Le texte d&#8217;entr&#233;e peut-&#234;tre un texte multilingue ou multicodage (on peut copier/coller &#224; partir 
de plusieurs sites web diff&#233;rents, ou bien les textes re&#231;us peuvent &#234;tre h&#233;t&#233;rog&#232;nes). Nous 
extrayons chaque paragraphe pour diagnostiquer la langue et le codage et envoyer aux 
serveurs de traduction parce que ces serveurs n&#8217;acceptent souvent que des textes de longueur 
inf&#233;rieure &#224; 150 mots. Si le paragraphe est monolingue, nous l&#8217;envoyons imm&#233;diatement au 
serveur, sinon  il faut segmenter en zones monolingues dont chacune correspond &#224; une ou 
plusieurs phrases. Apr&#232;s le diagnostic de la langue et du codage, il faut &#233;ventuellement 
convertir le codage du texte vers le syst&#232;me de codage accept&#233; par le serveur de traduction. 
</p>
<p>4.3 S&#233;lection des traducteurs  
</p>
<p>Nous r&#233;utilisons les traducteurs gratuits en ligne et composons deux traducteurs si le couple 
source-cible direct n&#8217;existe pas en prenant l&#8217;anglais comme pivot. En effet, si un syst&#232;me 
comme Systran, Gist-in-Time, Reverso, &#8230; a un traducteur pour la langue L, il en a toujours 
un entre L et l&#8217;anglais. Certainement les traductions &#8220;double&#8221; sont de qualit&#233; nettement 
inf&#233;rieure aux traductions simples. Mais nous sommes en contexte d&#8217;acc&#232;s &#224; l&#8217;information et 
les r&#233;sultats restent le plus souvent utilisables. Par exemple, pour traduire un texte fran&#231;ais en 
japonais, nous pouvons composer deux traducteurs fran&#231;ais &#8594; anglais et anglais &#8594; japonais 
(du serveur de traduction Systran). De m&#234;me, pour traduire un texte arabe en fran&#231;ais, nous 
pouvons composer le moteur bilingue arabe &#8594; anglais (du serveur de 
FreeLanguageTranslation) et anglais &#8594; fran&#231;ais (du serveur de  Systran). 
Avec l'outil Sandoh, nous pouvons traduire un texte dans la langue souhait&#233;e m&#234;me si nous ne 
savons pas quelle est la langue du texte source. Sandoh diagnostiquera la langue du texte, puis </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;utilisation de traducteurs gratuits pour d&#233;velopper des syst&#232;mes multilingues 
</p>
<p>le syst&#232;me d&#233;terminera un traducteur pour la paire de langues correspondante. Cette fonction 
est tr&#232;s confortable pour traduire des courriers, des sites web, des documents qu&#8217;on n&#8217;a pas 
marqu&#233;s la langue utilis&#233;e. 
</p>
<p>4.4 Envoi des requ&#234;tes 
</p>
<p>Apr&#232;s avoir d&#233;termin&#233; le serveur de TA ad&#233;quat, nous lui envoyons une requ&#234;te au serveur de 
traduction. Le r&#233;sultat obtenu est un fichier sous la forme HTML. 
</p>
<p>Cela est r&#233;alis&#233; par la fonction get_doc(), que nous avons &#233;crite en Perl. Pour traduire un 
texte, le programme appelle cette fonction sur chaque unit&#233; de traduction d&#233;termin&#233;e par la 
segmentation avec en param&#232;tres l&#8217;URL du site web de traduction, le contenu du segment &#224; 
traduire, la paire de langues source et cible. Par exemple, pour traduire un texte sur le serveur 
Systran, nous appelons get_doc() de la fa&#231;on suivante : 
</p>
<p>@res = get_doc(&quot;www.systranbox.com/systran/box? systran_text=$phrase[$j]&amp;systran_lp=$ls_lc&quot;);  
</p>
<p>Les serveurs de TA acceptent souvent des codages diff&#233;rents pour les m&#234;mes langues (par 
exemple, EUC_jp ou Shift-JIS pour le japonais, ISO-8958-1 ou Unicode pour le Fran&#231;ais). Il 
faut convertir le codage du texte en codage accept&#233; du serveur avant l&#8217;envoi d&#8217;une requ&#234;te de 
la traduction. 
</p>
<p>4.5 Exp&#233;rimentation 
</p>
<p>Nous avons d&#233;velopp&#233; un site web qui permet de traduire automatiquement 11 langues avec 
55 paires de langues diff&#233;rentes en traduction simple. Cet outil permet de traduire des textes 
entr&#233;s directement dans une bo&#238;te de texte, ou contenus dans des fichiers sur le disque local. 
La longueur du texte &#224; traduire n&#8217;est pas limit&#233;e. Ce texte peut &#234;tre monolingue ou 
multilingue.  
</p>
<p>5 Applications possibles 
</p>
<p>L&#8217;application des syst&#232;mes de traduction automatique &#224; la multilingu&#239;sation des logiciels. 
Nous pensons &#224; appliquer ces syst&#232;mes &#224; deux niveaux. Au premier niveau, il s&#8217;agira de 
traduire des messages, des fichiers de messages, des menus, des fichiers d&#8217;aide, des 
documents en localisation des logiciels (par exemple, transcrire les fichiers de messages en 
Ariane G5). Au deuxi&#232;me niveau, on l&#8217;utilisera comme un module interne dans des syst&#232;mes 
multilingues, pour traduire directement &#224; l&#8217;ex&#233;cution des messages d&#8217;une langue dans une 
autre. L&#8217;application des traducteurs au deuxi&#232;me niveau permettra de g&#233;rer facilement 
l&#8217;interface d&#8217;utilisateur. Nous pourrons alors construire un logiciel multilingue qui comprend 
un seul code de programme,  les catalogues de messages, et un module de traducteur.  
</p>
<p>L'int&#233;gration dans les syst&#232;mes de communication sur Internet.  Nous pr&#233;voyons aussi 
d&#8217;utiliser cet outil dans les syst&#232;mes de courrier &#233;lectronique (pour traduire automatiquement 
les courriers re&#231;us dans la langue d'utilisateur), les syst&#232;mes de dialogue multilingue en ligne 
(pour dialoguer en plusieurs langues), les syst&#232;mes de commerce &#233;lectronique, etc. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VO TRUNG Hung 
</p>
<p>Le traitement de corpus multilingues.  Cet outil servira enfin &#224; produire des corpus en 
nouvelle langue (ou au moins &#224; produire un premier jet, comme cela commence dans le projet 
TraCorpEx), &#224; &#233;valuer des corpus (gr&#226;ce aux corpus test&#233;s), etc. 
</p>
<p>6 Perspectives 
</p>
<p>Dans le projet TraCorpEx, qui vise &#224; &#233;valuer la qualit&#233; de traducteurs &#224; partir des corpus 
multilingues existants (par exemple, le corpus BTEC avec les langues comme anglais, 
fran&#231;ais, japonais, &#8230;) et ajouter des langues &#224; des corpus multilingues d&#8217;exemples. Nous 
avons commenc&#233; &#224; traduire la partie anglaise de ce corpus en fran&#231;ais par des traducteurs 
diff&#233;rents (Systran, WorlLingo, &#8230;). Nous &#233;valuerons ensuite ces traductions par diverses 
m&#233;thodes.    
</p>
<p>&#192; court terme, nous allons aussi &#233;tendre notre syst&#232;me par une interface permettant de lui 
&#8220;d&#233;clarer&#8221; des traducteurs disponibles sur le web, avec toutes les informations n&#233;cessaires 
(couples de langue, codages, formats, param&#233;trabilit&#233;). Nous &#233;tendrons aussi la fonction 
getdoc() pour permettre d&#8217;appeler des traducteurs &#8220;Pro&#8221; install&#233;s sur notre serveur, car ils sont 
bien plus rapides et param&#233;trables que les versions web.  
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BLANCHON H., BOITET C. &amp; CAELEN J. (1999), Participation francophone au consortium C-
STAR II, La Tribune des Industries de la Langue et du Multim&#233;dia , Vol. 31-32 (August-
December 1999) : pp. 15-23. 
</p>
<p>BOITET C., BLANCHON H. (1995), Multilingual Dialogue-Based MT for monolingual authors: 
the LIDIA project and a first mockup, Machine Translation, Vol. 9,  pp 99-132. 
</p>
<p>HUTCHINS J. (2001), Machine Translation Over Fifty Years, Revue HEL (Histoire 
Epistemologie Langage), publi&#233; par la Soci&#233;t&#233; d'histoire et d'&#233;pist&#233;mologie des sciences du 
langage (SHESL), Universit&#233; de Paris VII, Vol. 23. 
</p>
<p>HUTCHINS J. (1999), The development and use of machine translation systems and computer-
based translation tools, International Symposium on Machine Translation and Computer 
Language Information Processing, Beijing, Chine. 
</p>
<p>LAROSSE L. (1998), M&#233;thodologie de l'&#233;valuation des traductions, Meta, Vol. 43, N&#176; 2, 
Presses de l'Universit&#233; de Montr&#233;al. 
</p>
<p>VO TRUNG H. (2003), &#201;valuation des m&#233;thodes et outils pour identifier automatiquement la 
langue et le codage d'un texte homog&#232;ne, Actes de la conf&#233;rence MAJECSTIC'03, octobre 
2003, Marseille, France.  
</p>
<p>VO TRUNG H. (2004),  SANDOH - un syst&#232;me d'analyse de documents h&#233;t&#233;rog&#232;nes, Actes de 
la conf&#233;rence JADT 2004 (Journ&#233;es internationales d'Analyse statistique des Donn&#233;es 
Textuelles), mars 2004, Louvain-la-Neuve, Belgique. </p>

</div></div>
</body></html>