<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Acquisition de relations lexicales d&#233;sambigu&#239;s&#233;es &#224; partir du Web</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>Acquisition de relations lexicales d&#233;sambigu&#239;s&#233;es &#224; partir du Web
</p>
<p>Chrystel Millon
</p>
<p>Equipe DELIC &#8211; Universit&#233; de Provence
29, Av. Robert Schuman &#8211; 13621 Aix-en-Provence Cedex 1
</p>
<p>Krystelkay@aol.com
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
Nous montrons dans cet article qu&#8217;un pr&#233;-&#233;tiquetage des usages des mots par un algorithme de
d&#233;sambigu&#239;sation  tel  qu&#8217;HyperLex (V&#233;ronis,  2003,  2004)  permet  d&#8217;obtenir  des  relations
lexicales  (du  type  NOM-ADJECTIF,  NOM  de  NOM,  NOM-VERBE)  beaucoup  plus
exploitables,  parce  qu&#8217;elles-m&#234;mes  cat&#233;goris&#233;es  en  fonction  des  usages.  De  plus,  cette
technique permet  d&#8217;obtenir  des relations pour  des usages tr&#232;s  peu fr&#233;quents,  alors qu&#8217;une
extraction indiff&#233;renci&#233;e &#171; noie &#187; ces relations au milieu de celles correspondant aux usages les
plus fr&#233;quents. Nous avons conduit une &#233;valuation sur un corpus de plusieurs milliers de pages
Web comportant l&#8217;un des 10 mots-cibles tr&#232;s polys&#233;miques choisis pour cette exp&#233;rience, et
nous montrons que la pr&#233;cision obtenue est tr&#232;s bonne, avec un rappel honorable, suffisant en
tout  cas  pour  de  nombreuses  applications.  L&#8217;analyse  des  erreurs  ouvre  des  perspectives
d&#8217;am&#233;liorations pour la suite de notre travail de th&#232;se.
</p>
<p>This study shows that a pre-labeling of word uses by means of a disambiguation algorithm such
as  HyperLex (V&#233;ronis, 2003,  2004) allows a better  extraction of lexical relations (NOUN-
ADJECTIVE, NOUN &#8220;de&#8221; NOUN, NOUN-VERB,  etc.), since these relations are categorised
with respect to word use. In addition, this technique enables us to retrieve relations for very
infrequent word uses, which otherwise would be buried in the residual noise corresponding to
the most frequent uses. We performed an evaluation on several thousand web pages containing
a target word among a set of 10 highly polysemic ones. We show that the precision obtained is
very good,  with a quite honourable recall, sufficient in any case for many applications. The
analysis of errors opens avenues of research for the rest of our PhD work.
</p>
<p>Mots-clefs &#8211; Keywords
Corpus, relations lexicales, acquisition automatique, d&#233;sambigu&#239;sation lexicale.
</p>
<p>Corpus, lexical relations, automatic acquisition, word sense disambiguation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chrystel MILLON
</p>
<p>1 Introduction 
Le d&#233;veloppement d&#8217;applications de TAL telles que la traduction automatique ou la recherche
d&#8217;informations est fortement frein&#233; par le manque de donn&#233;es lexicales d&#233;taill&#233;es pour chacune
des langues. En particulier, les diff&#233;rentes relations lexicales (NOM &#8211; ADJECTIF, NOM1 DE
NOM2,  NOM &#8211;  VERBE, etc.)  qui  lient  le  mot  &#224;  ses  cooccurrents  en  contexte  seraient
int&#233;ressantes  &#224;  conna&#238;tre  de  fa&#231;on  d&#233;taill&#233;e,  car  elles  sont  souvent  des  indices  fortement
d&#233;sambigu&#239;sateurs. Par exemple, pour traduire en anglais le mot  barrage, il faut au pr&#233;alable
avoir  identifi&#233; son  sens en contexte :  barrage  hydraulique sera  traduit  par  dam,  barrage
routier par  roadblock,  match de barrage par  play-off  game, etc. On voit dans l&#8217;exemple ci-
dessus que la simple pr&#233;sence d&#8217;un adjectif (hydraulique, routier) ou d&#8217;une relation NOM1 DE
NOM2 (match de N), suffit &#224; indiquer le sens du mot dans le contexte incrimin&#233;. Il en va de
m&#234;me pour les relations NOM &#8211; VERBE (sujet, objet) : on construit ou on d&#233;molit un barrage
hydraulique, alors qu&#8217;on dresse ou on d&#233;mant&#232;le un barrage routier.
</p>
<p>On ne dispose pas &#224; l&#8217;heure actuelle de grande base de donn&#233;es lexicale listant ces &#171; affinit&#233;s &#187;
entre  lex&#232;mes  du  fran&#231;ais.  La  cr&#233;ation  manuelle  d&#8217;une  telle  ressource  serait  un  travail
gigantesque. La lente constitution du Dictionnaire Explicatif et Combinatoire de (Mel&#8217;cuk et
al.,1984, etc.), qui ne liste qu&#8217;une petite partie de ces relations, en est un bon exemple. Or, il
semble que  si l&#8217;on disposait  d&#8217;une grande quantit&#233;  de  textes  informatis&#233;s,  il pourrait  &#234;tre
possible  d&#8217;en  extraire  par  des  moyens  automatiques  ou  semi-automatiques  au  moins  les
relations lexicales les plus importantes et r&#233;currentes. Cette recherche de relations lexicales a
des  points  communs avec  la  recherche  de  termes  complexes,  pour  lesquels  il existe  des
m&#233;thodes et  logiciels d&#8217;extraction tels que, pour le fran&#231;ais,  Acabit  (Daille, 1994) et  Lexter
(Bourigault,  1994).  Bien que les relations recherch&#233;es ici soient  plus g&#233;n&#233;rales (toutes  ne
constituent  pas  des  &#171; termes &#187;)  et  rel&#232;vent  des  &#171; pr&#233;f&#233;rences &#187;  lexicales  (Wilks,  1975),
restrictions de s&#233;lection (Katz &amp; Fodor, 1964) ou collocations (Benson, 1990 ; Smadja, 1993 ;
Cruse, 1986) g&#233;n&#233;rales de la langue, on peut toutefois s&#8217;inspirer des m&#234;mes techniques, bas&#233;es
sur  la  recherche  de  patrons  syntaxiques,  comme nous  le  verrons  ci-apr&#232;s.  La  litt&#233;rature
t&#233;moignant d&#8217;une terminologie disparate et de concepts souvent flous et contradictoires, nous
employons ici le terme relation lexicale, plus neutre, d&#233;fini comme une cooccurrence lexicale
entre  deux lex&#232;mes li&#233;s syntaxiquement.  Nous  centrons  le pr&#233;sent  travail sur  l&#8217;importance
d&#8217;une cat&#233;gorisation lexicale automatique des relations lexicales, le tri des relations lexicales
extraites sera effectu&#233; plus tard. 
</p>
<p>Une difficult&#233;, lorsqu&#8217;on s&#8217;int&#233;resse &#224; la langue g&#233;n&#233;rale, et non &#224; la terminologie d&#8217;un domaine
sp&#233;cialis&#233;,  consiste  &#224;  classifier  les  relations  lexicales  obtenues  en  fonction  des  diff&#233;rentes
acceptions des mots. Le tableau 1 donne par exemple les 10 adjectifs les plus fr&#233;quents en
cooccurrence avec le mot barrage dans le corpus issu du World Wide Web utilis&#233; pour cette
&#233;tude. D&#8217;une part, les relations lexicales extraites sont totalement m&#233;lang&#233;es (on voit qu&#8217;il faut
ranger  les  adjectifs  grand,  hydro&#233;lectrique,  etc. avec  barrage1 [&#171; barrage  hydraulique &#187;];
routier,  faux avec  barrage2 [&#171; barrage routier &#187;]).  D&#8217;autre part,  la tr&#232;s grande disparit&#233; des
fr&#233;quences des acceptions (qui suit une loi zipfienne, comme il est connu depuis [Thorndike &amp;
Lorge, 1938]) fait que les mots associ&#233;s aux usages les moins fr&#233;quents (par exemple fatal,
d&#233;cisif associ&#233;s &#224;  barrage en tant  que rencontre  sportive, qui repr&#233;sente moins de 5% des
occurrences) sont  totalement noy&#233;s dans les relations lexicales concernant le ou les usages
majoritaires (ici, &#171; barrage hydraulique &#187;).
Les m&#233;thodes existantes d&#8217;extraction automatique de collocations ne tiennent pas compte des
usages  des  mots.  Ainsi,  que  les auteurs  adoptent  une  approche essentiellement  statistique</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition de relations lexicales d&#233;sambigu&#239;s&#233;es &#224; partir du Web
</p>
<p>(Church,  Hanks,  1989)  ou  bien  syntaxico-statistique  (Smadja,  1993),  de  nombreuses
collocations relatives aux usages peu fr&#233;quents des mots sont a fortiori omises.
</p>
<p>ADJECTIF Usage Freq
grand hydraulique 304
petit hydraulique 85
hydro&#233;lectrique hydraulique 71
routier routier 68
faux routier 31
mobile hydraulique 27
agricole hydraulique 26
haut hydraulique 23
hydro-&#233;lectrique hydraulique 22
ancien hydraulique 21
</p>
<p>Tableau 1 : Les 10 adjectifs les plus fr&#233;quents en cooccurrence avec barrage
Nous  explorons  dans  cette  communication  la  possibilit&#233;  d&#8217;exploiter  une  cat&#233;gorisation
automatique pr&#233;alable des usages de mots. Toutefois, si une telle cat&#233;gorisation devait faire
intervenir des ressources lexicales importantes (incluant celles que nous cherchons &#224; extraire),
nous  serions  face  &#224;  une  circularit&#233;  manifeste.  (Sch&#252;tze,  1998)  et  (V&#233;ronis,  2003)  ont
heureusement montr&#233; qu&#8217;on pouvait effectuer une cat&#233;gorisation automatique par l&#8217;examen
des similarit&#233;s entre contextes directement &#224; partir de grands corpus sans ressources lexicales
(s&#233;mantiques) pr&#233;existantes. Nous allons plus pr&#233;cis&#233;ment consid&#233;rer ici l&#8217;aide qu&#8217;offre la pr&#233;-
cat&#233;gorisation op&#233;r&#233;e par l&#8217;algorithme HyperLex (V&#233;ronis, 2003, 2004)1 pour l&#8217;extraction des
relations de type  NOM  &#8211; ADJECTIF,  NOM1 DE NOM2,  NOM &#8211;  VERBE.  Cet  algorithme
permet d&#8217;extraire les diff&#233;rents usages d&#8217;un mot. L&#8217;avantage d&#8217;HyperLex, contrairement aux
m&#233;thodes pr&#233;c&#233;demment propos&#233;es (vecteurs de mots, cf. Sch&#252;tze, 1998) est la d&#233;tection des
usages tr&#232;s peu fr&#233;quents (de l&#8217;ordre de 1% des occurrences).
</p>
<p>2 L&#8217;algorithme HyperLex 
Nous  exposons  tr&#232;s  bri&#232;vement  dans  cette  section  la  m&#233;thode  qui  sous-tend  l&#8217;algorithme
HyperLex (voir [V&#233;ronis, 2003, 2004] pour une pr&#233;sentation d&#233;taill&#233;e). 
</p>
<p>A partir  d&#8217;un  mot-cible donn&#233;,  barrage par  exemple,  seuls  les contextes  qui  contiennent
barrage sont  retenus.  Ces  contextes  sont  ensuite  lemmatis&#233;s  et  &#233;tiquet&#233;s  morpho-
syntaxiquement, et  filtr&#233;s en fonction d&#8217;un certain nombre de crit&#232;res (&#233;limination des mots
fr&#233;quents, etc.). Une fois les contextes filtr&#233;s, les mots qui apparaissent en cooccurrence avec
le mot-cible servent &#224; cr&#233;er un graphe pond&#233;r&#233; par la force d&#8217;association entre cooccurrents.
Les  mots  constituent  les  n&#339;uds  du  graphe.  Les  ar&#234;tes  du  graphe  repr&#233;sentent  les  inter-
connexions  entre  les  mots  qui  se  retrouvent  au  sein du  m&#234;me contexte.  Ainsi les  noms
production et &#233;lectricit&#233; dans l&#8217;exemple ci-dessous sont reli&#233;s (figure 1).
</p>
<p>Outre  la  production d&#8217;&#233;lectricit&#233;,  le  BARRAGE permettra  de  r&#233;guler  le  cours  du
fleuve&#8230;
</p>
<p>1 D&#233;monstration en ligne : http://www.up.univ-aix.fr/veronis</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chrystel MILLON
</p>
<p>Figure 1 : Graphe des cooccurrences du mot barrage (d&#8217;apr&#232;s V&#233;ronis, 2004)
</p>
<p>Les inter-connexions entre les mots font &#233;merger des composantes fortement connexes (figure
1), qui correspondent aux diff&#233;rents usages du mot-cible du corpus analys&#233;. 
</p>
<p>L&#8217;algorithme HyperLex a &#233;t&#233; &#233;valu&#233; sur 10 mots-cibles tr&#232;s polys&#233;miques (barrage, d&#233;tention,
formation,  lancement,  organe,  passage,  restauration,  solution,  station et  vol) &#224; partir d&#8217;un
corpus de plusieurs milliers de pages Web constitu&#233; pour chacun des mots-cibles &#224; l&#8217;aide d&#8217;un
m&#233;ta-moteur de recherche (Copernic Agent).  Seul un petit nombre d&#8217;usages a &#233;t&#233; omis par
l&#8217;algorithme : la quasi-totalit&#233; des usages de fr&#233;quence sup&#233;rieure ou &#233;gale &#224; 5% dans le corpus
est  correctement  d&#233;tect&#233;e,  bien que  dans quelques  cas  les regroupements  ou  absences de
regroupements puissent &#234;tre critiqu&#233;s. Ainsi pour barrage, quatre composantes &#233;mergent, que
nous  d&#233;signons  par  le  mot  le  plus  fr&#233;quent  de  chacune  d&#8217;elles :  EAU, ROUTIER,
FRONTIERE, MATCH, qui repr&#233;sentent bien les emplois dans le corpus recueilli.
</p>
<p>Par ailleurs, HyperLex fournit un score qui permet d&#8217;&#233;tiqueter chaque contexte avec l&#8217;usage le
plus probable du mot-cible qu&#8217;il contient (V&#233;ronis, 2004). Un coefficient de fiabilit&#233; variant
entre 0 et 1 est associ&#233; &#224; l&#8217;&#233;tiquetage et permet de r&#233;gler le rappel. La pr&#233;cision de l&#8217;&#233;tiquetage
est  remarquable,  puisqu&#8217;elle  a  &#233;t&#233;  &#233;valu&#233;e  &#224;  97%  sur  un  &#233;chantillon  al&#233;atoire  de  1000
contextes,  pour  un  rappel  de  82%,  correspondant  &#224;  un  coefficient  de  fiabilit&#233;  de  0.5
(l&#8217;&#233;tiquetage de base ou baseline, &#233;tant de 73%).
</p>
<p>3 Extraction automatique de relations lexicales
Nous reprenons les dix mots-cibles et les corpus de pages Web constitu&#233;s dans le cadre de
l&#8217;&#233;valuation  de  l&#8217;algorithme  HyperLex (voir  section  pr&#233;c&#233;dente).  Nous  avons  &#233;crit  un
programme qui extrait automatiquement les relations de type NOM &#8211; ADJECTIF, NOM1 DE
NOM2 et NOM &#8211; VERBE en fonction de patrons syntaxiques repr&#233;sent&#233;s par des expressions
r&#233;guli&#232;res simples (tableau 21). Des filtres linguistiques sont ensuite appliqu&#233;s pour &#233;liminer les
candidats adjectivaux, nominaux ou verbaux ind&#233;sirables, soit parce qu&#8217;ils sont trop g&#233;n&#233;raux
(noms &#171; quantifieurs &#187;, auxiliaires, etc.), soit parce qu&#8217;ils correspondent &#224; des erreurs connues
et r&#233;currentes dans l&#8217;&#233;tiquetage morpho-syntaxique. 
</p>
<p>1 L&#8217;ast&#233;risque  symbolise  les  items  pouvant  se  r&#233;p&#233;ter  n fois ;  les  parenth&#232;ses  repr&#233;sentent  les  items
optionnels ; enfin, les items barr&#233;s dans les patrons syntaxiques verbaux sont ceux ne pouvant y figurer, le
nom et le verbe peuvent &#234;tre s&#233;par&#233;s par quatre items textuels. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition de relations lexicales d&#233;sambigu&#239;s&#233;es &#224; partir du Web
</p>
<p>Pour les noms et les verbes, la place du mot-cible joue un r&#244;le important dans l&#8217;identification
de son usage en contexte. Le nom vol  n&#8217;a par exemple pas le m&#234;me sens dans les s&#233;quences
carnet de vol et vol de carnet. Deux listes sont ainsi cr&#233;&#233;es pour les verbes et les noms selon la
position (ant&#233;pos&#233;e ou postpos&#233;e) du mot-cible. Les noms propres et les noms communs sont
&#233;galement s&#233;par&#233;s. Notre programme produit donc pour chaque usage, une liste d&#8217;adjectifs,
deux listes de verbes et quatre listes de noms.
</p>
<p>Nom Adjectif
Adjectif NomCIBLE
NomCIBLE (Adverbe)* Adjectif* ((Coordination) (Adverbe)* Adjectif)*
NomCIBLE (Adverbe)* Adjectif* ((Juxtaposition) (Adverbe)* Adjectif)*
</p>
<p>Nom de Nom
NomCIBLE de Nom2
Nom1 de NomCIBLE 
Nom - Verbe
NomCIBLE ( verbe conjugu&#233; ou infinitif ou ponctuation forte)
</p>
<p>0,4
 VerbeETRE et AVOIR
</p>
<p>VerbeETRE et AVOIR (verbe conjugu&#233; ou infinitif ou ponctuation forte ou pronoms personnels sujets)
0,4 NomCIBLE
</p>
<p>Tableau 2 : Patrons syntaxiques
</p>
<p>Les relations lexicales extraites sont cat&#233;goris&#233;es automatiquement selon l&#8217;&#233;tiquetage pr&#233;alable
effectu&#233; par HyperLex. Aucun filtrage statistique n&#8217;est effectu&#233; sur les listes obtenues. En effet,
nous  partageons le point  de vue de  (Bourigault  et  al., &#224;  para&#238;tre)  pour  qui &#171; l&#8217;exp&#233;rience
montre qu&#8217;aucune mesure statistique ne peut suppl&#233;er l&#8217;expertise de l&#8217;analyste, en particulier
parce qu&#8217;il y a toujours des candidats termes de fr&#233;quence 1 dont l&#8217;analyse est int&#233;ressante. &#187;
Ce point de vue nous semble encore plus fond&#233; dans le cas de la langue g&#233;n&#233;rale, et dans notre
cas particulier, o&#249; nous essayons de tenir compte des usages tr&#232;s peu fr&#233;quents des mots-
cibles : la fr&#233;quence des usages se r&#233;percute tout naturellement sur les fr&#233;quences des relations
lexicales extraites pour  cet  usage.  De plus,  le seuillage appliqu&#233; &#224; l&#8217;aide du coefficient de
fiabilit&#233;  peut  encore  r&#233;duire  les  fr&#233;quences  observ&#233;es.  Ainsi,  barrage  de  qualification
n&#8217;appara&#238;t que 4 fois dans les quelque 7000 contextes de  barrage  dans notre corpus. Apr&#232;s
seuillage, il n&#8217;en reste qu&#8217;une occurrence. Cette relation, bien que de fr&#233;quence tr&#232;s faible, est
manifestement pertinente pour l&#8217;usage MATCH. 
</p>
<p>Etant donn&#233; n&#233;anmoins que les relations de fr&#233;quence 1 (hapax) risquent d&#8217;&#234;tre plus fortement
bruit&#233;es,  nous avons consid&#233;r&#233; les r&#233;sultats  de la validation des relations lexicales de deux
mani&#232;res : dans leur globalit&#233; (quelle que soit la fr&#233;quence d&#8217;apparition des relations lexicales),
et  en ne tenant  compte que de celles de fr&#233;quence &gt;1. Nous donnerons donc des r&#233;sultats
concernant quatre configurations : la totalit&#233; des relations lexicales extraites au seuil de 0,5 et
de 0,6 et sans les hapax aux m&#234;mes seuils.
</p>
<p>4 Premiers r&#233;sultats
Les relations lexicales extraites ont  &#233;t&#233; valid&#233;es en examinant les contextes d&#8217;apparition de
leurs occurrences. Il suffit qu&#8217;une seule occurrence soit correcte pour que la relation lexicale
soit valid&#233;e. Ainsi la relation barrage - fermer de l&#8217;usage EAU est valid&#233;e car elle est correcte
dans des cas comme :
</p>
<p>Le  barrage Robert-Bourassa, qui  ferme la vall&#233;e de La Grande Rivi&#232;re, est constitu&#233; de 23
millions de m&#232;tres cubes de remblai.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chrystel MILLON
</p>
<p>alors que l&#8217;une des occurrences extraites est incorrecte, le sujet n&#8217;&#233;tant pas barrage mais bras :
Lors de crues extr&#234;mes,  les deux  bras du  barrage Maesland  ferment &#224; la mer du Nord la
Nieuwe Waterweg large de 360 m&#232;tres.
</p>
<p>Nous ne pouvons, faute de place, pr&#233;senter des r&#233;sultats exhaustifs pour  chacun des mots.
Nous  d&#233;taillerons  donc  seulement  le  cas  de  barrage (et  plus  particuli&#232;rement  la  relation
ADJECTIF -NOM) et nous donnerons ensuite des r&#233;sultats globaux pour les 10 mots-cibles. 
</p>
<p>4.1 Mot-cible barrage
</p>
<p>Le tableau 3 donne les 10 premiers adjectifs extraits  pour  barrage avec un coefficient de
fiabilit&#233;  minimum de  0,5,  en  r&#233;ponse  &#224;  ceux  pr&#233;sent&#233;s  de  fa&#231;on  non-cat&#233;goris&#233;e  dans
l&#8217;introduction (tableau 1). 
</p>
<p>On peut  noter  que la cat&#233;gorisation obtenue est  tr&#232;s  bonne. Seuls deux adjectifs semblent
cat&#233;goris&#233;s de fa&#231;on incorrecte : une occurrence de hydraulique pour l&#8217;usage ROUTIER et de
hydro&#233;lectrique  pour  FRONTIERE.  L&#8217;examen des contextes concern&#233;s1 confirme bien qu&#8217;il
s&#8217;agit d&#8217;une erreur de cat&#233;goristation d&#8217;HyperLex.
</p>
<p> 
</p>
<p>EAU Freq ROUTIER Freq FRONTIERE Freq MATCH Freq
grand 116 routier 49 terrestre 7 ultime 2
petit 32 filtrant 4 alg&#233;rien 3 d&#233;cisif 1
hydro-&#233;lectrique 29 faux 3 continu 2 fatal 1
mobile 19 fixe 2 frontalier 2 irlandais 1
existant 11 annuel 1 routier 2
haut 10 diff&#233;rent 1 autoroutier 1
gonflable 8 grand 1 barbel&#233; 1
d&#233;versant 7 hydraulique 1 contemporain 1
principal 6 ill&#233;gal 1 hydro&#233;lectrique 1
vieux 5 long 1 isra&#233;lien 1
</p>
<p>Tableau 3 : Les 10 premi&#232;res relations barrage - adjectif au seuil 0,5
Le tableau 4 donne les taux de pr&#233;cision et de rappel (toujours pour le mot-cible barrage) pour
chacun des types de relations lexicales avec les quatre configurations test&#233;es. On voit que la
pr&#233;cision est excellente quel que soit le type de relation lexicale, sauf pour la relation Barrage
(sujet) &#8211; VERBE dont le meilleur score n&#8217;atteint que 78%. La configuration qui a le plus fort
taux de pr&#233;cision est  la non-consid&#233;ration des hapax au seuil de 0,6,  mais avec un taux de
rappel assez faible. Il faut noter cependant que notre mesure de rappel est tr&#232;s s&#233;v&#232;re : nous
consid&#233;rons comme pertinents tous les mots qui entrent en relation dans le corpus avec le mot-
cible, sans distinction linguistique aucune. Ainsi, l&#8217;absence de bavarois dans les adjectifs li&#233;s &#224;
barrage (usage  MATCH) est consid&#233;r&#233; comme autant p&#233;nalisant que  qualificatif (tous deux
hapax). Or, intuitivement, l&#8217;omission du second semble plus dommageable que l&#8217;omission du
premier, qui ne semble &#234;tre reli&#233; &#224; barrage que parce qu&#8217;il appartient &#224; une (tr&#232;s grande) classe
d&#8217;adjectifs g&#233;ographiques  (pays,  r&#233;gions,  villes) :  ceci est  une  des  directions  de  recherche
future pour notre travail de th&#232;se.
</p>
<p>1 Contexte de barrage - hydraulique : &#171; Fond&#233;e en 1928, la CIBG vise &#224; promouvoir l'art et la science des
barrages hydrauliques. Elle a environ 6 000 membres et des comit&#233;s dans 80 pays. &#187;
Contexte de  barrage - hydro&#233;lectrique : &#171; Le barrage hydro&#233;lectrique d'Emosson se trouve dans un site
spectaculaire surplombant le petit hameau suisse du Ch&#226;telard &#224; 19 km de Chamonix. [&#8230;] &#187;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition de relations lexicales d&#233;sambigu&#239;s&#233;es &#224; partir du Web
</p>
<p>seuil 0,5 0,6 0,5 0,6 0,5 0,6 0,5 0,6
BARRAGE ADJECTIF 0,88 0,91 0,61 0,47 1,00 1,00 0,23 0,16
NOM1 DE BARRAGE 0,98 0,98 0,56 0,41 0,96 1,00 0,15 0,12
BARRAGE DE NOM2 0,91 0,91 0,70 0,56 0,94 0,92 0,26 0,19
VERBE - BARRAGE 0,87 0,90 0,68 0,54 0,97 1,00 0,23 0,17
BARRAGE - VERBE 0,63 0,67 0,72 0,62 0,76 0,78 0,31 0,25
</p>
<p>TOTALITE SANS LES HAPAX
Pr&#233;cision Rappel Pr&#233;cision Rappel
</p>
<p>Tableau 4 : Pr&#233;cision et rappel des relations extraites pour barrage (tous sens confondus)
</p>
<p>Faute de place, nous ne pouvons d&#233;tailler les r&#233;sultats par usage pour chacune des relations. Le
tableau 5 donne seulement ces r&#233;sultats pour les adjectifs, en regard de la fr&#233;quence estim&#233;e
(par sondage al&#233;atoire) de chacun des usages. On voit que la pr&#233;cision ne d&#233;pend pas de cette
fr&#233;quence. Notre m&#233;thode permet donc d&#8217;obtenir des relations lexicales fiables pour des usages
peu fr&#233;quents des mots-cibles.
</p>
<p>Fr&#233;q.
estim&#233;e 0,5 0,6 0,5 0,6
</p>
<p>EAU 77% 0,89 0,91 1,00 1,00
FRONTIERE 11% 0,86 1,00 1,00 1,00
ROUTIER 8% 0,80 0,83 1,00 1,00
MATCH 4% 1,00 1,00 1,00 n/d
Total 100% 0,88 0,91 1,00 1,00
</p>
<p>TOTALITE SANS LES HAPAX
</p>
<p>Tableau 5 : Pr&#233;cision des adjectifs extraits pour barrage 
</p>
<p>4.2 R&#233;sultats globaux
</p>
<p>Le tableau 6  donne les r&#233;sultats  de  la validation sur  l&#8217;ensemble des  mots-cibles.  On note
toujours un fort taux de pr&#233;cision, sauf pour la relation NOM (sujet) &#8211; VERBE (tableau 6). Ces
r&#233;sultats confirment donc les observations faites pr&#233;c&#233;demment sur le mot barrage.
</p>
<p>seuil 0,5 0,6 0,5 0,6
NOM - ADJECTIF 0,85 0,88 0,94 0,93
CIBLE de NOM2 0,86 0,89 0,93 0,97
NOM1 de CIBLE 0,92 0,94 0,97 0,97
NOM - VERBE 0,59 0,57 0,70 0,71
VERBE - NOM 0,78 0,80 0,86 0,85
</p>
<p>TOTALITE SANS LES HAPAX
</p>
<p>Tableau 6 : Pr&#233;cision globale des relations lexicales valid&#233;es des 10 mots-cibles 
</p>
<p>5 Analyse des erreurs et perspectives
Nous avons analys&#233; les erreurs pour l&#8217;ensemble des mots-cibles, en les cat&#233;gorisant selon le
type  de  source  qui en est  &#224;  l&#8217;origine :  l&#8217;&#233;tiquetage  morpho-syntaxique op&#233;r&#233;  par  Cordial,
l&#8217;&#233;tiquetage des usages par HyperLex ou l&#8217;extraction r&#233;alis&#233;e par notre programme. Le tableau
7  pr&#233;sente  la r&#233;partition  des  erreurs  en  fonction  des  trois  sources  (nous  avons  trait&#233;  les
relations NOM de NOM et NOM -VERBE ind&#233;pendamment de la position).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chrystel MILLON
</p>
<p>Cordial HyperLex Extracteur Total
NOM ADJECTIF 30% 32% 38% 100%
NOM DE NOM 35% 57% 8% 100%
NOM VERBE 20% 12% 67% 100%
</p>
<p>Tableau 7 : Taux d&#8217;erreurs &#171; Sans les Hapax (seuil 0,5) &#187;
</p>
<p>On voit que notre extracteur fonctionne assez bien pour les relations NOM de NOM, mais a
plus de difficult&#233; avec la relation  NOM-ADJECTIF,  et  encore plus avec la relation  NOM-
VERBE, ce qui explique, au moins partiellement, les r&#233;sultats plus modestes obtenus pour cette
cat&#233;gorie. Nous proposons ci-dessous une analyse un peu plus fine des types d&#8217;erreurs.
</p>
<p>&#61623; Erreurs de Cordial
</p>
<p>Nom &#8211; Verbe : Le logiciel  Cordial Analyseur  produit  de nombreuses erreurs d&#8217;&#233;tiquetage
quand un mot a un homographe verbal et qu&#8217;il se trouve dans un patron syntaxique analogue &#224;
celui Verbe &#8211;  Nom (objet) ou  Nom (sujet) &#8211;  Verbe comme le nom commun tonne et le nom
propre Cuba dans les attestations suivantes 
</p>
<p>Le second passager d'Ariane &#233;tait un satellite militaire britannique, Skynet-4E, de 1,5
tonne au lancement
</p>
<p>billet d'avion cuba, vols cuba
</p>
<p>L&#8217;indice formel qui permet d&#8217;identifier un nom propre est la majuscule en initale du mot. Or,
dans la plupart  des contextes pr&#233;sentant cette  particularit&#233;, les noms propres sont &#233;crits en
minuscules. Une partie de ces erreurs pourra &#234;tre &#233;cart&#233;e en ajoutant au protocole de notre
extracteur, la congruence flexionnelle des s&#233;quences Nom &#8211; Verbe, le verbe s&#8217;accordant avec le
sujet. De plus, le logiciel ne reconna&#238;t pas l&#8217;auxiliaire du futur proche, &#224; savoir  aller. Nous
pourrions identifier automatiquement quelques-unes des occurrences de l&#8217;auxiliaire aller gr&#226;ce
&#224; la pr&#233;sence d&#8217;un infinitif qui le suit. D&#8217;autres erreurs sont li&#233;es aux noms  mati&#232;re,  cas et
cours dans les locutions en mati&#232;re de Nom,  en cas de Nom,  en cours de Nom. Il suffira de
v&#233;rifier que ces noms n&#8217;entrent pas dans de telles constructions.
</p>
<p>&#61623; Erreurs d&#8217;HyperLex 
</p>
<p>Certaines des erreurs d&#8217;HyperLex sont dues &#224; la pr&#233;sence de mots fortement connect&#233;s &#224; un
autre  usage  du mot-cible que celui qui appara&#238;t  dans le contexte.  Dans l&#8217;exemple suivant,
l&#8217;occurrence du mot-cible organe est rattach&#233;e aux &#171; dons d&#8217;organes &#187; de fa&#231;on fautive &#224; cause
de la pr&#233;sence du mot (lui-m&#234;me ambigu) greffe :
</p>
<p>Si l&#8217;organe de gestion refuse de constater la d&#233;mission, elle est re&#231;ue au  greffe de la
justice de paix du si&#232;ge social.
</p>
<p>La prise en compte des distances entre mots (en terme de position dans le contexte), ou des
relations dans lesquelles ces mots entrent (ici gestion est directement reli&#233; syntaxiquement &#224;
organe, contrairement &#224;  greffe) pourrait amener une am&#233;lioration majeure au comportement
d&#8217;HyperLex.
</p>
<p>&#61623; Erreurs de l&#8217;extracteur
</p>
<p>Les erreurs de notre programme sont principalement des erreurs de rattachement. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition de relations lexicales d&#233;sambigu&#239;s&#233;es &#224; partir du Web
</p>
<p>Nom &#8211; Adjectif : erreur qui est li&#233;e, soit &#224; l&#8217;absence de ponctuation (menu de page Web par
exemple), soit &#224; l&#8217;absence de la construction Nom1 Adjectif de Nomcible Adjectif: 
</p>
<p>pratique officielle vivante organe consultatif pour &#233;trangers OCEL
</p>
<p>Mais  il  n&#8217;existe  aucun  exemple  de  rupture brutale  de  barrage cons&#233;cutive &#224;  un
tremblement de terre. 
</p>
<p>Cette erreur peut  &#234;tre &#233;vit&#233;e en ajoutant  la s&#233;quence  Nom1 Adjectif  de Nomcible  Adjectif au
protocole d&#8217;extraction et en v&#233;rifiant la congruence flexionnelle entre le mot-cible et l&#8217;adjectif
candidat. 
</p>
<p>Nom &#8211; Verbe : Dans l&#8217;exemple suivant (un autre type de menu de page Web),
Emploi | Les entreprises qui recrutent | Formation |, 
</p>
<p>le mot-cible formation n&#8217;est pas compl&#233;ment d&#8217;objet du verbe recruter. Ce type d&#8217;erreurs peut
&#234;tre &#233;cart&#233; lors du nettoyage des corpus de pages Web. D&#8217;autres erreurs d&#233;coulent des patrons
syntaxiques utilis&#233;s pour extraire les relations de type Nom &#8211; Verbe. 
</p>
<p>Le texte cr&#233;e un juge de la d&#233;tention provisoire.
</p>
<p>Les retenues des barrages r&#233;gularisent les d&#233;bits naturels
</p>
<p>Un filtre est appliqu&#233; sur ces s&#233;quences, &#224; savoir le rejet du verbe candidat si  Nomcible entre
dans une structure Nom1 de Nomcible. Certaines de ces erreurs pourront &#234;tre &#233;vit&#233;es facilement
en &#233;largissant le filtre Nom1 de Nomcible &#224; Nom1 Pr&#233;position Nomcible (les occurrences du mot-
cible ne doivent pas &#234;tre compl&#233;ments de Nom1) et en v&#233;rifiant l&#8217;accord entre le verbe et son
sujet. 
Contrairement  aux  relations  NOM  &#8211;  ADJECTIF et  NOM1  DE  NOM2,  o&#249;  les  variantes
syntaxiques peuvent &#234;tre facilement appr&#233;hend&#233;es (l&#8217;adjectif &#233;pith&#232;te par exemple ne peut &#234;tre
s&#233;par&#233; du nom qu&#8217;il modifie que par des adverbes ou d&#8217;autres adjectifs), les relations NOM &#8211;
VERBE (sujet, objet) sont plus d&#233;licates &#224; extraire puisque le nom-cible peut &#234;tre s&#233;par&#233; du
verbe par des constituants syntaxiques h&#233;t&#233;rog&#232;nes (compl&#233;ments circonstantielles, relatives
par exemple) pouvant &#234;tre de taille cons&#233;quente. De nombreuses relations  Barrage (sujet) &#8211;
VERBE  extraites  sont  incorrectes.  Les  r&#233;cents  travaux  sur  l&#8217;analyse  syntaxique  partielle
(shallow  parsing)  (cf.  Abeill&#233;  et  al.,  2003),  laissent  penser  que  des  progr&#232;s  significatifs
pourraient &#234;tre fait sur l&#8217;extraction de ce type de relations.
</p>
<p>6 Conclusion
Nous avons essay&#233; de montrer dans cet article qu&#8217;un pr&#233;-&#233;tiquetage des usages des mots par
un  algorithme  tel  qu&#8217;HyperLex (V&#233;ronis,  2003,  2004)  permettait  d&#8217;obtenir  des  relations
lexicales  (du  type  NOM-ADJECTIF,  NOM  de  NOM,  NOM-VERBE)  beaucoup  plus
exploitables,  parce  qu&#8217;elles-m&#234;mes  cat&#233;goris&#233;es  en  fonction  des  usages.  De  plus,  cette
technique permet  d&#8217;obtenir  des relations pour  des usages tr&#232;s  peu fr&#233;quents,  alors qu&#8217;une
extraction indiff&#233;renci&#233;e &#171; noierait &#187; ces relations au milieu de celles correspondant aux usages
les plus fr&#233;quents. Nous avons conduit une &#233;valuation sur un corpus de plusieurs milliers de
pages  Web  comportant  l&#8217;un  des  10  mots-cibles  tr&#232;s  polys&#233;miques  choisis  pour  cette
exp&#233;rience, et  nous avons montr&#233; que la pr&#233;cision obtenue &#233;tait tr&#232;s bonne, avec un rappel</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chrystel MILLON
</p>
<p>honorable, suffisant en tout cas pour de nombreuses applications. L&#8217;analyse des erreurs nous a
montr&#233; des perspectives d&#8217;am&#233;liorations pour la suite de notre travail de th&#232;se. Nous &#233;tendrons
notre &#233;tude &#224; d&#8217;autres mots du fran&#231;ais. La base de donn&#233;es lexicale que nous projetons de
r&#233;aliser ainsi que les nombreuses attestations en corpus que nous aurons relev&#233;es permettront
d&#8217;&#233;tablir une typologie plus pr&#233;cise des ph&#233;nom&#232;nes lexicaux, et  de clarifier le d&#233;bat sur la
relation entre items lexicaux et leur possibilit&#233;s et contraintes combinatoires.
</p>
<p>R&#233;f&#233;rences
Abeill&#233; A.,  Cl&#233;ment L.,  Toussenel F.  (2003),  Building  a  treebank  for  French,  Abeill&#233;  A.
Treebanks. Building and unising parsed corpora, pp. 165-187.
Benson M. (1990),  Collocations and general-purpose  dictionaries,  International Journal  of
Lexicography, vol. 3(1), pp. 23-35.
Bourigault D. (1994),  LEXTER, un Logiciel d'EXtraction de TERminologie. Application a
l'acquisition des connaissances &#224; partir de textes, Ph.D. Thesis, Ecole des Hautes Etudes en
Sciences Sociales, Paris. 
Bourigault D.,  Aussenac-Gilles N.,  Charlet J.  (&#224;  para&#238;tre),  Construction  de  ressources
terminologiques ou ontologiques &#224; partir de textes : un cadre unificateur pour trois &#233;tudes de
cas,  Revue  d&#8217;Intelligence  Artificielle [En  ligne :  http://www.univ-
lse2.fr/erss/membres/bourigault/]
Church K., Hanks P. (1989), Word association norms, mutual information, and lexicography,
Computational Linguistics, Vol. 16(1), pp. 76-83.
Cruse D. A. (1986), Lexical Semantics, Cambridge, Cambridge University Press. 
Daille B. (1994),  Approche mixte pour l'extraction de terminologie:  statistique lexicale et
filtres linguistiques, Paris : Universit&#233; de Paris VII. 
Katz J. J, Fodor J. A. (1964), The structure of a semantic theory, In J. A. Fodor and J. J. Katz,
editors, The Structure of Language, chapter 19, pp. 479-518. 
Mel&#8217;cuk I.  A., Arbatchewsky-Jumarie, N., Elnitsky, L.,  Iordanskaja, L.,  Lessard.  A. (1984),
Dictionnaire  explicatif  et  combinatoire  du  fran&#231;ais  contemporain:  Recherches  lexico-
s&#233;mantiques I, Montr&#233;al, Presses de l'Universit&#233; de Montr&#233;al. 
V&#233;ronis J. (2003), Hyperlex : cartographie lexicale pour la recherche d&#8217;informations, Actes de
TALN&#8217;2003, pp. 265-274, Batz-sur-mer (France): ATALA.
V&#233;ronis J.  (2004),  HyperLex :  cartographie  lexicale  pour  la  recherche  d&#8217;informations.
Rapport  Interne  Equipe  DELIC,  Universit&#233;  de  Provence.  [En  ligne :  http://www.up.univ-
mrs.fr/veronis/pdf/2004-hyperlex-rapport.pdf]
Thorndike E. L., Lorge I. (1938),  Semantic counts of English Words, New York, Columbia
University Press.
Sch&#252;tze H. (1998), Automatic word sense discrimination, Computational Linguistics, Vol. 24
(1), pp. 97-124.
Smadja F. (1993), Retrieving collocations from text : Xtract, Computational Linguistics, Vol.
19, pp. 143-177.
Wilks Y. A. (1975),  Preference Semantics, In:  Keenan, E.  (ed),  The Formal Semantics of
Natural Language, Cambridge University Press, pp. 329-348.</p>

</div></div>
</body></html>