<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Appariement bilingue de mots par propagation syntaxique &#224; partir de corpus fran&#231;ais/anglais align&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2004, F&#232;s, 19-22 avril 2004 
</p>
<p>Appariement bilingue de mots par propagation syntaxique &#224; 
partir de corpus fran&#231;ais/anglais align&#233;s  
</p>
<p>Sylwia Ozdowska 
</p>
<p> 
</p>
<p>ERSS &#8211; Universit&#233; Toulouse le Mirail 
Maison de la Recherche 
</p>
<p>5 all&#233;es Antonio Machado 
31058 Toulouse Cedex 1 
ozdowska@univ-tlse2.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
Nous pr&#233;sentons une m&#233;thode d&#8217;appariement de mots, &#224; partir de corpus fran&#231;ais/anglais 
align&#233;s, qui s&#8217;appuie sur l&#8217;analyse syntaxique en d&#233;pendance des phrases. Tout d&#8217;abord, les 
mots sont appari&#233;s &#224; un niveau global gr&#226;ce au calcul des fr&#233;quences de cooccurrence dans 
des phrases align&#233;es. Ces mots constituent les couples amorces qui servent de point de d&#233;part 
&#224; la propagation des liens d&#8217;appariement &#224; l&#8217;aide des diff&#233;rentes relations de d&#233;pendance 
identifi&#233;es par un analyseur syntaxique dans chacune des deux langues. Pour le moment, cette 
m&#233;thode dite d&#8217;appariement local traite majoritairement des cas de parall&#233;lisme, c&#8217;est-&#224;-dire 
des cas o&#249; les relations syntaxiques sont identiques dans les deux langues et les mots appari&#233;s 
de m&#234;me cat&#233;gorie. Elle offre un taux de r&#233;ussite de 95,4% toutes relations confondues. 
</p>
<p>We present a word alignment procedure based on a syntactic dependency analysis of 
French/English parallel corpora. First, words are associated at a global level by comparing 
their co-occurrences in aligned sentences with respect to their overall occurrences in order to 
derive a set of anchor words. The anchor words are the starting point of the propagation 
process of alignment links using the different syntactic relations identified by a parser for each 
language. This process is called the local alignment. For the moment, it is performed basically 
when the syntactic relations are identical in both languages and the words aligned have the 
same part of speech. This method achieves a precision rate of 95,4% all syntactic relations 
taken into account. 
</p>
<p>Mots-clefs &#8211; Keywords 
appariement syntaxique de mots, corpus parall&#232;le, traitement automatique des langues 
naturelles 
syntactic word alignment, parallel corpora, natural language processing </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylwia Ozdowska 
</p>
<p>1 Introduction 
Qu&#8217;il soit destin&#233; &#224; la traduction automatique ou &#224; la construction de ressources 
terminologiques bilingues (Daille et al., 1994 ; Gaussier, 1998 ; Wu, 2000 ; Hull, 2001), 
l&#8217;appariement de mots s&#8217;effectue principalement &#224; l&#8217;aide de mod&#232;les statistiques, notamment 
ceux, tr&#232;s r&#233;pandus, de (Brown et al., 1993). Jug&#233;e trop co&#251;teuse (V&#233;ronis, 2000), l&#8217;utilisation 
de ressources linguistiques dans ce type de t&#226;che se limite encore tr&#232;s souvent au recours &#224; des 
dictionnaires &#233;lectroniques, des &#233;tiqueteurs ou des lemmatiseurs. Cependant, des propositions 
sont faites depuis peu qui visent &#224; exploiter des donn&#233;es issues de l&#8217;analyse syntaxique dans 
les syst&#232;mes de traduction probabilistes, soit pour les deux langues source et cible (Wu, 2000) 
soit pour la langue source uniquement (Fox, 2002 ; Lin et Cherry, 2003). Les donn&#233;es 
syntaxiques n&#8217;interviennent n&#233;anmoins que dans un second temps par rapport aux calculs 
statistiques, et ce pour contraindre les appariements que ces derniers peuvent produire. 
</p>
<p>La m&#233;thode d&#8217;appariement pr&#233;sent&#233;e dans cet article utilise les donn&#233;es syntaxiques non 
seulement pour confirmer des liens d&#8217;appariement existants mais aussi, et surtout, pour en 
d&#233;couvrir de nouveaux. Le choix de cette m&#233;thode est motiv&#233; par l&#8217;objectif que nous 
poursuivons : parvenir &#224; un appariement pr&#233;cis en captant aussi bien des appariements entre 
mots fr&#233;quents que des appariements entre mots rares et/ou sp&#233;cifiques au corpus. 
</p>
<p>2 Hypoth&#232;se de d&#233;part 
Le point de d&#233;part de notre &#233;tude est l&#8217;hypoth&#232;se formul&#233;e par (Debili et Zribi,  1996) selon 
laquelle &#171; les liaisons paradigmatiques peuvent aider &#224; d&#233;terminer les relations 
syntagmatiques, et inversement &#187;. Plus particuli&#232;rement, nous reprenons l&#8217;id&#233;e que les 
relations de d&#233;pendance syntaxique sont susceptibles, d&#8217;une part, de confirmer ou d&#8217;infirmer 
des liens d&#8217;appariement et, d&#8217;autre part, de cr&#233;er de nouveaux liens. Le raisonnement est le 
suivant : 
</p>
<p>Si deux mots T1i (morph, dans l&#8217;exemple) et T2p (morphe) sont appari&#233;s et s&#8217;il existe une 
relation de d&#233;pendance syntaxique entre T1i (morph) et T1j (belong), d&#8217;une part, et entre T2p 
(morphe) et T2q (appartenir), d&#8217;autre part, alors T1j (belong) et T2q (appartenir) peuvent &#234;tre 
appari&#233;s. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Cet article pr&#233;sente une impl&#233;mentation de ce m&#233;canisme de propagation des liens 
d&#8217;appariement &#224; l&#8217;aide des relations de d&#233;pendance syntaxique ainsi que son &#233;valuation.   
Notre &#233;tude s&#8217;appuie sur un corp us de traduction fran&#231;ais/anglais constitu&#233; au sein du service 
</p>
<p>These different morphs belong to five species. 
</p>
<p>Ces diff&#233;rents morphes appartiennent &#224; cinq esp&#232;ces. 
</p>
<p>SUJET 
</p>
<p>SUJET </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Appariement bilingue de mots par propagation syntaxique &#224; partir de corpus fran&#231;ais/anglais  
align&#233;s 
</p>
<p>linguistique de l&#8217;INRA 1 (Fr&#233;rot et al., 2001). Ce corpus a &#233;t&#233; align&#233; automatiquement au 
niveau des phrases et il compte au total environ 300 000 mots. 
Pour le traiter, nous avons choisi les outils SYNTEX (Bourigault et Fabre, 2000). Il s&#8217;agit d e 
deux analyseurs syntaxiques, l&#8217;un pour le fran&#231;ais, l &#8217; autre pour l&#8217;anglais,  qui prennent en 
entr&#233;e un corpus &#233;tiquet&#233; et effectuent une analyse en d&#233;pendance de chaque phrase, puis ils 
extraient du corpus un ensemble de mots et de syntagmes. 
</p>
<p>3 Appariement global 
La premi&#232;re &#233;tape du processus d&#8217;appariement tel que nous l&#8217;avons impl&#233;ment&#233; consiste &#224; 
trouver des couples susceptibles de servir de point de d&#233;part &#224; la propagation, appel&#233;s couples 
amorces. Nous avons choisi  de construire un ensemble de couples amorces directement &#224; 
partir du corpus en associant les mots en langue 1 (m1), l&#8217;anglais, et les mots en langue 2 
(m2)2, le fran&#231;ais, extraits par SYNTEX sur la base de leur fr&#233;quence d&#8217;apparition dans des 
phrases align&#233;es (Gale et Church, 1991 ; Ahrenberg et al., 2000). Plus pr&#233;cis&#233;ment,  il s&#8217;agit 
de comparer le nombre de fois o&#249; deux mots m1 et m2 apparaissent ensemble dans des 
phrases align&#233;es, c&#8217; est la fr&#233;quence de cooccurrence, par rapport &#224; la fr&#233;quence de chacun 
d&#8217; entre eux sur l&#8217;ensemble du corpus. Soient f(m1) la fr&#233;quence de m1 sur l&#8217;ensemble du 
corpus, f(m2) la  fr&#233;quence de m2 et f(m1, m2) la fr&#233;quence de cooccurrence, la mesure 
d&#8217;association calcul&#233;e est la suivante  : 
</p>
<p>f(m1, m2) 
j(m1, m2) =  
</p>
<p>f(m1) + f(m2) &#8211; f(m1, m2) 
 
</p>
<p>Dans le cadre de cette &#233;tude, nous calculons cette mesure uniquement pour les m1 et m2 dont 
la fr&#233;quence sur l&#8217; ensemble du corpus est sup&#233;rieure ou &#233;gale &#224; 5. En effet, l&#8217; appariement 
global concerne les mots les plus fr&#233;quents, dont les &#233;quivalents peuvent &#234;tre retrouv&#233;s avec 
une bonne pr&#233;cision par des m&#233;thodes statistiques (Ozdowska et Bourigault, 2004). Ensuite, 
seuls sont s&#233;lectionn&#233;s les couples (m1, m1) tels que j(m1, m2) &#8805; 0,2. L&#8217;ensemble des couples 
amorces ainsi obtenus constitue le lexique global. Une fois projet&#233;s au niveau des phrases 
align&#233;es, ces couples permettent d&#8217;initier le processus d &#8217; appariement local. 
</p>
<p>4 Appariement local 
L&#8217;appariement local consiste &#224; mettre en correspondance des m1 avec des m2 phrase &#224; phrase, 
&#224; partir de couples amorces et en suivant les relations de d&#233;pendance syntaxique mises en 
place par les analyseurs SYNTEX. Contrairement &#224; l&#8217;appariement global, il vise &#224; retrouver les 
&#233;quivalents des mots peu fr&#233;quents. Il s&#8217;agit donc de deux proc&#233;dures compl&#233;mentaires.  
</p>
<p>                                                 
</p>
<p>1
 Institut National de la Recherche Agronomique. Nous remercions A. Lacombe de l&#8217;INRA de nous avoir 
autoris&#233;e &#224; utiliser ce corpus &#224; des fins de recherche. 
</p>
<p>2 
 Il s&#8217;agit de mots pleins (noms, verbes, adjectifs, adverbes) aussi  bien pour l&#8217;appariement global que local.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylwia Ozdowska 
</p>
<p>PREP1 
</p>
<p>4.1 Deux modes de propagation : &#224; partir des r&#233;gis / &#224; partir des recteurs 
</p>
<p>La propagation des liens d&#8217;appariement s&#8217;effectue de deux mani&#232;res  : 1) &#224; partir des r&#233;gis vers 
les recteurs et 2) &#224; partir des recteurs vers les r&#233;gis. Chaque mot plein peut &#234;tre &#224; la fois r&#233;gi et 
recteur. L&#8217;appariement &#224; partir des r&#233;gis est non ambigu a priori puisqu&#8217;u n r&#233;gi donn&#233; ne peut 
avoir qu&#8217;un seul recteur et il n&#8217;y a donc qu&#8217;une seule relation syntaxique susceptible de servir 
de base &#224; la propagation. Si cette relation est identique dans les deux langues, ou, plus 
pr&#233;cis&#233;ment, si chaque mot d&#8217;un couple amorce es t li&#233; &#224; un autre mot de m&#234;me cat&#233;gorie par 
la m&#234;me relation syntaxique, on dit qu&#8217;il y a parall&#233;lisme. Par contre, un recteur peut admettre 
plusieurs r&#233;gis et plusieurs relations peuvent donc rentrer en concurrence pour la propagation. 
Ce ph&#233;nom&#232;ne de concurrence est particuli&#232;rement important lors de la propagation &#224; partir 
des noms recteurs vers leurs d&#233;pendants nominaux et adjectivaux. Si l&#8217;on part par exemple du 
couple amorce (use, utilisation), rien ne permet de d&#233;terminer a priori si l&#8217;on doit propage r 
suivant les relations NN/PREP1, d&#8217;une part, et PREP/PREP2, d&#8217;autre part, ou bien NN/PREP2 et 
PREP/PREP1. Il s&#8217;agit donc d&#8217;un cas d&#8217;ambigu&#239;t&#233;.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Pour chaque cat&#233;gorie de mots, la propagation &#224; partir des r&#233;gis intervient avant la 
propagation &#224; partir des recteurs dans la mesure o&#249; le liens d&#8217;appariement &#233;tablis selon le 
premier mode peuvent &#234;tre utilis&#233;s &#224; des fins de d&#233;sambigu&#239;sation locale lors de la 
propagation selon le second mode, comme c&#8217;est effectivement le cas pour l&#8217;appariement de s 
noms et adjectifs r&#233;gis en 4.3. 
Nous pr&#233;sentons dans les sections suivantes la mise en oeuvre de ces deux modes de 
propagation pour apparier, d&#8217;une part, les verbes ( 4.2) et, d&#8217;autre part, les adjec tifs et les noms 
(4.3). Pour ce faire, nous faisons appel &#224; diff&#233;rents sch&#233;mas de propagation o&#249; le couple 
amorce appara&#238;t en italique (soulign&#233; dans les exemples) et le couple de mots appari&#233;s par 
propagation en gras. 
</p>
<p>4.2 Appariement des verbes recteurs et r&#233;gis 
</p>
<p>Pour apparier les verbes, nous avons eu recours &#224; huit sch&#233;mas de propagation au total, soit 
cinq pour la propagation &#224; partir des r&#233;gis et trois pour celle &#224; partir des recteurs. Cependant, 
les verbes &#233;tant tr&#232;s rarement r&#233;gis, force est de constater que le second mode de propagation 
est tr&#232;s peu productif. 
</p>
<p>APPARIEMENT DES VERBES RECTEURS. Les verbes peuvent &#234;tre appari&#233;s selon quatre sch&#233;mas 
de propagation : Adv_V (1), Suj_V (2), V_Obj (3), V_Prep_N (4) et V_Prep_V (5). 
</p>
<p>(1) The net is then hauled to the shore. 
Le filet est ensuite hal&#233; &#224; terre. 
</p>
<p>NN          PREP 
</p>
<p>PREP2 
</p>
<p>outdoor use of water 
utilisation en ext&#233;rieur de l&#8217;eau </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Appariement bilingue de mots par propagation syntaxique &#224; partir de corpus fran&#231;ais/anglais  
align&#233;s 
</p>
<p>(2) The fish are generally caught when they migrate from their feeding areas. 
G&#233;n&#233;ralement les poissons sont captur&#233;s quand ils migrent de leur zone 
d&#8217;engraissement. 
</p>
<p>(3) Most of the young shad reach the sea. 
La plupart des alosons gagne la mer. 
</p>
<p>(4) The eggs are very small and fall to the bottom. 
 Les oeufs de tr&#232;s petite taille tombent sur le fond. 
(5) X is a model which was designated to stimulate&#8230; 
 X est un mod&#232;le qui a &#233;t&#233; con&#231;u pour stimuler&#8230; 
 
</p>
<p>APPARIEMENT DES VERBES REGIS. L&#8217;appariement se fait selon trois sch&#233;mas de propagation  : 
V_Prep_V (1), N_Prep_V (2) et Adj_Prep_V (3). 
</p>
<p>(1) Ploughing tends to destroy the soil microaggregated structure. 
Le labour tend &#224; rompre leur structure microagr&#233;g&#233;e. 
</p>
<p>(2) The capacity to colonize the digestive mucosa&#8230; 
L&#8217;aptitude &#224; coloniser le tube digestif&#8230; 
</p>
<p>(3) An established infection is impossible to control. 
Toute infection en cours est impossible &#224; ma&#238;triser. 
</p>
<p> 
</p>
<p>La Figure 1 montre les r&#233;sultats et les &#233;valuations par sch&#233;ma de propagation. Le nombre 
d&#8217;occurrences correspond au nombre de fois o&#249; le m&#234;me sch&#233;ma a &#233;t&#233; trouv&#233; dans les deux 
langues, c&#8217;est -&#224;-dire au nombre de cas de parall&#233;lisme. Etant donn&#233; le nombre important 
d&#8217;occurrences pou r chaque sch&#233;ma de propagation, seule une partie des occurrences a &#233;t&#233; la 
plupart du temps &#233;valu&#233;e et ce suivant l&#8217;ordre d e leur apparition dans le corpus.
</p>
<p> 
</p>
<p>R&#233;gi &#8594; V- Recteur Recteur &#8594; V - R&#233;gi  
</p>
<p>Adv_V Suj_V V_Obj V_Prep_N V_Prep_V V_Prep_V N_Prep_V Adj_Prep_V 
</p>
<p>occurrences 177 1705 1495 934 75 52 25 50 
</p>
<p>cas &#233;valu&#233;s 95 663 692 478 57 52 25 50 
</p>
<p>98,9 94,8 92,4 95,8 96,4 95,1 100 99 
r&#233;ussite (%) 
</p>
<p>94,5 98,4 
</p>
<p>Figure 1 Appariement des verbes r&#233;gis et recteurs &#8211; r&#233;sultats et &#233;valuations 
</p>
<p>4.3 Appariement des adjectifs et des noms 
Les adjectifs, aussi bien que les noms, peuvent &#234;tre appari&#233;s selon les deux modes pr&#233;sent&#233;s 
en 4.1. Cela implique n&#233;anmoins que les adjectifs et les noms ne soient pas trait&#233;s de mani&#232;re 
compl&#232;tement ind&#233;pendante, et ce pour deux raisons : a) l&#8217;ambigu&#239;t&#233; potentielle qui existe lors 
de la propagation &#224; partir des noms recteurs (4.1) et qui concerne tous leurs d&#233;pendants et 
b) la diff&#233;rence dans la formation, donc dans la structure, des syntagmes nominaux dans les 
deux langues qui provoque des ph&#233;nom&#232;nes de non parall&#233;lisme et de transposition (Chuquet </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylwia Ozdowska 
</p>
<p>et Paillard, 1989). Par cons&#233;quent, les d&#233;pendants du nom font l&#8217;objet d&#8217;un traitement 
sp&#233;cifique qui autorise des appariements alors m&#234;me que les relations de d&#233;pendance utilis&#233;es 
sont diff&#233;rentes dans les deux langues et/ou que les mots appari&#233;s ne sont pas de m&#234;me 
cat&#233;gorie. Les adjectifs et les noms sont donc trait&#233;s de mani&#232;re ind&#233;pendante dans les cas 
suivants : a) appariement &#224; partir des r&#233;gis et b) pour les noms seulement, appariement &#224; partir 
de recteurs qui ne sont pas des noms. Ils sont par contre trait&#233;s ensemble lors de l&#8217;appariement 
&#224; partir des noms recteurs. 
</p>
<p>APPARIEMENT DES ADJECTIFS RECTEURS. Les sch&#233;mas de propagation utilis&#233;s sont : 
Adv_Adj (1), Adj_Prep_N (2) et Adj_Prep_V (3). 
(1) The white cedar exhibits a very common physical defect. 
</p>
<p>Le Poirier-pays pr&#233;sente un d&#233;faut de forme tr&#232;s fr&#233;quent. 
(2) The area presently devoted to agriculture represents&#8230;  
</p>
<p>La surface actuellement consacr&#233;e &#224; l&#8217; agriculture repr&#233;senterait&#8230;  
(3) Only fours plots were liable to receive this input. 
</p>
<p>Seulement quatre parcelles sont susceptibles de recevoir ces apports. 
 
</p>
<p> Adv_Adj Adj_Prep_N Adj_Prep_N 
occurrences 162 454  45 
</p>
<p>cas &#233;valu&#233;s 98 198 45 
</p>
<p>98,9 97,4 97,7 
r&#233;ussite (%) 
</p>
<p>97,9 
</p>
<p>Figure 2 Appariements des adjectifs recteurs &#8211; r&#233;sultats et &#233;valuations 
APPARIEMENT DES NOMS RECTEURS. Les noms sont appari&#233;s suivant les sch&#233;mas : N_Adj (1), 
N_N/N_Prep_N (2), N_Prep_N (3) et N_Prep_V (4). 
</p>
<p>(1) Allis shad remain on the continental shelf. 
La grande alose reste sur le plateau continental. 
</p>
<p>(2) Nature of micropolluant carriers. 
La nature des transporteurs des micropolluants. 
</p>
<p>(3)  The bodies of shad are generally fusiform. 
Le corps des aloses est g&#233;n&#233;ralement fusiforme. 
</p>
<p>(4) Ability to react to light. 
Capacit&#233; &#224; r&#233;agir &#224; la lumi&#232;re. 
</p>
<p> 
</p>
<p>APPARIEMENT NON AMBIGU DES NOMS REGIS. L&#8217;appariement des noms r&#233;gis est non ambig u 
lorsque leur recteur n&#8217;est pas lui -m&#234;me un nom. C&#8217;est le cas pour quatre sch&#233;mas de 
propagation : Suj_V_Obj (1), V_Prep_N (2) et Adj_Prep_N (3). 
(1) The caterpillars can inoculate the fungus. 
</p>
<p>Les chenilles peuvent inoculer le champignon. 
(2) The roots are placed in tanks. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Appariement bilingue de mots par propagation syntaxique &#224; partir de corpus fran&#231;ais/anglais  
align&#233;s 
</p>
<p>Les racines sont plac&#233;es en bacs. 
 
</p>
<p>(3) Botrysis, a fungus responsible for grey rot. 
Botrysis, champignon responsable de la pourriture grise. 
 
</p>
<p>R&#233;gi &#8594; Nom - Recteur Recteur &#8594; Nom - R&#233;gi  
</p>
<p>N_Adj N_N/N_Prep_N N_Prep_N N_Prep_V Suj_V_Obj V_Prep_N Adj_Prep_N 
</p>
<p>occurrences 4706 2960 2966 18 1631 461 325 
</p>
<p>cas &#233;valu&#233;s 965 625 671 18 623 268 188 
</p>
<p>93,7 87,5 91,8 100 95,6 95,5 97,8 
r&#233;ussite (%) 
</p>
<p>91,5 97,3 
</p>
<p>Figure 3 Appariement non ambigu des noms recteurs et r&#233;gis&#8211; r&#233;sultats et &#233;valuations 
</p>
<p>APPARIEMENT POTENTIELLEMENT AMBIGU DES NOMS ET ADJECTIFS REGIS. Comme nous l&#8217;avons 
&#233;voqu&#233; en 4.1, l&#8217;appariement est potentiellement ambigu quand la propagation se fait &#224; partir 
d&#8217;un nom recteur vers le(s) nom(s) et /ou les(s) adjectif(s) r&#233;gi(s). C&#8217;est le cas non seulement 
parce que le nombre de r&#233;gis peut &#234;tre sup&#233;rieur &#224; 1 mais aussi parce que leur cat&#233;gorie peut 
varier d&#8217;une langue &#224; l&#8217;autre  ; c&#8217;est la transposition. Ainsi, un adjectif r&#233;gi peut &#234;tre rendu par 
un nom r&#233;gi et vice versa, les relations susceptibles de servir de base &#224; la propagation sont 
alors diff&#233;rentes. 
</p>
<p>Compte tenu de l&#8217;existence d&#8217;une ambigu&#239;t&#233; potentielle, le principe d&#8217;appariement des noms 
et adjectifs r&#233;gis &#224; partir des noms recteurs (n1, n2) s&#8217;articule autour des t rois situations que 
l&#8217;on peut  rencontrer : 
</p>
<p>1. n1 et n2 ont chacun un seul r&#233;gi, respectivement reg1 et reg2, par la relation NN, ADJ 
ou PREP, on apparie reg1 et reg2 ; 
</p>
<p>the drained whey 
le lactos&#233;rum d&#8217;&#233;gouttage  
&#8658; (drained, &#233;gouttage) 
</p>
<p> 
</p>
<p>2. n1 a un seul r&#233;gi reg1 et n2 plusieurs {reg21, reg22, &#8230;, reg2 n}, ou l&#8217;inverse. S&#8217;il 
existe un seul appariement local d&#233;j&#224; effectu&#233; par propagation et/ou un appariement 
global app(reg1, reg2i), ou l&#8217;inverse, on le choisit et on &#233;limine les autres. Sinon, on 
garde l&#8217;ensemble des appariements ( reg1, {reg21, reg22, &#8230;,  reg2n}), ou l&#8217;inverse, 
sans prendre de d&#233;cision ; 
</p>
<p>stimulant substances which are absent from&#8230;  
substances solubles stimulantes absentes de&#8230;  
(stimulant, {soluble, stimulant, absent}) 
app(stimulant, stimulant) = 1 
&#8658; (stimulant, stimulant) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylwia Ozdowska 
</p>
<p>3. n1 et n2 ont plusieurs r&#233;gis, {reg11, reg12, &#8230;, reg1 m} et {reg21, reg22, &#8230;, reg2 n} 
respectivement. Pour chaque reg1i, on v&#233;rifie s&#8217;il existe un appariement local d&#233;j&#224; 
effectu&#233; par propagation et/ou un appariement global app(reg1i, reg2j). Si oui, on 
choisit cet appariement et on &#233;limine tous les couples (reg1i, reg2k) tels que k &#8800; j. 
Sinon, on garde tous les appariements (reg1i, reg2j) sans prendre de d&#233;cision. 
</p>
<p>reference product on the market  a big rectangular net, which is lowered&#8230;  
produit commercial de r&#233;f&#233;rence  un vaste filet rectangulaire immerg&#233;&#8230;  
(reference, {commercial, r&#233;f&#233;rence}) (big, {vaste, rectangulaire, immerg&#233;}) 
(market, {commercial, r&#233;f&#233;rence}) (rectangular, {vaste, rectangulaire, immerg&#233;}) 
app(reference, r&#233;f&#233;rence) = 1  app(rectangular, rectangulaire) = 1 
&#8658; (reference, r&#233;f&#233;rence)  &#8658; (rectangular, rectangulaire) 
&#8658; (market, commercial)  &#8658; (big, {vaste, immerg&#233;}) 
 
</p>
<p>Ce principe de propagation pr&#233;sente deux avantages majeurs : il permet de lever un certain 
nombre d&#8217;ambigu&#239;t&#233;s de mani&#232;re locale et de g&#233;rer des cas de non parall&#233;lisme avec ou sans 
transposition au niveau de la cat&#233;gorie grammaticale des mots appari&#233;s. Il est &#224; noter que les 
appariements non d&#233;sambigu&#239;s&#233;s, comme (big, {vaste, immerg&#233;}), qui repr&#233;sentent pr&#232;s de 
30% des cas, sont consid&#233;r&#233;s comme non r&#233;solus &#224; ce stade du processus et ne sont donc pas 
pris en compte lors de l&#8217;&#233;valuation.  
</p>
<p> N_ 
</p>
<p>occurrences 10726 
</p>
<p>cas &#233;valu&#233;s 3464 
</p>
<p>r&#233;ussite (%) 97,7 
</p>
<p>Figure 4 Appariement &#224; partir des noms recteurs &#8211; r&#233;sultats et &#233;valuation 
</p>
<p>5 Discussion et perspectives 
L&#8217;appariement par propagation offre un taux de pr&#233;cision de 95,4% sur une base de pr&#232;s de 
10 000 couples &#233;valu&#233;s. Il convient de noter que ce r&#233;sultat est li&#233; en partie au contexte 
favorable dans lequel la m&#233;thode d&#8217;a ppariement a &#233;t&#233; test&#233;e. Tout d&#8217;abord, nous avons 
travaill&#233; &#224; partir d&#8217; un corpus de traduction en domaine sp&#233;cialis&#233; dans lequel les structures 
syntaxiques pr&#233;sentent une forte similarit&#233; pour les deux langues. Deuxi&#232;mement, nous 
n&#8217;avon s pas cherch&#233; &#224; apparier tous les mots mais seulement les mots pleins r&#233;gis et/ou 
recteurs. Les &#233;valuations concernent donc uniquement les appariements de mots effectu&#233;s 
dans ces conditions d&#8217;exp&#233;rimentation pr&#233; cises. C&#8217;est pourquoi le r&#233;sultat obtenu est  
difficilement comparable aussi bien &#224; ceux qui sont rapport&#233;s par (Daille et al., 1994), 70 &#224; 
80%, (Gausssier, 1998), 90 &#224; 98% ainsi que (Hull, 2001), 56%, et qui concernent l&#8217;&#233;valuation 
de l&#8217;appariement de termes auquel l&#8217;appa riement de mots sert de support, qu&#8217;&#224; ceux de (Lin et 
Cherry, 2003), pr&#233;cision estim&#233;e &#224; 89,2% ou 95,7%3 dans le cadre d&#8217;une t &#226;che d&#8217;&#233;valuation 
                                                 
</p>
<p>3
  Selon la calcul statistique utilis&#233; &#224; la base. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Appariement bilingue de mots par propagation syntaxique &#224; partir de corpus fran&#231;ais/anglais  
align&#233;s 
</p>
<p>(Mihalcea et Pedersen, 2003), qui concernent l&#8217;appariement de tous les mots  de la phrase. (Lin 
et Cherry, 2003) remarquent n&#233;anmoins que l&#8217;introduction d&#8217;une contrainte syntaxique 
am&#233;liore de mani&#232;re significative les performances de leurs algorithmes. Il s&#8217;agit dans ce cas 
d&#8217;une contrainte de coh&#233;s ion (Fox, 2002) qui stipule que &#171; if two phrases are disjoint in the 
English sentence, the alignment must not map them to overlapping intervals in the French 
sentence &#187; (Lin et Cherry, 2003). Cette contrainte suppose une repr&#233;sentation de la phrase 
anglaise sous forme d&#8217;arbre de d&#233;pendance et  vise globalement &#224; interdire ou &#224; d&#233;sambigu&#239;ser 
certains appariements statistiques. Pour l&#8217;ap pariement par propagation, l&#8217;exploit ation des 
donn&#233;es syntaxiques est au c&#339;ur m&#234;me de la m&#233;thode, ces derni&#232;res ne constituent pas 
seulement une information additionnelle. 
</p>
<p>La propagation des liens d&#8217;appariement le long des relations syntaxiques s&#8217; av&#232;re tr&#232;s efficace 
dans les cas o&#249; il y a parall&#233;lisme dans les deux langues. Elle donne &#233;galement une bonne 
pr&#233;cision dans les cas de transposition o&#249; elle conduit &#224; mettre en correspondance des 
adjectifs et des noms. Le rappel reste &#224; &#233;valuer. En poursuivant l&#8217;analyse des cas de non 
parall&#233;lisme, dont on trouve une &#233;bauche dans (Ozdowska et Bourigault, 2004), nous esp&#233;rons 
mettre au jour des r&#233;gularit&#233;s li&#233;es aux ph&#233;nom&#232;nes de variation interlingue et &#233;tendre ainsi la 
propagation &#224; ce type de situations. Cette technique doit encore &#234;tre test&#233;e et &#233;valu&#233;e sur de 
nouveaux corpus parall&#232;les, notamment ceux utilis&#233;s dans les campagnes d&#8217;&#233;valuation Arcade 
(V&#233;ronis et Langlais, 2000). Enfin, notre r&#233;flexion concerne l&#8217;utilisation de cette m&#233;thode sur 
des corpus comparables. 
</p>
<p>R&#233;f&#233;rences 
AHRENBERG L., ANDERSSON M., MERKEL M. (2000), A knowledge-lite approach to word 
alignment, J. V&#233;ronis (ed.), Parallel Text Processing : Alignment and Use of Translation 
Corpora, Dordrecht: Kluwer Academic Publishers, pp. 97-138. 
</p>
<p>BOURIGAULT D., FABRE C. (2000), Approche linguistique pour l&#8217;analyse syntaxique de 
corpus, Cahiers de Grammaire, 25, Universit&#233; Toulouse le Mirail, pp. 131-151. 
</p>
<p>BROWN P., DELLA PIETRA S., MERCER R. (1993), The mathematics of statistical machine 
translation : parameter estimation, Computational Linguistics, 19(2), pp. 263-311. 
</p>
<p>DAILLE B., GAUSSIER E., LANG&#201; J.-M. (1994), Towards Automatic Extraction of Monolingual 
and Bilingual Terminology, Proceedings of the International Conference on Computational 
Linguistics (COLING&#8217;94) , pp. 515-521. 
</p>
<p>DEBILI F., ZRIBI A. (1996), Les d&#233;pendances syntaxiques au service de l&#8217;appariement des 
mots, Actes du 10&#232;me Congr&#232;s Reconnaissance des Formes et Intelligence Artificielle 
(RFIA&#8217;96) . 
</p>
<p>FREROT C., RIGOU G., LACOMBE A. (2001), Approche phras&#233;ologique d&#8217;une extraction 
automatique de terminologie dans un corpus scientifique bilingue align&#233;, Actes des 4&#232;mes 
rencontres Terminologie et Intelligence Artificielle, Nancy, pp 180-188. 
FOX H. J. (2002), Phrasal Cohesion and Statistical Machine Translation, Proceedings of 
EMNLP-02, pp. 304-311. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylwia Ozdowska 
</p>
<p>GALE W. A., CHURCH K. W. (1991), Identifying Word Correspondences in Parallel Text, 
Proceedings of the DARPA Workshop on Speech and Natural Language. 
GAUSSIER E. (1998), Flow Network Models for Word Alignment and Terminology Extraction 
from Bilingual Corpora, Proceedings of the joint 17th International Conference on 
Computational Linguistics and 36th Annual Meeting of the Association for Computational 
Linguistics (COLING/ACL&#8217;98 ), pp. 444-450. 
</p>
<p>GAUSSIER E., HULL D. A., A&#207;T-MOKHTAR S. (2000), Term alignment in use, J. V&#233;ronis (ed.), 
Parallel Text Processing : Alignment and Use of Translation Corpora, Dordrecht: Kluwer 
Academic Publishers, pp. 253-274. 
</p>
<p>HULL D. A. (2001), Software tools to support the construction of bilingual terminology 
lexicons, D. Bourigault, Ch. Jacquemin, M. &#8211;C. L&#8217;Homme (eds.), Recent Advances in 
Computational Terminology, John Benjamins, pp. 225-244. 
LIN D., CHERRY C. (2003), Linguistic Heuristics in Word Alignment, Proceedings of 
PACLing 2003. 
</p>
<p>MIHALCEA R., PEDERSEN T. (2003), An Evaluation Exercise for Word Alignment, Workshop 
Proceedings on Building and Using Parallel Texts: Data Driven Machine Translation and 
Beyond (HLT-NAACL 2003), pp. 1-10. 
</p>
<p>OZDOWSKA S., BOURIGAULT D. (2004), D&#233;tection de relations d&#8217;appariement bilingue entre 
termes &#224; partir d&#8217;une analyse syntaxique de corpus, Actes du 14&#232;me Congr&#232;s Francophone 
AFRIF-AFIA de Reconnaissance des Formes et Intelligence artificielle. 
V&#201;RONIS J. (2000), From the Rosetta stone to the information society. A survey of parallel 
text processing, V&#233;ronis J. (ed), Parallel Text Processing : Alignment and Use of Translation 
Corpora, Dordrecht : Kluwer Academic Publishers, pp. 1-24. 
</p>
<p>V&#201;RONIS J. et LANGLAIS P. (2000), Evaluation of parallel text alignment systems. The 
ARCADE project, V&#233;ronis J. (ed.), Parallel Text Processing : Alignment and Use of 
Translation Corpora, Dordrecht: Kluwer Academic Publishers, pp. 371-388. 
</p>
<p>VINAY J.-P., DARBELNET J. (1958), Stylistique compar&#233;e du fran&#231;ais et de l&#8217;angla is, Paris : 
Didier. 
</p>
<p>WU D. (2000), Bracketing and aligning words and constituents in parallel text using 
Stochastic Inversion Transduction Grammars, J. V&#233;ronis (ed.), Parallel Text Processing : 
Alignment and Use of Translation Corpora, Dordrecht: Kluwer Academic Publishers, pp. 
139-167. </p>

</div></div>
</body></html>