<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>De la lexie au vocable : la repr&#233;sentation formelle des liens de polys&#233;mie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>De la lexie au vocable : la repr&#233;sentation formelle des liens de
polys&#233;mie
</p>
<p>Lucie Barque
LaTTice
</p>
<p>Universit&#233; Paris 7
lbarque@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article s&#8217;int&#233;resse aux d&#233;finitions formalis&#233;es de la base de donn&#233;es BD&#233;f et montre en quoi
la structure formelle de ces d&#233;finitions est &#224; m&#234;me d&#8217;offrir une repr&#233;sentation originale de la
polys&#233;mie lexicale.
</p>
<p>This article deals with formal structure of BD&#233;f&#8217;s definitions and shows in what way this struc-
ture is appropriate to offer an original representation of the lexical polysemy phenomenon.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>LEC, dictionnaire &#233;lectronique formalis&#233;, structure d&#233;finitionnelle, TAL
ECL, formalised electronical dictionnary, structure of the definition, NLP
</p>
<p>1 Introduction
</p>
<p>Les dictionnaires de langue s&#8217;attachent &#224; rendre compte de la valeur des lexies : on ne cherche
pas &#224; d&#233;finir leur r&#233;f&#233;rent mais les diff&#233;rents rapports qu&#8217;elles entretiennent entre elles dans
le r&#233;seau lexical de la langue. C&#8217;est en cela que l&#8217;on distingue, de mani&#232;re toute th&#233;orique, la
d&#233;finition encyclop&#233;dique de la d&#233;finition linguistique, dans laquelle chaque composante de sens
indique un lien, syntagmatique ou paradigmatique, avec une autre lexie (Picoche, 1997). Cet
article s&#8217;int&#233;resse aux composantes d&#233;finitionnelles indiquant un lien de polys&#233;mie entre deux
lexies, et &#224; leur repr&#233;sentation dans les d&#233;finitions de la BD&#233;f, base de donn&#233;es lexicales en cours
de d&#233;veloppement &#224; l&#8217;universit&#233; de Montr&#233;al (Altman &amp; Polgu&#232;re, 2003). La BD&#233;f encodent les
d&#233;finitions du Dictionnaire Explicatif et Combinatoire (Mel&#8217;c&#780;uk et al., 1984, 1988, 1992, 1999)
r&#233;dig&#233;es suivant les principes de la Lexicologie Explicative et Combinatoire (LEC)1. La base
de donn&#233;es a recours &#224; un formalisme qui explicite la structure des d&#233;finitions du DEC, donnant
ainsi &#224; l&#8217;utilisateur, qu&#8217;il soit lexicographe ou programme informatique, la possibilit&#233; d&#8217;acc&#233;der
aux diff&#233;rentes strates d&#8217;une d&#233;finition. La premi&#232;re section est consacr&#233;e &#224; la pr&#233;sentation de
</p>
<p>1La LEC est la composante lexicale de la Th&#233;orie Sens-Texte (TST). Pour une introduction &#224; la TST, voir
(Mel&#8217;c&#780;uk, 1997)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lucie Barque
</p>
<p>la structure formelle de ces d&#233;finitions. On propose ensuite de les exploiter pour l&#8217;&#233;tude de la
polys&#233;mie lexicale : la structuration explicite des d&#233;finitions BD&#233;f nous invite &#224; nous interroger
sur la nature d&#8217;une composante liante et sur la place qu&#8217;elle occupe au sein de la structure
d&#233;finitionnelle. On envisage enfin, dans une troisi&#232;me section, d&#8217;extraire &#224; partir des vocables
de la BD&#233;f des patrons formels de polys&#233;mie qui serviront &#224; proposer un traitement appropri&#233;
de ce ph&#233;nom&#232;ne lexical.
</p>
<p>2 Pr&#233;sentation des d&#233;finitions formalis&#233;es de la BD&#233;f.
</p>
<p>Les d&#233;finitions de la BD&#233;f se distinguent des d&#233;finitions traditionnelles en ce qu&#8217;elles ont recours
&#224; un m&#233;talangage contraint, n&#233;cessaire &#224; une description logique du lexique et particuli&#232;rement
bien adapt&#233; au traitement automatique des d&#233;finitions (Altman &amp; Polgu&#232;re, 2003), (Wanner,
2003). Elles proposent en outre une structuration explicite du sens lexical. La figure 1 pr&#233;sente
la d&#233;finition de MANGER#I.1a encod&#233;e dans le formalisme de la BD&#233;f.
</p>
<p>MANGER#I.1a
Forme propositionnelle : Composante centrale :
X &#8764; Y 1 : et_puis
</p>
<p>1.1 : X introduire Y dans Alpha
Typage des variables : 1.2 :(X mastiquer Y)
X : &#234;tre anim&#233; 1.3 : X avaler Y
Y : mati&#232;re Diff&#233;rences sp&#233;cifiques :
Alpha : orifice /*But*/
</p>
<p>2 : *1 dans_le_but *3
Rel_Sem : 3 : X _se_nourrir_#I1 de Y
Alpha[X] /*Caract&#233;ristique.Alpha*/
</p>
<p>5 : Alpha servir &#224; *6
6 : X _se_nourrir_#I1
</p>
<p>FIG. 1 &#8211; D&#233;finition de MANGER#I.1a, BD&#233;f
</p>
<p>La partie gauche de la figure contient trois blocs relatifs aux actants s&#233;mantiques de la lexie,
repr&#233;sent&#233;s par des variables. Le premier, intitul&#233; forme propositionnelle, indique la position
des actants par rapport &#224; la lexie vedette (repr&#233;sent&#233;e par le signe &#8764;). Le second, intitul&#233; Ty-
page des variables, attribue une &#233;tiquette s&#233;mantique aux diff&#233;rents actants. Le troisi&#232;me bloc
(Rel_S&#233;m) indique les &#233;ventuelles relations s&#233;mantiques entre les actants. Ici, X est le premier
actant de Alpha (orifice de l&#8217;&#234;tre anim&#233; X). La partie droite de la figure contient la d&#233;finition
proprement dite.
</p>
<p>Une d&#233;finition BD&#233;f pr&#233;sente diff&#233;rents niveaux de structuration : elle est d&#8217;abord scind&#233;e en
deux grands blocs d&#233;finitionnels qui correspondent &#224; la s&#233;paration classique genre prochain
(appel&#233; ici composante centrale) / diff&#233;rences sp&#233;cifiques. Le genre prochain donne le sens
g&#233;n&#233;ral de la lexie vedette et les diff&#233;rences sp&#233;cifiques permettent de la distinguer des autres
lexies ayant le m&#234;me genre prochain. Le bloc des diff&#233;rences sp&#233;cifiques est constitu&#233; d&#8217;un en-
semble de blocs d&#233;finitionnels &#233;l&#233;mentaires qui sont pr&#233;c&#233;d&#233;s d&#8217;un en-t&#234;te indiquant le r&#244;le2
</p>
<p>2Le terme r&#244;le renvoie &#224; la m&#234;me notion que les r&#244;les de la structure des qualia dans le Lexique G&#233;n&#233;ratif</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De la lexie au vocable : la repr&#233;sentation formelle des liens de polys&#233;mie
</p>
<p>du bloc par rapport &#224; la composante centrale. Ainsi, les diff&#233;rences sp&#233;cifiques de la lexie MAN-
GER#I.1a sont constitu&#233;es d&#8217;un premier bloc dont le r&#244;le est d&#8217;indiquer le but de l&#8217;activit&#233;
d&#233;not&#233;e par la lexie. Le second bloc indique une caract&#233;ristique de l&#8217;actant Alpha.
</p>
<p>Chaque bloc d&#233;finitionnel est constitu&#233; d&#8217;un ensemble de propositions &#233;l&#233;mentaires num&#233;-
rot&#233;es. Une proposition &#233;l&#233;mentaire est constitu&#233;e d&#8217;un pr&#233;dicat principal et des positions
actancielles pr&#233;vues par ce pr&#233;dicat3. Par exemple, le pr&#233;dicat principal de la proposition 1.1
est introduire. Ce pr&#233;dicat requiert trois positions actancielles : une pour celui qui introduit
(X), une pour ce qu&#8217;il introduit (Y) et une pour l&#8217;endroit o&#249; il introduit (Alpha). Un pr&#233;dicat
principal peut &#234;tre modifi&#233; au sein d&#8217;une proposition &#233;l&#233;mentaire. On peut imaginer par exemple
que la d&#233;finition de GAVER contienne la m&#234;me proposition que la proposition 1.1 mais consti-
tu&#233;e en plus du modifieur de force (X introduire Y de force dans Alpha).
Les int&#233;r&#234;ts pratiques et th&#233;oriques d&#8217;une telle base de donn&#233;es lexicales ont &#233;t&#233; pr&#233;sent&#233;s dans
(Altman &amp; Polgu&#232;re, 2003) et (Wanner, 2003). La section suivante s&#8217;appuie sur les d&#233;finitions
formelles de la BD&#233;f pour entamer une r&#233;flexion sur la notion de composante liante.
</p>
<p>3 La composante liante dans les d&#233;finitions de la BD&#233;f.
</p>
<p>L&#8217;unit&#233; polys&#233;mique de la BD&#233;f, le vocable, se pr&#233;sente sous la forme d&#8217;une liste de lexies cor-
respondant &#224; ses diff&#233;rentes acceptions. Pour figurer au sein d&#8217;un vocable, chaque lexie doit &#234;tre
li&#233;e de mani&#232;re directe ou indirecte &#224; la lexie de base (le sens premier de l&#8217;unit&#233; polys&#233;mique)4.
Si deux lexies homographes n&#8217;entretiennent aucun rapport de sens, elles figurent dans des vo-
cables diff&#233;rents, consid&#233;r&#233;s comme homonymes. La LEC pr&#233;conise donc que soit explicit&#233;e la
composante de sens liante, appel&#233; pont s&#233;mantique entre deux lexies. La figure 2 montre les
d&#233;finitions de trois lexies du vocable COUDE, la lexie de base (COUDE#la[Il s&#8217;est lux&#233; le coude]),
une acception m&#233;tonymique (COUDE#II.1[Les coudes de sa veste sont lustr&#233;s] et une acception
m&#233;taphorique (COUDE#II.2[La route formait un coude &#224; cet endroit]). Les ponts s&#233;mantiques
appara&#238;ssent en italique dans la figure.
</p>
<p>La lexie de base du vocable GENOU, que nous ne pouvons pr&#233;senter ici faute de place, poss&#232;de
les m&#234;mes diff&#233;rences sp&#233;cifiques que celle du vocable COUDE &#224; l&#8217;exception du modificateur
(en formant un angle) de la proposition n&#9702;6 (cf figure 2), qui n&#8217;y figure pas. Cette divergence
s&#8217;explique par le fait que le vocable COUDE contient, contrairement au vocable GENOU, une
acception m&#233;taphorique qui exploite cette composante (voir COUDE#II.2, figure2). Il semble
donc que la structure du vocable puisse motiver l&#8217;inclusion d&#8217;une composante de sens dans la
d&#233;finition de la lexie de base.
</p>
<p>(Pustejovsky, 1995). Toutefois :
&#8211; Les r&#244;les du Lexique G&#233;n&#233;ratif sont limit&#233;s au nombre de quatre alors que la liste des diff&#233;rences sp&#233;cifiques
</p>
<p>de la BD&#233;f n&#8217;est pas a priori close.
&#8211; Les r&#244;les du Lexique G&#233;n&#233;ratif servent &#224; la description de toutes les lexies, quel que soit leur type s&#233;mantique.
</p>
<p>On envisage au contraire dans la BD&#233;f de mettre au jour des structures d&#233;finitionnelles propres aux diff&#233;rents
types de lexies.
</p>
<p>3Certaines propositions &#233;l&#233;mentaires peuvent n&#8217;&#234;tre constitu&#233;es que d&#8217;un connecteur. C&#8217;est le cas ici de la
proposition n&#9702;1 : et_puis marque une succession temporelle entre les &#233;v&#233;nements d&#233;not&#233;s par les propositions
1.1, 1.2 et 1.3 (X introduit Y dans Alpha et_puis X mastique Y et_puis X avale Y).
</p>
<p>4Pour les crit&#232;res permettant d&#8217;&#233;lire le sens de base et de d&#233;cider du d&#233;coupage du polys&#232;me en unit&#233; de sens
discr&#232;tes, voir (Mel&#8217;c&#780;uk et al., 1995).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lucie Barque
</p>
<p>COUDE#I.a de anim&#233; X COUDE#II.1 de v&#234;tement X COUDE#II.2 de inanim&#233; X
COMPOSANTE CENTRALE : COMPOSANTE CENTRALE : COMPOSANTE CENTRALE :
1 : partie de n1=bras#I.1a de X 1 : partie de X 1 : partie de X
DIFF&#201;RENCES SP&#201;CIFIQUES : DIFF&#201;RENCES SP&#201;CIFIQUES : DIFF&#201;RENCES SP&#201;CIFIQUES :
/*Localisation_spatiale*/ /*Fonction*/ /*Forme*/
2 : *1 situ&#233; au_milieu de *n1 2 : *1 couvrir coude#Ia de A 2 : *1 courbe
3 : *1 situ&#233; sur face#II.2 ext&#233;rieur de *n1 quand *3
/*Fonction_physiologique*/ 3 : A porter X /*Perception*/
4 : *1 constituer articulation de *n1 3 :*1 per&#231;u comme *4
5 : *4 permettre *6 4 : *1 former angle
6 : *n1 se_plier &#224; *1 en formant un angle
</p>
<p>FIG. 2 &#8211; Trois acceptions du vocable COUDE, BD&#233;f
</p>
<p>Cette observation appelle deux commentaires. D&#8217;une part, cela revient &#224; dire que, de m&#234;me
qu&#8217;il est possible, lorsque l&#8217;on emploie une lexie ayant un sens figur&#233;, de faire r&#233;f&#233;rence en
m&#234;me temps au sens propre correspondant (certains jeux de mots reposent sur ce principe), de
m&#234;me le sens de la lexie de base peut porter le sens de certaines acceptions figur&#233;es. Ce point
de vue n&#8217;est pas forc&#233;ment recevable et il faudra se demander si le pont s&#233;mantique ne doit pas
dans certains cas demeurer implicite. La lexie SE_PLIER contient en effet probablement d&#233;j&#224; la
composante (former un angle) dans sa d&#233;finition. D&#8217;autre part, et en faveur cette fois de l&#8217;expli-
citation du pont s&#233;mantique, on peut voir cette composante d&#233;finitionnelle de la lexie de base
comme un indice de l&#8217;acception m&#233;taphorique et envisager par cons&#233;quent de pr&#233;voir, dans une
certaine mesure, les transferts m&#233;taphoriques (moins r&#233;guliers que les transferts m&#233;tonymiques
(Apresjan, 1974)), &#224; partir du sens de base. Un travail de relev&#233; des ponts s&#233;mantiques reste
&#224; effectuer sur l&#8217;ensemble de la base de donn&#233;es, qui permettra de valider ou d&#8217;invalider ces
pr&#233;visions. C&#8217;est ce qui est envisag&#233; dans la section suivante.
</p>
<p>4 Elaborer des patrons formels de polys&#233;mie.
</p>
<p>Les d&#233;finitions de la BD&#233;f facilitent par leur structuration explicite l&#8217;identification des ponts
s&#233;mantiques entre les lexies d&#8217;un vocable. Le travail consistant &#224; &#233;laborer des ensembles de
patrons formels de polys&#233;mie &#224; partir des d&#233;finitions BD&#233;f nous semble int&#233;ressant pour :
</p>
<p>Son originalit&#233;. A notre connaissance, aucun travail de ce genre n&#8217;a &#233;t&#233; entrepris &#224; partir de
bases de donn&#233;es lexicales couramment utilis&#233;es dans des applications de TAL (cf WordNet5
(Miller, 1990) et FrameNet6). Cette recherche s&#8217;effectuera en outre sur des donn&#233;es lexicogra-
phiques du fran&#231;ais idoines. Les liens de polys&#233;mie ne sont en effet que partiellement repr&#233;-
sent&#233;s dans les bases de donn&#233;es lexicales de l&#8217;anglais mentionn&#233;es ci-dessus : dans WordNet,
les diff&#233;rents sens d&#8217;un mot sont isol&#233;s dans des synsets, unit&#233; conceptuelle repr&#233;sent&#233;e par un
regroupement d&#8217;unit&#233;s lexicales synonymiques. De m&#234;me dans FrameNet, une unit&#233; lexicale
est associ&#233;e &#224; autant de frames (la situation conceptuelle d&#233;not&#233;e par la lexie) qu&#8217;elle compte
d&#8217;acceptions. Certains liens de polys&#233;mie reposant sur des diff&#233;rences de r&#233;alisation syntaxique
(par exemple, l &#8217;alternance non-causatif/causatif) sont toutefois repr&#233;sent&#233;s gr&#226;ce &#224; la mise en
</p>
<p>5http ://www.cogsci.princeton.edu/&#732;wn/
6http ://www.icsi.berkeley.edu/&#732;framenet</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De la lexie au vocable : la repr&#233;sentation formelle des liens de polys&#233;mie
</p>
<p>correspondance des &#233;l&#233;ments du frame avec leur diff&#233;rentes r&#233;alisations syntaxiques.
</p>
<p>La valorisation de la BD&#233;f. Les en-t&#234;tes de blocs d&#233;finitionnels sont &#224; rapprocher des traits de
la structure des qualia du Lexique G&#233;n&#233;ratif mais sont en nombre moins restreints (cf note 1).
Les m&#233;chanismes de g&#233;n&#233;rations de sens en contexte propos&#233;s par le Lexique G&#233;n&#233;ratif, comme
par exemple les r&#232;gles de coercition de type, reposent en partie sur ces diff&#233;rents traits. Il nous
faudra &#233;tudier les diff&#233;rents types de blocs abritant le pont s&#233;mantique dans une d&#233;finition et
voir a posteriori si ils sont pertinents pour &#233;viter les probl&#232;mes de surg&#233;n&#233;ration de sens.
</p>
<p>L&#8217;exploitation des r&#233;sultats dans le cadre de la lexicologie computationnelle. Les patrons
de polys&#233;mie pourront servir par exemple &#224; proposer des r&#232;gles lexicales permettant de g&#233;n&#233;rer
automatiquement des d&#233;finitions &#224; partir de la d&#233;finition de la lexie de base. Par exemple, la r&#232;gle
d&#233;duite d&#8217;un patron de polys&#233;mie extrait du vocable COUDE (figure 3) pourra &#234;tre appliqu&#233;e aux
lexies JAMBE#1a, DOS#1a, DOIGT#1a, etc.
</p>
<p>L1 L2
Etiq_S&#233;m : partie du corps Etiq_S&#233;m :partie de v&#234;tement
</p>
<p>L2 couvrir L1
</p>
<p>FIG. 3 &#8211; R&#232;gle lexicale
</p>
<p>Il faudra bien entendu pouvoir contraindre l&#8217;application de cette r&#232;gle au moyen d&#8217;autres r&#232;gles
afin d&#8217;emp&#234;cher la g&#233;n&#233;ration d&#8217;une lexie &#233;tiquet&#233;e partie de v&#234;tement &#224; partir des
lexies de base COU#1a, BRAS#1a, etc. On s&#8217;inspirera notamment du type de r&#232;gles propos&#233;es
dans (Copestake &amp; Briscoe, 1995). La r&#232;gle du blocage lexical, par exemple, permet de s&#8217;assu-
rer que le sens &#224; g&#233;n&#233;rer n&#8217;est pas lexicalis&#233; d&#8217;une autre mani&#232;re. L&#8217;homog&#233;n&#233;it&#233; de l&#8217;encodage
des d&#233;finitions BD&#233;f devrait permettre d&#8217;identifier ais&#233;ment le pr&#233;dicat couvrir(L2,L1) dans les
d&#233;finitions de COL#1a et MANCHE#1a.
</p>
<p>5 Conclusion
</p>
<p>Nous nous sommes int&#233;ress&#233;s dans cet article &#224; la structure formelle des d&#233;finitions de la BD&#233;f,
base de donn&#233;es lexicales actuellement en cours de d&#233;veloppement &#224; l&#8217;universit&#233; de Montr&#233;al.
Nous avons montr&#233; que la BD&#233;f, loin de nier la polys&#233;mie, offrait au contraire la possibilit&#233; d&#8217;en
d&#233;gager une repr&#233;sentation formelle originale. Nous nous sommes content&#233;s pour l&#8217;heure de
soulever quelques probl&#232;mes li&#233;s &#224; la repr&#233;sentation de ce ph&#233;nom&#232;ne lexical. L&#8217;&#233;tape suivante
de cette recherche consistera, lorsque le formalisme de la BD&#233;f sera enti&#232;rement stabilis&#233;, &#224;
&#233;laborer des ensembles de patrons formels de polys&#233;mie qui permettront de prendre la mesure
exacte du caract&#232;re r&#233;gulier ou non des diff&#233;rents liens de polys&#233;mie.
</p>
<p>R&#233;f&#233;rences
ALTMAN J., POLGUERE A. (2003), La BD&#233;f : base de d&#233;finitions d&#233;riv&#233;e du Dictionnaire explicatif
et combinatoire, Proceedings of the First International Conference on Meaning-Text Theorie, Paris, p.43-
54.
APRESJAN J. (1974) , Regular Polysemy, Linguistics, 142, p.5-32.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lucie Barque
</p>
<p>COPESTAKE A., BRISCOE T. (1995), Semi-productive polysemy and sense extension Journal of
Semantics 12(1),15-68.
MEL&#8217;CUK I. et al. (1984, 1988, 1992, 1999), Dictionnaire explicatif et combinatoire du fran&#231;ais
contemporain. Recherches lexico-s&#233;mantiques I, II, III, IV, Montr&#233;al, Presses de l&#8217;Universit&#233; de Mont-
r&#233;al.
MEL&#8217;CUK I. (1997), Vers une Linguistique Sens-Texte, Le&#231;on inaugurale au Coll&#232;ge de France, Coll&#232;ge
de France, Paris.
MEL&#8217;CUK I., CLAS A., POLGUERE A. (1995), Introduction &#224; la lexicologie explicative et combi-
natoire, AUPELF-UREF/Duculot, Louvain-la-Neuve.
MILLER G. (ed) (1990) WordNet : An On-Line Lexical Database, in : International Journal of Lexico-
graphie, 3 :4, pp. 233-249.
PICOCHE J. (1997) Pr&#233;cis de Lexicologie Fran&#231;aise, Nathan,Paris.
POLGUERE A. (2003), Lexicologie et s&#233;mantique lexicale. Notions fondamentales, Presses Universi-
taires de Montr&#233;al.
PUSTEJOVSKY J. (1995), The Generative Lexicon, MIT Press.
VICTORRI B., FUCHS C. (1996) La polys&#233;mie. Construction dynamique du sens, Herm&#232;s, Paris.
WANNER L. (2003), Definitions of Lexical Meanings : Some Reflections on Purpose and Structure,
Proceedings of the First International Conference on Meaning-Text Theory, Paris, p. 55-65.</p>

</div></div>
</body></html>