<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me adaptable pour l&#8217;initialisation automatique d&#8217;une base lexicale interlingue par acceptions</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>Un syst&#232;me adaptable pour l&#8217;initialisation automatique d&#8217;une
base lexicale interlingue par acceptions
</p>
<p>Aree Teeraparbseree
GETA, CLIPS, IMAG (UJF &amp; CNRS)
</p>
<p>385, rue de la Biblioth&#232;que
B.P. 53 - 38041 Grenoble Cedex 9, France
</p>
<p>aree.teeraparbseree@imag.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>base lexicale multilingue, construction automatique de lexies et axies, acception interlingue
multilingual lexical database, automatic building of lexies and axies, interlingual acception
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article pr&#233;sente une strat&#233;gie de construction semi-automatique d&#8217;une base lexicale inter-
lingue par acception, &#224; partir de ressources existantes, qui utilise en synergie des techniques
existantes de d&#233;sambigu&#239;sation. Les apports et limitations de chaque technique sont pr&#233;sen-
t&#233;s. Notre proposition est de pouvoir composer arbitrairement des techniques, en fonction des
ressources disponibles, afin d&#8217;obtenir une base interlingue de la qualit&#233; souhait&#233;e. Jeminie, un
syst&#232;me adaptable qui met en oeuvre cette strat&#233;gie, est introduit dans cet article.
</p>
<p>This article presents a strategy for the semi-automatic building of an interlingual lexical data-
base, based on existing resources, and using existing disambiguisation techniques in synergy.
The pros and cons of each technique are given. Our proposal is to be able to compose techniques
arbitrarily, according to the available resources, in order to produce an interlingual database of
the desired quality. Jeminie, an adaptable system that implements this strategy, is introduced in
this article.
</p>
<p>Introduction
</p>
<p>Le travail pr&#233;sent&#233; ici se place dans le cadre du projet Papillon (Mangeot-Lerebours et al.,
2003). Ce projet vise &#224; la construction collaborative d&#8217;une grande base lexicale multilingue. La
motivation initiale du projet est le manque de dictionnaires, &#224; la fois pour humains et machines,
entre le fran&#231;ais et de nombreuses langues asiatiques. La construction d&#8217;une base lexicale multi-
lingue n&#233;cessite de r&#233;unir des linguistes sp&#233;cialistes de toutes les langues concern&#233;es par la base,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aree Teeraparbseree
</p>
<p>ce qui peut &#234;tre difficile voire impossible. Des logiciels d&#8217;aide automatique &#224; la construction de
bases lexicales s&#8217;av&#232;rent donc n&#233;cessaires.
</p>
<p>Nous proposons dans cet article un syst&#232;me logiciel d&#8217;aide &#224; la construction d&#8217;une base lexicale
interlingue par acceptions, et plus pr&#233;cis&#233;ment &#224; la production d&#8217;un &#8220;premier jet&#8221; d&#8217;une organi-
sation des vocables en lexies (sens de mot) et &#224; la transformation des liens traductionnels entre
vocables en liens interlingues (axies) entre lexies. Cette premi&#232;re version de la base est ensuite
corrig&#233;e et am&#233;lior&#233;e par les linguistes.
</p>
<p>Cet article pr&#233;sente d&#8217;abord la structure de la base lexicale du projet Papillon, puis une strat&#233;gie
g&#233;n&#233;rale et des techniques automatiques utilisables pour la construction d&#8217;une base lexicale
interlingue, et enfin Jeminie, un syst&#232;me adaptable pour la construction de telles bases.
</p>
<p>1 Papillon : base lexicale interlingue par acceptions
</p>
<p>Le projet Papillon1 a pour but de cr&#233;er une base lexicale multilingue comprenant l&#8217;allemand,
l&#8217;anglais, le fran&#231;ais, le japonais, le lao, le malais, le tha&#239;, le vietnamien et, tr&#232;s r&#233;cemment,
le chinois. Papillon utilise l&#8217;approche interlingue, o&#249; un langage interm&#233;diaire artificiel (dit
aussi langage pivot) est utilis&#233; pour &#233;tablir des liens entre les langues. Une telle approche a
&#233;t&#233; utilis&#233;e dans d&#8217;autres projets, par exemple, le projet KBMT-89 (Goodman &amp; Nirenburg,
1991) et le projet ULTRA (Farwell et al., 1992). La macrostructure de Papillon repose sur une
structure pivot d&#233;finie dans (S&#233;rasset, 1994). Une &#8220;base Papillon&#8221; est compos&#233;e d&#8217;un ensemble
d&#8217;acceptions monolingues (lexies) pour chaque langue et d&#8217;un ensemble de liens interlingues
qui relient les lexies. Ces liens interlingues peuvent aussi &#234;tre reli&#233;s &#224; une liste d&#8217;&#233;l&#233;ments de
chaque syst&#232;me ext&#233;rieur qui sont plus ou moins &#233;quivalents ou voisins (synsets de WordNet,
universal words d&#8217;UNL, ...). Cette structure a d&#233;j&#224; &#233;t&#233; exp&#233;riment&#233;e dans PARAX (Blanc, 1999).
La microstructure (structure lexicale des entr&#233;es de chaque dictionnaire) est tir&#233;e des travaux de
Polgu&#232;re sur le format lexicographique DiCo, qui est une simplification de celui du Dictionnaire
Explicatif et Combinatoire associ&#233; &#224; la th&#233;orie sens-texte (Mel&#8217;cuk et al., 1995).
La construction du contenu se fera en deux phases (Mangeot-Lerebours et al., 2003). (1) La
phase d&#8217;amor&#231;age a pour but d&#8217;obtenir, &#224; partir de dictionnaires existants, une premi&#232;re base
lexicale contenant de nombreuses entr&#233;es associ&#233;es &#224; des informations minimales. Puis dans (2)
la phase de contribution, des internautes b&#233;n&#233;voles coop&#232;rent &#224; travers Internet pour apporter
des modifications (ajout, correction ou suppression) &#224; la base lexicale du serveur Papillon. Cette
phase ne peut commencer que lorsqu&#8217;il existe un ensemble minimal d&#8217;informations lexicales
sur la base du serveur Papillon. Le travail pr&#233;sent&#233; ici concerne la phase d&#8217;amor&#231;age, et plus
particuli&#232;rement son automatisation partielle ou compl&#232;te.
</p>
<p>2 Construction d&#8217;acceptions interlingues
</p>
<p>Pour mener &#224; bien ce travail, nous disposons de plusieurs dictionnaires monolingues (4000 en-
tr&#233;es fran&#231;aises DiCo de l&#8217;Universit&#233; de Montr&#233;al, 10 000 entr&#233;es tha&#239; de l&#8217;Universit&#233; Kasetsart),
de dictionnaires bilingues (70 000 entr&#233;es japonais-anglais et 10 000 entr&#233;es japonais-fran&#231;ais
</p>
<p>1La base est accessible principalement sur le site http ://www.papillon-dictionary.org/. Ce site contient aussi un
collection de dictionnaires &#8220;classiques&#8221;, accessibles par une interface unifi&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me adaptable pour l&#8217;initialisation automatique d&#8217;une base lexicale interlingue
par acceptions
</p>
<p>de JMDICT en format XML de J. Breen, 8000 entr&#233;es japonais-tha&#239; de SAIKAM) et de diction-
naires multicibles (50 000 entr&#233;es anglais-fran&#231;ais-malais de FeM).
Nous proposons d&#8217;initialiser la &#8220;base Papillon&#8221; en deux &#233;tapes : (1) pour chaque dictionnaire
monolingue on extrait l&#8217;information des vocables, par exemple les lemmes (simples ou com-
pos&#233;s), les parties du discours et les d&#233;finitions, et on cr&#233;e des lexies ; (2) &#224; partir des lexies de
plusieurs langues et des ressources bilingues et multilingues, on cr&#233;e des axies qui relient ces
lexies et on fait &#233;voluer si n&#233;cessaire l&#8217;ensemble des lexies de chaque langue. Si les bases mo-
nolingues sont volumineuses, le temps n&#233;cessaire pour relier &#224; la main ces bases monolingues
en liens interlingues sera tr&#232;s &#233;lev&#233;. De plus, le travail de cr&#233;ation des axies est tr&#232;s co&#251;teux. Il
n&#233;cessite des personnes connaissant de nombreuses langues. Notre objectif est de d&#233;velopper
un logiciel pour aider &#224; la construction de ces liens afin de r&#233;duire le co&#251;t de construction. Plus
pr&#233;cis&#233;ment, dans l&#8217;&#233;tape (1) le logiciel automatisera la construction des lexies, mais il faudra
quand m&#234;me filtrer les lexies &#224; la main pour v&#233;rifier leur qualit&#233; ; dans l&#8217;&#233;tape (2) le logiciel sera
semi-automatique car la construction est automatique mais l&#8217;utilisateur devra tout de m&#234;me pa-
ram&#233;trer l&#8217;outil en fonction des ressources et de la qualit&#233; d&#233;sir&#233;e, et du co&#251;t des traitements. Le
probl&#232;me principal est de relier automatiquement des lexies qui ont la m&#234;me signification. Cette
section d&#233;crit donc quelques techniques existantes de d&#233;sambigu&#239;sation que nous consid&#233;rons
pour la construction automatique des axies, et les probl&#232;mes li&#233;s &#224; chaque technique.
</p>
<p>La technique de traduction bilingue (TR_BILING) utilise un ou plusieurs dictionnaires bi-
lingues pour cr&#233;er des axies qui relient toutes les lexies de deux langues dont les mots sont la
traduction l&#8217;un de l&#8217;autre. Les axies obtenues devraient &#234;tre filtr&#233;es ult&#233;rieurement en utilisant
d&#8217;autres techniques pour &#233;ventuellement d&#233;grouper une axie en plusieurs axies ou enlever des
mauvaises lexies dans les axies. La technique de traduction bilingue multiple (TR_MBILING)
est une technique de traduction bilingue qui se base sur plusieurs dictionnaires bilingues, p.ex.
japonais-anglais et anglais-fran&#231;ais et leurs dictionnaires inverses, pour compl&#233;ter ou pallier
l&#8217;absence de dictionnaires bilingues entre deux langues, p.ex. entre le japonais et le fran&#231;ais
(Tanaka &amp; Umemura, 1994). Cependant, ces deux techniques produisent une base lexicale au
niveau des mots et pas du sens des mots. La technique de comparaison de deux vecteurs
conceptuels (CMP_VECTOR) associe &#224; chaque lexie un vecteur de concepts, appell&#233; vec-
teur conceptuel, dont chaque dimension correspond &#224; un concept feuille d&#8217;un th&#233;saurus. M.
Lafourcade (Lafourcade, 2002; Mangeot-Lerebours et al., 2003) exp&#233;rimente pour le fran&#231;ais
et l&#8217;anglais, en se basant sur les 873 concepts feuilles du th&#233;saurus Larousse. La distance angu-
laire entre vecteurs mesure la proximit&#233; th&#233;matique entre lexies. La difficult&#233; est de trouver des
th&#233;saurus pour ces langues et de faire correspondre les concepts feuilles de ces th&#233;saurus. Par
contre, le r&#233;sultat est directement de niveau lexie et cette technique est relativement efficace.
La technique de filtrage de synonymes (FILT_SYN) regroupe dans une m&#234;me axie des lexies
de la m&#234;me langue qui ont le m&#234;me sens d&#8217;apr&#232;s un dictionnaire de synonymes. Le manque de
dictionnaires de synonymes des langues consid&#233;r&#233;es est un probl&#232;me pour cette technique.
</p>
<p>Une seule technique n&#8217;est pas suffisante pour initialiser une base lexicale interlingue de la
qualit&#233; qu&#8217;on souhaite. En revanche, ces techniques sont compl&#233;mentaires : pour atteindre la
meilleure qualit&#233; possible, nous proposons de composer plusieurs techniques ensemble. Nous
pr&#233;sentons ci-apr&#232;s deux exemples de composition de techniques pour illustrer et motiver la
n&#233;cessit&#233; de composer des techniques. Les ressources disponibles sont : (1) des dictionnaires bi-
lingues : FA1 (fran&#231;ais-anglais), FA2 (fran&#231;ais-anglais), AT (anglais-tha&#239;), AJ (anglais-japonais),
(2) des bases lexicales monolingues fran&#231;ais, anglais, japonais, tha&#239;, (3) l&#8217;information sur la
partie du discours pour chaque lexie, (4) un vecteur conceptuel associ&#233; &#224; chaque lexie, (5) un
dictionnaire de synonymes fran&#231;ais SF. La liste des techniques disponibles est celle de la section</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aree Teeraparbseree
</p>
<p>2. On peut alors d&#233;finir la composition de techniques suivante, o&#249; les techniques sont appliqu&#233;es
les unes apr&#232;s les autres :
TR_BILING(FA1); TR_BILING(FA2); FILT_SYN(SF); CMP_VECTOR; TR_BILING(AJ);
TR_MBILING(AJ); TR_BILING(AT); TR_MBILING(AT)
</p>
<p>L&#8217;ex&#233;cution de chaque technique modifie la base en fonction des param&#232;tres pass&#233;s, p.ex., le
nom d&#8217;un fichier dictionnaire bilingue pour TR_BILING. L&#8217;ordre d&#8217;ex&#233;cution peut avoir un
impact important sur le temps de calcul. Par exemple, si une base lexicale monolingue fran&#231;ais
a beaucoup de mots synonymes, il faudra probablement utiliser la technique de filtrage par
dictionnaire de synonymes pour diminuer le nombre d&#8217;axies avant d&#8217;utiliser d&#8217;autres filtrages,
pour diminuer le temps de calcul de la suite d&#8217;ex&#233;cution. Si les dictionnaires FA2 et AJ, et le
dictionnaire monolingue japonais ne sont pas disponibles, l&#8217;ensemble des techniques utilisables
est plus restreint. On peut par exemple d&#233;finir la composition de techniques suivante :
TR_BILING(FA1); CMP_VECTOR; TR_BILING(AT); TR_MBILING(AT)
</p>
<p>A cause du manque de ressources disponibles, cette deuxi&#232;me composition produit probable-
ment une base lexicale interlingue de qualit&#233; inf&#233;rieure, avec une plus grande proportion d&#8217;axies
incorrectes, n&#233;cessitant plus de corrections ult&#233;rieures par les linguistes.
</p>
<p>Ces exemples montrent qu&#8217;il est n&#233;cessaire de pouvoir utiliser des compositions des techniques
diff&#233;rentes, car le choix d&#8217;une composition est un compromis entre la qualit&#233; souhait&#233;e de la
base produite, le co&#251;t de la mise en oeuvre des techniques (ressources techniques n&#233;cessaires), et
les ressources lexicales n&#233;cessaires. Une propri&#233;t&#233; essentielle d&#8217;un syst&#232;me logiciel de construc-
tion d&#8217;axies est donc de pouvoir supporter la mise en oeuvre de compositions arbitraires de
techniques de construction d&#8217;axies. Le syst&#232;me Jeminie, pr&#233;sent&#233; dans la section suivante, a &#233;t&#233;
con&#231;u dans cet objectif.
</p>
<p>3 Syst&#232;me Jeminie
</p>
<p>Jeminie est un canevas logiciel (framework) que nous avons con&#231;u pour automatiser la construc-
tion de bases lexicales interlingues par acceptions. Jeminie met en oeuvre les deux &#233;tapes d&#233;-
finies dans la section 2 : normalisation des donn&#233;es avec production d&#8217;un premier ensemble de
lexies, puis production d&#8217;axies et am&#233;lioration de l&#8217;ensemble des lexies.
</p>
<p>Dans l&#8217;&#233;tape de normalisation des donn&#233;es, on ne manipule que des lexies, en convertissant vers
le mod&#232;le de donn&#233;es (mod&#232;le d&#8217;objets) de Jeminie les donn&#233;es qui proviennent de ressources
monolingues diff&#233;rentes &#224; partir de fichiers au format XML Papillon, mais le syst&#232;me peut
&#234;tre &#233;tendu pour importer des dictionnaires dans d&#8217;autres mod&#232;les de donn&#233;es. On enrichit ces
lexies initiales de chaque langue par des informations tir&#233;es des ressources monolingues, par
exemple, des informations sur la partie du discours, une d&#233;finition, etc. C&#8217;est dans cette phase
qu&#8217;on contr&#244;le la diff&#233;rence entre les informations qui proviennent de ressources diff&#233;rentes. Par
exemple, on transforme l&#8217;information de partie du discours de chaque lexie en une des valeurs
communes, par exemple, on convertit l&#8217;information &#8220;nom masculin&#8221; en &#8220;nom&#8221;.
</p>
<p>Dans l&#8217;&#233;tape de production d&#8217;axies et d&#8217;&#233;volution des lexies, dans Jeminie, nous consid&#233;rons
une technique de cr&#233;ation ou de filtrage des axies comme un module logiciel. Jeminie per-
met de composer arbitrairement des modules pour cr&#233;er une base lexicale interlingue de la
meilleure qualit&#233; possible. Nous appelons processus de production de base multilingue une s&#233;-
quence d&#8217;ex&#233;cutions de modules. Un seul processus n&#8217;est pas applicable dans tous les cas. Il</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me adaptable pour l&#8217;initialisation automatique d&#8217;une base lexicale interlingue
par acceptions
</p>
<p>peut &#234;tre diff&#233;rent en fonction des ressources et outils disponibles, des propri&#233;t&#233;s des langues,
des objectifs linguistiques, etc. Le syst&#232;me a deux types d&#8217;acteurs diff&#233;rents, dont le point de
vue, les pr&#233;occupations et les t&#226;ches sont ind&#233;pendantes : (1) un informaticien qui programme
des modules, (2) un linguiste qui compose des techniques par la description d&#8217;un processus.
Jeminie a une architecture en couches. L&#8217;interpr&#233;teur de processus interpr&#232;te les processus sp&#233;-
cifi&#233;s par les linguistes, et d&#233;clenche l&#8217;ex&#233;cution des modules. L&#8217;interpr&#233;teur et les modules sont
d&#233;velopp&#233;s en utilisant le noyau de Jeminie, qui est une biblioth&#232;que de programmation Java de
base qui implante aussi la normalisation et l&#8217;importation de dictionnaires. La syntaxe que nous
avons d&#233;finie pour sp&#233;cifier des processus est illustr&#233;e dans les exemples de &#8220;composition&#8221; de
la section 2. Cette syntaxe est simple, car destin&#233;e aux linguistes non informaticiens. Jeminie
peut &#234;tre &#233;tendu en d&#233;veloppant de nouveaux modules. Les donn&#233;es sont repr&#233;sent&#233;es ici par
des objets Java, p.ex. un objet de type Axie est li&#233; &#224; un ensemble d&#8217;objets Lexie, accessibles
via des objets de type InterlingualDatabase repr&#233;sentant des bases multilingues. Les objets sont
sauvegard&#233;s dans une base de donn&#233;es relationnelle via un intergiciel de persistance d&#8217;objets
Java, Hibernate2, sur lequel s&#8217;appuie le noyau.
</p>
<p>Consid&#233;rons par exemple deux dictionnaires monolingues fran&#231;ais et anglais. Pour chaque dic-
tionnaire, une &#233;tape de normalisation cr&#233;e un objet LexieDatabase, qui contient un objet Lexie
pour chaque acception avec pour chacun un objet ConceptualVector, etc. Ensuite, un objet In-
terlingualDatabase &#8220;vide&#8221; est cr&#233;&#233;. Lors de l&#8217;ex&#233;cution d&#8217;un processus, l&#8217;objet Interlingual-
Database et les objets LexieDatabase sont pass&#233;s en param&#232;tre &#224; chaque module ex&#233;cut&#233;. Un
module peut avoir des param&#232;tres suppl&#233;mentaires sp&#233;cifiques, comme un nom de fichier de
dictionnaire bilingue pour le module TR_BILING. Un module ex&#233;cut&#233; cr&#233;e ou supprime des
objets Axie dans l&#8217;objet InterlingualDatabase. Par exemple, consid&#233;rons un processus qui ex&#233;-
cute successivement les modules TR_BILING et FILT_SYN. Le module TR_BILING cr&#233;e un
objet Axie pour chaque paire d&#8217;objets Lexie pour les acceptions des mots &#8220;affection&#8221; en fran&#231;ais
et &#8220;affection&#8221; et &#8220;disease&#8221; en anglais, mots qui sont traductions l&#8217;un de l&#8217;autre selon le diction-
naire bilingue pass&#233; en param&#232;tre, et ainsi de suite pour toutes les Lexies fran&#231;aises. Ensuite, le
module FILT_SYN fusionne en un m&#234;me nouvel objet Axie tous les objets Axie qui sont li&#233;s
aux objets Lexie qui sont les acceptions des mots fran&#231;ais &#8220;affection&#8221; et &#8220;maladie&#8221;, car ils sont
synonymes selon le dictionnaire de synonymes pass&#233; en param&#232;tre, et ainsi de suite pour toutes
les Axies. Les objets sont automatiquement persistants et conserv&#233;s dans la base de donn&#233;es.
Cette approche &#224; objets permet de d&#233;velopper facilement des modules.
Nous avons implant&#233; des fonctions de normalisation des donn&#233;es capables d&#8217;extraire des in-
formations li&#233;es aux lexies telles que les lemmes, les parties du discours, les d&#233;finitions. Nous
avons valid&#233; la partie de normalisation des donn&#233;es avec une base lexicale monolingue pour
le fran&#231;ais qui regroupe des informations de plusieurs dictionnaires monolingues. Nous avons
aussi normalis&#233; des lexies en anglais extraites de Wordnet3. Le r&#233;sultat obtenu est une base de
lexies avec pour chaque lexie son lemme, sa partie du discours, sa d&#233;finition, et son vecteur
conceptuel stock&#233;e dans une base de donn&#233;es PostgreSQL. Nous avons pour l&#8217;instant normalis&#233;
21400 mots / 45500 lexies du fran&#231;ais &#224; partir de la resource Semantic CV Service, et 52900
mots / 94660 lexies de l&#8217;anglais &#224; partir de WordNet. Trois modules / techniques de construction
d&#8217;axies sont en cours d&#8217;implantation : traduction bilingue, comparaison de partie du discours et
comparaison de deux vecteurs conceptuels.
</p>
<p>2http ://hibernate.sf.net/
3http ://www.cogsci.princeton.edu/~wn/index.shtml</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aree Teeraparbseree
</p>
<p>4 Conclusion et perspectives
</p>
<p>Cet article pr&#233;sente une strat&#233;gie de construction semi-automatique d&#8217;une base lexicale inter-
lingue &#224; partir de ressources existantes et introduit un syst&#232;me logiciel adaptable qui supporte
cette strat&#233;gie. L&#8217;id&#233;e principale est de permettre &#224; des utilisateurs linguistes de choisir et com-
poser des techniques disponibles pour construire une base de lexies reli&#233;es par des axies. Le
syst&#232;me est ouvert pour implanter des nouvelles techniques de construction ou de filtrage des
axies. Le syst&#232;me devra permettre d&#8217;&#233;valuer automatiquement un processus en cours d&#8217;ex&#233;cu-
tion en mesurant sa consommation de ressources (temps de calcul, etc.) et la qualit&#233; des axies
obtenues. Nous sommes en train d&#8217;identifier des crit&#232;res possibles pour &#233;valuer la qualit&#233; des
axies. Ces crit&#232;res seront utiles pour comparer des processus de construction pour pouvoir pro-
duire des axies de la meilleure qualit&#233; possible.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BLANC E. (1999). PARAX-UNL : A large scale hypertextual multilingual lexical database.
In Proceedings of 5th Natural Language Processing Pacific Rim Symposium, pp. 507&#8211;510,
Beijing : Tsinghua University Press.
FARWELL D., GUTHRIE L. &amp; WILKS Y. (1992). The automatic creation of lexical entries for
a multilingual MT system. In Proceedings of COLING&#8217;92, pp. 532&#8211;538, Nantes.
GOODMAN K. &amp; NIRENBURG S. (1991). The KBMT Project : A Case Study in Knowledge-
Based Machine Translation. San Mateo, California : Morgan Kaufmann.
LAFOURCADE M. (2002). Automatically populating acception lexical databases through bi-
lingual dictionaries and conceptual vectors. In Proceedings of S&#233;minaire Papillon 2002, Tokyo.
MANGEOT-LEREBOURS M., S&#201;RASSET G. &amp; LAFOURCADE M. (2003). Construction col-
laborative d&#8217;une base lexicale multilingue - le projet Papillon. In Proceedings of TAL&#8217;2003,
number 2, pp. 151&#8211;176.
MEL&#8217;CUK I., CLAS A. &amp; POLGU&#200;RE A. (1995). Introduction &#224; la lexicologie explicative et
combinatoire. Louvain-la-Neuve : Duculot.
S&#201;RASSET G. (1994). Interlingual lexical organisation for multilingual lexical databases in
NADIA. In Proceedings of COLING&#8217;94, pp. 278&#8211;282, Kyoto.
TANAKA K. &amp; UMEMURA K. (1994). Construction of a bilingual dictionary intermediated
by a third language. In Proceedings of COLING&#8217;94, pp. 297&#8211;303, Kyoto, Japan.</p>

</div></div>
</body></html>