<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La Transcription Orthographique-Phonetique De La Langue Arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2004, F&#232;s, 19-22 avril 2004 
</p>
<p>LA TRANSCRIPTION ORTHOGRAPHIQUE-PHONETIQUE 
DE LA LANGUE ARABE 
</p>
<p>Tahar SAIDANE (1), Mounir ZRIGUI (2) et Mohamed BEN AHMED (3) 
(1) Soci&#233;t&#233; Tunisienne d&#8217;Electricit&#233; et du Gaz,  
</p>
<p>Centre de production de Sousse, Tunisie  
saidane.tahar@planet.tn 
</p>
<p>(2) Laboratoire RIADI, Unit&#233; Monastir 
Facult&#233; des Sciences de Monastir, Tunisie 
</p>
<p>mounir.zrigui@fsm.rnu.tn 
(3) Laboratoire RIADI, Ecole Nationale 
</p>
<p>des Sciences de l&#8217;informatique, Tunis, Tunisie 
Mohamed.BenAhmed@riadi.rnu.tn 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
Notre article pr&#233;sente les composants n&#233;cessaires &#224; la synth&#232;se de la parole arabe. Nous nous 
attarderons sur la transcription graph&#232;me phon&#232;me, &#233;tape primordiale pour l&#8217;&#233;laboration d&#8217;un 
syst&#232;me de synth&#232;se d&#8217;une qualit&#233; acceptable. 
</p>
<p>Nous pr&#233;senterons ensuite quelques-unes des r&#232;gles utilis&#233;es pour la r&#233;alisation de notre 
syst&#232;me de traitement phon&#233;tique. Ces r&#232;gles sont, pour notre syst&#232;me, stock&#233;es dans une 
base de donn&#233;es et sont parcourues plusieurs fois lors de la transcription. 
</p>
<p> 
</p>
<p>Our paper presents the components which are necessary for the arabic speech synthesis. We 
will dwell on the transcription graph&#232;me phoneme, a primordial stage for the development of 
a synthesis system with an acceptable quality.   
</p>
<p>Then, we will present some of the rules used for the realization of our phonetic treatment 
system. These rules are, for our system, stocked in a data base and are browsed several times 
during the transcription. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
Transcription graph&#232;me-phon&#232;me, langue arabe, r&#232;gles de transcription. 
Grapheme-phoneme transcription, Arabic language, transcription rules. 
</p>
<p>1 Introduction 
Notre travail s&#8217;inscrit dans le cadre de la r&#233;alisation d&#8217;un syst&#232;me embarqu&#233; de synth&#232;se de la 
parole arabe. La conception de ce type de syst&#232;me n&#233;cessite un double effort sur deux fronts </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tahar SAIDANE , Mounir ZRIGUI et Mohamed BEN AHMED 
</p>
<p>diff&#233;rents : la synth&#232;se proprement dite mais aussi les contraintes d&#8217;embarquabilit&#233; du 
syst&#232;me &#224; proposer. 
</p>
<p>Dans cet article, nous allons nous limiter &#224; la pr&#233;sentation de l&#8217;&#233;tape de transcription. Nous 
d&#233;crirons les diff&#233;rentes &#233;tapes et composantes n&#233;cessaires &#224; une telle r&#233;alisation. 
</p>
<p>La transcription orthographique-phon&#233;tique est indispensable pour la mise en oeuvre des 
applications de synth&#232;se &#224; partir du texte telles que les applications dans les machines &#224; lire 
pour les aveugles ou de lecture du courrier &#233;lectronique. Lorsque nous lisons &#224; haute voix un 
texte, nous effectuons naturellement une transcription orthographique-phon&#233;tique avant de 
commander notre appareil vocal. Il est en fait difficile de conna&#238;tre le d&#233;tail de notre 
d&#233;marche et m&#234;me de conna&#238;tre comment sont structur&#233;es les principales phases du 
traitement. Plusieurs niveaux doivent &#234;tre pris en compte : niveaux phon&#233;tique et 
phonologique, niveaux lexical, syntaxique et m&#234;me s&#233;mantique. Il est vraisemblable que 
certaines de ces analyses sont effectu&#233;es en parall&#232;le. 
</p>
<p>2 Les constituants d&#8217;un syst&#232;me de synth&#232;se de la parole 
 
</p>
<p> 
</p>
<p>Texte 
Graphique 
</p>
<p>Texte Phon&#233;tique 
&#233;tiquet&#233; 
</p>
<p>Traitement 
linguistique 
</p>
<p>Traitement 
acoustique 
</p>
<p>Parole 
</p>
<p>Figure 1 : Sch&#233;ma de principe de notre syst&#232;me de synth&#232;se de la parole. 
</p>
<p>Notre syst&#232;me de synth&#232;se de la parole est divis&#233; en deux grandes parties : une partie 
linguistique et une partie acoustique. La partie linguistique ou symbolique permet, &#224; partir 
d&#8217;un texte &#233;crit, de g&#233;n&#233;rer un texte phon&#233;tique &#233;tiquet&#233;. Ce passage comprend quatre &#233;tapes: 
</p>
<p>1. Le pr&#233;traitement du texte (espaces, paragraphes, ponctuation, chiffres, etc.). 
</p>
<p>2. La consultation du lexique des exceptions pour l&#8217;&#233;limination des mots sp&#233;ciaux. 
</p>
<p>3. L&#8217;application des r&#232;gles de transcription &#233;tablies pour la langue arabe. 
</p>
<p>4. La conversion graph&#232;me-phon&#232;me. 
</p>
<p>A l&#8217;issue du traitement linguistique, nous aboutissons &#224; un texte phon&#233;tique &#233;tiquet&#233; qui sera 
archiv&#233; dans une base de donn&#233;es en vue de son utilisation lors des phases de test et 
d&#8217;&#233;valuation. 
</p>
<p>3 La langue arabe 
L&#8217;alphabet arabe comporte 28 consonnes et 6 voyelles de l&#8217;arabe standard (3 longues et 3 
courtes) et quelques autres r&#233;alisations vocaliques. Nous pouvons classer les consonnes selon 
plusieurs crit&#232;res : des consonnes articul&#233;es avec une vibration des cordes vocales et  des 
consonnes qui n&#8217;engendrent pas une vibration des cordes vocales, le franchissement de l&#8217;air &#224; 
travers le conduit vocal donne naissance &#224; d&#8217;autres vari&#233;t&#233;s de sons. Mais pour les besoins de 
la transcription les 28 consonnes arabes ont &#233;t&#233; divis&#233;es en deux groupes : 
</p>
<p>&#8226; 14 consonnes solaires qui assimilent le &#171; &#1600;&#1604; &#187; de l&#8217;article. 
&#8226; 14 consonnes lunaires qui n&#8217;assimilent pas le &#171; &#1600;&#1604; &#187;  de l&#8217;article. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LA TRANSCRIPTION ORTHOGRAPHIQUE-PHONETIQUE DE LA LANGUE ARABE 
</p>
<p>Solaires  Lunaires  
&#1606; &#1604; &#1592; &#1591; &#1590; &#1589; &#1588; &#1587; &#1586; &#1585; &#1584; &#1583; &#1579; &#1578; &#1610; &#1608; &#1605; &#1600;&#1607; &#1600;&#1570; &#1602; &#1601; &#1594; &#1593; &#1582; &#1581; &#1580; &#1576; &#1571; 
</p>
<p>Figure 2 : Classification des consonnes tenant compte des contraintes de la transcription. 
</p>
<p>En ce qui concerne les voyelles de l&#8217;arabe, on distingue trois voyelles courtes et trois voyelles 
longues. La dur&#233;e d&#8217;une voyelle longue est environ double de celle d&#8217;une voyelle courte. Ces 
voyelles sont caract&#233;ris&#233;es par la vibration des cordes vocales. Elles sont repr&#233;sent&#233;es dans le 
tableau suivant : 
</p>
<p>Courtes Longues
</p>
<p>/ &#1616;   &#1614;/  /  &#1615;  &#1608; &#1615;  &#1610; &#1616;  &#1575; &#1614;
</p>
<p>Figure 3 : Classification des voyelles de la langue arabe. 
</p>
<p>3.1 La transcription de la langue arabe et ses probl&#232;mes  
Certaines langues sont plus faciles que d&#8217;autres pour effectuer cette transcription. Un 
compromis a du &#234;tre trouv&#233; entre les tailles respectives du dictionnaire de r&#232;gles de 
transcription &#224; vocation g&#233;n&#233;rale et du dictionnaire de mots comportant les exceptions les plus 
courantes et facilitant l&#8217;analyse syntaxique souvent n&#233;cessaire de la phrase. 
</p>
<p>Le tableau suivant repr&#233;sente l&#8217;ensemble des caract&#232;res de l&#8217;arabe avec pour chaque 
graph&#232;me, sa transcription phon&#233;tique. 
</p>
<p>Gr. Ph. Gr. Ph. Gr. Ph. Gr. Ph. Gr. Ph. Gr. Ph. 
&#1571; E &#1582; x &#1588; S &#1594; &#402; &#1606; n  &#1615; u 
&#1576; b &#1583; d &#1589; &#223; &#1601; f &#1607; h  &#1616; i 
&#1578; t &#1584; D &#1590; &#205; &#1602; q &#1608; w  &#1611; an 
&#1579; T &#1585; r &#1591; &#711; &#1603; k &#1610; j  &#1612; un 
&#1580; Z &#1586; z &#1592; D &#1604; l &#1569; a  &#1613; in 
&#1581; &#61680; &#1587; s &#1593; &#191; &#1605; m  &#1614; a  &#1618; silence 
</p>
<p>Figure 4 : Correspondance graph&#232;me phon&#232;me de la langue arabe suivant l&#8217;alphabet 
phon&#233;tique internationale IPA 96. 
</p>
<p>La complexit&#233; du probl&#232;me de transcription peut &#234;tre appr&#233;ci&#233;e apr&#232;s avoir examin&#233; le tableau 
des correspondances graph&#232;mes-phon&#232;mes. Ces probl&#232;mes sont li&#233;s &#224; la langue trait&#233;e elle-
m&#234;me et sont de diff&#233;rentes sortes : 
</p>
<p>&#8226; Des graph&#232;mes qui ont plusieurs r&#233;alisations phon&#233;tiques. Le w&#1608; de &#171; &#1612;&#1605;&#1608;&#1615;&#1576; &#187;  et &#171; &#1612;&#1586;&#1618;&#1608;&#1614;&#1605; &#187; 
correspond &#224; deux sons diff&#233;rents ayant la m&#234;me graphie. 
</p>
<p>&#8226; Des phon&#232;mes qui ont plusieurs r&#233;alisations graph&#233;miques. Le noun dans &#171;&#1614;&#1606;&#1608;&#1615;&#1605;&#1610;&#1614;&#1602;&#1615;&#1610;&#187; et 
dans &#171;&#1614;&#1604;&#1614;&#1586;&#1618;&#1606;&#1614;&#1571;&#187; n&#8217;a pas la m&#234;me repr&#233;sentation graph&#233;mique. 
</p>
<p>&#8226; Des graph&#232;mes qui ne sont pas pris en compte. Le alif dans &#171;&#1575;&#1608;&#1615;&#1605;&#1575;&#1614;&#1602;&#187; ne correspond pas 
&#224; un son (silence).  
</p>
<p>&#8226; Une absence totale de correspondance graph&#232;me-phon&#232;me. Le mot &#171;&#1575;&#1614;&#1584;&#1614;&#1607;&#187; devrait &#234;tre 
&#233;crit &#171;&#1575;&#1614;&#1584;&#1575;&#1614;&#1607;&#187;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tahar SAIDANE , Mounir ZRIGUI et Mohamed BEN AHMED 
</p>
<p>3.2 La connaissance de la langue arabe 
Une des premi&#232;res recherches qu&#8217;on a effectu&#233;e avant toute autre d&#233;marche consiste &#224; 
formaliser au mieux les probl&#232;mes pos&#233;s par la langue arabe. Il s&#8217;agit tout d&#8217;abord de disposer 
de donn&#233;es grammaticale et linguistique de la langue arabe pour pouvoir &#233;tablir des r&#232;gles, les 
listes de mots d&#8217;exception et en g&#233;n&#233;rale de formaliser le probl&#232;me pos&#233;. 
</p>
<p>4 La transcription proprement dite 
Plusieurs phases sont &#224; distinguer : 
</p>
<p>4.1 Le rep&#233;rage des mots 
Les s&#233;parateurs (blancs, tirets...) permettent le rep&#233;rage des mots. Les s&#233;parateurs (virgules, 
points, deux points, points d&#8217;interrogation, d&#8217;exclamation...) sont aussi trait&#233;s pour l&#8217;analyse 
des pauses et des arr&#234;ts. 
</p>
<p>4.2 L&#8217;utilisation d&#8217;un lexique 
Le lexique traite les exceptions qui ne peuvent &#234;tre prises en compte par les r&#232;gles. En effet 
on ne peut pas se permettre de d&#233;penser un nombre important de r&#232;gles pour le traitement 
sp&#233;ciales de quelques mots. Un compromis est alors n&#233;cessaire. 
</p>
<p>4.3 L&#8217;utilisation de r&#232;gles 
Avant d&#8217;&#233;crire les r&#232;gles de transcription, on aura soin de d&#233;finir un certain nombre de 
cat&#233;gories qui faciliteront l&#8217;&#233;criture de ces r&#232;gles. Par exemple : les consonnes solaire ou 
lunaire, les voyelles, etc. Ces r&#232;gles traitent principalement les probl&#232;mes suivants : 
</p>
<p>&#8226; l&#8217;&#233;pellation, 
&#8226; la liaison ou non, 
&#8226; la prononciation des g&#233;min&#233;es, 
&#8226; l&#8217;&#233;lision en syllabe initiale du mot, en syllabe int&#233;rieure du mot, l&#8217;&#233;lision en finale, 
&#8226; la prononciation des graph&#232;mes &#224; l&#8217;int&#233;rieur d&#8217;un mot en fonction du contexte dans 
</p>
<p>lequel il est repr&#233;sent&#233; par un son particulier ou bien une cat&#233;gorie de sons avec 
d&#8217;&#233;ventuelles exceptions, etc. 
</p>
<p>Notre analyse linguistique nous a permis d&#8217;&#233;tablir pour notre syst&#232;me un ensemble de 133 
r&#232;gles. Il est &#224; noter que l&#8217;ordre d&#8217;application de ces r&#232;gles est tr&#233;s important et influe 
&#233;norm&#233;ment sur le r&#233;sultat final. L&#8217;ensemble de ces r&#232;gles est stock&#233; dans une table de notre 
base de donn&#233;es. En voici quelques exemples : 
</p>
<p>&#8226; Au d&#233;but d&#8217;un mot, le alif devient un hamaza (Exemple : &#1615;&#1583;&#1614;&#1604;&#1614;&#1608;&#1604;&#1575; &#8594; Elwaladu). 
&#8226; Le alif est supprim&#233; quand il est suivi d&#8217;un caract&#232;re lunaire (Exp:  &#1615;&#1585;&#1614;&#1605;&#1614;&#1602;&#1604;&#1575; &#1614;&#1593;&#1614;&#1604;&#1614;&#1591; &#8594; &#1614;&#1593;&#1614;&#1604;&#1614;&#1591;
</p>
<p>&#1615;&#1585;&#1614;&#1605;&#1614;&#1602;&#1604;). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LA TRANSCRIPTION ORTHOGRAPHIQUE-PHONETIQUE DE LA LANGUE ARABE 
</p>
<p>4.4 La conversion graph&#232;me phon&#232;me : 
Cette phase concerne le passage du texte graphique au texte phon&#233;tique (apr&#232;s le traitement 
des exceptions et des r&#232;gles de prononciation) suivant la table de correspondance (figure 2). 
Cette table est constitu&#233;e de 49 enregistrements qui correspondent aux diff&#233;rents caract&#232;res de 
l&#8217;alphabet arabe et des quelques symboles utilis&#233;s. 
</p>
<p>5 Les outils de transcription 
Plusieurs techniques peuvent &#234;tre exploit&#233;es pour faciliter les op&#233;rations d&#233;crites ci-dessus. Il 
est plus simple d&#8217;utiliser une grammaire contextuelle. Elle peut faciliter l&#8217;&#233;criture, puis la 
lecture et la modification, des r&#232;gles avec un contr&#244;le automatique de la syntaxe des r&#232;gles 
utilis&#233;es. Une r&#232;gle, se lit de droite &#224; gauche et doit &#234;tre formalis&#233;e de la fa&#231;on suivante : 
</p>
<p>[Phon&#232;me] = {CG(contexte gauche)} + {C(caract&#232;re)} + {CD(contexte droit)} 
# est un signe de d&#233;but de phrase, $ est un signe de fin de phrase, &#167; est une extr&#233;mit&#233; de mot, 
C est une consonne, V est une voyelle, CS est une consonne solaire et CL est une consonne 
lunaire. 
</p>
<p>G&#233;n&#233;ralement, les r&#232;gles peuvent indiquer des classes de phon&#232;mes ou de graph&#232;mes 
(voyelles, consonnes, fricatives, chiffres...). De m&#234;me, les r&#232;gles sont ordonn&#233;es, la suite de 
leur application est importante. 
</p>
<p>5.1 Pr&#233;sentation d&#8217;un &#233;chantillon de r&#232;gles 
En ce qui suit la description de quelques r&#232;gles parmi les 133 &#233;labor&#233;es et incorpor&#233;es dans la 
base des r&#232;gles :  
</p>
<p>&#8226; [uu]={CS}+{ &#1608;{+}&#1615; } [uu]={CL}+{ &#1608;{+}&#1615; }  [uu]= &#167;+{ &#1608;{+}&#1615; } [uu]= $+{ &#1608;{+}&#1615; } 
Lorsque le&#1608; est pr&#233;c&#233;d&#233; par la voyelle &#1615;  et qu&#8217;il est suivi par une consonne, on obtient le 
phon&#232;me de la voyelle longue [uu]. Lorsque le&#1608; est pr&#233;c&#233;d&#233; par la voyelle &#1615; et qu&#8217;il est en fin 
de mot, on obtient le phon&#232;me de la voyelle longue [uu]. 
</p>
<p>Exemple : &#1575;&#1608;&#1615;&#1587;&#1614;&#1576;&#1614;&#1604;     &#1614;&#1606;&#1608;&#1615;&#1583; 
</p>
<p>&#8226; [aa]={ &#1575;&#1600;{+}&#1614; } 
Lorsque le&#1575;&#1600; est pr&#233;c&#233;d&#233; par la voyelle  &#1614; , on obtient le phon&#232;me de la voyelle longue [aa] 
quelque soit ce qui suit. 
</p>
<p>Exemple : &#1575;&#1614;&#1605;&#1616;&#1604; 
</p>
<p>&#8226; [ii]={CL}+{ &#1610;{+}&#1616; } [ii]={CS}+{ &#1610;{+}&#1616; } [ii]=&#167;+{ &#1610;{+}&#1616; } [ii]=$+{ &#1610;{+}&#1616; } 
Lorsque le&#1610; est pr&#233;c&#233;d&#233; par la voyelle  &#1616;  et qu&#8217;il est suivi par une consonne, on obtient le 
phon&#232;me de la voyelle longue [ii]. Lorsque le&#1610; est pr&#233;c&#233;d&#233; par la voyelle &#1616; et qu&#8217;il est en fin de 
mot, on obtient le phon&#232;me de la voyelle longue [ii]. 
</p>
<p>Exemple : &#1610;&#1616;&#1606;&#1614;&#1587;&#1614;&#1605;&#1614;&#1604;   &#1611;&#1604;&#1575;&#1610;&#1616;&#1604;&#1614;&#1602; 
</p>
<p>&#8226; [CC]={}&#1617;+{C} 
Lorsqu&#8217;une consonne est suivie par la  &#1617; , elle est doubl&#233;e, on obtient alors le phon&#232;me [CC]. 
Exemple : &#1614;&#1617;&#1583;&#1614;&#1608; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tahar SAIDANE , Mounir ZRIGUI et Mohamed BEN AHMED 
</p>
<p>&#8226; [C]={}&#1618;+{C} 
Lorsqu&#8217;une consonne est suivie par  &#1618;, elle reste inchang&#233;e, on obtient alors le phon&#232;me [C]. 
Exemple : &#1615;&#1576;&#1614;&#1594;&#1618;&#1585;&#1614;&#1610;  
</p>
<p>&#8226; {CS}+{&#1571;}={CS}+{&#1600;&#1604;&#1575;}+#  {CL}+{&#1600;&#1604;}+{CL}={CL}+{&#1600;&#1604;&#1575; }+{CL} 
Lorsque le &#1600;&#1604;&#1575; est en d&#233;but de phrase et qu&#8217;il est suivi par une consonne solaire, il est 
&#233;quivalent &#224; la non pr&#233;sence du &#1600;&#1604; . Lorsque le &#1600;&#1604;&#1575; est entre deux consonnes lunaires, il est 
&#233;quivalent &#224; la non pr&#233;sence du &#1571; . 
</p>
<p>Exemple : &#1615;&#1604;&#1618;&#1570;&#1614;&#1604;&#1571;&#1575; &#1614;&#1593;&#1616;&#1606;&#1615;&#1605;      &#1615;&#1593;&#1610;&#1616;&#1605;&#1614;&#1587;&#1604;&#1575;  
</p>
<p>5.2 V&#233;rification 
Les proc&#233;dures de v&#233;rification sont certainement aussi importantes que le syst&#232;me lui-m&#234;me 
car elles permettent de l&#8217;am&#233;liorer en pr&#233;cisant le r&#244;le et l&#8217;importance de chacune des r&#232;gles 
et en mettant en &#233;vidence les disfonctionnements. Les phrases trait&#233;es et archiv&#233;es dans la 
base de donn&#233;es permettent de faire cette &#233;valuation. 
</p>
<p>6 CONCLUSION 
Nous avons pr&#233;sent&#233; dans ce document les outils n&#233;cessaires ainsi que les m&#233;thodes utilis&#233;es 
lors de l&#8217;&#233;laboration des modules de pr&#233;traitement et de traitement phonologique, tous deux 
op&#233;rationnels. La base de donn&#233;es des r&#232;gles de transcription ne cesse de s&#8217;enrichir en vue 
d&#8217;un meilleur r&#233;sultat. 
</p>
<p>N&#233;anmoins, l&#8217;aboutissement au syst&#232;me escompt&#233; reste long et devra passer par un nombre 
important de tests, par l&#8217;approfondissement des outils de programmation sur puces ainsi que 
par la r&#233;solution des probl&#232;mes de taille de m&#233;moire g&#233;n&#233;ralement de mise pour de tels 
syst&#232;mes. 
</p>
<p>R&#233;f&#233;rences 
Ghazali S., Habaili H., Zrigui M. (1990). Correspondance graph&#232;me-phon&#232;me pour la 
synth&#232;se de la parole arabe &#224; partir du texte, IRSIT. Congr&#232;s dialogue homme machine Tunis. 
</p>
<p>Guerti M. (1983). Contribution &#224; la synth&#232;se de la parole par diphones en arabe standard, 
Institut de Linguistique et de Phon&#233;tique. Alger. 
</p>
<p>Lemmety S. (2000). Review of speech synthesis technology, Helsinki University of 
Technology. Th&#232;se. 
</p>
<p>Moudenc T., Emerard F. (2003). Synth&#232;se vocale et handicap, Annales de 
t&#233;l&#233;communications. pp 928-934. 
</p>
<p>Moulines E., Cappe O. (1996). Synth&#232;se de la parole &#224; partir du texte, Techniques de 
l&#8217;ing&#233;nieur.H1960 pp 7. 
</p>
<p>Zrigui M., Ghazali S., Ben miled Z., Jemni M. (1990). Synth&#232;se de l'Arabe standard &#224; partir 
du texte par TD PSOLA, 18&#232;me journ&#233;e d&#8217;&#233;tude sur la parole. Belgique. 
</p>
<p>Zrigui M., Mili A, Jemni M. (1991). Vers un syst&#232;me automatique de synth&#232;se de la parole 
arabe, Maghrebin symposium on programming and system, Alger. pp 180-197. </p>

</div></div>
</body></html>