<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;veloppement d&#8217;un syst&#232;me de R&#233;sum&#233; automatique de Textes Juridiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>D&#233;veloppement d&#8217;un syst&#232;me de R&#233;sum&#233; automatique
de Textes Juridiques
</p>
<p>Atefeh Farzindar
Laboratoire RALI
</p>
<p>D&#233;partement d&#8217;Informatique et recherche op&#233;rationnelle
Universit&#233; de Montr&#233;al, C.P. 6128, succursale Centre-ville
</p>
<p>Montr&#233;al, Qu&#233;bec, Canada, H3C 3J7
farzinda@iro.umontreal.ca
</p>
<p>R&#233;sum&#233;- Abstract
</p>
<p>Nous d&#233;crivons notre m&#233;thode de production automatique du r&#233;sum&#233; de textes juridiques. C&#8217;est
une nouvelle application du r&#233;sum&#233; qui permet aux juristes de consulter rapidement les id&#233;es
cl&#233;s d&#8217;une d&#233;cision juridique pour trouver les jurisprudences pertinentes &#224; leurs besoins. Notre
approche est bas&#233;e sur l&#8217;exploitation de l&#8217;architecture des documents et les structures th&#233;ma-
tiques, afin de constituer automatiquement des fiches de r&#233;sum&#233; qui augmentent la coh&#233;rence
et la lisibilit&#233; du r&#233;sum&#233;. Dans cet article nous d&#233;taillons les conceptions des diff&#233;rentes com-
posantes du syst&#232;me, appel&#233; LetSum et le r&#233;sultat d&#8217;&#233;valuation.
</p>
<p>We describe our method for dealing with automatic summarization techniques in the legal do-
main. This new application of summary helps a legal expert determine the key ideas of a judge-
ment. Our approach is based on the exploration of the document&#8217;s architecture and its thematic
structures, in order to build a table style summary, which improves coherency and readability in
the summary. We present the components of a system, called LetSum, built with this approach
and some preliminary results of the evaluation.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>R&#233;sum&#233; automatique, fiches de r&#233;sum&#233;, segmentation th&#233;matique, textes juridiques
Automatic text summarization, summary table, topic segmentation, legals texts
</p>
<p>1 Introduction
</p>
<p>Le but d&#8217;un syst&#232;me de r&#233;sum&#233; automatique est de produire une repr&#233;sentation condens&#233;e du
contenu de son entr&#233;e, o&#249; les informations importantes du texte original sont pr&#233;serv&#233;es, il faut
aussi consid&#233;rer les besoins de l&#8217;utilisateur et de la t&#226;che sp&#233;cifi&#233;e (Minel et al., 2001). Nos
&#233;tudes portent sur une nouvelle application de r&#233;sum&#233; automatique et une forme particuli&#232;re de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Atefeh Farzindar
</p>
<p>documents de type juridique: les d&#233;cisions des cours judiciaires du Canada. L&#8217;objectif de ce
projet est de cr&#233;er automatiquement des r&#233;sum&#233;s courts, qui r&#233;pond aux besoins des avocats, des
juges et des experts du domaine. On s&#8217;int&#233;resse au traitement des d&#233;cisions juridiques pass&#233;es
parce qu&#8217;une d&#233;cision judiciaire apporte g&#233;n&#233;ralement une solution &#224; un probl&#232;me juridique
entre deux ou plusieurs parties. Elle tient lieu de loi entre les parties. La d&#233;cision comporte
aussi des motifs qui justifient la solution. Donc les motifs constituent un pr&#233;c&#233;dent puisqu&#8217;il
est possible d&#8217;en extraire une r&#232;gle de droit pouvant servir &#224; disposer d&#8217;affaires semblables.
Pour une requ&#234;te dans une base de donn&#233;es de pr&#233;c&#233;dents, on va souvent recevoir des centaines
documents tr&#232;s longs &#224; &#233;tudier. Lire tous ces documents, pour trouver les d&#233;cisions pertinentes
pour cette affaire pouvant &#234;tre fastidieux, les experts et les &#233;tudiants de droit sont demandeurs
de r&#233;sum&#233;s de d&#233;cisions judiciaires.
Dans les sections suivantes, nous d&#233;crivons notre m&#233;thode bas&#233; sur l&#8217;identification des struc-
tures th&#233;matiques des jugements afin de produire un r&#233;sum&#233; coh&#233;rent sous forme d&#8217;une fiche de
r&#233;sum&#233; structur&#233;e. Nous pr&#233;sentons les diff&#233;rents modules du syst&#232;me d&#233;velopp&#233;, bas&#233; sur cette
approche ainsi que son implantation et les r&#233;sultats d&#8217;&#233;valuations partielles des fonctionnements
des modules.
</p>
<p>2 Structuration des textes juridiques
</p>
<p>Notre corpus est compos&#233; de 3500 documents de jurisprudences en anglais, rendues par la
Cour f&#233;d&#233;rale du Canada du tribunal de premi&#232;re instance des ann&#233;es 2000 &#224; 2003, qui sont
disponibles en format HTML sur le site http://reports.fja.gc.ca/. Nous avons analys&#233; 50 juge-
ments et leur r&#233;sum&#233;s r&#233;dig&#233;s manuellement par un arr&#234;tiste, un r&#233;sumeur professionnel. Nous
cherchons les relations entre les informations consid&#233;r&#233;es importantes dans les r&#233;sum&#233;s mod-
&#232;les et les informations dans les documents sources. La taille moyenne des jugements comme
entr&#233;e de notre syst&#232;me est des d&#233;cisions qui ont entre 500 et 4000 mots. Pour notre analyse
de corpus, nous avons identifi&#233; des cadres organisationnels pour le jugement. Les paragraphes
qui traitent d&#8217;un sujet sont consid&#233;r&#233;s comme membres d&#8217;un groupe th&#233;matique. Les blocs sont
annot&#233;s avec une &#233;tiquette qui montre leurs r&#244;les th&#233;matiques. Nous avons aussi manuellement
annot&#233; les unit&#233;s de citation. Les citations sont les unit&#233;s textuelles (phrase ou paragraphe)
cit&#233;es par le juge comme r&#233;f&#233;rence (par exemple &#224; un article de loi). Les segments de citation
occupent une taille consid&#233;rable dans le jugement, mais ils ne sont pas consid&#233;r&#233;s importants
dans le r&#233;sum&#233;, donc ces segments seront &#233;limin&#233; lors des filtrages d&#8217;information.
</p>
<p>Les travaux linguistiques de Charolles (Charolles, 2002) d&#233;finissent la notion de cadre de dis-
cours qui identifie les circonstances relatives &#224; un certain &#233;tat ou &#224; une s&#233;rie d&#8217;&#233;v&#233;nements. Les
cadres de discours partitionnent l&#8217;information dans des rubriques homog&#232;nes. Dans ce con-
texte, nous avons cherch&#233; les niveaux de discours qui partitionnent des d&#233;cisions juridiques
en diff&#233;rentes structures discursives malgr&#233; la variabilit&#233; des cat&#233;gories des jugements (Mail-
hot, 1996). L&#8217;identification de ces structures s&#233;pare les id&#233;es cl&#233;s des d&#233;tails secondaires d&#8217;un
jugement et elle am&#233;liore la lisibilit&#233; de r&#233;sum&#233; qui peut produire des textes plus coh&#233;rents. La
table 1 montre la structuration d&#8217;une jurisprudence et ses diff&#233;rents niveaux de discours comme:
Donn&#233;es de la d&#233;cision, Introduction, Contexte, Raisonnement juridique et Conclusion. Ainsi,
dans la pr&#233;sentation du r&#233;sum&#233; final nous proposons de conserver cette organisation des struc-
tures du texte afin de constituer une fiche de r&#233;sum&#233; de d&#233;cisions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;sum&#233; automatique de Textes Juridiques
</p>
<p>Structures th&#233;matiques Explications
Donn&#233;es de la d&#233;cision Num&#233;ro de greffe, R&#233;f&#233;rence neutre, Date du jugement,
</p>
<p>Nom de la cour de d&#233;cision, Identification des parties,
L&#8217;intitul&#233; du jugement.
</p>
<p>Introduction Qui? A fait quoi? &#192; qui?
Contexte Faits recompose l&#8217;histoire du litige;
</p>
<p>Histoire judiciaire
Citation Pr&#233;tention des parties;
</p>
<p>Citation des r&#233;f&#233;rences juridiques
Raisonnement juridique Discussion, analyse du juge et d&#233;termination des faits; Ex-
</p>
<p>pression des motifs de la solution retenue.
Conclusion Dispositif, la d&#233;cision finale de la cour.
</p>
<p>Table 1: Fiche de r&#233;sum&#233; montre des structures th&#233;matiques dans un document de jurispru-
dence
</p>
<p>3 M&#233;thode de la constitution de fiches de r&#233;sum&#233;
</p>
<p>Nous proposons une approche de r&#233;sum&#233; automatique bas&#233;e sur l&#8217;identification des structures
th&#233;matiques et les r&#244;les argumentatifs, en utilisant la technique d&#8217;extraction des unit&#233;s sail-
lantes, avec une pr&#233;sentation du r&#233;sum&#233; final sous forme d&#8217;une fiche contenant des rubriques
homog&#232;nes d&#8217;informations. Cette fiche permet de pr&#233;senter les informations consid&#233;r&#233;es im-
portantes associ&#233;es &#224; des r&#244;les argumentatifs pr&#233;cis, ce qui en facilite la lecture et la navigation
entre le r&#233;sum&#233; et le jugement source. Pour chaque phrase du r&#233;sum&#233; produit, l&#8217;utilisateur peut
en d&#233;terminer le th&#232;me en regardant le r&#244;le argumentatif associ&#233; &#224; son segment th&#233;matique. Si
une phrase semble plus importante pour l&#8217;utilisateur et qu&#8217;il d&#233;sire plus d&#8217;information sur ce
sujet, on peut lui proposer le segment th&#233;matique entier contenant la phrase s&#233;lectionn&#233;e, pour
obtenir les informations compl&#233;mentaires sur le sujet. La constitution de la fiche de r&#233;sum&#233; se
fait en quatre &#233;tapes (figure 1) : segmentation th&#233;matique et les r&#244;les argumentatifs, filtrage des
unit&#233;s moins importantes comme les citations des articles des lois, s&#233;lection des unit&#233;s textuelles
candidates pour le r&#233;sum&#233; et production du r&#233;sum&#233; selon la taille demand&#233;e.
</p>
<p>Pour la t&#226;che de segmentation, nous avons fait quelques exp&#233;rimentations avec deux segmenteurs
d&#233;crits par Hearst (Hearst, 1994) le syst&#232;me TexTiling et le segmenteur C99 d&#233;crit par Choi
(Choi, 2000), les deux sont les segmenteurs statistiques qui impliquent une fonction de clus-
tering sur document, pour trouver des classes divis&#233;es par th&#232;mes. Mais les r&#233;sultats de ces
segmenteurs num&#233;riques n&#8217;&#233;taient pas &#224; un niveau satisfaisant pour trouver les structures th&#233;-
matiques des jugements judiciaires donc nous avons d&#233;cid&#233; de d&#233;velopper un processus de
segmentation th&#233;matique bas&#233; sur les connaissances sp&#233;cifiques du domaine juridique.
L&#8217;implantation de notre approche est un syst&#232;me appel&#233; LetSum, d&#233;velopp&#233; en langage Java
et Perl. L&#8217;entr&#233;e du syst&#232;me est un document de jurisprudence qui peut avoir un des formats
XML, HTML, SGML, RFT ou un texte sans balise. Pour traiter le document, le texte est di-
vis&#233; en paragraphes, phrases et en unit&#233;s plus petites comme mots, nombres et ponctuations.
L&#8217;analyseur syntaxique utilis&#233;, pour d&#233;terminer les cat&#233;gories syntaxiques des mots est le mod-
&#232;le d&#233;crit par Hepple (Hepple, 2000). Les r&#232;gles et les grammaires s&#233;mantiques sont &#233;crits en
langage JAPE (Java Annotations Pattern Engine) qui peuvent &#234;tre ex&#233;cut&#233;s avec le transducer
de GATE (Cunningham et al., 2002). GATE offre la possibilit&#233; d&#8217;extraction de certaines entit&#233;s</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Atefeh Farzindar
</p>
<p>Segmentation
Th&#233;matique
</p>
<p>S&#233;lection
</p>
<p>Production
</p>
<p>Identification de
l'organisation du
</p>
<p>jugement
</p>
<p>Rep&#233;rage
d'unit&#233;s saillantes
</p>
<p>S&#233;lection des
unit&#233;s textuelles
</p>
<p>Fusion des
parties extraites
</p>
<p>&#201;limination des
&#233;l&#233;ments moins
</p>
<p>importants
</p>
<p>Fiche de
R&#233;sum&#233;
</p>
<p>Filtrage
R&#233;duction du
</p>
<p>&quot;bruit&quot; 
</p>
<p>Texte de
jurisprudence
</p>
<p>Elimination de
Citation
</p>
<p>D&#233;termination
des r&#244;les
</p>
<p>s&#233;mantiques
</p>
<p>Figure 1: Les &#233;tapes de la constitution de la fiche de r&#233;sum&#233;
</p>
<p>nomm&#233;es (comme noms des personnes, dates, lieux, etc.) et des cor&#233;f&#233;rences.
Segmentation th&#233;matique: cette &#233;tape d&#233;termine l&#8217;organisation du document original et en-
cadre les blocs du texte associ&#233;s avec un r&#244;le argumentatif pr&#233;cis dans la jurisprudence. Notre
segmenteur th&#233;matique est fond&#233; sur les connaissances s&#233;mantiques du jugement. Afin de s&#233;-
parer un segment th&#233;matique et de d&#233;tecter son r&#244;le s&#233;mantique nous avons utilis&#233; des conditions
telles que la pr&#233;sence des titres des sections, les positions (absolue et relative) d&#8217;un segment,
l&#8217;identification des styles direct et indirect et la pr&#233;sence des marqueurs linguistiques.
</p>
<p>Filtrage: cette &#233;tape identifie les exemples n&#233;gatifs qui peuvent &#234;tre supprim&#233;s dans les docu-
ments, sans perdre les informations pertinentes pour le r&#233;sum&#233;. Dans un jugement, les citations
occupent un volume important dans le texte soit 30% du jugement, alors que leur contenu est
moins important pour le r&#233;sum&#233;, donc nous les consid&#233;rons comme des exemples n&#233;gatifs. Pour
cette raison, &#224; l&#8217;int&#233;rieur des blocs de segments th&#233;matiques nous identifions les citations &#224; sup-
primer. Les citations comprennent deux cat&#233;gories: la premi&#232;re, les pr&#233;tentions et arguments
des parties, concernent les points de vues des parties sur le litige; la seconde, les pr&#233;tentions en
droit concernent les citations des articles de lois applicables sur l&#8217;affaire. L&#8217;identification de ci-
tation est bas&#233;e sur deux types de marqueurs : directs et indirects (Mourad &amp; Descl&#233;s, 2003). La
premi&#232;re cat&#233;gorie de marqueur direct contient les indicateurs linguistiques. Les exemples de
marqueurs linguistiques identifi&#233;s en trois classes ; les verbes de citation comme conclude, de-
fine, indicate, provide, read, reference, refer, say, state, summarize, les concepts (nom, adverbe,
adjectif) comme following, section, subsection, page, paragraph, pursuant et les indices com-
pl&#233;mentaires comme les nombres, les pr&#233;position, les subordonn&#233;s relatives et les marqueurs
typographique comme deux-points et guillemet. La deuxi&#232;me cat&#233;gorie comprend les mar-
queurs de citation indirects. Les unit&#233;s textuelles cit&#233;es indirectement sont les unit&#233;s voisines
des phrases cit&#233;es directement. Nous avons donc int&#233;gr&#233; un m&#233;canisme d&#8217;identification des in-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;sum&#233; automatique de Textes Juridiques
</p>
<p>t&#233;grations lin&#233;aires entre les phrases suivantes de la premi&#232;re phrase cit&#233;e avec les marqueurs
directs.
</p>
<p>S&#233;lection des unit&#233;s saillantes: cette &#233;tape construit une liste d&#8217;unit&#233;s saillantes candidates
pour chaque niveau structural du r&#233;sum&#233;. LetSum calcule un poids pour chaque phrase dans le
jugement d&#8217;apr&#232;s les fonctions heuristiques bas&#233;es sur les informations suivantes : la position
des paragraphes dans le document, la position des phrases dans le paragraphe, les marqueurs
linguistiques, les cue-phrases, les vocabulaires contr&#244;l&#233;s du domaine juridique et les fr&#233;quances
des mots dans le texte et le corpus (tf &#8727; idf ).
Production de la fiche de r&#233;sum&#233;: Une fois s&#233;lectionn&#233;es les unit&#233;s candidates potentielles
pour le r&#233;sum&#233;, cette &#233;tape choisit les unit&#233;s pour le r&#233;sum&#233; final et les combine afin de pro-
duire un r&#233;sum&#233; d&#8217;environ 10% du jugement. Le crit&#232;re de s&#233;lection des unit&#233;s est bas&#233; sur
la pond&#233;ration du segment th&#233;matique contenant les unit&#233;s candidates. Selon nos analyses de
corpus, nous avons constat&#233; que la distribution de l&#8217;information dans les r&#233;sum&#233;s des arr&#234;tistes
donne la possibilit&#233; de mesurer de l&#8217;importance des segments th&#233;matiques. Lors de cette &#233;tape
de s&#233;lection de la liste des unit&#233;s candidates, nous choisissons les unit&#233;s du segment th&#233;matique
Introduction avec les scores plus &#233;lev&#233;s jusqu&#8217;&#224; concurrence de 10% de la taille de r&#233;sum&#233;.
Dans le segment Contexte, les unit&#233;s s&#233;lectionn&#233;es occupent 24% de la longueur du r&#233;sum&#233;. La
contribution du segment Raisonnement est 60% et les unit&#233;s avec le r&#244;le Conclusion occupent
6% du r&#233;sum&#233;.
</p>
<p>4 Travaux connexes
</p>
<p>LetSum est un des premiers syst&#232;mes &#224; traiter sp&#233;cifiquement du probl&#232;me des r&#233;sum&#233;s de textes
de jurisprudences. Toutefois il y a d&#233;j&#224; eu des travaux similaires dans le domaine juridique afin
de fournir des outils linguistiques permettant d&#8217;aider les avocats et les juristes. FLEXICON
(Smith &amp; Deedman, 1987) a &#233;t&#233; d&#233;velopp&#233; pour la gestion des informations juridiques et la
production du r&#233;sum&#233; qui combine le traitement du texte avec raisonnement &#224; base de cas.
Cette approche utilise des modules d&#8217;extraction pour identifier les concepts, les cas, les l&#233;g-
islations, les faits et leurs relations dans la d&#233;cision, afin de construire un profil structur&#233; de
document et produire automatiquement un sommaire (headnote). Les concepts sont identifi&#233;s
par unification des mots du texte avec une liste d&#8217;expressions significatives, en appliquant des
r&#232;gles heuristiques simples. Le projet SALOMON (Uyttendaele et al., 1996) produit le r&#233;-
sum&#233; automatiquement de cas criminels belges (&#233;crits en Hollandais). Le but est d&#8217;identifier et
d&#8217;extraire les informations importantes &#224; partir des jurisprudences. Dans ce projet les connais-
sances linguistiques sont utilis&#233;es. Il extrait les concepts et les unit&#233;s textuelles saillantes gr&#226;ce
&#224; l&#8217;identification des cue words, segments indicateurs et patrons de contexte.
</p>
<p>5 Conclusion
</p>
<p>Alors que nous avons le probl&#232;me de grandes quantit&#233;s de textes juridiques et le besoin de
les pr&#233;senter sous forme d&#8217;un r&#233;sum&#233; court, notre recherche montre qu&#8217;il n&#8217;y pas eu beaucoup
de travail dans ce domaine et que le probl&#232;me du traitement des textes l&#233;gaux reste ouvert.
Dans cet article, nous avons pr&#233;sent&#233; notre m&#233;thode pour produire un r&#233;sum&#233; juridique flexi-
ble et coh&#233;rent. Cette approche est bas&#233;e sur une analyse de corpus des d&#233;cisions de la Cour</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Atefeh Farzindar
</p>
<p>f&#233;d&#233;rale du Canada, en anglais. Nous proposons une nouvelle forme de pr&#233;sentation du r&#233;-
sum&#233; &#224; l&#8217;utilisateur sous forme d&#8217;une fiche de r&#233;sum&#233; qui divise le r&#233;sum&#233; en diff&#233;rents th&#232;mes.
Chaque niveau structural de cette fiche est associ&#233; &#224; un r&#244;le argumentatif : donn&#233;es de la d&#233;ci-
sion, introduction, contexte, raisonnement juridique ou conclusion. Le syst&#232;me &#233;tant en cours
de d&#233;veloppement mais les r&#233;sultats pr&#233;liminaires sur le segmetuer (F-mesure = 0.90) et le
module de filtrage (F-mesure = 0.96) sont tr&#232;s encourageants. Nous compl&#233;tons actuellement le
d&#233;veloppement des modules statistiques qui calculent la similarit&#233; d&#8217;une phrase avec les phrases
voisines et la similarit&#233; entre d&#8217;une phrase avec les autres phrases dans le m&#234;me segment th&#233;-
matique.
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224; remercier l&#8217;&#233;quipe LexUM du laboratoire d&#8217;informatique juridique du Centre de
recherche en droit public (CRDP) pour leur collaboration.
Merci &#224; l&#8217;&#233;quipe de Jean-Pierre Descl&#232;s, laboratoire LaLICC de l&#8217;Universit&#233; Paris-Sorbonne.
Ce projet est financi&#232;rement soutenu par le Centre de recherche en droit public du Canada.
</p>
<p>R&#233;f&#233;rences
CHAROLLES M. (2002). Organisation des discours et segmentation des &#233;crit. In Inscription Spatiale du
Langage: structures et processus, IRIT, Toulouse, France.
CHOI F. (2000). Advances in domain independent linear text segmentation. In Proceding of the 1 st
North American Chapter of the Association for Computational Linguistics, p. 26&#8211;33, Seattle, Washing-
ton.
</p>
<p>CUNNINGHAM H., MAYNARD D., BONTCHEVA K. &amp; TABLAN V. (2002). Gate: A framework and
graphical development environment for robust nlp tools and applications. In Proceedings of the 40th
Anniversary Meeting of the Association for Computational Linguistics (ACL&#8217;02), Philadelphia.
HEARST M. A. (1994). Multi-paragraph segmentation of expository text. In the 32nd Meeting of the
Association for Computational Linguistics, Los Cruces, NM.
HEPPLE M. (2000). Independence and commitment: Assumptions for rapid training and execution of
rule-based part-of-speech taggers. In the 38th Annual Meeting of the Association for Computational
Linguistics (ACL-2000), p. 278&#8211;285.
MAILHOT L. (1996). Ecrire la d&#233;cision: guide pratique de r&#233;daction judiciaire. Qu&#233;bec, Canada:
Editions Yvon Blais.
MINEL J.-L., DESCL&#201;S J.-P., CARTIER E., CRISPINO G., BEN HAZEZ S. &amp; JACKIEWICZ A. (2001).
R&#233;sum&#233; automatique par filtrage s&#233;mantique d&#8217;informations dans des textes. Revue Technique et Science
Informatiques, (3).
MOURAD G. &amp; DESCL&#201;S J.-P. (2003). Identification et extraction automatique des informations cita-
tionnelles dans un texte. In Ci-Dit, Colloque international et interdisciplinaire, Bruxelles.
SMITH J. C. &amp; DEEDMAN C. (1987). The application of expert systems technology to case-based law.
ICAIL, p. 84&#8211;93.
UYTTENDAELE C., MOENS M.-F. &amp; DUMORTIER J. (1996). Salomon: Abstracting of legal cases for
effective access to court decisions. In Proceedings of JURIX 96 Ninth International Conference on Legal
Knowledge Based Systems, p. 47&#8211;58: Tilburg: University Press.</p>

</div></div>
</body></html>