<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Automates lexicaux avec structure de traits</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>Automates lexicaux avec structure de traits
</p>
<p>Olivier Blanc (1), Anne Dister (2)
</p>
<p>(1) Institut Gaspard-Monge &#8211; Universit&#233; de Marne-la-Vall&#233;e
5, Bd Descartes, F- 77420 Champs-sur-Marne (France)
</p>
<p>olivier.blanc@univ-mlv.fr
(2) Cental et Centre de recherche Valibel &#8211; Universit&#233; de Louvain
</p>
<p>Coll&#232;ge &#201;rasme, Place Blaise Pascal, B- 1348 Louvain-la-Neuve (Belgique)
dister@tedm.ucl.ac.be
</p>
<p>R&#233;sum&#233; &#8211; Abstract
Nous pr&#233;sentons les automates lexicaux avec structure de traits, une extension du mod&#232;le des
automates finis sur le mots dans lesquels les transitions sont &#233;tiquet&#233;es par des motifs qui
s&#233;lectionnent un sous-ensemble des mots &#233;tiquet&#233;s en fonction de leurs traits positionn&#233;s.
Nous montrons l&#8217;ad&#233;quation de ce mod&#232;le avec les ressources linguistiques dont nous
disposons et nous exposons les grandes lignes de nos m&#233;thodes pour effectuer des op&#233;rations
telles que la d&#233;terminisation, l&#8217;intersection ou la compl&#233;mentation sur ces objets. Nous
terminons en pr&#233;sentant une application concr&#232;te de ces m&#233;thodes pour la lev&#233;e d&#8217;ambigu&#239;t&#233;s
lexicales par intersection d&#8217;automates &#224; l&#8217;aide de contraintes locales.
We present an extension to finite automata on words in which transitions are labeled with
lexical masks describing a subset of their alphabet. We first show the connection between this
model and our linguitic data and we present our implementation of classical automata
operations on these objects. Then we show a concrete application of our methods to lexical
disambiguation making use of grammatical constraints described in local grammars.
</p>
<p>Mots-clefs &#8211; Keywords
automates finis, grammaire locale, dictionnaire &#233;lectronique, lev&#233;e d&#8217;ambigu&#239;t&#233;s, lexique-
grammaire
finite state automata, local grammar, electronic dictionnary, disambiguation, lexicon-grammar
</p>
<p>1 Introduction
Les automates et transducteurs finis ont prouv&#233; leur utilit&#233; dans une large vari&#233;t&#233;
d&#8217;applications en informatique linguistique. Ils fournissent par exemple une repr&#233;sentation
compacte des dictionnaires &#233;lectroniques (Revuz, 1991) et sont &#224; la base d&#8217;algorithmes
efficaces &#224; toutes les &#233;tapes du traitement des langues naturelles, de l&#8217;analyse phonologique et
la reconnaissance de la parole (Mohri, 1997) jusqu&#8217;&#224; l&#8217;analyse syntaxique de texte (Roche et
Schabes, 1997).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Blanc et Anne Dister
</p>
<p>Cet &#233;tat de fait a d&#8217;ailleurs donn&#233; lieu &#224; la cr&#233;ation de nombreuses applications linguistiques,
dont la plupart des traitements automatiques sont fond&#233;s sur des technologies &#224; &#233;tats finis.
Nous pouvons citer, pour exemple, les logiciels INTEX (Silberztein, 1993) et Unitex
(Paumier, 2003), et les biblioth&#232;ques de manipulation d&#8217;expressions r&#233;guli&#232;res et d&#8217;automates
finis de Xerox (Karttunen et al., 1997) et AT&amp;T (Mohri et al., 2000)). Les corpus de texte
sont repr&#233;sent&#233;s par des automates, ou treillis de mots, dans lesquels chaque chemin
correspond &#224; une analyse lexicale ; les grammaires locales (Nakamura, 2003), qui sont un
moyen naturel de repr&#233;senter des ph&#233;nom&#232;nes linguistiques complexes, sont traduites en
automates finis afin d&#8217;&#234;tre ais&#233;ment confront&#233;es avec les corpus de texte.
Dans cet article, nous pr&#233;sentons les automates lexicaux avec structures de traits, une
extension du mod&#232;le des automates finis adapt&#233;e pour le traitement des textes en langues
naturelles. Il s&#8217;agit d&#8217;automates sur les mots dans lesquels les transitions peuvent &#234;tre
&#233;tiquet&#233;es par des masques lexicaux, c&#8217;est-&#224;-dire des motifs qui s&#233;lectionnent un ensemble
des mots &#233;tiquet&#233;s selon certains traits sp&#233;cifi&#233;s. Nous pr&#233;sentons dans un premier temps
l&#8217;ad&#233;quation du mod&#232;le avec les ressources linguistiques dont nous disposons, puis nous
montrons comment une description formelle du jeu d&#8217;&#233;tiquettes et des structures des traits
contenus dans les dictionnaires permettent d&#8217;obtenir une repr&#233;sentation structur&#233;e des
masques lexicaux et ainsi de d&#233;finir des op&#233;rations ensemblistes sur ces objets. Nous
exposons comment nous sommes parvenus ainsi &#224; impl&#233;menter diverses op&#233;rations sur les
automates lexicaux, telles que la d&#233;terminisation, l&#8217;intersection et la compl&#233;mentation. Nous
terminons en pr&#233;sentant une application concr&#232;te de ces m&#233;thodes pour la lev&#233;e d&#8217;ambigu&#239;t&#233;s
lexicales par intersection d&#8217;automates &#224; l&#8217;aide de contraintes morpho-syntaxiques d&#233;crites
dans des grammaires locales.
</p>
<p>2 Cadre th&#233;orique et ressources linguistiques
</p>
<p>2.1 Les ressources lexicales
</p>
<p>Le cadre th&#233;orique dans lequel s&#8217;inscrivent nos recherches est celui du lexique-grammaire. Ce
mod&#232;le, con&#231;u par Maurice Gross dans les ann&#233;es 1960, recense les structures syntaxiques
&#233;l&#233;mentaires de la langue. Ces structures sont formalis&#233;es dans des tables de propri&#233;t&#233;s
(Gross, 1975), qui contiennent plusieurs dizaines milliers d&#8217;entr&#233;es pour le fran&#231;ais.
Actuellement, le lexique-grammaire a &#233;t&#233; construit partiellement pour les verbes, les noms,
les adjectifs, les adverbes et les expressions fig&#233;es de plusieurs langues (Lamiroy, 1999).
En application de ces travaux est n&#233;e parall&#232;lement une vaste entreprise de cr&#233;ation de
dictionnaires &#233;lectroniques. Ces dictionnaires peuvent comporter les informations du lexique-
grammaire lorsque celles-ci sont disponibles.
Le syst&#232;me DELA de dictionnaires &#233;lectroniques pour le fran&#231;ais (dictionnaires de lemmes et
dictionnaires de formes fl&#233;chies) a &#233;t&#233; construit manuellement et d&#233;crit dans B. Courtois et M.
Silberztein (1990). Les dictionnaires du fran&#231;ais contiennent actuellement 680 000 entr&#233;es
pour les mots simples et 270 000 entr&#233;es pour les mots compos&#233;s1.
L&#8217;entr&#233;e suivante du dictionnaire  :
                                                 
1 D&#8217;autres dictionnaires pour le fran&#231;ais ont &#233;t&#233; construits selon le m&#234;me formalisme&#160;: un dictionnaire des formes
</p>
<p>concern&#233;es par les rectifications orthographiques de 1990 (pr&#232;s de 9000 entr&#233;es), un dictionnaire du fran&#231;ais
en Belgique (5400 entr&#233;es) ou encore un dictionnaire du fran&#231;ais qu&#233;b&#233;cois (Labelle, 1994). Des
dictionnaires existent &#233;galement pour les langues suivantes&#160;: anglais, grec, italien, norv&#233;gien, portugais,
russe,  espagnol  et  tha&#239; .  Pour plus de d&#233;tai ls ,  voir &#160; :  ht tp: / /www-igm.univ-
mlv.fr/~unitex/linguistic_data.html#lex-gram</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Automates lexicaux avec structure de traits
</p>
<p>3/10
</p>
<p>donneraient,donner.V+t:F3p
est &#224; lire : forme = donneraient ; lemme = donner ; cat&#233;gorie grammaticale = verbe (V) ; trait
syntaxique = transitif (t) ; temps et mode : futur (F) ; personne = 3e ; nombre = pluriel (p).
Dans ces dictionnaires, les informations sont pr&#233;sent&#233;es dans un ordre d&#233;termin&#233; et d&#233;limit&#233;es
par des symboles sp&#233;cifiques (, . + :), ce qui constitue une forme compacte et lisible,
&#233;quivalente &#224; celle ci-dessus.
Les dictionnaires sont distribu&#233;s avec le logiciel de traitement de corpus Unitex, d&#233;velopp&#233; &#224;
l&#8217;universit&#233; de Marne-la-Vall&#233;e par S&#233;bastien Paumier2.
</p>
<p>2.2 Grammaire locale
</p>
<p>Une grammaire locale (Gross, 1997) est une repr&#233;sentation par automate de structures
linguistiques plus complexes que les pr&#233;c&#233;dentes, difficilement formalisables dans des tables
de lexique-grammaire ou dans des dictionnaires &#233;lectroniques. Visuellement repr&#233;sent&#233;es sous
formes de graphes, les grammaires locales sont utilis&#233;es pour d&#233;crire des &#233;l&#233;ments qui
rel&#232;vent d&#8217;un m&#234;me domaine syntaxique (Fairon, 2000) ou s&#233;mantique (Constant, 2000).
Les descriptions linguistiques d&#233;crites sous la forme de grammaires locales sont utilis&#233;es pour
une grande vari&#233;t&#233; de traitements automatiques appliqu&#233;s sur les corpus de texte. Ainsi,
diff&#233;rentes m&#233;thodes de d&#233;sambigu&#239;sation lexicale ont &#233;t&#233; d&#233;velopp&#233;es qui mettent en &#339;uvre
des contraintes grammaticales d&#233;crites &#224; l&#8217;aide de ce type de graphes (Silberztein, 1993 ;
Dister, 1999 ; Roche, 1992 ; Laporte, 1994 ; Laporte et Monceau, 1999). Par ailleurs,
l&#8217;utilisation de graphes param&#233;tr&#233;s en combinaison avec les tables du lexique-grammaire
permet d&#8217;effectuer une analyse syntaxique pour les phrases simples (Paumier, 2001).
</p>
<p>2.3 Les masques lexicaux
</p>
<p>Les donn&#233;es sur les mots utilis&#233;es dans les grammaires se r&#233;f&#232;rent aux informations pr&#233;sentes
dans les dictionnaires &#233;lectroniques. Mais ces donn&#233;es ne correspondent pas n&#233;cessairement
aux entr&#233;es lexicales compl&#232;tes. En effet, il est possible de n&#8217;utiliser dans la description
qu&#8217;une partie des informations pr&#233;sentes dans les entr&#233;es lexicales. On parle alors de masque
lexical. Les masques lexicaux peuvent ainsi sp&#233;cifier :
</p>
<p>- une cat&#233;gorie grammaticale : &lt;CAT&gt;
&lt;V&gt; pour l&#8217;ensemble de la classe des verbes
- une cat&#233;gorie grammaticale et une sous-cat&#233;gorie : &lt;CAT+sous-cat&gt;
&lt;PRO+PpvIL&gt; pour les pronoms pr&#233;verbaux sujets du fran&#231;ais
- une cat&#233;gorie grammaticale et des informations flexionnelles : &lt;CAT : flexion&gt;
&lt;V:3p&gt; pour les verbes conjugu&#233;s &#224; la 3e personne du pluriel
- un lemme : &lt;lemme&gt;
&lt;manger&gt; pour toutes les formes dont le lemme est le verbe manger
- une forme fl&#233;chie : forme
avocat pour la forme avocat (mais non les formes avocats, avocate et avocates)
- une cat&#233;gorie &#224; l&#8217;exception de certains de ses lemmes : &lt;!lemme1!lemme2.CAT&gt; :
Le masque &lt;!homme!femme.N+Hum&gt; reconna&#238;t tous les noms de la sous-cat&#233;gorie des noms
humain, except&#233; les formes ayant homme ou femme pour lemme : sont ainsi reconnus fille,
scaphandriers, metteur en sc&#232;ne, mais pas femmes, ni r&#233;verb&#232;re.
</p>
<p>                                                 
2 Pour plus d&#8217;informations, voir (http://www-igm.univ-mlv.fr/~unitex/).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Blanc et Anne Dister
</p>
<p>&#192; la diff&#233;rence de certains syst&#232;mes qui utilisent des &#233;tiquettes atomiques (voir van Halteren,
1999; Marcus et al., 1993), nos &#233;tiquettes sont des &#233;tiquettes structur&#233;es.
</p>
<p>3 Description du lexique et manipulation des automates lexicaux
Comme nous l&#8217;avons &#233;voqu&#233; pr&#233;c&#233;demment, les descriptions linguistiques repr&#233;sent&#233;es par
des grammaires locales sont &#224; la base de nombreux traitements automatiques sur les textes.
Toutes ces applications utilisent une repr&#233;sentation interne de ces objets sous la forme
d&#8217;automates finis sur les mots (ou automates lexicaux) afin de les confronter avec les corpus
&#233;tiquet&#233;s (sous une forme lin&#233;aire ou de treillis de mots). Ces automates sont particuliers. Ils
se distinguent notamment par la taille et la composition de leur alphabet d&#8217;entr&#233;e : nos
dictionnaires recensent pr&#232;s d&#8217;un million d&#8217;entr&#233;es &#233;tiquet&#233;es pour les mots simples et
compos&#233;s du fran&#231;ais, auxquelles s&#8217;ajoute l&#8217;ensemble non quantifiable des mots inconnus qui
doivent n&#233;cessairement &#234;tre consid&#233;r&#233;s pour traiter les corpus de texte sans restriction.
D&#8217;autre part leurs transitions peuvent &#234;tre &#233;tiquet&#233;es par des masques lexicaux, c&#8217;est-&#224;-dire
des motifs d&#233;crivant un ensemble (possiblement non born&#233;) de mots. Le mod&#232;le de calcul que
nous pr&#233;sentons ici est donc bien diff&#233;rent de celui des automates finis traditionnels et peut
par ailleurs &#234;tre consid&#233;r&#233; comme une instance particuli&#232;re du mod&#232;le plus g&#233;n&#233;ral des
automates avec pr&#233;dicats introduit par van Noord et al. (2001).
</p>
<p>Ces caract&#233;ristiques modifient la d&#233;finition de certaines notions fondamentales, notamment
celle du d&#233;terminisme. Rappelons qu&#8217;un automate est d&#233;terministe si, &#233;tant donn&#233; un &#233;tat de
d&#233;part et un &#233;l&#233;ment de l&#8217;alphabet (ici un mot), il a au plus un &#233;tat d&#8217;arriv&#233;e ; l&#8217;utilisation de
ces automates permet souvent d&#8217;obtenir des traitements optimaux puisque leur comportement
est d&#233;termin&#233; de fa&#231;on unique pour toute entr&#233;e. Or, si nous prenons l&#8217;automate lexical de la
figure 1, m&#234;me si pour chaque &#233;tat les &#233;tiquettes de ses transitions sont bien diff&#233;rentes, il ne
peut pas pour autant &#234;tre consid&#233;r&#233; comme d&#233;terministe puisque la lecture de la s&#233;quence
{un,un.DET+Dind:ms} {sacr&#233;,sacr&#233;.A:ms} {joli,joli.A:ms} peut positionner l&#8217;automate dans
l&#8217;&#233;tat 2 ou l&#8217;&#233;tat 3.
</p>
<p>Figure 1: Automate lexical
</p>
<p>Ceci d&#233;coule du fait que des masques lexicaux diff&#233;rents peuvent avoir une intersection non
vide. Cette propri&#233;t&#233; a des cons&#233;quences sur la d&#233;terminisation mais &#233;galement pour la plupart
des algorithmes de manipulation des automates lexicaux, tels que l&#8217;intersection ou la
compl&#233;mentation ; les algorithmes standards ne peuvent pas, ici non plus, &#234;tre utilis&#233;s. Nous
pr&#233;sentons par la suite une m&#233;thode qui nous a permis d&#8217;effectuer toutes ces op&#233;rations.
Celle-ci utilise une repr&#233;sentation structur&#233;e des masques lexicaux, param&#233;tr&#233;e par une
description formelle du jeu d&#8217;&#233;tiquettes des dictionnaires.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Automates lexicaux avec structure de traits
</p>
<p>5/10
</p>
<p>3.1 Int&#233;r&#234;t d&#8217;une description du jeu d&#8217;&#233;tiquettes
</p>
<p>La description du jeu d&#8217;&#233;tiquettes consiste en une formalisation de la structure des traits
contenus dans les dictionnaires ; cette description s&#8217;effectue en deux &#233;tapes. La premi&#232;re
consiste &#224; &#233;tablir une classification de l&#8217;ensemble des traits en les regroupant par attributs. Par
exemple, les codes flexionnels m (pour masculin) et f (pour f&#233;minin) qui indiquent le genre de
l&#8217;entr&#233;e sont regroup&#233;s sous un m&#234;me attribut. Le m&#234;me proc&#233;d&#233; est effectu&#233; pour l&#8217;ensemble
des traits morphologiques, syntaxiques et s&#233;mantiques. Nous compl&#233;tons ensuite cette
description par une &#233;num&#233;ration de toutes les parties du discours de la langue; pour chacune,
nous d&#233;clarons les attributs qui lui sont associ&#233;s et nous explicitons quelles sont les
combinaisons de traits qui permettent d&#8217;obtenir une &#233;tiquette compl&#232;te. Un ensemble de traits
constitue une &#233;tiquette compl&#232;te s&#8217;il existe une entr&#233;e d&#8217;un dictionnaire exactement &#233;tiquet&#233;e
par cet ensemble.
Par exemple, une &#233;tiquette compl&#232;te pour un nom est compos&#233;e, outre le lemme et la
cat&#233;gorie grammaticale, d&#8217;un genre, d&#8217;un nombre et d&#8217;un &#233;ventuel attribut s&#233;mantique :
{guitare,guitare.N+Conc:fs}, {guitaristes,guitariste.N+Hum:mp}, etc.
En revanche, les attributs flexionnels de genre, de nombre, de personne et de temps sont tous
associ&#233;s &#224; la cat&#233;gorie des verbes comme dans {danses,danser.V:P2s} pour le pr&#233;sent
deuxi&#232;me personne du singulier et {dans&#233;es,danser.V:Kfp} pour son participe pass&#233; f&#233;minin
pluriel mais toutes les combinaisons de ces traits ne sont pas compatibles et ne constituent
donc pas des &#233;tiquettes compl&#232;tes.
Deux parties du discours implicites et sans attribut sont automatiquement ajout&#233;es &#224; cette
liste, une pour les mots inconnus et la seconde pour les diff&#233;rents symboles de ponctuation.
De cette mani&#232;re, l&#8217;ensemble des tokens qui composent les corpus de texte entre dans cette
description homog&#232;ne.
Nous obtenons, gr&#226;ce &#224; ces informations, une repr&#233;sentation plus structur&#233;e des &#233;tiquettes
lexicales dans laquelle chaque mot, selon sa partie du discours, admet un ensemble d&#8217;attributs
qui peuvent prendre une valeur parmi des codes bien d&#233;finis. Nous rapprochons ainsi notre
description de travaux r&#233;cents sur la repr&#233;sentation des ressources linguistiques (EAGLES,
1996 ; Outilex, 2002 ; RNIL, 2002) qui int&#232;grent directement la notion d&#8217;attribut et de
structures de traits dans leur mod&#232;le. Pour la premi&#232;re fois, un tel mod&#232;le est appliqu&#233; sans
restriction avec un dictionnaire &#224; tr&#232;s large couverture pour des op&#233;rations sur du texte.
Dans ce cadre, nous pouvons repr&#233;senter simplement un masque lexical par une structure de
donn&#233;es &#224; plusieurs champs identifiant ses &#233;ventuelles formes fl&#233;chie et canonique, sa partie
du discours et les traits qui lui sont attribu&#233;s ; ces traits sont stock&#233;s dans un tableau
d&#8217;attributs dont la taille et l&#8217;interpr&#233;tation de ses &#233;l&#233;ments sont d&#233;finies dans notre description
en fonction de la partie du discours. Ainsi, &#224; un masque lexical sur la cat&#233;gorie des noms est
associ&#233; un tableau de trois attributs caract&#233;risant son genre, son nombre et sa sous-cat&#233;gorie
s&#233;mantique. Chaque attribut peut prendre une valeur parmi celles qui sont d&#233;finies dans la
description, plus deux valeurs sp&#233;ciales : une pour signifier que l&#8217;attribut n&#8217;est pas sp&#233;cifi&#233;,
l&#8217;autre qui indique que l&#8217;attribut est bloqu&#233; et ne peut pas &#234;tre positionn&#233;.
Le calcul de l&#8217;intersection de deux masques lexicaux s&#8217;effectue alors tr&#232;s simplement.
L&#8217;op&#233;ration consiste &#224; calculer le masque lexical qui combine les informations sp&#233;cifi&#233;es dans
les deux masques si elles sont compatibles ; dans le cas contraire, l&#8217;ensemble vide est
retourn&#233;.
Ce calcul s&#8217;apparente ainsi &#224; l&#8217;op&#233;ration d&#8217;unification qui est &#224; la base de nombreux
formalismes linguistiques (tels HPSG (Pollard, 1997)).
</p>
<p>(1) &lt;!noir.A&gt; inter &lt;!rouge.A:ms&gt; = &lt;!rouge!noir.A:ms&gt;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Blanc et Anne Dister
</p>
<p>(2) &lt;!noir.A:f&gt; inter &lt;rouge.A:s&gt; = &lt;rouge.Afs&gt;
(3) &lt;N:m&gt; inter &lt;N:f&gt; = 0
(4) &lt;V:P&gt; inter &lt;V:1s&gt; = &lt;V:P1s&gt;
(5) &lt;V:P&gt; inter &lt;V:m&gt; = 0
</p>
<p>De m&#234;me, une simple combinaison d&#8217;op&#233;rations sur les formes et les attributs permet
d&#8217;effectuer le calcul de la compl&#233;mentation d&#8217;un masque par rapport &#224; un autre. Le r&#233;sultat de
cette op&#233;ration, repr&#233;sentant l&#8217;ensemble des mots d&#233;crits par le premier masque et non d&#233;crits
par le second, est alors une union disjointe de masques lexicaux.
</p>
<p>(1) &lt;!noir.N&gt; \ &lt;rouge.N&gt; =  &lt;!noir!rouge.N&gt;
(2) &lt;!noir.N&gt; \ &lt;!rouge.N&gt; = &lt;rouge.N&gt;
(3) &lt;V:P&gt; \ &lt;V:1s&gt; = &lt;V:P1p&gt; union &lt;V:P2&gt; union &lt;V:P3&gt;
</p>
<p>Toutes ces op&#233;rations sur les masques lexicaux, ainsi que leurs applications pour la
manipulation des automates lexicaux que nous exposons ensuite, ont d&#233;j&#224; &#233;t&#233; impl&#233;ment&#233;es
pour les dictionnaires du fran&#231;ais utilisant un jeu d&#8217;&#233;tiquettes plus restreint, lors des premiers
d&#233;veloppements du syst&#232;me Elag (Laporte et al., 1999), module de d&#233;sambigu&#239;sation lexicale,
dont nous pr&#233;sentons bri&#232;vement le fonctionnement dans cet article. Notre approche apporte,
notamment gr&#226;ce &#224; la description ext&#233;rieure du jeu d&#8217;&#233;tiquettes, un niveau d&#8217;abstraction
suppl&#233;mentaire qui nous a permis d&#8217;&#233;crire ces algorithmes ind&#233;pendamment du jeu
d&#8217;&#233;tiquettes. Cette m&#233;thode a permis ainsi d&#8217;appliquer ces op&#233;rations avec diff&#233;rents
dictionnaires, de richesses vari&#233;es dans leur structure de traits, mais aussi d&#8217;utiliser cet
environnement pour d&#8217;autres langues que le fran&#231;ais.
</p>
<p>3.2 Op&#233;ration sur les automates lexicaux
</p>
<p>Gr&#226;ce &#224; cette nouvelle repr&#233;sentation des masques lexicaux, nous pouvons maintenant adapter
les algorithmes g&#233;n&#233;raux sur les automates finis (tels que d&#233;finis dans Hopcroft et al. (1979)
par exemple), de mani&#232;re &#224; ce qu&#8217;ils aient un comportement correct sur les automates
lexicaux avec structures de traits. Les modifications apport&#233;es aux algorithmes consistent
essentiellement &#224; d&#233;couper leurs transitions afin que les ensembles d&#233;crits dans leurs
&#233;tiquettes soient deux &#224; deux disjoints ou &#233;gaux. Nous appliquons ce d&#233;coupage sur les
transitions sortantes des &#233;tats consid&#233;r&#233;s &#224; chaque &#233;tape du calcul, de mani&#232;re &#224; ce que deux
masques lexicaux distincts susceptibles d&#8217;&#234;tre compar&#233;s ont une intersection vide. Cette
propri&#233;t&#233; est suffisante &#224; la correction de la plupart des algorithmes et nous avons pu ainsi
impl&#233;menter la d&#233;terminisation, l&#8217;intersection et la minimisation pour les automates lexicaux.
La figure 2 pr&#233;sente l&#8217;automate pr&#233;c&#233;dent correctement d&#233;terminis&#233;.
Le calcul de la compl&#233;mentation est diff&#233;rent puisqu&#8217;il consiste &#224; inverser la terminalit&#233; des
&#233;tats de l&#8217;automate apr&#232;s l&#8217;avoir rendu complet. Pour ce faire, nous ajoutons sur chaque &#233;tat
de nouvelles transitions dirig&#233;es vers un &#233;tat puits et &#233;tiquet&#233;es par l&#8217;ensemble du lexique qui
n&#8217;est pas d&#233;crit dans les &#233;tiquettes des transitions d&#233;j&#224; existantes, ensemble que nous pouvons
maintenant calculer.
</p>
<p>Notons que les op&#233;rations d&#8217;union, de concat&#233;nation et de l&#8217;&#233;toile de Kleene, qui sont par
ailleurs suffisantes pour transformer une expression rationnelle en automate, ne n&#233;cessitent
pas de manipulation particuli&#232;re sur les transitions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Automates lexicaux avec structure de traits
</p>
<p>7/10
</p>
<p>Figure 2: Automate lexical d&#233;terministe
</p>
<p>Toutes ces op&#233;rations suppl&#233;mentaires qui peuvent &#234;tre effectu&#233;es efficacement gr&#226;ce &#224; notre
repr&#233;sentation appropri&#233;e des masques lexicaux ont n&#233;anmoins un impact n&#233;gatif non
n&#233;gligeable sur l&#8217;efficacit&#233; g&#233;n&#233;rale des algorithmes. En effet, le nombre de comparaisons et
de d&#233;coupages des transitions qui sont effectu&#233;s d&#233;pend fortement de la structure des
automates en entr&#233;e et peut &#234;tre, dans le pire des cas, exponentiel sur le nombre total de
transitions. Notons cependant que ce surco&#251;t concerne uniquement les algorithmes de
construction mais n&#8217;intervient pas lors de la confrontation des automates lexicaux avec les
corpus de texte. En effet, l&#8217;op&#233;ration de concordance qui d&#233;termine si une entr&#233;e lexicale est
d&#233;crite par un masque reste une op&#233;ration triviale qui consiste &#224; v&#233;rifier que les champs
sp&#233;cifi&#233;s dans le masque sont compatibles avec ceux de l&#8217;entr&#233;e (une repr&#233;sentation interne
des formes fl&#233;chies et canoniques par des entiers nous a permis de r&#233;duire les comparaisons
de cha&#238;nes de caract&#232;res &#224; des comparaisons d&#8217;entiers). Le co&#251;t induit par ces op&#233;rations
suppl&#233;mentaires sur les transitions doit de ce fait &#234;tre relativis&#233; en consid&#233;rant que l&#8217;utilisation
d&#8217;automates correctement d&#233;terminis&#233;s apporte une nette am&#233;lioration des performances lors
de leurs applications sur les corpus de texte ; la lin&#233;arit&#233; de l&#8217;analyse est notamment
conserv&#233;e lors de la recherche de concordances de formes linguistiques d&#233;crites par des
automates lexicaux dans des s&#233;quences de mots &#233;tiquet&#233;s.
</p>
<p>4 Application &#224; la d&#233;sambigu&#239;sation lexicale
Le syst&#232;me de lev&#233;e d&#8217;ambigu&#239;t&#233;s lexicales que nous pr&#233;sentons ici, Elag (Elimination of
Lexical Ambiguities by Grammars (Laporte et al.1999)), s&#8217;appuie sur des dictionnaires
&#233;lectroniques &#224; large couverture (cf. 2.1) et sur des grammaires locales &#224; base de r&#232;gles
construites par des experts humains. Par ailleurs, cette approche vise &#224; fournir le r&#233;sultat de la
d&#233;sambigu&#239;sation non pas sous la forme d&#8217;un texte lin&#233;aire totalement &#233;tiquet&#233;, comme c&#8217;est
classiquement le cas, mais sous la forme d&#8217;un automate du texte partiellement d&#233;sambigu&#239;s&#233;
(cf. Koskenniemi,1990).
Une grammaire Elag est compos&#233;e de deux parties3 : la premi&#232;re partie, que nous appelons
condition g&#233;n&#233;rale, est d&#233;limit&#233;e par les symboles &lt;!&gt; ; elle repr&#233;sente les &#233;l&#233;ments
linguistiques (formes) qui seront analys&#233;s par la grammaire ; la seconde partie, appel&#233;e
condition particuli&#232;re, est d&#233;limit&#233;e par les symboles &lt;=&gt; ; elle d&#233;crit les conditions strictes
</p>
<p>                                                 
3 Cette structure en deux parties &#171;&#160;si&#8230;, alors&#8230;&#160;&#187; est emprunt&#233;e &#224; Silberztein (1993).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Blanc et Anne Dister
</p>
<p>d&#8217;apparition des formes pr&#233;sent&#233;es en condition g&#233;n&#233;rale. Pour le dire autrement, une
grammaire Elag impose que l&#8217;on n&#8217;ait jamais comme r&#233;sultats de l&#8217;analyse dans l&#8217;automate du
texte la s&#233;quence entre les &lt;!&gt;, sauf si elle est v&#233;rifi&#233;e par ce qui est entre les signes &lt;=&gt;. La
synchronisation entre la condition g&#233;n&#233;rale et la condition particuli&#232;re se fait gr&#226;ce aux boites
&lt;=&gt; et &lt;!&gt; centrales.
</p>
<p>Figure 3: contrainte d&#8217;accord grammatical entre le pronom se et le verbe
</p>
<p>Ainsi, dans la grammaire pr&#233;sent&#233;e dans la figure 3, la condition g&#233;n&#233;rale consid&#232;re la forme
se pronom personnel ; les conditions particuli&#232;res d&#233;crivent le contexte d&#8217;apparition de cette
forme ainsi que ses contraintes d&#8217;accord : soit le pronom est au singulier et il est suivi d&#8217;un
verbe &#224; la 3e personne du singulier &lt;V :3s&gt; ; soit le pronom est au pluriel et il est suivi d&#8217;un
verbe &#224; la 3e personne du pluriel &lt;V :3p&gt;4.
</p>
<p>Avant d&#8217;&#234;tre utilis&#233;e pour la lev&#233;e d&#8217;ambigu&#239;t&#233;s, une grammaire Elag est d&#8217;abord traduite en
un automate lexical d&#233;terministe qui reconna&#238;t l&#8217;ensemble des s&#233;quences d&#8217;unit&#233;s lexicales
(ou analyses lexicales d&#8217;un texte) qui ne sont pas rejet&#233;es par la grammaire. Le calcul de cet
automate met en &#339;uvre la plupart des op&#233;rations que nous avons pu d&#233;finir sur les automates
lexicaux. L&#8217;application d&#8217;une grammaire &#224; un texte consiste ensuite simplement &#224; calculer
l&#8217;intersection de l&#8217;automate ainsi compil&#233; avec l&#8217;automate du texte. Nous obtenons comme
r&#233;sultat un nouvel automate du texte dans lequel toutes les interpr&#233;tations lexicales du corpus
rejet&#233;es par la grammaire ont &#233;t&#233; supprim&#233;es.
L&#8217;op&#233;ration d&#8217;intersection d&#8217;un automate lexical avec un automate du texte est bien d&#233;finie
puisque ce dernier n&#8217;est rien d&#8217;autre qu&#8217;un automate lexical particulier. En effet, ses
transitions sont &#233;tiquet&#233;es par des entr&#233;es lexicales, c&#8217;est-&#224;-dire des masques lexicaux dans
lesquels tous les champs sont sp&#233;cifi&#233;s. Cette propri&#233;t&#233; a d&#8217;ailleurs permis d&#8217;optimiser
l&#8217;op&#233;ration d&#8217;intersection ; les transitions de l&#8217;automates du texte &#233;tant &#233;tiquet&#233;es uniquement
par des atomes, le calcul de son intersection avec un automate lexical d&#233;terministe s&#8217;effectue
sans proc&#233;der &#224; un d&#233;coupage co&#251;teux des transitions.
Remarquons que ce mode de fonctionnement par intersection d&#8217;automates a des cons&#233;quences
imm&#233;diates sur les propri&#233;t&#233;s des grammaires de d&#233;sambigu&#239;sation. En particulier, les effets
produits par plusieurs grammaires sont cumulatifs et ind&#233;pendants de leur ordre d&#8217;application
sur le texte (puisque l&#8217;intersection d&#8217;automates est une op&#233;ration commutative). Cette
                                                 
4 Le verbe peut &#234;tre &#224; l&#8217;infinitif (W) ou au g&#233;rondif (G)&#160;; entre le pronom et le verbe, il est possible de rencontrer
</p>
<p>un pronom pr&#233;verbal soit objet (PRO+PpvLE, c&#8217;est-&#224;-dire le, la, l&#8217; et les), soit pr&#233;positionnel (PRO+PpvPR,
c&#8217;est-&#224;-dire en et y).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Automates lexicaux avec structure de traits
</p>
<p>9/10
</p>
<p>propri&#233;t&#233; est tr&#232;s utile, car elle permet de cumuler les grammaires &#233;crites par plusieurs
linguistes travaillant ind&#233;pendamment sur des probl&#232;mes d&#8217;ambigu&#239;t&#233;s diff&#233;rents.
Enfin, Elag est multilingue gr&#226;ce &#224; la description ext&#233;rieure du jeu d&#8217;&#233;tiquettes qui permet
d&#8217;adapter le comportement du programme en fonction des dictionnaires utilis&#233;s. Des
grammaires de d&#233;sambigu&#239;sation ont pu ainsi &#234;tre &#233;crites et appliqu&#233;es avec succ&#232;s pour le
fran&#231;ais comme le portugais et un travail est actuellement en cours pour pouvoir utiliser Elag
avec les dictionnaires du grec moderne. Le programme est disponible et int&#233;gr&#233; dans les
distributions r&#233;centes d&#8217;Unitex.
</p>
<p>5 Conclusion et perspectives
Nous avons montr&#233; comment &#224; l&#8217;aide d&#8217;une repr&#233;sentation structur&#233;e des masques lexicaux,
param&#233;tr&#233;e par une description pr&#233;cise du jeu d&#8217;&#233;tiquettes, nous sommes parvenus &#224;
d&#233;velopper un environnement de manipulation des automates lexicaux avec structure de traits
particuli&#232;rement adapt&#233; pour l&#8217;application des grammaires locales sur les corpus de texte
&#233;tiquet&#233;s ; nous avons pr&#233;sent&#233; une application concr&#232;te de ces m&#233;thodes pour la
d&#233;sambigu&#239;sation lexicale.
Nous souhaitons poursuivre notre &#233;tude sur la d&#233;sambigu&#239;sation lexicale par l&#8217;&#233;criture de
nouvelles grammaires et aussi utiliser cet environnement pour faire de la reconnaissance de
formes linguistiques sur un automate du texte partiellement d&#233;sambigu&#239;s&#233;.
&#192; plus long terme, nous envisageons d&#8217;&#233;tendre la description du jeu d&#8217;&#233;tiquettes en y
int&#233;grant la notion de syntagme (groupes nominaux, phrases compl&#233;tives et relatives, formes
verbales, etc.), et d&#8217;obtenir ainsi un mod&#232;le dans lequel la notion d&#8217;attribut serait
uniform&#233;ment utilis&#233;e pour caract&#233;riser les unit&#233;s lexicales comme les constituants de phrases
plus complexes. Nous pensons qu&#8217;un tel mod&#232;le combin&#233; avec la reconnaissance des
arguments phrastiques pourrait nous permettre de faire de l&#8217;analyse et de la d&#233;sambigu&#239;sation
syntaxique en utilisant les propri&#233;t&#233;s syntaxiques et distributionnelles d&#233;crites dans les tables
du lexique-grammaire.
</p>
<p>R&#233;f&#233;rences
CONSTANT M. (2000), Description d&#8217;expressions num&#233;riques en fran&#231;ais, RISSH : Revue,
Informatique et Statistiques dans les sciences humaines, n&#176; 36, Li&#232;ge, CIPL
DISTER A. (1999), De l&#8217;&#233;tiquetage traditionnel au transducteur du texte : la lev&#233;e d&#8217;ambigu&#239;t&#233;s
par grammaires locales, RISSH : Revue, Informatique et Statistiques dans les sciences
humaines n&#176; 35, Li&#232;ge, CIPL, pp. 9-24.
EAGLES (1996), http://www.ilc.cnr.it/EAGLES96/home.html
FAIRON C. (2000), Structures non connexes : grammaire des incises en fran&#231;ais : description
linguistique et outils informatiques, Universit&#233; de Paris 7, th&#232;se non publi&#233;e.
GROSS M. (1975), M&#233;thodes en syntaxe, Paris, Herman.
GROSS M. (1997), The construction of local grammars, Finite-State Language Processing, E.
ROCHE and Y. SCHABES (eds.), Cambridge, Mass./London, England: MIT Press, pp. 329-354.
G R O S S  M. (1989), La construction de dictionnaires &#233;lectroniques, Annales des
T&#233;l&#233;communications, Vol. 44, pp.4-19.
HABERT B., NAZARENKO A., SALEM A. (1997), Les linguistiques de corpus, Paris, Armand
Colin.
HOPCROFT J. E., ULLMAN J.D. (1979), Introduction to Automata Theory, Languages, and
Computation. Addison Wesley: Reading, MA.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Blanc et Anne Dister
</p>
<p>KARTTUNEN L., GA&#193;L T., KEMPE A. 1997. Xerox Finite-State Tool. Technical Report. Xerox
Research Centre Europe, Grenoble. June 1997. Meylan, France.
KOSKENNIEMI K. (1990), Finite-State parsing and disambiguation, Proceedings of COLING-
90, Helsinki, pp. 229-232
LABELLE J. et al.(1994), DELQUES V1.0. Rapport de recherche :9, Montr&#233;al, UQAM.
LAMIROY B. (&#201;d.) (1998), Le lexique-grammaire, Travaux de linguistique 37.
LAPORTE &#201;. (1994), Experiment in Lexical Disambiguation Using Local Grammars, Papers
in Computational Lexicography, COMPLEX &#8216;94 (Ferenc Kiefer, Gabor Kiss and Julia Pajzs
eds.), Budapest, Linguistics Institute of the Hungarian Academy of Sciences, pp. 163-172.
LAPORTE &#201;., SILBERZTEIN M. (1996), Ambiguity rates. Automatic analysis of French text
corpora and computation of ambiguity rates for different tagsets, in LAPORTE (&#201;.) ed.,
GRAMLEX Deliverables, October 1995 &#8211; June 1996, Paris, LADL.
LAPORTE E., MONCEAUX A. (1999), Elimination of lexical ambiguities by grammars: the
ELAG system, in C. Fairon (ed), Analyse lexicale et syntaxique: le syst&#232;me INTEX,
Lingvisticae Investigationes, John Benjamins, Amsterdam.
MARCUS M.P., SANTORINI B., MARCINKIEVICZ M.A. (1993), Building a Large Annotated
Corpus of English : the Penn TreeBank, Computational Linguistics 19 (2), pp. 313-330.
MOHRI M. (1997), Finite-State Transducers in Language and Speech Processing,
Computational Linguistics, 23:2.
MOHRI M., PEREIRA F., RILEY M. (2000), The design principles of a weighted finite-state
transducer library. Theoretical Computer Science, 231:17-32, 2000.
NAKAMURA T. (2003), Analysing texts in a specific domain with local grammars: The case of
stock exchange market reports, In Proceedings of the First International Conference on
Linguistic Informatics, Kawaguchi Y. et alii (eds.), UBLI, Tokyo University of Foreign
Studies.
OUTILEX (2002), http://www.at-lci.com/Outilex/Outilex.html
PAUMIER S. (2001), Some remarks on the application of a lexicon-grammar, Lingvistic&#230;
Investigationes XXIV:2, Amsterdam/Philadelphia, John Benjamins, pp. 245-256.
PAUMIER S. (2003), A Time-Efficient Token Representation for Parsers, Proceedings of the
EACL Workshop on Finite-State Methods in Natural Language Processing, Budapest, pp. 83-
90.
PAUMIER S. (2003), De la reconnaissance de formes linguistiques &#224; l&#8217;analyse syntaxique,
th&#232;se non publi&#233;e, Universit&#233; de Marne-la-Vall&#233;e.
POLLARD C. (1997), Lectures on the foundations of HPSG. Unpublished manuscript: Ohio
State University, pages 1-8.
REVUZ D. (1991), Dictionnaires et lexiques : m&#233;thodes et algorithmes, Universit&#233; de Paris 7,
th&#232;se de doctorat en informatique, Universit&#233; Paris 7.
RNIL (2002), http://pauillac.inria.fr/atoll/RNIL/home-fr.html
ROCHE E. (1992). Text Disambiguation by Finite-State Automata, An Algorithm and
Experiments on Corpora. In. Proceedings of COLING&#8217;92, Nantes.
ROCHE E., SCHABES Y. (eds.) (1997), Finite-State Language Processing, Cambridge, MIT
Press, Mass./London, England.
SILBERZTEIN M. (1993), Dictionnaires &#233;lectroniques et analyse automatique de textes, Le
syst&#232;me INTEX, Paris, Masson.
SILBERZTEIN M. (1998), Les graphes Intex, Lingvisticae Investigationes, pp. 3-29.
VAN HALTEREN H. (1999), Syntactic Wordclass Tagging, Dordrecht / Boston / London,
Kluwer Academic Publishers.
VAN NOORD G., GERDEMANN D. (2001), Finite State Transducers with Predicates and
Identity. Grammars 4 (3).</p>

</div></div>
</body></html>