<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitement informatique de l&#8217;inflexion dans le Lunaf, dictionnaire &#233;lectronique du luxembourgeois</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL, F&#232;s, 19-22 avril 2004 
 
</p>
<p> 
</p>
<p> 
</p>
<p>Traitement informatique de l&#8217;inflexion dans le Lunaf, 
dictionnaire &#233;lectronique du luxembourgeois  
</p>
<p> 
</p>
<p>Francisca LUNA GARCIA 
 
</p>
<p>Laboratoire d&#8217;Informatique et d&#8217;Intelligence Artificielle &#8211; INSA Strasbourg 
24, boulevard de la Victoire 
</p>
<p>67000 Strasbourg 
luna@message.lu 
</p>
<p> 
</p>
<p>Universit&#233; Marc Bloch 
22, rue Ren&#233; Descartes 
</p>
<p>67084 Strasbourg Cedex 
 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
 
</p>
<p>Afin de g&#233;n&#233;rer les formes fl&#233;chies des noms luxembourgeois dans le dictionnaire 
luxembourgeois, nous utilisons un code flexionnel. Ce code s&#8217;&#233;tant r&#233;v&#233;l&#233; trop contraignant 
pour traiter l&#8217;inflexion (alternance vocalique/Umlaut), nous pr&#233;sentons ici un moyen efficace 
pour coder ce ph&#233;nom&#232;ne. La pertinence de ce type de code est double. D&#8217;une part, il 
correspond mieux aux besoins du linguiste qui aimerait &#233;tablir des classes flexionnelles 
naturelles sans trop de contraintes informatiques. D&#8217;autre part, il permet de r&#233;duire 
significativement le nombre de classes flexionnelles. Le dictionnaire &#233;lectronique 
luxembourgeois dispose ainsi de deux codes qui peuvent se combiner entre eux pour mieux 
traiter les particularit&#233;s morphologiques des mots luxembourgeois.  
</p>
<p> 
</p>
<p>In order to generate the inflected forms of the Luxemburgish nouns in the Luxemburgish 
dictionary, we use a flexional. This code having proved to be too constraining to treat the 
inflection (vocalic alternation/Umlaut), we present here an effective means to encode this 
phenomenon. The relevance of this code is two-fold. On the one hand, it corresponds better to 
the needs of the linguist who would like to establish natural flexional classes without too 
many data-processing constraints. In addition, it reduces the number of flexional classes 
significantly. The Luxemburgish dictionary has thus two codes which can be combined for a 
better processing of the morphological characteristics of the Luxemburgish words. 
 
</p>
<p>Mots-clefs &#8211; Keywords 
inflexion vocalique, codage, g&#233;n&#233;ration automatique, luxembourgeois 
vowel inflection, encoding, automatic generation, Luxemburgish 
</p>
<p>1 Probl&#233;matique et contexte 
 
</p>
<p>Avec notre th&#232;se sur l&#8217;&#201;tude morphologique de la langue luxembourgeoise en vue de la 
cr&#233;ation d&#8217;un dictionnaire &#233;lectronique des mots luxembourgeois, le luxembourgeois fait ses 
premiers pas dans le monde du dictionnaire &#233;lectronique. Dans une premi&#232;re phase, il est 
question de cr&#233;er un dictionnaire &#233;lectronique gr&#226;ce &#224; la g&#233;n&#233;ration automatique de mots. 
Dans cette communication, nous allons nous int&#233;resser &#224; l&#8217;inflexion, ph&#233;nom&#232;ne qui nous a 
pos&#233; probl&#232;me lors de la g&#233;n&#233;ration. En effet, les langues germaniques ne marquent pas </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Francisca LUNA GARCIA 
 
</p>
<p> 
</p>
<p>seulement le pluriel &#224; la fin du mot, mais aussi &#224; l&#8217;int&#233;rieur du mot. Le codage que nous avons 
adopt&#233; pour g&#233;n&#233;rer les mots luxembourgeois, c&#8217;est-&#224;-dire pour obtenir &#224; partir du lemme la 
forme plurielle des noms, s&#8217;est vite r&#233;v&#233;l&#233; inefficace pour traiter l&#8217;inflexion (alternance 
vocalique ou Umlaut). Nous obtenions un nombre de classes flexionnelles trop &#233;lev&#233;. Nous 
voulons pr&#233;senter ici le codage cr&#233;&#233; afin de pallier ce probl&#232;me. 
</p>
<p> 
</p>
<p>A notre connaissance, ce ph&#233;nom&#232;ne ne b&#233;n&#233;ficie pas d&#8217;un traitement particulier dans les 
dictionnaires &#233;lectroniques des autres langues germaniques. Dans le dictionnaire &#233;lectronique 
luxembourgeois, le Lunaf, nous utilisons deux types de codes, l&#8217;un flexionnel qui est utilis&#233; 
pour g&#233;n&#233;rer les mots luxembourgeois, l&#8217;autre appel&#233; &#171; inflexionnel &#187;, utilis&#233; uniquement 
pour coder l&#8217;alternance vocalique ou Umlaut lors de la g&#233;n&#233;ration de la forme plurielle des 
noms luxembourgeois. Ce code &#171; inflexionnel &#187; n&#8217;est int&#233;ressant que lorsqu&#8217;il s&#8217;agit 
d&#8217;apporter des modifications &#224; l&#8217;int&#233;rieur d&#8217;un mot. Nous avons programm&#233; le code pour qu&#8217;il 
ne fonctionne que pour les voyelles, puisque l&#8217;inflexion est assez r&#233;guli&#232;re et qu&#8217;en 
luxembourgeois, il n&#8217;y a pas d&#8217;autres changements morphologiques &#224; faire &#224; l&#8217;int&#233;rieur du 
mot. 
  
</p>
<p> Ci-dessous, nous allons pr&#233;senter le code flexionnel ainsi que le code &#171; inflexionnel &#187;, 
tous les deux impos&#233;s par les caract&#233;ristiques de la langue luxembourgeoise. Nous voulons 
montrer qu&#8217;ensemble, ils nous permettent de g&#233;n&#233;rer de fa&#231;on optimale les mots de cette 
langue. Mais tout d&#8217;abord, introduisons DicoManager, le syst&#232;me qui accueille le Lunaf, 
puisque le code dont nous allons parler est celui utilis&#233; dans les dictionnaires &#233;lectroniques de 
ce syst&#232;me. 
 
</p>
<p>DicoManager1 est un syst&#232;me informatique qui n&#8217;a pas &#233;t&#233; cr&#233;&#233; pour une application 
particuli&#232;re. Il offre la possibilit&#233; de cr&#233;er pour chaque langue naturelle un dictionnaire 
&#233;lectronique constitu&#233; de deux bases de donn&#233;es, auxquelles les applications feront appel 
entre autres pour la reconnaissance de mots dans un texte. En g&#233;n&#233;ral, on consid&#232;re que la 
fonction premi&#232;re d&#8217;une telle base de donn&#233;es est d&#8217;associer une cha&#238;ne de caract&#232;res 
repr&#233;sentant la forme des mots graphiques et s&#233;mantiques et des formes fl&#233;chies avec 
diff&#233;rentes informations rendant possible, par exemple l&#8217;&#233;tiquetage ult&#233;rieur des mots dans la 
phrase. Chaque dictionnaire &#233;lectronique de DicoManager est donc constitu&#233; de deux bases de 
donn&#233;es lexicales, DicoCan et DicoForm. La premi&#232;re contient une liste de lemmes sous leur 
forme canonique, la deuxi&#232;me, les formes fl&#233;chies des lemmes. Le Lunaf compte 325 classes 
flexionnelles dont 77 nominales. Ces 77 classes flexionnelles repr&#233;sentent chacune un code 
flexionnel qui permet de g&#233;n&#233;rer la forme fl&#233;chie, c&#8217;est-&#224;-dire la forme plurielle du nom2. 
Voyons d&#8217;abord, en quoi consiste ce code flexionnel. 
</p>
<p>2 Le code flexionnel du Lunaf  
 
</p>
<p>Ce que nous codons ici, c&#8217;est la cat&#233;gorie grammaticale du nombre. Les marques du 
pluriel des noms luxembourgeois peuvent &#234;tre regroup&#233;es en cinq types flexionnels (Bruch, 
1973 ; Poitou, 1987 ; Schanen, 1980 ; Newton, 1996). Deux de ces types marquent le pluriel 
par l&#8217;affixation et par l&#8217;inflexion. Un seul uniquement par l&#8217;inflexion. 
 
</p>
<p>                                                
</p>
<p>1
 Syst&#232;me cr&#233;&#233; au sein du Laboratoire d&#8217;Informatique et d&#8217;Intelligence Artificielle (LIIA) de Strasbourg, 
</p>
<p>programm&#233; en Java et utilisant MySQL pour la cr&#233;ation des bases de donn&#233;es. 
2
 Les lemmes sont issus de notre corpus rassembl&#233; &#224; partir de textes sur Internet. Il comporte 500.000 mots et 
</p>
<p>nous a permis d&#8217;obtenir 16000 mots sous leur forme lemmatis&#233;e. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement de l&#8217;inflexion dans le Lunaf, dictionnaire &#233;lectronique du luxembourgeois. 
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Les lemmes (infinitif pour les verbes, nominatif singulier pour les noms et les adjectifs) de 
DicoCan vont subir la g&#233;n&#233;ration automatique. Nous aurons ainsi dans DicoForm (la base des 
formes fl&#233;chies) pour les mots variables, la conjugaison des verbes, la d&#233;clinaison des 
adjectifs et la forme plurielle des noms. Les mots invariables (adverbe, pr&#233;position, 
conjonction, etc.) sont stock&#233;s tels quels (sans subir de g&#233;n&#233;ration) dans les deux bases. Le 
code &#171; inflexionnel &#187;, que nous allons voir plus loin ne concernant que les noms, nous ne 
parlerons pas dans cette communication des autres cat&#233;gories lexicales. 
 
</p>
<p>Le code flexionnel qui permet la g&#233;n&#233;ration des formes fl&#233;chies se compose de deux 
parties, une partie qui contient les instructions pour g&#233;n&#233;rer les formes fl&#233;chies &#224; partir du 
lemme &#8211; qui fait l&#8217;objet de cette communication &#8211; et une partie qui comporte les informations 
morpho-syntaxiques, notamment le genre, le nombre et le cas pour les noms. Voyons deux 
exemples de g&#233;n&#233;ration nominale : en/... (type B) pour Auto &#8211; Auto-en (voiture), 2&#233;i/... (type 
D) pour Schlag &#8211; Schl&#233;i (coup). 
</p>
<p> 
</p>
<p>Dans le premier exemple nous ajoutons la marque du pluriel &lt;en&gt; au nom, alors que dans le 
deuxi&#232;me exemple nous d&#233;pla&#231;ons le curseur de deux lettres vers la gauche, ce qui efface les 
lettres &lt;ag&gt;, puis nous ins&#233;rons &lt;&#233;i&gt;. 
Le codage utilis&#233; dans les dictionnaires &#233;lectroniques de DicoManager ressemble &#224; celui 
utilis&#233; dans le dictionnaire du LADL, le DELAF (dictionnaire des formes fl&#233;chies). Nous 
l&#8217;avons adapt&#233; &#224; la langue luxembourgeoise et l&#8217;avons modifi&#233; pour pouvoir coder et g&#233;n&#233;rer 
les mots luxembourgeois dans le Lunaf. Pour construire le Lunaf, les lemmes peuvent subir 
jusqu&#8217;&#224; quatre op&#233;rations : un nombre entier sp&#233;cifie le nombre de lettres &#224; enlever &#224; partir de 
la fin du mot vers la gauche ; les caract&#232;res en minuscule ajoutent des lettres ; la commande C 
copie une lettre (il faut mettre autant de C qu&#8217;il a de lettres &#224; ajouter) ; la commande R d&#233;place 
le curseur et efface la lettre &#224; droite (un R par lettre &#224; effacer). Celles-ci sont r&#233;alis&#233;es par des 
transducteurs &#224; &#233;tats finis (Sproat, 1992) qu&#8217;il a fallu modifier pour traiter l&#8217;inflexion. 
 
</p>
<p>Afin de bien comprendre les raisons pour lesquelles nous avons cherch&#233; un code qui 
permette de coder plus efficacement l&#8217;inflexion, nous vous pr&#233;sentons bri&#232;vement les 
modifications apport&#233;es au codage que nous venons de d&#233;crire. En fait, les mots du Lunaf 
sont g&#233;n&#233;r&#233;s &#224; partir de deux codes diff&#233;rents. Nous venons d&#8217;en voir un au paragraphe 
pr&#233;c&#233;dent. Il pr&#233;sente une l&#233;g&#232;re variante en fonction des mots qu&#8217;il s&#8217;agit de g&#233;n&#233;rer. Pour 
g&#233;n&#233;rer certains temps verbaux par exemple, il est n&#233;cessaire d&#8217;utiliser deux autres 
commandes que nous d&#233;crivons ci-dessous. 
 
</p>
<p>Le participe II du verbe l&#233;ieren (&#233;tudier), c&#8217;est-&#224;-dire gel&#233;iert (appris), s&#8217;obtient &#224; 
partir du code flexionnel suivant : BgeE2t/.... 
La commande B (Beginning) renvoie le curseur en d&#233;but de mot. Cette commande peut se 
r&#233;v&#233;ler importante lorsqu&#8217;il s&#8217;agit d&#8217;ajouter des pr&#233;fixes en d&#233;but de mot, comme par exemple 
pour ajouter le pr&#233;fixe &lt;ge&gt; du participe II. Cette commande est en &#233;troite liaison avec la 
commande E (End), qui renvoie le curseur &#224; la fin du mot. A nouveau, elle est tr&#232;s utile pour 
la formation du participe II, puisque gr&#226;ce &#224; elle, apr&#232;s avoir ajout&#233; le pr&#233;fixe &lt;ge&gt; avec la 
commande B, elle place le curseur &#224; la fin du verbe et permet ainsi l&#8217;ajout de la terminaison 
du participe II. Voyons en d&#233;tail le code de l&#8217;exemple donn&#233; plus haut : 
participe II du verbe l&#233;ieren (&#233;tudier): BgeE2t/PART. 
B d&#233;placer le curseur en d&#233;but de mot 
ge ajouter &lt;ge&gt; 
E d&#233;placer le curseur en fin de mot 
2 enlever deux lettres </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Francisca LUNA GARCIA 
 
</p>
<p> 
</p>
<p>t ajouter &lt;t&gt; 
Ce qui nous donne la forme fl&#233;chie gel&#233;iert (&#233;tudi&#233;). En somme, l&#8217;op&#233;ration E (End) permet 
l&#8217;encha&#238;nement d&#8217;op&#233;rations de suppression, de copie et de remplacement de lettres. 
 
</p>
<p>Nous venons de voir comment fonctionne le code flexionnel g&#233;n&#233;ral. Il permet de g&#233;n&#233;rer 
la conjugaison des verbes, la d&#233;clinaison des adjectifs et de la plupart des noms 
luxembourgeois. En revanche, il a fallu impl&#233;menter un code sp&#233;cifique pour traiter le 
ph&#233;nom&#232;ne de l&#8217;inflexion. 
</p>
<p>3 Le code &#171; inflexionnel &#187; du Lunaf 
 
</p>
<p>Nous avons voulu trouver un moyen efficace de coder l&#8217;inflexion des voyelles du radical. 
Le codage que nous avons d&#233;crit pr&#233;c&#233;demment &#233;tait trop compliqu&#233; et engendrait une 
multiplication des classes flexionnelles lorsqu&#8217;il s&#8217;agissait de coder l&#8217;inflexion. Il a donc fallu 
cr&#233;er ce nouveau code. Il s&#8217;agit surtout de montrer la particularit&#233; de ce code par rapport &#224; 
celui que nous venons de voir, ainsi que son utilit&#233;.  
En fait, le codage du Lunaf propose trois fa&#231;ons de d&#233;placer le curseur dans le mot : dans le 
code flexionnel le d&#233;placement du curseur se fait lettre par lettre et/ou en d&#233;but ou en fin de 
mot, et dans le code &#171; inflexionnel &#187; le curseur se place sur une lettre pr&#233;cise &#224; l&#8217;int&#233;rieur du 
mot.  
</p>
<p>Nous avons donc ajout&#233; la possibilit&#233; de chercher une cha&#238;ne de caract&#232;res et de la 
remplacer par une autre cha&#238;ne de caract&#232;res. Par exemple pour passer de Hafen (port) &#224; 
H&#228;fen (ports) on va coder l&#8217;information de la fa&#231;on suivante dans le Lunaf : (a)&#228;)/... 3. 
 
</p>
<p>La voyelle du radical qui subit l&#8217;inflexion se met entre parenth&#232;ses, suivie de la voyelle 
infl&#233;chie. L&#8217;&#233;conomie de classes flexionnelles se fait surtout lorsque les voyelles de plusieurs 
noms subissent la m&#234;me inflexion. Par exemple, les noms comme Stad (ville), Schued 
(d&#233;g&#226;ts) et Daach (toit) deviennent au pluriel Stied, Schied, Diech. En utilisant le code 
flexionnel d&#233;crit en 2) pour g&#233;n&#233;rer ce type de pluriel, nous aurions les trois classes 
flexionnelles suivantes et donc trois codes diff&#233;rents: 2RieE/... pour Stad, 3RiE/... pour 
Schued, 4RrieE/... pour Daach. Avec le code &#171; inflexionnel &#187; ces trois noms et leurs 
compos&#233;s ne sont regroup&#233;s que dans un seul code : (a;aa;ue)ie)/..... pour Stad &#8594; Stied, 
Daach &#8594; Diech, Schued &#8594; Schied. 
</p>
<p> 
</p>
<p>Un tel code fonctionne de gauche &#224; droite, c&#8217;est-&#224;-dire, que la premi&#232;re voyelle recherch&#233;e est 
celle qui se trouve le plus &#224; gauche dans le code. Le programme cherchera d&#8217;abord la 
premi&#232;re voyelle, le &lt;a&gt;. S&#8217;il ne la trouve pas, il recherchera la voyelle suivante du code, le 
&lt;aa&gt;. Et si l&#224; encore il ne trouve pas, il passera au couple suivant, le &lt;ue&gt;. D&#8217;apr&#232;s notre 
corpus, nous avons obtenu un maximum de trois voyelles (ou double voyelles) dans chaque 
code.  
 
</p>
<p>La recherche de la voyelle dans le nom se fait de droite &#224; gauche et cela pour 
permettre la mise au pluriel des noms compos&#233;s ou pour g&#233;rer les cas o&#249; un m&#234;me nom 
comporterait deux voyelles identiques. Ce choix de recherche dans le mot se justifie pour 
deux raisons. La premi&#232;re est due au fait que si nous ne proc&#233;dions pas par la fin du mot, le 
g&#233;n&#233;rateur de formes ne saurait pas quelle voyelle doit subir l&#8217;inflexion. Voyons les exemples 
suivants : soit les noms Akaafsstad (ville commerciale) et Karnavalstad (ville de carnaval) et 
                                                
</p>
<p>3
 Les parenth&#232;ses ont pour seul but de d&#233;limiter les op&#233;rations sur le lemme. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement de l&#8217;inflexion dans le Lunaf, dictionnaire &#233;lectronique du luxembourgeois. 
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>le code flexionnel pr&#233;c&#233;dent : (a;aa;u)ie)/.... Est-ce le &lt;aa&gt; de Akaafs- ou le &lt;a&gt; de -stad ou 
lequel des quatre &lt;a&gt; de Karnavalstad qui doit subir l&#8217;inflexion ? Il se produirait une 
ambigu&#239;t&#233; et le programme g&#233;n&#232;rerait une forme fl&#233;chie incorrecte. 
La deuxi&#232;me raison est &#233;troitement li&#233;e &#224; la nature m&#234;me des noms compos&#233;s. Le membre 
principal des noms compos&#233;s se trouve toujours &#224; la fin du compos&#233;. Dans les exemples que 
nous venons de donner, il s&#8217;agit de Stad (ville). Ce qui fait une bonne raison de commencer 
par la fin du mot. Ce code &#171; inflexionnel &#187; permet ainsi de g&#233;n&#233;rer de fa&#231;on optimale les mots 
simples et les mots compos&#233;s. Le transducteur fonctionne lui aussi de droite &#224; gauche. Dans 
l&#8217;exemple pr&#233;c&#233;dent, le transducteur fait que l&#8217;on passe du lemme au singulier Stad (ville) &#224; la 
forme lexicale au pluriel Stied (villes). Cette fa&#231;on de proc&#233;der est d&#233;crite chez Cornell 
(1988). Le transducteur comporte &#233;galement des informations morpho-syntaxiques. Il est 
compos&#233; d&#8217;un arc marqu&#233; par exemple a:ie pour manipuler la transduction de Stad &#224; Stied. En 
plus, cet arc est marqu&#233; [+pl], signifiant qu&#8217;il introduit la propri&#233;t&#233; morpho-syntaxique 
[+pluriel] en m&#234;me temps qu&#8217;il effectue la transduction du /a/ de surface vers le /ie/ lexical. 
 
</p>
<p>Quelques exemples de codes &#171; inflexionnels &#187; vont nous permettre de mieux visualiser 
les classes nominales concern&#233;es. Par rapport au code flexionnel, le code &#171; inflexionnel &#187; 
permet de relever des r&#233;gularit&#233;s dans l&#8217;inflexion, c&#8217;est-&#224;-dire les voyelles ou diphtongues qui 
subissent la m&#234;me alternance, puisque chaque code regroupe tous les noms qui marquent le 
pluriel de la m&#234;me fa&#231;on : 
(a;o)ee) &#8594; Bam &#8211; Beem (arbre), Nol &#8211; Neel (clou, ongle), 
(ou;o)&#233;i) &#8594; Fouss &#8211; F&#233;iss (pied), Stot &#8211; St&#233;it (m&#233;nage). 
 
</p>
<p>Dans ces exemples nous voyons qu&#8217;en luxembourgeois, il est possible que plusieurs noms 
subissent la m&#234;me inflexion lors de la mise au pluriel (Luna Garcia, 2002 ; Schanen, 2004).  
L&#8217;ordre des voyelles &#224; remplacer n&#8217;est pas al&#233;atoire. Il est d&#233;termin&#233; en raison de la fr&#233;quence 
de remplacement, c&#8217;est-&#224;-dire qu&#8217;une voyelle ou une diphtongue qui subit plus souvent 
l&#8217;inflexion prendra la premi&#232;re place dans le code. Ceci r&#233;duit le risque d&#8217;erreur lorsque le 
nom contient plus d&#8217;une voyelle. 
 
</p>
<p> Il est possible de combiner le code flexionnel et le code &#171; inflexionnel &#187;, notamment 
lorsque le nom subit l&#8217;inflexion et l&#8217;ajout de la marque du pluriel en fin de mot. Pour g&#233;n&#233;rer 
la forme plurielle des noms suivants: Lach &#8211; L&#228;cher (trou), Faass &#8211; F&#228;sser (tonneau), nous 
combinons les deux codes de la fa&#231;on suivante: (a;aa)&#228;)er/.... 
 
</p>
<p>Les avantages du code &#171; inflexionnel &#187; sont donc : 
o une g&#233;n&#233;ration similaire des mots simples et des mots compos&#233;s, 
o le d&#233;placement du curseur sur une lettre ou un couple de lettres pr&#233;cises &#224; 
</p>
<p>l&#8217;int&#233;rieur d&#8217;un mot, 
o la possibilit&#233; d&#8217;&#233;tablir un ordre de fr&#233;quence, 
o la possibilit&#233; de rep&#233;rer les r&#233;gularit&#233;s flexionnelles 
o la possibilit&#233; de le combiner au code flexionnel. 
</p>
<p> 
</p>
<p>Ce code peut n&#233;anmoins pr&#233;senter un d&#233;savantage, qui va d&#233;pendre des caract&#233;ristiques 
morphologiques de la langue trait&#233;e. Selon le nombre de voyelles contenues dans le mot, cette 
fa&#231;on de proc&#233;der peut se r&#233;v&#233;ler handicapante. En effet, lorsque le nom (surtout les noms 
compos&#233;s) contient plusieurs voyelles et que le code se compose de deux ou trois voyelles &#224; 
infl&#233;chir, il peut y avoir un probl&#232;me. En luxembourgeois, nous n&#8217;avons pas encore rencontr&#233; 
ce type de probl&#232;me, mais nous ne l&#8217;excluons pas. Nous avons fabriqu&#233; l&#8217;exemple suivant 
pour illustrer ce cas. Soit un nom comme *Karnevalstad (ville de carnaval) et le code </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Francisca LUNA GARCIA 
 
</p>
<p> 
</p>
<p>suivant : *(e;a)ie)/.&#8230; La voyelle qui subit le plus souvent l&#8217;inflexion, le &lt;e&gt; dans ce cas, se 
retrouve en premi&#232;re position et sera donc remplac&#233;e en premier. Cette situation va donc 
produire une forme incorrecte &#233;tant donn&#233; que c&#8217;est le &lt;a&gt; de Stad (ville) qui doit &#234;tre 
infl&#233;chi. Mais heureusement, cet inconv&#233;nient ne devrait pas &#234;tre tr&#232;s fr&#233;quent pour les noms 
simples en luxembourgeois, puisque du moins d&#8217;apr&#232;s notre corpus, les noms au singulier ne 
contiennent qu&#8217;une voyelle ou une diphtongue. En revanche, ce probl&#232;me pourrait se poser 
pour les noms compos&#233;s, m&#234;me si c&#8217;est peu probable en luxembourgeois. 
</p>
<p>4 R&#233;sultats 
 
</p>
<p>Dans le Lunaf, nous utilisons donc deux codes qui traitent chacun une caract&#233;ristique 
particuli&#232;re de la morphologie des noms luxembourgeois. Dans cette communication, nous 
avons voulu pr&#233;senter le code qui permet de traiter l&#8217;inflexion des noms luxembourgeois et 
qui de ce fait est appel&#233; &#171; inflexionnel &#187;. Le codage utilis&#233; dans notre dictionnaire 
&#233;lectronique propose donc trois fa&#231;ons de d&#233;placer le curseur dans le mot : lettre par lettre, en 
d&#233;but ou en fin de mot et sur une lettre pr&#233;cise &#224; l&#8217;int&#233;rieur du mot.  
</p>
<p>Gr&#226;ce au code &#171; inflexionnel &#187; nous avons effectivement r&#233;duit le nombre de classes. De 
92 classes flexionnelles nominales nous sommes pass&#233;s &#224; 77. Bien que les exemples de codes 
donn&#233;s plus haut ne se composent que de voyelles et de diphtongues, nous n&#8217;excluons pas le 
remplacement de consonnes &#224; l&#8217;int&#233;rieur du mot lorsque les caract&#233;ristiques de la langue 
trait&#233;e s&#8217;y pr&#234;tent. 
</p>
<p>Ce code n&#8217;a pas &#233;t&#233; cr&#233;&#233; pour traiter exclusivement l&#8217;inflexion des noms de la langue 
luxembourgeoise. Il est tout &#224; fait possible de l&#8217;utiliser dans d&#8217;autres langues qui pr&#233;sentent 
des alternances vocaliques du m&#234;me genre comme par exemple les langues germaniques.  
 
</p>
<p> 
</p>
<p>R&#233;f&#233;rences 
 
</p>
<p>CORNELL T. (1988), &#171; IceParse : A model of inflectional parsing and word recognition for 
Icelandic ablauting verbs &#187;. In : Morphology as a Computational Problem, Department of 
Linguistics, University of California, Los Angeles. 
 
</p>
<p>LUNA GARCIA F. (2002), &#171; Particularit&#233;s morphologiques du mot luxembourgeois et leur 
impl&#233;mentation pour la g&#233;n&#233;ration automatique des mots &#187;. In : Bulletin Universitaire de 
Linguistique G&#233;n&#233;rale et Appliqu&#233;e (BULAG), n&#176;27, pp.151-166. 
 
</p>
<p>NEWTON G. (1996), Luxembourg and L&#235;tzebuergesch, Oxford, Clarendon Press. 
 
</p>
<p>POITOU J. (1987), &#171; La flexion des substantifs en allemand II &#187;. In : Nouveaux Cahiers 
d&#8217;Allemand, n&#176;3, pp.299-314. 
 
</p>
<p>SCHANEN F. (1980), Recherches sur la syntaxe du luxembourgeois de Schengen, th&#232;se 
soutenue &#224; Paris IV. 
 
</p>
<p>SILBERZTEIN M. (1996), INTEX 3.4 reference manual, LADL, Universit&#233; Paris 7. 
 
</p>
<p>SPROAT R. (1992), Morphology and Computation, Cambridge, The MIT Press. 
 </p>

</div></div>
</body></html>