<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mot vide, mot plein ? Comment trancher localement</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2004, F&#232;s, 21 avril 2004 
</p>
<p>Mot vide, mot plein ? 
Comment trancher localement 
</p>
<p>Fr&#233;d&#233;rick HOUBEN 
</p>
<p>GREYC &#8211; UMR 6072 &#8211; Universit&#233; de Caen 
Bureau S2 301 &#8211; campus II &#8211; BP 5186 
</p>
<p>F-14032 CAEN cedex 
fhouben@info.unicaen.fr 
</p>
<p>Mots-clefs &#8211; Keywords 
Traitements multilingues, d&#233;couverte de mots vides, alternative &#224; une stop-list, extraction de 
r&#232;gles et de motifs fr&#233;quents. 
</p>
<p>Multilingual NLP, function words discovery, stop-list alternation, rules and frequent pattern 
mining. 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
Nous pr&#233;sentons une m&#233;thode multilingue de cat&#233;gorisation en mot vide / mot plein &#224; partir 
de corpus brut. Cette m&#233;thode fait appel &#224; des propri&#233;t&#233;s tr&#232;s g&#233;n&#233;rales des langues ainsi qu&#8217;&#224; 
des techniques issues de la communaut&#233; de la fouille de donn&#233;es. 
</p>
<p>We are presenting a NLP multilingual method for function word / content word categorization 
using no other resource than the raw text itself. This method uses very general linguistic 
properties and also engineering from data mining community. 
</p>
<p>1 Introduction 
Ce travail est une t&#226;che pr&#233;liminaire dans le cadre de traitements linguistiques sans autres 
ressources que le texte &#224; analyser lui-m&#234;me. Cette absence de ressources permet d&#8217;analyser un 
texte sans identification pr&#233;alable de la langue dans laquelle il a &#233;t&#233; &#233;crit et permet aussi 
d&#8217;&#233;viter le recours &#224; une stop-list et le probl&#232;me li&#233; des mots homographes pouvant &#234;tre &#224; la 
fois mot vide ou mot plein selon le contexte (son, vers, pas &#8230;). Pour cela, nous utilisons des 
connaissances tr&#232;s g&#233;n&#233;rales (qualifi&#233;es parfois de m&#233;ta-connaissances) sur les langues. Nous 
ne pr&#233;tendons cependant pas qu&#8217;une telle m&#233;thode soit totalement universelle et nous nous 
contenterons de la r&#233;duire &#224; certains groupes de langues aux propri&#233;t&#233;s communes (ici, les 
langues de type alphab&#233;tique non agglutin&#233;es). 
</p>
<p>Dans le cadre de cet article, nous nous int&#233;resserons &#224; la discrimination locale mot vide / mot 
plein. Cette t&#226;che peut servir d&#8217;amorce dans des travaux d&#8217;extraction de candidats termes 
(Vergne, 2003) ou d&#8217;indexation automatique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;rick HOUBEN 
</p>
<p>2 Mots vides, mots grammaticaux, function words 
On trouve plusieurs d&#233;finitions de ces mots vides qui varient dans l&#8217;inclusion ou la non 
inclusion des mots lexicaux reli&#233;s au th&#232;me d&#8217;un corpus donn&#233; (ce mot n&#8217;est pas discriminant 
dans le cadre de l&#8217;informatique documentaire et augmente la taille d&#8217;un index de mani&#232;re 
inutile). Dans notre cas, nous nous situons plus dans l&#8217;optique de (Tesni&#232;re, 1969) et 
consid&#233;rons comme mots vides l&#8217;ensemble des mots grammaticaux ainsi que les auxiliaires. 
Les mots pleins sont donc tous les autres. 
</p>
<p>Il est important de noter ici que les d&#233;ductions &#233;tant faites &#224; l&#8217;aide du contexte, elles sont 
totalement locales et peuvent donc diff&#233;rer pour une m&#234;me graphie. 
</p>
<p>3 Propri&#233;t&#233;s linguistiques utilis&#233;es 
Nous utilisons deux propri&#233;t&#233;s linguistiques tr&#232;s g&#233;n&#233;rales :  
</p>
<p>&#8226; Le &#171; principe du moindre effort &#187; de Zipf consiste &#224; dire que le locuteur a tendance &#224; 
raccourcir ce qui est d&#8217;usage courant (Zipf, 1949). En d&#8217;autres termes, les mots 
grammaticaux sont &#224; la fois fr&#233;quents et de petite taille. 
</p>
<p>&#8226; La seconde propri&#233;t&#233; est une cons&#233;quence du principe de Saussure (Saussure, 1922) 
selon lequel &#171; dans la langue, il n&#8217;y a que des diff&#233;rences &#187;. Entre autre, nous 
pouvons calculer des diff&#233;rences locales pour discriminer les mots vides des mots 
pleins, diff&#233;rences entre les crit&#232;res de taille et d&#8217;effectif tels que d&#233;finis par Zipf. 
</p>
<p>&#8226; Enfin, nous faisons l&#8217;hypoth&#232;se que les mots vides et les mots pleins ne se succ&#232;dent 
pas n&#8217;importe comment et que certaines cha&#238;nes sont plus fr&#233;quentes que d&#8217;autre. 
</p>
<p>4 Processus de marquage 
</p>
<p>4.1 Une vue g&#233;n&#233;rale 
</p>
<p> 
</p>
<p>Figure 1: Processus de marquage mot vide / mot plein 
</p>
<p>Notre processus se d&#233;compose en trois &#233;tapes distinctes. Une premi&#232;re &#233;tape permet de 
collecter les motifs apr&#232;s un d&#233;coupage du corpus en mots (et un comptage de l&#8217;effectif de 
chaque graphie). Dans la deuxi&#232;me &#233;tape, nous utilisons le logiciel mvminer1, pour extraire 
des r&#232;gles &#224; partir des motifs obtenus pr&#233;c&#233;demment et enfin nous cherchons &#224; appliquer ces 
r&#232;gles pour affiner nos r&#233;sultats. En d&#233;finitive, nous obtenons notre corpus avec, pour chaque 
mot, l&#8217;indication du type calcul&#233;.  
</p>
<p>                                                 
1  Logiciel d&#8217;&#233;tude r&#233;alis&#233; par Fran&#231;ois RIOULT (RIOULT 2003). Il extrait l&#8217;ensemble des motifs &#948;-libres qui 
</p>
<p>constituent une repr&#233;sentation condens&#233;e des motifs fr&#233;quents. Les r&#233;sultats fournissent l&#8217;association d&#8217;un 
motif libre et de sa fermeture (au sens de Galois), ce qui constitue une r&#232;gle forte. 
</p>
<p>Calcul des 
motifs 
</p>
<p>Base de 
motifs  
</p>
<p>Extraction 
des r&#232;gles 
</p>
<p>Base de 
r&#232;gles 
</p>
<p>Application 
des r&#232;gles 
</p>
<p>Corpus 
brut 
</p>
<p>Corpus
marqu&#233;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mot vide, mot plein ? Comment trancher localement. 
</p>
<p>4.2 Calcul des motifs 
Dans notre cas, on appellera motif une suite de 5 lettres2 parmi les suivantes : P (Plein), s 
(signe de ponctuation), v (vide) ou n (non d&#233;termin&#233;). Ces motifs repr&#233;sentent le type, d&#8217;apr&#232;s 
une d&#233;duction en contexte local des 5 mots d&#8217;une fen&#234;tre. 
</p>
<p>Graphies n&#8217; a connu ni arr&#234;ts 
motif v v P n P 
</p>
<p>Figure 2 : Exemple de motif pour une fen&#234;tre 
</p>
<p>Dans cette partie, nous utilisons une fen&#234;tre glissante (voir Figure 3), c'est-&#224;-dire une suite de 
5 mots cons&#233;cutifs pris dans le sens de lecture. Dans cette fen&#234;tre, nous allons effectuer des 
d&#233;ductions locales pour d&#233;terminer le type des 5 mots puis faire glisser la fen&#234;tre d&#8217;un cran 
dans le sens de lecture afin d&#8217;analyser tout le corpus. 
</p>
<p>Nous disposons, pour chaque mot de la fen&#234;tre, de sa graphie, de son effectif total dans le 
corpus, ainsi que de la liste des d&#233;ductions locales r&#233;alis&#233;es pour ce mot, dans les diff&#233;rentes 
positions qu&#8217;il a occup&#233;es dans la fen&#234;tre aux pr&#233;c&#233;dentes positions de la fen&#234;tre, avec donc 
des contextes l&#233;g&#232;rement diff&#233;rents &#224; chaque fois. 
</p>
<p>Figure 3 : Exemple de fen&#234;tre avec un glissement d&#8217;un mot 
</p>
<p>Nous allons calculer la moyenne g&#233;om&#233;trique des effectifs des mots de la fen&#234;tre (sauf les 
ponctuations) ainsi que celle des tailles de ces mots. Les mots dont l&#8217;effectif est sup&#233;rieur &#224; la 
</p>
<p>                                                 
2  Nous avons d&#233;termin&#233; la taille de ces motifs en estimant qu&#8217;un empan de 5 mots est suffisant pour garantir la 
</p>
<p>pr&#233;sence de mots vides et pleins. En effet, puisque nous utilisons des diff&#233;rences locales, il faut &#234;tre s&#251;r que 
de telles diff&#233;rences existent dans notre fen&#234;tre. 
</p>
<p>D&#233;ductions obtenues pour chaque graphie 
[Graphies / effectif] 
</p>
<p>Ordre des d&#233;ductions 
[conqu&#234;tes 1 ] P P P P P 
[impr&#233;vues 1 ]  P P P P 
[.  108 ]   s s s 
[La  5 ]    nd v 
[marche 1 ]     P 
</p>
<p>Motif de la fen&#234;tre : P P s v P 
conqu&#234;tes est consid&#233;r&#233; comme un mot plein apr&#232;s recoupement en sortie de fen&#234;tre
</p>
<p>[impr&#233;vues 1 ] P P P P P 
[.  108 ]  s s s s 
[La  5 ]   nd v v 
[marche 1 ]    P P 
[triomphale 1 ]     P 
</p>
<p>Motif de la fen&#234;tre : P s v P P 
impr&#233;vues est consid&#233;r&#233; comme un mot plein apr&#232;s recoupement en sortie de 
</p>
<p>fen&#234;tre 
</p>
<p>Se
ns
</p>
<p> d
e 
</p>
<p>le
ct
</p>
<p>ur
e </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;rick HOUBEN 
</p>
<p>moyenne des effectifs et dont la taille est inf&#233;rieure &#224; la moyenne des tailles sont consid&#233;r&#233;s 
comme vides. Les mots dont l&#8217;effectif est inf&#233;rieur &#224; la moyenne et dont la taille est 
sup&#233;rieure sont consid&#233;r&#233;s comme pleins. Dans tout autre cas, on consid&#232;re qu&#8217;il y a 
ind&#233;termination. 
</p>
<p>Lorsque la fen&#234;tre glisse d&#8217;un mot dans le sens de lecture, un nouveau mot y entre, un autre 
en sort. Le mot qui sort a &#233;t&#233; dans les 5 positions (sauf premiers et derniers mots du corpus) 
de la fen&#234;tre et a donc fait l&#8217;objet de 5 d&#233;ductions locales qui peuvent &#234;tre diff&#233;rentes. Nous 
effectuons alors un recoupement de ces cinq d&#233;ductions (dans l&#8217;&#233;tat des travaux, nous prenons 
simplement la d&#233;duction majoritaire) pour attribuer un type unique &#171; en sortie &#187; &#224; ce mot. 
</p>
<p>Lorsque nous avons parcouru le corpus et attribu&#233; &#224; chacun des mots un type qui peut &#234;tre soit 
vide, soit plein, soit encore non d&#233;termin&#233;, nous disposons d&#8217;une liste des mots et de leur 
type. Nous allons donc essayer maintenant de trouver le type des mots non encore d&#233;termin&#233;s. 
</p>
<p>4.3 Extraction des r&#232;gles 
Les r&#232;gles sont calcul&#233;es par le logiciel mvminer &#224; partir des motifs collect&#233;s dans la phase 
pr&#233;c&#233;dente. Les r&#232;gles se pr&#233;sentent sous la forme classique &#171; pr&#233;misses =&gt; conclusion &#187;. Il 
s&#8217;agit de r&#232;gles &#224; pr&#233;misses minimales. Dans l&#8217;exemple ci-dessous, les pr&#233;misses sont le 
contexte suivant : un mot vide, un mot de type quelconque, un signe de ponctuation puis un 
mot vide. La conclusion nous indique que le mot de type quelconque est sans doute un mot 
plein. Les r&#232;gles peuvent avoir des exceptions (tol&#233;rance en erreur) dont la quantit&#233; est 
param&#233;trable lors de l&#8217;ex&#233;cution de mvminer. 
</p>
<p>v  s v  =&gt; v &#214; P s v  
 Figure 4 : Exemple de r&#232;gle 
</p>
<p>Nous ne gardons que les r&#232;gles avec un support minimal qui est fonction de la langue &#233;tudi&#233;e 
afin de ne pas avoir des &#171; r&#232;gles d&#8217;exceptions &#187;. De m&#234;me, seules les r&#232;gles avec au moins 
deux &#233;l&#233;ments dans les pr&#233;misses sont conserv&#233;es. En effet, nous cherchons &#224; d&#233;duire le type 
d&#8217;un mot d&#8217;apr&#232;s son contexte et les pr&#233;misses correspondent &#224; ce contexte. Enfin, les r&#232;gles 
contenant un &#233;l&#233;ment de type ind&#233;termin&#233; sont aussi rejet&#233;es puisque notre objectif est 
justement de lever cette ind&#233;termination. 
</p>
<p>Notons enfin, et cela est essentiel, que la mani&#232;re dont les r&#232;gles sont extraites garantit qu&#8217;il 
ne peut pas y en avoir deux contradictoires (pr&#233;misses identiques, conclusions oppos&#233;es). 
</p>
<p>4.4 Application des r&#232;gles 
 des  conqu&#234;tes impr&#233;vues . La marche 
</p>
<p>Effectif 31 1 1 108 5 1 
Type initial v P P s n P 
</p>
<p>R&#232;gle appliqu&#233;e  P  s &#214; v P 
Type final     v  
</p>
<p>Figure 5 : Application d'une r&#232;gle 
</p>
<p>Pour appliquer les r&#232;gles, nous sortons du cadre de la fen&#234;tre pour modifier le type des mots 
tel que d&#233;fini apr&#232;s recoupement, type que nous avions appel&#233; &#171; en sortie &#187;. Nous cherchons 
simplement &#224; retrouver automatiquement un contexte qui correspond aux pr&#233;misses d&#8217;une </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mot vide, mot plein ? Comment trancher localement. 
</p>
<p>r&#232;gle et nous v&#233;rifions que la conclusion de cette r&#232;gle permettra de remplacer un mot dont le 
type n&#8217;avait pas encore &#233;t&#233; d&#233;termin&#233;. 
</p>
<p>5 Evaluation et discussion des r&#233;sultats 
Nous avons cherch&#233; &#224; &#233;valuer ces r&#233;sultats en deux temps. Tout d&#8217;abord le degr&#233; de 
cat&#233;gorisation des mots d&#232;s la premi&#232;re &#233;tape, bas&#233;e sur le simple calcul de double diff&#233;rence 
taille / effectif. Ensuite, la part d&#8217;am&#233;lioration apport&#233;e par l&#8217;utilisation des r&#232;gles. 
</p>
<p>Le tableau ci-dessous pr&#233;sente les r&#233;sultats sur un corpus en fran&#231;ais (article de Coubertin sur 
le football). Ce corpus est de taille volontairement limit&#233;e pour permettre une validation &#224; la 
main des r&#233;sultats obtenus. Dans chaque colonne, nous mettons le nombre de graphies ayant 
&#233;t&#233; consid&#233;r&#233;es comme des mots vides, comme des mots pleins ou de type non d&#233;termin&#233;.  
</p>
<p>Les d&#233;ductions locales sont les calculs effectu&#233;s au cours de la premi&#232;re &#233;tape, &#224; l&#8217;int&#233;rieur 
d&#8217;une fen&#234;tre. Chaque mot apparaissant dans les 5 positions de la fen&#234;tre, il y a 
approximativement 5 fois plus de d&#233;ductions que de graphies. 
</p>
<p>Les recoupements sont les types d&#233;finitifs, quand le mot est sorti de la fen&#234;tre et que nous 
avons fait la synth&#232;se des d&#233;ductions locales effectu&#233;es sur ce mot. L&#224; encore, ce sont des 
calculs effectu&#233;s lors de la premi&#232;re &#233;tape. Cette fois-ci, il y a un type par graphie du corpus. 
</p>
<p>La derni&#232;re colonne montre les r&#233;sultats obtenus apr&#232;s avoir extrait et appliqu&#233; les r&#232;gles. 
Nous retrouvons les r&#233;sultats pr&#233;c&#233;dents auxquels nous ajoutons les graphies dont le type 
n&#8217;&#233;tait pas encore d&#233;termin&#233; et qui l&#8217;a &#233;t&#233; gr&#226;ce &#224; l&#8217;application des r&#232;gles. 
</p>
<p>3287 graphies dont 
1118 diff&#233;rentes 
</p>
<p>Apr&#232;s d&#233;ductions 
locales 
</p>
<p>Apr&#232;s recoupements 
en sortie de fen&#234;tre 
</p>
<p>Apr&#232;s application des 
r&#232;gles 
</p>
<p>Vides 6265 1262 1277 
Pleins 6252 1256 1277 
</p>
<p>Ind&#233;termin&#233;s 2178 (24 %) 423 (14,4 %) 387 (13,2 %) 
</p>
<p>Figure 6 : R&#233;sultats sur un corpus fran&#231;ais 
</p>
<p>De mani&#232;re plus pr&#233;cise, nous remarquons que des cas difficiles sont ainsi r&#233;solus. Par 
exemple, os, ans, vie, jeu sont reconnus pleins malgr&#233; leur tr&#232;s petite taille (voir Figure 7) 
mais gr&#226;ce au contexte dans lequel nous les avons lus. Jeu pr&#233;sentait m&#234;me une deuxi&#232;me 
difficult&#233; puisque le texte analys&#233; portait sur le football et que jeu faisait partie des mots li&#233;s 
au th&#232;me et donc &#224; grand effectif (11 occurrences). 
</p>
<p>Figure 7 : Exemple de d&#233;duction r&#233;ussie 
</p>
<p>Nous avons aussi cherch&#233; &#224; calculer la valeur de ces r&#233;sultats. Nous avons donc proc&#233;d&#233; &#224; une 
annotation manuelle du corpus en mot vide / mot plein &#224; laquelle nous avons compar&#233; nos 
r&#233;sultats de calculs. Nous avons regard&#233; le nombre de mots auxquels un type a &#233;t&#233; donn&#233; 
(vide ou plein) pour calculer un taux de rappel ainsi que le nombre de ces mots dont le type 
donn&#233; est le bon afin d&#8217;&#233;tablir une mesure de pr&#233;cision. Nous avons effectu&#233; ces deux 
mesures avant et apr&#232;s l&#8217;application des r&#232;gles extraites, afin de pouvoir d&#233;terminer 
</p>
<p>Graphies r&#232;gles du jeu ; Il les 
Effectif / Type initial 5 / P 42 / v 11 / n 31 / s 39 / v 58 / v 
</p>
<p>R&#232;gle appliqu&#233;e  v &#214; P s v  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;rick HOUBEN 
</p>
<p>l&#8217;am&#233;lioration apport&#233;e par cette m&#233;thode. Nous avons ainsi obtenu un rappel de 85,6 % avant 
et 86,84 % apr&#232;s application des r&#232;gles pour une pr&#233;cision de 93,37 % avant et 93,11 % apr&#232;s. 
</p>
<p>Nous avons enfin cherch&#233; &#224; &#233;valuer la pr&#233;cision des modifications effectu&#233;es gr&#226;ce aux 
r&#232;gles. Nous avons simplement regard&#233; quels &#233;taient les mots ayant subit une modification de 
type (ind&#233;termin&#233; avant l&#8217;application des r&#232;gles, vide ou plein apr&#232;s) et dont le nouveau type 
&#233;tait correct. Pour plus de d&#233;tail, nous avons s&#233;par&#233; ceux dont le nouveau type &#233;tait vide de 
ceux dont le nouveau type &#233;tait plein. 15 mots ont &#233;t&#233; d&#233;termin&#233;s vides dont 14 correctement 
et 21 mots d&#233;termin&#233;s pleins dont 15 correctement. 
</p>
<p>6 Conclusion 
Cette m&#233;thode pr&#233;sente de bons r&#233;sultats et permet d&#8217;obtenir, sans ressources pr&#233;alables, une 
discrimination en mots vides / mots pleins y compris sur des cas difficiles comme les mots 
dont la taille ou l&#8217;effectif ne permettrait pas que nous les d&#233;tections en utilisant simplement la 
loi de Zipf. Nous r&#233;solvons le probl&#232;me des mots pleins de petite taille, des mots pleins de 
grand effectif (mots li&#233;s au th&#232;me du corpus notamment), le probl&#232;me des mots vides avec 
majuscule (et donc faible effectif) et aussi certains cas d&#8217;homographie&#8230; 
</p>
<p>Cette m&#233;thode peut &#234;tre vue comme un classifieur na&#239;f dans son fonctionnement actuel. Elle 
pr&#233;sente surtout l&#8217;originalit&#233; de faire appel &#224; des techniques issues de la communaut&#233; de la 
fouille de donn&#233;es qui peuvent s&#8217;appliquer &#224; notre domaine avec une certaine r&#233;ussite. Il 
faudrait maintenant comparer cette m&#233;thode avec des m&#233;thodes d&#8217;apprentissage d&#233;j&#224; 
existantes comme les r&#233;seaux connexionnistes afin d&#8217;en voir la r&#233;elle efficacit&#233; dans l&#8217;optique 
de traitements sans ressource. 
</p>
<p>Nous envisageons bien s&#251;r de d&#233;velopper et d&#8217;am&#233;liorer cette m&#233;thode notamment au travers 
d&#8217;une collaboration accrue entre Fran&#231;ois RIOULT et moi-m&#234;me, chacun de nous amenant 
ses connaissances sp&#233;cifiques et son regard neuf sur le domaine de l&#8217;autre. 
</p>
<p>R&#233;f&#233;rences 
Ben Yahia S., Cherif C. L., Mineau G., Jaoua A. (2003), Actes des 3&#232;me EGC, 131-143. 
</p>
<p>Bourigault Didier (2002), Upery : un outil d'analyse distributionnelle &#233;tendue pour la 
construction d&#8217;ontologies &#224; partir de corpus, Actes TALN 2002, Nancy, pp.75-84. 
</p>
<p>Do C. (2003), Posterior Decoding for Generative Constituent-Context Grammar Induction,  
</p>
<p>Grammatical Induction Community website : http://eurise.univ-st-etienne.fr/gi/ 
</p>
<p>Klein D., Manning C. D.(2002), A Generative Constituent-Context Model for Improved 
Grammar Induction, Proceedings of the 40th Annual Meeting of ACL, 128-135. 
</p>
<p>Rioult F., Cr&#233;milleux B. (2003), Condensed Representations in Presence of Missing Values, 
Proceedings of IDA'03, LNCS 2810, p. 578-588. 
</p>
<p>Tesni&#232;re L. (1959), &#201;l&#233;ments de syntaxe structurale, Paris, Klincksieck. 
</p>
<p>Vergne  J. (2003), Un outil d'extraction terminologique endog&#232;ne et multilingue, Actes de 
TALN 2003, tome 2, 139-148. 
</p>
<p>Wolff J. G. (2003), Unsupervised Grammar Induction in a Framework of Information 
Compression by Multiple Alignment, Unification and Search 
</p>
<p>Zipf G. K. (1949), Human Behaviour and the Principle of Least Effort, New York, Harper. </p>

</div></div>
</body></html>