<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse syntaxique et granularit&#233; variable</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>Analyse syntaxique et granularit&#233; variable
</p>
<p>Tristan VanRullen
LPL-CNRS UMR 6057 - Universit&#233; de Provence
</p>
<p>29 avenue Robert Schuman - 13100 Aix-en-Provence
tristan.vanrullen@lpl.univ-aix.fr
date de soutenance pr&#233;vue : 2004
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Analyse syntaxique, granularit&#233; variable, grammaire de propri&#233;t&#233;s, shallow parsing, deep pars-
ing, densit&#233; de satisfaction
Parsing, variable granularity, property grammars, shallow parsing, deep parsing, satisfaction
density
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Il est souhaitable qu&#8217;une analyse syntaxique -en traitement automatique des langues naturelles-
soit r&#233;alis&#233;e avec plus ou moins de pr&#233;cision en fonction du contexte, c&#8217;est-&#224;-dire que sa gran-
ularit&#233; soit r&#233;glable. Afin d&#8217;atteindre cet objectif, nous pr&#233;sentons ici des &#233;tudes pr&#233;liminaires
permettant d&#8217;appr&#233;hender les contextes technique et scientifique qui soul&#232;vent ce probl&#232;me.
Nous &#233;tablissons un cadre pour les d&#233;veloppements &#224; r&#233;aliser. Plusieurs types de granularit&#233;
sont d&#233;finis. Puis nous d&#233;crivons une technique bas&#233;e sur la densit&#233; de satisfaction, d&#233;velop-
p&#233;e dans ce cadre avec des algorithmes bas&#233;s sur un formalisme de satisfaction de contraintes
(celui des Grammaires de Propri&#233;t&#233;s) ayant l&#8217;avantage de permettre l&#8217;utilisation des m&#234;mes
ressources linguistiques avec un degr&#233; de pr&#233;cision r&#233;glable. Enfin, nous envisageons les
d&#233;veloppements ult&#233;rieurs pour une analyse syntaxique &#224; granularit&#233; variable.
</p>
<p>It is gainful for a syntactic analysis - in Natural Language Processing- to be carried out with
more or less accuracy depending on the context, i.e. its granularity should be adjustable. In
order to reach this objective, we present here preliminary studies allowing, first of all, to under-
stand the technical and scientific contexts which raise this problem. We establish a framework
within which developments can be carried out. Several kinds of variable granularity are de-
fined. We then describe a technic developed within this framework using satisfaction density,
on algorithms based on a constraints satisfaction formalism (Property Grammars) and allow-
ing the use of the same linguistic resources with an adjustable degree of accuracy. Lastly, we
further consider developments towards a syntactic analysis with variable granularity.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tristan VanRullen
</p>
<p>1 Introduction
</p>
<p>Certaines applications en Traitement Automatique des Langues Naturelles s&#8217;appuient sur des
techniques d&#8217;analyse syntaxique superficielle (typiquement celles traitant des donn&#233;es volu-
mineuses), d&#8217;autres comptent sur l&#8217;analyse profonde (par exemple pour la traduction automa-
tique). Les techniques employ&#233;es dans ces deux cas sont tout &#224; fait diff&#233;rentes. La premi&#232;re se
fonde habituellement sur des m&#233;thodes stochastiques comme dans (Liberman &amp; Church, 1992),
la seconde sur des techniques symboliques (voir (Chanod, 2000)). Cependant, ceci peut con-
stituer un probl&#232;me pour des applications qui auraient besoin d&#8217;une analyse peu profonde la
plupart du temps et dans certaines situations d&#8217;une information plus d&#233;taill&#233;e. C&#8217;est typique-
ment le cas pour les syst&#232;mes de synth&#232;se vocale. De telles applications se fondent habituelle-
ment sur des analyseurs peu profonds afin de calculer les groupes intonatifs sur la base d&#8217;unit&#233;s
syntaxiques, ou plus pr&#233;cis&#233;ment sur des &#8216;chunks&#8217;: c&#8217;est l&#8217;approche suivie par Allen et Abney
dans (Allen et al., 1979), (Abney, 1991) et (Abney, 1996). Mais dans certains cas, une infor-
mation si superficielle n&#8217;est pas assez pr&#233;cise. Une solution consisterait alors &#224; employer une
analyse profonde pour quelques constructions. Un syst&#232;me mettant en oeuvre ces deux niveaux
d&#8217;analyse exige habituellement deux traitements diff&#233;rents (deux passages de l&#8217;analyseur sur
l&#8217;entr&#233;e), le second refaisant en fait la totalit&#233; du travail. De fait, il est difficile d&#8217;imaginer dans
le cadre g&#233;n&#233;ratif classique de mettre en application une technique d&#8217;analyse capable de calculer
en un seul passage des &#8216;chunks&#8217;, et dans certains cas, des expressions plus complexes avec une
organisation hi&#233;rarchique.
</p>
<p>Nous pr&#233;sentons ici un formalisme fond&#233; sur les contraintes, qui constitue une r&#233;ponse possible
&#224; ce probl&#232;me. Cette approche permet l&#8217;utilisation d&#8217;une m&#234;me ressource linguistique (c.-&#224;-d.
une grammaire unique) qui puisse &#234;tre employ&#233;e enti&#232;rement ou partiellement par l&#8217;analyseur.
Cette approche se fonde sur le fait que (1) toute l&#8217;information linguistique est repr&#233;sent&#233;e au
moyen de contraintes et (2) les contraintes sont des type r&#233;gulier. L&#8217;id&#233;e consiste alors &#224; mettre
en application une technique qui puisse se servir de quelques contraintes dans le cas de l&#8217;analyse
peu profonde, et de leur ensemble entier pour l&#8217;analyse profonde. Dans notre formalisme, les
contraintes sont organis&#233;es en diff&#233;rents types. R&#233;gler la granularit&#233; de l&#8217;analyse consiste alors
dans (1) le choix des types de contrainte devant &#234;tre satisfaits, (2) le choix du seuil de tol&#233;rance
&#224; la violation des contraintes.
</p>
<p>La premi&#232;re partie de cet article propose une r&#233;flexion sur la position de ce probl&#232;me au sein
du Traitement Automatique des Langues Naturelles. Nous d&#233;terminons un cadre d&#8217;&#233;tude pour
positionner la notion de granularit&#233; variable dans l&#8217;analyse syntaxique, que nous d&#233;finissons
de plusieurs mani&#232;res. Puis nous exposons dans une seconde partie le choix d&#8217;utiliser le for-
malisme des Grammaires de Propri&#233;t&#233;s, ses avantages principaux en termes de repr&#233;sentation
et d&#8217;ex&#233;cution pour l&#8217;implantation des algorithmes. Nous proposons enfin une technique en
cours d&#8217;implantation sur un analyseur, dans la perspective d&#8217;une analyse syntaxique &#224; granular-
it&#233; variable. Il s&#8217;agira l&#224; d&#8217;une nouvelle approche fond&#233;e sur la mesure de densit&#233; de satisfaction
que nous d&#233;finissons dont nous indiquons l&#8217;utilit&#233; pour le r&#233;glage de la granularit&#233;.
</p>
<p>2 Le probl&#232;me de la granularit&#233;
</p>
<p>Nous formulons ici les contraintes qui orientent notre travail, en s&#8217;inspirant des recommanda-
tions d&#8217; Allen (Allen et al., 1979): un syst&#232;me de synth&#232;se vocale demande des choses plut&#244;t</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique et granularit&#233; variable
</p>
<p>inhabituelles &#224; un analyseur. &#8220; Il doit avoir une large (quoique l&#233;g&#232;re autant que possible)
couverture des textes, sans restriction, plut&#244;t qu&#8217;une analyse profonde d&#8217;un domaine restreint.
L&#8217;&#233;chec de l&#8217;analyse est inacceptable dans un syst&#232;me TTS &#8221;
</p>
<p>Notre probl&#232;me est celui-ci : comment d&#233;velopper un outil d&#8217;analyse tant&#244;t superficiel, tan-
t&#244;t profond, bas&#233; sur les m&#234;mes ressources linguistiques, pouvant s&#8217;adapter &#224; de nouvelles
ressources et pouvant int&#233;grer plusieurs interpr&#233;tations pour une m&#234;me entr&#233;e ?
</p>
<p>D&#233;coupons ce probl&#232;me en plusieurs parties :
</p>
<p>&#8226; r&#233;glage de la hi&#233;rarchie des structures caract&#233;ris&#233;es (embo&#238;tement profond ou structures
plates): il nous faut un outil capable de r&#233;aliser une analyse plus ou moins profonde en
fonction du contexte,
</p>
<p>&#8226; r&#233;union des modalit&#233;s (r&#233;union s&#233;lective d&#8217;informations de plusieurs domaines -syntaxe,
prosodie, gestuelle etc. . . -): cet outil permettra de g&#233;rer des interpr&#233;tations concurrentes
pour un m&#234;me texte (par exemple un contour syntaxique et un contour prosodique),
</p>
<p>&#8226; tol&#233;rance &#224; l&#8217;agrammaticalit&#233;: lorsqu&#8217;un contexte r&#233;siste &#224; une interpr&#233;tation grammati-
cale stricte, il doit &#234;tre possible de le r&#233;interpr&#233;ter localement en &#233;tant plus tol&#233;rant sur la
grammaticalit&#233;,
</p>
<p>&#8226; modulation du d&#233;terminisme des analyses: enfin, lorsque plusieurs interpr&#233;tations coex-
istent localement, en fonction des n&#233;cessit&#233;s et des finalit&#233;s (li&#233;es au contexte et &#224; la vis&#233;e
applicative), il doit &#234;tre possible de pr&#233;f&#233;rer une interpr&#233;tation d&#233;terministe ou a contrario
de laisser l&#8217;ambigu&#239;t&#233; pr&#233;sente.
</p>
<p>Ce cadre englobe des notions usuelles dans le domaine de l&#8217;analyse syntaxique. Unifier ces
notions n&#8217;est utile que dans l&#8217;optique d&#8217;une prise en compte simultan&#233;e de leurs int&#233;r&#234;ts. C&#8217;est
ce que nous tentons de faire dans la seconde partie de cette &#233;tude.
</p>
<p>3 Choix des grammaires de propri&#233;t&#233;s
</p>
<p>La notion de contraintes a une importance cruciale en linguistique, voir par exemple (Maruyama,
1990), (Pollard, 1996), (Bouma et al., 2001). Les th&#233;ories r&#233;centes (du paradigme de l&#8217;analyse
par contraintes &#224; celui des Principes et Param&#232;tres) se fondent sur cette notion. Un des int&#233;r&#234;ts
principaux de l&#8217;emploi des contraintes r&#233;side dans la possibilit&#233; de repr&#233;senter n&#8217;importe quel
genre d&#8217;information (tr&#232;s g&#233;n&#233;rale aussi bien que la locale ou contextuelle) &#224; l&#8217;aide d&#8217;un disposi-
tif unique. Nous adoptons pour la technique pr&#233;sent&#233;e plus bas le formalisme des Grammaires
de Propri&#233;t&#233;s, d&#233;crit en (B&#232;s &amp; Blache, 1999) ou (Blache, 2001), qui permet de concevoir et de
repr&#233;senter toute l&#8217;information linguistique en termes de contraintes sur des objets linguistiques.
Dans cette approche, les contraintes sont vues comme des relations entre deux (ou plus) objets.
En adaptant une proposition de B&#232;s (1999), l&#8217;ensemble des contraintes suivantes participe &#224; la
description d&#8217;un syntagme: lin&#233;arit&#233;, d&#233;pendance, obligation, exclusion, exigence et unicit&#233;.
</p>
<p>La figure suivante esquisse leurs r&#244;les respectifs, illustr&#233;s avec quelques exemples pour le SN.
</p>
<p>&#192; la diff&#233;rence d&#8217;autres approches comme la th&#233;orie d&#8217;optimalit&#233;, pr&#233;sent&#233;e dans (Prince &amp;
Smolensky, 1993), il n&#8217;existe aucune hi&#233;rarchie entre elles et on peut choisir, selon les besoins,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tristan VanRullen
</p>
<p>Contrainte Definition Exemple pour le SN
Lin&#233;arit&#233; (&lt;) Pr&#233;c&#233;dence lin&#233;aire Det &lt; N; Det &lt; AP;
</p>
<p>AP &lt; N; N &lt; PP
D&#233;pendance (&#8594;) D&#233;pendance entre cat&#233;gories Det&#8594; N; AP&#8594; N; PP&#8594; N
Obligation (Oblig) Ensemble de cat&#233;gories obligatoires et
</p>
<p>uniques. Une seule de ces cat&#233;gories doit
&#234;tre r&#233;alis&#233;e dans un syntagme.
</p>
<p>Oblig(NP) = {N, Pro, AP}
</p>
<p>Exclusion (6=) Restriction de cooccurrence entre des en-
sembles de cat&#233;gories
</p>
<p>N 6= Pro; N[prop] 6= Det
</p>
<p>Exigence (&#8658;) cooccurrence obligatoire entre des ensem-
bles de cat&#233;gories
</p>
<p>N[com]&#8658; Det
</p>
<p>Unicit&#233; (Uniq) Cat&#233;gories uniques dans un syntagme Uniq(NP) = {N, Det}
</p>
<p>Table 1: D&#233;finition des propri&#233;t&#233;s
</p>
<p>de v&#233;rifier l&#8217;ensemble entier de contraintes ou seulement un sous-ensemble. Ce qui est in-
t&#233;ressant est que certaines contraintes comme la lin&#233;arit&#233; fournissent des indications en termes
de fronti&#232;res, comme d&#233;crit par exemple dans (Blache, 2001). Il s&#8217;ensuit que la v&#233;rification
de ce sous-ensemble de contraintes peut constituer une technique de parenth&#233;sage. La v&#233;ri-
fication de plus de contraintes en addition &#224; la lin&#233;arit&#233; permet de raffiner l&#8217;analyse. Enfin,
la m&#234;me technique d&#8217;analyse (satisfaction de contraintes) peut &#234;tre employ&#233;e pour des anal-
yses peu profondes et des analyses profondes. Pour &#234;tre plus pr&#233;cis, en utilisant les m&#234;mes
ressources linguistiques (lexique et grammaire), nous proposons une technique qui permette de
choisir la granularit&#233; de l&#8217;analyse. Une premi&#232;re approche de la s&#233;lection de granularit&#233; a fait
l&#8217;objet des travaux d&#233;taill&#233;s dans (Balfourier et al., 2002), (Blache &amp; Van Rullen, 2002). Il
s&#8217;agissait d&#8217;une technique de multiplexage permettant la fusion des r&#233;sultats de plusieurs anal-
yses obtenues gr&#226;ce aux grammaires de propri&#233;t&#233;s. L&#8217;inconv&#233;nient de cette m&#233;thode r&#233;sidait
dans l&#8217;obligation de r&#233;aliser plusieurs passages sur la m&#234;me entr&#233;e. La technique que nous
introduisons ci-dessous permet de s&#8217;en affranchir.
</p>
<p>4 Mesure de densit&#233; de satisfaction
</p>
<p>L&#8217;analyseur bas&#233; sur les contraintes dans le formalisme des Grammaires de Propri&#233;t&#233;s, dont
nous parlons &#224; pr&#233;sent, est en cours de d&#233;veloppement. Nous ne pouvons donc pas encore en
donner une &#233;valuation. Toutefois, les id&#233;es qui y sont introduites se positionnent parfaitement
dans le cadre que nous mettons en place. Au prix d&#8217;une formalisation compl&#232;te de la s&#233;mantique
des grammaires de propri&#233;t&#233;s (voir &#224; ce propos (Van Rullen et al., 2003)), il a &#233;t&#233; possible
d&#8217;&#233;crire un analyseur capable d&#8217;une part d&#8217;analyser un texte au crible de plusieurs grammaires
simultan&#233;ment et d&#8217;autre part d&#8217;indiquer le degr&#233; de grammaticalit&#233; des structures construites.
Cet outil se place autant dans le cadre &#233;labor&#233; ici que dans la perspective cognitive d&#233;crite
dans (Blache, 2003). Nous ne d&#233;crivons ici qu&#8217;un des principes en oeuvre dans cet analyseur, la
densit&#233; de satisfaction, qui permet de r&#233;gler la granularit&#233; des constructions en contexte: Chaque
cat&#233;gorie caract&#233;ris&#233;e au cours d&#8217;une analyse porte deux valeurs qui mesurent sa densit&#233; de
satisfaction locale et sa densit&#233; de satisfaction propag&#233;e.
</p>
<p>&#8226; au cours de l&#8217;analyse, pour chaque cat&#233;gorie caract&#233;ris&#233;e, la quantit&#233; de propri&#233;t&#233;s satis-
faites et la quantit&#233; de propri&#233;t&#233;s enfreintes est comptabilis&#233;e, ce qui d&#233;finit une mesure
de la densit&#233; de satisfaction locale d&#8217;une cat&#233;gorie.
</p>
<p>&#8226; lorsqu&#8217;une cat&#233;gorie peut &#224; son tour caract&#233;riser un groupe de cat&#233;gories, elle h&#233;rite de la</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique et granularit&#233; variable
</p>
<p>moyenne des densit&#233;s de ses constituants imm&#233;diats, ce qui d&#233;finit la notion de densit&#233;
de satisfaction propag&#233;e.
</p>
<p>L&#8217;exemple donn&#233; ci-dessous illustre ce proc&#233;d&#233;. Dans cet exemple, une propri&#233;t&#233; de d&#233;pen-
</p>
<p>dance en genre est enfreinte dans le second SN. Cette violation n&#8217;interdit pas de consid&#233;rer un
SN satisfait &#224; 87%. L&#8217;information est propag&#233;e au SV et &#224; la phrase E, qui du point de vue
de ses constituants imm&#233;diats est satisfaite &#224; 100%, mais seulement &#224; 97% du point de vue
de l&#8217;ensemble de ses sous-constituants. En autorisant ou en interdisant des constructions au
dessous d&#8217;un certain seuil de satisfaction, cet analyseur recouvre donc les quatre possibilit&#233;s de
r&#233;glage de granularit&#233; pr&#233;sent&#233;es dans notre r&#233;flexion initiale:
</p>
<p>&#8226; r&#233;glage de la hi&#233;rarchie des structures caract&#233;ris&#233;es, en jouant sur le seuil de propagation
de la densit&#233; de satisfaction.
</p>
<p>&#8226; r&#233;union des modalit&#233;s 1,
</p>
<p>&#8226; tol&#233;rance &#224; l&#8217;agrammaticalit&#233; en &#233;tant permissif sur les seuils de densit&#233; propag&#233;e et lo-
cale,
</p>
<p>&#8226; modulation du d&#233;terminisme des analyses 2.
</p>
<p>Des perspectives en relation avec l&#8217;importance relative des seuils &#224; attribuer aux diff&#233;rents types
de propri&#233;t&#233;s sont offertes par les domaines psycho-linguistiques et les sciences cognitives, qui
mettent en avant l&#8217;importance de certains types de contraintes par rapport &#224; d&#8217;autres dans le
processus de compr&#233;hension des textes. On se r&#233;f&#233;rera par exemple &#224; (Winograd, 1983).
</p>
<p>5 Perspectives et conclusions
</p>
<p>Le formalisme bas&#233; sur la r&#233;solution de contraintes propos&#233; ici rend possible le r&#233;glage de
granularit&#233;, depuis une simple d&#233;tection des fronti&#232;res jusqu&#8217;&#224; une analyse profonde et non
d&#233;terministe, via une analyse superficielle et d&#233;terministe. Nous d&#233;finissons ainsi la notion de
technique &#224; granularit&#233; variable.
</p>
<p>1cette id&#233;e, qui ne fait pas intervenir la densit&#233; de satisfaction, est d&#233;battue dans un article &#224; para&#238;tre (Gu&#233;not &amp;
Bellengier, 2004)
</p>
<p>2une heuristique g&#233;n&#233;rale portant sur ce point est incluse dans l&#8217;analyseur, mais ne peut pour des raisons de
place, &#234;tre pr&#233;sent&#233;e ici</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tristan VanRullen
</p>
<p>La technique bas&#233;e sur la densit&#233; de satisfaction est prometteuse: on peut imaginer &#224; court terme
une automatisation du r&#233;glage de granularit&#233; en fonction des besoins guid&#233;s par le contexte
textuel.
</p>
<p>La possibilit&#233; de r&#233;gler le niveau de granularit&#233; en fonction des donn&#233;es &#224; traiter ou de l&#8217;application
concern&#233;e par ce traitement se pr&#233;sente comme un r&#233;el progr&#232;s, mais il reste encore &#224; d&#233;ter-
miner dans quel contexte et de quelle mani&#232;re le contexte peut dicter, diriger, cette s&#233;lection
de granularit&#233;. Des &#233;l&#233;ments de r&#233;ponse sont d&#233;j&#224; sensibles dans les travaux r&#233;alis&#233;s, mais une
formalisation syst&#233;matique de ce probl&#232;me reste &#224; d&#233;velopper.
</p>
<p>R&#233;f&#233;rences
ABNEY S. (1991). Parsing by chunks. In R. BERWICK, S. ABNEY &amp; C. TENNY, Eds., Principle-
based parsing, p. 257&#8211;278. Dordrecht: Kluwer Academic Publishers.
ABNEY S. (1996). Partial parsing via finite-state calculus. In ESSLLI&#8217;96 Robust Parsing Workshop.
ALLEN J., HUNNINCUTT S., CARLSON R. &amp; GRANSTR&#214;M B. (1979). Mitalk-79: The 1979 mit text-
to-speech system. In WOLF &amp; KLATT, Eds., Speech Communications Papers Presented at the 97th
Meeting of the ASA, p. 507&#8211;510.
BALFOURIER J.-M., BLACHE P. &amp; VAN RULLEN T. (2002). From shallow to deep parsing using
constraint satisfaction. In COLING&#8217;2002, p. 36&#8211;42.
B&#200;S G. &amp; BLACHE P. (1999). Propri&#233;t&#233;s et analyse d&#8217;un langage. In TALN&#8217;99.
BLACHE P. (2001). Les Grammaires de Propri&#233;t&#233;s : des contraintes pour le traitement automatique des
langues naturelles. Paris: Herm&#232;s Sciences Publications.
BLACHE P. (2003). Vers une th&#233;orie cognitive de la langue bas&#233;e sur les contraintes. In in actes de
TALN-2003.
BLACHE P. &amp; VAN RULLEN T. (2002). An evaluation of different symbolic shallow parsing techniques.
In in proceedings of LREC-02.
BOUMA G., MALOUF R. &amp; SAG I. (2001). Natural Language and Linguistic Theory, volume 19:1,
chapter Satisfying Constraints on Extraction and Adjunction. Kluwer.
CHANOD J.-P. (2000). Robustness in Language Technology, chapter Robust Parsing and Beyond.
Kluwer.
GU&#201;NOT M. &amp; BELLENGIER E. (2004). Quelques principes pour une grammaire multimodale non-
modulaire du fran&#231;ais. In soumis &#224; RECITAL 2004.
LIBERMAN M. &amp; CHURCH K. (1992). Advances in Speech Signal Processing, chapter Text analysis
and word pronunciation in text-to- speech synthesis, p. 791&#8211;831. Furui, s., sondhi, m.m. (eds) edition.
MARUYAMA H. (1990). Structural disambiguation with constraint propagation. In ACL&#8217;90.
POLLARD K. (1996). The nature of constraint-based grammar. In PACLIC Conference, reprinted in
Constructions: an HPSG Perspective, ESSLLI&#8217;98 Lecture Notes.
PRINCE A. &amp; SMOLENSKY P. (1993). Optimality Theory: Constraint Interaction in Generative Gram-
mar. Rapport interne, Rutgers University Centre for Cognitive Science.
VAN RULLEN T., GU&#201;NOT M. &amp; BELLENGIER E. (2003). Formal representation of property gram-
mars,. In proceedings of ESSLLI 2003 Student Session.
WINOGRAD T. (1983). Language as a cognitive processs &#8212; Vol. 1 : Syntax. Reading (Mass.): Addison
Wesley.</p>

</div></div>
</body></html>