<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Quelques principes pour une grammaire multimodale non-modulaire du fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>Quelques principes pour une grammaire multimodale
non-modulaire du fran&#231;ais
</p>
<p>Marie-Laure Gu&#233;not &amp; Emmanuel Bellengier
Laboratoire Parole et Langage
</p>
<p>CNRS &#8211; Universit&#233; de Provence
29 avenue Robert Schuman 13621 Aix-en-Provence cedex 1
</p>
<p>{mlg, bellengier}@lpl.univ-aix.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Analyse multimodale &#8211; Linguistique formelle &#8211; D&#233;veloppement de grammaire &#8211; Grammaires
de Propri&#233;t&#233;s
</p>
<p>Multimodal analysis &#8211; Formal linguistics &#8211; Grammar development &#8211; Property Grammars
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans cet article, nous introduisons une approche de la repr&#233;sentation et de l&#8217;analyse des discours
multimodaux, bas&#233;e sur un traitement unimodulaire par contraintes. Le but de cet article est de
pr&#233;senter (i) un syst&#232;me de repr&#233;sentation des donn&#233;es et (ii) une m&#233;thode d&#8217;analyse, permet-
tant une interaction simplifi&#233;e entre les diff&#233;rentes modalit&#233;s de communication. L&#8217;avantage de
cette m&#233;thode est qu&#8217;elle permet la prise en compte rigoureuse d&#8217;informations communicatives
de natures diverses en un traitement unique, gr&#226;ce &#224; une repr&#233;sentation homog&#232;ne des objets,
de leurs relations, et de leur m&#233;thode d&#8217;analyse, selon le mod&#232;le des Grammaires de Propri&#233;t&#233;s.
</p>
<p>In this paper, we introduce an approach to multimodal discourse representation and analysis,
based on a unimodular constraint-based treatment. The aim of this paper is to present (i) a data
representation system, and (ii) an analysis method, which allow a simple interaction between
the various modalities of communication. The advantage of this method is that it allows to
rigorously take into account multi-character information within a single treatment, thanks to
a homogeneous representation of the objects, of their relations, and of their analysis method,
according to the Property Grammars formalism.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not &amp; Emmanuel Bellengier
</p>
<p>1 Introduction
</p>
<p>La communication humaine est une activit&#233; qui s&#8217;effectue sur diff&#233;rents canaux ; son carac-
t&#232;re multimodal n&#8217;est plus &#224; prouver aujourd&#8217;hui1. Chaque modalit&#233; participe &#224; l&#8217;&#233;laboration du
message, et joue un r&#244;le dans son interpr&#233;tation, r&#244;le qui peut &#234;tre de renforcer ou de compl&#233;ter
les autres modalit&#233;s. La prise en compte d&#8217;informations communicatives non-linguistiques re-
v&#234;t donc une importance non n&#233;gligeable dans la construction de la signification2 d&#8217;un &#233;nonc&#233;,
puisque ne pas en tenir compte conduit immanquablement &#224; passer &#224; c&#244;t&#233; d&#8217;une partie du mes-
sage, et m&#232;ne donc &#224; des erreurs et des ambiguit&#233;s superflues.
</p>
<p>Parmi les approches multimodales suivies actuellement en TALN, on peut retenir deux fa&#231;ons
g&#233;n&#233;rales de proc&#233;der. La premi&#232;re, pr&#233;sent&#233;e par exemple dans (Landragin, 1999), consiste &#224;
effectuer des analyses s&#233;par&#233;es (parall&#232;les ou successives) d&#8217;une m&#234;me entr&#233;e, correspondant &#224;
autant de modalit&#233;s, niveaux ou domaines, avant d&#8217;en unifier les r&#233;sultats au cours d&#8217;une ultime
&#233;tape3. Autrement dit, une partie de la construction de la signification du message est effec-
tu&#233;e avant m&#234;me que les modalit&#233;s ne soient mises en relation, ce qui exclut toute possibilit&#233;
d&#8217;interaction multimodale de bas niveau.
</p>
<p>La seconde approche, propos&#233;e notamment dans (Pineda &amp; Garza, 2000) et (Godbert, 2002),
consiste &#224; traduire dans un premier temps les donn&#233;es multimodales en une entr&#233;e unimodale
linguistique, avant d&#8217;en effectuer l&#8217;analyse. Cette perspective implique d&#8217;adopter une position
th&#233;orique selon laquelle pour toute production non-linguistique et au-del&#224; pour toute production
multimodale, il existe toujours une production unimodale linguistique strictement &#233;quivalente.
De plus, les deux proc&#233;d&#233;s ne semblent pas s&#8217;appuyer sur une justification cognitive th&#233;orique :
il para&#238;t peu probable que l&#8217;interpr&#233;tation naturelle d&#8217;un message (par un humain) s&#8217;effectue en
phases successives et ind&#233;pendantes, ou par une traduction pr&#233;alable des diff&#233;rents canaux en
un seul (cf. par exemple, &#224; ce propos, (Langacker, 1999) ou (Croft &amp; Cruse, 2003)).
Dans cet article nous proposons un extrait de grammaire et la m&#233;thode d&#8217;analyse correspon-
dante, permettant de traiter en un seul passage une entr&#233;e multimodale, en se r&#233;f&#233;rant &#224; une
unique grammaire au sein de laquelle toutes les informations communicatives interagissent li-
brement, fournissant en sortie un r&#233;seau de relations entretenues par les divers &#233;l&#233;ments consti-
tutifs du message. Nous appellons cette proposition une grammaire multimodale non mo-
dulaire4 ; nous en illustrons les caract&#233;ristiques &#224; travers un exemple concret, et d&#233;taillons la
repr&#233;sentation formelle de ce type de grammaire, repr&#233;sentation charg&#233;e d&#8217;une part de mettre
en &#233;vidence l&#8217;interaction des modalit&#233;s, et d&#8217;autre part, plus g&#233;n&#233;ralement, de faire le lien entre
analyse th&#233;orique et traitement automatique.
</p>
<p>1On retrouve cette multimodalit&#233; aussi bien dans la communication inter-humaine orale (canaux verbal et
gestuel) ou &#233;crite (cha&#238;ne linguistique, mise en page), que dans le dialogue homme-machine (clavier, souris, son,
image, voire parole, clignement des yeux, etc.).
</p>
<p>2Nous entendrons ici par &#8220;signification&#8221; une repr&#233;sentation assez g&#233;n&#233;rale de l&#8217;ensemble des &#233;l&#233;ments pouvant
servir &#224; l&#8217;interpr&#233;tation d&#8217;un message. Nous nous pla&#231;ons ainsi dans un paradigme proche de celui des Grammaires
de Construction ou d&#8217;HPSG.
</p>
<p>3Il est int&#233;ressant de remarquer que ce type de proc&#233;d&#233;, modulaire, est pratiqu&#233; non seulement dans des pers-
pectives multimodales, mais aussi dans les traitements multi-domaines ou multi-niveaux de l&#8217;analyse linguistique,
par exemple dans (Bear &amp; Prince, 1990), (Hirst, 1993) ou (Pavia, 2000). De la m&#234;me fa&#231;on, on peut alors consid&#233;rer
que les quelques principes que nous proposons ici peuvent aussi bien s&#8217;appliquer &#224; ces cas de figure.
</p>
<p>4Ce type d&#8217;approche a &#233;t&#233; &#233;galement introduit dans (Bellengier, 2003), article dans lequel les fondements d&#8217;une
Grammaire de Propri&#233;t&#233; Multimodale sont propos&#233;s ainsi qu&#8217;une r&#233;flexion sur la n&#233;cessit&#233; de prendre en compte
des donn&#233;es h&#233;t&#233;rog&#232;nes et de qualifier les relations entre les niveaux.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelques principes pour une grammaire multimodale non-modulaire du fran&#231;ais
</p>
<p>2 Transcription segment&#233;e de corpus audiovisuel
</p>
<p>Pour analyser un corpus, il est utile et traditionnel en linguistique comme en TALN de l&#8217;avoir
pr&#233;alablement transcrit et segment&#233;. Nous utilisons donc comme entr&#233;e de nos analyses un do-
cument qui contient non seulement la repr&#233;sentation &#233;crite des donn&#233;es, d&#233;coup&#233;es en unit&#233;s
atomiques de chaque modalit&#233;, mais &#233;galement l&#8217;affectation &#224; celles-ci d&#8217;un certain nombre de
caract&#233;ristiques propres. Il est cependant important de souligner que ce &#8220;document&#8221; que nous
cr&#233;ons et manipulons repr&#233;sente une abstraction par rapport &#224; la langue elle-m&#234;me, contraire-
ment &#224; ce qui est g&#233;n&#233;r&#233; dans l&#8217;approche de (Pineda &amp; Garza, 2000). Il s&#8217;agit d&#8217;une transcription
(et non d&#8217;une traduction) qui est &#224; un message de langue, ce qu&#8217;un fichier audiovisuel informa-
tique est &#224; la sc&#232;ne r&#233;elle correspondante.
</p>
<p>Les corpus que nous avons utilis&#233;s pour notre pr&#233;sent exemple sont de courts extraits de dia-
logues libres authentiques, enregistr&#233;s &#224; l&#8217;Universit&#233; de Provence. Le protocole d&#8217;exp&#233;rimenta-
tion imposait aux sujets de choisir un th&#232;me de discussion parmi trois et d&#8217;en d&#233;battre imm&#233;-
diatement pendant dix minutes.
</p>
<p>Chaque unit&#233; d&#233;coup&#233;e, index&#233;e et repr&#233;sent&#233;e en r&#233;f&#233;rence aux donn&#233;es audiovisuelles5 cor-
respond &#224; un &#233;l&#233;ment atomique appel&#233; objet. La figure 1 illustre sous forme de structures de
traits, l&#8217;objet linguistique ouais tir&#233; de l&#8217;exemple 1, et un objet gestuel simultan&#233; (un hochement
de t&#234;te).
(1) Loc.A : &#231;a fait partie des 10 minutes le choix du sujet ou
</p>
<p>Loc.B : ouais ben je sais pas quel quel sujet toi tu as
Objet verbal (ouais) Objet gestuel (hochement de t&#234;te)&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>ANCRE
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>LOC A
</p>
<p>TEMP
</p>
<p>[
DEBUT 4.85
FIN 5.26
</p>
<p>]
POS
</p>
<p>[
DEBUT 11
FIN 12
</p>
<p>]
UNIVERS
</p>
<p>[
DOMDEF univers
VAL x
</p>
<p>]
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
TRAITS
</p>
<p>&#63726;&#63728;MODALIT&#201; verbalCAT&#201;GORIE P
TYPE acquiescement
</p>
<p>&#63737;&#63739;
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>ANCRE
</p>
<p>&#63726;&#63727;&#63728;LOC ATEMP [DEBUT 4.91
FIN 5.77
</p>
<p>]&#63737;&#63738;&#63739;
</p>
<p>TRAITS
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63728;
MODALIT&#201; gestuel
CLASSE b&#226;ton
PARTIE t&#234;te
MOUVEMENT vertical
TYPE acquiescement
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63739;
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
</p>
<p>FIG. 1 &#8211; Structures des objets ouais et hochement de t&#234;te de l&#8217;exemple (1).
</p>
<p>On peut voir dans cette figure que chaque description d&#8217;objet est constitu&#233;e du m&#234;me ensemble
d&#8217;informations, quelle qu&#8217;en soit la modalit&#233; d&#8217;appartenance : la structure g&#233;n&#233;rale d&#8217;un objet
est compos&#233;e d&#8217;une ancre &#224; localisation multiple et d&#8217;un ensemble de traits de sp&#233;cification
cat&#233;gorielle.
</p>
<p>5Ces op&#233;rations ont &#233;t&#233; effectu&#233;es &#224; l&#8217;aide de TASX-ANNOTATOR, qui fait partie d&#8217;une suite d&#8217;outils logiciels
d&#233;velopp&#233;s &#224; l&#8217;Universit&#233; de Bielefeld en Allemagne (http ://tasxforce.lili.uni-bielefeld.de)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not &amp; Emmanuel Bellengier
</p>
<p>2.1 Ancre
</p>
<p>Plusieurs types de r&#233;f&#233;rences ou d&#8217;index sont utilis&#233;s simultan&#233;ment et optionnellement pour
localiser un m&#234;me objet, et sont rassembl&#233;s au sein de l&#8217;ANCRE (cf. figure 1). Ainsi, une unit&#233;
identifi&#233;e dans une entr&#233;e acoustique pourra &#234;tre r&#233;f&#233;renc&#233;e non seulement par sa position tem-
porelle dans le signal (TEMP dans l&#8217;illustration), mais &#233;galement par son index dans la cha&#238;ne
linguistique correspondante (POS ; cf. (Bird &amp; Liberman, 1999)). S&#8217;il s&#8217;agit en outre d&#8217;un ob-
jet r&#233;f&#233;rentiel, on peut y ajouter un troisi&#232;me attribut s&#8217;appuyant sur l&#8217;univers du discours
(UNIVERS ; cf. (Kamp &amp; Reyle, 1993)). Enfin, pour toutes les unit&#233;s on ajoutera l&#8217;identifica-
tion du locuteur qui l&#8217;a produite (LOC). Cette technique d&#8217;ancrage multiple permet de mettre
en &#233;vidence des relations, pouvant &#234;tre de natures diverses, entre des objets de domaines dis-
tincts, rep&#233;r&#233;s sur des ensembles d&#8217;axes diff&#233;rents en fonction de la nature de leurs modes de
production.
</p>
<p>Les attributs sont dot&#233;s de valeurs appartenant &#224; leurs domaines de d&#233;finition respectifs. La
d&#233;finition du domaine est essentiellement utile &#224; pr&#233;ciser l&#8217;univers du discours utilis&#233; dans le
point d&#8217;ancrage correspondant. Elle permet de tirer parti de diff&#233;rents types d&#8217;information. L&#8217;ap-
parition de cat&#233;gories aura en effet pour cons&#233;quence de compl&#233;ter les domaines de d&#233;finition
correspondants. Par exemple, en rencontrant un nouveau r&#233;f&#233;rent, celui-ci est ajout&#233; au domaine
UNIVERS de l&#8217;ancre. En revanche, l&#8217;analyse d&#8217;un d&#233;ictique ou plus g&#233;n&#233;ralement d&#8217;une quan-
tification permettra de pr&#233;ciser voire de sp&#233;cifier une seule valeur dans un contexte donn&#233; en
associant une formule (ou une valeur) &#224; un objet pr&#233;existant.
</p>
<p>2.2 Traits
</p>
<p>On regroupe dans cette structure l&#8217;ensemble des informations d&#233;finitoires caract&#233;ristiques des
objets segment&#233;s. Pour illustrer notre exemple et compte tenu de sa nature (dialogue inter-
humain oral), nous avons r&#233;f&#233;renc&#233; des objets linguistiques et des objets gestuels (cf. l&#8217;attribut
MODALIT&#201; dans la figure 1). Concernant les objets linguistiques, les informations contenues
dans les TRAITS repr&#233;sentent des informations morphologiques, lexicales et s&#233;mantiques assez
classiques. Les objets gestuels quant &#224; eux ont &#233;t&#233; identifi&#233;s en r&#233;f&#233;rence &#224; la classification des
gestes et des postures que l&#8217;on peut trouver dans (McNeill, 1992).
Apr&#232;s cette transcription-segmentation, toutes les unit&#233;s sont donc repr&#233;sent&#233;es de fa&#231;on ho-
mog&#232;ne, ce qui participe amplement &#224; leurs possibilit&#233;s d&#8217;interaction d&#232;s le d&#233;but de l&#8217;analyse.
A l&#8217;issue de celle-ci, notre structure complexe sera compl&#233;t&#233;e par une sous-structure suppl&#233;-
mentaire, que nous appellerons caract&#233;risation, et qui repr&#233;sentera l&#8217;ensemble des relations
entretenues par les diff&#233;rents objets, atomiques ou complexes. C&#8217;est ce que nous allons voir
dans la partie suivante.
</p>
<p>3 La grammaire
</p>
<p>3.1 Analyse des structures br&#232;ves d&#8217;acquiescement
</p>
<p>Le fragment de grammaire du fran&#231;ais que nous proposons afin d&#8217;illustrer notre approche traite
des structures br&#232;ves d&#8217;acquiescement (ci-apr&#232;s SBA) dans un dialogue oral. Nous motivons le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelques principes pour une grammaire multimodale non-modulaire du fran&#231;ais
</p>
<p>choix de ce ph&#233;nom&#232;ne d&#8217;abord par le fait qu&#8217;il est tr&#232;s productif en fran&#231;ais. De plus, il pr&#233;sente
un certain nombre de r&#233;gularit&#233;s de production qui nous permet d&#8217;op&#233;rer sur des situations
relativement faciles &#224; capter. Enfin, nous avons remarqu&#233; que les cas de non-congruence entre
l&#8217;apport fourni par les gestes et l&#8217;apport fourni par l&#8217;entr&#233;e lexicale permettaient de diff&#233;rencier
tr&#232;s nettement les structures d&#8217;acquiescement.
</p>
<p>Nous ne faisons pas de diff&#233;rence a priori entre les acquiescements ou retours positifs. En appa-
rence, les acquiescements sont des structures qui doivent marquer l&#8217;acceptation par un agent, du
discours d&#8217;un autre agent impliqu&#233; dans le processus discursif. L&#8217;int&#233;r&#234;t du ph&#233;nom&#232;ne est qu&#8217;il
marque profond&#233;ment le caract&#232;re coop&#233;ratif de la communication, et nous nous int&#233;ressons &#224;
la fa&#231;on dont ces &#233;l&#233;ments peuvent &#234;tre rattach&#233;s &#224; un discours ant&#233;c&#233;dent. Nous r&#233;investissons
la classification propos&#233;e par (Muller &amp; Prevot, 2003) et distinguons &#224; leur suite deux types
principaux de SBA, caract&#233;ris&#233;s par un tissu d&#8217;informations issues de modalit&#233;s diff&#233;rentes :
&#8211; les acquiescements faibles marquent que le discours a bien &#233;t&#233; per&#231;u par leur producteur,
</p>
<p>sans engager celui-ci dans le contenu du discours (i.e. sans que cela implique qu&#8217;il est d&#8217;ac-
cord avec ce qui vient d&#8217;&#234;tre dit). Ces structures sont rep&#233;r&#233;es par la production d&#8217;un mot bref
(moins de deux syllabes, par exemple oui, ou ouais, ou hm), ou d&#8217;un hochement de t&#234;te, ou
d&#8217;un clignement ostensible des yeux, ou d&#8217;une modification de la posture.
</p>
<p>&#8211; les acquiescements forts, quant &#224; eux, marquent que l&#8217;&#233;nonc&#233; produit est accept&#233; et reconnu
comme vrai par le r&#233;cepteur (i.e. qu&#8217;il est d&#8217;accord avec ce qui vient d&#8217;&#234;tre dit). Ceux-ci
prennent la m&#234;me forme que les pr&#233;c&#233;dents, &#224; ceci pr&#232;s qu&#8217;ils combinent plusieurs des pro-
ductions cit&#233;es6.
</p>
<p>L&#8217;int&#233;r&#234;t de distinguer ces deux formes est que la premi&#232;re est le simple produit d&#8217;un feedback
dialogique, alors que la deuxi&#232;me constitue l&#8217;apport d&#8217;une information suppl&#233;mentaire dans la
d&#233;finition de l&#8217;univers du discours pr&#233;sent. Leur analyse, leurs implications sont donc radica-
lement diff&#233;rentes, et il est impossible de les diff&#233;rencier uniquement en r&#233;f&#233;rence &#224; la seule
production linguistique. Cette distinction permet par la m&#234;me occasion d&#8217;expliquer pourquoi
nous nous int&#233;ressons ici uniquement aux structures br&#232;ves : en effet les structures plus longues,
constitu&#233;es notamment de plusieurs mots, correspondent le plus souvent &#224; des acquiescements
forts, et ne pr&#233;sentent pas l&#8217;ambigu&#239;t&#233; d&#8217;interpr&#233;tation que l&#8217;on vient d&#8217;&#233;voquer, celle-ci &#233;tant
lev&#233;e par le lexique employ&#233; lui-m&#234;me (comme on peut le voir dans l&#8217;exemple (2)). Nous re-
viendrons plus loin sur la diff&#233;rence impliqu&#233;e par l&#8217;analyse des structures longues et br&#232;ves, et
leurs cons&#233;quences sur le contenu de la grammaire.
</p>
<p>(2) Loc.A : ouais mais au-del&#224; faut d&#8217;abord se poser la question initiale c&#8217;est-&#224;-dire pourquoi pourquoi cette
loi ce projet de loi je veux dire quel quel est le danger qu&#8217;il y ait des anglicismes
Loc.B : ouais c&#8217;est vrai
</p>
<p>Cette classification simple ne permet pas de consid&#233;rer toutes les subtilit&#233;s de l&#8217;acquiescement.
Cependant elle permet de prendre en compte l&#8217;aspect dynamique et coop&#233;ratif du dialogue. En
outre, elle est th&#233;oriquement motiv&#233;e par un ensemble de travaux qui consid&#232;rent les struc-
tures d&#8217;engagement, d&#8217;interaction, comme des &#233;l&#233;ments fondamentaux du discours, comme par
exemple (Ginzburg &amp; Sag, 2000).
</p>
<p>6Il existe &#233;galement d&#8217;autres formes d&#8217;acquiescements forts brefs, tels que la production synchrone d&#8217;un cli-
gnement de l&#8217;oeil et d&#8217;un claquement de langue ; cependant ceux-ci ne pr&#233;sentent pas d&#8217;ambiguit&#233; possible avec
les acquiescements faibles (on ne rencontre pas de production d&#8217;un claquement de langue seul comme signe d&#8217;ac-
quiescement faible), et ils ne sont donc pas pertinents pour notre pr&#233;sente &#233;tude.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not &amp; Emmanuel Bellengier
</p>
<p>3.2 Formalisation
</p>
<p>Repr&#233;senter r&#233;guli&#232;rement une grammaire multimodale n&#233;cessite de r&#233;pondre &#224; deux questions :
comment repr&#233;senter des informations issues de modes diff&#233;rents dans une m&#234;me grammaire ?
d&#8217;une part, et comment faire interagir ces modes ? d&#8217;autre part. La r&#233;ponse aux deux questions
est unique dans notre proposition : elle est d&#8217;utiliser un formalisme capable de consid&#233;rer toutes
les modalit&#233;s sur un plan comparable.
</p>
<p>3.2.1 Choix du formalisme
</p>
<p>A la premi&#232;re question nous avons r&#233;pondu dans la section pr&#233;c&#233;dente : l&#8217;une des propri&#233;t&#233;s
requises, essentielle, du mod&#232;le est sa capacit&#233; &#224; repr&#233;senter efficacement des informations
de natures diverses. Par &#8220;efficacement&#8221;, il faut entendre que le formalisme doit &#234;tre en mesure
d&#8217;exprimer tout type d&#8217;information n&#233;cessaire &#224; l&#8217;analyse, en l&#8217;occurrence multimodale, et que
la forme des repr&#233;sentations soit adapt&#233;e au traitement envisag&#233;, en l&#8217;occurrence une analyse
non-modulaire. Le formalisme des Grammaires de Propri&#233;t&#233;s (ci-apr&#232;s GP) offre une repr&#233;sen-
tation flexible et tout &#224; fait homog&#232;ne des informations7 qui nous permet d&#8217;exprimer sous une
forme identique l&#8217;ensemble des indications pertinentes d&#8217;un &#233;nonc&#233; multimodal. Cette flexi-
bilit&#233; permet en outre de repr&#233;senter des objets intrins&#232;quement multimodaux, toujours selon
la m&#234;me forme de base. L&#8217;un des effets de ceci sera que toutes les caract&#233;ristiques d&#8217;un ob-
jet sont plac&#233;es sur le m&#234;me plan, et l&#8217;interaction (entre objets, propri&#233;t&#233;s, niveaux, domaines,
modalit&#233;s, etc.) s&#8217;op&#232;re donc tout &#224; fait naturellement.
L&#8217;int&#233;r&#234;t des GP r&#233;side aussi dans le fait que toutes les informations sont exprim&#233;es en termes
de contraintes (objets, relations et m&#233;thode d&#8217;analyse)8. Ceci nous permet d&#8217;obtenir en guise
de r&#233;sultat d&#8217;analyse, non pas une unique structure litt&#233;ralement &#8220;grammaticale&#8221; (i.e. rigou-
reusement conforme &#224; ce que la grammaire utilis&#233;e d&#233;clare), mais un ensemble d&#8217;informations
concernant les relations entretenues par les unit&#233;s et les groupes constituant notre entr&#233;e (la ca-
ract&#233;risation). Ces informations pourront &#234;tre partielles, superpos&#233;es, sans que le d&#233;roulement
de l&#8217;analyse n&#8217;en soit affect&#233;. En ceci, l&#8217;intervention de plusieurs modes de communication pour
la reconstitution du sens ne consitue pas un alourdissement du traitement &#224; effectuer, puisque
toutes les modalit&#233;s sont trait&#233;es en m&#234;me temps, comme un seul et m&#234;me ensemble d&#8217;infor-
mations.
</p>
<p>Enfin, le mod&#232;le des GP offre la possibilit&#233; de d&#233;velopper des propri&#233;t&#233;s multimodales de ma-
ni&#232;re partielle. Pour en revenir &#224; l&#8217;exemple des structures d&#8217;acquiescement longues, comme on
l&#8217;a fait remarquer pr&#233;c&#233;demment celles-ci ne pr&#233;sentent pas la m&#234;me ambiguit&#233; d&#8217;interpr&#233;tation
que les SBA, car elles sont d&#233;sambigu&#239;s&#233;es par leur seul contenu lexical ; dans ce cas de figure,
et parce qu&#8217;alors la prise en compte de gestes serait redondante (et alourdirait inutilement le
traitement), ceux-ci ne comportent pas, dans la partie de la grammaire les d&#233;crivant, de pro-
pri&#233;t&#233;s mentionnant des gestes. Ainsi l&#8217;on peut ajouter des propri&#233;t&#233;s gestuelles ou linguistico-
gestuelles pour traiter un ph&#233;nom&#232;ne particulier (les structures br&#232;ves d&#8217;acquiescement, par
exemple), sans avoir &#224; modifier le reste en cons&#233;quence9.
</p>
<p>7Cette propri&#233;t&#233; du mod&#232;le a &#233;t&#233; souvent mise en avant, comme par exemple dans (Blache, 2001).
8Nous supposons ici que le lecteur n&#8217;est pas &#233;tranger aux principes g&#233;n&#233;raux du formalisme des GP. Dans le cas
</p>
<p>contraire, il pourra se r&#233;f&#233;rer par exemple &#224; (Blache, 2001), ou concernant ce point pr&#233;cis du mod&#232;le, &#224; (Vanrullen
et al., 2003).
</p>
<p>9Dans l&#8217;absolu il est m&#234;me possible d&#8217;&#233;crire et d&#8217;utiliser une grammaire qui ne contiendrait que des propri&#233;t&#233;s
traitant des SBA.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelques principes pour une grammaire multimodale non-modulaire du fran&#231;ais
</p>
<p>3.2.2 Application
</p>
<p>La partie de grammaire que l&#8217;on a d&#233;velopp&#233;e pour traiter la disctinction entre SBA faibles
et SBA fortes10 est constitu&#233;e des propri&#233;t&#233;s pr&#233;sent&#233;es dans le tableau 1 repr&#233;sentant, dans le
formalisme des GP, les caract&#233;ristiques &#233;nonc&#233;es dans la section 3.111.
</p>
<p>EXIGENCE
(acquiescement fort)
</p>
<p>verbal.type.acquiescement &#8658; gestuel.type.acquiescement
EXCLUSION
</p>
<p>(acquiescement faible)
verbal.type.acquiescement 6= gestuel.type.acquiescement
</p>
<p>D&#201;PENDANCE (acquiescement fort)
verbal.type &#8776; gestuel.type
</p>
<p>SIMULTAN&#201;IT&#201; (acquiescement fort)l {verbal.type.acquiescement, gestuel.type.acquiescement}
</p>
<p>TAB. 1 &#8211; Propri&#233;t&#233;s traitant des SBA dans la grammaire multimodale.
</p>
<p>La propri&#233;t&#233; d&#8217;exclusion (cf. tableau 1) permet de sp&#233;cifier que dans une SBA faible, la pr&#233;sence
d&#8217;un &#233;l&#233;ment verbal de type acquiescement exclut celle d&#8217;un geste de type acquiescement dans
l&#8217;empant observ&#233;. Parall&#232;lement &#224; cette propri&#233;t&#233;, celle d&#8217;exigence indique que pour avoir une
SBA forte, la pr&#233;sence d&#8217;un &#233;l&#233;ment linguistique de type acquiescement exige celle d&#8217;un geste
de type acquiescement dans l&#8217;empant observ&#233;. Dans le but de renforcer le lien entre les &#233;l&#233;ments
consitutifs d&#8217;une SBA forte, on ajoute &#224; cet ensemble grammatical une propri&#233;t&#233; de d&#233;pendance
indiquant que dans une relation de SBA forte, la valeur du type des objets verbal et gestuel
doivent concorder (en l&#8217;occurrence, cette valeur doit &#234;tre &#8220;acquiescement&#8221;). Enfin, toujours en
r&#233;f&#233;rence &#224; la description de la section 3.1, on pose une relation de simultan&#233;it&#233; entre l&#8217;objet
verbal de type acquiescement, et l&#8217;objet gestuel de m&#234;me type, dans les SBA fortes.
Une fois d&#233;finies ces propri&#233;t&#233;s, encore faut-il pouvoir en d&#233;crire le mode de fonctionnement.
Par exemple, il existe un grand nombre de fa&#231;ons d&#8217;&#233;valuer si deux objets sont r&#233;alis&#233;s simul-
tan&#233;ment (i.e. qu&#8217;est-ce que la simultan&#233;it&#233; ? ), fa&#231;ons qui pourront mener &#224; autant de r&#233;sultats
diff&#233;rents. La d&#233;finition du mode de fonctionnement des propri&#233;t&#233;s est une part du d&#233;velop-
pement formel d&#8217;une GP, et elle revient par cons&#233;quent au d&#233;veloppeur de grammaire. Celui-ci
dispose &#224; cette fin d&#8217;un ensemble de caract&#233;ristiques d&#233;finitoires de la s&#233;mantique des propri&#233;-
t&#233;s, qui lui permettent d&#8217;en d&#233;crire le fonctionnement, et dont on peut voir l&#8217;application pour
notre cas dans le tableau 212 :
&#8211; arit&#233; exprime le nombre de membres possibles pour une propri&#233;t&#233;. Chaque membre peut lui-
</p>
<p>m&#234;me &#234;tre constitu&#233; d&#8217;un objet, ou bien d&#8217;un ensemble d&#8217;objets (li&#233;s par un &#8220;ou exclusif&#8221;),
ou encore d&#8217;un ensemble de propri&#233;t&#233;s &#233;valu&#233;es. Cette derni&#232;re fa&#231;on de pointer permet de
10Partie de grammaire qui en soi, comme on vient de le voir, peut constituer formellement &#224; elle seule une
</p>
<p>grammaire.
11Bien &#233;videmment, la version compl&#232;te formalis&#233;e de la grammaire a une forme beaucoup plus abstraite que
</p>
<p>ce que l&#8217;on peut voir dans les exemples de ce tableau. Cependant, pour des raisons &#233;videntes de lisibilit&#233;, puisqu&#8217;il
nous est bien impossible ici de faire figurer ne serait-ce qu&#8217;un extrait complet de grammaire, nous sommes dans
l&#8217;obligation d&#8217;exprimer les objets d&#233;sign&#233;s dans les propri&#233;t&#233;s par leur nom complet plut&#244;t que par une (ou un
ensemble de) repr&#233;sentation(s) formelle(s) correspondante(s).
</p>
<p>12Il s&#8217;agit ici d&#8217;un exemple simplifi&#233; ; en effet dans les GP qui ont &#233;t&#233; developp&#233;es voire impl&#233;ment&#233;es, la
s&#233;mantique des propri&#233;t&#233;s comporte d&#8217;autres caract&#233;ristiques, permettant par exemple de sp&#233;cifier combien de
fois une m&#234;me propri&#233;t&#233; peut &#234;tre satisfaite, si la satisfaction d&#8217;une propri&#233;t&#233; donn&#233;e &#224; elle seule implique la
construction d&#8217;un graphe entitaire ou non, etc. (cf. le travail en cours &#224; ce propos dans (Vanrullen et al., 2003)).
C&#8217;est l&#8217;ensemble de ces caract&#233;ristiques qui conf&#232;re aux GP leur flexibilit&#233; expressive, mais nous n&#8217;avons d&#233;velopp&#233;
ici que quelques exemples jug&#233;s significatifs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not &amp; Emmanuel Bellengier
</p>
<p>d&#233;signer un groupe par ses caract&#233;ristiques et non par son &#233;ventuelle &#233;tiquette, ce qui accentue
la robustesse de la m&#233;thode ;
</p>
<p>&#8211; mobilit&#233; permet de sp&#233;cifier si l&#8217;ordre des membres dans la propri&#233;t&#233; est pertinent ou non.
Par exemple, les membres d&#8217;une propri&#233;t&#233; de d&#233;pendance sont mobiles (puisqu&#8217;il s&#8217;agit uni-
quement de comparer deux valeurs de traits), alors que ceux d&#8217;une propri&#233;t&#233; d&#8217;exclusion ne
le sont pas (puisque c&#8217;est le premier membre qui exclut la pr&#233;sence du deuxi&#232;me et pas le
contraire) ;
</p>
<p>&#8211; disponibilit&#233; sp&#233;cifie les conditions selon lesquelles une propri&#233;t&#233; sera &#233;valu&#233;e ou non, &#233;tant
donn&#233; un empant observ&#233; ; par exemple, si les deux membres d&#8217;une propri&#233;t&#233; de d&#233;pendance
ne sont pas pr&#233;sents, il est tout &#224; fait impossible de l&#8217;&#233;valuer, et la propri&#233;t&#233; est par cons&#233;-
quent non disponible. Si les conditions indiqu&#233;es sont v&#233;rifi&#233;es, alors la propri&#233;t&#233; sera &#233;valu&#233;e
(c&#8217;est-&#224;-dire qu&#8217;on &#233;valuera sa satisfaisabilit&#233;), dans le cas contraire on consid&#233;rera qu&#8217;elle
n&#8217;est pas pertinente pour l&#8217;empant donn&#233; ;
</p>
<p>&#8211; satisfaisabilit&#233;, enfin, permet de signifier quelles conditions doivent &#234;tre remplies pour que
la propri&#233;t&#233; &#233;valu&#233;e soit satisfaite. Si les conditions sont v&#233;rifi&#233;es, alors la propri&#233;t&#233; est satis-
faite, dans le cas contraire elle est viol&#233;e.
</p>
<p>PROPRI&#201;T&#201; CARACT&#201;RISTIQUES S&#201;MANTIQUE
</p>
<p>EXIGENCE
a &#8658; b
</p>
<p>arit&#233;
mobilit&#233;
</p>
<p>disponibilit&#233;
satisfaisabilit&#233;
</p>
<p>= 2
faux
&#8707;a
&#8707;b
</p>
<p>EXCLUSION
a 6= b
</p>
<p>arit&#233;
mobilit&#233;
</p>
<p>disponibilit&#233;
satisfaisabilit&#233;
</p>
<p>= 2
faux
&#8707;a
6 &#8707;b
</p>
<p>D&#201;PENDANCE
a.trait &#8776; b.trait
</p>
<p>arit&#233;
mobilit&#233;
</p>
<p>disponibilit&#233;
satisfaisabilit&#233;
</p>
<p>= 2
vrai
&#8707;a &#8743; &#8707;b
a.trait.valeur &#8801; b.trait.valeur
</p>
<p>SIMULTAN&#201;IT&#201;
l {a, b, ..., n}
</p>
<p>arit&#233;
mobilit&#233;
</p>
<p>disponibilit&#233;
satisfaisabilit&#233;
</p>
<p>&#8805; 2
vrai
&#8707;a &#8743; &#8707;b &#8743; ... &#8743; &#8707;n
&#8707;i (max(a.d&#233;but, b.d&#233;but, ..., n.d&#233;but) &#8804; i &#8804; min(a.fin, b.fin, ..., n.fin))
</p>
<p>TAB. 2 &#8211; S&#233;mantique des propri&#233;t&#233;s utilis&#233;es pour les traitement des SBA.
</p>
<p>3.2.3 Analyses
</p>
<p>A la lumi&#232;re des propri&#233;t&#233;s d&#233;finies plus haut, nous pouvons effectuer l&#8217;&#233;tape d&#8217;analyse de
l&#8217;exemple (1). Dans cet exemple, l&#8217;objet verbal ouais et le hochement de t&#234;te cit&#233;s satisfont
la propri&#233;t&#233; de d&#233;pendance de SBA forte, ce qui constitue une premi&#232;re relation entre eux
deux. Etant produits sur le m&#234;me empant observ&#233; lors de l&#8217;analyse13, ils satisfont la propri&#233;t&#233;
d&#8217;exigence concernant la SBA forte, et par l&#224; m&#234;me violent la propri&#233;t&#233; d&#8217;exclusion de la SBA
faible, cr&#233;ant deux liens suppl&#233;mentaires. Enfin, conform&#233;ment &#224; la s&#233;mantique de la propri&#233;t&#233;
de simultan&#233;it&#233; donn&#233;e dans le tableau 2, on peut dire que le maximum des valeurs de d&#233;but des
objets (ici, 4,91 qui marque le d&#233;but du hochement) est strictement inf&#233;rieur au minimum des
valeurs de fin (ici, 5,77 qui marque la fin du hochement), ce qui signifie que les deux &#233;l&#233;ments
entrentiennent &#233;galement une relation de simultan&#233;it&#233;. Cette caract&#233;risation est illustr&#233;e dans la
</p>
<p>13La taille de cet empant peut &#234;tre, au choix, r&#233;gl&#233;e par le d&#233;veloppeur de grammaire, ou automatiquement
calcul&#233;e par le parseur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelques principes pour une grammaire multimodale non-modulaire du fran&#231;ais
</p>
<p>figure 2, et met en &#233;vidence que les deux objets constituent &#224; eux deux une SBA forte, en accord
avec les 3 propri&#233;t&#233;s qu&#8217;ils satisfont et de celle qu&#8217;ils violent.
</p>
<p>ouais hochement
</p>
<p>MODALITE = verbal
TYPE = acquiescement
</p>
<p>exigence
(SBA forte)
</p>
<p>((&#172; exclusion
(&#172; SBA faible) //
</p>
<p>d&#233;pendance
(SBA forte)
</p>
<p>55
MODALITE = gestuel
</p>
<p>TYPE = acquiescementii
</p>
<p>TEMP.D&#201;BUT = 4.85
TEMP.FIN = 5.26
</p>
<p>simultaneite
(SBA forte)
</p>
<p>33
TEMPS.D&#201;BUT = 4.91
TEMP.FIN = 5.77kk
</p>
<p>(3)
</p>
<p>FIG. 2 &#8211; Caract&#233;risation de l&#8217;exemple (1), SBA forte.
</p>
<p>Dans le cas d&#8217;une SBA faible, comme dans l&#8217;exemple (4), la caract&#233;risation aura la forme de
la figure 3. On remarque dans cet exemple que les propri&#233;t&#233;s de d&#233;pendance et de simultan&#233;it&#233;
ne figurent pas dans la caract&#233;risation ; la raison &#224; cela est que leurs conditions de disponibilit&#233;
n&#8217;ont pas &#233;t&#233; reconnues comme vraies lors de l&#8217;analyse, et que l&#8217;on n&#8217;a donc pas &#233;valu&#233; leur
satisfaisabilit&#233;.
(4) Loc.A : on consid&#232;re que c&#8217;est une horreur enfin c&#8217;est c&#8217;est une aberration
</p>
<p>Loc.B : ouais
Loc.A : de faire une loi comme &#231;a
</p>
<p>ouais (&#233;l&#233;ment inexistant)
</p>
<p>MODALITE = verbal
TYPE = acquiescement
</p>
<p>vv
</p>
<p>&#172; exigence
(&#172; SBA forte)
</p>
<p>((exclusion
(SBA faible) // MODALITE = gestuel
</p>
<p>TYPE = acquiescement
</p>
<p>(5)
</p>
<p>FIG. 3 &#8211; Caract&#233;risation de l&#8217;exemple (4), SBA faible.
</p>
<p>4 Conclusion
</p>
<p>Dans cet article nous avons pr&#233;sent&#233; une approche de l&#8217;analyse de discours multimodaux, ba-
s&#233;e sur une repr&#233;sentation rigoureuse et homog&#232;ne des informations de natures diverses. Cette
repr&#233;sentation permet d&#8217;utiliser une grammaire multimodale, au sein de laquelle est exprim&#233;e
l&#8217;int&#233;gralit&#233; des objets, de leurs relations et de leur m&#233;thode d&#8217;analyse. Les &#233;l&#233;ments peuvent
alors interagir simplement, et l&#8217;anlayse g&#233;n&#232;re un r&#233;seau de relations entretenues par les divers
objets du message.
Le fragment de grammaire formalis&#233; que nous pr&#233;sentons ici fait partie d&#8217;un projet plus large,
dans lequel nous cherchons &#224; int&#233;grer &#224; une grammaire linguistique classique (traitant princi-
palement de syntaxe et de s&#233;mantique lexicale et pr&#233;dicative) des informations multimodales,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not &amp; Emmanuel Bellengier
</p>
<p>informations qui nous l&#8217;esp&#233;rons permettront d&#8217;obtenir de meilleurs r&#233;sultats de parsing, que
ce soit d&#8217;un point de vue quantitatif (dans le cadre d&#8217;un parsing non d&#233;terministe, il s&#8217;agit de
r&#233;duire le nombre de r&#233;sultats possibles) que qualitatif (c&#8217;est-&#224;-dire de faire en sorte que les
r&#233;sultats les plus significatifs, les plus pertinents, apparaissent de fa&#231;on plus &#233;vidente dans les
r&#233;sultats).
</p>
<p>R&#233;f&#233;rences
BEAR J. &amp; PRINCE P. (1990). Prosody, syntax and parsing. In Proceedings of ACL-90.
BELLENGIER E. (2003). Un mod&#232;le multimodal bas&#233; sur les contraintes. In Proceedings of Colloque
M&#233;diation et Ing&#233;nierie des connaissances. (&#224; para&#238;tre).
BIRD S. &amp; LIBERMAN M. (1999). A formal framework for linguistic annotation. Rapport interne
MS-CIS-99-01, Dept of Computer and Information Science, University of Pennsylvania.
BLACHE P. (2001). Les grammaires de propri&#233;t&#233;s &#8212; des contraintes pour le traitement automatique des
langues naturelles. Paris : Herm&#232;s Sciences Publications.
CROFT W. &amp; CRUSE D. (2003). Cognitive linguistics. Cambridge University Press.
GINZBURG J. &amp; SAG I. (2000). Interrogative investigations. Stanford : CSLI.
GODBERT E. (2002). Reformuler des expressions multimodales. In Proceedings of TALN 2002, p.
365&#8211;370.
HIRST D. (1993). Detaching intonational phrases from syntactic structures. Linguistic Inquiry, 24(4).
KAMP H. &amp; REYLE U. (1993). From discourse to logic. Dordrecht : Kluwer.
KERBRAT-ORECCHIONI C. (1996). La conversation. Paris : Seuil.
LANDRAGIN F. (1999). Analyse de l&#8217;articulation entre parole et geste dans un corpus multimodal.
m&#233;moire de dea, Universit&#233; de Marne-La-Vall&#233;e.
LANGACKER R. (1999). Grammar and conceptualization. Walter de Gruyter.
MCNEILL D. (1992). Hand and Mind. Chicago and London : The University of Chicago Press.
MULLER P. &amp; PREVOT L. (2003). An empirical study of acknoledgement structures. In Proceedings of
DIABRUCK 2003.
PAVIA N. G. (2000). H&#233;t&#233;rog&#233;n&#233;it&#233; des corpus : vers un parseur robuste reconfigurable et adaptable. In
Proceedings of RECITAL 2000.
PINEDA L. &amp; GARZA G. (2000). A model for multimodal reference resolution. Computational Lin-
guistics, 26(2).
VANRULLEN T., GU&#201;NOT M.-L. &amp; BELLENGIER E. (2003). Formal representation of property gram-
mars. In Proceedings of ESSLLI Student Session.</p>

</div></div>
</body></html>