<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>ICHARATE : Un Atelier Logique pour les Grammaires Multimodales</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>&#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6;
</p>
<p>Un Atelier Logique pour les Grammaires Multimodales
</p>
<p>Houda ANOUN
Equipe Signes
</p>
<p>LaBRI - Bordeaux1 - INRIA Futurs
anoun@labri.fr
</p>
<p>Mots-clefs
</p>
<p>analyse syntaxique, grammaires cat&#233;gorielles, th&#233;orie des types, assistant de preuves
</p>
<p>R&#233;sum&#233;
</p>
<p>Cet article pr&#233;sente le projet de l&#8217;atelier logique &#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6; d&#233;di&#233; &#224; l&#8217;&#233;tude des gram-
maires cat&#233;gorielles multimodales. Cet atelier se pr&#233;sente sous la forme de biblioth&#232;ques pour
l&#8217;assistant de preuves Coq.
</p>
<p>1 Vers les Grammaires Multimodales
</p>
<p>1.1 Grammaires cat&#233;gorielles et calcul de Lambek
</p>
<p>Les grammaires cat&#233;gorielles sont des grammaires universelles lexicalis&#233;es permettant d&#8217;analyser
les phrases dans une vari&#233;t&#233; tr&#232;s &#233;tendue de langues naturelles. Ces grammaires partagent toutes
le m&#234;me noyau de r&#232;gles d&#8217;inf&#233;rence et diff&#233;rent uniquement au niveau du lexique qui encapsu-
le toutes les caract&#233;ristiques intrins&#232;ques &#224; la langue choisie. Le lexique n&#8217;est autre qu&#8217;une fonc-
tion qui associe &#224; chaque mot de la langue consid&#233;r&#233;e un ensemble fini de types atomiques ou
compos&#233;s qui d&#233;crivent son comportement syntaxique. Les types atomiques sont associ&#233;s aux
expressions compl&#232;tes; citons par exemple s et np qui repr&#233;sentent respectivement une phrase
et un syntagme nominal. Les types compos&#233;s quant &#224; eux sont obtenus &#224; partir des types de
base en utilisant les connecteurs &#8216;&#0;&#8217;, &#8216;&#7;&#8217; et &#8216;&#8;&#8217;. Ainsi, le type A&#0;B (resp. B&#7;A) repr&#233;sente une
entit&#233; qui attend un &#233;l&#233;ment de type B &#224; sa droite (resp. gauche) pour former une entit&#233; de type
A, en revanche, le type A&#8;B est associ&#233; &#224; un &#233;l&#233;ment obtenu en concat&#233;nant deux &#233;l&#233;ments de
types respectifs A et B.
En 1958, Joachim Lambek (Lambek58) a propos&#233; une formalisation logique des grammaires
cat&#233;gorielles en d&#233;finissant un syst&#232;me d&#233;ductif voisin de la logique lin&#233;aire (Girard89).
Les grammaires de Lambek admettent plusieurs variantes obtenues en ajoutant &#224; l&#8217;ensemble</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Houda ANOUN
</p>
<p>fix&#233; des r&#232;gles d&#8217;inf&#233;rence de base un ensemble de r&#232;gles structurelles qui permettent la gestion
des ressources linguistiques dans le contexte. Le syst&#232;me sans r&#232;gles structurelles est connu
sous le nom de NL. A partir de ce syst&#232;me on obtient le syst&#232;me L (resp. NLP) en ajoutant la
r&#232;gle d&#8217;associativit&#233; (resp. de commutativit&#233;) de l&#8217;op&#233;rateur &#8216;&#8;&#8217;.
L&#8217;int&#233;r&#234;t primordial du calcul de Lambek est qu&#8217;il entretient un lien tr&#232;s &#233;troit avec la s&#233;man-
tique de Montague (Carpenter97) alors que c&#8217;est loin d&#8217;&#234;tre le cas pour un grand nombre de
mod&#232;les linguistiques tels les grammaires de d&#233;pendance et les TAG.
</p>
<p>1.2 Limitations du calcul pur de Lambek
</p>
<p>Les diff&#233;rentes variantes de la logique pure de Lambek sont certes d&#233;finies de mani&#232;re &#233;l&#233;-
gante et offrent plusieurs avantages dont la d&#233;cidabilit&#233; de recherche de preuves, toutefois, ces
derni&#232;res s&#8217;av&#232;rent trop restreintes pour l&#8217;analyse des langues naturelles. Leur faiblesse &#233;mane
de deux types de probl&#232;mes : le probl&#232;me de sous-g&#233;n&#233;ration et celui de sur-g&#233;n&#233;ration.
Le premier probl&#232;me est souvent rencontr&#233; car ces grammaires sont incapables d&#8217;analyser un
grand nombre de ph&#233;nom&#232;mes de la langue naturelle tels l&#8217;ellipse ou les d&#233;pendances crois&#233;es.
A titre d&#8217;exemple, le syst&#232;me relativement rigide L ne permet pas d&#8217;analyser l&#8217;extraction m&#233;-
diale &#224; cause de l&#8217;absence totale d&#8217;une r&#232;gle de commutativit&#233;, ainsi seule l&#8217;extraction p&#233;-
riph&#233;rique1 est analysable. Par cons&#233;quent, on peut facilement d&#233;duire dans cette logique que
&#8216;Houda vend&#8217; et &#8216;vend un livre&#8217; sont respectivement de types s&#0;np et np&#7;s, n&#233;anmoins, on ne
peut gu&#232;re attribuer le type s &#224; la phrase correcte &#8216;Le pays que Houda aime le plus est le Maroc&#8217;!
Le second probl&#232;me, en revanche, refl&#232;te la flexibilit&#233; de certains syst&#232;mes qui reconnaissent &#224;
tort des phrases agrammaticales. Ceci est le cas du syst&#232;me NLP supportant la commutativit&#233;
globale des ressources et qui est loin d&#8217;&#234;tre adapt&#233; &#224; l&#8217;analyse des langues naturelles o&#249; l&#8217;ordre
des mots est g&#233;n&#233;ralement fort important dans la construction des phrases.
Plusieurs solutions ont &#233;t&#233; propos&#233;es pour restreindre les limitations du calcul pur de Lam-
bek notamment par Glyn Morrill (Morrill94), Mark Hepple (Hepple90) et Michael Moortgat
(Moortgat97), on s&#8217;int&#233;ressera dans ce qui va suivre &#224; la derni&#232;re.
</p>
<p>1.3 Introduction aux grammaires multimodales
</p>
<p>Michael Moortgat a enrichi le syst&#232;me logique de Lambek en introduisant deux op&#233;rateurs unai-
res de contr&#244;le &#0; et &#1; et en &#233;tiquetant chacun des connecteurs logiques par des modes de com-
position. On obtient alors une famille d&#8217;op&#233;rateurs (&#0;
</p>
<p>&#0;
</p>
<p>, &#7;
&#0;
</p>
<p>, &#8;
&#0;
</p>
<p>, &#0;
&#1;
</p>
<p>, &#1;
&#1;
</p>
<p>) qui coexistent dans un
syst&#232;me multimodal rassemblant les diff&#233;rentes logiques individuelles pr&#233;c&#233;dentes. Dans un tel
syst&#232;me, les r&#232;gles d&#8217;inf&#233;rence sont partag&#233;es par tous les modes pour chacun des connecteurs
logiques, en outre, on peut d&#233;finir des r&#232;gles structurelles susceptibles d&#8217;&#234;tre appliqu&#233;es locale-
ment en pr&#233;sence de modes sp&#233;cifiques.
Les grammaires multimodales permettent de pallier les faiblesses des grammaires pures de
Lambek. En effet, la pr&#233;sence d&#8217;une vari&#233;t&#233; de modes de composition et r&#232;gles structurelles as-
soci&#233;es dans le m&#234;me syst&#232;me multimodal permet de r&#233;soudre le probl&#232;me de sous-g&#233;n&#233;ration.
En outre, la gestion locale et contr&#244;l&#233;e des ressources permet d&#8217;&#233;viter les probl&#232;mes de sur-
g&#233;n&#233;ration. Ce contr&#244;le se fait gr&#226;ce &#224; l&#8217;utilisation des modes de composition et des modalit&#233;s
&#0; et &#1;2. On peut ainsi analyser le ph&#233;nom&#232;ne de l&#8217;extraction m&#233;diale en ayant recours &#224; une
</p>
<p>1Les &#233;l&#233;ments extraits du fragment &#224; analyser sont situ&#233;s soit &#224; son extr&#234;me gauche soit &#224; son extr&#234;me droite
2Ceci s&#8217;inspire fortement de l&#8217;utilisation des exponentiels &#8216;!&#8217; et &#8216;?&#8217; dans la logique lin&#233;aire (Girard89)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Atelier ICHARATE
</p>
<p>associativi&#233; restreinte accessible uniquement en pr&#233;sence du mode a et une commutativit&#233; lo-
cale accessible en pr&#233;sence de formules d&#233;cor&#233;es par&#1;
</p>
<p>&#2;
</p>
<p>. Un tel ph&#233;nom&#232;ne linguistique est par
</p>
<p>exemple pr&#233;sent dans la phrase nominale 3 suivante: ( &#0;&#1;&#2;
&#3;
</p>
<p>&#4;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#6;
</p>
<p>&#7; &#8;
</p>
<p>&#9;
</p>
<p>&#10;
</p>
<p>&#11;
</p>
<p>&#3;
</p>
<p>&#12;
</p>
<p>&#13;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#4; &#14;
</p>
<p>&#5;
</p>
<p>&#15;
</p>
<p>&#16;
</p>
<p>&#17;
</p>
<p>&#16;
</p>
<p>&#1;
</p>
<p>&#18;
</p>
<p>&#19;
</p>
<p>&#20;
</p>
<p>&#5;
</p>
<p>&#21;
</p>
<p>&#16;
</p>
<p>&#22;
</p>
<p>&#23;
</p>
<p>&#14;
</p>
<p>&#3;
</p>
<p>&#6;
</p>
<p>&#15;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#1;
</p>
<p>&#24;
</p>
<p>&#5;
</p>
<p>&#25;
</p>
<p>&#8;
</p>
<p>&#16;
</p>
<p>&#26;&#24;
</p>
<p>&#5;
</p>
<p>&#27;
</p>
<p>&#5;
</p>
<p>&#28;&#24;
</p>
<p>&#5;
</p>
<p>&#8;). 4
</p>
<p>&#16;
</p>
<p>&#26;&#24;
</p>
<p>&#5;
</p>
<p>&#27;
</p>
<p>&#5;
</p>
<p>&#28;&#24;
</p>
<p>&#5;
</p>
<p>&#8;,&#14;
&#5;
</p>
<p>&#15;
</p>
<p>&#16;
</p>
<p>&#17; &#14;
</p>
<p>&#3;
</p>
<p>&#6;
</p>
<p>&#15;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#1;
</p>
<p>&#24;
</p>
<p>&#5;
</p>
<p>&#25;
</p>
<p>&#8;
</p>
<p>&#16;
</p>
<p>&#1;
</p>
<p>&#18;
</p>
<p>&#19;
</p>
<p>&#20;
</p>
<p>&#5;
</p>
<p>&#21;
</p>
<p>&#16;
</p>
<p>&#22;
</p>
<p>&#23;
</p>
<p>&#8;
</p>
<p>&#9;
</p>
<p>&#10;
</p>
<p>&#11;
</p>
<p>&#3;
</p>
<p>&#12;
</p>
<p>&#13;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#4;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#2;
</p>
<p>&#3;
</p>
<p>&#4;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#6;
</p>
<p>&#7;
</p>
<p>np &#0;&#1;
&#2;
</p>
<p>&#0;
</p>
<p>&#2;
</p>
<p>np &#7;
&#3;
</p>
<p>s)&#7;
&#3;
</p>
<p>(np&#0;
&#3;
</p>
<p>np) np&#7;
&#3;
</p>
<p>(np&#7;
&#3;
</p>
<p>s) s&#0;
&#3;
</p>
<p>s s&#0;
&#3;
</p>
<p>np
</p>
<p>Figure 1: Lexique
</p>
<p>L&#8217;analyse de cette phrase se fait sans beaucoup de peine. En effet, en consid&#233;rant le lexi-
que de la figure 1, on peut facilement attribuer le type np&#0;
</p>
<p>&#3;
</p>
<p>np &#224; la subordonn&#233;e relative
</p>
<p>( &#8; &#9;&#10;&#11;
&#3;
</p>
<p>&#12;
</p>
<p>&#13;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#4; &#14;
</p>
<p>&#5;
</p>
<p>&#15;
</p>
<p>&#16;
</p>
<p>&#17;
</p>
<p>&#16;
</p>
<p>&#18;
</p>
<p>&#19;
</p>
<p>&#20;
</p>
<p>&#5;
</p>
<p>&#21;
</p>
<p>&#16;
</p>
<p>&#22;
</p>
<p>&#23;
</p>
<p>&#14;
</p>
<p>&#3;
</p>
<p>&#6;
</p>
<p>&#15;
</p>
<p>&#5;
</p>
<p>&#5;
</p>
<p>&#1;
</p>
<p>&#24;
</p>
<p>&#5;
</p>
<p>&#25;
</p>
<p>&#8;) car l&#8217;&#233;l&#233;ment extrait (l&#8217;objet du verbe &#16;&#18;
&#19;
</p>
<p>&#20;
</p>
<p>&#5;
</p>
<p>&#21;
</p>
<p>&#16;
</p>
<p>&#22;
</p>
<p>&#23;) a acc&#232;s &#224; la commutativit&#233;
</p>
<p>puisqu&#8217;il est d&#233;cor&#233; par le connecteur &#1;
&#2;
</p>
<p>.
</p>
<p>Outre les avantages d&#233;j&#224; mentionn&#233;s, la logique multimodale a une capacit&#233; d&#8217;inf&#233;rence plus
grande que celle de l&#8217;union de tous les syst&#232;mes simples pris individuellement : en effet, cela
provient de la pr&#233;sence de r&#232;gles structurelles d&#8217;interaction qui assurent la communication entre
diff&#233;rents modes de composition. Ces derni&#232;res r&#232;gles augmentent le pouvoir expressif des
grammaires multimodales et leur garantissent l&#8217;analyse de plusieurs ph&#233;nom&#232;nes compliqu&#233;s
pr&#233;sents dans diff&#233;rentes langues naturelles tels l&#8217;ellipse (ex: &#8216;Mathematic is the queen of
sciences and arithmetic the queen of Mathematics&#8217;) et le regroupement de verbes en n&#233;erlandais
(verb cluster) (ex: &#8216;Mary wil plagen&#8217;) (&#8216;veut taquiner Mary&#8217;) etc...
</p>
<p>1.4 Outils pour les grammaires multimodales
</p>
<p>La manipulation des grammaires multimodales s&#8217;av&#232;re en g&#233;n&#233;ral une t&#226;che compliqu&#233;e notam-
ment en pr&#233;sence de plusieurs modes de composition et diverses r&#232;gles structurelles d&#8217;interaction
ou d&#8217;inclusion. Plusieurs outils ont &#233;t&#233; r&#233;alis&#233;s pour faciliter cette t&#226;che et automatiser l&#8217;analyse
syntaxique des phrases pour des lexiques donn&#233;s, entre autres l&#8217;outil Grail impl&#233;ment&#233; en SICS-
tus Prolog par Richard Moot. Cet analyseur est bas&#233; sur les r&#233;seaux de preuves qui repr&#233;sentent
les d&#233;rivations d&#8217;une mani&#232;re &#233;l&#233;gante sous forme de graphes (Moot02).
Certes, Grail propose maintes fonctionnalit&#233;s mais il ne permet d&#8217;effectuer des preuves qu&#8217;une
fois que les param&#232;tres de la grammaire (le lexique et les r&#232;gles structurelles) sont choisis. Il
s&#8217;av&#232;rerait utile d&#8217;avoir un outil qui permet en plus d&#8217;&#233;tablir des propri&#233;t&#233;s g&#233;n&#233;riques et r&#233;utili-
sables satisfaites par diff&#233;rentes classes de grammaires voire m&#234;me par toutes les grammaires.
L&#8217;atelier &#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6; se veut une r&#233;ponse &#224; ce besoin.
</p>
<p>2 Atelier &#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6;
</p>
<p>Je pr&#233;sente dans ce qui va suivre une description de l&#8217;atelier &#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6; que je suis en train
de r&#233;aliser en Coq avec l&#8217;aide de Pierre Cast&#233;ran, et ce dans le cadre de ma th&#232;se au LaBRI.
</p>
<p>3Phrase compos&#233;e d&#8217;un sujet et d&#8217;un attribut tandis que le verbe &#8216;&#234;tre&#8217; est implicite
4Cet exemple est pris de la langue arabe classique, sa traduction -mot &#224; mot- est : &#8216;intelligent &#233;normement
</p>
<p>Houda aime que le savant&#8217;, sa traduction en fran&#231;ais est : &#8216;Le savant que Houda aime &#233;normement est intelligent&#8217;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Houda ANOUN
</p>
<p>2.1 Noyau d&#8217;&#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6;
</p>
<p>Le noyau de l&#8217;atelier contient toutes les d&#233;finitions formelles et sp&#233;cifications n&#233;cessaires pour
la formalisation des grammaires multimodales.
Ces derni&#232;res sont formalis&#233;es de trois mani&#232;res diff&#233;rentes: sous forme axiomatique, sous
forme de calcul des s&#233;quents et sous forme de d&#233;duction naturelle. Ces trois syst&#232;mes logiques
proposent des avantages compl&#233;mentaires. En effet, le premier formalisme garantit une preuve
de coh&#233;rence et de compl&#233;tude relativement ais&#233;e. Le deuxi&#232;me quant &#224; lui, assure la d&#233;cida-
bilit&#233; de recherche de preuves. En revanche, le troisi&#232;me est le plus intuitif et le plus adapt&#233; &#224;
l&#8217;analyse s&#233;mantique.
Coq s&#8217;av&#232;re bien adapt&#233; &#224; la formalisation des diff&#233;rentes pr&#233;sentations des grammaires multi-
modales. En effet, cet assistant de preuves est bas&#233; sur le calcul des constructions inductives
(CCI) qui est une extension de la logique d&#8217;ordre sup&#233;rieur (CoqManual). Ceci permet de
repr&#233;senter les d&#233;rivations syntaxiques des diff&#233;rents formalismes pr&#233;c&#233;dents comme des struc-
tures de donn&#233;es en d&#233;finissant les op&#233;rateurs de d&#233;duction sous forme de types inductifs.
Outre les diff&#233;rents modules d&#233;di&#233;s &#224; l&#8217;analyse syntaxique, le noyau comprend un module de
calcul de la s&#233;mantique bas&#233; sur un &#1;-calcul simplement typ&#233;. Ce module permet de calculer le
&#1;-terme associ&#233; &#224; la s&#233;mantique d&#8217;une phrase en fonction des &#1;-termes associ&#233;s &#224; chacun des
mots qui la composent et ce &#224; partir de son arbre de d&#233;rivation syntaxique.
</p>
<p>2.2 Biblioth&#232;que d&#8217;&#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6;
</p>
<p>&#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6; comprend une biblioth&#232;que qui contient les preuves de plusieurs propri&#233;t&#233;s de
la logique multimodale. Ci dessous, je cite quelques unes en pr&#233;cisant leur int&#233;r&#234;t:
</p>
<p>2.2.1 Propri&#233;t&#233;s d&#233;riv&#233;es
</p>
<p>Plusieurs propri&#233;t&#233;s d&#233;riv&#233;es g&#233;n&#233;riques sont prouv&#233;es dans chacun des formalismes pr&#233;c&#233;-
dents. Ces derni&#232;res sont r&#233;utilisables dans n&#8217;importe quelle d&#233;rivation o&#249; elles peuvent &#234;tre
appliqu&#233;es comme les r&#232;gles d&#8217;inf&#233;rence de base du syst&#232;me consid&#233;r&#233;. On distingue deux
cat&#233;gories principales de ces propri&#233;t&#233;s:
</p>
<p>&#8; Propri&#233;t&#233;s totalement g&#233;n&#233;riques: Ces propri&#233;t&#233;s sont v&#233;rifi&#233;es par toute grammaire mul-
timodale. Elles peuvent ainsi &#234;tre appliqu&#233;es quelque soient le lexique et les r&#232;gles struc-
turelles choisis. Parmi ces derni&#232;res citons la propri&#233;t&#233; de mont&#233;e de type (type raising)
(&#9; A B i : A&#10; B&#0;
</p>
<p>&#0;
</p>
<p>(A&#7;
&#0;
</p>
<p>B)) aussi bien que celle d&#8217;isotonicit&#233; (&#9; A B C i: si A&#10; B alors
A&#0;
</p>
<p>&#0;
</p>
<p>C&#10; B&#0;
&#0;
</p>
<p>C). Ces deux propri&#233;t&#233;s sont prouv&#233;es une seule fois et peuvent &#234;tre utilis&#233;es
autant de fois qu&#8217;on souhaite. On peut ainsi avoir recours &#224; la propri&#233;t&#233; de mont&#233;e de type
pour effectuer la d&#233;rivation de la phrase &#8216;Saida and I watch TV&#8217;. En effet, les deux entit&#233;s
reli&#233;es par la conjonction de coordination &#8216;and&#8217; portent deux types syntaxiques distincts :
s&#0;
</p>
<p>&#4;
</p>
<p>(np &#7;
&#4;
</p>
<p>s) pour le pronom sujet &#8216;I&#8217; et np pour le nom propre &#8216;Saida&#8217;. Toutefois, gr&#226;ce
&#224; la propri&#233;t&#233; de mont&#233;e de type, on peut facilement d&#233;duire que np &#10; s&#0;
</p>
<p>&#4;
</p>
<p>(np &#7;
&#4;
</p>
<p>s) et
attribuer ainsi le type s &#224; la phrase correcte pr&#233;c&#233;dente5.
</p>
<p>&#8; Propri&#233;t&#233;s conditionn&#233;es : Ces propri&#233;t&#233;s sont d&#233;montr&#233;es pour des classes particuli&#232;res
de grammaires qui v&#233;rifient certaines contraintes.
</p>
<p>5Dans ce cas on attribue &#224; la conjonction de coordination &#8216;and&#8217; le type (X &#0;
&#0;
</p>
<p>X)&#0;
&#0;
</p>
<p>X; avec X=s&#0;
&#0;
</p>
<p>(np &#0;
&#0;
</p>
<p>s)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Atelier ICHARATE
</p>
<p>Ainsi, la propri&#233;t&#233; de composition (&#9; A B C i j: A &#0;
&#0;
</p>
<p>B &#8;
&#0;
</p>
<p>B&#0;
&#1;
</p>
<p>C &#10; A &#0;
&#1;
</p>
<p>C) peut &#234;tre
appliqu&#233;e si la grammaire en question supporte la r&#232;gle d&#8217;interaction d&#8217;associativit&#233; mixte
MA(i, j) ( &#9; A B C : (A &#8;
</p>
<p>&#0;
</p>
<p>B) &#8;
&#1;
</p>
<p>C &#11; A &#8;
&#0;
</p>
<p>(B &#8;
&#1;
</p>
<p>C)). D&#8217;autre part, on a prouv&#233; que la
r&#232;gle de coupure (&#9; &#1; &#2; A C: si &#1; &#12; A et &#2;[A] &#12; C alors &#2;[&#1;] &#12; C) est d&#233;rivable
dans le syst&#232;me logique de d&#233;duction naturelle multimodale &#224; condition que les r&#232;gles
structurelles support&#233;es v&#233;rifient la condition de Sahlqvist (Moortgat97).6 La r&#232;gle de
coupure est fort utile car elle permet tr&#232;s souvent de faciliter les preuves en ayant recours &#224;
l&#8217;application de lemmes interm&#233;diaires. Par cons&#233;quent, on peut appliquer cette propri&#233;t&#233;
pour effectuer une d&#233;rivation de la phrase &#8216;Le coeur a ses raisons que la raison ignore&#8217;
en utilisant une d&#233;rivation interm&#233;diaire permettant d&#8217;attribuer le type n&#7;n (modifieur de
nom commun) &#224; la subordonn&#233;e relative &#8216;que la raison ignore&#8217;.
</p>
<p>2.2.2 Int&#233;rop&#233;rabilit&#233; entre les trois formalismes multimodaux
</p>
<p>Les trois formalismes de la logique multimodale admettent des r&#232;gles d&#8217;inf&#233;rence diff&#233;rentes.
Toutefois, ils permettent d&#8217;engendrer le m&#234;me langage. La preuve de l&#8217;int&#233;rop&#233;rabilit&#233; entre ces
trois formalismes est effectu&#233;e gr&#226;ce &#224; des fonctions certifi&#233;es qui permettent de transformer la
d&#233;rivation d&#8217;un formalisme source &#224; un formalisme cible supportant les r&#232;gles structurelles du
premier. La preuve &#233;tant constructive, il est possible d&#8217;exporter divers th&#233;or&#232;mes prouv&#233;s dans
un formalisme et les utiliser dans d&#8217;autres formalismes sans les red&#233;montrer. A titre d&#8217;exemple,
citons le th&#233;or&#232;me d&#8217;isotonicit&#233; (cf. 2.2.1) qui est facilement d&#233;montrable en calcul des s&#233;quents
alors qu&#8217;il est relativement ardu &#224; prouver en d&#233;duction naturelle. Gr&#226;ce &#224; l&#8217;int&#233;rop&#233;rabilit&#233; en-
tre ces deux derniers formalismes, on obtient sans effort une preuve de ce th&#233;or&#232;me en d&#233;duction
naturelle et ce &#224; partir de sa preuve en calcul des s&#233;quents.
</p>
<p>2.2.3 Divers m&#233;ta-th&#233;or&#232;mes
</p>
<p>La biblioth&#232;que contient aussi les preuves de plusieurs m&#233;ta-th&#233;or&#232;mes. Ainsi, on a prouv&#233;
en utilisant les mod&#232;les de Kripke (Anoun03) que les syst&#232;mes logiques formalis&#233;s sont &#224; la
fois coh&#233;rents et complets. D&#8217;autre part, on a d&#233;montr&#233; quelques m&#233;ta-th&#233;or&#232;mes permettant
de d&#233;finir des conditions suffisantes pour la non d&#233;rivabilit&#233; d&#8217;un s&#233;quent (&#2; &#10; A) dans un
formalisme donn&#233;. Citons par exemple le m&#233;ta-th&#233;or&#232;me de la polarit&#233; qui permet d&#8217;effectuer
des preuves n&#233;gatives par un simple calcul arithm&#233;tique en ayant recours &#224; la technique de
raisonnement par reflexion (CoqArt04). En effet, si la polarit&#233; d&#8217;un atome p 7 dans &#8216;&#2;&#8217; est
diff&#233;rente de celle dans &#8216; A&#8217;, ce m&#233;ta-th&#233;or&#232;me permet de d&#233;duire que le s&#233;quent n&#8217;est pas
d&#233;montrable. Gr&#226;ce &#224; ce m&#233;ta-th&#233;or&#232;me, on d&#233;duit une preuve formelle de la non d&#233;rivabilit&#233;
du s&#233;quent (np , (np&#7;
</p>
<p>&#0;
</p>
<p>s)&#0;
&#0;
</p>
<p>np&#3;&#0; &#10; s, ce qui correspond linguistiquement &#224; l&#8217;agrammaticalit&#233;
d&#8217;une phrase compos&#233;e d&#8217;un sujet et d&#8217;un verbe transitif (ex: &#8216;Houda loves&#8217;).
</p>
<p>2.3 R&#233;sultats &amp; Perspectives
</p>
<p>L&#8217;atelier &#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6; que j&#8217;ai pr&#233;sent&#233; dans cet article est un projet en cours de r&#233;alisation.
Il constitue un outil p&#233;dagogique adress&#233; aux gens d&#233;sirant explorer la logique multimodale qui
</p>
<p>6Toutes les r&#232;gles structurelles utilis&#233;es par Moortgat dans (Moortgat97) v&#233;rifient cette condition
7Valeur alg&#233;brique repr&#233;sentant la diff&#233;rence entre le nombre d&#8217;occurrences positives et le nombre d&#8217;occurences
</p>
<p>n&#233;gatives d&#8217;un atome dans une formule ou un contexte de formules (R&#233;tor&#233;03).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Houda ANOUN
</p>
<p>est certes loin d&#8217;&#234;tre simple &#224; appr&#233;hender. L&#8217;utilisation du mode interactif de preuves de Coq
pourra certainement faciliter cette t&#226;che &#224; priori ardue.
&#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6; comprend un noyau coh&#233;rent contenant diff&#233;rentes formalisations de la logique
multimodale, les preuves de plusieurs propri&#233;t&#233;s r&#233;utilisables et g&#233;n&#233;riques portant sur ces for-
malismes aussi bien qu&#8217;un ensemble de tactiques &#233;l&#233;mentaires et un module de calcul de la
s&#233;mantique.
La prochaine piste envisageable est d&#8217;&#233;tendre la s&#233;mantique de Montague qui est bas&#233;e sur le
&#1;-calcul simplement typ&#233; pour englober aussi des types plus compliqu&#233;s (inductifs ou avec pro-
duits d&#233;pendants) et tirer ainsi profit de la richesse du calcul des constructions inductives de
Coq. D&#8217;autre part, la r&#233;alisation d&#8217;une interface graphique est pr&#233;vue, cette derni&#232;re facilitera
l&#8217;interaction entre &#0;&#1;&#2;&#3;&#4;&#3;&#5; &#6; et les utilisateurs non sp&#233;cialistes de Coq .
On envisage aussi de faire communiquer l&#8217;Atelier avec d&#8217;autres outils existants r&#233;alis&#233;s par les
membres de l&#8217;&#233;quipe Signes (Signes04) et tirer ainsi profit de leurs fonctionnalit&#233;s. Ceci est
possible car Coq est fond&#233; sur la logique intuitionniste et l&#8217;isomorphisme de Curry-Howard,
il permet ainsi d&#8217;extraire des fonctions certifi&#233;es conformes &#224; leurs sp&#233;cifications &#224; partir de
preuves constructives et ce dans un langage fonctionnel tel Ocaml.
Dans une autre direction, la formalisation des grammaires minimalistes est envisag&#233;e ainsi que
l&#8217;implantation de fonctions certifi&#233;es traduisant les d&#233;rivations de ces derni&#232;res grammaires
dans les grammaires multimodales et r&#233;ciproquement (Vermaat99).
</p>
<p>R&#233;f&#233;rences
</p>
<p>[Anoun03] Houda Anoun. R&#233;alisation d&#8217;un atelier logique sur le calcul de Lambek M&#233;moire de dea,
Universit&#233; Bordeaux 1 et ENSEIRB, 2003. http://www.labri.fr/Recherche/LLA/signes.
</p>
<p>[CoqArt04] Yves Bertot et Pierre Cast&#233;ran. Interactive Theorem Proving and Program Development:
Coq&#8217;Art: The Calculus of Inductive Constructions. Springer Verlag.
</p>
<p>[Carpenter97] Bob Carpenter. Type Logical Semantics. Massachusetts Institute of Technology, 1997.
</p>
<p>[CoqManual] The Coq Development Team. The Coq Proof Assistant, Reference Manual, Version 8.0
January 2004
</p>
<p>[Girard89] Jean-Yves Girard, Paul Taylor and Yves Lafont. Proofs and Types. Cambridge Tracts in
Theoretical Computer sciences 7, Cambridge, 1989.
</p>
<p>[Hepple90] Mark Hepple The Grammar and Processing of Order and Dependency: a Categorial Ap-
proach. PhD thesis, Edinbergh, 1990.
</p>
<p>[Lambek58] Joachim Lambek The mathematics of sentence structure 1958
</p>
<p>[Morrill94] Glyn Morrill Type Logical Grammar. Categorial Logic of Signs Kluwer,Dordrecht, 1994
</p>
<p>[Moortgat97] Michael Moortgat Categorial Type Logic Chapter 2 in Van Benthem &amp; ter Meulen (eds)
Handbook of Logic and Language, 1997
</p>
<p>[Moot02] Richard Moot. Proof nets for linguistic analysis. PhD thesis, UIL-OTS, Universiteit Utrecht,
2002.
</p>
<p>[R&#233;tor&#233;03] Christian R&#233;tor&#233; The logic of categorial grammars. 2003
</p>
<p>[Signes04] Porposition du projet Signes par l&#8217;INRIA Signes linguistiques, grammaire et sens: algorith-
mique logique de la langue http://www.labri.fr/Recherche/LLA/signes/resources/docs/signes.pdf.
</p>
<p>[Vermaat99] Willemijn Vermaat Controlling Movement:Minimalism in a deductive perspective. Thesis,
Universiteit Utrecht, April 1999</p>

</div></div>
</body></html>