<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Syst&#232;me de Question R&#233;ponse : apport de l&#8217;analyse syntaxique lors de l&#8217;extraction de la r&#233;ponse</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>Syst&#232;me de Question R&#233;ponse :
apport de l&#8217;analyse syntaxique lors de l&#8217;extraction de la
</p>
<p>r&#233;ponse
</p>
<p>Anne-Laure Ligozat
LIMSI-CNRS - Universit&#233; Paris Sud Orsay
</p>
<p>BP 133, 91403 Orsay
annlor@limsi.fr
</p>
<p>date de soutenance pr&#233;vue : 2006
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans cet article, nous pr&#233;sentons le syst&#232;me de Question R&#233;ponse QALC, et nous nous int&#233;res-
sons tout particuli&#232;rement &#224; l&#8217;extraction de la r&#233;ponse. Un appariement question-r&#233;ponse fond&#233;
sur les relations syntaxiques a &#233;t&#233; d&#233;velopp&#233;, afin d&#8217;am&#233;liorer les performances du syst&#232;me. Un
projet de g&#233;n&#233;ration de r&#233;ponses &#224; partir de plusieurs documents est &#233;galement discut&#233;.
</p>
<p>In this paper, we present the question answering system QALC, and we particularly focus on
the answer extraction. A question and answer matching based on syntactic relations has been
developed, in order to improve the results of our system. A project aiming at fusing answers
from several documents is also discussed.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Syst&#232;me de Question R&#233;ponse, analyse syntaxique, fusion de documents
Question answering system, syntactic analysis, document fusion</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure Ligozat
</p>
<p>1 Fonctionnement d&#8217;un syst&#232;me de Question R&#233;ponse
D&#233;velopp&#233;s pour r&#233;pondre aux besoins croissants de recherche d&#8217;information dans des corpus
toujours plus fournis tels que le Web, les syst&#232;mes de Question R&#233;ponse correspondent &#224; une
double probl&#233;matique : permettre &#224; l&#8217;utilisateur recherchant une information pr&#233;cise de poser
sa question en langage naturel, et extraire la r&#233;ponse &#224; cette question d&#8217;un grand nombre de
documents &#233;galement en langage naturel.
</p>
<p>La majorit&#233; des syst&#232;mes de question-r&#233;ponse fonctionnent de la fa&#231;on suivante :
&#0; la question en langage naturel est analys&#233;e, afin d&#8217;en extraire les mots-clefs qui vont per-
</p>
<p>mettre de soumettre une requ&#234;te &#224; un moteur de recherche traditionnel, ainsi que d&#8217;autres
informations qui seront utiles par la suite ;
</p>
<p>&#0; la requ&#234;te retourne un certain nombre de documents, dont les phrases, appel&#233;es candi-
dates, sont susceptibles de contenir la r&#233;ponse &#224; la question pos&#233;e. Ces phrases sont
ensuite class&#233;es en fonction de crit&#232;res d&#8217;ad&#233;quation &#224; la question ;
</p>
<p>&#0; enfin, &#224; partir des informations de la question, les r&#233;ponses possibles sont extraites des
phrases candidates et celle qui pr&#233;sente la plus forte pertinence est retourn&#233;e ;
</p>
<p>Le groupe LIR (Langues, Information, Repr&#233;sentations) a d&#233;velopp&#233; un syst&#232;me de Question
R&#233;ponse en anglais, appel&#233; QALC1, qui a particip&#233; aux campagnes d&#8217;&#233;valuation internationales
TREC2 ces derni&#232;res ann&#233;es, arrivant 9&#232;me sur 34 en 2002 ; sa version fran&#231;aise participera &#224;
l&#8217;&#233;valuation du programme EVALDA-Equer3 en 2004.
</p>
<p>Le fonctionnement de QALC, &#224; l&#8217;image des autres syst&#232;mes, peut &#234;tre d&#233;compos&#233; en plusieurs
&#233;tapes : analyse de la question, s&#233;lection de documents pertinents et reconnaissance des entit&#233;s
nomm&#233;es4, et enfin extraction de la r&#233;ponse (Ferret et al., 2003). L&#8217;architecture globale du
syst&#232;me QALC est pr&#233;sent&#233;e dans la figure 1.
La strat&#233;gie d&#8217;extraction de la r&#233;ponse, qui nous int&#233;resse plus particuli&#232;rement ici, d&#233;pend du
type de la question :
</p>
<p>&#0; si la question attend une entit&#233; nomm&#233;e d&#8217;un certain type, la r&#233;ponse sera l&#8217;entit&#233; nomm&#233;e
du type attendu la plus proche des mots de la question ;
</p>
<p>&#0; sinon, des patrons linguistiques, s&#233;mantiques ou syntaxiques, seront appliqu&#233;s aux phrases
candidates.
Si l&#8217;on a pu d&#233;terminer des contraintes s&#233;mantiques sur la r&#233;ponse, des patrons s&#233;man-
tiques seront utilis&#233;s (Dalmas, 2002). Par exemple pour la question &#8220;Name a stimulant.&#8221;,
la r&#233;ponse doit &#234;tre un hyponyme5 de &#8220;stimulant&#8221;. On va donc rechercher une r&#233;ponse
qui v&#233;rifie cette contrainte, et qui de plus soit li&#233;e par exemple par &#8220;such as&#8221; &#224; &#8220;stimu-
lant&#8221;, ce qui permettra de valider une r&#233;ponse comme &#8220;Stimulants such as Ritalin&#8221;. Les
contraintes s&#233;mantiques sont v&#233;rifi&#233;es dans la base de donn&#233;es WordNet6 ;
</p>
<p>1Question Answering program of the Language and Cognition group at LIMSI-CNRS
2Text REtrieval Conference, http://trec.nist.gov/. Pour une pr&#233;sentation de TREC 2002, voir (Voorhees, 2002)
3Evaluation lanc&#233;e par le Minist&#232;re de la Recherche, dans le cadre de l&#8217;Action Technolangue,
</p>
<p>http://www.recherche.gouv.fr/appel/2002/technolangue.htm
4Expression qui, dans un contexte particulier, identifie de fa&#231;on unique une entit&#233; telle qu&#8217;une personne, un
</p>
<p>lieu, une organisation, une date; les noms propres correspondent &#224; une sous-classe importante d&#8217;entit&#233;s nomm&#233;es.
5La r&#233;ponse doit avoir une relation de type &#8220;est un&#8221; avec &#8220;stimulant&#8221;
6http://www.cogsci.princeton.edu/ wn/. Voir aussi (Fellbaum, 1998)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me de Question R&#233;ponse :
apport de l&#8217;analyse syntaxique lors de l&#8217;extraction de la r&#233;ponse
</p>
<p>des entit&#233;s nomm&#233;es
</p>
<p>questions
</p>
<p>Phrases &#233;tiquet&#233;es
</p>
<p>R&#233;&#8722;indexation et s&#233;lection
des documents (Fastr)
</p>
<p>Cat&#233;gories des
questions, Focus,
</p>
<p>Type de la r&#233;ponse
</p>
<p>Moteur de
recherche
</p>
<p>Recherche de la r&#233;ponse:
</p>
<p>Documents
retourn&#233;scandidats
</p>
<p>Termes 
</p>
<p>Questions Corpus
</p>
<p>Reconnaissance
</p>
<p>Traitement des documents:
</p>
<p>Traitement des 
</p>
<p>S&#233;quences ordonn&#233;es de 50 caract&#232;res
</p>
<p>Documents class&#233;s
</p>
<p>&#8722; appariement question/phrase
&#8722; reconnaissance du focus
</p>
<p>&#8722; extraction de la r&#233;ponse
</p>
<p>Figure 1: Architecture du syst&#232;me QALC
</p>
<p>&#0; si aucune contrainte s&#233;mantique n&#8217;a &#233;t&#233; d&#233;termin&#233;e, des patrons syntaxiques permettront
d&#8217;apparier les phrases r&#233;ponses et la question. Ces patrons sont fond&#233;s sur l&#8217;id&#233;e intuitive
que les phrases r&#233;ponses correspondent &#224; des structures syntaxiques pr&#233;cises, la plus sim-
ple &#233;tant la reformulation &#224; l&#8217;affirmative de la question. Une &#233;tude manuelle de corpus a
permis de d&#233;gager des structures syntaxiques typiques pour chaque cat&#233;gorie de question,
qui ont &#233;t&#233; formalis&#233;es sous forme de patrons.
</p>
<p>La figure 2 pr&#233;sente des exemples de chaque strat&#233;gie. Les performances du syst&#232;me QALC
d&#233;pendent bien entendu du type de la question, et donc de la strat&#233;gie mise en &#339;uvre. Le
pourcentage de bonnes r&#233;ponses retourn&#233;es par QALC est ainsi de 29% lorsque la question
attend une entit&#233; nomm&#233;e, et de 20% pour les autres questions. Mais ces r&#233;sultats d&#233;pendent
&#233;galement des phrases r&#233;ponses disponibles dans le corpus. En effet, selon la forme de la phrase
r&#233;ponse, les strat&#233;gies de QALC seront plus ou moins adapt&#233;es.
Nous d&#233;taillerons dans la suite de cet article des probl&#232;mes qui peuvent se poser lors de l&#8217;extrac-
tion de la r&#233;ponse, et montrerons qu&#8217;une analyse syntaxique des phrases candidates peut en
r&#233;soudre certains. Puis nous donnerons les principes du module que nous avons d&#233;velopp&#233;, qui
proc&#232;de &#224; un appariement syntaxique question-r&#233;ponse, et commenterons ses possibilit&#233;s et ses
limites. Enfin, nous pr&#233;senterons une perspective un peu plus large d&#8217;utilisation de l&#8217;analyse
syntaxique des phrases, qui est la construction de r&#233;ponses &#224; partir de plusieurs documents.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure Ligozat
</p>
<p>Patron s&#233;mantique: Which political party is Lionel Jospin a member of ? (10.1408)
</p>
<p>the first secretary of the French Socialist Party Lionel Jospin
</p>
<p>Patron syntaxique: What does Knight Ridder publish ? (9.671)
</p>
<p>Knight Ridder published 30 daily newspapers ...
</p>
<p>type s&#233;mantique
</p>
<p>What do GN VB
</p>
<p>GNfocus VB GNr&#233;ponse
</p>
<p>Entit&#233; nomm&#233;e: What year was Alaska purchased ? (10.1398)
type EN = date
</p>
<p>by 1867, when Secretary of State William H. Seward negociated
</p>
<p>the purchase of Alaska from the Russians, ...
</p>
<p>Figure 2: Exemples de chacune des strat&#233;gies
</p>
<p>2 Analyse syntaxique des phrases candidates
</p>
<p>Dans certains cas, la structure des phrases candidates peut entra&#238;ner l&#8217;extraction d&#8217;une mauvaise
r&#233;ponse par QALC. Pour la question &#8220;Who killed Lee Harvey Oswald ?&#8221;, une phrase candidate
contenant la r&#233;ponse est &#8220;Jack Ruby, who killed J.F. Kennedy assassin Lee Harvey Oswald&#8221;
(Hovy et al., 2001). La s&#233;lection de l&#8217;entit&#233; nomm&#233;e la plus proche de l&#8217;objet de la question
&#8220;Lee Harvey Oswald&#8221; retourne comme r&#233;ponse &#8220;J.F. Kennedy&#8221; au lieu de &#8220;Jack Ruby&#8221;.
</p>
<p>L&#8217;analyse de la question nous donne des indices sur la fonction syntaxique de la r&#233;ponse at-
tendue, qui peuvent &#234;tre utilis&#233;s pour retourner la bonne r&#233;ponse : d&#8217;apr&#232;s la question, l&#8217;entit&#233;
nomm&#233;e attendue doit &#234;tre agent du verbe &#8220;kill&#8221;; l&#8217;analyse de la phrase r&#233;ponse montrerait que
cet agent est bien &#8220;Jack Ruby&#8221; (Monceaux et al., 2002). Des connaissances syntaxiques sur la
fonction attendue de la r&#233;ponse peuvent ainsi am&#233;liorer l&#8217;extraction de la r&#233;ponse dans QALC,
et nous nous sommes donc int&#233;ress&#233;s aux possibilit&#233;s d&#8217;utilisation de ce type de connaissances.
</p>
<p>2.1 Am&#233;lioration de la s&#233;lection des entit&#233;s nomm&#233;es
</p>
<p>Dans le cas d&#8217;une question attendant une entit&#233; nomm&#233;e, l&#8217;entit&#233; nomm&#233;e la plus proche des
mots de la question ne correspond pas toujours &#224; la r&#233;ponse, comme le montre l&#8217;exemple pr&#233;c&#233;-
dent (&#8220;Who killed Lee Harvey Oswald ?&#8221;). Des connaissances s&#233;mantiques ne pourront pas
non plus permettre de rejeter la mauvaise r&#233;ponse, car d&#8217;une part les noms propres sont peu
pr&#233;sents dans les bases de donn&#233;es s&#233;mantiques, et d&#8217;autre part lorsqu&#8217;ils le sont, ils ont sou-
vent les m&#234;mes caract&#233;ristiques s&#233;mantiques (&#224; l&#8217;exception de leurs d&#233;finitions (gloses) mais
cette information est difficile &#224; traiter). Seule une analyse syntaxique des relations de la phrase
permettra donc de montrer que &#8220;Jack Ruby&#8221; est la bonne r&#233;ponse, puisqu&#8217;il est sujet du verbe
&#8220;kill&#8221;.
</p>
<p>2.2 Un outil plus puissant que les patrons linguistiques
</p>
<p>Les patrons linguistiques pr&#233;sentent &#233;galement des failles car ils ne tiennent compte que de
l&#8217;objet de la question et de connecteurs sans tenir compte de leur environnement, ce qui peut
induire en erreur. Une expression telle que &#8220;a person has a seizure disorder or epilepsy if...&#8221;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me de Question R&#233;ponse :
apport de l&#8217;analyse syntaxique lors de l&#8217;extraction de la r&#233;ponse
</p>
<p>r&#233;pond bien &#224; la question &#8220;What is epilepsy ?&#8221;, car elle correspond au patron &#8220;GN or epilepsy&#8221;,
qui permet de rep&#233;rer une d&#233;finition de l&#8217;&#233;pilepsie. Mais ce m&#234;me patron ne permettra pas
de rejeter la phrase &#8220;Delirium tremens or epilepsy imply serious behavioral disorders&#8221; comme
une r&#233;ponse possible. Un patron s&#233;mantique ne pourra probablement pas non plus discrim-
imer les deux possibilit&#233;s de r&#233;ponse &#8220;seizure disorder&#8221; et &#8220;delirium tremens&#8221; car aucune des
deux n&#8217;est directement reli&#233;e &#224; &#8220;epilepsy&#8221; dans WordNet. Une analyse syntaxique fine pourrait
en revanche, en tenant compte du pluriel du verbe &#8220;imply&#8221;, montrer que le patron syntaxique
ne peut s&#8217;appliquer dans le second cas, et que seule la premi&#232;re r&#233;ponse doit &#234;tre retourn&#233;e.
D&#8217;autres inconv&#233;nients rendent par ailleurs d&#233;licate l&#8217;utilisation de patrons linguistiques : ceux-
ci sont doivent en effet connsid&#233;rer le plus de constructions possibles, ce qui rend leur nombre
important, leur construction fastidieuse et leur couverture n&#233;cessairement incompl&#232;te.
</p>
<p>2.3 Quels outils pour l&#8217;analyse syntaxique des phrases candidates ?
QALC effectue une analyse fine des questions gr&#226;ce &#224; un analyseur syntaxique, qui fournit en
particulier le type de la question, son objet (au sens du &#8220;focus&#8221; d&#233;fini par (Lehnert, 1978)),
le type attendu de la r&#233;ponse, entit&#233; nomm&#233;e ou type s&#233;mantique g&#233;n&#233;ral, et les relations de
d&#233;pendance de la question. Cette analyse est rendue possible notamment par la forme syntax-
ique relativement fig&#233;e des questions. En revanche, les phrases candidates sont analys&#233;es par
un &#233;tiqueteur morpho-syntaxique, qui ne retourne qu&#8217;une analyse partielle de ces phrases. Afin
d&#8217;am&#233;liorer nos connaissances sur ces phrases, un analyseur syntaxique pourra &#233;galement &#234;tre
utilis&#233;, qui nous fournira, en plus de l&#8217;&#233;tiquetage morphologique des phrases, les fonctions syn-
taxiques de leurs &#233;l&#233;ments. Nous avons choisi d&#8217;utiliser pour le syst&#232;me QALC, l&#8217;analyseur
syntaxique pour le fran&#231;ais XIP7 de Xerox, dont une description d&#233;taill&#233;e pourra &#234;tre trouv&#233;e
dans (A&#239;t-Mokthar et al., 2002).
</p>
<p>2.4 Evaluation pr&#233;liminaire des apports de l&#8217;analyse syntaxique
</p>
<p>Les quelques exemples ci-dessus prouvent que l&#8217;analyse syntaxique r&#233;soudrait certaines diffi-
cult&#233;s du syst&#232;me actuel, mais il convient de se demander si ces exemples sont marginaux ou
non. Nous avons donc men&#233; une &#233;tude manuelle sur les r&#233;ponses de QALC &#224; 106 questions
de l&#8217;&#233;valuation TREC-11, choisies al&#233;atoirement, pour tester si une analyse syntaxique sup-
pos&#233;e exacte pourrait am&#233;liorer le score de QALC. Et ce de deux fa&#231;ons : soit en confirmant les
bonnes r&#233;ponses, soit en rejetant les mauvaises. Les r&#233;sultats de notre travail sont r&#233;sum&#233;s dans
la table 1.
</p>
<p>Nombre de questions Bonnes r&#233;ponses confirm&#233;es Mauvaises r&#233;ponses rejet&#233;es R&#233;ponses justes rejet&#233;es
106 45% 12,5% 5%
</p>
<p>Table 1: R&#233;sultats de l&#8217;utilisation d&#8217;une analyse syntaxique sans erreur
</p>
<p>Les diff&#233;rentes colonnes doivent &#234;tre interpr&#233;t&#233;es ainsi : l&#8217;&#233;tude a &#233;t&#233; men&#233;e sur 106 questions
du corpus TREC-11 et sur la phrase candidate retourn&#233;e comme r&#233;ponse par QALC ; une anal-
yse syntaxique aurait confirm&#233; 45% des r&#233;ponses justes que QALC avait retourn&#233; et rejet&#233; 5%
</p>
<p>7Xerox Incremental Parsing</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure Ligozat
</p>
<p>de ces r&#233;ponses. Pour les 50% restant, la possibilit&#233; de confirmer la bonne r&#233;ponse d&#233;pend de la
finesse de l&#8217;analyseur syntaxique, et des reformulations prises en compte. Parmi les questions
pour lesquelles QALC avait donn&#233; une mauvaise r&#233;ponse, plus de 12% auraient &#233;t&#233; rejet&#233;es par
une analyse syntaxique. En conclusion, on remarque qu&#8217;un pourcentage important des r&#233;ponses
fausses aurait &#233;t&#233; rejet&#233;es avec une analyse syntaxique, et que pr&#232;s de la moiti&#233; des bonnes
r&#233;ponses auraient &#233;t&#233; confirm&#233;es, ce qui est un point tr&#232;s positif pour la fiabilit&#233; du syst&#232;me.
Int&#233;grer une analyse syntaxique repr&#233;sente donc un avantage important.
</p>
<p>Il est &#224; noter que les informations utilis&#233;es pour cette &#233;valuation sont celles que donne un analy-
seur syntaxique, en supposant qu&#8217;il ne fait aucune erreur. M&#234;me s&#8217;il n&#8217;est donc pas irr&#233;aliste de
s&#8217;attendre &#224; ces r&#233;sultats, les informations fournies par un analyseur r&#233;el comprennent souvent
des erreurs, et on peut donc s&#8217;attendre &#224; des performances moins &#233;lev&#233;es que celles pr&#233;vues par
cette &#233;tude.
</p>
<p>Cette &#233;valuation nous a &#233;galement permis de d&#233;gager les relations qui permettent, le plus sou-
vent, de rejeter une mauvaise r&#233;ponse ou de confirmer une bonne. Il conviendra donc de
s&#8217;int&#233;resser d&#8217;une part aux relations sur l&#8217;objet de la question, et d&#8217;autre part sur la fonction
syntaxique de la r&#233;ponse. Partant de ces conclusions, nous avons d&#233;velopp&#233; un prototype
d&#8217;appariement question-r&#233;ponse.
</p>
<p>2.5 Appariement syntaxique question-r&#233;ponse
</p>
<p>L&#8217;appariement que nous avons construit consiste &#224; d&#233;terminer les relations de d&#233;pendance de
la question, en particulier celles qui concernent l&#8217;objet de la question et le mot interrogatif,
puis &#224; rechercher les m&#234;mes relations dans les phrases candidates (phrase 1) ou des relations
&#233;quivalentes (phrases 2 et 3).
Le sch&#233;ma suivant expose un exemple d&#8217;appariement :
</p>
<p>Catbert is the evil H. R. Director in Dilbert.
</p>
<p>sujet attribut
The evil H. R. Director is Catbert.
</p>
<p>sujet attribut
Catbert, the evil H. R. Director in Dilbert...
</p>
<p>apposition
</p>
<p>Who is the evil H. R. Director in Dilbert ?
</p>
<p>sujet attribut
</p>
<p>Question:
</p>
<p>R&#233;ponses possibles: 
</p>
<p>Phrase 1
</p>
<p>Phrase 2
</p>
<p>Phrase 3
</p>
<p>Figure 3: Principe de l&#8217;appariement syntaxique
</p>
<p>Sera donc privil&#233;gi&#233; comme r&#233;ponse, le groupe nominal poss&#233;dant la fonction syntaxique voulue,
dans une phrase o&#249; l&#8217;objet de la question a, autant que possible, les attributs attendus. Cette ap-
proche reprend en partie la strat&#233;gie des patrons syntaxiques, mais d&#8217;une part, elle peut facile-
ment am&#233;liorer les autres traitements (la recherche d&#8217;entit&#233;s nomm&#233;es et l&#8217;utilisation de patrons</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me de Question R&#233;ponse :
apport de l&#8217;analyse syntaxique lors de l&#8217;extraction de la r&#233;ponse
</p>
<p>s&#233;mantiques), et d&#8217;autre part, elle est plus fine que des patrons.
Un module effectuant cet appariement a &#233;t&#233; d&#233;velopp&#233; et sera test&#233; sur un corpus fran&#231;ais d&#232;s
que notre syst&#232;me aura &#233;t&#233; adapt&#233; &#224; cette langue, sur un corpus de test construit par le groupe
LIR du LIMSI. N&#233;anmoins, on peut s&#8217;attendre &#224; ce que ce module fasse preuve d&#8217;une pr&#233;cision
relativement forte, mais d&#8217;un rappel faible. En effet, lorsque les relations syntaxiques de la
phrase candidate sont trop &#233;loign&#233;es de celles qui sont attendues, le module ne renvoie pas de
r&#233;ponse. Du fait des nombreuses variations contenues dans les phrases candidates, ce cas de
figure devrait se produire fr&#233;quemment.
</p>
<p>2.6 Am&#233;liorations possibles
</p>
<p>Afin de pallier les difficult&#233;s relev&#233;es pr&#233;c&#233;demment, il est tout d&#8217;abord n&#233;cessaire de pouvoir
recourir aux strat&#233;gies actuelles si ce module &#233;choue &#224; fournir une r&#233;ponse. Afin d&#8217;am&#233;liorer les
performances de notre module, on pourra &#233;galement tenter de prendre en compte les variations
s&#233;mantiques. Plusieurs pistes peuvent &#234;tre envisag&#233;es, selon le degr&#233; de variation entre les
formulations de la question et des phrases r&#233;ponses.
</p>
<p>La variation peut se situer au niveau du mot, comme dans l&#8217;exemple &#8220;- What was the name of
the dog in the Thin Man movies ? - in The Thin Man, Asta, the wire haired terrier...&#8221;. Dans
ce cas, il peut &#234;tre int&#233;ressant d&#8217;utiliser un dictionnaire des synonymes, qui pourra nous fournir
une relation entre &#8220;wire haired terrier&#8221; et &#8220;dog&#8221;, ou une base de donn&#233;es comme WordNet ou
EuroWordNet8, qui nous donnera une relation d&#8217;hyponymie entre ces deux termes.
</p>
<p>Si la variation met en jeu une reformulation de la phrase, des patrons de reformulation pourront
&#234;tre utilis&#233;s dans certains cas, permettant par exemple de passer d&#8217;une question du type &#8220;Who
invented...&#8221; &#224; une phrase contenant &#8220;the inventor of...&#8221;. Un outil comme Fastr9, d&#233;j&#224; utilis&#233;
lors de la construction de la requ&#234;te pour le moteur de recherche, pourrait engendrer ces refor-
mulations. Dans d&#8217;autres cas cependant, il est difficile de trouver le lien s&#233;mantique entre les
formulations de la question et de la r&#233;ponse (&#8220;- What school did Emmitt Smith go to ? - Emmitt
Smith, then a freshman at Escambia High School&#8221;) et de plus, la relation entre l&#8217;objet de la
question et la r&#233;ponse n&#8217;est pas toujours explicite (&#8220;- What is the chemical formula for sulphur
dioxide? - Sulphur dioxyde (SO2)&#8221;).
Enfin, l&#8217;extraction de la r&#233;ponse peut n&#233;cessiter la mise en &#339;uvre de raisonnements compl&#233;men-
taires, par exemple dans les t&#226;ches &#8220;List&#8221; ou &#8220;Context&#8221; de TREC, pour lesquelles la r&#233;ponse
attendue est une liste (&#8220;Name 7 brand names of Belgian chocolates.&#8221;) ou les questions pos&#233;es
simulent un dialogue (&#8220;- How many species of spiders are there ? How many are poisonous to
humans ? What percentage of spider bites in the US are fatal ?&#8221;). Si les scores des meilleurs sys-
t&#232;mes &#224; TREC sont tr&#232;s &#233;lev&#233;s (83% de bonnes r&#233;ponses pour LCC &#224; TREC 2002), les questions
pos&#233;es contiennent en grande majorit&#233; des questions factuelles : la distribution des questions
TREC entre 1999 et 2001 est pr&#233;sent&#233;e dans la table 2 (Moldovan et al., 2003).
Plus de 95% des questions TREC sont donc des questions factuelles ou n&#233;cessitant un raison-
nement simple, ce qui est loin d&#8217;&#234;tre repr&#233;sentatif des besoins r&#233;els en recherche d&#8217;information.
De nombreuses probl&#233;matiques demeurent. Certaines font l&#8217;objet de nouvelles t&#226;ches aux con-
f&#233;rences TREC ; d&#8217;autres pourront &#234;tre abord&#233;es par d&#8217;autres &#233;valuations comme EVALDA-
</p>
<p>8http://www.illc.uva.nl/EuroWordNet/
9Analyseur transformationnel de surface qui reconna&#238;t les occurrences et les variantes des termes en entr&#233;e
</p>
<p>(Jacquemin et al., 1997)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure Ligozat
</p>
<p>Type Nombre(%)
Factuel 985 (67.5%)
</p>
<p>Raisonnement simple 408 (27.9%)
Liste 25 (1.7%)
</p>
<p>Contextuel 42 (2.9%)
Sp&#233;culatif 0 (0.0%)
</p>
<p>Table 2: Distribution des questions TREC
</p>
<p>Equer.
</p>
<p>3 Vers des inf&#233;rences en contexte large
</p>
<p>3.1 Des r&#233;ponses r&#233;parties dans plusieurs documents
</p>
<p>Bien qu&#8217;une r&#233;ponse courte issue d&#8217;un document unique soit exig&#233;e dans les conf&#233;rences TREC,
une r&#233;ponse plus ad&#233;quate pourrait souvent &#234;tre donn&#233;e par regroupement d&#8217;informations dis-
pers&#233;es dans plusieurs passages d&#8217;un texte. En effet, pour certaines questions, les &#233;l&#233;ments de
r&#233;ponse apparaissent &#224; plusieurs endroits du texte, avec des r&#233;f&#233;rences contextuelles diff&#233;rentes
mais compatibles. Ainsi, pour la question &#8220;Quel coureur espagnol a gagn&#233; une &#233;tape du Tour de
France en 2002 ?&#8221;, les informations sur les r&#233;sultats de l&#8217;&#233;preuve et celles sur les nationalit&#233;s des
coureurs peuvent appartenir &#224; des passages diff&#233;rents du corpus. Il faudra donc pouvoir relier
ces informations qui partageront un m&#234;me contexte th&#233;matique (le Tour de France) et temporel
(en 2002). Les questions de d&#233;finition (&#8220;What is epilepsy ?&#8221;) pourraient &#233;galement b&#233;n&#233;ficier
d&#8217;un proc&#233;d&#233; permettant de regrouper diff&#233;rents &#233;l&#233;ments de r&#233;ponse.
</p>
<p>Cette possibilit&#233; de trouver la r&#233;ponse &#224; partir de textes diff&#233;rents pourrait &#233;galement &#234;tre mise
&#224; profit pour am&#233;liorer la fiabilit&#233; des r&#233;ponses. Ainsi, pour la question &#8220;Quel compositeur a
donn&#233; un concert devant la tour Eiffel le 14 Juillet 1995 ?&#8221;, dont une phrase r&#233;ponse est &#8220;Le
serveur du minist&#232;re de la culture vient d&#8217;ouvrir, sur Internet, un site consacr&#233; au concert donn&#233;
par Jean-Michel Jarre devant la tour Eiffel, le 14 juillet.&#8221;, certains &#233;l&#233;ments de la question ne
sont pas pr&#233;sents dans la phrase r&#233;ponse, puisqu&#8217;il n&#8217;y est par exemple pas pr&#233;cis&#233; que Jean-
Michel Jarre est compositeur. L&#8217;information manquante pourrait &#234;tre cherch&#233;e dans une autre
partie du corpus, ou dans un autre corpus comme le Web, afin de pouvoir accorder un score de
confiance plus important &#224; cette r&#233;ponse10.
</p>
<p>3.2 La fusion d&#8217;informations : au c&#339;ur des probl&#233;matiques de Question
R&#233;ponse
</p>
<p>L&#8217;objectif est donc d&#8217;arriver &#224; constituer des &#233;l&#233;ments de connaissance coh&#233;rents &#224; partir d&#8217;infor-
mations dispers&#233;es dans plusieurs passages. Cette probl&#233;matique est l&#8217;un des principaux d&#233;fis
pour le domaine de Question R&#233;ponse dans les prochaines ann&#233;es, selon le roadmap des con-
</p>
<p>10Cette information pourrait &#233;ventuellement &#234;tre recherch&#233;e dans une base de donn&#233;es de noms propres, mais
ne pourra &#234;tre trouv&#233;e dans WordNet, qui ne recense qu&#8217;un nombre limit&#233; de noms propres.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me de Question R&#233;ponse :
apport de l&#8217;analyse syntaxique lors de l&#8217;extraction de la r&#233;ponse
</p>
<p>f&#233;rences TREC (Burger et al., 2001). La classification des syst&#232;mes de Question R&#233;ponse selon
leurs capacit&#233;s (Moldovan et al., 2003), utilis&#233;e pr&#233;c&#233;demment, r&#233;v&#232;le &#233;galement l&#8217;importance
de pouvoir traiter ce type de probl&#232;me. Cette taxonomie se pr&#233;sente les cinq classes de sys-
t&#232;mes suivantes : syst&#232;mes capables de traiter des questions factuelles, syst&#232;mes mettant en &#339;u-
vre des m&#233;canismes de raisonnement simple, permettant par exemple de r&#233;pondre &#224; la question
&#8220;How did Socrates die ?&#8221; par la phrase r&#233;ponse &#8220;drinking poisoned wine&#8221;, syst&#232;mes capables
d&#8217;extraire la r&#233;ponse &#224; partir de plusieurs documents, les questions pouvant attendre par ex-
emple une liste comme r&#233;ponse (&#8220;Name 20 countries that produce coffee.&#8221;) ou bien une suite
d&#8217;instructions (&#8220;How do I assemble a bicycle ?&#8221;), syst&#232;mes interactifs, pouvant r&#233;pondre &#224; des
questions qui se suivent (&#8220;How long was the Varyag ?&#8221;; &#8220;How wide ?&#8221;), syst&#232;mes &#224; capacit&#233;
sp&#233;culative (&#8220;Is the US out of recession ?&#8221;).
La fusion d&#8217;informations provenant de plusieurs documents serait &#224; ranger dans la classe 3, bien
que le point de vue adopt&#233; ici soit un peu diff&#233;rent. En effet, le recours &#224; plusieurs documents
n&#8217;est consid&#233;r&#233; par (Moldovan et al., 2003) que pour construire une r&#233;ponse complexe, alors
que nous l&#8217;envisageons &#233;galement pour d&#233;terminer ou justifier la r&#233;ponse.
</p>
<p>3.3 Les diff&#233;rents niveaux de raisonnement n&#233;cessaires
</p>
<p>La mise en &#339;uvre de la fusion d&#8217;informations peut se r&#233;v&#233;ler complexe, car si dans certains cas
elle n&#233;cessite peu de raisonnements, il faudra dans d&#8217;autres cas utiliser des processus inf&#233;rentiels
complexes pour mettre en relation les diff&#233;rentes connaissances utiles.
</p>
<p>Ainsi, dans les exemples cit&#233;s plus haut (&#8220;Quel coureur espagnol a gagn&#233; une &#233;tape du Tour de
France en 2002 ?&#8221; et &#8220;Quel compositeur a donn&#233; un concert devant la tour Eiffel le 14 Juillet
1995 ?&#8221;), les &#233;l&#233;ments de r&#233;ponse sont directement pr&#233;sents dans le corpus. On peut en re-
vanche envisager que la construction de la r&#233;ponse fasse appel &#224; des connaissances s&#233;mantiques
plus pouss&#233;es : pour la question &#8220;How many casualties were reported last week in Fredonia?&#8221;
associ&#233;e aux phrases r&#233;ponses &#8220;Last Monday two people were killed on the streets of Beau-
tiville, Fredonia, after a bomb exploded&#8221; et &#8220;The terrorists murdered a family with a small child
in Fredonia last Friday, near its border with Evilonia.&#8221; (Burger et al., 2001), il faudra d&#233;ter-
miner que &#8220;casualties&#8221; regroupe les &#233;v&#233;nements &#233;voqu&#233;s par les termes &#8220;kill&#8221; et &#8220;murder&#8221;. Les
m&#233;canismes n&#233;cessaires peuvent &#233;galement faire appel &#224; un raisonnement de type causal : la
r&#233;ponse &#224; la question &#8220;Why there were hacker attacks on the computers at University of Cali-
fornia, Santa Barbara?&#8221; n&#233;cessite de relier les informations pr&#233;sentes dans les phrases r&#233;ponses
&#8220;U.S. Colleges have powerful computing facilities&#8221; et &#8220;Computer hackers need speedy proces-
sors to break security passwords&#8221; et donc d&#8217;effectuer un raisonnement causal. Les ressources
&#224; mettre en &#339;uvre peuvent donc &#234;tre de natures tr&#232;s diverses, selon les informations apport&#233;es
par le corpus.
</p>
<p>Nous nous proposons d&#8217;&#233;tudier les cas o&#249; des connaissances s&#233;mantiques devraient permettre
de r&#233;pondre aux questions. L&#8217;objectif est de d&#233;duire de la question les relations &#224; rechercher
dans le corpus, et de trouver ensuite des textes les contenant, avant de relier ces connaissances.
La reconnaissance de contextes th&#233;matiques ou temporels permettra de relier les connaissances
partageant un m&#234;me contexte. Nous parlerons dans ces conditions de cha&#238;ne d&#8217;inf&#233;rences valide.
</p>
<p>La construction de telles cha&#238;nes se fera &#224; partir d&#8217;ontologies g&#233;n&#233;rales et de relations issues du
texte, afin de ne pas d&#233;pendre d&#8217;une base de connaissances, forc&#233;ment incompl&#232;te.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure Ligozat
</p>
<p>4 Conclusion
</p>
<p>Afin de r&#233;pondre aux failles de notre syst&#232;me de Question R&#233;ponse, nous avons d&#233;velopp&#233; un
module d&#8217;appariement question-r&#233;ponse s&#8217;appuyant sur les relations syntaxiques donn&#233;es par
un analyseur. Ce module sera int&#233;gr&#233; &#224; QALC, afin de valider notre mod&#232;le d&#8217;appariement et
d&#8217;&#233;tudier son impact sur les performances de notre syst&#232;me. La repr&#233;sentation syntaxique des
phrases &#233;labor&#233;e dans ce cadre servira ensuite de base pour fusionner des informations lorsque
plusieurs textes sont n&#233;cessaires &#224; l&#8217;extraction de la r&#233;ponse.
</p>
<p>R&#233;f&#233;rences
A&#239;t-Mokthar S., Chanod J., Roux C. (2002), Robustness beyond shallowness : incremental deep parsing,
Journal of Natural Language Engineering, Vol. 8, No. 3-2.
Burger J., Cardie C., Chaudhri V., Gaizauskas R., Harabagiu S., Israel D., Jacquemin C., Lin C.-Y.,
Maiorano S., Miller G., Moldovan D., Ogden B., Prager J., Riloff E., Singhal A., Shrihari R., Strza-
lkowski T., Voorhees E., Weishedel R. (2001), Issues, Tasks and Program Structures to Roadmap Re-
search in Question &amp; Answering (Q&amp;A), National Institute of Standards and Technology, http://www-
nlpir.nist.gov/projects/duc/papers/qa.Roadmap-paper_v2.doc
Dalmas T. (2002), S&#233;lection et validation de la r&#233;ponse dans les syst&#232;mes de question-r&#233;ponse, un sys-
t&#232;me &#224; base de contraintes s&#233;mantiques, Rapport de DESS, LIMSI-CNRS.
Fellbaum C. (1998), WordNet : An Electronic Lexical Database, Cambridge, Massachussetts, The MIT
Press.
</p>
<p>Ferret O., Grau B., Hurault-Plantet M., Illouz G., Jacquemin C., Monceaux L., Robba I., Vilnat A.
(2003), How a NLP approach benefits question answering, Knowledge Organization journal, A Special
Issue on Evaluation of HLT, Guest Editor : Widad Mustafa El Hadi, Vol. 29, 3-4.
Hovy E., Hermjakob U., Lin C.-Y. (2001), The Use of External Knowledge in Factoid QA, TREC 10
Notebook.
</p>
<p>Jacquemin C., Klavans J. L., Tzoukermann E. (1997), Expansion of multi-word terms for indexing and
retrieval using morphology and syntax, Actes de ACL-EACL&#8217;97, 24-31.
</p>
<p>Lehnert W. (1978), The process of question answering, Hillsdale, N.J., Lawrence Erlbaum Associates.
Moldovan D., Pas&#807;ca M., Harabagiu S., Surdeanu M. (2003), Performance Issues and Error Analysis in
an Open-Domain Question Answering System, ACM Transactions on Information Systems, Vol. 21, No.
2, 133-154.
Monceaux L., Robba I. (2002), Les analyseurs syntaxiques : atouts pour une analyse des questions dans
un syst&#232;me de question-r&#233;ponse ?, Actes de TALN2002, 195-204.
Voorhees E. (2002), Overview of the TREC 2002 Question Answering Task, TREC 2002.</p>

</div></div>
</body></html>