<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide d&#8217;un vocabulaire contr&#244;l&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004
</p>
<p>Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide d&#8217;un
vocabulaire contr&#244;l&#233;
</p>
<p>Aur&#233;lie N&#233;v&#233;ol
</p>
<p>Laboratoire PSI &#8211; INSA et Universit&#233; de Rouen
BP8 - Avenue de l'Universit&#233; - 76801 Saint-Etienne-du-Rouvray Cedex
</p>
<p>aneveol@insa-rouen.fr
</p>
<p>Equipe CISMeF et L@STICS &#8211;  Facult&#233; de M&#233;decine - CHU de Rouen
1, rue de Germont &#8211; 76031 Rouen
</p>
<p>R&#233;sum&#233; &#8211; Abstract
</p>
<p>Nous pr&#233;sentons ici le syst&#232;me d&#8217;indexation automatique actuellement en cours de
d&#233;veloppement dans l&#8217;&#233;quipe CISMeF afin d&#8217;aider les documentalistes lors de l&#8217;indexation de
ressources de sant&#233;. Nous d&#233;taillons l&#8217;architecture du syst&#232;me pour l&#8217;extraction de mots cl&#233;s
MeSH, et pr&#233;sentons les r&#233;sultats d&#8217;une premi&#232;re &#233;valuation. La strat&#233;gie d&#8217;indexation choisie
atteint une pr&#233;cision comparable &#224; celle des syst&#232;mes existants. De plus, elle permet d&#8217;extraire
des paires mot cl&#233;/qualificatif, et non des termes isol&#233;s, ce qui constitue une indexation
beaucoup plus fine. Les travaux en cours s&#8217;attachent &#224; &#233;tendre la couverture des dictionnaires,
et des tests &#224; plus grande &#233;chelle sont envisag&#233;s afin de valider le syst&#232;me et d&#8217;&#233;valuer sa
valeur ajout&#233;e dans le travail quotidien des documentalistes.
</p>
<p>This paper presents the automatic indexing system currently developed in the CISMeF team to
assist human indexers. The system architecture, using the INTEX platform for MeSH term
extraction is detailed. The results of a preliminary experiment indicate that the automatic
indexing strategy is relevant, as it achieves a precision comparable to that of other existing
operational systems. Moreover, the system presented in this paper retrieves keyword/qualifier
pairs as opposed to single terms, therefore providing a significantly more precise indexing.
Further development and tests will be carried out in order to improve the coverage, and
validate the efficiency of the system in the librarians&#8217; everyday work.
.
</p>
<p>Mots Cl&#233;s &#8211; Keywords
</p>
<p>Indexation Automatique, Terminologie M&#233;dicale, Vocabulaire Contr&#244;l&#233;.
Automatic Indexing, Medical terminology, Controlled Vocabulary.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lie N&#233;v&#233;ol
</p>
<p>1 Contexte de travail
</p>
<p>1.1 Le Catalogue et Index des Sites M&#233;dicaux Francophones (CISMeF)
</p>
<p>L&#8217;Internet est devenu une source abondante de documents de toutes sortes, en particulier dans
le domaine de la sant&#233;. C'est dans ce contexte que le catalogue CISMeF (Darmoni et al. 2001)
a &#233;t&#233; d&#233;velopp&#233; en 1995 pour assister les professionnels de sant&#233;, les &#233;tudiants et le grand
public dans leur recherche d&#8217;information de sant&#233; sur l&#8217;Internet. Le catalogue d&#233;crit et indexe
les principales ressources institutionnelles de sant&#233; en fran&#231;ais. A ce jour, 13 642 ressources
ont &#233;t&#233; s&#233;lectionn&#233;es par une &#233;quipe de documentalistes et la mise &#224; jour du catalogue
s&#8217;effectue au rythme de 50 nouvelles ressources par semaine. Une ressource peut &#234;tre un site
ou une page Web, un cours, un article, un rapport : tout support qui contient des informations
relatives &#224; la sant&#233;. La description de ces ressources se fait &#224; l&#8217;aide de notices en se fondant
sur un ensemble de m&#233;tadonn&#233;es et une terminologie structur&#233;e semblable &#224; une ontologie
documentaire du domaine m&#233;dical d&#233;taill&#233;e dans (Soualmia et al., 2002). Un exemple de
notice est donn&#233; figure 1. Lors de l&#8217;&#233;laboration d&#8217;une notice, la t&#226;che la plus co&#251;teuse en
temps est l&#8217;indexation de la ressource &#224; l&#8217;aide de mots cl&#233;s. Crucial pour la recherche
d&#8217;information dans le catalogue, ce travail met en jeu de solides connaissances m&#233;tier. Ainsi,
&#233;tant donn&#233; le nombre croissant de ressources mises en ligne chaque jour, il est n&#233;cessaire de
pouvoir disposer d&#8217;outils automatiques pour l&#8217;indexation. De nombreux travaux ont &#233;t&#233;
r&#233;alis&#233;s dans ce sens pour traiter des textes de tous domaines comme le syst&#232;me FASTR
(Jacquemin, Royaut&#233;, 1994) ou plus sp&#233;cifiquement d&#233;di&#233;s &#224; la sant&#233;, comme les projets
Indexing Initiative (Aronson et al. 2000) et Indexing Aid (Humphrey, Miller 1987), ou les
syst&#232;mes HONselect (Gaudinat, Boyer 2002) et NOMINDEX (Pouliquen 2002), ou encore
des combinaisons de syst&#232;mes d&#8217;indexation (Ruch et al. 2003).
</p>
<p>Figure 1 : Notice courte CISMeF pour la ressource &#171; Diab&#232;te de type 2 &#187;
</p>
<p>1.2 Objectif des travaux pr&#233;sent&#233;s
</p>
<p>L&#8217;objectif de nos travaux est de d&#233;velopper un syst&#232;me d&#8217;indexation automatique qui
permettrait d&#8217;&#233;tendre la couverture du catalogue tout en maintenant une indexation de qualit&#233;,
et en assurant des taux de pr&#233;cision et de rappel &#233;lev&#233;s lors de la recherche d&#8217;information dans
CISMeF. Pour ce faire, le syst&#232;me d&#8217;indexation automatique doit imp&#233;rativement int&#233;grer les
normes d&#8217;indexation manuelle en vigueur. D&#8217;apr&#232;s les r&#233;sultats d&#8217;une &#233;valuation du syst&#232;me
NOMINDEX (Pouliquen 2002) r&#233;alis&#233;e sur un &#233;chantillon repr&#233;sentatif des ressources du
catalogue, on se fixe comme objectif d&#8217;extraire les mots cl&#233;s les plus importants, et de r&#233;duire
le bruit autant que possible, m&#234;me si cela implique de ne pas proposer une indexation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide d&#8217;un vocabulaire contr&#244;l&#233;
</p>
<p>exhaustive. En effet, ce syst&#232;me est destin&#233; &#224; aider l&#8217;indexation manuelle, afin de r&#233;duire les
d&#233;lais actuels, tout en validant la qualit&#233; de l&#8217;indexation automatique propos&#233;e. Le syst&#232;me ne
constituera pas une alternative &#224; l&#8217;indexation manuelle. Cependant, tandis que les syst&#232;mes
d&#8217;indexation cit&#233;s pr&#233;c&#233;demment en 1.1 permettent d&#8217;extraire des mot cl&#233;s et des qualificatifs
isol&#233;s, nous souhaitons porter une attention particuli&#232;re sur l&#8217;extraction de paires
mot cl&#233;/qualificatif, ce qui est indispensable pour produire une indexation pr&#233;cise - et &#224; notre
connaissance innovant.
</p>
<p>2 Indexation des ressources dans CISMeF
</p>
<p>2.1 Normes d&#8217;indexation
</p>
<p>Les 13 000 ressources actuellement r&#233;f&#233;renc&#233;es dans le catalogue CISMeF ont &#233;t&#233; index&#233;es
manuellement par les documentalistes de l&#8217;&#233;quipe selon des crit&#232;res tr&#232;s sp&#233;cifiques, fond&#233;s
sur les normes d&#8217;indexation de la base de donn&#233;es bibliographiques Medline1. Ainsi, &#224; chaque
ressource est associ&#233;e une liste de termes (mots cl&#233;s ou paires mot cl&#233;/qualificatif) emprunt&#233;s
au MeSH (Medical Subject Headings), le th&#233;saurus de r&#233;f&#233;rence du domaine biom&#233;dical
d&#233;velopp&#233; par la NLM (National Library of Medicine) am&#233;ricaine. Plus pr&#233;cis&#233;ment, CISMeF
&#233;tant un catalogue francophone, c&#8217;est la traduction fran&#231;aise des termes MeSH &#233;tablie par
l&#8217;Institut National de la Sant&#233; et de la Recherche M&#233;dicale (INSERM) qui est utilis&#233;e2. Le
MeSH dans sa version 2003 est compos&#233; d&#8217;environ 22 000 mots cl&#233;s (exemples: grossesse,
diab&#232;te) qui peuvent &#234;tre associ&#233;s &#224; l&#8217;un des 84 qualificatifs (exemples: diagnostic, pr&#233;vention
&amp; contr&#244;le&#8230;) afin de pr&#233;ciser leur sens. Ainsi, une indexation utilisant des paires
mot cl&#233;/qualificatif permet une description plus pr&#233;cise qu&#8217;une liste de termes isol&#233;s. Par
exemple, dans une ressource d&#233;taillant les mesures prises par les autorit&#233;s pour le d&#233;pistage du
sida, il est plus pertinent d&#8217;utiliser la paire sida/pr&#233;vention &amp; contr&#244;le que le mot cl&#233; isol&#233;
sida pour l&#8217;indexation. De cette mani&#232;re, les utilisateurs int&#233;ress&#233;s par les aspects autres que
pr&#233;vention &amp; contr&#244;le peuvent d&#8217;embl&#233;e savoir qu&#8217;ils doivent consulter une autre ressource.
</p>
<p>Afin d&#8217;&#234;tre encore plus pr&#233;cis dans la description d&#8217;une ressource, un poids majeur est associ&#233;
aux mots cl&#233;s (ou paires mot cl&#233;/qualificatif) si le concept repr&#233;sent&#233; est trait&#233; tout au long de
la ressource de mani&#232;re d&#233;taill&#233;e, et mineur si le concept est peu d&#233;taill&#233;, ou &#233;voqu&#233; seulement
dans une partie de la ressource. L&#8217;indexation prend &#233;galement en compte les descripteurs
obligatoires, ou check tags. Il s&#8217;agit de mots cl&#233;s MeSH s&#233;lectionn&#233;s par la NLM comme &#233;tant
des termes prioritaires pour l&#8217;indexation. CISMeF utilise tous les check tags relatifs &#224; la
m&#233;decine humaine.
</p>
<p>De plus, il faut remarquer que le nombre de mots cl&#233;s (ou paires) &#224; retenir pour l&#8217;indexation
d&#8217;une ressource n&#8217;est pas fixe. Il peut varier de z&#233;ro (pour les sites des h&#244;pitaux par exemple)
&#224; plusieurs dizaines.
</p>
<p>                                                
1 cf. http://www.ncbi.nlm.nih.gov/entrez/query.fcgi
</p>
<p>2 cf. http://disc.vjf.inserm.fr:2010/basismesh/mesh.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lie N&#233;v&#233;ol
</p>
<p>Toutes les caract&#233;ristiques &#233;voqu&#233;es ci-dessus doivent donc &#234;tre prises en compte dans la
conception du syst&#232;me d&#8217;indexation automatique. Nous allons maintenant d&#233;crire comment
elles ont &#233;t&#233; int&#233;gr&#233;es dans notre syst&#232;me exp&#233;rimental.
</p>
<p>2.2 Description du syst&#232;me d&#8217;indexation automatique CISMeF
</p>
<p>Apr&#232;s une pr&#233;sentation globale du syst&#232;me, les trois grandes &#233;tapes de son fonctionnement
seront d&#233;taill&#233;es : l&#8217;identification d&#8217;&#233;l&#233;ments textuels, le mapping vers les termes MeSH et
l&#8217;exploitation des bases MeSH et CISMeF, le calcul du score et la s&#233;lection de l&#8217;index final.
</p>
<p>2.2.1 Pr&#233;sentation globale du syst&#232;me
</p>
<p>Comme le montre la figure 2, le syst&#232;me d&#8217;Indexation Automatique CISMeF int&#232;gre la
plateforme linguistique INTEX (Silberztein 1993). INTEX est un outil d&#8217;analyse de corpus
puissant, dont les diff&#233;rentes fonctionnalit&#233;s peuvent &#234;tre int&#233;gr&#233;es dans d&#8217;autres syst&#232;mes.
L&#8217;Indexeur utilise &#233;galement deux types de bases de donn&#233;es: un dictionnaire MeSH, et trois
bases de connaissances contenant des informations sur les relations hi&#233;rarchiques entre les
termes MeSH, la liste des descripteurs obligatoires (check tags), et un historique des
associations mot cl&#233;/qualificatif tir&#233; des notices CISMeF.
</p>
<p>Figure 2 : Architecture du syst&#232;me d&#8217;indexation automatique CISMeF
</p>
<p>2.2.2 ldentification d&#8217;&#233;l&#233;ments textuels
</p>
<p>La premi&#232;re &#233;tape de l&#8217;indexation automatique pr&#233;sent&#233;e ici est l&#8217;identification d&#8217;&#233;l&#233;ments
textuels utiles &#224; l&#8217;indexation qui sont r&#233;pertori&#233;s dans un dictionnaire MeSH. Ces &#233;l&#233;ments
textuels peuvent &#234;tre des termes (mots cl&#233;s ou qualificatifs) MeSH (par exemple, sujet &#226;g&#233; ou
diagnostic), des formes fl&#233;chies (par exemple, &#8220;sujets &#226;g&#233;s&#8221;) ou d&#233;riv&#233;es (par exemple,
&#8220;diagnostiquer&#8221;) de ces termes, des synonymes (par exemple, &#8220;personne &#226;g&#233;e&#8221; est un
synonyme MeSH de sujet &#226;g&#233;) ou des formes fl&#233;chies de ces synonymes (par exemple,
&#8220;personnes &#226;g&#233;es&#8221;). La taille importante du dictionnaire n&#233;cessaire (rappelons que le MeSH
compte plus de 22 000 mots cl&#233;s) nous a conduits &#224; envisager l&#8217;utilisation d&#8217;automates pour
extraire ces &#233;l&#233;ments textuels. En effet, les automates &#224; &#233;tats finis peuvent &#234;tre utilis&#233;s pour la</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide d&#8217;un vocabulaire contr&#244;l&#233;
</p>
<p>d&#233;tection des entr&#233;es d&#8217;un dictionnaire, et ce en un seul parcours du texte (Crochemore et al.
2001). De plus, le temps d&#8217;ex&#233;cution requis ne d&#233;pend pas de la taille du dictionnaire, mais est
proportionnel &#224; la longueur du texte analys&#233;. Cette technique est couramment utilis&#233;e dans de
nombreuses applications du TAL. Le logiciel INTEX propose une bo&#238;te &#224; outils compl&#232;te des
fonctionnalit&#233;s qui nous int&#233;ressent &#8211; c&#8217;est pourquoi nous avons d&#233;cid&#233; de l&#8217;int&#233;grer &#224; notre
syst&#232;me. INTEX permet de manipuler des dictionnaires au format DELA (Courtois,
Silberztein, 1990). Ainsi, le dictionnaire MeSH utilis&#233; dans le syst&#232;me d&#8217;indexation
automatique est compos&#233; de deux dictionnaires: un au format DELAF pour les mots simples,
et un au format DELACF pour les mots compos&#233;s.
</p>
<p>Un certain nombre de r&#232;gles d&#8217;indexation ont &#233;t&#233; mises au point avec le documentaliste
&#8220;superindexeur&#8221;, qui supervise l&#8217;indexation de toutes les ressources du catalogue CISMeF.
Ces r&#232;gles permettent d&#8217;extraire des paires mot cl&#233;/qualificatif &#224; partir d&#8217;expressions
r&#233;currentes. Par exemple, &#224; partir de l&#8217;expression &#8220;d&#233;pistage de la maladie M&#8221; on peut extraire
la paire maladie M/pr&#233;vention &amp; contr&#244;le. Ces r&#232;gles sont impl&#233;ment&#233;es sous forme de
grammaires locales, &#224; l&#8217;aide de graphes INTEX. La figure 3 donne le graphe associ&#233; &#224; la r&#232;gle
&#233;voqu&#233;e dans l&#8217;exemple ci-dessus. Suite aux r&#233;sultats de l&#8217;&#233;valuation d&#233;crite dans (Gaudinat
et Boyer 2002), des grammaires similaires sont utilis&#233;es pour extraire efficacement les
mots cl&#233;s li&#233;s aux groupes d&#8217;&#226;ge (par exemple, sujet &#226;g&#233; ou adulte &#226;ge moyen).
</p>
<p>Figure 3 : Grammaire locale extrayant les paires du type maladie M/pr&#233;vention &amp; contr&#244;le
</p>
<p>2.2.3 Mapping vers les termes MeSH et exploitation des bases de connaissance
</p>
<p>La deuxi&#232;me &#233;tape consiste &#224; rapporter les &#233;l&#233;ments textuels rep&#233;r&#233;s aux mots cl&#233;s MeSH
correspondants, afin de cr&#233;er une liste de termes MeSH indiquant la position de chaque
occurrence dans le texte. L&#8217;information sur les positions respectives des termes MeSH
identifi&#233;s dans la ressource permet de proposer des associations mot cl&#233;/qualificatif non
r&#233;pertori&#233;es dans les grammaires locales. Ainsi, un mot cl&#233; et un qualificatif apparaissant dans
la m&#234;me phrase ont de grandes chances d&#8217;&#234;tre une instance de la paire mot cl&#233;/qualificatif
correspondante. Au contraire, s&#8217;ils apparaissent dans des paragraphes diff&#233;rents, il est peu
probable qu&#8217;ils soient associ&#233;s. On consid&#232;re cependant qu&#8217;un qualificatif isol&#233; (c&#8217;est &#224; dire,
qui n&#8217;a pu &#234;tre associ&#233; &#224; aucun mot cl&#233; proche) peut &#234;tre associ&#233; &#224; l&#8217;un des deux mots cl&#233;s les
plus fr&#233;quents du texte, ceux-ci pouvant avoir &#233;t&#233; sous entendus dans la phrase en question.
Les paires ainsi constitu&#233;es sont valid&#233;es &#224; l&#8217;aide du MeSH et de l&#8217;historique des associations
rencontr&#233;es dans le catalogue CISMeF. Toutes les associations ne sont pas autoris&#233;es par le
MeSH - Ainsi, le qualificatif pr&#233;vention &amp; contr&#244;le pourra &#234;tre associ&#233; au mot cl&#233; diab&#232;te,
mais pas au mot cl&#233; pouce.
</p>
<p>2.2.4 Calcul du score et  s&#233;lection de l&#8217;index
</p>
<p>L&#8217;indexation finale r&#233;sulte du classement des mots cl&#233;s (ou paires) en fonction du score qui
leur est attribu&#233;. Une fonction de rupture classique permet de fixer une limite adaptative pour
d&#233;terminer quels sont les &#233;l&#233;ments retenus. Par la suite, un seuil exp&#233;rimental (&#224; d&#233;terminer)
sera utilis&#233; pour d&#233;partager les mots cl&#233;s mineurs et majeurs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lie N&#233;v&#233;ol
</p>
<p>Les descripteurs obligatoires (check tags) sont syst&#233;matiquement s&#233;lectionn&#233;s: leur score
devient &#233;gal &#224; celui du(des) mot(s) cl&#233;(s) le(s) plus fr&#233;quent(s) d&#232;s qu&#8217;ils apparaissent plus
d&#8217;une fois dans le texte. Pour les autres mots cl&#233;s (ou paires), le score est calcul&#233; &#224; partir du
nombre d&#8217;occurrences dans la ressource. S&#8217;il existe une relation hi&#233;rarchique entre plusieurs
mots cl&#233;s (comme sur la figure 4), un partage du score du mot cl&#233; p&#232;re entre les mots cl&#233;s fils
est effectu&#233;, afin de satisfaire la r&#232;gle d&#8217;indexation par les mots cl&#233;s les plus pr&#233;cis.
</p>
<p>endocrinopathies
diab&#232;te
</p>
<p>diab&#232;te insulinod&#233;pendant  
diab&#232;te lipoatrophique
diab&#232;te gestationnel
diab&#232;te non insulinod&#233;pendant
</p>
<p>Figure 4 : Extrait d&#8217;une hi&#233;rarchie du MeSH
</p>
<p>Ainsi, si on compte 10 occurrences de diab&#232;te, 15 de diab&#232;te insulinod&#233;pendant et 4 de
diab&#232;te non insulinod&#233;pendant, les relations hi&#233;rarchiques entre diab&#232;te et diab&#232;te
insulinod&#233;pendant d&#8217;une part et entre diab&#232;te et diab&#232;te non insulinod&#233;pendant d&#8217;autre part
conduiront aux scores 15+(10/2) = 20 pour diab&#232;te insulinod&#233;pendant, et 4+(10/2) = 9 pour
diab&#232;te non insulinod&#233;pendant tandis que diab&#232;te ne figurera plus dans la liste des mots cl&#233;s
retenus. En accord avec la m&#233;thode d&#8217;indexation pr&#233;conis&#233;e par Salton (Salton, Mc Gill,
1983) nous calculons &#224; partir du nombre d&#8217;occurrences ainsi obtenu le poids tf*idf, en
utilisant le catalogue CISMeF comme collection de r&#233;f&#233;rence. Le score obtenu est ensuite
multipli&#233; par une seconde mesure, qui tient compte de la longueur du document (Robertson,
Sparck Jones, 1997). La version finale du syst&#232;me d&#8217;indexation automatique devrait
&#233;galement attribuer un poids suppl&#233;mentaire aux mots cl&#233;s (ou paires) apparaissant dans les
titres des paragraphes, ou dans le r&#233;sum&#233;. En effet, cette m&#233;thode, d&#233;j&#224; utilis&#233;e par
NOMINDEX (Pouliquen 2002) trouve sa justification dans la mani&#232;re de proc&#233;der des
documentalistes qui consultent principalement les titres de paragraphes pour v&#233;rifier
l&#8217;indexation d&#8217;une ressource.
</p>
<p>En r&#233;sum&#233;, on peut dire que le calcul des scores attribu&#233;s &#224; chaque mot cl&#233; (ou paire) est une
fonction du nombre d&#8217;occurrences de chaque mot cl&#233;, de la longueur de la ressource, de
l&#8217;historique des notices CISMeF, de la liste des descripteurs obligatoires, et de la structure
hi&#233;rarchique du MeSH.
</p>
<p>3 Evaluation du syst&#232;me
Une &#233;valuation pr&#233;liminaire du syst&#232;me d&#8217;indexation automatique pr&#233;sent&#233; ci-dessus a &#233;t&#233;
r&#233;alis&#233;e &#224; l&#8217;aide d&#8217;un dictionnaire MeSH contenant approximativement 500 entr&#233;es, relatives
aux descripteurs obligatoires, qualificatifs, et mots cl&#233;s li&#233;s au diab&#232;te. L&#8217;objectif de cette
&#233;valuation est de valider globalement la proc&#233;dure d&#8217;indexation, et en particulier la m&#233;thode
utilis&#233;e pour la construction des dictionnaires. Les tests ont donc port&#233; sur un &#233;chantillon de
10 ressources sur le th&#232;me du diab&#232;te extraites du catalogue CISMeF. La taille du corpus ainsi
constitu&#233; &#233;tait d&#8217;environs 300 Ko, soit 45 241 mots. L&#8217;indexation automatique &#233;tablie par le
syst&#232;me a &#233;t&#233; compar&#233;e &#224; l&#8217;indexation manuelle figurant dans les notices du catalogue. Les
performances du syst&#232;me ont &#233;t&#233; &#233;valu&#233;es par la pr&#233;cision et le rappel, qui sont les mesures
usuelles en traitement du langage naturel. Pr&#233;cisons que certaines des ressources utilis&#233;es dans</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide d&#8217;un vocabulaire contr&#244;l&#233;
</p>
<p>cette &#233;valuation contenaient des termes qui ne se rapportaient pas au diab&#232;te (par exemple,
suivi soins patient), et donc ne figuraient pas dans le dictionnaire, ce qui peut avoir diminu&#233;
les performances.
</p>
<p>Pour chaque ressource, nous avons proc&#233;d&#233; &#224; une indexation &#8220;plein texte&#8221; et &#224; une indexation
bas&#233;e sur le r&#233;sum&#233; ou les titres des paragraphes &#8211;not&#233;e TOC par la suite. Une analyse
comparative des deux types d&#8217;indexation devrait mettre en &#233;vidence l&#8217;importance &#224; accorder
aux mots du titre ou du r&#233;sum&#233;. Nous pr&#233;voyons d&#8217;int&#233;grer le r&#233;sultat de ces observations
dans la version finale du syst&#232;me. Afin d&#8217;illustrer les r&#233;sultats obtenus, la figure 5 permet de
comparer l&#8217;indexation automatique plein texte (colonne 1) et l&#8217;indexation automatique TOC
(colonne 2) avec l&#8217;indexation manuelle CISMeF (colonne 3) pour une m&#234;me ressource.
</p>
<p>Indexation Plein Texte Indexation TOC Indexation Manuelle CISMeF
</p>
<p>grossesse
</p>
<p>diab&#232;te non insulinod&#233;pendant
/th&#233;rapeutique
</p>
<p>sujet &#226;g&#233;
</p>
<p>hypoglyc&#233;miants
/administration &amp; posologie
</p>
<p>diab&#232;te non insulinod&#233;pendant
/g&#233;netique
</p>
<p>diab&#232;te non insulinod&#233;pendant
/complication
</p>
<p>hypoglyc&#233;miants/effets
ind&#233;sirables
</p>
<p>diab&#232;te non
insulinod&#233;pendant
</p>
<p>hypoglyc&#233;miants
</p>
<p>diab&#232;te non
insulinod&#233;pendant
</p>
<p>hypoglyc&#233;miants
</p>
<p>* diab&#232;te non insulinod&#233;pendant
/chimioth&#233;rapie
</p>
<p> * diab&#232;te non insulinod&#233;pendant
</p>
<p>grossesse
</p>
<p>hypoglyc&#233;miants / effets
ind&#233;sirables
</p>
<p>hypoglyc&#233;miants /administration
&amp; posologie
</p>
<p>hypoglyc&#233;miants /classification
</p>
<p>* hypoglyc&#233;miants
</p>
<p>interactions m&#233;dicamenteuses
</p>
<p>(suivi soin patient)3
</p>
<p>sujet &#226;g&#233;
</p>
<p>Figure 5 : Indexation de la ressource &#8220;diab&#232;te de type 2&#8221; disponible &#224; l&#8217;URL
http://agmed.sante.gouv.fr/htm/5/5106c.htm (le 10/01/04)
</p>
<p>Les mots cl&#233;s (ou paires) correctement extraits par le syst&#232;me automatique figurent en gras.
Les mots cl&#233;s (ou paires) consid&#233;r&#233;s comme majeurs par les documentalistes sont signal&#233;s
dans la colonne 3 par une &#233;toile. La figure 6 indique les mesures de pr&#233;cision et de rappel
obtenues sur le corpus pour l&#8217;indexation automatique plein texte et TOC.
</p>
<p>                                                
3 Ce mot cl&#233; MeSH ne figure pas dans le dictionnaire utilis&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lie N&#233;v&#233;ol
</p>
<p>Pr&#233;cision au
rang 2
</p>
<p>Pr&#233;cision au
rang 4
</p>
<p>Rang de la
rupture
</p>
<p>Pr&#233;cision &#224;
la rupture
</p>
<p>Rappel &#224; la
rupture
</p>
<p>Indexation Plein Texte 55% 50% / 43%4 4,7 / 4,3 58% / 53% 45% / 33%
</p>
<p>Indexation TOC 67% 58% / 47% 4 / 2,4 65% / 68% 35% / 25%
</p>
<p>Figure 6 : Pr&#233;cision et rappel du syst&#232;me d&#8217;indexation automatique.
</p>
<p>4 Discussion
Les r&#233;sultats montrent que l&#8217;indexation TOC permet une indexation plus pr&#233;cise que
l&#8217;indexation plein texte, alors que le rappel est plus &#233;lev&#233; pour l&#8217;indexation plein texte que
pour l&#8217;indexation TOC. Cette observation met en &#233;vidence la diff&#233;rence entre les deux types
de documents : les titres de paragraphes donnent une bonne vue d&#8217;ensemble du contenu, mais
pour &#234;tre exhaustif, il est n&#233;cessaire d&#8217;utiliser le texte entier. Il faut cependant remarquer que
la forme standard de certains titres de paragraphes ne refl&#232;te que tr&#232;s vaguement le contenu du
texte. Par exemple, les paragraphes intitul&#233;s &#171; Introduction &#187; ou &#171; Mat&#233;riaux et M&#233;thodes &#187;
sont muets pour l&#8217;indexation. De plus, certaines ressources sont tr&#232;s peu structur&#233;es, et ne
comportent pas de titres de paragraphes. Ce n&#8217;&#233;tait le cas d&#8217;aucune des ressources utilis&#233;es
pour notre &#233;valuation, mais cet &#233;l&#233;ment est &#224; prendre en compte dans l&#8217;utilisation de
l&#8217;information apport&#233;es par les titres.
</p>
<p>La pr&#233;cision obtenue sur les 4 premiers termes est de 50% pour l&#8217;indexation plein texte et de
58% pour l&#8217;indexation TOC, ce qui de l&#8217;ordre des 51% r&#233;alis&#233;s par le syst&#232;me HONselect. La
pr&#233;cision sur les 2 premiers termes est de 55% pour l&#8217;indexation plein texte et de 67% pour
l&#8217;indexation TOC, ce qui est dans les deux cas inf&#233;rieur aux 88% obtenus par le syst&#232;me
hybride d&#233;crit dans (Ruch et al. 2003). Cette moins bonne performance de notre syst&#232;me
semble d&#251;e pour une bonne part &#224; une s&#233;lection trop syst&#233;matique des descripteurs
obligatoires. Il faudrait donc &#233;tudier les indexations propos&#233;es (automatique et manuelle) afin
de d&#233;terminer si ce ph&#233;nom&#232;ne est du &#224; un sur-apprentissage du syst&#232;me ou &#224; un silence de
l&#8217;indexation manuelle. Plus g&#233;n&#233;ralement, une &#233;tude men&#233;e par la NLM5  sur la variabilit&#233; de
l&#8217;indexation entre diff&#233;rents indexeurs humains montre que, selon les cat&#233;gories de
descripteurs (check tags, associations mot cl&#233;/qualificatif etc. ) l&#8217;homog&#233;n&#233;it&#233; peut varier de
76% &#224; 33% seulement, c&#8217;est &#224; dire que, au pire, les indexeurs ne proposent les m&#234;mes
descripteurs que dans un cas sur trois.
</p>
<p>Contrairement aux autres syst&#232;mes, notre approche est fond&#233;e sur l&#8217;extraction de paires
mot cl&#233;/qualificatif, ce qui signifie que l&#8217;extraction d&#8217;un terme isol&#233; au lieu d&#8217;une paire est
consid&#233;r&#233; comme erron&#233;e. Ainsi, si le syst&#232;me propose le mot cl&#233; diab&#232;te au lieu de la paire
</p>
<p>                                                
4 Si diff&#233;rent, le chiffre obtenu sans les associations mot cl&#233;/qualificatif est indiqu&#233; apr&#232;s le signe &#171; / &#187;
</p>
<p>5 cf. Indexing Consistency in Medline , ME. Funk, CA. Reid, LS. Mc Googan &#224; l&#8217;URL :
http://www.pubmedcentral.gov/picrender.fcgi?tool=pmcentrez&amp;action=stream&amp;blobtype=pdf&amp;artid=227138
(le 10/01/04)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide d&#8217;un vocabulaire contr&#244;l&#233;
</p>
<p>diab&#232;te/chimioth&#233;rapie, nous consid&#233;rons que le descripteur correct n&#8217;a pas &#233;t&#233; extrait. De
m&#234;me, si le syst&#232;me propose la paire diab&#232;te/th&#233;rapeutique au lieu de diab&#232;te/chimioth&#233;rapie,
l&#8217;indexation est incorrecte, bien que ces deux descripteurs renvoient &#224; des notions tr&#232;s proches
&#8211; la chimioth&#233;rapie indique sp&#233;cifiquement un traitement m&#233;dicamenteux, alors que
th&#233;rapeutique peut &#233;voquer tous types de traitement. Malgr&#233; cela, sur l&#8217;exemple pr&#233;sent&#233; dans
la figure 5, nous constatons que deux des quatre paires mot cl&#233;/qualificatif attendues sont
extraites, et on observe &#233;galement que deux des trois mots cl&#233;s (ou paires) majeurs attendus
sont propos&#233;s par le syst&#232;me d&#8217;indexation automatique. Nous observons &#233;galement pour
l&#8217;indexation TOC que les mots cl&#233;s extraits sont des mots cl&#233;s majeurs dans l&#8217;indexation
manuelle.
</p>
<p>Les taux de pr&#233;cision et de rappel donn&#233;s sur la figure 6 montrent d&#8217;une mani&#232;re g&#233;n&#233;rale la
plus value de cette approche, puisque les r&#233;sultats obtenus en recherchant les associations
mot cl&#233;/qualificatif sont meilleurs que les r&#233;sultats de l&#8217;indexation par terme isol&#233;. Cela est en
partie du &#224; l&#8217;application de la norme tf/idf aux descripteurs, car elle est d&#233;pendante de
l&#8217;indexation des documents contenus dans la collection. En effet, les paires ont en g&#233;n&#233;ral une
fr&#233;quence moins &#233;lev&#233;e que les mots cl&#233;s isol&#233;s, ce qui fait qu&#8217;elles sont plus promues dans le
classement final. Cependant, cette &#233;valuation a &#233;t&#233; r&#233;alis&#233;e sur un nombre r&#233;duit de
ressources, et ne peut &#234;tre consid&#233;r&#233;e comme repr&#233;sentative des performances du syst&#232;me. Par
ailleurs, l&#8217;utilisation de dictionnaires de plus large couverture pourrait certainement amplifier
le bruit, ou au contraire, augmenter la pr&#233;cision en permettant de rep&#233;rer un plus grand
nombre de mots cl&#233;s pertinents.
</p>
<p>Les travaux en cours visent &#224; &#233;tendre la couverture du dictionnaire &#224; tout le MeSH, en utilisant
diverses m&#233;thodes de traitement du langage naturel. Certaines entr&#233;es peuvent &#234;tre g&#233;n&#233;r&#233;es &#224;
l&#8217;aide des dictionnaires DELA du fran&#231;ais r&#233;alis&#233;s au LADL (Courtois, Silberztein, 1990). Le
lexique m&#233;dical fran&#231;ais d&#233;velopp&#233; dans le cadre du projet UMLF (Zweigenbaum et al. 2003)
permet &#233;galement d&#8217;enrichir notre base. Les am&#233;liorations futures doivent porter sur la
distinction des mots cl&#233;s mineur et majeur, gr&#226;ce aux informations sur leur nombre
d&#8217;occurrence et leurs positions dans le texte. Une interface conviviale devra &#233;galement &#234;tre
d&#233;velopp&#233;e, afin de faciliter le param&#233;trage du syst&#232;me par les documentalistes. Dans les
semaines &#224; venir, on effectuera en parall&#232;le l&#8217;indexation de 60 ressources &#224; l&#8217;aide du syst&#232;me
d&#8217;indexation CISMeF et du syst&#232;me hybride d&#233;crit dans (Ruch et al. 2003).
</p>
<p>5 Conclusion
Nous avons pr&#233;sent&#233; l&#8217;architecture d&#8217;un syst&#232;me d&#8217;indexation MeSH utilisant la plateforme
INTEX ainsi que des bases de connaissances MeSH et CISMeF. Con&#231;u pour all&#233;ger la tache
des documentalistes de l&#8217;&#233;quipe CISMeF, ce syst&#232;me peut extraire des paires
mot cl&#233;/qualificatif plut&#244;t que des termes isol&#233;s, et cherche &#224; maximiser la pr&#233;cision, de
pr&#233;f&#233;rence au rappel. Les premiers r&#233;sultats obtenus montrent que la strat&#233;gie g&#233;n&#233;rale
d&#8217;indexation est pertinente, et que la couverture du dictionnaire employ&#233; sur les termes relatifs
au diab&#232;te est bonne. La pr&#233;cision atteinte est comparable &#224; celle des syst&#232;mes existant.
Cependant, des am&#233;liorations, notamment en ce qui concerne la couverture des dictionnaires,
doivent encore &#234;tre apport&#233;es avant que le syst&#232;me puisse &#234;tre effectivement op&#233;rationnel sur
toutes les ressources de sant&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lie N&#233;v&#233;ol
</p>
<p>R&#233;f&#233;rences
</p>
<p>ARONSON AR., BODENREIDER O., CHANG F., HUMPHREY SM., MORK JG., NELSON SJ.,
RINDFLESCH TC., WILBUR WJ. (2000) The NLM Indexing Initiative. Actes de AMIA
Symposium, (20 Suppl): 17-21.
</p>
<p>COURTOIS B., SILBERZTEIN M. (1990) Dictionnaires &#233;lectroniques du fran&#231;ais, Paris, &#233;ditions
Larousse.
</p>
<p>CROCHEMORE M., HANCART C., LECROQ T. (2001) Algorithmique du texte, Paris, &#233;ditions
Vuibert.
</p>
<p>DARMONI SJ., LEROY JP., THIRION B., BAUDIC F., DOUY&#200;RE M., PIOT J. (2000) CISMeF: a
structured Health resource guide. Meth Inf Med, 39(1): 30-5.
</p>
<p>GAUDINAT A., BOYER C. (2002) Automatic Extraction of MeSH terms from Medline
Abstracts. Atelier de NLPBA2002 sur le Traitement du Langage Naturel dans les applications
Biom&#233;dicales.
</p>
<p>HUMPHREY SM., MILLER NE. (1987) Knowledge-based  indexing of the medical literature:
The Indexing Aid Project. J Am Soc Inf Sci , May 38(3): 184-96.
</p>
<p>JACQUEMIN C., ROYAUT&#201; J. (1994) Retrieving Terms and their Variants in a Lexicalised
Unification-Based Framework , Actes de 17th Annual International ACM SIGIR Conference
on Research and Development in Information Retrieval, 132-141.
</p>
<p>POULIQUEN B. (2002) Indexation de textes m&#233;dicaux par indexation de concepts, et ses
utilisations. Th&#232;se de Doctorat, Universit&#233; Rennes 1, 2002.
</p>
<p>ROBERTSON S.E., SPARCK JONES K. (1997) Simple, proven approaches to text-retrieval.
Rapport technique 356, Laboratoire d&#8217;informatique de l&#8217;Universit&#233; de Cambridge.
</p>
<p>RUCH P., BAUD R., Geissb&#252;hler A. (2003) Learning-Free Text Categorization. Actes de
Artificial Intelligence in Medicine in Europe, 199-204.
</p>
<p>SALTON G., MC GILL MJ. (1983) Introduction to Modern Information Retrieval, New York,
McGraw-Hill.
</p>
<p>SILBERZTEIN M. (1993) Dictionnaires &#233;lectroniques et analyse automatique de textes : le
syst&#232;me INTEX, Paris, Masson.
</p>
<p>SOUALMIA LF., BARRY-GR&#201;BOVAL C., ABDULRAB H., DARMONI SJ. (2002) Mod&#233;lisation et
repr&#233;sentation des connaissances dans un catalogue de sant&#233;. Actes de Ing&#233;nierie des
Connaissances 2002, 139-149.
</p>
<p>ZWEIGENBAUM P., BAUD R., BURGUN A., NAMER F., JAROUSSE E., GRABAR N., RUCH P.,
LE DUFF F., THIRION B., DARMONI SJ.  (2003) UMLF : construction d&#8217;un lexique m&#233;dical
francophone unifi&#233;. Actes de Journ&#233;es Francophones d&#8217;Informatique M&#233;dicale, sous presse.</p>

</div></div>
</body></html>