<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L'annotation syntaxique de corpus oraux constitue-t-elle un probl&#232;me sp&#233;cifique ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004 
</p>
<p>L'annotation syntaxique de corpus oraux constitue-t-elle un 
probl&#232;me sp&#233;cifique ? 
</p>
<p>Christophe Benzitoun 
</p>
<p>Equipe DELIC &#8211; Universit&#233; de Provence 
29, Av. Robert Schuman, 13100 Aix-en-Provence 
</p>
<p>christophebenzitoun@yahoo.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Dans cet article, nous pr&#233;sentons une typologie des ph&#233;nom&#232;nes qui posent probl&#232;me pour 
l'annotation syntaxique de corpus oraux. Nous montrons &#233;galement que ces ph&#233;nom&#232;nes, 
m&#234;me s'ils y sont d'une fr&#233;quence moindre, sont loin d'&#234;tre absents &#224; l'&#233;crit (ils peuvent m&#234;me 
&#234;tre tout &#224; fait significatifs dans certains corpus : e-mails, chats, SMS&#8230;), et que leur prise en 
compte peut am&#233;liorer l'annotation et fournir un cadre int&#233;gr&#233; pour l'oral et l'&#233;crit. 
</p>
<p>In this paper, we present a typology of the phenomena that create problems for the syntactic 
tagging of spoken corpora. We also show that these phenomena, although less frequent, are 
far from being absent in written language (they can even be quite significant in some corpora: 
e-mails, chats, SMS&#8230;). Taken them into account can improve the annotation and provide a 
unified analysis framework for both spoken and written data. 
</p>
<p>Mots-clefs &#8211; Keywords 
</p>
<p>Annotation syntaxique, corpus oraux, NFCE, annotation de r&#233;f&#233;rence 
Syntactic annotation, spoken corpora, reference annotation 
</p>
<p>1 Introduction 
</p>
<p>Cette derni&#232;re d&#233;cennie a vu l'&#233;mergence de l'oral comme objet de recherche &#224; part enti&#232;re 
aussi bien dans les descriptions linguistiques qu'en TALN. Nous allons nous int&#233;resser ici au 
fran&#231;ais parl&#233;, plus particuli&#232;rement au &quot;spontan&#233;&quot;, dans une perspective d'annotation 
manuelle des relations syntaxiques &#224; partir de transcriptions humaines assist&#233;es par ordinateur 
(logiciel Transcriber). Les conventions de transcription sont celles de (DELIC, &#224; para&#238;tre). 
Nous comparerons l'oral avec le fran&#231;ais &#233;crit non standard. 
</p>
<p>Rares sont encore les corpus oraux syntaxiquement annot&#233;s : on peut notamment relever le 
Christine Project (Sampson, 2003) et le Switchboard Corpus (Taylor et al., 2003) pour 
l'anglais. Ils sont totalement inexistants pour le fran&#231;ais oral et d'ailleurs rarissimes pour l'&#233;crit </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christophe Benzitoun 
</p>
<p>(cf. Habert et al., 1997 ; Abeill&#233; et al., 2001). Or, la constitution de tels corpus constitue un 
enjeu majeur, &#224; la fois pour la communaut&#233; des linguistes (comparaison oral/&#233;crit de certaines 
structures, extraction automatique de concordances plus pr&#233;cises&#8230;) et pour la communaut&#233; 
des chercheurs en TALN (entra&#238;nement des parseurs sur l'oral, dialogue homme-machine&#8230;). 
</p>
<p>Dans le cadre de la campagne d'&#233;valuation EASY (Evaluation des Analyseurs SYntaxique) du 
projet Technolangue EVALDA, nous avons &#233;t&#233; amen&#233;s &#224; nous interroger sur les probl&#232;mes 
pos&#233;s par l'annotation syntaxique de corpus oraux afin de savoir si cette t&#226;che repr&#233;sentait un 
probl&#232;me sp&#233;cifique, compte tenu du fait que les analyseurs seront &#233;valu&#233;s sur des corpus 
&#233;crits et oraux authentiques. Nous pr&#233;sentons dans cet article une typologie retra&#231;ant une 
partie des probl&#232;mes rencontr&#233;s &#224; l'oral. Nous montrerons que l'&#233;tude de l'oral &quot;spontan&#233;&quot; 
permet d'aborder la question du traitement des &quot;Nouvelles Formes de Communication Ecrite&quot; 
(NFCE) (e-mails, forums, chats, SMS&#8230;), &#233;crits plus ou moins norm&#233;s dont le Web et la 
t&#233;l&#233;phonie mobile constituent une demande colossale notamment en terme de filtrage et 
d'analyse de contenus. 
</p>
<p>La r&#233;flexion autour des outils, du formalisme et du standard d'annotation li&#233;s aux diverses 
sorties des analyseurs syntaxiques a &#233;t&#233; largement abord&#233;e dans une perspective d'&#233;valuation 
des analyseurs syntaxiques (cf. Caroll et al., 2003, la conf&#233;rence associ&#233;e &#224; TALN 2003 
&quot;Evaluation des analyseurs syntaxiques&quot;). En revanche, la question concernant le choix des 
annotations de r&#233;f&#233;rence est beaucoup moins d&#233;battue (cf. A&#239;t-Mokhtar et al., 2003, pour 
l'&#233;crit) et d&#233;passe largement le seul probl&#232;me d'&#233;valuation. C'est cette question que nous 
allons aborder ici. 
</p>
<p>Nous avons trois pr&#233;-requis m&#233;thodologiques : une analyse superficielle li&#233;e &#224; l'orientation 
contemporaine vers des analyseurs syntaxiques robustes ; des structures syntaxiques en 
d&#233;pendances ; et la conservation de l'int&#233;gralit&#233; de l'information transcrite (amorces, 
r&#233;p&#233;titions, reformulations...) li&#233;e &#224; la possibilit&#233; d'une identification ult&#233;rieure plus fine des 
intentions des locuteurs (Antoine et al., 2003 : 29) et au fait que, selon nous, l'analyse 
syntaxique commence avec la transcription fid&#232;le des paroles, toute suppression constituant 
d&#233;j&#224; une analyse syntaxique en soi (cf. Blanche-Benveniste, Jeanjean, 1986). 
</p>
<p>2 Phrase vs Unit&#233; Maximale (UM) 
</p>
<p>Le premier probl&#232;me que l'on rencontre lorsque l'on travaille sur l'oral, c'est l'inexistence de la 
ponctuation et, par voie de cons&#233;quence, des &quot;phrases&quot; graphiques. (Blanche-Benveniste, 
Jeanjean, 1986) ainsi que (Leech et al., 1997) ont montr&#233; que le recours &#224; la ponctuation n'est 
pas satisfaisant pour transcrire l'oral car celle-ci ne correspond pas &#224; des marques clairement 
identifiables et sa notation constitue d&#233;j&#224;, en elle-m&#234;me, une analyse syntaxique implicite. Par 
ailleurs, (Campione, V&#233;ronis, 2002) ont montr&#233; que l'on ne pouvait pas consid&#233;rer les pauses 
comme des marques de ponctuation. La plupart des projets d'annotations syntaxiques du 
fran&#231;ais portent uniquement sur l'&#233;crit et posent comme pr&#233;-requis de l'analyse la 
segmentation en &quot;phrases&quot; (Gendner et al., 2003) qui n'est autre qu'une segmentation en 
&quot;phrases&quot; graphiques d&#233;limit&#233;es en amont par une majuscule et en aval par une ponctuation 
forte (Abeill&#233; et al., 2003 : 170) avec quelques exceptions telles que les incises.  
</p>
<p>Cette position semble totalement inadapt&#233;e aux NFCE (ex. 1) et 2) ou &#224; l'oral. Cette entit&#233; 
graphiquement d&#233;limit&#233;e est suppos&#233;e repr&#233;senter la plus grande unit&#233; syntaxique, c'est-&#224;-dire </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'annotation syntaxique de corpus oraux constitue-t-elle un probl&#232;me sp&#233;cifique ? 
</p>
<p>qu'en partant de n'importe lequel des constituants, on est capable de remonter soit &#224; la t&#234;te de 
la phrase (g&#233;n&#233;ralement le pr&#233;dicat en grammaire de d&#233;pendances) soit au n&#339;ud phrase (en 
grammaire de constituants). Pour la rendre op&#233;ratoire &#224; l'oral, il est donc n&#233;cessaire de v&#233;rifier 
ses propri&#233;t&#233;s syntaxiques afin de voir s'il est possible de la d&#233;finir sans l'aide de la 
ponctuation. Or, on constate qu'une phrase graphique peut inclure un grand nombre d'unit&#233;s 
non d&#233;pendantes (ex. 1) ou segmenter des unit&#233;s d&#233;pendantes (ex. 2), si bien que l'on ne peut 
en faire une unit&#233; syntaxique &#224; part enti&#232;re. 
</p>
<p>1) Les armes c'est comme les voitures,ca coute des vies humaines chaque annee, mais 
c'est bien de les avoir quand meme, voudriez vous vous passer des voitures,non et 
bien les armes c'est pareil,si les citoyens etaient armes les criminels ne seraient 
plus aussi nombreux,beaucoup d'entre eux sont des laches,une balle ca fait 
reflechir,les bons sentiments ca les fait rigoler,une balle c'est le debut de la 
sagesse,je sais c'est triste je compatis avec vous,mais la realite c'est ca,pouvoir ce 
defendre quelque soit le prix a payer,sinon on va avoir droit a la jungle et ce 
systeme aussi il tue des innocents chaque annee. [&#233;crit]1 
</p>
<p>2) C&#8217;est une grande &#233;preuve pour toute la famille et je l&#8217;accompagne encore 
aujourd&#8217;hui quotidiennement. Dans ce combat permanent pour la recherche de 
l&#8217;&#233;quilibre glyc&#233;mique. [&#233;crit] 
</p>
<p>Notons que l'accumulation d'unit&#233;s sans lien syntaxique dans une m&#234;me phrase graphique et 
la segmentation d'unit&#233;s construites ne sont pas des proc&#233;d&#233;s propres aux NFCE mais que l'on 
en trouve dans d'autres &#233;crits plus normatifs : en litt&#233;rature, par exemple (cf. Vialatte cit&#233; par 
Blanche-Benveniste, 2002). 
</p>
<p>De plus, la ponctuation peut marquer autre chose que des fins de phrases : 
</p>
<p>3) Trois...Anglais! se sont totalement d&#233;v&#234;tus mardi devant Buckingham Palace, 
r&#233;pondant ainsi &#224; l'appel lanc&#233; par autocollants dans le m&#233;tro londonien &#224; venir 
manifester ce jour &#224; 14:00 pour le droit de se promener tout nu. [&#233;crit] 
</p>
<p>Au vu de ces exemples, il semble d&#233;j&#224; difficile de d&#233;finir une unit&#233; &quot;phrase&quot; &#224; l'&#233;crit. Il est 
donc inenvisageable de la transposer &#224; l'oral. En cons&#233;quence, il nous faut une unit&#233; de 
substitution et comme l'a montr&#233; (Kleiber, 2003) &#224; propos des unit&#233;s propos&#233;es par 
Berrendonner, la t&#226;che est loin d'&#234;tre ais&#233;e si l'on ne veut pas retomber dans les contradictions 
m&#234;mes que l'on d&#233;nonce. 
</p>
<p>Nous avons donc choisi de suivre (Blanche-Benveniste, 2002) qui part des constructions 
verbales et non des &quot;phrases&quot;. Nous d&#233;finirons nos Unit&#233;s Maximales (UM) comme &#233;tant des 
constructions verbales, nominales, adjectivales ou adverbiales regroupant un &#233;l&#233;ment t&#234;te 
ainsi que tous les &#233;l&#233;ments qui sont dans sa d&#233;pendance ou qui lui sont &quot;associ&#233;s&quot; (au sens de 
Blanche-Benveniste, 1990). Ainsi, notre UM ne pr&#233;c&#232;dera pas l'analyse des d&#233;pendances mais 
elle r&#233;sultera de la mise en relation syntaxique de toutes les unit&#233;s entre elles, ce qui, dans une 
perspective d'annotation syntaxique, se justifie pleinement. Nous analyserons donc l'exemple 
2) comme &#233;tant form&#233; d'une seule UM, malgr&#233; la pr&#233;sence du point, et l'exemple 4) de deux 
UM. 
</p>
<p>                                                 
1  R&#233;f&#233;rences des corpus : [&#233;crit] : forums sur Internet ; [oral] : corpus oraux &quot;spontan&#233;s&quot;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christophe Benzitoun 
</p>
<p>4) en principe il me fait toujours les m&#234;mes + sauf le le /o&#249;, ou/ le dimanche o&#249; il fait 
euh les g&#226;teaux traditionnels mille-feuilles euh baba au rhum Paris-Brest et tout &#231;a 
+ |UM1 sinon dans la semaine j'ai toujours les m&#234;mes + |UM2 [oral] 
</p>
<p>La recherche d'une UM &#224; l'oral, li&#233;e au fait qu'il n'y a pas de ponctuation, permet donc de 
remettre en perspective l'UM postul&#233;e &#224; l'&#233;crit, &#224; savoir la &quot;phrase&quot;. En effet, si l'on conserve 
la &quot;phrase graphique&quot;, on ne voit pas trop comment faire de l'exemple 1) un seul &#238;lot de 
d&#233;pendances et faire de la deuxi&#232;me phrase de l'exemple 2) une unit&#233; syntaxique autonome. 
</p>
<p>Nous regroupons donc dans une m&#234;me unit&#233; ce que (Biber et al., 1999) appellent &quot;clausal 
units&quot; (pour les UM &#224; t&#234;te verbale) et &quot;non-clausal units&quot; (pour les UM &#224; t&#234;te autre que 
verbale) et nous rejoignons (Wagner et Pinchon, 1962 : 501-2) qui utilisent &quot;phrase&quot; dans 
l'acception restreinte de construction verbale, except&#233; que nous ne s&#233;parons pas les UM &#224; t&#234;te 
verbale et non verbale. 
</p>
<p>3 Marques li&#233;es &#224; la mise en discours 
</p>
<p>Une objection que l'on fait souvent &#224; l'adoption d'un cadre commun d'unit&#233;s pour l'&#233;crit et 
pour l'oral est que ce dernier pr&#233;sente des formes quasiment impr&#233;visibles du fait de sa 
production &quot;on line&quot; o&#249; se m&#234;lent faits de langue et faits de parole. Ces faits sont li&#233;s &#224; ce que 
qualifient (Blanche-Benveniste et al., 1990) de &quot;modes de production de l'oral&quot; et (Morel et 
Danon-Boileau, 1998) de &quot;marques du travail de formulation&quot;. Il s'agit notamment des 
r&#233;p&#233;titions, reformulations, amorces, etc. qui sont des traces de la production du discours au 
m&#234;me titre qu'un brouillon, &#224; l'&#233;crit (Blanche-Benveniste et al., 1990 : 17 ; Blanche-
Benveniste, Jeanjean, 1986 : 155-161). En fait, nous pouvons montrer que ce ph&#233;nom&#232;ne n'est 
pas sp&#233;cifique &#224; l'oral car l'on retrouve ces marques dans des textes &#233;crits tir&#233;s des NFCE. 
</p>
<p>Nous aurions pu &#233;liminer ces traces de la mise en discours, qui, le plus souvent ne modifient 
pas la structure syntaxique de l'&#233;nonc&#233; mais en compliquent seulement la r&#233;alisation lin&#233;aire. 
Nous pensons qu'il est int&#233;ressant de les conserver afin de ne pas pr&#233;sumer de l'analyse 
syntaxique qui pourrait en &#234;tre faite. De plus, contrairement &#224; ce que nous pourrions penser, 
les r&#233;p&#233;titions (ex. 5), 6) et 7) ainsi que les reformulations (ex. 8) et 9) sont des proc&#233;d&#233;s 
certes rares &#224; l'&#233;crit mais pas inexistants. Encore faut-il pr&#233;ciser sur quel type d'&#233;crit ou quel 
type d'oral on travaille car il y a peu de chances que l'on en trouve dans des situations d'oral 
tr&#232;s contraintes (discours juridiques, politiques etc.) ou d'&#233;crits oralis&#233;s. 
</p>
<p>3.1 Les r&#233;p&#233;titions 
</p>
<p>Outre la distinction, qui peut poser probl&#232;me, entre r&#233;p&#233;titions de &quot;langue&quot; : 
</p>
<p>5) Avec des conseils, des explications, des solutions, des t&#233;moignages, des livres, un 
Forum, des blagues le tout de tr&#232;s tr&#232;s bonne qualit&#233;. [&#233;crit] 
</p>
<p>et r&#233;p&#233;titions li&#233;es &#224; la mise en discours : 
</p>
<p>6) la les traitements les produits sont beaucoup plus efficaces et finalement on + on 
utilise de moins grandes quantit&#233;s de produit [oral] 
</p>
<p>on remarque que les r&#233;p&#233;titions sont, par d&#233;finition contigu&#235;s et, comme le fait remarquer </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'annotation syntaxique de corpus oraux constitue-t-elle un probl&#232;me sp&#233;cifique ? 
</p>
<p>(Antoine et al., 2003) s'appuyant sur (Blanche-Benveniste, 1997 : 47), elles sont g&#233;n&#233;ralement 
limit&#233;es aux chunks c'est-&#224;-dire &#224; des constituants minimaux, comme la plupart des 
ph&#233;nom&#232;nes r&#233;pertori&#233;s dans cette partie.  
</p>
<p>Nous trouvons difficilement des cas de r&#233;p&#233;titions li&#233;es &#224; la mise en discours dans les &#233;crits 
standards, hormis dans les dialogues ou les citations. A premi&#232;re vue, il s'agirait donc d'un 
ph&#233;nom&#232;ne propre &#224; l'oral mais que l'on peut trouver &#224; l'&#233;crit dans les cas o&#249; l'&#233;crit repr&#233;sente 
l'oral (dialogue, discours rapport&#233;, citation). 
</p>
<p>En fait, on trouve des exemples de r&#233;p&#233;titions dans les NFCE : 
</p>
<p>7) Oui ceux de mon Universit&#233; sont soient fils de riches investisseurs ou bien fils de 
de politiciens ayant r&#233;ussi. [&#233;crit] 
</p>
<p>De plus, des concepteurs de logiciels de traitement de textes ont &#233;prouv&#233; le besoin d'int&#233;grer 
une fonction prenant en charge la correction de ce type de ph&#233;nom&#232;ne dans leurs correcteurs 
orthographiques (c'est le cas, par exemple, dans le logiciel Microsoft Word), ce qui laisse 
penser que l'on produit des r&#233;p&#233;titions en tapant du texte. Les r&#233;p&#233;titions ne se limitent donc 
pas aux seules productions orales, m&#234;me si, dans certains registres, elles sont beaucoup plus 
repr&#233;sent&#233;es qu'&#224; l'&#233;crit. Nous allons voir si les reformulations sont aussi pr&#233;sentes &#224; l'&#233;crit. 
</p>
<p>3.2 Les reformulations 
</p>
<p>8) les enseignants &#224; l'&#233;poque n'avaient peut-&#234;tre pas + euh comme aujourd'hui + euh 
+ l'ha- l'ha- l'ha- l'habitude enfin la la la vocation hein + euh disons l'envie + euh 
de travailler + euh sur ces th&#232;mes-l&#224; [oral] 
</p>
<p>9) Au plaisir de vous rire, euh, pardon, lire ... [&#233;crit] 
</p>
<p>Les reformulations ressemblent beaucoup aux &#233;num&#233;rations, si bien qu'il est souvent possible 
de les confondre. Dans l'&#233;nonc&#233; 6), par exemple, nous ne disposons pas d'indices permettant 
d'analyser les traitements les produits comme une reformulation ou une &#233;num&#233;ration. En 
revanche, nous disposons parfois d'indices formels permettant de les distinguer. Par exemple, 
l'habitude enfin la vocation disons l'envie (ex. 8) peut &#234;tre consid&#233;r&#233;e comme &#233;tant une 
reformulation car enfin et disons orientent clairement vers une interpr&#233;tation dans ces termes. 
Ce probl&#232;me d'ambigu&#239;t&#233; entre reformulation et &#233;num&#233;ration a &#233;t&#233; point&#233; notamment par 
(Levelt, 1983). 
</p>
<p>La prise en compte de cette distinction est envisageable car nous disposons parfois d'indices 
formels tels que les marqueurs d'&#233;num&#233;ration et de reformulation ou les accords. Mais nous 
avons fait le choix de ne pas la conserver car il ne s'agit pas l&#224; d'un probl&#232;me syntaxique &#224; 
proprement parler mais plut&#244;t d'un probl&#232;me d'interpr&#233;tation, la reformulation mettant en jeu 
le m&#234;me cadre syntaxique que l'&#233;num&#233;ration. Il s'agit en fait de trois utilisations diff&#233;rentes 
d'un m&#234;me proc&#233;d&#233; syntaxique concernant l'axe paradigmatique. Dans les trois cas (r&#233;p&#233;tition, 
&#233;num&#233;ration et reformulation), on liste des &#233;l&#233;ments dans une m&#234;me place syntaxique. Nous 
suivons donc la perspective de (Blanche-Benveniste et al., 1990 : 20) : 
</p>
<p>[&#8230;] nous ne distinguerons pas entre les ph&#233;nom&#232;nes qui paraissent cr&#233;&#233;s par la volont&#233; des 
locuteurs et ceux qui paraissent leur &#233;chapper ; nous traiterons de la m&#234;me fa&#231;on des 
ph&#233;nom&#232;nes apparemment involontaires comme bredouillages, h&#233;sitations, maladresses, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christophe Benzitoun 
</p>
<p>reprises, et d'autres qui semblent intentionnels comme : r&#233;p&#233;titions intensives, variations 
stylistiques et autres. On verra que ce point de vue [&#8230;] a l'avantage de suivre une ligne 
d'analyse grammaticale unifi&#233;e. 
</p>
<p>Nous avons donc fait le choix de regrouper tous les proc&#233;d&#233;s permettant de lister des &#233;l&#233;ments 
dans une m&#234;me place syntaxique sous l'&#233;tiquette &quot;liste&quot;. 
</p>
<p>3.3 Inserts 
</p>
<p>En ce qui concerne les mots du type hein, bon, que l'on d&#233;signe par des termes aussi divers 
que &quot;particules discursives&quot;, &quot;marqueurs discursifs&quot;&#8230; nous allons adopter la terminologie de 
(Biber et al., 1999 : 93-4 et 1082-3) qui parlent d' &quot;inserts&quot;. Les &quot;inserts&quot; sont d&#233;finis comme 
&#233;tant des mots pouvant constituer des UM &#224; eux seuls et ne pouvant pas entrer dans une 
relation syntaxique avec un autre &#233;l&#233;ment. Ils sont g&#233;n&#233;ralement attach&#233;s prosodiquement &#224; 
un ensemble plus vaste. 
</p>
<p>10) L3 oui mais c'est pas d&#233;finitif hein madame c'est pas encore d&#233;finitif [oral] 
</p>
<p>11) Elle se veut rh&#233;torique, hein, votre question? [&#233;crit] 
</p>
<p>Les inserts peuvent &#234;tre ambigus car ils ont des homonymes. Par exemple, quoi peut &#234;tre 
insert ou pronom, bon peut aussi &#234;tre adjectif. Dans les corpus, on trouve de nombreux cas 
d'ambigu&#239;t&#233; qui, dans une perspective de traitement automatique TP2 PT, restent tr&#232;s compliqu&#233;s &#224; 
d&#233;sambigu&#239;ser. Dans l'exemple suivant, on ne sait pas s'il s'agit du pronom ou de l'insert. 
</p>
<p>12) L1 je ne sais plus quoi + bon alors comment j'appliquais c'est &#231;a [oral] 
</p>
<p>Les inserts ne sont pas propres &#224; l'oral. On en trouve de nombreuses attestations par &#233;crit 
notamment dans les forums ou les chats (cf. ex. 11). 
</p>
<p>3.4 Inach&#232;vements et amorces 
</p>
<p>&#8226; les inach&#232;vements 
13) L1 h&#233; quelques ann&#233;es hein + &#231;a allait que j'&#233;tais fille bon ben le soir je rentrais 
</p>
<p>j'avais rien &#224; faire eh mais les personnes qui &#233;taient mari&#233;es [oral]  
</p>
<p>14) Moi j'accepte vos excuses, mais les malades ... [&#233;crit] 
</p>
<p>&#8226; les amorces 
15) et + mais en m- donc dans un souci d'&#233;galit&#233; de d'ac- que tout le monde soit 
</p>
<p>accept&#233; et en m&#234;me temps enfin [oral] 
</p>
<p>16) N'emp&#234;che que moi je la fais remplir par ma m&#244;man tellement &#231;a me casse les c... 
[&#233;crit] 
</p>
<p>                                                 
</p>
<p>TP
</p>
<p>2
PT  Ces cas d'ambigu&#239;t&#233; sont aussi difficiles &#224; r&#233;soudre dans une perspective linguistique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'annotation syntaxique de corpus oraux constitue-t-elle un probl&#232;me sp&#233;cifique ? 
</p>
<p>Dans tous ces cas, la structure syntaxique en d&#233;pendances est achev&#233;e et doit &#234;tre marqu&#233;e 
comme telle. C'est la r&#233;alisation de la place syntaxique qui est laiss&#233;e en suspens (avec des 
effets de recherche lexicale ou d'anaphore discursive). Dans les &#233;crits standards, on trouve 
d'ailleurs des ellipses conventionnelles qui sont plus codifi&#233;es mais qui rel&#232;vent du m&#234;me 
principe (ex. 17). Le &quot;spontan&#233;&quot; ne fait qu'&#233;tendre le domaine de ces structures &#224; lexique 
incompl&#232;tement r&#233;alis&#233;. 
</p>
<p>17) Ce n'est pas de forte volont&#233; politique qu'il s'agit seulement, mais bien de d&#233;finir 
quelles politiques d&#233;fendre et dans l'int&#233;r&#234;t de qui.... [&#233;crit] 
</p>
<p>4 Marqueurs de relation 
</p>
<p>Dans la partie pr&#233;c&#233;dente, nous avons essentiellement &#233;voqu&#233; des ph&#233;nom&#232;nes non envisag&#233;s 
dans d'autres syst&#232;mes d'annotation syntaxique. Dans cette partie, nous proposons un 
traitement original des mots que l'on retrouve traditionnellement sous les termes pr&#233;positions, 
conjonctions et adverbes. 
</p>
<p>Contrairement &#224; l'habitude consistant &#224; faire de certains indices morphologiques des marques 
de d&#233;pendance telle que les &quot;conjonctions de subordination&quot; qui marqueraient une relation de 
&quot;subordination&quot;, nous pensons que ces items marquent en fait une relation dont la nature nous 
est r&#233;v&#233;l&#233;e par le contexte. C'est ainsi que parce que, contrairement &#224; ce qui est admis, n'est 
pas une marque de &quot;subordination&quot;, au sens syntaxique du terme, mais peut tout aussi bien 
marquer une relation de d&#233;pendance entre constituants (ex. 18) qu'un encha&#238;nement sur un 
contexte extralinguistique (ex. 19) (cf. Debaisieux, 1994). De m&#234;me, et peut d&#233;buter un tour 
de parole (ex. 19). 
</p>
<p>18) aujourd'hui on peut se marier parce que ben on a envie de payer moins d'imp&#244;ts 
on peut se marier parce qu'on a besoin d'un pr&#234;t + et qu'il faut &#234;tre ben euh 
monsieur madame [oral] 
</p>
<p>19) L2 c'est &gt; foutu bon les Bretons vous avez vu les ils a- sont en plus ils sont 
maladroits ces pauvres Bretons 
L1 oui &#231;a c'est s&#251;r 
L2 bon alors voil&#224; &lt; mais le le 
L1 bon &gt; 
L2 parce qu'on ne fait rien pour cela quoi 
L1 et concr&#232;tement pour vous par exemple vous pouvez nous parler un peu de la 
mani&#232;re dont vous essayez de mener le combat pour pr&#233;server cet h&#233;ritage culturel 
[oral] 
</p>
<p>Ainsi, nous ferons de ces mots des &quot;marqueurs de relation&quot; sans sp&#233;cifier la relation qu'ils 
marquent. C'est le cas des mots en gras dans l'exemple suivant. 
</p>
<p>20) on est un petit peu d&#233;cal&#233; vis &#224; vis de &#231;a mais ben oui je suis jeune j'ai vingt-cinq 
ans + et puis alors c'est comme &#231;a &#231;a arrive + je trouve que peut-&#234;tre que &#231;a me 
manquait quand j'&#233;tais petit [oral] 
</p>
<p>Ces mots peuvent marquer qu'il y a une relation entre deux unit&#233;s quelle qu'en soit la nature 
hi&#233;rarchique. Le fait qu'un m&#234;me mot puisse marquer des relations de nature diff&#233;rentes n'est 
pas un ph&#233;nom&#232;ne propre &#224; l'oral. On en trouve dans les NFCE. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christophe Benzitoun 
</p>
<p>21) Ah bon, parce que le codage num&#233;rique prot&#232;ge contre le brouillage hertzien ? 
[&#233;crit] 
</p>
<p>Nous aurions pu penser que les pr&#233;positions constitueraient un cas particulier mais il n'en est 
rien. On a tous entendu plusieurs dizaines de fois, apr&#232;s avoir pris une baguette de pain, la 
question avec ceci dans laquelle la pr&#233;position n'est pas rattach&#233;e ou on a d&#233;j&#224; mis ou vu &#224; la 
fin d&#8217;une lettre Dans l&#8217;attente d&#8217;une r&#233;ponse de votre part. 
</p>
<p>Par ailleurs, la fronti&#232;re entre insert et marqueur de relation peut parfois &#234;tre mince. Certains 
mots peuvent avoir un emploi d'insert ou de marqueur de relation. Pour le traitement des cas 
ambigus, il faut observer que les inserts ont &#233;ventuellement une valeur d&#233;marcative et ne sont 
jamais relationnels alors que les marqueurs de relation cumulent valeurs relationnelle et 
d&#233;marcative.  
</p>
<p>Ces marques de relation &#224; diff&#233;rents niveaux ne sont pas marginales ni surprenantes dans les 
langues. On en trouve dans un peu tous les types d'&#233;crits et d'oraux. Elles sont seulement 
marginalis&#233;es dans les formes les plus conventionnelles enseign&#233;es &#224; l'&#233;cole.  
</p>
<p>5 Probl&#232;mes d'analyse qui restent &#224; r&#233;soudre 
</p>
<p>Tous les cas pr&#233;c&#233;dents trouvent, on l'a vu, une analyse dans un cadre syntaxique descriptif 
couvrant l'ensemble des usages de la langue. Il reste des cas qui r&#233;sistent encore &#224; l'analyse. 
Nous en &#233;voquons deux dans cette partie. 
</p>
<p>5.1 Les places remplies par une autre cat&#233;gorie que celle attendue 
</p>
<p>Il s'agit de compl&#233;mentations &quot;non canoniques&quot; r&#233;alis&#233;es par l'interm&#233;diaire de remarques 
m&#233;talinguistiques qui annoncent une r&#233;alisation lexicale pouvant faire probl&#232;me (ex. 23) ou 
l'absence d'un &#233;l&#233;ment attendu (ex. 22) dans lequel il manque la pr&#233;position de en principe 
s&#233;lectionn&#233;e par le verbe m'occuper). Il est clair que la r&#233;alisation en cat&#233;gories de la place 
objet du verbe dire, dans l'exemples 23), n'est pas canonique et qu'il est difficile de pr&#233;voir 
toutes les formes d'introducteurs de ce type. 
</p>
<p>22) je m'occupais euh tout ce qui &#233;tait transmission [oral] 
</p>
<p>23) t'as raison, Elie, d'ailleurs, si dieu n'existait pas, il faudrait l'inventer - comme 
disait je sais plus qui (voltaire, maybe ?) [&#233;crit] 
</p>
<p>5.2 Les incises 
</p>
<p>24) euh on consid&#233;rait que former + les hommes et c'est toujours euh + en en en 
vigueur &#231;a hein + former les les en- les les enfants d'aujourd'hui + c'est aussi 
former les hommes de demain hein [oral] 
</p>
<p>25) Pour ce qui concerne le SMIC et le ch&#244;mage, il est vrai que plus le salaire 
minimum est &#233;lev&#233; -ce qui bien entendu ne r&#233;pond pas &#224; la question de savoir 
quel devrait &#234;tre son niveau &quot;optimum&quot; afin de maximiser l'emplois- moins on 
n'embauche de mains d'oeuvres &quot;peu&quot; qualifi&#233;es. [&#233;crit] </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'annotation syntaxique de corpus oraux constitue-t-elle un probl&#232;me sp&#233;cifique ? 
</p>
<p>On observe que toutes les contraintes sur la combinatoire des cat&#233;gories tombent si l'on inclut 
les incises dans les analyses. Ainsi, on peut s&#233;parer un clitique d'un verbe par une incise : 
</p>
<p>26) Vous signale que l'an dernier il (JMV) l'etait encore (cette ann&#233;e je ne sais pas) 
[&#233;crit] 
</p>
<p>6 Conclusion et perspectives 
</p>
<p>A l'&#233;poque o&#249; la demande d'applications de TALN pour le Web - source h&#233;t&#233;rog&#232;ne dans 
laquelle les &#233;crits sont plus ou moins norm&#233;s &#8211; la t&#233;l&#233;phonie mobile ou l'oral &quot;spontan&#233;&quot; est 
de plus en plus grande, nous devons envisager de nouveaux probl&#232;mes que l'on n'avait peut-
&#234;tre pas remarqu&#233;s faute de repr&#233;sentativit&#233; statistique dans les corpus &#233;tudi&#233;s jusqu'&#224; pr&#233;sent. 
Il est vrai que, pour des &#233;crits standards, la faible repr&#233;sentativit&#233; (ou l'absence) de ces 
ph&#233;nom&#232;nes laisse la possibilit&#233; de les ignorer sans affecter consid&#233;rablement le rappel ou la 
pr&#233;cision. En revanche, pour l'oral &quot;spontan&#233;&quot; ou les NFCE, il n'est pas envisageable de ne 
pas les prendre en consid&#233;ration. 
</p>
<p>Nous avons montr&#233; que l'on ne pouvait pas opposer de mani&#232;re simpliste &#233;crit et oral, surtout 
quand on traite des NFCE, qui peuvent &#234;tre consid&#233;r&#233;es comme de l'&#233;crit &quot;spontan&#233;&quot;. Comme 
l'ont dit (Blanche-Benveniste, Jeanjean, 1986 : 154) &#224; propos de la position qui consiste &#224; 
opposer oral et &#233;crit : 
</p>
<p>Cette position est pourtant totalement injustifi&#233;e ; si on le pr&#233;sente sous cette forme c'est une 
supercherie ; car cela revient &#224; comparer de l'oral spontan&#233; &#224; de l'&#233;crit &#233;labor&#233;. 
</p>
<p>En comparant &#233;crit et oral &quot;spontan&#233;s&quot;, on se rend compte qu'il y a finalement de nombreuses 
similitudes : non recours &#224; la ponctuation pour d&#233;limiter des UM, absence g&#233;n&#233;ralis&#233;e de la 
n&#233;gation ne (ex. 27), r&#233;p&#233;titions, reformulations, particules discursives, etc. 
</p>
<p>27) Il a pas fait beau aujourd'hui, beaucoup de nuages et de vent. [&#233;crit] 
</p>
<p>L'opposition n'est donc pas entre &#233;crit et oral mais entre planifi&#233; et non planifi&#233;. Les marques 
attribu&#233;es &#224; tort &#224; l'oral sont en r&#233;alit&#233; des marques li&#233;es &#224; la mise en discours avec un temps 
d'&#233;laboration court. En effet, on peut supposer que plus l'&#233;laboration est faible, plus l'on 
trouvera ces marques. Le fait que l'on retrouve les m&#234;mes ph&#233;nom&#232;nes dans les NFCE et &#224; 
l'oral &quot;spontan&#233;&quot; montre bien que cette hypoth&#232;se est justifi&#233;e. 
</p>
<p>Nous sommes bien conscient que les propositions faites ici ne sont pas utilisables dans une 
perspective d'&#233;valuation d'analyseurs syntaxiques pour la raison &#233;vidente que les syst&#232;mes 
&#233;valu&#233;s n'op&#232;rent pas ces distinctions. Mais du moins avons-nous montr&#233; que, pour ce qui est 
de l'annotation syntaxique, nous pouvons traiter l'oral et l'&#233;crit de mani&#232;re unifi&#233;e moyennant 
une plus grande prise en compte des usages non standards. Cette orientation peut &#234;tre aussi 
int&#233;ressante pour les analyseurs syntaxiques &#224; large couverture. 
</p>
<p>Il nous reste encore &#224; tester plus syst&#233;matiquement notre approche sur des corpus plus grands 
et plus diversifi&#233;s afin de cr&#233;er ou supprimer des &#233;tiquettes et aboutir ainsi &#224; un syst&#232;me 
d'annotation de r&#233;f&#233;rence suffisamment g&#233;n&#233;ral pour permettre d'&#233;tiqueter n'importe quel type 
de corpus. Actuellement, nous effectuons des tests destin&#233;s &#224; voir si le d&#233;coupage en UM est 
faisable &#224; grande &#233;chelle et reproductible. Cette d&#233;marche nous semble n&#233;cessaire pour </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christophe Benzitoun 
</p>
<p>r&#233;pondre &#224; la demande technologique d'un m&#233;dia (le Web) dans lequel tous les types de 
corpus sont potentiellement pr&#233;sents et dont on ne conna&#238;t pas a priori la nature. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Abeill&#233; A., Cl&#233;ment L., Toussenel F. (2003), Building a treebank for french, Treebanks : 
Building and Using Parsed Corpora, Abeill&#233; (&#233;d.), Kluwer Academic Publishers, pp. 165-
187. 
Abeill&#233; A., Cl&#233;ment L., Kinyon A., Toussenel F. (2001), Un corpus de fran&#231;ais arbor&#233; : 
quelques interrogations, Actes de la Conf&#233;rence TALN'2001, Tome 1, pp. 33-42. 
A&#239;t-Mokhtar S., Hag&#232;ge C., S&#225;ndor A. (2003), Probl&#232;mes d'intersubjectivit&#233; dans l'&#233;valuation 
des analyseurs syntaxiques, Actes de la Conf&#233;rence TALN, Tome2, pp. 57-66.  
Antoine J.-Y., Goulian J., Villaneau, J. (2003), Quand le TAL robuste s'attaque au langage 
parl&#233; : analyse incr&#233;mentale pour la compr&#233;hension de la parole spontan&#233;e, Actes de la 
Conf&#233;rence TALN'2003, Tome 1, pp. 25-34. 
Berrendonner A. (2002), Les deux syntaxes, Verbum, XXIV, 1-2, pp. 23-35. 
Blanche-Benveniste Cl. (2002), Phrase et construction verbale, Verbum, XXIV, 1-2, 7-22. 
Blanche-Benveniste Cl., Bilger M., Rouget C., van den Eynde K. (1990), Le fran&#231;ais parl&#233; : 
&#233;tudes grammaticales, Paris, &#233;ditions du CNRS. 
Blanche-Benveniste Cl., Jeanjean C. (1986), Le fran&#231;ais parl&#233;. Edition et transcription, Paris, 
Didier-Erudition. 
Biber D., Johansson S., Conrad S., Finegan E. (1999), Longman Grammar of Spoken and 
Written English. Longman. 
Campione E., V&#233;ronis J. (2002), Etude des relations entre pauses et ponctuations pour la 
synth&#232;se de la parole &#224; partir de texte, Actes de la Conf&#233;rence TALN'2002, pp. 175-184. 
Caroll J., Minnen G., Briscoe T. (2003), Parser evaluation, Treebanks : Building and Using 
Parsed Corpora, Abeill&#233; (&#233;d.), Kluwer Academic Publishers, pp. 299-316. 
Debaisieux J.-M. (1994), Le fonctionnement de parce que en fran&#231;ais parl&#233; contemporain : 
Description linguistique et implications didactiques, Th&#232;se, Universit&#233; de Nancy II. 
DELIC (&#224; para&#238;tre), Conventions de transcription, Recherches sur le fran&#231;ais parl&#233;, N&#176;19. 
Gendner V., Vilnat A. (2003), Les annotations syntaxiques de r&#233;f&#233;rence PEAS, Version 1.4. 
Habert B., Nazarenko A., Salem A. (1997), Les linguistiques de corpus, Armand Colin. 
Kleiber G. (2003), Faut-il dire adieu &#224; la phrase ?, l'information grammaticale, n&#176;98, juin. 
Leech G., McEnery T., Wynne A. (1997), Further levels of annotation, Corpus Annotation, 
Garside, Leech &amp; McEnery (&#233;ds.). 
Levelt W.J.M. (1983), Monitoring and self-repair in Speech, Cognition, 14, pp. 41-104. 
Morel M.-A., Danon-Boileau L. (1998), Grammaire de l&#8217;intonation : l&#8217;exemple du fran&#231;ais, 
Paris, Ophrys. 
Sampson G. (2003), Thoughts on two decades of drawing trees, Treebanks : Building and 
Using Parsed Corpora, Abeill&#233; (&#233;d.), Kluwer Academic Publishers, pp. 23-41. 
Taylor A., Marcus M., Santorini B. (2003), The Penn treebank : an overview, Treebanks : 
Building and Using Parsed Corpora, Abeill&#233; (&#233;d.), Kluwer Academic Publishers, pp. 5-22. 
Wagner R.L., Pinchon J. (1962), Grammaire du fran&#231;ais classique et moderne, Hachette 
Universit&#233;. </p>

</div></div>
</body></html>