<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>G&#233;om&#233;triser le sens</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 19- 22  avril 2004 
</p>
<p>G&#233;om&#233;triser le sens. 
</p>
<p>Fabienne Venant 
</p>
<p>LaTTiCe &#8211; ENS 
1 rue Maurice Arnoux 92120 Montrouge 
</p>
<p>fabienne.venant@ens.fr 
 
</p>
<p> 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Les recherches en s&#233;mantique lexicale s&#8217;appuient de plus en plus sur des ressources 
&#233;lectroniques de grande taille (dictionnaires informatis&#233;s, corpus, ontologies) &#224; partir 
desquelles on peut obtenir diverses relations s&#233;mantiques entre unit&#233;s lexicales. Ces relations 
sont naturellement mod&#233;lis&#233;es par des graphes. Bien qu'ils d&#233;crivent des ph&#233;nom&#232;nes 
lexicaux tr&#232;s diff&#233;rents, ces graphes ont en commun des caract&#233;ristiques bien particuli&#232;res. On 
dit qu&#8217;ils sont de type petit monde. Nous voulons mener une &#233;tude th&#233;orique math&#233;matique et 
informatique de la structure de ces graphes pour le lexique. Il s&#8217;agit de les g&#233;om&#233;triser afin de 
faire appara&#238;tre l'organisation du lexique, qui est implicitement encod&#233;e dans leur structure. 
Les outils mis en place sont test&#233;s sur le graphe du dictionnaire &#233;lectronique des synonymes 
(www.crisco.unicaen.fr). Ils constituent une extension du logiciel Visusyn d&#233;velopp&#233; par 
Ploux et Victorri (1998).  
</p>
<p>Research in lexical semantics tends to rely on large-scale electronic language resources 
(machine-readable dictionaries, corpora, ontologies), from which one can get varied semantic 
relationships between lexical units. Such relationships are naturally modelled by graphs. 
Although they describe different lexical phenomena, these graphs share some very specific 
characteristics. They are called &quot;small worlds&quot;. We want to carry out a theoretical 
mathematical and informatic study of these graphs. The point is to geometrise them in order 
to reveal the organisation of the lexicon that is encoded in their structure. The tools we 
developed are tested on the graph of the electronic dictionary of synonyms 
(www.crisco.unicaen.fr). They represent an extension of Visusyn, the software developed by 
Ploux and Victorri (1998). 
</p>
<p>Mots-clefs &#8211; Keywords  
</p>
<p>Lexique, espace s&#233;mantique, synonymie, graphes petit monde. 
</p>
<p>Lexicon, Semantic space, synonymy, graph, small world.  
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne Venant 
</p>
<p>1 Les graphes lexicaux. 
</p>
<p>Les travaux que nous avons men&#233;s r&#233;cemment en d&#233;sambigu&#239;sation automatique (Victorri et 
al., 2003, Jacquet, 2003 ; Venant, 2004) nous ont amen&#233;s &#224; nous int&#233;resser de pr&#232;s aux 
graphes lexicaux. Gr&#226;ce au d&#233;veloppement de nouvelles technologies informatiques, les 
recherches en traitement automatique des langues s&#8217;appuient de plus en plus sur des 
ressources lexicales &#224; grande &#233;chelle (corpus, ontologies, dictionnaires &#233;lectroniques &#8230;). Ces 
ressources permettent d&#8217;obtenir de fa&#231;on automatique des informations s&#233;mantiques sur les 
mots et les relations qu&#8217;ils entretiennent entre eux. Ces relations peuvent &#234;tre repr&#233;sent&#233;es 
naturellement par des r&#233;seaux lexicaux. Les sommets en sont les mots d&#8217;une langue. Il existe 
plusieurs types de r&#233;seaux selon la relation lexicale utilis&#233;e pour d&#233;finir les arcs du r&#233;seau. 
Celle ci peut &#234;tre de type syntagmatique ou de cooccurrence : on construit un arc entre deux 
mots si on les trouve au voisinage d&#8217;un mot cible (V&#233;ronis, 2003). Elle peut &#234;tre de type 
paradigmatique comme c&#8217;est le cas dans le graphe sur lequel nous travaillons (synonymie). Il 
peut s&#8217;agir d&#8217;une relation plus g&#233;n&#233;rale de proximit&#233; s&#233;mantique prenant en compte &#224; la fois 
l&#8217;axe paradigmatique et l&#8217;axe syntagmatique (Gaume et al., 2002). On peut enfin imaginer de 
relier des mots sur des crit&#232;res distributionnels, suivant les contextes qu&#8217;ils partagent, comme 
le fait Bourigault (2002).  
</p>
<p>Aussi divers soient-ils, ces graphes partagent entre eux, et avec tous les autres graphes &quot;de 
terrain&quot; (r&#233;seaux sociaux, Internet, Web, r&#233;seaux &#233;lectriques, r&#233;seaux de neurones,&#8230;) une 
structure et une topologie tr&#232;s particuli&#232;res. On les appelle des graphes &quot;petit monde&quot;. La 
th&#233;orie des graphes s'est pour l'instant tr&#232;s peu souci&#233;e de ces grands graphes (ils peuvent 
avoir plusieurs milliers de sommets ce qui est &#233;norme compar&#233; aux graphes habituellement 
&#233;tudi&#233;s en informatique th&#233;orique). Or nous pensons que la structure particuli&#232;re de ces 
graphes est porteuse d'une information tr&#232;s riche sur les ph&#233;nom&#232;nes sous jacents. Avoir 
acc&#232;s &#224; la structure d'un graphe lexical permettrait non seulement d&#8217;avoir une meilleure 
connaissance de l'organisation du lexique mais aussi d'automatiser l'acc&#232;s &#224; cette 
connaissance, ce qui peut &#234;tre fondamental pour des syst&#232;mes de d&#233;sambigu&#239;sation 
automatique comme le n&#244;tre. C'est pourquoi nous voulons &#171; g&#233;om&#233;triser &#187; ces graphes, c'est &#224; 
dire les plonger dans un espace bi ou tri dimensionnel qui rende compte de leur topologie. 
Nos outils sont mis au point sur le graphe de synonymie fournie par le CRISCO 
(www.unicaen.crisco.fr) qui est au centre de nos travaux en mod&#233;lisation de la polys&#233;mie et 
calcul dynamique du sens. 
</p>
<p>2 Les graphes de terrain 
</p>
<p>2.1 Graphes petit monde 
</p>
<p>Les graphes traditionnellement &#233;tudi&#233;s sont soit compl&#232;tement r&#233;guliers soit compl&#232;tement 
al&#233;atoires. Dans un graphe r&#233;gulier, chaque sommet a le m&#234;me nombre d&#8217;arcs qui joignent un 
petit nombre de voisins dans un motif tr&#232;s clusteris&#233;. Dans un graphe al&#233;atoire chaque 
sommet est connect&#233; arbitrairement &#224; des sommets qui eux-m&#234;mes se connectent 
al&#233;atoirement &#224; d&#8217;autres sommets. L&#8217;introduction des graphes al&#233;atoires par Paul Erd&#246;s a 
permis de faire consid&#233;rablement avancer l&#8217;&#233;tude des grands graphes (graphes pr&#233;sentant 
plusieurs milliers de sommets). Cependant il reste tr&#232;s insatisfaisant de mod&#233;liser un r&#233;seau 
r&#233;el par un graphe al&#233;atoire. En fait la plupart des r&#233;seaux r&#233;els sont interm&#233;diaires entre les 
r&#233;seaux ordonn&#233;s et les r&#233;seaux al&#233;atoires. C&#8217;est pourquoi Watts et Strogatz (1998) ont </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;om&#233;triser le sens 
</p>
<p>cherch&#233; un mod&#232;le qui leur corresponde mieux. Ils ont ainsi d&#233;fini ce qu&#8217;on appelle les &#171;petits 
mondes &#187; et ont d&#233;termin&#233; des param&#232;tres permettant de les caract&#233;riser. Le concept de petit 
monde formalise le fait que m&#234;me quand deux personnes n&#8217;ont aucun ami en commun, il n&#8217;y 
a qu&#8217;une petite cha&#238;ne d'amis qui les s&#233;parent. Ramen&#233; aux graphes ce r&#233;sultat se traduit par le 
fait que la distance entre deux sommets quelconque est faible en moyenne. Ce ph&#233;nom&#232;ne est 
surprenant mais non caract&#233;ristique d&#8217;une organisation. Erd&#246;s et Reniyi (1960) ont en effet 
montr&#233; qu'on le trouve dans les graphes al&#233;atoires. Il fallait donc pousser un peu plus avant 
pour caract&#233;riser les graphes de terrain. Ce qui est &#233;tonnant donc ce n&#8217;est pas tant que le 
monde est petit mais qu&#8217;il le soit bien que chacun d&#8217;entre nous poss&#232;de un groupe de 
connaissances tr&#232;s resserr&#233;, dont la taille est faible par rapport &#224; la population totale, et au 
sein duquel les gens ont de forte chance de se conna&#238;tre entre eux. Formellement, cela se 
traduit par le fait que dans le graphe correspondant si A est reli&#233; &#224; B et B est reli&#233; &#224; C alors A 
a plus de chance d&#8217;&#234;tre reli&#233; &#224; C qu&#8217;&#224; n&#8217;importe quel autre sommet du graphe. C&#8217;est ce qu&#8217;on 
appelle le clustering. Les graphes al&#233;atoires sont faiblement clusteris&#233;s. Les graphes r&#233;guliers 
le sont fortement. 
Ce qui va caract&#233;riser nos graphes de terrain, et en faire quelque chose d&#8217;interm&#233;diaire entre 
les graphes r&#233;guliers et les graphes al&#233;atoires, c&#8217;est qu&#8217;ils sont peu denses et poss&#232;dent &#224; la 
fois une distance moyenne courte et un fort taux de clustering. C&#8217;est pourquoi Watts et 
Strogatz ont choisi pour caract&#233;riser les &#171; petits mondes &#187; les deux param&#232;tres L et C : 
</p>
<p>&#8226; L, distance moyenne entre deux sommets, est un indice de la connectivit&#233; globale : L 
est donc tr&#232;s grand pour un graphe r&#233;gulier et tr&#232;s petit pour un graphe al&#233;atoire. 
</p>
<p>&#8226; C, coefficient de clustering, est un indice de la richesse de la coh&#233;sion locale. Il est 
d&#233;fini de la mani&#232;re suivante : si un sommet S a k voisins alors il peut exister au 
maximum n= k(k-1)/2 arcs entre ces k sommets. Soit m le nombre d&#8217;arcs qu&#8217;il y a 
effectivement entre ces k sommets alors le coefficient de clustering CS associ&#233; au 
sommet S est m/n. Le coefficient global C est &#224; &#233;gal &#224; la moyenne des CS quand S 
parcourt l&#8217;ensemble des sommets du graphe. 
</p>
<p>Pour savoir si on a affaire &#224; un graphe de type petit monde, on compare les coefficients C et L 
&#224; ceux d&#8217;un graphe al&#233;atoire ayant le m&#234;me nombre de sommets (n) et le m&#234;me nombre 
moyen d&#8217;arcs par sommets (k). Pour un graphe petit monde on a C&gt;&gt;Cal&#233;atoire&#8773;k/n alors que L 
est du m&#234;me ordre de grandeur que Lal&#233;atoire&#8773; ln(n)/ln(k) 
2.2 Graphes sans &#233;chelle. 
</p>
<p>Les travaux de Watts et Strogatz ont attir&#233; l'attention sur les graphes de terrain. On a cherch&#233; 
&#224; mieux les caract&#233;riser encore. Babarabasi et al. (1999) ont ainsi montr&#233; qu&#8217;ils font partie 
d&#8217;une autre classe tr&#232;s int&#233;ressante de graphes, les graphes sans &#233;chelle. Cela signifie que la 
r&#233;partition des degr&#233;s des sommets suit une loi de puissance : la probabilit&#233; P(k) qu&#8217;un 
sommet du graphe consid&#233;r&#233; aie k voisins d&#233;cro&#238;t en suivant une loi de puissance P(k)=k-&#955; o&#249; 
&#955; est une constante caract&#233;ristique du graphe, alors que dans le cas des graphes al&#233;atoires, 
c&#8217;est une loi de Poisson qui est &#224; l&#8217;&#339;uvre. La structure sans &#233;chelle se traduit donc par la 
pr&#233;sence d'un tr&#232;s grand nombre de sommets de faible degr&#233; et d'un nombre faible mais non 
n&#233;gligeable de sommets de tr&#232;s haut degr&#233;. Ceci donne aux graphes sans &#233;chelle une structure 
qui peut &#234;tre vue comme hi&#233;rarchique : localement, des sommets de tr&#232;s haut degr&#233; sont 
reli&#233;s &#224; des sommets de moins haut degr&#233;, eux-m&#234;mes reli&#233;s &#224; des sommets de degr&#233; encore 
moindre, et ainsi de suite jusqu'&#224; la masse des sommets de tr&#232;s faible degr&#233;. Les lois de 
puissance sont depuis consid&#233;r&#233;es par de nombreux analystes de graphes comme la signature </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne Venant 
</p>
<p>de l'activit&#233; humaine. Ces premiers travaux ont suscit&#233; l&#8217;enthousiasme des th&#233;oriciens et 
beaucoup d&#8217;&#233;tudes ont &#233;t&#233; men&#233;es qui analysent des graphes divers des sciences sociales ou 
de la biologie. Cependant Gaume (2003) est le premier &#224; mettre en &#233;vidence la structure de 
petit monde hi&#233;rarchique des graphes lexicaux. L&#8217;id&#233;e qui sous tend ses travaux est 
d&#8217;exploiter cette structure pour acc&#233;der de mani&#232;re compl&#232;tement automatique &#224; une 
meilleure connaissance de l&#8217;organisation du lexique. C&#8217;est dans le m&#234;me esprit que nous 
travaillons. 
3 Le petit monde de la synonymie 
</p>
<p>3.1 La construction dynamique du sens.  
</p>
<p>Le cadre th&#233;orique de nos travaux est celui de la construction dynamique du sens d&#233;fini par 
Victorri et Fuchs (96). Ce mod&#232;le, destin&#233; &#224; rendre compte de la place centrale de la 
polys&#233;mie dans la construction du sens, associe &#224; chaque unit&#233; polys&#233;mique un espace 
s&#233;mantique dans lequel sont organis&#233;s ses diff&#233;rents sens. Les unit&#233;s du cotexte induisent une 
dynamique sur cet espace. Ce sont les bassins de la fonction potentielle d&#233;finie par cette 
dynamique qui permettent de d&#233;finir la zone de l&#8217;espace s&#233;mantique correspondant au sens 
pris dans l&#8217;&#233;nonc&#233; par l&#8217;unit&#233; consid&#233;r&#233;e. Selon la largeur et le nombre de bassins on peut 
ainsi obtenir un sens pr&#233;cis, une ambigu&#239;t&#233; ou une ind&#233;termination. 
3.2 Le graphe des synonymes. 
</p>
<p>Ploux et Victorri ont mis au point Visusyn un logiciel permettant de construire de fa&#231;on 
totalement automatique l&#8217;espace s&#233;mantique correspondant &#224; un mot polys&#233;mique donn&#233;. Ce 
logiciel repose sur l'analyse du graphe du dictionnaire &#233;lectronique des synonymes (D.E.S.) 
du laboratoire CRISCO. La base de d&#233;part est constitu&#233;e de sept dictionnaires classiques 
(Bailly, Benac, Du Chazaud, Guizot, Lafaye, Larousse et Robert) dont ont &#233;t&#233; extraites les 
relations synonymiques. Les sommets du graphe sont des mots de la langue fran&#231;aise. Deux 
mots sont reli&#233;s par un arc lorsqu&#8217;un des dictionnaires signale une relation synonymique entre 
eux. Le graphe correspondant poss&#232;de 49133 sommets et 198549 arcs. Il s&#8217;agit bien d&#8217;un 
graphe peu dense, c&#8217;est &#224; dire qu&#8217;il a relativement peu d&#8217;arcs relativement au nombre de ses 
sommets. Son degr&#233; moyen est 8.1. Le calcul des indicateurs L et C de Watts et Strogatz le 
classe dans la cat&#233;gorie des petits mondes. On a en effet L= 4.7306 (qui est bien du m&#234;me 
</p>
<p>ordre de grandeur du L d&#8217;un graphe al&#233;atoire 17.5
)49133ln(
</p>
<p>)1.8ln( &#8776;=alL ) et C= 0.35 (ce qui est 
</p>
<p>tr&#232;s sup&#233;rieur &#224; ce qu&#8217;on aurait pour un graphe al&#233;atoire c&#8217;est &#224; dire Cal &#8776; 4106.149133
1.8 &#8722;&#215;&#8776; ). 
</p>
<p>Enfin nous avons v&#233;rifi&#233; que la distribution des degr&#233;s suit une loi de puissance. C&#8217;est donc 
cette structure de graphe petit monde sans &#233;chelle qu&#8217;il va nous falloir exploiter dans la mise 
en place de nos outils de visualisation. L&#8217;objectif est double puisque l&#8217;algorithmique des 
petits mondes en est encore &#224; ses pr&#233;mices. Nos outils pourraient d&#233;passer le cadre du lexique 
et s&#8217;appliquer &#224; d&#8217;autres graphes des sciences humaines, pour peu qu&#8217;ils soient eux aussi des 
graphes petit monde sans &#233;chelle. 
3.3 Premi&#232;res visualisations obtenues 
</p>
<p>Pour d&#233;terminer automatiquement les param&#232;tres de l&#8217;espace s&#233;mantique associ&#233; &#224; une unit&#233; 
polys&#233;mique, Visusyn analyse le sous graphe dont les sommets sont l'unit&#233; &#233;tudi&#233;e et tous ses 
synonymes. Le principe sera illustr&#233; sur l&#8217;adjectif sec. L'id&#233;e est que ce sous graphe contient 
dans sa structure toute la s&#233;mantique de ce mot. Le travail consiste alors &#224; d&#233;finir la m&#233;thode </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;om&#233;triser le sens 
</p>
<p>de g&#233;om&#233;trisation qui va faire appara&#238;tre cette structure dans une repr&#233;sentation en deux 
dimensions, la difficult&#233; &#233;tant de trouver l'outil de la th&#233;orie des graphes qui va &#234;tre pertinent. 
Ploux et Victorri ont eu l'id&#233;e d'utiliser les cliques. Une clique est un sous graphe complet 
maximal, c&#8217;est &#224; dire un ensemble de sommets, le plus grand possible, reli&#233;s deux &#224; deux. 
Chaque clique correspond &#224; une nuance possible de sens pour sec. On va donc rechercher 
toutes les cliques du sous graphe. Notre espace s&#233;mantique est une projection en deux 
dimensions du nuage form&#233; par ces cliques dans l&#8217;espace multidimensionnel engendr&#233; par les 
synonymes de l&#8217;unit&#233; lexicale consid&#233;r&#233;e (pour les d&#233;tails techniques consulter Ploux et 
Victorri, 1998). On trouvera une repr&#233;sentation de l&#8217;espace s&#233;mantique de sec en figure 1.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1: espace s&#233;mantique de sec (63 synonymes, 94 cliques) 
</p>
<p>La s&#233;mantique de sec &#233;tant bien connue, nous pouvons ici valider notre hypoth&#232;se de travail 
en v&#233;rifiant qu'on a bien obtenu, de fa&#231;on totalement automatique, &#224; partir de la topologie du 
graphe, une visualisation qui rende compte des diff&#233;rents sens de sec et qui les organise en 
fonction de leur proximit&#233; s&#233;mantique. On peut en effet regrouper les sens de sec en six 
acceptions principales, que l'on retrouve sur notre figure. 
</p>
<p>1. qui manque d&#8217;eau : du sable sec (centre de l'espace) 
</p>
<p>2. maigre, d&#233;charn&#233; : un homme grand et sec (en haut du quart sup&#233;rieur gauche) 
</p>
<p>3. st&#233;rile, improductif : rester sec aux questions du professeur (en bas du quart sup&#233;rieur 
gauche) 
</p>
<p>4. qui manque de sensibilit&#233;, qui ne se laisse pas attendrir, &#233;go&#239;ste : un c&#339;ur sec (quart 
inf&#233;rieur droit  et bas du quart sup&#233;rieur droit) 
</p>
<p>5. bref, abrupt, qui manque de douceur : un coup sec (haut du quart sup&#233;rieur gauche) 
</p>
<p>6. seul : un atout sec (centre haut) 
</p>
<p> maigre;maigrelet;sec;s&#233;cot 
</p>
<p> dess&#233;ch&#233;;d&#233;charn&#233;; 
maigre;sec;&#233;tique 
</p>
<p> arided&#233;charn&#233;; 
maigre;sec;&#233;triqu&#233; 
</p>
<p> aride;d&#233;charn&#233;; 
maigre;pauvre;sec 
</p>
<p> aride;improductif; 
pauvre;sec;st&#233;rile;vide 
</p>
<p> dess&#233;ch&#233;;sec;s&#233;ch&#233; 
</p>
<p> bref;concis;sec
 bref;brusque;sec;tranchant 
</p>
<p> bourru;brusque;brutal;;rude;sec 
</p>
<p> bourru;cassant;dur;rude;sec;s&#233;v&#232;re;tranchant;&#226;pre
</p>
<p> abrupt;aigre;cassant;dur;rude;sec;&#226;pre 
</p>
<p> aust&#232;re;dur;raide;rigide;rude;sec;s&#233;v&#232;re 
</p>
<p> aigre;aust&#232;re;dur;froid;rude;sec;s&#233;v&#232;re 
</p>
<p> aigre;dur;froid;glacial;sec 
</p>
<p>dur;froid;glacial;insensible;sec 
</p>
<p> dur;froid;indiff&#233;rent;insensible;sec 
</p>
<p>aride;froid;indiff&#233;rent;insensible;sec 
</p>
<p> froid;glacial;glac&#233;;insensible;sec 
</p>
<p> dur;endurci;indiff&#233;rent;insensible;sans coeur;sec
</p>
<p>indiff&#233;rent;insensible;sans coeur;sec;&#233;go&#239;ste </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne Venant 
</p>
<p>Bien que ces sens soient tr&#232;s diff&#233;rents, ils peuvent &#234;tre reli&#233;s les uns aux autres par une 
&#171;ressemblance de famille&#187; &#224; la Wittgenstein. Les sens (1), (2) et (3) se rejoignent lorsque sec 
qualifie de la v&#233;g&#233;tation. De m&#234;me les sens (3) et (4) sont li&#233;s : une personne s&#232;che au sens 
d&#8217;&#233;go&#239;ste est quelqu&#8217;un de st&#233;rile en termes d&#8217;empathie et de don de soi. On sent aussi une 
relation entre le sens (5), qui s&#8217;applique &#224; des &#233;v&#233;nements, et le sens (4) qui caract&#233;rise un 
comportement mal d&#233;grossi. L'organisation des diff&#233;rentes cliques au sein de l'espace 
s&#233;mantique rend compte de ces relations. 
</p>
<p>3.4 Du local au global. 
</p>
<p>Le probl&#232;me des visualisations obtenues est qu'elles sont locales. On ne peut visualiser le 
graphe de synonymie qu'au voisinage d'un de ses sommets. Le syst&#232;me de d&#233;sambigu&#239;sation 
sur lequel nous travaillons est une extension de Visusyn. Pour d&#233;sambigu&#239;ser un mot il 
s&#8217;appuie d&#8217;une part sur l&#8217;espace s&#233;mantique calcul&#233; par Visusyn et d&#8217;autre part sur des calculs 
de cooccurrences issues de la base Frantext cat&#233;goris&#233;e. Pour am&#233;liorer ses performances, 
nous aimerions pouvoir lui fournir des informations plus globales rendant compte des 
subtilit&#233;s dans les relations de synonymie. Il a par exemple rencontr&#233; le probl&#232;me suivant: la 
t&#226;che consistait &#224; juger si un synonyme de sec &#233;tait valable dans le contexte d'un nom donn&#233; 
(cf. Venant, 2004). Se basant uniquement sur des indices contextuels notre syst&#232;me, ayant 
rencontr&#233; dans le corpus beaucoup de boue s&#232;che et beaucoup de boue glaciale, a consid&#233;r&#233; 
que glacial &#233;tait un bon synonyme de sec dans le contexte de boue. (Notons que l&#8217;on 
rencontre le m&#234;me ph&#233;nom&#232;ne avec temps : temps sec n&#8217;est pas synonyme de temps glacial). 
Le probl&#232;me se pose ici d&#8217;abord parce que sec peut prendre des sens d&#233;pendant de domaines 
diff&#233;rents: les uns sont des sens physiques (un arbre sec, du sable sec), les autres 
psychologiques (un c&#339;ur sec), ensuite parce que parmi ses synonymes, certains comme froid, 
glac&#233; et glacial peuvent aussi d&#233;ployer leur sens dans les deux domaines (une eau froide / un 
abord froid, une boisson glac&#233;e / un accueil glac&#233;, un vent glacial / un sourire glacial), enfin 
parce que sec, froid, glacial, glac&#233; ne sont synonymes que dans leurs sens psychologiques 
mais que certains noms, aussi utilis&#233;s avec sec, peuvent se trouver en cooccurrence avec eux 
dans un sens physique qui &#233;chappe &#224; la synonymie de sec. Notons d&#8217;autre part que si ce 
ph&#233;nom&#232;ne a une incidence notable sur nos calculs, c&#8217;est aussi parce que ces adjectifs 
partagent de nombreuses cliques. En effet notre m&#233;thode de calcul est robuste et lorsqu'un tel 
ph&#233;nom&#232;ne ne concerne qu'un nombre limit&#233; de cliques, il n'interf&#232;re pas dans les calculs. 
Face &#224; ce genre d'erreurs, il nous semble crucial d'avoir des informations plus globales sur le 
graphe. Si on pouvait par exemple visualiser la &quot;carte s&#233;mantique&quot; des relations entre sec, 
froid, glacial et glac&#233; et rendre les informations qu'elle contient accessibles automatiquement 
par des calculs de fonctions potentielles telles que celles que nous utilisons d&#233;j&#224;, nous 
pourrions consid&#233;rablement am&#233;liorer les performances de notre syst&#232;me. Nous cherchons 
donc actuellement &#224; d&#233;finir des m&#233;thodes permettant de visualiser des parties plus 
importantes du graphe. En utilisant des structures plus &#171; l&#226;ches &#187; que les cliques, les 
&#171;noyaux&#187;, on doit pouvoir obtenir des cartes du graphe &#224; diff&#233;rentes &#233;chelles, de la plus 
locale (celle que nous obtenons actuellement) &#224; la plus globale. Nous voudrions construire 
ainsi une sorte d&#8217;atlas s&#233;mantique du fran&#231;ais. L&#8217;id&#233;e est de d&#233;gager &#224; partir des cartes 
globales des dimensions s&#233;mantiques organisatrices du lexique et de les utiliser pour 
structurer les cartes plus locales. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;om&#233;triser le sens 
</p>
<p>4 G&#233;om&#233;triser le sens. 
</p>
<p>L&#8217;arch&#233;type du graphe petit monde, celui pour lequel on visualise le mieux la structure qui est 
en jeu, est le r&#233;seau social. Les sommets en sont des personnes. Elles sont reli&#233;es lorsqu&#8217;elles 
sont en relation soit amicale soit professionnelle, bref quand elles se rencontrent. On 
comprend tr&#232;s bien le c&#244;t&#233; &#224; la fois hi&#233;rarchis&#233;, peu dense globalement et tr&#232;s clusteris&#233; 
localement. Chaque personne a en effet son cercle de connaissances, tr&#232;s clusteris&#233; donc. Une 
d&#8217;entre elles est libre de rejoindre un club ou de d&#233;m&#233;nager dans une autre ville. Il se forme 
alors de nouvelles connexions, des &#171; raccourcis &#187; entre diverses zones denses du graphe. Ces 
relations humaines sont cependant contraintes par un espace g&#233;ographique constitu&#233; de villes 
plus ou moins importantes et plus ou moins &#233;loign&#233;es les unes des autres. Plus une ville est 
importante, plus les activit&#233; de travail sont denses dans ce lieu. Plus deux villes sont proches, 
plus il y a d&#8217;activit&#233;s qui impliquent les deux villes &#224; la fois. Enfin chaque personne qui 
travaille se d&#233;place en fonction de sa ou ses activit&#233;s (une personne peut avoir plusieurs 
activit&#233;s, changer d&#8217;emploi, etc.). Certains sont amen&#233;s &#224; couvrir tout le territoire sur lequel 
s&#8217;exercent leurs activit&#233;s, alors que d&#8217;autres sont cantonn&#233;s dans une partie seulement de ce 
territoire. Une rencontre est un &#233;v&#233;nement qui se produit chaque fois que deux personnes se 
retrouvent dans le m&#234;me lieu dans le cadre de leurs activit&#233;s.  
Notre hypoth&#232;se est qu&#8217;on peut de m&#234;me d&#233;finir un espace s&#233;mantique sous jacent aux 
rencontres lexicales. On peut consid&#233;rer que les mots se rencontrent sur leur terrain d'activit&#233;, 
la parole. Les activit&#233;s langagi&#232;res s&#8217;y exercent chacune sur une r&#233;gion de sens, plus ou moins 
vaste suivant le sujet. Elles portent sur tous les domaines de l&#8217;exp&#233;rience humaine, sur tous 
les sujets sur lesquels on communique par la parole Plus des sens sont voisins, plus ils ont de 
chance de correspondre aux m&#234;mes activit&#233;s langagi&#232;res. Les mots sont au service des 
activit&#233;s langagi&#232;res. Certains sont utilis&#233;s dans beaucoup d&#8217;entre elles, d&#8217;autres dans une ou 
deux activit&#233;s tr&#232;s pr&#233;cises. Certains couvrent toute la zone d'activit&#233;, d&#8217;autres seulement une 
partie. Pour que deux mots soient li&#233;s par la relation de synonymie partielle, il faut une 
probabilit&#233; suffisamment grande qu&#8217;ils se rencontrent dans un coin de l&#8217;espace s&#233;mantique. 
G&#233;om&#233;triser le sens c'est donc reconstruire l&#8217;espace s&#233;mantique &#224; partir de la donn&#233;e des 
rencontres entre mots, c&#8217;est &#224; dire &#224; partir du graphe de synonymie. On veut pouvoir mettre en 
&#233;vidence &#171; les villes &#187;, c&#8217;est &#224; dire les zones denses en activit&#233;s, et donc riches en rencontres. 
Ce que nous savons faire pour l&#8217;instant c&#8217;est rep&#233;rer des zones d&#8217;activit&#233; tr&#232;s pr&#233;cises. Avec 
les cliques nous cherchons des groupes de mots qui se rencontrent deux &#224; deux. Si l&#8217;on suit 
l&#8217;analogie, il y a dans l&#8217;espace s&#233;mantique des grosses villes et des villes moins importantes. 
Qu&#8217;est-ce qu&#8217;une grosse ville ? C&#8217;est une petite r&#233;gion de forte densit&#233; d&#8217;occupation, c&#8217;est-&#224;-
dire une r&#233;gion o&#249; ont lieu beaucoup d&#8217;activit&#233;s, et donc o&#249; beaucoup d&#8217;individus se 
rencontrent. Bien s&#251;r ils ne se rencontrent pas tous deux &#224; deux : ils ne forment pas une seule 
clique. Mais le nombre de connexions entre eux doit &#234;tre tr&#232;s grand, en tout cas plus grand 
qu&#8217;avec les autres individus. Si l&#8217;on veut visualiser l&#8217;espace &#224; une grande &#233;chelle, on ne veut 
voir que les plus grosses villes et les distances entre elles. Autrement dit, ce ne sont plus les 
cliques qui nous int&#233;ressent, mais les grands sous graphes fortement connect&#233;s qu&#8217;on va 
appeler les d-noyaux (d&#8217;apr&#232;s un article de Gu&#233;noche sur la recherche de zone denses dans un 
graphe de prot&#233;ines (Colombo et al., 2003)). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne Venant 
</p>
<p>5 Les d-noyaux 
</p>
<p>5.1 D&#233;finition 
</p>
<p>Soit un graphe connexe G. On veut rep&#233;rer dans G des ensembles de sommets fortement 
connect&#233;s mais pas forc&#233;ment 2 &#224; 2. On commence par d&#233;finir une densit&#233; pour chaque 
sommet du graphe. Soit S un sommet, on consid&#232;re le sous graphe form&#233; par S et ses voisins 
imm&#233;diats. On note nS le nombre de sommets de ce sous graphe et pS son nombre d&#8217;arcs. La 
densit&#233; de S (nombre d&#8217;arcs par rapport au nombre d&#8217;arcs maximum possible) est donn&#233; par  
dS= 2 pS /(nS .( nS-1)).  
</p>
<p>On appelle d-noyau tout sous graphe connexe de G tel que: 
</p>
<p>&#8226; tous ses sommets sont de densit&#233; dS&#8805;d 
&#8226; il est maximal pour la relation d&#8217;inclusion 
</p>
<p>On appelle d-noyau &#233;tendu toute extension connexe d&#8217;un d-noyau dont le degr&#233; moyen est 
sup&#233;rieur ou &#233;gal au degr&#233; moyen du d-noyau dont il est l&#8217;extension. 
Quand d d&#233;cro&#238;t, les d-noyaux &#233;tendus croissent en taille, passant de groupe tr&#232;s connect&#233;s au 
graphe tout entier.  
</p>
<p>Ce qui est int&#233;ressant, c&#8217;est qu&#8217;on peut appliquer les principes de visualisation des cliques aux 
d-noyaux &#233;tendus. Ainsi, &#224; n&#8217;importe quelle &#233;chelle, on peut fabriquer un espace s&#233;mantique 
en associant &#224; chaque d-noyau &#233;tendu un point de l&#8217;espace. La taille des noyaux pour un d 
donn&#233; est une indication pr&#233;cieuse : un grand d-noyau (relativement &#224; la taille moyenne des 
noyaux pour le m&#234;me d) peut &#234;tre associ&#233; &#224; un gros point, et on peut d&#233;cider de ne visualiser 
que les plus gros points. Si tout se passe bien, on aura donc bien rempli l&#8217;objectif donn&#233; par 
l&#8217;analogie g&#233;ographique : &#224; une grande &#233;chelle, on ne voit que les plus grosses villes, et en 
diminuant l&#8217;&#233;chelle on voit plus de d&#233;tails : les grosses villes deviennent des groupes de 
petites villes, d&#8217;autres villes apparaissent entre deux grosses villes. 
</p>
<p>5.2 Premiers r&#233;sultats 
</p>
<p>Nous avons calcul&#233; des d-noyaux &#233;tendus (extension limit&#233;e aux voisins imm&#233;diats du noyau) 
pour d variant de 1 &#224; 0.3 sur un sous graphe du dictionnaire form&#233; de la mani&#232;re suivante : on 
s&#233;lectionne d&#8217;abord le verbe du dictionnaire ayant le plus de synonymes (faire) ainsi que tous 
ses synonymes, parmi les verbes restants on s&#233;lectionne &#224; nouveau celui qui a le plus de 
synonyme (battre) et tous ses synonymes, on r&#233;it&#232;re l&#8217;op&#233;ration tant qu&#8217;on n'a pas atteint les 
mille sommets. La figure 2 montre la visualisation obtenue avec un seuil de densit&#233; &#233;gal &#224; 1. 
La taille du rond repr&#233;sentant un noyau est proportionnelle au nombre de sommets constituant 
ce noyau. Pour l'&#233;tiquetage on ne fait appara&#238;tre que les sommets les plus caract&#233;ristiques, 
c'est &#224; dire ceux qui ont le plus de liens vers l'int&#233;rieur du noyau et le moins possible vers 
l'ext&#233;rieur. Les verbes s&#8217;organisent en un triangle dont on peut identifier les diff&#233;rents 
sommets. En bas &#224; gauche se regroupent les verbes exprimant une action constructive : 
produire ou construire mais aussi cr&#233;er, exciter, attiser. Beaucoup de ces verbes sont r&#233;unis 
dans un noyau assez important &#233;tiquet&#233; par faire (ce noyau contient entre autres donner, 
former, cr&#233;er, fa&#231;onner, former&#8230;). A l&#8217;oppos&#233; le sommet du haut est r&#233;solument destructeur. 
Il s&#8217;agit d&#8217;&#244;ter quelque chose : mati&#232;re, valeur ou estime. On trouve ainsi : &#233;vider, d&#233;valuer, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;om&#233;triser le sens 
</p>
<p>restreindre, avilir, amoindrir, diminuer. L&#8217;axe menant d&#8217;un p&#244;le &#224; l&#8217;autre passe par deux 
noyaux importants &#233;tiquet&#233;s par battre et arr&#234;ter. Le troisi&#232;me sommet est consacr&#233; &#224; la 
notion de d&#233;part : d&#233;camper, partir, se sauver&#8230;. Le passage de la notion d&#233;pr&#233;ciative &#224; la 
notion de d&#233;part se fait de fa&#231;on subtile le long de l&#8217;ar&#234;te du triangle : d&#8217;amoindrir &#224; 
s&#8217;affaiblir, de d&#233;cliner &#224; s&#8217;amenuiser on finit par dispara&#238;tre, s&#8217;&#233;clipser et puis s&#8217;enfuir. On 
pourra noter que cette visualisation fait appara&#238;tre quelques noyaux importants qui r&#233;sument 
l&#8217;organisation d&#233;crite ici. Ce sont amoindrir-diminuer ; battre-rosser, arr&#234;ter, passer, faire, 
exhorter, d&#233;camper. Lorsqu&#8217;on diminue le seuil de densit&#233;, le triangle se resserre petit &#224; petit. 
Le rapprochement des sommets valorisants et d&#233;pr&#233;ciatifs conduit &#224; la formation d&#8217;un gros 
noyau &#233;tiquet&#233; par calmer-faire-moderer. . Les capacit&#233;s de calcul de nos machines ne nous 
ont pas permis d&#8217;aller au-del&#224; d&#8217;un seuil de densit&#233; de 0.3. Le r&#233;sultat est pr&#233;sent&#233; en figure 3. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>5.3 Conclusions et perspectives. 
</p>
<p>Ces premi&#232;res visualisations permettent d&#233;j&#224; de faire &#233;merger des dimensions s&#233;mantiques 
organisatrices du lexique verbal du fran&#231;ais. On aurait pu imaginer en effet voir appara&#238;tre un 
axe opposant les verbes d&#8217;&#233;tat aux verbes d&#8217;action ou encore que les dimensions aspectuelles 
seraient dominantes. Ce qui appara&#238;t ici c&#8217;est que les verbes du fran&#231;ais s&#8217;organisent selon des 
dimensions g&#233;n&#233;rales, de valuation ou de mouvement. Ce sont ces m&#234;mes dimensions que 
l&#8217;on retrouve dans le triangle conceptuel des verbes du fran&#231;ais que Gaume d&#233;crit dans ces 
derniers travaux (Gaume, 2004). Il l&#8217;a cependant obtenu suivant un mode op&#233;ratoire 
radicalement diff&#233;rent du n&#244;tre. Il transforme d&#8217;abord le graphe en une cha&#238;ne de Markov 
dont les &#233;tats sont les sommets du graphe. Des particules se d&#233;placent alors al&#233;atoirement en 
empruntant les arcs du graphe et ce sont les dynamiques de leurs trajectoires qui donnent les 
propri&#233;t&#233;s structurelles du graphe. Le fait que nous ayons pourtant obtenu des r&#233;sultats 
similaires nous donne &#224; penser qu&#8217;il s&#8217;agit l&#224; d&#8217;une propri&#233;t&#233; forte de l&#8217;organisation des 
verbes du fran&#231;ais. Elle est inscrite dans la structure du graphe et notre g&#233;om&#233;trisation permet 
de la mettre en &#233;vidence. Notre m&#233;thode en est encore &#224; ses d&#233;buts mais le fait qu&#8217;elle fasse 
d&#233;j&#224; appara&#238;tre des propri&#233;t&#233;s structurelles fortes nous laisse &#224; penser qu&#8217;au fil de l&#8217;affinage 
elle va nous faire d&#233;couvrir des propri&#233;t&#233;s de plus en plus subtiles. Une des questions que 
posent cependant ces premiers r&#233;sultats est celle de la validation s&#233;mantique des 
repr&#233;sentations obtenues. Il nous faudra en particulier les valider sur des paradigmes lexicaux 
</p>
<p>Figure 2: 1-noyaux obtenus pour 1055 verbes Figure 3: 0.3-noyaux obtenus pour 1055 verbes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabienne Venant 
</p>
<p>sur lesquels nous disposons d'&#233;tudes men&#233;es par les linguistes de notre &#233;quipe. Une des pistes 
de validation envisag&#233;es est de les utiliser dans nos t&#226;ches de d&#233;sambigu&#239;sations, elles-m&#234;mes 
valid&#233;es &#224; l'aide d'exp&#233;riences psycholinguistiques. Les dimensions s&#233;mantiques d&#233;gag&#233;es sur 
la globalit&#233; du graphe, ou sur certains sous graphes importants (verbes, adjectifs,&#8230;), 
permettront d&#8217;orienter et d&#8217;affiner les repr&#233;sentations locales utilis&#233;es par notre syst&#232;me.  
</p>
<p>Il reste cependant un grand travail exploratoire &#224; mener avant l'utilisation en TAL concernant 
notamment l'algorithme de calcul utilis&#233;. Celui que nous avons pr&#233;sent&#233; ici n'est sans doute 
pas le plus performant. Il peut &#234;tre modifi&#233; de diff&#233;rentes fa&#231;ons (d&#233;finition diff&#233;rente de la 
densit&#233;, crit&#232;re d&#8217;arr&#234;t dans la phase d&#8217;extension des noyaux&#8230;). Il nous faudra &#233;valuer la 
pertinence de chacune des variantes aussi bien d'un point de vue formel, en s'interrogeant sur 
la nature des informations obtenues sur la structure du graphe, que d'un point de vue 
s&#233;mantique en &#233;valuant en quoi les g&#233;om&#233;trisations obtenues sont valides. D&#8217;autre part 
l'algorithme actuel s'appuie essentiellement sur la nature clusteris&#233;e du graphe &#233;tudi&#233;. Nous 
savons que ce graphe poss&#232;de d'autres caract&#233;ristiques importantes. Il faudra que l'algorithme 
final s'appuie davantage sur ces autres caract&#233;ristiques si nous voulons que nos outils soient 
effectivement utilisables sur les graphes de terrain en g&#233;n&#233;ral. Enfin la notion de changement 
d&#8217;&#233;chelle est &#224; travailler. Il faut s&#233;lectionner les noyaux &#224; afficher en fonction de leur taille et 
mettre en place des syst&#232;mes de zoom qui puisse permettre de passer d&#8217;une visualisation &#224; une 
autre.  
</p>
<p>References 
BARABASI A-L, A R., JEONG H. (1999), Scale free characteristics of random networks: The 
topology of the World Wide Web. Physica A, 281:69.77, 2000. 
BOURIGAULT D. (2002), Upery : un outil d'analyse distributionnelle &#233;tendue pour la construction 
d&#8217;ontologies &#224; partir de corpus. Actes TALN 2002.  
COLOMBO T., GUENOCHE A, QUENTIN Y. (2003) . Recherche de zones denses dans un graphe. 
Application aux g&#232;nes orthologues. http://www.inist.fr/uir/jim03/colomb.pdf. 
ERD&#214;S P. and RENIYI A. (1960), Publ. Math. Inst. Hung.Acad. Sci 5,17-61 
GAME B. (2003), Analogie et Prox&#233;mie dans les r&#233;seaux petits mondes, Regards crois&#233;s sur 
l&#8217;analogie. RIA, n&#176;sp&#233;cial, Vol 5-6, Herm&#232;s Sciences. 
GAUME B. (2004), Ballades al&#233;atoires dans les Petits Mondes Lexicaux, I3 Information Interaction 
Intelligence, CEPADUES &#233;dition (&#224; para&#238;tre). 
GAUME B., DUVIGNAU K., GASQUET O. et GINESTE M-D. (2002). Forms of Meaning, 
Meanings of Forms. Journal of Experiment and Theoretical Artificial Intelligence, 14(1): 61-74. 
Jacquet G. (2003). Polys&#233;mie verbale  et construction syntaxique : &#233;tude sur le verbe jouer. Actes 
TALN 2003, pages 469-479. 
MILGRAM S., (1967), The small world problem, Psychol. Today 2,60-67.  
PLOUX S. et VICTORRI B. (1998). Construction d&#8217;espaces s&#233;mantiques &#224; l&#8217;aide de dictionnaires 
informatis&#233;s des synonymes. TAL, 39(1) :161&#8211;182. 
VENANT F. (2004). Polys&#233;mie et calcul du sens. Actes JADT 2004 (&#224; para&#238;tre).  
VERONIS J. (2003). Cartographie lexicale pour la recherche d&#8217;information. Actes TALN 2003, pages 
265-275. 
VICTORRI B., FRANCOIS J., MANGUIN J.L (2003)., Dynamical construction of meaning in 
polysemic units. 
VICTORRI B., FUCHS C. (1996), La polys&#233;mie, construction dynamique du sens, Paris, Herm&#232;s. 
WATTS D.J., STROGATZ S.H. (1998), Collective dynamics of &#8216;small-world&#8217; networks. Nature 393: 
440-442 [1, 1998]. </p>

</div></div>
</body></html>