<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La relation de synonymie en g&#233;nomique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2004, F&#232;s, 21 avril 2004 
</p>
<p>La relation de synonymie en g&#233;nomique 
</p>
<p>Davy Weissenbacher 
</p>
<p>LIPN &#8211; Universit&#233; de Paris 13 
 99, avenue Jean-Baptiste Cl&#233;ment  
</p>
<p>93 430 Villetaneuse  
dw@lipn.univ-paris13.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
L&#8217;acc&#232;s au contenu des textes de g&#233;nomique est aujourd&#8217;hui un enjeu important. Cela suppose 
au d&#233;part d&#8217;identifier les noms d&#8217;entit&#233;s biologiques comme les g&#232;nes ou les prot&#233;ines. Se 
pose alors la question de la variation de ces noms. Cette question rev&#234;t une importance 
particuli&#232;re en g&#233;nomique o&#249; les noms de g&#232;nes sont soumis &#224; de nombreuses variations, 
notamment la synonymie. A partir d&#8217;une &#233;tude de corpus montrant que la synonymie est une 
relation stable et linguistiquement marqu&#233;e, cet article propose une mod&#233;lisation de la 
synonymie et une m&#233;thode d&#8217;extraction sp&#233;cifiquement adapt&#233;e &#224; cette relation. Au vu de nos 
premi&#232;res exp&#233;riences, cette m&#233;thode semble plus prometteuse que les approches g&#233;n&#233;riques 
utilis&#233;es pour l&#8217;extraction de cette relation. 
</p>
<p>The access to textual content in genomics is now recognized as an important issue. One of the 
first steps is the recognition of biological entity names such as gene or protein names. It has 
often been observed that entity names may vary in texts but this phenomenon is especially 
common in genomics. Besides a gene canonical name, one can find various abbreviation 
forms, typographic variants and synonyms. Stemming in a corpus analysis, this paper argues 
that synonymy in genomic texts is a stable and linguistically marked relation. This paper 
presents a method for extracting couples of synonymous gene or protein names. From a 
preliminary experiment, this method seems more promising than generic approaches that are 
exploited to extract synonymy relations. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s 
Extraction d&#8217;information, synonymie, entit&#233;s nomm&#233;es, g&#233;nomique 
</p>
<p>Information extraction, synonymy, named entities, genomics </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Davy Weissenbacher 
</p>
<p>1 Introduction  
La g&#233;nomique est un domaine pour lequel le manque d&#8217;outils permettant d&#8217;explorer 
efficacement le contenu des bases documentaires est critique. Les chercheurs ont besoin de 
retrouver rapidement un compl&#233;ment d&#8217;information fiable sur un objet biologique auquel ils 
s&#8217;int&#233;ressent. Des moteurs de recherche sp&#233;cialis&#233;s existent, Medline 1 par exemple, mais leurs 
r&#233;ponses m&#234;me aux questions les plus cibl&#233;es, ram&#232;nent beaucoup trop de documents pour 
&#234;tre consult&#233;s humainement dans un temps impos&#233;. La qualit&#233; r&#233;dactionnelle des articles, leur 
homog&#233;n&#233;it&#233; et le fait qu&#8217;ils rel&#232;vent d&#8217;un domaine sp&#233;cialis&#233; poussent &#224; d&#233;velopper des 
syst&#232;mes d&#8217;extraction d&#8217;information sp&#233;cialis&#233;s. C&#8217;est la piste  qu&#8217;explorent diff&#233;rents groupes 
de recherche (Caderige, Genia, Biomint2). 
</p>
<p>Pour am&#233;liorer l&#8217;acc&#232;s &#224; l&#8217;information textuelle, le rep&#233;rage des noms de g&#232;nes et de 
prot&#233;ines, entre autres substances biologiques, est capital. Toutes les m&#233;thodes classiques 
d&#8217;e xtraction de ces entit&#233;s nomm&#233;es3 (ENs) visant &#224; les rep&#233;rer en corpus se heurtent aux 
probl&#232;mes de la variation synonymique. Ce ph&#233;nom&#232;ne a une ampleur particuli&#232;re en 
g&#233;nomique : 1) un tr&#232;s grand nombre d&#8217;ENs sont pourvues de synonymes 4 (environ 40% des 
noms de g&#232;nes sont r&#233;f&#233;renc&#233;s dans Flybase5 avec au moins un synonyme) ; 2) une m&#234;me EN 
peut avoir beaucoup de synonymes (ex. le g&#232;ne Hcph a au moins 6 synonymes). Dans ce 
domaine de la g&#233;nomique, n&#233;gliger ces ph&#233;nom&#232;nes de variation ou les sous-estimer, comme 
cela a souvent &#233;t&#233; le cas, limite la port&#233;e des travaux effectu&#233;s pour le rep&#233;rage des ENs.  
</p>
<p>La pr&#233;sente &#233;tude tente d&#8217;analyser ces ph&#233;nom&#232;nes de synonymie. Nous d&#233;fendons l&#8217;id&#233;e 
selon laquelle, dans les corpus de g&#233;nomique, cette relation est facile &#224; rep&#233;rer d&#232;s lors que 
l&#8217;on tient compte de ses propri&#233;t&#233;s sp&#233;cifiques. Nous proposons une m&#233;thode d&#8217;extraction 
adapt&#233;e au rep&#233;rage des liens de synonymie entre noms de g&#232;nes ou de prot&#233;ines. Au vu de 
nos premi&#232;res exp&#233;riences, cette m&#233;thode semble plus prometteuse que les approches 
g&#233;n&#233;riques utilis&#233;es pour la variation des entit&#233;s nomm&#233;es. 
</p>
<p>La section 2 de cet article pr&#233;sente l&#8217;&#233;tat des travaux sur le rep&#233;rage des relations de 
synonymie. L&#8217;analyse en corpus des relations de synonymie entre noms de g&#232;nes o u de 
prot&#233;ines (section 3) nous conduit &#224; proposer une approche originale pour extraire des couples 
de synonymes (section 4). Nous montrons dans la section 5 une exp&#233;rience pr&#233;liminaire qui 
permet de valider a priori l&#8217;approche propos&#233;e. La section  6 discute l&#8217;apport de notre 
approche et ses perspectives possibles. 
</p>
<p>                                                 
</p>
<p>1
 URL : http://www.ncbi.nlm.nih.gov/pubmed/ 
</p>
<p>2
 URL : http://caderige.imag.fr/ ; http://www.biomint.org/ ; http://www-tsujii.is.s.u-tokyo.ac.jp/GENIA/ 
</p>
<p>3
 Une entit&#233; nomm&#233;e est un syntagme qui renvoie &#224; un unique objet d&#8217;une r&#233;alit&#233; suppos&#233;e (selon les 
</p>
<p>contextes, il s&#8217;agit des noms propres de personnes, des dates, des URLs, etc.).  
4
 Nous consid&#233;rons comme synonymes deux ENs qui d&#233;signent la m&#234;me entit&#233; et qui peuvent &#234;tre substitu&#233;es 
</p>
<p>l&#8217;une &#224; l&#8217;autre sans modifier le sens de l&#8217;expression o&#249; elles figurent. Dans ce sens la synonymie couvre 
diff&#233;rents ph&#233;nom&#232;nes : variantes typographiques, ph&#233;nom&#232;nes de reformulations, etc. 
</p>
<p>5
 Flybase : http://flybase.bio.indiana.edu/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La relation de synonymie en g&#233;nomique 
</p>
<p>2 Comment rep&#233;rer des relations de synonymie dans les textes ? 
Trois grandes approches ont &#233;t&#233; propos&#233;es pour rep&#233;rer des liens de synonymie dans les 
corpus. La premi&#232;re, l&#8217;approche distributionnelle (voir (Lin, 1998) par exemple), est floue et 
bruit&#233;e. Elle rapproche bien deux unit&#233;s mais sans typer le lien qu&#8217;elles entretiennent. Les 
regroupements produits ne peuvent &#234;tre exploit&#233;s sans &#234;tre valid&#233;s. Les exp&#233;riences de 
(Agichtein, Yu, 2003) confirment cette analyse. La seconde approche est contextuelle : elle 
repose sur des patrons d&#8217;extraction pour rep&#233;rer des liens de synonymie entre unit&#233;s. (Pearson, 
1998) s&#8217;appuie sur des marqueurs de relation comme known as, called. Approche prometteuse 
par sa simplicit&#233; de mise en &#339;uvre et par sa pr&#233;cision, (Yu et al., 2002) l&#8217;exploite pour 
identifier des liens de synonymie entre des noms de g&#232;nes ou de prot&#233;ines. Cependant les 
r&#233;sultats obtenus (30% de pr&#233;cision seulement sur les r&#233;sum&#233;s de Medline) sont d&#233;cevants. A 
notre sens, les auteurs n&#8217;exploitent pas assez les marqueurs linguistiques  : sont privil&#233;gi&#233;s les 
indices de bas niveau comme la ponctuation ou la casse. La troisi&#232;me approche est 
structurelle (voir (Hole, Srinivasan, 2000) par exemple). Deux mots ou termes sont proches 
s&#8217;ils sont construits de mani&#232;re similaire (structure et/ou constituants identiques ou voisins). 
Cette approche co&#251;teuse en connaissances ext&#233;rieures est une alternative int&#233;ressante lorsque 
l&#8217;approche contextuelle s&#8217;av&#232;re peu explo itable. En biologie, elle est utilis&#233;e pour identifier 
des abr&#233;viations tr&#232;s fr&#233;quentes dans les textes de g&#233;nomique (Chang et al., 2002). 
</p>
<p>Dans ce qui suit, nous montrons que l&#8217;analyse sp&#233;cifique de l&#8217;expression de la synonymie 
dans les textes de g&#233;nomiques permet de proposer une m&#233;thode d&#8217;acquisition cibl&#233;e, plus 
efficace, que ce qui a &#233;t&#233; propos&#233; par (Yu et al., 2002) par exemple.  
</p>
<p>3 Etude de la relation de synonymie 
Lorsqu&#8217;une phrase contient au moins deux ENs identifi&#233;es nous appelons fragment l&#8217;empan 
de texte dans lequel la relation de synonymie est exprim&#233;e et doit &#234;tre recherch&#233;e6. Nous 
entendons par amorce de la synonymie le mot ou l&#8217;expression qui est utilis&#233; pour signifier que 
des ENs sont synonymes (also called par exemple). Un Fragment Introduisant la Synonymie 
(FIS) est un fragment (au sens pr&#233;c&#233;demment d&#233;fini) qui contient une amorce de la synonymie 
et dont les deux ENs d&#233;termin&#233;es sont des synonymes ; un FIS peut contenir plusieurs 
relations de synonymies7. Le FIS est la partie de la phrase que l&#8217;on cherche &#224; rep&#233;rer et &#224; 
analyser automatiquement. Enfin nous d&#233;finissons la structure d&#8217;un FIS comme une s&#233;quence 
ordonn&#233;e d&#8217;unit&#233;s normalis&#233;es, les indices.  
</p>
<p>                                                 
</p>
<p>6
 C&#8217;est l&#8217;ensemble des mots contigus situ&#233;s entre la premi&#232;re EN et la derni&#232;re EN, si aucune ponctuation 
</p>
<p>double n&#8217;est ouverte entre la premi&#232;re EN et la derni&#232;re EN sans &#234;tre referm&#233;e avant la derni&#232; re EN 
(exemple : [&#8230;]factors termed IFN regulatory factors (IRF) and is also called IRF-8.) ; ou entre la premi&#232;re 
EN et le signe de ponctuation double fermant, si une ponctuation double est ouverte entre la premi&#232;re EN et 
la derni&#232;re EN sans &#234;tre referm&#233;e avant la derni&#232;re EN (exemple : [&#8230;]codes for threonine-tRNA ligase 
(tRNAThr ligase, formerly threonine-tRNA synthetase, EC 6.1.1.3) has previously[&#8230;]) 
</p>
<p>7
 Le fragment IFN regulatory factors (IRF) and is also called IRF-8 est un FIS contenant trois synonymes : 
</p>
<p>IFN regulatory factors, IRF et IRF-8. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Davy Weissenbacher 
</p>
<p>Nous avons constitu&#233; un corpus de phrases pour &#233;tudier le comportement de la relation de 
synonymie. Nous avons fourni au moteur d&#8217;interrogation de Medline 12 couples de noms de 
g&#232;nes que nous savions &#234;tre synonymes. Dans les r&#233;sum&#233;s retourn&#233;s, nous avons s&#233;lectionn&#233; 
manuellement toutes les phrases exprimant la synonymie autour d&#8217;un &#233;l&#233;ment du couple . Le 
corpus de travail obtenu comporte 63 phrases exprimant la synonymie. 
</p>
<p>L&#8217;&#233;tude de notre corpus de travail montre tout d&#8217;abord que la synonymie est une relation 
fortement redondante : plusieurs articles expriment de mani&#232;res diff&#233;rentes la synonymie 
entre deux noms de g&#232;ne identiques (11 fois pour les noms de g&#232;nes Tal-1 et SCL). On 
constate &#233;galement que l&#8217;expression de la synonymie est locale : nous n&#8217;avons pas rencontr&#233; 
de synonymie qui s&#8217;exprime contextuellement sur plusieurs phrases et toutes les inf ormations 
n&#233;cessaires &#224; l&#8217;expression de la relation de synonymie sont concentr&#233;es dans une partie de la 
phrase, que nous avons appel&#233; le FIS. Enfin, on note que l&#8217;expression de la synonymie est 
relativement stable : nous n&#8217;avons distingu&#233; que 3 grands type s de FIS subissant de petites 
variations.  
Notre analyse r&#233;v&#232;le que les FIS sont structur&#233;s i.e. ce sont des s&#233;quences ordonn&#233;es de termes 
normalis&#233;s, les indices. Ces structures varient uniquement par l&#8217;ordre et la pr&#233;sence de ces 
indices. La figure n&#176;1 repr&#233;sente les structures sans variations des 3 grands types de FIS. Nous 
avons logiquement choisi une mod&#233;lisation sous forme d&#8217;arbres, mod&#233;lisation capable de 
rendre compte de cette structure. Les n&#339;uds des arbres repr&#233;sentent les indices de la 
synonymie et les feuilles les termes du fragment. Parmi les indices nous comptons : la 
ponctuation qui sert &#224; s&#233;parer une partie du FIS du reste de la phrase, &#224; introduire un 
commentaire dans le FIS, ou &#224; distinguer les &#233;l&#233;ments d&#8217;une &#233;num&#233;ration (souvent termin&#233;es 
par les conjonctions and et or) ; les acronymes qui sont nombreux dans les FIS ; le type de 
l&#8217;entit&#233; qui est mentionn&#233; explicitement dans le contexte imm&#233;diat des entit&#233;s synonymes (par 
exemple : The AML1 gene[&#8230;]) ; les amorces de la synonymie qui sont relativement fig&#233;es 
(peu nombreuses et subissant peu de variations, exemple : otherwise known as et also known 
as) ; les &#233;l&#233;ments inconnus i.e. tout ensemble de termes contenu dans le FIS et qui ne sont pas 
des indices. 
</p>
<p> 
</p>
<p>Nous d&#233;fendons l&#8217;hypoth&#232;se que reconn a&#238;tre la relation de synonymie c&#8217;est reconna&#238;tre la 
structure, avec ses variations, des FIS. La section suivante d&#233;crit la m&#233;thode suivie pour la 
valider. 
</p>
<p>4 Validation 
Pour valider notre hypoth&#232;se, et de fait notre analyse, nous avons engendr&#233; 7 automates 
reconnaissant les 3 grands types de FIS et leurs variations (voir figure&#176;2). Les &#233;tats des 
automates sont les indices que nous supposons savoir reconna&#238;tre (&#224; l&#8217;exception des &#233;l&#233;ments 
inconnus : chaque FIS contenant un &#233;l&#233;ment inconnu sera ignor&#233;).  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La relation de synonymie en g&#233;nomique 
</p>
<p>Nous avons constitu&#233; un corpus de test, en projetant sur Medline l&#8217;amorce formerly de 
fiabilit&#233; moyenne8. Nous avons uniquement exig&#233; des 106 phrases qui composent notre corpus 
de test qu&#8217;elles contiennent l&#8217;amorce formerly et ses variations, et au moins deux EN que nous 
avons annot&#233;es manuellement.  
</p>
<p>Figure2. Automate engendr&#233; par la 1&#232;re structure de la figure&#176;1 et ses variations 
</p>
<p>5 R&#233;sultats 
Les r&#233;sultats de la projection des automates r&#233;sum&#233;s dans le tableau&#176;1 ont &#233;t&#233; v&#233;rifi&#233;s par une 
relecture humaine du corpus de test. Un fragment reconnu par un automate et qui n&#8217;exprime 
pas une relation de synonymie est class&#233; dans les fragments erron&#233;s. Tous les fragments 
exprimant une relation de synonymie non reconnue ou seulement partiellement reconnue par 
un ou plusieurs automates sont class&#233;s dans les fragments ignor&#233;s. 
</p>
<p>Fragments incorrects et refus&#233;s 9 Fragments corrects et ignor&#233;s 13 
</p>
<p>Fragments corrects et reconnus 69 Fragments corrects et partiellement reconnus 13 
</p>
<p>Fragments incorrectement reconnus 2 
  
</p>
<p>Tableau1. R&#233;sultat de la projection des automates sur le corpus de test 
</p>
<p>La pr&#233;cision des automates est de 97,5%. Les deux fragments incorrectement reconnus sont 
des d&#233;pendances crois&#233;es. Aucun automate n&#8217;a &#233;t&#233; pr&#233;vu pour reconna&#238;tre cette forme de FIS, 
cette derni&#232;re n&#8217;&#233;ta nt pas pr&#233;sente dans le corpus de travail. Le rappel, au score assez faible de 
75%, demande &#224; &#234;tre nuanc&#233;. En premier lieu parce que nos automates sont incomplets. 
L&#8217;ajout de 5 variations impr&#233;vues dans les automates permet la reconnaissance de 7 fragments  
suppl&#233;mentaires. Et en second lieu par la r&#233;habilitation des &#233;l&#233;ments inconnus qui si&#232;gent au 
sein du fragment, car une analyse humaine leur accorde une identit&#233;9. Des &#233;tudes sp&#233;cialis&#233;es 
aboutissant &#224; l&#8217;identification automatique de ces &#233;l&#233;ments inconnus  augmenteraient le rappel 
sans risquer de d&#233;grader la pr&#233;cision de nos automates. Seules 4 fragments pr&#233;sentent de r&#233;els 
</p>
<p>                                                 
</p>
<p>8
 Certaines amorces, comme &#171; / &#187;, introduisent beaucoup de bruits et d&#8217;autres tr&#232;s peu, comme &#171;  also called &#187; 
</p>
<p>9
 5 fragments sont entrecoup&#233;s par r&#233;f&#233;rences bibliographiques exemple : Heparinase III (E.C. 4.2.2.8), 
</p>
<p>formerly heparinase I, 5 fragments sont entrecoup&#233;s par la relation d&#8217;hyperonymie exemple  : Galectin-3 is 
an animal lectin, formerly named epsilon-binding, 2 par le renommage exemple : Spi 2.1, formerly Spi.1 has 
recently been redesignated Spin2a), 2 par l&#8217;homologie exemple  : utrophin (the chromosome 6-encoded 
dystrophin homolog formerly known as dystrophin-related protein), 2 par l&#8217;encodage exemple  : NusG is 
encoded by an E. coli gene, formerly called U and now called nusG, et 1 par un type inconnu </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Davy Weissenbacher 
</p>
<p>obstacles th&#233;oriques. Le premier fragment conjugue une modalit&#233; &#224; l&#8217;amorce de la synonymie. 
Le deuxi&#232;me fragment, une d&#233;pendance crois&#233;e, ne fut que partiellement reconnu. Les deux 
derniers fragments juxtaposent 2 automates ce qui est une op&#233;ration interdite dans notre 
repr&#233;sentation (ex. XLH gene, referred to as PHEX, or formerly as PEX,[&#8230;]). 
</p>
<p>6 Discussion et perspectives 
En nous appuyant sur les caract&#233;ristiques de la relation de synonymie observ&#233;es sur un petit 
corpus de g&#233;nomique, nous avons propos&#233; une repr&#233;sentation des fragments de phrases 
exprimant la synonymie sous la forme d&#8217;arbres. Nous mettons ainsi la structure synonymique 
en &#233;vidence au-del&#224; de la s&#233;quence de mots et mots-clefs qui constituent le fragment de phrase 
exprimant la synonymie. Cette mod&#233;lisation ne comporte qu&#8217;un tr&#232;s petit nombre de 
structures principales, chacune variant par l&#8217;ordre et la pr&#233;sence d&#8217;&#233;l&#233;ments seconda ires, les 
indices. Nous avons &#233;valu&#233; la qualit&#233; et la couverture de cette description en calculant des 
automates &#224; partir des structures arborescentes, ceux-l&#224; lin&#233;arisant ceux-ci. Nous avons 
montr&#233; que nos r&#233;sultats de 97,5% de pr&#233;cision et de 75% de rappel sont int&#233;ressants et 
meilleurs pour les r&#233;sum&#233;s de MedLine que les travaux ant&#233;rieurs. 
</p>
<p>Nous poursuivons notre travail avec l&#8217;objectif d&#8217;exploiter le double int&#233;r&#234;t de notre 
mod&#233;lisation ; d&#8217;une part associer des informations (comme le type des synonymes  ou le 
degr&#233; de fiabilit&#233; de l&#8217;amorce) &#224; chaque structure en vue de calculer la fiabilit&#233; globale du 
fragment et d&#8217;autre part faciliter l&#8217;apprentissage des r&#232;gles d&#8217;extraction par une approche 
modulaire : d&#8217;abord l&#8217;acquisition des indices (ENs, amorces, ac ronymes, etc.) par des 
apprentissages sp&#233;cifiques &#224; chacun d&#8217;eux, puis la reconnaissance de la structure du fragment.  
</p>
<p>R&#233;f&#233;rences  
Agichtein E, Yu H. (2003), Extracting synonymous gene and protein terms from biological 
literature, Bioinformatics, vol. 19 Suppl;1. 
Chang J.T., Sch&#252;tze H., Altman R. (2002), Creating an online dictionary of abreviations from 
Medline, Journal of the American Medical Informatics Association;pp. 612-620 
Hole W., Srinivasan S. (2000), Discovering missed synonyms in a large concept-oriented 
metathesaurus, Proceedings of AMIA Symposium, pp. 354-358. 
</p>
<p>Lin D. (1998), Automatic retrieval and clustering of similar words, Proceedings of ACL&#8217;98.  
</p>
<p>Pearson J (1998), Terms in Context, John Benjamins.  
Yu H. Hatzivassiloglou V., Friedman C., Rzhetsky A., Wilbur J.(2002), Automatic Extraction 
of gene and protein synonyms from medline and journal articles, Proceedings of AMIA 
Symposium, pp. 413-423. </p>

</div></div>
</body></html>