<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me de g&#233;n&#233;ration et &#233;tiquetage automatique de dictionnaires linguistiques de l'arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de g&#233;n&#233;ration et &#233;tiquetage automatique de 
dictionnaires linguistiques de l&#8217;arabe
</p>
<p>Mohamed BOUALLEGUE (2), Mohsen MARAOUI (2), Mourad MARS (1, 2)
Mounir ZRIGUI (1) 
</p>
<p>(1)Labo (UTIC : Equipe de Monastir) &#8211; Universit&#233; de Monastir
Facult&#233; des Sciences de Monastir
Mounir.Zrigui@fsm.rnu.tn
</p>
<p>(2)Labo LIDILEM, Universit&#233; STENDHAL, Grenoble, France
          {mohamed.bouall&#232;gue,Mohsen.maroui,Mourad.mars}@u-
grenoble3.fr 
</p>
<p>  
</p>
<p>R&#233;sum&#233;, L&#8217;objectif de cet article est la pr&#233;sentation d&#8217;un syst&#232;me de g&#233;n&#233;ration automatique 
de dictionnaires &#233;lectroniques de la langue arabe classique, d&#233;velopp&#233; au sein de laboratoire 
UTIC (unit&#233; de Monastir). Dans cet article, nous pr&#233;senterons, les diff&#233;rentes &#233;tapes de 
r&#233;alisation, et notamment la g&#233;n&#233;ration automatique de ces dictionnaires se basant sur une 
th&#233;orie originale : les Conditions de Structures Morph&#233;matiques (CSM), et les matrices 
lexicales. Ce syst&#232;me rentre dans le cadre des deux projets MIRTO et OREILLODULE r&#233;alis&#233;s 
dans les deux laboratoires LIDILEM de Grenoble et UTIC Monastir de Tunisie
</p>
<p>Abstract.  The objective of this article is the presentation of an automatic system of 
generation of dictionaries electronics of Arabic basing itself on the conditions of morphemic 
structure and the matrices lexical. This work returns within the framework of two projects 
MIRTO and OREILLODULE under development to laboratories LIDILEM of Grenoble and 
UTIC of Tunisia.
</p>
<p>Mots cl&#233;s&#160;: g&#233;n&#233;ration automatique, dictionnaire, conditions de structure morph&#233;matique.
Keywords: automatic system of generation, &#160; conditions of morphemic structure, matrices 
lexical.
</p>
<p>1 Introduction
L&#8217;arabe classique est une langue qui se caract&#233;rise par sa &#171; &#160;flexion interne &#160;&#187;. Il emploie </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pour sa morphologie nominale et verbale, des marques d&#8217;aspect, de mode, de temps, de 
personne, de genre, de nombre et de cas, qui peuvent &#234;tre des suffixes ou des pr&#233;fixes.
</p>
<p>Contrairement au fran&#231;ais, le syst&#232;me de l&#8217;arabe utilise pour ses d&#233;rivations une racine et 
non un radical. Cette racine est compos&#233;e uniquement de consonnes, au groupement desquelles 
est attach&#233;e une notion g&#233;n&#233;rale plus ou moins pr&#233;cise. Les diff&#233;rents mots qu&#8217;on tire d&#8217;une 
racine &#224; l&#8217;aide d&#8217;un jeu d&#8217;alternance vocalique sont appel&#233;s les d&#233;riv&#233;s verbaux et les d&#233;riv&#233;s 
nominaux.
</p>
<p>Les grammairiens arabes usent d&#8217;une notation particuli&#232;re qui substitue &#224; la repr&#233;sentation 
en C1C2C3, une racine r&#233;elle de la langue &#171;&#160;faAla&#160;&#187; exprimant l&#8217;id&#233;e d&#8217;agir, faire.
</p>
<p>La cr&#233;ation de mots se fait par l&#8217;insertion de voyelles &#224; l&#8217;int&#233;rieur d&#8217;une racine&#160;
</p>
<p>Plusieurs linguistes ont pouss&#233; l&#8217;id&#233;e de g&#233;n&#233;ration automatique de lexique &#224; partir des 
caract&#233;ristiques morphologiques et d&#233;rivationnelles de la langue arabe et les  conditions de 
structures morph&#233;matiques (CSM), comme Cantineau (Cantineau,1960) et Greenberg 
(Greenberg(1950) .Cette id&#233;e est &#224; la base de ce travail o&#249; nous pr&#233;senterons un syst&#232;me de 
g&#233;n&#233;ration et d&#8217;&#233;tiquetage automatique de dictionnaires arabes, en se basant sur les CSM, les 
matrices lexicales (ML), ainsi que leurs structures et leurs modes d&#8217;acc&#232;s (ZAAFRANI, 2004) 
(SILBERZTEIN, 1993). Nous nous focalisons sur le dictionnaire des racines admissibles et 
attest&#233;es. Nous appliquerons des proc&#233;dures autant que possible automatis&#233;es, pour engendrer 
un maximum d'entr&#233;es et d'informations et &#233;liminer les bruits &#160; : l&#8217;intervention manuelle des 
sp&#233;cialistes de la langue s&#8217;av&#232;re n&#233;cessaire dans certains cas bien d&#233;termin&#233;s et limit&#233;s pour 
&#233;liminer ces derniers. 
</p>
<p>Dans ce qui suit nous allons tout d&#8217;abord d&#233;tailler notre m&#233;thode de g&#233;n&#233;ration et &#233;tiquetage 
automatique qui se base sur les CSM et les ML&#160;: cette g&#233;n&#233;ration automatique s&#8217;aidant des CSM 
et ML, constitue l&#8217;originalit&#233; de cette m&#233;thode ainsi que leurs structures et leurs modes d&#8217;acc&#232;s&#160;; 
puis dans une deuxi&#232;me &#233;tape nous pr&#233;senterons le syst&#232;me r&#233;alis&#233;
</p>
<p>2 G&#233;n&#233;ration et Etiquetage automatique du dictionnaire&#160;
Le dictionnaire est bien sur un &#233;l&#233;ment capital pour une bonne performance de tout syst&#232;me 
</p>
<p>de traitement automatique de langage naturel, que ce soit en termes de couverture ou de 
pr&#233;cision. De m&#234;me le jeu de cat&#233;gories grammaticales utilis&#233; dans l&#8217;&#233;tiquetage a une forte 
influence sur la qualit&#233; du syst&#232;me (Chanod Tapaneinen, 1995). Il est clair qu&#8217;un syst&#232;me r&#233;duit 
de cat&#233;gories conduira souvent &#224; de meilleurs taux de r&#233;ussite qu&#8217;un syst&#232;me plus d&#233;taill&#233; 
(Merialdo, 1995).
</p>
<p>2.1 G&#233;n&#233;ration automatique du dictionnaire
</p>
<p>1.  Les conditions de structures morph&#233;matiques (CSM)
Les phon&#232;mes de l&#8217;arabe sont li&#233;s &#224; des restrictions combinatoires et des restrictions 
</p>
<p>s&#233;quentielles tr&#232;s strictes qui sont &#233;nonc&#233;es sous la forme de CSM. Ces conditions sont des 
r&#232;gles qui r&#233;gissent la g&#233;n&#233;ration des mots dans la langue arabe : un mot qui enfreint une 
condition ne peut pas appartenir &#224; l&#8217;arabe (HABAILI, 1976). 
</p>
<p>Cadre th&#233;orique:
Soit x l&#8217;ensemble des traits possibles d&#233;finis par la th&#233;orie linguistique. Soit C l&#8217;ensemble des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>28 consonnes de la langue arabe. Soit C1C2C3 une racine trilit&#232;re, avec C1, C2 et C3 &#1028; C. Soit 
MP[j] [k] la matrice phonologique (avec 1 &#8804; j &#8804; 14 et 1&#8804; k &#8804; 28) cette matrice repr&#233;sente 
l'ensemble des traits des consonnes de l'arabe. Soit V  l&#8217;ensemble des 6 voyelles de la langue 
arabe. Soit C1V1C2V2C3V3 une racine trilit&#232;re voyell&#233;e, avec V1, V2  et V3 &#1028; V.  Soit MPv
[j][k] la matrice phonologique des voyelles (avec 1 &#8804; j &#8804; 14 : l'ensemble des traits des voyelles 
de l&#8217;arabe et 1&#8804; k &#8804; 6 )
</p>
<p>Les linguistes d&#233;nombrent cinq CSM qui r&#233;gissent la formation des mots arabes. Ces 
conditions sont class&#233;es en deux types: les restrictions combinatoires et les restrictions 
s&#233;quentielles.
</p>
<p>                        1.1.  Restrictions combinatoires   
</p>
<p>Ces restrictions r&#233;gissent les sp&#233;cifications des traits correspondant aux phon&#232;mes de la 
langue arabes. Dans ce cas trois r&#232;gles sont &#224; &#233;noncer :
</p>
<p>1) CSM1 : tous les phon&#232;mes sont [-aspir&#233;s]
</p>
<p>Tout phon&#232;me de l'arabe est une colonne de x sp&#233;cifications correspondant &#224; ces x traits, les 
(x-quatorze) sp&#233;cifications qui ne sont pas repr&#233;sent&#233;es d&#233;coulent automatiquement des quatorze 
pr&#233;sentes en vertu de conditions propres &#224; l&#8217;arabe classique. La condition CSM1 distingue 
l&#8217;arabe classique de nombreuses langues naturelles qui opposent phon&#232;mes aspir&#233;s et non 
aspir&#233;s. C&#8217;est l&#8217;existence de telles restrictions valables pour tous les phon&#232;mes de l&#8217;arabe 
classique, qui a permis de ne faire figurer que quatorze  traits (HABAILI, 1976), parmi x traits 
possibles d&#233;finis par la th&#233;orie linguistique. 
</p>
<p>Si  ci   &#1028; C et  ci    C1C2C3 (avec 1&#8804; i &#8804; 28)  alors MP [aspir&#233;][i] = [0] . (1)
</p>
<p>2) CSM2 : tous les phon&#232;mes vocaliques sont [-nasal]
La condition CSM2 exclut les voyelles nasales de l&#8217;inventaire des phon&#232;mes de l&#8217;arabe 
</p>
<p>classique.
Si   vi   &#1028; V et  vi    C1V1C2V2C3V3 (avec 1&#8804; i &#8804; 6)  alors   MPv[nasale][ i ] = 
[0] .
</p>
<p>(2)
</p>
<p>3) CSM3 : tous les phon&#232;mes qui sont [+consonantiques] sont aussi [-syllabiques]
La condition CSM3 exclut les consonnes [+syllabiques]. Cette r&#232;gle est formul&#233;e de la 
</p>
<p>mani&#232;re suivante:
                          Si  MP[consonante][ i ] = [-] alors MP[syllabique][ k ] = [0] . (3)
</p>
<p>Outre les restrictions combinatoires entre les valeurs des traits appartenant &#224; un m&#234;me segment, 
il existe aussi des restrictions s&#233;quentielles.   
</p>
<p>1.2.  Restrictions s&#233;quentielles
</p>
<p>Ce sont des restrictions qui lient les sp&#233;cifications de traits appartenant &#224; des segments 
successifs de la matrice de l&#8217;arabe classique, ces restrictions refl&#232;tent le fait que n&#8217;importe quelle 
s&#233;quence de phon&#232;mes de l&#8217;arabe n&#8217;est pas un morph&#232;me-racine ou un allomorphe possible 
(variante combinatoire d&#8217;un phon&#232;me). Par exemple !&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;#&#1617;   et %&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&amp;&quot;&quot;&quot;'  sont des s&#233;quences de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>consonnes permises par la structure de la langue, mais pas&#8221; ()*  &#8220;  (SAIDANE, 2004).
</p>
<p>Le fait qu&#8217;il n&#8217;existe aucun morph&#232;me-racine dont la repr&#233;sentation phonologique soit &#8220; %&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&amp;' &#8221; 
n&#8217;est la s&#233;quence d&#8217;aucune contrainte structurelle, il s&#8217;agit seulement d&#8217;une lacune accidentelle : 
Il s&#8217;agit d&#8217;une combinaison admissible par la structure de la langue, mais qui est absente du 
lexique.  En revanche, des s&#233;quences telles que &quot; (&quot;)&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;# &quot; ou &quot; &#1584;,&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;* &quot; ne sont pas des morph&#232;mes-
racines possibles en arabe classique. La premi&#232;re enfreint la restriction qui est exprim&#233;e par la 
condition CSM4 et la seconde celle qui est exprim&#233;e par CSM5 :
</p>
<p>CSM4 : La condition CSM4 exclut de l&#8217;ensemble des morph&#232;mes-racines possibles en arabe 
classique toute s&#233;quence de phon&#232;mes form&#233;e de deux segments identiques, en premi&#232;re et en 
deuxi&#232;me consonne radicale. 
</p>
<p>Si     c, d   &#1028; C et  c, d   {C1C2C3} (tel que c = C1 et d = C2) alors (c &#8800;d). (4)
</p>
<p>CSM5 : La condition CSM5 interdit des consonnes identiques qui sont [+continu, +vois&#233;] en 
premi&#232;re et troisi&#232;me consonnes radicales.
</p>
<p>Si [(MP[continu][ i ] = [+], MP[vois&#233;][ i ] = [+] ) et (MP[continu ][ l ] = [+], 
MP[vois&#233;][ l ] =  [+] )   alors   ci,dl   C1C2C3 .
</p>
<p>(5)
</p>
<p>Puisque les CSM n&#8217;op&#232;rent que sur chaque allomorphe pris isol&#233;ment, elles ne rendent compte 
que des contraintes &#224; l&#8217;int&#233;rieur d&#8217;un m&#234;me morph&#232;me. D&#8217;o&#249;, le processus de g&#233;n&#233;ration des 
verbes n&#233;cessite l'utilisation d'autres outils, qui sont  les matrices lexicales (MOUSSA, 1973).
</p>
<p>En vue du traitement automatique, nous avons repr&#233;sent&#233; les conditions de structure 
morph&#233;matique sous forme d&#8217;une matrice binaire dans laquelle le chiffre 0 indique l&#8217;absence du 
trait correspondant et le 1 la pr&#233;sence du trait&#160;:
</p>
<p> 
MATRICE PHONOLOGIQUE (incompl&#232;tement sp&#233;cifi&#233;e)
Grap
</p>
<p>h&#232;me &#1576; &#1578; &#1591; &#1583; &#1590;&#1603; ' &#1601; &#1579; &#1584; &#1592; &#1587;&#1589;&#1586; &#1588; 0 1 &#1594; 3 &#1593; &#1605; &#1606; &#1604; &#1585; &#1608; &#1610; &#1607; &#1571; i a u
Phon
&#232;me b t
</p>
<p>d k q f &#932; s z &#931; &#958; m n l r w &#981; h E &#1616; &#1614; &#1615;
sonn
ant 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1
</p>
<p>syll 0 1 1 1
cons 1 1 0 0 0 0
cont 0 0 0 0 0 0 0 1 1 1 1 0 1 0 1 1 1 1 0
nas 0 0 1 1 0
ant 1 1 1 1 1 1 1 1 1 1 1 1 0 0 1 1 0 0 0
cor 0 1 1 1 1 0 0 0 1 1 1 1 1 1 1 1 0 0 0 0 0 1 1 1 0 0 0 0
voix 1 0 0 1 1 0 0 0 0 1 1 0 0 1 0 1 0 1 0 1 1 1 1 1 0 0
</p>
<p>stride
nt 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0
</p>
<p>rhizo 1 1 1 1
haut 0 0 0 1 0 0 0 0 1 1 1 1 0 0 0 0 1 1 1 1</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>bas 0 0 0 0 0 0 0 0 0 1 1 0 0 1 1 0 1 0
arri&#233;r
</p>
<p>e 1 1 1 1 1 1 0 0 1 1 1 1 1 0 0 0 0 0 1
</p>
<p>   
</p>
<p>2. Matrices Lexicales&#160;
</p>
<p>2.1.  Matrices Lexicales Trilit&#232;res (MLT)
&#192; partir du dictionnaire r&#233;f&#233;rence&quot; -&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;.&#1580; &#1575;1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;2&quot;3&#1608;&#1587;  &quot;, &#171;&#160; taj el arous&#160;&#187;, nous avons &#233;tablis des 
</p>
<p>matrices lexicales bidimensionnelles qui repr&#233;sentent la position des consonnes dans une racine 
trilit&#232;re (HADDAD, 2004). Aux 28 consonnes de la langue arabe correspondent donc 28 
matrices lexicales. En effet nous avons transform&#233;s les racines trilit&#232;res du dictionnaire en des 
matrices d&#233;crivant les racines attest&#233;es. 
</p>
<p> Ce sont des matrices binaires Mi, avec 1&#8804; i &#8804; n (n = 28 : nombre des consonnes). 
</p>
<p>Mi [j][k] exprime les raines CiCjCk (avec i,j et k &#1028; [1..28])(exemple %6'   KTB), tel que :
Mi[][]  indique la lettre qui est en premi&#232;re position dans la racine CiCjCk (&#1603;) K
Mi[j][] indique la lettre qui est en deuxi&#232;me position dans la racine CiCjCk  (&#1578;) T
Mi[][k] indique la lettre qui est en troisi&#232;me position dans la racine CiCjCk (&#1576;) B
</p>
<p>Cette mod&#233;lisation matricielle nous a permis de distinguer les cas suivants&#160;:
</p>
<p>&#8226; Si Mi [j][k]= 1 alors la racine CiCjCk est une racine attest&#233;e par le dictionnaire -&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;.&#1580;  
&#1575;123&#1608;&#1587;  (exemple %6' )
</p>
<p>&#8226; Si (Mi [j][k]= 0) alors la racine CiCjCk n&#8217;est pas attest&#233;e par le dictionnaire &#8220; -&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;.&#1580;  
&#1575;123&#1608;&#1587;  &#8221;.(exemple :;* ).
</p>
<p>Nous pouvons sch&#233;matiser comme suit cette repr&#233;sentation:
Mi [j][k] Ci  = &#1603;1               &#1578;   Ck                     28
</p>
<p>  1
</p>
<p>&#1576;  Cj 000000000010000000000000
</p>
<p>  28
</p>
<p>                                             Figure 1&#160;: Repr&#233;sentation de la matrice lexicale
Le tableau suivant repr&#233;sente un extrait de la matrice lexicale correspondant &#224; la consonne 
</p>
<p>&#171; tha &#187; &#1592;  en deuxi&#232;me position :
</p>
<p>&#1610; &#1608; &#1607; &#1606; &#1605; &#1604; &#1603; ' &#1601; &#1593; &#1593; &#1592; &#1591; &#1590; &#1589; &#1588; &#1587; &#1586; &#1585; &#1584; &#1583; 1 3 0 &#1579; &#1578; &#1576; &#1571;
0 0 0 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 1 1 0 &#1571;
1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 1 &#1576;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 &#1578;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 &#1579;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 3
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 &#1583;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 &#1584;
1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0 1 1 &#1585;
</p>
<p>2.2. Matrices Lexicales Quadrilat&#232;res (MLQ)
</p>
<p>Les matrices lexicales quadrilat&#232;res sont des matrices bidimensionnelles qui repr&#233;sentent la 
position des consonnes dans une racine quadrilat&#232;re. En s'inspirant de &quot; -&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;.&#1580; &#1575;1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;2&quot;3&#1608;&#1587;  &quot;, et du 
&quot; &#1575;1&lt;.!= &gt;? -@3AB &#1575;C&gt;2.&#1604; &#1575;123,E&#1617;F  &quot;, nous avons pu &#233;tablir 28 matrices comme suit :
</p>
<p>Soit Mi une matrice, avec 1&#8804; i &#8804;28. Soit Q une repr&#233;sentation d&#8217;une racine quadrilit&#232;re 
quelconque attest&#233;e par la langue arabe&#160; ; soit C1C2C3 une repr&#233;sentation d&#8217;une racine trilit&#232;re 
attest&#233;e et qui a donn&#233;e la racine quadrilat&#232;re Q, avec C1, C2  et C3 &#1028; C. Mi [j][k] exprime les 
racines CiCjCk (avec i, j et k &#1028; [1..28])
</p>
<p>Ces matrices bidimensionnelles sont  formul&#233;es de la mani&#232;re suivante :
&#8226; Si Mi [j][k]= 1 alors la racine CiCjCk est une racine attest&#233;e et Q est la racine 
</p>
<p>quadrilit&#232;re g&#233;n&#233;r&#233;e de CiCjCk par d&#233;rivation avec le sch&#232;me &quot; &gt;.G= &quot;, comme &quot; %.-' &quot;.
&#8226; Si Mi [j][k]= 2 alors la racine CiCjCk est une racine attest&#233;e et Q est la racine 
</p>
<p>quadrilit&#232;re g&#233;n&#233;r&#233;e de CiCjCk par d&#233;rivation avec le sch&#232;me &quot; &gt;2&#1617;= &quot;, comme &quot; ,2&#1617;# &quot;.
&#8226; Si Mi [j][k]= 3 alors la racine CiCjCk est une racine attest&#233;e et Q est la racine 
</p>
<p>quadrilit&#232;re g&#233;n&#233;r&#233;e de CiCjCk par d&#233;rivation avec le sch&#232;me &quot; &#1571;&gt;2= &quot;  , comme &quot; &#1571;,2# &quot;.
&#8226; Si Mi [j][k]= 4 alors la racine CiCjCk est une racine attest&#233;e et Q est la racine 
</p>
<p>quadrilit&#232;re g&#233;n&#233;r&#233;e de CiCjCk par d&#233;rivation avec le sch&#232;me &quot; &gt;2I= &quot;  , comme &quot; &#1586;1K&#1604; &quot;.
&#8226; Si Mi [j][k]= x, avec x &#1028; [ &#1571; &#1576; &#1580; &#1583;...&#1607; &#1608; &#1610; ] , alors  Q =  CiCjCk x , comme &quot; OPQ= &quot;.
&#8226; Sinon (Mi [j][k]= 0) alors la racine CiCjCk n&#8217;est pas attest&#233;e par le dictionnaire &quot; &quot; 
</p>
<p>-.&#1580; &#1575;123&#1608;&#1587; .
Mi [j][k]         Ci = &#1603; 1                &#1578;  Ck       28
</p>
<p>                                 1
</p>
<p>  &#1576;                          Cj             010231 &#1587; &#1604; 240
                                28
</p>
<p>               Figure 2&#160;: Repr&#233;sentation de la matrice lexicale quadrilit&#232;re
</p>
<p>2.2 Etiquetage automatique du dictionnaire&#160;
L&#8217;&#233;tiquetage consiste &#224; affecter &#224; chaque lex&#232;me toutes les informations&#160;; morphologiques, 
</p>
<p>syntaxique et statistiques (classe grammaticale, code de conjugaison pour le verbe, code de 
d&#233;clinaison pour le nom, indice d'aspect, de mode, de temps, de personne, de genre, de nombre 
et de cas, fr&#233;quence d&#8217;apparition,&#8230;). Nous pr&#233;sentons dans ce qui suit quelques observations 
concernant la morphologie de l&#8217;arabe, en rappelant toutefois qu'il ne s'agit pas de discuter le 
bien-fond&#233; linguistique des divers concepts que nous allons pr&#233;senter, mais nous voulons 
simplement appr&#233;cier dans quelle mesure chaque concept nous aide &#224; atteindre notre objectif, &#224; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>savoir l&#8217;&#233;tiquetage automatique du dictionnaire arabe.
</p>
<p>1. Caract&#232;re d&#233;rivationnel&#160;   
</p>
<p>Il semble g&#233;n&#233;ralement admis qu'en arabe il existe un m&#233;canisme morphologique qui permet 
de d&#233;crire une large partie des formes canoniques du lexique. Ce m&#233;canisme est bas&#233; sur la 
notion de sch&#232;me. Un sch&#232;me est g&#233;n&#233;ralement d&#233;fini comme un mod&#232;le qui d&#233;crit un groupe de 
mots partageant certaines propri&#233;t&#233;s linguistiques (phonologiques, morphologiques, syntaxiques 
et s&#233;mantiques). Sous l'angle morphologique et selon notre centre d'int&#233;r&#234;t, le sch&#232;me est  
simplement une sorte de fonction dans laquelle viennent se couler les racines pour former des 
mots. La combinaison d'un petit nombre de sch&#232;mes (14 sch&#232;mes nominaux et 10 sch&#232;mes 
verbaux) avec l'ensemble des racines attest&#233;es suffirait donc pour d&#233;crire la majorit&#233; des mots 
arabes. Cette observation nous a permis de g&#233;n&#233;rer de fa&#231;on  automatique la presque totalit&#233; du 
lexique arabe en partant de l'ensemble des racines et de l'ensemble des sch&#232;mes&#160;.
</p>
<p>D&#233;sormais, le probl&#232;me n'est pas aussi simple. L'application syst&#233;matique du principe de 
d&#233;rivation d&#233;crit ci-dessus nous permet de g&#233;n&#233;rer artificiellement certains mots ne r&#233;pondant 
pas aux crit&#232;res d&#8217;appartenance &#224; la langue. La raison en est qu'en r&#233;alit&#233;, certains sch&#232;mes ne 
peuvent pas aller avec certaines racines. Si la majorit&#233; des mots de la langue peuvent toujours 
&#234;tre ramen&#233;s &#224; une racine et &#224; un sch&#232;me, toutes les racines et tous les sch&#232;mes ne peuvent &#234;tre 
crois&#233;s pour former des mots de la langue arabe.
</p>
<p>Toutefois, pour que le lexique g&#233;n&#233;r&#233; soit exempt d'erreurs, nous devons accompagner cette 
proc&#233;dure automatique d'une autre proc&#233;dure manuelle. Selon les d&#233;marches possibles 
suivantes :
</p>
<p>&#8226; Mener &#224; posteriori une op&#233;ration de correction, qui vise &#224; &#233;liminer les mots 
g&#233;n&#233;r&#233;s &#224; partir de croisements inopportuns entre racine et sch&#232;mes. 
</p>
<p>&#8226; Effectuer en amont, un travail  pr&#233;paratoire permettant de d&#233;finir les appariements 
possibles entre racines et sch&#232;mes; et proc&#233;der en aval, &#224; l'&#233;limination des mots 
&#233;ventuellement g&#233;n&#233;r&#233;s de fa&#231;on abusive. Plus cet appariement initial sera fin, 
moins il y aura de mots incorrects g&#233;n&#233;r&#233;s.
</p>
<p>Nous avons choisi la seconde d&#233;marche qui nous semble plus exhaustive en vue que cette 
t&#226;che est confi&#233;e au lexicographe (c&#8217;est le linguiste qui v&#233;rifie les sch&#232;mes et les d&#233;riv&#233;es). 
</p>
<p>Les appariements possibles sont  assur&#233;s par les matrices de d&#233;rivation verbale et nominale&#160;; 
Ces matrices binaires d&#233;finissent, pour chaque racine, les d&#233;riv&#233;es possibles (verbales pour la 
matrice de d&#233;rivation verbale et nominale pour la matrice de d&#233;rivation nominale). Elles  sont 
formul&#233;es de la mani&#232;re suivante&#160;:
</p>
<p>                              Figure 3&#160;: Matrice de d&#233;rivation Verbale
</p>
<p>Si  MDv[i][j] = 1 alors le sch&#232;me chj co&#239;ncide avec vi  et le d&#233;riv&#233; Dvi,j existe
</p>
<p>Si  MDv[i][j] = 0 alors le sch&#232;me chj ne co&#239;ncide pas avec vi et le d&#233;riv&#233; Dvi,j n&#8217;existe pas
</p>
<p>Ces matrices seront g&#233;n&#233;r&#233;es une seule fois par un linguiste, mais leur utilisation est 
indispensable dans la g&#233;n&#233;ration automatique des d&#233;riv&#233;s verbaux et nominaux.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2. Caract&#232;re flexionnel&#160;
</p>
<p>&quot;L'arabe est une langue &#224; flexions. Elle emploie, pour la conjugaison du verbe et pour la 
d&#233;clinaison du nom, des indices d'aspect, de mode, de temps, de personne, de genre, de 
nombre et de cas, qui sont en g&#233;n&#233;ral des suffixes.&quot; [CHI 98] 
</p>
<p>Les principes de suffixation et de pr&#233;fixation des mots permettant la conjugaison des verbes 
et la d&#233;clinaison des noms sont connus et, ils donnent l'impression d'&#234;tre facilement 
automatisables. Nous serions donc tent&#233;s d'automatiser l'op&#233;ration de g&#233;n&#233;ration de mani&#232;re 
compl&#232;te les formes fl&#233;chies. 
</p>
<p>        3. Fr&#233;quence d&#8217;apparition&#160;
</p>
<p>Bien que le dictionnaire ne comporte pas v&#233;ritablement de probabilit&#233;s, il indique pour chaque 
mot sa fr&#233;quence d&#8217;apparition &#160; : cette fr&#233;quence est d&#233;duite &#224; partir d&#8217;un corpus &#233;tiquet&#233;, le 
corpus sur lequel nous avons travaill&#233; est constitu&#233; d&#8217;un ensemble de textes vari&#233;s, repr&#233;sentant 
un volume global de 100 000 mots.
</p>
<p>D&#8217;o&#249; la complexit&#233; du dictionnaire est de la forme&#160;:
Complexit&#233; = 
O&#249; V d&#233;signe la taille du vocabulaire, A(mi) d&#233;note l&#8217;ambigu&#239;t&#233; grammaticale du mot mi , 
</p>
<p>c&#8217;est-&#224;-dire le nombre de classes grammaticales diff&#233;rentes qui peuvent &#234;tre affect&#233;s au mot mi.
</p>
<p>3 Description du syst&#232;me r&#233;alis&#233; 
3.1. Les dictionnaires 
</p>
<p>Le syst&#232;me permet de g&#233;n&#233;rer automatiquement cinq dictionnaires de racines trilit&#232;res et 
quadrilit&#232;res &#233;tiquet&#233;s :
</p>
<p>&#8226; Le dictionnaire th&#233;orique (21952 racines = (28)^3). Il contient toutes les racines 
trilit&#232;res th&#233;oriquement possibles de l&#8217;arabe standard.
</p>
<p>&#8226; Le dictionnaire des racines admissibles (20415 racines) : Il contient les racines qui 
n&#8217;enfreignent aucune des  (CSM).
</p>
<p>&#8226; Le dictionnaire des racines attest&#233;es (7836): Il contient les racines utilis&#233;es dans la 
langue arabe et qui sont tir&#233;es des tableaux de r&#233;partitions construits &#224; partir du grand 
dictionnaire arabe &#1575;1@R.&#1581; T,U &#1575;1&amp;PV3&#1610; )).
</p>
<p>&#8226; Le dictionnaire des racines admissibles (13023 racines): Il contient les racines 
admissibles par la langue arabe mais non attest&#233;es. Ces racines peuvent &#234;tre utilis&#233;es 
pour enrichir la langue arabe par d&#8217;autres mots nouveaux.
</p>
<p>&#8226; Le dictionnaire des racines quadrilit&#232;res (4000 racines) : Il contient les racines 
quadrilit&#232;res attest&#233;es ;  qui sont tir&#233;es des matrices lexicales quadrilit&#232;res. 
</p>
<p>Certaines racines trilit&#232;res attest&#233;es n&#8217;ob&#233;issent pas &#224; une ou plusieurs CSM : nous avons 
cr&#233;&#233; un sixi&#232;me dictionnaire (203 racines) qui regroupe ces racines, avec pour chacune, 
l&#8217;affichage de la CSM qui n&#8217;est pas v&#233;rifi&#233;e. Exemple : la racine ( ,&quot;&quot;&quot;W' ) est attest&#233;e mais ne v&#233;rifie 
pas la condition CSM4. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.2  G&#233;n&#233;ration du dictionnaire principal 
</p>
<p>1. La forme des d&#233;riv&#233;es des racines trilit&#232;res (entr&#233;es)
</p>
<p>Le processus de d&#233;rivation se r&#233;alise &#224; partir d&#8217;une racine trilit&#232;re par pr&#233;fixation, 
infixation ou suffixation selon des mod&#232;les (ou sch&#232;mes) en nombre limit&#233;. Il y  a deux 
types de formes :
</p>
<p>&#8226; Les formes des d&#233;riv&#233;s verbaux.
&#8226; Les formes des d&#233;riv&#233;s nominaux.
</p>
<p>Ces formes sont repr&#233;sent&#233;es par les deux figures suivantes&#160;: 
</p>
<p>Figure  4&#160;: Les formes des d&#233;riv&#233;s verbaux
</p>
<p>Figure 5. Les formes des d&#233;riv&#233;s nominaux
</p>
<p>A partir du dictionnaire attest&#233;, des d&#233;riv&#233;es verbales conjugu&#233;es pour tous les pronoms 
de l&#8217;arabe ( &#1571;X&quot;., V&quot;P, V?, X&quot;RU ,&#8230;) et dans les cinq temps de la langue arabe ( &#1575;Y&quot;3&gt;&quot;P&#1593; &#1575;Y&quot;;.&#1585;&#1593;,  
</p>
<p>&#1575;Y&quot;&quot;;.&#1585;&#1593; &#1575;Y&quot;&quot;\@P&#1576;, &#1575;Y&quot;&quot;;.&#1585;&#1593; &#1575;Y&amp;&quot;&quot;K&#1608;&#1605;, &#1575;Y&quot;&quot;.^?, &#1575;C!&quot;&quot;3 ) et des d&#233;riv&#233;es nominales canoniques qui 
ont subis une d&#233;clinaison, Nous avons g&#233;n&#233;r&#233; le dictionnaire capital qui contient les 
mots et les verbes comme ils se pr&#233;sentent dans l&#8217;&#233;criture et dans les textes arabes  
La forme g&#233;n&#233;rale associ&#233;e &#224; chaque entr&#233;e de ce dictionnaire est compos&#233;e des huit 
zones suivantes :   
&#8226; Zone 1 : la forme canonique de l&#8217;entr&#233;e (entr&#233;e sous forme norm&#233;e c&#8217;est &#224; dire la 
racine trilit&#232;re). 
&#8226; Zones 2,3 et 4 : l&#8217;ensemble de d&#233;riv&#233;es verbales : ces d&#233;riv&#233;es respectent des 
mod&#232;les (sch&#232;mes) pr&#233;cis  et sont g&#233;n&#233;r&#233;es selon le besoin par un algorithme appropri&#233;, 
avec le  code de d&#233;rivation et du code de conjugaison  associ&#233; &#224; chaque d&#233;riv&#233;e verbale.
&#8226; Zone 5, 6,7 et 8 l&#8217;ensemble des d&#233;riv&#233;es nominaux : ces d&#233;riv&#233;es respectent des 
mod&#232;les (sch&#232;mes) pr&#233;cis et sont g&#233;n&#233;r&#233;s selon le besoin par un algorithme appropri&#233;, 
en plus du code morphosyntaxique et le code de d&#233;rivation, une information flexionnelle 
est associ&#233;e &#224; chaque d&#233;riv&#233;e nominale.
</p>
<p>Figure 6 :   Association entr&#233;e / information
</p>
<p>Conclusion
La g&#233;n&#233;ration automatique du dictionnaire des racines trilit&#232;res et quadrilit&#232;res en utilisant les 
</p>
<p>CSM et les ML fait l&#8217;originalit&#233; de ce travail. Ce dictionnaire sera &#224; la base de toute analyse 
morphosyntaxique de l&#8217;arabe, il regroupe les racines du grand dictionnaire ( !&quot;&quot;2&quot;&quot;&amp;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;_ &#1575;1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;@&quot;&quot;R&quot;&quot;.&#1581; ), 
auquel on peut ajouter d&#8217;autres dictionnaires.
</p>
<p>Le dictionnaire principal, r&#233;sultat de ce syst&#232;me, contient 368762 formes de l'arabe : ce 
dictionnaire est g&#233;n&#233;r&#233; automatiquement &#224; la demande de l&#8217;utilisateur donc ne pose pas de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>probl&#232;mes d&#8217;encombrement en m&#233;moire. 
</p>
<p>R&#233;f&#233;rences
A. HADDAD, (2004). Un syst&#232;me de g&#233;n&#233;ration automatique de dictionnaires linguistiques et 
th&#233;matiques de la langue arabe. Mast&#232;re en informatique, Ecole Nationale des Sciences de 
l'informatique, TUNISIE.  
</p>
<p>A.H. MOUSSA, (1973). Statistical study of Arabic roots in moijam arous. Kouweit.
</p>
<p>CANTINEAU, Jean ( 1960) . Etudes de linguistique arabe. M&#233;morial Jean Cantineau, Paris, 
Klincksieck
</p>
<p>CHANOD, J.-P et TAPANAINEN,P. (1995) : &#8220;Creating a tagset, lexicon and guesser for a 
french tagger &#8221; In Proceedings of EACL SIGDAT workshop on From Texts To Tags: Issues 
In Multilingual Language Analysis.
</p>
<p>GREENBERG, Joseph (1950): &#8220;The Patterning of root morpheme in Semitic&#8221; in Word, vol. 6, 
pp: 162-181.
</p>
<p>H. HABAILI, (1976). Contraintes de structure morph&#233;matique en Arabe, DEA en linguistique, 
Canada, universit&#233; de Montr&#233;al.
</p>
<p>MERIALDO B, (1995):&#8221;Mod&#232;les probabilistes et &#233;tiquetage automatique&#8221; TAL, volume 36, 
1995.
</p>
<p>M. SILBERZTEIN, (1993).Dictionnaires &#233;lectroniques et analyse automatique de textes (Le 
syst&#232;me INTEX). (Masson, Paris)
</p>
<p>R. ZAAFRANI,(2004). Un dictionnaire &#233;lectronique pour apprenant de l'arabe (langue 
seconde) bas&#233; sur corpus. JEP-TALN 2004, F&#232;s, Maroc.
</p>
<p>T. SAIDANE, A. HADDAD, M. ZRIGUI, M. BEN AHMED, (2004). R&#233;alisation d&#8217;un 
syst&#232;me hybride de synth&#232;se de la parole arabe utilisant un dictionnaire de polyphones
JEP-TALN 2004, F&#232;s, Maroc.</p>

</div></div>
</body></html>