<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse quantitative et qualitative de citations extraites d&#8217;un corpus journalistique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Analyse quantitative et qualitative de citations extraites d&#8217;un
corpus journalistique
</p>
<p>Fabien Poulard
Universit&#233; de Nantes, LINA CNRS UMR 6241, 44322 Nantes Cedex 3
</p>
<p>Fabien.Poulard@univ-nantes.fr
</p>
<p>R&#233;sum&#233;. Dans le contexte de la d&#233;tection de plagiats, le rep&#233;rage de citations et de ses
constituants est primordial puisqu&#8217;il peut aider &#224; &#233;valuer le caract&#232;re licite ou illicite d&#8217;une re-
prise (source cit&#233;e ou non). Nous proposons ici une &#233;tude quantitative et qualitative des citations
extraites d&#8217;un corpus que nous avons auparavant construit. Cette &#233;tude a pour but de tracer des
axes de recherche vers une m&#233;thode de rep&#233;rage automatique des citations.
</p>
<p>Abstract. In the plagiarism detection context, finding citations and their components is
essential as it may help estimating legal value of a copy (with or without original source spe-
cified). We propose here a quantitative and qualitative study of citations we extracted from a
corpus we previously built. This study aims at orienting our research towards an efficient auto-
matic citations extraction method.
</p>
<p>Mots-cl&#233;s : citations, contruction et &#233;tude de corpus, genre journalistique.
</p>
<p>Keywords: citations, corpus creation and analysis, journalistic genre.
</p>
<p>1 Introduction
</p>
<p>Le probl&#232;me d&#8217;identification des paroles et leurs porteurs a &#233;t&#233; &#233;tudi&#233; sous diff&#233;rents axes. En
anglais notamment, (Teufel et al., 2006) se sont int&#233;ress&#233;s aux citations scientifiques alors que
(Prasad et al., 2007; Kim &amp; Hovy, 2006) ont travaill&#233; sur les opinions dans des genres plus
vari&#233;s et notamment le genre journalistique. Ces travaux ont montr&#233; l&#8217;importance de l&#8217;identifi-
cation des paroles et de leurs porteurs dans les t&#226;ches courantes du TAL (r&#233;sum&#233; automatique,
extraction d&#8217;information, . . .). En fran&#231;ais, (Mourad &amp; Descl&#233;s, 2002; Giguet &amp; Lucas, 2004)
ont travaill&#233; sur l&#8217;&#233;laboration de mod&#232;les g&#233;n&#233;raux de rep&#233;rage automatique des citations dans
le genre journalistique. Leurs travaux ne fournissent toutefois pas de r&#233;sultats exp&#233;rimentaux.
</p>
<p>La citation est une forme de reprise utilis&#233;e dans les articles scientifiques afin de faire r&#233;f&#233;rence
&#224; des travaux ant&#233;rieurs et se positionner par rapport &#224; ces derniers (Choi et al., 2005; Teufel
et al., 2006). Dans les articles journalistiques elle &#233;taie le propos du journaliste qui recontex-
tualise le discours original (Jackiewicz, 2007). Dans le cadre du projet PIITHIE1(Plagiats et
Impacts de l&#8217;Information Textuelle recHerch&#233;e dans un contexte InterlinguE), les citations sont
des marques de l&#8217;impact d&#8217;une information. En effet, le contenu des citations reste globalement
inchang&#233; parmi les articles traitant d&#8217;un m&#234;me sujet. Contrairement &#224; la typologie propos&#233;e par
</p>
<p>1Ce travail a b&#233;n&#233;fici&#233; d&#8217;une aide de l&#8217;Agence Nationale de la Recherche, projet PIITHIE portant la r&#233;f&#233;rence
2006 TLOG 013 03. www.piithie.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard
</p>
<p>(Jackiewicz, 2007) qui n&#233;cessite une analyse fine de la citation et son contexte, nous d&#233;crivons
ici les formes citationnels &#224; partir d&#8217;&#233;l&#233;ments de surface. Nous nous appuyons sur la forme ca-
nonique SRD2 de (Giguet &amp; Lucas, 2004) sur laquelle nous revenons plus en d&#233;tails dans la
section 4.1.2.
</p>
<p>Dans cet article, nous cherchons &#224; tracer des pistes pour la mise au point de m&#233;thodes efficaces
d&#8217;extraction automatique des citations, &#224; partir de citations observ&#233;es au sein d&#8217;un corpus que
nous avons constitu&#233;. Nous nous int&#233;ressons &#224; la fois &#224; ce qui est rapport&#233; par l&#8217;&#233;nonciateur, ce
que nous d&#233;signons par discours repris, et aux termes du discours faisant r&#233;f&#233;rence &#224; la source
reprise, ce que nous d&#233;signons par expression locuteur. Ainsi dans l&#8217;exemple (1) ci-dessous, sa
m&#232;re est l&#8217;expression locuteur tandis que Julien faisait une sieste dans l&#8217;appartement familial
lorsqu&#8217;il a disparu est le discours repris.
</p>
<p>(1) D&#8217;apr&#232;s sa m&#232;re, Julien faisait une sieste dans l&#8217;appartement familial lorsqu&#8217;il a disparu.
</p>
<p>Nous pr&#233;sentons dans un premier temps notre d&#233;marche pour la constitution du corpus d&#8217;ob-
servation. Nous d&#233;crivons ensuite quantitativement les citations afin d&#8217;appr&#233;cier globalement
leur distribution et leur structure dans le corpus. Puis, nous les d&#233;crivons qualitativement afin de
faire &#233;merger des marques utilisables par des m&#233;thodes de rep&#233;rage automatique. Finalement,
nous proposons un sch&#233;ma d&#8217;annotation des citations.
</p>
<p>2 Construction du corpus et rep&#233;rage des citations
</p>
<p>Il nous semble n&#233;cessaire de travailler sur des exemples attest&#233;s, mais il n&#8217;existe pas &#224; notre
connaissance de corpus fran&#231;ais o&#249; les citations sont annot&#233;es, contrairement &#224; l&#8217;anglais (Prasad
et al., 2007). Seul le groupe Ci-dit3 propose des corpus de citations extraites de leur contexte.
Nous pr&#233;sentons tout d&#8217;abord la d&#233;finition des besoins, puis la s&#233;lection et la structuration des
textes.
</p>
<p>Le corpus doit &#234;tre repr&#233;sentatif, en terme de citations, de la presse francophone. Nous choisis-
sons de puiser dans la presse g&#233;n&#233;raliste qui pr&#233;sente un large panel de styles d&#8217;&#233;criture, tout
en privil&#233;giant la vari&#233;t&#233; des journaux et des auteurs. Le corpus constitu&#233; doit avoir une taille
raisonnable pour &#234;tre annot&#233; &#224; la main, mais &#234;tre suffisamment riche en citations. Afin d&#8217;&#233;viter
de tronquer des citations, &#233;tant donn&#233; la difficult&#233; &#224; d&#233;terminer leurs bornes, nous conservons
l&#8217;int&#233;gralit&#233; des textes. Finalement, les textes s&#233;lectionn&#233;s doivent &#234;tre stock&#233;s dans un format
num&#233;rique pour faciliter leur manipulation automatique.
</p>
<p>Nous avons choisis quatre quotidiens nationaux (Lib&#233;ration, Challenges, Le Monde, Le Figaro)
et un quotidien Belge (Le Soir) comme panel repr&#233;sentatif. La taille des articles dans ces jour-
naux est d&#8217;environ 600 mots. Nous avons s&#233;lectionn&#233; une dizaine d&#8217;articles par journal, publi&#233;s
la semaine du 19 F&#233;vrier 2007, et plac&#233;s en Unes, ce qui est gageure d&#8217;une certaine qualit&#233; &#233;di-
toriale. Le corpus totalise ainsi 53 articles issus de cinq journaux diff&#233;rents, repr&#233;sentant plus
de 36000 mots r&#233;partis au sein de 1200 phrases (cf. Tableau 1).
</p>
<p>Le contexte graphique (publicit&#233;s, menus, . . .) ne nous int&#233;ressant pas, nous avons sauvegard&#233;
chaque article original, puis stock&#233; une version &#233;pur&#233;e de ces artefacts sous la forme d&#8217;un arbre
XML. Les informations de mise en forme comme l&#8217;italique, le gras et les emphases ont &#233;t&#233;
</p>
<p>2Source, Relateur, Discours
3http://www.ci-dit.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse quantitative et qualitative de citations extraites d&#8217;un corpus journalistique
</p>
<p>Journal Nb. articles Nb. mots Nb. phrases
Lib&#233;ration 10 7336 246
Le Soir 10 4583 177
</p>
<p>Challenges 11 11636 427
Le Monde 12 7035 193
Le Figaro 10 5637 159
Totaux 53 36227 1202
</p>
<p>TAB. 1 &#8211; R&#233;partition des &#233;l&#233;ments du corpus par journal.
</p>
<p>conserv&#233;es puisqu&#8217;elles repr&#233;sentent des marques potentielles pour le rep&#233;rage automatique des
citations. Les versions HTML en ligne n&#8217;offrant pas de structuration du contenu, nous avons
&#233;galement balis&#233;, au sein de l&#8217;arbre XML, les titres, les sous-titres et les paragraphes.
</p>
<p>Les articles du corpus sont &quot;autonomisable&quot; (Habert, 2000), afin d&#8217;&#234;tre utilisables en dehors du
cadre initial pour lequel ils ont &#233;t&#233; collect&#233;s. Chaque article est accompagn&#233; de son contexte de
publication : nom du journal, url &#224; laquelle il a &#233;t&#233; r&#233;cup&#233;r&#233;, auteurs, date de publication, . . .
Ces informations permettent de replacer l&#8217;article dans son contexte d&#8217;&#233;criture, et en p&#233;rennisent
l&#8217;acc&#232;s en cas de retrait &#233;ventuel de la version en ligne. Des standards tels que le Text Encoding
Initiative (TEI) proposent un tel format de structuration, nous avons toutefois choisi une DTD
simplifi&#233;e qui semblait mieux r&#233;pondre &#224; nos besoins.
</p>
<p>3 Analyse quantitative des citations du corpus
</p>
<p>Une fois le corpus constitu&#233;, nettoy&#233; et organis&#233;, nous en extrayons manuellement les citations.
Nous d&#233;crivons dans un premier temps la distribution des objets citationnels en son sein, puis
les styles de discours rapport&#233; reconnus.
</p>
<p>3.1 Distribution des &#233;l&#233;ments citationnels dans le corpus
</p>
<p>Nous avons rep&#233;r&#233; pr&#232;s de 800 objets citationnels (discours repris, expressions locuteur) parmi
les 53 articles du corpus, soit environ 400 citations (8 citations par article en moyenne). La
figure 1 montre la distribution des citations parmi les articles : les lignes verticales marquent
l&#8217;amplitude de la variation du nombre de citations par article tandis que les cadres repr&#233;sentent
l&#8217;intervalle de confiance4. Les variations au sein m&#234;me des journaux sont importantes, l&#8217;appar-
tenance &#224; un m&#234;me journal ne semble donc pas influer sur la pr&#233;sence des citations.
</p>
<p>Nous nous concentrons dans la section suivante sur la structure des citations.
</p>
<p>3.2 Distribution des styles de discours
</p>
<p>&#201;tant donn&#233;e une situation d&#8217;&#233;nonciation initiale, un discours extrait de cette &#233;nonciation aura
une repr&#233;sentation linguistique diff&#233;rente selon le style auquel il est rapport&#233;. Nous avons pris
en consid&#233;ration les styles suivants :
</p>
<p>4Intervalle o&#249; l&#8217;on retrouve la majorit&#233; de la population pour une distribution Gaussienne :
[Moyenne&#8722; &#963;;Moyenne+ &#963;]</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard
</p>
<p>FIG. 1 &#8211; R&#233;partition des citations par articles et par journaux
</p>
<p>&#8211; style direct entre guillemets : le discours repris est plac&#233; entre guillemets sans que l&#8217;auteur
n&#8217;apporte de modifications morpho-syntaxiques importantes ;
</p>
<p>&#8211; style indirect simple : le discours repris a subis des modifications morpho-syntaxiques im-
portantes pour s&#8217;int&#233;grer &#224; la nouvelle situation d&#8217;&#233;nonciation ;
</p>
<p>&#8211; style indirect libre : seule l&#8217;interpr&#233;tation du texte permet de diff&#233;rencier le discours repris du
reste du texte ;
</p>
<p>&#8211; style indirect avec &#238;lots textuels : style hybride entre le style direct et le style indirect libre.
Les journalistes utilisent tr&#232;s largement le style indirect avec &#238;lots textuels. Les guillemets
&quot;servent soit &#224; inclure en subordonnant, soit &#224; exclure en isolant&quot; (Mourad &amp; Descl&#233;s, 2002).
Dans le discours indirect &#224; &#238;lots textuels, les journalistes excluent en isolant les segments qui
correspondent &#224; des reprises verbatim. La difficult&#233; est alors de distinguer ces passages verbatim
des emphases (cf. exemples 2 et 3).
</p>
<p>(2) Washington avance une estimation des r&#233;serves mondiales &#8220;ultimes&#8221; de p&#233;trole &#224; 2 275 milliards
de barils.
(3) Elle &#233;tait bien l&#8217;&#8220;organisatrice&#8221; du concert. Ce concert &#233;tait une activit&#233; de &#8220;service public&#8221;. Les
agents qui ont commis des fautes disposaient d&#8217;un &#8220;pouvoir de repr&#233;sentation&#8221; de la ville.
</p>
<p>Le graphique de la figure 2 illustre la r&#233;partition des styles par journaux. L&#8217;utilisation des guille-
mets pour encadrer tout ou partie du discours repris est majoritairement pr&#233;sent. D&#8217;une mani&#232;re
g&#233;n&#233;rale, les journalistes privil&#233;gient les styles limitant les modifications morpho-syntaxiques.
Nous faisons l&#8217;hypoth&#232;se que ces styles sont privil&#233;gi&#233;s car ils miment la neutralit&#233;, l&#8217;objecti-
vit&#233;.
</p>
<p>Ces r&#233;sultats sont encourageants d&#8217;un point de vue op&#233;rationnel puisque la majorit&#233; des dis-
cours repris respectent fid&#232;lement le discours original et h&#233;ritent ainsi d&#8217;un nombre important
de marques discursives. La mise au point de techniques de rep&#233;rage automatique se focalisera
donc sur ces styles les plus fr&#233;quents.
</p>
<p>4 Analyse qualitative des citations du corpus
</p>
<p>Apr&#232;s l&#8217;aper&#231;u global des citations trac&#233; dans la section pr&#233;c&#233;dente, cette section se concentre
sur les cas particuliers. L&#8217;analyse qualitative pr&#233;sent&#233;e dans cette section pose le probl&#232;me de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse quantitative et qualitative de citations extraites d&#8217;un corpus journalistique
</p>
<p>FIG. 2 &#8211; R&#233;partition des styles d&#8217;int&#233;gration du texte englob&#233; au sein des diff&#233;rents journaux
</p>
<p>d&#233;limitation de la citation puis expose des caract&#233;ristiques du discours repris, des expressions
locuteur et des relateurs.
</p>
<p>4.1 Le probl&#232;me de d&#233;limitation de la citation
</p>
<p>Lorsque l&#8217;on cherche &#224; extraire automatiquement un objet linguistique, il est n&#233;cessaire de pou-
voir d&#233;finir pr&#233;cis&#233;ment ses bornes. Nous exposons ci-apr&#232;s la difficult&#233; &#224; d&#233;terminer les bornes
des citations, puis nous pr&#233;sentons une approche alternative bas&#233;e sur les travaux de (Giguet &amp;
Lucas, 2004).
</p>
<p>4.1.1 Pr&#233;sentation du probl&#232;me
</p>
<p>La probl&#233;matique d&#8217;une unit&#233; citationnelle au niveau linguistique s&#8217;illustre particuli&#232;rement
dans le domaine journalistique. Le discours &#224; rapporter &#233;tant trop volumineux, l&#8217;auteur doit y
op&#233;rer des transformations5. Afin de montrer son objectivit&#233;, il conserve au sein de sa refor-
mulation des passages verbatim. Le discours repris est alors constitu&#233; d&#8217;une juxtaposition de
segments reformul&#233;s et de passages verbatim (cf. exemple 4).
</p>
<p>(4) Le Figaro estime, lui, que &quot;les techniciens et les cadres sont en premi&#232;re ligne&quot;, notamment ceux
de la &quot;Central Entity&quot; de Toulouse.
</p>
<p>Les modifications peuvent &#234;tre plus ou moins importantes, parfois une amorce de remise en
contexte suffit (cf. exemple 5 avec &quot;L&#8217;administration ne peut&quot;). Il arrive cependant que les seg-
ments originaux soient noy&#233;s dans une totale reformulation au style indirect (cf. exemple 6).
</p>
<p>(5) L&#8217;administration ne peut &quot;utiliser la convocation &#224; la pr&#233;fecture d&#8217;un &#233;tranger [...] pour faire
proc&#233;der &#224; son interpellation en vue de son placement en r&#233;tention&quot;, estime-t-elle.
</p>
<p>(6) L&#8217;avionneur europ&#233;en a indiqu&#233;, lundi, que le conseil d&#8217;administration de sa maison m&#232;re EADS
a &quot;interrompu ses travaux&quot; et se r&#233;unira &quot;dans les prochains jours&quot; pour tenter de trouver un accord
concernant la r&#233;partition de la charge de travail li&#233;e &#224; l&#8217;A350XWB, le futur long-courrier de l&#8217;avionneur
europ&#233;en.
</p>
<p>5Dans la typologie de Jackiewicz il s&#8217;agit de citation interpr&#233;t&#233;e, l&#8217;&#233;nonciateur reconstruit ce qui lui semble
essentiel dans la situation d&#8217;&#233;nonciation originale.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard
</p>
<p>Dans certains cas extr&#234;mes, l&#8217;auteur tisse des paragraphes entiers reprenant de brefs &#233;l&#233;ments
d&#8217;un discours source. Les modifications de l&#8217;extrait &#224; int&#233;grer sont alors si nombreuses que le
discours repris et le discours source ne poss&#232;dent plus que le sens profond en commun, les
d&#233;tails &#233;tant compl&#232;tement pass&#233;s sous silence (cf. exemple 7).
</p>
<p>(7) Royal veut aussi cr&#233;er &quot;une nouvelle g&#233;n&#233;ration de dispensaires&quot; pour un meilleur acc&#232;s au soin,
&quot;remettre &#224; niveau&quot; en personnel les h&#244;pitaux publics qui manquent de bras, et elle est contre la fer-
meture des h&#244;pitaux, qui doivent servir &#224; accueillir les personnes &#226;g&#233;es. Sans oublier &quot;la sant&#233; gratuite
pour les jeunes&quot;. Et pour cela, il faudra &quot;desserer le numerus clausus&quot; pour former plus de m&#233;decins.
</p>
<p>D&#8217;apr&#232;s les exemples rencontr&#233;s dans notre corpus, la taille de ce que nous avons consid&#233;r&#233;
comme citation est born&#233;e &#224; minima par le mot et &#224; maxima par le paragraphe.
</p>
<p>4.1.2 Proposition d&#8217;une unit&#233; interm&#233;diaire : la s&#233;quence canonique
</p>
<p>(Giguet &amp; Lucas, 2004) proposent de repr&#233;senter une citation comme une s&#233;quence de trois
objets citationnels &#233;l&#233;mentaires :
&#8211; la source : &#233;quivalente &#224; notre expression locuteur ;
&#8211; le discours rapport&#233; : &#233;quivalent &#224; notre discours repris ;
&#8211; le relateur : &quot;segment &#233;tablissant la relation entre la source et le discours rapport&#233;&quot;.
Ces abstractions permettent de prendre du recul sur la notion de citation et nous recentrer sur la
notion d&#8217;unit&#233; citationnelle. L&#8217;id&#233;e est de d&#233;finir des motifs d&#8217;agencement des objets citationnels
correspondant &#224; la structuration des citations dans les articles journalistiques. (Giguet &amp; Lucas,
2004) proposent ainsi les motifs : source + relateur + discours et discours + relateur + source.
</p>
<p>En appliquant cette formalisation sur notre corpus, nous avons rep&#233;r&#233; vingt motifs distincts.
Ceux propos&#233;s par (Giguet &amp; Lucas, 2004) sont les plus pr&#233;sents avec respectivement 104
(28%) et 148 (40%) occurences, les autres motifs correspondant &#224; des combinaisons de seule-
ment un ou deux des trois composants (disparition de la source ou du relateur) ou &#224; l&#8217;apparition
d&#8217;une deuxi&#232;me source. Ainsi, 9% des citations du corpus sont d&#233;pourvues de relateur ou de
locuteur (cf. exemple 8), il s&#8217;agit des motifs les plus importants en nombre, ceux de (Giguet &amp;
Lucas, 2004) mis-&#224;-part.
</p>
<p>(8) Alors Baloua accepte tout, les mois sans jour de repos, les heures sup pas pay&#233;es, les salaires en
dessous des minima. &#171;On est juste une main d&#8217;oeuvre moins ch&#232;re. Ils t&#8217;exploitent. Les patrons disent
qu&#8217;ils ont trop de charges, des dettes. Alors ils piquent &#224; nous, les plus pauvres. On est des victimes.&#187;
</p>
<p>Les autres motifs sont : relateur + source + discours et discours + relateur + source + discours,
ils repr&#233;sentent 15% des citations rencontr&#233;es dans notre corpus. Le premier motif semble sp&#233;-
cifiquement utilis&#233; lorsque le syntagme pr&#233;positionnel introduisant l&#8217;expression locuteur est
propuls&#233; en d&#233;but de phrase (cf. exemple 9), alors que le second est utilis&#233; lorsque l&#8217;expression
locuteur est plac&#233;e dans une proposition juxtapos&#233;e entre deux fragments du discours repris.
</p>
<p>(9) Selon eux, &#171;beaucoup [des saisonniers OMI] auraient b&#233;n&#233;fici&#233; de CDI en d&#8217;autres temps. Relati-
vement qualifi&#233;s, ils reviennent r&#233;guli&#232;rement dans les m&#234;mes exploitations. On dit m&#234;me de certains
que ce sont les v&#233;ritables chefs d&#8217;exploitation&#187;.
</p>
<p>L&#8217;apparition de nouveaux motifs ne permet plus de d&#233;duire un &#233;ventuel troisi&#232;me composant
d&#8217;apr&#232;s sa position, ce qui r&#233;duit l&#8217;efficacit&#233; de l&#8217;approche de (Giguet &amp; Lucas, 2004). Nous
proposons une adaptation de ce mod&#232;le plus proche de la repr&#233;sentation linguistique et tout en
conservant l&#8217;essence de la forme canonique : le segment citationnel. Un segment citationnel se
compose, en autorisant les r&#233;p&#233;titions, des objets citationnels suivants :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse quantitative et qualitative de citations extraites d&#8217;un corpus journalistique
</p>
<p>&#8211; un discours repris &#8212; pour lequel le probl&#232;me de bornage reste entier &#8212; ;
&#8211; une expression locuteur potentiellement omise si la source est suffisamment saillante ;
&#8211; un relateur prenant la forme d&#8217;une expression linguistique, d&#8217;une ponctuation ou directement
induit par la structure de la phrase.
</p>
<p>Nous avons d&#233;sormais un aper&#231;u assez pr&#233;cis de la structuration globale des citations au sein de
notre corpus. Les sections suivantes s&#8217;attachent &#224; en observer les constituants pour les caract&#233;-
riser.
</p>
<p>4.2 Caract&#233;risation du discours repris
</p>
<p>L&#8217;observation des citations du corpus nous a permis d&#8217;extraire des r&#233;gularit&#233;s qui devraient
permettre de d&#233;finir des m&#233;thodes adapt&#233;es aux diff&#233;rents types de citation pr&#233;sents au sein des
textes journalistiques. Au del&#224; de la structure, le style de discours rapport&#233; employ&#233; influe sur la
forme de la citation. De ce point de vue, nous pr&#233;sentons dans un premier temps les r&#233;gularit&#233;s
concernant les citations au style direct, puis celles concernant le style indirect.
</p>
<p>Nous avons observ&#233; deux constructions pr&#233;dominantes pour le style direct dans la mani&#232;re
de lier l&#8217;expression locuteur et le discours repris : soit &#224; l&#8217;aide d&#8217;une proposition juxtapos&#233;e,
soit uniquement par un relateur. D&#8217;une mani&#232;re g&#233;n&#233;rale, on remarque que si l&#8217;expression lo-
cuteur est en d&#233;but de phrase, un relateur est utilis&#233;, sinon l&#8217;expression locuteur est juxtapo-
s&#233;e (cf. exemple 10). De plus, lorsque le discours repris entre guillemets se positionne comme
une phrase &#224; part enti&#232;re, l&#8217;expression locuteur est introduite au sein m&#234;me des guillemets (cf.
exemple 11).
</p>
<p>(10) &quot;Avec la fin de la session, les parlementaires sont beaucoup plus disponibles. Cette r&#233;organisation
&#233;tait donc n&#233;cessaire&quot;, rench&#233;rit-on dans l&#8217;entourage de Sarkozy.
</p>
<p>(11) &quot;En 2003 , explique-t-il, j&#8217;ai fait effectuer douze tests sur des vols en France, dans onze cas sur
douze, des armes et explosifs ont pu &#234;tre introduits dans les avions&quot;.
</p>
<p>Nous avons &#233;galement observ&#233; deux constructions majeures pour le style indirect : les pro-
positions subordonn&#233;es conjonctives et les propositions juxtapos&#233;es. La premi&#232;re construction
fait majoritairement appel &#224; un relateur du type verbe + que (cf. exemple 12), alors que dans
le second cas la partie reprise est juxtapos&#233;e &#224; un syntagme pr&#233;positionnel contenant l&#8217;expres-
sion locuteur (cf. exemple 13). Une difficult&#233; majeure propre au style indirecte est de suivre la
continuit&#233; d&#8217;un discours repris sur plusieurs phrases (cf. exemple 14).
</p>
<p>(12) Arnaud Montebourg, le porte-parole de S&#233;gol&#232;ne Royal, promet ainsi que, si la candidate de la
gauche est &#233;lue, la construction de l&#8217;EPR ne serait pas interrompue.
</p>
<p>(13) D&#8217;apr&#232;s sa m&#232;re, Julien faisait une sieste dans l&#8217;appartement familial lorsqu&#8217;il a disparu.
</p>
<p>(14) Edward Lu, physicien et ancien astronaute au centre Johnson de la NASA, a expos&#233; les moyens
envisag&#233;s pour repousser ces envahisseurs ! Premi&#232;re m&#233;thode : envoyer un petit vaisseau spatial de
1000kg pour aller impacter &#224; la vitesse de 5km/sec l&#8217;ast&#233;ro&#239;de mena&#231;ant. L&#8217;&#233;nergie du contact [. . .] sur
la m&#234;me trajectoire.
</p>
<p>En r&#233;sum&#233;, deux grandes structures ressortent aussi bien pour le discours indirect que pour le
discours direct. La premi&#232;re fait appel &#224; des relateurs ponctuatifs ou verbaux qui mettent en re-
lation l&#8217;expression locuteur et le discours repris. La seconde consiste en la mise en juxtaposition
de l&#8217;expression locuteur et du discours repris, ce dernier pouvant s&#8217;&#233;tendre sur plusieurs phrases
dans le cas du style indirect.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard
</p>
<p>FIG. 3 &#8211; R&#233;partition des formes au sein des locuteurs
</p>
<p>4.3 Caract&#233;risation des expressions locuteur
</p>
<p>La recherche de l&#8217;expression locuteur est primordiale, notamment dans le cadre de la d&#233;tection
de plagiat. Nous pr&#233;sentons ci-dessous les caract&#233;ristiques des expressions locuteur de notre
corpus.
</p>
<p>L&#8217;observation de (Giguet &amp; Lucas, 2004) selon laquelle les &quot;r&#233;ductions lexicales et les ana-
phores auront tendance &#224; appara&#238;tre apr&#232;s des formes tr&#232;s d&#233;termin&#233;es&quot; se confirme au sein de
notre corpus (cf. exemple 15). La figure 3 d&#233;crit les &#233;l&#233;ments linguistiques composant les dif-
f&#233;rentes expressions locuteurs. Les groupes nominaux et les noms capitalis&#233;s y sont les plus
utilis&#233;s. Les formes r&#233;duites faisant r&#233;f&#233;rence aux sources correspondent majoritairement &#224; des
pronoms ou des adjectifs possessifs.
</p>
<p>(15) Brigitte Liberman, la directrice g&#233;n&#233;rale de Cosm&#233;tique Active (La Roche-Posay, Vichy),
r&#233;torque : &#8220;Les grandes innovations ne peuvent pas na&#238;tre chaque ann&#233;e.&#8221; [. . .] Mais elle admet que
&#8220;Jean-Paul nous poussant, nous pouvons faire encore mieux&#8221;.
</p>
<p>Nous avons &#233;galement consid&#233;r&#233; les cas o&#249; il n&#8217;y avait pas de locuteur dans le contexte phras-
tique du discours repris. Deux solutions apparaissent alors : le plus fr&#233;quemment, le locuteur
a &#233;t&#233; pr&#233;c&#233;demment introduit et est suffisamment saillant pour permettre au lecteur de faire le
lien (cf. exemple 16) ; plus rarement, le contexte permet d&#8217;identifier la source (cf. exemple 17).
</p>
<p>(16) Il a insuffl&#233; une culture d&#8217;entreprise &#224; la Kennedy. &quot;Aujourd&#8217;hui, on pense d&#8217;abord &#224; Philips,
ensuite &#224; son business, et enfin &#224; soi.&quot;
</p>
<p>(17) &quot;Nul ne peut &#234;tre condamn&#233; &#224; la peine de mort&quot; : cet article unique du projet de loi constitution-
nelle modifiera le titre VIII de la Constitution, consacr&#233; &#224; l&#8217;autorit&#233; judiciaire.
</p>
<p>En r&#233;sum&#233;, les formes employ&#233;es dans les expressions locuteurs varient selon qu&#8217;il s&#8217;agisse
d&#8217;une premi&#232;re introduction du dit locuteur (noms capitalis&#233;s, groupes nominaux, . . .) ou bien
d&#8217;une r&#233;f&#233;rence &#224; un locuteur auparavant introduit (pronoms, adjectifs possessifs, . . .). Le suivi
de la saillance des diff&#233;rentes expressions locuteur introduites devrait permettre quant &#224; elle de
r&#233;soudre le probl&#232;me d&#8217;absence de locuteur dans le contexte phrastique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse quantitative et qualitative de citations extraites d&#8217;un corpus journalistique
</p>
<p>4.4 Caract&#233;risation des relateurs
</p>
<p>L&#8217;objet citationnel relateur introduit par (Giguet &amp; Lucas, 2004) est le plus complexe &#224; caract&#233;-
riser. Nous classons les relateurs en deux cat&#233;gories : les pr&#233;positions (selon, pour, d&#8217;apr&#232;s, . . .)
et les regroupements de formes verbales et de compl&#233;ments circonstanciels ou d&#8217;adverbes (cf.
exemples 18). Ces derniers sont les plus utilis&#233;s et les plus pr&#233;cis. Les satellites du verbe ren-
seignent en effet sur le contexte d&#8217;&#233;nonciation.
</p>
<p>(18) Le premier ministre, Tony Blair, a annonc&#233; dimanche &#224; la BBC vouloir durcir la loi sur les
armes &#224; feu afin de lutter contre leur circulation parmi les jeunes.
</p>
<p>Nous choisissons de restreindre les relateurs aux formes verbales ou pr&#233;positionnelles, car nous
consid&#233;rons les autres formes trop h&#233;t&#233;rog&#232;nes et non sp&#233;cifiques aux citations. De plus, cette
restriction nous permet de profiter des ressources issues de travaux ant&#233;rieurs, comme les verbes
d&#8217;&#233;nonciation de (Mourad &amp; Minel, 2000).
</p>
<p>5 Proposition d&#8217;un sch&#233;ma d&#8217;annotation des citations
</p>
<p>Plusieurs sch&#233;mas d&#8217;annotation (Prasad et al., 2007; Jackiewicz, 2007) ont &#233;t&#233; d&#233;crits pour l&#8217;an-
notation des opinions et de leurs porteurs. Nous proposons un sch&#233;ma comparable en certains
points, mais largement simplifi&#233; pour l&#8217;annotation de citations dans l&#8217;objectif de mettre au point
des m&#233;thodes de rep&#233;rage automatique
</p>
<p>Nous avons dans un premier temps consid&#233;r&#233; l&#8217;annotation des relateurs, cependant le degr&#233;
d&#8217;accord6 trop faible entre trois annotateurs sur un sous-ensemble du corpus nous a pouss&#233; &#224;
nous limiter finalement aux expressions locuteur et aux discours repris.
</p>
<p>L&#8217;annotation que nous proposons est fond&#233;e sur l&#8217;emploi de deux balises aux noms explicites :
la balise &lt;expressionlocuteur&gt; et la balise &lt;discoursrepris&gt;. La deuxi&#232;me balise fait r&#233;f&#233;-
rence &#224; la premi&#232;re &#224; l&#8217;aide d&#8217;un attribut source prenant pour valeur l&#8217;identifiant de la ba-
lise &lt;expressionlocuteur&gt; auquel le discours repris balis&#233; se rapporte. La reconstitution des
citations s&#8217;effectue en compilant les balises &lt;discoursrepris&gt; r&#233;f&#233;rant &#224; une m&#234;me balise
&lt;expressionlocuteur&gt;. Le regroupement de ces balises avec la balise &lt;expressionlocuteur&gt;
correspondante constitue une forme approximative de la citation : le segment citationnel7. Cette
forme r&#233;soud partiellement la probl&#233;matique de l&#8217;unit&#233; citationnelle sur le plan linguistique.
</p>
<p>Ce sch&#233;ma d&#8217;annotation nous a servi pour annoter notre corpus. Il subsiste toujours des incerti-
tudes quant &#224; la d&#233;limitation des discours repris, mais nous les avons contourn&#233; en s&#233;lectionnant
au plus large. L&#8217;approximation de la citation en segment citationnel nous a donc permis d&#8217;an-
noter la totalit&#233; des informations qui nous int&#233;ressaient au sein du corpus.
</p>
<p>6 Conclusion
</p>
<p>Le corpus francophone que nous avons constitu&#233; nous a permis d&#8217;observer plusieurs centaines
de citations dans leur contexte. Nous avons ainsi &#233;t&#233; en mesure de faire &#233;merger des caract&#233;-
</p>
<p>6Le degr&#233; d&#8217;accord entre les annotateurs n&#8217;a pas &#233;t&#233; calcul&#233; automatiquement, mais &#233;valu&#233; par comparaison
directe des annotations
</p>
<p>7cf. Section 4.1.2</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard
</p>
<p>ristiques concernant les diff&#233;rents objets citationnels constituant les dites citations. Finalement,
nous avons propos&#233; un sch&#233;ma d&#8217;annotation permettant de baliser en XML les citations du
corpus en contournant la probl&#233;matique d&#8217;unit&#233; citationnelle gr&#226;ce &#224; l&#8217;introduction du segment
citationnel.
</p>
<p>La constitution du corpus et l&#8217;analyse des citations qu&#8217;il regroupe ouvre des perspectives pour le
rep&#233;rage automatique des citations. Nous cherchons &#224; mettre en place des m&#233;thodes de rep&#233;rage
utilisant uniquement des marques de surface. Ainsi, nous envisageons l&#8217;utilisation d&#8217;automates
pour l&#8217;identification d&#8217;expressions locuteur et des techniques statistiques pour le rep&#233;rage des
discours repris. Le corpus servirait alors de base d&#8217;apprentissage. L&#8217;article &#224; para&#238;tre (Poulard
et al., 2008) discute certaines de ces m&#233;thodes de rep&#233;rage automatique &#224; partir du corpus et
des particularit&#233;s pr&#233;c&#233;demment pr&#233;sent&#233;s.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CHOI Y., CARDIE C., RILOFF E. &amp; PATWARDHAN S. (2005). Identifying sources of opinions
with conditional random fields and extraction patterns. In Proceedings of the conference on
Human Language Technology and Empirical Methods in Natural Language Processing, p.
355&#8211;362, Vancouver, Canada : Association for Computational Linguistics.
GIGUET E. &amp; LUCAS N. (2004). La d&#233;tection automatique des citations et des locuteurs dans
les textes informatifs, In J. M. L. MU&#209;OZ, S. MARNETTE &amp; L. ROSIER, Eds., Le discours
rapport&#233; dans tous ses &#233;tats : Question de fronti&#232;res, p. 410&#8211;418. L&#8217;Harmattan.
HABERT B. (2000). Des corpus repr&#233;sentatifs : de quoi, pour quoi, comment. In M. BILGER,
Ed., Cahiers de l&#8217;Universit&#233; de Perpignan, volume 31, p. 11&#8211;58. Presses Universitaires de
Perpignan.
JACKIEWICZ A. (2007). Relations intersubjectives dans les discours rapport&#233;s. In M.-P.
P&#201;RY-WOODLEY &amp; D. SCOTT, Eds., Journal TAL : Discours et document : traitements auto-
matiques, volume 47, p. 65&#8211;87. ATALA.
KIM S. &amp; HOVY E. (2006). Extracting Opinions, Opinion Holders, and Topics Expressed
in Online News Media Text. In Proceedings of ACL/COLING Workshop on Sentiment and
Subjectivity in Text, Sydney, Australia.
MOURAD G. &amp; DESCL&#201;S J. (2002). Citation textuelle : identification automatique par ex-
ploration contextuelle. In L. DANON-BOILEAU &amp; M.-A. MOREL, Eds., Faits de langues,
number 19, p. 179&#8211;188. Ophrys.
MOURAD G. &amp; MINEL J.-L. (2000). Filtrage s&#233;mantique du texte, le cas de la citation. In
G. M. &amp; T. E., Eds., 3e Colloque International sur le Document &#201;lectronique, p. 41&#8211;56 :
Lavoisier.
POULARD F., WASZAK T., HERNANDEZ N. &amp; BELLOT P. (2008). Rep&#233;rage de citations,
classification des styles de discours rapport&#233; et identification des constituants citationnels en
&#233;crits journalistiques. In &#192; para&#238;tre TALN 2008, Avignon, France.
PRASAD R., DINESH N., LEE A., JOSHI A. &amp; WEBBER B. (2007). Attribution and its
annotation in the penn discourse treebank. In M.-P. P&#201;RY-WOODLEY &amp; D. SCOTT, Eds.,
Journal TAL : Discours et document : traitements automatiques, volume 47. ATALA.
TEUFEL S., SIDDHARTHAN A. &amp; TIDHAR D. (2006). Automatic classification of citation
function. In Proceedings of the Conference on Empirical Methods in Natural Language Pro-
cessing, volume 6, p. 103&#8211;110.</p>

</div></div>
</body></html>