<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Adaptation d&#8217;un syst&#232;me de compr&#233;hension pour un robot compagnon</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Recital 2008, Avignon, 9-13 juin 2008
</p>
<p>Adaptation d&#8217;un syst&#232;me de compr&#233;hension pour un robot 
compagnon
</p>
<p>Marc Le Tallec
</p>
<p>Laboratoire d&#8217;Informatique &#8211; Universit&#233; Fran&#231;ois-Rabelais de Tours
Campus Universitaire de Blois, 3 place Jean Jaur&#232;s, F-41000 Blois
</p>
<p>marc.letallec@etu.univ-tours.fr
</p>
<p>R&#233;sum&#233;
</p>
<p>Le projet EmotiRob, financ&#233; par l&#8217;ANR, a pour but de r&#233;aliser un robot compagnon pour des 
enfants  fragilis&#233;s.  Le  projet  se  d&#233;compose  en  deux  sous  parties  que  sont  le  module  de 
compr&#233;hension pour comprendre ce que dit l&#8217;enfant et un module d&#8217;interaction &#233;motionnelle 
pour apporter une r&#233;ponse en simulant des &#233;motions  par les mouvements du corps, les traits 
du visage et par l'&#233;mission de petits sons simples. Le module de compr&#233;hension dont il est 
question ici r&#233;utilise les travaux du syst&#232;me Logus. La principale difficult&#233; est de faire &#233;voluer 
le syst&#232;me existant d&#8217;un dialogue homme-machine finalis&#233; vers un domaine plus large et de 
d&#233;tecter  l&#8217;&#233;tat  &#233;motionnel  de  l&#8217;enfant.  Dans  un  premier  temps,  nous  pr&#233;sentons  le  projet 
EmotiRob et ses sp&#233;cificit&#233;s. Ensuite, le syst&#232;me de compr&#233;hension de la parole Logus, sur 
lequel se base ce travail,  est pr&#233;sent&#233; en d&#233;tail.  Enfin, nous pr&#233;sentons les adaptations du 
syst&#232;me &#224; la nouvelle t&#226;che EmotiRob.
</p>
<p>Abstract
</p>
<p>The EmotiRob project, financed by ANR, aims at realizing a robot companion for weakened 
children.  The  project  decomposes  into  two  under  parts  that  which  are  the  module  of 
understanding to include what says the child and a module of emotional interaction to bring 
an  answer  by  feigning  feelings  by  the  movements  of  the  body, lines  of  the face  and by 
emission of small simple sounds. The module of understanding reuses the works of the system 
Logus. The main difficulty is to develop the existing system of a human-machine dialogue 
finalized towards a wider domain and to detect the emotional state of the child. At first, we 
present the EmotiRob project and its specificities. Then, the system of understanding Logus, 
on which bases itself this work is presented. Finally, we present the adaptations of the system 
to his new task EmotiRob.
</p>
<p>Mots-cl&#233;s : Compr&#233;hension du langage, langue parl&#233;e spontan&#233;e  
Keywords : spoken language understanding, spontaneous language</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le Tallec Marc
</p>
<p>1 le projet EmotiRob : robot compagnon pour enfants fragilis&#233;s
1.1 Pr&#233;sentation du projet
</p>
<p>Le projet EmotiRob a pour but de concevoir un robot compagnon autonome (peluche anim&#233;e) 
pour apporter du bien &#234;tre &#224; des enfants fragilis&#233;s comme par exemple dans le cas de longue 
hospitalisation.  Ce  projet  fait  suite  &#224;  des  exp&#233;rimentations  par  le  laboratoire  Valoria,  de 
l&#8217;universit&#233; Bretagne Sud, d&#8217;un autre robot, &#171; Paro &#187;, dans des centres de r&#233;&#233;ducation. Celles-
ci  ont montr&#233; l'apport de robot  compagnons dans ce type de situation (Saint-Aim&#233; et al., 
2007).Dans ce projet,  il  est  pr&#233;vu que  l&#8217;enfant  parle  au robot  et  que celui-ci  r&#233;agisse en 
simulant des &#233;motions  par les mouvements du corps, les traits du visage et par l'&#233;mission de 
petits sons simples. Six &#233;motions ont &#233;t&#233; retenues : la joie, la tristesse, le d&#233;go&#251;t, la peur, la 
surprise et la col&#232;re.
</p>
<p>Le  projet  se  d&#233;coupe en  deux  parties :  le  module  de  compr&#233;hension  pour  interpr&#233;ter  les 
paroles  re&#231;ues  et  un  module  d&#8217;interaction  &#233;motionnelle  charg&#233;  d&#8217;apporter  la  r&#233;ponse 
appropri&#233;e &#224; l&#8217;enfant. Les paroles prononc&#233;es par l&#8217;enfant seront transcrites sous forme de 
suite de mots par un syst&#232;me de reconnaissance vocale. 
</p>
<p>Ce projet s&#8217;accompagnera d&#8217;une phase d&#8217;&#233;valuation en situation r&#233;elle d&#8217;interaction dans un 
centre hospitalier pour mesurer la qualit&#233; des r&#233;ponses et leurs impacts sur l&#8217;enfant.
</p>
<p>1.2 Le module de compr&#233;hension dans EmotiRob
</p>
<p> Le module de compr&#233;hension doit tenir compte de particularit&#233;s propres au projet :
&#8226; Compr&#233;hension dans un domaine ouvert
</p>
<p>&#8226; Un public cible compos&#233; de jeunes enfants
&#8226; Prise en compte des &#233;motions
</p>
<p>En effet, une fois que l&#8217;on va donner le robot aux enfants, on ne sait pas quelles vont &#234;tre leurs 
r&#233;actions.  Ils  peuvent  consid&#233;rer  celui-ci  comme une poup&#233;e  et  lui  raconter  des  histoires 
imaginaires, ou le voir comme un v&#233;ritable locuteur et lui parler de choses r&#233;elles qui leur 
sont arriv&#233;es. Pour le moment, cela reste du domaine de l&#8217;hypoth&#232;se. On ne peut donc pas 
savoir comment l&#8217;enfant va appr&#233;hender l&#8217;exp&#233;rience et de quoi il va vouloir parler. De plus 
chaque enfant &#233;tant diff&#233;rent, les th&#232;mes abord&#233;s seront donc multiples. Quelques domaines 
seront forc&#233;ment pr&#233;sents comme celui de la famille, de l&#8217;&#233;cole, le monde hospitalier, mais il 
est fort possible que chaque enfant aborde des choses diff&#233;rentes. 
</p>
<p>Un corpus est en cours d&#8217;enregistrement par le laboratoire ADICORE de l&#8217;universit&#233; Bretagne 
Sud,  &#224;  partir  d&#8217;enregistrement  d&#8217;enfant  dans  un  contexte  de  cr&#233;ation  de  contes.  Faire  un 
enregistrement dans les m&#234;mes conditions d&#8217;exp&#233;rimentations que le projet aurait &#233;t&#233; plus 
efficace et nous aurait permis de r&#233;pondre &#224; nos interrogations concernant la mani&#232;re dont les 
enfants vont percevoir le robot, mais cela &#233;tait impossible car le robot n&#8217;est pas encore pr&#234;t.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Adaptation d&#8217;un syst&#232;me de compr&#233;hension pour un robot compagnon
</p>
<p>Cependant, m&#234;me si on doit donc comprendre des choses plus diverses, on n&#8217;est pas oblig&#233; de 
comprendre tous les d&#233;tails de l&#8217;&#233;nonc&#233;, mais le sens g&#233;n&#233;rale. De plus, il est pr&#233;vu que le 
robot puisse, en cas d&#8217;incompr&#233;hension totale de l&#8217;&#233;nonc&#233;, se mettre dans une position de 
repli, comme pour simuler une fatigue temporaire. La peluche n&#8217;ayant pas de t&#226;che pr&#233;cise &#224; 
accomplir, du point de vue de l&#8217;enfant, on peut logiquement penser que l&#8217;enfant va chercher &#224; 
adapter ses paroles pour aider la peluche &#224; le comprendre, car pour lui cela sera sa priorit&#233;.
</p>
<p>Pour  le  public  vis&#233;,  il  s&#8217;agit  d&#8217;enfants  fragilis&#233;s  mais  n&#8217;ayant  pas,  &#224;  priori,  de  troubles 
langagiers. Cela impose de faire en premier lieu un travail sur le vocabulaire propre &#224; ce genre 
d&#8217;individu.
</p>
<p>Concernant la d&#233;tection des &#233;motions, le robot &#233;tant con&#231;u pour aider au confort des enfants 
en difficult&#233;, il faut &#234;tre en mesure de d&#233;tecter dans quel &#233;tat &#233;motionnel se trouve le locuteur 
pour pouvoir lui apporter une r&#233;ponse satisfaisante, tout en &#233;tant certain de ne pas modifier 
n&#233;gativement son &#233;tat pr&#233;sent. 
</p>
<p>Le  module  de  compr&#233;hension  doit  &#233;galement  prendre  en  compte  deux  points  importants 
lorsqu&#8217;il est question de dialogue oral :
</p>
<p>&#8226;
le module de reconnaissance de la parole d&#233;livre une liste de mots qui peut &#234;tre erron&#233;e.
</p>
<p>&#8226; la parole spontan&#233;e se caract&#233;rise par la pr&#233;sence de disfluences.
</p>
<p>Ces  disfluences  sont  le  t&#233;moignage  du  mode  de  production  en  direct  des  &#233;nonc&#233;s et  qui 
cassent leur r&#233;gularit&#233; syntaxique: &#171; le travail d&#8217;&#233;laboration est &#233;tal&#233; en m&#234;me temps que le 
produit &#233;labor&#233; &#187; (Blanche-Benveniste, 2002). Comme rien de ce qui a &#233;t&#233; dit ne peut &#234;tre 
effac&#233;,  il  contient  les  marques  de la  recherche des  mots :  h&#233;sitations,  r&#233;p&#233;titions et  auto-
corrections (d&#233;sign&#233;s par les linguistes comme des &#171; r&#233;parations &#187;). De plus, dans la langue 
orale, le locuteur n&#8217;est pas tenu &#224; une correction syntaxique aussi stricte que dans la langue 
&#233;crite et les changements de parcours syntaxiques, voire s&#233;mantiques, y sont assez fr&#233;quents 
(Blanche-Benveniste, 1990), (Kerbrat-Orecchioni, 1980).
</p>
<p>Le module de compr&#233;hension, que nous pr&#233;sentons, r&#233;utilise les principes du syst&#232;me Logus 
(Villaneau et al., 2002). Plusieurs campagnes d&#8217;&#233;valuation (Devillers et al., 2004) ont montr&#233; 
que ce syst&#232;me pr&#233;sentait une robustesse d&#8217;analyse satisfaisante sur de la parole spontan&#233;e. 
L&#8217;objectif de notre recherche est d&#8217;adapter Logus au nouveau contexte applicatif du projet 
EmotiRob. Dans un premier temps, nous allons d&#233;crire en d&#233;tail le syst&#232;me existant.
</p>
<p>2 Logus, syst&#232;me de compr&#233;hension de la parole spontan&#233;e 
2.1 Pr&#233;sentation
</p>
<p>Les  erreurs  de  reconnaissance  et  les  sp&#233;cificit&#233;s  de  la  parole  orale  spontan&#233;e  imposent 
l&#8217;utilisation de traitements robustes.  Pour laisser davantage d&#8217;initiatives aux utilisateurs et 
mieux d&#233;tecter leurs intentions, il convient que les structures s&#233;mantiques utilis&#233;es ne soient 
pas fig&#233;es. L&#8217;analyse doit &#234;tre capable d&#8217;extraire de l&#8217;&#233;nonc&#233; lui-m&#234;me les relations entre les 
diff&#233;rents &#233;l&#233;ments qui le composent. Logus s&#8217;inscrit dans ce type de tentatives. L&#8217;analyse 
combine les approches syntaxiques et s&#233;mantiques : les r&#232;gles utilis&#233;es s&#8217;appuient &#224; la fois sur 
la  nature  syntaxique  des  &#233;l&#233;ments  et  sur  une  connaissance  s&#233;mantique  du  domaine  de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le Tallec Marc
</p>
<p>l&#8217;application, d&#233;finie par un certain nombre de pr&#233;dicats.
</p>
<p>L'analyse se d&#233;roule suivant deux grandes &#233;tapes ; le chunking qui regroupe &#224; partir de r&#232;gles 
syntaxiques des mots en petits groupes porteurs de sens, puis la mise en relation des chunks 
qui aboutit &#224; la construction de la repr&#233;sentation s&#233;mantique finale, une formule logique ou un 
graphe conceptuel. Logus utilise le -calcul pour construire une repr&#233;sentation s&#233;mantique &#224;&#955;  
la Montague de l&#8217;&#233;nonc&#233;.
</p>
<p>Malgr&#233;  l'utilisation  d'une  connaissance  pragmatico-s&#233;mantique  li&#233;e  &#224;  l'application,  la 
sp&#233;cificit&#233;  du syst&#232;me se limite  au choix des  mots  du lexique et  &#224;  la  d&#233;finition de  cette 
connaissance. Plus le lexique sera grand et la connaissance importante, moins le syst&#232;me sera 
d&#233;pendant du domaine d&#8217;application.
</p>
<p>Les  r&#233;sultats  d'une  campagne  d'&#233;valuation  ont  mis  en  &#233;vidence  une  bonne  tol&#233;rance  aux 
inattendus et aux ph&#233;nom&#232;nes complexes, appuyant ainsi l'approche utilis&#233;e.
</p>
<p>2.2 Les traitements dans Logus
</p>
<p>Le syst&#232;me Logus proc&#232;de en trois &#233;tapes principales, comme indiqu&#233; sur la figure 1 pour 
transformer  l&#8217;&#233;nonc&#233;  en  une  formule  logique.  Ces  trois  &#233;tapes  sont  la  lemmatisation,  la 
segmentation, et la cr&#233;ation des liens s&#233;mantiques.
</p>
<p>Figure 1 - Architecture du syst&#232;me de compr&#233;hension
</p>
<p>Lemmatisation
</p>
<p>Cette premi&#232;re &#233;tape consiste &#224; remplacer chaque mot de l&#8217;&#233;nonc&#233; par une traduction compos&#233; 
d&#8217;un  triplet  comprenant  l&#8217;&#233;tiquette  syntaxique,  l&#8217;&#233;tiquette  s&#233;mantique,  et  la  repr&#233;sentation 
s&#233;mantique contenue dans un lexique. Si un mot poss&#232;de plusieurs d&#233;finitions, elles sont alors 
toutes gard&#233;es pour les &#233;tapes suivantes. Dans le cadre de l&#8217;adaptation pour le nouveau projet, 
cette &#233;tape va &#234;tre conserv&#233;e mais il faut bien s&#251;r revoir enti&#232;rement ce nouveau lexique. Il est 
pr&#233;vu &#233;galement d&#8217;ajouter une &#233;tiquette en rapport avec l&#8217;&#233;motion sur chacun des mots.   
Chunking
</p>
<p>Cette  &#233;tape  segmente  l&#8217;&#233;nonc&#233;  en  constituants  minimaux  (chunks)  tout  en  analysant  leur 
structure interne. Il s&#8217;agit d&#8217;une analyse syntaxique qui se base sur les parties du discours. Ces 
chunks correspondent souvent &#224; des unit&#233;s de sens repr&#233;sentant les objets de l&#8217;univers. La 
segmentation  facilite  donc  la  transition  vers  les  traitements  s&#233;mantico-pragmatiques 
ult&#233;rieurs. Mais surtout, cette unit&#233; de segmentation est adapt&#233;e au langage parl&#233; spontan&#233;. Il 
a  en  effet  &#233;t&#233;  d&#233;montr&#233;  que  ces  constituants  sont  le  lieu  de  r&#233;alisations  privil&#233;gi&#233;es  des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Adaptation d&#8217;un syst&#232;me de compr&#233;hension pour un robot compagnon
</p>
<p>r&#233;parations &#224; l&#8217;oral (Blanche-Benveniste, 1997). La port&#233;e limit&#233;e de la segmentation garantit 
une certaine robustesse tout en autorisant une analyse plus d&#233;taill&#233;e des &#233;nonc&#233;s oraux. Aucun 
&#233;l&#233;ment  n&#8217;est  en  effet  ignor&#233;  &#224;  ce  stade.  Cette  &#233;tape  analyse  la  structure  interne  des 
constituants en plus de caract&#233;riser  leurs  fronti&#232;res.  Enfin,  l&#8217;&#233;tiquetage et  la  segmentation 
reposent  sur  une  connaissance  syntaxique  totalement  ind&#233;pendante  de  la  t&#226;che.  Cette 
architecture pr&#233;sente donc d&#8217;ind&#233;niables atouts en mati&#232;re de g&#233;n&#233;ricit&#233;.
</p>
<p>Dans  le  cas  de  paroles  d&#8217;enfants,  la  structure  syntaxique  de  la  phrase  ne  subit  pas  de 
modifications importantes et donc cette partie va &#234;tre conserv&#233;e.
</p>
<p>D&#233;pendances s&#233;mantiques
</p>
<p>Cette &#233;tape conduit &#224; la repr&#233;sentation s&#233;mantique finale du contenu propositionnel.  Cette 
derni&#232;re s&#8217;obtient en regardant quels sont les liens possibles entre diff&#233;rents objets pr&#233;sents 
dans  l&#8217;&#233;nonc&#233;.  Cette  connaissance se pr&#233;sente sous la  forme de relations de d&#233;pendances 
pr&#233;dicat/argument  entre  les  diff&#233;rents  objets  du  domaine.  Par  exemples,  dans  le  syst&#232;me 
Logus, si un utilisateur demande : &#171; je veux r&#233;server un h&#244;tel pour deux personnes &#224; moins de 
100&#8364; &#187;, ce sont les connaissances s&#233;mantiques qui vont nous permettre de comprendre le sens 
de  l&#8217;&#233;nonc&#233;.  Sachant  qu&#8217;un h&#244;tel  est  compos&#233;  de  chambres,  et  qu&#8217;une  chambre   a  pour 
propri&#233;t&#233;s un nombre d&#8217;occupants et un tarif, on va pouvoir joindre chaque segment de la 
phrase pour comprendre que le locuteur souhaite r&#233;server une chambre pour deux  personnes 
pour un prix inf&#233;rieur &#224; 100 &#8364;. La connaissance s&#233;mantique regroupe toutes ces informations 
permettant de relier les constituants d&#8217;une requ&#234;te. 
</p>
<p>C&#8217;est &#224; cette &#233;tape que le nouveau projet impose le plus de modifications. En effet la partie 
s&#233;mantique va devoir g&#233;rer un nombre d&#8217;objets diff&#233;rents plus important. Nous n&#8217;avons pas 
l&#8217;ambition de cr&#233;er un syst&#232;me capable de traiter de tous les domaines, avec n&#8217;importe quelle 
personne. Nous  savons que repr&#233;senter l&#8217;ensemble des connaissances du monde est une chose 
impossible. Le faire pour un domaine restreint est d&#233;j&#224; une chose difficile, mais nous pensons 
qu&#8217;en choisissant un public d&#8217;enfants,  on va suffisamment restreindre le vocabulaire pour 
arriver &#224; d&#233;complexifier la connaissance s&#233;mantique n&#233;cessaire.
</p>
<p>La  premi&#232;re  &#233;tape  pour  adapter  le  syst&#232;me  existant  est  de  modifier  le  lexique.  Il  faut 
rechercher quels sont les mots que les enfants vont utiliser pour communiquer avec le robot.
</p>
<p>3 Le lexique des enfants
</p>
<p>La principale information en entr&#233;e du module de compr&#233;hension est la s&#233;quence de mots qui 
va &#234;tre prononc&#233;e par l&#8217;enfant. Il est donc primordial de conna&#238;tre le vocabulaire que ce type 
de  public  utilise.  On  peut  logiquement  penser  que  le  vocabulaire  utilis&#233;  par  ce  type  de 
population sera diff&#233;rent d&#8217;un public adulte.  Nous avons d&#233;fini un lexique correspondant au 
vocabulaire  enfantin  &#224;  partir  de  bases  de  donn&#233;es  lexicales  sp&#233;cifiques.  Ce  lexique  sera 
ult&#233;rieurement  adapt&#233;  par  l&#8217;observation  du  corpus  enfantin  recueilli  par  le  laboratoire 
ADICORE.
</p>
<p>3.1 Pr&#233;sentation des bases lexicales</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le Tallec Marc
</p>
<p>Nous avons donc r&#233;cup&#233;r&#233; des informations sur le langage des enfants &#224; partir de donn&#233;es 
disponibles que sont Novlex (Lambert, Chesnet, 2001), Manulex (L&#233;t&#233; et al., 2004) et une 
&#233;tude de Dominique Bassano (Bassano et al, 2005).
</p>
<p>Manulex est une base de donn&#233;es lexicales qui fournit les fr&#233;quences d'occurrences de 23.900 
lemmes et 48.900 formes orthographiques extraits d'un corpus de 54 manuels scolaires de 
lecture.  Librement  accessible  sur  internet,  la  base  est  &#224;  la  disposition  des  chercheurs  qui 
travaillent notamment sur l'acquisition de la lecture.
</p>
<p>La base de donn&#233;es lexicales Novlex est un outil permettant d'estimer l'&#233;tendue et la fr&#233;quence 
lexicale du vocabulaire &#233;crit adress&#233; &#224; des &#233;l&#232;ves francophones de l'enseignement primaire. 
Elle  a  &#233;t&#233;  constitu&#233;e gr&#226;ce &#224;  l'analyse de livres scolaires et  extra-scolaires destin&#233;s &#224;  des 
&#233;l&#232;ves de CE2 (8-9 ans). Novlex est construit &#224; partir d'un corpus d'&#224; peu pr&#232;s 417 000 mots, 
ne comprenant ni noms propres, ni pr&#233;noms, ni noms de ville, ni onomatop&#233;es et ramen&#233;s en 
minuscule. De ce corpus, 20 600 entr&#233;es orthographiquement diff&#233;rentes (base d'occurrences) 
et 9300 racines lexicales (base lexicale) distinctes ont &#233;t&#233; extraites.
</p>
<p>La derni&#232;re source d'information utilis&#233;e est une &#233;tude men&#233;e par Dominique Bassano sur le 
d&#233;veloppement du langage chez l'enfant. Cette &#233;tude reprend environ 1500 mots recueillis &#224; 
partir de questionnaires donn&#233;s &#224; des parents d'enfants. On trouve dans cette &#233;tude les verbes 
que connaissent les enfants, les adjectifs et les noms propres class&#233;s en diff&#233;rentes cat&#233;gories 
tel que les animaux, la maison, les repas...
</p>
<p>3.2 Cr&#233;ation du lexique
</p>
<p>Il est inutile pour nous de travailler avec un lexique de 30 000 mots car beaucoup d'entre eux 
ne  vont  &#234;tre  utilis&#233;s  que  tr&#232;s  rarement  par  les  enfants.  Nous  avons  choisi  de  faire  un 
croisement de ces diff&#233;rentes bases de donn&#233;es lexicales en fonction du nombre d'occurrence 
de chaque mot. Le r&#233;sultat nous est apparu surprenant car des mots tr&#232;s peu utilis&#233;s dans la 
langue fran&#231;aise se trouvent tr&#232;s bien plac&#233;s dans la base de donn&#233;es Novlex en triant par 
nombre d'occurrences. Ainsi le mot &#8220;accu&#8221;, qui est l&#8217;abr&#233;viation d&#8217;accumulateur, le syst&#232;me 
d'alimentation  &#233;lectrique,  se  retrouve  1428 fois  dans  la  base  lexicale,  alors  que  les  mots 
&#8220;abricot&#8221; ou &#8220;basket&#8221; ne se retrouvent que 238 fois. Pourtant il nous parait &#233;vident que les 
enfants ont plus de chance de nous parler de fruit, que de source &#233;nerg&#233;tique.
</p>
<p>On peut expliquer le fait que des mots moins connus des enfants se retrouvent bien plac&#233;s 
dans les fr&#233;quences par le fait que la base lexicale est cr&#233;e &#224; partir de manuels scolaires et 
donc servent &#233;galement &#224; &#233;largir le vocabulaire des plus jeunes. Ce genre de manuels contient 
donc  des  mots  connus  par  les  enfants  et  d&#8217;autres  qu&#8217;ils  doivent  apprendre  mais  qu&#8217;ils 
n&#8217;utilisent pas forcement fr&#233;quemment.
</p>
<p>Le croisement de toutes les bases n&#8217;apportant pas grand chose, certaines contenant des noms 
propres,  nous  avons  donc  d&#233;cid&#233;  de  nous  limiter  au  croisement  des  mots  de  l'&#233;tude  de 
Dominique Bassano et des mots de CP de Manulex. Ce croisement permet de se concentrer 
sur un public volontairement jeune (CP)  qui est la cible vis&#233;e, tout en int&#233;grant la majorit&#233; 
des mots qui seront employ&#233;s par les enfants. Ce lexique se compose donc au final d&#8217;environ 
8000 lemmes qui repr&#233;senteront l&#8217;ensemble du vocabulaire compr&#233;hensible par le robot.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Adaptation d&#8217;un syst&#232;me de compr&#233;hension pour un robot compagnon
</p>
<p>4 Quelle interpr&#233;tation : les sorties
</p>
<p>Une fois le lexique cr&#233;&#233;, le module de compr&#233;hension doit traiter les informations qu&#8217;il re&#231;oit, 
puis transmettre le r&#233;sultat pour pouvoir g&#233;n&#233;rer l&#8217;&#233;motion ad&#233;quate en r&#233;ponse aux paroles 
de l&#8217;enfant. A l&#8217;issue de l&#8217;&#233;tape de compr&#233;hension de l&#8217;&#233;nonc&#233;, quatre types d&#8217;informations 
sont propos&#233;s au module d&#8217;interaction &#233;motionnelle :
</p>
<p>&#8226; L&#8217;acte de langage associ&#233; &#224; l&#8217;&#233;nonc&#233;
</p>
<p>&#8226; Le contenu pr&#233;positionnel
</p>
<p>&#8226; L'&#233;tat &#233;motionnel de l'enfant
</p>
<p>&#8226; L&#8217;univers du discours
</p>
<p>A chaque &#233;nonc&#233; est associ&#233; son acte de langage (Austin, 1962) afin de caract&#233;riser l&#8217;intention 
port&#233;e par le locuteur. Les actes de langage retenu sont l&#8217;affirmation, l&#8217;ordre, la demande et la 
promesse.
</p>
<p>Le  contenu  pr&#233;positionnel  de  l&#8217;&#233;nonc&#233;  sera  repr&#233;sent&#233;  sous  la  forme  de  pr&#233;dicats  et  de 
propri&#233;t&#233;s. Ils vont &#234;tre r&#233;cup&#233;r&#233;s &#224; partir de la formule logique qui va &#234;tre cr&#233;&#233;e &#224; la fin de la 
compr&#233;hension. Ils se composeront des diff&#233;rentes actions, des objets dont l&#8217;enfant aura parl&#233; 
et des propri&#233;t&#233;s de chacun d&#8217;entre eux. Nous avons d&#233;j&#224; r&#233;duit nos diff&#233;rents objets &#224; partir 
de  l&#8217;&#233;tude  des  travaux  de  Dominique  Bassano,  pour  d&#233;terminer  une  premi&#232;re  s&#233;rie  de 
pr&#233;dicats et d&#8217;arguments dont le module d&#8217;&#233;motion va se servir pour apporter une r&#233;ponse. 
</p>
<p>L&#8217;&#233;tat &#233;motionnel de l&#8217;enfant va &#234;tre repr&#233;sent&#233; par un vecteur comportant les six &#233;motions de 
base (S. Saint-Aim&#233; et al., 2007). Il est pr&#233;vu que plusieurs &#233;motions pourront se trouver dans 
un m&#234;me &#233;nonc&#233;.  Pour pouvoir  r&#233;pondre &#224; ce probl&#232;me, il  est  pr&#233;vu de repr&#233;senter l&#8217;&#233;tat 
&#233;motionnel par un vecteur comportant les six &#233;motions de bases, et pouvant comporter les 
valeurs 0 si l&#8217;information n&#8217;a pas &#233;t&#233; d&#233;tect&#233;e de fa&#231;on certaine, 1 si l&#8217;&#233;motion est pr&#233;sente de 
fa&#231;on  &#171; normale &#187;  et  2  si  l&#8217;&#233;motion  est  fortement  pr&#233;sente.  On  se  r&#233;serve  &#233;galement  la 
possibilit&#233; de mettre la valeur -1 si l&#8217;&#233;motion n&#8217;a pas &#233;t&#233; d&#233;tect&#233;e mais qu&#8217;on ne puisse pas 
affirmer qu&#8217;elle n&#8217;est pas pr&#233;sente.  
</p>
<p>L&#8217;univers du discours correspond &#224; la situation dans laquelle l&#8217;enfant a exprim&#233; ses paroles. 
Nous avons pour le moment d&#233;limit&#233;  deux grandes cat&#233;gories que sont  le monde r&#233;el  o&#249; 
l&#8217;enfant s&#8217;exprime sur des actions r&#233;alistes et le monde du jeu (ou de l&#8217;imaginaire) o&#249; l&#8217;enfant 
peut &#233;ventuellement exprimer des faits fantaisistes. L&#8217;historique du discours nous permettra de 
d&#233;terminer si l&#8217;enfant parle s&#233;rieusement ou s&#8217;il joue.
Par exemple pour l'enonc&#233; : &#171; je veux manger une pomme &#187; dit en criant, on doit pouvoir 
transmettre : (acte de langage : demande, pr&#233;dicat : manger(je, pomme), le vecteur emotionnel 
, univers : vie relle). On peut penser que le vecteur emotionne serait positif pour la col&#233;re.
</p>
<p>Une fois  toutes  ces  informations  transmises  le  module  de  g&#233;n&#233;ration d&#8217;&#233;motion  s&#8217;occupe 
d&#8217;apporter la r&#233;ponse &#224; l&#8217;enfant. (S. Saint-Aim&#233; et al., 2007).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le Tallec Marc
</p>
<p>5 Adaptation du syst&#232;me
</p>
<p>Le module de compr&#233;hension repose sur la m&#234;me architecture que le syst&#232;me Logus et les 
m&#234;me  trois  &#233;tapes.  Le  choix  des  mots  du  lexique  &#233;tant  fait,  il  faut  ajouter  toutes  les 
traductions pour l&#8217;&#233;tape de lemmatisation. Il faut r&#233;&#233;crire, comme dans le syst&#232;me Logus, les 
&#233;tiquettes syntaxiques, les &#233;tiquettes s&#233;mantiques et la repr&#233;sentation s&#233;mantique de chaque 
entr&#233;e du lexique. La structure syntaxique des &#233;nonc&#233;s devant rester sensiblement identique, 
et le syst&#232;me Logus ayant montr&#233; son efficacit&#233;, les &#233;tiquettes syntaxiques ont &#233;t&#233; conserv&#233;es 
en l&#8217;&#233;tat.
</p>
<p>Le reste est par contre enti&#232;rement &#224; revoir. En ce qui concerne les &#233;tiquettes s&#233;mantiques 
nous avons d&#233;cid&#233; de nous appuyer sur les travaux de Dominique Bassano pour en extraire 
nos objets  que nous manipulerons dans  la  connaissance s&#233;mantique.  On r&#233;alise  alors une 
projection de notre lexique (environ 8000 mots) vers cet ensemble de termes (environ 1200 
mots) par le biais des &#233;tiquettes s&#233;mantiques.
</p>
<p>La partie connaissance s&#233;mantique va ensuite permettre de relier les objets entre eux et d&#8217;en 
extraire du sens. Le probl&#232;me est qu&#8217;en passant &#224; un domaine plus large, le nombre d&#8217;objets 
manipulables a fortement augment&#233;.
</p>
<p>L&#8217;id&#233;e, dans un premier temps, est de cr&#233;er des &#171; mini-ontologies &#187; dans certains domaines 
tr&#232;s connus des enfants, et de les relier les unes aux autres. Ainsi nous cr&#233;erons un maillage 
tr&#232;s forts dans les th&#233;matiques les plus cit&#233;es (comme par exemple le th&#232;me des animaux, de 
l&#8217;&#233;cole, la famille&#8230;) et un peu moins fort dans les autres. Il faudra v&#233;rifier, notamment dans 
le corpus, comment les enfants abordent les diff&#233;rents domaines pour choisir quels sont les 
domaines in&#233;vitables pour notre connaissance. 
</p>
<p>Pour le moment, comme nous avons beaucoup d&#8217;&#233;tiquettes s&#233;mantiques, le premier travail a 
consist&#233;  &#224;  classer  tous  nos  objets  en  sous-parties  pour  cr&#233;er  des  grandes  cat&#233;gories.  Par 
exemples les animaux, les personnes, les lieux, les aliments&#8230; A l&#8217;int&#233;rieur de ces cat&#233;gories 
de nouveaux d&#233;coupages sont r&#233;alis&#233;s. Par exemple, nous avons class&#233; les animaux en trois 
cat&#233;gories : les animaux familiers (qui peuvent vivre &#224; la maison), les animaux proches (que 
les enfants ont l&#8217;habitude de voir) et  les animaux lointains (qui ne vivent pas pr&#233;s de chez 
eux).  Ces  d&#233;coupages  successifs  nous  permettent  dans  un  premier  temps  de  diminuer  le 
nombre d&#8217;&#233;tiquettes &#224; traiter  et de chercher les propri&#233;t&#233;s communes aux objets d&#8217;une m&#234;me 
cat&#233;gorie. Une fois ce travail sur ces cat&#233;gories grossi&#232;res r&#233;alis&#233;, il faudra redescendre vers 
les objets proprement dit et cr&#233;er les &#171; mini-ontologies &#187; plus sp&#233;cialis&#233;es. Cela nous permet 
&#233;galement de proposer au module d&#8217;interactions &#233;motionnelles une r&#233;ponse plus ou moins 
pr&#233;cise en fonction de quel niveau d&#8217;information il sera en mesure de traiter.
</p>
<p>La gestion du dialogue sera &#233;galement un probl&#232;me sachant que la peluche ne parle pas. Cette 
partie d&#233;pendra en grande partie de comment l&#8217;enfant interpr&#232;te les &#171; &#233;motions &#187; &#233;mises par le 
robot. Il faut, en effet, &#234;tre capable de savoir si l&#8217;enfant a bien compris le signal que nous 
avons voulu transmettre, pour pouvoir traiter de fa&#231;on correct l&#8217;&#233;volution du &#171; dialogue &#187;.
</p>
<p>6 Perspectives
</p>
<p>Ce travail  de recherche est  en cours. Les parties lemmatisation et  chunking n&#8217;ont pas &#233;t&#233; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Adaptation d&#8217;un syst&#232;me de compr&#233;hension pour un robot compagnon
</p>
<p>modifi&#233;es dans leur fonctionnement. Le lexique a &#233;t&#233; cr&#233;&#233; mais la partie la plus importante du 
travail reste dans la r&#233;alisation de la connaissance s&#233;mantique. Il faut en effet r&#233;fl&#233;chir aux 
relations indispensables pour la bonne compr&#233;hension des paroles des enfants. L&#8217;analyse du 
corpus permettra de nous donner quelques pistes, mais cela doit &#234;tre nuanc&#233; par le fait que les 
conditions  d&#8217;enregistrements  ne  sont  pas  exactement  les  m&#234;mes  que  les  conditions 
d&#8217;utilisation du robot. 
</p>
<p>Le travail  de cr&#233;ation des connaissances a &#233;t&#233; commenc&#233; avec un premier d&#233;coupage des 
diff&#233;rents objets en sous parties. Cette premi&#232;re &#233;tape permet de faire une taxonomie pour 
&#233;ventuellement  augmenter  la  granularit&#233;  des  r&#233;sultats  &#224;  fournir  au  module  d&#8217;interactions 
&#233;motionnelles. 
</p>
<p>Les premi&#232;res exp&#233;rimentations avec le robot nous permettrons de r&#233;pondre &#224; de nombreuses 
questions et d&#8217;ajuster le module de compr&#233;hension. Nous saurons alors comment les enfants 
per&#231;oivent la peluche, quelles sont les th&#233;matiques principales abord&#233;es et s&#8217;il faut modifier la 
connaissance sur le monde, comment ils comprennent les r&#233;ponses du robot.
</p>
<p>Une fois la compr&#233;hension des &#233;nonc&#233;s r&#233;alis&#233;e, l&#8217;&#233;tape suivante va &#234;tre de s&#8217;int&#233;resser &#224; la 
mani&#232;re de d&#233;tecter l&#8217;&#233;tat &#233;motionnel de l&#8217;enfant. Pour y arriver deux types d&#8217;informations 
suppl&#233;mentaires pourront nous &#234;tre utiles : la prosodie et une image de l&#8217;enfant r&#233;cup&#233;r&#233;e &#224; 
l&#8217;aide d&#8217;une cam&#233;ra plac&#233;e dans le robot, au niveau du nez.
</p>
<p>Remerciements
</p>
<p>Je  remercie  l&#8217;agence  nationale  de  la  recherche  qui  finance  ce  projet  et  le  laboratoire 
VALORIA de l&#8217;universit&#233; Bretagne Sud qui m&#8217;accueille pour mes recherches.
</p>
<p>R&#233;f&#233;rences
</p>
<p>Austin J.  L.  (1962).  How  to  Do  Things  With  Words.  Oxford  University  Press:  Oxford, 
England.
</p>
<p>Bassano D., Labrell F., Champaud C., Lem&#233;tayer F., Bonnet P. (2005). Le DLPF : un nouvel 
outil pour l&#8217;&#233;valuation du d&#233;veloppement du langage de production en fran&#231;ais.  Enfance 2, 
171-208.
</p>
<p>Blanche-Benveniste C. (2002). L&#8217;&#233;tude grammaticale des corpus de langue parl&#233;e en fran&#231;ais 
&#187;, Actes de Journ&#233;es linguistiques de corpus.
</p>
<p>Blanche-Benveniste C. (1990). Le fran&#231;ais parl&#233; ; &#233;tudes grammaticales, CNRS Editions.
Devillers L., Bonneau-Maynard H., Rosset S., Paroubek P., Mostefa D., Choukri K., Charnay 
L., Bousquet C., Vigouroux N., Bechet F., Romary L., Antoine J-Y., Villaneau J., Vergnes M. 
and Goulian J. (2004). The French Evalda-Media project: the evaluation of the understanding 
capabilities  of  Spoken  Language  Dialogue  Systems.  Actes  de  the  4th  International </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le Tallec Marc
</p>
<p>Conference on Language Resources and Evaluation., 2131-2134.
Kerbrat-Orecchioni C. (1980). L&#8217;&#233;nonciation, Colin.
</p>
<p>Lambert, E. &amp; Chesnet, D. (2001). Novlex: une base de donn&#233;es lexicales pour les &#233;l&#232;ves de 
primaire. L'Ann&#233;e Psychologique 101, 277-288.
</p>
<p>L&#233;t&#233;,  B.,  Sprenger-Charolles,  L.,  &amp;  Col&#233;,  P. (2004).  MANULEX :  A grade-level  lexical 
database from French elementary-school readers .  Behavior Research Methods, Instruments,  
&amp; Computers, 36, 156-166..
</p>
<p>Saint-Aim&#233; S.,  Le-P&#233;v&#233;dic B., Duhaut D. (2007). G&#233;n&#233;rer des &#233;motions avec 6 degr&#233;s de 
libert&#233;. Actes  de  1&#232;re  Conf&#233;rence  Internationale  sur  l'accessibilit&#233;  et  les  syst&#232;mes  de 
suppl&#233;ance aux personnes en situation de handicap, ASSISTH 2007.
</p>
<p>Saint-Aim&#233; S., Le-P&#233;v&#233;dic B., Duhaut D., Shibata T. (2007). Emotirob : Companion Robot 
Project. Actes de  IEEE  RO-MAN  2007,  16th  IEEE  Int.  Symp.  On  Robot  and  Human 
Interactive Communication.
</p>
<p>Villaneau J., Antoine J-Y., Ridoux O. (2002). LOGUS : un syst&#232;me formel de compr&#233;hension 
du fran&#231;ais parl&#233; spontan&#233; - pr&#233;sentation et &#233;valuation. Actes de TALN'2002, 165-174.</p>

</div></div>
</body></html>