<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une structure pour les questions enchain&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Une structure pour les questions enchain&#233;es
</p>
<p>K&#233;vin S&#233;journ&#233;
Universit&#233; de Paris Sud XI, Limsi-CNRS, BP 133, 91403 Orsay Cedex
</p>
<p>B&#226;timent 508
kevin.sejourne@limsi.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons des travaux r&#233;alis&#233;s dans le domaine des syst&#232;mes de questions
r&#233;ponses (SQR) utilisant des questions enchain&#233;es. La recherche des documents dans un SQR
est perturb&#233;e par l&#8217;absence d&#8217;informations sur la valeur &#224; accorder aux &#233;l&#233;ments de texte &#233;ven-
tuellement utiles &#224; la recherche d&#8217;informations qui figurent dans les questions li&#233;es. Les r&#233;centes
campagnes d&#8217;&#233;valuation montrent que ce probl&#232;me est sous-estim&#233;, et n&#8217;a pas fait l&#8217;oeuvre de
technique d&#233;di&#233;e. Afin d&#8217;am&#233;liorer la recherche des documents dans un SQR nous &#233;tudions une
nouvelle m&#233;thode pour organiser les informations li&#233;es aux interactions entre questions. Celle-ci
se base sur l&#8217;exploitation d&#8217;une structure de donn&#233;es adapt&#233;e &#224; la transmission des informations
des questions li&#233;es jusqu&#8217;au moteur d&#8217;interrogation.
Abstract. We present works realized in the field of questions answering systems(SQR)
using chained questions. The search for documents in a SQR is disrupted by the absence of
information on the value to be granted to the possibly useful elements of text in search of
information which appear in bound questions. The recent campaigns of evaluation show that
this problem is under estimated, and did not make the work of dedicated technique. To improve
the search for documents in a SQR we study a new method to organize the information bound
to the interactions between questions. This one is based on the operation of a structure of data
adapted to the transmission of the information of bound questions up to the search engine.
</p>
<p>Mots-cl&#233;s : Question r&#233;ponse enchain&#233;e.
Keywords: chained question answering.
</p>
<p>1 Introduction aux questions encha&#238;n&#233;es
</p>
<p>Les questions enchain&#233;es sont des questions destin&#233;es &#224; des syst&#232;mes de questions r&#233;ponses
classiques, mais qui pr&#233;sentent une difficult&#233; suppl&#233;mentaire. Chaque question doit &#234;tre in-
</p>
<p>1 O&#249; se trouve la cath&#233;drale Sainte-Sophie en Russie ?
2 Qui &#233;tait son archipr&#234;tre en 1995 ?
3 Quel &#201;cossais a construit la cath&#233;drale ?
4 Quelle imp&#233;ratrice russe l&#8217;a accr&#233;dit&#233; pour la construire ?
</p>
<p>TAB. 1 &#8211; Exemple d&#8217;un groupe de questions encha&#238;n&#233;es tir&#233;es du corpus utilis&#233;es pour la cam-
pagne d&#8217;&#233;valuation CLEF 2007.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>K&#233;vin S&#233;journ&#233;
</p>
<p> ( I ) 
 ( II ) 
</p>
<p> ( III ) 
</p>
<p>Questions
en fran&#231;ais
</p>
<p>Traduction
en anglais
</p>
<p>   Focus 
   Type de la r&#233;ponse
</p>
<p>   Termes reli&#233;s s&#233;mantiquement
</p>
<p>   Verbe principal 
   Termes
</p>
<p>   Relations syntaxiques
</p>
<p>Analyse de la question  
</p>
<p>Termes
en anglais
</p>
<p>Fusion
de r&#233;ponses
</p>
<p>2 listes tri&#233;es
R&#233;ponses
en anglais
</p>
<p>Questions
en anglais
</p>
<p>(a)
</p>
<p>   S&#233;lection
   Marquage des EN
</p>
<p>Extraction de la r&#233;ponse
</p>
<p>   R&#233;&#8722;indexation et tri
</p>
<p>   Pond&#233;ration des phrases
</p>
<p>Traitement des documents
</p>
<p>(b)
   Extraction de la r&#233;ponse
</p>
<p>   
</p>
<p>Collection
</p>
<p>recherche
de
</p>
<p>Moteur
</p>
<p>FIG. 1 &#8211; Architecture du syst&#232;me Musclef en mode inter-lingue
</p>
<p>terpr&#233;t&#233;e en connaissance de l&#8217;historique des questions et des r&#233;ponses pr&#233;c&#233;dentes. Il y a eu
r&#233;cemment plusieurs campagnes d&#8217;&#233;valuation de syst&#232;mes de questions r&#233;ponses (SQR) o&#249; des
questions enchain&#233;es &#233;taient propos&#233;es. Selon les corpus, les questions enchain&#233;es peuvent faire
r&#233;f&#233;rence &#224; un contexte global (ou sujet global) pr&#233;alablement introduit comme ce fut le cas dans
la campagne d&#8217;&#233;valuation TREC (Zhou et al., 2006). Elles peuvent aussi faire r&#233;f&#233;rence aux r&#233;-
ponses pr&#233;c&#233;dentes ou avoir de multiples r&#233;f&#233;rences vers d&#8217;autres questions. Les questions en-
chain&#233;es peuvent pr&#233;senter toutes ces difficult&#233;s sans les annoncer explicitement, comme dans
la campagne d&#8217;&#233;valuation des SQR Clef07 (Penas et al., 2007) ; la premi&#232;re question peut m&#234;me
parfois avoir le r&#244;le d&#8217;un introducteur de contexte. Le tableau 1 montre un exemple de groupe
de questions enchain&#233;es. Parfois les SQR sont inter-lingue, cela signifie que la langue des do-
cuments est diff&#233;rente de la langue des questions, comme c&#8217;&#233;tait le cas pour une des pistes de
la campagne Clef07. C&#8217;est le corpus de cette campagne que nous utilisons par la suite.
</p>
<p>Le syst&#232;me Musclef (figure 1) d&#233;velopp&#233; au Limsi a globalement une architecture semblable
aux SQR classiques. Le probl&#232;me que nous nous posons est alors de savoir comment organi-
ser les informations des questions pr&#233;c&#233;dentes pour que celles-ci puissent &#234;tre utilis&#233;es pour
am&#233;liorer la recherche de la r&#233;ponse ?
</p>
<p>Dans la suite de notre article, nous proposons les d&#233;finitions suivantes :
</p>
<p>Terme : Un terme est un mot ou un groupe de mots consid&#233;r&#233; lors de l&#8217;interpr&#233;tation de la question et
donc jug&#233; pertinent par rapport &#224; des ressources dont nous disposons (documents, dictionnaires, questions
pr&#233;c&#233;dentes ...). Ainsi les termes de la premi&#232;re question du tableau 1 sont &#171;la cath&#233;drale Sainte-Sophie&#187;
et &#171;en Russie&#187;.
</p>
<p>El&#233;ment utile &#224; la recherche d&#8217;information (RI) : Un &#233;l&#233;ment utile &#224; la RI peut &#234;tre de plusieurs
natures : cela peut &#234;tre un groupe de termes d&#8217;une question, de r&#233;ponse ou des r&#233;sultats interm&#233;diaires
de calcul d&#8217;un SQR. Par exemple, la cat&#233;gorie de la r&#233;ponse est un &#233;l&#233;ment. Les &#233;l&#233;ments de la premi&#232;re
question sont les termes &#171;la cath&#233;drale Sainte-Sophie&#187;, &#171;en Russie&#187;, la cat&#233;gorie de la question &#171;lieu&#187;,
et la r&#233;ponse &#171;Novgorod&#187;.
</p>
<p>D&#233;pendance d&#8217;un couple question/r&#233;ponse vers un autre : Une d&#233;pendance d&#8217;un couple QR
vers un autre est un lien hi&#233;rarchique lexical/ syntaxique/ s&#233;mantique/ pragmatique n&#233;cessaire &#224; la bonne
r&#233;solution d&#8217;une question. Les d&#233;pendances vont d&#8217;une paire question/r&#233;ponse vers une autre paire ques-
tion/r&#233;ponse. La question 2 du tableau 1 d&#233;pend de la 1 : Cette d&#233;pendance a pour origine le mot &#171;son&#187;,
qui renvoie &#224; un attribut d&#8217;un objet pr&#233;c&#233;demment &#233;voqu&#233;. Comme il n&#8217;y en a pas dans la question 2, il
s&#8217;agit de la question 1 ; la question 3 d&#233;pend de la 1 ; la question 4 d&#233;pend de la 3 mais pas directement
de la 1, un &#233;l&#233;ment est manquant pour cette r&#233;solution. Par contre, les d&#233;pendances sont transitives : 4
h&#233;rite de la d&#233;pendance de 3 vers 1.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une structure pour les questions enchain&#233;es
</p>
<p>Contexte (d&#8217;une question d&#8217;un groupe) : Un contexte est un groupe d&#8217;&#233;l&#233;ments reli&#233;s via des
d&#233;pendances. C&#8217;est l&#8217;ensemble de tous les &#233;l&#233;ments utiles &#224; la RI pour la r&#233;solution d&#8217;une question en
tenant compte des questions auxquelles elle est li&#233;e. Pour consid&#233;rer un contexte possible d&#8217;une question
il faut les &#233;l&#233;ments de chaque couple question/r&#233;ponse obtenu en suivant les d&#233;pendances de tous les
couples question/r&#233;ponse qui la pr&#233;c&#232;dent dans le groupe.
</p>
<p>Notre probl&#232;me peut alors se reformuler ainsi : Si nous consid&#233;rons que les donn&#233;es issues
des d&#233;pendances peuvent am&#233;liorer la recherche de la r&#233;ponse, comment structurer le contexte
pour que cette recherche soit plus efficace ? Chiori et Al. (Chiori et al., 2003 4) rencontrent
ce probl&#232;me dans leur syst&#232;me de question r&#233;ponse interactif &#233;crit/oral, mais lui apportent une
solution bas&#233;e sur une interrogation de l&#8217;utilisateur. 1
</p>
<p>Dans la litt&#233;rature on trouve essentiellement trois approches possibles :
</p>
<p>1) Ajouter les &#233;l&#233;ments de la question li&#233;e au texte de la nouvelle question et mettre en entr&#233;e
d&#8217;un SQR classique.
Cela revient &#224; modifier les questions au niveau du point I de la figure 1. Il faut alors disposer
d&#8217;un syst&#232;me capable d&#8217;assurer que la jointure sera r&#233;alis&#233;e correctement. Il faut aussi pouvoir
g&#233;rer les diff&#233;rentes formulations et interpr&#233;tations, et dans tous les cas disposer d&#8217;un module de
plus pour ne pas oublier le type attendu de la r&#233;ponse ou d&#8217;autres &#233;l&#233;ments pertinents. Souvent
l&#8217;ensemble est mal formul&#233; et donc mal analys&#233;. La question &#171;Quelle imp&#233;ratrice russe l&#8217;a
accr&#233;dit&#233; pour la construire ?&#187; peut se r&#233;-&#233;crire de nombreuses mani&#232;res.2
&#8211; Ajout &#224; la fin avec s&#233;paration du contexte par un &#8217; ;&#8217; : Quelle imp&#233;ratrice russe l&#8217;a accr&#233;dit&#233; pour
</p>
<p>la construire ; [un] &#233;cossais, Vladimir [of|de] Novgorod, cath&#233;drale Sainte-Sophie Russie ?
&#8211; Unifications syntaxiques des &#233;l&#233;ments : Quelle imp&#233;ratrice russe a accr&#233;dit&#233; [[un] &#233;cossais|Vladimir
</p>
<p>[of|de] Novgorod] pour construire la cath&#233;drale [Sainte-Sophie [en Russie]] ?
Cette approche est limit&#233;e &#224; ce que l&#8217;on peut re-structurer dans une phrase sans trop perturber le
syst&#232;me d&#8217;analyse de la question. Pour les syst&#232;mes de QR inter-lingues il faudrait aussi pr&#233;voir
de traduire la r&#233;ponse.
</p>
<p>2) Ajouter les &#233;l&#233;ments de la question li&#233;e directement dans la structure des termes destin&#233;s au
moteur de recherche.
C&#8217;est &#224; dire au niveau du point II de la figure 1. Les termes composant les &#233;l&#233;ments de la question
li&#233;e sont alors m&#234;l&#233;s &#224; ceux de la nouvelle question (Buscaldi et al., 2007). La structure envoy&#233;e
au moteur de recherche est une structure qui contient notamment le r&#233;sultat de la r&#233;solution
des anaphores. Cependant, cet ajout ne permet pas de faire de distinction entre ce qui vient
de la question courante ou de la pr&#233;c&#233;dente. Dans le groupe du tableau 1, apr&#232;s la r&#233;solution
d&#8217;anaphores, il n&#8217;est plus possible de savoir que l&#8217;&#233;l&#233;ment de texte &#171;cath&#233;drale Sainte-Sophie
Russie&#187; provient de la premi&#232;re question. Il est possible d&#8217;avoir simultan&#233;ment deux documents
dans lesquels on trouve qu&#8217;un &#233;cossais a construit quelque chose et un autre dans lequel on
trouve qu&#8217;une personne a construit une cath&#233;drale en Russie. Mais il est possible que l&#8217;on ne
dispose pas de documents parlant simultan&#233;ment d&#8217;&#233;cossais, de cath&#233;drale et de Russie.
Quel poids accorder &#224; ces diff&#233;rents &#233;l&#233;ments quand on ne sait pas d&#8217;o&#249; ils viennent ?
</p>
<p>1La solution examine un score d&#8217;ambig&#252;it&#233; structurelle d&#8217;une question pour d&#233;terminer de nouvelles questions
de d&#233;sambig&#252;isation. Puis l&#8217;utilisateur est cens&#233; y r&#233;pondre correctement pour apporter des informations dont les
d&#233;pendances inter question-r&#233;ponse peuvent &#234;tre correctement r&#233;solues.
</p>
<p>2&#171;Vladimir of Novgorod&#187; est la r&#233;ponse de Musclef &#224; la question 3 du tableau 1.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>K&#233;vin S&#233;journ&#233;
</p>
<p>Par exemple : dans le contexte de la cath&#233;drale de Novgorod, dans l&#8217;ensemble des documents
de clef 2007, il &#233;tait possible de trouver le nom d&#8217;un personne ayant construit la cath&#233;drale3.
Mais rien ne confirme ou n&#8217;infirme que cette personne soit de nationalit&#233; &#233;cossaise4.
</p>
<p>Ce n&#8217;est donc pas satisfaisant, si en plus les groupes de questions forment des s&#233;quences o&#249; les
&#233;l&#233;ments de texte sont repris implicitement ou avec une variation/oubli partielle, cette approche
conduit &#224; une perte de performance proportionnelle &#224; la longueur des s&#233;quences de questions.
</p>
<p>3) R&#233;aliser une premi&#232;re recherche sur la premi&#232;re question.
Cette premi&#232;re question d&#233;finit le contexte du groupe. Puis r&#233;aliser les recherches suivantes uni-
quement sur l&#8217;ensemble de documents trouv&#233;s lors de cette premi&#232;re recherche (Zhou et al.,
2006; Hickl et al., 2006). On r&#233;duit &#224; chaque question la collection utilis&#233;e au niveau du point
III de la figure 1. On peut remarquer qu&#8217;avec cette strat&#233;gie, une question d&#233;pendant de n autres
dispose alors d&#8217;un ensemble de recherche r&#233;duit n fois. Il n&#8217;y a aucun moyen de re-ouvrir l&#8217;es-
pace de recherche. Pour des s&#233;quences de questions avec des d&#233;pendances, cette strat&#233;gie n&#8217;est
pas g&#233;n&#233;ralisable. Par exemple, imaginons que dans le groupe pr&#233;sent&#233; en exemple nous ayons
d&#233;j&#224; analys&#233; les d&#233;pendances entre questions et que l&#8217;on puisse restreindre l&#8217;&#233;tude &#224; la s&#233;quence
de questions 1 3 4. La r&#233;solution de la question 4 se fera sur les seuls documents qui parlent de
&#171;cath&#233;drale Sainte-Sophie en Russie&#187; et d&#8217;&#171;Ecossais&#187;. Si la r&#233;ponse est dans un document li&#233;
au nom de l&#8217;Ecossais seul sans sa nationalit&#233;, alors la r&#233;ponse ne sera pas trouv&#233;e.
Dans les SQR, les documents sont g&#233;n&#233;ralement d&#233;coup&#233;s en paragraphes de taille &#233;quivalente
avant leur indexation. L&#8217;impact de la taille des paragraphes est &#233;videmment tr&#232;s important. Trop
gros ils ne restreignent pas suffisamment la recherche, et la seconde question est trait&#233;e presque
&#8217;hors contexte&#8217;. Trop petits ils la restreignent trop, et il n&#8217;y plus assez d&#8217;information autour
de la r&#233;ponse. Pour trouver une taille de paragraphe adapt&#233;e aux questions enchain&#233;es, il fau-
drait aussi que les questions r&#233;f&#232;rent toujours &#224; des informations proches dans les paragraphes
des documents r&#233;ponses des premi&#232;res questions. Il faut aussi que cette proximit&#233; puisse &#234;tre
quantifi&#233;e afin de d&#233;finir la taille adapt&#233;e des paragraphes.
</p>
<p>Dans les 3 approches pr&#233;sent&#233;es ci-dessus, les &#233;l&#233;ments ont la m&#234;me importance, ce qui pose de
probl&#232;me et ne permet pas une recherche efficace. Aucune de ces strat&#233;gies n&#8217;est satisfaisante.
Plus g&#233;n&#233;ralement, la quantit&#233; d&#8217;&#233;l&#233;ments pour une recherche unique augmente lin&#233;airement
avec la profondeur des d&#233;pendances entre questions. Le probl&#232;me se pose pour le choix des &#233;l&#233;-
ments : ne prendre que ceux de la question ? ou prendre tous ceux de toutes les questions li&#233;es ?
C&#8217;est un probl&#232;me de contr&#244;le du bruit par rapport au silence dans le nombre de documents
retourn&#233;s par le moteur de recherche.
</p>
<p>Dans un groupe de questions enchain&#233;es, les contraintes sur la recherche d&#8217;informations sont les
d&#233;pendances entre questions ainsi que la structuration des ensembles de termes en &#233;l&#233;ments et
contextes. Ainsi, nous voulons proposer une nouvelle structure permettant de lier les contraintes
classiques de recherche d&#8217;informations (les termes), &#224; des contraintes concernant l&#8217;ordre dans
lequel ces termes peuvent &#234;tre relax&#233;s en cas de silence trop important. Nous pouvons donc obte-
nir des contraintes sur la mani&#232;re de relaxer d&#8217;autres contraintes. L&#8217;utilisation de cette structure
suppose de concevoir une strat&#233;gie de relaxation qui soit adapt&#233;e au domaine d&#8217;application du
SQR. Toute relaxation de contraintes sera alors r&#233;alis&#233;e en tenant compte des performances de
la recherche. Une recherche plus performante pourra &#234;tre mise en place et une justification des
</p>
<p>3Vladimir of Novgorod, cf Article wikipedia anglais &#171;Saint_Sophia_Cathedral_in_Novgorod&#187; et
&#171;Church_of_Scotland&#187; de la cath&#233;drale sainte-sophie de Novgorod
</p>
<p>4Une analyse pragmatique approfondie avec un moteur d&#8217;inf&#233;rence aurait peut-&#234;tre trouv&#233; la nationalit&#233; de cette
personne.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une structure pour les questions enchain&#233;es
</p>
<p>Ou se trouve la cathedral Sainte&#8722;Sophie en Russie ?
Novgorod
</p>
<p>Quel ecossais a construit la cathedrale ?
Vladimir of NovgorodQui etait son archipretre en 1995 ?
</p>
<p>Nikoai L&#8217;vovich Tserpitskii
</p>
<p>Quelle imperatrice l&#8217;a accredite pour la construire ?
Nil
</p>
<p>FIG. 2 &#8211; L&#8217;arbre correspondant au groupe du tableau 1
</p>
<p>termes choisis fournie &#224; l&#8217;utilisateur. Dans le cas id&#233;al, nous sommes aussi convaincus que les
SQR capables de r&#233;soudre des questions enchain&#233;es de cette mani&#232;re sont une &#233;tape vers des
syst&#232;mes de dialogue homme-machine en domaine ouvert.
</p>
<p>Nous voulons donc cr&#233;er une structure qui permet de repr&#233;senter les d&#233;pendances d&#8217;un groupe
afin d&#8217;am&#233;liorer la recherche dans les documents. Nous nous int&#233;ressons plus particuli&#232;rement
&#224; la partie structure et organisation du probl&#232;me. C&#8217;est ce que nous allons pr&#233;senter maintenant.
</p>
<p>2 Construction de la structure du contexte
</p>
<p>Nous avons voulu construire une structure pour repr&#233;senter plus finement les d&#233;pendances. Nous
allons maintenant pr&#233;ciser cette structure et expliquer une m&#233;thode de construction. Nous ana-
lyserons alors sa performance &#224; trouver ces d&#233;pendances. En s&#8217;inspirant des travaux sur les
structures de dialogue (Vilnat, 2005), de la nature s&#233;quentielle des groupes de questions et du
partage des termes des questions d&#233;j&#224; r&#233;solues du groupe, nous choisissons d&#8217;organiser la struc-
ture du contexte d&#8217;un groupe de questions en un arbre (figure 2).
</p>
<p>2.1 L&#8217;organisation
</p>
<p>La structure du contexte est un arbre, &#224; sa racine on trouve le contexte commun &#224; toutes les ques-
tions. Chaque branche est constitu&#233;e d&#8217;un arbre de paires question/r&#233;ponse. A chaque noeud
sont indiqu&#233;s la question et son contexte. Ce sont les d&#233;pendances qui encodent la structure de
l&#8217;arbre. Le contexte est compos&#233; d&#8217;une liste d&#8217;&#233;l&#233;ments faisant &#233;ventuellement r&#233;f&#233;rence &#224; un
noeud r&#233;ponse.
</p>
<p>La structure d&#8217;arbre nous permet de repr&#233;senter efficacement les groupes o&#249; les questions ne re-
prennent que le contexte issu de la premi&#232;re question. L&#8217;ajout des &#233;l&#233;ments d&#8217;informations utiles
&#224; la recherche d&#8217;information &#224; chaque noeud permet une repr&#233;sentation homog&#232;ne des groupes
o&#249; les questions r&#233;utilisent des contextes li&#233;s les uns aux autres. Les questions ne r&#233;utilisant pas
le contexte des pr&#233;c&#233;dentes sont rattach&#233;es au noeud groupe. Ce noeud groupe peut &#233;galement
recevoir des &#233;l&#233;ments afin de contraindre l&#8217;espace de recherche &#224; la mani&#232;re des &#233;valuations de
Trec 2006 5 (Hickl et al., 2006).
</p>
<p>5Un contexte &#233;tait donn&#233; explicitement pour chaque groupe de questions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.2 La construction K&#233;vin S&#233;journ&#233;
</p>
<p>2.2 La construction
</p>
<p>Nous appelons d&#233;pendance unitaire un chemin de longueur 1 dans l&#8217;arbre de d&#233;pendance. Pour
d&#233;tecter des d&#233;pendances, nous combinons un ensemble de crit&#232;res linguistiques concernant
une d&#233;pendance unitaire. La combinaison de crit&#232;res donne un score de fiabilit&#233; d&#8217;existence
(cf 2.2.2) de cette d&#233;pendance. Il est possible d&#8217;ajouter autant de crit&#232;res que l&#8217;on veut afin
d&#8217;am&#233;liorer la d&#233;tection. La formalisation en d&#233;pendances unitaires nous permet donc d&#8217;obtenir
une r&#233;solution multi-crit&#232;re qui n&#8217;est pas d&#233;pendante d&#8217;un concept linguistique sous-jacent.
Chaque crit&#232;re retourne un unique score pour un couple de questions. C&#8217;est la valeur de ce
score qui permet de d&#233;terminer l&#8217;existence d&#8217;une d&#233;pendance entre 2 questions.
</p>
<p>2.2.1 Crit&#232;res utilis&#233;s pour construire les vecteurs de scores
</p>
<p>L&#8217;algorithme g&#233;n&#233;rique de cr&#233;ation d&#8217;arbre de d&#233;pendances tient compte d&#8217;un nombre quel-
conque de crit&#232;res linguistiques. Nous avons utilis&#233; les 4 crit&#232;res suivants pour illustrer sa mise
en oeuvre et r&#233;aliser des tests.
</p>
<p>1) Les cat&#233;gories6 des questions d&#233;tect&#233;es par Musclef. Si deux questions ont des cat&#233;go-
ries(Ligozat, 2006) identiques il a beaucoup de chance qu&#8217;il n&#8217;y ait pas de d&#233;pendances de
l&#8217;une vers l&#8217;autre :
Citer le nom d&#8217;un aliment contenu dans le r&#233;gime alimentaire de base d&#8217;Asie du sud-est.
Citer le nom d&#8217;un aliment contenu dans le r&#233;gime alimentaire de base d&#8217;Europe.
Les cat&#233;gories sont identiques, et n&#8217;ont donc pas de lien.
</p>
<p>2) La pr&#233;sence d&#8217;anaphores inter-questions. Un syst&#232;me de r&#233;solutions d&#233;velopp&#233; au labora-
toire7, permet d&#8217;associer des &#233;l&#233;ments d&#8217;une question &#224; l&#8217;autre. Celui-ci utilise essentiellement
un dictionnaire pour d&#233;terminer le genre et le nombre des &#233;l&#233;ments et r&#233;f&#233;rents pour les com-
parer. Les r&#233;f&#233;rents sont calcul&#233;s via des crit&#232;res morpho-syntaxiques inclus dans une mini-
grammaire. Une anaphore inter-questions indique une d&#233;pendance entre 2 questions.
</p>
<p>3) La longueur relative d&#8217;une question par rapport &#224; une autre. Une question avec moins de
caract&#232;res r&#233;introduit probablement moins d&#8217;&#233;l&#233;ments et vraisemblablement r&#233;utilise plus les
&#233;l&#233;ments d&#233;j&#224; introduits. Comme c&#8217;est une mesure de l&#8217;entropie relative entre 2 questions, seules
les diff&#233;rences importantes sont significatives, comme dans l&#8217;exemple suivant :
Quel &#233;tait le nom de la barge qui a coul&#233; &#224; Porto Rico le 7 janvier 1994 ?
Qu&#8217;a heurt&#233; la barge ? Les mots, &#224; cause de leur plus faible nombre relativement aux caract&#232;res et
&#224; cause de leur capacit&#233; d&#8217;agr&#233;gation de sens ne forment pas un bon candidat pour construire un
crit&#232;re de score de d&#233;pendance.
</p>
<p>4) Les entit&#233;s nomm&#233;es identiques d&#8217;une question sur l&#8217;autre. Ce crit&#232;re a tendance &#224; montrer
que les 2 questions ne sont pas li&#233;es, au contraire la r&#233;p&#233;tition partielle d&#8217;une EN8 dans une
question indique plut&#244;t une d&#233;pendance vers la question dans laquelle elle est compl&#232;te.
De quel instrument Swann jouait-il dans le duo &#8217;Flanders et Swann&#8217; ?
Dans quel pays Swann est-il n&#233; ?
Dans quelle ville Swann est-il mort ?
</p>
<p>Nous allons maintenant voir comment ces crit&#232;res sont utilis&#233;s.
6Dans Musclef chaque question a une cat&#233;gorie. Celle-ci permet de connaitre le type de la r&#233;ponse attendue.
7inspir&#233; des travaux de (Hernandez, 2004)
8entit&#233; nomm&#233;e</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une structure pour les questions enchain&#233;es 2.2 La construction
</p>
<p>Num quest 1 2 3 1 2 3
2 [1,1,0,0] X X [7,8,0,0]-&gt; 15 X X
3 [1,1,0,0] [1,0,0,0] X [7,8,0,0]-&gt; 15 [7,0,0,0]-&gt; 7 X
4 [1,1,0,0] [1,0,0,0] [0,2,0,0] [7,8,0,0]-&gt; 15 [7,0,0,0]-&gt; 7 [0,16,0,0]-&gt; 16
</p>
<p>TAB. 2 &#8211; Les crit&#232;res sont [cat&#233;gorie, lien anaphorique, taille,entit&#233; nomm&#233;e]. Premi&#232;re partie :
Les vecteurs de scores pour le groupe en exemple. Seconde partie : Les vecteurs de scores apr&#232;s
pond&#233;ration et projection.
</p>
<p>2.2.2 Un algorithme &#224; 6 &#233;tapes
</p>
<p>A chaque combinaison de deux questions d&#8217;un groupe est associ&#233; un vecteur de scores. Dans
l&#8217;&#233;tape 1 nos vecteurs sont ceux du tableau 2(premi&#232;re partie) pour le groupe en exemple du
tableau 1. Le vecteur de la case (1,2)=[1,1,0,0] indique que seules une diff&#233;rence de cat&#233;gorie
et une anaphore ont &#233;t&#233; trouv&#233;es, entre les questions 1 et 2.
</p>
<p>La seconde &#233;tape consiste &#224; projeter chaque vecteur sur une valeur unique apr&#232;s harmonisation
de leurs composantes. La projection se fait selon une somme pond&#233;r&#233;e par l&#8217;efficacit&#233; a priori
de chaque crit&#232;re linguistique. La normalisation corrige les r&#233;sultats pour tenir compte des taux
d&#8217;erreurs diff&#233;rents. La projection est alors une somme pond&#233;r&#233;e de chaque composante. L&#8217;har-
monisation utilis&#233;e dans notre impl&#233;mentation est [0.5,0.4,1,1] ; elle est calcul&#233;e par rapport &#224; la
valeur maximum d&#8217;un crit&#232;re. Par exemple, la valeur maximum que donne le crit&#232;re des cat&#233;go-
ries9 est 2. L&#8217;harmonisation pour ce crit&#232;re est donc de &#171;1/2&#187;. La pond&#233;ration utilis&#233;e dans notre
impl&#233;mentation est [14,20,5,-5], elle est choisie par rapport &#224; la confiance a priori en chaque
crit&#232;re. On obtient alors les donn&#233;es du tableau 2(seconde partie). Le vecteur de la case (1,2)
devient donc [0.5x14x1, 0.4x20x1, 1x5x0, 1x-5x0] soit une somme de 15.
A la troisi&#232;me &#233;tape chaque valeur est convertie en une probabilit&#233; d&#8217;existence d&#8217;une d&#233;pen-
dance unitaire. Le programme utilise la valeur du score maximum possible du syst&#232;me pour la
totalit&#233; de ces crit&#232;res afin de calculer la confiance dans les associations. On en d&#233;duit la pro-
babilit&#233; d&#8217;existence d&#8217;une d&#233;pendance unitaire. Les valeurs harmonis&#233;es-pond&#233;r&#233;es-extremums
sont donn&#233;es par le vecteur [7,24,5,-5]. La valeur maximum pour les calculs de probabilit&#233;
d&#8217;existence est donc 7x1 + 24x1 + 5x1 + -5x0 = 36.10
</p>
<p>A la quatri&#232;me &#233;tape on utilise une valeur limite choisie &#224; l&#8217;avance &#224; l&#8217;aide d&#8217;un apprentissage
supervis&#233;. Cette valeur permet d&#8217;&#233;liminer les combinaisons &#224; scores trop faibles (dans notre
exemple il s&#8217;agit des scores qui lui sont inf&#233;rieurs). Cette valeur limite est calcul&#233;e &#224; partir des
r&#233;sultats de l&#8217;&#233;tape 3 et des d&#233;pendances encod&#233;es sous la forme &#8217;1 : existe &#8217; et &#8217;0 : existe pas&#8217;
pr&#233;alablement annot&#233;e. Les combinaisons &#8217;2-3&#8217; et &#8217;2-4&#8217; sont oubli&#233;es dans l&#8217;exemple. Dans
notre impl&#233;mentation, les 122 questions situ&#233;es en rang 2 et plus d&#8217;un groupe ont re&#231;u un score
qui a &#233;t&#233; compar&#233; aux 92 d&#233;pendances annot&#233;es (cf 2.2.3). Nous avons alors cr&#233;&#233; une table qui
indique pour chaque score l&#8217;existence ou non d&#8217;une d&#233;pendance. Le syst&#232;me weka (Frank et al.,
2005) nous a permis de d&#233;ployer facilement un outil de classification statistique nous permettant
alors d&#8217;&#233;valuer une valeur limite.
</p>
<p>La cinqui&#232;me &#233;tape consiste &#224; comparer les combinaisons restantes. Si deux combinaisons ont
la m&#234;me question pour origine, celle de plus faible score est &#233;limin&#233;e. Ceci garantit qu&#8217;une
question ne r&#233;utilise le contexte que d&#8217;une seule autre question qui &#233;ventuellement aura construit
</p>
<p>9Les cat&#233;gories sont compar&#233;es sur deux niveaux de similarit&#233;s : &#171;d&#233;finition-personne&#187; &#171;d&#233;finition-autre&#187;
10Les projections dont la valeur est n&#233;gative sont supprim&#233;es, il n&#8217;y a donc pas de probabilit&#233; n&#233;gative.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.2 La construction K&#233;vin S&#233;journ&#233;
</p>
<p>son contexte sur celui d&#8217;une pr&#233;c&#233;dente. Cette &#233;tape est r&#233;alis&#233;e en utilisant le maximum de
chaque ligne. On obtient donc &#8217;1-2&#8217;, &#8217;1-3&#8217; et &#8217;3-4&#8217;.
La sixi&#232;me &#233;tape construit l&#8217;arbre apr&#232;s un tri topologique des d&#233;pendances unitaires. Le tri
topologique donne 2 ordres valides (et donc deux arbres).
</p>
<p>-1-.-. -1-.----.
2 3-. 3-. 2
</p>
<p>4 4
</p>
<p>Le premier est toujours choisi, car il respecte l&#8217;ordre d&#8217;introduction des questions. Pour un
groupe de questions donn&#233;, la structure arbor&#233;e n&#8217;est pas forc&#233;ment unique. Si une question
&#8217;1&#8217; introduit les &#233;l&#233;ments A et B. Si une question &#8217;2&#8217; r&#233;utilise uniquement l&#8217;&#233;l&#233;ment A et que
la question &#8217;3&#8217; r&#233;utilise les &#233;l&#233;ments A et B. Alors, il est possible de rattacher la question &#8217;3&#8217;
soit &#224; la question &#8217;1&#8217; (Strat&#233;gie de la premi&#232;re introduction d&#8217;un &#233;l&#233;ment), soit &#224; la question
&#8217;2&#8217; (Strat&#233;gie de la d&#233;finition la plus r&#233;cente d&#8217;un &#233;l&#233;ment). Si on ne dispose pas de crit&#232;res
s&#233;mantiques/pragmatiques, l&#8217;&#233;l&#233;ment peut &#234;tre d&#233;crit par les m&#234;mes mots, mais correspondre &#224;
des sens diff&#233;rents. &#201;tant donn&#233; le type des questions pos&#233;es il peut &#234;tre int&#233;ressant de privil&#233;gier
la strat&#233;gie de la premi&#232;re introduction, alors que sur un syst&#232;me de dialogue on pr&#233;f&#232;rera peut-
&#234;tre la derni&#232;re afin d&#8217;avoir une repr&#233;sentation plus concise ne demandant pas de m&#233;morisation
des &#233;v&#232;nements anciens.
</p>
<p>On peut alors d&#233;corer l&#8217;arbre avec les &#233;l&#233;ments, contextes, r&#233;ponses et vecteur de scores. Les
&#233;l&#233;ments de texte utiles sont rep&#233;r&#233;s via un m&#233;canisme bas&#233; sur la morpho-syntaxe. Ils sont
constitu&#233;s des noms, adjectifs, nombres et d&#233;terminants les entourant. L&#8217;analyse des questions
de Musclef permet de s&#8217;assurer que les constituants formant le focus (Ferret et al., 2001)11 de
la question sont pr&#233;sents dans les &#233;l&#233;ments reconstruits. De m&#234;me, les entit&#233;s nomm&#233;es sont
arbitrairement ajout&#233;es dans la liste des &#233;l&#233;ments. Chaque &#233;l&#233;ment produit est un sous ensemble
contigu de la question et tous les sous &#233;l&#233;ments contigus sont fusionn&#233;s. Une fois l&#8217;arbre de
d&#233;pendances construit, chaque &#233;l&#233;ment de texte d&#8217;une question est trait&#233; exactement de la m&#234;me
mani&#232;re que dans un SQR normal. On utilise juste une num&#233;rotation des termes des &#233;l&#233;ments
afin de les suivre dans les &#233;tapes de s&#233;lection de mots, traduction... Les termes des &#233;l&#233;ments sont
r&#233;cup&#233;r&#233;s juste avant leur utilisation dans le moteur de recherche. Le vecteur de scores est ajout&#233;
afin de caract&#233;riser le type de d&#233;pendance entre les questions. Les r&#233;ponses aux questions sont
ajout&#233;es ainsi que leur type (type de la r&#233;ponse attendue de la question pr&#233;c&#233;dente).La figure 3
montre cette structure pour le groupe de 4 questions de l&#8217;exemple en tableau 1.
</p>
<p>&#192; l&#8217;aide de cette organisation, on peut concevoir une nouvelle interrogation des documents
tenant compte de l&#8217;origine des &#233;l&#233;ments.
</p>
<p>2.2.3 R&#233;sultats
</p>
<p>Le corpus de questions de la campagne Clef2007 a &#233;t&#233; annot&#233; &#224; la main. Nous avons annot&#233;
un total de 92 d&#233;pendances unitaires 12. Nous avons &#233;valu&#233; notre approche sur ce corpus en
comparant les d&#233;pendances unitaires annot&#233;es &#224; celles trouv&#233;es automatiquement.
</p>
<p>11Le focus d&#8217;une question : une phrase nominale qui a des chances d&#8217;&#234;tre pr&#233;sente dans la r&#233;ponse : Qui est le
ministre ? &#171;Le ministre&#187; est ...
</p>
<p>12Nous pouvons remarquer ici une diff&#233;rence avec l&#8217;&#233;tude r&#233;alis&#233;e par Dominique Laurent et Al.(Laurent et al.,
2007) qui comptent 76 questions disposant d&#8217;un lien anaphorique. Comme mentionn&#233; plus haut nous ne nous
arr&#234;tons pas aux anaphores cor&#233;f&#233;rentes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une structure pour les questions enchain&#233;es 2.2 La construction
</p>
<p>| Groupe 97-100 (Corpus clef 07 FR-EN)
| contexte :
|
&#8216;--. Num&#233;ro : 97
</p>
<p>| Question : O&#249; se trouve la cath&#233;drale Sainte-Sophie en Russie ?
| R&#233;ponse : Novgorod
| #&#233;l&#233;ments r&#233;utilisables : 0
| contexte :
|
&#8216;-. Num&#233;ro : 98
| | Question : Qui &#233;tait son archipr&#234;tre en 1995 ?
| | R&#233;ponse : Nikoai L&#8217;vovich Tserpitskii
| | #&#233;l&#233;ments r&#233;utilisables : 1
| | contexte : &#171;la cath&#233;drale Sainte-Sophie en Russie&#187;
| | scores : [7,8,0,0]
|
&#8216;-. Num&#233;ro : 99
| Question : Quel &#233;cossais a construit la cath&#233;drale ?
| R&#233;ponse : Vladimir of Novgorod
| #&#233;l&#233;ments r&#233;utilisables : 1
| contexte : &#171;sainte-Sophie en Russie&#187;
| scores : [7,8,0,0]
|
&#8216;-. Num&#233;ro : 100
| Question : Quelle imp&#233;ratrice l&#8217;a accr&#233;dit&#233; pour la construire ?
| R&#233;ponse : nil
| #&#233;l&#233;ments r&#233;utilisables : 2
| contexte : &#171;&#233;cossais&#187; &#171;R&#233;ponse(99)&#187;
| &#171;la cath&#233;drale sainte-Sophie en Russie&#187;
| scores : [0,16,0,0]
</p>
<p>FIG. 3 &#8211; La structure d&#8217;arbre pour un groupe de questions encha&#238;n&#233;es.
</p>
<p>R&#233;sultat/Crit&#232;re cat&#233;gories r&#233;f&#233;rents tailles entit&#233;s r&#233;f..+tailles cat..+tailles cat..+r&#233;f Les 4 ensemble
Rappel 0.63 0.66 0.73 0.15 0.65 0.631 0.614 0.65
</p>
<p>Pr&#233;cision 0.68 0.70 0.15 0.04 0.728 0.706 0.814 0.80
F-Mesure 0.65 0.684 0.25 0.06 0.687 0.67 0.70 0.72
</p>
<p>TAB. 3 &#8211; Les performances de d&#233;couverte automatique de d&#233;pendances unitaires.
</p>
<p>Les 4 crit&#232;res utilis&#233;s simultan&#233;ment permettent une d&#233;tection des d&#233;pendances unitaires dont
les performances sont r&#233;capitul&#233;es dans le tableau 3, pour la d&#233;tection des 92 d&#233;pendances du
corpus. Des &#233;tudes individuelles de chaque crit&#232;re montrent qu&#8217;ils am&#233;liorent tous les r&#233;sultats.
Les deux plus efficaces sont la d&#233;tection des anaphores et les diff&#233;rences de cat&#233;gories. Cepen-
dant, les 2 autres crit&#232;res peuvent &#234;tre affin&#233;s et d&#8217;autres pourraient &#234;tre envisag&#233;s, incluant des
&#233;l&#233;ments syntaxiques et/ou s&#233;mantiques.
</p>
<p>En premi&#232;re approche pour l&#8217;utilisation des informations calcul&#233;es pr&#233;c&#233;demment, nous avons
ajout&#233; les termes du contexte &#224; la liste des termes des questions ayant des d&#233;pendances, sans
contr&#244;ler un seul des probl&#232;mes qui motive la construction de la structure. Nous avons pu ob-
server que dans 48 cas nous obtenons des phrases candidates l&#224; o&#249; sans la m&#233;thode de s&#233;lection
nous n&#8217;en obtenons aucune. Nous pouvons aussi observer que le d&#233;ploiement de la m&#233;thode
propos&#233;e est robuste &#224; la traduction des termes dans les syst&#232;mes inter-lingue. Ceci nous incite
&#224; penser que nos r&#233;sultats de s&#233;lection des d&#233;pendances sont tr&#232;s corrects.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>K&#233;vin S&#233;journ&#233;
</p>
<p>3 Conclusion
</p>
<p>Notre travail permet d&#8217;&#233;tablir des d&#233;pendances entre questions. Dans le cas g&#233;n&#233;ral, ces d&#233;pen-
dances sont probl&#233;matiques. Nous obtenons donc ainsi des r&#233;sultats encourageants qui montrent
des progr&#232;s dans l&#8217;organisation des d&#233;pendances liant les &#233;l&#233;ments pour l&#8217;interrogation. La pro-
chaine &#233;tape de ce travail consiste &#224; modifier l&#8217;interrogation des documents afin d&#8217;utiliser au
mieux cette structure d&#8217;arbre, dans le but d&#8217;am&#233;liorer les r&#233;sultats du SQR sur des questions
enchain&#233;es.
</p>
<p>Des &#233;volutions sont possibles : on pourrait prolonger cette structure jusque dans le syst&#232;me de
s&#233;lection des r&#233;ponses du SQR. Il serait alors int&#233;ressant d&#8217;&#233;tudier comment la s&#233;lection des
r&#233;ponses (et l&#8217;analyse des questions) pourrait s&#8217;appuyer sur cette structure, et comment fournir
des &#233;l&#233;ments visant &#224; faciliter la recherche de la r&#233;ponse de la question suivante gr&#226;ce &#224; cela.
</p>
<p>R&#233;f&#233;rences
BUSCALDI D., ANND PAOLO ROSSO Y. B. &amp; SANCHIS E. (2007). The upv at qa@clef 2007.
Universidad Politcnica de Valencia.
CHIORI H., TAKAAKI H., HIDEAKI I., EISAKU M. &amp; ANDFURUI SADAOKI K. S. (2003-4).
Study on spoken interactive open domain question answering. Spontaneous Speech Processing
and Recognition (SSPR), p. 111&#8211;114.
FERRET O., GRAU B., HURAULT-PLANTET M., MONCEAUX L., ROBBA I. &amp; VILNAT A.
(2001). Finding an answer based on the recognition of the question focus. Text retrieval
conference, TREC 10.
FRANK E., HALL M. A., HOLMES G., KIRKBY R., PFAHRINGER B., WITTEN I. H. &amp;
TRIGG L. (2005). Weka - a machine learning workbench for data mining. In O. MAIMON
&amp; L. ROKACH, Eds., The Data Mining and Knowledge Discovery Handbook, p. 1305&#8211;1314.
Springer.
HERNANDEZ N. (2004). Description et d&#233;tection automatique de structures de
texte. PhD thesis, University de Paris-Sud XI LIMSI/CNRS. http :// www.limsi.fr
/Individu/hernandz/research/Hernandez-these.tar.gz.
HICKL A., WILLIAMS J., BENSLEY J., ROBERTS K., SHI Y. &amp; RINK B. (2006). Question
answering with lcc&#8217;s chaucer at trec 2006. 15th Text REtrieval Conference, Gaithersburg, p.&#732;1.
LAURENT D., S&#201;GU&#201;LA P. &amp; N&#200;GRE S. (2007). Cross lingual question answering using
qristal for clef 2007. Synapse D&#233;veloppement.
LIGOZAT A.-L. (2006). Exploitation et fusion de connaissances locales pour la recherche
d&#8217;informations pr&#233;cises. PhD thesis, Universit&#233; de Paris-Sud XI LIMSI/CNRS. .
PENAS A., FORNER P. &amp; GIAMPICCOLO D. (2007). Guidelines for participants in qa at clef
2007. CELCT, Trento(IT) and UNED, Madrid, p.&#732;1.
VILNAT A. (2005). Habilitation &#224; diriger les recherches : Dialogue et analyse de
phrases. PhD thesis, University de Paris-Sud XI LIMSI/CNRS. http :// www.limsi.fr /In-
dividu/anne/HDR/MemoireHDR.pdf.
ZHOU Y., YUAN X., CAO J., HUANG X. &amp; WU L. (2006). Fduqa on trec2006 qa track. 15th
Text REtrieval Conference, Gaithersburg, p. 1026&#8211;1033.</p>

</div></div>
</body></html>