<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>M&#233;thode de r&#233;ordonnancement de r&#233;ponses par transformation d&#8217;arbres : pr&#233;sentation et analyse des r&#233;sultats</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>M&#233;thode de r&#233;ordonnancement de r&#233;ponses par
transformation d&#8217;arbres : pr&#233;sentation et analyse des
</p>
<p>r&#233;sultats
</p>
<p>Guillaume Bernard1
(1) LIMSI - CNRS, B.P. 133, 91403 ORSAY, France
</p>
<p>gbernard@limsi.fr
</p>
<p>R&#233;sum&#233;. Dans cet article nous pr&#233;sentons une &#233;valuation et une analyse des r&#233;sultats d&#8217;une
m&#233;thode de r&#233;ordonnancement de r&#233;ponses pour un syst&#232;me de questions-r&#233;ponses. Cette m&#233;-
thode propose une s&#233;lection des r&#233;ponses candidates &#224; une question en calculant un co&#251;t par
transformation d&#8217;arbres. Nous pr&#233;sentons une analyse des r&#233;sultats obtenus sur le corpus Clef
2004-2005 et nos conclusions sur les voies d&#8217;am&#233;lioration possibles pour notre syst&#232;me.
</p>
<p>Abstract. This paper describes an evaluation and an analysis of the results of an answers
reranking method for a question-answering system. Candidate answers to a question are reor-
dered by computing a tree transform cost. We discuss the results of our evaluation on the Clef
2004-2005 corpus and describe possible improvements to the system.
</p>
<p>Mots-cl&#233;s : Recherche d&#8217;information, Traitement Automatique des Langues, syst&#232;mes
de questions-r&#233;ponses.
</p>
<p>Keywords: Information Retrieval, Natural Language Processing, Question-Answering
systems.
</p>
<p>1 Introduction
Il est fr&#233;quent que l&#8217;information recherch&#233;e pour r&#233;pondre &#224; une question soit exprim&#233;e en des
termes diff&#233;rents de ceux de la question. Les techniques de recherche d&#8217;information tradition-
nelles sont ainsi souvent p&#233;nalis&#233;es lorsqu&#8217;il s&#8217;agit de d&#233;tecter les variations linguistiques telles
que la paraphrase (Ligozat, 2006). Notre objectif est de r&#233;pondre &#224; cette probl&#233;matique en pro-
posant une m&#233;thode de r&#233;ordonnancement des r&#233;ponses candidates &#224; une question en utilisant
des arbres repr&#233;sentant la question et un texte contenant potentiellement la bonne r&#233;ponse (Ber-
nard, 2008). Un co&#251;t de transformation est calcul&#233; entre ces deux arbres. D&#8217;autre m&#233;thodes
se sont d&#233;j&#224; appuy&#233;es sur des repr&#233;sentations des textes sous forme d&#8217;arbres pour identifier
la r&#233;ponse &#224; une question (par exemple (Ligozat, 2005)), qui se basent sur la structure et les
d&#233;pendances d&#8217;arbres syntaxiques.
</p>
<p>L&#8217;objectif de cet article est de pr&#233;senter une analyse de cette m&#233;thode. Nous pr&#233;sentons le
contexte d&#8217;application de notre approche, le syst&#232;me Ritel, puis nous d&#233;crivons bri&#232;vement
le fonctionnement de notre m&#233;thode. En nous appuyant sur les r&#233;sultats obtenus lors d&#8217;une &#233;va-
luation pr&#233;c&#233;dente, nous proposons une analyse de notre m&#233;thode et les conclusions que nous
en avons tir&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Bernard
</p>
<p>2 Ritel, un syst&#232;me de questions-r&#233;ponses oral et interactif
</p>
<p>Le projet Ritel (Rosset et al., 2006) du LIMSI sert de contexte pour notre travail. L&#8217;un des objec-
tifs de Ritel est de r&#233;unir les fonctionnalit&#233;s d&#8217;un syst&#232;me de questions-r&#233;ponses et d&#8217;un syst&#232;me
de dialogue oral. Dans cet article nous nous concentrons sur le composant questions-r&#233;ponses
de Ritel. Deux modules du syst&#232;me sont directement li&#233;s &#224; notre travail : le module d&#8217;analyse
des documents et des questions, qui transforme les textes de notre corpus et les requ&#234;tes de
l&#8217;utilisateur en arbres textuels, et le module de recherche d&#8217;information.
</p>
<p>FIG. 1 &#8211; Exemple d&#8217;arbre construit pour &#171;Nommer un ministre russe de l&#8217;&#233;nergie atomique.&#187;
</p>
<p>L&#8217;analyse produite par Ritel est non contextuelle (Villaneau et al., 2007). Concr&#232;tement, nous
n&#8217;utilisons aucune information sur le dialogue pour typer nos textes, et chaque phrase des docu-
ments est trait&#233;e s&#233;parement. Le but est de typer les mots ou groupes de mots en proc&#233;dant &#224; des
regroupements selon le sens de ces mots. Les types des n&#339;uds peuvent appartenir &#224; diff&#233;rentes
cat&#233;gories : entit&#233;s nomm&#233;es (une personne, un lieu, etc.), entit&#233;s grammaticales (des verbes,
des pr&#233;positions), ou entit&#233;s sp&#233;cifiques (par exemple des couleurs, comme &#8220;rouge&#8221;). Plus g&#233;n&#233;-
ralement, les informations contenues dans les n&#339;uds de nos arbres sont plus d&#8217;ordre s&#233;mantique
que syntaxique. L&#8217;analyse est faite de fa&#231;on hi&#233;rarchique : un groupe de mots sera d&#233;compos&#233;
en plusieurs sous-n&#339;uds typ&#233;s, et l&#8217;ensemble de ces sous-n&#339;uds sera typ&#233; par un n&#339;ud global.
La structure des arbres textuels r&#233;sultant de l&#8217;analyse est plut&#244;t &#233;tendue (plus large que pro-
fonde). Les arbres ont en moyenne 3 &#224; 4 niveaux de profondeur. Nous donnons dans la figure 1
un exemple de l&#8217;arbre textuel. On peut voir que les informations contenues dans les n&#339;uds sont
s&#233;mantiques (pers_fonct) et syntaxiques (prep). Les n&#339;uds sont cependant plus souvent typ&#233;s
s&#233;mantiquement que syntaxiquement. Par ailleurs, le d&#233;coupage d&#8217;un n&#339;ud en sous-n&#339;ud est
bas&#233; sur des structures s&#233;mantiques.
</p>
<p>Le syst&#232;me RI/QA (Rosset et al., 2007) de Ritel est compos&#233; de trois modules : la s&#233;lection des
documents int&#233;ressants, la s&#233;lection des passages de texte contenant potentiellement la r&#233;ponse
&#224; la question trait&#233;e, et la s&#233;lection des r&#233;ponses candidates. Au d&#233;but de la recherche, la ques-
tion est analys&#233;e pour d&#233;terminer le type de r&#233;ponse attendu et le syst&#232;me g&#233;n&#232;re un Descripteur
De Recherche (DDR) qui permet de guider la recherche de la r&#233;ponse. Les DDRs repr&#233;sentent
les &#233;l&#233;ments critiques et secondaires de la question ainsi que le type attendu de r&#233;ponse. Les &#233;l&#233;-
ments critiques correspondent aux n&#339;uds importants de la question, et les &#233;l&#233;ments secondaires
aux n&#339;uds dont la pr&#233;sence est plus optionnelle. Dans la figure 1, les &#233;l&#233;ments critiques seraient
&#8220;ministre russe&#8221; et &#8220;atomique&#8221;, et &#8220;&#233;nergie&#8221; serait un &#233;l&#233;ment secondaire. Chacune de ces trois
&#233;tapes utilise les informations fournies par le DDR. Le premier module calcule un score pour
chaque document selon les diff&#233;rentes entit&#233;s du DDR et retourne une liste de documents. Le
syst&#232;me s&#233;lectionne alors les passages des documents pouvant contenir la r&#233;ponse et retourne</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse des r&#233;sultats d&#8217;une m&#233;thode de r&#233;ordonnancement de r&#233;ponses
</p>
<p>une liste de passages ordonn&#233;e. Enfin, &#224; partir de cette liste de passages, le syst&#232;me retourne une
liste de r&#233;ponses courtes extraites de ces passages. Les r&#233;ponses sont ordonn&#233;es selon un score.
</p>
<p>Pour qu&#8217;un extrait de texte soit identifi&#233; comme pouvant contenir la r&#233;ponse &#224; la question, il
doit contenir les &#233;l&#233;ments critiques du DDR. S&#8217;il contient les &#233;l&#233;ments secondaires, le score
global du passage sera plus &#233;lev&#233;. Cette m&#233;thode est comparable &#224; une approche par sacs de
mots typ&#233;s et transformables. Les scores calcul&#233;s par le syst&#232;me sont proches des scores de
compacit&#233;s (Gillard et al., 2007). Une des limitations des DDRs est qu&#8217;ils ne conservent pas
toutes les informations. Ainsi, les &#233;l&#233;ments critiques et secondaires sont conserv&#233;s, mais pas
les pr&#233;positions par exemple. Cependant, le probl&#232;me principal des DDRs reste la perte de la
structure de la question : les mots sont class&#233;s par importance (critique ou secondaire) et il
n&#8217;y a pas de gestion du contexte de chaque mot ou de relation avec les autres &#233;l&#233;ments. Dans
l&#8217;exemple suivant, les r&#233;ponses &#233;valu&#233;es sont &quot;2005&quot; et &quot;1992&quot;.
Question : En quelle ann&#233;e l&#8217;ouragan Andrew s&#8217;est-il manifest&#233; ?
Texte : Avec Katrina en 2005 l&#8217;ouragan Andrew, qui a frapp&#233; la Floride en 1992, a &#233;t&#233; l&#8217;un des cyclones les plus
destructeurs.
</p>
<p>Le syst&#232;me actuel pourrait donner &quot;2005&quot; comme bonne r&#233;ponse car elle est proche de l&#8217;&#233;l&#233;-
ment critique &quot;ouragan Andrew&quot; et que &quot;2005&quot; est fr&#233;quent dans les diff&#233;rents documents du
corpus. Or, avec une gestion des relations entre les diff&#233;rents &#233;l&#233;ments du texte, on peut d&#233;duire
que le pronom interrogatif &quot;qui&quot; est li&#233; &#224; &quot;ouragan Andrew&quot; et que la bonne r&#233;ponse est 1992.
Notre objectif est de proposer une m&#233;thode pouvant r&#233;pondre &#224; ces probl&#232;mes. Notre m&#233;thode
intervient en sortie du syst&#232;me RI/QR. Nous r&#233;cup&#233;rons en entr&#233;e la question pos&#233;e par l&#8217;utili-
sateur sous la forme d&#8217;un arbre typ&#233;, la liste des r&#233;ponses candidates ordonn&#233;e selon un score et
la liste des passages du texte d&#8217;o&#249; les r&#233;ponses ont &#233;t&#233; extraites.
</p>
<p>3 R&#233;ordonnancement des r&#233;ponses candidates
Plusieurs syst&#232;mes de questions-r&#233;ponses utilisent des approches &#224; base d&#8217;arbres syntaxiques
pour r&#233;pondre aux questions. Les documents et les questions pos&#233;es par l&#8217;utilisateur sont ainsi
transform&#233;s en arbres structur&#233;s. Les n&#339;uds des arbres peuvent &#234;tre enrichis avec des infor-
mations s&#233;mantiques, voire des relations s&#233;mantiques avec d&#8217;autres n&#339;uds de l&#8217;arbre. Ces m&#233;-
thodes ont l&#8217;avantage de faciliter la comparaison entre un texte et une question et de rep&#233;rer
les mots ou groupes de mots en relation dans les deux arbres. On parle g&#233;n&#233;ralement de points
d&#8217;ancrage. Par ailleurs, ce type d&#8217;approche a l&#8217;avantage de faciliter la manipulation des textes,
par le biais de la manipulation des n&#339;uds des arbres (Magnini &amp; Kouylekov, 2006). Ces m&#233;-
thodes sont de ce fait adapt&#233;es pour g&#233;n&#233;rer des paraphrases (Braz et al., 2005). Notre m&#233;thode
est bas&#233;e sur le calcul du co&#251;t d&#8217;une transformation entre l&#8217;arbre de la question et l&#8217;arbre du pas-
sage contenant la r&#233;ponse. Nous comparons les deux arbres pour trouver la suite d&#8217;op&#233;rations
permettant de transformer l&#8217;arbre du texte en l&#8217;arbre de la question avec le plus faible co&#251;t. Les
extraits des documents &#233;tant souvent tr&#232;s longs, nous avons d&#233;cid&#233; d&#8217;extraire le segment conte-
nant la r&#233;ponse candidate. Pour le moment, nous nous servons de la ponctuation pour d&#233;limiter
ce segment. Nous proc&#233;dons &#233;galement &#224; des modifications sur l&#8217;arbre de la question. Pour
chaque r&#233;ponse avec le score le plus fort, le passage du texte d&#8217;o&#249; elle a &#233;t&#233; extraite est connu.
On supprime alors de l&#8217;arbre de la question les n&#339;uds correspondant aux pronoms interrogatifs
(&#171;qui&#187;, &#171;comment&#187;, etc.) et on ajoute un n&#339;ud avec la r&#233;ponse &#224; &#233;valuer.
Des op&#233;rateurs de manipulation d&#8217;arbres sont utilis&#233;s. Cette approche est similaire &#224; celle pr&#233;-
sent&#233;e par (Magnini &amp; Kouylekov, 2006), avec deux diff&#233;rences fondamentales, concernant les
op&#233;rateurs de transformation et les fonctions de co&#251;t associ&#233;es aux op&#233;rateurs. Nous utilisons</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Bernard
</p>
<p>quatre op&#233;rateurs de transformation : suppression d&#8217;un n&#339;ud, insertion d&#8217;un n&#339;ud et substitu-
tion d&#8217;un n&#339;ud par un autre, d&#233;j&#224; utilis&#233;s par Magnini et Kouylekov, auxquels nous ajoutons
l&#8217;op&#233;rateur de d&#233;placement, notre objectif &#233;tant de couvrir davantage de ph&#233;nom&#232;nes linguis-
tiques. Le passage d&#8217;une phrase en forme active &#224; la forme passive peut &#234;tre mieux couvert
par l&#8217;op&#233;rateur de d&#233;placement. Nous d&#233;terminons les &#233;l&#233;ments &#224; supprimer en identifiant les
relations entre les n&#339;uds du texte et de la question : &#233;quivalence pour des n&#339;uds identiques,
&#233;quivalence de lemmes si la forme lemmatis&#233;e des deux n&#339;uds est identique et de synonymie1.
A chacun des op&#233;rateurs de transformation est associ&#233;e une fonction de co&#251;t. Magnini et Kouy-
lekov utilisent des arbres syntaxiques pour repr&#233;senter leurs textes, qui ont la caract&#233;ristique
d&#8217;&#234;tre tr&#232;s structur&#233;s. Leurs fonctions de co&#251;t sont bas&#233;es sur cette structure. Les arbres ty-
p&#233;s retourn&#233;s par l&#8217;analyseur de Ritel sont moins profonds et fournissent des informations plus
s&#233;mantiques que syntaxiques.
</p>
<p>Nous avons choisi d&#8217;avoir une approche bas&#233;e sur le contexte global de nos arbres. Nous vou-
lons tenir compte de l&#8217;ensemble du sens de la phrase lors de l&#8217;application d&#8217;une op&#233;ration. Notre
objectif est d&#8217;avoir un co&#251;t d&#233;pendant du contexte et du changement linguistique impliqu&#233; par
l&#8217;op&#233;ration. Dans l&#8217;exemple suivant, il serait co&#251;teux de supprimer &quot;vice&quot; car cela change com-
pl&#232;tement le sens de l&#8217;extrait du texte :
Question : Nommer un ministre russe de l&#8217;&#233;nergie atomique.
Texte : et aux r&#232;gles de non-prolif&#233;ration des armes nucl&#233;aires, a d&#233;clar&#233; le vice-ministre de l&#8217;&#233;nergie atomique
Viktor Mikhailov.
</p>
<p>Les fonctions de co&#251;t sont pour le moment assez simples. Le contexte d&#8217;une op&#233;ration est re-
pr&#233;sent&#233; par le type des n&#339;uds voisins gauche et droite. La structure g&#233;n&#233;rale de nos fonctions
est identique : une suite de conditions portant sur le type du n&#339;ud sur lequel est appliqu&#233; l&#8217;op&#233;-
rateur, le co&#251;t de chaque branche &#233;tant d&#233;termin&#233; par le contexte du n&#339;ud.
</p>
<p>FIG. 2 &#8211; Points d&#8217;ancrage entre les arbres de la question et le texte - Points d&#8217;ancrage 1, 2, 4, 5
et 6, n&#339;uds identiques - Points d&#8217;ancrage 3 et 7, relation de synonymie
</p>
<p>La figure 2 illustre le fonctionnement de notre approche. Dans un souci de lisibilit&#233;, les arbres
sont repr&#233;sent&#233;s dans une forme simplifi&#233;e (pas de sous-n&#339;uds et de n&#339;ud racine). Dans le
contexte de l&#8217;exemple, on compare le texte Le corps du gourou de la secte Luc Jouret a &#233;t&#233;
retrouv&#233; au Canada avec la question O&#249; le cadavre de Luc Jouret a t&#8217;il &#233;t&#233; identifi&#233; ?. La r&#233;ponse
&#224; &#233;valuer est &quot;Canada&quot;, que l&#8217;on a ins&#233;r&#233;e &#224; la place de &quot;O&#249;&quot;, qui est un pronom locatif. Les
</p>
<p>1On dispose d&#8217;un dictionnaire de synonymes de 15 000 entr&#233;es qui est une ressource interne au LIMSI. A
chaque entr&#233;e sont associ&#233;s ses synonymes tri&#233;s selon leur sens g&#233;n&#233;ral. La synonymie est d&#233;tect&#233;e en comparant
les synonymes d&#8217;un n&#339;ud avec les synonymes de l&#8217;autre n&#339;ud.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse des r&#233;sultats d&#8217;une m&#233;thode de r&#233;ordonnancement de r&#233;ponses
</p>
<p>points num&#233;rot&#233;s sur la figure 2 repr&#233;sentent les points d&#8217;ancrage entre les deux arbres. Ainsi,
les points 1, 2, 4, 5 et 6 sont des relations de n&#339;uds identiques, tandis que les points 3 et 7
sont des relations de synonymie. &#192; partir de ces points d&#8217;ancrage, notre syst&#232;me peut calculer
les suites d&#8217;op&#233;rations pour transformer l&#8217;arbre du texte en l&#8217;arbre de la question. Les fonctions
de co&#251;t associ&#233;es &#224; chaque op&#233;rateur permettent de d&#233;terminer la suite d&#8217;op&#233;rations la moins
co&#251;teuse. Dans le cas pr&#233;sent, une suite d&#8217;op&#233;ration possible est :
</p>
<p>1) Suppression des n&#339;uds du, gourou de la secte et au.
2) D&#233;placement de Canada avant le n&#339;ud le.
3) Substitution synonymique du n&#339;ud corps par le n&#339;ud cadavre.
4) Substitution synonymique du n&#339;ud retrouv&#233; par identifi&#233;.
5) Insertion du n&#339;ud de avant le n&#339;ud Luc Jouret et du n&#339;ud t&#8217;il avant le n&#339;ud &#233;t&#233;.
</p>
<p>4 &#201;valuation du syst&#232;me
4.1 Cadre exp&#233;rimental
</p>
<p>M&#233;thode propos&#233;e Syst&#232;me Ritel
Type de la r&#233;ponse #questions Acc MRR Acc MRR Rappel
</p>
<p>raison 15 21.4% 0.24 21.4% 0.27 50.0%
couleur 1 0.0% 0.33 0.0% 0.33 100.0%
</p>
<p>lieu 57 29.1% 0.4 54.5% 0.60 72.7%
nombre 42 24.8% 0.35 50.0% 0.57 72.5%
</p>
<p>organisation 31 18.4% 0.27 47.4% 0.51 60.5%
personne 62 25.8% 0.35 36.4% 0.42 63.6%
</p>
<p>d&#233;finition d&#8217;une organisation 30 30.0% 0.44 46.7% 0.6 86.7%
d&#233;finition d&#8217;une personne 41 17.6% 0.32 47.1% 0.55 73.5%
</p>
<p>inconnu 49 17.1% 0.22 26.8% 0.31 53.7%
date 50 37.1% 0.40 47.9% 0.57 72.9%
</p>
<p>divers 16 0.0% 0.15 18.7% 0.25 50.0%
total 395 24.0% 0.34 41.5% 0.48 65.8%
</p>
<p>TAB. 1 &#8211; R&#233;sultats de l&#8217;&#233;valuation selon la cat&#233;gorie de la question
</p>
<p>Nous avons &#233;valu&#233; notre m&#233;thode sur les corpus de questions et de documents des campagnes
Clef 2004 et Clef 2005 (395 questions au total). Trois mesures ont &#233;t&#233; utilis&#233;es pour &#233;valuer
notre approche : l&#8217;Accuracy, le MRR et le Rappel. L&#8217;Accuracy correspond au pourcentage de
questions o&#249; la r&#233;ponse retourn&#233;e en premi&#232;re position est la bonne r&#233;ponse. Le MRR (Mean
Reciprocal Rank) permet d&#8217;&#233;valuer la position moyenne des bonnes r&#233;ponses. Il est calcul&#233; en
faisant la moyenne des rangs r&#233;ciproques de chaque question, ce dernier &#233;tant obtenu en calcu-
lant l&#8217;inverse du rang de la bonne r&#233;ponse &#224; la question. Par exemple, si la bonne r&#233;ponse &#224; une
question est au rang 4, son rang r&#233;ciproque est de 1/4. Le Rappel correspond au pourcentage
de questions dont la liste des r&#233;ponses retourn&#233;es contient la bonne r&#233;ponse. Pour cette &#233;va-
luation nous avons fix&#233; le nombre maximum de r&#233;ponses retourn&#233;es &#224; 10. Nous s&#233;parons nos
r&#233;sultats selon le type de la r&#233;ponse attendue &#224; une question. Cette classification est d&#233;termin&#233;e
automatiquement lors de la g&#233;n&#233;ration du DDR. Nous pr&#233;sentons ces r&#233;sultats dans le tableau
1.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Bernard
</p>
<p>Nous avons fait une deuxi&#232;me &#233;valuation de notre approche, que nous ne pr&#233;sentons pas ici, o&#249;
le nombre maximum de r&#233;ponses retourn&#233;es a &#233;t&#233; fix&#233; &#224; 50 : l&#8217;Accuracy moyenne r&#233;gresse. On
peut en d&#233;duire que le trop grand nombre de r&#233;ponses candidates perturbe notre approche. Une
&#233;valuation a &#233;t&#233; r&#233;alis&#233;e sur la m&#233;thode pr&#233;sent&#233;e pr&#233;c&#233;demment de Magnini et Kouylekov &#224;
Clef 2005 (Tanez et al., 2005). Le syst&#232;me pr&#233;sent&#233; a &#233;t&#233; test&#233; sur des t&#226;ches monolingues pour
l&#8217;italien et le bulgare. Dans le cas de l&#8217;italien, deux &#233;valuations ont &#233;t&#233; faites pour tester diff&#233;-
rents param&#232;tres. Avec cette approche, ils obtiennent en t&#226;che monolingue sur le bulgare une
Accuracy de 27.5%, le meilleur syst&#232;me ayant obtenu 32.03% 2. Nous comptons faire prochai-
nement une adaptation de notre syst&#232;me pour le faire fonctionner sur la t&#226;che RTE &#224; laquelle
Magnini et Kouylekov ont particip&#233;. Leurs r&#233;sultats se situaient dans la moyenne g&#233;n&#233;rale. Nous
pourrons ainsi comparer notre approche qui est bas&#233;e sur une analyse s&#233;mantique.
</p>
<p>4.2 Analyse de l&#8217;&#233;valuation
Le tableau 1 montre que notre m&#233;thode d&#233;grade les r&#233;sultats obtenus par Ritel quelle que soit
la cat&#233;gorie de questions, avec une baisse moyenne de 17%. L&#8217;origine de ces r&#233;sultats peut &#234;tre
expliqu&#233;e par l&#8217;&#233;tat &#233;l&#233;mentaire des fonctions de co&#251;t associ&#233;es aux op&#233;rateurs. Les principaux
d&#233;fauts sont le manque de pr&#233;cision du calcul du co&#251;t linguistique de chaque op&#233;ration et la
mauvaise gestion du contexte d&#8217;application d&#8217;une op&#233;ration qui est limit&#233;e aux n&#339;uds voisins
et non &#224; l&#8217;ensemble de l&#8217;arbre. L&#8217;analyse que nous avons conduit porte sur l&#8217;origine des r&#233;sultats
obtenus par notre approche. Certaines cat&#233;gories semblent mieux adapt&#233;es &#224; notre approche, o&#249;
l&#8217;on peut noter une baisse des r&#233;sultats moindres : &quot;personne&quot; et &quot;date&quot; (baisse d&#8217;environ 10%)3.
</p>
<p>5 &#201;tude du corpus de questions et des r&#233;sultats obtenus
Apr&#232;s avoir analys&#233; les r&#233;sultats obtenus par notre syst&#232;me lors de l&#8217;&#233;valuation, et &#233;mis un
certain nombre d&#8217;hypoth&#232;ses sur les origines des scores obtenus (Bernard, 2008), nous avons
d&#233;cid&#233; de proc&#233;der &#224; une &#233;tude approfondie des r&#233;sultats obtenus. Nous nous sommes concen-
tr&#233;s sur les cat&#233;gories de question qui nous semblaient les plus pertinentes, et pour chacune des
questions, nous avons analys&#233; les causes du r&#233;ordonnancement produit par notre m&#233;thode. Nous
en avons d&#233;duit des voies d&#8217;am&#233;lioration pour notre approche.
</p>
<p>5.1 Corpus &#233;tudi&#233;
Nous nous sommes concentr&#233;s sur les cat&#233;gories les plus importantes en nombre de questions :
&quot;date&quot;, &quot;nombre&quot;, &quot;personne&quot; et &quot;lieu&quot;. De plus, ces cat&#233;gories semblent appropri&#233;es &#224; notre
approche, car elles semblent &#234;tre plus sujettes &#224; des probl&#232;mes de proximit&#233; syntaxique. La
cat&#233;gorie des organisations n&#8217;a pas &#233;t&#233; &#233;tudi&#233;e car la version de l&#8217;analyseur disponible pour
cette &#233;tude ne d&#233;tectait pas leurs fronti&#232;res de mani&#232;re fiable. On arrive donc &#224; un ensemble de
questions &#233;tudi&#233;es de 211 pour &quot;date&quot;, &quot;nombre&quot;, &quot;personne&quot; et &quot;lieu&quot;. Sur ces 211 questions,
59 ont &#233;t&#233; mises de c&#244;t&#233; car la bonne r&#233;ponse n&#8217;est pas contenue dans la liste des r&#233;ponses
candidates, ce qui porte le nombre de questions &#233;tudi&#233;es &#224; 152.
</p>
<p>5.2 M&#233;thodologie
Nous avons travaill&#233; par cat&#233;gorie de question pour essayer de d&#233;terminer les ph&#233;nom&#232;nes
propres &#224; certaines classes de questions et les ph&#233;nom&#232;nes plus g&#233;n&#233;raux. Pour chaque question,
nous avions la liste des r&#233;ponses ordonn&#233;es par Ritel et la liste des r&#233;ponses r&#233;ordonnanc&#233;es par
</p>
<p>2Nous ne pouvons pas comparer directement avec Ritel, qui obtient 38% en tache monolingue sur le fran&#231;ais
uniquement sur Clef 2005. Notre approche obtient une Accuracy de 17%.
</p>
<p>3Les r&#233;sultats sont diff&#233;rents de ceux pr&#233;sent&#233;s dans (Bernard, 2008) car entre-temps le syst&#232;me Ritel a &#233;volu&#233;.
Nous n&#8217;avons pas encore pris en compte cette &#233;volution.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse des r&#233;sultats d&#8217;une m&#233;thode de r&#233;ordonnancement de r&#233;ponses
</p>
<p>notre approche. &#192; partir des passages de texte d&#8217;o&#249; &#233;taient extraites les r&#233;ponses, nous pou-
vions alors d&#233;terminer les causes de nos r&#233;sultats, aussi bien pour un r&#233;ordonnancement positif
que n&#233;gatif. Nous avions aussi comme informations les suites d&#8217;op&#233;rations utilis&#233;es lors des
transformations des arbres pour r&#233;ordonner les r&#233;ponses.
</p>
<p>Plus g&#233;n&#233;ralement, nous avons analys&#233; les points suivants pour chacune des questions :
&#8211; Identification des correspondances entre la question et la phrase contenant la r&#233;ponse :
</p>
<p>&#8211; recherche des &#233;quivalences entre un groupe de mots et un autre ;
&#8211; identification de la pertinence d&#8217;une synonymie (selon le contexte d&#8217;une phrase, deux mots
</p>
<p>ne sont pas forc&#233;ment synonymes) ;
&#8211; identification des regroupements entre mots pouvant apporter de l&#8217;information ;
</p>
<p>&#8211; Impl&#233;mentation de m&#233;canismes sp&#233;cifiques selon le type de la question ;
&#8211; Informations perdues lors de l&#8217;extraction de la phrase contenant la r&#233;ponse :
</p>
<p>&#8211; pertinence de l&#8217;information perdue ;
&#8211; proximit&#233; de l&#8217;information par rapport &#224; la phrase contenant la r&#233;ponse que l&#8217;on a extraite ;
&#8211; pr&#233;sence d&#8217;anaphores ;
&#8211; apport du contexte global du document d&#8217;o&#249; a &#233;t&#233; extraite la phrase pour les transforma-
</p>
<p>tions d&#8217;arbre.
</p>
<p>5.3 R&#233;sultats de l&#8217;analyse
5.3.1 Probl&#232;mes li&#233;s aux sous-n&#339;uds
Lorsque nous avons commenc&#233; &#224; concevoir notre m&#233;thode, l&#8217;analyseur de Ritel produisait des
arbres tr&#232;s peu profonds. D&#233;sormais, il y a une meilleure d&#233;finition des types et de leur hi&#233;-
rarchie, et nous avons en moyenne une profondeur de 4 niveaux. Notre m&#233;thode n&#8217;est pour
le moment pas adapt&#233;e pour traiter ce type d&#8217;arbres. L&#8217;un de nos probl&#232;mes est la non-prise
en compte des relations d&#8217;&#233;quivalences et de synonymies entre les sous-n&#339;uds des arbres : un
n&#339;ud du texte peut tr&#232;s bien contenir un sous-n&#339;ud en rapport avec un n&#339;ud de la question
mais ils ne seront pas mis en correspondance. Dans l&#8217;exemple ci-dessous, &quot;prix Nobel&quot; contenu
dans l&#8217;arbre de la question n&#8217;est pas mis en relation avec celui de la phrase car ce dernier est un
sous-n&#339;ud.
Question : En quelle ann&#233;e Thomas Mann a-t-il obtenu le &lt;_Prix&gt; prix Nobel &lt;/_Prix&gt; ?
Texte : En 1929, six jours apr&#232;s son premier contrat, il assiste &#224; Stockholm &#224; la remise du &lt;_prix&gt; &lt;_Prix&gt; prix
Nobel &lt;/_Prix&gt; &lt;_type_prix&gt; de litt&#233;rature &lt;/_type_prix&gt; &lt;/_prix&gt; &#224; Thomas Mann avant de tirer le portrait
de George Bernard Shaw &#224; Londres.
</p>
<p>De m&#234;me, on peut &#233;tendre ce probl&#232;me aux relations synonymiques dans les sous-n&#339;uds. Dans
l&#8217;exemple suivant, la relation de synonymie entre les sous-n&#339;uds &quot;cyclone Andrew&quot; et &quot;oura-
gan Andrew&quot; n&#8217;est par exemple pas d&#233;tect&#233;e. Les types sont identiques, mais la synonymie ne
fonctionne pas car elle est faite &#224; un niveau global. Il faut donc descendre dans les n&#339;uds pour
valider la relation.
Question : En quelle ann&#233;e l&#8217; &lt;_phen_meteo&gt; &lt;_decl&gt; ouragan &lt;/_decl&gt; &lt;_meteo&gt; &lt;_nom&gt; Andrew &lt;/_nom&gt;
&lt;/_meteo&gt; &lt;/_phen_meteo&gt; s&#8217;est-il manifest&#233;.
</p>
<p>Texte : Elles ont en m&#233;moire les importantes pertes qu&#8217;elles ont enregistr&#233;es apr&#232;s le passage du &lt;_phen_meteo&gt;
&lt;_decl&gt; cyclone &lt;/_decl&gt; &lt;_meteo&gt; &lt;_nom&gt; Andrew &lt;/_nom&gt; &lt;/_meteo&gt; &lt;/_phen_meteo&gt; en 1992 ou apr&#232;s
le tremblement de terre en Californie en 1994.
</p>
<p>Une premi&#232;re approche pour traiter les sous-n&#339;uds serait de prendre en compte le sous-arbre
sur lequel est appliqu&#233;e l&#8217;op&#233;ration. Ainsi, on ne substituerait plus un n&#339;ud mais un sous-
arbre par un autre sous-arbre. On identifierait d&#8217;abord les op&#233;rations &#233;l&#233;mentaires au niveau des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Bernard
</p>
<p>feuilles des sous-arbres du texte, puis on remonterait dans l&#8217;arbre en g&#233;n&#233;rant des op&#233;rations
plus globales. Si les feuilles d&#8217;un sous-arbre du texte sont en relation avec le m&#234;me sous-arbre
de la question, on proc&#233;derait alors &#224; la substitution. Le co&#251;t serait donc calcul&#233; en fonction de
l&#8217;&#233;quivalence entre les structures des deux arbres : type s&#233;mantique des diff&#233;rents n&#339;uds proche
ou &#233;quivalent, peu de n&#339;ud pour lesquels on ne trouve pas de relations ...
</p>
<p>5.3.2 Perte d&#8217;information li&#233;e &#224; l&#8217;extraction de la phrase
Un deuxi&#232;me probl&#232;me souvent observ&#233; est l&#8217;extraction de la phrase contenant la r&#233;ponse et la
perte d&#8217;informations essentielles qui en r&#233;sulte. Ce probl&#232;me est directement li&#233; &#224; notre fonction
de co&#251;t de suppression, qui pour le moment est &#233;l&#233;mentaire et ne p&#233;nalise pas suffisamment les
textes contenant la mauvaise r&#233;ponse, et la gestion du contexte.
</p>
<p>Pour le moment, l&#8217;impact de la suppression sur l&#8217;ensemble du calcul du co&#251;t est d&#233;lib&#233;r&#233;ment
minor&#233; car cela faussait trop les r&#233;sultats : les passages du texte comportaient souvent un grand
nombre de n&#339;uds et la suppression prenait plus d&#8217;importance que les autres op&#233;rations. La
fonction de co&#251;t associ&#233;e se doit donc d&#8217;&#234;tre bien plus fine. En fixant certaines limites dans
l&#8217;ensemble de l&#8217;extrait du texte (selon la ponctuation mais aussi certaines conjonctions comme
&quot;et&quot;, &quot;que&quot;, etc.), il serait possible d&#8217;avoir des bornes pour la suppression. Dans l&#8217;exemple ci
dessous nous avons proc&#233;d&#233; &#224; une segmentation manuelle. Le texte en entier est illustr&#233;, et non
pas la phrase extraite par notre m&#233;thode, qui correspondrait alors au tout dernier segment. Si
l&#8217;on identifie l&#8217;ensemble des relations entre le texte et la question, on d&#233;tecte l&#8217;existence d&#8217;une
relation d&#8217;&#233;quivalence sur les n&#339;uds &quot;World Trade Center&quot; et &quot;attentat&quot; entre la question et le
segment 5 qui disparait si on ne traite que la phrase avec la r&#233;ponse. Les segments trait&#233;s dans
ce cas l&#224; sont le cinqui&#232;me et le huiti&#232;me.
Question avec la r&#233;ponse ins&#233;r&#233;e : F&#233;vrier 1993 l&#8217; attentat &#224; la bombe contre le World Trade Center
Texte d&#233;coup&#233; :
</p>
<p>(1) Un terroriste pr&#233;sum&#233; extrad&#233; (2) d&#8217;un pays asiatique a &#233;t&#233; inculp&#233; mardi (3) &#224; New York
(4) pour sa participation pr&#233;sum&#233;e (5) &#224; l&#8217;attentat contre le World Trade Center,
(6) ont rapport&#233; les t&#233;l&#233;visions locales. (7) Cet acte terroriste avait fait 6 morts (8) en f&#233;vrier 1993.
</p>
<p>Dans le cas pr&#233;sent, les bornes de suppression seraient ins&#233;r&#233;es avant le segment 5 et apr&#232;s le
segment 7. Tous les n&#339;uds non compris entre ces bornes seront supprim&#233;s. Cette m&#233;thode per-
met donc d&#8217;identifier les segments contenant l&#8217;information utile. Il est cependant clair que plus
un n&#339;ud est &#233;loign&#233; des bornes, plus la suppression doit &#234;tre p&#233;nalisante : un n&#339;ud contenant
un &#233;l&#233;ment critique de la question ne valide pas forc&#233;ment la r&#233;ponse &#233;valu&#233;e s&#8217;il est &#233;loign&#233;
du n&#339;ud contenant la r&#233;ponse. Une premi&#232;re id&#233;e serait d&#8217;avoir une gestion plus pouss&#233;e du
contexte en incluant des relations entre segments pour d&#233;terminer le co&#251;t des suppressions. On
pourrait ainsi mod&#233;liser plus pr&#233;cisement l&#8217;impact des op&#233;rations. Par exemple, le segment 5
d&#233;crit la cible d&#8217;un attentat, et il est en relation avec le segment 7 qui d&#233;crit les cons&#233;quences
de cet attentat. Le segment 7 est en relation avec les segments 5 et 6 car il contient la date de
l&#8217;attentat. L&#8217;utilisation de relations s&#233;mantiques telles qu&#8217;elles sont d&#233;crites dans (Rosset et al.,
2007) serait une possibilit&#233; pour traiter ce type de probl&#232;me.
</p>
<p>5.3.3 Ajout de relations entre les n&#339;uds
Au cours de notre analyse, il est souvent apparu n&#233;cessaire d&#8217;ajouter des relations anaphoriques
ou s&#233;mantiques entre nos diff&#233;rents n&#339;uds. Les probl&#232;mes concernant les anaphores semblent
plus fr&#233;quents dans les questions de type &quot;personne&quot; que dans les autres cat&#233;gories. La nature
de ces probl&#232;mes est assez diverse : pronoms personnels (&quot;il&quot;) faisant r&#233;f&#233;rence &#224; une personne,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse des r&#233;sultats d&#8217;une m&#233;thode de r&#233;ordonnancement de r&#233;ponses
</p>
<p>ou des r&#233;f&#233;rences plus complexes. Dans l&#8217;exemple suivant, La phrase contenant la r&#233;ponse &#224; la
question ne contient pas d&#8217;informations sur &quot;Jacques Delors&quot;. Par contre la phrase suivante parle
de &quot;Jacques Delors&quot; comme &#233;tant le &#8221;pr&#233;d&#233;cesseur&#8221; de Jacques Santer (&quot;son pr&#233;d&#233;cesseur&quot;). Il
faudrait pouvoir identifier l&#8217;adjectif passif &quot;son&quot; comme faisant r&#233;f&#233;rence &#224; &quot;Jacques Santer&quot;. De
plus, il faut mettre en relation &quot;Jacques Delors&quot; avec &quot;pr&#233;d&#233;cesseur&quot;. Il faut identifier la relation
d&#8217;antonymie entre &quot;succ&#233;da&quot; et &quot;pr&#233;d&#233;cesseur&quot; qui permet enfin de confirmer que &quot;Jacques
Santer&quot; est le successeur de &quot;Jacques Delors&quot;.
Question : Qui succ&#233;da &#224; Jacques Delors &#224; la pr&#233;sidence de la Commission europ&#233;enne ?
Texte contenant la r&#233;ponse : Les ministres des affaires &#233;trang&#232;res des Quinze, r&#233;unis en conf&#233;rence intergouver-
nementale, ont officiellement nomm&#233; lundi les 20 membres de la commission europ&#233;enne pr&#233;sid&#233;e par le Luxem-
bourgeois Jacques Santer.
Phrase suivante : Son pr&#233;d&#233;cesseur, le Fran&#231;ais Jacques Delors, a fait ses adieux apr&#232;s dix ans de pr&#233;sidence.
</p>
<p>Il faudrait donc &#224; la fois disposer d&#8217;un module de traitement des anaphores4, avec notamment
des r&#232;gles d&#8217;inf&#233;rences pour d&#233;terminer les relations entre les diff&#233;rents n&#339;uds, mais aussi en-
richir notre dictionnaire de synonymes en prenant en compte la nature des n&#339;uds.
</p>
<p>L&#8217;ajout de relations s&#233;mantiques se r&#233;v&#232;le n&#233;cessaire, particuli&#232;rement pour des relations de type
&#8220;g&#233;ographique&#8221;. L&#8217;obtention de bons r&#233;sultats dans les questions de type &#8220;lieu&#8221; semblent parti-
culi&#232;rement d&#233;pendante de ces relations. Dans l&#8217;exemple suivant, la mauvaise r&#233;ponse &quot;Russie&quot;
sera invalid&#233;e &#233;tant donn&#233; que &quot;participe&quot; n&#8217;implique pas que Halifax se trouve en Russie. Plus
loin, &quot;en nouvelle Ecosse&quot; permet de d&#233;terminer o&#249; se trouve vraiment &quot;Halifax&quot;. Cette ap-
proche requiert &#224; la fois de cr&#233;er des relations sur les verbes (relation ternaire dans ce cas entre
&quot;Russie&quot;, &quot;participera&quot; et &quot;au sommet de Juin&quot;) ainsi qu&#8217;une gestion des pr&#233;positions de lieu
comme &quot;&#224;&quot; ou &quot;en&quot;.
Question : O&#249; se trouve Halifax ?
Question avec la r&#233;ponse ins&#233;r&#233;e : Russie se trouve Halifax.
Texte : La Russie participera au sommet de Juin, &#224; Halifax, en nouvelle Ecosse, sur les m&#234;mes bases que l&#8217;an
dernier.
</p>
<p>6 Conclusions et perspectives
Nous avons pr&#233;sent&#233; une m&#233;thode ayant pour objectif d&#8217;am&#233;liorer la s&#233;lection des r&#233;ponses can-
didates. Cette approche est fond&#233;e sur un calcul du co&#251;t de transformation entre arbres issus de
l&#8217;analyse et repr&#233;sentant la question et un texte pouvant contenir la r&#233;ponse. Nous avons &#233;valu&#233;
cette m&#233;thode sur les corpus Clef 2004 et 2005 et analys&#233; les r&#233;sultats. Notre approche donne
pour le moment de mauvais r&#233;sultats, principalement &#224; cause du fonctionnement &#233;l&#233;mentaire de
nos fonctions de co&#251;ts. Nous avons donc men&#233; une analyse en &#233;tudiant les r&#233;sultats obtenus dans
les cat&#233;gories de questions les plus pertinentes. Nous avons d&#233;crit des am&#233;liorations &#224; apporter
&#224; notre syst&#232;me. L&#8217;analyse que nous avons conduite sugg&#232;re diff&#233;rentes voies d&#8217;am&#233;lioration.
La prise en compte de la profondeur de nos arbres et de leur structure est essentielle pour g&#233;rer
nos relations d&#8217;&#233;quivalence et de synonymie entre arbres. Par ailleurs, une meilleure gestion
de la synonymie semble n&#233;cessaire pour d&#233;tecter les bonnes r&#233;ponses. Le dictionnaire que nous
utilisons actuellement ne contient pas assez d&#8217;informations, et nous &#233;tudions des m&#233;thodes pour
l&#8217;enrichir automatiquement. Il s&#8217;agirait dans un premier temps d&#8217;ajouter des synonymes proches
&#224; chaque entr&#233;e du dictionnaire, comme &#8220;&#233;lecteurs&#8221; et &#8220;&#233;lisent&#8221;. Actuellement, le dictionnaire
</p>
<p>4Nous faisons actuellement des &#233;valuations pr&#233;liminaires pour int&#233;grer un module d&#8217;anaphores dans notre ap-
proche. Il ne traite pour l&#8217;instant que les pronoms personnels &quot;il&quot;, &quot;elle&quot; et &quot;lui&quot;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Bernard
</p>
<p>ne mod&#233;lise les synonymes qu&#8217;entre les mots du m&#234;me type syntaxique. Une premi&#232;re approche
pour enrichir ce dictionnaire serait d&#8217;utiliser wiktionary.org et d&#8217;en extraire automatiquement
les synonymes. L&#8217;extraction des phrases contenant la bonne r&#233;ponse ne donne pas de bons r&#233;-
sultats pour le moment, et nous perdons assez fr&#233;quemment des informations critiques. Ainsi,
il semble important d&#8217;avoir une meilleure gestion du contexte de nos documents par le biais
de la d&#233;tection des relations entre les n&#339;uds d&#8217;un arbre. Nous nous int&#233;ressons entre autre aux
relations de type anaphorique (Vicedo &amp; Ferrandez, 2000). Nos perspectives incluent &#233;gale-
ment l&#8217;&#233;tude des techniques dites d&#8217;implication textuelle (textual entailment) pour am&#233;liorer
nos r&#233;sultats (Dagan et al., 2006). Enfin, nous comptons utiliser cette m&#233;thode pour am&#233;liorer
l&#8217;interaction entre un utilisateur et un syst&#232;me interactif exploitant les op&#233;rations appliqu&#233;es
pour trouver une r&#233;ponse.
</p>
<p>R&#233;f&#233;rences
BERNARD G. (2008). R&#233;ordonnancement de r&#233;ponses par transformation d&#8217;arbre pour un
syst&#232;me de question-r&#233;ponse oral interactif. In RJCRI&#8217;08 (Rencontre des Jeunes Chercheurs
en Recherche d&#8217;Informations), p. 361&#8211;368.
BRAZ R., GIRJU R., PUNYAKANOK V., ROTH D., &amp; SAMMONS M. (2005). Knowledge
representation for semantic entailment and question-answering. IJCAI-05 Workshop on Know-
ledge and Reasoning for Question Answering.
DAGAN I., GLICKMAN O., &amp; MAGNINI B. (2006). The PASCAL Recognising Textual En-
tailment Challenge. Lecture Notes in Computer Science, 3944, 177&#8211;190.
GILLARD L., BELLOT P. &amp; EL-B&#200;ZE M. (2007). D&#8217;une compacit&#233; positionnelle &#224; une com-
pacit&#233; probabiliste pour un syst&#232;me de questions/r&#233;ponses. In Conf&#233;rence en Recherche d&#8217;In-
formation et Applications (CORIA), p. 271&#8211;286.
LIGOZAT A.-L. (2005). Apport de l&#8217;analyse syntaxique des phrases dans un syst&#232;me de
questions-r&#233;ponses. Traitement automatique des langues, 46(3), 103&#8211;125.
LIGOZAT A.-L. (2006). Exploitation et fusion de connaissances locales pour la recherche
d&#8217;informations pr&#233;cises. PhD thesis, LIMSI - Universit&#233; Paris-Sud 11.
MAGNINI B. &amp; KOUYLEKOV M. (2006). Tree edit distance for recognizing textual en-
tailment : Estimating the cost of insertion. In the Second PASCAL Challenges Workshop on
Recognising Textual Entailment.
ROSSET S., GALIBERT O., ADDA G. &amp; BILINSKI E. (2007). The Limsi QAST Systems :
Comparison between human and automatic rules generation for question-answering on speech
transcriptions. In Automatic Speech Recognition and Understanding (ASRU), p. 647&#8211;652.
ROSSET S., GALIBERT O., ILLOUZ G. &amp; MAX A. (2006). Interaction et recherche d&#8217;infor-
mation : le projet Ritel. Traitement Automatique des Langues, 46(3), 155&#8211;179.
TANEZ H., KOUYLEKOV M., MAGNINI B., NEGRI M. &amp; SIMOV K. (2005). Exploiting
Linguistic Indices and Syntactic Structures for Multilingual Question Answering : ITC-irst at
CLEF 2005. In CLEF 2005, p. 390&#8211;399.
VICEDO J. L. &amp; FERRANDEZ A. (2000). Importance of pronominal anaphora resolution in
question answering systems. In Proceedings of the 38th Annual Meeting on Association for
Computational Linguistics (ACL &#8217;00), p. 555&#8211;562 : ACL.
VILLANEAU J., ROSSET S. &amp; GALIBERT O. (2007). Semantic relations for an oral and inter-
active question-answering system. In Semantic Representation of Spoken Language (SRSL7),
p. 12&#8211;19.</p>

</div></div>
</body></html>