<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>G&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e pour la production de documents</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>G&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e pour la production de
documents
</p>
<p>Pierre Hankach1, 2
</p>
<p>(1) Orange Labs, 2 avenue Pierre Marzin, 22300 Lannion
(2) Universit&#233; Paris 7, 5 rue Thomas Mann, 75013 PARIS
</p>
<p>pierre.hankach@orange-ftgroup.com
</p>
<p>R&#233;sum&#233;. Dans cet article, nous proposons une approche int&#233;gr&#233;e localis&#233;e pour la g&#233;n&#233;ra-
tion. Dans cette approche, le traitement int&#233;gr&#233; des d&#233;cisions linguistiques est limit&#233; &#224; la produc-
tion des propositions dont les d&#233;cisions qui concernent leurs g&#233;n&#233;rations sont d&#233;pendantes. La
g&#233;n&#233;ration se fait par groupes de propositions de tailles limit&#233;es avec traitement int&#233;gr&#233; des d&#233;-
cisions linguistiques qui concernent la production des propositions qui appartiennent au m&#234;me
groupe. Notre approche apporte une solution pour le probl&#232;me de complexit&#233; computationnelle
de la g&#233;n&#233;ration int&#233;gr&#233;e classique. Elle fournit ainsi une alternative &#224; la g&#233;n&#233;ration s&#233;par&#233;e (s&#233;-
quentielle ou interactive) qui pr&#233;sente plusieurs d&#233;fauts mais qui est impl&#233;ment&#233;e de mani&#232;re
r&#233;pandue dans les syst&#232;mes de g&#233;n&#233;rations existants.
</p>
<p>Abstract. In this paper, we propose a localized integrated approach for generation. In this
approach, the integrated handling of linguistic decisions is limited to the production of proposi-
tions whose decisions concerning their generation are dependant. The generation is performed
by groups of propositions of limited size with an integrated handling of linguistic decisions that
concern the production of the propositions that belong to the same group. Our approach pro-
vides a solution for the computational complexity problem of classical integrated generation.
Therefore, it provides an alternative to separated generation (sequential and interactive) that has
many drawbacks but is widely implemented in today&#8217;s generation systems.
</p>
<p>Mots-cl&#233;s : g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e - architectures de g&#233;n&#233;ration - SDRT - segmen-
tation du discours.
</p>
<p>Keywords: localized integrated generation - generation architectures - SDRT - discourse
segmentation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Hankach
</p>
<p>1 Introduction
</p>
<p>Dans ce papier, nous proposons une nouvelle approche pour la gestion des d&#233;cisions linguis-
tiques de la g&#233;n&#233;ration bas&#233;e sur l&#8217;identification des d&#233;cisions linguistiques d&#233;pendantes. En
effet, la fa&#231;on dont les d&#233;cisions linguistiques sont organis&#233;es et coordonn&#233;es a une grande
influence sur les performances de la g&#233;n&#233;ration. La qualit&#233; de la sortie de la g&#233;n&#233;ration et la
complexit&#233; de calcul en d&#233;pendent toutes les deux. Dans la litt&#233;rature, deux types d&#8217;architec-
tures pour g&#233;rer les d&#233;cisions de la g&#233;n&#233;ration ont &#233;t&#233; propos&#233;s : L&#8217;architecture int&#233;gr&#233;e et
l&#8217;architecture s&#233;par&#233;e. La premi&#232;re souffre du probl&#232;me de la complexit&#233; alors que la deuxi&#232;me
pr&#233;sente des d&#233;fauts qui influent n&#233;gativement sur la qualit&#233; de la g&#233;n&#233;ration. Dans la suite de
l&#8217;introduction, nous pr&#233;sentons les deux types d&#8217;architectures propos&#233;es dans la litt&#233;rature et
les implications de chacune sur les performances de la g&#233;n&#233;ration, ensuite nous introduisons
bri&#232;vement notre approche.
</p>
<p>Les syst&#232;mes &#224; architecture int&#233;gr&#233;e (Appelt, 1985; Kantrowitz &amp; Bates, 1992) impl&#233;mentent
une d&#233;pendance entre toutes les d&#233;cisions linguistiques individuelles de la g&#233;n&#233;ration. Cette
architecture est th&#233;oriquement s&#233;duisante mais repr&#233;sente un inconv&#233;nient majeur qui est sa
grande complexit&#233;. Pour cette raison, les syst&#232;mes &#224; architecture int&#233;gr&#233;e n&#8217;ont fonctionn&#233; que
sur des applications de g&#233;n&#233;ration simples avec des sorties &#224; taille r&#233;duite.
Les syst&#232;mes &#224; architecture s&#233;par&#233;e sont divis&#233;s en deux cat&#233;gories : les syst&#232;mes &#224; architecture
s&#233;quentielle (Reiter &amp; Dale, 2000) et les syst&#232;mes &#224; architecture interactive (Hovy, 1993). Dans
les syst&#232;mes &#224; architecture s&#233;par&#233;e, les d&#233;cisions linguistiques individuelles du m&#234;me type sont
group&#233;es dans des t&#226;ches comme la lexicalisation, l&#8217;agr&#233;gation ou l&#8217;ordonnancement. Dans l&#8217;ar-
chitecture s&#233;quentielle de (Reiter &amp; Dale, 2000), chaque t&#226;che est allou&#233;e &#224; un des trois niveaux :
La macro-planification regroupe les t&#226;ches de s&#233;lection et d&#8217;organisation de l&#8217;information. La
micro-planification regroupe les t&#226;ches pour choisir la meilleure perspective textuelle &#224; l&#8217;expres-
sion construite par le macro-planificateur. La formulation regroupe les t&#226;ches pour r&#233;aliser un
texte bien form&#233;. L&#8217;ex&#233;cution de la g&#233;n&#233;ration se fait s&#233;quentiellement de la macro-planification
&#224; la r&#233;alisation. Cette architecture poss&#232;de l&#8217;avantage de r&#233;duire la complexit&#233; de la g&#233;n&#233;ration
et de modulariser le traitement. En contre partie, elle ne prend pas en compte que les d&#233;cisions
d&#8217;une t&#226;che de g&#233;n&#233;ration d&#233;pendent des d&#233;cisions des autres t&#226;ches (voir (Danlos, 1984)). No-
tamment, le fait que les t&#226;ches du d&#233;but de la s&#233;quence prennent des engagements pr&#233;coces
s&#8217;av&#232;re probl&#233;matique. En effet, les d&#233;cisions prises par les t&#226;ches du d&#233;but de la s&#233;quence
en tenant compte des informations disponibles &#224; leur niveau, ne demeurent pas forc&#233;ment les
meilleures, apr&#232;s la r&#233;alisation des t&#226;ches qui suivent dans la s&#233;quence, quand &#224; la qualit&#233; de la
forme linguistique produite par la g&#233;n&#233;ration. Dans le pire des cas, les d&#233;cisions prises par les
t&#226;ches du d&#233;but de la s&#233;quence vont engendrer des t&#226;ches irr&#233;alisables dans la suite, et donc un
&#233;chec de la g&#233;n&#233;ration. Le ph&#233;nom&#232;ne est appel&#233; l&#8217;&#233;cart de la g&#233;n&#233;ration. L&#8217;architecture inter-
active de (Hovy, 1993) tente de rem&#233;dier &#224; certaines limitations de la g&#233;n&#233;ration &#224; architecture
s&#233;quentielle. Cette architecture permet une alternance entre les t&#226;ches de la macro-planification
et de la micro-planification. Elle permet au macro-planificateur de prendre en compte certaines
d&#233;cisions du micro-planificateur mais ne r&#233;sout pas totalement les probl&#232;mes de l&#8217;architecture
s&#233;quentielle tout en introduisant une complexit&#233; suppl&#233;mentaire par rapport &#224; cette derni&#232;re.
</p>
<p>Dans cet article, nous proposons une nouvelle approche de construction d&#8217;un syst&#232;me de g&#233;n&#233;-
ration bas&#233;e sur une g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e, o&#249; le traitement int&#233;gr&#233; des d&#233;cisions linguis-
tiques est limit&#233; &#224; la production des propositions dont les d&#233;cisions linguistiques qui concernent
leur r&#233;alisation sont d&#233;pendantes. Notre approche est fond&#233;e sur l&#8217;intuition que la r&#233;alisation
d&#8217;une proposition dans un texte ne d&#233;pend pas de la r&#233;alisation de toutes les autres propositions</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e pour la production de documents
</p>
<p>du texte. Ceci entra&#238;ne une ind&#233;pendance entre d&#233;cisions linguistiques bas&#233;e sur la localisa-
tion des propositions sur lesquelles elles portent (plut&#244;t que sur leur type comme suppos&#233; dans
les architectures s&#233;par&#233;es). Dans notre approche, la g&#233;n&#233;ration se fait par groupes de proposi-
tions de tailles limit&#233;es avec traitement int&#233;gr&#233; des d&#233;cisions linguistiques pour la production
des propositions d&#8217;un groupe. La g&#233;n&#233;ration compl&#232;te d&#8217;un document se fait par la production
successive de tous les groupes de propositions qui le composent. Dans la suite, nous appelons
&#233;tape de g&#233;n&#233;ration la g&#233;n&#233;ration d&#8217;un groupe de propositions du document final. Notre ap-
proche de g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e permet d&#8217;impl&#233;menter une g&#233;n&#233;ration int&#233;gr&#233;e avec une
complexit&#233; combinatoire acceptable. Ceci est une cons&#233;quence du fait qu&#8217;&#224; chaque &#233;tape la d&#233;-
pendance est consid&#233;r&#233;e entre un nombre limit&#233; de d&#233;cisions linguistiques. Dans la section 2
nous pr&#233;sentons les bases th&#233;oriques d&#8217;une g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e. Dans la section 3 nous
pr&#233;sentons les &#233;tapes de la g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e. Dans la section 4 nous pr&#233;sentons une
br&#232;ve description d&#8217;une &#233;tape de g&#233;n&#233;ration. Nous concluons dans la section 5.
</p>
<p>2 Bases th&#233;oriques d&#8217;une g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e
</p>
<p>Afin d&#8217;impl&#233;menter une g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e, nous avons besoin de d&#233;finir des proc&#233;d&#233;s
pour :
&#8211; Identifier des groupes de propositions d&#8217;un discours dont les d&#233;cisions linguistiques qui
concernent leurs g&#233;n&#233;rations sont d&#233;pendantes. Pour cela, nous nous basons sur la structure
des segments de discours de (Grosz &amp; Sidner, 1986).
</p>
<p>&#8211; Organiser les propositions d&#8217;un groupe entre elles et par rapport aux propositions d&#8217;autres
groupes. Pour cela, nous nous basons sur la structure relationnelle de SDRT (Segmented
Discourse Representation Theory, (Asher &amp; Lascarides, 2003)) qui constitue une sorte de
matrice o&#249; s&#8217;imbriquent les propositions du discours.
</p>
<p>Dans la suite, nous pr&#233;sentons la segmentation du discours pr&#233;sent&#233;e par (Grosz &amp; Sidner,
1986), puis la structure relationnelle de SDRT. Enfin, pour les besoins de notre approche de
g&#233;n&#233;ration, nous superposons la segmentation &#233;tablie par (Grosz &amp; Sidner, 1986) sur la structure
relationnelle de SDRT.
</p>
<p>2.1 La segmentation du discours
</p>
<p>2.1.1 Grosz &amp; Sidner
</p>
<p>Une observation courante dans la litt&#233;rature &#224; propos du discours est sa nature segment&#233;e. Les
propositions du discours se regroupent en segments, o&#249; chaque segment r&#233;alise un but com-
municatif particulier. Les segments peuvent &#224; leur tour se grouper avec d&#8217;autres segments et
propositions dans des segments plus larges. (Grosz &amp; Sidner, 1986) (dor&#233;navant G&amp;S) associe
la segmentation du discours &#224; sa structure intentionnelle. La structure intentionnelle est form&#233;e
par les intentions de communication (dans la suite, nous interchangeons l&#8217;utilisation de &#8220;inten-
tion de communication&#8221; et &#8220;but communicatif&#8221;) reli&#233;es entre elles par deux types de relations :
dominance et satisfaction-pr&#233;c&#233;dence. Une intention Im domine une intention In quand la sa-
tisfaction de In fait partie de la satisfaction de Im. Une intention In satisfaction-pr&#233;c&#232;de une
intention Im quand In doit &#234;tre satisfaite avant Im.
La structure des segments (appel&#233;e structure linguistique dans G&amp;S) est isomorphe &#224; la struc-
ture intentionnelle. Chaque segment du discours r&#233;alise une intention de communication appel&#233;e</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Hankach
</p>
<p>DSP (Discourse Segment Purpose) du segment. La relation entre les segments est une r&#233;flexion
des relations qui existent entre leurs DSPs respectifs. Un segment de discours DS1 contient
un autre segment de discours DS2 quand l&#8217;intention de communication DSP1 de DS1 domine
l&#8217;intention de communication DSP2 de DS2. Par exemple, consid&#233;rons le discours de la figure
1 adapt&#233; de (Asher &amp; Lascarides, 2003). La figure 2 repr&#233;sente les intentions communicatives
du discours de la figure 1 et les relations de dominance qui les relient. Le discours global est le
</p>
<p>FIG. 1 &#8211; Soir&#233;e de Marc.
</p>
<p>segment DS0, qui r&#233;alise l&#8217;intention communicative I0. La r&#233;alisation de I1 et de I2 fait partie
du plan de la r&#233;alisation de I0. Les intentions communicatives I1 et I2 sont par cons&#233;quent do-
min&#233;es par I0. De fait de cette dominance, le segment DS0 contient les deux segment DS1 et
DS2.
La structure des segments n&#8217;est pas d&#233;compositionnelle. Un segment peut inclure d&#8217;autres seg-
ments ainsi que d&#8217;autres propositions qui appartiennent exclusivement &#224; ce segment. Dans la
suite de ce papier, nous utilisons le terme noyau pour d&#233;signer les propositions d&#8217;un segment
qui appartiennent exclusivement &#224; lui et &#224; aucun des segments qu&#8217;il contient. Dans l&#8217;exemple
de la figure 1, (a) constitue le noyau du segment DS0. Le noyau d&#8217;un segment transmet le but
principal de communication du segment, alors que les segments interm&#233;diaires que contient le
segment aident &#224; la satisfaction de son but de communication.
</p>
<p>2.1.2 D&#233;pendances dans la r&#233;alisation du discours au vu de sa segmentation
</p>
<p>La contribution d&#8217;un constituant (une proposition ou un segment) au discours se fait &#224; travers
sa contribution &#224; la r&#233;alisation du but communicatif du segment auquel il appartient. Par cons&#233;-
quent, l&#8217;introduction d&#8217;une proposition, ainsi que la forme linguistique qu&#8217;elle prend dans le
discours, va d&#233;pendre principalement de la mani&#232;re avec laquelle elle se combine aux autres
constituants du segment auquel elle appartient pour satisfaire son but communicatif. Du point
de vue de la g&#233;n&#233;ration, la d&#233;pendance des d&#233;cisions linguistiques est alors limit&#233;e aux d&#233;ci-
sions qui permettent de r&#233;aliser le but communicatif d&#8217;un segment. Ces d&#233;cisions concernent la
production du contenu propre (noyau) du segment et sa disposition avec les segments inclus qui
r&#233;alisent des buts communicatifs partiels. Dans la section 3, nous pr&#233;sentons une g&#233;n&#233;ration par
&#233;tapes des propositions du discours, o&#249; &#224; chaque &#233;tape sont produites les propositions dont les
d&#233;cisions linguistiques concernant leur r&#233;alisation sont d&#233;pendantes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e pour la production de documents
</p>
<p>FIG. 2 &#8211; Les relations de dominance pour les DSPs du texte &#8220;la soir&#233;e de Marc&#8221;.
</p>
<p>2.2 Structure relationnelle de SDRT
</p>
<p>La structure relationnelle de SDRT d&#233;crit le rattachement des propositions d&#8217;un discours co-
h&#233;rent. Elle est construite &#224; partir des propositions et des relations de discours (ou relations
rh&#233;toriques) qui les relient. Deux types de relations existent entre les propositions : les relations
subordinantes et les relations coordinantes. G&#233;om&#233;triquement, une relation subordinante est re-
pr&#233;sent&#233;e par un trait vertical et une relation coordinante est repr&#233;sent&#233;e par un trait horizontal.
Les propositions d&#8217;un discours coh&#233;rent se relient toutes entre elles pour former une structure
hi&#233;rarchique unique. La forme de la structure hi&#233;rarchique d&#233;coule des propri&#233;t&#233;s suivantes des
relations subordinantes et coordinantes :
&#8211; Une relation subordinante laisse son premier argument accessible pour un nouvel attache-
ment.
</p>
<p>&#8211; Une relation coordinante bloque l&#8217;accessibilit&#233; &#224; son premier argument pour de nouveaux
attachements.
</p>
<p>&#8211; Si deux propositions sont attach&#233;es par une relation coordinante, si l&#8217;une d&#8217;elle est rattach&#233;e
par une relation subordinante &#224; une troisi&#232;me alors l&#8217;autre l&#8217;est aussi.
</p>
<p>La figure 3 repr&#233;sente la structure relationnelle de SDRT du texte &#8220;soir&#233;e de Marc&#8221;
</p>
<p>2.3 Alignement de la structure des segments sur la structure relationnelle
</p>
<p>Dans ce qui suit, nous identifions les segments de discours et leurs rattachements dans la struc-
ture relationnelle de SDRT.
</p>
<p>D&#233;limitation d&#8217;un segment
Soit une structure relationnelle S0 et T0 le noeud sommet de la structure S0. Selon les pro-
pri&#233;t&#233;s de la structure relationnelle, T0 constitue le topique du contenu de la structure S0. La
partie inf&#233;rieure de la structure qui est subordonn&#233;e au topique, contribue &#224; la satisfaction du
but communicatif que le topique cherche &#224; r&#233;aliser. Par cons&#233;quent, nous pouvons conclure que
le but communicatif DSP0 du segment DS0 associ&#233; &#224; S0 est de r&#233;aliser le topique. Ceci est
exprim&#233; par la formule suivante :
</p>
<p>DSP0 = Ir&#233;aliser(T0)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Hankach
</p>
<p>FIG. 3 &#8211; La structure relationnelle de SDRT du texte &#8220;soir&#233;e de Marc&#8221;.
</p>
<p>FIG. 4 &#8211; Les segments dans la structure relationnelle du texte &#8220;soir&#233;e de Marc&#8221;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e pour la production de documents
</p>
<p>De plus, tous les &#233;l&#233;ments subordonn&#233;s au topique appartiennent au segment dont le but com-
municatif est DSP0. En conclusion, un segment de discours est repr&#233;sent&#233; dans la structure
relationnelle par le noeud-topique qui r&#233;alise son but communicatif et tous les &#233;l&#233;ments de la
structure qui sont subordonn&#233;s &#224; lui. La relation d&#8217;un segment avec les autres constituants du
discours se fait &#224; travers son topique. La figure 4 illustre les segments dans la structure relation-
nelle du texte de le figure 1.
</p>
<p>Enboitement des segments
Soit un segmentDS0 qui contient un autre segmentDS1. La structure S0 correspondant &#224;DS0
contient la structure S1 correspondant &#224;DS1, et le topique T0 deDS0 domine le topique T1 de
DS1. La dominance de T1 par T0 est concr&#233;tis&#233;e par une relation subordinante ou une chaine
de relations subordinantes reliant les deux topiques. La relation de dominance entre les topiques
est le reflet de la relation de dominance entre les buts communicatifs des deux segments. Dans
la figure 4 la structure de DS1 fait partie de la structure de DS0 (DSP0 domine DSP1) et (b)
qui est le topique de DS1 et subordonn&#233; &#224; (a) le topique de DS0.
</p>
<p>Noyau d&#8217;un segment
Le noyau d&#8217;un segment DS0 est form&#233; de la partie sup&#233;rieure de la structure relationnelle S0
correspondante dont les &#233;l&#233;ments n&#8217;appartiennent &#224; aucun des segments que contientDS0. Cela
est d&#251; au fait que les segments inclus dans DS0 d&#233;butent en-dessous du sommet de la structure
qui contient T0 et couvre tous les &#233;l&#233;ments qui sont subordonn&#233;s au noeud du d&#233;but.
</p>
<p>3 Etapes de la g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e
</p>
<p>Dans cette section, nous pr&#233;sentons le d&#233;roulement de la g&#233;n&#233;ration d&#8217;un document par &#233;tapes.
A chaque &#233;tape, les propositions dont les d&#233;cisions linguistiques qui concernent leur r&#233;alisation
sont d&#233;pendantes vont &#234;tre produites. Le d&#233;coupage en &#233;tapes est fond&#233; sur la segmentation du
discours pr&#233;sent&#233;e ci-dessus. L&#8217;attachement des propositions produites durant une &#233;tape entre
elles et avec les autres propositions des diff&#233;rentes &#233;tapes de g&#233;n&#233;ration se base sur la structure
relationnelle du discours coh&#233;rent de SDRT. La g&#233;n&#233;ration est impl&#233;ment&#233;e en exploitant l&#8217;ali-
gnement des structures relationnelles de SDRT et celle des segments de G&amp;S : la g&#233;n&#233;ration se
r&#233;alise en construisant de mani&#232;re descendante et par &#233;tapes la structure SDRT du document,
o&#249; &#224; chaque &#233;tape nous construisons une partie de la structure. Dans la suite, nous d&#233;taillons le
processus.
</p>
<p>Entr&#233;e de la g&#233;n&#233;ration
Etant dans le contexte de g&#233;n&#233;ration de document, le point de d&#233;part de la g&#233;n&#233;ration est la
r&#233;alisation d&#8217;un but communicatif. Nous consid&#233;rons que l&#8217;entr&#233;e de la g&#233;n&#233;ration est un plan de
buts communicatifs comparable &#224; la structure de G&amp;S : Le but communicatif principal domine
des but communicatifs interm&#233;diaires (second niveau de buts communicatifs) qui participent &#224;
sa satisfaction. A leur tour, chacun des buts communicatifs du second niveau peut dominer des
buts communicatifs de troisi&#232;me niveau et ainsi de suite.
</p>
<p>Description du processus
Dans la suite, nous appellons segment cible le segment (dans le sens de G&amp;S) qu&#8217;on cherche
&#224; g&#233;n&#233;rer. Le segment cible peut contenir d&#8217;autres segments qu&#8217;on appelle segment(s) interm&#233;-
diaire(s) (la structure des segments est connue car elle est r&#233;flexion du plan des buts commu-
nicatifs). Le d&#233;roulement de la g&#233;n&#233;ration d&#8217;un document est le suivant : La g&#233;n&#233;ration d&#233;bute
au niveau du but communicatif principal et se r&#233;alise de mani&#232;re descendante. A ce niveau, le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Hankach
</p>
<p>FIG. 5 &#8211; G&#233;n&#233;ration progressive
</p>
<p>segment cible de la g&#233;n&#233;ration repr&#233;sente le discours global. Le but du g&#233;n&#233;rateur est alors de
produire les &#233;l&#233;ments linguistiques qui sont d&#233;pendants les uns des autres, et de laisser pour une
&#233;tape ult&#233;rieure la production des &#233;l&#233;ments qui ne les affectent pas. Notamment, les &#233;l&#233;ments
internes d&#8217;un segment interm&#233;diaire n&#8217;ont pas d&#8217;incidence sur la g&#233;n&#233;ration des &#233;l&#233;ments du
noyau du segment cible ou sur la g&#233;n&#233;ration des &#233;l&#233;ments d&#8217;un autre segment interm&#233;diaire.
Dans ce sens, le g&#233;n&#233;rateur va produire les propositions du noyau cible, et les propositions qui
permettent d&#8217;ancrer les segments interm&#233;diaires. Ceci revient &#224; g&#233;n&#233;rer la partie sup&#233;rieure de
la structure relationnelle du segment qui contient les &#233;l&#233;ments du noyau du segment cible et les
topiques des segments interm&#233;diaires. Dans la suite, nous appellons ce groupe de propositions
le noyau &#233;tendu du segment cible. Le processus de g&#233;n&#233;ration se poursuit en passant &#224; un des
segments interm&#233;diaires (qui est d&#233;j&#224; ancr&#233; &#224; ce stade) qui devient le segment cible de la g&#233;n&#233;-
ration. La g&#233;n&#233;ration se compl&#232;te en n tours, o&#249; n repr&#233;sente le nombre de segments dans le
texte qui est le nombre des buts communicatifs dans le plan de communication.
La figure 5 repr&#233;sente la g&#233;n&#233;ration progressive du texte de l&#8217;exemple de la figure 1 en trois
&#233;tapes (le texte ayant trois segments). Le premier groupe d&#8217;&#233;lements g&#233;n&#233;r&#233;s contient le noyau
&#233;tendu de DS0 (le noyau du segment DS0 et les topiques de DS1 et DS2). Les deuxi&#232;me et
troisi&#232;me groupes constituent respectivement les suites des segments DS1 et DS2.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e pour la production de documents
</p>
<p>4 Description d&#8217;une &#233;tape de g&#233;n&#233;ration
</p>
<p>La g&#233;n&#233;ration du groupe de propositions correspondant au noyau &#233;tendu d&#8217;un segment cible
se d&#233;roule en deux phases. Premi&#232;rement, le contenu s&#233;mantique pertinent est identifi&#233;. Il est
repr&#233;sent&#233; par un ensemble d&#8217;unit&#233;s s&#233;mantiques candidates &#224; l&#8217;inclusion dans le noyau &#233;tendu.
Deuxi&#232;mement, la g&#233;n&#233;ration de la forme linguistique du noyau &#233;tendu est r&#233;alis&#233;e avec une ar-
chitecture int&#233;gr&#233;e des t&#226;ches. Pour r&#233;aliser une g&#233;n&#233;ration &#224; architecture int&#233;gr&#233;e, nous propo-
sons d&#8217;impl&#233;menter l&#8217;ensemble des types de d&#233;cisions linguistiques de la g&#233;n&#233;ration (s&#233;lection
du contenu, la structuration, la lexicalisation, la pronominalisation) dans un CSP (probl&#232;me de
satisfaction de contraintes, (Tsang, 1993)). Les t&#226;ches de la g&#233;n&#233;ration sont alors mod&#233;lis&#233;es
par un ensemble de variables, les domaines sur lesquelles portent les variables et un ensemble
des contraintes sur les variables. (HANKACH P., 2008) et (Moriceau &amp; Saint-Dizier, 2005)
impl&#233;mentent une mod&#233;lisation CSP des t&#226;ches de la g&#233;n&#233;ration. Suite &#224; cette mod&#233;lisation, un
r&#233;solveur CSP calcule la forme linguistique du noyau &#233;tendu (&#224; partir des unit&#233;s s&#233;mantiques
candidates trouv&#233;s durant la premi&#232;re phase de s&#233;lection de contenu) en consid&#233;rant l&#8217;ensemble
des contraintes &#224; la fois. Dans ce qui suit, nous allons pr&#233;senter la premi&#232;re phase de s&#233;lection
du contenu.
</p>
<p>S&#233;lection de contenu s&#233;mantique appropri&#233; pour une &#233;tape de g&#233;n&#233;ration
La premi&#232;re &#233;tape de la g&#233;n&#233;ration d&#8217;un noyau &#233;tendu du segment cible est d&#8217;identifier le
contenu s&#233;mantique pertinent &#224; inclure. Nous proposons de r&#233;aliser une expansion relationnelle
pour isoler l&#8217;ensemble d&#8217;unit&#233;s s&#233;mantiques candidates &#224; l&#8217;inclusion dans le noyau &#233;tendu d&#8217;un
segment. La d&#233;cision finale de l&#8217;inclusion d&#8217;une unit&#233; s&#233;mantique ainsi que son positionnement
et sa verbalisation vont &#234;tre prises durant la phase suivante de la g&#233;n&#233;ration du noyau &#233;tendu.
L&#8217;expansion relationnelle est r&#233;alis&#233;e de la mani&#232;re suivante : Le topique du segment cible
constitue le centre d&#8217;expansion. En partant du centre d&#8217;expansion, nous s&#233;lectionnons toutes les
unit&#233;s s&#233;mantiques qui sont reli&#233;es &#224; lui par une relation s&#233;mantique quelconque. Le m&#234;me pro-
cessus est r&#233;p&#233;t&#233; avec les unit&#233;s s&#233;mantiques nouvellement s&#233;lectionn&#233;es. Les unit&#233;s retenues
comme candidates &#224; l&#8217;inclusion dans la forme finale du noyau &#233;tendu sont les suivantes :
&#8211; Les unit&#233;s d&#8217;une chaine d&#8217;expansion qui pr&#233;c&#232;de le topique d&#8217;un segment interm&#233;diaire (le
topique est inclut) si la distance entre le centre d&#8217;expansion et le topique est inf&#233;rieure &#224; une
borne sup&#233;rieure de N &#233;l&#233;ments.
</p>
<p>&#8211; Les k premiers &#233;l&#233;ments des autres cha&#238;nes
L&#8217;expansion relationnelle permet d&#8217;identifier les unit&#233;s de contenu s&#233;mantiquement reli&#233;es au
topique du segment cible. Elle permet aussi d&#8217;&#233;tablir la liaison avec les topiques des segments
interm&#233;diaires ce qui permet leur ancrage. La figure 6 illustre l&#8217;expansion relationnelle.
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; une nouvelle approche de construction d&#8217;un syst&#232;me de g&#233;n&#233;ration bas&#233;e
sur une g&#233;n&#233;ration int&#233;gr&#233;e localis&#233;e, o&#249; le traitement int&#233;gr&#233; des d&#233;cisions linguistiques est
limit&#233; &#224; la production des propositions dont les d&#233;cisions linguistiques qui concernent leur r&#233;a-
lisation sont d&#233;pendantes. Notre approche permet de r&#233;soudre le probl&#232;me de complexit&#233; de la
g&#233;n&#233;ration int&#233;gr&#233;e classique. De ce fait, elle fournit ainsi une alternative viable &#224; la g&#233;n&#233;ration
s&#233;par&#233;e (s&#233;quentielle ou interactive) qui pr&#233;sente plusieurs d&#233;fauts mais qui est impl&#233;ment&#233;e
de mani&#232;re r&#233;pandue dans les syst&#232;mes de g&#233;n&#233;rations existants. De plus notre approche de
g&#233;n&#233;ration pr&#233;sente les caract&#233;ristiques suivantes : Elle permet de combiner les g&#233;n&#233;rations</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Hankach
</p>
<p>FIG. 6 &#8211; Expansion relationnelle.
</p>
<p>descendante et ascendante. L&#8217;initiation des &#233;tapes de la g&#233;n&#233;ration se fait de mani&#232;re descen-
dante en partant des buts communicatifs, alors que la r&#233;alisation de la g&#233;n&#233;ration dans une &#233;tape
est ascendante. Enfin, si besoin, la g&#233;n&#233;ration peut s&#8217;arr&#234;ter &#224; n&#8217;importe quelle &#233;tape, ce qui peut
&#234;tre utile dans les cas d&#8217;applications en temps r&#233;el par exemple.
</p>
<p>R&#233;f&#233;rences
</p>
<p>APPELT D. (1985). Planning English Sentences. Cambridge, England : Cambridge University
Press.
ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation. Cambridge : Cambridge
University Press.
DANLOS L. (1984). Conceptual and linguistic decisions in generation. Proceedings of
COLING-84, p. 501&#8211;504.
GROSZ B. J. &amp; SIDNER C. L. (1986). Attention, intentions, and the structure of discourse.
Computational Linguistics, 12(3), 175&#8211;204.
HANKACH P. D. L. . P. F. (2008). Sdrt based csp problem planning approach for merging
predefined messages in human-machine interaction systems. Proceedings of INFOS 2008.
HOVY E. (1993). Automated discourse generation using discourse structure relations. Artifi-
cial Intelligence, 63, 341&#8211;385.
KANTROWITZ M. &amp; BATES J. (1992). Integrated natural language generation systems. In R.
DALE, E. HOVY, D. R&#214;SNER &amp; O. STOCK, Eds., Aspects of Automated Natural Language
Generation, p. 13&#8211;28. Berlin : Springer.
MORICEAU V. &amp; SAINT-DIZIER P. (2005). A Constraint-Based Model for Lexical
and Syntactic Choice in Natural Language Generation, volume 3438 of LNCS - LNAI.
http ://www.springerlink.com : Springer. Revised selected papers of CSLP 2004.
REITER E. &amp; DALE R. (2000). Building natural language generation systems. Cambridge
University Press.
TSANG E. (1993). Foundations of Constraint Satisfaction. London : Academic Press.</p>

</div></div>
</body></html>