<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annotation des informations temporelles dans des textes en fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Annotation des informations temporelles dans des textes en
fran&#231;ais.
</p>
<p>Andr&#233; Bittar
Universit&#233; Paris 7 Diderot - ALPAGE
</p>
<p>andre.bittar@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. Le traitement des informations temporelles est crucial pour la compr&#233;hension de
textes en langue naturelle. Le langage de sp&#233;cification TimeML a &#233;t&#233; con&#231;u afin de permettre
le rep&#233;rage et la normalisation des expressions temporelles et des &#233;v&#233;nements dans des textes
&#233;crits en anglais. L&#8217;objectif des divers projets TimeML a &#233;t&#233; de formuler un sch&#233;ma d&#8217;annotation
pouvant s&#8217;appliquer &#224; du texte libre, comme ce que l&#8217;on trouve sur le Web, par exemple. Des
efforts ont &#233;t&#233; faits pour l&#8217;application de TimeML &#224; d&#8217;autres langues que l&#8217;anglais, notamment
le chinois, le cor&#233;en, l&#8217;italien, l&#8217;espagnol et l&#8217;allemand. Pour le fran&#231;ais, il y a eu des efforts
allant dans ce sens, mais ils sont encore un peu &#233;parpill&#233;s. Dans cet article, nous d&#233;taillons
nos travaux actuels qui visent &#224; &#233;laborer des ressources compl&#232;tes pour l&#8217;annotation de textes
en fran&#231;ais selon TimeML - notamment un guide d&#8217;annotation, un corpus de r&#233;f&#233;rence (Gold
Standard) et des modules d&#8217;annotation automatique.
</p>
<p>Abstract. The processing of temporal information is crucial for the understanding of na-
tural language texts. The specification language TimeML was developed to facilitate the iden-
tification and normalization of temporal expressions and events in texts written in English. The
aim of the various TimeML projects was to formulate an annotation scheme able to be applied
to free text, such as that which is found on the Web, for example. Recently, efforts have been
made to apply TimeML to languages other than English, namely Chinese, Korean, Italian, Spa-
nish and German. Some efforts have been made in this direction with respect to French, but
they remain somewhat scattered. In this paper, we detail our ongoing work, which aims to es-
tablish comprehensive resources for the annotation of French texts according to TimeML - an
annotation guide, a Gold Standard corpus and modules for automatic annotation.
</p>
<p>Mots-cl&#233;s : Annotation temporelle, rep&#233;rage des &#233;v&#233;nements, TimeML.
</p>
<p>Keywords: Temporal annotation, event recognition, TimeML.
</p>
<p>1 Introduction
</p>
<p>Depuis quelques ann&#233;es, l&#8217;importance des informations temporelles dans la compr&#233;hension de
la langue naturelle a motiv&#233; le d&#233;veloppement d&#8217;outils pour le rep&#233;rage et la normalisation
de ce type de donn&#233;es avec le but d&#8217;am&#233;liorer les performances et la couverture de certaines
applications, telles que les syst&#232;mes de questions-r&#233;ponses ou l&#8217;extraction d&#8217;information.
</p>
<p>Le langage de sp&#233;cification TimeML, qui est l&#8217;aboutissement de divers projets dans le domaine
de l&#8217;annotation des informations temporelles, fournit un sch&#233;ma d&#8217;annotation pour les expres-
sions temporelles et les &#233;v&#233;nements ainsi que les relations auxquelles ils participent. Les travaux</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar
</p>
<p>ont &#233;t&#233; men&#233;s sur l&#8217;annotation de l&#8217;anglais. Un corpus de r&#233;f&#233;rence (Gold Standard), TimeBank,
a &#233;t&#233; &#233;labor&#233;, ainsi que des outils d&#8217;annotation manuelle et automatique pour les &#233;v&#233;nements,
les expressions temporelles et les relations qui gouvernent les deux.
</p>
<p>&#201;tant donn&#233; l&#8217;absence de convergence des diff&#233;rentes ressources pour le fran&#231;ais et leur incom-
pl&#233;tude partielle, le d&#233;veloppement d&#8217;un ensemble coh&#233;rent d&#8217;outils nous a sembl&#233; pertinent.
Dans cet article, nous pr&#233;sentons nos travaux pour la cr&#233;ation de ressources TimeML pour le
fran&#231;ais. La section 2 consistera en une description du langage TimeML et des travaux sur l&#8217;an-
glais. La section 3 fera le tour des travaux pr&#233;existants sur d&#8217;autres langues, y compris le fran-
&#231;ais. La section 4 couvrira l&#8217;&#233;laboration d&#8217;un corpus de r&#233;f&#233;rence pour le fran&#231;ais. La section
5 d&#233;taillera les modules que nous sommes en train d&#8217;&#233;laborer pour le rep&#233;rage et l&#8217;annotation
automatique des &#233;v&#233;nements et des expressions temporelles.
</p>
<p>2 Le projet TimeML
</p>
<p>2.1 Le sch&#233;ma d&#8217;annotation
</p>
<p>TimeML (Pustejovsky et al., 2003) est un langage de sp&#233;cification issu de l&#8217;atelier TERQAS1
</p>
<p>dans le cadre du projet AQUAINT. Ce projet vise &#224; am&#233;liorer les syst&#232;mes de questions-
r&#233;ponses en leur permettant de r&#233;pondre &#224; des questions de nature temporelle sur les entit&#233;s
et les &#233;v&#233;nements. Dans ce cadre, TimeML a &#233;t&#233; &#233;labor&#233; comme langage d&#8217;annotation pour
faciliter le raisonnement et l&#8217;inf&#233;rence sur le temps.
</p>
<p>Le sch&#233;ma d&#8217;annotation pr&#233;voit les fonctionnalit&#233;s suivantes : l&#8217;annotation des &#233;v&#233;nements,
l&#8217;&#233;tiquetage des expressions temporelles et la normalisation de leur valeur ainsi que la mise
en &#233;vidence des relations qui existent entre ces deux types d&#8217;entit&#233;s temporelles. Les traits de
temps verbaux, la polarit&#233; et la modalit&#233; ainsi que la classe d&#8217;&#233;v&#233;nement peuvent aussi &#234;tre an-
not&#233;s. Contrairement &#224; des notions traditionnelles, TimeML adopte une conception large des
&#233;v&#233;nements qui regroupe les &#233;v&#233;nements et certains &#233;tats (ce qui correspond plus &#224; la no-
tion d&#8217;&#233;ventualit&#233; (Bach, 1986)). En plus de la plupart des verbes, cette d&#233;finition comprend
des noms &#233;v&#233;nementiels comme destruction et guerre, ainsi que des adjectifs (malade) et les
groupes pr&#233;positionnels (&#224; bord) qui d&#233;signent typiquement des &#233;tats. TimeML compte 7 classes
d&#8217;&#233;v&#233;nements diff&#233;rents : ASPECTUAL, I_ACTION, I_STATE, OCCURRENCE, PERCEPTION,
REPORTING et STATE. Nous orientons le lecteur vers (Saur&#237; et al., 2005) pour une descrip-
tion de ces classes. Les &#233;v&#233;nements sont annot&#233;s avec la balise EVENT. Le sch&#233;ma d&#8217;annotation
TimeML pr&#233;cise que c&#8217;est la t&#234;te lexicale du chunk &#233;v&#233;nementiel qui doit &#234;tre annot&#233;e. Ce choix
est fait afin de simplifier l&#8217;annotation (le processus et le r&#233;sultat), notamment en vu des difficul-
t&#233;s pr&#233;sent&#233;es par les propositions ench&#226;ss&#233;es ou celles contenant plusieurs verbes2. Cette sim-
plification constitue une premi&#232;re &#233;tape dans le rep&#233;rage des &#233;v&#233;nements. (Pustejovsky et al.,
2006) ont propos&#233; une extension du sch&#233;ma d&#8217;annotation qui consiste en l&#8217;ajout de balises pour
capturer les arguments des &#233;v&#233;nements, mais cette proposition n&#8217;a pas encore &#233;t&#233; int&#233;gr&#233;e.
Les informations sur la polarit&#233; (attribut polarity), l&#8217;aspect (aspect) et la modalit&#233; (modality)
sont &#233;galement repr&#233;sent&#233;es &#224; l&#8217;int&#233;rieur de la balise EVENT.
</p>
<p>Les expressions temporelles sont marqu&#233;es par la balise TIMEX3. Elles se divisent en 4 classes :
</p>
<p>1http ://www.timeml.org/site/terqas/
2Voir http ://lirics.loria.fr/doc_pub/SemAFCD24617-1Rev12.pdf p135-137 pour une discussion.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des informations temporelles dans des textes en fran&#231;ais
</p>
<p>les dates (type DATE, le 15 janvier, 15.01.2008), les heures (type TIME, 15h20, l&#8217;apr&#232;s-midi),
les dur&#233;es (type DURATION, 5 jours, deux ans) et les ensembles (type SET, tous les jours,
chaque ann&#233;e). TimeML permet aussi le raisonnement avec des expressions temporelles sous-
sp&#233;cifi&#233;es, comme lundi prochain et l&#8217;ann&#233;e pr&#233;c&#233;dente, dont la valeur doit &#234;tre d&#233;termin&#233;e par
rapport &#224; un point temporel de r&#233;f&#233;rence.
</p>
<p>Les &#233;v&#233;nements et les expressions temporelles sont mis en relation par trois sortes de liens
(links) : liens temporels (TLINK), aspectuels (ALINK) et de subordination (SLINK). La premi&#232;re
sorte capture des relations temporelles entre deux entit&#233;s (EVENT-EVENT, TIMEX3-TIMEX3,
ou EVENT-TIMEX3), la deuxi&#232;me capture les phases dans le d&#233;roulement d&#8217;un &#233;v&#233;nement et la
derni&#232;re est essentielle pour les raisonnements qui d&#233;pendent de la v&#233;racit&#233; ou la certitude des
propositions qui d&#233;notent des &#233;v&#233;nements. Les mots fonctionnels qui signalent explicitement
un de ces liens sont annot&#233;s avec la balise SIGNAL. Le plus souvent ce sont des pr&#233;positions
comme avant, apr&#232;s, pendant ou lors de.
</p>
<p>Ci-dessous figure un exemple simplifi&#233; d&#8217;annotation avec les balises principales y compris un
lien (TLINK) pour la relation temporelle entre l&#8217;&#233;v&#233;nement et l&#8217;expression de date, pour la
phrase Jean est arriv&#233; avant le 11 f&#233;vrier 2004 :
</p>
<p>Jean est &lt;EVENT id=&quot;e1&quot; class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot; tense=&quot;PAST&quot;
</p>
<p>polarity=&quot;POS&quot;&gt;arriv&#233;&lt;/EVENT&gt; &lt;SIGNAL&gt;avant&lt;/SIGNAL&gt; le
</p>
<p>&lt;TIMEX3 id=&quot;t1&quot; val=&quot;2004-02-11&quot;&gt;11 f&#233;vrier 2004&lt;/TIMEX3&gt; .
</p>
<p>&lt;TLINK relType=&quot;BEFORE&quot; event=&quot;e1&quot; time=&quot;t1&quot;/&gt;
</p>
<p>2.2 Les ressources pour l&#8217;anglais
</p>
<p>Pour l&#8217;anglais, un corpus de r&#233;f&#233;rence, TimeBank, a &#233;t&#233; &#233;labor&#233; manuellement3. Des modules
d&#8217;annotation automatique ont &#233;galement &#233;t&#233; d&#233;velopp&#233;s dans le cadre du projet TARSQI4. Evita
(Saur&#237; et al., 2005) est un syst&#232;me de reconnaissance d&#8217;&#233;v&#233;nements, bas&#233; sur des strat&#233;gies lin-
guistiquement motiv&#233;es et des donn&#233;es statistiques. Sa performance a &#233;t&#233; mesur&#233;e &#224; 74.03% de
pr&#233;cision et 87.31% de rappel, une F-mesure de 80.12%.
GUTime (Mani &amp; Wilson, 2000), bas&#233; sur la reconnaissance de patrons, &#233;tiquette les expres-
sions temporelles et normalise leur valeur. Il a &#233;t&#233; &#233;valu&#233; &#224; 85% et 82% de F-mesure respec-
tivement pour les t&#226;ches de reconnaissance et de normalisation. Des outils pour l&#8217;annotation
des liens ont &#233;galement &#233;t&#233; d&#233;velopp&#233;s5, mais des chiffres pr&#233;cis sur leur &#233;valuation ne sont
pas disponibles. L&#8217;ensemble de ces modules vient d&#8217;&#234;tre int&#233;gr&#233; dans le TARSQI Toolkit. Plus
r&#233;cemment, lors de l&#8217;atelier TempEval 20076, une &#233;valuation d&#8217;un ensemble de syst&#232;mes a &#233;t&#233;
effectu&#233;e pour trois t&#226;ches portant sur l&#8217;identification des relations temporelles dans des textes
en anglais. Les participants ont &#233;t&#233; &#233;valu&#233;s sur une section du corpus TimeBank.
</p>
<p>3Il existe d&#233;sormais d&#8217;autres corpus manuellement annot&#233;s - le corpus AQUAINT et celui de TempEval 2007
(Voir http ://www.timeml.org/site/timebank/timebank.html)
</p>
<p>4http ://www.timeml.org/site/tarsqi/
5voir http ://www.timeml.org pour les d&#233;tails
6http ://timeml.org/tempeval/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar
</p>
<p>3 Travaux sur d&#8217;autres langues
</p>
<p>3.1 Le chinois, le cor&#233;en, l&#8217;italien, l&#8217;espagnol et l&#8217;allemand
</p>
<p>Le projet TimeML a &#233;t&#233; adopt&#233; par l&#8217;ISO et une norme est en cours d&#8217;&#233;laboration avec une pers-
pective d&#8217;adaptation &#224; d&#8217;autres langues que l&#8217;anglais. Dans l&#8217;&#233;tablissement de cette norme des
efforts ont d&#233;j&#224; &#233;t&#233; faits pour son adaptation au chinois, au cor&#233;en et &#224; l&#8217;italien avec des guides
d&#8217;annotation pour ces langues 7. Il existe &#233;galement divers travaux sur l&#8217;annotation automatique
TimeML pour certaines langues.
</p>
<p>(Caselli et al., 2007) ont men&#233; une &#233;tude sur l&#8217;annotation manuelle des &#233;v&#233;nements en italien et
les b&#233;n&#233;fices d&#8217;un lexique s&#233;mantique pour guider cette t&#226;che. (Negri &amp; Marseglia, 2004) ont
d&#233;velopp&#233; un module &#224; base de r&#232;gles pour la reconnaissance et la normalisation des expressions
temporelles. (Saquete et al., 2006) ont d&#233;velopp&#233;, dans une optique multilingue, un syst&#232;me
semblable pour l&#8217;espagnol et l&#8217;italien.
</p>
<p>Pour le chinois (Cheng et al., 2007) d&#233;taille un guide d&#8217;annotation pour la cr&#233;ation d&#8217;un corpus
annot&#233; en relations temporelles ainsi que la construction d&#8217;un mod&#232;le d&#8217;apprentissage pour
l&#8217;annotation automatique de ces relations.
</p>
<p>(Jang et al., 2004) d&#233;crit un &#233;tiqueteur temporel pour des articles de presse en cor&#233;en. Ce module
se focalise sur le rep&#233;rage et la normalisation des expressions temporelles. Le syst&#232;me, bas&#233; sur
des techniques d&#8217;apprentissage, atteint une F-mesure de 87% pour cette t&#226;che.
</p>
<p>Une nouvelle approche, qui permet de pallier l&#8217;absence de corpus annot&#233;s en allemand, est
d&#233;crit dans (Spreyer &amp; Frank, 2008). Les auteurs proposent une m&#233;thode statistique pour la
cr&#233;ation d&#8217;un &#233;tiqueteur temporel bas&#233;e sur la projection des annotations dans un corpus align&#233;
anglais-allemand issu d&#8217;EuroParl (Koehn, 2005). Pour la t&#226;che de reconnaissance des &#233;v&#233;ne-
ments le syst&#232;me atteint une pr&#233;cision de 83.95% et un rappel de 34.44% (F-mesure 48.84%) et
le rep&#233;rage des expressions temporelles une pr&#233;cision de 89.52%, 51.79% de rappel (F-mesure
65.62%). Cette &#233;valuation a &#233;t&#233; r&#233;alis&#233;e sur un corpus de 236 phrases align&#233;es.
</p>
<p>3.2 Travaux pr&#233;c&#233;dents sur le fran&#231;ais
</p>
<p>M&#234;me s&#8217;ils n&#8217;exploitent pas le sch&#233;ma TimeML, nous citons d&#8217;abord les travaux de (Gagnon
&amp; Lapalme, 1996), qui pr&#233;sentent une m&#233;thode pour la g&#233;n&#233;ration de textes en fran&#231;ais qui
v&#233;hiculent des informations temporelles. Les auteurs expliquent en d&#233;tail la base formelle sur
laquelle repose l&#8217;impl&#233;mentation d&#8217;un prototype de g&#233;n&#233;rateur de textes et pr&#233;cisent &#233;galement
les &#233;tapes suivies dans la g&#233;n&#233;ration des diff&#233;rents &#233;l&#233;ments temporels - les temps verbaux et
les adverbiaux temporels.
</p>
<p>Plus r&#233;cemment, (Battistelli et al., 2006) propose une analyse fonctionnelle pour la repr&#233;senta-
tion formelle des expressions calendaires. Les auteurs pr&#233;sentent un projet pour l&#8217;impl&#233;menta-
tion de cette formalisation dans le cadre d&#8217;un syst&#232;me de navigation temporelle dans des textes
biographiques.
</p>
<p>Les travaux men&#233;s sur le fran&#231;ais par (Muller &amp; Tannier, 2004) se concentrent sur une &#233;valuation
de la faisabilit&#233; et de la complexit&#233; de la t&#226;che d&#8217;annotation des relations temporelles ainsi que
</p>
<p>7Voir http ://lirics.loria.fr/doc_pub/SemAFCD24617-1Rev12.pdf pour une version pr&#233;finale</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des informations temporelles dans des textes en fran&#231;ais
</p>
<p>sur une m&#233;thode de calcul de ces relations. Ces travaux d&#233;crivent un module qui vise &#224; expliciter
les relations temporelles qui existent entre les verbes finis d&#8217;un texte et d&#233;taillent une m&#233;thode
d&#8217;&#233;valuation sur un corpus d&#8217;articles de presse manuellement annot&#233;s. Muller a travaill&#233; depuis
ces travaux sur le rep&#233;rage des expressions et des relations temporelles et a collabor&#233; avec
Michel Gagnon sur le rep&#233;rage des &#233;v&#233;nements. Leurs r&#233;sultats n&#8217;ont pas encore &#233;t&#233; rendu
publics.
</p>
<p>4 Corpus de r&#233;f&#233;rence et guide d&#8217;annotation pour le fran&#231;ais
</p>
<p>L&#8217;&#233;tablissement d&#8217;un corpus de r&#233;f&#233;rence Gold Standard est essentiel pour l&#8217;&#233;valuation de mo-
dules d&#8217;annotation automatique et pourrait, si sa taille et sa qualit&#233; le permettent, servir de base
&#224; des algorithmes d&#8217;apprentissage. Un de nos objectifs est d&#8217;annoter un ensemble de documents
en fran&#231;ais pour arriver &#224; un corpus de r&#233;f&#233;rence de bonne qualit&#233;. Les types de texte qui nous
int&#233;ressent particuli&#232;rement sont les articles ou les d&#233;p&#234;ches de presse, les documents encyclo-
p&#233;diques ou historiques et les textes biographiques du fait d&#8217;un fort contenu temporel. Philippe
Muller a annot&#233; manuellement un ensemble d&#8217;articles de presse et de biographies (non redis-
tribuables) en TimeML. Nous avons r&#233;cemment annot&#233; les m&#234;mes textes et envisageons une
comparaison de nos annotations respectives afin de d&#233;terminer le taux d&#8217;accord, ce qui donnera
une id&#233;e des performances que l&#8217;on peut attendre d&#8217;un module d&#8217;annotation automatique. Notre
corpus de r&#233;f&#233;rence est constitu&#233; pour l&#8217;instant de 30 articles de presse (15 876 mots au total,
529 mots par article en moyenne) annot&#233;s &#224; la main avec les outils Callisto et Tango (Verhagen
et al., 2005) con&#231;us pour l&#8217;annotation de l&#8217;anglais. Nous comptons &#233;largir ce corpus avec des
textes biographiques et encyclop&#233;diques afin de varier sa couverture.
</p>
<p>Afin de garantir une annotation la plus uniforme possible, nous &#233;laborons un guide d&#8217;annotation
qui explique ce qu&#8217;il faut et ne faut pas annoter, et quelles annotations donner au diff&#233;rentes
formes linguistiques pertinentes. Les particularit&#233;s du fran&#231;ais doivent &#234;tre prises en compte.
Par exemple, contrairement &#224; l&#8217;anglais, les verbes modaux du fran&#231;ais tels que devoir et falloir
peuvent &#234;tre conjugu&#233;s &#224; tous les temps. Cela a pour cons&#233;quence qu&#8217;il est n&#233;cessaire d&#8217;explici-
ter leurs traits de temps, mais aussi de mode et de polarit&#233; dans l&#8217;annotation. Nous les annotons
comme EVENT, m&#234;me si ce ne sont pas des &#233;v&#233;nements au sens strict du terme. Nous utilisons
donc une huiti&#232;me classe, MODAL, pour ces verbes. Une autre particularit&#233; du fran&#231;ais (qui le
distingue notamment de l&#8217;anglais) concerne l&#8217;utilisation du conditionnel pour marquer une cer-
taine modalit&#233; par rapport &#224; un fait pr&#233;tendu, comme dans la phrase suivante : Les gardes du
corps des parlementaires auraient fait plus de victimes que l&#8217;attentat-suicide selon un rapport
interne. Pour rep&#233;rer cet emploi du conditionnel (fr&#233;quent dans les articles de presse) et le dis-
tinguer de l&#8217;emploi plus habituel, nous attribuons la valeur CONJECTURAL &#224; l&#8217;attribut mood de
la balise EVENT (cette valeur CONJECTURAL a aussi &#233;t&#233; postul&#233;e pour le cor&#233;en).
</p>
<p>Nous adh&#233;rons &#224; la norme ISO-TimeML dans l&#8217;&#233;laboration de ce guide. Si cette norme ne diff&#232;re
pas beaucoup du langage TimeML original, elle est d&#233;velopp&#233;e dans un esprit multilingue et ne
contient pas certaines redondances de son pr&#233;d&#233;cesseur (notamment par la suppression de la
balise MAKEINSTANCE qui sert &#224; r&#233;aliser les diff&#233;rentes instances d&#8217;un &#233;v&#233;nement donn&#233;).
</p>
<p>Ce guide d&#8217;annotation est agr&#233;ment&#233; au fur et &#224; mesure de l&#8217;annotation du corpus de r&#233;f&#233;rence
avec les &#233;ventuelles adaptations n&#233;cessaires. Notre objectif est qu&#8217;il soit bas&#233; &#224; la fois sur la
th&#233;orie linguistique et sur une &#233;tude de corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar
</p>
<p>5 Modules d&#8217;annotation automatique
</p>
<p>5.1 Approche adopt&#233;e
</p>
<p>Nous optons pour une approche qui repose sur des r&#232;gles linguistiques. Ce choix s&#8217;impose tant
pour des raisons th&#233;oriques que techniques. Premi&#232;rement, il nous semble int&#233;ressant d&#8217;un point
de vue linguistique d&#8217;aborder les probl&#233;matiques sp&#233;cifiques au fran&#231;ais vis-&#224;-vis des t&#226;ches en
question. Cela est n&#233;cessaire pour l&#8217;&#233;laboration de ressources qui puissent &#234;tre partag&#233;es, et
surtout pour la cr&#233;ation d&#8217;un guide d&#8217;annotation. Deuxi&#232;mement, nous ne disposons pas de la
quantit&#233; de corpus annot&#233; qui serait n&#233;cessaire pour une approche bas&#233;e sur l&#8217;apprentissage au-
tomatique. Enfin, une approche par projection (cf section 3.1) donne pour l&#8217;instant des r&#233;sultats
moins bons que ceux obtenus par des syst&#232;mes symboliques.
</p>
<p>5.2 Annotation automatique d&#8217;expressions temporelles
</p>
<p>Nous concevons actuellement un module pour l&#8217;annotation des expressions temporelles qui se
base sur les graphes du package Time_French (Gross, 2002) pour Unitex8. Les graphes de
Time_French reconnaissent, de fa&#231;on tr&#232;s exhaustive, des patrons de date, d&#8217;heure, de dur&#233;e
et de fr&#233;quence. N&#233;anmoins, la sortie d&#8217;Unitex ne garde pas la trace du type d&#8217;expression tem-
porelle. Or le type d&#8217;expression temporelle (DATE, DURATION, TIME etc.) est une information
essentielle en TimeML. Les graphes de Maurice Gross ne correspondant pas aux cat&#233;gories des
expressions temporelles de TimeML, il a &#233;t&#233; n&#233;cessaire de r&#233;organiser totalement ces graphes
et de leur rajouter les balises TIMEX3 afin de respecter la typologie TimeML, ce qui correspond
techniquement &#224; transformer des automates en transducteurs. Par exemple, dans Time_French,
l&#8217;an 2000 et l&#8217;an prochain sont reconnus dans le m&#234;me graphe alors que ces deux expressions
sont de types diff&#233;rents en TimeML. Le premier est de type DATE (absolue) et le deuxi&#232;me de
type DATE-TemporalFunction (une fonction temporelle dont la valeur doit &#234;tre r&#233;solue par
rapport &#224; un point temporel de r&#233;f&#233;rence, comme hier ou la semaine prochaine).
</p>
<p>Enfin, de nombreuses expressions temporelles de Time_French n&#8217;ont pas &#233;t&#233; utilis&#233;es car elles
sortent du cadre de TimeML qui s&#8217;accroche aux relations surfaciques et calculables de fa&#231;on
op&#233;rationnelle. Par exemple, &#224; diverses reprises, &#224; l&#8217;heure convenue, en toute &#233;ventualit&#233;. Cela
ne veut pas pour autant dire que ces expressions ne devraient pas &#234;tre annot&#233;es.
</p>
<p>Si Unitex s&#8217;av&#232;re tr&#232;s utile pour la cr&#233;ation de nos transducteurs, nous n&#8217;utilisons n&#233;anmoins
pas cette application pour la suite de notre traitement pour des raisons expliqu&#233;es dans (Sa-
got et al., 2008). L&#8217;ensemble de transducteurs sert, apr&#232;s conversion, de grammaire d&#8217;entr&#233;e &#224;
SxPipe (Sagot &amp; Boullier, 2005), un syst&#232;me pour le pr&#233;traitement de textes destin&#233;s &#224; l&#8217;ana-
lyse syntaxique, qui effectue la reconnaissance et l&#8217;&#233;tiquetage des patrons en TimeML sur du
texte brut. Apr&#232;s l&#8217;&#233;tape de reconnaissance une deuxi&#232;me passe (avec un script Perl) sur le texte
effectue la normalisation des valeurs des TIMEX3 et d&#233;termine un &#233;ventuel point temporel de
r&#233;f&#233;rence pour le calcul des expressions temporelles sous-sp&#233;cifi&#233;es.
</p>
<p>8http ://www-igm.univ-mlv.fr/ unitex/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des informations temporelles dans des textes en fran&#231;ais
</p>
<p>5.3 Annotation automatique des informations &#233;v&#233;nementielles
</p>
<p>Le but de ce module est de rep&#233;rer et baliser (EVENT) les occurrences d&#8217;&#233;v&#233;nements (au sens
TimeML) et de les classifier selon l&#8217;ontologie d&#233;finie par le sch&#233;ma d&#8217;annotation. Il doit &#233;gale-
ment d&#233;tecter la pr&#233;sence d&#8217;&#233;l&#233;ments &#224; polarit&#233; n&#233;gative, d&#233;terminer la cat&#233;gorie aspectuelle des
verbes et d&#8217;&#233;ventuels &#233;l&#233;ments portant sur la modalit&#233; de l&#8217;&#233;v&#233;nement. Dans l&#8217;annotation d&#8217;un
&#233;v&#233;nement, le module doit annoter la t&#234;te lexicale du constituant &#233;v&#233;nementiel, comme montr&#233;
dans les exemples qui suivent, o&#249; les attributs de la balise &lt;EVENT&gt;sont omis,
</p>
<p>Le chat a &lt;EVENT&gt;mang&#233;&lt;/EVENT&gt; la souris
La violente &lt;EVENT&gt;destruction&lt;/EVENT&gt; de la ville
Jean &#233;tait &lt;EVENT&gt;malade&lt;/EVENT&gt; pendant deux jours
</p>
<p>Un certain nombre de pr&#233;traitements sont n&#233;cessaires avant l&#8217;intervention de ce module. Son
entr&#233;e doit &#234;tre un texte segment&#233; en phrases avec une tokenisation, un &#233;tiquetage en parties du
discours, une analyse morphologique flexionnelle et une analyse syntaxique de surface (chun-
king). Le syst&#232;me SxPipe, utilis&#233; pour l&#8217;annotation des expressions temporelles, n&#8217;effectuant
pas encore ces pr&#233;-traitements, nous utilisons la cha&#238;ne de traitement Macaon (Acosta &amp; Nasr,
2007) pour l&#8217;annotation des informations &#233;v&#233;nementielles. Nous esp&#233;rons disposer dans le futur
d&#8217;une cha&#238;ne de pr&#233;-traitements compl&#232;te permettant de r&#233;aliser &#224; la fois l&#8217;annotation d&#8217;expres-
sions temporelles et celle des informations &#233;v&#233;nementielles et donc de permettre le calcul des
relations entre les deux (cf section 5.4).
</p>
<p>Dans son &#233;tat actuel, ce module repose fortement sur des donn&#233;es lexicales. Pour la reconnais-
sance des noms &#233;v&#233;nementiels, il dispose d&#8217;un lexique (en cours d&#8217;&#233;laboration) des noms ayant
au moins une interpr&#233;tation &#233;v&#233;nementielle. Il sera &#224; terme b&#233;n&#233;fique de s&#233;parer les noms dont la
seule interpr&#233;tation est celle d&#8217;&#233;v&#233;nement (mort, guerre, accident) de ceux qui ont d&#8217;autres sens
pr&#233;sentation, description, repas, etc. Il sera n&#233;cessaire de d&#233;sambigu&#239;ser les noms ayant plu-
sieurs interpr&#233;tations possibles. Plusieurs sources ont contribu&#233; &#224; la constitution de ce lexique.
Une premi&#232;re source de noms potentiellement &#233;v&#233;nementiels est le lexique VerbAction (Ha-
thout et al., 2002) qui contient 9 393 couples verbe-nom d&#233;verbal pour un total de 9 200 lemmes
nominaux uniques. Pour compl&#233;ter ce lexique, nous avons extrait semi-automatiquement de re-
qu&#234;tes sur des moteurs de recherche les &#233;l&#233;ments apparaissant dans des patrons tels que X avoir
lieu, X se produire, lors de X, le/la X de...par, ou X est susceptible d&#8217;&#234;tre un nom &#233;v&#233;nementiel.
Une premi&#232;re application de cette m&#233;thode a donn&#233; 769 lemmes diff&#233;rents qui ne figurent pas
dans VerbAction. Elle sera r&#233;utilis&#233;e pour enrichir progressivement le lexique. La taille de ce
lexique (9 969 entr&#233;es) est du m&#234;me ordre de grandeur que celle du lexique correspondant pour
l&#8217;anglais (13 495 entr&#233;es).
</p>
<p>Un lexique de verbes sert de base &#224; la classification des &#233;v&#233;nements sous forme verbale. Il
contient les lemmes de verbes correspondant &#224; 6 des 7 classes TimeML (plus la classe MODAL,
voir section 4). La classe OCCURRENCE est la classe par d&#233;faut pour les verbes qui n&#8217;appar-
tiennent &#224; aucune autre classe. Il existe &#233;galement une liste des verbes qui n&#8217;ont aucune inter-
pr&#233;tation &#233;v&#233;nementielle au sens TimeML (la classe NON_EVENT contient des verbes tels que
durer, sembler, suffire, etc). Ce lexique, comme celui des noms, contient des ambigu&#239;t&#233;s dans
la mesure o&#249; certains verbes peuvent appartenir &#224; plusieurs classes ou ne doivent pas &#234;tre an-
not&#233;s dans certains contextes. Par exemple, expliquer appartient &#224; la classe REPORTING quand
il introduit un fait rapport&#233; ou du discours (&quot;La situation risquerait de s&#8217;aggraver&quot;, a expliqu&#233;
le porte-parole). Cependant, lorsqu&#8217;il a un sujet humain et un &#233;v&#233;nement comme objet (l&#8217;ex-
capitaine a expliqu&#233; le renouvellement de l&#8217;&#233;quipe), il doit &#234;tre annot&#233; I_ACTION. Enfin, s&#8217;il</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar
</p>
<p>a un sujet et un objet &#233;v&#233;nementiels (le r&#233;chauffement climatique explique la fonte des glaces)
il doit &#234;tre annot&#233; I_STATE. Citons &#233;galement l&#8217;exemple du verbe savoir qui doit &#234;tre annot&#233;
I_STATE selon son interpr&#233;tation habituelle (Max sait que la terre est ronde), ou OCCURRENCE
s&#8217;il est conjugu&#233; au pass&#233; compos&#233; avec une interpr&#233;tation voisine d&#8217;apprendre (Max a su que
L&#233;a &#233;tait partie).
</p>
<p>Nous nous voyons confront&#233;s au probl&#232;me non trivial de la d&#233;sambigu&#239;sation lexicale pour iden-
tifier les acceptions des emplois des noms et des verbes. Dans un premier temps nous abordons
ce probl&#232;me pour les verbes par l&#8217;application d&#8217;heuristiques simples portant sur chacune des
diff&#233;rentes classes de verbes TimeML. Par exemple, un verbe de la classe ASPECTUAL dans
le lexique (commencer, terminer, continuer), doit &#234;tre balis&#233; OCCURRENCE si le premier nom &#224;
sa droite n&#8217;est pas balis&#233; EVENT. Cela rend compte de la diff&#233;rence entre Jean a commenc&#233; la
discussion et Jean a commenc&#233; son livre (o&#249; un &#233;v&#233;nement sous-jacent est non sp&#233;cifi&#233;). Ces
heuristiques consistent en des g&#233;n&#233;ralisations grossi&#232;res sur la structure argumentale des verbes
et nous sommes conscient de leurs limites. &#201;tant donn&#233; l&#8217;impraticabilit&#233; d&#8217;une description ex-
haustive des r&#232;gles de d&#233;sambigu&#239;sation, nous envisageons, pour les noms et les verbes, des
m&#233;thodes probabilistes de d&#233;sambigu&#239;sation lexicale.
</p>
<p>L&#8217;algorithme actuel fonctionne par l&#8217;application de deux couches : lexicale et contextuelle. La
premi&#232;re consiste en une recherche lexicale pour les noms - ceux qui figurent dans le lexique
sont balis&#233;s EVENT dans le texte. Tous les verbes, &#224; part les auxiliaires et ceux dont le lemme
figure dans la classe NON_EVENT du lexique sont annot&#233;s &lt;EVENT&gt;. Ces verbes se voient at-
tribuer une classe TimeML selon le lexique des verbes. Ensuite s&#8217;applique la couche d&#8217;analyse
contextuelle. Pour l&#8217;instant cette couche d&#8217;analyse ne traite que les verbes. Cette &#233;tape &#233;limine
les mauvais candidats parmi les &#233;v&#233;nements annot&#233;s par la couche lexicale. Des r&#232;gles excluent
de l&#8217;annotation certains emplois non &#233;v&#233;nementiels de verbes impersonnels, comme il s&#8217;agit,
il convient de/que, il importe de/que etc. Elle corrige &#233;galement des erreurs de classification,
comme dans le cas des verbes expliquer et savoir ci-dessus. Un autre ensemble de r&#232;gles d&#233;-
termine la pr&#233;sence d&#8217;&#233;l&#233;ments &#224; polarit&#233; n&#233;gative (adverbes de n&#233;gation, d&#233;terminants n&#233;gatifs
etc), valeur repr&#233;sent&#233;e dans l&#8217;attribut polarity des noms et des verbes &#233;v&#233;nementiels. La
classe aspectuelle (trait aspect) est &#233;galement d&#233;termin&#233;e par un syst&#232;me de r&#232;gles se basant
sur les temps verbaux et d&#8217;autres &#233;l&#233;ments contextuels.
</p>
<p>5.4 Annotation automatique des relations
</p>
<p>&#192; terme, notre objectif est d&#8217;expliciter les relations (links, voir 2.1) qui existent entre les entit&#233;s
annot&#233;s en TimeML - les &#233;v&#233;nements et les expressions temporelles. L&#8217;annotation de ces rela-
tions mettra en &#233;vidence la structure temporelle du texte, notamment l&#8217;ordre d&#8217;occurrence et la
dur&#233;e des &#233;v&#233;nements. &#192; l&#8217;heure actuelle, nous n&#8217;avons pas commenc&#233; cette t&#226;che, qui d&#233;pend
de la r&#233;solution des t&#226;ches d&#233;crites dans les sections 5.2 et 5.3. De plus, en vue de nos travaux
sur l&#8217;anaphore &#233;v&#233;nementielle (Bittar, 2006), il serait int&#233;ressant d&#8217;envisager l&#8217;int&#233;gration de re-
lations r&#233;f&#233;rentielles, notamment l&#8217;anaphore et la cor&#233;f&#233;rence &#233;v&#233;nementielles (Danlos, 2006),
dans le sch&#233;ma d&#8217;annotation. Nous ne proposons pas pour autant de r&#233;soudre les t&#226;ches de r&#233;so-
lution concern&#233;es, mais plut&#244;t de fournir un moyen d&#8217;annoter ces types de relation r&#233;f&#233;rentielle,
ce qui n&#8217;est pas, pour l&#8217;instant, pr&#233;vu par le sch&#233;ma TimeML.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des informations temporelles dans des textes en fran&#231;ais
</p>
<p>6 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; un projet, en cours de r&#233;alisation, pour le d&#233;veloppement d&#8217;un ensemble
coh&#233;rent de ressources pour l&#8217;annotation des &#233;v&#233;nements et des expressions temporelles en
fran&#231;ais selon la norme TimeML. Nous sommes en train d&#8217;&#233;laborer un corpus de r&#233;f&#233;rence de
bonne qualit&#233;, annot&#233; selon cette norme, ainsi qu&#8217;un guide d&#8217;annotation linguistiquement fond&#233;.
Nous soulignons l&#8217;importance d&#8217;avoir un guide d&#8217;annotation, qui permettra aux divers actants
de la communaut&#233; de se focaliser sur la m&#234;me t&#226;che, ce qui est primordial pour assurer la per-
tinence d&#8217;&#233;ventuelles comparaisons de syst&#232;mes. Les modules d&#8217;annotation automatique que
nous &#233;laborons reposent &#224; l&#8217;heure actuelle majoritairement sur des donn&#233;es lexicales. Le mo-
dule de rep&#233;rage des &#233;v&#233;nements consiste aussi en l&#8217;application d&#8217;un ensemble d&#8217;heuristiques
portant sur la structure syntaxique locale. Afin d&#8217;am&#233;liorer la performance de ces modules, il
sera essentiel d&#8217;int&#233;grer un plus grand nombre de r&#232;gles. L&#8217;emploi de m&#233;thodes probabilistes
est &#233;galement &#224; consid&#233;rer pour traiter la t&#226;che difficile de d&#233;sambigu&#239;sation lexicale.
Au fur et &#224; mesure du d&#233;veloppement de nos modules nous avons effectu&#233; plusieurs &#233;valuations,
mais n&#8217;avons pas pour le moment de r&#233;sultats complets &#224; pr&#233;senter.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ACOSTA A. &amp; NASR A. (2007). Le projet MACAON : une architecture ouverte pour le
d&#233;veloppement d&#8217;outils de TAL. Voir http ://code.google.com/p/macaon/.
BACH E. (1986). The Algebra of Events. Linguistics and Philosophy, 9(1), 5&#8211;16.
BATTISTELLI D., MINEL J.-L. &amp; SCHWER S. R. (2006). Repr&#233;sentation des expressions
calendaires dans les textes : vers une application &#224; la lecture assist&#233;e de biographies. TAL,
47(3), 11&#8211;37.
BITTAR A. (2006). Un algorithme pour la r&#233;solution d&#8217;anaphores &#233;v&#233;nementielles. Master&#8217;s
thesis, Universit&#233; Paris 7 Diderot, Paris, France.
CASELLI T., PRODANOF I., RUIMY N. &amp; CALZOLARI N. (2007). Mapping SIMPLE and
TimeML : Improving Event Identification and Classification Using a Semantic Lexicon. In
Prooceedings of the 4th International Workshop on Generative Approaches to Lexicon, Paris,
France.
CHENG Y., ASAHARA M. &amp; MATSUMOTO Y. (2007). Constructing a Temporal Relation
Tagged Corpus of Chinese Based on Dependency Structure. In Proceedings of The 21st Annual
Conference of the Japanese Society for Artificial Intelligence, p. 311&#8211;315, Miyazaki, Japan.
DANLOS L. (2006). Verbes causatifs, discours causaux et cor&#233;f&#233;rence &#233;v&#233;nementielle. Lynx,
p. 233&#8211;246.
GAGNON M. &amp; LAPALME G. (1996). From Conceptual Time to Linguistic Time. Computa-
tional Linguistics, 22(1), 91&#8211;127.
GROSS M. (2002). Les d&#233;terminants num&#233;raux, un exemple : les dates horaires. Langages,
(145), 21&#8211;38.
HATHOUT N., NAMER F. &amp; DAL G. (2002). An Experimental Constructional Database : The
MorTAL Project. In P. BOUCHER, Ed., Many Morphologies, p. 178&#8211;209. Somerville, Mass.,
USA : Cascadilla.
JANG S. B., BALDWIN J. &amp; MANI I. (2004). Automatic TIMEX2 Tagging of Korean News.
ACM Transactions on Asian Language Information Processing, 3, 51&#8211;65.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Bittar
</p>
<p>KOEHN P. (2005). Europarl : A Parallel Corpus for Statistical Machine Translation. In Pro-
ceedings of the MT Summit 2005.
</p>
<p>MANI I. &amp; WILSON G. (2000). Processing of News. In Proceedings of the 38th Annual
Meeting of the Association for Computational Linguistics (ACL2000), p. 69&#8211;76.
</p>
<p>MULLER P. &amp; TANNIER X. (2004). Annotating and Measuring Temporal Relations in Texts.
In Proceedings of Coling 2004, volume 1, p. 50&#8211;56, Geneva, Switzerland : Association for
Computational Linguistics.
</p>
<p>NEGRI M. &amp; MARSEGLIA L. (2004). Recognition and Normalization of Time Expressions :
ITC-irst at TERN 2004. Rapport interne, ITC-irst, Trento.
</p>
<p>PUSTEJOVSKY J., CASTA&#209;O J., INGRIA R., SAUR&#205; R., GAIZAUSKAS R., SETZER A. &amp;
KATZ G. (2003). TimeML : Robust Specification of Event and Temporal Expressions in Text.
In Proceedings of IWCS-5, Fifth International Workshop on Computational Semantics.
</p>
<p>PUSTEJOVSKY J., LITTMAN J. &amp; SAUR&#205; R. (2006). Argument Structure in TimeML. In G.
KATZ, J. PUSTEJOVSKY &amp; F. SCHILDER, Eds., Annotating, Extracting and Reasoning about
Time and Events, number 05151 in Dagstuhl Seminar Proceedings, Dagstuhl, Germany : IBFI,
Schloss Dagstuhl, Germany.
</p>
<p>SAGOT B. &amp; BOULLIER P. (2005). From Raw Corpus to Word Lattices : Robust Pre-parsing
Processing. In Proceedings of the 2nd Language &amp; Technology Conference (LT&#8217;05), p. 348&#8211;
351, Poznan, Poland.
</p>
<p>SAGOT B., DANLOS L. &amp; D&#201;SIR A. (2008). Traitements de surface &#224; l&#8217;aide de graphes de
transitions r&#233;cursifs : de Unitex &#224; SxPipe. In Actes de TALN 2008, Avignon, France. Soumis.
</p>
<p>SAQUETE E., MU&#209;OZ R. &amp; MART&#205;NEZ-BARCO P. (2006). Event Ordering Using TERSEO
System. Data Knowledge Engineering, 58(1), 70&#8211;89.
SAUR&#205; R., KNIPPEN R., VERHAGEN M. &amp; PUSTEJOVSKY J. (2005). Evita : A Robust Event
Recognizer for QA Systems. In Proceedings of HLT/EMNLP 2005, p. 700&#8211;707.
</p>
<p>SPREYER K. &amp; FRANK A. (2008). Projection-based Acquisition of a Temporal Labeller.
In Proceedings of the Third International Joint Conference on Natural Language Processing
(IJCNLP-2008), Hyderabad, India.
</p>
<p>VERHAGEN M., MANI I., SAUR&#205; R., KNIPPEN R., LITTMAN J. &amp; PUSTEJOVSKY J. (2005).
Automating Temporal Annotation with TARSQI. In Proceedings of the ACL 2005.</p>

</div></div>
</body></html>