<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Identification automatique de marques d'opinion dans des textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Recital2008, Avignon, 9-13 juin 2008
</p>
<p>Identification automatique de marques d'opinion dans des
textes
</p>
<p>Aiala Ros&#225; 1,2
</p>
<p>1 Facultad de Ingenier&#237;a - Universidad de la Rep&#250;blica,
J. Herrera y Reissig 565, Montevideo, Uruguay
</p>
<p>aialar@fing.edu.uy
2 MoDyCo, UMR7114, CNRS - Universit&#233; Paris X
</p>
<p>200, avenue de la R&#233;publique, Nanterre, France
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons un mod&#232;le conceptuel pour la repr&#233;sentation d'opinions, en
analysant les &#233;l&#233;ments qui les composent et quelques propri&#233;t&#233;s. Ce mod&#232;le conceptuel
est impl&#233;ment&#233; et nous en d&#233;crivons le jeu d&#8217;annotations. Le processus automatique
d&#8217;annotation de textes en espagnol est effectu&#233; par application de r&#232;gles contextuelles.
Un premier sous-ensemble de r&#232;gles a &#233;t&#233; &#233;crit pour l'identification de quelques
&#233;l&#233;ments du mod&#232;le. Nous analysons les premiers r&#233;sultats de leur application.
</p>
<p>Abstract We present a model for the representation of opinions, by analyzing the
elements which compose them and some properties. The model has an operating
counterpart, implemented in the form of a set of tags. For the automatic application of
these tags on Spanish texts, we work on the writing of contextual rules. A primary
subset of rules was written for the identification of some elements of the model. We
analyze the first results of their application.
</p>
<p>Mots-cl&#233;s : Identification d'opinions, Fouille de textes, Traitement automatique du
langage naturel.
</p>
<p>Keywords: Opinions Identification, Text Mining, Natural Language Processing.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AialaRos&#225;
</p>
<p>1 Introduction
Dans le cadre de la recherche d'information, l'identification d'opinions correspondantes
&#224; de diff&#233;rents &#233;nonciateurs pr&#233;sente des difficult&#233;s du point de vue du traitement
automatique. Savoir &#224; qui attribuer les expressions pr&#233;sentes dans un texte, dire si ces
opinions sont favorables ou pas envers un certain sujet, cela contribue &#224; l'interpr&#233;tation
du texte et &#224; y trouver des informations. Ce type d'analyse int&#233;resse aussi les syst&#232;mes
de questions-r&#233;ponses, par exemple quand il s&#8217;agit de r&#233;pondre &#224; des questions du type
(Qu'elle est l&#8217;opinion de la France sur la guerre d'Irak?).
</p>
<p>Le travail que nous pr&#233;sentons a comme objectif l'identification de segments de texte
qui contiennent des opinions. Nous visons &#224; rep&#233;rer des marques formelles qui puissent
&#234;tre reconnues par un syst&#232;me automatique. Nous identifions les &#233;l&#233;ments qui expriment
l'opinion et nous proposons un mod&#232;le pour les repr&#233;senter formellement. Ce mod&#232;le
conceptuel donne lieu &#224; un mod&#232;le op&#233;ratoire qui servira de base au syst&#232;me
d'identification automatique des opinions et des &#233;l&#233;ments qui les composent. Il s'agit
d'un syst&#232;me bas&#233; sur des r&#232;gles symboliques, qui peut &#234;tre int&#233;gr&#233; &#224; un outil pour
l'application en cha&#238;ne de plusieurs modules de traitement automatique de textes.
</p>
<p>Ce travail fait partie, d'une part, d'un projet qui vise &#224; la d&#233;finition d'un mod&#232;le du
discours, et d'autre part, d'un projet pour le d&#233;veloppement d'outils de recherche
d'information et de navigation textuelle. Les deux projets sont men&#233;s en collaboration
entre le laboratoire Modyco (Mod&#232;les, Dynamiques et Corpus) &#224; l&#8217;Universit&#233; Paris X,
(France), et l'&#233;quipe PLN (Traitement du Langage Naturel) &#224; la Universidad de la
Rep&#250;blica, (Uruguay). En ce qui concerne le mod&#232;le du discours, nous nous occupons
de l'identification des participants du discours et de l'attribution de chaque expression au
participant correspondant. Quant &#224; la navigation textuelle, l'identification des opinions
permet de d&#233;finir un parcours sur un texte suivant les opinions d'un certain participant
ou selon la polarit&#233; envers un sujet d&#233;termin&#233;.
</p>
<p>2 Travaux reli&#233;s
Nous pr&#233;sentons ici quelques travaux sur l'identification d'opinions dans des textes qui
sont proches de notre travail. Dans (Wiebe et al., 2005) les auteurs proposent un sch&#233;ma
pour la repr&#233;sentation d'opinions et d'&#233;motions (en anglais, private states). Le sch&#233;ma
inclut la source de l'opinion, le segment de texte qui contient l&#8217;expression linguistique
de l'opinion et quelques propri&#233;t&#233;s : intensit&#233; et polarit&#233;. Le sch&#233;ma est utilis&#233; pour
l'annotation manuelle d'un corpus de textes en anglais. En appliquant des techniques
d'apprentissage automatique sur ce corpus, les auteurs ont travaill&#233; sur la classification
d'opinions et d'&#233;motions selon leur intensit&#233; (Wilson et al., 2006) et sur des syst&#232;mes de
r&#233;ponse &#224; des questions sur des opinions (Stoyanov et al., 2004).
</p>
<p>D'autres travaux, comme (Ku et al., 2005) pour le chinois, qui aborde le probl&#232;me de la
classification de documents selon leur polarit&#233; envers un sujet et (Bethard et al., 2005)
pour l'anglais, qui s'occupe des opinions exprim&#233;es sous forme de proposition introduite
par un verbe d'opinion (dire, opiner), proposent aussi un sch&#233;ma pour annoter un corpus
sur lequel ils appliquent des techniques d'apprentissage automatique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Identificationautomatique de marques d'opinion dans des textes
</p>
<p>Notre premi&#232;re approche se fonde sur l'&#233;criture de r&#232;gles pour l'identification d'opinions
dans des textes en espagnol. Nous envisageons une deuxi&#232;me &#233;tape o&#249; nous
appliquerons des techniques statistiques. Notre mod&#232;le pour repr&#233;senter les opinions
ressemble aux sch&#233;mas propos&#233;s dans les travaux mentionn&#233;s ci-dessus. Mais &#224; la
diff&#233;rence de (Wiebe et al., 2005), qui cherchent &#224; rep&#233;rer toute expression subjective
dans un texte, m&#234;me celles exprim&#233;es par l'auteur du texte, nous cherchons &#224; identifier
des segments contenant d'opinions provenant d'autres sources, rapport&#233;es par l'auteur du
texte, pas n&#233;cessairement &#224; connotation subjective. Par rapport au travail de (Bethard et
al., 2005), nous rep&#233;rons les opinions propositionnelles mais aussi des opinions
exprim&#233;es au moyen d'autres constructions linguistiques, comme des phrases nominales
o&#249; le nom est d&#233;riv&#233; d'un verbe d'opinion (les opinions de ...) et des expressions
introduites par selon, d'apr&#232;s, &#224; l'avis de, etc.
</p>
<p>En ce qui concerne la d&#233;finition du mod&#232;le pour repr&#233;senter les opinions, nous avons
&#233;tudi&#233; des travaux de s&#233;mantique lexicale &#224; partir desquels nous avons analys&#233; les
classes de verbes et de noms qui s'emploient normalement dans les expressions
d'opinions ainsi que leur structure argumentale. D'une part, FrameNet (Subirats-
R&#252;ggeberg, 2003) mod&#232;lise cette information, mais la version pour l'espagnol n'est pas
encore compl&#232;te. D'autre part, nous avons consult&#233; le projet ADESSE (Garc&#237;a-Miguel,
2005), con&#231;u pour d&#233;crire les verbes de l'espagnol : il y a une classification s&#233;mantique
des verbes et une description des sch&#233;mas syntaxiques d'apparition de chaque classe de
verbes. M&#234;me si ADESSE ne s'occupe pas des noms, nous consid&#233;rons que les noms
d&#233;riv&#233;s des verbes qui nous int&#233;ressent h&#233;ritent d'eux les propri&#233;t&#233;s s&#233;mantiques et
syntaxiques.
</p>
<p>3 Mod&#232;le conceptuel
Nous concevons l'opinion comme un objet conform&#233; par plusieurs &#233;l&#233;ments, dont le
principal est le pr&#233;dicat (verbal ou nominal). Les autres &#233;l&#233;ments repr&#233;sentent les
arguments de la pr&#233;dication : la source (personne, document, publication) &#224; laquelle on
peut attribuer l'opinion, le contenu de l'opinion et le sujet sur lequel porte l'opinion.
Nous avons d&#233;fini deux propri&#233;t&#233;s pour caract&#233;riser l'opinion: la polarit&#233; et l'intensit&#233;.
La valeur de ces propri&#233;t&#233;s d&#233;pend des &#233;l&#233;ments qui composent l'opinion, nous avons
d&#233;fini, donc, ces m&#234;mes propri&#233;t&#233;s pour chaque &#233;l&#233;ment de l'opinion. &#192; partir des
valeurs de polarit&#233; et d'intensit&#233; des &#233;l&#233;ments, les valeurs finales de polarit&#233; et
d'intensit&#233; sont calcul&#233;es.
</p>
<p>L'image ci-dessous montre le mod&#232;le &#233;tabli pour repr&#233;senter les opinions.
</p>
<p>OPINION
* Polarit&#233;_O (Polarit&#233;_P o Polarit&#233;_So o Polarit&#233;_Su o Polarit&#233;_C)
* Intensit&#233;_O (Intensit&#233;_P o Intensit&#233;_So o Intensit&#233;_Su o Intensit&#233;_C)
</p>
<p>PREDICAT SOURCE SUJET CONTENU
* Polarit&#233;_P * Polarit&#233;_So * Polarit&#233;_Su * Polarit&#233;_C
* Intensit&#233;_P * Intensit&#233;_So * Intensit&#233;_Su * Intensit&#233;_C
</p>
<p>Image 1: Mod&#232;le conceptuel pour repr&#233;senter une opinion</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AialaRos&#225;
</p>
<p>Le mod&#232;le propos&#233; s'inspire principalement des exemples observ&#233;s dans un corpus de
textes de la presse uruguayenne1. Nous avons pris aussi quelques &#233;l&#233;ments du sch&#233;ma
propos&#233; par (Wiebe et al., 2005) et nous avons consult&#233; la classification, les sch&#233;mas et
la nomenclature du projet ADESSE. En particulier, nous avons travaill&#233; avec la classe
cognici&#243;n (cognition), et ses sous-classes conocimiento (connaissance) et creencia
(croyance), et avec la classe comunicaci&#243;n (communication), et ses sous-classes
valoraci&#243;n (&#233;valuation) et mandato (ordre).
</p>
<p>La d&#233;finition des deux propri&#233;t&#233;s, intensit&#233; et polarit&#233;, inspir&#233;e des travaux de (Mathieu,
2000), permet d'&#233;tablir des relations entre les opinions d'un texte selon leur diff&#233;rent
degr&#233; d'intensit&#233; (une opinion pourra &#234;tre plus faible ou plus forte qu'une autre) et leur
valeur de polarit&#233; (une opinion pourra &#234;tre contraire ou pas &#224; une autre).
</p>
<p>Le tableau 1 illustre les &#233;l&#233;ments de l'image 1 en montrant quelques exemples extraits
du corpus de travail. Dans les exemples, la source est marqu&#233;e en gris, le pr&#233;dicat est
en caract&#232;res gras, le sujet est soulign&#233; et le contenu est en caract&#232;res italiques.
Seul le premier exemple contient tous les &#233;l&#233;ments qui int&#232;grent l'opinion, pour le reste,
le sujet et le contenu ne sont pas toujours pr&#233;sents. En espagnol, les verbes peuvent
avoir un sujet syntaxique omis, comme dans Declar&#243; tambi&#233;n que ... ((Il/elle) a d&#233;clar&#233;
aussi que...). Dans ces cas il faut rechercher la source dans le contexte. M&#234;me si le
verbe a un pronom personnel comme sujet syntaxique, &#201;l declar&#243; tambi&#233;n que ..., il faut
trouver l'ant&#233;c&#233;dent du pronom pour obtenir la d&#233;nomination de la source.
</p>
<p>Nous consid&#233;rons tant des pr&#233;dicats verbaux, exemples 1, 2, 3 et 5, comme des pr&#233;dicats
nominaux, exemple 4. Dans le cas des pr&#233;dicats nominaux, il y a souvent un verbe
support, comme hacer (faire) dans l'exemple 4, duquel la source est le sujet syntaxique.
Dans d'autres cas, la source appara&#238;t comme compl&#233;ment du nom, introduit par la
pr&#233;position de, par exemple: las opiniones de la Iglesia Cat&#243;lica ... (les opinions de
l'&#201;glise Catholique ...).
En ce qui concerne la polarit&#233;, l'opinion peut &#234;tre neutre, positive ou n&#233;gative, par
rapport au sujet sur lequel on opine. Il faut regarder &#224; l'int&#233;rieur de tous les &#233;l&#233;ments
pr&#233;sents pour calculer la valeur de polarit&#233; de l'opinion toute enti&#232;re. Le pr&#233;dicat
reafirmaron (ont r&#233;affirm&#233;) a une polarit&#233; positive et rechazaron (ont refus&#233;) a une
polarit&#233; n&#233;gative, &#224; partir de ces valeurs, on peut dire que l'opinion est positive pour le
premier cas et n&#233;gative pour le deuxi&#232;me. Les pr&#233;dicats respondi&#243; (a r&#233;pondu), opini&#243;n
(opinion) et dijo (a dit) ont une polarit&#233; neutre. Pourtant, pour l'opinion de l'exemple 4,
le sujet introduit par contraria a (contre) a une polarit&#233; n&#233;gative, l'opinion sera donc
n&#233;gative. D'autre part, pour l'exemple 5, &#224; l'int&#233;rieur de l'&#233;l&#233;ment contenu on trouve le
mot alentadoras (encourageantes), qui donne au contenu et &#224; l'opinion compl&#232;te une
polarit&#233; positive. On peut penser aussi &#224; des &#233;l&#233;ments qui peuvent modifier la polarit&#233;
de la source, par exemple, certains adjectifs comme enthousiasm&#233; dans la phrase
Enthousiasm&#233; par la proposition, le pr&#233;sident a dit que ...
</p>
<p>1 Le corpus est compos&#233; de 75 textes d'environ 500 mots.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Identificationautomatique de marques d'opinion dans des textes
</p>
<p>Texte originel Traduction
</p>
<p>Ex. 1 Consultado sobre la lentitud de los
procesos judiciales uruguayos
Carranza respondi&#243;: &quot;Hay una
</p>
<p>situaci&#243;n de un muy alto n&#250;mero de
presos sin condena, hay que agilizar
</p>
<p>los procesos&quot;.
</p>
<p>Consult&#233; au sujet de la lenteur des
processus judiciaires uruguayens
Carranza a r&#233;pondu : &quot;Il y a une
</p>
<p>situation d'un tr&#232;s grand nombre de
prisonniers sans condamnation, il faut
</p>
<p>acc&#233;l&#233;rer les processus&quot;.
</p>
<p>Ex. 2 Las autoridades uruguayas
reafirmaron hoy su compromiso en
el cuidado del agua y de su uso como
un aporte a las futuras generaciones.
</p>
<p>Les autorit&#233;s uruguayennes ont
r&#233;affirm&#233; aujourd'hui leur compromis
dans le soin de l'eau et de son usage
comme un apport aux g&#233;n&#233;rations
</p>
<p>futures.
Ex. 3 Mientras que otros sectores como el
</p>
<p>Partido Comunista, Asamblea
Uruguay, el Partido Socialista y
</p>
<p>Alianza Progresista rechazaron la
propuesta.
</p>
<p>Alors que d'autres secteurs comme le
Parti Communiste, Assembl&#233;e
</p>
<p>Uruguay, le Parti Socialiste et l'Alliance
Progressiste ont refus&#233; la proposition.
</p>
<p>Ex. 4 La Iglesia Cat&#243;lica tambi&#233;n hizo
p&#250;blica su opini&#243;n, contraria a
</p>
<p>cualquier tipo de despenalizaci&#243;n.
</p>
<p>L'&#201;glise Catholique a aussi fait
publique son opinion, elle est contre
</p>
<p>toute d&#233;p&#233;nalisation.
</p>
<p>Ex. 5 El vicepresidente de Instituto
Nacional de Carnes de Uruguay,
</p>
<p>Fernando P&#233;rez Abella, dijo que las
conclusiones son muy alentadoras.
</p>
<p>Le vice-pr&#233;sident de l'Institut National
de Viandes de l'Uruguay, Fernando
</p>
<p>P&#233;rez Abella, a dit que les conclusions
sont tr&#232;s encourageantes.
</p>
<p>Tableau 1: Exemples extraits du corpus
</p>
<p>Pour l'intensit&#233;, nous avons d&#233;fini trois degr&#233;s : faible, neutre et forte. L'intensit&#233; de
l'opinion d&#233;pend de tous les &#233;l&#233;ments qui la composent. Les pr&#233;dicats opiner, dire,
r&#233;pondre ont une intensit&#233; neutre, tandis que r&#233;affirmer a une intensit&#233; forte. Nous
n'avons pas trouv&#233; dans le corpus des pr&#233;dicats d'intensit&#233; faible. &#192; l'int&#233;rieur de
l'&#233;l&#233;ment contenu il peut y avoir des &#233;l&#233;ments qui affectent l'intensit&#233;, dans l'exemple 5
on pourrait bien trouver muy alentadoras (tr&#232;s encourageantes). Dans ce cas, en plus
d'une polarit&#233; positive, le contenu, et aussi l'opinion, auraient une intensit&#233; forte.
</p>
<p>3 Mod&#232;le op&#233;ratoire
Pour le traitement automatique nous avons d&#233;fini, &#224; partir du mod&#232;le conceptuel, un
ensemble d'&#233;tiquettes pour d'indiquer la pr&#233;sence d'une opinion dans un texte sous la
forme d'une annotation de type XML. Les &#233;l&#233;ments qui composent l'opinion sont</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AialaRos&#225;
</p>
<p>repr&#233;sent&#233;s comme des &#233;l&#233;ments de XML et les propri&#233;t&#233;s qui caract&#233;risent les &#233;l&#233;ments
sont repr&#233;sent&#233;es comme des attributs de XML.
</p>
<p>Pour un texte donn&#233;, le but du traitement est d'y incorporer les &#233;tiquettes pour marquer
les opinions et les &#233;l&#233;ments qui les composent, ainsi que d&#180;&#233;tablir les valeurs pour les
attributs intensit&#233; et polarit&#233;.
</p>
<p>5 Exp&#233;rimentation
Lors d'une premi&#232;re &#233;tape, nous avons travaill&#233; sur l'annotation manuelle d'un sous-
ensemble de 7 textes, afin de valider le mod&#232;le d&#233;fini. Sur le corpus entier, nous avons
cherch&#233; des r&#233;gularit&#233;s qui ont permis d'&#233;crire des r&#232;gles pour l'identification des
&#233;l&#233;ments et l'&#233;tablissement des valeurs des attributs. Dans cette &#233;tape, nous nous
sommes consacr&#233;s &#224; la t&#226;che de reconna&#238;tre le pr&#233;dicat et la source.
</p>
<p>Pour l'identification des autres &#233;l&#233;ments et l'&#233;tablissement de la valeur de polarit&#233; et
d'intensit&#233; il faudra &#233;crire des nouvelles r&#232;gles. L'incorporation de r&#232;gles ne pr&#233;sente pas
de probl&#232;mes, il suffit d'&#233;tablir un ordre coh&#233;rent pour leur application.
</p>
<p>Les r&#232;gles sont &#233;crites suivant le formalisme de r&#232;gles contextuelles d&#233;fini dans
(Wonsever et Minel, 2001) augment&#233; gr&#226;ce &#224; l'incorporation d'un m&#233;canisme qui permet
d'imposer des conditions sur les &#233;l&#233;ments qui composent les r&#232;gles. Voici la syntaxe des
r&#232;gles contextuelles :
</p>
<p>&#233;tiquette# contexte gauche &gt;&gt; corps &lt;&lt; contexte droit // conditions .
</p>
<p>Cette r&#232;gle &#233;tabli que si un segment de texte qui s'unifie avec le corps est pr&#233;c&#233;d&#233; par un
segment de texte qui s'unifie avec le contexte gauche et est suivi d'un segment de texte
qui s'unifie avec le contexte droit, alors ce premier segment sera &#233;tiquet&#233; par l'&#233;tiquette
sp&#233;cifi&#233;e avant le signe #. S'il y a des conditions d&#233;finies apr&#232;s le signe //, il faudra
qu'elles soient satisfaites.
</p>
<p>Pour &#233;crire et tester les r&#232;gles, on utilise la plate-forme informatique Lavinia
(LAVINIA, 2007) d&#233;velopp&#233;e par l'&#233;quipe PLN. Cet outil contient un module
sp&#233;cifique pour l'application de r&#232;gles contextuelles qui permet de travailler d'une fa&#231;on
rapide et simple. Ce module n&#233;cessite l'application pr&#233;alable d'un module pour
l'&#233;tiquetage morpho-syntaxique qui utilise l'&#233;tiqueteur FreeLing (FREELING, 2007).
</p>
<p>Pour le rep&#233;rage des pr&#233;dicats, il convient d'&#233;crire une r&#232;gle pour les verbes et une r&#232;gle
pour les noms. Chaque r&#232;gle aura une condition pour exiger que le lemme appartienne &#224;
une liste de verbes et noms d'opinion. Ces deux r&#232;gles ont les contextes gauche et droit
vides. Il sera n&#233;cessaire d'enrichir ces r&#232;gles pour r&#233;soudre des probl&#232;mes d'ambigu&#239;t&#233;
qui peuvent se poser pour certains pr&#233;dicats. La d&#233;sambigu&#239;sation sera trait&#233;e par
l'analyse des contextes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Identificationautomatique de marques d'opinion dans des textes
</p>
<p>Les r&#232;gles, au nombre de 12, qui identifient la source s'appuient sur la pr&#233;sence d'un
pr&#233;dicat marqu&#233; par l'une des r&#232;gles ant&#233;rieures. Il faut tenir compte de plusieurs cas :
</p>
<p>&#8226; Pour un pr&#233;dicat verbal, la source est une phrase nominale qui appara&#238;t avant le
pr&#233;dicat, &lt;Cores&gt; dijo a Brecha ... (Cores a dit &#224; Brecha ...), ou bien apr&#232;s le
pr&#233;dicat, ...afirm&#243; a Brecha &lt;el arque&#243;logo Lenoel Cabrera&gt; (a affirm&#233; &#224;
Brecha l'arch&#233;ologue Leonel Cabrera).
</p>
<p>&#8226; Pour un pr&#233;dicat nominal, la source est une phrase pr&#233;positionnelle introduite
par la pr&#233;position de, qui appara&#238;t apr&#232;s le pr&#233;dicat, Una de las propuestas &lt;de
la OMPI&gt; (L'une de propositions de l'OMPI ...).
</p>
<p>&#8226; Pour un pr&#233;dicat verbal o&#249; le verbe est au participe pass&#233; (voix passive), la
source est le compl&#233;ment d'agent, introduit par la pr&#233;position par, ... propuesto
&lt;por Seregni&gt; (propos&#233; par Seregni).
</p>
<p>Une autre r&#232;gle a &#233;t&#233; &#233;crite pour les opinions o&#249; il n'y a pas un verbe ou un nom comme
pr&#233;dicat, mais une expression comme selon, pour ou &#224; l'avis de.
</p>
<p>6 Premiers r&#233;sultats et travails futurs
</p>
<p>Nous avons appliqu&#233; les r&#232;gles pour les pr&#233;dicats et les sources sur un corpus d'environ
44.000 mots. Nous travaillons actuellement sur l'&#233;valuation des r&#233;sultats obtenus.
</p>
<p>En ce qui concerne l'identification du pr&#233;dicat, nous avons rep&#233;r&#233; des occurrences de
verbes de notre liste dans des contextes o&#249; ils ne sont pas employ&#233;s pour exprimer des
opinions. C'est le cas, par exemple, de verbes qui se trouvent &#224; l'int&#233;rieur de locutions
comme es decir (c'est &#224; dire) ou de verbes qui ont plusieurs significations possibles,
comme dans l'exemple La definici&#243;n 41 dice que ... (La d&#233;finition 41 dit que ...). Il
faudra &#233;crire des r&#232;gles pour r&#233;soudre ces ambigu&#239;t&#233;s.
</p>
<p>Nous n'avons pas encore travaill&#233; sur l'identification de sources pour les verbes qui ont
un sujet omis. Nous ne sommes pas arriv&#233;s non plus &#224; identifier les sources des verbes
en infinitif, comme dans l'exemple Los cient&#237;ficos se niegan a especular (Les
scientifiques ne veulent pas sp&#233;culer) o&#249; le verbe d'opinion qu'on marque comme
pr&#233;dicat est sp&#233;culer.
</p>
<p>Pour l'identification du contenu, puisque dans la plupart des opinions cet &#233;l&#233;ment a une
forme propositionnelle, on compte sur l'utilisation d'un outil pour la segmentation de
phrases en propositions (Caviglia et al., 2006). Il s'agit d'un syst&#232;me bas&#233; sur des r&#232;gles
contextuelles qui sera bient&#244;t int&#233;gr&#233; &#224; la plateforme Lavinia.
</p>
<p>En ce qui concerne les propri&#233;t&#233;s de l'opinion, il faudra travailler sur la classification
des verbes selon leur valeur de polarit&#233; et leur degr&#233; d'intensit&#233; et sur le rel&#232;vement de
mots, principalement des adverbes et des adjectifs, qui peuvent modifier les valeurs de
ces propri&#233;t&#233;s pour chaque &#233;l&#233;ment.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AialaRos&#225;
</p>
<p>Les r&#232;gles, &#233;crites pour l'espagnol, pourraient &#234;tre adapt&#233;es &#224; des langues comme le
fran&#231;ais ou le portugais. Cette possible adaptation sera analys&#233;e vers la fin du travail.
</p>
<p>Remerciements
</p>
<p>Ce travail b&#233;n&#233;ficie du soutien de ECOS-Sud (U05H01), du PDT (Programa de
Desarrollo Tecnol&#243;gico) du Minist&#232;re de Culture de l'Uruguay (2006-2008) et d'une
bourse de la R&#233;gion Ile de France (2008).
</p>
<p>R&#233;f&#233;rences
</p>
<p>BAKER C. F., FILLMORE C. J. &amp; LOWE J. B. (1998). The Berkeley FrameNet Project.
Proceedings of the COLING-ACL.
BETHARD S., YU H., THORNTON A., HATZIVASSILOGLOU V. &amp; JURAFSKY D. (2005).
Automatic Extraction of Opinion Propositions and their Holders. Computing Attitude
and Affect in Text: Theory and Applications. Editeurs: James G. Shanahan, Yan Qu,
Janyce Wiebe, Springer.
</p>
<p>CAVIGLIA S., COUTO J., ROS&#193; A. &amp; WONSEVER D. (2006). Un sistema para la
segmentaci&#243;n en proposiciones de textos en espa&#241;ol. Letras de hoje 144 (41). 89-101.
FREELING. (2007). http://garraf.epsevg.upc.es/freeling/.
</p>
<p>GARC&#205;A-MIGUEL J. M., COSTAS L. &amp; MART&#205;NEZ S. (2005). Di&#225;tesis verbales y esquemas
construccionales. Verbos, clases sem&#225;nticas y esquemas sint&#225;ctico-sem&#225;nticos en el
proyecto ADESSE. Entre sem&#225;ntica l&#233;xica, teor&#237;a del l&#233;xico y sintaxis. 373-384.
</p>
<p>KU L.-W., WU T.-H., LEE L.-Y. &amp; CHEN H.-H. (2005). Construction of an evaluation
corpus for opinion extraction. Proceedings of the 5th NTCIR Workshop Meeting, 513-
520.
</p>
<p>LAVINIA.(2007). Acc&#232;s en ligne. http://www.fing.edu.uy/inco/aplicaciones/Lavinia/.
</p>
<p>LAVINIA. (2007). Documentation et fichiers pour l'installation.
http://www.fing.edu.uy/inco/grupos/pln/recursos.html.
</p>
<p>MATHIEU Y. Y. (2000). Les verbes de sentiment. De l'analyse linguistique au traitement
automatique. Paris : CNRS &#201;ditions.
STOYANOV V., CARDIE C., LITMAN D. &amp; WIEBE J. (2004). Evaluating an Opinion
Annotation Scheme Using a New Multi-Perspective Question and Answer Corpus.
AAAI Spring Symposium on Exploring Attitude and Affect in Text: Theories and
Applications.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Identificationautomatique de marques d'opinion dans des textes
</p>
<p>SUBIRATS-R&#220;GGEBERG C. &amp; PETRUCK M. (2003). Surprise: Spanish FrameNet!,
Proceedings of CIL 17.
WIEBE J., WILSON T. &amp; CARDIE C. (2005). Annotating expressions of opinions and
emotions in language. Language Resources and Evaluation 39 (2-3), 165-210.
</p>
<p>WILSON T., WIEBE J. &amp; HWA R. (2006). Recognizing strong and weak opinion clauses.
Computational Intelligence 22 (2), 73-99.
</p>
<p>WONSEVER D., MINEL J.-L. (2004). Contextual Rules for Text Analysis. Lecture Notes
in Computer Science.</p>

</div></div>
</body></html>