<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Morphosyntaxe de l'interrogation pour le syst&#232;me de question-r&#233;ponse RITEL</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Recital 2008, Avignon, 9-13 juin 2008 
</p>
<p>Morphosyntaxe de l'interrogation pour le syst&#232;me de 
question-r&#233;ponse RITEL 
</p>
<p>Anne Garcia-Fernandez (1), Carole Lailler (2) 
 
</p>
<p>(1) LIMSI-CNRS &#8211; Universit&#233; Paris Sud, 
BP 133 - 91403 Orsay Cedex 
</p>
<p>annegf@limsi.fr 
(2) LIUM &#8211; Universit&#233; du Maine, 
</p>
<p>72085 Le Mans Cedex 9 
carole.lailler@lium.univ-lemans.fr 
</p>
<p>R&#233;sum&#233; Nous proposons d'&#233;tudier le cas de l'interrogation en Dialogue Homme-Machine 
au sein d'un syst&#232;me de Question-R&#233;ponse &#224; travers le prisme de la Grammaire Interactive. 
Celle-ci &#233;tablit un rapport direct entre question et r&#233;ponse et pr&#233;suppose que la 
morphosyntaxe d'une interrogation d&#233;pend d'une &#171; r&#233;ponse escompt&#233;e &#187;; l'interlocuteur 
humain ou machine ayant la possibilit&#233; de produire une r&#233;ponse effective divergente. Nous 
proposons d&#8217;observer la pr&#233;sence des diff&#233;rentes formes de questions dans un corpus issu de 
l&#8217;utilisation du syst&#232;me RITEL. Et nous pr&#233;sentons une exp&#233;rience men&#233;e sur des locuteurs 
natifs qui nous a permis de mettre en valeur la diff&#233;rence entre r&#233;ponses effectives produites 
par nos sujets et r&#233;ponses pr&#233;suppos&#233;es par le contenu intentionnel des questions. Les 
formalismes ainsi d&#233;gag&#233;s ont pour but de donner aux syst&#232;mes de DHM des fonctionnalit&#233;s 
nouvelles comme la capacit&#233; &#224; interpr&#233;ter et &#224; g&#233;n&#233;rer de la variabilit&#233; dans les &#233;nonc&#233;s 
produits. 
</p>
<p>Abstract In this paper we study the interrogation in Human-Computer Dialogue in order 
to integrate interpretative and dynamic functionnalities in a Question-Answering system using 
Interactive Grammar. It constitues a direct link between question and answer and assumes that 
the morphosyntax of interrogation depends on an anticipated answer. We propose an 
observation of question-answering corpora coming from the RITEL system showing the 
distribution of different morphosyntatic kinds of questions. Then we present an 
experimentation based on this observation in which French native speakers answer to those 
different kinds of questions. Our objective is to observe the difference between the anticipated 
answer and the effective one. 
</p>
<p>Mots-cl&#233;s : Grammaire Interactive ; mod&#232;les dynamiques ; dialogue homme-machine ; 
syst&#232;me de question-r&#233;ponse ; morphosyntaxe ; exp&#233;rimentation utilisateur ; formulation de 
r&#233;ponse ; 
 
</p>
<p>Keywords: Interactive Grammar ; dynamic models ; human-computer dialogue ; 
question-answering system ; morphosyntax ; user experimentation ; answer formulation ; 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Carole Lailler 
</p>
<p>1 Introduction 
Le point de d&#233;part de notre travail est d'&#233;laborer un paradigme de l&#8217;interrogation en fran&#231;ais 
moderne d&#233;clin&#233; en diff&#233;rentes versions selon le type de questions (quantification, 
localisation, temporalit&#233;, etc.). Nous avons travaill&#233; &#224; partir d'un corpus de Dialogue Homme-
Machine (DHM) &#224; travers le prisme de la Grammaire Interactive (GI) (Luzzati, 2006). En 
effet, d'une part, les interactions langagi&#232;res dans le cadre de l'oral spontan&#233; ne se limitent pas 
au respect ou au non-respect d'une norme grammaticale mais sont le r&#233;sultat d'&#233;nonc&#233;s per&#231;us 
et con&#231;us au fil de leur &#233;nonciation. D'autre part, bien que la th&#233;orie des actes de langage 
(Searle, 1969) autorise la planification des interactions, elle ne permet pas de lier contenu 
intentionnel des &#233;nonc&#233;s et ph&#233;nom&#232;nes morphosyntaxiques. Le fait m&#234;me d'&#233;tablir un lien de 
d&#233;pendance entre r&#233;ponse et question accr&#233;dite la validation d'un mod&#232;le grammatical par les 
productions elles-m&#234;mes. 
La formulation de la question &#233;tant conditionn&#233;e dans l'esprit du locuteur par une &#171; r&#233;ponse 
escompt&#233;e &#187; et par l'orientation qu'il veut donner &#224; son intervention, il s'agit moins 
d'appr&#233;hender un &#171; objet question &#187; captur&#233; &#224; l'instant t que d'expliciter, et &#224; terme de faire 
fonctionner en DHM, un processus d'interaction langagi&#232;re dynamique dans une utilisation 
r&#233;elle de la langue. La question est de savoir comment les variations morphosyntaxiques d'une 
question peuvent pr&#233;d&#233;terminer la forme de sa r&#233;ponse. La morphosyntaxe fournit des 
&#233;l&#233;ments tangibles de r&#233;flexion. On peut donc l&#233;gitimement s'y appuyer pour construire des 
mod&#232;les grammaticaux dynamiques impl&#233;mentables qui permettent une r&#233;elle analyse 
automatique liant question et r&#233;ponse. Les corpora d&#8217;&#233;nonc&#233;s de DHM t&#233;l&#233;phoniques issus de 
RITEL (Rosset, 2006) ont la particularit&#233; de pr&#233;senter de nombreuses reformulations d&#8217;une 
m&#234;me question et donc de comporter des &#233;chantillons de variation tr&#232;s large allant de la 
question sous sa forme la plus polie Je voudrais savoir o&#249; se trouve Paris &#224; la question la plus 
agressive Paris, c'est o&#249;? 
</p>
<p>Les syst&#232;mes de question-r&#233;ponse (SQR) ont pour objectif de permettre l'acc&#232;s &#224; une 
information en posant une question en langue naturelle &#224; laquelle le syst&#232;me propose une 
r&#233;ponse suppos&#233;e elle aussi en langue naturelle. De nombreuses &#233;tapes relevant de la 
recherche d'informations sont n&#233;cessaires pour trouver l'information &#224; retourner. Au-del&#224; de 
fournir la bonne information, nous nous attachons ici au fait que cette r&#233;ponse peut prendre 
plusieurs formes : elle peut &#234;tre un mot, une phrase, un extrait de document, accompagn&#233;e ou 
non d'une justification,... Ici, nous nous int&#233;ressons au niveau phrastique, c&#8217;est-&#224;-dire &#224; la 
formulation de la r&#233;ponse. Notre objectif est d&#8217;observer les r&#233;ponses de locuteurs et de 
montrer le lien entre la forme de la r&#233;ponse et la forme morphosyntaxique de la question afin 
d&#8217;utiliser cette derni&#232;re pour choisir la formulation de r&#233;ponse la plus adapt&#233;e 
linguistiquement &#224; la question. 
Des travaux ont d&#233;j&#224; montr&#233; l'importance de la forme syntaxique de la question dans la 
recherche de la r&#233;ponse mais les applications sont majoritairement l'expansion de la requ&#234;te et 
la recherche d'une r&#233;ponse exacte. (Ligozat, 2005) montre que la forme syntaxique de la 
question permet d'&#233;laborer de meilleurs patrons de recherche dans la phase de fouille de 
documents mais ne traite pas de la r&#233;alisation linguistique de la r&#233;ponse. (Mendes, 2004) 
montre l'importance de prendre en compte la structure syntaxique de la question dans la 
r&#233;ponse, mais s'appuie sur un domaine ferm&#233;. De plus, le choix de la formulation se fait a 
priori. Nous cherchons &#224; nous distinguer de telles approches d'une part car RITEL se veut de 
domaine ouvert, d'autre part car la GI cherche, par essence, &#224; prendre en compte la dynamicit&#233; 
de l'&#233;change dialogique. (Anaya, 2003) obtient des r&#233;ponses de locuteurs natifs sous forme de 
longues phrases qui sont analys&#233;es syntaxiquement et class&#233;es. Une analyse similaire est 
appliqu&#233;e aux questions. Apr&#232;s une analyse statistique, on d&#233;termine pour chaque forme 
syntaxique de question, la ou les formes syntaxiques de r&#233;ponses possibles. Cependant, cette 
&#233;tude ne propose pas d'&#233;valuation ou d'&#233;tude du lien entre question et r&#233;ponse. Ici, nous avons </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morphosyntaxe de l'interrogation pour le syst&#232;me de question-r&#233;ponse RITEL 
</p>
<p>tent&#233;, par un retour &#224; la morphosyntaxe, d'expliciter ce lien. De r&#233;cents travaux se sont centr&#233;s 
sur la formulation de la r&#233;ponse, notamment dans des cas de r&#233;ponses multiples ou peu s&#251;res. 
Ce sont principalement les travaux pr&#233;sent&#233;s dans la th&#232;se (Moriceau, 2007). 
Dans un premier temps, nous nous efforcerons de pr&#233;senter les mod&#232;les issus de la GI, 
notamment ceux des questions quantificatrices (QQ) en insistant sur leur caract&#232;re 
dynamique. Puis la pr&#233;sentation d&#8217;une &#233;tude exp&#233;rimentale observant et analysant les 
r&#233;ponses produites par des locuteurs face &#224; l'ensemble des types morphosyntaxiques de 
questions d&#233;finis par la GI, nous permettra de v&#233;rifier les liens entre formulation de la 
question et r&#233;ponse effective. 
</p>
<p>2 Grammaire Interactive et r&#233;ponses escompt&#233;es 
La GI des questions permet de mieux appr&#233;hender le spectre de variabilit&#233; autour d'une 
formulation interrogative prototypique et ce selon deux axes. Nous pr&#233;sentons le cas des 
questions quantificatrices (QQ) qui sont des questions dont la r&#233;ponse &#171; escompt&#233;e &#187; est une 
quantification (num&#233;rale ou non) par exemple Combien co&#251;te une baguette ? Ces questions 
trait&#233;es dans (Luzzati, 2006) et sont ici reprises car le travail &#233;voqu&#233; en troisi&#232;me partie de cet 
article est fond&#233; sur elles. Des versions d&#233;riv&#233;es pour les questions locatives, temporelles et en 
Entit&#233;s Nomm&#233;es ont &#233;t&#233; d&#233;velopp&#233;es (Lailler, &#224; para&#238;tre). 
</p>
<p> 
</p>
<p>1a adverbiale 1b num&#233;rale 1c d&#233;terminative 1d nominale 1e confirmative Objet vis&#233; 
</p>
<p>2a 
prototy
pique 
</p>
<p>Cb co&#251;te cette 
voiture 
</p>
<p>Cb d&#8217;&#8364; co&#251;te 
cette voiture 
</p>
<p>Quel prix co&#251;te 
cette voiture ? 
</p>
<p>Que co&#251;te cette 
voiture? 
</p>
<p>Cette voiture co&#251;te-
t-elle X &#8364; ? 
</p>
<p>rep&#233;rage 
quantitatif 
</p>
<p>2b 
tonique 
</p>
<p>Cette voiture 
co&#251;te cb? 
</p>
<p>Cette voiture 
co&#251;te cb d&#8217;&#8364; ? 
</p>
<p>Cette voiture 
co&#251;te quel prix? 
</p>
<p>Cette voiture 
co&#251;te quoi ? 
</p>
<p>Cette voiture co&#251;te 
(bien) X &#8364; ? 
</p>
<p>r&#233;alit&#233; du prix - 
alternative 
possible 
</p>
<p>2c 
renforc
</p>
<p>&#233;e 
</p>
<p>Cb est-ce que 
co&#251;te cette 
voiture? 
</p>
<p>Cb d&#8217;&#8364; est-ce 
que co&#251;te cette 
voiture ? 
</p>
<p>Quel prix est-ce 
que co&#251;te cette 
voiture ? 
</p>
<p>Qu&#8217;est-ce que 
co&#251;te cette 
voiture ? 
</p>
<p>Est-ce que cette 
voiture co&#251;te (bien) 
X &#8364; ? 
</p>
<p>quantification 
</p>
<p>2d 
p&#233;riphr
astique 
</p>
<p>Je voudrais 
savoir cb co&#251;te 
cette voiture?
  
</p>
<p>Je voudrais 
savoir cb d&#8217;&#8364; 
co&#251;te cette 
voiture? 
</p>
<p>Je voudrais 
savoir quel prix 
co&#251;te cette 
voiture ? 
</p>
<p>Je voudrais 
savoir ce que 
co&#251;te cette 
voiture ? 
</p>
<p>Je voudrais savoir 
si cette voiture 
co&#251;te (bien) X &#8364; ? 
</p>
<p>connaissance de 
la r&#233;ponse 
</p>
<p>2e 
assertiv
</p>
<p>e 
</p>
<p>Cette voiture 
co&#251;te X &#8364; ( ?) 
</p>
<p>Cette voiture 
co&#251;te X en &#8364; (?) 
</p>
<p>Le prix de cette 
voiture est (bien) 
de X &#8364;. ( ?) 
</p>
<p>Cette voiture 
co&#251;te bien 
quelque chose ? 
</p>
<p>C&#8217;est bien X &#8364; que 
co&#251;te cette voiture? 
</p>
<p>confirmation ou 
infirmation 
</p>
<p>R&#233;pons
e 
</p>
<p>son prix est de X 
&#8364;, pas &#224; vendre 
</p>
<p>neutralit&#233; 
</p>
<p>X &#8364;, pourquoi, 
c&#8217;est 0 &#8364; 
</p>
<p>num&#233;risation 
</p>
<p>pas cher/cher, 
rien 
</p>
<p>estimation 
</p>
<p>environ tant d&#8217;&#8364;, 
pas grand chose  
</p>
<p>estimation 
</p>
<p>oui, pas du tout 
confirmation / 
</p>
<p>infirmation 
</p>
<p> 
</p>
<p>Tableau 1 : Le mod&#232;le des QQ : questions dont la r&#233;ponse est une quantification adapt&#233; de (Luzzati, 2006) 
Nous sommes donc en pr&#233;sence de deux axes d'analyse (tableau 1). Le premier correspond &#224; 
un inventaire ontologique des questions. (Gruber, 1993) parle ainsi &#171; d&#8217;engagement 
ontologique minimal &#187; dans la mesure o&#249; l&#8217;ontologie a pour but de d&#233;finir un vocabulaire 
capable de circonscrire, en le d&#233;crivant, un domaine. Le second permet, quant &#224; lui, de 
mesurer le degr&#233; de pertinence de telle ou telle partie de la GI selon son contexte d&#8217;utilisation. 
Le premier axe (en ligne dans le tableau), propre &#224; l'expression du type mis en cause (la 
quantification dans notre cas, mais aussi la localisation, la temporalit&#233;,&#8230;), concerne la 
s&#233;mantique des questions. Il s'agit de faire varier de 1a &#224; 1e l'objet de la question et la r&#233;alit&#233; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Carole Lailler 
</p>
<p>de la mise en cause dont va d&#233;couler l'interrogation. La question prototypique correspond &#224; 
une interrogation neutre, qui n&#8217;induit rien de particulier et attend une r&#233;ponse simple, se 
limitant &#224; l&#8217;information requise. 
Le second axe (colonne), v&#233;ritable syntaxe de l'interrogation, concerne la formulation des 
questions et ce quel que soit le mot interrogatif. Ind&#233;pendamment du type m&#234;me de la 
question mis en cause, il s&#8217;agit de varier les possibilit&#233;s morphosyntaxiques de l&#8217;interrogation. 
De 2a &#224; 2e, les outils de l&#8217;interrogation ainsi que l&#8217;intonation changent; ce qui a pour but de 
mettre l&#8217;accent sur les multiples possibilit&#233;s d&#8217;effets de sens de la question. Sont ainsi mis en 
cause voire en d&#233;faut le locuteur ou son allocutaire (question tonique), leur ma&#238;trise de la 
r&#233;ponse (question p&#233;riphrastique), le prix (question renforc&#233;e, qui est, nous semble-t-il, la 
formulation la plus ordinaire), la r&#233;alit&#233; du prix demand&#233; ou une alternative sous-jacente 
(question confirmative). Il est n&#233;cessaire de ne pas perdre de vue que le mot interrogatif 
rel&#232;ve d&#8217;une classe grammaticale ou d&#8217;une autre suivant ce sur quoi le locuteur fait porter 
l&#8217;interrogation. En appr&#233;hendant plus pr&#233;cis&#233;ment et plus s&#251;rement le spectre de la variabilit&#233;, 
l&#8217;expression de l&#8217;interrogation en interaction sera davantage circonscrite tant 
morphosyntaxiquement que pragmatiquement. Certes, on acc&#232;de par la GI &#224; une 
intentionnalit&#233; qui n&#8217;est parfois qu&#8217;inconsciente. N&#233;anmoins, cette grammaire a le m&#233;rite de 
r&#233;ellement tenir compte de la variabilit&#233; du langage et, avec la g&#233;n&#233;ration, de l&#8217;exploiter. 
L&#8217;int&#233;r&#234;t n&#8217;est pas mince puisqu&#8217;on peut esp&#233;rer &#224; terme, aboutir &#224; des syst&#232;mes avec lesquels 
on acceptera de dialoguer. 
</p>
<p>L&#8217;axe ontologique de la quantification 
Le fran&#231;ais autorise l&#8217;expression de l&#8217;interrogation par des moyens morphologiquement 
diff&#233;rentiables o&#249; le mot interrogatif pointe sur la nature ontologique de la r&#233;ponse escompt&#233;e. 
On peut donc qualifier une question par combien d&#8217;adverbiale (1a). Cette derni&#232;re est dite 
prototypique et, de ce fait, v&#233;hicule un maximum de neutralit&#233;. Elle appelle un actant du verbe 
de sens quantitatif ou non. Une question utilisant le syntagme pr&#233;positionnel &#224; quel prix ou 
quel prix est d&#233;terminative (1c). Le locuteur fait, dans sa r&#233;ponse escompt&#233;e, une estimation 
quant &#224; la quantification. L&#8217;effet produit est ainsi moins neutre que dans le cas prototypique. 
Il ne s&#8217;agit pas de quantifier pr&#233;cis&#233;ment l&#8217;objet vis&#233; mais bel et bien de circonscrire un 
p&#233;rim&#232;tre o&#249; ce dernier doit se trouver. La question 1b est dite num&#233;rale car elle demande une 
formulation chiffr&#233;e. Seules ces trois types de questions sont r&#233;ellement quantitatifs. La 
question nominale (1d) est, quant &#224; elle, li&#233;e &#224; l&#8217;existence d&#8217;un verbe quantitatif permettant 
l&#8217;adjonction d&#8217;un que. De m&#234;me, avec inversion du sujet et/ou versation sur une question de 
type d&#233;terminatif, l&#8217;on obtient une question propositionnelle (ou une interrogation totale) qui 
ne cherche que la confirmation ou l&#8217;infirmation. Celle-ci ne devient quantitative qu&#8217;en 
pr&#233;sence d&#8217;un verbe &#224; valeur quantitative ou d&#8217;un possible contexte quantitatif accompagn&#233;, 
par exemple, d&#8217;un adverbe locatif &#233;valuatif cher/pas cher. 
Les diff&#233;rentes questions ont une port&#233;e sp&#233;cifique, dans la mesure o&#249; elles concernent le prix 
en lui-m&#234;me, une estimation de ce prix, sa r&#233;alit&#233; ou bien sa l&#233;gitimit&#233;. Les r&#233;ponses oscillent 
entre une r&#233;ponse positive qui va affirmer l&#8217;existence tangible du prix et d&#8217;une r&#233;ponse 
n&#233;gative qui va pr&#233;senter diverses fa&#231;ons de prendre parti entre la gratuit&#233; et le refus 
d'appr&#233;cier le prix (l&#8217;estimation, l&#8217;affirmation de l&#8217;erreur, l&#8217;infirmation). Le recours &#224; de telles 
formulations (diff&#233;rentes bien qu&#8217;appartenant au m&#234;me spectre) pr&#233;suppose bel et bien que le 
locuteur fait varier le statut de sa question et qu&#8217;il escompte, sinon des r&#233;ponses diff&#233;rentes, 
du moins des fa&#231;ons diff&#233;rentes de r&#233;pondre &#224; sa question. 
</p>
<p>L&#8217;axe de l&#8217;interrogation 
Parall&#232;lement &#224; la question qu&#8217;il souhaite poser, tout locuteur est en mesure de produire une 
formulation de cette m&#234;me question plus ou moins renforc&#233;e, et ce de diff&#233;rentes mani&#232;res. Il 
peut choisir de postposer l&#8217;outil interrogatif ; ce dernier devenant tonique (2b). Ainsi, la 
question Cette baguette co&#251;te combien ? qui est une interrogation tonique &#171; classique &#187; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morphosyntaxe de l'interrogation pour le syst&#232;me de question-r&#233;ponse RITEL 
</p>
<p>suppose un certain degr&#233; d'agressivit&#233;. Le locuteur est pour le moins agac&#233; de l'absence de 
r&#233;ponse ou de la volont&#233; de son allocutaire de ne pas r&#233;pondre. De plus, la question tonique 
Elle co&#251;te combien cette baguette ? induit un niveau suppl&#233;mentaire d&#8217;agressivit&#233;. Le 
locuteur, par ce proc&#233;d&#233; de clivage, peut, par exemple, sous-entendre que le prix de la 
baguette n'est pas l&#233;gitime car trop &#233;lev&#233;. L&#8217;allocutaire, lui aussi accus&#233;, ressent pleinement le 
degr&#233; d&#8217;agressivit&#233; du questionneur. Les faces de chacun ( voir par exemple (Goffman, 1974) 
et (Kerbrat-Orecchioni, 2005)) ne sont plus pr&#233;serv&#233;es et la conversation risque d&#8217;&#234;tre 
interrompue ou parasit&#233;e. 
D&#8217;autres formes de renforcement sont envisageables. La locution interrogative renforc&#233;e est-
ce que (2c), l&#8217;interrogation p&#233;riphrastique ou l&#8217;interrogation indirecte du type Je voudrais 
savoir (si) (2d) constituent autant de formes renforc&#233;es. Ce dernier &#233;nonc&#233; introducteur efface 
toutefois toute trace morphosyntaxique de l&#8217;interrogation. 
Les interrogations simples (2a), quant &#224; elles, engendrent &#8211; si le locuteur souhaite r&#233;pondre 
pleinement aux crit&#232;res de normativit&#233;&#8211; l&#8217;inversion du sujet Combien co&#251;te cette baguette ? 
ou la versation Combien cette voiture co&#251;te-t-elle ? et n&#8217;acceptent que difficilement la 
postposition sauf cas de focalisation C'est combien qu'elle co&#251;te cette voiture ? 
Enfin, l&#8217;interrogation assertive (2e), marqu&#233;e &#224; l&#8217;oral par l&#8217;intonation, ne permet l&#8217;insertion 
que dans le cadre du clivage Elle co&#251;te bien X euros, cette voiture ? et un marqueur de 
tonicit&#233; vient tr&#232;s souvent renforcer l'assertion. 
Il semble que la seule v&#233;ritable interrogation soit la question renforc&#233;e car elle seule a pour 
unique objet vis&#233; le prix et non son estimation ou sa l&#233;gitimit&#233;. L&#8217;interrogation p&#233;riphrastique 
est celle, qui de toutes, est la plus polie et celle qui m&#233;nage le plus l&#8217;allocutaire. En ne 
pr&#233;supposant pas qu&#8217;il doit conna&#238;tre la r&#233;ponse, on m&#233;nage sa face n&#233;gative, y compris s&#8217;il 
ne la conna&#238;t effectivement pas. C'est d&#8217;ailleurs la question la plus fr&#233;quente au sein de RITEL 
car le locuteur, soucieux de se faire comprendre de la machine, s'efforce de poser une 
question sous sa forme la plus claire et la plus polie. 
</p>
<p>En confrontant le mod&#232;le de la GI des QQ &#224; un corpus  d&#8217;&#233;nonc&#233;s de DHM et en  analysant 
les modalit&#233;s de cat&#233;gorisation des questions, nous pourrons &#233;galement mesurer le degr&#233; de 
pertinence du mod&#232;le et, le cas &#233;ch&#233;ant, le faire &#233;voluer en prenant notamment en compte les 
r&#233;ponses humaines apport&#233;es. 
</p>
<p> 1a 1b 1c 1d 1e Total 
</p>
<p>2a 4 32 14 0 0 50 (15,9%) 
</p>
<p>2b 0 2 0 0 0 2 (0,6%) 
</p>
<p>2c 0 5 0 0 1 9 (2,9%) 
</p>
<p>2d 5 146 97 0 2 250 (79,6%) 
</p>
<p>2e 0 3 0 0  3 (1,0%) 
</p>
<p>Total 9 (2,9%) 185 (58,9%) 117 (37,2%) 0 3 (1,0%) 314 
</p>
<p>Tableau 2 : Les r&#233;sultats &#8211; pr&#233;sence de QQ dans RITEL tir&#233; de (Luzzati, 2006) 
Le corpus RITEL est un corpus de requ&#234;tes utilisateurs du LIMSI (Galibert, 2005) (Rosset, 
2006) en situation de Dialogue Oral Homme Machine (DOHM) collect&#233; de septembre 2004 &#224; 
janvier 2005 dans lequel 13 personnes qui ont re&#231;u, &#224; titre d&#8217;exemple, une liste diff&#233;rente 
d&#8217;environ 300 questions ont appel&#233; un serveur, ce qui a donn&#233; lieu &#224; 582 dialogues qui 
comportent 5362 &#233;nonc&#233;s. Les locuteurs ob&#233;issaient &#224; une consigne simple : &#171; le syst&#232;me a 
beaucoup de mal &#224; reconna&#238;tre et &#224; comprendre ce que vous lui dites, mais il a besoin de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Carole Lailler 
</p>
<p>donn&#233;es pour apprendre : essayez d&#8217;obtenir des r&#233;ponses et de lui expliquer ce que vous 
cherchez &#187;. Il en r&#233;sulte un large corpus d&#8217;&#233;nonc&#233;s tr&#232;s divers que balaye de temps &#224; autre le 
mot interrogatif combien (cf. tableau 2). Les QQ se r&#233;partissent principalement en 314 
interrogations qui constituent soit la r&#233;it&#233;ration de plus en plus insistante d&#8217;une m&#234;me 
question, soit sa modulation, soit enfin l&#8217;int&#233;gration d&#8217;une QQ au sein d&#8217;une th&#233;matique. 
Les 314 QQ du corpus RITEL sont toutes cat&#233;gorisables &#224; l&#8217;aide des crit&#232;res de la GI. Pour 
quelques occurrences, des h&#233;sitations sont possibles quant &#224; la cat&#233;gorisation &#224; mettre en 
&#339;uvre (Luzzati, 2006) mais il est notable de constater que cette grammaire fonctionne comme 
un outil d&#8217;analyse de corpora qui n'ont pas &#233;t&#233; construits pour elle. 
</p>
<p>Le concept de r&#233;ponse escompt&#233;e permet donc de postuler qu&#8217;il existe une pr&#233;-r&#233;ponse ou du 
moins une image mentale de cette r&#233;ponse en fonction de laquelle se constitue la question 
pos&#233;e. Chaque locuteur aurait ainsi en sa possession un spectre de variabilit&#233; qu&#8217;il pourrait 
faire jouer en fonction de l&#8217;allocutaire, de ce qu&#8217;il sous-entend (consciemment ou non) et/ou 
de ce qu&#8217;il cherche &#224; obtenir comme information. 
</p>
<p>3 Observation de r&#233;ponses effectives par des locuteurs natifs 
La GI comme nous l'avons vu permet d&#8217;appr&#233;hender, selon la morphosyntaxe de la question, 
l'intentionnalit&#233; du locuteur et ce qu'il met en cause. Cependant, lorsqu'on pose une question 
tonique num&#233;rale par exemple, il se peut que la r&#233;ponse soit toute autre que la r&#233;ponse 
escompt&#233;e. Par exemple, &#224; la question Combien est-ce qu'une baguette de pain co&#251;te ?, une 
r&#233;ponse escompt&#233;e est : Une baguette co&#251;te (environ) 80 centimes d'euros mais des r&#233;ponses 
possibles sont : Une baguette co&#251;te environ 80 centimes; Une baguette peut co&#251;ter de 75 
centimes &#224; 1 euro; Je ne sais pas, moins d'un euro; Ca d&#233;pend, tu vas &#224; quelle boulangerie; 
Tu devrais le savoir;.... C'est le contexte et la volont&#233; du locuteur r&#233;pondant qui jouent. 
Conna&#238;t-il ou non la r&#233;ponse ? A-t-il envie de r&#233;pondre &#224; la question ? A-t-il besoin de plus de 
pr&#233;cision ? L&#8217;exp&#233;rimentation propos&#233;e ici permet l&#8217;observation des r&#233;ponses effectives face 
aux diff&#233;rentes formes morphosyntaxiques des questions d&#233;crites par la GI. 
</p>
<p>Nous proposons de comparer notre syst&#232;me de question-r&#233;ponse &#224; un utilisateur qui veut 
r&#233;pondre et va vraiment aller &#224; la recherche de la r&#233;ponse. En raison des probl&#232;mes - 
notamment de reconnaissance vocale &#8211; qui peuvent se poser, l&#8217;utilisateur cherchera &#224; 
confirmer les &#233;l&#233;ments identifi&#233;s dans la question au cours de sa r&#233;ponse. L'exp&#233;rimentation 
cherche donc &#224; pousser nos sujets &#224; r&#233;pondre sous forme de phrases plut&#244;t que par 
l'information r&#233;ponse brute. Nous avons ainsi fait appel &#224; des locuteurs natifs du fran&#231;ais en 
leur demandant de r&#233;pondre &#224; des questions suppos&#233;es pos&#233;es par des enfants de CM2 
pr&#233;parant des expos&#233;s sur diff&#233;rents th&#232;mes. Selon cette m&#234;me id&#233;e, les r&#233;ponses aux 
questions sont suppos&#233;es faciles &#224; trouver. Par ailleurs, cette &#233;tude concerne sp&#233;cifiquement 
les QQ et se d&#233;roule &#224; l'&#233;crit (au travers d'une interface web). Des &#233;tudes suivront permettant 
notamment d'observer les r&#233;ponses &#224; l'oral mais aussi de comparer les r&#233;ponses &#224; une m&#234;me 
question par un m&#234;me sujet, &#224; l'oral comme &#224; l'&#233;crit. 
L'objet vis&#233; (cf. tableau 1) joue un r&#244;le sur la formulation de la r&#233;ponse. Deux facteurs ont &#233;t&#233; 
pris en compte. D&#8217;une part, la quantification de l'objet de la question est-elle fixe ou bien 
varie-t-elle (en fonction d'une variabilit&#233; interne ou bien d'un param&#232;tre externe) ? En fonction 
de cet &#233;l&#233;ment, on recherche un type d'information diff&#233;rent : fixe, variable ou d&#233;pendant d'un 
param&#232;tre externe. D'autre part, nous supposons que le type de mesure concern&#233; joue un r&#244;le, 
en d'autres termes, nous supposons qu'on n&#8217;appr&#233;hende pas de la m&#234;me fa&#231;on des poids, des 
distances, des temp&#233;ratures, etc. Le but de l'&#233;tude n'est pas d'&#233;valuer l'impact de ces deux 
facteurs. Nous avons cependant constitu&#233; le corpus de questions tests en balayant diff&#233;rentes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morphosyntaxe de l'interrogation pour le syst&#232;me de question-r&#233;ponse RITEL 
</p>
<p>modalit&#233;s de ceux-ci afin d'&#233;viter un biais face au choix d'un unique type de mesure ou encore 
d'un unique type d'information. Le tableau 3 pr&#233;sente les 9 formes canoniques que nous avons 
fait varier selon les axes de la quantification et de l'interrogation propos&#233;e par la GI. Nous 
avons donc un total de 2071 questions test. 
</p>
<p> 
</p>
<p>Poids Espace/taille Temps/dur&#233;e 
</p>
<p>Fixe Combien p&#232;se une brique 
de lait ? 
</p>
<p>Combien mesure un double 
d&#233;cim&#232;tre ? 
</p>
<p>Combien dure un mandat 
pr&#233;sidentiel en France ? 
</p>
<p>Variable 
(interne) 
</p>
<p>Combien p&#232;se un b&#233;b&#233; &#224; la 
naissance ? 
</p>
<p>Combien mesure un b&#233;b&#233; &#224; la 
naissance ? 
</p>
<p>Combien dure une 
grossesse ? 
</p>
<p>Param&#232;tre 
(externe) 
</p>
<p>Combien p&#232;se une bouteille 
d&#8217;eau ? 
</p>
<p>Combien mesure une feuille 
A4 ? 
</p>
<p>Combien dure un mois de 
f&#233;vrier ? 
</p>
<p>Tableau 3 : Questions canoniques utilis&#233;es pour l'exp&#233;rimentation 
La passation des tests a &#233;t&#233; pr&#233;vue pour permettre une comparaison d'au minimum 3 r&#233;ponses 
par question test c'est-&#224;-dire pour une m&#234;me forme morphosyntaxique, un m&#234;me type de 
mesure et un m&#234;me type d'information. On a donc un minimum de 27 r&#233;ponses comparables 
pour un m&#234;me type morphosyntaxique ; chaque sujet &#233;tant face &#224; un total de 18 questions. 
Observation des r&#233;sultats 
L&#8217;analyse des r&#233;ponses s&#8217;est faite selon une s&#233;rie de variables d&#8217;observation (explicit&#233;es au 
fur et &#224; mesure par la suite et list&#233;es dans le tableau 4) qui en permettent une vue synth&#233;tique. 
Ces observations permettent de d&#233;crire l&#8217;ensemble des r&#233;ponses formul&#233;es par les utilisateurs. 
Aucune annotation n&#8217;exclut les autres : elles sont compl&#233;mentaires. Ce corpus de r&#233;ponses (le 
corpusR) est constitu&#233; de 594 r&#233;ponses. Nous tenons &#224; souligner que les variables 
d&#8217;observation ont &#233;t&#233; &#233;labor&#233;es uniquement au regard du corpusR, sans acc&#232;s ni aux 
questions, ni aux r&#233;ponses escompt&#233;es d&#233;crites par la GI et ce afin d&#8217;&#233;viter tout biais 
d&#8217;annotation. 
</p>
<p>Observations : 
</p>
<p>fe
rm
</p>
<p>&#233;e
 
</p>
<p>co
m
</p>
<p>pl
&#233;t
</p>
<p>iv
e 
</p>
<p>do
u
</p>
<p>te
 
</p>
<p>es
tim
</p>
<p>at
io
</p>
<p>n
 
</p>
<p>su
gg
</p>
<p>es
tio
</p>
<p>n
 
</p>
<p>re
pr
</p>
<p>ise
 
</p>
<p>ex
pr
</p>
<p>es
sio
</p>
<p>n
 
</p>
<p>fa
ct
</p>
<p>eu
r 
</p>
<p>ho
rs
</p>
<p> 
su
</p>
<p>jet
 
</p>
<p>v
al
</p>
<p>en
ce
</p>
<p> 
</p>
<p>po
sit
</p>
<p>iv
e2
</p>
<p> 
</p>
<p>% du corpus annot&#233; positivement : 23% 14,5% 5% 16% 3,8% 19% 33,9% 2% 95% 
</p>
<p>Tableau 4 : Pourcentage d&#8217;annotations positives par variable d&#8217;observation 
</p>
<p>Les r&#233;ponses ferm&#233;es 
La variable r&#233;ponses ferm&#233;es concerne les r&#233;ponses par oui, non, effectivement, pas du tout, 
etc. Ce ne sont presque exclusivement que les questions 1e (questions propositionnelles - 80% 
d&#8217;entre elles) et 2e (assertives - 78% d&#8217;entre elles ) qui ont obtenu des r&#233;ponses ferm&#233;es (on a 
une occurrence sur 138 pour une question 1d2c). 68% des r&#233;ponses ferm&#233;es sont constitu&#233;es 
de cette r&#233;ponse ferm&#233;e seule. La liste des vocables utilis&#233;s est : oui, non, cela d&#233;pend, c&#8217;est 
plausible, possible, exactement, en effet. On a une seule occurrence de r&#233;ponse confirmatrice 
                                                 
</p>
<p>1
 9 x les 23 formes de questions 
</p>
<p>2
  Etant donn&#233; la nature des questions, nous ne nous attendions pas &#224; un grand nombre de r&#233;ponses &#224; valence 
</p>
<p>n&#233;gative ce qui est le cas (5%). 
</p>
<p>type de mesure 
type d&#8217;info. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Carole Lailler 
</p>
<p>(en effet pour la question 1d2c) type de r&#233;ponse escompt&#233;e pour les 2e. Les r&#233;ponses 
escompt&#233;es pour les 1e sont bel et bien celles choisies par nos sujets. Ce n&#8217;est pas le cas des 
questions 2e. 
</p>
<p>Les r&#233;ponses compl&#233;tives 
Une compl&#233;tion est d&#233;finie comme une r&#233;ponse anticipant les besoins de l&#8217;utilisateur. Par 
exemple : Oui. Avant &#231;a durait 7 ans mais &#231;a a chang&#233;. C&#8217;est notamment le cas, des r&#233;ponses 
explicatives et celles proposant des informations de calcul. On observe un taux de r&#233;ponses 
compl&#233;tives de 14,5%. N&#8217;ayant pas de corpus comparable, il est difficile d&#8217;&#233;valuer 
l&#8217;importance de ce pourcentage. Cependant , ces 14,5% repr&#233;sentent pr&#232;s de 90 occurrences 
de r&#233;ponses compl&#233;tives qui pourront &#234;tre &#233;tudi&#233;es et utilis&#233;es au sein de RITEL. Aucune 
r&#233;ponse escompt&#233;e n&#8217;est de nature compl&#233;tive. En fait, on peut supposer que la volont&#233; de 
compl&#233;ter la r&#233;ponse est propre au r&#233;pondant et n&#8217;est pas une attente particuli&#232;re exprim&#233;e par 
le questionnant. 
</p>
<p>Mises en cause : expression du doute et estimations 
On trouve dans le corpusR 28 r&#233;ponses contenant une expression du doute. Il s&#8217;agit 
d&#8217;expressions telles que il me semble que, je dirais, je sais pas trop, etc. Bien que les 
questions 2d (p&#233;riphrastiques) pr&#233;supposent un doute sur la ma&#238;trise de l&#8217;information et 
devraient donc laisser plus de place &#224; l&#8217;interlocuteur quant au fait de ne pas savoir ou d&#8217;avoir 
un doute sur sa propre connaissance, on a seulement 5% des 2d qui expriment un doute. La 
r&#233;partition (tableau 5) montre cependant que les expressions de doute ne correspondent pas 
particuli&#232;rement &#224; des questions 2d. 
</p>
<p>1a 1b 1c 1d 1e  2a 2b 2c 2d 2e 
</p>
<p>25% 32% 21% 18% 4%  18% 28% 11% 25% 18% 
</p>
<p>Tableau 5 : R&#233;partition des expressions de doute selon les axes horizontaux et verticaux 
</p>
<p>Les estimations sont une autre forme de doute qui concerne l&#8217;exactitude de la r&#233;ponse et non 
pas la ma&#238;trise de l&#8217;information. Elles couvrent 16% du corpus total et s&#8217;illustrent par des 
expressions telles que environ, en moyenne, g&#233;n&#233;ralement,.etc. Tout comme l&#8217;expression du 
doute, on n&#8217;observe pas de diff&#233;rence selon les deux axes de la GI. En revanche, les 
r&#233;partitions diff&#232;rent en fonction du type d&#8217;information et de mesure. 
Il semble donc, concernant la mise en cause, qu&#8217;il n&#8217;y a pas d&#8217;influence de la forme 
morphosyntaxique de la question sur la r&#233;ponse produite par nos sujets. 
Suggestions 
Les r&#233;ponses suggestives (22 occurrences) sont d&#233;finies comme contenant une aide &#224; 
l&#8217;utilisateur dans l&#8217;expression de son besoin d&#8217;information. Dans le corpusR, ces cas 
correspondent &#224; 91% &#224; des corrections (Que mesure un b&#233;b&#233; &#224; la naissance ? Tu veux dire 
&quot;Combien mesure un b&#233;b&#233; &#224; la naissance?&quot;, non?) c&#8217;est-&#224;-dire une r&#233;ponse par laquelle le 
sujet va exprimer que la question a &#233;t&#233; mal formul&#233;e ou bien est ambigu&#235;. Il est &#224; noter que 
nous n&#8217;envisageons pas de proposer de telles corrections &#224; nos utilisateurs. D&#8217;une part, le but 
d&#8217;un syst&#232;me de question-r&#233;ponse est diff&#233;rent, d&#8217;autre part les connaissances linguistiques du 
syst&#232;me RITEL sont insuffisantes. 
Dans l&#8217;ensemble, tr&#232;s peu de r&#233;ponses sont suggestives. 60% d&#8217;entre elles sont des 1d et 25% 
sont des 1d2a. On peut donc penser que de telles formulations sont consid&#233;r&#233;es comme 
maladroites ou impr&#233;cises par les utilisateurs. Au cours de l&#8217;annotation du corpus RITEL 
selon la GI des QQ, aucune occurrence de ce type de question n&#8217;avait d&#8217;ailleurs &#233;t&#233; relev&#233;e. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morphosyntaxe de l'interrogation pour le syst&#232;me de question-r&#233;ponse RITEL 
</p>
<p>Reprises 
Les cas de reprise sont plus int&#233;ressants : parce que le syst&#232;me commet des erreurs 
(notamment de reconnaissance vocale), il est primordial, dans la r&#233;ponse, de reformuler les 
&#233;l&#233;ments compris de la question. Donnant ainsi &#224; voir &#224; l&#8217;utilisateur les erreurs possibles, on 
confirme ces &#233;l&#233;ments et on offre l&#8217;opportunit&#233; &#224; l&#8217;utilisateur de les rectifier. Au sein de notre 
corpus, 1/5 des r&#233;ponses reprennent la question. Ce taux semble assez faible compte tenu du 
fait que, pour RITEL, il faudrait une reformulation syst&#233;matique. Quoi qu&#8217;il en soit, nous 
disposons de 114 occurrences sur lesquelles nous pourrons prendre exemple pour formuler 
nos reprises. 
</p>
<p>Expression d&#8217;un crit&#232;re et nombre de valeur num&#233;rique 
L&#8217;expression d&#8217;un crit&#232;re (qu&#8217;il soit restrictif ou s&#233;lectif) se r&#233;alise de diff&#233;rentes mani&#232;res 
dans le corpusR : par une condition (s&#8217;il arrive &#224; terme), par une &#233;num&#233;ration (5 ans depuis 
2002, avant il durait 7 ans), simplement en pr&#233;cisant le facteur (28 ou 29 jours, suivant les 
ann&#233;es), en indiquant la valeur choisie pour ce facteur (maintenant, oui), etc. 1 r&#233;ponse sur 3 
exprime un crit&#232;re. Ce r&#233;sultat est tr&#232;s int&#233;ressant car il montre la volont&#233; de la part des sujets 
(peut-&#234;tre due au contexte : il faut r&#233;pondre &#224; des enfants) d&#8217;&#234;tre pr&#233;cis dans leur r&#233;ponse. On 
n&#8217;observe aucune pr&#233;dominance de l&#8217;expression d&#8217;un facteur en fonction d&#8217;un type de 
question donn&#233;. 
En observant le nombre de valeur num&#233;rique r&#233;ponse3, on observe que dans 80% des cas 
d&#8217;expression d&#8217;un crit&#232;re, il y a plus d&#8217;une valeur num&#233;rique r&#233;pondue alors que c&#8217;est le cas 
pour seulement 16% des r&#233;ponses sans expression d&#8217;un crit&#232;re. Les sujets, plut&#244;t que de faire 
un choix, pr&#233;f&#232;rent l&#8217;exhaustivit&#233; et donnent une valeur r&#233;ponse pour chaque valeur du crit&#232;re 
qu&#8217;ils identifient. Ce r&#233;sultat am&#232;ne &#224; penser que donner une r&#233;ponse unique n&#8217;est pas la 
meilleure solution et ce quelle que soit la forme de la question. 
</p>
<p>Autres 
Afin de d&#233;crire totalement les r&#233;ponses, nous avons utilis&#233; la variable hors sujet pour les 
r&#233;ponses contenant du hors sujet (par exemple : Souvent trop longtemps. En ce moment, c'est 
5 ans.). Elles ne concernent que quelques cas isol&#233;s. 
Applications en question-r&#233;ponse 
Le seul lien de corr&#233;lation effectif entre forme morphosyntaxique de la question et r&#233;ponse 
produite se situe donc au niveau des r&#233;ponses ferm&#233;es. Nous ne pouvons donc pas utiliser 
directement les r&#233;sultats de cette exp&#233;rimentation au sein de notre syst&#232;me. Cependant, nous 
avons observ&#233; de nombreux faits qui permettront d'orienter la g&#233;n&#233;ration des r&#233;ponses au sein 
d'un SQR tel que RITEL. D'une part les formulations de r&#233;ponses obtenues nous serviront &#224; 
&#233;tablir des patrons morphosyntaxiques de r&#233;ponses pouvant &#234;tre directement utilis&#233;s par notre 
module de g&#233;n&#233;ration en langue. D'autre part nous conservons le but de formuler une r&#233;ponse 
en fonction du type de la question. Nous envisageons ainsi d'extraire des paires type de 
question - type de r&#233;ponses plus r&#233;currentes que d'autres. Ces types de question, s'ils ne 
correspondent pas &#224; une forme morphosyntaxique commune, serviront au moins &#224; choisir une 
formulation de la r&#233;ponse plus adapt&#233;e et nous permettront peut-&#234;tre d'observer des &#233;l&#233;ments 
de la question qui jouent plus concr&#232;tement un r&#244;le dans la formulation de la r&#233;ponse par nos 
sujets. Enfin nous disposons gr&#226;ce &#224; cette exp&#233;rimentation d'un corpus QR et d'un corpus de 
r&#233;ponses contenant de nombreuses paraphrases. L'avantage &#233;tant que toutes les r&#233;ponses sont 
av&#233;r&#233;es. 
</p>
<p>                                                 
</p>
<p>3
 Ce chiffre ne prend pas en compte le &#171; 2 &#187; dans, par exemple &#171; Oui, si la bouteille fait 2 litres &#187; et a &#233;t&#233; 
</p>
<p>pond&#233;r&#233; afin de ne consid&#233;rer les intervalles (donc deux valeurs num&#233;riques) comme une unique valeur 
num&#233;rique r&#233;ponse. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Carole Lailler 
</p>
<p>4 Conclusions et perspectives 
Nous avons pu montrer que la GI est efficace pour d&#233;crire le lien dynamique entre question et 
r&#233;ponse, et ce en s&#8217;appuyant sur la morphosyntaxe des questions. L&#8217;intentionnalit&#233; qu&#8217;elle 
v&#233;hicule d&#233;finit un ensemble de r&#233;ponses escompt&#233;es. Au sein d&#8217;un SQR, cette approche a 
pour but d&#8217;&#233;viter une interaction fig&#233;e et r&#233;barbative, v&#233;ritable n&#233;gation du dialogue. 
</p>
<p>Un apport majeur de l&#8217;exp&#233;rimentation est l&#8217;obtention d&#8217;un corpus av&#233;r&#233; de Q-R &#224; l&#8217;&#233;crit. 
Nous souhaitons &#224; pr&#233;sent pouvoir comparer ce corpus &#224; un corpus oral obtenu dans les 
m&#234;mes conditions. Cette exp&#233;rimentation a cependant pu montrer un &#233;cart certain entre 
r&#233;ponse escompt&#233;e et r&#233;ponse observ&#233;e. Le mod&#232;le ne peut donc pas &#234;tre utilis&#233; de fa&#231;on 
pr&#233;dictive. Reste toutefois &#224; savoir si les r&#233;ponses escompt&#233;es qu&#8217;il propose ne produisent pas 
chez le questionnant davantage de satisfaction. Une nouvelle exp&#233;rience de mesure de 
satisfaction face &#224; diff&#233;rents types de r&#233;ponses pour une m&#234;me question dont une r&#233;ponse 
escompt&#233;e est maintenant &#224; envisager.  
</p>
<p>R&#233;f&#233;rences 
ANAYA G., KOSSEIM L. (2003). Generation of natural responses though syntactic patterns. 
Actes de TALN Workshop Question-R&#233;ponse, 2003. 
GALIBERT O., ILLOUZ G., ROSSET S., (2005). Ritel : an Open-Domain, Human-Computer 
Dialog System. Actes d&#8217;Eurospeech&#8217;05. 
</p>
<p>GOFFMAN E. (1974). Les rites d&#8217;interaction, Paris : Edition de minuit. 
GRUBER TH. R. (1993). Formal ontology in conceptual analysis and knowledge 
representation, Kluwer academic Publishers. 
</p>
<p>KERBAT-ORECCHIONI K. (2005). Le discours en interaction, Paris : Armand Colin. 
LIGOZAT A. (2005). Apport de l'analyse syntaxique des phrases dans un syst&#232;me de questions-
r&#233;ponses. Traitement Automatique des Langues, vol. 46, n&#176;3, 103-125. 
</p>
<p>LUZZATI D. (2006). Essai de description interactive : l&#8217;exemple des questions quantificatrices. 
Colloque La quantification, 15p. A para&#238;tre. Consultable sur le site de l&#8217;auteur : http://www-
ic2.univ-lemans.fr/luzzati. 
</p>
<p>MENDES S., MORICEAU V. (2004). L&#8217;analyse des questions: int&#233;r&#234;ts pour la g&#233;n&#233;ration des 
r&#233;ponses. Actes de TALN Workshop Question-R&#233;ponse, 2004. 
MORICEAU V. (2007). Int&#233;gration de donn&#233;es dans un syst&#232;me question-r&#233;ponse sur le Web. 
Th&#232;se de doctorat en Informatique de l'Universit&#233; Paul Sabatier - Toulouse III. 
</p>
<p>ROSSET S., PETEL S. (2006). The Ritel Corpus - An annotated Human-Machine open-domain 
question answering spoken dialog corpus. Actes de LREC&#8217;06. 
</p>
<p>ROSSET S., GALIBERT O., ILLOUZ G., MAX A. (2007) Interaction et recherche d&#8217;information : 
le projet RITEL, de la langue fran&#231;aise. Actes de TAL, vol. 46 n&#176;3, 156-179. 
SEARLE J. R. (1969). Les Actes de Langage, essai de philosophie du langage Paris : Hermann.  </p>

</div></div>
</body></html>