<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me d'annotation des entit&#233;s nomm&#233;es du type personne pour la r&#233;solution de la r&#233;f&#233;rence</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Recital 2008, Avignon, 9-13 juin 2008 
</p>
<p>Un syst&#232;me d'annotation des entit&#233;s nomm&#233;es du type personne 
pour la r&#233;solution de la r&#233;f&#233;rence 
</p>
<p> 
</p>
<p>Elzbieta GRYGLICKA 
 
</p>
<p>(1) Laboratoire Math&#233;matiques et Aide &#224; la D&#233;cision &#8211; Thales R&amp;T, RD 128 
Palaiseau 
</p>
<p>elzbieta.gryglicka@thalesgroup.com 
(2) ALPAGE &#8211;Paris 7, 30 rue Ch&#226;teau des Rentiers, 75 013 Paris 
</p>
<p> 
</p>
<p>R&#233;sum&#233; Dans cet article nous pr&#233;sentons notre d&#233;marche pour l&#8217;annotation des expressions 
r&#233;f&#233;rentielles d&#233;signant les personnes et son utilisation pour la r&#233;solution partielle de la 
r&#233;f&#233;rence. Les choix effectu&#233;s dans notre impl&#233;mentation s'inspirent des travaux r&#233;cents dans 
le domaine de l'extraction d'information et plus particuli&#232;rement de la reconnaissance des 
entit&#233;s nomm&#233;es. Nous utilisons les grammaires locales dans le but d'annoter les entit&#233;s 
nomm&#233;es du type Personne et pour construire, &#224; partir des annotations produites, une base de 
connaissances extra-linguistiques. Les informations acquises par ce proc&#233;d&#233; sont ensuite 
utilis&#233;es pour impl&#233;menter une m&#233;thode de la r&#233;solution de la r&#233;f&#233;rence pour les syntagmes 
nominaux cor&#233;f&#233;rentiels. 
</p>
<p>Abstract The aim of this paper is to describe our approach for annotating of the referential 
mentions that refer to the entities which are the instances of Person. Our method is inspired by 
the recent work in information extraction and particularly the named entities recognition and 
classification task. Local grammars are used to identify this category of named entities and to 
generate an extra-linguistic knowledge base which is further used for the process of reference 
resolution. 
</p>
<p>Mots-cl&#233;s :   entit&#233;s nomm&#233;es, annotation, grammaires locales, Nooj, base de 
connaissances 
Keywords:   named entities, entity recongnition, local grammars, Nooj, knowledge base 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Elzbieta GRYGLICKA 
</p>
<p>1 Introduction 
La notion d'entit&#233; nomm&#233;e (EN) est intimement li&#233;e &#224; la t&#226;che d'extraction d'information 
d&#233;finie dans le cadre de Message Understanding Conferences (MUC) dans les ann&#233;es 90 (cf. 
MUC &#8211; 6, 1995, MUC &#8211; 7, 1998). Cette s&#233;rie de conf&#233;rences a permis l'&#233;mergence de la t&#226;che 
de la reconnaissance et de l'annotation de ces entit&#233;s, ainsi que la d&#233;finition de leur hi&#233;rarchie 
de base. Elle a &#233;galement mis en avant leur importance pour l'extraction d'informations et la 
r&#233;solution des anaphores. Depuis, un grand nombre d'outils, comme par exemple les syst&#232;mes 
Question/R&#233;ponse (Gaizauskas et al., 2005), ou les applications de veille strat&#233;gique (Saggion 
et al., 2007), utilisent cette technologie devenue entre temps mature. La reconnaissance des 
entit&#233;s nomm&#233;es consiste en effet en deux sous-t&#226;ches : la reconnaissance des noms propres et 
les expressions num&#233;riques dans le texte brut, et la classification des formes rep&#233;r&#233;es. 
L'application d&#233;crite dans le pr&#233;sent article s'appuie sur une interpr&#233;tation sp&#233;cifique de ces 
expressions. Nous proposons une strat&#233;gie d'annotation qui &#233;largit les motifs annot&#233;es &#224; des 
syntagmes nominaux &#233;tendus, par exemple, dans une proposition comme: Mais 
paradoxalement, le ministre d'&#201;tat charg&#233; de la Communication, Guillaume Soro, qui 
aurait d&#251; pr&#233;senter devant l'assembl&#233;e nationale le 20 octobre, le projet de loi (...) nous 
annotons le syntagme entier le ministre d'&#201;tat charg&#233; de la Communication, Guillaume 
Soro. Compte tenu de la diversit&#233; des cat&#233;gories des entit&#233;s nomm&#233;es et des structures qui 
peuvent les contenir, l'approche pr&#233;sent&#233;e se restreint uniquement &#224; des expressions du type 
Personne, qui correspondent &#224; des individus dont le nom propre a &#233;t&#233; cit&#233; dans le texte. Les 
noms propres pr&#233;sents dans le corpus ayant &#233;t&#233; pr&#233;alablement extraits, les annotations 
produites par notre module nous servent principalement &#224; acqu&#233;rir des informations. Ces 
informations sont ensuite structur&#233;es et mod&#233;lis&#233;s sous la forme d'une base de connaissances 
XML. Notre objectif inclut &#233;galement l'annotation des expressions se r&#233;f&#233;rant &#224; des personnes 
et qui ne sont pas accompagn&#233;es par un nom propre, et qui correspondent, selon les cas, aux 
descriptions d&#233;finies autonomes, ou descriptions cor&#233;f&#233;rentielles dans (Gardent, Manu&#233;lian, 
2005). Une approche de la r&#233;solution de la r&#233;f&#233;rence de ces expressions constitue donc un 
autre aspect du travail pr&#233;sent&#233; ici. La motivation premi&#232;re qui a inspir&#233; le travail pr&#233;sent&#233; 
dans cet article est la n&#233;cessit&#233; d'am&#233;liorer une application d'extraction de relations 
s&#233;mantiques existante en introduisant comme une &#233;tape de pr&#233;traitement, la r&#233;solution de la 
cor&#233;f&#233;rence (expressions purement anaphoriques, mais aussi des expressions cor&#233;f&#233;rentielles 
dont la r&#233;f&#233;rence n'est pas sp&#233;cifi&#233;e). Mais la m&#233;thode utilis&#233;e nous rapproche des applications 
cr&#233;&#233;es pour les besoins de peuplement d&#8217;ontologies (OPTM, Ontology Population from 
Textual Mentions), comme d&#233;fini dans (Magnini et al., 2006).    
</p>
<p>Dans la premi&#232;re partie de cet article nous pr&#233;sentons bri&#232;vement la probl&#233;matique des entit&#233;s 
nomm&#233;es, ses principaux aspects et les travaux r&#233;cents qui nous ont amen&#233;s &#224; proposer notre 
approche. La seconde partie est consacr&#233;e &#224; la description de l'algorithme de notre application. 
Il est bas&#233; sur l'annotation des syntagmes nominaux faisant r&#233;f&#233;rence &#224; une personne &#224; l'aide 
de grammaires locales. Dans cette partie nous expliquons aussi de quelle mani&#232;re nous 
repr&#233;sentons les informations acquises et le proc&#233;d&#233; de la r&#233;solution de la r&#233;f&#233;rence mis en 
&#339;uvre.  Les r&#233;sultats de cette approche sont analys&#233;s dans la troisi&#232;me partie de notre expos&#233;. 
</p>
<p>2 Reconnaissance des entit&#233;s nomm&#233;es et ses enjeux actuels 
La d&#233;finition classique d'une entit&#233; nomm&#233;e correspond &#224; celle donn&#233;e par (Poibeau, 2003) : 
Entit&#233; nomm&#233;e : ensemble des noms de personnes, d&#8217;entreprises et de lieux pr&#233;sents dans un 
texte donn&#233;. On associe souvent &#224; ces &#233;l&#233;ments d&#8217;autres syntagmes rep&#233;rables par des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'annotation des entit&#233;s nomm&#233;es du type Personne 
</p>
<p>grammaires locales comme les dates, les unit&#233;s mon&#233;taires, les pourcentages rep&#233;rables par 
les m&#234;mes techniques &#224; base de grammaires locales. 
</p>
<p>L&#8217;importance des entit&#233;s nomm&#233;es est principalement le r&#233;sultat de leur caract&#232;re purement 
r&#233;f&#233;rentiel, qui leur permet de jouer un r&#244;le fondamental dans les applications &#224; vis&#233;e 
industrielle (comme la veille strat&#233;gique, le r&#233;sum&#233; automatique). Depuis que la communaut&#233; 
TAL a pris conscience de ce fait, un grand effort de travail a &#233;t&#233; consacr&#233; &#224; leur bonne 
cat&#233;gorisation. Certains auteurs font m&#234;me l'impasse sur la reconnaissance de noms propres : 
(Maynard et al., 2001) en utilisant des listes de ces formes. La hi&#233;rarchie de base a &#233;t&#233; 
propos&#233;e pendant les conf&#233;rences (MUC &#8211; 6) : les entit&#233;s du type ENAMEX correspondent &#224; 
des noms propres de sous-cat&#233;gories : Personne, Organisation et Lieu ; TIMEX concerne les 
expressions temporelles, et NUMEX, les autres expressions num&#233;riques comme poids, 
mesures et valeurs mon&#233;taires. Beaucoup de travaux proposent des am&#233;liorations pour ce 
classement. Certains correspondent &#224; une perception plus large de ce ph&#233;nom&#232;ne, comme par 
exemple (Ferret et al., 2000) qui propose une cat&#233;gorie suppl&#233;mentaire: Fonction, qui n'est pas 
un nom propre, ni une expression num&#233;rique. Les travaux de (Sekine, 2004), sous l'influence 
de ACE (Automatic Content Extraction) d&#233;veloppent m&#234;me une hi&#233;rarchie d'environ 200 
cat&#233;gories, qui d'une part, augmente le nombre de types d'entit&#233;s reconnues, en ajoutant par 
exemple : Th&#233;orie, Crime, Minerai. Et propose, d'autre part, une classification plus pr&#233;cise 
pour les types existants. D'autres auteurs (Ehrmann, Jacquet, 2006) abandonnent m&#234;me ce jeu 
d'&#233;tiquettes classiques et proposent un syst&#232;me d'annotation bas&#233; sur les relations syntaxiques 
qui produit des cliques d'&#233;tiquettes correspondant aux diff&#233;rents contextes syntaxiques d'une 
entit&#233; nomm&#233;e. 
</p>
<p>Les travaux cit&#233;s correspondent &#224; une prise de conscience de la polys&#233;mie des expressions 
appel&#233;es entit&#233;s nomm&#233;es, exprim&#233;e dans (Poibeau, 2005). Dans notre d&#233;marche, qui r&#233;duit 
fortement le nombre de ph&#233;nom&#232;nes &#233;tudi&#233;s, nous pouvons nous concentrer sur quelques cas 
de polys&#233;mie qui concernent particuli&#232;rement les noms propres des personnes. Cela nous 
permet d'annoter uniquement les expressions qui font r&#233;f&#233;rence &#224; des entit&#233;s du type Personne, 
et &#224; &#233;viter les ph&#233;nom&#232;nes de transfert de sens, afin de ne pas reconna&#238;tre les motifs comme 
par exemple le prix F&#233;lix Houphou&#235;t Boigny. Une approche semblable est d&#233;crite dans 
(Magnini et al., 2006), dont les auteurs d&#233;finissent une t&#226;che de peuplement d&#8217;ontologies 
restreinte &#224; des mentions r&#233;f&#233;rant &#224; la cat&#233;gorie Personne. Le travail pr&#233;sent&#233; dans cet article 
correspond &#224; une volont&#233; d'&#233;tudier la vari&#233;t&#233; des formes qui peuvent correspondre &#224; un seul 
type d'entit&#233;. Une &#233;tude de corpus a pr&#233;c&#233;d&#233; la cr&#233;ation des grammaires locales. Dans le m&#234;me 
esprit, pour l'&#233;valuation de notre approche nous avons proc&#233;d&#233; &#224; une relev&#233; complet des 
expressions d&#233;signant les personnes. Une autre probl&#233;matique se rattachant &#224; celle des entit&#233;s 
nomm&#233;es est celle de la r&#233;f&#233;rence. Malgr&#233; une grande variabilit&#233; des formes et malgr&#233; un 
certain flou dans la d&#233;finition de cette notion (certains auteurs restreignent les entit&#233;s 
nomm&#233;es &#224; des noms propres et des expressions num&#233;riques, d'autres y ajoutent des termes 
sp&#233;cifiques pour un domaine, etc.) le fait que ces entit&#233;s font r&#233;f&#233;rence, soit &#224; des concepts, 
soit &#224; des objets r&#233;els du monde, ne semble pas sujet &#224; la discussion. Notamment, le 
ph&#233;nom&#232;ne de la cor&#233;f&#233;rence interdocumentaire pour les noms propres de personnes, a &#233;t&#233; pris 
en compte par (Saggion et al., 2007), qui propose un algorithme de clustering afin de d&#233;limiter 
les groupes de documents qui mentionnent la m&#234;me personne. Dans une autre perspective, 
notre approche permet de rendre explicite le lien cor&#233;f&#233;rentiel existant entre une entit&#233; 
nomm&#233;e de cat&#233;gorie Personne et le concept de Fonction (le pr&#233;sident de la R&#233;publique 
fran&#231;aise). C'est pr&#233;cis&#233;ment ce lien qui est utilis&#233; dans l'algorithme de la r&#233;solution de la 
r&#233;f&#233;rence impl&#233;ment&#233;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Elzbieta GRYGLICKA 
</p>
<p>3 Pr&#233;sentation de l&#8217;application 
Notre id&#233;e de d&#233;part a &#233;t&#233; inspir&#233;e par (Poibeau, 2005), qui propose d&#233;j&#224; l'utilisation de 
l'extraction d'information dans le but de r&#233;soudre les anaphores nominales. Notre m&#233;thode est 
bas&#233;e sur l'utilisation des patrons lexico-syntaxiques coupl&#233;s avec les ressources lexicales 
disponibles. La pierre angulaire de notre travail est l'id&#233;e que nous pouvons retrouver dans les 
textes un certain nombre de connaissances sur le monde extralinguistique. De nombreux 
travaux proposent des techniques d&#8217;apprentissage &#224; partir des sources de connaissances 
externes comme WordNet (Poesio et al., 1997, Meyer and Dale, 2002), ou m&#234;me comme des 
informations disponibles sur Internet, la Wikip&#233;dia par exemple (Kazama, Torisawa, 2007). 
Ces approches ont &#233;t&#233; d&#233;velopp&#233;es principalement pour traiter les textes en langue anglaise, et 
aucune ressource disponible pour le fran&#231;ais ne permet d&#8217;obtenir la couverture en relations 
s&#233;mantiques &#233;gale &#224; celle de WordNet. Dans le cadre de notre travail appliqu&#233; sur le corpus en 
fran&#231;ais, nous proposons une d&#233;marche dans la lign&#233;e de travaux de (Hearst, 1992). Cette 
approche est bas&#233;e sur l'extraction d'informations &#224; partir de corpus, per&#231;u comme une source 
de connaissances imm&#233;diatement disponibles et qui a comme principal avantage d&#8217;&#233;viter la 
surg&#233;n&#233;ration des entit&#233;s suppl&#233;mentaires (homonymes) pr&#233;sentes par exemple sur Internet. 
Les informations extraites &#224; partir du corpus sont ensuite analys&#233;es et pr&#233;sent&#233;es sous la forme 
d&#8217;une base de connaissances qui permet de d&#233;crire les diff&#233;rents types de liens entre les entit&#233;s 
de cat&#233;gorie Personne et les autres types d'entit&#233;s, principalement les Organisations (partis 
politiques, structures gouvernementales, lieux g&#233;ographiques). Notre cha&#238;ne de traitement se 
d&#233;compose en trois &#233;tapes, chacune faisant l'objet d'une section : 
</p>
<p>&#8226; L'annotation des syntagmes nominaux accompagn&#233;s par un nom propre. Les formes 
vis&#233;es pendant cette phase de traitement sont les syntagmes nominaux d&#233;finis, les 
appositions et les structures pr&#233;dicatives, qui constituent pour nous une source 
d'informations sur les personnes. 
</p>
<p>&#8226; L&#8217;extraction du contenu des annotations produites &#224; l'&#233;tape pr&#233;c&#233;dente, sa 
transformation et sa structuration sous la forme d'un fichier XML, qui sert de base de 
connaissances pour les &#233;tapes ult&#233;rieures. 
</p>
<p>&#8226; La mise en &#339;uvre de la strat&#233;gie de la r&#233;solution partielle de la r&#233;f&#233;rence. Elle d&#233;bute 
par une autre phase d'annotation. Les formes vis&#233;es dans cette &#233;tape sont, en plus de 
celles reconnues pr&#233;c&#233;demment : les noms propres seuls et les syntagmes nominaux 
non accompagn&#233;s par un nom propre. Cette strat&#233;gie nous permet de reconstituer des 
cha&#238;nes de cor&#233;f&#233;rence partielles (&#224; l'exclusion de formes pronominales) et, en utilisant 
les informations contenues dans notre base de connaissances, d'attribuer un nom &#224; des 
expressions du second type. 
</p>
<p>3.1 Strat&#233;gie d&#8217;annotation des entit&#233;s nomm&#233;es 
</p>
<p>Comme nous l'avons d&#233;j&#224; pr&#233;cis&#233;, nous avons fait le choix d'annoter les entit&#233;s nomm&#233;es de la 
cat&#233;gorie Personne en incluant les appositions et les pr&#233;dications qui les accompagnent. Ceci 
diff&#232;re de la pratique courante pour les applications de cat&#233;gorisation des entit&#233;s nomm&#233;es. Ce 
choix a &#233;t&#233; motiv&#233;, entre autres, par le fait que dans les textes journalistiques, qui constituent 
le corpus pour notre application, la plupart des expressions qui r&#233;f&#232;rent &#224; des personnes font 
partie des syntagmes &#233;tendus (environ 50%, contre 29% pour les noms propres apparaissant 
seuls). D'autres auteurs utilisent cette caract&#233;ristique pour aider la cat&#233;gorisation des entit&#233;s 
nomm&#233;es, par exemple d&#233;j&#224; mentionn&#233;es (Ehrmann, Jacquet, 2006). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'annotation des entit&#233;s nomm&#233;es du type Personne 
</p>
<p>Nous consid&#233;rons ces expressions comme une seule entit&#233; constitu&#233;e du couple (concept &#8211;
entit&#233; nomm&#233;e). Pour notre application, le concept correspond &#224; une fonction politique (ou 
m&#233;tier) occup&#233;e, dans le pr&#233;sent ou par le pass&#233;, par l'entit&#233; nomm&#233;e. Une autre motivation 
pour utiliser cette strat&#233;gie est le fait qu'elle permet facilement de se restreindre &#224; un seul 
ph&#233;nom&#232;ne, dans notre cas les personnes, et d'exclure de cette mani&#232;re un certain nombre 
d'ambigu&#239;t&#233;s. 
</p>
<p>Pour produire les annotations, nous avons utilis&#233; NooJ (Silberztein, 2002), qui est un 
environnement de d&#233;veloppement linguistique bas&#233; sur les transducteurs &#224; &#233;tats finis. Il se 
charge de toutes les &#233;tapes de pr&#233;traitement n&#233;cessaires &#224; un texte brut : la tokenisation, la 
segmentation et l'application des dictionnaires. NooJ offre &#233;galement une interface graphique 
facilitant la cr&#233;ation des patrons de reconnaissance sous la forme de graphes &#224; plusieurs 
niveaux, permettant ainsi de cr&#233;er des grammaires de reconnaissance. Le principal atout de 
cette application, exploit&#233; dans notre cas, est sa capacit&#233; &#224; produire des informations 
diff&#233;rentes en fonction des parcours dans les graphes de reconnaissance. Cette propri&#233;t&#233; nous 
a permis d&#8217;utiliser certaines informations syntaxiques (comme les relations en sein d&#8217;un 
groupe nominal), sans avoir a introduire d&#8217;analyse syntaxique dans la cha&#238;ne de traitement.   
</p>
<p>Nous allons pr&#233;senter maintenant les ressources linguistiques mises en &#339;uvre dans la phase 
d'annotation. Elles sont de deux types : les dictionnaires et les graphes de reconnaissance. 
Nous avons fait le choix d'utiliser les dictionnaires g&#233;n&#233;raux du fran&#231;ais. Par contre les 
graphes de reconnaissance ont &#233;t&#233; cr&#233;&#233;s sp&#233;cifiquement pour les besoins de l'application et en 
s'appuyant en grande partie sur les traits s&#233;mantiques pr&#233;sents dans ces dictionnaires. Nous 
utilisons entre autres : 
</p>
<p>&#8226; Le dictionnaire DELA distribu&#233; par Laboratoire d&#8217;Automatique Documentaire et 
Linguistique (LADL), qui comporte des traits s&#233;mantiques comme : +Hum, 
+HumColl, +Profession pour d&#233;crire les lexies susceptibles de d&#233;signer les entit&#233;s du 
type humain. 
</p>
<p>&#8226; Le dictionnaire Prolex-PaysCapitales diffus&#233; par le portail Tln du Laboratoire 
d'Informatique de l'Universit&#233; Fran&#231;ois-Rabelais de Tours, qui contient les 191 pays 
ind&#233;pendants (avec les capitales, les gentil&#233;s et les adjectifs toponymiques). Il utilise, 
entre autres, les traits s&#233;mantiques suivants : +Toponyme, +Pays, +Hum. 
</p>
<p>&#8226; En plus des noms propres inclus dans le dictionnaire de LADL, nous disposons 
&#233;galement d'une liste de 259 formes (noms des personnes, lieux g&#233;ographiques, 
organisations) adapt&#233;e &#224; notre corpus, extraites manuellement. 
</p>
<p>Le format de ces dictionnaires &#233;tant adapt&#233; pour Unitex nous avons &#233;t&#233; oblig&#233; d'effectuer 
quelques adaptations. Nous avons &#233;galement enrichi les listes des lexies portant le trait 
s&#233;mantique +Hum, pour garantir &#224; n&#244;tres grammaires une plus grande couverture. Nous avons 
cr&#233;&#233;e deux grammaires de reconnaissance ind&#233;pendantes : une pour la premi&#232;re &#233;tape de 
traitement, constitu&#233;e de 9 graphes &#224; plusieurs niveaux (Figure 1), et la deuxi&#232;me qui permet 
de cr&#233;er les cha&#238;nes de cor&#233;f&#233;rence (cf. chapitre 3.3). Les annotations produites par ces 
grammaires ont la forme suivante : 
</p>
<p>1. le Premier ministre Alassane Dramane Ouattara, &lt;personne titre = &quot;Premier 
ministre&quot;nom = &quot;Alassane Dramane Ouattara&quot; genre = &quot;masculin&quot;&gt; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Elzbieta GRYGLICKA 
</p>
<p>2. le chef de l'Etat nig&#233;rian, Olusegun Obasanjo qui est &#233;galement le pr&#233;sident en 
exercice de l'Union africaine, &lt;personne titre = &quot;chef de l'Etat&quot; nationalite = &quot;nig&#233;rian&quot; 
nom = &quot;Olusegun Obasanjo&quot; titre = &quot;pr&#233;sident en exercice&quot; org = &quot;union africaine&quot; 
genre = &quot;masculin&quot;&gt; 
</p>
<p>3. Ti&#233;moko Sanogo, &#233;lectricien &#224; Bouak&#233;, &lt;personne nom = &quot;Ti&#233;moko Sanogo&quot; titre = 
&quot;&#233;lectricien&quot; geo = &quot;Bouak&#233;&quot; genre = &quot;masculin&quot;&gt; 
</p>
<p> 
</p>
<p>Figure 1 : Graphe principal de la grammaire 
</p>
<p>3.2 Cr&#233;ation d&#8217;une base des connaissances 
</p>
<p>Un appel syst&#232;me vers NooJ qui applique les ressources d&#233;crites pr&#233;c&#233;demment produit 
comme r&#233;sultat une concordance avec toutes les expressions reconnues ainsi que tous les 
</p>
<p> 
</p>
<p>Figure 2 : La repr&#233;sentation d'informations dans la base de connaissances 
chemins possibles dans les graphes pour chacune de ces expressions. Nous analysons ces 
r&#233;sultats afin de produire un fichier XML, qui correspond &#224; notre base de connaissances. Les 
caract&#233;ristiques de l'information produite par ces grammaires, comme le fait que les 
informations &#224; propos d'une personne sont &#233;parses, souvent redondantes et parfois </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'annotation des entit&#233;s nomm&#233;es du type Personne 
</p>
<p>incompl&#232;tes, nous obligent de l'analyser en deux passes. La premi&#232;re &#233;tape consiste &#224; 
transformer les annotations produites sous la forme d'un fichier XML structur&#233; et &#224; regrouper 
toutes les annotations &#224; propos d'une personne au sein d'un m&#234;me &#233;l&#233;ment XML, ensuite dans 
la seconde &#233;tape nous supprimons les annotations redondantes. 
</p>
<p>Le r&#233;sultat de ces transformations est un fichier structur&#233; qui pr&#233;sente toutes les informations 
&#224; propos d'une personne sous la forme d'une liste d'&#233;l&#233;ments &quot;fonction&quot;, comme dans notre 
exemple &#224; propos de Henri Konan B&#233;di&#233; (Figure 2). 
</p>
<p>3.3 Traitement de la r&#233;f&#233;rence 
</p>
<p>Pour la troisi&#232;me et la derni&#232;re &#233;tape de traitement un nouveau jeu de graphes a &#233;t&#233; d&#233;velopp&#233; 
(une grammaire constitu&#233;e de 12 graphes). Cette fois-ci nous sommes &#224; la recherche : des 
noms propres seuls et des syntagmes nominaux non accompagn&#233;s par un nom propre, en plus 
des expressions annot&#233;es par la premi&#232;re grammaire. Les graphes sont pr&#233;vus pour ne pas 
annoter des cas o&#249; le nom propre fait partie d'une entit&#233; nomm&#233;e d'un autre type que Personne, 
comme dans l'exemple : (...) des agents doubles infiltr&#233;s pour pr&#234;ter main forte &lt;groupe&gt; aux 
partisans du sergent Ibrahim Coulibaly &lt;/groupe&gt;. Les annotations produites par cette 
grammaire constituent une liste d'expressions candidates pour cr&#233;er une cha&#238;ne de 
cor&#233;f&#233;rences, et elles ont la m&#234;me forme que celles des exemples 1. et 2. La r&#233;solution est 
bas&#233;e sur les fonctions des personnes, comme dans (Figure 2), et repose ainsi en partie sur le 
ph&#233;nom&#232;ne de la reprise lexicale qui correspond &#224; des titres comme : g&#233;n&#233;ral, colonel, etc. 
</p>
<p>L'algorithme se d&#233;roule de la fa&#231;on suivante. La premi&#232;re expression r&#233;f&#233;rentielle d&#8217;un texte 
ouvre une nouvelle cha&#238;ne de cor&#233;f&#233;rences. Les &#233;tapes de recherche commencent par la 
v&#233;rification du nom propre. Si l&#8217;annotation n'en contient pas nous r&#233;cup&#233;rons &#224; partir de notre 
base des connaissances une liste de personnes dont au moins une des fonctions poss&#232;de un 
attribut titre identique &#224; celui de l'annotation. Dans le but de r&#233;duire la liste de candidats la 
recherche se poursuit parmi d'autres attributs de la m&#234;me fonction, en priorit&#233; org, geo, qui 
sont consid&#233;r&#233;s comme fiables, contrairement &#224; par exemple desc qui contiennent des adjectifs 
qualificatifs. Dans le cas o&#249; nous ne disposons pas d'autres informations que le titre, nous 
exigeons que la personne soit d&#233;j&#224; pr&#233;sente dans une cha&#238;ne de cor&#233;f&#233;rences existante, dans le 
cas contraire nous abandonnons le processus de la r&#233;solution. 
</p>
<p>4 &#201;valuation des r&#233;sultats 
Deux modules de notre application n&#233;cessitent une &#233;valuation sp&#233;cifique et ind&#233;pendante. 
Nous voulons souligner le fait que les r&#233;sultats de la r&#233;solution de r&#233;f&#233;rence sont directement 
d&#233;pendants du contenu de la base de donn&#233;es et par cons&#233;quent de l'efficacit&#233; du processus 
d'annotation dans la premi&#232;re &#233;tape du traitement. Pour cela nous avons proc&#233;d&#233; &#224; un relev&#233; 
manuel des expressions de ce type dans le corpus d'acquisition (pour v&#233;rifier l&#8217;exactitude de la 
r&#233;solution de la r&#233;f&#233;rence nous avons proc&#233;d&#233; de la m&#234;me mani&#232;re). 
</p>
<p>Commen&#231;ons par donner quelques informations &#224; propos de ce corpus. Il est constitu&#233; de 46 
articles de presse et d&#233;p&#234;ches journalistiques de tailles diff&#233;rentes, en provenance des sites 
Web (les grammaires d&#233;crites dans le chapitre pr&#233;c&#233;dentes ont &#233;t&#233; cr&#233;es &#224; partir de 5 premiers 
articles). Les articles sont d'origines diverses et une partie provient de sites &#233;trangers 
francophones. L'&#233;l&#233;ment unificateur de ce corpus est sa th&#233;matique, la crise en C&#244;te-d'Ivoire, 
d'o&#249; la pr&#233;sence des m&#234;mes personnes et organisations tout au long des articles. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Elzbieta GRYGLICKA 
</p>
<p>4.1 &#201;valuation de la couverture des grammaires 
Sur un total de 505 annotations produites par les grammaires, nous obtenons le bruit de 16 
r&#233;sultats, contre le silence pour 15 expressions, soit un rappel et pr&#233;cision d'environ 0,95. 
Nous pouvons distinguer 4 types d'erreurs dans l'annotation : 
</p>
<p>&#8226; L'omission pure et simple. Par exemple dans : &quot;La C&#244;te d'Ivoire n'est pas un quartier 
de Paris&quot; avait lanc&#233; &#224; la t&#233;l&#233;vision ivoirienne le &quot;g&#233;n&#233;ral patriote&quot; Charles Bl&#233; 
Goud&#233;, au soir du 6 novembre,(&#8230;) le syntagme nominal n'est pas annot&#233; et cette erreur 
est provoqu&#233;e par la pr&#233;sence des guillemets que nous n'avons pas pr&#233;vu de traiter &#224; 
cet endroit. 
</p>
<p>&#8226; Le silence partiel. Par exemple dans : Dimanche soir, &lt;personne titre = &quot;pr&#233;sident&quot; 
respde = &quot;parti&quot; &gt; le pr&#233;sident du parti &lt;/personne&gt; du pr&#233;sidentiel, &lt;personne desc 
= &quot;ancien&quot; titre = &quot;Premier ministre&quot; nom = &quot;Pascal Affi N'Guessan&quot;&gt; l'ancien 
Premier ministre Pascal Affi N'Guessan &lt;/personne&gt; demandait en effet (&#8230;). Nous 
voyons ici que le syntagme a &#233;t&#233; d&#233;coup&#233; par deux annotations distinctes. Une partie 
de l'annotation a &#233;t&#233; effectu&#233;e de fa&#231;on correcte, nous permettant d'extraire des 
informations pour la base de connaissances, par contre l'apposition a &#233;t&#233; trait&#233;e comme 
n&#233;cessitant le processus de r&#233;solution. Un autre cas de figure sont les silences 
provoqu&#233;s par le fait que les expressions du type localisation n'ont pas &#233;t&#233; 
suffisamment trait&#233;es. Par exemple : C'est ce qui explique la pr&#233;sence &lt;personne titre 
= &quot;Sergent&quot; nom = &quot;Ch&#233;rif Ousmane&quot; &gt;du Sergent Ch&#233;rif Ousmane &lt;/personne&gt; 
depuis lundi aux c&#244;t&#233;s &lt;personne titre = &quot;Caporal&quot; nom = &quot;Fofana Losseny&quot; titre = 
&quot;Commandant&quot; respde = &quot;zone&quot;&gt; du Caporal Fofana Losseny, Commandant de la 
zone &lt;/personne&gt; Ouest. 
</p>
<p>&#8226; Le d&#233;passement de bornes droites ou gauches du syntagme. Nous avons trouv&#233; 
cette erreur une fois dans : Les deux hommes ont discut&#233; pendant une heure &#224; la 
r&#233;sidence &lt;personne titre = &quot;second&quot; respde = &quot;pr&#233;sence du ministre des Affaires 
&#233;trang&#232;res&quot; nom = &quot;Mamadou Bamba&quot;&gt; du second en pr&#233;sence du ministre des 
Affaires &#233;trang&#232;res, Mamadou Bamba &lt;/personne&gt;. Cette annotation a &#233;t&#233; 
provoqu&#233;e par la pr&#233;sence du trait s&#233;mantique +Hum attribu&#233; &#224; la lexie second dans le 
dictionnaire utilis&#233;. 
</p>
<p>&#8226; L'annotation non d&#233;sir&#233;e. Par exemple dans : Mais ces bombardements visent 
visiblement &#224; fragiliser &lt;personne desc = &quot;dispositif&quot; titre = &quot;militaire&quot; org= &quot;Forces 
nouvelles&quot;&gt; le dispositif militaire des FN&lt;/personne&gt;. Le syntagme nominal a &#233;t&#233; 
annot&#233; &#224; tort pour les m&#234;mes raisons que celui cit&#233; pr&#233;c&#233;demment, la lexie dispositif 
&#233;tant d&#233;crite dans le dictionnaire avec un trait +Hum, coupl&#233; avec la pr&#233;sence d&#8217;article 
d&#233;fini singulier dans le contexte.  
</p>
<p>4.2 R&#233;sultats de la r&#233;solution de la r&#233;f&#233;rence 
</p>
<p>Dans notre corpus 87 expressions ont &#233;t&#233; annot&#233;es comme ayant besoin de la r&#233;solution de la 
r&#233;f&#233;rence. Comme pour la couverture des grammaires, nous pouvons observer ici plusieurs cas 
de figure : 
</p>
<p>&#8226; La r&#233;solution de la r&#233;f&#233;rence a eu lieu et elle est correcte (35 cas, soit 40%). Par 
exemple l'annotation : Mardi soir, &lt;personne titre = &quot;ambassadeur&quot; geo = &quot;France&quot; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'annotation des entit&#233;s nomm&#233;es du type Personne 
</p>
<p>org = &quot;ONU&quot;&gt; l'ambassadeur de France aux Nations unies &lt;/personne&gt; indiquait 
que (..) a &#233;t&#233; correctement interpr&#233;t&#233;e comme Jean-Marc de la Sabli&#232;re. 
</p>
<p>&#8226; La r&#233;solution a eu lieu, mais il y a une erreur (5 cas, soit 6%). Par exemple dans la 
proposition: La trajectoire politico-militaire &lt;personne desc = &quot;d&#233;funt&quot; titre 
=&quot;pr&#233;sident&quot;&gt; du d&#233;funt pr&#233;sident&lt;/personne&gt; Gu&#233;&#239; a sans doute compt&#233;. 
L'expression du d&#233;funt pr&#233;sident a &#233;t&#233; &#224; tort interpr&#233;t&#233;e comme F&#233;lix Houphou&#235;t 
Boigny. Nous pouvons facilement deviner que cette erreur a &#233;t&#233; provoqu&#233;e par 
l'annotation incompl&#232;te du syntagme. Les autres cas de r&#233;solution erron&#233;e sont dus, 
soit au fait d'informations manquantes dans la base de connaissances, soit &#224; 
l'insuffisance de l'algorithme lui-m&#234;me. 
</p>
<p>&#8226; La r&#233;solution est abandonn&#233;e, parce que le syst&#232;me ne dispose pas d'un candidat 
reconnu comme suffisamment ad&#233;quat (441 cas, soit 50%) pour la r&#233;solution. Pour ne 
citer que quelques exemples, les expressions comme le civil ne sont pas trait&#233;es, faute 
de ressources lexicales suffisantes. Un autre cas de figure est l'abandon de r&#233;solution 
dans les situations pour lesquelles aucune strat&#233;gie n'a pas &#233;t&#233; pr&#233;vue : &lt;personne titre 
= &quot;pr&#233;sident&quot; geo = &quot;Afrique du Sud&quot;&gt; Le pr&#233;sident d'Afrique du Sud &lt;/personne&gt; 
a re&#231;u mandat (...). Cette expression aurait d&#251; &#234;tre r&#233;solue correctement, parce que 
dans notre base de connaissances nous poss&#233;dons l'information que Thabo Mb&#233;ki est le 
pr&#233;sident sud- africain. Par contre aucun lien s&#233;mantique n'a &#233;t&#233; impl&#233;ment&#233; pour 
repr&#233;senter la relation entre Afrique du Sud et l'adjectif toponymique lui 
correspondant. 
</p>
<p>5 Conclusions 
Nous avons pr&#233;sent&#233; ici notre d&#233;marche pour l'analyse et l'annotation des entit&#233;s nomm&#233;s de 
cat&#233;gorie Personne. L&#8217;objectif principal de cette &#233;tude &#233;tait la mise en &#339;uvre d&#8217;une strat&#233;gie 
d&#8217;annotation et de la r&#233;solution partielle de la cor&#233;f&#233;rence des descriptions d&#233;finies. Nous 
avons essay&#233; d&#8217;utiliser une approche qui permet d&#8217;obtenir les r&#233;sultats fiables avec le 
minimum des ressources. De ce point de vue, nous pouvons consid&#233;rer que l&#8217;objectif a &#233;t&#233; 
atteint, le taux d&#8217;erreur de 6% &#233;tant satisfaisant. L&#8217;&#233;tape prochaine consistera a enrichir 
progressivement notre module en ressources (comme par exemple permettre de faire le lien 
entre les gentil&#233;s et les noms propres des lieux g&#233;ographiques) sans perdre la pr&#233;cision du 
processus. Notre d&#233;marche est actuellement &#233;tendue sur la mod&#233;lisation des groupes des 
personnes, le traitement des ant&#233;c&#233;dents disjoints et des expressions pronominales. 
</p>
<p>R&#233;f&#233;rences  
EHRMANN M., JACQUET G. (2006). Vers une double annotation des Entit&#233;s Nomm&#233;es. 
Traitement Automatique du Langage 47:3, 63 &#8211; 88. 
</p>
<p>FERRET O., GRAU B., HURAULT-PLANTET M., ILLOUZ G., JACQUEMIN C. (2000). QALC &#8211; the 
Question-Answering system of LIMSI-CNRS. Actes de The Ninth Text REtrieval Conference 
(TREC 9). 235 &#8211; 244. 
</p>
<p>                                                 
</p>
<p>1
 Dans un certain nombre des cas (3 r&#233;ponses) nous n&#8217;&#233;tions pas en mesure de v&#233;rifier l&#8217;exactitude de la r&#233;ponse 
</p>
<p>donn&#233;e par la r&#233;solution.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Elzbieta GRYGLICKA 
</p>
<p>GAIZAUSKAS R., GREENWOOD M., HARKEMA H., HEPPLE M., SAGGION H., SANKA A. (2005). 
The University of Sheffield's TREC 2005 Q&amp;A Experiments. Actes de The Fourteenth Text 
REtrieval Conference (TREC 2005). 
GARDENT C., MANUELIAN H. (2005). Cr&#233;ation d'un corpus annot&#233; pour le traitement des 
descriptions d&#233;finies. Traitement Automatique du Langage 46:1, 115 &#8211; 139. 
</p>
<p>HEARST M. (1992). Automatic acquisition of hyponyms from large text corpora. In 
Proceedings of the 14th International Conference on Computational Linguistics. 
KAZAMA J., TORISAWA K. (2007). ExploitingWikipedia as External Knowledge for Named 
Entity Recognition. In Proceedings of the 2007 EMNLP-CoNLL. 
MAGNINI B., PIANTA E., POPESCU O., SPERANZA M. (2006). Ontology Population from 
Textual Mentions: Task Definition and Benchmark. Proceedings of the OLP2 workshop on 
Ontology Population and Learning, Sidney, Australia, Joint with ACL/Coling 2006. 
</p>
<p>MAYNARD D., TABLAN V., URSU C., CUNNINGHAM H., WILKS Y. (2001). Named Entity 
Recognition from Diverse Text Types. Actes de Recent Advances in Natural Language 
Processing 2001 Conference, Tzigov Chark, Bulgaria. 257 &#8211; 274. 
MEYER J., DALE R. (2002). Mining a corpus to support associative anaphora resolution. In 
Proceedings of the Fourth International Conference on Discourse Anaphora and Anaphor 
Resolution. 
</p>
<p>MUC &#8211; 6 (1995). Proceedings Sixth Message Understanding Conference. 
MUC &#8211; 7 (1998). Proceedings Seventh Message Understanding Conference. 
POESIO M., VIEIRA R., TEUFEL S. (1997). Resolving bridging references in unrestricted text. In 
Proceedings of the ACL Workshop on Operational Factors in Robust Anaphora. 
POIBEAU T. (2003). Extraction automatique d'information. Paris : Herm&#232;s - Lavoisier. 
POIBEAU T. (2005). Sur le statut r&#233;f&#233;rentiel des entit&#233;s nomm&#233;es. Actes de la Conf&#233;rence 
Traitement Automatique des Langues Naturelles (TALN 2005). 173 &#8211; 182. 
</p>
<p>SAGGION H., FUNK A., MAYNARD D., BONTCHEVA K. (2007). Ontology-based Information 
Extraction for Business Intelligence. Actes de The 6th International Semantic Web 
Conference and 2nd Asian Semantic Web Conference (ISWC/ASWC2007), Busan, South 
Korea. 837 &#8211; 850. 
</p>
<p>SEKINE S., NOBATA C. (2004). Definition, dictionaries and tagger for Extended Named Entity 
Hierarchy. Actes de The 4th International Conference on Language Resources and 
Evaluation (LREC 2004), Lisbonne. 1977 &#8211; 1980. 
</p>
<p>SILBERZTEIN M. (2002 - 2008). NooJ Manual. http://www.nooj4nlp.net/. </p>

</div></div>
</body></html>