<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Informations spatio-temporelles et objets touristiques dans des pages Web : rep&#233;rage et annotation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Recital 2008, Avignon, 9-13 juin 2008 
</p>
<p>Informations spatio-temporelles et objets touristiques dans des 
pages Web : rep&#233;rage et annotation 
</p>
<p>St&#233;phanie Weiser 
</p>
<p>MoDyCo, UMR7114, CNRS &#8211; Universit&#233; Paris X, 200 av. de la R&#233;publique, 
92001 Nanterre 
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente un projet de rep&#233;rage, d'extraction et d'annotation 
d'informations temporelles, d'informations spatiales et d'objets touristiques dans des pages 
Web afin d'alimenter la base de connaissance d'un portail touristique. Nous portons une 
attention particuli&#232;re aux diff&#233;rences qui distinguent le rep&#233;rage d'information dans des pages 
Web du rep&#233;rage d&#8217;informations dans des documents structur&#233;s. Apr&#232;s avoir introduit et 
classifi&#233; les diff&#233;rentes informations &#224; extraire, nous nous int&#233;ressons &#224; la fa&#231;on de lier ces 
informations entre elles (par exemple apparier une information d&#8217;ouverture et un restaurant) et 
de les annoter. Nous pr&#233;sentons &#233;galement le logiciel que nous avons r&#233;alis&#233; afin d'effectuer 
cette op&#233;ration d'annotation ainsi que les premiers r&#233;sultats obtenus. Enfin, nous nous 
int&#233;ressons aux autres types de marques que l'on trouve dans les pages Web, les marques 
s&#233;miotiques en particulier, dont l'analyse peut &#234;tre utile &#224; l&#8217;interpr&#233;tation des pages. 
</p>
<p>Abstract. This paper presents a project for the detection, extraction and annotation of 
temporal and spatial information and of tourism objects in order to fill the knowledge base of 
a tourism Web portal. We focus on the differences that exist between extraction from 
structured documents and extraction from Web pages. First, the different types of information 
to extract are presented. We then discuss methods for linking these pieces of information 
together &#8211; for example relating the name of a restaurant to its opening hours &#8211; and how to 
annotate the extracted data. The program we have developed to perform the extraction and 
annotation, as well as an evaluation of this program, are presented here. Finally, we focus on 
the semiotic marks which appear on the Web and show they also prove useful in interpreting 
Web pages. 
</p>
<p>Mots-cl&#233;s :   extraction d'information, annotation, informations spatio-temporelles, 
tourisme, pages Web. 
Keywords:   information extraction, annotation, spatial &amp; temporal information, tourism, 
Web pages. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Weiser 
</p>
<p>1 Introduction 
Avec les m&#233;thodes du Web S&#233;mantique, des portails applicatifs reposant sur des ontologies 
peuvent &#234;tre cr&#233;&#233;s. Pour ces applications ainsi que pour de nombreux services propos&#233;s sur le 
Web, les informations temporelles et spatiales sont souvent primordiales. Par exemple, un 
portail touristique sur Internet n&#233;cessite des informations sur diff&#233;rents objets touristiques, 
leur type et leur localisation spatio-temporelle. Par ailleurs, une base de connaissance, calqu&#233;e 
sur l'ontologie utilis&#233;e par le portail, devrait &#234;tre capable de stocker ces informations. 
</p>
<p>Dans cet article, nous nous focaliserons sur les informations temporelles et spatiales 
contenues dans des pages Web touristiques. Ces informations doivent &#234;tre d&#233;tect&#233;es, extraites 
et ensuite annot&#233;es. Le format d'annotation est bas&#233; sur des outils XML pr&#233;existants (Stern, 
2007). Trois grands types de difficult&#233;s ont vu le jour pour extraire automatiquement ces 
informations. Premi&#232;rement, des informations temporelles ou spatiales complexes et 
impr&#233;cises doivent pouvoir &#234;tre trait&#233;es. Bien s&#251;r, les dates simples sont faciles &#224; rep&#233;rer, mais 
nous avons &#233;galement besoin d'extraire des expressions plus complexes et de les cat&#233;goriser, 
comme des p&#233;riodes ou des informations r&#233;p&#233;titives. Deuxi&#232;mement, une fois les informations 
extraites, elles doivent &#234;tre li&#233;es aux bons objets du domaine. Si la page Web ne mentionne 
qu'un seul objet touristique, le lien est direct : l'information extraite fait r&#233;f&#233;rence &#224; cet objet. 
Par contre, il arrive fr&#233;quemment qu'une page Web concerne plusieurs objets touristiques. 
Une analyse plus fine est alors n&#233;cessaire pour cr&#233;er des r&#233;f&#233;rences entre les objets et les 
informations extraites. Troisi&#232;mement, nous cherchons &#224; traiter des pages Web d'un certain 
type (ce sont toutes des pages touristiques), mais celles-ci sont faites par diff&#233;rents acteurs, 
dans des formats h&#233;t&#233;rog&#232;nes. Elles varient donc beaucoup. Nous essayerons de montrer que 
certaines sp&#233;cificit&#233;s n&#233;cessiteraient l'&#233;tude de marques s&#233;miotiques. 
</p>
<p>Le travail pr&#233;sent&#233; dans cet article se situe dans le cadre du projet Eiffel (ANR / RNTL) dont 
l'objectif est de cr&#233;er, sur le Web, un portail touristique comprenant de nombreuses 
fonctionnalit&#233;s. Ce portail inclut un moteur de recherche sp&#233;cialis&#233; et a pour but de permettre 
&#224; ses utilisateurs de trouver et stocker des informations essentielles et pr&#233;cises en contexte. Par 
ailleurs, les r&#233;gions fran&#231;aises pourront, gr&#226;ce &#224; ce portail, promouvoir leurs services. Il s'agit 
d'un vaste projet (No&#235;l &amp; al., 2008), bas&#233; sur les technologies du Web S&#233;mantique, sur la 
repr&#233;sentation de la connaissance et sur des m&#233;thodes et expertises linguistiques. Il inclut la 
d&#233;tection, l'extraction et l'annotation automatique de diff&#233;rents types d'informations sur le 
Web ; t&#226;ches pour lesquelles il s'appuie sur une ontologie du territoire, cr&#233;&#233;e pour cette 
application, par des experts. 
</p>
<p>Un corpus de plus de 5000 pages Web francophones a &#233;t&#233; constitu&#233; automatiquement par l&#8217;un 
de nos partenaires pour les besoins de notre &#233;tude. Ces pages sont toutes li&#233;es au domaine du 
tourisme : sites d'h&#244;tels, de restaurants, d'&#233;v&#233;nements ponctuels, spectacles, concerts, etc. Ces 
pages ont &#233;t&#233; transform&#233;es en documents XML, format plus ad&#233;quat pour un traitement 
automatique, et &#171; nettoy&#233;es &#187;. C'est-&#224;-dire que seules les informations utiles &#224; notre analyse 
ont &#233;t&#233; conserv&#233;es. De nombreuses balises ont donc &#233;t&#233; supprim&#233;es. Certaines, au contraire, 
ont &#233;t&#233; pr&#233;cieusement conserv&#233;es, notamment les balises donnant des indications sur la mise 
en forme des pages : couleur, disposition, tableaux, etc. Dans le corpus, chaque page est 
ind&#233;pendante : il se peut que plusieurs pages soient issues du m&#234;me site mais, une fois 
l&#8217;aspiration effectu&#233;e, elles ne sont plus li&#233;es. 
</p>
<p>Cet article est organis&#233; de la mani&#232;re suivante : la partie deux pr&#233;sente les diff&#233;rences qui 
distinguent le rep&#233;rage et l'extraction d'information dans une page Web ou dans un document 
structur&#233; ainsi que les diff&#233;rentes informations que l'on cherche &#224; extraire et annoter. On y </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Informations spatio-temporelles et objets touristiques dans des pages Web 
</p>
<p>trouve ensuite une classification des diff&#233;rentes informations que l'on cherche &#224; extraire, ainsi 
que des pr&#233;cisions sur la fa&#231;on dont on peut les lier et les annoter. La partie trois pr&#233;sente le 
syst&#232;me que l'on a mis au point pour effectuer cette t&#226;che de rep&#233;rage et d'annotation et son 
&#233;valuation. 
</p>
<p>2 L'extraction d'information dans des pages Web 
Le rep&#233;rage et l'extraction d'information forment un des domaines du traitement automatique 
des langues qui a d&#233;j&#224; &#233;t&#233; largement &#233;tudi&#233;. Les travaux d&#8217;extraction d&#8217;informations 
temporelles ou calendaires (Battistelli &amp; al., 2006) et d&#8217;informations de localisation spatiale 
(Piton &amp; Maurel, 2004) sont donc d&#233;j&#224; r&#233;pandus. Mais ils ne concernent pas des textes dont 
l&#8217;&#233;criture et la structuration d&#233;coulent en partie de la forme des pages Web. Nous cherchons &#224; 
montrer que l&#8217;extraction d&#8217;un m&#234;me type d&#8217;informations est diff&#233;rente selon qu&#8217;elle est 
effectu&#233;e dans une page Web ou dans un document structur&#233;. 
</p>
<p>Dans les guides touristiques classiques (papier), l&#8217;information est beaucoup plus structur&#233;e et 
standardis&#233;e que dans des  pages Web touristiques, qui sont tr&#232;s vari&#233;es et ne respectent pas 
un mod&#232;le de page commun. Dans un guide, toutes les entr&#233;es correspondant au m&#234;me type 
d'objet touristique sont structur&#233;es de la m&#234;me mani&#232;re et contiennent le m&#234;me type 
d'informations. Des marqueurs linguistiques peuvent alors permettre de rep&#233;rer chaque 
information &#224; extraire. De plus, la ponctuation est tr&#232;s rigoureuse, ce qui facilite grandement 
l'interpr&#233;tation, surtout si celle-ci est automatis&#233;e. Les points et points-virgules sont bien 
utilis&#233;s : les points s&#233;parent les informations qui sont de natures diff&#233;rentes tandis que les 
points-virgules s&#233;parent les diff&#233;rentes informations de m&#234;me type (les diff&#233;rents prix par 
exemple). Dans les pages Web, au contraire, la ponctuation &#8211; s'il y en a &#8211; est rarement utilis&#233;e 
&#224; bon escient. La plupart du temps, ce sont des espaces blancs ou des &#171; lignes saut&#233;es &#187; qui 
servent de s&#233;parateur. 
</p>
<p>Bien s&#251;r, l'extraction d'information dans des documents structur&#233;s n&#8217;est pas triviale, mais ce 
que nous voulons souligner, c&#8217;est que pour ce type de texte, il existe d&#233;j&#224; de nombreux outils 
syntaxiques permettant de faciliter l'extraction automatique : par exemple, des outils d&#8217;analyse 
syntaxique partielle, de chunking ou de parsing sont disponibles. Il subsiste toutefois des 
difficult&#233;s, comme la r&#233;solution d'anaphores, qui rendent l'analyse automatique de textes 
complexe. Ce qui nous int&#233;resse, ce sont les difficult&#233;s que l'on peut rencontrer lors de 
l'analyse automatique de pages Web et qui sont tr&#232;s diff&#233;rentes des difficult&#233;s que pr&#233;sente 
une simple analyse automatique de texte. Par exemple, dans Le guide du routard1, on trouve 
pour chaque restaurant son nom suivi de son adresse, num&#233;ro de t&#233;l&#233;phone et station de m&#233;tro 
puis les indications d'ouverture comme ouvert tous les jours. Chaque entr&#233;e est facile &#224; 
analyser automatiquement. Le probl&#232;me est que, sur une page Web, le m&#234;me type 
d&#8217;information prendrait plut&#244;t la forme pr&#233;sent&#233;e sur la page Web de la figure 1. 
</p>
<p>Pour l'instant, aucun outil n'est capable d'interpr&#233;ter que Chez Paul et Bernadette Colas est le 
nom d'une auberge ou que Ouvert du 15 f&#233;vrier au 30 novembre correspond aux informations 
d'ouverture de cette auberge. C'est pour cela que les m&#233;thodes d'extraction d'information dans 
des documents structur&#233;s ne peuvent pas &#234;tre directement appliqu&#233;es &#224; des pages Web dans 
</p>
<p>                                                 
</p>
<p>1
 Le guide du routard &#8211; Paris balades 2007 p.231 : &#171; Le Saint-Amour 2, av.Gambetta, 75020. 01-47-97-20-15. 
</p>
<p>M&#233;tro P&#232;re-Lachaise. Ouvert tous les jours &#187;  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Weiser 
</p>
<p>lesquelles la structure n&#8217;est pas standardis&#233;e et o&#249;, en plus d&#8217;une ponctuation presque 
inexistante, la syntaxe n'est souvent pas conforme &#224; la norme. 
</p>
<p> 
</p>
<p>Figure 1 : extrait d&#8217;une page Web 
</p>
<p>Notre travail est proche de (Tenier &amp; al., 2006) dont l'objectif est d'extraire, dans des pages 
Web, les informations concernant des &#233;quipes de recherche. Notre approche est plus g&#233;n&#233;rale 
dans le sens o&#249; les pages que ces auteurs analysent respectent des r&#232;gles de disposition 
spatiale. Nous nous rapprochons &#233;galement de (Bry &amp; al., 2003) qui ont travaill&#233; sur des 
modules de raisonnement temporel et de localisation pour des pages Web. Mais la diff&#233;rence 
entre leur travail et le n&#244;tre est que ces auteurs travaillent sur des documents XML dans 
lesquelles l&#8217;information est d&#233;j&#224; s&#233;mantiquement structur&#233;e ; les expressions temporelles sont 
d&#233;j&#224; marqu&#233;es et n&#8217;ont donc pas &#224; &#234;tre rep&#233;r&#233;es. 
Par ailleurs, TimeML2 est un langage de marquage des expressions temporelles et 
d&#8217;&#233;v&#233;nements. Nous avons choisi de ne pas nous appuyer sur ce langage car, pour nos 
besoins, il est trop riche et pas assez sp&#233;cifique. En effet, il permet d&#8217;annoter en d&#233;tail des 
expressions temporelles, de les ordonner et de faire certains raisonnements mais ces 
expressions sont trop nombreuses et vari&#233;es pour nous. Les informations que nous cherchons 
&#224; annoter sont sp&#233;cifiques au domaine du tourisme et ont donc des caract&#233;ristiques propres 
qu&#8217;il serait dommage d&#8217;ignorer. 
</p>
<p>2.1 Informations &#224; extraire 
</p>
<p>Lorsqu&#8217;un utilisateur effectue une recherche sur le portail en vue de planifier un voyage, il 
porte un int&#233;r&#234;t tout particulier aux informations spatio-temporelles : que peut-il trouver aux 
alentours de son lieu de vacances, le mus&#233;e de la ville voisine est-il ouvert &#224; cette p&#233;riode de 
l&#8217;ann&#233;e, y a-t-il un &#233;v&#233;nement particulier &#224; ne pas manquer, etc.? C&#8217;est pour cela qu&#8217;il est 
important de rechercher et d&#8217;extraire ces informations des pages Web touristiques. Par 
ailleurs, au niveau de la cha&#238;ne de traitement, ces informations tiennent une place dans la base 
de connaissance du projet. Cette base est calqu&#233;e sur une ontologie du territoire qui mod&#233;lise 
&#224; la fois l&#8217;offre (objets touristiques) et l&#8217;approche marketing du territoire. Pour les objets 
touristiques, un travail de repr&#233;sentation des informations temporelles et spatiales a &#233;t&#233; int&#233;gr&#233; 
                                                 
</p>
<p>2
 http://www.timeml.org  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Informations spatio-temporelles et objets touristiques dans des pages Web 
</p>
<p>dans l&#8217;ontologie. Ainsi, on y trouve les concepts d&#8217;heure d&#8217;ouverture et de fermeture, de date 
mais aussi de p&#233;riodicit&#233;. Le rep&#233;rage d&#8217;informations dans les pages Web est donc guid&#233; par 
les besoins de cette ontologie en vue de pouvoir ensuite effectuer des requ&#234;tes pertinentes sur 
ces donn&#233;es. 
</p>
<p>2.1.1 Les informations temporelles 
Tout d&#8217;abord, voici quelques exemples des expressions que l&#8217;on cherche &#224; rep&#233;rer : 
</p>
<p>&#8226; Le 21 avril 
</p>
<p>&#8226; Du 10 au 21 mars 
</p>
<p>&#8226;  Du lundi au vendredi, 9h &#8211; 11h 
</p>
<p>&#8226;  Inauguration du mus&#233;e le 7 juillet 2006 
</p>
<p>&#8226; En Juillet et Ao&#251;t ouvert tous les jours. Hors cette p&#233;riode, fermeture le mercredi 
soir, le jeudi toute la journ&#233;e et le dimanche soir. Horaires d'ouverture: de 12h00 &#224; 
14h00 de 19h00 &#224; 22h00. 
</p>
<p>Comme ces exemples le montrent, les entit&#233;s temporelles &#224; rep&#233;rer sont de diff&#233;rents types. 
Deux cat&#233;gories principales peuvent &#234;tre identifi&#233;es : les informations temporelles qui 
concernent un &#233;v&#233;nement particulier et les informations temporelles r&#233;p&#233;titives. La premi&#232;re 
comprend des dates (concert le 1er octobre), des p&#233;riodes (festival de mai &#224; juin), des heures 
(le concert commence &#224; 8h). La seconde comprend des horaires (le mus&#233;e ouvre &#224; 10h), des 
p&#233;riodes (le restaurant est ouvert du lundi au samedi) et des exceptions (le camping est ouvert 
toute l&#8217;ann&#233;e sauf en janvier). Des exemples d&#8217;une complexit&#233; plus grande peuvent &#233;galement 
prendre place dans cette classification comme de mai &#224; juin, ouvert tous les jours sauf le 
mardi.  
</p>
<p>Certaines informations temporelles ne nous int&#233;ressent pas car elles ne concernent pas un 
objet touristique. Elles ne doivent pas &#234;tre rep&#233;r&#233;es. Par exemple, une date seule, non 
introduite par une marque lexicale du type date d&#8217;ouverture ne concerne pas toujours un objet 
touristique. Les dates isol&#233;es concernent souvent la page Web elle-m&#234;me comme dans : 
Derni&#232;re modification : 25/10/2006. Rappelons que les informations temporelles que l&#8217;on 
cherche &#224; identifier sont celles qui concernent directement un objet touristique en particulier. 
De plus, certaines expressions peuvent &#234;tre ambigu&#235;s. Par exemple dans vendredi et samedi 
soir, doit-on comprendre qu&#8217;il s&#8217;agit des deux soir&#233;es ou de la journ&#233;e de vendredi et de la 
soir&#233;e de samedi ? Le contexte est n&#233;cessaire pour lever ce type d&#8217;ambigu&#239;t&#233;. Pour cet 
exemple, s&#8217;il s&#8217;agit d&#8217;un concert, la premi&#232;re interpr&#233;tation sera probablement la bonne. 
</p>
<p>2.1.2 Les informations spatiales 
Voici quelques exemples des expressions de localisation que l&#8217;on cherche &#224; rep&#233;rer :  
</p>
<p>&#8226; 8, rue de l&#8217;&#233;glise, 58000 Nevers 
</p>
<p>&#8226; Office de tourisme 58230 Brisson </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Weiser 
</p>
<p>&#8226; Le champ Thierry 58170 Luzy 
</p>
<p>&#8226; 13, rue Henri Renaud - BP 5 58360 Saint-Honor&#233;-les-Bains 
</p>
<p>&#8226; Au centre du village de Tamnay en Bazois (D978 direction Nevers) 
</p>
<p>&#8226; Quai Jules Moineau B.P. 123 58206 Cosne Cours Sur Loire CEDEX 
</p>
<p>Le rep&#233;rage des informations spatiales s&#8217;est pour l&#8217;instant focalis&#233; sur les adresses 
prototypiques comme 8, rue de l&#8217;&#233;glise, 58000 Nevers et quelques unes de leurs variantes (pas 
de num&#233;ro, une information de bo&#238;te postale etc.). Le sch&#233;ma de ce type d&#8217;adresse correspond 
&#224; un num&#233;ro, un marqueur lexical indiquant le type de voie, une suite de mots indiquant le 
nom de la voie, puis un num&#233;ro pour le code postal et enfin un nom de ville. Nous disposons 
d&#8217;un lexique de noms de ville qui sert &#224; d&#233;clencher des analyses contextuelles. 
</p>
<p>Un travail plus s&#233;mantique qui concernera des informations de localisation est n&#233;cessaire et 
pr&#233;vu, pour rep&#233;rer les informations du type Au centre du village de Tamnay en Bazois (D978 
direction Nevers). Pour ce type d&#8217;expression, il faudra alors d&#233;terminer plus pr&#233;cis&#233;ment ce 
que l&#8217;on cherche &#224; extraire et de quelle mani&#232;re cela peut prendre place dans l&#8217;ontologie. 
</p>
<p>2.1.3 Les objets touristiques 
Le rep&#233;rage des informations temporelles et spatiales est donc primordial dans le cadre d&#8217;une 
application touristique, mais ces informations n&#8217;ont de sens que si l&#8217;on sait &#224; quel objet 
touristique chacune se rapporte. Il est alors n&#233;cessaire de nous int&#233;resser au rep&#233;rage de ces 
objets touristiques. 
Tout d&#8217;abord, voici ce que nous entendons par &#171; objet touristique &#187; : un objet touristique peut 
correspondre &#224; une activit&#233; (concert) ou &#224; une infrastructure (h&#244;tel). Cette terminologie est 
calqu&#233;e sur ce que l&#8217;ontologie du projet mod&#233;lise, afin de faciliter ensuite la communication 
avec la base de connaissance. Tout ce qui peut faire l&#8217;objet d&#8217;une page dans notre corpus et 
avoir des informations temporelles et/ou spatiales associ&#233;es peut &#234;tre consid&#233;r&#233; comme un 
objet touristique : cela englobe aussi bien les lieux de type h&#244;tel, restaurant, auberge, maison 
d&#8217;h&#244;te, etc. que les &#233;v&#233;nements de type concert, festival, f&#234;te, march&#233;, etc. 
</p>
<p>Ces objets touristiques sont parfois clairement &#233;nonc&#233;s dans le contexte direct d&#8217;une 
information temporelle (le concert commence &#224; 20h) et sont donc assez simples &#224; extraire. 
Mais ce n&#8217;est pas toujours le cas et il faut alors proc&#233;der &#224; une recherche plus approfondie 
dans le reste de la page, notamment dans le titre. 
</p>
<p>2.1.4 Appariement des informations rep&#233;r&#233;es 
Comme on vient de le voir, une information temporelle ou spatiale isol&#233;e est difficilement 
exploitable. En effet, l&#8217;expression ne prend son sens que lorsqu&#8217;elle correspond &#224; un objet 
touristique.  
</p>
<p>On distingue principalement deux cas de figure : soit la page Web ne concerne qu&#8217;un seul 
objet touristique, soit elle fait r&#233;f&#233;rence &#224; plusieurs objets. Dans le premier cas, l&#8217;op&#233;ration 
d&#8217;appariement est donc relativement simple : on peut faire l&#8217;hypoth&#232;se que toutes les 
informations spatiales ou temporelles de la page concernent l&#8217;unique objet touristique 
mentionn&#233;. Dans le second, une analyse plus fine est n&#233;cessaire pour &#233;tablir les relations entre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Informations spatio-temporelles et objets touristiques dans des pages Web 
</p>
<p>les diff&#233;rentes informations rep&#233;r&#233;es. Diff&#233;rents crit&#232;res sont exploitables pour lier les entit&#233;s 
rep&#233;r&#233;es les unes aux autres : crit&#232;re de proximit&#233;, d&#8217;ordre, crit&#232;res s&#233;miotiques prenant en 
compte la disposition de la page, titres, couleurs, etc. 
</p>
<p>2.2 Annotation des expressions extraites 
</p>
<p>Afin d'&#234;tre exploitables, les informations extraites doivent &#234;tre int&#233;gr&#233;es dans la base de 
connaissance du projet. Elles doivent alors correspondre aux besoins de cette base, elle-m&#234;me 
calqu&#233;e sur l&#8217;ontologie du territoire pr&#233;sent&#233;e plus haut. Elles doivent donc &#234;tre annot&#233;es en 
fonction de ce que l&#8217;ontologie permet de mod&#233;liser. Le format XML a &#233;t&#233; choisi pour 
effectuer cette t&#226;che.  
</p>
<p>2.2.1 Une annotation en deux &#233;tapes 
</p>
<p>L'annotation se fait en deux temps : dans un premier temps, l'expression est rep&#233;r&#233;e et 
d&#233;limit&#233;e et dans un second temps, les composants des expressions rep&#233;r&#233;es sont identifi&#233;s, 
notamment la granularit&#233; pour les expressions temporelles. Ainsi, seules quelques balises 
g&#233;n&#233;rales sont d'abord ins&#233;r&#233;es : il s'agit d'une balise &lt;UT&gt; qui encadre toute expression 
rep&#233;r&#233;e et de balises plus sp&#233;cifiques comme &lt;HeureOuverture&gt;, &lt;dateOuverture&gt;, 
&lt;periodeOuverture&gt;, &lt;Adresse&gt; ou &lt;Infrastructure&gt;. La seconde &#233;tape de l'annotation 
permettra d'ins&#233;rer des balises plus pr&#233;cises et par exemple de transformer une p&#233;riode en 
&lt;DateDebut&gt; et &lt;DateFin&gt; ou d'ajouter les balises &lt;Ville&gt; ou &lt;CodePostal&gt; pour la 
spatialisation. 
</p>
<p>Voici quelques exemples d&#8217;expressions annot&#233;es lors de la premi&#232;re &#233;tape : 
</p>
<p>&#8226; &lt;UT&gt; &lt;dateOuverture&gt;10 f&#233;vrier &lt;/dateOuverture&gt;au&lt;dateFermeture&gt;21 mars 
&lt;/dateFermeture&gt; &lt;/UT&gt; 
</p>
<p>&#8226; &lt;UT&gt; &lt;periodeOuverture&gt; du lundi au vendredi &lt;heureOuverture&gt; 9h-11h 
&lt;/heureOuverture&gt; &lt;/periodeOuverture&gt; &lt;/UT&gt; 
</p>
<p>&#8226; &lt;Localisation&gt;&lt;Adresse&gt;34 Rue Saint Gildard 58000 
NEVERS&lt;/Adresse&gt;&lt;/Localisation&gt; 
</p>
<p>Les composants des expressions seront ensuite identifi&#233;s. Pour les expressions temporelles, il 
s&#8217;agit des d&#233;tails de jour, mois et ann&#233;e. Pour les localisations, les villes et codes postaux 
seront identifi&#233;s. Lors de l&#8217;extraction d&#8217;information, on a choisi de s&#8217;en tenir &#224; la t&#226;che 
d&#8217;annotation, sans effectuer de raisonnement. Par exemple l&#8217;expression ouvert tous les jours 
sauf le mardi ne sera pas convertie en ouvert le lundi, le mercredi, le jeudi, etc. Ce 
raisonnement sera trait&#233; au niveau de la base de connaissance ou au niveau des requ&#234;tes. 
</p>
<p>2.2.2  Nomenclature des balises d&#8217;annotation 
</p>
<p>Six balises permettent d&#8217;annoter les informations temporelles : &lt;UT&gt;  d&#233;limite l&#8217;expression 
rep&#233;r&#233;e, les autres balises sont plus pr&#233;cises. &lt;dateOuverture&gt; et &lt;dateFermeture&gt; permettent 
d&#8217;indiquer le d&#233;but et la fin d&#8217;un &#233;v&#233;nement, &lt;periodeOuverture&gt; et &lt;periodeFermeture&gt; 
servent &#224; annoter les informations p&#233;riodiques comme dans ouvert tous les jours. Les balises 
&lt;dateOuverture&gt; et &lt;dateFermeture&gt; servent donc &#224; annoter les informations ponctuelles, 
m&#234;me si, dans la langue, on pourrait consid&#233;rer qu&#8217;il s&#8217;agit d&#8217;une p&#233;riode (pour du 1er au 30 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Weiser 
</p>
<p>d&#233;cembre par exemple) tandis que les balises &lt;periodeOuverture&gt; et &lt;periodeFermeture&gt; 
indiquent r&#233;ellement un ph&#233;nom&#232;ne de p&#233;riodicit&#233;. Les exceptions, comme ouvert toute 
l&#8217;ann&#233;e sauf en juillet sont marqu&#233;es par la balise &lt;exception&gt;.  
Des balises plus fines seront ajout&#233;es pour effectuer la deuxi&#232;me &#233;tape d&#8217;annotation. Il s&#8217;agira 
tr&#232;s probablement de &lt;jour&gt;, &lt;mois&gt; et &lt;ann&#233;e&gt; pour d&#233;composer les dates ; de 
&lt;jourOuverture&gt;, &lt;jourFermeture&gt;, &lt;moment&gt; (moment de la journ&#233;e comme mardi midi), 
&lt;heure&gt;, &lt;minute&gt; pour d&#233;composer les p&#233;riodes. 
</p>
<p>Les balises &lt;activit&#233;&gt; et &lt;infrastructure&gt; sont les deux premi&#232;res qui permettent d&#8217;annoter les 
objets touristiques. D&#8217;autres comme &lt;mus&#233;e&gt; ou &lt;h&#244;tel&gt; viendront compl&#233;ter ce jeu. 
En ce qui concerne les lieux, la balise &lt;localisation&gt; encadre l&#8217;expression rep&#233;r&#233;e. La balise 
&lt;adresse&gt; indique qu&#8217;il s&#8217;agit d&#8217;une adresse prototypique. Les balises &lt;ville&gt; et &lt;codePostal&gt; 
viendront compl&#233;ter les annotations. 
</p>
<p>3 Syst&#232;me de rep&#233;rage, d'extraction et d'annotation 
C&#8217;est sur une approche symbolique, reposant sur des patrons linguistiques, que notre syst&#232;me 
est bas&#233;. L&#8217;architecture g&#233;n&#233;rale de ce syst&#232;me est pr&#233;sent&#233;e dans cette partie, tout comme une 
premi&#232;re &#233;valuation du module de rep&#233;rage des informations temporelles. 
</p>
<p>3.1 Architecture du syst&#232;me 
</p>
<p>Le syst&#232;me que l'on a cr&#233;&#233; pour effectuer le rep&#233;rage et l'annotation des pages Web en XML 
est compos&#233; de plusieurs modules. Un module d&#233;di&#233; pour chaque type d'information et un 
module qui coordonne le tout. Celui-ci est d&#233;velopp&#233; en JAVA, les modules d&#233;di&#233;s avec 
l'outil Unitex3. Cet outil permet de traiter des corpus en utilisant des dictionnaires (bas&#233;s sur 
les tables du LADL4) ; et ce au niveau du lexique, de la syntaxe ou de la morphologie. Il 
permet de rep&#233;rer et de baliser des structures correspondant &#224; des expressions r&#233;guli&#232;res, 
repr&#233;sent&#233;es par des graphes &#224; &#233;tats finis. La sortie d'Unitex est stock&#233;e dans un fichier texte 
dans lequel des balises d'annotations, au format XML, ont &#233;t&#233; ajout&#233;es pour marquer les 
donn&#233;es identifi&#233;es. 
</p>
<p>Il existe ainsi trois modules d&#233;di&#233;s. Le premier sert &#224; rep&#233;rer et annoter les informations 
temporelles et il se compose donc de transducteurs cr&#233;&#233;s &#224; l'aide d'Unitex. Le rep&#233;rage et 
l'annotation se font &#224; l'aide du m&#234;me jeu de transducteurs. Le deuxi&#232;me et le troisi&#232;me qui 
concernent le rep&#233;rage des informations spatiales et des objets touristiques sont en cours de 
d&#233;veloppement. 
</p>
<p>                                                 
</p>
<p>3
 Unitex : http://www-igm.univ-mlv.fr/~unitex 
</p>
<p>4
 Laboratoire d&#8217;Automatique Documentaire et Linguistique &#8211; les tables ont &#233;t&#233; cr&#233;&#233;es au LADL par Maurice 
</p>
<p>Gross et contiennent des unit&#233;s lexicales class&#233;es selon des propri&#233;t&#233;s syntaxiques et distributionnelles </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Informations spatio-temporelles et objets touristiques dans des pages Web 
</p>
<p>3.2 Evaluation 
</p>
<p>Une premi&#232;re &#233;valuation (rappel et pr&#233;cision) de l&#8217;op&#233;ration de rep&#233;rage des informations 
temporelles (expressions simples et complexes) est pr&#233;sent&#233;e ici. Cette &#233;valuation est biais&#233;e 
car elle a &#233;t&#233; effectu&#233;e sur les cent pages qui ont permis de constituer les transducteurs de 
rep&#233;rage. La prochaine &#233;tape consistera &#224; appliquer ces transducteurs sur cent nouvelles pages 
mais cette d&#233;marche est co&#251;teuse en temps car, pour calculer les taux de rappel et pr&#233;cision, il 
faut parall&#232;lement analyser les cent pages manuellement.  
</p>
<p> Ens. 1 Ens. 2 Ens. 3 Ens. 4 Ens. 5 Total 
7/7  9/9 6/7 18/20 7/8 47/51 Rappel 
</p>
<p>100% 100% 85,7% 90% 87,5% 92,1% 
</p>
<p>7/8 9/14 6/6 18/23 7/13 47/64 Pr&#233;cision 
87,5% 64,3% 100% 78,2% 53,8% 73,4% 
</p>
<p>Tableau 1 : Taux de rappel et pr&#233;cision pour les cinq ensembles 
</p>
<p>Le tableau 1 contient les taux de rappel et pr&#233;cision pour cinq ensembles de vingt pages qui 
constituent le corpus de test (les cent pages ont al&#233;atoirement &#233;t&#233; r&#233;parties en cinq ensembles) 
ainsi qu'une moyenne sur les cent pages. Mais pour que ces chiffres prennent toute leur valeur, 
d'autres donn&#233;es chiffr&#233;es sont &#224; prendre en compte. En effet, ce corpus a &#233;t&#233; constitu&#233; de 
mani&#232;re tout &#224; fait al&#233;atoire et seules 26 pages contiennent des informations temporelles. Le 
nombre d'expressions temporelles &#224; extraire est de 51. Par ailleurs, 16 pages ne sont pas en 
fran&#231;ais et 12 sont vides ou inexploitables (crypt&#233;es, tout en majuscule, etc.). 
Ces premiers r&#233;sultats sont encourageants, mais seule une &#233;valuation rigoureuse d&#8217;un nouvel 
ensemble de pages permettra de confirmer la pertinence de nos transducteurs. Une &#233;valuation 
du rep&#233;rage et de l&#8217;annotation des informations spatiales et des objets touristiques reste 
&#233;galement &#224; effectuer. 
</p>
<p>4 Conclusion et perspectives 
Nous avons entrepris de rep&#233;rer, extraire et annoter les informations temporelles, les 
informations spatiales et les objets touristiques dans des pages Web touristiques afin 
d'alimenter la base de connaissance d'un portail touristique. Nous avons soulign&#233; la diff&#233;rence 
entre l'extraction d'information dans des documents structur&#233;s et l'extraction sur des pages 
Web. 
</p>
<p>Apr&#232;s avoir introduit et classifi&#233; les diff&#233;rentes informations &#224; extraire, nous avons fait le 
point sur la fa&#231;on de lier ces informations entre elles et de les annoter. Nous avons &#233;galement 
pr&#233;sent&#233; le logiciel que nous avons r&#233;alis&#233; afin d'effectuer cette op&#233;ration d'annotation et les 
premiers r&#233;sultats obtenus. Notre travail &#233;tant plus avanc&#233; dans le rep&#233;rage des expressions 
temporelles, c'est la seule op&#233;ration pour laquelle nous avons proc&#233;d&#233; &#224; une &#233;valuation. 
L'&#233;valuation de l'annotation des expressions spatiales reste &#224; venir et la r&#233;alisation des 
transducteurs pour le rep&#233;rage des objets touristiques est en cours. De plus, il serait tr&#232;s 
int&#233;ressant de pouvoir exploiter les diff&#233;rentes marques non textuelles que l'on trouve dans les 
pages Web : la disposition, la structure et la mise en forme (couleurs, polices, etc.). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Weiser 
</p>
<p>Par ailleurs, nous travaillons &#224; l&#8217;&#233;laboration d&#8217;un langage formel de description des 
connaissances mobilis&#233;es pour extraire des informations &#224; partir d&#8217;un arbre. Ce langage 
s&#8217;inspirera de LangText (Crispino, 2003) et de (Amardeilh, 2007). L&#8217;un des apports de ce 
langage est de formaliser de mani&#232;re d&#233;clarative la notion d&#8217;espace de recherche, d&#8217;indicateur 
et d&#8217;annotation d&#8217;une unit&#233; textuelle. Nous devons n&#233;anmoins adapter ce langage au parcours 
d&#8217;un arbre qui repr&#233;sente la structure d&#8217;une page Web. 
</p>
<p>R&#233;f&#233;rences 
AMARDEILH F., (2007). Web S&#233;mantique et Informatique Linguistique : propositions 
m&#233;thodologiques et r&#233;alisation d&#8217;une plateforme logicielle. Th&#232;se de doctorat. Paris : 
Universit&#233; Paris-Sorbonne. 
</p>
<p>BATTISTELLI D., MINEL J.-L., SCHWER S. (2006). Repr&#233;sentation des expressions calendaires 
dans les textes : une application &#224; la lecture assist&#233;e de biographies. Traitement Automatique 
des Langues 47, 3, 1-26. 
</p>
<p>BRY F., LORENZ B., OHLBACH H. J., SPRANGER S. (2003). On Reasoning on Time and 
Location on the Web. In Workshop on Principles and Practice of Semantic Web Reasoning, 
LNCS 2901, Springer-Verlag. 
</p>
<p>CRISPINO G. (2003). Une plate-forme informatique de l&#8217;Exploration Contextuelle : 
mod&#233;lisation, architecture et r&#233;alisation (ContextO) &#8211; Application au filtrage s&#233;mantique de 
textes. Th&#232;se de doctorat. Paris : Universit&#233; Paris-Sorbonne. 
</p>
<p>NO&#203;L L., CARLONI O., MOREAU N., WEISER S. (2008). Designing a knowledge-based tourism 
information system. Int. J. of Digital Culture and Electronic Tourism, Special Issue on 
National Tourism Organisations and Exploitation of Information Technologies, en cours de 
publication. 
</p>
<p>PITON O., MAUREL D. (2004). Les Noms Propres G&#233;ographiques et le Dictionnaire Prolintex. 
Cahiers de la MSH Ledoux, S&#233;rie Archive, Bases, Corpus 1, 53-76.  
</p>
<p>STERN R.-D. (2007). Expression linguistique du temps et repr&#233;sentation ontologique : OWL-
Time et &#233;tude des adverbiaux temporels. M&#233;moire de master. Paris : Universit&#233; de Paris-
Sorbonne. 
</p>
<p>TENIER S., TOUSSAINT Y., NAPOLI A, POLANCO X. (2006). Instantiation of relations for 
semantic annotation. Actes de the 2006 IEEE/WIC/ACM International Conference on Web 
Intelligence, IEEE, Computer Society Press, 463-472. </p>

</div></div>
</body></html>