<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Description de la structure de la phrase japonaise en vue d'une analyse syntaxique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Recital 2008, Avignon, 9-13 juin 2008
</p>
<p>Description de la structure de la phrase japonaise en vue d'une 
analyse syntaxique 
</p>
<p>Alexis Kauffmann
</p>
<p>LATL (Laboratoire d'Analyse et de Technologie du Langage) &#8211; 
Universit&#233; de Gen&#232;ve, 2, rue de Candolle, 1211 Gen&#232;ve, Suisse
</p>
<p>alexis.kauffmann@lettres.unige.ch
</p>
<p>R&#233;sum&#233; Nous d&#233;crivons la fa&#231;on dont est form&#233;e la phrase japonaise, avec son contenu 
minimal, la structure des composants d'une phrase simple et l'ordre des mots dans ses 
composants, les diff&#233;rentes phrases complexes et les possibilit&#233;s de changements modaux. Le 
but de cette description est de permettre l'analyse de la phrase japonaise selon des principes 
universels tout en restant fid&#232;les aux particularit&#233;s de la langue. L'analyseur syntaxique 
multilingue FIPS est en cours d'adaptation pour le japonais selon les r&#232;gles de grammaire qui 
ont &#233;t&#233; d&#233;finies. Bien qu'il fonctionnait alors uniquement pour des langues occidentales, les 
premiers r&#233;sultats sont tr&#232;s positifs pour l'analyse des phrases simples, ce qui montre la 
capacit&#233; de Fips &#224; s'adapter &#224; des langues tr&#232;s diff&#233;rentes.
</p>
<p>Abstract We describe here the way the Japanese sentence is structured, with its minimal 
content, the structure of its  components, the different kinds of complex sentences and the 
possible modal effects. The aim of this description is to analyse the Japanese sentence in a 
universal way while respecting the language properties.  The syntactic parser FIPS is  now 
being developed to analyse Japanese sentences following grammar rules coming from this 
syntactic description. Even though the parser used to be used for Western languages only, the 
first results of simple Japanese sentence analysis are very positive. This shows how FIPS can 
adapt easily to very different languages.
</p>
<p>Mots-cl&#233;s :   Analyse Syntaxique, Japonais, Grammaire
Keywords :   Syntactic Parser, Japanese language, Grammar
</p>
<p>1 Introduction
L'analyse syntaxique automatique du japonais est un sujet complexe qui a &#233;t&#233; abondamment 
abord&#233;,  notamment  au  Japon.  Nous  l'abordons ici  dans  un  cadre  multilingue,  en utilisant 
l'analyseur FIPS du LATL, qui peut d&#233;j&#224; effectuer des analyses de plusieurs langues, dont 
notamment l'allemand, l'anglais, le fran&#231;ais, l'espagnol, l'italien et le grec.
</p>
<p>L'analyseur FIPS (Wehrli, 2007) permet une analyse linguistique profonde de la phrase, en se 
basant sur les principes de la grammaire g&#233;n&#233;rative universelle (Chomsky,1995). Il permet de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Kauffmann
</p>
<p>repr&#233;senter chaque constituant de la phrase selon une structure X-barre simplifi&#233;e de la forme 
[XP G X D], o&#249; XP indique le type de constituant1, X est sa t&#234;te (qui peut &#234;tre vide), et G et D 
sont les listes de sous-constituants de gauche et de droite, qui peuvent aussi &#234;tre vides. FIPS a 
&#233;t&#233; &#233;crit en Component Pascal selon une architecture &#224; objets, avec des modules d'analyses 
g&#233;n&#233;riques et  d'autres qui  impl&#233;mentent  chacune des  r&#232;gles syntaxiques sp&#233;cifiques  &#224;  une 
langue donn&#233;e. Cependant, il a jusqu'&#224; maintenant &#233;t&#233; utilis&#233; essentiellement pour des langues 
occidentales.
</p>
<p>La probl&#233;matique li&#233;e &#224; l'ajout du japonais se situe &#224; deux niveaux importants. Il faut d'une 
part,  r&#233;ussir  &#224;  surmonter  les  diff&#233;rences  essentielles  entre  le  japonais  et  les  langues 
occidentales : le japonais est &#233;crit avec son propre syst&#232;me d'&#233;criture, comprenant 2 alphabets 
d'une cinquantaine de caract&#232;res, environ 2000 id&#233;ogrammes usuels et d'autres plus rares; il ne 
comporte pas d'espaces entre les mots et peut s'&#233;crire soit de haut en bas et de droite &#224; gauche, 
soit dans le sens des langues occidentales. D'autre part, il faut pouvoir analyser les phrases 
japonaises selon les principes syntaxiques de la grammaire universelle tout en tenant compte 
des  sp&#233;cificit&#233;s  de  la  grammaire  japonaise  et  des  difficult&#233;s  li&#233;es  a  son  analyse:  absence 
fr&#233;quente de formulation de certains constituants dans la phrase,  scrambling2, possibilit&#233; de 
phrases  adjectivales,  absence  de  d&#233;terminants  finis  ou  ind&#233;finis,  r&#244;le  fort  jou&#233;  par  les 
particules dans la phrase, etc.
</p>
<p>L'int&#233;gration de la langue japonaise &#224; l'analyseur s'est d&#233;roul&#233;e en plusieurs &#233;tapes et n'est pas 
encore  finie.  Apr&#232;s  avoir  cr&#233;&#233;  un  g&#233;n&#233;rateur  morphologique  pour  les  verbes3 et  adjectifs 
japonais, d&#233;termin&#233; une classification lexicale et cr&#233;&#233; un lexique japonais d'environ 15000 
lex&#232;mes,  nous  avons  &#233;tudi&#233;  plus  particuli&#232;rement  la  structure  syntaxique  des  phrases.  Le 
travail  a  consist&#233;   Nous  allons  donc  proposer  ici  une  description  de  la  fa&#231;on  dont  sont 
structur&#233;es les phrases japonaises avec leurs composants et l'ordre des mots &#224; l'int&#233;rieur de ces 
ceux-ci.  On  regardera  ensuite  bri&#232;vement  les  premiers  r&#233;sultats  obtenus  apr&#232;s  un  d&#233;but 
d'impl&#233;mentation des r&#232;gles de grammaire correspondantes.
</p>
<p>2 Travaux existants
La  grammaire  scolaire  habituellement  enseign&#233;e  &#224;  l'&#233;cole  au  Japon  (Hashimoto,  1934) 
m&#233;lange  des   &#233;l&#233;ments  traditionnels  des  grammaires  occidentales  et  des  notions  plus 
typiquement japonaises. Des linguistes ont par la suite cherch&#233; &#224; d&#233;finir des analyses encore 
moins  conditionn&#233;es  par  les  principes  occidentaux  (St-Jacques,  1966).  La  plupart  des 
grammaires japonaises modernes consid&#232;rent bien les particules comme des mots, mais pas 
les terminaisons verbales (Shinamori, 1997). Nous avons suivi cette optique-l&#224;. Les travaux 
linguistiques plus r&#233;cents d&#233;crivent des analyses de phrases selon la grammaire g&#233;n&#233;rative 
(Tsujimura, 1996), en discutant des points comme la fa&#231;on d'analyser les modes ou le r&#244;le des 
particules.
</p>
<p>1 La  phrase  se  divise  en  deux  parties  :  TP  :  &#171;Time  Phrase &#187;  (Syntagme  temporel)  et  parfois  CP  : 
Compl&#233;menteur. On fait une projection fonctionnelle FP pour les adjectifs pr&#233;dicatifs. Les autres constituants 
prennent le nom de leur t&#234;te: DP : d&#233;terminant, NP : nom, VP : verbe, AP : adjectif, AdvP : adverbe, CP : 
compl&#233;menteur, ConjP : conjonction de coordination, PP : pr&#233;/postposition.
</p>
<p>2 Scrambling : possibilit&#233; de r&#233;ordonnancement par rapport &#224; l'ordre de base des arguments et sujet du verbe.
3 Voir sur le site web du LATL : http://www.latl.unige.ch/french/projets/conjugueur/notes.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Description de la structure de la phrase japonaise en vue d'une analyse syntaxique
</p>
<p>Les analyseurs syntaxiques du japonais existant sont tr&#232;s nombreux, et nous n'en citerons ici 
que quelques uns. Un des plus utilis&#233;s est &#171; KNP &#187; (Kurohashi et Nagao, 1994). Il se base sur 
la grammaire de Masuoka et Takubo (Masuoka et Takubo, 1992). La classification lexicale 
que nous utilisons  est  proche de celle de cette  grammaire.  KNP ne cr&#233;e pas  une analyse 
syntaxique profonde mais une structure de d&#233;pendance bas&#233;e sur les cas du japonais. Tsujii a 
cr&#233;&#233; un analyseur du japonais bas&#233; sur une grammaire HPSG (Mitsuishi J.,  Torisawa, K., 
Tsujii  J.,  1998),  permettant  une  analyse  de  structure  plus  profonde.  Plus  r&#233;cemment,  de 
nombreux analyseurs probabilistes ont &#233;t&#233; mis au point, comme celui de Kawahara (Kawahara 
et Kurohashi, 2006). Les trois projets monolingues qui viennent d'&#234;tre &#233;voqu&#233;s ont eu de bons 
r&#233;sultats d'analyse, avec des r&#233;sultats &#233;valu&#233;s corrects &#224; 90% environ. Le projet MedSLT, lui, 
est  un  projet  multilingue  d'analyse  et  de  traduction  automatique  &#224;  base  de  r&#232;gles 
grammaticales qui analyse le japonais (Santaholma, 2007). Mais contrairement &#224; FIPS, il est 
sp&#233;cialis&#233; uniquement dans le langage du domaine m&#233;dical. 
</p>
<p>3 Structure de la phrase japonaise
</p>
<p>3.1 La phrase minimale
</p>
<p>On peut consid&#233;rer qu'il existe en japonais trois structures typiques de phrases minimales : les 
phrases verbales, les phrases adjectivales et les phrases pr&#233;dicatives (&#224; copule). Le sujet n'est 
pas forc&#233;ment formul&#233;, le japonais &#233;tant une langue pro-drop4.
</p>
<p>3.1.1 la phrase verbale minimale
</p>
<p>Elle est constitu&#233;e d'un verbe. Dans l'analyse de la grammaire, il est propos&#233; un sujet nul qui 
est repr&#233;sent&#233; par un syntagme nominal5 (Determiner Phrase: DP) vide. Il est inclus dans le 
groupe verbal (Verbal Phrase : VP). On m&#233;taprojette une phrase (Time Phrase: TP).
(1)
</p>
<p>     &#39135;&#12409;&#12414;&#12377;&#12290;
</p>
<p>            MangePR&#201;SENT POLI =&gt; Je (/tu/il/elle/on/nous/vous/ils/elles) mange (/es/eons/ez/ent) .
Cette phrase est grammaticale, malgr&#233; la non formulation du sujet, qui est implicit&#233; 
uniquement par le contexte, la terminaison du verbe ne variant ni selon la personne ni selon le 
</p>
<p>4 Pro-drop : se dit, en grammaire g&#233;n&#233;rative, d'une langue o&#249; la pr&#233;sence du pronom sujet devant le verbe n'est 
qu'optionnelle. C'est aussi le cas pour l'espagnol, l'italien et les langues slaves.
</p>
<p>5 On consid&#232;re que le d&#233;terminant constitue la t&#234;te du syntagme nominal dans nos analyses. Voir : Abney, S. P. 
(1987). The English Noun Phrase in its Sentential Aspect, MIT, Cambridge MA. 
</p>
<p>TP
</p>
<p>VP
</p>
<p>DP &#39135;&#12409;&#12414;&#12377;
</p>
<p>(Sujet Nul)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Kauffmann
</p>
<p>nombre. Il est &#233;galement possible dans la phrase japonaise que les compl&#233;ments ne soient pas 
explicitement formul&#233;s.
</p>
<p>3.1.2 La phrase adjectivale minimale
Elle est constitu&#233;e d'un adjectif en -&#12356;&#12356;&#12290;Cette cat&#233;gorie d'adjectifs se conjugue selon le 
temps, un peu comme un verbe. 
</p>
<p>(2) [TP[FP[DP ][AP &#38754;&#30333;&#12363;&#12387;&#12383;]]]  Le sujet nul est repr&#233;sent&#233; par un DP vide dans l'analyse. On fait une  
projection fonctionnelle (FP) pour l'adjectif pr&#233;dicatif.
      &#38754;&#30333;&#12363;&#12387;&#12383;&#12290;
</p>
<p>      dr&#244;le/int&#233;ressant PASS&#201;
Ici aussi le sujet est implicit&#233;. Selon le contexte, le sujet peut &#234;tre par exemple une personne : 
&#171; (Kaizou) &#233;tait dr&#244;le &#187; ou alors un sujet plus ind&#233;termin&#233;: &#171; (c') &#233;tait dr&#244;le. &#187; Les phrases 
minimales japonaises sont d'ailleurs souvent sujettes &#224; des demandes de d&#233;sambiguisations au 
cours des conversations.
</p>
<p>3.1.3 La phrase pr&#233;dicatives (&#224; copule) minimale
Elle est constitu&#233;e ainsi : soit nom (ou pronom ou syntagme nominal sans particule) + copule, 
soit adverbe + copule, soit quantifieur + copule, soit adjectif en -&#12394;+ copule. La copule peut, 
selon les cas, soit &#234;tre &#233;quivalente au verbe &#234;tre au temps correspondant avec un sujet exprim&#233; 
ou implicite, soit &#234;tre &#233;quivalente &#224; &#171; c'est &#187;, &#171; ce sont &#187;, &#171; c'&#233;taient &#187;...
</p>
<p>(3)  [TP [VP [DP ][DP &#21531; ]&#12391;&#12377;]]
       &#21531;&#12391;&#12377;&#12290;
</p>
<p>       toi c'est =&gt; C'est toi.
Il ne peut pas y avoir de mot ou de particule de cas entre l'attribut et la copule. La copule seule 
ne peut pas constituer une phrase minimale :
</p>
<p>(4)*&#12384;&#12387;&#12383;&#12290;
    *C'&#233;tait.
En revanche, si la copule n'est pas pr&#233;sente, la phrase reste compr&#233;hensible. On la comprend 
alors comme si l'attribut &#233;tait suivi d'une copule au pr&#233;sent.
</p>
<p>3.2 Ordre des mots et r&#244;le des particules dans une phrase simple
</p>
<p>3.2.1 Ordre des mots
</p>
<p>Le japonais est une langue &#224; t&#234;te finale. L'ordre principal des mots dans la phrase japonaise est 
Sujet-Objet-Verbe.
(5)[TP [VP [DP&#20693; &#12399;]  [DP [NP &#39853; &#12434;]] &#39135;&#12409;&#12383;]] Ici &#224; nouveau les DP sujet et objet sont inclus dans le VP.
                                    &#20693;&#12399; &#39853;&#12434; &#39135;&#12409;&#12383;&#12290;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Description de la structure de la phrase japonaise en vue d'une analyse syntaxique
</p>
<p>     MoiTHEMESUJET saumonOBJ mangerPASS&#201;
     =&gt; Moi j'ai mang&#233; du saumon.
L'ordre des &#233;l&#233;ments de la phrase n'est pas strict, mais en g&#233;n&#233;ral la phrase commence par le 
sujet  th&#233;matique,  puis  vient  ensuite  le  sujet  grammatical,  puis  le  ou  les  objets.  Les 
compl&#233;ments circonstanciels ou adverbes phrastiques peuvent se situer n'importe o&#249; avant le 
verbe ou l'adjectif.
La  phrase  monopropositionnelle  se  termine  par  son  &#233;l&#233;ment  minimal  (verbe  ou  adjectif 
pr&#233;dicatif ou attribut+copule), suivi de l'auxiliaire pour le verbe ou l'adjectif lorsqu'il s'agit 
d'un temps compos&#233;, puis parfois d'une ou plusieurs particules de fin de phrase. Le verbe ou 
l'adjectif peut &#234;tre pr&#233;c&#233;d&#233; par un adverbe, ou dans certains cas plus rares suivi d'une particule 
adverbiale.
</p>
<p>(6) [CP  &#12501;&#12521;&#12531;&#12473;&#12399; [TP [VP[DP ]  [DP  &#12473;&#12494;&#12540;&#12508;&#12540;&#12489;&#12364; ] &#12391;&#12365;&#12414;&#12377;&#12363;]]]  
</p>
<p>              &#12501;&#12521;&#12531;&#12473;&#12399; &#12418;&#12358; &#12473;&#12494;&#12540;&#12508;&#12540;&#12489;&#12364; &#12391;&#12365;&#12414;&#12377;&#12363;&#65311;
</p>
<p>      FranceTHEME   d&#233;j&#224;   snowboardOBJ        fairePOTENTIEL QUESTION
</p>
<p>       =&gt; Est-ce qu'on peut d&#233;j&#224; faire du snowboard en France?
</p>
<p>(7)[CP  &#26481;&#20140;&#12399; [[TP[AdvP  &#20170;][FP [DP][AP  [AdvP &#12392;&#12390;&#12418; ] &#23506;&#12356; ]&#12391;&#12377;]]] 
     ou : [TP[AdvP  &#20170;] [FP [DP  &#26481;&#20140;&#12399; ][AP [AdvP &#12392;&#12390;&#12418; ] &#23506;&#12356; ]]&#12391;&#12377;]  Dans la premi&#232;re analyse 
&#171; Tokyo &#187; est compl&#233;menteur, dans la deuxi&#232;me il est sujet.
                 &#26481;&#20140;&#12399; &#20170; &#12392;&#12390;&#12418; &#23506;&#12356; &#12391;&#12377;&#12290;
      TokyoTHEME   maintenant    tr&#232;s         froid (c')est.
      =&gt; Il fait tr&#232;s froid &#224; Tokyo en ce moment.
Mais l'ordre et la pr&#233;sence ou non des syntagmes nominaux pr&#233;c&#233;dant le verbe n'&#233;tant pas fixe 
(ph&#233;nom&#232;ne de scrambling), on reconna&#238;t leur fonction essentiellement par le type de particule 
qui leur est attribu&#233;.
</p>
<p>3.2.2 R&#244;le des particules 
</p>
<p>La particule  &#12364; (ga) indique le sujet grammatical, (sauf avec un verbe au mode potentiel ou 
dans certaines phrases adjectivales, voir 3.5.1) tandis que &#12434;(wo) indique l'objet direct. L'objet 
indirect  et  le  compl&#233;ment  circonstanciel  sont  suivis  par  une  particule  postposition.  Une 
particule  de topique indique le  sujet  th&#233;matique.  Le plus souvent,  il  s'agit  de la  particule 
&#12399; (ha). Si le sujet th&#233;matique porte sur un groupe postpositionnel,  la particule de topique 
s'ajoute derri&#232;re la particule postposition. Si le sujet th&#233;matique est le sujet grammatical ou 
l'objet direct de la phrase, alors on l'analysera comme sujet ou objet direct dans le groupe 
verbal (VP) et on ne le pr&#233;sentera pas au niveau compl&#233;menteur (CP). Dans ces cas-l&#224;, la 
particule de topique remplace les particules  &#12364; ou&#12434;. 
</p>
<p>3.3 Structure des groupes nominaux/postpositionnels
</p>
<p>Les syntagmes nominaux(DP) peuvent commencer par un d&#233;terminant possessif, d&#233;monstratif 
ou interrogatif, ou, plus rarement, un pronom d&#233;monstratif ou interrogatif. Il n'existe pas de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Kauffmann
</p>
<p>d&#233;terminant  fini  ou ind&#233;fini,  les  noms n'ont  pas  de genre et   ne s'accordent  pas  selon le 
nombre.  On  peut  ensuite  avoir  un  adjectif,  une  subordonn&#233;e  relative  ou  un  groupe 
postpositionnel au cas possessif pr&#233;c&#233;dant le nom. 
</p>
<p>Il existe trois classes morphologiques d'adjectifs : en &#8211; &#12356;&#12356;, en -  &#12394; et en -&#12398;. Les adjectifs en 
-  &#12356;&#12356; ont leur terminaison qui varie selon le temps. Les adjectifs en -  &#12394; re&#231;oivent le suffixe -
</p>
<p> &#12394; lorsqu'ils se trouvent devant un nom. Ils sont invariables. Les adjectifs en -  &#12398; re&#231;oivent la 
particule -&#12398;(no) lorsqu'ils se trouvent devant un nom. Ce sont en fait des noms qui prennent 
une valeur d'adjectif lorsqu'on leur donne le cas possessif.
</p>
<p>On trouve ensuite le nom. Il est souvent suivi d'une particule. Mais, avant la particule, il peut 
&#234;tre suivi  d'un deuxi&#232;me nom pour former un mot compos&#233;,  ou d'un titre honorifique ou 
professionnel pour un nom propre. 
</p>
<p>(8) [DP &#12371;&#12398; [NP[AP &#36196;&#12356;] &#26412; ]]
         &#12371;&#12398;&#12288;&#36196;&#12356; &#26412;
</p>
<p>       ce        rouge livre
</p>
<p>(9)[DP [DP  &#30000;&#20013; ]&#12373;&#12435;]
          &#30000;&#20013; &#12373;&#12435;
</p>
<p>      Tanaka Monsieur
Un  syntagme  nominal  peut  &#234;tre  &#233;galement  form&#233;  de  plusieurs  syntagmes  nominaux 
coordonn&#233;s par des particules conjonctions de coordination. On peut aussi  lui  associer un 
quantifieur qui peut se placer &#224; plusieurs endroits possibles dans la phrase.
</p>
<p>3.4 Phrase complexe
</p>
<p>On  ne  peut  en  japonais  utiliser  plusieurs  verbes  dans  une  m&#234;me  phrase  qu'en  utilisant 
certaines structures sp&#233;cifiques de subordination, coordination ou &#233;num&#233;ration.
</p>
<p>3.4.1 coordination
</p>
<p>Il  faut  tout  d'abord  remarquer  que  les  conjonctions  de  coordination  utilis&#233;es  entre  des 
syntagmes nominaux et  des  propositions  ne sont  g&#233;n&#233;ral  pas  les m&#234;mes.  Par  exemple,  la 
particule conjonction de coordination  &#12392; (to)  qui signifie &#171; et &#187; ne peut s'employer que pour 
relier  des  syntagmes nominaux,  et  non des  phrases.  Par contre,  on peut  coordonner deux 
propositions avec des particules &#233;quivalentes &#224; &#171; mais &#187;, comme la particule de coordination 
&#12364; (ga).  La premi&#232;re proposition a alors la structure d'une phrase monopropositionnelle sans 
particules de fin de phrase, suivie de la particule de coordination puis souvent d'une virgule 
japonaise &#171; &#12289;&#187;, puis de la deuxi&#232;me proposition.
</p>
<p>3.4.2 Subordination
</p>
<p>On  peut  faire  une  phrase  avec  une  particule  conjonction  de  subordination  entre  deux 
propositions de la m&#234;me mani&#232;re qu'avec une particule conjonction de coordination.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Description de la structure de la phrase japonaise en vue d'une analyse syntaxique
</p>
<p>3.4.3 Subordonn&#233;e relative ou compl&#233;tive
</p>
<p>Il en existe trois types :
</p>
<p>&#9679; subordonn&#233;e compl&#233;tive pr&#233;c&#233;dant un verbe.
</p>
<p>Celle-ci  se construit  avec la particule  de subordination compl&#233;tive  &#12392; (to),  qui  est 
&#233;quivalente &#224; &#171; que &#187; en fran&#231;ais. On &#233;crit la proposition subordonn&#233;e sans particule de 
fin de phrase, suivie de  &#12392; puis du verbe auquel la subordonn&#233;e est rattach&#233;e.
</p>
<p>(10)[TP [VP [DP ][CP [TP [VP [DP ]  &#34892;&#12365;&#12383;&#12356;]]&#12392;]&#35328;&#12387;&#12383;]] Les t&#234;tes des constituants sont finales.
      &#34892;&#12365;&#12383;&#12356;&#12288;&#12392;&#12288;&#35328;&#12387;&#12383;&#12290;
</p>
<p>       vouloir aller     que   avoir dit =&gt; (Il) a dit qu'(il) voulait y aller.
&#9679; subordonn&#233;e relative 
</p>
<p>La construction de la subordonn&#233;e relative ne n&#233;cessite pas de particule :  apr&#232;s la 
proposition subordonn&#233;e sans particule de fin, on ajoute le nom. On ne sait pas &#224; priori 
quel  pronom relatif  il  faudrait  imaginer  entre  la  subordonn&#233;e  et  le  nom :  &#171; qui &#187;, 
&#171; que &#187;, &#171; dont &#187;...   Mais en g&#233;n&#233;ral on le devine ais&#233;ment gr&#226;ce au contexte.
</p>
<p>(11) [DP  [NP [CP [TP [VP [DP ]&#34892;&#12365;&#12383;&#12356;]]]  &#20154;  ]]
      &#34892;&#12365;&#12383;&#12356;&#12288;&#20154;
</p>
<p>      &#12288;vouloir aller  personne =&gt; les gens qui veulent y aller
&#9679; subordonn&#233;e compl&#233;tive exprimant la nominalisation d'un verbe
</p>
<p>Cette subordonn&#233;e se construit  exactement  comme la pr&#233;c&#233;dente. Elle ne peut &#234;tre 
employ&#233;e qu'avec quelques mots comme &#20107;(la chose, l'action) ou  &#12392;&#12371;&#12429; (le lieu), ou 
alors avec la particule de nominalisation  &#12398; &#224; la place du nom. Elle transforme le verbe 
en un nom, qui doit se comprendre un peu comme un infinitif fran&#231;ais.
</p>
<p>(12) [DP  [NP [CP [TP [VP[DP ]  &#27891;&#12368; ]]]  &#20107;  ]]
             &#27891;&#12368; &#20107;
</p>
<p>                nager    chose =&gt; l'action de nager =&gt; nager
</p>
<p>3.4.4 Enum&#233;ration verbale
</p>
<p>On peut en japonais faire une phrase avec plusieurs verbes juxtapos&#233;s. Dans une telle phrase, 
seul le dernier verbe est r&#233;ellement un verbe conjugu&#233;, le ou les autres &#233;tant  obligatoirement &#224; 
une forme participiale. Si la forme participiale est le g&#233;rondif en -&#12390;, c'est comme si on avait 
&#171;et &#187; ou &#171;et puis &#187; entre les groupes verbaux.
</p>
<p>(13)[TP  [ConjP   [TP[VP [DP &#31169;&#12399;] &#36215;&#12365;&#12390;]]   [TP[VP[DP &#12471;&#12515;&#12527;&#12540;&#12434;]  &#28020;&#12403;&#12390;]]   [TP[VP [DP &#26397;&#12372;&#39151;&#12434;]
 &#39135;&#12409;&#12414;&#12375;&#12383;]]   ]] On groupe les propositions comme si elles &#233;taient coordonn&#233;es avec un ConjP.
                     &#31169;&#12399; &#36215;&#12365;&#12390;&#12289; &#12471;&#12515;&#12527;&#12540;&#12434; &#28020;&#12403;&#12390;&#12289; &#26397;&#12372;&#39151;&#12434; &#39135;&#12409;&#12414;&#12375;&#12383;&#12290;
JeTHEMESUJET  se leverGEROND,  doucheOBJ   prendreGEROND, petit-d&#233;jeunerOBJ mangerPASS&#201; POLI
=&gt;Je me suis lev&#233;, j'ai pris ma douche et puis j'ai mang&#233; mon petit-d&#233;jeuner.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Kauffmann
</p>
<p>3.5 Changements modaux : Potentiel, Passif
</p>
<p>En japonais le verbe peut &#234;tre conjugu&#233; &#224; diff&#233;rents modes. La structure de la phrase se trouve 
chang&#233;e, par rapport &#224; la structure d'une phrase dont le verbe est &#224; l'indicatif, si le verbe est au 
mode factitif, au factitif passif, ou notamment au potentiel ou au passif. 
</p>
<p>3.5.1 Mode potentiel
</p>
<p>Le mode potentiel exprime la capacit&#233; &#224; accomplir une action, un peu comme le modal &#171; can &#187; 
en anglais. Il existe deux mani&#232;res diff&#233;rentes d'analyser le mode potentiel.
</p>
<p>Dans  la  premi&#232;re  analyse  on  consid&#232;re  que  le  mode  potentiel  a  une  structure  passive, 
traduisible litt&#233;ralement par &#171; pouvoir &#234;tre+participe pass&#233; &#187;, et que donc la particule &#12364;(ga) 
indique bien le sujet grammatical.
(14) [CP &#12450;&#12531;&#12488;&#12491;&#12399; [[TP[VP [DP &#12486;&#12491;&#12473;&#12364;]  &#12391;&#12365;&#12427; ]]]
                        &#12450;&#12531;&#12488;&#12491;&#12399; &#12486;&#12491;&#12473;&#12364; &#12391;&#12365;&#12427;&#12290;
</p>
<p>       AnthonyTHEME   tennisSUJET   fairePOTENTIEL
       =&gt; Pour Anthony, le tennis peut &#234;tre fait.=&gt; Anthony sait jouer au tennis.
Cette analyse s'adapte bien au fait que la forme traditionnelle potentielle des verbes du 2&#232;me 
groupe est la m&#234;me que leur forme passive. De plus, elle ressemble &#224; l'analyse des phrases 
adjectivales, qui utilisent &#233;galement les particules &#12399;(ha) et &#12364;(ga).
(15) [CP &#12450;&#12531;&#12488;&#12491;&#12399; [TP[FP [DP  &#36275;  &#12364; ] [AP  &#30171;&#12356;] ]]]
                      &#12450;&#12531;&#12488;&#12491;&#12399;  &#36275;         &#12364; &#30171;&#12356;&#12290;
</p>
<p>       AnthonyTHEME   jambeSUJET  douloureuse
      =&gt;Anthony, sa jambe est douloureuse.=&gt;Anthony a mal &#224; la jambe.
Cependant, cette m&#233;thode ne marche que pour les verbes transitifs, pas pour les  intransitifs. 
Dans la deuxi&#232;me m&#233;thode d'analyse, qui fonctionne pour les verbes transitifs ou intransitifs, 
on  consid&#232;re  que  le  mode  potentiel  &#224;  une  structure  active,  traduisible  litt&#233;ralement  par 
&#171; pouvoir +verbe &#187;, et que  &#12364; , qui remplace  &#12434; (wo), indique l'objet direct et non le sujet 
grammatical dans les phrases au mode potentiel.
</p>
<p>(16) [TP[VP [DP &#12450;&#12531;&#12488;&#12491;&#12399;] [DP &#12486;&#12491;&#12473;&#12364;]  &#12391;&#12365;&#12427; ]]
                            &#12450;&#12531;&#12488;&#12491;&#12399; &#12486;&#12491;&#12473;&#12364; &#12391;&#12365;&#12427;&#12290;
</p>
<p>     AnthonyTHEMESUJET   tennisOBJET   fairePOTENTIEL
     =&gt; Anthony peut faire du tennis. =&gt; Anthony sait jouer au tennis.
Cette analyse permet aussi de comprendre l'usage de  &#12434; &#224; la place de &#12364; dans les phrases au 
mode potentiel, qui est de plus en plus accept&#233; &#224; l'oral. Elle peut &#233;galement &#234;tre utilis&#233;e pour 
certaines phrases adjectivales exprimant la capacit&#233; o&#249;   &#12364; n'indique vraisemblablement pas le 
sujet grammatical.
Il faut par ailleurs ajouter qu'il existe des verbes qui sont par d&#233;finition au mode potentiel (ex : 
&#12431;&#12363;&#12427;), ou factitif, alors que la plupart des verbes ont leur infinitif d&#233;fini &#224; l'indicatif.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Description de la structure de la phrase japonaise en vue d'une analyse syntaxique
</p>
<p>3.5.2 Mode passif
&#9679; passif direct
</p>
<p>Au passif direct, pour un verbe transitif, l'objet direct de la phrase active correspondante 
devient le sujet. Il est suivi de &#12364;, qui peut &#234;tre remplac&#233; par la particule de topique &#12399;. 
Le compl&#233;ment d'agent, s'il est exprim&#233;, est suivi de &#12395;(ni), ou &#12395;&#12424;&#12387;&#12390; parfois.
</p>
<p>(17) [TP [VP [DP [NP   &#26412;&#12364; ]]   [PP[DP  &#39640;&#27211; ]&#12395;]  &#35501;&#12414;&#12428;&#12383;]]
                                            &#26412;&#12364; &#39640;&#27211;&#12395; &#35501;&#12414;&#12428;&#12383;&#12290;
</p>
<p>            (le)livreSUJET   Takahashi par   lirePASS&#201; PASSIF 
&#9679; passif indirect
</p>
<p>Au passif indirect, c'est l'objet indirect de la phrase active qui devient sujet, comme c'est 
parfois le cas en anglais.
</p>
<p>(18)   &#20809;&#23376;&#12364;                           &#19981;&#21619;&#12356; &#39827;&#12434; &#22770;&#12425;&#12428;&#12383;&#12290;
                  MitsukoSUJET mauvais   sushiOBJ      vendre PASS&#201; PASSIF
                    =&gt; Mitsuko, on lui a vendu des mauvais sushis.
</p>
<p>Au passif indirect, on peut aussi former un passif avec un verbe intransitif. 
</p>
<p>(19)                                   &#20809;&#23376;&#12399; &#38632;&#12395; &#38477;&#12425;&#12428;&#12383;&#12290;
                 MitsukoTHEMESUJET    pluie par     tomber PASS&#201; PASSIF 
            =&gt; Mitsuko a &#233;t&#233; mouill&#233;e par la pluie./ Mitsuko a pris la pluie.
</p>
<p>4 Impl&#233;mentation et premiers r&#233;sultats
Apr&#232;s avoir fini la description des phrases japonaises, nous en avons d&#233;duit une quarantaine 
de r&#232;gles d'analyse syntaxique qui sont en cours d'impl&#233;mentation. 
</p>
<p>L'absence  d'espaces  entre  les  mots  japonais  &#233;tait  une premi&#232;re  difficult&#233;  &#224;  surmonter.  Ce 
probl&#232;me a pu &#234;tre r&#233;gl&#233; en effectuant une analyse morphologique simultan&#233;ment &#224; l'analyse 
syntaxique. Une autre difficult&#233; r&#233;side dans le fait que le japonais est une langue &#224; t&#234;te finale 
avec un ordre des constituants tr&#232;s peu stable, contrairement aux langue occidentales. On a 
donc adapt&#233; l'algorithme d'analyse pour g&#233;n&#233;rer un syntagme temporel avant de rencontrer le 
verbe,  qui  se trouve toujours en fin proposition,  en tenant  bien compte des particules des 
groupes nominaux situ&#233;s avant le verbe.
</p>
<p>Nous avons pour l'instant r&#233;ussi &#224; analyser efficacement les phrases minimales (voir exemples 
1 &#224; 3), les groupes nominaux sans subordonn&#233;e relative (ex. 8 et 9) et la plupart des cas de 
phrases simples (voir exemples 5 &#224; 7). Les premiers r&#233;sultats sont donc tr&#232;s satisfaisants. Il 
subsiste  cependant  des  probl&#232;mes  concernant  l'analyse  des  phrases  complexes  et  des 
subordonn&#233;es relatives. Il faudra par ailleurs am&#233;liorer la prise en charge des noms propres en 
ins&#233;rant dans le lexique des listes importantes de noms propres japonais, ou de noms propres 
&#233;trangers retranscrits en japonais.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexis Kauffmann
</p>
<p>5 Conclusion 
La  description  propos&#233;e  des  propri&#233;t&#233;s  grammaticales  de  la  langue  japonaise  et 
l'impl&#233;mentation des r&#232;gles correspondant &#224; ces propri&#233;t&#233;s ont permis de rendre possible une 
analyse syntaxique des phrases japonaises par l'analyseur multilingue FIPS. Avec une analyse 
profonde  et  un  lexique  riche,  celui-ci  peut  retrouver  des  relations  de  d&#233;pendances  peu 
configurationnelles.  Il  peut  g&#233;rer  le  ph&#233;nom&#232;ne  du  scrambling  gr&#226;ce  au  traitement  des 
particules, et il permet de g&#233;rer les t&#234;tes finales gr&#226;ce aux param&#232;tres de son sch&#233;ma x-barre, 
en fixant le sp&#233;cifieur et les compl&#233;ments &#224; gauche et la t&#234;te &#224; droite. De plus, une analyse 
selon la grammaire universelle, applicable &#224; toutes les langues, est plus exploitable pour la 
traduction automatique du japonais avec une autre langue qu'une analyse dans une grammaire 
trop sp&#233;cifique au japonais. On esp&#232;re donc par la suite utiliser les analyses du japonais pour 
de la traduction automatique. 
</p>
<p>Remerciements 
Je  voudrais  remercier  Izumi  Tahara  et  Christopher  Laenzlinger  pour  l'aide  qu'ils  m'ont 
apport&#233;e.
</p>
<p>R&#233;f&#233;rences 
HASHIMOTO S.(1934) &#22269;&#35486;   &#27861;&#35201;&#35500; Tokyo,  Meiji Shoin.
SAINT-JACQUES B.(1966)  Analyse  structurale  de  la  syntaxe  du  japonais  moderne. Librairie 
C.Klincksieck.
</p>
<p>KUWAE R. (1980) Manuel de Japonais, L'Asiath&#232;que. 
</p>
<p>MASUOKA T et TAKUBO Y.(1992) &#22522;&#30990;&#26085;&#26412;&#35486;&#25991;&#27861;, Kurishio Shuppan, Tokyo.
</p>
<p>KUROHASHI S. et NAGAO M. (1994) A syntactic analysis method of long Japanese sentences 
based on the detection of conjunctive structures. Computational Linguistics, 20(4) :507&#8211;534.
</p>
<p>CHOMSKY N. (1995) The Minimalist Program,Cambridge, Mass., MIT Press.
</p>
<p>TSUJIMURA N. (1996) An introduction to Japanese Linguistics, Blackwell Publishers.
</p>
<p>SHINAMORI R. (1997) Grammaire Japonaise Syst&#233;matique, Jean Maisonneuve.
</p>
<p>MITSUISHI J., TORISAWA, K., TSUJII J.(1998) HPSG-Style Underspecified Japanese Grammar with 
Wide Coverage. Actes de COLING&#8212;ACL 98 , pp. 876--880 Montreal, Canada.
</p>
<p>KAWAHARA D. et KUROHASHI S. (2006) : A Fully-Lexicalized Probabilistic Model for Japanese 
Syntactic and Case Structure Analysis, Actes de HLT2006, pp.176-183, New York. USA.
</p>
<p>WEHRLI E.(2007) : Fips, a &#8220;Deep&#8221; Linguistic Multilingual Parser, Actes de ACL2007, Prague.
</p>
<p>SANTAHOLMA M.(2007). Grammar sharing techniques for rule-based multilingual NLP systems. 
Actes de NODALIDA 2007,  Tartu, Estonia. </p>

</div></div>
</body></html>