<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une grammaire formelle du cr&#233;ole martiniquais pour la g&#233;n&#233;ration automatique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Une grammaire formelle du cr&#233;ole martiniquais pour la
g&#233;n&#233;ration automatique
</p>
<p>Pascal Vaillant
Universit&#233; des Antilles-Guyane &#8212; UFR de Lettres et Sciences Humaines
</p>
<p>B.P. 7207 &#8212; 97275 SCHOELCHER CEDEX &#8212; Martinique, France
M&#233;l : pascal.vaillant@martinique.univ-ag.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Cr&#233;ole, Martiniquais, Grammaire, TAG, G&#233;n&#233;ration
Creole, Martiniquese, Grammar, TAG, Generation
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Nous pr&#233;senterons dans cette communication les premiers travaux de mod&#233;lisation informa-
tique d&#8217;une grammaire de la langue cr&#233;ole martiniquaise, en nous inspirant des descriptions
fonctionnelles de Damoiseau (1984) ainsi que du manuel de Pinalie &amp; Bernab&#233; (1999). Pre-
nant appui sur des travaux ant&#233;rieurs en g&#233;n&#233;ration de texte (Vaillant, 1997), nous utilisons un
formalisme de grammaires d&#8217;unification, les grammaires d&#8217;adjonction d&#8217;arbres (TAG d&#8217;apr&#232;s
l&#8217;acronyme anglais), ainsi qu&#8217;une mod&#233;lisation de cat&#233;gories lexicales fonctionnelles &#224; base
syntaxico-s&#233;mantique, pour mettre en &#339;uvre une grammaire du cr&#233;ole martiniquais utilisable
dans une maquette de syst&#232;me de g&#233;n&#233;ration automatique. L&#8217;un des int&#233;r&#234;ts principaux de ce
syst&#232;me pourrait &#234;tre son utilisation comme logiciel outil pour l&#8217;aide &#224; l&#8217;apprentissage du cr&#233;ole
en tant que langue seconde.
</p>
<p>In this article, some first elements of a computational modelling of the grammar of the Marti-
niquese French Creole dialect are presented. The sources of inspiration for the modelling is the
functional description given by Damoiseau (1984), and Pinalie&#8217;s &amp; Bernab&#233;&#8217;s (1999) grammar
manual. Based on earlier works in text generation (Vaillant, 1997), a unification grammar forma-
lism, namely Tree Adjoining Grammars (TAG), and a modelling of lexical functional categories
based on syntactic and semantic properties, are used to implement a grammar of Martiniquese
Creole which is used in a prototype of text generation system. One of the main applications of
the system could be its use as a tool software supporting the task of learning Creole as a second
language.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>1 Introduction
</p>
<p>Le cr&#233;ole martiniquais est l&#8217;un des repr&#233;sentants de la famille des langues cr&#233;oles &#224; base lexicale
fran&#231;aise de la zone Am&#233;rique-Cara&#239;bes (&#171; CRELFACS &#187;). Ces langues peuvent &#234;tre d&#233;crites tr&#232;s
g&#233;n&#233;ralement parmi celles qui se sont form&#233;es dans une situation de contact ; mais l&#8217;expres-
sion rel&#232;ve ici d&#8217;un euph&#233;misme consid&#233;rable, le &#171; contact &#187; consistant en l&#8217;occurrence en la
d&#233;portation massive de peuples de langues diff&#233;rentes, oblig&#233;s d&#8217;adopter en peu de temps un
v&#233;hiculaire comme nouveau moyen d&#8217;expression. La situation historique &#233;voqu&#233;e est celle de
la colonisation du Nouveau Monde par les puissances europ&#233;ennes entre le XVIIe et le XIXe
si&#232;cle, et de l&#8217;importation massive et forc&#233;e de main d&#8217;&#339;uvre africaine engendr&#233;e par le syst&#232;me
&#233;conomique esclavagiste.
</p>
<p>Les cr&#233;oles ont ainsi subi simultan&#233;ment, en l&#8217;espace d&#8217;&#224; peine quelques g&#233;n&#233;rations, plusieurs
processus d&#8217;&#233;volution diachronique rapides (Alleyne, 1996). Certains sont assez faciles &#224; se
repr&#233;senter et sont l&#8217;objet d&#8217;une description relativement classique : ce sont par exemple les
d&#233;veloppements de tournures analytiques, du m&#234;me type que ceux qui ont conduit du latin au
langues romanes modernes, et qui sont encore &#224; l&#8217;&#339;uvre dans le fran&#231;ais actuel (plus d&#233;velop-
p&#233;es dans les vari&#233;t&#233;s de fran&#231;ais populaire qui &#233;taient parl&#233;es par les colons que dans la langue
standard, ces tournures auraient ainsi pu selon Chaudenson (1995) contribuer directement &#224; in-
fluencer le lexique et la grammaire cr&#233;ole). D&#8217;autres, beaucoup plus sp&#233;cifiques &#224; la situation
et beaucoup moins &#224; la port&#233;e de l&#8217;investigation linguistique historique, ont pu provoquer des
amalgames de structures lexicales et syntaxiques fran&#231;aises d&#8217;une part, et de structures prove-
nant de plusieurs langues africaines d&#8217;autre part, la propagation de mod&#232;les linguistiques variant
dans certains cas avec l&#8217;influence de certains groupes de peuplement, qui jouissaient &#224; certaines
&#233;poques de situations de domination d&#233;mographique ou culturelle relative (Alleyne, 1996). Les
cr&#233;oles ont en fin de compte d&#233;velopp&#233; un syst&#232;me s&#233;mantique et un syst&#232;me syntaxique tout &#224;
fait original, tout en gardant incontestablement une base lexicale majoritairement fran&#231;aise.
Ces consid&#233;rations historiques ne sont pas l&#8217;objet du travail pr&#233;sent&#233; ici, mais leur rappel permet
de resituer dans leur perspective les caract&#232;res originaux des crelfacs.
</p>
<p>Dans une perspective synchronique, quoi qu&#8217;il en soit, nous nous sommes attach&#233;s &#224; mettre
sur pied une mod&#233;lisation ad&#233;quate et &#233;conomique des descriptions linguistiques du syst&#232;me
actuel de la langue. Nous nous sommes appuy&#233;s, pour le c&#339;ur de la description des &#233;nonc&#233;s,
sur l&#8217;approche fonctionnelle de Damoiseau (1984), tout en ayant recours pour des descriptions
plus fines &#224; certains exemples de (Bernab&#233;, 1983) et de (Pinalie &amp; Bernab&#233;, 1999).
Le cr&#233;ole martiniquais est l&#8217;un des repr&#233;sentants de la famille des crelfacs, avec le guyanais,
le trinidadien (en voie d&#8217;extinction, au profit de l&#8217;anglais), le saint-lucien, les dialectes domi-
nicais, les dialectes guadeloup&#233;ens, les dialectes ha&#239;tiens, et le louisianais. Il a la particularit&#233;
d&#8217;&#234;tre l&#8217;un des plus unifi&#233;s, et partage par ailleurs avec le cr&#233;ole de Port-au-Prince (devenu
langue nationale d&#8217;Ha&#239;ti) une richesse en termes de production culturelle qui ne se retrouve
qu&#8217;&#224; un degr&#233; moindre dans d&#8217;autres pays cr&#233;olophones. L&#8217;approche pr&#233;sent&#233;e ici est cependant
ais&#233;ment transposable &#224; d&#8217;autres langues du m&#234;me groupe, notamment le guadeloup&#233;en et le
guyanais.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une grammaire formelle du cr&#233;ole martiniquais
</p>
<p>2 Description
</p>
<p>Nous exposons ici quelques faits grammaticaux succints ; des descriptions plus compl&#232;tes des
faits de grammaire du cr&#233;ole martiniquais se trouvent dans les ouvrages d&#233;j&#224; cit&#233;s (Damoiseau,
1984; Bernab&#233;, 1983; Pinalie &amp; Bernab&#233;, 1999).
Le cr&#233;ole est une langue isolante, dans laquelle les &#233;l&#233;ments lexicaux sont invariables. Les
fonctions syntaxiques sont toutes manifest&#233;es par l&#8217;ordre des &#233;l&#233;ments dans la phrase.
</p>
<p>Groupes verbaux
</p>
<p>L&#8217;absence de flexion nominale est d&#233;j&#224; famili&#232;re &#224; un lecteur francophone. Comme le fran&#231;ais, et
contrairement aux langues &#224; flexion nominale comme le latin ou le russe, le cr&#233;ole ne d&#233;termine
la fonction des actants et des circonstants des verbes que par deux proc&#233;d&#233;s : (a) leur position
dans la cha&#238;ne syntaxique, et (b) des pr&#233;positions introduisant des cas s&#233;mantiques sp&#233;cifiques.
L&#8217;ordre des actants et des circonstants a tendance a &#234;tre plus rigide encore qu&#8217;en fran&#231;ais, le
proc&#233;d&#233; (a) ayant un p&#233;rim&#232;tre d&#8217;emploi plus &#233;tendu encore. Ainsi, en cr&#233;ole, les verbes triva-
lents de type &#171; attributif &#187; (correspondant &#224; des verbes fran&#231;ais comme donner, pr&#234;ter, montrer,
etc.) forment des phrases &#224; l&#8217;aide d&#8217;un cadre de distribution syntaxique des actants qui comporte
trois groupes nominaux directs, l&#224; o&#249; en fran&#231;ais seuls le sujet et l&#8217;objet sont des groupes directs
(le compl&#233;ment d&#8217;attribution &#233;tant introduit par la pr&#233;position &#224; ). Ceci impose un ordre strict,
en l&#8217;occurrence S V A O, pour d&#233;terminer les actants. Ainsi, en fran&#231;ais les phrases (1a) et (1b)
sont toutes deux recevables, alors qu&#8217;en cr&#233;ole seule la phrase (2b) est recevable.
(1a) Pierre a donn&#233; un beau livre &#224; Robert
(1b) Pierre a donn&#233; &#224; Robert un beau livre
(2a) *Py&#232; ba an bel liv Wob&#232;
(2b) Py&#232; ba Wob&#232; an bel liv
La flexion verbale est ici remplac&#233;e par un syst&#232;me d&#8217;expression des variations d&#8217;aspect et de
temps qui est purement analytique, comme celui que l&#8217;on observe en chinois. Les diff&#233;rents
degr&#233;s sont exprim&#233;s par des particules temporelles ou aspectuelles qui sont pr&#233;pos&#233;es au verbe
(contrairement au chinois, o&#249; elles sont postpos&#233;es).
Le nombre de marques possibles du temps et de l&#8217;aspect est limit&#233; ; la gamme d&#8217;emplois de
chacune de ces marques est donc vaste. Cet &#233;tat de choses fait de leur description s&#233;masiolo-
gique une t&#226;che consid&#233;rable, et il est difficile de caract&#233;riser le syst&#232;me de mani&#232;re simple. Un
panorama complet de cette question, ainsi qu&#8217;une description plus particuli&#232;re des diff&#233;rences
entre cr&#233;ole guyanais et martiniquais, est pr&#233;sent&#233; par (Pf&#228;nder, 2000).
Plusieurs descriptions syst&#233;miques ont &#233;t&#233; propos&#233;es ; nous retiendrons pour l&#8217;&#233;tat actuel de
notre mod&#233;lisation celle de Damoiseau (1984, p. 26). Si l&#8217;on peut questionner la pertinence de
la fronti&#232;re stricte qu&#8217;il trace entre marques temporelles et marques aspectuelles, notamment
au sujet de la classification de k&#233; comme marque strictement aspectuelle, son syst&#232;me pr&#233;sente
l&#8217;avantage de recouper en assez grande partie la combinatoire syntagmatique de ces marques :
</p>
<p>TEMPS : ASPECT :
perfectif imperfectif imperfectif
</p>
<p>(duratif, g&#233;n&#233;ral, it&#233;ratif) (prospectif)
(pas d&#8217;indication) &#8709; ka k&#233;
pass&#233; t&#233; t&#233; ka t&#233; k&#233;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>Les combinaisons &#8709;, ka, k&#233;, t&#233;, t&#233; ka et t&#233; k&#233; sont en effet les plus fr&#233;quemment attest&#233;es1.
</p>
<p>Pour donner une id&#233;e des valeurs de ces combinaisons de marques, on peut mentionner certaines
de leurs traductions les plus fr&#233;quentes en fran&#231;ais : mwen d&#242;mi : j&#8217;ai dormi ; mwen ka d&#242;mi :
je dors ; mwen k&#233; d&#242;mi : je vais dormir ; mwen t&#233; d&#242;mi : j&#8217;avais dormi ; mwen t&#233; ka d&#242;mi :
je dormais ; mwen t&#233; k&#233; d&#242;mi : j&#8217;aurais dormi. Il faut cependant bien entendu garder &#224; l&#8217;esprit
qu&#8217;il ne s&#8217;agit pas d&#8217;&#233;quivalences syst&#233;matiques, puisque les syst&#232;mes aspecto-temporels ne se
recoupent pas, et que la notion de &#171; mode &#187; est &#233;trang&#232;re au cr&#233;ole.
</p>
<p>En premi&#232;re approche, on peut sch&#233;matiser les domaines d&#8217;application des syst&#232;mes aspectuel
et temporel en disant que la caract&#233;risation de l&#8217;aspect (&#8709;, ka ou k&#233; ) ne porte que sur des verbes
exprimant un proc&#232;s, alors que la caract&#233;risation du temps (&#8709; ou t&#233; ) s&#8217;applique aussi bien aux
proc&#232;s qu&#8217;aux &#233;tats. On a donc deux s&#233;ries de verbes, celle qui peut suivre les marques &#8709;, ka, k&#233;,
t&#233;, t&#233; ka et t&#233; k&#233;, et celle qui ne peut suivre que &#8709; ou t&#233;. C&#8217;est en ces deux s&#233;ries de verbes, par
exemple, que (Saint-Quentin, 1989), l&#8217;une des premi&#232;res grammaires cr&#233;oles, voulait distinguer
deux &#171; conjugaisons &#187; du cr&#233;ole guyanais.
Selon cette description, les phrases (3a) et (3b) sont donc possibles et leur diff&#233;rence traduit une
nuance d&#8217;aspect, alors que seule la phrase (4a) est recevable.
(3a) I d&#242;mi tout lajounen (il a dormi toute la journ&#233;e)
(3b) I ka d&#242;mi tout lajounen (il passe ses journ&#233;es &#224; dormir)
(4a) I ni anpil lajan (il a beaucoup d&#8217;argent)
(4b) *I ka ni anpil lajan
Cette description est en r&#233;alit&#233; une simplification, puisqu&#8217;il existe bel et bien des contextes
dans lesquels l&#8217;application de marques aspectuelles &#224; des verbes &#171; &#224; signifi&#233; non-processif &#187;
(Damoiseau, 1984) est attest&#233;e : rav&#232;t pa ka ni r&#233;zon douvan poul (le ravet n&#8217;a jamais raison
devant la poule) ; ou m&#234;me : l&#232; i ka s&#242;ti kazino i ka ni anpil lajan : &#224; chaque fois qu&#8217;il sort du
casino, il a plein d&#8217;argent. Nous nous en tiendrons cependant &#224; la premi&#232;re approche dans le
cadre de ces premi&#232;res tentatives de mod&#233;lisation.
</p>
<p>Groupes nominaux
</p>
<p>Les groupes nominaux du cr&#233;ole ont un syst&#232;me de degr&#233;s de d&#233;termination qui comprend un
degr&#233; g&#233;n&#233;rique, exprim&#233; par &#8709; (ainsi rav&#232;t et poul dans l&#8217;exemple ci-dessus), un degr&#233; in-
d&#233;termin&#233; (an timanmay : un enfant), un degr&#233; d&#233;fini exprim&#233; par un d&#233;terminant postpos&#233;
(timanmay-la : l&#8217;enfant), et un degr&#233; d&#233;monstratif &#233;galement exprim&#233; par un d&#233;terminant post-
pos&#233; (timanmay-tala : cet enfant). Les d&#233;terminants postpos&#233;s, en martiniquais, peuvent se com-
biner avec une marque pr&#233;pos&#233;e s&#233;- pour former un pluriel d&#233;fini (s&#233;-timanmay-tala : ces en-
fants) &#8212; le pluriel g&#233;n&#233;rique du fran&#231;ais n&#8217;ayant pas d&#8217;&#233;quivalent : on utilise le degr&#233; g&#233;n&#233;rique
du singulier.
</p>
<p>Il n&#8217;existe pas de genre grammatical ; en revanche les noms d&#233;terminent une variation dans le
choix de l&#8217;article d&#233;fini, selon un principe d&#8217;harmonie consonantique et nasale : les mots se
terminant par une voyelle ouverte prennent la marque -a comme d&#233;terminant d&#233;fini, les mots se
</p>
<p>1Les choses sont plus complexes en r&#233;alit&#233;, puisque la combinaison k&#233; ka est &#233;galement attest&#233;e avec une valeur
de futur duratif &#8212; cf. (Pinalie &amp; Bernab&#233;, 1999, p. 77) : l&#232; ou k&#233; riv&#233;, nou k&#233; ka d&#242;mi : quand vous arriverez, nous
serons en train de dormir. La combinaison t&#233; k&#233; ka est m&#234;me possible (comme dans la chanson de zouk : &#171; Kol&#233;
s&#233;r&#233; nou t&#233; k&#233; ka dans&#233; &#187; ' nous serions en train de danser l&#8217;un contre l&#8217;autre). Valdman (1978, p. 219) expose
un syst&#232;me plus complet fond&#233; sur deux cat&#233;gories d&#8217;aspect (&#177;continuatif,&#177;prospectif), et une cat&#233;gorie de temps
(&#177;pass&#233;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une grammaire formelle du cr&#233;ole martiniquais
</p>
<p>terminant par une consonne ou par une semi-voyelle (y ou w ) prennent la marque -la. Ceci ne
s&#8217;applique qu&#8217;aux mots dont la derni&#232;re syllabe est non-nasalis&#233;e ; Pour les mots &#224; terminaison
nasale, les marques du d&#233;fini sont respectivement -an et -lan.
</p>
<p>Parties du discours
</p>
<p>L&#8217;un des faits les plus frappants du cr&#233;ole, enfin, est l&#8217;absence de fronti&#232;res nettes de cat&#233;gories
grammaticale. La tentation de rapprocher les mots d&#8217;origine fran&#231;aise de leurs &#233;tymons et de
leur attribuer la m&#234;me cat&#233;gorie (nom, verbe, adjectif ...) est souvent grande, et elle a m&#234;me as-
sez fr&#233;quemment une certaine pertinence, mais cette analogie est trompeuse. Dans beaucoup de
cas en effet, si un mot peut &#234;tre utilis&#233; dans le m&#234;me emploi grammatical que son &#233;tymon fran-
&#231;ais, il poss&#232;de &#233;galement d&#8217;autres emplois, propres &#224; des cat&#233;gories syntaxiques diff&#233;rentes.
</p>
<p>Les adjectifs, par exemple, ont en fran&#231;ais besoin d&#8217;un verbe copule pour figurer en fonction
d&#8217;attribut : le gros arbre vs. l&#8217;arbre est gros. En cr&#233;ole, l&#8217;adjectif seul peut jouer le r&#244;le de pr&#233;-
dicat : gwo py&#233;bwa-a vs. py&#233;bwa-a gwo (cf. chinois d&#224; sh&#249;m&#249; vs. sh&#249;m&#249; d&#224; ). L&#8217;adjectif dans
cette position de pr&#233;dicat-attribut peut &#233;galement recevoir les marques temporelles de la m&#234;me
mani&#232;re que les verbes d&#8217;&#233;tat : py&#233;bwa-tala t&#233; gwo : cet arbre &#233;tait gros ; voire des marques
aspectuelles dans certains contextes, comme les verbes d&#8217;&#233;tat &#233;galement (exemple cit&#233; par Da-
moiseau (1984, p. 29) : i ka las vit : il se fatigue vite). Il est en fait tr&#232;s difficile de fournir une
d&#233;finition permettant de distinguer le verbe en tant que cat&#233;gorie distincte de l&#8217;adjectif autre-
ment que par des crit&#232;res n&#233;gatifs (blocage de la fonction &#233;pith&#232;te).
Au-del&#224; du cas des verbo-adjectivaux, des &#171; noms &#187; peuvent appara&#238;tre en position de pr&#233;dicat (i
yich mwen : c&#8217;est mon enfant), et des &#171; verbes &#187; en fonction nominale (mwen d&#242;mi an bel d&#242;mi :
j&#8217;ai sacr&#233;ment dormi [litt. j&#8217;ai dormi un grand dormir] ; vin pran an bw&#232; : viens prendre un verre
[litt. viens prendre un boire]) ; et ces tournures sont loin d&#8217;&#234;tre des exceptions ou des figures de
style, mais font partie du fonctionnement le plus banal de la langue. Certains verbes, en outre,
occupent des fonctions de pr&#233;position. Ainsi, le verbe ba (donner), qui construit g&#233;n&#233;ralement
des phrases avec trois actants (i ba mwen an pen : il m&#8217;a donn&#233; un pain), peut, accompagn&#233; du
seul actant destinataire, construire un syntagme qui joue le r&#244;le de circonstant pour les verbes
n&#8217;ayant pas le destinataire dans leur cadre valenciel de base. Ainsi dans i p&#242;t&#233; an bout&#232;y wonm
ba mwen : il m&#8217;a apport&#233; une bouteille de rhum, ou mwen ka pal&#233; ba&#8217;w : je suis en train de
te parler (cf. chinois ta&#772; ge&#780;i wo&#780; yi p&#237;ng jiu&#780; : il me donne une bouteille d&#8217;alcool, vs. ta&#772; d&#224;il&#225;i le
yi p&#237;ng jiu&#780; gei wo&#780;, il m&#8217;a apport&#233; une bouteille d&#8217;alcool). Certains verbes enfin peuvent &#234;tre
employ&#233;s comme particules aspectuelles, enrichissant le syst&#232;me fond&#233; sur {&#8709;, ka, k&#233; et t&#233;} ;
ainsi s&#242;ti (sortir) ou fini (finir) dans des tournures comme : es ou kompwann sa yo s&#242;ti di&#8217;w
la ? : est-ce que tu comprends ce qu&#8217;ils viennent de te dire ? (Bernab&#233;, 1983, p. 1057), ou pwan
(prendre) dans : i pwan kouri : il s&#8217;est mis &#224; courir (Bernab&#233;, 1983, p. 1043).
</p>
<p>3 Mod&#233;lisation
</p>
<p>On pourrait donner encore d&#8217;innombrables exemples de cette plasticit&#233; grammaticale ; la le&#231;on
qu&#8217;il convient d&#8217;en tirer dans le cadre de ce travail (mod&#233;lisation informatique), est qu&#8217;il faut
d&#233;velopper un m&#233;canisme pour la prendre en compte, car elle est tout sauf marginale.
</p>
<p>Il serait peu pratique de multiplier les cat&#233;gories grammaticales ad hoc en faisant un pro-
duit cart&#233;sien sur les cat&#233;gories de la grammaire fran&#231;aise pour obtenir des parties du dis-
cours sur-sp&#233;cialis&#233;es (adjectif-verbe-qui-ne-peut-jamais-&#234;tre-un-nom, ou nom-pouvant-servir-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>parfois-de-verbe-d&#8217;&#233;tat ...). Il nous para&#238;t &#233;galement qu&#8217;il serait assez artificiel de pr&#233;voir un
grand nombre de r&#232;gles de conversion ; il semble en d&#233;finitive que la cat&#233;gorie grammaticale
soit une notion moins essentielle en cr&#233;ole martiniquais qu&#8217;en fran&#231;ais, ou autrement dit &#8212; car
il faut bien tout de m&#234;me des fonctions dans l&#8217;&#233;nonc&#233; &#8212; qu&#8217;elle soit plus qu&#8217;ailleurs contextua-
lisable. Le fait qu&#8217;un mot ait la possibilit&#233; de remplir une fonction de sujet (comme un groupe
nominal), d&#8217;&#233;pith&#232;te (comme un adjectif), de pr&#233;dicat (comme un verbe) ... semble pouvoir &#234;tre
d&#233;termin&#233; de mani&#232;re aff&#233;rente aussi bien qu&#8217;inh&#233;rente, pour reprendre ici le vocabulaire de
Rastier (1987). Un mot peut avoir un emploi central de verbe, mais, plac&#233; dans un contexte de
groupe nominal (avec un article, par exemple), pouvoir &#234;tre interpr&#233;t&#233; sans difficult&#233; comme
un nom. De m&#234;me, un nom, plac&#233; directement apr&#232;s le sujet, et &#233;ventuellement temporalis&#233;
par une particule comme t&#233;, peut jouer le r&#244;le d&#8217;un verbe si son sens s&#8217;y pr&#234;te. Ces r&#233;flexions
sont d&#8217;ailleurs probablement valides en principe pour toutes les langues2, quoiqu&#8217;&#224; des degr&#233;s
variables.
</p>
<p>Il a donc &#233;t&#233; choisi de ne retenir que deux grandes cat&#233;gories grammaticales (N et Pred : nom et
pr&#233;dicat), lesquelles peuvent &#234;tre d&#233;termin&#233;es plus sp&#233;cifiquement par des ensembles de traits
caract&#233;risant leurs emplois possibles :
</p>
<p>Pred poss&#232;de les attributs &lt;type&gt;=T, &lt;cadre&gt;=C, &lt;&#177;epithete&gt;. Le type T classe le
mot soit parmi les verbes exprimant un proc&#232;s (d&#242;mi : dormir, manj&#233; : manger, ba : donner,
p&#242;t&#233; : porter, etc.), soit parmi les verbes ou les verbo-adjectivaux exprimant un &#233;tat (ni : avoir,
sav : savoir, gwo : gros/&#234;tre gros, las : fatigu&#233;/&#234;tre fatigu&#233;, etc.). Le cadre C correspond au
cadre d&#8217;attribution de positions syntaxiques aux actants du verbe (sous-cat&#233;gorisation verbale) :
intransitif pour d&#242;mi ou las, transitif pour manj&#233;, attributif pour ba, etc. Le trait &#233;pith&#232;te, &#224;
valeur binaire, d&#233;termine si le mot peut oui ou non appara&#238;tre en position &#233;pith&#232;te, comme un
adjectif : il est positif pour gwo et n&#233;gatif pour manj&#233;, par exemple.
N poss&#232;de l&#8217;attribut &lt;harm&gt;=A, qui d&#233;termine le type de marque de d&#233;termination d&#233;finie qui
doit appara&#238;tre selon la syllabe finale (A peut valoir a, la, an ou lan ). Les noms propres et les
pronoms personnels poss&#232;dent &#233;galement le trait &lt;det&gt;=def, qui exprime le fait qu&#8217;ils sont
d&#233;j&#224; d&#233;finis (et ne se combinent donc plus avec un d&#233;terminant) &#8212; le trait &lt;det&gt; n&#8217;apparais-
sant dans les autres cas qu&#8217;au niveau de barre 2, c&#8217;est-&#224;-dire au niveau du groupe nominal. Le
fait qu&#8217;un N puisse oui ou non appara&#238;tre &#233;galement en fonction verbale est d&#233;termin&#233; par la pr&#233;-
sence, &#224; c&#244;t&#233; de ces traits sp&#233;cifiquement nominaux, du trait &lt;cadre&gt;=C signalant l&#8217;existence
d&#8217;une valence interne.
</p>
<p>Cette conception des cat&#233;gories comme faisceaux de traits &#233;voque celle qui guide le formalisme
des grammaires syntagmatiques g&#233;n&#233;ralis&#233;es (GPSG) (Abeill&#233;, 1993, p. 101&#8211;105). Nous avons
toutefois pr&#233;f&#233;r&#233; utiliser pour ce travail le formalisme des grammaires d&#8217;arbres adjoints &#224; uni-
fication de structures de traits (FS-TAG) (Vijay-Shanker &amp; Joshi, 1988), (Abeill&#233;, 1993, ch. 4),
qui se pr&#234;te tout &#224; fait bien &#224; la g&#233;n&#233;ration (bien qu&#8217;il ait d&#8217;abord &#233;t&#233; con&#231;u pour l&#8217;analyse) gr&#226;ce
&#224; sa capacit&#233; &#224; repr&#233;senter les tours de phrase sous la forme d&#8217;arbres &#233;l&#233;mentaires s&#8217;&#233;tendant sur
plus d&#8217;un seul niveau. L&#8217;utilisation de mod&#232;les d&#8217;arbres adjoints pour la g&#233;n&#233;ration a &#233;t&#233; pour
cette raison adopt&#233;e dans diff&#233;rents travaux de recherche, d&#8217;autant qu&#8217;elle a pu &#234;tre &#233;tendue
au-del&#224; du niveau de la phrase, comme dans le mod&#232;le G-TAG (Danlos, 1998).
Nous n&#8217;avons en revanche pas, pour cette application de g&#233;n&#233;ration, une grammaire TAG en-
ti&#232;rement lexicalis&#233;e ; les arbres sans ancre lexicale nous permettent en effet de donner une
</p>
<p>2Ainsi, un &#233;nonc&#233; comme je m&#232;re-poule mes enfants est tout &#224; fait compr&#233;hensible &#8212; sinon recevable &#8212; en
fran&#231;ais (exemple emprunt&#233; &#224; Jacques Coursil).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une grammaire formelle du cr&#233;ole martiniquais
</p>
<p>description formelle homog&#232;ne &#224; des structures parall&#232;les, dont les unes s&#8217;expriment avec une
marque lexicale et les autres avec une marque z&#233;ro (ex. imperfectif en ka vs. perfectif en &#8709;). En
outre, les arbres sans ancre lexicale permettent (a) de faire l&#8217;&#233;conomie de quelques kilo-octets
de fichier, et de nombreuses op&#233;rations de copie-colle, en regroupant sous un m&#234;me &#171; arbre
sch&#233;ma &#187; toutes les structures verbales ayant le m&#234;me cadre de sous-cat&#233;gorisation ; (b) de
rendre compte des ph&#233;nom&#232;nes linguistiques de degr&#233; de complexit&#233; sup&#233;rieur &#224; la phrase nu-
cl&#233;aire (comme les subordonn&#233;es relatives) (Abeill&#233;, 1993, p. 230).
Construction du GN
</p>
<p>Le N non encore d&#233;fini, mais qui peut avoir d&#233;j&#224; re&#231;u des compl&#233;ments (en termes de th&#233;orie de
X-barre, le &#175;N), se substitue &#224; la position ad&#233;quate dans l&#8217;arbre &#233;l&#233;mentaire du d&#233;terminant pour
former le GN (niveau de barre 2). Le cas du d&#233;terminant ind&#233;fini est illustr&#233; fig. 1a (la valeur du
trait harm, A, est une variable), et un exemple de d&#233;terminant d&#233;fini est illustr&#233; fig. 1b3.
</p>
<p>det
</p>
<p>an
</p>
<p>gn
</p>
<p>n &lt;harm&gt; = A
&lt;det&gt; = &#8722;
</p>
<p>&lt;det&gt; = ind
</p>
<p>n
</p>
<p>gn
</p>
<p>det
</p>
<p>la
</p>
<p>&lt;harm&gt; = la
&lt;det&gt; = &#8722;
</p>
<p>&lt;det&gt; = def
</p>
<p>n
</p>
<p>gn &lt;det&gt; = gen
</p>
<p>&lt;det&gt; = &#8722; n
</p>
<p>gn
</p>
<p>&lt;det&gt; = Degr&#233;
</p>
<p>&lt;det&gt; = Degr&#233;
</p>
<p>FIG. 1 &#8211; Arbres &#233;l&#233;mentaires : (a) du d&#233;terminant ind&#233;fini ; (b) d&#8217;un d&#233;terminant d&#233;fini ; (c) du
degr&#233; de d&#233;termination g&#233;n&#233;rique ; (d) du nom d&#233;j&#224; d&#233;fini.
</p>
<p>Cette mod&#233;lisation place le d&#233;terminant d&#233;fini postpos&#233; apr&#232;s les &#233;ventuels compl&#233;ments, comme
les compl&#233;ments de nom, ou les subordonn&#233;es relatives. Ceci est conforme avec l&#8217;usage du
cr&#233;ole martiniquais, qui dit : kay-la (la maison) ; kay papa mwen an (la maison de mon p&#232;re) ;
kay mwen ja pal&#233; ba&#8217;w la (la maison dont je t&#8217;ai parl&#233;).
Le GN d&#233;termin&#233; au degr&#233; g&#233;n&#233;rique se construit &#224; partir du nom non encore d&#233;termin&#233; gr&#226;ce &#224;
l&#8217;arbre repr&#233;sent&#233; en fig. 1c ; tandis que le GN peut &#233;galement se constituer directement sur la
base d&#8217;un N pr&#233;-d&#233;termin&#233; au niveau lexical, comme un pronom personnel ou un nom propre,
comme illustr&#233; fig. 1d.
</p>
<p>Construction du GPred
</p>
<p>Le pr&#233;dicat conna&#238;t trois niveaux d&#8217;expansion, conform&#233;ment au choix que nous avons fait de
nous conformer au mod&#232;le simplifi&#233; du temps et de l&#8217;aspect pr&#233;sent&#233; par Damoiseau (1984) (cf.
plus haut).
Au niveau lexical, le Pred n&#8217;est marqu&#233; ni en temps ni en aspect. Au niveau 1, il est marqu&#233; en
aspect : soit avec une valeur d&#8217;aspect z&#233;ro, dans le cas o&#249; il s&#8217;agit d&#8217;un &#233;tat ; soit avec une valeur
d&#8217;aspect perfectif, imperfectif ou prospectif, s&#8217;il s&#8217;agit d&#8217;un proc&#232;s. Les arbres correspondant &#224;
l&#8217;aspect z&#233;ro (pour un &#233;tat), et &#224; l&#8217;aspect perfectif (pour un proc&#232;s), sont montr&#233;s respectivement
en fig. 2a et fig. 2b. Les aspects imperfectif et prospectif sont form&#233;s &#224; l&#8217;aide des marques ka et
k&#233;. L&#8217;arbre correspondant au cas de l&#8217;aspect imperfectif est montr&#233; en fig. 2c. L&#8217;aspect prospectif
se construit de la m&#234;me mani&#232;re.
</p>
<p>3N.B. Dans ces figures, comme dans les suivantes, conform&#233;ment &#224; la tradition h&#233;rit&#233;e du langage Prolog et du
formalisme des grammaires &#224; clauses d&#233;finies (DCG), les termes commen&#231;ant par une majuscule correspondent &#224;
des variables, alors que les termes commen&#231;ant par des minuscules correspondent &#224; des valeurs instanci&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>pred
&lt;cadre&gt; = Cadre
</p>
<p>pred
&lt;cadre&gt; = Cadre
&lt;asp&gt; = &#8722;
</p>
<p>&lt;type&gt; = etat
</p>
<p>&lt;asp&gt; = zero
</p>
<p>pred &lt;type&gt; = proc
&lt;cadre&gt; = Cadre
&lt;asp&gt; = &#8722;
</p>
<p>pred
&lt;cadre&gt; = Cadre
&lt;asp&gt; = perf
</p>
<p>pred
</p>
<p>predma
</p>
<p>ka
</p>
<p>&lt;type&gt; = proc
</p>
<p>&lt;asp&gt; = imperf
&lt;cadre&gt; = Cadre
</p>
<p>&lt;cadre&gt; = Cadre
&lt;asp&gt; = &#8722;
</p>
<p>FIG. 2 &#8211; Arbres de construction du pr&#233;dicat : (a) aspect z&#233;ro ; (b) aspect perfectif ; (c) aspect
imperfectif.
</p>
<p>Au niveau 2, le pr&#233;dicat est marqu&#233; en temps, soit avec la marque z&#233;ro (&#8709;), soit avec la marque
du pass&#233; (t&#233; ) ; les m&#233;canismes utilis&#233;s correspondent respectivement, &#224; un niveau d&#8217;expansion
au-dessus, &#224; ceux utilis&#233;s pour marquer respectivement l&#8217;aspect perfectif ou l&#8217;aspect imperfec-
tif sur les pr&#233;dicats-proc&#232;s. La marque de temps s&#8217;applique &#224; un terme de niveau 1 ( &#175;Pred) qui
peut donc &#234;tre soit un &#233;tat (automatiquement &#224; l&#8217;aspect z&#233;ro), soit un proc&#232;s (d&#233;j&#224; marqu&#233; en
aspect). Dans l&#8217;arbre &#233;l&#233;mentaire servant &#224; passer du pr&#233;dicat marqu&#233; en aspect ( &#175;Pred) au pr&#233;-
dicat marqu&#233; en temps et en aspect ( &#175;Pred), le n&#339;ud inf&#233;rieur (n&#339;ud de substitution) doit donc
sp&#233;cifier la pr&#233;sence du trait aspect et l&#8217;absence du trait temps, puis reporter le trait aspect au
niveau sup&#233;rieur, et y ajouter le trait temps &#8212; le n&#339;ud sup&#233;rieur comportant donc en tout les
traits temps, aspect et cadre.
</p>
<p>Enfin, au niveau sup&#233;rieur, GPred, le pr&#233;dicat marqu&#233; en temps et en aspect ( &#175;Pred) est entour&#233;
de ses actants, dans la disposition sp&#233;cifique du cadre de sous-cat&#233;gorisation concern&#233;. Le trait
cadre est supprim&#233;, et un trait satur&#233; est ajout&#233;. La phrase nucl&#233;aire (Ph) est constitu&#233;e d&#8217;un
sujet et d&#8217;un GPred satur&#233;.
Les diff&#233;rents cadres de sous-cat&#233;gorisation sont repr&#233;sent&#233;s par des arbres-sch&#233;ma (fig. 3), qui
engendrent des familles d&#8217;arbre lorsque l&#8217;on y greffe les arbres des diff&#233;rents pr&#233;dicats marqu&#233;s
en temps et en aspect.
</p>
<p>&lt;asp&gt; = Aspect
&lt;tem&gt; = Temps
&lt;cadre&gt; = intrans
</p>
<p>pred
</p>
<p>&lt;asp&gt; = Aspect
&lt;tem&gt; = Temps
&lt;sature&gt; = +
</p>
<p>gpred
</p>
<p>ph
</p>
<p>gn
[sujet]
</p>
<p>[pr&#233;dicat]
</p>
<p>gn
[sujet]
</p>
<p>gpred
</p>
<p>ph
</p>
<p>gn gn
[objet][destinataire]
</p>
<p>pred
[pr&#233;dicat]
</p>
<p>&lt;asp&gt; = Aspect
&lt;tem&gt; = Temps
</p>
<p>&lt;asp&gt; = Aspect
&lt;tem&gt; = Temps
&lt;sature&gt; = +
</p>
<p>&lt;cadre&gt; = attrib
</p>
<p>FIG. 3 &#8211; Arbres sch&#233;ma : (a) des verbes intransitifs ; (b) des verbes attributifs.
</p>
<p>Les circonstants, c&#8217;est-&#224;-dire les r&#244;les s&#233;mantiques qui n&#8217;ont pas pu &#234;tre exprim&#233;s par les actants
du cadre valenciel de base du verbe, sont exprim&#233;s par l&#8217;adjonction de syntagmes pr&#233;position-
nels. Comme dans le cas d&#233;j&#224; &#233;voqu&#233; des compl&#233;ments d&#8217;attribution introduits par ba, le r&#244;le
des pr&#233;positions peut parfois &#234;tre jou&#233; par des verbes accompagn&#233;s d&#8217;un jeu &#171; restreint &#187; d&#8217;ac-
tants. Ces types de syntagmes sont mod&#233;lis&#233;s comme des GPred, &#224; la diff&#233;rence que le verbe
y est utilis&#233; avec un autre cadre de sous-cat&#233;gorisation ; le cas est donc trait&#233; comme une alter-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une grammaire formelle du cr&#233;ole martiniquais
</p>
<p>nance verbale. Ainsi, le verbe ba poss&#232;de, &#224; c&#244;t&#233; de son cadre &#171; complet &#187; (attributif), un cadre
&#171; restreint &#187; (prep_datif) qui est utilis&#233; pour former les arbres auxiliaires pour l&#8217;adjonction de
compl&#233;ments d&#8217;attribution, gr&#226;ce &#224; l&#8217;arbre-sch&#233;ma repr&#233;sent&#233; fig. 4. Un trait satur&#233;, contrai-
gnant l&#8217;adjonction sur le n&#339;ud pied de ce type d&#8217;arbres, garantit que les circonstants ne peuvent
commencer &#224; s&#8217;adjoindre au GPrep qu&#8217;apr&#232;s tous les actants (sujet except&#233;).
</p>
<p>gpred
</p>
<p>gpred
</p>
<p>pred
</p>
<p>ba
</p>
<p>&lt;cadre&gt; = prep_datif
gn
</p>
<p>[destinataire]
</p>
<p>&lt;sature&gt; = +
&lt;cadre&gt; = prep_datif*gpred
</p>
<p>&lt;sature&gt; = +
</p>
<p>FIG. 4 &#8211; Arbre auxiliaire pour exprimer les compl&#233;ments d&#8217;attribution.
</p>
<p>4 M&#233;canisme de g&#233;n&#233;ration
</p>
<p>Le programme r&#233;alis&#233; implante informatiquement les arbres d&#233;crits par des structures PROLOG.
Toutes les op&#233;rations &#233;l&#233;mentaires sur les structures de traits (unification, &#233;crasement) ont &#233;t&#233;
&#233;galement implant&#233;es sous la forme de buts PROLOG, ainsi que les op&#233;rations sur les arbres
sp&#233;cifiques au mod&#232;le TAG (substitution et adjonction).
La structure de d&#233;part du processus de g&#233;n&#233;ration est un graphe conceptuel contenant des n&#339;uds
li&#233;s entre eux par des r&#244;les s&#233;mantiques. Les n&#339;uds peuvent porter des attributs s&#233;mantiques qui
servent &#224; en pr&#233;ciser la valeur (temps, aspect, degr&#233; de d&#233;termination ...) Le programme effec-
tue la g&#233;n&#233;ration en parcourant le graphe conceptuel en un parcours direct (arbre de couverture
du graphe), et en engendrant, pour chaque pr&#233;dicat, un arbre correspondant &#224; la verbalisation
de ce pr&#233;dicat et de ses actants fondamentaux sous la forme d&#8217;une phrase nucl&#233;aire. Les r&#244;les
s&#233;mantiques non-verbalis&#233;s dans la phrase nucl&#233;aire sont ensuite g&#233;n&#233;r&#233;s sous forme d&#8217;arbres
auxiliaires &#224; t&#234;te GPred, et adjoints &#224; la phrase nucl&#233;aire. Enfin, les relations s&#233;mantiques inci-
dentes &#224; l&#8217;un des concepts de l&#8217;arbre de couverture direct, mais non encore exprim&#233;es dans la
phrase principale, sont soit adjointes lorsque c&#8217;est possible par un proc&#233;d&#233; syntaxique commun
(&#233;pith&#232;te, subordonn&#233;e relative), soit g&#233;n&#233;r&#233;es dans de nouvelles phrases juxtapos&#233;es &#224; celles
d&#233;j&#224; engendr&#233;es. Ce m&#233;canisme a &#233;t&#233; expos&#233; plus en d&#233;tail dans (Vaillant, 1997; Vaillant, 1998),
et reste fondamentalement le m&#234;me, ind&#233;pendamment de la langue &#224; laquelle il est appliqu&#233;.
</p>
<p>5 Conclusion
</p>
<p>Dans ce travail, une grammaire &#224; adjonction d&#8217;arbres a &#233;t&#233; utilis&#233;e pour passer d&#8217;une structure
s&#233;mantique limit&#233;e au niveau phrastique &#224; une lexicalisation en langue cr&#233;ole. Nous n&#8217;avons
pas eu l&#8217;ambition en revanche d&#8217;essayer de partir d&#8217;une structure s&#233;mantique &#171; interlangue &#187; ou
&#171; ind&#233;pendante de la langue &#187;. Le syst&#232;me des param&#232;tres s&#233;mantiques utilis&#233;s pour le temps et
l&#8217;aspect, par exemple, est ni plus ni moins celui de la langue cr&#233;ole martiniquaise (ou tout ou</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>moins du sous-ensemble que nous pr&#233;tendons en mod&#233;liser). La question de l&#8217;existence d&#8217;une
&#233;tape encore ant&#233;rieure &#224; la repr&#233;sentation li&#233;e &#224; la structure s&#233;mantique de la langue-cible n&#8217;est
pas abord&#233;e dans le cadre de cette &#233;tude, qui se borne &#224; r&#233;aliser la g&#233;n&#233;ration de la cha&#238;ne
syntagmatique &#224; partir d&#8217;un mod&#232;le du sens dans la m&#234;me langue, repr&#233;sent&#233; sous forme de
graphe. Tout au plus peut-on noter que le m&#234;me syst&#232;me peut servir, &#224; quelques modifications de
la grammaire pr&#232;s, pour des dialectes proches, qui ont &#224; peu pr&#232;s le m&#234;me syst&#232;me s&#233;mantique
(ainsi le guadeloup&#233;en, ou le guyanais de la c&#244;te).
La question de l&#8217;&#233;tape ant&#233;rieure se pose en r&#233;alit&#233; dans deux contextes : soit dans les tentatives
de mod&#233;lisation des processus cognitifs fondamentaux, qui postulent l&#8217;existence d&#8217;une hypoth&#233;-
tique repr&#233;sentation s&#233;mantique profonde, ou universelle ; soit dans les applications de transfert
d&#8217;un syst&#232;me s&#233;miotique &#224; un autre, donc de g&#233;n&#233;ration de phrases cr&#233;oles, par exemple, &#224;
partir d&#8217;une entr&#233;e qui pourrait aussi bien &#234;tre formul&#233;e en fran&#231;ais, en allemand, en chinois,
ou en id&#233;ogrammes Bliss. Nous viendrons &#224; l&#8217;avenir &#224; nous pencher sur le second probl&#232;me,
qui pourra &#234;tre le noyau d&#8217;un futur syst&#232;me d&#8217;aide &#224; l&#8217;apprentissage, destin&#233; par exemple &#224; des
apprenants n&#8217;ayant pas le cr&#233;ole pour langue maternelle. Quant au premier probl&#232;me, il nous
semble hors de notre port&#233;e. On pourra se consoler en &#233;voquant l&#8217;hypoth&#232;se du cr&#233;oliste in-
n&#233;iste Bickerton (1981), selon lequel ressurgissent dans les langues cr&#233;oles les structures inn&#233;es
du langage faisant partie du &#171; bioprogramme &#187; de l&#8217;humanit&#233;. Selon cette hypoth&#232;se, donc, s&#8217;il
existe une quelconque structure s&#233;mantique universelle, c&#8217;est pr&#233;cis&#233;ment celle que nous avons
sous la main avec le cr&#233;ole ...
</p>
<p>R&#233;f&#233;rences
ABEILL&#201; A. (1993). Les nouvelles syntaxes. Paris: Armand Colin.
ALLEYNE M. (1996). Syntaxe historique cr&#233;ole. Hommes et soci&#233;t&#233;s. Paris: Karthala.
BERNAB&#201; J. (1983). Fondal-natal. Paris: L&#8217;Harmattan. 3 vols.
BICKERTON D. (1981). Roots of language. Ann Arbor (&#201;.U.A.): Karoma.
CHAUDENSON R. (1995). Les Cr&#233;oles. Que sais-je ? Paris: PUF.
DAMOISEAU R. (1984). &#201;l&#233;ments de grammaire du cr&#233;ole martiniquais. Fort-de-France: Hatier An-
tilles.
DANLOS L. (1998). G-TAG : un formalisme lexicalis&#233; pour la g&#233;n&#233;ration de textes inspir&#233; de TAG.
Traitement Automatique des Langues &#8212; T.A.L., 39(2), 4&#8211;32.
PF&#196;NDER S. (2000). Aspekt und Tempus im Frankokreol. ScriptOralia. T&#252;bingen (R.F.A.): Gunter Narr.
PINALIE P. &amp; BERNAB&#201; J. (1999). Grammaire du cr&#233;ole martiniquais. Paris: L&#8217;Harmattan.
RASTIER F. (1987). S&#233;mantique Interpr&#233;tative. Formes S&#233;miotiques. Paris: PUF.
SAINT-QUENTIN A. D. (1989). &#201;tude sur la grammaire cr&#233;ole, In Introduction &#224; l&#8217;histoire de Cayenne,
suivie d&#8217;un recueil de contes, fables et chansons en cr&#233;ole. Comit&#233; de la Culture, de l&#8217;&#201;ducation et de
l&#8217;Environnement de Guyane: Cayenne. Premi&#232;re &#233;dition 1872.
VAILLANT P. (1997). Interaction entre modalit&#233;s s&#233;miotiques. De l&#8217;ic&#244;ne &#224; la langue. Orsay: Universit&#233;
Paris-Sud. Th&#232;se de doctorat.
VAILLANT P. (1998). Interpretation of iconic utterances based on contents representation: Semantic
analysis in the PVI system. Natural Language Engineering, 4(1), 17&#8211;40.
VALDMAN A. (1978). Le cr&#233;ole : structure, statut et origine. Paris: Klincksieck.
VIJAY-SHANKER K. &amp; JOSHI A. K. (1988). Feature structure based tree adjoining grammars. In
Proceedings of the 12 th International Conference on Computational Linguistics (COLING), Budapest
(Hongrie).</p>

</div></div>
</body></html>