<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>CoRRecT : D&#233;marche coop&#233;rative pour l&#8217;&#233;valuation de syst&#232;mes de reconnaissance de termes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>CoRRecT : D&#233;marche coop&#233;rative  
pour l&#8217;&#233;valuation de syst&#232;mes de reconnaissance de termes 
</p>
<p>Chantal Enguehard 
</p>
<p>IRIN &#8211; Universit&#233; de Nantes 
2 rue de la Houssini&#232;re BP 92208 Nantes cedex 3, France 
</p>
<p>chantal.enguehard@irin.univ-nantes.fr 
</p>
<p>R&#233;sum&#233; 
La reconnaissance de termes dans les textes intervient dans de nombreux domaines du Traitement 
Automatique des Langues Naturelles, qu&#8217;il s&#8217;agisse d&#8217;indexation automatique, de traduction, ou 
d&#8217;extraction de connaissances. Nous pr&#233;sentons une m&#233;thodologie d&#8217;&#233;valuation de Syst&#232;mes de 
Reconnaissance de Termes (SRT) qui vise &#224; minimiser le temps d&#8217;expertise des sp&#233;cialistes en 
faisant coop&#233;rer des SRT. La m&#233;thodologie est mise en &#339;uvre sur des textes en anglais dans le 
domaine de la chimie des m&#233;taux et &#224; l&#8217;aide de deux SRT : FASTR et SYRETE. Le banc de test 
construit selon cette m&#233;thodologie a permis de valider les SRT et d&#8217;&#233;valuer leurs performances en 
termes de rappel et de pr&#233;cision. 
</p>
<p>Abstract 
Recognizing terms in texts is useful in many Natural Language Processing applications : automatic 
indexation, summarization, translation, or knowledge extraction. We present a new methodology to 
evaluate Term Recognition Systems (TRS) so as to minimize the time required by experts to 
evaluate the results. This is done by making several TRS cooperate. This methodology is applied 
on English texts on metal chemistry with two systems : FASTR and SYRETE. The test bank we 
compiled evaluated the two systems and calculated the recall and precision rates. 
</p>
<p>Mots Cl&#233;s :   
Reconnaissance de termes, &#233;valuation de la reconnaissance de termes, SRT, FASTR, SYRETE 
</p>
<p>Keywords  
Recognition of terms, Term Recognition System, TRS, FASTR, SYRETE 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Chantal Enguehard 
</p>
<p>1 Introduction 
Seuls les sp&#233;cialistes d&#8217;un domaine ont les connaissances langagi&#232;res, techniques et pragmatiques 
n&#233;cessaires pour reconna&#238;tre des termes dans des textes, et donc pour effectuer une &#233;valuation des 
syst&#232;mes. Mais pratiquement il est difficile de disposer de tels sp&#233;cialistes, surtout pour des t&#226;ches 
longues (le corpus de test doit &#234;tre grand), r&#233;p&#233;titives (il faut examiner les r&#233;sultats de diff&#233;rents 
syst&#232;mes de reconnaissance de termes), et peu passionnantes. C&#8217;est pourquoi nous pr&#233;sentons une 
m&#233;thodologie de constitution des ressources n&#233;cessaires &#224; l&#8217;&#233;valuation de syst&#232;mes de 
reconnaissance de termes qui minimise le recours aux sp&#233;cialistes. Nous d&#233;taillons la formalisation 
choisie pour les &#233;changes de donn&#233;es. Nous montrons ensuite une application concr&#232;te de cette 
m&#233;thodologie &#224; un corpus issu de la m&#233;tallurgie. 
</p>
<p>2 Un banc de test pour la reconnaissance de termes 
Un SRT (Syst&#232;me de Reconnaissance de Termes) reconna&#238;t un ensemble de termes dans des textes 
composant un corpus et produit un corpus index&#233;. Dans ce mod&#232;le le corpus initial est &#171; brut &#187; dans 
le sens o&#249; il n&#8217;est pas n&#233;cessairement &#233;tiquet&#233;. 
 
</p>
<p>Termes Syst&#232;me de 
reconnaissance de 
</p>
<p>termes 
Corpus   
</p>
<p>Corpus 
 
 
</p>
<p>Figure 1 : Mod&#233;lisation d&#8217;un Syst&#232;me de Reconnaissance de Termes 
</p>
<p>Une r&#233;f&#233;rence est un ensemble de termes et un corpus regroupant les textes dans lesquels les 
variantes de termes ont &#233;t&#233; pr&#233;alablement reconnues. Ces deux ressources doivent &#234;tre de taille 
importante afin de refl&#233;ter au mieux la diversit&#233; des situations qui peuvent &#234;tre rencontr&#233;es. 
</p>
<p>Nous d&#233;finissons une approche it&#233;rative qui construit petit &#224; petit le corpus de r&#233;f&#233;rence. A chaque 
pas de la construction du corpus  
</p>
<p>- un SRT fournit au banc de test un corpus index&#233; (les termes reconnus sont signal&#233;s) ; 
- l&#8217;outil d&#8217;alignement compare ce corpus index&#233; par le SRT avec la r&#233;f&#233;rence dont il dispose. Il 
</p>
<p>&#233;dite automatiquement des rapports destin&#233;s aux concepteurs des SRT : pr&#233;sentation des faux-
positifs (termes reconnus de fa&#231;on erron&#233;e), des faux-n&#233;gatifs (termes non reconnus alors 
qu&#8217;ils devraient l&#8217;&#234;tre) ainsi que des taux de rappel et de pr&#233;cision ; 
</p>
<p>- l&#8217;outil d&#8217;alignement produit des formulaires de validation o&#249; sont regroup&#233;es les variantes 
identifi&#233;es par le SRT qui ne figurent pas dans la r&#233;f&#233;rence ; 
</p>
<p>- les formulaires de validation sont examin&#233;s et remplis par les sp&#233;cialistes du domaine ; 
- l&#8217;outil d&#8217;int&#233;gration prend en compte le r&#233;sultat des formulaires de validation et produit un 
</p>
<p>nouveau corpus de r&#233;f&#233;rence dans lequel les variantes pr&#233;c&#233;demment propos&#233;es &#224; la validation 
sont signal&#233;es, ainsi que des formulaires de validation proposant les occurrences de variantes 
de termes ni valid&#233;es ni invalid&#233;es par le sp&#233;cialiste qui est intervenu. 
</p>
<p> 
</p>
<p>Formulaires 
de 
</p>
<p>validation 
</p>
<p>Formulaires 
de 
</p>
<p>validation 
</p>
<p>corpus de 
r&#233;f&#233;rence 
version i  corpus de 
</p>
<p>r&#233;f&#233;rence 
version i+1 
</p>
<p>R&#233;sultats 
de la 
</p>
<p>validation
</p>
<p>outil  
d&#8216;int&#233;gration
</p>
<p>sp&#233;cialiste 
</p>
<p> 
 
 
 
 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CoRRecT : D&#233;marche coop&#233;rative pour l&#8217;&#233;valuation de syst&#232;mes de reconnaissance de termes 
</p>
<p>Figure 2 : Validation et outil d&#8217;int&#233;gration  
</p>
<p>L&#8217;application successive de cette cha&#238;ne de traitements avec plusieurs syst&#232;mes de reconnaissance 
de termes tend vers la d&#233;finition d&#8217;un corpus de r&#233;f&#233;rence dans lequel le nombre de termes 
apparaissant dans le corpus de r&#233;f&#233;rence augmente. Le r&#233;sultat ne d&#233;pend pas de l&#8217;ordre 
d&#8217;utilisation des diff&#233;rents SRT.  
</p>
<p>Les formulaires de validation propos&#233;s au sp&#233;cialiste pr&#233;sentent chaque occurrence de variante de 
terme en contexte. Les experts ont pour consigne de valider l&#8217;occurrence si celle-ci &#171; repr&#233;sente la 
m&#234;me notion que le terme &#187;. Le manque de pr&#233;cision de cette consigne refl&#232;te le d&#233;faut majeur de 
cette d&#233;marche : l&#8217;application finale de la reconnaissance de termes n&#8217;est pas explicitement d&#233;finie, 
alors qu&#8217;elle peut influencer les performances attendues. 
</p>
<p>2.1 Formalisation 
</p>
<p>XML (http://www.xml.com) permet une d&#233;finition pr&#233;cise des formats de donn&#233;es. Il facilite 
l&#8217;utilisation des ressources produites (le corpus de r&#233;f&#233;rence) par d&#8217;autres applications. Ce choix 
rend aussi le banc de test compatible avec les corpus existants et d&#233;j&#224; formalis&#233;s &#224; l&#8217;aide d&#8217;XML. 
M&#234;me si le corpus comprend d&#8217;autres informations signal&#233;es &#224; l&#8217;int&#233;rieur de balises (par exemple 
des &#233;tiquettes morphosyntaxiques) le fonctionnement du banc de test ne sera pas perturb&#233;. 
</p>
<p>2.1.1 R&#233;f&#233;rence 
</p>
<p>La r&#233;f&#233;rence se divise en deux parties : la premi&#232;re regroupe les termes, la seconde le corpus de 
r&#233;f&#233;rence. Chacun des termes est d&#233;fini par un identifiant (balise &lt;id&gt;), sa forme vedette (balise 
&lt;vedette&gt;) et, &#233;ventuellement, des informations suppl&#233;mentaires (balise &lt;info&gt;). Le corpus de 
r&#233;f&#233;rence regroupe un ensemble de notices. Chaque identification de terme est signal&#233;e dans des 
balises &lt;variante&gt; : deux ancres signalent le d&#233;but et la fin du terme ;. le statut de la variante 
est not&#233; &quot;Y&quot;ou &quot;N&quot; selon la validation. La balise avis permet de recueillir d&#8217;&#233;ventuelles pr&#233;cisions 
de l&#8217;&#233;valuateur. 
</p>
<p>&lt;notice id=&quot;1&quot;&gt; 
  &lt;variante refterme=&quot;5564&quot; statut=&quot;Y&quot; debut=&quot;ID12&quot; fin=&quot;ID13&quot;&gt; 
    &lt;avis&gt;aucune variation&lt;/avis&gt; 
  &lt;/variante&gt; 
&lt;texte&gt;'Xi' is the dimensionless correlation length of the pair &lt;ancre 
ID=&quot;12&quot;/&gt;correlation function&lt;ancre ID=&quot;13&quot;/&gt;. &lt;/texte&gt;&lt;/notice&gt; 
</p>
<p>extrait des textes composant la r&#233;f&#233;rence 
</p>
<p>&lt;terme id=&quot;5564&quot;&gt; 
  &lt;vedette&gt;Correlation function&lt;/vedette&gt; 
  &lt;info&gt;Fonction corr&#233;lation N NH&lt;/info&gt; 
&lt;/terme&gt; 
</p>
<p>extrait des termes composant la r&#233;f&#233;rence 
</p>
<p> 
</p>
<p>2.1.2 Corpus index&#233; 
</p>
<p>Les SRT doivent fournir leurs r&#233;sultats suivant un format fix&#233;. Pour chaque notice identifi&#233;e par 
son num&#233;ro, appara&#238;t la liste des identificateurs de termes reconnus et la notice elle-m&#234;me. Chaque 
variante est identifi&#233;e par l&#8217;identifiant du terme reconnu et sa localisation signal&#233;e par des ancres </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Chantal Enguehard 
</p>
<p>dans la notice. Chaque variante peut &#234;tre accompagn&#233;e d&#8217;une information suppl&#233;mentaire issue du 
SRT &#233;valu&#233;. 
</p>
<p>3 Application de la m&#233;thodologie au corpus m&#233;tal 
</p>
<p>3.1 Corpus 
</p>
<p>Le corpus est issu de l&#8217;Institut de l'Information Scientifique et Technique. Il est compos&#233; de 1280 
r&#233;sum&#233;s d&#8217;articles scientifiques dans le domaine de la chimie des m&#233;taux ainsi que d&#8217;une liste de 
6582 termes du domaine (5239 termes complexes et 1343 termes simples). Les textes sont &#233;crits en 
anglais et ont une &#233;tendue de 104 967 mots. Les termes sont assortis d&#8217;une traduction 
(approximative) en fran&#231;ais, et d&#8217;un &#233;tiquetage morphosyntaxique, il n&#8217;y a pas de d&#233;finition. 
</p>
<p>3.2 Deux syst&#232;mes de reconnaissance de termes 
</p>
<p>3.2.1 FASTR 
</p>
<p>La d&#233;finition d&#8217;une typologie des variantes de termes complexes (compos&#233;s de plusieurs mots) a 
permis de formaliser une grammaire qui exprime les transformations qui m&#232;nent d&#8217;un terme (sous 
sa forme normalis&#233;e) &#224; ses variantes possibles. Les r&#232;gles linguistiques ainsi d&#233;finies sont 
implant&#233;es au sein du syst&#232;me FASTR (Jacquemin &amp; Royaut&#233; 1995). FASTR utilise &#233;galement des 
r&#232;gles &quot;n&#233;gatives&quot; permettant de conclure qu&#8217;une occurrence n&#8217;est pas une variante d&#8217;un terme. 
</p>
<p>3.2.2 SYRETE 
</p>
<p>La distance minimale d&#8217;&#233;dition entre deux cha&#238;nes de caract&#232;res est le nombre minimum 
d&#8217;insertions et de suppressions de symboles qui sont n&#233;cessaires pour transformer une cha&#238;ne en 
l&#8217;autre (Wagner 1974). Cette distance peut &#234;tre pond&#233;r&#233;e par la somme des longueurs des deux 
cha&#238;nes. Cette mesure varie de 0, quand les cha&#238;nes sont strictement &#233;gales, &#224; 1 quand les cha&#238;nes 
n&#8217;ont aucun symbole en commun. Elle peut &#234;tre facilement adapt&#233;e &#224; la reconnaissance de termes 
simples ou complexes (Enguehard 2000), elle est implant&#233;e au sein du syst&#232;me SYRETE 
(http://www.sciences.univ-nantes.fr/info/perso/permanents/enguehard/). 
</p>
<p>3.3 R&#233;sultats 
</p>
<p>FASTR identifie 4409 occurrences : selon ce syst&#232;me, 2934 sont des variantes de termes, 1475 n&#8217;en 
sont pas. 
</p>
<p>Comme le nombre d&#8217;occurrences &#224; valider &#233;tait tr&#232;s important, plusieurs personnes sont intervenues 
&#171; en cascade &#187; afin de minimiser le temps demand&#233; au sp&#233;cialiste du domaine. Bien que n&#8217;ayant 
aucune comp&#233;tence particuli&#232;re j&#8217;ai pass&#233; en revue toutes les occurrences et en ai valid&#233; (ou 
invalid&#233;) plus de la moiti&#233;. Gloria Powell, qui est de langue maternelle anglaise, a ensuite pass&#233; en 
revue les 1743 occurrences restantes et en a laiss&#233; 603 qui ont finalement &#233;t&#233; propos&#233;es &#224; Guy 
Saindrenan, sp&#233;cialiste du domaine1. Cette proc&#233;dure de validation a permis de construire la 
version 2 du corpus.  
</p>
<p>                                                 
1  Je remercie Guy Saindrenan et Gloria Powell sans qui ce projet n&#8217;aurait pu &#234;tre men&#233;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CoRRecT : D&#233;marche coop&#233;rative pour l&#8217;&#233;valuation de syst&#232;mes de reconnaissance de termes 
</p>
<p>SYRETE identifie 2818 occurrences de variantes de termes dont 1048 ne figurent pas dans la 
version 2 du corpus. La m&#234;me proc&#233;dure de validation des occurrences de termes a permis de 
produire la version 3 du corpus.  
</p>
<p>Finalement, l&#8217;outil d&#8217;alignement a &#233;t&#233; utilis&#233; en prenant la version 3 du corpus comme r&#233;f&#233;rence. 
</p>
<p>Curieusement, le taux de rappel calcul&#233; pour les variantes de termes identifi&#233;es par FASTR est 
seulement de 63% alors que ce syst&#232;me est, a priori, tr&#232;s &#233;labor&#233;. Un examen approfondi des 
rapports &#233;dit&#233;s a permis de d&#233;tecter un dysfonctionnement : un grand nombre d&#8217;occurrences n&#8217;ont 
pas &#233;t&#233; identifi&#233;es car elles pr&#233;sentent des variations typographiques telles un changement dans la 
casse ou l&#8217;insertion d&#8217;un tiret. Le banc de test r&#233;v&#232;le ici son utilit&#233; comme outil de v&#233;rification du 
bon fonctionnement d&#8217;un SRT : bien que les r&#233;sultats de FASTR aient &#233;t&#233; examin&#233;s &#224; de 
nombreuses reprises, ce dysfonctionnement ne s&#8217;&#233;tait jamais laiss&#233; soup&#231;onner. Le taux de 
pr&#233;cision est de 89%. L&#8217;examen des r&#233;sultats de FASTR r&#233;v&#232;le que deux transformations qui 
devraient, a priori, produire des variantes de termes entra&#238;nent en fait la reconnaissance 
d&#8217;occurrences qui ne sont pas des variantes de termes. Il s&#8217;agit de la transformation d&#8217;un adjectif en 
nom et de la transformation d&#8217;un nom en nom. Il appara&#238;t que deux formes de variations sont 
particuli&#232;rement pr&#233;sentes : l&#8217;insertion d&#8217;un mot au sein d&#8217;une variante de terme est la forme de 
variation d&#233;tect&#233;e par FASTR la plus courante (189 occurrences dont 77 % sont valides), et la 
permutation des mots composant une variante (111 occurrences dont 74 % sont valides). La prise 
en compte de ces ph&#233;nom&#232;nes au sein d&#8217;un syst&#232;me de SRT traitant la langue anglaise am&#233;liore 
donc ses performances. SYRETE reconna&#238;t les termes selon diff&#233;rentes modalit&#233;s : la 
reconnaissance peut &#234;tre sensible ou non &#224; la casse, aux lettres accentu&#233;es et &#224; la ponctuation. Elle 
peut &#234;tre r&#233;alis&#233;e par l&#8217;op&#233;rateur d&#8217;&#233;galit&#233;-souple, ou par l&#8217;&#233;galit&#233; stricte de cha&#238;nes de caract&#232;res. 
Les exp&#233;riences men&#233;es montrent que ces modalit&#233;s influencent les taux de rappel tandis que les 
taux de pr&#233;cision gardent une valeur proche de 99 %. Les meilleurs r&#233;sultats correspondent aux 
modalit&#233;s les moins fig&#233;es : dans ce cas SYRETE d&#233;saccentue le texte, le convertit en minuscule, 
&#233;limine la ponctuation, et compare les cha&#238;nes de caract&#232;res avec l&#8217;op&#233;rateur d&#8217;&#233;galit&#233;-souple. 
Comme le corpus &#233;tudi&#233; est de langue anglaise les accents jouent un r&#244;le tr&#232;s faible. 
</p>
<p>4 Perspectives 
La mise en &#339;uvre de la m&#233;thodologie CoRRecT sur le corpus traitant de la chimie des m&#233;taux a 
permis de v&#233;rifier que la d&#233;marche suivie est r&#233;aliste mais que certaines difficult&#233;s subsistent. Tout 
d&#8217;abord, le processus intellectuel de validation n&#8217;est pas ais&#233;, il est parfois difficile de d&#233;terminer si 
une occurrence est une variante d&#8217;un terme, il faudrait pr&#233;ciser les crit&#232;res utilis&#233;s. Des exp&#233;riences 
similaires d&#8217;&#233;valuation par des sp&#233;cialistes ont montr&#233; que leurs avis peuvent grandement diverger 
d&#8217;un sp&#233;cialiste &#224; l&#8217;autre (Daille et al. 1998). Nous projetons donc d&#8217;ajouter la possibilit&#233; de 
commenter les d&#233;cisions prises et de les noter dans le corpus de r&#233;f&#233;rence.  
</p>
<p>La validation &#171; en cascade &#187; par plusieurs personnes de comp&#233;tences croissantes, et les volumes 
trait&#233;s (plusieurs milliers d&#8217;occurrences) laissent soup&#231;onner des erreurs probables de validation. 
Nous projetons d&#8217;assortir les d&#233;cisions not&#233;es dans le corpus d&#8217;un indice de confiance qui refl&#232;te 
les comp&#233;tences de la personne qui a proc&#233;d&#233; &#224; la validation, et de mettre en oeuvre un outil de 
visualisation du corpus de r&#233;f&#233;rence assorti d&#8217;un forum de discussion afin de r&#233;aliser des r&#233;visions 
des d&#233;cisions de validation pr&#233;c&#233;demment prises. L&#8217;&#233;volution du format du corpus de r&#233;f&#233;rence par 
l&#8217;adjonction de nouvelles informations (comme un &#233;tiquetage morphosyntaxique des variantes, par 
exemple) pourra &#233;galement &#234;tre discut&#233;e dans ce forum.  
</p>
<p>Enfin, les syst&#232;mes &#233;valu&#233;s fournissent parfois des informations sur les occurrences de variantes de 
termes reconnues, par exemple FASTR assortit chaque reconnaissance d&#8217;une cat&#233;gorie refl&#233;tant le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> Chantal Enguehard 
</p>
<p>type de variation. Ces informations sont pr&#233;cieuses car elles peuvent &#233;clairer les r&#233;sultats. Ainsi, il 
serait int&#233;ressant d&#8217;observer les r&#233;sultats de SYRETE afin de d&#233;terminer quels type de variations 
(au sens de FASTR) sont les mieux reconnues, ou les moins bien reconnues.  
</p>
<p>Nous avons donc &#233;toff&#233; la balise &lt;avis&gt; en lui ajoutant des attributs permettant de noter : 
- l&#8217;identit&#233; et la qualification de la personne ayant valid&#233; la variante 
- les informations fournies par les syst&#232;mes accompagn&#233;es de l&#8217;identit&#233; de ces syst&#232;mes 
exemples : 
 &lt;avis validation=&quot;Chantal Enguehard&quot; qualification =&quot;TALN&quot;&gt; 
 &lt;avis systeme=&quot;FASTR&quot; information =&quot;AtoV&quot;&gt; 
</p>
<p>Une variante peut &#234;tre accompagn&#233;e de plusieurs commentaires 
</p>
<p>5 Conclusion 
Nous avons mis en &#339;uvre la m&#233;thodologie CoRRecT de constitution d&#8217;un banc de test d&#8217;&#233;valuation 
des syst&#232;mes de reconnaissance de termes qui minimise le temps de validation par des sp&#233;cialistes 
du domaine. Nous avons constat&#233; que les outils constituant le banc de tests fonctionnent 
correctement et avons &#233;valu&#233; deux SRT. Cette exp&#233;rience a montr&#233; que l&#8217;&#233;dition de rapports est 
essentielle pour d&#233;tecter des dysfonctionnements &#233;ventuels de ces syst&#232;mes. 
</p>
<p>Par ailleurs, le corpus de r&#233;f&#233;rence constitue un ensemble de donn&#233;es de grande taille qui sont 
class&#233;es en deux groupes : les occurrences de variantes de termes, et celles qui n&#8217;en sont pas. Il peut 
constituer un ensemble d&#8217;entra&#238;nement pour des syst&#232;mes d&#8217;apprentissage fond&#233;s sur des exemples 
et des contrexemples. 
</p>
<p>Enfin, le corpus de r&#233;f&#233;rence ainsi que les outils aff&#233;rents sont disponibles &#224; l&#8217;adresse 
http://www.sciences.univ-nantes.fr/info/perso/permanents/enguehard/. Ce corpus, issu d&#8217;un 
processus de coop&#233;ration entre diff&#233;rents syst&#232;mes de reconnaissance de termes, peut s&#8217;enrichir de 
nouvelles contributions que nous sollicitons vivement aupr&#232;s des concepteurs de SRT. 
</p>
<p>5.1 Bibliographie 
</p>
<p>DAILLE B., GAUSSIER, &#201;., LANG&#201;, J.-M., 1998, &quot;An Evaluation of Statistical Scores for Word 
Association&quot;, In The Tbilissi Symposium on Logic Language and Computation: Selected 
Papers, J. Ginzburg, Z. Khasidashvili, C. Vogel, J.-J. Levy, E. Vallduv&#237;, ed., p.177-188. 
</p>
<p>ENGUEHARD C., 2000, &quot;Flexible-equality of terms: definition and evaluation&quot;, in Henrik L. Larsen, 
Janusz Kacprzyk, Slawonir Zadrozny, Troels Andreasen, et Henning Christiansen, r&#233;ds., 
Proceedings of the International Conference on Flexible Query Answering Systems, p.289-
300. ISBN 3-7908-1347-8. 
</p>
<p>JACQUEMIN C., ROYAUT&#201; J., 1994, &quot;Retrieving terms and their variants in a lexicalised unification-
based framework&quot;, Proceedings of the 17th annual international ACM SIGIR Conference 
on Research and Development in Information retrieval, Dublin. 
</p>
<p>WAGNER R.A., FISCHER M.J., January, 1974, &quot;The string-to-string correction problem&quot;. J. of the 
Association for Computing Machinery, 21 (1), p.168-173. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CoRRecT : D&#233;marche coop&#233;rative pour l&#8217;&#233;valuation de syst&#232;mes de reconnaissance de termes 
</p>
<p>SYRETE : Variation des modalit&#233;s 
 Egalit&#233;-souple Egalit&#233; stricte 
</p>
<p> Insensible &#224; la casse sensible &#224; la casse Insensible &#224; la casse sensible &#224; la casse 
</p>
<p> ! P P ! P P ! P P ! P P 
Nombre de termes 
</p>
<p>reconnus 
2765 2349 2529 2269 2101 1713 1855 1619 
</p>
<p>rappel 68,21% 58% 62,44% 56,00% 52,13% 42,75% 46,02% 40,13% 
</p>
<p>pr&#233;cision 98,84% 98,93% 98,93% 98,9% 99,42% 99,36% 99,41% 99,32% 
 
P : sensible &#224; la ponctuation   ! P : insensible &#224; la ponctuation  
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>

</div></div>
</body></html>