<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction de couples nom-verbe s&#233;mantiquement li&#233;s : une technique symbolique automatique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Extraction de couples nom-verbe s&#233;mantiquement li&#233;s : une
technique symbolique automatique
</p>
<p>Vincent Claveau
IRISA - Universit&#233; de Rennes 1
</p>
<p>Campus de Beaulieu
35042 Rennes Cedex, France
</p>
<p>Vincent.Claveau@irisa.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Acquisition de lexique, extraction de patrons morpho-syntaxiques et s&#233;mantiques, lexique
g&#233;n&#233;ratif, programmation logique inductive, bootstrapping, apprentissage semi-supervis&#233;
Lexicon acquisition, morpho-syntactic and semantic pattern extraction, Generative Lexicon,
inductive logic programming, bootstrapping, semi-supervised learning
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans le mod&#232;le du Lexique g&#233;n&#233;ratif (Pustejovsky, 1995), certaines propri&#233;t&#233;s s&#233;mantiques
des noms sont exprim&#233;es &#224; l&#8217;aide de verbes. Les couples nom-verbe ainsi form&#233;s pr&#233;sentent un
int&#233;r&#234;t applicatif notamment en recherche d&#8217;information. Leur acquisition sur corpus constitue
donc un enjeu, mais la d&#233;couverte des patrons qui les d&#233;finissent en contexte est &#233;galement im-
portante pour la compr&#233;hension m&#234;me du mod&#232;le du Lexique g&#233;n&#233;ratif. Cet article pr&#233;sente une
technique enti&#232;rement automatique permettant de r&#233;pondre &#224; ce double besoin d&#8217;extraction sur
corpus de couples et de patrons morpho-syntaxiques et s&#233;mantiques. Elle combine pour ce faire
deux approches d&#8217;acquisition &#8212; l&#8217;approche statistique et l&#8217;approche symbolique &#8212; en conser-
vant les avantages propres &#224; chacune d&#8217;entre elles : robustesse et automatisation des m&#233;thodes
statistiques, qualit&#233; et expressivit&#233; des r&#233;sultats des techniques symboliques.
</p>
<p>In the Generative Lexicon framework (Pustejovsky, 1995), some semantic properties of
common nouns are expressed with the help of verbs. These noun-verb pairs are relevant in
various domains, especially in Information Retrieval. Their corpus-based acquisition is thus an
interesting issue; moreover discovering the contextual patterns in which these pairs can occur is
also important in order to understand the Generative Lexicon model. This paper presents a fully
automated technique that allows us to acquire from a corpus both noun-verb pairs, and seman-
tic and morpho-syntactic patterns. This technique combines two acquisition approaches&#8212;the
statistical one and the symbolic one&#8212;and keeps advantages of each approach: robustness and
automation of statistical methods, quality of the results and expressiveness of symbolic ones.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau
</p>
<p>1 Introduction
</p>
<p>Le Lexique g&#233;n&#233;ratif est un mod&#232;le de lexique propos&#233; par J. Pustejovsky (Pustejovsky,
1995) dans lequel les entr&#233;es lexicales sont compos&#233;es de quatre structures contenant des in-
formations typ&#233;es permettant diff&#233;rentes strat&#233;gies d&#8217;interpr&#233;tation d&#8217;un mot en fonction de son
contexte. L&#8217;une de ces structures, appel&#233;e structure des qualia, indique les diff&#233;rentes facettes
s&#233;mantiques d&#8217;un mot au travers de pr&#233;dicats essentiellement verbaux (les r&#244;les qualia). La
structure des qualia du nom livre contient par exemple les verbes lire, &#233;crire et contenir (de
l&#8217;information) indiquant respectivement la fonction ou but du nom, son mode de cr&#233;ation et la
relation qu&#8217;il entretient avec les classes s&#233;mantiques dont il h&#233;rite. Chaque entr&#233;e du Lexique
g&#233;n&#233;ratif, et plus particuli&#232;rement les noms (N), est donc li&#233;e via des relations lexicales &#224; des
verbes (V). Ce sont ces couples N-V dont V appartient &#224; la structure des qualia de N (nomm&#233;s
couples qualia par la suite) que nous nous proposons d&#8217;acqu&#233;rir automatiquement sur corpus.
</p>
<p>Un des principaux int&#233;r&#234;ts de la structure des qualia r&#233;side dans la possibilit&#233; qu&#8217;elle donne
d&#8217;interpr&#233;ter en contexte des termes compos&#233;s. L&#8217;exploitation du lien nomino-verbal autorise
&#233;galement l&#8217;acc&#232;s &#224; des variantes de termes qui se r&#233;v&#232;lent tr&#232;s utiles dans le cadre de la re-
cherche d&#8217;information (Grefenstette, 1997). Elle permet par exemple des reformulations inter-
cat&#233;gorielles de requ&#234;tes du type magasin de disques &#0; vendre des disques en s&#8217;appuyant sur
le couple qualia magasin-vendre. Bien que leur int&#233;r&#234;t ait &#233;t&#233; montr&#233; pour ce genre de t&#226;ches
(Fabre &amp; S&#233;billot, 1999), le manque de ressources lexicales de ce type en emp&#234;che l&#8217;utilisation
&#224; grande &#233;chelle.
</p>
<p>Le formalisme propos&#233; par Pustejovsky, d&#233;velopp&#233; uniquement dans un cadre th&#233;orique, ne
sugg&#232;re aucune m&#233;thode de construction des entr&#233;es lexicales. L&#8217;acquisition sur corpus d&#8217;&#233;l&#233;-
ments du Lexique g&#233;n&#233;ratif tels que les couples qualia est donc en soi un enjeu int&#233;ressant,
mais, parall&#232;lement &#224; cette t&#226;che d&#8217;extraction, notre objectif est &#233;galement de fournir une aide &#224;
la verbalisation du concept de r&#244;le qualia par l&#8217;obtention de r&#232;gles d&#8217;extraction linguistiquement
pertinentes. Par ailleurs, les diff&#233;rents r&#244;les qualia d&#8217;un nom sont propres &#224; chaque domaine ;
il para&#238;t donc essentiel de d&#233;velopper une m&#233;thode d&#8217;acquisition sur corpus ais&#233;ment portable
d&#8217;un texte &#224; un autre, crit&#232;re d&#8217;&#233;valuation des m&#233;thodes d&#8217;extraction au m&#234;me titre que la qualit&#233;
des r&#233;sultats qu&#8217;elles produisent.
</p>
<p>Peu de travaux ont &#233;t&#233; entrepris pour la construction de structures des qualia. On peut n&#233;an-
moins citer (Pustejovsky et al., 1993) qui propose d&#8217;acqu&#233;rir les &#233;l&#233;ments de ces structures
&#224; partir d&#8217;un texte &#233;tiquet&#233; syntaxiquement en utilisant une extraction statistique de cooccur-
rences coupl&#233;e &#224; un jeu d&#8217;heuristiques sous forme de patrons syntaxiques. Malheureusement,
ces travaux ne sont pas clairement &#233;valu&#233;s, et la question de la portabilit&#233; de la m&#233;thode d&#8217;un
texte &#224; un autre n&#8217;est pas abord&#233;e, notamment en ce qui concerne l&#8217;&#233;tiquetage syntaxique et les
heuristiques employ&#233;es. Pour notre part, des travaux ant&#233;rieurs (Claveau et al., 2003) nous ont
permis de mettre au point et d&#8217;&#233;valuer une technique d&#8217;extraction de couples N-V qualia bas&#233;e
sur une m&#233;thode d&#8217;apprentissage symbolique supervis&#233; : la programmation logique inductive
(PLI) (Muggleton &amp; De-Raedt, 1994). La PLI sert &#224; g&#233;n&#233;rer un classifieur (un ensemble de
r&#232;gles) de mani&#232;re supervis&#233;e, &#224; savoir &#224; l&#8217;aide d&#8217;exemples de couples qualia en contexte et
de contre-exemples (couples N-V non-qualia au sein d&#8217;une phrase). Les r&#232;gles obtenues sont
ensuite utilis&#233;es comme patrons d&#8217;extraction. Les r&#233;sultats de cette technique sont de bonne
qualit&#233;, aussi bien pour la t&#226;che d&#8217;extraction des couples que pour la pertinence linguistique des
r&#232;gles g&#233;n&#233;r&#233;es. Cependant, ces patrons d&#8217;extraction &#233;tant a priori propres &#224; chaque corpus, il
est n&#233;cessaire de reconduire la phase d&#8217;apprentissage par PLI pour tout nouveau texte. Cette</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction de couples nom-verbe : une technique symbolique automatique
</p>
<p>approche supervis&#233;e pr&#233;sente donc l&#8217;inconv&#233;nient intrins&#232;que de n&#233;cessiter la construction d&#8217;un
jeu d&#8217;exemples et de contre-exemples de couples qualia propre au corpus &#224; traiter. Cette phase
de supervision, essentiellement manuelle et exigeant l&#8217;aide d&#8217;un expert, est tr&#232;s co&#251;teuse.
</p>
<p>L&#8217;approche que nous pr&#233;sentons ici rem&#233;die &#224; ce probl&#232;me et r&#233;pond ainsi aux diff&#233;rentes
exigences cit&#233;es pr&#233;c&#233;demment : bonne qualit&#233; des r&#233;sultats, interpr&#233;tabilit&#233; linguistique et au-
tomatisation du processus. Nous rejoignons en cela certains travaux effectu&#233;s en extraction
d&#8217;informations (Riloff &amp; Jones, 1999) r&#233;duisant l&#8217;intervention humaine &#224; l&#8217;apport de quelques
donn&#233;es (seed-words) en d&#233;but de processus. Notre syst&#232;me d&#8217;extraction se veut quant &#224; lui
enti&#232;rement automatique et sans aucun appui humain. Pour ce faire, en conjonction de notre
approche symbolique supervis&#233;e, nous utilisons une technique reposant sur une approche dif-
f&#233;rente de l&#8217;extraction : l&#8217;approche statistique. La collaboration de ces deux techniques permet
d&#8217;obtenir un syst&#232;me mixte d&#8217;extraction combinant les avantages des deux approches.
</p>
<p>Nous pr&#233;sentons dans la section suivante le corpus utilis&#233; lors de nos exp&#233;riences, puis nous
d&#233;crivons succinctement les approches symbolique et statistique utilis&#233;es pour notre t&#226;che d&#8217;ex-
traction de couples qualia. La section 3 d&#233;taille le fonctionnement du syst&#232;me mixte combinant
ces deux techniques et ses r&#233;sultats. Enfin, la derni&#232;re section propose des commentaires sur
cette approche mixte au regard de travaux connexes en apprentissage semi-supervis&#233; (c&#8217;est-
&#224;-dire utilisant un nombre minimal d&#8217;exemples pour conduire l&#8217;apprentissage) et conclut en
donnant des perspectives &#224; notre travail.
</p>
<p>2 Diff&#233;rentes approches de l&#8217;extraction
</p>
<p>Apr&#232;s la description du corpus utilis&#233; lors de nos exp&#233;rimentations, cette section pr&#233;sente les
deux techniques d&#8217;extraction d&#233;velopp&#233;es sur lesquelles repose notre syst&#232;me mixte ; la pre-
mi&#232;re s&#8217;inscrit dans un cadre symbolique (le couple qualia est extrait &#224; l&#8217;aide de patrons) et la
seconde dans un cadre statistique (le couple est consid&#233;r&#233; comme une forme de cooccurrence).
</p>
<p>2.1 Corpus et &#233;tiquetages
</p>
<p>Le corpus utilis&#233; lors de nos diff&#233;rentes exp&#233;rimentations est une collection de manuels de
maintenance d&#8217;h&#233;licopt&#232;res qui nous a &#233;t&#233; fourni par MATRA-CCR A&#233;rospatiale. Il contient en-
viron 104 000 occurrences de mots, et sa taille avoisine 700 Koctets. L&#8217;aspect tr&#232;s technique de
ce corpus se pr&#234;te bien &#224; notre t&#226;che gr&#226;ce &#224; la coh&#233;rence du vocabulaire et des structures syn-
taxiques employ&#233;s et l&#8217;utilisation fr&#233;quente de verbes indiquant la fonction de termes concrets.
</p>
<p>Ce corpus a tout d&#8217;abord &#233;t&#233; &#233;tiquet&#233; cat&#233;goriellement gr&#226;ce aux outils d&#233;velopp&#233;s dans le
cadre du projet MULTEXT (Armstrong, 1996). La qualit&#233; de cet &#233;tiquetage morpho-syntaxique
est tr&#232;s bonne puisque moins de 2% d&#8217;erreurs ont &#233;t&#233; d&#233;tect&#233;es sur un extrait du corpus de 4 000
mots &#233;tiquet&#233;s manuellement. Un &#233;tiquetage s&#233;mantique automatique a ensuite &#233;t&#233; r&#233;alis&#233; sur
le corpus. Il s&#8217;appuie sur un jeu d&#8217;&#233;tiquettes construit &#224; partir des classes les plus g&#233;n&#233;riques de
WordNet (Fellbaum, 1998) et d&#8217;&#233;tiquettes de granularit&#233; plus adapt&#233;e au corpus ; pour les noms,
33 classes sont ainsi retenues. Les &#233;tiquettes employ&#233;es et le processus d&#8217;&#233;tiquetage s&#233;mantique
sont d&#233;crits respectivement dans (Claveau et al., 2001) et (Bouillon et al., 2000). L&#224; encore, le
taux d&#8217;erreur, estim&#233; sur un extrait de 6 000 mots &#233;tiquet&#233; manuellement, est tr&#232;s faible : 85%
des ambigu&#239;t&#233;s sont r&#233;solues correctement, ce qui repr&#233;sente 98,82% de mots bien &#233;tiquet&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau
</p>
<p>2.2 Apprentissage supervis&#233; de r&#232;gles d&#8217;extraction de couples qualia par
programmation logique inductive
</p>
<p>Depuis quelques ann&#233;es, l&#8217;utilisation de m&#233;thodes d&#8217;apprentissage automatique symbolique
pour des t&#226;ches relevant du traitement automatique des langues s&#8217;est d&#233;velopp&#233;e. Parmi ces
m&#233;thodes, la programmation logique inductive (PLI), gr&#226;ce &#224; son expressivit&#233; et sa souplesse
d&#8217;utilisation, a &#233;t&#233; appliqu&#233;e &#224; des probl&#232;mes aussi divers que l&#8217;&#233;tiquetage morpho-syntaxique,
la construction d&#8217;analyseurs syntaxiques ou encore l&#8217;interrogation de bases de donn&#233;es en lan-
gage naturel (voir par exemple (Cussens &amp; Dz&#774;eroski, 2000) pour un panorama de travaux dans
ce domaine). Nous pr&#233;sentons ici succinctement l&#8217;utilisation de la PLI dans notre cadre d&#8217;ex-
traction de couples qualia (se reporter &#224; (Claveau et al., 2003) pour une description d&#233;taill&#233;e de
l&#8217;ensemble de la m&#233;thode).
</p>
<p>La PLI vise &#224; produire des r&#232;gles g&#233;n&#233;rales (sous forme de clauses de Horn) expliquant
un concept &#224; partir d&#8217;exemples et de contre-exemples du concept et d&#8217;un ensemble de connais-
sances pr&#233;alables. Les r&#232;gles sont obtenues par g&#233;n&#233;ralisation des exemples ; les contre-exemples
servent &#224; emp&#234;cher une g&#233;n&#233;ralisation excessive en v&#233;rifiant que les r&#232;gles produites n&#8217;en re-
couvrent aucun (ou tr&#232;s peu, un peu de bruit pouvant &#234;tre autoris&#233;). Dans notre cas, le concept
&#224; apprendre est la nature qualia d&#8217;un couple N-V apparaissant au sein d&#8217;une phrase. Un expert
doit donc construire manuellement un ensemble d&#8217;exemples &#0;&#2;&#1; et de contre-exemples &#0;&#4;&#3; ,
c&#8217;est-&#224;-dire extraire du corpus des couples N-V qualia et des couples N-V non-qualia avec leur
contexte (tous les mots et leurs &#233;tiquettes apparaissant avec le couple dans une phrase). Par
ailleurs, un langage d&#8217;hypoth&#232;ses d&#233;terminant avec pr&#233;cision le format des clauses &#224; produire
est d&#233;fini dans l&#8217;ensemble des connaissances pr&#233;alables. Cela permet d&#8217;obtenir des r&#232;gles bien
form&#233;es et linguistiquement pertinentes au regard de notre probl&#233;matique. Dans notre cas, ce
langage exploite notamment les informations cat&#233;gorielles et s&#233;mantiques des mots intervenant
dans les exemples (soit les composants d&#8217;un couple N-V, soit son contexte) ainsi que des in-
formations de distances (en nombre de mots) entre N et V. Les r&#232;gles obtenues, qui serviront
ensuite de patrons pour extraire de nouveaux couples qualia, sont par exemple de ce type :
</p>
<p>is_qualia(N,V) :- infinitive(V), action_verb(V), artefact(N), precedes(V,N).
</p>
<p>Cette r&#232;gle signifie qu&#8217;un couple dont le nom est N et le verbe V sera consid&#233;r&#233; qualia si N
appara&#238;t dans une phrase apr&#232;s V, que V est un verbe d&#8217;action &#224; l&#8217;infinitif et N un artefact.
</p>
<p>Comme toute technique d&#8217;apprentissage automatique, il important de contr&#244;ler le niveau
de g&#233;n&#233;ralisation des r&#232;gles obtenues. Une trop grande g&#233;n&#233;ralisation engendrerait une faible
pr&#233;cision de l&#8217;extraction, et une faible g&#233;n&#233;ralisation (apprentissage par c&#339;ur) un faible rappel.
Ce contr&#244;le et le r&#233;glage des param&#232;tres qui en d&#233;coule &#8212; notamment le bruit autoris&#233; &#8212; se
font de mani&#232;re automatique gr&#226;ce &#224; une validation crois&#233;e en 10 blocs (Kohavi, 1995) : l&#8217;en-
semble des exemples et contre-exemples d&#8217;apprentissage ( &#0;&#2;&#1; et &#0;&#5;&#3; ) est divis&#233; al&#233;atoirement
en 10 sous-ensembles ; chaque sous-ensemble sert alternativement de jeu de test pour &#233;valuer
l&#8217;apprentissage effectu&#233; &#224; partir des 9 autres sous-ensembles. Les r&#233;sultats de chaque &#233;valuation
sont r&#233;sum&#233;s dans une matrice de confusion similaire &#224; celle de la figure 1 1. On peut ainsi cal-
culer le coefficient &#6; qui traduit en une seule grandeur toutes les informations de cette matrice
de confusion :
</p>
<p>&#6;&#8;&#7;
</p>
<p>&#9;&#11;&#10;&#13;&#12;&#15;&#14;&#16;&#10;&#18;&#17;&#20;&#19;&#22;&#21;&#15;&#9;&#24;&#23;&#25;&#12;&#15;&#14;&#26;&#23;ff&#17;&#20;&#19;
</p>
<p>fi
</p>
<p>&#12;ffifl&#31;&#12; &#14;!&#12;ffifl&#31;&#17;&quot;&#14;&#16;#$&#12; &#14;&#26;#%&#17;
</p>
<p>1. La signification des variables est donn&#233;e par la combinaison des lettres : A signifie actual (r&#233;el), Pr predicated
(pr&#233;dit), T true (vrai), F false (faux), P positive (positif) et N negative (n&#233;gatif).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction de couples nom-verbe : une technique symbolique automatique
</p>
<p>qualia r&#233;el non-qualia r&#233;el Total
pr&#233;dit qualia TP FP PrP
</p>
<p>pr&#233;dit non-qualia FN TN PrN
Total AP AN S
</p>
<p>TAB. 1 &#8211; Matrice de confusion
</p>
<p>Une moyenne de &#6; est calcul&#233;e &#224; partir des 10 matrices obtenues sur les 10 sous-ensembles de
test. Pour chaque valeur possible des param&#232;tres de l&#8217;algorithme de PLI, une validation crois&#233;e
est donc effectu&#233;e et un &#6; moyen calcul&#233;. Les valeurs des param&#232;tres retenues sont celles qui
maximisent ce &#6; moyen. L&#8217;apprentissage est alors relanc&#233; avec ces r&#233;glages et la totalit&#233; des
exemples.
</p>
<p>Comme il est soulign&#233; dans (Bouillon et al., 2002), cette m&#233;thode (PLI avec expert par la
suite) donne d&#8217;excellents r&#233;sultats pour l&#8217;extraction de couples qualia mais permet surtout, &#224;
travers les r&#232;gles produites, de fournir un support linguistiquement pertinent &#224; la verbalisation
du concept de r&#244;le qualia. Cependant, le co&#251;t de cette m&#233;thode, r&#233;sidant essentiellement dans la
phase de constitution par un expert des exemples et contre-exemples n&#233;cessaires &#224; l&#8217;apprentis-
sage, rend cette m&#233;thode peu portable d&#8217;un corpus &#224; l&#8217;autre.
</p>
<p>2.3 Extraction statistique de couples qualia
</p>
<p>Beaucoup de travaux ont &#233;t&#233; effectu&#233;s dans le domaine de l&#8217;extraction de cooccurrences
par des approches statistiques (Manning &amp; Sch&#252;tze, 1999). Notre probl&#232;me d&#8217;extraction peut
s&#8217;inscrire dans ce cadre, les couples N-V qualia &#233;tant vus comme un type sp&#233;cial de cooccur-
rences. Les exp&#233;riences rapport&#233;es dans (Bouillon et al., 2002) pr&#233;sentent les r&#233;sultats obtenus
pour quelques indices statistiques parmi les plus commun&#233;ment employ&#233;s pour ce type de t&#226;che
(Kulczinsky, Ochiai, Yule, Loglike, Simple Matching, Information Mutuelle, Information Mu-
tuelle au cube, &#6;&#1;&#0; ). Parmi ceux-ci, le coefficient d&#8217;Information Mutuelle au cube ( &#2;&#4;&#3;&#6;&#5; par la
suite) propos&#233; par B. Daille (Daille, 1994), dont nous rappelons la d&#233;finition ci-apr&#232;s, semble
donner les meilleurs r&#233;sultats. &#201;tant donn&#233;e la table de contingence 2 (les cooccurrences sont
calcul&#233;es dans une fen&#234;tre d&#8217;une phrase &#224; partir des lemmes des mots), le coefficient &#2;&#4;&#3;&#7;&#5; du
couple
</p>
<p>&#17;&#9;&#8;
</p>
<p>- &#10;&#12;&#11; est donn&#233; par : &#13;&#15;&#14;&#17;&#16;
&#0;
</p>
<p>&#18;&#20;&#19;
</p>
<p>&#21;
</p>
<p>&#18;
</p>
<p>&#1;&#23;&#22;&#25;&#24;
</p>
<p>&#21;
</p>
<p>&#18;
</p>
<p>&#1;&#23;&#26;&#15;&#24;
</p>
<p>.
</p>
<p>&#10;ff&#11; &#10;flfi , ffi &#31;&#7;&quot;!
&#17;#&#8;
</p>
<p>a b
&#17;&#9;$
</p>
<p>, &#13;&#1;&#31;&#7;&amp;% c d
</p>
<p>TAB. 2 &#8211; Table de contingence de la paire nom-verbe
&#17;'&#8;
</p>
<p>- &#10;ff&#11;
</p>
<p>Les r&#233;sultats d&#8217;extraction de couples qualia avec cette technique (Bouillon et al., 2002) se
r&#233;v&#232;lent moins bons que l&#8217;approche PLI avec expert (jusqu&#8217;&#224; 58% de pr&#233;cision en moins pour un
rappel fix&#233;). Par ailleurs, ce type de m&#233;thodes d&#8217;extraction ne fournit aucun &#233;l&#233;ment de compr&#233;-
hension sur les r&#233;sultats produits et ne peut donc r&#233;pondre directement &#224; notre probl&#233;matique.
En revanche, leur enti&#232;re autonomie (aucune intervention humaine n&#8217;est requise) et leur facilit&#233;
d&#8217;utilisation (seul le corpus est n&#233;cessaire) sont des qualit&#233;s que l&#8217;on tente de conserver dans
l&#8217;approche que nous proposons ci-apr&#232;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau
</p>
<p>3 Approche mixte
</p>
<p>Pour remplir notre double t&#226;che de construction d&#8217;&#233;l&#233;ments du Lexique g&#233;n&#233;ratif et de
constitution de patrons d&#8217;extraction linguistiquement motiv&#233;s, nous proposons de combiner
les avantages des deux m&#233;thodes pr&#233;c&#233;dentes en un syst&#232;me d&#8217;extraction mixte. Ce syst&#232;me
conserve notamment l&#8217;aspect non-supervis&#233; et donc enti&#232;rement automatique du cadre statis-
tique tout en gardant l&#8217;aspect explicatif du cadre symbolique gr&#226;ce &#224; la production de r&#232;gles
pertinentes. La premi&#232;re partie de cette section en d&#233;crit le fonctionnement sous la forme d&#8217;un
algorithme. Une &#233;valuation des performances obtenues par ce syst&#232;me et une comparaison aux
autres approches de l&#8217;extraction sont r&#233;alis&#233;es en seconde partie.
</p>
<p>3.1 Description du syst&#232;me d&#8217;extraction mixte
</p>
<p>Le syst&#232;me mixte que nous proposons repose sur une mise en s&#233;quence (d&#233;taill&#233;e dans
l&#8217;algorithme 1) des approches statistique et symbolique : chaque m&#233;thode utilise en entr&#233;e les
informations donn&#233;es en sortie de l&#8217;autre m&#233;thode. Plus pr&#233;cis&#233;ment, chacune des m&#233;thodes
exploite la liste des couples extraits par l&#8217;autre pour construire sa propre liste de couples ( &#0;&#2;&#1;&#4;&#3;&#6;&#5;
pour la PLI, &#0;
</p>
<p>&#5;&#8;&#7;
</p>
<p>&#19; pour l&#8217;extraction statistique). La seule contrainte est de d&#233;buter cette it&#233;ra-
tion avec la m&#233;thode statistique puisqu&#8217;elle ne n&#233;cessite aucune donn&#233;e autre que le corpus. &#192;
l&#8217;initialisation de l&#8217;algorithme, tous les couples N-V pr&#233;sents dans une phrase du corpus sont
consid&#233;r&#233;s comme potentiellement qualia ; cela est indiqu&#233; par la r&#232;gle is_qualia(A,B). fournie
dans la liste des patrons d&#8217;extraction applicables au corpus &#0;&#2;&#9; .
</p>
<p>Algorithme 1 Syst&#232;me mixte
</p>
<p>Initialisation
&#10;
</p>
<p>&#0;&#11;&#9; = {is_qualia(A,B).}
&#10; application des r&#232;gles de &#0;&#12;&#9; au corpus ; les couples N-V extraits et leur nombre d&#8217;occur-
</p>
<p>rences d&#233;tect&#233;es sont ins&#233;r&#233;s dans &#0;&#13;&#1;&#4;&#3;&#6;&#5;
It&#233;ration
</p>
<p>1. pour tout couple
&#17;fl&#8; &#21;
</p>
<p>&#10;&#12;&#11; de &#0;&#11;&#1;&#4;&#3;&#14;&#5;
&#10; construction de la table de contingence de
</p>
<p>&#17; &#8; &#21;
</p>
<p>&#10;ff&#11; avec les nombres d&#8217;occurrences
indiqu&#233;s dans &#0;&#11;&#1;&#4;&#3;&#6;&#5;
</p>
<p>&#10; calcul du score de
&#17;fl&#8; &#21;
</p>
<p>&#10;&#12;&#11; selon
&#2;&#4;&#3; &#5;
</p>
<p>&#10; insertion, suivant son score, du couple dans la liste tri&#233;e d&#233;croissante &#0;
&#5;&#8;&#7;
</p>
<p>&#19;
</p>
<p>fin pour tout
2. constitution de l&#8217;ensemble &#0;&#5;&#1; (respectivement &#0;&#4;&#3; ) &#224; partir de toutes les occurrences
</p>
<p>dans le corpus des &#15;&#17;&#16; (resp. &#15;
&#0;
</p>
<p>) premiers (resp. derniers) couples de &#0;
&#5;&#8;&#7;
</p>
<p>&#19;
</p>
<p>3. apprentissage par PLI avec &#0; &#1; et &#0; &#3; ; les r&#232;gles obtenues sont regroup&#233;es dans &#0;&#18;&#9;
4. application des r&#232;gles de &#0;&#12;&#9; au corpus ; les couples N-V extraits et leur nombre d&#8217;occur-
</p>
<p>rences d&#233;tect&#233;es sont r&#233;unis dans &#0;&#13;&#1;&#4;&#3;&#6;&#5;
</p>
<p>L&#8217;arr&#234;t de l&#8217;it&#233;ration est conditionn&#233; par l&#8217;obtention des m&#234;mes r&#232;gles lors de deux tours suc-
cessifs. Lors de nos exp&#233;rimentations, &#15;&#19;&#16; a &#233;t&#233; choisi (&#224; chaque it&#233;ration) tel que les &#15;&#19;&#16; premiers</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction de couples nom-verbe : une technique symbolique automatique
</p>
<p>couples de &#0;
&#5;&#8;&#7;
</p>
<p>&#19; soient les couples dont le score d&#8217;association est sup&#233;rieur &#224; 0, et &#15;
&#0;
</p>
<p>tel que
&#15;
</p>
<p>&#0;
</p>
<p>&#7; &#15; &#16; .
</p>
<p>3.2 &#201;valuation et comparaison des performances
L&#8217;&#233;valuation du syst&#232;me d&#8217;extraction obtenu est r&#233;alis&#233;e dans des conditions r&#233;elles d&#8217;uti-
</p>
<p>lisation gr&#226;ce &#224; un jeu de test &#233;tabli par quatre experts du Lexique g&#233;n&#233;ratif. Le corpus de test
est un extrait de 32 000 mots du corpus MATRA-CCR. En d&#233;pit de sa taille relativement pe-
tite, examiner toutes les paires N-V de ce sous-corpus est impossible ; nous nous sommes donc
concentr&#233; sur sept noms particuli&#232;rement repr&#233;sentatifs du domaine : vis, &#233;crou, porte, voyant,
prise, capot, bouchon. Pour ne pas fausser les mesures, aucun de ces sept noms n&#8217;a servi lors de
la phase de construction du syst&#232;me. Un programme Perl recherche dans le sous-corpus tous les
couples N-V apparaissant au sein d&#8217;une phrase dont N est l&#8217;un des sept noms cit&#233;s. Les experts
annotent alors manuellement chacun de ces couples comme qualia ou non-qualia, conform&#233;-
ment aux d&#233;finitions de (Busa et al., 2001). Les divergences entre les experts sont discut&#233;es
jusqu&#8217;&#224; ce qu&#8217;un agr&#233;ment unanime se d&#233;gage. Finalement, parmi les 286 paires ainsi exami-
n&#233;es, 66 sont consid&#233;r&#233;es qualia. Ce jeu de test nous permet d&#8217;&#233;valuer les syst&#232;mes d&#8217;extraction
en comparant les couples N-V extraits &#224; ceux des experts.
</p>
<p>Afin de confronter ce jeu de test aux r&#233;sultats des syst&#232;mes d&#8217;extraction, et puisque les
syst&#232;mes bas&#233;s sur une mesure statistique (telle &#2; &#3; &#5; ) donnent un score &#224; chaque couple N-V, il
faut choisir un score-seuil &#224; partir duquel un couple extrait sera consid&#233;r&#233; comme qualia. Il en
est de m&#234;me pour une m&#233;thode symbolique comme la PLI (et donc pour notre syst&#232;me mixte)
puisque l&#8217;on peut d&#233;cider de ne consid&#233;rer une paire comme qualia que lorsque le nombre de ses
occurrences d&#233;tect&#233;es par les r&#232;gles apprises d&#233;passe un certain seuil (not&#233; &#1; par la suite). Ainsi,
les taux de rappel et de pr&#233;cision de ces syst&#232;mes, calcul&#233;s gr&#226;ce &#224; notre jeu de test, s&#8217;expriment
en fonction de &#1; (m&#234;mes notations que pr&#233;c&#233;demment) par :
</p>
<p>&#2;&#4;&#3;&#6;&#5;&#8;&#7;&#10;&#9; &#11;&#13;&#12;
</p>
<p>&#3;&#6;&#5;&#8;&#7;
</p>
<p>&#11;&#13;&#12;
</p>
<p>&#3;&#6;&#5;&#14;&#7;&#16;&#15;&#18;&#17;&#20;&#19;&#21;&#3;&#6;&#5;&#8;&#7; , &#12;
</p>
<p>&#3;&#6;&#5;&#8;&#7;&#22;&#9; &#11;&#13;&#12;
</p>
<p>&#3;&#6;&#5;&#8;&#7;
</p>
<p>&#11;&#13;&#12;
</p>
<p>&#3;&#6;&#5;&#8;&#7;&#16;&#15;&#18;&#17;
</p>
<p>&#12;
</p>
<p>&#3;&#6;&#5;&#14;&#7; .
</p>
<p>Pour l&#8217;approche statistique, symbolique ou mixte, un seuil bas favorise le rappel au d&#233;triment de
la pr&#233;cision et un seuil &#233;lev&#233; produit l&#8217;effet l&#8217;inverse. Pour repr&#233;senter les performances de tels
syst&#232;mes en fonction des diff&#233;rentes valeurs de &#1; possibles (on note &#23; cet ensemble), on utilise
usuellement les courbes rappel-pr&#233;cision dans lesquelles chaque point repr&#233;sente la pr&#233;cision
du syst&#232;me &#233;tant donn&#233; son rappel pour un seuil &#1; donn&#233;. Ces courbes, donn&#233;es en figure 1 pour
les trois syst&#232;mes, semblent montrer une grande similitude de comportement entre les syst&#232;mes
PLI avec expert et mixte. On constate en effet que les pr&#233;cisions de ces deux syst&#232;mes sont
presque identiques quel que soit le taux de rappel fix&#233;. Ces deux syst&#232;mes sont par ailleurs
toujours meilleurs que le syst&#232;me bas&#233; uniquement sur &#2;&#4;&#3; &#5; , notamment lorsque le rappel est
&#233;lev&#233;.
</p>
<p>Pour faciliter les comparaisons entre syst&#232;mes, on cherche donc parfois &#224; leur assigner une
mesure unique. Nous utilisons dans ce but la mesure &#6; d&#233;finie pr&#233;c&#233;demment, qui synth&#233;tise
en une seule grandeur les caract&#233;ristiques d&#8217;un syst&#232;me pour un seuil donn&#233;. Nous calculons
&#233;galement la F-mesure, fr&#233;quemment utilis&#233;e dans le domaine de la recherche d&#8217;information.
Elle est d&#233;finie comme &#233;tant la moyenne harmonique pond&#233;r&#233;e du taux de rappel ( &#24; &#9; &#1; &#19; ) et du
taux de pr&#233;cision ( &#12;&#4;&#9; &#1; &#19; ). Dans le cas o&#249; un poids &#233;gal est donn&#233; au rappel et &#224; la pr&#233;cision, la
F-mesure s&#8217;&#233;crit :
</p>
<p>&#23; &#9;
</p>
<p>&#1;
</p>
<p>&#19;
</p>
<p>&#7;
</p>
<p>&#0;
</p>
<p>&#1;
</p>
<p>&#21;&#26;&#25;
</p>
<p>&#24;
</p>
<p>&#9;
</p>
<p>&#21;&#26;&#25;
</p>
<p>&#24;
</p>
<p>&#1;
</p>
<p>&#21;ff&#25;
</p>
<p>&#24; &#1;
</p>
<p>&#9;
</p>
<p>&#21;ff&#25;
</p>
<p>&#24;
</p>
<p>. Le tableau 3 compare les taux de rappel, de pr&#233;cision, la
F-mesure et le coefficient &#6; de notre syst&#232;me mixte avec ceux des syst&#232;mes PLI avec expert</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau
</p>
<p>0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
</p>
<p>1
1.1
</p>
<p>0 0.2 0.4 0.6 0.8 1
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p>Rappel
</p>
<p>Syst&#232;me PLI avec expert
Syst&#232;me mixte
</p>
<p>Syst&#232;me IM3
</p>
<p>FIG. 1 &#8211; Courbes rappel-pr&#233;cision des sys-
t&#232;mes
</p>
<p>&#2;&#4;&#3; &#5;
</p>
<p>, PLI avec expert et mixte
</p>
<p>0.35
0.4
</p>
<p>0.45
0.5
</p>
<p>0.55
0.6
</p>
<p>0.65
0.7
</p>
<p>0.75
0.8
</p>
<p>it&#233;
r. 
</p>
<p>1
&#233;t
</p>
<p>ap
e 
</p>
<p>1
</p>
<p>it&#233;
r. 
</p>
<p>1
&#233;t
</p>
<p>ap
e 
</p>
<p>4
</p>
<p>it&#233;
r. 
</p>
<p>2
&#233;t
</p>
<p>ap
e 
</p>
<p>1
</p>
<p>it&#233;
r. 
</p>
<p>2
&#233;t
</p>
<p>ap
e 
</p>
<p>4
</p>
<p>it&#233;
r. 
</p>
<p>3
&#233;t
</p>
<p>ap
e 
</p>
<p>1
</p>
<p>it&#233;
r. 
</p>
<p>3
&#233;t
</p>
<p>ap
e 
</p>
<p>4
</p>
<p>it&#233;
r. 
</p>
<p>4
&#233;t
</p>
<p>ap
e 
</p>
<p>1
</p>
<p>it&#233;
r. 
</p>
<p>4
&#233;t
</p>
<p>ap
e 
</p>
<p>4
</p>
<p>&#934; syst&#232;me PLI avec expert
&#934; syst&#232;me mixte
F syst&#232;me mixte
</p>
<p>F syst&#232;me PLI avec expert
</p>
<p>FIG. 2 &#8211; &#201;volution des performances du sys-
t&#232;me mixte au cours de l&#8217;algorithme
</p>
<p>et
&#2;&#4;&#3; &#5;
</p>
<p>. Le seuil &#1; &#0;&#3;&#2;&#5;&#4; retenu pour chacun des syst&#232;mes est choisi tel que &#6;
&#9;
</p>
<p>&#1;&#6;&#0;&#3;&#2;&#5;&#4;
</p>
<p>&#19;
</p>
<p>soit maximal.
( &#1; &#0;&#3;&#2;&#5;&#4; &#7; argmax
</p>
<p>&#25;&#8;&#7;&#10;&#9;
</p>
<p>&#9;
</p>
<p>&#6;
</p>
<p>&#9;
</p>
<p>&#1;
</p>
<p>&#19; &#19; ).
</p>
<p>rappel (%) pr&#233;cision (%) F-mesure coeff. &#6;
PLI avec expert 92.4 62.9 0.748 0.677
&#2;&#4;&#3;
</p>
<p>&#5;
</p>
<p>36.4 92.3 0.522 0.520
mixte 93.9 62.0 0.747 0.677
</p>
<p>TAB. 3 &#8211; Performances des m&#233;thodes PLI avec expert, &#2;&#4;&#3;&#6;&#5; et mixte
</p>
<p>La figure 2 repr&#233;sente l&#8217;&#233;volution des performances du syst&#232;me mixte au cours de sa construc-
tion, c&#8217;est-&#224;-dire lors du d&#233;roulement de l&#8217;algorithme 1 sur le jeu de test d&#233;crit pr&#233;c&#233;demment.
Plus pr&#233;cis&#233;ment, apr&#232;s chaque &#233;tape 1 et 4 de l&#8217;algorithme, on recherche comme pr&#233;c&#233;dem-
ment le seuil &#1; &#0;&#3;&#2;&#5;&#4; maximisant &#6; &#224; partir des listes de couples qualia &#0; &#5;&#8;&#7; &#19; et &#0;&#11;&#1;&#4;&#3;&#14;&#5; , et on calcule
&#233;galement la F-mesure pour ce m&#234;me seuil. On constate qu&#8217;il suffit de trois it&#233;rations pour ap-
procher les performances du syst&#232;me d&#8217;extraction PLI avec expert ; la convergence empirique
de l&#8217;algorithme est donc tr&#232;s rapide.
</p>
<p>Les r&#232;gles obtenues par le syst&#232;me mixte sont analogues &#224; celles issues du syst&#232;me PLI avec
expert (se reporter &#224; (Bouillon et al., 2002)), ce qui explique les similitudes de performances des
deux syst&#232;mes. On obtient donc des patrons exploitant essentiellement les informations morpho-
syntaxiques du N ou du V (verbe &#224; l&#8217;infinitif par exemple) et des informations de proximit&#233; (le
nom doit &#234;tre s&#233;par&#233; du verbe par au plus un mot par exemple). En revanche, peu d&#8217;informations
s&#233;mantiques sont utilis&#233;es, sauf en ce qui concerne les verbes (les verbes d&#8217;action sont privi-
l&#233;gi&#233;s). Ces r&#232;gles font par ailleurs &#233;merger des indices de surface g&#233;n&#233;ralement d&#233;laiss&#233;s par
les linguistes tels que les ponctuations, particuli&#232;rement pr&#233;sentes et structurantes dans notre
corpus.
</p>
<p>4 Discussion et perspectives
</p>
<p>Beaucoup de travaux cherchent &#224; am&#233;liorer les co&#251;ts des algorithmes d&#8217;apprentissage su-
pervis&#233;, non pas en travaillant directement sur ces algorithmes mais en les utilisant, ainsi que</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction de couples nom-verbe : une technique symbolique automatique
</p>
<p>les classifieurs qu&#8217;ils produisent, de mani&#232;re particuli&#232;re. Certains d&#8217;entre eux, rejoignant en
cela notre probl&#233;matique, visent &#224; utiliser le moins possible d&#8217;exemples annot&#233;s ; les techniques
d&#8217;apprentissage sont alors dites semi-supervis&#233;es. La plupart de ces techniques reposent sur des
variantes de bootstrapping (Jones et al., 1999) : un petit nombre d&#8217;exemples annot&#233;s est uti-
lis&#233; pour produire une premi&#232;re version du classifieur ; cette derni&#232;re sert alors &#224; annoter des
exemples suppl&#233;mentaires qui aident &#224; g&#233;n&#233;rer une deuxi&#232;me version du classifieur, etc.
</p>
<p>Des versions &#233;volu&#233;es de bootstrapping telles que le co-training (Blum &amp; Mitchell, 1998)
ou celle propos&#233;e dans (Yarowsky, 1995) assurent des propri&#233;t&#233;s th&#233;oriques int&#233;ressantes, mais
au prix de conditions fortes sur les donn&#233;es. Le co-training impose par exemple que les donn&#233;es
d&#8217;apprentissage puissent &#234;tre repr&#233;sent&#233;es selon deux vues conditionnellement ind&#233;pendantes,
deux algorithmes d&#8217;apprentissage travaillant ensuite chacun sur une vue des donn&#233;es 2. Cette tr&#232;s
forte condition d&#8217;ind&#233;pendance est en fait rarement atteinte dans les donn&#233;es r&#233;elles (Abney,
2002) et emp&#234;che l&#8217;exploitation des r&#233;sultats th&#233;oriques de ces algorithmes semi-supervis&#233;s
bien que leur efficacit&#233; soit empiriquement av&#233;r&#233;e. C&#8217;est n&#233;anmoins une condition analogue qui
sous-tend intuitivement notre syst&#232;me mixte. Il faut en effet &#233;viter que la phase d&#8217;apprentissage
par PLI ne soit biais&#233;e et ne produise des patrons identiques &#224; ceux ayant directement servis &#224;
extraire les exemples. Pour permettre l&#8217;introduction de nouveaux sch&#233;mas contextuels dans le
processus, les couples extraits par les patrons appris par PLI sont donc filtr&#233;s selon un crit&#232;re
ind&#233;pendant de ces patrons (la mesure &#2;&#4;&#3; &#5; ) et toutes les occurrences de ces couples dans le
corpus servent ensuite d&#8217;exemples. Cette ind&#233;pendance entre les informations utilis&#233;es par les
approches symbolique (contexte s&#233;mantique et morpho-syntaxique) et statistique (occurrences)
est mise &#224; mal en pratique car notre corpus comporte de nombreuses instructions r&#233;p&#233;t&#233;es &#224;
l&#8217;identique. Cependant, la ressemblance des patrons produits finalement par notre syst&#232;me mixte
et le syst&#232;me PLI avec expert semble montrer une bonne tol&#233;rance de l&#8217;algorithme &#224; ce propos.
</p>
<p>La m&#233;thode d&#8217;acquisition de couples qualia et de patrons d&#8217;extraction pr&#233;sent&#233;e dans cet
article r&#233;pond &#224; nos exigences de qualit&#233; des couples extraits, d&#8217;interpr&#233;tabilit&#233; linguistique et
de portabilit&#233;. Elle combine en cela les avantages des deux approches sur lesquelles elle re-
pose : l&#8217;approche statistique permettant l&#8217;automatisation du processus et l&#8217;approche symbolique
garantissant une bonne qualit&#233; des r&#233;sultats et des r&#232;gles d&#8217;extraction produites. Cette m&#233;thode
d&#8217;extraction mixte n&#8217;&#233;chappe cependant pas aux co&#251;ts inh&#233;rents aux diff&#233;rents &#233;tiquetages du
corpus, notamment l&#8217;&#233;tiquetage s&#233;mantique qui n&#233;cessite un important travail en amont sur
les donn&#233;es. Comme il est montr&#233; dans (Claveau et al., 2001) pour le syst&#232;me PLI avec ex-
pert, ce co&#251;t est n&#233;anmoins contr&#244;lable (en n&#8217;effectuant qu&#8217;un &#233;tiquetage s&#233;mantique partiel par
exemple) en fonction de la qualit&#233; attendue des r&#233;sultats.
</p>
<p>De nombreuses perspectives sont ouvertes sur diff&#233;rents aspects de ce travail. Tout d&#8217;abord,
d&#8217;un point de vue applicatif, notre m&#233;thode mixte peut &#234;tre ais&#233;ment adapt&#233;e &#224; l&#8217;extraction
d&#8217;autres types de donn&#233;es que les couples N-V qualia (collocations ou &#233;l&#233;ments plus complexes
tels que les fonctions lexicales (Kahane &amp; Polgu&#232;re, 2001)), notamment gr&#226;ce &#224; la souplesse
d&#8217;utilisation de la PLI. Sur le plan technique, la collaboration des techniques statistiques et
symboliques peut &#234;tre r&#233;alis&#233;e diff&#233;remment. Un couplage plus fin des deux approches peut
notamment &#234;tre envisag&#233; en int&#233;grant au sein m&#234;me de la phase d&#8217;apprentissage par PLI les
r&#233;sultats statistiques (en pond&#233;rant les exemples n&#233;cessaires &#224; la PLI en fonction de leur score
statistique par exemple).
</p>
<p>2. Dans le domaine du rep&#233;rage d&#8217;entit&#233;s nomm&#233;es, ces deux vues des donn&#233;es peuvent &#234;tre, par exemple,
l&#8217;ensemble des mots composant l&#8217;entit&#233; nomm&#233;e et l&#8217;ensemble des mots composant son contexte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau
</p>
<p>R&#233;f&#233;rences
ABNEY S. (2002). Bootstrapping. In 40th Annual Meeting of the Association for Computational Lin-
guistics, ACL, Philadelphia (PA), USA.
ARMSTRONG S. (1996). Multext: Multilingual Text Tools and Corpora. In H. FELDWEG &amp; W. HIN-
RICHS, Eds., Lexikon und Text.
BLUM A. &amp; MITCHELL T. (1998). Combining Labeled and Unlabeled Data with Co-training. In COLT:
Proceedings of the Workshop on Computational Learning Theory, Madison (WI), USA.
BOUILLON P., BAUD R. H., ROBERT G. &amp; RUCH P. (2000). Indexing by Statistical Tagging. In
Journ&#233;es d&#8217;Analyse statistique des Donn&#233;es Textuelles, JADT2000, Lausanne, Switzerland.
BOUILLON P., CLAVEAU V., FABRE C. &amp; S&#201;BILLOT P. (2002). Acquisition of Qualia Elements from
Corpora - Evaluation of a Symbolic Learning Method. In 3rd International Conference on Language
Resources and Evaluation, LREC 02, Las Palmas de Gran Canaria, Spain.
BUSA F., CALZOLARI N. &amp; LENCI A. (2001). Generative Lexicon and the SIMPLE Model: Developing
Semantic Resources for NLP. In F. BUSA &amp; P. BOUILLON, Eds., Generativity in the Lexicon.
CLAVEAU V., S&#201;BILLOT P., BOUILLON P. &amp; FABRE C. (2001). Acqu&#233;rir des &#233;l&#233;ments du lexique
g&#233;n&#233;ratif : quels r&#233;sultats et &#224; quels co&#251;ts? TAL (traitement automatique des langues), num&#233;ro sp&#233;cial
Lexiques s&#233;mantiques, 42(3).
CLAVEAU V., S&#201;BILLOT P., FABRE C. &amp; BOUILLON P. (2003). Learning Semantic Lexicons from
a Part-of-Speech and Semantically Tagged Corpus using Inductive Logic Programming. Journal of
Machine Learning Research, special issue on ILP. &#192; para&#238;tre.
J. CUSSENS &amp; S. D &#728;ZEROSKI, Eds. (2000). Learning Language in Logic. LNAI. Springer Verlag.
DAILLE B. (1994). Approche mixte pour l&#8217;extraction de terminologie : statistique lexicale et filtres
linguistiques. PhD thesis, Universit&#233; Paris 7.
FABRE C. &amp; S&#201;BILLOT P. (1999). Semantic Interpretation of Binominal Sequences and Information
Retrieval. In International ICSC Congress on Computational Intelligence: Methods and Applications,
CIMA, Symposium on Advances in Intelligent Data Analysis AIDA, Rochester (NY), USA.
C. FELLBAUM, Ed. (1998). WordNet: An Electronic Lexical Database. The MIT Press.
GREFENSTETTE G. (1997). SQLET: Short Query Linguistic Expansion Techniques, Palliating One-
Word Queries by Providing Intermediate Structure to Text. In Conf&#233;rence Recherche d&#8217;Informations
Assist&#233;e par Ordinateur, RIAO, Montr&#233;al, Canada.
JONES R., MCCALLUM A., NIGAM K. &amp; RILOFF E. (1999). Bootstrapping for Text Learning Tasks.
In IJCAI-99 Workshop on Text Mining: Foundations, Techniques and Applications, Stockholm, Sweden.
KAHANE S. &amp; POLGU&#200;RE A. (2001). Formal Foundation of Lexical Functions. In Workshop on Collo-
cation: Computational Extraction, Analysis and Exploitation, 39th Annual Meeting and 10th Conference
of the European Chapter of the Association for Computational Linguistics, Toulouse, France.
KOHAVI R. (1995). A Study of Cross-Validation and Bootstrap for Accuracy Estimation and Model
Selection. In 14th International Joint Conference on Artificial Intelligence, IJCAI 95, Montr&#233;al, Canada.
MANNING C. D. &amp; SCH&#220;TZE H. (1999). Foundations of Statistical Natural Language Processing. The
MIT Press.
MUGGLETON S. &amp; DE-RAEDT L. (1994). Inductive Logic Programming: Theory and Methods. Jour-
nal of Logic Programming, 19-20.
PUSTEJOVSKY J. (1995). The Generative Lexicon. The MIT Press.
PUSTEJOVSKY J., ANICK P. &amp; BERGLER S. (1993). Lexical Semantic Techniques for Corpus Analysis.
Computational Linguistics, special issue on Using Large Corpora, 19(2).
RILOFF E. &amp; JONES R. (1999). Learning Dictionaries for Information Extraction by Multi-level Boots-
trapping. In Sixteenth National Conference on Artificial Intelligence, AAAI, Orlando (FL), USA.
YAROWSKY D. (1995). Unsupervised Word Sense Disambiguation Rivaling Supervised Methods. In
33rd Annual Meeting of the Association for Computational Linguistics, ACL, Cambridge (MA), USA.</p>

</div></div>
</body></html>