<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Le traitement automatique de la langue contre les erreurs judiciaires : une m&#233;thodologie d&#146;analyse syst&#233;matique des textes d&#146;un dossier d&#146;instruction</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003
</p>
<p>Le traitement automatique de la langue
contre les erreurs judiciaires :
</p>
<p>une m&#233;thodologie d&#146;analyse syst&#233;matique des textes
d&#146;un dossier d&#146;instruction
</p>
<p>Yannick Toussaint
</p>
<p>LORIA &#150; INRIA
BP 239
</p>
<p>54506  Vandoeuvre-l&#232;s-Nancy
Yannick.Toussaint@loria.fr
</p>
<p>R&#233;sum&#233; &#150; Abstract
Cet article pr&#233;sente une m&#233;thode d&#146;analyse syst&#233;matique et scientifique des documents
constituant un dossier d&#146;instruction. L&#146;objectif de cette approche est de pouvoir donner au
juge d&#146;instruction de nouveaux moyens pour &#233;valuer la coh&#233;rence, les incoh&#233;rences, la
stabilit&#233; ou les variations dans les t&#233;moignages. Cela doit lui permettre de d&#233;finir des pistes
pour mener de nouvelles investigations. Nous d&#233;crivons les travaux que nous avons r&#233;alis&#233;s
sur un dossier r&#233;el puis nous proposons une m&#233;thode d&#146;analyse des r&#233;sultats.
This article presents a systematic and scientific method to analyse the set of documents that
constitutes a file of instruction. The goal of this approach is to give the examining magistrate
new means to estimate the coherence, the incoherence, the stability or the variations in the
testimonies. This analysis should help him in identifying the needs for new investigations. We
applied our method to a real file and then we propose a way to read the results.
</p>
<p>Keywords &#150; Mots Cl&#233;s
Cat&#233;gorisation, synth&#232;se, questionnabilit&#233; d&#146;un texte, traitement cognitifs d&#146;un texte,
traitement automatique de la langue, Justice, dossier d&#146;instruction.
</p>
<p>Text categorisation, text synthesis, text questionning, cognitive treatment of texts, Justice and
natural language processing.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yannick Toussaint
</p>
<p>1 Objectifs
&#171;  L&#146;attente des Fran&#231;ais  n&#146;a jamais &#233;t&#233; aussi forte en terme de s&#233;curit&#233; et de justice. Nos concitoyens
</p>
<p>veulent des r&#233;ponses simples, rapides et efficaces. Il veulent renouer avec leur justice et se retrouver dans
ses actes et d&#233;cisions (&#133;)Il appartient &#224; l&#146;institution judiciaire d&#146;assurer la s&#233;curit&#233; des rapports juridiques
entre les citoyens, l&#146;efficacit&#233; des d&#233;cisions rendues et la protection de la soci&#233;t&#233; contre le crime et la
d&#233;linquance. Or, la justice ne dispose pas &#224; l&#146;heure actuelle des moyens n&#233;cessaires &#224; un traitement
satisfaisant des affaires dont elle est saisie : des d&#233;lais trop longs et des proc&#233;dures complexes nourrissent
le sentiment d&#146;incompr&#233;hension et la perte de confiance &#224; son &#233;gard. &#187; (La loi d&#146;orientation et de
programmation pour la Justice 2003-2007, Justice : les moyens d&#146;agir, 9 sept 2002, Minist&#232;re de la
Justice, p.1)
</p>
<p>Disposer d&#146;une justice qui se donne les moyens de mener jusqu&#146;au bout ses enqu&#234;tes et ses recherches
est enjeu soci&#233;tal tr&#232;s important. Il est, en effet, vital pour une d&#233;mocratie que la justice puisse
&#233;chapper aux ph&#233;nom&#232;nes de mode, &#224; la pression m&#233;diatique, qu&#146;elle prenne des d&#233;cisions raisonn&#233;es,
et que la charge de travail importante des magistrats ne soit pas une excuse pour n&#233;gliger certaines
instructions dans lesquelles seule une &#233;tude tr&#232;s minutieuse des faits et des documents peut r&#233;v&#233;ler la
v&#233;rit&#233;. Les anomalies, incoh&#233;rences ou mensonges dans un dossier (toujours relev&#233;es par le d&#233;tective
dans le roman policier !) sont souvent noy&#233;es dans un volume consid&#233;rable de papiers et, s&#146;il n&#146;y a pas
une arm&#233;e d&#146;avocats pour tout passer &#224; la loupe et les rep&#233;rer, le dossier n&#146;est tout simplement pas
&#233;tudi&#233; en d&#233;tail. Juges et avocats croulent sous les dossiers, nombre de d&#233;tails importants leur
&#233;chappent et l&#146;erreur judiciaire p&#232;se comme une menace sur chaque dossier.
Cet article vise &#224; montrer, par une exp&#233;rimentation r&#233;elle, que les techniques et m&#233;thodes du
traitement automatique de la langue (TAL) peuvent &#234;tre appliqu&#233;es avec succ&#232;s &#224; de nouveaux
domaines comme les proc&#233;dures judiciaires. Nous nous proposons ici, de poser les bases d&#146;une
m&#233;thode scientifique d&#146;analyse des dossiers d&#146;instruction. Cette m&#233;thode est tout particuli&#232;rement
appropri&#233;e lorsque les t&#233;moignages jouent un r&#244;le pr&#233;pond&#233;rant, notamment, en l&#146;absence de preuves
mat&#233;rielles. C&#146;est, par exemple, le cas dans les affaires de m&#156;urs.  L&#146;augmentation tr&#232;s importante du
nombre de plaintes dans ce domaine cache aussi une recrudescence des fausses accusations :
l&#146;Autonome de Solidarit&#233; (Association assurant la d&#233;fense des enseignants) estime que sur 208
affaires de m&#156;urs enregistr&#233;es chez elle et closes aujourd&#146;hui, seules 26 ont fait effectivement l&#146;objet
de condamnations.
La m&#233;thode expos&#233;e dans cet article met en valeur les propos de chaque individu, souligne l&#146;&#233;volution
ou la stabilit&#233; de ces propos dans le temps et finalement, met au jour la coh&#233;rence ou les incoh&#233;rences
de leurs discours. Elle permet &#233;galement de faciliter l&#146;identification de certaines zones d&#146;ombre qu&#146;il
peut &#234;tre important pour le dossier de lever. Bien &#233;videmment, nos travaux n&#146;ont pas la pr&#233;tention de
prendre une d&#233;cision &#224; la place du juge et cette m&#233;thode se place donc en compl&#233;ment d&#146;autres
sources d&#146;investigation d&#233;j&#224; connues.
Ainsi, des tests psychologiques de personnalit&#233; (Davido, 1997 et HandTest, 1983) sont pratiqu&#233;s &#224; la
demande de la justice par certains psychologues et dans certaines r&#233;gions. Mais la compr&#233;hension de
l&#146;affaire est fr&#233;quemment beaucoup plus complexe et d&#233;passe le niveau de l&#146;individu. (Bensussan,
1999 et 2002) montrent notamment que les situations de crise dans une famille peuvent constituer un
contexte favorable &#224; la formulation d&#146;all&#233;gations mensong&#232;res. Faire la part entre mensonges et v&#233;rit&#233;
n&#233;cessite alors beaucoup de d&#233;termination. Lorsqu&#146;il s&#146;agit d&#146;un enfant par exemple, mettre en doute
sa parole s&#146;il a effectivement subi une agression a des cons&#233;quences dramatiques sur son &#233;quilibre
psychologique et compromet &#233;galement l&#146;issue normale du proc&#232;s. Cependant, croire, sans chercher &#224;
les remettre en cause, aux all&#233;gations mensong&#232;res d&#146;un enfant, conduit progressivement &#224; l&#146;enfermer
dans son mensonge et induit des cons&#233;quences que (Bensussan, 1999) qualifie de plus graves encore
que s&#146;il avait &#233;t&#233; victime. Il convient donc d&#146;&#234;tre tr&#232;s prudent et tr&#232;s fin dans l&#146;analyse d&#146;un dossier et
d&#146;observer un d&#233;tachement suffisant pour ne pas se laisser leurrer par des apparences.
Nous ne nous int&#233;ressons ici qu&#146;&#224; la d&#233;marche scientifique et non &#224; l&#146;affaire elle-m&#234;me. Nous
d&#233;finissons en premier lieu les besoins et les contraintes &#224; prendre en compte. Nous d&#233;crivons ensuite
notre exp&#233;rimentation. Enfin, nous analysons les r&#233;sultats de notre d&#233;marche et &#233;valuons l&#146;apport de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le traitement automatique de la langue contre les erreurs judiciaires
</p>
<p>nos travaux par la pr&#233;sentation de r&#233;sultats qualitatifs. Cet article ne citera &#224; titre d&#146;exemple que
quelques &#233;l&#233;ments d&#146;information pour illustrer nos propos et le lecteur n&#146;aura donc qu&#146;une vue tr&#232;s
partielle qui ne lui permettra pas de comprendre ou de juger la globalit&#233; du dossier. Pour aider &#224; la
compr&#233;hension de nos exemples, nous d&#233;signons les deux personnes (d&#146;une m&#234;me fratrie) ayant
d&#233;pos&#233; plainte par Acc1 et Acc2 et la personne mise en examen par MeE. Les autres intervenants sont
d&#233;sign&#233;s par le lien les reliant &#224; une de ces trois personnes (ex : cousin(Acc1)).
</p>
<p>2 M&#233;thodologie d&#146;analyse
M&#234;me si les avocats peuvent &#233;galement &#234;tre int&#233;ress&#233;s par notre m&#233;thode, l&#146;utilisateur premier d&#146;une
telle analyse est le juge d&#146;instruction, c&#146;est-&#224;-dire, la personne qui doit assumer la difficile t&#226;che
d&#146;instruire le dossier &#224; charge et &#224; d&#233;charge. Nous avons contraint notre m&#233;thode pour qu&#146;en premier
lieu, elle permette de r&#233;duire la masse d&#146;information du dossier &#224; l&#146;information utile puis qu&#146;elle la
rende facilement accessible en la d&#233;formant le moins possible. L&#146;information sera donc cat&#233;goris&#233;e
(au sens de la cat&#233;gorisation de textes en TAL). L&#146;analyse doit &#233;galement &#234;tre objective, fiable,
explicable,  interpr&#233;table, tra&#231;able. Enfin, le processus doit &#234;tre incr&#233;mental, c&#146;est-&#224;-dire, permettre de
saisir progressivement les documents composant le dossier d&#146;instruction et de prendre en compte de
nouveaux documents.
Pour se conformer au cahier des charges, nous avons d&#233;fini une m&#233;thodologie en 4 points : (1) d&#233;finir
les diff&#233;rentes cat&#233;gories selon lesquelles l&#146;utilisateur veut analyser l&#146;information contenue dans les
textes ; (2) rechercher dans les textes, tous les &#233;l&#233;ments d&#146;information relevant d&#146;au moins une des
cat&#233;gories et leur associer la liste des cat&#233;gories pertinentes ; (3)Regrouper ces informations par
cat&#233;gories ; (4) mettre en forme un document synth&#233;tique. Dans cette premi&#232;re exp&#233;rimentation, les
&#233;tapes 1 et 2 ont &#233;t&#233; r&#233;alis&#233;es manuellement.
</p>
<p>3 R&#233;alisation
3.1 D&#233;finition des cat&#233;gories
Le choix des cat&#233;gories d&#233;pend, bien s&#251;r, de la nature du dossier. Les cat&#233;gories peuvent &#234;tre vues
comme un type de questions auxquelles l&#146;utilisateur souhaite avoir une r&#233;ponse. Ainsi, &#171; Rep&#232;res
spaciaux de Acc1 &#187; serait associ&#233; &#224; la question g&#233;n&#233;rique &#171; O&#249; se passent les faits d&#233;crits par Acc1 ? &#187;,
&#171; Personnalit&#233; de Acc1 &#187; serait associ&#233; &#224; la question &#171; quels sont les traits de caract&#232;res de Acc1 &#187;. De plus,
les cat&#233;gories sont recouvrantes : des fragments de texte associ&#233;s &#224; la cat&#233;gorie &#171; rep&#232;res temporels de
X &#187; seront souvent pr&#233;sents &#233;galement dans &#171; rep&#232;re spaciaux de X &#187;.
Personnalit&#233;s et relations entre d&#233;fense et accusation :
</p>
<p>Personnalit&#233; et caract&#232;re de MeE(A2)
Vie familiale de MeE (A3)
Equilibre familiale chez MeE (A5)
Habitudes de famille chez MeE(A7)
Vie sentimentale et sexuelle de MeE (A6)
Relations de MeE avec ses petits-enfants (A11)
Personnalit&#233; de Acc1 (B1),  de Acc2 (C1)
El&#233;ments m&#233;dicaux de Acc1 (B2),  de Acc2 (C2)
Person. de M&#232;re(Acc1 et 2) (D1),    de P&#232;re(Acc1-2) (E1)
Rel. entre M&#232;re(Acc1 et 2) et la famille de MeE (F1)
</p>
<p>El&#233;ments de la d&#233;fense
Impossibilit&#233;s mat&#233;rielles relev&#233;es (H3)
R&#233;futation des accusations par les personnes interrog&#233;es(H4)
Recherche des motivations des accusations (I1)
</p>
<p>El&#233;ments de l&#146;accusation :
Rep&#232;res spaciaux de Acc1 (H71), de Acc2 (H72)
Rep&#232;res temporels de Acc1 (H81), de Acc2 (H82)
Descriptions des faits de Acc1 (H10), de Acc2 (H9)
</p>
<p>Analyse globale du dossier
interventions du juge d'instructions dans le dossier(H51)
</p>
<p>Figure 1 : quelques cat&#233;gories parmi celles retenues pour classer les portions de textes
</p>
<p>3.2 Le fragment de texte
Le dossier d&#146;instruction est un ensemble de documents, certains purement administratifs ou
judiciaires rapportent des d&#233;cisions de la cours mais pr&#233;sentent peut d&#146;int&#233;r&#234;t pour notre &#233;tude. La
plupart des documents, sont des lettres, des auditions de t&#233;moins, des transcriptions d&#146;interrogatoire
ou de confrontation, des compte-rendus d&#146;expertise. Ces documents papier repr&#233;sentent dans notre
affaire environ 1000 pages dactylographi&#233;es ou manuscrites. Le fragment de texte est la notion cl&#233; qui
va nous permettre de garder au moins toutes les portions de textes contenant une information utile.
Pour cela nous avons privil&#233;gi&#233; le bruit au silence, c&#146;est &#224; dire que nous avons pr&#233;f&#233;r&#233; s&#233;lectionner</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yannick Toussaint
</p>
<p>trop de fragments plut&#244;t que d&#146;en oublier. Les fragments de texte sont les &#233;l&#233;ments destin&#233;s &#224; &#234;tre
class&#233;s dans les cat&#233;gories. Ils doivent &#234;tre autonomes, c&#146;est-&#224;-dire que, extraits de leur texte initial et
plac&#233;s dans des cat&#233;gories, les informations que portent les fragments sont toujours intelligibles. Un
fragment de texte doit donc v&#233;rifier les propri&#233;t&#233;s suivantes : (1) Un fragment de texte peut &#234;tre
constitu&#233; d&#146;une partie de phrase, d&#146;une phrase ou de plusieurs phrases ; (2) Une portion de texte ne
peut &#234;tre consid&#233;r&#233; comme fragment que parce qu&#146;elle participe &#224; au moins une des cat&#233;gories
pr&#233;d&#233;finies ; (3) Le fragment respecte le d&#233;coupage syntagmatique du texte, et c&#146;est une unit&#233;
autonome du point de vue s&#233;mantique et pragmatique : isol&#233; de son contexte, le fragment est
interpr&#233;t&#233; par l&#146;utilisateur de la m&#234;me fa&#231;on que s&#146;il &#233;tait rest&#233; dans son contexte. Les anaphores ou
les &#233;lipses situ&#233;es dans un fragment doivent donc faire l&#146;objet d&#146;une annotation manuelle permettant
leur r&#233;solution par le lecteur.
La Figure 2 donne des exemples de fragments extraits de divers documents. Les &#233;l&#233;ments de contexte
indispensables &#224; la compr&#233;hension du fragment sont introduits dans le texte entre parenth&#232;ses comme
dans la r&#233;solution d&#146;anaphores (par exemple : &#171; Ce dernier (MeE) &#187;). Lors de la retranscription d&#146;un
dialogue, nous pr&#233;cisons les intervenants et lorsqu&#146;il s&#146;agit d&#146;une r&#233;ponse,  nous pr&#233;cisons l&#146;&#233;nonc&#233; de
la question comme par exemple : &#171; ((Av. d&#233;fense) Votre femme conduisait elle ?) (MeE) Non. &#187;
</p>
<p>C30a (Au_T&#233;moin, Ni&#232;ce(MeE), jj/mm/aa) : Ce dernier (MeE) se comportait comme un grand-p&#232;re g&#226;teau. Leur vie &#224; tous les
deux (MeE et son &#233;pouse) &#233;tait tourn&#233;e vers les petits enfants d&#232;s qu'ils &#233;taient pr&#233;sents.
</p>
<p>A60b (Exp_Psycho (Dr Alpha, MeE), , jj/mm/aa) : Les mobiles intellectuels qui inspirent habituellement sa (MeE) conduite
sont la volont&#233; de bien se faire comprendre d'autrui, au travers d'argumentations pr&#233;cises et fournies. A
aucun moment, n'est apparu de volont&#233; de manipulation d'autrui.
</p>
<p>D43k (Interr,(juge, MeE), jj/mm/aa) : ((Av. d&#233;fense) Votre femme conduisait elle ?) (MeE) Non.
Figure 2 : Exemples de fragments de texte issus du dossier d&#146;instruction
</p>
<p>En plus de la portion de texte extraite des documents, des m&#233;tadonn&#233;es sont incluses dans le fragment
de texte. A60b, appel&#233; cl&#233;, identifie le fragment de fa&#231;on  unique : A60 (voir Figure 2) fait r&#233;f&#233;rence &#224; la
page dans le dossier, et b (que nous appelons l&#146;identifiant) assure l&#146;unicit&#233; de la cl&#233;. Les identifiants
sont attribu&#233;s de fa&#231;on s&#233;quentielle aux diff&#233;rents fragments issus d&#146;une m&#234;me page de telle fa&#231;on que
A60a est situ&#233; dans la page A60 avant A60b qui lui-m&#234;me est avant A60c. On peut ainsi, sur la base d&#146;un tri,
construire une sorte de r&#233;sum&#233; de chaque document qui ne contiendrait que les informations utiles.
On trouve le type de document (Au_T&#233;moin : audition de t&#233;moin, Interr(juge) : interrogatoire par le juge,
Exp_Psycho (Dr Alpha) : expertise du Docteur Alpha). Enfin, la date (not&#233;e ici jj/mm/aa) peut &#234;tre utilis&#233;e pour
situer les propos dans le temps et en observer &#233;ventuellement l&#146;&#233;volution.
A l&#146;heure actuelle, s&#146;agissant d&#146;une premi&#232;re exp&#233;rimentation, l&#146;extraction des fragments a &#233;t&#233; faite
manuellement.
</p>
<p>3.3 Mise en forme automatique de la synth&#232;se du dossier
Chaque fragment est alors associ&#233; &#224; une ou plusieurs cat&#233;gories, &#233;galement de fa&#231;on manuelle,
comme, par exemple, les cat&#233;gories A2 et A11 pour le fragment B5a:
A2,A11, D5a (Au_T&#233;moin, belle-fille(MeE), jj/mm/aa) : MeE est quelqu'un de gentil, attentionn&#233;, disponible, il
s'occupe de ma fille XX de la m&#234;me mani&#232;re qu'il s'occupe de YY, la fille que j'ai eue avec son fils.
</p>
<p>La mise en forme du document de synth&#232;se est ensuite automatique et rassemble les fragments par
cat&#233;gorie. La mise &#224; jour de ce document est donc tr&#232;s rapide. Ses sections et sous-sections  sont
constitu&#233;es par les cat&#233;gories qui ont &#233;t&#233; d&#233;finies. Quelques sections d&#146;information (aide &#224; la lecture
du document, liste des documents pris en compte) y sont &#233;galement syst&#233;matiquement ajout&#233;es.
</p>
<p>4 Analyse des r&#233;sultats
Dans cette section, nous montrons ce que nos travaux apportent &#224; la compr&#233;hension du dossier
d&#146;instruction. Nous d&#233;crivons, en m&#234;me temps, la m&#233;thodologie d&#146;analyse qualitative du document de
synth&#232;se. Dans cet article nous aborderons quatre points : (1) l&#146;&#233;tude des caract&#232;res des personnes en
pr&#233;sence dans le dossier (d&#233;fense et accusation), (2) l&#146;identification de contradictions dans les propos</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le traitement automatique de la langue contre les erreurs judiciaires
</p>
<p>ou, au contraire, l&#146;observation de la stabilit&#233; de certains autres, (3) l&#146;analyse de certains manques dans
le dossier, et, enfin, (4) l&#146;analyse du d&#233;roulement de la proc&#233;dure d&#146;instruction.
En premier lieu, donnons une rapide vision quantitative du dossier :  nous avons du num&#233;riser tous les
fragments retenus. Nous avons isol&#233; dans tout le dossier d&#146;instruction, 950 fragments, 25 000 mots,
soit une moyenne de 26 mots par fragments. La taille des fragments est tr&#232;s variable : de trois mots &#224;
un paragraphe entier. La r&#233;partition de ces fragments dans des cat&#233;gories a donn&#233; 2032 couples. Le
document word de synth&#232;se fait 58 pages (times,12 pts), ce qui est tout &#224; fait analysable
manuellement. L&#146;analyse des r&#233;sultats est faite &#224; partir du document de synth&#232;se qui est produit pour
l&#146;utilisateur.
</p>
<p>4.1 Analyse des caract&#232;res des personnes en pr&#233;sence
La lecture des diff&#233;rentes cat&#233;gories rassemblant les traits de chacune des personnalit&#233;s pr&#233;sente un
int&#233;r&#234;t dans la mesure o&#249; elles permettent &#224; l&#146;utilisateur de notre m&#233;thodologie de se faire une bonne
id&#233;e des individus. Le nombre de fragments dans ces cat&#233;gories est tr&#232;s variable : 111 fragments pour
le MeE (ex : le fragment A60b d&#233;j&#224; cit&#233;) mais seulement 8 pour Acc2. Nous avons proc&#233;d&#233; &#224; plusieurs
lectures. La premi&#232;re, une lecture s&#233;quentielle, permet de dresser un portrait global. La seconde plus
minutieuse exploite les m&#233;tadonn&#233;es des fragments. Ainsi, la nature de la relation existant entre un
t&#233;moin et le MeE peut-elle &#234;tre prise en compte pour appr&#233;cier l&#146;importance d&#146;un propos.
</p>
<p>4.2 Contradictions versus stabilit&#233; dans les d&#233;clarations
Nous avons cherch&#233; s&#146;il y avait des contradictions au sein d&#146;une m&#234;me cat&#233;gorie, que ce soit des
propos formul&#233;s par le m&#234;me individu ou par des personnes diff&#233;rentes. Les contradictions les plus
flagrantes portent sur la description des faits. Nous pr&#233;f&#233;rons citer ici deux petits exemples produits
par la m&#234;me personne o&#249; l&#146;on constate une confusion certaine dans les dates. Nous avons pu
&#233;galement observer que des &#171; erreurs &#187; dans les dates cit&#233;es par certains t&#233;moins sont partag&#233;es &#224;
l&#146;identique par plusieurs personnes qui affirment pourtant ne pas s&#146;&#234;tre concert&#233;es. Dans D2a ci-
dessous, nous avons une double r&#233;f&#233;rence &#224; une ann&#233;e que nous d&#233;signons par ann&#233;e_1. Dans D217c,
nous retrouvons &#233;galement une double r&#233;f&#233;rence temporelle mais cette fois avec une autre valeur
ann&#233;e_2 et il n&#146;y a pas de recouvrement entre les deux p&#233;riodes cit&#233;es.
D2a (lettre(Dr xxx), Acc2, jj/dd/aa) : Acc2 r&#233;p&#232;te que les fait se passaient  vers l'&#226;ge de xx ans, plusieurs fois (la derni&#232;re
fois, elle devait &#234;tre en classe de &lt;nom d&#146;une classe_1&gt;, il y a donc 2 ans).
D217c (Confr, MeE,Acc2, jj/mm/aa) : J'allais souvent en vacances chez eux.  Les faits ont commenc&#233; alors que j'&#233;tais en
</p>
<p>classe de &lt;nom d&#146;une classe_2&gt; &#224; peu pr&#233;s. Ils se sont termin&#233;s en ann&#233;e_2.
</p>
<p>Nous avons donc cherch&#233;, en parcourant cette cat&#233;gorie, une explication &#224; cette incoh&#233;rence. Selon les
dates caract&#233;risant les fragments, on observe qu&#146;apr&#232;s la d&#233;claration D2a de Acc2, le MeE a invalid&#233;
l&#146;accusation en soulignant (fragment D118g, non cit&#233;) qu&#146;&#224; l&#146;&#233;poque mentionn&#233;e, il ne voyait plus Acc2
depuis x ann&#233;es. Acc2 corrige donc D2a par D217c pour resituer les accusations dans un intervalle de
temps plausible.
Bien s&#251;r,  les contradictions les plus flagrantes se trouvent en confrontant les propos tenus par des
personnes diff&#233;rentes. Cependant, la recherche de contradictions ne doit pas masquer la stabilit&#233; de
certains propos. Nous les avons &#233;galement &#233;tudi&#233;es. C&#146;est le cas, par exemple, de la r&#233;futation des
accusations par MeE ou de certaines descriptions de Acc1.
</p>
<p>4.3 Les manques dans le dossier
Alors que notre d&#233;marche initiale s&#146;inscrivait de facto dans une analyse des fragments extraits des
textes donc pr&#233;sents, nous nous sommes demand&#233; s&#146;il n&#146;y avait pas des manques dans le dossier. Il
est, en effet , possible de travailler sur l&#146;absence d&#146;information dans une cat&#233;gorie ou dans la globalit&#233;
du dossier. On remarque par exemple que personne de l&#146;accusation n&#146;a formul&#233; de propos sur la
personnalit&#233; ou sur le caract&#232;re du MeE. Comme certains t&#233;moins &#233;voquaient des relations difficiles
entre MeE et la famille de Acc1 et 2, le juge aurait pu orienter ses questions pour mieux conna&#238;tre la
fa&#231;on dont les deux parties accusation et d&#233;fense se percevaient.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yannick Toussaint
</p>
<p>Nous nous sommes ensuite int&#233;ress&#233; aux cat&#233;gories contenant peu de fragments : nous avons
notamment trouv&#233; celle sur le caract&#232;re du p&#232;re de Acc1 et Acc2. Seulement 18 fragments de textes
&#233;voquent le caract&#232;re du p&#232;re contre 36 pour la m&#232;re. Certains de ces fragments &#233;voquent un caract&#232;re
effac&#233;, un manque d&#146;autorit&#233;. Nous avons alors cherch&#233; toutes les interventions du p&#232;re dans le
dossier. Il n&#146;y a qu&#146;une lettre de sa part mais elle ne fait que rapporter les propos de Acc1. Sinon,
aucune d&#233;position ni aucun interrogatoire. Il n&#146;a donc jamais &#233;t&#233; invit&#233; &#224; donner son avis.
</p>
<p>4.4 Analyse du d&#233;roulement de l&#146;instruction
Convaincu que notre d&#233;marche appliqu&#233;e &#224; des dossiers en cours constituerait une aide pour le juge
dans la phase d&#146;instruction, il &#233;tait l&#233;gitime que nous nous demandions comment, dans une d&#233;marche
classique, le juge d&#146;instruction intervenait dans le dossier pour mener l&#146;instruction. Nous avons donc
d&#233;fini une cat&#233;gorie particuli&#232;re qui nous a permis de collecter l&#146;ensemble des interventions du juge
d&#146;instruction dans le dossier.
On constate que, malgr&#233; les risques soulign&#233;s par (Bensussan,1999), &#224; aucun moment, le juge
d&#146;instruction ne remet en cause l&#146;accusation. Les questions pos&#233;es &#224; Acc1 et 2 sont essentiellement
des demandes de pr&#233;cision. L&#146;analyse de cette cat&#233;gorie refl&#232;te globalement une certaine passivit&#233; du
juge et une adh&#233;sion totale aux propos de l&#146;accusation. On observe &#233;galement que phrases formul&#233;es
par le juge d&#146;instruction pour les demandes d&#146;expertises (psychologiques&#133;) contiennent des
pr&#233;suppos&#233;s qui d&#233;signent clairement le mis en examen comme coupable. On peut s&#146;en &#233;tonner m&#234;me
s&#146;il est difficile d&#146;estimer pr&#233;cis&#233;ment l&#146;impact de ces pr&#233;suppos&#233;s sur le compte-rendu des experts.
</p>
<p>5 Conclusions et perspectives
Nous avons montr&#233; dans cet article que la m&#233;thodologie que nous avons mise en &#156;uvre pour analyser
le contenu d&#146;un dossier d&#146;instruction volumineux permet de rep&#233;rer la coh&#233;rence ou les incoh&#233;rences
de certains propos, leur stabilit&#233; ou leur &#233;volution. Elle s&#146;av&#232;re &#233;galement tr&#232;s efficace pour avoir une
vision synth&#233;tique du dossier. Elle guide l&#146;utilisateur pour demander de nouvelles recherches ou pour
poser de nouvelles questions. Ce travail soul&#232;ve quelques questions fondamentales.
Tout d&#146;abord, une telle syst&#233;maticit&#233;  dans l&#146;analyse d&#146;un dossier est-elle souhaitable et les deux
ann&#233;es que dure g&#233;n&#233;ralement une instruction ne permettent-elles pas au juge de faire cette synt&#232;se
objective ? Il est probable que non puisqu&#146;on remarque que l&#146;ordonnance finale de quelques pages
que rend le juge d&#146;instruction sur le dossier analys&#233; ici contient des inexactitudes et attribue &#224; un
t&#233;moin des propos qu&#146;il n&#146;a pas tenus.
On peut &#233;galement se demander si des informations essentielles, n&#146;ont pas &#233;t&#233; oubli&#233;es au cours de la
collecte des fragments. On ne peut le garantir formellement mais l&#146;impact d&#146;un ou de quelques oublis
reste mineur. Notre d&#233;marche doit &#234;tre per&#231;ue comme une aide faisant partie d&#146;une proc&#233;dure
beaucoup plus complexe. Il ne faut pas interpr&#233;ter trop rapidement les contradictions (respectivement
la stabilit&#233;) des propos comme des &#233;l&#233;ments n&#233;gatifs (resp. positifs). Nous soulignons simplement que
ce sont des &#233;l&#233;ments qui ne peuvent pas &#234;tre pass&#233;s compl&#232;tement sous silence et qu&#146;ils peuvent
alimenter une r&#233;flexion approfondie qui prendra alors le pas sur une intuition trop souvent sollicit&#233;e.
</p>
<p>R&#233;f&#233;rences
Aas K., Eikvil L. (1999), Text categorisation: A survey. Technical report, Norwegian Computing
</p>
<p>Center, juin 1999.
Bensussan P. (1999), Inceste, le pi&#232;ge du soup&#231;on, Belfond, Paris.
Bensussan P., Rault F. (2002), La dictature de l'&#233;motion. La protection de l'enfant et ses d&#233;rives,
</p>
<p>Belfond, Paris.
Davido R. (1997), Le DAVIDO-CHAD. Le nouveau test psychologique : du d&#233;pistage &#224; la th&#233;rapie,
</p>
<p>Coll. Psychologiques, ISBN : 2-7384-5181-0.
HandTest (1983), Western Psychological Services ed./Los Angeles.</p>

</div></div>
</body></html>