<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La topologie comme interface entre syntaxe et prosodie : un syst&#232;me de g&#233;n&#233;ration appliqu&#233; au grec moderne</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>La topologie comme interface entre syntaxe et prosodie : 
un syst&#232;me de g&#233;n&#233;ration appliqu&#233; au grec moderne 
</p>
<p>Kim Gerdes (1), Hi-Yon Yoo (2) 
</p>
<p>(1) Lattice &#150; Universit&#233; Paris 7 
2, place Jussieu 75251 Paris Cedex 05 
</p>
<p>kim@linguist.jussieu.fr 
(2) ARP &#150; Universit&#233; Paris 7 
</p>
<p>2, place Jussieu 75251 Paris Cedex 05 
hi-yon.yoo@linguist.jussieu.fr 
</p>
<p>R&#233;sum&#233; &#150; Abstract  
</p>
<p>Dans cet article, nous d&#233;veloppons les modules syntaxique et topologique du mod&#232;le Sens-
Texte et nous montrons l&#146;utilit&#233; de la topologie comme repr&#233;sentation interm&#233;diaire entre les 
repr&#233;sentations syntaxique et phonologique. Le mod&#232;le est impl&#233;ment&#233; dans un g&#233;n&#233;rateur et 
nous pr&#233;sentons la grammaire du grec moderne dans cette approche. 
</p>
<p>In this paper, we develop the syntactic and topological modules of the Meaning-Text model. 
We show the use of topology as the interface of syntax and phonology. The model is 
implemented in a speech generator and we present its Greek grammar. 
</p>
<p>Keywords &#150; Mots Cl&#233;s  
</p>
<p>grammaires de d&#233;pendance, ordre des mots, prosodie, topologie, g&#233;n&#233;rateur de parole, grec 
dependency grammar, word order, prosody, topology, language generation, Greek 
</p>
<p>1 Introduction 
</p>
<p>Ce papier propose une mod&#233;lisation du lien entre syntaxe et prosodie. Nous consid&#233;rons la 
repr&#233;sentation syntaxique comme l&#146;un des niveaux interm&#233;diaires entre la forme logique (le 
sens) et la forme phon&#233;tique (le son) et nous nous pla&#231;ons dans un mod&#232;le lin&#233;aire de la 
langue o&#249; la synth&#232;se (et l&#146;analyse) se fait par une s&#233;rie de correspondances entre des niveaux 
de repr&#233;sentations adjacents. De telles approches lin&#233;aires se sont av&#233;r&#233;es avantageuses pour 
le traitement automatique des langues, notamment la traduction automatique, depuis ses 
d&#233;buts jusqu&#146;aux projets les plus r&#233;cents (par exemple VerbMobil, Wahlster 2000). En effet, 
des mod&#232;les peu articul&#233;s comme les mod&#232;les chomskyens, qui donnent une place 
pr&#233;pond&#233;rante &#224; une seule structure qui encode &#224; la fois des informations de types s&#233;mantique, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kim Gerdes et Hi-Yon Yoo 
</p>
<p>syntaxique et l&#146;ordre des mots, sont peu aptes &#224; un traitement informatique. La consid&#233;ration 
d&#146;une cha&#238;ne de niveaux interm&#233;diaires permet d&#146;&#233;laborer des r&#232;gles de correspondance plus 
simples et plus structur&#233;es.  
</p>
<p>Notre travail se place dans le cadre de la Th&#233;orie Sens-Texte (TST), qui propose un mod&#232;le 
tr&#232;s &#233;labor&#233; d&#146;une analyse linguistique modulaire et lin&#233;aire. N&#233;anmoins, dans ce cadre, la 
place de la prosodie n&#146;a pas &#233;t&#233; clairement d&#233;finie, la plupart des travaux portant sur les 
correspondances entre s&#233;mantique et syntaxe ou sur l&#146;&#233;laboration de la morphologie (cf. 
Mel&#146;&#269;uk 1988). 
</p>
<p>Dans la suite, nous pr&#233;sentons tr&#232;s bri&#232;vement les niveaux classiques de la TST ainsi que les 
am&#233;nagements que nous proposons. La Section 2 introduit la correspondance entre syntaxe et 
topologie de mani&#232;re g&#233;n&#233;rale et sp&#233;cifique au grec moderne. De m&#234;me, la Section 3 pr&#233;sente 
la correspondance entre topologie et phonologie et l&#146;instanciation pour le grec. Avant de 
conclure, nous indiquons tr&#232;s bri&#232;vement comment nous produisons le son &#224; partir de la 
structure phonologique dans notre g&#233;n&#233;rateur DepLin.  
</p>
<p>1.1 Am&#233;nagement de la TST entre syntaxe et surface 
</p>
<p>La TST classique consid&#232;re trois niveaux interm&#233;diaires entre la structure s&#233;mantique et la 
structure phon&#233;tique : Syntaxe, Morphologie et Phonologie, chaque niveau &#233;tant sous-divis&#233; 
en un niveau profond (en direction du sens) et un niveau de surface (en direction de la sortie 
phon&#233;tique). Dans notre approche, nous gardons les niveaux s&#233;mantique et syntaxique. 
L&#146;arbre syntaxique de surface repr&#233;sente notre point de d&#233;part (dans le sens de la synth&#232;se, la 
direction pr&#233;f&#233;r&#233;e de la TST, bien que les r&#232;gles soient bidirectionnelles). Les repr&#233;sentations 
syntaxiques de la TST sont les arbres de d&#233;pendance syntaxiques. A partir de cet arbre de 
d&#233;pendance, nous calculons une repr&#233;sentation de la phrase lin&#233;airement ordonn&#233;e. Nous 
suivons Gerdes &amp; Kahane 2001 en consid&#233;rant une repr&#233;sentation morphologique profonde 
augment&#233;e d&#146;un arbre de constituants, appel&#233; structure topologique. C&#146;est &#224; partir de cette 
structure que se fait le calcul de l&#146;&#233;tape suivante : le niveau phonologique, constitu&#233; d&#146;une 
cha&#238;ne lin&#233;aire de phon&#232;mes dot&#233;e d&#146;une structure prosodique arborescente. Le niveau 
phonologique permettra par la suite le calcul final de la sortie phon&#233;tique.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>structure s&#233;mantique (&#171; sens &#187;) 
</p>
<p>sortie son (&#171; texte &#187;) 
</p>
<p>syntaxe profonde 
</p>
<p>syntaxe de surface 
</p>
<p>morphologie profonde 
</p>
<p>morphologie de surface 
</p>
<p>phonologie profonde 
</p>
<p>phonologie de surface 
</p>
<p>structure s&#233;mantique (&#171; sens &#187;) 
</p>
<p>sortie son (&#171; texte &#187;) 
</p>
<p>syntaxe profonde 
</p>
<p>syntaxe de surface 
</p>
<p>topologie 
</p>
<p>phonologie  
</p>
<p>Figure 1 : Niveaux de la TST classique (gauche) et am&#233;nagement pour la prosodie 
(droite) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La topologie comme interface entre syntaxe et prosodie 
</p>
<p>Nous ne pouvons exclure l&#146;utilit&#233; d&#146;une sous-division plus fine des &#233;tapes entre syntaxe et 
sortie son, comme le propose la TST classique, pour le traitement d&#146;autres langues que celles 
test&#233;es avec notre g&#233;n&#233;rateur (allemand, cor&#233;en, fran&#231;ais et grec moderne) ou pour des 
analyses plus fines que celles faites par nos grammaires tests. L&#146;impl&#233;mentation modulaire de 
DepLin (en Java) et la possibilit&#233; de sortie ou entr&#233;e en fichier XML &#224; chaque niveau rendent 
facile d&#146;affiner nos &#233;tapes quand l&#146;analyse linguistique l&#146;exigera. 
</p>
<p>2 Interface Syntaxe-Topologie 
</p>
<p>Notons d&#146;abord que notre structure de d&#233;part, l&#146;arbre de d&#233;pendance syntaxique de surface, 
contient un n&#156;ud pour chaque mot de la phrase, et comme il est de coutume dans les 
grammaires de d&#233;pendance, le verbe fini est le n&#156;ud racine de l&#146;arbre de d&#233;pendance d&#146;une 
phrase, qu&#146;il s&#146;agisse d&#146;un auxiliaire, d&#146;un verbe modal ou d&#146;un verbe plein. Dans la TST, les 
n&#156;uds de cet arbre sont augment&#233;s d&#146;un marquage indiquant le groupement communicatif 
(Mel&#146;&#269;uk 2001, on trouve &#233;galement le terme &#171; structure informationnelle &#187;, cf. Lambrecht 
1994). Mel&#146;&#269;uk 2001, dans une tradition pragoise, propose un d&#233;coupage principal en th&#232;me 
et en rh&#232;me, la notion de th&#232;me renvoyant &#224; &#171; ce dont on parle &#187;, et celle de rh&#232;me &#224; &#171; ce 
qu&#146;on en dit &#187;. Nous adoptons une r&#233;partition tripartite (Valduvi 1992, voir aussi Choi 1999) 
en topique, focus et tail, o&#249; le focus correspondrait au rh&#232;me, le topique au th&#232;me pro&#233;minent 
et le tail en th&#232;me non pro&#233;minent. Un tel arbre de d&#233;pendance diff&#232;re d&#146;un arbre X-barre, qui 
contient outre l&#146;information de d&#233;pendance entre les mots (la t&#234;te d&#146;un syntagme X-barre 
gouverne syntaxiquement les autres membres du syntagme) l&#146;information sur le regroupement 
des mots et sur leur ordre lin&#233;aire. Dans les grammaires de d&#233;pendance, on consid&#232;re que ces 
diff&#233;rents types d&#146;information doivent &#234;tre exprim&#233;s dans des structures certes li&#233;es mais 
s&#233;par&#233;es. Pourtant, le calcul de l&#146;ordre des mots &#224; partir de l&#146;arbre de d&#233;pendance peut s&#146;av&#233;rer 
difficile pour des langues comme l&#146;allemand o&#249; l&#146;ordonnancement des mots par rapport &#224; 
l&#146;arbre de d&#233;pendance n&#146;est pas projectif ; autrement dit, les mots se lin&#233;arisent pas forc&#233;ment 
par rapport &#224; leur gouverneur. Et pourtant, &#171; la position des mots dans la phrase allemande 
n&#146;est pas relative, comme on l&#146;enseigne trop souvent avec la th&#233;orie de l&#146;inversion, ce qui 
brouille tout, mais bien absolue, puisque le verbe ne se place pas apr&#232;s tel ou tel autre mot, 
mais bien, selon la nature de la phrase, &#224; une place fixe et d&#233;termin&#233;e en elle-m&#234;me &#187; 
(Tesni&#232;re 1959:130).  
</p>
<p>Les analyses bas&#233;es sur la notion de &#171; place &#187; repose sur des travaux traditionnels en 
grammaire germanique (commen&#231;ant par le syst&#232;me Herling-Erdmann du 19e si&#232;cle). Pour le 
processus de lin&#233;arisation d&#146;un arbre de d&#233;pendance allemand, il est &#233;galement utile de donner 
un statut formel &#224; cette id&#233;e de place fixe. Des premiers pas dans cette direction ont &#233;t&#233; faits 
par Br&#246;ker 1998. Duchier &amp; Debusmann 2001 proposent un mod&#232;le plus complet de 
lin&#233;arisation dans un contexte des grammaires &#224; contraintes, et Gerdes &amp; Kahane 2001 ont 
d&#233;velopp&#233; un formalisme dans le cadre de la TST. C&#146;est cette derni&#232;re approche que nous 
adoptons pour notre analyse. Dans cette approche, on construit une structure hi&#233;rarchique de 
constituants topologiques, qui s&#146;int&#232;grent dans le processus de lin&#233;arisation de la TST. La 
structure topologique r&#233;sultante repr&#233;sente un niveau interm&#233;diaire entre la syntaxe et le 
niveau phonologique : la consid&#233;ration de la structure topologique facilite d&#146;une part les r&#232;gles 
de lin&#233;arisation, et d&#146;autre part, le calcul de la structure prosodique du niveau de 
repr&#233;sentation suivant. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kim Gerdes et Hi-Yon Yoo 
</p>
<p>Les constituants de l&#146;arbre topologique sons appel&#233;s domaines. Un domaine est une s&#233;rie 
lin&#233;aire de places fixes, qu&#146;on appelle champs. Chaque champ indique ses propres restrictions 
de contenance, i.e. le nombre de constituants (domaines) qu&#146;il peut ou doit accueillir pour que 
la structure topologique soit bien-form&#233;e. Il est important de noter que les champs ne sont pas 
des constituants : deux constituants qui partagent le m&#234;me champ ne forment pas 
obligatoirement une unit&#233; topologique. Etant donn&#233; notre point de d&#233;part qui est l&#146;arbre de 
d&#233;pendance de surface, la lin&#233;arisation commence par placer la racine de ce dernier dans le 
champ initial. Les r&#232;gles de construction de domaine permettent &#224; un &#233;l&#233;ment d&#146;ouvrir un 
domaine autour de lui et de se placer dans un champ sp&#233;cifi&#233; de ce domaine. Une telle 
cr&#233;ation du domaine peut &#234;tre contrainte par la cat&#233;gorie et la valeur communicative de 
l&#146;&#233;l&#233;ment ainsi que le champ dans lequel il se trouve. Les r&#232;gles de correspondance indiquent 
comment un d&#233;pendant se place par rapport &#224; la position topologique de son gouverneur : le 
positionnement du d&#233;pendant est contraint par le champ du gouverneur, la relation syntaxique 
qu&#146;il entretient avec son gouverneur et encore par la cat&#233;gorie et la valeur communicative de 
ce dernier. Normalement, le d&#233;pendant se place &#224; l&#146;int&#233;rieur du domaine de son gouverneur, 
mais il n&#146;est pas exclu qu&#146;il soit plac&#233; dans un domaine sup&#233;rieur sous restriction du type de 
domaine dont il &#171; s&#146;&#233;mancipe &#187;. 
</p>
<p>Un tel formalisme peut &#234;tre instanci&#233; pour des langues de types tr&#232;s vari&#233;, allant du fran&#231;ais 
ou de l&#146;anglais o&#249; le placement des mots est presque exclusivement d&#233;termin&#233; par les relations 
syntaxiques qu&#146;ils entretiennent entre eux, jusqu&#146;aux langues dites &#224; ordre de mots libre 
comme le russe ou le grec moderne, o&#249; les valeurs communicatives prennent le devant sur les 
relations syntaxiques. L&#146;ordre des mots en allemand est contraint par les deux facteurs, 
puisque certains &#233;l&#233;ments comme le verbe fini se voient attribuer une place fixe tandis que 
d&#146;autres peuvent appara&#238;tre dans des positions tr&#232;s vari&#233;es en fonction de leurs valeurs 
communicatives.1 Pour la grammaire topologique de l&#146;allemand nous renvoyons &#224; Gerdes &amp; 
Kahane 2001. Dans la section suivante, nous d&#233;veloppons la grammaire topologique du grec 
moderne qui, diff&#233;remment du fran&#231;ais, se base principalement sur la valeur communicative 
des &#233;l&#233;ments. 
</p>
<p>2.1 La topologie du grec moderne 
</p>
<p>Nous illustrons dans cette partie la correspondance syntaxe-topologie par une analyse de 
l&#146;ordre des mots en grec moderne, pr&#233;sent&#233;e dans les grammaires comme une langue &#171; &#224; ordre 
libre &#187;. La justification que l'on trouve pour ce fait est que, par exemple, pour une phrase &#224; 
deux arguments nominaux (SVO), les six permutations sont attest&#233;es (SVO, SOV, OSV, 
OVS, VSO, VOS). Or si l'on prend en consid&#233;ration les possibilit&#233;s de variation prosodique 
pour un ordre donn&#233;, on s'aper&#231;oit que le nombre de phrases attest&#233;es pour une structure 
argumentale augmente consid&#233;rablement. Pour une phrase &#224; deux arguments, on a &#224; faire non 
plus &#224; six phrases possibles, mais &#224; 25 r&#233;alisations possibles, combinant les variations d'ordre 
                                                 
1  Si la notion de topologie a &#233;t&#233; d&#233;velopp&#233; pour les langues germaniques, c&#146;est que l&#146;analyse de leur ordres des 
</p>
<p>mots requiert la prise en compte des contraintes &#224; la fois communicatives et syntaxiques ; le fran&#231;ais &#233;crit par 
exemple, s&#146;adapte plut&#244;t bien &#224; l&#146;analyse &#224; une analyse X-barre, car les contraintes communicatives sont 
secondaires. Une structure topologique du fran&#231;ais ressemblerait donc beaucoup &#224; une structure X-barre avec 
la diff&#233;rence notable que la structure topologique ne repr&#233;sente pas explicitement les d&#233;pendances entre les 
&#233;l&#233;ments. Un calcul est n&#233;cessaire pour les obtenir. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La topologie comme interface entre syntaxe et prosodie 
</p>
<p>des mots et les diff&#233;rentes r&#233;alisations prosodiques. Dire donc qu'une langue est &#171; &#224; ordre libre 
des mots &#187;, revient finalement &#224; consid&#233;rer que pour une structure argumentale donn&#233;e, 
beaucoup d'ordres des mots, mais pas tous, sont possibles, et ce avec diff&#233;rentes r&#233;alisations 
prosodiques. N&#233;anmoins, une langue comme le grec moderne a un comportement bien 
diff&#233;rent de l'allemand car le placement des &#233;l&#233;ments de phrase est encore davantage r&#233;gi par 
des contraintes d'ordre s&#233;mantico-communicatives que syntaxiques2.  
</p>
<p>2.2 Les r&#232;gles topologique du grec moderne 
</p>
<p>La structure topologique du grec moderne consiste en un champ initial qui ouvre un domaine 
principal. Le domaine principal consiste en trois champs, nomm&#233;s &#224; partir du marquage 
communicatif, compte tenu du fait que les &#233;l&#233;ments ayant le m&#234;me marquage, seront 
susceptibles d'&#234;tre plac&#233;s dans ces champs. Dans l'ordre, nous avons donc le TopF (champ de 
topique), le FocF (champ du focus) et le tailF (champ du tail). Nous indiquons dans les r&#232;gles 
de description de champs sur le fait que le FocF contient exactement un &#233;l&#233;ment (un domaine 
ench&#226;ss&#233;), tandis que le TopF et le tailF n&#146;ont pas de restrictions quant au nombre d&#146;&#233;l&#233;ments 
qu&#146;ils peuvent accueillir. 
</p>
<p> 
</p>
<p> 
</p>
<p>La t&#234;te verbale se place dans l&#146;un des champs majeurs en fonction de sa valeur 
communicative : s'i elle  a un marquage communicatif de focus, elle sera plac&#233; dans le champ 
focus et ainsi de suite. S'appliquent ensuite les r&#232;gles de cr&#233;ation de domaines ench&#226;ss&#233;s. La 
t&#234;te verbale de la d&#233;pendance syntaxique ouvre un domaine ench&#226;ss&#233; dans le champ majeur o&#249; 
il a &#233;t&#233; plac&#233;.  
</p>
<p>Le domaine ench&#226;ss&#233; comporte 5 champs : celui de Vorfeld (qui peut contenir un nombre 
quelconque d&#146;&#233;l&#233;ments), le Na-feld (la place pour le marquage de certaines formes verbales 
comme le futur et les verbes en na ; il contient z&#233;ro ou un &#233;l&#233;ment), le Clitiquefeld (la place 
des clitiques3), le Verbfeld (qui ne contient que le verbe) et le Nachfeld (pour d&#146;autres 
d&#233;pendants du verbe, sans 
restriction du nombre 
d&#146;&#233;l&#233;ments qu&#146;il peut 
contenir).  
</p>
<p>La t&#234;te verbale ouvre donc ce domaine ench&#226;ss&#233; et se place dans le champ du verbe. Ensuite, 
les d&#233;pendants verbaux peuvent se placer. Si les d&#233;pendants partagent le m&#234;me marquage 
</p>
<p>                                                 
2  Les contraintes syntaxiques peuvent &#233;galement intervenir. Contrairement &#224; l'allemand o&#249; nous avons une 
</p>
<p>place syntaxiquement d&#233;termin&#233;e pour le verbe principal de la phrase (V2), le grec moderne semble plus 
&#171; libre &#187; dans le sens o&#249; c&#146;est essentiellement le marquage communicatif port&#233; par les &#233;l&#233;ments et h&#233;rit&#233; du 
niveau s&#233;mantique qui d&#233;termine leur place lin&#233;aire. 
</p>
<p>3  Comme en fran&#231;ais, l&#146;ordre de placement des clitiques n&#146;est pas libre, et pour un traitement complet, il faudra 
envisager une s&#233;paration plus fine de ce champ. 
</p>
<p>Champ initial 
</p>
<p>Domaine principal 
</p>
<p>Domaine principal 
</p>
<p>Topicfield Focusfield tailfield 
</p>
<p>domaine ench&#226;ss&#233; 
</p>
<p>Vorfeld Na-feld Clitiquefeld Verbfeld Nachfeld</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kim Gerdes et Hi-Yon Yoo 
</p>
<p>communicatif, ils restent &#224; l'int&#233;rieur du m&#234;me domaine et se placent selon le r&#244;le qu'ils jouent 
dans la d&#233;pendance syntaxique ou leur nature grammaticale : ainsi, un clitique se place dans le 
Clitiquefeld, le compl&#233;ment sujet dans le Vorfeld ou le Nachfeld, le compl&#233;ment objet direct 
dans le Nachfeld etc. Nous supposons que la structure communicative est une partition, c&#146;est-
&#224;-dire que chaque &#233;l&#233;ment appartient &#224; un et un seul groupement communicatif. Afin de 
repr&#233;senter &#224; l&#146;aide de traits simples la superposition d&#146;une telle structure communicative sur 
l&#146;arbre de d&#233;pendance syntaxique, nous introduisons la convention suivante : seul le 
gouverneur syntaxique d&#146;un groupe porte la valeur communicative du groupe, ses d&#233;pendants 
&#233;tant marqu&#233;s N comme &#171; neutre &#187;. Autrement dit, chaque &#233;l&#233;ment qui porte une valeur autre 
que N ouvre un autre groupement communicatif. Par contre si un d&#233;pendant a une valeur 
communicative diff&#233;rente de son gouverneur, les r&#232;gles de correspondance l&#146;obligent 
g&#233;n&#233;ralement &#224; s&#146;&#233;manciper dans le champ correspondant &#224; sa valeur communicative. Seuls 
l&#146;objet direct et les d&#233;pendants verbaux connaissent des restrictions interdisant l&#146;&#233;mancipation 
dans un champ correspondant &#224; leur valeur communicative.  
</p>
<p>Un d&#233;pendant verbal ouvre toujours un domaine ench&#226;ss&#233; ind&#233;pendamment du champ o&#249; il a 
&#233;t&#233; plac&#233;. Si le d&#233;pendant verbal est un compl&#233;menteur, il ouvre un domaine pour les 
compl&#233;tives, qui contient un champ CF pour lui-m&#234;me et un deuxi&#232;me champ pour le verbe 
r&#233;gi. Ce deuxi&#232;me champ diff&#232;re en fonction de l&#146;endroit o&#249; le compl&#233;menteur a ouvert son 
domaine : dans le TopF, le domaine compl&#233;tif consiste en CF et TopF, dans les tailF de CF et 
tailF et dans le Nachfeld, de CF et Nachfeld. Seul quand le compl&#233;menteur se trouve dans le 
focF, le domaine qu&#146;il cr&#233;e est plus complexe : il contient un CF suivi des trois champs 
majeurs : TopF, FocF et tailF. Les d&#233;pendants d&#146;un gouverneur qui se trouve dans le domaine 
compl&#233;tif doivent obligatoirement se placer &#224; l&#146;int&#233;rieur de ce domaine, et ne peuvent donc 
pas s&#146;&#233;manciper.  
</p>
<p>Suivant les r&#232;gles d&#233;crites ci-dessus, nous obtenons &#224; partir de l&#146;arbre de d&#233;pendance 
syntaxique de surface augment&#233; d&#146;un marquage communicatif &#224; gauche dans la Figure 2, les 
lin&#233;arisations (en bas, un des arbres topologique s&#146;affiche &#224; droite). L&#146;arbre de d&#233;pendance 
syntaxique repr&#233;sente un verbe ayant un d&#233;pendant nominal sujet et un d&#233;pendant verbal 
(verbe en &#150;na). La t&#234;te verbale est marqu&#233;e comme focus, et les d&#233;pendants, qui forment un 
groupe communicatif avec leur gouverneur, sont marqu&#233;s neutre. Nous obtenons, apr&#232;s 
applications des r&#232;gles de lin&#233;arisation pour le grec, les trois lin&#233;arisations suivantes que nous 
pr&#233;sentons dans la capture d&#146;&#233;cran ci-dessus. 
</p>
<p>Dans la premi&#232;re lin&#233;arisation, la t&#234;te verbal uposceqhke &#145;a promis&#146; se place dans le FocF et 
ouvre un domaine offrant des places pour ses d&#233;pendants. A cause de leur marquage 
communicatif N, tous les d&#233;pendants restent &#224; l&#146;int&#233;rieur du domaine et il n&#146;y a pas 
d&#146;&#233;mancipation. Ne pouvant se placer dans le Vorfeld, le d&#233;pendant verbal na faei &#145;de 
manger&#146; ouvre un nouveau domaine dans le Nachfeld : na se place dans le Na-feld et le verbe 
dans le VerbF. Le d&#233;pendant nominal de na faei &#145;de manger&#146; to frouto  &#145;le fruit&#146; n&#146;aura pas 
d&#146;autres choix que de se placer dans le Nachfeld de son gouverneur car il a le m&#234;me marquage 
communicatif (donc pas d&#146;&#233;mancipation) et qu&#146;il ne peut pas aller dans le Vorfeld (car il est 
l&#146;objet direct du verbe). Quant au d&#233;pendant sujet du verbe principal, il peut se placer dans le 
Vorfeld (lin&#233;arisation a.), ou dans le Nachfeld, avant le d&#233;pendant verbal (lin&#233;arisation c.) ou 
apr&#232;s le d&#233;pendant verbal (lin&#233;arisation a.). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La topologie comme interface entre syntaxe et prosodie 
</p>
<p>Si l&#146;arbre de d&#233;pendance a un autre marquage communicatif, par exemple, avec un sujet 
marqu&#233; comme focus, le verbe fini comme topique, et le na-verbe comme tail, alors les 
lin&#233;arisations obtenues ne sont pas les m&#234;mes. Dans le cas de notre exemple, une seule 
lin&#233;arisation est possible : 
</p>
<p> 
</p>
<p>La t&#234;te verbale qui a la valeur communicative de topique se place dans le TopF et ouvre un 
domaine. Cependant, ce domaine ne sera rempli que par le seul verbe car ses deux d&#233;pendants 
</p>
<p>Figure 2 : 1&#232;re correspondance syntaxe-topologie 
</p>
<p>Figure 3 : 2e correspondance syntaxe-topologie </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kim Gerdes et Hi-Yon Yoo 
</p>
<p>vont s&#146;&#233;manciper : le d&#233;pendant nominal qui est marqu&#233; comme focus s&#146;&#233;mancipe et se place 
dans le champs FocF tandis que le d&#233;pendant verbal  ouvre un domaine dans le tailF (car il est 
marqu&#233; communicativement comme tail) et son d&#233;pendant nominal qui est neutre se place 
dans le Nachfeld. Figure 3 illustre la structure topologique obtenue : 
</p>
<p>3 Interface Topologie-Prosodie 
</p>
<p>A l&#146;&#233;tape suivante de la production langagi&#232;re, se construit la structure phonologique. Nous 
consid&#233;rons que cette structure phonologique est un arbre &#224; trois niveaux, ces derniers &#233;tant 
n&#233;cessaires pour d&#233;terminer la majorit&#233; des &#233;nonc&#233;s (nous &#233;cartons dans ce travail les phrases 
dites &#171; spontan&#233;es &#187; ou impliquant la prise en compte d&#146;une &#233;motion) : 
</p>
<p>- le niveau du mot prosodique : il s&#146;agit de l&#146;unit&#233; prosodique minimale qui comporte 
obligatoirement un et un seul mot accentu&#233;4. Il contient l&#146;information lexicale, 
notamment la place de l&#146;accent de mot. Par ailleurs, ce niveau est important car c&#146;est 
autour de cet accent de mot que va se dessiner la courbe intonative. A ce niveau, nous 
retrouvons une transcription en phon&#232;mes. 
</p>
<p>- le niveau du groupe prosodique : le groupe prosodique contient plusieurs mots 
prosodiques. Pour beaucoup de chercheurs, ce niveau est d&#233;termin&#233; &#224; partir de r&#232;gles 
syntaxiques empiriques. Dans notre mod&#232;le, les groupes prosodiques co&#239;ncident avec 
un certain d&#233;coupage communicatif. Les patrons intonatifs sont associ&#233;s directement &#224; 
ces groupes prosodiques. 
</p>
<p>- le niveau de la phrase prosodique : ce niveau indique la courbe m&#233;lodique phrastique, 
d&#233;pendant de la modalit&#233; de la phrase (d&#233;clarative, interrogative etc.). Ainsi, pour les 
phrases d&#233;claratives que nous traitons ici, la courbe phrastique aura une allure 
descendante. La phrase prosodique regroupe une cha&#238;ne de groupes prosodiques. 
</p>
<p>Les r&#232;gles de correspondance entre les structures topologique et phonologique sont 
relativement simples, car il s&#146;agit d&#146;une simplification de l&#146;arbre de topologiques. La 
construction de l&#146;arbre phonologique &#224; partir de l&#146;arbre topologique proc&#232;de en deux &#233;tapes : 
</p>
<p>- Dans un premier temps, on applique les r&#232;gles des mots prosodiques aux feuilles de 
l&#146;arbre topologique. En fonction du domaine et du champ dans lequel se trouve la 
feuille ainsi que de l&#146;information lexicale sur l&#146;accentuabilit&#233; du mot, le mot va former 
ou non un nouveau mot prosodique. Dans le cas o&#249; le mot &#233;choue dans cette t&#226;che, la 
r&#232;gle indique si le mot est adjacent &#224; gauche ou &#224; droite (i.e. il rejoint le mot 
prosodique qui pr&#233;c&#232;de ou qui suit &#224; sa droite. Dans le cas grec, il s&#146;agit d&#146;une 
adjonction du mot &#224; sa droite, ce qui ne serait pas le cas pour une langue comme le 
cor&#233;en). L&#146;application de ces r&#232;gles permet de combiner tous les mots non accentu&#233;s 
avec un mot accentu&#233; et chaque mot, suivant la r&#232;gle qu&#146;un mot prosodique comporte 
une et une seule syllabe accentu&#233;e.  
</p>
<p>                                                 
4  On consid&#232;re qu&#146;un mot prosodique peut contenir plusieurs mots du moment qu&#146;il n&#146;y a qu&#146;un seul accent, 
</p>
<p>mais qu&#146;un mot ne peut s &#145;&#233;taler sur plusieurs mots prosodiques. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La topologie comme interface entre syntaxe et prosodie 
</p>
<p>- Dans un deuxi&#232;me temps, on applique les r&#232;gles de groupes prosodiques aux 
domaines de la structure topologique. Une r&#232;gle de type (D1, C1, F1, D2, C2, GP) 
exprime qu&#146;un groupe prosodique GP est construit par la contraction d&#146;un domaine D1 
(portant la valeur communicative C1) et du domaine D2 (portant la valeur 
communicative C2 et domin&#233; par D1 via le champ F). Tous les domaines qui ne sont 
pas contract&#233;s deviennent un groupe prosodique &#224; part enti&#232;re. 
</p>
<p>Notons que les r&#232;gles de groupes prosodiques ne permettent pas de cr&#233;er de nouveaux groupes 
prosodiques l&#224; o&#249; il n&#146;y a pas de domaines ; on suppose donc que deux feuilles qui sont s&#156;urs 
dans le m&#234;me domaine font toujours partie d&#146;un m&#234;me groupe prosodique. 
</p>
<p>3.1 La correspondance topologie-phonologie en grec 
</p>
<p>Les r&#232;gles des mots prosodiques du grec sont guid&#233;es par le lexique. Sachant qu&#146;en grec 
moderne pratiquement tous les mots sont accentu&#233;s, en principe sur l&#146;une des trois derni&#232;res 
syllabes du mot (sauf les articles, les conjonctions etc.), le mot prosodique comprend le mot 
accentu&#233; accompagn&#233;, s&#146;il y en a, des mots non accentu&#233;s. En fait, chaque mot qui se trouve 
dans un champ de type d&#233;terminant ou compl&#233;menteur est adjacent &#224; gauche, et se combine 
avec le mot ayant un accent lexical pour 
former un mot prosodique. Les r&#232;gles des 
groupes prosodiques vont forcer la 
contraction des domaines D1 et D2 qui 
portent la m&#234;me valeur communicative et o&#249; 
D1 domine directement D2 . Ainsi, pour la 
structure topologique dans la Figure 3, nous 
obtenons apr&#232;s application de ces r&#232;gles, la 
structure phonologique ci-contre.  
</p>
<p>4 La sortie sonore &#224; partir de la structure phonologique 
</p>
<p>La structure phonologique contient toutes les informations n&#233;cessaires pour la synth&#233;tisation 
de la phrase. Il nous reste &#224; appliquer l&#146;information sur le type de la phrase prosodique aux 
contours prosodiques de chaque groupe prosodique (cf. Le Gac &amp; Yoo 2000) ainsi que 
l&#146;organisation des contours prosodiques des mots prosodiques &#224; l&#146;int&#233;rieur de chaque groupe 
prosodique. Dans le pr&#233;sent &#233;tat de l&#146;impl&#233;mentation, ce que nous proposons est un mod&#232;le de 
synth&#232;se par mots (Vaissi&#232;re 1971) o&#249; les courbes m&#233;lodiques sont associ&#233;es aux mots 
prosodiques et des r&#232;gles permettant de d&#233;river la structure intonative de la phrase. Pour 
l&#146;instant, chaque mot prosodique est pr&#233;-enregistr&#233; et reliss&#233;s avec le contour correspondant 
(Yoo 2001), ce qui pour l&#146;instant donne trois fichiers sons par mot prosodique de nos phrases 
test&#233;es. DepLin combine les fichiers pour une sortie sonore. Les r&#233;sultats des fichiers sonores 
obtenus ont &#233;t&#233; test&#233;s aupr&#232;s de locuteurs natifs du grec. Les phrases synth&#233;tis&#233;es ont &#233;t&#233; 
jug&#233;es comme naturelles, et les auditeurs ont toujours r&#233;ussi &#224; identifier le contexte 
communicatif correspondant. 
</p>
<p>Phrase prosodique 
</p>
<p>GP-topique
</p>
<p>mp
</p>
<p>uposc&#154;qhke T
</p>
<p>GP-focus
</p>
<p>mp
</p>
<p>o Gi&#163;nnhjF
</p>
<p>GP-tail t 
</p>
<p>mp 
</p>
<p>na f&#163;ei t 
</p>
<p>mp
</p>
<p>to fro&#218;to N</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kim Gerdes et Hi-Yon Yoo 
</p>
<p>5 Conclusion 
</p>
<p>Les r&#233;sultats prometteurs obtenus avec nos grammaires et l&#146;impl&#233;mentation test montrent que 
l&#146;approche lin&#233;aire et modulaire comme le pr&#244;ne la TST n&#146;est pas seulement utile pour la 
correspondance du sens au texte &#233;crit, au centre de la recherche TST en particulier et TAL en 
g&#233;n&#233;ral, mais aussi pour l&#146;analyse des ph&#233;nom&#232;nes phon&#233;tiques, en particulier prosodiques. La 
notion classique de topologie permet une plus grande expressivit&#233; dans la lin&#233;arisation d&#146;une 
structure de d&#233;pendance et l&#146;&#233;tude des r&#232;gles topologiques pour diff&#233;rentes langues ouvrirait 
peut-&#234;tre d&#146;int&#233;ressants champs de recherche comparative. 
</p>
<p>Des travaux en cours portent sur la combinaison de courbes m&#233;lodiques abstraites avec des 
fichiers sons neutres, mais pour l&#146;instant nous sommes loin de la naturalit&#233; des fichiers 
pr&#233;enregistr&#233;s par mots prosodiques. Des travaux futures porteront sur l&#146;extension de la 
couverture de nos grammaire, mais aussi sur l&#146;int&#233;gration du rythme dans le mod&#232;le : la 
structure topologique semble aussi li&#233;e &#224; la structuration temporelle de la phrase. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>Br&#246;ker, N. 1998. &#171;Separating Surface Order and Syntactic Relations in a Dependency 
Grammar &#187;. Actes de COLING-ACL 98. 
Choi, H-W. 1999. Optimizing Structure in Context &#150; Scrambling and Information Structure, 
CSLI, Stanford. 
Duchier, D., R. Debusmann 2001. &#171; Topological Dependency Trees: A Constraint-based 
Account of Linear Precedence &#187;, dans Proceedings ACL 2001, Toulouse. 
Gerdes, K., S. Kahane 2001a. &#171; Word Order in German: A Formal Dependency Grammar 
Using a Topological Hierarchy &#187;, Actes d&#146;ACL 2001, Toulouse. 
Lambrecht, K. 1994. Information Structure and Sentence Form, Cambridge Studies in 
Linguistics 71, Cambridge University Press. 
Le Gac D. &amp; Yoo H. 2002. &quot;Intonative structure of focalization in French and Greek&quot;, in 
Beyssade &amp; al. (eds.), Romance languages and Linguistic Theory 2000, John Benjamins, 
Amsterdam 
Mel&#146;&#269;uk, I. 1988. Dependency Syntax. New-York, State University of New York Press. 
Mel&#146;&#269;uk, I. 2001. Communicative Organization in Natural Language (The Semantic-
Communicative Structure of Sentences). Amsterdam, Benjamins. 
Tesni&#232;re, L. 1959. El&#233;ments de syntaxe structurale, Kliencksieck, Paris. 
Vallduv&#237; , E. 1992. The Informational Component. New York, Garland. 
Vaissi&#232;re, J. 1971. Contribution &#224; la synth&#232;se par r&#232;gles du fran&#231;ais. Th&#232;se de 3&#232;me cycle, 
Universit&#233; des langues et lettres de Grenoble 
Wahlster, W. (ed.) 2000. VERBMOBIL &#150; Foundations of Speech-to-Speech Translation, 
Springer. 
Yoo H. 2001. &#171; Prosodie, organisation informationnelle et ordre des mots en grec moderne &#187;, 
</p>
<p>Actes de la journ&#233;e d&#146;&#233;tude Prosodie, Grenoble 
 </p>

</div></div>
</body></html>