<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Prototypage rapide et &#233;valuation de mod&#232;les de dialogue finalis&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Prototypage rapide et &#233;valuation de mod&#232;les de dialogue finalis&#233;s  
</p>
<p>Martin Rajman, Andr&#233;a Rajman, Florian Seydoux, Alex Trutnev 
</p>
<p>Laboratoire d&#8217;Intelligence Artificielle, E.P.F. Lausanne (Suisse) 
 {martin.rajman, florian.seydoux, alex.trutnev}@epfl.ch 
</p>
<p>R&#233;sum&#233; 
L&#8217;objectif de cette contribution est de pr&#233;senter l&#8217;int&#233;gration de la notion d&#8217;&#233;valuation dans la 
m&#233;thodologie de prototypage rapide de mod&#232;les de dialogue d&#233;velopp&#233;e et mise en &#339;uvre 
dans le cadre du projet InfoVox. L&#8217;id&#233;e centrale de cette m&#233;thodologie est de d&#233;river un  
mod&#232;le de dialogue op&#233;rationnel directement &#224; partir du mod&#232;le de la t&#226;che &#224; laquelle il est 
associ&#233;. L&#8217;int&#233;gration syst&#233;matique de diff&#233;rents aspects de l&#8217;&#233;valuation dans le processus de 
prototypage est alors utile afin d&#8217;identifier, d&#232;s la phase de conception, les qualit&#233;s et d&#233;fauts 
de l&#8217;interface. Toutes les conclusions pr&#233;sent&#233;es seront illustr&#233;es par des r&#233;sultats concrets 
obtenus au cours d&#8217;exp&#233;riences r&#233;alis&#233;es dans le cadre du projet InfoVox.  
</p>
<p>Mots Cl&#233;s 
Evaluation, Dialogue Homme-Machine, Prototypage Rapide, Wizard-of-Oz 
</p>
<p>1 Introduction  
Le projet InfoVox (Van Kommer et al., 2000) est une r&#233;alisation conjointe de l'EPFL, de 
l'IDIAP, et des soci&#233;t&#233;s Swisscom et Omedia. L'objectif de ce projet &#233;tait le d&#233;veloppement 
d'un prototype de serveur vocal permettant un acc&#232;s par t&#233;l&#233;phone &#224; des informations sur les 
restaurants de la ville de Martigny, Suisse (par exemple, (Jurafsky, 1994)). Le but principal du 
projet &#233;tait le d&#233;veloppement du prototype et son &#233;valuation au cours de 2 field-tests.  
Dans la section 2 sont d&#233;crites les principales &#233;tapes de la m&#233;thodologie de prototypage rapide 
propos&#233;e. La section 3 concerne l'&#233;valuation, et plus pr&#233;cis&#233;ment la description de 
l&#8217;int&#233;gration de ses diff&#233;rents aspects dans les &#233;tapes de conception correspondant aux field-
tests internes et externes, ainsi que les diff&#233;rents types d&#8217;analyses employ&#233;s pour &#233;valuer 
l' &#171;utilisabilit&#233;&#187; du syst&#232;me.  
</p>
<p>2 Prototypage rapide de mod&#232;les de dialogue finalis&#233;s 
L'un des buts principaux du projet InfoVox &#233;tait la sp&#233;cification et la validation d'une 
m&#233;thodologie de prototypage de mod&#232;les de dialogue (MD) pouvant &#234;tre d&#233;ploy&#233;e dans un 
contexte applicatif pour la conception rapide de MD &#224; &#233;tats finis finalis&#233;s (Cole et al., 1993). 
Par &#171;conception rapide&#187;, on entend qu&#8217;une premi&#232;re version utilisable de MD devrait pouvoir 
&#234;tre produite en quelques heures ; par &#171;mod&#232;les de dialogue finalis&#233;s&#187;, nous entendons des 
mod&#232;les cibl&#233;s, strictement sp&#233;cifiques &#224; une t&#226;che donn&#233;e. L'id&#233;e sous-jacente &#224; la </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M. Rajman, A. Rajman, F. Seydoux, A. Trutnev 
</p>
<p>m&#233;thodologie propos&#233;e est que le MD vis&#233; est un mod&#232;le &#224; &#233;tats finis pouvant &#234;tre d&#233;riv&#233; de 
mani&#232;re relativement syst&#233;matique &#224; partir de la mod&#233;lisation de la t&#226;che &#224; effectuer.  
</p>
<p>2.1 Production du mod&#232;le de t&#226;che  
</p>
<p>L'approche propos&#233;e consiste &#224; mod&#233;liser la t&#226;che sous la forme d'une table relationnelle  
(formulaire) dont les champs repr&#233;sentent les diff&#233;rents attributs devant &#234;tre inform&#233;s pour 
que la t&#226;che puisse &#234;tre accomplie (Denecke, 1997). En d'autres termes, la t&#226;che est mod&#233;lis&#233;e 
comme une fonction dont les arguments correspondent aux attributs et dont l'appel r&#233;sulte en 
l&#8217;accomplissement de la t&#226;che. Par exemple, dans le projet InfoVox, le mod&#232;le de t&#226;che (MT) 
est r&#233;duit &#224; la fonction choisirRestaurant( typeCuisine, localisation, ...), dont les attributs 
identifient les diff&#233;rents crit&#232;res de s&#233;lection disponibles pour la recherche de restaurant.  
La m&#233;thodologie actuelle identifie deux classes de t&#226;ches &#233;l&#233;mentaires pouvant &#234;tre trait&#233;es : 
les t&#226;ches de recherche  d'information et les t&#226;ches de commande. Dans le premier cas, 
l'objectif principal est de s&#233;lectionner les &#233;l&#233;ments correspondant &#224; des crit&#232;res de recherche, 
sur la base d&#8217;attributs pr&#233;d&#233;finis pour un ensemble de candidats stock&#233;s dans une base de 
donn&#233;es. Pour les t&#226;ches de commande, l'objectif est le contr&#244;le d'une fonction sp&#233;cifique.  
Il est &#233;vident que ces deux types de t&#226;ches &#233;l&#233;mentaires ne permettent pas, &#224; eux seuls, 
d&#8217;apporter une puissance descriptive suffisante pour mod&#233;liser la plupart des applications 
r&#233;elles. Deux m&#233;canismes de composition permettant de construire des mod&#232;les plus 
complexes sont propos&#233;s : la disjonction et l'imbrication. La disjonction correspond 
simplement au regroupement (disjonctif) de plusieurs t&#226;ches &#233;l&#233;mentaires dans un MT unique. 
L&#8217;imbrication de t&#226;ches survient lorsque les valeurs de certains attributs, identifi&#233;s dans le 
mod&#232;le produit pour une t&#226;che donn&#233;e, correspondent eux-m&#234;mes au r&#233;sultat de l'appel &#224; une 
fonction n&#233;cessitant un dialogue.  
Une fois le MT produit, il servira de base pour la g&#233;n&#233;ration automatique d&#8217;un MD initial, 
correspondant &#224; une interface vocale permettant &#224; l'utilisateur de sp&#233;cifier les valeurs 
n&#233;cessaires pour accomplir la t&#226;che.  
</p>
<p>2.2 D&#233;rivation du mod&#232;le initial de dialogue 
</p>
<p>Le MD est d&#233;fini comme un ensemble de n&#339;uds de dialogue g&#233;n&#233;riques (GDN) 
interconnect&#233;s (Bilange, 1992), chacun de ces n&#339;uds &#233;tant associ&#233; &#224; l'un des attributs pr&#233;sents 
dans le MT. Pour un champ donn&#233;, le r&#244;le du GDN associ&#233; est d'ex&#233;cuter une interaction 
simple avec l'utilisateur, avec comme but l&#8217;acquisition d&#8217;une valeur acceptable pour l'attribut 
en question. D&#8217;une fa&#231;on g&#233;n&#233;rale, un GDN est caract&#233;ris&#233; (1) par un message/question &#224; 
poser &#224; l&#8217;utilisateur pour obtenir une valeur pour l&#8217;attribut associ&#233; ; (2) une grammaire 
permettant de passer des expressions utilis&#233;es par les utilisateurs aux valeurs 
canoniques utilis&#233;es dans le syst&#232;me ; et (3) une &#171;action&#187; conditionnant la gestion du flot du 
dialogue. Par ailleurs, dans chaque GDN, sont incorpor&#233;s des m&#233;canismes g&#233;n&#233;riques 
permettant de g&#233;rer des situations probl&#233;matiques pouvant survenir au cours du dialogue.  
La gestion des GDNs se fait dans un module sp&#233;cifique, l&#8217; &#171;interpr&#233;teur de dialogues&#187;. 
D'autres &#233;l&#233;ments sont cependant n&#233;cessaires : en plus de la d&#233;finition des GDNs et la 
sp&#233;cification de l'interpr&#233;teur de dialogue, une logique de branchement, responsable du 
contr&#244;le du dialogue, doit &#234;tre d&#233;finie. Dans notre approche, cette logique de branchement a 
tout d&#8217;abord &#233;t&#233; impl&#233;ment&#233;e sous la forme d&#8217;un ensemble de conditions de transitions entre 
les GDNs, et est actuellement reformul&#233;e sous la forme d&#8217;un m&#233;canisme g&#233;n&#233;rique op&#233;rant 
sur l&#8217;ensemble des configurations possibles (e.g., les solutions candidates dans le cas d&#8217;une </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Prototypage rapide et &#233;valuation de mod&#232;les de dialogue finalis&#233;s  
 
</p>
<p>recherche d&#8217;information ou les actions possibles dans le cas d&#8217;un appel de commande) 
correspondant aux valeurs courantes des attributs du mod&#232;le.  
Dans le cadre de l'architecture propos&#233;e, le MT est utilis&#233; pour g&#233;n&#233;rer un MD d&#8217;initialisation, 
c&#8217;est-&#224;-dire un MD dans lequel les GDNs sont instanci&#233;s avec des &#233;nonc&#233;s simples, g&#233;n&#233;r&#233;s 
automatiquement, sans grammaire d&#8217;interpr&#233;tation, et sans actions sp&#233;cifiques associ&#233;es.  
Le mod&#232;le minimaliste ainsi produit n&#8217;est donc pas directement utilisable. Son &#171;instanciation&#187; 
requiert une intervention humaine, qui peut &#234;tre r&#233;alis&#233;e dans le cadre d&#8217;une exp&#233;rience de 
type Wizard-of-Oz, telle que d&#233;crite dans la section suivante.  
</p>
<p>2.3 Instanciation du mod&#232;le initial : exp&#233;rience Wizard-of-Oz  
</p>
<p>Dans le cadre sp&#233;cifique du projet InfoVox, les objectifs de l'exp&#233;rience Wizard-of-Oz (WoZ) 
&#233;taient : (1) de permettre une premi&#232;re &#233;valuation subjective du MD initial ; (2) d'acqu&#233;rir des 
donn&#233;es utiles pour l'entra&#238;nement du reconnaisseur de parole (STRUT) utilis&#233; dans le projet.  
L'exp&#233;rience WoZ du projet InfoVox a dur&#233; 38 jours ; 99 personnes y ont particip&#233;, permettant 
d&#8217;enregistrer 255 dialogues. L'exp&#233;rience a men&#233; &#224; une premi&#232;re version totalement 
op&#233;rationnelle du MD, qui a ensuite subi les &#233;valuations d&#233;crites dans les sections suivantes.  
</p>
<p>3 Evaluation du syst&#232;me : field-tests interne et externe  
L'un des objectifs importants du projet InfoVox &#233;tait de proposer une m&#233;thodologie 
d'&#233;valuation qui permette d'identifier et de mettre en &#233;vidence, d&#232;s l'&#233;tape de prototypage, les 
qualit&#233;s et les d&#233;fauts du syst&#232;me, ceci du point de vue des utilisateurs (Walker et al., 2000) .  
Concr&#232;tement, il a &#233;t&#233; d&#233;cid&#233; d'effectuer l'&#233;valuation sous la forme d'un questionnaire de 
satisfaction (QS), soumis &#224; chacun des membres d'un groupe d'utilisateurs potentiels, apr&#232;s 
son interaction avec le prototype. Plus pr&#233;cis&#233;ment, pour chacun des utilisateurs contact&#233;s, la 
proc&#233;dure d'&#233;valuation a &#233;t&#233; d&#233;compos&#233;e en les 4 &#233;tapes suivantes : (1) une courte description 
du projet et de la proc&#233;dure d'&#233;valuation est lue &#224; l'utilisateur ; (2) l'utilisateur est mis dans un 
contexte d'application pr&#233;cis ; dans ce but, un sc&#233;nario est choisi parmi quelque 20 sc&#233;narios, 
d&#233;finis de fa&#231;on &#224; couvrir diff&#233;rentes combinaisons des attributs d&#233;crivant les restaurants, et lu 
&#224; l'utilisateur ; (3) l'utilisateur est mis en communication avec le syst&#232;me par le biais d'une 
t&#233;l&#233;conf&#233;rence ; et (4), une fois l'interaction entre l'utilisateur et le syst&#232;me termin&#233;e, 
l'utilisateur est pri&#233; de r&#233;pondre &#224; un QS. Ce QS contenait quelque 40 questions segment&#233;es 
en 4 cat&#233;gories : (1) les questions directement li&#233;es &#224; la satisfaction globale des utilisateurs ; 
(2) les questions relatives &#224; l' &#171;utilisabilit&#233;&#187; du syst&#232;me, i.e. le confort et la convivialit&#233; de 
l'interaction ; (3) les questions relatives &#224; l'efficacit&#233; du syst&#232;me, i.e. la qualit&#233; et la pertinence 
des r&#233;sultats produits ; et (4) les questions relatives &#224; l'&#233;valuation comparative du syst&#232;me.  
</p>
<p>3.1 Field-test interne 
</p>
<p>Le field-test interne a &#233;t&#233; effectu&#233; sur 2 jours et a impliqu&#233; un nombre limit&#233; de 20 utilisateurs 
&#171;internes&#187;, typiquement les concepteurs du syst&#232;me, d'autres membres des laboratoires 
impliqu&#233;s, etc. La plupart des utilisateurs connaissaient donc le prototype. En plus des 
r&#233;ponses des utilisateurs au QS (donn&#233;es subjectives), le d&#233;roulement du dialogue ainsi que 
l&#8217;&#233;tat interne du syst&#232;me ont &#233;t&#233; enregistr&#233;s tout au long de l'interaction, dans le but de 
produire des indicateurs objectifs. Enfin, les interactions de l&#8217;utilisateur avec le syst&#232;me ont 
&#233;t&#233; &#233;galement enregistr&#233;es et manuellement retranscrites. 
Concernant les r&#233;sultats, il est important de noter que l'objectif principal du field-test interne 
&#233;tait essentiellement la validation du prototype et de la proc&#233;dure d'&#233;valuation, plut&#244;t que la </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M. Rajman, A. Rajman, F. Seydoux, A. Trutnev 
</p>
<p>production de v&#233;ritables r&#233;sultats d'&#233;valuation. De ce fait, le r&#233;sultat du field-test interne a &#233;t&#233; 
la production d'un MD am&#233;lior&#233; et la d&#233;finition rigoureuse de la proc&#233;dure d'&#233;valuation. Ces 
deux &#233;l&#233;ments ont ensuite &#233;t&#233; fig&#233;s et utilis&#233;s sans modifications dans le field-test externe. 
</p>
<p>3.2 Field-test externe 
</p>
<p>L'objectif principal du field-test externe &#233;tait d'effecteur l'&#233;valuation de la version du syst&#232;me 
r&#233;sultant du field-test interne, au moyen de la proc&#233;dure d&#8217;&#233;valuation expos&#233;e pr&#233;c&#233;demment. 
Dans ce but, une population d&#8217;utilisateurs &#171;externes&#187;, i.e. n'ayant aucune connaissance du 
syst&#232;me, a &#233;t&#233; s&#233;lectionn&#233;e de fa&#231;on al&#233;atoire, sur la base de l'annuaire t&#233;l&#233;phonique 
&#233;lectronique TelInfo de SwissCom. Le field-test a dur&#233; 6 semaines, impliquant 50 utilisateurs 
(seuls les particuliers poss&#233;dant le t&#233;l&#233;phone fixe ont &#233;t&#233; contact&#233;s). 
Les donn&#233;es subjectives et objectives brutes produites pendant le field-test externe ont servi de 
base pour l'&#233;valuation et l&#8217;analyse du syst&#232;me. Comme indiqu&#233; pr&#233;c&#233;demment, les donn&#233;es 
brutes disponibles pour l'analyse &#224; la fin du field-test consistaient en : (1) les transcriptions des 
interactions entre les utilisateurs et le prototype ; (2) les logs produits automatiquement 
pendant les interactions ; et (3) les r&#233;ponses aux questions soumises aux utilisateurs. 
</p>
<p>3.3 Exploitation des donn&#233;es du field-test externe  
</p>
<p>Plusieurs indicateurs subjectifs et objectifs ont &#233;t&#233; d&#233;riv&#233;s &#224; partir des donn&#233;es brutes. Les 
indicateurs subjectifs correspondent essentiellement aux scores moyens obtenus pour les 
diverses questions ferm&#233;es pr&#233;sentes dans le QS, tandis que les indicateurs objectifs ont &#233;t&#233; 
d&#233;riv&#233;s &#224; partir des logs et correspondaient donc aux valeurs moyennes de diff&#233;rentes 
caract&#233;ristiques du syst&#232;me d&#233;crivant l'interaction avec chacun des utilisateurs.  
En ce qui concerne l'exploitation des indicateurs produits, 3 types d'analyses ont &#233;t&#233; 
effectu&#233;s : (1) analyse r&#233;trospective des tendances pr&#233;dominantes  correspondant &#224; 
l'identification, pour les questions ferm&#233;es, des modalit&#233;s significativement pr&#233;dominantes ; 
les modalit&#233;s pr&#233;dominantes ainsi identifi&#233;es peuvent ensuite &#234;tre utilis&#233;es pour produire, de 
fa&#231;on r&#233;trospective, une vue synth&#233;tique des opinions des utilisateurs sur leur interaction avec 
le syst&#232;me ; (2) analyse r&#233;trospective des corr&#233;lations correspondant &#224; l'identification de 
corr&#233;lations significatives entre les r&#233;ponses &#224; des paires de questions ferm&#233;es ; (3) analyse 
prospective des corr&#233;lations correspondant &#224; l'identification de corr&#233;lations significatives entre 
les r&#233;ponses des utilisateurs &#224; certaines questions ferm&#233;es et certains indicateurs objectifs ; ce 
type d&#8217;analyse permet d'identifier les d&#233;pendances entre les caract&#233;ristiques objectives du 
syst&#232;me et les perceptions subjectives qu'en ont les utilisateurs. Les d&#233;pendances ainsi 
identifi&#233;es peuvent &#234;tre utilis&#233;es pour aider &#224; l'identification de modifications &#171;prometteuses&#187; 
du prototype pouvant conduire &#224; une meilleure satisfaction des utilisateurs. 
</p>
<p>3.3.1 Indicateurs subjectifs et analyse r&#233;trospective des tendances pr&#233;dominantes 
</p>
<p>&#201;tant d&#233;riv&#233;s des questions ferm&#233;es, les indicateurs sont organis&#233;s de fa&#231;on naturelle selon la 
m&#234;me structure que celle d&#233;finie pour le questionnaire. 
Ainsi, parmi les indicateurs subjectifs produits, certains concernaient l'&#233;valuation de la 
satisfaction globale des utilisateurs, soit directement quantifi&#233;e par les utilisateurs eux-m&#234;mes, 
soit indirectement par le biais de r&#233;ponses &#224; des questions comme &#171;Si le syst&#232;me &#233;tait 
disponible, seriez-vous pr&#234;t &#224; l'utiliser ?&#187;. D'autres indicateurs concernaient l'&#171;utilisabilit&#233;&#187; et 
portaient donc sur la caract&#233;risation de la qualit&#233; de diff&#233;rentes caract&#233;ristiques du syst&#232;me 
(questions ferm&#233;es comme &#171;Diriez-vous que le syst&#232;me est difficile/facile &#224; utiliser ?&#187;) ou de 
l'interaction elle-m&#234;me. L'efficacit&#233; (i.e. la qualit&#233;/coh&#233;rence des r&#233;sultats produits) &#233;tait </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Prototypage rapide et &#233;valuation de mod&#232;les de dialogue finalis&#233;s  
 
</p>
<p>couverte par des indicateurs (scores moyens) d&#233;riv&#233;s de questions oui/non comme &#171;Est-ce que 
le syst&#232;me vous a renseign&#233; correctement ?&#187;. Enfin, les indicateurs relatifs &#224; la comparaison 
du syst&#232;me avec des sources d'information alternatives ont &#233;galement &#233;t&#233; d&#233;riv&#233;s. 
La m&#233;thode adopt&#233;e dans le projet InfoVox pour l'analyse r&#233;trospective des tendances &#233;tait la 
suivante : pour toutes les questions ferm&#233;es, on identifiait les modalit&#233;s pour lesquelles la 
borne inf&#233;rieure de l'intervalle de confiance &#224; 95% de certitude &#233;tait sup&#233;rieure &#224; la borne 
sup&#233;rieure du m&#234;me intervalle de confiance pour toutes les autres modalit&#233;s. Les modalit&#233;s 
pr&#233;dominantes identifi&#233;es &#233;taient ensuite fournies aux concepteurs pour interpr&#233;tation. 
Concr&#232;tement, l'exploitation des r&#233;sultats obtenus lors du field-test externe a produit 
l'&#233;valuation synth&#233;tique suivante : le taux global de satisfaction &#233;tait de 63.75% ; 85.4% des 
utilisateurs &#233;taient pr&#234;ts &#224; utiliser le syst&#232;me s'il &#233;tait disponible et 76% serait m&#234;me pr&#234;t &#224; le 
conseiller &#224; ses proches, amis ou coll&#232;gues. Le syst&#232;me s'est av&#233;r&#233; facile &#224; utiliser (89.8%) et 
assez bien adapt&#233; pour une recherche de restaurants (79.2%). Cependant, ses capacit&#233;s 
d'interaction restent essentiellement comparables &#224; celles d'une machine (74.4%). Le syst&#232;me 
fournissait une information plut&#244;t correcte (63.3%), mais les utilisateurs l'auraient voulue plus 
riche. 84.0% des utilisateurs consid&#233;raient le syst&#232;me au moins aussi efficace que les divers 
syst&#232;mes &#224; base de touches de fr&#233;quences qu'ils connaissaient. Les messages du syst&#232;me 
&#233;taient faciles &#224; comprendre (94.4%), la dur&#233;e des interactions &#233;tait ad&#233;quate (72.9%) et le 
syst&#232;me a rarement (30%) fait quelque chose consid&#233;r&#233; par les utilisateurs comme &#233;trange ou 
inutile. Cependant, la strat&#233;gie adopt&#233;e dans le mod&#232;le de dialogue aboutissait souvent &#224; la 
r&#233;p&#233;tition des messages (82%), m&#234;me si la s&#233;quence des questions pos&#233;es &#233;tait consid&#233;r&#233;e 
comme naturelle (93.9%). Les utilisateurs &#233;taient le plus souvent d&#233;tendus pendant 
l'interaction (84.8%), ils &#233;taient rarement perdus (14%), mais assez souvent (48%) ils ont d&#251; 
s'adapter au syst&#232;me et souvent (74%) ils avaient l'impression que le syst&#232;me ne comprenait 
pas certaines de leurs r&#233;ponses. 79.2% des utilisateurs &#233;taient sensibles aux messages de 
confirmation et consid&#233;raient ces confirmations tr&#232;s utiles (96.8%). Enfin, les opinions sont 
rest&#233;es tr&#232;s partag&#233;es en ce qui concerne l'initiative durant le dialogue (l'utilisateur ou le 
syst&#232;me). 
</p>
<p>3.3.2 Analyse r&#233;trospective des corr&#233;lations 
</p>
<p>Plusieurs r&#233;sultats int&#233;ressants ont &#233;t&#233; produits par l'analyse r&#233;trospective des corr&#233;lations. 
Tout d'abord, l'analyse a montr&#233; que le seul identificateur subjectif corr&#233;l&#233; avec la satisfaction 
des utilisateurs &#233;tait celui relatif &#224; la qualit&#233; des r&#233;sultats produits par le syst&#232;me ; plus 
pr&#233;cis&#233;ment, les utilisateurs ayant consid&#233;r&#233; que le syst&#232;me ne fournissait pas des r&#233;sultats 
corrects avaient une tendance significative &#224; consid&#233;rer le syst&#232;me comme non satisfaisant.  
Le deuxi&#232;me r&#233;sultat int&#233;ressant a &#233;t&#233; que, contrairement &#224; ce qui a &#233;t&#233; postul&#233; dans la section 
pr&#233;c&#233;dente, il n'y a pas eu de corr&#233;lation significative entre la satisfaction des utilisateurs et les 
indicateurs subjectifs relatifs au fait que les utilisateurs &#233;taient ou non pr&#234;ts &#224; utiliser le 
syst&#232;me ou &#224; le recommander &#224; des tiers. En d'autres termes, cela signifie que, dans le cas du 
projet InfoVox, le fait que l'utilisateur soit pr&#234;t &#224; utiliser le syst&#232;me ne garantie pas une bonne 
satisfaction de sa part. Ce r&#233;sultat ne nous semblait pas du tout &#233;vident &#224; pr&#233;dire ! 
</p>
<p>3.3.3 Analyse prospective des corr&#233;lations 
</p>
<p>L'objectif de cette analyse &#233;tait d'identifier les d&#233;pendances significatives entre les indicateurs 
objectifs et certains indicateurs subjectifs. L'avantage principal de l'identification de telles 
d&#233;pendances est qu'elles permettent de choisir de fa&#231;on plus pr&#233;cise les caract&#233;ristiques du 
syst&#232;me qui doivent &#234;tre am&#233;lior&#233;es en priorit&#233; afin d'augmenter les chances d'atteindre une 
meilleure satisfaction des utilisateurs.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M. Rajman, A. Rajman, F. Seydoux, A. Trutnev 
</p>
<p>Par exemple, si l'objectif est effectivement d'am&#233;liorer la satisfaction des utilisateurs, les 
conclusions sont d'essayer d'am&#233;liorer la perception par les utilisateurs de la qualit&#233; des 
r&#233;sultats produits par le syst&#232;me. En cons&#233;quence, il peut &#234;tre int&#233;ressant de savoir quels sont 
les indicateurs objectifs en corr&#233;lation avec ce type de perception.  
Pour quantifier la force de la d&#233;pendance entre un indicateur subjectif et un indicateur 
objectif, la technique statistique utilis&#233;e consistait &#224; tester la diff&#233;rence entre les moyennes du 
crit&#232;re objectif obtenues pour chacune des modalit&#233;s du crit&#232;re subjectif consid&#233;r&#233;.  
Appliqu&#233;e &#224; l'indicateur subjectif &#171;qualit&#233; des r&#233;sultats&#187;, cette analyse a fait ressortir une 
corr&#233;lation entre les opinions positives pour cet indicateur et la pr&#233;sence d'une fraction plus 
&#233;lev&#233;e (35% v.s. 14% dans le cas d'une perception n&#233;gative de la qualit&#233; des r&#233;sultats) 
d&#8217;&#233;nonc&#233;s du syst&#232;me durant la phase du dialogue o&#249; le syst&#232;me cherche &#224; acqu&#233;rir 
l'information n&#233;cessaire pour fournir une suggestion de restaurant (la phase d'acquisition des 
contraintes). Ce r&#233;sultat peut &#234;tre interpr&#233;t&#233; de la mani&#232;re suivante : du fait que les messages 
du syst&#232;me qui ne sont pas de  simples questions correspondent &#224; des r&#233;actions &#224; des 
situations probl&#233;matiques lors du dialogue (i.e. des r&#233;ponses &#224; des demandes d'aide, etc.), un 
ratio &#233;lev&#233; de &#171;simples questions&#187; pendant la phase d'acquisition de contraintes signifie que 
l'interaction se passe bien.  
</p>
<p>4 Conclusions 
Dans la premi&#232;re partie de cette contribution, nous avons pr&#233;sent&#233; une m&#233;thodologie de 
prototypage rapide de mod&#232;les de dialogue permettant la production efficace de mod&#232;les de 
dialogues &#224; &#233;tats finis, simples et finalis&#233;s. La seconde partie de la contribution a &#233;t&#233; 
consacr&#233;e &#224; la description des m&#233;canismes d'instanciation et d'affinement des mod&#232;les de 
dialogue initiaux, en particulier par le biais d'exp&#233;rience WoZ, ainsi qu'&#224; la description de la 
proc&#233;dure d'&#233;valuation associ&#233;e retenue. La m&#233;thodologie a &#233;t&#233; illustr&#233;e dans le cadre concret 
de la production du mod&#232;le de dialogue du serveur vocal d'information r&#233;alis&#233; dans cadre du 
projet InfoVox et proposant des informations sur les restaurants de la ville de Martigny Suisse.  
</p>
<p>R&#233;f&#233;rences 
Bilange E. (1992), Dialogue personne-machine, mod&#233;lisation et r&#233;alisation informatique, 
Langue, Raisonnement, Calcul, Herm&#232;s, Paris. 
</p>
<p>Cole R., Novick D. G., Fanty M., Sutton S., Hansen B., Burnett D. (1993), Rapid prototyping 
of spoken language systems: The year 2000 census project, Proceedings of the International 
Symposium on Spoken Dialogue, Tokyo, Japan. 
Denecke, M. (1997), An Information-based Approach for Guiding Multi-Modal Human-
Computer-Interaction, in Proc. of IJCAI (2), 1036-1041.  
Jurafsky D. (1994), The Berkeley Restaurant Project, in Intl. Conference on Spoken Language 
Processing. 
Van Kommer R., Rajman M., Bourlard H., (2000), Heading Towards Virtual-Commerce 
Portals, Comtec, 9:10-13. 
Walker M. A., Kamm C., Litman D., Towards Developing General Models of Usability with 
PARADISE, Natural Language Engineering Special Issue on Best Practice in Spoken 
Dialogue Systems. </p>

</div></div>
</body></html>