<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Cartographie lexicale pour la recherche d&#146;'information</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Cartographie lexicale pour la recherche d&#146;information 
</p>
<p>Jean V&#233;ronis 
</p>
<p>Equipe DELIC - Universit&#233; de Provence 
29, Av. Robert Schuman - 13621 Aix-en-Provence Cedex 1 
</p>
<p>Jean.Veronis@up.univ-mrs.fr 
</p>
<p>R&#233;sum&#233; &#150; Abstract 
</p>
<p>Nous d&#233;crivons un algorithme, HyperLex, de d&#233;termination automatique des diff&#233;rents usages 
d&#146;un mot dans une base textuelle sans utilisation d&#146;un dictionnaire. Cet algorithme bas&#233; sur la 
d&#233;tection des composantes de forte densit&#233; du graphe des cooccurrences de mots permet, 
contrairement aux m&#233;thodes pr&#233;c&#233;demment propos&#233;es (vecteurs de mots), d&#146;isoler des usages 
tr&#232;s peu fr&#233;quents. Il est associ&#233; &#224; une technique de repr&#233;sentation graphique permettant &#224; 
l&#146;utilisateur de naviguer de fa&#231;on visuelle &#224; travers le lexique et d&#146;explorer les diff&#233;rentes 
th&#233;matiques correspondant aux usages discrimin&#233;s.  
</p>
<p>We describe the HyperLex algorithm for automatic discrimination of word uses in a textual 
database. The algorithm does not require a dictionary. It detects high density components in 
the word-cooccurrence graph, and, contrary to previous methods (word vectors), enables the 
recognition of very low frequency uses. HyperLex is associated with a graphic representation 
technique that makes it possible to navigate through the lexicon and explore visually the 
various themes corresponding to the discriminated uses. 
</p>
<p>Keywords &#150; Mots Cl&#233;s 
</p>
<p>D&#233;sambigu&#239;sation lexicale, recherche d&#146;information, interfaces graphiques 
Lexical disambiguation, information retrieval, graphic interfaces 
</p>
<p>1 Introduction 
</p>
<p>La recherche d&#146;information par mot-cl&#233;s sur le Web, et dans les grandes bases textuelles en 
g&#233;n&#233;ral, se heurte au probl&#232;me de la multiplicit&#233; des usages de la plupart des mots. 
L&#146;homographie et la polys&#233;mie omnipr&#233;sentes dans les langues introduisent un bruit 
consid&#233;rable dans les r&#233;sultats : ainsi, une recherche sur le mot barrage verra retourner, au 
gr&#233; des fr&#233;quences globales et des heuristiques de classement des moteurs de recherche, des 
r&#233;sultats concernant les barrages hydrauliques, les barrages routiers, les matchs de barrage. 
Extraire les r&#233;sultats concernant les usages les moins fr&#233;quents peut s&#146;av&#233;rer particuli&#232;rement 
d&#233;licat. Bien s&#251;r l&#146;utilisateur peut g&#233;n&#233;ralement compliquer sa requ&#234;te en croisant des mots-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean VERONIS 
</p>
<p>cl&#233;s, mais outre que cette technique n&#146;est pas forc&#233;ment bien ma&#238;tris&#233;e du (tr&#232;s) grand public, 
elle n&#146;est pas toujours tr&#232;s praticable : il ne suffit pas de croiser le mot barrage avec le mot 
match pour obtenir les pages concernant les matchs de barrage : de nombreuses pages traitent 
du th&#232;me sans pour autant contenir le mot match. Il faudrait alors &#233;num&#233;rer les possibilit&#233;s 
lexicales et formuler une requ&#234;te du type barrage ET (jouer OU jeu OU football OU basket 
OU basket-ball OU...), ce qui est peu &#233;conomique (et peu s&#251;r). Par ailleurs, sans que le 
ph&#233;nom&#232;ne rel&#232;ve probablement de ce que les lexicographes appelleraient polys&#233;mie, un mot 
peut &#234;tre impliqu&#233; dans des th&#232;mes distincts, qu&#146;il est important de distinguer pour 
l&#146;utilisateur. Ainsi, bien qu&#146;il s&#146;agisse toujours de barrages sur des routes, il est peu probable 
que la m&#234;me requ&#234;te cherche &#224; retourner p&#234;le-m&#234;le des pages parlant de barrages 
revendicatifs de camions, ou de barrages d&#146;hommes en armes &#224; des fronti&#232;res ou des zones en 
conflit. 
</p>
<p>Les dictionnaires classiques sont peu adapt&#233;s &#224; la t&#226;che. Ils contiennent la plupart du temps 
des d&#233;finitions d&#146;une trop grande g&#233;n&#233;ralit&#233; (&#171; action de barrer &#187;, par exemple), et rien ne 
garantit qu&#146;elles refl&#232;tent le contenu exact du corpus textuel interrog&#233;. Nous avons montr&#233; de 
fa&#231;on exp&#233;rimentale la difficult&#233; pour des linguistes de faire correspondre correctement les 
&#171; sens &#187; d&#146;un dictionnaire et les occurrences d&#146;un corpus (V&#233;ronis, 1998). De plus, il resterait 
&#224; cat&#233;goriser automatiquement les documents de la base de textes en fonction des &#171; sens &#187; du 
dictionnaire, t&#226;che d&#146;une difficult&#233; extr&#234;me, qui &#233;lude les efforts soutenus de la recherche 
depuis un demi-si&#232;cle (cf. [Ide, V&#233;ronis, 1998] pour un &#233;tat de l&#146;art d&#233;taill&#233;). 
</p>
<p>Sch&#252;tze (1998) a propos&#233; une m&#233;thode permettant d&#146;extraire automatiquement la liste des 
&#171; sens &#187; (nous pr&#233;f&#233;rons parler d&#146;&#171; usages &#187;) du corpus lui-m&#234;me, tout en fournissant une 
technique robuste de cat&#233;gorisation. Ces usages correspondent &#224; des groupes (clusters) de 
contextes similaires dans un espace de tr&#232;s grande dimensionnalit&#233; form&#233; par des vecteurs de 
mots ou de cooccurrences proches du mot &#224; d&#233;sambigu&#239;ser, espace rendu utilisable par une 
technique de d&#233;composition en valeurs singuli&#232;res classique. Les techniques bas&#233;es sur les 
vecteurs de mots se heurtent toutefois &#224; une difficult&#233; majeure et r&#233;dhibitoire : la tr&#232;s grande 
diff&#233;rence de fr&#233;quence entre usages d&#146;un m&#234;me mot (d&#233;j&#224; constat&#233;e par Zipf, 1945) repousse 
la plupart des distinctions utiles en-dessous du seuil de bruit du mod&#232;le. Ainsi, selon nos 
estimations, l&#146;usage &#171; match de barrage &#187; concerne moins de 1% des documents contenant le 
mot barrage. 
</p>
<p>Nous proposons dans cette communication un algorithme radicalement diff&#233;rent, bas&#233; sur les 
propri&#233;t&#233; des graphes constitu&#233;s par les cooccurrences de mots. Cet algorithme, HyperLex, 
permet d&#146;extraire des composantes de forte densit&#233; qui refl&#232;tent les diff&#233;rents usages des 
mots. Contrairement aux m&#233;thodes vectorielles, l&#146;algorithme HyperLex est peu sensible &#224; la 
fr&#233;quence relative et au nombre des diff&#233;rents usages &#224; discriminer. De plus, il est associ&#233; &#224; 
une technique de repr&#233;sentation graphique permettant &#224; l&#146;utilisateur de naviguer de fa&#231;on 
visuelle &#224; travers le lexique et d&#146;explorer les diff&#233;rentes th&#233;matiques correspondant aux 
usages discrimin&#233;s. Nous illustrons HyperLex sur des exemples tir&#233;s du Web, mais rien 
n&#146;emp&#234;che d&#146;appliquer la m&#234;me technique &#224; n&#146;importe quelle grande base textuelle. 
</p>
<p>2 M&#233;thode et hypoth&#232;ses 
</p>
<p>Nous partons du m&#234;me constat que Sh&#252;tze (1998) et d&#146;autres, selon lequel les cooccurrences 
constituent de forts indices d&#233;sambigu&#239;sateurs pour distinguer les diff&#233;rents usages des mots. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cartographie lexicale pour la recherche d&#146;informations 
</p>
<p>Ainsi, en pr&#233;sence du mot fleuve, le mot  barrage renverra presque obligatoirement &#224; l&#146;usage 
&#171; barrage hydraulique &#187;, alors qu&#146;en pr&#233;sence du mot football, il renverra tr&#232;s probablement &#224; 
&#171; match de barrage &#187;. 
</p>
<p>Partant d&#146;un mot cible donn&#233;, nous extrayons de la base textuelle l&#146;ensemble des contextes 
(nous avons choisi un paragraphe, mais ce pourrait &#234;tre le document entier ou une fen&#234;tre de 
taille donn&#233;e) contenant le mot-cible. Ces contextes sont lemmatis&#233;s, puis filtr&#233;s pour 
&#233;liminer les mots-outils (d&#233;terminants, pr&#233;positions, etc.), ainsi qu&#146;un certain nombre de mots 
g&#233;n&#233;raux et tout particuli&#232;rement, dans notre application, ceux li&#233;s au Web lui-m&#234;me (menu, 
accueil, lien, http, etc.). 
</p>
<p>L&#146;ensemble des cooccurrences forme un graphe, dont les n&#156;uds sont les diff&#233;rents mots du 
corpus. Une ar&#234;te relie deux n&#156;uds A, B chaque fois que les mots correspondants ont &#233;t&#233; 
trouv&#233;s en cooccurrence autour du mot-cible (au-del&#224; d&#146;un seuil de fr&#233;quence fix&#233;). Nous 
affectons &#224; chaque ar&#234;te un poids d&#146;autant plus faible que les mots sont fr&#233;quemment 
associ&#233;s : 
</p>
<p>wA,B = 1 - max[ p (A | B), p(B | A) ] 
</p>
<p>o&#249; p(A | B) est la probabilit&#233; conditionnelle d&#146;observer A dans un contexte donn&#233; sachant que 
ce contexte contient B, et inversement, p(B | A) celle d&#146;observer B dans un contexte donn&#233; 
sachant que ce contexte contient A. Ces probabilit&#233;s sont estim&#233;es &#224; partir des fr&#233;quences : 
</p>
<p>p(A | B) = fA.B / fB     et     p(B | A) = fA.B / fA 
</p>
<p>Nous prendrons &#224; titre d&#146;illustration les cooccurrences eau - ouvrage et eau - potable. Le 
Tableau 1 donne le nombre de contextes dans lesquels ces couples de mots apparaissent 
ensemble ou l&#146;un sans l&#146;autre dans un corpus de pages Web (cf. section 4). On voit que toutes 
les occurrences du mot potable apparaissent conjointement avec le mot eau, alors que c&#146;est le 
cas seulement d&#146;une partie des occurrences du mot ouvrage. 
</p>
<p> EAU ~EAU Total EAU ~EAU Total
OUVRAGE 183 296 479  POTABLE 63 0 63
~OUVRAGE 874 5556 6430  ~POTABLE 994 5852 6846
Total 1057 5852 6909  Total 1057 5852 6909
</p>
<p>Tableau 1. Cooccurrences eau-ouvrage et eau-potable 
</p>
<p>On a : 
</p>
<p>p(eau | ouvrage) = 183/479 =0,38 p(ouvrage | eau) = 183/1057 = 0,17 w = 1 - 0,38 = 0,62 
p(eau | potable) = 63/63 =1   p(potable | eau) = 63/1057 = 0,06 w = 1 - 1 = 0 
</p>
<p>La mesure refl&#232;te donc la plus ou moins grande &#171; distance1 &#187; s&#233;mantique entre mots : 
lorsqu&#146;elle vaut 0, les mots sont toujours associ&#233;s (jusqu&#146;&#224; concurrence de la fr&#233;quence 
maximale possible, d&#233;termin&#233;e par le moins fr&#233;quent) ; lorsqu&#146;elle vaut 1, les mots ne sont 
jamais associ&#233;s. 
</p>
<p>                                                 
1 Il ne s&#146;agit pas d&#146;une distance au sens math&#233;matique du terme, mais d&#146;une dissimilarit&#233;, l&#146;in&#233;galit&#233; 
</p>
<p>triangulaire n&#146;&#233;tant pas respect&#233;e. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean VERONIS 
</p>
<p>L&#146;hypoth&#232;se de base qui sous-tend notre m&#233;thode est que les diff&#233;rents usages du mot-cible 
constituent des sous-ensembles, ou &#171; composantes &#187;, de haute densit&#233; dans le graphe. En 
effet, barrage (dans l&#146;usage &#171; barrage hydraulique &#187;) doit &#234;tre en cooccurrence fr&#233;quente avec 
eau, ouvrage, fleuve, rivi&#232;re, crue, irrigation, etc., et ces mots eux-m&#234;mes ont toutes les 
chances d&#146;&#234;tre interconnect&#233;s (Figure 1). De m&#234;me, dans l&#146;usage &#171; match de barrage &#187;, 
barrage doit &#234;tre en cooccurrence fr&#233;quente avec match, &#233;quipe, coupe, football, victoire, 
etc., ces termes eux-m&#234;mes &#233;tant fortement interconnect&#233;s. Etant donn&#233; la complexit&#233; du 
langage (et en particulier le fait que les mots entrant dans les cooccurrences sont eux-m&#234;mes 
ambigus), il existe aussi des connexions entre les composantes, ce qui interdit l&#146;utilisation 
d&#146;algorithmes de d&#233;tection de composantes fortement connexes ou de cliques, mais ces 
interconnections entre les composantes doivent &#234;tre peu nombreuses et leur poids &#233;lev&#233;. 
</p>
<p>eau
</p>
<p>crue
fleuve
</p>
<p>rivi&#232;re
</p>
<p>irrigation
</p>
<p>match &#233;quipe
</p>
<p>coupe
</p>
<p>football
monde
</p>
<p>victoire
</p>
<p> 
Figure 1. Composantes de forte densit&#233; dans le graphe des cooccurrences 
</p>
<p>D&#233;tecter les diff&#233;rents usages d&#146;un mot revient donc &#224; isoler des composantes de forte densit&#233; 
du graphe des cooccurrences. La plupart des techniques exactes de partitionnement de 
graphes sont malheureusement NP-difficiles, et l&#146;on ne peut (&#233;tant donn&#233; que les graphes 
obtenus ont plusieurs milliers de n&#156;uds et d&#146;ar&#234;tes) qu&#146;utiliser des m&#233;thodes approximatives, 
bas&#233;es sur des heuristiques. La recherche sur la d&#233;tection de composantes de forte densit&#233; est 
un domaine particuli&#232;rement actif, qui intervient notamment dans les secteurs de la d&#233;tection 
de &#171; communaut&#233;s &#187; ou de &#171; sources autoris&#233;es &#187; sur le Web, ou la parall&#233;lisation des calculs. 
Malheureusement, les techniques d&#233;velopp&#233;es dans ces secteurs ne sont pas directement 
exploitables, &#233;tant donn&#233; que l&#146;applicabilit&#233; des heuristiques d&#233;pend des applications et des 
propri&#233;t&#233;s particuli&#232;res des graphes analys&#233;s. La propri&#233;t&#233; fondamentale que nous 
exploiterons ici est le caract&#232;re zipfien du langage, rappel&#233; plus haut, et qui touche &#224; la fois la 
fr&#233;quence des mots eux-m&#234;mes, la fr&#233;quence des usages de chaque mot, et la fr&#233;quence des 
cooccurrences (voir Zipf, 1945, et aussi Baayen, 2000). 
</p>
<p>3 D&#233;tection des composantes de forte densit&#233; 
</p>
<p>Nous cr&#233;ons le graphe des cooccurrences en ne retenant que les mots apparaissant dans au 
moins 10 contextes, et les cooccurrences correspondant &#224; un poids w en de&#231;&#224; d&#146;un certain 
seuil (0.9). L&#146;algorithme de d&#233;tection part du principe que pour chacun des usages du mot 
consid&#233;r&#233; (&#171; mot-cible &#187;), un cooccurrent (ou &#171; mot-racine &#187;) a une fr&#233;quence plus &#233;lev&#233;e que 
les autres, en vertu de l&#146;organisation zipfienne des cooccurrences que nous avons mentionn&#233;e </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cartographie lexicale pour la recherche d&#146;informations 
</p>
<p>plus haut. Ainsi, pour barrage, le cooccurrent le plus fr&#233;quent dans l&#146;usage &#171; barrage 
hydraulique &#187; est eau, tandis que le cooccurrent le plus fr&#233;quent dans l&#146;usage &#171; match de 
barrage &#187; est match.  
</p>
<p>De plus, nous faisons l&#146;hypoth&#232;se que les autres cooccurrents du mot-cible pour un usage 
donn&#233; ont toutes les chances d&#146;appara&#238;tre &#224; un moment ou &#224; un autre au contact du mot-racine 
de cet usage, et donc d&#146;&#234;tre directement connect&#233; &#224; celui-ci dans le graphe.  Par exemple, les 
voisins directs de eau (dans le contexte de barrage) sont ouvrage, rivi&#232;re, cours, retenue, 
construction, etc. Ceux de match sont &#233;quipe, monde, coupe, football, but, etc. Les mots 
fr&#233;quents qui ne seraient pas des voisins de eau ont de bonnes chances de faire partie d&#146;un 
autre usage.  
</p>
<p>L&#146;algorithme HyperLex utilise cette propri&#233;t&#233; pour d&#233;terminer de fa&#231;on it&#233;rative les &#171; mots-
racines &#187; caract&#233;risant chaque usage. Dans un premier temps, HyperLex constitue une liste 
des n&#156;uds du graphe class&#233;s par ordre de fr&#233;quence d&#233;croissante. Pour chaque n&#156;ud de la 
liste, l&#146;algorithme essaie de d&#233;terminer si ce n&#156;ud est une racine raisonnable pour une 
composante de forte densit&#233;, selon deux crit&#232;res : 
</p>
<p>(1)  le n&#156;ud doit avoir au moins 6 voisins propres (c&#146;est-&#224;-dire qui ne sont pas voisins 
d&#146;un mot-racine pr&#233;c&#233;demment d&#233;termin&#233;), 
</p>
<p>(2)  le poids moyen entre le n&#156;ud-racine potentiel et ses 6 premiers voisins propres doit 
&#234;tre inf&#233;rieur &#224; un seuil donn&#233; (0.8).  
</p>
<p>Si le n&#156;ud satisfait &#224; ces conditions, il est retenu comme mot-racine et il est &#233;limin&#233; de la liste 
avec tous ses voisins. Le processus est it&#233;r&#233; jusqu&#146;&#224; avoir &#233;puis&#233; tous les n&#156;uds du graphe. 
</p>
<p>Ceci donne les &#233;tapes suivantes pour barrage dans notre corpus (les mots-racines successifs 
et leurs voisins propres les plus fr&#233;quents apparaissent apr&#232;s le signe &#8658; ; les mots qui ne 
satisfont pas les crit&#232;res 1 et 2 sont barr&#233;s) :  
</p>
<p>Liste 1: eau construction ouvrage rivi&#232;re projet retenue crue s&#233;curit&#233; hydro&#233;lectrique &#233;tude travail hauteur m&#232;tre zone plan 
r&#233;gion terre d&#233;veloppement cours lac environnement r&#233;servoir technique niveau bassin impact fleuve d&#233;bit population... 
</p>
<p>&#8658; EAU :  construction ouvrage rivi&#232;re projet retenue crue... 
</p>
<p>Liste 2: routier fronti&#232;re comit&#233; match Alg&#233;rie militaire efficacit&#233; arm&#233;e v&#233;hicule Suisse histoire carte auscultation poste 
Tunisie ALN camion jeu am&#233;ricain connaissance d&#233;fense document membre liste inspection position financement... 
</p>
<p>&#8658; ROUTIER : v&#233;hicule camion membre conducteur policier groupement... 
</p>
<p>Liste 3: fronti&#232;re comit&#233; match Alg&#233;rie militaire efficacit&#233; arm&#233;e Suisse histoire carte auscultation poste Tunisie ALN jeu 
am&#233;ricain connaissance d&#233;fense document liste inspection position financement contenance alg&#233;rien division Allemagne... 
</p>
<p>&#8658; FRONTIERE : Alg&#233;rie militaire efficacit&#233; arm&#233;e suisse poste... 
</p>
<p>Liste 4: comit&#233; match histoire carte auscultation jeu am&#233;ricain connaissance document liste inspection position financement 
contenance division Allemagne province CMB INGEMA gabion prix d&#233;bat congres renseignement dommage r&#233;action... 
</p>
<p>&#8658; MATCH : vainqueur victoire rencontre qualification tir football... 
</p>
<p>Apr&#232;s cette &#233;tape, plus aucun mot ne satisfait les conditions. Au total, HyperLex a donc 
d&#233;termin&#233; quatre mots-racines, eau, routier, fronti&#232;re, match, qui refl&#232;tent bien les usages de 
barrage dans le corpus.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean VERONIS 
</p>
<p>4 Exp&#233;rimentation 
</p>
<p>Nous avons exp&#233;riment&#233; HyperLex sur 10 mots tr&#232;s polys&#233;miques (Tableau 2), choisis parmi 
ceux qui ont servi de mots-tests lors de l&#146;action de d&#233;sambigu&#239;sation Romanseval, et qui 
avaient pos&#233; de grandes difficult&#233;s &#224; des annotateurs humains (V&#233;ronis, 1998) . Un sous-
corpus de pages Web a &#233;t&#233; constitu&#233; pour chacun de ces mots, &#224; l&#146;aide du m&#233;ta-moteur 
Copernic Agent2, en interrogeant tout d&#146;abord la forme singulier, puis la forme pluriel. Les 
pages obtenues ont &#233;t&#233; filtr&#233;es de fa&#231;on &#224; &#233;liminer les pages qui ne contenaient pas le mot 
cherch&#233; (erreurs du type &#171; Page not found &#187;, par exemple), ainsi que les doublons. 
</p>
<p>Mot Pages Contextes Graphe 
 Brutes Utiles Bruts Utiles N&#156;uds Ar&#234;tes 
BARRAGE 1702 1372 7256 6924 1203 6138 
DETENTION 2112 1270 8902 8728 1418 19007 
FORMATION 5974 1590 5248 4885 542 1531 
LANCEMENT 2828 1231 3307 3174 617 2521 
ORGANE 2786 994 2953 2849 531 1997 
PASSAGE 3512 1046 4210 3894 797 2916 
RESTAURATION 5327 1227 3522 3287 512 1398 
SOLUTION 6287 896 2085 1915 253 1704 
STATION 7916 1093 3837 3671 487 971 
VOL 5237 818 3001 2579 259 719 
</p>
<p>Tableau 2. Mots-cibles et caract&#233;ristiques quantitatives des sous-corpus 
</p>
<p>Les paragraphes contenant chaque mot-cible ont &#233;t&#233; extraits et &#233;tiquet&#233;s &#224; l&#146;aide du logiciel 
Cordial Analyseur3. Seuls ont &#233;t&#233; retenus les noms et les adjectifs. Dans un premier temps 
nous avions retenu aussi les verbes, mais il s&#146;est finalement av&#233;r&#233; que ceux-ci d&#233;gradent 
notablement les performances. Les mots g&#233;n&#233;raux appartenant &#224; un anti-dictionnaire (stoplist) 
ont &#233;t&#233; supprim&#233;s. Finalement, les contextes contenant moins de 4 mots apr&#232;s filtrage ont &#233;t&#233; 
&#233;limin&#233;s. Le Tableau 2 donne les caract&#233;ristiques quantitatives du sous-corpus recueilli pour 
chaque mot, ainsi que du graphe de cooccurrences qu&#146;il a permis de construire. 
</p>
<p>L&#146;algorithme HyperLex a &#233;t&#233; appliqu&#233; &#224; chacun des mots, et donne les r&#233;sultats r&#233;sum&#233;s dans 
le Tableau 3. La liste des usages d&#233;tect&#233;s pour chaque mot refl&#232;te &#233;videmment la composition 
du corpus, et les biais introduits par les moteurs de recherches et leurs algorithmes de 
pond&#233;ration et de classement des r&#233;sultats (tels que PageRank de Google). Par exemple, le 
mot formation, polys&#233;mique dans la langue g&#233;n&#233;rale, n&#146;appara&#238;t dans notre corpus que dans le 
contexte d&#146;apprentissage et d&#146;enseignement. On note aussi l&#146;influence d&#146;&#233;num&#233;rations, 
comme pour le mot station, o&#249; certaines pages contiennent des annuaires de stations-services 
d&#233;livrant du gaz GPL. Ces &#233;num&#233;rations r&#233;sultent dans des usages un peu artificiels pour les 
mots concern&#233;s. L&#146;algorithme n&#146;&#233;tant pas ici en cause, nous n&#146;avons pas explor&#233; plus avant la 
question, mais il conviendrait sans doute de se pencher plus en d&#233;tail sur le nettoyage des 
pages dans une utilisation op&#233;rationnelle. 
</p>
<p>Les usages r&#233;pertori&#233;s couvrent la quasi-totalit&#233; des th&#233;matiques d&#233;velopp&#233;es dans les 
diff&#233;rents sous-corpus. En proc&#233;dant par sondage (1 page sur 100), nous n&#146;avons constat&#233; 
l&#146;absence d&#146;aucune th&#233;matique majeure. Ceci n&#146;exclut pas que quelques usages tr&#232;s peu 
</p>
<p>                                                 
2 http://www.copernic.com 
3 D&#233;velopp&#233; par Synapse D&#233;veloppement : http://www.synapse-fr.com </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cartographie lexicale pour la recherche d&#146;informations 
</p>
<p>fr&#233;quents aient &#233;t&#233; omis par l&#146;algorithme, mais seule une &#233;valuation beaucoup plus d&#233;taill&#233;e 
pourrait les r&#233;v&#233;ler. 
</p>
<p>Mot-Cible Racine Fr&#233;q. Voisins les plus fr&#233;quents 
BARRAGE EAU 1057 construction ouvrage rivi&#232;re projet retenue crue 
 ROUTIER 125 v&#233;hicule camion membre conducteur policier groupement 
 FRONTIERE 106 Alg&#233;rie militaire efficacit&#233; arm&#233;e Suisse poste 
 MATCH 65 vainqueur victoire rencontre qualification tir football 
DETENTION PROVISOIRE 2189 juge libert&#233; loi proc&#233;dure prison instruction 
 DETENU 1049 police centre autorit&#233; arrestation torture arbitraire 
 ARME 306 autorisation acquisition feu munition vente commerce 
 ANIMAL 212 transport compagnie sauvage certificat annexe directive 
FORMATION PROFESSIONNEL 573 centre entreprise organisme stage service programme 
LANCEMENT SATELLITE 301 Ariane programme spatial lanceur orbite fus&#233;e 
 PRODUIT 124 public entreprise &#233;v&#233;nement convention presse affaire 
ORGANE DON 187 transplantation greffe donneur pr&#233;l&#232;vement tissu vie 
 DELIBERANT 126 public &#233;tablissement pr&#233;sident demande attribution communaut&#233; 
 REGLEMENT 91 pays appel diff&#233;rend OMC r&#233;union autorit&#233; 
 TECHNIQUE 62 scientifique convention &#233;conomique conf&#233;rence subsidiaire programme 
 CONSULTATIF 52 mati&#232;re civil t&#234;te supervision m&#233;morandum PAB 
 MALADIE 48 c&#156;ur traitement sp&#233;cimen preuve sang intervention 
 REPRESENTANT 48 d&#233;l&#233;gu&#233; supr&#234;me concertation d&#233;partement personnel agent 
 PARTI 47 presse chef journal Gen&#232;ve Allemagne r&#233;dacteur 
PASSAGE EURO 621 public travail entreprise syst&#232;me national monnaie 
 AN_2000 264 programme autorit&#233; installation r&#233;seau solution mat&#233;riel 
 NIVEAU 172 porte chemin ouverture salle route entr&#233;e 
 LIBRE 92 cour prestation police assurance caisse pr&#233;voyance 
 CHEVAL 71 main &#233;nergie &#233;quilibre trot dos foul&#233;e 
 PARAMETRE 61 mode appel variable argument langage expression 
 GALERIE 53 ville boutique bois panorama &#233;poque verri&#232;re 
 TERRE 53 dur&#233;e mouvement soleil V&#233;nus Mercure n&#156;ud 
 MORT 46 rite Dieu naissance Christ vivant J&#233;sus 
RESTAURATION HOTELLERIE 188 formation dur&#233;e centre professionnel entreprise alternance 
 CONSERVATION 157 sauvegarde atelier monument technique historique oeuvre 
 HEBERGEMENT 136 activit&#233; h&#244;tel r&#233;gion loisir culture contact 
 RAPIDE 114 restaurant vente &#233;tablissement repas marche traiteur 
 FICHIER 103 syst&#232;me information donn&#233;e client espace bande 
 PIERRE 70 b&#226;timent chantier terre polychromie taille sec 
 MEUBLE 69 bois table mobilier d&#233;coration fabrication antiquit&#233; 
SOLUTION GESTION 147 entreprise service logiciel client information syst&#232;me 
 JEU 80 monde gratuit astuce joueur gain francophone 
 INJECTABLE 65 perfusion glucose HOP commercialisation arr&#234;t Fandre 
STATION SKI 261 hiver piste montagne sport village location 
 METEO 132 temp&#233;rature Oregon scientific WS professionnel capteur 
 SPATIAL 117 international MIR syst&#232;me programme ISS projet 
 TRAVAIL 106 r&#233;seau traitement donn&#233;e carte Sun environnement 
 RADIO 94 navire r&#233;gion r&#233;ception installation antenne communication 
 PRIMAGAZ 86 Paris aire Esso province Marseille Dyneff 
 EAU 79 &#233;puration source mer plage Yves rivi&#232;re 
 LIGNE 65 m&#233;tro quai terminus voyageur correspondance atelier 
VOL AVION 393 billet pilote club sec d&#233;part voyage 
 LIBRE 260 &#233;cole parapente loisir montagne formation Paris 
 VOILE 219 centre photo vent pilotage forum comp&#233;tition 
 VOLE 44 service recherche num&#233;ro base donn&#233;e v&#233;hicule 
</p>
<p>Tableau 3. R&#233;sultats de l&#146;algorithme sur les 10 mots-cibles 
(la colonne Freq. donne la fr&#233;quence des mots-racines) 
</p>
<p>Par contre, on peut discuter certaines distinctions ou certains regroupements op&#233;r&#233;s par 
l&#146;algorithme. Ainsi, pour d&#233;tention, l&#146;algorithme distingue les aspects juridiques li&#233;s &#224; la 
d&#233;tention provisoire (sous cette racine), et ceux li&#233;s au prisonnier et aux conditions de 
d&#233;tention (sous la racine d&#233;tenu). En examinant plus en d&#233;tail les pages concern&#233;es, on 
constate effectivement des champs lexicaux diff&#233;rents, l&#146;un de type juridique et judiciaire, 
l&#146;autre li&#233; aux aspects humains de la d&#233;tention, mais les deux pourraient sans doute &#234;tre 
regroup&#233;s. A l&#146;inverse, l&#146;algorithme fusionne les stations de radio &#224; usage public (FM, etc.) et 
les stations radio de navires, les champs lexicaux &#233;tant assez proches (radio, communication, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean VERONIS 
</p>
<p>bande, MHz, etc.). On voudrait pourtant tr&#232;s certainement diff&#233;rencier ces usages, qui 
correspondront vraisemblablement &#224; des requ&#234;tes diff&#233;rentes. L&#146;algorithme pourrait &#234;tre 
am&#233;lior&#233; sur plusieurs points, notamment par la prise en compte des distances entre 
cooccurrents. Ainsi, l&#146;expression &#171; station de radio &#187; n&#146;est utilis&#233;e que pour les stations de 
radio &#224; usage public, alors que pour l&#146;usage maritime, on trouve l&#146;expression &#171; station de 
navire &#187;, et le mot radio lui m&#234;me est g&#233;n&#233;ralement plus &#233;loign&#233; dans le contexte, entrant 
dans d&#146;autres expressions (op&#233;rateur radio, &#233;quipement radio, etc.). 
</p>
<p>Enfin, la s&#233;lection du mot-racine est dans quelques cas discutable, m&#234;me si lui-m&#234;me et ses 
voisins repr&#233;sentent bien la th&#233;matique de l&#146;usage consid&#233;r&#233;. Par exemple, m&#233;tro serait plus 
intuitif que ligne pour l&#146;usage &#171; station de m&#233;tro &#187;. L&#146;usage des distances entre le mot-cible et 
ses cooccurrents pourrait probablement am&#233;liorer les choses, comme pour le cas pr&#233;c&#233;dent. 
</p>
<p>5 Visualisation et navigation &#171; hyperlexicale &#187; 
</p>
<p>La visualisation et la navigation &#224; l&#146;int&#233;rieur de grands graphes est un domaine de recherche 
en pleine expansion, li&#233; notamment &#224; la n&#233;cessit&#233; de repr&#233;senter de fa&#231;on satisfaisante les 
liens entre serveurs ou entre hyperdocuments &#224; l&#146;intention des administrateurs et webmasters. 
L&#146;algorithme H3 r&#233;cemment d&#233;velopp&#233; par Tamara Munzner dans le cadre de sa th&#232;se 
(Munzner, 2000) nous para&#238;t l&#146;un des plus convaincants, et, contrairement &#224; d&#146;autres, 
directement adaptable &#224; notre probl&#233;matique. Un outil qui impl&#233;mente cet algorithme, 
H3Viewer, est de plus disponible4, et permet une exp&#233;rimentation imm&#233;diate. 
</p>
<p>Le probl&#232;me de la repr&#233;sentation de grands graphes dans un espace euclidien est tout d&#146;abord 
le &#171; manque de place &#187; de l&#146;espace euclidien, puisque le nombre de n&#156;uds d&#146;un arbre, par 
exemple, cro&#238;t de fa&#231;on exponentielle avec la profondeur, alors que l&#146;espace disponible pour 
les repr&#233;senter cro&#238;t seulement de fa&#231;on polynomiale par rapport au rayon d&#146;un cercle ou 
d&#146;une sph&#232;re. Il en r&#233;sulte des distorsions in&#233;vitables, qui peuvent perturber consid&#233;rablement 
la lecture, et ont souvent pour effet, lorsqu&#146;on se d&#233;place en profondeur dans l&#146;arbre, de faire 
perdre totalement de vue le contexte environnant. De plus, des strat&#233;gies doivent &#234;tre 
d&#233;velopp&#233;es pour g&#233;rer la surabondance d&#146;information (multiples liens et n&#156;uds) qui rend tr&#232;s 
rapidement les repr&#233;sentations totalement illisibles. 
</p>
<p>L&#146;algorithme H3 r&#233;sout ces probl&#232;mes de fa&#231;on tr&#232;s &#233;l&#233;gante &#224; l&#146;aide de la g&#233;om&#233;trie 
hyperbolique : dans un espace hyperbolique, l&#146;espace disponible cro&#238;t de fa&#231;on exponentielle 
avec le rayon, contrairement &#224; l&#146;espace euclidien. L&#146;espace hyperbolique (infini) est ensuite 
projet&#233; dans une portion finie de l&#146;espace euclidien (un disque), comme film&#233; par une cam&#233;ra, 
dont l&#146;utilisateur peut d&#233;placer la position et l&#146;angle. Le r&#233;sultat appara&#238;t &#224; l&#146;utilisateur en 
perspective comme une projection dans une sph&#232;re (effet &#171; fish-eye &#187; : Figure 2). 
</p>
<p>H3 prend en entr&#233;e un arbre construit &#224; partir du graphe &#224; visualiser. L&#146;arbre que nous 
construisons essaie de repr&#233;senter au mieux les composantes de forte densit&#233; qui repr&#233;sentent 
les diff&#233;rents usages du mot-cible. Nous construisons le sommet de l&#146;arbre en ajoutant un 
n&#156;ud qui correspond au mot-cible (par exemple barrage), reli&#233; par des ar&#234;tes de poids 0 &#224; 
chacun des mots-racines d&#233;termin&#233;s &#224; l&#146;&#233;tape pr&#233;c&#233;dente. Apr&#232;s quelques heuristiques 
                                                 
4  http://graphics.stanford.edu/~munzner/h3/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cartographie lexicale pour la recherche d&#146;informations 
</p>
<p>d&#146;&#233;lagage de certaines ar&#234;tes (par exemple celles qui relient des mots de fr&#233;quences tr&#232;s 
diff&#233;rentes), nous calculons un arbre de couverture minimale ayant pour racine le mot-cible. 
Cet arbre organise les diff&#233;rentes composantes denses d&#146;une fa&#231;on qui refl&#232;te la force 
d&#146;association entre mots. Il est ensuite visualis&#233; &#224; l&#146;aide d&#146;H3Viewer. L&#146;utilisateur peut 
naviguer de th&#232;me en th&#232;me &#224; l&#146;int&#233;rieur de la repr&#233;sentation hyperbolique &#224; l&#146;aide de la 
souris : un clic sur un n&#156;ud avec le bouton gauche permet de centrer la repr&#233;sentation autour 
de ce n&#156;ud, un glisser avec le bouton gauche appuy&#233; permet de d&#233;placer un n&#156;ud et de 
changer le contexte, un glisser avec le bouton droit permet une rotation de l&#146;arbre. La Figure 2 
montre en (a) la vue initiale offerte &#224; l&#146;utilisateur pour le mot barrage et en (b) la vue obtenue 
en cliquant sur le n&#156;ud match. 
</p>
<p>6 Conclusion 
</p>
<p>Nous avons pr&#233;sent&#233; un algorithme, HyperLex, qui permet d&#146;extraire automatiquement d&#146;une 
grande base textuelle les usages d&#146;un mot donn&#233;, sans recours &#224; un dictionnaire. 
Contrairement aux m&#233;thodes pr&#233;c&#233;dentes bas&#233;es sur des vecteurs de mots, notre technique 
permet d&#146;isoler des usages de fr&#233;quence tr&#232;s faible. L&#146;algorithme est coupl&#233; avec une 
technique de repr&#233;sentation visuelle bas&#233;e sur un espace hyperbolique (Munzner, 2000) qui 
permet &#224; l&#146;utilisateur de naviguer &#224; travers le lexique et les th&#233;matiques d&#233;gag&#233;es. 
</p>
<p>Remerciements 
</p>
<p>Nous sommes tr&#232;s reconnaissant &#224; Tamara Munzner pour la mise &#224; disposition de l&#146;outil 
H3Viewer, utilis&#233; dans ce travail. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Baayen, R. H. (2000). Word frequency distributions. Dordrecht: Kluwer Academic 
Publishers. 
</p>
<p>Ide, N. M., V&#233;ronis, J. (1998). Introduction to the special issue on word sense 
disambiguation : the state of the art. Computational Linguistics, (24)1, 1-40. 
</p>
<p>Munzner, T. (2000). Interactive visualization of large graphs and networks. Ph. D. 
Dissertation, Stanford University. 
</p>
<p>Sch&#252;tze, H. (1998). Automatic word sense discrimination. Computational Linguistics, (24)1, 
97-124. 
</p>
<p>V&#233;ronis, J. (1998). A study of polysemy judgements and inter-annotator agreement, 
Programme and advanced papers of the Senseval workshop (pp. 2-4). Herstmonceux Castle 
(England) [http:/www.up.univ-mrs.fr/veronis/pdf/1998senseval.pdf]. 
</p>
<p>Zipf, G. K. (1945). The meaning-frequency relationship of words. Journal of General 
Psychology, 33, 251-266. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean VERONIS 
</p>
<p> 
</p>
<p> 
Figure 2. Deux vues du champ lexical de barrage 
</p>
<p>a) 
</p>
<p>b) </p>

</div></div>
</body></html>