<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Remarques et perspectives sur les langages de pr&#233;groupe d&#8217;ordre 1/2</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Remarques et perspectives sur les
langages de pr&#233;groupe d&#8217;ordre 1/2
</p>
<p>Denis B&#233;chet, Annie Foret
INRIA &amp; Universit&#233; de Rennes 1, IRISA
</p>
<p>Campus Universitaire de Beaulieu
Avenue du G&#233;n&#233;ral Leclerc
</p>
<p>35042 Rennes Cedex
France
</p>
<p>{Denis.Bechet,Annie.Foret}@irisa.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Acquisition automatique, inf&#233;rence grammaticale, mod&#232;le de Gold, pr&#233;groupe.
Automatic acquisition, grammatical inference, model of Gold, pregoup.
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article traite de l&#8217;acquisition automatique des grammaires de Lambek, utilis&#233;es pour la mo-
d&#233;lisation syntaxique des langues. R&#233;cemment, des algorithmes ont &#233;t&#233; propos&#233;s dans le mod&#232;le
d&#8217;apprentissage de Gold, pour certaines classes de grammaires cat&#233;gorielles. En revenche, les
grammaires de Lambek rigides ou k-valu&#233;es ne sont pas apprenables &#224; partir des cha&#238;nes. Nous
nous int&#233;ressons ici au cas des grammaires de pr&#233;groupe. Nous montrons que la classe des
grammaires de pr&#233;groupe n&#8217;est pas apprenable &#224; partir des cha&#238;nes, m&#234;me si on limite forte-
ment l&#8217;ordre des types (ordre 1/2) ; notre preuve revient &#224; construire un point limite pour cette
classe.
</p>
<p>The article is concerned by the automatic acquistion of some grammars introduced by Lambek
that are used for modeling the syntax of natural languages. Recently, some algorithms have
been proposed in the model of Gold for several classes of categorial grammars. On the other
hand, rigid or k-valued Lambek calculus grammars are not learnable from strings. We study
here pregroup grammars. We prove that rigid grammars are not learnable from strings even if
the order of types are bound by a constant (1/2) ; Our proof gives a limit point for this class of
grammars.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Denis B&#233;chet, Annie Foret
</p>
<p>1 Introduction
</p>
<p>Les grammaires de pr&#233;groupe ont &#233;t&#233; introduites r&#233;cemment dans (Lambek, 1999) dans le do-
maine du traitement automatique des langues, comme une alternative aux autres mod&#232;les de la
structure syntaxique des langues. Ce sont des grammaires lexicalis&#233;es, tout comme les gram-
maires cat&#233;gorielles en g&#233;n&#233;ral auxquelles les grammaires de pr&#233;groupe sont apparent&#233;es ; c&#8217;est-
&#224;-dire qu&#8217;elles associent des types &#224; chaque mot du lexique, tandis que les r&#232;gles avec lesquelles
elles fonctionnent sont fix&#233;es ; ces r&#232;gles, que ce soit dans les pr&#233;groupes ou dans les gram-
maires cat&#233;gorielles de Lambek introduites auparavant, sont de nature logique et alg&#233;brique ;
analyser une phrase revient alors &#224; faire une d&#233;duction logique ou alg&#233;brique.
</p>
<p>Nous nous int&#233;ressons plus particuli&#232;rement au probl&#232;me de l&#8217;acquisition automatique de telles
grammaires ; dans ce cadre, il s&#8217;agit d&#8217;obtenir les types associ&#233;s aux mots, &#224; partir d&#8217;exem-
ples ; en se pla&#231;ant dans le mod&#232;le de Gold d&#8217;apprentissage, le processus est suppos&#233; converger
lorsque le nombre d&#8217;exemples positifs est suffisamment grand. Ce paradigme a suscit&#233; des tra-
vaux r&#233;cents, depuis les r&#233;sultats encourageants de (Kanazawa, 1998) et concerne plusieurs
&#233;quipes, notamment en France, citons les travaux tels que (Bonato &amp; Retor&#233;, september 2001;
Dudau-Sofronie, d&#233;cembre 2001).
L&#8217;inter&#234;t des pr&#233;groupes para&#238;t multiple : ils offrent un moyen d&#8217;expression de constructions
linguistiques complexes, par exemple (Bargelli &amp; Lambek, 2001; Casadio &amp; Lambek, 2001)
montrent comment traiter des clitiques ; d&#8217;un autre point de vue, ils disposent d&#8217;un algorithme
polynomial pour tester l&#8217;appartenance au langage ; enfin dans une perspective d&#8217;acquisition
automatis&#233;e, &#234;tre lexicalis&#233; est un avantage : cela permet des mises &#224; jour incr&#233;mentales lorsque
des mots ou des usages nouveaux doivent &#234;tre pris en compte.
</p>
<p>L&#8217;article est organis&#233; comme suit. La section 2 pr&#233;sente des exemples, les d&#233;finitions n&#233;cessaires
et des r&#233;sultats connus. La section 3 donne ensuite la construction de point limite et la preuve
pour les grammaires de pr&#233;groupe d&#8217;ordre 1/2. La section 4 conclut.
</p>
<p>2 Exemples, d&#233;finitions et pr&#233;requis
</p>
<p>2.1 Pr&#233;groupes
</p>
<p>Un pr&#233;groupe est un mono&#239;de partiellement ordonn&#233; dans lequel tout &#233;l&#233;ment a poss&#232;de un
adjoint &#224; droite ar et un adjoint &#224; gauche al tel que al &#183; a &#8804; 1 &#8804; a &#183; al et a &#183; ar &#8804; 1 &#8804; ar &#183; a
Ceci permet de parler d&#8217;adjoints it&#233;r&#233;s : a(i&#8722;1) = (a(i))l , a(i+1) = (a(i))r , a(0) = a
Pr&#233;groupes pour la linguistique. Nous reprenons ici un exemple linguistique d&#251; &#224; Lambek
(Lambek, 2001). Ces exemples utilisent les types de base suivants :
</p>
<p>pi2 = deuxi&#232;me personne s1 = &#233;nonc&#233; au temps pr&#233;sent
p1 = participe pr&#233;sent p2 = participe pass&#233;
o = objet q = question en oui ou non
q&#8242; = question
</p>
<p>&#8211; Voici un exemple de type &#8804; s1 :
You have been seeing her
pi2 (pir2s1pl2) (p2pl1) (p1ol) o
</p>
<p>Les r&#233;ductions successives portent ici sur des parties de types provenant de mots cons&#233;cutifs :
pi2pi
</p>
<p>r
2 &#8804; 1, p
</p>
<p>l
2p2 &#8804; 1, p
</p>
<p>l
1p1 &#8804; 1 et o
</p>
<p>lo &#8804; 1.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Remarques et perspectives sur les langages de pr&#233;groupe d&#8217;ordre 1/2
</p>
<p>&#8211; Un exemple de type &#8804; q (et aussi de type &#8804; q &#8242; si q &#8804; q&#8242;) :
have you seen her ?
</p>
<p>(qpl2pi
l
2) pi2 (p2ol) o
</p>
<p>Ici les r&#233;ductions peuvent se produire &#224; un certain stade entre mots distants (pl2 et p2).
&#8211; un exemple de type &#8804; q&#8242; (en reprenant des types ci-dessus &#8212; le tiret indique ici une trace) :
</p>
<p>whom have you seen &#8211; ?
(q&#8242;ollql) (qpl2pi
</p>
<p>l
2) pi2 (p2ol)
</p>
<p>Pr&#233;groupes libres. En fait, dans les grammaires de pr&#233;groupe pour la linguistique, nous uti-
lisons des pr&#233;groupes libres qui sont obtenus &#224; partir du mono&#239;de libre sur un alphabet P (Z)
(l&#8217;ensemble des mots sur cet alphabet). Nous notons de fa&#231;on g&#233;n&#233;rale X &#8727; l&#8217;ensemble des mots
(comprenant le mot vide) sur un alphabet X et X+ l&#8217;ensemble des mots non vides sur l&#8217;alphabet
X . Par la suite, &#931; d&#233;signe un alphabet donn&#233; (les mots d&#8217;une langue naturelle).
Soit (P,&#8804;) un ensemble ordonn&#233; fini de types primitifs. L&#8217;ensemble des types de base est P (Z) =
{p(i) | p &#8712; P, i &#8712; Z} et l&#8217;ensemble des types T(P,&#8804;) =
</p>
<p>(
P (Z)
</p>
<p>)&#8727;
= {p
</p>
<p>(i1)
1 &#183; &#183; &#183; p
</p>
<p>(in)
n | 0 &#8804;
</p>
<p>k &#8804; n, pk &#8712; P et ik &#8712; Z} (l&#8217;ensemble des mots de longueur finie sur l&#8217;alphabet P (Z)). Pour
X et Y &#8712; T(P,&#8804;), on dit que X &#8804; Y si et seulement cette relation est d&#233;ductible dans le syst&#232;me
d&#8217;inf&#233;rence suivant o&#249; p, q &#8712; P , n, k &#8712; Z et X, Y, Z &#8712; T(P,&#8804;) :
</p>
<p>(ID)
X &#8804; X
</p>
<p>XY &#8804; Z
(AG)
</p>
<p>Xp(n)p(n+1)Y &#8804; Z
</p>
<p>X &#8804; Y Z
(AD)
</p>
<p>X &#8804; Y p(n+1)p(n)Z
</p>
<p>X &#8804; Y Y &#8804; Z
(CUT )
</p>
<p>X &#8804; Z
</p>
<p>Xp(k)Y &#8804; Z
(INDG)
</p>
<p>Xq(k)Y &#8804; Z
</p>
<p>X &#8804; Y p(k)Z
(INDD)
</p>
<p>X &#8804; Y q(k)Z
</p>
<p>q &#8804; p si k est pair, et p &#8804; q si k est impair
</p>
<p>Cette construction, due &#224; Buskowski, d&#233;finit un pr&#233;groupe qui &#233;tend l&#8217;ordre &#8804; sur les types
primitifs P &#224; T(P,&#8804;). Nous appelons pr&#233;groupe libre simple le pr&#233;groupe libre bas&#233; sur l&#8217;&#233;galit&#233;
des types primitifs. La r&#232;gle de coupure peut &#234;tre &#233;limin&#233;e (Buszkowski, 2001).
Grammaire/langage de pr&#233;groupe libre, rigide, k-valu&#233;e.
&#8211; Une grammaire du pr&#233;groupe libre bas&#233; sur (P,&#8804;) est un triplet G = (&#931;, I, s) tel que :
</p>
<p>&#8211; &#931; est un alphabet fini ;
&#8211; I : &#931; 7&#8594; Pf (T(P,&#8804;)) assigne un ensemble fini de types &#224; chaque &#233;l&#233;ment de &#931; ;
&#8211; s &#8712; P est le type principal associ&#233; aux phrases correctes.
</p>
<p>&#8211; Les grammaires associant au plus k types &#224; chaque symbole de l&#8217;alphabet sont appel&#233;es
grammaires k-valu&#233;es ou grammaires rigides si k = 1.
</p>
<p>&#8211; La grammaire assigne le type X &#224; un mot v1 &#183; &#183; &#183; vn de &#931;&#8727; si et seulement si pour 1 &#8804; i &#8804; n,
&#8707;Xi &#8712; I(vi) tels que X1 &#183; &#183; &#183;Xn &#8804; X dans le pr&#233;groupe libre.
</p>
<p>&#8211; Le langage de cette grammaire not&#233; L(G) est l&#8217;ensemble des mots de &#931;&#8727; dont on peut assi-
gner le type s.
</p>
<p>2.2 Apprentissage et points limites
</p>
<p>Point limite. Une classe de langages a un point limite L ssi il existe une suite infinie (Ln)n&#8712;N
de langages telle que : { L0 ( L1 &#183; &#183; &#183; ( &#183; &#183; &#183; ( Ln ( &#183; &#183; &#183;
</p>
<p>L =
&#8899;
</p>
<p>n&#8712;N Ln
</p>
<p>Propri&#233;t&#233;. Une classe de langages qui poss&#232;de un point limite n&#8217;est pas apprenable.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Denis B&#233;chet, Annie Foret
</p>
<p>3 Grammaires de pr&#233;groupe d&#8217;ordre n/2
</p>
<p>La classe des grammaires de pr&#233;groupe k-valu&#233;es n&#8217;&#233;tant pas apprenable (Foret, 2002), nous
nous sommes int&#233;ress&#233;s &#224; des sous-classes avec l&#8217;espoir d&#8217;obtenir des r&#233;sultats positifs. Nous
pouvons notamment hi&#233;rarchiser les grammaires en bornant l&#8217;ordre des types.
</p>
<p>Grammaire de pr&#233;groupe d&#8217;ordre n/2
&#8211; Une grammaire de pr&#233;groupe sur (P,&#8804;) d&#8217;ordre n &#8712; N est une grammaire o&#249; les types de
</p>
<p>base sont dans P (&#8722;n&#183;&#183;&#183;n) = {a(i)|a &#8712; P et &#8722; n &#8804; i &#8804; n}.
&#8211; Une grammaire de pr&#233;groupe sur (P,&#8804;) d&#8217;ordre n + 1/2, n &#8712; N est une grammaire o&#249; les
</p>
<p>types de base sont dans P (&#8722;n&#8722;1&#183;&#183;&#183;n) = {a(i)|a &#8712; P et &#8722; n&#8722; 1 &#8804; i &#8804; n}.
L&#8217;utilisation des 1/2 ordres permet de distinguer les grammaires avec des types sym&#233;triques
autour des types primitifs (les grammaires d&#8217;ordre n) et les grammaires sans type central (les
grammaires d&#8217;ordre n + 1/2).
Nous montrons dans cette section que la plus petite classe, &#224; part la classe des grammaires
d&#8217;ordre 0 qui n&#8217;est pas tr&#232;s int&#233;ressante, admet un point limite. Ainsi, toutes ces familles, sauf &#224;
l&#8217;ordre 0, ne sont pas apprenables.
</p>
<p>D&#233;finitions deR etR&#8727;
R : XplpY
</p>
<p>R
&#8594; XY , p &#8712; P , X, Y &#8712; (P &#8746; P l)&#8727;.
</p>
<p>R&#8727; : la fermeture transitive et sym&#233;trique deR (notation R&#8727;&#8594;).
Lemme. Pour X &#8712; (P &#8746; P l)&#8727; et s &#8712; P , X &#8804; s si et seulement si X R
</p>
<p>&#8727;
</p>
<p>&#8594; s
</p>
<p>Preuve. X &#8804; s ssi X &#8804; s dans le syst&#232;me de d&#233;duction des pr&#233;groupes libres sans coupure.
Or, dans ce syst&#232;me puisque l&#8217;ordre &#8804; pour les types primitifs est l&#8217;identit&#233; (le pr&#233;groupe est
simple), les r&#232;gles (INDG) et (INDD) ne sont pas utilisables. De m&#234;me, s &#233;tant un type primi-
tif, la r&#232;gle (AD) est impossible. Donc, une d&#233;duction sans coupure ne comporte que l&#8217;axiome
s &#8804; s suivi &#233;ventuellement d&#8217;une ou plusieurs applications de la r&#232;gle (AG) qui correspond &#224; la
r&#232;gle de r&#233;&#233;criture R&#8594; appliqu&#233;e &#224; la partie gauche de l&#8217;in&#233;galit&#233;
</p>
<p>Lemme.R est fortement confluent et n&#339;th&#233;rien sur (P &#8746; P l)&#8727;.
</p>
<p>Preuve. Pour la confluence, il suffit de voir que lorsque la r&#232;gle R&#8594; est applicable &#224; deux en-
droits diff&#233;rents sur un m&#234;me mot, les deux motifs ne peuvent pas se recouper : XY blbZ R&#8592;
XalaY blbZ
</p>
<p>R
&#8594; XalaY Z. Donc, dans les deux cas nous pouvons r&#233;duire les deux mots &#224; XY Z :
</p>
<p>XY blbZ
R
&#8594; XY Z
</p>
<p>R
&#8592; XalaY Z.
</p>
<p>Le syst&#232;me est n&#339;th&#233;rien car toute application de la r&#232;gle diminue la longueur du mot de deux
lettres. Il ne peut pas y avoir de suite infinie de r&#233;&#233;critures.
</p>
<p>Lemme. Pour X, Y &#8712; (P &#8746; P l)&#8727; et p, q, s &#8712; P , si XplqY R&#8594; s alors p = q
</p>
<p>Preuve. Dans un mot, les lettres disparaissent deux &#224; deux. Une lettre de P l va dispara&#238;tre avec
une lettre de P qui se trouve &#224; sa droite et sym&#233;triquement une lettre de P avec une lettre de
P l &#224; sa gauche. Donc, un couple de deux lettres cons&#233;cutives pl et q ne peut que dispara&#238;tre au
m&#234;me moment lors de l&#8217;application de la r&#232;gle R&#8594; et p = q.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Remarques et perspectives sur les langages de pr&#233;groupe d&#8217;ordre 1/2
</p>
<p>Construction du point limite. Soient P = {p, q, r, s} et &#931; = {a, b, c, d, e}.
</p>
<p>&#8211; Pour n &#8805; 0, soient Gn = (&#931;,
</p>
<p>&#63729;&#63732;&#63732;&#63732;&#63730;
&#63732;&#63732;&#63732;&#63732;&#63731;
</p>
<p>a 7&#8594; (pl)nql
</p>
<p>b 7&#8594; qpql
</p>
<p>c 7&#8594; qrl
</p>
<p>d 7&#8594; rplrl
</p>
<p>e 7&#8594; rpns
</p>
<p>&#63740;&#63732;&#63732;&#63732;&#63741;
&#63732;&#63732;&#63732;&#63732;&#63742;
</p>
<p>, s) et Ln = L(P,=)(Gn).
</p>
<p>&#8211; Soient G&#8727; = (&#931;,
</p>
<p>&#63729;&#63732;&#63732;&#63732;&#63730;
&#63732;&#63732;&#63732;&#63731;
</p>
<p>a 7&#8594; ql
</p>
<p>b 7&#8594; qplql
</p>
<p>c 7&#8594; qrl
</p>
<p>d 7&#8594; rprl
</p>
<p>e 7&#8594; rs
</p>
<p>&#63740;&#63732;&#63732;&#63732;&#63741;
&#63732;&#63732;&#63732;&#63742;
</p>
<p>, s) et L&#8727; = L(P,=)(G&#8727;).
</p>
<p>Lemme. Pour n &#8805; 0, Ln = {abkcdke | 0 &#8804; k &#8804; n}.
</p>
<p>Preuve. Les lemmes pr&#233;c&#233;dents nous indiquent que seuls les mots de ab&#8727;cd&#8727;e peuvent apparte-
nir &#224; Ln. Pour i &#8805; 0 et j &#8805; 0, abicdje &#8712; ab&#8727;cd&#8727;e et nous avons :
</p>
<p>abicdje &#8712; Ln &#8656;&#8658;
</p>
<p>(pl)nql(qpql)iqrl(rplrl)jrpns
R&#8727;
&#8594; s &#8656;&#8658; (R&#8727; confluent et n&#339;th&#233;rien)
</p>
<p>(pl)npi(pl)jpns
R&#8727;
&#8594; s
</p>
<p>Quatre cas doivent &#234;tre analys&#233;s.
&#8211; Si i &#8804; n et j &#8804; n : abicdje &#8712; Ln &#8656;&#8658;
</p>
<p>(pl)n&#8722;ipn&#8722;js
R&#8727;
&#8594; s &#8656;&#8658;
</p>
<p>i = j
</p>
<p>&#8211; Si i &#8804; n et j &gt; n : abicdje &#8712; Ln &#8656;&#8658; (pl)n&#8722;i(pl)j&#8722;ns
R&#8727;
&#8594; s impossible !
</p>
<p>&#8211; Si i &gt; n et j &#8804; n : abicdje &#8712; Ln &#8656;&#8658; pi&#8722;npn&#8722;js
R&#8727;
&#8594; s impossible !
</p>
<p>&#8211; Si i &gt; n et j &gt; n : abicdje &#8712; Ln &#8656;&#8658; pi&#8722;n(pl)j&#8722;ns
R&#8727;
&#8594; s impossible !
</p>
<p>Lemme. L&#8727; = {abkcdke | k &#8805; 0}.
</p>
<p>Preuve. Comme pour le lemme pr&#233;c&#233;dent, seuls les mots de ab&#8727;cd&#8727;e peuvent appartenir &#224; Ln.
Pour i &#8805; 0 et j &#8805; 0, abicdje &#8712; ab&#8727;cd&#8727;e et nous avons :
</p>
<p>abicdje &#8712; L&#8727; &#8656;&#8658;
</p>
<p>ql(qplql)iqrl(rprl)jrs
R&#8727;
&#8594; s &#8656;&#8658;
</p>
<p>(pl)ipjpns
R&#8727;
&#8594; s &#8656;&#8658;
</p>
<p>i = j &#8656;&#8658;
abicdje &#8712; {abkcdke | k &#8805; 0}
</p>
<p>Th&#233;or&#232;me. L&#8727; est un point limite de la famille de langages (Lk)k&#8805;0 pour la classe des langages
de pr&#233;groupe libre (simple) d&#8217;ordre 1/2.
Preuve. Les lemmes pr&#233;c&#233;dents montrent que &#8704;k &#8805; 0, Lk ( Lk+1 et L =
</p>
<p>&#8899;
k&#8712;N Lk.
</p>
<p>Corollaire. Les classes des grammaires k-valu&#233;es de pr&#233;groupe libre d&#8217;ordre n/2, n &#8805; 1 ne
sont pas apprenables dans le mod&#232;le de Gold depuis des cha&#238;nes.
</p>
<p>4 Conclusion
</p>
<p>Nous avons montr&#233; que la classe des grammaires rigide de pr&#233;groupe libre n&#8217;est pas apprenable
&#224; partir des cha&#238;nes, m&#234;me si on limite fortement l&#8217;ordre des types (ordre 1/2).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Denis B&#233;chet, Annie Foret
</p>
<p>Un r&#233;sultat de non apprenabilit&#233; pour la classe des pr&#233;groupes rigides avait d&#233;j&#224; &#233;t&#233; pr&#233;sent&#233; &#224;
(Foret, 2002), le point limite alors obtenu &#233;tait une traduction d&#8217;un point limite pour le calcul
de Lambek (Foret &amp; Le Nir, 2002) qui est en fait &#224; l&#8217;ordre 2. On aurait pu s&#8217;attendre &#224; ce que
l&#8217;ordre 1/2 soit apprenable. Notre r&#233;sultat de non-apprenabilit&#233; peut donc surprendre mais il
pr&#233;cise les contours de ce qui peut &#234;tre entrepris ou non pour la mise au point d&#8217;algorithmes
d&#8217;acquisition.
</p>
<p>La non-apprenabilit&#233; &#224; partir des chaines (sans structures) indique sans doute le besoin de struc-
turer les exemples servant &#224; l&#8217;apprentissage. C&#8217;est une voie de recherche qui nous int&#233;resse tout
particuli&#232;rement.
</p>
<p>R&#233;f&#233;rences
V. ABRUSCI &amp; C. CASADIO, Eds. (2001). New Perspectives in Logic and Formal Linguisitics, Procee-
dings Vth ROMA Workshop. Bulzoni Editore.
BARGELLI D. &amp; LAMBEK J. (2001). An algebraic approach to french sentence structure. In (de Groote
et al., 2001).
BONATO R. &amp; RETOR&#201; C. (september 2001). Learning rigid lambek grammars and minimalist gram-
mars from structured sentences. Third workshop on Learning Language in Logic, Strasbourg.
BUSZKOWSKI W. (2001). Cut elimination for the lambek calculus of adjoints. In (Abrusci &amp; Casadio,
2001).
CASADIO C. &amp; LAMBEK J. (2001). An algebraic analysis of clitic pronouns in italian. In (de Groote
et al., 2001).
P. DE GROOTE, G. MORILL &amp; C. RETOR&#201;, Eds. (2001). Logical aspects of computational linguistics :
4th International Conference, LACL 2001, Le Croisic, France, June 2001, volume 2099. Springer-Verlag.
DUDAU-SOFRONIE, TELLIER T. (d&#233;cembre 2001). Learning categorial grammars from semantic types.
In 13e Amsterdam Colloquium, Palaiseau.
FORET A. (2002). Some unlearnability results for lambek categorial and pregroup grammars (unpubli-
shed). In Gracq, ESSLII, Trento, Italy.
FORET A. &amp; LE NIR Y. (2002). Lambek rigid grammars are not learnable from strings. In CO-
LING&#8217;2002, 19th International Conference on Computational Linguistics, Taipei, Taiwan.
KANAZAWA M. (1998). Learnable classes of categorial grammars. Studies in Logic, Language and
Information. FoLLI &amp; CSLI. distributed by Cambridge University Press.
LAMBEK J. (1999). Type grammars revisited. In A. LECOMTE, F. LAMARCHE &amp; G. PERRIER,
Eds., Logical aspects of computational linguistics : Second International Conference, LACL &#8217;97, Nancy,
France, September 22&#8211;24, 1997 ; selected papers, volume 1582 : Springer-Verlag.
LAMBEK J. (2001). Mathematics and the mind. In (Abrusci &amp; Casadio, 2001).</p>

</div></div>
</body></html>