<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apprentissage de relations morphologiques en corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Apprentissage de relations morphologiques en corpus
</p>
<p>Pierre Zweigenbaum, Fadila Hadouche, Natalia Grabar
Mission de recherche en Sciences et Technologies de l&#8217;Information M&#233;dicale,
</p>
<p>STIM/DPA/DSI, Assistance Publique &#8211; H&#244;pitaux de Paris
&amp; ERM 202, INSERM
</p>
<p>{pz,fha,ngr}@biomath.jussieu.fr http://www.biomath.jussieu.fr/
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Nous proposons une m&#233;thode pour apprendre des relations morphologiques d&#233;rivationnelles en
corpus. Elle se fonde sur la cooccurrence en corpus de mots formellement proches et un filtrage
compl&#233;mentaire sur la forme des mots d&#233;riv&#233;s. Elle est mise en &#339;uvre et exp&#233;riment&#233;e sur un
corpus m&#233;dical. Les relations obtenues avant filtrage ont une pr&#233;cision moyenne de 75,6 % au
5000&#232; rang (fen&#234;tre de 150 mots). L&#8217;examen d&#233;taill&#233; des d&#233;riv&#233;s adjectivaux d&#8217;un &#233;chantillon
de 633 noms du champ de l&#8217;anatomie montre une bonne pr&#233;cision de 85&#8211;91 % et un rappel
mod&#233;r&#233; de 32&#8211;34 %. Nous discutons ces r&#233;sultats et proposons des pistes pour les compl&#233;ter.
</p>
<p>We propose a method to learn derivational morphological relations from a corpus. It relies on
corpus cooccurrence of formally similar words, with additional filtering on the form of derived
words. It is implemented and tested on a medical corpus. The relations obtained before filtering
have an average precision of 75.6% at rank 5000 (150-word window). A detailed examination
of derived adjectives for a sample of 633 anatomy nouns shows a good precision of 85&#8211;91% and
a moderate recall of 32&#8211;34%. We discuss these results and propose directions for improvement.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Morphologie, apprentissage, corpus, langue de sp&#233;cialit&#233;, m&#233;decine
Morphology, learning, corpus, specialized language, medicine
</p>
<p>1 Introduction
</p>
<p>Pour palier le manque pour le fran&#231;ais de bases de connaissances morphologiques telles que
CELEX (Burnage, 1990), une base morphologique est en cours de construction pour le &#171; fran&#231;ais
g&#233;n&#233;ral &#187; dans le cadre du projet MorTAL (Hathout et al., 2002). Des bases compl&#233;mentaires
seront utiles pour les langues de sp&#233;cialit&#233; ; par exemple, le &#171; Specialist Lexicon &#187; de l&#8217;UMLS
fournit des donn&#233;es et des outils pour la morphologie flexionnelle et d&#233;rivationnelle de l&#8217;anglais
m&#233;dical (McCray et al., 1994). L&#8217;&#233;quivalent n&#8217;est pas encore disponible pour le fran&#231;ais m&#233;di-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Fadila Hadouche, Natalia Grabar
</p>
<p>cal ; le projet UMLF1 a donc pour objectif la constitution d&#8217;un lexique m&#233;dical francophone
incluant des connaissances flexionnelles et d&#233;rivationnelles (Zweigenbaum et al., 2003).
Pour faciliter ce travail, de la m&#234;me fa&#231;on que dans le projet MorTAL (Hathout et al., 2002),
il est utile d&#8217;assister automatiquement le recensement de ces liens morphologiques. Dans des
travaux ant&#233;rieurs, nous avons abord&#233; l&#8217;acquisition automatique de ressources morphologiques
&#224; partir de terminologies structur&#233;es (Grabar &amp; Zweigenbaum, 1999; Grabar &amp; Zweigenbaum,
2000). Cependant, la taille n&#233;cessairement limit&#233;e des terminologies disponibles limite le
vocabulaire et la variation morphologique qui y sont effectivement pr&#233;sents ; et le caract&#232;re
normatif des termes qui y sont consign&#233;s peut masquer des usages effectifs diff&#233;rents et donc
d&#8217;autres relations morphologiques. En compl&#233;ment des terminologies, nous avons donc cher-
ch&#233; &#224; explorer l&#8217;apprentissage de ce m&#234;me type de ressources morphologiques &#224; partir d&#8217;une
autre source : des corpus. C&#8217;est maintenant un lieu commun d&#8217;indiquer qu&#8217;il est de plus en plus
ais&#233;, essentiellement gr&#226;ce au Web, de se procurer des corpus d&#8217;une taille qui va grandissante.
Si l&#8217;on peut contr&#244;ler suffisamment les conditions de s&#233;lection des documents, on peut &#224; la fois
rester dans un domaine sp&#233;cifique (ici le domaine m&#233;dical) et repr&#233;senter des types de docu-
ments divers, favorisant la richesse du vocabulaire impliqu&#233;. Il reste &#224; concevoir une m&#233;thode
permettant de mettre au jour des relations morphologiques entre les mots du corpus construit.
De nombreux travaux ont &#233;t&#233; men&#233;s ces derni&#232;res ann&#233;es sur l&#8217;apprentissage de relations mor-
phologiques. Citons entre autres (Jacquemin, 1997; Xu &amp; Croft, 1998; Grabar &amp; Zweigenbaum,
1999; Gaussier, 1999; Dal et al., 1999; Daille, 1999; Hathout et al., 2002; Tanguy &amp; Hathout,
2002; Namer, 2002). Parmi les m&#233;thodes fond&#233;es sur corpus, certaines se situent &#224; la charni&#232;re
entre traitement automatique des langues et recherche d&#8217;information. Nous nous attarderons sur
la m&#233;thode de (Xu &amp; Croft, 1998), qui fonctionne en corpus sans terminologie ni r&#232;gles a pri-
ori. Les mots du corpus sont r&#233;duits par un raciniseur algorithmique &#171; agressif &#187; (Porter, 1980).
Deux mots racinis&#233;s &#224; la m&#234;me forme r&#233;duite et qui cooccurrent significativement plus qu&#8217;ils
ne le feraient s&#8217;ils &#233;taient ind&#233;pendants (variante de l&#8217;information mutuelle) sont consid&#233;r&#233;s
comme faisant partie de la m&#234;me classe d&#8217;&#233;quivalence morphologique.
</p>
<p>Ne disposant pas de l&#8217;&#233;quivalent du raciniseur de Porter pour le fran&#231;ais, nous proposons ici une
adaptation de cet algorithme &#224; notre probl&#232;me, avec de plus une focalisation sur l&#8217;identification
de mots d&#233;riv&#233;s (section 2). Nous mettons en &#339;uvre et &#233;valuons cet algorithme sur un corpus
m&#233;dical (section 3), puis discutons les r&#233;sultats obtenus (section 4).
</p>
<p>2 M&#233;thodes
</p>
<p>Nous pr&#233;sentons le corpus constitu&#233; pour les exp&#233;rimentations (section 2.1), la m&#233;thode pro-
pos&#233;e, mise en &#339;uvre initialement dans (Hadouche, 2002) (section 2.2), le filtrage suppl&#233;men-
taire des mots d&#233;riv&#233;s (section 2.3) et le mode d&#8217;&#233;valuation des r&#233;sultats obtenus (section 2.4).
</p>
<p>2.1 Constitution d&#8217;un corpus m&#233;dical
</p>
<p>Le corpus qui va nous servir de base de travail a &#233;t&#233; construit &#224; partir du Web en s&#8217;adossant au
catalogue CISMeF (Darmoni et al., 2000). CISMeF recense des sites m&#233;dicaux francophones
(11 000 en 2002) satisfaisant des crit&#232;res de qualit&#233;, et les indexe avec des mots cl&#233;s du thesaurus
</p>
<p>1ACI #02C0163, Minist&#232;re de la recherche, R&#233;seau national des technologies pour la sant&#233;, 2002&#8211;2004.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage de relations morphologiques en corpus
</p>
<p>MeSH, ce qui en fait un outil de choix pour constituer un corpus m&#233;dical. Nous avons collect&#233;
toutes les pages catalogu&#233;es sous le mot cl&#233; Signes et sympt&#244;mes. Pour nous affranchir des
probl&#232;mes li&#233;s aux adresses pointant sur des cadres (&#171; frames &#187;) ou constituant de simples som-
maires, nous avons &#233;galement collect&#233; les pages situ&#233;es un lien plus loin au-dessous de chaque
page indiqu&#233;e. Nous les avons ensuite converties en texte brut (dans le pr&#233;sent travail, seuls
les documents HTML ont &#233;t&#233; convertis), puis avons filtr&#233; les lignes non &#233;crites en fran&#231;ais en
adaptant la m&#233;thode et en reprenant les donn&#233;es de (Grefenstette &amp; Nioche, 2000). Nous avons
ensuite &#233;tiquet&#233; ce corpus avec TreeTagger (Schmid, 1994) coupl&#233; au lemmatiseur FLEMM
(Namer, 2000). Le corpus r&#233;sultant contient 4 627 documents et 5 204 901 occurrences de mots
(180 000 formes diff&#233;rentes et 142 000 lemmes diff&#233;rents). Nous avons conserv&#233; ses &#171; mots
pleins &#187; (nom, adjectif, verbe, adverbe), soit 2 055 419 occurrences. Beaucoup de ces &#171; mots &#187;
sont bruit&#233;s ; nous avons supprim&#233; des espaces ins&#233;cables qui &#233;taient rest&#233;s coll&#233;s en d&#233;but ou
en fin de mot, puis &#233;limin&#233; les mots qui contenaient encore des caract&#232;res non-alphanum&#233;riques
autres que le tiret. Il reste alors 2 041 627 occurrences (54 324 lemmes diff&#233;rents).
</p>
<p>2.2 Apprentissage de relations morphologiques en corpus
</p>
<p>Le principe fondateur de la m&#233;thode de (Grabar &amp; Zweigenbaum, 1999) est de (i) rep&#233;rer des
mots proches par la graphie et qui (ii) poss&#232;dent des liens s&#233;mantiques. La m&#233;thode de (Xu
&amp; Croft, 1998) proc&#232;de de m&#234;me, en raffinant le premier crit&#232;re gr&#226;ce &#224; un raciniseur existant
(Porter, 1980). Dans une terminologie structur&#233;e, nous avons instanci&#233; ce principe en rep&#233;rant
(i) des mots qui partagent la m&#234;me cha&#238;ne de caract&#232;res initiale et qui (ii) figurent dans des
termes reli&#233;s par des liens s&#233;mantiques (Grabar &amp; Zweigenbaum, 1999).
En corpus, les liens s&#233;mantiques vont s&#8217;appuyer sur la notion de continuit&#233; th&#233;matique : le fait
que le th&#232;me du discours ne change pas &#224; chaque phrase. Cette continuit&#233; se traduit g&#233;n&#233;rale-
ment par des liens th&#233;matiques lexicaux (redondance lexicale) : les mots employ&#233;s pour parler
d&#8217;un th&#232;me donn&#233; ont souvent des liens (par exemple, h&#244;pital, m&#233;decin, op&#233;rer). Ces liens
th&#233;matiques peuvent &#234;tre instanci&#233;s par des mots d&#8217;une m&#234;me famille morphologique (op&#233;rer,
op&#233;ration). Par cons&#233;quent, parmi les mots employ&#233;s &#224; l&#8217;int&#233;rieur d&#8217;un segment de texte th&#233;-
matiquement homog&#232;ne, on trouve souvent des mots d&#8217;une m&#234;me famille morphologique.
</p>
<p>La m&#233;thode de Xu et Croft approxime cette notion de continuit&#233; th&#233;matique &#224; l&#8217;aide d&#8217;une
fen&#234;tre glissante de N mots. La proximit&#233; morphologique entre deux mots leur est donn&#233;e
par le raciniseur de Porter. Nous reprenons cette m&#233;thode en rempla&#231;ant ce dernier par un
&#171; raciniseur &#187; encore plus agressif : la r&#233;duction aux c premiers caract&#232;res du mot (c = 4
dans nos exp&#233;rimentations). En r&#233;sum&#233;, nous recensons les mots qui partagent la m&#234;me cha&#238;ne
de caract&#232;res initiale de longueur sup&#233;rieure ou &#233;gale &#224; c et qui se trouvent &#171; souvent &#187; dans
une m&#234;me fen&#234;tre de M mots. Ce dernier crit&#232;re sera mis en &#339;uvre par une mesure statis-
tique d&#8217;association qui &#233;value dans quelle mesure cette cooccurrence est plus fr&#233;quente que ce
que donnerait le hasard. Nous avons choisi le rapport de vraisemblance (&#171; likelihood ratio &#187;)
(Manning &amp; Sch&#252;tze, 1999) : rapport &#955; = L(H1)
</p>
<p>L(H2)
entre la probabilit&#233; d&#8217;observer le nombre de
</p>
<p>cooccurrences du mot m2 avec le mot m1 dans l&#8217;hypoth&#232;se H1 o&#249; les mots sont ind&#233;pendants
et la probabilit&#233; d&#8217;observer leur nombre de cooccurrences dans l&#8217;hypoth&#232;se H2 o&#249; les mots sont
d&#233;pendants (on calcule &#8722;2 log &#955;).
Les donn&#233;es pour calculer ce rapport sont les suivantes. Probabilit&#233; de l&#8217;observation selon H1
(ind&#233;pendance) : L(H1) = b(c12, c1, p)b(c2 &#8722; c1, N &#8722; c1, p) ; probabilit&#233; de l&#8217;observation selon
H2 (d&#233;pendance) : L(H2) = b(c12, c1, p1)b(c2&#8722;c1, N&#8722;c1, p2) ; loi bin&#244;miale (probabilit&#233; d&#8217;une</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Fadila Hadouche, Natalia Grabar
</p>
<p>s&#233;quence de k succ&#232;s parmi n tirages) : b(k, n, p) = Cnk pk(1&#8722;p)n&#8722;k ; probabilit&#233;s &#233;l&#233;mentaires :
p = c12
</p>
<p>N
; p1 =
</p>
<p>c12
c1
</p>
<p>; p2 =
c2&#8722;c12
N&#8722;c1 ; c1 est le nombre d&#8217;occurrences du mot m1, c2 est le nombre de
</p>
<p>fen&#234;tres o&#249; appara&#238;t le mot m2, c12 est le nombre de fen&#234;tres o&#249; cooccurrent les mot m1 et m2,
N est la taille du corpus.
</p>
<p>(Xu &amp; Croft, 1998) appliquent un seuil d&#8217;association en-dessous duquel les couples cooccur-
rents sont &#233;limin&#233;s. Nous consid&#233;rons cependant que ce crit&#232;re d&#8217;association doit &#234;tre pris
comme un facteur parmi d&#8217;autres pour le classement des couples potentiellement en relation
morphologique plut&#244;t que pour leur &#233;limination directe. Notons que cette mesure d&#8217;association
est asym&#233;trique car elle d&#233;pend diff&#233;remment de la fr&#233;quence propre de chaque mot. Ainsi,
on a plus de chances d&#8217;observer le nom canal (481 occurrences) dans le voisinage de l&#8217;adjectif
canalaire (65 occurrences) que l&#8217;inverse ; notons que l&#8217;adjectif peut &#233;galement &#234;tre le plus
fr&#233;quent des deux (63 occurrences pour laryng&#233; contre 48 pour larynx). Nous conservons le
score d&#8217;association le plus fort des deux directions.
</p>
<p>2.3 Crit&#232;res de filtrage des mots d&#233;riv&#233;s
</p>
<p>Pour le projet UMLF, nous avons besoin plus particuli&#232;rement de connaissances d&#233;rivation-
nelles2 ; nous allons commencer ici par les couples nom &#8211; adjectif d&#233;riv&#233; par suffixation. Pour
les rep&#233;rer, nous avons ajout&#233; &#224; la m&#233;thode pr&#233;c&#233;dente des tests refl&#233;tant des caract&#233;ristiques
suppl&#233;mentaires des d&#233;riv&#233;s suffixaux :
</p>
<p>1. Pas de d&#233;rivation r&#233;gressive : la d&#233;rivation ajoute un suffixe3. Le test correspondant
est la diff&#233;rence de longueur entre les deux mots concern&#233;s ; pour conserver un peu de
souplesse, nous acceptons un d&#233;riv&#233; s&#8217;il contient jusqu&#8217;&#224; un caract&#232;re de moins que le
mot de base (par exemple, sacrum / sacr&#233;).
</p>
<p>2. D&#233;rivation plut&#244;t que composition : la composition savante assemble des morph&#232;mes,
d&#8217;origine g&#233;n&#233;ralement grecque ou latine, qui sont en moyenne plus longs que les suffixes
de la d&#233;rivation. Le syst&#232;me consid&#232;re comme suspect (et &#233;limine) un &#171; d&#233;riv&#233; &#187; qui
d&#233;passe de plus de 5 lettres le mot de base (par exemple, bronche / bronchopneumonique).
</p>
<p>3. Fr&#233;quence de la &#171; r&#232;gle &#187; : le m&#234;me op&#233;rateur morphologique s&#8217;applique g&#233;n&#233;ralement
&#224; plus d&#8217;un mot. Le test correspondant est le nombre de radicaux diff&#233;rents (cha&#238;nes
initiales communes maximales) sur lesquels l&#8217;op&#233;rateur est observ&#233;. En approximant un
op&#233;rateur par un couple de terminaisons substitu&#233;es (par exemple, -e / -ique dans kyste /
kystique), nous ne tenons pas compte des &#233;ventuelles adaptations morpho-phonologiques
et s&#233;parons artificiellement ses diverses r&#233;alisations. Par exemple, la r&#232;gle -e / -ique est
observ&#233;e 138 fois, et une r&#232;gle distincte -e / -que (ur&#233;mie / ur&#233;mique) 242 fois.
</p>
<p>Les crit&#232;res sont appliqu&#233;s dans l&#8217;ordre indiqu&#233; : les crit&#232;res de forme (1 et 2) &#233;liminent certains
couples candidats. Le crit&#232;re de fr&#233;quence de la r&#232;gle (3) s&#8217;applique ensuite : si plusieurs
adjectifs sont propos&#233;s pour le m&#234;me nom, celui correspondant &#224; la r&#232;gle d&#8217;application la plus
</p>
<p>2Nous utilisons le terme d&#233;rivation dans son sens plus restreint d&#8217;affixation, et nous nous focalisons sur la
suffixation. Rappelons que nous approximons cette suffixation par une proximit&#233; formelle ; parmi les couples
r&#233;pertori&#233;s, nous trouverons de &#171; vrais &#187; d&#233;riv&#233;s, mais &#233;galement des mots d&#8217;une m&#234;me famille morphologique
(articulation / articulaire). Dans les deux cas, nous parlons de couples de mots d&#233;riv&#233;s.
</p>
<p>3Nous ne nous int&#233;ressons pas aux conversions, o&#249; la forme reste inchang&#233;e ; elles sont faciles &#224; rep&#233;rer, et sont
&#233;limin&#233;es par notre m&#233;thode.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage de relations morphologiques en corpus
</p>
<p>fr&#233;quente est conserv&#233;. La force d&#8217;association est ensuite prise en consid&#233;ration pour d&#233;partager
deux couples produits par des r&#232;gles de fr&#233;quence identique : tendon / tendineux (fr&#233;q = 1,
association = 86) plut&#244;t que tendon / tendinite (fr&#233;q = 1, association = 11 &#8212; erreur d&#8217;&#233;tiquetage).
Enfin, les couples produits par une r&#232;gle de tr&#232;s faible fr&#233;quence ne sont conserv&#233;s que si leur
force d&#8217;association est suffisante. Nous avons fix&#233; exp&#233;rimentalement un seuil d&#8217;association de
50 pour les couples issus de r&#232;gles hapaxiques (une seule application) : cela &#233;limine colonne /
colobomateux (association = 10,94), mais conserve cortex / cortical (association = 173,07).
</p>
<p>2.4 Exp&#233;rimentation et &#233;valuation
</p>
<p>Nous avons proc&#233;d&#233; &#224; deux &#233;valuations. La premi&#232;re concerne la pr&#233;cision de l&#8217;ensemble des
couples cooccurrents relev&#233;s (section 2.2), avant filtrage suppl&#233;mentaire, en fonction de leur
score d&#8217;association. Pour cela, parmi les couples class&#233;s par ordre d&#233;croissant d&#8217;association,
nous avons examin&#233; la proportion cumul&#233;e de couples corrects en fonction du nombre de cou-
ples examin&#233;s, ainsi que le pourcentage local de ces cooccurrents satisfaisants (calcul&#233; sur des
tranches de 200 couples). Le r&#233;sultat est une courbe pr&#233;cision cumul&#233;e(rang) et une courbe
pr&#233;cision locale(rang).
La seconde &#233;valuation, plus sp&#233;cifique, mesure la pr&#233;cision et le rappel de la recherche des
d&#233;riv&#233;s adjectivaux (section 2.3) d&#8217;un &#233;chantillon de noms du champ s&#233;mantique de l&#8217;anatomie.
Cet &#233;chantillon a &#233;t&#233; construit en partant des termes d&#8217;anatomie (axe T, topographie) du R&#233;per-
toire d&#8217;anatomopathologie de la nomenclature SNOMED Internationale (C&#244;t&#233;, 1996). Nous
avons &#233;tiquet&#233; les termes de cette terminologie (Grabar &amp; Zweigenbaum, 2000) et pris le pre-
mier nom de chaque terme. Une liste de 633 noms a ainsi &#233;t&#233; obtenue, dont ceux qui commen-
cent par la lettre a suivent : abdomen, acinus, acromion, ac&#233;tabulum, adventice, ad&#233;nohypophyse, aile,
aine, aisselle, alv&#233;ole, amas, amnios, ampoule, amygdale, anastomose, angle, anneau, annexe, anse,
anth&#233;lix, antre, anus, aorte, apex, apon&#233;vrose, apophyse, appareil, appendice, aqueduc, arachno&#239;de,
arcade, arc, arri&#232;re, articulation, art&#232;re, art&#233;riole, ar&#233;ole, ar&#234;te, astragale, astrocyte, atlas, auricule
avorton, axis, axone.
</p>
<p>Les m&#233;thodes expos&#233;es ci-dessus ont &#233;t&#233; appliqu&#233;es au corpus CISMeF (section 2.1). La d&#233;tec-
tion des cooccurrents morphologiques a &#233;t&#233; test&#233;e avec des tailles de (demi-)fen&#234;tre de 10, 40,
100 et 150 mots (une demi-fen&#234;tre de M mots correspond &#224; une distance maximale de M mots
entre le mot pivot m1 centre de la fen&#234;tre et un cooccurrent m2). La seconde &#233;valuation s&#8217;est
faite avec les couples obtenus avec la fen&#234;tre de taille 100.
</p>
<p>Les traitements ont &#233;t&#233; effectu&#233;s &#224; l&#8217;aide de scripts Perl. &#201;tant donn&#233; leur nombre, le d&#233;compte
des cooccurrences ne peut se faire en m&#233;moire, et des &#171; hachages li&#233;s &#187; sont employ&#233;s. La
gestion des couples candidats, des r&#232;gles associ&#233;es et des mots d&#8217;anatomie a employ&#233;, par com-
modit&#233;, une base de donn&#233;es relationnelle (PostgreSQL).
</p>
<p>3 R&#233;sultats
</p>
<p>3.1 &#201;valuation de l&#8217;ensemble des cooccurrents trouv&#233;s
Avec une fen&#234;tre de taille 150, 48 002 couples cooccurrents diff&#233;rents (un seul ordre &#233;tant
conserv&#233;) sont relev&#233;s. La figure 1 montre les courbes pr&#233;cision cumul&#233;e(rang) et pr&#233;cision</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Fadila Hadouche, Natalia Grabar
</p>
<p>0
</p>
<p>0.2
</p>
<p>0.4
</p>
<p>0.6
</p>
<p>0.8
</p>
<p>1
</p>
<p>10000 20000 30000 40000
</p>
<p>pr
ec
</p>
<p>isi
on
</p>
<p>rang
</p>
<p>Precision cumulee
Precision locale (par 200 couples)
</p>
<p>Figure 1: Pr&#233;cision cumul&#233;e et locale des couples cooccurrents trouv&#233;s avant filtrage, en fonc-
tion de leur rang par ordre d&#233;croissant de score d&#8217;association.
</p>
<p>locale(rang). Par exemple, sur les 5 000 premiers cooccurrents trouv&#233;s avec une fen&#234;tre de 150
mots, 3778 &#233;taient corrects (pr&#233;cision cumul&#233;e = 75,6 %). Localement, les 200 couples trouv&#233;s
du rang 4801 au rang 5000 avaient une pr&#233;cision de 71,5 %, les 200 pr&#233;c&#233;dents une pr&#233;cision de
63,0 %. Les courbes montrent que la pr&#233;cision d&#233;cro&#238;t avec le rang, et que les derniers rangs ont
une pr&#233;cision locale tr&#232;s basse (moins de 20 % pour les 6000 derniers couples). Cela confirme
la pertinence de la mesure d&#8217;association. N&#233;anmoins, on continue &#224; trouver un nombre non
n&#233;gligeable de couples corrects m&#234;me aux rangs les plus &#233;lev&#233;s (728 parmi les 6000 derniers
couples). Il serait dommage d&#8217;&#233;liminer ces couples : le filtrage mis en place dans la suite des
traitements s&#8217;efforce de rep&#233;rer des couples pertinents parmi ceux dont l&#8217;association est faible.
</p>
<p>Parmi les erreurs, on trouve des omissions d&#8217;accents (hypoglyc&#233;mie / hypoglycemie), des erreurs
d&#8217;orthographe (travaille / travalle), des erreurs de segmentation (mots coll&#233;s : maladie / mal-
adiede), des pr&#233;fixes (tr&#232;s nombreux : trans, t&#233;l&#233;, hyper, hypo, iso, m&#233;so, etc.), des compos&#233;s
avec des tirets (chien / chien-guide, aldost&#233;rone / aldost&#233;rone-synthase), et des mots de dif-
f&#233;rentes langues (anglais, espagnol, allemand) qui n&#8217;ont pas &#233;t&#233; correctement filtr&#233;s. On rel&#232;ve
d&#8217;ailleurs de belles paires espagnoles (nuevo / nueva, infeccione / infectada) ou anglaises (child
/ children), qui illustrent le fait que la recherche d&#8217;associations est ind&#233;pendante de la langue...
Sur le m&#234;me registre, la lemmatisation ne traite souvent pas bien les mots latins.
</p>
<p>3.2 &#201;valuation sur un &#233;chantillon de noms d&#8217;anatomie
Le tableau 1 montre, &#224; titre d&#8217;exemple, les propositions d&#8217;adjectifs d&#233;riv&#233;s pour les noms
d&#8217;anatomie commen&#231;ant par la lettre a : sur 45 noms, 17 se voient proposer un adjectif d&#233;riv&#233;,
dont 13 sont consid&#233;r&#233;s comme corrects. Le tableau 2 donne les r&#233;sultats de l&#8217;&#233;valuation de la
pr&#233;cision et du rappel de la recherche de d&#233;riv&#233;s adjectivaux pour tous les noms d&#8217;anatomie (le
paragraphe suivant d&#233;finit les &#171; d&#233;riv&#233;s attendus &#187;). En bon accord avec l&#8217;exemple des noms en
a, on observe une pr&#233;cision de l&#8217;ordre de 85&#8211;91 % et un rappel de 32&#8211;34 %.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage de relations morphologiques en corpus
</p>
<p>Nom Adjectif # cooc loglike c.i.c.m. suf1 suf2 f
abdomen abdominal 101 584.2161 abdom en inal 2
acinus acini* 1 16.2631 acin us i 3
alv&#233;ole alv&#233;olaire 24 213.3956 alv&#233;ol e aire 72
amygdale amygdalien 8 100.2468 amygdal e ien 24
anastomose anastomotique 20 222.8728 anastomo se tique 29
angle anglais* 9 26.0384 angl e ais 2
annexe annexes* 1 10.4252 annexe s 46
antre antral 13 170.0993 antr e al 42
aorte aortique 170 1314.7484 aort e ique 131
apophyse apophysaire 3 39.6601 apophys e aire 72
appareil apparent* 16 52.1557 appare il nt 1
appendice appendiculaire 19 225.241 appendic e ulaire 5
articulation articulaire 216 1406.3482 articula tion ire 13
art&#233;riole art&#233;riolaire 15 99.9927 art&#233;riol e aire 72
ar&#233;ole ar&#233;olaire 2 27.5564 ar&#233;ol e aire 72
astrocyte astrocytaire 2 28.6077 astrocyt e aire 72
axone axonal 8 93.2184 axon e al 42
</p>
<p>Table 1: Proposition d&#8217;adjectifs d&#233;nominaux pour des noms du champ s&#233;mantique de
l&#8217;anatomie. # cooc = nombre de fen&#234;tres o&#249; les deux mots sont cooccurrents ; c.i.c.m. = cha&#238;ne
initiale commune maximale ; suf1 = cha&#238;ne finale du nom ; suf2 = cha&#238;ne finale de l&#8217;adjectif ; f
= fr&#233;quence de la r&#232;gle -suf1/-suf2. L&#8217;ast&#233;risque indique les couples &#171; incorrects &#187;.
</p>
<p>&#233;talon # noms # adj propos&#233;s # corrects pr&#233;cision rappel
d&#233;riv&#233;s attendus 633 235 200 85 % 32 %
tous les d&#233;riv&#233;s 633 235 213 91 % 34 %
</p>
<p>Table 2: Pr&#233;cision et rappel de la recherche d&#8217;adjectifs d&#233;nominaux (anatomie).
</p>
<p>3.3 &#201;tude des erreurs et du silence
Parmi les adjectifs d&#233;riv&#233;s propos&#233;s, on trouve 13 adjectifs que l&#8217;on peut consid&#233;rer comme
d&#233;riv&#233;s du nom correspondant, mais qui ne constituent pas l&#8217;adjectif relationnel attendu. Par
exemple, m&#233;dia / m&#233;diatique (m&#233;dial), sang / sanglant (sanguin), syst&#232;me / syst&#233;matique (sys-
t&#233;mique), embryon / embryonn&#233; (embryonnaire). Certains des adjectifs attendus sont form&#233;s sur
une base suppl&#233;tive, que notre m&#233;thode ne permet pas de rep&#233;rer : poil / poilu (pileux), figure
/ figur&#233; (facial), pointe / pointu (apical). Selon que l&#8217;on compte comme &#171; corrects &#187; ou pas
ces d&#233;riv&#233;s, on obtiendra deux mesures de pr&#233;cision (tableau 2) : l&#8217;une o&#249; tous les d&#233;riv&#233;s sont
accept&#233;s, et l&#8217;autre o&#249; seuls les d&#233;riv&#233;s attendus le sont.
</p>
<p>Dans le reste, 2 d&#233;rivations sont &#233;tymologiquement correctes, mais non pertinentes dans notre
contexte : partie / partiel, passage / passager. 4 compos&#233;s savants ont pass&#233; notre filtre
heuristique : monocyte / monocytogene, il&#233;on / il&#233;orectal, my&#233;locyte / my&#233;lo&#239;de, &#233;rythrob-
laste / &#233;rythrocytaire. 13 couples erron&#233;s proviennent d&#8217;un mauvais &#233;tiquetage de mots en tant
qu&#8217;adjectifs : mots erron&#233;s (c&#244;lonb), anglais (origin), ou fran&#231;ais (pochite). Enfin, 3 couples
constituent des erreurs pures et simples : appareil / apparent, angle / anglais, trou / trouble.
</p>
<p>Nous avons examin&#233; syst&#233;matiquement les raisons du silence pour les 45 noms d&#8217;anatomie
commen&#231;ant par la lettre a (tableau 3). Un nombre important de ces noms ne figuraient pas
dans le corpus (ou n&#8217;ont pas &#233;t&#233; &#233;tiquet&#233;s en tant que tels) ; au total, parmi les 633 noms exam-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Fadila Hadouche, Natalia Grabar
</p>
<p>Diagnostic Nombre % Exemples
Trouv&#233; automatiquement 13 29 abdomen / abdominal
Nom absent du corpus 4 9 ad&#233;nohypophyse, amnios
Adjectif absent ou inconnu 15 33 aile, aisselle, amas, anse
Cha&#238;ne initiale commune &lt; 4 6 13 art&#232;re / art&#233;riel, apex / apical
Non cooccurrents 4 9 apon&#233;vrose / apon&#233;vrotique
Base suppl&#233;tive 1 2 aine / inguinal
Conversion 1 2 arri&#232;re
Cooccurrents mais mal class&#233;s 1 2 annexe / annexiel
Total 45 99
</p>
<p>Table 3: Causes de silence pour les noms d&#8217;anatomie commen&#231;ant par a. Les cas pris en compte
dans une rang&#233;e ne le sont plus dans les rang&#233;es suivantes.
</p>
<p>in&#233;s, 89 (soit 14 %) ne se trouvaient pas dans le corpus, et ne pouvaient donc se voir attribuer
d&#8217;adjectif d&#233;riv&#233; par notre m&#233;thode. Un nombre encore plus grand (pr&#232;s d&#8217;un tiers) des noms,
pourtant pr&#233;sents dans le corpus, n&#8217;ont pas d&#8217;adjectif d&#233;riv&#233; identifiable dans le corpus. La
contrainte des quatre caract&#232;res initiaux &#233;limine des couples qui auraient &#233;t&#233; fortement associ&#233;s
(par exemple, art&#232;re / art&#233;riel, ampoule / ampullaire). Enfin, certains noms et adjectifs appari&#233;s
&#233;taient pr&#233;sents dans le corpus, mais pas ensemble dans une fen&#234;tre de 100 mots pleins.
</p>
<p>4 Discussion et conclusion
</p>
<p>La m&#233;thode propos&#233;e rep&#232;re un grand nombre de couples en relations morphologique, dont une
part importante est correcte (avec une fen&#234;tre de 150 mots, 70 % au 9000&#232; rang, 43,9 % soit
21 000 pour l&#8217;ensemble des 48 000 couples). Une proportion importante des erreurs peut de
plus &#234;tre filtr&#233;e en prenant en compte des crit&#232;res suppl&#233;mentaires (section 2.3) sur les couples
de mots d&#233;riv&#233;s. Ces crit&#232;res sont mis en &#339;uvre sur un &#233;chantillon de noms d&#8217;anatomie, dans
une t&#226;che de recherche d&#8217;adjectifs d&#233;riv&#233;s qui obtient une pr&#233;cision de 85 &#224; 91 %. La proportion
de noms pour lesquels un adjectif d&#233;riv&#233; est trouv&#233; reste cependant modeste (32 &#224; 34 %). Ceci
&#233;tant, la bonne pr&#233;cision obtenue permet d&#8217;envisager la combinaison de cette m&#233;thode avec
celle, de pr&#233;cision encore meilleure, appliqu&#233;e aux terminologies (Grabar &amp; Zweigenbaum,
2000), afin d&#8217;augmenter leur rappel total.
La m&#233;thode propos&#233;e ici poss&#232;de plusieurs limitations ; indiquons-en quelques unes. L&#8217;examen
manuel de l&#8217;ensemble des 48 000 couples est une t&#226;che fastidieuse, qui a pris plusieurs jours,
au cours de laquelle des erreurs d&#8217;appr&#233;ciation ont pu se produire (dans un sens comme dans
l&#8217;autre)4. Nous pensons n&#233;anmoins que leur influence reste marginale dans les chiffres produits.
Si l&#8217;on extrapole l&#8217;&#233;tude effectu&#233;e sur les noms en a, de l&#8217;ordre de 42 % (9+33) des couples
d&#233;riv&#233;s recherch&#233;s n&#8217;&#233;taient pas pr&#233;sents dans le corpus. Il faut toutefois temp&#233;rer cela par le
fait que certains des noms consid&#233;r&#233;s n&#8217;ont peut-&#234;tre pas d&#8217;adjectif d&#233;riv&#233; (amas, avorton ?).
En tout &#233;tat de cause, une premi&#232;re mesure sera d&#8217;&#233;largir et de diversifier le corpus : d&#8217;une part
encore sur le Web, d&#8217;autre part en puisant dans des genres qui n&#8217;y sont pas repr&#233;sent&#233;s, comme
les comptes rendus hospitaliers. La recherche d&#8217;une compl&#233;mentarit&#233; avec les mots pr&#233;sents
</p>
<p>4Les personnes int&#233;ress&#233;es par ces donn&#233;es peuvent contacter les auteurs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage de relations morphologiques en corpus
</p>
<p>dans les terminologies m&#233;dicales constituera la seconde mesure. Notons que si l&#8217;on met de c&#244;t&#233;
ces 42 % hors corpus, le rappel monte &#224; 50 % pour les mots qui sont effectivement repr&#233;sent&#233;s
dans le corpus : la moiti&#233; des couples pr&#233;sents sont trouv&#233;s.
</p>
<p>La contrainte des quatre caract&#232;res initiaux &#233;limine elle aussi des couples qui auraient &#233;t&#233; forte-
ment associ&#233;s. Il faudra examiner la quantit&#233; de bruit apport&#233;e par une descente &#224; trois carac-
t&#232;res, mais aussi rechercher des m&#233;thodes prenant plus largement en compte les autres lettres
des couples impliqu&#233;s (par exemple, poumon / pulmonaire). Les m&#233;thodes employ&#233;es pour
l&#8217;identification de cognats, par exemple (Kraif, 2001), pourraient trouver ici une application
suppl&#233;mentaires. Pour compl&#233;ter les principales causes de silence, pr&#232;s de 10 % des couples
recherch&#233;s (mots en a) &#233;taient pr&#233;sents dans le corpus, mais pas &#224; une distance inf&#233;rieure ou
&#233;gale &#224; 100 mots pleins. Ceux-ci pourraient &#234;tre d&#233;tect&#233;s par application des r&#232;gles acquises sur
le corpus ou sur des terminologies (c&#8217;est le cas des quatre couples en a).
Certains noms donnent naissance &#224; plusieurs adjectifs relationnels concurrents (pharynx / pha-
ryngien, pharyng&#233;). En cherchant &#224; isoler le meilleur candidat, notre m&#233;thode passe ces cas
sous silence. Il faudrait pour l&#8217;&#233;viter mettre en place un proc&#233;d&#233; permettant de montrer &#224; la
personne qui va valider ces d&#233;rivations les autres propositions du syst&#232;me.
</p>
<p>En parall&#232;le avec l&#8217;am&#233;lioration de la m&#233;thode, il reste &#224; tester son rappel sur d&#8217;autres ensem-
bles de noms : autres axes de la SNOMED, noms tir&#233;s d&#8217;autres terminologies m&#233;dicales, et plus
g&#233;n&#233;ralement les noms pr&#233;sents dans les corpus &#233;tudi&#233;s ; et bien s&#251;r sur d&#8217;autres types de d&#233;ri-
vations. D&#8217;autre part, sa pertinence sur des corpus non sp&#233;cialis&#233;s (par exemple, les habituels
corpus journalistiques) sera aussi &#224; examiner.
Enfin, le travail pr&#233;sent&#233; ici n&#8217;explore qu&#8217;une partie de l&#8217;arsenal possible pour l&#8217;acquisition mor-
phologique. La combinaison &#224; d&#8217;autres m&#233;thodes parmi celles mentionn&#233;es en d&#233;but d&#8217;article
devrait contribuer &#224; un recensement acc&#233;l&#233;r&#233; des d&#233;riv&#233;s de la langue m&#233;dicale (Zweigenbaum
et al., 2003), et pourquoi pas de ceux de la langue g&#233;n&#233;rale (Hathout et al., 2002).
</p>
<p>Remerciements
</p>
<p>Nous remercions le Dr. Roger A. C&#244;t&#233; de nous avoir gracieusement pr&#234;t&#233; une copie pr&#233;-com-
merciale de la version fran&#231;aise du R&#233;pertoire d&#8217;anatomopathologie de la nomenclature SNO-
MED Internationale, et l&#8217;&#233;quipe CISMeF du CHU de Rouen pour son Catalogue et Index des
Sites M&#233;dicaux Francophones, ressource pr&#233;cieuse pour le traitement automatique des langues.
</p>
<p>R&#233;f&#233;rences
BURNAGE G. (1990). CELEX - A Guide for Users. Nijmegen: Centre for Lexical Information, Univer-
sity of Nijmegen.
C&#212;T&#201; R. A. (1996). R&#233;pertoire d&#8217;anatomopathologie de la SNOMED internationale, v3.4. Universit&#233;
de Sherbrooke, Sherbrooke, Qu&#233;bec.
DAILLE B. (1999). Identification des adjectifs relationnels en corpus. In P. AMSILI, Ed., Actes de TALN
1999 (Traitement automatique des langues naturelles), p. 105&#8211;114, Carg&#232;se: ATALA.
DAL G., NAMER F. &amp; HATHOUT N. (1999). Construire un lexique d&#233;rivationnel : th&#233;orie et r&#233;alisations.
In P. AMSILI, Ed., Actes de TALN 1999 (Traitement automatique des langues naturelles), Carg&#232;se:</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Fadila Hadouche, Natalia Grabar
</p>
<p>ATALA.
DARMONI S. J., LEROY J.-P., THIRION B., BAUDIC F., DOUYERE M. &amp; PIOT J. (2000). CISMeF: a
structured health resource guide. Methods of Information in Medicine, 39(1), 30&#8211;35.
GAUSSIER E. (1999). Unsupervised learning of derivational morphology from inflectional lexicons.
In A. KEHLER &amp; A. STOLCKE, Eds., ACL workshop on Unsupervised Methods in Natural Language
Learning, College Park, Md.
GRABAR N. &amp; ZWEIGENBAUM P. (1999). Acquisition automatique de connaissances morphologiques
sur le vocabulaire m&#233;dical. In P. AMSILI, Ed., Actes de TALN 1999 (Traitement automatique des langues
naturelles), p. 175&#8211;184, Carg&#232;se: ATALA.
GRABAR N. &amp; ZWEIGENBAUM P. (2000). Automatic acquisition of domain-specific morphological
resources from thesauri. In Proceedings of RIAO 2000: Content-Based Multimedia Information Access,
p. 765&#8211;784, Paris, France: C.I.D.
GREFENSTETTE G. &amp; NIOCHE J. (2000). Estimation of English and non-English language use on the
WWW. In Proceedings of RIAO 2000: Content-Based Multimedia Information Access, p. 237&#8211;246,
Paris, France: C.I.D.
HADOUCHE F. (2002). Acquisition de resources morphologiques &#224; partir de corpus. DESS d&#8217;ing&#233;nierie
multilingue, Institut National des Langues et Civilisations Orientales, Paris.
HATHOUT N., NAMER F. &amp; DAL G. (2002). An experimental constructional database: the MorTAL
project. In P. BOUCHER, Ed., Many morphologies, p. 178&#8211;209. Somerville, MA: Cascadilla Press.
JACQUEMIN C. (1997). Guessing morphology from terms and corpora. In Proc 20th ACM SIGIR, p.
156&#8211;167, Philadelphia, PA.
KRAIF O. (2001). Exploitation des cognats pour l&#8217;alignement : architecture et &#233;valuation. Traitement
automatique des langues, 42(3).
MANNING C. D. &amp; SCH&#220;TZE H. (1999). Foundations of Statistical Natural Language Processing.
Cambridge, MA: MIT Press.
MCCRAY A. T., SRINIVASAN S. &amp; BROWNE A. C. (1994). Lexical methods for managing variation
in biomedical terminologies. In Proc 18th Annu Symp Comput Appl Med Care, p. 235&#8211;239, Washington:
Mc Graw Hill.
NAMER F. (2000). FLEMM : un analyseur flexionnel du fran&#231;ais &#224; base de r&#232;gles. Traitement Automa-
tique des Langues, 41(2), 523&#8211;547.
NAMER F. (2002). Acquisition automatique de sens &#224; partir d&#8217;op&#233;rations morphologiques en fran&#231;ais :
&#233;tudes de cas. In J.-M. PIERREL, Ed., Actes de TALN 2002 (Traitement automatique des langues na-
turelles), Nancy: ATALA ATILF.
PORTER M. F. (1980). An algorithm for suffix stripping. Program, 14, 130&#8211;137.
SCHMID H. (1994). Probabilistic part-of-speech tagging using decision trees. In Proceedings of the
International Conference on New Methods in Language Processing, p. 44&#8211;49, Manchester, UK.
TANGUY L. &amp; HATHOUT N. (2002). Webaffix : un outil d&#8217;acquisition morphologique d&#233;rivationnelle
&#224; partir du Web. In J.-M. PIERREL, Ed., Actes de TALN 2002 (Traitement automatique des langues
naturelles), p. 245&#8211;254, Nancy: ATALA ATILF.
XU J. &amp; CROFT B. W. (1998). Corpus-based stemming using co-occurrence of word variants. ACM
Transactions on Information Systems, 16(1), 61&#8211;81.
ZWEIGENBAUM P., BAUD R., BURGUN A., NAMER F., JARROUSSE E., GRABAR N., RUCH P., LE
DUFF F., THIRION B. &amp; DARMONI S. (2003). Towards a unified medical lexicon for French. In R.
BAUD, M. FIESCHI, P. LE BEUX &amp; P. RUCH, Eds., Actes Medical Informatics Europe, p. 415&#8211;420,
Amsterdam: IOS Press.</p>

</div></div>
</body></html>