<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Filtrage th&#233;matique d&#8217;un r&#233;seau de collocations</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Filtrage th&#233;matique d&#8217;un r&#233;seau de collocations 
</p>
<p>Olivier Ferret 
</p>
<p>CEA &#8211; LIST/LIC2M 
92265 Fontenay-aux-Roses Cedex 
</p>
<p>olivier.ferret@cea.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
Les r&#233;seaux lexicaux de type WordNet pr&#233;sentent une absence de relations de nature th&#233;mati-
que, relations pourtant tr&#232;s utiles dans des t&#226;ches telles que le r&#233;sum&#233; automatique ou 
l&#8217;extraction d&#8217;information. Dans cet article, nous proposons une m&#233;thode visant &#224; construire 
automatiquement &#224; partir d&#8217;un large corpus un r&#233;seau lexical dont les relations sont pr&#233;f&#233;ren-
tiellement th&#233;matiques. En l&#8217;absence d&#8217;utilisation de ressources de type dictionnaire, cette 
m&#233;thode se fonde sur un principe d&#8217;auto-amor&#231;age : un r&#233;seau de collocations est d&#8217;abord 
construit &#224; partir d&#8217;un corpus puis filtr&#233; sur la base des mots du corpus que le r&#233;seau initial a 
permis de s&#233;lectionner. Nous montrons au travers d&#8217;une &#233;valuation portant sur la segmenta-
tion th&#233;matique que le r&#233;seau final, bien que de taille bien inf&#233;rieure au r&#233;seau initial, permet 
d&#8217;obtenir les m&#234;mes performances que celui-ci pour cette t&#226;che. 
</p>
<p>Lexical networks such as WordNet are known to have a lack of topical relations although 
these ones are very useful for tasks such as text summarization or information extraction. In 
this article, we present a method for automatically building from a large corpus a lexical net-
work whose relations are preferably topical ones. As it does not rely on resources such as dic-
tionaries, this method is based on self-bootstrapping: a collocation network is first built from 
a corpus and then, is filtered by using the words of the corpus that are selected by the initial 
network. We report an evaluation about topic segmentation showing that the results got with 
the filtered network are the same as the results got with the initial network although the first 
one is signicantly smaller than the second one. 
</p>
<p>Mots Cl&#233;s&#8211; Keywords 
Collocations, cooccurrences lexicales, r&#233;seaux lexicaux th&#233;matiques, analyse th&#233;matique 
Collocations, lexical cooccurrences, topical lexical networks, topic analysis 
</p>
<p>1 Introduction 
Depuis l&#8217;av&#232;nement de WordNet (Miller, 1995), un vif int&#233;r&#234;t s&#8217;est d&#233;velopp&#233; autour des r&#233;-
seaux lexico-s&#233;mantiques. Ainsi que l&#8217;ont soulign&#233; certains auteurs (Harabagiu et al., 1999), 
les r&#233;seaux de type WordNet pr&#233;sentent n&#233;anmoins un certain nombre d&#8217;insuffisances. L&#8217;une 
d&#8217;entre elles est l&#8217;absence en leur sein de relations th&#233;matiques. Ces relations caract&#233;risent 
l&#8217;appartenance de deux mots &#224; un m&#234;me th&#232;me ou &#224; une m&#234;me situation comme c&#8217;est le cas </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Ferret 
</p>
<p>dans les couples docteur-h&#244;pital ou cambrioleur-policier. Ces connaissances th&#233;matiques 
s&#8217;av&#232;rent pourtant tr&#232;s utiles dans des domaines tels que l&#8217;extraction d&#8217;information ou le r&#233;-
sum&#233; automatique (Harabagiu, Maiorano, 2002) afin de d&#233;terminer ce qui est caract&#233;ristique 
d&#8217;une situation ou d&#8217;un th&#232;me. La difficult&#233; d&#8217;en dresser un inventaire manuel du fait leur tr&#232;s 
vaste &#233;tendue a d&#233;bouch&#233; sur un certain nombre de travaux concernant leur acquisition auto-
matique, soit sous la forme de relations th&#233;matiques constituant un r&#233;seau d&#8217;associations lexi-
cales ou bien de configurations de mots relatifs &#224; un m&#234;me th&#232;me. 
</p>
<p>La premi&#232;re approche est illustr&#233;e par le travail de Harabagiu et Moldovan (Harabagiu, Maio-
rano, 2002) concernant l&#8217;extraction de relations th&#233;matiques de WordNet par l&#8217;exploitation 
des d&#233;finitions associ&#233;es aux synsets. La seconde approche est typiquement repr&#233;sent&#233;e par le 
travail d&#233;crit dans (Lin, Hovy, 2000) portant sur l&#8217;apprentissage supervis&#233; de signatures th&#233;-
matiques, repr&#233;sentations de th&#232;mes obtenues par s&#233;lection et pond&#233;ration du vocabulaire 
d&#8217;un ensemble de textes relatifs &#224; ces th&#232;mes. (Ferret, Grau, 1998) ont montr&#233; comment des 
repr&#233;sentations du m&#234;me type peuvent &#234;tre apprises de fa&#231;on non supervis&#233;e. &#192; mi-chemin 
entre ces deux approches, (Agirre et al., 2001) construit des signatures th&#233;matiques centr&#233;es 
sur des synsets de WordNet. Les connaissances associ&#233;es aux synsets sont utilis&#233;es pour s&#233;-
lectionner des textes en relation avec eux, textes dont on extrait ensuite le vocabulaire consti-
tutif des signatures th&#233;matiques. 
</p>
<p>En d&#233;pit de leur int&#233;r&#234;t, les travaux s&#8217;appuyant sur WordNet ont intrins&#232;quement un impact 
limit&#233; par le fait que WordNet est une ressource pour le moment unique quant &#224; son degr&#233; 
d&#8217;&#233;laboration et que ces travaux en exploitent tous les aspects, en particulier ceux absents des 
r&#233;seaux de m&#234;me type (par exemple les d&#233;finitions). Nous avons fait au contraire le choix 
d&#8217;une approche ne n&#233;cessitant pas de pr&#233;-requis importants, ce qui permet de l&#8217;appliquer po-
tentiellement &#224; un grand nombre de langues en dehors de l&#8217;anglais. La constitution d&#8217;un r&#233;-
seau de collocations, i.e. un ensemble de collocations li&#233;es par l&#8217;interm&#233;diaire de leurs mots, 
appara&#238;t &#224; cet &#233;gard comme une solution int&#233;ressante. Mais compte tenu de l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; 
des relations sous-jacentes aux collocations, elle n&#233;cessite l&#8217;adjonction d&#8217;un processus de fil-
trage destin&#233; &#224; retenir pr&#233;f&#233;rentiellement les collocations de nature th&#233;matique. Pour r&#233;aliser 
ce filtrage, nous avons &#233;labor&#233; une m&#233;thode fond&#233;e sur l&#8217;amor&#231;age. Le r&#233;seau de collocations 
&#224; filtrer est utilis&#233; par un syst&#232;me d&#8217;analyse th&#233;matique afin de mettre en &#233;vidence dans le 
corpus de construction de ce r&#233;seau des segments th&#233;matiquement homog&#232;nes et au sein de 
ces derniers, les mots caract&#233;risant leur th&#232;me. Un r&#233;seau de collocations plus sp&#233;cifiquement 
th&#233;matiques peut alors &#234;tre construit en enregistrant les cooccurrences au sein de ces seg-
ments. Ce r&#233;seau est finalement utilis&#233; pour &#233;liminer du r&#233;seau initial celles de ses colloca-
tions qui sont les moins th&#233;matiques. 
</p>
<p>2 Construction du r&#233;seau de collocations initial 
Le corpus sur lequel nous nous sommes appuy&#233;s pour ce travail est constitu&#233; de 24 mois du 
journal Le Monde s&#233;lectionn&#233;s entre 1990 et 1994, ce qui repr&#233;sente environ 39 millions de 
mots. Afin de construire le r&#233;seau de collocations initial, ce corpus a d&#8217;abord &#233;t&#233; pr&#233;-trait&#233; 
afin de caract&#233;riser les textes par leurs mots les plus th&#233;matiquement significatifs, en 
l&#8217;occurrence les noms, les verbes et les adjectifs, donn&#233;s sous forme lemmatis&#233;e. Les ambi-
gu&#239;t&#233;s de lemmatisation ont &#233;t&#233; lev&#233;es gr&#226;ce &#224; un &#233;tiqueteur morpho-syntaxique. Les colloca-
tions ont ensuite &#233;t&#233; extraites en utilisant une fen&#234;tre glissante selon la m&#233;thode d&#233;crite dans 
(Church, Hanks, 1990). Les param&#232;tres de cette extraction ont &#233;t&#233; fix&#233;s afin de favoriser la 
capture de relations th&#233;matiques : une fen&#234;tre assez large (20 mots), respectant la fin des tex-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Filtrage th&#233;matique de collocations 
</p>
<p>tes et ne conservant pas l&#8217;ordre des collocations. Nous avons comme Church et Hanks adopt&#233; 
une &#233;valuation de l&#8217;information mutuelle en tant que mesure de coh&#233;sion des collocations, 
mesure normalis&#233;e dans notre cas par l&#8217;information mutuelle maximale relative au corpus. 
Apr&#232;s filtrage des collocations les moins significatives (coh&#233;sion &lt; 0,1 et moins de 10 occur-
rences), nous avons obtenu un r&#233;seau de 22.749 mots et 2.572.589 collocations. 
</p>
<p>3 M&#233;thode de filtrage th&#233;matique 
3.1 Construction des Unit&#233;s Th&#233;matiques 
</p>
<p>La premi&#232;re &#233;tape du filtrage th&#233;matique d&#8217;un r&#233;seau de collocations consiste &#224; d&#233;finir, &#224; par-
tir du corpus ayant servi &#224; la construction de ce r&#233;seau, un ensemble d&#8217;unit&#233;s textuelles pr&#233;-
sentant les deux caract&#233;ristiques suivantes : chaque unit&#233; correspond &#224; un segment de texte 
renvoyant &#224; un seul th&#232;me et les mots qu&#8217;elle contient sont les mots de ce segment repr&#233;senta-
tifs de ce th&#232;me. Ces unit&#233;s, d&#233;j&#224; introduites dans (Ferret, Grau, 1998), sont appel&#233;es Unit&#233;s 
Th&#233;matiques (UTs). Leur construction s&#8217;appuie sur l&#8217;utilisation conjointe d&#8217;un outil de seg-
mentation th&#233;matique et du r&#233;seau de collocations &#224; filtrer. L&#8217;outil de segmentation th&#233;mati-
que permet de d&#233;limiter des segments th&#233;matiquement homog&#232;nes tandis que le r&#233;seau de 
collocations sert de support &#224; la s&#233;lection de mots caract&#233;risant les th&#232;mes des segments. Dans 
le cas pr&#233;sent, nous faisons appel pour la construction des UTs &#224; TOPICOLL (Ferret, 2002), un 
outil d&#8217;analyse th&#233;matique qui r&#233;alise simultan&#233;ment ces deux t&#226;ches en exploitant les mots 
qu&#8217;il s&#233;lectionne dans un r&#233;seau de collocations pour segmenter les textes. 
</p>
<p>Dans le r&#233;seau de collocations initial, beaucoup de collocations sont compos&#233;es de mots qui, 
de par leur g&#233;n&#233;ralit&#233;, se retrouvent dans de nombreux contextes diff&#233;rents et ne sont donc pas 
th&#233;matiquement discriminants. Le m&#233;canisme de s&#233;lection de TOPICOLL repose sur 
l&#8217;hypoth&#232;se que dans un segment de texte renvoyant &#224; un contexte th&#233;matique sp&#233;cifique, il 
existe dans le r&#233;seau de collocations davantage de liens, directs ou par l&#8217;interm&#233;diaire d&#8217;un 
autre mot du r&#233;seau, entre les mots de ce segment lorsque ceux-ci sont repr&#233;sentatifs du th&#232;me 
du segment que lorsque ce sont des mots assez g&#233;n&#233;raux ou repr&#233;sentatifs d&#8217;un autre th&#232;me. 
Les r&#233;sultats obtenus par TOPICOLL en mati&#232;re de segmentation th&#233;matique (Ferret, 2002) 
tendent &#224; prouver que cette hypoth&#232;se est justifi&#233;e. 
Cette hypoth&#232;se se concr&#233;tise dans TOPICOLL au travers du processus suivant : une fen&#234;tre 
d&#233;limitant l&#8217;espace de focalisation de l&#8217;analyse est d&#233;plac&#233;e sur le texte consid&#233;r&#233;. Cette fen&#234;-
tre contient sous forme lemmatis&#233;e les mots pleins du texte issus de son pr&#233;-traitement, iden-
tique &#224; celui appliqu&#233; aux textes lors de la construction du r&#233;seau de collocations initial. &#192; 
chaque position de la fen&#234;tre, on s&#233;lectionne les mots du r&#233;seau de collocations qui sont li&#233;s &#224; 
au moins trois mots de la fen&#234;tre. Il est &#224; noter que sont ainsi s&#233;lectionn&#233;s &#224; la fois des mots 
de l&#8217;espace du texte d&#233;limit&#233; par la fen&#234;tre de focalisation et des mots du r&#233;seau n&#8217;en faisant 
pas partie. Ces derniers sont appel&#233;s mots inf&#233;r&#233;s. Pour limiter l&#8217;impact du bruit pr&#233;sent dans 
le r&#233;seau initial, une &#233;limination pr&#233;alable des collocations dont la valeur de coh&#233;sion est inf&#233;-
rieure &#224; 0,12 est r&#233;alis&#233;e. Ce seuil a &#233;t&#233; d&#233;termin&#233; exp&#233;rimentalement sur la base des perfor-
mances de TOPICOLL en mati&#232;re de segmentation th&#233;matique. 
</p>
<p>Les mots s&#233;lectionn&#233;s pour chaque position de la fen&#234;tre sont conserv&#233;s et finalement, ne sont 
retenus pour constituer l&#8217;UT associ&#233;e &#224; un segment que les mots ayant &#233;t&#233; s&#233;lectionn&#233;s pour 
au moins 75% des positions du segment, condition reprise de (Ferret, Grau, 1998) et visant de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Ferret 
</p>
<p>nouveau &#224; r&#233;duire le nombre de mots s&#233;lectionn&#233;s sur la base de collocations non th&#233;mati-
ques. 
</p>
<p>3.2 Filtrage des Unit&#233;s Th&#233;matiques 
</p>
<p>Les UTs ainsi construites font l&#8217;objet d&#8217;un double filtrage. Le premier vise &#224; &#233;carter les UTs 
peu significatives sur le plan th&#233;matique. Certains textes entrem&#234;lent si &#233;troitement plusieurs 
th&#232;mes qu&#8217;il est impossible de les diff&#233;rencier gr&#226;ce &#224; un d&#233;coupage lin&#233;aire du texte. Le r&#233;-
sultat des m&#233;thodes de segmentation existantes n&#8217;est alors pas significatif et les UTs construi-
tes n&#8217;ont pas l&#8217;homog&#233;n&#233;it&#233; th&#233;matique qui devrait les caract&#233;riser. Nous consid&#233;rons qu&#8217;un 
tel cas de figure est d&#233;tect&#233; lorsque aucun mot d&#8217;un segment ne figure parmi les mots de l&#8217;UT 
qui lui est associ&#233;e. Au-del&#224; de cette premi&#232;re contrainte, nous avons choisi de ne retenir que 
les UTs contenant au moins deux mots de leur segment originel. Un th&#232;me &#233;tant une configu-
ration d&#8217;unit&#233;s s&#233;mantiques, nous consid&#233;rons en effet qu&#8217;il doit &#234;tre repr&#233;sent&#233; au minimum 
par deux de ses mots pour &#234;tre attest&#233;. 
</p>
<p>Le second filtrage est interne &#224; chaque UT et s&#8217;op&#232;re parmi ceux de ses mots ne faisant pas 
partie de son segment originel, c&#8217;est-&#224;-dire les mots inf&#233;r&#233;s. Ne conserver que les mots du 
segment originel serait un peu restrictif pour la construction d&#8217;un r&#233;seau de collocations th&#233;-
matique dans la mesure o&#249; leur nombre est faible (rarement plus de trois). N&#233;anmoins, dans la 
perspective du filtrage du r&#233;seau de collocations initial, il est n&#233;cessaire de restreindre les 
mots inf&#233;r&#233;s &#224; ceux suppos&#233;s les plus th&#233;matiquement proches des mots du segment s&#233;lec-
tionn&#233;s. Nous avons donc appliqu&#233; le m&#234;me principe de s&#233;lection que pr&#233;c&#233;demment : un mot 
inf&#233;r&#233; est retenu s&#8217;il est li&#233;, par l&#8217;interm&#233;diaire du r&#233;seau de collocations, &#224; au moins trois 
mots s&#233;lectionn&#233;s du segment. Par ailleurs, nous avons aussi impos&#233; un seuillage assez 
restrictif en fr&#233;quence et en coh&#233;sion concernant les collocations supportant ces liens 
(coh&#233;sion &#149; 0,15 et fr&#233;quence &#149; 15). 
</p>
<p>3.3 Construction d&#8217;un r&#233;seau de collocations th&#233;matiques 
</p>
<p>&#192; l&#8217;issue de l&#8217;&#233;tape pr&#233;c&#233;dente, on dispose d&#8217;un ensemble d&#8217;UTs rassemblant chacune des 
mots que l&#8217;on suppose assez fortement li&#233;s sur le plan th&#233;matique. En enregistrant les cooc-
currences entre ces mots sur l&#8217;ensemble des UTs produites &#224; partir du corpus ayant permis la 
construction du r&#233;seau initial, on obtient un ensemble de collocations qui sont pr&#233;f&#233;rentielle-
ment de nature th&#233;matique, m&#234;me si elles ne sont pas exclusivement de ce type compte tenu 
du caract&#232;re non supervis&#233; de leur s&#233;lection. La fr&#233;quence d&#8217;une collocation est dans ce cas 
directement donn&#233;e par le nombre d&#8217;UTs dans lesquelles les deux mots qui la constituent sont 
pr&#233;sents simultan&#233;ment. Aucune diff&#233;renciation n&#8217;est r&#233;alis&#233;e en fonction de l&#8217;origine des 
mots constituant les UTs. 
</p>
<p>3.4 Filtrage du r&#233;seau initial 
</p>
<p>Le r&#233;seau de collocations obtenu &#224; l&#8217;issue de l&#8217;&#233;tape pr&#233;c&#233;dente regroupe un sous-ensemble 
des collocations du r&#233;seau initial mais &#233;galement des collocations n&#8217;y figurant pas. Parmi el-
les, certaines sont pertinentes sur le plan th&#233;matique mais d&#8217;autres ne le sont pas. Comme il 
est difficile de juger globalement du rapport entre les collocations int&#233;ressantes et celles qui 
ne le sont pas, il para&#238;t plus prudent dans un premier temps de laisser de c&#244;t&#233; ces nouvelles 
collocations et de ne retenir que celles qui sont communes avec le r&#233;seau initial. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Filtrage th&#233;matique de collocations 
</p>
<p>Le r&#233;seau de collocations th&#233;matiques n&#8217;est de ce fait utilis&#233; que comme filtre du r&#233;seau de 
collocations initial. Pr&#233;alablement, il est lui-m&#234;me filtr&#233; afin de supprimer les collocations 
dont la fr&#233;quence est trop faible, ce qui est signe de leur absence de repr&#233;sentativit&#233;. En prati-
que, seules sont conserv&#233;es les collocations th&#233;matiques de fr&#233;quence sup&#233;rieure &#224; 5. Cette 
valeur a &#233;t&#233; d&#233;termin&#233;e de mani&#232;re exp&#233;rimentale sur la base de l&#8217;utilisation du r&#233;seau filtr&#233; 
final (cf. section 4). Le filtrage du r&#233;seau initial se limite &#224; ne retenir que le sous-ensemble de 
ses collocations &#233;galement pr&#233;sentes dans le r&#233;seau th&#233;matique. Les valeurs de fr&#233;quence et 
de coh&#233;sion des collocations ainsi retenues sont celles du r&#233;seau initial, conform&#233;ment &#224; la 
perspective adopt&#233;e de filtrage du r&#233;seau initial. 
</p>
<p>4 R&#233;sultats et &#233;valuation 
Nous avons appliqu&#233; la proc&#233;dure de filtrage pr&#233;sent&#233;e au r&#233;seau de collocations de la sec-
tion 2. La premi&#232;re &#233;tape a conduit &#224; un ensemble de 382.208 UTs dont seulement 59% ont 
&#233;t&#233; conserv&#233;es apr&#232;s filtrage. Le r&#233;seau construit &#224; partir de ces UTs est constitu&#233; de 11.674 
mots et de 2.864.473 collocations. Parmi celles-ci, environ 70% &#233;taient nouvelles par rapport 
au r&#233;seau initial et n&#8217;ont donc pas &#233;t&#233; retenues. Finalement, le r&#233;seau filtr&#233; comporte 7.223 
mots et 400.963 collocations. 
</p>
<p>&#201;valuer la qualit&#233; th&#233;matique d&#8217;un r&#233;seau de collocations est, comme toute t&#226;che d&#8217;&#233;valuation 
d&#8217;une ressource linguistique, assez difficile. Le jugement humain direct &#233;tant peu praticable 
de par la taille des donn&#233;es &#224; consid&#233;rer et un r&#233;seau lexical th&#233;matique de r&#233;f&#233;rence 
n&#8217;existant pas pour le fran&#231;ais, nous avons opt&#233; pour une &#233;valuation indirecte. Celle-ci a &#233;t&#233; 
r&#233;alis&#233;e au travers de l&#8217;utilisation par TOPICOLL d&#8217;un r&#233;seau de collocations pour assurer une 
t&#226;che de segmentation th&#233;matique. Cette t&#226;che consiste &#224; red&#233;couvrir les fronti&#232;res d&#8217;un en-
semble de textes concat&#233;n&#233;s, textes assimilables &#224; des paragraphes. L&#8217;&#233;valuation a &#233;t&#233; r&#233;alis&#233;e 
sur un ensemble de 49 textes longs de 133 mots en moyenne, extraits du journal Le Monde 
(1995) et couvrant 11 th&#232;mes. Les r&#233;sultats du Tableau 1 sont des moyennes obtenues sur 10 
ordonnancements diff&#233;rents de ces textes. La pr&#233;cision est d&#233;finie par Nc / Nb et le rappel par 
Nc / D, o&#249; Nb est le nombre de bornes trouv&#233;es par TOPICOLL, Nc est le nombre de bornes trou-
v&#233;es correctes et D le nombre total de fronti&#232;res de texte. 
</p>
<p>Syst&#232;mes Rappel Pr&#233;cision F1-mesure 
TOPICOLL1 (r&#233;seau non filtr&#233;) 0,85 0,79 0,82 
</p>
<p>TOPICOLL2 (filtrage th&#233;matique) 0,85 0,79 0,82 
TOPICOLL3 (filtrage fr&#233;quentiel) 0,83 0,71 0,77 
</p>
<p>Tableau 1 : Pr&#233;cision/rappel de la segmentation pour le corpus du Monde 
</p>
<p>TOPICOLL1 correspond &#224; une version de TOPICOLL avec le r&#233;seau de collocations initial, 
TOPICOLL2, avec le r&#233;seau filtr&#233; th&#233;matiquement et enfin TOPICOLL3, avec un r&#233;seau de taille 
la plus proche possible du r&#233;seau filtr&#233; th&#233;matiquement mais obtenu par un seuillage de la 
fr&#233;quence (&#224; 14 occurrences) et de la coh&#233;sion (&#224; 0,14) des collocations. Dans ce dernier cas, 
le r&#233;seau obtenu comporte 17.639 mots et 196.374 collocations. TOPICOLL1 r&#233;alisant un 
seuillage en coh&#233;sion et fr&#233;quence (0,13 et 13), nous avons repris ce m&#234;me seuillage dans 
TOPICOLL2 afin d&#8217;obtenir des r&#233;sultats comparables. Le r&#233;seau effectif de TOPICOLL2 est 
ainsi constitu&#233; de 7.160 mots et 183.074 collocations tandis que celui de TOPICOLL1 est for-
m&#233; de 18.958 mots et 341.549 collocations. Comme le montre clairement le Tableau 1, le fil-
trage th&#233;matique permet de r&#233;duire le r&#233;seau de collocations de 46% tout en conservant les 
m&#234;mes performances. Comparativement, un seuillage non sp&#233;cifiquement th&#233;matique conduit </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Ferret 
</p>
<p>&#224; une d&#233;gradation significative des performances pour une r&#233;duction de volume un peu moins 
importante. Ce r&#233;sultat tend donc &#224; montrer que le caract&#232;re effectif de la m&#233;thode de filtrage 
th&#233;matique que nous avons propos&#233;e. 
</p>
<p>5 Conclusion et perspectives 
Le travail que nous avons pr&#233;sent&#233; avait pour objectif de construire automatiquement un r&#233;-
seau lexical de nature th&#233;matique en limitant autant que possible les outils et les ressources 
linguistiques utilis&#233;s. Nous avons choisi d&#8217;aborder ce probl&#232;me par le biais du filtrage th&#233;ma-
tique d&#8217;un r&#233;seau de collocations et propos&#233; une m&#233;thode pour ce faire fond&#233;e sur l&#8217;amor&#231;age. 
Son &#233;valuation indirecte au travers de l&#8217;utilisation de son r&#233;sultat par une m&#233;thode de segmen-
tation th&#233;matique a montr&#233; son int&#233;r&#234;t. Cette &#233;valuation doit toutefois &#234;tre pouss&#233;e plus avant, 
notamment en comparant les r&#233;seaux lexicaux ainsi produits avec des r&#233;seaux &#233;quivalents 
construits ou contr&#244;l&#233;s manuellement. La mise &#224; disposition dans le cadre de WordNet de 
relations th&#233;matiques extraites des d&#233;finitions des synsets (Harabagiu et al., 1999) devrait 
permettre une avanc&#233;e int&#233;ressante dans cette direction. 
</p>
<p>R&#233;f&#233;rences 
Agirre E., Ansa O., Martinez D., Hovy E. (2001), Enriching WordNet concepts with topic 
signatures, Actes de Workshop on WordNet of the NAACL&#8217;01 Conference. 
Church K. W., Hanks P. (1990), Word Association Norms, Mutual Information, And Lexi-
cography, Computational Linguistics, Vol. 16(1), pp. 177-210. 
</p>
<p>Ferret O. (2002), Using collocations for topic segmentation and link detection, Actes de 
COLING 2002, pp. 260-266. 
</p>
<p>Ferret O., Grau B. (1998), A Thematic Segmentation Procedure for Extracting Semantic Do-
mains from Texts, Actes de ECAI&#8217;98, pp. 155-159. 
</p>
<p>Harabagiu S, Maiorano S (2002), Multi-Document Summarization with GISTEXTER, Actes de 
LREC 2002. 
</p>
<p>Harabagiu S, Miller G.A., Moldovan D (1999), WordNet 2 - A Morphologically and Seman-
tically Enhanced Resource, Actes de SIGLEX&#8217;99, pp. 1-8. 
</p>
<p>Lin C.Y., Hovy E. (2000), The Automated Acquisition of Topic Signatures for Text Summa-
rization, Actes de COLING 2000. 
</p>
<p>Miller G.A. (1995), WordNet: A lexical Database, Communications of the ACM, Vol. 38(11). </p>

</div></div>
</body></html>