<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Entre syntaxe et s&#233;mantique : Normalisation de la sortie de l&#8217;analyse syntaxique en vue de l&#8217;am&#233;lioration de l&#8217;extraction d&#8217;information &#224; partir de textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Entre syntaxe et s&#233;mantique : Normalisation de la sortie de
l&#8217;analyse syntaxique en vue de l&#8217;am&#233;lioration de l&#8217;extraction
</p>
<p>d&#8217;information &#224; partir de textes
</p>
<p>Caroline Hag&#232;ge, Claude Roux
Xerox Research Centre Europe - XRCE
</p>
<p>6 Chemin de Maupertuis - 38240 Meylan
caroline.hagege@xrce.xerox.com, claude.roux@xrce.xerox.com
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>analyse syntaxique robuste, normalisation en vue de l&#8217;extraction d&#8217;information
robust parsing, normalization for information extraction
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article pr&#233;sente la normalisation de la sortie d&#8217;un analyseur robuste de l&#8217;anglais. Nous
montrons quels sont les enrichissements que nous avons effectu&#233;s afin de pouvoir obtenir &#224; la
sortie de notre analyseur des relations syntaxiques plus g&#233;n&#233;rales que celles que nous offrent
habituellement les analyseurs robustes existants. Pour cela nous utilisons non seulement des
propri&#233;t&#233;s syntaxiques, mais nous faisons appel aussi &#224; de l&#8217;information de morphologie d&#233;ri-
vationnelle. Cette t&#226;che de normalisation est men&#233;e &#224; bien gr&#226;ce &#224; notre analyseur XIP qui
int&#232;gre tous les traitements allant du texte brut tout venant au texte normalis&#233;. Nous pensons
que cette normalisation nous permettra de mener avec plus de succ&#232;s des t&#226;ches d&#8217;extraction
d&#8217;information ou de d&#233;tection de similarit&#233; entre documents.
</p>
<p>This article presents our work on the normalization of the output of a robust dependency parser
for English. We show how we have enriched our grammar to yield syntactic relations that are
more general than those usually obtained with other available robust parsers. In order to achieve
this result, we use syntactic properties, together with derivational morphology information. This
normalization task is carried out with XIP which handles all the process that transform our input
text into its normalized output. We consider that this normalization will improve the result of
information extraction and similarity detection process between documents.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C. Hag&#232;ge, C. Roux
</p>
<p>Introduction
</p>
<p>L&#8217;analyse syntaxique robuste est aujourd&#8217;hui une technique couramment employ&#233;e dans le
traitement automatique des langues (Giguet, Vergne, 1997), (A&#239;t-Mokhtar et al., 1998), (J&#228;rvi-
nen, Tapanainen, 1998), (Briscoe, Carroll, 2002). De nombreux analyseurs syntaxiques, en
g&#233;n&#233;ral bas&#233;s sur les grammaires de d&#233;pendances (Mel&#8217;c&#780;uk 1988) sont capables actuellement,
avec plus ou moins de succ&#232;s, d&#8217;extraire &#224; partir de textes tout venant les sujets, objets, modi-
fieurs de verbes et des noms etc. Nous proposons ici de pr&#233;senter un travail en cours, dans le
prolongement de l&#8217;analyse syntaxique et qui consitue une &#233;tape de normalisation de la sortie
de l&#8217;analyse syntaxique. Cette &#233;tape de normalisation est int&#233;gr&#233;e dans une cha&#238;ne de traite-
ment allant de la segmentation du texte jusqu&#8217;&#224; une repr&#233;sentation syntaxique normalis&#233;e. La
sortie d&#8217;une analyse de ce type devrait permettre d&#8217;effectuer avec davantage d&#8217;acuit&#233; des t&#226;ches
comme l&#8217;extraction d&#8217;information &#224; partir de documents. Dans une premi&#232;re partie nous pr&#233;sen-
terons l&#8217;outil que nous utilisons, puis nous d&#233;crirons le travail autour de la normalisation et enfin
nous &#233;voquerons le probl&#232;me de l&#8217;&#233;valuation.
</p>
<p>1 Analyse syntaxique robuste
</p>
<p>1.1 Pr&#233;sentation de l&#8217;analyseur
</p>
<p>XIP (Ait-Mokhtar et al., 2002) est un analyseur dont l&#8217;objectif est d&#8217;extraire des d&#233;pendances
syntaxiques de fa&#231;on robuste. XIP, de par sa souplesse, permet d&#8217;adopter des approches dif-
f&#233;rentes dans l&#8217;&#233;criture des grammaires (Hag&#232;ge, Roux, 2002) :
</p>
<p>&#8226; Une approche incr&#233;mentale qui consiste &#224; placer des r&#232;gles sp&#233;cifiques et fiables en t&#234;te
de fa&#231;on &#224; filtrer en amont les configurations rares ou exceptionnelles et de laisser les
r&#232;gles plac&#233;es en fin de grammaire se charger des cas les plus g&#233;n&#233;raux qui n&#8217;auraient pas
&#233;t&#233; capt&#233;s auparavant.
</p>
<p>&#8226; Une approche par contrainte (au sens des grammaires de contraintes de Helsinki, (J&#228;rvi-
nen, Tapanainen, 1998)) qui, au contraire, laisserait des r&#232;gles tr&#232;s g&#233;n&#233;rales s&#8217;appliquer
laissant ainsi des ambiguit&#233;s dans les fonctions syntaxiques extraites. Puis, des r&#232;gles
permettant de filtrer les analyses s&#8217;appliquent plus avant, &#233;liminant ainsi certaines possi-
bilit&#233;s.
</p>
<p>Le formalisme propos&#233; par XIP nous permet d&#8217;exprimer un large &#233;ventail de r&#232;gles qui vont
de la d&#233;sambiguisation cat&#233;gorielle, en passant par la constitution de syntagmes noyaux et la
construction des d&#233;pendances1. Nous pouvons distinguer deux grandes familles de r&#232;gles :
</p>
<p>&#8226; Les r&#232;gles qui permettent de construire les syntagmes noyaux,
</p>
<p>&#8226; Les r&#232;gles qui permettent de construire des d&#233;pendances.
1XIP nous permet en fait de relier par des relations des &#233;l&#233;ments linguistiques qui peuvent &#234;tre des el&#233;ments
</p>
<p>lexicaux, mais aussi des &#233;lements non lexicaux correspondant &#224; des syntagmes noyaux.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Entre syntaxe et s&#233;mantique : Normalisation de la sortie de l&#8217;analyse syntaxique
en vue de l&#8217;am&#233;lioration de l&#8217;extraction d&#8217;information &#224; partir de textes
</p>
<p>Voici par exemple une r&#232;gle de la premi&#232;re famille permettant de construire un syntagme noyau
nominal :
</p>
<p>10&gt; SN = Det, ?*, Noun.
</p>
<p>Cette r&#232;gle permet de construire un SN (symbole repr&#233;sentant un syntagme noyau nominal)
&#224; partir d&#8217;une suite compos&#233;e d&#8217;un d&#233;terminant (Det), de 0 ou plusieurs occurrences d&#8217;une
cat&#233;gorie quelconque suivie d&#8217;un nom. Dans la mesure o&#249; les r&#232;gles s&#8217;appliquent selon le
patron le plus court (shortest match), la suite quelconque de cat&#233;gories entre le d&#233;terminant et
le nom ne contiendra aucun nom. Chaque noeud lexical apparaissant dans une r&#232;gle peut &#234;tre
contraint par un jeu de traits suppl&#233;mentaires, traits qui peuvent &#234;tre test&#233;s, ajout&#233;s ou retir&#233;s2.
Une fois, les syntagmes noyaux constitu&#233;s, une seconde famille de r&#232;gles prend le relais pour
lier certains noeuds t&#234;tes (g&#233;n&#233;ralement le fils le plus &#224; droite d&#8217;un syntagme noyau) plac&#233; dans
une configuration particuli&#232;re. Ces r&#232;gles, dites de d&#233;duction, sont compos&#233;es de trois parties,
la premi&#232;re ou la deuxi&#232;me partie &#233;tant facultatives.
</p>
<p>&#8226; La premi&#232;re partie d&#233;finit &#224; l&#8217;aide d&#8217;expression r&#233;guli&#232;res la configuration particuli&#232;re de
noeuds sur laquelle la r&#232;gle s&#8217;applique.
</p>
<p>&#8226; La seconde partie pose des conditions suppl&#233;mentaires (exigence de certains traits sur
certains noeuds, pr&#233;sence ou absence pr&#233;alable d&#8217;une d&#233;pendance)
</p>
<p>&#8226; La troisi&#232;me partie correspond au r&#233;sultat de l&#8217;application de ces r&#232;gles. Elle peut con-
sister en la cr&#233;ation d&#8217;une liste de d&#233;pendances construites sur des noeuds sp&#233;cifiques, ou
encore en la destruction ou la modification de d&#233;pendances d&#233;j&#224; existantes.
</p>
<p>Par exemple, la r&#232;gle ci-dessous dont chacune des trois parties figure sur une ligne s&#233;par&#233;e
permet d&#8217;&#233;tablir une relation SUJET entre le noyau d&#8217;un syntagme nominal et un verbe.
</p>
<p>| SN{?*,#1[last:+]}, ?*[verb:~], SV{?*, #2[last:+]}|
if (~SUJET(#2,#1))
SUJET(#2,#1).
</p>
<p>La r&#232;gle se lit comme suit :
</p>
<p>Premi&#232;re ligne : L&#8217;on trouve un SN (syntagme nominal noyau) dont le dernier fils &#224; droite
(poss&#232;dant le trait [last:+]) est repr&#233;sent&#233; par une variable #1. Ce SN est suivi par z&#233;ro ou
plusieurs noeuds de m&#234;me niveaux (lexicaux ou non lexicaux), ces noeuds ne pouvant en aucun
cas porter le trait [verb:+]. Ils sont suivis &#224; leur tour par un noeud SV dont le dernier &#233;l&#233;ment
est repr&#233;sent&#233; par la variable #2.
</p>
<p>Deuxi&#232;me ligne : La condition stipule que entre le dernier &#233;l&#233;ment du SV (le verbe) et le noyau
du syntagme nominal aucune relation sujet n&#8217;a &#233;t&#233; &#233;tablie auparavant.
Troisi&#232;me ligne : On construit une relation sujet entre ce verbe et le noyau du syntagme nominal.
</p>
<p>2Une cat&#233;gorie dans XIP est un ensemble de traits.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C. Hag&#232;ge, C. Roux
</p>
<p>1.2 Evaluation de l&#8217;analyseur
</p>
<p>L&#8217;analyseur XIP de l&#8217;anglais (premi&#232;re version) a &#233;t&#233; &#233;valu&#233;e en Septembre 2002 sur un frag-
ment du corpus SUZANE annot&#233; &#224; la main3. Nous avons obtenu les r&#233;sultats suivants (toutes
d&#233;pendances confondues) : 79% de pr&#233;cision et 75% de rappel. Les performances de XIP pour
la grammaire g&#233;n&#233;rale de l&#8217;anglais sont de 2300 mots analys&#233;s par seconde sur un Pentium &#224;
1GHz.
</p>
<p>2 Normalisation
</p>
<p>Le travail de normalisation que nous envisageons a pour cible l&#8217;extraction d&#8217;information &#224; partir
de documents. Il nous permet d&#8217;avoir, apr&#232;s l&#8217;analyse, une repr&#233;sentation commune pour des
suites de signifiants qui ne sont pas identiques. A l&#8217;heure actuelle, ce travail de normalisation
s&#8217;effectue selon trois axes :
</p>
<p>1. L&#8217;exploitation des relations syntaxiques mises en &#233;vidence lors de l&#8217;analyse g&#233;n&#233;rale.
</p>
<p>2. La hi&#233;rarchisation des propositions dans une phrase.
</p>
<p>3. L&#8217;exploitation d&#8217;information de morphologie d&#233;rivationnelle.
</p>
<p>2.1 Propri&#233;t&#233;s syntaxiques
</p>
<p>L&#8217;exploitation des relations syntaxiques mises en &#233;vidence lors de l&#8217;analyse g&#233;n&#233;rale se fait en
deux temps. Dans un premier temps, on raffine l&#8217;analyse grammaticale afin de consid&#233;rer les
sujets et objets de verbes non finis, de prendre en compte les ant&#233;c&#233;dents des relatives dans le
calcul du sujet et de l&#8217;objet, et de normaliser la forme passive en forme active.
Dans un deuxi&#232;me temps, on exploite certaines alternances verbales telles qu&#8217;elles ont &#233;t&#233;
d&#233;finies dans (Levin, 1993).
</p>
<p>2.1.1 Raffinement de l&#8217;analyse grammaticale
</p>
<p>Nous avons d&#233;fini les relations de sujet-normalis&#233; (SUBJ-N), objet-normalis&#233; (OBJ-N) comme
suit :
</p>
<p>&#8226; Le sujet d&#8217;un verbe fini &#224; la forme active est reli&#233; &#224; ce verbe par la relation SUBJ-N et
l&#8217;objet direct d&#8217;un verbe fini &#224; la forme active est reli&#233; &#224; ce verbe par la relation OBJ-N.
</p>
<p>&#8226; Le compl&#233;ment d&#8217;agent d&#8217;un verbe fini &#224; la forme passive est un sujet normalis&#233; et le sujet
d&#8217;une passive est un objet normalis&#233;.
Some arrests were reported by the FBI in 1959
SUBJ-N(report,FBI), OBJ-N(report,arrest)
</p>
<p>3160 phrases prises arbitrairement dans le corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Entre syntaxe et s&#233;mantique : Normalisation de la sortie de l&#8217;analyse syntaxique
en vue de l&#8217;am&#233;lioration de l&#8217;extraction d&#8217;information &#224; partir de textes
</p>
<p>&#8226; L&#8217;ant&#233;c&#233;dent d&#8217;un pronom relatif sujet est le sujet normalis&#233; du verbe de la relative et
l&#8217;ant&#233;c&#233;dent d&#8217;un pronom relatif objet est l&#8217;objet normalis&#233; du verbe de la relative.
There was a unanimous vote, according to Republicans who attended the conference
SUBJ-N(attend,republican)
However, wave flying has its own problems which a pilot must understand
OBJ-N(understand,problem)
</p>
<p>&#8226; Si une expression quantifi&#233;e est sujet d&#8217;un verbe, le sujet normalis&#233; est la t&#234;te quantifi&#233;e
par cette expression, m&#234;me si syntaxiquement cette t&#234;te se trouve dans un syntagme pr&#233;-
positionnel d&#233;pendant du quantifieur. De mani&#232;re similaire les expressions quantifi&#233;es
objet d&#8217;un verbe donnent lieu &#224; l&#8217;&#233;tablissement d&#8217;une relation OBJ-N entre le verbe et la
t&#234;te quantifi&#233;e.
Three of the boys were missing - SUBJ-N(miss,boy)
They need three of the boys - OBJN(need,boy)
</p>
<p>&#8226; Les sujets et les objets de formes non finies sont r&#233;cup&#233;r&#233;s comme des sujets normalis&#233;s
et objets normalis&#233;s.
He ordered Peter to go - SUBJ-N(go,Peter).
I saw John leaving the room - SUBJ-N(leave,John), OBJ-N(leave,room)
</p>
<p>&#8226; La relation existant entre un modifieur qui est une forme en -ING et le noyau nominal
qu&#8217;il modifie est une relation de sujet normalis&#233;.
Recessive host mutation affecting virus multiplication... - SUBJ-N(affect,mutation)
</p>
<p>&#8226; La t&#234;te modifi&#233;e par un participe pass&#233; est un objet normalis&#233; de ce participe pass&#233;.
Measures taken so far... - OBJ-N(take,measure)
</p>
<p>Il est &#224; noter que cette normalisation peut se combiner. En effet, si nous avons une relative dont
le verbe est &#224; la forme passive et que le relatif qui l&#8217;introduit a une fonction sujet, la relation
entre l&#8217;ant&#233;c&#233;dant de cette relative et le verbe de la relative sera OBJ-N. En d&#8217;autres termes
pour
The measures that have been taken last week... on obtient une relation OBJ-N(take,measure).
</p>
<p>2.1.2 Alternances
</p>
<p>Nous avons int&#233;gr&#233; dans le lexique et dans la grammaire de l&#8217;information nous permettant de
prendre en compte les alternances de transitivit&#233; et quelques alternances de changement d&#8217;argu-
ments d&#8217;un verbe. Nous avons pour cela utilis&#233; les classes d&#8217;alternances d&#233;finies par B. Levin
(Levin, 1993) et avons marqu&#233; les verbes auxquels peuvent s&#8217;appliquer les alternances que nous
consid&#233;rons. Puis, des r&#232;gles XIP nous permettent de transformer un ensemble de d&#233;pendances
mettant en jeu l&#8217;un de ces verbes marqu&#233;s en un autre ensemble de d&#233;pendances (voir le deux-
i&#232;me exemple ci-dessous).
</p>
<p>2.1.3 Mise en oeuvre
</p>
<p>L&#8217;extraction des sujets, objets normalis&#233;s d&#8217;une part, et la normalisation par les alternances
d&#8217;autre part sont un prolongement naturel de la grammaire et se font par le biais des r&#232;gles de
d&#233;duction de XIP pr&#233;sent&#233;es plus haut.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C. Hag&#232;ge, C. Roux
</p>
<p>Exemple1 : Extraction de l&#8217;objet normalis&#233; correspondant au sujet de la passive4.
</p>
<p>If ( SUBJ(#1,#2) &amp; VDOMAIN[passive](#1,#3) )
OBJN(#3,#2)
</p>
<p>Exemple 2 : On normalise la variante intransitive de verbes sujets &#224; l&#8217;alternance moyenne (Mid-
dle alternation) en sa variante transitive. Le sujet normalis&#233; de la forme intransitive est trans-
form&#233; en objet normalis&#233;. On cr&#233;e une relation SUBJ-N entre le verbe et un lemme variable
(SOMEONE) portant le trait human:+.
</p>
<p>if ( ^SUBJ-N(#1[mid_a],#2[human:~]) &amp; ~OBJ-N(#1,#3) )
OBJ-N(#1,#2),
SUBJ-N(#1,##Pron[lemme=SOMEONE,human=+]).
</p>
<p>Ainsi la phrase The meat cut easily produit dans un premier temps (grammaire g&#233;n&#233;rale) la
relation SUBJ(cut,meat), puis dans un deuxi&#232;me temps (premi&#232;re phase de normalisation) la
relation SUBJ-N(cut,meat). Enfin, apr&#232;s l&#8217;application de la r&#232;gle ci-dessus les relations SUBJ-
N(cut,SOMEONE) et OBJ-N(cut,meat) sont cr&#233;&#233;s.
</p>
<p>2.2 Hi&#233;rarchisation des propositions
</p>
<p>Les g&#233;n&#233;ralisations d&#233;crites ci-dessus s&#8217;accompagnent de la d&#233;limitation des propositions &#224;
l&#8217;int&#233;rieur d&#8217;une phrase. Il semble en effet int&#233;ressant de pouvoir d&#233;terminer &#224; quel niveau
d&#8217;ench&#226;ssement se trouvent les propositions analys&#233;es dans le cadre de la normalisation pour
l&#8217;extraction de l&#8217;information. En effet, dans le contexte d&#8217;une application de question/r&#233;ponse,
le fait de conna&#238;tre &#224; quel degr&#233; d&#8217;ench&#226;ssement se trouve une r&#233;ponse constitue une information
qui nous permet de hi&#233;rarchiser la pertinence des r&#233;ponses obtenues. (On pr&#233;f&#232;rera renvoyer une
phrase dont la r&#233;ponse &#224; la question se trouve &#224; un niveau d&#8217;imbrication faible par rapport &#224; une
phrase dont la r&#233;ponse se trouve dans une proposition tr&#232;s imbriqu&#233;e).
Nous avons d&#233;fini dans la grammaire g&#233;n&#233;rale une relation unaire MAIN qui identifie le verbe
de la clause principale, et une relation binaire EMBED qui relie deux verbes dont le premier
argument est le verbe de l&#8217;ench&#226;ss&#233;e dans la proposition repr&#233;sent&#233;e par le premier argument.
Cette relation EMBED est d&#233;duite de l&#8217;analyse en d&#233;pendances (On consid&#232;re un ench&#226;ssement
de propositions lorsqu&#8217;un verbe est d&#233;pendant d&#8217;un autre verbe fini)
Ainsi par exemple dans la phrase :
Occasionally the stall is recognised by the pilot so that a preventative movement can be made
before any serious wing-drop has had time to develop
Les relations MAIN[passive](recognise), EMBED(make,recognise) et EMBED(have,make)
sont extraites
</p>
<p>En d&#8217;autres termes, le verbe principal de la phrase est recognise, dont d&#233;pend une ench&#226;ss&#233;e
dont le verbe principal est make qui est &#224; son tour un verbe dont d&#233;pend une nouvelle ench&#226;ss&#233;e
repr&#233;sent&#233;e par le verbe have.
</p>
<p>4VDOMAIN correspond &#224; la relation reliant le premier signifiant d&#8217;une suite verbale et le dernier signifiant
d&#8217;une suite verbale, On aura donc la relation VDOMAIN(was,eat) pour la suite was eaten dans The mouse was
eaten by the cat.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Entre syntaxe et s&#233;mantique : Normalisation de la sortie de l&#8217;analyse syntaxique
en vue de l&#8217;am&#233;lioration de l&#8217;extraction d&#8217;information &#224; partir de textes
</p>
<p>2.3 Mise en oeuvre
</p>
<p>Ce sont &#233;galement des r&#232;gles de d&#233;duction qui exploitent les d&#233;pendances pr&#233;alablement ex-
traites par la grammaire g&#233;n&#233;rale que nous utilisons ici.
</p>
<p>Par exemple la r&#232;gle :
</p>
<p>if ( MAIN(#1) &amp; ?[sentence:~](#1,#9) &amp; MOD[sentence,relativ](#9,#10) )
EMBED[relativ=+](#10,#1)
</p>
<p>s&#8217;applique si le verbe principal (MAIN) est gouverneur d&#8217;une forme nominale (on ne sp&#233;cifie
pas ici quel type de relation existe entre le gouverneur et la forme nominale) et que cette forme
nominale est modifi&#233;e par une relative (dans la pratique la d&#233;pendance relie la forme nominale
et le verbe de la relative). Dans ce cas, alors, une relation EMBED poss&#233;dant le trait [relativ:+]
est cr&#233;&#233;e entre le verbe principal et le verbe de la relative.
</p>
<p>2.4 Utilisation de la morphologie d&#233;rivationnelle
</p>
<p>Le troisi&#232;me axe sur lequel nous basons notre travail de normalisation utilise de l&#8217;informa-
tion de morphologie d&#233;rivationnelle. L&#8217;id&#233;e de l&#8217;utilisation de relation entre formes li&#233;es mor-
phologiquement n&#8217;est pas nouvelle et plusieurs travaux pour l&#8217;apprentissage automatique de
mots issus de la m&#234;me famille morphologique ont &#233;t&#233; publi&#233;s (Dal, Namer, 2000) (Gaussier,
1999). Dans le cadre de travaux sur le r&#233;sum&#233; multi-document la notion de paraphrase en util-
isant des familles morphologiques est &#233;galement pr&#233;sent&#233;e dans (McKeown et al., 1999).
Nous avons opt&#233; pour l&#8217;utilisation de la ressource lexicale CELEX qui fournit un arbre de
d&#233;rivations morphologiques pour le lexique de l&#8217;anglais. Nous nous sommes concentr&#233;s sur
quelques familles seulement :
</p>
<p>Verbes et nom de m&#234;me famille avec suffixation +or (e.g. conduct-conductor), suffixation +er
(e.g. accuse, accuser) et suffixation en +ion (accelerate-acceleration). Nous nous sommes &#233;gale-
ment pench&#233;s sur la derivation +(a)n mettant en relation des noms geographiques et les adjectifs
correspondants (e.g. Albania-Albanian or Djibouti-Djiboutean).
Nous avons de plus d&#233;fini un ensemble de relations qui relient les paires nom-verbes extraites
de CELEX mentionn&#233;s plus haut. Ces relations sont ind&#233;pendantes du type de suffixe mais
permettent de d&#8217;exprimer de mani&#232;re plus pr&#233;cise les &#233;quivalences entre verbe-compl&#233;ments et
nom-arguments que nous utilisons pour normaliser (voir plus loin). Ces relations sont :
</p>
<p>&#8226; S0 : Relation entre nom et verbe lorsque le nom paraphrase l&#8217;action exprim&#233;e par le verbe
(ex. acceleration-accelerate).
</p>
<p>&#8226; S1H : Relation entre nom et verbe lorsque le nom a le trait humain et correspond au
premier actant pour l&#8217;action exprim&#233;e par le verbe (ex. beginner,begin).
</p>
<p>&#8226; S1NH Relation entre nom et verbe lorsque le nom n&#8217;a pas le trait humain et correspond
au premier actant pour l&#8217;action exprim&#233;e par le verbe (ex. abbreviation,abbreviate).
</p>
<p>&#8226; S2 Relation entre nom et verbe lorsque le nom est le second actant pour l&#8217;action exprim&#233;e
par le verbe (ex. affirmation,affirm).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C. Hag&#232;ge, C. Roux
</p>
<p>Il faut noter qu&#8217;une m&#234;me paire nom-verbe peut &#234;tre reli&#233;e par plusieurs relations.
</p>
<p>Afin d&#8217;injecter dans la grammaire cette information, XIP offre une nouvelle famille de r&#232;gles
qui sont un cas particulier des r&#232;gles de d&#233;duction mentionn&#233;es ci-dessus. Ces r&#232;gles ont la
particularit&#233; d&#8217;&#234;tre index&#233;es sur un lemme.
</p>
<p>Par exemple, pour indiquer que inventor est un nom reli&#233; au verbe invent par la relation S1H,
on &#233;crira:
</p>
<p>inventor : noun = S1H(#0,##verb[lemme=invent]).
</p>
<p>Cette r&#232;gle est lue par XIP qui cr&#233;e une relation S1H(inventor,invent), relation qui pourra &#234;tre
manipul&#233;e dans des r&#232;gles de d&#233;duction XIP au m&#234;me titre que toute autre relation extraite par
l&#8217;analyseur.
</p>
<p>Ainsi, l&#8217;analyse de la suite The inventor of the process is Smith par la grammaire g&#233;n&#233;rale de
l&#8217;anglais produit les relations suivantes :
</p>
<p>DETD(inventor,the)
MODPREP(inventor,process,of)
ATTRIB(inventor,Smith)5
</p>
<p>A ces relations vient s&#8217;ajouter la relation produite par la r&#232;gle ci-dessus :
S1H(inventor,invent)
</p>
<p>Enfin, par la r&#232;gle de d&#233;duction XIP suivante :
</p>
<p>if ( S1H(#1,#9) &amp; MODPREP(#1,#2,?[form:fof]) &amp; ATTRIB(#1,#3) )
OBJ-N(#9,#2), SUBJ-N(#9,#1).
</p>
<p>nous obtenons enfin les relations normalis&#233;es OBJ-N(invent,process) et SUBJ-N(invent,Smith).
Ces deux relations sont &#233;galement obtenues lors de l&#8217;analyse normalis&#233;e des suites Smith in-
vented the process, The process was invented by Smith, Smith is the inventor of the process ou
the invention of the process by Smith.
</p>
<p>2.5 Un exemple de normalisation
</p>
<p>Prenons par exemple la phrase :
</p>
<p>You will need to connect the handset wires from the terminals.
L&#8217;analyse g&#233;n&#233;rale de cette phrase nous permet d&#8217;obtenir (entre autres) les relations suivantes :
SUBJ(will,you), MAIN[modal](need), VDOMAIN(will,need), OBJ[post,nfinit](need,connect),
OBJ(connect,wire), MOD(connect,terminal)
</p>
<p>5ATTRIB relie deux noms le premier &#233;tant sujet, le deuxi&#232;me &#233;tant compl&#233;ment d&#8217;une forme de BE.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Entre syntaxe et s&#233;mantique : Normalisation de la sortie de l&#8217;analyse syntaxique
en vue de l&#8217;am&#233;lioration de l&#8217;extraction d&#8217;information &#224; partir de textes
</p>
<p>La premi&#232;re &#233;tape de normalisation nous permet d&#8217;obtenir les relations : SUBJ-N(connect,you)
(r&#233;cup&#233;ration du sujet de l&#8217;infinitive), OBJ-N(connect,wire), OBJ-N(connect,terminal) (ap-
plication de l&#8217;alternance r&#233;ciproque6 pour le verbe connect). Lors de la deuxi&#232;me &#233;tape, on
obtient EMBED[infinit](connect,need), qui nous indique que le verbe connect est dans une
infinitive d&#233;pendante du verbe principal de la phrase. Enfin, l&#8217;application de la troisi&#232;me &#233;tape
ne donne aucune information suppl&#233;mentaire pour l&#8217;analyse de cette phrase.
</p>
<p>Prenons par ailleurs cette autre phrase :
</p>
<p>The connection of the terminal is needed.
La sortie de l&#8217;analyseur g&#233;n&#233;ral nous permet d&#8217;obtenir (entre autres) les relations :
MOD[post](connection,terminal), SUBJ(is,connection), MAIN(need), VDOMAIN(is,need).
Lors des premi&#232;re et deuxi&#232;me &#233;tapes nous obtenons la relation OBJ-N(need,connection). Et
enfin, l&#8217;utilisation de l&#8217;information morphologique dont nous disposons, S0(connection,connect)
nous permet de d&#233;duire par une r&#232;gle XIP la relation OBJ-N(connect,terminal).
Nous pouvons constater que les deux ensembles de d&#233;pendances calcul&#233;s pour chacune de
ces phrases par l&#8217;analyseur g&#233;n&#233;ral n&#8217;ont pas d&#8217;intersection commune. Par contre, les deux
ensembles de relations syntaxiques apr&#232;s normalisation pr&#233;sentent une relation en commun
(i.e. OBJ-N(connect,terminal)) et une relation tr&#232;s similaire OBJ-N(need,connection) et
EMBED(connect,need) sachant que connect et connection appartiennent &#224; la m&#234;me famille
morphologique).
</p>
<p>3 Comment &#233;valuer ?
</p>
<p>Un des probl&#232;mes importants que nous rencontrons dans ce travail est celui de son &#233;valuation.
En effet, nous ne disposons pas de corpus annot&#233; avec le type de relations que nous avons
d&#233;finies. La seule possibilit&#233; semble &#234;tre une &#233;valuation indirecte, que nous n&#8217;avons pas encore
effectu&#233;e et qui permettrait de v&#233;rifier l&#8217;influence de ces traitements pour l&#8217;accomplissement
d&#8217;une t&#226;che particuli&#232;re d&#8217;extraction d&#8217;information. Nous envisageons de faire cette exp&#233;rience
dans le contexte d&#8217;une application de question/reponse.
</p>
<p>Conclusion
</p>
<p>Cet article nous a permis de pr&#233;senter un travail en cours de r&#233;alisation : la normalisation de
la sortie d&#8217;un analyseur syntaxique en vue d&#8217;am&#233;liorer des applications d&#8217;extraction d&#8217;infor-
mation. D&#8217;autres enrichissements que ceux actuellement mis en place sont envisag&#233;s notam-
ment l&#8217;utilisation d&#8217;autres alternances, ainsi qu&#8217;un &#233;largissement des familles morphologiques
consid&#233;r&#233;es. Il est int&#233;ressant de souligner que l&#8217;outil que nous utilisons, XIP, nous a permis
d&#8217;int&#233;grer tous les traitements pr&#233;sent&#233;s ici et que les nouvelles relations normalis&#233;es extraites
viennent s&#8217;ajouter (ou peuvent se substituer) aux relations syntaxiques de surface calcul&#233;es par
l&#8217;analyseur de base.
</p>
<p>6Cette alternance indique qu&#8217;une suite SN1 V SN2 SP(Prep, SN3) est &#233;quivalente &#224; la suite SN1 V SN2 and
SN3.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C. Hag&#232;ge, C. Roux
</p>
<p>R&#233;f&#233;rences
Abney S. (1991), Parsing by chunks Principled-Based Parsing R. Berwick, S. Abney, and C. Tenny,
editors. Kluwer Academic Publishers, Dordrecht.
A&#239;t-Mokhtar S., Chanod J-P., Roux C. (1998), Multi-Input Dual-Entry Point Dependency Parser, IWPT
2001, Beijing.
A&#239;t-Mokhtar S., Chanod J-P., Roux C. (2002), Robustness beyond shallowness: incremental dependency
parsing. Special issue of the NLE Journal, 2002.
Briscoe, T., Carroll, J. (2002) High Precision Extraction of Grammatical Relations penultimate draft
to appear in Bunt, H., Carroll, J. and Satta, G. (eds) Proc. of Int. Workshop on Parsing Technologies,
Kluwer
</p>
<p>Dal G., Namer F. (2000) G&#233;n&#233;ration et analyse automatiques de ressources lexicales construites utilis-
ables en recherche d&#8217;information. Traitement automatique des langues pour la recherche d&#8217;information,
num&#233;ro sp&#233;cial de la revue T.A.L, Ch. Jacquemin &#233;d., Paris.
</p>
<p>Gaussier E. (1999) Unsupervised learning of derivational morphology from inflectional lexicons. Work-
shop on Unsupervised methods for natural language processing, ACL 1999.
Giguet E., Vergne J. (1997) From Part of Speech Tagging to Memory-based Deep Syntactic Analysis,
Fifth International Workshop on Parsing Technologies, Boston.
</p>
<p>Hag&#232;ge C., Roux C. (2002), A Robust and Flexible Platform for Dependency Extraction, LREC 2002,
Las Palmas (Spain).
Jacquemin B. (2003) Construction d&#8217;une structure s&#233;mantique de l&#8217;information dans une base documen-
taire pour son interrogation en langage naturel Th&#232;se de Doctorat, Universit&#233; Paris III. A soutenir
</p>
<p>J&#228;rvinen T., Tapanainen P. (1998) Towards an implementable dependency grammar Proceedings of the
COLING-ACL&#8217;98. Workshop on the Processing of Dependency-based Grammars, 1998.
Levin B. English Verb Classes and Alternations - A Preliminary Investigation The University of Chicago
Press, 1993.
McKeown K., Klavens J., Hatzivassiloglou V., Barzilay R., Eskin E. (1999) Towards Multidocument
Summarization by Reformulation: Progress and Prospects, AAAI/IAAA, 1999.
Mel&#8217;c&#780;uk I., (1988) Dependency Syntax. State University of New York, Albany, 1988.
Tapanainen P, Jarvinen T. (1997) A non-projective dependency parser, Proceedings of the 5th Confer-
ence on Applied Natural Language Processing (ACL), Washington, D.C., April 1997.
Tesni&#232;re L, (1959) El&#233;ments de syntaxe structurale, Klincksiek, Paris
Trouilleux F. (2002) Insertions et interpr&#233;tation des expressions pronominales, Actes de la 9&#232;me Con-
f&#233;rence Annuelle sur le Traitement Automatique des Langues TALN 2002, Nancy, France.
Voutilainen A., Heikkila J., (1994) An English constraint grammar (EngCG): a surface syntactic parser
of English, Fries, Tottie and Schneider (eds.), Creating and using English language corpora. Rodopi.</p>

</div></div>
</body></html>