<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une th&#233;orie cognitive de la langue bas&#233;e sur les contraintes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Vers une th&#233;orie cognitive de la langue bas&#233;e sur les
contraintes
</p>
<p>Philippe Blache
LPL-CNRS, Universit&#233; de Provence
</p>
<p>29, Avenue Robert Schuman
13621 Aix-en-Provence
</p>
<p>pb@lpl.univ-aix.fr
</p>
<p>R&#233;sum&#233;
Cet article fournit des &#233;l&#233;ments d&#8217;explication pour la description des relations entre les diff&#233;rents do-
maines de l&#8217;analyse linguistique. Il propose une architecture g&#233;n&#233;rale en vue d&#8217;une th&#233;orie form&#233;e de
plusieurs niveaux : d&#8217;un c&#244;t&#233; les grammaires de chacun des domaines et de l&#8217;autre des relations sp&#233;ci-
fiant les interactions entre ces domaines. Dans cette approche, chacun des domaines est porteur d&#8217;une
partie de l&#8217;information, celle-ci r&#233;sultant &#233;galement de l&#8217;interaction entre les domaines.
</p>
<p>1 Introduction
La linguistique moderne, sous la double impulsion de la linguistique cognitive (cf. (Lan-
gacker99) ou (Croft03)) et de la linguistique descriptive de la langue parl&#233;e (cf. (Allwood01)) a
remis au centre de l&#8217;&#233;tude la langue dans son ensemble. Les recherches th&#233;oriques de la linguis-
tique contemporaine s&#8217;&#233;taient en effet, &#224; la suite de Chomsky, d&#233;plac&#233;es depuis une th&#233;orie de la
langue vers une th&#233;orie de la grammaire. Il s&#8217;est agit, pendant cette p&#233;riode, de rechercher des
outils formels permettant de rendre explicite le m&#233;canisme d&#8217;analyse. La grammaire g&#233;n&#233;rative
a r&#233;pondu &#224; ce probl&#232;me en s&#8217;appuyant sur une relation particuli&#232;re, la d&#233;rivation, d&#233;finissant
une langue &#224; partir de sa grammaire. Une telle relation a le m&#233;rite de d&#233;crire pr&#233;cis&#233;ment une
langue en questio, mais &#233;galement de faire des pr&#233;dictions. En revanche, elle limite la langue
&#224; l&#8217;objet d&#233;crit : ce qui n&#8217;est pas g&#233;n&#233;r&#233; par la grammaire ne fait pas partie de la langue. Une
telle conception, m&#234;me si elle est largement adapt&#233;e par les approches contemporaines (comme
HPSG (Pollard94) ou la th&#233;orie de l&#8217;optimalit&#233; (Prince93)) constitue une limitation majeure
pour l&#8217;analyse et la description de la langue en situation. La moindre analyse de corpus r&#233;v&#232;le
une foule de constructions hors du champ de la grammaire en question. Une approche voulant
prendre en consid&#233;ration ces aspects doit n&#233;cessairement &#234;tre capable de traiter tout &#224; la fois des
informations incompl&#232;tes, instables ou non canoniques.
</p>
<p>Un autre ph&#233;nom&#232;ne vient s&#8217;ajouter &#224; cette difficult&#233;. La linguistique descriptive, en partic-
ulier les recherches sur la langue parl&#233;e, a montr&#233; qu&#8217;il n&#8217;&#233;tait pas possible de d&#233;crire certains
ph&#233;nom&#232;nes sans prendre en compte simultan&#233;ment plusieurs domaines de l&#8217;analyse linguis-
tique (phonologie, syntaxe, s&#233;mantique, etc.). L&#8217;information linguistique provient donc non
seulement de chacun des domaines, mais &#233;galement de leur interaction. Dans cette perspective,
il n&#8217;est pas raisonnable de penser d&#233;crire chaque domaine de fa&#231;on exhaustive ind&#233;pendamment
des autres domaines. Une conception modulariste plaidant pour l&#8217;ind&#233;pendance de chacun des
domaines n&#8217;est en effet pas productive. Invers&#233;ment, il n&#8217;est pas non plus pertinent d&#8217;avancer
vers une explication dans laquelle tous les domaines seraient fusionn&#233;s : la prosodie ne fait pas</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache
</p>
<p>Synt S&#233;mPhon PragPros
</p>
<p>Contraintes d&#8217;interaction
</p>
<p>Principes de controle
</p>
<p>Figure 1: Architecture de la th&#233;orie
</p>
<p>partie de la syntaxe pas plus que la s&#233;mantique. Une conception ouverte doit laisser la possibil-
it&#233; de d&#233;crire partiellement un domaine et laisser la possibilit&#233; de construire des repr&#233;sentations
incompl&#232;tes. Dans le cas de la syntaxe par exemple, cela signifie la possibilit&#233; de construire
pour un &#233;nonc&#233; des structures non connect&#233;es par une relation syntaxique. L&#8217;information pro-
duite par chacun des domaines peut ainsi participer soit directement, soit en synergie avec les
autres domaines &#224; l&#8217;&#233;laboration de l&#8217;information d&#8217;un message. Il est donc n&#233;cessaire pour une
th&#233;orie de la langue de d&#233;crire de fa&#231;on explicite non seulement les m&#233;canismes propres &#224; cha-
cun des domaines, mais &#233;galement leurs interactions. La th&#233;orie sous-tendue propose donc une
vision de la langue comme un tout, dans laquelle chaque domaine poss&#232;de son propre syst&#232;me
de description (ou grammaire), les interactions &#233;tant contr&#244;l&#233;es par un niveau sup&#233;rieur.
Le sch&#233;ma (1) propose une architecture sp&#233;cifiant les grammaires d&#233;crivant chacun des do-
maines au centre de la th&#233;orie. Ceuc-ci ob&#233;issent &#224; un certain nombre de contraintes, les
principes de contr&#244;le. Il peut s&#8217;agir de principes tr&#232;s g&#233;n&#233;raux, r&#233;glant les grands &#233;quilibres
entre domaines, ou au contraire de propri&#233;t&#233;s plus sp&#233;cifiques agissant directement sur les struc-
tures. Ils forment un premier niveau d&#8217;explication des relations inter-domaines. L&#8217;autre niveau,
form&#233; par les contraintes d&#8217;interaction. stipule directement des relations entre les objets des
domaines. Elles peuvent &#234;tre de granularit&#233; extr&#234;mement variable, allant de param&#232;tres tr&#232;s
sp&#233;cifiques jusqu&#8217;&#224; des contraintes plus syst&#233;matiques.
</p>
<p>2 Repr&#233;senter l&#8217;information
La plupart des travaux abordant la question des interactions inter-domaines impl&#233;mentent des
relations entre des structure. C&#8217;est typiquement le cas des &#233;tudes sur l&#8217;interaction prosodie/syntaxe
dans lesquelles les &#233;v&#233;nements prosodiques sont ins&#233;r&#233;s dans la syntaxe (cf. (Bear90)) ou r&#233;-
ciproquement la structure syntaxique contr&#244;le la structure prosodique (cf. (Hirst93)). Cette
tendance est encore dominante, en particulier dans les travaux plus appliqu&#233;s et reposant sur
une s&#233;quence de traitements (cf. (Mertens01), (Pan02) ou (N&#246;th02)).
Nous proposons une approche permettant de situer les objets manipul&#233;s non plus uniquement
par rapport &#224; leur position ou leur forme, mais de fa&#231;on plus g&#233;n&#233;rique en s&#8217;appuyant sur des
informations de nature vari&#233;e : indice temporel, position dans la cha&#238;ne d&#8217;entr&#233;e (ces deux
indices &#233;tant classiques, cf. (Bird99)), mais &#233;galement l&#8217;univers du discours (l&#8217;ensemble des
r&#233;f&#233;rents possibles, cf. (Kamp93)). De plus, plusieurs types de r&#233;f&#233;rences ou d&#8217;index peuvent
&#234;tre utilis&#233;s simultan&#233;ment pour un m&#234;me objet. Ainsi, une unit&#233; lexicale identifi&#233;e dans une
entr&#233;e acoustique pourra &#234;tre r&#233;f&#233;renc&#233;e non seulement par sa position temporelle dans le signal,
mais &#233;galement par son index dans la cha&#238;ne correspondante. S&#8217;il s&#8217;agit d&#8217;un objet r&#233;f&#233;rentiel,
on pourra y ajouter une troisi&#232;me localisation s&#8217;appuyant sur l&#8217;univers du discours.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une th&#233;orie cognitive de la langue
</p>
<p>Nous proposons de r&#233;unir toutes les possibilit&#233;s de localisation au sein d&#8217;une m&#234;me structure
de traits complexe appel&#233; ancre. Chaque trait de l&#8217;ancre d&#233;crit une point d&#8217;ancrage potentiel
form&#233; par la sp&#233;cification d&#8217;un domaine de d&#233;finition des valeurs possibles ainsi que sa valeur.
La d&#233;finition du domaine est essentiellement utilis&#233;e pour pr&#233;ciser l&#8217;univers du discours utilis&#233;
dans le point d&#8217;ancrage correspondant (CONTEXTE). Pour un domaine donn&#233;, certains objets
ont pour effet de compl&#233;ter le domaine de d&#233;finition de l&#8217;univers du discours. Par exemple,
en rencontrant un nouveau r&#233;f&#233;rent, celui-ci est ajout&#233; au domaine de l&#8217;ancre. En revanche,
l&#8217;analyse d&#8217;un d&#233;ictique ou d&#8217;une quantification permettra de pr&#233;ciser voire sp&#233;cifier une seule
valeur dans un contexte donn&#233; en associant une formule (ou une valeur) &#224; un objet. Cette
information sera indiqu&#233;e par le trait VAL, comme repr&#233;sent&#233; en (1). Il est important de pr&#233;ciser
que l&#8217;ancre ne se substitue en aucun cas &#224; une structure de repr&#233;sentation s&#233;mantique. Elle est
simplement destin&#233;e &#224; localiser un objet. Dans le cas du trait CONTEXTE, il sera par exemple
possible, en fonction du formalisme de repr&#233;sentation s&#233;mantique, d&#8217;imaginer un partage de
valeurs &#224; la HPSG entre les structures s&#233;mantiques et l&#8217;ancre.
</p>
<p>ancre
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>TEMP
</p>
<p>&#20;
</p>
<p>DOM-DEF intervalle
VAL
</p>
<p>&#10;
</p>
<p>i, j
&#11;
</p>
<p>&#21;
</p>
<p>POSITION
</p>
<p>&#20;
</p>
<p>DOM-DEF intervalle
VAL
</p>
<p>&#10;
</p>
<p>k, l
&#11;
</p>
<p>&#21;
</p>
<p>CONTEXTE
</p>
<p>&#20;
</p>
<p>DOM-DEF univers
VAL c
</p>
<p>&#21;
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>(1) obj
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>DOMAINE syntaxe
</p>
<p>CARACT&#201;RISATION
</p>
<p>2
</p>
<p>6
</p>
<p>4
</p>
<p>CAT Det
</p>
<p>ANCRE
</p>
<p>&quot;
</p>
<p>TEMP
&#10;
</p>
<p>880, 1000
&#11;
</p>
<p>POSITION
&#10;
</p>
<p>2, 3
&#11;
</p>
<p>#
</p>
<p>3
</p>
<p>7
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>(2)
</p>
<p>Ce type de structure pr&#233;sente l&#8217;avantage d&#8217;&#234;tre modulable et de pr&#233;ciser une situation multiple.
Cette propri&#233;t&#233; permet pour un m&#234;me objet de faire r&#233;f&#233;rence &#224; des types d&#8217;information diverses.
L&#8217;interface entre les domaines peut ainsi &#234;tre pr&#233;cis&#233;e directmement entre les objets ainsi ancr&#233;s.
L&#8217;exemple [2] montre une localisation utilis&#233;e par un objet situ&#233; &#224; la fois dans l&#8217;axe temporel
(exprim&#233; en millisecondes) et dans la cha&#238;ne (&#224; la mani&#232;re des charts). On remarque qu&#8217;un objet,
ind&#233;pendamment du formalisme choisi, est d&#233;crit par la sp&#233;cification domaine duquel il est
issu ainsi qu&#8217;une caract&#233;risation contenant des traits purement descriptifs ainsi que son ancre.
Une telle repr&#233;sentation offre notamment l&#8217;avantage de ne pas &#234;tre d&#233;pendant d&#8217;un formalisme
quelconque pour situer un objet.
</p>
<p>3 D&#233;crire les interactions
Nous d&#233;crivons dans cette section deux types d&#8217;interactions : les principes de contr&#244;le, qui pr&#233;-
cisent les grands &#233;quilibres devant exister entre les domaines et stipulent des relations entre ces
domaines et les contraintes d&#8217;interaction, qui permettent de pr&#233;ciser des relations directement
entre les objets.
</p>
<p>3.1 Les principes de contr&#244;le
Les principes de contr&#244;le sp&#233;cifient des contraintes globales entre les domaines et sont &#233;troite-
ment li&#233;s &#224; la notion d&#8217;information v&#233;hicul&#233;e dans un domaine. Il est n&#233;cessaire pour com-
mencer de se doter d&#8217;une repr&#233;sentation de la quantit&#233; d&#8217;information contenue dans un objet
(cf. (Blache02)). Nous proposons pour cela une premi&#232;re approximation dans laquelle la quan-
tit&#233; d&#8217;information, repr&#233;sent&#233;e par un poids, est fonction de son degr&#233; d&#8217;ambigu&#239;t&#233;. Par exem-
ple, si un &#233;nonc&#233; correspond &#224; une structure syntaxique unique (donc sans ambigu&#239;t&#233;), nous
estimerons que la quantit&#233; d&#8217;information est importante. Les relations de s&#233;lection lexicale au-
ront de la m&#234;me fa&#231;on un poids s&#233;mantique fort, les tournures morpho-syntaxiques marqu&#233;es
(comme les cliv&#233;es) &#233;galement, ainsi que les contours m&#233;lodiques st&#233;r&#233;otyp&#233;s (cf. (Rossi99)).
Nous avons d&#233;crit un premier principe d&#8217;&#233;quilibre entre les domaines concernant la r&#233;partition</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache
</p>
<p>de l&#8217;information (cf. (Blache02)). Il indique que la somme des poids de chacun des domaines
doit atteindre un certain seuil comme repr&#233;sent&#233; en (3).
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>SYNT
&#2;
</p>
<p>POIDS a
&#3;
</p>
<p>SEM
&#2;
</p>
<p>POIDS b
&#3;
</p>
<p>PROS
&#2;
</p>
<p>POIDS c
&#3;
</p>
<p>SEUIL (a+b+c) &#21; s
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>(3) (a) C&#8217;est de Paul dont je te parle(b) Marie elle devrait faire attention(4)
</p>
<p>Ce principe permet de d&#233;crire certains aspects de la variabilit&#233; : le poids des domaines peut
varier &#224; condition que le seuil soit atteint. Dans le cas o&#249; certains domaines ont un poids tr&#232;s fort
permettant d&#8217;atteindre &#224; eux seuls le seuil, les autres domaines n&#8217;ont donc pas de cons&#233;quence
directe sur l&#8217;interpr&#233;tation. Il sera donc possible de faire varier leur poids de fa&#231;on libre. C&#8217;est
le cas dans l&#8217;exemple 4 portant sur une construction cliv&#233;e &#224; s&#233;lection lexicale forte. Dans
le cas (4a), la structure n&#8217;est pas ambig&#252;e, le poids port&#233; par la syntaxe sera fort et le seuil
pourra &#234;tre atteint directement. On aura donc une variabilit&#233; possible dans la r&#233;alisation de la
prosodie, par exemple. En revanche, pour des exemples ambigus comme en (4b), la syntaxe est
moins marqu&#233;e, elle aura donc un poids moins important qui devra &#234;tre compens&#233; par d&#8217;autres
domaines, notamment la prosodie qui sera du coup moins variable. D&#8217;autres types de relations,
&#224; un niveau encore plus g&#233;n&#233;ral, peuvent &#233;galement &#234;tre sp&#233;cifi&#233;es. Il existe par exemple un
principe d&#8217;&#233;quilibre entre la morphologie et la syntaxe rendant compte du fait qu&#8217;une langue &#224;
morphologie riche aura des contraintes syntaxiques d&#8217;ordre lin&#233;aires plus souples qu&#8217;une langue
&#224; morphologie faible. On a donc globalement un certain type d&#8217;information (en particulier la
fonction) qui peut &#234;tre pris en charge par l&#8217;un ou l&#8217;autre de ces domaines. Une telle variation
est de plus proportionnelle : au plus la morphologie est riche, au plus l&#8217;ordre lin&#233;aire est libre.
Une telle relation peut s&#8217;exprimer par la contrainte suivante :
</p>
<p>2
</p>
<p>6
</p>
<p>4
</p>
<p>MORPH
&#2;
</p>
<p>POIDS a
&#3;
</p>
<p>SYNT
h
</p>
<p>PL
&#2;
</p>
<p>POIDS b
&#3;
</p>
<p>i
</p>
<p>SEUIL (a+b) &#21; s
</p>
<p>3
</p>
<p>7
</p>
<p>5
</p>
<p>(5)
</p>
<p>Cette contrainte met en relation des poids provenant de la morphologie d&#8217;une part et de la pr&#233;c&#233;-
dence lin&#233;aire d&#8217;autre part. Il est donc possible d&#8217;associer des poids &#224; des niveaux diff&#233;rents. Le
m&#234;me type de relation pourrait &#234;tre mis en &#339;uvre pour expliquer la relation entre l&#8217;intonation et
le lexique dans le cas des langues &#224; tons.
</p>
<p>3.2 Les contraintes d&#8217;interaction
La description de l&#8217;interaction entre domaines n&#233;cessite la possibilit&#233; de repr&#233;senter directement
des relations entre les objets des domaines. Il s&#8217;agit dans ce cas, comme dans une grammaire
de contraintes, d&#8217;une part de pr&#233;ciser les caract&#233;ristiques des objets concern&#233;s afin de les iden-
tifier, et d&#8217;autre part de d&#233;finir la relation qui les unit. Une telle relation est appel&#233;e contrainte
d&#8217;interaction. Ce type de contrainte peut prendre des formes diff&#233;rentes selon les cons&#233;quences
qu&#8217;elle a sur les structures. Dans certains cas, il s&#8217;agit simplement de localiser des objets par-
ticipant &#224; la relation gr&#226;ce &#224; leur ancre. Dans d&#8217;autres cas, la contrainte permet de calculer (ou
propager) une nouvelle valeur. Nous illustrons dans ce qui suit ces deux types de fonction-
nement en d&#233;taillant deux exemples.
</p>
<p>Le premier type de contrainte d&#8217;interaction consiste &#224; sp&#233;cifier une cooccurrence (ou une re-
striction de cooccurrence) entre des objets de domaines diff&#233;rents identifi&#233;s par leur localisa-
tion. Prenons l&#8217;exemple de l&#8217;interaction prosodie/syntaxe propos&#233;e dans (Bear90). Les auteurs
proposent dans cet article d&#8217;ins&#233;rer dans des r&#232;gles syntagmatiques une cat&#233;gorie pr&#233;cisant la
possibilit&#233; de pause (et sa dur&#233;e) entre des cat&#233;gories syntagmatique. En d&#8217;autres termes, une</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une th&#233;orie cognitive de la langue
</p>
<p>nouvelle cat&#233;gorie sp&#233;cifiant un &#233;v&#233;nement prosodique est ins&#233;r&#233;e dans la description de la syn-
taxe. Les auteurs implantent &#224; l&#8217;aide de ces r&#232;gles des contraintes plus g&#233;n&#233;riques indiquant par
exemple qu&#8217;une pause longue ne peut intervenir entre une t&#234;te syntaxique et son compl&#233;ment.
Dans ce cas, le compl&#233;ment aura tendance &#224; se rattacher &#224; un niveau sup&#233;rieur. L&#8217;utilisation des
contraintes d&#8217;interaction permet l&#8217;implantation de ce type de relation ind&#233;pendamment de tout
formalisme syntaxique (ou prosodique) particulier. Il suffit en effet de pr&#233;ciser leur localisation
dans le domaine d&#8217;origine. La contrainte repr&#233;sent&#233;e en (6) contient toute l&#8217;information d&#233;crite
pr&#233;c&#233;demment : elle permet de pr&#233;ciser que si deux cat&#233;gories syntaxiques sont dans une rela-
tion de rection (la seconde est compl&#233;ment de la premi&#232;re), alors il ne peut y avoir au niveau
prosodique une pause majeure.
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>DOM synt
</p>
<p>CAR
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>2
</p>
<p>6
</p>
<p>4
</p>
<p>CAT c
1
</p>
<p>ANC
</p>
<p>&quot;
</p>
<p>TEMP
&#10;
</p>
<p>t
1
</p>
<p>, t
2
</p>
<p>&#11;
</p>
<p>POS
&#10;
</p>
<p>i, j
&#11;
</p>
<p>#
</p>
<p>3
</p>
<p>7
</p>
<p>5
</p>
<p>2
</p>
<p>6
</p>
<p>4
</p>
<p>CAT c
2
</p>
<p>ANC
</p>
<p>&quot;
</p>
<p>TEMP
&#10;
</p>
<p>t
3
</p>
<p>, t
4
</p>
<p>&#11;
</p>
<p>POS
&#10;
</p>
<p>k, l
&#11;
</p>
<p>#
</p>
<p>3
</p>
<p>7
</p>
<p>5
</p>
<p>RECTION (c
2
</p>
<p>; c
1
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>6,
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>DOM pros
</p>
<p>CAR
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>CAT pause
DUR&#201;E longue
</p>
<p>ANC
</p>
<p>&quot;
</p>
<p>TEMP
&#10;
</p>
<p>t
2
</p>
<p>, t
3
</p>
<p>&#11;
</p>
<p>POS
&#10;
</p>
<p>j, k
&#11;
</p>
<p>#
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>(6)
</p>
<p>Dans cette contrainte, chaque objet d&#233;pend d&#8217;un domaine particulier, il est d&#233;crit par une carac-
t&#233;risation contenant ses propri&#233;t&#233;s. Les deux objets du domaine syntaxique sont simplements
d&#233;crits par une cat&#233;gorie, leur ancre et la relation de rection les unissant. L&#8217;ancre indique que
les objets concern&#233;s sont cons&#233;cutifs, c
</p>
<p>1
</p>
<p>pr&#233;c&#233;dant c
2
</p>
<p>. Cette localisation est indiqu&#233;e &#224; la fois
par des points d&#8217;ancrage temporels et dans la cha&#238;ne. L&#8217;objet du domaine prosodique (la pause)
peut &#224; son tour &#234;tre pr&#233;cis&#233;ment localis&#233; par une ancrage entre c
</p>
<p>1
</p>
<p>et c
2
</p>
<p>.
</p>
<p>Un autre type de contrainte d&#8217;interaction est n&#233;cessaire pour l&#8217;instanciation ou la propagation de
nouvelles valeurs. L&#8217;exemple propos&#233; en (7) d&#233;crit une situation d&#8217;interaction multimodale. Le
probl&#232;me dans ce cas consiste &#224; expliquer comment une relation d&#8217;anaphore peut s&#8217;&#233;tblir gr&#226;ce
&#224; l&#8217;interaction entre plusieurs domaines. La situation propos&#233;e met en sc&#232;ne un pr&#233;sentateur
m&#233;t&#233;o d&#233;signant par un geste d&#233;ictique (voir (Kettebekov02)) un front orageux sur une carte
en contenant plusieurs en pronon&#231;ant &#8220;celui-ci faiblit&#8221;. Le probl&#232;me consiste &#224; &#233;tablir le lien
anaphorique entre le pronom (appartenant au domaine syntaxique) et l&#8217;ensemble des r&#233;f&#233;rents
construits par le domaine graphique (la carte) gr&#226;ce &#224; un geste. Sans entrer dans les d&#233;tails
d&#8217;une repr&#233;sentation s&#233;mantique (voir par exemple (Pineda00)), une telle relation s&#8217;impl&#233;mente
par la contrainte (7).
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>DOM synt
</p>
<p>CAR
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>CAT Pro
</p>
<p>ANC
</p>
<p>2
</p>
<p>4
</p>
<p>TEMP
&#10;
</p>
<p>i, j
&#11;
</p>
<p>POS
&#10;
</p>
<p>s,t
&#11;
</p>
<p>CONTEXTE c
1
</p>
<p>3
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>^
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>DOM sem
</p>
<p>CAR
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>REF x=c
1
</p>
<p>CONTENT
</p>
<p>&#20;
</p>
<p>QUANT 9x
REL faiblir(x)
</p>
<p>&#21;
</p>
<p>ANC
&#2;
</p>
<p>CONTEXTE c
1
</p>
<p>&#3;
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>^
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>DOM graphique
</p>
<p>CAR
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>REF y=c
2
</p>
<p>CONTENT
</p>
<p>&#20;
</p>
<p>QUANT 9y
REL orage(y)
</p>
<p>&#21;
</p>
<p>ANC
&#2;
</p>
<p>CONTEXTE C
&#3;
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>^(7)
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>DOM geste
</p>
<p>CAR
</p>
<p>2
</p>
<p>4
</p>
<p>CAT deictique
</p>
<p>ANC
</p>
<p>&#20;
</p>
<p>TEMP
&#10;
</p>
<p>i, j
&#11;
</p>
<p>CONTEXTE c
2
</p>
<p>2 C
</p>
<p>&#21;
</p>
<p>3
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>)
</p>
<p>[c
</p>
<p>1
</p>
<p>=c
</p>
<p>2
</p>
<p>]
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>DOM sem car
</p>
<p>2
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>6
</p>
<p>4
</p>
<p>REF x=c
1
</p>
<p>CONTENT
</p>
<p>&#20;
</p>
<p>QUANT 9x
REL orage(x) ^ faiblit(x)
</p>
<p>&#21;
</p>
<p>ANC
</p>
<p>2
</p>
<p>4
</p>
<p>TEMP
&#10;
</p>
<p>i, j
&#11;
</p>
<p>POS
&#10;
</p>
<p>s,t
&#11;
</p>
<p>CONTEXTE c
1
</p>
<p>3
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>3
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>7
</p>
<p>5
</p>
<p>L&#8217;essentiel de la contrainte repose sur la relation de cor&#233;f&#233;rence donn&#233;e par l&#8217;ancrage. Au niveau</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache
</p>
<p>syntaxique, on sp&#233;cifie un pronom avec possibilit&#233; d&#8217;ancrage &#224; la fois dans le signal temporel,
la cha&#238;ne et l&#8217;univers du discours repr&#233;sent&#233; par le trait CONTEXTE. L&#8217;objet s&#233;mantique quant
&#224; lui instancie une relation pr&#233;dicative issue du verbe et ancr&#233; dans le contexte. De son c&#244;t&#233;, le
domaine graphique d&#233;finit un univers de r&#233;f&#233;rents C contenant les objets de la carte, notamment
les fronts orageux. Le geste d&#233;ictique permet d&#8217;&#233;tablir un lien entre ces diff&#233;rents objets gr&#226;ce &#224;
l&#8217;ancrage : celui-ci localise l&#8217;objet au niveau temporel qui montre un recouvrement avec l&#8217;objet
syntaxique (le pronom). L&#8217;ancrage contextuel peut alors &#234;tre unifi&#233; entre tous ces objets. Le
r&#233;sultat est la construction d&#8217;un objet s&#233;mantique dont l&#8217;ancre est totalement pr&#233;cis&#233;e.
</p>
<p>4 Conclusion
L&#8217;interaction entre les diff&#233;rents domaines de l&#8217;analyse linguistique constitue le point central
d&#8217;une th&#233;orie de la langue. Cet article propose une architecture pour cette th&#233;orie qui s&#8217;organise
autour de la description de chacun des domaines. Les descriptions sont quant &#224; elles contr&#244;l&#233;es
par deux niveaux d&#8217;interaction sp&#233;cifiant des relations entre les domaines ou directement entre
leurs objets. La possibilit&#233; de rendre compte de la langue en situation et dans une perspective
communicationnelle tout en se situant dans une approche formelle conf&#232;re ainsi pleinement un
aspect cognitif &#224; la th&#233;orie.
</p>
<p>R&#233;f&#233;rences
Allwood J. (2001), &#8220;Capturing Differences between Social Activities in Spoken Language&#8221;, in Perspec-
tives on Semantics, Pragmatics and Discourse, I. Kenesei &amp; R. Harris (eds), John Benjamins.
Bear J. &amp; P. Price (1990), &#8220;Prosody, Syntax and Parsing&#8221;, in proceedings of the ACL-90.
Bird S. &amp; M. Liberman (1999) &#8220;A formal framework for linguistic annotation&quot;, Technical Report MS-
CIS-99-01. Dept of Computer and Information Science, University of Pennsylvania.
Blache P. (2001) Les Grammaires de Propri&#233;t&#233;s : Des contraintes pour le traitement automatique des
langues naturelles, Herm&#232;s.
Blache P. &amp; D. Hirst (2001) &quot;Aligning Prosody and Syntax in Property Grammars.&quot;, in proceedings of
Eurospeech-2001.
Blache P. (2002) &#8220;Variabilit&#233; et d&#233;pendances des composants linguistiques&quot;, in actes de TALN-02.
Croft W. &amp; D. Cruse (2003) Cognitive Linguistics, ms, Cambridge University Press.
Hirst D. (1993), &#8220;Detaching Intonational Phrases from Syntactic Structure&#8221;, in Linguistic Inquiry, 24:4.
Kamp H. &amp; U. Reyle(2002), From Discourse to Logic, Kluwer.
Kettebekov S. M. Yeasin &amp; R. Sharma (2002), &#8220;Prosody Based Co-analysis for Continuous Recognition
of Coverbal Gestures&#8221;, in proceedings of International Conference on Multimodal Interfaces.
Langacker R. (1999), Grammar and Conceptualization, Walter de Gruyter.
Mertens P., J.-P. Goldman, E. Wehrli &amp; A. Gaudinat (2001) &#8220;La synth&#232;se de l&#8217;intonation &#224; partir de
structures syntaxiques riches&quot;, in revue TAL 42 :1
N&#246;th E. et al. (2002), &#8220;On the use of prosody in automatic dialogue understanding&#8221;, in Speech Commu-
nication, 36.
Pan S., K. McKeown &amp; J. Hirschberg (2002), &#8220;Exploring features from natural language generation for
prosody modeling&#8221;, in Computer, Speech and Language, 16.
Pineda L. &amp; G. Garza (2000), &#8220;A Model for Multimodal Reference Resolution&#8221;, in Computational Lin-
guistics, 26:2.
Pollard C. &amp; I. Sag (1994) Head-driven Phrase Structure Grammars, CSLI, Chicago University Press.
Prince A. &amp; Smolensky P. (1993), Optimality Theory: Constraint Interaction in Generative Grammars,
Technical Report RUCCS TR-2, Rutgers Center for Cognitive Science.
Rossi M. (1999) L&#8217;intonation, le syst&#232;me du fran&#231;ais : description et mod&#233;lisation, Ophrys.</p>

</div></div>
</body></html>