<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>MDA-XML : une exp&#233;rience de r&#233;daction contr&#244;l&#233;e multilingue bas&#233;e sur XML</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>MDA-XML : une exp&#233;rience de r&#233;daction contr&#244;l&#233;e
multilingue bas&#233;e sur XML
</p>
<p>Guy Lapalme (1), Caroline Brun (2), Marc Dymetman (2),
(1) RALI - Universit&#233; de Montr&#233;al
</p>
<p>Montr&#233;al (Qu&#233;bec)
lapalme@iro.umontreal.ca
</p>
<p>(2) Xerox Research Centre Europe
6, chemin de Maupertuis, 38240 Meylan
</p>
<p>{Caroline.Brun,Marc.Dymetman}@xrce.xerox.com
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>r&#233;daction contr&#244;l&#233;e multilingue, XML
multilingual controlled authoring, XML
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Nous d&#233;crivons dans cet article l&#8217;implantation d&#8217;un syst&#232;me de r&#233;daction contr&#244;l&#233;e multilingue
dans un environnement XML. Avec ce syst&#232;me, un auteur r&#233;dige interactivement un texte se
conformant &#224; des r&#232;gles de bonne formation aux niveaux du contenu s&#233;mantique et de la r&#233;ali-
sation linguistique d&#233;crites par un sch&#233;ma XML. Nous discutons les avantages de cette approche
ainsi que les difficult&#233;s rencontr&#233;es lors du d&#233;veloppement de ce syst&#232;me. Nous concluons avec
un exemple d&#8217;application &#224; une classe de documents pharmaceutiques.
</p>
<p>We describe an XML implementation of a multilingual authoring system. Using this system,
an author can interactively write a text conforming to well-formedness content and realization
rules described by an XML schema. We discuss the advantages of such an approach as well as
the problems we met during the implementation of our system. We show in the end an example
of an application for a class of pharmaceutical documents.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Lapalme, Caroline Brun, Marc Dymetman
</p>
<p>La production moderne de documentation fait de plus en plus l&#8217;objet d&#8217;applications informa-
tis&#233;es, en particulier pour des domaines o&#249; la forme et le contenu des documents sont des
param&#232;tres cruciaux, comme c&#8217;est le cas par exemple pour la documentation technique ou les
manuels d&#8217;instructions. Les besoins en termes de formatage sont maintenant bien identifi&#233;s, et
la plupart des outils de traitement de texte proposent des fonctionnalit&#233;s telles que des feuilles
de style ou des mod&#232;les de documents. On ne peut cependant pas r&#233;duire la notion de r&#233;daction
de document &#224; celle de formatage. Ainsi, des recherches en cours visent &#224; d&#233;velopper des m&#233;th-
odes pour aider un auteur &#224; composer le contenu du texte, en particulier lorsque les documents
appartiennent &#224; des domaines restreints. En effet, certains standards imposent des contraintes
strictes sur l&#8217;information v&#233;hicul&#233;e dans les documents, et dans certains cas, la forme m&#234;me des
phrases peut &#234;tre d&#233;crite au moyen d&#8217;une langue contr&#244;l&#233;e.
</p>
<p>Parmi ces diff&#233;rentes recherches, le syst&#232;me &#8220;Multilingual Document Authoring&#8221; (MDA), (Brun
et al., 2000; Dymetman et al., 2000; Dymetman, 2002; Brun &amp; Dymetman, 2002), d&#233;velopp&#233;
ces derni&#232;res ann&#233;es dans la lign&#233;e des travaux de (Power &amp; Scott, 1998) et de (Ranta, 2002),
permet d&#8217;encoder sous forme de grammaires l&#8217;information n&#233;cessaire &#224; la constitution d&#8217;un
document valide. Nous montrerons un exemple tir&#233; du domaine pharmaceutique illustrant la ca-
pacit&#233; de ces grammaires &#224; d&#233;crire les connaissances du domaine (le fait qu&#8217;un produit pharma-
ceutique soit commercialis&#233; sous une certaine forme contraint &#224; la fois son conditionnement et
son mode d&#8217;administration) ainsi que des contraintes sur l&#8217;organisation du document (la forme
pharmaceutique et le mode d&#8217;administration doivent appara&#238;tre dans des sections sp&#233;cifiques
d&#8217;une notice).
Le syst&#232;me MDA d&#233;velopp&#233; &#224; XRCE a &#233;t&#233; utilis&#233; avec succ&#232;s pour la production de notices
pharmaceutiques et de comptes-rendus d&#8217;exp&#233;riences biologiques (Brun et al., 2002). Ce sys-
t&#232;me poss&#232;de de fortes connexions avec XML, car dans les deux cas le document est repr&#233;sent&#233;
comme une combinaison de structures d&#8217;arbres balis&#233;es et d&#8217;&#233;l&#233;ments de surface en texte libre.
</p>
<p>Dans l&#8217;approche propos&#233;e par MDA, la r&#233;daction est fond&#233;e sur des d&#233;cisions s&#233;mantiques in-
d&#233;pendantes de la langue permettant la construction de structures &#233;galement ind&#233;pendantes de
la langue. Ce sont des m&#233;canismes propres aux diff&#233;rentes langues couvertes par le syst&#232;me qui
sont ensuite utilis&#233;s pour produire les r&#233;alisations textuelles multilingues. La structure s&#233;man-
tique guide l&#8217;auteur dans la sp&#233;cification du document, &#224; la mani&#232;re d&#8217;une DTD ou d&#8217;un sch&#233;ma
guidant la structure d&#8217;un document XML. Mais les DTDs et les sch&#233;mas XML sont tr&#232;s limit&#233;s
dans l&#8217;expressivit&#233; des d&#233;pendances s&#233;mantiques ou grammaticales qu&#8217;ils peuvent &#233;tablir entre
les diff&#233;rents sous-arbres de la structure du document. De plus, les outils de gestion de styles
comme XSLT ou CSS, d&#233;velopp&#233;s pour op&#233;rer des transformations sur la pr&#233;sentation des doc-
uments, sont mal adapt&#233;s aux traitements linguistiques. Cependant, les outils de r&#233;daction bas&#233;s
sur XML sont de plus en plus largement utilis&#233;s pour la cr&#233;ation de documentation technique, le
contr&#244;le de la qualit&#233; des documents et l&#8217;am&#233;lioration de leur r&#233;utilisabilit&#233;. Du point de vue du
traitement automatique des langues, la nouveaut&#233; des repr&#233;sentations XML n&#8217;est a priori pas
&#233;vidente. N&#233;anmoins, XML poss&#232;de un large potentiel en tant que lingua franca, et draine une
large communaut&#233; d&#8217;utilisateurs vers des pratiques de r&#233;daction o&#249; l&#8217;explicitation du contenu
prend une importance cruciale.
</p>
<p>Nous avons donc jug&#233; int&#233;ressant d&#8217;approfondir les connexions existant entre MDA et XML
en d&#233;veloppant le prototype MDA-XML, qui implante les principes du syst&#232;me MDA dans un
environnement bas&#233; sur XML. Nous d&#233;crivons dans les sections suivantes l&#8217;&#233;tat d&#8217;avancement
de notre prototype de r&#233;daction multilingue interactive, et discutons certaines des difficult&#233;s
rencontr&#233;es dans la poursuite de son d&#233;veloppement.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MDA-XML : une exp&#233;rience de r&#233;daction contr&#244;l&#233;e multilingue bas&#233;e sur XML
</p>
<p>Int&#233;gration dans XML
</p>
<p>Les feuilles de styles XML, (eXtensible Stylesheet languages), proposent une notation d&#233;clara-
tive pour les transformations de structures XML, elles-m&#234;mes d&#233;crites en XML. (Cawsey, 2000)
et (Wilcock, 2001) ont d&#233;crit quelques exp&#233;riences de g&#233;n&#233;ration automatique en utilisant des
feuilles de style XSLT initialement con&#231;ues pour la pr&#233;sentation de documents. Comme les
transformations d&#8217;arbres XSLT ne s&#8217;appliquent que sur l&#8217;arbre d&#8217;entr&#233;e sans acc&#232;s &#224; la sortie
partielle d&#8217;un traitement interm&#233;diaire, ceci induit une vision &#8220;pipeline&#8221; du processus de g&#233;n&#233;ra-
tion avec des s&#233;parations de traitement assez artificielles. Dans un contexte interactif (non en-
visag&#233; par ces auteurs) comme celui de MDA, ceci impliquerait de g&#233;n&#233;rer une s&#233;quence de
transformations apr&#232;s chaque choix de l&#8217;utilisateur, les appliquer, r&#233;cup&#233;rer l&#8217;arbre transform&#233;
et l&#8217;afficher. C&#8217;est pourquoi ils sugg&#233;raient d&#8217;autres implantations o&#249; les transformations sont
r&#233;alis&#233;es &#224; l&#8217;aide de programmes standard. Deux caract&#233;ristiques importantes de XML sont la
v&#233;rification de types a priori ainsi que la validation du document accomplie avant le traitement
informatique. L&#8217;information d&#233;crivant les types d&#8217;un document XML peut &#234;tre donn&#233;e par des
sch&#233;mas, qui offrent un syst&#232;me de typage flexible et puissant. Les &#233;diteurs XML actuels ne
vont cependant pas bien au del&#224; du niveau de la pr&#233;sentation. De nombreuses recherches sont
men&#233;es concernant le Semantic Web ou des extensions de XML pour des applications sp&#233;ci-
fiques, mais elles se concentrent sur les m&#233;thodes de structuration et d&#8217;annotation de donn&#233;es,
qui seront par la suite pr&#233;sent&#233;es de diverses fa&#231;ons ou bien encore trait&#233;es informatiquement. &#192;
notre connaissance, seul (Boardman, 1999) a aid&#233; des auteurs &#224; produire un texte grammatical
et conforme &#224; des sch&#233;mas XML.
</p>
<p>Dans le syst&#232;me MDA, les interactions sont r&#233;alis&#233;es par le biais du texte de sortie : bien que
les choix soient de nature s&#233;mantique, l&#8217;auteur n&#8217;interagit jamais directement avec la struc-
ture s&#233;mantique mais seulement avec une repr&#233;sentation textuelle de cette structure, les valeurs
s&#233;mantiques (&#233;quivalentes &#224; des balises) &#233;tant cach&#233;es. Le but d&#8217;un syst&#232;me comme MDA
n&#8217;est donc pas uniquement de produire un document valide comme c&#8217;est le cas pour XML,
mais &#233;galement des r&#233;alisations textuelles grammaticales. La structure interne du document est
constamment mise &#224; jour et les d&#233;pendances s&#233;mantiques sont propag&#233;es entre les diff&#233;rentes
parties du texte, et ceci dans l&#8217;ensemble des langues couvertes par le syst&#232;me. La notion de
pr&#233;sentation (rendering) XML est ainsi consid&#233;rablement &#233;tendue dans le syst&#232;me MDA. Nous
d&#233;crivons dans la section suivante un exp&#233;rience visant &#224; obtenir les fonctionnalit&#233;s du syst&#232;me
MDA dans un environnement reposant sur les sch&#233;mas XML.
</p>
<p>Description du prototype MDA-XML
</p>
<p>Les principes du syst&#232;me de r&#233;daction assist&#233;e d&#233;crits dans cet article sont implant&#233;s au sein
d&#8217;une interface utilisateur conviviale qui permet une interaction en temps r&#233;el avec des gram-
maires multilingues. Actuellement, le prototype MDA-XML dispose de deux grammaires par-
all&#232;les en fran&#231;ais et en anglais d&#233;crivant une classe de notices pharmaceutiques.
</p>
<p>L&#8217;interface utilisateur (cf. figure 1) comprend une fen&#234;tre de texte par langue ainsi qu&#8217;une
fen&#234;tre pr&#233;sentant l&#8217;arbre s&#233;mantique construit par le biais d&#8217;interactions dans les fen&#234;tres de
texte. Cette fen&#234;tre est pr&#233;sent&#233;e ici &#224; des fins d&#8217;illustration, mais n&#8217;est pas n&#233;cessaire dans
une phase de production. L&#8217;auteur interagit dans les fen&#234;tres de texte en cliquant sur un mot :
s&#8217;il s&#8217;agit d&#8217;un non-terminal (cf. le mot form dans le menu de la figure 1), un menu appara&#238;t</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Lapalme, Caroline Brun, Marc Dymetman
</p>
<p>dans lequel les choix valides sont pr&#233;sent&#233;s &#224; l&#8217;utilisateur qui s&#233;lectionne un &#233;l&#233;ment parmi ces
possibilit&#233;s ou effectue un retour-arri&#232;re. Lorsque un choix est effectu&#233; pour un langage donn&#233;
(cream dans la figure 1), l&#8217;arbre s&#233;mantique est mis &#224; jour pour refl&#233;ter le choix: pharmForm
prend la valeur creme dans la fen&#234;tre s&#233;mantique de la figure 2 et le mot correspondant cr&#232;me
est produit dans le texte fran&#231;ais. Dans ce cas pr&#233;cis, le mode &#8220;automatique&#8221; du syst&#232;me est
actif : toutes les mises &#224; jour obligatoires qui d&#233;pendent directement du choix que vient de
faire l&#8217;auteur sont effectu&#233;es. Sur la figure 2, on peut observer que conditionnement est de-
venu tube, puisqu&#8217;il s&#8217;agissait de la seule possibilit&#233; compatible avec la forme pharmaceutique
creme. De la m&#234;me fa&#231;on, le mode d&#8217;administration modeEmploi a &#233;t&#233; mis &#224; jour par sa r&#233;ali-
sation textuelle (&#224; nouveau la seule compatible avec creme). Les actions correspondantes sont
&#233;galement r&#233;alis&#233;es en fran&#231;ais.
</p>
<p>Comme son nom le sugg&#232;re, MDA-XML est une reconstruction syst&#233;matique des id&#233;es d&#233;velop-
p&#233;es dans le projet MDA, avec cependant certaines variantes dans les choix d&#8217;implantation : les
grammaires sont d&#233;crites dans un format XML contr&#244;l&#233; par un sch&#233;ma, au lieu de l&#8217;&#234;tre dans la
notation propri&#233;taire inspir&#233;e de Prolog; toutes les interactions et interpr&#233;tations sont faites en
Java, au sein duquel une version simplifi&#233;e (unification de termes atomiques seulement) du m&#233;-
canisme d&#8217;unification de Prolog est r&#233;implant&#233;e : l&#8217;utilisation d&#8217;un interpr&#233;teur Prolog comme
dans la version actuelle du syst&#232;me MDA n&#8217;est plus n&#233;cessaire.
</p>
<p>Id&#233;alement nous aurions souhait&#233; implanter les r&#232;gles s&#233;mantiques et grammaticales dans des
sch&#233;mas XML. Bien que des expressions r&#233;guli&#232;res ou des contraintes d&#8217;occurrence puissent
&#234;tre d&#233;finies pour des &#233;l&#233;ments, le standard XML actuel ne dispose que de contraintes limit&#233;es
entre diff&#233;rents &#233;l&#233;ments : seules quelques contraintes relativement simples concernant l&#8217;unicit&#233;
d&#8217;identificateurs et de r&#233;f&#233;rences peuvent &#234;tre impos&#233;es. Il existe des propositions plus &#233;tendues
de mod&#232;les de contraintes, mais elles reposent pour la plupart sur des processus externes (par
exemple XSLT) et ne sont pas adapt&#233;es &#224; un environnement interactif comme MDA-XML. Nous
avons donc d&#233;fini notre propre format de r&#232;gle : il s&#8217;agit d&#8217;une adaptation plus ou moins directe
du format des grammaires &#224; clauses d&#233;finies se conformant aux conventions XML et inspir&#233;e
de la syntaxe des d&#233;finitions et des appels de &#8220;mod&#232;les&#8221; (templates) des feuilles de style XSLT.
Ces r&#232;gles peuvent &#234;tre valid&#233;es syntaxiquement par un sch&#233;ma, mais il serait int&#233;ressant d&#8217;en
permettre une validation d&#8217;ordre s&#233;mantique en cours d&#8217;&#233;dition. Un autre avantage important
est que ce sch&#233;ma peut &#234;tre utilis&#233; dans le cadre d&#8217;un &#233;diteur XML qui peut ainsi sugg&#233;rer les
expansions possibles des r&#232;gles &#224; chaque &#233;tape de leur d&#233;finition.
</p>
<p>Une grammaire &#8220;MDA-XML&#8221; bilingue fran&#231;ais/anglais (environ 2500 lignes de XML) a &#233;t&#233;
d&#233;velopp&#233;e pour la r&#233;daction assist&#233;e de notices pharmaceutiques. Un des aspects int&#233;ressants
de cette exp&#233;rience r&#233;side dans l&#8217;utilisation de standards industriels XML; par exemple les vues
&#8220;Authentic&#8221; et tabulaires de XMLSpy (XML Spy, 2002), qui permettent d&#8217;utiliser des sug-
gestions d&#233;duites du sch&#233;ma, simplifient la saisie des r&#232;gles. Les balises XML sont cach&#233;es au
d&#233;veloppeur dans ce mode. Contrairement au syst&#232;me MDA initial, MDA-XML est enti&#232;rement
d&#233;velopp&#233; en Java et ne d&#233;pend donc pas d&#8217;une communication avec un interpr&#233;teur Prolog ex-
terne pour les calculs et la mise &#224; jour du texte, ce qui permet de conjuger portabilit&#233; et rapidit&#233;.
Il pr&#233;sente cependant certains inconv&#233;nients, car le pouvoir expressif de l&#8217;interpr&#233;teur Prolog
permet de simplifier les grammaires par l&#8217;utilisation du non-d&#233;terminisme. Actuellement MDA-
XML ne dispose pas d&#8217;une implantation compl&#232;te du m&#233;canisme d&#8217;unification, ce qui rend dif-
ficile la description de listes r&#233;cursives corr&#233;l&#233;es. Comme dans le syst&#232;me MDA, l&#8217;interaction
se fait par le biais du texte, ce qui nous semble une approche assez naturelle. Cependant, il
serait int&#233;ressant de voir si l&#8217;arbre s&#233;mantique peut aussi &#234;tre utilis&#233; &#224; cette fin. M&#234;me si au-
cune difficult&#233; technique ne se pose pour proposer des choix s&#233;mantiques dans la fen&#234;tre de vue</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MDA-XML : une exp&#233;rience de r&#233;daction contr&#244;l&#233;e multilingue bas&#233;e sur XML
</p>
<p>Figure 1: Apr&#232;s que l&#8217;utilisateur a s&#233;lectionn&#233; form, un menu des choix possibles lui est pr&#233;sent&#233;.
</p>
<p>Figure 2: &#201;tat de MDA-XML apr&#232;s que l&#8217;utilisateur a choisi cream dans 1. Les choix devenus obli-
gatoires sont mis &#224; jour : conditionnement prend la valeur tube et usage est remplac&#233; par une phrase
appropri&#233;e. L&#8217;information s&#233;mantique a aussi &#233;t&#233; mise &#224; jour dans la fen&#234;tre Semantics : pharmform
prend la valeur creme, cond prend la valeur condCreme et modeEmploi prend la valeur modeCreme.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guy Lapalme, Caroline Brun, Marc Dymetman
</p>
<p>de l&#8217;arbre s&#233;mantique, il faudrait pousser plus avant les exp&#233;rimentations sur l&#8217;interface util-
isateur, pour &#233;valuer la convivialit&#233; d&#8217;une interaction purement s&#233;mantique. Actuellement, les
grammaires subissent une v&#233;rification de coh&#233;rence s&#233;mantique et de compl&#233;tude lors de leur
analyse par MDA-XML, le sch&#233;ma actuel ne pouvant exprimer que des v&#233;rifications syntax-
iques relativement simples. Il serait &#233;galement int&#233;ressant d&#8217;approfondir notre r&#233;flexion pour
int&#233;grer ces v&#233;rifications s&#233;mantiques dans le sch&#233;ma lui-m&#234;me.
</p>
<p>Conclusion
</p>
<p>Nous avons d&#233;crit MDA-XML, un prototype de r&#233;daction contr&#244;l&#233;e multilingue d&#233;velopp&#233; dans
un environnement XML. Les r&#232;gles de grammaires, &#233;crites en XML, peuvent &#234;tre vues comme
des variantes linguistiquement expressives de sch&#233;mas XML. Le syst&#232;me, enti&#232;rement impl&#233;-
ment&#233; en Java (l&#8217;analyseur, l&#8217;interpr&#233;teur de grammaire et l&#8217;interface graphique), a &#233;t&#233; appliqu&#233;
&#224; une classe de documents pharmaceutiques. Ce travail est un exemple d&#8217;utilisation des outils
XML dans un contexte de r&#233;daction contr&#244;l&#233;e s&#8217;&#233;tendant au-del&#224; du formatage vers des exten-
sions int&#233;grant des aspects s&#233;mantiques et dynamiques dans le processus de r&#233;daction.
</p>
<p>R&#233;f&#233;rences
BOARDMAN R. (1999). An XML/XSL architecture for language-neutral document authoring. Master&#8217;s
thesis, Centre for Cognitive Science, Edinburgh University.
BRUN C. &amp; DYMETMAN M. (2002). R&#233;daction multilingue assist&#233;e dans le mod&#232;le MDA, Dans Multi-
linguisme et traitement de l&#8217;information, p. 129&#8211;152. Trait&#233; des sciences et techniques de l&#8217;information.
Herm&#232;s.
BRUN C., DYMETMAN M., FANCHON E. &amp; LHOMME S. (2002). Controlled authoring of biological
experiment reports. &#224; para&#238;tre dans EACL&#8217;03 demo session, p. 4 pages.
BRUN C., DYMETMAN M. &amp; LUX V. (2000). Document structure and multilingual authoring. Dans
Proceedings of the First International Natural Language Generation Conference (INLG&#8217;2000), p. 24&#8211;31,
Mitzpe Ramon, Israel.
CAWSEY A. (2000). Presenting tailored resource descriptions: Will XSLT do the job? Dans 9th
International World Wide Web Conference.
DYMETMAN M. (2002). Text authoring, knowledge acquisition and description logics. Dans Proceed-
ings of Coling 2002, Taiwan.
DYMETMAN M., LUX V. &amp; RANTA A. (2000). XML and multilingual document authoring: converg-
ing trend. Dans Proceedings of the The 18th International Conference on Computational Linguistics
(COLING 2000), p. 243&#8211;249, Saarbruecken: COLING.
POWER R. &amp; SCOTT D. (1998). Multilingual authoring using feedback texts. Dans Coling-ACL, p.
1053&#8211;1059, Montr&#233;al.
RANTA A. (2002). Grammatical framework. a type-theoretical grammar formalism. to appear in Jour-
nal of Functional Programming.
WILCOCK G. (2001). Pipelines, templates and transformations: XML and natural language generation.
Dans Proceedings of the first XML and NLP workshop, p. 1&#8211;8.
XML Spy (2002). XML Spy 5 Entreprise Edition Manual. Altova Corp.</p>

</div></div>
</body></html>