<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un logiciel pour la mise au point de grammaires pour le filtrage d&#8217;information en arabe (cas de l&#8217;information citationnelle)</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Un logiciel pour la mise au point de grammaires pour le filtrage 
d&#8217;information en arabe  
</p>
<p>(cas de l&#8217;information citationnelle) 
 
</p>
<p>Andr&#233; Jaccarini (1), Ghassan Mourad (1),  Christian Gaubert (2) et Brahim 
Djioua (1) 
</p>
<p> 
</p>
<p>(1) LaLICC &#8211; UMR 8139 
Universit&#233; de Paris-Sorbonne &#8211; CNRS 
</p>
<p>96, Bd Raspail 
Paris 75006 
</p>
<p>prenom.nom@paris4.sorbonne.fr 
(2) IFAO 
</p>
<p>Rue al-Cheikh Ali Youssef. Qasr al-A&#239;ny 11562, Le Caire 
cgaubert@link.net 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Nous pr&#233;sentons dans ce travail un logiciel de mise au point de grammaires pour le traitement 
morpho-syntaxique de l&#8217;arabe et l&#8217;&#233;tablissement de grammaires pour le filtrage et l&#8217;extraction 
d&#8217;information en arabe. Ce logiciel est fond&#233; sur le principe des automates. L&#8217;analyse 
morpho-syntaxique de l&#8217;arabe est r&#233;alis&#233; sans le recours au lexique.  
</p>
<p> 
</p>
<p>We present in this work a software of grammars development for the arabic morpho-
syntactical processing and for the construction of filtering grammars and information 
retrieval. This software is founded on the automata. It can parse arabic text without lexicon. 
</p>
<p>Keywords &#8211; Mots Cl&#233;s  
</p>
<p>Sarfiyya, traitement automatique de l&#8217;arabe, automate, filtrage d&#8217;information, citation. 
</p>
<p>Sarfiyya, Arabic processing, automaton, information retrieval. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Jaccarini, Ghassan Mourad,  Christian Gaubert et Brahim Djioua   
 
</p>
<p>1 Pr&#233;sentation g&#233;n&#233;rale 
</p>
<p>Le logiciel Sarfiyya a &#233;t&#233; r&#233;alis&#233; dans le cadre d&#8217;une &#233;tude sur les m&#233;thodes de 
construction d&#8217;une classe d&#8217;analyseurs morphologiques de la langue arabe guid&#233;s par la 
syntaxe. Ces analyseurs pr&#233;sentent la particularit&#233; de pouvoir fonctionner sans lexique1. Ce 
logiciel a &#233;t&#233; con&#231;u pour des chercheurs cherchant &#224; tester des hypoth&#232;ses linguistiques. C&#8217;est 
un outil de manipulation et d&#8217;&#233;valuation des grammaires qui prend en compte la profonde 
sp&#233;cificit&#233; de l&#8217;arabe, notamment sur le plan morphologique (racine tri-consonantique et 
r&#233;gularit&#233; de la morphologie dite saine qui peut s&#8217;&#233;tendre, par transduction, &#224; l&#8217;ensemble du 
syst&#232;me morphologique). Il s&#8217;appuie sur le r&#244;le pr&#233;pond&#233;rant des atomes morphologiques 
pour l&#8217;analyse syntaxique ainsi que sur les variations des grammaires en vue de l&#8217;obtention de 
l&#8217;algorithme optimum face &#224; des situations vari&#233;es de traitement automatique de l&#8217;arabe. Les 
grammaires sont appliqu&#233;s pour mettre en &#233;vidence des relations entre cat&#233;gories 
morphosyntaxiques, mais ces grammaires sont elle m&#234;me modifiables par l&#8217;utilisateur dans un 
cadre graphique (module Visigram) et mesurable. Nous avons montr&#233; (AUDEBERT, 
JACCARINI 94) qu&#8217;il est essentiel de se donner la possibilit&#233; de changer facilement de point 
de vue. La m&#233;thode de recherche de l&#8217;algorithme optimum par variation de la grammaire se 
r&#233;v&#232;le l&#8217;une des plus efficaces. Cette constatation nous a d&#8217;ailleurs amen&#233; &#224; concevoir le 
noyau d&#8217;un environnement de g&#233;nie linguistique, comportant un &#233;diteur structurel 
(JACCARINI 01) ainsi qu&#8217;un atelier de grammaire, qui constitue la base &#224; partir de laquelle 
s&#8217;est d&#233;velopp&#233; Sarfiyya (GAUBERT 01). Mais pour pouvoir d&#233;terminer concr&#232;tement la 
grammaire optimale relativement &#224; une application d&#233;termin&#233;e la m&#233;thode exp&#233;rimentale se 
r&#233;v&#232;le indispensable. Or cette m&#233;thode peut maintenant &#234;tre mise en &#339;uvre gr&#226;ce au logiciel 
Sarfiyya, qui permet de travailler en mode de plus en plus interactif et qui assure ainsi un va 
et vient continuel entre le mod&#232;le th&#233;orique et son impl&#233;mentation (r&#233;f). Ainsi se construit 
peu &#224; peu un cadre unifi&#233;, o&#249; toutes les grammaires peuvent appara&#238;tre comme d&#233;rivant, par 
transformation, d&#8217;un noyau de base non fig&#233;. Dans cette perspective, chaque grammaire 
repr&#233;sente un point de vue particulier sur le langage et la construction d&#8217;une application 
linguistique d&#233;termin&#233;e pourrait alors &#234;tre vue, avant tout, comme le choix du point de vue 
idoine. Ce choix n&#8217;est en fait que celui d&#8217;une d&#233;finition de hi&#233;rarchie parmi les principaux 
crit&#232;res d&#8217;&#233;valuation de grammaires que l&#8217;on est en train en ce moment d&#8217;&#233;tablir 
exp&#233;rimentalement (GAUBERT 01). Le travail d&#8217;exp&#233;rimentation sur les m&#233;thodes 
d&#8217;&#233;valuation doit donc, dans cette logique, &#234;tre poursuivi en priorit&#233;. Ce logiciel poss&#232;de un 
certain nombre de fonctionnalit&#233;s g&#233;n&#233;rales qui en font un syst&#232;me de manipulation et de 
transformation de grammaires (automates finis, automates r&#233;cursifs, et bient&#244;t transducteurs 
&#233;quivalents &#224; des grammaires &#224; attributs2). Le logiciel permet, de d&#233;clarer directement les 
grammaires sous formes graphiques (r&#233;seaux de transition) ou bien par un syst&#232;me de 
sp&#233;cification s&#8217;apparentant aux syst&#232;mes de r&#233;&#233;criture mais il permet surtout l&#8217;assemblage de 
</p>
<p>                                                 
1 Plus pr&#233;cis&#233;ment ces analyseurs peuvent fonctionner sous diff&#233;rentes options allant du lexique vide au lexique 
</p>
<p>maximal. Mis &#224; part quelques formes fig&#233;es &#8211; ou atomes - les lex&#232;mes arabes peuvent &#234;tre consid&#233;r&#233;s, dans la 
plupart des cas, comme la combinaison d&#8217;un sch&#232;me et d&#8217;une racine tri-consonantique non connexe. Le 
sch&#232;me peut &#234;tre consid&#233;r&#233; soit comme un op&#233;rateur s&#8217;appliquant &#224; un triplet valide, soit comme une classe 
d&#8217;&#233;quivalence qui est aussi une classe de congruence syntaxique. 
</p>
<p>2 Les analyseurs pour transducteurs non d&#233;terministes, auxquels on peut associer &#224; chaque transitions des tests et 
des actions, notamment sous forme de lambda-expressions, ont &#233;t&#233; test&#233; en Lisp. Ils doivent &#234;tre r&#233;&#233;crit en 
vue de leur int&#233;gration dans Sarfiyya. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un logiciel pour la mise au point des grammaires pour le filtrage d&#8217;information par (cas de 
l&#8217;information citationnelles) 
</p>
<p>sous-grammaires, leurs transformations, la d&#233;finition de sch&#233;mas de grammaires et la 
synth&#232;se (&#224; partir de listes de mots ou d&#8217;&#233;tiquettes, de fragments de phrases,&#8230;) de sous-
grammaires et leurs insertion dans le sch&#233;ma g&#233;n&#233;ral. Il offre plusieurs possibilit&#233;s de 
manipulation et de transformation illustr&#233;es par les diff&#233;rentes op&#233;rations disponibles dont on 
peut citer quelques unes : la transformation d&#233;terministe, la minimisation, la normalisation, 
l&#8217;insertion, la synth&#232;se d&#8217;automate &#224; partir de liste d&#8217;&#233;l&#233;ments du vocabulaire terminal ou 
auxiliaire, la combinaison de grammaires, la modification des cat&#233;gorisations, la factorisation, 
etc. Il est possible par exemple de d&#233;finir des sch&#233;mas de grammaires dont certaines 
transitions repr&#233;sentent des sous-automates qui peuvent &#234;tre directement synth&#233;tis&#233;s &#224; partir 
de segments de phrases : le syst&#232;me permettant de cr&#233;er l&#8217;automate d&#8217;acceptation, les analyser 
morphologiquement (selon les diff&#233;rentes grammaires ou fragment de grammaires 
disponibles) en vue de cr&#233;er des suites d&#8217;&#233;tiquettes, qui sont ensuite organis&#233; en automate, que 
l&#8217;on peut &#233;ventuellement rendre d&#233;terministes, pour les r&#233;ins&#233;rer ensuite dans le sch&#233;ma 
g&#233;n&#233;ral. 
</p>
<p>2 Illustration de certaines fonctionnalit&#233;s linguistiques du logiciel 
</p>
<p>Afin d&#8217;illustrer certaines fonctionnalit&#233;s linguistiques pouvant &#234;tre directement engendr&#233;es &#224; 
partir de Sarfiya, consid&#233;rons un sc&#233;nario tr&#232;s simple . Il serait possible par exemple de 
construire progressivement un extracteur automatique de citation en arabe en adaptant les 
m&#233;thodes d&#8217;exploration contextuelle mise au point au LaLICC (DESCLES 97, MOURAD 
01). Nous mentionnerons ci-dessous quelques exemples pour fixer les id&#233;es. Commen&#231;ons 
par consid&#233;rer le marqueur linguistique le plus courant : q&#226;la mot* inna (a-dit mot* que). Les 
portions d&#8217;automates allant de 1 &#224; 3 et de 15 &#224; 17 (voir fig.1) indiquent respectivement les 
d&#233;buts et fins de phrases. Il s&#8217;agit de sous automates standards que l&#8217;on peut directement 
importer en appuyant sur des touches du clavier (D et F). La portion d&#8217;automate allant de 9 &#224; 
11, &#233;galement standard, indique une succession de mots : il s&#8217;agit dans ce cas du &#171; citant &#187; qui 
est ainsi identifi&#233;. Quant &#224; la portion allant de 15 &#224; 17 : elle repr&#233;sente la citation. 
</p>
<p> 
</p>
<p>Figure1 : l&#8217;automate &#171; qala inna &#187; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Jaccarini, Ghassan Mourad,  Christian Gaubert et Brahim Djioua   
 
</p>
<p> 
</p>
<p>Tous les &#171; citants &#187; ont &#233;t&#233; ici identifi&#233;s. Il s&#8217;agit des cha&#238;nes de caract&#232;res accept&#233;es par la 
portion d&#8217;automate allant de 9 &#224; 11. En modifiant les cat&#233;gories (de 15 &#224; 17), il aurait &#233;t&#233; 
&#233;galement possible d&#8217;afficher les citations  introduites par le verbe q&#226;la. Mais cet automate 
est nettement insuffisant pour d&#233;celer toutes les citations introduites par q&#226;la puisque l&#8217;on ne 
tient pas compte de la possibilit&#233; d&#8217;agglutination des pronoms postfixes &#224; la particule inna ni 
de la conjugaison du verbe q&#226;la qui est ici &#224; la troisi&#232;me personne de l&#8217;accompli (forme de 
r&#233;f&#233;rence). Pour pallier ces d&#233;fauts il faut donc ins&#233;rer en 13 l&#8217;automate repr&#233;sentant les 
postfixes que l&#8217;on aura au pr&#233;alable normalis&#233; pour qu&#8217;il ne contienne plus qu&#8217;un seul &#233;tat 
terminal, lequel pourra alors &#234;tre fusionn&#233; avec l&#8217;&#233;tat 14 (voir fig.2 o&#249; l&#8217;&#233;tat 14 de fig.1 
devient l&#8217;&#233;tat 25). Les automates repr&#233;sentant les formes verbales conjugu&#233;es peuvent 
repr&#233;senter un niveau de complexit&#233; assez consid&#233;rable mais ils sont d&#233;j&#224; contenus comme 
ressources linguistiques dans Sarfiyya, tout comme d&#8217;ailleurs les automates nominaux ou 
ceux repr&#233;sentant les atomes morphologiques. Ces automates synth&#233;tisent suffisamment 
d&#8217;informations linguistiques pour pouvoir effectuer des analyses en s&#8217;affranchissant 
totalement du lexique. Ces automates plus ou moins complexes ne seront pas &#224; reconstituer : 
il suffira de savoir les r&#233;ins&#233;rer, gr&#226;ce aux multiples fonctionnalit&#233;s qu&#8217;offre Sarfiyya - 
notamment gr&#226;ce aux diff&#233;rentes op&#233;rations que l&#8217;on peut effectuer sur les grammaires - aux 
bons endroits dans des sch&#233;mas de grammaires simples que l&#8217;on peut ais&#233;ment d&#233;finir gr&#226;ce 
au module de visualisation VisiGram. Dans le cas de graphes tr&#232;s complexes et non planaires, 
repr&#233;sentant des grammaires, il est aussi possible de les modifier en ayant recours au mode 
texte (c&#8217;est &#224; dire au syst&#232;me de r&#233;&#233;criture). En effet le dessin du graphe de transition dans 
Visigram engendre automatiquement les r&#232;gles de production correspondant &#224; ce graphe et 
inversement la red&#233;finition de ces r&#232;gles (en mode texte) modifie le graphe correspondant. 
</p>
<p> 
</p>
<p>figure.2 : Citations introduites par q&#226;la + pronoms affixes agglutin&#233;s au inna. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un logiciel pour la mise au point des grammaires pour le filtrage d&#8217;information par (cas de 
l&#8217;information citationnelles) 
</p>
<p> 
</p>
<p>On remarquera toutefois pour ce qui est de la derni&#232;re extraction qu&#8217;il ne s&#8217;agit plus 
dans ce cas  du &#171; citant &#187; mais du destinataire de la citation. Ce ph&#233;nom&#232;ne est d&#251; &#224; 
l&#8217;agglutination du pronom postfixe &#224; la particule inna. L&#8217;automate de la figure 3 repr&#233;sente 
une extension de celui de la figure 1 &#224; deux autres marqueurs linguistiques : akkada (assurer) 
et a&#8217;lana (d&#233;clarer). On voit ici l&#8217;importance de la fonction d&#8217;importation des mots car il 
existe plusieurs dizaines de marqueurs de ce type et il serait tr&#232;s difficile de construire 
directement un automate fonctionnant lettre &#224; lettre qui les repr&#233;senterait tous. Dans ce cas 
c&#8217;est &#224; partir de la liste (qala, akkada, a&#8217;lana ) que le fragment d&#8217;automate les repr&#233;sentant a 
&#233;t&#233; synth&#233;tis&#233;, qui a &#233;t&#233; ensuite rendu d&#233;terministe par factorisation, et minimis&#233; et qu&#8217;il a 
fallu aussi normaliser (un seul &#233;tat terminal), pour qu&#8217;il ne pr&#233;sente qu&#8217;un seul point de 
raccordement permettant ainsi de le r&#233;ins&#233;rer dans le sch&#233;ma g&#233;n&#233;ral. On remarquera 
toutefois que cet automate simplifi&#233; est quelque peu permissif en ce sens que la transition 10-
11, &#233;tiquet&#233;e &#224; la fois par un alif nu correspondant &#224; celui du anna (puique dans ce cas le 
signe diacritique hamza plac&#233; au dessus du graph&#232;me principal est le plus souvent omis dans 
le syst&#232;me d&#8217;&#233;criture standard), soit par un alif hamz&#233; correspondant au inna (dans ce cas le 
signe diacritique, plac&#233; sous le graph&#232;me principal, est le plus souvent marqu&#233;)3 , ne permet 
pas de discriminer le cas g&#233;n&#233;ral (verbe mot* anna) du cas particulier (qala mot* inna) qui 
constitue en fait une exception. Mais cette non discrimination n&#8217;a de cons&#233;quence que si l&#8217;on 
&#233;crit fautivement qala anna en notant le signe diacritique.  
</p>
<p>Cet automate ne tient toutefois pas compte, comme le pr&#233;c&#233;dent (fig.2) de la possibilit&#233; 
d&#8217;agglutination des pronoms postfixes &#224; la particule inna pas plus que des conjugaisons des 
verbes. Cette derni&#232;re n&#8217;affecte pas la forme verbale de la m&#234;me mani&#232;re selon qu&#8217;il s&#8217;agit 
d&#8217;un verbe sain, dont la racine ne contient que des consonnes, ou d&#8217;un verbe qui ne l&#8217;est pas, 
dont la racine contient au moins une semi-consonne instable. Il y aura donc lieu de s&#233;parer les 
deux cas et de construire deux familles d&#8217;automates pour tenir compte dans le cas des verbes 
non sain des ph&#233;nom&#232;nes d&#8217;effacement, de permutation ou d&#8217;&#233;lision. 
</p>
<p> 
</p>
<p>figure3 : extension &#224; trois marqueurs linguistiques 
</p>
<p>                                                 
3 Il s&#8217;agit en fait d&#8217;une double transition </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Andr&#233; Jaccarini, Ghassan Mourad,  Christian Gaubert et Brahim Djioua   
 
</p>
<p>Tous les &#171; cit&#233;s &#187; ont &#233;t&#233; ici identifi&#233;s. Il s&#8217;agit des cha&#238;nes de caract&#232;res accept&#233;es par la 
portion d&#8217;automate allant de 9 &#224; 11. En modifiant les cat&#233;gories (de 15 &#224; 17), il aurait &#233;t&#233; 
&#233;galement possible d&#8217;afficher les citations  introduites par le verbe q&#226;la. 
</p>
<p>3 Conclusion  
</p>
<p>Ce travail vise au d&#233;veloppement d&#8217;une application sur le Traitement Automatique de la 
Langue Arabe  (TALA). En s&#8217;appuyant sur des ph&#233;nom&#232;nes linguistiques dans les documents, 
le but de ce travail est le filtrage s&#233;mantique de textes journalistiques et de vulgarisations 
scientifiques arabe. Il est clair qu&#8217;actuellement il est possible de parler d&#8217;un traitement 
automatique de l&#8217;arabe. La pr&#233;sence actuelle de textes sous format num&#233;rique ne confirme pas 
seulement la possibilit&#233; d&#8217;un traitement automatique, mais aussi de sa r&#233;elle faisabilit&#233;. Ceci, 
en partie gr&#226;ce aux d&#233;veloppements technologiques de logiciels qui prennent en compte 
l&#8217;&#233;criture arabe (surtout par le codage Unicode). Sarfiyya s&#8217;est av&#233;r&#233; &#234;tre un excellent outil de 
mise au point de grammaires optimis&#233;es pour le traitement de l&#8217;arabe, il permet leurs 
conceptions assist&#233;es et la gestion de leurs variations, l&#8217;extension et l&#8217;accessibilit&#233; des 
donn&#233;es linguistiques, l&#8217;analyse et les mesures compar&#233;es de textes par ces grammaires. Il 
permet de proc&#233;der aux complexifications modulaires des grammaires &#224; partir d&#8217;un noyau 
minimal. Il constitue surtout un outils puissant d&#8217;une m&#233;thode rigoureuse d&#8217;&#233;valuation des 
grammaires. Les premiers r&#233;sultats obtenus dont nous avons fournis quelques exemples sont 
encourageants. Nos perspectives vont vers le filtrage de textes pour le r&#233;sum&#233; automatique et 
la recherche de certains notions s&#233;mantique comme les d&#233;finitions, les annonces th&#233;matiques, 
etc. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>AUDEBERT, C. JACCARINI, A., (1994). M&#233;thode de variation de grammaire et algotithme 
morphologique, Bulletin d&#8217;Etudes Orientales XVI, IFEAD, pp. 77-97. 
</p>
<p>JACCARINI, A., (2001), A modifiable structural editor of grammars for arabic processing. 
Proceedings of the ACL/EACL 2001 Workshop, ARABIC Language Processing. Toulouse. 
</p>
<p>GAUBERT Ch., (2001), Strat&#233;gie et r&#232;gles minimales pour un traitement automatique de 
l&#8217;arabe, th&#232;se de doctorat, Universit&#233; Aix-Marseille I.  
</p>
<p>DESCLES,  J.-P., (1997), Syst&#232;mes d'exploration contextuelle. Co-texte et calcul du sens. &#233;d. 
Claude Guimier, Presses Universitaires de Caen, pp. 215-232. 
</p>
<p>MOURAD, G., (2001) &#171; Analyse informatique des signes  typographiques pour la 
segmentation de textes et l&#8217;extraction automatique des citations. R&#233;alisation des applications 
informatiques SegATex et CitaRE, th&#232;se de Doctorat de l&#8217;universit&#233; de Paris-Sorbonne, 2 
novembre 2001. 
</p>
<p>SILBERZTEIN, M., (1993), Dictionnaires &#233;lectroniques et analyse automatique de textes, Le 
syst&#232;me INTEX, Paris, Masson. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANNEXE COMMANDES 
 
</p>
<p>Commande Description &#201;tats Arcs 
Nouvel &#233;tat ins&#232;re un &#233;tat E+1 pr&#232;s de E E &#8211; 
&#201;tat final rend E final ou non final  E &#8211; 
Nouvel arc cr&#233;e une transition epsilon inactive entre 
</p>
<p>E1 et E2 
E1 et E2 &#8211; 
</p>
<p>Modifier arc ouvre la palette de saisie d'une &#233;tiquette 
d'arc 
</p>
<p>&#8211; A 
</p>
<p>D&#233;sactiver arc d&#233;sactive l'ensemble des transitions de 
l'arc 
</p>
<p>&#8211; A 
</p>
<p>Supprimer arc supprime A &#8211; A 
Ins&#233;rer / substituer 
grammaire 
</p>
<p>&#8211; dialogue ouverture Gram 1- ins&#232;re Gram 
en E (ins&#233;rer) 2- substitue Gram &#224; l'arc 
entre E1 et E2 
</p>
<p>1- E 2- E1 et 
E2 
</p>
<p>&#8211; 
</p>
<p>Modifier cat&#233;gorie 
grammaire 
</p>
<p>dialogue permettant de changer 
uniform&#233;ment la cat&#233;gorie des arcs de la 
s&#233;lection 
</p>
<p>E1 &#224; En &#8211; 
</p>
<p>Extraire grammaire supprime tous les &#233;tats sauf ceux 
s&#233;lectionn&#233;s 
</p>
<p>E1 &#224; En &#8211; 
</p>
<p>Factoriser grammaire factorise de proche en proche &#224; partir de E E &#8211; 
Normaliser grammaire normalise G: regroupe tous les &#233;tat finaux 
</p>
<p>vers un &#233;tat final et terminal de plus grand 
num&#233;ro 
</p>
<p>&#8211; &#8211; 
</p>
<p>Inverser grammaire calcule la grammaire acceptant le langage 
inverse, si G est d&#233;j&#224; normalis&#233;e 
</p>
<p>&#8211; &#8211; 
</p>
<p>Remplacer &#233;tat  par 
arc 
</p>
<p>tous les arcs rentrants de E sont conserv&#233;s, 
tous les &#233;tat sortants sortent d'un nouvel 
&#233;tat E+1, E et E+1 sont reli&#233;s par un arc 
epsilon. 
</p>
<p>E &#8211; 
</p>
<p>Fusionner &#233;tats tous les arcs rentrants ou sortants de E2 
sont d&#233;tourn&#233;s vers/de E 
</p>
<p>E1, E2 &#8211; 
</p>
<p>&#201;changer &#233;tats E1 et E2 sont permut&#233;s E1, E2 &#8211; 
Importer des mots une grammaire factoris&#233;e acceptant tous 
</p>
<p>les mots de la s&#233;lection courante est 
ins&#233;r&#233;e en E 
</p>
<p>E &#8211; 
</p>
<p>ED/ Couper efface la sous-grammaire s&#233;lectionn&#233;e en 
la m&#233;morisant 
</p>
<p>E1 &#224; En &#8211; 
</p>
<p>ED/ Copier m&#233;morise la sous-grammaire s&#233;lectionn&#233;e E1 &#224; En &#8211; 
ED/ Coller fonctionnement identique &#224; 
</p>
<p>inserser/substituer avec G m&#233;moris&#233;e 
1- E 2- E1, E2 &#8211; 
</p>
<p>ED/ Effacer efface la sous-grammaire s&#233;lectionn&#233;e 
sans la m&#233;moriser 
</p>
<p>E1 &#224; En &#8211; 
</p>
<p>ED/ Raz Grammaire efface toute la grammaire et installe une 
nouvelle = 1 &#233;tat 
</p>
<p>&#8211; &#8211; 
</p>
<p>ED/ Tout s&#233;lectionner s&#233;lectionne toute la grammaire &#8211; &#8211; 
ED/ Annuler/Refaire Annule ou r&#233;it&#232;re la derni&#232;re manipulation &#8211; &#8211; 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>

</div></div>
</body></html>