<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Quand le TAL robuste s&#146;attaque au langage parl&#233; : analyse incr&#233;mentale pour la compr&#233;hension de la parole spontan&#233;e</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Quand le TAL robuste s&#146;attaque au langage parl&#233; : 
analyse incr&#233;mentale pour la compr&#233;hension de la parole spontan&#233;e 
</p>
<p>Antoine Jean-Yves, Goulian J&#233;r&#244;me, Villaneau Jeanne 
</p>
<p>Laboratoire VALORIA &#150; Universit&#233; de Bretagne Sud 
Rue Yves Mainguy, F-56000 Vannes &#150; Mel : {Nom.Prenom}@univ-ubs.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233; &#150; Abstract 
</p>
<p>Dans cet article, nous discutons de l&#146;application au langage parl&#233; des techniques d&#146;analyse 
syntaxique robuste d&#233;velopp&#233;es pour l&#146;&#233;crit. Nous pr&#233;sentons deux syst&#232;mes de compr&#233;hension 
de parole spontan&#233; en situation de dialogue homme-machine finalis&#233;, dont les performances 
montrent la pertinence de ces m&#233;thodes pour atteindre une compr&#233;hension fine et robuste des 
&#233;nonc&#233;s oraux.  
</p>
<p>This papers discusses the relevance of robust parsing techniques for the analysis of spontaneous 
spoken language. It presents two speech understanding systems devoted to human-machine 
communication that implement such robust methods. Their performances suggest that robust 
parsing should apply usefully to spontaneous speech. 
</p>
<p>Keywords &#150; Mots Cl&#233;s 
</p>
<p>Analyse syntaxique robuste, compr&#233;hension de la parole, dialogue homme-machine. 
Robust parsing, spoken language understanding, human-machine dialogue.  
</p>
<p>1 TAL robuste et ing&#233;nierie des langues 
</p>
<p>Le TALN a connu au cours de la derni&#232;re d&#233;cennie une r&#233;volution &#233;pist&#233;mologique que r&#233;sume 
l&#146;&#233;mergence de la notion d&#146;ing&#233;nierie des langues. Alors que les recherches ant&#233;rieures 
privil&#233;giaient une approche en comp&#233;tence suivant la d&#233;marche de l&#146;Intelligence Artificielle, les 
ann&#233;es 1990 se sont concentr&#233;es sur la r&#233;alisation de syst&#232;mes performants mettant en jeu des 
utilisateurs r&#233;els (Cunningham, 2000). Cette &#233;volution s&#146;est traduite par l&#146;apparition d&#146;approches 
qui, sans renier l&#146;apport des travaux ant&#233;rieurs &#224; fort ancrage linguistique,  recherchent en 
priorit&#233; une robustesse et une efficacit&#233; d&#146;analyse sur du langage libre. On a ainsi vu se 
d&#233;velopper des analyseurs syntaxiques robustes reposant sur deux postulats principaux (Ejerhed, 
1993) : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine J.Y., Goulian J., Villaneau J. 
</p>
<p>&#8226; Analyse compl&#232;te mais superficielle (shallow parsing) limit&#233;e par exemple &#224; une 
segmentation en constituants minimaux non r&#233;cursifs, appel&#233;s chunks (Abney, 1991). 
</p>
<p>&#8226; Analyse non destructrice c&#146;est-&#224;-dire conservant toute l&#146;information pr&#233;sente dans l&#146;&#233;nonc&#233; 
pour des traitements ult&#233;rieurs plus profonds. En particulier, ces analyseurs privil&#233;gient la 
robustesse &#224; une d&#233;sambigu&#239;sation compl&#232;te &#151; mais risqu&#233;e &#151;  au niveau d&#146;analyse 
consid&#233;r&#233;. On parle alors de sous-sp&#233;cification de l&#146;analyse. 
</p>
<p>La g&#233;n&#233;ralisation de cette d&#233;marche sur plusieurs niveaux de traitements conduit &#224; une analyse 
incr&#233;mentale o&#249; chaque &#233;tape r&#233;pond aux m&#234;mes exigences (A&#239;t-Mokhtar et al, 2003): 
</p>
<p>&#8226; Analyse sous-sp&#233;cifi&#233;e et superficielle, au sens o&#249; la profondeur des repr&#233;sentations 
&#233;labor&#233;es ne s&#146;accro&#238;t que l&#233;g&#232;rement d&#146;un niveau &#224; l&#146;autre,  
</p>
<p>&#8226; Ind&#233;pendance conceptuelle vis-&#224;-vis de l&#146;analyse globale : les connaissances manipul&#233;es &#224; 
un niveau donn&#233; font sens par elles-m&#234;mes, 
</p>
<p>&#8226; Mise en &#156;uvre &#224; l&#146;aide de techniques efficaces (automates &#224; &#233;tats finis par exemple). 
</p>
<p>Regroup&#233;es souvent sous le terme de TAL robuste (robust parsing), ces approches pr&#233;sentent 
des performances int&#233;ressantes sur des textes libres. Elles ont jusqu&#146;&#224; pr&#233;sent surtout concern&#233; le 
langage &#233;crit. Au contraire, cet article s&#146;int&#233;resse &#224; leur application au langage parl&#233; et plus 
pr&#233;cis&#233;ment &#224; la compr&#233;hension de parole en situation de dialogue homme-machine finalis&#233;. 
</p>
<p>2 Compr&#233;hension de parole et dialogue oral homme-machine 
</p>
<p>Les syst&#232;mes de dialogue reposent sur une architecture proche, en premi&#232;re approximation, de 
celle donn&#233;e en figure 1. Le message oral de l'utilisateur est tout d'abord trait&#233; par un module de 
reconnaissance de parole qui fournit une (ou plusieurs) solution(s) class&#233;e(s) par scores de 
vraisemblance d&#233;croissants. Ces &#233;nonc&#233;s reconnus sont trait&#233;s par un module de compr&#233;hension 
de parole qui en construit une repr&#233;sentation s&#233;mantique caract&#233;risant la structuration de 
l&#146;information litt&#233;rale pr&#233;sente dans l&#146;&#233;nonc&#233;. Cette repr&#233;sentation est ensuite actualis&#233;e dans 
une &#233;tape d&#146;interpr&#233;tation contextuelle qui va r&#233;soudre certaines ambigu&#239;t&#233;s et co-r&#233;f&#233;rences. 
</p>
<p>reconnaissance
de parole
</p>
<p>compr&#233;hension
</p>
<p>g&#233;n&#233;ration de
r&#233;ponse
</p>
<p>gestion du
dialogue
</p>
<p>parole
&#233;nonc&#233;(s)
reconnu(s)
</p>
<p>structure
s&#233;mantique
</p>
<p>r&#233;ponse
</p>
<p>application
 
</p>
<p>Figure 1 &#151; Architecture g&#233;n&#233;rale d'un syst&#232;me de dialogue oral homme &#150; machine 
</p>
<p>L&#146;objectif de cette interpr&#233;tation est &#233;galement de caract&#233;riser les buts de l&#146;utilisateur en 
identifiant les actes de dialogues pr&#233;sents dans l&#146;&#233;nonc&#233;. C&#146;est pourquoi elle est souvent du 
ressort du contr&#244;leur de dialogue qui g&#232;re l&#146;interface avec l&#146;application (base de donn&#233;es par 
exemple) ainsi que l&#146;interaction avec l&#146;utilisateur (cha&#238;ne de g&#233;n&#233;ration variant en fonction de la 
modalit&#233; de sortie).  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TAL robuste et langage parl&#233; 
</p>
<p>Nous nous int&#233;resserons ici exclusivement &#224; l&#146;&#233;tape de compr&#233;hension des &#233;nonc&#233;s oraux, qui 
doit faire face &#224; deux probl&#232;mes qu&#146;on ne rencontre pas &#224; l&#146;&#233;crit. D&#146;une part, elle intervient sur 
une s&#233;quence de mots fortement bruit&#233;e par les erreurs du module de reconnaissance. En cas de 
dialogue interactif, on observe d'autre part de nombreuses constructions orales spontan&#233;es qui, 
tout en perturbant la reconnaissance, g&#234;nent l&#146;identification de la structure des &#233;nonc&#233;s : 
</p>
<p>&#8226; h&#233;sitations Je voudrais un aller simple pour euh attendez Rosporden c'est cela 
</p>
<p>&#8226; r&#233;parations  Savez-vous s'il y a un h&#244;tel un h&#244;tel-restaurant dans la gare (r&#233;p&#233;tition) 
                   Ce serait donc pour le retour non excusez-moi pour l'aller (correction) 
</p>
<p>&#8226; incises Je prends le premier train c'est &#224; dire je suis tr&#232;s press&#233; hein pour Paris 
</p>
<p>Afin de contourner ces difficult&#233;s, certains syst&#232;mes cherchent &#224; pr&#233;-traiter les &#233;nonc&#233;s oraux 
pour les corriger avant leur analyse. Les taux de correction rapport&#233;s (Heeman, 1997) restent 
cependant &#233;loign&#233;s d&#146;un traitement r&#233;ellement robuste. 
</p>
<p>3 Compr&#233;hension s&#233;lective de la parole 
</p>
<p>Une r&#233;ponse aux difficult&#233;s de traitement du langage parl&#233; consiste &#224; profiter du caract&#232;re 
finalis&#233; du dialogue pour d&#233;velopper des approches orient&#233;es par la t&#226;che. Dans ce cas, la 
compr&#233;hension se limite &#224; l&#146;identification d&#146;&#238;lots-cl&#233;s repr&#233;sentant des unit&#233;s de sens pertinentes 
dans l&#146;univers de la t&#226;che ou utiles &#224; la gestion du canal de communication. On parle alors de 
compr&#233;hension s&#233;lective restreinte au &#171; sens utile &#187; de l'&#233;nonc&#233; (P&#233;rennou, 1996). Celui-ci est 
repr&#233;sent&#233; par un ensemble de r&#244;les pragmatiques pr&#233;d&#233;finis qui sont instanci&#233;s par les 
segments-cl&#233;s caract&#233;ris&#233;s. 
</p>
<p>Bonjour je voudrais les vols euh la liste des 
vols pour Paris merci 
</p>
<p>&lt;type_requete = vols&gt; 
&lt;d&#233;part = LOCAL&gt; 
&lt;arriv&#233;e = Paris&gt; 
&lt;date_depart = AUHOURD'HUI&gt; 
</p>
<p>Figure 2 &#151; Exemple de sch&#233;ma obtenu en compr&#233;hension s&#233;lective de la parole 
</p>
<p>Le caract&#232;re partiel de ces traitements leur garantit une certaine robustesse d&#146;analyse. 
N&#233;anmoins, on peut s&#146;interroger sur leur extension &#224; des applications plus complexes. Toute 
augmentation de complexit&#233; se traduit en effet par une ambigu&#239;t&#233; lexicale accrue qui posera 
probl&#232;me &#224; des approches pr&#233;supposant &#171; qu&#146;il existe une projection non ambigu&#235; des &#233;nonc&#233;s 
de l&#146;usager vers les sch&#233;mas de l&#146;application &#187; (Pierrel, Romary, 2000 : 332). Dans le cas 
d&#146;applications &#233;tendues (multi-domaines), le recours &#224; une analyse linguistique plus d&#233;taill&#233;e 
appara&#238;t donc comme une n&#233;cessit&#233; (van Noord et al., 1999). Elle facilite par ailleurs la 
repr&#233;sentation d&#146;objets complexes comme l&#146;identification pr&#233;cise des intentions de l&#146;utilisateur 
(modaux ou des adverbes de degr&#233; par exemple). Cette finesse d&#146;analyse ne pouvant &#234;tre atteinte 
aux d&#233;pends de la robustesse, il nous a sembl&#233; int&#233;ressant d&#146;adopter une d&#233;marche proche de 
celles employ&#233;es pour l&#146;&#233;crit en TAL robuste. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine J.Y., Goulian J., Villaneau J. 
</p>
<p>4 Analyse incr&#233;mentale robuste pour la compr&#233;hension de parole 
</p>
<p>Plusieurs syst&#232;mes de compr&#233;hension de la parole ont d&#233;j&#224; cherch&#233; &#224; &#233;tudier la structure 
profonde des &#233;nonc&#233;s oraux. Ainsi, le syst&#232;me TINA combine un analyseur syntaxique profond &#224; 
un module de compr&#233;hension s&#233;lective prenant le relais du premier en cas d&#146;&#233;chec (Seneff, 
1992). Pour pouvoir appr&#233;cier les tr&#232;s bonnes performances du syst&#232;me, il faudrait n&#233;anmoins 
savoir dans quelle mesure le module s&#233;lectif a pris le relais de l&#146;analyse linguistique. A l&#146;oppos&#233;, 
les syst&#232;mes ROMUS et LOGUS d&#233;velopp&#233;s dans notre laboratoire mettent en &#156;uvre une 
strat&#233;gie d&#146;analyse qui applique directement les principes du TAL robuste. Le domaine 
d&#146;application retenu est le renseignement touristique. Il s&#146;agit d&#146;une t&#226;che pr&#233;sentant une 
complexit&#233; relativement importante, comme en t&#233;moignent les ambigu&#239;t&#233;s lexicales rencontr&#233;es 
dans nos corpus.  
</p>
<p>4.1 Caract&#233;ristiques communes des syst&#232;mes ROMUS et LOGUS 
</p>
<p>Tout en reposant sur des techniques diff&#233;rentes, ROMUS et LOGUS suivent la m&#234;me strat&#233;gie 
d&#146;analyse incr&#233;mentale. Elle implique une succession d&#146;&#233;tapes (figure 3) assez classique en TAL 
robuste et que l&#146;on retrouve chez (Zechner, 1998) pour le langage oral. Nous avons toutefois 
apport&#233; plusieurs modifications &#224; cette strat&#233;gie g&#233;n&#233;rale pour r&#233;pondre &#224; la fois au caract&#232;re 
spontan&#233; de l&#146;&#233;locution et &#224; la nature finalis&#233;e du dialogue mis en jeu. 
</p>
<p>&#233;tiquetage segmentation
(chunks)
</p>
<p>d&#233;pendances
s&#233;mantiques
</p>
<p>liste de
chunks
typ&#233;s
</p>
<p>structure
s&#233;mantique
</p>
<p>S&#233;quence(s)
 de mots
</p>
<p>liste de
mots
typ&#233;s
</p>
<p> Figure 3 &#151; Architecture g&#233;n&#233;rique des syst&#232;mes de compr&#233;hension LOGUS et ROMUS 
</p>
<p>Etiquetage &#151; Cette &#233;tape consiste &#224; associer &#224; chaque mot une partie du discours. Plus 
pr&#233;cis&#233;ment, on utilise un jeu de cat&#233;gories syntaxiques associ&#233;es &#233;ventuellement &#224; quelques 
informations morpho-syntaxiques.  Contrairement &#224; (Zechner, 1998), cette &#233;tape ne vise pas un 
&#233;tiquetage totalement d&#233;sambigu&#239;s&#233;. On retrouve ici le principe de sous-sp&#233;cification qui limite 
la propagation ult&#233;rieure des erreurs et nous permet d&#146;atteindre &#224; ce stade des taux de pr&#233;cision 
&#233;lev&#233;s. L&#146;&#233;tape suivante poursuivra cette d&#233;sambigu&#239;sation en consid&#233;rant un contexte d&#146;analyse 
plus large. 
</p>
<p>Segmentation &#151; Cette &#233;tape segmente l&#146;&#233;nonc&#233; en constituants minimaux (chunks) tout en 
analysant leur structure interne. Il s&#146;agit d&#146;une analyse syntaxique qui se base sur les parties du 
discours. Ces chunks correspondent souvent &#224; des unit&#233;s de sens repr&#233;sentant les objets de 
l&#146;univers. La segmentation facilite donc la transition vers les traitements s&#233;mantico-pragmatiques 
ult&#233;rieurs. Mais surtout, cette unit&#233; de segmentation est adapt&#233;e au langage parl&#233; spontan&#233;. Il a 
en effet &#233;t&#233; d&#233;montr&#233; que ces constituants sont le lieu de r&#233;alisation privil&#233;gi&#233; des r&#233;parations &#224; 
l&#146;oral (Blanche-Benveniste, 1997 : 47). Cette observation permet d&#146;envisager un traitement 
int&#233;gr&#233; des r&#233;parations en analysant le reparandum et l&#146;alt&#233;ration comme la r&#233;alisation de deux 
chunks distincts. Afin d&#146;aligner la segmentation avec ces &#233;l&#233;ments oraux, nos chunks ont une 
taille minimale, comme le montre l&#146;exemple ci-dessous : 
</p>
<p>(1) [je] [veux] [les tarifs] [pour une chambre] [enfin] [une chambre double] [&#224; l&#146;h&#244;tel] 
[Caumartin] [et] [au Crillon] </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TAL robuste et langage parl&#233; 
</p>
<p>On remarquera que la segmentation n&#146;est jamais destructrice, m&#234;me en pr&#233;sence de r&#233;parations. 
En effet, le reparandum n&#146;est pas effac&#233; par l&#146;alt&#233;ration comme dans les pr&#233;-traitements 
correctifs (Heeman, 1997). On conserve ainsi l&#146;ensemble de l&#146;information v&#233;hicul&#233;e par le 
message oral, ce qui permet une identification plus fine des intentions du locuteur. Les 
r&#233;parations seront analys&#233;es ult&#233;rieurement par l&#146;&#233;tape de caract&#233;risation de d&#233;pendances entre 
chunks. 
</p>
<p>La port&#233;e limit&#233;e de la segmentation garantit une certaine robustesse tout en autorisant une 
analyse plus d&#233;taill&#233;e des &#233;nonc&#233;s oraux. Contrairement aux approches s&#233;lectives, aucun &#233;l&#233;ment 
n&#146;est en effet ignor&#233; &#224; ce stade. De m&#234;me, cette &#233;tape analyse la structure interne des constituants 
en plus de caract&#233;riser leurs fronti&#232;res. Enfin, l&#146;&#233;tiquetage et la segmentation reposent sur une 
connaissance syntaxique totalement ind&#233;pendante de la t&#226;che. Cette architecture pr&#233;sente donc 
d&#146;ind&#233;niables atouts en mati&#232;re de g&#233;n&#233;ricit&#233;. Ce ne sera pas le cas de la derni&#232;re &#233;tape de 
traitement. 
</p>
<p>D&#233;pendances s&#233;mantiques &#151;  Cette &#233;tape conduit &#224; la repr&#233;sentation finale de l&#146;&#233;nonc&#233;. Cette 
derni&#232;re s&#146;obtient par la caract&#233;risation de d&#233;pendances s&#233;mantico-pragmatiques entre les 
chunks. En r&#232;gle g&#233;n&#233;rale, ces relations concernent les t&#234;tes lexicales des chunks. Chaque 
constituant syntaxique est consid&#233;r&#233; comme une instance de concepts s&#233;mantico-pragmatiques. 
Un lexique pragmatique, sp&#233;cifique &#224; l&#146;application, d&#233;crit alors les attentes des concepts sous 
forme de relations de d&#233;pendances pr&#233;dicat/argument entre les &#233;l&#233;ments de la t&#226;che (par 
exemple, un tarif peut-&#234;tre associ&#233; &#224; diff&#233;rentes propri&#233;t&#233;s). L&#146;analyse revient &#224; construire un 
graphe de d&#233;pendances par recherche d&#146;associations. Elle suit une heuristique privil&#233;giant la 
solution la plus couvrante qui minimise le nombre des concepts finaux ou les d&#233;pendances les 
plus courtes. Cette strat&#233;gie autorise une analyse partielle en cas de difficult&#233;s. De m&#234;me, les 
chunks qui correspondent au reparandum et &#224; l&#146;alt&#233;ration des r&#233;parations sont associ&#233;s dans un 
m&#234;me concept &#224; ce niveau de traitement. Cette &#233;tape cherche &#233;galement &#224; d&#233;terminer le type 
d&#146;acte de dialogue v&#233;hicul&#233; par l&#146;&#233;nonc&#233;. Suivant le principe de sous-sp&#233;cification d&#233;j&#224; 
rencontr&#233;, cette caract&#233;risation reste volontairement grossi&#232;re (assertion / demande / 
confirmation, etc.). Le contr&#244;leur de dialogue l&#146;affinera ult&#233;rieurement. 
</p>
<p>Nous allons maintenant &#233;tudier les sp&#233;cificit&#233;s des deux syst&#232;mes qui, d&#233;passant les simples 
questions d&#146;impl&#233;mentation, ne sont toutefois pas fondamentales d&#146;un point de vue th&#233;orique. 
</p>
<p>4.2 Syst&#232;me ROMUS 
</p>
<p>Le syst&#232;me ROMUS (Goulian 2002) r&#233;pond assez fid&#232;lement &#224; l&#146;architecture d&#233;crite ci-dessus. 
Nous ne donnerons donc que quelques informations sur son impl&#233;mentation.  
</p>
<p>Etiquetage &#151; Le lexique utilis&#233; pour l&#146;&#233;tiquetage en parties du discours (45 000 mots, 34 
&#233;tiquettes grammaticales) est repr&#233;sent&#233; sous la forme d&#146;un automate &#224; &#233;tats finis d&#233;terministe. 
La d&#233;sambigu&#239;sation s&#146;effectue &#224; l&#146;aide d&#146;un nombre limit&#233; de r&#232;gles locales compil&#233;es en 
transducteurs d&#233;terministes utilis&#233;s en cascade. Elle reste partielle afin d&#146;&#233;viter des erreurs 
p&#233;nalisantes pour la suite de l&#146;analyse. L&#146;&#233;tiquetage pr&#233;sente ainsi un taux de d&#233;cision de 80,4 % 
(corpus de test de 1200 &#233;nonc&#233;s) pour une pr&#233;cision de 97,5 %.  
</p>
<p>Segmentation &#151; La segmentation repose sur une mod&#233;lisation symbolique. Chaque chunk est 
d&#233;crit par un ensemble d&#146;expressions r&#233;guli&#232;res portant sur les parties du discours des mots de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine J.Y., Goulian J., Villaneau J. 
</p>
<p>l&#146;&#233;nonc&#233;. Ces expressions sont &#233;galement compil&#233;es en transducteurs d&#233;terministes et donnent 
lieu de la m&#234;me mani&#232;re &#224; une analyse en cascade. L&#146;ambigu&#239;t&#233; de la segmentation est g&#233;r&#233;e par 
une heuristique de maximisation des segments d&#233;tect&#233;s. Au final, cette &#233;tape segmente l&#146;&#233;nonc&#233; 
en constituants minimaux g&#233;n&#233;raux (chunks nominaux, verbaux, etc.) mais aussi suivant des 
segments correspondant &#224; des expressions langagi&#232;res particuli&#232;res (date, heure, prix) ou encore 
&#224; des marques (interjections, appuis du discours) de l&#146;oral spontan&#233; (cf. exemple 1 du paragraphe 
4.1).  
</p>
<p>Les r&#232;gles de segmentation permettent un typage syntaxique des constituants ainsi qu&#146;une 
caract&#233;risation de leur structure (t&#234;te lexicale, d&#233;pendances locales). En fin de segmentation, 
chaque chunk est repr&#233;sent&#233; par un arbre dont la racine est un triplet &lt;S, T, M&gt;, o&#249; S est la 
cat&#233;gorie syntaxique du segment, T sa t&#234;te lexicale et M un ensemble de marques 
morphologiques.  
</p>
<p>D&#233;pendances &#151; La caract&#233;risation des d&#233;pendances entre chunks repose sur une adaptation du 
formalisme des grammaires de liens (Sleator, Temperley, 1991) permettant l&#146;utilisation d&#146;une 
connaissance s&#233;mantico-pragmatique. Les grammaires de liens ne peuvent mod&#233;liser les 
structures non projectives mais nos &#233;tudes de corpus (Antoine, Goulian, 2001) ont montr&#233; que 
cette limitation est sans cons&#233;quence en dialogue finalis&#233;. A chaque entr&#233;e de la grammaire de 
liens (lexique) correspond un ensemble d&#146;attentes s&#233;mantiques sp&#233;cifiques &#224; la t&#226;che. Elles 
s&#146;expriment au moyen de connecteurs &#233;tiquet&#233;s et orient&#233;s qui doivent s&#146;associer deux &#224; deux 
pour former une relation valide. Ces relations concernent des triplets &lt;S,T,M&gt; et non pas des 
mots comme dans le formalisme originel des grammaires de liens. Nous avons par ailleurs d&#233;fini 
deux types de relations : 
</p>
<p>&#8226; Relations sp&#233;cifiques aux items lexicaux, comme par exemple la relation Cat&#233;gorie qui 
peut relier deux segments &lt;GN, &#171; h&#244;tel &#187;, ind&#233;fini&gt; et &lt;GN, &#171; &#233;toile &#187;, d&#233;fini&gt;. 
</p>
<p>&#8226; Relations exprimant des constructions syntaxiques g&#233;n&#233;riques comme les coordinations 
marqu&#233;es par une conjonction (&lt;Coo, &#171;et&#187;, &#8709;&gt; par exemple). Les r&#233;parations marqu&#233;es 
peuvent &#233;galement &#234;tre mod&#233;lis&#233;es ainsi : &lt;Cor, &#171; non &#187;, &#8709;&gt; par exemple. 
</p>
<p>La strat&#233;gie d&#146;analyse repose sur l&#146;algorithme de (Sleator &amp; Temperley, 1991). Eventuellement 
partielle, elle proc&#232;de par expansion d&#146;&#238;lots en rattachant les &#233;l&#233;ments ayant des attentes 
compatibles. Ce rattachement permet de d&#233;tecter les r&#233;parations qui n&#146;ont pas encore &#233;t&#233; 
caract&#233;ris&#233;es. En effet, nous mod&#233;lisons par un op&#233;rateur sp&#233;cifique le ph&#233;nom&#232;ne 
d&#146;entassement paradigmatique qui r&#233;sulte de ces r&#233;parations (Blanche-Benveniste, 1997). 
</p>
<p>                                +-----------------------------------Etablissement-Ref----------------------------------+   
                                +-----OBJTARIF------+                                            +-------COOEt----------- +---COOEt----+ 
       |              |        |                 |                   | 
  +AGENT+InfoTarif-+                 +-CORtar--+-COOtar+-TypeCH --+        +REFObjId -+                 |                   | 
   |              |                  |                      |                |                |                 |         |                   |                  |                   | 
GN         GV         GN(tarif    GP(pour,         Cor    GN(chambre   GAdj    GP(&#224;,             GNnp        Coo          GP(au,  
 (je)   (vouloir)     .def)      chambre.def)  (enfin)        .def)        (double)    h&#244;tel.def)  (Caumartin)   (et)        Crillon) 
</p>
<p>Figure 4 &#151; Exemple de structure de liens obtenu en sortie du syst&#232;me ROMUS 
</p>
<p>En fin d&#146;analyse, un syst&#232;me de co&#251;t permet de hi&#233;rarchiser les diff&#233;rents graphes de 
d&#233;pendances obtenus. Nous privil&#233;gions, par ordre de co&#251;t d&#233;croissant, les analyses compl&#232;tes, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TAL robuste et langage parl&#233; 
</p>
<p>les analyses partielles avec &#238;lots complets puis les analyses partielles avec &#233;l&#233;ments isol&#233;s. La 
repr&#233;sentation s&#233;mantique qui est obtenue en sortie est une structure de liens. A titre d&#146;exemple, 
la figure 4 donne la structure de liens correspondant &#224; l'exemple (1) du paragraphe 4.1.  
</p>
<p>4.3 Syst&#232;me LOGUS 
</p>
<p>Le syst&#232;me LOGUS (Villaneau, Antoine, Ridoux, 2002) repose sur l&#146;utilisation de techniques 
originales dans le domaine de la parole. Il s&#146;agit en effet d&#146;un syst&#232;me logique utilisant le &#955;-
calcul pour construire une repr&#233;sentation s&#233;mantique &#224; la Montague de l&#146;&#233;nonc&#233;. L&#146;int&#233;r&#234;t de 
l&#146;approche logique est sa compatibilit&#233; avec de nombreux travaux portant sur le dialogue. On 
pense ainsi &#224; la DRT (Kamp, Reyle, 1993) ou encore &#224; la formalisation logique de la th&#233;orie des 
actes de langage de Searle (logique illocutoire : Vanderveken, 1994). LOGUS vise donc une 
int&#233;gration forte de la compr&#233;hension et de la gestion du dialogue. Il r&#233;pond aux caract&#233;ristiques 
ci-dessous. 
</p>
<p>Etiquetage &#151; Cet &#233;tape est minimale : par acc&#232;s au lexique, elle consiste &#224; associer &#224; chaque 
mot sa ou ses d&#233;finitions : un triplet &lt;C,R,S&gt; o&#249; C est la cat&#233;gorie syntaxique, R le r&#244;le du 
segment vis-&#224;-vis de la t&#226;che (objet, (prop quantit&#233;) pour une propri&#233;t&#233; de quantit&#233;, etc.) et S un 
&#955;-terme qui correspond &#224; la traduction de l&#146;&#233;l&#233;ment dans le langage cible. Les &#233;ventuelles 
ambigu&#239;t&#233;s sont lev&#233;es lors des &#233;tapes ult&#233;rieures de traitement.  
</p>
<p>Segmentation &#151; La segmentation repose sur la composition des &#955;-termes repr&#233;sentant chaque 
mot, suivant deux r&#232;gles d&#233;riv&#233;es de l&#146;application des grammaires cat&#233;gorielles de type AB (Bar-
Hillel, 1964 ; Moorgat, 1997) :    (A1) A, A\B &#8658; B (A2) B/A, A &#8658; B 
Par exemple, le chunk adjectival pas trop cher est caract&#233;ris&#233; par les applications suivantes : 
</p>
<p>&#171; pas &#187;  &lt;adj/adj , (prop R)/(prop R), &#955;x.(pas x)&gt; 
&#171; trop &#187;  &lt;adj/adj, (prop R)/(prop R), &#955;x.x&gt; 
&#171; cher &#187;  &lt;adj,(prop tarif), cher&gt; 
&#171; pas trop cher &#187; &lt;adj, (prop tarif), (&#955;x.(pas x) (&#955;x.x cher))  
                                                                 &#8801;&#946;(pas cher)&gt;       
</p>
<p>La strat&#233;gie d&#146;analyse suivie correspond &#224; l&#146;application de toutes les compositions possible, 
associ&#233;e &#224; une heuristique finale qui privil&#233;gie la construction d&#146;un minimum de constituants. A 
l&#146;issue de la segmentation, les &#233;l&#233;ments isol&#233;s (correspondant &#224; des cat&#233;gories fractionnaires non 
r&#233;duites) sont &#233;limin&#233;s. On r&#233;alise ainsi un premier traitement des r&#233;parations tr&#232;s fragmentaires. 
Ainsi, l&#146;h&#233;sitation et la pr&#233;position corrig&#233;e seront &#233;limin&#233;es dans l&#146;&#233;nonc&#233; &#171; un aller simple vers 
euh pour Paris &#187;.  
</p>
<p>D&#233;pendances entre segments &#151; Les possibilit&#233;s de rattachement des segments sont d&#233;crites par 
des pr&#233;dicats logiques qui constituent une connaissance pragmatique sp&#233;cifique &#224; l&#146;application. 
Un jeu de r&#232;gles syntaxico-s&#233;mantiques, qui portent sur les triplets &lt;C, R, S&gt;, permet de 
composer progressivement ces diff&#233;rents constituants et d&#146;obtenir une formule logique 
repr&#233;sentant le sens de l&#146;&#233;nonc&#233;. Comme pour ROMUS, on d&#233;finit des r&#232;gles propres &#224; la 
caract&#233;risation des relations entre objets et des r&#232;gles g&#233;n&#233;riques de coordination. Les 
r&#233;parations sont &#233;galement trait&#233;es par des r&#232;gles g&#233;n&#233;riques semblables. Enfin, on a &#233;galement 
d&#233;fini des r&#232;gles qui caract&#233;risent &#224; partir de certains segments l&#146;acte de dialogue de l&#146;&#233;nonc&#233;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine J.Y., Goulian J., Villaneau J. 
</p>
<p>Les r&#232;gles sont r&#233;parties en plusieurs sous-ensembles correspondant &#224; autant de niveaux 
d&#146;application successifs suivant une strat&#233;gie d&#146;analyse incr&#233;mentale. Chaque niveau d&#146;analyse 
correspond &#224; un rel&#226;chement plus important des contraintes sur la caract&#233;risation des 
d&#233;pendances. Pour une pr&#233;sentation d&#233;taill&#233;e de cette application en cascade, on consultera 
(Villaneau, Antoine, Ridoux, 2002). On rel&#232;vera seulement que cette strat&#233;gie autorise les 
analyses partielles. Enfin, cette &#233;tape permet une r&#233;solution pr&#233;coce des co-r&#233;f&#233;rences les plus 
simples par consultation d&#146;un historique des &#233;nonc&#233;s utilisateur. La figure 5 donne ainsi la 
formule logique qui correspond &#224; la repr&#233;sentation s&#233;mantique de l&#146;&#233;nonc&#233; du paragraphe 4.1. 
</p>
<p> ((requete vouloir) (et  (de (tarif [ ])  (de  (chambre [(taille_chambre double)])  
                                                        (de    (hotel [identification &#145;Caumartin&#146;]))) 
                                    (de (tarif [ ])  (de (chambre [(taille_chambre double)])  
                                                                 (de    (hotel [identification &#145;Crillon&#146;])))  )  ) 
</p>
<p>Figure 5 &#151; Exemple de formule logique obtenue en sortie du syst&#232;me LOGUS 
</p>
<p>5 R&#233;sultats 
</p>
<p>Les syst&#232;mes ont &#233;t&#233; test&#233;s au cours d&#146;une campagne d&#146;&#233;valuation de la compr&#233;hension de parole 
r&#233;alis&#233;e dans le cadre du GDR-I3 du CNRS (Antoine et al., 2002). Cette &#233;valuation avait une 
vis&#233;e diagnostic ne permettant pas une comparaison directe entre les participants (CLIPS-IMAG, 
IRIT,  LIMSI, VALORIA). Les syst&#232;mes ont en effet &#233;t&#233; test&#233;s sur des jeux de tests comparables 
(1200 &#233;nonc&#233;s pr&#233;sentant les m&#234;mes proc&#233;d&#233;s oraux) mais diff&#233;rents, chaque syst&#232;me 
s&#146;int&#233;ressant &#224; une t&#226;che sp&#233;cifique. Le tableau 1 pr&#233;sente les derniers r&#233;sultats obtenus par nos 
syst&#232;mes.  
</p>
<p>Type de difficult&#233; ROMUS-2003 LOGUS-2003 
</p>
<p>(1) oral spontan&#233; 94,2 % (dont 2,9 % compr&#233;hension partielle) 98,0 % (dont 4,3 % comp. partielle) 
(2) complexit&#233;  94,4 % (dont 4,6 % comp. partielle) 89,7 % (dont 16,7 % comp. partielle) 
(1) et (2) combin&#233;s  62,5 % (dont 10,4 % comp. partielle) 85,4 % (dont 23,7 % comp. partielle) 
</p>
<p>Tableau 1 &#151; Performances (taux d&#146;&#233;nonc&#233;s compris) des syst&#232;mes sur les tests de la campagne 
d&#146;&#233;valuation par d&#233;fi du GDR-I3. Chaque syst&#232;me est &#233;valu&#233; sur un jeu de test sp&#233;cifique. 
</p>
<p>Compr&#233;hension partielle : non-identification d&#146;&#233;l&#233;ments &#171; non essentiels &#187; de l&#146;&#233;nonc&#233; 
</p>
<p>Ces r&#233;sultats sont regroup&#233;s par s&#233;ries de tests. La premi&#232;re regroupe des &#233;nonc&#233;s comportant 
des proc&#233;d&#233;s de l&#146;oral spontan&#233; ou des dislocations tandis que la seconde concerne des &#233;nonc&#233;s 
de structure complexe (requ&#234;tes multiples, rattachement d&#146;arguments r&#233;cursifs, etc.). La derni&#232;re 
s&#233;rie combine ces deux difficult&#233;s et concerne des &#233;nonc&#233;s qui se rapprochent du dialogue oral 
humain. On constate que les deux syst&#232;mes pr&#233;sentent une robustesse appr&#233;ciable sur les 
structures linguistiques complexes (&#224; l&#146;exclusion de certaines requ&#234;tes multiples) ainsi que sur 
des ph&#233;nom&#232;nes de l&#146;oral spontan&#233; tels que les r&#233;parations ou les dislocations. Les r&#233;sultats plus 
mitig&#233;s de la troisi&#232;me s&#233;rie sont &#224; la mesure de la difficult&#233; que repr&#233;sente le traitement 
d&#146;&#233;nonc&#233;s libres proches de la conversation humaine. Ils se retrouvent chez les autres 
participants. 
</p>
<p>Par ailleurs, nous avons cherch&#233; &#224; &#233;valuer l&#146;influence des erreurs de reconnaissance sur le 
comportement du syst&#232;me ROMUS. Partant de 600 &#233;nonc&#233;s oraux trait&#233;s par une dict&#233;e vocale </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TAL robuste et langage parl&#233; 
</p>
<p>grand public (IBM Via Voice), nous avons obtenu un corpus de test comportant 358 &#233;nonc&#233;s 
pr&#233;sentant une ou plusieurs erreurs de reconnaissance de type lexical (insertion, substitution ou 
&#233;lision) et 140 &#233;nonc&#233;s pr&#233;sentant au moins une erreur d&#146;accord. Ces erreurs ont eu une 
influence sur la compr&#233;hension dans 16% des cas. Elles n&#146;ont cependant jamais conduit &#224; une 
repr&#233;sentation erron&#233;e de l&#146;&#233;nonc&#233;, mais simplement &#224; la construction de structures incompl&#232;tes. 
</p>
<p>6 Conclusion et perspectives 
</p>
<p>ROMUS et LOGUS participeront &#224; la prochaine campagne d&#146;&#233;valuation MEDIA-EVALDA sur 
la compr&#233;hension de parole en contexte dialogique. Cette &#233;valuation, qui portera sur le 
renseignement touristique, devrait permettre de mieux situer la pertinence de notre approche. 
Dans l&#146;imm&#233;diat, nous poursuivons ces recherches en &#233;tendant notre strat&#233;gie incr&#233;mentale 
robuste dans deux directions : 
</p>
<p>&#8226; Pr&#233;-traitement des r&#233;parations de l&#146;oral spontan&#233; fond&#233; sur une analyse superficielle de 
l&#146;&#233;nonc&#233; int&#233;grant toutefois une information morpho-syntaxique. Contrairement aux 
approches classiques du domaine (Heeman, 1997), cette normalisation ne sera pas 
destructrice. Elle se limitera en effet &#224; la d&#233;limitation et non &#224; la correction des r&#233;parations. 
</p>
<p>&#8226; Interpr&#233;tation contextuelle des &#233;nonc&#233;s oraux en amont du dialogue. L&#146;objectif est 
d&#146;identifier et de r&#233;soudre de certaines co-r&#233;f&#233;rences ne n&#233;cessitant pas une analyse fine du 
dialogue et de l&#146;&#233;volution de la t&#226;che. Cette &#233;tape g&#233;n&#233;rique s&#146;inspire de techniques issues 
du TAL robuste et appliqu&#233;es jusqu&#146;ici &#224; l&#146;&#233;crit (Mitkov, 1998). Les co-r&#233;f&#233;rences non 
r&#233;solues &#224; ce stade (sous-sp&#233;cification de l&#146;analyse) seront ensuite confi&#233;es au contr&#244;leur 
de dialogue suivant une strat&#233;gie incr&#233;mentale. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Abney S. (1991), Parsing by chunks, In. Berwick, Abney, Tenny (Eds.) Principle-based parsing. 
Amsterdam, Kluwer Academic Publishers 
</p>
<p>A&#239;t-Mokhtar S., Chanod J.-P., Roux C. (2003), Robustness beyond shallowness: incremental 
deep parsing, Natural Language Enginerring, Vol. 8 (3-2). 
</p>
<p>Antoine J.-Y., Goulian J. (2001), Etude des ph&#233;nom&#232;nes d&#146;extraction en fran&#231;ais parl&#233; sur deux 
corpus de dialogue finalis&#233;, Traitement Automatique des Langues, 42(2), pp. 413-440. 
</p>
<p>Antoine J.-Y. et al. (2002), Predictive and objective evaluation of speech understanding : the 
&#171; challenge &#187; evaluation campaign of the I3 speech workgroup of the French CNRS. Actes 
LREC&#146;2002, Las Palmas de Gran Canaria, Espagne, pp. 529-536. 
</p>
<p>Bar-Hillel Y. (1964). Language and information. Addison-Wesley, Reading, Etats-Unis. 
</p>
<p>Belleann&#233;e C., Brisset P., Ridoux O. (1999) A pragmatic reconstruction of &#955;Prolog. Journal of 
Logic Programming, 41(1). 67-10 
</p>
<p>Blanche-Benveniste C. (1997), Approches de la langue parl&#233;e en fran&#231;ais, Coll. L&#146;essentiel 
Fran&#231;ais, Paris, France : Ophrys. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antoine J.Y., Goulian J., Villaneau J. 
</p>
<p>Cunningham H. (2000), A definition and short history of Language Engineering, Natural 
Language Enginerring, Vol. 5(1), pp.1-16. 
</p>
<p>Ejerhed E. (1993), Nouveaux courants en analyse syntaxique, TAL, 34(1), pp.61-82. 
</p>
<p>Goulian J. (2002), Strat&#233;gie d&#146;analyse d&#233;taill&#233;e pour la compr&#233;hension automatique robuste de 
la parole. Th&#232;se de doctorat. Vannes : Universit&#233; de Bretagne Sud. 13 d&#233;cembre 2002. 
</p>
<p>Heeman P. (1997), Speech repairs, intonational boundaries and discourse markers : modeling 
speakers&#146; utterances in spoken dialog. PhD dissertation, University of Rochester. 
</p>
<p>Kamp H., Reyle U. (1993), From discourse to logic, Amsterdam : Kluwer Academic Publ. 
</p>
<p>Mitkov R., (1998) Robust pronoun resolution with limited knowledge, COLING&#146;98/ACL&#146;98. 
Montr&#233;al, Canada, pp. 869-875. 
</p>
<p>Moorgat M. (1997), Categorial type logics. In van Benthem J., ter Meulen A. (Eds.) Handbook 
of logic and language. Elsevier Sciences, North-Holland, Amsterdam, Pays-Bas, pp. 93-177. 
</p>
<p>van Noord G., Bouma G., Koeling R., Nederhof M.J. (1999), Robust grammatical analysis for 
spoken dialogue systems. Natural Language Enginerring, 5(1).  
</p>
<p>P&#233;rennou G. (1996), Compr&#233;hension du dialogue oral : le r&#244;le du lexique dans l&#146;approche par 
segments conceptuels. Actes de l&#146;atelier Lexique et Communication Parl&#233;e, GDR-PRC CHM, 
Toulouse, France. pp. 169-178. 
</p>
<p>Seneff  S. (1992), Robust parsing for spoken language systems. International Conference on 
Acoustics, Speech and Signal, ICASSP&#146;1992, San Francisco, Etats-Unis, pp. 189-192. 
</p>
<p>Sleator D. D. K., Temperley D. (1991), Parsing English with a link grammar, rapport CMU-CS-
91-196, School of Computer Science, Carnegie Mellon University, Pittsburgh. 
</p>
<p>Vanderveken D. (1994), A complete formulation of a simple logic of elementary illocutionary 
acts. In Tsohatzidis S. L. (Ed.), Foundations of speech act theory : philosophical and linguistic 
perspectives. Routldege, pp. 99-131. 
</p>
<p>Villaneau J., Antoine J.-Y., Ridoux O. (2002), LOGUS : un syst&#232;me formel de compr&#233;hension 
du fran&#231;ais parl&#233; spontan&#233;. Actes TALN&#146;2002, Nancy, France, pp. 165-174. 
</p>
<p>Zechner K. (1998), Automatic construction of frame representations for spontaneous speech in 
unrestricted domains. Actes COLING-ACL&#146;1998. Montr&#233;al, Canada, pp. 1448-1452. </p>

</div></div>
</body></html>