<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une plate-forme de conception et d&#146;exploitation d&#146;une grammaire d&#146;arbres adjoints lexicalis&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Une plate-forme de conception et d&#146;exploitation 
d&#146;une grammaire d&#146;arbres adjoints lexicalis&#233;s 
</p>
<p>Beno&#238;t Crabb&#233;, Bertrand Gaiffe et Azim Roussanaly 
</p>
<p>LORIA 
BP 239 &#150; 54506 Vandoeuvre-l&#232;s-Nancy Cedex 
</p>
<p>{crabbe,gaiffe,azim}@loria.fr 
</p>
<p>R&#233;sum&#233; &#150; Abstract  
</p>
<p>Dans cet article, nous pr&#233;sentons un ensemble d&#146;outils de conception et d&#146;exploitation pour 
des grammaires d&#146;arbres adjoints lexicalis&#233;s. Ces outils s&#146;appuient sur une repr&#233;sentation 
XML des ressources (lexique et grammaire). Dans notre repr&#233;sentation, &#224; chaque arbre de la 
grammaire est associ&#233; un hypertag d&#233;crivant les ph&#233;nom&#232;nes linguistiques qu&#146;il recouvre. De 
ce fait, la liaison avec le lexique se trouve plus compact&#233;e et devient plus ais&#233;e &#224; maintenir. 
</p>
<p>Enfin, un analyseur permet de valider les grammaires et les lexiques ainsi con&#231;us aussi bien 
de fa&#231;on interactive que diff&#233;r&#233;e sur des corpus. 
</p>
<p>Keywords &#150; Mots Cl&#233;s 
</p>
<p>Grammaire, analyse syntaxique, ressources lexicales, LTAG, repr&#233;sentation compacte du 
lexique 
Grammar, parser, lexical resources, LTAG, compact lexical representation 
</p>
<p>1 Introduction 
</p>
<p>La grammaire d'arbres adjoints lexicalis&#233;e est une grammaire fortement lexicalis&#233;e. La 
gestion du lexique de ce type de grammaire est a priori difficile. Les unit&#233;s grammaticales 
&#233;l&#233;mentaires sont en effet tr&#232;s nombreuses. Les d&#233;veloppements r&#233;cents en mati&#232;re de 
repr&#233;sentation compacte du lexique permettent d&#233;sormais d'en faciliter la gestion, et en 
particulier la maintenance.  
</p>
<p>Dans cet article, nous pr&#233;sentons un ensemble d'outils effectivement impl&#233;ment&#233;s qui 
permettent la gestion et l'utilisation d'une grammaire d'arbres adjoints lexicalis&#233;e. Nous 
centrons notre attention sur les aspects technique li&#233;s &#224; la repr&#233;sentation du lexique. 
L'impl&#233;mentation que nous proposons facilite, de notre point de vue, la maintenance de la 
grammaire. Nous commen&#231;ons par rappeler bri&#232;vement l'architecture donn&#233;e au lexique dans 
les impl&#233;mentations du formalisme (architecture XTAG). Nous montrons en quoi ce type </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. Crabb&#233;, B. Gaiffe, A. Roussanaly 
</p>
<p>d'architecture pose des probl&#232;mes de maintenance et de r&#233;utilisation (li&#233;s &#224; la notion 
d'ancrage). Enfin, nous discutons les choix retenus dans l'impl&#233;mentation  
</p>
<p>2 Grammaire d&#146;arbres adjoints (TAG) 
</p>
<p>La grammaire d'arbres adjoints (Joshi 1975, Joshi et Schab&#232;s 1997) est un syst&#232;me de 
composition d'arbres dont les unit&#233;s sont des arbres &#233;l&#233;mentaires. Deux op&#233;rations de 
composition sont d&#233;finies sur les arbres : l'adjonction et la substitution. 
</p>
<p>TAG est essentiellement utilis&#233; dans sa version lexicalis&#233;e (LTAG). La condition de 
lexicalisation impose que tout arbre &#233;l&#233;mentaire soit ancr&#233; par une unit&#233; lexicale. En suivant 
cette approche, le lexique d'une grammaire TAG lexicalis&#233;e est un ensemble d'arbres 
&#233;l&#233;mentaires, comme illustr&#233; &#224; la Figure 11. 
</p>
<p>  
</p>
<p>Figure 1 : Exemples d&#146;arbres &#233;l&#233;mentaires 
</p>
<p>Si th&#233;oriquement un lexique TAG se compose d'un ensemble tr&#232;s important d'arbres 
&#233;l&#233;mentaires, en pratique les impl&#233;mentations (Xtag 2001, Abeill&#233; 2002) introduisent une 
factorisation : les unit&#233;s lexicales sont stock&#233;es sur trois niveaux : 
</p>
<p>&#8226; Une base de sch&#232;mes (ou templates) ou arbres &#233;l&#233;mentaires non instanci&#233;s. Un sch&#232;me 
contient un n&#156;ud particulier, marqu&#233; par le symbole &#9674; appel&#233; n&#156;ud ancre, n&#156;ud sur 
lequel l'unit&#233; lexicale se place lors du processus d'ancrage. De plus, les sch&#232;mes sont 
class&#233;s en familles. Une famille est un ensemble d'arbres dont chaque &#233;l&#233;ment 
repr&#233;sente la m&#234;me structure pr&#233;dicat-argument. 
</p>
<p>&#8226; Une base de lemmes, chaque lemme est associ&#233; &#224; une ou plusieurs familles. 
</p>
<p>&#8226; Une base morphologique dans laquelle chaque forme fl&#233;chie est associ&#233;e &#224; un lemme. 
</p>
<p>Les arbres &#233;l&#233;mentaires sont construits dynamiquement lors du processus d'analyse 
syntaxique. Le processus de construction dynamique est appel&#233; ancrage. Le principe est le 
suivant : la forme fl&#233;chie d&#233;termine le lemme correspondant. Ce lemme permet de 
s&#233;lectionner la famille. La forme fl&#233;chie est ensuite greff&#233;e aux n&#156;uds ancres de chacun des 
sch&#232;mes composant la famille s&#233;lectionn&#233;e. Les traits associ&#233;s &#224; la forme fl&#233;chie, au lemme et 
</p>
<p>                                                 
1 Les arbres utilis&#233;s dans cet article sont inspir&#233;s de la grammaire propos&#233;e par (Abeill&#233; 2002). De plus, nous 
</p>
<p>utilisons une variante usuelle de TAG : Feature-Based TAG (Vijay-Shanker 1987), version dans laquelle 
chaque n&#156;ud d'un arbre est associ&#233; &#224; une structure de trait top et une structure de traits bottom. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plate-forme de conception et d&#146;exploitation d&#146;une grammaire d&#146;arbres adjoints&#133; 
</p>
<p>au n&#156;ud ancre sont alors unifi&#233;s. Il est donc possible que l'ancrage &#233;choue suite &#224; un &#233;chec 
d'unification. 
</p>
<p>2.1 Probl&#233;matique de l&#146;op&#233;ration d&#146;ancrage 
</p>
<p>Cette probl&#233;matique est li&#233;e &#224; la construction des structures de traits dans les arbre 
&#233;l&#233;mentaires. Elle est illustr&#233;e &#224; la Figure 2. 
</p>
<p>FLEXION (1) 
mange 
</p>
<p>&#63738;&#63739;
&#63737;
</p>
<p>&#63727;&#63728;
&#63726;
</p>
<p>=
=&#8594; 3pers
sgnummorpho  
</p>
<p>+  LEMME (2) 
manger 
</p>
<p>1Vn0nfamille&#8594;  
</p>
<p>[ ]+=&#8594;hum)0(argtop  
</p>
<p>+  SCHEME (3) 
 
 
</p>
<p>=  ARBRE ELEMENTAIRE (2) 
 
</p>
<p>Figure 2 : Exemple d&#146;ancrage 
</p>
<p>L'ancrage effectif d'une forme fl&#233;chie dans un sch&#232;me fait intervenir des structures de traits 
issues de trois composants :  
</p>
<p>1. la structure de traits morphologiques associ&#233;e &#224; la forme fl&#233;chie, 
2. &#233;ventuellement, la structure de traits associ&#233;e au lemme (dans notre exemple, il n&#146;y en 
</p>
<p>a pas). 
3. un ensemble d'&#233;quations associ&#233;es au lemme (&#233;quations d'ancrage) qui repr&#233;sentent 
</p>
<p>des restrictions de s&#233;lections &#224; projeter dans l'arbre. 
</p>
<p>Les structures de traits associ&#233;es &#224; la flexion et au lemme sont unifi&#233;es avec la structure de 
traits associ&#233;e au n&#156;ud ancre. Leurs r&#244;les respectifs sont prototypiquement le traitement de 
ph&#233;nom&#232;nes d'accord et la mise en &#233;chec du processus d'ancrage avec certains sch&#232;mes (par 
&#233;chec d'unification). Ainsi, le lemme d'un verbe transitif de famille n0Vn1 non passivable 
comme comporter est associ&#233; &#224; la structure de trait [passif = -]. Les sch&#232;mes 
correspondant aux formes passives contiennent quant &#224; eux le trait [passif = +] sur le 
n&#156;ud ancre. On voit donc qu'un arbre associ&#233; &#224; une forme fl&#233;chie n'est pas s&#233;lectionn&#233; 
uniquement sur la base de la famille, mais &#233;galement par l'interm&#233;diaire de traits li&#233;s &#224; 
l'ancrage, plac&#233;s &#224; la fois dans la base de lemmes et dans les sch&#232;mes. 
</p>
<p>D'autre part, la valeur de certains traits est ambigu&#235;. Ainsi un trait utilis&#233; dans la grammaire 
pour traiter la concordance des temps tel [mode = indicatif] a &#233;galement pour r&#244;le de 
bloquer l'ancrage d'un sch&#232;me repr&#233;sentant une forme imp&#233;rative.  
</p>
<p>Les &#233;quations d'ancrage sont quant &#224; elles associ&#233;es aux lemmes. Leur particularit&#233; est de 
projeter des traits sur des n&#156;uds de sch&#232;mes diff&#233;rents de l'ancre. Vu qu'un lemme est associ&#233; 
</p>
<p>S 
</p>
<p>N&#8595; V! N&#8595;
num=@1t: num=@1 b: 
</p>
<p>S
</p>
<p>N&#8595; V! N&#8595;
t: num=sg
</p>
<p>hum=+ 
</p>
<p>b: num=sg
pers=3 
</p>
<p>mange</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. Crabb&#233;, B. Gaiffe, A. Roussanaly 
</p>
<p>&#224; une famille, c'est-&#224;-dire un ensemble de structures arborescentes topologiquement 
h&#233;t&#233;rog&#232;nes, il faut &#234;tre capable de d&#233;signer des n&#156;uds de fa&#231;on symbolique pour l'ensemble 
des sch&#232;mes appartenant &#224; cette famille. Les familles XTAG (FTAG) regroupent des arbres 
qui repr&#233;sentent les diff&#233;rentes r&#233;alisations d'une m&#234;me structure pr&#233;dicative ; dans ce cadre, 
les n&#156;uds cibl&#233;s par les &#233;quations d'ancrage sont les n&#156;uds repr&#233;sentant la position des 
arguments dans la structure arborescente. Ceux-ci sont rep&#233;r&#233;s &#224; l'aide d'indices repr&#233;sentant 
la position de l'argument dans la structure argumentale. Ainsi, la repr&#233;sentation XTAG 
(FTAG) des arguments du pr&#233;dicat dans la famille {&#945;,&#946;}, illustr&#233; par la Figure 3, se fait par 
l&#146;association au lemme manger de l'&#233;quation d'ancrage suivante : top(arg0)&#8594; [hum=+]. 
</p>
<p> 
</p>
<p> 
</p>
<p>&#945; &#946; 
</p>
<p>Figure 3 : Exemple de famille d&#146;arbres 
</p>
<p>Ce qui signifie qu'une famille se d&#233;finit non seulement par un ensemble d&#146;arbres {&#945;,&#946;} mais 
&#233;galement par un ensemble de correspondances : 
</p>
<p>&#63731;&#63730;
&#63729;
</p>
<p>&#946;&#945;&#8594;
&#946;&#945;&#8594;
</p>
<p>1.,3.1arg
2.3.,1.0arg  
</p>
<p>qui associe aux arguments 0 et 1 les adresses de Gorn sur lesquelles ils se projettent pour 
chacun des sch&#232;mes appartenant &#224; la famille. 
</p>
<p>Une famille est donc plus qu'un ensemble d'arbres, elle d&#233;finit &#233;galement un ensemble de 
correspondances entre des d&#233;signations symboliques de n&#156;uds et des adresses de Gorn 
refl&#233;tant la position de ces noms symboliques dans chaque arbre de la famille. 
</p>
<p>3 Vision alternative du processus d&#146;ancrage 
</p>
<p>Une architecture de type XTAG sugg&#232;re un d&#233;coupage de la grammaire en termes de familles 
organis&#233;es autour de l'id&#233;e pr&#233;dicat-argument. Bien que cette approche refl&#232;te une id&#233;e 
commun&#233;ment admise en syntaxe, nous voudrions montrer comment une organisation 
alternative du lexique fond&#233;e sur la notion d'alternances lexicales (Levin 1993) change la 
donne. 
</p>
<p>Le travail de (Levin 1993) sugg&#232;re une organisation du lexique articul&#233;e autour de l'hypoth&#232;se 
du d&#233;terminisme s&#233;mantique : en syntaxe, cela signifie que les contextes syntaxiques 
(alternances) dans lesquels appara&#238;t un mot sont d&#233;termin&#233;s par ses propri&#233;t&#233;s s&#233;mantiques. 
L'hypoth&#232;se stipule, par exemple, que tous les verbes de mouvement (classe d'alternance) 
partagent les m&#234;mes propri&#233;t&#233;s syntaxiques. Dans ce cadre (Levin 1993) r&#233;pertorie pour un </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plate-forme de conception et d&#146;exploitation d&#146;une grammaire d&#146;arbres adjoints&#133; 
</p>
<p>tr&#232;s grand nombre de verbes anglais les variations de diath&#232;se effectivement attest&#233;es dans la 
langue (alternances) : ex. passif-long, actif et sujet nominal&#133;). 
</p>
<p>Une adaptation au fran&#231;ais du travail de Levin faite par (St Dizier 1996, St Dizier 1999) 
sugg&#232;re d'associer un lex&#232;me &#224; un ensemble d'alternances. En suivant cette approche, on 
associera au verbe comporter une alternance telle que : actif et sujet nominal et objet nominal 
mais on se garde de lui associer une alternance telle que passif-long comme l'illustrent les 
phrases : (Le livre comporte deux chapitres | * Deux chapitres sont comport&#233;s par le livre) 
</p>
<p>On remarque imm&#233;diatement que l'utilisation d'une paire de traits telle que [passif = &#177;] 
pour op&#233;rer un filtrage lors de l'ancrage des arbres n'a aucun int&#233;r&#234;t dans ce cadre. 
</p>
<p>4 Repr&#233;sentation de la grammaire 
</p>
<p>4.1 Caract&#233;ristiques 
</p>
<p>Trois op&#233;rations apparaissent clairement pour d&#233;finir les liens entre lemmes et sch&#232;mes :  
</p>
<p>&#8226; d&#233;coupage de la grammaire en sous-ensembles caract&#233;ris&#233;s par des propri&#233;t&#233;s 
linguistiques communes, 
</p>
<p>&#8226; ancrage des lemmes sur les n&#156;uds ancres des sch&#232;mes, 
</p>
<p>&#8226; projection de contraintes s&#233;mantiques associ&#233;es aux lemmes dans les sch&#232;mes 
s&#233;lectionn&#233;s &#224; l'aide des &#233;quations d'ancrage. 
</p>
<p>En vue de r&#233;aliser ces op&#233;rations de mani&#232;re satisfaisante, nous proposons une repr&#233;sentation 
de la grammaire qui pr&#233;sente les avantages suivants : 
</p>
<p>&#8226; conciliation des diff&#233;rentes approches li&#233;es &#224; la question de l'ancrage, 
</p>
<p>&#8226; gain d'efficacit&#233; de l'analyseur gr&#226;ce &#224; l'int&#233;gration d'un m&#233;canisme permettant de 
filtrer l'ensemble des sch&#232;mes candidats &#224; un ancrage pour &#233;viter un &#233;chec 
d'unification plus tardif, 
</p>
<p>&#8226; am&#233;lioration de l'ind&#233;pendance entre la base de lemmes et la base de sch&#232;mes ; cette 
propri&#233;t&#233; permet de dissocier la construction de la base de sch&#232;mes (en ayant recours 
par exemple &#224; un compilateur de m&#233;tagrammaire) de celle de la base de lemmes (en 
s'appuyant par exemple sur une extraction &#224; partir d'un dictionnaire), 
</p>
<p>&#8226; utilisation de la technologie &#224; base de XML facilitant ainsi le partage des ressources et 
le d&#233;veloppement des outils. 
</p>
<p>4.2 Repr&#233;sentation ax&#233;e sur les hypertags 
</p>
<p>Notre approche dans ce domaine rejoint celle de (Kinyon 2000). Il s'agit d'associer &#224; chaque 
sch&#232;me une structure de traits, appel&#233;e hypertag. Les hypertags ont pour but la description des 
ph&#233;nom&#232;nes linguistiques encod&#233;s dans le sch&#232;me. L&#146;exemple de la Figure 4 montre, pour 
chaque sch&#232;me, les structures de traits d&#233;crivant la voix de la phrase ainsi que les fonctions 
initiales, les fonctions finales des arguments. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. Crabb&#233;, B. Gaiffe, A. Roussanaly 
</p>
<p>Une telle structure sert de base au filtrage lors du processus d'ancrage dans la mesure o&#249; elle 
permet d'atteindre des ensembles d'arbres plus fins que les familles XTAG. 
</p>
<p> 
 
</p>
<p> 
 
</p>
<p>Figure 4 : Exemple d&#146;hypertags 
</p>
<p>En suivant cette approche, si on associe au lemme comporter la structure de traits de la Figure 
5 correspondant &#224; la famille n0Vn1 , on s&#233;lectionne par succ&#232;s d'unification les deux arbres de 
la Figure 4. 
</p>
<p> 
Figure 5 : Structure de traits n0Vn1 
</p>
<p>Si on associe au lemme un hypertag correspondant &#224; l'alternance actif et sujet nominal et objet 
nominal (Figure 6), on ne lui associe plus que l'arbre de l'actif (Figure 4) : 
</p>
<p> 
Figure 6 : Structure de traits alternance actif et sujet nominal et objet nominal 
</p>
<p>Notons que les hypertags pr&#233;sentent d'autres int&#233;r&#234;ts dans le cadre de la description des 
sch&#232;mes, notamment dans le domaine de la gestion d'une grammaire : extraction de sous-
grammaires, interfaces de description du lexique,... (Kinyon 2000). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plate-forme de conception et d&#146;exploitation d&#146;une grammaire d&#146;arbres adjoints&#133; 
</p>
<p>4.3 M&#233;canisme de correspondance 
</p>
<p>Nous avons besoin d&#146;&#233;tablir des correspondances entre n&#156;uds dans des ensembles d&#146;arbres 
filtr&#233;s par des hypertags. Le m&#233;canisme de nommage de n&#156;uds de XTAG doit donc &#234;tre 
g&#233;n&#233;ralis&#233;. La solution retenue est de prendre acte de la n&#233;cessit&#233; explicite d&#146;un nommage des 
n&#156;uds2. A titre d&#146;illustration, le nommage pr&#233;sent&#233; dans la Figure 7 permet de r&#233;soudre 
l&#146;&#233;quation d&#146;ancrage top(#dest) &#8594; location=+. 
</p>
<p> 
 
</p>
<p>Figure 7 : Exemple de nommage de n&#156;uds 
</p>
<p>Il est &#224; noter que ce m&#233;canisme est suffisamment g&#233;n&#233;ral pour traiter les cas d'ancrages 
multiples dans un m&#234;me sch&#232;me. Les noms symboliques des n&#156;uds vont servir &#224; effectuer les 
correspondances relativement aux arbres d&#146;une famille dans les &#233;l&#233;ments de repr&#233;sentation. 
</p>
<p>4.4 Structure de la repr&#233;sentation 
</p>
<p>La cons&#233;quence des principes de repr&#233;sentation &#224; base d&#146;hypertags et de nommage des 
correspondances que nous avons adopt&#233;s, est que le lexique est d&#233;crit par les &#233;l&#233;ments et les 
liens suivants: 
</p>
<p>&#8226; forme fl&#233;chie : cet &#233;l&#233;ment permet de d&#233;finir des liens entre une entr&#233;e de la base 
morphologique et, d'une part, le lemme auquel elle fait r&#233;f&#233;rence et, d'autre part,  une 
structure de traits destin&#233;e &#224; encoder les traits morphologiques, 
</p>
<p>&#8226; lexicalisation : cet &#233;l&#233;ment permet essentiellement (1) de d&#233;finir le lien entre un 
lemme et une structure de traits destin&#233;e &#224; filtrer l'ensemble de sch&#232;mes dans lequel le 
lemme est ancr&#233;. Il contient &#233;galement (2) une association avec le nom du noeud 
ancre. Il contient enfin (3) une association avec un doublet constitu&#233; d'un nom de 
n&#156;ud et d'une structure de traits destin&#233;e &#224; effectuer l'op&#233;ration de projection de la 
structure de traits dans les sch&#232;mes. 
</p>
<p>Exemple :(verbe, comporter)  &#8594; (1) [Arg0 [F-init=suj] 
     Arg1 [F-init=obj]] 
    &#8594; (2) #anchor 
    &#8594; (3) (#n0, [top [hum=+]]) 
</p>
<p>                                                 
2 Ce nommage est r&#233;alis&#233; via le compilateur de m&#233;tagrammaire (infra) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. Crabb&#233;, B. Gaiffe, A. Roussanaly 
</p>
<p>5 Logiciels 
</p>
<p>La plate-forme que nous proposons, comporte deux applications centrales : le compilateur de 
m&#233;tagrammaire et l'analyseur syntaxique. Autour de ces deux applications, nous fournissons 
un ensemble d'outils permettant d'&#233;diter, de visualiser graphiquement et de tracer les 
diff&#233;rentes ressources utilis&#233;es dans ces applications. 
</p>
<p>Tous ces logiciels partagent des structures de donn&#233;es encod&#233;es en XML. Le format que nous 
avons retenu est TAGML2 (d&#233;finie par une DTD) car il offre un cadre normalis&#233; &#224; la 
repr&#233;sentation des lexiques et des grammaires TAG. Tous ces logiciels sont disponibles sur le 
site de l'&#233;quipe L&amp;D du LORIA (www.loria.fr/equipes/led/outils.html) 
</p>
<p>5.1 Compilateur de m&#233;tagrammaire 
</p>
<p>Pour obtenir les associations &lt;sch&#232;me, structure de trait, correspondance&gt; n&#233;cessaires &#224; 
notre proposition, nous avons d&#233;velopp&#233; un compilateur de m&#233;tagrammaires (Gaiffe et al. 
2002), fortement inspir&#233; du travail de (Candito 1999). Dans une approche de ce type, le 
linguiste d&#233;crit sa grammaire via des ensemble de hi&#233;rarchies de classes. Chaque classe 
comprend des contraintes topologiques devant &#234;tre v&#233;rifi&#233;es par les arbres relevant de la 
classe  et une description de la classe par une structure de traits. Les hi&#233;rarchies de classes 
sont combin&#233;es entre elles pour enrichir le graphe d'h&#233;ritage3. Enfin, les contraintes 
accumul&#233;es aux feuilles de ce graphe d'h&#233;ritage sont r&#233;solues en l'ensemble des arbres qui les 
valident. 
</p>
<p>On obtient en r&#233;sultat les associations vis&#233;es ; en effet : 
</p>
<p>&#8226; les structures de traits d&#233;corant les classes sont unifi&#233;es le long du graphe d'h&#233;ritage 
jusqu'aux classes feuilles o&#249; elles sont associ&#233;es aux arbres r&#233;sultats (ce sont nos 
hypertags); 
</p>
<p>&#8226; les contraintes topologiques contenues dans les classes sont exprim&#233;es sur des noms 
symboliques des n&#156;uds4, (exemple #agent, #dest, #anchor). et le compilateur fournit 
pour chaque arbre solution les adresses o&#249; chaque nom se projette dans l'arbre. On 
obtient ainsi les correspondance mentionn&#233;es au paragraphe 4.3. 
</p>
<p>Bien entendu, les r&#233;sultats sont fournis par ce compilateur de m&#233;tagrammaires au format 
TAGML2. Enfin, un outil annexe permet de d&#233;crire les associations lemmes, structures de 
traits de filtrage, &#233;quations symboliques et de les traduire en TAGML2. 
</p>
<p>5.2 Analyseur syntaxique 
</p>
<p>L'analyseur LTAG du Loria (LLP2) est d&#233;velopp&#233;e &#224; partir de la version pr&#233;c&#233;dente &#233;crite par 
Lopez (Lopez 1999). Les caract&#233;ristiques de cette nouvelle version sont les suivantes : 
</p>
<p>                                                 
3 Moyennant des contraintes de compatibilit&#233; 
4 Ce sont des constantes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plate-forme de conception et d&#146;exploitation d&#146;une grammaire d&#146;arbres adjoints&#133; 
</p>
<p>&#8226; elle permet  le traitement des structures de traits (FB-LTAG) (Vijay-Shanker 1987), 
</p>
<p>&#8226; elle est limit&#233;e aux grammaires d&#146;arbres ins&#233;r&#233;s (TIG) (Schabes et Waters 1995), une 
version restrictive des TAG, 
</p>
<p>&#8226; elle prend en charge des ressources d&#233;crite au format TAGML2 ; les sch&#232;mes cr&#233;&#233;s par le 
compilateur de m&#233;tagrammaires sont, de ce fait, directement exploitables par l'analyseur, 
</p>
<p>&#8226; elle dispose d'une interface graphique interactive permettant de tester une grammaire, et 
offre &#233;galement la possibilit&#233; d'un fonctionnement en mode lignes de commandes; ceci 
permet de lancer globalement l'analyse d'un lot de phrases (par exemple, un corpus), 
</p>
<p>&#8226; elle int&#232;gre une repr&#233;sentation XML des lots de phrases &#224; analyser en vue : 
</p>
<p>o de traiter un corpus annot&#233; par des informations morpho-syntaxiques : l'id&#233;e ici est de 
faciliter l'interfa&#231;age entre l'analyseur et un annotateur morpho-syntaxique de sorte &#224; 
r&#233;duire consid&#233;rablement la taille des ressources lexicales, notamment celle de la base 
morphologique, 
</p>
<p>o de traiter un corpus incluant des syntagmes partiellement analys&#233;s : l'objectif vis&#233; est de 
pr&#233;traiter les phrases &#224; analyser en s'appuyant sur les r&#233;sultats d'un analyseur de surface. 
Cette op&#233;ration vise a am&#233;liorer les performances de l'analyseur, mais elle permet 
&#233;galement d'utiliser l'analyseur pour valider des hypoth&#232;ses lexicales sur les mots 
inconnus dans le cadre d'un apprentissage, 
</p>
<p>o de traiter certaines ambigu&#239;t&#233;s lexicales, il s'agit plus pr&#233;cis&#233;ment ici du cas particulier de 
l'occurrence de  plusieurs candidats pour un mot ou groupe de mots ; cette aptitude de 
l'analyseur peut &#234;tre mise &#224; profit dans deux cas : (1) Le premier cas provient d'un 
probl&#232;me de segmentation (tokenisation) des mots compos&#233;s ; par exemple, dans le cas 
de l'expression pomme de terre, l'analyse peut se d&#233;rouler parall&#232;lement sur les 
hypoth&#232;ses de 3 mots distincts ou d'un seul mot compos&#233;. (2) Le deuxi&#232;me cas 
correspond &#224; l&#146;entr&#233;e bruit&#233;e d&#146;un syst&#232;me de reconnaissance de la parole o&#249; l'ambigu&#239;t&#233; 
est inh&#233;rente au dispositif d'acquisition. 
</p>
<p>Conclusion 
</p>
<p>L'encodage des ressources lexicales en TAGML2, constitue un socle commun &#224; l&#146;ensemble 
d'outils pr&#233;sent&#233;s dans cet article. Par ailleurs, TAGML2 fournit une repr&#233;sentation 
normalis&#233;e des ressources. La DTD originale a &#233;t&#233; con&#231;ue dans le cadre de l'Action de 
recherche concert&#233;e : Ressources lexicales pour LTAG (RLT : 
http://atoll.inria.fr/RLT/arc.html). TAGML2 a &#233;t&#233; con&#231;ue sp&#233;cifiquement &#224; 
partir de TAGML1 (Bonhomme et Lopez 2000) dans le but de permettre une repr&#233;sentation 
plus compacte du lexique LTAG. La mise &#224; disposition de biblioth&#232;ques logicielles vise &#224; 
faciliter, dans le futur, l&#146;int&#233;gration des ressources LTAG existants dans divers formats. 
</p>
<p>Par ailleurs, &#224; court terme, nous projetons d'utiliser cette plate-forme pour constituer des 
lexiques destin&#233;s &#224; &#234;tre utilis&#233;s dans des applications restreintes. Notre but, &#224; plus long terme, 
est de concevoir une grammaire &#224; plus large couverture. Grammaires que les hypertags </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. Crabb&#233;, B. Gaiffe, A. Roussanaly 
</p>
<p>permettront de filtrer pour obtenir des sous-grammaires d&#146;applications sp&#233;cifiques. Le 
traitement des &#233;quations d&#146;ancrage propos&#233; devrait alors permettre de projeter les restrictions 
de s&#233;lection li&#233;es &#224; l&#146;application sur cette grammaire. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>Abeill&#233; Anne, (2002), Une grammaire d'arbres adjoints pour le fran&#231;ais, Editions du CNRS, 
Paris 
</p>
<p>Bonhomme P. et Lopez P (2000), TagML : codage XML et ressources pour les grammaires 
d&#146;arbres adjoints lexicalis&#233;s, LREC 2000 Ath&#232;nes 
</p>
<p>Candito Marie-H&#233;l&#232;ne, (1999), Organisation Modulaire et Param&#233;trable de Grammaires 
Electroniques Lexicalis&#233;es, Th&#232;se de l&#146;Universit&#233; de Paris 7 
</p>
<p>Gaiffe B., Crabb&#233; B. et Roussanaly A. (2002), A new metagrammar compiler, in proc TAG+6 
Venise 
</p>
<p>Joshi Aravind K. and Schab&#232;s Yves, (1997), Tree Adjoining Grammars, Handbook of Formal 
Languages, eds G. Rozenberg and A. Salomaa, Berlin, Springer Verlag 
</p>
<p>Joshi Aravind K., Levy Leon S. and Takahashi M., (1975), Tree Adjunct Grammars, Journal 
of the Computer and System Sciences, vol.10, pp.136-163 
</p>
<p>Kinyon Alexandra, (2000), Hypertags, COLING-00 Sarrebr&#252;ck 
</p>
<p>Levin Beth, (1993) English Verb Classes and Alternations, The University of Chicago Press 
</p>
<p>Saint-Dizier Patrick, (1999) Predicative Forms in Natural Language and Lexical Knowledge 
Bases in Alternations and Verb Semantic Classes for French : Analysis and Class Formation, 
ed. Patrick Saint-Dizier, Kluwer, Dordrecht 
</p>
<p>Saint-Dizier Patrick, (1996), Verb Semantic Classes in French Version 2, Tech. Report., IRIT 
- CNRS&quot;, 
</p>
<p>Schab&#232;s Y. et Waters R (1995), Tree Inserted Grammar : a Cubic-time Parsable Formalism 
that lexicalizes Context Free Grammar without Changing the Trees Produced, Computational 
Linguistics MIT Press 1995. 
</p>
<p>Vijay-Shanker K, (1987) A study of Tree Adjoining Grammar, PhD. Th. University of 
Pennsylvania, Department of computer and information science 
</p>
<p>XTAG Research Group (2001) A Lexicalized Tree Adjoining Grammar for English, IRCS, 
University of Pennsylvania, num. IRCS-01-03 </p>

</div></div>
</body></html>