<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Indexation discursive pour la navigation intradocumentaire : cadres temporels et spatiaux dans l&#8217;information g&#233;ographique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Indexation discursive pour la navigation intradocumentaire :
cadres temporels et spatiaux dans l&#8217;information g&#233;ographique
</p>
<p>F. Bilhaut*, M. Ho-Dac**, A. Borillo**, T. Charnois*, P. Enjalbert*,
A. Le Draoulec**, Y. Mathet*, H. Miguet**, M.-P. P&#233;ry-Woodley**,
</p>
<p>L. Sarda**
</p>
<p>* GREYC, Universit&#233; de Caen, Campus II
{fbilhaut, charnois, patrice, mathet}@info.unicaen.fr
</p>
<p>** ERSS, Universit&#233; Toulouse Le Mirail
{hodac, aborillo, draoulec, miguet, pery, lsarda}@univ-tlse2.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Analyse automatique de discours, Cadres de discours, Recherche d&#8217;information, Document
g&#233;ographique
Automatic discourse analysis, Discourse framing, Information retrieval, Geographical docu-
ments
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article concerne la structuration automatique de documents par des m&#233;thodes linguistiques.
De telles proc&#233;dures sont rendues n&#233;cessaires par les nouvelles t&#226;ches de recherche d&#8217;information
intradocumentaires (syst&#232;mes de questions-r&#233;ponses, navigation s&#233;lective dans des documents...).
Nous d&#233;veloppons une m&#233;thode exploitant la th&#233;orie de l&#8217;encadrement du discours de Charolles,
avec une application vis&#233;e en recherche d&#8217;information dans les documents g&#233;ographiques -
d&#8217;o&#249; l&#8217;int&#233;r&#234;t tout particulier port&#233; aux cadres spatiaux et temporels. Nous d&#233;crivons une im-
pl&#233;mentation de la m&#233;thode de d&#233;limitation de ces cadres et son exploitation pour une t&#226;che
d&#8217;indexation intratextuelle croisant les crit&#232;res spatiaux et temporels avec des crit&#232;res th&#233;ma-
tiques.
</p>
<p>This paper proposes linguistics-based methods for the automatic identification of text segments.
Such procedures are required by new tasks appearing in intra-document information retrieval
(question-answer systems, selective browsing). Our method is based on Charolles&#8217; theory of
discourse framing and focuses on temporal and spatial frames. We describe an implementation
of our method for determining frame boundaries and its exploitation for intradocument indexing
combining spatial, temporal and thematic criteria.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F. Bilhaut, M. Ho-Dac &amp; al.
</p>
<p>1 Cadres de discours et recherche d&#8217;information
</p>
<p>D&#8217;une mani&#232;re g&#233;n&#233;rale, les travaux sur l&#8217;indexation et la recherche d&#8217;information font peu
r&#233;f&#233;rence &#224; la structuration discursive des documents. Les m&#233;thodes employ&#233;es sont le plus
souvent fond&#233;es sur des crit&#232;res statistiques ou num&#233;riques, portant sur la distribution des mots
et leur r&#233;currence (Hearst, 1994). Par ailleurs, tant que l&#8217;unit&#233; pertinente est le document,
la structuration interne de celui-ci n&#8217;a pas lieu d&#8217;intervenir. Mais les applications en traite-
ment automatique des langues ont des fronti&#232;res mouvantes ; les finalit&#233;s comme les m&#233;thodes
se red&#233;finissent, se redistribuent constamment. On peut identifier actuellement une &#233;volution
vers un rapprochement entre recherche d&#8217;information, synth&#232;se de documents et syst&#232;mes de
questions-r&#233;ponses, et ce &#224; travers le d&#233;veloppement de syst&#232;mes de navigation s&#233;lective. C&#8217;est
ce type d&#8217;application que nous visons ici dans l&#8217;univers de l&#8217;information g&#233;ographique1. De tels
syst&#232;mes ne se contentent pas de s&#233;lectionner les documents pertinents, ils guident l&#8217;utilisateur
&#224; l&#8217;int&#233;rieur de ces documents, vers les segments qui correspondent au plus pr&#232;s &#224; une requ&#234;te
ou &#224; un profil (Descl&#233;s &amp; Minel, 2000; Voorhees, 2001). La question de la d&#233;finition des unit&#233;s
d&#8217;information &#224; indexer et/ou marquer en vue de ces parcours devient cruciale.
</p>
<p>Les techniques mises en &#339;uvre dans la synth&#232;se de documents et dans les syst&#232;mes de questions-
r&#233;ponses sont utiles pour identifier des &quot;zones&quot; contenant des &#233;l&#233;ments lexicaux pertinents.
Mais reste &#224; d&#233;limiter des segments de texte formant des unit&#233;s d&#8217;information. Certaines ap-
proches statistiques cherchent &#224; identifier des ruptures isolant des segments &quot;th&#233;matiquement
homog&#232;nes&quot; (&quot;text-tiling&quot;, (Hearst, 1994)). D&#8217;autres, dont nous nous rapprocherons, reposent
sur le filtrage de marques discursives (cf. les &quot;cue phrases&quot; de (Hovy &amp; Lin, 1999), les &quot;expres-
sions prototypiques&quot; de (Descl&#233;s &amp; Minel, 2000)), mais l&#224; encore ces marques sont rep&#233;r&#233;es
pour contribuer au calcul du score de saillance des unit&#233;s les contenant, plut&#244;t que pour leur
fonction de structuration.
</p>
<p>Le pr&#233;sent article se situe dans une probl&#233;matique g&#233;n&#233;rale diff&#233;rente, celle du rep&#233;rage de
structures proprement discursives, et de l&#8217;exploitation de cette structuration dans des t&#226;ches de
recherche d&#8217;information (au sens d&#233;fini plus haut, c&#8217;est-&#224;-dire visant une indexation et une nav-
igation intradocumentaire). Nous proposons une approche qui se fonde sur un mode de struc-
turation sp&#233;cifique, &quot;l&#8217;encadrement du discours&quot; mis au jour par (Charolles, 1997). Charolles
identifie des segments &#8211; &quot;cadres de discours&quot; &#8211; homog&#232;nes par rapport &#224; un crit&#232;re s&#233;man-
tique (par exemple une localisation spatiale ou temporelle) sp&#233;cifi&#233; par une expression d&#233;tach&#233;e
en initiale de phrase (donc ais&#233;ment rep&#233;rable) : un introducteur de cadre (dor&#233;navant IC).
Les IC sont pr&#233;sent&#233;s comme des marqueurs d&#8217;indexation &quot;permettant de r&#233;partir les contenus
propositionnels dans des blocs homog&#232;nes relativement &#224; un crit&#232;re sp&#233;cifi&#233; par le contenu de
l&#8217;introducteur&quot; (op. cit. : 24). On voit imm&#233;diatement le b&#233;n&#233;fice potentiel du rep&#233;rage de telles
structures pour la recherche d&#8217;information et la navigation intratextuelle.
</p>
<p>Les documents de g&#233;ographie humaine constituent un cadre particuli&#232;rement attractif &#224; la fois
pour l&#8217;observation de ces structures, et pour leur exploitation dans une t&#226;che de recherche
d&#8217;information. En effet, la propri&#233;t&#233; caract&#233;ristique de l&#8217;information g&#233;ographique est d&#8217;ancrer
ce que nous d&#233;signons comme ph&#233;nom&#232;ne (le &quot;quoi&quot;) dans une localisation spatiale (le &quot;o&#249;&quot;) et,
fr&#233;quemment, temporelle (le &quot;quand&quot;). Cette propri&#233;t&#233; se refl&#232;te dans les textes, o&#249; l&#8217;on observe
imm&#233;diatement une pr&#233;sence massive d&#8217;expressions sp&#233;cifiant des crit&#232;res spatiaux/temporels
(telles que &quot;Dans l&#8217;Ouest de la France&quot; ou &quot;Dans les ann&#233;es 1950, voir exemple [1])2. Cor-
</p>
<p>1Projet G&#233;oSem, soutenu par le programme &quot;Soci&#233;t&#233; de l&#8217;Information&quot;, d&#233;partements STIC et SHS du CNRS.
2Bien que notre corpus comporte plusieurs documents, l&#8217;&#233;tude pr&#233;sent&#233;e ici se fonde principalement sur Atlas</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Indexation discursive pour la navigation intradocumentaire
</p>
<p>r&#233;lativement, une requ&#234;te associera naturellement ces trois &quot;dimensions&quot; de l&#8217;information, par
exemple : &quot;Evolution des effectifs scolaires dans l&#8217;Est dans les ann&#233;es 1980&quot;. La r&#233;ponse devra
consister en passages reliant les deux ou trois crit&#232;res de recherche. Parmi les divers indices
textuels permettant de relier ces 3 crit&#232;res dans le texte, les cadres de discours constituent un
&#233;l&#233;ment priv&#233;l&#233;gi&#233;.
</p>
<p>[1] De 1965 &#224; 1985, le nombre de coll&#233;giens et de lyc&#233;ens a augment&#233; de 70%, mais selon
des rythmes et avec des intensit&#233;s diff&#233;rents selon les acad&#233;mies et les d&#233;partements. Faible
dans le Sud-Ouest et le Massif central, mod&#233;r&#233;e en Bretagne et &#224; Paris, l&#8217;augmentation a
&#233;t&#233; consid&#233;rable dans le Centre-Ouest, en Alsace, dans la r&#233;gion Rh&#244;ne-Alpes et dans les
d&#233;partements de la grande banlieue parisienne o&#249; les effectifs ont souvent plus que doubl&#233;.
</p>
<p>Nous nous int&#233;ressons particuli&#232;rement dans cet article au probl&#232;me d&#233;licat de la &quot;port&#233;e&quot; des
expressions introductrices de cadres, &#233;l&#233;ment cl&#233; de leur fonction de structuration du discours
et donc de la d&#233;limitation des unit&#233;s d&#8217;information pertinentes pour la recherche d&#8217;information
(section 2). La section 3 pr&#233;sente la mise en &#339;uvre informatique du mod&#232;le et son application &#224;
l&#8217;indexation intradocumentaire de documents g&#233;ographiques. Partant de ces r&#233;sultats, la section
4 proposera quelques &#233;l&#233;ments de r&#233;flexion g&#233;n&#233;rale sur l&#8217;apport d&#8217;une approche discursive &#8211;
telle que la th&#233;orie de l&#8217;encadrement &#8211; au probl&#232;me de la segmentation th&#233;matique.
</p>
<p>2 Crit&#232;res d&#8217;&#233;valuation de la port&#233;e
</p>
<p>Il est indispensable, pour la d&#233;limitation de segments, de rechercher des indices suscepti-
bles d&#8217;indiquer la fin d&#8217;un cadre, c&#8217;est-&#224;-dire susceptibles d&#8217;indiquer au lecteur que le crit&#232;re
d&#8217;interpr&#233;tation fourni par l&#8217;IC ne s&#8217;applique plus. Si les m&#234;mes types d&#8217;indices semblent de-
voir s&#8217;appliquer aux cadres spatiaux et temporels, le domaine temporel a &#233;t&#233; pour l&#8217;instant le
terrain privil&#233;gi&#233; de ce type d&#8217;&#233;tude. Trois grands types d&#8217;indices de fin de cadre temporel ont
&#233;t&#233; mis au jour : (i) occurrence d&#8217;une expression temporelle r&#233;f&#233;rant &#224; un temps qui n&#8217;est pas
s&#233;mantiquement compatible avec la p&#233;riode d&#233;not&#233;e par l&#8217;IC ; (ii) changement de temps verbal :
passage (dans un sens ou l&#8217;autre) du non-pr&#233;sent (pass&#233;-compos&#233;, imparfait, etc.) au pr&#233;sent ;
(iii) changement de paragraphe.
(Le Draoulec &amp; M.-P. P&#233;ry-Woodley, 2001) met en &#233;vidence la complexit&#233; des interactions
entre ces diff&#233;rents indices, qui apparaissent rarement seuls. Mais ce qui nous int&#233;resse ici,
dans la mesure o&#249; il s&#8217;agit de permettre une application informatique du rep&#233;rage de ces indices
&#224; la fermeture des cadres, c&#8217;est d&#8217;explorer les limites de leur fiabilit&#233;. De fait, il appara&#238;t que
le seul indice absolument fiable est l&#8217;introduction d&#8217;un nouvel IC de type incompatible. Pour
les autres, leur simple pr&#233;sence ne marque pas &#224; coup s&#251;r la fin d&#8217;un cadre : ils ne valent que
dans certaines configurations. Ainsi, concernant la pr&#233;sence d&#8217;expressions temporelles non IC,
il faudrait tenir compte du fait qu&#8217;elles peuvent appara&#238;tre par exemple dans des relatives, et
donc en arri&#232;re-plan par rapport &#224; la ligne g&#233;n&#233;rale du discours &#8211; dans ce type de situation,
l&#8217;expression temporelle est impropre &#224; d&#233;clencher la fermeture du cadre.
</p>
<p>Le passage d&#8217;un non-pr&#233;sent &#224; un pr&#233;sent ne marque pas n&#233;cessairement non plus la fermeture
d&#8217;un cadre. D&#8217;autres indices doivent s&#8217;y associer tels que des marques d&#8217;un passage au mode
</p>
<p>de la France Scolaire de la Maternelle au Lyc&#233;e, R. H&#233;rin et R. Rouault, 1994, 56346 occurrences.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F. Bilhaut, M. Ho-Dac &amp; al.
</p>
<p>commentaire (utilisation des pronoms &quot;on&quot; ou &quot;nous&quot;) ; ou encore, une r&#233;f&#233;rence adjectivale au
temps d&#8217;&#233;nonciation (cf. par exemple &quot;actuelle&quot; dans &quot;la tendance actuelle&quot;).
Le changement de paragraphe est un indice de fin de port&#233;e plus fort. Cependant, quelques
r&#233;serves sont l&#224; encore &#224; faire. En effet, dans le cas des &#233;num&#233;rations o&#249; chaque item peut
correspondre &#224; un paragraphe, un crit&#232;re spatial/temporel introduit en amorce peut &#233;tendre sa
port&#233;e sur l&#8217;ensemble des items.
</p>
<p>Les indices mentionn&#233;s ici, et malgr&#233; les r&#233;serves &#233;mises &#224; leur propos, seront utilis&#233;s comme
indices de fin de port&#233;e dans la mise en &#339;uvre informatique. A ce stade, cette mise en &#339;uvre,
autant qu&#8217;une premi&#232;re &#233;bauche de l&#8217;application vis&#233;e, constitue un banc d&#8217;essai, permettant
ult&#233;rieurement d&#8217;affiner l&#8217;analyse linguistique.
</p>
<p>3 Mise en oeuvre informatique
</p>
<p>La mise en oeuvre automatique de l&#8217;approche linguistique vise &#224; &#233;tablir des liens entre les
ph&#233;nom&#232;nes et leur localisation dans l&#8217;espace et/ou le temps, se traduisant par une indexation
multi-facettes. L&#8217;impl&#233;mentation de la m&#233;thode d&#8217;analyse a &#233;t&#233; int&#233;gralement r&#233;alis&#233;e gr&#226;ce &#224; la
plate-forme LinguaStream3. La cha&#238;ne de traitement sera pr&#233;sent&#233;e ici succintement, en se fo-
calisant sur les aspects li&#233;s aux cadres du discours (le processus complet est d&#233;crit dans (Bilhaut
&amp; al., 2003)). Outre les manipulations permettant d&#8217;obtenir un document XML exploitable par
la plate-forme, cette cha&#238;ne int&#232;gre en premier lieu des analyseurs morphologiques classiques,
proc&#233;dant au d&#233;coupage en mots simples, puis &#224; l&#8217;&#233;tiquetage et &#224; la lemmatisation.
</p>
<p>La premi&#232;re &#233;tape concerne l&#8217;extraction et l&#8217;analyse s&#233;mantique des expressions spatiales, tem-
porelles, et d&#233;notant les ph&#233;nom&#232;nes. Dans les deux premiers cas, la recherche des syntagmes
correspondants repose sur une analyse morpho-syntaxique locale. R&#233;alis&#233;s en Prolog, les anal-
yseurs sont bas&#233;s sur des grammaires d&#8217;unification, la reconnaissance et l&#8217;analyse s&#233;mantique
du syntagme &#233;tant effectu&#233;es simultan&#233;ment par compositionnalit&#233;.
</p>
<p>Les expressions d&#233;notant les ph&#233;nom&#232;nes sont quant &#224; elles extraites &#224; l&#8217;aide d&#8217;une grammaire
reconnaissant les syntagmes nominaux compos&#233;s, d&#8217;apr&#232;s les &#233;tiquettes morphologiques et sans
utilisation de lexique. Cette &#233;tape g&#233;n&#233;rant un grand nombre de candidats, diff&#233;rents traitements
de nature statistico-terminologique sont appliqu&#233;s, reposant principalement sur des proc&#233;d&#233;s
classiquement utilis&#233;s en recherche d&#8217;information, bas&#233;s sur l&#8217;&#233;tude statistique de la distribution
des formes (de type tf &#183; idf &#8211; Term Frequency by Inverse Document Frequency).
A l&#8217;issue de ces diff&#233;rentes analyses, l&#8217;annotation s&#233;mantique des document qui en r&#233;sulte per-
met de proc&#233;der &#224; leur analyse au niveau discursif. En s&#8217;appuyant sur des mod&#232;les linguistiques,
et particuli&#232;rement celui de l&#8217;encadrement du discours, elle permet d&#8217;&#233;tablir des corr&#233;lations en-
tre expressions spatiales/temporelles et &quot;ph&#233;nom&#232;nes&quot; de fa&#231;on plus pertinente que par simple
&#233;tude de leur co-pr&#233;sence dans le discours, qui conduirait trop fr&#233;quemment &#224; l&#8217;&#233;tablissement
de relations s&#233;mantiquement invalides. Les cadres spatio-temporels jouant un r&#244;le pr&#233;pond&#233;rant
dans cette analyse, la d&#233;tection des IC correspondants constitue l&#8217;&#233;tape suivante du traitement.
En s&#8217;appuyant sur le marquage des expressions spatiales et temporelles, l&#8217;op&#233;ration consiste
&#224; d&#233;tecter leur pr&#233;sence en position d&#233;tach&#233;e en d&#233;but de phrase. Lorsqu&#8217;un IC est rencon-
tr&#233;, la valeur s&#233;mantique correspondante devient un crit&#232;re d&#8217;interpr&#233;tation qui sera associ&#233; aux
ph&#233;nom&#232;nes rencontr&#233;s &#224; l&#8217;int&#233;rieur du cadre introduit. Quand l&#8217;IC est rencontr&#233; &#224; l&#8217;int&#233;rieur
</p>
<p>3http://www.info.unicaen.fr/~fbilhaut/linguastream.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Indexation discursive pour la navigation intradocumentaire
</p>
<p>d&#8217;un cadre de type diff&#233;rent (ici temporel/spatial), le nouveau crit&#232;re vient enrichir le contexte
courant, et pourra alors aboutir &#224; la localisation des ph&#233;nom&#232;nes &#224; la fois dans l&#8217;espace et le
temps. Ce m&#233;canisme n&#233;cessite bien-s&#251;r la d&#233;tection de la borne finale des cadres, probl&#232;me
complexe pour lequel les crit&#232;res de port&#233;e d&#233;crits en section 2 sont appliqu&#233;s.
</p>
<p>A l&#8217;issue de ce processus, le syst&#232;me produit une indexation multi-facettes des documents, com-
pos&#233;e de triplets (ph&#233;nom&#232;ne/espace/temps). Cette indexation est exploit&#233;e par un moteur de
recherche capable de r&#233;pondre &#224; des requ&#234;tes portant simultan&#233;ment sur les 3 dimensions. Les
r&#233;sultats sont pr&#233;sent&#233;s &#224; l&#8217;utilisateur en mettant en valeur des passages d&#233;termin&#233;s dynamique-
ment, d&#233;limit&#233;s principalement &#224; l&#8217;aide des bornes des cadres s&#233;lectionn&#233;s.
</p>
<p>L&#8217;&#233;valuation du syst&#232;me est difficile, en raison de la complexit&#233; du processus dans son en-
semble, et surtout de la subjectivit&#233; de la notion de port&#233;e. De plus, il n&#8217;existe pas &#224; notre
connaissance d&#8217;analyseur &#233;quivalent permettant de proc&#233;der &#224; une &#233;valuation par comparaison.
Nous privil&#233;gions donc l&#8217;&#233;valuation bas&#233;e sur l&#8217;annotation manuelle. Concernant l&#8217;analyseur de
cadres temporels, une &#233;valuation quantitative &#224; partir de notre corpus d&#8217;&#233;tude annot&#233; manuelle-
ment mesure un taux de pr&#233;cision de 88% et un taux de rappel de 79%. Afin d&#8217;obtenir une
mesure plus significative, une phase d&#8217;&#233;valuation syst&#233;matique est en cours, reposant sur l&#8217;anno-
tation manuelle des cadres dans un vaste corpus.
</p>
<p>4 Les cadres pour la structuration th&#233;matique
</p>
<p>A la lumi&#232;re de cette exp&#233;rience, nous souhaitons conclure en soulignant l&#8217;int&#233;r&#234;t du mod&#232;le de
l&#8217;encadrement dans le contexte plus g&#233;n&#233;ral de l&#8217;analyse th&#233;matique automatique du discours.
Ce type de m&#233;thode vise &#224; d&#233;limiter automatiquement des segments textuels relatifs &#224; un m&#234;me
th&#232;me, et &#233;ventuellement &#224; en produire une repr&#233;sentation symbolique. Comme &#233;voqu&#233; en sec-
tion 1, on trouve majoritairement des approches s&#8217;appuyant sur un mod&#232;le lin&#233;aire du discours,
qui se trouve alors segment&#233; en fragments adjacents et non superpos&#233;s auxquels on attribue une
certaine homog&#233;n&#233;it&#233; th&#233;matique, dans la lign&#233;e de (Hearst, 1994). Mais cette approche trouve
d&#8217;importantes limites lorsqu&#8217;elle est appliqu&#233;e au document g&#233;ographique, qui fait &#233;merger une
conception diff&#233;rente de la notion de th&#232;me. On peut en effet consid&#233;rer que dans ce type de
discours, certaines r&#233;f&#233;rences spatiales ou temporelles font partie int&#233;grante du th&#232;me que l&#8217;on
peut attribuer &#224; un segment textuel donn&#233;, par exemple &quot;La France des ann&#233;es 1980&quot; ou &quot;Le
retard scolaire dans l&#8217;Ouest depuis 1985&quot;.
</p>
<p>Les m&#233;thodes s&#8217;appuyant sur la distribution des formes de surface se r&#233;v&#232;lent ici inefficaces
puisque la compatibilit&#233; s&#233;mantique entre r&#233;f&#233;rences spatiales ou temporelles ne se traduit
quasiment jamais par une similitude lexicale, et le ph&#233;nom&#232;ne d&#8217;isotopie dans un cadre spatio-
temporel est rarement engendr&#233; par une r&#233;currence lexicale ou s&#233;mantique. L&#8217;analyse des in-
troducteurs associ&#233;e &#224; un calcul de port&#233;e semble donc constituer une approche adapt&#233;e &#224; ce
probl&#232;me, puisque l&#8217;analyse d&#8217;un seul syntagme ais&#233;ment identifiable automatiquement permet
d&#8217;obtenir un ancrage th&#233;matique pertinent pour l&#8217;ensemble d&#8217;un segment. L&#8217;utilisation de m&#233;th-
odes d&#8217;analyse s&#233;mantique telles que pr&#233;sent&#233;es dans la section 3 permet en outre d&#8217;en obtenir
une repr&#233;sentation symbolique, et non purement quantitative ou num&#233;rique.
</p>
<p>Dans (Ferret &amp; al., 2001), les auteurs proposent l&#8217;exploitation des introducteurs de cadres th&#233;-
matiques comme indices venant confirmer ou infirmer les choix de segmentation th&#233;matique
issus de crit&#232;res statistiques. Cette approche semble cependant n&#233;gliger la fonction structurante
des cadres du discours, qui ne peut se r&#233;duire &#224; la fonction d&#8217;&quot;indice&quot; de leurs introducteurs,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F. Bilhaut, M. Ho-Dac &amp; al.
</p>
<p>mais qui pose les probl&#232;mes difficiles de la port&#233;e et des relations inter-cadres. La nature hi&#233;rar-
chique de ce mod&#232;le autorise en effet la repr&#233;sentation de structures imbriqu&#233;es, qui ne peuvent
&#234;tre repr&#233;sent&#233;es dans un mod&#232;le lin&#233;aire. Si des travaux tels que (Porhiel, 2001) s&#8217;attachent &#224;
la d&#233;tection des cadres dits &quot;th&#233;matiques&quot; en int&#233;grant la notion de port&#233;e, on se heurte alors
au probl&#232;me de la marginalit&#233; de ce type de cadres (du moins dans notre corpus, raison pour
laquelle nous utilisons des approches statistiques pour la dimension &quot;ph&#233;nom&#232;nes&quot;). Il faut
donc souligner l&#8217;int&#233;r&#234;t d&#8217;une approche int&#233;grant le mod&#232;le de l&#8217;encadrement comme &#233;l&#233;ment
de structuration non lin&#233;aire et des m&#233;thodes de nature statistique, qui pourraient fournir des
indices suppl&#233;mentaires de fin de port&#233;e, ou apporter des &#233;l&#233;ments de structuration lorsque les
introducteurs ne sont pas pr&#233;sents. Inversement, les crit&#232;res statistiques peuvent tirer parti de
la d&#233;tection des introducteurs de cadres, puisque ces derniers renforcent la saillance th&#233;ma-
tique des formes qui les suivent. Cette id&#233;e est exploit&#233;e dans le syst&#232;me d&#8217;indexation pr&#233;sent&#233;
ici, pour renforcer la pond&#233;ration attribu&#233;e aux ph&#233;nom&#232;nes situ&#233;s dans le champ direct d&#8217;un
introducteur spatial ou temporel. Le m&#233;canisme mis en place repose sur le fait que, dans le
discours g&#233;ographique, les ph&#233;nom&#232;nes th&#233;matiquement pertinents ont de fortes chances d&#8217;&#234;tre
localis&#233;s spatialement et/ou temporellement : les introducteurs de cadres spatiaux et temporels
fonctionneraient ainsi &#233;galement comme introducteurs th&#233;matiques.
</p>
<p>R&#233;f&#233;rences
F. Bilhaut, T. Charnois, P. Enjalbert, Y. Mathet, 2003, Passage extraction in geographical documents,
New Trends in Intelligent Information Processing and Web Mining, Zakopane, Poland (&#224; para&#238;tre).
T. Charnois, Y. Mathet, P. Enjalbert, F. Bilhaut, Geographic reference analysis for geographic docu-
ment querying, Workshop on the Analysis of Geographic References, Human Language Technology
Conference (NAACL-HLT 2003), 31 Mai - 1er juin, Edmonton, Alberta, Canada.
M. Charolles, 1997, L&#8217;encadrement du dicours - Univers, champs, domaines et espace, Cahier de
recherche linguistique, 6, pp. 1-60.
J.-P. Descl&#233;s, J.-L. Minel, 2000, R&#233;sum&#233; automatique et filtrage des textes, In Ing&#233;nierie des langues, ed.
J.-M. Pierrel, Herm&#232;s.
</p>
<p>O. Ferret, B. Grau, J.-L. Minel, S. Porhiel, 2001, Rep&#233;rage de structures th&#233;matiques dans des textes,
Actes de TALN 2001, Tours, pp. 163-172.
M. Hearst, 1994, Multi-paragraph segmentation of expository texts, 32th Annual Meeting of the Associ-
ation for Computational Linguistics, 9:16.
M. Ho-Dac, A. Le Draoulec, M.-P. P&#233;ry-Woodley, 2001, Cohabitation des dimensions temps, espace et
&quot;ph&#233;nom&#232;nes&quot; dans un texte g&#233;ographique, Cahiers de Grammaire 26, &quot;S&#233;mantique et Discours&quot;, pp.
125-142.
E. Hovy, C. Lin, 1999, Automated text summarization in SUMMARIST, In I. Mani and M. Maybury
(1999), (eds.) Advances in Automatic Text Summarization. Cambridge : The MIT Press, pp. 81-94.
A. Le Draoulec, M.-P. P&#233;ry-Woodley, 2001 Corpus-based identification of temporal organisation in
discourse, Proceedings of the Corpus Linguistics 2001 Conference, Lancaster, pp. 159-166.
S. Porhiel, 2001, Linguistic expressions as a tool to extract thematic information, Corpus Linguistic,
Lancaster, pp. 477-482.
</p>
<p>E. Voorhees, 2001, Overview of the TREC 2001 Question Answering Track,
http://trec.nist.gov/pubs/trec10/t10_proceedings.html.</p>

</div></div>
</body></html>