<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Les signes grammaticaux dans l&#8217;interface s&#233;mantique-syntaxe d&#8217;une grammaire d&#8217;unification</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003
</p>
<p>Les signes grammaticaux
 dans l&#8217;interface s&#233;mantique-syntaxe
</p>
<p>d&#8217;une grammaire d&#8217;unification
</p>
<p>Sylvain Kahane1
</p>
<p>Lattice, Universit&#233; Paris 7
http://www.linguist.jussieu.fr/~skahane
</p>
<p>sk@ccr.jussieu.fr
</p>
<p>R&#233;sum&#233; &#8211; Abstract
Cet article pr&#233;sente une grammaire d&#8217;unification dans laquelle les morph&#232;mes grammaticaux
sont trait&#233;s similairement aux morph&#232;mes lexicaux!: les deux types de morph&#232;mes sont trait&#233;s
comme des signes &#224; part enti&#232;re et sont d&#233;cris par des structures &#233;l&#233;mentaires qui peuvent
s&#8217;unifier directement les unes aux autres (ce qui en fait une grammaire de d&#233;pendance). Nous
illustrerons notre propos par un fragment de l&#8217;interface s&#233;mantique-syntaxe du fran&#231;ais pour le
verbe et l&#8217;adjectif!: voix, modes, temps, impersonnel et tough-movement.
</p>
<p>This paper presents a unification grammar where the grammatical morphemes are handled as the
lexical morphemes: Both kinds of morphemes are handled as signs and described by elementary
structures which directly unify to each other (making the grammar a dependency grammar). Our
purpose will be illustrated by a fragment of the semantics-syntax interface of French for verbs
and adjectives: voices, moods, tenses, impersonal, and tough-movement.
</p>
<p>Mots Cl&#233;s &#8211; Keywords
Morph&#232;me grammatical, interface syntaxe-s&#233;mantique, grammaire d&#8217;unification, grammaire de
d&#233;pendance, HPSG, passif, impersonnel, tough-movement.
</p>
<p>Grammatical morpheme, syntax-semantics interface, unification grammar, dependency grammar,
passive, impersonal, tough-movement.
</p>
<p>1 Introduction
La plupart des mod&#232;les linguistiques actuels se sont d&#233;velopp&#233;s &#224; partir de mod&#232;les syntaxiques,
notamment la Syntaxe X-barre (Jackendoff 1977). Avec la prise de conscience en linguistique
formelle de l&#8217;importance des variations lexicales dans les ann&#233;es 1970, les mod&#232;les qui ont
&#233;merg&#233; &#224; la fin des ann&#233;es 1970 comme LFG, TAG et G/HPSG ont mis en avant la n&#233;cessit&#233;
d&#8217;un lexique informationnellement cons&#233;quent et structur&#233; en cons&#233;quence. L&#8217;architecture du
                                                
</p>
<p>1 Je remercie Igor Mel'cuk, ainsi que quatre relecteurs anonymes, pour leur lecture attentive du manuscrit et les
nombreuses remarques constructives qu'ils on fait, auxquelles je n'ai malheureusement souvent pas pu
apporter une r&#233;ponse satisfaisante ici.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane
</p>
<p>lexique de ces mod&#232;les est maintenant la suivante!: une premi&#232;re composante du lexique donne la
description des lex&#232;mes (= signes lexicaux)!; une deuxi&#232;me composante du lexique sp&#233;cifie un
certain nombre d&#8217;op&#233;rations, appel&#233;es relations lexicales, qui permettent de d&#233;river de chaque
lex&#232;me les formes fl&#233;chies qui lui correspondent (Bresnan 1998, Sag &amp; Wasow 1999). Cette
architecture du lexique est en quelque sorte le troisi&#232;me stade de la formalisation des signes
grammaticaux dans les mod&#232;les linguistiques. Prenons l&#8217;exemple bien connu du passif. Dans
Chomsky 1957, le passif est trait&#233; comme une transformation entre deux structures syntaxiques.
Avec le d&#233;veloppement de la composante lexicale des mod&#232;les linguistiques, l&#8217;id&#233;e &#233;merge
naturellement de ramener le traitement du passif &#224; une relation &#224; l&#8217;int&#233;rieur du lexique (Wasow
1977, Bresnan 1982). Il ne s&#8217;agit pas encore d&#8217;une relation entre un lex&#232;me et un mot-forme,
mais plut&#244;t d&#8217;une relation entre deux mots-formes, la forme active et la forme passive d&#8217;un
verbe.
</p>
<p>Dans un mod&#232;le o&#249; la relation lex&#232;me - mot-forme est trait&#233;e &#224; l&#8217;int&#233;rieur du lexique, les signes
grammaticaux ou gramm&#232;mes n&#8217;ont pas r&#233;ellement de statut. On pourrait dire qu&#8217;ils
correspondent aux op&#233;rations qui permettent de d&#233;river les mots-formes des lex&#232;mes, mais la
question n&#8217;est pas abord&#233;e. Par exemple, en HPSG, mots-formes et lex&#232;mes re&#231;oivent
explicitement le statut de signes linguistiques, mais la question de savoir si les relations lexicales
sont aussi des signes n&#8217;est jamais pos&#233;e2. De plus, le traitement des relations lexicales est
g&#233;n&#233;ralement grossier!: par exemple, dans Sag &amp; Wasow 1999!: 189, le passage du lex&#232;me
anglais EAT au mot-forme eats (la forme du pr&#233;sent de l&#8217;indicatif de la 3&#232;me personne du
singulier) est effectu&#233; par une seule op&#233;ration, sans que soient distingu&#233;s les gramm&#232;mes de
voix, mode, temps et accord en personne et en nombre (ce qui au passage est une importante
perte de g&#233;n&#233;ralit&#233;, ce &#224; quoi HPSG est g&#233;n&#233;ralement fort sensible).
</p>
<p>Dans cet article, nous allons nous limiter &#224; la pr&#233;sentation de l&#8217;interface s&#233;mantique&#8211;syntaxe, &#224;
savoir la correspondance entre une repr&#233;sentation s&#233;mantique, limit&#233;e ici &#224; un graphe de relations
pr&#233;dicat-argument entre unit&#233;s s&#233;mantiques3, et une repr&#233;sentation syntaxique, encod&#233;e ici par un
arbre de d&#233;pendance non ordonn&#233;. Il est important de noter que notre structure syntaxique
n&#8217;encode pas l&#8217;ordre des mots, lequel appara&#238;t dans la structure (morpho)topologique,
interm&#233;diaire entre les structures syntaxique et phonologique/graphique. Pour une pr&#233;sentation
de l&#8217;interface syntaxe-morphotopologie, on pourra consulter Gerdes &amp; Kahane 2001. Notre
mod&#232;le linguistique complet, la Grammaire d&#8217;Unification Sens-Texte [GUST] (Kahane 2001,
2002), est bas&#233; sur la th&#233;orie Sens-Texte (Mel&#8217;cuk 1997) et s&#8217;inspire &#233;galement d&#8217;HPSG et
TAG. Comme en HPSG, les structures associ&#233;es aux signes se combinent par unification. A
l&#8217;instar de TAG et &#224; la diff&#233;rence d&#8217;HPSG, ces signes se combinent directement entre eux, sans
que la combinaison de deux signes soit valid&#233;e par un sch&#233;ma de combinaison et qu'une
structure s&#233;par&#233;e soit associ&#233;e au syntagme r&#233;sultant de la combinaison de deux &#233;l&#233;ments. Ceci,
plus encore que l'utilisation d'arbres de d&#233;pendance pour la repr&#233;sentation syntaxique, fait de
cette grammaire une grammaire de d&#233;pendance (voir &#224; ce sujet Vijay-Shanker 1987 et Rambow
&amp; Joshi 1994 pour le fait que les arbres de d&#233;rivation TAG sont des arbres de d&#233;pendance).
</p>
<p>Nous pr&#233;senterons notre formalisme dans la Section 2, ainsi que des premiers exemples de
structures associ&#233;es &#224; des morph&#232;mes lexicaux. Les Sections 3 et 4 seront respectivement
consacr&#233;es &#224; la description de signes grammaticaux pour le verbe et l'adjectif. Nous verrons &#224;
travers les mod&#233;lisations de l'impersonnel et du tough-movement les raisons qui nous ont
amen&#233;s &#224; consid&#233;rer conjointement verbes et adjectifs.
                                                
</p>
<p>2 A vrai dire, la nature formelle des relations lexicales interdit de se poser la question!: un signe est une
association entre un signifi&#233; et un signifiant, c&#8217;est-&#224;-dire entre deux niveaux de repr&#233;sentation diff&#233;rents, alors
qu&#8217;une relation lexicale est une relation entre deux objets de m&#234;mes niveaux, deux mots-formes ou un lex&#232;me
et un mot-forme. Voir n&#233;anmoins Meurers &amp; Minnen 1997 pour un traitement efficace des r&#232;gles lexicales en
HPSG.
</p>
<p>3 Dans cette &#233;tude, nous ne consid&#233;rons pas les quantifications et les ph&#233;nom&#232;nes de port&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les signes grammaticaux dans l'interface s&#233;mantique-syntaxe
</p>
<p>2 Le formalisme et les signes lexicaux
Nous allons pr&#233;senter le formalisme de l&#8217;interface s&#233;mantique-syntaxe de GUST en donnant
directement un exemple!: la structure (au format XML) associ&#233;e au lex&#232;me MANGER. Cette
r&#232;gle indique la correspondance entre le pr&#233;dicat &#8216;manger&#8217;(x,y) et le lex&#232;me MANGER. Les
arguments s&#233;mantiques x et y correspondent respectivement au sujet (subj) et &#224; l&#8217;objet direct
(dobj) de MANGER, lesquels doivent &#234;tre des noms. L&#8217;objet direct est optionnel, ce qu&#8217;indique
le trait-valeur opt=+ (et les parenth&#232;ses dans la repr&#233;sentation graphique). Dans l&#8217;&#233;criture de la
r&#232;gle, nous privil&#233;gions la structure syntaxique4 que nous encodons par les traits &lt;tree&gt; pour les
d&#233;pendances (ou les sous-arbres) et les traits &lt;node&gt; pour les n&#339;uds. La repr&#233;sentation
s&#233;mantique est encod&#233;e par les traits &lt;sem&gt; pour les n&#339;uds et &lt;arg&gt; pour les relations pr&#233;dicat-
argument. Les correspondances entre n&#339;uds syntaxiques et n&#339;uds s&#233;mantiques sont indiqu&#233;es
par l&#8217;ench&#226;ssement des &lt;sem&gt; dans les &lt;node&gt;. Les traits p_voice et p_mood sont des traits
polaires prenant des valeurs + ou &#8211;!: une valeur &#8211; indique un besoin, tandis qu&#8217;une valeur +
indique une ressource. La combinaison de p_t=&#8211; et p_t=+ entraine la suppression de p_t!: le
besoin a &#233;t&#233; satisfait. Les traits-valeurs p_voice=&#8211; et p_mood=&#8211; indiquent donc que le lex&#232;me
verbal MANGER doit se combiner avec une voix et un mode (le temps &#233;tant lui-m&#234;me requis par
le mode; cf. Section 3). Les traits id permettent d'indiquer le partage de valeur entre deux traits ;
par exemple, ici, le premier argument de &#8216;manger&#8217; correspond &#224; la s&#233;mantique du sujet de
MANGER.
</p>
<p>&lt;rule&gt;&lt;title&gt; MANGER &lt;/title&gt;
&lt;tree&gt;
</p>
<p>&lt;node lex=&quot;MANGER&quot; cat=&quot;V&quot; p_voice=- p_mood=-&gt;
&lt;sem cont=&quot;manger&quot;&gt;
</p>
<p>&lt;arg n=&quot;1&quot; id=&quot;[x]&quot;/&gt;
&lt;arg n=&quot;2&quot; id=&quot;[y]&quot;/&gt;
</p>
<p>&lt;/sem&gt;
&lt;/node&gt;
&lt;tree fct=&quot;subj&quot;&gt;
</p>
<p>&lt;node cat=&quot;N&quot;&gt;
&lt;sem id=&quot;[x]&quot;/&gt;
</p>
<p>&lt;/node&gt;
&lt;/tree&gt;
&lt;tree fct=&quot;dobj&quot; opt=+&gt;
</p>
<p>&lt;node cat=&quot;N&quot;&gt;
&lt;sem id=&quot;[y]&quot;&gt;
</p>
<p>&lt;/node&gt;
&lt;/tree&gt;
</p>
<p>&lt;/tree&gt;
&lt;/rule&gt;
</p>
<p>Le fait d&#8217;avoir privil&#233;gi&#233; la structure syntaxique nous donne une structure tr&#232;s similaire aux
structures d&#8217;HPSG!: le trait &lt;node&gt; correspond au trait HEAD et les traits &lt;tree&gt; de m&#234;me
niveau &#224; la sous-cat&#233;gorisation (SUBCAT). N&#233;anmoins notre structure joue &#233;galement le r&#244;le du
sch&#233;ma head-daughter-phrase permettant la combinaison d'une t&#234;te avec ses actants : on peut
alors interpr&#233;ter le trait &lt;node&gt; comme un trait HD-DTR (head-daughter) et le trait &lt;tree&gt;
comme un trait NHD-DTR (non-head-daughter).
</p>
<p>La structure que nous avons propos&#233;e pour MANGER peut &#233;galement &#234;tre repr&#233;sent&#233;e
graphiquement, soit en continuant &#224; privil&#233;gier la structure syntaxique comme dans la Fig. 1a,
soit en mettant en &#233;vidence la correspondance entre les repr&#233;sentations s&#233;mantique et syntaxique
comme dans la Fig. 1b. Nous repr&#233;sentons un besoin p_trait=&#8211; par &#198;trait.
                                                
</p>
<p>4 Nous ne supposons aucune primaut&#233; de la syntaxe. Notre objectif est seulement de faciliter la comparaison
avec des formalismes, qui comme HPSG, privil&#233;gie &#233;galement le niveau syntaxique dans l'&#233;criture.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane
</p>
<p>subj (dobj)
</p>
<p>MANGER
</p>
<p>&#164;1 2
&#8216;manger&#8217; 
</p>
<p>(N) (N)
</p>
<p>(V) &#198;v,&#198;m
</p>
<p>subj (dobj)
</p>
<p>MANGER
(V)&#198;v, &#198;m
s&#233;m: &#8216;manger&#8217;
arg1: x
arg2: y
</p>
<p>(N)
s&#233;m: x
</p>
<p>(N)
s&#233;m: y
</p>
<p>a b
Figure 1!: Repr&#233;sentations graphiques de la r&#232;gle pour MANGER
</p>
<p>Le traitement des verbes &#224; mont&#233;e (comme SEMBLER) ou &#224; contr&#244;le (comme VOULOIR) nous
oblige &#224; enrichir notre formalisme. Nous devons indiquer dans la structure de tels verbes que
leur sujet est aussi le sujet potentiel de leur compl&#233;ment verbal. Pour cela, nous introduisons
dans la structure de ces verbes une d&#233;pendance particuli&#232;re, not&#233;e &lt;quasi&gt; pour quasi-
d&#233;pendance et repr&#233;sent&#233;e par une fl&#232;che hachur&#233;e. Une quasi-d&#233;pendance s&#8217;unifie avec une
d&#233;pendance ordinaire (de m&#234;me fonction) pour donner une quasi-d&#233;pendance.
</p>
<p>Nous donnons ci-apr&#232;s la structure de SEMBLER. Ce verbe correspond &#224; un pr&#233;dicat
monoactanciel qui ne prend pas le sujet de SEMBLER comme argument. Le sujet de
SEMBLER est en fait enti&#232;rement contr&#244;l&#233; par son compl&#233;ment verbal, lequel se trouve &#224;
l&#8217;infinitif et perdra son sujet syntaxique par l&#8217;unification de sa d&#233;pendance sujet avec la quasi-
d&#233;pendance sujet de la structure de SEMBLER. Par contre, le compl&#233;ment verbal de SEMBLER
doit encore recevoir une voix et peut se combiner avec l'accompli (Le poulet semble avoir &#233;t&#233;
mang&#233; par les invit&#233;s). Dans la repr&#233;sentation graphique, nous abr&#233;geons en trait&#198;valeur la
s&#233;quence p_trait=+, trait=&quot;valeur&quot;.
</p>
<p>&lt;rule&gt;&lt;title&gt; SEMBLER &lt;/title&gt;
&lt;tree&gt;
</p>
<p>&lt;node lex=&quot;SEMBLER&quot; cat=&quot;V&quot; p_mood=-&gt;
&lt;sem cont=&quot;sembler&quot;&gt;
</p>
<p>&lt;arg n=&quot;1&quot; id=&quot;[y]&quot;/&gt;
&lt;/sem&gt;
</p>
<p>&lt;/node&gt;
&lt;tree fct=&quot;subj&quot;&gt;
</p>
<p>&lt;node id=&quot;[X]&quot;/&gt;
&lt;/tree&gt;
&lt;tree fct=&quot;pred&quot;&gt;
</p>
<p>&lt;node cat=&quot;V&quot; p_mood=+ mood=&quot;inf&quot;&gt;
&lt;sem id=&quot;[y]&quot;/&gt;
</p>
<p>&lt;/node&gt;
&lt;quasi fct=&quot;subj&quot;&gt;
</p>
<p>&lt;node id=&quot;[X]&quot;/&gt;
&lt;/quasi&gt;
</p>
<p>&lt;/tree&gt;
&lt;/tree&gt;
&lt;/rule&gt;
</p>
<p>subj pred
</p>
<p>SEMBLER
(V)&#198;m
s&#233;m: &#8216;sembler&#8217;
arg1: y
</p>
<p>(V)m&#198;inf
s&#233;m: ysubj
</p>
<p>Les adjectifs sont trait&#233;s comme &#233;tant par d&#233;faut des modifieurs de noms, le nom qu&#8217;ils
modifient &#233;tant leur premier argument s&#233;mantique. L&#8217;adjectif FACILE (dont nous omettons les
autres arguments) est ainsi associ&#233; &#224; la structure suivante!:</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003
</p>
<p>&lt;rule&gt;&lt;title&gt; FACILE &lt;/title&gt;
&lt;tree&gt;
</p>
<p>&lt;node cat=&quot;N&quot;&gt;
&lt;sem id=&quot;[x]&quot;/&gt;
</p>
<p>&lt;/node&gt;
&lt;tree fct=&quot;mod&quot;&gt;
</p>
<p>&lt;node cat+=&quot;A&quot; cat=&quot;A&quot;/&gt;
&lt;sem cont=&quot;facile&quot;&gt;
</p>
<p>&lt;arg n=&quot;1&quot; id=&quot;[x]&quot;/&gt;
&lt;/sem&gt;
</p>
<p>&lt;/node&gt;
&lt;/tree&gt;
</p>
<p>&lt;/tree&gt;
&lt;/rule&gt;
</p>
<p>FACILE
(&#8593;A,A)
s&#233;m: &#8216;facile&#8217;
arg1: x
</p>
<p>mod
</p>
<p>(N)
s&#233;m: x
</p>
<p>La structure pr&#233;c&#233;dente en s&#8217;unifiant avec un nom permet de d&#233;crire un syntagme comme une
question facile. La m&#234;me structure est utilis&#233;e dans les autres emplois de l&#8217;adjectif, comme dans
la phrase La question est facile. La copule &#202;TRE re&#231;oit la description suivante!:
</p>
<p>&lt;rule&gt;&lt;title&gt; &#202;TRE &lt;/title&gt;
&lt;tree&gt;&lt;node lex=&quot;&#202;TRE&quot; cat=&quot;V&quot; p_mood=-
&gt;
</p>
<p>&lt;sem id=&quot;[y]&quot;/&gt;&lt;/node&gt;
&lt;tree fct=&quot;subj&quot;&gt;
</p>
<p>&lt;node id=&quot;[X]&quot;/&gt;&lt;/tree&gt;
&lt;tree fct=&quot;pred&quot;&gt;
</p>
<p>&lt;node cat+=&quot;A&quot;&gt;
&lt;sem id=&quot;[y]&quot;&gt;&lt;/node&gt;
</p>
<p>&lt;quasi fct=&quot;subj&quot;&gt;
&lt;node id=&quot;[X]&quot;/&gt;&lt;/quasi&gt;
</p>
<p>&lt;/tree&gt;&lt;/tree&gt;&lt;/rule&gt;
</p>
<p>subj pred
subj
</p>
<p>&#202;TRE
(V)&#198;m
s&#233;m: y
</p>
<p>(&#8593;A)
s&#233;m: y
</p>
<p>Quelques remarques s&#8217;imposent. Premi&#232;rement, nous consid&#233;rons que la copule n&#8217;a pas de
contribution s&#233;mantique propre. Nous lui attribuons la s&#233;mantique de son compl&#233;ment adjectival
afin que cet &#233;l&#233;ment de sens se retrouve argument d&#8217;un pr&#233;dicat qui prendrait la copule comme
argument, comme &#8216;croire&#8217; dans Je crois que la question est facile. Deuxi&#232;mement, le
compl&#233;ment de la copule n&#8217;est pas n&#233;cessairement un adjectif!: il suffit que cet &#233;l&#233;ment soit
translat&#233; en adjectif5, ce que nous indiquons par le trait cat+=&quot;A&quot; (repr&#233;sent&#233; graphiquement par
(&#8593;A)). Troisi&#232;mement, nous consid&#233;rons que la d&#233;pendance mod se comporte comme une
d&#233;pendance subj invers&#233;e6 et peut &#224; ce titre s&#8217;unifier avec une quasi-d&#233;pendance subj!; c&#8217;est par
ce proc&#233;d&#233; que nous assurons que le sujet de la copule correspond au premier argument
s&#233;mantique de l&#8217;adjectif. Enfin cette inversion de d&#233;pendance inverse aussi les valeurs des traits
cat et cat+ (puisque cat contr&#244;le la cat&#233;gorie vis-&#224;-vis des d&#233;pendants et cat+ vis-&#224;-vis des
gouverneurs). Ainsi dans son emploi attributif, l&#8217;adjectif FACILE peut-il avoir comme argument
un verbe &#224; condition que ce verbe soit translat&#233; en nom (et ait cat+=&quot;N&quot;) comme dans Lire ce
livre est facile.
</p>
<p>Nous allons maintenant pr&#233;senter des signes grammaticaux et pr&#233;ciser de quelle fa&#231;on les
structures s'unifient.
</p>
<p>                                                
</p>
<p>5 La th&#233;orie de la translation a &#233;t&#233; propos&#233;e et d&#233;velopp&#233;e par Tesni&#232;re 1959. Un &#233;l&#233;ment est dit translat&#233; en
adjectif s&#8217;il peut occuper une position prototypiquement occup&#233;e par un adjectif. La translations est r&#233;alis&#233;e au
moyen de morph&#232;mes lexicaux ou grammaticaux. Ainsi, la pr&#233;position de joue-t-elle le r&#244;le de translatif du
nom Pierre  en adjectif dans le livre de Pierre.
</p>
<p>6 Les grammaires HPSG font la m&#234;me hypoth&#232;se en partageant les valeurs des traits MOD et SUBJ d&#8217;un
adjectif.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane
</p>
<p>3 Les signes grammaticaux pour le verbe
Comme nous l&#8217;avons vu un verbe doit se combiner avec un mode et &#233;ventuellement une voix.
Nous consid&#233;rons comme mode pour le fran&#231;ais l&#8217;indicatif, le subjonctif, l&#8217;imp&#233;ratif, l&#8217;infinitif,
le participe pass&#233; et le participe pr&#233;sent. Notre cat&#233;gorie de mode combine en fait deux cat&#233;gories
flexionnelles!: la finitude (fini, infinitif, participes) et le mode proprement dit lorsque le verbe est
fini. Les modes finis vont r&#233;clamer la combinaison avec un temps par l&#8217;interm&#233;diaire d&#8217;un trait
polaire p_tense. La r&#232;gle pour l&#8217;indicatif est alors la suivante!:
</p>
<p>&lt;rule&gt;&lt;title&gt; indicatif &lt;/title&gt;
&lt;tree&gt;
</p>
<p>&lt;node cat+=&quot;V&quot; cat=&quot;V&quot; mood=&quot;ind&quot; p_mood=+ p_tense=-&gt;
&lt;sem mood=&quot;ind&quot;&gt;
</p>
<p>&lt;/node&gt;
&lt;/tree&gt;
&lt;/rule&gt;
</p>
<p>Nous pouvons maintenant donner un exemple de combinaison de structures pour une phrase
compl&#232;te (Fig. 2). La structure r&#233;sultante est bien form&#233;e si tous les traits polaires ont &#233;t&#233;
consomm&#233;s et si chaque n&#339;ud syntaxique correspond &#224; une lexie.
</p>
<p>subj pred
</p>
<p>SEMBLER
(V)&#198;m
s&#233;m: &#8216;sembler&#8217;
arg1: y
</p>
<p>(V)m&#198;inf
s&#233;m: ysubj (N)
</p>
<p>s&#233;m: x
</p>
<p>subj
</p>
<p>DORMIR
(V)&#198;m
s&#233;m: &#8216;dormir&#8217;
arg1: x
</p>
<p>(V)m&#198;ind,&#198;t
(V)t&#198;pr&#233;s
t: &#8216;pr&#233;sent&#8217;
</p>
<p>PIERRE
s&#233;m: &#8216;Pierre&#8217;
(&#8593;N,N)
</p>
<p>&#8853;PIERRE       SEMBLER       indicatif      pr&#233;sent       DORMIR&#8853; &#8853; &#8853;
</p>
<p>subj pred
</p>
<p>SEMBLER
(V)ind,pr&#233;s
t: &#8216;pr&#233;sent&#8217;
s&#233;m: &#8216;sembler&#8217;
arg1: y
</p>
<p>DORMIR(V)inf
s&#233;m: y &#8216;dormir&#8217;
arg1: x
</p>
<p>subj
PIERRE
(&#8593;N,N)
s&#233;m: x &#8216;Pierre&#8217;
</p>
<p>=
</p>
<p>Figure 2 : Combinaison des signes pour Pierre semble dormir
</p>
<p>La m&#234;me grammaire pourrait &#234;tre formalis&#233;e en HPSG &#224; condition d'introduire un sch&#233;ma
sp&#233;cifique pour la combinaison d'un signe lexical et d'un signe grammatical (qui jouera le r&#244;le de
t&#234;te). Il en r&#233;sulterait que nous aurions autant de projections syntagmatiques pour une
construction verbale que de types de signes grammaticaux pouvant se combiner avec lui. La
structure syntagmatique r&#233;sultante serait plus proche des structures des grammaires g&#233;n&#233;ratives
ou de RRG (Van Valin &amp; La Polla 1997) que des structures usuelles d'HPSG (Pollard &amp; Sag
1994).
</p>
<p>Nous avons &#233;galement une r&#232;gle pour l&#8217;infinitif lorsque celui-ci n&#8217;est pas impos&#233; par le r&#233;gime
comme dans Voler est un d&#233;lit ou un livre &#224; lire. Ce morph&#232;me infinitif doit assurer que le verbe
n&#8217;a pas de sujet tout en attribuant une valeur s&#233;mantique &#224; l&#8217;argument du verbe potentiellement
r&#233;alis&#233; comme sujet!; nous noterons cette valeur GEN (comme g&#233;n&#233;rique). L&#8217;interpr&#233;tation
exacte de GEN est hors de notre propos!; l&#8217;important pour l&#8217;interface s&#233;mantique-syntaxe est
d&#8217;avoir identifi&#233; qu&#8217;il s&#8217;agissait ici d&#8217;un &#233;l&#233;ment de sens particulier. On notera d&#8217;autre part que
le verbe &#224; l&#8217;infinitif re&#231;oit une cat+ nominale. En effet, une telle forme verbale occupe
uniquement des positions o&#249; des noms sont attendus, par exemple comme sujet d&#8217;un verbe ou
apr&#232;s une pr&#233;position. Seules les formes verbales finies re&#231;oivent une cat+ verbale.
</p>
<p>&lt;rule&gt;&lt;title&gt; infinitif &lt;/title&gt;
&lt;tree&gt;
</p>
<p>&lt;node cat+=&quot;N&quot; cat=&quot;V&quot; mood=&quot;inf&quot; p_mood=+/&gt;
&lt;quasi fct=&quot;subj&quot;&gt;
</p>
<p>&lt;node lex=-&gt;&lt;sem cont=&quot;GEN&quot;/&gt;&lt;/node&gt;
&lt;/quasi&gt;
</p>
<p>&lt;/tree&gt;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Titre de l'article
</p>
<p>L&#8217;infinitif ne se combine pas avec un temps, mais il peut se combiner avec l&#8217;accompli exprim&#233;
par AVOIR (ou &#233;ventuellement &#202;TRE si le trait aux est instanci&#233;) + participe pass&#233; :
</p>
<p>&lt;rule&gt;&lt;title&gt; accompli &lt;/title&gt;
&lt;tree&gt;
</p>
<p>&lt;node lex=&quot;AVOIR//@aux&quot; cat=&quot;V&quot; p_mood=-&gt;
&lt;sem id=&quot;[y]&quot;/&gt;
</p>
<p>&lt;/node&gt;
&lt;tree fct=&quot;subj&quot;&gt;
</p>
<p>&lt;node id=&quot;[X]&quot; cat+=&quot;N&quot;/&gt;
&lt;/tree&gt;
&lt;tree fct=&quot;aux&quot;&gt;
</p>
<p>&lt;node cat=&quot;V&quot; mood=&quot;p-pass&#233;&quot; p_mood=+&gt;
&lt;sem id=&quot;[y]&quot; accompli=+/&gt;
</p>
<p>&lt;/node&gt;
&lt;/tree&gt;
&lt;quasi fct=&quot;subj&quot;&gt;&lt;node id=&quot;[X]&quot;/&gt;&lt;/quasi&gt;
</p>
<p>&lt;/tree&gt;
&lt;/rule&gt;
</p>
<p>subj aux
subj
</p>
<p>AVOIR//@aux
(V)&#198;m
s&#233;m: y
</p>
<p>(V)m&#198;p-pass&#233;
s&#233;m: y
accompli=+
</p>
<p>La structure de l&#8217;accompli assure, par l&#8217;interm&#233;diaire d&#8217;une quasi-d&#233;pendance, que le sujet
potentiel du verbe soit r&#233;alis&#233; sur l&#8217;auxiliaire. L&#8217;auxiliaire n&#8217;a pas de s&#233;mantique propre et on lui
attribue la m&#234;me s&#233;mantique que le participe!; la s&#233;mantique de l&#8217;accompli est encod&#233;e par le
trait-valeur accompli=+.7 Enfin, par le fait que l&#8217;auxiliaire requiert un mode, mais pas de voix, on
assure que l&#8217;accompli se trouvera entre le mode et la voix (la voix &#233;tant le morph&#232;me le plus
proche du verbe). L&#8217;accompli est compatible avec tous les modes!; il a tendance &#224; former avec les
temps simples de l&#8217;indicatif des formes fig&#233;es, comme le pass&#233; compos&#233; (morphologi-quement
&#233;quivalent &#224; un pr&#233;sent accompli).
</p>
<p>La structure de la voix active est triviale!: elle se contente de fournir un trait-valeur p_voice=+. Le
traitement de la voix passive est plus complexe. En fait nous consid&#233;rons que, dans la phrase Le
poulet est mang&#233; par Pierre, le verbe &#202;TRE est la copule comme dans La question est facile et
que le participe mang&#233; est le m&#234;me &#233;l&#233;ment que dans le poulet mang&#233; par Pierre ou Le poulet
semble mang&#233; par Pierre (cf. Abeill&#233; &amp; Godard!2002 pour une argumentation plus d&#233;taill&#233;e).
En cons&#233;quence de quoi nous introduirons une structure pour le participe pass&#233;, structure &#224;
partir de laquelle on construira le passif en &#202;TRE + participe pass&#233; par la combinaison de la
copule et du participe pass&#233; passif. Dans la structure du participe pass&#233; passif, l&#8217;objet direct
devient le gouverneur nominal et le sujet devient un compl&#233;ment oblique (obl) optionnel introduit
par la pr&#233;position PAR (&#224; moins que le trait pr&#233;p-passif sp&#233;cifie une autre valeur (&#224; savoir DE
comme dans Pierre est aim&#233; de Marie).
</p>
<p>                                                
</p>
<p>7 Une autre possibilit&#233; serait d&#8217;introduire un vrai n&#339;ud s&#233;mantique pour l&#8217;accompli que l&#8217;on pourrait mettre en
correspondance  avec le n&#339;ud syntaxique de l&#8217;auxiliaire. Il faut n&#233;anmoins s&#8217;assurer que le gouverneur
syntaxique de l&#8217;auxiliaire prenne bien comme argument s&#233;mantique la s&#233;mantique du verbe et pas l&#8217;accompli.
</p>
<p>(obl)
PAR//@pr&#233;p-passif
&#172;s&#233;mprep
</p>
<p>(&#8593;A,V)
m&#198;p-pass&#233;,v &#198;
v:&#8216;passif&#8217;
</p>
<p>subj
</p>
<p>(N)
</p>
<p>mod
</p>
<p>(N)
</p>
<p>dobj</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane
</p>
<p>Nous allons terminer notre pr&#233;sentation de signes grammaticaux pour le verbe par
l&#8217;impersonnel. Le sujet potentiel du verbe est r&#233;trograd&#233; dans une position particuli&#232;re que nous
appellerons quasi-sujet (qsubj) ; un sujet r&#233;alis&#233; par le pronom impersonnel IL (de contenu
s&#233;mantique vide) est introduit en remplacement. L'impersonnel se combine librement avec un
verbe, &#224; condition que celui-ci n&#8217;ait pas d&#8217;objet direct r&#233;alis&#233; et que son sujet potentiel soit
ind&#233;fini ou verbal (Il a &#233;t&#233; invit&#233; plus de cent personnes!; Il m&#8217;arrive de me tromper ; Il semble
que Pierre soit content). Nous bloquons la pr&#233;sence d'un objet direct en introduisant une
d&#233;pendance dobj optionnelle sans r&#233;alisation lexicale (lex=&#8211;) ; ceci suffit &#224; bloquer la pr&#233;sence
d'un objet direct &#224; condition d'avoir une r&#232;gle de bonne formation qui emp&#234;che la pr&#233;sence de
deux objets directs et oblige l'unification de toutes les d&#233;pendances dobj. Nous bloquons
&#233;galement l'application de la r&#232;gle quand le verbe a un lien aux ou pred, c'est-&#224;-dire quand le
verbe est un auxiliaire ou une copule ; ceci entra&#238;ne que l'impersonnel devra se combiner avec le
verbe avant un auxiliaire ou une copule. Malgr&#233; cela, cette r&#232;gle permet de construire des passifs
impersonnels (Il a &#233;t&#233; propos&#233; une nouvelle solution ; Il a &#233;t&#233; d&#233;cid&#233; de changer la direction) :
en effet, l'impersonnel se combinera avec le participe passif avant la combinaison avec la copule ;
dans ce cas, la quasi d&#233;pendance subj s'unifiera avec la d&#233;pendance mod entre le participe et son
gouverneur (cf. Section 2 la combinaison de la copule avec un adjectif). La r&#232;gle que nous
donnons ci-dessous concerne uniquement un sujet potentiel infinitif.
</p>
<p>&lt;rule&gt;&lt;title&gt; impersonnel &lt;/title&gt;
&lt;tree&gt;
</p>
<p>&lt;node cat=&quot;V&quot;/&gt;
&lt;quasi fct=&quot;subj&quot;&gt;
</p>
<p>&lt;node id=&quot;[X]&quot; cat=&quot;V&quot; mood=&quot;inf&quot;/&gt;
&lt;/quasi&gt;
&lt;tree fct=&quot;qsubj&quot;&gt;
</p>
<p>&lt;node lex=&quot;DE&quot; cat=&quot;P&quot;&gt;
&lt;sem cont=-/&gt;
</p>
<p>&lt;/node&gt;
&lt;tree fct=&quot;prep&quot;&gt;
</p>
<p>&lt;node id=&quot;[X]&quot;/&gt;
&lt;/tree&gt;
</p>
<p>&lt;/tree&gt;
&lt;tree fct=&quot;subj&quot;&gt;
</p>
<p>&lt;node&gt;&lt;sem cont=-/&gt;&lt;/node&gt;
&lt;/tree&gt;
&lt;tree fct=&quot;dobj|aux|pred&quot; opt=+&gt;
</p>
<p>&lt;node lex=-/&gt;
&lt;/tree&gt;
</p>
<p>&lt;/tree&gt;
</p>
<p>(obl)
PAR//@pr&#233;p-passif
&#172;s&#233;mprep
</p>
<p>(&#8593;A,V)
m&#198;p-pass&#233;,v &#198;
v:&#8216;passif&#8217;
</p>
<p>subj
</p>
<p>(N)
</p>
<p>mod
</p>
<p>(N)
</p>
<p>dobj
</p>
<p>4 Les signes grammaticaux pour les adjectifs
A la diff&#233;rence du verbe, l'adjectif ne se combine avec aucun signe flexionnel dans l'interface
s&#233;mantique-syntaxe (l'accord est r&#233;gl&#233; au niveau de l'interface syntaxe-morphotopologie).
N&#233;anmoins l'adjectif peut se combiner avec des signes grammaticaux comme l'impersonnel (Lire
ce livre est facile &#198; Il est facile de lire ce livre) ou la construction dite du tough-movement (un
livre facile &#224; lire). La copule &#202;TRE, qui assure la translation de l'adjectif en verbe, peut &#233;galement
&#234;tre mise au rang des signes grammaticaux (cf. Section 2).
</p>
<p>La r&#232;gle de l'impersonnel pour les adjectifs est en fait la m&#234;me que celle des verbes, &#224; la
diff&#233;rence que la quasi-d&#233;pendance subj se combine avec la d&#233;pendance mod et est remplac&#233;e
par une d&#233;pendance mod). La structure de l'impersonnel se combine avec l'adjectif avant de se
combiner avec la copule. L'impersonnel est d'ailleurs possible sans la copule : Impossible de
dormir ; Facile de lire ce livre.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Titre de l'article
</p>
<p>Nous allons terminer cet article par la description du tough-movement en fran&#231;ais, que nous
illustrerons par un livre facile &#224; lire (Fig. 3). Cette construction exprime le sens &#8216;un livre tel que
lire ce livre est facile&#8217; et pallie l&#8217;impossibilit&#233; de construire une relative (*un livre que lire _ est
facile). Les relations pr&#233;dicat-argument sont donc toujours les m&#234;mes : &#8216;livre&#8217; est le deuxi&#232;me
argument de &#8216;lire&#8217; qui est lui-m&#234;me l'unique argument de &#8216;facile&#8217;. La difficult&#233; de cette
construction vient de la non concordance entre les relations pr&#233;dicat-argument et les d&#233;pendances
syntaxiques, puisqu'il n'y a pas de d&#233;pendance entre LIRE et LIVRE et que la d&#233;pendance entre
LIVRE et FACILE ne correspond pas &#224; une relation pr&#233;dicat-argument. N&#233;anmoins dans la
description que nous proposons, les structures associ&#233;es &#224; FACILE, LIRE et LIVRE sont les
structures usuelles. L'ensemble des difficult&#233;s est assum&#233; par une structure associ&#233;e &#224; la
construction8, que nous appellerons Adj &#192; Vinf et qui s'apparente &#224; une voix adjectivale (dans la
mesure o&#249; comme une voix verbale, il assure une redistribution des actants). Nous nous
d&#233;marquons de certains auteurs (par exemple Kayne 1974-75) qui proposent de d&#233;river ce livre
est facile &#224; lire de l'impersonnel il est facile de lire ce livre par mont&#233;e de l'objet (avec une
alternance de la pr&#233;position difficile &#224; justifier).
</p>
<p>(N)
</p>
<p>mod
(A)
</p>
<p>inf
</p>
<p>prep
&#192;
(P)
&#172;s&#233;m
</p>
<p>(V)inf
v&#198;
</p>
<p>subj
subj
</p>
<p>&#8709;
s&#233;m: &#8216;GEN&#8217;
</p>
<p>(V)m&#198;inf
</p>
<p>subj dobj
</p>
<p>LIRE
(V)&#198;v, &#198;m
s&#233;m: &#8216;lire&#8217;
arg1: x
arg2: y
</p>
<p>(N)
s&#233;m: x
</p>
<p>mod
</p>
<p>(N)
s&#233;m: x
</p>
<p>(N)
s&#233;m: y
</p>
<p>dobj
</p>
<p>Adj &#192; VinfFACILE &#8853; infinitif&#8853; LIRE&#8853;LIVRE &#8853;
</p>
<p>LIVRE
(N)&#198;d,&#198;n
s&#233;m: &#8216;livre&#8217; =
</p>
<p>LIVRE
(N)&#198;d,&#198;n
s&#233;m: y &#8216;livre&#8217;
</p>
<p>mod
</p>
<p>inf
</p>
<p>prep
</p>
<p>&#192;
(P)
&#172;s&#233;m
</p>
<p>FACILE (A)
s&#233;m: &#8216;facile&#8217;
arg1: x
</p>
<p>LIRE (V)inf
s&#233;m: x &#8216;lire&#8217;
arg1: &#8216;GEN&#8217;
arg2: y
</p>
<p>FACILE
(&#8593;A,A)
s&#233;m: &#8216;facile&#8217;
arg1: x
</p>
<p>Figure 3 : La construction Adj &#192; Vinf (tough-movement)
</p>
<p>On notera que les r&#244;les syntaxiques sur les d&#233;pendances jouent un r&#244;le pr&#233;pond&#233;rant. Ainsi, la
relation dobj valide-t-elle la combinaison d'un verbe avec le passif ou la construction Adj &#192; Vinf.
Elle validera &#233;galement la combinaison avec le clitique accusatif ou l'accord du participe pass&#233;.
</p>
<p>5 Conclusion
Au del&#224; du traitement des morph&#232;mes grammaticaux comme des signes &#224; part enti&#232;re, le
formalisme que nous avons propos&#233; pour l'interface s&#233;mantique-syntaxe pr&#233;sentent plusieurs
avantages : 1) il est suffisamment puissant pour permettre d'avoir une seule et m&#234;me structure
pour les diff&#233;rents emplois d'un lex&#232;me (en comparaison un formalisme comme TAG oblige &#224;
introduire des structures diff&#233;rentes pour chaque emploi d'un lex&#232;me) ; 2) il &#233;vite le recours &#224; des
descriptions syntagmatiques et est ainsi plus l&#233;ger qu'un formalisme comme HPSG ; ceci rend
&#233;galement le formalisme pratiquement associatif, dans le sens o&#249; l'ordre dans lequel sont
combin&#233;s les signes est &#224; peu pr&#232;s libre (&#224; l'exception des signes grammaticaux) et n'est pas
contraint par la n&#233;cessit&#233; de saturer les syntagmes comme en HPSG.
</p>
<p>Une des qualit&#233;s du formalisme vient du recours aux quasi-d&#233;pendances qui font que la structure
de d&#233;rivation (la structure qui encode quel signe se combine avec quel signe ; cf. Vijay-Shanker
1987 pour TAG et Kahane 2002 pour GUST) n'est pas n&#233;cessairement un arbre. Par exemple,
                                                
</p>
<p>8 Le fait que certaines informations correspondent &#224; des constructions, plut&#244;t qu&#8217;&#224; des lexies en particulier est un
argument utilis&#233; par certaines approches comme HPSG pour maintenir des r&#232;gles syntagmatiques (Ginzburg
&amp; Sag 2000). On voit sur cet exemple qu&#8217;on peut consid&#233;rer des signes associ&#233;s &#224; des constructions sans pour
autant consid&#233;rer des syntagmes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane
</p>
<p>dans le cas du tough-movement, le signe Adj &#192; Vinf, se combine avec trois autres signes (un
nom, un verbe et un adjectif) qui se combinent eux-m&#234;mes entre eux.
</p>
<p>R&#233;f&#233;rences
Abeill&#233; Anne, Godard Dani&#232;le, 2002, &#8220;Course on the syntax of Romance languages&#8221;, Bucarest.
Bresnan Joan, 1982, &#8220;The passive in lexical theory&#8221;, in J. Bresnan (&#233;d.), The Mental
</p>
<p>Representation of Grammatical Relations, MIT Press.
Bresnan Joan, 1998, Lexical-Functional Syntax, Blackwell, Oxford.
Chomsky Noam, 1957, Syntactic Structures, MIT Press, Cambridge.
Gerdes Kim, Kahane Sylvain, 2001, &#8220;Word Order in German: A Formal Dependency Grammar
</p>
<p>Using a Topological Hierarchy&#8221;, ACL 2001, Toulouse, 8 p.
Ginzburg Jonathan, Sag Ivan, 2001, Interrogative Investigations: The Form, Meaning, Use of
</p>
<p>English Interrogatives, CSLI Publications/University of Chicago Press.
Jackendoff Ray S., 1977, X&#8217; Syntax: A Study of Phrase Structure, Linguistic Inquiry
</p>
<p>Monograph, MIT Press.
Kahane Sylvain, 2001, &#8220;Grammaires de d&#233;pendance formelles et th&#233;orie Sens-Texte&#8221;, Tutoriel,
</p>
<p>Actes TALN 2001, vol. 2, 17-76.
Kahane Sylvain, 2002, Grammaire d'Unification Sens-Texte &#8211; Vers un mod&#232;le math&#233;matique
</p>
<p>articul&#233; de la langue, Hdr de l'Universit&#233; Paris 7, 82 p.
Kayne Richard, 1974-75, &#8220;French relative que&#8221;, Recherches Linguistiques II, 40-61, et III, 27-
</p>
<p>92.
Mel'cuk Igor, 1988, Dependency Syntax: Theory and Practice, State Univ. of New York Press,
</p>
<p>Albany.
Mel'cuk Igor, 1997, Vers une Linguistique Sens-Texte, Le&#231;on inaugurale au Coll&#232;ge de France,
</p>
<p>Coll&#232;ge de France, Paris, 78p.
Meurers Detmar, Minnen Guido, 1997, &#8220;A computational treatment of lexical rules in HPSG as
</p>
<p>covariation in lexical entries&#8221;, Computational Linguistics, 23:4, 543-68.
Pollard Carl, Sag Ivan, 1994, Head-Driven Phrase Structure Grammar, Stanford CSLI.
Rambow Owen, Joshi Aravind, 1992, &#8220;A formal look at dependency grammars and phrase-
</p>
<p>structure grammars, with special consideration of word-order phenomena&#8221;, in L. Wanner
(&#233;d.), Current Issue in Meaning-Text Theory, Pinter, London.
</p>
<p>Sag Ivan, Wasow Thomas, 1999, Syntactic Theory: A Formal Introduction, CSLI Publications,
Stanford.
</p>
<p>Tesni&#232;re Lucien, 1959, El&#233;ments de syntaxe structurale, Klincksieck, Paris.
Van Valin Robert Jr, LaPolla Randy, 1997, Syntax: structure, meaning and function, Cambridge
</p>
<p>University Press.
Vijay-Shanker K., 1987, A Study of Tree Adjoining Grammars, PhD thesis, University of
</p>
<p>Pennsylvania.
Wasow Thomas, 1977, &#8220;Transformations and the lexicon&#8221;, in P. Culicover, T. Wasow, A.
</p>
<p>Akmajian (&#233;ds), Formal Syntax, Academic Press, 327-60.</p>

</div></div>
</body></html>