<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une caract&#233;risation de la pertinence pour les actions de r&#233;f&#233;rence</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Une caract&#233;risation de la pertinence
pour les actions de r&#233;f&#233;rence
</p>
<p>Fr&#233;d&#233;ric Landragin
LORIA &#8212; UMR 7503
</p>
<p>Campus scientifique &#8212; BP 239
54506 Vand&#339;uvre-l&#232;s-Nancy CEDEX
Frederic.Landragin@loria.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Pertinence, r&#233;f&#233;rence aux objets, dialogue multimodal, effets contextuels, effort de traitement
Relevance, reference to objects, multimodal dialogue, contextual effects, processing effort
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Que ce soit pour la compr&#233;hension ou pour la g&#233;n&#233;ration d&#8217;expressions r&#233;f&#233;rentielles, la Th&#233;orie
de la Pertinence propose un crit&#232;re cognitif permettant de comparer les pertinences de plusieurs
expressions dans un contexte linguistique. Nous voulons ici aller plus loin dans cette voie
en proposant une caract&#233;risation pr&#233;cise de ce crit&#232;re, ainsi que des pistes pour sa quantifica-
tion. Nous &#233;tendons l&#8217;analyse &#224; la communication multimodale, et nous montrons comment
la perception visuelle, le langage et le geste ostensif interagissent dans la production d&#8217;effets
contextuels. Nous nous attachons &#224; d&#233;crire l&#8217;effort de traitement d&#8217;une expression multimodale
&#224; l&#8217;aide de traits. Nous montrons alors comment des comparaisons entre ces traits permet-
tent d&#8217;exploiter efficacement le crit&#232;re de pertinence en communication homme-machine. Nous
soulevons quelques points faibles de notre proposition et nous en tirons des perspectives pour
une formalisation de la pertinence.
</p>
<p>For automatic comprehension or generation of referring expressions, Relevance Theory pro-
poses a cognitive criterion that allows to compare the relevance of several expressions in a
linguistic context. We want here to pursue this work. We propose a more precise characteriza-
tion of this criterion and foundations for its computation. We extend the analysis to multimodal
communication, and we show how visual perception, speech and gesture present multiple in-
teractions between each other in the production of contextual effects. We describe with some
features the processing effort of a multimodal expression. Then we show how comparisons be-
tween these features lead to an efficient exploitation of the relevance criterion in man-machine
dialogue. We raise some weak points of our proposal and we deduce future plans for a formal-
ization of relevance.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>1 Introduction
</p>
<p>Formaliser la Th&#233;orie de la Pertinence (Sperber, Wilson, 1995) &#224; travers la caract&#233;risation et
la quantification de la pertinence d&#8217;un &#233;nonc&#233; est un but ambitieux. Si disposer d&#8217;un crit&#232;re
num&#233;rique de pertinence s&#8217;av&#233;rerait utile pour une grande partie des applications du traitement
automatique des langues naturelles, l&#8217;analyse d&#8217;un tel crit&#232;re pose de nombreux probl&#232;mes,
li&#233;s &#224; la nature et &#224; la multiplicit&#233; des param&#232;tres entrant en compte. Ainsi, s&#8217;il existe de tr&#232;s
nombreux travaux sur la Th&#233;orie de la Pertinence, en particulier sur son adaptation &#224; tel ou tel
aspect du langage (composants grammaticaux, actes de langages, m&#233;taphore, ironie) ou &#224; telle
ou telle application (acquisition du langage, dialogue coop&#233;ratif, analyse litt&#233;raire, traduction),
il n&#8217;existe quasiment aucune proposition de formalisation (voir en particulier le site Relevance
Theory Online Bibliographic Service, http://www.ua.es/dfing/rt.htm). Sperber et
Wilson eux-m&#234;mes ne donnent pas de pistes pour un tel travail. Certains auteurs proposent des
points de d&#233;part, comme (Gazdar, Good, 1982). D&#8217;autres tentent des rapprochements entre la
Th&#233;orie de la Pertinence et une th&#233;orie plus formelle. (Akman, Surav, 1995) se focalisent par
exemple sur la formalisation du contexte en s&#8217;aidant de leur th&#233;orie (Computational Situation
Theory). Ils projettent les notions d&#8217;effets contextuels et d&#8217;effort de traitement &#224; la base du
crit&#232;re de pertinence sur leur vision particuli&#232;re du contexte. R&#233;cemment, (van Rooy, 2003)
montre comment la th&#233;orie Bidirectional Optimality Theory de (Blutner, 2000) peut &#234;tre vue
comme une formalisation de la Th&#233;orie de la Pertinence. Il fait un rapprochement entre deux
principes de la premi&#232;re et les notions d&#8217;effets et d&#8217;effort de la seconde, et aboutit &#224; une quantifi-
cation des effets, en particulier pour la pertinence d&#8217;une r&#233;ponse partielle &#224; une question. Pour
notre part, nous nous focalisons sur les actions de r&#233;f&#233;rence, et plus g&#233;n&#233;ralement sur la nature
du contexte dans la communication multimodale associant le langage et le geste ostensif. A
partir de travaux ant&#233;rieurs (Landragin et al., 2002) montrant l&#8217;importance de sous-ensembles
contextuels (appel&#233;s domaines de r&#233;f&#233;rence), nous proposons ici une caract&#233;risation des effets et
de l&#8217;effort dans un cadre computationnel, aussi bien pour la compr&#233;hension que pour la g&#233;n&#233;ra-
tion automatique d&#8217;expressions r&#233;f&#233;rentielles langagi&#232;res ou multimodales. Un int&#233;r&#234;t de notre
caract&#233;risation est de regrouper des consid&#233;rations syntaxiques, s&#233;mantiques et pragmatiques
sur le langage et sur le geste, ainsi qu&#8217;une prise en compte des particularit&#233;s du contexte visuel.
Nous montrons comment ces param&#232;tres de nature h&#233;t&#233;rog&#232;ne interviennent conjointement dans
les effets et l&#8217;effort, et comment on peut aboutir &#224; une calculabilit&#233; de ceux-ci.
</p>
<p>2 Pertinence et r&#233;f&#233;rence dans le dialogue multimodal
</p>
<p>2.1 Le contexte, les effets contextuels et l&#8217;effort de traitement
</p>
<p>La Th&#233;orie de la Pertinence (Sperber, Wilson, 1995) s&#8217;int&#233;resse particuli&#232;rement &#224; la construc-
tion du contexte lors de la communication. Sperber et Wilson d&#233;finissent le contexte comme
un ensemble de propositions (ou hypoth&#232;ses), ces propositions pouvant &#234;tre vraies, probable-
ment vraies, plut&#244;t vraies, plut&#244;t fausses, probablement fausses, ou fausses. Ces degr&#233;s, appel&#233;s
forces des propositions, varient au cours de la communication, au fur et &#224; mesure que les &#233;non-
c&#233;s apportent de nouvelles informations. Ainsi, la confrontation de la proposition port&#233;e par le
nouvel &#233;nonc&#233; avec les propositions contenues dans le contexte peut donner lieu &#224; une contextu-
alisation, c&#8217;est-&#224;-dire une d&#233;duction utilisant ces deux sources d&#8217;information comme pr&#233;misses.
Dans ce cas, on dira que l&#8217;interpr&#233;tation de l&#8217;&#233;nonc&#233; a donn&#233; lieu &#224; des effets contextuels, qui</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une caract&#233;risation de la pertinence pour les actions de r&#233;f&#233;rence
</p>
<p>peuvent &#234;tre l&#8217;effacement de certaines hypoth&#232;ses du contexte, la modification de la force de
certaines hypoth&#232;ses, ou la d&#233;rivation d&#8217;implications contextuelles (conclusions nouvelles qui
ne seraient pas d&#233;rivables de la proposition de l&#8217;&#233;nonc&#233; seule ou des propositions du contexte
seules). Dans le cas contraire, c&#8217;est-&#224;-dire si la contextualisation ne fait qu&#8217;ajouter au contexte
l&#8217;information nouvelle, on dira que l&#8217;interpr&#233;tation de l&#8217;&#233;nonc&#233; n&#8217;a donn&#233; lieu &#224; aucun effet con-
textuel. Cette notion d&#8217;effet contextuel met en avant l&#8217;aspect inf&#233;rentiel de la communication,
qui n&#8217;est plus vue comme un simple processus de codage et de d&#233;codage.
</p>
<p>Les effets contextuels sont le produit de processus mentaux qui demandent un certain effort.
L&#8217;interpr&#233;tation n&#233;cessite ainsi un effort de traitement qui correspond &#224; la d&#233;pense d&#8217;&#233;nergie
des processus mentaux activ&#233;s. Cet effort de traitement d&#233;pend de la longueur de l&#8217;&#233;nonc&#233;, de
la facilit&#233; d&#8217;acc&#232;s aux informations encyclop&#233;diques, ou encore du nombre de r&#232;gles logiques
impliqu&#233;es dans le m&#233;canisme d&#233;ductif. Avec ces deux notions d&#8217;effets et d&#8217;effort, (Sperber,
Wilson, 1995) d&#233;finissent la pertinence de mani&#232;re comparative. Ainsi, un acte de commu-
nication est d&#8217;autant plus pertinent dans un contexte donn&#233; que ses effets contextuels y sont
plus importants. D&#8217;autre part, un acte de communication est d&#8217;autant plus pertinent dans un
contexte donn&#233; que l&#8217;effort n&#233;cessaire pour l&#8217;y traiter est moindre. La pertinence peut donc
&#234;tre vue comme le rapport des effets contextuels sur l&#8217;effort de traitement. Avec nos pr&#233;occu-
pations computationnelles, c&#8217;est de cette mani&#232;re que nous l&#8217;aborderons et que nous tenterons
de l&#8217;&#233;valuer. Chaque effet contextuel n&#233;cessitant un suppl&#233;ment d&#8217;effort, Sperber et Wilson
d&#233;finissent &#233;galement l&#8217;effort impliqu&#233; par un effet. Ce suppl&#233;ment d&#8217;effort n&#8217;est pas co&#251;teux
au point d&#8217;annuler la contribution de l&#8217;effet &#224; la pertinence. Puisqu&#8217;il est toujours proportionn&#233;
aux effets qui le rendent n&#233;cessaire, nous pouvons l&#8217;ignorer dans l&#8217;&#233;valuation de la pertinence.
</p>
<p>2.2 Vers une &#233;valuation de la pertinence
</p>
<p>La Th&#233;orie de la Pertinence ne s&#8217;attache pas vraiment &#224; &#233;valuer les effets et l&#8217;effort, mais plut&#244;t
&#224; d&#233;crire comment l&#8217;esprit &#233;value lui-m&#234;me ses propres r&#233;sultats et ses propres efforts, et com-
ment il d&#233;cide en cons&#233;quence de poursuivre ses efforts dans la m&#234;me direction, ou au contraire
de les diriger ailleurs (Sperber, Wilson, 1995). Il s&#8217;av&#232;rerait pourtant int&#233;ressant de pouvoir
quantifier la pertinence d&#8217;un &#233;nonc&#233;. On pourrait comparer les pertinences de plusieurs propo-
sitions, ou encore d&#233;terminer la forme la plus pertinente d&#8217;une intention communicative donn&#233;e.
</p>
<p>Le probl&#232;me est large. On ne sait pas quelles sont les op&#233;rations &#233;l&#233;mentaires constitutives des
processus intellectuels complexes, et on ne sait donc pas comment &#233;valuer l&#8217;effort de traite-
ment d&#8217;un &#233;nonc&#233;. On sait que certains param&#232;tres comme la dur&#233;e d&#8217;un processus mental
ne sont pas de bons indices : du fait de l&#8217;impossibilit&#233; de d&#233;tecter une r&#233;flexion intense d&#8217;une
r&#233;flexion d&#233;tendue beaucoup plus lente, la dur&#233;e d&#8217;interpr&#233;tation n&#8217;apporte rien. (Gazdar, Good,
1982) proposent d&#8217;&#233;valuer les effets contextuels en comptant le nombre des implications con-
textuelles, et l&#8217;effort de traitement en comptant le nombre des op&#233;rations de d&#233;duction. Mais
(Sperber, Wilson, 1995) montrent que compter chaque op&#233;ration revient &#224; ajouter une op&#233;ration
de comptage dans l&#8217;effort, et que si l&#8217;&#233;valuation r&#233;sultait d&#8217;un comptage, les sujets devraient
&#234;tre capables de porter des jugements absolus sur la quantit&#233; d&#8217;effet obtenu ou d&#8217;effort d&#233;pens&#233;.
Ce n&#8217;est pas le cas. Comme l&#8217;argumentent Sperber et Wilson, la pertinence s&#8217;av&#232;re pour le
moins difficilement calculable. Quand elle est repr&#233;sent&#233;e mentalement, elle l&#8217;est sous la forme
de jugements comparatifs ou &#233;ventuellement de jugements absolus vagues et g&#233;n&#233;raux, et non
sous la forme de jugements absolus fins et pr&#233;cis tels que le sont les jugements quantitatifs. Un
autre argument &#339;uvrant contre la calculabilit&#233; de la pertinence est son aspect subjectif : effets</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>et effort d&#233;pendent de l&#8217;individu, de ses dispositions et de ses exp&#233;riences.
</p>
<p>Certains indices semblent cependant intervenir tr&#232;s fortement et permettent d&#8217;envisager des
pistes fiables pour une &#233;valuation de la pertinence. Par exemple, plus une hypoth&#232;se est forte
et plus ses effets contextuels risquent d&#8217;&#234;tre importants. En ce qui concerne l&#8217;effort, plus le
contexte comprend d&#8217;informations et plus l&#8217;effort de traitement est important. Ce sont ces types
d&#8217;indices que nous voulons identifier.
</p>
<p>2.3 La pertinence pour la r&#233;f&#233;rence dans la communication multimodale
</p>
<p>Les travaux que nous menons dans le domaine de l&#8217;interpr&#233;tation de la r&#233;f&#233;rence aux objets
dans le dialogue homme-machine (Landragin et al., 2002) montrent que tout acte de r&#233;f&#233;rence
passe par l&#8217;activation d&#8217;un domaine de r&#233;f&#233;rence. Cette notion mod&#233;lise la focalisation dans un
espace attentionnel. Elle permet de justifier l&#8217;utilisation de descriptions discriminantes dans des
ensembles d&#8217;objets plus r&#233;duits que le contexte complet. Un domaine de r&#233;f&#233;rence est un sous-
ensemble contextuel, de nature linguistique, visuelle, gestuelle ou encore li&#233;e au d&#233;roulement
de l&#8217;interaction ou &#224; la t&#226;che applicative. De mani&#232;re simplifi&#233;e, il s&#8217;agit d&#8217;un groupe d&#8217;objets
dans lequel les composants de l&#8217;expression r&#233;f&#233;rentielle permettent d&#8217;une part d&#8217;extraire un
r&#233;f&#233;rent, d&#8217;autre part de pr&#233;parer un support pour l&#8217;interpr&#233;tation d&#8217;une future r&#233;f&#233;rence. Ainsi,
&#171; le triangle rouge &#187; contient deux propri&#233;t&#233;s dont la combinaison doit &#234;tre discriminante dans
un domaine de r&#233;f&#233;rence qui doit, pour justifier cette expression et dans la mesure du possible,
comprendre un ou plusieurs triangles non rouges. Apr&#232;s l&#8217;interpr&#233;tation de cette expression,
le domaine de r&#233;f&#233;rence est structur&#233; avec une premi&#232;re distinction entre les triangles et les
autres formes, et une deuxi&#232;me distinction entre le triangle rouge et les autres triangles. Une
expression ult&#233;rieure telle que &#171; les autres triangles &#187; sera interpr&#233;t&#233;e dans le m&#234;me domaine,
d&#233;notant ainsi une continuit&#233; dans la cha&#238;ne de r&#233;f&#233;rence et, d&#8217;une mani&#232;re g&#233;n&#233;rale, dans le
dialogue. Cette notion de domaine consiste &#224; regrouper dans un cadre unifi&#233; les contraintes
provenant de toutes les facettes du contexte. Elle nous am&#232;ne &#224; nous int&#233;resser au point de vue
de la Th&#233;orie de la Pertinence. Il nous semble en effet que l&#8217;interpr&#233;tation d&#8217;une expression
r&#233;f&#233;rentielle peut exploiter un crit&#232;re de pertinence pour identifier un domaine de r&#233;f&#233;rence
pertinent et un r&#233;f&#233;rent dans ce domaine. Il nous semble de plus que l&#8217;exploitation du m&#234;me
crit&#232;re de pertinence en g&#233;n&#233;ration automatique d&#8217;expressions r&#233;f&#233;rentielles permettrait de tenir
compte efficacement de la notion de domaine lors de la production des r&#233;ponses du syst&#232;me.
</p>
<p>L&#8217;application de la Th&#233;orie de la Pertinence &#224; la r&#233;f&#233;rence dans le dialogue multimodal pose le
probl&#232;me de la nature des informations contextuelles. Le contexte dans la Th&#233;orie de la Perti-
nence se limite &#224; des propositions traduisant des croyances ou des affirmations qui s&#8217;expriment
par le langage. Le contexte tel que nous le concevons s&#8217;av&#232;re beaucoup plus large et h&#233;t&#233;rog&#232;ne.
Il comprend des informations extra-linguistiques pour lesquelles la Th&#233;orie de la Pertinence ne
dit pas grand chose. Si celle-ci a &#233;t&#233; &#233;labor&#233;e pour un cadre linguistique, les principes qu&#8217;elle
propose s&#8217;av&#232;rent cependant tout &#224; fait valables pour la communication multimodale en g&#233;n&#233;ral.
Ainsi, de m&#234;me qu&#8217;un &#233;nonc&#233; oral porte en lui-m&#234;me une pr&#233;somption de pertinence quant &#224;
son contenu, nous pouvons consid&#233;rer qu&#8217;une trajectoire gestuelle porte en elle-m&#234;me une pr&#233;-
somption de pertinence quant aux objets qu&#8217;elle cible (les demonstrata), et qu&#8217;une expression
r&#233;f&#233;rentielle multimodale porte en elle-m&#234;me une pr&#233;somption de pertinence quant &#224; la fa&#231;on
dont elle d&#233;signe un r&#233;f&#233;rent, cette fa&#231;on int&#233;grant le recours &#224; un domaine de r&#233;f&#233;rence. Les
effets contextuels et l&#8217;effort de traitement se con&#231;oivent aussi bien pour une action de r&#233;f&#233;rence
multimodale que pour un &#233;nonc&#233; oral, et nous allons le d&#233;tailler maintenant.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une caract&#233;risation de la pertinence pour les actions de r&#233;f&#233;rence
</p>
<p>3 Une caract&#233;risation de la pertinence
</p>
<p>Nous nous pla&#231;ons dans le cadre du dialogue homme-machine &#224; support visuel (qui incite
l&#8217;utilisateur &#224; s&#8217;exprimer par la voix et le geste). Nous nous int&#233;ressons tout d&#8217;abord aux effets
contextuels d&#8217;un acte de r&#233;f&#233;rence. En consid&#233;rant que le contexte contient des propositions
telles que &#171; deux triangles rouges T &#0; et T &#1; sont visibles dans la sc&#232;ne &#187;, &#171; T &#0; a une grande
taille par rapport &#224; T &#1; &#187;, &#171; l&#8217;objet le plus saillant visuellement est O &#2; &#187;, &#171; la derni&#232;re action de
r&#233;f&#233;rence s&#8217;est effectu&#233;e dans le domaine de r&#233;f&#233;rence DR &#3; &#187;, &#171; DR &#3; contient T &#0; et T &#1; &#187; ou en-
core &#171; aucun objet n&#8217;est visuellement focalis&#233; &#187;, nous pouvons avancer l&#8217;id&#233;e que l&#8217;expression
r&#233;f&#233;rentielle &#171; le grand triangle rouge &#187; produit les effets suivants :
</p>
<p>1. il y a r&#233;f&#233;rence ;
2. cette r&#233;f&#233;rence porte sur l&#8217;objet T &#0; dans le domaine de r&#233;f&#233;rence DR &#3; ;
3. l&#8217;objet T &#0; est d&#233;sormais focalis&#233; visuellement et linguistiquement.
Ce dernier effet suffit &#224; montrer qu&#8217;en plus des informations nouvelles li&#233;es &#224; la r&#233;f&#233;rence, le
contexte est modifi&#233;. En effet, &#224; partir de la proposition &#171; aucun objet n&#8217;est visuellement foca-
lis&#233; &#187; et de la r&#233;solution de l&#8217;expression r&#233;f&#233;rentielle, nous d&#233;rivons une seule implication con-
textuelle : &#171; un seul objet est visuellement focalis&#233;, et cet objet est T &#0; &#187;. En consid&#233;rant comme
(Gazdar, Good, 1982) que les effets contextuels s&#8217;&#233;valuent avec le nombre d&#8217;implications con-
textuelles, nous obtenons pour notre exemple un score de 1. Un changement de domaine aurait
constitu&#233; une implication contextuelle suppl&#233;mentaire (&#171; la derni&#232;re action de r&#233;f&#233;rence s&#8217;est ef-
fectu&#233;e dans le domaine DR &#4; &#187;) et donc un score de 2. Nous choisissons pour l&#8217;instant de garder
cette approche consistant &#224; compter les implications contextuelles : m&#234;me si les arguments co-
gnitifs de (Sperber, Wilson, 1995) s&#8217;y opposent, ce crit&#232;re semble plausible d&#8217;un point de vue
logique et facilement calculable par un syst&#232;me. Notre but n&#8217;est pas d&#8217;&#233;laborer un syst&#232;me en
copiant le fonctionnement cognitif humain, mais d&#8217;identifier des crit&#232;res calculables rendant
compte de ce fonctionnement. Le crit&#232;re de (Gazdar, Good, 1982) pour l&#8217;&#233;valuation des effets
nous semble donc tout &#224; fait acceptable et adaptable &#224; notre conception du contexte. Il s&#8217;agit
n&#233;anmoins d&#8217;une premi&#232;re approche qui reste &#224; approfondir. En particulier, il s&#8217;av&#232;re n&#233;cessaire
de sp&#233;cifier pr&#233;cis&#233;ment les diff&#233;rents types de propositions contenues dans le contexte.
</p>
<p>En ce qui concerne l&#8217;effort de traitement d&#8217;une r&#233;f&#233;rence, nous consid&#233;rons, &#224; la suite de la d&#233;fi-
nition de Sperber et Wilson, qu&#8217;il est proportionnel &#224; la complexit&#233; des diff&#233;rentes informations
intervenant lors du traitement, &#224; leur accessibilit&#233;, et &#224; l&#8217;importance des interactions entre ces
informations. Devant le nombre important de param&#232;tres, nous choisissons une m&#233;thode incr&#233;-
mentale pour leur prise en compte : lors d&#8217;une premi&#232;re &#233;tape, nous ne ferons intervenir que
les informations provenant de la perception visuelle, pour int&#233;grer lors d&#8217;une deuxi&#232;me &#233;tape
les informations apport&#233;es par l&#8217;expression r&#233;f&#233;rentielle verbale. Nous aurons alors une base
pour la mod&#233;lisation de l&#8217;interpr&#233;tation de la r&#233;f&#233;rence langagi&#232;re. Pour celle de la r&#233;f&#233;rence
multimodale, la troisi&#232;me &#233;tape int&#233;grera les informations apport&#233;es par les trois modalit&#233;s.
</p>
<p>3.1 En consid&#233;rant la perception visuelle
</p>
<p>La perception de la sc&#232;ne visuelle influe sur le comportement de l&#8217;utilisateur, en particulier
sur sa fa&#231;on de r&#233;f&#233;rer aux objets qui y sont visibles. S&#8217;il per&#231;oit des objets isol&#233;s il va par
exemple &#234;tre tent&#233; de r&#233;f&#233;rer individuellement &#224; ces objets, alors que s&#8217;il per&#231;oit des groupes
il va peut-&#234;tre d&#233;signer des ensembles de r&#233;f&#233;rents avant d&#8217;en extraire un &#233;l&#233;ment. Nous pro-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>posons dans (Landragin et al., 2002) un algorithme de classification automatique des objets
pour l&#8217;identification de groupes perceptifs en suivant les principes de la Gestalt (Guillaume,
1979). Ainsi, la proximit&#233;, la similarit&#233; et la continuit&#233; dans la disposition des objets permettent
de construire une structuration arborescente de la sc&#232;ne en groupes perceptifs. Cette structura-
tion constitue une information &#224; stocker dans le contexte, par l&#8217;interm&#233;diaire de propositions
telles que &#171; T &#0; et T &#1; forment un groupe perceptif G &#0; sur le crit&#232;re de proximit&#233; spatiale et de
similarit&#233; de forme &#187; et &#171; G &#0; et G &#1; sont les deux sous-groupes de G &#3; &#187;. Il s&#8217;agit d&#8217;une repr&#233;sen-
tation cognitive du contexte visuel, permettant la d&#233;rivation d&#8217;implications contextuelles et par
cons&#233;quent le calcul des effets contextuels tel que nous l&#8217;avons abord&#233;.
</p>
<p>Quant &#224; l&#8217;effort de traitement, il est li&#233; tout d&#8217;abord &#224; la complexit&#233; de cette structuration en
groupes. Dans les crit&#232;res permettant de l&#8217;&#233;valuer, nous retenons la profondeur de la structure
arborescente (c&#8217;est-&#224;-dire le nombre de partitions possibles de la sc&#232;ne en groupes perceptifs),
et le nombre de n&#339;uds pr&#233;sents dans celle-ci. Nous proposons &#233;galement de tenir compte du
nombre d&#8217;objets visibles, ainsi que d&#8217;un indice correspondant &#224; la diversit&#233; de ces objets (par
exemple le nombre de de formes, de couleurs et de tailles diff&#233;rentes).
</p>
<p>3.2 En consid&#233;rant la perception et l&#8217;expression verbale
</p>
<p>Il s&#8217;agit ici d&#8217;&#233;valuer la pertinence d&#8217;une expression r&#233;f&#233;rentielle langagi&#232;re. Nous avons d&#233;j&#224;
&#233;tudi&#233; les effets contextuels, et nous proposons de d&#233;composer l&#8217;effort de traitement selon les
traits suivants :
</p>
<p>1. ad&#233;quation de l&#8217;expression verbale avec l&#8217;intention de r&#233;f&#233;rence en contexte applicatif ;
2. ad&#233;quation de l&#8217;expression avec l&#8217;intention de r&#233;f&#233;rence en contexte dialogique ;
3. complexit&#233; de la perception visuelle ;
4. complexit&#233; de l&#8217;expression verbale ;
5. effort n&#233;cessaire pour isoler le(s) r&#233;f&#233;rent(s) &#224; l&#8217;aide de la perception, de l&#8217;expression verbale
et de l&#8217;historique de l&#8217;interaction.
</p>
<p>Le premier trait correspond &#224; l&#8217;effort n&#233;cessaire pour int&#233;grer l&#8217;expression r&#233;f&#233;rentielle verbale
dans le contexte de t&#226;che. Dans le corpus Magn&#233;t&#8217;Oz (Wolff, 1999) qui nous a servi pour
identifier les ph&#233;nom&#232;nes de r&#233;f&#233;rence induits par une t&#226;che tr&#232;s contrainte, l&#8217;interaction con-
siste &#224; ranger des objets selon leur forme. La seule action possible est le rangement, ce qui
incite l&#8217;utilisateur &#224; produire des commandes telles que &#171; mets la forme claire dans la deuxi&#232;me
bo&#238;te &#187;. Dans ce contexte, aucune action ne peut &#234;tre appliqu&#233;e &#224; un ensemble h&#233;t&#233;rog&#232;ne et
une expression d&#233;signant deux objets de forme diff&#233;rente s&#8217;av&#232;re incongrue. En raison de cette
incongruit&#233;, l&#8217;effort de traitement de cette expression est &#233;lev&#233;.
</p>
<p>Le deuxi&#232;me trait correspond &#224; l&#8217;effort n&#233;cessaire pour contextualiser l&#8217;expression verbale dans
le contexte dialogique. Par exemple, &#171; le rouge &#187; apr&#232;s &#171; le triangle vert &#187; demande un effort
particulier pour la r&#233;solution de l&#8217;ellipse. D&#8217;un autre c&#244;t&#233;, l&#8217;expression &#233;lid&#233;e comporte moins
de mots et l&#8217;effort li&#233; &#224; sa complexit&#233; en diminue d&#8217;autant (voir le quatri&#232;me trait).
Le troisi&#232;me trait correspond &#224; l&#8217;effort n&#233;cessaire pour prendre connaissance de la sc&#232;ne. C&#8217;est
ce trait que nous avons d&#233;taill&#233; lors de l&#8217;&#233;tape pr&#233;c&#233;dente.
</p>
<p>Le quatri&#232;me trait s&#8217;&#233;value &#224; l&#8217;aide de crit&#232;res syntaxiques tels que le nombre de mots et la
complexit&#233; de la structure syntaxique, par exemple la profondeur et le nombre de n&#339;uds de
l&#8217;arbre syntaxique. Les mots ayant plus ou moins d&#8217;importance, des pond&#233;rations peuvent &#234;tre</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une caract&#233;risation de la pertinence pour les actions de r&#233;f&#233;rence
</p>
<p>envisag&#233;es. Le cas particulier des connecteurs pragmatiques est int&#233;ressant : selon (Reboul,
Moeschler, 1998), les connecteurs (conjonctions de coordination, &#171; parce que &#187;) jouent un r&#244;le
au niveau de la facilitation du traitement de l&#8217;information. Leur fonction est de minimiser les
efforts cognitifs. Bien que Moeschler les analyse dans une proposition et non dans un simple
groupe nominal, nous pouvons tenir compte de cette facilitation, par exemple en ne comptant
pas le mot &#171; et &#187; dans une coordination, ou en le pond&#233;rant de mani&#232;re tr&#232;s faible.
</p>
<p>Le cinqui&#232;me trait s&#8217;&#233;value &#224; l&#8217;aide de crit&#232;res tels que la difficult&#233; &#224; rep&#233;rer dans la sc&#232;ne les
objets v&#233;rifiant les propri&#233;t&#233;s exprim&#233;es dans l&#8217;expression verbale. Par exemple, &#171; le triangle
rouge &#187; demandera moins d&#8217;effort que &#171; le petit triangle &#187; si le r&#233;f&#233;rent est le seul objet rouge
de la sc&#232;ne alors qu&#8217;il n&#8217;est pas le seul petit objet (les autres petits objets n&#8217;&#233;tant pas des tri-
angles). L&#8217;historique de l&#8217;interaction est pris en compte de la mani&#232;re suivante : d&#8217;une part en
ajoutant un effort li&#233; au rappel d&#8217;un contexte visuel ant&#233;rieur, par exemple pour l&#8217;interpr&#233;tation
de &#171; remets le triangle vert &#187; apr&#232;s &#171; efface les triangles &#187; ; d&#8217;autre part en ajoutant un effort li&#233;
au rappel d&#8217;informations s&#233;mantiques et pragmatiques utiles pour la r&#233;solution de la r&#233;f&#233;rence,
par exemple pour l&#8217;interpr&#233;tation de &#171; les autres &#187;.
</p>
<p>3.3 En consid&#233;rant la perception et l&#8217;expression multimodale
</p>
<p>Pour une expression multimodale, l&#8217;effort de traitement se d&#233;compose selon les traits suivants :
</p>
<p>1. ad&#233;quation de l&#8217;expression multimodale avec l&#8217;intention de r&#233;f&#233;rence en contexte applicatif ;
2. ad&#233;quation de l&#8217;expression avec l&#8217;intention de r&#233;f&#233;rence en contexte dialogique ;
3. complexit&#233; de la perception visuelle ;
4. complexit&#233; de la ou des expressions r&#233;f&#233;rentielles verbales ;
5. complexit&#233; du ou des gestes ;
6. effort n&#233;cessaire pour associer le ou les gestes &#224; la ou aux expressions verbales ;
7. effort n&#233;cessaire pour isoler le(s) r&#233;f&#233;rent(s) &#224; l&#8217;aide de la perception, de l&#8217;expression multi-
modale et de l&#8217;historique de l&#8217;interaction.
</p>
<p>Le premier trait correspond &#224; l&#8217;effort n&#233;cessaire pour int&#233;grer l&#8217;expression r&#233;f&#233;rentielle multi-
modale dans le contexte de t&#226;che. Il se d&#233;duit de l&#8217;effort correspondant dans l&#8217;&#233;tape pr&#233;c&#233;dente.
</p>
<p>Le deuxi&#232;me trait correspond &#224; l&#8217;effort n&#233;cessaire pour int&#233;grer l&#8217;expression multimodale dans
le contexte dialogique. Par exemple, &#171; celui-l&#224; &#187; apr&#232;s &#171; celui-ci &#187; demande un peu moins
d&#8217;effort que &#171; celui-ci &#187; dans la m&#234;me situation (avec un geste &#224; chaque fois).
Les troisi&#232;me et quatri&#232;me traits ne diff&#232;rent pas de ceux des &#233;tapes pr&#233;c&#233;dentes.
</p>
<p>Le cinqui&#232;me trait s&#8217;&#233;value &#224; l&#8217;aide de crit&#232;res tels que la longueur et la complexit&#233; de la trajec-
toire gestuelle. La longueur d&#233;pend du gabarit des objets, et la complexit&#233; du nombre de singu-
larit&#233;s, une singularit&#233; &#233;tant selon le mod&#232;le de (Bellalem, 1995) une rupture d&#8217;homog&#233;n&#233;it&#233;
pour une des propri&#233;t&#233;s de la trajectoire (les principales propri&#233;t&#233;s &#233;tant la courbure et la
vitesse), cette rupture d&#233;notant une intention s&#233;mantique.
Le sixi&#232;me trait s&#8217;&#233;value &#224; l&#8217;aide de crit&#232;res tels que la composition de l&#8217;expression multimodale
(nombre de gestes, nombre d&#8217;expressions verbales), la qualit&#233; de la synchronisation temporelle
entre geste(s) et expressions(s) verbale(s), la pr&#233;sence d&#8217;une ambigu&#239;t&#233; dans l&#8217;une des modalit&#233;
(ambigu&#239;t&#233; r&#233;solue par l&#8217;autre modalit&#233; au prix d&#8217;un certain effort), ainsi que le choix du d&#233;ter-
minant et d&#8217;&#233;ventuels marqueurs d&#233;ictiques et adjectifs num&#233;raux. Par exemple, un d&#233;monstratif
s&#8217;associe plus naturellement avec un geste qu&#8217;un d&#233;fini, et demande donc moins d&#8217;effort.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>Le dernier trait s&#8217;&#233;value &#224; l&#8217;aide de crit&#232;res tels que la difficult&#233; &#224; rep&#233;rer dans la sc&#232;ne les
objets d&#233;sign&#233;s par l&#8217;expression multimodale. Par exemple, l&#8217;expression multimodale com-
pos&#233;e d&#8217;un geste d&#233;signant un triangle et associ&#233; &#224; &#171; ce triangle &#187; demande moins d&#8217;effort que
l&#8217;expression multimodale compos&#233;e du m&#234;me geste associ&#233; &#224; &#171; cet objet &#187;, pour laquelle inter-
vient une r&#233;cup&#233;ration visuelle de la cat&#233;gorie. L&#8217;historique de l&#8217;interaction est pris en compte
en ajoutant un effort li&#233; au rappel d&#8217;un contexte visuel ant&#233;rieur ou au rappel d&#8217;informations
linguistiques utiles pour la r&#233;solution de la r&#233;f&#233;rence (comme nous l&#8217;avons vu lors de l&#8217;&#233;tape
pr&#233;c&#233;dente). L&#8217;historique des trajectoires gestuelles d&#233;j&#224; effectu&#233;es intervient &#233;galement pour
diminuer l&#8217;effort de traitement d&#8217;une trajectoire souvent utilis&#233;e.
</p>
<p>4 Exploitation en compr&#233;hension et en g&#233;n&#233;ration
</p>
<p>Notre but ici n&#8217;est pas de proposer une m&#233;thode de quantification absolue, mais de montrer com-
ment des jugements relatifs permettent de comparer la pertinence de plusieurs expressions, trait
par trait. Dans la figure 1-A, comparons par exemple les pertinences de quelques expressions
d&#233;signant le groupe isol&#233; de deux carr&#233;s &#224; gauche de la sc&#232;ne. &#171; Les deux carr&#233;s &#187; s&#8217;av&#232;re l&#233;g&#232;re-
ment plus pertinente que &#171; les carr&#233;s de gauche &#187;. En effet, les contextes applicatif, dialogique
et visuel &#233;tant invariants, reste &#224; comparer la complexit&#233; des expressions et l&#8217;effort n&#233;cessaire
pour isoler les r&#233;f&#233;rents. Or la sc&#232;ne visuelle est structur&#233;e en deux groupes dont un &#224; gauche
comprenant deux carr&#233;s. Les deux expressions demandent donc le m&#234;me effort pour isoler ce
groupe. &#171; Les carr&#233;s de gauche &#187; &#233;tant syntaxiquement l&#233;g&#232;rement plus complexe que &#171; les
deux carr&#233;s &#187;, celle-ci se voit attribuer l&#8217;effort minimum et par cons&#233;quent la meilleure perti-
nence. Cet exemple illustre l&#8217;importance de la structuration de la sc&#232;ne visuelle : a priori, &#171; les
deux carr&#233;s &#187; est ambigue puisque cinq carr&#233;s sont visibles. Or, comme n&#8217;importe quel locu-
teur peut le constater, cette expression est tout &#224; fait compr&#233;hensible et d&#233;signe sans ambigu&#239;t&#233;
le groupe comportant deux carr&#233;s, l&#8217;emploi de &#171; deux &#187; s&#8217;appuyant sur la coh&#233;sion du groupe.
L&#8217;exploitation de la pertinence permet au syst&#232;me de retrouver ce m&#233;canisme.
</p>
<p>A B
</p>
<p>Figure 1: Deux exemples de sc&#232;nes visuelles
</p>
<p>Si nous consid&#233;rons maintenant l&#8217;expression &#171; les deux carr&#233;s &#224; gauche &#187;, nous remarquons im-
m&#233;diatement la plus grande complexit&#233; syntaxique et donc la plus faible pertinence. Avec &#171; les
deux carr&#233;s blancs &#187;, la complexit&#233; augmente, de m&#234;me que l&#8217;effort pour isoler les r&#233;f&#233;rents :
dans le groupe de droite, le nombre de carr&#233;s blancs est &#233;galement de deux, et ceci peut in-
troduire un doute dans l&#8217;interpr&#233;tation (du fait du sur-emploi d&#8217;informations). Consid&#233;rons
d&#8217;autre part l&#8217;expression r&#233;f&#233;rentielle &#171; ces carr&#233;s &#187; associ&#233;e &#224; un geste ostensif entourant le
groupe de deux carr&#233;s &#224; gauche. Si les traits &#224; &#233;valuer sont plus nombreux pour une expression
multimodale, l&#8217;effort propre &#224; chaque trait s&#8217;av&#232;re en revanche tr&#232;s faible : la complexit&#233; de
la perception visuelle est r&#233;duite par la focalisation spatiale due au geste, l&#8217;expression verbale</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une caract&#233;risation de la pertinence pour les actions de r&#233;f&#233;rence
</p>
<p>est tr&#232;s simple, le geste d&#8217;entourage &#233;galement (car beaucoup de place est disponible), l&#8217;effort
n&#233;cessaire &#224; l&#8217;association du geste &#224; l&#8217;expression est tr&#232;s faible du fait de l&#8217;emploi non am-
bigu du d&#233;monstratif (car aucune anaphore n&#8217;est possible dans le contexte dialogique). Quant
&#224; l&#8217;effort n&#233;cessaire pour isoler les r&#233;f&#233;rents, il s&#8217;av&#232;re faible du fait que l&#8217;hypoth&#232;se consistant
&#224; assimiler les r&#233;f&#233;rents aux demonstrata est imm&#233;diatement v&#233;rifi&#233;e. &#171; Ces carr&#233;s &#187; associ&#233;e &#224;
un geste semble donc &#234;tre l&#8217;expression multimodale la plus pertinente. Ce n&#8217;est pas le cas dans
la sc&#232;ne de la figure 1-B, du fait de la n&#233;cessit&#233; d&#8217;une d&#233;limitation pr&#233;cise des demonstrata.
</p>
<p>En compr&#233;hension automatique, de telles comparaisons de pertinences pr&#233;sentent plusieurs in-
t&#233;r&#234;ts : premi&#232;rement d&#8217;aider la r&#233;solution de la r&#233;f&#233;rence en apportant un point de vue sur
les processus intervenant dans la compr&#233;hension (la pertinence permet de rejeter certaines
hypoth&#232;ses sur les domaines et sur les r&#233;f&#233;rents) ; deuxi&#232;mement de remettre en question et
comprendre le r&#233;sultat d&#8217;une r&#233;f&#233;rence quand l&#8217;intention r&#233;f&#233;rentielle est clairement identifi&#233;e
mais que la pertinence est faible (il peut &#234;tre utile d&#8217;identifier le ou les traits pour lesquels un
manque de pertinence est flagrant et d&#8217;en tirer des conclusions dans la g&#233;n&#233;ration de la r&#233;ponse) ;
troisi&#232;mement de retrouver la source d&#8217;une incompr&#233;hension ou d&#8217;un malentendu dans le dia-
logue (en consid&#233;rant que cette source risque de correspondre &#224; une pertinence faible).
En g&#233;n&#233;ration automatique, la pertinence d&#8217;une expression r&#233;f&#233;rentielle verbale ou multimodale
s&#8217;&#233;value par rapport aux diff&#233;rents domaines de r&#233;f&#233;rence activ&#233;s, par rapport &#224; elle-m&#234;me et
&#224; l&#8217;intention de r&#233;f&#233;rence. Disposer d&#8217;une telle &#233;valuation permet d&#8217;une part de d&#233;tecter les
&#233;ventuelles ambigu&#239;t&#233;s entre cette intention et d&#8217;autres intentions, entre tel et tel r&#233;f&#233;rent, et
d&#8217;autre part de d&#233;terminer parmi les expressions possibles celle qui produit l&#8217;effet escompt&#233;
avec le minimum d&#8217;effort pour l&#8217;interlocuteur. La pertinence constitue &#224; ce titre un crit&#232;re id&#233;al
pour un choix parmi plusieurs possibilit&#233;s. Elle diff&#232;re de la pertinence en compr&#233;hension :
dans l&#8217;exemple de la figure 1-A, l&#8217;expression &#171; les carr&#233;s de gauche &#187; s&#8217;av&#232;re plus pertinente en
g&#233;n&#233;ration que &#171; les deux carr&#233;s &#187;, car aucune ambigu&#239;t&#233; n&#8217;appara&#238;t sur le domaine de r&#233;f&#233;rence
et sur les r&#233;f&#233;rents. L&#8217;information de cardinalit&#233; peut s&#8217;av&#233;rer indispensable, par exemple si
le geste d&#233;signe un domaine de r&#233;f&#233;rence dans lequel les r&#233;f&#233;rents doivent &#234;tre extraits, ou
s&#8217;il s&#8217;agit d&#8217;un pointage impr&#233;cis vers un groupe perceptif. Dans l&#8217;exemple de la figure 1-B,
imaginons que l&#8217;on veuille d&#233;signer les triangles contenus dans le groupe perceptif h&#233;t&#233;rog&#232;ne
&#224; droite de la sc&#232;ne. L&#8217;association d&#8217;un geste d&#233;signant globalement le groupe, par exemple un
entourage, et de l&#8217;expression verbale &#171; les triangles &#187;, peut amener &#224; une extraction incompl&#232;te
des r&#233;f&#233;rents. En les cherchant bien, ceux-ci sont au nombre de cinq, deux d&#8217;entre eux &#233;tant
de couleur grise et les trois autres de couleur blanche. Dans un m&#234;me contexte, l&#8217;expression
&#171; les cinq triangles &#187; s&#8217;av&#232;re plus pertinente car elle permet &#224; l&#8217;interlocuteur d&#8217;&#234;tre s&#251;r de ne
pas oublier un r&#233;f&#233;rent. Si nous consid&#233;rons maintenant le groupe perceptif situ&#233; au milieu
de la sc&#232;ne, l&#8217;association d&#8217;un geste d&#233;signant globalement le groupe et de l&#8217;expression &#171; les
triangles &#187; s&#8217;av&#232;re aussi pertinente &#224; g&#233;n&#233;rer que le m&#234;me geste avec &#171; les deux triangles &#187;. Le
groupe ne comporte en effet que cinq objets, parmi lesquels les deux triangles se distinguent
facilement. Or le pluriel &#171; les &#187; suffit &#224; d&#233;terminer que le r&#233;sultat de la r&#233;f&#233;rence concerne
bien les deux triangles possibles. L&#8217;adjectif num&#233;ral &#171; deux &#187; n&#8217;apporte aucune information
suppl&#233;mentaire, il ne fait qu&#8217;augmenter la complexit&#233; de l&#8217;expression.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Les exemples que nous avons d&#233;taill&#233;s montrent &#224; quel point le moindre indice venant de la
perception visuelle ou de l&#8217;emploi d&#8217;un pluriel ou d&#8217;un adjectif num&#233;ral intervient dans la com-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>pr&#233;hension et la g&#233;n&#233;ration d&#8217;une expression r&#233;f&#233;rentielle. Face &#224; la multitude d&#8217;indices, nous
avons propos&#233; une caract&#233;risation en ensembles de traits et une m&#233;thode consistant &#224; comparer
l&#8217;effort de traitement li&#233; &#224; chacun de ces traits. Nous ne pr&#233;sentons pas encore de v&#233;ritable
algorithme, mais quelques pistes solides pour un futur mod&#232;le bas&#233; sur une quantification de la
pertinence pour les actions de r&#233;f&#233;rence langagi&#232;res ou multimodales.
</p>
<p>Dans cette premi&#232;re proposition, nous n&#8217;avons consid&#233;r&#233; l&#8217;intention r&#233;f&#233;rentielle qu&#8217;au moment
pr&#233;cis de la r&#233;f&#233;rence. Or celle-ci peut &#234;tre effectu&#233;e dans un certain but qui n&#8217;appara&#238;tra que
plus tard. &#201;valuer la pertinence sans tenir compte de ce but communicatif s&#8217;av&#232;re insuffisant.
Par exemple, l&#8217;emploi de &#171; l&#8217;un &#187; a un effet linguistique particulier d&#251; &#224; ce qu&#8217;on attend ensuite
&#171; l&#8217;autre &#187;. La t&#226;che intervient &#233;galement dans le sens que si l&#8217;utilisateur s&#8217;occupe d&#8217;un triangle
dans un ensemble de deux, le deuxi&#232;me va sans doute &#234;tre trait&#233; bient&#244;t, du moins si la t&#226;che
incite &#224; traiter les objets par cat&#233;gorie. Enfin, le contexte visuel intervient aussi avec les notions
de saillance et de ligne de force dirigeant le regard : une r&#233;f&#233;rence &#224; un objet saillant se carac-
t&#233;rise par un effort de traitement r&#233;duit ; une r&#233;f&#233;rence &#224; un objet situ&#233; au d&#233;part d&#8217;une ligne
entra&#238;ne l&#8217;hypoth&#232;se d&#8217;une r&#233;f&#233;rence ult&#233;rieure &#224; l&#8217;objet suivant dans la direction amorc&#233;e.
Avec nos caract&#233;risations, nos exemples et les perspectives cit&#233;es ci-dessus, nous montrons que
la formalisation de la pertinence est encore un objectif &#224; long terme, car faisant intervenir tous
les param&#232;tres intervenant dans la communication d&#8217;une intention. Nous esp&#233;rons que les traits
propos&#233;s, ainsi que les pistes donn&#233;es pour leur quantification, constitue une base int&#233;ressante
pour de futurs travaux.
</p>
<p>R&#233;f&#233;rences
Akman, V., Surav, M. (1995), Contexts, Oracles, and Relevance, Proceedings of the AAAI-95 Fall Sym-
posium on Formalizing Context, 23-30.
Bellalem, N. (1995), Etude du mode de d&#233;signation dans un dialogue homme-machine finalis&#233; &#224; forte
composante langagi&#232;re : analyse structurelle et interpr&#233;tation, Th&#232;se de doctorat, Universit&#233; Henri
Poincar&#233; de Nancy.
Blutner, R. (2000), Some Aspects of Optimality in Natural Language Interpretation, Journal of Seman-
tics, Vol. 17(3), 189-216.
Gazdar, G., Good, D. (1982), On a Notion of Relevance, In: Smith, N. (Ed.), Mutual Knowledge, London,
Academic Press, 88-100.
Guillaume, P. (1979), La psychologie de la forme, Paris, Flammarion.
Landragin, F., Salmon-Alt, S., Romary, L. (2002), Ancrage r&#233;f&#233;rentiel en situation de dialogue, Traite-
ment Automatique des Langues, Vol. 43(2), 99-129.
Reboul, A., Moeschler, J. (1998), Pragmatique du discours. De l&#8217;interpr&#233;tation de l&#8217;&#233;nonc&#233; &#224;
l&#8217;interpr&#233;tation du discours, Paris, Armand Colin.
Sperber, D., Wilson, D. (1995), Relevance. Communication and Cognition (2nd edition), Oxford UK &amp;
Cambridge USA, Blackwell.
van Rooy, R., (2003), Relevance and Bidirectional OT, In: Blutner, R., Zeevat, H. (Eds.), Pragmatics in
Optimality Theory, Palgrave Macmillan.
Wilson, D. (1992), Reference and Relevance, UCL Working Papers in Linguistics, Vol. 4, 165-191.
Wolff, F. (1999), Analyse contextuelle des gestes de d&#233;signation en dialogue homme-machine, Th&#232;se de
doctorat, Universit&#233; Henri Poincar&#233; de Nancy.</p>

</div></div>
</body></html>