<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une analyse des emplois du d&#233;monstratif en corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Une analyse des emplois du d&#233;monstratif en corpus
</p>
<p>H&#233;l&#232;ne Manu&#233;lian
LORIA
</p>
<p>BP239 Campus Scientifique
F-54506 Vandoeuvre-les-Nancy
</p>
<p>helene.manuelian@loria.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>D&#233;monstratifs, analyse de corpus, annotation de corpus, g&#233;n&#233;ration de texte.
Demonstrative, corpus analysis, corpus annotation, text generation.
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article propose une nouvelle classification des utilisations des d&#233;monstratifs, une mise en
oeuvre de cette classification dans une analyse de corpus et pr&#233;sente les resultats obtenus au
terme de cette analyse. La classification propos&#233;e est bas&#233;e sur celles existant dans la litt&#233;ra-
ture et &#233;tendues pour permettre la g&#233;n&#233;ration de groupes nominaux d&#233;monstratifs. L&#8217;analyse de
corpus montre en particulier que la nature &quot;reclassifiante&quot; du d&#233;monstratif lui permet d&#8217;assumer
deux fonctions (une fonction anaphorique et une fonction de support pour de l&#8217;information nou-
velle) et qu&#8217;il existe des moyens vari&#233;s de r&#233;aliser ces fonctions.
</p>
<p>This paper presents a new classification for the use of demonstrative descriptions, its application
in a corpus analysis and the results of this analysis. The proposed classification is based on the
existing literature and extended to support the generation of demonstrative NPs. The corpus
analysis shows in particular, that the &quot;reclassifying power&quot; of the demonstrative allows it to
perform two functions (anaphora and supporting new information) and that there are various
ways of realising these functions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>1 Introduction
</p>
<p>Les algorithmes de g&#233;n&#233;ration d&#8217;expressions r&#233;f&#233;rentielles se sont jusqu&#8217;&#224; pr&#233;sent pr&#233;occup&#233;s
essentiellement de la g&#233;n&#233;ration de descriptions d&#233;finies. L&#8217;un des buts essentiels de ces algo-
rithmes est de produire des descriptions suffisamment informatives pour permettre au locuteur
d&#8217;identifier le r&#233;f&#233;rent d&#233;crit par le syst&#232;me (principalement (Dale et Reiter, 1995)). Les travaux
de Van Deemter (Van Deemter, 2000; Van Deemter, 2001) &#233;tendent les algorithmes de Reiter
et Dale &#224; la g&#233;n&#233;ration de descriptions plus complexes (vagues ou bool&#233;ennes), (Krahmer et
al., 2001) proposent un algorithme ne s&#8217;appuyant plus seulement sur des propri&#233;t&#233;s internes au
r&#233;f&#233;rent pour le d&#233;crire, mais aussi sur ses relations (spatiales par exemple) avec les autres objets
du contexte. Dans une perspective diff&#233;rente, (Gardent, Striegnitz, 2000) pr&#233;sentent un algo-
rithme de g&#233;n&#233;ration des anaphores associatives, bas&#233; sur un mod&#232;le structur&#233; du contexte et sur
un moteur d&#8217;inf&#233;rences. Tous ces algorithmes permettent la g&#233;n&#233;ration de descriptions d&#233;finies
anaphoriques et rendent compte de l&#8217;opposition description d&#233;finie / pronom. En revanche, ils
ne rendent pas compte de l&#8217;opposition d&#233;fini / d&#233;monstratif et ne permettent donc pas la g&#233;n&#233;ra-
tion de descriptions d&#233;monstratives, qui, si on se r&#233;f&#232;re aux &#233;tudes th&#233;oriques (Corblin, 1987;
Kleiber, 1986; Kleiber, 1988) et aux &#233;tudes empiriques (Vieira et al. 2002), sont employ&#233;es
la plupart du temps en mention subs&#233;quente, ce qui les met directement en concurrence avec
les descriptions d&#233;finies et les pronoms dans le choix des expressions r&#233;f&#233;rentielles. Une fa&#231;on
d&#8217;am&#233;liorer les algorithmes de g&#233;n&#233;ration d&#8217;expressions r&#233;f&#233;rentielles serait donc d&#8217;y int&#233;grer
des possibilit&#233;s de g&#233;n&#233;ration de d&#233;monstratifs.
</p>
<p>Nous proposons ici un premier pas dans cette direction, en pr&#233;sentant une &#233;tude et une clas-
sification des utilisations des d&#233;monstratifs en corpus. Nous montrons d&#8217;abord que les analy-
ses th&#233;oriques du d&#233;monstratif sont trop g&#233;n&#233;rales pour &#234;tre appliqu&#233;es en g&#233;n&#233;ration automa-
tique d&#8217;expressions r&#233;f&#233;rentielles. Nous pr&#233;sentons ensuite l&#8217;&#233;tude de corpus qui nous a permis
d&#8217;aboutir &#224; une classification des utilisations du d&#233;monstratif et de combler certains manques
des analyses th&#233;oriques. Nous donnons enfin quelques premi&#232;res pistes pour la g&#233;n&#233;ration au-
tomatique de descriptions d&#233;monstratives.
</p>
<p>2 Utilisations du d&#233;monstratif
</p>
<p>Le d&#233;monstratif est classiquement reconnu comme d&#233;terminant un groupe nominal dont le
r&#233;f&#233;rent est pr&#233;sent (physiquement ou linguistiquement) dans le contexte et (ou) focalis&#233;. Les
&#233;tudes th&#233;oriques identifient essentiellement quatre utilisations du d&#233;monstratif en fran&#231;ais
(Kleiber, 1986; Kleiber, 1988; Corblin, 1987; Apoth&#233;loz et Reichler-B&#233;guelin, 1999).
- Utilisation en premi&#232;re mention (d&#233;ictique) : Le r&#233;f&#233;rent est identifi&#233; dans le contexte im-
m&#233;diat, et l&#8217;expression est parfois accompagn&#233;e d&#8217;un geste ostensif afin que l&#8217;identification se
fasse sans ambigu&#239;t&#233;.
(Le locuteur est assis dans un fauteuil) Ce fauteuil est confortable.
Cette ann&#233;e, la r&#233;colte sera bonne.
- Utilisation cor&#233;f&#233;rentielle anaphorique : La reprise peut &#234;tre fid&#232;le ou non, mais les expres-
sions utilis&#233;es pour d&#233;signer le r&#233;f&#233;rent entretiennent une relation lexicale connue (hyp&#233;ronymie,
hyponymie, ou synonymie).
Reprise fid&#232;le (ou directe) : La t&#234;te nominale de l&#8217;ant&#233;c&#233;dent est identique &#224; celle de l&#8217;anaphore.
Un chat entra dans la pi&#232;ce. Ce chat avait l&#8217;air de s&#8217;&#234;tre battu.
Reprise indirecte : Elle peut prendre les formes suivantes :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une analyse des emplois du d&#233;monstratif en corpus
</p>
<p>- reprise par hyperonymie : La reprise contient un nom plus g&#233;n&#233;rique que l&#8217;ant&#233;c&#233;dent, et on
peut dire : &quot;Un nom ant&#233;c&#233;dent est une sorte de nom-anaphore&quot; :
Un chat entra dans la pi&#232;ce. Cet animal semblait affam&#233;. (Un chat est une sorte d&#8217;animal.)
- reprise par hyponymie : La reprise comporte un nom plus sp&#233;cifique que l&#8217;ant&#233;c&#233;dent. On
peut dire : &quot;Un nom-anaphore est une sorte de nom-ant&#233;c&#233;dent.&quot;
Un chat entra dans la pi&#232;ce. Ce siamois semblait affam&#233;.
- reprise par synonymie : La t&#234;te de l&#8217;ant&#233;c&#233;dent n&#8217;est ni plus ni moins sp&#233;cifique que la t&#234;te de
l&#8217;anaphore, mais elle est diff&#233;rente.
Le policier entra. Ce flic n&#8217;avait pas l&#8217;air aimable.
- Utilisation cor&#233;f&#233;rentielle reclassifiante : Dans ces utilisations, la t&#234;te nominale n&#8217;est pas
impliqu&#233;e directement dans l&#8217;identification du r&#233;f&#233;rent. Il n&#8217;y a pas de relation lexicale entre
les t&#234;tes nominales des deux syntagmes. Elle permet au locuteur d&#8217;&#233;mettre un jugement ou
d&#8217;apporter une information nouvelle sur le r&#233;f&#233;rent ou d&#8217;utiliser une figure de style :
Un homme entra dans le caf&#233;. Cet imb&#233;cile commen&#231;a &#224; provoquer les habitu&#233;s.
Jean est venu. Ce professeur de philosophie ... (Corblin, 1987)
Tom regarde les nuages. Cette &#233;cume le fait r&#234;ver (Cosse, 2001)
- Utilisation associative : On trouve aussi des mentions d&#8217;utilisation associative du d&#233;mon-
stratif dans (Apoth&#233;loz et Reichler-B&#233;guelin, 1999; Gundel et al., 2000; Nissim, 2001) :
Nous arriv&#226;mes dans un village. Cette &#233;glise, tout de m&#234;me, quelle horreur ! (Charolles in (Apoth&#233;loz
et Reichler-B&#233;guelin, 1999))
</p>
<p>3 Analyse de corpus
</p>
<p>Le corpus dont nous disposons est un extrait du corpus PAROLE1, comprenant 65 000 mots
et 545 syntagmes nominaux d&#233;monstratifs. Il est compos&#233; d&#8217;articles du journal Le Monde
datant de septembre 1987 et tir&#233;s de toutes les rubriques (Politique, Economie, Sport, Culture
et Loisirs). Le corpus est annot&#233; au niveau morphosyntaxique suite au projet PAROLE selon le
sch&#233;ma d&#8217;annotation Multext / Multitag de l&#8217;action GRACE (Lecomte, 1997; Beaumont et al.
1998). Afin d&#8217;automatiser au maximum le travail sur corpus, nous avons r&#233;alis&#233; une s&#233;rie de
pr&#233;-traitements avant l&#8217;annotation, d&#233;crits dans cette section.
</p>
<p>3.1 Pr&#233;-traitements
</p>
<p>Rep&#233;rage des descriptions d&#233;monstratives. G-search tool (Corley et al., 2001) est un outil qui
permet de rechercher des structures syntaxiques dans un corpus non pars&#233; gr&#226;ce &#224; une gram-
maire d&#233;finie par l&#8217;utilisateur. Il nous a permis de pr&#233;parer le corpus &#224; l&#8217;annotation en isolant les
groupes nominaux d&#233;monstratifs, &#224; partir de l&#8217;information pr&#233;sente dans les &#233;tiquettes Multext /
Multitag et d&#8217;une grammaire utilisant cette information. Nous avons ensuite &#233;crit un filtre pour
adapter le format de sortie de G-search au format requis en entr&#233;e de notre outil d&#8217;annotation
(MMAX), c&#8217;est-&#224;-dire du texte avec des balises XML pour chaque mot et des balises suppl&#233;-
mentaires pour les syntagmes &#224; annoter, de fa&#231;on &#224; ce qu&#8217;ils soient mis en &#233;vidence dans le
texte.
Annotation avec MMAX. MMAX (Muller et Strube, 2001) a &#233;t&#233; con&#231;u sp&#233;cifiquement pour
</p>
<p>1Ce corpus a &#233;t&#233; fourni par le laboratoire ATILF (Analyse et Traitement Informatique de la Langue Fran&#231;aise,
UMR 7118, Nancy), dans le cadre de la collaboration LORIA-ATILF dans le Contrat de Plan Etat-R&#233;gion</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>annoter les corpus au niveau r&#233;f&#233;rentiel. Il permet d&#8217;annoter les relations de cor&#233;f&#233;rence et
d&#8217;anaphore associative. Dans une fen&#234;tre de l&#8217;application, on peut lire le texte &#224; annoter. Par
un simple syst&#232;me de s&#233;lection &#224; la souris et de clic dans une autre fen&#234;tre de l&#8217;application o&#249;
apparaissent les attributs d&#233;finis pour l&#8217;annotation, on ins&#232;re des balises XML qui permettent
d&#8217;identifier le type de relation anaphorique, et de pointer l&#8217;ant&#233;c&#233;dent du syntagme. La sortie
de MMAX est un fichier XML. Nous avons ensuite &#233;crit des feuilles de style en XSL et des
&quot;scripts de shell&quot; afin de r&#233;aliser le comptage des ph&#233;nom&#232;nes, d&#8217;extraire et de trier les donn&#233;es
issues de l&#8217;annotation en les pr&#233;sentant dans des fichiers HTML.
</p>
<p>3.2 Sch&#233;ma d&#8217;annotation
</p>
<p>Le sch&#233;ma d&#8217;annotation que nous avons utilis&#233; a &#233;t&#233; &#233;labor&#233; en deux temps : dans un premier
temps, nous avons suivi la classification des emplois du d&#233;monstratif vue en section 2, puis
nous avons affin&#233; nos cat&#233;gories. En effet, bien que les analyses th&#233;oriques nous semblent in-
compl&#232;tes pour la g&#233;n&#233;ration (cf. section 4), elles donnent des informations sur les moyens
utilis&#233;s pour faire des reprises par le d&#233;monstratif. Nous avons donc annot&#233; les utilisations du
d&#233;monstratif dans les cat&#233;gories suivantes : Utilisations d&#233;ictiques, utilisations associatives,
reprises directes, et reprises indirectes. Cette derni&#232;re cat&#233;gorie sera sous-typ&#233;e de la fa&#231;on
suivante :
- hyperonymie
- hyponymie
- synonymie : Nous ajoutons &#224; la d&#233;finition de la section 2 le fait que parfois, deux groupes
nominaux ont le m&#234;me sens, si on tient compte des modifieurs. Nous en avons tenu compte
dans les cas o&#249; l&#8217;un des noms est un nom pr&#233;dicatif qui sous-cat&#233;gorise des compl&#233;ments.
&quot;Nous sommes dans l&#8217;ignorance la plus totale de ce qui se passe et de ce que veulent les Chargeurs.
(...)&quot;, constate un cadre. Cette p&#233;nurie d&#8217;informations, les ouvriers des usines quasi d&#233;sertes de Tour-
coing et de Cambrai n&#8217;en ont pas trop souffert.
- th&#234;ta : Ce nom d&#233;signe les reprises par le nom de r&#244;le th&#233;matique qui sont une forme de
reprise utilisant la grille th&#233;matique d&#8217;un verbe (Manu&#233;lian, 2002). Un syntagme anaphorique
est class&#233; ici lorsque l&#8217;ant&#233;c&#233;dent est d&#233;sign&#233; par le nom de son r&#244;le dans l&#8217;&#233;v&#233;nement d&#233;crit
pr&#233;c&#233;demment.
Jack a vendu du vin &#224; Bill. Ce vendeur est comp&#233;tent.
- reclassification: Cette cat&#233;gorie comprend les reprises o&#249; l&#8217;ant&#233;c&#233;dent et l&#8217;anaphore n&#8217;ont pas
de relation lexicale identifi&#233;e (qui peut aller jusqu&#8217;&#224; un rapport m&#233;taphorique).
Jack a vendu un livre &#224; Bill. Cet imb&#233;cile a oubli&#233; qu&#8217;il me l&#8217;avait r&#233;serv&#233;.
Deux arbres encadraient l&#8217;entr&#233;e. Ces sentinelles dormaient.
- autres : La reprise n&#8217;entre pas dans les cat&#233;gories d&#233;crites pr&#233;c&#233;demment.
</p>
<p>Ces classes ont constitu&#233; une premi&#232;re base &#224; notre annotation. Nous avons ensuite, dans une
deuxi&#232;me passe d&#8217;annotation, affin&#233; les cat&#233;gories &quot;autres&quot; (trop importante) et &quot;reclassifica-
tion&quot; (trop h&#233;t&#233;rog&#232;ne), et ajout&#233; les cat&#233;gories suivantes :
- m&#233;talinguistique : L&#8217;ant&#233;c&#233;dent (nominal ou non) est repris par un nom d&#233;signant sa na-
ture linguistique, ou par un &#233;l&#233;ment mentionnel du type &quot;ce dernier&quot;. Ces reprises avaient &#233;t&#233;
class&#233;es au d&#233;part dans la cat&#233;gorie &quot;autres&quot;.
Cinq Etats - l&#8217; Andhra-Pradesh, le Karnataka, le Maharashtra, le Madhya-Pradesh et le Rajasthan -
sont atteints pour la troisi&#232;me annee cons&#233;cutive ; huit autres pour la seconde ann&#233;e ; enfin, huit nou-
veaux Etats sont venus s&#8217;ajouter en 1987 &#224; cette liste.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une analyse des emplois du d&#233;monstratif en corpus
</p>
<p>- ant&#233;c&#233;dent = nom propre : Nous avons class&#233; &#224; part les reprises de noms propres (au d&#233;-
part dispers&#233;es dans les cat&#233;gories &quot;hyp&#233;ronyme&quot;, &quot;autres&quot; et &quot;reclassification&quot;) &#233;tant donn&#233;
l&#8217;impossibilit&#233; d&#8217;&#233;tablir une relation lexicale entre un nom propre et un nom commun. Cepen-
dant les reprises mentionnelles ayant pour ant&#233;c&#233;dent des noms propres sont dans la cat&#233;gorie
&quot;m&#233;talinguistique&quot;, parce que comme pour les noms communs, il n&#8217;y a pas de relation lexicale
entre l&#8217;ant&#233;c&#233;dent et l&#8217;anaphore.
Jean s&#8217;est cass&#233; une jambe. Cet homme est malchanceux.
- ant&#233;c&#233;dent non nominal : Nous avons class&#233; &#224; part les cas o&#249; l&#8217;ant&#233;c&#233;dent n&#8217;est pas un nom
(class&#233;s dans &quot;autres&quot; au d&#233;part) pour les m&#234;mes raisons qui nous ont pouss&#233;e &#224; &#233;tablir une
cat&#233;gorie pour les noms propres. Nous avons cependant accept&#233; la pr&#233;sence d&#8217;ant&#233;c&#233;dents non
nominaux dans les cat&#233;gories &quot;theta&quot; et &quot;m&#233;talinguistique&quot;.
</p>
<p>Notre corpus contient 545 descriptions d&#233;monstratives, dont nous avons exclu 17 cas d&#8217;appositions,
ou de groupes nominaux li&#233;s &#224; l&#8217;ant&#233;c&#233;dent par une copule. Nos r&#233;sultats (figure 1) sont proches
de ceux des autres annotations connues (Vieira et al. 2002). Nous y retrouvons 59% de reprises
indirectes, dont 24% passent par une relation lexicale. On constate aussi qu&#8217;il y a peu d&#8217;emplois
en premi&#232;re mention et en association (21% et 2%), ce qui distingue bien l&#8217;emploi du d&#233;mon-
stratif de l&#8217;emploi du d&#233;fini (Poesio, Vieira 1998)2.
</p>
<p>Relation Nombre Pourcentage
Premi&#232;re mention 113 21%
Association 9 2%
Reprises Directes 94 17%
Reprises Indirectes 312 59%
hyponymes 16 3%
hyperonymes 74 14%
synonymes 21 4%
theta 18 3%
reclassifications 73 14%
ant&#233;c&#233;dent = nom propre 43 8%
ant&#233;c&#233;dent non nominal 52 10%
m&#233;talinguistique 22 4%
autres 3 0,6%
TOTAL 528 100
</p>
<p>Figure 1: R&#233;sultats de l&#8217;annotation
</p>
<p>4 Classification des utilisations du d&#233;monstratif
</p>
<p>Pour g&#233;n&#233;rer des SN d&#233;monstratifs, on a besoin de conna&#238;tre les moyens linguistiques utilis&#233;s
pour faire des reprises avec un d&#233;terminant d&#233;monstratif et les fonctions de ces reprises. En
observant les donn&#233;es de notre corpus, nous distinguons deux fonctions s&#233;mantiques du d&#233;-
monstratif utilis&#233; en cor&#233;f&#233;rence :
- il d&#233;termine un syntagme anaphorique n&#8217;ajoutant pas d&#8217;information sur le r&#233;f&#233;rent ;
</p>
<p>2S&#8217;agissant d&#8217;une &#233;tude pr&#233;liminaire, cette annotation a &#233;t&#233; r&#233;alis&#233;e par une seule personne. Nous ne pouvons
donc pas donner de taux d&#8217;accord, mais pr&#233;cisons que l&#8217;annotation a ensuite &#233;t&#233; v&#233;rifi&#233;e par deux personnes,
jusqu&#8217;&#224; accord complet sur les cat&#233;gories.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>- il d&#233;termine un syntagme anaphorique qui, par le biais de la reclassification (ou de l&#8217;hyponymie),
peut donner de l&#8217;information suppl&#233;mentaire sur le ref&#233;rent.
Ces deux utilisations nous semblent fondamentalement diff&#233;rentes, mais la litt&#233;rature ne r&#233;pond
pas aux questions suivantes : Par quels moyens linguistiques se r&#233;alisent ces fonctions ? L&#8217;op&#233;ration
de reclassification est-elle toujours utilis&#233;e pour ajouter de l&#8217;information ? D&#8217;o&#249; viennent les
informations qui permettent d&#8217;interpr&#233;ter l&#8217;anaphore ou de produire cette nouvelle information?
Par ailleurs, la litt&#233;rature ne s&#8217;int&#233;resse qu&#8217;aux liens entre les t&#234;tes nominales des syntagmes.
En g&#233;n&#233;ration, nous avons besoin de conna&#238;re le contenu s&#233;mantique global du syntagme, modi-
fieurs inclus, parce que nous devons g&#233;n&#233;rer une description suffisante pour identifier le r&#233;f&#233;rent.
Quels sont alors les liens entre les deux syntagmes pris dans leur totalit&#233; ? Notre but sera donc
de r&#233;pondre &#224; ces questions, fondamentales pour la g&#233;n&#233;ration, en nous appuyant sur une &#233;tude
de corpus.
</p>
<p>Dans notre corpus, la fonction anaphorique sans ajout d&#8217;information appara&#238;t dans 258 cas
(73,5% des reprises), et la fonction d&#8217;ajout d&#8217;information dans 93 cas (26,5% des reprises).
Apr&#232;s une analyse des reprises de notre corpus, nous avons &#233;tabli une classification mettant en
&#233;vidence &#224; la fois la fonction de l&#8217;anaphore et la provenance des informations permettant sa
g&#233;n&#233;ration ou son interpr&#233;tation. Nous ne consid&#233;rons pas pour le moment les reprises class&#233;es
dans les cat&#233;gories &quot;ant&#233;c&#233;dent non nominal&quot; et &quot;autres&quot;. Nous pr&#233;sentons donc nos r&#233;sultats
sur 351 cas de reprises d&#233;monstratives.
</p>
<p>4.1 Reprises sans ajout d&#8217;information
Il s&#8217;agit de la cat&#233;gorie la plus repr&#233;sent&#233;e dans le corpus (3 reprises sur 4). L&#8217;information com-
muniqu&#233;e par le syntagme d&#233;monstratif est d&#233;j&#224; connue et donn&#233;e. Cependant, elle n&#8217;est pas
forc&#233;ment identique &#224; celle contenue dans l&#8217;ant&#233;c&#233;dent, et peut provenir de sources diverses.
D&#8217;apr&#232;s notre analyse de corpus, ces sources sont les suivantes (tous les exemples cit&#233;s dans
cette section sont extraits du corpus analys&#233;) :
1. L&#8217;information utilis&#233;e dans la reprise provient de l&#8217;ant&#233;c&#233;dent :
Celle-ci, (...) aurait en effet tiss&#233; un r&#233;seau de liens ambigus dans la gendarmerie, la s&#251;ret&#233; de l&#8217;Etat,
les clubs de tir. Le proc&#232;s, au printemps dernier de deux membres d&#8217;une organisation n&#233;o-nazie, (...),
avait permis de mettre ces liens en relief.
2. L&#8217;information est inf&#233;r&#233;e &#224; partir de l&#8217;ant&#233;c&#233;dent et du cotexte :
Lors des p&#233;riodes ayant pr&#233;c&#233;d&#233; les trois derni&#232;res grandes &#233;ch&#233;ances &#233;lectorales, le patronat avait tr&#232;s
sensiblement modifi&#233; son comportement. (...) La cl&#233; de ce nouveau comportement tient en deux chiffres
: 79 % des patrons interrog&#233;s d&#233;clarent qu&#8217;ils sont satisfaits de la politique actuelle men&#233;e par Jacques
Chirac.
3. L&#8217;information est inf&#233;r&#233;e &#224; partir de l&#8217;ant&#233;c&#233;dent gr&#226;ce au savoir lexical :
D&#8217;ann&#233;e en ann&#233;e, l&#8217;Inde paie un tribut sans cesse plus lourd &#224; la s&#233;cheresse, notamment en raison de
l&#8217;aggravation de la d&#233;forestation, qui a d&#233;truit l&#8217;&#233;quilibre &#233;cologique. Ce ph&#233;nom&#232;ne a &#233;t&#233; accentu&#233; par
des choix &#233;conomiques erron&#233;s.
4. L&#8217;information est inf&#233;r&#233;e &#224; partir de l&#8217;ant&#233;c&#233;dent gr&#226;ce au savoir lexical et &#224; partir du
contexte :
La municipalit&#233; s&#8217;est dot&#233;e r&#233;cemment d&#8217;un somptueux Palais des concerts. C&#8217;est dans ce b&#226;timent
confortable et flambant neuf qu&#8217;a eu lieu l&#8217;inauguration.
5. L&#8217;information est inf&#233;r&#233;e gr&#226;ce aux connaissances encyclop&#233;diques &#224; partir de l&#8217;ant&#233;c&#233;dent
et du contexte :
&quot;Les journalistes est-allemands ne feront pas de reportage sur la visite de M. Honecker au cimeti&#232;re de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une analyse des emplois du d&#233;monstratif en corpus
</p>
<p>Neunkirchen, dans la Sarre, o&#249; sont enterr&#233;s ses parents. Ainsi en a-t-il decid&#233;, explique Otto Schwabe,
r&#233;dacteur en chef de la revue Horizont, apr&#232;s que le chef d&#8217;Etat lui-m&#234;me eut requis la &quot;tranquillit&#233;&quot; pour
cette partie &quot;priv&#233;e&quot; de son voyage en R&#233;publique f&#233;d&#233;rale.
</p>
<p>Antec. Antec.
+ ctxt
</p>
<p>Antec
+ lex
</p>
<p>Antec.
+ lex
+ ctxt
</p>
<p>C. En-
cycl.
</p>
<p>Direct + mod 7 4 0 0 0
Direct 72 0 0 0 0
hyper + mod 0 0 7 5 2
hyper 0 0 49 0 0
hypo 0 0 0 2 0
syn + mod 1 0 3 4 1
syn 0 0 8 0 0
theta + mod 0 0 0 6 0
theta 0 0 0 8 0
recl + mod 0 0 0 0 14
recl 0 0 0 0 19
Npropre 0 0 0 0 24
metaling 0 22 0 0 0
total 80
</p>
<p>(21%)
26
(10%)
</p>
<p>67
(26%)
</p>
<p>25
(10%)
</p>
<p>60
(23%)
</p>
<p>Sans in-
f&#233;rences
</p>
<p>Avec in-
f&#233;rences
</p>
<p>Direct 72 0
Direct +
modifieur
</p>
<p>7 4
</p>
<p>Indirect 0 132
Indirect +
modifieur
</p>
<p>1 42
</p>
<p>total 80
(21%)
</p>
<p>178
(69%)
</p>
<p>Figure 2: R&#233;partition des reprises sans ajout d&#8217;information
</p>
<p>Nous pouvons constater (figure 2, tableau de gauche) les diverses fa&#231;ons dont sont r&#233;alis&#233;es les
reprises (les cat&#233;gories de l&#8217;annotation ainsi que la provenance de l&#8217;information sont abr&#233;g&#233;es
dans le tableau et la mention &quot;+mod&quot; signifie que la reprise est modifi&#233;e). La reclassification
ne signifie pas syst&#233;matiquement qu&#8217;un ajout d&#8217;information est effectu&#233;. Les informations con-
tenues dans la reprise proviennent de plusieurs sources :
- de l&#8217;ant&#233;c&#233;dent (majoritairement : 57%), dans le cas des reprises directes ou avec une relation
lexicale connue,
- du contexte, (20%)
- des connaissances encyclop&#233;diques. (23%)
Le tableau de droite (figure 2) pr&#233;sente un r&#233;sum&#233; du tableau de gauche. On peut y lire
clairement que les reprises sans ajout d&#8217;information sont produites majoritairement &#224; partir
d&#8217;inf&#233;rences (69% des cas).
</p>
<p>4.2 Reprises avec ajout d&#8217;information
La capacit&#233; &quot;reclassifiante&quot; du d&#233;monstratif peut parfois servir &#224; ajouter de l&#8217;information. Dans
cette section, nous montrons par quels moyens linguistiques sont r&#233;alis&#233;s les ajouts d&#8217;information
dans les reprises par un syntagme d&#233;monstratif.
</p>
<p>1. Relation lexicale sp&#233;cifiante :
Ce document souligne la gravit&#233; croissante des cons&#233;quences m&#233;dicales de la consommation de tabac,
responsable en France de plus de 10% des d&#233;c&#232;s. Les auteurs de ce rapport formulent une s&#233;rie de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>propositions &#224; bien des &#233;gards tr&#232;s d&#233;rangeantes.
2. Relation lexicale sp&#233;cifiante et modifieurs :
Mais &#224; Roubaix (...), le personnel a l&#8217;impression de seulement compter les points. La Laini&#232;re va peut-
etre supprimer des cars de ramassage ! Pour ces ouvri&#232;res du bassin houillier dont quelques-unes
ont d&#233;j&#224; trois heures de transport par jour, la nouvelle (...) a rel&#233;gu&#233; au second plan les man&#339;uvres
boursi&#232;res dont leur entreprise fait l&#8217;objet depuis deux mois.
3. L&#8217;information nouvelle est dans les modifieurs :
L&#8217; aviation isra&#233;lienne a effectu&#233; le samedi 5 septembre un raid sur le camp de refugi&#233;s palestiniens
d&#8217;Ain-el-Heloue, dans les faubourgs de Saida, chef-lieu du Liban-sud, ont rapport&#233; les correspon-
dants sur place. Les chasseurs-bombardiers isra&#233;liens ont effectu&#233; &#224; partir de 10h15 locales plusieurs
attaques en piqu&#233; sur ce camp qui compte soixante-mille habitants, (...).
Parall&#232;lement, il prendrait la pr&#233;sidence de Ficofrance, la soci&#233;t&#233; financi&#232;re de GMF. Ce groupe famil-
ial, qui a r&#233;alis&#233; en 1986 un chiffre d&#8217; affaires de 5 milliards de francs, figure parmi les candidats les
plus s&#233;rieux (...).
4. L&#8217;information nouvelle est dans tout le syntagme et ne passe pas par une relation lexi-
cale :
M&#233;taphore : Les huit journ&#233;es de comp&#233;tition ont &#233;t&#233; domin&#233;es par l&#8217;Allemagne de l&#8217;Est, qui, &#224; l&#8217;heure
du bilan, totalise 31 m&#233;dailles dont 10 d&#8217;or. Une large partie de cette moisson a &#233;t&#233; recolt&#233;e par les
athl&#232;tes f&#233;minines (...).
Introduction du point de vue du locuteur : A un moment, (...) je tombe sur un article intitul&#233; &quot;
Pourquoi les maris prennent le large&quot;. Je me dis : cherche pas, ils se d&#233;binent pendant que tu t&#8217;&#233;chines
&#224; faire des pompes et des flexions, ces salauds-l&#224;.
Changement de point de vue : Et si Carl Lewis &#233;tait condamn&#233; &#224; se battre sans cesse contre les
chim&#232;res du sport moderne ? Ce petit gar&#231;on qui avait une mauvaise croissance est devenu adulte, un
athl&#232;te prodigieusement dou&#233;.
Introduction de propri&#233;t&#233;: Richard Vivien a cr&#233;&#233; une surprise de taille en devenant samedi champion
du monde de la cat&#233;gorie, que l&#8217; on d&#233;finissait il y a peu de temps comme &#233;tant celle des &quot;purs&quot;. Ce Nor-
mand de vingt-trois ans, remarqu&#233; par Yves Hezard, est peut-&#234;tre un pur, mais il poss&#232;de d&#233;j&#224; beaucoup
de m&#233;tier (...).
</p>
<p>Le tableau (figure 3) nous montre les &#233;l&#233;ments suivants : L&#8217;information nouvelle est ma-
Relation syntagme complet rel. lex. modifieur mod. + rel. lex.
Direct mod 0 0 11 0
hyper mod 0 0 11 0
hypo mod 0 2 0 8
hypo 0 4 0 0
syn mod 0 0 4 0
theta mod 0 0 4 0
recl mod 17 0 0 0
recl 13 0 0 0
N propre mod 5 0 14 0
total 35 (38%) 6 (6,5%) 44 (47%) 8 (8,5%)
</p>
<p>Figure 3: R&#233;partition des reprises avec ajout d&#8217;information
</p>
<p>joritairement introduite par les modifieurs de l&#8217;anaphore (47% des cas). Dans 38% des cas,
l&#8217;information nouvelle est apport&#233;e par le biais de la reclassification sans lien lexical identifi&#233;,
dans la totalit&#233; du syntagme. Enfin, on constate que l&#8217;hyponymie est assez peu utilis&#233;e pour
ajouter de l&#8217;information (15% des cas).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une analyse des emplois du d&#233;monstratif en corpus
</p>
<p>4.3 Synth&#232;se
</p>
<p>Les r&#233;sultats de ces analyses de corpus nous am&#232;nent aux conclusions suivantes : Pour g&#233;n&#233;rer
une reprise d&#233;monstrative sans ajouter d&#8217;information, plusieurs choix sont offerts, dans l&#8217;ordre
de pr&#233;f&#233;rence suivant (nous nous basons pour le moment sur la fr&#233;quence d&#8217;apparition des
formes de reprises, n&#8217;ayant pas encore identifi&#233; d&#8217;autres crit&#232;res de choix) :
On g&#233;n&#232;re un syntagme sans modifieur :
- La t&#234;te de l&#8217;anaphore est inf&#233;r&#233;e du contexte, du savoir lexical et des connaissances du monde.
- La t&#234;te de l&#8217;anaphore r&#233;p&#232;te la t&#234;te du syntagme ant&#233;c&#233;dent.
On g&#233;n&#232;re un syntagme nominal modifi&#233; :
- La description d&#233;monstrative anaphorique est inf&#233;r&#233;e dans sa totalit&#233; du contexte, du savoir
lexical et des connaissances du monde.
- La description anaphorique est une r&#233;p&#233;tition partielle ou totale de l&#8217;ant&#233;c&#233;dent.
</p>
<p>Pour utiliser une reprise d&#233;monstrative comme support &#224; de l&#8217;information nouvelle, on utilise
(dans l&#8217;ordre de pr&#233;f&#233;rence, toujours &#233;tabli &#224; partir de la fr&#233;quence d&#8217;apparition dans le corpus) :
- Une description d&#233;monstrative sans relation lexicale avec l&#8217;ant&#233;c&#233;dent,
- Les modifieurs dans une description d&#233;monstrative dont la t&#234;te est inf&#233;r&#233;e de la t&#234;te de l&#8217;ant&#233;c&#233;dent
- Une relation d&#8217;hyponymie
- Les modifieurs dans une description d&#233;monstrative dont la t&#234;te est identique &#224; celle de l&#8217;ant&#233;c&#233;dent.
</p>
<p>5 Conclusions et perspectives
</p>
<p>Les analyses existantes ne tiennent pas compte de toutes les donn&#233;es que nous avons pu r&#233;unir
et qui sont n&#233;cessaires en g&#233;n&#233;ration de texte. Tout d&#8217;abord, en g&#233;n&#233;ration, on a besoin de
conna&#238;tre le but communicatif de l&#8217;expression &#224; g&#233;n&#233;rer. Nous en avons identifi&#233; deux pour les
reprises par une description d&#233;monstrative : une fonction purement anaphorique, et une fonction
d&#8217;ajout d&#8217;information. Ensuite, pour g&#233;n&#233;rer une description d&#233;monstrative, on doit conna&#238;tre le
contenu s&#233;mantique global du syntagme, la provenance possible des informations connues qu&#8217;il
contient s&#8217;il est anaphorique et la fa&#231;on dont elles peuvent &#234;tre exprim&#233;es. On doit aussi pouvoir
donner des indications sur la fa&#231;on dont l&#8217;information nouvelle est r&#233;alis&#233;e. Notre classification
prend en compte ces contraintes et donne des indications sur les moyens linguistiques de faire
une reprise par un syntagme d&#233;monstratif. Cependant, cette &#233;tude est encore incompl&#232;te, et pour
parvenir &#224; un algorithme de g&#233;n&#233;ration efficace, il nous reste encore &#224; donner des contraintes
sur le choix de la r&#233;alisation de l&#8217;expression r&#233;f&#233;rentielle. Ceci pourra se faire si on &#233;tudie :
- Comment fonctionnent les inf&#233;rences sur le contexte dans la r&#233;solution d&#8217;anaphore, et quel
type d&#8217;information est r&#233;utilisable pour la reprise anaphorique.
- S&#8217;il y a des restrictions (li&#233;es au discours o&#249; &#224; la position dans la cha&#238;ne anaphorique) sur
l&#8217;utilisation de tel ou tel moyen de faire la reprise.
- Les diff&#233;rences avec le d&#233;fini afin de d&#233;terminer dans quel cas on utilise quel d&#233;terminant
et s&#8217;il y a des cas o&#249; le choix est imp&#233;ratif. L&#8217;&#233;tude de corpus sur les d&#233;finis pr&#233;sent&#233;e dans
(Gardent et al. 2003) est une premi&#232;re &#233;tape dans cette direction.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>R&#233;f&#233;rences
Apoth&#233;loz D., Reichler-B&#233;guelin M.J., (1999) Interpretations and Functions of Demonstrative NPs in
Indirect Anaphora, Journal of Pragmatics 31, pp363-397.
Beaumont C., Lecomte J., et Hatout N., (1998) Etiquetage morpho-syntaxique du corpus &quot;Le Monde&quot;
pour les besoins du projet PAROLE, Rapport Technique, INALF, Nancy.
Corblin F. (1987), Ind&#233;fini, D&#233;fini et D&#233;monstratif, Gen&#232;ve, Paris, Droz.
Corley S., Corley M., Keller F., Crocker M.W., et Trewin S., (2001) Finding Syntactic Structure in
Unparsed Corpora : The Gsearch corpus query system, Computer and Humanities, 35(2), pp81-94.
Cosse M., (2001), Sur Ce N, non publi&#233;.
Dale R. Reiter E., (1995), Computational Interprerations of the Gricean Maxims in the Generation of
Referring Expressions Cognitive Sciences 19(2), pp233-263.
Gardent C., Striegnitz K., (2000), Generating Indirect Anaphora, Actes de IWCS&#8217;00 (International
Workshop on Computational Semantics).
Gardent C., Manu&#233;lian H., Kow E., (2003), Which Bridges for Bridging Descriptions, &#224; para&#238;tre dans les
Actes de EACL Workshop on Linguistically Interpreted Corpora.
</p>
<p>Gundel J., Hedberg N., et Zacharski R., (2000), Statut cognitif et forme des anaphoriques indirects,
Verbum, 22, pp 79-102.
Kleiber G., (1986), Pour une explication du paradoxe de la reprise imm&#233;diate un N -&gt; le N / un N -&gt; Ce
N Langue Fran&#231;aise, 72, pp 54-79.
Kleiber G., (1988), Reprise imm&#233;diate et th&#233;orie des contrastes, Studia Romanica Posnaniensa, 13, pp
67-83.
Krahmer E., van Erk S., Verleg A., (2001), A Meta-Algorithm for the Generation of Referring Expres-
sions, Actes de 8th European Workshop on Natural Language Generation pp 29-39.
Lecomte J., (1997) Codage Multext - GRACE pour l&#8217;action GRACE / Multitag, Rapport Technique,
INALF, Nancy.
</p>
<p>Manu&#233;lian H., (2002), Annotation des descriptions d&#233;finies : le cas des reprises par les r&#244;les th&#233;matiques,
Actes de RECITAL, pp455-467.
Muller C., Strube M., (2001) Annotating Anaphoric and Bridging Relations with MMAX, Actes de 2nd
SIGDial Workshop on Discourse and Dialogue, pp90-95.
Nissim M., (2001) Bridging Definites and Possessives: Distribution of Determiners in Anaphoric Noun
Phrases, PhD Thesis, University of Pavia.
</p>
<p>Poesio M., Vieira R., (1998), A Corpus Based Investigation of Definite Description Use, Computational
Linguistics, 24-2 pp183-216.
Vieira R., Salmon-Alt S., Gasperin C., Schang E., Othero G., (2002), Coreference and Anaphoric Rela-
tions of Demonstrative Noun Phrases in a Multilingual Corpus, Actes de DAARC.
</p>
<p>Van Deemter K., (2000), Generating Vague Descriptions, Actes de First International Conference on
Natural Language Generation, pp 179-186.
Van Deemter K., (2001), Logical Form Equivalence : the Case of Referring Expressions Generation,
Actes de 8th European Workshop on Natural Language Generation 21-29.</p>

</div></div>
</body></html>