<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une m&#233;thode non supervis&#233;e d&#8217;apprentissage sur le Web pour la r&#233;solution d&#8217;ambigu&#239;t&#233;s structurelles li&#233;es au rattachement pr&#233;positionnel</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Une m&#233;thode non supervis&#233;e d&#8217;apprentissage sur le Web pour
la r&#233;solution d&#8217;ambigu&#239;t&#233;s structurelles li&#233;es
</p>
<p>au rattachement pr&#233;positionnel
</p>
<p>N&#250;ria Gala Pavia
XRCE et LIMSI-CNRS
</p>
<p>Bt. 508 Universit&#233; de Paris-Sud
91403 Orsay Cedex
</p>
<p>gala@limsi.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Analyse syntaxique robuste, grammaires de d&#233;pendances, apprentissage non supervis&#233;, d&#233;sam-
bigu&#239;sation du rattachement pr&#233;positionnel.
Robust parsing, dependency grammars, unsupervised learning, prepositional phrase attachment
resolution.
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans cet article, nous proposons une m&#233;thode non supervis&#233;e d&#8217;apprentissage qui permet d&#8217;am&#233;-
liorer la d&#233;sambigu&#239;sation du rattachement pr&#233;positionnel dans le cadre d&#8217;un analyseur robuste
&#224; base de r&#232;gles pour le fran&#231;ais. Les rattachements ambigus d&#8217;une premi&#232;re analyse sont
transform&#233;s en requ&#234;tes sur le Web dans le but de cr&#233;er un grand corpus qui sera analys&#233; et d&#8217;o&#249;
seront extraites automatiquement des informations lexicales et statistiques sur les rattachements.
Ces informations seront ensuite utilis&#233;es dans une deuxi&#232;me analyse pour lever les ambigu&#239;t&#233;s
des rattachements. L&#8217;avantage d&#8217;une telle m&#233;thode est la prise en compte de cooccurrences
syntaxiques et non pas des cooccurrences purement textuelles. En effet, les mesures statis-
tiques (poids) sont associ&#233;es &#224; des mots apparaissant initialement dans une m&#234;me relation de
d&#233;pendance, c&#8217;est-&#224;-dire, des attachements produits par le parseur lors d&#8217;une premi&#232;re analyse.
</p>
<p>In this paper we describe an unsupervised method which improves the disambiguation of prepo-
sitional attachments in an existing rule-based dependency parser for French. The results ob-
tained after a first analysis (ambiguous attachments) are transformed into queries to the Web
in order to obtain a very big corpus. This big corpus being parsed, lexical and statistical infor-
mation is extracted to create a database that will be used in a second analysis to disambiguate
conflictual attachments. The advantage of such a method is to take into account syntactic co-
occurrences as opposed to rough textual co-occurrences. That means that statistical measures
(weights) are associated to words already co-occurring in a dependency relation, that is, attach-
ments yield by the parser after a first analysis.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nuria Gala Pavia
</p>
<p>1 Probl&#233;matique
</p>
<p>De fa&#231;on g&#233;n&#233;rale, une des difficult&#233;s majeures de tout syst&#232;me d&#8217;analyse syntaxique automa-
tique est le traitement des ambigu&#239;t&#233;s au niveau de la phrase. Les ambigu&#239;t&#233;s structurelles les
plus importantes concernent des ph&#233;nom&#232;nes comme la coordination, le rep&#233;rage de termes
complexes et le rattachement pr&#233;positionnel. Globalement, le traitement de ces ph&#233;nom&#232;nes
implique la prise en compte des ambigu&#239;t&#233;s de rattachements des constituants. Dans le cas du
rattachement pr&#233;positionnel, le probl&#232;me concerne le lien de d&#233;pendance entre un syntagme
pr&#233;positionnel (SP) et une t&#234;te syntaxique (un verbe, un nom ou un adjectif). Selon la position
du SP (notamment quand il se trouve apr&#232;s un verbe) il n&#8217;est pas toujours possible de d&#233;terminer
quel est le bon rattachement sur la base de la structure morpho-syntaxique. En effet, les phrases
(1) &#171; Les variations soumettent les particules &#224; des mouvements ... &#187; et (2) &#171; Les variations
soumettent les particules du milieu ... &#187; ont la m&#234;me structure syntagmatique (SV SN SP);
cependant, dans (1) le SP se rattache au verbe (soumettre &#224; mouvements) alors que dans (2) le
SP se rattache au nom (particules du milieu).
</p>
<p>2 Approche propos&#233;e
</p>
<p>La r&#233;solution des ambigu&#239;t&#233;s li&#233;es au rattachement pr&#233;positionnel se fait, dans notre approche,
par la combinaison des sorties produites par l&#8217;analyseur lors d&#8217;une premi&#232;re analyse avec de
l&#8217;information lexicale et statistique puis&#233;e automatiquement sur le Web. En effet, les d&#233;pen-
dances en conflit obtenues lors d&#8217;une premi&#232;re analyse sont transform&#233;es en requ&#234;tes pour le
Web dans le but de constituer un corpus de grande taille o&#249; v&#233;rifier la fr&#233;quence d&#8217;un patron de
cooccurrence syntaxique. La notion de &#171; patron de cooccurrence &#187; est, dans ce contexte, plus
large que la notion classique de &#171; rection &#187;: nous ne tenons pas compte du caract&#232;re optionnel
ou obligatoire de l&#8217;&#233;l&#233;ment &#224; rattacher1, nous sommes uniquement int&#233;ress&#233;e par la r&#233;solution
du rattachement ambigu, qu&#8217;il soit facultatif ou obligatoire.
</p>
<p>2.1 Analyseur &#224; la base
</p>
<p>Le mod&#232;le d&#8217;analyseur que nous avons utilis&#233; est fond&#233; sur la plate-forme d&#8217;analyse XIP (A&#239;t-
Mokhtar et al., 2002), les propri&#233;t&#233;s de ce syst&#232;me s&#8217;adaptant parfaitement &#224; nos objectifs:
ouverture (r&#232;gles de grammaire facilement enrichissables), souplesse (possibilit&#233; d&#8217;articuler
plusieurs ressources diff&#233;rentes), modularit&#233; (facilit&#233; d&#8217;ajout ou de suppression de grammaires).
Pour notre approche, nous avons utilis&#233; la plate-forme XIP et nous avons construit un ensem-
ble de grammaires dans une perspective d&#8217;analyse en deux &#233;tapes (Gala Pavia, 2003), selon les
caract&#233;ristiques linguistiques et/ou structurelles des phrases en entr&#233;e.
</p>
<p>Du point de vue de l&#8217;analyse linguistique, les grammaires r&#233;alisent un marquage en constituants
(syntagmes noyau, chunks) et une extraction de d&#233;pendances syntaxiques. Une d&#233;pendance est
ici une relation entre les t&#234;tes de deux syntagmes, dans le cas du rattachement pr&#233;positionnel,
entre deux t&#234;tes li&#233;es par une pr&#233;position. Ce dernier type de d&#233;pendance est repr&#233;sent&#233; par
A(X,Pr&#233;p,N), o&#249; X est la t&#234;te syntaxique (indistinctement un verbe, un nom ou un adjectif),
Pr&#233;p la pr&#233;position et N le nom &#224; rattacher. Par exemple, pour la phrase &#171; Les variations de
</p>
<p>1Nous ne faisons pas la diff&#233;rence entre &#171; argument &#187;, &#171; modifieur &#187; ou &#171; adjoint &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une m&#233;thode non-supervis&#233;e d&#8217;apprentissage sur le Web
</p>
<p>cette pression soumettent les particules du milieu &#224; des mouvements vibratoires. &#187; l&#8217;analyseur
produit la sortie suivante2:
</p>
<p>SUBJ(soumettent,variations)
OBJ(soumettent,particules)
NADJ(mouvements,vibratoires)
NADJ(milieu,vibratoires)
A(variation,de,pression)
A(particule,de,milieu)
A(milieu,&#224;,mouvements)
A(particule,&#224;,mouvements)
A(soumettent,&#224;,mouvements)
</p>
<p>240&gt;MAX{NP{Les variations} PP{de NP{cette pression}}
FV{soumettent} NP{les particules} PP{du NP{milieu}}
PP{&#224; NP{des mouvements}} AP{vibratoires} .}
</p>
<p>Les heuristiques impl&#233;ment&#233;es pour le rattachement pr&#233;positionnel permettent d&#8217;extraire tous
les rattachements possibles lors d&#8217;une premi&#232;re analyse (la strat&#233;gie est non d&#233;terministe unique-
ment pour ce type de d&#233;pendance), d&#8217;o&#249; l&#8217;ambigu&#239;t&#233; de rattachement pour mouvements dans
l&#8217;exemple.
</p>
<p>2.2 Grammaire de d&#233;pendances de l&#8217;analyseur
</p>
<p>La grammaire de d&#233;pendances impl&#233;ment&#233;e pour l&#8217;extraction du rattachement pr&#233;positionnel
contient deux types de r&#232;gles en ce qui concerne la qualit&#233; des relations de d&#233;pendance pro-
duites. D&#8217;une part, il y a des r&#232;gles (cinq en total) qui d&#233;crivent des contextes tr&#232;s s&#251;rs, par
exemple un rattachement produit dans SN SP SV. L&#8217;&#233;valuation individuelle de ces r&#232;gles dans
nos corpus donne un taux de pr&#233;cision sup&#233;rieur &#224; 93 %. D&#8217;autre part, les autres r&#232;gles (seize
en total) extraient des d&#233;pendances dans des contextes moins s&#251;rs et souvent ambigus. Elles ne
s&#8217;appliquent que si une t&#234;te n&#8217;a pas &#233;t&#233; rattach&#233;e par le biais d&#8217;une r&#232;gle du premier type.
</p>
<p>Globalement, cette grammaire &#224; un taux de pr&#233;cision de 71,34 %, un rappel de 92,10 % et une
moyenne F13 de 80,40 %. La distinction initiale des r&#232;gles est marqu&#233;e par le trait MF1 ou MF2
et permet d&#8217;identifier le degr&#233; de fiabilit&#233; des d&#233;pendances produites par l&#8217;analyseur lors de la
premi&#232;re analyse. Pour l&#8217;exemple pr&#233;c&#233;dent:
</p>
<p>A_MF1(variation,de,pression)
A_MF1(particule,de,milieu)
A_MF2(soumettent,&#224;,mouvements)
A_MF2(particule,&#224;,mouvements)
A_MF2(milieu,&#224;,mouvements)
</p>
<p>2Pour les d&#233;pendances, SUBJ est le sujet, OBJ l&#8217;objet directe, COMP un compl&#233;ment verbal, NADJ un com-
pl&#233;ment nominal. Pour les constituants, MAX est le regroupement maximal, NP un syntagme nominal, AP un
syntagme adjectival, PP un syntagme pr&#233;positionnel, FV un syntagme verbal conjugu&#233;, GV un syntagme verbal
participe pr&#233;sent.
</p>
<p>3F1 &#0; 2(P*R)/P+R</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nuria Gala Pavia
</p>
<p>Les d&#233;pendances produites par une r&#232;gle MF2 (&#171; moins fiable &#187;) sont transform&#233;es en requ&#234;tes
et utilis&#233;es pour construire la base lexicale &#224; partir du Web.
</p>
<p>3 Apprentissage avec le Web
</p>
<p>L&#8217;utilisation du World Wide Web comme grande base d&#8217;exemples pour diff&#233;rentes t&#226;ches li&#233;es
au traitement automatique est une id&#233;e exploit&#233;e depuis peu: pour la traduction de noms com-
pos&#233;s (Grefenstette, 1999), pour l&#8217;acquisition d&#8217;entit&#233;s nomm&#233;es (Jacquemin &amp; Bush, 2000),
pour la d&#233;sambigu&#239;sation de relations li&#233;es au rattachement pr&#233;positionnel (Volk, 2001) et
(Lebarb&#233;, 2002).
Dans notre approche, cette ressource nous permet d&#8217;obtenir une base de documents de grande
taille &#224; partir de laquelle nous construisons une base de patrons de cooccurrence. Pour ce faire,
les d&#233;pendances &#171; moins fiables &#187; produites par notre grammaire apr&#232;s l&#8217;analyse d&#8217;un nouveau
corpus sont transform&#233;es en requ&#234;tes pour le Web. Nous faisons l&#8217;hypoth&#232;se que les occurrences
des rattachements &#224; valider sont pr&#233;sentes dans le Web (ou alors elles n&#8217;y sont pas si elles sont
erron&#233;es).
</p>
<p>3.1 Requ&#234;tes
</p>
<p>Chaque requ&#234;te reprend les trois formes de base (tokens) d&#8217;une d&#233;pendance MF24. Le moteur de
recherche choisi a &#233;t&#233; Altavista (www.Altavista.com) avec l&#8217;option de recherche avanc&#233;e
qui permet l&#8217;utilisation de l&#8217;op&#233;rateur bool&#233;en NEAR (une distance de dix mots est possible
entre deux mots donn&#233;s). Certains des documents obtenus ne sont pas pertinents pour notre
t&#226;che, mais nous faisons l&#8217;hypoth&#232;se que ce probl&#232;me de pertinence sera palli&#233; par le nombre
de bonnes occurrences obtenues dans la grande collection de documents.
</p>
<p>3.2 Constitution d&#8217;une base lexicale
</p>
<p>Pour chaque requ&#234;te nous avons collect&#233; 20 URLs. Pour ceci nous avons utilis&#233; un ensemble de
scripts perl combin&#233;s avec la commande d&#8217;UNIX wget. &#192; la fin de cette collecte nous avons
obtenu environ 17.000 documents (de tailles vari&#233;es). Apr&#232;s le nettoyage de marques HTML,
nous avons obtenu un nouveau corpus (38.242.073 mots, 1.368.903 phrases) que nous avons
analys&#233; avec la m&#234;me grammaire.
</p>
<p>L&#8217;analyse de ce grand corpus a donn&#233; environ 4 millions de d&#233;pendances de type A(X,Pr&#233;p,N).
Nous avons consid&#233;r&#233; indiff&#233;remment les d&#233;pendances MF1 et MF2 car nous &#233;tions ici in-
t&#233;ress&#233;es en la quantit&#233; de d&#233;pendances et non en leur qualit&#233;. Ces d&#233;pendances ont alors &#233;t&#233;
transform&#233;es en patrons de cooccurrence (X Pr&#233;p) et nous avons calcul&#233; des fr&#233;quences pour
X ainsi qu&#8217;une mesure d&#8217;estimation de la probabilit&#233; de rattachement (EPR). Cette mesure ex-
prime la fr&#233;quence d&#8217;apparition du mot X par rapport &#224; la cooccurrence de X Pr&#233;p:
</p>
<p>EPR(X,Pr&#233;p) = fr&#233;q(X,Pr&#233;p)/fr&#233;q(X)
4Nous avons utilis&#233; les formes et non pas les lemmes car aucun moteur de recherche ne permet d&#8217;obtenir toutes
</p>
<p>les variantes morphologiques &#224; partir d&#8217;un lemme.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une m&#233;thode non-supervis&#233;e d&#8217;apprentissage sur le Web
</p>
<p>La base contient environ 100.000 patrons avec leurs poids. L&#8217;ensemble de ces informations
s&#8217;av&#232;re crucial lors de la lev&#233;e des ambigu&#239;t&#233;s de rattachement.
</p>
<p>4 Lev&#233;e d&#8217;ambigu&#239;t&#233;s de rattachement pr&#233;positionnel
</p>
<p>Nous avons appliqu&#233; un algorithme de d&#233;sambigu&#239;sation pour toutes les d&#233;pendances de type
MF2 produites lors d&#8217;une premi&#232;re analyse. L&#8217;algorithme prend cet ensemble de d&#233;pendances
&#224; valider et compare les patrons de cooccurrence en conflit pour un m&#234;me &#233;l&#233;ment &#224; rattacher,
avec les patrons et leurs poids encod&#233;s dans la base d&#8217;informations lexicales. Le r&#233;sultat de cette
comparaison aboutit &#224; la proposition d&#8217;un seul rattachement et &#224; la suppression des d&#233;pendances
qui ne correspondent pas au patron choisi.
</p>
<p>4.1 Algorithme de d&#233;sambigu&#239;sation
</p>
<p>Lorsque deux patrons (X1,Pr&#233;p) et (X2,Pr&#233;p) (provenant de deux d&#233;pendances ayant le
m&#234;me &#233;l&#233;ment N &#224; rattacher) existent dans la base de patrons de cooccurrence, leurs poids sont
compar&#233;s. C&#8217;est le patron avec le poids sup&#233;rieur qui va &#234;tre gard&#233;.
</p>
<p>Pour la phrase en exemple, le poids de soumettre &#224; est sup&#233;rieur &#224; celui de particule &#224;
(respectivment, 0.7140 et 0.0032). La d&#233;pendance A_MF2(soumettent,&#224;,mouvements)
est donc gard&#233;e. Dans l&#8217;&#233;ventualit&#233; o&#249; une &#233;galit&#233; de poids des patrons se produise, &#233;tant donn&#233;
que l&#8217;algorithme ne dispose pas d&#8217;autres informations pour lever l&#8217;ambigu&#239;t&#233;, les deux configu-
rations sont alors gard&#233;es.
</p>
<p>Autrement, lors de l&#8217;existence d&#8217;un seul patron de sous-cat&#233;gorisation, on suppose que le patron
inexistant n&#8217;a pas &#233;t&#233; trouv&#233; dans les corpus lors de la construction de la table. Son poids &#233;qui-
vaut alors &#224; z&#233;ro. Dans ce cas, la comparaison n&#8217;a pas lieu car c&#8217;est le patron existant dans la ta-
ble qui est propos&#233;. Pour l&#8217;exemple, la d&#233;pendance A_MF2(soumettent,&#224;,mouvements)
est gard&#233;e car le patron A_MF2(milieu,&#224;,mouvements) n&#8217;a pas &#233;t&#233; trouv&#233;. Quand au-
cun des patrons n&#8217;existe dans la table, l&#8217;algorithme se retrouve devant d&#8217;un cas similaire &#224; celui
&#233;voqu&#233; plus haut: &#224; d&#233;faut d&#8217;autres informations pour lever l&#8217;ambigu&#239;t&#233;, les deux patrons sont
alors gard&#233;s.
</p>
<p>La liste de d&#233;pendances li&#233;es au rattachement pr&#233;positionnel pour la phrase en exemple est
finalement la suivante:
</p>
<p>A(variation,de,pression)
A(particule,de,milieu)
A(soumettent,&#224;,mouvements)
</p>
<p>Les deux premi&#232;res relations ont &#233;t&#233; produites lors de la premi&#232;re analyse par le biais de r&#232;gles
&#171; fiables &#187; alors que la troisi&#232;me a &#233;t&#233; valid&#233;e gr&#226;ce &#224; l&#8217;algorithme qui prend comme ressource
la base d&#8217;informations lexicales et statistiques obtenues par apprentissage sur le Web.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nuria Gala Pavia
</p>
<p>4.2 &#201;valuation
Les r&#233;sultats de l&#8217;application de cette m&#233;thode (&#233;valuation des d&#233;pendances de type A(X,Pr&#233;p,N))
apr&#232;s la lev&#233;e d&#8217;ambigu&#239;t&#233;s donnent un taux de pr&#233;cision de 83,21 %, un rappel de 85,12 % et
une moyenne F1 de 84,16 %. Ces r&#233;sultats obtenus confirment nos hypoth&#232;ses initiales, &#224;
savoir, l&#8217;apprentissage sur le Web &#224; partir de cooccurrences syntaxiques am&#233;liore les sorties
des d&#233;pendances li&#233;es au rattachement pr&#233;positionnel produites uniquement avec des gram-
maires &#224; base des r&#232;gles (incr&#233;ment du taux de pr&#233;cision de 11,84 %). Il est important de
signaler que, &#224; la diff&#233;rence de la plupart des m&#233;thodes existantes, ces r&#233;sultats sont obtenus
pour tout type d&#8217;ambigu&#239;t&#233; de rattachement, c&#8217;est-&#224;-dire, quelle que soit la configuration des
constituants et non seulement pour la configuration classique SV SN SP. Des configurations
avec plusieurs syntagmes pr&#233;positionnels (rattachement multiple) sont ici prises en compte (SV
(SN)+ (SA)+ SP1 SP2 ... SPn).
</p>
<p>5 Conclusion
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; une m&#233;thode non supervis&#233;e d&#8217;apprentissage d&#8217;informations
sur le Web dans le but d&#8217;am&#233;liorer le r&#233;sultat de l&#8217;extraction de d&#233;pendances li&#233;es au rattache-
ment pr&#233;positionnel. L&#8217;analyseur syntaxique initial est enrichi avec une base de donn&#233;es le-
xicales (patrons de cooccurrence) et statistiques (poids de cooccurrence syntaxique), puis&#233;es
automatiquement sur le Web. Au regard des r&#233;sultats obtenus, la combinaison d&#8217;une gram-
maire de r&#232;gles avec des techniques d&#8217;apprentissage se r&#233;v&#232;le utile dans le cas de la r&#233;solution
d&#8217;ambigu&#239;t&#233;s li&#233;es au rattachement pr&#233;positionnel.
</p>
<p>R&#233;f&#233;rences
A&#207;T-MOKHTAR, S. CHANOD J. P. &amp; ROUX C. (2002). Robustness beyond shallowness: Incremental
deep parsing. Special Issue of the Natural Language Engineering Journal on Robust Methods in Analysis
of Natural Language Data, p. 121&#8211;144.
BOURIGAULT D. &amp; FABRE C. (2000). Approche linguistique pour l&#8217;analyse syntaxique de corpus.
Cahiers de Grammaire, 25, 139&#8211;151.
GALA PAVIA N. (2003). Un mod&#232;le d&#8217;analyseur syntaxique robuste fond&#233; sur la modularit&#233; et la lexi-
calisation de ses grammaires. Th&#232;se de doctorat, Universit&#233; de Paris-Sud, UFR Scientifique d&#8217;Orsay.
</p>
<p>GREFENSTETTE G. (1999). The World Wide Web as a resource for example-based machine translation
tasks. In Proceedings of Aslib Conference on Translating and the Computer 21, London.
JACQUEMIN C. &amp; BUSH C. (2000). Combining lexical and formatting cues for named entity acquisition
from the Web. In H. SCHUTZE, Ed., Proceedings of Joint Sigdat Conference On Empirical Methods In
Natural Language Processing And Very Large Corpora (EMNLP/VLC-2000), Hong Kong.
LEBARB&#201; T. (2002). Hi&#233;rarchie inclusive des unit&#233;s linguistiques en analyse syntaxique coop&#233;rative.
Th&#232;se de doctorat, Universit&#233; de Caen.
</p>
<p>VOLK M. (2001). Exploiting the WWW as a corpus to resolve PP attachment. In Proceedings of
Conference on Corpus Linguistics, p. 601&#8211;606, Lancaster.</p>

</div></div>
</body></html>