<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L&#146;identification des structures discursives engendr&#233;es par les cadres organisationnels</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>L&#146;identification des structures discursives 
engendr&#233;es par les cadres organisationnels 
</p>
<p>Agata Jackiewicz, Jean-Luc Minel  
</p>
<p>Laboratoire LaLICC 
UMR 8139 (CNRS - Universit&#233; Paris-Sorbonne) 
</p>
<p>Universit&#233; de Paris-Sorbonne (ISHA) 
 96, bd Raspail, 75006 Paris - France  
{pr&#233;nom.nom}@paris4.sorbonne.fr 
</p>
<p>R&#233;sum&#233; &#150; Abstract  
</p>
<p>Cet article pr&#233;sente tout d&#146;abord une analyse linguistique des cadres organisationnels et son 
impl&#233;mentation informatique. Puis &#224; partir de ce travail, une mod&#233;lisation g&#233;n&#233;ralisable &#224; 
l&#146;ensemble des cadres de discours est propos&#233;e. Enfin, nous discutons du concept d&#146;indicateur 
propos&#233; dans le cadre th&#233;orique de l&#146;exploration contextuelle.  
</p>
<p> 
To begin with, this paper outlines a linguistic analysis of textual enumerating frameworks and 
its computational making. Then, from this work, a modelling for all textual frameworks is 
suggested. Finally, we discuss the relevance of the concept of clue which is central in the 
theoretical framework of contextual exploration method. 
</p>
<p>Keywords &#150; Mots Cl&#233;s 
</p>
<p>S&#233;ries de cadres organisationnels, marqueurs d&#146;int&#233;gration lin&#233;aire, cadres de discours, 
segmentation automatique de textes, m&#233;thode d&#146;exploration contextuelle, filtrage automatique 
de textes. 
</p>
<p>Enumerating frameworks, linear integration markers, discourse frames, automatic text 
segmentation, contextual exploration method, automatic text filtering. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agata Jackiewicz, Jean-Luc Minel 
</p>
<p>1 Introduction 
</p>
<p>Un grand nombre de travaux dans le domaine de l&#146;extraction d&#146;informations se sont 
concentr&#233;s sur le rep&#233;rage d&#146;informations pertinentes, avec pour r&#233;sultat vis&#233;, la construction 
d&#146;un texte (ou d&#146;une fiche) ind&#233;pendant du texte source trait&#233; (Pazienza 1997, MUC 2002). 
Les syst&#232;mes de r&#233;sum&#233; automatique (Mani 2001, Minel &amp; al. 2001), et plus g&#233;n&#233;ralement les 
syst&#232;mes d&#233;di&#233;s &#224; la fouille de textes, qui cherchent par exemple &#224; identifier des informations 
innovantes, mettre en &#233;vidence des r&#233;sultats ou des hypoth&#232;ses dans un article scientifique ou 
dans un rapport technique, retrouver les d&#233;clarations d&#146;un auteur sur une question 
controvers&#233;e, rechercher les causes d&#146;un ph&#233;nom&#232;ne, extraire les d&#233;finitions d&#146;un concept, 
etc. illustrent bien ce type d&#146;approche (Laublet &amp; al. 2002). La plupart de ces syst&#232;mes 
s&#146;appuient sur des algorithmes de reconnaissance de marques de surface, attribuant un score 
ou une &#171; &#233;tiquette &#187; aux phrases du texte, puis extrayant certaines de ces phrases pour 
construire un fragment textuel. Une des difficult&#233;s &#224; laquelle sont confront&#233;s ces syst&#232;mes est 
de fournir le contexte de validit&#233; (par exemple de v&#233;rit&#233; ou de prise en charge) de la phrase 
plac&#233;e dans le fragment textuel. En effet, une information causale ou une description d&#146;un 
&#233;v&#233;nement n&#146;auront pas le m&#234;me int&#233;r&#234;t pour un utilisateur donn&#233;, suivant qu&#146;elles sont 
enti&#232;rement prises en charge par l&#146;auteur du texte, attribu&#233;es &#224; un autre &#233;nonciateur avec une 
marque de distanciation de la part de l&#146;auteur, ou plus simplement plac&#233;es &#224; l&#146;int&#233;rieur d&#146;un 
univers spatial ou temporel limit&#233; (Jackiewicz 2000). Isoler une connaissance de son cadre de 
validit&#233; revient &#224; occulter une part essentielle de son contenu, au risque de lui faire perdre sa 
valeur op&#233;ratoire. 
Plus g&#233;n&#233;ralement, le probl&#232;me que rencontre aujourd&#146;hui le traitement automatique des 
textes quelle que soit sa vis&#233;e applicative ult&#233;rieure tient au fait que l'on ne sait pas comment 
les d&#233;couper en unit&#233;s de traitement. La prise en consid&#233;ration des indicateurs graphiques et 
typographiques constitue un pr&#233;alable, mais les phrases se r&#233;v&#232;lent bien souvent des unit&#233;s 
trop &#233;troites et les paragraphes ou les sections, des unit&#233;s trop vastes. Si certains textes sont 
structur&#233;s tr&#232;s finement par des moyens typographiques et dispositionnels (comme c&#146;est le cas 
des textes r&#233;dig&#233;s pour les pages Web), d&#146;autres sont enti&#232;rement lin&#233;aires et les id&#233;es qui y 
sont contenues sont organis&#233;es uniquement par le discours lui-m&#234;me. Le fait de pouvoir 
segmenter les textes en prenant appui &#233;galement sur l&#146;organisation discursive des contenus 
repr&#233;sente un apport significatif, quel que soit l&#146;objectif du traitement. Lors du filtrage des 
textes, par exemple, un fragment extrait peut parfaitement &#234;tre int&#233;gr&#233; dans une s&#233;rie de 
segments discursifs corr&#233;l&#233;s entre eux. S&#146;il n&#146;est pas toujours pertinent de pr&#233;senter &#224; 
l&#146;utilisateur l&#146;ensemble de la structure qui comprend le segment cibl&#233;, il est sans doute 
int&#233;ressant de lui offrir la possibilit&#233; d&#146;y acc&#233;der dynamiquement et de l&#146;assister dans le 
parcours des &#233;l&#233;ments li&#233;s au segment en question. Le probl&#232;me des s&#233;ries dans le discours 
int&#233;resse &#233;galement certains travaux sur le r&#233;sum&#233; de textes, o&#249; la lisibilit&#233; des extraits 
produits automatiquement est soit &#233;valu&#233;e, soit cens&#233;e &#234;tre am&#233;lior&#233;e, dans des 
d&#233;veloppements ult&#233;rieurs, par le recours aux liens de coh&#233;sion instaur&#233;s par les marqueurs 
d&#146;int&#233;gration lin&#233;aire. 
Les diff&#233;rents travaux men&#233;s dans le domaine de la fouille de textes font appara&#238;tre que l&#146;on 
peut fonder cette activit&#233; sur deux grands types de traitement: (i) le rep&#233;rage des th&#232;mes 
trait&#233;s dans le texte (Salton &amp; al. 1996, Boguraev &amp; al. 2000, Roussel 2002) et /ou des 
s&#233;quences th&#233;matiquement homog&#232;nes (Ferret &amp; al. 1998), (ii) l&#146;identification dans les textes 
de marqueurs linguistiques sp&#233;cifiques qui correspondent &#224; des points de vue et attentes d&#146;un 
utilisateur potentiel  (Laublet &amp; al. 2002). Dans les deux cas, il est indispensable de pouvoir </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Identification de structures discursives 
</p>
<p>s&#146;appuyer sur la structure du texte, non seulement pour calculer les valeurs s&#233;mantiques des 
segments interpr&#233;t&#233;s, mais aussi pour pouvoir parcourir le texte fouill&#233; en suivant 
l&#146;organisation de ces segments. 
Toutes ces activit&#233;s passent du point de vue du traitement automatique par la sp&#233;cification 
d&#146;un cadre m&#233;thodologique, la construction de mod&#232;les (de repr&#233;sentation des connaissances 
linguistiques, de repr&#233;sentation d&#146;un texte), et la r&#233;alisation d&#146;une plate-forme logicielle qui 
impl&#233;mente ces mod&#232;les. C&#146;est pourquoi, dans ce domaine, les recherches du laboratoire 
LaLICC se sont orient&#233;es selon plusieurs axes : 
&#8226; le d&#233;veloppement d&#146;un cadre m&#233;thodologique fond&#233; sur l&#146;exploration contextuelle 
</p>
<p>(Descl&#233;s &amp; al. 1991, Descl&#233;s &amp; al. 1997) ;  
&#8226; la construction des mod&#232;les et des outils de repr&#233;sentation d&#146;un texte (Minel &amp; al. 2001, 
</p>
<p>Ben Hazez  2002, Crispino 2003);  
&#8226; l&#146;&#233;tude fine de certaines structures discursives (Porhiel 2001, Jackiewicz 2002) ; 
&#8226; le d&#233;veloppement d&#146;outils de navigation et de gestion des interactions entre l&#146;utilisateur et 
</p>
<p>le syst&#232;me de filtrage s&#233;mantique (Couto 2001, Minel 2003). 
Le projet global qui sous-tend ces recherches vise &#224; int&#233;grer dans une m&#234;me plate-forme les 
connaissances linguistiques qui permettent de construire une repr&#233;sentation du texte et les 
outils logiciels qui fournissent les moyens &#224; l&#146;utilisateur de se focaliser sur les fragments 
textuels qui r&#233;pondent &#224; ses besoins. Ce travail s&#146;ins&#232;re dans le courant qui vise &#224; &#233;laborer des 
outils d&#146;analyse textuelle, comme la RST (Mann &amp; al. 88) ou le mod&#232;le d&#146;architecture 
textuelle (Luc &amp; al. 2001 , P&#233;ry-Woodley 2000), mais il s&#146;en d&#233;marque notamment sur deux 
points. Premi&#232;rement, nous ne cherchons ni &#224; interpr&#233;ter finement, ni &#224; hi&#233;rarchiser les 
relations entre les structures discursives identifi&#233;es, &#224; l&#146;exception du traitement des 
ench&#226;ssements entre celles-ci. Notre mod&#232;le est donc plus simple que ceux que nous venons 
de citer.  Mais, et c&#146;est notre deuxi&#232;me point, nous nous assignons une op&#233;rationalisation 
effective, fond&#233;e sur des connaissances linguistiques fines et suppos&#233;es ind&#233;pendantes du 
domaine dont traite le texte.  
Afin d&#146;illustrer la pertinence des recherches sur la structuration discursive des textes pour 
discuter et enrichir les cadres m&#233;thodologique et informatique  des travaux sur la fouille des 
documents textuels, nous pr&#233;senterons tr&#232;s bri&#232;vement les r&#233;sultats d&#146;une &#233;tude linguistique 
portant sur les s&#233;ries dans le discours (Jackiewicz 2002), puis apr&#232;s une rapide description de 
l&#146;impl&#233;mentation de ces r&#233;sultats dans la plate-forme ContextO, nous explicitons le mod&#232;le de 
r&#233;f&#233;rence associ&#233; &#224; la structure en s&#233;rie, et proposons de g&#233;n&#233;raliser cette d&#233;marche pour le 
traitement de plusieurs autres structures fond&#233;es sur la notion de cadre de discours. 
</p>
<p>2 Les s&#233;ries dans le discours 
</p>
<p>2.1 Cadre th&#233;orique et d&#233;marche 
</p>
<p>Le travail linguistique a &#233;t&#233; men&#233; dans la perspective textuelle de Michel Charolles (Charolles 
1997, 2002) &#224; qui nous empruntons les notions de cadre de discours et de port&#233;e. La notion 
g&#233;n&#233;rale de cadre sert &#224; d&#233;signer les circonstances dans lesquelles il faut envisager un certain 
&#233;tat ou une s&#233;rie d&#146;&#233;v&#233;nements. Les cadres de discours contribuent ainsi &#224; partitionner 
l&#146;information dans des rubriques homog&#232;nes. Ils instaurent un lien de coh&#233;sion textuelle 
(Halliday &amp; al. 1976) que le lecteur reconstruit &#224; partir de nombreux indices et en particulier 
en s&#146;appuyant sur les introducteurs de cadres. La port&#233;e de ces marques, syntaxiquement non 
int&#233;gr&#233;es &#224; l&#146;&#233;nonc&#233; o&#249; elles figurent mat&#233;riellement, g&#233;n&#233;ralement en position initiale, peut </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agata Jackiewicz, Jean-Luc Minel 
</p>
<p>s&#146;&#233;tendre sur plusieurs phrases cr&#233;ant ainsi une v&#233;ritable unit&#233; textuelle, homog&#232;ne 
th&#233;matiquement et relativement autonome par rapport au contexte. Parmi les expressions 
cadratives ayant un fort pouvoir int&#233;grateur, une famille de marques de nature 
m&#233;talinguistique jouent le r&#244;le d&#146;organisateurs textuels par excellence : ce sont les marqueurs 
d&#146;int&#233;gration lin&#233;aire (MIL). Les MIL ont la propri&#233;t&#233; caract&#233;ristique d&#146;&#234;tre ind&#233;pendants des 
contenus s&#233;mantiques des segments qu&#146;ils introduisent et relient entre eux sur le mode d&#146;une 
s&#233;rie, cr&#233;ant ainsi une v&#233;ritable structure textuelle. 
Partant de l&#146;observation de quelques MIL les plus fr&#233;quents, introducteurs des s&#233;ries 
homog&#232;nes et r&#233;guli&#232;res (d&#146;une part / de l&#146;autre ; en premier lieu / en second lieu /&#133; ; 
premi&#232;rement / deuxi&#232;mement /&#133;), nous avons cherch&#233; &#224; r&#233;pertorier l&#146;ensemble des 
possibilit&#233;s discursives disponibles en fran&#231;ais pour marquer une s&#233;rie. Plus de 180 s&#233;ries 
diff&#233;rentes ont &#233;t&#233; relev&#233;es dans le corpus1 ; nous en avons &#233;tudi&#233; la longueur, la structure, la 
port&#233;e des items, le co-texte et les propri&#233;t&#233;s distributionnelles des introducteurs, ainsi que 
l&#146;amorce (ou l&#146;&#233;nonc&#233; qui annonce la s&#233;rie). Une s&#233;rie est donc caract&#233;ris&#233;e par l&#146;ensemble de 
ces &#233;l&#233;ments. De cette fa&#231;on, nous avons mis en &#233;vidence les donn&#233;es linguistiques 
permettant (i) de rep&#233;rer les MIL, les marques qui les supportent &#233;tant polys&#233;miques et 
polyfonctionnelles dans le discours, (ii) de d&#233;limiter les segments textuels que ces 
organisateurs permettent d&#146;introduire, (iii) de cadrer la totalit&#233; de la s&#233;rie (en trouver le d&#233;but, 
c&#146;est-&#224;-dire d&#233;limiter le segment introducteur ou amorce et en fixer la fin, ce qui implique le 
rep&#233;rage de la fermeture du segment textuel introduit par le dernier MIL de la s&#233;rie).  
Le recueil et l&#146;organisation de ces donn&#233;es ont &#233;t&#233; guid&#233;s par la m&#233;thode d&#146;exploration 
contextuelle utilis&#233;e depuis de nombreuses ann&#233;es dans diverses applications de type TAL par 
l&#146;&#233;quipe LaLICC (Descl&#233;s &amp; al. 1991, 1997). Cette m&#233;thode consiste &#224; identifier dans un 
texte, en premier lieu, les unit&#233;s linguistiques appel&#233;es indices pertinents ou indicateurs qui 
sont significatifs pour la caract&#233;risation (&#233;tiquetage) des segments en fonction d&#146;une t&#226;che 
donn&#233;e, et ensuite de rechercher, avec des r&#232;gles sp&#233;cifiques, des indices compl&#233;mentaires 
dans le contexte des indices pertinents, indices compl&#233;mentaires qui vont permettre la prise de 
la d&#233;cision ad&#233;quate. Une partie des connaissances linguistiques relatives aux s&#233;ries 
discursives est organis&#233;e dans un mod&#232;le conceptuel et exploit&#233;e au sein de la plate-forme 
informatique Context0 (Minel &amp; al. 2001). 
</p>
<p>2.2 Des marqueurs d&#146;int&#233;gration lin&#233;aire aux s&#233;ries des cadres 
organisationnels 
</p>
<p>Les marqueurs d&#146;int&#233;gration lin&#233;aire segmentent le texte en rendant perceptible sa 
configuration. L&#146;instruction fournie par un MIL dit que le segment discursif qu&#146;il introduit est 
&#224; int&#233;grer de fa&#231;on lin&#233;aire dans une s&#233;rie (Turco &amp; Coltier 1988). Cet encha&#238;nement s&#146;&#233;tablit 
en g&#233;n&#233;ral entre unit&#233;s textuelles du m&#234;me niveau ce qui, sur le plan s&#233;mantique, revient &#224; 
dire que les constituants mis en rapport doivent &#234;tre trait&#233;s dans un m&#234;me mouvement 
interpr&#233;tatif. Chaque marqueur d&#146;int&#233;gration lin&#233;aire constitue &#224; lui tout seul une expression 
cadrative &#224; m&#234;me d'indexer plusieurs propositions (autrement dit, chaque MIL introduit un 
cadre organisationnel). A l&#146;&#233;crit, ce pouvoir int&#233;grateur peut s&#146;&#233;tendre sur plusieurs 
paragraphes successifs. 
</p>
<p>                                                 
1  Le Monde Diplomatique sur CD-ROM (12520 articles et documents parus entre 1984 et 1998) et la base 
</p>
<p>FRANTEXT (3650 &#156;uvres, soit 214 millions de mots). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Identification de structures discursives 
</p>
<p>La longueur des s&#233;ries balis&#233;es par les marqueurs d&#146;int&#233;gration lin&#233;aire varie dans nos corpus 
entre deux et dix &#233;l&#233;ments, avec la distribution suivante : {2 items :70 s&#233;ries ; 3 :70 ; 4 :25 ; 
5 :6 ; 6 :5 ; 7 :3 ; 8 :1 ; 9 :1 ; 10 :1}. Ainsi, 75% de ces s&#233;ries sont compos&#233;es de deux ou de 
trois segments, ce qui nous renseigne sur la longueur typique de ces s&#233;ries. Ce r&#233;sultat d&#233;voile 
&#224; son tour une propri&#233;t&#233; saillante des s&#233;ries courtes, &#224; savoir l&#146;h&#233;t&#233;rog&#233;n&#233;it&#233; de leurs 
introducteurs. Cette caract&#233;ristique tient au fait que les introducteurs particuliers issus des 
s&#233;ries d&#146;origine temporelle, spatiale ou &#171; num&#233;rique &#187; peuvent se combiner entre eux 
(exemples : premi&#232;rement / en deuxi&#232;me lieu / enfin ou tout d&#146;abord / deuxi&#232;me facteur / en 
troisi&#232;me lieu / enfin, dernier &#233;l&#233;ment). Notons que le balisage des s&#233;ries peut &#233;galement &#234;tre 
incomplet, avec un ou deux introducteurs manquants. En analysant l&#146;ensemble des s&#233;ries 
tri&#233;es par la longueur, on constate que plus une s&#233;rie est longue, plus ses introducteurs tendent 
&#224; &#234;tre homog&#232;nes (appartenir &#224; la m&#234;me s&#233;rie originelle), ce qui explique le tr&#232;s faible nombre 
de possibilit&#233;s effectivement exploit&#233;es pour introduire une s&#233;rie longue.  
La mise en texte d&#146;une s&#233;rie dans le discours n&#146;appelle pas de disposition visuelle sp&#233;cifique. 
Plusieurs cas de figure sont possibles, allant du paragraphe compact qui contient &#224; la fois le 
segment amorce et l&#146;ensemble des &#233;l&#233;ments de la s&#233;rie s&#146;encha&#238;nant lin&#233;airement, &#224; une suite 
parall&#232;le de paragraphes nettement distincts visuellement, introduits chacun par un MIL en 
position initiale et par une marque graphique (tiret, puce, num&#233;ro). Le marquage mixte 
(organisation &#171; visuelle &#187; + marquage discursif) peut prendre dans sa r&#233;alisation syst&#233;matique 
deux formes diff&#233;rentes : (i) le marquage redondant (ou renforc&#233;) o&#249; chaque marqueur 
discursif est doubl&#233; d&#146;une marque typographique et/ou d&#146;une marque dispositionnelle ; (ii) le 
marquage compl&#233;mentaire o&#249; chaque famille de marques balise un niveau diff&#233;rent dans une 
structure complexe. 
Si les &#233;num&#233;rations structur&#233;es au moyen des marques typographiques et dispositionnelles 
peuvent &#234;tre organis&#233;es &#224; plusieurs niveaux, les s&#233;ries balis&#233;es par les MIL semblent en 
privil&#233;gier un seul. Il existe toutefois des exceptions. Le corpus du MD fournit plusieurs 
s&#233;quences balis&#233;es par les MIL pr&#233;sentant un ench&#226;ssement d&#146;items (tout d&#146;abord&#133;(d&#146;une 
part&#133; d&#146;autre part&#133;) enfin&#133;). On constate par ailleurs que plusieurs s&#233;ries courtes peuvent 
s&#146;encha&#238;ner directement l&#146;une &#224; la suite de l&#146;autre. L&#146;&#233;nonc&#233; introducteur indexe alors 
explicitement l&#146;ensemble des s&#233;ries qui se suivent et pr&#233;cise la nature du lien existant entre 
elles. Il peut s&#146;agir d&#146;une op&#233;ration de parenth&#233;sage qui marque la formation de sous-
ensembles d&#146;items ((1,2), (3,4)), ou d&#146;une reformulation o&#249; une dichotomie entre items est 
reprise sous un &#233;clairage diff&#233;rent ((1,2), (1&#146;,2&#146;)). 
Les marqueurs d&#146;int&#233;gration lin&#233;aire introduisent plusieurs segments textuels qui 
s&#146;interpr&#232;tent comme s&#233;mantiquement &#233;quivalents. L&#146;id&#233;e f&#233;d&#233;ratrice qui relie ces segments 
entre eux est g&#233;n&#233;ralement explicit&#233;e dans un segment textuel (ou amorce) pr&#233;c&#233;dant la s&#233;rie. 
Parmi les marques qui renvoient au principe f&#233;d&#233;rateur de la s&#233;rie, il y a des classifieurs 
(&#233;l&#233;ments, &#233;tapes, causes, raisons&#133;). Ces &#233;l&#233;ments, qui ne peuvent &#234;tre d&#233;finis qu&#146;en 
extension, sont souvent repris au niveau de l&#146;expression cadrative (elle pourrait &#234;tre 
pr&#233;cipit&#233;e par trois &#233;l&#233;ments : premi&#232;rement&#133; deuxi&#232;me &#233;l&#233;ment&#133; troisi&#232;me &#233;l&#233;ment&#133;). Le 
segment amorce donne &#233;galement une indication sur le nombre d&#146;items de la s&#233;rie. La 
longueur peut &#234;tre indiqu&#233;e (i) pr&#233;cis&#233;ment (deux, double&#133;) ou d&#146;une mani&#232;re approximative 
(plus d&#146;un, nombreux&#133;), ces deux types de marques se combinant avec le classifieur, (ii) ou 
plus implicitement, par des expressions telles que un paradoxe, une dichotomie&#133; Il n&#146;existe 
pas toujours d&#146;annonce explicite, mais la s&#233;quence textuelle qui pr&#233;c&#232;de la s&#233;rie est 
r&#233;ellement indispensable &#224; son interpr&#233;tation (par exemple, quand elle exprime une th&#232;se que 
les diff&#233;rents items de la s&#233;rie ont pour charge d&#146;&#233;tayer). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agata Jackiewicz, Jean-Luc Minel 
</p>
<p>La fermeture du dernier cadre organisationnel de la s&#233;rie, comme c&#146;est le cas de tous les 
cadres de discours, n&#146;est pas marqu&#233;e explicitement. Des complexes de plusieurs indices (de 
nature th&#233;matique, graphique...) en g&#233;n&#233;ral li&#233;s &#224; l&#146;ouverture d&#146;une nouvelle structure, 
am&#232;nent le lecteur &#224; fermer ce dernier segment et clore ainsi toute la s&#233;rie. Nous avons 
constat&#233; toutefois que les s&#233;ries discursives &#233;taient fr&#233;quemment suivies par une &#233;valuation 
r&#233;trospective portant sur l&#146;ensemble de leurs items ; cette &#233;valuation est introduite par des 
marques comme (l&#146;ensemble, les deux, tous&#133;). 
Nous avons ainsi d&#233;gag&#233; une structure discursive compos&#233;e d&#146;une amorce et d&#146;une suite de 
segments textuels formant une s&#233;rie, qui en d&#233;pit de certaines variations pr&#233;sente des 
caract&#233;ristiques stables permettant  un traitement automatique de la dite structure. 
</p>
<p>3. Rep&#233;rage et d&#233;limitation des s&#233;ries discursives 
</p>
<p>3.1 Organisation des donn&#233;es 
</p>
<p>Les connaissances relatives aux s&#233;ries discursives capitalis&#233;es dans la base ContextO se 
r&#233;partissent dans deux grands ensembles. Le premier est repr&#233;sent&#233; par les introducteurs des 
items formant &#224; l&#146;origine 182 s&#233;ries diff&#233;rentes. Dans chacune de ces s&#233;ries, le premier MIL 
est consid&#233;r&#233; comme un indicateur, les suivants ont le statut d&#146;indice compl&#233;mentaire. 
Pr&#233;cisons que l&#146;organisation informatique des MIL de rang sup&#233;rieur ou &#233;gal &#224; deux (MIL2, 
MIL3&#133;) est fond&#233;e sur la constitution de paradigmes (classes) dont les &#233;l&#233;ments sont tous les 
MIL pouvant occuper respectivement le rang 2, le rang 3&#133; dans la s&#233;rie ouverte par le MIL 
de rang 1 (indicateur). Cette organisation, illustr&#233;e dans le tableau 1 pour le marqueur 
d&#146;abord, augmente consid&#233;rablement la combinatoire des MIL pouvant s&#146;encha&#238;ner dans une 
s&#233;rie, sans pour autant s&#146;autoriser &#224; combiner librement tous les MIL1 avec tous les MIL2&#133; 
jusqu&#146;au MILn (avec n=10). L&#146;union de l&#146;indicateur et des indices constitue la signature de la 
s&#233;rie. 
</p>
<p>MIL1 indicateur MIL2 MIL3 MIL4 MIL5 
</p>
<p>&amp;d_abord &amp;d_abord2 &amp;d_abord3 &amp;d_abord4 &amp;d_abord5 
</p>
<p>d&#146;abord d&#146;un autre c&#244;t&#233;, dans 
un second temps, &#133; 
</p>
<p>dans un troisi&#232;me 
temps, le troisi&#232;me, &#133;
</p>
<p>quatri&#232;mement, 
quatri&#232;me, &#133; 
</p>
<p>cinqui&#232;me 
</p>
<p>Tableau 1 : extrait de la table des MIL pour les s&#233;ries ouvertes par d&#146;abord. 
</p>
<p>Le deuxi&#232;me ensemble r&#233;unit les donn&#233;es impliqu&#233;es dans la d&#233;sambigu&#239;sation des formes, 
ainsi que dans le cadrage de la totalit&#233; de la structure  n&#233;cessitant d&#146;une part l&#146;identification 
de l&#146;&#233;nonc&#233; introducteur, et d&#146;autre part le rep&#233;rage de la fermeture du dernier item de la 
s&#233;rie. Tous ces marqueurs font partie des indices compl&#233;mentaires. Les indices qui 
interviennent dans l&#146;interpr&#233;tation d&#146;une occurrence de forme en tant que marqueur 
d&#146;int&#233;gration lin&#233;aire ont trait &#224; la position et aux &#233;l&#233;ments pouvant figurer dans le co-texte 
imm&#233;diat d&#146;un MIL. Le crit&#232;re de position sp&#233;cifie qu&#146;un MIL peut figurer soit &#224; l&#146;initiale de 
la phrase, soit dans une incise d&#233;limit&#233;e par deux virgules. Si ce crit&#232;re n&#146;est pas v&#233;rifi&#233;, on 
consid&#232;re la nature de l&#146;&#233;l&#233;ment qui pr&#233;c&#232;de imm&#233;diatement le MIL. Parmi les indices 
autoris&#233;s &#224; figurer dans le contexte gauche d&#146;un MIL citons (i) les signes de ponctuation tels 
que deux-points ou point-virgule, (ii) certains connecteurs (mais, et, surtout&#133;) ou marqueurs 
de cl&#244;ture (enfin, en dernier lieu), (iii) divers marqueurs appartenant &#224; la liste {si, c&#146;est&#133;}, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Identification de structures discursives 
</p>
<p>(iv) les marques graphiques d&#146;&#233;num&#233;ration telles que tirets, puces, num&#233;ros. Le traitement de 
l&#146;&#233;nonc&#233; introducteur dans sa forme explicite s&#146;appuie sur l&#146;identification de ses &#233;l&#233;ments 
saillants : le classifieur et le cardinal (indiquant la longueur de la liste). Notre liste des 
classifieurs comprend 172 formes. Les indicateurs de longueur sont au nombre de 50; ils sont 
class&#233;s en deux sous-ensembles selon leur aptitude &#224; se combiner ou non avec le classifieur 
(deux &#233;l&#233;ments / une dichotomie &#8709;). Les indices lexicaux de la fermeture du dernier item de 
la s&#233;rie sont quant &#224; eux tr&#232;s peu nombreux (L&#146;ensemble, Les deux&#133;, Tous les&#133;), leur 
position (dans la phrase et par rapport au dernier MIL) est fortement contrainte. Le processus 
de l&#146;identification de l&#146;ensemble de la s&#233;rie des cadres organisationnels fait appel &#224; plusieurs 
r&#232;gles heuristiques qui doivent respecter les contraintes impos&#233;es par le mod&#232;le sous-jacent &#224; 
cette structure. Ainsi, le rep&#233;rage de l&#146;indicateur d&#146;une s&#233;rie d&#233;clenche le processus de 
recherche des indices situ&#233;s n&#233;cessairement en aval. L&#146;&#233;tendue de cette recherche est born&#233;e 
par l&#146;observation empirique que la port&#233;e d&#146;un MIL n&#146;exc&#232;de g&#233;n&#233;ralement pas deux 
paragraphes. Toutes ces heuristiques sont impl&#233;ment&#233;es sous la forme de r&#232;gles d&#146;exploration 
contextuelles (Minel &amp; al. 2001). La reconnaissance d&#146;une s&#233;rie entra&#238;ne la construction 
d&#146;une instance de la classe Cadre qui vient enrichir le mod&#232;le de repr&#233;sentation du texte. Une 
description d&#233;taill&#233;e de ce mod&#232;le est donn&#233;e dans (Crispino 2003). 
</p>
<p>3.2 Mod&#232;le de r&#233;f&#233;rence 
</p>
<p>Le rep&#233;rage des structures discursives n&#233;cessite deux niveaux d&#146;analyse, ce qui le diff&#233;rencie 
des travaux jusqu&#146;alors men&#233;s dans le cadre de l&#146;exploration contextuelle. Un premier niveau 
vise &#224; identifier la fonction discursive (ou s&#233;mantique) d&#146;un marqueur. Par exemple, l&#146;adverbe 
tout d&#146;abord, suivant sa position dans la phrase peut appartenir ou non &#224; une structure 
discursive plus complexe (exemples 1 et 2).  
</p>
<p>1) Raskolnikov ne la reconnut pas tout d&#146;abord. C&#146;&#233;tait Sonia Semionovna 
Marmeladova (Dosto&#239;evski, Crime et ch&#226;timent&#133;). 
</p>
<p>2)  La dramatique situation du Mexique montre aujourd'hui que le probl&#232;me de la 
dette demeure entier. Avec cette circonstance aggravante que le dispositif imagin&#233; 
entre 1982 et 1984 arrive &#224; expiration. Pour trois raisons: 
- tout d'abord, la r&#233;cession envisag&#233;e comme m&#233;thode universelle pour ramener 
les compteurs d'un pays &#224; z&#233;ro n'est plus accept&#233;e ni acceptable par les pays du 
tiers- monde qui n'en voient pas la fin. (&#133;) ; 
- de plus, l'approche &quot;au cas par cas&quot;, telle que le FMI l'a con&#231;ue et pratiqu&#233;e, a 
&#233;galement tourn&#233; &#224; l'&#233;chec. (&#133;); 
- enfin, troisi&#232;me et dernier point, les r&#233;&#233;chelonnements pluriannuels sont devenus 
inop&#233;rants. (Le Monde diplomatique) 
</p>
<p>Ce premier niveau mobilise des connaissances linguistiques qui s&#146;expriment sous forme de 
r&#232;gles d&#146;exploration contextuelle dont l&#146;espace de recherche est limit&#233; &#224; la phrase. Un 
deuxi&#232;me niveau d&#146;analyse va conjuguer le rep&#233;rage issu du premier niveau avec des 
contraintes exprim&#233;es dans un mod&#232;le propre &#224; la structure discursive que l&#146;on cherche &#224; 
identifier. Par exemple, pour les s&#233;ries des cadres organisationnels, ce mod&#232;le stipule les 
contraintes suivantes : 
&#8226; Les &#233;l&#233;ments de la structure ob&#233;issent &#224; une organisation s&#233;quentielle (en second lieu 
</p>
<p>appara&#238;t n&#233;cessairement apr&#232;s en premier lieu et avant en troisi&#232;me lieu) sachant que 
certaines marques lexicales peuvent &#234;tre absentes. L&#146;ensemble de ces &#233;l&#233;ments constitue 
une s&#233;rie paradigmatique qui poss&#232;de une signature. La signature permet de distinguer </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agata Jackiewicz, Jean-Luc Minel 
</p>
<p>deux s&#233;ries paradigmatiques qui ont des introducteurs communs (par exemple, 
l&#146;introducteur deuxi&#232;mement appartient &#224; plusieurs s&#233;ries). 
</p>
<p>&#8226; Deux s&#233;ries de m&#234;me signature sont n&#233;cessairement disjointes ; 
&#8226; Deux s&#233;ries de signature diff&#233;rente sont soient disjointes, soient ench&#226;ss&#233;es. 
Ces contraintes vont &#234;tre utilis&#233;es par le processus de reconnaissance pour calculer la port&#233;e 
et l&#146;ench&#226;ssement des structures discursives notamment afin de pallier l&#146;absence de certaines 
marques typographiques ou lexicales comme l&#146;illustre l&#146;exemple (3) : 
</p>
<p>3) Cette proposition am&#232;ne plusieurs remarques. En premier lieu, ..... En second lieu 
..., on peut ainsi distinguer diff&#233;rents cas ... D&#146;une part,.... D&#146;autre part, .... 
Enfin,... En troisi&#232;me lieu, .... Enfin ... 
</p>
<p>La premi&#232;re occurrence de Enfin peut appartenir &#224; la structure discursive ouverte par en 
Premier lieu ou par D&#146;une part. Faute de marques typographiques sp&#233;cifiques (comme par 
exemple des &#171; puces &#187;), cette ind&#233;termination peut &#234;tre r&#233;solue en se r&#233;f&#233;rant aux contraintes 
exprim&#233;es dans le mod&#232;le. En effet, En troisi&#232;me lieu appartient n&#233;cessairement &#224; une s&#233;rie 
d&#233;j&#224; ouverte ce qui implique que la premi&#232;re occurrence de Enfin ferme la s&#233;rie ouverte par 
D&#146;une part. C&#146;est le mod&#232;le qui stipule qu&#146;une ouverture de cadre ferme n&#233;cessairement le 
cadre pr&#233;c&#233;demment ouvert. 
</p>
<p>A chaque structure discursive est donc associ&#233; un mod&#232;le qui d&#233;crit son organisation 
paradigmatique, les contraintes qui r&#233;gissent les &#233;l&#233;ments qui appartiennent &#224; la structure et 
celles qui r&#233;gissent les structures entre elles. Ces contraintes sont propres &#224; chaque mod&#232;le. 
Ainsi, l&#146;&#233;tude men&#233;e sur les cadres th&#233;matiques (Porhiel 2001) semble montrer que ce type de 
structure n&#146;est jamais ench&#226;ss&#233;, alors que le niveau d&#146;ench&#226;ssement des cadres spatiaux ou 
temporels peut &#234;tre d&#146;un niveau sup&#233;rieur &#224; deux (Charolles 1997). Pr&#233;cisons enfin que ces 
contraintes n&#146;ont pas de finalit&#233; normative. Ainsi, il n&#146;est pas exclu de rencontrer des textes 
dans lesquels, l&#146;auteur pour des raisons stylistiques ou rh&#233;toriques ou tout simplement &#224; la 
suite d&#146;une erreur, ne respecte pas ces contraintes. Nous postulons simplement que ces 
exceptions sont des artefacts qu&#146;un syst&#232;me de traitement automatique peut exclure de son 
champ d&#146;analyse. 
</p>
<p>Ces notions de mod&#232;le et de contraintes associ&#233;es &#224; celui-ci ont &#233;t&#233; impl&#233;ment&#233;s dans 
ContextO pour l&#146;identification des s&#233;ries de cadres organisationnels dans un module 
sp&#233;cifique. Nous travaillons actuellement &#224; la description d&#146;un langage de description qui 
permettrait de sp&#233;cifier les mod&#232;les des diff&#233;rentes structures discursives (cadre temporel, 
cadre th&#233;matique, cadre de connaissances, etc.) afin de proposer un outil de description 
g&#233;n&#233;rique. 
</p>
<p>4. Discussion m&#233;thodologique 
</p>
<p>Sur le plan m&#233;thodologique, le processus d&#146;identification des structures discursives interroge 
les principes fondateurs de la m&#233;thode d&#146;exploration contextuelle. D&#146;une part, la notion 
d&#146;indicateur telle qu&#146;elle a &#233;t&#233; jusqu&#146;&#224; pr&#233;sent consid&#233;r&#233;e dans la m&#233;thode d&#146;exploration 
contextuelle n&#146;a plus la m&#234;me pertinence. En effet, la m&#233;thode postule qu&#146;il existe un 
indicateur (marqueur le plus saillant) qui est un &#233;l&#233;ment lexical, grammatical ou 
typographique. Dans l&#146;&#233;tude sur les MIL (Jackiewicz 2002), c&#146;est le premier &#233;l&#233;ment de la 
s&#233;rie qui a &#233;t&#233; consid&#233;r&#233; comme un indicateur, ce qui engendre n&#233;cessairement des silences. 
En fait, aucun &#233;l&#233;ment ne peut &#234;tre choisi comme indicateur, car l&#146;&#233;tude montre que chaque 
&#233;l&#233;ment pris s&#233;par&#233;ment peut &#234;tre absent d&#146;une r&#233;alisation textuelle d&#146;une s&#233;rie de cadres </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Identification de structures discursives 
</p>
<p>organisationnels. C&#146;est donc un complexe compos&#233; de diff&#233;rentes marques linguistiques, ce 
complexe pouvant &#234;tre diff&#233;rent pour diverses r&#233;alisations, qui constitue l&#146; &#171; indicateur &#187;. 
D&#146;autre part, comme l&#146;avait d&#233;j&#224; montr&#233; les travaux men&#233;s dans le projet R&#233;gal (Ferret &amp; al. 
2001) l&#146;identification de la port&#233;e d&#146;un introducteur de cadre peut rarement s&#146;appuyer sur des 
marques linguistiques de surfaces fiables. La solution adopt&#233;e dans ce projet a consist&#233; &#224; 
rechercher des ruptures d&#146;ordre &#171; th&#233;matique &#187;, mesur&#233;es &#224; partir de la variation de la 
fr&#233;quence lexicale entre deux segments textuels. En revanche, l&#146;&#233;tude sur les s&#233;ries dans le 
discours montre que des marques lexicales permettent parfois d&#146;identifier leur fermeture. 
Nous travaillons actuellement &#224; une mod&#233;lisation qui permette de sp&#233;cifier pour chaque 
structure discursive le type de calcul qui doit &#234;tre mis en &#156;uvre. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Ben Hazez, S. (2002). Un mod&#232;le d&#146;exploration contextuelle des textes : filtrage et 
structuration d&#146;informations textuelles, mod&#233;lisation et r&#233;alisation informatique (syst&#232;me 
SEMANTEXT), Universit&#233; Paris-Sorbonne, Paris. 
</p>
<p>Boguraev, B. C., Neff M. (2000). Lexical cohesion, Discourse Segmentation and Document 
Summarization, RIAO 2000, p. 962-979. 
</p>
<p>Charolles, M. (1997). L&#146;encadrement du discours - Univers, champs, domaines et espace , 
Cahier de recherche linguistique, 6. 
</p>
<p>Charolles, M. (2002).   Organisation des discours et segmentation des &#233;crits &#187;, in Inscription 
Spatiale du Langage : structures et processus,  IRIT, Toulouse, 2002. 
</p>
<p>Couto J. (2001). ContextO, Los sistemas de exploracion contextual de cara al usuario, 
M&#233;moire de Master, Universit&#233; de la R&#233;publique, Uruguay. 
</p>
<p>Crispino, G. (2003). Th&#232;se de doctorat, en cours, Universit&#233; de Paris-Sorbonne, Paris. 
</p>
<p>Descl&#233;s, J.-P., Jouis C., Oh H-G., Maire Reppert D. (1991). Exploration Contextuelle et 
s&#233;mantique : un syst&#232;me expert qui trouve les valeurs s&#233;mantiques des temps de l'indicatif 
dans un texte, In Knowledge modeling and expertise transfer, D. Herin-Aime, R. Dieng, J-P. 
Regourd, J.P. Angoujard (&#233;ds), Amsterdam, p. 371-400.  
</p>
<p>Descl&#233;s, J.-P., Cartier E., Jackiewicz A, Minel J.-L. (1997). Textual Processing and 
Contextual Exploration Method  in CONTEXT 97, Universidade Federal do Rio de Janeiro, 
Br&#233;sil, p. 189-197.  
</p>
<p>Ferret O., Grau B., Masson N. (1998).  Thematic segmentation of texts : two methods for two 
kind of texts , Actes ACL-COLING&#146;98, Montr&#233;al, Canada, volume 1: 392-396. 
</p>
<p>Ferret O., Grau B., Minel J.-L., Porhiel S. (2001).  Rep&#233;rage de structures th&#233;matiques dans 
des textes , Actes TALN 2001, Tours, p. 163-172, 2001. 
</p>
<p>Halliday M. et Hasan R. (1976). Cohesion in English Longman, New York. 
</p>
<p>Jackiewicz, A. (2000). &#171; Causalit&#233; et prise en charge &#233;nonciative &#187;, in Etudes Cognitives, n&#176;2, 
Acad&#233;mie Polonaise des Sciences, Varsovie. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Agata Jackiewicz, Jean-Luc Minel 
</p>
<p>Jackiewicz, A. (2002). Rep&#233;rage et d&#233;limitation des cadres organisationnels pour la 
segmentation automatique des textes, CIFT&#146;02, Hammamet, Tunisie, p. 95-107.  
</p>
<p>Luc Ch. et Virbel J. (2001). Le mod&#232;le d&#146;architecture textuelle, fondements et 
exp&#233;rimentation, Verbum, t. XXIII, n&#176;1, &#171; Coh&#233;rence et relations de discours &#224; l&#146;&#233;crit &#187;. 
</p>
<p>Laublet, P., Na&#239;t-Baha L., Jackiewicz A., Djioua B.  (2002). Collecte d&#146;informations 
textuelles sur le Web selon diff&#233;rents points de vue in Interaction Homme-Machine et 
Recherche d&#146;Informations, Editions Herm&#232;s, Paris 
</p>
<p>Mani, I. (2001). Automatic Summarization, John Benjamins Publishing Company, 
Amsterdam. 
</p>
<p>Mann, W. C., Thompson S. A. (1988). Rhetorical Structure Theory : Toward a functional 
theory of text organization, Text, 8(3) p. 243-281. 
</p>
<p>Minel J.-L., Cartier E., Crispino G., Descl&#233;s J.-P., Ben Hazez S., Jackiewicz A. (2001). 
R&#233;sum&#233; automatique par filtrage s&#233;mantique d&#146;informations dans des textes, Pr&#233;sentation de 
la plate-forme FilText, Technique et Science Informatiques, n&#176; 3, Paris, p. 369-396. 
</p>
<p>Minel J.-L. (2003). Filtrage s&#233;mantique. Du r&#233;sum&#233; &#224; la fouille de textes. Herm&#232;s, Paris.  
</p>
<p>MUC (2002). Message Understanding Conferences 
www.itl.nist.gov/iaui/894.02/related_projects/tipster/muc.htm. 
</p>
<p>Pazienza, M.T. (1997). Information Extraction, a multidisciplinary approach to an emerging 
information technology, SCIE&#146;97, Springer Verlag, Notes in Computer Science. 
</p>
<p>P&#233;ry-Woodley, M.-P. (2000). Une pragmatique &#224; fleur de texte : approche en corpus de 
l&#146;organisation textuelle, M&#233;moire d&#146;habilitation, Universit&#233; de Toulouse- le Mirail. 
</p>
<p>Porhiel S. (2001). Linguistic expressions as a tool to extract thematic information , Corpus 
Linguistic 2001, Lancaster University, 2001. 
</p>
<p>Roussel. (2002). Navigation dans l&#146;information par recomposition de documents et 
cartographie, CIFT 02, Hammamet, Tunisie, p. 27-42. 
</p>
<p>Salton G., Singhai A., Buckley C., Mitra M. (1996). Automatic text decomposition using text 
segments and texts themes. In Seventh ACM Conference on Hypertext, Washington D.C. 
</p>
<p>Turco G. et Coltier D., (1988). Des agents doubles de l&#146;organisation textuelle, les marqueurs  
d&#146;int&#233;gration lin&#233;aire, Pratiques, n&#176;57. </p>

</div></div>
</body></html>