<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Bases de connaissances pour asseoir la cr&#233;dibilit&#233; des r&#233;ponses d&#8217;un syst&#232;me de Q/R</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Bases de connaissances pour asseoir la cr&#233;dibilit&#233;  
des r&#233;ponses d'un syst&#232;me de Q/R 
</p>
<p>L. Gillard, P. Bellot, M. El-B&#232;ze 
</p>
<p>Laboratoire d'Informatique d'Avignon (LIA) 
339 ch. des Meinajaries, BP 1228 ; F-84911 Avignon Cedex 9 (France) 
</p>
<p>{ laurent.gillard, patrice.bellot, marc.elbeze }@lia.univ-avignon.fr 
</p>
<p>R&#233;sum&#233; &#150; Abstract 
Cet article pr&#233;sente un prototype de Question/R&#233;ponse (Q/R) impliquant un ensemble de bases de 
connaissances (BC) dont l'objectif est d'apporter un cr&#233;dit suppl&#233;mentaire aux r&#233;ponses candidates 
trouv&#233;es. Ces BC et leur influence sur la strat&#233;gie d&#146;ordonnancement mise en &#156;uvre sont d&#233;crites dans le 
cadre de la participation du syst&#232;me &#224; la campagne Q/R de TREC-2002. 
This paper presents a Question-Answering system using Knowledge Databases (KDB) to validate answers 
candidates. 
</p>
<p>Mots Cl&#233;s &#150; Keywords 
Syst&#232;me de Question/R&#233;ponse, Bases de Connaissances 
Question Answering system, Knowledge Databases. 
</p>
<p>1 Introduction 
Avec l&#146;explosion de la quantit&#233; d'information disponible, les syst&#232;mes de recherche d'information 
sont devenus les principaux moyens d'acc&#232;s &#224; l'information. Pourtant, nombre d'entre eux 
pr&#233;sentent deux faiblesses : d'une part, le nombre de documents retourn&#233;s en r&#233;ponse &#224; une 
requ&#234;te utilisateur est souvent trop important ; d'autre part, c'est toujours &#224; l'utilisateur de 
localiser l'information dont il a besoin dans les documents renvoy&#233;s. Les syst&#232;mes de 
question/r&#233;ponse (Q/R) fournissent une alternative int&#233;ressante &#224; ces faiblesses : ils proposent de 
renvoyer directement &#224; l'utilisateur LA r&#233;ponse &#224; LA question pos&#233;e. 
Ainsi, depuis 1998, la campagne internationale &#171; Text Retrieval Conference &#187; (TREC) propose 
un sous-volet th&#233;matique Q/R (&#171; QA Track &#187;) dont le but est de faire avancer les techniques 
employ&#233;es dans ces syst&#232;mes, notamment en proposant un r&#233;f&#233;rentiel et une m&#233;thodologie 
permettant leur &#233;valuation et leur comparaison.C&#146;est dans le cadre de TREC-2002 (Voorhees E., 
2002), que le LIA s&#146;est int&#233;ress&#233; pour la premi&#232;re fois &#224; la probl&#233;matique Q/R. 
Cet article d&#233;crit le prototype Q/R du LIA &#224; travers une pr&#233;sentation chronologique de ses divers 
constituant (en section 2). Enfin, l'originalit&#233; de ce papier tient en la pr&#233;sentation d'un composant 
suppl&#233;mentaire : un module de bases de connaissances (BC, section 3) et son influence (section 
4) sur les r&#233;sultats obtenus lors de notre participation (Bellot et al., &#224; para&#238;tre) &#224; TREC-2002. En 
effet, pour certaines questions de &#171; culture g&#233;n&#233;rale &#187;, il peut para&#238;tre int&#233;ressant de doter un 
syst&#232;me Q/R d&#146;un ensemble de r&#233;ponses calcul&#233;es &#224; l&#146;avance afin d&#146;en faciliter la recherche ou, 
comme dans le cas de notre prototype, d&#146;en asseoir la confiance. 
</p>
<p>2 Prototype QR du LIA 
&#201;tiquetage des questions : les syst&#232;mes Q/R pr&#233;curseurs comme celui de (Kupiec, 1993) ou les 
diff&#233;rents syst&#232;mes participants &#224; TREC-QA int&#232;grent tous un module charg&#233; de classer les </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>questions (les diff&#233;rences r&#233;sident dans les moyens d&#146;effectuer la classification et dans sa 
granularit&#233;). &#192; partir de la forme interrogative d&#146;une question, il est g&#233;n&#233;ralement possible de 
d&#233;terminer un ou plusieurs types de r&#233;ponses attendues et, par cons&#233;quent, d&#146;en faciliter la 
recherche en &#233;tablissant une correspondance directe entre la nature de la r&#233;ponse attendue et celle 
d&#146;une entit&#233; nomm&#233;e d&#233;tect&#233;e. En plus de l&#146;&#233;tiquetage, certains syst&#232;mes comme (Ferret et al., 
2002) vont plus loin dans le traitement de la question : ils identifient au sein d&#146;une question un 
&#171; focus &#187; (l&#146;objet sur lequel porte la question), des modificateurs du &#171; focus &#187; (les informations 
qui le qualifient) ou encore un ensemble de mots cl&#233;s &#224; trouver dans le voisinage de la r&#233;ponse. 
De m&#234;me, le prototype Q/R du LIA affecte &#224; chaque question une ou plusieurs &#233;tiquettes 
(class&#233;es par ordre de probabilit&#233; parmi une hi&#233;rarchie d&#146;&#233;tiquettes d&#233;duites des questions de 
TREC-9 et 10) ou m&#234;me &#171; unknown &#187; en cas d&#146;ind&#233;cision. L&#146;&#233;tiquetage de la question se fait de 
pr&#233;f&#233;rence &#224; partir d&#146;un &#233;tiqueteur &#224; base de r&#232;gles (reposant sur des motifs constitu&#233;s par des 
mots de la question ou leur &#233;tiquette syntaxique), et sinon &#224; partir d&#146;un &#233;tiqueteur probabiliste 
(B&#233;chet et al., 2000). 
Recherche des documents susceptibles de contenir la r&#233;ponse : le prototype Q/R du LIA ne 
contient pas de tel module mais d&#233;pend de la liste des 1000 premiers documents propos&#233;s par les 
organisateurs de la campagne en consid&#233;rant la question brute comme requ&#234;te. Il est &#224; noter qu&#146;il 
n&#146;y a aucune garantie que la r&#233;ponse &#224; la question soit effectivement comprise dans le jeu de 
documents fournis m&#234;me si elle est comprise dans le reste du corpus de r&#233;f&#233;rence. 
Reconnaissance des entit&#233;s nomm&#233;es : ce travail a &#233;t&#233; effectu&#233; par la soci&#233;t&#233; Sinequa 
(http://www.sinequa.com). Les entit&#233;s sont d&#233;tect&#233;es &#224; l'aide d'une cascade de transducteurs 
utilisant le contexte avoisinant (mots et &#233;tiquettes syntaxiques) ainsi que des traits s&#233;mantiques 
pr&#233;sents dans des lexiques. Une normalisation des noms propres ainsi qu'une r&#233;solution 
&#233;l&#233;mentaire d'anaphore (pour les pronoms personnels &#171; il &#187; et &#171; elle &#187;) a &#233;galement &#233;t&#233; faite. 
S&#233;lection de la r&#233;ponse : l&#146;approche du syst&#232;me QR du LIA pour la s&#233;lection des r&#233;ponses 
candidates repose sur l&#146;utilisation conjointe du moteur de recherche vectoriel SIAC (Bellot &amp; El-
B&#232;ze, 2000) et sur la localisation d&#146;une entit&#233; du type recherch&#233;. Ainsi, dans un premier temps, 
l&#146;ensemble des phrases de tous les documents est ordonn&#233; suivant le calcul d&#146;une proximit&#233; avec 
la question. Ensuite, un filtrage est effectu&#233; afin de conserver seulement les phrases contenant au 
moins une entit&#233; correspondant au type attendu et les noms propres apparaissant &#233;ventuellement 
dans la question. La r&#233;ponse du syst&#232;me est alors la premi&#232;re entit&#233; du  type attendu apparaissant 
dans la phrase. N&#233;anmoins, cette fa&#231;on de proc&#233;der a au moins deux faiblesses : l&#146;&#233;tape de 
filtrage, en &#233;cartant toutes les phrases de mani&#232;re trop draconienne, a parfois rendu impossible 
l&#146;extraction d&#146;une r&#233;ponse ; enfin, la s&#233;lection de la &#171; premi&#232;re &#187; entit&#233; pose probl&#232;me dans le cas 
ou plusieurs entit&#233;s du m&#234;me type sont pr&#233;sentes dans la m&#234;me phrase. 
</p>
<p>3 BC pour cr&#233;dibiliser et ordonner les r&#233;ponses 
</p>
<p>3.1 Bases de connaissances 
En raison des nouvelles contraintes introduites lors de la campagne TREC-11 : celle pour un 
syst&#232;me Q/R d'&#233;valuer la &#171; confiance &#187; qu'il a en une r&#233;ponse, mais aussi celle d&#146;ordonner 
l&#146;ensemble de celles-ci par ordre de &#171; certitude &#187; ; il nous a paru int&#233;ressant d&#146;associer &#224; notre 
prototype Q/R une source fiable de r&#233;ponses d&#233;j&#224; connues. Cette source a &#233;t&#233; mod&#233;lis&#233;e au 
travers d&#146;un module de bases de connaissances. 
En effet, la pr&#233;sence de telles bases permet de cr&#233;dibiliser une r&#233;ponse candidate. Ainsi, pour 
notre participation &#224; TREC-11, ce module a simplement eu une fonction de validation des 
r&#233;ponses sugg&#233;r&#233;es par le reste du syst&#232;me.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De plus, le choix d&#146;inclure un module de BC a &#233;t&#233; confort&#233; par un examen des questions des 
pr&#233;c&#233;dentes campagne TREC-QA, puisqu&#146;il est ais&#233;ment possible de constater qu&#146;un certain 
nombre d&#146;entre elles rel&#232;ve de sujets assimilables &#224; des th&#233;matiques de &#171; culture g&#233;n&#233;rale &#187; 
(g&#233;ographie, dates et faits historiques, noms d&#146;&#233;crivains et d&#146;&#156;uvres, etc.) mais &#233;galement que 
ces sujets sont fr&#233;quents (au sein d&#146;une m&#234;me campagne ou sein de l&#146;ensemble de celles-ci). 
Il est &#224; noter que de telles BC peuvent &#234;tre utilis&#233;es comme des listes de r&#233;ponses pr&#233;enregistr&#233;es 
qui serviraient alors de support &#224; une fouille dans un corpus de r&#233;f&#233;rence. L&#146;un des buts du crit&#232;re 
de r&#233;ponse support&#233;e &#233;tait d&#146;ailleurs d&#146;&#233;viter dans la mesure du possible un syst&#232;me Q/R 
compl&#232;tement architectur&#233; sur ce principe. Cependant, dans un tel cas, il est tout de m&#234;me 
int&#233;ressant de se demander, notamment au niveau applicatif, quel est l&#146;int&#233;r&#234;t de chercher &#224; 
nouveau une r&#233;ponse (ou une autre formulation d'une r&#233;ponse) qui est d&#233;j&#224; connue.  
&#192; plus long terme, l'objectif vis&#233; est de disposer d&#146;une source de connaissances de qualit&#233; pour 
servir d'amorces &#224; des it&#233;rations dont le but est d'extraire des connaissances similaires (motifs 
d'extraction, motifs de r&#233;ponses ; Soubbotin &amp; Soubbotin, 2001 ; Ravichandran &amp; Hovy, 2002) 
soit &#224; l&#146;int&#233;rieur du corpus, soit &#224; partir d&#146;Internet ; mais surtout d&#146;&#233;valuer et comparer la 
cr&#233;dibilit&#233; de diff&#233;rentes r&#233;ponses candidates (notamment au travers des relations permettant de 
l'&#233;tablir ou liant ses diff&#233;rents constituants). 
</p>
<p>3.1.1 Construction des BC 
Les &#171; connaissances &#187; ont &#233;t&#233; extraites de tableaux et de listes provenant de diff&#233;rents sites 
Internet de nature encyclop&#233;dique. En fait, l&#146;un des principaux crit&#232;res &#233;tait que ces informations 
soient pr&#233;sent&#233;es sous une forme fortement structur&#233;e pour en faciliter l&#146;extraction (manuelle) et 
qu&#146;elles soient en nombre suffisant. En outre, puisque ces connaissances sont destin&#233;es &#224; 
corroborer une r&#233;ponse candidate extraite par ailleurs d&#146;un document du corpus, le crit&#232;re de la 
fiabilit&#233; de leur provenance qui pourrait para&#238;tre primordial de prime abord ne l&#146;est pas. La 
fiabilit&#233; provient plut&#244;t de la convergence entre une r&#233;ponse candidate et sa pr&#233;sence dans les 
BC. Il est assez improbable qu'un document donne une m&#234;me r&#233;ponse fausse que celle contenue 
dans des BC de large couverture (tant du point de vue des questions que des r&#233;ponses). Dans un 
tel cas, et si cette r&#233;ponse est consid&#233;r&#233;e comme 
incorrecte, il est alors possible de se demander si les 
capacit&#233;s des syst&#232;mes &#224; &#233;valuer ne sont pas surestim&#233;es. 
</p>
<p>3.1.2 Contenu et couverture des BC 
Le choix du contenu des BC a &#233;t&#233; &#233;tabli d&#146;apr&#232;s un 
examen rapide de l&#146;ensemble des questions des 
campagnes TREC, en fonction : 
</p>
<p>&#8226; de la constance des th&#233;matiques d&#146;interrogation, 
cela afin d&#146;obtenir un taux de couverture suffisant sur l&#146;ensemble des pr&#233;c&#233;dentes campagnes 
TREC-QA (un pari a &#233;t&#233; fait sur le fait que ce taux reste stable sur le corpus TREC-2002) ;  
</p>
<p>&#8226; du fait que la r&#233;ponse attendue met en jeu des n-uples d&#146;entit&#233;s nomm&#233;es (par exemple : 
pays/capitale, nom de l&#146;inventeur/date/invention, etc.). 
</p>
<p>Ainsi, une partie des BC porte sur des lieux g&#233;ographiques comme : des cours d&#146;eau et les pays 
travers&#233;s, les capitales des pays ; mais aussi des personnages c&#233;l&#232;bres comme : les prix Nobels 
par ann&#233;e et disciplines, des &#233;crivains et leurs &#156;uvres, les dieux des panth&#233;ons grecs, romains ; 
ou encore des couples de mots : abr&#233;viations et d&#233;finitions, etc. 
De m&#234;me, dans le cadre des TREC-QA, 43 questions ont pour principal objet les &#201;tats-Unis 
d&#146;Am&#233;rique et portent notamment sur les attributs de ces &#233;tats : capitales, nom des gouverneurs, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>embl&#232;mes (oiseau, arbre, fleur), etc. Ces sujets ont &#233;galement donn&#233; lieu &#224; la cr&#233;ation de BC et, 
autant que possible, ces bases ont &#233;t&#233; enrichies par la version &#171; extra-am&#233;ricaine &#187; (cf. Tableau 
1 ; pour une th&#233;matique, le chiffre avant le + repr&#233;sente le nombre de questions centr&#233;es sur les 
USA et le chiffre apr&#232;s le + correspond au nombre portant sur d&#146;autres pays). 
Enfin, il est apparu que certaines questions revenaient sous une forme identique lors des 
campagnes TREC suivantes. Aussi chacun des jeux des couples Q/R des TREC-QA pr&#233;c&#233;dents 
peut &#234;tre consid&#233;r&#233; comme une base d'archives pour la campagne suivante. Il est &#224; noter qu'il 
s'agit l&#224; d'une approche sujette &#224; caution : la r&#233;ponse &#224; une m&#234;me question peut varier d'ann&#233;e en 
ann&#233;e, tout comme son degr&#233; d'exactitude qu'il s'agisse d'exigences provenant de l'&#233;valuation ou 
m&#234;me de variation dans le jugement de la notion d'exactitude (Lavenus &amp; Lapalme, &#224; para&#238;tre). 
</p>
<p>Au final, le module de BC comprend 36 bases de connaissances th&#233;matiques et assure une 
couverture de l&#146;ordre de 10% &#224; 12% des r&#233;ponses par 
campagne TREC (cf. Tableau 2). 
</p>
<p>4 Strat&#233;gie d'ordonnancement des 
r&#233;ponses 
</p>
<p>Dans le prototype Q/R du LIA, les informations 
disponibles qui permettent d'&#233;tablir une pr&#233;f&#233;rence dans les r&#233;ponses sont les suivantes : 
</p>
<p>&#8226; une &#233;tiquette de r&#233;ponse attendue ainsi que sa probabilit&#233; associ&#233;e. Cette affectation a lieu au 
niveau du module d'&#233;tiquetage. En cas d'&#233;chec ou d'incapacit&#233;, cette &#233;tiquette peut &#234;tre 
&#171; unknown &#187; et dans ce cas le syst&#232;me ne &#171; sait plus &#187; r&#233;pondre (car le processus de s&#233;lection 
repose sur la correspondance &#171; &#233;tiquette attendue&#8596;entit&#233; nomm&#233;e &#187;) ; 
</p>
<p>&#8226; le fait que les bases de connaissances corroborent une r&#233;ponse trouv&#233;e par SIAC. Cette 
r&#233;ponse peut &#234;tre jug&#233;e comme fiable puisque propos&#233;e par deux syst&#232;mes ind&#233;pendants ; 
</p>
<p>&#8226; si aucune r&#233;ponse n&#146;a &#233;t&#233; 
trouv&#233;e, la r&#233;ponse donn&#233;e 
par le syst&#232;me est &#171; NIL &#187;. 
</p>
<p>Cependant, dans ce dernier cas, 
une nuance doit &#234;tre apport&#233;e pour 
notre prototype Q/R. En effet, 
aucun module sp&#233;cifique n'a &#233;t&#233; 
cr&#233;&#233; pour v&#233;rifier l'absence d'une 
r&#233;ponse. Il ne comprend pas non 
plus de processus it&#233;ratif qui permettrait de rel&#226;cher des contraintes afin d'&#233;largir la liste des 
r&#233;ponses envisageables. Et, pire, il lui arrive parfois d'&#233;carter abusivement les r&#233;ponses propos&#233;es 
par SIAC, en particulier durant une &#233;tape de filtrage lorsque aucune entit&#233; nomm&#233;e du type 
attendu n'est pr&#233;sente dans la phrase retourn&#233;e. Ainsi, il appara&#238;t que le fait qu'une r&#233;ponse ne 
peut &#234;tre trouv&#233;e ne doit pas &#234;tre consid&#233;r&#233;e comme une absence cat&#233;gorique de r&#233;ponse dans le 
corpus mais juste comme une pr&#233;somption d'absence. 
&#192; partir de ces consid&#233;rations, une strat&#233;gie (cf. Tableau 3) a &#233;t&#233; mise au point pour ordonner les 
r&#233;ponses du syst&#232;me et notamment positionner en premier les r&#233;ponses cr&#233;dibilis&#233;es par les BC. 
&#192; l&#146;int&#233;rieur de chacun des 1er et 2nd groupes, les r&#233;ponses sont ordonn&#233;es d'abord suivant la 
difficult&#233; de reconnaissance des entit&#233;s nomm&#233;es correspondant &#224; l'&#233;tiquette attendue (ordre 
obtenu exp&#233;rimentalement) et ensuite suivant la probabilit&#233; d&#233;croissante de ces &#233;tiquettes. Enfin, 
les r&#233;ponses du 3e groupe peuvent &#234;tre consid&#233;r&#233;es comme des r&#233;ponses &#171; NIL &#187; par d&#233;faut. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 R&#233;sultats obtenus et apport des 
BC 
</p>
<p>Le tableau 4 pr&#233;sente les r&#233;sultats officiels obtenus 
par le prototype Q/R du LIA &#224; la campagne TREC-
QA de 2002. Notre soumission a obtenu un score de 
0.246 en r&#233;pondant correctement &#224; 52 questions sur 
les 500 de la campagne. 
Apr&#232;s analyse, les BC interviennent dans 30 des Q/R et permettent d'asseoir correctement la 
cr&#233;dibilit&#233; de 24 r&#233;ponses. Sur les six restantes et jug&#233;es non &#171; correctes &#187; :  
</p>
<p>&#8226; trois d&#146;entre elles sont non support&#233;es. C&#146;est-&#224;-dire que les BC permettent de corroborer une 
bonne r&#233;ponse mais que le document dont SIAC l&#146;extrait ne permet pas de l&#146;&#233;tablir. Il s&#146;agit 
d&#146;un effet pervers d&#146;une s&#233;lection des r&#233;ponses candidates bas&#233;e seulement sur le type de 
l&#146;&#233;tiquette ; 
</p>
<p>&#8226; deux sont incorrectes pour des probl&#232;mes d&#146;ordre de grandeur. Il s&#146;agit de questions portant 
sur les populations &#171; actuelles &#187; de Mexico et d&#146;Afrique du Sud. Les r&#233;ponses retourn&#233;es 
(soulign&#233;es) bien que compatibles avec les donn&#233;es des BC, sont des populations &#224; une 
&#171; &#233;ch&#233;ance &#187; &#224; savoir &#171; Mexico's population will reach 100 million in the year 2000. &#187; et &#171; it expected the 
total population to be more than 42 million people, based on the census in 1991, when South Africa's total 
population was estimated to be 38 million. &#187;. Les motifs des r&#233;ponses correctes attendues &#233;taient 
respectivement &#171; 98.1 million &#187; et &#171; (37.9|38|41.8|42) million &#187;. 
</p>
<p>&#8226; enfin, la derni&#232;re &#171; When did George W. Bush get elected as the governor of Texas? &#187; s&#146;est vue 
r&#233;pondre par la date de la prise de fonction (&#171; In January  1995 , when George W. Bush took office as 
governor &#187;) plut&#244;t que celle de l&#146;&#233;lection (les r&#233;ponses correctes &#171; 1994 &#187; ou &#171; 1998 &#187;). 
</p>
<p>Apr&#232;s que les motifs des r&#233;ponses ont &#233;t&#233; communiqu&#233;s, nous avons &#233;valu&#233; notre prototype sans 
le module de BC : il n'identifie alors plus que 34 r&#233;ponses correctes. Cette diff&#233;rence s'explique 
par le fait que, dans ce cas, l'entit&#233; nomm&#233;e extraite de la phrase retourn&#233;e est la premi&#232;re du type 
attendue et non plus celle issue de la BC. 
Enfin, le composant d'ordonnancement utilis&#233; pour notre soumission comportait une erreur : la 
probabilit&#233; d&#233;croissante des &#233;tiquettes n'&#233;tait pas prise en compte comme initialement pr&#233;vu sur 
les groupes 2 et 3. Cette correction a entra&#238;n&#233; une hausse d'environ 9% dans le score (de 0,246 &#224; 
0,268) et a une influence encore plus flagrante dans le cas d'une utilisation sans BC puisque la 
progression est alors de +65% (de 0,084 &#224; 0,139). 
La figure 1 (page suivante, d&#146;apr&#232;s Voorhees, 2002) permet de visualiser &#224; quel point, une bonne 
strat&#233;gie d&#146;ordonnancement permet de s&#146;approcher d&#146;une courbe id&#233;ale (en noir) dans le cadre 
d&#146;une &#233;valuation TREC-2002. Ainsi, bien que notre prototype r&#233;ponde &#224; seulement 52 questions 
il parvient assez bien &#224; classer ses bonnes r&#233;ponses. En 
effet, un point situ&#233; plus haut et plus &#224; gauche d&#146;un autre 
est un syst&#232;me qui ordonne mieux ses r&#233;ponses qu&#146;il ne 
r&#233;pond correctement. 
</p>
<p>6 Conclusion 
Pour notre premi&#232;re participation &#224; la piste TREC-QA, 
notre objectif &#233;tait de cr&#233;er un prototype qui nous 
permette d&#146;&#233;tudier la probl&#233;matique des syst&#232;mes Q/R, 
mais &#233;galement d&#146;envisager les premi&#232;res briques d&#146;une 
strat&#233;gie mettant en avant la cr&#233;dibilit&#233; des r&#233;ponses. 
Certains modules de notre syst&#232;me Q/R doivent &#234;tre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>am&#233;lior&#233;s comme celui concernant l&#146;&#233;tiquetage des questions mais cela n&#146;&#233;tait pas une priorit&#233; 
pour notre premi&#232;re participation &#224; TREC. 
Ainsi, les r&#233;sultats obtenus d&#233;notent une bonne orientation puisque les r&#233;ponses trouv&#233;es le sont 
avec une confiance &#233;lev&#233;e et cela gr&#226;ce &#224; l&#146;usage des BC comme moyen de certification. En 
outre, dans le cadre de TREC-QA, il est possible d&#146;inclure ais&#233;ment un sous-ensemble des Q/R 
d&#146;au minimum 10% dans de telles bases (principalement les questions portant sur des  
n&#150;uples d&#146;entit&#233;s nomm&#233;es ou des faits &#233;tablis). 
Il faut cependant nuancer l&#146;usage de ces BC. En effet, si elles remettent partiellement en cause le 
principe de la t&#226;che de Q/R, il appara&#238;t rapidement qu&#146;il est difficile de constituer des bases 
exhaustives (toutes les questions n&#146;autorisent pas des r&#233;ponses pr&#233;-calcul&#233;es). Cela est d&#146;autant 
plus vrai dans le cadre des questions ouvertes puisque leur domaine n&#146;est pas connu (pour  notre 
prototype, une th&#233;matique donne lieu &#224; une BC). De m&#234;me, dans le cadre du probl&#232;me de leur 
couverture l&#146;int&#233;r&#234;t d&#146;utiliser de telles bases plut&#244;t qu&#146;une redondance issue d&#146;Internet est &#224; 
d&#233;montrer. Et, comme pour toutes les bases de donn&#233;es, se pose le probl&#232;me de leur dur&#233;e de vie, 
de leur mise &#224; jour mais aussi de leur int&#233;gration/utilisation dans d&#146;autres langues que celle de 
leur contenu. 
</p>
<p>R&#233;f&#233;rences 
B&#233;chet F., Nasr A., Genet F. (2000), &#147;Tagging Unknown Proper Names Using Decision Trees&#148;, in Proc. 
of ACL'2000, Hong-Kong, Chine, p.77-84. 
Bellot P., Crestan E., El-B&#232;ze M., Gillard L., de Loupy C. (&#224; para&#238;tre), &#147;Coupling Named Entity 
Recognition, Vector-Space Model and Knowledge Bases for TREC-11 Question Answering Track&#148; in 
Proceedings of the 11th Text REtrieval Conference. 
Bellot P. &amp; El-B&#232;ze M. (2000), &#147;Clustering by means of decision trees without learning or hierarchical 
and K-Means like algorithms&#148;, RIAO'2000, Paris, p.344-363. 
Ferret O., Grau B., Hurault-Plantet M., Illouz G., Monceaux L., Robba I., Vilnat A. (2002), &#171; Recherche 
de la r&#233;ponse fond&#233;e sur la reconnaissance du focus de la question &#187;, TALN2002, 24-27 juin Nancy, 
p.307-316. 
Kupiec J. (1993), &#147;Murax: A robust linguistic approach for question answering using an on-line 
encyclopedia&#148;, in Proceedings of the 16th annual international ACM SIGIR conference, Pittsburgh, PA, 
USA, pp. 181-190. 
Lavenus K. &amp; Lapalme G. (&#224; para&#238;tre), &#171; &#201;valuation des syst&#232;mes de question r&#233;ponse - Aspects 
m&#233;thodologiques &#187;, dans la revue Traitement Automatique des Langues. 
Ravichandran D. &amp; Hovy E.H. (2002), &#147;Learning Surface Patterns for a Question Answering System.&#148; In 
Proceedings of the ACL conference, Philadelphie, USA, p. 41-47. 
Soubbotin M.M. &amp; Soubbotin S.M. (2001), &quot;Patterns of Potential Answer Expressions as Clues to the 
Right Answers&quot; in Proceedings of the 10th  Text Retrieval Conference (TREC-10), p.175-182, 
Gaithersburg, Maryland. 
Voorhees E. (2002), &#147;Overview of the TREC 2002 Question Answering Track&#148;, 
http://trec.nist.gov/pubs/trec11/papers/QA11.pdf. </p>

</div></div>
</body></html>