<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La distance intertextuelle pour la classification de textes en langue arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;cital 2009, Senlis, 24-26 juin 2009 
</p>
<p>La distance intertextuelle pour la classification de textes en langue 
arabe 
</p>
<p> 
</p>
<p>AYADI Rami (1), JAOUDI Walid (2) 
 
</p>
<p>(1) UTIC (monastir) &#8211; ISIMS (sfax) ,Tunisie 
ayadi.rami@planet.tn  
</p>
<p> 
</p>
<p>(2) UTIC (Tunis) , Tunisie 
walidjaouadi@yahoo.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233; : Nos travaux de recherche s&#8217;int&#233;ressent &#224; l&#8217;application de la th&#233;orie de la distance 
intertextuelle sur la langue arabe en tant qu&#8217;outil pour la classification de textes. Cette th&#233;orie 
traite de la classification de textes selon des crit&#232;res de statistique lexicale, se basant sur la 
notion de connexion lexicale. Notre objectif est d&#8217;int&#233;grer cette th&#233;orie en tant qu&#8217;outil de 
classification de textes en langue arabe. Ceci n&#233;cessite l&#8217;int&#233;gration d&#8217;une m&#233;trique pour la 
classification de textes au niveau d&#8217;une base de corpus lemmatis&#233;s &#233;tiquet&#233;s et identifi&#233;s 
comme &#233;tant des r&#233;f&#233;rences d&#8217;&#233;poques, de genre, de th&#232;mes litt&#233;raires et d&#8217;auteurs et ceci afin 
de permettre la classification de textes anonymes. 
</p>
<p>Abstract: Our researche works are interested in the application of the intertextual distance 
theory on the Arabic language as a tool for the classification of texts. This theory handles the 
classification of texts according to criteria of lexical statistics, and it is based on the lexical 
connection approach. Our objective is to integrate this theory as a tool of classification of 
texts in Arabic language. It requires the integration of a metrics for the classification of texts 
using a database of lemmatized and identified corpus which can be considered as a literature 
reference for times, genres, literary themes and authors and this in order to permit the 
classification of anonymous texts. 
</p>
<p>Mots-cl&#233;s :   Distance intertextuelle, arabe, classification, lemmatisation, corpus, 
statistique lexicale. 
Keywords:   Intertextual distance, Arabic, classification, lemmatization, corpus, lexical    
statistics. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AYADI Rami, JAOUDI Walid 
</p>
<p>1 Introduction 
L'abondance de l'information, due au d&#233;veloppement de l'Internet, des supports de stockage 
(contenant de larges corpus textuels) et des encyclop&#233;dies num&#233;ris&#233;es, rend difficile, voir 
impossible, son exploration et analyse. D'o&#249; na&#238;t le besoin d'explorer de nouvelles approches 
automatiques d'aide &#224; l'analyse des textes.  
</p>
<p>Plusieurs travaux se sont int&#233;ress&#233;s &#224; la mise en place d'un certain nombre d'outils pour l'aide 
&#224; l'analyse, bien que suivant diff&#233;rents axes. Nous citons les travaux de Lebart et Salem 
(Lebart, 1988), Salton (Salton, 1989) et Reinhart (Reinhart,1994) qui ont explor&#233; l'utilisation 
des classificateurs pour la structuration de l'information au niveau des textes sous forme de 
r&#233;seaux lexicaux et s&#233;mantiques. D'autres travaux ont repris les pr&#233;c&#233;dents classificateurs pour 
en exploiter les r&#233;sultats, tel que les travaux de Deerwester (Deerwester, 1990) traitant de la 
s&#233;mantique latente et plus pr&#233;cis&#233;ment l'exploration dans la cat&#233;gorisation automatique des 
textes en associant ces classes lexicales &#224; des plans g&#233;n&#233;raux de classification. C'est dans cet 
axe de classification de textes que s&#8217;inscrivent nos travaux de recherche. Nous nous proposons 
dans ce cadre, d'aborder la probl&#233;matique de cat&#233;gorisation et d'indexation de textes en langue 
arabe. Pour ce faire, nous partons des constations et des r&#233;sultats de classificateurs bas&#233;s sur 
des approches statistique et math&#233;matique.  
</p>
<p>La classification de textes est d&#233;finie comme une op&#233;ration qui identifie des classes 
d'&#233;quivalence entre des segments de textes en tenant compte de leur contenu informationnel 
(mots, n-gram, etc.). De ce fait nous sommes amen&#233;s &#224; d&#233;finir le degr&#233; de ressemblance ou de 
dissemblance entre les segments consid&#233;r&#233;s. En nous situant dans le cadre d'une approche 
statistique et math&#233;matique, nous avons la possibilit&#233; d'expliciter ce degr&#233; par des indices 
num&#233;riques. Plusieurs approches permettent de d&#233;finir chacune une m&#233;thode pour calculer ce 
degr&#233; de ressemblance ou dissemblance; Notamment la th&#233;orie de la distance intertextuelle 
qui a &#233;t&#233; introduite par Charles Muller (Muller, 1977) &#224; la fin des ann&#233;es soixante sous le nom 
de connexion lexicale pour r&#233;pondre au besoin de d&#233;finir une m&#233;trique pour la mesure du 
degr&#233; de parent&#233; ou similitude entre textes. Cette th&#233;orie se base sur des statistiques relatives 
aux vocabulaires et expressions employ&#233;s dans les textes, ce qui cr&#233;e un besoin de 
d&#233;composition selon un jeu de classes grammaticales des textes et ceci par le biais de 
lemmatiseurs.  
</p>
<p>Nous nous proposons de mettre en place un classificateur dot&#233; d'une m&#233;trique et d'un outil 
pour la pr&#233;paration des textes aux diff&#233;rents traitements (un lemmatiseur) (Jaouadi, 2006). En 
raison des sp&#233;cificit&#233;s de la langue arabe (caract&#232;re agglutinatif, richesse des classes 
grammaticales, etc.), nous sommes amen&#233;s &#224; concevoir une m&#233;trique et un lemmatiseur ayant 
un caract&#232;re g&#233;n&#233;rique, pr&#233;sentant un degr&#233; d'abstraction par rapport au choix des classes 
grammaticales lors de la segmentation ou d&#233;coupage du texte.  
</p>
<p>S'ajoute &#224; cela un besoin de mettre en place un r&#233;f&#233;rentiel pour la classification des textes sous 
forme de corpus structur&#233;s. Ce r&#233;f&#233;rentiel renferme des corpus d&#233;finis et cat&#233;goris&#233;s servant 
comme rep&#232;re pour la classification. Cette d&#233;finition du processus nous a permis de r&#233;aliser 
une plateforme de classification de textes en langue arabe. Cette plate-forme pr&#233;sente un 
lemmatiseur g&#233;n&#233;rique &#224; base d'apprentissage qui permet d'&#233;tiqueter des textes en laissant &#224; 
l'utilisateur le choix du jeu d'&#233;tiquettes &#224; employer. Elle offre aussi un classificateur utilisant 
une version am&#233;lior&#233;e de la formule issue de la th&#233;orie de la distance intertextuelle qui permet 
d'associer au jeu d'&#233;tiquetage la notion de poids. Pour finir nous avons associ&#233; &#224; cette plate </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La distance intertextuelle pour la classification de textes en langue arabe 
</p>
<p>forme une structure permettant d'accueillir le r&#233;f&#233;rentiel de classification sous forme de corpus 
cat&#233;goris&#233;s et s&#233;lectionn&#233;s. 
</p>
<p>2  Architecture du syst&#232;me de classification 
Le syst&#232;me que nous r&#233;alisons a pour but essentiel de permettre la classification de textes en 
langue arabe dans un but de cat&#233;gorisation et d'indexation. Pour ce faire nous nous proposons 
de d&#233;finir un processus de traitement permettant d'avoir en entr&#233;e un texte brut et de pr&#233;senter 
en sortie la cat&#233;gorisation de ce dernier. Cette cat&#233;gorisation peut se faire par rapport &#224; une 
r&#233;f&#233;rence existante ou par rapport &#224; un autre texte en entr&#233;e. Notre utilisation de la th&#233;orie de 
la distance intertextuelle pour la mise en place d'une m&#233;trique de classification nous contraint 
&#224; l'int&#233;gration d&#8217;un processus  de lemmatisation des textes (Pr&#233;traitement). Cette &#233;tape est 
n&#233;cessaire car elle pr&#233;pare les textes en les d&#233;composant ce qui permet l'exploitation des 
structures grammaticales dans la d&#233;tection des classes d'&#233;quivalence entre segments de textes. 
Nous avons exploit&#233; la richesse de la grammaire de la langue arabe pour int&#233;grer la notion de 
classes grammaticales au niveau du lemmatiseur ainsi que dans la m&#233;trique, de cette mani&#232;re 
le lemmatiseur fonctionne ind&#233;pendamment du jeu de la structure adopt&#233; et nous introduisons 
des poids associ&#233;s aux classes grammaticales au niveau de la m&#233;trique.  
</p>
<p> 
</p>
<p>Figure 1 : D&#233;finition du processus 
</p>
<p>2.1 Un lemmatiseur hybride g&#233;n&#233;rique &#224; base d&#8217;apprentissage 
</p>
<p>2.1.1  Outil de lemmatisation : 
</p>
<p>Nous parlerons de syst&#232;me et non d'application en raison de la complexit&#233; des interactions 
entre les diff&#233;rents composants. En effet, notre syst&#232;me est une hybridation de diff&#233;rentes 
approches h&#233;t&#233;rog&#232;nes collaborant ensemble dans un syst&#232;me homog&#232;ne et transparent par 
apport &#224; son environnement. 
</p>
<p>Nous avons construit notre lemmatiseur en nous inspirant des diff&#233;rentes approches d&#233;j&#224; 
existantes et nous avons essay&#233; de les int&#233;grer pour mettre en place un syst&#232;me performant. 
Nous avons retenu les notions suivantes : 
</p>
<p>&#8226; Reconnaissance de forme : Chaque mot en cours de traitement subit une recherche au 
niveau de la base de donn&#233;es de r&#233;f&#233;rence pour voir s'il ne repr&#233;senterait pas : 
- Un cas particulier (nom propre, chiffre, pr&#233;position, adverbe,&#8230;) 
- Une racine ou un lexique 
- Un cas d&#233;j&#224; trait&#233; par le lemmatiseur </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AYADI Rami, JAOUDI Walid 
</p>
<p>Ces &#233;l&#233;ments sont class&#233;s dans la base de donn&#233;es sous forme de mod&#232;les. Par 
comparaison, il est possible de rattacher un mot &#224; un mod&#232;le et d'extraire ainsi sa 
d&#233;composition. 
</p>
<p>&#8226; Algorithme de lemmatisation : Nous notons que la structure de la langue impose 
l'algorithme &#224; utiliser. Dans le cas de la langue arabe, nous nous sommes inspir&#233;s de 
l'algorithme utilis&#233; par Tim Buckwalter pour r&#233;aliser des analyses morphologiques sur des 
transcriptions de textes en langue arabe. Notre algorithme se base sur le principe de la 
g&#233;n&#233;ration &#224; partir d'un mot des diff&#233;rentes possibilit&#233;s de pr&#233;fixes, suffixes et corps 
sch&#233;matique puis ne garder que le trio qui appartient &#224; une base de r&#233;f&#233;rence c'est-&#224;-dire 
dont le pr&#233;fixe, le suffixe et le corps sch&#233;matique appartiennent &#224; la langue. 
Le principe pour des textes &#233;crits en arabe reste plus ou moins le m&#234;me &#224; part quelques 
changements et enrichissements que nous avons apport&#233;s au niveau des pr&#233;fixes et 
suffixes, en effet, par consultation d'un expert nous avons pu reconstruire l'ensemble des 
pr&#233;fixes et suffixes de la langue arabe que nous avons impl&#233;ment&#233; en caract&#232;re arabe pour 
permettre la reconnaissance par rapport &#224; des textes non transcris. Par rapport &#224; la 
structure, tr&#232;s r&#233;pandue, en cinq composantes des mots en langue arabe (&#224; savoir ant&#233;fixe, 
pr&#233;fixe, corps sch&#233;matique, suffixe, postfixe), nous supposerons dans notre algorithme que 
la combinaison (ant&#233;fixe+ pr&#233;fixe) forme un &#233;l&#233;ment &#224; savoir le pr&#233;fixe et la combinaison 
(suffixe+ postfixe) forme un suffixe. Cette fusion permet de minimiser le nombre de 
d&#233;compositions possibles sans pour autant en diminuer la pr&#233;cision. Le fait de fusionner 
ainsi des &#233;l&#233;ments diminue le nombre de possibilit&#233;s g&#233;n&#233;r&#233;es &#224; partir d'un seul mot, de 
plus le fait qu'on conna&#238;t les &#233;l&#233;ments fusionn&#233;s on peut apr&#232;s leur d&#233;tection les 
d&#233;composer plus facilement. L'exemple de la figure 2 illustre ce jeu de combinaisons. 
 
</p>
<p> 
</p>
<p>Figure 2 : Combinaison d'&#233;l&#233;ments 
</p>
<p>&#8226; La lemmatisation manuelle : Il est tr&#232;s difficile d'arriver &#224; automatiser la 
lemmatisation, l'intervention humaine reste in&#233;vitable que ce soit au niveau applicatif 
ou niveau de la v&#233;rification. Pour cela, nous ne manquons pas de noter que la 
lemmatisation manuelle est le dernier recours de notre syst&#232;me. Un des probl&#232;mes 
pos&#233;s par les approches pr&#233;c&#233;demment cit&#233;es est le fait que par leur traitement elles 
puissent g&#233;n&#233;rer plusieurs d&#233;compositions possibles. A ce niveau aussi on note 
l'intervention humaine qui oriente la r&#233;solution soit par un choix soit par l'appel &#224; une 
des autres approches int&#233;gr&#233;es dans notre syst&#232;me. 
</p>
<p>Les m&#233;thodes de lemmatisation retenues, &#224; savoir la lemmatisation &#224; base de mod&#232;les, 
manuelle et &#224; base d'algorithme, m&#234;me si diff&#233;rentes en apparence, repr&#233;sentent les piliers de 
notre syst&#232;me, nous avons mis en place des interfaces permettant la communication entre elles </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La distance intertextuelle pour la classification de textes en langue arabe 
</p>
<p>ainsi qu'un ordonnancement permettant l'optimisation de leur utilisation. L'int&#233;gration des 
trois approches se fait de mani&#232;re s&#233;quentielle l'une apr&#232;s l'autre, lorsqu'une s'endigue l'autre 
prend le relais. Il est &#224; noter que chacune de ses &#233;tapes interagit avec la base de connaissance 
que ce soit en consultation, ou mise &#224; jour.                    
</p>
<p>2.1.2   La base de donn&#233;es r&#233;f&#233;rences : 
</p>
<p>En nous basant sur les besoins en donn&#233;es exprim&#233;es au niveau du syst&#232;me pr&#233;c&#233;demment 
d&#233;taill&#233; nous avons mis en place la structure de la base de donn&#233;es de r&#233;f&#233;rence. 
Les &#233;l&#233;ments de base : Cette base de donn&#233;es constitue le noyau du syst&#232;me que nous avons 
r&#233;alis&#233; en collaboration avec un expert de la langue arabe, elle inclue : 
-  Un lexique : il englobe deux entit&#233;s &#224; savoir les mots non d&#233;composables en pr&#233;fixe, suffixe 
 et corps sch&#233;matique et les racines (ou corps sch&#233;matique n&#233;cessaire &#224; l'algorithme de 
d&#233;composition). Notre source initiale au niveau de l'alimentation du lexique est un fichier 
XML contenant un dictionnaire ayant pour origine les travaux de Belgacem Mohamed et Mars 
Mourad. 
- Les cas particuliers : Nous aurions pu inclure cette classe au niveau du lexique mais il est 
plus int&#233;ressant de les s&#233;parer pour faciliter le traitement. Elle inclue les pr&#233;positions les noms 
propres, les articles&#8230;Nous avons essay&#233; de d&#233;terminer l'ensemble de ces &#233;l&#233;ments par 
collaboration avec un expert de la grammaire arabe qui nous a permit de les synth&#233;tiser 
(jaouadi 2006). 
- Les cas trait&#233;s : repr&#233;sente les mots d&#233;j&#224; trait&#233;s que ce soit par d&#233;composition ou par ajout de 
l'utilisateur. Ils sont stock&#233;s avec leur d&#233;composition de fa&#231;on &#224; &#234;tre utilis&#233; par le module de 
reconnaissance de formes. 
</p>
<p>-  Pr&#233;fixes et suffixes : sont des &#233;l&#233;ments indispensables &#224; l'algorithme de lemmatisation. Nous  
avons pu avec l'aide de l'expert d&#233;terminer un ensemble de 77 pr&#233;fixes et de 165 suffixes au 
niveau de la langue arabe. 
</p>
<p>2.2 Une formule de calcul bas&#233;e sur la pond&#233;ration des classes 
grammaticales 
</p>
<p>La distance intertextuelle est la mesure de degr&#233; de ressemblance ou de dissemblance entre 
textes. 
</p>
<p>Pour pouvoir dire si des textes sont &#171; plut&#244;t proches &#187; ou &#171; plut&#244;t &#233;loign&#233;s &#187; par rapport a  
l&#8217;utilisation d&#8217;un vocabulaire commun, on cherche &#224; exprimer par un nombre, de propri&#233;t&#233;s &#8211; 
la ressemblance ou la dissemblance &#8211; qui ne sont pas des nombres. De plus, pour pouvoir 
r&#233;p&#233;ter cette mesure autant de fois que l&#8217;on voudra, il faudra encore transformer la mesure 
absolue en un indice qui doit r&#233;pondre &#224; l&#8217;ensemble des propri&#233;t&#233;s suivantes (Labb&#233;, 2003): 
</p>
<p>On recherche donc un indice D : 
</p>
<p>&#8226; insensible aux diff&#233;rences de taille entre les textes compar&#233;s : la taille du texte ne 
doit pas influer sur l&#8217;indice. 
</p>
<p>&#8226; applicable &#224; plusieurs textes et, potentiellement, &#224; tous les textes d&#8217;une m&#234;me langue </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AYADI Rami, JAOUDI Walid 
</p>
<p>&#8226; variant uniform&#233;ment : entre 0 (m&#234;me vocabulaire et fr&#233;quence semblable de chacun 
des mots dans les deux textes) et 1 (aucun vocable en commun) et ceci sans saut ni 
effet de seuil autour de certaines valeurs. 
</p>
<p>&#8226; sym&#233;trique (soit deux textes A et B alors D (A, B) = D (B, A)). 
</p>
<p>&#8226; V&#233;rifiant l&#8217;in&#233;galit&#233; triangulaire : D (A, B) &#8804; D (A, C) + D(C, B).Ce qui revient &#224; 
dire que le chemin entre deux individus sera toujours plus long si l&#8217;on passe par un 
troisi&#232;me (a moins que ce troisi&#232;me soit confondu avec l&#8217;un des deux premiers).  
</p>
<p>&#8226; L&#8217;indice doit &#234;tre  &#171; transitif &#187; : quand on agr&#232;ge le vocabulaire de deux textes, les 
distances de ce nouveau vis-&#224;-vis des autres textes doit refl&#233;ter l&#8217;ordre des distances 
</p>
<p>             ant&#233;rieures (si D(A,B) &gt; D(A,C) &gt; D(B,C) alors D(A,B) &gt; D{A,(B*C)] ) . 
</p>
<p>&#8226; Aussi &quot;robuste&quot; que possible (i.e. une modification marginale dans le vocabulaire 
d'un des deux textes doit se traduire par une variation marginale de l&#8217;indice)&#8230; 
</p>
<p>Les conditions &#233;nonc&#233;es pr&#233;c&#233;demment sont une synth&#232;se r&#233;alis&#233;e par D.Labb&#233; (labb&#233;, 2003) 
de la th&#233;orie &#233;nonc&#233;e par C.Muler (Muller, 1977) et que les formules qu&#8217;on trouve dans la 
litt&#233;rature ne r&#233;pondent pas toutes &#224; toutes  les conditions. 
</p>
<p>2.2.1  Formulation math&#233;matique de la distance intertextuelle  
</p>
<p>Nous ne tiendrons compte que de la formulation de Labb&#233; &#233;tant donn&#233; qu&#8217;elle repr&#233;sente la 
derni&#232;re am&#233;lioration des formules issue de la distance intertextuelle. 
</p>
<p>Soit deux textes A et B  
</p>
<p> Va et Vb : nombre de vocables dans A et B (vocabulaire) 
 Fia : fr&#233;quence du vocable i dans A  
 Fib : fr&#233;quence du vocable i dans B 
 Na et Nb : nombre de mots dans A et B (taille) avec Na = &#931; Fia et Nb = &#931; Fib 
 V&#8217;b(E) : Nombre r&#233;duit de vocable du texte B 
 Fia : Fr&#233;quence du i&#232;me terme du vocabulaire du texte A  
 Eia(u) : Fr&#233;quence r&#233;duite du i&#232;me terme du vocabulaire du texte A dans le texte B 
 U(a,b) : rapport entre les tailles des textes A et B 
 N&#8217;b : nombre de mots r&#233;duits du texte B : N&#8217;b=&#8721;
</p>
<p>bV
uiaE )(   
</p>
<p>&#8226; Distance absolue DVa,b(u) : entre le vocabulaire du texte A et B&#8217; (B&#8217;=la r&#233;duction de 
B &#224; la taille de A) 
</p>
<p>( 1) 
</p>
<p>'
</p>
<p>( )
</p>
<p>, ( ) ( )
,a b E
</p>
<p>Va b u ia ia u
V V
</p>
<p>D F E= &#8722;&#8721;
 
</p>
<p>( ) ( , )*ia u ib a bE F U=  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La distance intertextuelle pour la classification de textes en langue arabe 
</p>
<p>&#8226; Distance relative D(a,b): Quand A et B n'ont aucun mot en commun, la distance entre 
eux sera &#233;gale &#224; Na + N&#8217;b. Cette somme sera naturellement plac&#233;e au d&#233;nominateur 
de la formule de l'indice de la distance (1) : ainsi la valeur maximale sera &#233;gale &#224; 1 et, 
l'indice sera n&#233;cessairement inf&#233;rieur &#224; 1 quand l'intersection des deux textes ne sera 
pas vide (ce qui sera toujours le cas lorsqu'ils sont &#233;crits dans la m&#234;me langue). 
</p>
<p>( 2) 
</p>
<p>' '
</p>
<p>( ) ( )
</p>
<p>( ) ( )
, ,
</p>
<p>( , ) '
( )
</p>
<p>a b E a b E
</p>
<p>ia ia u ia ia u
V V V V
</p>
<p>a b
ia ia u a b
</p>
<p>F E F E
D
</p>
<p>F E N N
</p>
<p>&#8722; &#8722;
</p>
<p>= =
</p>
<p>+ +
</p>
<p>&#8721; &#8721;
</p>
<p>&#8721; &#8721;
 
</p>
<p>  
</p>
<p>                      
</p>
<p> 
</p>
<p>2.2.2 Motivation et nouvelle orientation 
</p>
<p>Notre approche de la th&#233;orie de la distance intertextuelle est essentiellement motiv&#233;e par un 
besoin de d&#233;finir une m&#233;trique pour la classification de textes en langue arabe. Ceci &#233;tant 
notre point de d&#233;part, nous avons consid&#233;r&#233; le probl&#232;me de ce point de vue pour reformuler la 
probl&#233;matique afin qu&#8217;elle r&#233;ponde plus &#224; nos besoins. Nous en avons retenu les points 
suivants : 
</p>
<p>&#1; La formule de Labb&#233; est notre point de d&#233;part 
&#1; La distance intertextuelle se base essentiellement sur les vocabulaires respectifs des 
</p>
<p>textes &#224; comparer.  
&#1; Un vocabulaire est l&#8217;ensemble de mots utilis&#233;s pour g&#233;n&#233;rer un texte. Ces mots 
</p>
<p>appartiennent &#224; diff&#233;rentes classes grammaticales 
&#1;  Le principe de la formule de Labb&#233; est de comparer les fr&#233;quences de vocabulaires 
</p>
<p>dans les deux textes ind&#233;pendamment de la nature de vocabulaire. 
</p>
<p>Nous nous posons alors une question tr&#232;s importante &#224; nos yeux &#224; savoir : est ce que toutes les 
classes grammaticales ont la m&#234;me pertinence dans le vocabulaire ? 
</p>
<p>Nous pouvons reformuler en : 
</p>
<p>(i) Est ce qu'elles ont toutes les classes grammaticales ont la m&#234;me pertinence dans l'&#233;criture 
de texte ? 
</p>
<p>(ii) Pourrions-nous d&#233;finir un certain nombre de classes comme &#233;tant un parasite 
vocabulaire ?  
</p>
<p>Nous nous sommes aper&#231;u, &#224; travers quelques exp&#233;riences qu'en &#233;liminant un certain nombre 
de classes tel que les chiffres et les noms propres, que l'indice de comparaison s'am&#233;liorait de 
plus en plus. D'o&#249; cette id&#233;e de parasite au niveau du vocabulaire. Et &#224; travers nos lecture nous 
avons remarqu&#233; qu'au niveau d'autres m&#233;thode de classification et d'indexation la notion 
existe d&#233;j&#224; comme par exemple dans les travaux sur les n-grammes de Radwan Jalam et Jean-
</p>
<p>b
</p>
<p>a
</p>
<p>N
NbaU =),(
</p>
<p>( ) ( , )
'
</p>
<p>( )
</p>
<p>*
</p>
<p>b
</p>
<p>ia u ib a b
</p>
<p>b ia u
V
</p>
<p>E F U
</p>
<p>N E
</p>
<p>=
</p>
<p>=&#8721;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AYADI Rami, JAOUDI Walid 
</p>
<p>Hugues Chauchat (JALAM, 2002) ou se terme revient souvent pour d&#233;finir des mots 
contenants par hasard un des n-grammes caract&#233;ristiques de la classe, sans que le mot lui-
m&#234;me soit int&#233;ressant. Dans notre cas nous allons appeler parasite toute composante  
susceptible de fausser le r&#233;sultat par sa non pertinence ou par le fait qu'elle n'est pas 
repr&#233;sentative du style lexical de l'auteur.  
</p>
<p>Notons par exemple que les noms propres et les chiffres peuvent &#234;tre consid&#233;r&#233;s comme non 
repr&#233;sentatif du style lexical d'un auteur. Plus concr&#232;tement, en comparant le m&#234;me texte &#233;crit 
par la m&#234;me personne d&#233;crivant deux personnages ne donnera pas un z&#233;ro ce qui est le r&#233;sultat 
logique car les noms et les dates diff&#232;rent ce qui fausse le r&#233;sultat. 
</p>
<p>Pour rem&#233;dier &#224; cette lacune que nous avons rencontr&#233;e, nous nous proposons de d&#233;velopper 
la notion de vocabulaire au niveau d'un texte. Nous consid&#232;rerons un vocabulaire V comme la 
somme de vocabulaires Vi o&#249; i d&#233;signe les diff&#233;rentes classes grammaticales de la langue. 
</p>
<p>Pour r&#233;pondre &#224; l'autre question, &#224; savoir la variation du degr&#233; d'importance des classes 
grammaticales, nous avons int&#233;gr&#233; une notion de poids relatifs &#224; chaque classe grammaticale. 
Ainsi nous allons d&#233;finir une variable qui repr&#233;sentera le poids dans le vocabulaire, cette 
variable sera rattach&#233;e aux classes grammaticales. Soit donc &#945;i le poids de la classe 
grammaticale i. Il est &#224; noter que la valeur de &#945;i varie entre 0 et 1 et ceci pour nous ramener 
dans le cas o&#249; c'est &#233;gal &#224; 1 &#224;  l'approche de D. Labb&#233; qui est en fait notre point de d&#233;part. 
</p>
<p>2.2.3 Formulation math&#233;matique 
</p>
<p>Soit deux textes A et B ayant respectivement les vocabulaires Va et Vb. Nous r&#233;alisons 
l'&#233;quilibrage de Labb&#233; pour le mettre &#224; la m&#234;me taille et obtenir les vocabulaires Va et V'b. 
Nous int&#233;grons alors les poids au niveau des fr&#233;quences des vocabulaires selon la classe 
grammaticale d'appartenance.  
</p>
<p>D'o&#249; la nouvelle formulation : 
</p>
<p>Soit &#945;Ci le poids de la classe C &#224; laquelle appartient le vocable i  
</p>
<p>Ce qui donne la distance suivante :  
</p>
<p>&#2; Distance absolue : entre le vocabulaire du texte A et B&#8217; (B&#8217;=la r&#233;duction de B &#224; la 
taille de A) 
</p>
<p>( 3) 
</p>
<p>      
'
</p>
<p>( )
</p>
<p>, ( ) ( )
,a b E
</p>
<p>Va b u Ci ia ia u
V V
</p>
<p>D F E&#945;= &#8722;&#8721;  
</p>
<p>&#2; Distance relative ),( baD  : 
</p>
<p>( 4) 
</p>
<p>' '
</p>
<p>( ) ( )
</p>
<p>( ) ( )
, ,
</p>
<p>( , ) '
( )
</p>
<p>a b E a b E
</p>
<p>Ci ia ia u Ci ia ia u
V V V V
</p>
<p>a b
ia ia u a b
</p>
<p>F E F E
</p>
<p>D
F E N N
</p>
<p>&#945; &#945;&#8722; &#8722;
</p>
<p>= =
</p>
<p>+ +
</p>
<p>&#8721; &#8721;
</p>
<p>&#8721; &#8721;
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La distance intertextuelle pour la classification de textes en langue arabe 
</p>
<p>      Ou                        
&#8721;=
</p>
<p>=
</p>
<p>bV
uiab
</p>
<p>baibuia
</p>
<p>EN
</p>
<p>UFE
</p>
<p>)(
'
</p>
<p>),()( *
</p>
<p> 
</p>
<p>2.2.4 Avantages de l&#8217;int&#233;gration des pond&#233;rations 
</p>
<p>La nouvelle formule prend en charge les points suivants: 
</p>
<p>&#8226; La diminution du parasitage au niveau des vocabulaires par annulation ou att&#233;nuation 
de l'impact de certaines classes grammaticales au niveau des fr&#233;quences des 
vocabulaires et ceci soit par mise &#224; z&#233;ro du poids ou soit par sa diminution. 
</p>
<p>&#8226; La prise en charge d'autres crit&#232;res au niveau du calcul de la distance intertextuelle 
comme la pond&#233;ration des classes grammaticales au niveau d'un certain nombre 
d'auteurs, de genres litt&#233;raires&#8230;En effet par attribution d'un certain nombre de 
pond&#233;ration &#224; chaque texte r&#233;f&#233;rence il est possible de rendre l'indice de distance plus 
sp&#233;cifique &#224; une r&#233;f&#233;rence et ainsi renforcer sa repr&#233;sentation de la projection du texte 
&#224; comparer sur la r&#233;f&#233;rence retenue. 
</p>
<p>&#8226; G&#233;n&#233;ralisation de la formule &#233;crite par Labb&#233;. En effet, cette nouvelle formulation 
permet pour une configuration &#945;i=1 de se conformer &#224; l'approche de Labb&#233;. 
</p>
<p>2.2.5  Probl&#233;matique pos&#233;e par la nouvelle approche 
</p>
<p>La nouvelle approche n&#233;cessite de trouver un jeu de pond&#233;ration ad&#233;quat pour optimiser le 
calcul de la distance ainsi qu'une &#233;tude d&#233;taill&#233;e pour d&#233;terminer les classes grammaticales &#224; 
d&#233;finir en tant que parasite. Il est possible de penser que le jeu de pond&#233;ration ainsi que les la 
d&#233;finition des classes parasites soit une fonction variable de l'auteur, du genre, du th&#232;me de 
l'&#233;poque&#8230; ce qui d'un c&#244;t&#233; rend la t&#226;che plus difficile mais qui au m&#234;me temps rends la 
formule plus adaptable au contexte de calcul et aux textes de r&#233;f&#233;rence. Pour commencer nous 
pourrons consid&#233;rer le c&#244;t&#233; parasitage sans chercher &#224; d&#233;finir le jeu de pond&#233;ration, ainsi les 
&#945;i prendront soit 0 ou 1 jusqu'&#224; ce qu'on trouve une m&#233;thode performante pour la recherche 
des jeux de pond&#233;ration qui pourrait r&#233;sider dans une analyse statistique des lexiques des 
textes r&#233;f&#233;rence. L'utilisation des poids 0 et 1 permet d'exclure les &#233;l&#233;ments parasites dans le 
calcul ce qui am&#233;liore d&#233;j&#224; le r&#233;sultat num&#233;rique. 
</p>
<p>3 Conclusion 
Nos travaux se sont int&#233;ress&#233;s &#224; la classification de textes en langue arabe bas&#233;e sur la th&#233;orie 
de la distance intertextuelle. Pour ce faire nous avons r&#233;alis&#233; un syst&#232;me permettant &#224; partir 
d'un certain nombre de composants de r&#233;aliser cette t&#226;che. 
</p>
<p>Nous avons en outre r&#233;alis&#233; des batteries de tests pour l'&#233;talonnage et la mise en place des 
diff&#233;rents composants afin qu'ils soient stables et fiables. En ce qui concerne le lemmatiseur la 
lemmatisation de texte s'av&#232;re une t&#226;che assez lourde au d&#233;but mais plus nous avan&#231;ons dans 
le traitement plus le syst&#232;me acquiert une certaine rapidit&#233;. 
</p>
<p>b
</p>
<p>a
</p>
<p>N
NbaU =),(et  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AYADI Rami, JAOUDI Walid 
</p>
<p>Une fois notre objectif initial atteint, nous nous proposons dans un troisi&#232;me volet de notre 
travail, de mettre en place le r&#233;f&#233;rentiel. Ceci par une &#233;tude d&#233;taill&#233; des diff&#233;rents ouvrages et 
la s&#233;lection, avec l'assistance d'un expert du domaine, de textes en langue arabe repr&#233;sentatifs 
d'un ensemble de crit&#232;res &#224; savoir genres, types, registre, th&#232;mes, &#233;poques, auteurs. Nous nous 
proposons de r&#233;aliser une &#233;tude exp&#233;rimentale qui nous permettra d'associer &#224; chaque texte 
r&#233;f&#233;rence un jeu d'&#233;tiquetage et de pond&#233;ration de classes grammaticales pouvant mettre en 
valeur ses sp&#233;cificit&#233;s. Cette &#233;tude exp&#233;rimentale permettra de finaliser le syst&#232;me de 
classification automatique de texte en langue arabe bas&#233; sur la th&#233;orie de la distance 
intertextuelle. 
</p>
<p>R&#233;f&#233;rences  
MULLER CHARLES (1997), PRINCIPES ET METHODES DE STATISTIQUE LEXICALE, PARIS. 
HACHETTE UNIVERSITE. 
</p>
<p>BRUNET E.(1988) Une mesure de la distance intertextuelle : la  connexion lexicale, Le nombre 
et le texte. Revue informatique et statistique dans les sciences humaines, Universit&#233; de Li&#232;ge. 
DEERWESTER S., DUMAIS. S. T., FURNAS, G. LANDAUER. T. K.HARSHMAN (1990). Indexing by 
latent semantic analysis. JOURNAL OF THE AMERICAN SOCIETY FOR INFORMATION SCIENCE, 
391-407. 
</p>
<p>JALAM R., CHAUCHAT J. H.(2002), Pourquoi les n-grammes permettent de classer des textes ? 
recherche de mots-cl&#233;fs pertinents &#224; l'aide des n-grammes caract&#233;ristiques. JADT 2002 : 6ES 
JOURNEES INTERNATIONALES D'ANALYSE STATISTIQUE DES DONNEES TEXTUELLES. 
</p>
<p>JAOUADI W., ZRIGUI M.(2006), Application de la th&#233;orie de la distance intertextuelle pour la 
classification de texte en langue arabe. CONFERENCE REALITER 2006, RIO DE JANEIRO. 
</p>
<p>LABBE D.(2002), L&#8217;attribution d&#8217;auteur et la distance intertextuelle. Revue Corpus. 
</p>
<p>LABBE D. ET LABBE C.(2003), La distance intertextuelle. REVUE CORPUS 2, LABORATOIRE 
&#8221;BASES, CORPUS ET LANGAGE&#8221;, UMR 6039 DU CNRS. 
</p>
<p>LABBE D.(2003), R&#233;ponses &#224; M. J.-M. VIPREY Corneille et Moli&#232;re. 
</p>
<p>LABBE D.(2004), CORNEILLE ET MOLIERE. 7E JOURNEES D&#8217;ANALYSE DES DONNEES 
TEXTUELLES. 
</p>
<p>REINHART M., QUELQUES ASPECTS DU CHOIX DES UNITES D&#8217;ANALYSE ET DE LEUR CONTROLE 
DANS LA METHODE ALCEST. IN L. L. S. 
</p>
<p>SALTON, G.. AUTOMATIC TEXT PROCESSING, ADDISON WESLEY, 1989. 
</p>
<p>LEBART L., SALEM, A.. ANALYSE STATISTIQUE DES DONNEES TEXTUELLES. PARIS, DUNOD, 
1988. 
</p>
<p>JALAM R., CHAUCHAT J. H.., POURQUOI LES N-GRAMMES PERMETTENT DE CLASSER DES TEXTES 
? RECHERCHE DE MOTS-CLEFS PERTINENTS A L'AIDE DES N-GRAMMES CARACTERISTIQUES. JADT 
2002 : 6ES JOURNEES INTERNATIONALES D'ANALYSE STATISTIQUE DES DONNEES TEXTUELLES, 
2002. </p>

</div></div>
</body></html>