<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Normalisation des entit&#233;s nomm&#233;es : pour une approche mixte et orient&#233;e utilisateurs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2009, Senlis, 24-26 juin 2009 
</p>
<p>Normalisation des entit&#233;s nomm&#233;es : pour une approche mixte et 
orient&#233;e utilisateurs 
</p>
<p>Vanessa Andr&#233;ani 
</p>
<p>TecKnowMetrix &#8211; 4, rue L&#233;on B&#233;ridot &#8211; ZAC Champfeuillet &#8211; 38500 
Voiron &#8211; France 
</p>
<p>LIDILEM &#8211; Universit&#233; Stendhal Grenoble 3 &#8211; Domaine universitaire &#8211; 1180, 
avenue centrale &#8211; 38400 Saint Martin d&#8217;H&#232;res &#8211; France 
</p>
<p>va@tkm.fr 
</p>
<p>R&#233;sum&#233; La normalisation intervient dans de nombreux champs du traitement de 
l'information. Elle permet d'optimiser les performances des applications, telles que la 
recherche ou l'extraction d'information, et de rendre plus fiable la constitution de ressources 
langagi&#232;res. La normalisation consiste &#224; ramener toutes les variantes d'un m&#234;me terme ou 
d'une entit&#233; nomm&#233;e &#224; une forme standard, et permet de limiter l'impact de la variation 
linguistique. Notre travail porte sur la normalisation des entit&#233;s nomm&#233;es, pour laquelle nous 
avons mis en place un syst&#232;me complexe m&#234;lant plusieurs approches. Nous en pr&#233;sentons ici 
une des composantes : une m&#233;thode endog&#232;ne de d&#233;limitation et de validation de l&#8217;entit&#233; 
nomm&#233;e norm&#233;e, adapt&#233;e &#224; des donn&#233;es multilingues. De plus, nous pla&#231;ons l'utilisateur au 
centre du processus de normalisation, dans l'objectif d'obtenir des donn&#233;es parfaitement 
fiables et adapt&#233;es &#224; ses besoins. 
</p>
<p>Abstract Normalization is involved in many fields of information processing. It improves 
performances for several applications, such as information retrieval or information extraction, 
and makes linguistic resources constitution more reliable. Normalization consists in 
standardizing each variant of a term or named entity into a unique form, and this way restricts 
the impact of term variation. Our work applies to named entity normalization, for which we 
implemented a complex system that mixes several approaches. We present here one of its 
components: an endogenous method to mark out and validate the normalized named entities. 
Moreover, we place the user in the center of our normalization process, in order to obtain fully 
reliable data that fit his needs. 
</p>
<p>Mots-cl&#233;s : normalisation, entit&#233;s nomm&#233;es, traitement de l'information, analyse de 
corpus, m&#233;thodes endog&#232;nes, syst&#232;me complexe. 
Keywords: normalization, named entities, information processing, corpus analysis, 
endogenous methods, complex system.
</p>
<p>Introduction 
Tout comme les unit&#233;s lexicales &#171; classiques &#187;, les entit&#233;s nomm&#233;es (EN) sont soumises &#224; une 
grande complexit&#233; et &#224; une variation linguistique importante. Leur normalisation est donc une </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vanessa Andr&#233;ani 
</p>
<p>&#233;tape n&#233;cessaire pour un grand nombre de champs d&#8217;applications du Traitement Automatique 
des Langues (TAL) pour obtenir des donn&#233;es fiables et de qualit&#233;. C&#8217;est notamment le cas de 
l&#8217;extraction d&#8217;information, mais aussi de toutes les t&#226;ches qui traitent massivement les EN. 
Les m&#233;thodes de normalisation existantes rel&#232;vent la plupart du temps d&#8217;un seul type 
d&#8217;approche, ce qui les rend efficaces sur un aspect pr&#233;cis de la normalisation, mais parfois 
inop&#233;rantes sur d&#8217;autres points de difficult&#233;. De plus, tr&#232;s peu de syst&#232;mes actuels placent 
l&#8217;utilisateur au centre du processus, alors que ce sont souvent ses connaissances et son point 
de vue qui permettent de r&#233;aliser une normalisation pertinente. Enfin, peu de syst&#232;mes de ce 
type sont portables d&#8217;une langue &#224; l&#8217;autre sans une modification, parfois co&#251;teuse, des 
ressources utilis&#233;es pour le traitement des donn&#233;es. 
</p>
<p>Dans une premi&#232;re partie de cet article, nous proposons de d&#233;finir les notions li&#233;es au 
probl&#232;me de la normalisation, et exposons les techniques existantes. Dans un deuxi&#232;me temps, 
nous pr&#233;sentons le syst&#232;me de normalisation complexe que nous avons mis en place, puis 
d&#233;montrons l&#8217;int&#233;r&#234;t d&#8217;une m&#233;thode de normalisation bas&#233;e sur diff&#233;rents crit&#232;res 
linguistiques et int&#233;grant l&#8217;utilisateur. Enfin, nous d&#233;taillons notre approche endog&#232;ne pour la 
normalisation, particuli&#232;rement adapt&#233;e &#224; des donn&#233;es multilingues, et discutons nos 
premi&#232;res &#233;valuations. 
</p>
<p>1 La normalisation des entit&#233;s nomm&#233;es 
Dans le cadre de l'exploitation de donn&#233;es textuelles pour l&#8217;analyse de l'information, la 
disparit&#233; des formes renvoyant &#224; une m&#234;me entit&#233; nomm&#233;e (EN) ou &#224; un m&#234;me terme pose 
rapidement probl&#232;me. Par cons&#233;quent, il est souvent n&#233;cessaire de proc&#233;der &#224; une &#233;tape de 
normalisation de ces donn&#233;es, avant de d&#233;buter l'analyse &#224; proprement parler. 
</p>
<p>Nous d&#233;finissons la normalisation comme un processus permettant de ramener plusieurs 
formes de surface diff&#233;rentes renvoyant &#224; un m&#234;me r&#233;f&#233;rent &#224; une forme standard, et dont la 
finalit&#233; est de reconna&#238;tre, dans des donn&#233;es structur&#233;es ou non, toutes les r&#233;alisations 
linguistiques pour une m&#234;me entit&#233;. 
</p>
<p>Les travaux pr&#233;sent&#233;s ici portent exclusivement sur la normalisation des EN. A la suite de 
(Poibeau, 2001), nous consid&#233;rons que les EN sont &#171; l'ensemble des noms de personnes, 
d'entreprises et de lieux pr&#233;sents dans un texte donn&#233; &#187;1. Parmi tous ces types, nous ne nous 
int&#233;resserons qu'aux noms de personnes et d'organisations, seules entit&#233;s qui apparaissent dans 
les donn&#233;es que nous souhaitons traiter. Les EN r&#233;v&#232;lent une complexit&#233; semblable &#224; celle des 
unit&#233;s lexicales &#171; classiques &#187; (Ehrmann, Jacquet, 2006), et sont donc soumises &#224; la variation 
linguistique au m&#234;me titre que les termes &#171; communs &#187;. Par cons&#233;quent, pour les domaines du 
TAL traitant massivement les EN, la normalisation de ces entit&#233;s doit r&#233;duire l&#8217;impact de cette 
variation au minimum. Ainsi, les entit&#233;s nomm&#233;es President John Kennedy, John F. Kennedy 
et John Fitzgerald Kenedy renvoient toutes au 35e pr&#233;sident des Etats-Unis, John Fitzgerald 
Kennedy, malgr&#233; les diff&#233;rences graphiques qu&#8217;elles pr&#233;sentent, et doivent &#234;tre trait&#233;es en 
cons&#233;quence. Nous nous int&#233;ressons donc &#224; une normalisation au niveau graphique, destin&#233;e &#224; 
homog&#233;n&#233;iser les formes de surface pour une m&#234;me entit&#233;. 
</p>
<p>Les champs concern&#233;s par cette &#233;tape de normalisation sont relativement nombreux. Pour la 
recherche d&#8217;information (RI), la possibilit&#233; d&#8217;identifier toutes les formes possibles d&#8217;une 
entit&#233; via une &#233;tape de normalisation est un moyen d&#8217;am&#233;liorer les performances en 
                                                 
</p>
<p>1
  L'auteur inclut &#233;galement dans cette cat&#233;gorie &#171; les dates, les unit&#233;s mon&#233;taires, les pourcentages, etc. &#187; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Normalisation des entit&#233;s nomm&#233;es : pour une approche mixte et orient&#233;e utilisateurs 
</p>
<p>augmentant significativement le taux de rappel. Une telle &#233;tape pr&#233;sente le m&#234;me avantage 
pour l&#8217;extraction d&#8217;information (EI) et les syst&#232;mes question-r&#233;ponse. Pour la constitution de 
ressources termino-ontologiques (RTO), c'est-&#224;-dire des &#171; mod&#232;le[s] de connaissances 
comportant un r&#233;seau conceptuel et des termes associ&#233;s &#187; (Aussenac-Gilles, 2007), une &#233;tape 
pr&#233;alable de normalisation permet de standardiser les EN qui formeront les instanciations des 
n&#339;uds du r&#233;seau. Cette normalisation impacte la qualit&#233; des r&#233;sultats fournis par les 
applications utilisant la RTO ainsi constitu&#233;e. Enfin, la normalisation s&#8217;av&#232;re n&#233;cessaire pour 
le traitement de donn&#233;es structur&#233;es : elle permet de r&#233;gler les cas d&#8217;entr&#233;es dupliqu&#233;es dans 
les bases de donn&#233;es, c'est-&#224;-dire des cas o&#249; plusieurs entr&#233;es r&#233;f&#232;rent &#224; la m&#234;me EN mais 
pr&#233;sentent des diff&#233;rences graphiques qui emp&#234;chent de les traiter comme identiques 
(Elmagarmid et al., 2007). 
</p>
<p>Nous pouvons classer les approches de normalisation d&#8217;EN en trois cat&#233;gories : les m&#233;thodes 
qui s&#8217;appuient sur des ressources externes, les approches fond&#233;es sur l&#8217;utilisation de patrons, 
et les techniques adapt&#233;es au cas particulier des donn&#233;es structur&#233;es en bases de donn&#233;es. 
</p>
<p>Les approches prenant appui sur des ressources externes 
</p>
<p>Pour la normalisation d&#8217;EN dans leur acception la plus restrictive, &#224; savoir les noms propres 
de lieux, d'organisations ou de personnes, une approche courante consiste &#224; utiliser un 
dictionnaire ou toute ressource externe suffisamment exhaustive, de mani&#232;re &#224; ramener 
chaque occurrence d'une EN &#224; l'entr&#233;e &#171; standard &#187; qui lui correspond dans la ressource. Cela 
permet de r&#233;soudre les difficult&#233;s li&#233;es &#224; la variation linguistique, notamment en termes de 
synonymie. (Khalid et al., 2008) r&#232;gle ce probl&#232;me en utilisant Wikip&#233;dia en tant que 
ressource externe : il se sert des liens de redirection du site pour la gestion de la synonymie. 
En comparant les r&#233;sultats obtenus par un syst&#232;me de RI avec et sans normalisation en amont, 
il d&#233;montre qu&#8217;il est plus efficace lorsque les EN ont &#233;t&#233; pr&#233;alablement normalis&#233;es. 
</p>
<p>Les m&#233;thodes fond&#233;es sur des patrons d'extraction 
Dans le cadre de syst&#232;mes d&#8217;EI dans des domaines sp&#233;cialis&#233;s, l'utilisation de patrons pour la 
normalisation permet de r&#233;gler efficacement les probl&#232;mes de variation linguistique. Selon les 
syst&#232;mes, l'acception du terme d'entit&#233; nomm&#233;e peut &#234;tre assez large et inclure d'autres 
&#233;l&#233;ments que les EN courantes. Les auteurs de (Alphonse et al., 2004), dans le cadre du projet 
Caderige, travaillent &#224; l'extraction d'information, et plus particuli&#232;rement d&#8217;interactions 
g&#233;niques, &#224; partir de textes du domaine biom&#233;dical. Dans un premier temps, ils proc&#232;dent &#224; 
une normalisation des noms de g&#232;nes et de prot&#233;ines, en l'occurrence consid&#233;r&#233;es comme des 
EN. Des amorces de synonymie telles que &#171; formerly &#187; ou &#171; also called &#187;, et des patrons tels 
que &#171; gene amorce gene &#187;, permettent de g&#233;rer la variation linguistique. Ils d&#233;montrent que 
cette &#233;tape de normalisation &#171; facilite l'acquisition et l'apprentissage de r&#232;gles d'extraction en 
offrant une repr&#233;sentation plus abstraite des phrases &#187;. Avec le m&#234;me objectif, mais dans le 
domaine financier cette fois, (Poibeau, 2003) pr&#244;ne lui aussi une phase de normalisation des 
EN pr&#233;alable &#224; l'extraction, et la qualifie d' &#171; &#233;tape [...] essentielle &#187;. 
</p>
<p>Le cas particulier des donn&#233;es structur&#233;es 
</p>
<p>Le probl&#232;me majeur qui se pose dans les donn&#233;es structur&#233;es est l'existence de doublons dans 
lesquels la forme des EN varie, rendant impossibles les recoupements. Ces doublons sont la 
cons&#233;quence d'erreurs de typographie, de l'utilisation d'abr&#233;viations, mais &#233;galement de 
l'utilisation de plusieurs sources d'information, pour lesquelles les conventions graphiques 
peuvent varier (Jijkoun et al., 2008). Les m&#233;thodes rel&#232;vent alors souvent de calculs de 
similarit&#233; entre champs, de mani&#232;re &#224; rapprocher deux ou plusieurs noms qui font r&#233;f&#233;rence au </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vanessa Andr&#233;ani 
</p>
<p>m&#234;me objet du monde. (Elmagarmid et al., 2007) recense les m&#233;thodes utilis&#233;es pour la 
d&#233;tection d'entr&#233;es dupliqu&#233;es dans les BD, et donc pour leur normalisation. 
</p>
<p>Les m&#233;thodes utilisant des ressources exog&#232;nes sont efficaces sur du texte tout venant, e.g.  
des corpus de presse. Cependant, d&#232;s lors que les domaines abord&#233;s sont tr&#232;s sp&#233;cialis&#233;s, ou 
que les EN sont des noms de petites entreprises par exemple, des ressources g&#233;n&#233;ralistes sont 
insuffisantes. L&#8217;alternative qui vise &#224; constituer des ressources sp&#233;cialis&#233;es est extr&#234;mement 
co&#251;teuse, sans garantie d&#8217;exhaustivit&#233;. Une m&#233;thode de normalisation par patrons peut quant &#224; 
elle repr&#233;senter une bonne alternative aux dictionnaires et autres ressources pour le traitement 
de textes sp&#233;cialis&#233;s. Enfin, les calculs de similarit&#233; ont l'avantage d'&#234;tre peu co&#251;teux en 
termes de mise au point, et offrent des r&#233;sultats satisfaisants pour certains aspects de la 
normalisation, en particulier pour la correction d&#8217;erreurs typographiques. 
</p>
<p>2 Un syst&#232;me de normalisation complexe 
Notre travail intervient dans un contexte industriel, sur des donn&#233;es multilingues, et vise &#224; 
normaliser les noms des organisations qui d&#233;posent des brevets ou publient des articles 
scientifiques. Les informations concernant ces publications sont stock&#233;es dans des bases de 
donn&#233;es contenant plusieurs millions d&#8217;entr&#233;es. L&#8217;objectif de cette normalisation est de 
fournir dans les tables contenant les noms d&#8217;organisations des donn&#233;es standardis&#233;es, et ce 
quelle que soit la langue employ&#233;e, de mani&#232;re &#224; permettre des analyses de corpus fiables, 
qu&#8217;il s&#8217;agisse d&#8217;analyses statistiques, comme des comptages, ou d&#8217;analyses textuelles. 
</p>
<p>Nous avons con&#231;u un syst&#232;me de normalisation des EN qui m&#234;le plusieurs des m&#233;thodes que 
nous venons d&#8217;aborder, et qui implique la participation de l&#8217;utilisateur. Gr&#226;ce &#224; cette approche 
multiple, nous pouvons couvrir un grand nombre de cas de figure probl&#233;matiques li&#233;s &#224; la 
variation linguistique. Le syst&#232;me est compos&#233; de trois principaux modules : 
</p>
<p>&#8226; L&#8217;extraction et la r&#233;&#233;criture des noms d&#8217;organisations gr&#226;ce &#224; des patrons ; 
</p>
<p>&#8226; La correction d&#8217;erreurs typographiques par des mesures de similarit&#233; entre les noms 
d&#8217;organisations de la base ; 
</p>
<p>&#8226; L&#8217;extraction du nom d&#8217;organisation le plus coh&#233;rent et le plus g&#233;n&#233;ral via notre 
approche endog&#232;ne, lorsque les deux premi&#232;res &#233;tapes n&#8217;ont pas &#233;t&#233; suffisamment 
efficaces. 
</p>
<p>Le fait d&#8217;associer ces types d&#8217;approche permet de traiter les trois grandes cat&#233;gories de 
difficult&#233;s rencontr&#233;es dans notre corpus : 
</p>
<p>&#8226; les erreurs typographiques et orthographiques courantes, comme pour Mitsubisi au lieu 
de Mitsubishi2 ; 
</p>
<p>&#8226; la grande diversit&#233; des sources dont les donn&#233;es sont issues, ce qui entra&#238;ne une grande 
disparit&#233; dans la graphie et dans la description d&#8217;une m&#234;me entit&#233;. C'est par exemple le 
cas pour Mitsubishi Corp et Mitsubishi ; 
</p>
<p>                                                 
</p>
<p>2
 Mitsubishi est une marque enregistr&#233;e de Mitsubishi Corporation </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Normalisation des entit&#233;s nomm&#233;es : pour une approche mixte et orient&#233;e utilisateurs 
</p>
<p>&#8226; pour les EN d&#233;signant des institutions publiques, il n'est pas rare de trouver &#224; 
l&#8217;int&#233;rieur d&#8217;un m&#234;me nom plusieurs sous-&#233;l&#233;ments d&#8217;une m&#234;me EN. Un cas comme : 
</p>
<p>Division of Gynecologic Oncology, Department of Obstetrics and Gynecology, University of 
Kentucky Medical Center, 800 Rose Street, Whitney-Hendrickson Building, Lexington 40536, 
USA. jowell@gx.net 
</p>
<p>est assez repr&#233;sentatif. Cela pose probl&#232;me pour d&#233;gager l&#8217;entit&#233; de niveau sup&#233;rieur 
tout en mettant de c&#244;t&#233; les sous-organisations, qui viendraient bruiter les donn&#233;es. 
</p>
<p>Nous illustrons dans le tableau qui suit les traitements effectu&#233;s par chaque module : 
</p>
<p>Nom d&#8217;organisation brut 
</p>
<p>Modules 
</p>
<p>Tulane-Xavier Center for Bioenvironmental 
Research, Department of 
</p>
<p>Pharmacology, Tulan University Medical 
Center, LA 70112,USA. 
</p>
<p>1. Extraction et r&#233;&#233;criture par patrons Univ Tulan Medical Center 
</p>
<p>2. Correction d&#8217;erreurs typographiques par 
mesures de similarit&#233; 
</p>
<p>Univ Tulane Medical Center 
</p>
<p>3. Extraction du nom d&#8217;organisation par m&#233;thode 
endog&#232;ne 
</p>
<p>Univ Tulane 
</p>
<p>Tableau 1: traitements effectu&#233;s par les modules du syst&#232;me de normalisation 
</p>
<p>L&#8217;utilisateur intervient &#224; la fin des phases 2 et 3, et doit valider les suggestions de correction 
du syst&#232;me3. Notons que l&#8217;utilisateur a le choix de proc&#233;der ou non &#224; cette v&#233;rification, en 
fonction des contraintes li&#233;es &#224; son activit&#233;. De plus, chacun de ses choix est gard&#233; en 
m&#233;moire, ce qui permet au syst&#232;me d&#8217;apprendre les corrections ad&#233;quates pour un nom d&#233;j&#224; 
rencontr&#233; auparavant. Ainsi, le nombre de corrections &#224; valider par l&#8217;utilisateur diminue au fil 
des normalisations. Cette supervision par l&#8217;utilisateur expert du domaine trait&#233; permet de 
garantir la qualit&#233; et la fiabilit&#233; des donn&#233;es qui seront stock&#233;es dans les bases. 
</p>
<p>Placer cette &#233;tape endog&#232;ne &#224; la fin du traitement permet d&#8217;&#233;liminer un maximum de bruit par 
des m&#233;thodes de pattern matching peu co&#251;teuses en temps de calcul, et de concentrer ensuite 
la proc&#233;dure endog&#232;ne, plus lourde en termes de co&#251;t calculatoire, sur les cas irr&#233;solus. 
</p>
<p>3 Une approche endog&#232;ne pour la normalisation 
</p>
<p>3.1 Principe et objectifs 
Un syst&#232;me endog&#232;ne trouve les informations dont il a besoin dans les donn&#233;es qu&#8217;il doit 
traiter. Ces informations permettent de r&#233;soudre des cas probl&#233;matiques pour lesquels les 
m&#233;thodes &#224; base de r&#232;gles et de patrons atteignent leurs limites. 
</p>
<p>                                                 
</p>
<p>3
  Cette validation se fait via une interface d&#233;di&#233;e, dans laquelle l&#8217;utilisateur doit cocher la suggestion la plus 
</p>
<p>pertinente. Il a aussi la possibilit&#233; de rentrer manuellement un nom d&#8217;organisation, lorsque les suggestions ne 
sont pas adapt&#233;es. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vanessa Andr&#233;ani 
</p>
<p>En France, les principaux travaux dans ce domaine ont &#233;t&#233; men&#233;s avec pour objectif de 
r&#233;aliser des analyses syntaxiques et / ou morphologiques l&#224; o&#249; les syst&#232;mes pr&#233;existants 
n&#8217;&#233;taient pas assez efficaces en raison d&#8217;une variation linguistique trop importante (Vergne, 
2004 ; Bourigault, 1993 ; Bourigault et Fr&#233;rot, 2006). (Fr&#233;rot et al., 2003) d&#233;montre que des 
approches de ce type, c'est-&#224;-dire des &#171; proc&#233;dures non supervis&#233;es d&#8217;apprentissage sur corpus 
qui [&#8230;] permettent d&#8217;exploiter le corpus d&#8217;analyse pour acqu&#233;rir les 
informations n&#233;cessaires &#187; aux traitements, sont particuli&#232;rement efficaces lorsque le domaine 
des textes &#224; traiter n&#8217;est pas connu &#224; l&#8217;avance, et que des ressources constitu&#233;es a priori sont 
par cons&#233;quent peu adapt&#233;es. Ces m&#233;thodes se fondent essentiellement sur le principe de 
productivit&#233;, c'est-&#224;-dire sur le nombre de contextes diff&#233;rents avec lesquels peut appara&#238;tre le 
mot ou le terme &#233;tudi&#233;, et s&#8217;appuient de fa&#231;on privil&#233;gi&#233;e sur les redondances du corpus.  
</p>
<p>Une autre approche consiste &#224; utiliser la longueur et la fr&#233;quence des mots pour r&#233;aliser une 
analyse syntaxique partielle sans ressources (Vergne, 2004). Le fait d&#8217;utiliser de tels crit&#232;res 
d&#8217;analyse permet de traiter des textes multilingues sans co&#251;t suppl&#233;mentaire, puisqu&#8217;aucun 
lexique n&#8217;est n&#233;cessaire. 
</p>
<p>Notre objectif diff&#232;re de ceux des travaux &#233;voqu&#233;s ci-avant, puisque nous cherchons pour 
notre part &#224; normaliser des noms d&#8217;organisations en vue d&#8217;un traitement de l&#8217;information 
strat&#233;gique. Cependant, une approche endog&#232;ne fond&#233;e sur la r&#233;currence de s&#233;quences nous 
para&#238;t tout &#224; fait appropri&#233;e au vu de nos donn&#233;es, et peut &#234;tre un moyen de d&#233;terminer la 
structure d&#8217;un nom d&#8217;organisation. En effet, en nous fondant sur les fr&#233;quences de segments 
de diff&#233;rentes longueurs, et non plus sur des structures syntaxiques ou des indices lexicaux, 
nous &#233;vitons plusieurs &#233;cueils. Tout d'abord, cela &#233;vite d'avoir &#224; constituer des lexiques 
adapt&#233;s, ce qui serait tr&#232;s co&#251;teux puisque nous travaillons sur des donn&#233;es multilingues. 
D'autre part, du fait que nous traitons exclusivement des noms propres, aucun dictionnaire ne 
serait suffisamment exhaustif. Enfin, une telle approche permet d'avoir un traitement 
parfaitement adapt&#233; au corpus trait&#233;, quel que soit le domaine : un syst&#232;me endog&#232;ne est 
forc&#233;ment adapt&#233; au corpus qu'il traite, puisque par essence, les donn&#233;es qu'il utilise pour 
traiter le corpus sont issues du corpus lui-m&#234;me. 
</p>
<p>3.2 Application &#224; nos donn&#233;es 
</p>
<p>Les donn&#233;es que nous normalisons permettent de mener des analyses textuelles et statistiques 
et de tirer parti d&#8217;informations strat&#233;giques. Ainsi, &#224; partir des s&#233;quences suivantes : 
</p>
<p>1. Division of Gynecologic Oncology, Department of Obstetrics and Gynecology, 
University of Kentucky Medical Center, Whitney-Hendrickson Building, Lexington 40536, USA. 
</p>
<p>2. University of Kentucky, Lexington 40536-0098, USA. runge@pop.uky.edu  
3. University of Kentucky Research Institute, USA 
</p>
<p>une m&#233;thode endog&#232;ne devra permettre d&#8217;extraire la s&#233;quence r&#233;currente University of 
Kentucky, qui repr&#233;sente le nom normalis&#233; que doivent prendre ces trois noms d&#8217;organisations 
bruts. De cette mani&#232;re, il sera possible d&#8217;identifier toutes les publications &#233;manant de cette 
organisation, et ce quel que soit le d&#233;partement ou la division. 
</p>
<p>Nous avons r&#233;duit l&#8217;utilisation des ressources exog&#232;nes au minimum : nous avons notamment 
&#233;tabli une liste d&#8217;une centaine d&#8217;amorces, c'est-&#224;-dire de mots qui permettent de d&#233;tecter la 
pr&#233;sence d&#8217;une entit&#233; nomm&#233;e, ainsi que son niveau hi&#233;rarchique. Par exemple, une 
universit&#233;, d&#233;tect&#233;e par l&#8217;amorce Univ suivie ou non de plusieurs caract&#232;res (University, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Normalisation des entit&#233;s nomm&#233;es : pour une approche mixte et orient&#233;e utilisateurs 
</p>
<p>Universit&#233;, &#8230;) est consid&#233;r&#233;e comme hi&#233;rarchiquement sup&#233;rieure &#224; un centre, rep&#233;r&#233; par 
l&#8217;amorce Center, Centre, Centro, etc. Nous avons en effet observ&#233; que lorsque ces deux types 
d&#8217;entit&#233;s nomm&#233;es se trouvaient dans le m&#234;me nom d&#8217;organisation brut, le centre &#233;tait 
rattach&#233; &#224; l&#8217;universit&#233;, et repr&#233;sentait donc une &#171; sous-partie &#187; de l&#8217;universit&#233; en question. 
</p>
<p>Pour mettre en pratique une approche endog&#232;ne adapt&#233;e &#224; nos besoins, nous nous fondons sur 
deux calculs : la fr&#233;quence des sous-s&#233;quences et la surface des sous-s&#233;quences. 
</p>
<p>La fr&#233;quence des sous-s&#233;quences 
Nous d&#233;finissons une s&#233;quence comme un segment d&#8217;un nom d&#8217;organisation plac&#233; entre deux 
virgules. Une sous-s&#233;quence est donc une suite de n items issus de cette s&#233;quence, dans une 
fen&#234;tre dont la taille s&#8217;incr&#233;mente d&#8217;un item &#224; chaque passe. 
</p>
<p>Gr&#226;ce &#224; notre liste d&#8217;amorces, nous pouvons d&#233;terminer que l&#8217;amorce de plus haut niveau en 1 
est University : nous ne conserverons donc que cette s&#233;quence. En revanche, elle pose 
probl&#232;me puisqu&#8217;elle comporte une deuxi&#232;me amorce, Center, de niveau inf&#233;rieur. Toute la 
difficult&#233; est donc de d&#233;limiter le nom d&#8217;organisation le plus coh&#233;rent au sein de cette 
s&#233;quence, c'est-&#224;-dire d&#8217;extraire la sous-s&#233;quence la plus pertinente. C&#8217;est l&#8217;&#233;tape endog&#232;ne 
qui permettra de d&#233;terminer que University of Kentucky doit &#234;tre conserv&#233; comme nom 
d&#8217;organisation, et non, par exemple, University of Kentucky Medical. 
Nous partons de l'hypoth&#232;se selon laquelle la sous-s&#233;quence la plus fr&#233;quente est le nom 
d&#8217;organisation le plus coh&#233;rent. Pour parvenir &#224; extraire ce segment, nous comptabilisons le 
nombre d&#8217;occurrences de chaque sous-s&#233;quence de University of Kentucky Medical Center 
comportant l&#8217;amorce de niveau sup&#233;rieur, en l&#8217;occurrence University of. Le cas &#233;ch&#233;ant, les 
premiers mots s&#233;lectionn&#233;s sont ceux situ&#233;s &#224; gauche de l'amorce, du voisin imm&#233;diat 
jusqu&#8217;au plus lointain. Cela se justifie par le fait que la plupart des donn&#233;es probl&#233;matiques &#224; 
ce stade sont des donn&#233;es en anglais, et que la qualification des noms dans cette langue se fait 
souvent de droite &#224; gauche. Puis les mots plac&#233;s &#224; droite sont &#224; leur tour ajout&#233;s un par un. Les 
sous-s&#233;quences test&#233;es pour notre exemple sont donc : 
</p>
<p>(1.a) University of Kentucky 
(1.b) University of Kentucky Medical 
</p>
<p>Le syst&#232;me ne va pas plus loin, puisqu&#8217;il rencontre apr&#232;s Medical la seconde amorce, Center, 
qui n&#8217;appartient pas au nom d&#8217;organisation le plus coh&#233;rent.  
</p>
<p>Pour chacune de ces sous-s&#233;quences, le syst&#232;me va donc calculer leur fr&#233;quence dans 
l&#8217;int&#233;gralit&#233; de notre corpus de plusieurs millions de noms d&#8217;organisations. Dans ce corpus, 
nous avons relev&#233; 71 occurrences de la suite (1.a) et 9 occurrences de la suite (1.b). De fait, en 
s&#233;lectionnant la sous-s&#233;quence la plus fr&#233;quente, nous sommes bien en mesure de d&#233;tecter le 
nom d&#8217;organisation le plus coh&#233;rent, soit : (1.a) University of Kentucky. 
Les m&#234;mes calculs sont effectu&#233;s sur les deux autres s&#233;quences, soit University of Kentucky et 
University of Kentucky Research Institute. University of Kentucky &#233;tant toujours la s&#233;quence 
la plus fr&#233;quente, nous consid&#233;rons qu&#8217;il s&#8217;agit du nom d&#8217;organisation le plus coh&#233;rent. 
</p>
<p>La surface des sous-s&#233;quences 
Les calculs de fr&#233;quence permettent de couvrir un grand nombre de cas semblables &#224; ceux que 
nous venons d&#8217;&#233;voquer. Cependant, il reste des probl&#232;mes non r&#233;solus. Ainsi les exemples : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vanessa Andr&#233;ani 
</p>
<p>4. New York University Medical School 
5. New York University Dental Center 
</p>
<p>Ces s&#233;quences pr&#233;sentent un probl&#232;me suppl&#233;mentaire, puisque le nom de l&#8217;universit&#233;, soit 
New York, est un mot compos&#233;, et que le nom d&#8217;universit&#233; York existe par ailleurs. Le calcul 
de fr&#233;quences de sous-s&#233;quences donne les r&#233;sultats suivants : 
</p>
<p>&#8226; York University 182 occurrences 
</p>
<p>&#8226; New York University 174 occurrences 
</p>
<p>&#8226; New York University Medical 24 occurrences  
</p>
<p>&#8226; New York University Dental 1 occurrence 
</p>
<p>En suivant notre hypoth&#232;se de d&#233;part, le nom d&#8217;organisation le plus coh&#233;rent serait donc York 
University, avec 182 occurrences. Or, nous savons que dans les exemples que nous &#233;tudions, 
le nom devrait &#234;tre New York University. Pour r&#233;soudre cette difficult&#233;, nous avons mis en 
place un calcul de surface des sous-s&#233;quences, qui met en rapport leur fr&#233;quence et leur 
longueur. Le calcul de surface est le suivant : 
</p>
<p>Surface = nombre de tokens * nombre d&#8217;occurrences 
</p>
<p>Nous pr&#233;sentons les r&#233;sultats de ces calculs sur la figure 1 :  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Ici, le meilleur score de surface est celui de la s&#233;quence New York University, soit le nom que 
nous avions identifi&#233; manuellement comme le plus coh&#233;rent. Les calculs de surface nous 
permettent donc, dans un certain nombre de cas, de r&#233;soudre le probl&#232;me des mots compos&#233;s. 
</p>
<p>3.3 Evaluation 
</p>
<p>Nous exposons ici les r&#233;sultats d&#8217;une &#233;valuation manuelle sur un &#233;chantillon de donn&#233;es. Par 
la suite, nous m&#232;nerons une &#233;valuation plus pouss&#233;e sur un plus grand nombre de donn&#233;es, 
pour chaque bloc de traitement ainsi que pour l&#8217;ensemble de notre syst&#232;me. 
</p>
<p>Pour l&#8217;heure, sur un &#233;chantillon compos&#233; de 15 noms d&#8217;organisations bruts, dont la majorit&#233; 
contiennent des noms d&#8217;organisations compos&#233;s et donc les cas les plus difficiles, le calcul de 
fr&#233;quences permet de d&#233;terminer le nom d&#8217;organisation le plus coh&#233;rent dans 8 cas. Sur les 
m&#234;mes donn&#233;es, le calcul de surfaces extrait 10 noms d&#8217;organisations correctement. Les cas 
</p>
<p>Medical University York New 
Figure 1: Calcul de surfaces pour les sous-s&#233;quences de New York 
University Medical Center 
</p>
<p>occurrences 
</p>
<p>tokens 
</p>
<p>surface = 513 
</p>
<p>200 
surface = 364 
</p>
<p>surface = 96 
</p>
<p>s rf ce  22 
</p>
<p>24 
</p>
<p>50 
</p>
<p>100 
</p>
<p>150 
</p>
<p>182 
174 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Normalisation des entit&#233;s nomm&#233;es : pour une approche mixte et orient&#233;e utilisateurs 
</p>
<p>mal identifi&#233;s quant &#224; eux, permettent d&#8217;identifier les difficult&#233;s qui expliquent que le calcul 
de surface ne soit pas efficace. Soit le nom brut suivant : 
</p>
<p>6. Nagoya City University Medical School 
</p>
<p>Notons que nous consid&#233;rons Nagoya City comme un nom compos&#233;, puisqu&#8217;il s&#8217;agit du nom 
complet de l&#8217;universit&#233;. Les trois sous-s&#233;quences test&#233;es sont les suivantes :  
</p>
<p>Sous-s&#233;quence Fr&#233;quence Surface 
</p>
<p>City University 151 302 
</p>
<p>Nagoya City University 48 144 
</p>
<p>Nagoya City University 
Medical 
</p>
<p>15 60 
</p>
<p>Tableau 2: Fr&#233;quences et surfaces pour les sous-s&#233;quences de Nagoya City University Medical School 
</p>
<p>Le calcul de fr&#233;quence comme le calcul de surface sont inefficaces sur ce nom. En effet, s&#8217;ils 
permettent d&#8217;&#233;liminer Medical sans &#233;quivoque, ils ne permettent pas de conserver Nagoya, 
puisque la fr&#233;quence et la surface de Nagoya City University sont inf&#233;rieures &#224; celles de City 
University. La pr&#233;sence de City, un mot trop &#171; g&#233;n&#233;rique &#187; et donc trop fr&#233;quent dans notre 
corpus, emp&#234;che une normalisation correcte de ce nom d&#8217;organisation.  
</p>
<p>Pour d&#233;passer cette difficult&#233;, nous envisageons de coupler ces calculs &#224; un calcul de 
fr&#233;quence des items de mani&#232;re isol&#233;e. Nous avons pu observer en corpus que lorsqu&#8217;un mot 
voisin d&#8217;une amorce &#233;tait le moins fr&#233;quent d&#8217;une s&#233;quence, il permettait de situer le point de 
rupture entre le nom d&#8217;organisation coh&#233;rent et le &#171; bruit &#187;. G&#233;n&#233;ralement, ce mot peu 
fr&#233;quent est inclus dans le nom d&#8217;organisation, et la rupture se situe juste avant ou apr&#232;s lui. 
Par exemple, pour le nom 6, nous avons les fr&#233;quences suivantes : 
</p>
<p>tokens Nagoya City University Medical 
</p>
<p>fr&#233;quences 756 3153 40118 14930 
</p>
<p>courbe  
</p>
<p>Figure 2: Courbe des fr&#233;quences des tokens pour la sous-s&#233;quence Nagoya CIty University Medical 
</p>
<p>De cette mani&#232;re, nous pouvons d&#233;terminer que Nagoya fait bien partie du nom d&#8217;organisation 
le plus coh&#233;rent. Le calcul de fr&#233;quences ou de surfaces permettra d&#8217;&#233;liminer Medical, et nous 
obtenons donc en sortie du traitement Nagoya City University comme nom le plus coh&#233;rent. 
</p>
<p>Conclusion 
</p>
<p>A travers cet article, nous avons abord&#233; le probl&#232;me complexe de la normalisation des entit&#233;s 
nomm&#233;es, situ&#233; en amont de diff&#233;rentes t&#226;ches de traitement de l'information. Les retomb&#233;es 
impliqu&#233;es par une normalisation pr&#233;cise des entit&#233;s nomm&#233;es sont tr&#232;s importantes lorsque 
les t&#226;ches de traitement de l&#8217;information doivent atteindre un degr&#233; de pr&#233;cision important, 
comme c'est le cas pour la plupart des acteurs du domaine du traitement automatique des 
langues et de l&#8217;ing&#233;nierie linguistique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vanessa Andr&#233;ani 
</p>
<p>Une approche endog&#232;ne permet de couvrir des cas non r&#233;solus par d&#8217;autres m&#233;thodes, 
particuli&#232;rement dans des domaines sp&#233;cialis&#233;s pour lesquels il n&#8217;existe pas ou peu de 
ressources, et d&#8217;autant moins lorsque le travail porte sur les entit&#233;s nomm&#233;es.  
</p>
<p>Le fait d&#8217;allier cette m&#233;thode &#224; d&#8217;autres techniques, comme l&#8217;utilisation de patrons ou des 
mesures de similarit&#233;, permet d&#8217;obtenir une couverture bien plus large que ce vers quoi nous 
pourrions tendre avec un syst&#232;me n&#8217;utilisant qu&#8217;un seul type de processus. De cette mani&#232;re, 
tous les points de difficult&#233; peuvent &#234;tre trait&#233;s. De plus, l&#8217;intervention de l&#8217;utilisateur dans la 
constitution des donn&#233;es garantit leur qualit&#233; et leur fiabilit&#233;, indispensables aux traitements 
ult&#233;rieurs qui prennent ces informations en entr&#233;e. 
</p>
<p>R&#233;f&#233;rences 
ALPHONSE E., AUBIN S., BESSIERES P., BISSON G., HAMON T., LAGARRIGUE S., 
NAZARENKO A., NEDELLEC C., OULD ABDEL VETAH M., POIBEAU T., WEISSENBACHER D. 
(2004). Extraction d'information appliqu&#233;e au domaine biom&#233;dical - apprentissage et 
traitement automatique de la langue. Actes de CIFT. 
</p>
<p>AUSSENAC-GILLES N. (2007). Projet DaFOE4App - Dossier A.0 / Document A.0.1 - Etat de 
l'art et &#233;tude des besoins pour une plateforme de construction d'ontologies. Rapport de 
contrat, IRIT/RT&#8212;2007-2&#8212;FR, IRIT. 
</p>
<p>BOURIGAULT D. (1993). An endogenous Corpus Based Method for Structural Noun Phrase 
Disambiguation. Actes de la Conference of the European Chapter of ACL (EACL), 81-86.  
BOURIGAULT D., FREROT C. (2006). Acquisition et &#233;valuation sur corpus de propri&#233;t&#233;s de 
sous-cat&#233;gorisation syntaxique. TAL 47, 141-154. 
</p>
<p>EHRMANN M., JACQUET G. (2006). Vers une double annotation des Entit&#233;s Nomm&#233;es. TAL 47, 
63-88. 
</p>
<p>ELMAGARMID A.K., IPEIROTIS P.G., VERYKIOS V.S. (2007). Duplicate Record Detection : A 
Survey. IEEE Transactions on Knowledge and Data Engineering 19, 1-16. 
</p>
<p>JIJKOUN V., KHALID M.A., MARX M., DE RIJKE M. (2008). Named Entity Normalization in 
User Generated Content. Actes de SIGIR 2008 &#8211; Workshop on Analytics for Noisy 
Unstructured Text Data.  
</p>
<p>KHALID M.A., JIJKOUN V., DE RIJKE M. (2008). The Impact of Named Entity Normalization 
on Information Retrieval for Question Answering. LNCS 4956. 
</p>
<p>POIBEAU T. (2003). Extraction automatique d'information : du texte brut au web s&#233;mantique. 
Paris : Herm&#232;s. 
</p>
<p>VERGNE J. (2004). D&#233;couverte locale des mots vides dans des corpus bruts de langues 
inconnues, sans aucune ressource. Actes des JADT 2004 2, 1158-1164. </p>

</div></div>
</body></html>