<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Techniques argumentatives pour aider &#224; g&#233;n&#233;rer des descriptions orient&#233;es d&#8217;un &#233;v&#233;nement</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2009, Senlis, 24-26 juin 2009 
</p>
<p>Techniques argumentatives pour aider &#224; g&#233;n&#233;rer des descriptions 
orient&#233;es d&#8217;un &#233;v&#233;nement 
</p>
<p>Sara Boutouhami 
</p>
<p>LIPN &#8211; Universit&#233; Paris-Nord, 
99 Avenue J.B.Cl&#233;ment 93430 Villetaneuse 
</p>
<p>boutouhami@lipn.univ-paris13.fr 
</p>
<p>R&#233;sum&#233; Les moyens et les formes strat&#233;giques permettant la g&#233;n&#233;ration de descriptions 
textuelles argument&#233;es d&#8217;une m&#234;me r&#233;alit&#233; effective sont nombreux. La plupart des d&#233;finitions 
propos&#233;es de l&#8217;argumentation partagent l&#8217;id&#233;e qu&#8217;argumenter c&#8217;est fournir les &#233;l&#233;ments en 
faveur d&#8217;une conclusion donn&#233;e. Or dans notre t&#226;che qui consiste &#224; g&#233;n&#233;rer des descriptions 
argument&#233;es pour des accidents de la route, nous ne disposons pas uniquement d&#8217;&#233;l&#233;ments en 
faveur de la conclusion souhait&#233;e mais aussi d&#8217;&#233;l&#233;ments qui vont &#224; l&#8217;encontre de cette derni&#232;re 
et dont la pr&#233;sence est parfois obligatoire pour la compr&#233;hension de ces descriptions. Afin de 
rem&#233;dier &#224; ce probl&#232;me, nous proposons des techniques de g&#233;n&#233;ration de descriptions 
argument&#233;es qui pr&#233;sentent au mieux les &#233;l&#233;ments ind&#233;sirables &#224; l&#8217;aide de strat&#233;gies 
argumentatives. 
</p>
<p>Abstract Strategic means and forms for the generation of textual descriptions of a same 
reality are numerous. Most definitions of the argumentation given in the literature share the 
idea that to argument we must provide elements in favor of a given conclusion. Unfortunately, 
in our task consisting in generating biased descriptions of a road crash, we do not have only 
elements in favor of the desired conclusion, but also elements that are against it and must 
nevertheless be present in the description unless we cannot be able to understand how the 
accident happened. To remedy this problem, we proposed a module in our system for 
generating biased descriptions that handles the task of presenting better the undesirable 
elements using argumentative techniques. 
</p>
<p>Mots-cl&#233;s : Argumentation, Insinuation, Norme coutumi&#232;res, Justification. 
Keywords: Argumentation, Insinuation, Customary norms, Justification.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Boutouhami 
</p>
<p>1 Introduction 
L&#8217;argumentation est tr&#232;s pr&#233;sente dans un grand nombre de disciplines. Elle est soit centrale 
quand elle repr&#233;sente l'objet m&#234;me du traitement, soit secondaire quand elle appara&#238;t au cours 
des traitements effectu&#233;s autour de l&#8217;analyse du discours et de la linguistique textuelle, des 
sciences de l&#8217;information et de la communication et en sciences cognitives. Dans notre travail, 
nous nous int&#233;ressons &#224; l&#8217;expression d&#8217;argumentations en Langue Naturelle (LN). Notre &#233;tude 
est &#233;troitement li&#233;e &#224; la nature du processus de compr&#233;hension de la langue. Nous nous 
pla&#231;ons dans une vision inf&#233;rentielle dans laquelle la compr&#233;hension d&#8217;un texte est assimil&#233;e 
aux conclusions qu&#8217;un lecteur humain peut tirer de sa lecture par un raisonnement de bon sens 
bas&#233; sur sa connaissance du domaine. Dans cette optique, le but de l&#8217;argumentation d&#8217;un 
auteur est de d&#233;clencher des inf&#233;rences aupr&#232;s du lecteur le conduisant finalement &#224; conclure 
ce qui &#171;arrange&#187; l&#8217;auteur. Ce travail est accompli &#224; travers l&#8217;exploitation de deux volets : le 
volet raisonnement et le volet langage. Ces deux volets ne sont pas mutuellement exclusifs : 
les r&#232;gles de raisonnement puisent une partie de leur force en exploitant la souplesse et la 
vari&#233;t&#233; d&#8217;expression du langage naturel. Notre objectif final est la r&#233;alisation d&#8217;un syst&#232;me qui 
permet de construire la description d&#8217;une situation d&#8217;accident de la route qui soit &#171; la mieux &#187; 
argument&#233;e, dans le sens o&#249; elle tend &#224; minimiser la responsabilit&#233; de l&#8217;agent d&#233;fendu en 
employant diff&#233;rentes strat&#233;gies d&#8217;argumentation selon les cas de figure (l&#8217;agent d&#233;fendu est 
fautif, l&#8217;adversaire est fautif, les deux agents partagent la responsabilit&#233; de l&#8217;accident). Deux 
objectifs &#224; long terme ont motiv&#233; notre travail. Un objectif th&#233;orique qui est d'&#234;tre capable de 
capter et expliciter l&#8217;intuition qui nous permet de diff&#233;rencier une bonne d&#8217;une mauvaise 
argumentation. Cette explicitation r&#233;v&#232;lerait des &#233;l&#233;ments importants pour le raisonnement de 
sens commun, qu&#8217;il importe de mieux conna&#238;tre lorsqu&#8217;on fait du Traitement Automatique des 
Langues. Et un objectif pratique, qui consiste &#224; contribuer au d&#233;veloppement d'un syst&#232;me 
d'&#8217;aide &#224; la r&#233;daction de textes argument&#233;s. 
</p>
<p>Plusieurs travaux ont &#233;t&#233; faits sur l&#8217;argumentation ; Plantin (PLANTIN, 1990) distingue des 
probl&#233;matiques de l'argumentation selon qu'il s'agit d'un fait de la langue (DUCROT 1980, 
ANSCOMBRE, DUCROT, 1983) ou bien du discours ; et dans cette derni&#232;re cat&#233;gorie, selon que 
son but est d&#8217;&#233;tablir une v&#233;rit&#233;, par un raisonnement logique ou scientifique formel 
(GRIZE, 1990, DUNG, 1995) ou informel (TOULMIN, 1958), ou encore d'agir dans un but 
d'efficacit&#233; rh&#233;torique (PERELMAN, OLBRECHTS-TYTECA, 1985). 
</p>
<p>Parmi ces travaux nous nous sommes inspir&#233;s particuli&#232;rement des travaux de Ducrot et 
Anscombre qui se sont int&#233;ress&#233;s &#224; l&#8217;analyse de l'argumentation au niveau de la langue. Pour 
ces auteurs, l'&#233;tude de l'argumentation est l'&#233;tude des capacit&#233;s projectives des &#233;nonc&#233;s 
(pouvoir pr&#233;dire la suite d'un &#233;nonc&#233;). Argumenter c'est &#171; pr&#233;senter un &#233;nonc&#233; E1 (ou un 
ensemble d&#8217;&#233;nonc&#233;s) comme destin&#233; &#224; faire admettre un autre &#233;nonc&#233; (ou un ensemble 
d&#8217;autres &#233;nonc&#233;s) E2 &#187; (ANSCOMBRE , DUCROT, 1983). Ceci est formalis&#233; par la notion de 
d'orientation (ou de valeur argumentative) d'un &#233;nonc&#233;, qui fonde le principe de la th&#233;orie des 
&#233;chelles argumentatives. Anscombre et Ducrot, ont propos&#233; une th&#233;orie des topo&#239;. Ils 
d&#233;finissent le topos comme &#8216;garant&#8217; i.e., comme un troisi&#232;me terme qui autorise le passage ou 
l&#8217;encha&#238;nement discursif d&#8217;un argument qui justifie l&#8217;autre &#233;l&#233;ment comme une conclusion 
(ANSCOMBRE, 1995). L'analyse des mots de liaison (connecteurs) occupe une place importante 
dans cette th&#233;orie, vu qu'ils d&#233;finissent la nature des liaisons entre les &#233;nonc&#233;s, ainsi que des 
liens entre &#233;nonc&#233; et &#233;nonciation. Ducrot s'est beaucoup int&#233;ress&#233; aussi &#224; la distinction entre le 
pr&#233;suppos&#233;, le pos&#233; et le sous-entendu ; nous allons voir l&#8217;utilisation pratique de ces notions 
au cours de notre travail par la suite (DUCROT, 1972). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Techniques argumentatives pour aider &#224; g&#233;n&#233;rer des descriptions orient&#233;es d&#8217;un &#233;v&#233;nement 
</p>
<p>Le plan de l&#8217;article est le suivant : la section 2 pr&#233;sente notre d&#233;marche g&#233;n&#233;rale de 
l&#8217;argumentation ainsi que le domaine d&#8217;application. La section 3 d&#233;crit les techniques 
d&#8217;argumentation ainsi que l&#8217;&#233;tat actuel de l&#8217;impl&#233;mentation de notre syst&#232;me. La section 4 met 
en perspective les r&#233;sultats d&#233;j&#224; obtenus et conclut l&#8217;article. 
</p>
<p>2 Domaine d&#8217;application et d&#233;marche d&#8217;argumentation 
</p>
<p>2.1 Domaine d&#8217;application 
</p>
<p>Nous avons choisi comme champ d&#8217;application le domaine des accidents de la route. Notre 
choix est motiv&#233; entre autres par le fait que ce domaine a &#233;t&#233; abondamment &#233;tudi&#233; de 
diff&#233;rents points de vue et que notre &#233;quipe en l'occurrence a d&#233;j&#224; une expertise importante 
dans ce domaine (voir par exemple TAL, 1994). Comme on le sait, les conducteurs impliqu&#233;s 
dans un accident sont amen&#233;s &#224; r&#233;diger, au verso des &#171;constats amiables&#187;, des rapports 
textuels courts d&#233;crivant les circonstances de l&#8217;accident, qui sont destin&#233;s &#224; leur compagnie 
d&#8217;assurances. Quoique celles-ci ne semblent utiliser qu&#8217;exceptionnellement ces textes, leurs 
auteurs les r&#233;digent g&#233;n&#233;ralement dans l&#8217;id&#233;e qu'ils vont servir &#224; d&#233;terminer leur 
responsabilit&#233;. Ils essaient donc naturellement de pr&#233;senter les choses de la mani&#232;re la plus 
avantageuse pour eux, l&#8217;argumentation est de ce fait omnipr&#233;sente dans ces textes qui 
repr&#233;sentent ainsi un champ id&#233;al pour &#233;tudier les strat&#233;gies argumentatives que les auteurs 
ont tendance &#224; utiliser.  
</p>
<p>Le choix de ce domaine se justifie aussi par le fait qu&#8217;il fait appel &#224; un contexte lexical et 
s&#233;mantique assez restreint et &#224; un ensemble de normes1 dont nous avons identifi&#233; une grande 
partie. Les gens n&#8217;ont donc pas besoin de connaissances particuli&#232;res, comme tel est le cas par 
exemple dans le domaine de la m&#233;decine, pour comprendre un texte d&#233;crivant un accident de 
voiture, de pouvoir extraire les informations implicites et de pouvoir r&#233;pondre &#224; des questions 
comme: &quot;Qu'est-ce qui a caus&#233; l'accident&quot; ou &quot;qui est le responsable de l'accident&quot;. De plus, 
les situations d&#8217;accident sont vari&#233;es ce qui permet d&#8217;alimenter largement notre &#233;tude par des 
cas et des besoins d&#8217;argumentation divers (BOUTOUHAMI, KAYSER, 2008). 
</p>
<p>2.2 D&#233;marche d&#8217;argumentation 
</p>
<p>Notre objectif principal est la r&#233;alisation d&#8217;un syst&#232;me qui permet de construire la description 
d&#8217;une situation d&#8217;accident de la route qui soit &#171; la mieux &#187; argument&#233;e possible, dans le sens 
o&#249; elle tend &#224; minimiser la responsabilit&#233; de l&#8217;agent d&#233;fendu en employant diff&#233;rentes 
strat&#233;gies d&#8217;argumentation. Nous supposons disposer d&#8217;une description &#171; compl&#232;te et neutre &#187; 
d&#8217;un &#233;v&#233;nement qui s&#8217;est r&#233;ellement produit (un accident de la route ici). Notre objectif est de 
nous servir de cette description pour construire une description qui (i) contient suffisamment 
d&#8217;informations pour que son lecteur puisse reconstituer les grandes lignes de cet &#233;v&#233;nement, 
(ii) ne contient aucune contre-v&#233;rit&#233;, (iii) donne au lecteur la meilleure image possible du 
comportement de l&#8217;un des protagonistes de l&#8217;&#233;v&#233;nement. C&#8217;est ce que nous appelons une 
description argument&#233;e. 
</p>
<p>Notre point de d&#233;part est donc une description d&#233;taill&#233;e d&#8217;un accident de la route. Cette 
description contient l&#8217;ensemble E de tous les faits relatifs &#224; l'accident : nous avons inf&#233;r&#233; ces 
                                                 
</p>
<p>1
 La notion de norme se rapporte aux d&#233;roulements normaux des &#233;v&#233;nements. Une norme repr&#233;sente un &#233;tat 
</p>
<p>habituel, r&#233;gulier et conforme &#224; la majorit&#233; des cas. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Boutouhami 
</p>
<p>faits en nous basant sur un rapport authentique de notre corpus2. Les descriptions g&#233;n&#233;r&#233;es 
doivent rapporter les faits jug&#233;s indispensables pour comprendre comment l'accident a eu lieu. 
Ces faits appartiennent alors &#224; une liste nomm&#233;e liste minimale. Un fait appartient &#224; la liste 
minimale si et seulement s&#8217;il n&#8217;est pas inf&#233;rable &#224; partir du reste des faits rapport&#233;s et qu&#8217;en 
son absence, nous ne pouvons plus comprendre le d&#233;roulement de l&#8217;accident. Pour l'instant 
nous ne nous int&#233;ressons pas &#224; automatiser la construction de la liste minimale (ce qui peut 
&#234;tre une t&#226;che tr&#232;s difficile) ; nous nous contentons de la construire manuellement et de 
l&#8217;utiliser en entr&#233;e de notre syst&#232;me avec la liste E. Nous visons &#224; construire une liste 
ordonn&#233;e de pr&#233;dications qui serviront de trame &#224; la r&#233;daction du &#171; meilleur rapport possible &#187; 
pour le point de vue d&#8217;un des protagonistes de l&#8217;accident. 
</p>
<p>Dans une premi&#232;re &#233;tape, nous attribuons un &#171;statut argumentatif&#187; &#224; chaque proposition de la 
liste. Le statut argumentatif d&#8217;un fait donn&#233; permet de d&#233;terminer la fa&#231;on dont il faut le 
pr&#233;senter pour qu&#8217;il contribue positivement &#224; notre but d&#8217;argumentation. On distingue 
initialement deux principaux statuts argumentatifs : bon &#224; dire, mauvais &#224; dire. Comme leur 
nom l'indique, les faits bons &#224; dire sont les faits susceptibles d&#8217;orienter positivement notre 
argumentation alors que les mauvais &#224; dire ont plut&#244;t l&#8217;effet inverse. L&#8217;attribution de ces 
statuts argumentatifs est effectu&#233;e &#224; l&#8217;aide d&#8217;un ensemble de r&#232;gles qui se basent sur les 
normes et les  connaissances de bon sens du domaine de la conduite. 
</p>
<p>Selon Grize, argumenter peut s&#8217;entendre de deux fa&#231;ons : d&#8217;une part, c&#8217;est obtenir l&#8217;adh&#233;sion 
de quelqu'un &#224; une th&#232;se, c&#8217;est-&#224;-dire &#233;viter qu&#8217;il produise un contre-discours. D&#8217;autre part, et 
conform&#233;ment aux dictionnaires, c&#8217;est fournir des arguments en faveur d&#8217;une th&#232;se ou contre 
elle (GRIZE, 1986). Une interpr&#233;tation simple de cette d&#233;finition serait de dire que la meilleure 
d&#233;marche d&#8217;argumentation est de ne pr&#233;senter que les faits en faveur de notre conclusion (faits 
bons &#224; dire) et de ne rien dire sur les faits qui ne sont pas en sa faveur (faits mauvais &#224; dire). 
Or malheureusement, certains faits s&#8217;av&#232;rent indispensables pour la compr&#233;hension des 
descriptions g&#233;n&#233;r&#233;es, alors qu&#8217;ils sont &#233;tiquet&#233;s &#171; mauvais &#224; dire &#187;. Nous avons propos&#233; trois 
techniques pour traiter ces faits qui ne sont pas bons &#224; dire mais qui doivent figurer 
explicitement ou implicitement dans la description finale. 
</p>
<p>3 Techniques d&#8217;argumentation 
Les trois techniques que nous proposons sont appliqu&#233;es dans l&#8217;ordre de priorit&#233; suivant : 
l&#8217;insinuation, la justification et l&#8217;appel aux normes coutumi&#232;res. 
Nous avons jug&#233; la technique d&#8217;insinuation comme &#233;tant la plus prioritaire, vu que les 
&#233;l&#233;ments insinu&#233;s ne vont pas figurer explicitement, bien qu&#8217;ils puissent &#234;tre d&#233;cel&#233;s apr&#232;s 
r&#233;flexion du lecteur. L&#8217;effort demand&#233; au lecteur ne nous para&#238;t pas trop contraignant et est 
pr&#233;f&#233;rable au risque de choquer le lecteur en les exprimant ouvertement, car ce choc irait &#224; 
l&#8217;encontre de notre but d&#8217;argumentation. Nous ne disposons pas de r&#232;gles d&#8217;insinuation pour 
tous les cas de figures pr&#233;sents dans notre corpus. A d&#233;faut de ce type de r&#232;gles dans un cas 
donn&#233;, nous faisons appel &#224; la deuxi&#232;me technique : la justification. Cette technique est 
largement utilis&#233;e en pratique : nous essayons souvent de coupler les faits ind&#233;sirables avec 
</p>
<p>                                                 
</p>
<p>2
 Ce corpus, obtenu gr&#226;ce &#224; la compagnie d&#8217;assurance MAIF que nous remercions ici, contient 160 rapports 
</p>
<p>que nous avons anonymis&#233;s ; il est disponible sur la page http://www-lipn.univ-
paris13/~kayser/corpus160.pdf 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Techniques argumentatives pour aider &#224; g&#233;n&#233;rer des descriptions orient&#233;es d&#8217;un &#233;v&#233;nement 
</p>
<p>d&#8217;autres faits afin de les rendre le plus acceptables possible. La troisi&#232;me technique est la 
technique qui fait appel aux normes coutumi&#232;res (voir &#167;3.3). 
</p>
<p>Ces techniques constituent l&#8217;un des modules de notre syst&#232;me de g&#233;n&#233;ration de descriptions 
argument&#233;es. Ce module alimente un autre module qui &#224; pour objectif l&#8217;am&#233;lioration de la 
sortie finale de notre syst&#232;me. Une des t&#226;ches effectu&#233;es par ce dernier module est 
l&#8217;interpr&#233;tation s&#233;mantique des liaisons entre les faits (&#224; l'aide de connecteurs) afin d'am&#233;liorer 
la coh&#233;rence de la pr&#233;sentation. Nous profitons ainsi des orientations argumentatives de ces 
connecteurs. 
</p>
<p>3.1 Insinuation 
</p>
<p>Comme nous l&#8217;avons d&#233;j&#224; dit, nous sommes parfois dans l'obligation de dire certains faits qui 
ne nous arrangent pas et qui risquent d'affecter gravement notre argumentation. C&#8217;est le cas, 
des faits &#171; mauvais &#224; dire &#187; mais appartenant &#224; la liste minimale. L&#8217;insinuation concerne les 
faits qui ne sont pas (resp. qui sont) en faveur du protagoniste que nous d&#233;fendons (resp. 
l'autre protagoniste). Elle permet de faire indirectement comprendre ces faits et de les 
pr&#233;senter d'une mani&#232;re souple et att&#233;nu&#233;e. 
</p>
<p>La notion d'insinuation que nous pr&#233;sentons dans ce papier se rapproche significativement du 
concept d'implicite qui a fait l'objet de plusieurs &#233;tudes et qui a suscit&#233; beaucoup d&#8217;int&#233;r&#234;t 
(KERBRAT-ORECCHIONI, 1986; DUCROT, 1972). Les faits ne sont pas imp&#233;rativement exprim&#233;s 
ouvertement ou explicitement, il arrive souvent -volontairement- qu&#8217;ils soient v&#233;hicul&#233;s de 
fa&#231;on indirecte dans les &#233;nonc&#233;s, parfois m&#234;me &#171; entre les lignes &#187;. Ceci peut se faire en 
utilisant les pr&#233;suppos&#233;s, les pos&#233;s, les sous-entendus et les implications. 
</p>
<p>Pour nous, l'insinuation d'un fait f1 consiste &#224; le remplacer par un autre fait f2 tel que : (i) f1 
peut &#234;tre inf&#233;r&#233; de f2, et (ii) f2 est jug&#233; avoir un impact moins n&#233;gatif que f1 par rapport au but 
de l&#8217;argumentation. 
</p>
<p>Nos r&#232;gles d&#8217;insinuation sont con&#231;ues pour sous-entendre et faire inf&#233;rer indirectement ces 
faits. La relation &quot;f1 peut &#234;tre inf&#233;r&#233; de f2&quot; est bas&#233;e soit sur des connaissances du domaine soit 
sur la flexibilit&#233; s&#233;mantique et pragmatique du langage naturel. 
</p>
<p>La r&#232;gle qui lie les faits f2 &#224; f1 peut &#234;tre exprim&#233;e par : 
</p>
<p>&#8226; Une r&#232;gle d&#8217;implication stricte entre ces deux faits &#171; f2&#8594;f1 &#187; 
Cette implication peut &#234;tre interpr&#233;t&#233;e pratiquement de diverses mani&#232;res: elle peut 
exprimer les devoirs li&#233;s aux r&#232;gles du code de la route, comme elle peut exprimer des 
cons&#233;quences ou des causes de certaines positions sur la route. On peut faire appel &#224; un 
raisonnement abductif ou d&#233;ductif pour faire fonctionner ces r&#232;gles en fonction du besoin 
et de la situation pr&#233;sente. 
</p>
<p>Exemple : R&#232;gle de code de la route : &#171; la personne qui roule sur une route secondaire et 
veut acc&#233;der &#224; une route principale est moins prioritaire qu&#8217;une personne qui roule sur 
une route principale &#187;. Le fait (f2) : &#171; une personne, venant d&#8217;une route secondaire, veut 
acc&#233;der &#224; la route principale &#187;, fait automatiquement appel &#224; la pr&#233;c&#233;dente r&#232;gle et donne 
le nouveau fait (f1) : &#171; cette personne n&#8217;a pas la priorit&#233; &#187;. Dans un texte d&#233;crivant un 
accident de la route cons&#233;cutif &#224; un refus de priorit&#233;, il est plus prudent d&#8217;exprimer le fait 
f2 qui nous semble plus neutre que le fait f1. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Boutouhami 
</p>
<p> 
</p>
<p>&#8226; Un d&#233;faut : f1 est inf&#233;r&#233; par d&#233;faut, &#224; partir de f2 
1. Nous ne disposons jamais de toutes les informations r&#233;gissant le d&#233;roulement d&#8217;un 
</p>
<p>accident de la route et nos r&#232;gles de raisonnement ne peuvent pas se limiter aux 
implications logiques, car celles-ci ne permettent pas de g&#233;rer les exceptions qui sont 
inh&#233;rentes aux situations rencontr&#233;es dans la vie courante. Nous avons donc besoin de 
d&#233;fauts dont la s&#233;mantique permet le raisonnement en pr&#233;sence d&#8217;exceptions ainsi que 
dans le cas o&#249; certaines informations ne sont pas disponibles. Cette possibilit&#233; 
d&#8217;inf&#233;rence en l'absence de certaines informations caract&#233;rise le raisonnement humain 
de bon sens. Nous exploitons cette souplesse pour faire inf&#233;rer certaines informations 
sous-entendues, dont la pr&#233;sence n&#8217;est que suppos&#233;e et pas explicit&#233;e. 
</p>
<p>     Exemple : Le but d&#8217;une argumentation dans le domaine des accidents de la route est 
de donner une meilleure image possible de l&#8217;un des deux protagonistes, ce qui conduit 
&#224; &#233;viter d&#8217;&#233;voquer tout ce qui peut &#234;tre en faveur de son adversaire. 
</p>
<p>     La r&#232;gle de code de la route : &#171; Il faut signaler tout changement de direction avant de 
tourner &#187; jointe au fait qu&#8217;il n&#8217;est pas souhaitable de souligner que l&#8217;adversaire 
respecte le code m&#232;ne &#224; sous-entendre le fait f1 : &#171; l&#8217;autre protagoniste a signal&#233; son 
changement de direction &#187; par une formulation plus neutre f2 : &#171; l&#8217;autre conducteur a 
voulu tourner &#187;. 
</p>
<p>2. Comme nous l&#8217;avons d&#233;j&#224; exprim&#233; plus haut, un topos est une r&#232;gle s&#233;mantique qui 
relie deux entit&#233;s P et Q et qui peut prendre quatre formes diff&#233;rentes. &lt;+P, +Q&gt;, &lt;+P, -
Q&gt;, &lt;-P, +Q&gt; ou encore &lt;-P, -Q&gt;. En se basant sur un des principes de Ducrot dans sa 
d&#233;finition des topo&#239; et qui consiste &#224; dire que certaines croyances sont consid&#233;r&#233;es 
comme communes &#224; une certaine communaut&#233; ou &#224; un groupe dont au moins le locuteur 
et son allocutaire font partie (DUCROT, 1995), on suppose que la pr&#233;sence de l&#8217;une des 
deux entit&#233;s P ou Q d&#233;clenche la pr&#233;sence dans l&#8217;esprit de la deuxi&#232;me entit&#233;. Ceci peut 
&#234;tre accompli de fa&#231;on intrins&#232;que ou extrins&#232;que (en fonction du contexte). 
</p>
<p>Exemple &#171; plus on roule vite, plus on a de difficult&#233; &#224; s&#8217;arr&#234;ter &#187;. On peut faire appel &#224; 
ce topos dans le cas des accidents de la route et dire f1 : &#171; il a frein&#233; brutalement pour 
s'arr&#234;ter au feu &#187; qui aura comme but de sous-entendre le fait f2 : &#171; cette personne 
roulait trop vite &#187;. 
</p>
<p>&#8226; Une r&#232;gle d&#8217;&#233;quivalence : &#171; f1&#8596;f2 &#187;. 
L&#8217;&#233;quivalence logique entre les deux composants de ce type de r&#232;gle, n&#8217;emp&#234;che pas qu&#8217;il 
y ait n&#233;anmoins une diff&#233;rence dans leurs capacit&#233;s &#224; d&#233;clencher d&#8217;autres inf&#233;rences. A 
titre d&#8217;illustration, si &#171; C &#187; est une cons&#233;quence possible de &#171; A &#187;, malgr&#233; l&#8217;&#233;quivalence 
entre &#171; A &#187; et &#171; B &#187;, dans certains cas &#171; C &#187; est plus facilement accessible de &#171; A &#187; que de 
&#171;B&#187;. 
</p>
<p>La n&#233;gation linguistique joue un r&#244;le dans le processus argumentatif et peut avoir des 
effets diff&#233;rents. Dans certains situations il est pr&#233;f&#233;rable d&#8217;utiliser A au lieu de &#172;&#172;A et 
inversement. A titre d&#8217;exemple, il est pr&#233;f&#233;rable de dire &#171; je n&#8217;ai pas pu l&#8217;&#233;viter &#187; au lieu 
de dire &#171; je l&#8217;ai heurt&#233; &#187;. Le contenu informatif est le m&#234;me, mais l&#8217;impact de l&#8217;utilisation 
de la n&#233;gation par rapport au but argumentatif ne nous para&#238;t pas identique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Techniques argumentatives pour aider &#224; g&#233;n&#233;rer des descriptions orient&#233;es d&#8217;un &#233;v&#233;nement 
</p>
<p>    Exemple : &#171; le v&#233;hicule A se trouve &#224; droite du v&#233;hicule B &#187; est &#233;quivalent au fait de 
dire &#171; le v&#233;hicule B se trouve &#224; gauche de A&#187;. Dans le cas du processus de g&#233;n&#233;ration 
d&#8217;une description argument&#233;e en faveur du conducteur du v&#233;hicule A, on peut opter pour 
l'utilisation de la premi&#232;re formulation car un v&#233;hicule &#224; droite &#233;voque imm&#233;diatement 
l&#8217;id&#233;e de priorit&#233;, qui est une conclusion que l&#8217;on souhaite favoriser dans l&#8217;esprit du 
lecteur, alors que c&#8217;est une cons&#233;quence plus indirecte de la deuxi&#232;me formulation.  
</p>
<p>3.2 Justification 
Comme nous l&#8217;avons d&#233;j&#224; dit, la technique de justification est appliqu&#233;e lorsque nous ne 
trouvons pas de moyen d&#8217;insinuation. La justification est l&#8217;action qui tente de rendre l&#233;gitime 
quelque chose (une action ou l&#8217;abstention d'ex&#233;cuter une action) en fournissant une 
explication ou un motif valable. 
</p>
<p>La justification d&#8217;un fait f1 consiste &#224; choisir parmi la liste effective d&#8217;entr&#233;e un autre fait (ou 
un ensemble de faits) f2, tel que l&#8217;ajout de f2 &#224; f1 provoque une meilleure impression que si f1 
&#233;tait mentionn&#233; seul. 
</p>
<p>L&#8217;impact de &#171; f2 avec f1 &#187; est pr&#233;f&#233;rable &#224; &#171; f1 seul &#187;lorsqu&#8217;il existe une relation entre les deux 
faits qui peut exprimer une relation de causalit&#233;, d&#8217;explication, ou de cons&#233;quence. Ces 
relations peuvent aussi exprimer des intentions, des buts et des croyances (dans ce cas, le but 
est d&#8217;essayer d&#8217;expliquer le bien fond&#233; de la conduite du protagoniste d&#233;fendu). 
</p>
<p>&#8226; Utilisation d&#8217;une relation cause/cons&#233;quence : 
 La connaissance causale intervient sous diverses formes en argumentation. On peut 
distinguer les argumentations &#233;tablissant une relation causale (AMGOUD, PRADE, 2007) 
des argumentations exploitant une relation causale : les argumentations par la cause, par 
les cons&#233;quences. Cette forme d'argumentation est plus courante que celle consistant &#224; 
&#233;tablir une relation causale. 
</p>
<p>La relation causale permet de justifier un accident par une seule de ses causes, celle qui 
exon&#232;re au maximum de ses responsabilit&#233;s la personne que l&#8217;on d&#233;fend. Par exemple, 
dans un passage du texte B69 de notre corpus : &#171; Mon arr&#234;t au stop n'&#233;tait pas tout &#224; fait 
rigoureux (chauss&#233;e mouill&#233;e). &#187;, l&#8217;auteur laisse entendre qu&#8217;il n&#8217;est pas responsable de la 
pluie, qui est certes un facteur d&#8217;allongement des distances de freinage, donc une cause de 
son arr&#234;t &#171; pas tout &#224; fait rigoureux &#187; &#8230; pour ne pas dire que l&#8217;&#233;tat de la chauss&#233;e &#233;tait 
parfaitement connu de lui, et qu&#8217;il n&#8217;en a pas tenu compte. 
</p>
<p>&#8226; Utilisation des intentions /croyances : 
         La technique utilis&#233;e ici consiste &#224; recourir &#224; certaines modalit&#233;s : 
</p>
<p> L&#8217;intention : L'intention est une attitude d'un agent relativement &#224; une action quand il 
d&#233;cide, suite &#224; une &#233;valuation rationnelle, d'entreprendre cette action. Les intentions sont 
largement utilis&#233;es pour justifier des choix qui se sont r&#233;v&#233;l&#233;s inappropri&#233;s. L&#8217;id&#233;e est de 
montrer la rationalit&#233; et/ou la bont&#233; des intentions de l&#8217;auteur, et que les cons&#233;quences 
ind&#233;sirables n&#8217;&#233;taient pas du tout dans son plan ou dans ses objectifs. 
Exemple : (texte B72) dans &#171; Voulant &#233;viter un chien qui traversait, j'ai heurt&#233; le 
mur ! &#187;, l&#8217;auteur avance son intention louable d&#8217;&#233;viter de heurter le chien comme 
justifiant le fait qu&#8217;il a heurt&#233; le mur. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Boutouhami 
</p>
<p>La croyance : Les croyances sont aussi utilis&#233;es pour la justification. Les mauvaises 
actions entreprises sont tout &#224; fait l&#233;gitimes dans le monde dans lequel ces croyances sont 
vraies. Ceci justifie le choix malheureux du conducteur en argumentant qu&#8217;il &#233;tait bas&#233; 
sur une information fausse, mais qu&#8217;il avait alors de bonnes raisons de croire exacte. 
</p>
<p>Exemple (texte D24) dans : &#171; La voiture B, croyant que A pouvait passer, s'est avanc&#233;e&#187;, 
l&#8217;auteur (notons qu&#8217;il s&#8217;assimile &#224; sa voiture !) dit explicitement qu&#8217;il s&#8217;est avanc&#233; (dans 
le contexte, ce n&#8217;est pas en sa faveur, car le passage est tr&#232;s &#233;troit), mais il tente de le 
justifier par sa croyance de pouvoir le faire sans g&#234;ner l&#8217;adversaire, ce qui &#233;tait bien 
entendu faux. 
</p>
<p>3.3 R&#233;f&#233;rence &#224; des normes coutumi&#232;res 
</p>
<p>Nos argumentations les plus courantes reposent sur des r&#232;gles de conduite tr&#232;s g&#233;n&#233;rales, des 
principes admis dans une soci&#233;t&#233; ou dans un groupe. Pour argumenter, on fait appel parfois 
aux &#171; normes coutumi&#232;res&#187;. Une norme coutumi&#232;re (appel&#233;e aussi r&#232;gle informelle) est une 
pratique g&#233;n&#233;rale accept&#233;e comme &#233;tant une des lois (dans notre domaine comme &#233;tant une 
soi-disant r&#232;gle de bonne conduite des conducteurs des v&#233;hicules). Des &#233;tudes socio-
psychologiques ont &#233;t&#233; effectu&#233;es sur les comportements des conducteurs de voitures dans des 
intersections afin de d&#233;terminer &#224; quel point l'utilisation de ces r&#232;gles informelles est 
influenc&#233;e par des param&#232;tres divers comme l&#8217;&#226;ge, le sexe, la profession, la position du sujet 
dans l&#8217;intersection, ... (GUNILLA, 2005), ce qui montre leur pertinence comme facteurs 
responsables de diverses pratiques des conducteurs.  
</p>
<p>Ces normes ne font pas partie des codes, mais sont largement reconnues comme l&#233;gitimes. 
Elles n&#8217;ont d&#8217;existence r&#233;elle que dans les croyances des conducteurs. Notre corpus d'&#233;tude 
montre que cette l&#233;gitimit&#233; est souvent invoqu&#233;e comme une excuse pour justifier les 
violations d'une v&#233;ritable r&#233;glementation. 
</p>
<p>L&#8217;utilisation des normes coutumi&#232;res consiste &#224; sous-entendre que l&#8217;adversaire a viol&#233; une 
telle norme. Ce qui est souvent exprim&#233; par le non respect d&#8217;un devoir alors qu&#8217;il ne s&#8217;agit pas 
r&#233;ellement d&#8217;un devoir mais juste d&#8217;une action qu&#8217;on s&#8217;attend &#224; voir effectu&#233;e par l&#8217;adversaire. 
La technique consiste &#224; justifier la violation d&#8217;une norme &#171;forte&#187;, (p. ex. s&#8217;arr&#234;ter au feu 
rouge) par le fait que l&#8217;adversaire n&#8217;a pas respect&#233; une norme &#171;faible&#187; (p. ex. d&#233;marrer quand 
le feu passe au vert). Contrairement aux justifications dans la section pr&#233;c&#233;dente, il n'y a pas 
de lien r&#233;el entre f1 et f2 en dehors de celui que la norme coutumi&#232;re elle-m&#234;me essaie de cr&#233;er 
par une sorte de &#171; mauvaise foi &#187; entre ces faits. 
</p>
<p>Exemple (texte B53) : Au feu tricolore, j&#8217;&#233;tais arr&#234;t&#233;e derri&#232;re une voiture. Le feu passant au 
vert, j&#8217;ai amorc&#233; un d&#233;marrage, mais le chauffeur du v&#233;hicule ci-dessus nomm&#233; n&#8217;a pas 
d&#233;marr&#233;. Je suis donc venue heurter l&#8217;arri&#232;re de la voiture. 
Le non-respect par l&#8217;adversaire de la norme faible &#171; quand le feu passe au vert il faut 
d&#233;marrer &#187; sert d&#8217;argument &#224; l&#8217;auteur pour violer la norme forte &#171;on doit s&#8217;assurer que la 
distance est suffisante par rapport au v&#233;hicule devant nous avant de d&#233;marrer &#187;. 
</p>
<p>3.4 Etat actuel de l&#8217;impl&#233;mentation 
</p>
<p>Notre syst&#232;me de g&#233;n&#233;ration de descriptions argument&#233;es donne d&#233;j&#224; quelques r&#233;sultats que 
nous trouvons plut&#244;t encourageants. C'est un syst&#232;me &#224; base de r&#232;gles d'inf&#233;rences non 
monotones. Nous avons utilis&#233; un fragment semi-normal de la logique des d&#233;fauts de Reiter </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Techniques argumentatives pour aider &#224; g&#233;n&#233;rer des descriptions orient&#233;es d&#8217;un &#233;v&#233;nement 
</p>
<p>pour l'&#233;criture de ces r&#232;gles d'inf&#233;rences (REITER, CRISCUOLO, 1981), parmi les points qui ont 
motiv&#233; notre choix de ce formalisme, la possibilit&#233; d&#8217;&#233;tablir un ordre de priorit&#233; entre les 
r&#232;gles utilis&#233;es dans notre syst&#232;me &#224; tous les niveaux. Pour l&#8217;impl&#233;mentation de ces r&#232;gles, 
nous avons utilis&#233; le paradigme de programmation par ensemble de r&#233;ponses (Answer Set 
Programming) bas&#233; sur la th&#233;orie des mod&#232;les stables propos&#233;e initialement dans (GELFOND, 
LIFSCHITZ, 1988). Nous avons traduit nos r&#232;gles d'inf&#233;rence par d&#233;fauts en termes de 
programmes logiques &#233;tendus et nous avons utilis&#233; le langage SMODELS3 pour faire tourner 
ces programmes. Chaque ensemble de r&#233;ponse trouv&#233; pour un programme par SMODELS 
correspond &#224; l'ensemble des litt&#233;raux appartenant &#224; une extension de la th&#233;orie des d&#233;fauts 
sous-jacente. Le nombre de r&#232;gles d'inf&#233;rence en cours d'utilisation est d'environ 230 : 132 
sont des r&#232;gles g&#233;n&#233;rales, 19 des r&#232;gles d&#8217;insinuation, 56 des r&#232;gles de justification, 5 r&#232;gles 
de normes coutumi&#232;res et 17 des r&#232;gles r&#233;dactionnelles. Nous continuons &#224; apporter des 
am&#233;liorations &#224; notre syst&#232;me qui est toujours en cours de d&#233;veloppement. L'&#233;tape suivante 
portera sur la question de la validation de notre approche. Nous pr&#233;voyons de b&#226;tir, &#224; partir 
des m&#234;mes faits sur lesquels notre syst&#232;me fonctionne, plusieurs descriptions argument&#233;es, et 
de les soumettre &#224; des &#233;valuateurs humains. Nous verrons alors comment leur jugement place 
la description fournie par notre syst&#232;me (transform&#233;e, probablement manuellement, en un 
texte en fran&#231;ais convenable) par rapport &#224; celles construites par d&#8217;autres r&#233;dacteurs. Ainsi 
nous verrons aussi la sensibilit&#233; des gens &#224; l'utilisation de mots p&#233;joratifs (exprimer clairement 
les violations de devoir). Si l'&#233;quilibre propos&#233; est bon, on pourrait alors se demander, jusqu&#8217;&#224; 
quel degr&#233; de &#171; surcharge argumentative &#187; les lecteurs font confiance au texte ? 
</p>
<p>4 Conclusion 
Notre travail se donne pour objectif de faire fonctionner dans une m&#234;me architecture divers 
moyens inf&#233;rentiels et linguistiques dans le but de reproduire une forme fondamentale de 
l'argumentation, utilis&#233;e par les humains au quotidien, et qui consiste &#224; d&#233;crire une situation 
de la mani&#232;re qui soit la plus favorable possible par rapport &#224; un protagoniste donn&#233;. 
</p>
<p>Ce travail se distingue donc significativement de beaucoup d'autres travaux sur 
l'argumentation. En IA on a tendance &#224; se pencher sur des mod&#232;les tr&#232;s abstraits qui ont peu &#224; 
voir avec l'argumentation telle qu'elle est pratiqu&#233;e dans la vie quotidienne. Cependant, ces 
travaux apportent aux approches informelles qui, elles, sont plus proches de l'argumentation 
humaine, une certaine rigueur m&#233;thodologique et informatique qui peut avoir beaucoup 
d'int&#233;r&#234;t sur le chemin de la reproduction des diverses formes du raisonnement de sens 
commun. En pragmatique, les travaux sont plus proches de la r&#233;alit&#233;, mais ils ne visent pas la 
production de textes sous des contraintes pr&#233;cises. 
</p>
<p>Ce papier pr&#233;sente trois techniques argumentatives que nous utilisons dans un syst&#232;me de 
g&#233;n&#233;ration de descriptions argument&#233;es pour un accident de la route, la technique 
d&#8217;insinuation, de justification et de normes coutumi&#232;res. Ces techniques ne sont pas d&#233;di&#233;es 
seulement aux situations li&#233;es aux accidents de la route et peuvent &#234;tre utilis&#233;es facilement 
dans d&#8217;autres domaines ou l&#8217;argumentation est n&#233;cessaire, notamment, en pr&#233;sence de 
situations anormales et inattendues. 
</p>
<p>                                                 
</p>
<p>3
   SMODELS travaille sur le r&#233;sultat d&#8217;un autre logiciel : LPARSE qui entre autres instancie les variables 
</p>
<p>afin de produire des r&#232;gles propositionnelles ; SMODELS et LPARSE sont disponibles sur le Web &#224; 
l&#8217;adresse : http://www.tcs.hut.fi/Software/smodels/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Boutouhami 
</p>
<p>R&#233;f&#233;rences 
AMGOUD, L., PRADE, H. (2007). Arguing about potential causal relations. In: IAF'07.(2007) 
</p>
<p>ANSCOMBRE, J.C. (1995). La nature des topo&#239;. In Th&#233;orie des topo&#239;. Sous la direction de J-C. 
Anscombre. 1995: 49-84. Paris : Editions Kim&#233;. 
</p>
<p>ANSCOMBRE, J.C., O. DUCROT. (1983). L&#8217;argumentation dans la langue. Troisi&#232;me &#233;dition. 
Philosophie et langage. Li&#232;ge : Edition Pierre Mardaga. 
</p>
<p>BOUTOUHAMI S., KAYSER D. (2008). Vers la construction de descriptions argument&#233;es d&#8217;un 
accident de la route : analyse de diverses strat&#233;gies argumentatives. CORELA, volume 6, 
num&#233;ro 1. 
</p>
<p>DUCROT O. (1972). Dire et ne pas dire. Principes de s&#233;mantique linguistique. Paris : 
Hermann. 
</p>
<p>DUCROT O. (1980). Les &#201;chelles Argumentatives. Paris : &#201;ditions de Minuit. 
DUCROT, O. (1995). Topo&#239; et formes topiques. In Th&#233;orie des topo&#239;. Sous la direction de J-
C.Anscombre. : 85-99. Paris : Editions Kim&#233;. 
</p>
<p>DUNG P.M. (1995). On the acceptability of arguments and its fundamental role in 
nonmonotonic reasoning, logic programming and n-person games. Artificial Intelligence 
Journal, 77(2), pp. 321&#8211;357. 
</p>
<p>GELFOND M., LIFSCHITZ V. (1988). The Stable Model Semantics for logic programming. In 
Proceedings of the 5th International Conference on Logic Programming. 1070-1080. 
GRIZE J B. (1986). Argumenter et / ou raisonner, Universitade do Porto, Revista da Facultade 
de Letras, Seria de Filosofia, No 3 :1&#8211;12. 
</p>
<p>GRIZE J.B. (1990). Logique et langage. Ophrys, Paris. 
</p>
<p>GUNILLA B. (2005). Driver Interaction: Informal Rules, Irritation and Aggressive Behaviour. 
Digital Comprehensive Summaries of Uppsala Dissertations from the Faculty of Social 
Sciences 8. 
</p>
<p>KERBRAT-ORECCHIONI C. (1986). L&#8217;implicite. Armand Colin, coll. Linguistique. 
</p>
<p>PERELMAN C., OLBRECHTS-TYTECA L. (1985). Trait&#233; de l'argumentation. Paris : Presses 
Universitaires de France. 
</p>
<p>PLANTIN C. (1990). Essais sur l'argumentation. Introduction &#224; l'&#233;tude linguistique de la parole 
argumentative. Paris : &#201;ditions Kim&#233;. 
REITER R., CRISCUOLO G. (1981) : On Interacting Defaults. In Proceedings of the 7th 
International Joint Conference on Artificial Intelligence. 270-276,Vancouver, Canada. 
TAL, (1994). Num&#233;ro sp&#233;cial : Approches s&#233;mantiques. Traitement automatique des langues 
35(1). 
</p>
<p>TOULMIN S.E.(1985). The Uses of Argument. Cambridge University Press, Cambridge, UK. </p>

</div></div>
</body></html>