<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mod&#233;lisation des mouvements explicites dans les ACG avec le produit d&#233;pendant</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2009, Senlis, 24&#8211;26 juin 2009
</p>
<p>Mod&#233;lisation des mouvements explicites dans les ACG avec le
produit d&#233;pendant
</p>
<p>Florent Pompigne1
</p>
<p>(1) ENS Cachan / INRIA Nancy - Grand-Est
florent.pompigne@loria.fr
</p>
<p>Abstract. Abstract Categorial Grammars (ACG) is a grammatical framework based on li-
near lambda-calculus. As in Muskens&#8217; Lambda Grammars, an abstract term in this kind of cate-
gorial grammar can be realized in different directions, such as syntactic and semantic ones. This
structure provides autonomy for these different processings. ACG&#8217;s architecture is independent
from the logic used and so the type system is easily extensible in order to deal better with some
linguistic phenomena. We will first introduce ACGs and the dependent product construction
.This paper will then be concerned with the issue of overt grammatical movements, in particu-
lar extraction constraints in relative propositions, and how several close frameworks deal with
it. Last we will show how to capture this phenomenon in extended ACG.
</p>
<p>Mots-cl&#233;s : syntaxe, grammaires cat&#233;gorielles abstraites, types d&#233;pendant, mouvements
explicites, extraction.
</p>
<p>Keywords: Syntax, abstract categorial grammars, dependant product, overt movements,
extraction.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florent Pompigne
</p>
<p>1 Introduction
</p>
<p>La description de la syntaxe d&#8217;une langue naturelle et de la relation entre ce niveau syntaxique et
le niveau s&#233;mantique est traditionnellement op&#233;r&#233;e en Traitement Automatique des Langues par
un formalisme grammatical. Les Grammaires Cat&#233;gorielles Abstraites (ACG), propos&#233;es par de
Groote (de Groote, 2001), se distinguent dans le paysage des formalismes existants par des
propri&#233;t&#233;s h&#233;rit&#233;es des grammaires cat&#233;gorielles (sensibilit&#233; aux ressources) et des propri&#233;t&#233;s
propres &#224; leur architecture : elles s&#8217;appuient sur un langage abstrait, dont les termes corres-
pondent &#224; des structures de d&#233;rivation, et un langage objet dont les termes correspondent aux
structures d&#233;riv&#233;es.
</p>
<p>Les mouvements grammaticaux explicites d&#233;signent les d&#233;placements qui ont lieu dans des
constructions comme les formes interrogatives ou les propositions relatives par rapport aux
phrases correspondantes. L&#8217;extraction d&#8217;un composant de la phrase par ces constructions peut
s&#8217;effectuer &#224; distance arbitraire, et selon des contraintes pr&#233;cises de la langue qui sont bien &#233;tu-
di&#233;es et transcrites dans de nombreux formalismes grammaticaux. Le propos de cet article est
de pr&#233;senter une mod&#233;lisation de ce ph&#233;nom&#232;ne pour les ACG.
</p>
<p>Dans la partie suivante on introduira le formalisme des ACG ainsi que l&#8217;extension du syst&#232;me
de type avec le produit d&#233;pendant. Dans la partie 3 sera pr&#233;sent&#233; le probl&#232;me des mouvements
explicites, &#224; travers les contraintes &#224; l&#8217;extraction dans les constructions relative en fran&#231;ais, et
les r&#233;ponses apport&#233;es dans plusieurs formalismes voisins, et la partie 4 d&#233;taillera la solution
propos&#233;e pour les ACG.
</p>
<p>2 Grammaires Cat&#233;gorielles Abstraites
</p>
<p>Avec une approche similaire aux Lambda Grammars (Muskens, 2007) ou aux Convergent
Grammars (Pollard, 2007) , (Pollard, 2008), chaque ACG introduit une fonction d&#8217;un espace
de termes dits abstraits vers un espace de termes objets. Ces termes objets peuvent repr&#233;senter
diff&#233;rentes structures de donn&#233;es utilis&#233;es en traitement automatique des langues, comme des
arbres ou des cha&#238;nes de caract&#232;re, et on choisit donc de les construire sur le &#955;-calcul lin&#233;aire.
</p>
<p>2.1 Architecture du formalisme
</p>
<p>Intuitivement, une ACG consiste en deux signatures, appel&#233;es vocabulaire abstrait et vocabu-
laire objet, qui d&#233;clarent des types et des constantes typ&#233;es dans le fragment implicatif de la
logique lin&#233;aire, et d&#8217;un homomorphisme, appel&#233; lexique, de la premi&#232;re vers la seconde. Une
Grammaire Cat&#233;gorielle Abstraite g&#233;n&#232;re deux langages, un langage abstrait et un langage ob-
jet. Le langage abstrait est d&#233;fini comme l&#8217;ensemble des &#955;-termes lin&#233;aires (chaque abstraction
lie une unique variable) clos construits sur le vocabulaire abstrait qui sont du type sp&#233;cifique S.
Le langage objet est alors l&#8217;image du langage abstrait par le lexique.
</p>
<p>Cette architecture permet &#224; l&#8217;aide de deux ACG partageant un m&#234;me langage abstrait (corres-
pondant au niveau tectogrammatique) de r&#233;aliser ces termes abstraits vers un langage d&#233;crivant</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des mouvements explicites dans les ACG avec le produit d&#233;pendant
</p>
<p>leur s&#233;mantique et un langage d&#233;crivant leur forme de surface (correspondant au niveau ph&#233;-
nogrammatique). Nous ne nous int&#233;ressons uniquement dans ce papier &#224; la description de la
syntaxe et donc &#224; la relation entre tectogrammatique et ph&#233;nogramatique. Donnons un exemple
d&#8217;une telle ACG :
</p>
<p>N, NP, S : type (vocabulaire abstrait)
hommec, villagec, amic : N
joyeuxc : N( N
unc, lec : N( NP
dormirc : NP( S
aimerc, rencontrerc : NP( NP( S
Jeanc, Mariec, Paulc : NP
dec : NP( N( N
</p>
<p>string : type (vocabulaire objet)
homme, joyeux, un, ... : string
</p>
<p>N, NP, S &#8722;&#8594; string (lexique)
hommec &#8722;&#8594; homme
joyeuxc &#8722;&#8594; &#955;x.x+ joyeux
unc &#8722;&#8594; &#955;x.un+ x
dormirc &#8722;&#8594; &#955;x.x+ dort
aimerc &#8722;&#8594; &#955;x, y.y + aime+ x
Jeanc &#8722;&#8594; Jean
dec &#8722;&#8594; &#955;x, y.y + de+ x
</p>
<p>(on note par &quot;+&quot; l&#8217;op&#233;ration de concat&#233;nation des cha&#238;nes de caract&#232;re)
On peut v&#233;rifier que le terme suivant appartient au langage abstrait
</p>
<p>rencontrerc
</p>
<p>NP&#65079; &#65080;&#65080; &#65079;
(unc (dec Mariec amic)&#65080; &#65079;&#65079; &#65080;
</p>
<p>N
</p>
<p>) Jeanc&#65080; &#65079;&#65079; &#65080;
S
</p>
<p>Son image par le lexique fait donc partie du langage objet
</p>
<p>rencontrerc (unc (dec Mariec amic)) Jeanc
</p>
<p>&#8722;&#8594; (&#955;x, y.y + rencontre+ x) ((&#955;x.un+ x) ((&#955;x, y.y + de+ x) Marie ami)) Jean
</p>
<p>&#8722;&#8594; Jean rencontre un ami de Marie (&#946;-r&#233;duction)
</p>
<p>A l&#8217;inverse, la possibilit&#233; de partir d&#8217;un terme de surface et de d&#233;cider s&#8217;il appartient au langage
d&#8217;une ACG est un probl&#232;me ouvert &#233;quivalent &#224; la d&#233;cidabilit&#233; du fragment exponentiel multi-
plicatif de la logique lin&#233;aire (Salvati, 2005). Cependant, si on se restreint &#224; la classe des ACG du</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florent Pompigne
</p>
<p>second ordre, dans lesquelles les termes du langage abstrait sont de la forme q1( ...( qk ( p
o&#249; les qi sont des types atomiques , ce probl&#232;me de l&#8217;appartenance est d&#233;cidable en temps po-
lynomial.
</p>
<p>2.2 Extension par les produits d&#233;pendants
</p>
<p>L&#8217;architecture des ACG ne d&#233;pend pas de la logique sur laquelle elles reposent. Contrairement
aux autres constructions propos&#233;es par Philippe de Groote et Sarah Maarek (de Groote &amp; Maa-
rek, 2007)(implication non lin&#233;aire, produit cart&#233;sien, union disjointe et type unit) pour &#233;tendre
le syst&#232;me de type, le produit d&#233;pendant ne correspond pas &#224; une primitive de la logique li-
n&#233;aire. Il vient de la th&#233;orie intuitionniste des types de Martin-L&#246;f (Martin-L&#246;f, 1973) et a &#233;t&#233;
utilis&#233; dans le contexte de la logique lin&#233;aire par Cervesato et Pfenning (Cervesato &amp; Pfenning,
2002). Le produit d&#233;pendant permet d&#8217;introduire des types qui d&#233;pendent de termes. Le forma-
lisme ainsi &#233;tendu est Turing-complet, et le probl&#232;me de l&#8217;appartenance est donc ind&#233;cidable
(de Groote et al., 2007). Il reste &#224; &#233;tudier quels fragments utilisant le pouvoir d&#8217;expression ainsi
gagn&#233; restent d&#233;cidables. Cet exemple montre comment utiliser les types d&#233;pendants pour ins-
tancier un groupe nominal par son genre.
</p>
<p>gender = {m, f} : type (vocabulaire abstrait)
NP,N : (gender) type
S : type
</p>
<p>villagec : Nm
villec : N f
unc : (&#928;x : gender) N x( NP x
joyeuxc : (&#928;x : gender) N x( N x
dormirc : (&#928;x : gender) NP x( S
</p>
<p>gender = {m, f} : type (vocabulaire objet)
string : type
ville joyeux, joyeuse, un, une, ... : string
</p>
<p>gender &#8722;&#8594; gender
N, NP &#8722;&#8594; &#955;x.string (lexique)
S &#8722;&#8594; string
villec &#8722;&#8594; ville
villagec &#8722;&#8594; village
unc &#8722;&#8594; &#955;g. &#955;x. {m&#8594; un, f &#8594; une} g + x
joyeuxc &#8722;&#8594; &#955;g. &#955;x. x+ {m&#8594; joyeux, f &#8594; joyeuse} g
dormirc &#8722;&#8594; &#955;g. &#955;x. x+ dort
</p>
<p>On peut v&#233;rifier que le terme suivant appartient au langage abstrait.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des mouvements explicites dans les ACG avec le produit d&#233;pendant
</p>
<p>dormirc f
</p>
<p>NP f&#65079; &#65080;&#65080; &#65079;
(unc f (joyeuxc f villec)&#65080; &#65079;&#65079; &#65080;
</p>
<p>N f
</p>
<p>)
</p>
<p>&#65080; &#65079;&#65079; &#65080;
S
</p>
<p>On en d&#233;duit que son image par le lexique appartient au langage objet
</p>
<p>dormirc f (unc f (joyeuxc f villec))
</p>
<p>&#8722;&#8594; une ville joyeuse dort
</p>
<p>3 Mouvements grammaticaux explicites
</p>
<p>Les mouvements grammaticaux explicites sont ceux visibles au niveau de surface du langage :
ce sont les extractions de constituants syntaxiques par des constructions comme les interroga-
tives en qu, les relatives, ou les semi-cliv&#233;es en fran&#231;ais. On s&#8217;interessera ici &#224; la mod&#233;lisa-
tion des contraintes d&#8217;extraction par les constructions relatives dans la langues fran&#231;aise, ces
contraintes &#233;tant tr&#232;s proches pour les autres mouvements explicites (Abeill&#233;, 2002).
</p>
<p>3.1 Propositions relatives en fran&#231;ais dans les ACG
</p>
<p>Dans les ACG le pronom relatif sujet qui serait repr&#233;sent&#233; au niveau abstrait par le terme
</p>
<p>quic : (NP( S)( N( N
</p>
<p>Le premier argument correspond &#224; la suite de la proposition relative : c&#8217;est une phrase &#224; laquelle
il manque un sujet. Le second argument correspond au nom compl&#233;t&#233; par cette proposition.
L&#8217;image de cette constante par le lexique serait alors : &#955;S. &#955;n. n + qui + (S &#15;). On peut par
exemple v&#233;rifier que la phrase suivante appartient au langage objet de surface :
</p>
<p>dormirc (lec (quic (&#955;x.aimerc Mariec x) hommec))
</p>
<p>&#8722;&#8594; l&#8242;homme qui aime Marie dort
</p>
<p>Il faut noter que le syst&#232;me de type, contrairement &#224; la tradition des grammaires cat&#233;gorielles,
n&#8217;op&#232;re aucun contr&#244;le sur l&#8217;ordre des mots dans les ACG. Cet ordre des mots est g&#233;r&#233; par le
lexique. On n&#8217;a donc pas ici de probl&#232;me &#224; g&#233;n&#233;rer des extractions non-p&#233;riph&#233;riques (l&#8217;homme
que Marie aime passionnement dort) ou &#224; distance arbitraire (l&#8217;homme que Jean dit que Pierre
croit que Marie aime dort). D&#8217;un autre c&#244;t&#233;, sans contr&#244;le sur la construction de nos termes
abstraits, on rencontre plusieurs ph&#233;nom&#232;nes de surg&#233;n&#233;ration. Le premier est li&#233; &#224; l&#8217;absence
de contraintes sur le r&#244;le du constituant grammatical extrait. Rien n&#8217;emp&#234;che en effet de recon-
na&#238;tre l&#8217;homme qui Marie aime dort de mani&#232;re similaire &#224; l&#8217;exemple initial. L&#8217;autre contrainte</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florent Pompigne
</p>
<p>qui doit &#234;tre prise en compte est l&#8217;existence d&#8217;&#238;lots d&#8217;extraction &#224; l&#8217;int&#233;rieur desquels l&#8217;extrac-
tion est impossible depuis l&#8217;ext&#233;rieur. Les propositions relatives elle-m&#234;mes sont un exemple
d&#8217;&#238;lot d&#8217;extraction, et en effet L&#8217;homme que ma soeur qui aime dort ne devrait pas &#234;tre reconnu
comme une phrase de la langue fran&#231;aise. Pourtant le terme
</p>
<p>le (que (&#955;x.dormir (ma (qui (&#955;y.aime x y) soeur))) homme)
</p>
<p>fait bien partie de notre langage abstrait. Les propositions compl&#233;tives ne sont, elles, des &#238;lots
que pour l&#8217;extraction de sujet : l&#8217;homme qui Marie crois que vient est grammaticalement incor-
rect.
</p>
<p>3.2 Le probl&#232;me dans quelques autres formalismes
</p>
<p>Les ph&#233;nom&#232;nes d&#8217;extraction ont &#233;t&#233; consid&#233;r&#233;s sous de nombreux angles diff&#233;rents. Exami-
nons rapidement les solutions adopt&#233;es dans quelques formalismes voisins aux ACG.
</p>
<p>Les Tree Adjoining Grammars permettent de bien rendre compte du ph&#233;nom&#232;ne (Abeill&#233;, 2002).
Le sch&#233;ma de formation des arbres &#233;l&#233;mentaires &#224; compl&#233;ment relativis&#233; modifie les arbres &#224; ra-
cine phrastique pour placer le compl&#233;ment en t&#234;te de phrase avec un trait &lt;qu&gt;. Ce compl&#233;ment
pouvait se trouver &#224; profondeur arbitraire dans l&#8217;arbre initial puisqu&#8217;il apparait sur le sch&#233;ma
sous un lien de dominance sous-sp&#233;cifi&#233;. Dans le cas d&#8217;une proposition relative, l&#8217;arbre obtenu
est domin&#233; par un noeud de cat&#233;gorie N qui domine un autre noeud de cat&#233;gorie N d&#233;crivant
l&#8217;ant&#233;c&#233;dent. Dans tous les cas un noeud interm&#233;diaire phrastique est ajout&#233; : il permet avec
l&#8217;op&#233;rateur d&#8217;adjonction d&#8217;ajouter un nombre arbitraire de constructions comme Marie croit
que. L&#8217;extraction du sujet est trait&#233;e de mani&#232;re similaire mais distincte.
</p>
<p>Dans les grammaires d&#8217;interaction, chaque pronom relatif est d&#233;crit par un arbre dans lequel
le compl&#233;ment extrait apparait mais est morphologiquement vide. Cette trace du compl&#233;ment
pourra donc &#234;tre unifi&#233;e avec les autres arbres o&#249; le compl&#233;ment est d&#233;crit, mais elle n&#8217;apparaitra
pas en surface. Afin de permettre une d&#233;pendance &#224; distance arbitraire entre le pronom relatif et
le compl&#233;ment extrait, la trace est surmont&#233;e d&#8217;une relation de d&#233;pendance sous-sp&#233;cifi&#233;e. Ce-
pendant, pour bloquer la travers&#233;e d&#8217;&#238;lots d&#8217;extraction, cette relation est contr&#244;l&#233;e : elle ne peut
franchir que des noeuds &#233;tiquet&#233;s S et de fonction objet ou nulle (contraintes satisfaites par que
Marie aime par exemple). L&#8217;arbre d&#233;crivant le pronom relatif sujet se distingue par l&#8217;absence de
trace : le pronom assure la fonction de sujet. (Perrier, 2007).
</p>
<p>Les grammaires cat&#233;gorielles s&#8217;appuient traditionnellement sur le calcul de Lambek. Le connec-
teur implicatif est double : le / prend son argument directement &#224; sa droite et le \ directement &#224;
sa gauche. L&#8217;ordre des mots est donc g&#233;r&#233; dans le syst&#232;me de type. Ce syst&#232;me est trop rigide
pour les constructions relatives puisqu&#8217;il emp&#234;che les extractions non-p&#233;riph&#233;riques : l&#8217;argu-
ment d&#8217;un pronom relatif est une phrase &#224; laquelle il manque un constituant &#224; sa droite ou &#224;
sa gauche seulement. Une possibilit&#233; est d&#8217;ajouter un constructeur &#8593; et sa r&#232;gle d&#8217;introduction,
A&#8593;B &#233;tant le type d&#8217;un terme qui compl&#233;t&#233; quelque part d&#8217;un terme de type B serait de type A.
On peut alors donner au pronom qui le type N\N/(S&#8593;NP). On retrouve &#224; ce moment la m&#234;me</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des mouvements explicites dans les ACG avec le produit d&#233;pendant
</p>
<p>surg&#233;n&#233;ration que dans les ACG. La mod&#233;lisation des &#238;lots d&#8217;extraction peut se faire &#224; l&#8217;aide de
constructeurs modaux rattach&#233;s &#224; l&#8217;extracteur et &#224; la trace qui doivent se combiner tandis que
les &#238;lots d&#8217;extraction jouent le r&#244;le de portes verrouill&#233;es &#224; ces constructeurs (Moortgat, 1996) ,
(Carpenter, 1997). C&#8217;est &#233;galement l&#8217;approche pr&#233;sente dans les Lambda Grammars (Muskens,
2007). On verra que c&#8217;est de cette technique qu&#8217;on s&#8217;approchera le plus.
</p>
<p>Dans les Convergent Grammars, les pronoms relatifs (et les autres constituants op&#233;rant des
mouvements explicites) sont affect&#233;s d&#8217;une cat&#233;gorie sp&#233;ciale G[A,B,C] indiquant que ce terme
se combine avec un terme de cat&#233;gorie A contenant une variable libre de type B et renvoie un
terme de type C tout en liant cette trace. Cette cat&#233;gorie sp&#233;ciale permet de ne construire aucun
terme par lambda-abstraction. Il suffit donc de v&#233;rifier que des variables libres ne sortent pas
des &#238;lots d&#8217;extraction.
</p>
<p>4 Mod&#233;lisation des contraintes d&#8217;extraction dans les ACG
&#233;tendues
</p>
<p>Le syst&#232;me de type &#233;tendu va nous permettre de contr&#244;ler la construction des termes du langage
abstrait dans le respect des contraintes de la langue. Le premier terme dont doivent d&#233;pendre
les types de nos constantes est un marqueur de cas, qui v&#233;rifiera le r&#244;le des constituants extraits
(comme on ne s&#8217;int&#233;resse ici qu&#8217;&#224; la signature abstraite on omettra d&#8217;indicer chaque nom de
constantes par c).
</p>
<p>cas = {nom, acc, gen, comp} : type
NP, N : (cas) type
S : type
Jean, Marie, Paul, Laurent : (&#928;c : cas) NP c
chien, maison, homme : (&#928;c : cas) N c
un, le : (&#928;c : cas) N c( NP c
aimer, rencontrer : NP acc( NP nom( S
dormir : NP nom( S
qui : (&#928;c : cas) (NP nom( S)( NP c( NP c
</p>
<p>La phrase suivante n&#8217;appartient plus au langage : aimer contraint la variable x &#224; prendre comme
argument le cas acc, et qui le cas nom. Le terme ne peut donc pas &#234;tre typ&#233;.
</p>
<p>dormirc (lec nom (quic (&#955;x.aimerc x acc Mariec nom) hommec nom))
</p>
<p>&#8722;&#8594; l&#8242;homme qui Marie aime dort
</p>
<p>On introduit un autre marqueur, de type ext pour extraction. L&#8217;id&#233;e est que les pronoms relatifs
forcent les propositions relatives &#224; &#233;tiqueter la variable trace de l&#8217;extraction par ce marqueur &#224;
0. Ce marqueur est propag&#233; aux niveaux syntaxiques sup&#233;rieurs mais ne peut pas franchir les
&#238;lots d&#8217;extraction. Il reste alors au pronom relatif de contr&#244;ler que la proposition relative est bien
&#233;tiquet&#233;e par 0. Une troisi&#232;me valeur du marqueur permet d&#8217;indiquer qu&#8217;un &#238;lot &#224; l&#8217;extraction</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florent Pompigne
</p>
<p>de sujet a &#233;t&#233; franchit. Cette valeur interm&#233;diaire sera donc &#233;galement accept&#233;e par tous les
pronoms sauf le qui extracteur de sujet.
</p>
<p>ext = {0, 1, 2} : type
NP : (ext) (cas) type
N : (ext) (cas) type
S : (ext) type
S* : (ext) type
chien,maison, homme : (&#928;c : cas) N 2 c
un, le,mon :(&#928;c : cas) N 2 c( NP 2 c
marcher, dormir :(&#928;y : ext) NP y nom( S y
aimer, rencontrer :(&#928;y1, y2 : ext) NP y1 acc( NP y2 nom( S min (y1 y2)
qui :(&#928;c : cas) (NP 0 nom( S 0)( N 2 c( N 2 c
que :(&#928;y : ext, c : cas) (NP 0 acc( S y &#8722; 1)( N 2 c( N 2 c
que&#8242; :(&#928;y : ext) S y( S &#8727; max(y, 1)
(je crois *que* l&#8217;id&#233;e est bonne)
croire, dire :(&#928;y1, y2 : ext)S &#8727; y1( NP y2 nom( Smin (y1 y2)
</p>
<p>On peut v&#233;rifier que ce terme n&#8217;est plus typ&#233; par la grammaire : (on omet d&#8217;&#233;crire les termes du
produit d&#233;pendant pour une meilleure lecture)
</p>
<p>L&#8217;homme que ma soeur qui aime dort
le (que (&#955;x.dormir (ma (qui (&#955;y.aime x y) soeur))) homme)
</p>
<p>En effet les deux variables qui jouent le r&#244;le de traces x et y doivent porter le marqueur 0 (exi-
gence du type des pronoms relatifs). Ce marqueur va &#234;tre consomm&#233; par le qui, et le marqueur
d&#8217;extraction qui arrivera au que ne pourrait &#234;tre que 2, ce qui rend le terme intypable. A l&#8217;inverse
le terme suivante reste toujours typable :
</p>
<p>L&#8217;homme que ma soeur qui dort aime
</p>
<p>le (que (&#955;x.
</p>
<p>S 0&#65079; &#65080;&#65080; &#65079;
aime x&#65080;&#65079;&#65079;&#65080;
</p>
<p>NP 0 acc
</p>
<p>(ma (qui (&#955;y.
</p>
<p>S 0&#65079; &#65080;&#65080; &#65079;
dort y&#65080;&#65079;&#65079;&#65080;
</p>
<p>NP 0 nom
</p>
<p>) soeur))
</p>
<p>&#65080; &#65079;&#65079; &#65080;
N 2 nom
</p>
<p>) homme))
</p>
<p>&#65080; &#65079;&#65079; &#65080;
N 2 c
</p>
<p>Enfin, on v&#233;rifie que ce groupe nominal n&#8217;est plus typable :
</p>
<p>Pierre qui je crois que vient
qui2(&#955;x.croire (que
</p>
<p>&#8242;(venir x))&#65080; &#65079;&#65079; &#65080;
S &#8727; 1
</p>
<p>)je)
</p>
<p>&#65080; &#65079;&#65079; &#65080;
NP 0 nom(S 1
</p>
<p>Pierre
</p>
<p>Le marqueur 0 de la variable trace devient 1 en passant par le je crois que. Le terme r&#233;sultant
n&#8217;a donc pas le bon type pour &#234;tre argument de qui.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation des mouvements explicites dans les ACG avec le produit d&#233;pendant
</p>
<p>Pierre que je crois que Marie aime
</p>
<p>a la m&#234;me forme de d&#233;rivation de type, &#224; la diff&#233;rence de que qui, lui, accepte ce type pour son
argument.
</p>
<p>Ce contr&#244;le s&#8217;&#233;tend ais&#233;ment aux autres pronoms relatifs et aux autres &#238;lots d&#8217;extraction, comme
les si ou les propositions infinitives. Les &#238;lots lexicalis&#233;s, comme le verbe hurler ne posent pas
plus de probl&#232;mes. De plus les autres ph&#233;nom&#232;nes de mouvements explicites (interrogatives
en qu, semi-cliv&#233;es) peuvent utiliser le m&#234;me marqueur et la m&#234;me structure de contr&#244;le. No-
tons enfin que l&#8217;on pourrait avoir d&#233;multipli&#233; les entr&#233;es lexicales plut&#244;t qu&#8217;utiliser les types
d&#233;pendants, on est donc rest&#233; dans un fragment r&#233;versible des ACG.
</p>
<p>5 Conclusion
</p>
<p>Un atout des ACG est de proposer directement un contr&#244;le sur les structures de d&#233;rivations, qui
constituent notre langage abstrait. Il est ainsi possible de mod&#233;liser des ph&#233;nom&#232;nes linguis-
tiques sans quitter le formalisme ni le lambda-calcul typ&#233;. Cette technique de mod&#233;lisation des
contraintes &#224; l&#8217;extraction propose une illustration pratique des possibilit&#233;s offertes par l&#8217;exten-
sion du syst&#232;me de type des ACG.
</p>
<p>D&#8217;autres ph&#233;nom&#232;nes de d&#233;placement peuvent &#234;tre mod&#233;lis&#233;s selon le m&#234;me sch&#233;ma. En par-
ticulier, les mouvements grammaticaux implicites, qui sont visibles au niveau de la r&#233;alisation
s&#233;mantique, pr&#233;sentent des caract&#233;ristiques proches des mouvements pr&#233;sent&#233;s dans cet article,
sur la nature des extractions (op&#233;r&#233;es dans ce cas par les prises de port&#233;e des quantificateurs)
comme sur celle des &#238;lots d&#8217;extraction (Ruys &amp; Winter, 2008).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A. (2002). Une grammaire &#233;lectronique du fran&#231;ais. CNRS Editions.
CARPENTER B. (1997). Type-Logical Semantics. The MIT Press.
CERVESATO I. &amp; PFENNING F. (2002). A linear logical framework. Information and Com-
putation, 179(1), 19&#8211;75.
DE GROOTE P. (2001). Towards abstract categorial grammars. In Association for Computa-
tional Linguistics, 39th Annual Meeting and 10th Conference of the European Chapter, Pro-
ceedings of the Conference, p. 148&#8211;155.
DE GROOTE P. &amp; MAAREK S. (2007). Type-theoretic extensions of abstract categorial gram-
mars. In New Directions in Type-Theoretic Grammars, proceedings of the workshop, p. 18&#8211;30.
DE GROOTE P., YOSHINAKA R. &amp; MAAREK S. (2007). On two extensions of abstract cate-
gorial grammars. In N. DERSHOWITZ &amp; A. VORONKOV, Eds., Logic for Programming, Arti-
ficial Intelligence, and Reasoning, 14th International Conference, LPAR 2007, Yerevan, Arme-
nia, October 15-19, 2007, Proceedings, volume 4790 of Lecture Notes in Computer Science,
p. 273&#8211;287 : Springer.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florent Pompigne
</p>
<p>MARTIN-L&#214;F P. (1973). An intuitionistic theory of types : Predicative part. In F.ROSE &amp;
J.SHEPERDSON, Eds., Logic Colloquium &#8217;73, p. 73&#8211;118.
</p>
<p>MOORTGAT M. (1996). Categorial type logics. In J. VAN BENTHEM &amp; A. TER MEULEN,
Eds., Handbook of Logic and Language, p. 93&#8211;177. Amsterdam : Elsevier Science Publishers.
</p>
<p>MUSKENS R. (2007). Separating syntax and combinatorics in categorial grammar. Research
on language and computation.
</p>
<p>PERRIER G. (2007). A french interaction grammar. In 6th International Conference on Recent
Advances in Natural Language Processing, Borovets, Bulgaria, 2007., p. 463&#8211;467.
</p>
<p>POLLARD C. (2007). The logic of pied-piping. Presentation at the Colloquium in Honour of
Alain Lecomte.
</p>
<p>POLLARD C. (2008). An introduction to convergernt grammar. Presentation at Calligramme
Seminar.
</p>
<p>RUYS E. &amp; WINTER Y. (2008). Quantifier scope in formal linguistics. To appear in D. Gabbay
(ed.), Handbook of Philosophical Logic - Second Edition.
</p>
<p>SALVATI S. (2005). Probl&#232;mes de filtrage et probl&#232;mes d&#8217;analyse pour les grammaires cat&#233;-
gorielles abstraites. PhD thesis, Institut National Polytechnique de Lorraine.</p>

</div></div>
</body></html>